{"poster":"Slyfor","date":"2016-04-28T03:13:10.008+0000","title":"why does riot ban the innocent players","subforum":"Player Behavior","up_votes":3,"down_votes":37,"body":"i get flamed for being 0/1/1 by the jgler and the mid and they perma ban me\r\ni said nothing offensive in return and this is my third banned account \r\nRIOT IS FULL OF THIEVES WHO STOLE MY MONEY \r\nhow can you make me pay for something and then be able to ban my account to where i cant even gift my skins\r\ni put over 300 dollars on these three accounts and this is what i get for it\r\nPerma Bans because of toxic players","replies":[{"poster":"EndlessSorcerer","date":"2016-04-28T03:18:48.834+0000","up_votes":11,"down_votes":1,"body":"They don't.\n\nThey ban the toxic players who (in their ignorance and arrogance) believe they are innocent.","replies":[{"poster":"x Azazel x","date":"2016-04-28T03:25:20.979+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"EvilDustMan","date":"2016-04-28T03:27:58.975+0000","up_votes":15,"down_votes":1,"body":"> [{quoted}](name=x Azazel x,realm=NA,application-id=ZGEFLEUQ,discussion-id=EUKwfFNl,comment-id=00040000,timestamp=2016-04-28T03:25:20.979+0000)\n>\n> ARE YOU ON YOUR KNEES FOR THEM RGHT NOW\n> MAYBE SUCC THE DICC A BIT HARDER MAKE RIOT CUM ALL OVER YOU\n\nThis.\n\nThis is why you get banned.","replies":[]},{"poster":"EndlessSorcerer","date":"2016-04-28T03:27:14.500+0000","up_votes":9,"down_votes":1,"body":"> [{quoted}](name=x Azazel x,realm=NA,application-id=ZGEFLEUQ,discussion-id=EUKwfFNl,comment-id=00040000,timestamp=2016-04-28T03:25:20.979+0000)\n>\n> ARE YOU ON YOUR KNEES FOR THEM RGHT NOW\n> MAYBE SUCC THE DICC A BIT HARDER MAKE RIOT CUM ALL OVER YOU\n\nAnd you can't figure out why you have gotten banned multiple times?\n\nThat's a nice snippet of what you seem to view as acceptable behaviour, right there.","replies":[]}]}]},{"poster":"Deep Terror Nami","date":"2016-04-28T03:16:17.301+0000","up_votes":11,"down_votes":2,"body":"Being banned 3 times probably means you are being consistently negative but think it's ok, for whatever justification you might have. Share your reform card(s) and we can go over them and possible give some insight as to why they resulted in punishment.","replies":[{"poster":"x Azazel x","date":"2016-04-28T03:26:52.415+0000","up_votes":2,"down_votes":17,"body":"I WANT MY MONEY BRAH FUCC INSIGHT IMA PUT RIOT OUT OF BUSINESS WHEN I GET INTO THE GAME INDUSTRY MARK MY FUCKING WORDS","replies":[{"poster":"Kei143","date":"2016-04-28T11:46:47.609+0000","up_votes":4,"down_votes":1,"body":"i think you'll be fired in no time when you get into the industry.\n\nyou can try starting your own, but no one will treat you seriously.","replies":[]}]}]},{"poster":"Riot Tantram","date":"2016-04-28T20:38:13.315+0000","up_votes":7,"down_votes":1,"body":"Post your chat logs and I'll take a look.","replies":[{"poster":"GRVet3ran0sS","date":"2016-04-28T21:00:12.610+0000","up_votes":2,"down_votes":6,"body":"The following chat logs resulted in a permanent ban.The other game happened prior to 14 day suspension.\nFirst,i got outplayed thats why i spammed for the laughs like I have seen a couple streamers do it since it was a normal game.Also the poppy was support in that game.\n\n[2:17] [All] GRVet3ran0sS (Tahm Kench): cnidwef\n[2:18] GRVet3ran0sS (Tahm Kench): Wfr|?e\n[2:18] [All] GRVet3ran0sS (Tahm Kench): cWECSwda\n[2:18] [All] GRVet3ran0sS (Tahm Kench): Fqae\n[2:18] [All] GRVet3ran0sS (Tahm Kench): fqaes\n[2:19] [All] GRVet3ran0sS (Tahm Kench): fqawd\n[2:19] [All] GRVet3ran0sS (Tahm Kench): fcaed\n[2:19] [All] GRVet3ran0sS (Tahm Kench): \"AFWES\n[2:19] [All] GRVet3ran0sS (Tahm Kench): QWFD\n[2:20] GRVet3ran0sS (Tahm Kench): ./all\n[2:49] [All] GRVet3ran0sS (Tahm Kench): FCKIN\n[2:50] [All] GRVet3ran0sS (Tahm Kench): LUCKER\n[2:51] [All] GRVet3ran0sS (Tahm Kench): LUCK\n[5:02] GRVet3ran0sS (Tahm Kench): poppy 0 gnaks\n[5:03] GRVet3ran0sS (Tahm Kench): reported\n[6:21] [All] GRVet3ran0sS (Tahm Kench): open top\n[6:22] [All] GRVet3ran0sS (Tahm Kench): cya\n[14:45] GRVet3ran0sS (Tahm Kench): jesus that riven is fed\n[20:51] GRVet3ran0sS (Tahm Kench): we got this guys\n[20:55] GRVet3ran0sS (Tahm Kench): tryhard till the ned\n[20:57] GRVet3ran0sS (Tahm Kench): end\n[21:51] [All] GRVet3ran0sS (Tahm Kench): omg ks\n[22:13] [All] GRVet3ran0sS (Tahm Kench): cause u ks\n[24:22] GRVet3ran0sS (Tahm Kench): plat poppy ahahahah\n[29:21] GRVet3ran0sS (Tahm Kench): i backdoor\n[29:24] GRVet3ran0sS (Tahm Kench): stop tps\n[30:32] [All] GRVet3ran0sS (Tahm Kench): i know\n[30:35] [All] GRVet3ran0sS (Tahm Kench): mine is 2\n[32:11] GRVet3ran0sS (Tahm Kench): isxuei\n[35:54] GRVet3ran0sS (Tahm Kench): koubalaw\n[36:59] [All] GRVet3ran0sS (Tahm Kench): Ez\n[37:15] [All] GRVet3ran0sS (Tahm Kench): ye\n[37:16] GRVet3ran0sS (Tahm Kench): thx","replies":[{"poster":"C9 Blizzard","date":"2016-04-29T01:25:22.638+0000","up_votes":1,"down_votes":1,"body":"believe he meant for slyfor to post his chat log lol ._.","replies":[{"poster":"GRVet3ran0sS","date":"2016-04-29T09:08:01.928+0000","up_votes":2,"down_votes":0,"body":"I am also an innocent players.","replies":[]}]},{"poster":"what you deserve","date":"2016-04-28T22:16:30.300+0000","up_votes":1,"down_votes":1,"body":"allchat spamming is toxic","replies":[{"poster":"EcdYs1Ast","date":"2016-04-29T00:37:41.764+0000","up_votes":2,"down_votes":3,"body":"so you received a chat restriction then you got a 14 day ban all for probably worse chat logs than the one you posted and you really wonder why spamming in all chat after being restricted and getting 14 day bans you got permabanned?!!?!?!?!? seriously???? you don't understand why ??!?!?!?!? lets look at your chat log and discuss. so seems you played kench top against a riven and starting getting smashed and fed so you spam all chat as the anger starts to rage so you take it out on the poppy who didn't gank for you to babysit you and keep you from playing like a wood 5 feeder then you proceed to tell the enemy team that top is open and you left top because hey you already fed the riven and cant do nothing and that must be everyone elses fault.  see where this has headed? did I jog your memory as to why this and the fact you have already been chat restricted and banned has now resulted in a permaban for what normally would have prolly only been a chat restriction at most if you had any other like games and logs?","replies":[{"poster":"GRVet3ran0sS","date":"2016-04-29T09:07:35.777+0000","up_votes":2,"down_votes":0,"body":"As i said poppy was support,so it was for the laughs.\nAlso the spam happened only one time when she left with 1 hp. \nAnd it wasn't an angry rage,it was just because she outplayed me.\nI don't understand how these chat logs would normally result in a permanent ban.","replies":[]},{"poster":"what you deserve","date":"2016-04-29T01:27:25.702+0000","up_votes":3,"down_votes":1,"body":"i have no idea what you're saying. use punctuation, holy shit.","replies":[]}]}]}]},{"poster":"70640285DEL1","date":"2016-04-29T00:19:46.848+0000","up_votes":1,"down_votes":0,"body":"Riot Tantrum! Just the wise one I need. Maybe you could help me with this\nhttp://boards.na.leagueoflegends.com/en/c/GD/OtEn3AhK-there-is-a-disconenctlogin-problem-and-i-want-a-loss-forgiven","replies":[]}]},{"poster":"FrankerX","date":"2016-04-28T03:19:59.003+0000","up_votes":6,"down_votes":1,"body":"how does riot steal money when you give it to them on your own free will?","replies":[{"poster":"x Azazel x","date":"2016-04-28T03:26:01.640+0000","up_votes":2,"down_votes":13,"body":"BANNED MY ACCOUNTS WHICH IVE SPENT MONEY ON\nCAN I GET MY MONEY BACC SINCE YOU WONT LET ME PLAY LIKE TF\nTHATS ROBBERY","replies":[{"poster":"FrankerX","date":"2016-04-28T04:05:42.125+0000","up_votes":6,"down_votes":1,"body":"no its robbery if riot says \"give me money or you cant play\" and you pay and still you cant play.","replies":[{"poster":"themachamp","date":"2016-04-28T06:30:53.323+0000","up_votes":2,"down_votes":12,"body":"> [{quoted}](name=FrankerX,realm=EUW,application-id=ZGEFLEUQ,discussion-id=EUKwfFNl,comment-id=000500000000,timestamp=2016-04-28T04:05:42.125+0000)\n>\n> no its robbery if riot says &quot;give me money or you cant play&quot; and you pay and still you cant play.\n\nIt kind of is when you pay for access to something and they take it away without giving anything in return. They are lucky the law hasn't caught up to technology yet lol.","replies":[{"poster":"Sarutobi","date":"2016-04-28T09:12:53.981+0000","up_votes":10,"down_votes":1,"body":"> [{quoted}](name=themachamp,realm=NA,application-id=ZGEFLEUQ,discussion-id=EUKwfFNl,comment-id=0005000000000000,timestamp=2016-04-28T06:30:53.323+0000)\n>\n> It kind of is when you pay for access to something and they take it away without giving anything in return. They are lucky the law hasn&#x27;t caught up to technology yet lol.\n\nYes but you also agree to the terms of service when you want to play. You break that agreement and you get ban. It would be like getting an apartment and breaking the rules which leads to you being kicked out. The landlord (Or whom ever own that place to begin with) has no right to give you all that money back or any improvements you made to the house (wallpaper, carpeting, wiring, etc) because you did that in your own accord.\n\nIf you read the terms of service you basically don't own the account. Yes you make one, but it's not yours to begin with. We are in a sense borrowing it, as well as we give them money when we put it into the account. It's the same reason why we never really buy the items like skins, boost, champions, icons, etc. we buy the RP. Plus this is basically how it is for any type of digital service. People make it seem like Riot is the only company to do this!","replies":[]},{"poster":"FrankerX","date":"2016-04-28T06:41:12.173+0000","up_votes":5,"down_votes":2,"body":"you borrow an account that belongs to riot and then give money into this account (that still belongs to riot) so?","replies":[]}]}]}]}]},{"poster":"CurlyFriezzz","date":"2016-04-28T14:39:24.604+0000","up_votes":4,"down_votes":1,"body":"They didn't make you spend money on the game.","replies":[{"poster":"Kofei","date":"2016-04-28T21:10:40.138+0000","up_votes":1,"down_votes":1,"body":"^^^","replies":[]}]},{"poster":"EvilDustMan","date":"2016-04-28T03:14:55.339+0000","up_votes":5,"down_votes":2,"body":"Let us see the chat logs?","replies":[{"poster":"x Azazel x","date":"2016-04-28T03:17:11.776+0000","up_votes":2,"down_votes":10,"body":"i would like to see everyone in that lobbies player chat if i show mine so youll see they are indeed talking more shit then i am","replies":[{"poster":"EvilDustMan","date":"2016-04-28T03:20:24.536+0000","up_votes":7,"down_votes":1,"body":"> [{quoted}](name=x Azazel x,realm=NA,application-id=ZGEFLEUQ,discussion-id=EUKwfFNl,comment-id=00010000,timestamp=2016-04-28T03:17:11.776+0000)\n>\n> i would like to see everyone in that lobbies player chat if i show mine so youll see they are indeed talking more shit then i am\n\nI hate to break it to you, but if you have 2 banned accounts, it's you, not everyone else.","replies":[{"poster":"x Azazel x","date":"2016-04-28T03:24:42.959+0000","up_votes":2,"down_votes":15,"body":"i play with decent skill ... ive been stucc in sliver for forever and all i wanted was to get to gold on Azul Ghost i was so close\nbut ofcourse a malphite kept cross chatting so i talked shit bacc but at the end of the game I GET BANNED OUT OF EVERYONE ELSE THAT IS NOT FAIR IF THEY WHERE PARTICIPATING IN THE BULLSHIT EVERY  FUCKING TIME WITH ALL THREE ACCOUNTS","replies":[]}]}]}]},{"poster":"Azul Ghost","date":"2016-04-28T03:14:39.717+0000","up_votes":2,"down_votes":0,"body":"this is my first banned account that ive spent lots of time and money on","replies":[]},{"poster":"BudgetMessiah","date":"2016-04-28T12:00:58.760+0000","up_votes":1,"down_votes":7,"body":"If you used PayPal and the charges are less than 6 months old, dispute them and get your money back.  Otherwise, take them to small claims court if you have the wherewithal.  They won't be able to defend themselves without hiring a lawyer, or flying a retained one out to your local court, and that would cost them much more than the $300 you might ask for.  Or in other words, they can't defend themselves...and the EULA counts as so much toilet paper in a court of law.\n\nThis is the only reason why they get away with this treatment of players : because they haven't been pushed back, yet.  Steam used to have no return policy.  Then they started getting hit with suits.  Now they have a return policy.  It's the way of the world, sadly.  You won't get proper treatment unless / until you fight for it.","replies":[{"poster":"MeilinII","date":"2016-04-28T22:46:52.118+0000","up_votes":1,"down_votes":1,"body":"Except that RIOT will win because the EULA is a legally binding document between a user and RIOT and then RIOT will countersue for their legal fees.","replies":[{"poster":"BudgetMessiah","date":"2016-04-29T13:47:35.836+0000","up_votes":2,"down_votes":1,"body":"EULAs aren't legally binding, at least not in the United States.  And Riot can countersue for their legal fees all they like.  Given the size of their company, judges aren't going to award them.","replies":[]}]}]},{"poster":"Academy Kayn","date":"2016-04-28T22:06:42.731+0000","up_votes":2,"down_votes":2,"body":"You're aware that you have to be consistently toxic to warrant a perma ban? You don't just have one bad game, and boom, banned. You have to show consistent toxic behavior they warrant it appropriate to ban ya. Considering you've got three accounts banned, it's apparent you haven't been the nicest.","replies":[]},{"poster":"themachamp","date":"2016-04-28T07:21:05.980+0000","up_votes":2,"down_votes":2,"body":"you don't borrow an account, you create one.  There is a reason they don't delete accounts, only ban them. Same concept as why politicians \"suspend\" campaigns and never quit them.....they'd have to give all of the money back if they do ;)","replies":[]},{"poster":"Ada Wong","date":"2016-04-28T03:26:14.950+0000","up_votes":2,"down_votes":8,"body":"How negative does a player have to be to get banned?\n\nIm curious if saying (One sentence negative) is considered ban worth.\n\nEX. We are likely going to lose because the enemy is too far ahead?\n\nWhat is defined as too much negative.","replies":[{"poster":"x Azazel x","date":"2016-04-28T03:27:56.609+0000","up_votes":2,"down_votes":11,"body":"IT MIGHT AS WELL BE\nSAYING REPORT MID AND JG FOR FLAMING IS WHAT JUST GOT ME BANNED NOT EVEN 20MINS AGO","replies":[{"poster":"StickyOctopi","date":"2016-04-28T04:04:26.634+0000","up_votes":6,"down_votes":2,"body":"You understand asking for reports is a bannable offense right? You deserved the ban, no question. And the other two. \n\nYou deserved it, you caused it. Own up to it instead of acting like you did nothing wrong. You don't get banned for no reason. You sound incredibly toxic to have been banned 3 times.\n\nTry reforming maybe, it's pretty easy to not get banned dude.\n\n100% deserved.","replies":[]}]}]},{"poster":"BADxW0LF","date":"2016-04-28T20:44:29.461+0000","up_votes":1,"down_votes":3,"body":"Judging by your attitude here...I can see why you would be banned.  Such a toxic person.","replies":[]},{"poster":"EcdYs1Ast","date":"2016-04-29T00:24:19.226+0000","up_votes":0,"down_votes":5,"body":"LOLOLOLOLOLOLOLOL poor toxic people why the fk you here crying? as someone who has received numerous chat restrictions and 14 day bans because I am toxic I say stfu and stop crying. talking shit in a video game shouldn't be punished as harshly as they do. I like seeing and speaking toxicity as I play it keeps me entertained.  but since rito has decided they do not like certain arrangements of letters to be seen by anyone in a game where you constantly KILL other characters in as many ways as possible because remember words are worse than killing, I accept the bans and wait them out and ill either one day refrain from the enjoyment of being raged at and raging back or ill get perma banned and move along.","replies":[]},{"poster":"x Azazel x","date":"2016-04-28T03:16:25.904+0000","up_votes":1,"down_votes":4,"body":"this is the second banned account but this acc is older then the other 2","replies":[]},{"poster":"x Azazel x","date":"2016-04-28T03:29:12.642+0000","up_votes":2,"down_votes":5,"body":"I DONT GET INTO A GAME AND JUST BOTHER PPL .... AS GOD IS MY WITNESS\n SOOO WHY IS IT THAT WHEN I SAY SOMTHING BACK I GET BANNED","replies":[]}]}