{"poster":"xEleanor Lamb","date":"2015-06-12T21:04:41.905+0000","title":"Was haltet ihr von Miramisu, Nicktron (vs SivHD) und Co?","subforum":"Allgemeiner Chat","up_votes":1,"down_votes":0,"body":"Sorry, falls das Thema schon oft kam. Wollte einfach mal eine nette(!) Diskussion dar&uuml;ber starten. Bitte haltet sie in Grenzen, ich will nicht, dass das hier ausartet wie der Twitch-Stream von Miramisu. \r\n\r\nNicktron vs. Siv gestern (11.06.) war sehr witzig, fande ich, obwohl ich Nicktron gar nicht mag, aber Siv HD hat es eben recht witzig gemacht, obwohl mich gewundert hat, wieso sich solche &quot;High Spieler&quot; mit Nicktron abgeben. Aber ich nehme an Siv hatte selbst viel Spa&szlig;. xD\r\n\r\nEins muss man denen aber lassen: Finde es erstaunlich, dass die mehr Views bekommen als ernst gemeinte Streams von keine Ahnung wie hohen Spielern. Ich mag diese Sparte ja nun gar nicht so sehr, aber die machen eine Menge Umsatz mit dem eigenen Blo&szlig;stellen. \r\n\r\nFindet ihr eher das ist Abschaum von Twitch und LoL oder schaut ihr es einfach um euch dar&uuml;ber zu am&uuml;sieren? Wirklich lernen sollte und kann man von denen ja nichts, hehe.","replies":[{"poster":"lllusive Man","date":"2015-06-12T21:16:34.709+0000","up_votes":1,"down_votes":0,"body":"siv hd ist gold das ist auch nicht hoch. zu der frage nicktron ist nicht gut siv hd ist sehr lustig miramisu zeigt nur ihre titten und kaceytron ist ok... kann man sich aber nicht lange antuen","replies":[{"poster":"xEleanor Lamb","date":"2015-06-12T21:30:10.120+0000","up_votes":1,"down_votes":0,"body":"Deswegen ja diese Anführungszeichen bei High Spieler. :) Zwischen ihm und Nicktron liegen ja doch noch zahlreiche Welten. xD","replies":[{"poster":"lllusive Man","date":"2015-06-12T21:32:52.327+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=xEleanor Lamb,realm=EUW,application-id=YnZkMR0R,discussion-id=OFiVerts,comment-id=00000000,timestamp=2015-06-12T21:30:10.120+0000)\n>\n> Deswegen ja diese Anführungszeichen bei High Spieler. :) Zwischen ihm und Nicktron liegen ja doch noch zahlreiche Welten. xD\n\ndas stimmt allerdings ^^","replies":[]}]}]}]}