{"poster":"Phridolin","date":"2015-07-26T02:39:08.009+0000","title":"Meine Meinung zu allen Vu#s/Rework#s seit 2013 bis heute","subforum":"Foren-Feedback","up_votes":1,"down_votes":0,"body":"Guten Tag liebe Community! :)\n\nIch wollte nur mal &#039;nen Thread erstellen um meine Meinung in den Raum zu werfen und vielleicht eine Diskussion mit m&ouml;glichen (weit in der Zukunft liegenden) &Auml;nderungen durch zubringen. (#alsobdasRiot&uuml;berhauptinteressiertLOL aber: #dieverdammteHoffnungstirbtzuletzt!)\n\n2013 - Yi-Rework: Gr&ouml;&szlig;er? Super! Fast beim alten geblieben und noch fette Ability-VU&#039;S? Geil! Neuer Splash? Fehlanzeige. F&uuml;&szlig;e? Au&szlig;er beim Samurai-Skin zu gro&szlig;!\n\n2013 - Garen-VU: Splash? Klasse!  Model? Zu klobig! (ist Ingame mit einer der l&auml;cherlichsten Champs IMO)\n\n2013 - Sivir-VU: Model? Nice! Splash? Wenigstens wurde Ihre Zahnl&uuml;cke gefixt... Sonst noch immer eine Entt&auml;uschung IMO. Animationen? Eigentlich gut, aber das st&auml;ndige \"in-der-Hocke-sein\" finde ich so st&ouml;rend, dass selbst meine Brille sich schon fast verbiegt.\n\n2013 - Nasus-VU: Model? Nice! Splash? Nice! - Bei ihm finde ich mal eigentlich nix zu meckern.\n\n2014 - Twitch-VU: Model? Nice! Vertonung? Manchmal nervig, aber so ist Twitch halt. Splash? Geil!\n\n2014 - Heimerdinger-VU: Splash? Klasse! Model? Nix zu meckern! ^^\n\n2014 - Karthus-VU: Splash? Gut. Model? Gut! Abilities? Hmm... imo alle zu &auml;hnlich, zu wenig Unterschiede.\n\n2014 - Viktor-Rework: Splash? Nice. Model? Nice. Movement-Set? Nix zu meckern.\n\n2014 - Sion-Rework: GEIL! Auch wenn ich mir seine Stimme einen kleinen Tick dunkler gew&uuml;nscht h&auml;tte.^^\n\n2015 - Gankplank-Rework: GEIL! Hab den nie gespielt vorher (ein/zwei mal) und fand ihn langweilig, aber jetzt nicht mehr!\n\n2015 - Fiora-Rework: Eigentlich geil, aber bitte nicht wieder umkehren sondern durchziehen! Dann wird sie 100 pro auch so interessant wie GP, und ihre neue Splashart ist gut so wie sie ist! Mit neuem Haircut! Thumbs up! \n\n*WW-Rework/Poppy-Rework/Yorick-Rework/Evelynn-Rework/Shaco-Rework/Taric-Rework unconfirmed*\n\nFalls ich welche vergessen habe, tut&#039;s mir leid. - K&ouml;nnt ihr gerne erg&auml;nzen! :) **Und bitte keine Kommentare wie**: Ehhhhhhhh, du wei&szlig;t aber schon das die halt nun so sind wie sie sind, ne. Und als ob Rito dir zu h&ouml;rt! **LOL** Akzeptiers halt, blablabla. -F&uuml;r solche Kommentare war mein \"Beitrag\" nicht gedacht, sondern einfach nur eine kleine Rezension mit Feedback eines Spielers seit 2012 - mit Geschmack! \n\nCheers","replies":[]}