{"poster":"Mister Chief","date":"2015-12-13T13:43:29.794+0000","title":"Let's Talk About Swain","subforum":"Gameplay & Strategy","up_votes":3,"down_votes":1,"body":"I made a post on the LoL subreddit (my main browsing grounds for LoL content) about Swain, and my reasoning behind giving him 100 extra autoattack range.  It didn&#039;t get much notice, but I think I raised some good points. Notably, there is a high precedent for Swain having a longer autoattack range simply because Anivia exists. Anivia is very similar to Swain: \r\n\r\n* niche picks (although Anivia is far more popular thanks to the likes of Froggen and skins actually being released for her), \r\n* similar winrates, \r\n* near identical build-archetypes, \r\n* near identical themes (immobile mages based in locking down opponents with intense single-target damage with minimal AoE damage to give teamfighting relevance). \r\n\r\nI argued that Swain&#039;s weak laning phase resultant from a lack of real waveclear (which is where Anivia far and away beats Swain back) could be balanced by giving him more attack range, allowing him to last hit safer, just as Anivia can. [The full post is here ](https://www.reddit.com/r/leagueoflegends/comments/3svdxc/give_swain_100_autoattack_range/)(I am unaware of restrictions linking to Reddit) if you want to give it a read.\r\n\r\nI&#039;ve played Swain for about 4 years. My winrate over 2015 Ranked (I finished at gold 3, having climbed to gold 1) was 74% over 54 games (my friend tells me this is good). I love Swain as a champion, from his badass lore to the way his immobile kit epitomises the checks and balance of video game balance.  He is very strong when fighting within his ranges, but his immobility and lack of waveclear give an enemy clear counterplay to  an enemy (a feature Riot&#039;s more recent champions seen to do away with). He was the third champion I played since starting LoL.\r\n\r\nWhich is why, with this history, the 5.24 patch changes honestly outraged me. The justification for Swain&#039;s W nerf is that Corrupting Potion and Deathfire Torch Keystone are too oppressive on Swain. Let me address this reasoning by saying that Corrupting Potion is horrid on Swain. It gives shit-all mana (which, due to Swain&#039;s crazy high basic spell costs and, of course, his exponentially greater ult mana cost, is a massive con). Secondly, Doran&#039;s Ring plus Swain&#039;s passive barely gives him the mana he needs to sustain trading in-lane. Deathfire Torch is, in my honest opinion, meh on Swain. The damage it gives is subpar, and, not only that, the ferocity tree isn&#039;t as good as the cunning tree is for Swain. Cunning gives flat mr and armour pen (vital for early game trading, and late game ADC shredding), the ever-crazy Thunderlord&#039;s Keystone, mana regen, cookies, *easier last hitting*. It&#039;s just too good for Swain to miss out on. \r\n\r\nWith this in mind, let me restate Riot&#039;s reasoning for Swain&#039;s nerf. Swain was too oppressive against the players who a) didn&#039;t counterpick him with one of his many hard/medium counters or b) doesn&#039;t know how Swain works, so just feeds to him like a first timer playing against Riven. The reason he is oppressive to these players is because of the Deathfire Torch mastery, *which we are also nerfing this patch* in a classic example of Riot&#039;s circle of balance (buff item, champion strong, nerf champion to compensate, later nerf item, champion incredibly weak). \r\n\r\nYou might be wondering why I think the nerf is so bad. The reason is this: Swain should only ever max W last. It&#039;s a decent CC ability, but compared to not only Anivia&#039;s AoE stun, but to the CC more recent champions boast (Yasuo&#039;s AoE spammable knockups come to mind, and he isn&#039;t even that recent), it&#039;s pitiful. Landing a W was hard enough, but for it to only last a single second just adds salt to the wound. If you&#039;re playing against any sort of competent player they will either be dashing in and around you as Swain (eg Yasou) or they will be staying as far away with you, clearing with spells and the occasional auto. In both instances actually landing a W is near impossible; for it to not even be useful when you finally land it is just plain wrong. \r\n\r\nI&#039;m making this incredibly long-winded, hopefully justified post because I truly believe Swain requires compensation. \r\n\r\n* His kit is low mobility and now barely locks down a target long enough to kill without being fed. \r\n* He is squishy even with ult and RoA, and, even with the sustain of his ult, is easily bursted by near any assassin or mage under the sun. \r\n* The new penetration item which gives grievous wounds *on-hit* for, I believe, 4 seconds, wrecks any hope Swain has for sustaining through a fight. \r\n* The colossal Zhonyas nerf a few patches ago, making it weaker and cost more, is a huge hit to Swain, a champ who only synergises better with RoA.  \r\n* Swain is butchered by range, and had to burn flash to 1v1 an adc even before they were all buffed. That near every adc is stronger, has access to items which shred Swain&#039;s HP or healing and outrange him even more puts Swain into the ground even more\r\n* He is one of the few, if not only champion in the game (outside of maybe Urgot and 1 or 2 supports) who retains the identify of tanky carry, whilst being ranged. As such he gets many of the deficits of being near-melee range (juggernaut-esque immobility), with many of the deficits of being ranged (no mr per level)\r\n\r\nI honestly don&#039;t know what difference this post would make. Ideally it would result in someone at Riot looking at my justifications, and either reverting the nerf, or giving him bonuses in other areas. My suggested buffs would be any of the following:\r\n\r\n* the AA range buff to 600 units\r\n* a movement speed buff, which is increased when in Bird form, a la Quinn&#039;s new ult (but obviously not so brokenly fast as that!)\r\n* a better method of clearing. Either buffing his ult&#039;s damage against minions, or letting it shoot 6 birds, or doubling its rate of fire. Anything to let him have even half the waveclear Anivia gets upon reaching level 6. \r\n* a rework into a melee champion. Now he hits things with his cane! Crits are his bird biting the enemy! His abilities are slightly reduced in range, but their damage is buffed, mana and cd are reduced, and his ult mana cost no longer scales over used time. I only just considered this, but I honestly am beginning to really like it as a concept. \r\n\r\nThis is a really long and rambly post, and I&#039;d give a TL:DR but I don&#039;t want to type another thousand words. If you did give it a read, thank you for doing so! Give your thoughts below, I&#039;d love to see this post (and my favourite cripple) get some love and much-needed attention.\r\n\r\nSources:\r\n\r\n* [The Fighter Class](http://leagueoflegends.wikia.com/wiki/Category:Fighter_champion)\r\n* [The Legend](http://leagueoflegends.wikia.com/wiki/Swain)\r\n* [Swain&#039;s Stats](http://champion.gg/champion/swain)","replies":[{"poster":"GigaPube","date":"2015-12-14T10:14:38.569+0000","up_votes":3,"down_votes":0,"body":"\"lets talk about swain\" \ncool ok\nsees post\nna im rite m8","replies":[{"poster":"Mister Chief","date":"2015-12-15T15:38:45.651+0000","up_votes":1,"down_votes":0,"body":"I talked. A lot.","replies":[]}]},{"poster":"Shes my Princess","date":"2015-12-15T05:09:55.590+0000","up_votes":2,"down_votes":0,"body":"Hey thur, Swain main here myself! Played around ~500 games with Swain in ranked across s3-s5 and have had similar winrates, which is actually pretty cool to see another Swain doing pretty good. I only just read the patch notes and _good god_ does that sound stupid. \n\nNevermove was already hard enough to hit as it was given that:\n\na) Nevermove has a cast time, delay, and distinct audio to tell you to move; and\nb) You're extremely susceptible to all kinds of hard cc whilst moving in to set beatrice onto a (keyword) rooted target should W hit (I've been hit by at least a few hundred Ahri charms trying to follow up after nevermove). \n\nTwo seconds isn't even that long given that it's a **_DELAYED ROOT_** as opposed to a stun.  If they're looking at ranked win % as a justification for the nerf, he's not even above 50% in the source you've cited above, which is crazy. He's not being used competitively at the moment with the control mage and early jungle meta (combined with broken top laners), so I'm wondering why they've decided to do this...\n\n\"When Swain’s good, his dominance over the lane borders on abusive - and Swain’s pretty good right now\" (Patch 5.24 Notes, 2015). I don't feel like the mastery rework favors Swain more than any other solo laner, and this nerf is just _too_ harsh. For a skill that only gets some love after torment and decrepify when the game's already in it's mid to late stages, a _FIFTY PERCENT REDUCTION IN THE CC DURATION AT RANK ONE WHERE IT STAYS FOR THE MAJORITY OF THE GAME_ is just too much.\n\nWe've undoubtedly played more Swain than the goose who's plucked this ridiculous nerf out of the basket of bad ideas at Rito HQ, and despite the fact we don't have access to the microdata they do, I, too, feel like it's too much.\n\nYou've killed my three-year love for Swain in the past five minutes, but I'm glad to see I'm not the only one who finds it stupid.\n\n{{champion:50}} {{item:3070}}","replies":[{"poster":"Mister Chief","date":"2015-12-15T15:41:17.766+0000","up_votes":2,"down_votes":0,"body":"If you want to get even angrier, Cho's Q has 50% greater range, a larger area, now knocks up for the same time Swain roots, and slows for 1.5s too! Fun!","replies":[{"poster":"Shes my Princess","date":"2015-12-16T03:26:06.639+0000","up_votes":1,"down_votes":0,"body":"There seems to be some anger about it on reddit, watching it closely  with a grin","replies":[]}]}]},{"poster":"Jink","date":"2015-12-14T12:41:26.971+0000","up_votes":2,"down_votes":1,"body":"Dude he E's me once as an ADC and I'm on half HP.\n\nPls do not give this champion any love.","replies":[{"poster":"Mister Chief","date":"2015-12-15T15:41:49.172+0000","up_votes":1,"down_votes":1,"body":"A Fizz does the same and you're dead. If you're not dodging abilities, that's your fault.","replies":[{"poster":"Lord Sesshomaru","date":"2015-12-15T21:50:00.693+0000","up_votes":1,"down_votes":0,"body":"\"If you're not dodging abilities its your fault.\"\n\n2 of swains abilities are targetable DoT and one of them attacks you passively just by walking near him, (in other words, how the f**** are you supposed to dodge that)\n\nand on top of that, the only dodgable ability he has is AoE!","replies":[]}]}]},{"poster":"Lord Sesshomaru","date":"2015-12-14T02:27:49.467+0000","up_votes":2,"down_votes":1,"body":"\"Anivia is very simiar to swain\"\n\nignoring of course the fact that Swain comes out of a 1v5 with more health than when he went in.\n\nAnd Anivia comes out of a 1v5 very very dead.","replies":[{"poster":"Mister Chief","date":"2015-12-14T09:16:03.857+0000","up_votes":1,"down_votes":0,"body":"Swain can only survive a 1v5 in the same circumstance Anivia would: against bots or people with the skill of bots. Anivia actually has a better time of it, when her huge AoE slow, wall, and stun.","replies":[{"poster":"Lord Sesshomaru","date":"2015-12-14T21:29:16.359+0000","up_votes":1,"down_votes":1,"body":"Anivia is one of the squishiest champs in the game, which is why she has a long AA range, so she does risk dying every time she goes for CS\n\nand don't you dare tell me that swain is squishy!\nbecause he is more survivable he can afford to have a shorter AA range because he doesn't risk halfing his HP every time he goes near an enemy champ.\n\nincase you hadn't noticed thats why most tanks are melee and most ADC's are ranged...","replies":[{"poster":"Mister Chief","date":"2015-12-15T15:40:29.071+0000","up_votes":1,"down_votes":0,"body":"Swain is pretty squishy. With equivalent gold to another champion, odds are they have either the mobility or range to handle a Swain and chunk him pretty well. Swain's sustain comes from his ult, which is either him losing all his mana for any significant regen or not enough to survive, or buttfucked by all the free grievous wounds out there.","replies":[{"poster":"Lord Sesshomaru","date":"2015-12-15T21:46:05.863+0000","up_votes":1,"down_votes":0,"body":"I dont mean to burst your bubble, but anyone who builds RoA, Liandry's, Rylai's, and a Spirit Visage, by definition is not squishy.\nsquishy is like 1850 HP not 3500+\n\nplus his ult which surpasses Vladimir level sustain, and doesn't even require aiming, just just press it and walk near them.\n\nWhats funny about what you just said, is that Mobility and Range are what counters tanks, NOT squishes, Tankiness and Damage counter squishes. So by saying that Mobility and range counter him, you're likening him more to a tank than a squishy.\n\njust ask anyone, Swain is not a squishy champion, Squishy champions are: Teemo, Twisted Fate, Ezreal etc etc. champs that don't build much health or defences and have little sustain.","replies":[]}]}]}]}]},{"poster":"McRuthless","date":"2015-12-14T00:19:02.437+0000","up_votes":1,"down_votes":1,"body":"Hes already strong vs melee champs. Considering he has a good win rate already, a significant aa range buff could well push him towards being OP, particularly top lane. Other similar champs like Vlad have an even shorter range than Swain anyway.\nHis laning and waveclear isn't very satisfying and i wouldn't mind seeing it buffed or him get a bit of a rework, but it would have to be at the cost of his mid-lategame power or he would just be way too strong.","replies":[{"poster":"Mister Chief","date":"2015-12-14T01:24:14.416+0000","up_votes":1,"down_votes":1,"body":"Vladimir has 50 less range than Swain does, however Vlad is also only really played top, against melee champions. Vlad, however, also has easily spammable abilities, Zhonyas on a 20s cooldown that he can move in, and pretty crazily good teamfighting presence as well as the ability to split like a God. Swain top in my honest opinion only works against bad laners anyway, any of the current meta tops would wreck a Swain either in the early game or in late game contribution. \nHonestly, I feel that Swain's mid-game power comes from his enemies screwing up. If you position poorely against a Swain, he will root you (now for half as long, but he'll still do it) and chunk you pretty hard. The thing is, nearly every other mage at the same time would just fucking kill you, while Swain would lose half his mana and you lose half your life.","replies":[{"poster":"ViolinMaker53","date":"2015-12-15T19:16:01.501+0000","up_votes":1,"down_votes":0,"body":"this, build more glass cannon l2play\n\n> [{quoted}](name=Mister Chief,realm=OCE,application-id=FjGAIbRv,discussion-id=QKabEXvP,comment-id=00000000,timestamp=2015-12-14T01:24:14.416+0000)\n>\n> Vladimir has 50 less range than Swain does,","replies":[]}]}]},{"poster":"ViolinMaker53","date":"2015-12-15T19:07:56.877+0000","up_votes":1,"down_votes":0,"body":"most swains issues are they have 1 track mind to sustain swain, build more ap & specifically pen. flash ignite only real option. he doesnt need boost","replies":[]},{"poster":"Omni Presents","date":"2015-12-14T07:35:57.123+0000","up_votes":1,"down_votes":1,"body":"They are similar early game, but that is about it. Anivia is a niche pick since you need that strong early game to be able to withstand late game, Swain can build tanky and survive a full team fight with ease.\n\nAlso, it is called counter picking, Anivia counters swains early game to get the advantage come late game, for if Swain was not counter picked than Anivia would be bat shit useless.\n\nIt is like Brand V.s Annie I had not too long ago, Brand was killing me, his spell range was just too good and I got wrecked, but if he was bad and let me farm, when I got some items I would be able to Q stun into a W/R combo and melt him in 2 seconds. He used his counter pick to his advantage and stopped me farming for an easier late game and made my day miserable.","replies":[]}]}