{"poster":"BOT Yásuo","date":"2016-04-16T03:05:02.835+0000","title":"Muchachos a gastar guita en lo que se tiene que gastar guita, basta de idioteces.","subforum":"Charlas Generales","up_votes":47,"down_votes":9,"body":"Arranquen a invertir en el servidor muchachos, no se fijen en hacer eventos innecesarios, yo creo que es m&aacute;s que obvio que hay prioridades, durante este verano las interrupciones no fueron suficientes como para hacer que la gente se vaya, pero pasa lo mismo que el a&ntilde;o pasado, en lo que transcurre del a&ntilde;o empieza a andar mal el servidor y parece que ni les importa, honestamente creo que si inclusive el sector afectado es m&iacute;nimo (sea hasta un pueblito de 10 personas) siempre y cuando sea del servidor ustedes mismos deber&iacute;an de solucionarlo de la manera m&aacute;s r&aacute;pida posible, en este caso el Lag afect&oacute; a m&aacute;s de un pueblito de 10 personas, no hubo 1 partida en la que no dijeran &quot;GG lag&quot; y la verdad es que estan dando una fama horrible a LAS, somos una comunidad perfecta? yo creo que no, estamos con toxicidad, afks y trolls por donde sea, pero somos un servidor decente?\r\n\r\nLa verdad parecer&iacute;a que no muchachos, ponganle m&aacute;s atenci&oacute;n a su gente, fijense que reiteradas veces sucede el mismo error y en 3 a&ntilde;os todav&iacute;a no se toparon con una soluci&oacute;n, si necesitan una central pidan guita para arreglarlo, no se, inviertan m&aacute;s en este sector porque realmente no creo que haya otra cosa a la que deban invertir, si el presupuesto est&aacute; siendo enviado a e-sport o creaci&oacute;n de personajes la verdad por m&iacute; saquenlo de ah&iacute; que ninguno de los 2 me interesan en lo m&aacute;s m&iacute;nimo y supongo que la gran mayor&iacute;a del servidor me dar&aacute; la raz&oacute;n en que su prioridad n&ordm;1 sobre TODAS LAS DEM&Aacute;S es que el servidor ande bien y la gente no tenga que hacer Threads a las 12 de la noche de un d&iacute;a viernes porque el loss es tan alto que no lo deja ni farmear.\r\n\r\nNo creo que nadie lea esto, pero en serio, a alguno en riot le importa lo que le pase a un pibe de 18 a&ntilde;os a las 12 de la noche que no tiene otra cosa que hacer que jugar con amigos?\r\nPorque la verdad su sentido de humanidad es deprimente.","replies":[{"poster":"xXLawea777xx","date":"2016-04-16T03:40:32.704+0000","up_votes":13,"down_votes":0,"body":"El evento exclusivo que nos prometieron. 50 % de descuento en caídas del server","replies":[]},{"poster":"Whitesse","date":"2016-04-16T03:15:25.031+0000","up_votes":6,"down_votes":2,"body":"Para que queres un servidor decente si podes comprar la skin de Sion a 1820RP que por cierto a Sion le nerfearon hasta lo innerfeable. No sirve para nada el pobre y el servidor menos.","replies":[{"poster":"BOT Yásuo","date":"2016-04-16T04:17:39.508+0000","up_votes":3,"down_votes":1,"body":"Bueno, honestamente en lo que se refiere al servidor es imposible que le eches la culpa al staff de creación de Skins, para empezar el skin no lo hicieron acá y segundo cada uno tiene su trabajo.\nLo que sí yo creo que deberían de invertir en encontrar una forma para que estos errores no pasen nunca más y todos nos olvidemos de ellos.\n\nSi es necesario sacar la guita del e-sport latino o de eventos o de cualquier otra creación, yo creo que se pueden suspender mientras que lo primordial sea el estado del servidor, una vez arreglado pueden seguir con el resto...\n\nPrioridades...","replies":[{"poster":"fenakz","date":"2016-04-16T06:49:55.289+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=BOT Yásuo,realm=LAS,application-id=v7qsfXsE,discussion-id=j45N7Pj0,comment-id=00050000,timestamp=2016-04-16T04:17:39.508+0000)\n>\n> Bueno, honestamente en lo que se refiere al servidor es imposible que le eches la culpa al staff de creación de Skins, para empezar el skin no lo hicieron acá y segundo cada uno tiene su trabajo.\n> Lo que sí yo creo que deberían de invertir en encontrar una forma para que estos errores no pasen nunca más y todos nos olvidemos de ellos.\n> \n> Si es necesario sacar la guita del e-sport latino o de eventos o de cualquier otra creación, yo creo que se pueden suspender mientras que lo primordial sea el estado del servidor, una vez arreglado pueden seguir con el resto...\n> \n> Prioridades...\n\nYo creo que las mierd*s (perdon por la palabra) no es por el servidor de riot, son por las empresas de internet que son tan mediocres (trabaje 3 años en fibertel, tecnico de cablevision/fibertel más para el cable que para el internet) y mucha gente de \"barrios\" de zona roja por asi decirlo me conocían y me decian porque no llega el internet ahi, y que le podria decir? que la empresa no quiere invertir en fibra optica ni mucho menos poner cable porque se colan o simplemente las roban. La opcion mas facil es la de fibra optica, pero no quieren gastar un **** centavo. La inversion no existe en argentina, tanto como directv/movistar pagando a colombianas en dolares porque alla le sale mas barato el dolar que aca. Entonces, es facil echarle la culpa a una empresa que usa un servicio pesimo .","replies":[{"poster":"Reverze","date":"2016-04-17T12:31:52.378+0000","up_votes":1,"down_votes":0,"body":"No solo esa empresa la empresa \"roja y blanca\" ni te cuento... Pero creo que el problema no solo es de las empresas... Sino del estado... \n\n\"Vamos por todo\" ¿Recuerdan? Acá tienen... 0 infraestructura... Y riot si bien invierte en lo que es la \"conectividad\" esto es LATAM... No esperen mucho xD.\n\nAjo y agua gente... A nadie le gusta el lag... Pero tampoco pidan agua si no hay cañerías...\nAlgo curioso... Se pueden mandar satélites al espacio... Pero no se puede tener una conexión digna a internet... OP  {{champion:432}}","replies":[]},{"poster":"Sakura Star","date":"2016-04-16T18:20:35.671+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=fenakz,realm=LAS,application-id=v7qsfXsE,discussion-id=j45N7Pj0,comment-id=000500000000,timestamp=2016-04-16T06:49:55.289+0000)\n>\n> Yo creo que las mierd*s (perdon por la palabra) no es por el servidor de riot, son por las empresas de internet que son tan mediocres (trabaje 3 años en fibertel, tecnico de cablevision/fibertel más para el cable que para el internet) y mucha gente de &quot;barrios&quot; de zona roja por asi decirlo me conocían y me decian porque no llega el internet ahi, y que le podria decir? que la empresa no quiere invertir en fibra optica ni mucho menos poner cable porque se colan o simplemente las roban. La opcion mas facil es la de fibra optica, pero no quieren gastar un **** centavo. La inversion no existe en argentina, tanto como directv/movistar pagando a colombianas en dolares porque alla le sale mas barato el dolar que aca. Entonces, es facil echarle la culpa a una empresa que usa un servicio pesimo .\n\nSi pero una cosa, si fuese una caida de fibertel creeme que por mas que hayas trabajado alla, ya el servicio lo tengo hace 4 años y las caidas a nivel pais han sido jodidas. Pero dudo que ayer el servicio haya tenido dramas ya que podia jugar en Steam sin dramas(ahi si seria drama de fibertel), pero ya en el topic donde posteo un rioter explicaron que el servidor o lo que sea que era, estaba routeando para estados unidos por eso era el quilombo del lag, pero se arreglo...\n-------\nNo se lo tomen a mal pero el drama se soluciono casi a nivel general, porque pocos siguen teniendo problemas.\nY realmente los tecnicos de fibertel dejan mucho que desear, hace 1 año que estoy peleando por la conexion de internet y señal y nunca vienen a hacer el mantenimiento de edificio ni pidiendolo el administrador...asi que mejor no le tires mas leña al fuego, que ganas no falta irles a hacer volar la central por inutilidad extrema...{{sticker:slayer-jinx-unamused}}","replies":[{"poster":"fenakz","date":"2016-04-17T03:04:11.773+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=NadeshikoSensei,realm=LAS,application-id=v7qsfXsE,discussion-id=j45N7Pj0,comment-id=0005000000000001,timestamp=2016-04-16T18:20:35.671+0000)\n>\n> Si pero una cosa, si fuese una caida de fibertel creeme que por mas que hayas trabajado alla, ya el servicio lo tengo hace 4 años y las caidas a nivel pais han sido jodidas. Pero dudo que ayer el servicio haya tenido dramas ya que podia jugar en Steam sin dramas(ahi si seria drama de fibertel), pero ya en el topic donde posteo un rioter explicaron que el servidor o lo que sea que era, estaba routeando para estados unidos por eso era el quilombo del lag, pero se arreglo...\n> -------\n> No se lo tomen a mal pero el drama se soluciono casi a nivel general, porque pocos siguen teniendo problemas.\n> Y realmente los tecnicos de fibertel dejan mucho que desear, hace 1 año que estoy peleando por la conexion de internet y señal y nunca vienen a hacer el mantenimiento de edificio ni pidiendolo el administrador...asi que mejor no le tires mas leña al fuego, que ganas no falta irles a hacer volar la central por inutilidad extrema...{{sticker:slayer-jinx-unamused}}\n\nTe entiendo a lo que te referis, yo no digo que fibertel/speedy/arnet/telecentro se hayan caido, a lo que voy es que ponele que el servidor de riot usa los ISP de X empresa \"la mejor\" y fibertel es una de las empresas que en el norte no llega, entonces al no haber buenas conexiones entre si sucede lo que pasa se hace un \"corte de fibra\" no va con la suficiente fuerza y al \"SER MUCHOS\" que usan esa conexion como que se satura, el problema no es de riot el problema es que falta mantenimiento y ganas de hacer una mejor conexion entre argentina/chile/paraguay/bolivia. Speedy y arnet (antes flash) fueron unos de los primeros que pusieron internet via cable telefonico, mira en que fecha estamos y speedy todavía no llega a las 10 megas fijas, recauda millones y quedo atras de una empresa \"nueva\" como telecentro que es una de las mejores y mas prolija llegando a 100 megas y más . Es más tiene fibra optica y gracias a un amigo que trabaja ahi tengo 2 mega y me baja de 600 a 2000 kbps . \n\nPD: Para que te venga un tecnico rapido deci que se engancharon 5 personas, van corriendo . Salu2","replies":[]}]},{"poster":"BOT Yásuo","date":"2016-04-16T14:50:11.315+0000","up_votes":1,"down_votes":0,"body":"Yup, es verdad que las empresas argentinas son malas, no hay una que safe, pero cuando anda mal internet es internet, los insultos van a Fiber o Arnet de manera correspondiente (y las demás) en este caso fue el servidor, quierase o no, puede que sea un error de conexión entre la ISP y el servidor? sí, obviamente que puede ser, pero es Riot quien tiene que ponerse en contacto e intentar solucionarlo.\n\nObviamente si las cosas no funcionan hay un compromiso de ambas partes para que ande lo mejor posible para una parte de sus jugadores, si el problema está en la conexión con Chile debería haber un modo para que no debamos conectarnos a Chile...\n\nOsea, Riot tiene que poner su parte, si el problema es un 100% la ISP entonces vamos y quemamos las oficinas de Fibertel.","replies":[]}]}]},{"poster":"9Jungla7","date":"2016-04-16T05:35:32.119+0000","up_votes":1,"down_votes":0,"body":"Nose quien te dijo que Sion esta nerfeado, es uno de los tops mas rotos y con mas winrate actualmente{{champion:14}}","replies":[{"poster":"Whitesse","date":"2016-04-16T06:04:06.783+0000","up_votes":1,"down_votes":3,"body":"Hace cuanto que juegas al LoL ? 3 dias ? Sion desde su rework lo nerfearon en todos los parches habidos y por haber hasta que se olvido por completo. En soloQ no lo ves ni loco.\n\nRotos ? Los god tier y top tier en el parche 6.7 son Irelia, Ekko y Renekton. \n\nSion antes de que lo nerfeen se podia usar de cualquier cosa en cualquier linea, te rendia igual, un gran tanqueo y un gran daño, subi de Oro a Diamante jugando Sion en todas las lineas y ahora te da pena como está. Es más, con la salida de su skin definitiva tampoco lo juegan.","replies":[{"poster":"support girl uwu","date":"2016-04-16T15:55:23.943+0000","up_votes":1,"down_votes":1,"body":"Renekton god tier? lol jaja, no está ni cerca del tier 1 renekton. Irelia tier 1 si la maineas y jugas perfecto, sino tampoco renta.\n\nEl top tier está en campeones que se hagan la build de sunfire>gauntlet>visage, como, efectivamente Sion, Malphite, Ekko, Naut, etc. y Graves por el sustain y burst.\n\nSion tiene un poke bastante roto por lo tank que es con la E, demasiado safe para farmear y pokear sin exponerte, y de los tanques mas duros del parche. Si decís que esta nerfed, es porque evidentemente no sabes aprovechar las mecánicas del campeón. \n\nY también sospecho que no usas muy a Sion por el ''se podía usar de cualquier cosa en cualquier linea'' , de jungla nunca fue ''buen'' pick, de sup tampoco, lo probaron algunas veces pero a buen pick no llegó, de mid directamente nunca se usó. Sion fue top siempre, excepto el Sion AP que se usaba mid.","replies":[{"poster":"LGBT Valentina","date":"2016-04-17T03:41:43.211+0000","up_votes":2,"down_votes":0,"body":"**Sion tiene un poke bastante roto por lo tank que es con la E, demasiado safe para farmear y pokear sin exponerte, y de los tanques mas duros del parche. Si decís que esta nerfed, es porque evidentemente no sabes aprovechar las mecánicas del campeón.**\n\nNope maestro\nLa unica razon (que le pegastes) es por que con tanto tema de bulling de lane, ofrece una safe lane excelente y es dificil divearlo de por si\nAdemas de tener una regen base alta\nCon 2 doran ring o ir directo a frozen heart, ya te ofrece bastante mana \nPero el champ en si, esta overnerf, en especial la W, se pasaron en temas de early game\nNo esta muy overnerf, pero no esta bien parado actualemente","replies":[{"poster":"support girl uwu","date":"2016-04-17T05:18:40.261+0000","up_votes":1,"down_votes":1,"body":"http://www.nerfplz.com/2016/04/2016-champion-tier-list-solo-queue.html god tier.\n(ahora es cuando decís que sos challenger en kr y mirar páginas es para noobs xD)","replies":[{"poster":"LGBT Valentina","date":"2016-04-17T15:02:21.441+0000","up_votes":1,"down_votes":0,"body":"No miro\nVeo lo que tengo en contra en las normals (que me caen hace 1 año aprox, diamond-challengers) y miro de forma continua https://www.youtube.com/channel/UCmgtmJxFHtwLPru3JRlki5A\n\nEn si sion, sigue siendo malisimo\nLa ulti, facil de dodgear, es de las mejores a peores ultis (casi siempre a peor) y se sabe que sion, es mejor en early-mid game que en el mismo late, un tanke practicamente con 1 cc, la Q se la cancelan y no hace daño\nPara eso pickeas otro tank\n\nEsa pag, es una de las pocas que en si es buena \nuna chota que usan todos, es lolking","replies":[]}]}]}]},{"poster":"9Jungla7","date":"2016-07-23T05:44:13.309+0000","up_votes":1,"down_votes":0,"body":"mira papa, es muy buen top, si vos sos un bobo que lo usaba mid y rendia y ahora no le rinde, a llorar a la iglesia, sigue siendo muy tanque y mete buen cc y daño\nah y pd: la skin de sion nueva no es definitiva, ni siquiera legendaria, salu2","replies":[{"poster":"Whitesse","date":"2016-08-16T01:25:21.233+0000","up_votes":1,"down_votes":0,"body":"Sion hace meses que no lo ves mas capo, no se que liga seas pero del meta no sabes mucho. Hay picks mucho mejores que Sion, que hacen mas daño y aguantan lo mismo.\nCuando le hicieron el Rework veias a sion en cualquier linea, tanto Top como Mid. Lo fueron nerfeando y se usaba de Soporte.\nLa skin de Sion es Legendaria pibe, salu2.","replies":[]}]}]}]}]},{"poster":"HotPan","date":"2016-04-16T03:38:21.406+0000","up_votes":2,"down_votes":0,"body":"Aunque no lo creas y despues de leer ese wall of text. el problema esta vez no es el server. El problema reside en el enlace Chile-Argentina. Lo se porque cuando se cayó el LoL, tambien se cayo mi conexiona  un ventrilo que uso para hablar on otra gente. Este ventrilo esta hosteado en Chicago. Por lo tanto, puedo decir 100% seguro esta vez el problema es el enlace o algun corte de fibra...no el server.","replies":[{"poster":"BOT Yásuo","date":"2016-04-16T03:46:29.725+0000","up_votes":3,"down_votes":0,"body":"Posiblemente sean problemas de la conexión, si el problema era de Loss, ni ping elevado ni cortes totales, si no pérdida de paquetes.\n\nIgualmente esto estoy más que seguro que tiene una solución posible, obviamente no digo que riot sea el dios del dinero y pueda poner 1 servidor por país, pero yo digo que la verdad un pequeño servidor que sea Argentino al cual entren Argentinos y si bien no sea tan grande se pueda jugar y los que no entren dentro de este servidor en X o Y momento deban entrar al chileno, yo creo que algo así es posible, no digo que sea barato, no digo que sea fácil, pero digo que es posible.\n\nEn Europa tuvieron un problema igualito a este, dividieron las regiones en 2 y ampliaron los servidores, acá que está pasando...","replies":[{"poster":"iTargaryen","date":"2016-04-17T13:22:17.617+0000","up_votes":1,"down_votes":0,"body":"Es algo imposible, parate a pensar un segundo; latino américa tiene dos servidores (sur y norte), que juntos dan un total de 20 países, bueno, entonces, cada región tiene un servidor, que son varios países agrupados. Brasil, con Brasil es otro tema, hablan otro idioma y eso es lo único que nos separa, aparte de que es un país muy grande territorialmente. A lo que voy, ¿Vos pensas que habiendo servidores tan generales, como LAS. LAN, EUW, EUN, OCE, etc. Riot se va tomar el tiempo de hacer un servidor exclusivamente para Argentinos? o por lo menos si va funcionar? No, es algo muy improbable mires por donde lo mires, aparte que sería algo egoísta por parte de los demás servidores porque nos estaríamos separando y nunca faltarían los estúpidos que se creen mas importantes por tener un servidor solo para ellos. Sin mencionar, imaginate sumado a los problemas que tiene actualmente Argentina en cuanto a clima y los problemas de infraestructura, es algo imposible.","replies":[{"poster":"BOT Yásuo","date":"2016-04-17T15:08:15.091+0000","up_votes":1,"down_votes":0,"body":"Diferencia de idioma es lo que nos separa de Brasil?\nEn Valve el servidor es BR y anda mejor que LAS te lo puedo asegurar.\nObviamente los BR son ciertamente insoportables, una molestia de seres vivos, al menos en los ranks más bajos.\n\nSabes cual es la cosa? todos pero absolutamente todos saben que los BR son iguales a los Rusos salvo que más boludos, son increíblemente tóxicos e insoportables, no hicieron un servidor simplemente para que ellos esten mejor y les ande bien piola, si no que es para que estos se vayan de sus servidores para bajar la toxicidad y trolls por partida.\n\nLo mismo sucedió en el LoL, por eso el servidor fue Brasil, una lástima que no me haya pasado a ese servidor, a día de hoy no estaría haciendo este post...\n\nNo pido un servidor 100% Argentino únicamente, aunque teniendo en cuenta la cantidad de jugadores entre Arg y Ur técnicamente debería ser Argentino, es verdad que los problemas de infraestructura son algo serio, además las ISP argentinas no son muy confiables, hace 5 años desde que me mude todavía no cambiaron 1 cable cortado...\n\nLo que pido es que el sistema de ruteo sea diferente, que no tenga que hacer tanto quilombo para llegar al servidor, si no es nuestra ISP es el servidor yankee, si no un problema en la conexión con chile desde arg si no desde eeuu hasta chile, siempre hay un problema...","replies":[]}]},{"poster":"iTargaryen","date":"2016-04-17T13:36:22.666+0000","up_votes":1,"down_votes":0,"body":"Aparte, todos los servidores deben tener problemas de conexion, como OCE y LAN, ¿Qué somos nosotros, que al tener problema de conexión, lo primero que se nos viene a la mente es tener un servidor para nosotros mismos? ¿Porqué no nos la bancamos un poco? todos los países de Latinoamerica tienen problemas de conexión, y algunas partes de Europa ni te digo..., si no me crees habla con algún español haber lo que te dice...\nEn fin, yo creo que deberíamos seguir protestando acá en el foro haber que obtenemos, y sino a juntar firmas, que se yo, algo hay que hacer para que nos den bola...","replies":[]}]},{"poster":"Zesc","date":"2016-04-17T16:33:18.795+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=HotPan,realm=LAS,application-id=v7qsfXsE,discussion-id=j45N7Pj0,comment-id=0007,timestamp=2016-04-16T03:38:21.406+0000)\n>\n> Aunque no lo creas y despues de leer ese wall of text. el problema esta vez no es el server. El problema reside en el enlace Chile-Argentina. Lo se porque cuando se cayó el LoL, tambien se cayo mi conexiona  un ventrilo que uso para hablar on otra gente. Este ventrilo esta hosteado en Chicago. Por lo tanto, puedo decir 100% seguro esta vez el problema es el enlace o algun corte de fibra...no el server.\n\nPero de repente jugas en Brasil y anda a 30ms.... No es culpa de las isp tampoco","replies":[{"poster":"fenakz","date":"2016-04-17T22:36:51.455+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=frani00,realm=LAS,application-id=v7qsfXsE,discussion-id=j45N7Pj0,comment-id=00070001,timestamp=2016-04-17T16:33:18.795+0000)\n>\n> Pero de repente jugas en Brasil y anda a 30ms.... No es culpa de las isp tampoco\n\nEn algunos casos, speedy anda mal en brasil 80-100 ms tiene aproximadamente fibertel es el que andaperfecto en BR","replies":[]}]}]},{"poster":"ArandaAcosta sba","date":"2016-04-16T03:06:21.967+0000","up_votes":1,"down_votes":0,"body":"Tenes fibertel?, acabo de empezar una y estoy con 160 de ms constante","replies":[{"poster":"BOT Yásuo","date":"2016-04-16T03:12:16.440+0000","up_votes":3,"down_votes":0,"body":"Sí, acabo de terminar de hecho.\nSin embargo no solo a Fibertel le afectó en este caso, de hecho a un amigo de un pueblo con un internet diferente (Empresa pequeña) también le sucedió, y a un amigo Uruguayo lo mismo.\nNo creo que sea simplemente Fiber, pero para variar en Chile no paso mucho, me pasó lo mismo a la tarde, ganaron la partida como si nada.","replies":[]}]},{"poster":"FurchiDC","date":"2016-04-16T06:07:13.451+0000","up_votes":2,"down_votes":1,"body":"No es el servidor de Riot, sino la ruta que toman los datos desde tu PC hacia el servidor y viceversa. Esa ruta, de fibra óptica, no es propiedad de Riot, por lo que no es su culpa.\n\n--\n>Saludos. {{champion:134}}{{item:3211}}{{champion:84}}","replies":[{"poster":"Robin Hoody","date":"2016-04-16T17:55:21.085+0000","up_votes":1,"down_votes":0,"body":"por que siempre dejas esa firma con akali y syndra :v ??","replies":[{"poster":"FurchiDC","date":"2016-04-18T04:47:19.601+0000","up_votes":2,"down_votes":0,"body":"Porque son mia mores y mis mains ♥. La capucha me representa a mi como invocador.\n\n\n\n--\n>Saludos. {{champion:134}}{{item:3211}}{{champion:84}}","replies":[{"poster":"Robin Hoody","date":"2016-04-20T02:09:08.544+0000","up_votes":1,"down_votes":1,"body":"entonces voy a empesar a firmar con mis mains :v {{champion:84}} {{champion:61}} {{item:3211}} {{champion:412}} {{champion:40}}","replies":[{"poster":"FurchiDC","date":"2016-04-20T03:52:29.954+0000","up_votes":2,"down_votes":1,"body":"No estás obligado, es algo que hago porque me gusta xD.\n\n\n--\n>Saludos. {{champion:134}}{{item:3211}}{{champion:84}}","replies":[{"poster":"Robin Hoody","date":"2016-04-21T02:12:23.673+0000","up_votes":1,"down_votes":0,"body":"nunca dije que me sintiera obligado ajajja","replies":[]}]}]}]}]}]},{"poster":"Verji","date":"2016-04-16T03:09:36.105+0000","up_votes":3,"down_votes":28,"body":"es viernes, sali a bailar virgen\n{{champion:119}}","replies":[{"poster":"DanielGarrita","date":"2016-04-16T04:12:38.250+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=Verji,realm=LAS,application-id=v7qsfXsE,discussion-id=j45N7Pj0,comment-id=0002,timestamp=2016-04-16T03:09:36.105+0000)\n>\n> es viernes, sali a bailar virgen\n> {{champion:119}}\n\n  \n\nen mi pais esta lloviendo a full bobo.\n\n\n\narreglen los serveeeeeeer\n\n{{sticker:slayer-jinx-catface}}","replies":[{"poster":"Chante","date":"2016-04-16T07:04:43.392+0000","up_votes":2,"down_votes":0,"body":"macho lomo plateado sale con lluvia (?","replies":[]}]},{"poster":"Manu Carba","date":"2016-04-16T03:20:52.223+0000","up_votes":5,"down_votes":0,"body":"Y vos que estas haciendo? Dios mio...","replies":[{"poster":"Verji","date":"2016-04-16T03:24:53.706+0000","up_votes":1,"down_votes":7,"body":"yo estoy haciendo la previa :) \n{{champion:115}}","replies":[{"poster":"LukerioLok","date":"2016-04-16T06:37:18.801+0000","up_votes":3,"down_votes":0,"body":"CLARO... la previa en los foros de las \"esto se va descontrolaaar\" en la silla de tu cuarto en la pc tal cual yo {{sticker:zombie-brand-clap}}","replies":[]}]}]}]},{"poster":"Exit","date":"2016-04-16T03:22:24.711+0000","up_votes":2,"down_votes":0,"body":"NO COMPREN MAS RP xd","replies":[{"poster":"BOT Yásuo","date":"2016-04-16T03:43:40.317+0000","up_votes":1,"down_votes":0,"body":"Pero el skin de yasuo bloodmoon :(","replies":[]}]},{"poster":"Franja","date":"2016-04-16T03:08:21.572+0000","up_votes":3,"down_votes":1,"body":"Es que muchas veces los problemas son ajenos a Riot, no del servidor como tal. Si no de los enlaces de los ISP y las formas de ruteo. Asi que la solucion no es tan simple como invertir mas dinero, porque a veces son cosas que les escapa de las manos.","replies":[{"poster":"Whitesse","date":"2016-04-16T03:15:50.129+0000","up_votes":2,"down_votes":0,"body":"Siempre la misma excusa ponen, como con las ranked 3v3.","replies":[]}]},{"poster":"Buyess","date":"2016-04-16T03:09:58.931+0000","up_votes":2,"down_votes":0,"body":"a mi me paso  lo mismo jugando con unos amigos :7 , es un dolor de huevos estar en partida y que se te caiga de la nada","replies":[]},{"poster":"Verji","date":"2016-04-16T03:14:00.966+0000","up_votes":2,"down_votes":1,"body":"en que mundo viven? es problema de CABASE, un central que maneja ciertas empresas de interntet y por las cuales pasan las conexiones para que nos llegue el server de lol. por eso ALGUNOS argentinos tienen problemas y otros no, dependiendo la empresa si esta conectada a CABASE.","replies":[{"poster":"Sakura Star","date":"2016-04-16T03:43:39.806+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=Verji,realm=LAS,application-id=v7qsfXsE,discussion-id=j45N7Pj0,comment-id=0004,timestamp=2016-04-16T03:14:00.966+0000)\n>\n> en que mundo viven? es problema de CABASE, un central que maneja ciertas empresas de interntet y por las cuales pasan las conexiones para que nos llegue el server de lol. por eso ALGUNOS argentinos tienen problemas y otros no, dependiendo la empresa si esta conectada a CABASE.\n\nY vos en que mundo vivis? digo, pareciera que vivis una UTOPÍA nivel Cristina K.\nPero una cosa es hacerle 382489439438234384934923429349234934 de checkeos a todo y te de normal y otra que el jodido servidor donde esta esto(Alias CABASE), ande como el traste.\nMe parece que vos vas mas colgado que un coco en palmera en playa desierta.\nSupongo que no hay \"lo que hay que tener\" para hacer las quejas correspondientes.\nMe parece a mi no mas.\n----\nPor cierto tambien tengo fibertel y la misma historia....\nSiempre la culpa la tiene mi ordenador {{sticker:slayer-jinx-unamused}}","replies":[{"poster":"Ch4puLin","date":"2016-04-16T23:53:56.239+0000","up_votes":1,"down_votes":0,"body":"Hmm no entendés mucho, y te gusta escribir.\nDeberías leer un poco más así no ponés cualquier cosa.","replies":[]}]}]},{"poster":"Ks Erwyn","date":"2016-08-16T01:29:40.417+0000","up_votes":1,"down_votes":0,"body":"Debieran invertir en camperas de alpacas.......༼つಠ益ಠ༽つ =≡ΣO","replies":[]},{"poster":"lordeman10","date":"2016-04-17T10:59:29.655+0000","up_votes":1,"down_votes":0,"body":"ignoro totalmente si existe la posibilidad de que riot pueda mejorar la situación a partir de invertir en mas recursos pero si se puede ojala lo hagan porque es un tema urgente, en lo personal no tuve lag pero me podria haber tocado a mi\n\nlos eventos son importantes para el lol tambien, si el juego no se promociona de alguna forma pierde el populismo que lo lleva a ser tan buen juego, no se trata de vamos a gastarnos en hacer esto a ver como se divierten los pi, siempre es una inversión a riot lo maneja gente seria ","replies":[]},{"poster":"AlmostBurning","date":"2016-04-17T01:27:48.992+0000","up_votes":1,"down_votes":0,"body":"Todos los pequeños juegos parten bien y se preocupan mucho por sus jugadores, hasta que se convierten en verdaderos monstruos del marketing y sus arcas financieras se comienzan a llenar... Ahi es cuando dejan de ver al jugador como tal y éste  pasa a convertirse en un signo  --> $.\n\nSi lo que les importa es más el dinero que los problemas que afectan a los jugadores de determinada región, aunque seamos los sudacas tercermundistas que somos, está bien. Lo que es yo, en cuanto aparezca un videojuego competencia para Lol ( y yo, con mi pc a carbón pueda migrar) de seguro lo haré.\n\nSaludos.\n\nPd: Mucha mejora grafica hecha a la medida de computadoras potentes, 0% performance para pc mas antiguas. (Aló, animaciones del cabello de Lissandra?)","replies":[]},{"poster":"Gato 22","date":"2016-04-16T23:03:23.545+0000","up_votes":1,"down_votes":0,"body":"Y Rito Solo Piensa en la Plata q Debe ingresar por skins ,iconos,wards etc...pero de gastar plata nada {{sticker:slayer-jinx-unamused}} ","replies":[]},{"poster":"support girl uwu","date":"2016-04-16T15:46:33.273+0000","up_votes":1,"down_votes":0,"body":"El problema no está en las oficinas de Riot LAS, es algo entre la conectividad argentina-chile, y latinoamericana en general que está mal, y Riot, ni creo que ninguna empresa de juegos, es tan mega-billonaria como para hacer su propia red de internet desde 0 que funcione sin lag ni interrupciones, los sistemas de redes de EU, KR, NA, etc. son incomparables y por mucho a los que hay en LATAM, es obvio que ahí la conexión va a ser tanto mas rápida como mas estable, y no tiene nada que ver con Riot.  La solución está en que las empresas de cada país (principalmente Arg.) mejoren su infraestructura, no en que Riot invierta más o menos en el server.","replies":[]}]}