{"poster":"Shadow Entrancer","date":"2019-02-11T04:31:40.588+0000","title":"In the Dusk of the Next Lunar Year","subforum":"FanFiction","up_votes":2,"down_votes":0,"body":"&ldquo;I smell a fire ahead,&rdquo; Nasus said. &ldquo;It is close.&rdquo; \r\n\r\nLu-Xanna worried her lip. Travellers were rare in the Jade Forest at night, and for good reason. The occupants liked human flesh. Despite her fear of what lurked in the shadows, monsters did not need fires. \r\nNasus added gently, &ldquo;We must rest if we are to fight the Lunar Wraith when dusk approaches.&rdquo; \r\nLu was exhausted, and as always, she saw the wisdom in his words. \r\n&ldquo;If it is trouble, Wicky will protect us.&rdquo; She fondly scratched the Temple Guardian. Warwick huffed, but his traitorous tail aggressively whipped the shrubbery. \r\n\r\nThe three of them had travelled throughout the year hunting a Lunar Wraith. A gruelling journey since her home, a temple hidden deep in the Bamboo Mountains, was destroyed by an onslaught of demons and ogres. It had been her fault. Lu had freed a Great Demon sealed for centuries hidden beneath the temple. She had only survived because of the two stone statues in her pouch, the physical embodiments of her Dog Guardians. They were hers, as Nasus and Warwick insisted that Lu was the reincarnation of the Lunar Empress. Or she would be, when she reclaimed the Lunar Staff the Wraith had taken. Then she would regain her Light and her Guardians their true bodies. Presently they were entrapped as one slobbering scruffy wolf pup, and a slim greyed regal dog, both only as high as her hip.  Tonight&rsquo;s New Year moonlight would awaken their powers and they would challenge the Lunar Wraith. The Wraith with the warm, deep, coaxing voice and gentle eyes. The one who had understood her but remained as mysterious as the moon&rsquo;s dark face. Lu shivered and tightened her cloak. _Sylas_. \r\n\r\nCarefully they approached the fire. The trees broke apart revealing a herd of unnaturally large pigs, trembling the trees with their thunderous snores. Surrounding the clearing were caravans painted in bright colours, reading &ldquo;The Great Travelling Performers, the _&#039;Fire Crackers&#039;_!&rdquo;. \r\n\r\n&ldquo;Oh! I remember them,&rdquo; Lu whispered. &ldquo;The last town said they will perform in the Heavenly Pheasant City all throughout the week for the Lunar Revel. The city must be very close.&rdquo; \r\nWicky muttered that all humans and their exploits were the same to him, but he was eyeing the roasting meat over the fire. Lu hoped it was not pork&hellip; Or human. \r\nThen she felt something very cold and sharp press into her back. Lu froze. \r\n&ldquo;Cute pets. Turn around.&rdquo; \r\n\r\nSlowly, Lu obeyed. The speaker was a woman in a fitted costume of beautiful reds and gold. She was peering through a pair of dark moon spectacles, her lips pulled into a luscious smirk. Held between them was a large crossbow that gleamed wickedly. Lu gulped. Her Guardians slinked around her protectively, but it was futile.  \r\n\r\n&ldquo;I mean no harm. I-, I am human!&rdquo; \r\n\r\nThe woman laughed richly. &ldquo;I know child. I have a sense for demons. Come, join us by the fire.&rdquo; \r\n\r\nShe lowered the weapon and led the way. Her predatorial gait had a sauntering confidence that Lu envied. \r\n\r\n&ldquo;I did not even sense her,&rdquo; growled Wicky beneath his breath. &ldquo;It was as if she came from the shadows.&rdquo; \r\n\r\n&ldquo;Keep alert,&rdquo; Nasus warned but Lu felt safer than she had all month. A curse? No. She craved the companionship of other humans. \r\n\r\nA woman with a gold hair ornament tended the roast. The woman nodded in greeting, and Lu responded with a tentative smile, sitting opposite. Lu was glad. Even from afar the smell of pig odour was suffocating. \r\n\r\n&ldquo;Oh, look! New victim! Is she for target practice?&rdquo; Chipped a high-pitched voice. Peering around a caravan was a thin girl that looked too pale to be healthy. Her hair was split into two pigtails and wrapped with red cloth, with a vibrant green fringe. Lu&rsquo;s blonde hair did not seem so out of place. \r\n\r\n&ldquo;She&rsquo;s a visitor. We are _nice_ to visitors,&rdquo; the cook said. &ldquo;Don&rsquo;t mind Jinx. She&rsquo;s had a tough upbringing.&rdquo; \r\nThe girl reappeared holding a dragon firework launcher. Wicky snapped at her but Jinx jumped over the dog and thudded the machinery next to Lu. &ldquo;What do you think of this?&rdquo; \r\n\r\n&ldquo;I suppose it looks&hellip;great?&rdquo; \r\n\r\nShe beamed. &ldquo;This is my newest creation. Its crackers shoots crackers. I call-&rdquo; \r\n\r\n&ldquo;Jinx, that&rsquo;s enough,&rdquo; scolded the woman again. Thankfully, Jinx darted away. She turned to Lu. &ldquo;Call me Sej. We are the travelling troupe, &lsquo;The Firecrackers&rsquo;. Our leader, Vayne, you already have met.&rdquo;  \r\n\r\nVayne took a seat beside Sej, crossing long legs. &ldquo;Would you like some food, girl?&rdquo; \r\n\r\n&ldquo;Oh yes please,&rdquo; Lu said eagerly. Vayne nodded at Sej, who hooked a large pot onto the fire. &ldquo;I am Lu. I hear that you parade through the capital for the Lunar Revel?&rdquo; \r\n\r\n&ldquo;So, you have heard of us,&rdquo; Vayne smiled. &ldquo;Jinx is our firepower, and Sej is on the drums. We have other members who are asleep. They lead the parade on a dragon float, with a _lively_ Lion dance and a pet bear.&rdquo;\r\n\r\n &ldquo;Sometimes we blow up buildings!&rdquo; Jinx cackled, appearing again. Something itched at the back of Lu&rsquo;s mind. Something about a wanted villain in the far away Warring Kingdoms. \r\n\r\n&ldquo;It sounds like so much fun.&rdquo; \r\n\r\n&ldquo;It is,&rdquo; said Vayne. \r\n\r\n&ldquo;Really, my favourite part is the food. The whole road is lined with stalls of dumplings and pancakes and noodles. I eat enough for the whole year,&rdquo; laughed Sej. \r\n&ldquo;The children are brilliant,&rdquo; Jinx whispered reverently, a sparkle in her eyes. Lu thought it might be insanity. &ldquo;They run through the crowd waving fireworks and sparklers. It all catches aflame!&rdquo; \r\nDefinitely insanity. \r\n\r\n&ldquo;What do you do for Lunar Revel?&rdquo; Sej asked, passing Lu a bowl. It was rice porridge.\r\nLu cradled it, considering her answer. She could not say she hunted a Lunar Wraith. With a pang of sadness, she spoke of home. &ldquo;I go to a temple. We light lotus lanterns and lift them to the heavens to join the stars and welcome the spirits of the new year&rdquo;\r\n\r\n&ldquo;With your family?&rdquo; \r\n\r\nLu hesitated. &ldquo;No, but I recently learned that I was born in the Warring Kingdoms lands. I have a brother.&rdquo; \r\n\r\n&ldquo;Strange, for a Warring Kingdoms child to believe in spirits and gods.&rdquo; \r\n\r\nLu nodded. &ldquo;I want to go there after tonight.&rdquo;\r\n\r\nLu scrapped her congee clean. The spirit guardians were tossed a bone each. Nasus refused to look at it, but Wicky gorged himself. On both. \r\n\r\nA pig began squealing from the herd and Sej left, muttering something about a bristle. A piglet came sleepily snuffling over. Vayne picked it up and plopped the baby on her lap. It examined Lu with one eye. \r\n\r\n&ldquo;Careful, Zodiac Sister. There are more Lunar Wraiths than just yours.&rdquo;\r\n\r\nHer Guardians were instantly alert. Lu gaped at Vayne. How did this stranger know of their journey to hunt Sylas? \r\n\r\n&ldquo;I, too, seek a Lunar Wraith that destroyed my family.&rdquo; \r\n\r\nLu licked her dry lips. &ldquo;Should I be afraid of this Wraith?&rdquo; \r\n\r\n&ldquo;Yes. She wanders in the shadows, seducing the unaware.&rdquo; A breeze rustled the leaves ominously. For once Vayne&rsquo;s smirk was absent. &ldquo;We call her the Eve of the Lunar Revel.&rdquo; \r\n\r\nLu shuddered. Vayne&rsquo;s smile was back, and she motioned to a caravan. &ldquo;Enough talk about nightmares. Sleep, for you have a long battle ahead of you.&rdquo; \r\n\r\nLu nodded. She thanked the woman and began heading to the indicated cart. She caught Jinx&rsquo;s attention walking past. \r\n\r\n&ldquo;Will you be joining us for the Festival?&rdquo; The girl tilted her head, spinning one long pigtail. \r\n\r\nLu bit her lip and shook her head. &ldquo;No, my journey takes me elsewhere.&rdquo; \r\n\r\n&ldquo;Sad. In some other universe, we could have been great friends.&rdquo; Jinx grinned wildly and returned to the explosives. \r\n\r\nLu gave a hesitant smile and walked to the storage caravan. It was a little dusty, but better than the forest floor. She lay on a pile of discarded clothes, gazing through a trapdoor at the golden stars. Her Guardians snuggled in. \r\n\r\n&ldquo;I wish I could,&rdquo; she whispered to her friends. They knew what she wanted. \r\n\r\nLu wanted to see the Firecrackers perform and feel their drums echo in her bones. To receive red envelopes and wish everyone prosperity and happiness. Feast with her Guardians, family and friends on the traditional food and tie wishes onto sleeping peach trees. Perhaps see the sparkle of fireworks in someone&rsquo;s eye while wrapped in warmth&hellip; \r\n\r\nWicky nuzzled her cheek. &ldquo;Do not worry. When we have finished Sylas, we will light all the lanterns and firecrackers.&rdquo;  \r\n\r\nNasus looked down at her, the first ray of dawn shining in his eyes. &ldquo;The Lunar Goddess watches the cycle continue. Next year, it will begin again. Sylas will die, and we will celebrate.&rdquo; \r\n\r\nShe smiled and grabbed them both. They whimpered half-heartedly as she squeezed them against her chest. \r\n\r\n&ldquo;Thank you for being with me. I could not do this without you.&rdquo; Lu relaxed her grip and felt sleep approach. She inhaled deeply and let go. They smelled of home.","replies":[{"poster":"Shadow Entrancer","date":"2019-02-11T04:34:17.921+0000","up_votes":2,"down_votes":0,"body":"Details: \nWord Count: 1500 words exactly (according to Microsoft Word). \n\nFor readers: Can you spot all 13 referenced champions? {{champion:99}} {{champion:19}} {{champion:75}} \n:D","replies":[]}]}