{"poster":"1989141514","date":"2015-10-14T12:35:00.205+0000","title":"Probleme mit Kabeldeutschland","subforum":"Hilfe & Support","up_votes":2,"down_votes":1,"body":"Hey zusammen,\r\nseit dem Wochenende hat sich bei mir folgendes Problem herauskristallisiert: Jedes Mal wenn ich mich bei LoL einlogge, im champselect bin und das Spiel starten sollte, kommt folgende Meldung: &quot;Verbindung zum Server konnte nicht hergestellt werden. Butte &uuml;berpr&uuml;fe deine Netzwerkverbindung und versuche, die Verbindung mit deinem Spiel wiederherzustellen.&quot;\r\nIch habe herausgefunden, dass dieses Problem meist dann auftaucht, wenn ich zus&auml;tzliche den Browser, TS oder &auml;hnliches ge&ouml;ffnet habe. Schlie&szlig;e ich alles andere neben LoL, kann die Verbindung nach mehreren Versuchen hergestellt werden. Bin ich im Spiel, kann ich s&auml;mtliche Programme  wieder &ouml;ffenen und sogar hd-streams schauen ohne ingame ms probleme zu bekommen. Es betrifft also lediglich die Start Phase.\r\nGenerell habe ich diese Probleme ausschlie&szlig;lich bei lol. Ich habe eine 100k Leitung von Kabel die auch normal Rund um die Uhr ankommt. Keine Probleme beim Download, Upload oder &Auml;hnlichem.\r\nDieses Problem tritt bei mir nun seit dem 10. Oktober 2015 auf, vielleicht hat der ein oder andere Kabel Nutzer ja das gleiche Problem, w&uuml;rde mich sehr interessieren.\r\nIch habe &uuml;brigens mal versucht die Internetverbindung mit meinem Handy herzustellen um das Spiel zu starten.... \r\nDas ganze war kein Problem, hatte aber nat&uuml;rlich ne MS von 1000... Aber die Startphase hat keine Probleme bereitet.\r\nLiebe Gr&uuml;&szlig;e und Danke f&uuml;r etwaige Antworten.\r\n\r\nJust","replies":[{"poster":"TryHardlon","date":"2015-10-15T19:53:13.230+0000","up_votes":2,"down_votes":0,"body":"Also SAME HERE :D Kabeldeutschland 100 Leitung am start , wenn ich ingame komme nach 2-3 min oder mehr \"attempting to reconnect\" hab alles schon gemacht zweimal System reseted, sogar mein mein Internet auf ipv4 umgestellt, Ip-Dienst ausgemacht und EINFACH alles. Ich verstehe es nicht es ist nur bei lol. Vor dem 8-9 Oktober ging alles suppi. Dachte 5.20 fix das weil an mir kann es ja nicht liegen. RIOT pls !\n{{item:3070}}","replies":[]},{"poster":"Rkoturdo Ndo","date":"2015-10-14T20:41:09.991+0000","up_votes":1,"down_votes":0,"body":"Heya\nMagst du mal ein Tracert erstellen?\n> Ein tracert erstellt eine Liste der Server über die das Paket an einen bestimmten Server geschickt wurde. In unserem Fall von dem Hausanschluss bis zum Riotserver.\n> Zusätzlich wird noch protokolliert in welchem Zeitraum die Pakete verschickt wurden.\n> Ein gutes Programm um viele tracerts anzufertigen und auszuwerten ist Pingplotter. Download:\n> https://www.pingplotter.com/downloads/pingplotter_install.exe\n> 1. Das 'Trace Interval' sollte auf '1 second' eingestellt werden.\n> 2. Die 'Address to Trace' ist in unserem Fall 185.40.65.1\n> 3. trace starten\n> 4. Es wird jetzt jede Sekunde ein tracert durchgeführt. Während Pingplotter im Hintergrund läuft, kann man ein Testspiel in LoL starten um zu testen ob Probleme auftreten.\n> Sollte es Verbindungsprobleme geben, geht es mit Schritt 5 weiter. Gibt es keine Verbindungsprobleme sind die tracerts >vermutlich nutzlos.\n> 5. Sollten Verbindungsprobleme aufgetreten sein, müssen die tracerts abgespeichert und ein Screenshot vom Programm gemacht werden. File -> Export to textfile...  http://fs1.directupload.net/images/141125/hmj3jxtl.png\n> 6. Samples to Export: All Samples  http://s14.directupload.net/images/141125/tn9c75t4.png\n> 7. 'Export...' Speichert die Textdatei am besten auf dem Desktop oder an einem Ort wo ihr diese auch wieder findet.\n> 8. Datein auf http://upload.wrenchmen.org hochladen und verlinken wenn ihr eure Antwort erstellt\n>\n> Anhand der tracerts kann man häufig die Fehlerquelle finden, wenn es sich bei den Verbindungsproblemen um Paketverlust oder einen hohen Ping handelt.\n\nMfG Rkoturdo","replies":[{"poster":"1989141514","date":"2015-10-14T21:00:08.330+0000","up_votes":1,"down_votes":0,"body":"[](http://upload.wrenchmen.org/8JrW96)\nhey\nhab den Test durchgeführt. Am Anfang hatte ich aus irgendeinem Grund gar keine Probleme.\nErst am Ende, als ich nen hd video, twitch und ts gleichzeitig an hatte, kamm wieder genannte Fehlermeldung.\n2x alt und f4 und ich kam trotzdem ins spiel!","replies":[{"poster":"1989141514","date":"2015-10-14T21:00:43.581+0000","up_votes":1,"down_votes":0,"body":"http://upload.wrenchmen.org/8JrW96","replies":[{"poster":"Rkoturdo Ndo","date":"2015-10-14T21:20:02.819+0000","up_votes":1,"down_votes":0,"body":"Heya\nHast du auch ein Screenshot von dem Programm?\n\nMfG Rkoturdo","replies":[{"poster":"1989141514","date":"2015-10-16T14:19:40.210+0000","up_votes":1,"down_votes":0,"body":"sry, dass ich erst so spät antworte.\nHabe eben den test gemacht, nach mehrmaligen versuchen bin ich dann letztlich ins spiel gekommen. \nhttp://upload.wrenchmen.org/DbVKk6 <- screenshot\nhttp://upload.wrenchmen.org/x7DMXp <- txt datei\ngestern abend hab ich btw auch gespielt, bin irgendwann ins game gekommen (nach 3x alt und f4), hatte aber erhöhten ping von ~75. Nebenbei lief nur ts","replies":[]}]}]}]}]},{"poster":"1989141514","date":"2015-10-14T15:11:21.805+0000","up_votes":1,"down_votes":1,"body":"hat leider nichts geändert. Trotzdem Danke für den Versuch =)","replies":[{"poster":"legofreak1","date":"2015-10-14T19:02:04.512+0000","up_votes":1,"down_votes":0,"body":"Kannst du dann bitte versuchen IPv6 zu deaktivieren:\nhttps://support.microsoft.com/en-us/kb/929852","replies":[{"poster":"1989141514","date":"2015-10-14T20:23:58.482+0000","up_votes":1,"down_votes":0,"body":"das hate ich schon getan. Leider keine besserung","replies":[]}]}]},{"poster":"Lee Sin Ghost","date":"2015-10-14T16:47:13.364+0000","up_votes":1,"down_votes":1,"body":"Same here auch das selbe Problem komm nicht immer in das Spiel und wenn einmal dan kommt nach einiger Zeit ingame das die Verbindung weg ist habe schon sogst wie alles ausprobiert, ich werde mir mal ein Lan-Kabel ranschaffen und dan sehen aus es läuft :/","replies":[{"poster":"1989141514","date":"2015-10-14T16:51:22.884+0000","up_votes":1,"down_votes":1,"body":"habe ich schon gemacht, hat keinen Unterschied gebracht!","replies":[{"poster":"Lee Sin Ghost","date":"2015-10-14T17:00:38.393+0000","up_votes":1,"down_votes":0,"body":"Das Ding ist ja das es keine richtige allgemeine Lösung giebt.","replies":[{"poster":"1989141514","date":"2015-10-14T17:40:30.405+0000","up_votes":1,"down_votes":0,"body":"Das Problem ist bei mir über Nacht aufgetaucht, ich hoffe das es auch wieder so verschwindet.","replies":[]}]}]}]},{"poster":"legofreak1","date":"2015-10-14T12:54:21.549+0000","up_votes":1,"down_votes":0,"body":"Deaktiviere bitte den IP-Hilfsdienst: Win + R:\"services.msc\" -> IP-Hilfsdienst beenden und deaktivieren.","replies":[]},{"poster":"1989141514","date":"2015-10-14T16:19:41.950+0000","up_votes":1,"down_votes":1,"body":"es hat sich doch was getan. Ich bekomm zwar immernoch die Fehlermeldung, aber nach drei maligem alt+f4 drücken komm ich dann immer rein.\nAber normal kann das ja nicht sein...Ist btw auch an meinem Laptop der Fall.","replies":[]}]}