{"poster":"Sensei Graitsu","date":"2015-10-25T15:03:59.066+0000","title":"Womit kann ich FPS steigern?","subforum":"Allgemeiner Chat","up_votes":1,"down_votes":2,"body":"Hey , ich spiele seit einiger Zeit League of Legends und bin momentan relativ unzufrieden mit meinem Setup.\r\nIch spiele normal bei einem 2v2 auf der Botlane mit ungef&auml;hr 100-120 FPS , doch sobald es in die Teamfights geht habe ich ungef&auml;hr 20 oder weniger FPS , sodass ich nicht richtig teamfighten kann , was mich ziemlich st&ouml;rt. Hier frage ich deswegen nach , ob es hier jemanden gibt der Ahnung hat. Ich habe vor kurzem meine Grafikkarte gewechselt und dadurch aber nur einen FPS boost von vielleicht 10 Frames bekommen , was ich verwunderlich fand. Ich hoffe  ,dass es hier jemanden gibt ,der mir vielleicht helfen kann und wei&szlig; , welche Teile ich austauschen muss um mindestens konstante 200 FPS zu haben und vorallem Teamfights richtig spielen kann , ohne so ein starkes Ruckeln.\r\nNun mein Momentanes Setup:\r\nProzessor: AMD Phenom(tm) II X6 1090T Processor 3.20 GHz\r\nInstallierter Arbeitsspeicher(RAM): 8,00 GB\r\nGrafikkarte: NVIDIA GeForce GTX 750 Ti\r\nEbenfalls habe ich glaube ich noch eine normale Festplatte(500GB) also keine SSD und ein Gigabyte Mainboard. Falls es noch irgendetwas gibt was man wissen muss (technische Daten) dann am liebsten sagen wo ich diese finde und dann schreibe ich sie hier rein.\r\nIch hoffe auf eine hilfreiche Antwort und danke im Voraus !","replies":[{"poster":"Kaito","date":"2015-10-25T16:37:54.148+0000","up_votes":1,"down_votes":0,"body":"Warte, du hast mit einer GTX 750 TI nur 20 FPS während den Fights?","replies":[{"poster":"SwissKeks","date":"2015-10-25T16:47:06.679+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Fizz In My Hands,realm=EUW,application-id=YnZkMR0R,discussion-id=kMnEUuGE,comment-id=0001,timestamp=2015-10-25T16:37:54.148+0000)\n>\n> Warte, du hast mit einer GTX 750 TI nur 20 FPS während den Fights?\n\nLiegt wohl eher an ihm selbst wie er den Pc behandelt statt statt am Pc selbst^^","replies":[{"poster":"Sensei Graitsu","date":"2015-10-25T17:45:51.476+0000","up_votes":1,"down_votes":1,"body":"?","replies":[]}]},{"poster":"Sensei Graitsu","date":"2015-10-25T17:46:13.342+0000","up_votes":1,"down_votes":1,"body":"Ja :(","replies":[]}]},{"poster":"Believing","date":"2015-10-25T15:58:55.710+0000","up_votes":1,"down_votes":0,"body":"Probier mal die ganzen Settings in LoL runterzuschrauben, die meisten Settings brauchen nicht auf High usw. gestellt werden. Ich selber hab n Gaming PC und spiele alles auf Low weil ich es persönlich besser finde (übersichtlicher.) Dann gibts noch Guides auf YT die dir helfen, such da einfach mal LoL FPS und dann kommen schon ein paar Anleitungen. Was mir jetzt so spontan einfällt ist z.B. das Unpark CPU Programm, dass lässt dich alle Kerne frei geben. Dann vlt. noch die Energiesettings auf Performance setzen. Außerdem hast du ne Geforce also geh doch da mal in die Systemsteuerung und stell die Einstellung auch eher auf Leistung als auf Qualität. Hoffe ich konnte dir helfen^^","replies":[]}]}