{"poster":"A41 Centurion","date":"2017-12-05T08:18:27.412+0000","title":"Quest Expired before I got reward","subforum":"[ARCHIVED] Help & Support","up_votes":2,"down_votes":0,"body":"EDIT: Issue has been resolved, and I forgot to ask Mods to lock this.\n\n\nhttps://i.imgur.com/j1PtTBP.png?1\nhttps://i.imgur.com/6ot6YNQ.png?1\n\nI'm relatively new here, and this is my first post, so I have no idea what you might do to help me with this...\nAs you can see in the second screenshot, the game registered that it was the 4th of December, and the game was less than 33 minutes.  The quest just expired as the client was reloading I guess?  Either way, I'd appreciate any help I could get!","replies":[{"poster":"Porocles","date":"2017-12-05T16:57:40.990+0000","up_votes":2,"down_votes":1,"body":"The missions were [announced on the event page](https://na.leagueoflegends.com/en/news/game-updates/special-event/learn-more-project-hunters-event) to prepare everyone for what to expect.  We'd like to look into these cases, though, if the match started before the mission expiration.  I can't make any guarantees, but hit us up in a [support ticket](https://support.riotgames.com/hc/en-us/requests/new) so we can take a closer look into what happened and if we can do something for you!","replies":[{"poster":"Battousaient","date":"2017-12-05T17:43:42.450+0000","up_votes":1,"down_votes":1,"body":"th event page doesn't say anything about having a last mission that you could play 100 games and actually not fulfill, It's RNG and gambling with your time, we all know the games win some lose some routine. When you put a reward at the end tho it makes it gambling because I'm doing all this work for that item but i may never get it, so my time is gambled away. Gambling is a sickness","replies":[]}]},{"poster":"Battousaient","date":"2017-12-05T08:37:58.747+0000","up_votes":2,"down_votes":1,"body":"Yeah, i was really upset actually when i did all those missions only to find out there was one last mission, is a gamble at best seeing as they put a darn time limit on it. \"the end of the hunt\" all that grinding for absolutely nothing. what a waste of my time, all i wanted was that emote and i actually for once put in the work for something they offer. The hours they expect you to give, people have lives.\n\n\n\n\n\n\n\n\n\n\n\n\nhad four hours left to finish and stayed up crushing those last missions and the final one is a kick in the face for all your hard work, at least if you didn't have the time to get it, to expect a win after all the wins you are already putting in, and also the time limit...... apparently we gamble now for thing we want. gamble our time. no more","replies":[]},{"poster":"A41 Centurion","date":"2017-12-06T17:48:15.685+0000","up_votes":1,"down_votes":0,"body":"Problem solved, Mods please Lock","replies":[]}]}