{"poster":" Señor Citrus","date":"2017-12-01T12:33:32.237+0000","title":"\"Trying to reconnect\" in client, but internet works normal","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"I get DCs in Client with no reason. When im in Queue it will get interrupted from the DC, but my internet is working normal. I cant play with my friends anymore because of that. On PBE client its the same. I tried the Hextech-Repair-Tool but it didnt helped. I added rules in firewall for everything i could find that is related to lol, but it didnt helped. I restarted my wifi and restarted my Pc, but nothing helped. I dont know what do do at this point. I would appreciate if i get a answer, where it doenst say \"Go through this list of connection issue problems or something like that\" Nothing of it helped. So Please! I want to play this game again.\r\n\r\n\r\n\r\n{{champion:20}} {{summoner:6}} {{summoner:1}}","replies":[{"poster":"Porocles","date":"2017-12-01T18:08:35.141+0000","up_votes":1,"down_votes":0,"body":"Sorry this still happens despite all the troubleshooting.  :(  In this case, download our [hextech repair tool](https://support.riotgames.com/hc/en-us/articles/224826367) to collect some logs and attach them to a [support ticket](https://support.riotgames.com/hc/en-us/requests/new).  This will go to our tech team who can take a closer look and help you out directly.  See you there!","replies":[]},{"poster":"Wete","date":"2017-12-03T12:21:23.269+0000","up_votes":1,"down_votes":0,"body":"Same problem.","replies":[]},{"poster":"Itachî","date":"2017-12-01T18:03:26.473+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name= Señor Citrus,realm=EUW,application-id=osqw6G4M,discussion-id=JVo8xeOr,comment-id=,timestamp=2017-12-01T12:33:32.237+0000)\n>\n> I get DCs in Client with no reason. When im in Queue it will get interrupted from the DC, but my internet is working normal. I cant play with my friends anymore because of that. On PBE client its the same. I tried the Hextech-Repair-Tool but it didnt helped. I added rules in firewall for everything i could find that is related to lol, but it didnt helped. I restarted my wifi and restarted my Pc, but nothing helped. I dont know what do do at this point. I would appreciate if i get a answer, where it doenst say &amp;quot;Go through this list of connection issue problems or something like that&amp;quot; Nothing of it helped. So Please! I want to play this game again.\n> \n> \n> \n> {{champion:20}} {{summoner:6}} {{summoner:1}}\n\ni have this problem too. it's caused by your routher, get a different one","replies":[]}]}