{"poster":"PetiteTater","date":"2017-10-01T08:37:45.996+0000","title":"Dc from flex game and now can't Login in??","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"is this a bug going on? i'm so confused i keep seeing post about people getting booted outta games only to find out they can't reconnect i've been trying to log back in for 40mins now i keep getting error ....nothing was wrong with my internet either ;-; i lost lp for that and got x9 reported i'm sure ...someone help .-.","replies":[{"poster":"Broporo","date":"2017-10-01T21:59:36.632+0000","up_votes":1,"down_votes":0,"body":"It actually looks like Charter Spectrum has been having quite a few issues allowing players to access game servers like ours or blizzards for example. Let me know if you happen to be using them as well, since it does look like they are still having a number of problems currently.","replies":[{"poster":"PetiteTater","date":"2017-10-05T20:27:23.506+0000","up_votes":1,"down_votes":0,"body":"welp it started up again saying i have no internet connection and random attempting to reconnect i'll exit game after like 2mins only to get random ping spikes then champ won't be able to cast any spells but i am moving freely with some delay ...there goes another rank game lol","replies":[]}]},{"poster":"OccasionallyBad","date":"2017-10-01T13:24:44.650+0000","up_votes":1,"down_votes":0,"body":"it was fixed, but now its happening again......","replies":[]},{"poster":"I got big PP","date":"2017-10-01T09:51:22.092+0000","up_votes":1,"down_votes":0,"body":"Exact same situation as the guys before me, except it eventually let me log in, i started a game and randomly dced.. the game is still going on probably but i cant log in... i better not get banned for this >:(","replies":[]},{"poster":"Aravie","date":"2017-10-01T09:21:24.036+0000","up_votes":1,"down_votes":0,"body":"Same issue here, I am also using Charter Spectrum wifi and had to use my phone to comment this, whenever i login it sits on authenticating for a while then goes to unknown error... Friggin sux rito come on","replies":[{"poster":"OccasionallyBad","date":"2017-10-01T09:24:56.646+0000","up_votes":1,"down_votes":0,"body":"Hey mine just started working again! Yours should too since we both have spectrum","replies":[{"poster":"PetiteTater","date":"2017-10-01T09:31:55.988+0000","up_votes":1,"down_votes":0,"body":"mine is working now!!! ...but there goes my lp ;-; rito needs to look into this","replies":[]}]}]},{"poster":"OccasionallyBad","date":"2017-10-01T09:15:13.490+0000","up_votes":1,"down_votes":0,"body":"I am having the same issue. I was in a ranked duo and disconnected randonly almost instantly no lag spike. My internet was fine as i was in voice and didnt even dc there. I closed the game after 2 mins of waiting to reconnect and tried to log in the client and it just says authenticating and the will go to unknown error. \n\nI have charter spectrum internet and everything else other than league of legends is working fine, however i couldnt even log in to the forums. I had to log in on my phone to write this responce..","replies":[]},{"poster":"HavenKai","date":"2017-10-01T09:06:48.007+0000","up_votes":1,"down_votes":0,"body":"Yeah same. Really annoying. Kinda upset no rito response on the issue.","replies":[]}]}