{"poster":"Neeko the Ekko","date":"2015-12-28T16:18:08.067+0000","title":"Solo Q in der Pre-Season machbar?","subforum":"Champions & Gameplay","up_votes":2,"down_votes":1,"body":"Bisschen QQ muss auch sein...\r\n\r\nEben 2 Solo Q&acute;s gemacht. Ich dachte bisschen Fun und climben w&auml;re kein Problem. \r\nErste Game eine Cait die einfach mal 20x stirbt. (Also jede zweite Minute)\r\nund das andere wo 2 wegen lags AFK sind und die Gegner den Nexus in der 18. Min einrei&szlig;en. \r\n\r\nJo wie l&auml;uft&acute;s bei euch so?\r\n\r\nIch sollte die Pre-Season meiden und warten auf die richtige 6. Season. \r\nDann 5vs5 mit Kumpels climben. W&auml;re sicherlich besser als mit 4 anderen Random mit Problemen zu spielen. ^.^\r\n\r\nHave Fun bei den Downvotes... =)","replies":[{"poster":"lowratte","date":"2015-12-28T17:00:25.739+0000","up_votes":2,"down_votes":0,"body":"Oobdeluxe:\n\nLetztes Game: Swain (Mid) - 0/4/5 \nDavor (Das Game mit der Cait): Quinn (Jungle) 18/11/19 - Zwar gut Kills geholt, aber auch sehr häufig gestorben. Aufgrund der Spiellänge dürften die Stats zu diesem Zeitpunkt relativ egal gewesen sein. Der Großteil war auf beiden Seiten fullbuild. Die LB war etwas behind. Letztendlich wahrscheinlich eher durch die Teamtaktik und eine nicht berausche Late-Game-Combo verloren.\n\nDie Teambuilder-Spiele davor sehen auch nicht besonders berauschend aus.\n\nIch würde zuerst an deinen eigenen Fehlern arbeiten, bevor du deine Teammates angehst.","replies":[{"poster":"Neeko the Ekko","date":"2015-12-28T18:11:18.483+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=lowratte,realm=EUW,application-id=Wj1wcocU,discussion-id=XhthITdH,comment-id=0002,timestamp=2015-12-28T17:00:25.739+0000)\n>\n> Oobdeluxe:\n> \n> Letztes Game: Swain (Mid) - 0/4/5 \n> Davor (Das Game mit der Cait): Quinn (Jungle) 18/11/19 - Zwar gut Kills geholt, aber auch sehr häufig gestorben. Aufgrund der Spiellänge dürften die Stats zu diesem Zeitpunkt relativ egal gewesen sein. Der Großteil war auf beiden Seiten fullbuild. Die LB war etwas behind. Letztendlich wahrscheinlich eher durch die Teamtaktik und eine nicht berausche Late-Game-Combo verloren.\n> \n> Die Teambuilder-Spiele davor sehen auch nicht besonders berauschend aus.\n> \n> Ich würde zuerst an deinen eigenen Fehlern arbeiten, bevor du deine Teammates angehst.\n\nHabe in dem Swain-Spiel getiltet. \nIch konnte mir das einfach nicht geben und habe einfach meine Lane gefarmt. \nWenn Top und Bot Lane nach 10 Min nicht mehr da ist, hast du einfach keine Lust mehr auf das Spiel und willst einfach surrendern.\n\nDas Quinn Spiel lief bist zum Mid Game relativ gut. \nAm Ende ist dann die Cait dahin gegangen wo keine Wards sind > Instant tot! ^^","replies":[]}]},{"poster":"Flakies12","date":"2015-12-28T19:17:58.584+0000","up_votes":1,"down_votes":0,"body":"Ich denke nicht das dein Problem die Pre Season ist. Vieleicht erinnerst du dich an deinen Beitrag im Forum vor ein paar Monaten zurück. Der Beitrag in dem du geschrieben hast du würdest es nicht auf Gold 5 schaffen. Wo ich mich bei dir daraufhin gemeldet habe um dir von ich glaube Silver4/3 auf Gold 5 zu helfen. Und nun merkst du du kannst dich dort nicht halten.","replies":[]},{"poster":"Tutter77","date":"2015-12-28T16:55:47.437+0000","up_votes":1,"down_votes":0,"body":"Ich glaube nicht das dein Problem etwas mit der Preseason zu tun hat.\nDie Wahrscheinlichkeit einen AFK-Spieler in deinem Team zu bekommen ist geringer als die Wahrscheinlichkeit einen im Gegner Team zu haben. Ich glaube du hattest in den 2 Games einfach nur pech. Ich bin in der Preseason von Platin V zu Platin I  geclimbed ohne auch nur in einem einzigen Game einen AFK / Troller zu haben. Bleib einfach motiviert und gib in jedem Game dein Bestes, dann wirst du auch automatisch besser.\nIn dem Sinne\nViel Spaß beim Ranked {{sticker:slayer-pantheon-thumbs}} ","replies":[{"poster":"Rainbow Dashie","date":"2015-12-28T17:24:14.479+0000","up_votes":1,"down_votes":0,"body":"aber auch nur wenn er kein Flamer ist, denn Flamer tragen maßgeblich zu schlechterem, trollendem und afk Verhalten bei.","replies":[]}]},{"poster":"IIIPinkGuyZedIII","date":"2015-12-28T17:07:27.058+0000","up_votes":1,"down_votes":0,"body":"Ich habe wegen flamern etc meine Promo verloren aber man sollte sich durch sowas mikriges nicht unterkriegen lassen^^","replies":[]},{"poster":"FDG DragonSlayer","date":"2015-12-28T16:18:53.538+0000","up_votes":1,"down_votes":0,"body":"Jep same problem gut gespielt 2 liegen gefallen xD\naber wo ich afks habe haben andere glück ;c","replies":[]}]}