{"poster":"Neeko the Ekko","date":"2016-08-19T17:24:54.108+0000","title":"Wie side step ich?","subforum":"Level Up: Guides & Tipps","up_votes":1,"down_votes":0,"body":"Servus wenn ich zb adc spiele mach ich manchmal unbewusst einen Side step! Wollt fragen wie das aber tats&auml;chlich geht damit ich es kontrollieren kann","replies":[{"poster":"Teilzeitmain","date":"2016-08-19T17:46:15.311+0000","up_votes":2,"down_votes":1,"body":"Hallihallo!\n\nHauptsächlich ist dieses Sidesteppen (was für ein Wort...*augenroll*) ja im Endeffekt einer Fähigkeit des Gegners ausweichen. Das kannst du sehr bewusst machen und dich am besten im rechten Winkel zu einem gegnerischen Skillshot bewegen. Einfacher ist es permanent in Bewegung zu sein. (Immer n bissle rumklicken) So machst du es dem Gegner schon wesentlich schwerer auf dich zu zielen und der zusätzliche Bonus für dich ist, wenn du schon in eine Richtung unterwegs bist, wo du ausweichen würdest, kannst du den Kurs einfach beibehalten. \n\nFalls du das ganze trainieren möchtest spiel ein paar Runden ARAM (meine Meinung). Hier schießen wenn es blöd läuft 5 Gegner ständig Skillshots auf dich ab und du hast eine Menge zu tun diesen Fähigkeiten auszuweichen.\n\nIch hoffe es ist verständlich und ich wünsch dir viel Spass ingame.\n\nTschüss gemüs! \n{{sticker:slayer-jinx-catface}}","replies":[]},{"poster":"Temudschinn","date":"2016-08-24T15:21:54.539+0000","up_votes":1,"down_votes":0,"body":"Grundsätzlich gibt es zwei Arten zu sidesteppen: Proaktiv und reaktiv.\n\nBeim proaktiven Sidestepping rennst du einfach schon bevor der Skillshot losgefeuert wird hin und her. Vorteil: Sehr leicht auszuführen, Nachteil: Man kann sich nicht direkt dahin bewegen, wo man eigentlich hinwill. Gute Gegner rennen einfach auf einem zu (oder vor einem weg^^) und warten mit ihrem Skillshot bis die Entfernung besser passt.\nWichtig ist einfach, sich nicht vorhersehbar zu bewegen. Insbesondere sollte sollte die Zeit, nach der man umdreht, immer variieren.\n\nReaktives Sidestepping ist viel schwieriger, aber auch viel effizienter. Du wartest bis du den Skillshot fliegen siehst, schätzt ein ob du eher nach links oder rechts rennen solltest und tust das dann. Der Nachteil ist wohl offensichtlich: Gerade auf kurze Distanz und gegen eher schnelle Skillshots braucht das Ganze sehr gute Reaktionen. Dafür verschwendet man keine Zeit mit sinnlosem hin- und hergelaufe.\nGrundsätzlich gibt es drei mir bekannte Techniken dazu: Man gibt einen Movementbefehl (z.b. zum eigenen Turm) und plaziert den Mauszeiger bereits seitlich, sodass nurnoch ein Linksklick nötig ist zum ausweichen. Dadurch entscheidet man sich allerdings schon im Voraus, wohin man ausweichen wird. Alternativ kann man die Maus direkt auf dem Charakter haben, somit kann man sich spontan entscheiden in welche Richtung man ausweichen möchte - muss aber erst noch die Maus bewegen.\nDie dritte Möglichkeit ist ein Spezialfall: Falls der Gegner eure Bewegung vorherberechnet und auf den Punkt zielt, auf den ihr gerade zulauft, kann auch einfach die \"stehen bleiben\" Taste gedrückt werden.\n\nZum Üben gibt es verschiedene Möglichkeiten, die sich auch kombinieren lassen: ARAM spielen, Reflextrainer benutzen - ein BSP findest du [hier] (https://www.youtube.com/watch?v=ZE0QMV42ns0) oder einen Kollegen suchen und Mundo vs Mundo spielen (hierbei am besten in die Baronpit stellen, eine Mittellinie mit wards ausstecken und dann, während jeder auf seiner Seite bleibt, versuchen sich gegenseitig zu töten).","replies":[]},{"poster":"Marksmansitter","date":"2016-08-23T10:12:40.835+0000","up_votes":1,"down_votes":0,"body":"Im 90° Winkel im Bezug auf die Flugrichtung des Spells laufen","replies":[]},{"poster":"Lagbeard","date":"2016-08-23T08:46:53.022+0000","up_votes":1,"down_votes":0,"body":"Nimmst du Maus - änderst du Richtung. \n\nKlingt jetzt blöd, ist aber letztendlich das ganze Geheimnis. ein Sidestep ist ein Schritt zur Seite, um einem Skillshot des Gegners auszuweichen. Dazu gibt es viel, was eine Rolle spielt (Distanz, Geschwindigkeitn von dir und dem Skillshot), einiges, was man Trainieren muss (Vorausahnen, Reaktion) und etwas, was man lernen muss (Animationen und Cooldowns). Weitere Faktoren sind Blockbarkeit (durch Minions) und Vision. \n\nDas Konzept ist wie Oben beschrieben: Du kennst den ungefähren Cooldown der Gegnerischen Fähigkeit, siehst die Animation, erkennst die Richtung und gehst einen Schritt zur Seite um die Fähigkeit zu vermeiden. Der Rest ist Übungssache. Je höher du kommst desto Kopflastiger wird das: Irgendwann fangen Gegner an, deine Sidesteps einzuplanen und schießen ihre Fähigkeit so, dass sie dich trifft, wenn du versuchst auszuweichen. Es gibt immer wieder lustige Situationen, in denen Pros auf ihren Smurfs nichts treffen, weil die Gegner einfach nicht ausweichen, sie selbst aber das ganze miteinberechnet haben :D","replies":[]}]}