{"poster":"Neeko the Ekko","date":"2016-04-19T14:49:23.740+0000","title":"Hextech Starbust OP?","subforum":"Champions & Gameplay","embed":{"description":"Who needs Flash Tibbers when you have Hextech Starburst? ►Leave a like if you enjoyed this video! :) ►Subscribe: https://goo.gl/GFtfN9","url":"https://youtu.be/oi8cVOGGvzE?t=7m58s","image":"https://i.ytimg.com/vi/oi8cVOGGvzE/hqdefault.jpg"},"up_votes":1,"down_votes":3,"body":"Kann man mal machen oder? :D","replies":[{"poster":"Kata Ga Kill","date":"2016-04-20T13:26:19.654+0000","up_votes":1,"down_votes":0,"body":"Azir braucht die HP nicht er hat ne hoher Range , er ist nur dfür da extremen Schaden in kurzer Zeit zu machen.\nEin guter Azir spieler sollte sich voher Gedanken machen wo er zu stehen hat.\nUnd ein guter Azir Spieler muss auch genau einschätzen wie er seine Skills nutzt zum \"Engagen, in den Tower pushen für Quadra Kill\" oder lieber zum Escapen, Disengagen und Zonen?\n\nDeswegen braucht ein Azir dieses Item nicht sein Kit erlaubt Ihm genug Mobilität und Schutz. \nZusätzlich baut jeder Zhonyas was nochmal richtig effektiven Schutz gibt.\nVon nem Azir erwartet man das er wie ein ADC die DPS Spitze hochtreibt, das erreicht man mit anderem Items besser als diesen.\nVon nem ADC möchte ich schon erwarten das er die Schadensspitzen hochtreibt und sich nicht im normalfall {{item:3071}} {{item:3022}} kauft.\nSage nicht das es verkehrt ist dieses Item auf Azir zu bauen und benutzten, nur ist es eine Frage der Effizienz.","replies":[]},{"poster":"RM Heartmeander","date":"2016-04-19T15:12:05.453+0000","up_votes":1,"down_votes":0,"body":"Ja und daher müssten die eine Begrenzung einbauen.\nSo was wie dass man 30 sec CD auf Mobilitätsspells hat. \nAber auch an sich finde ich das Item zu stark.\nDamit kann man z.B. gegen Champs wie Morgana sie Singeltarget Skillshots haben gut ankommen, da man damit einfach ausweichen kann.\nAuch werden es Champs wie Ahri schwerer haben jemanden zu charmen.\n\nOder z.B. Cho hat es viel schwerer als jetzt schon seine q zu treffen.","replies":[{"poster":"Günther OhMad","date":"2016-04-19T15:31:46.252+0000","up_votes":1,"down_votes":0,"body":"naja ich spiele sehr gerne cho mid... mal sehen wie viel cd, das ding haben wird... aber ich werde das auf cho auf jeden fall auch selber bauen... wie oft nutzte ich mein flash für nen Ulit-Kill... darauf werd ich dann nicht mehr angewiesen sein... aber broken find ich das auch auf jeden fall... das wird so einiges ändern... vielleicht sogar zu viel...","replies":[{"poster":"Kata Ga Kill","date":"2016-04-19T15:51:08.762+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Günther OhMad,realm=EUW,application-id=Wj1wcocU,discussion-id=O6GyPe6Y,comment-id=00010000,timestamp=2016-04-19T15:31:46.252+0000)\n>\n> naja ich spiele sehr gerne cho mid... mal sehen wie viel cd, das ding haben wird... aber ich werde das auf cho auf jeden fall auch selber bauen... wie oft nutzte ich mein flash für nen Ulit-Kill... darauf werd ich dann nicht mehr angewiesen sein... aber broken find ich das auch auf jeden fall... das wird so einiges ändern... vielleicht sogar zu viel...\n\nAuf {{champion:55}} {{champion:131}} {{champion:245}}  finde ich es auch Mega, der Dash, die zusätzliche HP als Nahkämpfer, die CDR, die AP, was will man mehr^^\nDas Item wird meiner Meinung nach stark Abused in den kommendem Meta.\nAlternativ sind Mages die eher auf mehr Schaden wollen oder schon Escape haben {{champion:268}} weniger auf dieses Item angewiesen.\n","replies":[{"poster":"Günther OhMad","date":"2016-04-20T06:20:59.721+0000","up_votes":1,"down_votes":0,"body":"naja ekko ist doch eh nur am hüpfen... da wird das net so viel ausmachen, auf der anderen seite erwähnst du einen azir, der auf die richtie positionierung angewiesen ist... den ein zustäzlicher dash offtmals das leben retten könnte... ich finde azir kann es mehr gebrauchen als ekko... als \"passivitem\" halt... aber man wir halt sehen was passiert...","replies":[]}]},{"poster":"RM Heartmeander","date":"2016-04-19T15:58:25.750+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Günther OhMad,realm=EUW,application-id=Wj1wcocU,discussion-id=O6GyPe6Y,comment-id=00010000,timestamp=2016-04-19T15:31:46.252+0000)\n>\n> naja ich spiele sehr gerne cho mid... mal sehen wie viel cd, das ding haben wird... aber ich werde das auf cho auf jeden fall auch selber bauen... wie oft nutzte ich mein flash für nen Ulit-Kill... darauf werd ich dann nicht mehr angewiesen sein... aber broken find ich das auch auf jeden fall... das wird so einiges ändern... vielleicht sogar zu viel...\n\nNa ja würdest du dir das Video anschauen wüsstest du dass es 30 sec sind xD","replies":[{"poster":"Günther OhMad","date":"2016-04-20T06:18:20.057+0000","up_votes":1,"down_votes":0,"body":"naja noch besseer... ich hab mir das viedeo angeschaut, und wusssste es eigendlich sogar schon vorher... ^^ ich war gestern einfach mit meienen Kopf wo ganz anders ^^... manchmal sind RL-Probleme einfach so ablenkend, das man nicht mehr wirklich nen klaren gedanken fassen kann XD... auf jeden fall op, das wird auf der mitte die championauswahl wieder neu umgesatlaten... viele spiele werden mit neuerungen immer schlechter (auch wenn die cummunity es vorher verlangt hat)... mal sehen ob das eine von solen Gravierenden äänderungen sein wird... aber das man das bald auf fast jedem ap-ler spielen wird ist gaanz klar...","replies":[]}]}]}]},{"poster":"Kata Ga Kill","date":"2016-04-19T15:03:16.777+0000","up_votes":1,"down_votes":0,"body":"Was ist daran OP?\n\nIst doch offensichtlich das ne Katarina die Lv6 ist und die gefeedete Annie mit Lv9 (mit nem fertigen Item), das sie die Kata instant killt.\nBestimmt hat die Kata nichtmal MR gebaut, so wie sie schmilzt...\n\n\nDie einzige Sorge die ich mir um das Item mache ist das das Item dazu gedacht ist um Unmobile Mages mit keinem Escape zu buffen, der Schuss kann dadurch nach hinten gehen, indem mobile Mages noch mobiler werden und es damit eskaliert.","replies":[{"poster":"Günther OhMad","date":"2016-04-19T15:36:34.736+0000","up_votes":1,"down_votes":0,"body":"es geht um den dash auf champions wie annie.. nicht umm den schaden","replies":[]}]}]}