{"poster":"ØPain","date":"2018-12-19T05:24:31.808+0000","title":"Ayuda gano pocos PL :(","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"Hola buenas, voy directo al grano :v la cosa es que en mi cuenta secundaria y en la tercera que tengo era unranked, empece a subirlas, quede en plata, subi rapido a oro v(bueno ahora oro 4 por el tema de que quitaron la division) la cosa es que en plata ganaba entre 20 a 25 pl, y ahora que estoy en oro gano de 17 a 20 pl aprox, y pierdo lo mismo, 17 a 20 pl, mi pregunta es, porque ocurre esto? si yo subi de golpe deberia ganar mas pl? en mi tercera cuenta lo mismo, la tenia unranked, quede plata 3, comence a subirla y en 3 o 4 dias estaba en oro, y tambien lo mismo, gano 17 a 20 pl, que alguien me explique pls :( no entiendo muy bien","replies":[{"poster":"Pollo al Ornno","date":"2018-12-19T05:55:14.925+0000","up_votes":1,"down_votes":0,"body":"tu mmr esta bajo, osea, segun esa estadistica tu nivel (que se mide por tu winrate) es bajo para tu liga entonces te saca mas de lo que te dan asi bajas mas rapido.\n\n(encima ahora que el mmr esta recontra basura y un platino puede tener mmr de hierro xd)","replies":[]},{"poster":"Nuke","date":"2018-12-19T05:47:48.301+0000","up_votes":1,"down_votes":0,"body":">  en plata ganaba entre 20 a 25 pl, y ahora que estoy en oro gano de 17 a 20 pl aprox, y pierdo lo mismo, 17 a 20 pl, mi pregunta es, porque ocurre esto? \n\nMira esto tiene que ver con el MMR.\nEl MMR es como un valor de tu habilidad en el juego; un mmr alto es ser bueno y un mmr bajo es ser malo. Es un valor tan exacto que se utiliza para los emparejamientos. Si, asi es, emparejan por mmr, no por liga o división. De esta forma, si por ejemplo sos plata pero tenés el mmr de platino, te van a emparejar con platinos, si sos platino y tenés el mmr de un plata, te emparejarán con platas. El mmr no solo es oculto, si no que su fórmula es secreta pero está claro que ganando mucho lo subís y perdiendo mucho lo bajás.\n\nAhora, si tu mmr es alto, vas a tener más pl por victoria y vas a perder menos por derrota. Si tu mmr es bajo, vas a perder más por derrota y vas a ganar menos por victoria. En definitiva, el mmr hace que estés donde merecés, ayudándote a subir si sos bueno y perjudicándote para que bajes si sos malo. \n\nCuando estabas en plata y ganabas mucho, seguro merecías estar en oro, por lo que tu mmr aumentó y te ayudó a subir. Ahora, seguro estás en tu liga merecida, por ello estás \"neutral\", ganando lo mismo por victoria que lo que perdés por derrota. Solo mejora y sigue ganando. El elo llega solo.\n\nSaludos.","replies":[]}]}