{"poster":"Nijel","date":"2016-01-28T05:54:49.569+0000","title":"OCE is Best Place 5v5 Tournament","subforum":"Community Events","embed":{"description":"© 2016 Riot Games, Inc. All rights reserved. Riot Games, League of Legends and PvP.net are trademarks, services marks, or registered trademarks of Riot Games, Inc.","url":"http://events.oce.leagueoflegends.com/en/events/171345","image":"https://lolstatic-a.akamaihd.net/global-elements/0.0.30/images/oce-ratings-logo.png"},"up_votes":4,"down_votes":0,"body":"Summoners!\n\nWe are back after the smashing success of our 1v1 tournament to bring you a 5v5 tournament. Yes, you and friends will get the chance to lay it all on the line for Triumphant Ryze. Oh and there are no rank restrictions either so everyone can have a go (and get smashed by that  one challenger team that always decides to show up last second). \n\nThis tournament will be held online on **Sunday the 7th of February starting at 3pm**. \n\n---\n\nIf you have a team who is interested in playing follow these steps:\n\n1. Every player must register individually on the event page to ensure they are eligible for Riot prizes. http://events.oce.leagueoflegends.com/en/events/171345\n2. Only the captain needs to register their team on challonge and write the members/positions of the team in the description box. Other members do not need to make challonge accounts. http://oce-is-best-place.challonge.com/5v5_1\n3. The captain should add Nijiiyo in game to have a direct point of contact if they have any questions.\n4. Show up on the day and play!\n\n---\n\nIf you have any questions or want to get involved (we need some graphics and stuff) please contact us and we'll get back to you asap. We also have a Facebook page now: https://www.facebook.com/OCEisBestPlace/.\n\nHope to see you there!","replies":[{"poster":"Maraudaur","date":"2016-01-28T06:12:15.685+0000","up_votes":3,"down_votes":0,"body":"Remember you need to register on the event page as well to be eligible for prizes! but GL HF\n\n{{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"qwertilian","date":"2016-02-05T09:28:28.674+0000","up_votes":2,"down_votes":0,"body":"i was interested in joining or making a team. if anyone was keen?","replies":[]},{"poster":"Junko","date":"2016-02-01T01:18:18.162+0000","up_votes":2,"down_votes":0,"body":"{{sticker:slayer-jinx-unamused}} I'd sign up if I didn't have to work #RIP","replies":[{"poster":"Nijel","date":"2016-02-01T02:51:26.858+0000","up_votes":1,"down_votes":0,"body":"Probably better for everyone else, they wouldn't have stood a chance.\n\n{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Junko","date":"2016-02-01T04:09:08.047+0000","up_votes":1,"down_votes":0,"body":"{{sticker:slayer-jinx-wink}} \nLOL true","replies":[]}]}]},{"poster":"Nijel","date":"2016-02-07T10:05:48.754+0000","up_votes":1,"down_votes":0,"body":"Congratz to Xero Empire for their intense 2-0 win over Tyrant Esports Club. \n\nThanks to everyone who participated and watched. I hope to see you all next time!","replies":[]},{"poster":"Nijel","date":"2016-02-06T23:17:14.407+0000","up_votes":1,"down_votes":0,"body":"You can start piling into the OCE is Best Place chat room so that we can start on time.","replies":[]},{"poster":"Nijel","date":"2016-02-06T02:12:18.398+0000","up_votes":1,"down_votes":0,"body":"Rego closes 2:30pm tomorrow so you still have time to join in.","replies":[]},{"poster":"Nijel","date":"2016-02-05T02:39:09.488+0000","up_votes":1,"down_votes":0,"body":"There are only three slots left! Get in here before time runs out.\n\nAlso the grand final best of 3 will be streamed somewhere around 6pm AEDT depending on how long the matches take. I won't be shoutcasting this time around but I will be in the chat (and I might make an appearance anyway). \n\nhttp://www.twitch.tv/nijiiyo","replies":[]},{"poster":"Nijel","date":"2016-02-04T04:47:52.903+0000","up_votes":1,"down_votes":0,"body":"5 slots left.","replies":[]},{"poster":"Nijel","date":"2016-02-03T05:08:04.964+0000","up_votes":1,"down_votes":0,"body":"It looks like we've got some talent signed up so I've decided to stream the finals match!","replies":[]},{"poster":"Nijel","date":"2016-02-02T03:21:40.658+0000","up_votes":1,"down_votes":0,"body":"There is still time to gather a team and register. Come on all, give it a go!","replies":[]},{"poster":"Nijel","date":"2016-01-30T23:31:46.667+0000","up_votes":1,"down_votes":0,"body":"The members of 7 teams have signed up so far. At 8 or more and we have a tournament on our hands ladies and gents!\n\n---\n\nAlso remember **every player** needs to register to ensure they are eligible for Riot prizes here http://events.oce.leagueoflegends.com/en/events/171345\nand **the captain** needs to register their team on challonge and write the members/positions of the team in the description box here http://oce-is-best-place.challonge.com/5v5_1","replies":[]},{"poster":"Nijel","date":"2016-01-30T03:18:26.061+0000","up_votes":1,"down_votes":0,"body":"The captains of 4 teams have signed up so far, from a wide range of rankings too.","replies":[]},{"poster":"Nijel","date":"2016-01-29T08:20:20.570+0000","up_votes":1,"down_votes":0,"body":"There are three teams finalising their squads right now. We need at least 8 to get this going so grab your mates and get involved!\n\nAlso, since the registration process was really confusing I've written it out step-by-step in the body of the post above. (I'm the process of getting these clarity changes authorised on the official event page too.)","replies":[]}]}