{"poster":"ˉUncle Threshˉ","date":"2018-02-03T01:23:02.907+0000","title":"Human Thresh (skin)","subforum":"Skin- & Champion-Konzepte","up_votes":6,"down_votes":0,"body":"Hallo ihr Lieben, \r\n\r\nDa ich absoluter Thresh Fanatiker bin und seine Story auch wirklich ziemlich gut finde, habe ich mir &uuml;berlegt das Thresh vielleicht mal einen &quot;Human-Thresh&quot; Skin bekommen k&ouml;nnte. Vor der Zeit der Vernichtung, vielleicht sogar in dem zustand wo er seine Katakomben gar nicht mehr verlassen hat. \r\n\r\n\r\n&quot;Durch das ausschweifende Foltern unten in der Gruft entfernte sich Thresh immer weiter von seinem Orden an der Oberfl&auml;che. Er ging dazu &uuml;ber, seine Mahlzeiten in seiner unterirdischen Kammer, die nur von einer einzigen Laterne beleuchtet wurde, einzunehmen. Nur noch selten verlie&szlig; er die Katakomben. Der Mangel an Sonnenlicht lie&szlig; seine Haut fahl werden und sein Gesicht wurde hager und eingefallen.&quot; \r\n\r\nIch denke das man daraus einiges machen k&ouml;nnte, vor allem weil es ein gro&szlig;er teil seiner Geschichte darstellt. Leider kann ich pers&ouml;nlich mit keinem selbstentwickeltem skin-design dienen, aber ich habe schon ein paar Bilder im Kopf die ich umsetzen w&uuml;rde.\r\nWas haltet ihr von der Idee ? {{champion:412}}","replies":[{"poster":"old man kiLu","date":"2018-02-06T15:10:21.316+0000","up_votes":1,"down_votes":0,"body":"Oh mein Gott *_* jaaaa!!! Als Thresh-Main ein absoluter Traum :OO\n\n\nUpvote!!!!","replies":[]},{"poster":"5weeds","date":"2018-02-06T14:53:33.651+0000","up_votes":1,"down_votes":0,"body":"Find ich interessant.\nSo in der Art \"Vor der Leere Kassadin\".","replies":[]},{"poster":"D R0SE","date":"2018-02-03T18:57:23.886+0000","up_votes":1,"down_votes":0,"body":"Nette Idee. Upvote","replies":[]},{"poster":"404 Clone","date":"2018-02-03T10:44:18.137+0000","up_votes":1,"down_votes":0,"body":"Ich finde diese Idee eigentlich ganz gut :). Gerade weil ich demnächst anfangen möchte die Rolle Supporter zu mainen, und Thresh einer meiner Favouriten-Supporter ist, würde ich mir so einen Skin wünschen.\n\nHoffen wir mal auf das Beste.","replies":[]}]}