{"poster":"Roman Numeral 6","date":"2015-02-12T07:00:44.835+0000","title":"Dragon buff value, is it worth it currently?","subforum":"Gameplay & Strategy","up_votes":3,"down_votes":1,"body":"Hey guys,\r\n\r\nJust curious as to what your thoughts are on the dragon buff order. the only one that I find to be an issue is the initial 6% AD and AP buffs.\r\n\r\nNow this in the late game is a great buff to have, it gives roughly 50 extra ap or 30 extra ad dependant on what your build is. but in the early game it might only give you a bonus 5 ad and a bonus 10 ap. so you see no real reward for securing that early first dragon. to me this is an issue in both professional games and solo queue games.\r\n\r\nFor LCS, teams are quite happy to give up that first dragon in exchange for top pressure  in certain match ups. \r\nAnd in solo queue I feel as though its not punishing enough to take the first dragon away from a team if they are constantly pressuring top. because statistically you are getting far less in stats and pressure compared to that lane.\r\n\r\nMy thoughts are to make the structure damage the first buff, thus saying if you want to lane swap that is fine, but we will now be able to push other lanes a lot harder when we get them into tower. with move speed place at number 2 dragon and 6% ap and ad placed at number 3. I understand the issue with this is it allows a team that is snowballing to continue in that way. but surely the current system isn't quite right either?\r\n\r\nTL;DR: first dragon not worth enough. should possibly be pushed back to 3rd buff and current 2nd and 3rd biff should move to 1st and 2nd.\r\n\r\nAny way guys, what are your thoughts?","replies":[{"poster":"Yuriklatura","date":"2015-02-13T11:16:02.697+0000","up_votes":1,"down_votes":0,"body":"If you can get the first dragon, get it. Sure an extra 6% doesn't look good on paper, but across your team, that's a massive boost.","replies":[]},{"poster":"Charrd","date":"2015-02-12T22:27:09.387+0000","up_votes":1,"down_votes":0,"body":"All buffs are wurf","replies":[]},{"poster":"JasonWazza","date":"2015-02-12T11:46:13.287+0000","up_votes":1,"down_votes":0,"body":"If your giving up the first dragon, your giving up a large possibility of having the 5 dragons (or at least prolonging it) and that's a major game changer.","replies":[]},{"poster":"Rownin","date":"2015-02-12T07:50:11.762+0000","up_votes":1,"down_votes":0,"body":"I can't rly word out my thoughts on this but 1 thing's for sure, half of me agrees and the other half doesnt, it's up to rito to decide...... and the majority of players","replies":[]},{"poster":"TrashDonnut","date":"2015-02-12T07:12:33.821+0000","up_votes":1,"down_votes":0,"body":"Objectives is very important in Season 5.","replies":[{"poster":"Rownin","date":"2015-02-12T07:47:16.465+0000","up_votes":1,"down_votes":0,"body":"*Quote of the year* :)","replies":[]}]}]}