{"poster":"Akos lovag","date":"2018-11-30T18:50:48.874+0000","title":"Miért néznek le játékosokat?","subforum":"Segítség és támogatás","up_votes":3,"down_votes":5,"body":"Arra c&eacute;lzok hogyha egy kezdő j&aacute;t&eacute;kos profikkal j&aacute;tszik(aminek nem nagy a val&oacute;szin&uuml;s&eacute;ge) akkor biztos hogy lesz egy olyan aki elkezdi any&aacute;zni az&eacute;rt mert mit tudom &eacute;n jungeles &eacute;s nem teszi a dolg&aacute;t &eacute;s elkezdi őt b&aacute;ntani mert ő nem r&eacute;g kezdte a j&aacute;t&eacute;kot, de hab&aacute;r az a esz&eacute;be jutot hogy b&aacute;ntsa akkor az mi&eacute;rt nem jut esz&eacute;be az hogy seg&iacute;tse &eacute;s ne b&aacute;ntsa?Ha egy j&aacute;t&eacute;kos olyan karakterrel j&aacute;tszik akivel eddig nem j&aacute;tszott &eacute;s megakar vele tanulni j&aacute;tszani akkor biztos elkezdi az&eacute;rt b&aacute;ntani mert rossz vele &eacute;s nem tud vele j&aacute;tszani. Meg hogyha ap{{champion:157}} (b&aacute;r moondjuk lehet trolkod&aacute;s is) vagy akkor elkezd t&eacute;ged any&aacute;zni mert {{item:3100}}  &eacute;s{{item:3115}}-et veszel, de egy&aacute;ltal&aacute;n nekik egy&aacute;ltal&aacute;n nem mindegy hogy kivel j&aacute;tszol &eacute;s mikor. Pl. egyszer &eacute;n{{champion:238}} -el j&aacute;tszottam egyszer kil&eacute;pett egy cs&aacute;v&oacute; kil&eacute;pett mert ő nen j&aacute;tszahatott {{champion:238}} -el pedig egy sz&oacute;val sem &iacute;rta hogy vele akar j&aacute;tszani. De a trollokat meg egy&aacute;ltal&aacute;n nem szeretem mondjuk ez egy m&aacute;s t&eacute;ma sz&oacute;val ne t&eacute;rj&uuml;nk &aacute;t erre. Ezzel azt akartam mondani hogy olyan a k&ouml;z&ouml;ss&eacute;g mint a cs-goban biztos hogy 10-ből 1 j&aacute;t&eacute;kos egy idegbeteg őr&uuml;lt aki j&aacute;tszani nem tud de flamelni &eacute;s irogatni az tud &eacute;s m&aacute;soknak is megtudja mondani hogy mit csin&aacute;ljon","replies":[{"poster":"Knight Thyme","date":"2018-12-01T06:30:37.227+0000","up_votes":6,"down_votes":0,"body":"Nezz utana a helyes buildnek, mielott pvp-re viszel valamit. Botok ellen vigyed parszor, de jo a practice tool is az ismerkedesre.","replies":[]},{"poster":"Temp65432","date":"2018-12-01T00:41:22.993+0000","up_votes":6,"down_votes":1,"body":"Honnan szülje meg az ember hogy ki kezdő és ki nem? Senkinek sincs mágikus varázstárgya, hogy megállapítsa ki nekifutásból szar és ki kezdő. (főleg ha  azt veszed figyelembe, hogy a kis szintű felhasználók legtöbbje smurf és csak elenyészően kevesen tényleg új játékos)\n\nNagyon egyszerű amúgy a válasz. A kezdő elrontja a játékát és mivel senki nem szereti feleslegesen elpazarolni a délutánját ezért fusztrált lesz.\nAz a titka a dolognak, hogy néma gyereknek anyja sem érti a szavát. Minden online játékban létezik chat, a legtöbb online játékban enterrel lehet megnyitni. Ha valaki nem tud valamit kérdezzen. Vagy ha tegyük fel valaki kezdő és egy új karaktert akar kipróbálni akkor legyen annyi esze hogy beviszi 1-2 alkalommal botok ellen, ahol az emberek segítőkészek és elmagyarázzák mit hogy kell. Ha pedig nem veszi a fáradságot, hogy utánajárjon legalább minimálisan a dolgoknak akkor ne csodálkozzon, hogy a csapata nem értékeli, hogy elvett az életükből egy fél órát.\n\nArról meg szokj le, hogy számodra mi fun és mi nem. 4 másik emberrel vagy összezárva huzamosabb ideig, nem az az elsődleges szempont, hogy te neked milyen faszsághoz van ingerenciád hanem az, hogy számodra és a csapattársaid számára is élvezhető legyen a játék. Ha trollkodsz meg hülyeséget buildelsz akkor a maradék 4 ember játékélményét fogod tönkretenni csak azért, hogy te jól szórakozz. Ezt senki sem fogja jó szemmel nézni, de mivel nem a suli mögötti focipályán vagytok hogy jól megverjenek, ezért csak flamelni fognak.","replies":[{"poster":"kiskeni","date":"2018-12-01T16:06:26.372+0000","up_votes":2,"down_votes":2,"body":"Mert a másik 4 ember törődik a saját élményén kívül máséval, jogos (nem). Ha nem használsz chat-et és legalább nullásra kihozod a lane-t akár egy cassio adc-vel is, akkor a kutyát nem fogja érdekelni, hogy mit pick-eltél. Ha nem is menne, azt lehet megemlítik, viszont ha nem válaszolsz, akkor csillapodnak mert belátják, hogy értelmetlen neked írni. Azért Rankeden kívül a többi várólistán hadd ne keljen már másokhoz alkalmazkodni és hadd élvezzem egy picit a játékot na :D\nEgyébként meg még jó, hogy a meta és a játékszabály nem ugyanaz a fogalom. Innentől kezdve pedig senkinek semmi köze ahhoz, hogy ki mit pick-el. Mielőtt még mondanád, engem sem igazán érdekel ki mit hoz, az sem érdekel, hogy win vagy lose, a lényeg, hogy lehessen élvezni a meccset (ez az utóbbi időben nem jellemző). Rankeden persze más, ott azért már elvárom mindenkitől, beleértve magamat is, hogy igazodjon a metához, de ott sem ijedek meg, ha egy offmeta pick-be futok, hisz ilyenkor a higgadtság a kulcs (nem ugrok neki \"késsel\" a pick-je miatt). Ha pedig összehozza, akkor megveregethetem a vállam, hogy nem csesztem el a kedvét és nem rontottam a játékát az offenzív viselkedésemmel.","replies":[{"poster":"Temp65432","date":"2018-12-01T16:39:52.467+0000","up_votes":5,"down_votes":0,"body":"Ezzel csak az a probléma, hogy ha te nem törődsz a másik játékélményével ,akkor ő miért törődjön a tiéddel? Tegyük fel hogy te azt szeretnéd, hogy élvezd a játékot és pickelsz egy cassio adct. Nos énis szeretném élvezni a játékot egy használható pickel ezért megfogom és kilépek. Mert ugyebár ha te nem vagy hajlandó alkalmazkodni, akkor én miért tenném\n\nAz, hogy valami meta nem egyenlő azzal, hogy valami teljesen nélkülöz minden logikát és használhatatlan (tessék egy példa a különbségre: corki egy nem meta pick, ap yasuo egy rossz pick) Vegyük példának a cassio adct vagy az ap yasuot. Nem azért rossz pick mert valaki koreába azt mondta, hogy hmmm cassio innentől ap, hanem azért mert semmi előnye sincs adként. Lassú, kicsi a range, nincs autoattack resetje, nincs onhit effectje, nincs adval scalelő képessége. Tehát nem használható adnak. Ha ez valamikor fog változni, és lesz bármi amit a cassio adc jobban csinál mint bármelyik másik adc, akkor megvonom a vállam hogy oh well, és pickelje az aki akarja. Addig viszont ez pusztán időpazarlás. Abban a pillanatban, hogy te inkább őt pickeled bármelyik másik karakter helyett ami működne \nonnantól a játék egy coinflip mert helyzeti hátrányból indulsz. Lehet reménykedni, hogy hátha egy bronze5ös enemyt kapsz aki first time pickel és lövése sincs a játékról, de biztosra nem lehet venni. A csapatodtól meg igazán nem lehet elvárni hogy fél órát pusztán a szerencsére alapozva elpazaroljanak. Arról nem is beszélve, hogy ha történetesen nem jön be akkor ne csodálkozz, hogy annyira nem boldogok. (Az meg már csak bónusz, hogy attól mert nullásra kihozod a laned nem nyered meg a játékot. A játékban végig hátrányba fogsz lenni egy használható pickel szemben szimplán azért mert az használható. Ez minden karakterre igaz).\n\nEz a mentalitás amit itt képviselni próbálsz igazából a Riotnak meg a faszságának köszönhető, hogy \"is it meta\" meg \"pickelj amit akarsz amikor akarsz\" meg hasonlók. Ami nem működik azt nem kell erőltetni mert tönkreteszed a többiek játékát (hacsak nem szereted bámulni a szürke képernyőt akkor a sajátodat is). Ez olyan mintha codba elkezdenél sörétes puskával mesterlövészkedni. Biztos volt már rá példa, hogy valamikor valaha egyszer működött de attól még hülyeség marad.","replies":[{"poster":"kiskeni","date":"2018-12-04T09:52:36.507+0000","up_votes":1,"down_votes":0,"body":"Engem a Rito marketing-bullshit kampánya érdekel a legkevésbé. Igen, láttam a videót, de nem nagyon hatott meg.\nEgyébként pont ez a lényeg, hogy senki sem törődik a másikkal, állatkertben játszol a hősválasztástól kezdve a játék utolsó másodpercéig. Éppen ezért nem érdekel a másik nyavalyája, hisztizzen csak a cassio adc-m miatt, egészségére. Persze kivételek mindig vannak, tőlük utólag elnézést kérek. Amúgy cassio adc-t nem csak ad-ra építve lehet játszani (nashor-guinsoo-ASboots?) :D","replies":[{"poster":"Jack Eron","date":"2018-12-04T12:24:26.238+0000","up_votes":1,"down_votes":0,"body":"Ha ekkora hülyeségeket építesz, akkor te vagy a legrosszabb fajta lol player. Az egy dolog, ha valakivel kitol a csapata, valaki beszól, és bosszúból trollkodni kezd, de ekkora baromságot, hogy AP yasuo, ad cassio... na menj a tudod hova. Okod sincsen rá, és a szövegből ítélve te a játék elejétől szarsz bele az egész csapatodba. \n\nTudom, hogy a community milyen pocsék, de azért bőven van meccs, ahol normálisak az emberek. De te alaptól trollpickel indítasz, majd elvárod, hogy \"normálisan\" reagálják ezt le? \n\n\"Csapatjáték\" IGENIS érdekeljen a másik nyavajája. Ha leszarod a teamedet, akkor megmondanád, hogy mit keresel egy csapat orientált játékban? \n\nEgyébként a NEM ranked meccsek annyiban merülnek ki, hogy NEM veszítesz LP-t és NEM esel vissza. A céljuk, hogy megismerj hősöket, tanulj, próbálkozz, NEM a trollkodás. A normál meccseken sincsenek támogatva a troll buildok. Nincsenek és kész. Szakadj le a trollpicker streamerekről, akik a szenzáció miatt hoznak létre \"OMG CRIT SORAKA INSTAWIN NERF IT\" videókat, ha innen van a zseniális ötlet.\n\nNem pickel mindenki azt, amit akar. Stratégia és csapatjáték, erre épül az egész LOL... megmondanád, hogy a hülyébbnél hülyébb trollpickekben, meg az \"azt csinálok amit akarok, bárki bármit szeretne\" hozzáállás hol találkozik ezzel a két fogalommal? Sehol, mert ellentétes azokkal :D \n\nNem veszed észre, de szembeköpsz mindent amiről ez az egész szól, aztán zokon veszed, ha neked mennek... másrészt, hagyjuk már ezt a szórakozni akarsz dolgot. Nem lehetséges szórakozni trollkodás nélkül? :D Olyan nehéz logikus döntést hozni, és úgy játszani? Hát tényleg fájdalmas lehet egy kisebb elemzés után nyerni...","replies":[{"poster":"kiskeni","date":"2018-12-04T22:40:47.463+0000","up_votes":1,"down_votes":0,"body":"Mondtam egy szóval is, hogy Cassio adc-zek 0-24-ben? Hell No! A hőssel is jó, ha egyszer játszottam a játékban valaha. Javarészt Akali-val verek el másokat, mert tök jó, hogy egy W miatt bárkit (is) counterplay-elhetek vele xD\nHány trollbuild videó összeállítást láttam én már te jó ég... Ja nem, egyet sem, nem igazán nézek ilyesmit. ITT IS mellétrafáltál elég rendesen.\nRátérve a valódi mondandómra, tudtommal még mindig a szabadidőmet áldozom rá a játékra (mint kb. mindenki), és mint minden szabadidős tevékenységnél, itt is cél a szórakozás. Nehogy már csak azért, mert a LoL-t sportként akarják letömni a torkunkon, játsszak úgy, mint egy élsportoló példás magatartással és tökéletes reflexekkel... Na ne nevettess már -.- Igen is, ha úgy tartja kedvem akkor offmetát pick-elek, ha kell, Lulu top-ot csak azért, mert viccesnek találom és azért is, mert ennek a játéknak a közössége annyit sem érdemel, hogy a \"játékszabályokhoz\", avagy valójában a metához tartsam magam. A játékszabályokhoz amúgy is tartom magam, no flame no cheat no troll. És mielőtt keresnéd a fogást rajtam ne fáradj, az offmeta pick vagy oda nem illő pick közel sem tartozik bele a trollkodás kategóriába. A trollnak ált. szándékában áll másokkal kitolni bárhogyan, még én még véletlenül sem erre törekszem.","replies":[{"poster":"Jack Eron","date":"2018-12-05T07:47:54.670+0000","up_votes":1,"down_votes":0,"body":"Az off meta és a trollpick nem ugyanaz, de a \"fun\" playerek legtöbbször nem tudják. Másrészt... a lol stratégiai csapatjáték. Ez nem nézőpont kérdése, ez tény. Tehát vagy alkalmazkodsz a többiekhez, és a legjobbat adod, és igenis törődsz velük, vagy nem neked találták ki a játékot. Csak gondolj bele, te szembemész mindennel, amit a játék képvisel, és még csodálkozol, ha valakinek nem tetszik? Mintha focizni azért járnál el, hogy kézzel dobáld a labdát a saját kapusodnak... azért annyi józan ész legyen már bennünk, hogy nem veszünk részt olyasmiben, amivel kicsit sem tudunk azonosulni...\n\nA riot valamikor csinált videót a \"new meta\" ötletekről, ahol közölték, hogy nem árt egyeztetni a csapatoddal, mielőtt belevágsz. Ha hülye az egész team, vagy a többség, akkor oké, csinálj amit akarsz, ha látod, hogy nincs esély. Egyébként nem szarhatod le őket, mert gyökeresen ellentmond az egésznek. \n\nA \"viccesnek találom\" szöveg akkora hülyeség, már ne haragudj :D Komolyan kezdem azt hinni, hogy egyes emberek szerint vagy trollkodsz, vagy nonstop villogtatod a \"mekkora egyedi és lázadó vagyok már, én azt csinálok amit akarok legyen bármi is\" kártyádat, hiszen normálisan, odafigyelve, segítve, kommunikálva, \"normális\" pickekkel, LEHETETLENSÉG hogy jól érezd magad :D Mi a fene \"vicces\" egy lulu topban? :D Suppként miért nem vicces? (egyébként ez a pick működhet)\n\nSokan nem törődnek másokkal, hát legyél te az az egy, aki aztán mégis. Rengeteg a barom, de vannak normális emberek is, akkor álljak be azok közé, akiket megvetek, én is szarjak mindenkire, pickeljek \"non metákat\", holott esetleg zülleszti a morált, és ne is kommunikáljak? Hát az szép hozzáállás lenne.\n\nBónusz: Én sem mondtam, hogy cassiózol 24 órában. Továbbá NEM mondtam, hogy youtube videókat copyzol. Azt mondtam, le kéne tenni róla, HA innen volt az ihlet. Nightblue és mindenféle unatkozó társainak a mániája hülyébbnél hülyébb clicbait videókkal szórakoztatni a népet, nem mintha nem lenne elég troll nélkülük. Nem egyszer kaptam már olyanokat társként, akik az ő kiváló ötleteit kívánták megvalósítani semmiféle sikerrel.","replies":[{"poster":"kiskeni","date":"2018-12-05T09:13:34.899+0000","up_votes":1,"down_votes":0,"body":"Áhh, nálam ez az év volt az, ahol a közösségtől végleg kiégtem és épp ezért ha normál, akkor tutira azt pick-elek, amit szeretnék. Nem vagyok hajlandó másokkal törődni ebben a tekintetben. Csak hagyjanak az olyanok békén és hadd játsszak, valahogy így vagyok vele. Amúgy nem lehetetlenség jól érezni magad, hisz mostanában sok FED (!?!?!?!?) ADC Yasuo-val találkozok és csak csodálkozok azon, hogy hogyan működik ez... :D\nVicces, de a Lulu top tök jól működhet. Tesóm egy jax-et vert el vele elég csúnyán topon xD Mondjuk pl. egy Renekton-ra szerinte nem a legjobb pick.\nMaradhatunk annyiban, hogy alapvetően nyerni kell és ahhoz a meta követése kell,viszont aki tudja mit csinál, az fog tudni carry offpick-et találni. Én azért már szerintem bőven tartok ezen a szinten. A rankedről meg annyit, hogy az tabu, ott a legjobbat kell hozni :D","replies":[]}]}]}]},{"poster":"Temp65432","date":"2018-12-04T12:39:34.696+0000","up_votes":1,"down_votes":0,"body":"Ezzel meg is válaszoltad a postoló kérdését...ezért nézik le az ilyen játékosokat","replies":[]}]}]}]}]},{"poster":"Jack Eron","date":"2018-12-01T11:47:14.242+0000","up_votes":4,"down_votes":0,"body":"Ha AP yasozni szeretnél, akkor azt hiszem, el is veszíted az emberek jóindulatának 99%át. Az olyan botgamere vigyed maximum.","replies":[{"poster":"Storiaron","date":"2018-12-03T07:52:02.691+0000","up_votes":1,"down_votes":0,"body":"Múltkor pont volt velünk egy ap yasuo mid, és tizen valamennyi killel zárta a meccset. Máig rejtély számomra hogy csinálta.","replies":[{"poster":"Gregori","date":"2018-12-04T15:15:31.286+0000","up_votes":1,"down_votes":0,"body":"E E E E","replies":[]}]}]},{"poster":"Mind The Gap","date":"2018-11-30T19:03:57.907+0000","up_votes":4,"down_votes":2,"body":"Rageléskor nem tud az illető tisztán gondolkodni. Ha tippelnem kéne, az oka az, hogy a LoL azon kevés dolgok közé tartozik, ami nagy eredménynek számít az életében. Akinek van produktívabb hobbyja, annál nem annyira valószínű, hogy a LoLon kiborulna bili, mert úgy fogja tekinteni a LoL-t, mint **játék**, és nem mint Olimpia.\n\nHa normál játék, akkor csak muteold le és ignoráld. Hadd idegeskedjen csendben a tudtod nélkül, ha nem vagy rá kíváncsi. Ez az a szituáció, ahol sajnos nem tudod megváltani érvekkel a világot – főleg nem egy meccs közepén, hacsak nem vagy valami prodigy. Legalább ne rontsunk a helyzeten.\n\nTehát a válaszom:\nNem tud mit kezdeni az életével -> komolyan veszi a játékot -> őt nem érdekli, hogy veled mi van, csak járulj hozzá a winhez.\n+ leszídni a másikat könnyebb, és kevesebb energiát igényel, mint valami **_hasznosra_ **használni a billentyűzet koptatását.\n\nTanács? Legyél okosabb, és ne legyél egy azok közül, akik rátaposnak arra, aki már el van esve. Legyél elég magabiztos és okosabb ahhoz, hogy a te szavad többet érjen az övéknél.","replies":[]},{"poster":"Gresident","date":"2018-11-30T20:13:12.220+0000","up_votes":3,"down_votes":2,"body":"Akkor nézzük a másik végletből is, most ne normal/drafftról essen szó (Mert ott engem sem érdekel a végeredmény, amíg valaki nem szándékosan troll), hanem rankedről, ahová ugyanúgy jön minden világtalan megtanulni játszani first pikkel is, a csapattársaikat nem szem előtt tartva.\n\nKivel szemben korrekt dolog az, hogy bejönnek egy soha nem játszott karakterrel játszani rankedre? \nIlyenkor is mindig az az 1 ember van megsértődve, meg felháborodva, hol ott másik 4 játékát viszi vereségbe.\n\nHa a játék azt is figyelembe venné, hogy ki milyen teljesítmény alapján győzött/vesztett, akkor valószínű nem kellene agyon flamelni a 0/15 jóskapistát, aki mellett  az S+ rangos csapattársa bukta a promót, csak azért mert előtte látott egy videót, hogy a számára ismeretlen hős 5v1be nyerte  játékot...\n\nÉn valamiért nem azt látom, hogy a kezdőket szokták basztatni, hanem a szándékosan hülyéket, mert a kezdők nagy része legalább azt csinálja mint a kezdő botok, hogy legalább megpróbálnak elmenekülni, és nem fognak 10.re is belemenni (szemléltetés végett) egy {{champion:157}} a 0/10+be.\nMert rankeden mindenkinek a legjobb tudását kellene nyújtani, már pediglen ez nem lehet az...\nPélda: [https://p1.picsto.re/40Hk2.jpg](https://p1.picsto.re/40Hk2.jpg)\n\nAmint egy ilyennek bármi van szólva, hogy egy kicsit gondolkozzon, már csak azért is megy bele... és megteheti többnyire büntetlenül.\n\nAz a baj, hogy nincs semmilyen fajta szankció a rankedba, ami további pontoktól szabadítaná meg az ilyen játékosokat, jutalom+ ba nem is kellene\npedig nagyban elősegítené a játékmenetet az, hogy ha mondjuk valaki lv1 hőssel jön rankedra, és kikap akkor még +50% lp levegyen tőle. \n(ha ő miatta bukott a meccs ha nem).  De amíg a rankeden kizárólagosan 2 dolog lehetséges, győzelem/vereség, addig a \"gyengéket\" \"bántani fogják\"<<Mindkettő szinonima>>.\nÉn is támogatom az összes flamert, aki rankeden jogosan van felháborodva a másik teljesítményén, még akkor is ha, \"légy mindig nyugodt, soha ne borulj ki\"\n\nRankedre nyerni kell(ene) menni, nem pedig játszani(tanulni), arra ott van az összes egyéb játékmód!\n\nÉn talán a legnagyobb gondot ott látom, hogy a játékosok nagy része szerint a lol lényege az ÖLÉS, ami persze igaz is, csak a játék a nexus lerombolásával ér véget.","replies":[]},{"poster":"kiskeni","date":"2018-11-30T21:07:02.270+0000","up_votes":2,"down_votes":1,"body":"Sajnos ez az emberi természet valójában, és igen, bátran ki merem ezt jelenteni. Aki bármilyen helyzetben (játék közben pl) is megengedi magának az efféle hataloméhes/lenéző/elnyomó/szemét viselkedést, az valójában minden más helyzetben csak palástolja valódi természetét. Ami a legrosszabb ebben, hogy ilyenekből van a legtöbb a világon és azt 100% biztosra állíthatom, hogy ez több tucat generációval később is így lesz. Kivételek persze mindig vannak. Semmit nem tehetsz ellene, max annyit, hogy az ilyeneket ignorálod. Ez persze fikarcnyit sem fog segíteni a helyzeten, hisz az ilyenek maguknak és másnak ássák a gödröt. Ha ignorálod is, simán magával ránt téged. Lásd: csetel, flémel, \"bánt\"--->nem teszi oda, nem játszik--->throw-ol--->már is buktad a meccset.\nVan az a bizonyos \"másik véglet\", ami jogos (mármint rankeden a felháborodás), de nem kell személyeskedni akkor sem. Közlöd a tényállást és ha nem fogja fel, mehet a report részletesen leírva. Az úgy hatásos lesz, főleg ha legalább a saját csapatodból mindenki megteszi ezt.","replies":[]},{"poster":"Shikaichi","date":"2018-11-30T19:09:21.686+0000","up_votes":2,"down_votes":1,"body":"Hát ez sajnos ilyen alapvető emberi dolog, hogy vannak akik szeretik elnyomni a gyengébbeket, tapasztalatlanokat vagy kezdőket. Megváltoztatni nagyon sajnos nem lehet őket, de annyit tehetsz, hogy te nem állsz be a sorba, hanem példát mutatsz és esetleg segítesz ezeknek a kezdőknek. Ha pedig te kerülsz a célkeresztbe, akkor legjobb, ha ignorálod, nem foglalkozol velük. Ha nem tudod így őket kizárni, akkor egy némítással tehetsz ez ellen.","replies":[]},{"poster":"183cm 71Kg 22cm","date":"2018-12-02T22:47:57.120+0000","up_votes":1,"down_votes":0,"body":"Lehet csak velem van  a gond, de elég egyértelmű még a kezdőnek is. Hősválasztás: szét van osztva fent szépen az összes hős ösvényekre, szoval a kezdőket már lehet szidni ha trollpick.\nEzenkívül a tárgyaknál is szépen be van osztva neked pár tárgy, kb mind ugyanazt adja, vagy olyat ami kell neki, ezenkívül lent behoztak egy olyat, aminek a neve\"metán kívüli tárgyak\" gondolok itt a  guinso ra maokai nál, túl egyértelmű szerintem, szóval a tárgyakra sincsen már kifogása.\nMarad az, hogyha szarul játszol szidnak. \nEkkor mondod nekik, hogy \"sry im starter\", és mindenki letolja hogy rosszul játszol, sőt akkor még tanácsokat is adnak néha, (mintpéldául delete the game etc.)","replies":[{"poster":"Knight Thyme","date":"2018-12-04T14:04:20.826+0000","up_votes":1,"down_votes":0,"body":"* Sry, I am a beginner\n\nNem baj, ha elmarad a nyelvtan, de a beginner talan jobb szo ra.","replies":[{"poster":"183cm 71Kg 22cm","date":"2018-12-21T23:20:41.223+0000","up_votes":1,"down_votes":0,"body":"Sosem tudom azt rendesen leírni, szoval értik ezt is, az a lényeg.","replies":[]}]},{"poster":"Jack Eron","date":"2018-12-08T11:48:27.736+0000","up_votes":1,"down_votes":0,"body":"Ez az. A játék most már eléggé fogja ahhoz az illető kezét, hogy ne próbálkozzon be a sablondumával. Én first time champre sem írom be soha, hogy az vagyok. Minek? Az önjelölt mainek majd felháborodnak, ha nem úgy csinálok valamit, ahogy ők szeretnék, vagy már az elején romlik a morál, mert a first time játékosok többnyire hátrányt jelentenek.\n\nEgyébként is azt vallom, hogy aki ezt írja, az alapból rossz játékos, és csak kifogást keres, ha rosszul alakulna a dolog. Ugyanis a first time pickkel elméletben együtt járna az \" ajánlott buildot építek\" és a \"defelek és farmolok\", meg az \"óvatosan játszok\" hozzáállás, nem?\n\nHát sajnos nem, mert az új champes playerek simán 1v1et kényszerítenek ki az ellenfélből már lvl2őn, aztán benyögik, hogy az volt a gond, hogy kezdők. De persze az ajánlott build meg szánalmas, úgyhogy inkább akkor már készítenek is egy sajátot, vagy valami clickbait streamer videóban látott tárgyakat veszik meg. A defelés meg hát mindörökké luxus marad, mert ha 3 perc alatt nem jön össze egy kill, elunják a meccset :D","replies":[]}]},{"poster":"KMiyuki","date":"2018-12-06T14:24:30.217+0000","up_votes":1,"down_votes":0,"body":"Hát, hogy saját példával éljek. A napokban játszottam egy meccset unaloműzésként, sima normált. Ahogy az lenni szokott, egy villanás alatt mindenki leírta, hogy hol szeretne játszani, van aki instalockolt is. Nem maradt más, csak a jg. Én viszont egyáltalán nem jungeleztem még (hiába S4 óta játszok, kisebb-nagyobb megszakításokkal). Most mit tehettem volna? Kiírtam, hogy soha nem jungeleztem még, azt írták nem baj. Pickeltem egy {{champion:11}} -t, mert vele csak nem annyira nehéz. Játék elején ismét kiírtam, hogy \"first jg, first Yi, sorry\", és kész, ezzel el is volt intézve. Senki nem oltott be, szólt be, nem anyázott, hanem helyette még pingelték/írták, hogy na most először ide kell mennem, oda kell mennem, ezt csináljam, ezt/azt vegyek. És ennyi.\nItt leginkább azzal van a baj, hogy senki sem akar engedni a saját akaratából.","replies":[]}]}