{"poster":"Cadillac Bloood","date":"2017-09-30T00:15:15.052+0000","title":"Lose durch schlechte Picks immer und immer wieder","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":7,"body":"Ich hab jetzt eine Woche lang versucht in der Rangliste aufzusteigen und komme einfach nicht weiter.\r\nKlar, Pro bin ich nicht. Wurde in Silber eingestuft und bin da immer noch. Hab sogar den posten des ADC &uuml;bernommen, weil ich was rei&szlig;en will.\r\nHab  nach einigen &Uuml;bungsspielen ganz gute Ergebnisse erzielt in der Rangliste.\r\nDennoch! \r\nIn weit &uuml;ber 50% der Spiele muss ich mir geben, wie in meinem Team Top ein Yasuo steht. \r\nMid: Zed/Talon/irgend ein ADC \r\nJungle: Rengar, Kha, Yi, EZ\r\n...w&auml;re es ein Melee irgendwo im Team w&auml;re es ja  noch O.K. kann man ja auch gut Burst fahren. \r\nNein! Jedes 2te ( und das nicht mal &uuml;bertrieben) Spiel,  hab ich 2-3 solche Kollegen im Tteam.\r\nWas soll das? Ich wei&szlig; ja dass man spielen soll was einem Spa&szlig; macht und wenn ich deren Champs banne trollen die sowieso nur.\r\nDas macht aber keinen Spa&szlig; mehr. Dann sind das auch sone Typen die gerne 1-1 oder 1-2 Traden, hauptsache die bekommen einen Kill und im Lategame stehen die dann alle mit 1,5k Life rum und sind f&uuml;r mich als ADC so nutzlose wie ne Soraka im Jungle. \r\n\r\nStehen dann 3-4k Life Tanks gegen&uuml;ber die sie bei Ihren d&auml;mlichen Trades mitgefeedet haben. \r\nIch verstehe nicht warum man da nicht genauer hingeguckt. Die versauen einem  fast jedes Spiel und es juckt keinen!\r\nUND das sch&auml;rfste ist, dass ich einen Chatbann kriege, wenn ich diesen ******** Menschen sage, dass die bitte zum wohle des Teams einen vern&uuml;nftigen, Toplaner, Jungler etc picken sollen. Als Antwort wird man beleidigt und im Spiel geht dann das feeden los.\r\nIch k&ouml;nnt so kotzen grade.\r\n\r\n\r\nBTW\r\nw&auml;hrend ich mich hier grade ausgeheult habe, Hatte ich ein Spiel, bei dem wir ganz klar die Botlane gewonnen hatten. ich hatte 5-0 oder 6-0 in der zeit hat der Rest des Teams so stark gefeedet, dass ein Earlygame nicht zustande kam...\r\nMF (Ich) 9-7\r\nAli           0-4\r\nAmumu   7-5 ( nach einem 1-5 early)\r\nCamille   1-12\r\nAhri         2-11\r\n\r\nWie soll man da Carry sein? Obwohl ich sagen muss, dass das Setup in dem Spiel voll in Ordnung ging. Aber was m&uuml;ssen die Leute so feeden. k&ouml;nnen die sich nciht in Draft anmelden? ...und ich wei&szlig; sehr wohl dass die machen k&ouml;nnen was sie wollen und ich das nicht zu bestimmen habe. Aber ich teste auch nicht einen neuen CHamp im Rank aus weil ich grade bock drauf habe und ich feede nicht 1-11 oder irgendsowas. Merken die Leute nicht, dass das ein Teamspiel ist, dass man seinen Frust in den 30-45 Minuten mal wo Anders lassen kann?\r\n\r\nGanz ehrlich da vergeht einem nach einer Woche die koplette Freude am Spiel. Spielen da Grundsch&uuml;ler oder was? Muss man erst einen Test bestehen, der einem best&auml;tigt, dass man bei klarem Verstand ist?\r\nDa sollte sich Riot echt mal &uuml;berlegen.\r\n\r\nVllt bin ich ja nicht der einzige der so denkt und solche Erfahrungen macht","replies":[{"poster":"hshtagniemehrcdu","date":"2017-09-30T07:13:56.564+0000","up_votes":7,"down_votes":0,"body":"Bis du in die LCS kommst, sind die Championpicks/Meta völlig egal, es gibt nichts unwichtigeres.\n\nDu suchst einfach nur nach einem Grund (außer dir selbst) warum du nicht aufsteigst.","replies":[{"poster":"Cadillac Bloood","date":"2017-09-30T07:55:30.843+0000","up_votes":1,"down_votes":2,"body":"Ja ist immer leicht gesagt...'' You must be the change you want to see in the world'' bla bla\n\nAber irgendwann muss man auch einsehen dass es ein Teamspiel ist! Ich kann frei nach dem Motto nicht 1vs5 spielen und dann sagen. ja ich hab grade als ADC im Early alle Lanes gewonnen. hab dann überall Tower gepusht etc. \nWenn deine Mitspieler im Early ein 5-25 raushauen, dann kannst du noch so gut sein. Irgendwann kommen die Toplaner gelangweilt auf deine Lane und diven dich solo am Tower weg.\nAb einem bestimmt Grad gibts für mich keinen Grund nur die Fehler bei mir zu suchen. Da sind 4 Andere die genau so zum Spiel beitragen.","replies":[{"poster":"hshtagniemehrcdu","date":"2017-09-30T08:17:07.308+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Cadillac Bloood,realm=EUW,application-id=KYnfKGf0,discussion-id=EeEuyeGE,comment-id=00030000,timestamp=2017-09-30T07:55:30.843+0000)\n>\n\n> Wenn deine Mitspieler im Early ein 5-25 raushauen, dann kannst du noch so gut sein. Irgendwann kommen die Toplaner gelangweilt auf deine Lane und diven dich solo am Tower weg.\n\nTypische Konzentration auf Einzelfälle.\nJa, manchmal verkackt dein Team, dann hast Pech gehabt, soferbn du nicht deutlich besser bist.\nGenausooft hast du ein easy game.\n\nDie Rangliste basiert auf  50+ Spielen, wenn du es da nicht schaffst, aufzusteigen, dann bist du aktuell schlichtweg nicht besser.\n\n> Ab einem bestimmt Grad gibts für mich keinen Grund nur die Fehler bei mir zu suchen. Da sind 4 Andere die genau so zum Spiel beitragen.\n\nUnd beim Gegner sind's 5.\nBist du besser, steigst du bei genügend Spielen locker auf.\nWenn du meinst, dass es nur an deinem Team liegt, hast du die Grundzüge des 5v5 nicht einmal in Ansätzen verstanden, und verdienst es auch nicht, aufzusteigen.\nDein Aufstieg hängt zu keinem Zeitpunkt von deinen Mitspielern ab - weder in B5 noch auf Rang 2 Challenger Korea.\n\nWenn du meinst, alles liege nur an deinen Mates  (4 in deinem Team, 5 bei den Gegnern... einfach 1+1 addieren), dann bitte...","replies":[{"poster":"Cadillac Bloood","date":"2017-09-30T08:37:37.741+0000","up_votes":1,"down_votes":1,"body":"nein","replies":[]}]}]}]},{"poster":"TheG0DofWIND","date":"2017-09-30T09:39:36.709+0000","up_votes":4,"down_votes":0,"body":"konzentrier dich lieber auf deine spielweise anstatt andere zu flammen ;)","replies":[]},{"poster":"Awsane","date":"2017-09-30T00:41:31.776+0000","up_votes":4,"down_votes":0,"body":"> Ali 0-4\n\ndu müsstest wenigsten seine Supports angeben, weil engage Supports sterben hin und wieder, vor allen wenn sie in ein ganzes Team engagen, wenn der dann stirbt und das Team aufräumt sind 4 Tode in nen langen spiel total ok wenn die assists stimmen\n\nich nehme gerne meinen Tod für ein gewonnenen game in kauf","replies":[]},{"poster":"SSI CptHaunted","date":"2017-09-30T00:39:58.821+0000","up_votes":3,"down_votes":0,"body":"Frage mich ehrlich gesagt worüber du dich so aufregst. Du hast selbst Spiele dazwischen wo du nicht sonderlich gut warst und am Champion muss das Ganze nicht liegen. Oder sollen sich die Leute wo du mit Nasus Top 0/6 gespielt hast nun auch fragen ob du n Grundschüler bist oder dass du n Test machen sollst ob du bei klarem Verstand bist?\n\nJeder hat mal solche Spiele und damit muss man eben klarkommen. Hatte heute auch n Ranked wo ich meinen Yasuo-Gegner ziemlich locker weggehauen habe während die Ashe auf der Botlane fleißig Kills gesammelt hat und nachdem die sich Lord Dominiks geholt hat wars für mich, da die Soraka an der Backe hatte, dann auch vorbei...tja so ist das Leben nunmal. 9/4 gespielt, nicht früh genug geschafft auf der Botlane einzugreifen, keinen Sieg verdient. Das Spiel danach wäre auch fast in die Hose gegangen, wäre deren Renekton nicht zwischendurch mal 5-10 min weg gewesen, nur habe ich nachdem so ziemlich alle Lanes reingefeedet haben nicht angefangen denen zu erzählen was sie machen sollen sondern hab meinen Hintern zu denen bewegt und dafür gesorgt dass sie Kills, Assists und Towerbeteiligung bekommen. Man mags auf den Renekton schieben aber indem man meint man wäre der Geilste und der Rest macht nur Müll braucht man sich nicht wundern wenn selbst das nicht geklappt hätte.\n\nVon daher, konzentrier dich bitte erstmal auf dein eigenes Game, wenn das passt kannst du vielleicht versuchen anderen zu \"helfen\", was Championpicks angeht. Übrigens muss jemand mit einem Champ den du gern mit in deinem Team hättest nicht gut sein und nur weil ein Champ in der aktuellen Meta gut/schlecht sein soll sagt das auch nichts aus. Garen ist auch nicht gerade der stärkste Pick auf der Toplane zurzeit und doch läufts für mich mit ihm in den letzten Tagen doch recht gut.","replies":[{"poster":"Cadillac Bloood","date":"2017-09-30T01:27:40.515+0000","up_votes":1,"down_votes":1,"body":"Ist mir schon klar, dass ich auch schlechte Spiele habe und nicht 100% Win auf der Lane habe, das geht nicht! \nMir gehts um diese sinnlosen Picks die einfach kaum potenzial im Lategame haben! Vor 3 Minuten hatte ich wieder einen Yasuo Top.\nDer Spieler hat es auf 10-13 gebracht. Genau wie ich es vorhin beschrieben habe. 1-1 oder 1-2 Trades. Den Gegener feeden und im Lategame umfallen, wenn man einen CC kriegt. Uns fehlt der Tank und der Bursche wird nur von Tot zu Tot mehr frustriert und feedet noch mehr.\nWir hatten zwar einen Gragas aber wir sind immer noch Silber, das erwarte ich von keinem was. Von mir selber auch nicht. Dennoch kann man sich für Mitte einloggen und dort seinen Yasuo spielen. Hätten wir nicht noch den Gragas gehabt, hätten wir wieder nur ein Team aus Carrie's gehabt. Das hatt einfach kein Potenzial wenn es in s Late geht. Wir sind halt alles Anfänger und man wird doch wohl erkennen, dass man mehr Chancen auf einen Sieg hat wenn man wenigsten ein bisschen die Richtung: Tank, Offtank/Nuke- Jungler, Carry Mid -Bot und Supp  einschlägt. \n\nWenn man Glück hat sind die Zad's, Talon's und Yasuo's mal im gegnerischen Team. Die Wahrscheinlichkeit hier zu gewinnen is dann einfach viel höher, weil man im eigenen Team vernünftiges Setup hat. Vllt ist das in deiner Liga ja nicht so....","replies":[{"poster":"eingew","date":"2017-09-30T06:50:46.844+0000","up_votes":3,"down_votes":1,"body":"Es ist eigentlich ganz simpel. Deine Mitspieler und deine Gegner werden aus demselben Spielerpool zusammengewürfelt, die alle ungefähr denselben Skill/dieselbe MMR haben. Entsprechend sind deine Mitspieler und deine Gegner etwa gleich stark. Je beschissener also deine Mitspieler sind, desto beschissener sind auch deine Gegner. Jetzt nicht in jedem Spiel aber insgesamt. Und entsprechend bringt es auch überhaupt nichts, dich über die Fehler deiner Mitspieler zu beschweren, statt dich über die Fehler deiner Gegner zu freuen. Denn alles was du tun musst, ist, diese zu abusen und wenn du schon die Fehler deiner Mitspieler so schnell siehst sollte das ja problemlos klappen. Und wenn du das endlich durchziehst, statt dich die ganze Zeit mit den Fehlern deines Teams zu beschäftigen, wirst du auch problemlos carryn können.","replies":[]}]}]},{"poster":"TSC DepressedNof","date":"2017-09-30T00:37:03.442+0000","up_votes":1,"down_votes":2,"body":"Ich hätte gerne die Möglichkeit, dass man in der Soloque auswählen, dass man nur mit Honor 4-5 Spielern gematcht werden möchte.\nDas würde die Quetimes zwar vermutlich hochtreiben, aber ich warte gerne 4 min auf nen Game, wenn ich dafür Tiltproof Mitspieler bekomme :)\n\nIch bin gerade S4. Was das mit dem feeden angeht: Kumpel, es ist silber... Auch wenn das schon nicht schlecht ist, ist es immernoch unterer Bereich. Das geht uns allen da unten so. Ich versteh deinen Frust (ich kenn das selber zu gut)\nMein Tipp: such dir nen Pre fürs Duo. Als ADC würde das vermutlich am besten nen Sup oder Jungler sein.\nGeteiltes Leid ist halbes Leid und du kannst dich immerhin auf den Spieler halbwegs verlassen :)","replies":[]}]}