{"poster":"SolidDisk","date":"2018-08-06T20:05:02.151+0000","title":"[< Sugerencia >] Desbaneo y reinsercion","subforum":"Charlas Generales","up_votes":2,"down_votes":11,"body":"La idea la acabo de tomar de otro post pero es mas para debatir si les pareceria correcto y como hacerlo.\r\n\r\nhttps://statics.vrutal.com/hm/2015/09/VRU_58273_sanciones_en_lol.jpg\r\n\r\nYo creo que toda persona puede reencauzarse, y que si bien las contravenciones y faltas merecen su debida sancion, tambien debe haber un programa de reinsercion.\r\n\r\nHasta ahora lol y riot en si trabajaron con un sistema de premios y castigos para las conductas habituales de los invocadores. Yo propongo un agregado.\r\n\r\nCuando llega algun jugador a ser sancionado debe haber un camino a seguir tras su sancion para llegar a ser reinsertado.\r\n\r\nEn el caso de las sanciones medias y bajas una simple restriccion y una cola de espera bastan.\r\n\r\nPero como reinsertamos a los mas graves?\r\nAqui propongo desbanear. Si leen bien desbaneo total.\r\n\r\nMi idea es asi.\r\n\r\nFalta grave - ban de un a&ntilde;o.\r\n\r\nLuego de eso la cuenta se reactiva, pero en honor cero, bronce 5, y con restriccion de chat de 25 partidas.\r\nActo seguido debes pasar a honor 3 para poder rankear nuevamente tu cuenta.\r\n(Obligando a practicar buena conducta y volver al camino de los refuerzos positivos)\r\nY al final debe rankear desde el elo mas bajo.\r\nEsto ultimo es un test. Mas alla de que puedas salir facilmente, la idea es medir la tolerancia del individuo ya que si no se ha reformado realmente volvera a infringir la ley aqui.\r\n\r\nEl desenlace de volver a ser sancionado es la eliminacion definitiva de la cuenta. Y bloqueo de correo o ip o lo que riot disponga.\r\n\r\nLa idea es tratar de recuperar al delincuente y convertirlo en un invocador mas, quizas no el mejor pero si del promedio sano.\r\n\r\nLos no recuperables pues caeran rapido y listo. Nos evitamos ovupar espacio con sus datos. Los recuperables tras renegar y afianzar su busqueda del buen sendero volveran a ser normales.\r\n\r\nY con esto muchos ya no querran volver a cometer faltas. Sobre todo saber que perderan de raiz la cuenta.\r\n\r\nMas o menos eso. Se puede mejorar, pulir y cambiar de plano.","replies":[{"poster":"AxElL93","date":"2018-08-06T20:40:12.741+0000","up_votes":4,"down_votes":0,"body":"jajjajaja","replies":[]},{"poster":"Diosmo","date":"2018-08-06T20:46:29.043+0000","up_votes":3,"down_votes":0,"body":"***","replies":[{"poster":"SolidDisk","date":"2018-08-06T20:48:50.666+0000","up_votes":1,"down_votes":2,"body":"{{sticker:slayer-pantheon-thumbs}} t","replies":[]}]},{"poster":"Hanami Mirai","date":"2018-08-06T20:27:32.435+0000","up_votes":2,"down_votes":0,"body":"No entendí lo de ponerlos \"bronce 5\".\n\nPrimero, si es un jugador con un nivel de habilidad relativamente alto, va a salir sin ningún drama, y segundo, estarías perjudicando la experiencia de juego de los que están en esa liga.\n\nSucede algo similar con el honor, a mi parecer, con el sistema actual no es necesario que seas \"honorable\", si no rompes las reglas, subís, por lo que: **\"(Obligando a practicar buena conducta y volver al camino de los refuerzos positivos)\"**\n\nNo tendría mucho peso como sanción o \"agregado\" si riot no mejora o cambia su sistema de honor, algo que dudo que vayan a ser, al menos por ahora.\n\n\nNo es mala idea. pero como dijiste, creo que se puede pulir un poco más.","replies":[{"poster":"SolidDisk","date":"2018-08-06T20:37:52.718+0000","up_votes":1,"down_votes":5,"body":"Si mira lo primero lo pense. Me dije ok si a mi me ponen en esa liga en una semana estoy oro1.\nLa clave es fumarme a los demas, ver si realmente estoy rehabilitado o a la primera vuelvo a las andadas.\n\nY digo b5 por el mmr. No tiene tanto impacto ya que esas partidas son bastante random y si eres bueno las pasas rapido. Es el lugar donde mas podrias ganar o perder seas quien seas.\n\nLo del sistema de recompensas pues es medio ni, pero bueno igual debes portarte 'no mal' y eso ya es algo. Tampoco es que debas ser el buenachon del bigote pero definitivamente no malote y para eso si sirve.\n\nMas o menos por ahi lo pense.","replies":[{"poster":"Hanami Mirai","date":"2018-08-06T23:07:07.655+0000","up_votes":2,"down_votes":0,"body":"No estas leyendo lo que escribí, yo sé lo que queres hacer, leí tu idea.\n\nSolo veo que te estas cagando en los jugadores que poco tienen que ver con la reforma de otro.\n\nTe lo plantee de buena manera y prácticamente ignoraste todo mi comentario, solo lo usaste para expandir más tu idea y encima sobre el peor punto.\n\nDisculpa la critica dura pero con buenas palabras me ignoraste.\n\n> Y digo b5 por el mmr. No tiene tanto impacto ya que esas partidas son bastante random y si eres bueno las pasas rapido. Es el lugar donde mas podrias ganar o perder seas quien seas.\n\nQue sea la peor liga no quiere decir que tengamos que mandar a todos los jugadores que se portaron mal a jugar ahí, menos cuando ni si quiera pertenecen a esa liga.\n\nNo te emparejan por actitud sino por nivel de habilidad.","replies":[]}]}]},{"poster":"RSSPLOTER","date":"2018-08-06T20:18:13.632+0000","up_votes":2,"down_votes":0,"body":"Despues le van a llover cryposts diciendo por ejemplo:\n\n\"'x invocador' flameo toda la temporada y le devolvieron su cuenta, y a mí que soy un alma pura e incomprendida, no me la devuelven. GG IZI RITO ME BOI AL FORNAI xdxdxdx\"","replies":[{"poster":"SolidDisk","date":"2018-08-06T20:26:02.354+0000","up_votes":1,"down_votes":4,"body":"Claro pero esos acotes aniñados no interesan, la cosa es sumar.\n\nA ver uno puede equivocarse calentarse mal, sacarse y volver a la normalidad la idea esta en que si ya lo sancionaste deberias recuperarlo.\n\nLol es grande, muy grande y podria ser aun mas grande si a su sistema de sanciones y su sistema de premios le agregas uno de reincersion. Entonces tienes a los buenos a los recuperados a los no tan buenos pero safables y luego a la minoria irrecuperable fuera de lol.","replies":[]}]},{"poster":"Mugman Rojo","date":"2018-08-06T20:16:05.180+0000","up_votes":2,"down_votes":1,"body":"Yo con que metan ban de 1 mes me conformo\n\n1 año es demasiado abusivo.\n\n||\n|-\n| {{sticker:slayer-jinx-catface}} | La idea de los baneos por un tiempo es que te dan una segunda oportunidad, si la rechazas, viene permaban","replies":[]},{"poster":"Yellow Sphere","date":"2018-08-07T00:20:45.035+0000","up_votes":1,"down_votes":0,"body":"{{sticker:sg-ahri-3}}","replies":[]}]}