{"poster":"Klavinmour","date":"2017-02-02T06:28:53.805+0000","title":"PSA On Internet Connection","subforum":"Miscellaneous","up_votes":1,"down_votes":0,"body":"So from time to time we all experience a bad connection, we hope it wont effect our gameplay, either through us disconnecting or a team mate.\r\n\r\nFor years I&#039;ve been having trouble with my connection, thankfully it hasn&#039;t majorly effected my experience that much, but occasionally it does.\r\nFor years my family has been struggling to get Telstra to listen to us over the issues.\r\nCracking sounds on the landline.\r\nConstant drop outs to the internet.\r\nSlower speeds than we should be getting.\r\nPhone calls dropping the internet connection even if they are unanswered.\r\nToday the Telstra representative finally asked that one question, finally the question that opens the door to help, on a piece of the puzzle that has gone overlooked all this time.\r\n\r\n&quot;What shape is your wall connection, square or rectangle?&quot;\r\n&quot;Square.&quot;\r\n&quot;Oh... okay...&quot;\r\n&quot;We still have the original phone that came with the installation.&quot;\r\n&quot;Wow! ... that might not support the connections it&#039;s been forced to deal with.&quot;\r\n\r\nOur Telecom lines and wall socket are at minimum 30 years old.\r\nThey have not had any maintenance by Telstra or Optus.\r\nThey should have been updated and replaced when we switched from Dial-Up to ADSL all those years ago. (Currently on ADSL2)\r\n\r\nSo we are getting technicians sent once again, and Telstra will update our wiring at their own expense.\r\n\r\nWhen was the last time your wiring was checked?\r\nIs it too out of date?\r\nYour wall socket, is it square or rectangular?","replies":[{"poster":"CHEESYLEEKS","date":"2017-02-02T08:06:36.551+0000","up_votes":2,"down_votes":0,"body":"tl;dr telstra suck dick.","replies":[]},{"poster":"TM06ASF","date":"2017-02-02T15:20:43.695+0000","up_votes":1,"down_votes":0,"body":"even after the upgrade it its still going to be shit internet and telstra are the worst mob for it https://www.reddit.com/r/explainlikeimfive/comments/40m0t8/eli5why_is_australian_internet_so_bad_and_why_is/ follow the link to learn a bit about why we prob have the worst internet of any first world country","replies":[{"poster":"Klavinmour","date":"2017-02-02T18:15:35.192+0000","up_votes":1,"down_votes":0,"body":"In the end it doesn't matter, I live on the outskirts of a small country town.\nThere is literally no option other than Telstra and Optus as Telstra own the lines to our house and no other company will rent the lines.\n\nOur only hope is to go with Satelite NBN if we want another company.","replies":[]}]},{"poster":"JasonWazza","date":"2017-02-02T09:08:17.780+0000","up_votes":1,"down_votes":0,"body":"Honestly, you would think that would be one of the first things they would ask.","replies":[]}]}