{"poster":"Klavinmour","date":"2016-09-30T15:03:51.916+0000","title":"Come On Riot Fix This Client.","subforum":"Miscellaneous","up_votes":3,"down_votes":0,"body":"So first of all I was just in a lobby that not only could I not see, but I was still at the front screen of the client, watching the World&#039;s group stage timer tick down etc.\r\nI guess that&#039;s just the evolution of the black screen lobby?\r\n\r\nSecond, can we stop with the client blocking external keyboard commands already?\r\nIt&#039;s a supreme pain in the arse to be in a game (now just the client too) and be unable to press FN+F5-7 to control media, I have to ALT+TAB out of the game so I can use my keyboard functions which are designed to be used while playing a game.\r\n\r\nWhat is the purpose of this? To stop people using macros? To stop people using keyboard shortcuts to activate scrips?\r\nPretty sure we know by now that, that doesn&#039;t stop those from happening ever.\r\nNo, it&#039;s just a feature that stops players from controlling their music player, or whatever media player.\r\n\r\nHell to top it off I can&#039;t even use my Switchblade (I use a Razer Deathstalker Ultimate, it has a built in screen and quick access buttons on it for rudimentry things like accessing your media player, the internet etc).\r\nReally? Why can&#039;t I use all the functions of my gaming keyboard, that are designed to be used on the fly within a game, while playing your game?\r\n\r\nI could modify my client to remove this function, but I&#039;d like to keep my account.\r\n\r\nTHERE IS NO PRACTICAL REASON FOR THIS FEATURE TO EXIST!\r\n\r\nREMOVE IT!","replies":[{"poster":"WeaponizedAutizm","date":"2016-10-01T15:58:58.365+0000","up_votes":1,"down_votes":0,"body":"Every patch seems to have a new and wonderful patch-related bug/error/glitch. \n\nA few patches ago I couldn't pay ARAM due to getting the 'no network connection' error when the game started to load after lobby... funny how most of the time I'm on discord and there's no issues with my connection at all. Only happened on ARAM map, never Summoners Rift. Hitting 'reconnect' didn't help. Sometimes shutting down the entire League process tree in Task Manager did and re-logging, but often the only way to actually get into a game was to reboot the PC. This happened to me constantly during one of the patches at the start of the year and then the next patch it miraculously stopped happening while trying to play an ARAM game but started the rear it's ugly head intermittently when playing SR. Thank fk this happened before Riot implemented the 'remake' feature. But the patch that 'fixed' my client gave a friend the exact same problem in both ARAM and Summoners Rift. He was new to League so simply stopped playing the game altogether.\n\nThen there was the patch of constant game crashes. Repairing failed to help, neither did reinstalling. As a final ffs I reinstalled my OS *and* the League client but even that didn't help. Know what 'fixed' it? The next patch....\n\nThis patch, I can't get to the login screen without first shutting down Razer Synapse. If I don't shut it down, then when I hit \"Launch\" nothing happens, no login screen, nothing... except blank desktop. The LolClient.exe will show in Task Manager, but no login client appears on the screen. Uninstalling and reinstalling both the League client and Razer Synapse as well as deleting *all* folders pertaining to the two didn't help. BTW, there hasn't been an update to Synapse since the patch was released, so the issue lies with the League client, not the Razer software. But I'm guessing the next patch will fix this too....\n\nSomething interesting I found during my troubleshooting for this latest problem was people posting on LoL boards saying they were getting banned for scripting and the investigations were pointing towards Razer Shadowplay being the cause. Coincidence?!! GG Riot, this is screen capture software, similar to OBS, nothing at all to do with scripting but this false positive is getting players permabanned. \n\nThe new client we have been waiting for for years now better not be this fkn buggy! I love this game but, between the damn client and 90% of the playerbase being mouthbreathing knuckledragging entitled little f*ckheads (yes, I keep that opinion to myself ingame) who can't take game play or build advice without crying \"TOXIC!\" or \"salty\", I'm starting to not enjoy playing as much. Everything - from getting decent team mates, to actually being able to play a game without errors/crashing - is becoming too much of a hit and miss affair.","replies":[{"poster":"Klavinmour","date":"2016-10-01T19:16:33.111+0000","up_votes":1,"down_votes":0,"body":"This isn't a recent thing really, it's something that's been with the LoL client as long as I can remember.","replies":[{"poster":"WeaponizedAutizm","date":"2016-10-01T20:46:15.337+0000","up_votes":1,"down_votes":0,"body":"Which 'thing' are you referring to HAHA there's a few....\n\nAnd yeah I know the Synapse thing has been around for a while, I found a post dating back to 2012 mentioning it.","replies":[{"poster":"Klavinmour","date":"2016-10-02T04:35:12.436+0000","up_votes":1,"down_votes":0,"body":"The client/game blocking the use of external keyboard commands.","replies":[{"poster":"WeaponizedAutizm","date":"2016-10-03T00:38:30.789+0000","up_votes":1,"down_votes":0,"body":"I have an old but beloved Logitech G510 and I can use all of the 20+ possible media/macro keys ingame. Adding your issue to mine with logging in, maybe it's a Razer/Riot thing? Razer comms didn't like League either, or was it vice versa? while Curse/Discord etc are fine.","replies":[{"poster":"Klavinmour","date":"2016-10-03T00:50:42.243+0000","up_votes":1,"down_votes":0,"body":"It was Curse and Razer, because at the time Curse and Razer added jungle timers and several other things to the client.\n\nWhich is against the rules for obvious reasons.","replies":[{"poster":"WeaponizedAutizm","date":"2016-10-18T10:49:55.092+0000","up_votes":1,"down_votes":0,"body":"Hi, sorry for necroing an old post but I just wanted to say that I've been lucky enough to be given the change to test the new Alpha Client and guess what... I can log in without having to kill Razer Synapse. \n\nBut... if I want to play on the 'normal' client though I still need to kill Synapse lol \n\nSomehow that doesn't surprise me ;) \n\nMaybe you should sign up for Alpha Client Testing to test if you are still unable to use the full functionality of your keyboard? Hopefully it's not an issue anymore though I fear it may be due to it's loose similarity to scripting etc.","replies":[]},{"poster":"WeaponizedAutizm","date":"2016-10-03T01:07:21.066+0000","up_votes":1,"down_votes":0,"body":"ahhh... I did not know that! I have a dual display stopwatch function on the LCD of my keyboard. Back then when timers weren't visible ingame I simply had them permanently set them to a 5 and 6 minute countdown respectively and used that to monitor times. \n\nI also had a small DOS countdown app that I sat on my other monitor that I could access through two F keys (I can't remember which ones) that, when set, would also countdown the timers and then LOUDLY tell me when they were up. That shit used to scare me sometimes when I got engrossed in the game and forgot about it. It was like a voice out of a horror movie.","replies":[]}]}]}]}]}]}]},{"poster":"LevvyLeviticus","date":"2016-09-30T22:39:52.627+0000","up_votes":1,"down_votes":0,"body":"They're making a new one, buddy, should be out maybe mid season 7??","replies":[{"poster":"Klavinmour","date":"2016-10-01T08:36:14.638+0000","up_votes":1,"down_votes":0,"body":"That doesn't imply that they will remove this cancerous feature.\n\nWhich should already be removed on this client for the lead up of a whole year before we get this improved new client that will likely just run on Adobe Air just like the current one, making it have all the same bugs and issues.","replies":[]}]}]}