{"poster":"Klaritus","date":"2015-12-21T22:22:33.023+0000","title":"Zu wenig EP","subforum":"Champions & Gameplay","up_votes":1,"down_votes":6,"body":"Es geht mir in letzter Zeit echt auf die Nerven. Menschen wie Ich die arbeiten m&uuml;ssen und nur 2 oder 3 Runden am Tag spielen k&ouml;nnen bekommen so wenig EP das sie sich niemals einen Champion leisten k&ouml;nnen der 6300 EP kostet. Der erste Sieg des Tages ist ganz n&uuml;tzlich aber immer noch wenig. Ich hoffe das wird ge&auml;ndert!","replies":[{"poster":"Nephirelle","date":"2015-12-21T23:31:59.470+0000","up_votes":3,"down_votes":0,"body":"1. Dass du dir \"niemals\" einen 6300er Champ leisten kannst ist schlicht Unfug. Maximal 3-4 Wochen konstant den Sieg des Tages abholen und du hast ihn zusammen. Schneller, wenn du am Wochenende noch ein, zwei Spielchen mehr machst. In deinem Fall, bei 2-3 Runden/Tag gerade einmal zwei Wochen.\n2. Du benötigst nicht alle Champs (um genau zu sein nicht einmal eine Hand voll) um erfolgreich zu sein und es gibt auch sehr gute Champs für wenig EP.\n3. Champs werden regelmäßig reduziert sobald ein neuer Champ raus kommt.\n4. Du kannst Champs auch mit RP kaufen und du verdienst Geld, also kauf' dir die Champs, wenn du sie nicht erspielen magst - dafür ist das System gedacht.\n5. Dies ist ein F2P Spiel mit keinerlei Pay-2-Win-Elementen. Das ist sehr selten und du willst am liebsten noch mehr kostenlosen Zucker in den Hintern geblasen bekommen - denk' mal über deine Ansprüche nach. Oder arbeitest du etwa umsonst?","replies":[{"poster":"SorisDynasty","date":"2015-12-22T01:26:44.855+0000","up_votes":1,"down_votes":0,"body":"Wobei man sagen muss, wenn man alle Champs via F2P haben möchte, dass es wirklich Ewigkeiten dauert. Nur verstehe ich nicht, wieso alle immer so tun, als ob man alle haben müsste. Wie du es sagtest - man benötigt nur wenige Champions so wirklich. Ich habe alle Champs bis auf Teemo. Ich spiel vereinzelt mal Champs, aber im Großen und Ganzen spiele ich doch so einen engeren Kreis von 10-20 Champions mehr oder weniger regelmäßig. Und da filtert es sich dann noch zwischen \"gelegentlich\" und \"sehr oft\" bis zu \"nahezu jedes Spiel\".\n\nLeichte IP-Gain Erhöhungen von Riot wären schon nett (oder schneller Champions im Preis zu senken) - aber gewiss kein Muss, wenn man mal realisiert, wie wenig man wirklich braucht. Runen außen vorgelassen","replies":[]}]},{"poster":"Sirrkas","date":"2015-12-21T22:33:51.995+0000","up_votes":1,"down_votes":0,"body":"Ich spiele auch eher wenig, mache aber immer meinen Tagessieg. Nach 2 Wochen kann man sich ungefähr einen für 6 k kaufen.","replies":[{"poster":"Lyle","date":"2015-12-21T22:39:59.791+0000","up_votes":1,"down_votes":0,"body":"Das kommt mir nach extrem wenig Zeit vor. Wenn die durchschnittliche Runde auf Summoner's Rift etwa 100 EP gibt und der Tagessieg einen festen Betrag von 150 EP würde man bei nur einem Spiel pro Tag in einer Woche etwa um die 1700 EP bekommen. Selbst bei 'nem zweiten Spiel pro Tag wären wir dann immer noch nicht einmal auf 5000 EP.\n\nIch kann die Probleme des TE zwar nicht aus persönlicher Erfahrung nachvollziehen, da ich dafür viel zu oft spiele, aber kann mir schon vorstellen, dass es gerade mit der steigenden Anzahl der Champions frustrierender wird, festzustellen, dass man eventuell nie alle haben wird. Da man im Endeffekt aber selten mehr als ~15 Champions aktiv spielt, sehe ich das nun nicht unbedingt direkt als Problem. Eher als demoralisierende Optik..","replies":[{"poster":"Sirrkas","date":"2015-12-21T22:43:52.805+0000","up_votes":2,"down_votes":0,"body":"Ich bin mir ziemlich sicher, dass ich genug EP pro Woche verdient habe um in der \"alle 2 Wochen neuer Champ\" Hochzeit neue Champs zu leisten.","replies":[{"poster":"Lyle","date":"2015-12-21T22:48:15.740+0000","up_votes":1,"down_votes":0,"body":"Ich zweifel das nicht an, auch wenn mein erster Satz das eventuell latent suggeriert haben könnte. Nur gehe ich davon aus, dass eben solche Spieler, die nur 1-2 Spiele pro Tag spielen können das in diesem Zeitraum nicht auf die Reihe kriegen können. Das geht aus rechnerischer Sicht nunmal einfach nicht auf.","replies":[]}]},{"poster":"CooL Ice Tea","date":"2015-12-21T22:42:45.311+0000","up_votes":1,"down_votes":0,"body":"Hab heute für meinen Sieg des Tages 272 EP bekommen, mal 14 macht das 3808 EP. Man muss somit einen Monat jeden tag 1 game gewinnen ^^.\n\nMan muss wohl dazu rechnen das Sirrkas sicher davon ausgeht das man nicht jeden Tag 1 game macht und das gewinnt sondern 2-3 Games bis man den Tagessieg hat. Dann kommen natürlich anderen Zahlen raus.","replies":[]}]}]},{"poster":"Abasin","date":"2015-12-22T08:57:32.051+0000","up_votes":1,"down_votes":0,"body":"Tagessieg etwa 215 EP, weitere Spiele etwa je 50 EP. Würde bei 4 Spielen am Tag auf rund 350 EP hinauslaufen. Pessimistisch aufs Jahr gerechnet rund 125000 EP. Wenn das nicht reicht...","replies":[]},{"poster":"The valiant Hero","date":"2015-12-22T06:21:02.425+0000","up_votes":1,"down_votes":0,"body":"Dafür gibt es EP boosts. Für diejenigen, die kaum Zeit zum spielen haben, weil sie zu beschäftigt damit sind, geld zu verdienen.","replies":[]},{"poster":"0815xand0r","date":"2015-12-22T01:43:28.292+0000","up_votes":1,"down_votes":0,"body":"Das Problem ist ja, dass obwohl immer mehr Champions dazukommen, über die Jahre der EP-Gain nie erhöht wurde (ich meine mich sogar zu erinnern, dass er mal verringert wurde). Das ist halt vor allem für Neueinsteiger demotivierend. Natürlich braucht man nicht alle Champions, aber wie soll man herausfinden, welche man spielt, wenn man sie nicht spielen kann (und nicht ewig warten will, bis sie mal in der Rotation auftauchen). Dazu kommen Runen und Runenseiten. Wenn man neu anfängt, hat man da wirklich seeeeehr viel, was man kaufen will/muss. Eine leichte EP-Erhöhung wäre durchaus okay, allein den Sieg des Tages um 50 EP zu erhöhen würde schon enorml viel bringen.","replies":[]},{"poster":"haha weed lol xd","date":"2015-12-22T01:21:55.727+0000","up_votes":1,"down_votes":0,"body":"Keine Ahnung warum es Riot nicht wie in Smite macht und täglich Login-In Bonus in Form von Ingame Währung und Freischaltbares gibt ( Skin für 7 Tage o.Ä )","replies":[{"poster":"Lyle","date":"2015-12-22T01:29:45.842+0000","up_votes":1,"down_votes":0,"body":"Warum sollte man ein funktionierendes Umsatzmodell ändern? Das relativ geringe EP-Einkommen trägt dazu bei, dass nicht wenige Spieler sich den ein oder anderen Champion mit RP kaufen. Solange die Kunden das mitmachen gibt es doch keinen Grund, auf das Geld zu verzichten, dass dadurch bei Riot eingeht.","replies":[{"poster":"haha weed lol xd","date":"2015-12-22T01:38:17.900+0000","up_votes":1,"down_votes":0,"body":"k","replies":[]}]}]},{"poster":"Im a Papaya","date":"2015-12-21T22:51:36.379+0000","up_votes":1,"down_votes":0,"body":"Wer jung ist und Zeit hat erspielt sich die Punkte, wer älter ist und Zeit in Geld investiert nutzt selbiges um zu kriegen was er will.\nWie unfair wäre es denn jetzt die Punkte zu erhöhen wenn andere sich vorher mehr anstrengen mussten, erst recht da dein Wunsch an die Erhöhung der Punkte scheinbar nicht gerade gering ist.","replies":[]}]}