{"poster":"Rastow","date":"2017-11-13T16:42:40.760+0000","title":"Plat/Dia-Team LF ADC","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hey Beschw&ouml;rer / -innen,\n\nwir sind auf der Suche nach einem ADC, um unser Roster zu vervollst&auml;ndigen.\n\n**Zu uns**\n\nWir sind ein seit ca. einem Jahr bestehendes Team (mit den jetztigen Mitgliedern seit ca. einem halbem), welches das Ziel hatte LowElo-Spieler im Umfeld eines Teams beim Improven zu helfen. Mit diesem Grundgedanken startete das Team von Silber / Gold und befindet sich nun im Platin / Diamant - Bereich.\n\nNach einigen Auswechslungen und &Auml;nderungen mit z.Z. folgendem Roster:\n\n> Top: [Paws of Justice](https://euw.op.gg/summoner/userName=pawsofjustice)\nJungle: [B&aacute;rs&igrave;ck](http://euw.op.gg/summoner/userName=b%C3%A1rs%C3%ACck) und [Rastow](https://euw.op.gg/summoner/userName=rastow)\nMid: gesucht\nAdc: gesucht\nSupport: [Ellenaj](https://euw.op.gg/summoner/userName=ellenaj)\nCoach: Ruaga\n\n**Was wir mitbringen**\n\n* Feste Trainingszeiten: W&ouml;chentlich finden 2 Scrims / Turniere statt, welche sich z.Z. auf Sa + So belaufen. Dies kann sich nat&uuml;rlich &auml;ndern, wenn das Roster komplett ist. Neben den 2 festen Terminen spricht nat&uuml;rlich nichts dagegen mehr zu trainieren. Zusammen DuoQen / FlexQen, weitere Turniere und Anderweitiges sind erw&uuml;nscht.\n\n* Coaching: Jede Woche findet eine Theoriestunde mit dem Coach statt (aktuell: Donnerstag 21:00). Ebenso gibt es noch Solosessions, die nach Bedarf ausgemacht werden und dann rollenspezifisch bzw. themenspezifisch mit dem Coach allein oder mit (meist einem, z.B. ADC und Support zusammen) weiteren Teammitglied trainiert wird.\n\n* Eingespieltes Team: Wie oben schon genannt besteht das Team schon seit einiger Zeit und ist demnach mehr oder weniger aufeinander eingespielt.\n\n* Das &Uuml;bliche: Nat&uuml;rlich haben wir auch einen TS-Server zur Verf&uuml;gung (sowas von 2k16) und ein GoogleDoc f&uuml;r Organisatorisches und Weiteres.\n\n* Ziele: Die jetztige Beschreibung des Ziels des Teams ist im Grunde &quot;So weit wie m&ouml;glich kommen&quot;. Genaueres findet man unter den Anforderungen, ansonsten kann gerne noch im privatem Umfeld dar&uuml;ber geredet werden.\n\n------------\n**Was du mitbringen...**\n\n...musst!\n\n* Gleicher Elobereich: Hei&szlig;t du musst Platin oder Diamant sein. Ansonsten wird es nicht nur spielerisch sondern auch seitens des Teamtrainings schwierig. (Wichtig: FlexQ Rang ist vorerst unbedeutend!)\n\n* Mainaccount: Tut es bitte nicht einigen eurer Vorg&auml;nger gleich und fangt an uns mit euren Smurfaccounts zu adden und dann stehen wir mit siebenunddr&ouml;lfzig Accounts da. Wir wollen vollstes Commitment also ist uns dein Main gerade gut genug!\n\n* Mainrolle: Spricht, denke ich, f&uuml;r sich. Dem Team macht das weniger aus, aber von meiner Perspektive aus muss diese Person sonst noch in ihre Rolle &quot;reingecoacht&quot; werden, was den Rest des Teams aufhalten wird.\n\n* Aktivit&auml;t: Spricht, denke ich, ebenso f&uuml;r sich. Gilt vor allem gegen&uuml;ber den angestrebten Zielen.\n\n* Zielsetzung: Unsere derzeitige Planung sieht im Grunde so aus, dass vorerst noch weiter improved wird und w&auml;hrenddessen regelm&auml;&szlig;ig an kleineren Turnieren teilgenommen wird und darauf auf Amateurliga hingearbeitet wird, usw... Hier ist es wichtig, dass deine Zielsetzung dem gleich / nahe kommt, ansonsten macht das auch nicht viel Sinn.\n\n* Technik: TS&sup3;, funktionierendes Mikro und Headset (eben das &Uuml;bliche)\n\n...solltest\n\n* Alter: Wir befinden uns im Altersbereich von 18 - 22, w&auml;re also ganz nett, wenn du dich auch da herum befindest, ist aber eben kein Muss.\n\n* Soziale Kompetenz: Das Mikro sollte dann auch benutzt werden.\n\n* Der restliche Rotz: Wie Championpool und so.\n------------\n**Prozedere**\n\nEs werden mehrere Tryouts in Form von Scrims / Turnieren am Dienstag und Mittwoch Abend stattfinden.\n\nBei Interesse mich IG adden; N&auml;heres wird dann besprochen.\n\nMfG,\nRastow","replies":[{"poster":"ShanksDD","date":"2017-11-13T17:25:34.116+0000","up_votes":1,"down_votes":0,"body":"Hey,\nIch hab dich mal geaddet^^ würde mich unglaublich freuen wenn ich am mittwoch bei den Tryouts mit machen darf.\nIch bin PLatin 2 main adc seit season 3 und habe schon bei dem ein oder anderen Team gespielt.\nAuch ein wenig Turnier Erfahrung ist auf jeden Fall vorhanden.\n\nIch würde unglaublich gerne wieder als Team unter einem Trainer spielen weil man da einfach am besten improven kann.\nLG Shanks","replies":[]}]}