{"poster":"Yaminari","date":"2015-11-18T20:54:23.341+0000","title":"Este fue el pan de cada día esta season...","subforum":"Charlas Generales","up_votes":4,"down_votes":3,"body":"Estoy cansadisimo y a la vez me muero de la risa, en comparaci&oacute;n con el a&ntilde;o pasado esta lleno de oros y platinos, nada que ver, yo no se riot si pudiera poner una tabla con el porcentaje de las cuentas que est&aacute; season han subido a esas ligas durante el a&ntilde;o desde plata pero aseguran que en comparaci&oacute;n al a&ntilde;o pasado debe haber una cantidad descomunal, si fuera una gr&aacute;fica seguramente ser&iacute;a una barra enorme a comparaci&oacute;n, porque el a&ntilde;o pasado no hab&iacute;an tantos  Otros y como siempre quedan en el n&uacute;mero V y coincide que tambi&eacute;n juegan muy mal, vas y miras en lolking con la mayor&iacute;a (no digo que todos) y te que vienen jugando desde la season 3 y que son bronce desde la s3 pero llegaron a la s5 y en 3 meses PUM pa&#039;rriba y escalaron a oro asi de rapido como que se hubieran tomado un anab&oacute;lico digital y de un dia pal otro est&aacute;n en oro.... cual es la magia? y... en algunos pa&iacute;ses tiene color verde, en otro van del azul al rosa, pero coincide que todos tienen numeros y la mayoria tiene caras de personas importantes.... a si y siempre est&aacute;n acompa&ntilde;ados del $... nono yo creo que este a&ntilde;o m&aacute;s del 20% de las cuentas tendr&iacute;an que haberse quedado sin premio de season alguno y baneados por 1 mes... lo mejor es que despu&eacute;s la gente te dice: no pero pudieron subir ellos no hace falta que hagan alguna trampa, yo subi de bronce 3 a oro v en 2 meses, es jugar rankeds nomas... etc... y si muchos se defienden,qui&eacute;n va a querer confesar que es narcotraficante? y...ninguno, se defienden y el que no lo hace lo matan a tiros y al que abre la boca lo tiran al r&iacute;o... y aca es igual, el que manda al muere muere tambi&eacute;n... pero bue yo tengo la prueba m&aacute;s grande y es un amigo, le hicieron esa &quot;magia&quot; y el mismo nos dijoa nosotros yo le mande un tiket a soporte comentandole que lo investigan y ah&iacute; me dejaron, este a&ntilde;o hizo lo mismo para las 10 primeras partidas para quedar seguro y bue ahi esta su cuenta ilesa limpia y con sus recompensas, pero lo comento solo para que no digan que se hace justicia, yo tengo un ejemplo en mi propio circulo de amigos y veo que a la palabra justicia le faltan todas las letras.\r\n\r\ncosas como estas http://i.imgur.com/PHQmjDo.png encuentro todos los d&iacute;as cada vez que investigo cuadno veo alguno que es de oro V para arriba que juega p&eacute;simo en la partida y que adem&aacute;s es t&oacute;xico, para mi queda clar&iacute;simo pero bue...\r\n\r\nPD: mi amigo juega bien igual hizo eso porque estaba cansado de los bronce y los plata y despues subio a plat el solo, pero igual que lo hizo lo hizo y ni hablar que qued&oacute; tan bien parado que con 3 partidas ya quedaba en promo... as&iacute; que no se ahi ven la realidad de las cosas hoy en d&iacute;a","replies":[{"poster":"PiRaNiA","date":"2015-11-18T20:59:27.255+0000","up_votes":2,"down_votes":0,"body":"Igual en el gráfico ese tardó 3 meses en subir de Bronze I a Gold V, si fue un eloboost pago lo re abrocharon a tu amigo jaja.","replies":[{"poster":"ECO DE BO LUDEN","date":"2015-11-18T21:46:20.140+0000","up_votes":6,"down_votes":0,"body":"Es que pago en cuotas {{sticker:slayer-jinx-wink}}","replies":[]},{"poster":"Yaminari","date":"2015-11-19T05:21:22.701+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=PiRaNiA,realm=LAS,application-id=v7qsfXsE,discussion-id=EK86YNao,comment-id=0000,timestamp=2015-11-18T20:59:27.255+0000)\n>\n> Igual en el gráfico ese tardó 3 meses en subir de Bronze I a Gold V, si fue un eloboost pago lo re abrocharon a tu amigo jaja.\n\na mi amigo le subio un amigo de él al que le pagó ponele 50 dólares en un mes lo subió a oro v, seguramente por ahi ahi unos cuantos diamantes/platinos que por 2 pesos te demoran mas pero te suben igual...","replies":[]},{"poster":"BeMaster","date":"2015-11-18T22:40:46.660+0000","up_votes":2,"down_votes":0,"body":"Sisi jajaja, horrible. Es más, hasta me atrevería a decir que quizás no lo elobostearon. No hay forma de que tarden 3 meses en subirte a oro 5 desde bronce, siendo tan fácil.","replies":[{"poster":"Yaminari","date":"2015-11-19T05:26:01.427+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=BeMaster,realm=LAS,application-id=v7qsfXsE,discussion-id=EK86YNao,comment-id=00000001,timestamp=2015-11-18T22:40:46.660+0000)\n>\n> Sisi jajaja, horrible. Es más, hasta me atrevería a decir que quizás no lo elobostearon. No hay forma de que tarden 3 meses en subirte a oro 5 desde bronce, siendo tan fácil.\n\npero yo pregunto por que yo me mate a ranked el año pasado y este año al principio y llegue de b4 a plata 3 y baje otra vez a plata 4 y de repente estos que supùestamente son mejores que yo, juegan 10 veces peor, y no es algo como a tubieron una mala partida, sino que casi cada uno de estos oro v q me toca juegan mal la mayoría de las partidas, hay bost baratos y mas caritos, seguramente hay muchos pichis que no son tan buenos pero si mejores q te suben y demoran mas pero que te cobran chirolas, ademas del boost esta el drop hack que a mi amigo le paso com en 5 partidas seguidas un día, entr el boost barato y trucho que hay mas el drop H hay muchos en oro v q  no merecen ni ser rankeadso en bronce","replies":[]}]}]},{"poster":"Jian","date":"2015-11-18T22:04:43.712+0000","up_votes":2,"down_votes":0,"body":"***","replies":[{"poster":"Hwaxinghz","date":"2015-11-19T11:14:06.194+0000","up_votes":1,"down_votes":0,"body":"Está bien lo que planeas, pero insisto, si un aliado tuyo (por ejemplo un oro) no sabe farmear, se pone a melee a tradear o siempre en TF lo matan primero, es obvio que hay algo raro \"¿Cómo subiste a oro sin siquiera te sabes posicionar ni farmear?\" Por más mala partida que uno tenga, si no se sabe posicionar, no sabe ni farmear, no sabe ni tradear ni su objetivo en TF, es obvio que no pertenece a la liga que esté (mayor a ORO hablando, porque en bronce y plata se puede \"dejar pasar\").","replies":[]}]},{"poster":"judas94","date":"2015-11-18T21:02:06.565+0000","up_votes":3,"down_votes":1,"body":"Yo en 5 días subí una de plata 4 a 3 jugando 10 partidas en total, despues no jugue más por falta de tiempo, a ese le tomo tres meses de bronce 1 a oro 5, me parece bastante normal y sin saltos exagerados. Una gráfica de elo a veces no es la pauta de elo boost, la pauta es si empieza a magicamente jugar en una linea que no toco en su vida, o si cambian de lugar los hechizos de invocador, como esos que toda la vida jugador con el flash en la F y magicamente lo pasan a la D, y un tiempo luego vuelve a la F.","replies":[]},{"poster":"Borriic II","date":"2015-11-18T23:15:29.336+0000","up_votes":1,"down_votes":0,"body":"y si te digo que la mitad de mis amigas que eran silver-oro en una semana subieron a platino V... como te quedas? xD\n\nincluso a mi a veces contactos me preguntan \"me subes a oro?\" yo solo les digo, casi no rankeo ni para mi mismo y voi a andar subiendote la cuenta a ti :P\n\nyo tambien he pensado en denunciar a varias personas pero luego es como meh.... cuando entra en cola entro yo tambien y digo ojala me toque en contra asi es una victoria gratis y si me toca en mi team me salgo de la partida antes que empiece xd free elo :D","replies":[{"poster":"Lysaru","date":"2015-11-19T05:59:12.383+0000","up_votes":2,"down_votes":1,"body":"\"y si te digo que la mitad de mis amigas que eran silver-oro en una semana subieron a platino V... como te quedas? xD\"\n\nWOWOWOWOWO, Da - las - re - view (Mini).\n\nTenia que hacerlo lel","replies":[{"poster":"Borriic II","date":"2015-11-19T19:55:34.327+0000","up_votes":1,"down_votes":0,"body":"gracias por poner el mini, necesitaba mi dosis diaria <3","replies":[]}]}]},{"poster":"Ode to dark","date":"2015-11-18T22:22:28.546+0000","up_votes":2,"down_votes":1,"body":"Yo también tengo un amigo que lo eloboostean todas las season a Oro V, me da mucha rabia y a veces me dan ganas de denunciarlo.","replies":[]},{"poster":"Hwaxinghz","date":"2015-11-18T21:40:22.889+0000","up_votes":1,"down_votes":0,"body":"Así como comentas, tengo ejemplos de muchos contactos míos que eran Bronces (literalmente, en juego y en división, pero cuando digo BRONCES, eran super malos) y de la nada entro así como todos los días y reviso mi lista de amigos... CHAM!!! (imagínese en forma de \"Wut!!?!?!?!\") veo todos mis contactos Bronces que estaban en Oro 5 (pero absolutamente TODOS, hasta mi Ex novia que sinceramente juega no tan bien para ser Oro, de un día para el otro es Oro) y digo \n_\"A bueno... está bien, mira con que gente me voy a enfrentar cuando alguna vez en mi vida se me de por rankear y mira que gente me tocará en mi equipo a la hora de jugar un rato\"_\nNo es que insulte a la gente por ser bronces, que de hecho no me molesta para nada. Es más, los ayudo dándole consejos y ayudas personales (por Skype o escribiendo, etc). Pero cuando uno ve esta situación y uno (yo) es oro 5 también, a la hora de intentar jugar rankeds, ya uno como que desconfía un poco \"¿Y si me toca en mi equipo alguno de mis contactos que están en Cola ahora mismo?\" Es obvio que voy a perder.\n\nTengo en mi Computadora una lista enorme de jugadores que me tocaron en rankeds que eran Platinos/Oros que no sabían lo básico de cualquier campeón (mínimo me los he topado 3 veces en rankeds y varias veces en Normales). Una cosa es tener una mala partida, entiendo PERFECTAMENTE, pero que te le caiga a uno en una partida cualquiera uno de esos jugadores que no saben Farmear, no saben ponerse a rango para tradear con el ADC enemigo (quién no vió una Tristana MELEE en tu team y en el team enemigo una tristana que te kitea el 99,99% de las veces que intentas hacerle algo?), digo, está bien, no es tu personaje principal, pero hasta YO me considero que por más que el personaje que esté usando en ese momento NO LO SE USAR, por lo menos se farmear lo mínimo indispensable, se ponerme a rango y en todo caso me quedo a lo \"cagón\" sin tradearle bajo torre, pero no, estos pushean sin wards, echan la culpa al soporte (que en seleccion de campeones salen diciendo \"no te preocupes, te carreo\"), se mueren bajo torre enemiga porque si, y un sinfin de cosas.\nBueno la cuestión es que en cualquier momento envío al soporte la lista de gente eloboosteada y el día que un Rioter lo lea seguro se desmayaría de la cantidad de gente que tiene esa lista. Si se preguntan porque no la envío, claramente tengo amigos míos (literalmente amigos que conozco) que están en esa lista, pero no las quiero enviar debido a que quiero investigar un poco más sobre algunas personas hasta estar seguro de quienes sean (o a lo mejor justo estaban trolleando que no es lo mismo que Eloboosteado), pero igual no se, No quiero ser mal amigo de nadie, Solo ser Justo con todos.\n\nEn definitiva, que hay un millón de personas en Oro 5 y que la mayoría son eloboosteados, te puedo asegurar que sí, puede ser y la verdad por culpa de mi internet (si, hay que echarle la culpa alguien o a algo ¿no? (?) ) no puedo Stremear sino les muestro a todos a que me refiero. (Desde platinos reales del team enemigo a oros eloboosteados en el team aliado (ver la última y penúltima partida clasificatoria que jugué hace 5 días mas o menos) para que vean lo que digo. Una está grabada en Las.op.gg y la otra no la pude grabar porque no andaba bien la página. Pero pueden ver estadísticas.","replies":[{"poster":"zelaya19","date":"2015-11-18T22:25:22.947+0000","up_votes":1,"down_votes":0,"body":"¿Quién era mejor, Blitzcrank o Cassiopeia?","replies":[{"poster":"Hwaxinghz","date":"2015-11-19T11:08:55.483+0000","up_votes":1,"down_votes":0,"body":"No tengo ni idea de que estás hablando (o que sea Sarcasmo o algo por el estilo).\nPero si te refieres a que personaje es mejor, Cassiopeia me gusta mucho más que Blitzcrank porque ese Support en específico me desagrada bastante. Además Cassiopeia tiene más mecánicas.","replies":[{"poster":"zelaya19","date":"2015-11-19T17:18:03.383+0000","up_votes":1,"down_votes":0,"body":"Lo decía por tus últimas dos clasificatorias a las que hiciste mención! Blitz o Cassio aliado.","replies":[{"poster":"Hwaxinghz","date":"2015-11-19T17:44:16.038+0000","up_votes":1,"down_votes":0,"body":"AAA... jajaj... la Cassio le regaló la partida al Zed al instalockear cassio (sabiendo que el rival first pickeó zed), le dio 3 kills al minuto 8 mas o menos, luego empezó a decir \"gg jungla no gankea, Support no wardea\". \nLuego el blitz instalockeó Blitz y en selección de campeones me dijo \"relajate, pickea cualquier cosa que  te gano la línea. Será izi\", entonces le dije a mi duo que iba a ir yo mid que le ganaba a orianna, hasta que me enteré que el Blitz era un fraude y Braum se la pasó merodeando por mid junto al yi, que por cierto este último era bastante manco, no podíamos hacer nada, el Tahm kench era bueno, pero el amumu y el blitz eran pesos muertos prácticamente, encima de mancos super flamers que ya me quitan las ganas de jugar cuando veo gente así, aunque lo mismo seguí intentando hacer lo mejor que pude.\n\nSi te refieres a quien fue mas manco, la Cassiopeia, por instalockear Cassio sabiendo que hay un zed enemigo y encima echaba la culpa al Jungla... Lógica de Bronces. Ahora, la partida del Blitz casi la ganamos porque se les fue AFK el negro 5 minutos y casi les tiramos todo.","replies":[]}]}]}]}]},{"poster":"N1725","date":"2015-11-19T15:11:42.059+0000","up_votes":1,"down_votes":0,"body":"Te complicas por nada, si igual terminan bajando solo esas personaa que no subieron su cuenta.\n\nPor ejemplo en un grupo de conocidos que tengo hay el caso especial del niño simbolo por decirlo asi \"tulkascl\" su nick , que ha pagado varias veces para que lo suban a oro, lo hacen y vuelven a bajar a silver y asi se repite el ciclo, de hecho juega desde la s1 y aun esta silver, en conclusión cada uno esta donde debe estar.\n\nControlarl todo eso es dificil y casi imposible pero al menos en ranked se regula solo.\n\nComo consejo, deja de preocuparte por tonteras y juega nomas, en los normal aprovecha de probar cuanto quieras sin importar que digan y en rankeds concentrate bien incluso en ayudar a los que peor van para sacar adelante tu juego, quizas algo aprenderan las personas que subieron y les servira a los dos.","replies":[]},{"poster":"Runth","date":"2015-11-19T09:58:15.664+0000","up_votes":1,"down_votes":0,"body":"caso de \"carrito\"?\n\ncaso de un jugador con solo ir un champ en ranked?\n\no eloboost?\n\no un win trade?","replies":[]},{"poster":"FF at 20","date":"2015-11-18T23:27:14.087+0000","up_votes":1,"down_votes":0,"body":"Realmente discrepo contigo, para mi sigue todo igual (mas o menos siempre fue así la gráfica) http://www.lolsummoners.com/stats/las","replies":[{"poster":"Yaminari","date":"2015-11-19T05:28:33.024+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Hell Paradise,realm=LAS,application-id=v7qsfXsE,discussion-id=EK86YNao,comment-id=000a,timestamp=2015-11-18T23:27:14.087+0000)\n>\n> Realmente discrepo contigo, para mi sigue todo igual (mas o menos siempre fue así la gráfica) http://www.lolsummoners.com/stats/las\n\nno te parece raro que haya la misma cantidad de Oro v que de bronce 1? y que haya menos platas 2 y 1 ? y que despues oro 4 3 2 hayan muchísimos menos? pagas 2 pesos y te dejan en oro para las recompensas, lo que se pagan una skin le pagan a algún amigo que es masomenos bueno para subirles, no hablar de esas premade que hacen con gente que smurfea... no sera boost pero es casi lo mismo","replies":[{"poster":"HyenaLoL","date":"2015-11-19T09:56:33.744+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Yaminari,realm=LAS,application-id=v7qsfXsE,discussion-id=EK86YNao,comment-id=000a0001,timestamp=2015-11-19T05:28:33.024+0000)\n>\n> no te parece raro que haya la misma cantidad de Oro v que de bronce 1? y que haya menos platas 2 y 1 ? y que despues oro 4 3 2 hayan muchísimos menos? pagas 2 pesos y te dejan en oro para las recompensas, lo que se pagan una skin le pagan a algún amigo que es masomenos bueno para subirles, no hablar de esas premade que hacen con gente que smurfea... no sera boost pero es casi lo mismo\n\nen realidad no, se justifica con el miedo a descender de los recien ascendidos que dejan de jugar\ny con el conformismo de los que llegan a esas ligas. Ya que las recompensas de ser G5 o G4/3 son las mismas y saben que a platino no llegan\n\nDesde la season 2 el soloq se distribuye con gran % de la liga en las divisiones 5","replies":[]}]},{"poster":"Ch4puLin","date":"2015-11-19T00:42:35.697+0000","up_votes":1,"down_votes":0,"body":"Son distintas cosas. En una cola elo siempre se va a ver una distribución normal. \nCuando uno gana, el otro tiene que perder.\nEso no implica que no haya muchos eloboosteados.\nPersonalmente no lo noto, y si supiera de alguien, lo denunciaría.","replies":[]}]},{"poster":"HyenaLoL","date":"2015-11-19T09:52:36.813+0000","up_votes":1,"down_votes":0,"body":"[Distribución de la población de LAS por ligas](http://www.leagueofgraphs.com/es/rankings/rank-distribution/las)","replies":[]},{"poster":"I am bl4z","date":"2015-11-19T02:08:43.828+0000","up_votes":1,"down_votes":0,"body":"Yo me demore 2 semanas de B5 a plata, me ilumine jugando en las mañanas... xD\n\nAdemas el server sigue teniendo 55% en bronce t.t \n\nPD: no lei tu testamento, pero imagino de que reclamabas, es pan de cada dia...","replies":[]},{"poster":"Rîck Hunter","date":"2015-11-19T02:08:05.208+0000","up_votes":1,"down_votes":0,"body":"Malo el ejemplo que pones en el gráfico","replies":[]},{"poster":"Volve Menem 2019","date":"2015-11-19T01:53:47.163+0000","up_votes":1,"down_votes":0,"body":"A mi me tardo 3 meses en subir de plata IV a Platino III, no fue por eloobost, fue por el tio dario cuando estaba free {{sticker:slayer-jinx-catface}}","replies":[]},{"poster":"DonaId J Trump","date":"2015-11-18T23:07:00.105+0000","up_votes":1,"down_votes":0,"body":"No tiene nada de raro subir rapido. Yo terminé la season pasada en bronce I. Esta temporada jugué un montón al principio y logré llegar a plata I en mas de 250 partidas, luego tuve una mala racha y bajé a plata III. Me dediqué a jugar normals, mas que nada para entretenerme y practicar un poco, siempre me consideré mejor que mi liga, pero nunca lo probé. Dejé de jugar rankeds por mucho tiempo hasta que llegue al punto de aburrirme jugando normals.\nUn día, decidí ponerme a jugar para evadirme de un problema, pero como mi pc entra tarde a la sala en normal, decidí jugar una ranked, ya que tenía claro que quería jugar {{champion:41}} . First pick y saqué a gangplank mid. Para mi sorpresa, destruí, gané mi linea muy facil, siendo que tenía pocos conocimientos sobre el rework y mi build era bastante estandar. Como tuve tan buenos resultados, segui jugando gangplank, en 50 partidas, 40 fueron jugadas con ese campeon y solo 50 fueron necesarias para subirme de plata III a platino V en 3 días.\n\n¿Que pasó? Que después de 270 partidas dependiendo de un buen equipo para ganar aprendí a carrear sin importar el equipo. Llegué a tener una racha de 23 victorias seguidas con gangplank y lo podía usar casi todas las partidas, ya que no le tenía miedo a ningún campeón en linea, porque aprendí a usar a {{champion:41}} muy bien y cuando me tocaba last pick, tenía que suportear o jugar otro rol (que no tengo problema en jugar, pero yo aprendí a carrear con gangplank xd) era cosa de poner mi lolking o mi historial y me dejaban la linea que quería.\n\nEs cosa de enfocarse en lo que importa, farmear, no morir y sobretodo evitar que tu equipo feedee.\n(Cabe destacar que una vez en oro V, mi mmr era tan alto que me salté oro IV, para pasar directamente a oro III y después me salté oro II, para llegar a oro I. Así logré pasar de oro V a platino V en solo 3 promos.)","replies":[]},{"poster":"Tatsuya","date":"2015-11-18T22:26:01.901+0000","up_votes":1,"down_votes":0,"body":"fa muy buena, el mio es bastante triste me dejo, http://imgur.com/Xtej3s4\n\nabri en platino V y dije \"dejemonos de joder y lleguemos a diamante\", termine en platino II perdiendo como 15 promos, 5 en platino II, 8 en platino IV, y 2 en platino III... una paja, porque tenia el mmr altisimo y apenas perdia la promo entraba denuevo en promo... un circulo vicioso muy molesto. tambien yo un jeropa que espero hasta agosto para hacer el click jaja.","replies":[]},{"poster":"WenaMapache","date":"2015-11-18T21:14:14.235+0000","up_votes":1,"down_votes":0,"body":"Yo hice exactamente lo mismo, pero con un tipo que me toco en ranked... no tengo la grafica ni el nombre (porque no se puede poner en el foro... En serio, existe una regla mas inutil que esta?) sin embargo, en la grafica se notaba que el tipo en 2 meses llego a Platino desde Bronce... y en esas fechas estabamos ponte tu a Septiembre. El tipo era Bronce hasta Julio y en 2 meses iba a subir tanto? en Bronce, bajaba, subia, bajaba, subia y de la nada empezo a tener rachas con campeones que ni el juega.","replies":[]},{"poster":"Caipirinhã","date":"2015-11-18T21:09:52.448+0000","up_votes":1,"down_votes":1,"body":"WP","replies":[]}]}