{"poster":"ChillBro123","date":"2016-12-30T02:38:35.383+0000","title":"what to do if adc is being over aggressive","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":0,"body":"for example trying to 1v2 with no wards or tower diving early like level 2 or 3","replies":[{"poster":"DarkShade918","date":"2016-12-31T10:15:16.942+0000","up_votes":1,"down_votes":0,"body":"AFK, and report them for inting","replies":[]},{"poster":"Miicka","date":"2016-12-30T05:35:18.003+0000","up_votes":1,"down_votes":0,"body":"Well as an ex-ADC main, I have to be honest I am guilty of doing just that frequently.\n\nI always remember thinking \"Wtf, where is my support?\". Of course this was just me being a salty ADC main who thinks he is always right.\n\nIf I were you, I would always stick with my ADC if they are doing well. Most ADCs tend to think that just because they are 3/0 means they can 1v5, and when they get in a sticky situation they need you to be there so the enemy doesn't get the shutdown.\n\nHowever, if they aren't so good, and have acquired a negative kda and a lost tower in bot lane by 15 minutes, I would start roaming every now and then. Your ADC probably fed for a reason: because he's not so good. So its best just to let him farm safely down in bot lane and help out your mid laner, as they are probably trying to fend off the enemy bot lane who roamed mid once they destroyed your tower.\n\nI hope this helps, and best of luck supporting us salty ADC mains!","replies":[{"poster":"ChillBro123","date":"2016-12-31T02:10:43.690+0000","up_votes":1,"down_votes":0,"body":"Thanks, We're all salty sometimes","replies":[{"poster":"FatedSaviour","date":"2016-12-31T10:15:15.047+0000","up_votes":1,"down_votes":0,"body":"salty others salt me right up","replies":[]}]}]},{"poster":"Captain Fortune","date":"2016-12-30T12:46:57.265+0000","up_votes":1,"down_votes":0,"body":"In my opinion I think a lot of these things in bot Lane come down to a lack of communication. \n\nWhat I mean by this is often when you go into Lane not having talked to your bot Lane partner that you have gotten matched with you don't really know how they play. There is a lot of time during champion select and before Minions spawn where you could fix this however.\n\nTalk to your ADC and ask them how they want to play the Lane, have it be aggressive or farming. When you know how they want to play before going into laning phase this not only lets you know what to expect but it lets you throw your hat into the ring before they do something you don't want them too.\n\nFor example if you are against a lane that you don't want to go aggressive into if your ADC had communicated that they want to be aggressive you could state that you would prefer to be a bit passive because of X reason.\n\nGive them friendly reminders as you go back and watch thier items. They just went back and got a BF Sword early on? Let's use that power spike to fight and communicate that with them. If you keep the constant flow of communication, pings and trust up you will find that you can understand why your ADCs play the way they do a lot easier and have a much more enjoyable laning experience.\n\nHowever though you will run into some ADCs that won't communicate back and that is ok. Try to get a feel for their playstyles within the first few waves and adjust accordingly. Make sure to use pings where you can as well to help guide them to what you think will win you the Lane.\n\nAll up though at the end of the day make sure that your ADC is happy with how you are playing the Lane. An ADC who wants to be aggressive but is forced to be passive will very easily be frustrated and pushed to make rushed choices which never end well.\n\nSo all up keep a constant flow of communication and try to understand why your ADC wants to play the way that they do.\n\nI hope that this helps, if there is any other questions I can answer feel free to ask and if there is anything else I can do to help let me know as well. Good luck in your games.\n\n~Elam","replies":[{"poster":"ChillBro123","date":"2016-12-31T02:17:32.960+0000","up_votes":1,"down_votes":0,"body":"I Understand what your saying but I usually cant even seem to get the ADC'S attention cos in the lower levels a lot of players spend the time in champ select saying stuff like, !#@$ you Im ADC or Why the !#@$ are you playing draven adc\nOcassionally I get a team with a smurf and we usually tell each other but its hard in these levels (18-20) Thx anyways","replies":[{"poster":"FatedSaviour","date":"2016-12-31T10:14:16.023+0000","up_votes":1,"down_votes":0,"body":"funny, i usually become the more aggressive support XD, the adc follows for free kills, and i kinda just end up sharing a mental link with them\nsome other times tho im playing with a mate side by side so we can communicate swiftly, quickly, and in norms, the enemy cant catch up with us a lot, we turn me landing a good sion Q into a double kill whence bieng chased, bieng prepared and planned can be more deadly than bieng better, bieng good with half that level of communication with an ally in chat, could give u the edge to completely own the laning phase, or if u dont, make it so the jungler cant gank any lane other than yours\nhopefully the enemy team will get at the bot lane for feeding (happened half the time i played with my mate)","replies":[]}]}]},{"poster":"SEKAI","date":"2016-12-30T02:44:24.501+0000","up_votes":1,"down_votes":0,"body":"Be more aggressive than they are until they say \"hey supp, you're way too aggressive\".\n\nTo which you say \"isn't that what you're doing? If you no aggressive, I no aggressive. Deal?\"\n\nSimple and effective, but might lose that game though.","replies":[{"poster":"ChillBro123","date":"2016-12-31T02:18:59.469+0000","up_votes":1,"down_votes":0,"body":"HaHa it Might work but im not risking it XD","replies":[]}]}]}