{"poster":"Adalvar","date":"2016-09-08T01:57:08.268+0000","title":"@Meddler, context on Twitch nerfs?","subforum":"Gameplay","up_votes":27,"down_votes":9,"body":"Why nerf the base damage on his E? Twitch has barely seen play in ages. I&#039;d really like some insight on this.","replies":[{"poster":"Kivolan","date":"2016-09-08T03:21:59.821+0000","up_votes":20,"down_votes":0,"body":"\"Kog'Maw is melting full tanks with on-hit effects in 2-3 seconds with no need to even bother kiting\n\nBETTER NERF TWITCH\"","replies":[{"poster":"Akali is SO HOT","date":"2016-09-08T05:08:57.253+0000","up_votes":1,"down_votes":17,"body":"Yeah but Twitch melts your whole team in 2-3 seconds with true damage.","replies":[{"poster":"It Hertz When IP","date":"2016-09-08T12:34:08.072+0000","up_votes":16,"down_votes":0,"body":"> [{quoted}](name=Akali is SO HOT,realm=NA,application-id=3ErqAdtq,discussion-id=2RmryB42,comment-id=00040002,timestamp=2016-09-08T05:08:57.253+0000)\n>\n>  with true damage.\n\n* \"Twitch's basic attacks each apply a stack of Deadly Venom, dealing 2 / 3 / 4 / 5 / 6 true damage every second over 6 seconds and stacking up to 6 times for a maximum of 72 / 108 / 144 / 180 / 216 true damage over the duration.\"\n\n* \"maximum\"\n* \"216 true damage\"\n* \"over 6 seconds\"\n\nTwitch's true damage compared to his physical damage is negligible bordering on non-existent.","replies":[{"poster":"Frius","date":"2016-09-08T23:29:12.884+0000","up_votes":3,"down_votes":0,"body":"unlike this monster creature ugly girl{{champion:67}}","replies":[{"poster":"Photos of Ghosts","date":"2016-09-09T07:52:38.132+0000","up_votes":1,"down_votes":0,"body":"hey she got a booty","replies":[]}]}]}]},{"poster":"Awhegark","date":"2016-09-08T03:56:29.678+0000","up_votes":2,"down_votes":8,"body":"Kog maw needs a team to protect him, while twitch can appear behind you and take half your health before you finish last hitting that canon minion.","replies":[{"poster":"Saianna","date":"2016-09-08T11:31:44.804+0000","up_votes":8,"down_votes":1,"body":"He nalso needs like 5 seconds untill he's fully stealthed.\n\nThen he has no means to survive, unlike most of other popular ADCs. Seriously. Killing Twitch is as easy as eating a pie.","replies":[{"poster":"It Hertz When IP","date":"2016-09-09T17:09:29.537+0000","up_votes":3,"down_votes":0,"body":"http://i.imgur.com/F28drf4.gif?noredirect","replies":[]}]},{"poster":"The Yetii Rider","date":"2016-09-08T15:21:08.712+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=Awhegark,realm=NA,application-id=3ErqAdtq,discussion-id=2RmryB42,comment-id=00040000,timestamp=2016-09-08T03:56:29.678+0000)\n>\n> Kog maw needs a team to protect him, while twitch can appear behind you and take half your health before you finish last hitting that canon minion.\n\n\"I hear you're trash. Bow before your king!\"","replies":[]}]}]},{"poster":"MunchCrunchLunch","date":"2016-09-08T02:24:46.409+0000","up_votes":12,"down_votes":10,"body":"i saw my friend twitch pentakill a whole team 1v5 yesterday with 4 items.\n\ntwitch is strong. as fuck","replies":[{"poster":"LadyRenly","date":"2016-09-08T03:02:50.091+0000","up_votes":18,"down_votes":2,"body":"> [{quoted}](name=MunchCrunchLunch,realm=NA,application-id=3ErqAdtq,discussion-id=2RmryB42,comment-id=0002,timestamp=2016-09-08T02:24:46.409+0000)\n>\n> i saw my friend twitch pentakill a whole team 1v5 yesterday with 4 items.\n> \n> twitch is strong. as fuck\n\noh no, a whole team stood still and grouped up in a straight line, who woulda guessed a hypercarry adc be able to do damage","replies":[{"poster":"Kaioko","date":"2016-09-08T03:06:24.242+0000","up_votes":2,"down_votes":11,"body":"> [{quoted}](name=LadyRenly,realm=NA,application-id=3ErqAdtq,discussion-id=2RmryB42,comment-id=00020000,timestamp=2016-09-08T03:02:50.091+0000)\n>\n> oh no, a whole team stood still and grouped up in a straight line, who woulda guessed a hypercarry adc be able to do damage\n\nExcept he can actually 1 vs 1 most adcs in the early game as well. Hypercarries are suppose to scale well at the cost of being weak early. Twitch can actually be strong at any point.","replies":[{"poster":"GoronMuncherV","date":"2016-09-08T03:20:46.692+0000","up_votes":13,"down_votes":2,"body":"Twitch cannot win _most_ adc fights early. His early game is pretty meh and he only starts to become a threat at 2+ items. Of course, if the enemy adc is stupid enough to stand still, miss all abilities/ not use them and just fight the rat in a good old Mexican stand off, auto attack style; you'll usually win as twitch, I agree.","replies":[{"poster":"All Skillzz","date":"2016-09-08T03:23:06.030+0000","up_votes":6,"down_votes":2,"body":"> [{quoted}](name=GoronMuncherV,realm=OCE,application-id=3ErqAdtq,discussion-id=2RmryB42,comment-id=0002000000000001,timestamp=2016-09-08T03:20:46.692+0000)\n>\n> Twitch cannot win _most_ adc fights early. His early game is pretty meh and he only starts to become a threat at 2+ items. Of course, if the enemy adc is stupid enough to stand still, miss all abilities/ not use them and just fight the rat in a good old Mexican stand off, auto attack style; you&#x27;ll usually win as twitch, I agree.\n\ntwitch wins most duels early but only after he can get the jump with stealth. since you get like 2-3 free AA in before they even can react to you lol.","replies":[]}]}]}]},{"poster":"doubleguac","date":"2016-09-08T20:04:04.244+0000","up_votes":4,"down_votes":0,"body":"I've definitely seen twitch carry games recently. But I'm surprised that they aren't going after Jinx before him.\n\nShe's been popping off insanely hard in all my games. Her damage is ridiculous right now. Champion GG lists her as the #2 ADC right now, right behind Kog.\n\nIMO, all the \"late game\" ADCs (i.e. ADCs with strong steroids or high AS) are a little strong right now. {{champion:96}} {{champion:222}} {{champion:29}} even {{champion:18}} ","replies":[{"poster":"sayhisam1","date":"2016-09-08T22:39:06.520+0000","up_votes":2,"down_votes":0,"body":"Jinx is strong because her waveclear and turret pushing is retarded.\n\nLeave her in lane for 3 minutes and roam mid, and she is already ahead by 30 cs and killed both your bot turrets, and does 3x your damage with runaans and the mini rockets of doom.\n\nShe just has way too much in her kit - her passive negates her only weakness in midgame (immobility), her chompers stop dives and makes her a pretty safe laner, her Zap is a strong poke, and her Q gives her BOTH a steroid AND AoE (not to mention the increased range??), which can proc MORE AoE with a runaans. Plus her ult just does so much damage, it isn't even funny. \n\nA nerf to her waveclear will delay her spike a bit, and allow opponents some breathing room, so that they aren't locked down in bot lane trying to deny jinx's power spike. Honestly, people are complaining about Twitch's AoE ult, but it isn't quite as bad as Jinx 3 shotting your whole team with crit rockets.","replies":[{"poster":"doubleguac","date":"2016-09-08T23:07:43.382+0000","up_votes":1,"down_votes":0,"body":"She was considered on the weak side really recently though. I wonder what changed.\n\nI agree with a lot of what you say. But also, Fervor is just so strong right now. Champs with massive attack speed steroids are able to utilize is so well.","replies":[{"poster":"Vistha Kai","date":"2016-09-09T15:21:02.600+0000","up_votes":2,"down_votes":0,"body":"{{item:3085}} changed.\n\nFunny shit, how before the ADC item changes, it was almost being called a troll item, despite having insane synergy with Jinx.","replies":[]}]}]}]}]},{"poster":"Meddler","date":"2016-09-08T18:06:00.183+0000","up_votes":15,"down_votes":5,"body":"Twitch isn't played much at present. He's strong enough at this point though in regular ranked that we feel we need to take a bit of power off him despite that however. E base damage change has already been replaced at this point, you should see a different iteration on PBE shortly with a focus on windowing his AS steroid uptime more.","replies":[{"poster":"blackfootedfox","date":"2016-09-08T20:15:55.720+0000","up_votes":2,"down_votes":0,"body":"Less of a balance question and just more out of curiosity, but what is Twitch's skill ramp compared to the other marksmen? I feel like he has one of the higher skill floors and ceilings, but maybe not the highest. Any reason why you think he might not be too popular? I personally think it's because it's hard to be consistently good with him, similar to Vayne. (He's my main I have to take advantage of this opportunity!)","replies":[{"poster":"Meddler","date":"2016-09-09T04:29:57.579+0000","up_votes":7,"down_votes":3,"body":"From memory his skill curve is decently high, but within a fairly normal range. Top third of marksmen or something like that type of thing. \n\nI think one of the key parts of his low play rate's thematic. He's a kinda quirky dude, which tends to resonate really strongly with some players and not do it for a lot of others. That's fine, it just means he often won't be as commonly played as a more general archetype like Vayne. He's also pretty distinctly non human, which also puts a number of players off (more creature like champs also appeal strongly to a subset of players but aren't appealing to quite a few others).","replies":[{"poster":"Awoof","date":"2016-09-09T05:54:43.438+0000","up_votes":9,"down_votes":0,"body":"Eh, I think that's bs. I would find it more believable that it's because he is super squishy and easy to kill, needs to get going, and gets to feel really powerful only for 5 seconds every now and then.\nOr in other terms, he's very risky to play, whereas Vayne has more self-peel/dueling and her silver bolts are a more guaranteed power feeling.\n\nThen again I'm generally someone that doesn't buy the \"it's the thematic\" theory.","replies":[{"poster":"Meddler","date":"2016-09-09T06:41:28.834+0000","up_votes":8,"down_votes":3,"body":"Some people don't care much about theme and will play whatever they find most effective, or most enjoyable in terms of raw gameplay. I generally fall into that camp myself. We see really strong correlations though between how cool the average player feels a champion's theme is and average desire to play them though. Some champs are perpetually popular in both normals and ranked even if they're significantly weaker than other options available. Vayne's a good example of that, having maintained a high pick rate even when she's been pretty weak in the past.  Other things that demonstrate that principle are spikes in play rate of champions when they get purely visual updates, appear in trailers, get new bios, get cool looking skins etc. Those don't impact gameplay at all and may not drive decisions at all for some people. For many players though they do seem to be pretty meaningful contributors to the decision of which champs they want to put time into.","replies":[{"poster":"Aptest","date":"2016-09-09T14:15:43.060+0000","up_votes":4,"down_votes":0,"body":"> how cool the average player feels a champion's theme is\n\nI feel you are bundling up a bunch of unrelated ideas into the word \"theme\" though. \n\nExample Vayne.\n\"gamplay theme\": get ahead, kill everybody. \"outplay\"\nsupporting elements in kit: Gap closing steroid. Multiple damage amplifiers. \"outplay\" skill. \n\n\"Visual them\": \"bat-girl\" \nSupporting elements: leotard, bat animations, visuals.\n\n\"Imagination theme\": Huntress. \n\nThese three ideas are distinct. They all go bundled under \"theme\" but are not the same.","replies":[]},{"poster":"Hige","date":"2016-09-09T17:35:54.694+0000","up_votes":2,"down_votes":0,"body":"Don't you think it's partly fault of Twitch's gameplay though? He doesn't feel much nimble and even worse, he feels a bit like a cheap shot :S I mean yeah you can get the easiest pentakill ever but... is such an easy way to obtain something even worth it?\n\nPersonally I dislike the whole stealth, true damage dot and uber lifesteal, it doesn't feel fair and I think this makes people stray away from twitch himself","replies":[]},{"poster":"Picanha96","date":"2016-09-09T14:39:42.363+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=2RmryB42,comment-id=000f0001000200000001,timestamp=2016-09-09T06:41:28.834+0000)\n>\n> Some people  will play whatever they find most effective\n\nWe agree on [that](http://champion.gg/statistics/#/?sortBy=general.playPercent&order=descend)! \nRank 1 Thresh And That is for Damage Enduring!\n\nMOST(7) Are ADCs\n\nGive me your Ears Please I am Only Trying to Help! \nThat or at least show me other data that is sliced differently explaining why GG is flawed!","replies":[]},{"poster":"BakeRoIIs","date":"2016-09-09T13:04:49.765+0000","up_votes":2,"down_votes":0,"body":"For Vayne i guess it's gameplay related reasons though. Not because she's particularly strong, but because of her minimalistic kit that makes her more reliant on good kiting/positioning than probably any other adc, while also allowing for flashy outplays if executed well (as presented by numerous montages on youtube). Misstepping on her usually gets you harshy punished, so doing well probably means you actually earned your succes by being really on point with your right clicks and dodging (assumed your opponents know what theyre doing and didnt randomly let you get super fed). It just feels like a testament of skill, and therefore very rewarding.\nFor people that like that kind of gothic-style it may be her art as well, even though her visuals look pretty outdated (then again since theyre so basic, her abilities dont need fancy animations or particles, compared to lets say jhin, so thats fine)","replies":[]},{"poster":"Dominick Destine","date":"2016-09-09T19:06:17.623+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=2RmryB42,comment-id=000f0001000200000001,timestamp=2016-09-09T06:41:28.834+0000)\n>\n> Some people don&#x27;t care much about theme and will play whatever they find most effective\n\nWe call these people \"Ranked players\"","replies":[]},{"poster":"redfeenix","date":"2016-09-09T18:09:25.952+0000","up_votes":1,"down_votes":0,"body":"I agree I think champion thematics and cohesion is the most important aspect of playing the game. \n\nI don't really care about winning, I enjoy playing and having fun. I always try to play champs that are cool rather than strong but boring.\n\nFor example kled is probably my favorite champions atm but you couldn't pay me to play a gsme of nasus","replies":[]},{"poster":"DevlinCrow","date":"2016-09-09T09:55:08.202+0000","up_votes":1,"down_votes":0,"body":"Can confirm I choose champs mostly based off of theme/aesthetics","replies":[]},{"poster":"Awoof","date":"2016-09-09T09:12:17.663+0000","up_votes":1,"down_votes":0,"body":"Okay that sounds reasonable, I was probably biased from how I decide what I play. (plus my own preference towards non-human characters :P)\n\nCertain relaunches in the past just cause me still to be slightly triggered when pointing to a champion's character in regards to popularity, I suppose.","replies":[]}]},{"poster":"EMeta","date":"2016-09-09T06:18:10.920+0000","up_votes":4,"down_votes":0,"body":"Just from my usage patterns, I think theme matters to me.  I main jungle, and love the tanky junglers who can surprise you with damage & CC.  But I've never even seriously tried the scorpion, in large part because I don't want to be the scorpion.  It's hecka fun when my Voli takes out a squishy & I can be like BEAR IS HUNGRY or when my Mao can CC someone to death & I can play off Ents going to war.  But I'm not interested in arachnids.  My loss for much of last season.","replies":[]}]},{"poster":"TheOvermind","date":"2016-09-09T06:59:48.522+0000","up_votes":5,"down_votes":0,"body":"I've asked a lot of people why don't they play twictch more . I always got the same response :\n\" he has no escapes/ gap closers\"","replies":[]},{"poster":"adidas","date":"2016-09-09T16:00:19.416+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=2RmryB42,comment-id=000f00010002,timestamp=2016-09-09T04:29:57.579+0000)\n>\n> From memory his skill curve is decently high, but within a fairly normal range. Top third of marksmen or something like that type of thing. \n> \n> I think one of the key parts of his low play rate&#x27;s thematic. He&#x27;s a kinda quirky dude, which tends to resonate really strongly with some players and not do it for a lot of others. That&#x27;s fine, it just means he often won&#x27;t be as commonly played as a more general archetype like Vayne. He&#x27;s also pretty distinctly non human, which also puts a number of players off (more creature like champs also appeal strongly to a subset of players but aren&#x27;t appealing to quite a few others).\n\nMeddler you are 100% right. I've been saying stuff like that all the time, champs that are quirky ish ( urgot, yorick, galio , twitch ) are naturally going to have a lower play rate. They just dont seem as cool to play ya know?","replies":[]}]},{"poster":"Tormentula","date":"2016-09-08T21:14:47.283+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=blackfootedfox,realm=NA,application-id=3ErqAdtq,discussion-id=2RmryB42,comment-id=000f0001,timestamp=2016-09-08T20:15:55.720+0000)\n>\n> Less of a balance question and just more out of curiosity, but what is Twitch&#x27;s skill ramp compared to the other marksmen? I feel like he has one of the higher skill floors and ceilings, but maybe not the highest. Any reason why you think he might not be too popular? I personally think it&#x27;s because it&#x27;s hard to be consistently good with him, similar to Vayne. (He&#x27;s my main I have to take advantage of this opportunity!)\n\nI don't play ADC well at all, I struggle with kiting and teamfighting as almost every adc... on the other hand for twitch,\n\nI'm a level 7 twitch that adverages about 15 kills per game I play him, jungle or adc. He's not that hard, he's just a decision making champion. I have no difficulty picking twitch, buying a youmuu's, and as soon as I get to lane, pop it and ulti for a double kill without peel. Additionally I have no issues teamfighting with him since I can just press Q, show up to clean up, pop youmuu's, ulti, and just stand there letting twitch auto attack without moving. \n\nPut me on Vayne, Jinx, etc where I actually have to weave around in teamfights and kite stuff going on me, and I can't do shit right. \n\nTo say the least, twitch is a very simple ADC skill floor wise cause as long as you know how to last hit and not 1v5 when the enemy orianna has her ulti up, he's very easy to outtrade and get kills as. \n\nDoes that make him broken? No cause laning phase is still a pain in the ass given he's imobile and dead if CC'd. Mechanically speaking there really isn't much there. Just positioning like anything and like kog'maw, if you're back line, you should be ok as you'll melt everything coming for you.","replies":[{"poster":"sayhisam1","date":"2016-09-08T22:26:49.994+0000","up_votes":4,"down_votes":1,"body":"Twitch actually has a lot more mechanics than you would think. \nFor one, using his stealth correctly in order to juke and evade ganks is an incredibly important skill that takes a while to learn. \nAlso, you need to be able to kite backwards with ult almost flawlessly, otherwise you will be hard engaged every single fight.","replies":[]}]}]},{"poster":"redfeenix","date":"2016-09-08T19:54:53.153+0000","up_votes":1,"down_votes":4,"body":"Yeh you guys have done a good job of implementing shotguns , rifles/ carbines, pistols and also miniguns. \n\nMaking each gunslinger's weapons and playstyle feel unique would be awesome. Maybe give Twitch a very short super rapidfire abilitiy as he empties his tommy gun ? \n\nWill you look at any of the below champs for possible updates and hopefuly some playtime at worlds? Or these champs arnt good for Pro play? I'd love to see more than 30 champions at worlds this year =) Maybe even 50% of champions played?\n\n{{champion:84}} {{champion:12}} {{champion:53}} {{champion:42}} {{champion:119}} {{champion:114}} {{champion:59}} {{champion:55}} {{champion:10}} {{champion:203}} {{champion:58}} {{champion:80}} {{champion:102}} {{champion:27}} {{champion:72}} {{champion:77}} {{champion:254}} {{champion:62}} {{champion:5}} {{champion:86}}","replies":[{"poster":"CSDragon","date":"2016-09-08T22:58:33.563+0000","up_votes":1,"down_votes":0,"body":"Twitch uses a crossbow.\n\nYou use Gangster Twitch too much.","replies":[{"poster":"redfeenix","date":"2016-09-08T23:18:04.874+0000","up_votes":1,"down_votes":0,"body":"Oh.... right..... \n\nUh.... Well .... maybe all his skins should get a tommy gun, we already have a crossbow wielding stealth ADC :)","replies":[{"poster":"Time42","date":"2016-09-09T01:37:41.736+0000","up_votes":2,"down_votes":0,"body":"It's so nice farming with Gangster Twitch. :P","replies":[]}]}]}]},{"poster":"the weeaboo","date":"2016-09-10T02:36:32.602+0000","up_votes":1,"down_votes":0,"body":"Hey Meddler,\n\nI was wondering why you would nerf his E and/or Q AS when those arent really his strong suits. I mean, hes going to get that attack speed one way or another. As a Twitch main I believe that an appropriate nerf would be reducing the range addition you get on Runnan bolts. Because at the current moment the reason he's so good is his ability to delete teams single handedly. Nerf the bolts, he wont be able to have that same deletion factor without going in closer (and being more vulnerable). I feel like E/Q nerfs would really just hurt his already sub-par laning phase. \n\nP.S: What timeframe are we looking at for the splash updates because Gangster Twitch looks almost as bad as Urgot lmao.","replies":[{"poster":"GoronMuncherV","date":"2016-09-10T10:00:39.214+0000","up_votes":1,"down_votes":0,"body":"All they need to do is bring back the old gangster splash art. That one was great :)","replies":[]}]}]},{"poster":"Dracocrash","date":"2016-09-08T16:26:45.068+0000","up_votes":8,"down_votes":0,"body":"Twitch is a champ with clear strengths and weaknesses. A late game hyper-carry with a weak early game. (can be clearly seen by his win-rate vs time of game graph http://champion.gg/champion/Twitch)\nRiot got offended by how well balanced twitch was and decided to nerf him.\nALso twitch is one of the adc's that counter jinx and kog'maw. And riot are dead set on BUFFING those lil shitters. So idk","replies":[]},{"poster":"EarthenDragon","date":"2016-09-08T02:08:10.810+0000","up_votes":7,"down_votes":1,"body":"A LOT of the new nerfs are bullshit.","replies":[]},{"poster":"xWaters","date":"2016-09-08T04:29:12.520+0000","up_votes":6,"down_votes":2,"body":"Twitch has one of the lowest play rates among other adcs only ahead of Varus, Corki, Kalista, and Kogmaw. Yet, Ashe has double the play rate of Twitch but has a higher win rate. And yes twitch will definitely appear in the middle of a teamfight when everyone's spells are blown then ult and kill you all. That's why the handy support and jungler should have their oracle running to find twitch, or drop a pink. I hope these nerfs don't affect him much because I don't see how he is problematic.","replies":[]},{"poster":"Hot Belly Dancer","date":"2016-09-08T06:02:44.687+0000","up_votes":3,"down_votes":0,"body":"its armor pen which is the problem","replies":[]},{"poster":"Blåbæret","date":"2016-09-09T16:02:18.588+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Adalvar,realm=EUW,application-id=3ErqAdtq,discussion-id=2RmryB42,comment-id=,timestamp=2016-09-08T01:57:08.268+0000)\n>\n> Why nerf the base damage on his E? Twitch has barely seen play in ages. I&amp;#039;d really like some insight on this.\n\nHe's been played several times at LCS. His lategame damage is far too high.","replies":[{"poster":"Adalvar","date":"2016-09-09T16:18:03.792+0000","up_votes":2,"down_votes":0,"body":"He was played 8 times on this LCS Summer split (EU and NA) and off those 8, 7 were on NA and of those, 6 were by the ADC of P1. And on Season 6 he was picked a total of 52 times across all regions. Compared to Sivir (who was played over 700 times in this season) and Lucian (over 800 times) i'd say your definition of \"several times\" is loosely applied here at best.","replies":[]}]},{"poster":"Rock MD","date":"2016-09-08T22:25:48.913+0000","up_votes":2,"down_votes":0,"body":"Twitch is incredibly strong and seeing a fair amount of play in high elo. I always see Twitch doing really well and something kinda needed to be done.\n\nI wish they hit Kog'Maw too but oh well.","replies":[]},{"poster":"Skia Asteri","date":"2016-09-08T13:27:33.087+0000","up_votes":2,"down_votes":0,"body":"The real question is why they are nerfing him without nerfing {{champion:222}} when he is one of the best picks against her.","replies":[]}]}