{"poster":"Nonalyth","date":"2016-05-03T21:46:40.326+0000","title":"The Super Galaxy skins are bad and you should feel bad.","subforum":"Miscellaneous","embed":{"description":"The PBE has been updated! Continue reading for more information! ( Warning: PBE Content is tentative and iterative - what you see may not reflect what eventually gets pushed to live servers! Manage your expectations accordingly. ) ! ! ! ! ! [Freljord Taliyah] ! Super Galaxy Fizz Super Galaxy Kindred Super Galaxy Shyvana !","url":"http://www.surrenderat20.net/2016/05/53-pbe-update-taliyah.html#more","image":"http://3.bp.blogspot.com/-M_ecJWWc5CE/Uizpk6U3lwI/AAAAAAAACLo/xyh6eQNRzzs/s640/sitethumb.jpg"},"up_votes":4,"down_votes":1,"body":"This has to be the most uninspired cash grab I&#039;ve seen in a long time. Lets go back to April 2014. Riot releases Super Galaxy Rumble, an awesome skin based on a beloved franchise for a champion who not only desperately needed it, but also made complete sense getting it. 10/10, day one buy. The skin that got me to start playing Rumble.\r\n\r\nNow here we are 2 years later, and the line is being continued with 3 vaguely space-themed skins for popular champions. There is nothing super nor galactic about these skins, or the champions they&#039;re for. They are champions in space suits. What the actual shit. Riot want to do some space skins, that&#039;s fine. Call them Star Patrol or something, I don&#039;t care. Just don&#039;t tarnish the Super Galaxy name.\r\n\r\nThey gave Fizz a robot fish, for Christ&#039;s sake. That&#039;s not cool. That&#039;s not tengen toppa.","replies":[{"poster":"Surr20plz","date":"2016-05-04T09:17:00.810+0000","up_votes":3,"down_votes":0,"body":"They're not as horrible as you make them sound. They're not just space suits. They're space anime themed skins. I mean I would've liked to see them go with specific anime like they did with Rumble (Harlock Fizz or Gangplank would've been legit), but at the end of the day they do fit the theme they've decided to go with.\n\nI mean what else did you want? Just keep doing TTGL characters?","replies":[]},{"poster":"icefire009","date":"2016-05-03T23:24:30.930+0000","up_votes":2,"down_votes":0,"body":"I am a big shyvana fun, just wanna to know when it is released?","replies":[]},{"poster":"DianasGotSwag","date":"2016-05-04T10:07:03.988+0000","up_votes":1,"down_votes":0,"body":"Whatever happened to Neon Strike? Kin's skin would better fit that. Orange jumpsuit included.","replies":[]},{"poster":"Crapslock","date":"2016-05-04T01:54:51.602+0000","up_votes":1,"down_votes":0,"body":"weeb","replies":[]}]}