{"poster":"DevilinPink","date":"2018-01-11T18:45:04.187+0000","title":"Zu wenig IP/Blue Essence seit neuem System","subforum":"Champions & Gameplay","up_votes":3,"down_votes":3,"body":"Liebe Community\r\n\r\nIch sch&auml;tze es ist schon vielen Anderen aufgefallen: Seit der &Auml;nderung des Systems erh&auml;lt man wesentlich weniger, gesch&auml;tzt weniger als die H&auml;lfte, an Blauen Essenzen als damals IP.\r\nIch finde es mittlerweile extrem anstrengend und frustrierend, mir neue Champions zu erarbeiten.\r\nRiot hat das auch schon selbst eingesehen und die 50 Blauen Essenzen f&uuml;r den &quot;first win&quot; eingef&uuml;hrt. Aber fr&uuml;her gab es daf&uuml;r 150! Und nochmal welche f&uuml;r das gespielte Spiel an sich! F&uuml;r die Spiele kriegt man garnichts mehr, nurnoch in regelm&auml;&szlig;igen Abst&auml;nden eine nahezu wertlose Kapsel.\r\nBitte best&auml;tigt das, meldet euch bei Riot etc. Der Championpool wird gr&ouml;&szlig;er und gr&ouml;&szlig;er, und dann beschneidet Riot die M&ouml;glichkeit, sich Ingame neue Champs zu verdienen in dem Ma&szlig;e? Das funktionniert nicht und daf&uuml;r bitte Feedback an Riot. Sie sind bereit, darauf einzugehen, das haben sie bewiesen.\r\nAlso nutzt das!\r\n\r\nMit freundlichen Gr&uuml;&szlig;en\r\n\r\nDevilinPink","replies":[{"poster":"Sirrkas","date":"2018-01-11T20:20:03.545+0000","up_votes":2,"down_votes":1,"body":">Riot hat das auch schon selbst eingesehen und die 50 Blauen Essenzen für den \"first win\" eingeführt. \n\nKleine Anmerkung. Dafür wurden EXP entfernt und wenn ich das richtig verstanden habe, waren die EXP mehr wert. \n\nZur Lektüre zu dem Thema IP vs BE empfehle ich diesen Thread:\n\nhttps://boards.na.leagueoflegends.com/en/c/developer-corner/hAaYMrEs","replies":[]},{"poster":"DevilinPink","date":"2018-01-12T04:14:01.333+0000","up_votes":1,"down_votes":1,"body":"Die Reaktion überrascht mich jetzt schon etwas.\nAber die Behauptung, wenn man selten spielt, würde man mehr bekommen als vorher ist absolut nicht korrekt.\nAngenommen man hat früher bis zum 1. win gespielt und dabei im Schnitt 1x verloren, dann gab es min 50 IP für die Niderlage und um die 220 für den Sieg.\nJetzt bekommt man 50 - egal was man tut.\nUnd wie viele first Wins braucht man, um 1x aufzusteigen? 5-6 sicherlich (wird laut euren Links sogar langsamer, umso höher man steigt, also ist meine Rechnung noch optimistisch). Also dafür schonmal 250-300 Blaue Essenzen nach neuem System +270 wenn man eine Kapsel bekommt und den Inhalt in Blaue Essenzen zerlegt. Angenommen man hat jede 5. Kapsel das Glück, 720 Essenzen aus der Kapsel ziehen zu können (1800:5=360 im Schnitt)\nNach altem System wären wir allein mit den 5 Siegen (nur der Bonus) schon bei 750 zuzüglich das, was man für die 10 Spiele bekommt, was nochmal locker über 500 sind (50 IP waren glaub ich das 20-Minuten-Spiel, im Schnitt liegt man deutlich drüber, vermutlich eher um die 700-750 aber ich geh mal vom Minimum aus, um die absurde Diskrepanz aufzuzeigen).\nDas wären also gerade mal 600-700 (neu) gegen locker (eher deutlich mehr) 1250 (alt). Danke für den Hinweis, aber ich fang sowas nicht an, ohne mal rumzurechnen. Und genau das hat mich ja so enttäuscht.\n\nUnd wenn man viel spielt kriegt man dagegen nicht den Erfahrungsbonus von 400 xp, das Leveln geht erheblich langsamer, man kriegt lächerlich wenige Blaue Essenzen aus den Kapseln und nach dem ersten Sieg des Tages auch NICHTS mehr durch das Spielen an sich. Also für Vielspieler ist es vermutlich noch ein deutlich größerer Verlust.\n\n\nSoweit meine Rechnung, die, wie gesagt, recht optimistisch für das neue System gerechnet ist (ich geh mathematisch gern auf Nummer sicher).\nIch hab mir die von euch angeführte Seite mal durchgelesen. Riot behauptet es wäre nicht so. Aber da wird kein bisschen gerechnet. Kein bisschen bewiesen. Keine Beispiele angeführt. So betreibt man keine Mathematik.\nRiot hat eine Behauptung aufgestellt und ihr verteidigt sie jetzt ohne Beweise zu haben. Ich starre permanent völlig entgeistert auf meinen Bildschirm und frage mich, wie ich jemals wieder einen 6300er Champ kaufen soll und ich habe euch eine Beispielrechnung vorgelegt, die meine Theorie mehr als belegt.\n\n@Sirrkas: \"Dafür würden EXP entfernt und wenn ich das richtig verstanden habe, waren die EXP mehr wert.\" - Aha? Davon weiß ich nichts. Ich sehe in EXP tendentiell keinen Wert. Was hab ich denn davon? Was bringt es mir, wenn auf meinem Profil ein hohes Level angezeigt wird? In meinen Augen garnichts.\n\n@DrunkenRedPanda: \"Also was würde gewinnen, deine Schätzungen oder ernsthafte Mathematik?\" Ich bin mir ziemlich sicher: Ich steh auf Mathematik^^\nHat dir das weitergeholfen? Und bleib doch bitte sachlicher. Ich mein das ernst und bleibe konstruktiv. Ich bitte dich, das auch zu tun. Eine kleine Spitze möchte ich mir dennoch herausnehmen: Da ich mir sicher bin, lasse ich dir etwas zum lesen da, wenn du es gelesen hast kannst du mir vielleicht eine Antwort geben.\n\n@Revilous: Ein Stück weit richtig - mit dem Rerollen kommt man vermutlich weiter, aber ich kann Reroll nicht mehr nutzen, da ich die meisten Champions schon besitze. Irgendwann wird es abgestellt. \"Also do your research next time!\" ist übrigens ein erbärmliches Diskussionsniveau. Dem Anderen erstmal an den Kopf zu knallen, er hätte nicht recherchiert oder sich Gedanken zu machen, ohne auf seinen Standpunkt eingehen zu wollen und ohne selbst zu überprüfen, ob da was dran ist, ist nicht die feine Art.\n\n@Allerbester Boss: Weiß jetzt nicht was du hier anders siehst, aber ich bin sehr unzufrieden. Mir hat es Spass gemacht weitere Champs zu kaufen und ich hatte mich eigentlich darauf gefreut, bald alle Champs zu besitzen. Aber das neue System hat mich unglaublich weit davon entfernt. Ich habs dir vorgerechnet, ich habe einige Sicherheitsrechnungen durchgeführt, um euch hier keine Fehler aufzutischen. Du siehst also, dass es stimmt.","replies":[{"poster":"Sirrkas","date":"2018-01-12T09:08:46.844+0000","up_votes":1,"down_votes":0,"body":">+270 wenn man eine Kapsel bekommt und den Inhalt in Blaue Essenzen zerlegt.\n\nDas Minimum an BE ist 810 und das Maximum 1260 BE aus einer einzigen Kapsel (angenommen man wandelt alle Shards in BE um). Dazu kommen dann noch Meilensteine, die mehr geben. \n\n>Angenommen man hat jede 5. Kapsel das Glück, 720 Essenzen aus der Kapsel ziehen zu können (1800:5=360 im Schnitt)\n\nDeine Annahme von Glück entspricht hierbei aber eher einem Ergebnis von extremen Pech, da man Opfer eines Bugs wurde. Wie schon gesagt, Minimum ist 810. Das wurde mal (kurz nach Einführung der Levelkapseln) angehoben, selbst davor waren es mindestens 720, wenn ich mich recht erinnere. \n\n>Danke für den Hinweis, aber ich fang sowas nicht an, ohne mal rumzurechnen. Und genau das hat mich ja so enttäuscht.\n\nEs ist schön, dass du vorher gerechnet hast, allerdings hättest du besser daran getan, erst zu recherchieren, wie viele BE ein Stufenaufstieg gibt. Jetzt war die ganze Berechnung Umsonst, da du die falschen Annahmen getroffen hast. \nVersteh mich nicht falsch, wenn du Riot widerlegen kannst, bin ich bereit mich auf deine Seite zu stellen. Allerdings bezweifle ich erst einmal, dass die so dumm sind und bei etwas lügen, dass sich innerhalb von einigen Monaten von Berechnungen der Spieler widerlegen ließe. Riot kann bei einer Lüge in dem Bereich nur verlieren. \n\nWas man hier für eine Berechnung bräuchte wären wohl die nötigen EP im Schnitt in jedem Meilenbereichabschnitt. Das sollten aktuell 75 Level sein. Das kann man über eine längere Zeit alleine herausfinden. Etwa, indem man über wenigstens 25 Level (am besten ein klein bisschen mehr, um die Behauptung, die unterschiedlichen Meilensteine brauchen je gleich viel zu kontrollieren) die nötigen EXP notiert. \nDann muss man herausfinden, was man bei einem gewöhnlichen Stufenaufstieg erhalten kann und was bei Meilensteinen. Danach könnte man versuchen da einen Durchschnitt zu errechnen und das auf die EXP herunterrechnen. \n\nDann kann man erkennen, wie viele BE man für X EXP erhält etc. und da BE und IP im Grunde das gleiche sind, auch erkennen, ob man mehr oder weniger als davor erhält bzw. ab wie vielen Spielen sich das ändern würde. \n\n>@Sirrkas: \"Dafür würden EXP entfernt und wenn ich das richtig verstanden habe, waren die EXP mehr wert.\" - Aha? Davon weiß ich nichts. Ich sehe in EXP tendentiell keinen Wert. Was hab ich denn davon? Was bringt es mir, wenn auf meinem Profil ein hohes Level angezeigt wird? In meinen Augen garnichts.\n\nGanz einfach. Die EXP waren in IP umgerechnet mehr Wert. Man erhält 50 BE und verliert dafür 175 EXP. Mit den EXP würde man zwar erst später BE erhalten, beim nächsten Aufstieg, aber die 175 EXP bringen einem dann umgerechnet mehr BE ein, als 50. Wodurch man jetzt effektiv etwas weniger aus dem Tagessieg erhält. Gleichzeitig wurden aber die späteren Stufen günstiger, wodurch die Spieler insgesamt wohl bei der Änderung besser wegkommen als vorher.\n\nGenaue Berechnungen zu den EXP kenne ich nicht, du kannst also gerne mal sehen, ob du da etwas ausrechnen kannst. \n\nMit den EXP aufschreiben würde ich zum Beispiel jetzt mal Anfangen. Stufe 46 (meine nächste Stufe) benötigt laut meinem Profil 3360 EXP. Wenn du also Stufe 44 erreichst und einsehen kannst, was Stufe 45 benötigt, kannst du mal bei mir nachfragen, dann hab ich wohl schon die Werte bis Stufe 50 gesammelt. Wenn wir das dann bis 75 notieren, können wir prüfen, ob das mit gleichbleibenden Kosten stimmt und du hast genug Zahlen, um deine Berechnung neu aufzulegen. \nWobei, vermutlich muss man bis Stufe 101 gehen. Ich glaube 31 bis 50 ist ein Meilenstein, aber der ist deutlich kürzer als 51 bis 75.","replies":[{"poster":"DevilinPink","date":"2018-01-12T12:09:14.849+0000","up_votes":1,"down_votes":1,"body":"Danke - das ist zwar nicht meine Meinung aber das ist mal eine Antwort, die nicht überheblich sondern konstruktiv ist.\n\nIch habe meine Werte aus meinen Erfahrungen.\nAls ich neulich recht viel gespielt habe, gab es die 50 BE für den ersten Sieg des Tages noch nicht, das war als Zoe neu rauskam und ich alle aktuellen Quests gemacht habe. Damals hatte ich noch ca 6200 BE. Dann habe ich viel gezockt, festgestellt, dass ich nahezu keine BE bekomme, keine Lust mehr gehabt und spiele seit dem Brandbuff jetzt wieder (Brandmain... seit Jahren... schuldig...).\nIch hatte jetzt schon 2x die 50 BE Belohnung für den ersten Sieg des Tages und habe das Event mitgerechnet und das, was ich mir jetzt verdient habe schon 5 Kapseln bekommen. Ich habe mir zwischenzeitlich Zoe für 6300 gekauft und bin jetzt bei ca 1700 - macht eine Differenz von ca 1800 BE. Mit 5 Kapseln. Bei denen ich alle Champion Shards zerlegt habe. Weil bisher in jeder Kapsel (ausser einer) 2 Shards waren, die ich in 90 BE zerlegen konnte + 90 BE so. In der letzten waren es 2x Kayle+90 BE, das war der Moment, der mich so frustriert hat (weil ich sie ja nichtmal Rerollen kann), dass ich diesen Post hier geschrieben habe. Bisher waren erst in einer Kapsel nicht nur 90BE-Shards, da war dafür nur ein einziger Championshard für 630 drin + 90 BE. Du wirst feststellen, dass sich die 1800 BE ca mit eben diesen 5 Kapseln recht gut decken.\n\nIch habe mittlerweile auch diese Behauptung von Riot gefunden und finde sie unverschämt. 720 BE aus einer Kapsel war bisher für mich das größte Glück, 270 der Standard. Sollten 720 extremes Pech sein, nehme ich alles zurück, aber ich kann nur sagen, wie es bei mir war. Und was ich selbst geöffnet habe. Und das war ein wertloser... nun ja... Scheiß.","replies":[{"poster":"Sirrkas","date":"2018-01-12T12:34:29.173+0000","up_votes":1,"down_votes":0,"body":"Wie wärs damit. Schreib doch bei deinen Stufenaufstiegen in Zukunft auf, welche Champshards und wie viele Bonus-BE enthalten waren. Dann sieh nach, was die Shards einbringen, wenn man sie eintauscht und dann sehen wir, ob du wirklich 270 BE für ein Level Up erhältst. \n\nWichtige Anmerkung hier. Mir fällt gerade auf, du bist Stufe 33. Was ich über die Stufenaufstiegen erzählt habe, gilt erst für Level über Stufe 30. \n\nDas hier erhält man bis Stufe 30:\n\nhttps://i.imgur.com/SLoCB0f.png[/img]","replies":[{"poster":"DevilinPink","date":"2018-01-12T15:25:12.212+0000","up_votes":1,"down_votes":0,"body":"Aber da ich laaaange vor dem neuen System lvl 30 geworden bin bringt mir das ja nichts mehr.\nWie gesagt letzte Level-Box 2x Kayle und 1x 90 BE (zusammengenommen 270).\nIch werd mal dazu übergehen es genau aufzuführen und Riot vorzulegen, notfalls mit Screenshots oder Mitschnitten, da kann dann niemand was sagen.\n\nAber ich hoffe, du verstehst unter genannten Bedingungen meine Frustration.","replies":[{"poster":"Sirrkas","date":"2018-01-12T21:08:20.602+0000","up_votes":1,"down_votes":0,"body":"Es ist verständlich, wenn dir das passiert ist, noch bin ich aber skeptisch, dass das wirklich so vorgefallen ist. \n\nVideomitschnitte sind natürlich auch eine gute Idee. Wenn sich herausstellen sollte, dass da manchmal zu wenig BE enthalten sind, sollte Riot sich auch mal ansehen, was da schief läuft. Kann ja noch mehr Spieler betreffen.","replies":[{"poster":"DevilinPink","date":"2018-01-14T20:18:13.078+0000","up_votes":1,"down_votes":0,"body":"3 der Kapseln waren ganz zu Anfang des neuen Systems.\nVielleicht waren da die Inhalte auch noch miserabler.\nIch hab jetzt jedenfalls wieder eine Kiste bekommen und die war zwar noch unter dem angeblichen Durchschnitt von 910 aber immerhin unter den angegebenen Werten.\n\nIch behalte es weiter im Auge und schneide beim Öffnen mit. Schauen wir mal, was wird.","replies":[{"poster":"DevilinPink","date":"2018-01-22T18:41:16.966+0000","up_votes":1,"down_votes":1,"body":"Update: Die letzten Kisten enthielten alle glatt 900. Das ist zwar immernoch unterm Durchschnitt, also von \"zufrieden\" oder \"viel\" kann noch keine Rede sein. Aber zumindest eine Verbesserung. Die Kisten, die ich Anfangs geöffnet hatte waren, als die Kisten neu waren, da gabs wahrscheinlich einfach noch keinen festen Inhalt.","replies":[]}]}]}]}]}]}]}]},{"poster":"WWMWWWWWWWWWWWWW","date":"2018-01-11T20:15:59.848+0000","up_votes":1,"down_votes":0,"body":"Du hast 100% recht wenn man die Champions von der Kapsel entzaubert hat man effektiv weniger Blaue Essenzen.Das finde ich sehr schade {{item:3070}}","replies":[]},{"poster":"Nordwolf87","date":"2018-01-11T19:06:16.773+0000","up_votes":1,"down_votes":0,"body":"Die suchfunktion wirkt wunder...gab sicher schon 20 threads in denen das geklärt wurde.","replies":[{"poster":"Veezey","date":"2018-01-11T19:39:59.585+0000","up_votes":1,"down_votes":0,"body":"*200","replies":[]}]},{"poster":"Alekra","date":"2018-01-11T18:59:07.701+0000","up_votes":1,"down_votes":0,"body":"Ich bin zufrieden","replies":[]},{"poster":"DrunkenRedPanda","date":"2018-01-11T20:56:06.150+0000","up_votes":1,"down_votes":1,"body":"Also was würde gewinnen, deine Schätzungen oder ernsthafte Mathematik?\nDa ich mir unsicher bin lasse ich dir etwas zum lesen da, wenn du es gelesen hast kannst du mir vielleicht eine Antwort geben\n\nhttps://boards.na.leagueoflegends.com/en/c/developer-corner/hAaYMrEs\n\nOkay, trollen beiseite. Ich zitire hier mal Riot Cactopus aus dem US Forum\n> For the vast majority of players, this system will give out more currency on average than you would've gotten in the old IP-based world. \n\nWie ist er zu dieser Aussage gelangt, wirst du dich jetzt fragen. Nun Lies dir den Text durch. Kurz um: solange du nicht wesentlich mehr als der Durchschnittsspieler (Durchschnitt = Spielzeit, nicht Wertungen/MMR/ELO etc.) spielst, bekommst du mehr.","replies":[]},{"poster":"Revilous","date":"2018-01-11T20:24:42.628+0000","up_votes":1,"down_votes":1,"body":"Man bekommt ungefähr genauso viele BE wie früher IP wenn man alle Championshards disenchanted aber wenn man sie upgraded zu einem Champion und das gleiche auch mit den Championshards aus den Truhen macht oder sich zufällige Champions kauft, kommt man deutlich besser weg als beim alten System. Also do your research next time!","replies":[]},{"poster":"Allerbester Biss","date":"2018-01-11T19:03:49.403+0000","up_votes":3,"down_votes":3,"body":"Aber keiner ist unzufrieden.\nMan bekommt mehr also vorher.\nNiemand wird deine Aussage hier bestätigen, weil sie einfach falsch ist.","replies":[]}]}