{"poster":"Eclipser7","date":"2015-03-29T20:22:42.416+0000","title":"afk regelung","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":0,"body":"Moin LoL Fans,\r\nich hab einmal die Frage ob bei Spielern die &ouml;fters afk sind die Bestrafungen wieder nachlassen wenn er/sie sein/ihr Verhalten gebessert hat?\r\nDas wenn ein Spieler mehrmals afk war,bestraft wird, dann wieder nicht mehr afk war also gebessert hat und dann wieder ein paar mal afk geht,wird die bestrafung von davor wiederaufgenommen/verschlimmert oder &quot;neu&quot; angefangen?\r\n\r\nMfG Eclipser7","replies":[{"poster":"Gangrelos","date":"2015-03-30T15:23:26.098+0000","up_votes":1,"down_votes":0,"body":"also sollen lieber vier leute bestraft werden die das spiel vernüftig spielen wollen\nes gibt genug wege das zu umgehn das es ausgenutzt wird. wie z.b. das man nur alle zehn spiele einmal leaven kann in ranked oder so.","replies":[{"poster":"SorisDynasty","date":"2015-03-30T15:46:00.824+0000","up_votes":4,"down_votes":0,"body":"Immer noch ausnutzbar. Außerdem bestrafen diese Leute sich selbst ebenso, wenn sie denn wirklich trollen. Sie verlieren schließlich auch.\nViele solcher \"Trolle\" drohen nur damit, eben um jemanden zum Dodgen zu veranlassen. Hatte ich oft genug, dass niemand dann gedodged ist und die Leute normal und anständig gespielt haben.\nDas ist das simple, alte \"chickens game\" - wer zuerst leavt, hat verloren. Der Rest, besonders der Troll, genießt dann seine nächste Champselect.","replies":[{"poster":"HyperionCH","date":"2015-03-30T16:06:12.213+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=SorisDynasty,realm=EUW,application-id=KYnfKGf0,discussion-id=cHq9AzsE,comment-id=00050000,timestamp=2015-03-30T15:46:00.824+0000)\n>\n> Immer noch ausnutzbar. Außerdem bestrafen diese Leute sich selbst ebenso, wenn sie denn wirklich trollen. Sie verlieren schließlich auch.\n> Viele solcher \"Trolle\" drohen nur damit, eben um jemanden zum Dodgen zu veranlassen. Hatte ich oft genug, dass niemand dann gedodged ist und die Leute normal und anständig gespielt haben.\n> Das ist das simple, alte \"chickens game\" - wer zuerst leavt, hat verloren. Der Rest, besonders der Troll, genießt dann seine nächste Champselect.\n\nLeider begreifen viele das \"Chicken Game\" nicht (bzw. allgemein die Spieltheorie).\n\nJedoch ist dies völlig korrekt. Wenn man gar nicht dodged, gewinnt man. Denn was passiert dann?\n\nWenn der Mate seine Drohung wahr macht und trollt:\n- Er verliert (jedes Game, wenn nie jemand dodged)\n- Er wird reportet (und somit bestraft)\n\nWenn der Mate seine Drohung nicht wahr macht und normal spielt:\n- Er gewinnt zu 50%.\n- Er wird reportet, da der ja in der CS drohte (und wird somit bestraft)\n\nWenn man jedoch dodged, hat der Troll gewonnen. Denn er kann dies ohne LP-Strafe (und ohne Report) ständig wiederholen, bis er seine Wunschlane kriegt (oder First Pick ist).\n\nDritte Variante wäre natürlich, dass der Troll dann dodged. Da entgeht er zwar den Report, aber verliert LP. Was also passiert mit solchen Spielern, wenn man die LP-Strafe weglässt? Die Trolle werden erst recht auf ihre Wunschlane pochen. Sonst dodgen sie und es könnte eine halbe Ewigkeit dauern, bis man ein Ranked spielen kann.\n\nAus meiner Sicht sollte man die LP-Strafe sogar erhöhen. Denn dann gelangt man in eine andere Spieltheorie: Gefangenen-Dilemma.\nUnd dann wird nicht mehr gedodget und der Troll bestraft. ;)","replies":[]}]},{"poster":"eingew","date":"2015-03-30T15:56:52.508+0000","up_votes":1,"down_votes":0,"body":"Inwiefern werden diese Leute bestraft? Klar in diesem einen Spiel. Aber auf Dauer kann davon keineswegs die Rede sein. Und da wir das ganze in einem Spiel nie verhindern können, außer wir schaffen es derartige Dinge vorauszusehen ist es eigentlich nicht nötig Trolle anders zu bestrafen, als es bereits getan wird.","replies":[]}]},{"poster":"Gangrelos","date":"2015-03-30T15:15:18.417+0000","up_votes":1,"down_votes":1,"body":"Das was ich momentan problematischer finde ist das es in Rankends momentan keine möglichkeit gibt  das spiel in der Championselect zu verlassen weil manche meinen ihre Lane nicht zu bekommen und dann rumtrollen. \nDas finde ich momentan viel schlimmer als eine Leaverbuster erklärung.\nGibt einfach die möglichkeit das Spiel in der Championselect zu verlassen ohnen eine Strafe zu bekommen. \nWeil was bringt es jemanden am ende zu Reporten wenn man denoch die Punkte wegen eines einzelnen Spielers  verliert die man sich hart erarbeitet.","replies":[{"poster":"SorisDynasty","date":"2015-03-30T15:21:38.492+0000","up_votes":3,"down_votes":0,"body":"Weil das sonst schamlos ausgenutzt werden würde, sobald jemanden auch nur die kleinste Kleinigkeit nicht passt. Es gab schon eine straffreie Zeit, in der man CS einfach verlassen konnte. Ausgenutzt.","replies":[]},{"poster":"eingew","date":"2015-03-30T15:58:59.219+0000","up_votes":1,"down_votes":0,"body":"Klar, in einem Spiel ist das ärgerlich. Da auf lange Sicht aber immer mehr Trolle bei den Gegnern sind gewinnt man insgesamt Punkte durch diese. \n\nDu + 4 potentielle Trolle vs 5 potentielle Trolle.\n\nEine Änderung ist also nicht nötig.","replies":[]}]},{"poster":"Eclipser7","date":"2015-03-29T21:43:59.087+0000","up_votes":1,"down_votes":1,"body":"Ich würde gerne mal die genaue Leaverbuster Erklärung + Gebrauchsanweisung haben um zu sehen,ok ich stehe jetzt bei 5 (10,20 usw..) Minuten mit geringerer Priorität,wie viele Spiele braucht es ohne Verlassen des Spiels um wieder normal spielen zu können ohne Angst haben zu müssen das ich wieder ne Strafe reingedrückt bekomme bzw wieder bei 5 Minuten anfange. Ebenso wie stark Meldungen von anderen Spielern, afk bei normalen/ranglistenspielen ausfällt und was passiert wenn ich meine stunden abarbeite und zwischendurch mal afk gehen sollte. \n\nEine Tabelle wäre gut bzw eine Anzeige wo man selbst sehen kann wie viele Meldungen man allgemein, also nicht nur fürs leaven hat sondern auch für schlechtes Benehmen feeden etc, und ab wann genau es eine Strafe gibt. \n\nAls Ausrede von wegen es wäre zu Umfangreich oder zu kompliziert lass ich nicht gelten, irgendwo müsste es ja die Zahlen geben die sagen wie viel man geleavt hat und dem entsprechend bestraft wird. Ich hoffe viele sind meiner Meinung.","replies":[{"poster":"hshtagniemehrcdu","date":"2015-03-29T21:46:35.670+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Eclipser7,realm=EUW,application-id=KYnfKGf0,discussion-id=cHq9AzsE,comment-id=0003,timestamp=2015-03-29T21:43:59.087+0000)\n>\n> Ich würde gerne mal die genaue Leaverbuster Erklärung + Gebrauchsanweisung haben um zu sehen,ok ich stehe jetzt bei 5 (10,20 usw..) Minuten mit geringerer Priorität,wie viele Spiele braucht es ohne Verlassen des Spiels um **wieder normal spielen zu können ohne Angst haben zu müssen** das ich wieder ne Strafe reingedrückt bekomme bzw wieder bei 5 Minuten anfange. Ebenso wie stark Meldungen von \n\n\nDas könnte man dann aber leicht ausnutzen, oder?\nUnd genau dass ist der Grund, warum du keine Präzise Antwort auf diese Frage finden wirst.","replies":[]},{"poster":"HyperionCH","date":"2015-03-29T21:46:21.998+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Eclipser7,realm=EUW,application-id=KYnfKGf0,discussion-id=cHq9AzsE,comment-id=0003,timestamp=2015-03-29T21:43:59.087+0000)\n>\n> Ich würde gerne mal die genaue Leaverbuster Erklärung + Gebrauchsanweisung haben um zu sehen,ok ich stehe jetzt bei 5 (10,20 usw..) Minuten mit geringerer Priorität,wie viele Spiele braucht es ohne Verlassen des Spiels um wieder normal spielen zu können ohne Angst haben zu müssen das ich wieder ne Strafe reingedrückt bekomme bzw wieder bei 5 Minuten anfange. Ebenso wie stark Meldungen von anderen Spielern, afk bei normalen/ranglistenspielen ausfällt und was passiert wenn ich meine stunden abarbeite und zwischendurch mal afk gehen sollte. \n> \n> Eine Tabelle wäre gut bzw eine Anzeige wo man selbst sehen kann wie viele Meldungen man allgemein, also nicht nur fürs leaven hat sondern auch für schlechtes Benehmen feeden etc, und ab wann genau es eine Strafe gibt. \n> \n> Als Ausrede von wegen es wäre zu Umfangreich oder zu kompliziert lass ich nicht gelten, irgendwo müsste es ja die Zahlen geben die sagen wie viel man geleavt hat und dem entsprechend bestraft wird. Ich hoffe viele sind meiner Meinung.\n\nEs gibt einen guten Grund, warum Riot dies nicht veröffentlicht:\n\nKann ausgenutzt werden.\n\nWenn die Spieler wissen, wie viele Games sie genau leaven können, dann werden sie genau bis zu dieser Grenze dies ausnutzen (gilt auch für Flames, etc.).\n\nWas jedoch mit Sicherheit gilt:\n\n- Kein Leave, keine Strafe\n\nAlso einfach nie leaven (und bei technischen Problemen diese sofort beheben), dann hat man auch keine Probleme bzw. muss keine solche Liste haben.","replies":[]}]},{"poster":"Sanctuary2056","date":"2015-03-29T21:10:59.003+0000","up_votes":2,"down_votes":0,"body":"Schwer zu sagen, weil das derzeitige Maßnahmenpaket gar nicht so alt ist.\nFrüher war es so, dass die tempbans Stufenartig aufgestiegen sind und sich nach einer (langen) Zeit ohne Probleme auch wieder verringert haben bzw. ganz weggefallen sind. Nur hat das eben ziemlich lange gedauert. Es kann daher also sehr gut sein, dass das bei dem jetzigen System ebenso funktioniert, nur habe ich bisher noch keine Bestätigung dafür gelesen/erlebt.","replies":[]},{"poster":"Tekilla809","date":"2015-03-31T09:43:52.547+0000","up_votes":1,"down_votes":0,"body":"Ich weiß zwar nicht was das mit trollen zu tun hat,\naber ja, die strafen nehmen wieder ab,\nwenn du eine Zeit lang nicht auffällig wirst,\nkönnen aber auch zunehmen wenn\ndu mehrmals hinternander ein Vergehen machst.","replies":[]},{"poster":"Eclipser7","date":"2015-03-29T20:54:43.891+0000","up_votes":1,"down_votes":0,"body":"bei mir war es jetzt aber so,dass ich lange zeit nicht mehr afk war und die strafe jetzt größer wurde,ich darf nicht mehr 10, sondern 20 minuten auf ein spiel warten","replies":[]},{"poster":"eingew","date":"2015-03-29T20:39:28.271+0000","up_votes":1,"down_votes":0,"body":"Riots Systeme basieren eigentlich immer auf Besserung. Also ja, wenn du eine Strafe vom Leaverbuster bekommen hast und dann lange genug nicht mehr AFK gegangen bist (hierbei zählen im übrigen gespielte Spiele), dann wirst du irgendwann wieder auf der Stufe eines neutralen Spielers sein.","replies":[]}]}