{"poster":"RVN Trobugno","date":"2019-04-29T08:10:34.583+0000","title":"Team Clover: Aperta Candidatura","subforum":"Reclutamento","up_votes":1,"down_votes":3,"body":"Salve a tutti, sono Trobugno, il manager del Team Clover e sono alla ricerca di nuovi membri che ricoprano il ruolo di **TOP** e **Jungler**.\r\n\r\nAttualmente la squadra è composta ufficialmente da 5 persone di cui: 1 JNG, 1 MID, 2 ADC ed 1 SUP.\r\nL'età dei componenti della squadra varia dai 18 anni ai 24 anni, quindi con presenza sia di studenti che lavoratori/studenti.\r\n\r\n**MODULO CANDIDATURA**: [link](\r\nhttps://forms.gle/TzjDcywVMmbiGkKSA)\r\n\r\n**ORGANIZZAZIONE ALLENAMENTI**\r\n\r\nGli allenamenti che attualmente svolgiamo sono organizzati da me tramite Google Sheet (con presenza di presenze settimanali, eventi mensili, ecc.) e sul nostro gruppo di Whatsapp (che chiediamo sempre di non mutare per necessità) con orari serali preferibilmente dopo le 21:30.\r\nPreferibilmente cerchiamo di stare sui 2/3 allenamenti settimanali salvo imprevisti o tornei. In quest'ultimo caso, se necessario, potrebbero essere richiesti più allenamenti.\r\n\r\n**SERVIZI**\r\n\r\n* Oltre agli allenamenti richiesti settimanalmente sono predisposte delle lezioni di team in cui si affrontano alcuni argomenti teorici necessari al team in se.\r\n* Se richiesto è possibile affrontare la stessa sessione individualmente, qualora ci fossero dubbi in merito.\r\n* Qualora aveste dubbi, perplessità, richieste di build, guide, basterà chiedere e vi saranno fornite.\r\n\r\n**PROVINO**\r\n\r\nIl provino sarà svolto nell'arco di una settimana per vedere non solo le meccaniche del giocatore ma anche il suo comportamento e la sua educazione. \r\nUna volta superata la settimana, verrà comunicato l'esito.\r\n\r\n**ATTEGGIAMENTO RICHIESTO**\r\n\r\n1. Serietà negli allenamenti e nella disposizione delle proprie disponibilità.\r\n2. Rispetto degli orari e della persona.\r\n3. Propensione all'ascolto ed al miglioramento.\r\n4. Completa concentrazione quando ci si allena. Mi spiego meglio, qualora ci stessimo allenando non è accettato nessun tipo di commento quale: \"Ragazzi per favore cerchiamo di muoverci che mi devo alzare presto/devo andare a fare una partita di calcetto\". Nel preciso momento in cui vi state allenando dovete essere consci del fatto che se iniziassimo alle 21:30, almeno 2/3 partite massimo si dovrebbero fare, inclusa una possibile discussione per riflettere su alcuni punti critici post-partita.\r\n\r\n**REQUISITI**\r\n\r\n1. Essere almeno Gold in Flex.\r\n2. Essere almeno Platino in Solo/Duo.\r\n3. Avere Discord.","replies":[{"poster":"OG Giacomonzi","date":"2019-04-30T18:06:23.864+0000","up_votes":2,"down_votes":0,"body":"Non mi convinci, truffatore.{{sticker:sg-shisa}}","replies":[]}]}