{"poster":"RVN Trobugno","date":"2016-12-13T14:08:11.112+0000","title":"A chi serve un jungler?","subforum":"Discussioni generali","up_votes":1,"down_votes":3,"body":"Buon giorno a tutti, ho visto la scorsa settimana che molti stavano organizzando team ed erano alla ricerca di jungler (per i quali mi scuso se ho dato il nominativo ma non ho risposto, tuttavia ero in fase pre-esame e non avevo modo di entrare in game). Proprio per questo ho aperto questo posto per chi fosse alla ricerca di un jungler in squadra, flex ecc. \r\n* Disponibilit&agrave; in settimana: dalle 18 fino alle 00:00 (purtroppo lavoro XD), solo il venerd&igrave; anche fino alle 3:00/4:00.\r\n* Disponibilit&agrave; Sabato/Domenica: dalla mattina alla sera.\r\n* Importante: Comunicazione tramite TS ed organizzazione tramite gruppo di Whatsapp/Telegram.\r\n* Elo: Ho terminato la mia prima season in Silver 5, invece nella preseason Silver 3 (Flex)\r\n* Main: Mi sembra scontato XD, Main jungler, secondo ruolo Top.\r\n* Champ usati in giungla: Vi (main), Zac, Kha&#039;zix, Elise, Gragas, Jarvan IV, Shyvana, Ekko, Ivern, Lee Sin (anche se poco), Olaf, Trundle, Udyr, Sejuani, Rek&#039;Sai. Ovviamente non so giocare tutti alla perfezione ma c&#039;&egrave; sempre modo di migliorare, infatti non mi ritengo un pro sia ben chiaro ma credo vivamente di poter migliorare ancora ed ancora =)\r\n\r\nP.S. Non so se &egrave; la sezione giusta, in caso chiedo lo spostamento gentilmente del topic se possibile :)","replies":[{"poster":"SignorCarota","date":"2016-12-13T21:34:17.266+0000","up_votes":1,"down_votes":0,"body":"allora se vuoi io sto cercando di organizzare un team per rankare ma con obiettivo principale quello di divertirsi e ovviamente vincere . Non voglio gente che flamma semplicemente . Poi le partite le registro e ci faccio dei montaggi da caricare sul canale :D beh se sei interessato aggiungimi su lol e mandami un messaggio cosi che io possa darti il mio numero e aggiungerti ad un gruppo su whatsapp :) se invece non sei interessato in bocca al lupo ;)","replies":[{"poster":"RVN Trobugno","date":"2016-12-14T10:46:16.243+0000","up_votes":1,"down_votes":0,"body":"Ti ho inviato la richiesta :).  Comunque tranquillo anche io ho un canale YouTube (che devo risistemare) ed uno su Twitch.","replies":[]}]}]}