{"poster":"EImr","date":"2020-01-05T21:33:11.974+0000","title":"injusto sistema de abandono...","subforum":"Problemas Técnicos","up_votes":1,"down_votes":1,"body":"Buenos dias, hoy estaba jugando una partida de el lol cuando aproximadamente al minuto 5 tuve un fallo de electricidad en mi casa, por lo cual tuve que volver a la partida aproximadamente al minuto 15, claramente pedi disculpas por mi ausencia y explique lo sucedido a mis compañeros los cuales no hicieron problema, despues de jugar la partida HASTA EL MINUTO 40! pudimos remontar la partida  y ganarla, para mi sorpresa cuando volvi al cliente SE ME DESCONTO 20 DE PL despues de haber perdido 30 minutos de mi vida por esta partida y sin contar los otros 30 que me costo obtener esos 18 perdidos ¿hay alguna forma que me devuelvan este lp perdido y los que me tuvieron que dar?","replies":[{"poster":"xaxesis","date":"2020-01-06T01:53:32.007+0000","up_votes":1,"down_votes":0,"body":"A todos sanciona igual son las reglas","replies":[]},{"poster":"BeamOeste","date":"2020-01-05T23:23:06.040+0000","up_votes":1,"down_votes":0,"body":"Creo que el sistema ya detecto que estuviste afk durante muchos minutos y con eso basta en quitarte los puntos","replies":[]},{"poster":"vivakayn","date":"2020-01-05T23:21:38.942+0000","up_votes":1,"down_votes":0,"body":"piensalo de otra forma, imaginate que el game estaba ganado pero en tus 10 minutos de ausencia los rivales toman la ventaja y por tu culpa se fue la victoria, ahi claramente es tu culpa y mereces perder pl\n\nahora en este caso aunque ganaste, te fuiste 10 minutos enteros, que eso es bastante, en ese entonces te sacarian como 7 niveles y 80 de farm, seguramente fuiste una carga para tu equipo en tu vuelta, aunque puedas equilibrar a la larga, no cave duda que pusiste en desventaja a todo tu equipo. osea un jugador sin un desempeño prometedor.... osea no esperes que te den pl cuando fuiste la desventaja del equipo","replies":[]},{"poster":"N 0","date":"2020-01-05T21:45:02.031+0000","up_votes":1,"down_votes":0,"body":"No creo que se pueda (Manda un ticket), creo que no va a servir de nada.\nAmi me paso varias veces con fallos del juego errores etc, nunca he pedido nada porque creo que eso no se puede pedir porque ya es así el sistema del juego\n{{sticker:slayer-jinx-unamused}}","replies":[]}]}