{"poster":"Mython","date":"2017-11-18T17:03:35.967+0000","title":"RP und ihre Wertigkeit","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Habt ihr auch immer das Gef&uuml;hl dass ihr es kaum erwarten k&ouml;nnt eure Skins im Inventar zu craften und endlich Im Spiel zu schau zu stellen? Dann ist das jetzt kaum mehr M&ouml;glich bzw.  mit sehr viel Aufwand verbunden.\r\nVor der &Auml;nderung zur S8 waren alle Essenzen noch um einiges mehr Wert. Nun wurden neben den Championshards ( dies &Auml;nderung ist total geil) auch die Skinshard drastisch an ihrem wert ver&auml;ndert. Sicherlich ich m&ouml;chte in keinster Weise das F2P Format und erspielen der Kisten und Keys hiermit zur&uuml;ckdr&auml;ngen den das w&auml;re ein fehler allerdings m&ouml;chte ich Riot hiermit darauf hinweisen, dass Sie , wenn sie ihr Preisgestaltung in Hinblick auf die Kisten und den daraus enthaltenen Orangenen Essenzen nicht ver&auml;ndern, m&ouml;glicherweise einen gro&szlig;en Unmut der User auf sich ziehen die sich gerne vor der &Auml;nderung  Kisten geg&ouml;nnt haben.\r\nKommen wir also zu den Fakten:\r\nIn S7 konnte man aus den Kisten mit unterschidlicher Seltenheit und Wertigkeit Skins ziehen. Dies hatten zwichen , wenn mich aus meiner Erinnerung nicht alles T&auml;uscht Einen Essenzwert von 175 -450, was eindeutig Ok war. Zum jetzigen Zeitpunk bekommt man nur noch eine wertigkeit von 104-365  aus dem Entzaubern. Der Schwachpunkt allerdings ist das der Wert der Skins sich nicht mit dem Update ver&auml;ndert hat, sie kosten immernoch um eine Skin des Mittleren Segments zu w&auml;hlen um die 675 Essenzen.\r\n\r\nDas bedeuted f&uuml;r uns , falls wir vorhaben einen H&ouml;herwertigen skin  zu bekommen mindestens 5 Skins der nidrigsten Preisklasse entzaubern. im alten system war  etwa die H&auml;lfte von N&ouml;ten. Neben den 675 Wertigen gibt es auch noch die Ultimativen mit einem Wert von 2960 oder so an Wertigkeit. Ich lass euch mal Ausrechnen wie viele Shards ihr daf&uuml;r Entzaubern m&uuml;sst im jetzigen System. \r\n\r\nNun aber zu den Rp. Eine 10+1 Set an Truhen kostet imm. 1950 Rp was einen Zufall an Skins und Champions beinhaltet.\r\nBedenkt man nun dass in S7  man mehr ( wir gehen davon aus das zu beiden Zeitpunkten gleich viele Champs und Skins in der selben Wertigkeit in der Kiste waren) Essenzen aus einer Entzauberung bekam als jetz in S8 ( Vorsaison) aber den selben Preis bezahlen muss ist das dem User gegen&uuml;ber doch eigentlich sehr ungerecht. \r\n\r\nWarum ich das ganze schreibe ist, da ich zum testen mir paar Chest geg&ouml;nnt habe ( ok waren einige da ich B- Day hatte {{sticker:sg-lulu}} ) und daraus den Ulti Skin f&uuml;r Esra bekommen habe . zu beginn vo S7 hatte ich Udys Skin in einer chest und brauchte nur ein paar 450 skins die ich nicht so mocht Entzaubern ( und ein paar billigere) und hatte ihn Easy. jetz muste ich allerdings knapp 28 104 - 150 Wertigen  (hatte aber auch pech nur solche zu bekommen) und meine gesparten fr&uuml;her 450 wertigen jetz aber nur nich 360er entzaubern um ihn zu bekommen. \r\nNach l&auml;ngerem &Uuml;berlegen habe ich festgestellt dass es kaum mehr einen Nutzen macht sich Chest zu kaufen ausser man ist am Anfang Seiner LolKarriere, da man somit viele Champs bekommt .\r\n\r\nDeshalb m&ouml;chte ich gerne Wissen ob Ihr das selbe Empfindet und euch auch gerne eine &Auml;nderung W&uuml;nscht wie z.b Reduzierung der PR oder mehr Essenzen oder ob ihr das so akzeptiert und es euch egal ist da ihr eh nur die F2P Chest benutzt?\r\n\r\nIch f&uuml;r meinen Tel bin sehr {{sticker:sg-zephyr}} und hoffe es wird eine &Auml;nderung durchgef&uuml;hrt. ICh freue mich auf Eure Kommentare!!!","replies":[{"poster":"Mython","date":"2017-11-19T23:23:25.850+0000","up_votes":1,"down_votes":0,"body":"Ich versteh auch eure Gegenargumente , mit man muss ja nicht kaufen aber das hauptproblem ist dass man nun im vergleich zu s7 ein echtgeldvelust hinehmen muss . \nRiot sollte auch auffallen dass ein beitrag wie dieser sich zurzeit häuft und oft auch geschrieben wird das es keine info gab zu dem werteverfall der orangenen essenzen. ich wollte in meinem beitrag dieses thema nicht ansprechen, da ich mich nicht genau erinnern kann ob die Info wirklich gestreut wurde oder nicht. Was ich weiß ist das in der Info (Client und Status ), lediglich von einer Verlust der Shards ausging mit keiner genaueren beschreibung zu anfang, bis zu dem Hauptartikel den ich erst bei seson anfang las, stellte ich fest dass ein minimaler absatz daruf hinweist, das die orangenen ebenfals mit den Blauen reduziert werden.","replies":[]},{"poster":"Nohgolgh","date":"2017-11-19T06:07:44.158+0000","up_votes":1,"down_votes":0,"body":"Naja,\nich halte die Kisten sowieso für Abzocke. Du bezahlst RP für Skins, die du sonst nicht haben willst und nicht kaufen würdest. Das ist das Prinzip der Kisten. Nun wirst du halt mehr abgezockt. \n\nIch sehe das primär als nicht ungerecht,  sondern als Preispolitik, die als solche auch angekündigt war. Und die Personen, die nach dem Wertverfall der Kisten diese kaufen, haben auch keinen Schaden im eigentlichen Sinne, da sie ja nicht kaufen müssen.","replies":[]},{"poster":"xBlackthundeRx","date":"2017-11-19T05:50:12.573+0000","up_votes":1,"down_votes":0,"body":"Naja rein was Shards angeht, kann ich mich garnich beklagen (S7), waren garnicht soviele Champion Shards, im gegenteil sogar sehr viele Coole Skin Shards, hab ka grob 30, die ich einfach nicht entzaubern will :D (ok hätte ich gewusst das sie weniger wert sind nun hätte ich mich von ein paar getrennt, aber es wurde ja nur über Champion Shards berichtet....)\n\nAber ja allein das es nun weniger Ezzenzen gibt, und das trotz Champion Shards durch Level UP, immernoch Champion Shards rauskommen können, kaufe ich mir keine Standard Boxen mehr. Auch wenn ein minimaler ausgleich hinzugekommen ist, hab eine Kiste durch ein S bekommen, und es war eine Kiste+schlüssel drin. + Essenzen + Shard.\nWenn ich nochmal investieren will, dann nur bei Event Boxen wo Skin Shards garantiert werden.\nSie sollten die Champion Shards einfach aus den Kisten entfernen.","replies":[]},{"poster":"0mnipotence","date":"2017-11-19T04:17:42.850+0000","up_votes":1,"down_votes":0,"body":"ja bin deiner Meinung neue system ist komisch man muss mehr machen und vor allem bekommt man nichts mehr umsonnst auser immer nur geld geld geld für skins und ect....\n{{champion:25}} {{sticker:sg-lulu}}","replies":[]},{"poster":"Herr Hübsch","date":"2017-11-18T19:06:39.603+0000","up_votes":1,"down_votes":0,"body":"es hatte nochnie sinn gemacht kisten zu kaufen, wtf? die chance auf champshards war und ist einfach zu hoch","replies":[]},{"poster":"Shinigami1332","date":"2017-11-18T17:55:32.995+0000","up_votes":1,"down_votes":0,"body":"Habe mir früher immer mal wieder für paar 10-15 euro mal kisten gekauft da ich keinen wirklichen main habe und Lol nur zum fun zocke daher auch alle möglichen champs mal^^. Daher fand ich es lustig mir einfach kisten zu kaufe und mich überraschen zu lassen welchen skin bzw champ ich als nächstes zocken werde. Aber da leider die essenz kosten die man per entzaubern bekommt so rutner gegangen ist lohnt es sich leider net mehr wirklich meiner meinung nach kisten für Skins zu kaufe da man nun einfach viel zu viele skins entzaubern muss um sich 1 skin zu kaufen. Da ist es billiger einfach die skins so zu kaufe.","replies":[]}]}