{"poster":"TheBasedGod","date":"2016-05-05T04:26:27.150+0000","title":"What does 'tilted' mean?","subforum":"Miscellaneous","up_votes":2,"down_votes":1,"body":"Saw in game but not too sure i understood what the player meant.\r\n&quot;You tilt me&quot;\r\n&quot;Omg im tilted rn&quot;","replies":[{"poster":"fum422","date":"2016-05-05T04:29:07.521+0000","up_votes":4,"down_votes":0,"body":"tilt means when you are at the carnival and you kick the coin pusher machine so the coins drop and the police comes and takes you to jail and the big guy thats your cell mate says \"Im gonna tilt your asss real bad tonight\"","replies":[]},{"poster":"Maraudaur","date":"2016-05-05T04:50:02.034+0000","up_votes":3,"down_votes":0,"body":"I always use it to mean this;\n\n\"Tilt is a poker term for a state of mental or emotional confusion or frustration in which a player adopts a less than optimal strategy, usually resulting in the player becoming over-aggressive. This term is closely associated with steam and some consider the terms equivalent, but 'steam' typically carries more anger and intensity.[1]\n\nPlacing an opponent on tilt or dealing with being on tilt oneself is an important aspect of poker. It is a relatively frequent occurrence due to frustration, animosity against other players, or simply bad luck. Experienced players recommend learning to recognize that one is experiencing tilt and avoid allowing it to influence one’s play.\"\n\nhttps://en.wikipedia.org/wiki/Tilt_(poker)","replies":[{"poster":"Yasei Doubutsu","date":"2016-05-05T04:55:23.755+0000","up_votes":3,"down_votes":0,"body":"You should have linked this aswell.\n\nhttps://www.youtube.com/watch?v=XxE8wTbYJs8\n\nhttps://www.youtube.com/watch?v=Vny-dT8dxQI","replies":[{"poster":"Maraudaur","date":"2016-05-05T06:08:56.535+0000","up_votes":1,"down_votes":0,"body":"haha normally I would but they didnt ask to prevent tilt. They just wanted to know the meaning.","replies":[{"poster":"Yasei Doubutsu","date":"2016-05-05T06:36:35.046+0000","up_votes":1,"down_votes":0,"body":"Yeah, but I just thought it also would have been nice to help him out with these too, incase he ever does go on \"Tilt\"\n\nI'm starting to think we should all of some of these youtubes vids on standby, for some cases.","replies":[]}]}]}]},{"poster":"Main Line","date":"2016-05-05T15:04:16.272+0000","up_votes":1,"down_votes":0,"body":"Tilt is a term used by noobs for not focusing, basically. It's kind of a watered down excuse that they can throw out to make themselves feel good, instead of just getting back to focusing on the game after making a mistake.","replies":[]}]}