{"poster":"sN00Bdogg","date":"2016-05-24T17:08:48.797+0000","title":"Ranked Q - Wartezeiten zu lange ?  ...  Abstimmung!","subforum":"Karten & Spielmodi","up_votes":1,"down_votes":1,"body":"Ja servus!\r\n\r\nDie Wartezeiten in der Ranked Warteschlange sind meines Erachtens in den letzten 2 Wochen nochmal extrem angestiegen. Selbst bei mir im Low-ELO-Bereich warte ich nicht selten 15 Minuten auf ein Match. Kommt es dann endlich, beginnt sofort das Daumen dr&uuml;cken, da&szlig; niemand leaved, da man danach nicht selten nochmals so lange wartet. Die Q zu verlassen und neu zu starten bringt nach meiner Erfahrung auch nichts.\r\n\r\nIch finde es ja sch&ouml;n, da&szlig; ich im Ranked mit Spielern aus meiner ELO ins Match geschickt werde, allerdings bef&uuml;rchte ich, da&szlig; der Matchmaking-Algorhytmus hier zu eng gefasst ist. Ich pers&ouml;nlich nehme es gerne in Kauf gegen eine Division h&ouml;her gematched zu werden, wenn dadurch die Wartezeit verk&uuml;rzt werden kann. Wie seht ihr das?","replies":[{"poster":"MeMyselfandBaal","date":"2016-05-24T17:52:15.478+0000","up_votes":2,"down_votes":1,"body":"Da man selber mit seiner Rollenwahl großen Einfluss auf die Länge der Wartezeit hat... ist die Que definitiv nicht zu lang...\n\nUnd ja, dass das so kommen würde, war abzusehen... also dass die Sup Mains dieser Welt wartezeiten von 5 Sekunden Maximal haben würden, die Mid-Top Mains dagegen Minutenlang warten müssen. Das haben wir euch auch gleich gesagt. Ihr wolltet trotzdem, dass das Chaos des \"Wer als erster schreit, hat im Normalfall recht\" System abgeschafft wurde. Die langen Wartezeiten sind halt der Kompromiss, den man an der Stelle eingehen muss...","replies":[{"poster":"AidsOfSpades","date":"2016-05-24T17:58:55.046+0000","up_votes":1,"down_votes":0,"body":"Es gab kein wer als erster schreit. Höchstens in Bronze und Silber alles darüber war Pickorder.","replies":[{"poster":"MeMyselfandBaal","date":"2016-05-24T19:44:12.830+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=MogschAFotzn123,realm=EUW,application-id=cGRapXds,discussion-id=8A0JOEBM,comment-id=00020000,timestamp=2016-05-24T17:58:55.046+0000)\n>\n> Es gab kein wer als erster schreit. Höchstens in Bronze und Silber alles darüber war Pickorder.\n\nPickorder war doch auch nur relevant, wenn man selber 1st Pick war... an sonsten hat man sich immer darauf berufen, dass man als erster Mid gebrüllt hat... Und ja, ich kann das aus neutraler Sicht beurteilen, da ich immer Sup gebrüllt habe und mir den Streit dann in Ruhe angucken durfte...","replies":[{"poster":"Shiro equals","date":"2016-05-25T05:28:00.315+0000","up_votes":2,"down_votes":0,"body":"Also das lief bei mir zu 99% anders ab xD\nJeder hat einfach seine Wunschrolle gecallt und dann ging es nach Pickorder und Kommunikation innerhalb des Teams.\nWar für mich als Main Support immer ganz easy, aber wirkliche Probleme gabs nie.","replies":[{"poster":"Sirrkas","date":"2016-05-25T06:58:45.225+0000","up_votes":1,"down_votes":0,"body":"Ich glaube mit einem Mainsupport war die Champselect zwischen Bronze und Gold schon erledigt. Als Mainsupport habe ich es da schon einige male gesehen, dass jemand verwundert darüber ist, dass er als Lastpick nicht Support spielen muss.","replies":[]}]},{"poster":"3Xtermin4ns","date":"2016-05-26T18:13:37.911+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=MeMyselfandBaal,realm=EUW,application-id=cGRapXds,discussion-id=8A0JOEBM,comment-id=000200000000,timestamp=2016-05-24T19:44:12.830+0000)\n>\n> Pickorder war doch auch nur relevant, wenn man selber 1st Pick war... an sonsten hat man sich immer darauf berufen, dass man als erster Mid gebrüllt hat... Und ja, ich kann das aus neutraler Sicht beurteilen, da ich immer Sup gebrüllt habe und mir den Streit dann in Ruhe angucken durfte...\n\nIrgendwas hast du falsch gemacht. Es wird zwar gesagt, wer was spielen möchte, aber ich habe als höher Pick teilweise auf die Pickorder bestanden und dann regelmäßig die gewünschte Lane bekommen.\nAusnahmen gibt es immer wieder. Für die würde eine Hand reichen.","replies":[]}]}]}]},{"poster":"sN00Bdogg","date":"2016-05-28T12:00:43.185+0000","up_votes":1,"down_votes":0,"body":"Nur mal so:\nEs ist Samstag nachmittag und ich bin seit >15 Minuten in der Q für meine Wunschlanes Jungle / ADC\n\nUnd ich habe momentan keine Beschränkung bezüglich \"Warteschlange mit niedriger Priorität\"\n\nVielleicht klappts ja heute noch mit meinem ersten Spiel ....","replies":[]},{"poster":"sN00Bdogg","date":"2016-05-25T00:42:29.020+0000","up_votes":1,"down_votes":0,"body":"1) Danke für die Beiträge. \n\n2) Ich halte auch 3-5 Minuten für zu lange und ich will auch nicht Support nehmen müssen, nur damit das Ganze kürzer ausfällt.\n\n3) Mit Mid /jungle warte ich in der ELO von ca. B4 meistens 8-15 Minuten und das auch heute zwischen 17 - 20 Uhr!","replies":[]},{"poster":"OT Riku","date":"2016-05-24T22:27:04.784+0000","up_votes":1,"down_votes":0,"body":"Ich gebe in der Q immer Mid/Jgl an und warte meist keine 5 Minuten. \nIch spiele zu 95% Solo.","replies":[]},{"poster":"Frankydude","date":"2016-05-24T17:59:54.329+0000","up_votes":1,"down_votes":0,"body":"hol dir nen main supp der mit dir dyn Q macht und Q zeit gleich 0\nmein vorteil is ich bin main supp und hab selbst auf plat1-dia 5 ne max Q zeit von 2minuten\num 3 uhr nachts muhahahahahahahahahahaha\n{{sticker:slayer-jinx-wink}}","replies":[{"poster":"Sirrkas","date":"2016-05-24T18:02:08.322+0000","up_votes":1,"down_votes":0,"body":"Mainsupport for \"can play whenever they want\"-Highfive!\n{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Frankydude","date":"2016-05-24T18:04:06.200+0000","up_votes":1,"down_votes":0,"body":"made my day :D\n{{sticker:zombie-nunu-hearts}}","replies":[]}]}]},{"poster":"play a faya","date":"2016-05-24T18:02:27.496+0000","up_votes":1,"down_votes":0,"body":"Gold IV derzeit und meine Wartezeiten im Ranked sind mit Support <30 Sekunden, Top und Jungle <3 Minuten.\nBei Normales sieht es anders aus, da hab ich auch mal mit Support 5 Minuten und mehr Wartezeit. Kann mir das auch nicht erklären ...","replies":[]},{"poster":"gyyyr","date":"2016-05-24T18:00:39.230+0000","up_votes":1,"down_votes":0,"body":"du beschwerst dich über zu lange wartezeiten andere darüber dass man nur mit 4-mann premades zusammenkommt. Einer muss benachteiligt werden, jedoch werden beide auch nach einer Veränderung weiter Kritisiert.","replies":[]},{"poster":"AidsOfSpades","date":"2016-05-24T17:35:50.463+0000","up_votes":1,"down_votes":0,"body":"Also ich spiel in Gold 3 und hab selten mehr als 3-5 Minuten Queue-Zeit. Und ich spiel Jungle-Mid.","replies":[]},{"poster":"Sirrkas","date":"2016-05-24T17:25:01.979+0000","up_votes":1,"down_votes":0,"body":"Welche Positionen spielst du denn?","replies":[]}]}