{"poster":"sN00Bdogg","date":"2019-12-15T02:38:21.799+0000","title":"Rito zerstört LOL mit pay-to-win-Champions","subforum":"Champions & Gameplay","up_votes":6,"down_votes":52,"body":"Ja servus!\r\nDie neuen Champions  sind allesamt so OP, daß das bannen zum Witz wird. \r\nMomentan heisst es \"ban aphelios or lose\". Senna  ist trotz des minimal-Nerfs genauso hardcore und bald kommt Sett. Bei allem was man im PBE gesehn hat, ist der ebenso OP und hat nicht mal Skillshots. Na dann schonmal Omi anpumpen, damit man gleich bei Release genug RP hat, um sich die nächsten Siege zu kaufen!\r\nWarum schafft man andere Champs nicht einfach ganz ab?  \r\nLux´ Ulti  soll global sein ? Was ist dann die Senna range ?\r\nMF oder Sivir ... gegen Aphe ? LOL! Bis die ihre Ulti haben sind sie 10 mal gestorben oder haben dank dem dauernden Spiessrutenlaufen keinen Farm. Dann noch Pyke als supp dazu ... GG! Gegen die Passive von Pyke ist ne Mundo Ulti  doch ein Witz! Und obendrauf dann noch invis anschleichen und mit der Ulti mehr Schaden machen als ein gefeedeter Darius ?\r\n\r\nWarum nur müssen all die neuen Champs so dermassen überladen daher kommen ? Unsichtbarkeit, Stuns mit \"global\" range, stacken bis zum geht nimmer, Selfheal ,Silence und dazu noch irgendnen Schild, der alle paar Sekunden jegliche Abilities wegblockt!\r\n\r\nGibts denn wirklich keine anderen Geldquellen als dieses unser Lieblingsspiel mit solchen Pay-to-wim-Champs kaputt zu machen ?","replies":[{"poster":"DarthThoren","date":"2019-12-15T08:41:48.967+0000","up_votes":15,"down_votes":1,"body":"Da hat wohl jemand nicht verstanden was genau Pay to win ist.\nAußerdem kann man all diese Champions Countern.\n\nSetz dich bitte erstmal vernünftig mit dem Spiel auseinandern, bevor du soetwas schreibst.\nWeil das hier ist unnötig Unruhe machen.","replies":[]},{"poster":"EpicDieterBohlen","date":"2019-12-15T02:58:10.637+0000","up_votes":11,"down_votes":0,"body":"Ehrlich so!\nDeswegen haben auch Warwick und garen die höchsten winrates für Top/Jungle!!! Immer die teuren champs die op sind!1!!\nAphelios ist 0 mobil und ist dadurch relativ einfach zu töten","replies":[{"poster":"Ganze31cm","date":"2019-12-15T03:09:52.798+0000","up_votes":5,"down_votes":1,"body":"> [{quoted}](name=EpicDieterBohlen,realm=EUW,application-id=Wj1wcocU,discussion-id=uvbyZRdm,comment-id=0002,timestamp=2019-12-15T02:58:10.637+0000)\n>\n> Ehrlich so!\n> Deswegen haben auch Warwick und garen die höchsten winrates für Top/Jungle!!! Immer die teuren champs die op sind!1!!\n> Aphelios ist 0 mobil und ist dadurch relativ einfach zu töten\n\nUnd dazu ist er schwer zu spielen und ist ein adc und deswegen auch sehr gut zu töten wenn man z.B. Champs wie Tee spielt","replies":[]}]},{"poster":"Amycos Cyrus","date":"2019-12-15T10:17:56.341+0000","up_votes":4,"down_votes":1,"body":"> Lux´ Ulti soll global sein ?\n\nDie Lux R hat mit 3400 IGU eine recht beschränkte Reichweite. (Global entspricht 19.400 IGU). Die Ult von Jhin hat mit 3500 IGU ebenso eine höhere Reichweite ohne global zu wirken. (Man sieht ja die Reichweite bei Jhin sehr eindeutig)\n\n> Was ist dann die Senna range ?\n\nWie die Ultimate von Ezreal ist sie Global. Also hat eine Reichweite von 20.000, um zu versichern, dass sie auch immer Global ist. (Trotz möglicher Kartenänderungen etc. und die Zahl ist besser zu hinterlegen und zu verrechnen)\n\n> Warum schafft man andere Champs nicht einfach ganz ab?\n\nWeil keiner der neuen Champions die Position eines alten einnehmen kann. Bisher hat Riot selbst mit ähnlichen Ideen (Kritik am Aatrox-Rework) Champions geschaffen, die sich im Spiel sehr verschieden verhalten haben. (Aatrox hatte eine eigene Meta mit Urgot zusammen, Riven ist jedoch ein kompetitiver Nischenpick)\n\n> Gegen die Passive von Pyke ist ne Mundo Ulti doch ein Witz!\n\nNicht wirklich. Zum einen bekommt Mundo weitaus mehr als nur Lebensregeneration und zum anderen kann Mundo durch Lebensregeneration (in Items und Runen) den Wert der Ultimate überbieten. (Es kann also über 100% seines maximalen Lebens heilen, was in Kampfsituationen recht praktisch ist) Pyke muss jedoch den Kampf aktiv verlassen und kann mit Wards etc. gecountert werden. Das graue Leben verfällt nach einer Weile und Runen und Items lassen ihn dennoch nicht mehr heilen, als das graue Leben wert ist. Im Grunde genommen ist Pyke recht pokeresistent, aber in einem wirklichen Teamfight ist seine defensive Passive eher unbedeutend (und Mundo blüht auf), selbst Tahm kann dank seiner E noch besser mit dieser mit dem grauen Leben arbeiten, obwohl man die Pyke-Passive am besten als schlechte Rengar-W abstempeln kann.\n\n> Und obendrauf dann noch invis anschleichen und mit der Ulti mehr Schaden machen als ein gefeedeter Darius ?\n\nDas liegt jedoch an Darius' R. Ihr Grundschaden ist sehr gering (weshalb es auch eine recht nutzlose R für Sylas ist), doch sie bekommt immense Boni, wenn Darius ein Ziel ultet, auf dem seine Passive gestackt ist. Die Aufgabe von Pyke ist ja auch eher eine Abstauberfunktion, während Darius als Duellant mit bedingtem Teamfight-Potental gestaltet ist. \n\n> Warum nur müssen all die neuen Champs so dermassen überladen daher kommen ?\n\nBei Senna und Aphelios verstehe ich diese Anfrage noch, jedoch muss man wirklich sehen, wie sich Senna jetzt durch den Patch entwickelt und was die Spieler aus Aphelios machen. Noch liegt Aphelios bei einer Winrate von ~45% was jetzt nicht für ihn spricht, da er definitiv nicht durch das kompetitive Spiel dazu gebracht wurde.\n\n> stacken bis zum geht nimmer\n\nEs ist nun einmal eine Mechanik, die sehr viel Potential hat und mit deren Hilfe man viele neue Mechaniken implementieren kann. Solche Elemente (inkl. Sowas wie Autoattack-Reset, etc.) sind halt das Fundament der Entwicklung. In anderen Kreisen heißen sie Staples, aber wie sie hier heißen, weiß ich nicht.\n\n>  irgendnen Schild, der alle paar Sekunden jegliche Abilities wegblockt!\n\nDas kann jeder haben. Banshee und Edge of Night sind Items und die einzigen Champions, der über diese Eigenschaft verfügen sind Sivir, Malzahar und Nocturne, die alle nicht neu sind.\n\n> Gibts denn wirklich keine anderen Geldquellen als dieses unser Lieblingsspiel mit solchen Pay-to-wim-Champs kaputt zu machen ?\n\nDie Champions sind alle für BE und somit kostenfrei zu erwerben. Pay-to-Win ist daher nicht vorhanden. Tatsächliche Pay-to-Win-Elemente wurden vor längerer Zeit entfernt oder werden mit den aktuellen und kommenden VUs entfernt.","replies":[{"poster":"Superbahamut","date":"2019-12-15T10:35:31.433+0000","up_votes":1,"down_votes":0,"body":"Was hat/hatte den LoL noch für Elemente die als ptw gelten könnten?\nAusser den mal weiter unten angesprochene ep-boost in kombo mit den alten runen, fällt mir gerade nichts ein","replies":[{"poster":"Voidberg","date":"2019-12-15T11:52:32.979+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Superbahamut,realm=EUW,application-id=Wj1wcocU,discussion-id=uvbyZRdm,comment-id=00070000,timestamp=2019-12-15T10:35:31.433+0000)\n>\n> Was hat/hatte den LoL noch für Elemente die als ptw gelten könnten?\n> Ausser den mal weiter unten angesprochene ep-boost in kombo mit den alten runen, fällt mir gerade nichts ein\n\nMan könnte die alten Runenseiten noch als p2w sehen.\nJe nach Spielweise und Matchup konnten viele Seiten durchaus Vorteile bringen.","replies":[{"poster":"Superbahamut","date":"2019-12-15T12:37:01.042+0000","up_votes":1,"down_votes":0,"body":"Ja wie gesagt: ausser das{{sticker:slayer-jinx-wink}}","replies":[]}]},{"poster":"Amycos Cyrus","date":"2019-12-15T11:25:34.416+0000","up_votes":2,"down_votes":0,"body":"Es gibt noch ein paar wenige Skins, die tatsächlich noch durch Animationen oder Schwierigkeiten beim Model (Reichweitenänderung, etc.) Vorteile verschaffen.","replies":[{"poster":"ImTheCaptn","date":"2019-12-19T09:56:09.658+0000","up_votes":2,"down_votes":0,"body":"Genau so kann ein Skin den gegenteiligen Effekt haben. Bei Project Jinx ist es für mich zb relativ schwierig auf anhieb zu sehen ob sie jetzt nun ihre Racketenwaffe oder ihre uzi hat.","replies":[{"poster":"Amycos Cyrus","date":"2019-12-19T11:53:22.918+0000","up_votes":1,"down_votes":0,"body":"Da ist ja der Klassiker PROJECT Vayne, bei der die E extrem offensichtlich animiert ist, was bei keinen anderen Skin der Fall ist.","replies":[]}]},{"poster":"Superbahamut","date":"2019-12-15T12:38:36.681+0000","up_votes":1,"down_votes":0,"body":"Ja von dem skinbuff hab ich auch schon gehört. Obwohl ich selber das nicht als so extrem befinde(liegt vlt an der elo)","replies":[]}]},{"poster":"MeMyselfandBaal","date":"2019-12-15T14:02:05.175+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Superbahamut,realm=EUW,application-id=Wj1wcocU,discussion-id=uvbyZRdm,comment-id=00070000,timestamp=2019-12-15T10:35:31.433+0000)\n>\n> Was hat/hatte den LoL noch für Elemente die als ptw gelten könnten?\n> Ausser den mal weiter unten angesprochene ep-boost in kombo mit den alten runen, fällt mir gerade nichts ein\n\nNaja... also es ist mehr eine Hidden Pay Wall für Neulinge, aber dass man sich Champions, die ins Free Elo Nirvana gebufft worden sind, erst freischalten muss, ist halt schon... nun ja... Dota2 regelt das anders.\n\nFür die Veteranen ist das ja quasi egal. Ich habe halt auch nach dem Aphelios \"Kauf\" noch 50.000 Essenzen übrig und musste noch nie RP in Champions stecken. Aber für Spieler, die das Spiel nicht seit Season 1 zocken, sieht das halt anders aus.\n\nAlso ja, theoretisch hat der TE sogar Recht. Also im \"Früher war alles besser Land\", als Riot Champions wie LeBlanc released hat, die dich garantiert und egal wie viel Leben du hattest auf Level 2 töten konnten... Dann hatte der Spieler, der sich den Champion leisten konnte einen ziemlichen Vorteil. \n\nWas der TE aber halt ignoriert: Neue Champions haben mittlerweile meistens ein sehr komplexes, man kann durchaus sagen überladenes Kit. Dadurch sind sie aber auch schwierig zu meistern. Gerade bei Aphelios wurde ja der Joke verbreitet, dass man dafür einen Masterabschluss an der Uni braucht um den Champion zu verstehen. \nDas führt aber halt auch dazu, dass quasi alle neuen Champions erst Mal eine Winrate von 45% haben. Oder, für den TE, eine Loserate von 55%. Damit ist Riot mittlerweile eher Pay2Lose als Pay2Win: Wer sich den neuen Champion unbedingt direkt für RP kaufen will und dann damit ins Ranked geht, wird im Großen und Ganzen dadurch mehr Elo verlieren als gewinnen...\n\nWie am LeBlanc Beispiel erwähnt: Früher war das durchaus anders. Aber Riot hat da, so absurd das klingt, über die Jahre ein bisschen was gelernt...","replies":[{"poster":"sN00Bdogg","date":"2019-12-16T16:34:05.698+0000","up_votes":1,"down_votes":0,"body":"Danke für diesen Kommentar.\nIch kuck mir gleich mal an wie die Winrate dieser Champions in der Bronze ist. Ich wette da ist sie höher!","replies":[]}]},{"poster":"Erikmammut","date":"2019-12-15T21:38:04.514+0000","up_votes":1,"down_votes":0,"body":"Einige Skins haben sehr uneindeutige Skillshotanzeigen, sodass das Dodgen schwer werden kann. Manche Skins wir der Blutfürst-Vladimir haben auch einfach fließendere Bewegungen, die das Spiel positiv beeinflussen können. Allerdings sind diese Dinge erstens nur minimal ptw und außerdem nicht von Riot eingeplant.","replies":[]},{"poster":"VoteForTrump","date":"2019-12-15T11:22:31.377+0000","up_votes":1,"down_votes":1,"body":"Spirit Guard Udyr","replies":[{"poster":"Superbahamut","date":"2019-12-15T12:39:07.034+0000","up_votes":1,"down_votes":0,"body":"{{sticker:sg-lux-2}} \n\nErklärung?","replies":[]}]}]}]},{"poster":"RitosMoriarty","date":"2019-12-15T02:56:39.024+0000","up_votes":5,"down_votes":2,"body":"Teilweise stimme ich dir zu. Riots Balancing team leistet eine relativ schlechte Arbeit und wie du sagtest sind die neuen bzw. reworked Champs zu oft einfach überladen. Bard und Yuumi wären die Ausnahmen, welche mir spontan einfallen würden. Böse Zungen könnten behaupten, dass es leichter ist die \"Fehler\" nach zwei Wochen wegzupatchen, anstatt eine gute Diskussion zu führen, hust hust die Ente.\n\nDie Hypothese mit dem pay-to-win kann ich und muss ich ablehnen. In League gibt es so was wie pay-to-win nicht, außer das Boosten vielleicht, was theoretisch auch kein pay-2-win im ursprünglichen Sinne ist. \nEs gab oder gibt noch ein Paar Skins mit denen man kleinere Vorteile besitzt, I-Robot BC und Santa Graggy waren es früher jedenfalls. Solche Skins werden dann auch in der kompetitiven Szene verboten.\n\nUm deine Frage zu beantworten, es gibt andere Quellen. Skins, neue Spiele, noch mehr Skins, irgendwelche Events und ingame Passes etc..","replies":[]},{"poster":"MamaFrey","date":"2019-12-16T06:18:34.564+0000","up_votes":2,"down_votes":0,"body":"Senna is so easy zu countern. Ich maine sie grad. Wenn der Gegner sie pickt nehm ich Leona und die Dame hat keine Chance mehr.\nEinfach mal ein bisschen mit dem Spiel beschäftigen. Counterchamps googeln ginge schneller als hier nen heulzhread zu schreiben. \n\nIch hab mir die Neuen btw. ganz ohne RP an Tag eins gekauft. \nPay to win sieht irgendwie anders aus.","replies":[]},{"poster":"Angel Ayume","date":"2019-12-15T03:24:17.304+0000","up_votes":3,"down_votes":2,"body":"Ich versteh nicht genau, wie pay to Win hier rein passt. oo","replies":[{"poster":"Eroticat Nimar","date":"2019-12-15T04:33:35.999+0000","up_votes":1,"down_votes":1,"body":"Ich glaube es geht um Spieler die nicht die nötigen Essenzen haben um sich neue und teilweise overpowerte Champs zu kaufen\n\nIst jetzt für mich kein ptw Game da es ja meta Champs in jeder Preisklasse gibt","replies":[{"poster":"sN00Bdogg","date":"2019-12-16T16:43:56.493+0000","up_votes":1,"down_votes":0,"body":"Ich hab meinen Main-Account seit season 2 und immer noch nicht alle champs. Mag daran liegen, daß ich mir ein paar Runenseiten geleistet habe. De facto fehlen mir immer noch 8 Champions mangels Blauer Sosse. Wenn es nun einem Season-2-\"Veteranen\" so geht , wie sieht es dann wohl bei Spielern aus, die später eingestiegen sind? Genau! Die zahlen ein, um auch mal den OP-Champion der Stunde spielen zu dürfen\n !!!!","replies":[{"poster":"Pαpα Bär","date":"2019-12-16T22:45:45.129+0000","up_votes":1,"down_votes":0,"body":"1. Ich vestehe dein Problem nicht ich habe 2 Accounts einer is nen beta der andere s1 und beide Accounts haben mehr als 200k be  2. Keiner braucht mehr als eine Runenseite wenn man sich mit den runen auseinander setzen würde 3. Alle neuen/reworked champs haben starke Schwächen siehe senna/aphelios beide besitzen keine mobility und sind daher schnell auszuschalten 4. Wenn ein champ zu stark ist dann werden entweder schnelle anpassungen unternommen oder im nächsten Patch (Wie die champs die alle conq abused haben). Und wenn dir ein champ zu stark ist banne ihn doch einfach. Mehr möchte ich dazu auch nicht schreiben.","replies":[]}]}]}]},{"poster":"00 M4ddin 00","date":"2019-12-16T07:26:52.503+0000","up_votes":2,"down_votes":1,"body":"Ok dieses Pay to Win ist Blödsinn.... \n\nAber das neue champs überladen sind ist real. Liegt dran das Riot kein balancing kann und einen starken champ mit den nächsten starken champ überbieten muss damit es nicht auffällt das der alte champ immer noch stark ist ...","replies":[]},{"poster":"Eroticat Nimar","date":"2019-12-15T03:37:10.540+0000","up_votes":2,"down_votes":1,"body":"Der Junge erzählt mir was von PTW.\nWir league veteranen erinnern uns noch an eine zeit an der es total legitim war sich Einflusspunkte boosts für RP zu kaufen damit man sich Runen kaufen kann damit man das Spiel so spielen kann wie man wollte.\n\nJeden Champion kann man sich erspielen wenn man ihn haben will.\nIch sitzte auf viel zu vielen blauen essenzen und weiß zwischendurch nicht was ich damit machen soll.\n\nUnd excuse me again, die sachen die du hier aufzählst sind alle nicht neu.\nWenn ich so an den alten Talon, Kassadin oder Teemo denke wird mir schlecht.","replies":[{"poster":"sN00Bdogg","date":"2019-12-16T16:40:46.730+0000","up_votes":1,"down_votes":1,"body":"1. Danke für das \"Junge\"\n2. Schön, dass d so viel Blaue Sosse hast. Die meisten haben das nicht und ... diese Spieler posten das auch nicht! Sie haben die blaue Sosse nicht und kaufen sich diese  Chars. Egal jetzt ob RP oder BS ... sie ZAHELEN  dafür, daß sie den neuen OP-Champ spielen dürfen. Sei es nun , weil er tatsächlich OP ist oder nur, weil noch kaum einer weiss wie man ihn countert.\n3. Klar .. ziemlich viele \"alte\" Champs wurden bewusst \"OP\" released, gerade um diesen Effekt zu erzielen! Nämlich, daß so \"einige\" Prozent der LOL-Süieler den Geldbeutel aufmachen !","replies":[{"poster":"Këndo","date":"2019-12-23T09:32:21.807+0000","up_votes":1,"down_votes":0,"body":"Absoluter Blödsinn den du von dir gibst....  nichts gegen dein Rang, aber man merkt einfach das du nur Bronze/Silber bist. Du hast dich einfach nicht mit dem Spiel auseinander gesetzt und das seit Season 2 xD. Früher hat man sehr schlecht die \"Blaue Sosse\" bekommen, doch seit den Änderungen mit der Beute, kriegt man reichlich. Schade das dein Post nicht 1000 dislikes bekommt.","replies":[]}]}]},{"poster":"GlobalWolve","date":"2019-12-23T23:38:41.396+0000","up_votes":1,"down_votes":0,"body":"Ich stimme dir zu, irgendwo.","replies":[]},{"poster":"ènryu","date":"2019-12-16T22:29:54.149+0000","up_votes":1,"down_votes":0,"body":"Weiß 6300 blaue Essenzen auch so schwer sind zu bekommen xD","replies":[]},{"poster":"Xyltin","date":"2019-12-16T14:57:28.147+0000","up_votes":1,"down_votes":0,"body":"1. Senna war OP es aber nicht mehr. Support senna ist sogar eher etwas auch der schwächeren Seite mit einer 49% WR. ADC Senna ist OK mit knapp 50%.\n\n2. Aphelios könnte zu stark sein aber bis jetzt erreicht er erst eine 50% WR (letzten 2 Tage). Das ist hoch für einen noch neuen Champ aber nicht so schlimm wie Senna. Hier heißt es abwarten. Vlt bekommt er morgen einen leichten Nerf, vlt nicht.\n\n3. Sett hat skillshots. Sein W ist verzögert und damit kann man ihm ausweichen. Sein E ist dafür zu schnell. Außerdem sagen skillshots nichts über die Agency aus. Juggernauts wie Sett sind in see Regel schwach im competitive Bereich da es ihnen zwar nicht ans Power aber Agency mangelt. Das bedeutet sie könne die Power nur einsetzen wenn der gern es zulässt. Mobility und Range sons für Agency da und Sett hat dies nicht.\n\nAlles in allem weinst du rum hast aber selbst keine Ahnung vom Spiel oder den genannten Champs. Tut mir leid aber das ist kindisch. Vlt bist du ja noch so jung aber dann nimm dir diese Kritik bitte zu Herzen und fange an dich mit Themen zu beschäftigen bevor du losheulst.\n\nZumindest mit der Überladung hast du etwas Recht aber auch da geht Riot mit Aheplios und Sett und auch Senna etwas besser um. Davor Akali und Sylas waren überladen mit viel Mobility, burst, dps, sustain und CC.","replies":[]},{"poster":"Ian Westhoff","date":"2019-12-16T13:24:10.723+0000","up_votes":1,"down_votes":0,"body":"Aphelios bannen oder verlieren?\nJa, weil den Jungen keiner spielen kann und du den dann vlt in deinem Team hast.","replies":[]},{"poster":"Gesalzen","date":"2019-12-16T10:48:19.575+0000","up_votes":1,"down_votes":0,"body":"Das hat absolut nichts mit pay to win zu tun wenn du mal deine Ausgaben vernünftig überblicken würdest hättest du immer genug Essenzen dafür.. Aber wahrscheinlich hast du dir direkt alle icons und chromas im Shop gleichzeitig gekauft. Außerdem hab ich und viele andere keine Probleme gehabt gegen die neuen Champs, da wir wie normale Menschen vorher getestet haben wie man diese am besten kontern kann.\nViel Glück noch!","replies":[]},{"poster":"L0llyx","date":"2019-12-16T10:28:46.581+0000","up_votes":1,"down_votes":0,"body":"Ehh Kollege, schon mal was von blauen Essenzen gehört? So Leids mir tut dir das zu sagen, aber aus meinem Team hat sich legit jeder aphelios day one mit blue essence geholt. Du kannst locker auf ne Woche, mit 2-3 games pro Tag 4k-8k blaue Essenzen farmen. Und das is sogar für extreme casuals machbar. Du bist hald einfach nur dumm wie Brot","replies":[]},{"poster":"Westcoast38","date":"2019-12-15T23:48:04.409+0000","up_votes":1,"down_votes":0,"body":"Ok verstehe teils deinen Ansatz. Wenn man nur einen Tunnelblick hat oder einfach nur schlecht ist kann man nicht gegen diese Champs ran.\nUnd ja teils stimmt das auch das diese wesentlich komplizierter sind als alte Champs. \nAber warum Pay to Win? Keine Ahnung wie du Champs kaufst aber ich benutze meine blauen, kostenlos erspielten Essenzen. \nWenn du die Splitter noch in der Hextech Werkstatt hast kosten die Champs noch billiger","replies":[]},{"poster":"Split Your Head","date":"2019-12-15T19:47:23.117+0000","up_votes":1,"down_votes":0,"body":"Jo, klassischer Fall von Silber 4 Solo Q Warrior der nicht über seinen Champ Pool Rand rausschauen kann!","replies":[]},{"poster":"xMirai","date":"2019-12-15T19:31:41.462+0000","up_votes":1,"down_votes":0,"body":"Was ein Post.. Pay to Win sagt er xD.\nIch erinnere mich an die Zeiten wo man Champs mit Einflusspunkte kaufen musste das war teuer wo man Booster kaufen konnte damit es schneller geht.\nHeute bekommst du Missionen Championshards etc, um schnell BE zu bekommen und du kannst mit jedem Champion Dia+ erreichen was auch gewisse Spieler und Seiten beweisen.\nUnd zu ja dieser und dieser Champ ist op? Dann Lern gegen ihn zu spielen und der rest naja Lol bassiert auf regelmäßigen Balance changes also sry aber, wenn du sowas Pay to Win nennst dann sind 60-80% aller Spiele für dich nichts.\n\nAn Alle anderen schönen Abend^^","replies":[]},{"poster":"Lunnaris01","date":"2019-12-15T18:29:19.173+0000","up_votes":1,"down_votes":0,"body":"Dir ist bewusst dass du dir die auch einfach erspielen kannst? :D Champs freizuschalten ist aktuell leichter denn je, und es werden so selten Champs hinzugefügt wie nie zu zuvor..... Und wie du selbst sagst hat man ja viele band :D dann ban den champ doch einfach","replies":[]},{"poster":"Razor Fly","date":"2019-12-15T15:54:46.112+0000","up_votes":1,"down_votes":0,"body":"Deine Aussage ist 90% troll. Das hat nichts mit Pay to win zu tun... Zumal ja sogar noch preseason ist und du noch BE sparen lannst. Neue Champions sind zwar überladen aber das ist nichts neues. 3 Jahre lang wurden jetzt schon überladene Champs am Stück raus gehauen das ist einfach der Weg den Riot gewählt hat. Spiel das Spiel oder lass es bleiben. Lol hat Probleme mit Sicherheit aber die Punkte die du hier ansprichst sind weit entfernt von den Punkten die ich nennen würde.\n\nP2W yikes...","replies":[]},{"poster":"G5 RaZaR","date":"2019-12-15T12:57:50.461+0000","up_votes":1,"down_votes":0,"body":"Spiel halt mal einen Tank und du wirst merken:\n\nDie halten ja tatsächlich mehr aus und haben genug cc, um damagelastige Champs zu natzen.\n{{champion:142}}","replies":[]},{"poster":"Most Salty Keggy","date":"2019-12-15T11:52:22.501+0000","up_votes":1,"down_votes":0,"body":"Uff Pay to Win Champs...","replies":[]},{"poster":"MSF Akito","date":"2019-12-15T11:22:19.916+0000","up_votes":1,"down_votes":0,"body":"Pay2Win? Du kannst einen Champion für 450 BE kaufen und lernen. Wenn du damit gut bist, dann kommst du damit auch Dia, Master oder Challenger. Und wenn die neuen Champions wirklich so OP sind.. warum sparst du dann nicht ein paar Tage &amp; kaufst ihn dir? Dann bist du doch schon in besitz des besten Champions und niemand kann dich aufhalten.. Wenn es doch so einfach ist, warum beschwert man sich dann überhaupt? \n\nUnd die Beschwerde über die Ult Range kann ich auch nicht nachvollziehen. Der letzte Champion, der (vor Senna) mit einer global Ult released wurde ist Jinx. Und das ist schon ein paar Jährchen her.","replies":[]},{"poster":"SimpleRabbit","date":"2019-12-15T05:25:36.306+0000","up_votes":1,"down_votes":0,"body":"Klar, wenn man verliert ist immer alles OP (oder man hat high ping, der Server laggt usw.) :D Aphelios hat absolut null mobility, spiel einen Assassin und er ist komplett raus! Also hör auf rum zu heulen und lern, wie man gewisse Champions countered.\n\nBtw, Mundo Ult ist alles, aber kein Witz, die ist extrem gut aber okay :'D","replies":[]},{"poster":"Split Your Head","date":"2019-12-15T19:44:33.483+0000","up_votes":1,"down_votes":1,"body":"Also entweder ist der Typ Iron 4 oder komplett von dieser Welt.\nSeit Ewigkeiten sind die alten lol Klassiker die besten. \nImagine Worlds ohne Lee sin.","replies":[]},{"poster":"BlearLol","date":"2019-12-15T13:22:47.411+0000","up_votes":1,"down_votes":1,"body":"Ist doch schön wenn du gegen Aphelios spielst. Er hat nämlich gerade die schlechteste Winrate :)\n\nWenn, dann wäre es also wohl eher Pay-to-lose :D","replies":[]},{"poster":"Megamaexx","date":"2019-12-15T12:32:18.184+0000","up_votes":1,"down_votes":1,"body":"Jeder Aphelios, gegen den ich gespielt habe, hat hart verloren. Ich hatte bisher einen im Team, der tatsächlich was konnte. \nRein statistisch gesehen sind die neuen Champions nicht bei denen mit den hohen Winrates, du berufst dich auf persönlichen Erfahrungen, die eben von der Gesamtheit scheinbar ziemlich stark abweichen.","replies":[]},{"poster":"Ganze31cm","date":"2019-12-15T02:57:01.433+0000","up_votes":1,"down_votes":1,"body":"Also erstmal was laberst du wtf neue champs sind anfang (wenn sie raus kommen) immer stark und dann wird geguckt wie man sie anpasst und die \"ganzen neuen champs\" sind nicht stärker als alte champs es kommt immer drauf an wie gut man mit ihnen spielt/Gegner outplayt","replies":[]}]}