{"poster":"sN00Bdogg","date":"2016-10-21T01:11:36.046+0000","title":"Supporter Main (Bronze 2) sucht ADC zum Aufstieg nach Silber","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Ja servus!\n\nHabe mir in den Kopf gesetzt als Taric-One-Trick-Pony nach Silber aufzusteigen.\n\nUnd zwar noch bevor die Season endet! \n\nVon B5 nach B2 wars relativ einfach, doch nun sind die  Stamm-ADC beide nach Gold aufgestiegen. Wer mag ihren Platz einnehmen?\n\nEinfach hier was posten. Ich adde Dich dann ingame.\n--------------------------------------------------------------------------------------------------------------------------------------------------\nBitte keine Kids, denn ich bin wohl eher einer der &auml;ltesten Lol-Spieler Deutschlands.\nBitte nicht von meiner MMR abschrecken lassen.\nUnd bitte mit gutem Internet, das nicht gleich wegen Teamspeak zusammenbricht.\n\nOoops! Bin heute in die B3 gedropped also bitte schnell melden !","replies":[{"poster":"Ojamagik","date":"2016-10-21T12:11:57.018+0000","up_votes":1,"down_votes":0,"body":"Adde mich einfach RUCHHOLLIGAN98\nMain Champs:{{champion:67}} {{champion:429}} {{champion:81}}","replies":[]},{"poster":"Zulwar","date":"2016-10-21T09:03:33.693+0000","up_votes":1,"down_votes":0,"body":"Hi,\n\nja ich wünsche dir dann erstmal viel Glück mit dem Champion.\n\nIch kann mich anbieten mit dir zu spielen. Möchte aber dazu erwähnen, das ich derzeit nicht so viel Zeit habe zum spielen. Wochenende ist eher selten, in der Woche meist nur 1-2 Spiele.\n\nIch selber bin ADC-Main und spiele derzeit \nPrimär Main:{{champion:22}} \nSekundär Mains:{{champion:51}} {{champion:21}}\n im Ranked.\nIch selber bin 24 Jahre alt und sollte somit nicht zu kidi sein.\nInternet habe ich eine 120k Leitung, die somit genügend aushalten sollte.","replies":[]},{"poster":"fess123","date":"2016-10-21T07:25:30.792+0000","up_votes":1,"down_votes":0,"body":"Hi sN00Bdogg,\n\ndu hast es satt alleine in der Dynamic Queue zu spielen und suchst nun ein Team oder benötigst einfach nur Gleichgesinnte? Aequilibritas eSports hilft dir bei der Erstellung eines Teams und bei der Suche nach Mitspielern, sodass du hoffentlich schnell in einem Team unter gebracht wirst, aber dir sind natürlich auch spaßige Abende garantiert!\n\nHier gehts zu unserem Vorstellungsthread: [Aequilibritas eSports sucht Mitglieder | Community und eSports | LoL, CS:GO, Overwatch etc.](http://boards.euw.leagueoflegends.com/de/c/clans-teams-de/cOWosEff-aequilibritas-esports-sucht-rekruten-community-esports-lol-csgo-overwatch-etc)\n\nÜber diesen Link kannst du natürlich auch direkt zur Aufnahme gelangen: [Bewerbungsformular](http://aequilibritas-esports.de/index.php/Application/)\n\nUnsere Community existiert bereits seit 2009. Wir würden uns natürlich über dein Interesse freuen und eventuell sogar über die Teilnahme an unserer Gemeinschaft. :)","replies":[]}]}