{"poster":"sN00Bdogg","date":"2018-06-15T22:51:23.786+0000","title":"RETTET DIE ADC´s  -  UNBALANCING und was man dagegen tun könnte","subforum":"Champions & Gameplay","up_votes":8,"down_votes":7,"body":"Ja servus! \n\nHintergrund bzw Ausgangspunkt meiner Überlegungen ist das immer wieder auftretende **Unbalancing** des Spiels - momentan zu Lasten der ADC´s,  die gegen Malzahar/Brand/Vladimir &amp;CO-Supporter nur noch am Spiessrutenlaufen sind.\nIn der Historie gab es solche Phänomene immer wieder und Rito hatte immer Probleme die Balance wieder her zu stellen.\n\nWarum dies so schwer fällt liegt meines Erachtens daran, daß Änderungen an Gegenständen immer auf allen Lanes und Champions zugleich durch schlagen. \nZ.B. Will man die ADC´s im Early stärken und bufft die Werte von z.B. Dorans Schwert, dann kommt dies nicht nur den ADC´s zu Gute sondern auch allen anderen Charakteren. \nOft schon hatte dies dann zu Auswüchsen geführt, die so nicht beabsichtigt waren.\n\n**Konkrete Beispiele für solche Auswüchse:**\n1) Relic Schild / Targons Panzer => War plötzlich so stark, daß es sogar der ADC als Startitem nahm. Eigentlicher Plan war es die Supporter zu stärken. Ging daneben ;)\n2) Dorans Schild oder Ring, welche plötzlich auf allen Lanes mehrfach gekauft wurden - auch von manabhängigen Nahkämpfern (Ring)  oder AP-Midlanern (Schild)\n3) Die Machete welche den Jungler stärken sollte und erst durch die Zwangsbindung an Smite nicht mehr für andere Lanes \"missbraucht\" wurde.\n\nSeit ich LOL kenne wundere ich mich darüber, daß alle Items jedem zur Verfügung stehen. Mit der Zeit hat man sich daran gewöhnt und es ist ja auch immer wieder witzig, wenn die Community plötzlich umschwenkt und z.B. einen AP-Yi  oder einen AD-Fiddlestick baut (und mit Erfolg einsetzt). Aber genau da möchte ich mit meiner Idee ansetzen:\n\nGrundlegende Fragen :  \nWieso kann ein absoluter Nahkämpfer wie zB Tryndamere einen Bogen kaufen ? \nWieso kann ein Fernkämpfer wie Asche einen Schild kaufen?\nWieso kann ein AP-Supporter mit BF-Schwert, Dorans Schild und Dornenpanzer immer noch zaubern?\n\nGenau durch diese grundlegende (und eigentlich widersprüchliche) Konzeption ist das Balancing so verdammt schwer. Will man der einen Gruppe der Champions einen Buff geben, bekommt automatisch eine andere Gruppe denselben Buff  - mit oft \"wilden\" Auswüchsen.\n\n**Jetzt meine Idee zur Abhilfe:**\nMan stelle sich  vor es gäbe **gruppenbezogene Items**. \nSortiert nach Fernkämpfer / Nahkämpfer / Magier / Assasine / Tanks   und daneben allgemein erhältliche Items. \n\nDann würde ein ADC mit Dorans Bogen starten und ein Tryndamere mit Dorans Schwert; \nder Magier mit Dorans Ring und der Tank mit Dorans Schild. Die anderen Items wären für diesen Typ Champion gesperrt!\nMeinetwegen haben Schwert und Bogen anfangs gleiche Werte. Kommt das Spiel aber irgendwann aus dem Gleichgewicht, so könnte man gezielt für einzelne Gruppen nachsteuern.\n\n**Aktuelles Beispiel: Die ADC´s! **\nWollte man diese nun buffen, so könnte man ganz einfach diesen _Dorans Bogen_ buffen und ein Nahkämpfer hätte weiter hin nur das ungebuffte _Dorans Schwert_ zur Verfügung, da er den Bogen nicht kaufen kann.\n\nWeiterführend gilt dieses Prinzip natürlich auch für Rekursivbogen oder BF-Sword oder Zauberstab etc.\nItems wie Eifer sollten jedem zur Verfügung stehen, der weitere Ausbau jedoch wieder gruppenbezogen. \n\nNatürlich muss es für ADC etwas vergleichbares zum BF-Sword geben, aber dann legt man eben einen Beste-Freunde-Bogen auf; mit ähnlichen Kosten und Werten.\n\nIch denke dadurch wird das Spiel bereichert. Aber vor allem gibt es den Entwicklern ein Werkzeug an die Hand mit dem sie sehr leicht nach-balancieren können.\n\nWas denkt ihr über solche gruppenbezogenen Items?\n\n\nNACHTRAG: \nNatürlich soll die überwiegende Zahl der Items \"allgemein\" sein und jedem zum Kauf zur Verfügung stehen. Meine Idee zielt auf einige wenige Items ab, die jeweils nur gruppenbezogen erworben werden können  bzw den jeweiligen Build vervollkommnen.\nEs ist dann immer noch \"so viel\" im Shop, daß man auch völlig ohne diese Spezial-Items Fullbuild werden könnte, was man jedoch aufgrund der \"einzigartigen\" Eignung für diese Gruppe und der Nützlichkeit bzw Stärke  nicht tun würde.\n","replies":[{"poster":"ITroll4Fun","date":"2018-06-15T22:56:29.683+0000","up_votes":1,"down_votes":0,"body":"Eine interessante Idee, könnte ein richtiger Schritt sein, da es das Abusen der \"op\"-Items für andere Gruppen begrenzt.\nMeiner Meinung nach ist aber auch die fehlende Trennung zwischen den Casual- und Probereich ein großes Problem für das balancing. Und natürlich die Praktikanten in dem Balance Team Kappa.","replies":[{"poster":"OT Riku","date":"2018-06-15T23:20:34.659+0000","up_votes":5,"down_votes":0,"body":"Das Problem ist aber auch wo willst du den probereich abstecken LCS ab challenger.\nWie willst du als angehender pro ins proplsy ordentlich rein finden wenn du in der SoloQ ganz andere Champions und builds spielen musst um relevant zu sein.","replies":[]},{"poster":"sN00Bdogg","date":"2018-06-15T22:58:38.641+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=BestRoleToClimb,realm=EUW,application-id=Wj1wcocU,discussion-id=bAVu1F7E,comment-id=0000,timestamp=2018-06-15T22:56:29.683+0000)\n>\n> Eine interessante Idee, könnte ein richtiger Schritt sein, da es das Abusen der &quot;op&quot;-Items für andere Gruppen begrenzt.\n> Meiner Meinung nach ist aber auch die fehlende Trennung zwischen den Casual- und Probereich ein großes Problem für das balancing. Und natürlich die Praktikanten in dem Balance Team Kappa.\n\nDas mit dem Pro Bereich stimmt. Oft wird für die LCS-Spieler etwas geändert, was aber für die Millionen Bronzisten nie eine Rolle gespielt hat.","replies":[]}]},{"poster":"MeMyselfandBaal","date":"2018-06-16T02:47:50.297+0000","up_votes":3,"down_votes":0,"body":"Es gibt da erstaunlich viele Probleme:\n1.) Relic Shield ist effektiv nur generft worden... das, das sich dann irgendwann als Botlane Meta durchgesetzt hat, war theoretische Jahrelang OP... Es hat nur keiner gemerkt. Und ja, dass Dinge heimlich OP sind, passiert erstaunlich oft.\n2.) Oftmals werden Items durch Dinge beinflusst, die gar nichts mit dem Item selber zu tun haben... sondern mit Dingen um sie herum. Das kann man wunderbar am Relic Shield verdeutlichen: Das letzte mal, als in den Patch Notes ein \"Increase\" stand, war 6.13... Natürlich kann man jetzt darüber streiten, ob die Questerfüllung ein Buff war, aber die wenigsten ADCs haben das Item so weit ausgebaut, dass die Quests relevant waren... Warum wurde also plötzlich Relic First als ADC gebaut? Nun ja, weil Ardent Censer so verdammt broken war, dass es da unten ausschließlich darum ging, wer dieses Item zuerst bekommt. Und weil der Support über dein Relic mehr Gold bekommen hat, musste der ADC es bauen... \nNebenbei haben sie am Ende echt die Lösung eingeführt, die ich vor 2 Jahren, als der Glücksdolch das erste Mal in der Mitte gebaut wurde, vorgeschlagen habe... und ja, ich erwähne das nur, weil ich so selten Recht behalte.\nAber es kann dir halt bei LoL passieren, dass Dinge, die du vor 20 Patches geändert hast, plötzlich broken sind... weil du andere Dinge, die davon indirekt profitieren, gebufft hast...\n3.) Off Meta Entwicklungen sind immer wieder spannend. Bekanntestes Beispiel sind Annie und Zyra, die jahrelang die Support Meta geprägt haben, obwohl sie nie als Support geplant waren... stell dir vor Riot unterbindet so was, in dem sie Support Items nur für Support Champions freigibt... Und ja, ich bin mir relativ sicher, dass das Balance Team erstaunlich häufig (und nicht nur jetzt gerade, wo sie einfach nicht bedacht haben, dass niemand mehr ADC pickt, wenn sie die zu hart nerfen) vor Metaentwicklungen steht und sich denkt \"Boah, das haben wir so nicht gedacht\".. Und das ist meistens super gut. \nIch finde es an der Stelle meistens eher schlimm, das Riot dann restriktiv patched. Also haben jahrelang versucht Annie aus der Supportrolle rauszupatchen. Aber mit ihrem Kit und in der damaligen Meta war sie nur als Support viable. Das Ergebnis war dann, dass sie komplett aus dem Spiel entfernt wurde, weil sie weder als Support noch als Midlaner brauchbar war... da würde ich mir ehrlicher Weise häufiger wünschen, dass Riot Dinge eher laufen lässt...\nWenn wir plötzlich feststellen, dass eine Spielweise, die so nie geplant war, erstaunlich effektiv ist, gibt es keinen Grund die Spieler in der Möglichkeit diese Spielweise zu benutzen zu beschneiden.\n\nWenn man ganz ehrlich ist, regen sich alle derzeit nur so auf (und ich bin da ja voll dabei #ADCLIFEMATTERS), weil Riot das Balance Update für die ADCs so dermaßen verkackt hat, dass gefühlt die gesamte Rolle aus dem Spiel entfernt worden ist. Dass ADCs einfach nicht mehr viable sind. Und ja, das zeigt auch nur, wie broken Ranged Auto Attacks sind, wenn es dafür ordentliche Items gibt... und wie nutzlos sie sind, wenn es diese Items nicht gibt... aber ganz ehrlich, das wusste man seit dem es Kennen ADC gab... Die Änderungen sind halt extremer ausgefallen, als das Balancingteam gedacht hat... weil die halt nicht daran geglaubt haben, dass \"wir\" dann innerhalb von 2 Wochen aufhören ADCs zu spielen (und ja, in der LCK passiert genau das). \nDas war mit ziemlicher Wahrscheinlichkeit nicht der Plan und ich würde davon ausgehen, dass Riot das in den nächsten 1-2 Patches nochmal nachjustiert. Und dann können wird über die Updates urteilen.","replies":[{"poster":"Cenâreth","date":"2018-06-16T06:34:46.752+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=MeMyselfandBaal,realm=EUW,application-id=Wj1wcocU,discussion-id=bAVu1F7E,comment-id=0003,timestamp=2018-06-16T02:47:50.297+0000)\n> \n> Wenn man ganz ehrlich ist, regen sich alle derzeit nur so auf (und ich bin da ja voll dabei #ADCLIFEMATTERS), weil Riot das Balance Update für die ADCs so dermaßen verkackt hat, dass gefühlt die gesamte Rolle aus dem Spiel entfernt worden ist. Dass ADCs einfach nicht mehr viable sind. Und ja, das zeigt auch nur, wie broken Ranged Auto Attacks sind, wenn es dafür ordentliche Items gibt... und wie nutzlos sie sind, wenn es diese Items nicht gibt... aber ganz ehrlich, das wusste man seit dem es Kennen ADC gab... Die Änderungen sind halt extremer ausgefallen, als das Balancingteam gedacht hat... weil die halt nicht daran geglaubt haben, dass &quot;wir&quot; dann innerhalb von 2 Wochen aufhören ADCs zu spielen (und ja, in der LCK passiert genau das). \n> Das war mit ziemlicher Wahrscheinlichkeit nicht der Plan und ich würde davon ausgehen, dass Riot das in den nächsten 1-2 Patches nochmal nachjustiert. Und dann können wird über die Updates urteilen.\n\nDann muss ich aber auch Bedenken dass solche Änderungen genau auf dem PBE ebenfalls sein kann, da kann ich dann nicht einfach hergehen und den Patch  2 - 4 Wochen nach dem er aufm PBE gelandet ist raushauen, sondern könnte in ruhig mal 2 Monate dort ruhen lassen um etwaige Anpassungen zu durchführen oder Bugs zu beheben.\n\nDass was hier getan worden ist, war nicht durchdacht.","replies":[{"poster":"MeMyselfandBaal","date":"2018-06-16T09:36:43.649+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Cenâreth,realm=EUW,application-id=Wj1wcocU,discussion-id=bAVu1F7E,comment-id=00030000,timestamp=2018-06-16T06:34:46.752+0000)\n>\n> Dann muss ich aber auch Bedenken dass solche Änderungen genau auf dem PBE ebenfalls sein kann, da kann ich dann nicht einfach hergehen und den Patch  2 - 4 Wochen nach dem er aufm PBE gelandet ist raushauen, sondern könnte in ruhig mal 2 Monate dort ruhen lassen um etwaige Anpassungen zu durchführen oder Bugs zu beheben.\n> \n> Dass was hier getan worden ist, war nicht durchdacht.\n\nDer Ansatz, Dinge länger als (gefühlt) nen paar Tage auf dem PBE zu lassen, wäre mal wirklich interessant. Gerade bei Grundlegenden Änderungen und neuen Champions würde ich es bevorzugen, wenn die Dinge länger getestet werden...\n\nAber... gerade bei den ADC Nerfs hätte das nicht funktioniert. Denn das Problem ist ja die extreme Metaänderung. Und so was kann der PBE halt relativ schlecht vorhersagen. Und ja, es ist davon auszugehen, dass das Balance Team einfach nicht davon ausging, dass (Übertreibung incoming, obwohl... in der LCK nicht mal) wir alle dann einfach aufhören ADCs zu spielen, wenn diese Nerfs durchkommen. Damit haben sie halt (vor allem so schnell) nicht gerechnet...","replies":[]},{"poster":"Amycos Cyrus","date":"2018-06-16T20:13:54.556+0000","up_votes":1,"down_votes":0,"body":"Das der PBE nicht dem Balancing dienen kann sollte glaube ich seit dem Riot-Statment dazu klar sein:\nhttps://boards.na.leagueoflegends.com/en/c/developer-corner/EQ6VnjTH-quick-gameplay-thoughts-may-30\nDaher werden auch immer wieder Dinge wie AP-Galio oder der geniale Nunu-W-Buff auf den Live-Servern erscheinen.\n\nAuf der anderen Seite testet Riot aktuell sehr hart an allen möglichen Dingen. (Patchzyklen, -umfang etc. Midseason-Update etc. usw.) Das da auch mal absolute Meta-Wandler bei sind sollte eigentlich keinen verwundern, wobei dieser Metashift sogar von Riot zur Preseason angeteasert wurde. (Ich bezweifle jedoch, dass sie ihn so schnell umsetzen wollten)\nhttps://www.youtube.com/watch?v=0nLTOyDg_2I&t=137s","replies":[]}]},{"poster":"sN00Bdogg","date":"2018-06-16T10:25:10.123+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=MeMyselfandBaal,realm=EUW,application-id=Wj1wcocU,discussion-id=bAVu1F7E,comment-id=0003,timestamp=2018-06-16T02:47:50.297+0000)\n>\n> Es gibt da erstaunlich viele Probleme:\n> 1.) Relic Shield ist effektiv nur generft worden... das, das sich dann irgendwann als Botlane Meta durchgesetzt hat, war theoretische Jahrelang OP... Es hat nur keiner gemerkt. Und ja, dass Dinge heimlich OP sind, passiert erstaunlich oft.\n> 2.) Oftmals werden Items durch Dinge beinflusst, die gar nichts mit dem Item selber zu tun haben... sondern mit Dingen um sie herum. Das kann man wunderbar am Relic Shield verdeutlichen: Das letzte mal, als in den Patch Notes ein &quot;Increase&quot; stand, war 6.13... Natürlich kann man jetzt darüber streiten, ob die Questerfüllung ein Buff war, aber die wenigsten ADCs haben das Item so weit ausgebaut, dass die Quests relevant waren... Warum wurde also plötzlich Relic First als ADC gebaut? Nun ja, weil Ardent Censer so verdammt broken war, dass es da unten ausschließlich darum ging, wer dieses Item zuerst bekommt. Und weil der Support über dein Relic mehr Gold bekommen hat, musste der ADC es bauen... \n> Nebenbei haben sie am Ende echt die Lösung eingeführt, die ich vor 2 Jahren, als der Glücksdolch das erste Mal in der Mitte gebaut wurde, vorgeschlagen habe... und ja, ich erwähne das nur, weil ich so selten Recht behalte.\n> Aber es kann dir halt bei LoL passieren, dass Dinge, die du vor 20 Patches geändert hast, plötzlich broken sind... weil du andere Dinge, die davon indirekt profitieren, gebufft hast...\n> 3.) Off Meta Entwicklungen sind immer wieder spannend. Bekanntestes Beispiel sind Annie und Zyra, die jahrelang die Support Meta geprägt haben, obwohl sie nie als Support geplant waren... stell dir vor Riot unterbindet so was, in dem sie Support Items nur für Support Champions freigibt... Und ja, ich bin mir relativ sicher, dass das Balance Team erstaunlich häufig (und nicht nur jetzt gerade, wo sie einfach nicht bedacht haben, dass niemand mehr ADC pickt, wenn sie die zu hart nerfen) vor Metaentwicklungen steht und sich denkt &quot;Boah, das haben wir so nicht gedacht&quot;.. Und das ist meistens super gut. \n> Ich finde es an der Stelle meistens eher schlimm, das Riot dann restriktiv patched. Also haben jahrelang versucht Annie aus der Supportrolle rauszupatchen. Aber mit ihrem Kit und in der damaligen Meta war sie nur als Support viable. Das Ergebnis war dann, dass sie komplett aus dem Spiel entfernt wurde, weil sie weder als Support noch als Midlaner brauchbar war... da würde ich mir ehrlicher Weise häufiger wünschen, dass Riot Dinge eher laufen lässt...\n> Wenn wir plötzlich feststellen, dass eine Spielweise, die so nie geplant war, erstaunlich effektiv ist, gibt es keinen Grund die Spieler in der Möglichkeit diese Spielweise zu benutzen zu beschneiden.\n> \n> Wenn man ganz ehrlich ist, regen sich alle derzeit nur so auf (und ich bin da ja voll dabei #ADCLIFEMATTERS), weil Riot das Balance Update für die ADCs so dermaßen verkackt hat, dass gefühlt die gesamte Rolle aus dem Spiel entfernt worden ist. Dass ADCs einfach nicht mehr viable sind. Und ja, das zeigt auch nur, wie broken Ranged Auto Attacks sind, wenn es dafür ordentliche Items gibt... und wie nutzlos sie sind, wenn es diese Items nicht gibt... aber ganz ehrlich, das wusste man seit dem es Kennen ADC gab... Die Änderungen sind halt extremer ausgefallen, als das Balancingteam gedacht hat... weil die halt nicht daran geglaubt haben, dass &quot;wir&quot; dann innerhalb von 2 Wochen aufhören ADCs zu spielen (und ja, in der LCK passiert genau das). \n> Das war mit ziemlicher Wahrscheinlichkeit nicht der Plan und ich würde davon ausgehen, dass Riot das in den nächsten 1-2 Patches nochmal nachjustiert. Und dann können wird über die Updates urteilen.\n\nErsma danke für die mühevolle ANtwort ;)\n\nOff-Meta picks/Builds sind klasse und sollen weiterhin möglich sein. \n(Das Doppel-Relics habe ich mit meinem damaligen Stamm ADC immer gespielt .. in der Bronx ... und wir sind weiss Gott wie oft \"reported\" worden  ... im Chat ... nach dem Spiel nimmer ;)\nSpäter wurde dies in der High-Elo Standard und man wurde als ADC reported wenn mans nicht nahm !\n\nGerade wegen der Komplexität von LOL ist das Balncing so schwierig. Die von mir vorgeschlagenen Gruppenbezogenen Items sollen helfen punktuell auszugleichen. \nGerade am Beispiel Annie siehst du ja, dass wegen der Support-Meta der Champ an sich so genervt wurde, daß ihn keiner mehr Mid spielen will.\nBei den Gruppen ist keine \"Support\"-Gruppe dabei! Du könntest Annie also weiterhin als Supp spielen. Die EInschränkung wäre allerdings, daß ich als Startitem kein Dorans Schild mehr nehmen könnte. Wer Annie Supp spielen wollte und dies mit Rüstung, der muss dann eben auf eine allgemeine Rüstung zurückgreifen oder eben doch beim Magiergegenstand bleiben. Die drei Suppoerter Gegenstände sollten in meiner Idee alle allgemein verfügbar sein\n\nDas \"restriktive\" Patchen seitens Riot könnte vermieden werden, da man durch die spezial-Items gruppenbezogen buffen/nerfen könnte ohne gleich wieder andere Lanes mit zu  beeinflussen.","replies":[]}]},{"poster":"Megamaexx","date":"2018-06-15T23:32:27.071+0000","up_votes":3,"down_votes":1,"body":"Ich find es gut, dass man sich in LoL mit allem ausstatten kann. Bin auch nicht sonderlich begeistert davon, dass man gewisse Items an Smite bindet (Oder die Jungle-Erfahrung an ein Jungler-Item). Bei Runaans und Hydra sehe ich die Trennung noch halbwegs ein (ein Nahkämpfer feuert eben keine Projektile mit einem Autoattack und ein Fernkämpfer schlägt nicht auf den Boden), wobei ich auch das cool finden würde, wenn man diese auf beide Arten von Champions verwenden dürfte. Leider glaube ich, dass Riot eben diese Idee in Betracht ziehen wird und auch mehr und mehr einbringen wird. So ziemlich jedes RPG nutzt so ein System, das nach Klassen deine Items beschränkt, ich mag mich aber lieber frei entscheiden, was ich benutzen möchte.\n\nAuch glaube ich nicht, dass ADCs gerettet werden müssten, sondern für die Botlane so eine Art Dreieck der Macht entsteht (Bruiser>ADC>Tank>Bruiser). Auch wenn das nicht so kommt, man sollte nicht vergessen, dass es schon überall metashifts gab, nur der ADC blieb verschont. Jetzt kann man da endlich mal Varianz reinbringen. \nSobald Yi generft wird, wird sich eh wieder einiges verschieben^^","replies":[{"poster":"Cenâreth","date":"2018-06-16T06:32:19.380+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Megamaexx,realm=EUW,application-id=Wj1wcocU,discussion-id=bAVu1F7E,comment-id=0002,timestamp=2018-06-15T23:32:27.071+0000)\n>\n> Ich find es gut, dass man sich in LoL mit allem ausstatten kann. Bin auch nicht sonderlich begeistert davon, dass man gewisse Items an Smite bindet (Oder die Jungle-Erfahrung an ein Jungler-Item). Bei Runaans und Hydra sehe ich die Trennung noch halbwegs ein (ein Nahkämpfer feuert eben keine Projektile mit einem Autoattack und ein Fernkämpfer schlägt nicht auf den Boden), wobei ich auch das cool finden würde, wenn man diese auf beide Arten von Champions verwenden dürfte. Leider glaube ich, dass Riot eben diese Idee in Betracht ziehen wird und auch mehr und mehr einbringen wird. So ziemlich jedes RPG nutzt so ein System, das nach Klassen deine Items beschränkt, ich mag mich aber lieber frei entscheiden, was ich benutzen möchte.\n> \n> Auch glaube ich nicht, dass ADCs gerettet werden müssten, sondern für die Botlane so eine Art Dreieck der Macht entsteht (Bruiser&gt;ADC&gt;Tank&gt;Bruiser). Auch wenn das nicht so kommt, man sollte nicht vergessen, dass es schon überall metashifts gab, nur der ADC blieb verschont. Jetzt kann man da endlich mal Varianz reinbringen. \n> Sobald Yi generft wird, wird sich eh wieder einiges verschieben^^\n\nEs ist ja nicht nur Yi der generft werden müsste, dass fängt bei Katarina, Zed, Diana und Lux auch schon an.","replies":[{"poster":"Megamaexx","date":"2018-06-16T08:32:14.627+0000","up_votes":3,"down_votes":0,"body":"Diana könnte ein Rework vertragen, tot durch Point n Click in 0.1 Sekunde ist nicht so geil.\nDeine Nerf-Vorschläge klingen aber so, also ob du die nur frei aus dem Bauch heraus entschieden hast. Diana hat unter 50% Winrate und du forderst einen Nerf. Katarina und Zed sind bei 50%, was an sich doch genau richtig ist. Lux ist drüber, da ist Anpassungspotential. \n(Zahlen von hier:\nhttps://www.leagueofgraphs.com/de/champions/stats/lux )","replies":[{"poster":"Cenâreth","date":"2018-06-20T06:55:01.664+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Megamaexx,realm=EUW,application-id=Wj1wcocU,discussion-id=bAVu1F7E,comment-id=000200000000,timestamp=2018-06-16T08:32:14.627+0000)\n>\n> Diana könnte ein Rework vertragen, tot durch Point n Click in 0.1 Sekunde ist nicht so geil.\n> Deine Nerf-Vorschläge klingen aber so, also ob du die nur frei aus dem Bauch heraus entschieden hast. Diana hat unter 50% Winrate und du forderst einen Nerf. Katarina und Zed sind bei 50%, was an sich doch genau richtig ist. Lux ist drüber, da ist Anpassungspotential. \n> (Zahlen von hier:\n> https://www.leagueofgraphs.com/de/champions/stats/lux )\n\nDiana oneshotted im Mid-Lategame nach 2 Kills alles, dass kannst du nicht von der Winrate ablesen, die Winrate entsteht aus Pick-Rate und Können gewissermaßen.","replies":[]}]}]}]},{"poster":"OT Riku","date":"2018-06-15T23:16:58.788+0000","up_votes":3,"down_votes":0,"body":"Eine nicht schlechte Idee, aber dann könnte man kein Full AP malphite oder full AP galio oder oder oder mehr spielen.\nWas ist mit OffTanks bzw Bruiser wie irelia oder Jax.\nDarf ich mir dann kein defensives item mehr auf Diana kaufen.\nIch Spiele sie gerne gegen Zed und talon mit Ninja Tabis und Iceborn.\nAnsicht ist es keine schlechte Idee aber leider führt es genau zu dem was riot gerne vermeiden möchte. \nSie wollen ja das man so spielt wie es zu Deinem spielstil passt.\nBlödes Beispiel \nIm Aram habe ich mal ashe auf muramana W max gespielt mega witzig.\nKlar könnte man jetzt sagen ja bei aram kann man ja die items nicht beschränken.\n\nIch kann natürlich sagen ich versteh deine Idee dahinter leider wird es dann genau zu dem Punkt führen warum Riot die Runen geändert hat. \nWeil sie nicht wollten das es ein build für einen champion gibt und das wäre dann der Fall. \nWarum sollte ich nicht auf ezreal Iceborn kaufen dürfen. \nWarum sollte ich nicht auf einem Carry Rsnduins kaufen. \nWie gesagt ich verstehe deinen Ansatz aber leider sind es viele Faktoren die mehr ins negative gehen.","replies":[{"poster":"sN00Bdogg","date":"2018-06-15T23:29:15.381+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=OT Riku,realm=EUW,application-id=Wj1wcocU,discussion-id=bAVu1F7E,comment-id=0001,timestamp=2018-06-15T23:16:58.788+0000)\n>\n> Eine nicht schlechte Idee, aber dann könnte man kein Full AP malphite oder full AP galio oder oder oder mehr spielen.\n> Was ist mit OffTanks bzw Bruiser wie irelia oder Jax.\n> Darf ich mir dann kein defensives item mehr auf Diana kaufen.\n> Ich Spiele sie gerne gegen Zed und talon mit Ninja Tabis und Iceborn.\n> Ansicht ist es keine schlechte Idee aber leider führt es genau zu dem was riot gerne vermeiden möchte. \n> Sie wollen ja das man so spielt wie es zu Deinem spielstil passt.\n> Blödes Beispiel \n> Im Aram habe ich mal ashe auf muramana W max gespielt mega witzig.\n> Klar könnte man jetzt sagen ja bei aram kann man ja die items nicht beschränken.\n> \n> Ich kann natürlich sagen ich versteh deine Idee dahinter leider wird es dann genau zu dem Punkt führen warum Riot die Runen geändert hat. \n> Weil sie nicht wollten das es ein build für einen champion gibt und das wäre dann der Fall. \n> Warum sollte ich nicht auf ezreal Iceborn kaufen dürfen. \n> Warum sollte ich nicht auf einem Carry Rsnduins kaufen. \n> Wie gesagt ich verstehe deinen Ansatz aber leider sind es viele Faktoren die mehr ins negative gehen.\n\nIch trag das oben auch noch nach: Natürlich soll es in der überwiegenden Zahl Items geben, die von allen genutzt werden. Aber eben speziell für jeden Bereich einzigartige. Das hab ich versucht mit den \"Dorans\"-Gegenständen zu zeigen. Diese Spartengegenstände wären dann eben das \"Rädchen\" an dem man drehen könnte um Balance herbei zu führen.","replies":[{"poster":"Amycos Cyrus","date":"2018-06-16T19:54:24.552+0000","up_votes":1,"down_votes":0,"body":"Das wird aber nicht wirklich reichen, da man vor allem als die Lethality eingeführt wurde gesehen hat, dass es nicht um kleine Itemgruppen geht, sondern um die Funktion einzelner Champions mit bestimmten Stats.\n\n=> Ein gutes Beispiel ist Kayn (der übrigens durch den Morph von Base > Red, seine Klasse von Slayer nach Fighter ändert) auf der einen Seite benötigt er Zugriff auf Lethality, Armor-Pen, Movement, etc. (Blue-Kayn) auf der anderen Seite aber auch auf Armor, MR, Leben, Sustain, AS, etc. (Red-Kayn) und natürlich immer auf AD und CDR. Im Endeffekt kannst du ihn also gerade mal von den AP-Items ausschließen und dann war es das auch schon.\n=> Alternative haben wir aber auch Ivern, der durch seine Position als Jungler den Zugriff auf die Support-Items (Ardent Redemption etc.) nicht verlieren darf, da er mit Offensiven oder Defensiven Stats nicht viel anfangen kann. (Wobei AP-Attackspeed-Ivern extrem genial ist. XD)","replies":[]}]}]},{"poster":"Amycos Cyrus","date":"2018-06-16T19:42:43.656+0000","up_votes":2,"down_votes":0,"body":"> Wieso kann ein absoluter Nahkämpfer wie zB Tryndamere einen Bogen kaufen ?\n\nWeil es nur das Bild eines Items ist, dass Angriffstempo gibt. Man hat sich halt dafür entschieden, weil ein Boden die Thematik Angriffstempo am besten darstellt.\n\n> Wieso kann ein Fernkämpfer wie Asche einen Schild kaufen?\n\nWeil auch hier das Icon nur die beste Darstellung der erbrachten Stats darbietet. Wenn man es so nimmt hätte man auch das Icon der Stoffrüstung nehmen können. Und wenn du dir mal reale Bogenschützen der Historie anguckst, hatten sie auch immer schwache Rüstungen und weitere Waffen wie Dolche etc, um sich gegen Feinde zu schützen, die ihnen zu nah kamen oder ebenfalls über Reichweite verfügten.\n\n> Wieso kann ein AP-Supporter mit BF-Schwert, Dorans Schild und Dornenpanzer immer noch zaubern?\n\nWarum sollte er es denn nicht können? Ich meine du verlierst auch nicht die Fähigkeit zu Laufen, wenn du deine Schuhe ausziehst. Mir persönlich ist auch kein Spiel bekannt indem du Eigenschaften verlierst nur weil du Items anderer Eigenschaften baust.\n\n> Genau durch diese grundlegende (und eigentlich widersprüchliche) Konzeption ist das Balancing so verdammt schwer.\n\nEs sind nur Bilder. Riot könnte auch einfach alle Icons zu weißen Flächen mit farbigen Buchstaben und Zahlen ändern. Das würde die Funktion der Items ja nicht verändern und auch ihrer Käufer würde es nicht stören. Die Icons dienen nur der einfacheren Identifizierung, da man mit ihnen ein klares Struktur-Konzept verfolgt.\nSchwerter => AD\nBögen => Angriffstempo/Durchdringung\nHammer => Leben + AD\nStäbe => AP\nBücher => AP\nDolche => Angriffstempo\nRöcke => MR\nWesten => Armor\netc. ...\n\n> Will man der einen Gruppe der Champions einen Buff geben, bekommt automatisch eine andere Gruppe denselben Buff - mit oft \"wilden\" Auswüchsen.\n\nDu solltest jedoch nicht außer acht lassen, dass Riot ja nicht nur Items buffen/nerfen kann, sondern auch Runen, Fähigkeiten, Base-Stats, etc. ...\n\n> Man stelle sich vor es gäbe gruppenbezogene Items.\nSortiert nach Fernkämpfer / Nahkämpfer / Magier / Assasine / Tanks und daneben allgemein erhältliche Items.\n\nHier kommen wir zu einem großen Problem. Welche Stats sollten diese \"Gruppenbezogenen Items\" exklusiv vergeben und welche stehen über die \"allgemein verfügbaren Items\" zur Verfügung.\nHierzu ein paar Beispiele:\n\nCrit: Kann nicht exklusiv auf Fernkämpfer limitiert werden, da es ja auch noch Yasuo, Tryndamere, Yi, Garen, Shaco und Pantheon gubt, deren Schaden (von Fähigkeiten) mit Crit-Chance skaliert.\nSpellvamp: Kann nicht nur an Mages gehen, da offensive magische Champions, wie die AP-Assassins und Spezialfälle wie Mordekaiser ebenso mit diesem Stat arbeiten \"wollen\".\nTrinity: Kann nicht an Nahkämpfer gebunden werden, da es Champions gibt (e.g. Ezreal) die es als Fernkämpfer bauen.\netc. ...\n\n> Dann würde ein ADC mit Dorans Bogen starten und ein Tryndamere mit Dorans Schwert;\nder Magier mit Dorans Ring und der Tank mit Dorans Schild. Die anderen Items wären für diesen Typ Champion gesperrt!\n\n 1. Wenn zum Beispiel alle ADCs mit AD + Leben + Lifesteal anfangen, wie sollen dann Konzepte wie AP-Ezreal, Kai'Sa, teilweise Jhin etc. (Bauen aktuell Dorans Ring) erhalten bleiben? Ist es nicht sinnfrei Champions in ihren Möglichkeiten so stark zu beschränken, dass man einzelne bereits allein durch diese Beschränkungen \"löscht\"\n 2. Was machen Champions die nicht in dieses Schema passen?\n 3. Wenn du (in diesem Fall) die Fähigkeit der Adaption von Grund auf eliminierst, erzwingst du damit die Dominanz einzelner Klassen. Wie würdest du also Möglichkeiten der Adaption alternative umsetzen?\n\n> Weiterführend gilt dieses Prinzip natürlich auch für Rekursivbogen oder BF-Sword oder Zauberstab etc.\n\nAuch hier wieder fragwürdig, da BF von allen außer Mages gebaut wird. (Allein schon wegen GA), Zauberstarb wird auch auf Hybriden ADCs benötigt (Guinsoos) und der Rekusivbogen ist bei Offtanks wegen dem BotrK notwendig.\n\n> Items wie Eifer sollten jedem zur Verfügung stehen, der weitere Ausbau jedoch wieder gruppenbezogen.\n\nDas ist übrigens schon eingeschränkt der Fall. Runaans ist auf Fernkämpfer beschränkt. Die anderen 3 sind wiederum nicht sinnvoll auf eine Klasse o.Ä. zu limitieren, da auch einzelne Melees zum Beispiel die volle Reichweitenerhöhung der RFC nutzen können. (Rengar, GP, Ekko, Wukong etc.)\n\n> Natürlich muss es für ADC etwas vergleichbares zum BF-Sword geben, aber dann legt man eben einen Beste-Freunde-Bogen auf; mit ähnlichen Kosten und Werten.\n\nDas ist der Grund, weshalb es derartige Konzepte nie geben wird. Riot versucht den Pool an Items auf einem \"überschaubaren\" Maß festzuhalten, um den Spielern die Übersicht zu ermöglichen. Items mit unterschiedlichem Auftreten und vergleichbarer Funktion (vor allem bei den Basic-Items und den Tier 1 Ausbauten) sind dahingehend nicht sinvoll und werden daher nicht eingeführt. (Warum auch? XD)\n\nHierzu hat Riot sich mit ihrem Post zur Shop-Überarbeitung geäußert:\nhttps://euw.leagueoflegends.com/de/news/game-updates/gameplay/handler-optimierung\nDort heißt es:\n\"Welche Gegenstände sollten wir entfernen? - Gegenstände, die einem anderen Gegenstand zu stark ähneln\"\n\n> Aber vor allem gibt es den Entwicklern ein Werkzeug an die Hand mit dem sie sehr leicht nach-balancieren können.\n\nIch würde das sehr bezweifeln. Denn das Spiel ist \"Gott sei dank\" nicht nur um Champions und gar nicht um Klassen aufgebaut. Die einzige Position, in der nicht alle Klassen gespielt werden ist die ADC-Position.\nHier mal Beispiele, wenn man das klassische 6 Klassenkonzept nutzt. (Alternativ könnte man das 12 Attributekonzept nutzen) In beiden Fällen existieren unklassifizierte Champions, die ich gesondert angebe:\n\n- Toplaner: \n - Tank: {{champion:516}} \n - Fighter: {{champion:164}} \n - Slayer: {{champion:114}} \n - Controler: {{champion:43}} (Aktuell etwas aus der Meta gefallen)\n - Marksman: {{champion:236}}\n - Mage: {{champion:126}}\n - Unklassifiziert: {{champion:133}} \n- Jungler: \n - Tank: {{champion:113}} \n - Fighter: {{champion:64}} \n - Slayer: {{champion:141}} \n - Controler: {{champion:427}} \n - Marksman: {{champion:203}} \n - Mage: {{champion:68}}\n - Unklassifiziert: {{champion:104}} \n- Midlaner:\n - Tank: {{champion:3}} \n - Fighter: {{champion:39}}\n - Slayer: {{champion:238}} \n - Controler: {{champion:25}} \n - Marksman: {{champion:42}} \n - Mage: {{champion:134}}\n - Unklassifiziert: {{champion:268}} \n- ADC:\n - Tank: Keiner\n - Fighter:  keiner\n - Slayer: Keiner\n - Controler: {{champion:202}} (Einziger, Zugleich Marksman)\n - Marksman: {{champion:22}} \n - Mage: {{champion:110}} (Auch wenn ich selbst sehr verwundert bin, dass er als Mage/Marksman gezählt wird) Alternative: {{champion:115}} \n - Unklassifiziert: Keiner\n- Support:\n - Tank: {{champion:44}} \n - Fighter: {{champion:48}} \n - Slayer: {{champion:555}} \n - Controler: {{champion:412}} \n - Marksman: {{champion:21}} \n - Mage: {{champion:90}} \n - Unklassifiziert: {{champion:26}}\n\nQuelle: [LoL-Wikia/Attribute](https://leagueoflegends.fandom.com/wiki/Champion_classes)\nDieses extreme Ungleichgewicht wird der  Position des ADCs momentan zum Verhängnis, da nur Marksmen in der \"Gesellschaft\" als ADC anerkannt sind. Anders als die anderen Positionen scheint es verbreitet zu sein die Position des ADCs nicht durch seine Funktion zu definieren, sondern durch die CHampions die sie ausfüllen \"sollen\", was extremst fragwürdig und sinnentleert ist.\nWenn man jedoch ganz different betrachten möchte ist der ADC nur eine sehr dominante Funktionsgruppe, die die Position des \"farmenden Botlanes\" inne hat. Also entspricht der ADC eher dem APC oder Splitpusher und somit nicht einmal einer Position, sondern nur einer ersetzbaren Variable.\n\nAus diesem Grund ist es für Riot möglicherweise gar nicht so sinnvoll die ADCs zu buffen, da \"endlich\" der Umschwung eingetreten ist, die ADC-Funktionsgruppe auch als solche zu betrachten und somit neue Compositionen zu ermöglichen, sowie eine tatsächlich Definition der \"farmenden Botlane\"-Position zu etablieren, so wie es bereits für den Midlaner (APC, Roaming-Assassin etc.), den Toplaner (Splitpusher, Teamfight-Tank, Teamfight-Offtank, Engager etc.), etc. ... vor \"langer\" Zeit passiert ist.\n\n> Was denkt ihr über solche gruppenbezogenen Items?\n\nIch finde die Idee nicht sonderlich gut, würde aber eine Positionsbezogene Variante bezüglich des Supports erhoffen, sodass Supporter (wie bereits Jungler) auf einen kleinen (möglicherweise Beschränkung auf 1 Item pro Champion, wie die Jgl-Items) Pool von Items Zugriff haben, der verhindert, dass Supporter zu sehr unter Spezialfällen leiden. (e.g. Shurelyas-Vladimir oder -SInged)\nAnsonsten würde ich jedoch den allgemeinen Zugriff auf alles Items bevorzugen. (Ausnahmen, wie Runaans, Tiamat (+Ausbau) und Steraks finde ich, solange nicht zu oft verwendet, akzeptabel)\n\n> Es ist dann immer noch \"so viel\" im Shop, daß man auch völlig ohne diese Spezial-Items Fullbuild werden könnte, was man jedoch aufgrund der \"einzigartigen\" Eignung für diese Gruppe und der Nützlichkeit bzw Stärke nicht tun würde.\n\nIch bezweifel, dass ein so kleiner Pool an Items das Balancing wirklich vereinfachen würde. (Vor allem das Balancing für Mid und Lategame. Early-Balancing mittels Startitems ist nachvollziehbar.)\n\n{{sticker:sg-miss-fortune}} \n\nPS: Entschuldigung für den hohen Umfang der Antwort XD","replies":[{"poster":"sN00Bdogg","date":"2018-07-03T22:31:15.255+0000","up_votes":1,"down_votes":2,"body":"Hast Dir echt viel Mühe gegeben. \nLeider hast du in allem nur gesagt \"JA SO ISSES\"\nLeider hast du nicht verstanden, dass ich genau das ändern wil\nLeider hast Du garnicht verstanden worauf mein Vorschlag abzielt\nLeider hast du so rein garnix geblickt\n\nWünsche Dir noch viel Spass bei LOL ;)","replies":[{"poster":"Amycos Cyrus","date":"2018-11-18T14:16:21.429+0000","up_votes":1,"down_votes":0,"body":"Hast ja in 5 Monaten noch keine Ergänzung deines Posts erbracht, sodass ich davon ausgehe, dass du einfach mit den gegebenen Umständen deine Position nicht mehr halten konntest und aufgegeben hast.\n\nOb du nun meine Antwort verstanden hast oder nicht kann mir jetzt auch egal sein.","replies":[]},{"poster":"Amycos Cyrus","date":"2018-07-04T06:15:55.984+0000","up_votes":1,"down_votes":0,"body":"> Hast Dir echt viel Mühe gegeben.\n\nNicht wirklich. War nur so, was mir in den Sinn kam, bei dem Headpost.\n\n> Leider hast du in allem nur gesagt \"JA SO ISSES\"\n\nIch würde das nicht so sagen. Es ist eher ein \"JA SO ISSES, WEIL ...\", im Endeffekt habe ich in den wesentlichen Aspekten und fundamentalen Argumenten auch einen Grund hinterlassen und sogar nahe gelegt, wie es zu der aktuellen \"Bebilderung\" gekommen ist bzw. Weshalb einzelne Aspekte des Konzeptes keine Verbesserung des Balancings etc. zur Folge haben können.\n\n> Leider hast du nicht verstanden, dass ich genau das ändern will\n\nIch habe in den knapp 2 Jahren, die ich hier im Forum zugange bin, aufgegeben, in Kommentare und Headposts noch etwas hinein zu interpretieren. Ich kann mich nur auf den von dir verfassten Text beziehen, den ich zur näheren Analyse und exakteren Zuordnung sogar in großen Teilen zitiert habe. Wenn du etwas anderes bezweckst, als das was du in deinem Post geschrieben hast, werde ich dich definitiv nicht davon abhalten, deinen Post in dieser Hinsicht zu korrigieren.\n\n> Leider hast Du garnicht verstanden worauf mein Vorschlag abzielt\n\nDann schreib es doch einfach mal auf. XD Ich meine, was erhoffst du dir denn von einer derartigen Diskussion, wenn du nicht mal aufschreibst, worauf deine Idee eigentlich aus ist. Ich habe mich in erster Linie nur darauf beziehen können, dass die von dir erwähnte die Itempool-Anpassungen zum Zweck des Balancings existieren soll, wobei ich sowohl diesen Aspekt in meinem Kommentar berücksichtigt habe, als auch erklärt habe, auf welchen Grundlagen es aktuell existiert.\n\n> Leider hast du so rein garnix geblickt\n\nFreut mich, dass du deine Meinung nicht formuliert hast, wenn es bei einem derartig langen Post noch möglich ist, dass eine Satz für Satz Beantwortung noch \"nix blicken\" kann. Erklär doch mal einfach was du willst XD\n\n> Wünsche Dir noch viel Spass bei LOL ;)\n\nWünsch ich dir auch.","replies":[]}]},{"poster":"Nordwolf87","date":"2018-06-18T13:16:30.046+0000","up_votes":1,"down_votes":0,"body":"Slayer support: {{champion:555}}  :)","replies":[{"poster":"Amycos Cyrus","date":"2018-06-19T15:48:32.051+0000","up_votes":1,"down_votes":0,"body":"Pyke ist, wie ich davor erwähnt habe nicht als Slayer sondern Controller kategorisiert. Somit als alternativ zu Thresh in der Liste anführbar.\n\nKorrektur vom 27.2.19 Pyke ist inzwischen zum Assassin umgeordnet worden. Daher ein Slayer.","replies":[]}]}]},{"poster":"Cenâreth","date":"2018-06-16T06:31:04.854+0000","up_votes":2,"down_votes":1,"body":"Dass Relic Shield jahrelang so OP gewesen soll, auf die ADC Meta zurückzuführen ist, finde ich irgendwie lustig.\n\nFakt ist dass Relic Shield in Kombination mit Overheal zu strong war. In der alten Mastery zu vor hat es dass nicht gegeben sonst hätte man damals schon Relic Shield bauen können.\n\nZu den Starter Items.\n\nWarum sollte man da etwas ändern wenn man genau diese Flexibilität in den Starter Items hat die man gerne bei den Runen hätte?\n\nDorans Ring ist nach wie vor ein gutes Starter Item für Mages oder Champs die sehr flexibel sind wie MF (ihre E z.B. ist AP), gerade bei MF war es seit Beginn der Season absolut geil die E zu abusen um halt mit der E richtig schön poken zu können und den Gegner zum großteil nerven zu können. Denn der Slow wird ja mit jeder Stufe stärker.\n\nDorans Blade wird halt genutzt wenn man keine Probleme mit farmen hat, dafür finde ich Dorans Shield absolut Anfängerfreundlicher, gerade auf Champs wie Xayah, wo du sonst keine anderen Möglichkeiten hast, ist dass Item doch ganz okay (??).\n\nChamps mit hoher Base AD/AP zu Beginn starten doch sowieso mit Cull (Ashe, Kai'Sa, Vayne). Warum sollte man also da aktuell was ändern?\n\nWir haben aktuell andere Baustellen worüber man sich kümmern sollte, die nennen sich ADC, Oneshot Assassins und Bruisers.","replies":[{"poster":"Amycos Cyrus","date":"2018-06-16T19:57:14.313+0000","up_votes":1,"down_votes":0,"body":"{{sticker:slayer-pantheon-thumbs}}\n\n> Wir haben aktuell andere Baustellen worüber man sich kümmern sollte, die nennen sich ADC, Oneshot Assassins und Bruisers.\n\nDarauf zielt der Post ja ab, Anpassung einzelner Klassen (Slayer (inkl. Assassin) Fighter (inkl. Bruiser) und Marksmen durch gezieltes Trennen der Items und somit Buffen oder Nerfen von klassenexklusiven Items.\n\nGrundsätzlich stimme ich dir jedoch zu, dass andere Wege gegangen werden sollten. (müssten)","replies":[]}]},{"poster":"SilvaxStar","date":"2018-06-20T11:26:08.951+0000","up_votes":1,"down_votes":0,"body":"Ich weiß nicht warum Riot nicht selbst auf so was kommt, aber das ist eigentlich echt eine gute Idee. Wenn man das so machen würden wären viele Troll Builds nicht mehr vorhanden, okay manchen möge es den Spaß man  Spiel nehmen, aber das ist eigentlich echt gut. \nEs würden sich einfach so viele Probleme lösen. Dass muss ja nicht für alle Items gelten, aber für bestimmte Items macht es Sinn. Warum sollte ein ADC z.B {{item:3190}}  oder {{item:3504}} bauen können? Warum sollten Champs die nicht heilen können heal und shield verstärkende Items bauen können? Die können doch gar nicht andere heilen, wo zu also? Bei den Items geht es ja nicht darum sich selbst zu heilen wie bei {{item:3065}} .\nIch stimme dir zu, dasss hat für mich auch noch nie Sinn ergeben. \n\nFinde deine Idee echt gut, auch wenn es durch aus nicht unkompliziert ist. Bewerb dich doch mal bei Riot, so viel Stress wie die mit der Community jetzt haben können die Leute gebrauchen. (Ja es gibt da viele Probleme, aber das Grundprinzip, von der Idee, ist einfach gut)","replies":[]},{"poster":"khamzat2000","date":"2018-06-16T06:31:16.069+0000","up_votes":1,"down_votes":7,"body":"***","replies":[{"poster":"Angel Ayume","date":"2018-06-26T09:34:10.115+0000","up_votes":2,"down_votes":0,"body":"Was verstehst du denn bitte unter richtig arbeiten?\nRein körperliche Arbeit? Oder zählst du auch Jobs dazu, wo die Menschen 8 Stunden pro Tag in einem Büro vor einem Pc sitzen?","replies":[]}]}]}