{"poster":"sabonav","date":"2015-12-20T17:06:08.408+0000","title":"WAS IST SCHLIMMER ? FEEDER ODER FLAMER?","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":23,"body":"Da ich selbst doch des &ouml;fteren mein maul aufrei&szlig;e weil wieder mal jemand 0/10 steht frag ich mal die comunity\r\n\r\nWas findet ihr schlimmer ein Flamer der weis wie man spielt und sich wieder mal &uuml;ber das unverm&ouml;gen der anderen aufregt\r\n\r\noder ein Feeder der das Game ruinirt weil er zu dumm ist 2 sec am tower zu stehen oder nicht jeden Busch Facezuschecken \r\n\r\nich mein ich hab nichts gegen nen Flamer der seine lane Gewinnt da er ja alles f&uuml;r den sieg tut und anscheinend weis wie man spielt Feeder allerdings \r\ngehen mir auf den Geist weil man seine lane Gewinnen kann wie man will und nur ein Feeder schafft es oft genug das game zu ruiniren .....","replies":[{"poster":"eingew","date":"2015-12-20T17:15:18.691+0000","up_votes":8,"down_votes":0,"body":"Den Feeder kann ich durch Lob und gutes zureden dazu bringen, umsichtiger zu spielen. Der Feeder kann auch noch im Lategame das Game drehen, wenn er sich wieder anstrengt.\n\nDer Flamer verschwendet seine eigene Zeit mit tippen und stiftet andere dazu an. Der Flamer ist überflüssig nervig und verschwendet meine Zeit, weil ich erst den Mutebutton nutzen muss. Der Flamer senkt die Moral und sorgt dafür, dass ich neben ihm auch noch Feeder oder andere Flamer im Team habe. Wenn ich es mit dem Flamer ins Late schaffe sinken die Chancen nur umso weiter, weil der sich seltener beruhigt und dann erst noch zu einer guten Moral überredet werden müsste.\n\nErgo ist der Flamer weitaus schlimmer als der Feeder, weil der Feeder alleine ist, während der Flamer versucht sich prinzipiell möglichst viele Verbündete zu schaffen, die mit ihm, absichtlich oder unabsichtlich, das Spiel versauen.\nFeeder gewinnen öfter und sind deutlich angenehmere Zeitgenossen. Und selbst verlieren tue ich lieber mit einem ganz normalen Feeder, als mit einem Flamer.","replies":[{"poster":"sabonav","date":"2015-12-20T20:58:08.092+0000","up_votes":1,"down_votes":7,"body":"ein flamer senkt bei mir nie die moral .... feeder schon \naber da ticken meinsche wohl anders\n\nichdenke flamer kann ich muten : feeder leider nicht aus dem spiel kicken ( zumindest hören die meisten supporter wenn ich sie von der lane kicke weil sie keinen blitz dodgen können\n","replies":[{"poster":"Metalmonni","date":"2015-12-21T08:43:04.497+0000","up_votes":4,"down_votes":0,"body":"So ziemlich alle Flamer die ich je gesehen habe, konnten ein Spiel nicht carrien. Warum? Sie waren einfach im Late zu sehr damit beschäftigt, mitten auf der Lane zu stehen und dem Gegner ihr Leid zu klagen, dass sie viel lieber das Team wechseln wollen. Währenddessen tun sie nichts, werden gekillt, ziehen die Moral runter (auch mit mute) etc... Und dann kommt so was Feines wie: \"I have to write this, because you are so bad...\". Jop, toller Mitspieler.\n\nComebacks von schlechten Spielern hab ich hingegen sehr oft beobachten dürfen.","replies":[{"poster":"Sirrkas","date":"2015-12-21T15:07:29.883+0000","up_votes":5,"down_votes":0,"body":"Ich erinnere mich an ein Spiel, bei dem ich Jagd auf einen Flamer gemacht habe. War irgendwann Season 2 oder 3. Nidalee (Ich) und Varus Botlane. Gegner hatten Vayne und Leona. Leona war afk, wir (Level 3) schießen unsere Skillshots auf Vayne, sie rollt weg und Leona geht rein. Zuerst wollte ich noch sowas wie \"sry\" schreiben. Als die Leona aber vor mir etwas darüber geschrieben hat, wie unfähig und asozial wir wären, dachte ich mir, Flamer wollen sterben. Hab also den Kill geholt, während sie reglos mitten  in der Lane stand. \n\nDie hat dann natürlich das ganze Spiel über weiter geflamt und gejammert, wie unfair wir wären. Aber ich hatte selten so viel Spaß, wie in dem Spiel. Es gibt einfach nichts besseres als Flamern ein paar Tode zu bescheren.","replies":[{"poster":"Metalmonni","date":"2015-12-21T17:27:03.276+0000","up_votes":2,"down_votes":0,"body":"Ein Up für dich für das Schmunzeln, das du mir entlockt hast ^^","replies":[]}]}]}]},{"poster":"OSaftKiller","date":"2015-12-20T17:33:14.394+0000","up_votes":3,"down_votes":0,"body":"Feeder der das Spiel (mitunter gedreht hat:D)\n\nhttp://matchhistory.euw.leagueoflegends.com/de/#match-details/EUW1/2437620806/211093753\n\nWar ein ziemlich beschissenes Spiel von mir, aber habs gegen Ende dann noch geschafft mich zusammen zu reißen und etwas zu reißen, süpiel aber auch selten ADC. Wär glaub nicht drin gewesen, wenn  ich Toxische Mitspieler im Team gehabt hätte, oder zumindest wäre es sehr schwer geworden.\n\nAn sich hasse ich flamer bzw. toxische Spieler, die zerstören einem selbst Spiele die gut laufen. Da ich selber kein guter Spieler bin, würde ich nie über einen anderen Mitspieler schlecht reden, da ich selber nichts besonderes drauf habe. Sonst wär ich glaub nicht Silber |||:D","replies":[]}]},{"poster":"Patty91","date":"2015-12-20T17:49:52.478+0000","up_votes":9,"down_votes":1,"body":"> [{quoted}](name=sabonav,realm=EUW,application-id=KYnfKGf0,discussion-id=Qn2avtTs,comment-id=,timestamp=2015-12-20T17:06:08.408+0000)\n>\n> Da ich selbst doch des &ouml;fteren mein maul aufrei&szlig;e weil wieder mal jemand 0/10 steht\n\nhttp://matchhistory.euw.leagueoflegends.com/de/#match-details/EUW1/2266498134/217590082?tab=overview\nhttp://matchhistory.euw.leagueoflegends.com/de/#match-details/EUW1/2266145218/217590082?tab=overview\nhttp://matchhistory.euw.leagueoflegends.com/de/#match-details/EUW1/2266004821/217590082?tab=overview\nhttp://matchhistory.euw.leagueoflegends.com/de/#match-details/EUW1/1902305625/217590082?tab=overview\n\nFindest du es nicht ein wenig lächerlich, dass gerade DU die Fresse aufreißt, wenn jemand anderes mal feedet?","replies":[{"poster":"sabonav","date":"2015-12-20T20:55:40.630+0000","up_votes":1,"down_votes":10,"body":"hab nur das erste aufgemacht und  1 war ich da supporter  :D  2 tens ist es vom 26/8  \nund drittens hab ich von feeden geredet 1/5/2 ist kein feeden    es gibt situationen in denen man einfach stirbt ( natürlich durch eigene fehler )\naber   wenn man 5 mal gestorben ist muss man net weiter feeden was ich auch nicht mache ka welche matches du rausgesucht hast aber ich sterbe in 99% der games nicht öfters wie 5 mal bis min 30 ( will ja net übertreiben und das late game dreht eh alles )\n\naußerdem war ich supporter und mein adc stand 1/9 da ist auch die frage ob es meine schuld war das ich 1/5 als sup stand : wenn dein adc rekt kannste nihct immer entkommen \n\ndeswegen hab ich die anderen spiele nicht angeschaut ich weis das ich selbst ( als gold spieler ) nicht / fast nie gegen selbst dia spieler feede ( ja ich verliere  die lane und fall im farm zurück ) aber ich feede nicht da ich weis wann ich wo zu stehen hab","replies":[{"poster":"Sirrkas","date":"2015-12-21T15:01:52.627+0000","up_votes":4,"down_votes":0,"body":"Du hast auf dem Account seit Monaten nur ARAMs gespielt und bist Silber 5. Beides spricht nicht gerade dafür, dass du eine Ahnung von SR hast, Gold bist oder dadurch berechtigt bist andere zu flamen, wenn es in einem ARAM nicht so gut läuft.","replies":[{"poster":"sabonav","date":"2015-12-21T15:18:55.928+0000","up_votes":1,"down_votes":4,"body":"es gibt nen grund warum ich mich extra auf meinem smurf angemeldet hab :)   und die arams hab  ich nur wegen ep boost gespielt :) \n\n\nund wenn ich nicht das recht zu flamen habe warum habt ihr das recht zu feeden ?","replies":[{"poster":"Sirrkas","date":"2015-12-21T15:23:40.680+0000","up_votes":5,"down_votes":0,"body":"Weil schlecht spielen nicht gegen die Regeln verstößt, ist es nicht verboten zu feeden. Verboten ist erst absichtliches Feeden. Das wäre dann bewusstes trollen der Mitspieler. Das wären dann Dinge wie Disco-Nunu, Leute die absichtlich in Gegner laufen um zu sterben und Anivias, die dir ständig absichtlich den Fluchtweg versperren.\n\n>es gibt nen grund warum ich mich extra auf meinem smurf angemeldet hab \n\nIch schätze mal der Grund ist ein Forenbann oder extrem schlechte Stats, die von den meisten schon als absichtliches Feeden angesehen werden würden.","replies":[{"poster":"sabonav","date":"2015-12-21T15:38:14.867+0000","up_votes":1,"down_votes":4,"body":"nein es ist der grund das der main acc mit ne m fknn youtube kanal verknüpft ist und ich mich in dem trade der wie du siehst ( leider ) gegen mich spricht ( oder gegen euch der flamer liegt bekant richtig :P ) nicht outen wollte :) mein lieber ?irrkas","replies":[{"poster":"Sirrkas","date":"2015-12-21T16:16:55.884+0000","up_votes":2,"down_votes":0,"body":"Keine Angst, das würde deinem Channel sicher nicht schaden. Ich glaube nicht, das sich hier jemand die Mühe machen würde, deinen Channel zu stalken. Und selbst wenn. Deine Zuschauer wissen sicher schon, dass du ein Flamer bist, wenn das da welche schreiben, hast du sicher keinen Schaden davon.","replies":[{"poster":"sabonav","date":"2015-12-21T17:26:34.244+0000","up_votes":1,"down_votes":1,"body":"1 nein und \n2tens hat noch niemand gesagt das ich ein flamer bin :D weder hab ich auf den acc je nen bann gehabt noch nutze ich den chat häufig\nder grund für den Thread war gewesen das ich selten Flamer reporte aber das reporten für Unskillet player nicht mehr möglich ist was ich wesentlich lieber nutze :)\n\nedit: hatte vor nem jahr nen afk bann","replies":[{"poster":"Sirrkas","date":"2015-12-21T17:28:12.035+0000","up_votes":5,"down_votes":0,"body":">Da ich selbst doch des öfteren mein maul aufreiße weil wieder mal jemand 0/10 steht frag ich mal die comunity\n\nWenn das keine nette Umschreibung für Flamen ist, weiß ich auch nicht weiter.\n\nEdit: \nWie Metalmonni schon sagte, ist schlecht Spielen kein Grund bestraft zu werden. Wenn schlecht spielen bestraft werden würde, müssten erst alle Bronzespieler, dann alle Silberspieler, dann du und die anderen Goldspieler, dann die Platinspieler, dann die Diaspieler, die Master und Challenger und dann die professionellen Spieler gebannt werden. Es gibt immer jemanden der schlecht oder schlechter spielt, bis irgendwann keiner mehr da ist. ","replies":[{"poster":"sabonav","date":"2015-12-21T17:37:31.191+0000","up_votes":1,"down_votes":2,"body":"es ist eine umschreibung und trotzdem hab ich weder nen bann erhalten, noch ist meine freundesliste voll ( was ja auch gegeǹ nen andaurnt flamenden spricht)\nich reiße mein maul auch mal auf wie oben geschrieben :  \naber solang ich keinen bann erhalte behalte ich mir das recht vor nicht als Flamer zu gelten :)\n\n\nund ja im thread hab ich das geschrieben schlicht aus dem grund,\ndas wenn ich geschrieben hab ich kann feeder nicht mehr reporten\nich nicht die antworten bekommen hätte die ich wollte:\n\nWarum das eine oder andere als weniger schlimm betrachtet wird • \n\nAber sobald ich einen bann bekomme geb ich dir gerne bescheit und du kannst mich offiziell als Flamer beschimpfen","replies":[{"poster":"Sirrkas","date":"2015-12-21T17:54:51.389+0000","up_votes":3,"down_votes":0,"body":"Schön zu hören, dass du noch nicht bestraft wurdest. Im Kombination mit dem Threadthema sah ich aber keine andere Interpretationsmöglichkeit. \n\n>noch ist meine freundesliste voll ( was ja auch gegeǹ nen andaurnt flamenden spricht)\n\nWas hat eine volle Freundesliste damit zu tun, dass man Flamer ist? Ich sehe keinen Zusammenhang bei \"volle Freundesliste => Flamer\".","replies":[]}]}]},{"poster":"Metalmonni","date":"2015-12-21T17:32:28.549+0000","up_votes":2,"down_votes":0,"body":"Der \"unskilleld Player\" Report war damals nur vorhanden, damit Leute wie du, die sich über schlechte Spieler aufregen, ein Ventil zum Druck ablassen hatten und nicht die \"echten\" Reportgründe dafür benutzen. \n\nDer Grund wurde (völlig zurecht) entfernt, damit nicht der Eindruck bekräftigt wird, schlechtes Spielen sei tatsächlich strafbar. Das war es nämlich nie und somit war auch dieser Report damals absolut wirkungslos.","replies":[{"poster":"sabonav","date":"2015-12-21T17:41:16.043+0000","up_votes":1,"down_votes":4,"body":"Vll ein Grund den Button da zu lassen immerhin hilft es .\nund egal wie wirkungslos es war ( ich hatte die hoffnung das bei genug reports die mmr sinkt ) \ntut es gut etwas gegen den der dir das game verloren hat ( ich schreib extra verloren weil ich immernoch mein das ein flamer dir das incht verliert mute button op)\netwas in der hand zu haben","replies":[{"poster":"franticFurball","date":"2015-12-22T21:39:31.783+0000","up_votes":3,"down_votes":0,"body":"Nur...du hattest nichts in der Hand. Der Knopf war einfach da und hat NICHTS gemacht. Nein, auch keine senkung des MMR.\n\nDer \"Unskilled Player\" - Button war die digitale Version des Kopfkissens in das du reinbrüllen darfst.","replies":[{"poster":"eingew","date":"2015-12-23T06:50:47.181+0000","up_votes":1,"down_votes":0,"body":"Naja, in Ausnahmefällen konnte auch dieser Button für eine Strafe sorgen.","replies":[{"poster":"Metalmonni","date":"2015-12-23T21:08:31.005+0000","up_votes":1,"down_votes":0,"body":"In welchen Fällen? Und was für Strafen gab es dafür? Und warum wurde er dann rausgenommen? Interessiert mich :).","replies":[{"poster":"Sirrkas","date":"2015-12-23T23:56:01.315+0000","up_votes":4,"down_votes":0,"body":"Wenn ein einzelner Spieler wirklich sehr, sehr häufig darüber gemeldet wird, könnte es sein, dass sich Riot das einmal genauer ansieht. Ich weiß aber nicht ob oder wie oft so etwas vorgekommen ist.","replies":[]}]}]}]}]}]}]}]},{"poster":"SorisDynasty","date":"2015-12-21T16:02:35.052+0000","up_votes":3,"down_votes":0,"body":"Der Flamer liegt bekanntlich falsch.","replies":[]}]},{"poster":"Shiggyvara","date":"2015-12-21T15:32:21.785+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sirrkas,realm=EUW,application-id=KYnfKGf0,discussion-id=Qn2avtTs,comment-id=00020000000300000000,timestamp=2015-12-21T15:23:40.680+0000)\n>\n> Ich schätze mal der Grund ist ein Forenbann oder extrem schlechte Stats, die von den meisten schon als absichtliches Feeden angesehen werden würden.\n\nOffensichtlicher Eloboost wär auch noch ne Möglichkeit :)","replies":[{"poster":"sabonav","date":"2015-12-21T17:30:58.058+0000","up_votes":1,"down_votes":3,"body":"Das macht sinn gerade bei dem thema :) \n\nok ich gebs zu ich hab mich nach challanger boosten lassen und bin  abgestiegen da mein team meinte feeden zu müssen ...\nhatte aber selbst   meist positive stats :)  ( ok einmal stand ich 1/3  aber das zählt nicht da mein junger nicht gegankt hat :)\n\naber mein acc istnihct gebannt sondern nach korea transveriert  weil wegen noobs :)","replies":[{"poster":"Santas hoe","date":"2015-12-22T18:09:51.897+0000","up_votes":2,"down_votes":0,"body":"Ich habe alles richtig gemacht und immer wenn ich was falsch gemacht hab oder wir verloren haben, waren andre schuld\n\nDas dürfte doch etwa das sein was du damit sagen willst, oder? Du solltest, wie maxim mal sagte, deine Fehler bei dir und nich bei andren suchen.","replies":[]}]}]}]},{"poster":"Santas hoe","date":"2015-12-22T18:05:10.459+0000","up_votes":2,"down_votes":0,"body":"Die meisten Leute feeden ja nich absichtlich rein. Ich persönlich hatte schon oft genug schlechte stats gehabt, was dann immer daran lag, das ich recht häufig plötzliche gegnerische ganks bekommen habe oder beim versuch, meine mates zu retten recht oft gestorben bin. Ich bin schon oft genug nen mate mit gutem escape nachgerannt. Als wir plötzlich umzingelt waren, kam er davon und ich nich. Bin v.a. Als sup anfällig für sowas. Feeden ist nicht umbedingt schlecht spielen. Flamen allerdings tut man, weil man es will. Ob man dazu provoziert wird oder nich is egal. Deshalb is Flamen um einiges schlimmer wie ich finde.","replies":[]}]},{"poster":"franticFurball","date":"2015-12-22T21:36:36.979+0000","up_votes":2,"down_votes":0,"body":">oder dadurch berechtigt bist andere zu flamen, wenn es in einem ARAM nicht so gut läuft.\n\nMal ganz davon abgesehn dass sowieso nichts einen flame rechtfertigt.","replies":[]}]},{"poster":"Darkr3sQ","date":"2015-12-21T10:37:30.534+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=sabonav,realm=EUW,application-id=KYnfKGf0,discussion-id=Qn2avtTs,comment-id=00020000,timestamp=2015-12-20T20:55:40.630+0000)\n>\n> hab nur das erste aufgemacht und  1 war ich da supporter  :D  2 tens ist es vom 26/8  \n> und drittens hab ich von feeden geredet 1/5/2 ist kein feeden    es gibt situationen in denen man einfach stirbt ( natürlich durch eigene fehler )\n> aber   wenn man 5 mal gestorben ist muss man net weiter feeden was ich auch nicht mache ka welche matches du rausgesucht hast aber ich sterbe in 99% der games nicht öfters wie 5 mal bis min 30 ( will ja net übertreiben und das late game dreht eh alles )\n> \n> außerdem war ich supporter und mein adc stand 1/9 da ist auch die frage ob es meine schuld war das ich 1/5 als sup stand : wenn dein adc rekt kannste nihct immer entkommen \n> \n> deswegen hab ich die anderen spiele nicht angeschaut ich weis das ich selbst ( als gold spieler ) nicht / fast nie gegen selbst dia spieler feede ( ja ich verliere  die lane und fall im farm zurück ) aber ich feede nicht da ich weis wann ich wo zu stehen hab\n\nKein Problem, mach ich das für Dich:\nDu hast nie mehr als 5 Tode in 30 Minuten? Dann erkläre mir mal bitte das [letzte Spiel mit Vel Koz](http://matchhistory.euw.leagueoflegends.com/de/#match-details/EUW1/1902305625/217590082?tab=overview).","replies":[{"poster":"SorisDynasty","date":"2015-12-21T10:47:15.562+0000","up_votes":4,"down_votes":0,"body":"What. Seiner Aussage nach Goldspieler? Mit Barrier Support Vel'Koz? Mit 2 Giant Belts? Mit der Coin statt AP Support Item? Ohne es auszubauen? Man sollte ja wohl soviel Spielverständnis haben um zu sehen, wie ineffektiv das ist auf Goldniveau. oO","replies":[]},{"poster":"Abasin","date":"2015-12-21T11:52:06.400+0000","up_votes":2,"down_votes":1,"body":"OMG, das ist ja furchtbar. Wenn der wirklich Gold Support ist, gehöre ich nach Platin.","replies":[{"poster":"eingew","date":"2015-12-21T14:34:22.199+0000","up_votes":1,"down_votes":0,"body":"Eigentlich ist der TE Silber 5 und hat kaum Rankeds hinter sich.","replies":[]}]}]},{"poster":"Tungsteel","date":"2015-12-21T12:40:02.006+0000","up_votes":6,"down_votes":0,"body":"Hier schreibst du:\n> [{quoted}](name=sabonav,realm=EUW,application-id=KYnfKGf0,discussion-id=Qn2avtTs,comment-id=00020000,timestamp=2015-12-20T20:55:40.630+0000)\n>\n> hab nur das erste aufgemacht und  1 war ich da supporter  :D  \n\nUnd unten schreibst du: \n\n> ichdenke flamer kann ich muten : feeder leider nicht aus dem spiel kicken ( zumindest hören die meisten supporter wenn ich sie von > der lane kicke weil sie keinen blitz dodgen können\n\nUm das also zusammenzufassen: \nWenn du als Supporter stirbst, ist dein ADC schlecht. \nWenn du ADC spielst und dein Supporter stirbt, ist der Supporter schlecht. \n\nZu den oberen Links:\nLink Nr 1: 13 Wards als Support in 26 Minuten? Das ist nicht gut. Der Fehler liegt eindeutig bei ~~dir ~~ deinem ADC. \nLink Nr 2: 9 Wards als Support in 34 Minuten? Da hast ~~du ~~ dein ADC wohl nicht viel Zeit mit dem Warden verbracht (Fun Fact: Dein ADC hat ebenso 9 Wards platziert). Außerdem: Zhonyas und Deathcap als first items am Support? Das Itembuid von ~~dir ~~ deinem ADC ist wirklich zu hinterfragen. \nLink Nr 3: Du stehst als Tristana 1/7/0 mit Soraka Support, die 1/4/2 steht. Wahrscheinlich warst du da Support und was sollst du machen, wenn die Soraka ADC mit ihrem Supportbuild keinen Damage macht? \nLink Nr 4: Support mit 11 Wards in 30 Minuten. Der Sightstone, den du dafür gebaut hast, ist eigentlich eine Verschwendung. Zwei Riesengürtel auf Vel'Koz als Support. ~~Du ~~ dein ADC sollte wirklich mal den Build hinterfragen.","replies":[]},{"poster":"CooL Ice Tea","date":"2015-12-21T07:12:00.721+0000","up_votes":1,"down_votes":0,"body":"Zweitens zählt nicht da deine aktuellsten Spiele vom 26.08.15 sind. Nehme an das hier ist dein Smurf account damit deine wahren \"plays\" nicht gezeigt werden müssen?","replies":[]}]}]},{"poster":"Flakies12","date":"2015-12-20T17:24:52.734+0000","up_votes":5,"down_votes":0,"body":"Besser jemanden der richtig schön reinkackt als jemanden der alle runter macht. Meisten sind die die flamen sowieso blind und erkennen ihre eigenen Fehler nicht.","replies":[]},{"poster":"Tungsteel","date":"2015-12-21T09:18:28.913+0000","up_votes":4,"down_votes":0,"body":"Einen schlechten Tag kann jeder mal haben. Ein schlechtes Matchup ebenso. Es kann auch sein, dass man einen Champ zum ersten Mal gegen einen Main spielt. Und es kann auch vorkommen, dass man einen Fehler macht, etwas übersieht oder sonst irgendwie auf unnötige Weise stirbt. Ein freundlicher Feeder und ein Team mit einer hohen Teammoral ist mir tausend mal lieber. Auch wenn das Spiel dann verloren ist, ärgere ich mich darüber nicht, weil - wie schon gesagt - das schon mal passieren kann. Und der Feeder ist ja auf deinem spielerischen Level. Der sieht schon selbst, dass seine Stats/Fehler nicht gut sind. Da hilft ein \"Kopf hoch\" auf jeden Fall mehr. \n\nBei einem Flamer ärgere ich mich, wenn wir verlieren, weil die Teammoral wegen dem Flamer mies ist und man eher das Gefühl hat, dass das eigene Team gegeneinander spielt und nicht gegen die eigentlichen Gegner. Wenn wir gewinnen, ärgere ich mich genauso, weil der Flamer auch gewonnen hat. \n\nIch hab das auch schon oft genug in meinen Games gesehen. Wenn einer 0/5/0 steht und eh schon sagt, dass es ihm leidtut und das nicht sein Spiel ist: Dann gibts den Fall, in dem das Team sagt, dass das nichts macht, dass sie ihm auf der Lane helfen oder dass sie die Lane tauschen können oder dass er einfach vorsichtig weiter spielen soll und es nichts macht, weil wir im Lategame ohnehin das bessere Team haben. Da kanns dann sogar sein, dass der Feeder am Ende eine gute KDA hat und vielleicht sogar der Carry war. Umgekehrt hab ich es schon oft genug erlebt, dass das Team einen Vorsprung hat und man eigentlich sagen könnte, dass das Spiel in 10-15 Minuten gewonnen ist, weil man so einen Vorsprung hat. Dann fängt einer wegen KS zum Flamen an. Dann passiert irgendjemandem ein Fehler und der Flame wird schlimmer, obwohl das Spiel eigentlich schon fix gewonnen ist. Dann sinkt die Teammoral, der Tank, der den Flamer retten könnte, indem er den Skillshot blockt, würde den Flamer lieber sterben sehen, damit er den Flamer wegen dessen Tod flamen kann. Und schon hat man einen schlechten Teamfight, das Team fängt zu tilten an und irgendwie schafft man es dann noch, den Vorsprung wegzuwerfen und die Gegner gewinnen doch nicht.","replies":[]},{"poster":"TAC Season7Hype","date":"2015-12-28T17:52:35.971+0000","up_votes":1,"down_votes":5,"body":"Hey, ganz im ernst jetzt?\nIhr sagt Flamer sind schlimmer als feeder?\nWie tief seit ihr den bitteschön gesunken?\nFLAMER KÖNNT IHR MUTEN \nbitteschön Problem gelöst.\nAber Feeder könnt ihr nicht stoppen.\nMFg ich","replies":[{"poster":"Waldschrat86","date":"2015-12-29T20:11:57.371+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=TAC Sexy Vayneee,realm=EUW,application-id=KYnfKGf0,discussion-id=Qn2avtTs,comment-id=000a,timestamp=2015-12-28T17:52:35.971+0000)\n>\n> Hey, ganz im ernst jetzt?\n> Ihr sagt Flamer sind schlimmer als feeder?\n> Wie tief seit ihr den bitteschön gesunken?\n> FLAMER KÖNNT IHR MUTEN \n> bitteschön Problem gelöst.\n> Aber Feeder könnt ihr nicht stoppen.\n> MFg ich\n\nDas ist halt, was sind Feeder?\n\nAbsichtliche sind verdammt selten (wenn man kein Flamer ist) und bei der anderen Form müsste sich wohl jeder selbst schlimm finden.","replies":[{"poster":"sabonav","date":"2015-12-29T23:41:07.042+0000","up_votes":1,"down_votes":6,"body":"ich deffiniere einen feeder als jemand der nachdem er 2 mal gestorben ist nihct auffhört weiter zu sterben ....\n( devensiv spielen ist einfacher wie offensiv ,,,)\n\nwennn man später 0/30 rausgeht aber es nachvollziebar ist  warum er so oft gestorben ist hab ich kein problem damit aber wenn jemand fightet obwohl er die letzten beiden fights schon nicht gewinnen konnte ist das absichtlich","replies":[{"poster":"Waldschrat86","date":"2015-12-30T00:27:51.957+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=sabonav,realm=EUW,application-id=KYnfKGf0,discussion-id=Qn2avtTs,comment-id=000a00010000,timestamp=2015-12-29T23:41:07.042+0000)\n>\n> ich deffiniere einen feeder als jemand der nachdem er 2 mal gestorben ist nihct auffhört weiter zu sterben ....\n> ( devensiv spielen ist einfacher wie offensiv ,,,)\n> \n> wennn man später 0/30 rausgeht aber es nachvollziebar ist  warum er so oft gestorben ist hab ich kein problem damit aber wenn jemand fightet obwohl er die letzten beiden fights schon nicht gewinnen konnte ist das absichtlich\n\nGut und wievele Spiele mit unter 2 Toden hast du in deiner Matchhistory?","replies":[{"poster":"sabonav","date":"2015-12-30T06:03:09.441+0000","up_votes":1,"down_votes":4,"body":"lesen kannst du?\n\nich erwarte von jemanden der mit randoms ein teamspiel spielt das er zuerst lernt devensiv zu spielen und nicht das spiel negativ zu beeinflussen befor man lernt zu carryen :) du lernst ja auch in der schule nicht erst bruch rechnen um dann mim 1mal 1 abzuschließen","replies":[{"poster":"Waldschrat86","date":"2015-12-30T11:57:45.990+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=sabonav,realm=EUW,application-id=KYnfKGf0,discussion-id=Qn2avtTs,comment-id=000a0001000000010000,timestamp=2015-12-30T06:03:09.441+0000)\n>\n> lesen kannst du?\n> \n> ich erwarte von jemanden der mit randoms ein teamspiel spielt das er zuerst lernt devensiv zu spielen und nicht das spiel negativ zu beeinflussen befor man lernt zu carryen :) du lernst ja auch in der schule nicht erst bruch rechnen um dann mim 1mal 1 abzuschließen\n\nJa kann ich und du kannst vorzüglich andere Maßstäbe bei anderen als bei dir anlegen.\n\nWeißt du, wenn mir das z.B. durch greed passiert kommt der Gegner meistens grad so mit 10hp weg, auch beim 0 3.\n\nSpielt man zu def überholt der Laner einen enorm im Farm, dass ca. 15-20 Lasthits einem Kill entsprechen, ist dir bekannt? Schön, wenn ich dann zwar nicht sterbe, aber irgendwann 60+ Farm hinten bin, von den Leveln gar nicht zu reden.\nJa und dann steh mal noch def gegen einen 3 Lvl. über dir und 1-2 fertige Items mehr, spätestens dann wirst du gedivet, sogar ohne Jungler.\nAchja in der Situation endet auch meist ein Gank im Fiasko, wenn nicht noch ein anderer mitroamed, besonders schön, wenn dann auch das schief geht, weil der arme Tropf dann def spielt, alles schon erlebt.\n\nUnd ganz nebenbei, ob jetzt jemand das early auf der Lane verkackt ist niemals so schlimm, wie Carries, die im Lategame meinen Solopushen oder Facechecken zu müssen und scheinbar vergessen haben, dass da eben ein gefeedeter Gegner rumrennt. \n\nUnd nur mal so nebenbei neben zig Velkozspielen mit 9 Toden sticht da auch ein 1 7 Tristanagame schön heraus.\nWar sicher was anderes, ist klar und wenn jetzt kommt, das war wegen gefeedetem xyz, dann beantworte mir bitte die Frage, warum du dann nicht selbst def spielst? Ob das nun beim Laning oder später passiert, sollte ja keine Rolle spielen.\n\nErklär uns bitte, was dich so besonders macht, wenn dir das passiert. Wasser predigen und Wein saufen.","replies":[{"poster":"sabonav","date":"2015-12-30T16:10:44.595+0000","up_votes":1,"down_votes":3,"body":"***","replies":[{"poster":"Rainbow Dashie","date":"2015-12-30T16:14:42.727+0000","up_votes":1,"down_votes":0,"body":"Tower = global Gold\n\n50 farm = 6 Normal Waves + 2 Canon Waves (1036 gold in etwa)\n\n1 Kill = etwa 250g?\n\nso und nun kommst du.","replies":[]}]}]},{"poster":"Sirrkas","date":"2015-12-30T10:21:39.477+0000","up_votes":3,"down_votes":0,"body":"Bevor du das bei anderen vorraussetzt, solltest du dich erst einmal selbst daran halten. Nach deiner Definition bist du nicht in der Lage \"carrien zu können\" schließlich beendest du auch Spiele mit deutlich mehr als 2 Toden.","replies":[]}]}]},{"poster":"Rainbow Dashie","date":"2015-12-30T00:04:08.101+0000","up_votes":2,"down_votes":0,"body":"also so ziemlich jeder Spieler ist ein Feeder. DAS nenne ich doch mal eine \"schöne\" Interpretation des Wortes vorsätzlich.","replies":[]}]}]},{"poster":"sabonav","date":"2015-12-29T17:29:17.958+0000","up_votes":2,"down_votes":3,"body":"der erste der meinen gedanken teilt :D","replies":[{"poster":"TAC Season7Hype","date":"2015-12-29T22:27:36.943+0000","up_votes":1,"down_votes":2,"body":"Ich verstehe nicht warum die das downvoten -.-","replies":[]}]}]}]}