{"poster":"AG Teemo","date":"2017-01-14T01:35:08.283+0000","title":"Esta permitido usa Wooxy?","subforum":"Problemas Técnicos","up_votes":7,"down_votes":2,"body":"Solo quiero saber si al usar este programa hay riesgo de que me baneen la cuenta","replies":[{"poster":"Nata","date":"2017-01-14T01:51:13.583+0000","up_votes":7,"down_votes":0,"body":"Esto me respondieron hace un mes sobre Wooxy\n\nSaludos,\n\nPara instalar un programa de terceros sin riesgo a una sanción, tienes que saber muy bien qué cambios hará dicho programa.\n\nSi no estás seguro, mi respuesta y recomendación personal es que NO instales ningún programa para customizar Skins.\n\nNosotros no podemos decirte qué programas están permitidos y cuáles no, pues éstos tienen actualizaciones que escapan a nuestro control y puede que hoy no supongan un problema, pero que mañana en una actualización sí, por lo que no te podemos dar una respuesta.\n\nComo te digo, mi consejo personal es NO instalar nada.\n\nSi tienes más dudas, vuelve a escribirnos.\n\nUn saludo.\n\nOrejachope.\n\nRiot Games Player Support.","replies":[]},{"poster":"Haruhi","date":"2017-01-14T02:53:13.544+0000","up_votes":2,"down_votes":0,"body":"Riot ya respondio esta pregunta hace un tiempo\n\nEl Wooxy y SIU estan permitidos mientra no aya ninguna actualizacion que muestre cosas extras como el time de la jg\n\nLas customs skins estan permitidas, pero cualquier cosa que cambie la experiencia de juego no (times de jungla, smiteo automatico, aim bot etc)\n\nEspero que la respuesta te ayude!","replies":[]},{"poster":"IIIIIIIIIIIIIIII","date":"2017-01-14T03:53:21.540+0000","up_votes":1,"down_votes":0,"body":"El wooxy es legal digamos, pero el mismo no trae las skins, por lo que tenes que bajarte vos los archivos, el problemas seria que instales algún archivo (para las skins custom) que te modifique algo que no esté permitido por riot,.","replies":[{"poster":"Benja God","date":"2017-01-14T17:00:58.324+0000","up_votes":2,"down_votes":1,"body":"Las mismas skin no oficiales son un archivo, es ilegal y te pueden banear","replies":[]}]},{"poster":"Lord Sonic","date":"2017-01-14T18:54:21.030+0000","up_votes":1,"down_votes":0,"body":"Mira, yo uso ese programa, pero te recomiendo que lo uses bajo tu propio riesgo, y si vas a instalar una skin, probala en perso, por si se bugea y te perjudica la partida. Ademas no instales timers ni skins oficiales porque eso es ban seguro (puede llegar a ser permanente, asi que cuidado)","replies":[]},{"poster":"LGBT Valentina","date":"2017-01-14T17:20:06.778+0000","up_votes":1,"down_votes":0,"body":"Es legal, casi TODO lo de wooxy y digo CASI TODO, por que debe algun mod de timmers o etc etc, pero si es legal\n\nYo lo uso para usar el mapa viejo","replies":[]},{"poster":"Criborg","date":"2017-01-14T09:03:21.525+0000","up_votes":1,"down_votes":0,"body":"Te recomiendo que uses este: http://leagueskin.net/p/download-mod-skin-lol-pro-2016-chn\nNo necesitás descargar los skins y además sigue funcionando sin tener el programa abierto, también lo actualizan para cada parche que sale y es legal.","replies":[{"poster":"R Stëin","date":"2017-01-14T11:37:36.816+0000","up_votes":1,"down_votes":0,"body":"Es bastante bueno, lo malo es que no se auto actualiza y siempre tenes que volver a programar las skins luego de cada actualización, pero igual es bastante buena.\nLuego esta http://mobaskins.com/skin-preview-league-skins-free/  que esta bastante completa y se auto actualiza, lo malo es que salta publisidad, que no seria malo si fuera publisidad de apps o articulos pero es erotica.","replies":[]}]},{"poster":"Dasánt Ko","date":"2017-01-14T02:19:37.360+0000","up_votes":2,"down_votes":3,"body":"si es ilegal {{sticker:zombie-brand-mindblown}}","replies":[]}]}