{"poster":"Gleowyn","date":"2019-10-02T14:40:27.114+0000","title":"[SOPORTE - INFO] Problemas con el Nuevo Launcher","subforum":"Problemas Técnicos","up_votes":9,"down_votes":1,"body":"Hola a todos!\n\nComo sabrán el nuevo launcher del **lolsito** está llegando a varios jugadores a nivel mundial, con esta bienvenida se han presentado ciertos casos que inhabilitan que quienes ya lo tienen jueguen apropiadamente.\n\nhttps://i.imgur.com/qbO85iE.png?nodirect\n\nPor lo tanto, les dejaré por por acá unos casos que pueden suceder  y que deberían tener fácil solución y que en caso contrario ya saben donde encontrarnos ;)\n\n**Caso 1:**\n\nhttps://i.imgur.com/gQopivH.png?noredirect\n\nSi pasa ésto, no se preocupen, estamos ya con ello y por ahora les pedimos que seleccionen **Forzar nueva actualización** con la [Herramienta Hextech](https://support.riotgames.com/hc/es-419/articles/224826367-Resoluci%C3%B3n-automatizada-de-problemas-Herramienta-de-Reparaci%C3%B3n-Hextech) y luego una vez se complete, reiniciar el pc debería solventarse, si no es así, solo esperar y volver a probar. Actualizaremos cuando esté solventado completamente.\n\n**Caso 2:**\n\nhttps://i.imgur.com/1CS4Pml.png?noredirect\n\nSi pasa éste otro error, el procedimiento es únicamente reproducir como **Administrador.**\n\nPara hacer ésto puedes hacerlo de dos maneras:\n\nLa primera es hacer click derecho y pinchar en la opción Ejecutar como administrador en el icono de LoL que tienen en su **Escritorio**.\n\nLa segunda es dejarlo configurado para que siempre lo haga. En éste caso es hacer Click derecho primero nuevamente en el icono de LoL que tienen en su **Escritorio**, luego Propiedades e ir a la pestaña Compatibilidad. Dentro de ésta seleccionamos la siguiente opción marcada con la flecha:\n\nhttps://i.imgur.com/4dRV2Qb.png?noredirect\n\n\nDe momento, poco a poco todos los jugadores irán migrando a este nuevo launcher. Les tendremos informados de cualquier otro problema que pueda surgir\n\n\n{{champion:16}}","replies":[{"poster":"Wooly Mammoth","date":"2019-10-05T22:31:13.251+0000","up_votes":9,"down_votes":0,"body":"\"...Les tendremos informados de cualquier otro problema que pueda surgir...\"\n\nAsí como con lo del lag desde hace mas de un mes.","replies":[{"poster":"rastrk91","date":"2019-11-08T02:42:23.056+0000","up_votes":2,"down_votes":0,"body":"disculpe... ayer me paso un problema con el juego estuve en una ranked y se congelo la pantalla del juego pero no el movimiento del mapa . mi pregunta es si necesito un computador mas estable para jugar o solamente es problema del nuevo parche por que nunca me ha pasado. le mande el reprot a riot pero no me ha dado solución. de esta manera quería dirigir a utsed. desde ya muchas gracias-","replies":[{"poster":"elmatasimiosxd","date":"2019-11-08T18:20:36.644+0000","up_votes":1,"down_votes":0,"body":"Hola amigo, me pasa lo mismo y quería preguntarte si encontraste alguna solución ?","replies":[{"poster":"Astro","date":"2019-11-09T00:31:38.336+0000","up_votes":1,"down_votes":0,"body":"me pasa igual {{champion:32}}","replies":[{"poster":"Gansk","date":"2019-11-18T06:40:13.350+0000","up_votes":1,"down_votes":0,"body":"también he tenido el mismo problema , desde la actualización de senna , estoy en plena ranked y se queda pegado el juego ,lo cual me obliga apagarlo manualmente o ctrl + alt + supr , anteriormente no tuve ese problema implicando que me penalizaran por \"abandono\" ","replies":[]}]}]}]},{"poster":"Bubirela","date":"2020-01-23T00:56:56.575+0000","up_votes":1,"down_votes":0,"body":"es el cliente tu compu anda bien","replies":[]},{"poster":"x Arya x","date":"2019-11-23T21:39:59.259+0000","up_votes":1,"down_votes":0,"body":"YA VA CINCO MESES , Mi pregunta es para que agregan ese nuevo launcher si tiene errores y aparte no solucionan el lag movistar en peru. deberian de solucionar los errores para meter esas tonterias que nada sirven, estos de rito creo que trabajan dos , unos hacen las skin y el otro se rie de nuestro comentarios","replies":[]}]},{"poster":"KatsuraWarrior69","date":"2019-10-19T01:23:38.656+0000","up_votes":6,"down_votes":0,"body":"Desde que salió el nuevo Launcher es injugable me iba unos 90 a 120 fps ahora no pasa de 15 o 20 aún poniendo todo al mínimo rendimiento dentro del juego, solo puedo jugar TFT debido a eso y jugar contra bots para las misiones por que me es imposible jugar bien casi por que rara vez esta estable.","replies":[{"poster":"Astro","date":"2019-11-09T00:32:09.256+0000","up_votes":1,"down_votes":0,"body":"{{champion:32}}","replies":[]}]},{"poster":"Excorpion","date":"2019-10-02T17:06:08.049+0000","up_votes":6,"down_votes":1,"body":"> ** Problemas con el Nuevo Launcher **\n\nNo esperaba más de ustedes\n{{sticker:sg-miss-fortune}}","replies":[]},{"poster":"ALC Esferita","date":"2019-10-04T14:59:31.009+0000","up_votes":7,"down_votes":2,"body":"Que porquería me ha parecido el nuevo Launcher, se demora el doble o más en iniciar el Lol aunque lo dejes con sesión abierta para no tener que loguear, desde el clic en el launcher son 37 segundos cronometrados hasta que está activo para jugar, y más te tardas si cerraste la sesión y tienes que poner tus datos (no más de 5 segundos).  ¿Habrá alguna forma de volver al Launcher anterior?","replies":[]},{"poster":"InFecTs","date":"2019-10-25T04:41:37.330+0000","up_votes":4,"down_votes":0,"body":"creo que es la 3era vez que me dan cola de baja prioridad por una mala administrasion con el servidor LAS. \nsiendo que tengo 100mg de internet, es imposible que sea mi conexion. a lo que voy  es que el juego entra logea. entra en seleccion de campeon y al momento de entrar a jugar, el juego se tilda. y queda en cola de carga. para cuando reacciona el juego ya la partida se reinicio. si a alguien mas le paso/a, que siga este post, para que riot game le de una solucion.","replies":[{"poster":"Azahar","date":"2019-10-30T05:34:42.873+0000","up_votes":1,"down_votes":0,"body":"He tenido el mismo problema, y algunos de mis amigos tambien :/","replies":[{"poster":"Baron Von Churro","date":"2019-11-02T01:47:11.208+0000","up_votes":1,"down_votes":0,"body":"Me sumo! ya estoy harto del leavebuster por un problema de rito","replies":[]}]}]},{"poster":"Uncreation","date":"2019-10-19T02:01:15.511+0000","up_votes":4,"down_votes":0,"body":"En un principio el juego se congelaba a los pocos minutos de iniciar la partida y debia reiniciar la pc, ahora no me cargan las partidas y me dejan en cola >.&lt;","replies":[{"poster":"Astro","date":"2019-11-09T00:32:51.580+0000","up_votes":1,"down_votes":0,"body":"como solucionaste lo de que se congelaba? o se arreglo solo? xd{{champion:32}}","replies":[]}]},{"poster":"B A D 5 D U C K","date":"2019-10-02T15:08:16.319+0000","up_votes":3,"down_votes":0,"body":"Gracias por la información viejo, yo confirmo que las soluciones sirven\n\nlos 2 problemas me pasaron e hice exactamente lo que indicas y me funciono\n\nsaludos","replies":[{"poster":"fashonista","date":"2019-10-08T16:57:43.629+0000","up_votes":2,"down_votes":0,"body":"cuales eran los problemas que tenias? por que a mi me abre perfecto todo pero en partida tipo minuto 10 empieza a congelarse las habilidades despues quedan tirando para todos lados sin sentido","replies":[{"poster":"Schizoid Virus","date":"2019-10-09T21:51:03.549+0000","up_votes":2,"down_votes":0,"body":"me pasa exactamente lo mismo y se recupera al minuto 19-23 por lo que me deja 1/3 de la partida fuera de juego","replies":[]}]}]},{"poster":"ezioauditore47","date":"2019-11-19T17:59:24.025+0000","up_votes":2,"down_votes":0,"body":"a mi me sale error al actualizar, antes de ayer lo actualice y pude jugar bien no entiendo que es lo que paso","replies":[{"poster":"Re2CB","date":"2019-12-06T03:46:22.796+0000","up_votes":1,"down_votes":0,"body":"A mi también, trate con la herramienta Hextech de reparación pero me dice que ocurrió un error con la actualización aun después de la reparación {{sticker:slayer-jinx-unamused}}","replies":[{"poster":"EzeFivex","date":"2020-02-17T23:00:16.108+0000","up_votes":1,"down_votes":0,"body":"Pudiste solucionarlo Re2CB? Si es asi, como??","replies":[]},{"poster":"Bubirela","date":"2020-01-23T00:58:30.081+0000","up_votes":1,"down_votes":0,"body":"no sirve ya la herramienta es  un asco esto\n{{champion:51}}","replies":[]}]}]},{"poster":"Akayomi","date":"2019-10-19T16:01:43.177+0000","up_votes":2,"down_votes":0,"body":"El launcher nuevo es horrible. Dejen poner el juego en ingles loco, no sean vagos.","replies":[]},{"poster":"XNachomanX","date":"2019-10-04T18:45:41.183+0000","up_votes":1,"down_votes":0,"body":"y como lo pongo en ingles????????? si no se puede al menos dejen que se use el original","replies":[{"poster":"X150","date":"2019-10-10T02:28:12.651+0000","up_votes":2,"down_votes":0,"body":"sacaran el cliente que teniamos por este nuevo? literalmente riot hizo mal en cambiar el cliente, el otro esta muchisimo mejor, yo lo juego en varios idiomas incluyendo korea y taiwan, ahora con el cliente nuevo no se puede jugar con los idiomas que quieres, increible que el cliente que tenemos se vaya por este cliente que no me gusto para nada, ojala y riot no ponga el cliente nuevo ese y tengamos el que teniamos.\ny respondiendo a tu pregunta es muy complicado ponerle el idioma en ese cliente nuevo, yo lo borre y uso el que teniamos F por riot que quiere empeorar el cliente","replies":[{"poster":"llamaredpijama","date":"2019-10-24T20:25:48.453+0000","up_votes":1,"down_votes":0,"body":"En serio? Csm, qué hago con mis cuentas de na y lan? :c","replies":[]},{"poster":"Kaheas Shibari","date":"2019-10-11T00:36:59.483+0000","up_votes":1,"down_votes":0,"body":"Me estas jodiendo que no se puede cambiar los idiomas? Posta?","replies":[{"poster":"X150","date":"2019-10-21T09:57:56.544+0000","up_votes":1,"down_votes":0,"body":"Siii, me asuste al momento que se me instalo y no se puede cambiarle el idioma, pero bloquie la carpeta del nuevo cliente y gg izi xd","replies":[]}]}]}]},{"poster":"RONZOCO12","date":"2019-10-03T23:59:54.492+0000","up_votes":2,"down_votes":0,"body":"A mi no me funciona","replies":[]},{"poster":"Esbern","date":"2019-10-03T01:13:45.063+0000","up_votes":2,"down_votes":1,"body":"&lt;3","replies":[]},{"poster":"Lhojzu","date":"2020-02-28T23:14:52.091+0000","up_votes":1,"down_votes":0,"body":"Hola gente, necesitaría saber si a alguien más le está pasando el problema que tengo yo o si alguien de Riot puede orientarme:\n\nRecibo un error al ingresar a las partidas donde no me carga y automáticamente me echa de las mismas. El cartel del error me dice que no se puede establecer conexión con el servidor, y que por ende, revise mi red (tengo adjunto de ser necesario). \n\nA todo esto estoy conectado al internet, el cual funciona porque lo uso paralelamente con el celular y se encuentra en perfectas condiciones.\n\nMi computadora, también está perfecta porque la envié a revisar hace una semana y me la devolvieron joya. \n\nConclusión, que estoy en cola de baja prioridad por un problema completamente ajeno a mi deseo de jugar y/o conectividad, y que encima es completamente random porque he estado jugando varias partidas durante los dos días al hilo que me viene pasando esto, siempre conectado al mismo internet que no estaría fallando.\n\nNecesitaría que además de revocar o no el LeaverBuster, me sepan orientar a que está pasando y si soy el único con estos problemas.\n\nSi alguno puede comentarme y no me encuentra aquí --> nacho.telechea99@gmail.com.\n\nGracias, Nacho.","replies":[]},{"poster":"simoncito21","date":"2020-02-25T21:35:55.866+0000","up_votes":1,"down_votes":0,"body":"Me paso la opcion 2, ejecute como adiminstrador y el problema persiste {{sticker:slayer-jinx-unamused}}","replies":[]},{"poster":"LeandroMP7","date":"2020-02-12T00:54:25.831+0000","up_votes":1,"down_votes":0,"body":"emmm... en medio de una partida me crasheo el juego, despues al volver a intentar abrir el juego no me deja, no abre el juego. disculpen la molestia pero no me gustaria recibir una penalizacion del juego{{champion:19}} {{sticker:sg-ahri-1}}","replies":[]},{"poster":"crafter990","date":"2020-02-01T03:35:19.641+0000","up_votes":1,"down_votes":0,"body":"yo comento mi experiencia  hasta ahora:\n1)  cuando abro el launcher me aparece un bug que oscurece la pantalla o no carga imágenes o no deja iniciar partida, etc.\n2)  cuando estoy en partida pasan varias cosas \"HERMOSAS\": el chat se me laguea un montón y cada letra que escribo tarda medio año en aparecer por lo que no puedo mandar mensajes largos, el movimiento del campeón es fluido pero las habilidades se me laguean de alguna forma ( ya que no tengo lag) y tardan mucho en cargarse. hoy jugué una partida en ARAM y me tuve que ir por la frustración ya que estaba escribiendo un texto largo para mi equipo explicándoles todo y mientras espero a que se envié el mensaje abro la tienda yyy .......\nel chat se cierra (no llego a terminarse y enviarse) por lo que se empiezan a activar habilidades de golpe de acuerdo a las letras que escribí al enviar dicho texto al equipo.\n3) al terminar la partida y volver al menú me sale un cartel de que se perdió la conexión o no se que y me obliga a cerrar el launcher y volver a abrirlo...\nLAS 3 COSAS CADA VEZ QUE QUIERO JUGAAAAAR\npor no mencionar que cuando pedí ayuda a Riot me atendió un flaco que no hacia caso al problema y me decía: \"en la pantalla negra escribí tal código\" CUAL PANTALLA NEGRAAAA y encima no me explicaba como. como si yo supiera si hay que escribir el código en el aire o que hacer.\n {{champion:14}}\nno se si el cliente que uso es el nuevo o no. yo pongo en descargar y me descarga este. no se si hay otro. si el nuevo es el que tengo yo.... vamos mal\n{{summoner:11}} ","replies":[]},{"poster":"ramiroxD1","date":"2020-01-23T02:07:05.699+0000","up_votes":1,"down_votes":0,"body":"no me funciona","replies":[]},{"poster":"Bubirela","date":"2020-01-23T00:56:22.362+0000","up_votes":1,"down_votes":0,"body":"arreglen lo para invitar amigos los chat y ver la lista de amigos es malisimo  como lo tienen despues uno es el manco no pueden soluconar algo tan simple y anda a full con las skin, los emparejamientos son un asco arreglen eso  tambien {{summoner:7}}","replies":[]},{"poster":"Sammy Hansen","date":"2020-01-13T21:24:05.921+0000","up_votes":1,"down_votes":0,"body":"A mi se me dañó el launcher completo, así que tuve que desinstalarlo completo y volver a instalarlo, espero que se arregle U.U","replies":[]},{"poster":"The new Rose ","date":"2019-12-24T03:36:17.269+0000","up_votes":1,"down_votes":0,"body":"Yo ni puedo entrar al juego ni con una cuenta nueva, en todo momento me lanza un mensaje de, tus credenciales de inicio de sesion no coinciden una cuenta en nuestro sistema. Ah alguien mas le pasa?","replies":[]},{"poster":"Osiito Teddy","date":"2019-12-13T08:18:20.753+0000","up_votes":1,"down_votes":0,"body":"arregles  el tema  de  cahseo lcdsm  ya van 3 meses con el problema   delos fps  tambien","replies":[]},{"poster":"rastrk91","date":"2019-11-07T04:26:46.974+0000","up_votes":1,"down_votes":0,"body":"a mi me paso s eme congelo en una partida y me dieron reporte no puede netrar mande el mensaje a riot pero no me ayudado aun.","replies":[]},{"poster":"InsaneX315","date":"2019-11-06T14:07:17.399+0000","up_votes":1,"down_votes":0,"body":"Arreglen la selección de campeones loco, estamos en la parte final de las ranked y no se puede jugar -.-","replies":[]},{"poster":"Draxsj","date":"2019-10-11T00:35:34.930+0000","up_votes":1,"down_votes":0,"body":"Recién se me instaló el nuevo launcher, pero al iniciar sesión y tratar de comenzar una partida no me aparece nadie en la lista de amigos, no me deja invitar a nadie ni hablarles, ¿Qué debo hacer?","replies":[]}]}