{"poster":"Rainberry","date":"2019-01-25T21:52:18.004+0000","title":"Cansado de dodgear Sylas en ranked","subforum":"Charlas Generales","up_votes":6,"down_votes":3,"body":"Por que Rito deja que lo utilicen en ranked si acaba de salir?\r\nY si se los baneas trollean el game :(","replies":[{"poster":"Osorkon21","date":"2019-01-25T22:13:59.804+0000","up_votes":5,"down_votes":1,"body":"Banealo igual y reportalos si trolean, simple... pero no les digas nada, solo banea y si trolea reportas","replies":[]},{"poster":"Mascheranox","date":"2019-01-26T01:32:16.834+0000","up_votes":1,"down_votes":0,"body":"da igual,trolean por todo","replies":[]},{"poster":"iBaam","date":"2019-01-26T01:20:11.062+0000","up_votes":1,"down_votes":0,"body":"Apoyo a osorkon21, banealo amigo, yo ya vengo en otra cuenta probando los bans a prepicks, que un jugador tenga prepickeado un pj no lo hace inbaneable o inescogible (que lo uses tu por ser un pick antes que el), muchos te insultaran, tu debes quedarte callado o a lo mas dar la razon de tu ban al pj (por ser nuevo, porque al otro lado hay un jugador bueno con el, por que te molesta en linea y lo pueden sacar, etc) y si amenaza con trollearte que es lo que hace la mayoria al final no tienen los h*evos suficientes para hacerlo, les importa mas sus pl que joderse asimismo, la mayoria de los que amenazan dodgean o se van afk para remake, y si realmente (que es bien raro) trollea se le reporta y solo caba su propia tumba, ademas del report que se lleva por abuso verbal para que vaya acumulando reportes, y quien sabe hasta estas de suerte y te sale cartelito de retroalimentacion.\n\n1000iq player, saludos!\nPD: Bien ahi osorkon21","replies":[]},{"poster":"Mr ØwO","date":"2019-01-25T22:47:02.660+0000","up_votes":2,"down_votes":3,"body":"¿por que? , Esas personas pudieron haber jugado en el pbe que esta disponible para todos desde hace mas de un año ¿que te hace creer precisamente que van a jugar mal? , Si te banean un campeon que utilizas bien ¿Como te sientes?","replies":[{"poster":"Rainberry","date":"2019-01-25T23:42:33.996+0000","up_votes":2,"down_votes":1,"body":"Porque es ranked, me vas a decir que vas a usar mejor un campeon que utilizas hace dos semanas antes que otros que usas hace años? Me doy cuenta que solo quieren trollear cuando se los baneas y eligen soraka jg, deja de defender a ciertas personas\n\nSaludos","replies":[{"poster":"SGU Chipili UwUr","date":"2019-01-26T00:48:18.379+0000","up_votes":1,"down_votes":0,"body":"No he probado a Sylas, ni jugado contra él, pero hay campeones que cuando salen están rotos, por ejemplo Ekko y Zoe.\nY creo yo que la gente la cual lo ha utilizado con antelación tiene una pequeña ventaja sobre aquellas personas que no han jugado contra ese campeón nunca, o pocas veces. Además creo yo que utilizar un campeón por 2 semanas es más que suficiente tiempo para utilizarlo de una manera buena, o en su defecto descente.\n\nSaludos.","replies":[]}]}]}]}