{"poster":"Rainberry","date":"2018-09-06T06:20:10.849+0000","title":"No me dan mas ganas de jugar rankeds","subforum":"Charlas Generales","up_votes":4,"down_votes":0,"body":"Con lo mal que emparejan en rankeds no me dan mas ganas de jugar, y no es que tienen malas partidas, juegan muy mal loco, es imposible jugar asi","replies":[{"poster":"fenixerege","date":"2018-09-06T12:29:59.089+0000","up_votes":3,"down_votes":0,"body":"esta temporada ni ganas de hacer una ranked al punto tal que solo entro para la victoria del dia y asi tratar de tener mas champs, ademas de eso que hasta ahora ni siquiera hice las 10 partidas de clasificacion y la verdad cada dia me aparto un poco mas y se siente bien..............","replies":[]},{"poster":"Danurian","date":"2018-09-07T02:44:08.460+0000","up_votes":2,"down_votes":0,"body":"Esta season es una reverenda caca, da igual como juegues en lane , siempre te va a snowbollear un talon o una kata con el roaming, demasiado desiquilibrado,  el nocturne que deletea de una ulti a cualquiera con las runas estas . De verdad  0 oportunidad para los campeones de late.\n\nDe la gran variedad de personajes el juego se reduce a unos 25 campeones si es que quieres ganar. Asi que personalmente me retiro de este juego por esta season y eso que juego desde season 1.\n\n\nOjala lo arreglen luego ya que año tras año hay que aprender a jugar de nuevo con los cambios que hacen.","replies":[]},{"poster":"WhiteMax","date":"2018-09-06T15:23:47.166+0000","up_votes":1,"down_votes":3,"body":"Si juegan mal eso no es bueno para ti? digo ya que tu (supongo) sabes jugar, tu la carreas, no?\n\nAsi como te pasa a ti le puede pasar al equipo contrario. Consejo? hace duo, asi la probabilidad de trolls queda en 3 jugadores en vez de 4 que seria jugando solo.","replies":[{"poster":"Rainberry","date":"2018-09-07T02:59:59.991+0000","up_votes":1,"down_votes":0,"body":"Desde cuando no jugas? es imposible ganar una partida con alguien que no hace absolutamente nada bien, cuando no hacen caso, yo tambien he empezado mal pero se que hacer cuando me va mal para no seguir estorbando en el equipo, es gente que no sabe jugar y punto.","replies":[{"poster":"WhiteMax","date":"2018-09-07T04:05:41.363+0000","up_votes":1,"down_votes":1,"body":"{{sticker:zombie-brand-facepalm}}","replies":[]}]}]}]}