{"poster":"Lord Alin","date":"2016-07-22T20:36:56.854+0000","title":"Why so many players go afk during the game and riot seems to doing nothing about this.","subforum":"Player Behaviour","up_votes":1,"down_votes":1,"body":"Hi, \r\nLately I have been losing too many games just due to the factor that now a days too many players seems to go afk during the game. And I have reported all those along with my team. But still there is no action being taken. Is there are way to improve or overcome this problem. I know it happens with every one but now it&#039;s happening every 2 3 games.","replies":[{"poster":"CHEESYLEEKS","date":"2016-07-22T23:06:57.149+0000","up_votes":1,"down_votes":0,"body":"How do you know they're  doing nothing? How do you know these players have not gotten a low priority que? \n\nIts a pretty callous complaint,with here say rather than actual evidence to back up your claim","replies":[{"poster":"bgentle2myashe","date":"2016-07-23T04:24:20.039+0000","up_votes":1,"down_votes":0,"body":"How does EU even get on our boards and not their own?","replies":[]}]},{"poster":"Yasei Doubutsu","date":"2016-07-22T20:47:53.906+0000","up_votes":1,"down_votes":0,"body":"Complain on your boards plz, not ours.\nTell your rioters about this, ours are busy.","replies":[{"poster":"Lord Alin","date":"2016-07-22T21:03:04.176+0000","up_votes":1,"down_votes":0,"body":"that was fast. can you give me the link to that board ?","replies":[{"poster":"Yasei Doubutsu","date":"2016-07-23T03:22:28.390+0000","up_votes":1,"down_votes":0,"body":"Click on your hyperlink, your URL in the top.\nReplace the .oce. with .euw.","replies":[]},{"poster":"Tele","date":"2016-07-22T22:03:36.121+0000","up_votes":1,"down_votes":0,"body":"Just for the record I'm sure **Yasei** was just kidding XD \n\nWe're more than happy to have you on our boards as long as you're respectful. [Here](http://boards.euw.leagueoflegends.com/en/)'s a link to the EUW boards anyway in case you're interested.\n\n__*\n\n> **_As for your question:_**\n\n> AFKs are always an issue. Especially before level 30 because many players do not understand that leaving games is punishable. \n> \n> It's not true that _\"there is no action being taken\"_ though. All AFKs are receiving low priority queues of up to 20 minutes. Continued AFKing can lead to even more severe punishments. In ranked, it can make you ineligible for ranked rewards as well.\n\nI hope that helps! Also enjoy your stay on the OCE boards :)","replies":[]}]}]},{"poster":"Dunkmaster Vi","date":"2016-07-22T23:45:19.909+0000","up_votes":1,"down_votes":0,"body":"because its quicker to afk than too que dodge after your first dodge","replies":[]}]}