{"poster":"Ben Sharpio","date":"2016-03-15T17:35:41.460+0000","title":"As someone who's in low elo, i think i'd imagine myself having less fun in higher divisions","subforum":"[ARCHIVED] Miscellaneous","up_votes":21,"down_votes":3,"body":"I don't know what it is about low elo that makes me enjoy it so much. I think it's the fact that we're all equally good/equally bad (Besides when the occasional smurf comes around). I think that in low elo, there's so many more fun aspects to look forward to. I know many people think that low elo is \"hell\" but i think that above silver 5, it's actually really fun and there aren't really any extreme cases of toxicity. I believe the REAL toxicity of people telling you to kill yourself and cut yourself is low bronze (4-5). I've seen it before.\r\n\r\nBut nonetheless, in my opinion, i can't picture myself having as much fun as i do in low elo. \r\nWhat do we get here? \r\n\r\n-champion diversity. Champion diversity is one of the more important ones for me. It keeps the game interesting and exciting even if the person isn't good with them. In higher elo videos i pretty much see the same 10 champions with the same 6 bans. It's pretty much a rush to see who gets who. Whoever gets the most OP champion wins kind of case. I also think that it's because in low elo we can actually play whoever we want to play without suffering from any repercussions like counterpicks and stuff like that. I've seen yoricks, tarics, jayce players, casseiopia, rumble, urgot, you name it, youll find it here. \r\n\r\n-Mastery diversity. I know in higher elo there is generally just thunderlords on everyone besides the support. But i generally see everyone with a different keystone on and sometimes no keystone at all. It's interesting to see how other people just genuinely enjoy using other masteries besides thunderlords. Small things like this just make me appreciate the game even more. \r\n\r\n-LONG ASS GAMES. There has been a lot of threads about people saying the games end in stomps or the game ends before 20 minutes, or that we should be able to surrender at 15 minutes. These types of things are  pretty much nonexistent in low elo. I mean, there are absolute STOMPS that happen once every 10 games or so, but other than that, games for me last a good 40-50 minutes. And there are what people know as **comebacks**!! I know you high elo players miss those XD. I see it happening all of the time. Throughout the 40-50 minute game times, people have time to catch up with their item builds and stabilize their gold deficit. How can you go wrong with this?\r\n\r\n-Post game chat. I think people really undervalue this component of the game. Post chat is actually one of the things that make you WANT to play another game. Think about it, (all of my low elo friends) when you win a well-deserved game (like the comebacks i was talking about earlier) where do you discuss your awesome victory? In the post-game chat. You celebrate and pop champagne with your teammates while the other team says \"OMFG\" \"wTF\" \"NA team\" and flames eachother while you have the time of your lives. Things like this don't really exist in higher elo. The game finishes? People leave immediately, and don't talk about ANYTHING that happened during the game. Honours in high elo? Wtf is that? Legends say a good 3 honours occur per day in high elo, whereas in low elo people honour for friendly, or helpful all of the time. Think about all of those times someone has said \"honour for all\" after a win haha. I don't know, i think its awesome. \r\n\r\nI'm not saying that good is bad... or am i? I'm saying that you should appreciate the smaller things in lower divisions. Am i missing anything?  \r\n\r\n**What do you enjoy about low elo?\r\n**\r\n**HIGH ELO PLAYERS: WHAT DO YOU HATE ABOUT BEING IN HIGH ELO?!?**","replies":[{"poster":"Potato Doc","date":"2016-03-15T19:00:02.315+0000","up_votes":8,"down_votes":1,"body":"Everyone thinking there is only one way to play a champion.\n\nLike I love playing tigerdyr, everyone thinks im trolling because 'pheonixdyr' is the way to go right now","replies":[{"poster":"Robbit Mang","date":"2016-03-15T23:27:43.909+0000","up_votes":2,"down_votes":0,"body":"lmao are you my friend? my friend always talks about tiger stance udyr and ive been bugging him to go runic echoes but he wont give it up. he wrecks with it tho","replies":[{"poster":"Mama Soraka","date":"2016-03-16T00:55:28.681+0000","up_votes":2,"down_votes":0,"body":"Phoenix is so boring, Tigerdyr is the way I first learned how to play him and I just can't find it in me to appreciate the AoE damage.","replies":[]},{"poster":"Potato Doc","date":"2016-03-16T03:12:46.113+0000","up_votes":1,"down_votes":0,"body":"You can bug him to go runic echoes, but dont force him. Playing what is comfortable is (usually) way better then playing what is meta.","replies":[]}]},{"poster":"WadeWilson1337","date":"2016-03-15T19:37:32.291+0000","up_votes":1,"down_votes":11,"body":"Its not necessarily a troll build, but it is so inferior that your team is honestly right to feel like youre holding them back.","replies":[{"poster":"Potato Doc","date":"2016-03-15T19:41:57.393+0000","up_votes":2,"down_votes":1,"body":"except its not...\n\nalthough looking at that name i cant tell if serious or just trolling","replies":[{"poster":"WadeWilson1337","date":"2016-03-15T19:56:07.559+0000","up_votes":1,"down_votes":5,"body":"Runic Echoes Udyr is so vastly superior to warrior tiger udyr that they may as well be two different champions.\n\nRunic solves 2 of Udyr's only problems: Early mana issues before Iceborn Gauntlet, and getting kited. The movement speed, mana sustain, and the flat out better damage from phoenix stances makes it superior in every single way. Devourer tiger udyr is likely okay, but again, devourer phoenix is better. Frankly, i would prefer even Cinderhulk Udyr over tidyr. Its just so unfavourable that there is no reason to play it.","replies":[{"poster":"Potato Doc","date":"2016-03-16T03:11:09.416+0000","up_votes":1,"down_votes":0,"body":"I guess its just because ive played it so much I know how to get around every single one of these issues as tigerdyr. What I have seen is often it isnt the amount of MS udyr has that is a problem early game its how you approach each situation. Planning > MS any day. The damage output from Phoenix is not in every way better because tiger deals more damage and relies on you swapping your stances at the right time, instead of just saying in Phoenix stance. Also as both warrior and devour enchantments udyr has the assassination potential of zed or talon, 2 procs of his Q and most champions pre lvl 6 are usually at 1/6th hp, being in the jungle makes those ganks even more potent. \n\nMost people dont even realize sated devourer procs the bonus AD he gets from lingering on his Q, heck most people I talk to dont even know his Q gives bonus AD.\n\nAs tigerdyr you also have a good option of build paths, you can go devour/ warriors into rageblade, gunblade, nashoors, and lichbane (for pure assassin type udyr, this is also flexible to fit different situations, or if you want a tankier/bruiser form of it you go devo,warriors, trinity, titanic, maw, steraks. (also hugely flexible on situation) I hardly have any trouble dealing massive damage with both builds that far out weights the runic echo build that people prefer now (which honestly I feel lacks a ton of damage, but that is just me). Very rarely am I ever close to the reason my team is being held back, but dont we all have games like that every now and then?\n\nFrom my standpoint all too often people are just meta dogs that disregard everything else because a streamer or 2 said its bad. But if we all listened to that we wouldnt have AD malz or AD lb that are challengers, or that one jungle garen Diamond 1 player that had tiamat changed back to it being activated during his spin. Just because a \"famous\" person says it is bad, doesnt mean it actually is. Think of the possibilities if people actually started thinking cleverly  instead of like sheep following the meta at every turn","replies":[{"poster":"HandheldBrandon","date":"2016-03-16T17:16:23.753+0000","up_votes":1,"down_votes":0,"body":"The biggest problem with Tiger Udyr is that he suffers even more from the same issues that Phoenix Udyr suffers from which is Kiting. Tiger Udyr completely relies on getting off his basic attacks to keep up consistent damage where as Phoenix Udyr does a ton of damage up front. If you are against a team that can reliably kite and keep Udyr locked down then Tiger is going to do far worse than Phoenix will because it only takes a single phoenix proc to do the same damage that tiger does in 3-4 hits.\n\nNot too mention that with Runic it feeds into his Shield and his Phoenix stance damage.","replies":[{"poster":"Potato Doc","date":"2016-03-16T17:22:01.003+0000","up_votes":1,"down_votes":0,"body":"Honestly most of the time I dont have a problem with being kited. It is probably because I have played him for so long that I have found ways around being kited. Things that come with knowing a champion inside and out i guess.","replies":[]}]}]}]}]}]}]},{"poster":"shroomorc","date":"2016-03-15T19:31:21.038+0000","up_votes":1,"down_votes":0,"body":"The one thing that high elo players will hate is that they have to play with the same people over and over again","replies":[{"poster":"TarroI","date":"2016-03-15T19:56:25.004+0000","up_votes":5,"down_votes":0,"body":"Personally I like it because i get to rematch the tool who cheesed me 2v1 while he's in his off role and I'm in my main role.","replies":[]}]},{"poster":"TarroI","date":"2016-03-15T19:54:27.438+0000","up_votes":3,"down_votes":0,"body":"The thing I hate most about plat is the fact that everyone thinks they're the next Faker or Bjergsen or some s!@#, when they're the ones throwing the game. For my last few games I have had awful luck (Enemy team being plat+ players in terms of quality, and my team being the \"gg surrender at 20\" when the score is 11-11) and it really took it's toll on my LP. I have to agree with the fact that mostly the same 10-15 champs get picked, and you get the occasional swain or malzahar because the teammate had 0 f*@#s to give that game about their enemy laner. I know I picked Veigar when I just couldn't deal with swain as a Yasuo player.\n\nWhat I do miss from low elo:\n-Easiness of games \n-Able to pick Yasuo and freelo carry\n-Enemies have no clue what to do against Azir, so he's freelo too.\n-Watching people dive me and mess up horribly and give me triple kills\n\nWhat I don't miss about low elo:\n-Nobody knows what any champion does. They're like \"where dafuq did that kog damage come from\" when a kogmaw has his 2 item power spike.\n-No victorious skin q.q still yet to get one\n-The Easiness. The challenge in gold 1+ is there, and now it's somewhat significant. Your mistakes matter and you can legitimately learn from them, as opposed to being able to flash in 1v5 and get out without the enemy team realizing that you just went in 1v5 and killing you for your mistake.\n\nI heard that Diamond 5-4 is basically bronze since it's mixed with boosted players and truly diamond elo players, but I don't have the experience to make a statement on that. Either way, something to look forward to :p\n\n{{sticker:slayer-jinx-wink}}","replies":[{"poster":"Frnak","date":"2016-03-16T23:05:16.651+0000","up_votes":2,"down_votes":0,"body":"When I was coming up through Silver again (I get GoldV and quit usually) I saw some \"Plat\" players... \non massive losing streaks...\n\n... on their back to bronze. /wave","replies":[{"poster":"DU Baymax","date":"2016-03-18T05:25:25.742+0000","up_votes":1,"down_votes":0,"body":"I hate players that try to use their rank to win discussions\n\n\"I really don't think ap kha zix is super viable\"\n\n\"stfu nerd im gold ur silver u don't know what ur talking about\"\n\nthat exact conversation didn't happen but similar ones have","replies":[]}]}]},{"poster":"Dunk Everything","date":"2016-03-15T18:48:16.636+0000","up_votes":3,"down_votes":0,"body":"What I hate the most in my elo right now ( Plat ) is the fact that people give up and afk so easily. I am not gonna lie but when i was in silver, I used to have a lot more fun and now its just gg you didnt ban yi or gg they picked udyr im afk ff 20.","replies":[{"poster":"Ben Sharpio","date":"2016-03-15T18:55:50.869+0000","up_votes":1,"down_votes":0,"body":"Thought the afk problem stopped beyond high gold. Guess im wrong. Thanks for sharing","replies":[{"poster":"PhoenixGlory","date":"2016-03-15T22:08:30.605+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=SKT T1 SION,realm=NA,application-id=cIfEodbz,discussion-id=lszKpusp,comment-id=00000000,timestamp=2016-03-15T18:55:50.869+0000)\n>\n> Thought the afk problem stopped beyond high gold. Guess im wrong. Thanks for sharing\n\nPeople tend to care about winning more, and won't afk for food or other random tasks. Like if a plat+ leaves in an unprovoked way, someone is in the hospital, or remembered an exam is in half an hour. \n\nHowever the increase in game knowledge can paint an unrealistic image that your enemy will play perfectly. This means people will start to give up after the enemies obtain smaller and smaller leads. I literally had my adc in diamond 5 tell me we could not win after I gave first blood as support. \n\nWhat he didn't know is I had 400 ping when I died, solved it, and then he ended lane 9-3 as ezreal, largely because of my hooks (I was Thresh). We still lost, but not from first blood.\n\nTL;DR People give up easier in higher ranks.","replies":[{"poster":"Frnak","date":"2016-03-16T23:02:51.313+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=PhoenixGlory,realm=NA,application-id=cIfEodbz,discussion-id=lszKpusp,comment-id=000000000001,timestamp=2016-03-15T22:08:30.605+0000)\n>\n> People tend to care about winning more, and won't afk for food or other random tasks. Like if a plat+ leaves in an unprovoked way, someone is in the hospital, or remembered an exam is in half an hour. \n> \n> However the increase in game knowledge can paint an unrealistic image that your enemy will play perfectly. This means people will start to give up after the enemies obtain smaller and smaller leads. I literally had my adc in diamond 5 tell me we could not win after I gave first blood as support. \n> \n> What he didn't know is I had 400 ping when I died, solved it, and then he ended lane 9-3 as ezreal, largely because of my hooks (I was Thresh). We still lost, but not from first blood.\n> \n> TL;DR People give up easier in higher ranks.\n\nThis.\n\nPeople give up way too fast.\n\n\nI prevent it. We still win a LOT of those and would not be Gold 3 if I just hit the surrender button.","replies":[{"poster":"DU Baymax","date":"2016-03-18T05:27:34.515+0000","up_votes":1,"down_votes":0,"body":"that's rather odd, you'd think in higher ranks people would keep their cool and realize that one death is not the end of the world or their lane.  I've never actually been in plat + but from what I've seen from watching streams and other things, even high plat and diamond players make some pretty stupid mistakes during ranked games. You'd think higher level players would learn to capitalize on that and make come backs moreso than lower level players, so it's odd that they give up easier.","replies":[]}]}]},{"poster":"Dunk Everything","date":"2016-03-15T19:21:28.226+0000","up_votes":1,"down_votes":0,"body":"It actually stopped in mid to high gold for me, but when i hit plat it just started all over again","replies":[]}]}]},{"poster":"StealthyWolf52","date":"2016-03-16T23:05:17.444+0000","up_votes":2,"down_votes":0,"body":"The only thing that happens in games that reach above 30 minutes (in my experience) are either a slow ass game where nweither team wants to die or boh teams blowing eachother up and not enough players survive the insane burst to do anything so it goes on forever, that or death timers get so long so quick a support and jungler can take out 2 turrets, an inhib, and both nexus turrets before team respawns, sometimes they just win. (obviously situational)","replies":[]},{"poster":"Tyrone Lannister","date":"2016-03-15T19:30:06.688+0000","up_votes":2,"down_votes":0,"body":"Clown fiesta boys :D","replies":[]},{"poster":"bill84","date":"2016-03-19T21:14:16.011+0000","up_votes":1,"down_votes":0,"body":"I am bronze 3, and I really don't think that there is too much toxicity in bronze. In my last ten games, I really cannot remember one where there was a troll or flamer. Also, I have consistently had teams that will play the game out, at least until a few inhibs are gone, so I consistantly get 30-40 minute games.","replies":[]},{"poster":"DREADN0UGHT","date":"2016-03-18T05:31:54.377+0000","up_votes":1,"down_votes":0,"body":"People tell other to commit suicide in all elos. I've seen it in bronze 5. Still seee it in Gold 5.","replies":[]},{"poster":"Rockm Sockm","date":"2016-03-16T16:28:48.099+0000","up_votes":1,"down_votes":0,"body":"My experiences in silver from a fairly new player.\n\n1. Everyone thinks they are faker and feeds.\n2. No one can play from behind.\n3. People always 1/2v3/4. It is always a team fighting comp trying to jungle fight a pick assassination comp.\n4. Maximum salt and no accountability for there actions.\n5. Zero sideline control/slow push/wave manipulation.\n\nI am honestly wondering if gold will be better or if I should just tank back down to have more fun until these people move on.\n\nSilver does have a lot of decent players who remain silver cause they can only duel and are toxic.","replies":[{"poster":"Frnak","date":"2016-03-16T23:09:53.406+0000","up_votes":1,"down_votes":0,"body":"---> poor engages tend to be silver. Long ass chases across river is bronze.\n\nGold tends to be tricky with managing sidelanes and such. I've yet to get into plat cause I usually quit in G5...except this season. So far in gold it looks like people are trying to \"counterpick\" and end up having little experience with their champ. I have 70% winrate as Malz right now into G3 and it's been fairly easy minus the couple games where I got camped or was just engaging/chasing a bit too much. \n\n\nIf you can be the lead in good engages you will tend to get more wins in. Or play anti-engage (I play Malzahar, any assassin on my adc or near my backline is eliminated. QSS only removes suppression NOT the damage). \n\nThis is part of why JANNA is so popular as a support. HUGE anti-engage.  \n\nPolitely tell them to not engage when you're behind and pick people off and/or don't chase. \n\nTelling people to wait to engage is 500000% better than the raging I see going on ingame.","replies":[]}]},{"poster":"Serika Zero","date":"2016-03-16T11:27:45.981+0000","up_votes":1,"down_votes":0,"body":"Don't know about your NA server but here on EuW:\n\nchampion diversity: exists in plat and dia just fine (even tho I'm just plat, I can easily see tons of different champions picked in dia as well)\n\nmastery diversity: there exist champions who have choices and others for whom 1 mastery is always better than anything else. And no, that's not thunderlords. ADCs run fervor of battle (Jhin deathfire touch and others Thunderlords), mid laners run thunderlords (or deathfire touch), top laners run Grasp of the Undying (or thunderlords or fervor), junglers run strength of ages (or thunderlords), support run thunderlords (or bond of stone, or windblessing).\nIf you see someone that either has no keystone mastery, or the wrong keystone you know they got the wrong masteries and its more easy for you to win lane/game. There is some diversity regarding masteries, but some champions are the best with a certain mastery, not using that one is like losing the game on purpose. Even so, nobody gives a fuck if you got the wrong mastery (other than your lane opponent).\n\nLONG ASS GAMES: not my style, I don't like 1 hour games. But generally most games for me last from 30 to 40 mins. Rarely 20-30 mins games. Closing games is still difficult in soloq as everyone has a different opinion on how to close games.\n\nPost game chat:\neither \"report xxx for\"\neither .... nothing at all\neither gg team, nice play xxxx (Team mates talking to each other).\nor the random salty person like me (nice camp bro, you sure are pro)\n\nWe don't really talk about the game in end screen of ranked as we either know what we did right or know what we did wrong. There's no point to discuss it.\nHowever, its true that we often don't use the honor feature, as it is useless.\n\nSo, I don't know if its just NA things. But its not true for EuW at least. Unless your definition of higher elo is master and challenger only. Then I don't know what happens in those games.","replies":[]},{"poster":"Surge06","date":"2016-03-16T01:40:56.989+0000","up_votes":1,"down_votes":0,"body":"What I like is the ability to build whatever I want and play whatever I want (unless it's support l). I can do anything, play champions that almost never appear in the LCS. My team usually won't care. The enemies usually don't care, and sometimes get stomper because they never see some champs. AD Teemo mid? Kindred top? Kalista jungle? No-one cares. As long as you don't feed or \"ks\" then low elo is super relaxed.","replies":[{"poster":"AlienPrimate","date":"2016-03-16T09:09:57.363+0000","up_votes":1,"down_votes":0,"body":"KS is good.  KS = kill secure\n\nAnother thing is if someone on your team is about to get an unassisted kill and someone else comes along and takes the last hit it actually increases the gold worth of the kill from the normal 300 to 440 in most cases.  It varies depending on shutdowns and feeding enemies.","replies":[]}]},{"poster":"Dengeden","date":"2016-03-16T06:32:00.329+0000","up_votes":1,"down_votes":0,"body":"When I chalk up the courage and energy to play ranked, I always enjoy it. The intensity of knowing that every little bit counts can be quite thrilling. \n\nBuuuuut I'd like my elo more if people didn't often think the only way to play out post-laning phase was by playing ARAM. Winning or losing doesn't feel very rewarding if it was decided by a 10+ minute siege...\n\nI don't think diversity goes down or up with elo btw. Although it might be true that you want fast early/mid game champions as your carries for more consistent wins. You're right about Masteries tho, they're very role specific.","replies":[]},{"poster":"Bladerunner7777","date":"2016-03-16T04:31:11.322+0000","up_votes":1,"down_votes":0,"body":"The people in Bronze 5 aren't from this planet...\n\nI've... seen things you people wouldn't believe...","replies":[]},{"poster":"Sammystorm","date":"2016-03-16T03:18:41.550+0000","up_votes":1,"down_votes":0,"body":"Being in gold is a love hate relationship. On one hand the games are more competitive which I like. On the other hand comebacks are super rare because people actually know what to do with leads. People also know enough about the game to really make jack ass comments that are somewhat based on fact. Unlike low elo where most of the shit is just made up.","replies":[]},{"poster":"JerulEon","date":"2016-03-16T02:09:39.493+0000","up_votes":1,"down_votes":0,"body":"The \"raging\" is different across elo's.\n\nIn a game I was playing with Plats and high Golds. The two Plat members were literally bitching so hard in chat and one afk'd in base because the other guy wouldn't apologize. He later went on to say that he didn't care that we lost because he had \"so many other accounts in diamond\". LMAO\n\nHigher elo players tend to be more arrogant when they flame but lower elo players usually just blame their teammates and move on -- just in my personal experience.","replies":[]},{"poster":"Exalomaniac","date":"2016-03-16T00:50:59.595+0000","up_votes":1,"down_votes":0,"body":"i hate the long games that have become much more apparent lately. the feeling of doing a bad fight or knowing that you just threw the game is goddamn awful. i had a 50 minute game recently who we lost because they had a better late game/stall comp and when they won that last fight, the whole game felt unrewarding and dull. also dont forget the strategic decisions. one bad call for baron and you lost the game. (plat 1)","replies":[]},{"poster":"Kerchner12","date":"2016-03-15T20:36:45.150+0000","up_votes":1,"down_votes":0,"body":"Hey SKT T1 SION, do you remember me? We played a game over a month ago and I said that I knew you from the boards. You are still the only person that I have ever played with or against that I have seen on the boards. It's just so weird.","replies":[{"poster":"Ben Sharpio","date":"2016-03-15T21:39:37.256+0000","up_votes":1,"down_votes":0,"body":"Hahahaha hey man! Were you the vayne?!","replies":[{"poster":"Kerchner12","date":"2016-03-16T00:12:41.675+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SKT T1 SION,realm=NA,application-id=cIfEodbz,discussion-id=lszKpusp,comment-id=00060000,timestamp=2016-03-15T21:39:37.256+0000)\n>\n> Hahahaha hey man! Were you the vayne?!\n\nYessir!","replies":[]}]}]},{"poster":"Robbit Mang","date":"2016-03-15T23:26:23.851+0000","up_votes":1,"down_votes":0,"body":"https://i.gyazo.com/f1b2259574e20da8a73bf45d6674119d.png\n\nnot necessarily a god but this is what it puts me against...\n\nyeah i enjoy getting a toxic blitz/janna player every 3 games that ruins my day. Ive never been below silver II but id imagine at least in bronze people wouldnt expect you to be a mechanical god at your champion.","replies":[]},{"poster":"nealgoogs","date":"2016-03-15T23:19:32.829+0000","up_votes":1,"down_votes":0,"body":"i hate the long ass games tho rather be quick stomps and move on","replies":[]},{"poster":"dr lichdeath","date":"2016-03-15T23:19:29.653+0000","up_votes":1,"down_votes":0,"body":"meh low elo aint that good 2 games ago i saw an udyr priotise scuttle above the dragon... in ranked... while the enemy was aced he took so long to kill scuttle that the enemy jungler came back alive ran to drake killed the udyr and then took drake obviously we lost that game","replies":[]},{"poster":"Spacesuit Spiff","date":"2016-03-15T23:01:34.680+0000","up_votes":1,"down_votes":0,"body":"I like high elo because strategic teamplay is actually a thing. But its a lot more restrictive in other ways.","replies":[]},{"poster":"QjTHqo3RTq","date":"2016-03-15T22:36:53.556+0000","up_votes":1,"down_votes":0,"body":"I would like to say a couple things.\n\nSilver is toxic, multiple games of no junglers before draft mode, and I still get shoved into roles just because the person higher than me wanted my secondary.\n\nBronze, is a living hellhole that you need to carry yourself out of, and you should do yourself a favor by muting everyone once the game starts.\n\nI hate low elo","replies":[]},{"poster":"Lugg","date":"2016-03-15T20:51:34.692+0000","up_votes":1,"down_votes":0,"body":"Play a few games with some Plat and higher people. You will change your opinion really quick. It's so satisfying not to have to worry about having some idiot on your team trolling or feeding. \n\nLow ELO is pretty much torture anymore.","replies":[]},{"poster":"Gotodead","date":"2016-03-15T20:44:28.547+0000","up_votes":1,"down_votes":0,"body":"high elo = toxic people purposely trying to lose\n\nlow elo = people accidentally losing\n\nbut hard to tell because im biased, obviously its more fun to win 85% of my games in silver-plat then go 60% in diamond. And I get tons of quadras/pentas down there too. Its fun to see the countless mistakes low elo make too.","replies":[]},{"poster":"ValyrianBlade","date":"2016-03-15T19:29:31.105+0000","up_votes":1,"down_votes":0,"body":"I think it really depends on how good you are at the game.\n\nI regularly play with high golds to diamonds in my normal matches. I find normal matches a lot more fun because of this. I can depend on my teammates to make better plays and they're more challenging and exciting. Leads don't rapidly snowball out of control very often. Teams make good decisions on objectives and rotations.\n\nIn ranked, I'm playing mostly with mid-high silver people and a few low golds. Sometimes I can't depend on my allies to do the most basic stuff. Sometimes I legit lose lane to these silver players (I mean, the actual mechanical and skirmishing skill level difference between silver and diamond is almost nothing, it's lots of other factors that make the difference) and when that happens my teams seem to get a little out of control if no one else is getting ahead. Maybe it's just the attitude in ranked vs normals, but I find the higher elo players I have in my normal matches are a lot more understanding of falling behind in lane and helping keep you relevant in the game in these cases. In silver ranked, the team basically abandons you and scapegoats you and just tries to all solo carry whenever someone falls behind. \n\nAlso, I think it has to do with your playstyle.\n\nDo you play an assassin? You'll like low elo. Do you play super snowbally champions? Low elo. Etc...\nI prefer a passive playstyle. I could care less about going 0/0/0 in lane, I just want to out CS my lane opponent by 30-40 in the early game. I want to win on strategic decision making. I don't want to win or lose depending on whether the enemy jungler is nearby when I'm about to go all in. In low elo that doesn't work though, if you're not getting yourself fed you can't snowball enough to carry the people on your team that are dying. I can't count the number of times I'm winning lane pretty hard and really bullying my lane opponent, only to get ganked right as I'm about to all in for the kill and suddenly be behind in lane.","replies":[]},{"poster":"ditzyandpetite","date":"2016-03-16T23:13:19.220+0000","up_votes":1,"down_votes":1,"body":"Next time, I'd appreciate it if there was a tl;dr section! Thanks!","replies":[]}]}