{"poster":"Kumaruchan","date":"2016-09-11T09:47:40.599+0000","title":"[Champion Concept] Tyto, Il Custode della Visione/ The Visionkeeper","subforum":"Creazioni della community","embed":{"description":null,"url":"https://65.media.tumblr.com/4ce5e8969cd0a1af2ee35a67d9c8441b/tumblr_odabfiJV9G1vzj7ero1_1280.png","image":null},"up_votes":7,"down_votes":1,"body":"Salve a tutti! sono Kuma e questo è il mio primo post sul forum!!\r\nSono un giocatore come tutti voi (ho ancora moltissimo da imparare) e mi sono innamorato del gioco circa un anno fa per via dei sui personaggi. Essendo un illustratore e un character designer in erba adoro il modo in cui la Riot sviluppa e crea i champion presenti nel gioco a partire dal loro design fino alla lore dietro ognuno di loro. Una dei miei desideri sarebbe quello di lavorare per loro come character designer.\r\n\r\nquello che ho intenzione di fare è proporvi i concept dei champion che ideo ma, non essendo un giocatore esperto, posso limitarmi solo al loro aspetto e ad immaginarne il ruolo che potrebbero ricoprire, quindi chiedo a voi giocatori e utenti del forum, più esperti di me, di proporre il kit del champion che ho ideato nei commenti. Sentitevi liberi di propormi qualunque tipo di incantesimo,passiva, frase, statistica (ovviamente che sia coerente con il background del campione) e io provvederò a tenere il post aggiornato con tutto il processo di creazione del campione. Nel link c'è il concept (primordiale) del campione e qui sotto c'è la storia che ho ideato per lui. Spero vi piaccia ^^\r\n\r\nTyto - Il Custode della Visione/ The Visionkeeper\r\n\r\nDESCRIZIONE\r\nTyto, il custode della visione, è un giovane gufo proveniente dal Bosco Antico. Il suo ruolo principale in battaglia è quello del support a distanza; Tyto ha la capacità di rendere visibili ai propri alleati le manovre del team nemico donando visione sia sui campioni nemici sia su diverse zone della mappa in modo da far reagire i propri alleati di conseguenza.\r\n\r\nLORE\r\nTyto, il custode della visone, prima di diventare tale era un normale ragazzo proveniente dal Bosco Antico. Prima di lui suo padre, Bubo, deteneva il titolo di \"custode della visione\". Il custode ha il compito di vegliare per tutta la sua vita sulla Runa della visione: Questa potentissima quanto mastodontica runa è la fonte di ogni tipo di luce su Runeterra ed impedisce alle ombre di invadere il bosco antico e il mondo. Il custode e la runa stipulano un patto secondo cui la runa dona al custode una lunga vita e la capacità di usare i suoi poteri e il custode giura di proteggere la runa  per tutta la sua vita. Tyto vide morire il suo amato padre che si sacrificò per tenere fede alla promessa fatta come custode.\r\n\r\nUna notte, mentre Tyto era solo nella casa in cui viveva con suo padre, busso' alla sua porta un viandante che,a prima vista sembrava abbastanza malandato , e che chiese al giovane Tyto di offrirgli rifugio da una banda di banditi che lo stavano inseguendo. Tyto, mosso da compassione, fece entrare il viandante e lo ospitò per quella notte. La notte passava tranquilla fino a quando Tyto sentì degli strani rumori provenire dal santuario della Runa della visone. Quando arrivò nel santuario vide il viandante ai piedi dell'altare sopra cui fluttuava l'enorme runa; il viandante stava cercando di scheggiare la runa con uno strano pugnale che brillava di una luce cupa e sinistra, una luce che gli incuteva la stessa paura che provava quando suo padre gli raccontava una delle tante storie legare alle ombre. Il viandante in realtà era un cultore delle ombre, un fanatico che adorava le ombre e il loro potere distruttivo come delle divinità e che desiderava riportare la loro distruzione nel mondo. Il viandante riuscì a cheggiare la runa quanto basta per far bacillare la barriera che teneva le ombre lontane. Le ombre cominciarono ad invadere la dimore di Tyto, tutta la casa calò in un sinistro e opprimente buio; la runa lentamente si stava avvicinando al terreno e sia Tyto che il viandante furono travolti dall'oscurità.\r\n\r\nQuando il padre di Tyto fece ritorno era ormai troppo tardi: Gran parte della sua casa era caduta in rovina e le ombre stavano cominciando ad estendersi per tutto il Bosco Antico. Una volta giunto nel santuario Bubo vide suo figlio,Tyto, a terra circondato dalle ombre, la runa della visione che giaceva al suolo come un comune masso e infine il cultore dell'ombra che era in ginocchio circondato e consumato dall'oscurità che fuoriusciva senza sosta dal pugnale che teneva in mano, mentre rideva istericamente. \r\nCiò che vide Bubo lo convinse ad attuare l'ultimo sacrificio, il sacrificio necessario affinché l'equilibrio fosse ristabilito e a tener fede alla promessa fatta. Poggiò una mano sulla Runa della visione e dopo aver pronunciato con un filo di voce una formula vi fu' soltanto una luce accecante che si estese per tutto i Bosco Antico. La luce dissolse tutte le ombre e portò via con se il viandante e tutta la desolazione che le ombra avevano scatenato.\r\n\r\nBubo sparì. Il figlio riuscì solo a trovare il bastone che suo padre si portava  sempre dietro, giacere a terra, sotto la runa di nuovo attiva. Quando Tyto prese quel bastone questo si tramutò in pochi secondi in un arco molto più grosso del piccolo gufo. Tyto sapeva che ora toccava a lui mantenere la promessa fatta da suo padre.\r\n\r\nSpero vi piaccia e spero partecipiate numerosi alla discussione! alla prossima {{sticker:slayer-jinx-wink}}","replies":[{"poster":"HaIIeIujah","date":"2016-09-11T11:49:10.397+0000","up_votes":1,"down_votes":0,"body":"Stories: Path of Destinies è stato di ispirazione , o la somiglianza è casuale?\nIn ogni caso, normalmente non commento sui champ in pura lore, ma mi sembra ci sia stato un bel po' di lavoro speso, quindi commento qualcosa:\n\nIl problema principale che ha la tua lore è che introduce una nuova fazione senza legami particolari col mondo esistente. Il concetto di Elderwood è non-canon nello standard, ma l'idea di introdurlo da zero è unica e agisce bene con il design del champion. Quindi, cominciamo:\n\n-Esiste già nella storia canonica il concetto di \"World Rune\" a cui la RUna della Visione sembra fare riferimento. Per tanto, ti consiglierei di palesare la connessione e di ridurre un minimo il campo di azione della runa in sè (ie \"Luce e protezione solo al Bosco Antico\" piuttosto che all'intera Runeterra, per mantenerla al livello di potenza su scala nazionale delle altre\n-I tuo primo paragrafo introduttivo dovrebbe essere concentrato unicamente sul champion, per cercare appunto di introdurlo in un numero minimo di righe-piuttosto che fare due riferimenti al padre.\n-IL concetto di \"Cultore delle ombre\" sembra un attimo ridondante considerata l'esistenza della Fazione Shadow Isles. Capisco che non è lo stesso ( Ombra = / = Morte) ma sembra superfluo introdurre un intera nuova fazione. Alternative: ridurlo ad un semplice mortale ossessioanto dal potere delle World Runes, un membro della Black Rose o qualcosa di affine allo Shadow Power di Zed.\n\nQuanto al Kit in sè, mi farebbe piacere partecipare- ma crearlo via forum è assurdamente complicato. Se hai un mezzo di contatto diretto e vuoi continaure la discussione in privato sono disponibile. Altrimenti, buona fortuna con Tyto, è un ottimo concetto di base.","replies":[{"poster":"Kumaruchan","date":"2016-09-11T13:52:12.098+0000","up_votes":2,"down_votes":0,"body":"Ciao, mi fa molto piacere che tu abbia commentato :D in realtà ho preso ispirazione da varie cose ma principalmente dal fatto che vorrei davvero vedere un gufo nei campi della giustizia e quindi mi sono dato da fare per conto mio ahahah Purtroppo io sono un umile illustratore, ho ideato la lore di Tyto nella mia testa e ho provato a scriverla come uno sceneggiatore ma non ne sono capace, lo ammetto ^^ la questione del Bosco Antico è molto giusta come osservazione e apporterò le modifiche che hai suggerito :D per discutere del kit sono disponibile in qualunque momento sul client come Kumaruchan e su Curse con lo stesso nome, se ti va' io sono lì {{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"HaIIeIujah","date":"2016-09-11T15:27:50.958+0000","up_votes":1,"down_votes":0,"body":"Mandata la richiesta (Come Threathlist).  Tra oggi e domani possiamo discutere.","replies":[{"poster":"Kumaruchan","date":"2016-09-11T15:39:35.425+0000","up_votes":1,"down_votes":0,"body":"non mi è arrivato nulla e con il nickname Threathlist non trovo nessuno :/","replies":[{"poster":"HaIIeIujah","date":"2016-09-11T15:54:28.363+0000","up_votes":1,"down_votes":0,"body":"Da Curse intendo. Su league è Shin Tera.","replies":[]}]}]}]}]},{"poster":"LastTrinity","date":"2020-01-09T11:28:23.679+0000","up_votes":1,"down_votes":0,"body":"Io un paio di idee ce le ho:\n\nPassiva: guardiano della runa: Finche Tyto e in un cespuglio guadagna raggio di visione e attacco aumentato di 2 per livello. Quando lascia il cespuglio lascia per 20 secondi un oggetto (Tipo una piuma) che garantisce visione come un ward normale e puo essere attaccato per rimuoverlo (dal nemico per intenderci).\n\nQ: Freccia precisa: Tyto spara un proiettile con il suo arco (il bersaglio viene sicuramente colpito) che rallenta per 0.5|0.75|1|1.25|1.50 del 30% e infligge danni pari a 50|75|100|125|150 piu 25% AP\n\nW: Rifugio della foresta: Tyto applica uno scudo ad un alleato che dura 2 secondi e protegge per 30|50|70|90|120 piu 60% AP e protegge dalla prossima abilita nemica che applica CC\n\nE: Arco onnisciente tyto spara una freccia in modo arcuato (tipo una catapulta) che infligge 25|50|75|100|125 piu 40% AP che garantisce visione per 1|1.5|2|2.5|3 secondi in un raggio di 100|150|200|250|300 unita nel luogo dove atterra.\n\nR:\nPassiva: Occhio rivelatore: Ogni 6 attacchi base o abilita il campione nemico e rivelato per 1 secondo e viene accecato per 0.75 secondi\nAttiva: Tyto rivela un area intorno ad un campione 2000|2500|3000 unita(Similmente a Quinn) e guadagna 50%|60%|70% velocita di movimento verso quel campione.","replies":[]},{"poster":"EmptyHole","date":"2016-09-11T10:59:38.039+0000","up_votes":1,"down_votes":0,"body":"Interessante, molto interessante, vorrei proporre delle abilità basate sulla lore che hai scritto, giusto per divertirmi.\n\nPASSIVA:\n\nConsiderando che ha un bastone che passa dallo stato di bastone a quello di arco, proporrei una strana meccanica.\n\nQuando Tyto è a meno di X unità dal bersaglio che vuole attaccare, i suoi attacchi diventano melee, se il bersaglio che vuole attaccare è a oltre X unità gli attacchi diventano relativamente ranged.\n\nQ:\n\nLa mia idea è che abbia un frammento di runa che gli giri attorno, stile palla di orianna, la Q vorrei fosse un breve dash (che oltrepassa i muri) e che lasci dietro di se quel frammento dando visione come una ward per X secondi, per poi tornare da lui.\n\nR: (si esatto R)\n\nQuesta è particolare, sarebbe simpatico se, piazzando il bastone per terra in un punto deciso dal giocatore, Tyto perdesse la capacità di autoattaccare, e tutte le abilità diventassero interattive con il bastone, per esempio la Q gli permetterebbe di dare visione in un'ampia area attorno a se. riattivando la R si creerebbe un'esplosione che danneggi tutti i nemici e dia visione delle unità invisibili...\n\nSI lo so non è un gran chè ma ci si può lavorare sopra :P","replies":[{"poster":"edoxbox1","date":"2016-09-12T14:48:02.958+0000","up_votes":1,"down_votes":0,"body":"La Passiva mi sembra molto come Funzione thresh ^^\nE' possibile che tu ti sia ispirato a lui ?","replies":[]},{"poster":"Kumaruchan","date":"2016-09-11T13:38:26.769+0000","up_votes":1,"down_votes":0,"body":"No invece, mi piace tantissimo la Q e la passiva, non essendo per nulla esperto di gameplay e di bilanciamento nel creare un champion e mi sorprendo di come i giocatori più esperti abbiano un sacco di idee, grazie davvero :D","replies":[]}]},{"poster":"99White Terror99","date":"2016-09-11T17:36:48.758+0000","up_votes":1,"down_votes":0,"body":"come ha detto shin tera, introdurre una nuova fazione è complicato visto che già ora ce ne sono e che stanno anche facendo una sorta di identificazione dei campioni nelle loro fazioni con gli aggiornamenti per le lore.\n\nla soluzione sarebbe introdurlo nella giungla di kumungu visto che da lì arrivano alcuni campioni come rengar, kha'zix, nidalee o gnar (se leggi la sua lore, è raccontata da un cacciatore, quel cacciatore è rengar, ergo gnar viene da kumungu).\n\nper le abilità non posso darti una mano, mi spiace, coi support non ho affinità, non li gioco e non avrei idee per un kit che sia unico visto che il concept è molto buono e merita un kit altrettanto buono\n\nper la splash, non è una critica, mi piace molto, ma se posso darti consigli visto che anch'io disegno, in particolare creature mitologiche infatti sto per finire la splash del mio campione, comunque pensavo che se ci metti un braccio che esce dal mantello/ali che tiene il bastone/arco perchè così lo trovo monodimensionale e sebra troppo alto, con la testa sproporzionata al corpo quando invece guardando bene è tutto giusto, poi non capisco bene se le gambe hanno le articolazioni alla uomo oppure come le zampe posteriori degli animali ed enfatizzerei le zampe facendole più gufose, la sciarpa è bellissima col mantello e la protezione per la spalla, gli dà quell'aria da ragazzo, mi piace un botto, come i particolari dei vestiti\nin ogni caso è uno dei pochissimi concept che hanno una splash art originale e ben fatta e per questo ti faccio i complimenti, sei un grande, spero che un giorno riuscirai a lavorare per la riot e magari a portare tyto nella landa","replies":[]},{"poster":"Bruco","date":"2016-09-11T11:33:57.586+0000","up_votes":1,"down_votes":0,"body":"Ciao, \nCome te anche io più volte mi sono imbattuto nell' idea di creare un champ in grado di coordinare o di  obbligare il proprio team a prendere vison di una zona o un campione nemico.\nAlla fine mi sono reso conto che la skill ultimare più ovvia è \"prendi vison su tutto il team nemico\" in stile ulty di tf ... mi spiego sarebbe un ulty con passiva e attiva\nR attiva già dal livello 1 (solo la passiva) al 6 sblocchi la attiva che scala sia in range che in damage  tipo  2000/3000/4000/5500   e 3% 4% 5%\n- passiva: in base a quanti nemici in vision  tyto ha in un determinato raggio d'azione (5500 unità) garantisce per ogni campione un 5% di danni puri aggiuntivi al suo team (solo sui campioni nel raggio d'azione) \n-attiva: il range scompare estendendosi a tutta la mappa e il suo team ottiene il 25% di danni aggiuntivi istantaneamente \nQ\n-attiva: tyto ha a disposizione \"3 altari gufosi\" tipo funghi di teemo per intenderci con la stessa durata questi garantiscono visione fino a che non vengono calpestati dal nemico che li distrugge garantendo però visione su questo avversario per una durata di 3/4/5/6 secondi e rallentando i suoi movimenti del 20% per 3 secondi\nw\n- attiva: il nemico colpito da questo incantesimo (stile varus  puoi colpire anche tutto il team avversario se ci riesci) per 3 secondi vedrà tutti i membri del tuo team nel tuo raggio d'azione  (attacco base) come dei gufetti (stile scoiattoli di lulu). con questa abilità oltre al al fatto che il nemico vedrà solo gufi non vedrà gli attacchi e le abilità di questi.\ne\n-attiva: tyto pianta l'arco nel terreno creando un area all interno della quale tutti i nemici vedranno le vite di tutti, alleati e nemici, bloccate anche se in realtà stanno subendo danni (durata 3 sec massimo) Tyto non è bersagliabile\n\npassiva gli attacchi di tyto rendono visibile il nemico per 1 secondo anche se questo entra in un bush\n\nSono idee a caso scusami la grammatica ma l'ignoranza domina mi piacerebbe discutere e confrontarci magari su skype o ts","replies":[{"poster":"Kumaruchan","date":"2016-09-11T13:43:12.280+0000","up_votes":1,"down_votes":0,"body":"La E mi piace davvero tanto ( non immagino le trollate possibili con una skill del genere in un team fight ahahah) anche la ulti è carina :D per discuterne io sono disponibile su curse come Kumaruchan e anche ovviamente su lol con lo stesso nome, se vuoi io sono lì :D","replies":[]}]}]}