{"poster":"Lukipi","date":"2019-08-01T12:53:57.615+0000","title":"¿EL SISTEMA DE EMPAREJAMIENTOS FUNCIONA CORRECTAMENTE?","subforum":"Charlas Generales","up_votes":2,"down_votes":1,"body":"**¿No les pasa que en su equipo tocan afk, trolls o simplemente gente que no juega bien pero cuando miras el quipo contrario parece que hacen todo bien?** {{summoner:3}} \r\n\r\nSe que van a decir \"tenes que carrear, aprender a jugar mejor, es tu culpa, etc etc... este post no trata de eso, trata de que a mi parecer siempre algo hace que gane 3 o 4 partidas bien, o tenga una racha de victorias y después mágicamente me toca la situación que comente mas arriba {{item:3151}} \r\n\r\nEntiendo que si perdes y tenes un MMR bajo y todo eso te emparejan con gente \"mala\"... ahi es donde viene mi cuestion... **si pierdo, me emparejan con \"GENTE MALA\" EN MI EQUIPO, ¿PERO EL CONTRARIO? SIGUE TOCANDO GENTE \"NORMAL\" EN CONTRA!!** y me parece que no es una coincidencia o algo del azar, ojo, este post no es para hablar de la habilidad unipersonal... me llama la atencion eso, quizas solo estoy loco y equivocado... en fin, seguire perdiendo partidas por gente que entra a boludear y nadie hace nada! :) {{summoner:6}}","replies":[{"poster":"Maito Gui","date":"2019-08-01T14:14:11.648+0000","up_votes":3,"down_votes":0,"body":"che capo cuando pensas debutar?","replies":[]},{"poster":"martincarp","date":"2019-08-01T14:47:21.325+0000","up_votes":2,"down_votes":0,"body":"\"Trata de que a mi parecer siempre algo hace que gane 3 o 4 partidas bien, o tenga una racha de victorias y después mágicamente me toca la situación que comente mas arriba\".\n\nDiste en el clavo. El emparejamiento está diseñado para que (más o menos, números no oficiales) aproximadamente el 70% de las partidas estén totalmente inclinadas a favor de un lado, el 35% sería a tu favor (típico equipo que rota bien, ganan todas las líneas, jungla parece que tiene un TP cada 2 segundos, etc.), 35% son en contra (jungla no gankea y aún así está abajo en farm, todas las líneas van como la xuxa, no pueden defender ni un objetivo, etc.), y solo el resto de las partidas son más parejas, y ESAS son las que deciden si mereces subir o bajar.\n\nObviamente inventé números porque eso va variando dependiendo del MMR, si el sistema considera que merecés subir o bajar, etc.\n\nMi consejo sería que cuando te das cuenta que estás en una de esas partidas donde es casi seguro que vas a perderlas, relajes la mente. Creo que no hace falta aclarar que tenés que seguir intentando ganar, uno nunca sabe cuando a un rival se le puede caer la electricidad o pasar algo y te regala la victoria, pero dejá de presionarte al punto de perjudicar tu estado emocional (llamalo tilt, tryhardeo, toxicidad, o lo que sea que te pueda llegar a pasar), sino que tomalo como lo que es, un game que estabas destinado a perder y estás ahí como pasajero del destino.","replies":[{"poster":"Lukipi","date":"2019-08-02T01:18:20.866+0000","up_votes":1,"down_votes":0,"body":"{{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"Zelos From Jonia","date":"2019-08-01T17:38:28.482+0000","up_votes":1,"down_votes":0,"body":"+1","replies":[]}]},{"poster":"Annie Botz","date":"2019-08-01T15:01:39.432+0000","up_votes":1,"down_votes":1,"body":"Solo son par de selectos por parte de Riot. Cautelosamente les tiran rondas de mala suerte, para esto predicen el futuro de cada invocador y aquellos que fueron seleccionados son obligados a jugar con personas que se tenía previsto iban a trolear. Así la sociedad los tacha de locos, porque realmente lo están, ya que todo es una invención en sus cabezas lo que les impide aceptar errores y ascender.","replies":[{"poster":"Zelos From Jonia","date":"2019-08-01T17:29:21.434+0000","up_votes":1,"down_votes":0,"body":"P.D.: Sarcasmo-\n\n\n***no se por que me parecio que no lo iban a entender algunos ***","replies":[]}]},{"poster":"Darkley","date":"2019-08-01T13:52:36.370+0000","up_votes":1,"down_votes":0,"body":"yo cuando gano muy bien suele salirme un tontito en la proxima. no es de excusa, ejemplo de ayer: oro 1. gano practicamente solo de support, mvp honores y todo eso, la otra partida que me salio? gente de enteoria mas elo (segun oppgg), pero no, 3 mids, shaco se pone ignite en vez de smite, me quedo solo en bot, perdemos","replies":[{"poster":"Priestess Winda","date":"2019-08-01T14:00:14.839+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Darkley,realm=LAS,application-id=v7qsfXsE,discussion-id=XI6P7EE2,comment-id=0001,timestamp=2019-08-01T13:52:36.370+0000)\n>\n> yo cuando gano muy bien suele salirme un tontito en la proxima. no es de excusa, ejemplo de ayer: oro 1. gano practicamente solo de support, mvp honores y todo eso, la otra partida que me salio? gente de enteoria mas elo (segun oppgg), pero no, 3 mids, shaco se pone ignite en vez de smite, me quedo solo en bot, perdemos\n\ndoy fe que a mi smurf la bajaron de oro 1 a oro 3 por una racha estupida de derrotas y ayer gane como 6 seguidas sin mucho problema, casualidad? no lo creo (?{{sticker:slayer-jinx-wink}} {{sticker:sg-ahri-3}}","replies":[]}]},{"poster":"Hendrix","date":"2019-08-01T13:25:07.226+0000","up_votes":1,"down_votes":0,"body":"No es exactamente que siempre el equipo rival juega bien\nEl que ve eso, solo ve la mitad de la realidad\n\nYo lo que veo es que las partidas, en su gran mayoria, son muy desparejas. O se ganan muy facil o se pierden por paliza, pero es muy raro encontrar partidas que sean parejas, de esas que no sabes quien las gana hasta el ultimo segundo.","replies":[{"poster":"Lukipi","date":"2019-08-01T13:47:59.206+0000","up_votes":1,"down_votes":0,"body":"Yo siento a medida de que voy perdiendo partidas (ya sea por mi o por mi team) me va tocando con gente de mas bajo nivel pero del lado contrario no se modifica la dificultad... {{item:3070}}","replies":[]}]}]}