{"poster":"Khäda","date":"2017-05-03T07:26:10.822+0000","title":"Jugadores de Solo/Duo molestando en las Flex.","subforum":"Comportamiento del jugador","up_votes":6,"down_votes":0,"body":"Hola, muy buenas. Esta season tengo pensado jugar solo las flex y cada vez me encuentro con mas gente que entra en flex y trollea o juega mal a proposito, no ayuda al equipo, en resumen... molesta. Y si les dices que lo reportaras dicen &quot;me da igual si yo solo juego las Solo/Duo&quot;, suben a un elo alto(o a su meta) y se meten en las rankeds flex a molestar a los que queremos subir en flex. Me gustaria que a las parsonas que hacen cosas asi les afecte (a demas de recibir su castigo de un tiempo definido sin jugar) a las otras colas de ranked y por lo tanto no seguirian haciendo lo mismo. En flex actualmente estoy en plata 2 y me han emparejado con gente que esta en diamante/platino/oro que como les toca un troll en Solo/Duo por ejemplo, se van a las flex a molestar, a descargar su enojo con los demas con el consentimiento de &quot;total... si son las flex&quot;. No creo ser el unico que piense esto sobre el tema. Gracias :D","replies":[{"poster":"Cyclosarin","date":"2017-05-03T11:33:56.570+0000","up_votes":3,"down_votes":2,"body":"Las flex son las reclutamiento normal para mi y para muchisimos (incluyendo rioters que en este mismo foro sugirieron que se juegue flex para probar champs). No juegues flex de manera competitiva porque no tendrás una buena experiencia de juego, juegalas para divertirte o jugar con amigos en un modo donde podés banear y elegir que linea jugar sin problemas. \n\nHoy por hoy, las flex no tiene futuro, Riot las condenó a la muerte desde el mismo que las puso online y, para rematarla, quitó normal draft.\n\nSaludos!","replies":[]},{"poster":"Exorsus","date":"2017-05-03T12:58:16.441+0000","up_votes":1,"down_votes":0,"body":"Yo no juego mucho flex por eso mismo, juego con premades solamente y muy rara vez juego solo, aunque flex me lo tomo con menos seriedad.","replies":[{"poster":"Khäda","date":"2017-05-06T00:23:46.101+0000","up_votes":1,"down_votes":0,"body":"Yo sinceramente me tomo con seriedad todas las partidas, ya sea ranked solo/duo, flex, normales, etc. Nunca me calleron bien los que suelen decir \"es una normal no importa perder\",(mi punto de vista) a ver flaco... es una normal y todo lo que quieras pero son 20-40 minutos perdidos gracias a que vos te lo tomas asi y no jugas como se debe. en esos 20-40 minutos que pierde uno gracias a un bobito que dice eso se podria haber hecho otras cosas pero uno los pierde por esas personas. El LoL es un juego competitivo y para divertirse. Pero ser competitivo no quiere decir no divertirse, yo juego todas las partidas a ganar y me divierto igual. No necesariamente tenes que dejar de ser competitivo para divertirte.","replies":[]}]},{"poster":"NickW","date":"2017-05-03T07:38:54.583+0000","up_votes":1,"down_votes":0,"body":"Mas alla de los trolls que te puedan tocar, las flex están en un momento complicado, no se cuanto mas van a aguantar.\nEstán emparejando indistintamente jugadores de casi todas las ligas en una partida, lo que significa que es una cola poco saludable, lo cual genera justamente estas actitudes que vos marcas.\nSin ir mas lejos, en tus partidas, siendo vos plata II en las flex, te emparejan con gente que va desde bronce III a platino III, lo cual no tiene ningún sentido.\nHabrá que ver que hace Riot al respecto.","replies":[{"poster":"Khäda","date":"2017-05-06T00:18:49.730+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=NickW,realm=LAS,application-id=PJAKt7ph,discussion-id=rKUBMsYN,comment-id=0000,timestamp=2017-05-03T07:38:54.583+0000)\n>\n> Mas alla de los trolls que te puedan tocar, las flex están en un momento complicado, no se cuanto mas van a aguantar.\n> Están emparejando indistintamente jugadores de casi todas las ligas en una partida, lo que significa que es una cola poco saludable, lo cual genera justamente estas actitudes que vos marcas.\n> Sin ir mas lejos, en tus partidas, siendo vos plata II en las flex, te emparejan con gente que va desde bronce III a platino III, lo cual no tiene ningún sentido.\n> Habrá que ver que hace Riot al respecto.\n\nMe ha llegado a emparejar con un Diamante 3. Por suerte era de mi team XD","replies":[]},{"poster":"TheSystruction","date":"2017-05-03T16:48:25.199+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=NickW,realm=LAS,application-id=PJAKt7ph,discussion-id=rKUBMsYN,comment-id=0000,timestamp=2017-05-03T07:38:54.583+0000)\n>\n> Mas alla de los trolls que te puedan tocar, las flex están en un momento complicado, no se cuanto mas van a aguantar.\n> Están emparejando indistintamente jugadores de casi todas las ligas en una partida, lo que significa que es una cola poco saludable, lo cual genera justamente estas actitudes que vos marcas.\n> Sin ir mas lejos, en tus partidas, siendo vos plata II en las flex, te emparejan con gente que va desde bronce III a platino III, lo cual no tiene ningún sentido.\n> Habrá que ver que hace Riot al respecto.\n\nen mi caso, me toco un diamante IV 4 en contra en una promo de B1 xD","replies":[]}]},{"poster":"MarKowniKoff","date":"2017-05-03T13:24:23.655+0000","up_votes":1,"down_votes":0,"body":"En mi opinion es como un segundo paso para practicar, ya que la gente lo toma un poco mas en serio","replies":[]},{"poster":"spitfire1945","date":"2017-05-03T12:32:17.589+0000","up_votes":1,"down_votes":0,"body":"El tema de las flex es que se puso por varios motivos: para compensar  a los jugadores que van en pre-made (por lo tanto podes rankear con amigos de distinto elo), para reemplazar a las normales reclutamiento, por lo tanto te encontras con gente que prueba champs, y para suplir esa angustia de algunos que no pueden pasar de cierta liga,es otra herramienta para no tener que abrir otra cuenta. En mi caso empece a jugar las flex para comenzar mi experiencia en las ranked, puesto que la duo puede ser bastante estresante para comenzar. Saludos","replies":[]}]}