{"poster":"Ckraulckrapfen","date":"2015-11-05T19:09:48.515+0000","title":"Season 6 MultiQ","subforum":"Clans & Teams","up_votes":2,"down_votes":0,"body":"Hallo an alle =)\r\n\r\nWie ihr eventuell bereits mitbekommen habt wird es in der Preseason viele Ver&auml;nderungen in LoL geben. Darunter auch einige &Auml;nderungen was die Solo/DuoQ Warteschlange angeht. Es wird m&ouml;glich sein in der Einzelrangliste mit bis zu 5 Mitspielern zu spielen (also 5 Premades) die Elo wird dabei zwar eine Rolle spielen allerdings soll der Bereich in welchem die Spieler sich befinden m&uuml;ssen recht gro&szlig;z&uuml;gig gehalten sein. Die Informationen dazu findet ihr auf der Offiziellen Homepage oder auf surrenderat20.net.\r\n\r\nNun zum eigentlichen Thema:\r\n\r\nIch habe die Absicht im Verlauf von Season 6 in der Solorangliste mindestens auf Challenger mit 500 LP aufzusteigen. Daf&uuml;r suche ich noch Leute mit denen ich mich im Verlauf der Preseason in der neuen Warteschlange einspielen kann um sp&auml;ter mit ihnen dieses Ziel zu erreichen. Die Ausgangselo die ihr habt ist mir dabei egal solange ihr auf einem hohen Level spielt und in der Lage seit schnell dazu zu lernen. Nat&uuml;rlich m&uuml;sst ihr die Anforderungen erf&uuml;llen welche ben&ouml;tigt werden um mit mir in die Warteschlange zu gehen. Dazu ist zu sagen dass ich Platin 2 bin. Da allerdings noch nicht bekanntgegeben ist wie gro&szlig; der Elounterschied sein darf kann ich dazu auch noch nichts sagen.\r\n\r\nBis jetzt habe besteht die Gruppe aus mir als Midlaner und einem Jungler welcher das shotcallen &uuml;bernehmen wird( er ist Dia4).\r\n\r\nBitte meldet euch nur bei mir wenn ihr wirklich das gleiche Ziel oder wenigstens ein &auml;hnliches Ziel verfolgt. Ich habe weder vor irgendjemanden zu carrien noch mich carrien zu lassen. Genauso ist es mir total egal f&uuml;r wie unwahrscheinlich ihr mein Vorhaben haltet solltet ihr mitmachen wollen sagt es mir wenn nicht denkt euch euren Teil!!!\r\n\r\nIch freue mich &uuml;ber jeden der mitmachen m&ouml;chte da es ja doch ein recht Ehrgeiziges Ziel ist.\r\n\r\nMFG Law","replies":[{"poster":"MagischerKarpfen","date":"2015-11-05T23:08:16.259+0000","up_votes":2,"down_votes":0,"body":"Hey,\n\nwürde auch gerne mitmachen, könnte mit thomas die botlane übernehmen wir haben auch schon paar mal duo gemacht sind also ein krasses team das alles zerippt nohomo <3{{summoner:4}}","replies":[{"poster":"MagischerKarpfen","date":"2015-11-05T23:10:00.159+0000","up_votes":1,"down_votes":0,"body":"gerade platin 3 adc {{champion:6}}","replies":[]}]},{"poster":"Tindesco","date":"2015-11-05T19:14:50.039+0000","up_votes":2,"down_votes":0,"body":"Hallo\n\nIch finde dein ziel realistisch aber schwer mann muss sehr oft spielen glaube ich. Ich würde gerne mitmachen bin Main Supp Plat 5\nAdded mich einfach heiße Konsolenchef ingame.\n\nLg Thomas","replies":[]}]}