{"poster":"One Hit U Quit","date":"2017-02-19T13:43:19.290+0000","title":"ist das riot sein ernst","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":24,"body":"Ich bin von gold 3 auf gold 2 was nicht meine elo ist eig bin ich oberer Platin bereich aber in dieser sesson ist es einfach nicht m&ouml;glicha auf zusteigen da man nur trollers und afklers bekommt ich habe 5 spiele hintereinander verloren habe meine lane immer gewonnen war imm er der die tf gestartet hat meien andere lanes habe so hard gefedet das sie nachd em feeden sogar afk gegangen sind das jetztr 5 games infolge\r\nganz erhrlich riot wenn ihr wollt das ich nicht aufsteiuge schreibt es mir und verschwendet nicht meien zeit ich spiel immer gut aber meint eam ist immer so bad und die gegner spielen alle als w&auml;ren sie ein lcs team und er hies mal das manh nach dem aufstieg ohne ein win nicht  absteigen kann warum ist mir dass dann pasiert warum alle meine freunde bekomen gute leute steigen auf ich als paltin 2 spieler drobbe noch auf silber wegen unf&auml;higen teams","replies":[{"poster":"Cûrrywûrst","date":"2017-02-19T14:31:24.517+0000","up_votes":14,"down_votes":1,"body":"ist doch klar\n\nRiot will das du ein Deutschkurs belegst ....","replies":[{"poster":"Soúp","date":"2017-02-20T09:04:21.852+0000","up_votes":7,"down_votes":0,"body":"> [{quoted}](name=Cûrrywûrst,realm=EUW,application-id=KYnfKGf0,discussion-id=gep05o4u,comment-id=0007,timestamp=2017-02-19T14:31:24.517+0000)\n>\n> ist doch klar\n> \n> Riot will das du ein Deutschkurs belegst ....\n\nein**EN** Deutschkurs.","replies":[]},{"poster":"Ozuraak","date":"2017-02-19T19:25:20.858+0000","up_votes":3,"down_votes":1,"body":"Ich glaube, der Zug ist lange abgefahren, der Zug ist entgleist und das Gleis wurde nachträglich abgetragen.","replies":[]},{"poster":"Alânte","date":"2017-02-19T15:35:18.966+0000","up_votes":3,"down_votes":2,"body":"http://www.dass-das.de/\n\nhehe xd","replies":[]},{"poster":"Superdrachespark","date":"2017-02-19T15:33:19.625+0000","up_votes":1,"down_votes":1,"body":"{{sticker:slayer-pantheon-thumbs}}","replies":[]}]},{"poster":"TerrorRaven","date":"2017-02-19T14:47:45.388+0000","up_votes":9,"down_votes":1,"body":"Und wieder ein weiterer \"Öh, ich habe nur dumme Teammitglieder, die mich am aufsteigen hindern\"-Heulthread. Netter Abschluss des Wochenendes.","replies":[]},{"poster":"lIlIIlIIlIlIlIl","date":"2017-02-19T13:46:43.617+0000","up_votes":6,"down_votes":0,"body":"http://www.troll.me/images/futurama-fry/not-sure-if-trolling-or-being-serious.jpg","replies":[]},{"poster":"Rudeltreiber","date":"2017-02-19T13:53:23.449+0000","up_votes":6,"down_votes":1,"body":"Scheinbar ist es deine Elo, sonst wärst du ja nicht dort. Als ehemaliger Platin 2 solltest ja eigentlich wissen, wie man Games carried, da brauchst nicht dein Team für blamen. Bei ner 41% Winrate kannste für Gold 2 noch dankbar sein.\n\nMal davon abgesehn, dass deine Rechtschreibung und Grammatik echt unterirdisch sind....","replies":[]},{"poster":"One Hit U Quit","date":"2017-02-19T14:35:47.796+0000","up_votes":1,"down_votes":6,"body":"achso als platin 2 hat man dann also easy 1v5 zu carryen achso 2 leute im team gehen afk also das heist 3vs 5 seit min 1 an und das ist dann ja kein problem als platin 2 gegen andere platins ja ok das wusste ich jetzt nicht","replies":[{"poster":"Waldschrat86","date":"2017-02-19T14:52:31.462+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=RKZ Rapidfire,realm=EUW,application-id=KYnfKGf0,discussion-id=gep05o4u,comment-id=0008,timestamp=2017-02-19T14:35:47.796+0000)\n>\n> achso als platin 2 hat man dann also easy 1v5 zu carryen achso 2 leute im team gehen afk also das heist 3vs 5 seit min 1 an und das ist dann ja kein problem als platin 2 gegen andere platins ja ok das wusste ich jetzt nicht\n\nUnd Riot hat nochmal welchen Einfluss auf das Verhalten der Spieler?\nZumal 50%-Winrate schon reicht, um zu climben, und die allemal höher sein sollte, wenn man tatsächlich \"immer\" seine Lane gewinnt...","replies":[]},{"poster":"D4RKEVA","date":"2017-02-20T09:52:08.550+0000","up_votes":1,"down_votes":0,"body":"Als platin 2 sollte gold 2 easy sein einfach weil deine teammates und die gegner langfristig gleich gut sind \n\nWenn du besser bist climbest du\n\nAls bsp dazu einfach mein gold 1 account der mehrfach plat kommt jede season aber wieder decayed weil ich ihn vergesse\n\nIst es also nur wegen deinen teammates nicht möglich uzu climben? Nein\n\nDenn nach mehr als 50 games in einer division ist man da wo man hingehört oder sehr na dran","replies":[]}]},{"poster":"Awsane","date":"2017-02-19T14:46:09.182+0000","up_votes":2,"down_votes":0,"body":"by far zu wenig spiele\n\ndas fällt bisher unter persönliches Pech, du wirst schon auf deine Elo kommen, du hast für meinen Geschmack zu viele Tode dafür das du so hoch gehörst aber sieht sonst beim schnellen drüber schauen okisch aus\n\nwenn du nach 100-150 spielen genauso viel Pech hattest können wir weiter reden, aber zum skill eines lol Spielers gehört auch dazu niederlagen durch Pech einstecken zu können","replies":[]},{"poster":"Alekra","date":"2017-02-19T13:45:31.007+0000","up_votes":2,"down_votes":0,"body":"Ist das rapidfire sein ernst?","replies":[]},{"poster":"KéksRind","date":"2017-02-19T15:47:10.939+0000","up_votes":2,"down_votes":1,"body":"Rechtschreibung ist wohl auch nicht deins, und riot kann nichts dafür , das du solche teams bekommst spiel kein ranked oder find dich damit ab...","replies":[]},{"poster":"Queen Noth","date":"2017-02-19T15:08:04.551+0000","up_votes":2,"down_votes":1,"body":"Viel Spaß beim Permabann","replies":[{"poster":"Alânte","date":"2017-02-19T15:35:41.081+0000","up_votes":1,"down_votes":0,"body":"Warum?","replies":[]}]},{"poster":"Atsùra","date":"2017-02-19T13:48:32.161+0000","up_votes":2,"down_votes":1,"body":"Rapidfire, ist das dein Ernst? Ich hab noch nie so einen Text gelesen. Komm mal runter, trink einen Tee und schreib deinen Text dann bitte um Gottes Willen nochmal neu. Bei dem Gewurschtel weiß man ja gar nicht, wo vorne und hinten ist!\nVl versteh ich ja dann, worauf du hinaus willst und kann dir dann \"helfen\".","replies":[]},{"poster":"I love you Malon","date":"2017-02-19T13:44:41.735+0000","up_votes":2,"down_votes":1,"body":"Und wieso können es andere und du nicht?","replies":[]},{"poster":"Hinks Linten","date":"2017-02-20T11:15:34.952+0000","up_votes":1,"down_votes":0,"body":"Was redest du da ? :'D\nIch habe meine placements total verhauen und bin G4 Eingerankt worden.\nBin trotzdem jetzt Platin 4 und hatte auch viele die am trollen waren oder afk waren :'D","replies":[]},{"poster":"XenesisCH","date":"2017-02-20T09:45:41.981+0000","up_votes":1,"down_votes":0,"body":"Hey Leute ich weiss nicht, ob es jemanden interessiert... ich habe diese Saison wieder mal regelmässig Ranked gespielt und war nach den Promos Gold 5. Die ersten ca. 50-60 Games waren ziemlich frustrierend und ich hatte weniger als 40 % meiner Spiele gewonnen. Gestern endlich hatte ich es jedoch geschafft, nachdem ich meine Leistung konstant gesteigert habe (als Main Support), wieder auf Platin zu kommen, YIEEEPIIE! :))","replies":[]},{"poster":"Time2Whine","date":"2017-02-20T00:21:07.503+0000","up_votes":1,"down_votes":0,"body":"Seltsam, ich war letzte Season Platin 2 und wurde nach den Placements in Gold 3 eingestuft. Ich habe es jedoch innerhalb einer Woche als Main Support, der Rolle von dem viele Dumpfbacken sagen dass man mit ihr nicht climben/carrien kann, geschafft, in Platin 5 aufzusteigen und bin nun in Platin 1 angekommen.\nAlso bist du anscheinend gerade nicht gut genug um zu climben, gerade wenn ich deine Winrate sehe fällt auf, dass du noch einiges vor dir hast.","replies":[]},{"poster":"MrFabou","date":"2017-02-19T13:45:47.506+0000","up_votes":1,"down_votes":0,"body":"Das hat nichts mit Riot Games selbst zu tun. Wenn Spieler ein ungerechtes Verhalten zeigen, kannst du diese nach einem Game reporten.","replies":[]},{"poster":"Alânte","date":"2017-02-19T14:19:01.877+0000","up_votes":1,"down_votes":2,"body":"Ist dein Skill genauso wie dein Rechschreibung?","replies":[]}]}