{"poster":"cesare2726","date":"2015-10-06T08:00:42.365+0000","title":"Una storia su Rammus (non sono morto)","subforum":"Creazioni della community","up_votes":3,"down_votes":2,"body":"&quot;Pap&agrave;!&quot; Dice il piccolo cucciolo verdognolo.\r\n&quot;Tesoro! Bentornato!&quot; Dice la donna.\r\nLe luci della citt&agrave; brillano fuori dalle finestre. Una vita perfetta, non &egrave; cos&igrave;? Uno scienziato rinomato, di una razza sconosciuta di esseri senzienti, evoluti da creature del deserto in migliaia e migliaia di anni. Una famiglia. Una moglie. Un figlio. Degli amici. Sarebbe davvero un peccato se succedesse qualcosa,no? Ricordo ancora i loro volti, mentre la malattia se li prendeva, uno alla volta, lentamente portandoci tutti alla follia. Non riuscii a trovare una cura in tempo. Quando uscii dal laboratorio, era troppo tardi. Vorrei essere morto insieme a loro. Vorrei semplicemente essere morto. Non merito di vivere su questa terra. Ho fallito. Riesco a sentire ancora le voci agonizzanti delle persone che amavo, dietro di me. \r\n\r\n\r\nLa malattia arriv&ograve; all&#039;improvviso. Non eravamo pronti a questo. Un singolo malato. Il paziente 0. Poi la nostra intera razza. Sterminati come mosche. Tutti credevano in me, tutti credevano che li avrei salvati. Ben presto venni contagiato anche io, ma non potevo fermarmi. Provai di tutto: Da un vaccino ad un altro virus creato per distruggere il primo. Niente funzion&ograve;. Ben presto fui costretto ad abbandonare la ricerca. Quando uscii dal laboratorio, agonizzante e sull&#039;orlo della pazzia, erano gi&agrave; tutti morti. Mi lasciai morire sotto il sole, tra i palazzi di quella che un tempo era stata la mia citt&agrave;. Quando mi svegliai, affamato ed assetato, ero ancora vivo e vegeto. Scoprii che il virus non funzionava su di me, a causa di una rara forma di anemia, che mi aveva sempre escluso dal compiere attivit&agrave; troppo faticose. Sarebbe bastata una trasfusione del mio sangue ad ogni abitante per salvare la nostra razza. Mi ricordo che urlai. Mi ricordo che piansi. Poi arriv&ograve; lei. Dal nulla, la piccola vagabonda apparve. Nessuno aveva mai trovato la nostra citt&agrave; prima di allora. Mi consol&ograve;. Non sapevamo nemmeno chi fosse chi, ma lei non si vergogn&ograve; minimamente di raccontarmi la sua storia. Quando io le raccontai la mia, iniziai a piangere. Lei mi prese e mi abbracci&ograve;,&nbsp; anche se non riusciva a farlo bene, visto quanto era piccolina. Mi disse che dovevo andare avanti. Che non potevo arrendermi, che avrei dovuto continuare, esattamente come aveva fatto lei. Mi disse che avrei trovato qualcuno che mi avrebbe voluto bene. Quelle parole mi ferirono. Le tirai un ceffone e la ferii con gli artigli. Mi sentivo quasi offeso dalle sue parole gentili: che stupido. Lei mi guard&ograve; sorridendo, le lacrime che le colavano sulle guance insieme al sangue. Poi se ne and&ograve;,&nbsp; esattamente come era apparsa. Non mi disse neanche il suo nome, e forse non l&#039;avrei mai pi&ugrave; rivista se non fosse stato per la Lega. Tornai al laboratorio, e progettai una corazza, simile a quella di un riccio e di un armadillo insieme, delle misure adatte al mio corpo, che mi avrebbe permesso di sopravvivere al pellegrinaggio che mi aspettava. All&#039;inizio non fu facile. L&#039;armatura aveva dei sistemi motori incorporati difficili da controllare, ma ben presto imparai ad usarla. Ogni metro di sabbia che percorrevo mi sentivo sempre pi&ugrave; distante dal mio fallimento, ma non mi abbandon&ograve; mai del tutto. Decisi comunque di mantenere viva la nostra razza fino all&#039;ultimo. Forse da qualche parte avrei potuto trovare un essere uguale a me.\r\n\r\nSono passati tanti anni ormai. Le voci sono diventate insopportabili. Mi stanno chiamando. &Egrave; ora che vada. A chiunque trovi questo diario: non commettete il mio stesso errore. Ora devo andare. Corri Rammus, corri... e non voltarti mai indietro. Lulu, Pix... mi dispiace: mi sono arreso.\r\nFINE\r\nT-T il bello dei personaggi senza sentimenti &egrave; che quasi sempre li hanno persi per una ragione super commovente T-T","replies":[{"poster":"Lightning ff","date":"2015-10-07T17:28:07.837+0000","up_votes":1,"down_votes":0,"body":"Oleeeeee \nChi non muore si rivede!","replies":[{"poster":"cesare2726","date":"2015-10-08T17:55:15.231+0000","up_votes":1,"down_votes":0,"body":"Specialmente se sei Gangplank","replies":[]}]},{"poster":"MasterErmes7206","date":"2015-10-06T13:26:19.194+0000","up_votes":1,"down_votes":0,"body":"Dov'eri finito???\nIniziavano a mancarmi le tue storie.","replies":[]},{"poster":"cesare2726","date":"2015-10-06T08:04:31.182+0000","up_votes":1,"down_votes":0,"body":"Link con tutte le fanfic scritte finora sul forum\nhttp://boards.euw.leagueoflegends.com/it/c/creazioni-della-community-it/dvvixXez-piccola-biblioteca-alessandrina","replies":[{"poster":"ChernobogH","date":"2015-10-06T13:22:34.567+0000","up_votes":1,"down_votes":0,"body":"Bravo ma metto tutto dopo. Torno su Lands (che ti consiglio conoscendoti)","replies":[]}]},{"poster":"MattyShadow","date":"2015-10-06T12:43:47.957+0000","up_votes":1,"down_votes":0,"body":"Sei sempre il migliore","replies":[]}]}