{"poster":"ExxonV","date":"2018-12-29T21:55:41.749+0000","title":"When eating a shit sandwich","subforum":"Player Behavior","up_votes":3,"down_votes":12,"body":"Make sure you smile, or big brother riot will chat restrict you.\r\n\r\nGame 1\r\nPre-Game\r\nExxonV: Havent even started game yet\r\nExxonV: And already our adc is a lier\r\nExxonV: Al\r\nExxonV: fkin\r\nExxonV: ready\r\nIn-Game\r\nExxonV: Listening to opening of samurai shamploo right now\r\nExxonV: holy fk, that shit was so good\r\nExxonV: Wow\r\nExxonV: fk u\r\nExxonV: r u literally trolling?\r\nExxonV: ?\r\nExxonV: messed that up? Wtf went trhough ur mind that that would work?\r\nExxonV: u just handed him my lane\r\nExxonV: and thats ur 3rd death in 8 mins\r\nExxonV: feels good man, we just get to lose cuz this troll\r\nExxonV: ?\r\nExxonV: he&#039;s inting?\r\nExxonV: who cares if u tilt him\r\nExxonV: how do u tilt an inting\r\nExxonV: i cant rly do that much\r\nExxonV: trynd will take everyhting\r\nExxonV: if I roam\r\nExxonV: woulda been really cool\r\nExxonV: if our mao wasnt a potato\r\nExxonV: and my top didnt have free kills\r\nExxonV: wtf is the story here\r\nExxonV: is mao ezreals little brother or something?\r\nExxonV: how is he in this game?\r\nExxonV: could u two at least have the decency to click ff?\r\nExxonV: Go play norms together, that dude cant hang in ranked\r\nExxonV: ?\r\nExxonV: We literally cant win\r\nExxonV: Wtf do u mean we&#039;re fine\r\nExxonV: ???\r\nExxonV: A maokai\r\nExxonV: inted early?\r\nExxonV: To scaling champions\r\nExxonV: That are now overruning us\r\nExxonV: ?????????\r\nExxonV: rly cool that we&#039;re still stuck here\r\nExxonV: Dude game\r\nExxonV: is over\r\nExxonV: fucking stop trolling\r\nExxonV: HOIW\r\nExxonV: UR MONKEY JG FED HIM\r\nExxonV: a 0/7 thinks im inting\r\nExxonV: imagine giving two free kills to a trynd top, then whining top isnt able to deal with him\r\nExxonV: Wtf are u talking about\r\nExxonV: i got a tower, with how far behind me are, thats the best I can possibly do\r\nExxonV: we got\r\nExxonV: fucking\r\nExxonV: top side jg at least\r\nExxonV: worth I think?\r\nExxonV: Thank god he went for farm\r\nExxonV: Ezreal y in gods name\r\nExxonV: Would u play more than one game\r\nExxonV: with this person\r\nExxonV: This is easily the worst jg I&#039;ve played with\r\nExxonV: In months\r\nExxonV: gg I guess... plz report mao\r\nPost-Game\r\nExxonV: Velkoz wtf more do u think I could have done therre\r\nExxonV: ROFL\r\nExxonV: WHAT\r\nExxonV: DID I DO\r\nExxonV: TO GRIEF?\r\nExxonV: ARE U FKING KIDDING\r\nExxonV: LOL\r\nExxonV: ????????????\r\nExxonV: I KNEW WE LOST\r\nExxonV: DIDNT MEAN I STOPPED PLAYNG\r\nExxonV: ROFL\r\nExxonV: That was literally everyhting I could od\r\nExxonV: God what a tool\r\nExxonV: ARE U R%%%%%ED?\r\nExxonV: LOL\r\nExxonV: Like name one thing\r\n\r\n\r\nA maokai jg dies for the 3rd time in under 8 mins tower diving my laner *trynd* after I&#039;m not even in lane because I&#039;d just been ganked and gives him red buff. Proceeds to go 0/9 with 5k damage in a 30 min game. I&#039;m being flamed by his duo because I&#039;m no longer winning the lane after this guy got a kill from the gank, then that and red buff. I&#039;m sure it&#039;s just a &quot;bad game&quot; that makes a person solo tower dive at level 5 on maokai after already inting twice elsewhere, and we should protect the fragile emotions of people who just purposely ruin games am I right riot? Just make sure you don&#039;t let yourself get frustrated by all people trolling games because it&#039;s preseason because riot may not have your back but they damned sure have theirs.","replies":[{"poster":"KFCeytron","date":"2018-12-29T22:06:49.833+0000","up_votes":8,"down_votes":2,"body":"If you think you're the victim here and don't see where you behaved poorly (basically everywhere), I don't recommend buying any more RP, because this is the path to a permaban.","replies":[{"poster":"ExxonV","date":"2018-12-29T22:26:58.326+0000","up_votes":1,"down_votes":6,"body":"Exactly, and thats fucking stupid. No one could play the game, there was no chance to win, and we're just being held hostage by griefers. But I'm the one punished? It was literally their intention, to bait out a reaction because they know how the system works, and I'd just gotten enough of those people that night that I wasn't dealing with it again.","replies":[{"poster":"Jo0o","date":"2018-12-29T22:32:20.882+0000","up_votes":8,"down_votes":0,"body":"How can you acknowledge that it was literally their intention to bait this, yet defend your actions? You actively rewarded a troll, contributing to a worse community. Why not ignore the troll?","replies":[{"poster":"ExxonV","date":"2018-12-29T22:42:18.531+0000","up_votes":1,"down_votes":3,"body":"Because it was annoying? And i'm not a robot? Plus I'd been drinking and rly don't give that much of a fuck. The point isn't that I didnt expect this, the point is it disappoints me every time.","replies":[{"poster":"Jo0o","date":"2018-12-29T22:43:27.766+0000","up_votes":7,"down_votes":0,"body":"Shit dude, I drink all the time when I play League. You gotta reign it in if you're gonna lose your cool like that.","replies":[{"poster":"ExxonV","date":"2018-12-29T23:33:49.979+0000","up_votes":1,"down_votes":5,"body":"No? It's literally the only way to enjoy playing league in it's current state. And I think it's pretty normal to be salty when 40% of my games played yesterday had a griefer on one of the teams, and were pretty boring shitty games. The alcohol was a factor but rly I just stopped giving a fk. What is riot going to do? Ban me from this POS game? That would be great because then I wouldn't be tricked into gambling on that my next 30 mins isn't going to be spent playing something as boring as a trolled league match. \n\nThe only true frustration is that it doesn't need to be this way, but for whatever reason this fking company doesn't give a damn about the trolls, only what u say when u get fed up with them. Shit I wouldn't even feel the need to say anything to someone like that maokai if I thought for a second riot was going to do something to keep them from doing it again. But I know they won't.","replies":[]}]}]}]}]},{"poster":"Vreivai","date":"2018-12-29T22:11:43.138+0000","up_votes":2,"down_votes":1,"body":"Perhaps you could explain to OP what they did wrong, then, rather than just telling them off.","replies":[{"poster":"KFCeytron","date":"2018-12-29T23:09:01.453+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Vreivai,realm=NA,application-id=ZGEFLEUQ,discussion-id=j8RUeybQ,comment-id=00010000,timestamp=2018-12-29T22:11:43.138+0000)\n>\n> Perhaps you could explain to OP what they did wrong, then, rather than just telling them off.\n\nLike I said, it was basically everywhere. OP called the ADC a liar right off the bat, accused someone of trolling and inting multiple times, called Maokai a potato, called Maokai Ezreal's little brother, told them to get out of ranked and play normals, called the jungler a monkey, called the jungler the worst he'd played with in months, called for reports, screamed in caps in post-game, called someone a tool in post-game, called someone the r-word in post-game...\n\nAgain, basically their entire chat was extremely rude and harassing. Calling for reports is specifically considered harassment, and additional reports don't even have an effect anyway. OP went on and on about everyone's score, implying that performance is relevant in a behavioral dispute and that the behavior of other players should affect someone's punishment. OP then said that they merely became \"frustrated,\" implying that they were punished for a mere emotion and ignoring the fact that their emotions manifested in visible behavior that was totally inappropriate.","replies":[]}]}]},{"poster":"覺 Sona 覺","date":"2018-12-29T22:02:31.776+0000","up_votes":4,"down_votes":0,"body":"When eating a shit sandwich, top eating it and go get some water and antibiotics to rinse your mouth out. \n\nMute everyone and focus on playing. Don't react to negativity, don't contribute to negativity. \n\nMake it a point to encourage your teammates, not beat them down. \n\n{{sticker:sona-playing}}","replies":[{"poster":"ExxonV","date":"2018-12-29T22:29:12.644+0000","up_votes":1,"down_votes":2,"body":"I didn't beat anyone down. I said fk u to a griefer for griefing, and then argued with the velkoz because he was whining I didn't group when we were massively down in gold and I was grabbing a tower. This fixation on protecting people to let them ruin games is unreal. I literally performed to the best of my abilities in a shit situation while this guy ran it down, but he's the victim? Are u kidding","replies":[{"poster":"覺 Sona 覺","date":"2018-12-30T01:03:30.143+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ExxonV,realm=NA,application-id=ZGEFLEUQ,discussion-id=j8RUeybQ,comment-id=00000000,timestamp=2018-12-29T22:29:12.644+0000)\n>\n> I didn&#x27;t beat anyone down. I said fk u to a griefer for griefing, and then argued with the velkoz because he was whining I didn&#x27;t group when we were massively down in gold and I was grabbing a tower. This fixation on protecting people to let them ruin games is unreal. I literally performed to the best of my abilities in a shit situation while this guy ran it down, but he&#x27;s the victim? Are u kidding\n\nYou cant win the game arguing with others and spreading negativity. Teamwork and encouragement will get you there in the worst of times.","replies":[]}]}]},{"poster":"Articus43","date":"2018-12-30T02:35:48.353+0000","up_votes":3,"down_votes":0,"body":"You've admitted here in the comments you're aware you violated rules by taking the bait of griefers stating, \"I'd just gotten enough of those people that night that I wasn't dealing with it again.\" \n\nAs for your fixation that anyone here is defending players who do this to other people - yeah, not sure where you're getting that. Nobody here is defending people who go in games and try to trigger folks. Everyone here has told you to chill your heater because they've probably experienced the same thing you did at some point. \n\nAdditionally, despite your zeal that Riot does absolutely nothing, it's just blatantly false. I and plenty of others have reported chat baiting we've experienced and seen those accounts go radio silent. Yeah, it's anecdotal, but that's all we have access to at this point and it's more reliable than your empty claim. If you don't keep up with those people, how could you possibly know if they get banned or not? Plus, those people are going to do the same thing everyone else does: create a new account and continue to grief. Everyone is telling you to keep your head because regardless of how many suspensions go out you're going to run into these people eventually.\n\ntl'dr: Your explosion is their high and you gave it to them. /muteall every game and it'll be much more pleasant for you.","replies":[]},{"poster":"Vreivai","date":"2018-12-29T22:17:09.581+0000","up_votes":1,"down_votes":0,"body":"Due to this line:\n\n> [{quoted}](name=ExxonV,realm=NA,application-id=ZGEFLEUQ,discussion-id=j8RUeybQ,comment-id=,timestamp=2018-12-29T21:55:41.749+0000)\n> ExxonV: ARE U R%%%%%ED?\n\nYou're lucky this was only a chat restriction\n\nUse of that word normally results in escalation to a 14-day ban on the first offense. Likely you evaded the filter that catches that by partially censoring the word.","replies":[{"poster":"Jo0o","date":"2018-12-29T22:25:48.315+0000","up_votes":2,"down_votes":0,"body":"I'm 90% sure it's not zero-tolerance in game.","replies":[]}]}]}