{"poster":"xSar3z","date":"2015-10-12T23:07:49.258+0000","title":"come salire facilmente  di elo","subforum":"Discussioni generali","up_votes":6,"down_votes":3,"body":"Ok ragazzi &egrave; una cazzata, nessuno sale di elo facilmente oltre il diam (lcs player caso a parte).\nDopo il diamond, sale solamente chi ha culo/fortuna, eh si! Adesso ci sta che magari uno ha un bad game, che fallisce 2-3 ganks, che sbaglia lo smite al baron a 50 minuti ( &egrave; capitato a tutti, anche a me) , che si fa trovare in bad position etc, ma trollare perch&egrave; l&#039;avversario prende il first blood, o perch&egrave; la partita di prima &egrave; andata male, o per qualsiasi altro motivo, non &egrave; accettabile.\nPer troll intendo quelle persone che vendono tutti gli item e se ne vanno sotto la torre avversaria a farsi uccidere , da non confondere con uno che sta semplicemente 0-5-0 (esempio), ma che vuole comunque vincere la partita e continua a giocare.\nPer me la riot dovrebbe fare qualcosa con queste persone, hanno fatto un buon sistema con la chat restriction etc, adesso perch&egrave; non fare qualcosa per i TROLL/RITARDATI CHE ENTRANO IN RANKED SOLO PER FAR PERDERE LP A 4 RAGAZZI CHE VOGLIONO GIOCARE 1 RANKED IN PACE\n\n\nNon so voi, ma io in diam4-3 ho incontrato pi&ugrave; ritardati che in tutti gli altri elo, e anchio come tutti voi sono partito dal bronzo. Ho 3000 screen di persone che trollano, ve ne posto solo uno magari per rendere meglio l&#039;idea. ( il player in questione &egrave; un diam4, mad non si sa per quale motivo)\n\n [IMG]http://i60.tinypic.com/213kfo3.png[/IMG]\n \n\nClassico troll, che dopo aver dato 2 kill a riven, va in base, vende tutti gli item, compra le classiche &quot;boots da troll&quot;, e va in giro per la mappa a dare free kill a caso, per poi andare totalmente afk. Come ho gia detto prima, ci sta che uno perde la lane, in questo caso gli avevo anche detto &quot;play safe and ill gank you easy&quot; , ma non ha voluto sapere nulla ed ha continuato a trollare. \n\nAdesso ragazzi, voi che ne pensate di questa gente? Penso che a tutti voi sia capitato un episodio del genere, anche pi&ugrave; volte.\nPerch&egrave; non inserire un sistema che punisce seriamente questa gente, magari partendo da 1 giorno di ban, fino ad arrivare 1 mese o permban, dipende sempre dalla situazione. In questo modo la riot rende anche le ranked una cosa pi&ugrave; seria, visto che si potr&agrave; salire veramente chi merita e non chi acchiappa il team con 5 persone normali.","replies":[{"poster":"Chroniicles","date":"2015-10-13T02:23:37.635+0000","up_votes":2,"down_votes":0,"body":"Pensa che a me, più di una volta purtroppo, oltre al danno di perdere un game per gente che agisce in quel modo, è capitata la beffa di venir reportato dal troll e dal team nemico per verbal abuse... Con tanto di warning...\nPer fortuna nessun altro provvedimento, anche perché sarebbe stato alquanto strano visto che la chat in gioco sono abituato a non usarla per flammare, meno che mai per flammare un tizio che ci sta facendo perdere e mettermi al suo livello... Altri non sono così fortunati, o meglio, pazienti... E si beccano chat restricted o ban. E il troll rimane impunito!\nDunque per me in primis, deve cambiare la mentalità della community: non flammare i troll -  reportarli sempre (anche quando li hai contro) e sperare che la riot cominci a prendere più sul serio questa gente che spesso trolla sistematicamente","replies":[{"poster":"Skydago","date":"2015-10-13T05:41:17.118+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Chroniicles,realm=EUW,application-id=MJVj50Jw,discussion-id=AEcaqF4g,comment-id=0002,timestamp=2015-10-13T02:23:37.635+0000)\n>\n> Pensa che a me, più di una volta purtroppo, oltre al danno di perdere un game per gente che agisce in quel modo, è capitata la beffa di venir reportato dal troll e dal team nemico per verbal abuse... Con tanto di warning...\n> Per fortuna nessun altro provvedimento, anche perché sarebbe stato alquanto strano visto che la chat in gioco sono abituato a non usarla per flammare, meno che mai per flammare un tizio che ci sta facendo perdere e mettermi al suo livello... Altri non sono così fortunati, o meglio, pazienti... E si beccano chat restricted o ban. E il troll rimane impunito!\n> Dunque per me in primis, deve cambiare la mentalità della community: non flammare i troll -  reportarli sempre (anche quando li hai contro) e sperare che la riot cominci a prendere più sul serio questa gente che spesso trolla sistematicamente\n\nForse il problema sta proprio nella riot: se questo problema esiste dalla season 2, le cose sono due:\nO la riot non sa fare il suo lavoro.\nO la riot non ci sta pensando abbastanza perchè pensa che il problema non sia abbastanza serio.\nD'altronde non hanno nemmeno capito che esistono gli hacker che con diana con lich, calzari del mago e luden hanno 2700 hp.","replies":[{"poster":"xSar3z","date":"2015-10-13T09:02:04.223+0000","up_votes":2,"down_votes":0,"body":"Peggio ancora se esiste dalla s2,  io gioco da meno di un anno ed ho giá capito che la situazione è veramente grave...i sistemi ci stanno non capisco perchè non punire questa gente  quando si hanno screen, video e prove evidenti.","replies":[{"poster":"DeDiam0nd","date":"2015-10-13T11:08:13.083+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=xSar3z,realm=EUW,application-id=MJVj50Jw,discussion-id=AEcaqF4g,comment-id=000200000000,timestamp=2015-10-13T09:02:04.223+0000)\n>\n> Peggio ancora se esiste dalla s2,  io gioco da meno di un anno ed ho giá capito che la situazione è veramente grave...i sistemi ci stanno non capisco perchè non punire questa gente  quando si hanno screen, video e prove evidenti.\n\nma dai come fai a punire gente del genere, se si mettono troppe restrizioni perde il suo valore..come fai a far un sistema che punisce i troll...però quando trovi il troll che ti fa vincere la partita nessuno si lamenta.\nEsistono i report e non è che il ban scatta nellì'immediato ma dopo aver superato una certa soglia.\nE' inutile lamentarsi e lo ripeterò fino alla noia, è un gioco","replies":[{"poster":"xSar3z","date":"2015-10-13T11:44:25.362+0000","up_votes":2,"down_votes":0,"body":"Non è così, quando acchiappo il troll nella squadra nemica screnno e mando il report ticket ugualmente. Free win o free lose è il game che non ha senso fin dal primo minuto.","replies":[]}]}]}]}]},{"poster":"ztJackieChan","date":"2015-10-13T00:04:36.181+0000","up_votes":3,"down_votes":1,"body":"le classiche scarpe da troll le avete in 3, perdere era cmq inevitabile.\n\nma piuttosto, che ci fa un diamond nel forum ? ti sei smarrito ?","replies":[{"poster":"xSar3z","date":"2015-10-13T00:32:50.904+0000","up_votes":2,"down_votes":0,"body":"Ciao , perdere non era inevitabile...anzi la nostra vayne era molto brava e io avevo ucciso  2 volte riven fiddata mi sembra, se malphite non avesse trollato, non dico che era una Free win,  ma quasi...specialmente in late.               Ps per le classiche scarpe da troll intendo vendere tutto e comprare le mobilty homeguards per correre sotto la torre e farsi killare,  le scarpe che avevo erano ottime con early champ op come panth.","replies":[]},{"poster":"Darki200","date":"2015-10-13T12:12:49.443+0000","up_votes":2,"down_votes":1,"body":"Di solito non si va oltre il plat 5 xD","replies":[]}]},{"poster":"Frattaglia","date":"2015-10-12T23:19:29.448+0000","up_votes":3,"down_votes":2,"body":"Di solito più sali in alto e più il minimo errore ti compromette la partita.\nPer questo atteggiamenti tossici del genere (troll, free mid, etc) sono più diffusi.\n\n\nCon buona pace di chi è convinto che sta gente la trovi solo nelle leghe basse. :-/","replies":[{"poster":"FuryTheFenix ITA","date":"2015-10-13T14:35:14.674+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Frattaglia,realm=EUW,application-id=MJVj50Jw,discussion-id=AEcaqF4g,comment-id=0000,timestamp=2015-10-12T23:19:29.448+0000)\n>\n> Di solito più sali in alto e più il minimo errore ti compromette la partita.\n> Per questo atteggiamenti tossici del genere (troll, free mid, etc) sono più diffusi.\n> \n> \n> Con buona pace di chi è convinto che sta gente la trovi solo nelle leghe basse. :-/\n\nMenomale che sono in Silver e anche se stai 0 a 20 ma la tua squadra VUOLE vincere si fanno i miracoli: \n1.I troll diventano degli hypercarry ridicoli\n2.Il support che mena all'adc nemico (Leona!)\n3.il tizio che trollando si mette a girare con boots con alacrità e riuscendo a far perdere tempo ai nemici mentre tu entri nel nexus.\n\nEcc.... Questo gioco è troppo bello(non fino a quando arriva il tizio con il puntatore cliccato sul nexus nemico e fa 0/40 ma vabbè)","replies":[{"poster":"dreadful despair","date":"2015-10-13T16:00:51.944+0000","up_votes":1,"down_votes":1,"body":"appena vinta una ranked con un tipo che ha deciso di feedare e trollare perchè gli avevano bannato Fiora...lui picka teemo jungler.Zitto zitto però si è fatto tutti i drake,1 baron e ha chiuso il devourer a 20 min(non chiedetemi il senso della sua build:Botrk,Nashor,Berserkers e Devourer xD).Poi vabbè io e la kata che avevo in mid avevamo deciso di mutarlo continuando a giocare.Io ho fatto la firstblood sul amumu avversario in top(amumu contro riven...spiegatemi il senso pls)e kata invece ha stravinto la lane.Cio nonostante l'adc che avevamo contro era molto bravo e ci ha dato filo da torcere ma comunque è stato un bel game con o senza troll","replies":[]}]},{"poster":"One Punch Morde","date":"2015-10-13T11:21:00.834+0000","up_votes":1,"down_votes":1,"body":"Quanta saggezza, concordo in pieno XD\nNelle leghe basse a volte i troll carriano il Game per quanto è basso il livello, chi crede di essere bravo vale meno di un troll mediamente skillato lol","replies":[{"poster":"DeDiam0nd","date":"2015-10-13T11:34:55.578+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Linkimaru,realm=EUW,application-id=MJVj50Jw,discussion-id=AEcaqF4g,comment-id=00000000,timestamp=2015-10-13T11:21:00.834+0000)\n>\n> Quanta saggezza, concordo in pieno XD\n> Nelle leghe basse a volte i troll carriano il Game per quanto è basso il livello, chi crede di essere bravo vale meno di un troll mediamente skillato lol\n\nsaggezza...si tratta di buon senso...cristo non mi lamento io che sono nella merda piu totale (bronzo) e vedo che si lamenta gente dal silver in su.\nAnche io ho i miei momenti che vorrei prendere certi giocatori a stecche sui denti ma insultarlo o lamentarsi non ti fa vincere la partita.","replies":[]},{"poster":"Frattaglia","date":"2015-10-13T11:54:12.586+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Linkimaru,realm=EUW,application-id=MJVj50Jw,discussion-id=AEcaqF4g,comment-id=00000000,timestamp=2015-10-13T11:21:00.834+0000)\n>\n> Quanta saggezza, concordo in pieno XD\n> Nelle leghe basse a volte i troll carriano il Game per quanto è basso il livello, chi crede di essere bravo vale meno di un troll mediamente skillato lol\n\n\nRicordo una volta che giocavo duoQ con Rhademes, avevamo in squadra un'irelia intentional feeder e un mordekaiser che non in modo intenzionale era andato 1/12.\nAlla fine abbiamo vinto uguale, 4v5 dato che irelia continuava a trollare.\nxD","replies":[]}]}]},{"poster":"Rhadamant1s","date":"2015-10-14T22:59:15.418+0000","up_votes":1,"down_votes":0,"body":"Si adesso infatti diamogli una bella medaglia ai troll che dite?\nBasta vedere quanti commenti addirittura li elogiano.\nHo scritto un post a riguardo anch'io pure bello lungo in realtà :D\nxSar3z purtroppo è una guerra persa, fosse per me ti farei una statua.","replies":[]},{"poster":"Pasticcionex","date":"2015-10-14T12:30:49.527+0000","up_votes":1,"down_votes":0,"body":"Raga ma vi rendete conto di quanti giocatori ci sono su lol? Cioè i troll e i feeder non finiranno mai e poi mai non è una situazione gestibile.. Se lo banni si farà un altro account e feederà più di prima arrabbiato a casua del ban quindi Amen e giocate in premade le classiche e invocate la Fortuna nelle ranked....","replies":[]}]}