{"poster":"Minuialwen17","date":"2015-09-04T11:15:41.639+0000","title":"Un aiutino :)","subforum":"Reclutamento","up_votes":3,"down_votes":1,"body":"Ciao a tutti, mi chiamo Aurora (Minuialwen17 su lol) e sono silver 3, spero a breve silver 2. Faccio abbastanza fatica a salire  in ranked ecco il perch&eacute; della mia richiesta. Penso che continuando a giocare solo con i miei amici silver, non riuscirei a migliorare di tanto. Per questo cerco qualcuno di bravo, dal platino alto in su, che ogni tanto giochi con me  e mi dica dove sbaglio o mi dia consigli per migliorare. Penso possa servirmi molto, perch&eacute; giocando anche solo normal con altra gente platino o diamante, a forza di prenderle, dovrei riuscire a velocizzarmi sia nelle combo da fare con i champion che uso, sia a migliorare  la mia posizione nei tf. I miei ruoli sono principalmente support e mid. Se volete aiutarmi non esitate a scrivermii! Grazie a tutti^^","replies":[{"poster":"Babbaluci","date":"2015-09-17T20:46:45.575+0000","up_votes":1,"down_votes":0,"body":"Ciao, sono diamante V e sono disponibile per aiutarti. Ti ho mandato la richiesta, quando vuoi giochiamo insieme ok?","replies":[]},{"poster":"Aramash","date":"2015-09-12T23:07:05.513+0000","up_votes":1,"down_votes":0,"body":"Ciao, se sei ancora interessata, aggiungimi in gioco, spero di riuscire a darti le dritte che ti servono. Sono main support, Plat 4.","replies":[]},{"poster":"Giovarco","date":"2015-09-04T16:51:29.466+0000","up_votes":1,"down_votes":0,"body":"Ciao Aurora. Purtroppo al momento ho problemi di connessione e non posso giocare, però mi sento di consigliarti questi due canali Youtube dove vengono raccolti video di gameplay dal Diamante in sù. Molti di questi, se non la maggior parte, commentano le proprie partite e questo aiuta molto per la gente inesperta e non.\n\nhttps://www.youtube.com/channel/UCIdhrZprAQZIAVEvjVKCxzA\nhttps://www.youtube.com/channel/UC8IX06oA6qcC9vh7mgPgtwQ\n\nFammi sapere se ti serve altro :)","replies":[{"poster":"Minuialwen17","date":"2015-09-05T17:03:37.013+0000","up_votes":1,"down_votes":0,"body":"Grazie mille per i link ai canali, le guarderò di sicuro!! :)","replies":[]}]},{"poster":"elektriko","date":"2015-09-04T14:18:19.683+0000","up_votes":1,"down_votes":0,"body":"ciao Aurora, ti consiglio di entrare nella chat room 'platinum vs silver' (senza apici), un progetto Reddit creato appositamente per i motivi da te elencati. Ci sono numerose lobby, io ogni tanto gioco. Se vuoi fare qualche ranked insieme invece aggiungimi","replies":[{"poster":"Minuialwen17","date":"2015-09-05T17:02:58.979+0000","up_votes":1,"down_votes":0,"body":"Grazie mille per la risposta!! :) proverò a fare delle partite come hai detto!! :)","replies":[]}]}]}