{"poster":"SIatarou","date":"2017-07-30T23:30:36.975+0000","title":"Suchen Toplaner für das finale Turnier","subforum":"Battlegrounds-Turniere","up_votes":1,"down_votes":0,"body":"Moin wir suchen einen neuen Toplaner f&uuml;r das Finale Battlegrounds Turnier da unser Toplaner nicht sonderlich zuverl&auml;ssig war und einfach nicht mehr on kam.Wir sind alle mindestens 18 Jahre alt und Dia 5 .\r\nBOT3RETURN Dia 4 (Mid)\r\nSlatarou Gasai Dia 3 (Jungle)\r\nMyNamisLisa Dia 4 (Support)\r\nund einen Dia 4 Adc\r\nZu dir du solltest mindestens 16 Jahre alt sein und Dia 5 in Solo Que da die gegnerischen Toplaner auch relativ hoch sein werden.\r\nBei Interesse einfach hier drunter schreiben oder Ingame adden\r\nDanke f&uuml;rs lesen und noch nen sch&ouml;nen Tag","replies":[{"poster":"SIatarou","date":"2017-08-04T05:10:39.161+0000","up_votes":1,"down_votes":0,"body":"Push","replies":[]},{"poster":"Flumbro","date":"2017-07-31T00:26:24.841+0000","up_votes":1,"down_votes":0,"body":"Hi, ähm ich bin 17 Jahre alt, offensichtlich Toplanemain und leider im Moment in die Tiefen von Diamond 3 gedroppt (feelsbad). Hätte aber mal ein paar Fragen an euch... Was würdet ihr denn von eurem Toplaner erwarten? Wann ist das finale Turnier und wie lange geht es (etwa)? Was kriegt man im Battlegrounds Turnier und was habt ihr schon im Umfeld von Battlegrounds erreicht? Wenn ihr wollt, könnt ihr eure Antwort hier drunter schreiben, ich gucke meist täglich mal ins Forum rein. :)","replies":[{"poster":"SIatarou","date":"2017-08-01T02:15:51.727+0000","up_votes":1,"down_votes":0,"body":"Naja der Toplaner sollte einen gewissen champion pool spielen können schon so 3 tanks und 2 bruiser damit man ihn halt nicht einfach outbannen kann. Das Finale Turnier beginnt am 12.8 und dann ist jedes Wochenende ein Spiel bis man eben rausfliegen sollte insgesamt maximal 1 1/2 Monat. Man kriegt normalerweise RP sobald man eine gewisse Anzahl Gegner besiegt hat wie das jetzt bei dem letzten Turnier ist weiß ich nicht. Wir sind das Team auf Platz 9 im ersten Turnier waren wir am stärksten da sind wir im Halbfinale gegen MyInsanity geflogen im 2. Turnier haben wir noch die Gruppenphase überlebt sind dann aber später gegen ein Team geflogen welches im nachhinein disqualifiziert wurde weil sie fremde Leute auf ihre Accounts gelassen haben und beim 3. und bisher letzten Turnier haben wir leider nichtmal die Gruppenphase geschafft was aber an einem massiven Wechsel des halben Teams bestand und MyInsanity wäre auch wieder in unserer Gruppe gewesen also wäre auch sehr hart geworden.","replies":[]}]}]}