{"poster":"LinusVanDamme","date":"2017-09-24T14:35:15.073+0000","title":"Championselect Pick-Ban","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":5,"body":"Ich frage mich warum es riot m&ouml;glich macht, in normals, Champions die gehovert sind vom eigenen Team bannen zu lassen. Im Ranked ist das ok, aber nicht im normal. Es versaut einem einfach das gesamte Spiel und es fuckt echt hart ab.","replies":[{"poster":"MrSnowy","date":"2017-09-25T02:24:20.358+0000","up_votes":1,"down_votes":0,"body":"Mein Tipp für sowas. Einfach gar nicht Picken bis man wirklich dran ist. \nViele trollen damit einfach gern mal die mates um den Champ zu bannen denn man grade Ausgewählt hat. *Ist zwar ganz witzig aber für den Betroffenen nicht so. \nWieso das so gemacht wurde? Weil es nun mal ein Bansystem ist. Würde man ausnahmen machen müsste man das Komplette System wieder überarbeiten und das wäre Zeit sowie Kostenaufwändig. Deshalb hat man nun mal ein 10er System rausgehauen und das ist anlässlich der Masse an Champs die nun auch in den Jahren steigen werden ganz gut so. Viele sind der meinung das selbst 10Bans nicht ausreichend sind. Aber lieber 10 als 3 die nur einer bannen konnte. ^^\nAber weiter und tiefer darauf eingehen möchte ich nicht, dass wäre deutlich zuviele punkte die mich stören *Bsp* Doppelbann ^^","replies":[{"poster":"Sirrkas","date":"2017-09-26T10:27:57.117+0000","up_votes":1,"down_votes":0,"body":"Die genaue Anzahl an Banns ist mir persönlich egal. Ich hätte auch gut mit 6 Banns je Match weiterleben können. Viel interessanter finde ich hinter den 10 Banns den Aspekt, dass jetzt jeder einen Bannen kann. Dadurch jammern die Leute weniger oft herum, wenn man nicht das bannt, was sie wollen.","replies":[]}]},{"poster":"Martensitic","date":"2017-09-26T09:09:20.881+0000","up_votes":1,"down_votes":0,"body":">Im Ranked ist das ok, aber nicht im normal\n\nWarum nicht?\n\nDraft Mode wird unter denselben Bedingungen gespielt wie ranked, das ist ja grad der Sinn der Sache...und dazu gehört auch, dass man nicht die Bans der Teammember blockieren kann.\n\nWenn dir das nicht gefällt, dann spiel Blind Pick.","replies":[]},{"poster":"Oriius","date":"2017-09-24T14:57:28.693+0000","up_votes":1,"down_votes":0,"body":"ahja im normal fckt das ab aber im ranked nicht yöööööööös-....\n\nspiel einfach lb jungle :/","replies":[]}]}