{"poster":"BeerXerKeR","date":"2016-12-05T19:45:04.831+0000","title":"project hoodie jacket?","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"hi, is anyone else here bought the project hoodie jacket? i preorderd it in august and supposed to shipped on october and its december now i still havent recieved it..im not in a hurry i dont care if it take them 1 more month to make it im just wondering if they stopped making it and if so will i get a refund? i hope they make it soon cos its cold already and i need that hoodie :)","replies":[{"poster":"Targons Blade","date":"2016-12-05T23:27:41.688+0000","up_votes":2,"down_votes":0,"body":"Taken directly from the [**Riot Games Merch FB Page**](https://www.facebook.com/RiotGamesMerch/):\n\n> \"We wanted to update everyone on the status of the PROJECT Hoodie. All of the hoodies for Europe were received in the warehouse earlier this week and shipped out. You should have received a shipping notification in EU and your hoodies are on the way. The hoodies for all of North America are checking into the warehouse in the morning and will begin shipping immediately, we estimate that by Wednesday or Thursday they will all have also shipped (they can get about 2000 per day out the door starting tomorrow). Thank you again for your patience and we will post a final update when NA has completed shipping.\"\n\nI recommend following the page for further updates, but please let me know if you have any other questions.","replies":[{"poster":"LimitedTrout","date":"2016-12-07T21:10:55.096+0000","up_votes":1,"down_votes":0,"body":"Will they arrive before christmas","replies":[{"poster":"Targons Blade","date":"2016-12-07T23:05:59.173+0000","up_votes":1,"down_votes":0,"body":"I have absolutely no idea. You can always check your order number or tracking number (after it ships) to get an idea of when your order should arrive.","replies":[{"poster":"LimitedTrout","date":"2016-12-09T23:13:17.250+0000","up_votes":1,"down_votes":0,"body":"WOOOOOOO MY JACKET JUST CAME TODAY!!!!!!!!","replies":[]}]}]}]}]}