{"poster":"toadSTL","date":"2016-09-11T21:23:53.446+0000","title":"Client Bug, cannot select a champion","subforum":"[ARCHIVED] Help & Support","embed":{"description":"Album with topic of No Topic uploaded by ToadSTL. Client Bug","url":"https://imgur.com/gallery/rVwUm","image":"http://i.imgur.com/XZAWfLW.jpg?fb"},"up_votes":1,"down_votes":0,"body":"Over the last month or so I have had this happen to me maybe 15-20 times.\n\nThe client partially freezes:\nI don't get so see all champions picked.\nEvery player who picks a champion after the freeze occurs remains highlighted after their pick.\nI can still type in the chat for some reason?\nMost importantly I am not directed to a gallery of the champions I own when it is my turn to pick, nor is the button provided to toggle that gallery present. Even clicking in the space where the gallery was or where the button was does nothing.\n\nAs I said it has happened 15-20 times (&lt;10% of games matches found, maybe even &lt;5%, don't have an exact count), and I've probably only lost 9-12 LP for it because I play more non-ranked than I play ranked, but its pretty frustrating both for me and the other players with whom I get queued.\n\nIf it was in a game I would exit and reconnect, but since it's a client bug that would result in dodging the queue just the same as if I stay and the timer ticks out while I can't select a champion.\n\nI play on Windows 10 Lenovo Y700 laptop with the following hardware specs:\nIntel i7-6700HQ\n16GB RAM\n128 GB SSD (Samsung)\nNVIDIA GeForce GTX 960M\n\nThe link shows a screenshot of this bug from maybe a half-hour ago.\n\nAnybody experiencing a similar issue? or have solutions?\n\nAt the very least, I want to start recording this bug so that Riot knows about it","replies":[{"poster":"Targons Blade","date":"2016-09-11T23:21:02.063+0000","up_votes":1,"down_votes":0,"body":"This may be caused by your client not syncing properly with what's going on during champ select. If this is the case, your issue is likely caused by an unstable connection to the servers. As a first step, I recommend working through our [connection troubleshooting guide](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues), as it touches on the most common solutions for connection issues.\n\nLet me know if your issue persists through these steps.","replies":[]}]}