{"poster":"MauricoMacri69","date":"2017-07-12T01:36:39.532+0000","title":"Yorick toxico","subforum":"Comportamiento del jugador","up_votes":4,"down_votes":7,"body":"se burlaba de mis abuelos que fallecieron y decia que no le importaba si lo reportaban por lo que el decia","replies":[{"poster":"faster51","date":"2017-07-12T02:14:07.885+0000","up_votes":2,"down_votes":0,"body":"hay dos personas que van al infierno fijo, sin contar al yorick obviamente","replies":[]},{"poster":"LAS Caz","date":"2017-07-12T04:43:49.570+0000","up_votes":1,"down_votes":0,"body":"En ese caso tenes que mutearlo. ¿Porque te aguantarías a una persona que se burla de algo que sufriste vos? No tenes porque darle 1 segundo de tu atención, no te lo tomes personal porque es peor para vos, personas como el hay miles y miles en este mundo por eso uno tiene que aprender a ser una persona altruista, compasiva y con empatía para lograr llevar adelante estas actitudes, no malgaste tiempo en alguien que no te valora, muteas y reportas, sencillo para vos y tu team, saludos","replies":[]},{"poster":"Armo pelopinchos","date":"2017-07-12T02:18:00.937+0000","up_votes":1,"down_votes":0,"body":"Hola MauricioMacri69, entiendo tu enojo. Pero creo que con el report y el de los compañeros de equipos (o enemigos) que hayan denotado actitudes tóxicas en él ya es suficiente. Por más que diga que no le importa, si la sanción es correcta será sancionado. Para la próxima, ni bien veas esto, ahorrate el mal rato y mutea directamente. A mí me banearon dos cuentas por toxicidad, ahora estoy  cambiando bastante, y creeme, no hay mejor cosa que espere el tóxico, que uno le conteste. \n\nEspero que te sirva la ayuda, saludos.","replies":[]},{"poster":"SpecTyte","date":"2017-07-12T02:08:38.748+0000","up_votes":1,"down_votes":0,"body":"No se si es troll post o no, pero porque pondrías lo de tu abuelos en un chat de un juego que lo mas probable (sin ofender) que vayan a decir (si es alguien ultra toxico), \"y mira capo, la verdad nos chupa un huevo, ojala también se te mueran tus *@*@\"","replies":[]}]}