{"poster":"Naumy","date":"2019-10-10T09:06:42.967+0000","title":"Cutter / Videobearbeiter gesucht!","subforum":"Streams & YouTube","embed":{"description":"Naumy_ streams live on Twitch! Check out their videos, sign up to chat, and join their community.","url":"https://www.twitch.tv/naumy_","image":"https://static-cdn.jtvnw.net/jtv_user_pictures/ddf2f90e-3f97-4d22-abd5-4c7f9d339c1e-profile_image-300x300.png"},"up_votes":1,"down_votes":0,"body":"Moin,\nerstmal zur meiner Person, ich heiße Naumy bin 18 Jahre alt und bin leidenschaftlicher Streamer \nund will auch in die Video-Creator Richtung gehen, aber ich habe keine Affinitäten für Video schneiden und\nkein Auge dafür besitze wo ein Effekt oder mehrere Effekte hinkommen sollten.\n\nAlso suche Ich \"Dich\" als mein Cutter als meine \"Rechte Hand\" für die Zukunft meiner Kanäle.\n\nDein Profil:                                                                                                      \n\nBist mindestens 16 Jahre alt.\nDu hast Lust und Zeit Videos zuschneiden und deine Werke zu teilen.\nHast minimale Erfahrung und willst dich verbessern (Profis auch erwünscht)\n\n\nDeine Aufgaben:\n\nDu wirst die Streams zusammenschneiden mit denn wichtigsten Momente.\nDu wirst Aufnahmen bekommen die du auch Schneiden kannst oder Sagst daraus wird nichts.\nOptional --> Als Mod im Stream mit dabei sein.\n\nWas du bekommst:\n\nDu kriegst denn Mod Rang im Stream, damit du Timestamp im Stream erstellen kannst.\nVergütung wird persönlich geklärt!\n\nAlso bei Interesse einfach melden ich Freue mich über jede Bewerbung.\nJeder der Punkten will kann auch schon ein kurzes Video Schneiden und es dazu legen,\nder Stream Kanal ist oben angegeben.\n\n{{sticker:sg-ahri-2}} \n\nKontakt:\nLeague of Legends --> Naumy\nTS --> vala-network.de\nEmail --> fabian.wetjen@web.de\nDiscord --> Naumy#4669","replies":[{"poster":"Shacoláde","date":"2019-10-10T11:11:16.398+0000","up_votes":1,"down_votes":0,"body":"Hey,\n\nklingt doch interssant.\nich hab zwar nicht viel Erfahrung mit schneiden von Videos, hatte jedoch schon lange vor\nmich da tiefer reinzugraben. Wenn du willst können wir uns ja mal in Ruhe im TS zu unterhalten.\n\nGruß,\nShacolade","replies":[{"poster":"Naumy","date":"2019-10-10T12:30:43.314+0000","up_votes":1,"down_votes":0,"body":"Kannst gerne jeder Zeit auf ts on kommen.","replies":[{"poster":"Shacoláde","date":"2019-10-10T12:36:39.619+0000","up_votes":1,"down_votes":0,"body":"Alles klar. Ich schau heute abend mal vorbei","replies":[]}]}]}]}