{"poster":"LOL Spammer","date":"2015-12-18T22:27:07.865+0000","title":"You know you're having fun when","subforum":"[ARCHIVED] Miscellaneous","up_votes":60,"down_votes":4,"body":"You get to the point in the game when it is so close and everyone is full build and both teams have pushed the the nexus and its SO STRESSFUL and everyone is trashtalking in all chat and everyone is having a good time. EVERYONE, I just recently had one of the games. I just played a game that was 1:03 hours long. I miss these. Anyone else?","replies":[{"poster":"ChaosThief","date":"2015-12-19T01:21:06.387+0000","up_votes":14,"down_votes":1,"body":"Upvote and move on folks. We know it's true but have no words to describe how awesome it is.","replies":[]},{"poster":"Dangerous Man","date":"2015-12-19T03:53:56.106+0000","up_votes":11,"down_votes":0,"body":"103 hours long\ndang son","replies":[{"poster":"Virgin Ray","date":"2015-12-19T15:25:58.130+0000","up_votes":8,"down_votes":0,"body":"\"Keep it together bro!\" The game will end soon.\nhttps://49.media.tumblr.com/d19e5b02edfe82dcea9ee06fa9d8a61b/tumblr_n6aiisJVdP1tbh1dho1_250.gif","replies":[]},{"poster":"macromite","date":"2015-12-19T06:07:53.410+0000","up_votes":8,"down_votes":0,"body":"back in my day that was a short match","replies":[]},{"poster":"LOL Spammer","date":"2015-12-19T17:37:39.329+0000","up_votes":1,"down_votes":0,"body":"uh... 1:03 hours long means 1 hour and 3 minutes {{sticker:zombie-brand-facepalm}}","replies":[]}]},{"poster":"Mcprowlington","date":"2015-12-19T04:29:49.263+0000","up_votes":9,"down_votes":0,"body":"> SO STRESSFUL\n\nThis is the only part that sticks with me. It really is incredibly stressful. I didn't play the last hour so someone could get caught out and cost the entire game.","replies":[]},{"poster":"Supreme Senpai69","date":"2015-12-19T01:47:01.404+0000","up_votes":7,"down_votes":0,"body":"I love this, it's super fun, it just becomes impossible to carry at that point because every small mistake means potential to lose. I just had a game like that where each of our nexus was half HP and I decided to stay behind to protect it since I was the most tanky. What does our team do? One by one they run into the enemy nexus and die off instead of grouping. It's super fun but super frustrating because you need the cooperation of all five players which rarely happens.","replies":[]},{"poster":"AninLegions777","date":"2015-12-19T12:33:38.093+0000","up_votes":2,"down_votes":0,"body":"I miss the average 30-40 min game where anything was possible. Now enemy surrenders at 20-23 mins because one nexus turret is already gone.","replies":[]},{"poster":"Zhire","date":"2015-12-19T07:45:42.537+0000","up_votes":2,"down_votes":0,"body":"A couple days ago, we won a 58 minute rank game. And yeah, it was intense as f***. Basically whoever messes up loses. Enemy xin was top lane and 2 was in their jungle chasing our blitzcrank who warded their base (no turret). I tp with homeguard and ended the game\nGot +4 honor LOL","replies":[]},{"poster":"DrOinkleBerry","date":"2015-12-19T06:34:18.314+0000","up_votes":2,"down_votes":0,"body":"Lategame teamfight-oriented matches are always great... unless your team composition is terrible for teamfighting, but then again, you'd usually loose the game before lategame anyway if your team composition is ass.","replies":[]},{"poster":"4thHorsman","date":"2015-12-19T05:38:36.474+0000","up_votes":2,"down_votes":0,"body":"I love these games, you get so sucked into it and you are focused so hard on the game and what needs to be done. It's probably the best feeling in this game.","replies":[]},{"poster":"Only Play Darius","date":"2015-12-20T09:57:58.207+0000","up_votes":1,"down_votes":0,"body":"I love those long games. Everything's on the line, everyone is at full build so it's not about who's fed, it's about playing your role and doing what you gotta do for the team effort","replies":[]},{"poster":"Boxpencil","date":"2015-12-20T04:33:07.486+0000","up_votes":1,"down_votes":0,"body":"I played in a 50 minute game just recently, lmao. SOOOO much trashtalking.","replies":[]},{"poster":"Hyppocritamus","date":"2015-12-20T03:25:03.673+0000","up_votes":1,"down_votes":0,"body":"Upvote for the ARAM I had last month that took around 1:30.  One of the most fun games I've ever had.  Anyone I mention it to, though, just chides me for taking so damned long.","replies":[]},{"poster":"Catastrop","date":"2015-12-19T22:24:30.000+0000","up_votes":1,"down_votes":0,"body":"I had a game like this yesterday. Was playing Sona and the enemy team was made up of 3 guys from the game before(they were on my team though) and all through the game we kept spamming \";^)\" whenever something happened. It hilarious when they hit our nexus and you saw 10 \";^)\"s from every person instead of \"GG.\"","replies":[]},{"poster":"Jasiwel","date":"2015-12-19T22:19:32.979+0000","up_votes":1,"down_votes":0,"body":"I like games like that, but shave 20 minutes. At 63 minutes, everyone is just glad the game is over, glad that trashtalking is almost over, and most everyone has kind of gone past the point of fun in those cases. I don't play League for the stress and especially not to be wiped out after one super long game. Now, when a long game is close all game and people are typing ridiculous jokes into /all chat, I find that to be the most fun. \n\nThat said, I'd take those games over the current ones. The games mostly end at 20 minutes now - the rest of the time is simply a prolonged dying animation of the losing team. It used to be that you could feasibly catch up and snowball back for a possible close game. Now games end totally one-sided and the gold lead for one team is typically double the other team, which is kind of freaky when you think about it.","replies":[]},{"poster":"AlienPrimate","date":"2015-12-19T19:13:44.834+0000","up_votes":1,"down_votes":0,"body":"http://matchhistory.na.leagueoflegends.com/en/#match-details/NA1/2037191340/209287161?tab=overview\n\nThis game was a 41 minute 4v5 win.  We lost 2 inhibs and were down by 8k gold with 0-4 dragons at 32 minutes and we came back to win 9 minutes later by pushing mid like crazy the last bit of the game by getting 2 barons in a row.  This was also my first game ever as Leona so that was a plus.","replies":[]},{"poster":"Beacon 0F Light","date":"2015-12-19T19:09:26.926+0000","up_votes":1,"down_votes":0,"body":"Actually had a recent game where I played full AD Lee mid with my friend who was playing Taric jungle. We were up against a 5-man premade, and kinda got wrecked about 25-30 minutes in. They had gotten every inhib and both nexus towers. \n\nBut somehow we managed to start winning fights. Slowly we snuck back in, and though the enemy made a ton of mistakes, it was still super hard because of their lead. The highlight was I believe about 45-50 minutes in, when they finally made the Baron call and we knew we HAD to contest or else we would lose. I manage to, as full AD Lee Sin, steal the Baron from over the wall with my Q, and although I also die soon after, my team pretty much wins the fight. It took a little more time after that, but eventually that secured the win for us.\n\nVery intense and memorable game. \n\nI'm also pretty sure every one of the enemy players failed flash at some point, which made it pretty entertaining. XP","replies":[]},{"poster":"AlienPrimate","date":"2015-12-19T18:59:47.396+0000","up_votes":1,"down_votes":0,"body":"But there is always that guy who wants to surrender in those games.","replies":[]},{"poster":"SirHeavyScrotum","date":"2015-12-19T18:33:32.825+0000","up_votes":1,"down_votes":0,"body":"Yup. Love those games, the feeling of satisfaction of winning one of those is so worth the time.","replies":[]},{"poster":"lol4it","date":"2015-12-19T18:20:28.343+0000","up_votes":1,"down_votes":0,"body":"yeah","replies":[]},{"poster":"BladeOfRuin","date":"2015-12-19T17:25:16.344+0000","up_votes":1,"down_votes":0,"body":"i had one of those games a couple days before i was  {{champion:201}} support,the enemy team snowballed in early game except jungle because our  {{champion:56}} was snowballing and controlling both his and enemy jungle,so typical enemy  {{champion:23}} would splitpush the game to hell and he did it damn well, at the end we were able to stall the game till like 70 min mark where everyone was full build,both us and enemies rushed the nexus and it was open so {{champion:23}} tried to backdoor alot of times but he failed, me and {{champion:56}} kept killing him and saving the nexus with like 1 hp and then a teamfight broke in near the baron bit with enemy {{champion:23}} dead and then we pushed and won.\n\nand then i spilled the water i was drinking at my keyboard.","replies":[]},{"poster":"Germzz Z","date":"2015-12-19T16:24:14.408+0000","up_votes":1,"down_votes":0,"body":"It's funner in rank.","replies":[]},{"poster":"Robbit Mang","date":"2015-12-19T15:20:53.936+0000","up_votes":1,"down_votes":0,"body":"This was my entire experience in my ranked series to gold. My armpits were sweating and when I finally got it I jumped up out of my chair like \"nice...\"","replies":[]},{"poster":"sealust","date":"2015-12-19T13:02:20.405+0000","up_votes":1,"down_votes":0,"body":"I just had one of these yesterday. The only reason we won is b/c the enemy decided to baron instead of push to our nexus. I (Janna) was the only one left alive and I would not have been able to stop them. It was really funny, and totally worth due to the fact it was ranked.","replies":[{"poster":"Solari Fortune","date":"2015-12-19T14:45:59.310+0000","up_votes":1,"down_votes":0,"body":"So you pulled a JannaPeke?","replies":[]}]},{"poster":"Solari Fortune","date":"2015-12-19T14:45:16.431+0000","up_votes":1,"down_votes":0,"body":"I love these matches because it puts everyone into this hyper aware of the map mode. Kinda the closest I feel towards something like LCS.\nOnly time I hate it though is when someone says \"GG EZ\" at the end.","replies":[]},{"poster":"Yosuke Apperu","date":"2015-12-19T12:54:55.406+0000","up_votes":1,"down_votes":0,"body":"Don't forget the double aces!","replies":[]},{"poster":"Solaxo","date":"2015-12-19T10:54:05.164+0000","up_votes":2,"down_votes":2,"body":"No, I don't miss these. Too stressful. Too frustrating.","replies":[]},{"poster":"Sammystorm","date":"2015-12-19T02:39:08.318+0000","up_votes":3,"down_votes":4,"body":"I dislike hour long games with a passion. They are really boring. It is basically who has the best team comp and who wins that one team fight.\n\nGames with people having fun are great though.","replies":[]},{"poster":"A Miss Fortune","date":"2015-12-19T12:02:52.938+0000","up_votes":1,"down_votes":4,"body":"I enjoy the trashtalk in All Chat, I don't understand why so many people get horrifically offended and take it as a death threat. I feel like some people take \"gg ez\" as telling them to kill themselves or other just trolly comments like that which don't really mean to offend anyone.","replies":[]},{"poster":"TSM Scarra","date":"2015-12-19T01:31:37.525+0000","up_votes":2,"down_votes":9,"body":"I dont want that to occur though. Its stupidly long. Gets boring, because if you fed early game, you wont get punished. If you won lane early game, you wont get rewarded. Shorter games are better. The team with more gold, should indeed end faster.","replies":[]}]}