{"poster":"aSoX","date":"2015-05-08T16:52:34.907+0000","title":"Ex Dia sucht Team/Clan/Community","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hey alle zusammen,\r\n\r\nmein Name ist Amir ich bin 20 Jahre alt und spiele seit gut 10 Jahren RTS. Angefangen habe ich damals mit Wc3 und dem Mod DotA und seit der Closed Beta bin ich bei LoL! Schon immer war ich mehr oder weniger aufs Competitive Gaming aus als aufs Just for Fun zocken. \r\nIch habe in der SoloQ High Dia Erfahrung, im 5n5 Ranked Mid Dia, und im 3n3 bin ich in einigen Challi Teams gewesen. Habe f&uuml;r meine Teams Spiele Analysiert und Shotcallen kann ich falls gew&uuml;nscht auch.  Das ganze ist aber schon etwas l&auml;nger her, ich habe vor einiger Zeit aus Privaten Gr&uuml;nden das Gamen an den Nagel geh&auml;ngt. Jetzt habe ich wieder angefangen und suche so schnell wie m&ouml;glich Anschluss ! Ich bin eingerostet und habe viele der Ver&auml;nderungen verpasst, sprich ich bin derzeit dabei meine Magie wieder zu finden :P \r\nIch suche einen Clan eine Community oder einfach ein gut organisiertes Team! \r\nIch k&ouml;nnte hier jetzt noch Stundenlang &uuml;ber mich schreiben aber ich denke das l&auml;sst sich besser &uuml;bers TS kl&auml;ren falls hiermit euer Interesse geweckt wurde.  Einfach Adden und mich anschreiben !!! (Nicht wundern &uuml;ber den Account) Ist ein Smurf von nem Kumpel, der ist Hoch geboostet und SoloQ funktioniert derzeit nicht da eine Spiele Sperre drin ist :/ Muss diese noch abarbeiten (Team Rankeds funktionieren trotzdem) .\r\n\r\n\r\nMfg\r\n\r\n{{summoner:13}}","replies":[{"poster":"aSoX","date":"2015-05-09T13:13:17.074+0000","up_votes":1,"down_votes":0,"body":"*push*","replies":[]},{"poster":"TEG AlphaRed","date":"2015-05-08T18:41:18.579+0000","up_votes":1,"down_votes":0,"body":"Darf man wissen was deine Main Posi ist?^^","replies":[]},{"poster":"aSoX","date":"2015-05-08T18:12:12.129+0000","up_votes":1,"down_votes":0,"body":"*push*","replies":[]},{"poster":"aSoX","date":"2015-05-08T17:43:27.237+0000","up_votes":1,"down_votes":0,"body":"*push*","replies":[]}]}