{"poster":"Zsâdist","date":"2017-01-19T22:45:59.622+0000","title":"Neue Map 4vs4vs4","subforum":"Karten & Spielmodi","embed":{"description":null,"url":"http://i.imgur.com/x5s9cMy.jpg","image":"http://imgur.com/x5s9cMys.jpg"},"up_votes":3,"down_votes":1,"body":"Nachdem Dominion rausgenommen wurde. w&uuml;rde ich mich &uuml;ber eine neue dauerhafte map freuen die permant in league vorhanden ist. derzeit wechselt dies ja jede woche aber etwas neues w&auml;re ja m&ouml;glich zu testen auf dem pbe. 1er f&uuml;r jede lane + jungler. was halted ihr von solch einer idee","replies":[{"poster":"Sirrkas","date":"2017-01-19T23:54:00.067+0000","up_votes":2,"down_votes":0,"body":"Ist die Midlane dann nur noch ein Farmfest? Ich wüsste nämlich nicht, wie man da anständig eine Wave pushen können sollte.","replies":[{"poster":"Zanlan","date":"2017-01-26T00:23:24.724+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sirrkas,realm=EUW,application-id=cGRapXds,discussion-id=rdianbQa,comment-id=0001,timestamp=2017-01-19T23:54:00.067+0000)\n>\n> Ist die Midlane dann nur noch ein Farmfest? Ich wüsste nämlich nicht, wie man da anständig eine Wave pushen können sollte.\n\n2 getrennte Minionwaves in der Midlane :)\nWürde wohl ein Farm sowie Gankfest werden.","replies":[]},{"poster":"gamerman3000","date":"2017-01-20T13:13:06.689+0000","up_votes":1,"down_votes":0,"body":"Vielleicht teilen sich die Minions auf die beiden anderen lanes auf.","replies":[{"poster":"Sirrkas","date":"2017-01-20T18:58:55.282+0000","up_votes":1,"down_votes":0,"body":"Wobei, dass Bild erinnert mich an eine Warcraft 3 Map, genannt Dota Allstars, wenn ich mich recht erinnere. Das war wohl eine Eigenkreation nach Dotavorbild. In der Mitte waren da glaube ich durchgehend Minions von allen Teams und haben aufeinander eingekloppt.","replies":[]}]}]},{"poster":"iShadow0","date":"2017-01-19T23:02:51.113+0000","up_votes":2,"down_votes":0,"body":"*hust* alt *Hust*","replies":[{"poster":"iShadow0","date":"2017-01-19T23:03:20.371+0000","up_votes":2,"down_votes":0,"body":"diese idee gab es schon lätztes jahr und davor, scheitert einfach daran das sich zwei teams verbünden können","replies":[]}]},{"poster":"Zsâdist","date":"2017-01-25T19:57:08.492+0000","up_votes":2,"down_votes":1,"body":"kann ich hier video einfügen gibt bei einem ähnlichen spiel fast ideal selbe map und funktioniert 1a deswegen dachte ich umsetzung auch hier möglich.\nwenn es geht lad ich video dazu hoch ka 5 min oder so wie mitte und lanes geregelt wird","replies":[]},{"poster":"Legend Alpha","date":"2017-02-05T18:25:50.493+0000","up_votes":1,"down_votes":0,"body":"lieber 5 vs 5 vs 5,\nIm jedem Team gehen  3 leute mid","replies":[]},{"poster":"NickFrozen","date":"2017-02-02T17:31:04.809+0000","up_votes":1,"down_votes":0,"body":"Sehr interessant. Mit zwölf Spielern könnte man einen ,,Oktakill\" (Achtfachtötung) hinlegen. In übertreibendem Sinn wäre dieses Symbol praktisch größer als eine Fünffachtötung, sodass dieses Symbol den halben Bildschirm überdeckt.\n\nPositiv ist es, dass es neue Strategien gibt, wie man sich da agieren muss. Das Farmen in der Anfangsphase in der ,,Midlane\" bei drei Spielern ist es auch sehr interessant, wie sie die (anderen) Vasallen wegnehmen.\n\nIch stelle mir (euch, allerdings) Fragen:\n\n1. Geht das Spiel zu Ende, wenn zwei von drei Nexus (pl.) zerstört wird? Sollen besonders die Spieler mit dem zerstörtem Nexus sofort aus dem Spiel entfernt werden, sodass es nur noch zwei Teams sich gegenüberstehen?\n2. Ist Achtfachtötung realisierbar oder übertrieben?\n3. Sollte beim ,,Reporten\" auch noch eine Ankreuzmöglichkeit ,,(Dauerhaftes) Verbünden der Feinde\" geben?\n4. Wie werden die Vasallen in der mittleren ,,Lane\" auf zwei Wegen verteilt sein, insbesondere Supervasallen?\n5. Müssen neue kaufbare / gesperrte Gegenstände speziell für diese Karte gemacht werden?\n6. Wie soll der Ladebildschirm für drei Teams (Verteilung) dargestellt sein? Vielleicht vier Champion pro Reihe.\n7. Gibt es einen speziellen (eigenen) (Gruppen)Chat für das jeweilige Team (halbprivat)?\n\nWenn es für jeden dieser Punkte eine Lösung gefunden wäre, dann wäre ,,4 vs 4 vs 4\" auf jeden Fall eine sehr gute Idee.\nIch schließe mich gerne dieser Idee an. Dabei denke ich mir an solche Punkten, wie das ganze funktionieren könnte.","replies":[]},{"poster":"zLives","date":"2017-01-28T20:42:35.527+0000","up_votes":1,"down_votes":0,"body":"Es müssten pri Seite 2x mehr minions kommen damit 1 reihe hoch und 1 reihe runter geht","replies":[]},{"poster":"xinf3ct3d","date":"2017-01-25T21:37:35.892+0000","up_votes":1,"down_votes":0,"body":"Es wäre sicher Cool, jedoch müsste man den All Chat in dem Mode abstellen um zu verhindern, dass sich zwei Teams verbünden.So ein Mode wäre sicher Fun wenn man es mit Quests oder so Kombiniert die man Ingame bekommt","replies":[]},{"poster":"ChazyCB","date":"2017-01-20T13:19:18.764+0000","up_votes":1,"down_votes":0,"body":"Der Jungle wäre interessant, gleichzeitig auch sehr unübersichtlich...ebenso die Midlane...wie soll das mit der Farm funktionieren.Ist in beiden Fällen schwierig!Wenn sich Teams dann noch verbünden um das andere von Anfang an aus dem Spiel zu nehmen wird das Interesse schnell schwinden.\n\n{{sticker:zombie-nunu-bummed}}","replies":[]}]}