{"poster":"RVT Kitsunedao","date":"2017-11-20T05:37:21.997+0000","title":"La evolución de los trolls? Nos dominaran a todos?","subforum":"Charlas Generales","up_votes":4,"down_votes":1,"body":"Me acaba de tocar la partida mas asquerosa hasta ahora. (Ranked)\r\n\r\nUn Twisted fate super flamer que muri&oacute; 6 veces en 10 min. Un Maokai que no sabia ni donde estaba parado e igual de flamer que el twisted.\r\nLos dos haciendo se&ntilde;ales a todo el team...SUPER insoportables. Te juro que prefer&iacute;a perder antes que seguir un segundo mas en esa partida.\r\n \r\nY tras de todo el Twisted solt&oacute; la frase... &quot;por eso siguen en plata&quot;... entro al perfil, oro V 0 pl, weeee. \r\nAsco de gente.\r\nAunque no los culpo, de seguro tienen 10 a&ntilde;os o por ah&iacute;. Seguro estaban enojado por que la mami no les calent&oacute; la leche :/\r\nAl twisted le hab&iacute;a tocado un vladimir en frente (se imaginaran un vladimir feed al min 10, quien lo para?) {{champion:8}} {{item:3285}} {{item:3089}} {{item:3001}} \r\nY el Maokai le dio la primera sangre a un Garen, esta bien, eso puede pasar...pero la cosa es que le hice 50 se&ntilde;ales para que no pelee contra el. Y bueno, luego empez&oacute; a morir (una muerte por minuto f&aacute;cil)\r\n\r\nNo voy a poner nombre, pero ojala est&eacute;n leyendo esto, y ojala les baneen la cuenta. \r\n\r\nY lo peor de todo esto, es que ahora me toco a mi, pero estoy seguro que de esta clase de gente esta lleno.\r\nQuiero que entiendan que ya no estamos hablando de un troll, esto es algo mas all&aacute;, una rata super evolucionada xD \r\n\r\nBueno en fin, escrib&iacute; esto solo para desahogarme nada mas.\r\n\r\n Si te paso algo parecido cu&eacute;ntalo.\r\n{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Reviro","date":"2017-11-20T17:51:43.454+0000","up_votes":1,"down_votes":0,"body":"pasa cada día viejo, en todos los modos de juego, a los flammer troll los muteas y al final de la rabia, las ganas de mandar a la mierda todo y q ensima se burlen luego en el chat, los podes blockear, más q eso hule... los trolls mandan =)","replies":[]},{"poster":"Riklde","date":"2017-11-20T14:35:04.984+0000","up_votes":1,"down_votes":0,"body":"a mi me paso algo parecido pero yo era  el troll xD","replies":[]}]}