{"poster":"Sturmfeder","date":"2015-12-01T16:42:35.432+0000","title":"Qualifying für Ranked Matches","subforum":"Champions & Gameplay","up_votes":1,"down_votes":1,"body":"Ausgangspunkt meiner Idee ist:\r\nImmer wieder begegnen mir im Ranked Spieler, die einen Champion zum allerersten Mal spielen (und das im Chat auch noch zugeben). Oftmals wird dann gefeedet, weil man eben noch nicht so ge&uuml;bt ist. Mich &auml;rgert das immer wieder, vor allem wenn ein neuer Champ rauskommt.\r\n\r\nAbhilfe:\r\nWir haben doch jetzt die sch&ouml;nen Wappen zur Championstufe. Wie w&auml;rs, wenn man Ranked nur dann spielen kann, wenn man die erste Stufe erreicht hat?\r\nMan macht sozusagen erstmal den &quot;Freischwimmer&quot; bevor man ins Tiefe (=Ranked Match) geht ^^\r\nF&uuml;r alle neuen Spieler macht es wohl keinen Unterschied, da sie auf dem Weg zu Level 30 sowieso die 16 Champions kaufen m&uuml;ssen und diese dann wohl meistens auch mal ausprobieren. F&uuml;r alle alten Hasen hier bei LOL w&uuml;rde es bedeuten, da&szlig; man erstmal zusehen muss, da&szlig; man 16 Champs mit Stufe eins hat, was f&uuml;r mich z.B. schwer w&auml;re, da ich die letzte season komplett gefehlt habe.\r\n\r\nWas haltet ihr davon?","replies":[{"poster":"Sturmfeder","date":"2015-12-06T11:47:32.432+0000","up_votes":1,"down_votes":0,"body":"Schade! Hatte gedacht , daß da mehr Kommentare kommen. Scheinbar ist das Thema doch nicht jedem so ein Übel wie mir. Trotzdem denke ich, daß in einer Umfrage sehr viele die Frage nach solchen \"Spiel Verloren durch unskilled Champs\" mit Ja beantworten würden.\n\n@support: Kannste dicht machen hier ;)","replies":[]},{"poster":"Sturmfeder","date":"2015-12-01T19:57:30.546+0000","up_votes":1,"down_votes":0,"body":"Genau. Ich stimme Dir zu. Genau deshalb soll eben jeder schon mal paar Spiele gemacht haben und nicht jungfräulich in Ranked einsteigen können.","replies":[]},{"poster":"HyperionCH","date":"2015-12-01T16:59:08.518+0000","up_votes":1,"down_votes":0,"body":"Und wo sollte die Grenze sein?\nEinige Spieler könnten nach 10-20 Normals einen Champ bereits recht gut. Andere spielen einen Champ über 100 Mal und spielen ihn immer noch auf Bronze-Niveau.\n\nBei neuen Champs ist es auch so, dass viele Gegner damit nicht zurecht kommen. Warum sonst gibt es hier so viele \"Riot, nerf Illaoi!\"-Threads, obwohl die winrate immer noch unter 50% ist? (zudem gab es genug neue Champs, die wirklich zu stark waren und kurz darauf einen Nerf kriegten).\nIn High Elo hat man es offenbar recht gut gelöst: Illaoi wird sehr oft gebannt, obwohl die winrate - wenn kein ban - dort noch sehr viel tiefer ist (40-45% winrate).","replies":[{"poster":"Sturmfeder","date":"2015-12-01T17:33:18.443+0000","up_votes":1,"down_votes":0,"body":"Die Grenze sollte dieses Wappen sein - STUFE 1 - um zumindest 2 Siege bzw 2-4 Spiele mit dem entsprechenden Champ gemacht zu haben.","replies":[{"poster":"HyperionCH","date":"2015-12-01T19:44:31.513+0000","up_votes":1,"down_votes":0,"body":"Ehrlich gesagt ist Stufe 1 oder Stufe 2 ja nicht wirklich viel.\nGerade schwierigere Champs wird man ja auch mit 2-4 Games wesentlich besser können als beim ersten Game.","replies":[]}]}]}]}