{"poster":"AlexDotP","date":"2015-11-19T10:08:17.859+0000","title":"HeimerDONGER","subforum":"Gameplay & Strategy","up_votes":2,"down_votes":1,"body":"Ayy, when you play a game of League you probably have versed a champion named HEIMERDINGER. A champion who puts down a turret and stand there do nothing while you get harassed and poked a lot. I found him kind of worse than Teemo (I mean I main Teemo so I like Teemo :/)\r\nSo lets see YOUR thought on Heimer and what to do to counter him because Im really not liking Heimer...{{champion:74}} {{champion:74}} {{champion:74}}  \r\n\r\nCalm down Alex plz {{summoner:13}} {{summoner:1}}","replies":[{"poster":"Zaps","date":"2015-11-20T00:52:09.344+0000","up_votes":3,"down_votes":0,"body":"I'm a pretty big fan of playing Heimerdinger, because in general he's asking really tough questions of your opponent that are difficult to answer unless you're used to fighting against him. \n\nThe core of Heimer's power is going to be in the turrets pretty much always, so pretty much everything relies on dealing with that:\n\n* **Stay ahead of the curve and destroy his turrets as he puts them down** - This is something that strong early game champs can do pretty well. If you're able to do this, you're also just getting extra free money from killing them.  Champions that have done this pretty effectively vs me when playing Heimer - Lee Sin, Cho'Gath, Orianna (thanks to the power of her passive) and Karma. \nBasically, anyone with strong single target burst and decent sustain can do this for a long period of time. If you're able to consistently do this, you're going to be able to pressure him pretty hard and stop him from playing the normal Heimer play-style.  Heavy AoE damage taking advantage of not-so-great tower positioning is really strong at this as well!\n\n\n* ** Make his turrets not as useful. **You can do this by trying to manipulate the lane away from wherever space he is trying to control with the turrets. This is pretty damn tough to do, and is only really possible for some champions.  \n\n\n* ** Stay away from his turret's zone of control and trade harass back.** This is only really an option when laning a poke-mage against him, and is going to be pretty tough to do thanks to his pretty strong sustain passive and ability to build sustain early. That said, he only has his rockets for poke, and if you're able to dodge that effectively, you'll win a poke game, if slowly.. \n\n\n* **Don't play Heimer's game**. By this, I mean, Heimerdinger really wants to keep you in lane, and keep you pinned down unable to farm or do anything to help your team.  Not playing his game can be tough to do - because as soon as you leave lane to roam, Heimer is able to push pretty quickly and suddenly by placing turrets.... But if your lane isn't giving you any farm, and you're going to lose your tower anyway... why not try to get something else out of it? \n * Also, it can be effective to pretend that you are going to roam, wait for him to move his turrets out of position from the normal laning stance into a pushing stance, and then return.  In general, you want to make Heimer have no certainty over what you're planning on doing, so he can't plan his turret positioning effectively. \n\n\nLike I said earlier, it's a tough match-up for most champions until you get used to playing against a Heimerdinger. My suggestion for most of the time when you're uncertain of how to counter a champion is to try-out playing them - nothing gets you to understand a champions weakness than having to deal with others exploting them! :D","replies":[{"poster":"AlexDotP","date":"2015-11-22T19:04:13.429+0000","up_votes":1,"down_votes":0,"body":"Thank you soooo much for this great info and tips, hopefully I'll be able to lane against Heimer and not get harassed like before","replies":[]}]},{"poster":"Zorphiax","date":"2015-11-19T10:32:25.205+0000","up_votes":2,"down_votes":0,"body":"In any game against heimerdinger it is really hard to win early and how you suppose to push tower when you have 3 enemy turrets taking out your minions while protecting your enemy champion. Well here are 2 ways.\n\n1) Wait till late game. Unlike most AP champion Heimerdinger doesn't scale as high with AP so he will be weaker late game and his turret well let the minions take the bug blast then jump him with hard cc.\n\n2) Roaming. Just because you were assigned mid or top doesn't mean you stay there if you can't push your lane and there are no minions try to go bot and if it works out well you can normally turn it into a dragon if you jungler is there.(By the way Heimerdinger won't push your lane hard because he has low ad and his AP isn't as high as other champions so unless he has like loads of minions and stacks of his turret your tower should be safe.)","replies":[{"poster":"AlexDotP","date":"2015-11-22T19:04:19.954+0000","up_votes":1,"down_votes":0,"body":"Wow thanks for great tip :D","replies":[]}]},{"poster":"Rocka","date":"2015-11-19T10:16:07.313+0000","up_votes":2,"down_votes":0,"body":"just take his turrets out","replies":[{"poster":"Zorphiax","date":"2015-11-19T10:25:54.979+0000","up_votes":1,"down_votes":0,"body":"In normals this is quite hard especially since it is blind picked against you and going melee makes it even harder.","replies":[]}]},{"poster":"Roguestoney","date":"2015-11-22T20:37:23.503+0000","up_votes":1,"down_votes":0,"body":"How to counter Heimer. Play Syndra throw his turrets at him.","replies":[]},{"poster":"Jink","date":"2015-11-22T20:23:20.439+0000","up_votes":1,"down_votes":0,"body":"Just pick Syndra and throw his Turrets at your Turret, also you can set up ganks well and grab his Ulti Turret too and just throw it away (freelo). Some people pick Nunu into him too and eat his turrets.\n\nOther than that he's pretty strong, good poke with rockets and Turrets are hard to take out. Try asking your jungler to gank since he pushes a lot and keep pink or 2 to clear brush to open opportunities to gank around lvl 7-9.\n\nChamps with wave clear do OK if you focus on clearing and farming then play more aggressive later when you can kill his turrets faster (they regen sorta fast and are hard to take out early).\n\nAssassins can do well against him but if he takes heal/barrier you can have a problem so I tend to just pick Syndra or otherwise focus farm and clearing turrets then maybe trading or go all out with harass but it's risky to focus on harassing him as he can pop down a few turrets and if you are out of mana you basically have to B and he'll push your wave out and by the time you get back you'll be back at square one and not much better off plus you'll have missed a wave or so and will get pushed under turret again most likely and lose CS which is why I tend to go for mid game and just farm/wave clear and then focus on fighting him later since being denied CS is often worse than having to deal with a semi-farmed heimer and if you do make a mistake early with an all-in or through trying to force him out of lane he can punish you extremely effectively.","replies":[]}]}