{"poster":"AveNuPorciu","date":"2017-01-10T01:03:42.757+0000","title":"ADC 2017","subforum":"Discussioni generali","up_votes":1,"down_votes":1,"body":"Scrivo questo post per descrivervi la mia ultima esperienza da adc, Io  ero con ezreal, la mia build era composta da 5 item e 1/4 , ij in fight vengo oneshottato da un akali con solo due item offensivi, Gunblade e Lich Bane, senza tempo di reazione...Ora non sar&ograve; io faker , ma nemmeno lui era un challenger,  e questa cosa che alcuni champ possono saltarti addosso e ucciderti senza darti il tempo di riposizionarti &egrave; alquanto fastidiosa( La mia E era in cd per  un precedente tentativo di focus da parte di irelia) , ho flashato ma niente da fare, mi &egrave; risaltata addosso e mi ha killato...La mia domanda &egrave;:Perch&eacute; un champ con un 1 item in meno di me, con due soli item offensivi mi uccide in 2-3 sec?Capisco che sia akali ma , i danni sono esagerati da parte di alcuni champ","replies":[{"poster":"Kim114","date":"2017-01-10T01:37:04.655+0000","up_votes":1,"down_votes":1,"body":"Rito ha randombuffaro alcuni champ che non ne avevano bisogno {{champion:84}} appunto e{{champion:86}} (la cosa della E dovrebbero farla attivare solo al lv 5 dell'abilità)","replies":[{"poster":"oroora6","date":"2017-01-10T01:52:08.665+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Kim114,realm=EUW,application-id=MJVj50Jw,discussion-id=TGyB6FNP,comment-id=0000,timestamp=2017-01-10T01:37:04.655+0000)\n>\n> Rito ha randombuffaro alcuni champ che non ne avevano bisogno {{champion:84}} appunto e{{champion:86}} (la cosa della E dovrebbero farla attivare solo al lv 5 dell&#x27;abilità)\n\ntu ripeti solo che akali è stata buffata e per me sei morto, 45% di winrate e ancora a lamentarvi della mia povera akali, siete dei mostri :(\nla colpa non è degli assassin o dei tank con ingage({{champion:154}} ,{{champion:54}} ,{{champion:120}} ecc shottano tutti l adcarry), ma piuttosto degli adcarry. Andrebbero cambiati totalmente adcarry come twitch, che hanno troppo raggio e aggiunti oggetti che diano resistenze a questi poveri cristi, almeno akali per ammazzare l adcarry si mette in pericolo e quasi sempre ci muore, syndra preme solo R!\nIo comunque per far tornare gli adcarry all antico splendore ripropongo il kog spammone :3 {{champion:96}}","replies":[{"poster":"Kim114","date":"2017-01-10T02:04:26.284+0000","up_votes":1,"down_votes":0,"body":"> tu ripeti solo che akali è stata buffata e per me sei morto, 45% di winrate e ancora a lamentarvi della mia povera akali, siete dei mostri :(\n\nChe akali è stata buffata \n\nScherzi a parte, gli ADC in questo momento o sono instashottati, o sono inkillabili {{champion:222}} afk triplakill 1v3\n{{champion:222}} 0/17 causa{{champion:107}} ","replies":[{"poster":"oroora6","date":"2017-01-10T02:06:06.712+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Kim114,realm=EUW,application-id=MJVj50Jw,discussion-id=TGyB6FNP,comment-id=000000000000,timestamp=2017-01-10T02:04:26.284+0000)\n>\n> Che akali è stata buffata\n\nti vado a fare la tomba >:","replies":[{"poster":"Kim114","date":"2017-01-10T02:38:18.637+0000","up_votes":1,"down_votes":0,"body":"Che akali è stata buffata{{champion:83}}","replies":[]}]}]},{"poster":"AveNuPorciu","date":"2017-01-10T11:11:51.042+0000","up_votes":1,"down_votes":0,"body":"L unico Adc che veramente può competere con le altre classi e  vincere negli 1 vs 1 è Vayne, gli altri Adc con un buon posizionamento e con il giusto peeling possono fare la differenza...Vayne grazie al suo kit può farne a meno di una delle due cose","replies":[]},{"poster":"SickAnto","date":"2017-01-10T07:19:35.875+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=oroora6,realm=EUW,application-id=MJVj50Jw,discussion-id=TGyB6FNP,comment-id=00000000,timestamp=2017-01-10T01:52:08.665+0000)\n>\n> tu ripeti solo che akali è stata buffata e per me sei morto, \nI buff ci sono.\n\n> la colpa non è degli assassin o dei tank con ingage({{champion:154}} ,{{champion:54}} ,{{champion:120}} ecc shottano tutti l adcarry), \nHeca non è un tank\n\nma piuttosto degli adcarry. Andrebbero cambiati totalmente adcarry come twitch, che hanno troppo raggio e aggiunti oggetti che diano resistenze a questi poveri cristi, almeno akali per ammazzare l adcarry si mette in pericolo e quasi sempre ci muore, syndra preme solo R!\nBeh, se ti butti per primo ovvio che ci muori.\n\n> Io comunque per far tornare gli adcarry all antico splendore ripropongo il kog spammone :3 {{champion:96}}\n\nNo, quello era un aborto.","replies":[]}]}]},{"poster":"TTP Nemes","date":"2017-10-16T19:11:24.069+0000","up_votes":1,"down_votes":0,"body":"La situazione invece di migliorare dopo 9 mesi addirittura è anche peggiorata, i miei complimenti più sinceri alla riot!","replies":[]},{"poster":"ReyZør","date":"2017-01-10T14:48:36.097+0000","up_votes":1,"down_votes":0,"body":"Se akali riesce a ingaggiare su di te vuol dire che eri posizionato malissimo","replies":[]},{"poster":"vondarck","date":"2017-01-10T13:05:16.019+0000","up_votes":1,"down_votes":0,"body":"gli ADC sono una classe un po MHE..\n\nnel senso, fanno danni e alcuni se si feddano fanno i buchi, ma rispetto ad altri champ un adc che rimane indietro è giocare 4v5, scalano troppo in late e poco in early/mid game\n\nserverebbero altri oggetti che danno abilità solo per ranged (al fine di non farli abusare da altre classi) che costano relativamente poco e fanno true DMG\n\nin ogni caso ho letto che in korea stà andando sempre più di moda {{item:3078}} e {{item:3071}} anche per gli ADC","replies":[]},{"poster":"ImSmurfnHolyPogz","date":"2017-01-10T11:17:02.891+0000","up_votes":1,"down_votes":1,"body":"Fatto sta che l'adc è un ruolo di merda al momento, hai bisogno di 2 tank e un support stile janna solo per sopravvivere piu di 10 secondi in un teamfight, ci metti comunque almeno 20 autoattacchi per tirar giu un full tank stile poppy, mentre poppy in 5 secondi ti manda alla fontana, morto o con la ultimate. Poi se per caso sopravvivi, arriva il rengar nemico 1-8 che ti critta per 900 a botta e saluti. Tutto questo ovviamente se in lane la zyra o Ziggs nemici di turno con mezzo oggetto non ti aprono in 2 ogni 3 minuti. Thanks rito","replies":[{"poster":"AveNuPorciu","date":"2017-01-10T11:24:39.189+0000","up_votes":1,"down_votes":0,"body":"Durante il rework degli assassini si parlava di più counterplay , o comunque chi utilizzava  in modo corretto  e le varie combo l assassin veniva premiato, ma niente, basta che spammi tasti e l adc crepa...Speravo in un piccolo rework stile Zed, che per massimizzare i danni devi saper colpire sia con il champ che con la sua ombra, e da li i players  scarsi con zed non diventavano una minaccia , questo cambiamento premiava chi veramente sapeva usare Zed e non spammoni di spells a caso come era prima..Oppure con Kha , che cmq se non sei feedato a schifo devi essere bravo a cogliere l avversario isolato ","replies":[]}]},{"poster":"SickAnto","date":"2017-01-10T07:10:43.252+0000","up_votes":1,"down_votes":0,"body":"Un assassino deve uccidere l'adc, è il suo lavoro.\nChe poi il resto del tuo team dov'era?","replies":[{"poster":"AveNuPorciu","date":"2017-01-10T11:03:09.928+0000","up_votes":1,"down_votes":0,"body":"Si ma buildato da assassin, Cosi se si butta su di me ,ed ha usato tutti i dash su di me , dovrebne crepare, ma con quei HP , akali non ha avuto problemi  a scappare ...Il problema non è akali come champ, ma la categoria di champ che pochi item offensivi , ti killa  in pochissimi secondi, anche con una build indietro della tua","replies":[]}]},{"poster":"Nel Pitoto","date":"2017-01-10T10:21:04.197+0000","up_votes":1,"down_votes":0,"body":"Certo ma poi non puoi comportarti come un midlaner full ap, se no che support sei? Tanti lo fanno per evitare le code, per di piu ti rubano anche il farm.","replies":[{"poster":"AveNuPorciu","date":"2017-01-10T11:00:15.117+0000","up_votes":1,"down_votes":0,"body":"E purtroppo non posso obbligare la gente a scegliere il supp giusto","replies":[]}]},{"poster":"Nel Pitoto","date":"2017-01-10T08:11:17.042+0000","up_votes":1,"down_votes":0,"body":"Il problema e che si pickano support superapdmgtishottolafamiglia ma poi in tf non hanno modo di coprire l adc, la maggior parte delle volte non fanno nemmeno la sighstone. Il buon vecchio braum ecc stanno andando in pensione. Questo in low elo, io non sono forte,  se no non sarei nell elo hell, ma spesso il ruolo di adc e davvero impossibile.","replies":[{"poster":"SickAnto","date":"2017-01-10T09:00:33.250+0000","up_votes":1,"down_votes":0,"body":"In Low elo non è una novità prendere support aggressivi come Annie, Brand o Zyra.\nC'è da sempre, semplicemente perché si da poco conto all'utility e si preferisce fare tanti danni.","replies":[]}]},{"poster":"ZilèanUltedTupac","date":"2017-01-10T08:53:36.050+0000","up_votes":1,"down_votes":0,"body":"Adc in 2017 LUL\nIeri ho vinto una ranked in plat con la bot con gp adc e nautilus support ahahah","replies":[]}]}