{"poster":"AveNuPorciu","date":"2017-05-29T21:12:00.099+0000","title":"Jhin MF ezreal","subforum":"Discussioni generali","up_votes":2,"down_votes":3,"body":"Sono tra gli adc pi&ugrave; weak del momento , c&#039;&egrave; troppo divario tra i vari cait , lucian , twitch ecc..Mf e Jhin penso siano i champ piu facili da killare , veramente prede facili e sopratutto adc senza danni , gli unici che fanno il solletico ai tank , infine ezreal , che ci mette troppo tempo a raggiungere il powerspike(pensare che a lucian e twitch basta prendere la BOTRK e stanno apposto)..Putroppo per il team che li ha &egrave; free lose ..","replies":[{"poster":"The Fluffy Lamb","date":"2017-05-30T07:19:58.550+0000","up_votes":1,"down_votes":0,"body":"Ti dico solo che con jhin ho sempre dominato le partite quabdo era in rotazione. Conta che, contro QUALSIASI CHAMP che non si è buildato arnor basta AA Q AA (aa normali) seghi tranquillamente mezza vita al champ che ti attacca. \n\nMf solo il nome mi fa tremare. L'ultima partita contro una mf avevo xayah e sta puttana apriva la ulti e faceva doppia con una facilità allucinante. \n\nEz è carne da macello nella maggior parte dei casi. \n\nLucian è insopportabile. Tra la facilità con cui farma e la facilità con cui ti pokka per ppi tornare al sicuro con quel sul dash è uno dei pick piu irritanti. Twich ha bisogno di un bel po di gold per essere un problema. I trade in lane li ho sempre vinti. È una copia cinese di vayne","replies":[]},{"poster":"Nice Doggo","date":"2017-05-30T06:12:11.953+0000","up_votes":1,"down_votes":0,"body":"Non è che non hanno danno... ma hanno cc inesistenti e poche possibilità di scappare... (eccetto la e di ez e la w di jhin) poi per il resto sono immobili.. chiunque se li becca da soli se li fa easy.","replies":[]},{"poster":"NOLIMIT Vladimir","date":"2017-05-30T06:03:39.140+0000","up_votes":1,"down_votes":0,"body":"Jhin worka bene contro un team senza tank, MF worka bene in una teamcomp da TF ed ezreal... Bho, mi sembra un po come Sivir, rimasta decisamente indietro","replies":[]},{"poster":"HaIIeIujah","date":"2017-05-30T04:37:13.338+0000","up_votes":1,"down_votes":0,"body":"Miss Fortune non ha assolutamente nessun problema. Quel che perde in danno contro i tank guadagna in impatto in teamfight.","replies":[]},{"poster":"Mh012","date":"2017-05-30T04:32:58.526+0000","up_votes":1,"down_votes":0,"body":"Jhin è forte, è solo un po' complicato.\nCiò che necessità Jhin è più il critico (influisce maggiormente nei aa, o meglio, nell'ultimo colpo).\nLa tecnica coinsiste nel scaricare i primi tre colpi sui minion e tenere l'ultima (la rossa) per andare in fight. Se ti trovi da subito in 1 vs 1, logicamente non spari ai minion ma direttamente sul camp nemico XD\nLa R se uno non esce in fretta dal range è una kill assicurata insieme a una W.\n\nStessa cosa per MF, se vai a gankarla e lei ti apre la ult in faccia.","replies":[]},{"poster":"xXM3liod4SXx","date":"2017-05-29T21:18:00.860+0000","up_votes":1,"down_votes":0,"body":"ezreal è forte. Piazzi il manamune o come si chiama, fulgore (non ricordo i nomi esatti XD) e i danni li fa fidati, i danni alti sono quando stacki a 1000 mana il manamune evolvendo la sua passiva, il 3% del tuo mana massimo come ad bonus sul colpo, so danni grossi grossi","replies":[]}]}