{"poster":"AveNuPorciu","date":"2017-10-19T12:27:59.194+0000","title":"\"ottimizzazione recapito\"","subforum":"Aiuto e supporto","up_votes":1,"down_votes":2,"body":"Come posso disabilitare permamentemente questa  applicazione? Mi consuma connessione dati e mi provoca sbalzi di ping , ed ogni volta devo chiudere manualmente questo processo..\r\nC&#039;&egrave; qualche modo per disattivarlo?\r\nHo provato a disattivare gli aggiornamenti microsoft, ma non &egrave; cambiato nulla","replies":[{"poster":"Chroniicles","date":"2017-10-19T15:51:06.314+0000","up_votes":1,"down_votes":0,"body":"E' esattamente come ha già detto 4rchon, ma se si avvia comunque (anche se disabilitato dal menù di Windows Update) scrivi _Servizi_ nella barra di Windows e disattivalo direttamente da lì","replies":[{"poster":"AveNuPorciu","date":"2017-10-20T11:57:44.790+0000","up_votes":1,"down_votes":0,"body":"Ma se lo disattivo , potrebbe danneggiare il pc?","replies":[{"poster":"Chroniicles","date":"2017-10-20T13:47:10.576+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=AveNuPorciu01,realm=EUW,application-id=98NGV4Al,discussion-id=7jvlPLEW,comment-id=00010000,timestamp=2017-10-20T11:57:44.790+0000)\n>\n> Ma se lo disattivo , potrebbe danneggiare il pc?\n\nAssolutamente no. In pratica cambia il modo in cui scarichi gli aggiornamenti, con l'opzione attiva li scarichi più velocemente anche dai pc nella tua rete locale o da altri in rete, ma allo stesso tempo li condividi... Puoi benissimo farlo col metodo classico (faccio lo stesso anche io, con l'adsl che ho è impensabile una cosa del genere)","replies":[]}]}]},{"poster":"4rchon","date":"2017-10-19T13:13:07.576+0000","up_votes":1,"down_votes":0,"body":"Non devi disattivare gli aggiornamenti di windows ma semplicemente deselezionare questo servizio nella stessa area delle impostazioni dove sei andato tu.\nSe il processo rimane comunque c'è qualcosa che non va con la tua macchina semplicemente, sia esso registro di sistema o attività pianificate al boot, magari lasciate in sospeso da shutdown e avvii andati male","replies":[]}]}