{"poster":"AveNuPorciu","date":"2018-05-15T15:38:04.270+0000","title":"Swain","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Solo io credo sia esageratamente forte? Cio&egrave; , anche se nei pochi momenti  in cui stai behind , fa i buchi lo stesso, oltre al fatto che ha cmq una laning phase non proprio brutta.\nps: per i fenomeni che credono che sia un post-sfogo dopo una partita , vi anticipo che non ho giocato contro alcun swain di recente , parlo solo perch&egrave; lo sto usando  e vedendolo in qualche stream.","replies":[{"poster":"pinkmanTS","date":"2018-05-16T16:45:17.281+0000","up_votes":1,"down_votes":0,"body":"Ha tutto tranne che una buona lane, solo chi non sa come giocarci contro o non sa come funziona può perdere un 1 v 1 in lane. La gente grida broken quando prima del rework aveva una lane e una pressure molto più forte. L'unica cosa forte di questo champ è la passiva che è utilizzabile solo in comp con cc. se hai contro un qualsiasi splitter devi sperare che il tuo team ti dia una mano visto che basi tutto sull ulti che non puoi spammare come prima.","replies":[]},{"poster":"Matteo00","date":"2018-05-15T15:50:01.184+0000","up_votes":1,"down_votes":0,"body":"Credo sia solo questione di chi hai contro. Quando lo incontro Top spesso lo distruggo, in Mid invece diventa un problema, ma ripeto credo sia solo questione del campione avversario (tralasciando la capacità del giocatore stesso). C'è non mi sembra così difficile da counterare.","replies":[{"poster":"Isaak001","date":"2018-05-15T16:05:44.312+0000","up_votes":1,"down_votes":0,"body":"ho usato swain per un breve periodo quando è uscito e dopo il \"nerf\" non sono pienamente d'accordo, contro swain è tutta una questione di come lo sai usare, è ovvio che essendo swain farà i suoi danni ma cmq sw non riesci a hittare manco una w o una e col cazzo che fai danno di r, che in tf è essenziale il danno da esplosione.\novvio ci sono anche molti altri fattori dietro che ti permettono di avere una laning phase da dio, però conta sempre che se nn sei buono non fai","replies":[{"poster":"Matteo00","date":"2018-05-15T20:58:01.184+0000","up_votes":1,"down_votes":0,"body":"è io questo dicevo","replies":[]}]}]},{"poster":"Garbaman","date":"2018-05-15T17:01:40.560+0000","up_votes":1,"down_votes":0,"body":"Swain ha un lategame molto forte, ma a mio pare ciò che lo rende molto forte è la suprema+zhonya.","replies":[]}]}