{"poster":"Charemizz","date":"2017-11-02T10:17:06.839+0000","title":"Udyr R ?","subforum":"Discussioni generali","up_votes":1,"down_votes":1,"body":"A cosa serve? per cosa la usate? curiosit&agrave; perch&egrave; lo sto giocando ma non la uso mai in tf, serve per pulire i campi? ma non &egrave; meglio la Q?","replies":[{"poster":"vondarck","date":"2017-11-02T12:14:07.913+0000","up_votes":2,"down_votes":0,"body":"La R di udyr risale ad un vecchio concetto di gioco\n\nQuando nacque il champ aveva danni base alti e di natura ibrida (tanto per intenderci come shyvana)\nI suoi core erano la gemma verde/divoratore, la speranza perduta, trinity e cuore ghiacciato\n\nAnche senza buildare AP era un buon danno e si basava su un AS molto alto (quindi tanti prock di R) e tanti danni magici on hit\nCon l'eliminazione del devoruer e con la perdita di mordente del cuore ghiacciato e speranza perduta la build ha perso do senso\n\nDalla 7.8 la Q è stata reworkata per avere effetto ogni 3 colpi invece che avere un \"mega dot\" da cuo poi swuitchavi in R per massimizzare il danno base (la build era conosciuta come QxxR)\nQuindi le meccaniche Dei 3 colpi di Q sono relativamente recenti, prima la miglior forma di danno continuativo te la dava la R (a meno che non buildavi full ad)\n\nPer dovere di cronaca ti dico che esistw una build di udyr completamente full AP che sono trik2g si ostina ad utilizzare, parte con l'eco runico e il sigillo oscuro\nDa qui in avavti posso farti un papiro sui pro e i contro di questa build che come core builda ZZ PORTAL perché in team fight non serve quasi a nulla\n\nPuò essere che con la.nuova season si riveda qualcosa sotto forma di QxxR con il ramo dominazione/tank per fare una map pressure opprimente e aggiudicarsi gli obbiettivi (stile 6.3)","replies":[]},{"poster":"BluCobalto92","date":"2017-11-02T11:31:55.569+0000","up_votes":2,"down_votes":1,"body":"Mai usata la ulti... Maxo sempre la Q.. Per i campi faccio Q e W\n\nEdit.... Mi correggo... Usata la settimana scorsa per la missione usa 50 volte la ulti... Fatta in una partita xD","replies":[]},{"poster":"Charemizz","date":"2017-11-02T14:33:21.157+0000","up_votes":1,"down_votes":0,"body":"Grazie a tutti","replies":[]},{"poster":"NOLIMIT Vladimir","date":"2017-11-02T13:36:51.882+0000","up_votes":1,"down_votes":0,"body":"Io quelle poche volte che lo uso la R la maxo per prima perché è la skill con danni base più alti","replies":[]}]}