{"poster":"TrashDonnut","date":"2016-03-04T05:33:32.158+0000","title":"Aurelion Sol","subforum":"Miscellaneous","up_votes":2,"down_votes":1,"body":"So technically he's the strongest champ lore-wise.\nhttp://i.imgur.com/UH9NC1E.png\n","replies":[{"poster":"lordofrage","date":"2016-03-04T06:22:52.986+0000","up_votes":2,"down_votes":0,"body":"he has not face jax yet so hes not","replies":[{"poster":"Talon12","date":"2016-03-04T10:06:52.546+0000","up_votes":2,"down_votes":0,"body":"how true that is.","replies":[]},{"poster":"TrashDonnut","date":"2016-03-04T08:52:04.334+0000","up_votes":2,"down_votes":0,"body":"ayy lmao","replies":[]}]},{"poster":"lordofrage","date":"2016-03-05T08:50:41.973+0000","up_votes":1,"down_votes":0,"body":"jax is still the strongest person in the league he has beaten every single champ  with  a lamp XD","replies":[{"poster":"Lord Sesshomaru","date":"2016-03-05T09:31:43.357+0000","up_votes":1,"down_votes":0,"body":"Jax was only undefeated until 21/2/2009 (and even then, it never says he fought every champion), after that we have no records, (he could have been beaten in every fight since then, we don't know) \n\nbut all that is irrelevant because Riot announced that the sunnoners and the institute of war are no longer canon, which means that Jax's lore isn't canon either, so technically Jax doesn't have a lore. He could be a lamp post thief for all we know.","replies":[{"poster":"lordofrage","date":"2016-03-05T09:32:50.727+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lord Sesshomaru,realm=OCE,application-id=Ntey9fRZ,discussion-id=V3Hrxuuk,comment-id=00030000,timestamp=2016-03-05T09:31:43.357+0000)\n>\n> Jax was only undefeated until 21/2/2009 (and even then, it never says he fought every champion), after that we have no records, (he could have been beaten in every fight since then, we don't know) \n> \n> but all that is irrelevant because Riot announced that the sunnoners and the institute of war are no longer canon, which means that Jax's lore isn't canon either, so technically Jax doesn't have a lore. He could be a lamp post theif for all we know.\n\n{{sticker:zombie-brand-clap}}","replies":[{"poster":"Lord Sesshomaru","date":"2016-03-05T22:05:41.489+0000","up_votes":1,"down_votes":0,"body":"Cant argue with the truth I'm afraid.\n\n{{sticker:zombie-brand-facepalm}}","replies":[]}]}]}]},{"poster":"Anserem","date":"2016-03-05T00:59:50.906+0000","up_votes":1,"down_votes":0,"body":"A celestial dragon that forges stars with his hand will probably have a an ability that deals 50 damage or something.","replies":[]},{"poster":"Lord Sesshomaru","date":"2016-03-04T10:02:37.999+0000","up_votes":1,"down_votes":0,"body":"We don't know enough yet to make any conclusions, just the assumptions of one teaser are not much to go by.\nplus we don't know the limits of other champs power e.g:\n\nBard: Is a celestial, He is peaceful, but we have no idea what the extents of his power are.\n\nAzir/Xerath/Nasus/Renekton: Are demi-gods and are immortal, the limits of their power are also unknown, (Xerath wiped out one of the greatest civilisations on the planet just by being born) And all 4 of those champs' power is vastly under-represented in game.\n\nLeona/Diana/Pantheon: These champs are also celestials now, and likely are kin to Aurelion Sol. (if we assume that he is another mount targon spirit, (but again that is another assumption))We don't know the extent of their power either.\n\nZilean: Is immortal and has some control over time itself.\n\nKindred: Is death itself.\n\nAurelion Sol looks powerful from what we see in the teaser, but we have no ideas of scale (he could be 5 inches tall for all we know) or any limits placed on his power (its unlikely riot would release a champ who in lore could create full blown stars at will, without having some limiting factor, otherwise it would put holes all through the lore like \"how come i cant just make a sun and blow everyone up?\")\n\nHow i see it is that the most powerful lore wise champ is likely to be Either Bard or Kindred (probably also Aurelion Sol depending on what facts riot later releases, but we cant say yet.) with Azir and Xerath following behind.","replies":[{"poster":"Talon12","date":"2016-03-04T10:06:31.689+0000","up_votes":1,"down_votes":0,"body":"The institute \"suppresses\" all champions powers to be of a near equal value. urgot could actually be the most stronkest thing ever, but he was suppressed into uselessness, who knows.","replies":[{"poster":"Lord Sesshomaru","date":"2016-03-04T10:37:06.036+0000","up_votes":1,"down_votes":0,"body":"1. That would mean the Summoners are the most powerful characters lore wise, which would make fiddlesticks the most powerful champion as he is (or was) a summoner. (next would come lee sin)\n\n2. if that was the case, once the battle on the rift is over and the champions are released back into the wild, their powers would return, which still puts holes in the lore as an inte-rdimentional sun creating god dragon made up of galaxies, with no regard for the planet (if we are to base our assumptions from the teaser) might pose a little bit of a problem.\n\n3. i was under the assumption that riot announced that summoners and the institute of war are no longer canon.\n\n4. You can tell just from Urgot's lore that regardless of any suppression that may or may not take place, he still isn't as powerful as the aforementioned champions.","replies":[{"poster":"Talon12","date":"2016-03-04T23:56:40.051+0000","up_votes":1,"down_votes":2,"body":"A) it was example\n\nB) it was obviously an example\n\nC) It was an example used to make a point\n\nD) it was an example, so dont be a turd over it","replies":[]}]}]}]}]}