{"poster":"Dwarfheader","date":"2016-07-04T10:58:28.187+0000","title":"50 Regeln um ein League of Legends Spiel zu gewinnen!","subforum":"Spielerverhalten & Moderation","up_votes":19,"down_votes":3,"body":"Die folgenden &quot;Regeln&quot; sollen als witzige Beispiele f&uuml;r oft vorkommendes Spielverhalten dienen. Ganz wichtig: Bis auf Punkt 100. sind alle &quot;Regeln&quot; IRONISCH zu verstehen! Lachen ist gesund! Ich will damit wirklich niemandem auf die F&uuml;&szlig;e treten und ja: Junglemain ;-)\n\nUpdate 1: Ich habe die meisten Vorschläge eingearbeitet. Ich hoffe es gefällt euch! Noch zwanzig Plätze sind zu vergeben, für die 100 epischsten Regeln! Immer raus damit!\n\nUpdate 2: Wir haben es geschafft! Die \"Hundert epischsten Regeln ein League of Legends Spiel zu gewinnen\" sind vollendet! Vielen Dank an alle die diesen Thread gelesen, dazu beigetragen und natürlich reichlich gelacht haben! Zeigt es doch mal euren Freunden :-) Hoffentlich auf bald und noch fröhliches Zocken!\n{{sticker:slayer-jinx-catface}} \n\n**100  Regeln um ein League of Legends Spiel zu gewinnen\n**\n\n\n1. Kills gehen &uuml;ber alles!\n2. Turrets sind Deko und k&ouml;nnen ignoriert werden!\n3. Nicht ein zerst&ouml;rter Nexus gewinnt das Spiel, sondern der Spieler mit den meisten Kills!\n4. Wenn man stirbt, ist entweder der Jungler schuld oder der Support und das muss man ihm auch 10 Minuten lang schildern!\n5. Der Jungler ist immer schuld!\n6. Der Jungler gibt niemals einen Buff &bdquo;weiter&ldquo;!\n7. Kauft niemals Wards! Man k&ouml;nnte den Gegner sehen und dann ist die ganze &Uuml;berraschung futsch!\n8. Pinks sind was f&uuml;r Anf&auml;nger vor allem gegen Shaco, Eve, Teemo, Rengar und Co. v&ouml;llig &uuml;berfl&uuml;ssig, niemals kaufen! Ihr sp&uuml;rt schon eine Minute vorher wo sie sind!\n9. W&auml;hlt in der Campion Select immer den OP Champ, der nicht gebannt wurde! WARUM? ER IST OP!\n10. Wenn Shen {{champion:98}}  im Spiel ist und kommt nicht zu euch, wenn ihr 30 km im feindlich Feld ohne Backup steht, flamed ihn zu! Er wird es sich merken und das n&auml;chste Mal sicher kommen (und mit euch sterben)!\n11. Wenn das Early Game gut l&auml;uft, habt ihr immer noch Zeit dem Gegner Kills zu geben, damit es spannender wird!\n12. Wenn ihr eure Lane verrei&szlig;t, ist das Spiel verloren! Halten verboten! ES BRINGT NICHTS! Dem Jungler und dem Team M&ouml;glichkeiten zu bieten, macht generell nur wenig Sinn! Das sind eh alles Noobs!\n13. Wenn ihr ohne Vision im gegnerischen Jungle sterbt, war es das Team oder noch besser der Support, wenn es doch mal nicht der Jungler war! \n14. Wenn du 1 v 5 in den Fight gehst und stirbst, ist das Team schuld, weil sie dir nicht gefolgt sind! Lass sie es wissen! Vielleicht stirbst du das n&auml;chste Mal nicht allein, denn du bist schlie&szlig;lich der (Bronze) -Pro!\n15. Ausdrucksstarke W&ouml;rter werden von allen Mitspielern sehr gesch&auml;tzt, also immer raus damit! Das ist besonders bei Fehlern sehr effektiv!\n16. Grunds&auml;tzlich gilt: Wer flamed gewinnt! Gesteigert werden diese Chancen nur von den Leuten, die darauf eingehen! Das ist sehr f&ouml;rderlich, weil es das Gegnerteam verunsichert, wenn sie st&auml;ndig den All-Chat mit Reportvorschl&auml;gen lesen m&uuml;ssen!\n17. Nutzt immer den All-Chat, dann haben alle was von euren guten Ratschl&auml;gen, auch das Gegnerteam m&ouml;chte an eurer Weisheit teilhaben!\n18. Liebe Supports! Haltet euch nicht zur&uuml;ck, wenn ihr den Kill irgendwie bekommen k&ouml;nnt! ULTIMATE wenn n&ouml;tig! Gleiches Recht f&uuml;r alle! (I love my ADC &lt;3)\n19. Diven ist immer eine gute Idee. Nennt mir EINEN Grund dagegen!\n20. Klaut dem Jungler immer die Buffs, auch wenn ihr 0/7/3 auf der Midlane spielt! Ihr rockt, und jetzt k&ouml;nnte ihr es zeigen! Faker hat bei euch gelernt!\n21. Jungler brauchen keine Buffs, nicht mal die XP sind f&uuml;r sie wichtig.\n22. Schie&szlig;t euch nicht auf wenige Champions ein! Ihr k&ouml;nntet sie wom&ouml;glich am Ende noch beherrschen!\n23. Ihr habt immer Recht! Widerworte oder andere Vorschl&auml;ge eurer Mitspieler klingen bei eurem Skilllevel lediglich wie der verzweifelte Schrei der Noobs nach Elo.\n24. Es ist v&ouml;llig egal welche Position eure Teammates spielen m&ouml;chten! Ihr pickt immer was ihr wollt! So beweist ihr nicht nur eure Dominanz, sondern gewinnt auch noch einen Haufen Zeit! Die anderen h&auml;tte sich eh nur sinnfreie Gedanken um ihre Mainrollen und Counterpicks gemacht!\n25. Ihr seid gestorben? Am besten ihr schreibt gleich GG, allein schon wegen der Motivationskurve!\n26. Wer flashed gewinnt und wer Flashes timed ist raus! (Kopfrechnen ist eh &uuml;berbewertet!)\n27. Baron und Dragon werden selbst von den Pros v&ouml;llig &uuml;berbewertet! Das Einzige was z&auml;hlt sind Kills, egal wie viele und egal zu welchem Preis!\n28. Niemand braucht die Krabbe im Fluss, sie ist Deko!\n29. Der Jungler braucht die Krabbe im Fluss nicht wirklich, das bisschen Gold taxed er sowieso f&uuml;nfmal von euch wieder rein!\n30. Blo&szlig; nicht loben! Allein wegen der Motivationskurve! &bdquo;GJ&ldquo; - VERBOTEN!\n31. Merke: Bei erfolgreichen Ganks, muss man seine Lane nicht pushen! Der Jungler will euch nicht helfen! Alles Taxeronies! Au&szlig;erdem bleibt das Spiel spannender, wenn der Gegner keinen Farm unterm Tower verliert! Respekt!\n32. Fehlt euer Gegner auf der Lane? Sagts blo&szlig; keinem weiter, das verdirbt die ganze &Uuml;berraschung!\n33. Sololaner stellen keine Wards! Das macht der Support! Auch auf der Toplane!\n34. Bard Spieler sollte man grunds&auml;tzlich f&uuml;r ihre Ultis flamen! Sie treffen nie und das mit ABSICHT!\n35. Sind alle Gegner verschwunden, ist das eine gute Sache! Baron Nashor f&uuml;hlt sich dann nicht mehr so einsam! Blo&szlig; nicht st&ouml;ren!\n36. Wann immer ihr in Bedr&auml;ngnis geratet, denkt daran: DEMACIA! R&uuml;ckzug ist keine Option f&uuml;r einen wahren Streiter der Gerechtigkeit!\n37. Einen Zweikampf gewinnt man in der Regel erst, wenn man ihn zuvor schon neun Mal verloren hat! You know what they say: &bdquo;The tenth time is the charm!&ldquo;\n38. Fokus ist &uuml;berbewertet! Au&szlig;erdem, wo bleibt der Spa&szlig;, wenn der ADC gleich am Anfang stirbt?\n39. Euer ADC kommt allein klar! Alle ge&auml;u&szlig;erten W&uuml;nsche einer Verteidigung oder Unterst&uuml;tzung, k&ouml;nnt ihr ignorieren! Ihr macht sowieso mehr Schaden!\n40. Es ist wichtig eurem Jungler mitzuteilen, wie oft der gegnerische Jungler schon auf eurer Lane war! Meistens sind sie befreundet und k&ouml;nnen sich so &ouml;fter treffen!\n41. Der Jungler hat nie einen Spielplan! Was er tut ist zuf&auml;llig!\n42. Ihr verdient die volle Aufmerksamkeit eures Junglers!\n43. Der Support muss in jedem Fall f&uuml;r und mit euch sterben!\n44. Spiel Nasus und ihr habt gewonnen! Er ist OP! Wichtig: Niemals die Lane unter 500 CS verlassen! (von Abasin)\n45. Wer andere als Kayle ultet {{champion:10}} , ist selber schuld! Zeigt eurem Teammate ruhig, dass ihr keine Fehler toleriert! (von Konilan)\n46. Threshs Laterne {{champion:412}}  wird überbewertet, mit der richtigen Grafikkarte sieht man auch ohne gut genug! (von Sona Buvellé)\n47. Du bist verwundet? Kein Problem! Schon Konfuzius sagt: „Wer den Minion nicht ehrt, ist des Sterbens nicht wert!“ (von Sona Buvellé)\n48. League of Legends ist kein Teamspiel, das war ein Druckfehler! Heißen müsste es: 1v9 Battle Royal! Nur mit diesem Wissen könnt ihr gewinnen! (von Sona Buvellé)\n49. Bards einzige Aufgabe ist es \"Glöckchen\" zu sammeln! {{champion:432}}  Wie soll er denn sonst Schaden machen? (von MilliDieFrau)\n50. Als Support immer schön auf die Minions des ADCs draufholzen, so kann er leichter farmen! (von MilliDieFrau)\n51. Lulus Ulti {{champion:117}}  ist auf ihr immer besser aufgehoben, als auf dem gerade sterbenden ADC! Selber schuld, dafür bin ich jetzt groß und blinke!\n52. Das rote Trinket als auch der Sightstone sind komplett überbewertet! Man bekommt schon Wards am Anfang!\n53. \"All Mid\" ist ab Minute 15 Pflicht!\n54. Merke: Als Support immer Full AP! Wer keinen Schaden macht kann auch zu Hause bleiben! (von xR3DFoxx)\n55. Niemand braucht Items mit Effekten! Niemals kaufen diesen Ramsch! (von xR3DFoxx)\n56. Wer den meisten Schaden macht, dem gehört der Kill! Niemals für lau arbeiten, sonst skaliert ihr nicht! (von MilliDieFrau)\n57. Steht als ADC möglichst immer in der Mitte der kompletten Gegnerteams! Nur wer alle treffen kann, macht auch Schaden! (von Nohgolgh)\n58. Ein Support ohne Lasthits ist wie ADC ohne Verständnis! (von Nohgolgh)\n59. Flamen hilft immer! Vor allem als Midlaner! Bewegen verboten! (von Nohgolgh)\n60. TP ausschließlich für den Backport auf die eigenen Lane verwenden! (von Nohgolgh)\n61. Wer im Teamfight hilft, verhindert den Heldentod der Mitspieler! (von Nohgolgh)\n62. Liebe Jungler! Der Zeitpunkt eurer Ganks ist immer perfekt! Wenn er nicht gelingt, liegt das ausschließlich am Laner! Lasst diesen das in jedem Fall wissen! Kraftausdrücke bevorzugt! (von Nohgolgh)\n63. Baron ist immer Worth, egal ob alle dabei sterben! (von Nohgolgh)\n64. Büsche immer facechecken! Wer kneift verliert! (von Nohgolgh)\n65. Wichtig! Die Aufstellung im Teamfight: Squishies vorne! Tanks hinten! Der Support im Jungle!  (von Nohgolgh)\n66. Als AP Champ gilt grundsätzlich: Deathcap erstes Item! Niemand braucht das erst im Lategame! (von Nohgolgh)\n67. Pushen ist immer sinnvoll! Erstens, sieht man dann den gegnerischen Jungler öfter und zweitens kann man den eigenen mehr zuflamen! Allein schon wegen der Motivationskurve! (von Nohgolgh)\n68. Nach gewonnen Teamfights gilt: Backport oder Elohell! Niemand braucht Tower oder Drachen, ihr seid ohnehin OP! (von Nohgolgh)\n69. Niemals einen Busch mit Ez und Taric checken! \n70. Volle Taschen steigern den Spaßfaktor ins Unermessliche! No Risk no Fun! Items sind für Noobs und deine Oma! (von Nohgolgh)\n71. ADCs voran! Immer rein in die Duelle! Jax und Fiora sind im Lategame die größten Nullen! (von Nohgolgh)\n72. Kein echter Jungler benutzt Smite! Das reinste Noobtool, übrig aus dem Tutorial! (von Nohgolgh)\n73. Bannt immer die Champions, die eure Teammates spielen wollen! Das hebt die Stimmung ungemein und vielleicht bannen sie dann sogar euren Main! Bedenkt die Lernkurve neuer Champs im Rankedgame! (von Nohgolgh)\n74. Lategamechampions heißen so, weil sie im Lategame nutzlos sind! Zieht das Spiel gegen sie stets in die Länge! Gute Beispiele: Vayne, Azir, Orianna, Kog´Maw und Twitch! {{champion:67}} ,{{champion:268}} ,{{champion:61}} , {{champion:96}} ,{{champion:29}}  (von Nohgolgh)\n75. Du spielst Tank? Immer 1v5 initiieren! (von oNoise)\n76. Du spielst Adc? Immer 1v5 initiieren! (von oNoise)\n77. Du spielst League of Legends? Immer 1v5 initiieren! (von oNoise)\n78. Das kleine Rote Ausrufzeichen über deinem Kopf bedeutet, dass dein Charakter erschöpft ist und du einige Sekunden stehen bleiben solltest! (von oNoise)\n79. Die Roten Fadenkreuze über den Köpfen der Gegner bedeuten, dass sie temporär stärker sind und deswegen TUNLICHTS zu meiden! (von oNoise)\n80. Die blaue Flagge auf der Map bedeutet, dass ein Aliierter ein Areal unter seine Kontrolle gebracht hat und gut klar kommt! Trotzdem checken? Verboten! (von oNoise)\n81. Das Fragezeichen auf der Map bedeutet, dass alle Gegner sichtbar und auf ihren Lanes sind! Eventuell ist der jeweilige Spieler aber auch einfach nur vergesslich! (von oNoise)\n82. Die Ausrufezeichen auf der Map, sowohl gelb als auch rot, bedeuten, dass alle Angriffskraft darauf konzentriert werden sollte! (von oNoise)\n83. Beim Spielen mit Lee Sin gilt grundsätzlich: Wer eine Q trifft, springt auch! Der Typ ist schließlich blind! (von oNoise)\n84. Egal was auf dich zufliegt: Du kannst es IMMER flashen! Timing ist alles! (von oNoise)\n85. Toplaner spielen in Verbannung! Wer TP mitnimmt wird auf Ausbruchsversuch angeklagt! (von oNoise)\n86. Singed´ lila Wolken machen dich schneller! Also immer fleißig hinterher! (von oNoise)\n87. Jungler haben die Fähigkeit, sich in drei Teile zu spalten und somit auf allen Lanes gleichzeitig zu ganken! Ihr müsst nur laut genug schreien, dann kommen sie auch! (von Kathashî)\n88. Du musst in 20 minuten zu einemwichtigen Termin? Zeit für ein Ranked! (von oNoise)\n89. Du bist 14 und deine Mutti macht gerade Essen? Zeit für ein Ranked! (von oNoise)\n90. Du hast grad 5 Normals am Stück verloren und willst mal so richtig deinen Frust rauslassen? Zeit für ein Ranked! (von oNoise)\n91. Du hast dir grad Draven gekauft und gehört, dass der super-easy ist? Zeit für ein Ranked! (von oNoise)\n92. Hat euer Champion einen Gapcloser? Immer in den Gegner rein! Demacia! (von oNoise)\n93. Spielt niemals Support! Schlecht f&uuml;r die Nerven!\n94. Spielt niemals Jungler! Ohnehin &uuml;berbewertet!\n95. Spielt niemals ADC! Niemand k&uuml;mmert sich um euch und Schuld ist immer der Support!\n96. Spielt niemals Toplane! Zu einsam.\n97. Spielt niemals Midlane! Schon Bismark war gegen einen Zweifrontenkrieg!\n98. Spielt niemals Champions mit einfachen Mechaniken! Nur Noobs machen das!\n99. Captain Teemo  on duty! {{champion:17}} Spielt ihn! Euer Team wird euch lieben!\n\n100. Habt Spa&szlig;! Als Team! Zusammen!\n\n{{sticker:zombie-brand-mindblown}}","replies":[{"poster":"Dwarfheader","date":"2016-07-05T13:58:06.634+0000","up_votes":5,"down_votes":0,"body":"@Konlilan, Sona Buvellé, Maijima, Abasin, MilliDieFrau,xR3DFoxx, Nohgolgh, Kathashî!\n\nVielen Dank für eure vielen Vorschläge! Ich will gar keinen besonders herausgreifen, ich finde sie alle gut. Das Championbezoge ist auch super, gibt gleich viel mehr Möglichkeiten :-)\nWenn ihr nichts dagegen habt, werde ich das bisherige übernehmen, manches davon vielleicht noch ein klein wenig verändern, damit es eine Pointe hat.\n {{sticker:slayer-jinx-wink}} \nDie Hundert schaffen wir! Update in Kürze!","replies":[{"poster":"Maijima","date":"2016-07-06T15:17:23.103+0000","up_votes":3,"down_votes":0,"body":"War **Schule** ein vorschlag? wow... <3","replies":[{"poster":"Dwarfheader","date":"2016-07-06T16:39:48.353+0000","up_votes":1,"down_votes":0,"body":"League in der Schule? Warum nicht! Sinnfreie Sachen hab ich dort zumindest zur Genüge gelernt ;-) wäre mal ne Abwechslung würde ich sagen <3{{champion:103}}","replies":[]}]}]},{"poster":"Abasin","date":"2016-07-04T11:28:20.648+0000","up_votes":2,"down_votes":0,"body":"> Wenn Sheen im Spiel ist und kommt nicht zu euch, wenn ihr 30 km im feindlich Feld ohne Backup steht, flamed ihn zu! Er wird es sich merken und das nächste Mal sicher kommen (und mit euch sterben)!\n\nMeinst Du Charlie Sheen? Oder doch eher Shen?\n\nAnsonsten recht witzig. Ist mal ne Abwechslung zu den ganzen QQ-Threads, die hier so landen. {{sticker:slayer-pantheon-thumbs}} \n\nAch ja, ich ergänze noch:\n51. Nasus sollte mindestens 500 CS haben bevor er die Lane verlässt.","replies":[{"poster":"Dwarfheader","date":"2016-07-04T11:47:50.527+0000","up_votes":1,"down_votes":0,"body":"Danke dir! Werde das ändern :-)\nFind auch deine 51. super. Vielleicht haben ja noch andere solche Ideen, würde das dann sammeln. Die hundert können wir zusammen sicher locker knacken!\n{{sticker:slayer-pantheon-rainbows}}","replies":[{"poster":"MilliDieFrau","date":"2016-07-04T13:32:13.080+0000","up_votes":3,"down_votes":0,"body":"Vielleicht...\nAls Support IMMER den Farm für den ADC anhitten. \nAls Bard ist es deine einzige Aufgabe, Glöckchen zu sammeln.\nLulus Ult ist auf ihr natürlich viel besser aufgehoben als auf dem grade sterbenden ADC.\nDas rote Trinket sowie der Sightstone sind komplett überbewertet. Man kriegt doch Wards am Anfang!\nAb der 15ten Minute ist \"All Mid\" PFLICHT.","replies":[{"poster":"Tamamo no mae","date":"2016-07-05T06:54:32.674+0000","up_votes":3,"down_votes":0,"body":"Nicht zu vergessen als sup immer full AP. Man könnte dem adc mit den Effekten der items ja sonst helfen und man braucht die kills ja mehr.","replies":[{"poster":"Nohgolgh","date":"2016-07-05T09:41:03.138+0000","up_votes":2,"down_votes":0,"body":"Der adc sollte immer mitten im gegnerischen Team stehen. Sonst kann der ja nicht alle angreifen. \n\nEin Support braucht keinen Sightstone. Warden ist was für Waschlappen. \n\nEs ist ein Mythos, dass der Support den Farm nicht nehmen soll, wenn der Carry auf der Lane ist. Wie soll man denn sonst an Geld kommen?\n\nDer Midlaner sollte auf GAR KEINEN FALL seine Lane verlassen, um anderen Lanes oder dem Jungler bei Objectives zu helfen. Wenn die ihre Lane/den Drachen/Baron verlieren und dauernd eingepusht werden, ist Flamen sowieso viel hilfreicher. \n\nDer Toplaner benutzt seinen Teleport ausschließlich, um auf die Lane zu kommen. Wofür auch sonst?\n\nDer Jungler sollte den Lanern auch nach einem erfolglosen Gank den Farm abnehmen. Nichts freut einen Laner mehr als eine eingepushte Lane gegen den Counter sowie die Spannung eines potentiellen gegnerischen Ganks. \n\nDer perfekte Zeitpunkt für einen Gank ist dann, wenn der eigene Laner gerade nicht auf der Lane ist oder kein Mana hat. Wenn der Gank dann schiefläuft, sollte der Laner unbedingt wegen mangelnder Unterstützung zugeflamt werden. \n\nWenn man den Baron bekommen hat und dannach alle 5 Mitgleider des Teams vom gegnerischen Team abgeholt werden, war das absolut worth. \n\nMan sollte immer Büsche facechecken, insbesondere, wenn man auf der Minimap keine Gegner sieht. Wie soll man sonst herausfinden wo der Gegner steckt?\n\nDen Engage sollte immer das zerbrechlichste Mitglied des Teams machen, dass optimalerweise auch noch am wenigsten CC hat. Tanks sollten hingegen grundsätzlich hinten stehen. \n\nAp-Champions sollten unbedingt Rabadons Todeshaube als ersten Gegenstand bauen-oder gar nicht. Das Ding ist ausschließlich im Early kosteneffizient. \n\nEs ist immer sinnvoll zu pushen. Wenn man in Minute drei dann an einem Gank stirbt, dann beschwert man sich beim Jungler, dass der noch icht da war. \n\nWenn man nach einem Kill oder gewonnenen Teamfight einen Turm oder Drachen nehmen könnte, sollte man stattdessen lieber backporten. \n\nEs ist grundsätzlich sinnvoll, mit 4000 Gold in der Tasche rumzulaufen. Gegenstände sind nur was für Noobs. \n\n1v1-Kämpfe gegen Jax und Fiora im Late sind eine super Idee. Jeder Champ kann diese im Duell schlagen. \n\nEin Jungler braucht kein Smite. Das ist doch nur was für Anfänger. \n\nIn der Champselect sollte man grundsätzlich einen Champ bannen, den ein Teammate spielen will. Das hebt die Laune ungemein und vielleicht bedankt sich dein Freund, indem er deinen Champ bannt. \n\nGegen Vayne, Azir, Orianna, Kog'Maw und Twitch empfiehlt es sich, das Spiel in die Länge zu ziehen. Diese Champions verursachen überhaupt keinen Schaden im Lategame.","replies":[{"poster":"Dwarfheader","date":"2016-07-05T14:35:04.056+0000","up_votes":1,"down_votes":0,"body":"@Nohgolgh, deinen Punkt zwei gibt es leider schon :-) und ich hab einiges verändert, vergib mir bitte meine künstlerische Freiheit :-D","replies":[]}]},{"poster":"MilliDieFrau","date":"2016-07-05T09:17:24.567+0000","up_votes":2,"down_votes":0,"body":"Wie soll ich denn als Supp meinem ADC die Kills securen, wenn ich den Gegner gar nicht runterpoken kann? \nUnd dann ist es ja eigentlich mein Kill, den der ADC dann klaut. \nIch brauch das Gold doch viel dringender, ein Supp ohne Gold ist doch nutzlos.","replies":[]}]}]},{"poster":"Katashî","date":"2016-07-04T20:19:05.766+0000","up_votes":3,"down_votes":0,"body":"Als Jungler main: Jungler haben die Fähigkeit in drei Teile zu spalten und somit auf allen Lanes gleichzeitig ganken! Ihr wollt einen gank? Pusht die Lane! Ohne einen Towerdive wäre es ja zu schwer den Gegner zu töten!","replies":[]}]}]},{"poster":"Shiro equals","date":"2016-07-04T13:36:00.787+0000","up_votes":3,"down_votes":0,"body":"Threshs Laterne wird überwertet, er will eh nur damit trollen.\nLow Life Backport? Ich könnte Farm und damit Gold verlieren!\nLoL ist kein Teamspiel, es ist ein 1v9.","replies":[{"poster":"Maijima","date":"2016-07-04T21:17:04.705+0000","up_votes":2,"down_votes":0,"body":"50 Regeln um ein League of Legends Spiel zu gewinnen... Ist ja wie in der Schule oder fast :3","replies":[{"poster":"Dwarfheader","date":"2016-07-05T14:09:48.385+0000","up_votes":1,"down_votes":0,"body":"Meinst du damit, dass der Titel ungünstig ist? Sollte ich es liebe Tipps statt \"Regeln\" nennen oder so? Oder vielleicht noch ganz was anderes?\n{{sticker:zombie-brand-mindblown}}","replies":[]}]}]},{"poster":"Tamamo no mae","date":"2016-07-07T10:33:34.383+0000","up_votes":2,"down_votes":0,"body":"Als sup ignite mitnehmen exhaust ist langweilig, ausserdem bekommt man mehr kills mit ignite.\nZilean im gegnerteam? Immer schön die Uhren nehmen und zu deinem Team bringen am besten zu den lowlives.\nAls blitzcrank immer den full life Gegner adc zu deinem fast toten adc ziehen, nachdem dir dein adc den Farm stealt kannst du ihn auch mal damit ärgern.","replies":[]},{"poster":"oNoise","date":"2016-07-05T19:42:16.599+0000","up_votes":2,"down_votes":0,"body":"Du musst in 20 minuten zu nem wichtigen Termin? Zeit für ein Ranked!\nDeine Mutti macht grad essen? Zeit für ein Ranked!\nDu hast grad 5 Normals am Stück verloren und willst mal so richtig deinen Frust rauslassen? Zeit für ein Ranked!\nDu hast dir grad Draven gekauft und gehört, dass der super-easy ist? Zeit für ein Ranked!\n\nWenn dein Champion einen Gapcloser hat auf jeden Fall damit immer in den Gegner rein! Niemals aufheben um wieder rauszukommen! (Vorallem bei Squishy Leuten wie Ezreal{{champion:81}})\n\nDu spielst Tank? Immer 1v5 initiieren!\nDu spielst Adc? Immer 1v5 initiieren!\nDu spielst League of Legends? Immer 1v5 initiieren!\n\nDas kleine Rote Ausrufzeichen über deinem Kopf bedeutet, dass dein Charakter erschöpft ist und du einige Sekunden stehen bleiben solltest.\nDie Roten Fadenkreuze über den Köpfen der Gegner bedeuten, dass sie temporär stärker sind und deswegen TUNLICHTS zu meiden!\nDie Blaue Flagge auf der Map bedeutet, dass ein Aliierter ein Areal unter seine Kontrolle gebracht hat und gut klar kommt.\nDas Fragezeichen auf der Map bedeutet, dass alle Gegner sichtbar und auf ihren Lanes sind.\nDie Ausrufezeichen auf der Map, sowohl gelb als auch rot, bedeuten, dass alle Angriffskraft darauf konzentriert werden sollte!\n\nWer mit Lee Sin{{champion:64}} seine Q trifft und nicht SOFORT hinterherspringt is ne pussy.\nWer innerhalb einer aliierten Jarvans{{champion:59}} Ultimate stirbt ist selber Schuld.\nEgal was auf dich zufliegt: DU KANNST ES FLASHEN (Besonders Karthus{{champion:30}} ult, Caitlyn{{champion:51}} ult, Veigar{{champion:45}} ult, Vi{{champion:254}} ult und Autoattacks)\n\nDu spielst Toplane? Nimm ja kein TP mit. Die andern denken sonst, du wärst Teil des Teams.\n\nAchja und Regel nummer 1 sollte sein: Singed is squishy also ihm immer folgen, weil die lila Wolken machen dich schneller.","replies":[{"poster":"Dwarfheader","date":"2016-07-06T16:58:04.266+0000","up_votes":2,"down_votes":0,"body":"Hiho, vielen Dank die vielen guten Vorschläge, hab fast alles übernommen!\n{{sticker:slayer-pantheon-thumbs}}","replies":[]}]},{"poster":"Konilan","date":"2016-07-05T07:51:42.414+0000","up_votes":2,"down_votes":0,"body":"Wie wäre es mit Champignonspezifische Regeln:\n\nAls Kalye AUSNAHMSLOS sich selber ulten.","replies":[]},{"poster":"IMBA99","date":"2016-07-23T01:52:28.034+0000","up_votes":1,"down_votes":0,"body":"Geile Tipps. Mir fallen noch diese ein.\n\n1. Du hast Dir einen Guide für einen Champion angesehen. Du kannst ihn jetzt. Ab ins Ranked, um es deinen verständnislosen Teammates vorzuführen.\n2. Sag deinem Team am Anfang, dass sie nicht feeden sollen. Betone wie hart Du carryen wirst, sie wissen dann wer der Babo ist. Du bist nämlich besser als sie, obwohl ihr in der gleichen Elo seid.","replies":[]}]}