{"poster":"Send Núdes","date":"2017-05-27T04:07:01.484+0000","title":"La vida y la muerte. ¿Que es la vida y que hay después de la muerte?","subforum":"Off-topic y temas personales","up_votes":8,"down_votes":1,"body":"REPOSTEO ESTO. PARA QUE NO ME ROMPAN LAS ***** &lt;3 gracias.\r\nHolis de nuevo. Este es el ultimo post hasta el lunes de filosof&iacute;a)? (Tengo miedo de que los mods se enojen y me baneen por spam &gt;:c)\r\n\r\nTrata sobre la vida. y tambien la muerte. Como dije antes. Si van a comentar porfis dejen un +1. Son temas interesantes para hablar y quiero que todos lo vean.\r\n\r\nBueno. empecemos. &iquest;Que es la vida?\r\nPara mi. La vida es algo corto. 70-80 A&ntilde;os como m&aacute;ximo. Algunos lo pasan. Algunos ni llegan. Es algo abstracto.\r\nEn la vida buscamos cosas que nos hagan sentirnos bien con nosotros mismos. Sea como sea. Buscamos algo que nos haga felices.\r\nPero para eso necesitamos Seguir por una cadena de cosas.\r\nSi queremos tener Dinero debemos trabajar. Para trabajar ahora te piden diploma secundario. Tenes que estudiar secundaria.\r\nTodo una cadena de in&uacute;tiles cosas Que le dan sentido a nuestra pobre y corta vida. &iquest;Es algo tonto no lo creen?\r\n&iquest;Porque no corremos desnudos por el bosque? Total vamos a morir.\r\nLa idea principal de vivir es hacer lo que te gusta. Sin importar nada.\r\n\r\n&iquest;Que es la muerte?\r\n-La muerte es lo que esta despu&eacute;s de la vida. Nosotros como entes vivientes. En carne y hueso. Estamos en el plano terrenal, Por lo que no sabemos con exactitud que pasa en &#039;&#039;El mas all&aacute;&#039;&#039; O el &#039;&#039;Plano espiritual&#039;&#039;\r\nPor una parte. Si nuestra vida acaba. Podemos terminar en un sue&ntilde;o eterno, De cosas cambiantes.\r\nPero eso no viene a la l&oacute;gica. &iquest;Como nuestro cerebro puede crear sue&ntilde;os si se desintegra?\r\nEso nos lleva a pensar esto. Terminamos como una especie de &#039;&#039;esp&iacute;ritus&#039;&#039; Que viven en el plano espiritual hasta que alcanzan su meta y pasan a otro lugar.\r\nPero alto. No podemos terminar en el plano espiritual Si no tenemos algo pendiente que hacer en este mundo. entonces\r\n&iquest;Que le pasa a alguien que muere sin arrepentimiento de nada? &iquest;Desaparece? &iquest;Pasa a &#039;&#039;otra vida?\r\nSon muchas preguntas. No se sabr&iacute;a responder con exactitud. Pero la respuesta es simple. A alg&uacute;n lado va.\r\nMe explique lo suficiente)?\r\nComo siempre. Les pido en mis post que dejen su +1 y Si van a comentar. Que sea con argumentos &lt;3\r\nGracias :$\r\nY aclaro. Estan permitidas todas y cada una de las opiniones.","replies":[{"poster":"VodkaCL","date":"2017-05-27T04:19:52.628+0000","up_votes":2,"down_votes":1,"body":"en serio te parece inutil la busqueda del conocimiento y el trabajo? sabias que el internet o la computadora que estas usando en este minuto se generaron a partir de estos 2 conceptos?. \"por que no corremos desnudos por el bosque?\",  porque somos seres racionales no somos simples animales de granja que solo siguen su instinto","replies":[{"poster":"Vaendrys","date":"2017-05-27T04:23:33.497+0000","up_votes":4,"down_votes":1,"body":"SSHhhh, arruinas el discurso filosófico barato :c","replies":[]}]},{"poster":"xSoofi","date":"2017-05-27T04:55:37.736+0000","up_votes":3,"down_votes":1,"body":"La vida simplemente es una reacción química entre todos nuestros componentes ya evolucionados. Después de la muerte no hay nada, ahí se acabó tu vida y no podrás vivir ni 1 segundo más. Nunca estudie filosofia sinceramente.","replies":[{"poster":"ˆMKˆ zZz","date":"2017-05-27T15:32:50.775+0000","up_votes":2,"down_votes":0,"body":"Me dejaste sad :c","replies":[{"poster":"xSoofi","date":"2017-05-27T15:49:42.517+0000","up_votes":1,"down_votes":0,"body":"JAJAJAJA, suelo hacerlo","replies":[]}]}]},{"poster":"Defg45333","date":"2017-05-27T05:33:51.980+0000","up_votes":2,"down_votes":1,"body":"Por supuesto que vamos a algún lado, pues la energía no puede simplemente desaparecer, debe transformarse.\nBásicamente al dejar el cuerpo atrás, pasamos a convertirnos en calor por así decirlo (por eso un cadáver se enfría), pero que nuestra energía siga existiendo no significa que lo sigamos haciendo nosotros como personas. Pues nuestra conciencia, sueños, pensamientos y sentimientos los dejamos atrás junto al cerebro.\n\nRealmente no creo en ninguna clase de \"vida después de la muerte\", ni en la existencia de un \"alma\".\nConsidero que fue un invento diseñado para consolar a quienes le temen a la muerte, pues no hay que tenerle miedo, a todos nos va a llegar en algún momento, disfruten sus vidas mientras duren, y cuándo acaben... pues eso, no pasará nada más para ustedes.","replies":[{"poster":"WhiteMax","date":"2017-05-27T18:58:49.963+0000","up_votes":1,"down_votes":0,"body":"> Considero que fue un invento diseñado para consolar a quienes le temen a la muerte\n\nExacto.\n\n>  pues no hay que tenerle miedo\n\nBueno ahi estas mal, no tenerle miedo a la muerta es el primer paso para volverte un suicida.","replies":[{"poster":"Defg45333","date":"2017-05-28T04:35:52.488+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=WhiteMax,realm=LAS,application-id=J8qpiO2I,discussion-id=2yFO78zL,comment-id=00020000,timestamp=2017-05-27T18:58:49.963+0000)\n>\n> Exacto.\n> \n> Bueno ahi estas mal, no tenerle miedo a la muerta es el primer paso para volverte un suicida.\n\nCreo que hay una enorme diferencia entre no temer a la muerte e ir a buscarla.\nNo me convierte en un suicida aceptar que moriré algún día, y dejar de darle vueltas al tema.\nNo creo que vivir temiendo constantemente a la idea de la muerte sea realmente algo positivo.","replies":[]}]}]},{"poster":"WhiteMax","date":"2017-05-27T18:57:03.896+0000","up_votes":1,"down_votes":0,"body":"Mis teorias de lo que pasa el morir:\n\n1. Reencarnamos pero perdemos la memoria.\n2. Vemos todo negro como si estuvieramos con los ojos cerrados, por siempre.\n3. En un futuro muy lejano revivimos pero perdemos la memoria.\n4. Existe el Cielo o algo parecido.\n\nLa que pienso que es mas probable es la 2.","replies":[]},{"poster":"Capheny","date":"2017-05-27T17:12:23.900+0000","up_votes":1,"down_votes":0,"body":"https://www.youtube.com/watch?v=QOCaacO8wus","replies":[]},{"poster":"Mushû","date":"2017-05-27T08:19:49.336+0000","up_votes":1,"down_votes":0,"body":"Me dejaste tan en duda man, y estoy acostado mirando al techo pensando jajjaja","replies":[]},{"poster":"Send Núdes","date":"2017-05-27T05:37:44.869+0000","up_votes":1,"down_votes":0,"body":"Mande esta reflexion para nuke(? Pero ni se aparecio el sapallo :'v Solo lo hice porque el me lo pidio","replies":[]},{"poster":"Nuke","date":"2017-05-27T17:46:08.424+0000","up_votes":1,"down_votes":1,"body":"No me interesa tanto este post, porque no hay mucho que decir xDD.\nLa muerte, es lo desconocido, nadie sabe que hay despues. Pero, no es que luego de la vida no hay \"Nada\" Porque \"Nada\" es algo, y si \"Nada\" es algo, no es \"Nada\". ??? Es por esto que no se que sera de nosotros.\n\nLa vida es una experiencia y uno la toma como quiere. Estas al control de ella hasta cierto punto, pero podes hacer muchisimas cosas: Disfrutas de muchas, sufris de otras, pero al fin y al cabo lo que importa es que estas viviendo tu vida. Ahora, ¿Que queres hacer con ella? Esta en tus manos. Yo vivo muy feliz y me siento muy afortunado actualmente.\n\n¿Se imaginan si una fuente extraña de conciencia siguiera dentro de nosotros? Jamas muere, y estara atrapada en nuestros cuerpos hasta la eternidad... Horrible de pensar.\n¡Un saludo!\n\nDejo un video relacionado con el tema y muy interesante c:\nhttps://www.youtube.com/watch?v=m34ZI2_lmkQ","replies":[]},{"poster":"acaelpibe","date":"2017-05-27T13:43:58.910+0000","up_votes":1,"down_votes":2,"body":"tengo mil teorias con argumentos que pueden hacerte pensar hasta explotar, somos un monton de pelotudos en el mundo siguiendo las reglas de unos pocos poderosos, estamos en el punto sin retorno, no podemos escapar del sistema, por eso nadie corre desnudo por el bosque jajaj. igual ideas ya tengo de como hacer para derrumbar el sistema actual, el problema que no te sigue nadie, la gente es comoda, ta perdon saludosssss{{summoner:1}}","replies":[]}]}