{"poster":"Send Núdes","date":"2017-02-19T15:18:24.563+0000","title":"Sistema de misiones","subforum":"Charlas Generales","up_votes":5,"down_votes":14,"body":"Que pensarian si les dijera que Se podria inventar un sistema de misiones?\nDependiendo de la liga que sean y de como vayan. Se les otorgara una mision. Con requisitos a cumplir, al cumplir esos requisitos, se te dara una recompenza dependiendo la dificultad de dicha mision.\nLes dare un peque&ntilde;o ejemplo de como me imagino que podrian ser (Tal como dijo franja)\n\n* Juega 3 partidas con Campeones de rol luchador (Tienen que ser distintos, o no se acumula)\n* Juega 2 partidas con Campeones de rol soporte (Igual que el de arriba, tienen que ser distintos)\n\nAsi aumentaria la variedad de campeones.. \n(Pls lean bien el post antes de cagarme a negativos :'D ty)\n\n\n\n+1 Si quieren un sistema asi. Si tienen un ejemplo ponganlo en los comentarios prros","replies":[{"poster":"Franja","date":"2017-02-19T15:21:03.531+0000","up_votes":8,"down_votes":0,"body":"Estoy totalmente en desacuerdo.\n\nLos jugadores intentarian hacer las misiones mas que intentar ganar la partida, tomando desiciones muchas veces no idoneas, unicamente por completar las misiones.","replies":[{"poster":"Send Núdes","date":"2017-02-19T16:53:20.990+0000","up_votes":1,"down_votes":2,"body":"No es necesario que den negativos.. porque di ''ejemplos'' no algo fijo ._. eso simplemente lo puedo editar","replies":[{"poster":"Matas23","date":"2017-02-19T17:27:28.465+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Hetsu,realm=LAS,application-id=v7qsfXsE,discussion-id=IUrbbbE3,comment-id=00000000,timestamp=2017-02-19T16:53:20.990+0000)\n>\n> No es necesario que den negativos.. porque di &#x27;&#x27;ejemplos&#x27;&#x27; no algo fijo ._. eso simplemente lo puedo editar\n\nWelcome to Las","replies":[{"poster":"Send Núdes","date":"2017-02-20T07:09:50.215+0000","up_votes":1,"down_votes":0,"body":"Me parece que algunos ni leyeron el post X'D solo le dieron negativos porque si, y para otros estar de acuerdo significa darle -1 :v","replies":[{"poster":"Matas23","date":"2017-02-20T12:29:42.599+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Hetsu,realm=LAS,application-id=v7qsfXsE,discussion-id=IUrbbbE3,comment-id=0000000000000000,timestamp=2017-02-20T07:09:50.215+0000)\n>\n> Me parece que algunos ni leyeron el post X&#x27;D solo le dieron negativos porque si, y para otros estar de acuerdo significa darle -1 :v\n\n\n\nx2\nA mi a veces me dan negativos gente que no entiende cuando hablo con sarcasmo,y luego ni comentan\nEs algo medio penoso\n xD","replies":[]}]}]},{"poster":"WhiteMax","date":"2017-02-19T23:08:55.509+0000","up_votes":1,"down_votes":0,"body":"La gente toma los negativos como si fueran los likes de youtube y/o hacen lo de \"como tiene negativos yo tambien le doy y sin comentar\".","replies":[]}]},{"poster":"sonof666","date":"2017-02-19T22:46:59.995+0000","up_votes":1,"down_votes":1,"body":"Estoy totalmente en desacuerdo.\n\nNo necesariamente deberían de interferir, pues podría imponerse como condición que para obtener el premio que otorgua el cumplimiento de la misión debes ganar la partida, así como actualmente sucede con los fragmentos de llave, que solo los obtienes con victorias.","replies":[{"poster":"Franja","date":"2017-02-20T01:51:36.575+0000","up_votes":1,"down_votes":0,"body":"Imagina una partida que esta ganada, pero tu equipo no quiere cerrarla para cumplir con las misiones. Bastante molesto la verdad.","replies":[]}]},{"poster":"Sir Crucifix ","date":"2017-02-19T21:23:31.474+0000","up_votes":1,"down_votes":1,"body":"todos los juegos tienen misiones , porque vos y tanta gente se encierran ???!!!","replies":[{"poster":"Franja","date":"2017-02-19T22:14:54.346+0000","up_votes":1,"down_votes":0,"body":"No creo que el argumento \"todos lo hacen\" sea un buen argumento.","replies":[{"poster":"Sir Crucifix ","date":"2017-02-19T22:22:22.331+0000","up_votes":1,"down_votes":2,"body":"esta bien , es tu opinion . \npara mi deberia tener misiones diarias , para darle mas vida al juego","replies":[]}]}]}]},{"poster":"IvVicious","date":"2017-02-19T15:30:40.777+0000","up_votes":4,"down_votes":0,"body":"Lo que dijo Franja. Creo que un sistema de recompensas mejor sería algo como el que tiene el HOTS, que tenés que jugar X partidas con un héroe X, se podría implementar acá y creo que ayudaría bastante a la variación de campeones, tipo\n> - Juega tres partidas con un Luchador\n> - Juega dos partidas con un Soporte\n> - Juega cuatro partidas con un Mago\n\nAlgo así.","replies":[{"poster":"Send Núdes","date":"2017-02-19T16:54:25.336+0000","up_votes":2,"down_votes":1,"body":"Vendria a ser con campeones distintos.. asi aumentaria la variedad de una forma real, es buena idea","replies":[{"poster":"IvVicious","date":"2017-02-19T17:31:41.036+0000","up_votes":2,"down_votes":0,"body":"No entiendo por qué te dieron tantos negativos XD Pero sí, estaría bueno porque solucionás un problema grande como lo es la poca diversidad en los roles y de paso juntás pi adicional que nunca viene mal ^w^","replies":[{"poster":"WhiteMax","date":"2017-02-19T23:09:27.274+0000","up_votes":1,"down_votes":0,"body":"Sera por su \"idea\", la tuya es buena, pero la dijiste tu, no el.","replies":[]}]}]}]},{"poster":"Americans","date":"2017-02-19T15:38:34.230+0000","up_votes":2,"down_votes":1,"body":"\"perdon chicos se que se quieren juntar y terminar el game pero tengo que cuidar mis muertes asi que prefiero perder\"","replies":[]},{"poster":"KzG Arconte","date":"2017-02-20T00:50:16.758+0000","up_votes":1,"down_votes":0,"body":"¿crees que esto es paladins? ¿hots? las partidas aqui pueden durar mas de 1 hora, hay gente que con suerte se juega 1 partida o solo un misero aram por semana. \n\nquizás deberían incorporar algo para facilitar la compra de runas, campeones. aunque que ya implementada la primera victoria del día.","replies":[]},{"poster":"Mioen","date":"2017-02-19T18:01:07.854+0000","up_votes":1,"down_votes":1,"body":"Creo que el plantea un sistema de misiones como en otros juegos.\n\nLa verdad no es mala la idea, puedes crear distintas misiones indiferentes del pick. El tema es que seleccionar un rol para un mision es algo dificil, por que tranquilamente puede ir un Garen support y no recibira recompenza alguna.\n\nPero una idea copada podria ser como la de Dota2 con lo del heroe del dia.\n\nEs algo complicado.","replies":[{"poster":"Sir Crucifix ","date":"2017-02-19T21:25:49.528+0000","up_votes":1,"down_votes":0,"body":"cual es el problema de mandar a alguien hacer  Quest , \"ir al carril inferior 2 veces \"  \"derrota a 2 dragones\"  \"pon 10 wards \"","replies":[{"poster":"Mioen","date":"2017-02-20T00:13:15.150+0000","up_votes":1,"down_votes":0,"body":"Pon 10 Wards esa me mato.\n\nPero si se lograse tener un seguimiento tan específico para cada jugador no habría problema.\n\nSin embargo esas son Quest básicas he inclusive, no necesariamente vas a poder realizarlas en 1 partida aunque parezca raro.\n\nSi por ejemplo jugas con un top pusher es algo difícil de que bajes al dragón.\nO quizás no te toque ir ADC o Support como para que el sistema te lo tome, por eso dije es algo complicado.\n\nImposible NO, solo complicado. Ademas tendría que evitarse dar Quest que desbalanceen las colas.","replies":[{"poster":"Sir Crucifix ","date":"2017-02-20T00:44:49.254+0000","up_votes":1,"down_votes":0,"body":"pero asi no funciona , no es te doy 5 quest y hacelas en 1 misma partida . igual no pasa nada con las colas si segun internet y la gente es el juego mas popular y con mas gente del todo el mundo","replies":[]}]}]}]},{"poster":"Ks Erwyn","date":"2017-02-19T16:52:37.957+0000","up_votes":1,"down_votes":0,"body":"Me parece una idea tan brillante, solo comparable a las gafas para perros...","replies":[]}]}