{"poster":"waterman241","date":"2017-02-27T08:12:25.270+0000","title":"was bedeutet eig. Farmen","subforum":"Champions & Gameplay","up_votes":3,"down_votes":0,"body":"Hallo erstmal\r\n\r\nIch habe eine frage an die Community und zwar bel&auml;uft meine frage auf das oben beschriebene Wort was hei&szlig;t farmen sowas wie campen und kills holen","replies":[{"poster":"XorosH","date":"2017-03-02T09:42:22.831+0000","up_votes":1,"down_votes":0,"body":"Ein Farmer ist jemand der im Frühlig Gemüse anpflanzt um es dann in der Endsaison zu ernten und somit seinen Lebensunterhalt verdient. Diesen ganzen Vorgang nennt man auch \"farmen\".\nEs gibt auch eine andere Bedeutung des Wortes. Wenn du einen Farmer-Riegel isst, kann man das auch \"farmen\" nennen.","replies":[{"poster":"waterman241","date":"2017-03-02T22:47:28.963+0000","up_votes":1,"down_votes":0,"body":"Alles klar soweit bin ich mitgekommen und habe was neues gelernt XD danke dir hahahaha","replies":[]}]},{"poster":"Killerkante","date":"2017-02-27T13:19:46.337+0000","up_votes":1,"down_votes":0,"body":"nichts für ungut, aber das kann man auch eigentlich googlen oder auf youtube schauen, das hättest du schneller rausgefunden als du hier auf eine Antwort gewartet hast.\n\nYoutube empfehl ich dir jedenfalls wenn du vor hast besser zu werden und dir ggf die basics anzueignen.","replies":[]},{"poster":"CrasenEX Neeko","date":"2017-02-27T08:23:16.617+0000","up_votes":1,"down_votes":0,"body":"Farmen bedeutet eher Gold sammeln um stärker zu werden, also je nachdem was du spielst im Jungle oder auf den lanes Vasallen zu erledigen um Gold zu generieren. Wenn du angewiesen wirst zu Farben möchte dein Team, dass du so schnell wie möglich Gold sammelst um das Spiel noch herumdrehen zu können. Gold bekommt man halt leider nur durch last Hits an minions oder durch Kills und Assists. Solltest du letzten Endes letzteres nicht bekommen können solltest du so schnell wie möglich schauen, dass du irgendwelche großen Vasallenwellen bzw. Minion waves mitnimmst. \n\nMfG","replies":[{"poster":"waterman241","date":"2017-02-27T09:00:32.975+0000","up_votes":1,"down_votes":0,"body":"Also auf gut Deutsch Vasallen oder minions töten und viel gold holen und die stats Pushen soweit bin ich mitgekommen danke nochmals für denn Supp","replies":[{"poster":"5weeds","date":"2017-02-27T09:02:54.632+0000","up_votes":1,"down_votes":0,"body":"Kein Ding ^^","replies":[{"poster":"waterman241","date":"2017-02-27T09:05:31.815+0000","up_votes":1,"down_votes":0,"body":"wie kriege ich noch Die S ränge oder -S muss ich supp oder auf meine Lane bleiben weil ich versuche akkurat gut zu spielen habe Garen schon geschafft habe 2 wappen gekriegt und versuche verzweifelt noch von Nasus die Wappen zu kriegen was muss ich noch machen?!?!?!","replies":[{"poster":"5weeds","date":"2017-02-27T09:34:07.948+0000","up_votes":1,"down_votes":0,"body":"du musst *Trommelwirbel*\n\nFarmen! xD\nnatürlich brauchst du auch ne Gute KD, aber vor allem bei Nasus musst du die Vasallen mit deinem Q töten, denn für jedes  Vieh, dass du mit deiner q tötet, wird dein q stärker \n\nAlso: schnapp sie dir Alle!","replies":[]}]}]}]}]},{"poster":"5weeds","date":"2017-02-27T08:19:51.048+0000","up_votes":1,"down_votes":0,"body":"Ne,\nim game gibt's ja Vasallen (die kleinen Dinger die Rumlaufen), wenn man die tötet, bekommt man Gold.\nWenn man sich also darauf konzentriert, durch diese Viecher Gold zu bekommen, nennt man das \"farmen\".\nman Farmt quasi Gold.\n\nWenn du viele Vasallen getötet hast/viel Gold hast, spricht man von einen gutem Farm.\nNatürlich kannst du auch im Jungle die neutralen Monster \"farmen\", macht in der Regel aber hauptsächlich der Jungler.\n\nHoffe das konnte helfen ^^","replies":[{"poster":"waterman241","date":"2017-02-27T09:03:21.850+0000","up_votes":1,"down_votes":1,"body":"Alles klar danke dir für die Ansage ich bin voll am verzweifeln daswegen ich versuche soviele kills durch die minions zu kriegen und die meisten nehmen sie mir weg wenn ich sie mir gesammelt habe also auf gut deutsch muss ich schneller lvln als die anderen soweit bin ich mitgekommen danke nochmals XD","replies":[]}]}]}