{"poster":"Cruspak00","date":"2015-10-09T09:32:10.199+0000","title":"Sistema Leghe Veramente Pietoso","subforum":"Discussioni generali","up_votes":4,"down_votes":9,"body":"1. Allora parto dal presupposto che non sono una potenza su lol ma me la cavo molto; come sempre nelle ranked si vince e si perde, in passato (parlo della season 4) il sistema leghe era molto equo e la distribuzione dei punti a fine partita in caso di sconfitta o di vittoria era molto bilanciato. Nella season 5 &egrave; cambiato tutto: avevo una seguenza di 11 vittorie in ranked e a fine di tutte le partite ricevevo dai 10 ai 20 punti, quando perdevo mi toglievano dai 20 ai 30 punti (questo mi succede pure ora). Per una persona che vuole salire this rank &egrave; impossibile, perch&egrave; con i punti che si ricevono bisognerebbe fare dieci partite per andare solo in promo, e pensando che qualcuna si perde sicuramente. Scrivo questo perch&egrave; non riesco a salire, anzi retrocedo solo pi&ugrave; velocemente. Io penso che se la riot non modifica il sistema leghe lo disinstallo. \r\nCommentate pure voi che leggete questo post, e diamo una mano a tutti per salire e migliorare esperienze di gioco.\r\nCruspak","replies":[{"poster":"UnknownEV","date":"2015-10-09T10:10:28.819+0000","up_votes":3,"down_votes":2,"body":"1. Se non riesci a salire vuol dire che il tuo grado è quello, abituati.\n2. l'mrr lo ha appena spiegato \"ZeroHaato\"\n3. Credi che scrivendo che \"lo disinstalli\" la Riot farà qualcosa per te? LOL ... Ciao ciao disinstalla pure c:","replies":[]},{"poster":"Frattaglia","date":"2015-10-09T10:14:11.029+0000","up_votes":2,"down_votes":1,"body":"Fregatene degli LP che perdi o vinci e punta solo a vincere più partite di quante ne perdi.\nSe riesci a ottenere questo, il resto si sistemerà da solo.","replies":[{"poster":"Cruspak00","date":"2015-10-09T10:17:02.461+0000","up_votes":2,"down_votes":1,"body":"Ci proverò","replies":[{"poster":"rahinor","date":"2015-10-10T13:32:41.969+0000","up_votes":1,"down_votes":0,"body":"Fidati che si può salire te lo dice uno che è stato mesi in silver 4-3 e di colpo ho scalato fino a silver 1....non credo sia solo culo ^^","replies":[]}]}]},{"poster":"Lee Pugno Divino","date":"2015-10-09T09:39:36.740+0000","up_votes":2,"down_votes":1,"body":"Hai un mmr inferiore alla tua attuale lega, ed il sistema cerca di farti retrocedere :) \nAumentando il tuo win rate piano piano questa divergenza verrà ridotta e comincerai a vincere i giusti punti e perderne la giusta quantità. Pure io prima il mio winrate era del 40-45% e perdevo un sacco di punti. Cominciando a vincere piu' partite di quelle perse piano piano ho risolto il problema.","replies":[{"poster":"Cruspak00","date":"2015-10-09T09:41:00.634+0000","up_votes":1,"down_votes":2,"body":"Ho capito ma non capisco perchè","replies":[{"poster":"Whommy","date":"2015-10-09T09:55:13.480+0000","up_votes":2,"down_votes":1,"body":"perchè la classifica non è lineare in base al guadagno\nsali se il tuo MMR (dato nascosto) aumenta con le vittorie, scendi se si abbassa\ni PL sono solo un riflesso del tuo MMR e dipendono solo dall'MMR di chi affronti in partita\n\nse perdi 20-30PL singifica che perdi con squadre parecchio più deboli di te\n\nti pongo l'esempio inverso\n\nieri ero in promo vinta 1 perse 2\n\nsono tornato a 88PL, significa che ho perso circa 6PL a partita, il sistema cerca di farmi salire perchè il mio MMR è più alto di dove sono, se vinco prendo in media 24-30PL","replies":[]},{"poster":"Sìrjohn","date":"2015-10-09T09:48:39.343+0000","up_votes":2,"down_votes":1,"body":"hai più sconfitte che vittorie tenendo conto anche della season precedente.\n\nIl sistema di considera più basso del bronzo 3 e tende a darti meno punti quando vinci.","replies":[{"poster":"Cruspak00","date":"2015-10-09T09:55:39.869+0000","up_votes":1,"down_votes":1,"body":"sono bronzo 3 pero ho tipo 380 win e 400 lose","replies":[]}]},{"poster":"Lee Pugno Divino","date":"2015-10-09T09:46:52.724+0000","up_votes":2,"down_votes":1,"body":"E' semplice la spiegazione.\nPer meritare la lega/divisione in cui ti trovi attualmente hai bisogno di avere un win/ratio del 50%. In poche parole devi vincerne 10 e perderne 10.\nNel momento in cui su 20 partite ne perdi 11 e ne vinci 9 man mano giocando questo win/ratio si abbassa ed è sinonimo che non meriti la divisione in cui sei piazzato.\nIl sistema non ti fa scendere di colpo e ti dà degli allarmi. Il perdere piu' punti di quel che vinci è un segnale.\nNon fare troppo caso ai punti, gioca e vinci piu' spesso, la divergenza mmr/lega si assottiglierà.","replies":[{"poster":"Cruspak00","date":"2015-10-09T09:56:01.227+0000","up_votes":1,"down_votes":1,"body":"Grazie","replies":[]}]}]}]},{"poster":"ztJackieChan","date":"2015-10-10T20:23:19.220+0000","up_votes":1,"down_votes":0,"body":"1) non sono una potenza : non sono un diamond\n\n2) ma me la cavo molto : sono almeno gold, anzi, praticamente platino\n\n3) altri dettagli : sono bronze 3, MOMENTANEAMENTE","replies":[]},{"poster":"kirchhoff","date":"2015-10-09T23:15:28.375+0000","up_votes":1,"down_votes":0,"body":"Non è cambiato di una virgola dalla stagione 4, semplicemente sei arrivato al tuo livello di skill.","replies":[]},{"poster":"Corazza Spinata","date":"2015-10-09T09:52:00.513+0000","up_votes":1,"down_votes":1,"body":"io avevo più vittorie che sconfitte (e le ho ancora), uscendo da una loosing streak di 8  successivamente ne ho vinte tipo 30 e perse 11 e ancora perdevo 25 e vincevo 16","replies":[]}]}