{"poster":"WhyDidYouDie","date":"2019-02-02T00:55:52.963+0000","title":"CRITICAL ERROR","subforum":"Help & Support (OCE)","up_votes":1,"down_votes":0,"body":"this an issue that needs to be raised severely, due to this problem that has been happening since latest batch of patches, i can no longer play any game over 30 minutes, many other people are suffering injust consequences on game play. &quot;critical error&quot; message appears after 30 minutes, and it forcefully disconnects from game, forced to reconnect to the game and 2 minutes later same error will appear in a continuous loop for the rest of the game, despite reconnecting, the game sees you a leaver, i have been placed in lower priority queue for fault of client crashing and not my own, i have also been demoted twice. \r\n\r\ni have re installed league. - no fix.\r\ni have initiated full repair. - no fix.\r\nwatched several youtube videos on their way of fix. - no fix.\r\n\r\nplease do something about this. punishment that is handed down caused by this error makes me sick.\r\n-WhyDidYouDie","replies":[{"poster":"Ninox","date":"2019-02-03T03:05:42.360+0000","up_votes":1,"down_votes":0,"body":"Submit a ticket to player support: https://support.riotgames.com/hc/en-us/requests/new\n\nIf nothing else, it helps them track issues like this and to better understand who is affected and why, even if they can't get an immediate fix for you.\n\nAre you using AMD integrated graphics? There is a possibility this is the source of the issue, so what GPU you are using is worth mentioning in the ticket.","replies":[{"poster":"WhyDidYouDie","date":"2019-02-03T03:15:31.502+0000","up_votes":1,"down_votes":0,"body":"i have already submitted a ticket, given league logs etc, i have been playing league since 2013, never had this issue or any issues until the recent patches, ive had this problem since the latest patch before posting it here.\n\ni have AMD graphics but they arent integrated graphics, Radeon dual graphics is in play, despite either enabling them or disabling the dual graphics it makes no difference.\n\nAMD Radeon HD 8650G\n\ni have clean booted my pc, used hextech re install to clean install league, that should fix all problems as nothing else is running on my computer besides league, which rules out it being an \"overlay\" program or anything like that, im struggling to see why anything on my computer can be conflicting gameplay even when clean boot is used, it has to be the league client itself?\n\nthanks.","replies":[{"poster":"Ninox","date":"2019-02-03T03:23:18.593+0000","up_votes":1,"down_votes":0,"body":"It's not on your computer, it appears to be more widespread than that, but it seemed that many of those affected were on integrated AMD graphics, hence the question. Unfortunately this might end up being a wait and see type thing on your end. I'd certainly recommend avoiding ranked at least until we hear more.","replies":[]}]}]}]}