{"poster":"Pulastèr","date":"2015-10-28T09:53:39.691+0000","title":"Carryando i game","subforum":"Discussioni generali","up_votes":2,"down_votes":0,"body":"Stavo pensando\r\nMi sono reso conto che tra tutti i ruoli sono davvero bravino ad utilizzare il support, del tipo che &egrave; il ruolo che mi permette di vincere la maggior parte delle lane e spesso di portare un grande impatto all&#039;interno della partita\r\nIl problema &egrave; che ho la costante sensazione che sia quasi impossibile carryare un game da support e che sia preferibile giocare altri ruoli se si vuole avere in &quot;mano&quot; le sorti del game.\r\nSono stupido io o &egrave; vero? Mettiamo che sia un bravo midlaner ma un eccellente support, cosa &egrave; meglio fare?","replies":[{"poster":"SKFF1R SubZero","date":"2015-10-28T10:25:44.140+0000","up_votes":6,"down_votes":0,"body":"Sono main Support e capisco bene quella sensazione: l'ho avuto quando sono sceso da G2 a G4 (Una losing streak catastrofica)\n\nPurtroppo, il nostro ruolo è un ruolo \"bastardo\", nel senso che facciamo affidamento sempre su un'altra persona, che sia l'adc, il top, il mid o il jungler. \nSe vinci la lane ma non peeli per il tuo adc, perdi ma perdi anche se tu peeli benissimo e il tuo adc dorme. \nStesso dicasi per gli altri che cerchi di salvare.\n\nLa prima cosa che devi fare è vedere chi è il più bravo del tuo team: ad esempio, il tuo adc ha una media fantastica su Jinx. \nPuoi ragionevolmente presupporre che sia bravo: chiedigli come vuole giocare e adattati a lui.\n\nIl tuo adc è un po' scarso ma il tuo jungler è bravo? Chiama il gank e pinga 2 volte dicendo che hai flash e che i nemici non lo hanno (se sei stato bravo, hai preso il flash di uno dei due avversari), e appena lo vedi arrivare fai di tutto per portare il gank a compimento.\n\nApplica lo stesso discorso al mid (dì al tuo adc che vai a roammare, gli lasci 2 ward di difesa e gli dici di stare safe) e anche al top se proprio è l'unico che fa qualcosa.\n\nSi può salire da Support, fidati :D\n\nAh, e ovviamente ho fatto un discorso da support dal Gold in su: dal Silver in giù, prendi Support AP che facciano tanti danni (Annie, Brand, Vel'Koz son tutti ottimi pick) e puoi tranquillamente prenderti le kill, buildare sempre le sighstone e poi andare AP :)","replies":[{"poster":"Chroniicles","date":"2015-10-28T13:21:35.328+0000","up_votes":2,"down_votes":0,"body":"Parole sante.\nVoglio aggiungere solo un paio di cose sul discorso dei support ap:\n- valutate l acquisto di uno zeke\n- l oggetto da support potete non chiuderlo ( basta il primo upgrade da 500) e venderlo quando avete 5 oggetti \n- il rallentamento del rylai può trasformarsi in un ottimo peel","replies":[]}]},{"poster":"Mix Licantropo","date":"2015-10-28T10:22:23.453+0000","up_votes":2,"down_votes":4,"body":"Non devi carryare tu, ma il tuo adc.","replies":[{"poster":"Franky Fire","date":"2015-10-28T16:24:31.414+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Mix Licantropo,realm=EUW,application-id=MJVj50Jw,discussion-id=iHAzANPe,comment-id=0003,timestamp=2015-10-28T10:22:23.453+0000)\n>\n> Non devi carryare tu, ma il tuo adc.\n\nLa lane spesso la vince il support non l'adc, ricordatelo!","replies":[{"poster":"Mix Licantropo","date":"2015-10-28T16:44:43.367+0000","up_votes":2,"down_votes":0,"body":"Il support DEVE e ripeto DEVE proteggere l adc,FINE... non deve fare nient altro.\nE se non vuoi sacrificarti per il tuo adc, meglio se cambi lane.","replies":[{"poster":"Franky Fire","date":"2015-10-28T16:48:44.280+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Mix Licantropo,realm=EUW,application-id=MJVj50Jw,discussion-id=iHAzANPe,comment-id=000300000000,timestamp=2015-10-28T16:44:43.367+0000)\n>\n> Il support DEVE e ripeto DEVE proteggere l adc,FINE... non deve fare nient altro.\n\nVa bene, hai ragione te {{item:3070}}  {{item:3070}}","replies":[]}]}]}]},{"poster":"Nibbio Bianco","date":"2015-10-28T10:21:35.541+0000","up_votes":3,"down_votes":1,"body":"Ci sono support in grado di carryare più di altri. Guarda blitz, se fai buoni grab il tuo team ne approfitta e vinci, oppure Zyra o Brand con cui finisci per avere più danno dei carry. Se giochi support come Janna o Soraka, più difensivi, sei obbligato a sottostare ai tuoi compagni, devi seguirli e proteggerli e sperare che si comportino bene.","replies":[{"poster":"kregorai","date":"2015-10-28T11:49:44.138+0000","up_votes":2,"down_votes":1,"body":"non son daccordo con la tua idea, support come zyra e brand o anche vel son pick particolari e se hai contro una persona che non sia li per puro caso e magari ha pickato dopo di te con molta probabilità soffrirai in lane. sono pick tryhard per il semplice fatto che se perdi la lane molto spesso perderai il game perché raramente riesci a recuperare in termini di danni. non sto dicendo che non possano andarci anzi! solo che devi aver contro i champ giusti :D.\nesempio: mi prendi un brand o simili? \ncaso 1) mi prendo un tank e non metterò le classiche rune da support prenderò tutto quello che serve per ucciderti al livello 2(ignite incluso), perchè probabilmente i tuoi danni sono limitati hai semplicemente uno stun (se hai fatto il due) e sei squishy peggio di sona.\ncaso 2) early gank easy kill non hai moviment ti vengo a gankar fino sotto torre l'ignite riduce l'heal dell'adc oppure un exh se sei pushato non riuscirai mai ad arrivare in base.\ncaso 3) siamo squishy perchè abbiam pickato prima... non so soraka o janna con un twitch? giochiamo difensivo. se tu sei full damage (per intenderci 21 0 9) scalerai veramente male hai bisogno di molti piu soldi di altri support, se non lo sei scalerai comunque peggio di noi per il semplice fatto che hai bisogno di molti piu soldi di quelli che ha un support!\n\novviamente se inizi a far kill la bot diventa insostenibile e stravinci una lane :D, e dopo puoi snowbollore la lane o zonare gli avversari cosi da lasciar indietro l'adc avversario ( easy win!).\n\nper questo lo chiamo tryhard e non lascia molte altre alternative a queste due esposte, non esiste la farm lane (rimarresti indietro) e se rimani indietro sarai un peso per il team, d'altro canto se vinci la lane avrete un midgame da paura e vincerete al 90%. scelte difficili, ma sicuramente sono counter pick di una bot non first pick safe come può essere un tham un thresh una morgana, che chiunque gli metti contro possono giocarsela ( o quasi ).\n\nti faccio un'esempio vayne thresh in bot first pick mi han pickato contro jinx ( o cait non ricordo) e leblanc, ci stà cancelli il game di vayne... può veramente poco sopratutto early non ha il range si becca un harras infinto e smette di giocare dal livello 1 ( si ok thresh magari può prendere al volo lb ma se è un'attimo decente come champ non è cosi facile e gli basta aprire 2 sigilli su vayne per farlo ritornare in base... morto). non ti dirò come è andata a finire perché non è importante ma come idea era buona! negare il game a vayne per renderlo inutile per il resto della partita! ed è più o meno lo scopo di tutti questi champ bulleggiare l'adc in lane per farlo arrivare in mid inutile. ma a che prezzo?","replies":[{"poster":"Nibbio Bianco","date":"2015-10-28T12:21:42.389+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=kregorai,realm=EUW,application-id=MJVj50Jw,discussion-id=iHAzANPe,comment-id=00020000,timestamp=2015-10-28T11:49:44.138+0000)\n>\n> non son daccordo con la tua idea, support come zyra e brand o anche vel son pick particolari e se hai contro una persona che non sia li per puro caso e magari ha pickato dopo di te con molta probabilità soffrirai in lane. sono pick tryhard per il semplice fatto che se perdi la lane molto spesso perderai il game perché raramente riesci a recuperare in termini di danni. non sto dicendo che non possano andarci anzi! solo che devi aver contro i champ giusti :D.\n> esempio: mi prendi un brand o simili? \n> caso 1) mi prendo un tank e non metterò le classiche rune da support prenderò tutto quello che serve per ucciderti al livello 2(ignite incluso), perchè probabilmente i tuoi danni sono limitati hai semplicemente uno stun (se hai fatto il due) e sei squishy peggio di sona.\n> caso 2) early gank easy kill non hai moviment ti vengo a gankar fino sotto torre l'ignite riduce l'heal dell'adc oppure un exh se sei pushato non riuscirai mai ad arrivare in base.\n> caso 3) siamo squishy perchè abbiam pickato prima... non so soraka o janna con un twitch? giochiamo difensivo. se tu sei full damage (per intenderci 21 0 9) scalerai veramente male hai bisogno di molti piu soldi di altri support, se non lo sei scalerai comunque peggio di noi per il semplice fatto che hai bisogno di molti piu soldi di quelli che ha un support!\n> \n> ovviamente se inizi a far kill la bot diventa insostenibile e stravinci una lane :D, e dopo puoi snowbollore la lane o zonare gli avversari cosi da lasciar indietro l'adc avversario ( easy win!).\n> \n> per questo lo chiamo tryhard e non lascia molte altre alternative a queste due esposte, non esiste la farm lane (rimarresti indietro) e se rimani indietro sarai un peso per il team, d'altro canto se vinci la lane avrete un midgame da paura e vincerete al 90%. scelte difficili, ma sicuramente sono counter pick di una bot non first pick safe come può essere un tham un thresh una morgana, che chiunque gli metti contro possono giocarsela ( o quasi ).\n> \n> ti faccio un'esempio vayne thresh in bot first pick mi han pickato contro jinx ( o cait non ricordo) e leblanc, ci stà cancelli il game di vayne... può veramente poco sopratutto early non ha il range si becca un harras infinto e smette di giocare dal livello 1 ( si ok thresh magari può prendere al volo lb ma se è un'attimo decente come champ non è cosi facile e gli basta aprire 2 sigilli su vayne per farlo ritornare in base... morto). non ti dirò come è andata a finire perché non è importante ma come idea era buona! negare il game a vayne per renderlo inutile per il resto della partita! ed è più o meno lo scopo di tutti questi champ bulleggiare l'adc in lane per farlo arrivare in mid inutile. ma a che prezzo?\n\nLe Blanc è un campione differente, ha scaling AP molto alti. Campioni come Brand, Zyra e Vel'Koz hanno scaling  di base migliori di classici support da usare in bot e scaling AP peggiori di essi, quindi fino al raggiungimento del livello 18 fanno dei danni esagerati e non è assolutamente vero che non scalano in late game. Non hanno escape, quello è vero, ma ci sono anche un sacco di altri support senza escape, e, comunque, il molte team comp gli scaling di questa tipologia di support sono talmente alti da poter fare 2 vs 3 e vincere, anche. Questo è il motivo per cui sono campioni decisamente più forti rispetto ai support tradizionali ed hanno una capacità di carryare più alta, sebbene si presupponga essere bravi con gli skillshot. Poi, vabé, di Zyra non ne parliamo proprio perché la sua ultimate è una delle abilità AOE più forti del gioco, con quel knock in un'area veramente vasta, ti basta un rylai per evitare che chiunque possa uscire. \n\nComunque, i support tradizionali si presuppone siano buoni in tutte le fasi del gioco, mentre questi calano nel late game, è questo il loro lato negativo, ma si presuppone che nel late siano i tuoi carry a carryarti, sempre se dovessi arrivarci, e poi il secondo lato negativo è che non sono un granché nel roaming, sono specialmente laner, sinceramente non credo che sia anche possibilità salvarsi da questi campioni rimanendo semplicemente sotto torre, e sono facilmente counterabili da campioni basati sull'heal ( Soraka, Taric, Nami )","replies":[{"poster":"kregorai","date":"2015-10-28T13:13:05.131+0000","up_votes":1,"down_votes":0,"body":"non era per darti contro era semplicemente una mia idea che son pick da tryhard cmq hai letto lategame nel mio post? \nho parlato spesso di midgame  ma quasi mai di late non so se hai notato.. avere un'altro apcarry in late può essere decisivo ma devi arrivarci in late( e avere un top ed un jgl con ingage e che possano aiutare i carry del tuo team a non essere shottati)!\nnon volevo entrare nel dettaglio e si fanno molti danni di base rispetto ad altri midlaner ma non puoi paragonarmi la loro dipendenza dal gold rispetto ad ogni altro support....\n l'ulti di brand e di vel sono mostruose sopratutto se ci sono piu persone in lane (e in bot normalmente son 2 (Y) ). ed è per questo che sono 2 fra i support ap che mirano solo a killare l'avversario più utilizzati! e non sto dicendo che non facciano il loro sporco lavoro. ma se non vincono la lane rimangono molto più indietro di altri support! \n\nps: mi hai citato il relay presupponendo che spendi 800 gold per il sight minimo 325/1100 per le scarpe ( minimo ovviamente poi dipende da contro chi hai e dalla strategia adottata ) mettiamoci altri 600 gold fra pozioni e pink ( e non è tanto con zyra) 375/875 di oggetto da support (sempre che tu non voglia partire di tomo) sono altri 3000 mila gold investiti in un'oggetto solo che offensivo che ti da 400 punti vita, senza utility nella costruzione apparte l'ap. dimendicando la dipendenza dal mana di zyra sopratutto in lane se vuoi avere un minimo di presenza.  quando conti di finire di costruirlo? mettendo pure che vuoi farlo come terzo oggetto dopo il sight e metà di quello da support. matematica. senza contare che spesso e volentieri su zyra si preferisce fare prima un po di penetrazione magica da maschera o scarpette. tu mi stai parlando di late game inoltrato o se lo fai come terzo oggetto di fine midgame.\navere un secondo apc in late è forte molto forte. zyra è uno dei champ che può ribaltare una partita grazie al suo output di danni, ma non pensare di avere sempre contro dei bot che ti regalano gold. e nota bene zyra ha due skill più la piantina per avere cc e l'ulti è qualcosa di eccezionale sia in engage che disengage. \nbrand ha uno stun che deve anche beccare,  vel gioca a bubbletruble insieme a nami. \nsono ottimi pick ma in determinate situazioni se il mid e il jgl permettono di bullizzare la bot ed è una bot bullizzabile! \n\nzyra è una bulla in lane? si. zyra non ha escape? si. zyra è un'ottimo support? si, lo è contro determinate composition.\n\n\n\nnon ho ben capito in cosa sei in disaccordo sul mio post potresti spiegarmi bene! \nricorda che non sto dicendo che non possono andare support, ma che non ritengo che carryino i game meglio di altri support e che posson essere pickati solo in precise composizioni con e contro!","replies":[{"poster":"Nibbio Bianco","date":"2015-10-28T13:49:24.813+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=kregorai,realm=EUW,application-id=MJVj50Jw,discussion-id=iHAzANPe,comment-id=0002000000000000,timestamp=2015-10-28T13:13:05.131+0000)\n>\n> non era per darti contro era semplicemente una mia idea che son pick da tryhard cmq hai letto lategame nel mio post? \n> ho parlato spesso di midgame  ma quasi mai di late non so se hai notato.. avere un'altro apcarry in late può essere decisivo ma devi arrivarci in late( e avere un top ed un jgl con ingage e che possano aiutare i carry del tuo team a non essere shottati)!\n> non volevo entrare nel dettaglio e si fanno molti danni di base rispetto ad altri midlaner ma non puoi paragonarmi la loro dipendenza dal gold rispetto ad ogni altro support....\n>  l'ulti di brand e di vel sono mostruose sopratutto se ci sono piu persone in lane (e in bot normalmente son 2 (Y) ). ed è per questo che sono 2 fra i support ap che mirano solo a killare l'avversario più utilizzati! e non sto dicendo che non facciano il loro sporco lavoro. ma se non vincono la lane rimangono molto più indietro di altri support! \n> \n> ps: mi hai citato il relay presupponendo che spendi 800 gold per il sight minimo 325/1100 per le scarpe ( minimo ovviamente poi dipende da contro chi hai e dalla strategia adottata ) mettiamoci altri 600 gold fra pozioni e pink ( e non è tanto con zyra) 375/875 di oggetto da support (sempre che tu non voglia partire di tomo) sono altri 3000 mila gold investiti in un'oggetto solo che offensivo che ti da 400 punti vita, senza utility nella costruzione apparte l'ap. dimendicando la dipendenza dal mana di zyra sopratutto in lane se vuoi avere un minimo di presenza.  quando conti di finire di costruirlo? mettendo pure che vuoi farlo come terzo oggetto dopo il sight e metà di quello da support. matematica. senza contare che spesso e volentieri su zyra si preferisce fare prima un po di penetrazione magica da maschera o scarpette. tu mi stai parlando di late game inoltrato o se lo fai come terzo oggetto di fine midgame.\n> avere un secondo apc in late è forte molto forte. zyra è uno dei champ che può ribaltare una partita grazie al suo output di danni, ma non pensare di avere sempre contro dei bot che ti regalano gold. e nota bene zyra ha due skill più la piantina per avere cc e l'ulti è qualcosa di eccezionale sia in engage che disengage. \n> brand ha uno stun che deve anche beccare,  vel gioca a bubbletruble insieme a nami. \n> sono ottimi pick ma in determinate situazioni se il mid e il jgl permettono di bullizzare la bot ed è una bot bullizzabile! \n> \n> zyra è una bulla in lane? si. zyra non ha escape? si. zyra è un'ottimo support? si, lo è contro determinate composition.\n> \n> \n> \n> non ho ben capito in cosa sei in disaccordo sul mio post potresti spiegarmi bene! \n> ricorda che non sto dicendo che non possono andare support, ma che non ritengo che carryino i game meglio di altri support e che posson essere pickati solo in precise composizioni con e contro!\n\nSemplicemente stavo spiegando meglio che tipo di campioni sono. Comunque non è mana hungry zyra, la W non consuma mana, solo la Q e la E, e se sei un buon giocatore di Zyra sai che la E non devi utilizzarla mai in lane, ma in rari casi perché ha un root di soli 0.75 secondi, non serve a molto e i danni sono molto bassi ( 50 ), consumi più mana che altro. Zyra ha un consumo in mana in lane come support infimo, non hai bisogno di mana regen. è vero che scaling bassi presuppongono penetrazione magica, per questo io ho quintessenze, rune rosse e 3 blu con penetrazione magica, a livello 3 con Q W W ( due punti a q ed uno a W ) tolgo il 50% degli hp all'adc avversario. Fa dei danni enormi, e anche se dovesse riuscire ad evitare la Q si beccherebbe minimo 2 attacchi dalle due piante, vale a dire il 10% degli hp + il zoning che ne consegue che non ti permette di farmare, perché se cerchi di farmare ti attaccano e non puoi fare molto. Personalmente per risparmiare soldi con Zyra preferisco potenziare il trinket giallo piuttosto che prendere le sightward, so che non è la stessa cosa, però se prendi Zyra è perché vuoi vincere rapidamente e le sightstone ti danno value man mano che vai nel late game, quindi se picki Zyra, Brand o Vel'Koz per me la Sightstone non riesce a darti un buon valore rispetto al prezzo che spendi, perché presupponi di vincere presto. Poi vabé, è vero che Zyra è il campione più lento del gioco, ma perché ha un forte Zoning e devi saper mantenere un buon positioning per poterla sfruttare appieno. Sinceramente, con la mia esperienza col campione, raramente subisco morti durante le gankate, è più probabile che ci muoia il jungler, come faccio 50% di danni al carry li faccio anche al jungler, cambia poco quando hai tutta quella penetrazione nelle rune, una mossa falsa e ti fai tripla molto facilmente contando che le piante ti aiutano un sacco.","replies":[]}]}]}]}]},{"poster":"Frattaglia","date":"2015-10-28T11:11:48.791+0000","up_votes":2,"down_votes":1,"body":"Guarda, sono main support e in ranked gioco prevalentemente support.\nÈ possibile carriare una partita da support però ti dò ragione sul fatto che è un ruolo un po' infelice dato che dipendi abbastanza dal tuo adc. \nL'altra cosa negativa è che in realtà spesso il lavoro del support non viene notato (a parte dal tuo adc) e quindi effettivamente sembra meno d'impatto dato che non sei tu la principale fonte di danno, etc etc.\n\nPerò se ti ci trovi bene e ti sembra di avere un grosso impatto sulle tue partite continua a giocarlo. :)","replies":[]},{"poster":"One Punch Morde","date":"2015-10-28T10:14:20.651+0000","up_votes":2,"down_votes":1,"body":"Support","replies":[]},{"poster":"73668109_DEL","date":"2015-10-28T19:43:28.783+0000","up_votes":1,"down_votes":0,"body":"Mid.\nPer il semplice fatto che il support ha una fase di linea che dipende ANCHE da un'altra persona.","replies":[]}]}