{"poster":"Pulastèr","date":"2015-09-10T08:20:21.145+0000","title":"Poppy Ultimate","subforum":"Campioni e gameplay","up_votes":1,"down_votes":0,"body":"Ho un dubbio riguardo la ultimate di Poppy.\r\nE&#039; pi&ugrave; efficace puntarla sull&#039;adc e usarla per scioglierlo in due attacchi o &egrave; pi&ugrave; conveniente cercare il membro del team avversario meno pericolso e piazzarla su di lui, perdendo il danno aggiuntivo al mio focus ma guadagnando l&#039;immunit&agrave; nei suoi confronti?","replies":[{"poster":"Arkanim94","date":"2015-09-10T09:50:58.101+0000","up_votes":4,"down_votes":0,"body":"( ringrazia il cielo che con il rework toglieranno quella ulti orribile )","replies":[]},{"poster":"Giacux","date":"2015-09-10T08:45:00.001+0000","up_votes":3,"down_votes":0,"body":"Assolutamente su quello meno pericoloso (dicasi al 99% il supporto). La forza nella ulti di Poppy non sta nel danno bonus, che in 1vs1 è però comodo, ma nell'immortalità.","replies":[{"poster":"Giovarco","date":"2015-09-10T11:54:55.720+0000","up_votes":1,"down_votes":0,"body":"Però dipende perché se quel support ha tantissimi CC, potrebbe non essere furbo. Meglio magari ultare il bruiser di turno che ha pochi CC.","replies":[]}]},{"poster":"SickAnto","date":"2015-09-10T08:32:23.595+0000","up_votes":2,"down_votes":0,"body":"Credo dipendi dalla situazione, ma per maggiori informazioni chiedi al Risotto.","replies":[]},{"poster":"Nibbio Bianco","date":"2015-09-10T09:33:46.179+0000","up_votes":2,"down_votes":1,"body":"In early game sull'adc, né lui ha troppi danni per scioglierti né tu hai troppi danni per scioglierlo senza la ultimate, in mid game dipende dalla situazione, in lategame con 8 secondi di ultimate hai tutto il tempo ed i danni di ultare su un tank o sul support per focussare i carry.","replies":[]},{"poster":"lokfrost","date":"2015-09-14T18:07:18.075+0000","up_votes":1,"down_votes":0,"body":"la ulti di poppy (se non sbaglio) ti fa diventare immune da tutti tranne dal bersaglio; quindi se vai addosso all' adc lui ti attaccherà e tu i danni te li prendi... anche se ridotti","replies":[]},{"poster":"anagoor","date":"2015-09-10T09:33:20.886+0000","up_votes":1,"down_votes":0,"body":"Sinceramente ti consiglio di usarla sul tank di turno.\nIl motivo è;\nadc: troppi danni\napc:troppi danni\nsupport: troppi cc\nvari tank: hanno cc ma devono usarli sui vostri carry.","replies":[]},{"poster":"luxetumbra","date":"2015-09-10T08:51:14.905+0000","up_votes":1,"down_votes":0,"body":"il target perfetto per la r di poppy è il nemico con meno cc e meno pericoloso.\nin un fight non è sempre positivo usare la r sul support soprattutto se questo è una janna o un thresh, poichè potranno bloccarti coi loro cc fino al termine della r rendendola inutile, il target perfetto per la r di poppy potrebbero essere un shyvana o un garen che si hanno danno ma tenderanno a non focussare poppy e non hanno reali cc per fermarla durante la r.","replies":[]}]}