{"poster":"Pulastèr","date":"2015-03-23T17:36:19.335+0000","title":"Top Lane?","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Salve a tutti.\r\nUltimamente mi sto dilettando nel giocare Top Lane e non riesco a capire perfettamente quale sia il mio ruolo all'interno del team. Se per gli altri ruoli è abbastanza facile (almeno, per me lo è), la varietà di possiiblità che la top da (Tank, bruiser, assassino, Ap tank dannoso ecc ecc) non riesco a  intuire facilmente cosa io debba fare e spesso rischio di sbagliare (Urgot engager o dps OP annienta armature? questo è il dilemma).\r\nInsomma, cosa fare?\r\nPenso che il problema sia anche che non riesco a trovare un Top Laner che mi ispiri particolarmente, lo stile di gioco della maggior parte dei top laner mi annoia abbastanza (Garen, Darius, Renekton, Nasus, Tryndamere) e insomma, non ho ancora trovato un campione che sia davvero interessante da giocare (uso Urgot e Riven, due campioni abbastanza tosti da apprendere decentemente e che quindi non mi sento di portare in ranked). Qualche consiglio? Pensavo a Kennen ma non sono sicuro funzioni bene in top lane.\r\nGrazie per l'attenzione, buona giornata!","replies":[{"poster":"Ryuk1980","date":"2015-03-24T14:39:07.711+0000","up_votes":1,"down_votes":0,"body":"Da parte mia posso consigliarti: \nNasus: se lo giochi bene oltre ad essere tankoso shotti con la Q, sia nemici che torri\nIrelia: altro top molto forte. In teamfight focussi ad carry o l'ap carry e gg.","replies":[]},{"poster":"justbox2","date":"2015-03-23T21:48:54.808+0000","up_votes":1,"down_votes":0,"body":"Allora io faccio il topper e lo faccio anche bene faccio quasi sempre positivo ed io uso lee sin xin o xerath ma il migliore è xin davvero fa paura se fidda,comunque io ti consiglio come ho fatto io cerca un Champion che ti diverte così giochi più spensierato e chiedi quando sei in difficoltà l'aiuto del jungler. Io ti consiglio molto Xin che fa paura","replies":[]},{"poster":"ArsSoIum","date":"2015-03-23T21:15:25.015+0000","up_votes":1,"down_votes":0,"body":"{{champion:120}} \nUltimamente vedo degli Hecarim top.\nCome oggetto da danno solo triforza e per il resto tutto tankoso.\nFai danni e sei utile al team essendo tankoso.\n-Oggetti danno {{item:3078}} {{item:3156}} (il secondo se sei contro ap feedati o forti)\n-Oggetti tanky {{item:3068}}  {{item:3143}} {{item:3102}} \n-Boots {{item:3111}} / {{item:3047}}  / {{item:3117}} \n-Spells {{summoner:6}} {{summoner:12}}  \n\n{{champion:105}} \nPoi c'è (che si usa sempre ultimamente) Fizz ad top.\nChe come ho letto sul forum utilizzando W e Botrk toglie l'8% della salute massima.\n-3 oggetti danno {{item:3153}} {{item:3078}} (obbligatori) {{item:3172}} (per ultimo)\n-2 oggetti tank {{item:3143}} {{item:3102}}  (poi dipende se giochi contro tutti ad o ap)\n-boots {{item:3047}} / {{item:3111}}  ma c'è anche chi fa {{item:3158}} \n-Spells {{summoner:12}} {{summoner:14}} \nFai prima botrk, poi triforza, poi oggetti tanky e finisci con zefiro.\n\nSia chiaro, entrambi per usarli top devi saperli usare bene.\n\nPoi ti suggerirei anche {{champion:14}} con hydra e poi tutto tank (anche la sua E fa danno, non sottovalutarla).\n\nSpero che ti sia stato d'aiuto.","replies":[]},{"poster":"whatwhywho","date":"2015-03-23T17:59:55.784+0000","up_votes":1,"down_votes":0,"body":"Kennen in toplane fa la sua porca figura, contando che è piuttosto sottovalutato (soprattutto in early).\nSe ti piace lo stile di gioco di riven ti consigli caldamente campioni facili da usare ma difficili da apprendere completamente (zed, Yasuo, Kha'Zix)\nTra i più divertenti per me ci sono Jayce, debolissimo in early ma in mid/late game è devastante, Gnar con un team fight Buonissimo. Al momento è in meta Hecarim top con ottimi cc, Wukong come Gnar è un ottima risorsa per il team nel lategame anche perchè riesce a fare danni considerevoli con pochi oggetti offensivi (Renekton). Noto, poi che non hai menzionato Jax, forse uno dei campioni più forti in toplane, che, può far schifo pre 6, ma questo è il suo unico problema, ottima resistenza con l'ultimate, può disintegrare un carry con pochi attacchi, ed è un ottimo splitpusher.\nSe cerchi degli Ap top, fondamentali Rumble e Vladimir con ottimi dps (vladimir soprattutto per il late-game) Maokai sarebbe perfetto se il tuo team non ha un Tank (la tua ultimate riduce i danni subiti dal team). \nGli ultimi che mi vengono in mente sono Irelia e Jarvan, entrambi con altissimi danni e quasi immortali lategame. Altri Ap tank sono Shen, Mordeaiser, Gragas, Singed (ora un po deboluccio), Cho Gath/ Ryze","replies":[]},{"poster":"wilboshh","date":"2015-03-23T17:54:39.618+0000","up_votes":1,"down_votes":0,"body":"Io ti consiglio i miei 3 top main : Maokai, Cho'gat e Sion.....\nSono tutti e 3 ultraciozzi, se la partita ti va bene fin da subito e scegli di buildarli con danno fai i macelli, e comunque portano tutti e 3 ottima utility al team e sono divertenti anche da giocare.","replies":[]},{"poster":"Pasticcionex","date":"2015-03-23T17:53:57.771+0000","up_votes":1,"down_votes":0,"body":"kennen si usa top anche perchè il ruolo del toplaner (almeno per me) è quello dell' engage quindi kennen worka top","replies":[]}]}