{"poster":"Pulastèr","date":"2015-03-28T19:17:14.826+0000","title":"Promo?","subforum":"Mappe e modalità","up_votes":1,"down_votes":0,"body":"Ma c&#039;&egrave; qualcosa di diverso nei matchmaking delle varie Promotion?\r\nNon mi piace (e non lo faccio praticamente mai) lamentarmi dei miei compagni di squadra ma ho notato che nelle promo le squadre sono sempre squilibrate, del tipo che ieri per fare Silver IV - Silver III mi sono beccato team del tipo: Squadra mia tutti silver e un bronzo; squadra avversaria tutti silver e due gold.\r\nIl fatto &egrave; che &egrave; qualcosa come la quinta volta che faccio questa maledetta promo e ogni volta la stessa storia. Arrivo con anche 4/5 vittorie di fila alla promotion e poi finisco sempre 2 - 1 per le sconfitte (la maggior parte delle volte per una disparit&agrave; di abilit&agrave; tra i due team ) e via di altri game.\r\nInsomma, c&#039;&egrave; qualche cosa da sapere approposito?","replies":[{"poster":"Dantazzo","date":"2015-03-31T06:55:46.188+0000","up_votes":1,"down_votes":0,"body":"La promo per il platino l'ho dovuta fare 4 volte, e l'anno scorso quella per il gold 4 l'ho dovuta rifare 7 volte, quindi sì anche secondo me in promo è più probabile che ti capitino idioti su idioti","replies":[]},{"poster":"Pulastèr","date":"2015-03-30T18:53:36.103+0000","up_votes":1,"down_votes":0,"body":"Mannaggia oh  quinta promo persa.\nNon è nemmeno una questione di capacità, perchè vinco agievolmente le partite pre promo.\nPunto ad uscire da Silver IV alla decima. Dai.","replies":[]},{"poster":"Oaken Arrow","date":"2015-03-28T19:48:46.305+0000","up_votes":1,"down_votes":0,"body":"Quel poco che so io è che in promo ti dovrebbe capitare un abbinamento leggermente più sfavorevole a livello di MMR, perché in teoria il sistema vuole metterti alla prova per il livello successivo.\nTieni anche conto che a volte un rank più alto non vuol dire necessariamente un MMR più alto.\nPer il resto si tratta spesso di fortuna, come sempre ;)","replies":[]}]}