{"poster":"potato support","date":"2015-06-21T22:26:08.340+0000","title":"skins de los eventos PAX para LAS","subforum":"Charlas Generales","up_votes":1,"down_votes":5,"body":"Como sabemos, en EE.UU hay un evento llamado PAX en las cuales a los que atendieron al evento se les dieron skins limitadas de jax/tf/sivir, estos codigos se podian utilizar una vez en cada una de las otras regiones (NA/EU/KR/ETC) pero riot desactivo los codigos de estas skins.\r\n\r\nA lo que voy es que hay personas de otros continentes que no atendieron a este evento de EE.UU que pudieron conseguir estas skins mediante el uso de los codigos de NA, pero las personas que estamos en los nuevos servidores no tuvimos ni un 1% de posibilidad de conseguirlas (a menos que haya sido por transferir de region la cuenta).\r\n\r\nestas no son skins que se &quot;compraban&quot; por lo cual el argumento &quot;pagaron por la skin limitada&quot; no tiene valor.\r\n\r\nhay alguna manera de que estas skins puedan entrar en el servidor de las?","replies":[{"poster":"Escualo","date":"2015-06-21T23:38:35.704+0000","up_votes":2,"down_votes":0,"body":"Todos los códigos de los skins de Pax estan actualmente desactivados, asi que no creo que puedan estar disponibles en el servidor de LAS. Además al ser skins limitados, dudo que puedan estar disponibles en el futuro.","replies":[{"poster":"potato support","date":"2015-06-22T00:02:07.860+0000","up_votes":1,"down_votes":2,"body":"estas diciendo lo que ya puse, literalmente.\n\nprincipalmente estoy buscando la respuesta de un rioter, que sabe mas sobre esto que todos nosotros.","replies":[]}]},{"poster":"Troy McClure","date":"2015-06-21T23:22:32.227+0000","up_votes":1,"down_votes":0,"body":"En un subforo de Reddit regalaban codigos, entre esos codigos estaban los de pax c:\nCreo que en china no estan disponibles a pesar de ser un server nuevo donde tienen a urf warwick, blitzcrank oxidado y todas las skins que ya no se pueden conseguir. Si no llegan a China no creo que lleguen a ningun otro servidor","replies":[{"poster":"potato support","date":"2015-06-23T03:34:59.235+0000","up_votes":1,"down_votes":0,"body":"los servers de china y de cierta manera el contenido son manejados por tencent.\n\npor eso el precio del rp y los skins son diferentes tambien.","replies":[]}]},{"poster":"lordeman10","date":"2015-06-22T19:12:35.535+0000","up_votes":1,"down_votes":0,"body":"con ese criterio tendrían que habilitar otras muchas skines que perderían su valor de colección, hay cosas para las que uno no está destinado y ya fue..","replies":[{"poster":"potato support","date":"2015-06-22T19:24:24.790+0000","up_votes":1,"down_votes":0,"body":"no estoy hablando de algo que solo \"un par de elegidos\" pudo conseguir, como black alistar/king rammus/ufo corki/etc.\n\nestas skins estaban habilitadas para ser usadas multiples veces, una vez en cada uno de los demas servidores siendo un evento limitado para EE.UU. \n\nson skins que fueron regaladas, ni como si fuera que las personas que las tienen las pagaron para tener el item \"exclusivo\". (\"exclusivo\" porque los codigos podian ser utilizados multiples veces\")","replies":[{"poster":"Escualo","date":"2015-06-22T19:36:55.773+0000","up_votes":1,"down_votes":0,"body":"Si no me equivoco los códigos de los skins de PAX (pax tf, pax jax, pax sivir) eran de un solo uso, solo que después cuando salieron los códigos que entregaban en el PAX pero que daban skins como arcade hecarim, eran multi server y de multiples usos también.","replies":[{"poster":"potato support","date":"2015-06-23T02:51:30.878+0000","up_votes":1,"down_votes":0,"body":"las skins de pax eran de un uso por server. Personas que usaron el skin en NA se las dieron (o vendieron) a personas en los servidores europeos/koreanos/etc.","replies":[{"poster":"Escualo","date":"2015-06-23T03:07:58.473+0000","up_votes":1,"down_votes":0,"body":"Pero digamos que eso se hacia a través del soporte, mandando foto de la tarjetita del codigo con nombre de invocador y todo eso, automaticamente no andaban en otro server, al menos asi creo que fue con el de pax TF","replies":[{"poster":"potato support","date":"2015-06-23T03:29:53.049+0000","up_votes":1,"down_votes":0,"body":"la diferencia con pax tf es que el servidor de EU era manejado por una empresa diferente en ese momento.","replies":[]}]}]}]}]}]},{"poster":"Funes7","date":"2015-06-22T18:27:24.830+0000","up_votes":1,"down_votes":0,"body":"ojala algun menganito responda","replies":[]}]}