{"poster":"ThxForLBRevert","date":"2015-07-15T15:59:54.954+0000","title":"Sinnlose Bestrafung","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":2,"body":"Es war kurz nach dem starten eines SoloQ spiels und was geschah? Der LoL-Launcher crached immer und immer wieder sodass ich dem Game nicht beitreten konnte. Es war das erste mal das mir soetwas passiert und dann bekomme ich direkt f&uuml;r 5 Spiele diese Low Priority Queue.\r\nDas l&auml;cherliche ist das ich dann nach 17 min oder so dem Game joinen konnte aber ich trotzdem diese Strafe bekommen hab, obwohl ich nichts daf&uuml;r konnte und ich so schnell wie m&ouml;glich auch gejoint bin...","replies":[{"poster":"Donzen","date":"2015-07-15T16:13:31.848+0000","up_votes":3,"down_votes":0,"body":"Es ist deine Aufgabe dafür zu Sorgen, dass du ein Spiel sicher spielen kannst und wenn dies nicht passiert, dann kann man schon nach einem Spiel in der Warteschlange mit niedriger Priorität landen, wobei Ranked Leaves härter bestraft werden.","replies":[]},{"poster":"ThxForLBRevert","date":"2015-07-15T16:18:31.428+0000","up_votes":1,"down_votes":6,"body":"ES WAR NICHT MEINE SCHULD WIE GESAGT ES WAR DAS ERSTE MAL UND ICH HATTE DAS NIE DAVOR!","replies":[{"poster":"Darkr3sQ","date":"2015-07-15T16:26:50.260+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=JewleZ,realm=EUW,application-id=KYnfKGf0,discussion-id=UE1EvRN9,comment-id=0002,timestamp=2015-07-15T16:18:31.428+0000)\n>\n> ES WAR NICHT MEINE SCHULD WIE GESAGT ES WAR DAS ERSTE MAL UND ICH HATTE DAS NIE DAVOR!\n\nDu brauchst hier nicht zu schreien...\nWenn es wirklich dass erste mal war, wo Du ein Spiel verlassen hast, oder AFK warst, dann bekommst Du nicht direkt die Low-Priority-Queue. Du bekommst erst einmal diese Meldung, Die Du bestätigen musst. Offenbar hast Du vorher shcon mal ein Spiel verlassen oder warst AFK.\nDarüber hinaus ist es durchaus Dein Bier, dafür zu sorgen, dass dein System, auf dem Du LOL spielst, einwandfrei läuft. Wenn Dir der Launcher abschmiert, ist das blöd. Wenn er Dir das erste mal abschmiert, ebenfalls. Aber Deine Mitspieler können genauso wenig was dafür. Deine Aufgabe ist es, zu schauen wo das Problem auftritt. Das machst Du am besten in Bot-Games. \nWenn Dein Launcher wieder richtig läuft, kannst Du dann wieder die normalen oder Ranked Games zocken.","replies":[]},{"poster":"Donzen","date":"2015-07-15T16:27:01.069+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=JewleZ,realm=EUW,application-id=KYnfKGf0,discussion-id=UE1EvRN9,comment-id=0002,timestamp=2015-07-15T16:18:31.428+0000)\n>\n> ES WAR NICHT MEINE SCHULD WIE GESAGT ES WAR DAS ERSTE MAL UND ICH HATTE DAS NIE DAVOR!\n\nDein LoL ist also gecrashed und wenn das passiert, dann ist es deine Sache. Es gibt viele in der Community, die dir bei deinem Problem bestimmt gerne helfen. Vor allem die Wrenchmen, die sich ja freiwillig auf technische Probleme konzentrieren, helfen dir sicher bei deinem Problem. Durch Capslock werden deine Sätze außerdem nicht überzeugender.","replies":[]}]},{"poster":"BlackRockCosmo","date":"2015-07-15T17:07:04.076+0000","up_votes":1,"down_votes":1,"body":"Hey :)\nDas Problem hatte ich als ich grad neu mit lol angefangen hatte auch :/\nich wurde zwar nicht gleich so hart bestraft aber dennoch wurde ich eindringlich darauf hingewiesen nie wieder afk zu sein, obwohl ich nicht absichtlich, sonder auch durch einen Bug dem Spiel nicht beitreten konnte ...\nIch bin von den Bestrafungen in lol auch nicht unbedingt überzeugt.\nIch zum Beispiel, mache Spieler die flamen oder Provokant sind auf ihr Verhalten aufmerksam bevor ich sie reporte, ich werde dabei nicht böse, flame nicht zurück und beledige auch niemanden, dennoch reported mich danach eben diese Leute die ich während des Spiels gebeten habe nicht zu flamen \nWeswegen ich auch schon Mitteilungen von Riot bekommen habe.\nDeswegen find ich es schade dass Riot nicht gesondert auf die Reports eingeht und ergründet warum diese ausgesprochen werden.\nDenn ich hatte auch schon Leute im Spiel die Jeden einfach aus spaß reported haben ...\nIch finde es schade aber ich kann auch verstehen dass lol mit diesen vielen Spielern und den vielen games jeden Tag nicht auf alle eingehen kann, aber dennoch würde ich mir wünschen dass man die echten, von den troll reports unterscheiden würde, bzw. ( wie bei dir ) die Gründe des AFK seins :/","replies":[{"poster":"Darkr3sQ","date":"2015-07-15T19:36:09.369+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=BlackRockCosmo,realm=EUW,application-id=KYnfKGf0,discussion-id=UE1EvRN9,comment-id=0003,timestamp=2015-07-15T17:07:04.076+0000)\n>\n> Hey :)\n> Das Problem hatte ich als ich grad neu mit lol angefangen hatte auch :/\n> ich wurde zwar nicht gleich so hart bestraft aber dennoch wurde ich eindringlich darauf hingewiesen nie wieder afk zu sein, obwohl ich nicht absichtlich, sonder auch durch einen Bug dem Spiel nicht beitreten konnte ...\n> Ich bin von den Bestrafungen in lol auch nicht unbedingt überzeugt.\n> Ich zum Beispiel, mache Spieler die flamen oder Provokant sind auf ihr Verhalten aufmerksam bevor ich sie reporte, ich werde dabei nicht böse, flame nicht zurück und beledige auch niemanden, dennoch reported mich danach eben diese Leute die ich während des Spiels gebeten habe nicht zu flamen \n> Weswegen ich auch schon Mitteilungen von Riot bekommen habe.\n> Deswegen find ich es schade dass Riot nicht gesondert auf die Reports eingeht und ergründet warum diese ausgesprochen werden.\n> Denn ich hatte auch schon Leute im Spiel die Jeden einfach aus spaß reported haben ...\n> Ich finde es schade aber ich kann auch verstehen dass lol mit diesen vielen Spielern und den vielen games jeden Tag nicht auf alle eingehen kann, aber dennoch würde ich mir wünschen dass man die echten, von den troll reports unterscheiden würde, bzw. ( wie bei dir ) die Gründe des AFK seins :/\n\nBezüglich der Meldungen, die Du bekommst wenn Du übersdurchschnittlich oft reportet wurdest:\nSie sollen lediglich darauf aufmerksam machen, dass an eventuell mal auf sein Verhalten schauen sollte, da man relativ oft reportet wurde.\nDiese Reports sind bei der Meldung aber allesamt noch nicht verifiziert, und außer der Meldung hast Du erst einmal keine Sanktion. Erst wenn Du einen Schwellwert (Anzahl reporteter Spiel im Verhältnis zu den gespielten Spielen) prüft die Chatanalyse die Reports. Wenn kein Fehlverhalten vorliegt, wirst Du nicht bestraft, liegt Fehlverhalten vor, bekommst Du entsprechende Sanktionen.\nReportet ein Spieler häufig einfach so, sinkt sein Reportgewicht, und seine Reports führen im schlimmsten Falle dann zu nichts mehr.\nSomit hat man schon einen entsprechenden Schutz bei den Reports aufgebaut.\nDie AFK-Problematik ist von den Reports losgelöst. Hier existiert der Leaverbuster, der nicht nur eindeutige Leaves erkennt, sondern auch AFK-Verhalten. Dies wird dann entsprechend sanktioniert mit der Low-Priority-Queue. Dass Du recht früh schon eine entsprechende Meldung bekommst, dass Du in Spiel nicht verlassen solltest, dient einfach nur dazu, dass man als Spieler sich sehr schnell bewusst wird, dass das Verlassen des Spiels kein Kavaliersdelikt in LOL ist. \nBei Bugs ist es halt so eine Sache. Wie soll man einwandfrei erkennen, dass das Spiel abegstürzt ist, oder einfach nur das Internetkabel gezogen wurde.","replies":[{"poster":"BlackRockCosmo","date":"2015-07-16T12:08:49.519+0000","up_votes":1,"down_votes":0,"body":"Ah vielen Dank :)\nich hab mir echt schon sorgen gemacht weil ich mich eig. wirklich nur für eine freundliche LoL community einsetzten möchte :)\nDanke für die Hilfe !","replies":[]}]}]},{"poster":"Madchickendinner","date":"2015-07-15T16:09:50.466+0000","up_votes":2,"down_votes":0,"body":"Und jetzt?","replies":[]},{"poster":"gonzo779","date":"2015-09-20T14:41:47.263+0000","up_votes":1,"down_votes":0,"body":"Fakt ist in diesem Fall das klüge Sprüche nicht helfen. Sondern eine Lösung her muss. Entweder ist deine Leitung zu schwach was ich bezweifle. Oder dein PC überfordert. In beiden Fällen kann es zu Störungen kommen. Versuche diese zu lösen und gut. Dazu gehört natürlich auch mal zu testen ob bei anderen Online Games das selbe Problem besteht. Falls nicht eventuell LOL deinstall und noch mal von vorne beginnen. Sprich install und schauen ob es dann geht. Kleiner Tip. ein PC ist nur eine Maschine um so besser du dich drum kümmerst um so besser und länger hält er. Gilt aber nicht für Viren Verseuchung. Ich denke mehr muss man nicht erklären. Wie gesagt versuche deine Probleme erst am eigenen PC zu lösen. PS: gelentlich mal sauber machen. haste weniger Stauwärme.","replies":[]}]}