{"poster":"Youmi","date":"2016-06-02T14:00:32.327+0000","title":"First time doing one of these, well... yeah. Leibya, The Cursed Swordsman","subforum":"Player Creations","up_votes":1,"down_votes":0,"body":"Just a General idea of what I&#039;ve been thinking of, might flesh out the ideas of the skills more or maybe even get a drawing done, who knows, depends how bothered I can get with it. anyway, here&#039;s the current stuff I have for this idea O&#039; mine.\r\n\r\nLeibya, The Cursed Swordsman\r\nIdea: Jungler/Top Laner\r\n\r\nInfo: Originally from Ionia, now is a wanderer trying to find a way to break the curse.\r\nFound sword in a hidden cave in Ionia, when he grabbed it\r\nnothing seemed wrong at first, but the more people he fought using it, \r\nthe more it started to take over his body (starting from his left hand)\r\nWent to talk to elders and they gave him the sheath to try to cancel out the swords curse\r\nsheath only limits the curse to not spreading further.\r\n\r\n\r\nPassive: \r\n   Cursed Sword and Holy Sheath(? not final name):\r\n   While sword is sheathed, basic attacks deals 80% damage, \r\n   with a three hit minor slow (25% slow for .25s?) that can be done on champions \r\n   every 5 seconds after it&#039;s been triggered. With sword out he will deal \r\n   120% damage with basic attacks, but with no slow.\r\n\r\nQ: Demonix Grip:\r\n   Leibya reaches infront of him with cursed hand, grabbing first enemy unit hit, \r\n   if this skill hits a wall, the hand will &quot;phase&quot; through the wall, giving him extra range, \r\n   on hit with an enemy after .5s he will pull enemy towards him, if it was through a wall\r\n   he will stun the unit when it collides with the wall infliting damage, \r\n   if not they will just recieve a slow after reaching him.\r\n   If he reactivates the ability before 0.5s he will instead go to his enemy, \r\n   if through a wall he will &quot;phase&quot; through the wall and jump at his enemy.\r\n\r\nW: Sheath Decimation:\r\n   [Sheathed] Leibya smashes the ground in front of him, \r\n   causing the ground to fracture and puncture upwards. (range ???)\r\n   and are hit for (x) damage, depending on how many enemies hit gain (x+y+z)\r\n   shield (x = creeps, y = jungle mosters/epic monsters, z = champs)\r\n\r\n   Dance of Blades:\r\n   [Unsheathed] Leibya can dash a certain distance towards an enemy (low cd) \r\n   if recast a total of 3 times, \r\n   will transport to where sheath was thrown (within certain range)\r\n\r\nE: Waves of Darkness:\r\n   Leibya shoots a dark energy wave in targeted direction, upon hitting an enemy or after a\r\n   certain range, the skill will explode in a small area, stunning the main target and slowing\r\n   any others hit within the small explosion and inflicting minor damage to all\r\n   enemies hit, Leibya can not move when he casts this ability.\r\n\r\nR: Unsheathing Horror:\r\n   Leibya draws the sword out of the sheath (global, knocking back friendly \r\n   and enemy units near him then will throw the sheath to a part of the map\r\n   (his choice aka skill shot (cant be cc&#039;d during this part?)) \r\n   Where the sheath lands creates a slow field (zyra ult size?) and within that\r\n   slow field there is also a GROUNDED area (maybe half the size, inside/outside half?)\r\n   Upon re-enerting inner circle near sheath, will resheath sword causeing \r\n   AoE damage within the range of the inner circle. \r\n   (Costs HP to use, will only get 1/2 cost back within certain time frame?)\r\n\r\nwouldn&#039;t mind hearing your guys and gals thoughts about this, and what may or may not need to be changed.","replies":[{"poster":"Youmi","date":"2016-06-12T13:39:02.981+0000","up_votes":1,"down_votes":0,"body":"I actually never knew of \"Ronin the Cursed Blade\" before your post :O also, his form of character is an assasin/very high DPS champion with quick and easy escapes or engages, and very easy pick off potential. Leibya, on the other hand, is meant to be more of a bruiser jungler (who can also, yes, top lane) and if you think about it, Ronin's kit is really crazy overpowered, Leibya's is strong, but it has counterplay, the q is relatively short ranged (being only a bit larger than Darius's hook range, and a straight line skill shot) the only part that is different about it than a normal short ranged hook is the fact of it going over walls. the W is maybe half of the new Zyra Q range (i mean that literally, the sideways hitbox is what i was thinking for the sheathed W hitbox) and it gives him a small-ish shield (thininig it might scale up a bit with bonus hp but idk, haven't thought too much about it yet) and the unsheathed is a low-damage sticking on them carries dash that cant be used as an escape (where ronin could easily escape) his E literally roots him to the spot while he casts it, so if the enemy jungler happens to see you, well, you gunna lose HP boy. and his ult is probably the only crazily stupidly strong thing about him, but i'm still thinking about how to tune it down a bit while still allowing it to be an integral part of his kit.\n\nbut all in all, thanks for the reply and the knowledge of someone else's idea, i'll probably end up thinking of a way to make him less like Ronin cause yes, i can see parts that are similar.\n\n~Raiven\n\nOn a side note, a friend said that he might do a sketch-up of Leibya if he has the time spare. He's also the one that came up with the name  :D","replies":[]},{"poster":"Adelrift","date":"2016-06-10T18:05:08.323+0000","up_votes":1,"down_votes":0,"body":"Look up \"Ronin the cursed blade\" and although there are differences in abilities, there is a similarity in mechanics (sheathed/unsheathed, etc.) and it even has \"cursed\" in the name. I really like your input on the abilities though. Unfortunately he has too much in his kit. I think many people do this in their submissions. Other than that, I like the thematics of the character, except for the sword.","replies":[]},{"poster":"Youmi","date":"2016-06-07T10:32:41.033+0000","up_votes":1,"down_votes":0,"body":"ahahaha, It's Pronounced Ley-Be-yah so I can see where you could see it as being pronounced as Labia, how about the rest? any thoughts on it?\n\n~Raiven","replies":[]},{"poster":"Essembie","date":"2016-06-07T05:12:24.471+0000","up_votes":1,"down_votes":0,"body":"Sounds a bit like labia.","replies":[]},{"poster":"Youmi","date":"2016-06-07T01:24:20.622+0000","up_votes":1,"down_votes":0,"body":"Hey Dark, sorry about the 3 day late reply, your comment just never showed up before today for some reason, anyway, THANKS FOR THE AMAZING COMMENT OH MY GOD, like, I can't believe how much you actually wrote for this O_O.\n\nAnyway, I'll start re-breaking this down again and everything...\n\nALSO before I go any further I was thinking that he would be a lot like Aatrox in a way where he uses HP for his costs instead of mana, I mean, to be honest Aatrox isn't that good if he falls behind (which can happen a lot) but Leibya can keep pace even if he falls behind with decent CC, and a bit of damage to top it off.\n\n(FYI, also gunna talk a bit about the ult here)\nWith the passive yeah I feel what you're coming to, the power from the ult with a major link to the passive is pretty harsh, I'll admit I was just going to have it with the slow passive but I felt like the unsheathed blade needed something, and it was all I could come up with. Thinking about it now though, it does seem a bit weird, but I didn't want to have a \"lets just add another transforming champ into the game and give them that transformation at level 1\" you know? I think if i toned down the ult a bit and gave it a bit of the recast ability then it'd work out quite well, but I don't want him to be another \"generic\" transforming champ. (sorta want him to be a bit like the Nidalee of ye' olde times o7) So changing the passive may be in the works soon... I'll get to it.\n\nWith the Q, I wasn't thinking crazy long grab range *cough* blitz, naut, thresh, IM LOOKING AT YOU BOIZ *cough cough* I was thinking a bit longer than the Darius pull range at most TBH, and maybe with a lower range at lvl 1 and increased range at lvl 5, sorta like how trist's passive increases her range a little bit. but with the added feature of the wals to extend the range, it could make an interesting playstyle with certain champs (Aniv, J4, Taliyah etc).\n\nWith the W, The sheathed version I'm really happy about, but I wasn't thinking generic stlye hitbox of \"oh, i'mma just make a bit of a cone in front of me and that'll be the hitbox\" I was more thinking along the lines of \"It smacks a bit in front of him, then goes sideways and a  bit more forwards\" so that way it has an easier AoE on jungle creeps, but a bit harder to land it on multiple champs in a teamfight. and if they decided to take him top, it could be a bit of a wave clear-ish move but would reqiure him to put himself in a bad position which would open himself to ganks #CounterPlay.\nAnd the unsheathed version I was thinking a bit along the lines of a yasuo dash where it's targeted, but with a bit of a shorter range with the 3rd activation getting increased range but a blink to the sheath's location if it's within that range, I could give it that he can choose whether to blink to a champ or  sheath on the third, but I'm not making it another Broken Wings form of \"engage or GTFO\" skill.\n\nThe E.... yeah, I like how it could be just a raw damage while unsheathed, gives his unsheathed form a lot more \"raw damage\" without the CC, I don't really think there's much to talk about here though so... next!\n\nThat ultimate, yeah I really don't like the generic feel of the transforming champs (I like the Gnar feel, but not really the others), they feel... just.. lackluster? I dunno how to say it, and so I'm trying to think of how Nidalee used to work, how she got her ult at lvl 6 and it scaled up a bit. I mean, honestly, those were the days that I really liked Nidalee, where levels 1-5 you were playing her mid or top while having to be careful with your positioning, and after 6 is when you could basically land a spear, r flash w q and they'd be dead. where with Leibya, you land the stun, throw ult, get a dash off and just smack them in the face till they die. and with the \"global\" i meant the sound of him pulling the sheath off the sword so that the enemy would know that he's unsheathed it and play around that, not the \"hurr durr durr i can throw my sheath from top lane to bottom lane kek\" I was thinking of giving it a throw range, I just haven't thought of how large to make it yet. But adding a way that if he picks it up he can reactivate the ability, maybe reduce the CD of it to 1s after resheathing, definitely a good idea, gives him more of the \"defence or offence\" playstyle which I think he should be.\n\nOverall, I'm really happy with your reply, and will definitely start to rethink and rework some of those abilities!\n\n_(also, if you're wondering, the reason I've made his skill set quite wordy and lengthy is cause I play a LOT of Jhin xD)_\n\n~Raiven","replies":[]},{"poster":"DarkGate","date":"2016-06-04T12:02:28.229+0000","up_votes":1,"down_votes":0,"body":"Interesting champion Concept i like the passive, having a trade off between two states that gives a varied playstyle and presents counterplay in each regard.  solidifying the two stances into differing play styles such as Elise, Nidalee, Jayce etc. the divide between ranged and melee is a little over done so seeing one that differs in terms of skill sets and play is nice. However linking the passive to a powerful ult makes the ability somewhat lackluster.\n\nPerhaps having very distinct differences between Sheathed and Unsheathed. Say increased movement speed and damage but decreased armor or a health drain (Like Aatrox's auto attacks) while unsheathed. and slowing attacks (with a cd) while sheathed. \nthat would represent a defencive form while sheathed and an offencive form with unsheathing. \n\nThe Q i personally love it presents new gameplay with significant versatility a short range grab attack that can go through walls. cool mechanic and an excellent mechanic for a jungler to have that gives them a little mobility with the reactivation component.  it does lack an element of counterplay but it is unassuming ability which isn't game breaking so while situationally getting caught through a wall would suck or having Leibya escape through a wall it requires planning like a Lee Sin Q.\n\nThe W looks solid. sheathed an Aoe Damaging attack that Shields Leibya, as such it rewards entering the fray and fighting in a populated area, good for teamfights and early sustain in the jungle. \nUnsheathed its a Dash attack, i would personally tie the Recast of this ability onto the pretext of hitting an enemy with the ability otherwise it would be 3 dashes that could be used as a gap closer or an escape with little counterplay other than hard CC. Like Riven's Broken wings, which we can all agree was just not fun to play against.  having to land an attack with the W results in a skillful 2 - 3 dashes or a wiff and leaving Leibya vulnerable giving a distinct power lul. \n\nThe E i like though it perhaps including a slightly different version of the ability while unsheathed (perhaps just a raw damage ability) that would further differentiate the difference between Sheathed and Unsheathed.\n\nAs for the Ultimate i think that this ability could be toned Down and be given for free at level one (like all the other transforming champions ~~Le Sigh~~) \nbut consider this a transforming ability that can only be cast to enter the Offencive form. throwing the Sheath a short distance (perhaps force it to land at max range) that deals a small amount of damage, but to re enter Sheathed form.  Leibya must go back and pick up the Sheath, Die, Or wait a long period of time 30 seconds or so, picking up the sheath would allow Leibya to unsheath again immediately. \n\nThis puts allot of meaning into transformation choices because it acts as a commitment like a Gnar Transformation but with slightly more agency, rather than being forced to transform with playstyle, the player commits to a playstyle for however long until they can pick up the sheath. this also presents counterplay if Leibya unsheathes do you engage while he doesn't have access to his defencive kit do you prevent Leibya from recovering the sheath with your own aggression and positioning. does the Leibya player throw the sheath behind them so that that cannot occur but sacrifice the choice of switching forms while in combat. \n\nOverall i think the champion concept is interesting and distinct, having a champion who has a distinct playstyle and interesting abilities with noticeable power spikes this would make for interesting play for both Leibya and the opposing team. \n\nDark","replies":[]}]}