{"poster":"Knalxz","date":"2015-01-18T07:41:34.224+0000","title":"Should Riot rework Lee Sin now that they can properly represent a blind champion?","subforum":"Gameplay","up_votes":84,"down_votes":9,"body":"I'm actually asking this and not as a joke. Making him like Rek'sai with only gaining vision from wards, allies and his own abilities. Rearranging Tempest so it gives him a type of vision like Rek'Sais tremor sense and actually feeling the whole blind monk feel. \n\nBTW maybe a bit of an update for the monks looks. He's not the most terrible looking champion but a bit of makeup wouldn't hurt.\n\nhttps://www.youtube.com/watch?v=CXxcpaCr1hw\n\nP.S. i was shown this a couple of weeks ago and i love it.\nIt also reminded me that he shouldn't be affected by blinds for...obvious reasons.","replies":[{"poster":"Chromatic Eagle","date":"2015-01-18T14:50:49.974+0000","up_votes":7,"down_votes":2,"body":"Why do people keep saying this while forgetting that Lissandra is blind as well? You'd have to rework her too.","replies":[{"poster":"Zamiake","date":"2015-01-18T14:58:00.481+0000","up_votes":2,"down_votes":1,"body":"LETS DO IT! Sounds fun as hell. The super champions that are blind but are powerful. Love it. Built in counter play sounds so cool. Then they can give us more power just cause we are blind :3","replies":[{"poster":"Chromatic Eagle","date":"2015-01-18T15:13:56.855+0000","up_votes":2,"down_votes":1,"body":"It's not really counterplay though. Have you seen the complaints against Rek'Sai? Also Yi has advanced vision. Should he get true sight?","replies":[{"poster":"Zamiake","date":"2015-01-18T15:24:34.417+0000","up_votes":12,"down_votes":0,"body":"But it is counter play. Have you ever seen a minion wave in rek sai's vision mode? Lee sin could effectively lose some one he is chasing down instead of merecilessly pounding them into oblivion. He would also have trouble engaging into dives to knock the enemy adc into his team and then jumping back out like its no ones business. Some of lee's greatest aspects would be much less effective if he was played like he was actually blind. And yet he would still work in a masters hands. Its honestly a great idea think on it some and think of all the instances him being actually blind would effect. It would also keep riot from nerfing him too hard","replies":[{"poster":"Sai Aquarius","date":"2015-01-18T23:28:50.267+0000","up_votes":3,"down_votes":0,"body":"Well I thought in the description it says he'd have vision from his teammates. \"with only gaining vision from wards, allies and his own abilities.\" So it wouldn't be that bad.","replies":[{"poster":"Hyrum Graff","date":"2015-01-19T16:48:14.303+0000","up_votes":1,"down_votes":0,"body":"Sightstone now core on lee.","replies":[]}]},{"poster":"Keevalroy","date":"2015-01-18T22:33:16.689+0000","up_votes":3,"down_votes":0,"body":"That's genius.","replies":[]}]}]}]},{"poster":"Knalxz","date":"2015-01-18T21:05:11.070+0000","up_votes":6,"down_votes":1,"body":"It would matter if the latest retcon didn't shatter all pre-established lore. Now she just has an ice plate over her face again...because Watchers and Iceborn.","replies":[{"poster":"Narasimha","date":"2015-01-19T05:28:48.468+0000","up_votes":1,"down_votes":0,"body":"Except she was released post-retcon. Pretty much all champions released after Zyra started off without the League. There was nothing to retcon because they were already part of the new continuity.","replies":[{"poster":"Knalxz","date":"2015-01-19T18:19:22.511+0000","up_votes":1,"down_votes":0,"body":"But it was never stated that her being blind was being continued to my knowledge. That could of just been a thing they were throwing around back when they were  making the new lore. Since Riot has decided to chance so much, a small detail like this is irreverent and wouldn't ever factor into part of the story so why not change it while ideas are still being thrown out?","replies":[{"poster":"Narasimha","date":"2015-01-19T19:08:38.300+0000","up_votes":1,"down_votes":0,"body":"Because as I said, there is nothing to be changed. When we learned she was blind, it was already post-retcon.  Riot doesn't have to change anything because there was nothing to change.\n\nThe retcon was focused around the IoW, so the majority of the changes impact champions that had strong connections to that lore. Champions made without a reference to the League have no such connection, and therefore have really nothing to be changed. Unless they outright state \"This is different now.\", its implied that its the same. Note, again, this only applies to champions from Zyra on. Everyone else needs to be adjusted for the disappearance of the IoW.","replies":[{"poster":"Knalxz","date":"2015-01-20T09:10:43.393+0000","up_votes":1,"down_votes":0,"body":"They said that they have been throwing ideas around for the past couple of years. Lissandra being blind could just be one of those ideas that were expressed to of been made. Since the official retcon there hasn't been anything pointing out that she is blind.\n\nI understand what you're saying but it predates the official retcon and is still in the realm of maybes  since Riot was at the time, still working on what they were making as they are right now. (hopefully)","replies":[]}]}]}]}]},{"poster":"Thewannabegamer","date":"2015-01-18T22:44:09.501+0000","up_votes":1,"down_votes":5,"body":"Lissandra's not blind....","replies":[{"poster":"Chromatic Eagle","date":"2015-01-19T00:20:43.239+0000","up_votes":5,"down_votes":0,"body":"She was blinded by an Ursine. Check her wiki, since it's not easily known.","replies":[{"poster":"Knalxz","date":"2015-01-19T02:18:25.724+0000","up_votes":2,"down_votes":1,"body":"nah nah nah nah nah remember dat retcon.\n\nIf it happen pre late 2014 its just screaming IGNORE ME!\n\nhttps://www.youtube.com/watch?v=FMNJuSl91qY","replies":[]}]}]},{"poster":"Lord Graves III","date":"2015-01-19T03:42:38.072+0000","up_votes":2,"down_votes":0,"body":"Lissandra sees with magic. Lee Sin sees with Kung Fu.\n\nLissandra seeing normally is actually feasible, and playing up the blind part of the blind monk would be rocking.","replies":[{"poster":"Chromatic Eagle","date":"2015-01-19T09:50:03.900+0000","up_votes":1,"down_votes":0,"body":"Lee also knew magic. At least before the retcon. Not much reason to remove that part.","replies":[{"poster":"Knalxz","date":"2015-01-19T18:22:01.764+0000","up_votes":1,"down_votes":0,"body":"That's one thing i'm curious about. Lee was originally going to become a summoner but that cataclysmic event changed his life. Will he just be a blind monk now or will Riot chance him being blind when they update him?","replies":[{"poster":"Lord Graves III","date":"2015-01-20T06:54:50.756+0000","up_votes":1,"down_votes":0,"body":"My headcanon is that he was a monk who went blind burning himself alive to protest the Noxian occupation of Ionia.","replies":[]}]}]}]},{"poster":"Sai Aquarius","date":"2015-01-18T23:26:32.305+0000","up_votes":2,"down_votes":0,"body":"Did they ever release actual lore explaining how she is able to get around? I would imagine she chills the air and being an ice witch is able to sense where everything is based on the temperature.","replies":[]}]},{"poster":"Tentacle Love","date":"2015-01-18T08:05:04.700+0000","up_votes":9,"down_votes":0,"body":"It has a lot of potential, especially because he'd basically ignore brush when it came to moving enemies. \nUnlike Rek'sai, he can't turn it off, and that's kinda neat.\n\nIt has potential, but then so did Evelynn, and her permastealth is basically the reason she's been nerfed into oblivion.","replies":[{"poster":"Knalxz","date":"2015-01-18T13:24:54.399+0000","up_votes":5,"down_votes":1,"body":"Ironically wouldn't this be the opposite of the end result. Lee Sin would get buffs because he can't see. Actually, it would e fair to keep him at his current damage because, come on Lee Sin players. You guys know its pretty BS. Atleast this time around his scaling is justified because he's amazingly handi-caplable.","replies":[{"poster":"Buttigieg 2020","date":"2015-01-18T14:34:22.516+0000","up_votes":2,"down_votes":10,"body":"They would have to triple the damage/sheild/lifesteal on all of his abilities to even make him worth playing. Just imagine  being tunneled with rek sai for the entire game, that is how it would feel playing Lee sin.","replies":[{"poster":"Zamiake","date":"2015-01-18T15:04:37.690+0000","up_votes":3,"down_votes":0,"body":"He is actually blind in lore why not make it for real on the player. Then they wont have to think about nerfing him so much and just keep him the same just actually blind. I love the idea and i used to main him around s2-early 3. I stopped playing him cause i could see everything and easily escape and engage and kick a weak champion on enemy team into my team.\n\nLee sin has to much utility going on to not have a handicap actually going ot limit his full potenial. Thats why riot has him on a slot to be nerfed/reworked. But making him actually blind all game would put in a build in counter play and so then they dont need to nerf him at all.\n\nWith this suggested tweak making him blind i would seriously consider remaking him my main. I could see a challange in using him again and not be godly like before. I love this freaking idea man. He keeps all his power but in exchange he cant see anyone directly without reveals just like rek but all the time. Its so thematic they must put it in","replies":[{"poster":"Taarki","date":"2015-01-18T17:06:18.316+0000","up_votes":2,"down_votes":1,"body":"Just make the whole screen black.","replies":[]}]}]}]}]},{"poster":"Done25","date":"2015-01-18T07:50:15.691+0000","up_votes":8,"down_votes":0,"body":"I think it would actually be pretty cool. He normally has a very small \"sense\" range while moving, but it expands while he's stanting still. Enemies hit by Q or Tempest are revealed for 5 seconds and must attempt to evade him.","replies":[{"poster":"Knalxz","date":"2015-01-18T08:06:20.157+0000","up_votes":4,"down_votes":1,"body":"Nice to see that you like and BTW as i'm sure yo know i'm not the first to mention this so there has to be others who agree with this change. Hopefully the Lee Sin mains won't see this as a nerf and let loose the dogs of war.\n\nI served with the 501st i don't have a problem with gunning down the weak and or disabled.\nlol Order 66, I cried :(\nwhats it to you?","replies":[{"poster":"Narasimha","date":"2015-01-19T05:30:18.902+0000","up_votes":1,"down_votes":0,"body":"> lol Order 66,** I cried :(**\n\nPretty sure that would put you in the 'weak' category.","replies":[{"poster":"Knalxz","date":"2015-01-19T18:23:12.758+0000","up_votes":1,"down_votes":0,"body":"Yes because a 10 year old kid crying about all of his favorite characters dying list him as weak.","replies":[]}]}]}]},{"poster":"BakedLotion","date":"2015-01-18T15:26:34.731+0000","up_votes":7,"down_votes":1,"body":"BUT MUH COMMUNITY UPROAR. WE CANT TOUCH LEE SIN!","replies":[]},{"poster":"XxXGwanXxX","date":"2015-01-18T19:13:17.099+0000","up_votes":3,"down_votes":0,"body":"That would give an actual reasoning for Lee Sin's overloaded kit.","replies":[]},{"poster":"FadingSanity","date":"2015-01-18T18:17:37.540+0000","up_votes":3,"down_votes":0,"body":"That would actually be really cool.\n\nIt would also act like a little \"nerf\" that Lee desperately needs.","replies":[]},{"poster":"maikokk","date":"2015-01-18T15:06:42.629+0000","up_votes":3,"down_votes":0,"body":"holy shit that vid rules","replies":[]},{"poster":"Zamiake","date":"2015-01-18T13:26:36.483+0000","up_votes":1,"down_votes":0,"body":"omfg i was just thinking this you bastard hahaha. I wanna have lee just like rek sais vision but all the time. That can be lee's counter play all by it self. When you are actually playing him like he really is. Blind as a bat","replies":[{"poster":"Knalxz","date":"2015-01-18T13:29:38.062+0000","up_votes":2,"down_votes":0,"body":"lol that sounds OP.\n\n{{summoner:1}} \"Who counters Lee Sin?\"\n\n{{summoner:13}} \"Himself!\"","replies":[{"poster":"Zamiake","date":"2015-01-18T13:33:17.700+0000","up_votes":1,"down_votes":0,"body":"Ikr? Its so epic. Only lee sin counters lee sin. but its fair because he is blind. He gives you his handicap as an advantage and then still beats you silly with it.\n\nAlso how do u follow threads?","replies":[{"poster":"Knalxz","date":"2015-01-18T13:38:57.157+0000","up_votes":3,"down_votes":0,"body":"1. That's still funny. Its like FDR beating a man to death with Polio.\nhttp://i.imgur.com/hNwtrfi.gif\n\n2. Effectively.","replies":[]}]}]}]},{"poster":"UberAffe","date":"2015-01-18T08:01:59.578+0000","up_votes":3,"down_votes":0,"body":"It would basically have to be a full champion redesign, But I like it!","replies":[]},{"poster":"Sinaticus","date":"2015-01-18T21:57:24.001+0000","up_votes":1,"down_votes":0,"body":"and sona should have no VO's cus shes mute and summoners aren't in lore anymore!! should probably give her a silence too!!!","replies":[{"poster":"Knalxz","date":"2015-01-18T22:19:26.365+0000","up_votes":2,"down_votes":0,"body":"Just because she's mute it doesn't mean she can't think, hence why characters mouths don't move when they talk sometimes. Also technically stuns are silences.","replies":[{"poster":"Sai Aquarius","date":"2015-01-18T23:31:04.773+0000","up_votes":2,"down_votes":0,"body":"Omg Buff sona so she cant be silenced ...","replies":[{"poster":"Zamiake","date":"2015-01-19T01:52:49.229+0000","up_votes":2,"down_votes":0,"body":"thats a great idea......why isnt she immune to silences?......","replies":[{"poster":"Knalxz","date":"2015-01-19T02:00:56.291+0000","up_votes":1,"down_votes":0,"body":"because they mentally shut her down. They silence your brain not your mouth.","replies":[{"poster":"Sai Aquarius","date":"2015-01-19T04:49:46.562+0000","up_votes":1,"down_votes":0,"body":"then shouldn't the cc be called veggie? just saying.","replies":[{"poster":"Knalxz","date":"2015-01-19T18:25:16.455+0000","up_votes":1,"down_votes":0,"body":"If Rito fears nerfing Lee Sin because of a community uproar, They probably imagine people lynching them for making that an ability.","replies":[]}]}]}]}]}]}]},{"poster":"Sai Aquarius","date":"2015-01-18T23:32:06.354+0000","up_votes":2,"down_votes":0,"body":"I approve. commence changes","replies":[{"poster":"Knalxz","date":"2015-01-19T02:10:46.589+0000","up_votes":1,"down_votes":0,"body":"Yeah then send in the battle droids.","replies":[{"poster":"Sai Aquarius","date":"2015-01-19T04:48:57.575+0000","up_votes":1,"down_votes":0,"body":"That is above my authorization :( sorry","replies":[{"poster":"Knalxz","date":"2015-01-19T18:25:58.061+0000","up_votes":1,"down_votes":0,"body":"No, its not. You just have to believe in yourself Johnny. BELIEVE!","replies":[{"poster":"Sai Aquarius","date":"2015-01-23T02:56:07.395+0000","up_votes":1,"down_votes":0,"body":"It's not that I don't believe it's just... it's just... it requires so much and I only have so much ip *sobs uncontrollably*","replies":[]}]}]}]}]}]}