{"poster":"Sad Onion","date":"2015-04-25T15:27:16.828+0000","title":"When Did Having Skill Become an Excuse to be Toxic?","subforum":"[ARCHIVED] Miscellaneous","up_votes":12,"down_votes":2,"body":"I played ranked today, and was 2nd pick.\r\nI locked in {{champion:50}}  and said \"mid\", since no one had called it.\r\nAll is well right?\r\n5th pick locks in {{champion:115}} , and types \"mid\".\r\nUncalled for, but okay, I'll be the bigger man and go top. (Against {{champion:75}} by the way who dominates {{champion:50}} .)\r\nThe game starts and of course our team is mad at {{champion:115}} , \"report after the game\", \"negative attitude\", \"toxic\" etc.\r\nI go top, and lose. I'm 1-4. He goes mid and wins, he's 3-1.\r\nWe eventually lose the game. No one on our team did well except {{champion:115}} .\r\nThen, in the post-game lobby, all of the sudden, my team starts raging at me? They're saying I'm the reason we lost, I fed, and since {{champion:115}} did well and I didn't, no one wants to report {{champion:115}} anymore, and now my team wants to report me for losing lane. (Neither I or {{champion:115}} typed barely anything in game)\r\n\r\nWhy is this allowed? I wasn't aware that being toxic was OK as long as you did well in-game? Is that really the mindset of some people? No one even cared about what he did after the game, since he did decently in game. Is winning ranked and gaining LP more important than having fun and playing with teammates who cooperate? This game today only reminded me of why ranked is far less enjoyable than normals games. I feel like people get blinded by the sight of those precious LP gains and care about nothing other than winning. I understand, sure, ranked is for trying your best, and winning. But at what cost?","replies":[{"poster":"GavinRuneblade","date":"2015-04-25T17:56:28.947+0000","up_votes":5,"down_votes":0,"body":"The dunning-kreuger effect:\n\nhttp://en.m.wikipedia.org/wiki/Dunning-Kruger_effect\n\nIt is a cognitive bias where actually skilled people are hyper critical of themselves thus think they aren't as good as they really are. But also where mediocre people think they are experts but aren't.\n\nHumility is the hallmark of a champion. Arrogance and disdain are the marks of a poseur who is half as good as he thinks he is. Guess which one tends to be rude?\n\nWith say just one million players (lol has much more) someone can be below average and still better than hundreds of thousands of people. Means he can do good in please try of games but doesn't actually mean he has skill. Just means he's doing better than the ones he's matched with.","replies":[]},{"poster":"redniwediS","date":"2015-04-25T15:28:48.438+0000","up_votes":3,"down_votes":1,"body":"Skill has never been an excuse to be toxic, and it's not allowed.  You're fooling yourself as much as they are if you think it is.","replies":[{"poster":"Sad Onion","date":"2015-04-25T15:45:50.684+0000","up_votes":1,"down_votes":0,"body":"Well it sure seems like it. This isn't the first time something like this has happened in a game.\nSomeone is toxic in whatever way, raging, flaming, but as long as he/she does well, people seem to forget about their toxicity because they're on their team and they're doing well.","replies":[{"poster":"redniwediS","date":"2015-04-25T15:58:05.814+0000","up_votes":3,"down_votes":0,"body":"When someone gets punished for toxicity there isn't a giant, flashy sign with horns blowing to alert everyone who just played with them.  In fact unless you know the person it is likely you will never realize some toxic idiot you just played with got punished.\n\nSo sure, it may seem like it, but that is simply not the reality of things.","replies":[{"poster":"Occams Raiser","date":"2015-04-26T07:31:09.025+0000","up_votes":2,"down_votes":0,"body":"Should be","replies":[]}]}]}]},{"poster":"warpenguin555","date":"2015-04-25T16:00:27.080+0000","up_votes":2,"down_votes":0,"body":"idk why people think so. I had a game a few days ago where i even admitted to playing horrible that game as thresh (not intentionally bad, just i suck at him bad) in normals. Most of my chat was me joking in all chat about how bad i was doing and we were laughing and having a good time, calling trist toxic after she started raging in all chat. Then at the end of the game my teams olaf says in all chat \"report Thresh toxic Trist is fine\" which ensues more jokes until my team surrenders. Post game Olaf and Trist both claim i was verbally abusive while the enemy team is on my side.","replies":[{"poster":"AbodyHUN666","date":"2015-04-26T12:48:41.474+0000","up_votes":1,"down_votes":0,"body":"I had a game too recently, were I was Zac jungle, had a fairly decent game and I got kind of fed, but had lots of failed ganks too, and suddenly our support wanted to report me because I had most of the failed ganks on bot (they were too low health for ganking but still insisted on me ganking). Once I got killed by the enemy Shaco after pulling off a perfect gank and I wrote how much I hate that champ and hope he will be gutted, and after that the support told the enemy team that I flame. I was like wtf, asked her in all chat why she wanted to report me and what did I say that was bad, suddenly he started dodging the question.","replies":[]}]},{"poster":"Spacesuit Spiff","date":"2015-04-25T23:17:20.516+0000","up_votes":1,"down_votes":0,"body":"tbh I'm amazed they even remembered his trolling by the time the game started.\n\nand really, 90% of the toxic players I see are just angry because they're bad. the players that know they're gonna win 8 out of their next 10 games usually don't flip out.\n\nalthough i get what you're saying, people might refuse to report someone who did well. especially annoying when they only did well by forcing someone else off their role","replies":[]},{"poster":"Akeydel","date":"2015-04-25T22:23:19.046+0000","up_votes":1,"down_votes":0,"body":"This is true just for winning the game, too.\nI had a {{champion:4}} lock in mid, then {{champion:238}} say;s \"oh, tf is good in the jungle, I'M going mid\".\nWe end up winning because (i assume) {{champion:4}}  was getting elo-boosted (17-2-3 as a bot lane apc) and everyone seems to forget any champ select arguments, and there were almost no reports.\nWeird how it works, right?","replies":[]},{"poster":"KGBcommunist","date":"2015-04-25T19:16:29.525+0000","up_votes":1,"down_votes":0,"body":"I honestly just mute my team all the time now. I know its very bad but it keeps me concentrated on my goal which is to win my lane and have the enemy jungler concentrate me. I mute them because i get distracted. Just the other day i had some tempremental reksai just completely go ballistic when i took a double kill from him. He was already 11/2/5 and fed. I was only 5/1/5. What im trying to say is people will always find a reason to flame on. Even when we are winning quiet a lot. Its disgusting tbh\n\n\nEdit: i didnt take it on purpose ethier. We engaged two enemies at mid and i used my abilities plus ulted with brand. Brands ult is devastating :)","replies":[]},{"poster":"tonzillacrayon","date":"2015-04-25T16:09:01.619+0000","up_votes":1,"down_votes":8,"body":"tip everyone dominates swain its the worst champ in the game x)","replies":[{"poster":"Buttigieg 2020","date":"2015-04-25T16:25:32.389+0000","up_votes":1,"down_votes":0,"body":"Swain is amazing. He has dfg on his e and heals 1000 health per second with his ult in a teamfight.","replies":[]}]}]}