{"poster":"Poison Queen","date":"2016-11-09T19:06:01.556+0000","title":"¿Como arreglo el entrar super tarde a la selección de campeón?","subforum":"Problemas Técnicos","up_votes":1,"down_votes":0,"body":"Desde hace tiempo que tengo este problema de entrar tarde a la sala de selecci&oacute;n, nunca me import&oacute; solucionar esto ya que estaba el modo en que uno eleg&iacute;a sus lineas (no recuerdo el nombre), pero ahora que esta solo el selecci&oacute;n oculta me gustar&iacute;a saber como arreglarlo, lo que pasa es que entro sumamente tarde casi a los 5 segundos de que termine la selecci&oacute;n y obviamente me es casi imposible elegir mi linea, yo eh pensado que pod&iacute;a ser mi conexi&oacute;n a Internet, la cual considero buena y llevo 3 a&ntilde;os jugando lol con el mismo Internet, pero e jugado en otras casas incluso con mejor Internet que la que yo tengo y aun as&iacute; pasa este problema, tambi&eacute;n le&iacute; por ah&iacute; que podr&iacute;a ser problema de mi tarjeta gr&aacute;fica pero la m&iacute;a es bastante buena y tampoco seria el problema, y no se que hacer, es realmente desagradable ir lo que sobre todo el tiempo {{champion:32}}  pls help","replies":[{"poster":"xZekrixba","date":"2016-11-09T23:00:26.677+0000","up_votes":1,"down_votes":0,"body":"Prueba reparando el cliente, yo lo solucionaba así!!!\n\n-Saludos","replies":[{"poster":"Poison Queen","date":"2016-11-09T23:26:11.369+0000","up_votes":1,"down_votes":0,"body":"ty lo intentaré {{sticker:slayer-jinx-wink}}","replies":[]}]},{"poster":"FinNox","date":"2016-11-09T19:18:23.401+0000","up_votes":1,"down_votes":2,"body":"Solucion : no existe! pelear o preguntar que falta nada mas!\nLamento decirlo pero es la realidad de la cola normal.\n\nSaludos y suerte!","replies":[{"poster":"Poison Queen","date":"2016-11-09T19:20:23.549+0000","up_votes":1,"down_votes":0,"body":"pero si no es solo entrar tarde, solo me da 5 segundos para elegir, entro muy tarde, y no es cosa de pelear por la linea es que ni siquiera puedo pedir linea, literalmente siempre me toca ir lo que sobre","replies":[{"poster":"FinNox","date":"2016-11-09T19:26:05.870+0000","up_votes":1,"down_votes":0,"body":"Es la triste verdad , entrar primero o ultimo no asegura nada !\nSi por X motivos ganaste linea y el juega con 1 o 2 amigos ellos diran que fue el otro y callladito tenes que rendirte! Lo se , lo vi pasar en varias partidas\n\nSuerte y que no decaiga el animo , mirale el lado bueno! : Aprenderas otras lineas!!","replies":[{"poster":"Poison Queen","date":"2016-11-09T19:30:04.449+0000","up_votes":1,"down_votes":0,"body":"nunca a sido tan así... osea que pasa si, y bastante, pero en cada partida normal que intento jugar siempre termino siendo el supp, no otra linea, y de echo muchas veces ni alcanzo a elegir porque no se que linea me queda o que campeón escoger, 5 segundos es muy poco, y de echo eso es una media, a veces es menos tiempo","replies":[]}]}]}]},{"poster":"Around the world","date":"2016-11-09T19:14:15.570+0000","up_votes":1,"down_votes":1,"body":"Para que te carge rapido necesitas una pc con muy buenos recursos, aunque la tengas, siempre va a haber alguien con un pie mas adelante.\nLa unica solucion es mejorar tu pc :p","replies":[{"poster":"Poison Queen","date":"2016-11-09T19:17:09.333+0000","up_votes":1,"down_votes":0,"body":"pero si tengo un buen pc, y me no había problema hasta hace unos 6 meces, siempre funciono bien y un dia simplemente entre casi al final de la selección, tampoco me importa no llegar primero pero no a 5 segundos de que termine la seleccion, apenas y puedo elegir bien si ni se que linea queda","replies":[]}]}]}