{"poster":"Viacan","date":"2015-11-08T17:30:38.897+0000","title":"[Champion] Liu - Der Wanderfalke","subforum":"Skin- & Champion-Konzepte","up_votes":2,"down_votes":0,"body":"****Geschichte****\nLiu, aufgewachsen im Stamm der Niagi Wanderfalken hatte in der Nacht seines 16. Geburtstags einen Traum, der seine Vorstellungen v&ouml;llig neu erschuf. In diesem Traum war er ein Teil einer Gruppe von Wanderfalken die auf gro&szlig;er Jagd waren, doch nicht nach Nahrung, sondern nach einer neuen Heimat. Sie jagten einer neuen Heimat hinterher, die ihnen ein besseres Leben bescheren w&uuml;rde. Doch als sie dort ankamen, war der Traum pl&ouml;tzlich zu Ende. Er wachte auf, verschwitzt, nachdenkend warum er diesen Traum hatte und warum gerade diese Nacht. Deswegen ging er zum Dorf&auml;ltesten und sprach mit ihm dar&uuml;ber. Dieser sagte ihm, dass es ein Zeichen w&auml;re, ein Zeichen welches gro&szlig;es f&uuml;r sein Leben bestimmte. Denn dies war die Entstehungsgeschichte seines Stammes. Die &quot;Wanderfalken&quot;, auch bekannt unter den Niagi, lebten nun schon seit mehreren Jahrzenten in den Jagdgefillden von Runeterra, ohne sich je Gedanken dar&uuml;ber zu machen, warum eigentlich gerade dort.\nSie verga&szlig;en die Geschichte der Entstehung und diese wurde zu einer Legende, dann zu einer Mythe, bis schlie&szlig;lich nurnoch die Dorf&auml;ltesten sie kannten.\nDieser Traum, war ein Zeichen f&uuml;r eine &Auml;nderung im gro&szlig;en Jagdgefillde von Runeterra, denn der junge Mensch, der diesen Traum hat, so sagt der Dorf&auml;lteste, der ist f&uuml;r weitaus mehr bestimmt, als zu jagen. Dieser Mensch ist eins mit der Natur.\n\nLiu besch&auml;ftigte dies die ganze Woche &uuml;ber, bis er eines Nachts den Entschluss zog loszuziehen und der Sache auf den Grund zugehen. Als er um Mitternacht das Dorf verlassen wollte, stand der Dorf&auml;lteste am Tor und gab ihm eine Kette. Diese Kette solle ihn an seine Heimat erinnern, so sagte es der Dorf&auml;lteste. Allerdings war dies keine gew&ouml;nliche Kette. Als Liu sie anzog, gl&uuml;hte sie leicht, als ob jemand eine Feuerstelle anfachen w&uuml;rde.\nDoch dies ist nur der Anfang seiner Reise...\nDenn was in der darauffolgenden Nacht passierte, war ein Ereignis, welches nur die Natur vorrausahnen h&auml;tte k&ouml;nnen... Liu f&uuml;hlte sich komisch als er einschluf und er hatte Kopfschmerzen, als er am n&auml;chsten Morgen aufwachte.\nEr hatte sich ver&auml;ndert - Er war eins mit der Natur\n\n****Grundinformationen****\nLiu - der Wanderfalke\tTyp: Shangi\nNahkämpfer\nAngriff - 8/10\nF&auml;higkeitsst&auml;rke - 6/10\nVerteidigung - 3/10\nSchwierigkeit 6/10\n------------------------------------------------\nGrundleben - 568\nLebenszuwachs - 60 pro Stufe (+1080 auf Stufe 18)\nLebensregeneration - 1,6\nLebensregenerationszuwachs - 0,016 pro Stufe\nGrundshangi - 4/4\nShangiregeneration - 1 alle 5, 4, 3 Sekunden (auf level 1, 7, 13)\nShangizuwachs - 1 auf Stufe 6, 11, 16 - 7 Shangi Stufe 16\n-------------------------------------------------\nGrundwert an Angriffschaden - 58\nAngriffsschadenzuwachs - 2,3 pro Stufe (+41 auf Stufe 18)\nR&uuml;stung - 24\nR&uuml;stungszuwachs - + 0,9 (+16 auf Stufe 18)\nMagieresistenz - 30\nMagieresistenzzuwachs - + 1 pro Stufe (+18 auf Stufe 18)\n-------------------------------------------------\nAngriffstempo - 0,65\nAngriffstempozuwachs - 0,0116 (+0,2 auf Stufe 18)\nLauftempo - 335\n-------------------------------------------------\n****F&auml;higkeiten****\n\nPassive - Schicksal eines jungen Niagis\nLiu erh&auml;lt f&uuml;r kurze Zeit (1,5 Sekunden) einen Lauftempobonus von 12%, wenn er erfolgreich ein Shangi verbraucht und eine F&auml;higkeit benutzt hat.\nDieser Charakter benutzt Shangi als Ressourcenquelle.\n\n__Q - Falkenschlag__\t\t__Kosten: 1 Shangi__\n__Reichweite: 580__\nAbklingzeit: 12/12/11/11/10 Sekunden\nLiu springt in einem ovalen Bogen zu seinem Gegner (er landet vor seinem Gegner) und h&auml;lt diesen f&uuml;r 0,5/0,65/0,8/0,95/1,1 Sekunden fest, wobei er 80/90/100/110/120 (+0,6% seiner Bonus AD) als physischen Schaden anrichtet.\n\n__W - Niagi Konua__\t\t__Kosten: 1 Shangi__\n__Abklingzeit: 15/14/13/12/11 Sekunden__\nPassive: Verleiht Liu einen 3/4/5/6/7 % Lauftempobonus\nAktive: Setzt die Passive f&uuml;r 4 Sekunden (Dauer der Stackhaltbarkeit, wobei es 3 Stacks sind, also maximal 12 Sekunden) au&szlig;er Kraft und l&auml;sst die Kette um seinen Hals gl&uuml;hen. Seine n&auml;chsten 3 Auto Attacken werden ihn f&uuml;r 20/32/44/65/80 (+0,10% seiner F&auml;higkeitsst&auml;rke) heilen und f&uuml;gen dem Gegner ebenfalls 35/42/55/68/80 (+0,3% seiner F&auml;higkeitsschaden) als zus&auml;tzlichen Schaden zu.\n\n__E - Schutz der Natur__\t\t__Kosten: 1 Shangi__\n__Abklingzeit (Aktive): 10/9,5/9/8,5/8__\nPassive: Sobald Liu unter 45/50/55/60/65 % seines Lebens f&auml;llt, erh&auml;lt er einen OnHit Effekt auf seine Auto Attacken, die 0,3% seines Bonus Angriffschadens entsprechen und dies h&auml;lt solange an, bis er wieder &uuml;ber den angegebenen Prozentsatz seines Lebens verf&uuml;gt.\n\nAktive: Setzt seine Passive f&uuml;r 2,5/3/3,5/4/4,5 Sekunden au&szlig;er Kraft. Liu erh&auml;lt keinen OnHit Effekt mehr auf seine Auto Attacken, erh&auml;lt hierf&uuml;r allerdings einen Angriffstemposhub von 15% (+5/6/7/8/9 % seiner Gesamt Attackspeed) f&uuml;r die Zeit, die die Passive au&szlig;er Kraft gesetzt ist.\n\n__R - Der Traum der Niagi__\t\t__Kosten: 2 Shangi__\n__Abklingzeit: 100/80/60 Sekunden__\nLiu kanalisiert f&uuml;r 2/1,5/1 Sekunde(n) seine gesamte Energie. Seine Federn werden zu Rasiermesserscharfen Klingen, wodurch er seinen Gegnern eine Blutung in H&ouml;he von 0,2% seiner zus&auml;tzlichen AD und 0,1% seiner F&auml;higkeitsst&auml;rke, pro Auto Attacke, zuf&uuml;gt, die &uuml;ber 2 Sekunden abklingt (Bis zu 2 mal stackbar). Au&szlig;erdem ist er f&uuml;r die n&auml;chsten 2/3/4 Sekunden Nicht &quot;Einfangbar&quot;, d. h. er kann von keinerlei CC getroffen werden, außer von Verlangsamung. Diese werden aber um 25 % auf allen Rängen reduziert.\n-------------------------------------------------\nFreunde: Nidalee\nFeinde: Kha&#039;Zix, Rengar\n-------------------------------------------------\n****Bild**** -&gt; Wird folgen\n-------------------------------------------------\nDieser Champion wurde von mir als AD Midlaner entworfen, kann aber auch als Tank benutzt werden oder Jungler. Der SoloQ steht ihren Ideen nichts im Wege.\n-------------------------------------------------\n****Endcard****\nIch hoffe euch gef&auml;llt mein Championkonzept. Ich w&uuml;rde mich sehr &uuml;ber Kritik freuen und falls euch etwas nicht passt, dann schreibt es und ich sehe ob ich es anpassen kann.\n\n__Dieses Championkonzept ist noch nicht fertig. Erg&auml;nzungen folgen.__\n\nMfG {{summoner:31}} \n\n****Changelog****\nErstellung des Changelogs: 8.11.15\n\nLebenszuwachs hinzugefügt. Skalierungen hoch, Grundschaden runter. Neue Passive auf Ult.: 9.11.15\n\nGeschichtsänderung. Anpassung an W Aktive.: 18.11.15","replies":[{"poster":"TFT Zarak","date":"2015-11-08T22:54:44.819+0000","up_votes":2,"down_votes":0,"body":"Die Grundidee gefällt mir, was das angeht GJ. btw der Lebenszuwachs pro level fehlt noch\n\nFeetback:\n\nP: Finde ich gut und auch nicht zu stark\n\nQ: Der Root ist doch schon sehr kurz und der Schaden vielleicht etwas zu gering. wo vom gegner landet er? vor oder hinter ihm?\n\nW: Der Grundwert der heilung auf den ersten Stufen sieht mir viel zu hoch aus. ich meine auf Lv. 3 hat er ~ 750 Leben  und er kann sich alle 15 sek um 180 + 0.36 AP heilen. das ist viel zu hart auf der lane. Zudem sieht die fähigkeit sehr uninteresant zum hochskillen aus, da sie super wenig pro stufe bekommt. Tipp hier: Max werte an heal gleich lassen, minimum werte deutlich senken. beim schaden vielleicht andersrum.\n\nE: Ich würde die Dauer auf jeder stufe ändern lassen: 2.5/3/3.5/4/4.5 oder so ist einfach netter, man sollte für jedes level gleich viel bekommen.\nzudem würde ich die AS boni auch skalieren lassen, da 15% im late game echt nciht viel sind.\n\nR: Auf einem Champ, der so viel damage Potential hat eine 6 sek CC imunität zu legen ist einfach nur Broken. Der DoT passt meiner meinung nach auch ncith so gut zu ihm, da sein Kit viel wert darauf legt, an dem gegner drann zu bleiben. dass führt dann dazu, dass man immer wieder aas machen kann. Hier würde ich vielleicht den schaden etwas runter nehmen und dafür ein paar mal stacken lassen können, oder eine ganz neue Passive überlegen.","replies":[{"poster":"Viacan","date":"2015-11-09T11:51:45.609+0000","up_votes":0,"down_votes":0,"body":"Wow, vielen dank für dein ausführliches Feedback, thumbs up ^^\nFreue mich, dass der Champion dir gefällt und ich werde deinen Tipps bezüglich der Fähigkeiten nachgehen.\n\nEDIT: Hab es mal angepasst, kenn mich aber nicht so gut damit aus, also könnte immer noch zu krass, bzw. zu schwach sein, je nach Fähigkeit.","replies":[{"poster":"TFT Zarak","date":"2015-11-09T21:52:19.568+0000","up_votes":1,"down_votes":0,"body":"ist denke ich auf jeden fall ein schritt in die richtige Richtung. Bin leider auch kein Riot Mitarbeiter und mach dass nur hobbymäßig, dass heißt 100% ob das so klar geht kann ich natürlich nicht sagen.","replies":[]}]}]},{"poster":"Azcorban","date":"2015-11-17T23:15:21.355+0000","up_votes":1,"down_votes":0,"body":"Ich finde die Idee gut und es ist auch etwas neues, jedoch habe ich ein paar Sachen anzumerken:\n-Ist er ein Vogel Wanderfalke oder ein Mensch vom Stamm der \"Wanderfalken\"?\n-Falken fliegen nicht in Herden, wenn überhaupt, dann in Gruppen (Sind keine Herdentiere, diese haben meistens Hufe) (Bloß kosmetisch, nimms mir nicht übel :P)\n-Der Aktive Schaden der W ist deutlich zu hoch für den Anfang (3x 60 = 180), setze ihn niedriger an (35?) und lasse ihn stärker ansteigen. Du musst bedenken, dass auch der normale Schaden der Angriffe dazu kommt.\n\nLG Azcorban","replies":[{"poster":"Viacan","date":"2015-11-18T20:21:00.550+0000","up_votes":1,"down_votes":0,"body":"Danke fürs Feedback^^\nHabe die Geschichte angepasst, fliegt nicht mehr in einer \"Herde\", sondern nun in einer Gruppe.\nEr ist ein Mensch,  stand etwas weiter unten in der Geschichte \"Dieser Traum, war ein Zeichen für eine Änderung im großen Jagdgefillde von Runeterra, denn der junge Mensch, der diesen Traum hat, so sagt der Dorfälteste, der ist für weitaus mehr bestimmt, als zu jagen. Dieser Mensch ist eins mit der Natur.\"\nUnd die W Aktive hab ich auch mal angepasst.^^\n\nMfG","replies":[]}]},{"poster":"Im a Papaya","date":"2015-11-08T17:41:35.660+0000","up_votes":1,"down_votes":0,"body":"Vielleicht hab ich nicht gründlich genug gelesen aber ist der Champ ein Nah oder Fernkämpfer ?","replies":[{"poster":"Viacan","date":"2015-11-08T17:54:42.503+0000","up_votes":0,"down_votes":0,"body":"Danke, hab das total vergessen^^\nWurde geändert","replies":[]}]}]}