{"poster":"richardpev2","date":"2019-12-10T03:43:10.724+0000","title":"Buenas noches trolls del mundo","subforum":"Charlas Generales","up_votes":2,"down_votes":3,"body":"Hace un par de dias me habia salido un jugador que se llamaba **cuch+++ de doran**(lo censuro para que no me tiren el foro) y bueno resulto ser troll, iba anivia con smite en todas sus partidas, trollea a todos los que tienen la desgracia de toparse con el su team. Obvio lo reporte y obvio riot se paso el report por las nalgas, como debe ser. Lo gracioso viene ahora, me pongo a jugar y todo tranqui hasta que no se quien dice report bot, veo la tabla y leo \"cuch+++ de doran\", me parti el qlo de la risa que me dio jaja. Obviamente estaba trolleando al team enemigo y obviamente ellos lo iban a reportar y obviamente yo tambien jaja. Pero el solo no era el troll sino que ahora tenia un duo troll xd, se llama \"**Imagine my na++**\" y bueno tambien se comio report. Ahora yo no entiendo porque el sistema de reportes es tan pero tan malo. Que acaso no ven que la \"Deportividad\" que tanto defiende riot cuando te censuran las palabras como \"dio\" (jaja wtf porque censuraban eso pero posta lo censuran, prueben) yo ya no se mas que hacer con los trolls que salen cada vez mas asquerosos. Estoy con un pie fuera del lol a punto de irme. Cada troll que me sale me hace alejarme un poco mas y estoy seguro que a mucha gente mas tambien.\r\n\r\nYa habia echo un foro sobre esto hablando del mismo troll pero al encontrarmelo me di cuenta de que fue al pedo\r\n{{sticker:sg-lux}} \r\nlos quiero rioters que solo sirven para ... \r\npara que sirven si ahora te responde un bot en contacto a soporte?","replies":[{"poster":"Sworick IV","date":"2019-12-10T16:40:57.105+0000","up_votes":2,"down_votes":0,"body":"la verdad el tipo tiene mas de 30 partidas trolleadas. impresionante.\ny su dúo troll lo mismo.","replies":[{"poster":"richardpev2","date":"2019-12-11T10:18:18.557+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sworick IV,realm=LAS,application-id=v7qsfXsE,discussion-id=3E6r4J45,comment-id=0000,timestamp=2019-12-10T16:40:57.105+0000)\n>\n> la verdad el tipo tiene mas de 30 partidas trolleadas. impresionante.\n> y su dúo troll lo mismo.\n\nlo mas loco es que no lo banean. xd Justo que me banean ami permanentemente pero al forro ese no","replies":[{"poster":"Aegis","date":"2019-12-14T22:32:24.278+0000","up_votes":1,"down_votes":0,"body":"te banearan a ti por contestar cualquier cosa, y ojo con que vaya con duo porque el enemigo justamente le creera a él, plus a riot le valera que te hayas comportado bien, su bot de reportes esta tan mal como los rioters de LAS :D","replies":[]},{"poster":"Sworick IV","date":"2019-12-11T17:25:04.972+0000","up_votes":1,"down_votes":0,"body":"pasa que banean por flamear. no por trollear","replies":[]}]}]},{"poster":"rodrigo1593","date":"2019-12-14T05:35:08.674+0000","up_votes":1,"down_votes":1,"body":"hay gente que no lo hace con intencion amigo, no es para tanto, a veces hay algunos que jugamos de esa manera porque queremos jugar y ya, y si nos toman de troll y nos dan un reporte nos joden sin motivo a los que no quieren hacer nada y solo quieren pasarla bien jugando todos los dias, por eso no ocurre lo que tu quieres, loquito.","replies":[{"poster":"richardpev2","date":"2019-12-14T07:25:42.911+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=rodrigo1593,realm=LAS,application-id=v7qsfXsE,discussion-id=3E6r4J45,comment-id=0001,timestamp=2019-12-14T05:35:08.674+0000)\n>\n> hay gente que no lo hace con intencion amigo, no es para tanto, a veces hay algunos que jugamos de esa manera porque queremos jugar y ya, y si nos toman de troll y nos dan un reporte nos joden sin motivo a los que no quieren hacer nada y solo quieren pasarla bien jugando todos los dias, por eso no ocurre lo que tu quieres, loquito.\n\nel ponia muros cuando bakeaba o cuando tenia que escapar, eso es trollear genio. Ya vamos a ver que decis cuando te salga uno.","replies":[{"poster":"rodrigo1593","date":"2019-12-14T20:33:04.417+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=richardpev2,realm=LAS,application-id=v7qsfXsE,discussion-id=3E6r4J45,comment-id=00010000,timestamp=2019-12-14T07:25:42.911+0000)\n>\n> el ponia muros cuando bakeaba o cuando tenia que escapar, eso es trollear genio. Ya vamos a ver que decis cuando te salga uno.\n\ncuando tenia que escapar obviamente pondria muros o cualquier otra cosa, no se va a quedar a fedear a los enemigos asi nomas sin atacar sin nada y morir a cada rato aproposito sin objetos y sin nada de nada, eso si es troll, ayudar al equipo enemigo y ni siquiera ayudarlos a vosotros. ya me salio uno a mi, pero no uno troll, uno igual que tu muy toxico que me trataba de troll por como estaba jugando, la gente como tu tambien es dañina para esta comunidad o personas que juegan al mismo juego online, gente como tu es la que debe no estar al igual que los verdaderos \"troll\" como los llamas tu, riot no hara nada por el motivo de que los mismos puedan ser confundidos con gente que de verdad quieran pasar un buen rato como tu o yo, seria injusto que te penalizen o que pierdas tu cuenta por eso, no es asi?","replies":[{"poster":"richardpev2","date":"2019-12-14T23:01:31.025+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=rodrigo1593,realm=LAS,application-id=v7qsfXsE,discussion-id=3E6r4J45,comment-id=000100000000,timestamp=2019-12-14T20:33:04.417+0000)\n>\n> cuando tenia que escapar obviamente pondria muros o cualquier otra cosa, no se va a quedar a fedear a los enemigos asi nomas sin atacar sin nada y morir a cada rato aproposito sin objetos y sin nada de nada, eso si es troll, ayudar al equipo enemigo y ni siquiera ayudarlos a vosotros. ya me salio uno a mi, pero no uno troll, uno igual que tu muy toxico que me trataba de troll por como estaba jugando, la gente como tu tambien es dañina para esta comunidad o personas que juegan al mismo juego online, gente como tu es la que debe no estar al igual que los verdaderos \"troll\" como los llamas tu, riot no hara nada por el motivo de que los mismos puedan ser confundidos con gente que de verdad quieran pasar un buen rato como tu o yo, seria injusto que te penalizen o que pierdas tu cuenta por eso, no es asi?\n\nponia muros cuando YO tenia que escapar osea me bloqueaba el camino. Sabes leer? porque si no te puedo enseñar, no tengo problema. Aparte el iba con smite y le robaba los primeros bufos a el jg y sabes muy bien que los primeros bufos son indispensables para empezar la ruta de forma correcta.","replies":[{"poster":"rodrigo1593","date":"2019-12-16T18:08:37.523+0000","up_votes":1,"down_votes":0,"body":"no c leer we :v para eso tengo una pc xd. okno. em..... enrealidad no era YO basicamente, lo puse en otro lado refiriendome a la persona de la que hablaba el men que se quejaba de la persona troll esa, no de mi en especifico -_- y apenas llevo como 5 dias jugando creo y me dices que se muy bien.... apenas se lo que es top, mid, jg. no me vengas con que yo ya se como invocar hasta a Arceus en league of legends porque ni eso llego a saber xd. y yo me la paso bien jugando y ya, no hago nada mas basicamente.","replies":[{"poster":"rodrigo1593","date":"2019-12-16T18:13:40.956+0000","up_votes":1,"down_votes":0,"body":"que idiota que soy me confundi demasiado, mejor ya ni digo nada xd","replies":[]}]}]},{"poster":"Aegis","date":"2019-12-14T22:29:51.080+0000","up_votes":1,"down_votes":0,"body":"ahhh lo encontre, mira si pones los muros de anivia mientras estas escapando y hay un aliado es trolear seguro, hay formas de evitar al enemigo con el muro sin joder a tus aliados, y esta bien que algun que otro pueda salir mal pero no todos, además un troll de build que busca ganar la partida/ disfrutar del juego se diferencia muy bien del troll con intenciones de perder a proposito","replies":[{"poster":"rodrigo1593","date":"2019-12-16T18:09:27.174+0000","up_votes":1,"down_votes":0,"body":"el que disfruta soi io :v xd. y te doy toda la razon.","replies":[]}]}]}]}]}]}