{"poster":"CuTeemo666","date":"2015-04-15T21:41:39.214+0000","title":"League of Legends startet nicht nach Logo.","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hey, \r\nHabe seit langem nicht mehr LoL gespielt und hab wieder vor es zu spielen.\r\nDoch es funktioniert nicht. Ich starte es ganz normal (oder per Admin) und es &ouml;ffnet sich nur das Logo-Fenster, welches nach ca. 2 Minuten auch verschwindet. Neuinstalliert hab ich es. Windows updates gemacht hab ich. Alles von der Festplatte gel&ouml;scht hab ich auch. \r\n\r\nUnd bitte kommt mir nicht mit irgendwelchen Links, wo eine &quot;Anleitung&quot; zu finden ist, die total pauschalisiert ist. \r\n\r\nDanke im Vorraus!","replies":[{"poster":"TeebeuteI","date":"2015-04-15T22:44:09.099+0000","up_votes":1,"down_votes":0,"body":"Hi hatte vor 1 Woche genau das selbe Problem habe  das ganze Internet durchsucht habe mit dm Support probiert das Problem zu klären ich habe ungelogen  30 Varianten probiert. bist in die registry und tiefer  aber immer vergeblich  habe dann den PC neu aufgesetzt dann hat es funktioniert. solltest du herausfinden was das Problem ist schreib das mal bitte   würde mich trotzdem brennend interessieren.\n\nMfG Teebeutel","replies":[{"poster":"CuTeemo666","date":"2015-04-15T22:46:36.279+0000","up_votes":1,"down_votes":0,"body":"Hmm..\nWie meinst mit pc neu aufsetzen? Brauche doch dafür Win8-CD oder?","replies":[{"poster":"TeebeuteI","date":"2015-09-18T19:26:19.053+0000","up_votes":1,"down_votes":0,"body":"ja genau  das meinet ich habs  voll verpeilt hier rein zuschauen sry","replies":[]}]}]},{"poster":"tiellevetolv","date":"2015-04-15T21:46:01.833+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"CuTeemo666","date":"2015-04-15T22:10:57.648+0000","up_votes":1,"down_votes":0,"body":"Yo, alles gemacht. Funktioniert immer noch nicht. :S Flashplayer deinstalliert, neues draufgeknallt und GraKa auch updated.\n\nEdit: Meinen Longus aufn Tisch geknallt, funktioniert immer noch nicht ","replies":[{"poster":"Supportive Wings","date":"2015-04-16T10:55:00.735+0000","up_votes":1,"down_votes":0,"body":"Versuch mal die Funktion den Lol Client zu reparieren. Wenn es nicht funktioniert versuch den lol client erneut runterzuladen.\nWenn diese beiden Sachen nicht funktionieren, schreib am besten den riot support an","replies":[]}]}]}]}