{"poster":"TechniquE Tho","date":"2020-01-02T08:36:31.229+0000","title":"chat ban for getting trolled by support?","subforum":"Client Discussion","up_votes":1,"down_votes":2,"body":"I'm honestly getting tired of how ridiculously easy you guys are throwing games restrictions around. LoL is supposed to be an E-sports, and sports in general are meant to be competitive. With that being said It infuriates me that I'm restricted for taunting my opponents. Do you think the sport of boxing would be the same if it weren't for the fighters ego, their self belief and the occasional taunting of the opponents ? It would be understandable if I were throwing around racial slurs or afking during games, but all that I'm doing is taunting my opponent in the spirit of competition. Should I be punished because my opponents feel angry after losing ? You should really make it harder to report people, so if something actually bothers them they'll take the time to go online and write a formal complaint. Pressing a button after the game is over is just too simple. Whenever the players lose, they just click the button and all of a sudden they feel better because they feel some sort of justification","replies":[{"poster":"CV Protostar","date":"2020-01-15T04:15:14.460+0000","up_votes":1,"down_votes":0,"body":"{{sticker:zombie-brand-mindblown}} \n\nWith no context, I can't take this seriously.\n\nSome examples of things I report:\n\n-\"ggez\" at the end of a game is unsportsmanlike and something I report 100% of the time\n-consistently typing in all chat or team chat to the point where it causes deaths or loss of cs\n-diving into a 1v3 as a mage/support/while behind in lane is throwing and inting, and gets reported\n-anything done by the player at the expense of his teammates get reported\n\nThose are just a few examples of scummy things I've reported in the past. Yes this is a competitive game, but that's not a blanket excuse to behave in a childish manner. Like how it seems slightly infantile of you to use \"its a sport\" as an excuse to behave that way.\n\nFortunately, I don't end up reporting super often.","replies":[]}]}