{"poster":"zccmicky2","date":"2015-02-18T21:40:59.133+0000","title":"Connection Failure: Unable to connect to the PVP.net server issue since patch 5.2","subforum":"[ARCHIVED] Help & Support","up_votes":59,"down_votes":0,"body":"Hi guys,\n\nEver since patch 5.2, whenever I try logging on, the login screen will be stuck at logging in and then display the message \"Connection Failure: Unable to connect to the PVP.net server issue\". I need to restart the client and try it 3 or 4 times before it actually logs me in. Sometimes, I have to retry five or six times. Does anyone know the problem and how to resolve it?\n\nThanks.","replies":[{"poster":"Antzi","date":"2015-02-18T21:54:23.043+0000","up_votes":33,"down_votes":2,"body":"Riot, can you PLEASE address this issue?  Countless people have to attempt to login 10-50 times without any solution.  Yes, I have tried your solutions offered and none work.  Please, address this issue.","replies":[{"poster":"Teb","date":"2015-02-18T21:58:58.261+0000","up_votes":16,"down_votes":1,"body":"For the love of god, please ADDRESS this Riot!","replies":[]}]},{"poster":"Друид","date":"2015-02-18T22:17:30.744+0000","up_votes":23,"down_votes":1,"body":"every single time","replies":[{"poster":"TaylorCG","date":"2015-02-18T23:22:03.231+0000","up_votes":5,"down_votes":1,"body":"Exactly","replies":[]}]},{"poster":"hundredandfirst","date":"2015-02-18T22:06:13.170+0000","up_votes":7,"down_votes":0,"body":"I like the way the LOGIN SERVERS have been down for over half an hour in NORTH AMERICA and the status is showing NORMAL.  Maybe you should spend some money on a NETWORK OPERATIONS CENTER.  Maybe you could run a script to login to the NORTH AMERICA (or maybe even each site, like a real company) and when you can't authenticate in, like us thousands, you might change the status to \"possible login issues.\"\n\nJust a suggestion for a successful IT business in the 90's.......","replies":[{"poster":"Chernzobog","date":"2015-02-18T22:11:48.745+0000","up_votes":13,"down_votes":0,"body":"This. This annoys me to no end. All I see when I go to the server status page is that they've disabled Panda Teemo which leads me to conclude Teemo's behind everything gg wp RIP","replies":[]},{"poster":"hundredandfirst","date":"2015-02-18T22:07:03.358+0000","up_votes":10,"down_votes":0,"body":"I bet if there was a problem with the PAYPAL or STORE site you all would be all over it...","replies":[]}]},{"poster":"Reformed Forrest","date":"2015-02-18T22:29:43.539+0000","up_votes":10,"down_votes":0,"body":"Riot, seriously you have the biggest game in the world and you cant even solve simple login issues. I deal with crap that should be easy fixes day in and day out. First it started with being unable to access the store \"most the time\". Then it became okay you cannot access the store. I have come to terms with that. Then the chat service is randomly disconnecting multiple times throughout the day, okay I don't really need to chat with friends I will deal with it. I am now having to try to log in multiple times to get into the game, okay not a problem just a minor set back. NOW I can't even access the game at all I counted over 50 login attempts with the same outcome(cannot connect to pvp.net servers.) Don't worry I did what I am supposed to do I checked the server status don't worry the servers are up. So now I have decided to check the handy dandy COMMON LOGIN ISSUES PAGE I went down the list and who would have guessed I would find myself still stuck in the same position as before. I have thrown away countless dollars to this game. Countless hours of wasted time and you know what. I am not angry or going to rage. I calmly ask you please do something help me access my fav pastime please just help me.","replies":[]},{"poster":"ChallengedSoraka","date":"2015-02-18T22:03:19.456+0000","up_votes":8,"down_votes":0,"body":"I am getting the same issue. I think I've been trying to log in for a solid 30 minutes right now, while also watching YouTube videos. What's going on?\nCan we please get error codes of some kind in this fucking client?\n\nI understand that you forcefully shut it down so that we do not flood the login servers, but we have no idea what's going on at any time and it is pretty annoying to say the least.","replies":[]},{"poster":"DozleZabi","date":"2015-02-18T21:52:19.776+0000","up_votes":8,"down_votes":0,"body":"I GET THE SAME THING\n\nNo one else is talking about it though I really don't understand","replies":[]},{"poster":"Grozban","date":"2015-02-18T22:20:49.932+0000","up_votes":1,"down_votes":4,"body":"Guys it'll be fine. Now that you've seen this thread you know its not your pc and the launcher is being fucked up. It's been noticed by now and is being worked on. Just have some patience, it'll be fixed soon. We're not the EU servers lol","replies":[{"poster":"DozleZabi","date":"2015-02-18T22:28:06.738+0000","up_votes":9,"down_votes":0,"body":"Have some patience huh? This issue has been around for fucking weeks and nothings been done or said about it","replies":[]},{"poster":"Gheed","date":"2015-02-18T22:29:34.763+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=Grozban,realm=NA,application-id=osqw6G4M,discussion-id=u299Txjw,comment-id=0010,timestamp=2015-02-18T22:20:49.932+0000)\n>\n> Guys it'll be fine. Now that you've seen this thread you know its not your pc and the launcher is being fucked up. It's been noticed by now and is being worked on. Just have some patience, it'll be fixed soon. We're not the EU servers lol\n\nToo bad this issue has been ongoing for months, with no clear acknowledgement from Riot.\n\nSo no, it won't be fine...until they get their shit together.","replies":[]}]},{"poster":"Father Way","date":"2015-02-18T22:13:11.177+0000","up_votes":5,"down_votes":0,"body":"Same here. Normally it'll take 3-5 tries for me to log in and I've just learned to deal with it, but I've been trying to login the past 30 minutes. Seriously, please address this. I'm sick and tired of feeling like I am the only one with this problem, like going over to service status and seeing \"Normal\" and then having problems.","replies":[]},{"poster":"slaywithrage","date":"2015-02-18T21:57:28.324+0000","up_votes":5,"down_votes":0,"body":"I've just been dealing with it, today seems to be a little worse than others though.","replies":[]},{"poster":"Ashes Arise","date":"2015-02-18T22:41:25.869+0000","up_votes":2,"down_votes":0,"body":"Everyday. I have to try to log on at least 10 times for it to work. Some days I have to restart my computer and repeat the process. Then I have days like this where I have been trying to log on for the last hour to no avail. \n\nI have done everything on this list https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues\n\nThe problem is clearly on Riots side.","replies":[{"poster":"ChallengedSoraka","date":"2015-02-18T22:46:45.008+0000","up_votes":6,"down_votes":1,"body":"Uninstall & re-install and reattempt logging in.\nIf that doesn't work, buy a new computer and change your ISP.\n\nChange religion and believe in Riot. Buy more RP.\nStill can't log in? Are you still using the old peripherals you were before? Buy new ones.\n\nStill can't play? Move to another continent and go through steps 1 to 5 again for good measure.\nBuy RP.","replies":[]}]},{"poster":"HelioVANCE","date":"2015-04-17T06:26:30.803+0000","up_votes":7,"down_votes":2,"body":"Eureka!!! Got it its all in the HERE link when it happens , so you basically just (I think this is for Windows only but if you try for Mac you might just get it) follow my steps:\n1-Go to Internet Explorer\n2-Hit Tools\n3-Go to Advanced\n4-Scroll down until you find Security\n5-Turn off SSL 2.0 and SSL 3.0 and turn on TLS 1.0 \n6-Hit apply(then OK)\n7-Open League Of Legends\n8-Enjoy bros and sis and you have 90% of logging in\n9-Wanna play with me? Add me HelioVANCE in EUNE \n10- I play as Nidalee AD or AP Carry , Twisted Fate AP Carry , Pantheon AD Carry or Tank and Warwick Jungler\n(This worked for me so PEACE OUT)","replies":[]},{"poster":"Moist Oppa","date":"2015-02-18T22:39:23.405+0000","up_votes":3,"down_votes":0,"body":"I'm definitely getting a tad fed up with this. Whether right now is actually an issue regarding Riot's end or not, many people have been dealing with this for weeks and it's still yet to be resolved. I really like Riot as a company but for real? How much longer will this issue go unaddressed and actually be dealt with by Riot?  Personally up until searching the forums I tried every solution given on the error message. Nothing worked so that's what brought me here. I've spent the last couple weeks having to log in from anywhere up to 10-15 times. Sometimes more, sometimes less. ;n;\n\nDon't let me down rito bb, pls fix.","replies":[{"poster":"ChallengedSoraka","date":"2015-02-18T22:43:15.640+0000","up_votes":4,"down_votes":0,"body":"BUY MORE RP YOU FUCKING WHINY BABY!!! -- Riot, probably","replies":[]}]},{"poster":"PhoenixAzrael","date":"2015-02-18T22:23:50.763+0000","up_votes":4,"down_votes":0,"body":"Did they start holding a raffle for who had the privilege of logging in every patch now? I would've appreciated to be informed that I wasn't allowed to log in anymore.","replies":[]},{"poster":"Krigjer","date":"2015-02-18T22:17:19.661+0000","up_votes":4,"down_votes":0,"body":"Every new patch, it seems to be fixed for a day, and then it's back to the same thing. \n\nI've tried the fixes that keep getting posted around the boards. Sometimes they work, sometimes they don't. \n\nAt this point I'm really starting to get irritated. If the servers are even up, why is it taking 5+ attempts to log in?","replies":[]},{"poster":"siskon","date":"2015-02-18T22:01:42.302+0000","up_votes":4,"down_votes":0,"body":"I still cant log on tried like 100000 times and it still wont let me on fucking riot please fuck","replies":[]},{"poster":"internet sex","date":"2015-02-18T22:00:34.243+0000","up_votes":4,"down_votes":0,"body":"Tried everything they've listed on the support thread, still can't log in. Tried at least 30-40 times today. This is a really frustrating issue. pls rito","replies":[]},{"poster":"MasterJaken","date":"2015-02-18T23:24:28.972+0000","up_votes":3,"down_votes":0,"body":"just thought id tell you about our pvp.net patcher kernel and ya last night when u were sleeping.. we kinda tweaked it for no reason and now ur fucked.","replies":[]},{"poster":"MasterJaken","date":"2015-02-18T23:19:57.242+0000","up_votes":3,"down_votes":0,"body":"im sure some people are plotting murder right now","replies":[]},{"poster":"Nuke182","date":"2015-02-18T22:28:39.452+0000","up_votes":3,"down_votes":0,"body":"I don't know why I even check these boards anymore, Riot sure as hell doesn't. Terrible business practice to not fix a widespread issue that your customers are having. This is fucking ridiculous. GG Riot, I'm out.","replies":[]},{"poster":"Le Cheesie","date":"2015-02-18T22:19:23.137+0000","up_votes":3,"down_votes":0,"body":"It usually does this to me, takes about ~5 attempts to get in, but I've been closing it out and retrying for the past 30 minutes and I still can't log in.","replies":[]},{"poster":"RUTrunks","date":"2015-02-18T22:11:08.995+0000","up_votes":3,"down_votes":1,"body":"i usually keep logging in until it works but since 5.3 i can't even get in (or 5.2 whatever patch was today 2/18/15)","replies":[{"poster":"internet sex","date":"2015-02-18T22:16:33.653+0000","up_votes":3,"down_votes":0,"body":"The most recent patch happened about a week or so ago, the 11th I believe. A lot of people have been having the issue since then.","replies":[]}]},{"poster":"Shelbasaur","date":"2015-02-18T22:15:30.546+0000","up_votes":3,"down_votes":0,"body":"I have been experiencing this issue for several months, but usually it only took my a couple of times to get in. I tried all of Riots recommended fixes several times over and none of them worked. I even re-enabled and updated my Internet Explorer (hissssss). But today I have been trying to log in for nearly an hour with no success.","replies":[]},{"poster":"playerwinner","date":"2015-02-18T22:13:43.439+0000","up_votes":3,"down_votes":0,"body":"Fix this crap...","replies":[]},{"poster":"siskon","date":"2015-02-18T22:03:14.276+0000","up_votes":3,"down_votes":0,"body":"PHREAK WHERE ARE YOU I KNOW YOU READING THIS THREAD JUST HELP US GOD FUCK DAMN IT","replies":[]},{"poster":"Die Area","date":"2015-05-29T15:53:55.227+0000","up_votes":2,"down_votes":0,"body":"Still having issues connecting \"unable to connect to pvp.net server\" everytime i login. It always takes multiple tries to login.\n\nAnd yes, I tried everything on the troubleshooting login issues page.\n\nDoes anyone know of a fix for this? Is Riot working on this?","replies":[]},{"poster":"Desiderium","date":"2015-05-28T04:17:34.168+0000","up_votes":2,"down_votes":0,"body":"I only managed to log in a few times within the past 3 days.\n\nYesterday I had to try 30-40 times within a span of 8 hours to log in to the game.\n\nCan 100% confirm that flushdns as well as the other steps outlined in the support page as well as restarting the computer did not work at all.","replies":[]},{"poster":"SneakyChampion","date":"2015-05-27T02:57:02.758+0000","up_votes":2,"down_votes":0,"body":"I have the problem, started today... whyyy","replies":[]},{"poster":"ConsumingSpirit","date":"2015-02-19T23:30:21.345+0000","up_votes":2,"down_votes":0,"body":"so RIOT it would be really nice if you guys could remove my leaver buster for this because it wasnt my fault i got this error and couldnt joing any game, it would be really nice if you could take it off","replies":[]},{"poster":"internet sex","date":"2015-02-19T01:11:32.638+0000","up_votes":2,"down_votes":0,"body":"After 4 hours of patience and coffee, I finally tried again and got on. Had the problem previously and it resolved itself the same way, with time. Still a crappy problem that needs attention/resolve ASAP. GL to all still struggling, I'm not entirely out of the water yet.\nCatch you guys on the Rift {{item:3455}}","replies":[]},{"poster":"Mortusvorge","date":"2015-02-19T00:47:39.345+0000","up_votes":2,"down_votes":0,"body":"Not one riot post regarding this issue. It's inexcusable.","replies":[]},{"poster":"LeaveLegacy","date":"2015-02-19T00:03:09.190+0000","up_votes":2,"down_votes":0,"body":"Heres how i fixed it guys u just go to ur IE (internet explorer) settings and choose default settings hope that helps.","replies":[]},{"poster":"Sorrowfulkia","date":"2015-02-18T23:29:41.446+0000","up_votes":2,"down_votes":0,"body":"I have been trying to log in over and over again for well over an hour and half. During this time I just get to sit by and listen to all of my friends as they get to play..and I sit here. Way past Frustrating.","replies":[]},{"poster":"Your Hung Dad","date":"2015-02-18T23:29:14.501+0000","up_votes":2,"down_votes":0,"body":"You know a simple \"We are working on it\" or even a \"We are aware of the issue\" would be pretty great.","replies":[]},{"poster":"Darxt","date":"2015-02-18T23:26:11.937+0000","up_votes":1,"down_votes":0,"body":"Can anyone log in right now? Sever says it's up but i haven't been able to log in for a coupe of hours","replies":[{"poster":"internet sex","date":"2015-02-18T23:27:59.101+0000","up_votes":2,"down_votes":0,"body":"A lot of people can't, and haven't been able to. Riot hasn't said a thing about the issue thus far.","replies":[]}]},{"poster":"TaylorCG","date":"2015-02-18T23:21:14.637+0000","up_votes":2,"down_votes":0,"body":"GOD IS THAT YOU? OH NEVERMIND ITS JUST RIOT, IF IT WAS GOD HE WOULDN'T MAKE US SUFFER LIKE THIS.","replies":[]},{"poster":"MasterJaken","date":"2015-02-18T23:18:40.317+0000","up_votes":2,"down_votes":0,"body":"FUCK THIS","replies":[]},{"poster":"xStarkx","date":"2015-02-18T23:08:56.553+0000","up_votes":1,"down_votes":0,"body":"Wow, definitely wish I stumbled upon this thread before I tried their 90 step process of fixing connectivity issues. I too have been having this issue since patch 5.2\" and now it completely refuses to log me in. All disappointment aside, it would be greatly appreciated if you would post that you have some technicality issues on your end, so that way we wont try 101 ways to figure out whats wrong with our end.\n\nTL;DR Give us some notification that your doing something about this please and thank you!","replies":[{"poster":"zeperzon","date":"2015-02-18T23:11:38.207+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=xStarkx,realm=NA,application-id=osqw6G4M,discussion-id=u299Txjw,comment-id=002d,timestamp=2015-02-18T23:08:56.553+0000)\n>\n> Wow, definitely wish I stumbled upon this thread before I tried their 90 step process of fixing connectivity issues. I too have been having this issue since patch 5.2\" and now it completely refuses to log me in. All disappointment aside, it would be greatly appreciated if you would post that you have some technicality issues on your end, so that way we wont try 101 ways to figure out whats wrong with our end.\n> \n> TL;DR Give us some notification that your doing something about this please and thank you!\n\nHaha same!\n\ntoo bad I already uninstalled and am currently reinstalling ;(","replies":[]}]},{"poster":"RUTrunks","date":"2015-02-18T22:39:15.122+0000","up_votes":2,"down_votes":0,"body":"gg rito tried to fix a game that wasn't broken, and broke it...again....","replies":[]},{"poster":"slaywithrage","date":"2015-02-18T22:30:26.412+0000","up_votes":2,"down_votes":0,"body":"Normally it only takes 3-5 tries, but this is insane. Been trying for the last hour and I can't login. I'm also on the Mac Client if it matters","replies":[]}]}