{"poster":"Dangerous Vayne","date":"2016-12-26T20:49:00.981+0000","title":"Sondaggio della Riot","subforum":"Discussioni generali","up_votes":1,"down_votes":4,"body":"Attenzionee !! La Riot ha fatto un Sondaggioo !!\r\n\r\nPosso credere che lo abbiano fatto per sentire i giocatori.\r\nPosso credere che lo abbiano fatto per capire come ottimizzare le loro entrate.(il che non e` male)\r\n\r\nIn tutti e due i casi la Riot ci sta chiedendo che direzione prendere.\r\nIo voglio che il sondaggio rimanga del tutto anonimo, ma questo sondaggio ha suscitato un interesse di parlare in generale di cosa va bene e cosa non va bene.\r\n\r\nCi hanno chiesto se i prezzi degli IP ed RP siano giusti.(io personalmente ho spuntato che sono giusti)\r\nCi hanno chiesto se le cose costano il giusto e qui io ho spuntato che non acconsento.(mi contraddico)\r\n\r\nSpiegazione: La maggior parte delle cose costano il giusto, ma se volete una cosa piu` esclusiva dovete essere figli di papa`.\r\nMi riferisco alla skin di Vayne Ladra Di Anime e alla skin di annie sempre quella che si crafta con 10 gemme.\r\n\r\nCi hanno chiesto se ci sono troppi campioni, perche` dovrebbero questa cosa, ATTENZIONE, qui bisogna rispondere bene nei sondaggi perche` credo che loro si stiano chiedendo:\r\n\r\nDobbiamo sfornare piu` campioni oppure piu` skin e robe estetiche?\r\n\r\nIo personalmente credo che ci siano troppi campioni(ma ci sta che io abbia un pensiero piu` limitato), \r\nio vorrei che creassero piu` cose estetiche.\r\n\r\nE qui parte anche la proposta che non sapendo dove metterla la scrivo proprio qui:\r\n\r\nI giocatori giocano per salire questa e` la ricompensa di League of Legends, ma io personalmente vorrei piu` riccompense, qualche idea:\r\n\r\nA me piacerebbe poter sbloccare delle skin esclusive in base a degli obbiettivi da sbloccare, esempio\r\n\r\nA 100-250-500 partite giocate con un campione(perche` si, io sono un giocatore incallito di Vayne) vorrei poter sbloccare una skin esclusiva Oppure, vorrei avere la possibilita` di comprare quella skin solo dopo aver raggiunto l`obbiettivo di tot numero partite giocate.\r\n\r\nMi spiego: Chiunque vuole una skin, mette le mani al portafoglio e se la compra, ed invece NO !\r\nPotrebbero fare degli obbiettivi e come ricompensa ti danno il Diritto/Permesso di comprare una certa skin.\r\n\r\nQuindi quando io vedo un Yasuo con una certa skin, so per certo che quel yasuo ha giocato tot partite oppure tot partite vinte con lui e solo lui che e un main yasuo ha quella skin, cosi` si differenziano e da una certa rilevanza avere quella skin/ricompensa.\r\n\r\nE un pochino quello che hanno fatto con le maestrie, di fatti trovo bello avere le maestrie ma non si devono fermare a creare le ricompense, pur mantenendo anche i costi in Rp, Cioe` fare un miscuglio, combinare le due cose.\r\n\r\nOppure ormai gli IP che servono per le rune o comprare altri campioni, dovrebbero essere piu valorizzati, esempio:\r\n\r\nSkin esclusiva per i main Vayne(quello che gioco io :D), costo: 25 000 IP, 150 partite vinte, 2000 avversari crepati e X RP.\r\n\r\nIo questo natale non ho shoppato NULLA, non perche` non potessi, ma per il semplice fatto che anche le skin natalizie e skin nuove sono state fatte per molti campioni ma per Vayne NO.\r\n\r\nLoro hanno capito che Vayne e molto giocata e allora hanno messo la skin Vayne Ladra Di Anime che per craftarla bisogna shoppare centinaia e non ne fanno altre, perche` se uno vuole la skin nuova di Vayne deve spendere tanto, eh no eh..(lo so, sto rosicando ma hanno esagerato)\r\n\r\nIl client nuovo e super buggato, audio che si sente male e vista del client che lampeggia a quadratini neri(Riot Pls)\r\n\r\nPer il resto sono Molto contento che ci hanno chiesto un parere.\r\n\r\nGL HF, Zombi92","replies":[{"poster":"Darkinknight","date":"2016-12-27T06:22:39.922+0000","up_votes":1,"down_votes":0,"body":"Lo mettono fuori tipo ogni settimana 😂","replies":[]},{"poster":"SirZeel","date":"2016-12-27T00:26:19.859+0000","up_votes":1,"down_votes":0,"body":"Amico mio, quel sondaggio esiste da eoni.","replies":[{"poster":"Dangerous Vayne","date":"2016-12-27T00:27:27.864+0000","up_votes":1,"down_votes":0,"body":"io l`ho visto e compilato oggi.","replies":[{"poster":"SirZeel","date":"2016-12-27T00:32:44.656+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Zombi92,realm=EUW,application-id=MJVj50Jw,discussion-id=T3kfnAYn,comment-id=00040000,timestamp=2016-12-27T00:27:27.864+0000)\n>\n> io l`ho visto e compilato oggi.\n\nBuon per te. :)","replies":[]}]}]},{"poster":"Campanello","date":"2016-12-27T00:05:40.643+0000","up_votes":1,"down_votes":0,"body":"bellissima idea pero ci sono un paio di problemi: creare 150 skin esclusive e inoltre i guadagni riot diminuirebbero. I soldi li fanno solo con skin, extech, champion e merchandise fisica","replies":[{"poster":"Dangerous Vayne","date":"2016-12-27T00:23:17.473+0000","up_votes":1,"down_votes":0,"body":"Ho specificato, che dopo aver raggiunto gli obbiettivi, ti da la possibilita` di comprare la skin con gli RP. Altrimenti anche se hai gli Rp non te la fa comprare.\n\nDevi spendere ad esempio: 25000 punti influenza, fare 2000 kill, avere 150 partite vinte + UN PREZZO IN RP\n\nInoltre ora tu mi dici che dovrebbero fare 150 skin.. No, faranno quelle dei champ piu usati per primi, per poi comprire anche altri.\nCome hanno fatto con le skin di natale, solo che stranamente non ho vito una nuova skin di vayne ad esempio ed e getonatissima.","replies":[]}]},{"poster":"GragasTheCatfish","date":"2016-12-26T20:59:03.312+0000","up_votes":1,"down_votes":0,"body":"l'ignoranza dove si trova il sondaggio\n???","replies":[{"poster":"Dangerous Vayne","date":"2016-12-26T21:02:10.030+0000","up_votes":1,"down_votes":0,"body":"Nella Home, dove ci sono le ultime cose uscite, bundle ect, C`e` anche il sondaggio.\nE messo come publicita` in un quadratino 5 centimentri quadrati come publicita`, clicchi e ti manda alla pagina del sondaggio.","replies":[{"poster":"GragasTheCatfish","date":"2016-12-26T21:35:52.014+0000","up_votes":1,"down_votes":0,"body":"ti giuro non lo trovo mi manderesti uno screen pls\n","replies":[{"poster":"Dangerous Vayne","date":"2016-12-26T22:03:51.214+0000","up_votes":1,"down_votes":0,"body":"[](https://s28.postimg.org/hxv5753gd/Sondaggio.jpg)\n\nhttps://postimg.org/image/6lijpcurd/","replies":[{"poster":"GragasTheCatfish","date":"2016-12-26T22:17:01.948+0000","up_votes":1,"down_votes":0,"body":"ciò il client nuova mannaggia","replies":[{"poster":"Dangerous Vayne","date":"2016-12-26T23:08:04.942+0000","up_votes":1,"down_votes":1,"body":"Stai usando il cliento nuovo??? Ma stai scherzando? Tutto Buggato..\nSi puo` sempre usare il vecchio.\n\n1) esci da lol\n2) clicchi sul launcher per lanciare lol\n3) non metti nessun dato, cioe` non logghi ma clicci in basso a destra su accedi con il vecchio client\n4) immetti le credenziali ed entri nel vecchio client","replies":[]}]}]}]}]}]},{"poster":"ReyZør","date":"2016-12-26T22:16:57.104+0000","up_votes":1,"down_votes":0,"body":"Neanche a me appare. Esci il link pls","replies":[]},{"poster":"x A N D R E","date":"2016-12-26T21:37:01.922+0000","up_votes":1,"down_votes":0,"body":"Puoi linkarmi la pagina?","replies":[]}]}