{"poster":"Dangerous Vayne","date":"2019-01-08T14:37:22.721+0000","title":"Idea Del Secono Punti Maestria Moneta Per Emote Speciali O Altro","subforum":"Campioni e gameplay","up_votes":3,"down_votes":9,"body":"Attualmente i punti Maestria servono Effettivamente fino al raggiungimento della Maestria 7 su un campione.\r\nOltre la Maestria 7, si continuano a cumulare punti Maestria sul campione ma NON servono a NIENTE.\r\n\r\nQuindi le idee sono un paio:\r\n\r\n1) Sbloccare la Maestria 7\r\n\r\n-Punti a favore:\r\n\r\na) Si puo` far vedere agli altri che si e` un Main di un certo calibro\r\nb) Maestria maggiore = Maggior Soddisfazione di essere Main\r\n\r\n-Punti a sfavore:\r\n\r\na) Per ottenere una Maestria &quot;Grande&quot; bisogna spendere tanto tempo, levano tempo a disposizione per provare/imparare altri champs\r\nb) I nuovi arrivati faranno piu` fatica e saranno Sfavoriti\r\n\r\n2) Dopo il raggiungimento della Maestria 7, i punti cumullati da quel  momento in poi diventano una Moneta Maestria con la quale si possono comprare delle cose speciali del tipo:\r\n\r\na) Emote Speciali Generiche\r\nb) Emote Speciali Riguardanti Il Campione(ma questo punto e` sfavorito dato che ci sono 140 campioni, fare una sola Emote Speciale per ciascuno equivale a tante risorse spese per la Riot)\r\n\r\n3) Un altra idea puo` essere la seguente, DOPO aver raggiunto il livello Maestria 7, i punti Maestria saranno scritti in grande Sotto o sopra la Maestria quando essa viene spamata. Cossiche` anche i punti DOPO il livello Maestria 7 vengono di fatto utilizzati. Da notare il fatto che, si puo` impostare nelle impostazioni di gioco con una casella SE mostrare o meno Il numero dei Punti Maestria quando essa viene spammata.\r\nCosi facendo, chi vuole il sistema di ora non gli cambia niente, la Maestria sara` mostrara come ora, Invece, chi vorra` far vedere in gioco i suoi Punti, potra` Spammare la Maestria con la scritta SOPRA/SOTTO il numero dei Punti.\r\n\r\n4) Un altro uso potrebbe essere quello delle skin Ultra Ultra Ultra Speciali e Difficile da Ottenere, piu` Difficile delle Skin ottenibili con le  10 Gemme.\r\nQueste Skin si potranno ottenere in uno dei seguenti 2 Modi(La Riot dovrebbe scegliere):\r\n\r\na) 10 Gemme + Maestria 7 Con 1Milione di Punti Maestria\r\nb) Niente Gemme(quindi Ottenibile anche per i non Pay, Semplicemente Mainando) + Maestria 7 con 1 Milione di punti Maestria su quel camp\r\nc) una delle due versioni precedenti + 10 Voti S\r\n\r\n-----------------------------------------------------------------------------------------------------------------------\r\n\r\nAnche altre possibilita` potrebbero essere prese in considerazione, ma di fatto, come gia` detto e ora ripeto i Punti Maestria Oltre il Livello Maestria 7, NON SERVONO A NIENTE, sara` ache l`ora di renderli utilizzabili, altrimenti che senso ha che il contatore dei punti Maestria venga Incrementato, lo posso vedere solo io, NON HA SENSO.\r\n\r\nAltrimenti per come e` il sistema ora, potrebbero anche dire, arrivati al Livello Maestria 7, non se ne guadagnano piu`.(Ha una Logica No? Perche` di fatto e` questo che succede, NON SERVONO A NIENTE).\r\n\r\nPerfavore, almeno questo post, Votate con il Like, cossiche` venga preso in considerazione e che i Moderatori/Rioters Italiani prendano in considerazione questacosa, Affinche` l`Esperienza di Spammare la Maestria(e` quindi l`esperienza di Gioco) diventi piu` Bella.\r\n\r\nFate sapere anche la Vostra Opinione, Se uno di questi metodi vi e` Piacciuto o spiegate come vorreste che fosse.\r\n\r\nPiu` Gente Mette Like, Piu` Gente Commenta e Piu` le Nostre Idee Italiane avranno possibilita` di arrivare alla Riot ed Impattare sul Game Con un`idea Italiana !!\r\n\r\nPartecipa Anche TU, a Migliorare League Of Legends !!","replies":[{"poster":"Covenant77","date":"2019-01-08T15:04:44.483+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Dangerous Vayne,realm=EUW,application-id=cAOZwaUi,discussion-id=Vy1UzEOr,comment-id=,timestamp=2019-01-08T14:37:22.721+0000)\n>\n> Piu` Gente Mette Like, Piu` Gente Commenta e Piu` le Nostre Idee Italiane avranno possibilita` di arrivare alla Riot ed Impattare sul Game Con un`idea Italiana !!\n> \n> Partecipa Anche TU, a Migliorare League Of Legends !!\n\nAHAHAHAHHAHAHAHAHAH","replies":[{"poster":"Dangerous Vayne","date":"2019-01-08T16:16:44.126+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SVN Covenant77,realm=EUW,application-id=cAOZwaUi,discussion-id=Vy1UzEOr,comment-id=0001,timestamp=2019-01-08T15:04:44.483+0000)\n>\n> AHAHAHAHHAHAHAHAHAH\n\nSembra uno spot publicitario lo so, ma cosa non faccio io per migliorare LOL, per attirare la vostra attenzione, faccio cosi` XD.","replies":[]}]},{"poster":"Dr LouD","date":"2019-01-08T19:24:54.615+0000","up_votes":2,"down_votes":0,"body":"Sai che figata stompare la gente che ti spamma i settordici trilioni di punti maestria sul champ pensando di bmare??","replies":[]},{"poster":"Dangerous Vayne","date":"2019-01-08T16:18:09.854+0000","up_votes":1,"down_votes":0,"body":"Allora, siamo a -4 di Voti, non va bene, eh no eh, siamo scendendo in tendenza.\nApproposito, ho fatto il post anche su reddit(tutto in inglesi)\n\nhttps://www.reddit.com/r/leagueoflegends/comments/advp3o/best_idea_2019_mastery_points_coin_value_for/","replies":[{"poster":"SuraKnight","date":"2019-01-08T22:09:28.307+0000","up_votes":1,"down_votes":0,"body":"Ti prego, fatti correggere la grammatica inglese in quel post su reddit, altrimenti non si capisce niente.\n;D","replies":[{"poster":"Dangerous Vayne","date":"2019-01-08T23:14:14.698+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SuraKnight,realm=EUW,application-id=cAOZwaUi,discussion-id=Vy1UzEOr,comment-id=00020000,timestamp=2019-01-08T22:09:28.307+0000)\n>\n> Ti prego, fatti correggere la grammatica inglese in quel post su reddit, altrimenti non si capisce niente.\n> ;D\n\nIl primo post che ho scritto l`ho scritto qui la prima volta, solo che qui mi riempiono di voti negativi senza dare alcuna spiegazione e non serve a niente, mentre su reddit almeno per ora ho ricevuto un +4 e niente commenti negativi.\nHo scritto in un inglese che sapevo, a scuola non ero bravo a inglese, pace.\nAlmeno si capisce in Italiano, eppure non sono Italiano.\n\nE comunque, alla fine dei conti, non era un test/esame di inglese, era un post dove vale il contenuto e non la forma della scrittura. Ciao !!","replies":[{"poster":"SuraKnight","date":"2019-01-08T23:33:49.937+0000","up_votes":1,"down_votes":0,"body":"Keep calm il mio era solo un suggerimento. Hai scritto un post su reddit per arrivare ad un maggior numero di persone e sapere cosa ne pensano. Giustissimo, ma se alcuni passaggi sono scritti male, alla fine non riuscirai a spiegare bene le tue idee, e non tutti riusciranno a capire.\nI contenuti si esprimo attraverso la forma, è così che funzionano le lingue.","replies":[]}]}]}]},{"poster":"Salvatore Brizzi","date":"2019-01-08T16:57:46.401+0000","up_votes":1,"down_votes":0,"body":"Chiedi a sorcio84","replies":[]}]}