{"poster":"T4té","date":"2016-04-16T22:09:50.696+0000","title":"Re-play System und Sandbox-Mode","subforum":"Champions & Gameplay","up_votes":2,"down_votes":1,"body":"Liebes Riot Team,\r\n\r\nIch spiele jetzt seit ca. mehr als 3 Jahren League of Legends und frage mich was die arbeiten an einem** Re-play-System** oder einem **Sandbox-Mode ** verhindern.\r\nHier zu mal eine Subjektive pro &amp; contra Liste.\r\n______________________________________________________________________________________________________\r\n\r\n_**Re-play-System**_\r\n\r\n**Pro** \r\n* Jeder k&ouml;nnte seine Spiele im nachhinein anschauen und w&uuml;rde aus diesen lernen.\r\n* Gewisse Spielmechaniken k&ouml;nnten besser analysiert werden und verstanden werden.\r\n* Es w&uuml;rde das Niveau des Spieles um ein vielfaches steigern.\r\n* Man m&uuml;sste sich nicht mehr auf 3 Anbieter verlassen und w&uuml;rde Re-plays auch nach Patches behalten k&ouml;nnen.\r\n* Pro sowie Normale Spieler profitieren davon. \r\n\r\n**Contra**\r\n*/\r\n______________________________________________________________________________________________________\r\n\r\n_**Sandbox-Mode **_\r\n\r\n**Pro** \r\n* Nachstellen von Situationen die unerkl&auml;rlich waren.\r\n* Neue Sachen Ausprobieren\r\n* Pro sowie Normale Spieler profitieren davon. \r\n* Es w&uuml;rde das Niveau des Spieles um ein vielfaches steigern.\r\n\r\n**Contra**\r\n* /\r\n______________________________________________________________________________________________________\r\n\r\nFazit:\r\nNach langem &uuml;berlegen, ob und wie ich diesen Text hier verfasse sind mir keine Contra Punkte eingefallen.\r\nIch glaube das ihr es nicht ohne Grund noch nicht eingebaut habt trotzdem gibt es sehr viele die es sich so sehr W&uuml;nschen.\r\nUnd ich habe keine lust mich mehr auf 3 Anbieter zu Verlassen.\r\n\r\nEs kann sicherlich schwer sein sowas zu Programmieren bzw wird es ein enormer Traffic Aufwand den man aber auch bew&auml;ltigen kann.\r\nWie uns von 3 Anbietern gezeigt wird.\r\n\r\nDanke f&uuml;rs lesen.\r\nIch w&uuml;rde mich sehr &uuml;ber eine Antwort eines Riot Mitarbeiters freuen.","replies":[{"poster":"RM Heartmeander","date":"2016-04-17T00:37:45.589+0000","up_votes":2,"down_votes":0,"body":"Warum nicht so machen wie bei op.gg.\nDa wird über den Zuschauermodus das Spiel aufgenommen und danach kann man sich eine Bat Datei herunterladen.\nSollte das für Riot nicht auch möglich sein?\nDass es aufgezeichnet wird per Zuschauermodus und dann evtl beim ACC die Bat Datei eingebettet wird?\nMüsste man sich halt herunterladen um anzuschauen.","replies":[]},{"poster":"Bıg Ðaddy","date":"2016-04-16T23:47:24.914+0000","up_votes":2,"down_votes":0,"body":"Beim Sandbox-Modus stimme ich absolut zu. \"Beim Sandbox wurde argumentiert, dass die Spieler noch toxischer werden würden.\" verstehe ich absolut 0, da zumindest ich alleine oder mit Freunden spielen würde um Champion-Mechaniken oder Team-Combos ausprobieren würde. Solange hier mit Sandbox gemeint ist man kann am Anfang einstellen was auf der Karte wirkt, wie zB. Allgemein 100% CDR, unendlich Gold, unendlich Mana oder was man eben braucht.\n\nDas Problem mit dem Replay-System ist, dass Riot die Spiele Serverseitig speichern würde, WÄRE es ein implementiertes System. Dies verbraucht tonnenweise Ressourcen. Lösung: Auf dem Computer speichern, Problem: Man kommt somit an Informationen über das Spiel die (laut Riot) auch zu bisherigen Exploits geführt haben (Bork, Summoner-Cooldown auf 0). Allerdings könnte man dies damit beheben, dass man das aktuell beste Replay-System mit Team aufkauft und  zu Riot in's Team holt. Damit wären Updates zu 95% fehlerfrei. Doof dabei ist das alle anderen System unter gehen, aber ich schätze Mal so ist das Leben.\n\nZu SUMDAY:\n\"Ich denke nämlich, dass es Leuten mit Fähigkeiten und bösen Absichten; wenn Sie den Quellcode lesen könnten im Sandbox Mode,\nmöglich ist damit schon genug Schlüsse für weitere Hacks und Bugabuse zu ziehen\"\nSolange das keine Offline-Version ist die auf dem Computer gespeichert wird kann man genau 0 damit machen, was man nicht auch in einem anderen Spielmodus machen könnte, also kein Gegenargument ^^","replies":[]},{"poster":"wolf454","date":"2016-04-16T23:44:43.465+0000","up_votes":2,"down_votes":0,"body":"Repkay war soweit ich weiß das Problem das die Videos auf dem Server gespeichert wurden (mehr disconnects) und das es abbussed werden kann für frame bugs (10 azir türme nebeneinander)","replies":[]},{"poster":"TerrorRaven","date":"2016-04-16T22:18:43.330+0000","up_votes":2,"down_votes":0,"body":"Beim Sandbox wurde argumentiert, dass die Spieler noch toxischer werden würden. Beim Replay-Modus lag es an technischen Schwierigkeiten, die sie zuerst beheben wollen http://euw.leagueoflegends.com/de/news/riot-games/announcements/riot-pls\nVor ein paar Tagen wurde in einem Artikel angedeutet, dass die evtl. an einer Sandbox würde. Zur Zeit ist das Team, dass daran arbeiten würde, zur Zeit mit einem anderen Projekt beschäftigt http://euw.leagueoflegends.com/de/news/riot-games/announcements/riot-pls-dynamische-warteschlange-und-sandkasten","replies":[]},{"poster":"Lagbeard","date":"2016-04-17T08:44:15.061+0000","up_votes":2,"down_votes":1,"body":"Wenn es einen Sandbox Mode gäbe, in denen alles frei Einstellbar ist, wären die Spieler permanent am URF zocken und RIOT hätte ein wichtiges Event verloren.","replies":[{"poster":"T4té","date":"2016-04-17T09:09:23.589+0000","up_votes":1,"down_votes":0,"body":"könnte man umgehen in dem man das nicht 5 vs 5 spielen kann ... schon hat Riot ihr URF Event wieder","replies":[]}]},{"poster":"Game Over Boyz","date":"2016-04-17T06:35:27.589+0000","up_votes":2,"down_votes":1,"body":"Fuck Sandbox Mode Kein Replay System zu haben ist Echt Eigentlich schon unverschämt ich spiele seit anfang season 2 und wollte immer competetiv spielen allerdings ist mir die möglichkeit von riot nicht gegeben da ich mir meine replays nicht anschauen darf um mich zu verbessern lieber hatt es Riot Wenn Es Sich So anfühlt als wäre das team schuld indem sie mich 3von 4 games gegen premades spielen lassen die mein team crushen die lcs leute schauen sich jedes ihrer replays an die frage ist nur Wie? ich möchte ja keinen dritt anbieter benutzen weil riot dann ohne grund meine acc bannen kann also werde ich ab jetzt einfach immer fuc retard team schreiben wenn ich sterbe LEL^^\n\n\nhttps://www.youtube.com/watch?v=dVkhfRjE1tk","replies":[]},{"poster":"Sumday","date":"2016-04-16T22:33:21.782+0000","up_votes":2,"down_votes":1,"body":"Hey;\n\nDu nimmst dir wirklich die Zeit deinen Thread zu schreiben und dir fällt gar nix ein - nicht ein einziges Wort - keinen Punkt!?\nwarum es noch keinen Sandbox Mode gibt?\n\nContra - Arbeitsaufwand / Zeitaufwand und die daraus folgenden Kosten\n\nZusätzliche Server Kapazitäten müssten zur Verfügung stehen und laufenden Kosten dafür\n\nEs muss dafür gesorgt werden, dass du deine Replays über Patches hinweg noch anschauen kannst\n\nAlso muss man jeden Patch mit dem Replay System kompatibel machen über Jahre hinweg\n\nDazu kommt noch das du erstmal einen Sandbox Modus entwickeln musst, der muss dann auch noch parallel zum Live Server laufen\nWahrscheinlich willst du das Ganze noch lagg frei haben, also muss der auch noch leistungsstark sein\nAlso kommt  für jede Region nochmal eine Serverregion dazu:\n\n(zu EUW - EUW Sandbox\nzu NA - NA Sandbox\nzu TR - TR Sandbox\nzu KR - KR Sandbox\n\nTaiwan China Australien usw...)\n\nDann kommt hinzu das man den ganzen Code noch sichern muss das niemand die Mechaniken aus dem Sandbox Mode lesen kann und evtl ein eigenes Tool zu entwickeln um z.B. auf dem Live Server mit 100% CDR rumzulaufen oder die Minimap permanent aufgedeckt zu haben oder mit 1000000 Gold startet\n\nIch denke nämlich, dass es Leuten mit Fähigkeiten und bösen Absichten; wenn Sie den Quellcode lesen könnten im Sandbox Mode,\nmöglich ist damit schon genug Schlüsse für weitere Hacks und Bugabuse zu ziehen\n\nHinzu kommt noch das es schwer genug ist den PBE überhaupt am Laufen zu haben\nDazu noch einen Server für einen Sandbox Mode zu machen\n\nDominion wurde nicht aus Spaß einfach removed\nDa wird knallhart durchgerechnet was sich rechnet und was nicht!\n\n\nWie du siehst ist mein Contra Text schon größer als dein Thread...","replies":[{"poster":"T4té","date":"2016-04-17T06:32:52.570+0000","up_votes":1,"down_votes":2,"body":"Da du denkst das ich mir keine Gedanken gemacht habe werde ich dir hier das gegenteil beweisen\n___________________________________________________________________\n\n> Arbeitsaufwand / Zeitaufwand und die daraus folgenden Kosten[.]\n\n**Du bringst wirklich das offensichtlichste als erstes es ist klar das ein gewisser Aufwand betrieben werden muss.\nDas muss selbst bei Skins.**\n___________________________________________________________________\n>Zusätzliche Server Kapazitäten müssten zur Verfügung stehen und laufenden Kosten dafür[aufgebracht werden[.]\n\n**Riot ein Unternehmen das von dem reichsten Unternehmen der Welt gekauft wurde hat Kosten ok du weißt bescheid **\n\n**falls du dich fragst wie ich darauf komme das Riot von einem reichen Unternehmen gekauft wurde Google mal nach Tencent**\n___________________________________________________________________\n>Es muss dafür gesorgt werden, dass du deine Replays über Patches hinweg noch anschauen kannst[.]\n\n>Also muss man jeden Patch mit dem Replay System kompatibel machen über Jahre hinweg[.]\n\n**Wow bring halt die selbe Argumentation zwei mal hintereinander Good Job Summoner.\nRiot kann doch selber entscheiden wann sie die Replays löschen und warum kann es nicht ein Client sein der für \ndie Zwecke von Riot entworfen wird.\n**\n___________________________________________________________________\n>Dazu kommt noch das du erstmal einen Sandbox Modus entwickeln musst, der muss dann auch noch parallel zum Live Server laufen\nWahrscheinlich willst du das Ganze noch lagg frei haben, also muss der auch noch leistungsstark sein[.]\n\n**No Shit das muss erst noch entwickelt werden was du nicht sagst da ist erstmal eine Umbenennung des Summoner-Names in xXSherlockHolmesLP4kXx(xXLP4kXx steht für die Männlichkeit)\nJa Wobei ich mich frage wie du auf die Idee kommst einen eigenen Server extra dafür zu erstellen.\nWäre es nicht Sinnvoller einen Custom Modus zu entwickeln der über den gleichen Clienten läuft.\nZu dem zweifel ich daran das Riot leistungsschwache Server hat.**\n___________________________________________________________________\n>Also kommt für jede Region nochmal eine Serverregion dazu:\n(zu EUW - EUW Sandbox\nzu NA - NA Sandbox\nzu TR - TR Sandbox\nzu KR - KR Sandbox\nTaiwan China Australien usw...)\n\n**Schön in die länge gezogen passt aber nicht mehr wenn ich wieder das Custom Modus Argument bringe.**\n___________________________________________________________________\n>Dann kommt hinzu das man den ganzen Code noch sichern muss das niemand die Mechaniken aus dem Sandbox Mode lesen kann und evtl ein eigenes Tool zu entwickeln um z.B. auf dem Live Server mit 100% CDR rumzulaufen oder die Minimap permanent aufgedeckt zu haben oder mit 1000000 Gold startet\n CDR rumzulaufen oder die Minimap permanent aufgedeckt zu haben oder mit 1000000 Gold startet[.]\n\n>Ich denke nämlich, dass es Leuten mit Fähigkeiten und bösen Absichten; wenn Sie den Quellcode lesen könnten im Sandbox Mode,\nmöglich ist damit schon genug Schlüsse für weitere Hacks und Bugabuse zu ziehen[.]\n\n**Mein Lieblings Teil deiner Argumentation da sie kein Hand und Fuß hat.\n1. Wird ein Spiel durch einen Sandbox Mode nicht unsicherer.\n2. Beschäftige dich mit Informatik bevor du solche Argumente schreibst denn\nLoL ist ein Spiel was Server seitig gespielt würde sprich sämtliche Daten werden vom Server abgefragt und nicht von deinem PC\nsprich man kann dinge nur ändern wenn man rechte auf dem Riot Servern hat oder hast du mitbekommen das durch URF\njetzt nur noch Hacker oder Cheater rumlaufen da sie ja durch einen neuen Modus den Quellcode lesen konnten\n3.Ich sehe nur vorteile darin Bugs über die Community schneller zu finden da man sich so Zeit spart\n4.Versuche bitte dich das nächste mal wenigstens ein bisschen mit IT auseinander zu setzen wenn du schon solche Argumente benutzt**\n___________________________________________________________________\n>Hinzu kommt noch das es schwer genug ist den PBE überhaupt am Laufen zu haben.\nDazu noch einen Server für einen Sandbox Mode zu machen\n\n**Ohh Insider Infos würde mich mal gerne interessieren von welcher Quelle du das bitte hast. **\n___________________________________________________________________\n>Dominion wurde nicht aus Spaß einfach removed\n\n**Und da ist gleich die zweite Insider Info.\naus dem ganz einfachen Grund das Dominion (hier eine schweige Minute für Dominion.)raus genommen wurde, weil sich \nkein Mensch mehr interessiert hat ist nicht möglich?**\n___________________________________________________________________\n>Da wird knallhart durchgerechnet was sich rechnet und was nicht!\n\n**Seit wann bezahlt man dafür das man in Q geht?**\n___________________________________________________________________\nFazit:\nDu weißt selber hinter deinen Aussagen ist mehr schein als sein wenn ich eine Pro und Contra-liste ist mir schon bewusst\nwas ein Pro und was ein Contra sein könnte das habe ich mir sehr gut überlegt.\nDas nächste mal einfach kein Pantheon[Er wäre gerne Bäcker] sein.\nEs ist Schwachsinn sich irgend welche Argumente aus dem Ärmel zu Leihern natürlich ist es logisch das es Aufwand ist\ndas ist aber auch wie gesagt jeder Skin, jeder neue Champ und auch jeder neue Patch.\nEs zeigt nicht von von Wissen wenn man mit den Sätzen \n\n>Dann kommt hinzu das man den ganzen Code noch sichern muss das niemand die Mechaniken aus dem Sandbox Mode lesen kann und evtl ein eigenes Tool zu entwickeln um z.B. auf dem Live Server mit 100% CDR rumzulaufen oder die Minimap permanent aufgedeckt zu haben oder mit 1000000 Gold startet\n CDR rumzulaufen oder die Minimap permanent aufgedeckt zu haben oder mit 1000000 Gold startet[.]\n\n>Ich denke nämlich, dass es Leuten mit Fähigkeiten und bösen Absichten; wenn Sie den Quellcode lesen könnten im Sandbox Mode,\nmöglich ist damit schon genug Schlüsse für weitere Hacks und Bugabuse zu ziehen[.]\n\nkommt und keine Ahnung von der Materie hat beziehungsweise sich irgend was wieder aus den Ärmeln zieht was passen könnte.\n\ntuh das nächste mal bitte nicht so selbst überzeugt wenn du es nicht bist du könntest meine Argumente aus diesem Text auch wiederlegen aber am Ende drehen wir\nuns dann nur im Kreis.\n\n> Wie du siehst ist mein Contra Text schon größer als dein Thread...\n\n**Ich hoffe du stehst ab jetzt nicht mehr so sehr auf virtuelle Schwanz vergleiche \n**","replies":[]}]},{"poster":"Beschwörer one","date":"2017-01-20T12:46:49.026+0000","up_votes":0,"down_votes":1,"body":"1. \n{{sticker:zombie-nunu-bummed}}","replies":[]}]}