{"poster":"Homunculi","date":"2016-07-04T13:49:00.580+0000","title":"Reportbarer Grund?","subforum":"Spielerverhalten & Moderation","up_votes":3,"down_votes":4,"body":"Hi,\r\n\r\ndies hier ist jetzt kein &quot;mimimi&quot; oder &quot;warum wurde ich gebannt&quot; Thread.\r\n\r\nMir kam heute morgen beim Kaffee der Gedanke: &quot;Wenn ich jemanden, ob eigenes oder gegnerisches Team, so zum lachen bringe das er nicht mehr spielen kann bzw. aufgrund einer extrem langen Lachattacke nicht mehr richtig spielen kann. Ist das dann reportbar, wenn ja mit welcher Begr&uuml;ndung?","replies":[{"poster":"FrankerX","date":"2016-07-04T14:30:31.107+0000","up_votes":3,"down_votes":0,"body":"also wenn du es schaffst mich im ranked so zum lachen zu bringen das ich fokus verliere, dann hut ab dafür würd ich dir n honor geben","replies":[{"poster":"Izaya Kumiho","date":"2016-07-04T17:08:24.791+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FrankerX,realm=EUW,application-id=KYnfKGf0,discussion-id=ujbhG0ZP,comment-id=0003,timestamp=2016-07-04T14:30:31.107+0000)\n>\n> also wenn du es schaffst mich im ranked so zum lachen zu bringen das ich fokus verliere, dann hut ab dafür würd ich dir n honor geben\n\ndann wärs auch i-wo den lose wert,zumindest aus meiner sicht. aber das muss schon ganz krasser stuff sein :P","replies":[]}]},{"poster":"Der Großmugister","date":"2016-07-04T13:58:24.818+0000","up_votes":2,"down_votes":0,"body":"Nein.","replies":[]},{"poster":"Alustus","date":"2016-07-04T14:01:27.945+0000","up_votes":1,"down_votes":0,"body":"Solange du diesen nicht auf Kosten eines anderen Spielers zum lachen bringst oder rassistische witze machst sehe ich da kein problem.\n\nAber ich denke dass es dir mehr Zeit Konzentration kostet witze in den Chat zu tippen als es deinem gegner kostet wenn er kurz schmunzeln/lachen muss.\nMir persönlich ist ein geschriebener witz auch noch nie so nahe gegangen dass ich einen Lachflash hatte von dem ich mich nicht beruhigen konnte.\nIst mir bisher nur mit Freunden passiert indem man sich gegenseitig hochgeschaukelt hat.","replies":[]},{"poster":"Maíko","date":"2016-07-04T13:55:00.798+0000","up_votes":1,"down_votes":0,"body":"Man könnte dich für Unsportlichkeit reporten, da du den Gegner davon abhältst Spielen zu können...\nDen Gegner könnte man für afk reporten...der Grund warum er grad nicht spielen kann ist egal, sobald er nicht mehr an der Tastatur hängt ist er \"afk\".","replies":[]}]}