{"poster":"Homunculi","date":"2016-10-21T07:22:55.039+0000","title":"13 Jähriger(DREIZEHN!!!!) Brasilianer bringt sich nach verlorenen LoL Spiel selbst um.","subforum":"Allgemeiner Chat","embed":{"description":"Eine furchtbare „Regel\" seines eSport-Teams hat einen jungen Brasilianer das Leben gekostet. Der 13-jährige Gustavo Ribeiros Detter strangulierte sich nach einem verlorenen Match beim Online-Game „League of Legends\" selbst - als „Strafe\" für die Niederlage. Übliche Strafe Im Team des Brasilianers ist es Tradition, dass sich der Spieler, der für die Pleite verantwortlich ist, selbst geißelt.","url":"http://www.express.de/sport/sportmix/esport-grausame-tradition--13-jaehriger-erdrosselt-sich-nach-verlorenem-match-24949800","image":"http://www.express.de/image/24949936/2x1/940/470/2efc9b3230d78a1f2d4f944380af1ba0/sL/esport.jpg"},"up_votes":5,"down_votes":3,"body":"Da ich noch kein Thema gefunden habe, der dies hier behandelt wollte ich es einfach mal aufmachen.\r\n\r\nJa es ist keine sch&ouml;ne Nachricht, wenn man eines seiner Lieblingsspiele in Verbindung mit sowas sieht.\r\n\r\n\r\nMir tut es um die Familie und Freunde leid und nat&uuml;rlich auch um das zu fr&uuml;h beendete Leben.\r\n\r\nWenn ich das richtig verstehe gei&szlig;eln(man f&uuml;gt sich selbst Schmerzen und/oder Verletzungen zu) sich Brasilianer nach verlorenen Spielen selbst, was wohl Tradition hat. Auch scheint es ein neuer Internet Trend zu sein, dieses &quot;Choking Game&quot;.\r\n\r\nSorry aber Tradition hin oder her, es ist Strunzd&auml;mlich und v&ouml;llig Hirnverbandt sich selbst zu verletzen, warum auch immer. Auch nehmen diese &quot;Internet Trends&quot; immer d&uuml;mmere Ausma&szlig;e an ... Blanking war schon dumm, Batmanning noch d&uuml;mmer, Ice Bucket Challenge hatte wenigstens noch nen Sinn war aber trotzdem nervig und gestorben sind wohl auch noch welche, diese &quot;Halte einen Stift mit deiner Brust-Challenge&quot; war auch nur der gegl&uuml;ckte Versuch kleiner  Vollnasen an Ornanievorlagen zu kommen und die M&auml;dels, so hohl einige wohl waren, haben flei&szlig;ig mitgemacht. Mehr hab ich jetzt nicht mitbekommen oder gekonnt vergessen/ignoriert.\r\n\r\nBitte denkt selbst mal nach was ihr euch selbst und/oder anderen antut und welche Folgen das evtl. haben kann, nicht nur im Spiel sondern im gesamten Leben. Man muss nicht jeden Rotz mitmachen nur weil es andere tun (ja das alte Beispiel mit der Br&uuml;cke und den vielen Leuten die da runter h&uuml;pfen).\r\n\r\nIch hoffe nur das RIOT keinen gro&szlig;en &Auml;rger deswegen bekommen wird, da sie ja eigtl. nichts daf&uuml;r k&ouml;nnen, ob sie es verhindern h&auml;tten k&ouml;nnen bleibt auch fraglich, ich denke nein.\r\n\r\nMehr f&auml;llt mir im Moment nicht ein.","replies":[{"poster":"Uranbrennstab","date":"2016-10-21T08:00:18.614+0000","up_votes":2,"down_votes":8,"body":"Was erwartest du denn? In diesem Land werden Leute auf offener Straße mit Taschenmessern enthauptet. Wenn du beim beklauen der falschen Leute erwischt wirst schießen sie dir in die Hand oder hacken sie ab, wohlgemerkt muss der Dieb sich danach bedanken und das Körperteil selbstständig in Position bringen. Da wundert mich solche Barbarei nicht im mindesten.","replies":[{"poster":"Schlachtenhorn","date":"2016-10-21T10:38:28.464+0000","up_votes":3,"down_votes":0,"body":"Deine Wortwahl, Vorurteile und Ansichten sind nicht im mindestens besser wie deine Behauptungen.","replies":[{"poster":"Uranbrennstab","date":"2016-10-21T10:55:32.751+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Schlachtenhorn,realm=EUW,application-id=YnZkMR0R,discussion-id=9vNTXg1T,comment-id=00000000,timestamp=2016-10-21T10:38:28.464+0000)\n>\n> Deine Wortwahl, Vorurteile und Ansichten sind nicht im mindestens besser wie deine Behauptungen.\n\nAls deine Behauptungen. Und seid wann sind Tatsachen gut oder böse? Oder meinst du wirklich ich habe mir das Ausgedacht?  Dann muss ich dich enttäuschen, soetwas passiert in Brasilien Tatsächlich. Ich halte den Ausdruck Barbarisch für sehr angemessen.","replies":[{"poster":"Alustus","date":"2016-10-21T11:26:34.722+0000","up_votes":3,"down_votes":0,"body":"Nicht ganz so wie du es beschrieben hast.\nJa in Brasilien wird viel gelyncht weil die Polizei nichts auf die Reihe bekommt. (Aufklärungsrate bei ca. 10%)\n\nAber in deinem Post kommt es so rüber als würde die Polizei, diese dinge durchführen oder das alles Gesetzlich erlaubt ist.\n\nHinzu kommt das es hier um etwas ganz anderes geht, und dieser Unfall zwar vollkommen Sinnlos/Unnötig war, aber  das hat nichts mit der Lynchproblematik zu tun oder mit Barbarei sondern mehr mit Dummheit und Pech.\n\n(Das lynchen ist sicherlich Barbarei, hat aber das steht hier mit diesem Fall nicht in Verbindung)","replies":[]}]}]},{"poster":"LokiOdinson","date":"2016-10-21T14:18:34.575+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Uranbrennstab,realm=EUW,application-id=YnZkMR0R,discussion-id=9vNTXg1T,comment-id=0000,timestamp=2016-10-21T08:00:18.614+0000)\n>\n> Was erwartest du denn? In diesem Land werden Leute auf offener Straße mit Taschenmessern enthauptet. Wenn du beim beklauen der falschen Leute erwischt wirst schießen sie dir in die Hand oder hacken sie ab, wohlgemerkt muss der Dieb sich danach bedanken und das Körperteil selbstständig in Position bringen. Da wundert mich solche Barbarei nicht im mindesten.\n\nDir ist schon klar das in Asien - der Geburtsstätte der \"besten\" ESport-Spieler und den typischen Gewinnern aller nennenswerten Turniere dort - auch nicht großartig besser ist als Brasilien?","replies":[{"poster":"Uranbrennstab","date":"2016-10-21T23:27:50.484+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=LokiOdinson,realm=EUW,application-id=YnZkMR0R,discussion-id=9vNTXg1T,comment-id=00000002,timestamp=2016-10-21T14:18:34.575+0000)\n>\n> Dir ist schon klar das in Asien - der Geburtsstätte der &quot;besten&quot; ESport-Spieler und den typischen Gewinnern aller nennenswerten Turniere dort - auch nicht großartig besser ist als Brasilien?\n\nWeil Asien bekanntlich ein Land ist und es auch überhaupt keine Kulturellen Unterschiede gibt. Digga was?! Asien?! Dein ernst? Das ist ein Kontinent. Da leben Milliarden Menschen in verdammt vielen Ländern, mit unterschiedlichen Kulturen. Für dich sind wahrscheinlich auch Chinesen und Japaner ein und das selbe.","replies":[]}]}]},{"poster":"Ozuraak","date":"2016-10-21T09:34:10.097+0000","up_votes":3,"down_votes":3,"body":"Da haben wir wohl einen Anwärter für den Darwin Award.","replies":[{"poster":"lOIoIOIoIOIoIOl","date":"2016-10-21T17:01:11.559+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Ozuraak,realm=EUW,application-id=YnZkMR0R,discussion-id=9vNTXg1T,comment-id=0003,timestamp=2016-10-21T09:34:10.097+0000)\n>\n> Da haben wir wohl einen Anwärter für den Darwin Award.\n\nNein, das war alles andere als dumm. Bei einer Execution bekommt der Gegner kein Gold.","replies":[{"poster":"Ozuraak","date":"2016-10-23T15:47:45.526+0000","up_votes":1,"down_votes":0,"body":"Haha. Made my day ^^","replies":[]}]}]},{"poster":"Alustus","date":"2016-10-21T10:36:32.749+0000","up_votes":2,"down_votes":0,"body":"> Wenn ich das richtig verstehe geißeln(man fügt sich selbst Schmerzen und/oder Verletzungen zu) sich Brasilianer nach verlorenen Spielen selbst, was wohl Tradition hat. \n> \n\nNur in diesem Team.\nEs war einfach ein dumme Teamregel welche die Spieler selbst aufgestellt haben.\nIn Brasilien an sich ist es nicht üblich sich selber zu verletzen usw. wenn man einen Fehler gemacht hat.\n\n\nSelbstbestrafung nach Niederlagen ist an sich auch nicht schlimm, sofern man es sinnvoll oder in maßen macht.\nIch und ein paar Freunde haben mal Ligestütze als Strafe für einen Tod gemacht, was an sich eine WinWin Situation ist, einerseits konzentriert man sich mehr und andererseits tut man etwas für seinen Körper.\n\n\n> Ich hoffe nur das RIOT keinen großen Ärger deswegen bekommen wird, da sie ja eigtl. nichts dafür können, ob sie es verhindern hätten können bleibt auch fraglich, ich denke nein.\n\nIch denke nicht das Riot deswegen ärger bekommt.\nDa diese selbstgemachte Bestrafung in der Gruppe beschlossen wurde.\nWenn Riot das in irgendeiner Weise fördern würde wäre es etwas anderes (Challanges wer sich härter bestraft oder etwas in diese Richtung).\n\nFür mich ist eigentlich auch klar das Riot da nichts dagen machen kann oder sotwas verhindern.\n\n\nFür mich ist ganz klar das hier die schuld eher beim näheren Umfeld, bzw. bei seinem Team liegt. \n(davon mal abgesehen das der Tote natürlich die Hauptschuld trägt)","replies":[{"poster":"Homunculi","date":"2016-10-21T11:01:46.911+0000","up_votes":1,"down_votes":1,"body":"Ich war kurz schockiert, als ich gelesen hab \"Wir haben das auch mal gemacht\". Bin aber deiner Meinung, dass Liegestütze doch eine WinWin Situation sind. Mir würden wohl nach dem zweiten Spiel die Arme abfallen x___x.","replies":[]}]},{"poster":"Flüssigsubstanz","date":"2016-10-21T09:39:35.346+0000","up_votes":2,"down_votes":0,"body":"Es ist traurig das sowas passiert und ich finde es auch schade um die Familie, wenn es denn eine nette Familie war und kein Einfluss drauf hatte. \nSo gefühllos das auch klingt, aber ich finde das liegt auch weniger am spiel sondern vielmehr an der Person, vielleicht auch der Erziehung die einem so beigebracht wird. Wobei ich auch sagen muss, wenn es das Kind ohne Einfluss durch andere so getan hat, klingt das jetzt harsch, ist das fast schon sowas wie natürliche Selektion. Genauso wie diese Beispiele die du genannt hast mit der batmanning challenge, sich selbst anzünd challenge und vielen dummen Sachen mehr die ich nicht kenne da ich solche Videos nicht gucke, dort frage ich mich auch wie Leute einfach so dumm sein können um das nachzumachen. Erstmal könnten sie vielleicht Kreativ sein und selbst ne challenge erfinden, aber nichtsdestotrotz haben die challenges auch überhaupt gar keinen Sinn außer ein wenig Aufmerksamkeit zu erregen, das nachner Woche höchstens vorbei ist.\n\nIch kenn mich mit der brasilianischen Kultur nicht aus aber wenn das stimmt das man sich selbst geißelt, sollte es dort sicherlich auch grenzen geben oder man sollte die tradition einfach mal vergessen. Ich mein wenn wir uns heute noch an \"Traditionen\" halten würden gäbe es noch hier die todesstrafe und bei diebstahl würden einem die finger abgeschnitten etc etc. Ich finde in den jungen alter haben viel weniger die Kinder selbst damit was zu tun sondern vielmehr die Leute die ihnen die Welt so grauenhaft zeigen das sie nicht mehr leben wollen. \nAls Beispiel nenne ich einfach mal die ganzen Amokläufe die immer wieder mal in Amerika vorkommen, wo dann auch alles auf die spiele geschoben werden. \nMal abgesehen davon das du dir dort Waffen annen Automaten kaufen kannst, Ich wette um 95% das es nicht daran liegt das jemand \"Killer\" spiele spielt um die lust zu bekommen Leute umzubringen sondern es vielmehr daran liegt das man in der Schule gemobbt wird, zuhause nicht eine wirkliche familie hat, man allein gelassen wird, keine Unterhaltung kriegt, keine richtigen freunde hat etc. etc. \nWenn man jedoch die vorhin genannten Sachen hat und dann trotzdem sowelche aktionen macht wie Selbstmord oder Amokläufe mit gefolgten Selbstmord, Challenges die einen Umbringen können, finde ich keine Sympathie für die Leute die das anstellen sondern muss Herzlos sagen das es einfach von Natur aus \"besondere\" Leute sind/waren. \n\nGroßen Ärger wird Riot dadurch wahrscheinlich nicht bekommen, weil ich mein wie oft kam was in den nachrichten über Counter Strike und WoW? Ich denke es wird sich nicht viel ändern bei Riot.","replies":[]},{"poster":"Hibernius Riesig","date":"2016-10-21T08:51:29.758+0000","up_votes":2,"down_votes":0,"body":"Was genau willst du uns mit dieser Nachricht sagen? Ich ralls leider net...","replies":[{"poster":"Homunculi","date":"2016-10-21T09:15:49.246+0000","up_votes":1,"down_votes":1,"body":"Ich hab die Nachricht heute morgen zufällig gefunden und wollte sie hier teilen.\n\nL2PGragas hat es schön beschrieben und ich stimme ihm in allem zu.\n\nAuch wollte ich ein wenig zum denken anregen, dass man nicht jeden Rotz mitmachen muss, egal was das Internet sagt.","replies":[]}]},{"poster":"Shacoláde","date":"2016-10-21T08:17:13.333+0000","up_votes":3,"down_votes":1,"body":"An dieser Stelle könnte man wieder eine Latte vom Zaun brechen über das was Spiele mit \nLeute anstellt. Das Leute die Realität von der Fiktion ab einen gewissen Grad \nnicht mehr unterscheiden können. Dieser Fall ist leider keine Einzelfall.\nIn WoW hab ich damals gelesen, dass es jmd gegeben hat der über mehrer \nTage das Game am Stück gezockt hat und dann an Unterernährung gestorben ist, \nweil er während dieser Zeit vergessen hat irgendwas zu essen.\nEs gibt manche Menschen die jeglichen Sinn für die Relität verlieren und sein\n leben völlig dem Game widmen. Diese Fremdecken ist aber nicht Sache der \nSpielentwickelers sondern die Sache der Personen selbest und  auch deren Erziehung.\nMit 13 Jahren durfte ich nur online gehen, wenn ich etwas für die Schule brauchte.\nAn zocken wäre da gar nicht zu denken gewesen. \nLetzens hab ich wieder mit jmd gespielt, den ich ingame geaddet habe und ich ab und an\n mal spiele. Da sind wirs erste mal in TS und hab  gefragt wie alt er ist, weil er\n sich so jung anhört. Dann war er ebenfalls erst 13 Jahre alt. Und zu der Uhrzeit \nwo ich meistens mit Ihm spielte war 22Uhr + UNTER DER WOCHE. Der Kerl\nhatte am nächsten Tage Schule und Zockt bis in die Puppen.\nÜber die Jahre hat sich das Verhalten zu Onlinegame komplett geändert.\nDementsprechend liegt es auch in der Verantwortung der Eltern zu verstehen, was\ndie Kinder eigentlich alles so am Rechner treiben.\n\nDas so etwas passiert ist echt tragisch.\nMuss aber ehrlich gestehen, dass es mich nicht sonderlich überrascht hat.\nEs hat sich in derer Hinsicht soviel verändert in so wenig Zeit, dass das Ausmaß\n nur in einem begrenzten Rahmen erfasst werden kann.\n\nRiot hat an diesem Drama keine Schuld... wie sollte sie auch?\nMan verklagt auch keinen Treppenhersteller, wenn jmd beim Treppensteigen die Stufe verfehlt und sich dabei das \nGenick bricht.\nMir macht die Mentalität der Menschen bezug  aufs Zocken mehr Sorgen, als die Gameentwicklung ansich.","replies":[{"poster":"Homunculi","date":"2016-10-21T09:21:53.611+0000","up_votes":1,"down_votes":1,"body":"Sehr schön gesagt :). Das von dem WoWler hab auch mal mitbekommen. \n\nIch denke, es wird wahrscheinlich erstmal eine Welle der Empörung durch das Netz gehen und evtl. wird irgendwas gefordert werden. Solange nicht der gleiche Aufschrei wie damals mit Counter Strike los geht ist es noch \"ok\".\nOder es wird irgendwo in der Versenkung/Vergessenheit verschwinden.\n\nDas mit der Treppe: Ich musste irgendwie sofort an die USA denken =/ und das es dort bestimmt möglich wäre jemanden wegen sowas zu verklagen.","replies":[]}]}]}