{"poster":"Shoma","date":"2017-04-20T19:58:18.711+0000","title":"Account level down  30 to 22 and masteries/runes are corrupted","subforum":"Report a Bug","up_votes":5,"down_votes":1,"body":"Ok so for some reason i don&#039;t understand my account lost 8 levels, and it made me unable to change the masteries im using cus it just doenst save, each time i try to change the mastery page it tells me it cant connect to the server or something and the page says i have -8 points to spend, what?, and the same goes when i try to edit my runes so not only i cant get stronger runes, i just cant play a game without using thunderlord  cus the game doenst let me use other matery pages, and right now im playing a bit and i got to lvl23(yey) and now it reads i only have -7 points but pls tell me there is something i can do, i sent 2 tickets to riot and they just tell me they are going to contact me soon, Now this wouldnt be that bad if i could change masteries or runes but it cant and im forced to go anywhere with thunderlords, so yeah idk what to do other than keep playing and asking to be mid everysingle game","replies":[{"poster":"MarshmallowBob","date":"2017-04-20T22:05:21.145+0000","up_votes":4,"down_votes":0,"body":"Hey Shoma, don't worry -- we're aware of this happening to some players. Looks like you've been taken care of by our support folks already, but reach out if you have any more problems :)","replies":[]},{"poster":"Draven oo7","date":"2017-04-20T20:17:12.176+0000","up_votes":1,"down_votes":3,"body":"dont auto bot or cheat, that is why you went down levels.\n#caseclose","replies":[{"poster":"Deep Terror Nami","date":"2017-04-20T20:44:56.082+0000","up_votes":4,"down_votes":0,"body":"Riot does not de-level accounts for botting, they ban them.","replies":[]},{"poster":"Shoma","date":"2017-04-20T20:25:21.413+0000","up_votes":2,"down_votes":0,"body":"I dont do that, im new to the game and this is my first account ever D:","replies":[]}]},{"poster":"Dark Volton","date":"2018-01-11T06:17:54.816+0000","up_votes":1,"down_votes":0,"body":"i know its been a while, but is this still a thing? fairly sure my account level dropped as well... i was pretty sure i was 48 a couple days ago and then i leveled up today and it was 44.","replies":[]}]}