{"poster":"Mcnakstar","date":"2018-01-28T15:02:14.038+0000","title":"Smurfing -Fair oder nicht?","subforum":"Spielerverhalten & Moderation","up_votes":3,"down_votes":8,"body":"Ich bin nur ein einfacher Toplaner. Main Champ könnt ihr selbst nachgucken wenn ihr wollt und ich bin der Meinung das die Smurf ausgeschaltet werden müssen. Die Leute die nur \"etwas Spaß haben wollen\" machen den Gegner ihr Leben zur Hölle. Denn man hat nicht die gleiche Erfahrung, wie sein Gegner, was dann einfach komplett unfair ist. Es ist schön zu sehen wenn man weiß das man gegen bessere Spieler muss, aber diese Leute haben es nicht unten in den Low-Elos\r\nverloren. Es ist einfach nur deprimierend und demütigend, dass man auf 0/10/0 gestompt wird und dann vom eigenem Team geflamt wird. Ich wusste ja nicht das er dies mit dem combiniert hat und ich wusste es nicht einmal. Und wenn die Leute auf dem Acc. gebannt wurden, dann wird einem die Nachricht gegeben. \"So du hast das getan und dafür darfst du nicht mehr auf dem Acc spielen.\" Ein Bann ist ein Verbot und das lautet: Du darfst nicht mehr League of Legends spielen!\" Und die Leute welche z.B Gold sind dürfen dann halt nicht mit Diamondspielern climben. Riot hat diese Regel aufgestellt und an die sollte man sich auch halten. Stattdessen musst DU \r\n{{sticker:sg-soraka}} \r\ndich nach oben führen.\r\n\r\nBitte versteht mein Problem, doch ich verabscheue so einen Mist, weil das keinen wahren Kampfgeist zeigt.\r\n{{sticker:sg-janna}}","replies":[{"poster":"Awsane","date":"2018-01-28T16:34:51.791+0000","up_votes":3,"down_votes":4,"body":"Hi\n\nIm Prinzip hast du Recht und Smurfen ist unfair, weil einfach nicht der Skill der selbe ist das MMR aber schon.\n\nUnd generell duldet LoL smurfs auch nur, also direkt erlaubt sind sie nicht.\n\nDas Problem ist folgendes, LoL ist mittlerweile echt nicht mehr anfängerfreundlich und wenn jetzt nen Kumpel LoL anfangen möchte ist es definitiv nicht sinnvoll mit seinem Main Account zu spielen, außer in dem einem Fall, indem der Neuling sehr wissbegierig und Frusttollerant ist. \n\nIst er es nicht ist die Wahrscheinlichkeit, dass er weiterspielt mit dem Veteran eher gering weil er nur Verlieren wird und eine Last fürs Team ist und das wahrscheinlich auch so merken wird und dadurch demotiviert wird. Macht sich der Veteran nun einen Smurf, bekommt der Neuling wahrscheinlicher viel mehr positive Momente mit als mit der anderen variante und wird so eher beim Spiel bleiben. Natürlich ist das Unfair dann für die anderen, aber aus der SIcht des Veterans der will das sein Kumpel mit ihm lange LoL spielt ist das die beste Variante und das muss man auch irgendwo berücksichtigen.\n\nGenerell ist LoL in einer Coop-Wettbewerbs Zwickmühle. Es will einerseits, dass Freunde miteinander spielen können und auf der anderen Seite ein faires und ausgeglichenes Matchmaking. Beides lässt sich aber so nicht bewerkstelligen aber Riot möchte weder die Coop-Spieler noch die Competitiv Spieler verlieren (was bei zu harten Regeln zu einer der beiden Seiten passieren würde) daher gibt es diesen Kompromiss.\n\n\n\nAuf der anderen Seite gibt es dann noch den Technische und Rechtliche Aspekte. Es ist meines Wissens in Europa nicht erlaubt einzelne Personen von etwas auszuschließen. Sprich Riot darf gar nicht sagen \"DU darfst nie wieder LoL spielen\". Daher ist ein Permanenter Personenbann z.B. gar nicht erlaubt und wäre zudem auch Technisch nur sehr schwer zu bewerkstelligen und das wahrscheinlich nicht mal mit legalen mitteln, weil Riot müsste ja dich dann irgendwie identifizieren und dafür auf Daten auf deinem PC zugreifen, was sie so nicht dürfen. \n \nDurch das schwierige identifizieren von Accounts zu Personen ist es daher auch so gut wie nicht möglich smurfs zu verbieten, weil es einfach nurn mit einem viel zu hohen aufwand möglich wäre. \n\nWenn du eine Gute Idee hast, wie man das lösen kann denke ich ist Riot jederzeit bereit sie zu hören, aber sich aus aktueller sicht über smurfs aufzuregen ist zwar verständlich aber leider sonst sehr wirkungslos, weil Riot sich der Problematik durchaus bewusst ist und einfach noch kein gutes mittel gefunden hat damit umzugehen und somit es erstmal so belässt wie es ist, da sie mit dem Aktuellen Umgang mit smurfs keine großen Spielerverluste haben.","replies":[{"poster":"Stichsaege","date":"2018-01-30T21:57:12.685+0000","up_votes":2,"down_votes":8,"body":"Hallo.\n\nIch habe mich mit Riot schon so lange um eine faire Lösung bemüht.\n\nRiot gibt dir immer die selbe Antwort . \nSmurst steigen schnell auf und Spielen dann wieder in Ihre Main Elo.\n\nFair wäre es wenn Riot die Smurfs kennzeichnet, mit Ihre Main Elo.\nWas spricht dagegen wenn ein Neuling und ein Dia Spieler zusammen spielen ? Nichts.\nDann kann ganz einfach in Beiden Team ein Neuling und ein Dia Spieler gemacht werden.\nAber Riot will lieber das sich der Dia Spieler eine weiten Acc erstellt, wo er eventuell wieder Geld für  aus gibt.\nAus das ein Elo Manipulation ist ignoriert Riot samt aller Folgen für das Spiel.","replies":[{"poster":"Qbert","date":"2018-01-31T06:20:59.340+0000","up_votes":6,"down_votes":0,"body":"> Fair wäre es wenn Riot die Smurfs kennzeichnet, mit Ihre Main Elo.\n\nUnd dann?\nDann werden Dia-Smurfs nur mit Dia-Leuten gematcht? Das macht das System nach ein paar Spielen automatisch.\nDer Sinn von Smurfs ist aber, mit Freunden aus niedrigerer Elo auch mal zusammen spielen zu können.\n\n> Was spricht dagegen wenn ein Neuling und ein Dia Spieler zusammen spielen ? Nichts\n\nDoch, o.g. Elo über die du dich nur beschwerst.\nDu willst als Low-Elo-Spieler nicht gegen Highelo spielen. Jetzt sagst du aber, Neulinge(die absolute Low-Elo sind) sollen mit Dia-Spielern zusammen spielen dürfen, sprich auch GEGEN Dia-Spielern.... das ergibt keinen Sinn.\n\nDeine Argumente sind wir immer nicht nur schlecht, sondern auch falsch und hebeln sich gegenseitig aus.\n\n> Aus das ein Elo Manipulation ist ignoriert Riot samt aller Folgen für das Spiel.\n\nRiot ist sich dessen sehr wohl bewusst.\nDas erkennt man schon an der Antwort, die du ja so gerne mit anbringst.\nSmurfs steigen schnell auf. Das impliziert, dass sie unten anfangen, in einer Elo in die sie nicht gehören, und sich hochspielen .... das geschieht aber recht schnell.\nDiese von dir schon plakativ bezeichnete \"Elo-Manipulation\" findet also nur ein paar Spiele lang statt. Das ist absolut vertretbar.","replies":[{"poster":"Stichsaege","date":"2018-01-31T16:41:39.375+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=Qbert,realm=EUW,application-id=KYnfKGf0,discussion-id=UVp9EWO4,comment-id=000300010000,timestamp=2018-01-31T06:20:59.340+0000)\n>\n\n> Doch, o.g. Elo über die du dich nur beschwerst.\n> Du willst als Low-Elo-Spieler nicht gegen Highelo spielen. Jetzt sagst du aber, Neulinge(die absolute Low-Elo sind) sollen mit Dia-Spielern zusammen spielen dürfen, sprich auch GEGEN Dia-Spielern.... das ergibt keinen Sinn.\n> \n\nAlso wie soll ich das verstehen ?\nSollen Smurfs fair sein weil sie auf den Smurf Acc die gleichen Low Elo haben wie einer der auf sein Main in der Low Elo ist ?\n\nSmurfs sind Unfair weil sie den Gegner und System ein falsche Elo vortäuschen und somit nur in eine Team ein high Elo Spieler mit sein Smurf sein kann.\n\nWenn Dia mit Bonze zusammen Spielen kann jeder sehen das es ein Dia spieler ist und das System kann in beiden Team ein Dia Spieler stecken. Somit wird keine mehr getaut und das Match ist fair weil in beiden Team die gleichen Elos vertreten sind.","replies":[{"poster":"Awsane","date":"2018-01-31T18:20:34.752+0000","up_votes":2,"down_votes":0,"body":"Das Problem ist, dass die anderen 3 Leute pro Team, das nicht wollen werden\n\nniemand möchte in nen smurf spiel im ranked geraten. Einfach weil die spiele, dann eine ganz unangenehme Dynamik bekommen, in denen der eigene Impact doch deutlich sinkt.\n\n\nEs gibt ja nicht umsonst diese Begrenzung mit welchen Skillunterschied man zusammenspielen darf.\n\nEs ist auch etwas komplexer, ich habe den Support mal gefragt und dazu nen post gemacht. \n hier der post dazu\n\nhttps://boards.euw.leagueoflegends.com/de/c/spielerverhalten-de/Hj86EnUY-frage-an-den-support-zum-thema-duo-q-boosting-mit-antwort\n\n\nZudem besteht immer noch das Problem darin, Personen einen Account zuzuweisen, sprich deine Idee ist wie erwähnt sehr schwer technisch und rechtlich umsetzten ist.","replies":[{"poster":"Stichsaege","date":"2018-01-31T19:39:16.548+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Awsane,realm=EUW,application-id=KYnfKGf0,discussion-id=UVp9EWO4,comment-id=00030001000000000000,timestamp=2018-01-31T18:20:34.752+0000)\n>\n> Das Problem ist, dass die anderen 3 Leute pro Team, das nicht wollen werden\n> \n> niemand möchte in nen smurf spiel im ranked geraten. Einfach weil die spiele, dann eine ganz unangenehme Dynamik bekommen, in denen der eigene Impact doch deutlich sinkt.\n> \n\ngenau des wegen sind Smurfs doch unfair, Des wegen versuche ich doch schon solange das es erst überhaupt \nkeine Smurfs mehr in LoL gibt. \n> \n> Es gibt ja nicht umsonst diese Begrenzung mit welchen Skillunterschied man zusammenspielen darf.\n> \n\nJa genau. Und diese wird, durch die Manipulation der Elo von Smurf umgangen.\n\n> Es ist auch etwas komplexer, ich habe den Support mal gefragt und dazu nen post gemacht. \n>  hier der post dazu\n> \n> https://boards.euw.leagueoflegends.com/de/c/spielerverhalten-de/Hj86EnUY-frage-an-den-support-zum-thema-duo-q-boosting-mit-antwort\n> \n> \n> Zudem besteht immer noch das Problem darin, Personen einen Account zuzuweisen, sprich deine Idee ist wie erwähnt sehr schwer technisch und rechtlich umsetzten ist.\n\nIch habe etwas von Hardware Banns gehört, Ip Banns und das Riot am Spielstiel und Klick verhalten bestimmen kann ob ein Dia Janna Spieler ein Spieler aus EUW oder Korea ist.\nIst also möglich Jeden Spieler nur ein Acc zuzuweisen.","replies":[{"poster":"Balmung","date":"2018-02-01T01:00:16.248+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Stichsaege,realm=EUW,application-id=KYnfKGf0,discussion-id=UVp9EWO4,comment-id=000300010000000000000000,timestamp=2018-01-31T19:39:16.548+0000)\n\n> Ich habe etwas von Hardware Banns gehört, Ip Banns und das Riot am Spielstiel und Klick verhalten bestimmen kann ob ein Dia Janna Spieler ein Spieler aus EUW oder Korea ist.\n> Ist also möglich Jeden Spieler nur ein Acc zuzuweisen.\n\nIP-Banns sind nutzlos.\nHardware-Banns wären Schwachsinn. In Korea spielt ein großer Teil der Community über Internetcafés, bei uns teilen sich viele jüngere Mitspieler gerne mal einen Rechner mit Familienmitgliedern, etc etc- viel Spaß mit Hardwarebanns.\n\nUnd bei der Menge an Spielern auf Verdacht jemanden zu bannen, weil er jemand sein KÖNNTE, wäre für jeden namhaften Spielebetreiber ein Fehler. Ein Fehler von der ganz dummen Sorte.\n\nNoch irgendwelche Ideen, welche schon 2384324x gebracht wurden? Personalausweisnummern, Handynummern, Fingerabdruck?","replies":[{"poster":"Stichsaege","date":"2018-02-02T14:58:12.282+0000","up_votes":1,"down_votes":2,"body":"Es würde doch schon reichen wenn Riot höflich darum bitte, es verlangt das man Riot mitteilt welche Acc ein gehören. Damit Riot sie genau so wie den Main werten kann. Quasie die Smurfs bei Riot anmelden muss.\n\nWenn man das nicht macht und auf ein \" nicht bei Riot \" angemalden Smurfs spiel Riot das bestraf als ob man Elo Boosting oder Acc sarring betreibt.\nDas nur die bei Riot \" angemeldeten \" Smurfs Legal sind.","replies":[{"poster":"Balmung","date":"2018-02-03T01:08:16.409+0000","up_votes":2,"down_votes":0,"body":"Irgendwie frag' ich mich ob du selbst verstehst, was du schreibst.\n\nWas wäre der Nutzen sich einen solchen Account \"anzumelden\"?","replies":[{"poster":"Stichsaege","date":"2018-02-03T01:32:13.167+0000","up_votes":1,"down_votes":2,"body":"Ist das nicht offensichtlich ?\n\nWenn man seine smurfs bei Riot anmeldet , können diese sofort 1 zu 1 wie der Main behandelt werden.\nDas macht LoL faire.\nOder Riot kann ein eigen Smurf Q erstellen, wo nur smurfs spielen. Das man die Main LoL Elo spieler schützen kann.\nLediglich Smurf könnten dann nicht mehr gegen schwäche Spieler spielen, aber das ist ja eh nie der Grund warum man sich ein Smurf erstellt.","replies":[{"poster":"Balmung","date":"2018-02-03T03:52:45.342+0000","up_votes":3,"down_votes":0,"body":"Da du es offenbar nicht verstanden hast wiederhole ich die Frage: Was wäre der Nutzen sich einen solchen Account \"anzumelden\"?\n\nMan hätte quasi eine Kopie des Mainaccounts, mit den gleichen Einschränkungen, nur ohne den Championpool und eventuelle Skins.\n\nErgo: Einen nutzlosen Account.\n\nSmurfQ gibt es bereits - wenn du auf einem Smurf levelst wirst du nach ein paar Games mit entsprechender Leistung praktisch nur noch mit anderen Smurfs gematched.\nSelbes gilt auch in Ranked, einfach weil man sehr schnell durch's Ranked rushed wenn die Leistung stimmt.\n\nAber wie oft wurde dir das nun erklärt?","replies":[{"poster":"Stichsaege","date":"2018-02-03T12:13:58.937+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Balmung,realm=EUW,application-id=KYnfKGf0,discussion-id=UVp9EWO4,comment-id=00030001000000000000000000000001000000000000,timestamp=2018-02-03T03:52:45.342+0000)\n>\n> Da du es offenbar nicht verstanden hast wiederhole ich die Frage: Was wäre der Nutzen sich einen solchen Account &quot;anzumelden&quot;?\n> \n> Man hätte quasi eine Kopie des Mainaccounts, mit den gleichen Einschränkungen, nur ohne den Championpool und eventuelle Skins.\n> \n> Ergo: Einen nutzlosen Account.\n> \n\nNicht ganz. man hat einen anderen Namen. \n\n> SmurfQ gibt es bereits - wenn du auf einem Smurf levelst wirst du nach ein paar Games mit entsprechender Leistung praktisch nur noch mit anderen Smurfs gematched.\n> Selbes gilt auch in Ranked, einfach weil man sehr schnell durch&#x27;s Ranked rushed wenn die Leistung stimmt.\n> \n> Aber wie oft wurde dir das nun erklärt?\n\nJa, sicher, weil Riot euch das erzählt.\n\nAber Ok. Wenn es bereits ein SmurfQ gibt, dann kann man doch den Smurf anmelden , damit er nur in der smurfq ( nicht mit Main Elo ) spielen kann.\nEs aber sicher gestellt ist , Das er zu 100% nie gegen Main Lo Elo spielen kann.\n\nWarum kann keine zugeben das ein Großteil des Nutzen von Smurfs es ist gegen schwäche zu spielen.\nWenn nicht anmelden , und nur noch Smurf vs Smurf","replies":[{"poster":"Balmung","date":"2018-02-04T03:07:00.071+0000","up_votes":2,"down_votes":0,"body":"Man könnte sich auch für 13900 BE einen Namechange kaufen, das kommt deutlich günstiger als sich den Championpool zu verstümmeln und die gekauften Skins nicht nutzen zu können.\n\nUnd mal eine Frage zum Thema \"Ehrlichkeit\": Hast du dir jemals die AGB durchgelesen und verstanden bevor du sie angenommen hast, obwohl du \"ehrlich\" antworten musstest, sie gelesen und verstanden zu haben?\n\nDie meisten Spieler nutzen ihre Smurfs nicht um Lowbies zu stompen, sondern aus diversen durchaus verständlichen Gründen - zu extreme Queuetimes, keine Möglichkeit mit Freunden zu spielen, neue Rolle ausprobieren ohne sich die Elo zu ruinieren, etc.\n\nVon denen bekommst du (und der größte Teil der Community) gar nichts mit.\n\nWenn ich mit meinen Kumpels 'ne Runde Magic spiele pack' ich auch nicht die teuersten Karten aus und schaue mal, wie ich die in den Boden ramme weil sie eben keine Pappe im Wert von mehreren hunderten (tausend! haha...) Euro spielen.\nAls ich noch aktiv im Tischtennis war musste ich auch ständig zurückfahren, einfach weil man im Training und mit Freunden/Bekannten nicht 24/7 auf Bundesliga-Niveau spielen kann (oder will).\nFür dich müsste solches Verhalten ja völlig unbegreiflich sein - schließlich KÖNNTE (und nach deiner Einstellung MÜSSTE) ich ja praktisch zu jedem Zeitpunkt alle Leistung abfragen und erzwingen.\nNewsflash: Nein, muss man nicht.\n\nNatürlich hast du auch immer wieder mal 'n Arschloch, welches das ganze ausnutzt. Allerdings wirst du die immer haben, ein Arschloch bleibt halt ein Arschloch, egal wie man es anstellt.","replies":[{"poster":"Balmung","date":"2018-02-04T11:12:26.950+0000","up_votes":1,"down_votes":0,"body":"Nur eine Frage zum Abschluss: Weshalb sollte ich mich bei einer entspannten Runde League entschuldigen zu smurfen, dann ein Surrendervote erzwingen, um den Gegner einen unverdienten Sieg zu schenken?\n\nFalls du irgendeine der Anspielungen auf relative Spielstärke =/= maximale Spielstärke verstanden haben solltest, würdest du so einen Mist nicht weiterhin schreiben.\n\nUnd für wen sind Botgames bitte mehr als Exp-Grind oder First Win of the Day in 15 Minuten-Games? Das als \"Argument\" zu bringen ist einfach lächerlich.","replies":[]},{"poster":"Stichsaege","date":"2018-02-04T10:29:08.640+0000","up_votes":2,"down_votes":2,"body":"Glaub mir ich verstehe was du meinst. Dien Gründe sind durchaus Nachvollziehbar.\nAber der Weg, dies mit Smurfs zu lösen ist nicht richtig.\n\n\n> \n> Die meisten Spieler nutzen ihre Smurfs nicht um Lowbies zu stompen, sondern aus diversen durchaus verständlichen Gründen - zu extreme Queuetimes, keine Möglichkeit mit Freunden zu spielen, neue Rolle ausprobieren ohne sich die Elo zu ruinieren, etc.\n\nDas kann man auch alles in Bot Games machen.\n\nAuch wenn es nicht deine Absicht ist Lowbies done zu machen , machst du es automatisch, oder sagst du kurz bevor Ihr den Nexus zerstört : Sorry, bin ein Smurf und macht ein Surr Vote und gebet den Lowbies den Sieg ?\n\nWie gesagt es wäre problemlos möglich, dafür zur sorgen das kein Low Elo Spieler ohne seine Einwilligung gegen high elo Spieler spielen muss.","replies":[]}]}]}]}]}]}]},{"poster":"Qbert","date":"2018-02-01T05:54:41.802+0000","up_votes":1,"down_votes":0,"body":"Sozialversicherungsnummer wäre ehrlich gesagt meine Idee :D","replies":[{"poster":"Stichsaege","date":"2018-02-03T12:15:50.000+0000","up_votes":1,"down_votes":2,"body":"Zu viele Sicherheitslücken.\n\nEhrlich zu geben welche Acc Smurfs sind + Strafe bei nicht tun ist Einfach und Erfüllt seine Sinn","replies":[]}]}]},{"poster":"Awsane","date":"2018-02-05T09:47:37.992+0000","up_votes":1,"down_votes":0,"body":"Hardware Banns sind unzulässig, weil dafür muss Riot auf deinen PC zugreifen um an die Daten zu kommen und das dürfen sie nicht. Ip banns haben zu viele Nachteile (jeder Haushalt mit mehr als einer Person wären davon dann betroffen und unschuldige zu bestrafen ist ein No Go, daher nein .Ip banns gehen nicht meiner Meinung nach)\n\n> Es würde doch schon reichen wenn Riot höflich darum bitte, es verlangt das man Riot mitteilt welche Acc ein gehören. \n\nwozu?\n\nAlle die Smurfen um ein neues MMR zu bekommen, was ungefähr der Sinn von fast allen smurfs ist würden lügen.\n\nund ja Riot kann schon erkennen an einigen Indikatoren in welche Elo man gehört und es gibt auch Regionale unterschiede, aber dadurch kann man nur Elo und Region abschätzen aber nicht einen Account einer Person zuordnen.","replies":[{"poster":"Stichsaege","date":"2018-02-05T17:57:18.736+0000","up_votes":1,"down_votes":0,"body":"Des wegen doch das anmelden, Dann weiß Riot genau die Elo des Main, das es ein smurf ist.\n\nIch will doch nur das Riot dafür sorgen kann das wirklich kein Loe elo Spieler ungefragt gegen ein High Elo spieler spielen muss.\nWenn Sie zusammen Spielen wollen müssen _BEIDE_ den zustimmen und können dann in ein ( SmurfQ ) gemacht werden.\n\nIch will doch nur das alle Smurf Acc öffentlich auch als Smurf Acc erkannt werden können. nicht das man den Namen des Main dann kenn würde, aber halt das es ein smurf ist.\nIch will selber prüfen können das ich zu 100% gegen keine Smurf spielen muss.","replies":[]}]}]}]},{"poster":"Qbert","date":"2018-02-01T05:52:39.303+0000","up_votes":1,"down_votes":0,"body":"Ja, Smurfs sind unfair ... da sind wir uns ja schon seit geraumer Zeit einig.\nAber ich wage mal zu behaupten, dass Smurfs innerhalb von 10-12 Spielen in der MMR so weit aufgestiegen sind, dass sie gegen nahezu ebenwürdige Gegner spielen.\n\nDieser kurze Zeitraum ist also ernsthaft zu vernachlässigen.","replies":[{"poster":"Stichsaege","date":"2018-02-01T23:10:59.578+0000","up_votes":1,"down_votes":1,"body":"Das es ja wesentlich länger dauert als 20 Games kommen weiter Probleme.\n\nDa es so viele Snurfs gibt, somit es in beiden Teams Smurfs geben kann , muss dann einer des Smurfs Verlieren.\nSomit denke ich das ein Smurf 8 Games pro Stufe brauch. Also 40 Games Pro Elo.  Also 40 Games in Silber , 40 Gold Game und 40 Platin Games. Macht als 120 Games von Silber zu Dia.\n\nWas in mein Augen viel zu weil ist.","replies":[{"poster":"Qbert","date":"2018-02-02T05:42:37.128+0000","up_votes":2,"down_votes":0,"body":"das stimmt doch gar nicht ... \nwenn ich (mal abgesehen von dieser Saison) nach den Placements in Gold eingestuft wurde, sagen wir Gold3, dann war ich in der letzten Saison innerhalb von ca. 50 Spielen in Platin 2.\nEs hat keine 20 Spiele gedauert um in Platin zu kommen, meine MMR jedoch war schon länger in Platin. Ich habe also nicht mal gegen Gold-Spieler nach spät. 5 Spielen gespielt.\nEs dauert je nach Main-Elo sogar wesentlich kürzer als 20 Spiele.","replies":[{"poster":"Stichsaege","date":"2018-02-02T14:54:38.885+0000","up_votes":1,"down_votes":1,"body":"Auch wenn du eine Stufen überspringst, braucht du 7 Games für 2 stufen also immer noch 20 Games um von Silber 5 in Gold 5 zu kommen.","replies":[{"poster":"Qbert","date":"2018-02-05T05:49:29.055+0000","up_votes":1,"down_votes":0,"body":"Das ist doch korrekt.\nAber es geht doch da eher um die MMR, nicht um den angezeigten Rang an sich.\nDenn die MMR würde in diesem Fall schneller steigen, sodass du, wenn du in G5 ankommst, sicherlich gegen G2-P5 spielen wirst.","replies":[]}]}]}]}]}]}]}]},{"poster":"Released Ape","date":"2018-01-29T00:19:24.213+0000","up_votes":3,"down_votes":0,"body":"> Es ist meines Wissens in Europa nicht erlaubt einzelne Personen von etwas auszuschließen. \n\n\"Sie haben für immer Hausverbot!\"\n\"Haha, wir sind in Europa - da können sie ein Individuum wie mich nicht ausschließen!\"","replies":[{"poster":"Stichsaege","date":"2018-01-30T22:05:33.727+0000","up_votes":1,"down_votes":1,"body":"Man darf keine von der Allgemeinheit ausschließen, das sind alle Gleich.\nEigentum ist da was anderes.","replies":[{"poster":"Qbert","date":"2018-01-31T06:23:12.743+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Stichsaege,realm=EUW,application-id=KYnfKGf0,discussion-id=UVp9EWO4,comment-id=000300000000,timestamp=2018-01-30T22:05:33.727+0000)\n>\n> Man darf keine von der Allgemeinheit ausschließen, das sind alle Gleich.\n\nStaatsbedienstete dürfen das sehr wohl.","replies":[]}]}]},{"poster":"Revilous","date":"2018-02-02T16:06:34.344+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Awsane,realm=EUW,application-id=KYnfKGf0,discussion-id=UVp9EWO4,comment-id=0003,timestamp=2018-01-28T16:34:51.791+0000)\n>\n> Und generell duldet LoL smurfs auch nur, also direkt erlaubt sind sie nicht.\n>  \n> ist es daher auch so gut wie nicht möglich smurfs zu verbieten\n\nAlso ist smurfen nicht erlaubt aber man darf smurfen alles klar macht Sinn","replies":[{"poster":"Awsane","date":"2018-02-05T09:41:15.544+0000","up_votes":1,"down_votes":0,"body":"Zum 1. Zitat, Riot hat dazu genau das gesagt, also dass sie smurfs nur dulden und nicht erlauben. \n\nDas 2. Zitat ist auf die technischen Möglichkeiten bezogen. Also etwas ganz anderen als Riots Grundeinstellung sondern einfach ob es machbar ist.\n\ndaher wirkt es so gegensätzlich. Aber das was man will und das was man kann, können ja unterschiedliche Sachen sein.","replies":[{"poster":"Revilous","date":"2018-02-05T16:17:02.729+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Awsane,realm=EUW,application-id=KYnfKGf0,discussion-id=UVp9EWO4,comment-id=000300020000,timestamp=2018-02-05T09:41:15.544+0000)\n>\n> Zum 1. Zitat, Riot hat dazu genau das gesagt, also dass sie smurfs nur dulden und nicht erlauben. \n\nAh ja zum Glück hast du hierzu eine Quelle und hast dir das nicht einfach ausgedacht weil du es gerne so hättest","replies":[{"poster":"Awsane","date":"2018-02-05T21:17:40.307+0000","up_votes":1,"down_votes":0,"body":"https://na.leagueoflegends.com/en/news/community/q/lets-talk-smurfs-snow-and-bans-ask-riot\n\n> Is smurfing okay? Why don’t you have better solutions in place for this?\n(Note: This question generated a lot of interesting internal dialogue. So we wanted to include two Rioters in an edited conversation for this question, to highlight that we don’t always have all the answers.) \nIt’s complicated.\nWookieeCookie: We don’t endorse smurfing, but tackling it is a very difficult issue because of our player population size and the ease of account creation. We agree that smurfing can really ruin the game, such as when a smurf stomps lower-tier players. However; from past attempts we've learned that it's a real uphill battle to create powerful restrictions on alt-accounts without inadvertently affecting the majority of our players who don't smurf at all.\nInstead of cumbersome systems to blanket restrict smurfing we're looking for targeted answers that attack specific pain points. For example, if we find a player is using a smurf to actively hurt the game and other players we’ll take direct action on that account, and in some cases their main account as well.\nGhostcrawler: Sometimes players are smurfing because they are trying to accomplish something that League isn’t offering - in other words, the need is unmet. For example, playing with a friend with a different skill set is a noble pursuit that League doesn’t support very well. Other players might make a smurf account because they want a sense of rapid progression that they experienced when leveling from 1-30 or maybe even climbing through Bronze and Silver. \nSo we should be careful not to paint all smurfs with broad strokes and assume that they are trying to grief actual new players. They may have other intentions. That said, taken on the whole, I’m not a fan of smurfing and worry the potential harm to other players outweighs the benefits to those players with unmet needs.\nWookieeCookie: Agreed! That’s why we can’t endorse it. Instead of trying to restrict or prevent smurfs, various teams across Riot try to minimize issues caused by smurfing. For example, one of the teams that works on meta-game systems developed pretty good detection methods that quickly separate new players from experienced smurf accounts in the early levels. Within a few matches, smurf accounts only end up playing against other smurf accounts.","replies":[]}]}]}]}]},{"poster":"Abasin","date":"2018-01-29T14:07:04.065+0000","up_votes":7,"down_votes":3,"body":"Smurf = High ELO Spieler, der Anfängern/Low ELO Spielern systematisch den Spass verderben will? Ich frage mich, wann dieser Irrglaube endlich ausstirbt. {{sticker:zombie-brand-facepalm}}","replies":[]},{"poster":"Time2Whine","date":"2018-01-30T07:46:11.786+0000","up_votes":3,"down_votes":0,"body":"Stichsäge? Ich warte auf einen sinnvollen Beitrag deinerseits.","replies":[{"poster":"Qbert","date":"2018-01-30T10:24:06.452+0000","up_votes":3,"down_votes":0,"body":"komm schon ... tu uns das nicht an!","replies":[]},{"poster":"Abasin","date":"2018-01-30T09:00:26.636+0000","up_votes":2,"down_votes":0,"body":"Bitte keine schlafenden Hunde wecken.","replies":[]}]},{"poster":"need elo police","date":"2018-01-28T15:16:54.705+0000","up_votes":3,"down_votes":0,"body":"Man trifft immer mal auf Gegner die besser oder schlechter sind ... nicht jeder der ein starkes Spiel hat ist gleich ein Smurf. Und wenn du doch mal gegen einen spielen musst und dann klar verlierst ... nächstes Spiel kann es schon wieder ganz anders aussehen.\n\nAuch wenn du gegen bessere Spieler spielst, lerne daraus und versuche es im nächsten Spiel besser zu machen. Wichtig ist nicht gleich zu tilten, das steckt nur deine Mates an und dann wird es WIRKLICH keine gute Erfahrung.","replies":[]},{"poster":"9638156","date":"2018-01-28T15:48:11.737+0000","up_votes":1,"down_votes":0,"body":"Es ist aber so das man mehr lernt wenn man gegen höhere Spieler spielt. Weil ein 0 10 bedeutet ja nur das viele Fehler passiert sind oder du nicht richtig gehandelt hast. GL&HF\n{{sticker:katarina-love}}","replies":[{"poster":"SSI CptHaunted","date":"2018-01-29T12:18:56.465+0000","up_votes":1,"down_votes":0,"body":"Wobei das nur dann der Fall ist wenn man diese Fehler auch wirklich erkennt, schließlich erzählt der Smurf einem danach nicht was er alles ausnutzen konnte.\n\nAuch wird es deutlich mehr bringen z.B. als Bronze-Spieler gegen Silber/Gold zu spielen, als gegen Platin/Dia und sich langsam aber sicher zu steigern. So kann man erstmal die groben Fehler korrigieren und dann an die kleineren rangehen.\n\nIn Normals hab ich kein Problem mit Smurfs, im Ranked ist es halt...na ja. Denke niemand verliert gerne n Ranked gegen einen Smurf, genau wie vermutlich keiner in höherer Elo gerne verliert wenn er n geboosteten dabei hat. Mit nem Smurf zu spielen bringt einen vom Können her auch nicht wirklich weiter, da man selbst ja nicht carrien muss.","replies":[{"poster":"Mcnakstar","date":"2018-02-02T16:30:29.246+0000","up_votes":2,"down_votes":0,"body":"Danke erst mal für deine Antwort (euch allen). Im normal hast du recht: Voll egal! Aber das ist eben ein großes Problem im ranked. Ich hab viele einfache Spieler gesehen die in Bronze waren und Silber ebenso und die haben richtig dran glauben müssen. Mittlerweile hab ich meine Mains so drauf das sogar mir ein Smurf sogar nichts ausmacht. Doch ich pick nicht jede Runde meinem Main. Ich hab meine Fehler eingesehen und spiele deswegen nützlichere Champs. Aber genau da kommt ein Smurf, stompt mich, ich tilte und hab nie wieder Bock auf den Champ. Dann bin ich wieder auf null. Ich will damit sagen, dass ich wenigsten eine Chance haben will, um Methoden zu erlernen, verbessern und meistern will. Ich wär froh gegen Platin zu spielen, aber gegen Diamond? Nein! Und diese Leute die smurfen verschwenden dann auch noch ihre Zeit was mir dann ein noch schlechteres Bild von denen gibt. Ich finde die Leute sollten einfach damit aufhören. Es ist einfach nur nutzlos und frustrierend.","replies":[{"poster":"eingew","date":"2018-02-03T19:31:42.189+0000","up_votes":1,"down_votes":0,"body":"Im Ranked ist das Smurfproblem doch quasi nicht vorhanden.","replies":[]}]},{"poster":"eingew","date":"2018-01-30T07:36:28.584+0000","up_votes":1,"down_votes":0,"body":"Ich glaube es geht eher darum, dass der Smurf viel mehr *deiner* Fehler ausnutzt und dich dadurch dazu erzieht, diese zu vermeiden, was dir für die nächsten Spiele gegen schlechtere Gegner enorme Vorteile verschafft.\n\nVorausgesetzt du lernst aus deinen Toden ;P.","replies":[{"poster":"SSI CptHaunted","date":"2018-01-30T10:21:36.298+0000","up_votes":1,"down_votes":0,"body":"Eben und dabei kommt es auch darauf an ob man grobe Fehler macht oder eben kleinere die einem unerfahreneren Spieler eventuell erstmal gar nicht als solche auffallen.","replies":[{"poster":"eingew","date":"2018-01-31T07:06:12.850+0000","up_votes":1,"down_votes":0,"body":"Also wenn sie vom Gegner ausgenutzt werden ist es spätestens beim Replay recht klar, was man hätte anders machen müssen. Normalerweise fällt einem das aber doch schon während des Spiels auf.","replies":[{"poster":"SSI CptHaunted","date":"2018-02-03T19:01:30.463+0000","up_votes":1,"down_votes":0,"body":"Meistens ist das dann 1 Fehler + Snowball ohne Ende, von daher, so viel lernt man dadurch auch nicht. Vor Allem: Je größer der Unterschied umso weniger lernst du, denn kaum jemand, hat Bock drauf erst von nem Smurf chancenlos gestompt zu werden und sich dann noch das Replay anzuschauen.\n\nIn normalen Spielen mag man das meinetwegen noch tollerieren, aber im Ranked braucht man keine 2 Accounts und da sollte Riot n Riegel vorschieben.","replies":[{"poster":"eingew","date":"2018-02-03T19:30:12.904+0000","up_votes":1,"down_votes":0,"body":"Klar kann man in jeder Situation desselben Spiels neue Fehler finden. Nicht jeder Fehler der folgt ist auch ein Folgefehler.","replies":[]}]}]}]}]}]}]},{"poster":"Jastol","date":"2018-01-30T08:08:24.790+0000","up_votes":3,"down_votes":1,"body":"Eine Freundin von mir hat vor kurzem mit Lol angefangen. Anfangs haben wir so zusammen gespielt, aber leider recht schnell bemerkt, dass es keinen Sinn machte. Die Gegner die wir bekommen haben, haben Sie auf der Lane einfach nur gestompt und der Rest vom Team hat sie dann irgendwann geflamet. Beibringen konnte Ich Ihr dabei nichts und wenn Ichs versucht habe war es sogar noch schwerer, da Ich mich dann auf Sie und mich konzentrieren musste.\n\nDaher habe Ich einen Smurf  aufgemacht, den Ich eigentlich nur Nutze um mit Ihr Normals zu spielen. Sie hat in den Spielen ne Relativ gute Chance nicht gestompt zu werden und da mein Gegenüber in der Regel vom Farm oder sogar von den Kills hinten liegt kann ich mich darauf konzentrieren Ihr Tipps zu geben etc.","replies":[{"poster":"Shiggyvara","date":"2018-01-31T18:29:11.511+0000","up_votes":1,"down_votes":0,"body":"Also du weißt, dass du deinem Gegner überlegen bist und ihm dem Spielspaß verderben wirst aber für deine Freundin wär es spaßlos daher smurfst du...\nSeems legit","replies":[{"poster":"Jastol","date":"2018-02-02T08:05:58.866+0000","up_votes":2,"down_votes":0,"body":"Ich bin als Silber/Gold nicht so gut, dass Ich jeden Stompe und wie gesagt bin Ich dabei nicht am Tryharden. \n\nEs geht mir nicht darum, dass sie dabei mehr oder weniger Spaß hat (oder es ist zumindest nicht mein primäres Ziel), sondern dass Sie das Spiel lernt und Ich Ihr dabei helfen kann.","replies":[]}]}]},{"poster":"Shakês Beer","date":"2018-01-28T16:22:38.693+0000","up_votes":2,"down_votes":0,"body":"Smurf fair oder nicht? Ganz klare Antwort: Unfair\nFinde ich deshalb man sollte sie deaktivieren?: Nein! Du lernst nur von stärkeren! (Bzw. von denen besonders effektiv)","replies":[]},{"poster":"Snorlax irl Slav","date":"2018-01-30T19:55:30.266+0000","up_votes":3,"down_votes":1,"body":"Wo bleibt Stichsaege wenn man ihn mal braucht xD","replies":[]}]}