{"poster":"Pokedollar","date":"2016-01-11T20:41:19.537+0000","title":"Donner-Yasuo","subforum":"Skin- & Champion-Konzepte","up_votes":3,"down_votes":4,"body":"**Sehr geehrte Community,**\n\nich bin **Pokedollar** und ein gew&ouml;hnlicher League of Legends Spieler. Letztens, als ich mit meinen Freunden League of Legends spielte und einer meiner Kollegen Yasuo spielte, ist mir etwas aufgefallen und zwar, dass Yasuo sehr dem Anime Charakter &quot;Sasuke Uchiha&quot; aus &quot;Naruto&quot; &auml;hnelt. Ich meine, Yasuo hat ja auch ein Katana. Au&szlig;erdem kauft jeder Yasuo Spieler Statikks Stich wodurch man einen Blitz beschw&ouml;ren kann, was wiederum auch wieder extrem Yasuo &auml;hnelt. Meiner Meinung nach sollte es einen Donner-Yasuo geben der an den Anime &quot;Naruto&quot; angelegt ist. Es gibt ja auch &quot;Sternenw&auml;chterin-Lux&quot; der ja an den Anime &quot;Sailor Moon&quot; angelegt ist. Aber wie sollte er jetzt Aussehen?\n\n**Aussehen:**\nEr sollte &quot;Sasuke Uchiha&quot; sehr &auml;hnlich Aussehen. Am besten w&auml;re es auch noch wenn er die roten Sharingan Augen hat, jedoch m&uuml;ssen die nicht allzu ausgepr&auml;gt sein und sollten nur rote Augen sein. Man w&uuml;rde ja eigentlich nichts erkennen au&szlig;er kleine Pixel, wobei sich dann wahrscheinlich die meisten denken w&uuml;rden, dass es ein Pixelfehler sei. Er sollte ungef&auml;hr [so](http://vignette1.wikia.nocookie.net/fiction-wrestling-multiverse/images/2/25/Sasuke_Uchiha.png/revision/latest?cb=20140224202312) aussehen.\n\n**Ingame:**\nDie &quot;E&quot;-Attacke kann gleich bleiben. Bei der &quot;Q&quot;-Attacke sollten der Wind den man in eine verschiedene Richtungen schie&szlig;en kann aus Blitzen bestehen.\nAuch die &quot;W&quot;-Attacke sollte aus Blitzen bestehen. Bei der ultimativen Attacke w&uuml;rde ich Yasuo in einen &quot;Akatsuki Yasuo&quot; verwandeln, wenn der Gegner gerade geknockupped wird. Damit meine ich den [hier](http://images.saiyanisland.com/data/505/Sasuke_Akatsuki.jpg). Und wenn man die ultimative F&auml;higkeit benutzt k&ouml;nnte man das Ger&auml;usch einblenden, was man oft h&ouml;rt, wenn Sasuke sein &quot;Mangekyo Sharingan&quot; benutzt. Also dieser [Sound](https://www.youtube.com/watch?v=afCUet3GxBM). Man k&ouml;nnte den Sound auch einbisschen sch&ouml;ner Klingen lassen, aber es kommt drauf an, wie euch es gef&auml;llt. Als Recall-Animation w&uuml;rde ich es so machen, dass er sein Chidori aufl&auml;dt. So wie [hier](https://www.youtube.com/watch?v=AyQi0N3zuGU)..\n\n**Splashart:**\nEin ganz einfaches Bild, wo er sein \"Chidori\" auflädt.\n\n**Kosten:**\n750 RP - 975 RP\n\nIch hoffe euch gef&auml;llt meine Idee,\nmit freundlichen Gr&uuml;&szlig;en,\nPokedollar! :) {{champion:157}}","replies":[{"poster":"Samuraisub","date":"2016-04-02T11:32:12.058+0000","up_votes":1,"down_votes":1,"body":"Haha ^^ habe ich mir auch gedacht, aber das wäre ein bisschen weird. Könnte man höchsten als Custom Skin durch gehen lassen.","replies":[]}]}