{"poster":"Exit","date":"2015-05-22T03:23:14.958+0000","title":"Tribunal (NA)","subforum":"Charlas Generales","up_votes":9,"down_votes":2,"body":"EN NA YA SE ESTA IMPLEMENTANDO EL BAN INSTANTANEO.\nLa gente ha sido ya 14 d&iacute;as baneada en la primera ofensa. Registros automatizados del sistema de chat logs y recoge ciertas palabras, movimiento con el rat&oacute;n,KDA y dem&aacute;s. Momentos despu&eacute;s de que se reporta a alguien, que recibe el report tan pronto como se procesa. La imagen de abajo es de un jugador no m&aacute;s de 3-5 minutos despu&eacute;s de haber reportado a un player toxico del game anterior. gg boys \n\nAHORA LA PREGUNTA CUANDO VAN A PONER ESTO EN LAS?","replies":[{"poster":"spaceghost","date":"2015-05-22T15:05:05.751+0000","up_votes":4,"down_votes":0,"body":"Me parece excelente la mano dura en LAS ya que existe mucho libertinaje (?) en el server, pero asi como digo esto tambien me contradigo...\nPaseando por www.reddit.com/r/leagueoflegends con pochoclo en mano, veo algunos casos que me siento identificado y temo por mi humilde cuenta. \n\nNunca fui sancionado y hasta me dieron la caja misteriosa de premio (gracias Riot!), pero no por eso voy a ser hipocrita y decir que soy el hijo de Jebus. Pocas veces me sacan las ganas de jugar y tengo una actitud negativa pero es normal en mi frases como \"_Nos hicieron pij@_\", \"_Cag@mos fuego_\",  \"_Muteadito por pelotudit@_\", \"_Te la comiste toda eh!_\" o \"_¿No tenes huevos que tiras surrender?_\" por dar algunos ejemplos.\n\n¿Tengo que mejorar mi actitud y adaptarme al nuevo estandar de comportamiento o todavia vamos a tener la chance de \"_A veces tenemos malas partidas_\"? \n\nTengo la sensacion de que el sistema te castiga a la primera de cambio sin ver el historial de comportamiento, simplemente por tipear una \"palabra clave\" sin pensarlo... Bummmm ban por 14 dias. ","replies":[{"poster":"LaReinaPingüino","date":"2015-05-24T00:06:56.796+0000","up_votes":1,"down_votes":1,"body":"pppfff tu eres flamer también punto","replies":[]}]},{"poster":"ragunaover","date":"2015-05-22T20:53:25.539+0000","up_votes":2,"down_votes":0,"body":"Rip las si lo ponen","replies":[]},{"poster":"Milim","date":"2015-05-22T03:27:34.915+0000","up_votes":1,"down_votes":0,"body":"la verdad lo espero con ansias jugar ranked ya no lo disfrutas y con esto mucha gente troll va a pensarlo 2 veces antes de joder a su team","replies":[{"poster":"LucielX","date":"2015-05-22T03:33:21.476+0000","up_votes":1,"down_votes":0,"body":"De hecho todos estan consientes de que pueden ser baneados si trollean o insultan en una ranked, si eso no los hace pensar 2 veces, dudo que el tribunal lo haga. ¡Les da igual! Ellos van a otra cuenta y a tomar.. Ya sabes","replies":[{"poster":"ALEXKOND","date":"2015-05-22T03:58:49.291+0000","up_votes":2,"down_votes":0,"body":"De todas formas es una herramienta que va a ayudar bastante.\n\nSalvo que sea un troll con plata y compre cuentas, tiene que crearse una cuenta nueva.\nYa de por si, no puede jugar clasificatorias hasta llegar a nivel 30. Llegar a nivel 30 no es algo imposible, pero teniendo en cuenta que a partir de más o menos el nivel 10 es smurflandia, se complica un poco. Con suerte ragea en una de esas partidas y le bannean la otra cuenta.","replies":[]}]}]},{"poster":"Shappaw","date":"2015-05-22T09:23:49.991+0000","up_votes":2,"down_votes":3,"body":"No quiero contradecirte, pero... no será porque los reportes generados en NA son más honestos que los de LAS? Digo, porque acá la mayoría de los invocadores tienen entre 13 y 17 años, reportando sin parar pensando que siempre llevan la razón, acompañado con que al perder partidas siempre es culpa de los demás.\n\nEDIT: Posteaste buena info.","replies":[{"poster":"Exit","date":"2015-05-22T13:13:57.969+0000","up_votes":2,"down_votes":0,"body":"por eso lo que se fija en esto es tu kda tu build el chat y demás cualquiera no va a ser baneado xD","replies":[]},{"poster":"lronHide","date":"2015-05-23T00:38:40.457+0000","up_votes":1,"down_votes":0,"body":"Yo pienso lo mismo, tenemos el ejemplo de las restricciones de chat automäticas que \"eran revisados caso a caso\"... Esto en LAS será un desastre y casi que implementable...","replies":[]}]},{"poster":"Esti","date":"2015-05-23T22:57:13.613+0000","up_votes":1,"down_votes":0,"body":"implementan esto y se llenaran los foros con:\nRITO! Me banearon sin Razón!","replies":[]},{"poster":"José Larralde","date":"2015-05-22T17:26:27.843+0000","up_votes":1,"down_votes":0,"body":"http://www.levelup.com/noticias/320086/Riot-Games-reformara-a-los-jugadores-toxicos-de-League-of-Legends\n\n\"Riot Games informó que el sistema de reforma debutará primero en el servidor de Norteamérica y que el equipo de conducta revisará manualmente los primeros miles de reportes para asegurar el adecuado funcionamiento del sistema. Una vez que este periodo sea superado satisfactoriamente, la nueva característica será implementada en el resto de los servidores\".","replies":[{"poster":"Esti","date":"2015-05-23T22:56:25.970+0000","up_votes":1,"down_votes":0,"body":"Algo asi como paso con las maestrias de campeones en brasil?","replies":[]}]},{"poster":"RNGesus","date":"2015-05-23T22:03:00.549+0000","up_votes":1,"down_votes":0,"body":"Ahora cuiden lo que dicen por que hay gente que te reporta por que si xD , van a venir oleadas de gente baneada sin razon","replies":[]},{"poster":"UnGansoVenoso","date":"2015-05-22T23:07:52.146+0000","up_votes":1,"down_votes":0,"body":"si ponen eso en las quedan en bancarrota por falta de dinero facil xd","replies":[]},{"poster":"Runth","date":"2015-05-22T22:36:25.781+0000","up_votes":1,"down_votes":0,"body":"Si ponen ese nuevo tribunal, bye los 98% de jugadores que seran sancionados y las colas seran tan vacias como un mmorpg sin jugadores xd","replies":[]},{"poster":"Ch4puLin","date":"2015-05-22T11:35:26.621+0000","up_votes":1,"down_votes":0,"body":"Viendo las últimas experiencias de LAS, seguramente acá van a mostrar el cartelito, pero en realidad no van a banear a nadie.","replies":[]},{"poster":"MadnessX","date":"2015-05-22T04:53:10.056+0000","up_votes":1,"down_votes":0,"body":"hay pobre las, se quedara sin el 90% de sus jugadores por 14 dias RIP LAS","replies":[]}]}