{"poster":"4faith","date":"2020-01-23T00:37:24.061+0000","title":"Neue Champs","subforum":"Teamfight Tactics","up_votes":1,"down_votes":0,"body":"Hey Zusammen,\r\nich spiele jetzt seit einigen Wochen TFT und mir fällt auf,  und es stört mich auch ein wenig, dass immer die gleichen Combs  gespielt werden und da muss ich mich auch an der eigenen Nase fassen, da ich es auch tue. Was ich mich frage ist, ob neue Champs ins Spiel kommen, damit neue Combos gespielt werden können?","replies":[{"poster":"ITSHII","date":"2020-01-23T07:18:45.689+0000","up_votes":1,"down_votes":0,"body":"Riot hatte mal gesagt das sich die Meta immer zu nem bestimmten Zeitpunkt ändert. Das heißt es wird wieder ein neuen Championpool geben der nichts mit dem alten zu tun hat damit der Spielspaß erhalten bleibt. Aber wann und ob sie den Pool echt wieder ändern weiß ich leider nicht.","replies":[{"poster":"Bokeyeone","date":"2020-01-23T10:01:01.615+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ITSHII,realm=EUW,application-id=trYhv8pL,discussion-id=vRjcAqOe,comment-id=0001,timestamp=2020-01-23T07:18:45.689+0000)\n>\n> Das heißt es wird wieder ein neuen Championpool geben der nichts mit dem alten zu tun hat damit der Spielspaß erhalten bleibt.\n\nIch kenne Leute, denen es nicht gefällt, dass der Championpool sich oft ändert. \nWenn es zu viele große Änderungen in kurzen Zeiträumen stattfinden, ist es nicht gut, \nda man sich erst neu orientieren muss. So können Spieler ihren Spaß am Game verlieren. \nEs gibt natürlich auch die entgegengesetzte Meinung. Man kann es nicht allen recht machen. \nDennoch finde ich das so.","replies":[{"poster":"ITSHII","date":"2020-01-23T10:12:03.477+0000","up_votes":3,"down_votes":0,"body":"Ich persönlich finde das auch so aber TFT kann halt nach einer weile echt eintönig werden finde ich zumindest, ist ja alles eigene Ansichtssache. Naja man wird ja sehen ob sich der Pool echt wieder ändert. Ich glaube Riot hatte gesagt das der alle Halbe Jahr gewechselt wird. Ich persönlich würde aber sagen das es vielleicht am Anfang der Season angebrachter wäre als mitten drin. Aber ich hab eh nicht soviel Ahnung davon also sollte ich vielleicht meinem Mund besser halten.{{sticker:sg-miss-fortune}}","replies":[]}]}]},{"poster":"Saliera","date":"2020-01-23T01:50:44.625+0000","up_votes":3,"down_votes":0,"body":"leona und karma sind doch grad erst rein gekommen und haben mond mitgebracht.","replies":[]},{"poster":"Amycos Cyrus","date":"2020-01-23T09:58:06.201+0000","up_votes":1,"down_votes":0,"body":"Grundsätzlich gibt es in unregelmäßigen Abständen eine Grunderneuerung des gesamten CHampionpools, sodass wir uns aktuell in Set 2 befinden (Es wurde also schon einmal fast jeder Champion entfernt und neue released. Damit wurden auch grundsätzlich neue Mechaniken ins Spiel eingeführt und andere entfernt.\nZudem gibt es innerhalb eines Sets immer mal wieder kleinere Ergänzungen. Zum aktuellen Zeitpunkt gab es in dem momentanen Set 2 Ergänzungen:\n\n - Senna + Lucian (inkl. des Soulbound-Traits)\n - Amumu + Karma + Leona (inkl. des Lunar-Traits) \n\nWie auch bei LoL gibt es zudem einen einigermaßen regelmäßigen Patchzyklus, der die Meta ebenfalls beeinflusst.\n\n___\n\nDer nächste Wechsel des gesamten Sets findet im März diesen Jahres statt:\n\nhttps://www.youtube.com/watch?v=rrFfpFHsryw","replies":[]}]}