{"poster":"Bifrosth","date":"2017-11-07T17:54:03.300+0000","title":"Me dieron Permaban MIRA PORQUÉ","subforum":"Charlas Generales","up_votes":1,"down_votes":12,"body":"Asi es me dieron ban permanente en mi cuenta con mas de 1000 pesos Argentinos gastados solamente por un error de transici&oacute;n que cause quitandole a riot 14 pesos argentinos(para los que no entienden es muy poco el precio pero vale),sin ofender riot pero no es un poco exagerado? al menos me hubieran quitado el champ o las cosas que compre con ese rp,pero permaban ? ya esta trabajando el support de riot en intentar solucionar y nada gracias espero que se solucione no quiero perder esos casi 1300 pesos argentinos y todos mis champs","replies":[{"poster":"Hnk Kenshiro","date":"2017-11-07T17:55:15.221+0000","up_votes":8,"down_votes":0,"body":"No te dieron perma ban :p\n\nNo te dijeron que si pagabas esos 14 pesos te devolvían la cuenta?","replies":[]},{"poster":"LichaLopez9","date":"2017-11-07T18:00:28.247+0000","up_votes":6,"down_votes":0,"body":"Es un sistema automatico el que suspende tu cuenta temporalmente hasta que la deuda se cancele, seria lo mismo si debes $14, $1 o $150.000","replies":[]},{"poster":"Cuchufleitor","date":"2017-11-07T22:05:30.035+0000","up_votes":1,"down_votes":0,"body":"Pero como se equivocaron? no entiendo como pudo pasar, detalles? yo suelo gastar (llevo muuuuucho mas de 1300 pesos jaja) y me inquieta que me pudiera pasar algo asi)","replies":[{"poster":"Pollo al Ornno","date":"2017-11-07T22:09:37.696+0000","up_votes":2,"down_votes":0,"body":"tranquilo, no te va a pasar nada, menos si pagas en efectivo o tarjeta.\n\n\ny el men del post si, les choreo 14 pesos pero bueno, no quiere pagarlos para que le devuelvan la cuenta se ve","replies":[{"poster":"Bifrosth","date":"2017-11-07T23:06:16.571+0000","up_votes":1,"down_votes":0,"body":"Mañana me activan la cuenta xd","replies":[]}]}]},{"poster":"Runth","date":"2017-11-07T18:14:29.914+0000","up_votes":2,"down_votes":0,"body":"que metodo de pago has usado? soporte sobre estos casos, aca no solucionaras","replies":[]},{"poster":"Fransoi ","date":"2017-11-07T22:26:34.602+0000","up_votes":1,"down_votes":0,"body":"Yo no es por ver ga jajajaj pero mas te vale oagarlo ahora porque esta noche creo que termina la temporada asi que si estas baneado por pago no te dan las recompensas perdes todo lo que te dan marco icono etc por 14 pesos yo me mato jaja","replies":[{"poster":"Bifrosth","date":"2017-11-07T23:06:50.892+0000","up_votes":1,"down_votes":0,"body":"Nop juego hace 3 meses y soy plata 5 segun m edijiero que esta temporada no recibo nada a la 2018 si","replies":[]}]},{"poster":"Pollo al Ornno","date":"2017-11-07T22:10:04.903+0000","up_votes":1,"down_votes":0,"body":"Si gastaste mas de 1000 pesos, por que no podrias gastar 14 para que te den de nuevo tu cuenta?\n\n\nEs que yo no lo entiendo la verdad ¬¬","replies":[]},{"poster":"Sr Abadon","date":"2017-11-07T19:06:04.933+0000","up_votes":1,"down_votes":0,"body":"Querido diario....","replies":[]},{"poster":"Sergan","date":"2017-11-07T18:29:46.688+0000","up_votes":1,"down_votes":0,"body":"Si es ban por pago, si pagas lo adeudado te devuelven la cuenta.","replies":[]}]}