{"poster":"Jûles","date":"2017-04-29T14:29:27.867+0000","title":"Was tun gegen Q Trolle?","subforum":"Spielerverhalten & Moderation","up_votes":3,"down_votes":4,"body":"Hallo zusammen.\nIn letzter Zeit passiert es mir nicht immer, aber immer öfter, dass Leute die autofilled werden, streitsüchtig sind oder einfach trollfreudig in ein Match gehen, sich dazu entscheiden Champions auszuwählen, die..... nun sagen wir mal nicht wirklich in der zugehörigen Position aufgehen (aka trollpicks). Nun steht man da vor dem (gerade im ranked besonders besch....eidenen) Dilemma:\n Dodge ich die Q, verliere ein paar LP, muss 6 Minuten warten und ärgere mich darüber, dass der Troll unbestraft davon kommt.\n Oder starte ich das Spiel, dass mir mindestens 20 Minuten Pain und Frust bescherrt, mich noch viel mehr LP kostet, aber das mich wenigstens den Troll reporten lässt.\nRito, ähhh ich meine Riot würde mir wahrscheinlich folgendes raten. \"Starte das Spiel, gib dein Bestes und reporte den Troll am Ende.\"\nNaja, ich persönliche bevorzuge ja Variante 1 (vorrausgesetzt ich bin nicht gerade in meiner Promo). Die ist weniger frustige und meiner Meinung nach auch die schadenminimierenste.\nUnabhängig davon finde ich beide Möglichkeiten ziemlich suboptimal. Es muss doch eine Möglichkeit gebenm, den Troll wenigstens schon vor dem Match loszuwerden. Vielleicht ein Voting Verfahren, bei welchem man den Spieler kicken kann, oder eine Art und Weise wie man das Match remaken kann?\nIch würde mich auf Beiträge, Fragen und Anregungen von euch freuen!\nMfG, Jûles","replies":[{"poster":"Rahzar","date":"2017-05-03T19:49:23.661+0000","up_votes":2,"down_votes":0,"body":"Mein Rat: Starte das Spiel, gib dein Bestes und reporte den Troll am Ende.","replies":[{"poster":"Jûles","date":"2017-05-04T13:39:16.222+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Rahzar,realm=EUW,application-id=KYnfKGf0,discussion-id=nN99RURt,comment-id=0007,timestamp=2017-05-03T19:49:23.661+0000)\n>\n> Mein Rat: Starte das Spiel, gib dein Bestes und reporte den Troll am Ende.\n\nAber wird der troll überhaupt bestraft. So weit ich weiß greift das System doch gar nicht in der Champ selection, oder doch?","replies":[{"poster":"Eroticat Nimar","date":"2017-05-26T20:42:31.070+0000","up_votes":1,"down_votes":0,"body":"Wenn diese Person ingame trollt, wird man es reporten können","replies":[]}]}]},{"poster":"Stichsaege","date":"2017-04-29T19:10:45.064+0000","up_votes":2,"down_votes":8,"body":"Ich starte das Spiel weil ich selber der Troll Bin.\nSo lange bis ich in über 77000 Games keine Smurfs mehr gesehen habe.\n\nDer Riot alle Smurfs gebannt hat und ebenfalls alle Spieler höher als Platin gebannt sind. ( da ich denke jeder von den hat ein Smurf )\n6 Jahre bann für jeden Smurf den ein Platin+ Spieler hat.","replies":[{"poster":"Jûles","date":"2017-04-29T19:38:49.251+0000","up_votes":2,"down_votes":0,"body":"Also ich verstehe was du sagen willst. Ich finde Smurfs auch ziemlich unfair. Aber dann selbst zu trollen hilft doch auch nicht weiter, oder?","replies":[{"poster":"Stichsaege","date":"2017-04-29T19:50:00.339+0000","up_votes":3,"down_votes":7,"body":"Nö.\n\nIch kann nicht gegen Smurfs gewinnen, aber ich kann verhindern das die Smurfs in meine Team einfach gewinnen.\n\nSoll der Smurf sich doch anstrengen und für 2 Spielen.\nIch helfe lediglich meine Team nicht zu gewinnen, was nicht heißt das ich dafür sorge das der Gegner gewinnt.\nAlso feeden tu ich nicht.","replies":[{"poster":"Angel Ayume","date":"2017-04-30T12:14:07.773+0000","up_votes":2,"down_votes":0,"body":"Und woher weißt du, dass es nen Smurf ist? Weil er besser spielt als du? Weil er hart gefeedet ist? Weil er seinen Champ beherrscht? Oder gar, weil er es gesagt hat?","replies":[{"poster":"Stichsaege","date":"2017-04-30T22:14:15.182+0000","up_votes":2,"down_votes":4,"body":"Es ist einfach die ganze Art wie jemand sich beweget.\n\nz.B: Farm. Maxim hat mal so Leistungsystem gemacht. Glaube Farm/ min wo bei 10 = LCE ist.\n\n  Man sieht ob jemand nur Autoattacks macht und viel Farm nicht schafft zu Lasthiten oder ob er auch warte um\n den Lasthit zubekommen. Das ist Standard in der Low ELO. Aber wenn jemand wärmend des Autoattacks die Wave noch so manipuliert das er konstant Autoattacks kann und trotzdem alle Lasthits bekommt ist das weder Bronze noch Silber. Die guten Poken dich wärmend dessen noch auf 40% life, das ist dann auch nicht mehr Gold.\n\nDann noch wie er sich bewegt, Doggen und Co.\n\nIch meine nicht das Doggen Ansicht. Sondern das sich diese Spieler so positionieren das du sie erst gar nicht treffen kannst.\nAußer in den Moment in dem Sie es wollen das du Sie treffen kannst ( den Spell provozieren ) und ihn dann mit Leichtigkeit Doggen können und zum gegen schlag ausholen können. Weil Sie wärmend dessen dich auch aus deine Deckung gelockt haben, weil du ja endlich die Chance hattest Sie mal zu treffen.\n\nDu siehst doch auch im Spiel öfter Momente wo du die sagst : Go, Free kill.\nDes werden sich High Elo Spieler in der Low Elo sicher häufiger sagen und es Nutzen.\n\nIch kann das nicht wirklich erklären, geschweigenden die genaue Elo bestimmen ( Weil die ELO in Lol so durchwaschen ist ).\nAber ich denke den Unterschied zwischen Bronze und Platin sollte jeder nach ein Paar Spiel Minuten erkennen.\n\nSchau die mal an wie Faker Spielt , sich bewegt das wirst du auch sehen das es eine deutlichen Unterschied zu ein Dia Spieler gibt.\nFaker bricht seien Bewegungen sehr häufig mitten im laufen ab. Warte 0,1s und bewegt ich wieder 0,7s ( Zeiten geschätzt )\nSo ist erschwere zu berechnen und du weist nie wie lange er stehen bleit.\n\nNur eins kann ich die zu 100% sagen, was jemand sagt glaube ich tendenziell nicht, ich stelle erst mal alles in frage, so auch die ELo der Spieler. Ich bilde mir meine Eigen Meinung.","replies":[{"poster":"Angel Ayume","date":"2017-05-01T09:50:06.626+0000","up_votes":2,"down_votes":0,"body":"Mag sein, aber die Smurfs die in Low Elo sind sind sooooooooo gering, dass du extrem selten einen im Gegnerteam oder im eigenen Team hast. \nAlso ich zu meinem Teil hatte bisher in meinen fast 100 Ranked Games keinen einzigen Smurf. Demnach übertreibst du einfach völlig maßlos. Nur weil du eine **Vermutung** hast, dass dieser ein Smurf ist. Ich kann zB auch die Wave zu meinem Vorteil kontrollieren. Ich weiß, wann ich pushen sollte und ich weiß, wann ich am besten die Wave vor meinem Tower freezen sollte und dies dann auch mache. Ich poke den Gegner, wenn er für ein Minion geht und ich kann auch abschätzen, welches Minion er angreifen will. Ich poke, wenn der Gegner seine Spells genutzt hat um die Minion anzugreifen. Und ich bin fking Silber 5. Denkst du jetzt auch, dass ich nen Smurf bin nur weil ich mich so verhalte? \n\nManche sind auch einfach niedrig eingestuft worden obwohl sie eig. ne Elo höher spielen. Das bedeutet aber noch lange nicht, dass sie smurfen. \n\nUnd warum um Himmelswillen zerstörst du den Leuten dann das Game? Wenn dein Gegner ein Smurf ist und du dies erkennst okay. Aber du findest es scheiße wenn ein Smurf in deinem Team ist. Woher weißt du, dass er ein Smurf ist? Beobachtest du die ganze Zeit sein Laneverhalten? Beobachtest du die ganze Zeit die Leute, wenn sie 4:0 auf der Lane stehen und achtest du die ganze Zeit auf diesen Spieler in Teamfights damit zu beurteilen kannst ob es ein Smurf ist? Wenn das der Fall ist, dann ist das ziemlich dumm von dir. Du solltest dich auf deine eigene Lane konzentrieren und auf DEIN Play und nicht auf das von anderen. \nAber warum fängst du dann an zu trollen? Du gönnst dem Smurf den Sieg nicht, okay. Aber wieso gönnst du auch den anderen 3 Mitspielern den Sieg nicht obwohl sie keine Smurfs sind? Du bestrafst DICH und die anderen 3 Spieler. Das was du machst ist absolut nicht fair gegenüber deinen Mitspielern. Du zerstörst den Gegnern sogar das Spiel. Mag sein, dass sie wegen dir nen Freewin und Free LP bekommen aber die meisten wollen ein faires Spiel. Ich reporte Spieler aus meinem Gegnerteam wenn sie sich so verhalten. Ich freu mich zwar über die free LP aber ich finde es dennoch richtig scheiße von diesem Spieler wie er sich verhält. \n\nStell dir vor, jemand macht das in deinem Team, weil er irgendeinen bekloppten Grund hat, den du natürlich nicht weißt. Wie würdest du das finden, wenn du wegen einem Troll ein Game verlierst? Wenn du wegen so einem Troll dann das letzte Game in der Promo verlierst? Wenn du deswegen absteigst, weil da einer war, der getrollt hat? \nRICHTIG! Du findest es richtig scheiße und reportest diesen und hoffst, dass er gebannt wird. \nUnd du machst einfach nichts anderes. Du würdest also selber wollen, das dein Account gebannt wird. Ja Glückwunsch kann ich nur sagen. Dann kannst du direkt mit LoL aufhören. Schreib den Support an sie sollen deinen Account wegen Troll und int feeding bannen, weil nichts anderes willst du ja. -.-","replies":[{"poster":"Stichsaege","date":"2017-05-01T19:11:16.593+0000","up_votes":3,"down_votes":4,"body":"Erst mal Sorry\n\nAber du steckst mit diesen Eibert Rümmel unter einer Decke. was dich für mich schon mal\nunsympathisch macht. Nur meine Meinung , aber ich bleibe fair. und ignoriere das. \n\n> [{quoted}](name=Angel Ayume,realm=EUW,application-id=KYnfKGf0,discussion-id=nN99RURt,comment-id=000300000000000000000000,timestamp=2017-05-01T09:50:06.626+0000)\n>\n> Mag sein, aber die Smurfs die in Low Elo sind sind sooooooooo gering, dass du extrem selten einen im Gegnerteam oder im eigenen Team hast. \n> Also ich zu meinem Teil hatte bisher in meinen fast 100 Ranked Games keinen einzigen Smurf. Demnach übertreibst du einfach völlig maßlos. Nur weil du eine **Vermutung** hast, dass dieser ein Smurf ist. Ich kann zB auch die Wave zu meinem Vorteil kontrollieren. Ich weiß, wann ich pushen sollte und ich weiß, wann ich am besten die Wave vor meinem Tower freezen sollte und dies dann auch mache. Ich poke den Gegner, wenn er für ein Minion geht und ich kann auch abschätzen, welches Minion er angreifen will. Ich poke, wenn der Gegner seine Spells genutzt hat um die Minion anzugreifen. Und ich bin fking Silber 5. Denkst du jetzt auch, dass ich nen Smurf bin nur weil ich mich so verhalte? \n> \n> Manche sind auch einfach niedrig eingestuft worden obwohl sie eig. ne Elo höher spielen. Das bedeutet aber noch lange nicht, dass sie smurfen. \n> \n\nNaja, an Hand deiner Daten kann ich nicht sagen ob du ein Smurf bist. Bist aber sicher besser als der durchschnittliche\nSilber Spieler. In Silber 5 gehörst du definitiv nicht und wirst in jeden fall aufsteigen, wenn du mal ein paar Solo Rank Games machst. Bist mit sicher zu niedrig eingestuft.\nUm es sicher zusagen müsste ich sehen wie du 15 min spielst.\n\n> Und warum um Himmelswillen zerstörst du den Leuten dann das Game? Wenn dein Gegner ein Smurf ist und du dies erkennst okay. Aber du findest es scheiße wenn ein Smurf in deinem Team ist.\n\n **JA**\n\n> Woher weißt du, dass er ein Smurf ist? Beobachtest du die ganze Zeit sein Laneverhalten? Beobachtest du die ganze Zeit die Leute, wenn sie 4:0 auf der Lane stehen und achtest du die ganze Zeit auf diesen Spieler in Teamfights damit zu beurteilen kannst ob es ein Smurf ist? Wenn das der Fall ist, dann ist das ziemlich dumm von dir. Du solltest dich auf deine eigene Lane konzentrieren und auf DEIN Play und nicht auf das von anderen. \n\nWenn ich Tod bin kann, habe ich die Zeit meine Vermutungen zu überprüfen. \n\n> Aber warum fängst du dann an zu trollen? Du gönnst dem Smurf den Sieg nicht, okay. Aber wieso gönnst du auch den anderen 3 Mitspielern den Sieg nicht obwohl sie keine Smurfs sind? Du bestrafst DICH und die anderen 3 Spieler. Das was du machst ist absolut nicht fair gegenüber deinen Mitspielern. Du zerstörst den Gegnern sogar das Spiel. Mag sein, dass sie wegen dir nen Freewin und Free LP bekommen aber die meisten wollen ein faires Spiel. Ich reporte Spieler aus meinem Gegnerteam wenn sie sich so verhalten. Ich freu mich zwar über die free LP aber ich finde es dennoch richtig scheiße von diesem Spieler wie er sich verhält. \n> \n> Stell dir vor, jemand macht das in deinem Team, weil er irgendeinen bekloppten Grund hat, den du natürlich nicht weißt. Wie würdest du das finden, wenn du wegen einem Troll ein Game verlierst? Wenn du wegen so einem Troll dann das letzte Game in der Promo verlierst? Wenn du deswegen absteigst, weil da einer war, der getrollt hat? \n> RICHTIG! Du findest es richtig scheiße und reportest diesen und hoffst, dass er gebannt wird. \n> Und du machst einfach nichts anderes. Du würdest also selber wollen, das dein Account gebannt wird. Ja Glückwunsch kann ich nur sagen. Dann kannst du direkt mit LoL aufhören. Schreib den Support an sie sollen deinen Account wegen Troll und int feeding bannen, weil nichts anderes willst du ja. -.-\n\nGenau das was du was du bestreibst  will ich erreichen. mir sind meine 0 Punkte in Bronze 5 so was von egal. Ich war auch schon bei 90 Punkten, die aber nach 5 Games wieder bei 0 waren. Mein Ziel ist es doch , dass niemand Spaß an Lol hat.\nSmurfs zerstören mein Game, dann habe ich das Gleiche Recht und darf jeden andern der 9 Spieler das Spiel versauen.\nIch feede nicht. Mein Team spielt lediglich 4 vs 5, wenn in mein Team ein Smurf ist kann er für 2 Spielen. Wenn im Gegener Team auch ein Smurf is hat er Pech gehabt.\n\nSmurfs erhöhen die Siegchance Ihres Team's, ich gleiche das lediglich aus.","replies":[{"poster":"Angel Ayume","date":"2017-05-01T22:15:37.494+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Stichsaege,realm=EUW,application-id=KYnfKGf0,discussion-id=nN99RURt,comment-id=0003000000000000000000000000,timestamp=2017-05-01T19:11:16.593+0000)\n>\n> Erst mal Sorry\n> \n> Aber du steckst mit diesen Eibert Rümmel unter einer Decke. was dich für mich schon mal\n> unsympathisch macht. Nur meine Meinung , aber ich bleibe fair. und ignoriere das. \n \nUnter einer Decke stecken. Dies klingt aber mal wirklich fies und gemein. Wir sind doch keine Bösewichte. \nVergiss nicht, dass du hier über unseren König sprichst! Und ich bin der Schutzengel des Königreichs und persönliche Beraterin des Königs. Also ein bisschen mehr Respekt mein Herr!\n\n\n> Wenn ich Tod bin kann, habe ich die Zeit meine Vermutungen zu überprüfen. \n \nDann bist du offenbar sehr häufig tot um deine Vermutungen zu überprüfen. Du solltest vllt mal über dein Spielstil nachdenken. Der scheint mir nicht besonders gut zu sein. \n\n> Genau das was du was du bestreibst  will ich erreichen. mir sind meine 0 Punkte in Bronze 5 so was von egal. Ich war auch schon bei 90 Punkten, die aber nach 5 Games wieder bei 0 waren. Mein Ziel ist es doch , dass niemand Spaß an Lol hat.\n> Smurfs zerstören mein Game, dann habe ich das Gleiche Recht und darf jeden andern der 9 Spieler das Spiel versauen.\n> Ich feede nicht. Mein Team spielt lediglich 4 vs 5, wenn in mein Team ein Smurf ist kann er für 2 Spielen. Wenn im Gegener Team auch ein Smurf is hat er Pech gehabt.\n> \n> Smurfs erhöhen die Siegchance Ihres Team&#x27;s, ich gleiche das lediglich aus.\n\nSo wie du sprichst scheinst du ja in jedem Game einen Smurf zu haben. Meinst du nicht, dass du ein klein wenig, nein sagen wir, extrem **stark** übertreibst? \nWie gesagt hatte ich in meinen fast 100 Games keinen Smurf. Das wird bei dir nicht anders sein. Demnach zerstörst du scheinbar 4 Teammitgliedern das Game die ehrlich sind und sich aus ihrer Elo hocharbeiten. Nur wegen eines bescheuerten unhaltbaren Vermutung. Du bist Bronze 5 und sicher nicht gut in diesem Game. Somit können wir sagen, dass du einen Smurf nicht von einen guten Spieler der einfach ein paar Divisionen höher spielt unterscheiden kannst. Alles was weit besser ist als du und wenns nur ein Silberspieler ist, ist in deinen Augen ein Smurf NUR weil er weitaus besser spielt als du und dein Team. \nFang an an dir zu arbeiten und dich zu verbessern. Dann klappt es auch mit der Elo. \nNebenbei bemerkt gehe ich nicht davon aus, dass dir deine Elo egal ist, sonst würdest du dich ja nicht so über Smurfs aufregen. Dann würdest du einfach spielen und Spaß haben. Und wenn ihr mal gewinnt weil da einer bei ist der besser spielt und deswegen gewonnen wird sollte es dir ja auch egal sein. \nDas Argument \"ich trolle und verliere absichtlich Spiele, da kannich nicht aufsteigen, da ich ja absichtlich verlieren WILL\" zieht übrigens nicht. Flamer sind sich zB auch durchaus bewusst darüber, dass ihr Verhalten dazu führt dass das Game verloren wird, eigentlich wollen sie aber gewinnen können aber dennoch nicht aufhören obwohl sie ganz genau wissen, dass durch ihr Verhalten alles nur noch schlimmer wird und sie deswegen verlieren. \n\nIn dem Sinne\nHör auf mit LoL.","replies":[{"poster":"Stichsaege","date":"2017-05-02T18:59:42.522+0000","up_votes":2,"down_votes":3,"body":"> [{quoted}](name=Angel Ayume,realm=EUW,application-id=KYnfKGf0,discussion-id=nN99RURt,comment-id=00030000000000000000000000000000,timestamp=2017-05-01T22:15:37.494+0000)\n>\n> Unter einer Decke stecken. Dies klingt aber mal wirklich fies und gemein. Wir sind doch keine Bösewichte. \n> Vergiss nicht, dass du hier über unseren König sprichst! Und ich bin der Schutzengel des Königreichs und persönliche Beraterin des Königs. Also ein bisschen mehr Respekt mein Herr!\n>  \n\nIch kann den Adel, Leute die sich für was bessere halten halt nicht ausstehen. Leute die mein die Regel nach Ihren belieben und Vorteil zu erschaffen. Bein halt ein Revolutionär, jemand der anders Denkt. Revolution/ Wandel / Erneuerung.\n\n\n\n> Dann bist du offenbar sehr häufig tot um deine Vermutungen zu überprüfen. Du solltest vllt mal über dein Spielstil nachdenken. Der scheint mir nicht besonders gut zu sein. \n> \n\nDa ich AFK Jungle gehe habe ich genügend Zeit.\n\n\n> So wie du sprichst scheinst du ja in jedem Game einen Smurf zu haben. Meinst du nicht, dass du ein klein wenig, nein sagen wir, extrem **stark** übertreibst? \n\n?? Mmm,  Ansichtssache. 1 Smurfs in 300 Games ist meine Schmerzgrenze, sonst dauer Tilt.\nUnd 0,037% sind Smurfs.\n\n> Wie gesagt hatte ich in meinen fast 100 Games keinen Smurf. Das wird bei dir nicht anders sein.\nSo ich nenne dir jetzt eine Name ein High Elo Smurfs, das ist keine Beleidigung ehr das Gegenteil.\n\nMsGrandmother , Im Profil Level 30  70 Sieger. \nRiven 16/4/4  182Cs in 24 min davon war er sicher 3 min afk ( min 4 - 7). Low life win 1 vs 2.Solo carry.\n\nSolche Spieler habe ich mindesten alle 15 Games.\nPS er war in mein Team.\n\n> Demnach zerstörst du scheinbar 4 Teammitgliedern das Game die ehrlich sind und sich aus ihrer Elo hocharbeiten. Nur wegen eines bescheuerten unhaltbaren Vermutung. Du bist Bronze 5 und sicher nicht gut in \ndiesem Game.\n\nNur weil ich verliere heißt das noch lange nicht das ich schlecht bin.\nund zum nächsten ich war Silber, hatte aber keine Lust zu versuchen aufzusteigen, zu viel Müll in der Elo ( Smurfs, Trolle, Premads ( no SoloQ ))\n\n> Somit können wir sagen, dass du einen Smurf nicht von einen guten Spieler der einfach ein paar Divisionen höher spielt unterscheiden kannst. Alles was weit besser ist als du und wenns nur ein Silberspieler ist, ist in deinen Augen ein Smurf NUR weil er weitaus besser spielt als du und dein Team. \n> Fang an an dir zu arbeiten und dich zu verbessern. Dann klappt es auch mit der Elo. \n> Nebenbei bemerkt gehe ich nicht davon aus, dass dir deine Elo egal ist, sonst würdest du dich ja nicht so über Smurfs aufregen. Dann würdest du einfach spielen und Spaß haben. Und wenn ihr mal gewinnt weil da einer bei ist der besser spielt und deswegen gewonnen wird sollte es dir ja auch egal sein. \n> Das Argument &quot;ich trolle und verliere absichtlich Spiele, da kannich nicht aufsteigen, da ich ja absichtlich verlieren WILL&quot; zieht übrigens nicht. Flamer sind sich zB auch durchaus bewusst darüber, dass ihr Verhalten dazu führt dass das Game verloren wird, eigentlich wollen sie aber gewinnen können aber dennoch nicht aufhören obwohl sie ganz genau wissen, dass durch ihr Verhalten alles nur noch schlimmer wird und sie deswegen verlieren. \n> \n> In dem Sinne\n> Hör auf mit LoL.\n\nKönnen ja mal zusammen spielen, anders kann ich die wohl nicht beweisen das ich besser als Bronze bin.\nSicher kein Platin oder high Gold aber sicher oberes Silber.\nJa. Elo ist mir wichtig, wenn Sie den eine reale Berteilung wäre. Das ist Sie aber in Lol nicht durch die Smurf.\nDas ist es was ich erreichen will. Ein Elo die mal auch als echt bezeichnen kann, dann hat Sie für mich auch ein Wert.","replies":[{"poster":"Angel Ayume","date":"2017-05-02T19:39:32.490+0000","up_votes":1,"down_votes":0,"body":"Ich gebs auf. Hopfen und Malz verloren wie man so schön sagt. \nLeb weiter in deiner bescheuerten Welt und werde dort glücklich oder halt nicht.","replies":[]}]},{"poster":"Waldschrat86","date":"2017-05-02T14:59:43.495+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Angel Ayume,realm=EUW,application-id=KYnfKGf0,discussion-id=nN99RURt,comment-id=00030000000000000000000000000000,timestamp=2017-05-01T22:15:37.494+0000)\n>\n> Unter einer Decke stecken. Dies klingt aber mal wirklich fies und gemein. Wir sind doch keine Bösewichte. \n> Vergiss nicht, dass du hier über unseren König sprichst! Und ich bin der Schutzengel des Königreichs und persönliche Beraterin des Königs. Also ein bisschen mehr Respekt mein Herr!\n>  \n> Dann bist du offenbar sehr häufig tot um deine Vermutungen zu überprüfen. Du solltest vllt mal über dein Spielstil nachdenken. Der scheint mir nicht besonders gut zu sein. \n> \n> So wie du sprichst scheinst du ja in jedem Game einen Smurf zu haben. Meinst du nicht, dass du ein klein wenig, nein sagen wir, extrem **stark** übertreibst? \n> Wie gesagt hatte ich in meinen fast 100 Games keinen Smurf. Das wird bei dir nicht anders sein. Demnach zerstörst du scheinbar 4 Teammitgliedern das Game die ehrlich sind und sich aus ihrer Elo hocharbeiten. Nur wegen eines bescheuerten unhaltbaren Vermutung. Du bist Bronze 5 und sicher nicht gut in diesem Game. Somit können wir sagen, dass du einen Smurf nicht von einen guten Spieler der einfach ein paar Divisionen höher spielt unterscheiden kannst. Alles was weit besser ist als du und wenns nur ein Silberspieler ist, ist in deinen Augen ein Smurf NUR weil er weitaus besser spielt als du und dein Team. \n> Fang an an dir zu arbeiten und dich zu verbessern. Dann klappt es auch mit der Elo. \n> Nebenbei bemerkt gehe ich nicht davon aus, dass dir deine Elo egal ist, sonst würdest du dich ja nicht so über Smurfs aufregen. Dann würdest du einfach spielen und Spaß haben. Und wenn ihr mal gewinnt weil da einer bei ist der besser spielt und deswegen gewonnen wird sollte es dir ja auch egal sein. \n> Das Argument &quot;ich trolle und verliere absichtlich Spiele, da kannich nicht aufsteigen, da ich ja absichtlich verlieren WILL&quot; zieht übrigens nicht. Flamer sind sich zB auch durchaus bewusst darüber, dass ihr Verhalten dazu führt dass das Game verloren wird, eigentlich wollen sie aber gewinnen können aber dennoch nicht aufhören obwohl sie ganz genau wissen, dass durch ihr Verhalten alles nur noch schlimmer wird und sie deswegen verlieren. \n> \n> In dem Sinne\n> Hör auf mit LoL.\n\nDer spielt in Bronze 5 und meint er hätte jedes Game nen Platinsmurf, denkt trotz seiner Platzierung er könne das erkennen, immerhin hätte ja jeder Platinspieler sowieso mindestens 1 Smurf, dass die dann ganz sicher nicht da spielen, wo er rumgurkt, interessiert ihn auch nicht.\n\nIm Endeffekt ist es ein krass guter Troll oder jemand mit Hirnschaden. Auch egal, gäbe es unter B5 noch weitere Ligen, wär er durch seine Taktik wahrscheinlich schon dort, seine Reports bewirken sowieso nichts, falls sich echt mal ein Smurf dahin verirren sollte, kann der sicher gut mit dem einen Trollgame leben und den echten B5ern wird sein Feldzug gar nicht auffallen. Ignorier ihn einfach, für den Typen ist ja sogar normales Duo(ohne Smurfs) eine Form von cheating. Da ist Hopfen und Malz verloren, wenn du das alles einem Stein erklären würdest, hättest du damit wohl mehr erreicht als bei dem Vogel.","replies":[{"poster":"Angel Ayume","date":"2017-05-02T17:10:01.642+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Waldschrat86,realm=EUW,application-id=KYnfKGf0,discussion-id=nN99RURt,comment-id=000300000000000000000000000000000000,timestamp=2017-05-02T14:59:43.495+0000)\n>\n Da ist Hopfen und Malz verloren, wenn du das alles einem Stein erklären würdest, hättest du damit wohl mehr erreicht als bei dem Vogel.\n\nTrue! Ich habe das grade alles einem Stein erklärt. Er hat sich entschuldigt und trollt jetzt nicht mehr in Games wo er denkt er hätte einen Smurf. \nEin echt guter Stein.","replies":[]}]},{"poster":"Jûles","date":"2017-05-02T16:15:32.445+0000","up_votes":1,"down_votes":0,"body":"Ich hätte noch eine Idee wie er darauf kommt, dass viele Smurfs in seinem Spiel sind. Bei mir ist es oft auch so, dass ich in Normal Games mit Platin Beschwörern spielen muss (wenn man LoL Sumo u.ä. glauben kann), obwohl ich nur Bronze 3/4 bin. Und auch in Rankeds begegne ich manchmal Gold spielern.","replies":[{"poster":"Waldschrat86","date":"2017-05-02T17:02:33.325+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Jûles,realm=EUW,application-id=KYnfKGf0,discussion-id=nN99RURt,comment-id=000300000000000000000000000000000001,timestamp=2017-05-02T16:15:32.445+0000)\n>\n> Ich hätte noch eine Idee wie er darauf kommt, dass viele Smurfs in seinem Spiel sind. Bei mir ist es oft auch so, dass ich in Normal Games mit Platin Beschwörern spielen muss (wenn man LoL Sumo u.ä. glauben kann), obwohl ich nur Bronze 3/4 bin. Und auch in Rankeds begegne ich manchmal Gold spielern.\n\nDie Sache bei ihm ist halt, dass er das schon seit Jahren glaubt und ihm auch schon alles zig mal erklärt wurde,er glaubt es halt nicht, lebt weiter in seinem Wahn und führt seinen sinnbefreiten Kampf gegen Windmühlen.\n\nDas mit den Platins in Normals, ist z.B. ganz einfach zu erklären: Es wird nach MMR und nicht Ligen gematched, MMR in Normals ist gänzlich losgelöst vom MMR in Rankeds. Dazu kommt, dass in Normals die Ligenbeschränkung nicht existiert, sprich im Extremfall da auch ein Challenger mit seinem B5-Kumpel die Matchsuche starten kann, wobei der Ranked-Challenger halt eben auch ne z.B. Silberentsprechende MMR im Normal haben kann, weil er es einfach kaum spielt, genauso wie der B5 im normal eben auch. Aber das heißt halt auch, dass sie trotzdem wie im Ranked auch im Normal Welten auseinanderliegen, das System dann ja aber trotzdem ein Spiel finden muss, dann ist klar, dass so komische Konstellationen zustande kommen können.\nBei den Goldspielern in Rankeds als Bronze muss man erstmal schauen, waren die letzte Saeson Gold oder sind sie es momentan noch. Aber auch hier geht es nach MMR und nicht Platzierung. Durch den Abstiegsschutz in den 5er-Divisionen kommt es dann gerne mal zu solchen Konstellationen, auch gerade nach Saesonbeginn, wenn so gut wie alles über Bronze 1 Liga tiefer startet.\nEs gibt hier auch den angepinnten Infothread über Ligen, MMR usw. da steht eigentlich alles detailiert und gut erklärt drin","replies":[]}]}]},{"poster":"Eibert Rümmel","date":"2017-05-27T21:41:20.465+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Stichsaege,realm=EUW,application-id=KYnfKGf0,discussion-id=nN99RURt,comment-id=0003000000000000000000000000,timestamp=2017-05-01T19:11:16.593+0000)\n>\n> Erst mal Sorry\n> \n> Aber du steckst mit diesen Eibert Rümmel unter einer Decke. was dich für mich schon mal\n> unsympathisch macht. Nur meine Meinung , aber ich bleibe fair. und ignoriere das. \n> \n\nUnter meine Decke kommt nur Superkahlan. Auch wenn ich meinen Engel liebe. Treue ist wichtig!","replies":[]}]}]}]}]}]}]},{"poster":"Alânte","date":"2017-04-30T01:11:50.209+0000","up_votes":2,"down_votes":0,"body":"Smurfe gerne in deiner Elo, weil ich haben möchte dass Leute wie du für immer in Bronze bleiben :). Das gibt mir einen Kick, ich fühle mich direkt besser :)\n\nLG ein böser Smurf, der dich vorm Climben bewahrt","replies":[{"poster":"Jûles","date":"2017-04-30T08:33:34.534+0000","up_votes":2,"down_votes":0,"body":"Höre ich da etwa die kleinste Priese Sarkasmus raus? :O","replies":[]},{"poster":"Stichsaege","date":"2017-04-30T11:58:45.910+0000","up_votes":1,"down_votes":3,"body":"Sorry, aber ich muss dich enttäuschen, da ich nicht climben will.\n\nMir ist die Elo voll kommen egal, weil die ELO in LOL ( vor allen die Low ELo ) in Lol keine Bedeutung hat.\nHalt wegen den Smurfs, da diese den Skill der Elo verfälschen.\n\nIch erkenne an Hand des Bewegungsverhalten ob jemand deutlich besser ist als der Rest,\n\nManchmal kommen hier im Forum Kommentare \" so dumm kann doch keine sein \". Aber auch diese Spiueler sind in die Elo gekommen und zeigen lediglich das reale Minimum an skill. Das durch die Smurfs die Skill spanne von Bronze bis Dia reicht entsthet der eindruck das dises Spieler sehr schlecht sind.\n\nSpielen z.B: 5 Dia Smurfs gegen 5 Dia Smurfs in der Bronze Elo, ist der Skill dann Bronze oder Dia ?","replies":[{"poster":"clair de lune289","date":"2017-05-02T17:28:25.019+0000","up_votes":1,"down_votes":0,"body":"dir ist aber bewusst das es wesentlich mehr Bronze Spieler gibt als Smurfs? selbst wenn jeder Gold+ Spieler einen Smurf hätte gäb es mehr Bronze Spieler als Smurfs.\nDazu kommt dann noch die Tatsache das alle Smurfs die **~~NICHT~~** absichtlich verlieren nie nach Bronze kommen werde da ein neuer Acc bei Mitte Silber anfängt.\n**Absichtlich** verlierende Smurffs sollte ja egal sein da sie eben ab sichtlich verlieren und somit den angeblich verdienten Aufstieg nicht behindern.","replies":[{"poster":"Jûles","date":"2017-05-02T18:18:07.865+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=clair de lune289,realm=EUW,application-id=KYnfKGf0,discussion-id=nN99RURt,comment-id=0003000100010001,timestamp=2017-05-02T17:28:25.019+0000)\n>\n> dir ist aber bewusst das es wesentlich mehr Bronze Spieler gibt als Smurfs? selbst wenn jeder Gold+ Spieler einen Smurf hätte gäb es mehr Bronze Spieler als Smurfs.\n> Dazu kommt dann noch die Tatsache das alle Smurfs die **~~NICHT~~** absichtlich verlieren nie nach Bronze kommen werde da ein neuer Acc bei Mitte Silber anfängt.\n> **Absichtlich** verlierende Smurffs sollte ja egal sein da sie eben ab sichtlich verlieren und somit den angeblich verdienten Aufstieg nicht behindern.\n> [{quoted}](name=Waldschrat86,realm=EUW,application-id=KYnfKGf0,discussion-id=nN99RURt,comment-id=0003000000000000000000000000000000010000,timestamp=2017-05-02T17:02:33.325+0000)\n>\n\n> Bei den Goldspielern in Rankeds als Bronze muss man erstmal schauen, waren die letzte Saeson Gold oder sind sie es momentan noch. Aber auch hier geht es nach MMR und nicht Platzierung. Durch den Abstiegsschutz in den 5er-Divisionen kommt es dann gerne mal zu solchen Konstellationen, auch gerade nach Saesonbeginn, wenn so gut wie alles über Bronze 1 Liga tiefer startet.\n> Es gibt hier auch den angepinnten Infothread über Ligen, MMR usw. da steht eigentlich alles detailiert und gut erklärt drin\n\nIch will ih nicht verteidigen, aber es kann elo technisch schon swin, dass er gegen solche Leute spielt","replies":[{"poster":"Waldschrat86","date":"2017-05-02T20:37:36.045+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Jûles,realm=EUW,application-id=KYnfKGf0,discussion-id=nN99RURt,comment-id=00030001000100010000,timestamp=2017-05-02T18:18:07.865+0000)\n>\n> Ich will ih nicht verteidigen, aber es kann elo technisch schon swin, dass er gegen solche Leute spielt\n\nEr gibt doch hier sogar zu, dass er sich künstlich in B5 hält, was wiederum solche Leute in seinen Matches erklärt, da das Ligensystem nur eine Maske ist und das MM eben nach MMR geht, aber das hat eben auch absolut nichts mit Smurfs zu tun, um die es ihm ja geht.\nFängt doch schon damit an, dass er meint jeder Platin hätte nen Smurf, was definitiv nicht stimmt, aber selbst wenn, schau dir doch mal an wieviele Spieler Bronze hat und wieviele Platin+,das kommt selbst dann hinten und vorne nicht hin, mal ganz davon ab, dass die  um nicht abgestuft zu werden ihre Mains bespielen müssen, wenn sie das tun können sie schonmal gar nicht zeitgleich ihre Smurfs bedienen.\nIch bin grad mal solides Gold und kann dir sagen, wenn du das noch nichtmal so hohe Spielniveau erreicht hast, ist es schon eine große Kunst nochmal irgendwann im MMR-Bereich Bronze zu spielen, da braucht es schon extreme Pechsträhnen oder aktives Trollen für.\nNeue Accounts beginnen etwa im mittleren Silber, hab die Season selber Silber 5 gestartet, klar hab ich da dominiert, weil ich eben mittlerweile solides Gold bin und jetzt auch wieder G5, hab ich deshalb gesmurfed? Wenn ich jetzt versuchen würde Platin zu kommen und das schaffe, hab ich nach ihm ja auch direkt nen Smurf im tiefem Bronze oder wo auch immer seine MMR steht, einfach so, weil hey nach ihm ist das ab Platin ja so...\n\nEr schreibt \"0,037% sind Smurfs\", mal ganz davon ab, dass seine Zahlen darauf beruhen, was er persönlich meint als Smurf erkannt zu haben, dazu kommt dann noch, dass eben ein Großteil der Platin-Smurfs gar nicht in dem Bereich spielt, weil sie eben viel besser sind. \nWie gesagt das Spielchen treibt er schon seit Jahren und es waren hier auch schon genug, die es ihm anhand der offiziellen Zahlen vorgerechnet und für jeden nachvollziehbar erklärt haben. Stimmt dann aber nicht oder du kommst auf seine persönliche Ignoreliste, weil du ein ignoranter Fanboy bist lol. Ich bin auch kein Fan von Smurfing, aber das, was der Typ verbreitet und sich selbst zurecht gezimmert hat, ist einfach nur Irrsinn hoch 10.","replies":[{"poster":"Jûles","date":"2017-05-03T15:52:04.906+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Waldschrat86,realm=EUW,application-id=KYnfKGf0,discussion-id=nN99RURt,comment-id=000300010001000100000000,timestamp=2017-05-02T20:37:36.045+0000)\n>\n> Er gibt doch hier sogar zu, dass er sich künstlich in B5 hält, was wiederum solche Leute in seinen Matches erklärt, da das Ligensystem nur eine Maske ist und das MM eben nach MMR geht, aber das hat eben auch absolut nichts mit Smurfs zu tun, um die es ihm ja geht.\n> Fängt doch schon damit an, dass er meint jeder Platin hätte nen Smurf, was definitiv nicht stimmt, aber selbst wenn, schau dir doch mal an wieviele Spieler Bronze hat und wieviele Platin+,das kommt selbst dann hinten und vorne nicht hin, mal ganz davon ab, dass die  um nicht abgestuft zu werden ihre Mains bespielen müssen, wenn sie das tun können sie schonmal gar nicht zeitgleich ihre Smurfs bedienen.\n> Ich bin grad mal solides Gold und kann dir sagen, wenn du das noch nichtmal so hohe Spielniveau erreicht hast, ists e schon eine große Kunst nochmal irgendwann im MMR-Bereich Bronze zu spielen, da braucht es schon extreme Pechsträhnen oder aktives Trollen für.\n> Neue Accounts beginnen etwa im mittleren Silber, hab die Season selber Silber 5 gestartet, klar hab ich da dominiert, weil ich eben mittlerweile solides Gold bin und jetzt auch wieder G5, hab ich deshalb gesmurfed? Wenn ich jetzt versuchen würde Platin zu kommen und das schaffe, hab ich nach ihm ja auch direkt nen Smurf im tiefem Bronze oder wo auch immer seine MMR steht, einfach so, weil hey nach ihm ist das ab Platin ja so...\n> \n> Er schreibt &quot;0,037% sind Smurfs&quot;, mal ganz davon ab, dass seine Zahlen darauf beruhen, was er persönlich meint als Smurf erkannt zu haben, dazu kommt dann noch, dass eben ein Großteil der Platin-Smurfs gar nicht in dem Bereich spielt, weil sie eben viel besser sind. \n> Wie gesagt das Spielchen treibt er schon seit Jahren und es waren hier auch schon genug, die es ihm anhand der offiziellen Zahlen vorgerechnet und für jeden nachvollziehbar erklärt haben. Stimmt dann aber nicht oder du kommst auf seine persönliche Ignoreliste, weil du ein ignoranter Fanboy bist lol. Ich bin auch kein Fan von Smurfing, aber das, was der Typ verbreitet und sich selbst zurecht gezimmert hat, ist einfach nur Irrsinn hoch 10.\n\nDas er komplett übertreibt will ich ja gar nicht bestreiten. Aber:\n \"es [ist] schon eine große Kunst nochmal irgendwann im MMR-Bereich Bronze zu spielen, da braucht es schon extreme Pechsträhnen oder aktives Trollen für.\"\nWie gesagt, mir passiert es selber, dass ich mit Gold 5-2 Spielern gemacht werde. So unwahrscheinlich finde ich das gar nicht.\nUnd nochmal: Ich bin der Meinung, dass er manchmal/öfters mit Leuten zusammen spielt, die Gold oder höher sind und diese irrtümlicherweise für Smurfs hält, obwohl sie mit ihrem \"normalen\" Account spielen. Denn wie auch immer das Matchmaking meint diese Spieler auszugleichen: Sie heben sich ab und spielen im Vergleich zu dem Rest extrem gut.","replies":[]}]}]}]},{"poster":"Jûles","date":"2017-04-30T12:13:10.096+0000","up_votes":1,"down_votes":0,"body":"Ich kenne die Problematik von unbalanced Matchups. Ich finde die auch sch...ade. Die Frage ist nur, ob das Matchmaking daran schuld ist oder ob es sich wirklich um Smurfs handelt.","replies":[]}]}]}]},{"poster":"AI Yjuq","date":"2017-04-29T16:10:27.449+0000","up_votes":2,"down_votes":0,"body":"Die Frage ist doch eher: Was definierst du als Troll? Einfach nur ein Pick der nicht Meta ist?\n\n> nun sagen wir mal nicht wirklich in der zugehörigen Position aufgehen (aka trollpicks).\n\nDu würdest dich wundern was so alles funktionieren kann, wenn man ihnen eine Chance gibt. Kommt natürlich drauf an, wenn derjenige in der Champ Select schon ankündigt dass er trollen wird ist es eine andere Situation, als jemand der einfach nur was pickt und sein bestes geben will.\n\nIch selber picke auch schon mal gerne (auch in Rankeds) gegen die Meta. Aber meistens dann nur, weil etwas in unserer Team-Comp (meiner Meinung nach) fehlt. Letztens war ich auf der Bot-Lane (last pick ^^) und wir hatten keinen einzigen Tank im Team. Wir hatten halt schon 2 AD DD (Riven Top und Xin im Jungle). Dann noch eine Syndra in der Mitte und ein Bard Support. Da ich meine Elo ja kenne und jeder auf Schaden geht hab ich einfach ein Mundo für die Bot-Lane gepickt. Klar war das Team anfangs nicht erfreut darüber, aber Mundo kann mit seiner Q safe von der ferne farmen (ähnlich wie Zed) und wird später tanky af. ^^\n\nLetztendlich stand ich 8/3/7 gegen eine Lucian / Alistar Bot-Lane dar. Picks die gegen die Meta sind, müssen nicht zwingend von Leuten kommen, die trollen wollen. Ich selber denke mir bei meinen Picks auch etwas. Eine Strategie oder irgendwas, was diesen Pick in dieser Situation rechtfertigen kann. Ob dann die Ansichten auch gut waren oder nicht, ist wieder eine andere Geschichte.\n\nIch würde dir empfehlen einfach die Games zu spielen und den Leuten eine Chance zu geben. Meine Ansicht dazu. :)\n\nDer Bard (also mein early-Support) hat übrigens nicht 1x geflamet. Er hat mir die Chance gegeben und mich gewissenhaft supportet dass ich überlebe und farmen konnte. Später hab ich halt die Rolle als Tank wahrgenommen und Bard gesagt, er sollte sich so langsam um unsere Carries kümmern. ^^","replies":[{"poster":"Jûles","date":"2017-04-29T16:55:42.183+0000","up_votes":1,"down_votes":1,"body":"Hey AI Yjuq.\n\"nun sagen wir mal nicht wirklich in der zugehörigen Position aufgehen (aka trollpicks).\" war tatsächlich nur als sarkastische Hyperbel gemeint. Ich mein(t)e damit wirklich so sachen wie einen adc als support (mf und ashe jetzt mal ausgeschlossen :D), eine Soraka jgl etc.\nUnd wie du schon geschrieben hast, kann man die Absicht des Trolls bereits anhand der zahlreichen \"Lol autofill i troll\" Aussagen erkennen. \nEntschuldige, dass es da ein Missverständnis gab. Sollte ich eventuell umformulieren.\nAllerdings muss ich zugeben, dass ich einem Mundo der die adc Rolle einnimmt auch sehr kritisch gegenüber stehen würde. Ihr hattet außer Syndra keine ranged Carries und Mundo hat auch keine wirklichen seige Möglichkeiten. Wenn du es allerdings genauso wie hier begründet hast und dich anstrengst, dann ist es schon ok :D","replies":[{"poster":"AI Yjuq","date":"2017-04-29T17:28:31.455+0000","up_votes":2,"down_votes":0,"body":"Ach ja, soraka jungle. Da hab ich auch ein paar games hinter mir... ^^\nGeht leider jetzt beschissener wegen der Jungle Änderung :(\n\nFinde das schade, hab sie doch schon gerne mal im Jungle gepickt xD","replies":[{"poster":"Enderized","date":"2017-04-30T06:32:51.288+0000","up_votes":2,"down_votes":0,"body":"Vor ihrem Rework habe ich Soraka sehr gerne AD im Jgl gespielt.\nDamals konnte sie sich wenigstens selbst heilen =_=","replies":[]},{"poster":"Jûles","date":"2017-04-29T19:02:23.915+0000","up_votes":1,"down_votes":0,"body":":O{{sticker:zombie-brand-mindblown}}","replies":[]}]}]}]},{"poster":"Enderized","date":"2017-04-29T15:05:20.620+0000","up_votes":2,"down_votes":0,"body":"Spiele.\nSpiele so lange wie möglich.\nMache aus dem Spiel eine 60minuten Runde wenn möglich.\nUnd ganz besonders dann, wenn der Troll/Feeder/Flamer ff@20 machen will.","replies":[{"poster":"Jûles","date":"2017-04-29T15:44:13.914+0000","up_votes":1,"down_votes":0,"body":"Aber warum? Damit quäle ich mich ja selbst 40 unnötige Minuten lang.^^","replies":[{"poster":"TerrorRaven","date":"2017-04-29T15:50:24.552+0000","up_votes":2,"down_votes":0,"body":"Wenn du das Spiel durchziehst, hast du zumindest eine Chance, dass Spiel zu gewinnen (frei nach: \"Wer kämpft, kann verlieren. Wer nicht kämpft hat schon verloren\").","replies":[{"poster":"Jûles","date":"2017-04-29T18:07:01.791+0000","up_votes":1,"down_votes":0,"body":"Ja, aber ich gehe lieber nach dem Motto: \"Wer seine Truppen zurückzieht, weil er zu 99% verliert, minimiert seine Verluste\" :D\nVor allem, weil ich Leute aus dem Gegner Team hasse, die dann noch \"Ez\" oder ähnlichen schreiben.","replies":[{"poster":"Enderized","date":"2017-04-30T06:32:12.135+0000","up_votes":2,"down_votes":0,"body":"Wenn die Gegner nach einem 40+ Minuten Spiel ''eZ'' schreiben, kann man das doch nicht ernst nehmen :D\nWäre eher traurig :D","replies":[{"poster":"Jûles","date":"2017-04-30T08:27:57.825+0000","up_votes":1,"down_votes":0,"body":"Das stimmt natürlich. Aber das ist irgendwie immer so die letzte Priese Salz oben drauf :D Die Wenigsten schreiben das, weil sie meinen das Spiel war einfach, sondern einfach um einen zu ärgern.\nEs zeigt einem irgendwie, dass man da mal wieder so ganz alleine steht und dass die restlichen Spieler so gar kein Verständnis zeigen.","replies":[]}]},{"poster":"eingew","date":"2017-04-30T16:26:50.074+0000","up_votes":1,"down_votes":0,"body":"Das Problem in League ist halt nur, dass es ja keinen wirklichen Rückzug gibt. Also... du kannst dich natürlich bis zu Base zurückziehen, aber damit gibst du deinem Gegner wichtige Resourcen. Eine Niederlage mit wenig Verlusten gibt es in League ja nicht wirklich, Sieg und Niederlage sind absolut und rufen immer absolut dasselbe hervor, ob du nun mit einem Troll verlierst oder ohne.","replies":[{"poster":"Jûles","date":"2017-05-01T09:49:18.590+0000","up_votes":1,"down_votes":0,"body":"Die Ressourcen, die ich mir beim Rückzug (aka dem surrendern) spare, sind Nerven^^.","replies":[]}]}]}]},{"poster":"Enderized","date":"2017-04-29T16:35:26.926+0000","up_votes":2,"down_votes":0,"body":"Das ist korrekt, aber viel wichtiger: Du quälst denjenigen, der versucht das Spiel absichtlich zu verlieren wegen Grund X.\nIch persönlich betrachte es als Genugtuung, diese Art Spieler ''leiden'' zu sehen.\n--> In dem Spiel kann ich dann meine Fähigkeiten/Mechaniken/Makroplay aufbessern, und der andere darf warten und mir dabei zusehen.\nWenn er das Spiel verlässt wird er entsprechende Strafe erhalten.","replies":[{"poster":"Jûles","date":"2017-04-29T17:15:18.071+0000","up_votes":0,"down_votes":0,"body":"Ok, Respekt. So positiv könnte ich das in dem Moment nich sehen. Gerade in Rankeds, finde ich es besonders frustrierend wenn durch so etwas das Spiel entschieden wird. Und wenn es dann besonders lange dauert sitzt der Frust bei mir umso tiefer.^^\nDas mag auch daran liegen, dass ich mitlerweile sehr pessimistisch an das Spiel rangehe. Gefühlt hat man in jedem Spiel jemanden, der einen beleidigt, inted oder afk geht. Also nochmal: Respekt {{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Enderized","date":"2017-04-29T18:28:56.072+0000","up_votes":2,"down_votes":0,"body":"''Positives Denken'' würde ich das nicht nennen ^^\nSagen wir eher:'' Wie du mir, so ich dir''\nRuinierst du mein Spiel --> Klaue ich dir deine Zeit.\n\nPersönlich gehe ich mittlerweile ohne Erwartungen ins Ranked. Picke worauf ich lust habe und blende den Rest weitesgehend aus.\nWenn dann jemand aus der Kategorie ''Arschloch'' kommt, wird derjenige halt sehen, was er davon hat.\nIch spiele Ranked > Normals, da man in Rankeds wenigstens noch manchmal Teamler bekommt die gewinnen wollen.","replies":[{"poster":"Jûles","date":"2017-04-29T18:59:58.797+0000","up_votes":1,"down_votes":0,"body":"Naja, also ich könnte bei so einem Spiel nicht hingehen und sagen: ich verbessere jetzt meine Fähigkeiten/ Mechaniken/Makroplay :D","replies":[{"poster":"Enderized","date":"2017-04-30T06:31:00.223+0000","up_votes":2,"down_votes":0,"body":"Du musst es ja nicht sagen, aber es ist so.\nDu wirst gegen einen Überlegeneren Gegner spielen.\nD.h. du wirst dich (hoffentlich) entsprechend Anpassen, nicht à la Int. Feeder einen 12/0/0 Toplaner hervorbringen oder \netwa nicht? =)\nDu lernst also, wie man spielen kann/muss/sollte, wenn man behind fällt, etwas, was viele Leute einfach nicht können und mit 0/5 immer noch versuchen eine Irelia zu fighten. :D","replies":[{"poster":"Jûles","date":"2017-04-30T09:03:20.098+0000","up_votes":1,"down_votes":0,"body":"Nun, mein Spiel-Stil ist sowieso relativ defensiv. Liegt wahrscheinlich daran, dass ich immer sehr lategame lastige Champions spiele (was in der Solo/duo Q, vielleicht auch nich das Cleverste ist). Soll heißen, dass ich in einem unterlegenem Matchup es gewohnt bin, eine innige Beziehung mit meinem Tower zu pflegen^^.  Und wenn ich dann mal 0/4  stehe, dann liegt das ganz bestimmt nur an meinem Team!!!1111elf. Aber Spaß beiseite, oft laufen solche 4vs5 Spiele (was es ja im Enteffekt ist, weil man faktisch einen Spieler weniger im Team hat bzw. der Gegner einen mehr) aber in 2 Wegen ab (bei mir zumindest): Entweder fighten wie gewohnt weiter, sind logischer Weise unterlegen und das Spiel ist relativ schnell vorüber. Oder aber, man spielt sehr defensiv, vermeidet Team Fights und Trades, sieht aber dann quälend langsam wie ein Objective nach dem anderen genommen wird und das Unvermeitliche herausgezögert wird. Ich weiß also nicht, ob das mir zwangsläufig in normalen Spielen so viel weiterhilft.\nP.s.: Ich möchte nur klarstellen, dass ich nicht Weg 1 wähle, nur weil dann das Spiel schneller vorbei wäre. Ich starte zwar surrender votes, spiele aber ganz normal weiter, sollte sich mein Team aus was auch immer für Gründen dagegen entscheiden das Spiel aufzugeben.","replies":[]}]}]}]}]}]}]}]},{"poster":"Killerkante","date":"2017-04-29T23:51:51.148+0000","up_votes":2,"down_votes":0,"body":"Dodgen, wenns öfter passiert nochmal dodgen, nach dem 2. mal allerdings höre ich dann auch auf für den Tag und zocke was anderes.\nZumindest in ranked.","replies":[{"poster":"Jûles","date":"2017-04-30T08:30:20.801+0000","up_votes":1,"down_votes":0,"body":"Letzteres ist eine gute Idee. Nach dem zweiten Mal, ist mir der Dodge Timer sowieso zu hoch^^","replies":[]}]},{"poster":"Mr Roli","date":"2017-04-29T14:44:00.531+0000","up_votes":1,"down_votes":5,"body":"***","replies":[{"poster":"TerrorRaven","date":"2017-04-29T14:54:09.033+0000","up_votes":2,"down_votes":0,"body":"Wenn man so blöd ist und den troll auch noch flamt, dann darf man sich nicht wundern, wenn man bestraft wird.","replies":[]}]}]}