{"poster":"The Trent","date":"2017-01-23T03:54:48.741+0000","title":"Kled","subforum":"Gameplay","up_votes":2,"down_votes":1,"body":"How come Kled is never in any games? I haven&#039;t played a single game with a Kled on the enemy team. I&#039;ve played as Kled, but never against him. I play the game a lot too... So why? I see more Urgots than Kleds...","replies":[{"poster":"MythPuppy","date":"2017-01-23T04:56:31.170+0000","up_votes":1,"down_votes":0,"body":"Because, supposedly, he's super bad. *I'M* not saying he's bad, just putting that out there. I bought him maybe 3 months ago? played as him once and don't really remember how it turned out. Most kleds I see don't do that well though tbh, so maybe he's not that good....","replies":[{"poster":"The Trent","date":"2017-01-23T09:02:13.657+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=neptune4424,realm=NA,application-id=3ErqAdtq,discussion-id=ELHjOezR,comment-id=0000,timestamp=2017-01-23T04:56:31.170+0000)\n>\n> Because, supposedly, he&#x27;s super bad. *I&#x27;M* not saying he&#x27;s bad, just putting that out there. I bought him maybe 3 months ago? played as him once and don&#x27;t really remember how it turned out. Most kleds I see don&#x27;t do that well though tbh, so maybe he&#x27;s not that good....\n\nWell he's definitely not bad... He has a above 50% winrate","replies":[]}]},{"poster":"IronwallJackson","date":"2017-01-23T08:07:26.897+0000","up_votes":1,"down_votes":0,"body":"I think it's because he's risky. Kled's kit encourages unbridled aggression, but there are situations when that's just not feasible or wise. Like when Skarl runs off. He's definitely strong, but I'll be damned if everything you do with him doesn't feel incredibly risky.","replies":[]},{"poster":"SuddenAntagonist","date":"2017-01-23T07:43:19.636+0000","up_votes":1,"down_votes":0,"body":"The reason is simple, people aren't sure what to do with him. Kled is one of those champs that denies safe play as a strategy. If you're Kled, you're all in, or you're useless. He's decently strong, sticky, and has a decent kit, but it's hard for people to go from \"I should wait to engage until I'm sure about getting the kill, I'll play safe.\" to ~~\"GET IN THE HOUSE SKARL!\"~~ \"I need to engage on them every time I can and force them out of lane, because my lizard is taking all the damage, and even when he runs away, as long as they aren't dumpstering me, I can pull it off without him AND he'll come back.\"","replies":[]}]}