{"poster":"eAirways","date":"2017-06-12T08:22:49.282+0000","title":"¿Qué hago? Soporte [D5] ADC [D5]","subforum":"Off-topic y temas personales","up_votes":4,"down_votes":0,"body":"Buenas, tengo una duda, he estado jugando en mis dos cuentas 1 rol distinto en cada acc y viendo que rol se me da mejor, porque queria ver si podia entrar en algun equipo que aspirara a algo. Mi gran problema es que por mi conexion a internet solamente puedo jugar de noche, por lo tanto no tengo tanto tiempo para practicar. La pregunta seria &iquest;Que rol deberia seguir jugando y cual no?. \r\n\r\nAca dejo mis stats:\r\n\r\nhttps://las.op.gg/multi/query=eairways%2Cairways\r\n\r\nLa verdad que si comparamos numeros no estan tan mal, pero al no poder jugar demasiado mi conexion es jugable apartir de las 00:00 o 01:00 por lo que no puedo jugar mucho. \r\n\r\nDesde ya un saludo.","replies":[{"poster":"Axlbg","date":"2017-06-12T13:29:29.567+0000","up_votes":2,"down_votes":0,"body":"Generalizando, la importancia del microjuego del support o mecánicas es mucho menor que la de un adc. Por lo tanto te recomendaria enfocarte en ser una bestia del macrogame como support ya que eso se puede explotar, y no muchos supports son realmente buenos en esto.\n\nPodes intentar aprender viendo videos o algun tipo de conentenido mientras no puedas jugar, y por las noches ponerlo en práctica y practicar aún más la fase de líneas.\n\nEs un consejo para que aproveches más tu tiempo pero si prefieres jugar de adc nada deberia impedirtelo. La diferencia es que un supp con más conocimientos suele tener más peso que el adc que tiene que farmear todo el game.","replies":[{"poster":"eAirways","date":"2017-06-12T15:28:13.974+0000","up_votes":1,"down_votes":0,"body":"Gracias, lo voy a tener en cuenta, seguramente me decida por jugar soporte.","replies":[]}]},{"poster":"Cyclosarin","date":"2017-06-12T11:17:57.863+0000","up_votes":2,"down_votes":0,"body":"Si uno considera convertirse en profesional (o casi), esto es, convertir tu pasión en un trabajo, tiene que tener en cuenta que pronto, eso que TANTO te apasionaba puede empezar a ser una rutina. Sabiendo eso, lo ideal, es que trates de pasarla bien en esa profesión la mayor parte del tiempo. Por lo tanto, en esta cuestión, la respuesta la tenés vos mismo, que posición disfrutás mas? cuál no te aburre jugar y/o podrías hacer 20 partidas seguidas en el mismo rol? De esa respuesta, saldrá la solución. \n\nSaludos!","replies":[{"poster":"eAirways","date":"2017-06-12T15:28:57.592+0000","up_votes":1,"down_votes":0,"body":"Muchas gracias por la opinion, la verdad que en ese sentido no me molesta jugar ninguna lane, me divierten todas, jaja ese es otro problema también.","replies":[]}]},{"poster":"Lunari Red Mask","date":"2017-06-12T10:14:45.305+0000","up_votes":2,"down_votes":0,"body":"Hola, ya te dieron una opinión de cada lado, toca que yo de una neutra :V\nPrimero busca un equipo que veas bien. Luego ofrece ambas lineas para que el equipo decida que es lo que necesita más. Y entonces, la recomendación sería: la elección es del equipo, no tuya. \nSaludos y buen juego.","replies":[{"poster":"eAirways","date":"2017-06-12T10:23:50.770+0000","up_votes":1,"down_votes":0,"body":"Claro el problema es que, no puedo seguir jugando tantos campeones si tengo que subir y en dos posiciones en si. Porque con ser diamante V no voy a conseguir algo digamos, enserio. Mi idea es seguir subiendo, pero solamente jugando una posicion y buscar un equipo que necesite esa posicion mas adelante. Gracias por la opinion.","replies":[]}]},{"poster":"Turing Test","date":"2017-06-12T09:25:05.644+0000","up_votes":2,"down_votes":0,"body":"Sin ver tus stats, te diría que jugaras soporte. Ser ADC requiere tener un juego temprano limpio y claro. Las conexiones a internet lentas o quizás la poca disponibilidad de tiempo para mantener una memoria muscular saludable, a la hora de posicionarte y farmear, hace que se complique más mantener el nivel jugando un rol muy sensitivo a cualquier cambio. El soporte depende un poco más de la capacidad de adaptación, comprensión del juego y visión global, que de la precisa habilidad de concentrarse en minions, posicionamiento y tradeos.\n\nEs mi opinión personal, desde mi humilde calidad de observador.","replies":[{"poster":"eAirways","date":"2017-06-12T09:31:37.197+0000","up_votes":1,"down_votes":0,"body":"Quizas tengas razon, porque a pesar de que la mayoria de las veces farmeo entre 7 y 9 CS  por minuto, muchas días me pasa que podría estar farmeando entre 10 y 11. Pero erro muchos CS no forzados digamos, sin presion.","replies":[]}]},{"poster":"XANAX EN POLVO ","date":"2017-06-12T09:13:01.228+0000","up_votes":2,"down_votes":0,"body":"En mi humilde opinión te veo mejor como adc pero nunca te vi jugar como para decirte juga adc o juga suport, te recomendaría a que veas lo que te hace mas ilusión jugar o te sentis mas cómodo","replies":[{"poster":"eAirways","date":"2017-06-12T09:19:31.198+0000","up_votes":1,"down_votes":0,"body":"Gracias por la respuesta!","replies":[]}]}]}