{"poster":"Hi its John","date":"2017-09-25T22:03:43.888+0000","title":"Bug Splats today.","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"I've had 5 bug splats today, they all happened at random points during champion select, never during game. The client would \"close\" and popup the bug splat window and once I was done with that the client would open back up to a blank screen with a spinning loading wheel for about 45 seconds before it would go back to the champ select screen. The most recent one caused me to \"dodge\" the game because of the loading wheel thing taking so long and it gave me a 5 minute queue dodge timer. I just did a full repair and am waiting on my timer to run out so I can try again. Any suggestions on anything else I could do if this keeps happening?","replies":[{"poster":"Broporo","date":"2017-09-26T02:38:34.424+0000","up_votes":1,"down_votes":0,"body":"Before hopping back into a normal queue I'd suggest testing this in a custom or practice match. If your troubleshooting didn't fix the issue there's a chance of it happening again and you getting longer LPQ's, so it'd be smarter to test this out in a non-matchmade game mode.\n\nBugsplats are a sign that some of the client files aren't working properly, so that repair was a good first step. If that doesn't help, check out the steps in this [**crash guide**](https://support.riotgames.com/hc/en-us/articles/201761974) as well. Again, make sure to test this in custom or practice matches.","replies":[{"poster":"Hi its John","date":"2017-09-27T15:34:29.040+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Broporo,realm=NA,application-id=osqw6G4M,discussion-id=4E0O7JJB,comment-id=0000,timestamp=2017-09-26T02:38:34.424+0000)\n>\n> Before hopping back into a normal queue I&#x27;d suggest testing this in a custom or practice match. If your troubleshooting didn&#x27;t fix the issue there&#x27;s a chance of it happening again and you getting longer LPQ&#x27;s, so it&#x27;d be smarter to test this out in a non-matchmade game mode.\n> \n> Bugsplats are a sign that some of the client files aren&#x27;t working properly, so that repair was a good first step. If that doesn&#x27;t help, check out the steps in this [**crash guide**](https://support.riotgames.com/hc/en-us/articles/201761974) as well. Again, make sure to test this in custom or practice matches.\n\nI did test it out in a couple of non-matchmaking modes and everything seems to be working fine. Thanks, Broporo. :)","replies":[]}]}]}