{"poster":"stoitzii","date":"2016-11-29T20:32:27.391+0000","title":"Community/Clan gesucht","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Nabend zusammen,\r\nwie in der &Uuml;berschrift bereits gesagt, suche ich eine ( gerne auch kleinere) Community bzw einen Clan. Ich habe in den letzten Wochen versucht in einige Communitys mich selbst einzufinden, habe aber gemerkt, dass es nicht sonderlich gut passt, sei es wegen mir, oder diverser Gr&uuml;ppchenbildungen etc etc.\r\nAm liebsten w&auml;ren mir einfach einige nette Leute, zum Normals/Arams spielen, und sich evtl auf Rankeds vor zu bereiten. \r\nEin wenig &uuml;ber mich, ich spiele LoL seit gut 6 Jahren als Main supporter, habe aber auch nichts dagegen mal in die Mitte aus zu weichen oder auf die Top Lane. Ich selbst bin 24 Jahre alt, und suche daher eine Community mit 18 + Leuten, wobei es kein Kritikpunkt ist, sollte jemand unter 18 sein.\r\nF&uuml;r alle m&ouml;glichen Anl&auml;sse, d&uuml;rft ihr mich gerne adden - Teamspeak ist nat&uuml;rlich vorhanden.\r\n\r\nGr&uuml;&szlig;e und bis bald,\r\n\r\nChris - Trump the dumb","replies":[{"poster":"K0l1BR1","date":"2016-11-30T18:28:38.948+0000","up_votes":1,"down_votes":0,"body":"Guten Tag,\nwir von PENGUINS-eSports suchen zur Zeit Mitglieder für unsere Community Teams im League of Legends Bereich.\nJedoch sind harmonische SoloQ-Leute ebenfalls erwünscht ;)\nDaher wollte ich sie fragen ob sie Interesse hätten einem festen Team beizutreten.\n\nUnsere Website: https://www.penguins-esports.de/\nMein Kontakt: sebastian.kohlbeck@penguins-esports.de\n\nSollten sie Interesse haben bewerben sie sich bitte über unsere Website.\nSollten noch Fragen offen sein melden sie sich per Mail oder über unsere Website.\n\nMit freundlichen Grüßen\n\nKolibri, League of Legends Organisator, PENGUINS e-Sports","replies":[]},{"poster":"saVé","date":"2016-11-30T16:12:55.979+0000","up_votes":1,"down_votes":0,"body":"Hey Chris,\nwir sind eine kleine Spielgemeinschaft. Schau doch einfach mal im TS ( ts.crave-royal.de  ) vorbei.","replies":[]},{"poster":"fess123","date":"2016-11-30T07:02:19.196+0000","up_votes":1,"down_votes":1,"body":"Hi Chris,\n\ndu hast es satt alleine in der Flex Queue zu spielen und suchst nun ein Team oder benötigst einfach nur Gleichgesinnte? Aequilibritas eSports hilft dir bei der Erstellung eines Teams und bei der Suche nach Mitspielern, sodass du hoffentlich schnell in einem Team unter gebracht wirst, aber dir sind natürlich auch spaßige Abende garantiert!\n\nHier gehts zu unserem Vorstellungsthread: [Aequilibritas eSports sucht Mitglieder | Community und eSports | LoL, CS:GO, Overwatch etc.](http://boards.euw.leagueoflegends.com/de/c/clans-teams-de/cOWosEff-aequilibritas-esports-sucht-rekruten-community-esports-lol-csgo-overwatch-etc)\n\nÜber diesen Link kannst du natürlich auch direkt zur Aufnahme gelangen: [Bewerbungsformular](http://aequilibritas-esports.de/index.php/Application/)\n\nUnsere Community existiert bereits seit 2009. Wir würden uns natürlich über dein Interesse freuen und eventuell sogar über die Teilnahme an unserer Gemeinschaft. :)","replies":[{"poster":"stoitzii","date":"2016-11-30T08:28:36.346+0000","up_votes":1,"down_votes":0,"body":"Sry - ,euch' kenn ich bereits, und der Copy Paste shit den Ihr da seit Wochen abzieht, ist echt mehr als uninteressant. Durfte ein paar eurer Leute kennenlernen, das hat mir vorerst gereicht ;)","replies":[]}]},{"poster":"Mepheleon","date":"2016-11-29T21:02:42.537+0000","up_votes":1,"down_votes":0,"body":"https://tactical-riot-gaming.de/","replies":[]}]}