{"poster":"Weregild","date":"2017-09-25T23:45:04.763+0000","title":"Mi ban.","subforum":"Comportamiento del jugador","up_votes":4,"down_votes":10,"body":"Buenas noches, voy a ser lo m&aacute;s breve posible para no aburrir.  Juego hace unos meses al lol, me insisti&oacute; mi primito menor de 13 a&ntilde;os para que jugara.  Si bien la cuenta tiene muy poco tiempo y es una cuenta muy nueva como yo, para mi es muy valiosa ya que tiene regalos, cosas que he comprado y  le puse mucho esfuerzo. Hace un tiempo, vino mi primo a mi casa y tras dejarlo jugar una partida en mi pc, me como una suspensi&oacute;n de 13 d&iacute;as,  y un mensaje con cosas que supuestamente yo hab&iacute;a escrito,  yo no sab&iacute;a ni lo que era, porque jam&aacute;s me hab&iacute;a pasado algo as&iacute;, le cont&eacute; esto a mi mejor amigo que juega hace muchos a&ntilde;os, y me dijo que no mande ticket porque a un amigo suyo le banearon la cuenta por enviar un ticket tras una suspensi&oacute;n similar.  Esper&eacute; que me devolvieran mi cuenta, luego volv&iacute; a jugar como siempre. Pero  apenas tuve mi cuenta de nuevo, le cambi&eacute; la contrase&ntilde;a para que nadie pueda entrar.  Despu&eacute;s de que pase esto, mi primo la semana siguiente vino a mi casa de nuevo, y despu&eacute;s del almuerzo familiar me pidi&oacute; para jugar, le dije que usara su cuenta porque casi me hace perder la m&iacute;a, y me prometi&oacute; que nunca m&aacute;s iba a flamear o cosas por el estilo. Puesto que a &eacute;l le gusta mi cuenta por la cantidad de skins que tiene.  Dej&eacute; que siguiera jugando en mi pc, desde mi cuenta algunas veces que ven&iacute;a a mi casa, muy eventualmente, los domingos. La cosa es que a la madrugada de ayer, cuando se van mis familiares , intent&eacute; jugar una partida y me encuentro con un cartel  que dice PERMANENTLY BANNED. Con una muestra de mensajes flameando que se enviaron desde mi cuenta.  Fui muy est&uacute;pida. Asumo toda la culpa,  por no actuar responsablemente, me pudo un nene de 13 a&ntilde;os porque pr&aacute;cticamente le cambie los pa&ntilde;ales cuando naci&oacute; y me cuesta decirle que no, pero deber&iacute;a haber hecho algo al respecto.  A todo esto, cabe aclarar que no ten&iacute;a la m&aacute;s m&iacute;nima idea de que est&aacute; prohibido dejar que alguien m&aacute;s use nuestra cuenta. Me lo dijo mi amigo antes de crear este post, para que no diga la verdad pero es la &uacute;nica forma que encuentro de contar lo que pas&oacute;, repito, s&eacute; que soy culpable por haber sido irresponsable, pero si algo no soy es una persona t&oacute;xica. Quiero pedir disculpas,  y no s&eacute; a qui&eacute;n me tengo que dirigir, pero si alg&uacute;n administrador me lee, por favor revise mi caso, estaria muy agradecida, s&eacute; que comet&iacute; faltas ,  pero prometo que si me dan otra oportunidad no volver&aacute; a suceder, ya aprend&iacute; la lecci&oacute;n.  Solo pido una oportunidad, si la penalizaci&oacute;n dura meses lo aceptar&eacute;, pero tener la oportunidad de alg&uacute;n d&iacute;a poder usar mi cuenta de nuevo. Ya que puse mucho esfuerzo en ella y tengo muchas cosas que son valiosas para m&iacute;.  Les agradecer&iacute;a mucho que al menos lo piensen y eval&uacute;en si merezco otra oportunidad. Y prometo que jam&aacute;s pasar&aacute; de nuevo. Sea cual sea la respuesta Gracias por su tiempo.","replies":[{"poster":"MotaLove","date":"2017-09-25T23:50:04.848+0000","up_votes":4,"down_votes":2,"body":"A ver... te lo explico en pocas palabras a nivel muy infantil para que entiendas.\n\nNo te banean por UNA SOLA PARTIDA, que dijiste algo.\n\nTe banean sabes por que?, porque fuiste toxico constantemente y fuiste acumulando una importante cantidad de reportes validos entendes?.\n\nSin contar, QUE TE DAN DOS AVISOS PARA QUE DEJES DE SER TOXICO, pero vos los ignoraste entendes?.\n\nPrimero te banearon el chat por 10 partidas, segundo te banearon por 25 partidas el chat, asi que sos un toxico mas entendes?.\n\nY por ultimo, no vengas con la historia del primito, el hermanito, el amiguito ni nada, historia muy vieja conocida y usada.\n\nEntonces que tiene de mal tu ban?, nada esta perfectamente aplicado {{sticker:sg-syndra}}","replies":[{"poster":"ona3","date":"2017-09-25T23:57:34.443+0000","up_votes":1,"down_votes":0,"body":"https://i.imgur.com/BbIPj84.jpg[/img]\nsalu2","replies":[]},{"poster":"Nozarashi","date":"2017-09-25T23:56:22.889+0000","up_votes":1,"down_votes":1,"body":"{{sticker:sg-lulu}}","replies":[]},{"poster":"Weregild","date":"2017-09-26T00:09:00.928+0000","up_votes":1,"down_votes":3,"body":"No me dieron esta cantidad de avisos de los que hablas, yo ni siquiera sabía lo que era un ban. No me estoy quejando de mi ban, de hecho estoy asumiendo la culpa por  mi irresponsabilidad sobre mi cuenta.  Y antes de esto solo me dieron un aviso.  No soy un usuario tóxico constante como decis, pero si fui irresponsable. Y no ignoré nada, lamento que no hayas podido interpretar mi post correctamente. Gracias por comentar, saludos.","replies":[]}]},{"poster":"Kanhou","date":"2017-09-25T23:52:01.622+0000","up_votes":2,"down_votes":1,"body":"Lamentablemente jodiste, por 2 razones.\n\n1. Las cuentas no se prestan, asi que al reclamar por pasarsela a tu primo, estas dando a entender que infrigiste las normas basicas.\n2. Supongamos que te dijieran que te la desbanean, porque tu caso deberia ser especial con respecto al resto que fueron baneados por el \"error\" de prestar su cuenta.\n\nMi consejo hazte otra cuenta y empieza desde 0, y aprende a decir que no, para no volver a pasar un mal rato como este.\n\nSlds y sorry lo cruel y directa de mi respuesta, pero lamentablemente es asi.","replies":[]},{"poster":"0nslaugth","date":"2017-09-26T01:33:03.260+0000","up_votes":1,"down_votes":2,"body":"Es la politica basura de este juego ,lamentablemente por boludeces asi te comes permaban y te caen equipos de swat ,ahora trollea ,feedea ,arruina 1000 normales dejandote matar y nunca te van a hacer nada . \n Un sistema que prioriza la censura de chat ,a controlar lo que pasa en el juego .Podes mandar ticket, ya a estas alturas no tenes nada que perder ,aunque seguro te saldran con el ''Fuiste baneado correctamente y tienes faltas que vos mismo confesas'' ,etc ,etc .\n En fin, quejarse es gratis ,los bans por usar el chat USAR no flamear ,son gratis ,trollear y fastidiar sin problemas tambien es gratis","replies":[{"poster":"Weregild","date":"2017-09-26T23:27:55.151+0000","up_votes":1,"down_votes":1,"body":"Seeee, sabes qué es lo peor??   hoy tuve un jungla que salio 1/17, y cuando le pedi amablemente que  tenga más cuidad me dijo CALLA EL PICO CTM  HIJO DE LA CULIADORA SAPO REVOLCADO ( era chileno...) y a él, no le van a hacer  nada. Linda política la de los rioters.","replies":[{"poster":"fmx","date":"2017-09-27T20:10:10.083+0000","up_votes":1,"down_votes":0,"body":"Como estas seguro que no le van hacer nada?\n\nTodos los dias hay gente posteando en el foro casi de lo mismo queriendo que le saquen el ban osea que a esos que decis que no le van hacer nada ya estan cayendo de a poco\n\nY como decis que fuiste irresponsable con tu cuenta ahi tenes el resultado \"la irresponsabilidad trae una consecuencia cosas que te ha pasado\"\n\nPD: Create una nueva cuenta y trata de aprender de tus errores\n\nSalu2","replies":[]}]}]},{"poster":"xaxesis","date":"2017-09-26T03:46:49.973+0000","up_votes":1,"down_votes":0,"body":"uhmmmmmmm.....  No.","replies":[]},{"poster":"MasterRightClick","date":"2017-09-26T00:24:46.667+0000","up_votes":1,"down_votes":0,"body":"Cya cuenta y bue, asi es la política de rito.... a hacerse cargo de las consecuencias\n\nA propósito, JAMAS han devuelto una cuenta permabaneada por toxicidad","replies":[]},{"poster":"Americans","date":"2017-09-26T00:21:20.183+0000","up_votes":1,"down_votes":0,"body":"Hola, mientras me daba con cocaína sin querer le robe a alguien pero no estaba consciente. Juro que nunca va a pasar otra vez.\n\nA lo que voy con este ejemplo exagerado, es que te quejas que no flameaste porque en realidad estabas compartiendo cuentas. Y amenos que tu primo/hermano/novio haya insultado demasiado, no te banean por una sola partida, mucho menos permanentemente. Tampoco importa que vos digas que no recibiste nada antes, porque eso no es confirmable y Riot no tiene obligacion de dar advertencias.","replies":[]},{"poster":"ona3","date":"2017-09-25T23:49:11.931+0000","up_votes":1,"down_votes":0,"body":"el ban permanente es eso, permanente, debiste cambiar tu conducta con el primer ban\nsalu2","replies":[]}]}