{"poster":"Høneythief","date":"2016-12-26T07:10:39.546+0000","title":"¿Comprar a Irelia o Nocturne? ¿Ventajas y desventajas?","subforum":"Guias y consejos","up_votes":1,"down_votes":0,"body":"Me estoy proponiendo empezar a jugar rankeds luego de mucho tiempo (no he jugado una desde la S5 y en la S6 no he jugado casi nada, he retomado el juego apenas este mes).\r\n\r\n&iquest;Me viene bien comprar a Irelia? O por el contrario, seguir jugando en jungla y usar a Nocturne.\r\n\r\nMi problema es que solo s&eacute; jugar bien (decente la verdad, decente) en jungla, mid y support. Ser adc es un gran estr&eacute;s para m&iacute; y no tengo mucha serenidad para ir en esa posici&oacute;n, a diferencia del top que yo lo jugaba hace un buen tiempo, pero lo dej&eacute; ya que me tir&eacute; m&aacute;s a esas tres l&iacute;neas. El punto es que quiero expandir mis posibilidades de juego con Irelia o con otro campe&oacute;n que me puedan recomendar, a menos que opinen que me conviene seguir jugando en una posici&oacute;n ya conocida pero con un champ distinto, Nocturne. Si pudiesen darme pros y contras de cada uno, estar&iacute;a muy agradecido.\r\n\r\n{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"LyghtSh","date":"2016-12-26T13:20:04.839+0000","up_votes":3,"down_votes":0,"body":"Irelia es mas compleja, no hablare sobre ella porque bueno, mira arriba, ya dijieron todo.\n\nPero sobre Nocturne:\n\nMuy pocos campeones por no decir ninguno, puede hacer lo mismo que Nocturne, este tiene una R que le importa poco y nada cuantos enemigos hay enfrente de los debiluchos (Los mid ap/ad, o el adc por norma general) , la R de nocturne y su daño insano lo traduce a \"Destruir\", ya que una vez que se tira nada lo frena, pudiendose saltar a todos los que esten enfrente de tu objetivo, eso mas tu daño el enemigo muere mas rapido que si lo hubiera agarrado un Rengar.\nSu kit de habilidades no es nada complejo, tiene sus juegos y observaciones, como, que a la hora de farmear la jungla hay que tirar la Q para un lado para que no te vean los de linea, que la W la tenes que usar de manera perfecta o conveniente, y bueno,  recordar que la E hace daño.\n\n\nNo es un campeon complejo ni nada, tiene su potencial y su provecho para sacar a pulir, ademas esta bastante fuerte con el {{item:3153}} , y mas si luego le armas el {{item:3022}}  o/y  {{item:3053}} . A pesar de que el peor item de jungla sea el {{item:1416}} , aun le sigue sirviendo mucho al fantasmin.","replies":[]},{"poster":"Mugii","date":"2016-12-26T07:33:49.661+0000","up_votes":2,"down_votes":0,"body":"Irelia es una campeona bastante completa, sustain, CC, burst, etc.\nEs el campeón centrado en powerspikes por excelencia, o sea los momentos en que ella es fuerte contra los enemigos y los momentos fuertes de los enemigos. Abusando de los powerspikes suyos y evitando los enemigos, logra sacar ventaja de los enemigos y generar snowball. Irelia generalmente suele ganarle a cualquier campeón desde nivel 9 a 13 y cuando tiene Trinity. También tiene nivel 4 fuerte y se puede sacar kills faciles contra ciertos enemigos.\nPenaliza muy bien errores de posicionamiento debido a su Q que le permite hacer engage contra enemigos parados cerca de un minion bajo de vida. Es decir, comparte esta similitud con Riven y Renekton, que su kit está basado en abusar de los errores de los demás.\nAunque no hayas sacado ventaja, Irelia tiene muy fuerte mid game y late game decente, no es como un Pantheon que es feedearse o ser un pedazo de carne.\nSu kit es sencillo y su curva de aprendizaje es media. Puede realizar jugadas flasheras con la movilidad que le otorga su Q y el stun de su E. Tiene algunas mecánicas como sticky Q (busca en el canal de Irelia Carries U, este chabón es un one trick pony de Irelia challenger de NA y sube videos bastante buenos sobre como enfrentar ciertos campeones, runas, maestrías etc.).\nPosee la capacidad de burstear blanditos con 1 solo item, ya con solo sacar Sheen, Irelia es bastante dificil de lidiar.\nEn resumen, Irelia te enseña a manejar los powerspikes y a penalizar errores de los enemigos, todos los campeones pueden hacer eso, pero ella está enteramente centrado en eso.\n\nNocturne no lo jugue mucho, no puedo opinar. Pero sé en que consiste su kit de habilidades.  Aún así la prefiero a ella.","replies":[{"poster":"RodriiB","date":"2016-12-26T12:39:59.727+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Mugiwaraya,realm=LAS,application-id=8sKIclmi,discussion-id=69igFiWM,comment-id=0001,timestamp=2016-12-26T07:33:49.661+0000)\n>\n> Irelia es una campeona bastante completa, sustain, CC, burst, etc.\n> Es el campeón centrado en powerspikes por excelencia, o sea los momentos en que ella es fuerte contra los enemigos y los momentos fuertes de los enemigos. Abusando de los powerspikes suyos y evitando los enemigos, logra sacar ventaja de los enemigos y generar snowball. Irelia generalmente suele ganarle a cualquier campeón desde nivel 9 a 13 y cuando tiene Trinity. También tiene nivel 4 fuerte y se puede sacar kills faciles contra ciertos enemigos.\n> Penaliza muy bien errores de posicionamiento debido a su Q que le permite hacer engage contra enemigos parados cerca de un minion bajo de vida. Es decir, comparte esta similitud con Riven y Renekton, que su kit está basado en abusar de los errores de los demás.\n> Aunque no hayas sacado ventaja, Irelia tiene muy fuerte mid game y late game decente, no es como un Pantheon que es feedearse o ser un pedazo de carne.\n> Su kit es sencillo y su curva de aprendizaje es media. Puede realizar jugadas flasheras con la movilidad que le otorga su Q y el stun de su E. Tiene algunas mecánicas como sticky Q (busca en el canal de Irelia Carries U, este chabón es un one trick pony de Irelia challenger de NA y sube videos bastante buenos sobre como enfrentar ciertos campeones, runas, maestrías etc.).\n> Posee la capacidad de burstear blanditos con 1 solo item, ya con solo sacar Sheen, Irelia es bastante dificil de lidiar.\n> En resumen, Irelia te enseña a manejar los powerspikes y a penalizar errores de los enemigos, todos los campeones pueden hacer eso, pero ella está enteramente centrado en eso.\n> \n> Nocturne no lo jugue mucho, no puedo opinar. Pero sé en que consiste su kit de habilidades.  Aún así la prefiero a ella.\n\nSoy main irelia y entre para escribir algo asi, me ganaste de mano. Irelia se puede buildear de muchísimas formas, y creo que de los topliners es junto con fiora el del snowball más pesado, ya que cuando logras ponerte por delante puedes carrilear muy bien, y si te quedas atrás farmeando vuelves a méterte en partida.\n\nCon respecto de noc, es bueno contra equipos en los que necesitas eliminar rápido a algun campeon en especifico, por ej un twitch o un Viktor que son campeones que desde la backline hace mucho daño, tiene un juego bastante seguro en fase de líneas ya que la mayoría de las veces cuando tengas la R es kill.","replies":[]}]},{"poster":"CoronavirusC0V","date":"2016-12-26T08:50:26.838+0000","up_votes":2,"down_votes":0,"body":"diria que irelia, podes sacarme mucho mas potencial ademas de ser uno de los champs con mejores 1vs1 del juego, con un sustain impresionante a partir del 9 casi nadie te gana si es que vas bien, ademas de poder tener la posilibidad de volver al game de manera facil por ser un champ con un powerspike bastante alto,pero si sos mas jg te recomiendo a nocturne, buen champ la verdad bastante bueno tambien en los 1vs1 debido a su W que puede mitigar una skill y si la usas sabiamente le podes joder todo el combo al enemigo y te buffa avos, lo bueno que tiene noc es que no es hard counter de nadie pero tampoco posee uno asique siempre es bueno elejirlo y posee un gank muy fuerte a partir de level 6, bien utilizado causa destrozos igual que irelia.","replies":[]},{"poster":"Yitán","date":"2016-12-26T07:26:57.098+0000","up_votes":1,"down_votes":1,"body":"compralos a ambos, es solo ip","replies":[]}]}