{"poster":"demondragon48","date":"2017-09-18T02:45:07.990+0000","title":"Que le paso al rendimiento?","subforum":"Problemas Técnicos","up_votes":7,"down_votes":1,"body":"Acabo de jugar una partida donde los FPS me variaba de 120 a 5, literalmente, y nunca me ha pasado, y no tengo mal PC como para que el LOL me corra de esa forma.\r\n\r\nQue le paso al rendimiento? \r\n\r\ny tampoco era el &uacute;nico, en la partida 3 dijeron estar en las mismas.","replies":[{"poster":"Boosted Ahri","date":"2017-09-18T19:46:30.300+0000","up_votes":1,"down_votes":0,"body":"a mi me pasa exactamente lo mismo hace bastante no puedo jugar de jugar en 120, 130 fps me baja a 30 alguien sabe porque y si van a solucionar?","replies":[]},{"poster":"Renekor","date":"2017-09-18T16:50:02.325+0000","up_votes":1,"down_votes":0,"body":"En tf los fps me bajan a 45/50\n\nComo puede ser esto? cumplo perfectamente con los requisitos recomendados. En el carril me va a mas de 120","replies":[]},{"poster":"Mioen","date":"2017-09-18T03:31:58.309+0000","up_votes":1,"down_votes":0,"body":"Bueno si tienes W10 primero te recomiendo que desactives las funciones de Xbox del equipo ya que suele bajar el rendimiento.\n\nPor otra parte la última Update de Windows tiene un par de problemas con los juegos en general.\n\nOtra cosa puede que la PC este tomando temperaturas más altas.","replies":[]},{"poster":"AJ             J","date":"2017-09-18T03:16:07.202+0000","up_votes":1,"down_votes":0,"body":"A mi me anduvo bien hasta ahora, pero ando con una GTX 1070, si no me llega a andar bien medio que tiro la pc al carajo.\n\nLos motivos de altibajos de FPS no pueden ser demasiados, tal vez tenga que ver con la ultima actualizacion?","replies":[]},{"poster":"ALITA DE MOSHCA","date":"2017-09-18T02:58:54.663+0000","up_votes":1,"down_votes":0,"body":"También tuve bajones de Fps.\nCreo que algo deberían hacer, los Fps me bajan a 30 incluso.\nTengo todos mis Drivers al día, es muy molesto, mas en las Tf {{sticker:slayer-jinx-unamused}}","replies":[]}]}