{"poster":"Chicken4dinner","date":"2015-04-02T13:13:49.430+0000","title":"How do I play j4? for god sakes, someone help me plz","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":0,"body":"last game in urf I went 3/14 as j4...\r\nidk how to build him\r\nidk his role\r\nidk what to skill\r\nidk how to engage as him\r\nidk anything...\r\n\r\n\r\n\r\nLast game I was so mad that I ripped my mouse cord out of the mouse... by accident but I was doing it angry\r\nhelp me plz?","replies":[{"poster":"BeyondPlay","date":"2015-04-05T05:50:37.634+0000","up_votes":1,"down_votes":0,"body":"Build him full AP and spam e. Works a treat","replies":[]},{"poster":"Lord Kylar Alice","date":"2015-04-04T07:32:21.201+0000","up_votes":1,"down_votes":0,"body":"Since it's URF you can just build full AD and spam E-Q whenever someone comes near you then W and R whenever you feel like. At full build you should be nuking people then just dashing out since your E-Q is like 2.5s cd.\n\nMax Q-E-R-W.","replies":[]},{"poster":"Homura Akemi","date":"2015-04-02T14:28:23.788+0000","up_votes":1,"down_votes":0,"body":"i feel the strong baits.","replies":[]},{"poster":"WeakboyLuvLadies","date":"2015-04-03T23:21:41.103+0000","up_votes":1,"down_votes":1,"body":"I main Jarvan as my jungle in normal modes, I must say though he is absolutely crap in URF. If you want to play him to his full potential you should stick with normal games. In URF those with \"Flashing\" or\"Blinking\" abilities dominate the mode so naturally Jarvan's E-Q combo is deemed to be somewhat slow.\n\nIn normal games Jarvan is mainly played as either Jungle or Top lane. A very fun build to go is Jarvan Armor Penetration top, as he scales into late game with Armor Penetration. Keep in mind this makes him a class cannon, so it's better for more experienced players. For a more safe top lane, go with your usual tanky bruiser top. In terms of jungling the safest route is to  build tank while Maxing your E or Q (Q gives you good damage but E gives your more survivability).\n\nI know this is a short answer to a big question so if you need further explanation into the play style of Jarvan just message me ob the board.","replies":[]}]}