{"poster":"Chicken4dinner","date":"2015-07-29T08:28:22.753+0000","title":"So 2 poeple fought over mid like you see in any typical game","subforum":"Gameplay & Strategy","up_votes":3,"down_votes":0,"body":"And I have the 5 min wait time because I don&#039;t want my game ruined by an ap kogmaw, who even knew he didn&#039;t get mid was going to go there anyway (Our varus wouldn&#039;t budge, the other mid).\n\nIt&#039;s like when someone misspells a lane and someone else calls it with the correct spelling and tells the other guy he didn&#039;t call any lane (because of the misspell).\n\nPls ffs let us have legal que jumps\n\nEDIT: it happened immediately after because someone was premade and thought they had royalty rights over me. 8th game with a troll, didn't want to leave for a 15 min wait","replies":[{"poster":"Filthy Zed Main","date":"2015-07-30T00:01:36.120+0000","up_votes":2,"down_votes":0,"body":"Apart from the usual \"5 mins is nothing\", don't just dodge the game  because somebody doesn't fit the meta or there's going to be 2 mid laners. Work around them and you'll have a much better time, what do you know, they could both play extremely well and you flog the enemy team. A lot of people don't know how to handle against a duo mid lane.","replies":[]},{"poster":"McRuthless","date":"2015-07-29T11:58:27.498+0000","up_votes":2,"down_votes":0,"body":"5 minutes is nothing. If you could dodge any more easily people like the ones you're complaining about would be constantly dodging until they get their role and it'd take you even longer to get into a game.","replies":[{"poster":"Chicken4dinner","date":"2015-07-29T12:17:07.343+0000","up_votes":1,"down_votes":0,"body":"I am talking about a system that starts a vote for champ select to be disbanded","replies":[{"poster":"FraggingBard","date":"2015-07-30T13:51:08.784+0000","up_votes":1,"down_votes":0,"body":"Why? Kayle Jungle sounds ridiculous, but it's kind of nuts. Veigar support sounded ridiculous, but it was retardedly OP; likely why his stun got hit so hard. Just because you haven't tried it or seen it doesn't mean it won't work.","replies":[]}]}]},{"poster":"Strat","date":"2015-07-29T08:41:43.577+0000","up_votes":2,"down_votes":0,"body":"Queue jump punishments are extremely lenient at the moment. You're literally whining about nothing. Go make a cup of tea, 5 minutes is no big deal. Even the 30 minute timer is whatever.\n\nIn the past dodge timers were longer AND you lost Elo (as in, you lost the equivalent of hidden MMR) instead of LP. Right now the only REAL thing you lose is a few minutes of your time.","replies":[{"poster":"Tele","date":"2015-07-29T08:54:20.225+0000","up_votes":2,"down_votes":0,"body":"Almost certain he's talking about normals. In ranked we have pick order to settle disputes like this.","replies":[{"poster":"Strat","date":"2015-07-29T09:20:40.982+0000","up_votes":1,"down_votes":0,"body":"Oh, fair nuff. I dunno, I don't see why someone would play blind pick unless they have 3+ friends who can queue together and let the remaining 2 have whatever roles they want.","replies":[{"poster":"FraggingBard","date":"2015-07-30T13:45:53.297+0000","up_votes":1,"down_votes":0,"body":"You can get away with not playing pure meta in blind pick which makes it more entertaining than ranked where the community is _still_ very rigid. Not that I think AS/AD Veigar is a good idea (never has been, still isn't) in any gamemode but AP Kog bot is fine.","replies":[{"poster":"Chicken4dinner","date":"2015-07-31T12:59:59.349+0000","up_votes":1,"down_votes":0,"body":"They were going to rage, troll, flame and feed\n\nIt has happened before","replies":[]}]}]}]}]},{"poster":"CIG Voracious","date":"2015-07-29T13:42:36.516+0000","up_votes":1,"down_votes":0,"body":"5 minutes is nothing. I have low-prio from the black screen error for 7 more games. It's a 20 minute wait. =.= 7 * 20 = 140. Literally will have to spend 2 and a half hours waiting to just be able to que.","replies":[{"poster":"Chicken4dinner","date":"2015-07-29T21:39:50.050+0000","up_votes":1,"down_votes":0,"body":"I'll rephrase so everyone stops focusing on the punishment (which I really don't care about) but instead give attention to the problem of assholes who always want their way and will punish you if you don't give it to them. So I ask for a legal que jump based on a voting system because I don't want my game ruined and it sucks that I have to be punished for saving my team from a bad game, doesn't matter what the punishment is.","replies":[{"poster":"FraggingBard","date":"2015-07-30T13:49:52.697+0000","up_votes":1,"down_votes":0,"body":"Why does everyone have to play your version of meta? Come play Dota some time, we'll go tri lanes, duo mid, duo jungle, whatever the hell we feel like. If it works, we'll do it again, if it doesn't work, we make a mental note to ignore anything that person says in the future and share the replay around.\n\nIf someone wants duo mid then make mid a kill lane. Take Quinn bot since that's one of the best solo AD's ever, any old reasonable top, and a jungle. Between Varus and Kog there's enough damage there to kill tanks and bruisers just about instantly so all you need to do is prioritise around squishies. Xin or Kha jungle and have fun.\n\nIt's viable, I've done it, not with those champions but there's no real reason it won't work.\n\nYour game isn't ruined because no-one else will do what you demand, it's improved. Now take that attitude and chill a little; you'll win a lot more and might actually end up enjoying yourself.","replies":[{"poster":"Chicken4dinner","date":"2015-07-31T13:03:10.794+0000","up_votes":1,"down_votes":0,"body":"You don't even know what you are talking about, you can do that shit. I have had adc yas players and it's all g... But no you are making a \"valid\" point and I'm the one who needs an attitude check...\n\nWhen I complain about two asses who will starve themselves out competing for farm, will feed with no synergy and then will ff at 20\n\nDuo jg op (shaco evelyn), I know off meta picks work (which are stigmatized because no one simply thought of them). ","replies":[]}]}]}]},{"poster":"LUPIN lll","date":"2015-07-31T02:00:55.419+0000","up_votes":1,"down_votes":0,"body":"In normies, the rules are honestly dictated by the players. WE WILL REPORT YOU IF YOU DO NOT FOLLOW META|!!!!!1!!!11!!11!!1!11111!!!!!!!11!!ELEVEN!!1!1!!!!\n\nIf you want ~relatively~ troll free games, go team builder. Too bad no one uses it, so looks like you're stuck in normies rift with us.","replies":[]},{"poster":"TechnoFlame","date":"2015-07-30T04:15:22.630+0000","up_votes":1,"down_votes":0,"body":"if you guys want a damn lane go to team builder","replies":[{"poster":"Chicken4dinner","date":"2015-07-30T09:59:43.702+0000","up_votes":1,"down_votes":0,"body":"I am but no one else plays teambuilder\n\nAnd I wasn't complaining lmao","replies":[]}]},{"poster":"DiamondAries","date":"2015-07-30T00:32:01.727+0000","up_votes":1,"down_votes":0,"body":"Dude they're everywhere. People whinge and bitch and complain because they want \"their lane\". \n\nHonestly, why do people even want one lane? Is it because they are so bad at the game and only know one lane? If that is the case then moments you don't get your lane are perfect for you to learn. It doesn't matter if you are bad at it, and if you argue that ranked games matter THEN WHY THE HELL ARE YOU PLAYING RANKED WHEN YOU DON'T KNOW HOW TO PLAY MORE THAN ONE LANE! Please for the sake of the community can people not give a damn about what lane they're in. Like me. Half the time I don't call and take whatever's left, which is usually support but I don't care. I even think supporting is fun. Sometimes it jungle, sometimes it's ADC. Whatever it is  I DON'T CARE I just get on with it and I play. Sometimes I do call, often I lose. So I deal with it and pick another role. Even if I'm bad at it I pick another role. \n\nIf you want to play a role so bad you are willing to be a troll and ruin the experience for everyone just because you want to be an inconsiderate asshole, then queue up in team builder, where you are 100% guaranteed to get the role and even the champ you want.\n\nOkay rant over. Please comment below how I am a rage child.","replies":[{"poster":"Lilja","date":"2015-07-30T02:16:06.226+0000","up_votes":1,"down_votes":0,"body":"Since its a 5 min timer I'm going to assume it was a normal game. And while it would be nice to have some form of structure to the queue itself, I commend Riot for not enforcing something like that. All I'm going to say further is that the other team has just as many of these problems as you do, you just dont notice them as much.","replies":[{"poster":"DiamondAries","date":"2015-07-30T03:42:25.778+0000","up_votes":1,"down_votes":0,"body":"I knew it was a normal queue, and it it common sense that the people on the other team have the same chance as having the same problem as our team, but the fact remains the people do it. I want to know why, and the quicker I do the quicker I stop assuming that the players that \"fight for their lane\" are just actually retards that have absolutely no consideration for other people.","replies":[]}]}]}]}