{"poster":"MrHeash","date":"2017-11-01T23:35:27.582+0000","title":"Bei Report: lohnt es sich etwas zu schreiben?","subforum":"Spielerverhalten & Moderation","up_votes":4,"down_votes":0,"body":"Hallo Beschw&ouml;rer,\r\n\r\nwie ihr sicherlich wisst gibt es die Funktion, Mitspieler nach einem Spiel zu reporten und dar&uuml;ber hinaus auch noch etwas zu schreiben. Nun meine Frage: Schreibt ihr bei reports etwas dazu? Bringt es &uuml;berhaupt etwas? \r\nIch reporte relativ selten Person, und wenn, dann schreibe ich immer etwas dazu, wie z.b. &quot;highly negative from the very beginning&quot;, &quot;spend more time blameing his teammates than actually playing&quot;. Wie handhabt ihr das?\r\n\r\nVielen dank f&uuml;r eure Antworten im voraus - man sieht sich in der Kluft!","replies":[{"poster":"Qbert","date":"2017-11-02T06:06:15.835+0000","up_votes":2,"down_votes":0,"body":"Ich kann mir vorstellen, dass es in erster Instanz nichts bringt.\nAber spätestens beim 2. Hinschauen durch eine Person hilft es. Wann dort jedoch persönlich jemand drüber schaut ist mir nicht bekannt.\nIch kann mir aber vorstellen, dass es dabei helfen kann, Report-Situationen klarer für die Prüfung zu machen.","replies":[{"poster":"Allerbester Biss","date":"2017-11-02T10:13:36.213+0000","up_votes":1,"down_votes":1,"body":"Mmh ich geb dir teils recht: Beim ersten Hinschauen bringt es in der Tat nichts da ein Programm dies vermutlich nicht versteht.\n\nBeim zweiten Hinschauen kann durchaus aber passieren, dass eine Person es durchließt.\n\nProblem ist nur: Es gibt kein zweites Mal :)","replies":[{"poster":"eingew","date":"2017-11-03T10:04:59.130+0000","up_votes":1,"down_votes":0,"body":"Du glaubst, dass Riot die Bans per se nicht überprüft?\n\nNun, laut eigener Aussage ist das nicht der Fall, es gibt sowohl regelmäßige Stichproben, als auch die Überprüfung von auffälligen Spielern, die dennoch keine Strafen erhalten. Alles laut Aussage von Riot selbst natürlich.","replies":[{"poster":"Allerbester Biss","date":"2017-11-03T17:53:48.796+0000","up_votes":1,"down_votes":0,"body":"Aber da müssen wirklich SEHR viele Reports reingegangen sein","replies":[]}]}]}]},{"poster":"BlackAjani","date":"2017-11-02T08:17:52.447+0000","up_votes":3,"down_votes":1,"body":"Also ich schreibe beispielsweise bei einem, der viel beleidigt hat, wo er das getan hat CS, ingame oder in der Spielzusammenfassung. Dann vllt noch was er so geschrieben hat. Die 30 Sekunden gönn ich mir meistens","replies":[]},{"poster":"Sirrkas","date":"2017-11-01T23:38:18.153+0000","up_votes":5,"down_votes":4,"body":"Es schadet auf jeden Fall nicht, etwas rein zu schreiben. Im Zweifel lässt sich damit zumindest erkennen, was jemanden gestört hat und das System kann daran angepasst werden, was man meldet. Es lernt sogar selbstständig. Ob es die Felder der Reportfunktion dafür nutzt, kann aber keiner sagen. Riot hält sich mit Infos eher bedeckt. \n\nIm schlimmsten Fall, kann es aber mal einem Riotmitarbeiter helfen, wenn ein Spieler immer wieder gemeldet aber vom System nicht bestraft wird. Damit kann der dann leichter erkennen, was die Spieler an diesem Spieler gestört hat.","replies":[{"poster":"MrHeash","date":"2017-11-01T23:42:16.659+0000","up_votes":1,"down_votes":0,"body":"Danke für die fixe Antwort. Ich hatte mir erhofft, dass ihr Leute mit den grünen Namen nähere Informationen hättet, aber wenn Riot sich das bedeckt hält, soll es wohl so sein^^","replies":[{"poster":"Sirrkas","date":"2017-11-01T23:52:34.590+0000","up_votes":5,"down_votes":4,"body":"Tut mir leid, da gibt es leider nichts was ich darüber weiß. Es wird geloggt. \n\nVielleicht lernt das Programm auch aus den Beschreibungen, welche Wörter schlimm sind, vielleicht hilft es nur, wenn ein Mitarbeiter drüber sieht.","replies":[{"poster":"eingew","date":"2017-11-02T07:01:31.345+0000","up_votes":1,"down_votes":1,"body":"Das bezweifle ich allerdings. Vermutlich prüft die Chatanalyse die Reportboxen überhaupt nicht.","replies":[{"poster":"Sirrkas","date":"2017-11-02T09:09:49.743+0000","up_votes":1,"down_votes":1,"body":"Deswegen schrieb ich auch vielleicht. Es gibt keine sicheren Informationen dazu, aber es ist möglich.","replies":[{"poster":"CYPHΕR","date":"2017-11-02T11:28:02.902+0000","up_votes":1,"down_votes":0,"body":"Es hieß doch mal von Riot selber, dass man bei Reports eigentlich immer etwas dazu schreiben sollte. Es ginge grundsätzlich um die bereits genannten Fälle, in denen ein Spieler regelmäßig reportet, aber dennoch keine Strafe vom System ausgelöst wird.","replies":[{"poster":"eingew","date":"2017-11-03T10:02:15.900+0000","up_votes":1,"down_votes":0,"body":"Richtig. Die Boxen werden dann von Riot gelesen um herauszufinden, was das System dort genau nicht erkennt und inwiefern man dem System dabei manuell auf die Sprünge helfen kann oder ob man vielleicht sogar manuell einen Ban aussprechen muss. Da das theoretisch bei jedem Report der Fall sein kann macht es natürlich Sinn, die Box möglichst häufig zu benutzen, je weniger offensichtlich das Fehlverhalten (für andere) ist, desto notwendiger ist eine hilfreiche Beschreibung in der Box.","replies":[]}]}]}]}]}]}]},{"poster":"Arammus","date":"2017-11-03T20:57:10.872+0000","up_votes":1,"down_votes":0,"body":"ich habe mal VOR JAHREN gelesen das riot sehr gern eine zeit hat wo jemand gefeedet oder geflamed hat. ich denke einfach zum selber zeit sparen. wenn sie auch jemanden auf feeden überprüfen der z.b nur 2mal bewusst gestorben ist (das aber in der schlechtesten situation fürs team) dann ist das für riot bei nem 40 min game halt nervig.\n\nda wir ja HAUPTSÄCHLICH n automatisches chat system haben gehe ich davon aus das es meistens nichts bringt","replies":[]},{"poster":"Noxempire","date":"2017-11-02T13:04:12.618+0000","up_votes":1,"down_votes":0,"body":"Ich frag mich eher, ob man für eine Reportbox bestraft werden kann, wenn man in ihr selbst beleidigend wird.","replies":[{"poster":"eingew","date":"2017-11-03T10:04:16.662+0000","up_votes":1,"down_votes":0,"body":"Davon habe ich noch nie gehört und das wird Riot vermutlich auch in Zukunft nicht tun.","replies":[]},{"poster":"MrHeash","date":"2017-11-02T19:44:42.369+0000","up_votes":1,"down_votes":0,"body":"Das wäre Bitter, aber kann mir gut vorstellen, dass der ein oder andere seine Wut in der Reportbox auslässt {{sticker:darius-angry}}","replies":[]}]}]}