{"poster":"OG ScryTv","date":"2018-04-17T16:13:22.483+0000","title":"Soll eine 3. Bann Stufe eingeführt werden?","subforum":"Spielerverhalten & Moderation","up_votes":5,"down_votes":15,"body":"Hallo erstmal,\r\nIch sa&szlig; neulich so da und hatte die Idee das vielleicht eine 3. Bann Stufe eingef&uuml;hrt werden sollte.\r\nAktuell haben wir ja was toxisches Verhalten angeht 2 Stufen des Banns\r\n- 2 Wochen Bann\r\n- Permanenter Bann\r\n\r\nGenerell ist ja die 1. Sperre daf&uuml;r da um den Spieler auf die Fehler hinzuweisen, aber wenn man mal ehrlich ist\r\nbei fast allen Leuten welche diese 1. Strafe erhalten folgt auch eine 2. einfach weil 2 Wochen als Zeitraum nicht gen&uuml;gen.\r\nWie w&auml;re es wenn man noch eine 3. Sperre zwischen 2 Wochen und Permanent hinzuf&uuml;gt z.B. 1 Jahr welche dann die Spieler\r\nbereits zwingt einen neuen Account zu erstellen, und ihnen gen&uuml;gent Zeit gibt &uuml;ber ihre Fehler nachzudenken. Da die Spieler\r\nvermutlich nicht f&uuml;r 1 Jahr auf League verziechten werden werden sie sich mit einer hohen Wahrscheinlichkeit einen neuen\r\nAccount erstellen und somit sich gleich eine Positive Attitude angew&ouml;hnen k&ouml;nnen.\r\n\r\nAuf diese Idee gekommen bin ich in dem Zusammenhang das viele vor allem junge Spieler welche noch in der Entwicklung\r\nstecken gesperrt werden und diese das vermutlich nicht einsehen werden. Aber nach einem Jahr, oder lass es 2 Jahre sein k&ouml;nnte man solche Spieler wieder Entbannen und ich w&uuml;rde start vermuten das sie was gelernt haben. Und wenn nicht bannt man sie halt danach Permanent!\r\n\r\nStimmt doch am besten in der Umfrage die hier angef&uuml;gt ist ab!\r\nDanke f&uuml;r eure Aufmerksamkeit &lt;3","replies":[{"poster":"eingew","date":"2018-04-17T16:24:09.108+0000","up_votes":6,"down_votes":0,"body":"Das Problem, warum Spieler nach dem zweiwöchigen Ban sich nicht weiter bessern, dürfte weniger in der Anzahl der Strafen liegen (von denen es ja durchaus einmal mehr Abstufungen gab), sondern viel mehr daran, dass sich die meisten Spieler, die zwei Ermahnungen nötig haben eher auch noch eine dritte und vierte holen werden. Ob du das jetzt auf die Möglichkeit einer fünften erhöhst oder nicht wird denke ich nicht viel ändern.\n\nDazu kommt, dass man sich, sofern man nicht gleich sehr direkt wird, sich über lange Zeit negatives Verhalten angewöhnen kann, bei dem es lange dauert, bis es das Fass zum überlaufen bringt und zur ersten Strafstufe kommt. Die Strafstufen danach kommen aber im Vergleich *viel* schneller und nicht jeder ist in der Lage, sich dann in kurzer Zeit am Riemen zu reißen.\n\nUnd dann kommt natürlich noch dazu, dass ein ganzes Jahr in LoL eine absurd lange Zeit ist. Die Spieler werden damit entweder League komplett schmeißen oder ihre Smurfs auspacken. Nur ob sie je auf den Main zurückkommen ist fraglich, zumal ja auch einige das mit der von dir vorgeschlagenen Übung auf dem Smurf eher als Bannsammlung nutzen. Ein Jahr ist irgendwo so... unverhältnismäßig und seltsam.","replies":[{"poster":"RM Heartmeander","date":"2018-04-17T17:54:16.596+0000","up_votes":1,"down_votes":0,"body":"Da würde es wohl mehr Sinn machen nach der ersten CR einen 7 Tagesbann zu machen.\nIrgendwie habe ich das Gefühl, dass die CR von den Leuten nicht so beachtet werden bzw. wahrgenommen.\nWäre zumindest einmal einen Versuch wert.\nDazu müsste aber denke ich auch die erste Strafe schneller triggern, damit so ein Verhalten nicht über Monate wenn nicht Jahre angeeignet wird.\nIch denke nämlich dass eine Chateinschränkung nicht wirklich ne Bestrafung ist (wenn man sich daran erinnert vor ein paar Seasons wo man 1k+ Spiele ne CR haben konnte und man daher eher reagiert wenn man einen 7 Tagesbann hat.\nWeil vom 14 zum Perma geht es ja sehr schnell und manche kapieren das nicht.\nVielleicht kapieren sie es aber, wenn man erst 7 Tage gebannt ist anstatt ne 2te CR und wenn nicht kommt halt der 14 Tage und danach eben Perma.\n\nUnd evtl. sollte man einen alternativen Text haben bei nem 2 Wochenbann, falls man Strafstufen übersprungen hat (fall dies noch nicht so ist).\nDamit weiss die Person, sie hat gleich 1 oder 2 Strafstufen übersprungen wegen ihrem Verhalten streng bestraft wurde.","replies":[{"poster":"eingew","date":"2018-04-18T04:18:48.233+0000","up_votes":2,"down_votes":0,"body":"Ich glaube nicht, dass ein siebentägiger Ban besser ist als 25 Spiele CR. Im Gegenteil halte ich von Zeitbanns eigentlich generell wenig, sie sind keine Aufgabe, die gelöst werden muss und kein Spiel, was gespielt werden muss. Einen Bann muss man bloß absitzen, sonst nichts. Ich sehe da keinen Lerneffekt, nicht wie bei der letzten Strafe vor dem permanenten Ban, bei dem sich die Benachrichtigung übrigens bereits jetzt unterscheidet und deutlich macht, dass jedes weitere Vergehen zu einem permanenten Ban führen kann und wird.\n\nDurchaus ist auch eine Chateinschränkung eine Bestrafung. Ganz im Gegenteil zu diesen unsinnig hohen Mengen an CRs. Diese sind dann keine Strafe mehr, sondern der Normalzustand. Die Betroffenen haben nicht mehr das Gefühl, sich aus diesen Mengen befreien zu können, *egal* was sie tun. Das hat nicht selten sogar dazu geführt, dass Spieler ins Forum gekommen sind und mit der schier unermesslichen Anzahl ihrer CRs geprahlt haben, ähnlich wie noch heute Spieler mit der Anzahl ihrer permanent gebannten Accounts prahlen. Die Argumentation, das härtere Strafen her müssten, halte ich für sinnlos. Damit kommen wir nicht weiter. Alles, was wir brauchen, sind konsequenter verteilte Strafen, die viel früher greifen.","replies":[{"poster":"RM Heartmeander","date":"2018-04-29T09:53:03.693+0000","up_votes":1,"down_votes":0,"body":"Das habe ich ja auch geschrieben.\nDie Strafen müssen schneller triggern, damit sich die Leute so ein Verhalten nicht aneignen.\nIch seh das halt so:\nEine Chatrestriction schränkt einen nicht wirklich ein und kann ignoriert werden, da man immernoch spielen kann.\nEin Bann, der einen nicht spielen lässt ist mMn schlimmer und das merkt man auch mehr.\n\nWas vielleicht auch möglich wäre, wäre ein Ausschluss aus den gewerteten Spielen für eine Anzahl Spiele oder Tage, so dass man nur noch Botgames machen kann.","replies":[]}]}]},{"poster":"znshadow","date":"2018-04-18T03:13:12.478+0000","up_votes":1,"down_votes":2,"body":"Hallo,\nich denke ehr das es da eine gewisse Inkonsequenz gibt.\n\nIch möchte das mal an 3 Beispielen veranschaulichen:\n\nEin Gegner schreibt nach dem Spie \"EZ\" !\nIch Reporte  diesen und was dann? Ich bekomme kein Feedback das etwas passiert ist.\n\nEin Mitspieler schreibt \"Kill your self\"\nIch Reporte diesen und wenn ich Glück habe bekomme ich dann irgendwann eine Meldung das einer meier Reports zu einer Strafe geführt hat.\nAber die frage stellt sich mir welcher Report hat nun zu was geführt?\n\nEin Mitspieler schreibt schlimmes über meine Familie.\nReport erstellt, Support Ticket aufgemacht!\nKeine Hilfe und der Seelische Seitenhieb bleibt.\n\nResümee:\nReports helfen nicht weiter! Denn ohne die Information das Gamer XY für Vergehen ABC bestraft worden ist\nder fade Geschmack im Mund bestehen.\n\nIch plädiere daher für einen Pranger!\n\nkontrovers .....\n\nZN\n;)","replies":[{"poster":"eingew","date":"2018-04-18T04:08:19.167+0000","up_votes":2,"down_votes":0,"body":"Die \"Inkonsequenz\", wie du sie wahrnimmst, liegt daran, dass diese Meldungen zufällig und nur selten nach einem Report auftauchen, der zu einer Strafe geführt hat. Der Rückschluss, im Umkehrschluss würden alle Meldungen, die keine Rückmeldung ausgelöst haben, nicht zu einer Strafe geführt haben, ist unlogisch. Es gibt in LoL nicht erst Strafen, seit es Rückmeldungen zu Reports gibt.","replies":[]}]}]},{"poster":"Nycaria","date":"2018-04-17T16:18:39.489+0000","up_votes":5,"down_votes":0,"body":"Vollkommen unnötig mMn. Bevor es zum Permabann kommt kriegen die Spieler 3 Verwarnungen (die wenigen Ausnahmen, die direkt den 2 Wochen Bann kassieren mal ausgenommen), 2 Chatsperren und den 2 Wochen Bann, und das sollte eigentlich ausreichen.","replies":[]},{"poster":"legofreak1","date":"2018-04-17T16:20:27.479+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=OG ScryTv,realm=EUW,application-id=KYnfKGf0,discussion-id=eE6b7qg3,comment-id=,timestamp=2018-04-17T16:13:22.483+0000)\n>\n> Generell ist ja die 1. Sperre dafür da um den Spieler auf die Fehler hinzuweisen, aber wenn man mal ehrlich ist\n\nDiesen Zweck erfüllen die CR, welche normalerweise vor einem Ban als Strafe ausgesprochen werden. Der 14 Tage Ban ist die letzte Warnung und bereits die 3. Strafstufe im System. Frühere Experimente haben gezeigt, dass der 14 Tage Bann die effektivste Methode ist, um die letzte Warnung als solche rüberzubringen. Der Großteil der Spieler, welche es danach nicht verstanden haben, werden auch nach weiteren Bans ihr Verhalten nicht ändern. Und für den sehr geringen Teil, der es tatsächlich schaffen könnte, lohnt sich das wirtschaftliche Risiko nicht, da Flamer Einnahmeeinbußen für Riot verursachen.","replies":[]},{"poster":"Enderized","date":"2018-04-17T16:45:30.922+0000","up_votes":2,"down_votes":0,"body":"> DIE STRAFEN HÄNGEN FÜR GEWÖHNLICH VON DER JEWEILIGEN ESKALATIONSSTUFE AB:\n> Erster Verstoß: Chateinschränkungen für 10 Spiele\n> Zweiter Verstoß: Chateinschränkungen für 25 Spiele\n> Dritter Verstoß: Zweiwöchige Sperrung\n> Vierter Verstoß: Dauerhafte Sperrung\n> Allerdings kann es je nach Schwere des Vergehens direkt zu einer zweiwöchigen oder permanenten Sperrung kommen. Exzessives negatives Verhalten kann jederzeit und ohne vorherige Chateinschränkung zu einer zweiwöchigen oder permanenten Sperrung führen.\n> \n>  [Quelle](https://support.riotgames.com/hc/de/articles/207489286)\n\nEigl. gibt es 4 Stufen der Strafe  ¯\\\\\\_(ツ)_/¯","replies":[]},{"poster":"Doo ","date":"2018-04-18T20:30:41.304+0000","up_votes":1,"down_votes":0,"body":"ID-Bann für alle die jemals gebannt wurden, dann gibt es zwar nur noch eine handvoll LoL-Spieler aber dann macht es vielleicht nochmal Spaß","replies":[]}]}