{"poster":"unPACkbar","date":"2016-03-23T22:40:38.434+0000","title":"verstörendes spiel","subforum":"Allgemeiner Chat","up_votes":1,"down_votes":1,"body":"HeyHo\r\n\r\nMal so ne frage und zwar:\r\nich und 3 kumpels spielten vorhin DynamikQ\r\ndas erste verst&ouml;rende waren die Picks des gegner Teams\r\ntop: teemo\r\nmid: Caitlyn\r\njung: Rengar\r\nbot: Sivir+Urgoth\r\nwir dachten uns ok kann nicht so schwer sein\r\nwir haben uns gett&auml;uscht sie haben uns auseinander genommen wie wenn wir bots w&auml;ren\r\n\r\nwir haben unser m&ouml;glichtes versucht wir dachten im mid/late sind wir st&auml;rker da die ja keine tanks oder sonstiges haben was teamfights starten k&ouml;nnte\r\ndas bl&ouml;de war nach 18 minuten haben sie unsere 3 inhibs zerst&ouml;rt\r\nwir haben noch n bisschen verteidigt und wollten dann bei minute 20 surrendern\r\nso als es minute 20 war stand aufeinmal da :&quot; das gegnerische team hat mit 4:0 f&uuml;r eine aufgabe abgestimmt&quot;\r\n\r\nok lol warum? \r\n\r\nund das ist die frage\r\nes sind 3 theorin entstanden\r\ndie erste :\r\neiner hat aus fun surrender geklicked und die anderen haben nicht gekuckt und haben aus fun auch surrender getippt\r\ndie 2te: es war einfach ne gruppe aus deppen die einfach schei&szlig;e machen\r\ndie 3te und auch die theorie warum ich den thread erstelle:\r\nes waren riot mitarbeiter die stichproben m&auml;&szlig;ig einfach spiele machen um zu schauen ob fremdprogramme benutzt werden oder geflamed wird oder sonstiges\r\nda am schluss im chat von allen 5 von denen nur gg wp kam und sie dann aus dem chat gegangen sind\r\n\r\n\r\n\r\nhattet ihr schon &auml;hnliches? \r\n\r\n\r\n\r\nmfg unPACkbar","replies":[{"poster":"Uranbrennstab","date":"2016-03-24T08:34:01.633+0000","up_votes":1,"down_votes":0,"body":"Nicht ganz. Es gibt eine Art \"Spielmodus\" der sich Bronze bravery nennt. Dazu kann man auf diverse Websites gehen, welche einem dann vorgeben welchen Champion du auf welcher Position, mit welchen Masteries und Itemsbuild spielen sollst. Der Witz ist eben, das es Zufall ist und deswegen AD Support Karthus heraus kommen kann oder Full Manareg Lee Sin Mitte. Du verstehst schon. \n\nDazu sollte man auf der Bronze Elo unterwegs sein, weil dort die Erfolgschancen am größten sind, ebenso wie die Wahrscheinlichkeit geflamt zu werden, was einen Großteil des Witzes ausmacht.","replies":[{"poster":"unPACkbar","date":"2016-03-31T18:31:08.803+0000","up_votes":2,"down_votes":0,"body":"ist ja voll bescheuert :/","replies":[]}]},{"poster":"unPACkbar","date":"2016-03-24T00:06:28.024+0000","up_votes":2,"down_votes":0,"body":"also die wollen einfach die bronze spieler in grund und boden stampfen ?","replies":[]},{"poster":"Megamaexx","date":"2016-03-31T18:36:06.569+0000","up_votes":1,"down_votes":0,"body":"Man hört immer wieder von solchen Trollen, leider. Ich hoffe, dass die Gegner zu fünft waren und niemandem eine Niederlage beschert haben, der die nicht haben wollte","replies":[]},{"poster":"Sirrkas","date":"2016-03-23T23:29:05.005+0000","up_votes":1,"down_votes":0,"body":"Ich glaube am wahrscheinlichsten wäre da eine Gruppe Smurfs, die nach Bronze abgestuft werden will, um da sowas wie Bronzebravery zu spielen. Also Option 2.","replies":[]},{"poster":"unPACkbar","date":"2016-03-23T23:21:45.857+0000","up_votes":1,"down_votes":0,"body":"ja kann sein wie gesagt war nur ne theorie :D","replies":[]},{"poster":"HHaie tabbian","date":"2016-03-23T22:49:47.929+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=unPACkbar,realm=EUW,application-id=YnZkMR0R,discussion-id=kX66U8k2,comment-id=,timestamp=2016-03-23T22:40:38.434+0000)\n> die 3te und auch die theorie warum ich den thread erstelle:\n> es waren riot mitarbeiter die stichproben m&auml;&szlig;ig einfach spiele machen um zu schauen ob fremdprogramme benutzt werden oder geflamed wird oder sonstiges\n\n\nDas wird es garantiert nicht gewesen sein. Meinst du, Riot-Mitarbeiter sind darauf angewiesen, selbst spiele zu spielen, um zu gucken ob geflamed wird? Die können sich direkt jeden Chatverlauf angucken, wenn sie wollten. Allerdings wird das ja automatisch geregelt, von daher brauchen sie dort nicht mehr so viel zu machen.","replies":[]}]}