{"poster":"crayn22","date":"2017-06-20T11:47:56.519+0000","title":"Idee für eine bessere sicherheit des League Of Legends account","subforum":"Allgemeiner Chat","up_votes":2,"down_votes":4,"body":"Also ich h&auml;tte eine Idee den League Of Legends Accounts besser zu sch&uuml;tzen. Und zwar einen Authenticator wo man sich eine App auf sein Handy runterl&auml;dt und immer wenn man sich einloggen m&ouml;chte einen Code vom Authenticator der auf dem Handy angezeigt wird einzugeben auch wenn man &Auml;nderung am Account vornehmen m&ouml;chte muss man den Authenticator nutzen ich vermute sehr das es viele Feiern w&uuml;rden Wenn Sie das Hinzuf&uuml;gen w&uuml;rden weil viele dann Sich sicherer f&uuml;hlen w&uuml;rden mit Ihrem Account nat&uuml;rlich ist das Freiwillig f&uuml;r jeden ob den Authenticator nutzt oder nicht also ich w&uuml;rde das sehr gut finden wenn das hinzugef&uuml;gt wird weil wenn auch sein account gefischt wurde k&ouml;nnen sie denn nicht nutzen weil sie das Handy brauchen.\r\nPs: Ja ich wei&szlig; Grammatik nicht gut aber eigentlich m&uuml;sste man verstehen was ich meine.","replies":[{"poster":"legofreak1","date":"2017-06-20T11:51:07.933+0000","up_votes":2,"down_votes":0,"body":"Phishingwebsites nach Einführen des Updates: \"Solltest du den Authenticator nutzen warte bitte kurz ab und teile uns dann den Code mit, der dir nun an dein Handy geschickt wird.\"\n\nJemand, der auf Phishingwebsites hereinfällt und diesen sein Passwort gibt, wird wahrscheinlich ebenfalls seinen Authenticator Code auf Anfrage bereitstellen.","replies":[{"poster":"crayn22","date":"2017-06-20T11:53:01.294+0000","up_votes":1,"down_votes":0,"body":"Ja gut das stimmt aber Trotzdem würde ein Authenticator mehr sicherheit bringen","replies":[{"poster":"Darkr3sQ","date":"2017-06-21T05:51:17.088+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=crayn22,realm=EUW,application-id=YnZkMR0R,discussion-id=B7JgAtnT,comment-id=00000000,timestamp=2017-06-20T11:53:01.294+0000)\n>\n> Ja gut das stimmt aber Trotzdem würde ein Authenticator mehr sicherheit bringen\n\nGanz ehrlich? ´Die Leute, bei denen das mehr Sicherheit bringen würde sind genau die Leute, die keinen Authenticator benötigen, da sie ohnehin vorsichtig mit ihren Daten umgehen.\nDie Leute, für die so etwas mehr Sicherheit bringen soll, werden entweder dieses Angebot nicht annehmen oder ihren Account trotz Authenticator verlieren, weil sie in den meisten Fällen recht unbeschwert mit ihren Daten umgehen.","replies":[]},{"poster":"Nocì","date":"2017-06-20T13:40:25.585+0000","up_votes":1,"down_votes":0,"body":"Ja er würde mehr Sicherheit geben, wenn andere deinen Account hacken wollen, aber wer tut das? \nFast alle League Accounts die \"gehackt\" sind, wurden gephisht. Weil jemand sich damit anmeldet um gratis RP zu bekommen.\nEr würde höchstens helfen wenn jemand dein Accountnamne und Passwort kennt, welches du eh nicht weitergeben sollst/darfst.","replies":[]}]},{"poster":"Released Ape","date":"2017-06-20T16:33:40.867+0000","up_votes":1,"down_votes":0,"body":"> Jemand, der auf Phishingwebsites hereinfällt und diesen sein Passwort gibt, wird wahrscheinlich ebenfalls seinen Authenticator Code auf Anfrage bereitstellen.\n\nSoweit ich weiß werden die Daten erstmal nur gesammelt, wenn der Code sich alle x Minuten ändert würde es wirklich mehr Sicherheit bringen. Die Leute können mit dem Code gar nichts anfangen, außer jemand sitzt dort in Echtzeit um sich einzuloggen - dann kann er vielleicht 1-2 Spiele darauf machen und das war es auch.\n\nWeiß gar nicht warum man sich dagegen so stark sträubt? Andere große Spielentwickler bieten sowas auch an um den Schutz des Accounts zu erhöhen und daher empfinde ich deine Aussage etwas irreführend.","replies":[{"poster":"legofreak1","date":"2017-06-20T17:06:10.220+0000","up_votes":1,"down_votes":0,"body":"Es sollte möglich sein vollautomatisiert das Passwort eines Accounts zu ändern, entsprechend sollte man auch auf gleiche Weise den Code abfragen und das Passwort dann mit diesem ändern können. Das Prinzip hinter Phishing ändert sich doch nicht, nur weil ein weiterer Parameter abgefragt werden muss.\n\nDie Entwicklung eines solchen Systems muss sich erstmal lohnen. Wenn sich das mit der momentanen App sinnvoll verknüpfen lässt, ist das vermutlich nicht allzu teuer, die Entwicklung einer neuen App wird aber ordentlich Geld kosten. Blizzard zB bietet deren Authenticator auch nicht kostenlos an.","replies":[{"poster":"Released Ape","date":"2017-06-20T23:34:27.720+0000","up_votes":1,"down_votes":0,"body":"In der Kombo mit der Email-Verifikation sollte es nicht vollautomatisiert gehen. Und ich kann auch so sagen das es bei den wenigsten Zeiten eine Echzeit Reaktion gibt.\n\nMan kann die App sogar soweit erweitern das einem angezeigt wird \"Jemand versucht das Passwort zu ändern\" und dann \"Möchten sie zustimmen?\". Dann dürfte es auch den naivsten Menschen klar sein.","replies":[]},{"poster":"Roxãs","date":"2017-06-20T17:51:19.676+0000","up_votes":1,"down_votes":0,"body":"Wo kostet der Authenticator von Blizzard etwas?\nIch selbst habe die App und was das betrifft hatte ich keine Kosten bis dato.\nWie meinst du das?","replies":[{"poster":"legofreak1","date":"2017-06-20T19:54:00.221+0000","up_votes":1,"down_votes":0,"body":"Mein Fehler, ich war gedanklich noch bei den Schlüsselanhängern, die es gab, bevor Smartphones flächendeckend vorhanden waren.","replies":[]}]}]}]}]},{"poster":"sN00Bdogg","date":"2017-06-23T17:01:15.248+0000","up_votes":1,"down_votes":0,"body":"Der Gedanke ist genauso schlecht wie deine Grammatik","replies":[{"poster":"sN00Bdogg","date":"2017-06-24T11:14:03.162+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=sN00Bdogg,realm=EUW,application-id=YnZkMR0R,discussion-id=B7JgAtnT,comment-id=0002,timestamp=2017-06-23T17:01:15.248+0000)\n>\n> Der Gedanke ist genauso schlecht wie deine Grammatik\n\nHabe mir jetzt seit gestern meine Gedanken gemacht,  wozu so etwas gut sein könnte und warum Du dies vorschlägst. \nJetzt weiss ich wozu! \nDu willst Dir Deinen Account boosten lassen,  aber Du vertraust Deinem Smurf-Kumpel nicht; hast Angst er könnte Dein Passwort ändern. Deswegen nochmal die Endabsicherung über DEIN Handy.\n\n{{sticker:slayer-jinx-unamused}} ","replies":[]}]},{"poster":"fokko1023","date":"2017-06-23T17:19:44.464+0000","up_votes":1,"down_votes":0,"body":"naja account änderungen müssen eh per mail bestätigt werden. extra eine app oder so brauchs da nicht","replies":[]},{"poster":"Nycaria","date":"2017-06-20T17:30:29.340+0000","up_votes":1,"down_votes":0,"body":"Man kann auch einfach nicht auf Free Rp/Skin oder was für Seiten es da sonst noch gibt, gehen und ein Passwort nutzen, welches nicht 12345 oder etwas ähnlich unsicheres ist.","replies":[]}]}