{"poster":"Demon Incarnate","date":"2015-11-12T17:13:37.062+0000","title":"Removal Of Twin Shadows, How could you Riot!!!?","subforum":"Miscellaneous","up_votes":1,"down_votes":3,"body":"I&#039;m so upset about this, that was legit my favorite item. But the changes you've made to it have ruined the item completely \"unless your a support that uses mana\"\n\nPlease either give us the option \"ingame\" to choose either twin shadows or frost queens claim. Or revert the change to its original form.\n\ntbh giving us the option of both would probably be best\n\nNeed more convincing? read below.","replies":[{"poster":"Gravelord","date":"2015-11-12T21:25:10.133+0000","up_votes":1,"down_votes":1,"body":"Hey man, So instead of purchasing the same item every game, Riot may be hinting to change it up a little ;) Try a few other things, Test some kits out, See what works well :)","replies":[{"poster":"Demon Incarnate","date":"2015-11-12T21:30:07.021+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Gravelord,realm=OCE,application-id=Ntey9fRZ,discussion-id=EcvEIlkQ,comment-id=0003,timestamp=2015-11-12T21:25:10.133+0000)\n>\n> Hey man, So instead of purchasing the same item every game, Riot may be hinting to change it up a little ;) Try a few other things, Test some kits out, See what works well :)\n\n\n\"Instead of purchasing the same item every game\" bro but that's called a \"build\" or as i call it in this case an \"essential item\"\n\nand anyway its not like i have a choice....\nDid you even read the below?\nNothing even comes close to been able to do what that active does..\n\n{{item:3116}} Means you have to get too close\n{{summoner:2}} Means you cant use {{summoner:14}} \nEven both of them combined couldn't hold a flame to Twin Shadows\n\nThe only thing i can think of to even maybe fill the void is {{item:3170}} + {{item:3116}} with maybe , {{item:3152}} , {{item:3089}} , {{item:3157}} , {{item:3158}} \n\n {{item:3170}} is still less ap than Twin shadows :( guess ill just have to go {{item:3135}} \n\nNa that active ability... nothing will compare to that","replies":[]}]},{"poster":"Demon Incarnate","date":"2015-11-12T20:37:42.177+0000","up_votes":1,"down_votes":0,"body":"Does anyone know where i can see what thoughts they have as to why they changed it?","replies":[]},{"poster":"Demon Incarnate","date":"2015-11-12T18:19:37.958+0000","up_votes":1,"down_votes":2,"body":"Why Riot!!? JUST WHY!!!?\n\nYou have changed my favorite item!!! in such a way that basically makes its un-viable and as such, useless to me.\n\nI main Vlad Mid and Fiddlesticks/Hybrid Shaco Jungle\nMy first or second item would always be Twin Shadows. But with the removal of twin shadows and the merger of its active ability into the new AP Support item Frost Queen's Claim has not only ruined my build for my main champions but just destroyed the game for me as a hole\n\nList of issues i have with change\n\n1) Reduction from 80ap to 50ap\nMaking this item worthless as far as AP damage is concerned.\n2) Removal of Movement speed.\nReduces Jungle Clear time, Engages and Escape potential.\n3) Adding Mana Regen.\nWhat use does a Jungle or Vlad have for Mana Regen? Jungle uses Blue and Vlad does not use mana at all?\n4) Adding Gold on hit, Gold over time\nThe only Viable role this item is now viable for is support.... what use is this on a jungle? who hits a enemy champion maybe once every 3-4 min.. every 2 min is super active or a laning Vlad who's main source of income is CS\n\nI will now go over just some reasons why Twin Shadows \"WAS\"a viable item for my mid Vlad, Hybrid/Ap Shaco, And Jungle Fiddlesticks\n\n1) Vlad suffers from one massive flaw. No Hard CC. The only CC he has is the slow from his \"W\" Pool. But any Vlad player knows using this early or at the wrong time basically puts you on a plate and says... kill me. The same goes for Fiddles Fear, and Shaco's Q. This item aloud me to effectively CC enemies for an engagement or disengagement without using wasting my champions main escape/cc/engage. Now i'm aware that I can still get this active item ability with the new item. But with the negative changes above it makes this item un-viable\n\n2) As Shaco split pushing or about to gank, or Fiddlesticks about to ulti, or Vlad mid about to engage. I don't know how many times I've engaged and all as i do, enemy's come out of the wood work and ruin my day. Warding can only do so much. But Champion seeking ghosts that not only slow, but give vision!!. Gave me the edge I needed to know without a doubt that I was clear to engage without having any un-welcomed guests to my fiddlesticks surprise party. Now as I've already Mention i know i can get this active on the new item, but again with the changes you've done to it. Makes it un-viable\n\nThose are the biggest uses I \"HAD\" for Twin Shadows. Here are briefly some more\n\nBarron and Dragon Securing\nTeam Engages and Disengages\nWhen Team is not Warding Properly\nBlue & Red securing\nFinding and Assassinating Low Health Run Away's\n\nPlease Riot.... Change it back or at least give us the option to chose between the origonal Twin Shadows and Frost Queen's Claim","replies":[]}]}