{"poster":"Sclaus","date":"2020-01-20T13:26:48.197+0000","title":"Le FLEX sono RANKED!!!","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Non apro mai discussioni dove mi lamento e robe varie ma questa volta ne ho fin sopra i capelli per davvero... La vogliamo smettere con questa convinzione per la quale le ranked Flex sono fatte per trollare e/o provare nuovi champs just for fun?!? Beh, ammetto che nessuno ti vieta di provare un nuovo campione ma almeno non partite dal presupposto di avere il diritto di intare una flex solo perchè è flex e non una solo/duo! Esistono le normal per provare nuovi champs o trollare divertendosi, evita di rovinare le partite di altri giocatori che prendono sul serio le flex.\r\nIo personalmente trovo le flex più \"importanti\" rispetto alle solo/duo poichè visto che LoL è un gioco di squadra, il fatto di essere in un team composto da 5 giocatori che si conoscono e sanno come giocare in cooperativa rende l'esperienza del gameplay ancora più appagante e divertente rispetto ad un team composto da estranei dove ognuno fa quello che crede senza spesso non comunicare minimamente con il resto del team. \r\nPer troppe volte durante le champ select mi viene detto \"beh dai è una flex, chissene\".\r\nMi chiedo perchè ci sia questo ideale nella community che affligge le flex. Sono ranked tali e quali le solo/duo. \r\nChi è d'accordo con me? E a chi capita spesso la stessa cosa?","replies":[{"poster":"Gatto Bipolare","date":"2020-01-20T13:41:03.161+0000","up_votes":2,"down_votes":1,"body":"Te la metto giù facile.\nIo posso essere main support iron4 e fare il diamond in flex perchè gioco con 4 challenger, ecco perchè sono considerate normal con ip","replies":[{"poster":"Sclaus","date":"2020-01-20T14:18:11.546+0000","up_votes":1,"down_votes":0,"body":"Io non ne stavo facendo una questione di elo, è proprio la concezione che si ha delle flex che è sbagliata secondo me. Sono snobbate da molti e prese con superficialità, tutto qui.","replies":[{"poster":"Radskal","date":"2020-01-20T14:20:18.584+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=Sclaus,realm=EUW,application-id=MJVj50Jw,discussion-id=3KnKwEzY,comment-id=00000000,timestamp=2020-01-20T14:18:11.546+0000)\n>\n> Io non ne stavo facendo una questione di elo, è proprio la concezione che si ha delle flex che è sbagliata secondo me. Sono snobbate da molti e prese con superficialità, tutto qui.\n\nIn realtà le flex sono le vere ranked, le solo q ormai sono solo una lotteria, una normal con lp, dove un silver può trovarsi platino e un platino silver, ma la gente non lo capisce.\n\nAnche se questa season anche le flex sono una lotteria, visto che già solo da dove inizi cambia il winrate in modo esagerato.","replies":[{"poster":"Sclaus","date":"2020-01-20T15:06:56.940+0000","up_votes":1,"down_votes":0,"body":"Su questo sono d'accordo!","replies":[]}]}]}]},{"poster":"V3LK0ZMAST3R","date":"2020-01-21T07:44:09.460+0000","up_votes":1,"down_votes":0,"body":"Nella teoria il tuo ragionamento é in buona parte corretto,ma nella pratica no. Non si può considerare competitiva una ranked dove si trova il master contro il silver, 5 premade D1 vs 5 gold in solitaria, ecc ecc.. semplicemente le Flex sono quelle ranked dove elemosinare l'elo visto che molto molto più facili per chi tryharda.\nse vuoi avere dei team seri in Flex vai con 4 premade, altrimenti rassegnati che é la modalità per trollare e boostare quella, é nata male dall'inizio","replies":[{"poster":"Sclaus","date":"2020-01-21T10:07:12.926+0000","up_votes":1,"down_votes":0,"body":"Sad but true","replies":[]}]},{"poster":"mangialavandini","date":"2020-01-20T13:55:41.400+0000","up_votes":1,"down_votes":0,"body":"mmmh \n\nsemplicemente perchè non c'è parità di ELO, tutto qui, è una draft dove è possibile ottenere anche dei \"guadagni\".\n\nPersonalmente mi impegno in egual modo ad una Ranked ma con più sciallanza, va da persona a persona\n\nPoi bisogna anche vedere cosa significa per te trollare.\n\nEs: {{champion:35}} TOP AP è troll per te anche se la gioca seriamente pur perdendo?\n\n","replies":[{"poster":"Sclaus","date":"2020-01-20T14:16:51.731+0000","up_votes":1,"down_votes":0,"body":"Per me trollare vuol dire pickare Ezreal giungla e finire il game 1/8 senza nemmeno un gank o un drake e dire \"è lecito durante una flex\". Ecco a cosa mi riferisco.","replies":[]}]}]}