{"poster":"GottEnel","date":"2015-05-07T17:06:31.022+0000","title":"Pflichtleave-Option","subforum":"Hilfe & Support","up_votes":1,"down_votes":17,"body":"Ich habe gerade eben einer dieser tollen LeaverBuster erhalten. Ist ja alles gut und sch&ouml;n aber aber wenn mich meine Mutter zum Essen oder sonstwas ruft, muss ich ja leaven denn ansonsten bekomme ich eine Strafe von meiner Mutter und das ist auch nicht gut.\r\n\r\nDeswegen fordere ich bei der LeaveBuster-Warnung die &quot;Pflichtleave&quot;-Option.\r\nDort soll sich dann die Drittperson die den Leave verursacht hat, mit Hilfe eines Formulares, Grundangabe und Unterschrift f&uuml;r das Versaute Match entschuldigen und falls n&ouml;tig zur Rechenschaft gezogen werden. \r\n\r\nZum Beispiel in dem eine Strafe auf dem Account der st&ouml;renden Person bei mehrmaliger St&ouml;rung erfolgt. \r\nFalls die St&ouml;rperson keinen Besitzt, muss diese einen Betrag (Gutschein) zur Ausgleichung an die Personen bzw deren Accounts die am Match beteiligt waren ableisten. \r\n\r\nIch hoffe, dass ihr euch diese &Uuml;berlegung mal durch den Sch&auml;del gehen lasst und damit diese Ungerechtigkeit beendet.","replies":[{"poster":"e621 Rengar","date":"2015-05-07T17:13:32.270+0000","up_votes":8,"down_votes":0,"body":"Kannst du nicht einfach vorher nachfragen ob es Essen gibt und somit den leave ganz verhindern?","replies":[]},{"poster":"Baisi","date":"2015-05-07T17:15:42.598+0000","up_votes":4,"down_votes":0,"body":"Ich stimme Vergce zu.\n\nBevor man ein Game startet kann man sich auch erkundigen ob man noch genügend Zeit hat ein spiel zu Spielen..","replies":[]},{"poster":"Rkoturdo Ndo","date":"2015-05-07T17:18:58.525+0000","up_votes":3,"down_votes":0,"body":"Heya\nNaja, zum einen gibt es die Toleranzgrenze des Leaverbusters. Das heißt er schlägt erst zu wenn du mehrfach auffällst. Auch ich war schonmal AFK (Wenn auch unfreiwillig), wurde allerdings noch nie bestraft. \nZum anderen kannst du sowas wie das Essen mit der Familie ja supereinfach lösen. Frag einfach deine Mum wann es Essen gibt und schau, ob du davor noch Zeit für ein Spiel hast oder ob es in 15 min essen gibt.\nDiese Toleranz, die du offensichtlich schon aufgebraucht hast ist gedacht für Fälle, in denen die Person wirklich nichts für den DC/ das AFK sein kann.\nEssen mit der Familie zählt da nicht zu, da es anders als ein Stromausfall oder ähnliches geplant werden kann.\nDementsprechend ist es keine Ungerechtigkeit, dass du bestraft wurdest sondern genau das, was das System machen soll, da du offensichtlich wiederhohlt Spiele verlassen hast und somit bis zu neun Leuten eben dieses versaut hast.\n\nMfG Rkoturdo","replies":[]},{"poster":"GummibaumXYZ","date":"2015-05-08T05:53:31.655+0000","up_votes":2,"down_votes":0,"body":"Verstehe ich das richtig, dass im vorliegenden Fall deine Mutter ein Entschuldigungsformular ausfüllen und unterschreiben soll? Und dann noch Geld als Strafe zahlen muss?\nWürde deine Mutter das wirklich machen? Würde es sie daran hindern auf gemeinsames Essen zu verzichten?\nWas passiert, wenn deine Mutter sich weigert? Wirst du dann gleich Permagebannt?\n\nDie \"Ungerechtigkeit\" die du hier schilderst, hat ja eigentlich nichts mit LoL zu tun sondern damit, dass du nicht selbst entscheiden darfst (aufgrund deines Alters), wann du deine Zeit wie verbringst.","replies":[]},{"poster":"xDerGeraet","date":"2015-05-07T17:31:14.170+0000","up_votes":2,"down_votes":0,"body":"Frag deine Mutter wann es zu essen gibt und fang kein Spiel an wenn du eh in 5min essen musst -_-","replies":[]},{"poster":"MeMyselfandBaal","date":"2015-05-08T00:48:59.566+0000","up_votes":1,"down_votes":0,"body":"ganz ehrlich: Jeder Leaver würde einfach dieses Protokoll ausfüllen und sich was einfallen lassen... Wie viele Großmütter kann ein LoL Spieler eigentlich haben?\n\nUnd ganz ehrlich: \"Mutti hat Essen gemacht\" ist keine legitime Ausrede. Meine Mutti hat immer zur selben Uhrzeit essen gemacht, Was wiederum für mich bedeutete: Ich würde 30 Minuten vor diesem Zeitpunkt kein Spiel mehr machen... oder auf ARAM wechseln...\nWenn deine Mutti da flexibler ist... dann frag sie doch um 18:30 wie es mit essen aussieht. Sage ihr, dass du vorher noch gerne ein Spiel machen willst, weil du den ganzen Tag (wegen der Hausaufgaben) nicht dazu kamst, dann macht Mutti vielleicht erst eine Halbe Stunde später das Essen... aber mit Mutti reden, ist natürlich absurd...","replies":[]}]}