{"poster":"EternalNightX","date":"2017-02-18T23:38:47.509+0000","title":"Spamming Report Buttons On Players","subforum":"Player Behaviour","up_votes":3,"down_votes":0,"body":"Heres the problem with this game. Not only do people get pissed off with  riot for making champions way over balance still but the Report Button is been used way to much in games. This game IS NOT fun anymore like it was 2 years ago. I used to play all the time and it was a fun game. But now i dont even want to play it at all and that goes for most of my friends that used to play. Every game that i go in people argue which is normal because not everyone wins a game people lose the game somtimes but then people will always use the report button just to make people even more angry. For instance, my last two games today I lost i was carrying but there were a few people on the enemy team that were already over powered. therefore I could not by myself defeat them because they were too strong for me. Now there was a teammate who was intent and was blaming other people for feeding the enemy champions I just muted him and kept playing but I was also trying to give advice to my teamates on how we can win. Then they all turned on me because of the advice i was giving in a nice manner and told the enemy team to report me because they considerd giving advice to be toxic apparently even though i was just trying to be nice. This made me angry. Every game i get into people will report other people just because they cant even without reason because it it available to them. Players are reported for giving harmless advice or maybe they say somthing ( not in a mean way) that another player doesnt like and for some reason they already are bashing the other player for it and sucks because who wants to play when they are getting threatened with A report that is false and you cant do anything about it?? even when you know you did nothing wrong and you tried your best. This game isnt fun anymore at all. I hardly play it because this game is all about reporting players because they didnt win. This should be fixed to where the only reports you can do is INTENT FEEDING, or VERBAL ABUSE. only those two and the riot company should check chat to make sure that they were actually doing that and arent being penalized for somthing they didnt do just because another player was angry at them. This happens in norms WAY too often and ranked is even worse. Please fix this.\r\n\r\n  - sorry if i may have misspelled i was typing fast.","replies":[{"poster":"Ninox","date":"2017-03-01T05:39:10.890+0000","up_votes":2,"down_votes":0,"body":"Reports mean nothing if they aren't valid. A report is only a flag for the game to be evaluated, at which point your behaviour is looked at. If the report is valid you will face either a punishment or a mark against your account for future reports, if it's invalid, the reporter loses report weight and nothing happens to you.\n\nIf someone is salty and reports you then you only have something to worry about if you've done something wrong.","replies":[]},{"poster":"Luxium","date":"2017-03-01T00:49:15.279+0000","up_votes":1,"down_votes":0,"body":"Yep. I agree. I got banned because of this recently. I was in reform period. Had 1 ban and got reported by the 2 people who i annoyed. Was in urf and I was katarina playing with Ryze and Draven vs Maokai and Twisted Fate. We opened bot because you cant do anything there, went top and did well. But the {{champion:112}} and {{champion:223}} got triggered and started abusing us. I hit back a little bit and got reported by JUST THOSE 2. and got perma banned because of it. So unfair. Trying to appeal to riot and what not but ye know.","replies":[]}]}