{"poster":"kecskebika","date":"2017-03-03T19:00:24.528+0000","title":"Grundlos gebannt.","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":13,"body":"Als ich heute ganz normal eine Runde starten wollte, bekam ich die Meldung, dass mein Konto gesperrt sei.\r\nAls Begr&uuml;ndung war genannt, dass ich Programme von Drittanbietern benutzt habe, was schlicht und ergreifend nicht stimmt.\r\nIch habe bis jetzt nur schlechtes vom Riot Games Support geh&ouml;rt, deshalb kann ich nur hoffen, dass mein Ticket gelesen und bearbeitet wird. Ich finde &uuml;brigens auch, dass sie mich m&ouml;glicherweise kontaktieren sollten, um mir den Verdacht zu &auml;u&szlig;ern, aber ich kann nicht einsehen, f&uuml;r eine Sache bestraft zu werden, die ich nicht einmal getan habe. Ich meine, ich habe auch Geld f&uuml;r dieses Spiel ausgegeben und finde es gelinde ausgedr&uuml;ckt unmoralisch, mir meinen Account einfach so wegzunehmen. Auf jeden Fall werde ich nicht hinnehmen, dass mein Account gebannt ist. Ich habe nichts getan, wof&uuml;r ich bestraft werden k&ouml;nnte. Falls der Verdacht besteht, dass ich so etwas praktiziere, wieso setzt sich der Riot Games Support nicht einfach mit mir in Kontakt und versucht mit mir eine L&ouml;sung zu finden? Ich habe nicht gecheatet und wollte es auch nicht.","replies":[{"poster":"legofreak1","date":"2017-03-03T19:10:46.424+0000","up_votes":5,"down_votes":0,"body":"Um für verbotene Programme gebannt zu werden, musst nicht du selber gespielt haben, es kann auch jmd anderes auf deinem Account gespielt und diese verwendet haben. Ich will darauf hinaus, dass in deinem Spielverlauf 2 kürzliche Spiele herausstechen:\nhttp://matchhistory.euw.leagueoflegends.com/de/#match-details/EUW1/3066817908/226471420?tab=overview\nhttp://matchhistory.euw.leagueoflegends.com/de/#match-details/EUW1/3066763057/226471420?tab=overview\nDu spielst immer mit Flash auf D, diesen beiden Spiele hier ist Flash auf F. Du hast immer so um die 3-4 cs pro Minute, hier bist du bei ca 8 cs pro Minute. Deine KDA ist normalerweise nicht sehr herausragend, hier hast du die Spiele eindeutig gecarried. Hat hier jmd anderes auf deinem Account gespielt?","replies":[{"poster":"kecskebika","date":"2017-03-03T20:09:21.260+0000","up_votes":1,"down_votes":5,"body":"Die beiden Matches waren Ranked, ich glaube es ist normal, dass man da mehr auf Tryhard geht.","replies":[{"poster":"Patter1991","date":"2017-03-03T20:21:53.201+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=kecskebika,realm=EUW,application-id=KYnfKGf0,discussion-id=ApigpvUf,comment-id=00000002,timestamp=2017-03-03T20:09:21.260+0000)\n>\n> Die beiden Matches waren Ranked, ich glaube es ist normal, dass man da mehr auf Tryhard geht.\n\nKomm, so offensichtlich lügen, ernsthaft?\n1. Würdest du tryharden, würdest du erst recht nicht deine Summoners wechseln.\n2. Würdest du tryharden, würdest du konstant in deinen Rankeds so Ergebnisse abliefern. Draven vor 22 Tagen, 4/14/9, 3,3 CS/min, Flash auf D. Die nächsten beiden Dravens, Flash auf F. Unendlich viel bessere KDA. 8 bis 9 CS/min. Übrigens auch bei anderen Spielen NIE so gut.\n\nJetzt hast du auch deine \"ich hab meine Daten eingegeben\"-Story zerstört. Die sowieso seeeeeeeeehr unglaubwürdig war. Du wolltest dich scheinbar boosten lassen.","replies":[{"poster":"kecskebika","date":"2017-03-03T20:27:01.072+0000","up_votes":1,"down_votes":5,"body":"Ich habe es ja nur angemerkt. Weil es generell eben nicht als Argument verwendet werden sollte. Ich habe nichts bestritten.","replies":[]}]},{"poster":"CoopA826","date":"2017-03-03T21:12:21.716+0000","up_votes":1,"down_votes":0,"body":"Und damit wurde jegliche Rest-Glaubwürdigkeit das Klo runtergespült.","replies":[]}]},{"poster":"kecskebika","date":"2017-03-03T19:22:47.373+0000","up_votes":1,"down_votes":4,"body":"Ich habe jetzt bei meinen Freunden nachgefragt, die meinten, dass sie von meinem Account Nachrichten in französischer Sprache erhalten hätten :/{{champion:32}}","replies":[{"poster":"Sirrkas","date":"2017-03-03T19:24:07.744+0000","up_votes":3,"down_votes":0,"body":"Kann es sein, dass du in letzter Zeit Links angeklickt hast, auf denen du dich mit deinem LoL-Account anmelden solltest? Zum Beispiel für angeblich kostenlose RP oder Skins?","replies":[{"poster":"kecskebika","date":"2017-03-03T19:25:55.129+0000","up_votes":1,"down_votes":4,"body":"Ach du scheisse.","replies":[{"poster":"fokko1023","date":"2017-03-03T19:46:25.032+0000","up_votes":1,"down_votes":0,"body":"ändern dein passwort bevor die das tun. und passwort überall ändern wo du es benutzt","replies":[{"poster":"kecskebika","date":"2017-03-03T19:55:09.710+0000","up_votes":1,"down_votes":3,"body":"Ich ändere meine Passwörter grundsätzlich sowieso alle 1-2 Wochen :)","replies":[{"poster":"Martensitic","date":"2017-03-04T13:36:51.273+0000","up_votes":2,"down_votes":1,"body":"https://cdn.meme.am/cache/instances/folder681/61455681.jpg\n\nWeisst du, ich bin zufällig im Bereich IT Security tätig.\nWenn ich 1€ hätte, für jedes mal wo mir jemand diesen Spruch geliefert hat, könnt ich mich zur Ruhe setzen.\n\nUnd zwar auf einer Privatinsel.","replies":[{"poster":"kecskebika","date":"2017-03-04T15:35:54.317+0000","up_votes":1,"down_votes":4,"body":"Wow. Ich habe tatsächlich geschmunzelt. Aber glaubst du das hilft mir weiter?","replies":[{"poster":"Martensitic","date":"2017-03-04T16:46:27.406+0000","up_votes":4,"down_votes":0,"body":"Was willst du hören?\n\nDass du ganz übel und böse gehackt wurdest, von Leuten die in dunklen Räumen vor einer Monitorwand sitzen auf der ganz viele grüne Codezeilen permanent auf- und abwandern?\n\nWeisst du wie selten tatsächliche Hacks (= gezieltes Ausnützen einer Softwareschwachstelle zum tatsächlichen Einbruch in ein fremdes IT System) auf Privatnutzersysteme, zum gezielten Auslesen von Passwörtern im Gamingbereich vorkommen?","replies":[{"poster":"AI Yjuq","date":"2017-03-04T23:17:20.164+0000","up_votes":2,"down_votes":0,"body":"Nun ja, ich für meinen Teil mache sowas ja mal gelegentlich: http://hackertyper.net/\nSag's aber nicht weiter, die Seite ist ein Geheimtipp ;)","replies":[{"poster":"Martensitic","date":"2017-03-05T03:25:14.723+0000","up_votes":1,"down_votes":0,"body":"OMG das ist brilliant!\nBesonders die \"ACCESS GRANTED\" und \"ACCES DENIED\" popups :D\n\nDanke!!!","replies":[]}]},{"poster":"kecskebika","date":"2017-03-04T18:09:07.343+0000","up_votes":1,"down_votes":2,"body":"Ausnutzen*","replies":[]}]}]}]}]}]},{"poster":"kecskebika","date":"2017-03-03T19:26:23.354+0000","up_votes":1,"down_votes":3,"body":"Ja.","replies":[{"poster":"kecskebika","date":"2017-03-03T19:27:11.889+0000","up_votes":1,"down_votes":4,"body":"Wobei ich eigentlich garnicht angegeben hatte, ich war lediglich auf einer Seite, auf der man durch Punkte Skins einfordern könnte.","replies":[{"poster":"Balmung","date":"2017-03-03T19:34:09.418+0000","up_votes":3,"down_votes":0,"body":"\"eigentlich gar nichts\" und \"gar nichts\" sind so...Welten zwischen den Aussagen.\n\nUnd naja...Paradebeispiel für ein Phishingopfer. Den Account wirst du wohl leider nicht wiedersehen, da der Fehler im Umgang mit sensiblen Daten bei dir liegt und der Riotsupport in solchen Fällen nur helfen kann bevor der Bann ausgesprochen ist (sprich wenn es dir auffällt bevor derjenige auf dem Account Spiele spielt).","replies":[{"poster":"kecskebika","date":"2017-03-03T19:38:58.261+0000","up_votes":1,"down_votes":3,"body":"Ich habe mich gewundert und deshalb ,,eigentlich'' geschrieben. Falls du es für nötig hältst, meine Aussagen ins Lächerliche zu ziehe, kannst du das gerne tun :){{sticker:slayer-jinx-wink}}","replies":[{"poster":"Balmung","date":"2017-03-03T19:45:11.225+0000","up_votes":3,"down_votes":0,"body":"Falls es dir nicht bewusst ist:\n\"Ich habe eigentlich nichts angegeben\" ist gleichbedeutend mit \"ich habe etwas angegeben\".\n\"ich habe nichts angegeben\" ist eindeutig.\n\nDas hat wenig mit \"ins lächerliche ziehen\" zu tun. Das ist 'ne simple Tatsache.","replies":[]},{"poster":"Patter1991","date":"2017-03-03T19:42:28.015+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=kecskebika,realm=EUW,application-id=KYnfKGf0,discussion-id=ApigpvUf,comment-id=00000001000000000000000000000000,timestamp=2017-03-03T19:38:58.261+0000)\n>\n> Ich habe mich gewundert und deshalb ,,eigentlich&#x27;&#x27; geschrieben. Falls du es für nötig hältst, meine Aussagen ins Lächerliche zu ziehe, kannst du das gerne tun :){{sticker:slayer-jinx-wink}}\n\nWieso ins Lächerliche? \"Eigentlich...\" sagt immer, dass da doch was war. Wenn du \"eigentlich\" nichts angegeben hast, hast du Dinge angegeben. Du weißt nur entweder nicht mehr, was, oder ob das wichtig ist.","replies":[{"poster":"kecskebika","date":"2017-03-03T19:54:26.487+0000","up_votes":1,"down_votes":5,"body":"Ok, es tut mir Leid, Meister.\nIch habe Keine Daten angegeben.","replies":[{"poster":"Martensitic","date":"2017-03-04T13:33:57.930+0000","up_votes":1,"down_votes":0,"body":"Und du hast auch sicherlich:\n\n* Deinen Browser aktualisiert\n\n* Javascript auf unbekannten Websites deaktiviert\n\n* Deinen Flashplayer aktualisiert\n\n* Bist bei Seiten die kein https verwenden grundsätzlich vorsichtig\n\n* Weisst ohne Wikipedia zu benutzen was https ist\n\n* Einen aktuellen Malware und Virenscanner\n\n* Keine Passwörter im Browser gespeichert\n\n* Verwendest unterschiedliche PWs für alle deine Logins\n\n* Checkst ab und zu auch mal den ARP-Cache deines Rechners\n\nWenn du eine dieser Fragen mit \"Nein\" beantworten musst, dann musst du keine Daten angegeben haben. Die Seite besuchen reicht schon aus.","replies":[{"poster":"kecskebika","date":"2017-03-04T15:34:54.435+0000","up_votes":1,"down_votes":3,"body":"Ja.","replies":[{"poster":"Martensitic","date":"2017-03-04T16:54:49.314+0000","up_votes":2,"down_votes":1,"body":"Sagte der Mensch der weiter oben folgendes postete:\n\n> [{quoted}](name=kecskebika,realm=EUW,application-id=KYnfKGf0,discussion-id=ApigpvUf,comment-id=000000010000000000000000,timestamp=2017-03-03T19:27:11.889+0000)\n>\n> Wobei ich eigentlich garnicht angegeben hatte, ich war lediglich auf einer Seite, auf der man durch Punkte Skins einfordern könnte.","replies":[{"poster":"CYPHΕR","date":"2017-03-08T09:33:01.222+0000","up_votes":1,"down_votes":0,"body":"q.e.d.","replies":[]}]}]}]}]}]}]}]}]}]}]}]}]},{"poster":"kecskebika","date":"2017-03-03T19:15:43.173+0000","up_votes":1,"down_votes":5,"body":"Ehrlich gesagt kenne ich diese Matches nicht, aber da ich gebannt bin, kann ich ja auch nicht nachschauen. \nAber du hast Recht, ich spiele niemals mit Flash auf F {{champion:122}}","replies":[{"poster":"kecskebika","date":"2017-03-03T19:19:40.948+0000","up_votes":1,"down_votes":4,"body":"Aber eigentlich ist mein Passwort absolut sicher und hat mit nichts aus meinem Namen oder meinem Geburtsdatum zu tun, deshalb schliesse ich das aus.","replies":[{"poster":"Martensitic","date":"2017-03-04T13:44:35.905+0000","up_votes":2,"down_votes":0,"body":">Aber **eigentlich ist mein Passwort absolut sicher** und hat mit nichts aus meinem Namen oder meinem Geburtsdatum zu tun, deshalb schliesse ich das aus.\n\nDein Passwort ist also...\n\n* eine komplett zufällige Abfolge\n* aus mindestens 16 Alphanumerischen Zeichen\n* die sowohl gross als auch kleinschreibung beinhaltet\n* mehrere sonderzeichen enthält\n* ohne IRGENDEINEN bezug zu irgendetwas (Kein l33tsp34k, kein letter-ascii, keine smileys, keine eselsbrücke, keine mnemonics, kein GAR NICHTS was irgendwie auch nur hilft es sich zu merken)\n* Keiner wie auch immer gearteten strukturierung folgt\n* idealerweise durch einen physisch geseedeten Zufallsgenerator erzeugt worden\n\nWenn irgendwas in dieser Liste nicht zutrifft, dann ist dein Passwort einiges, aber nicht \"absolut sicher\".\nGanz davon abgesehn dass es \"absolut sicher\" bei Passwörtern nicht gibt.","replies":[{"poster":"kecskebika","date":"2017-03-04T15:33:22.686+0000","up_votes":1,"down_votes":3,"body":"So ist es. Es trifft auf alles zu.","replies":[{"poster":"kecskebika","date":"2017-03-04T15:37:25.802+0000","up_votes":1,"down_votes":2,"body":"Ich kann mir das Passwort nicht merken, es ist extrem lang und ist auf einem Zettel, den ich immer finde. Aber nicht einmal meine Mitbewohner können ihn finden.","replies":[{"poster":"Martensitic","date":"2017-03-04T16:51:18.036+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=kecskebika,realm=EUW,application-id=KYnfKGf0,discussion-id=ApigpvUf,comment-id=000000000000000000000000,timestamp=2017-03-04T15:37:25.802+0000)\n>\n> Ich kann mir das Passwort nicht merken, es ist extrem lang **und ist auf einem Zettel**, den ich immer finde. Aber nicht einmal meine Mitbewohner können ihn finden.\n\n#\"und ist auf einem Zettel\"\n\nhttp://uploads.neatorama.com/images/posts/644/74/74644/1407611779-0.jpg","replies":[{"poster":"CYPHΕR","date":"2017-03-08T09:35:05.908+0000","up_votes":1,"down_votes":0,"body":"Der typische Mitarbeiter der ganz stolz auf sein Passwort ist, es aber auf einem Post-IT am Bildschirm hängen lässt. xD","replies":[{"poster":"Martensitic","date":"2017-03-08T18:23:27.553+0000","up_votes":1,"down_votes":0,"body":"Gibt Firmen, da fliegt man wegen sowas raus, und zwar fristlos.","replies":[]}]}]}]}]}]}]}]}]},{"poster":"Sirrkas","date":"2017-03-03T19:22:59.084+0000","up_votes":2,"down_votes":0,"body":">Ich habe bis jetzt nur schlechtes vom Riot Games Support gehört, deshalb kann ich nur hoffen, dass mein Ticket gelesen und bearbeitet wird. \n\nWenn du damit meinst, dass Permabanns nicht zurückgenommen werden, ja dann ist der Support \"schlecht\". Ich kann verstehen, dass dich der Bann stört und ich würde auch nur ungerne meinen Account verlieren, den ich schon seit mehreren Seasons bespiele. Es ist aber auch nicht praktikabel, alle anzuschreiben und nett zu fragen, ob die Person vielleicht gewahr ist, dass sie unerlaubte Programme genutzt hat. Ich wüsste zumindest nicht, wie das helfen sollte. Die meisten würden das abstreiten und ein paar, die genau wissen, dass sie Scripts haben antworten dann mit \"Entschuldigung mache ich nie wieder\", obwohl sie genau wussten, was sie da tun.\n\nAllerdings untersucht der Support bei einer Beschwerde über einen Bann den Vorfall nochmals, da Riot aber sehr Vorsichtig bei Banns aufgrund von Drittanbietersoftware ist, ist es sehr unwahrscheinlich, dass sie unschuldige Leute bannen. So etwas kommt dennoch manchmal vor, ist aber sehr selten.","replies":[{"poster":"kecskebika","date":"2017-03-03T19:25:04.487+0000","up_votes":1,"down_votes":4,"body":"Ich habe lediglich gesagt, dass ich nur schlechtes vom Support GEHÖRT habe, deshalb verstehe ich deinen Kommentar nicht.","replies":[{"poster":"Humpelstilzche","date":"2017-03-03T19:30:37.141+0000","up_votes":2,"down_votes":0,"body":"Das ist auch normal. Man hört IMMER nur schlechtes über Kundendienste (egal wo), weil Leute denen ganz normal geholfen wurde haben ja nichts zu erzählen^^","replies":[{"poster":"BMW E39 525d","date":"2017-03-04T06:23:05.339+0000","up_votes":1,"down_votes":1,"body":"Genauso wie das man immer nur hört, dass man angeblich immer nur hört der Kundendienst sei schlecht, und dass das nie auf fundierten Tatsachen und Erfahrungen beruht. Es gibt noch ein paar Kundendienste wo ich sage die arbeiten Kundenorientiert und gut, wie z.B. PayPal.\nEin angebliches Märchen mit einem eigenen Märchen zu widerlegen ist halt äußerst fragwürdig.","replies":[{"poster":"Leylania","date":"2017-03-04T06:43:04.153+0000","up_votes":3,"down_votes":0,"body":"So 'märchenhaft' ist das gar nicht. Die meisten Leute sehen einen gut gemachten Service (egal ob Kundensupport oder was anderes) als selbstverständlich an, weshalb sie nicht daran denken positive Dinge darüber zu sagen. Gleichzeitig sind die Leute die meckern immer die die am lautesten plärren, weil sie meinen ihre schlechten Erfahrungen seien die Regel und jeder soll das wissen. Schau dich doch mal bitte hier im Forum um. Wie häufig siehst du da Beiträge die hingehen und z.B. die Community für schöne Erlebnisse und gute Spiele loben? Richtig, fast gar nicht. Und wie häufig siehst du Leute die dir erzählen wie furchtbar alles ist und wie LoL den Bach runter geht? Teilweise im Minutentakt. Trotzdem spielen viele Millionen Leute jeden Tag und ich denke die meisten Leute haben mit Abstand mehr positive Spiele als negative (auch wenn einem das durch einzelne Flamer manchmal anders vorkommen kann).\n\nIch hab mich schon sehr häufig an den Riot Support gewandt wegen Problemen und hab immer innerhalb von kürzester Zeit eine freundliche und gute Antwort bekommen. Gleiches bei anderen Spielen oder z.B. dem Steam Support von dem mir alle Leute erzählt haben wie schrecklich er sei. Der Support von Riot ist einer der fähigsten (und geduldigsten!) Supports überhaupt.","replies":[{"poster":"BMW E39 525d","date":"2017-03-04T06:54:22.073+0000","up_votes":1,"down_votes":0,"body":"Mir ist schon klar, dass da was dran ist. Aber man darf deswegen nicht den Umkehrschluss ziehen und sagen Kundendienste sind deshalb alle gut, weil sie fälschlicherweise oft zu negativ eingeschätzt werden. Mir geht dieses überschwängliche und euphorische einfach auf den Sack, die keinerlei Raum für normale Kritik lässt.\nUnd meine positiven Erfahrungen mit dem Riot Support halten sich auch eher in Grenzen.","replies":[{"poster":"Nohgolgh","date":"2017-03-05T06:25:39.740+0000","up_votes":1,"down_votes":0,"body":">Aber man darf deswegen nicht den Umkehrschluss ziehen und sagen Kundendienste sind deshalb alle gut, weil sie fälschlicherweise oft zu negativ eingeschätzt werden.\n\nWer hat das denn behauptet? Es wurde lediglich eine Erklärung gebracht, warum die schlechten Bereichte den größten Teil der Berichte darstellen. Ich sehe zumindest keine Behauptung, in der davon ausgegangen wird, dass es keinen schlechten Kundenservice gibt. Lediglich das Argument \"man hört die Leute sagen\" (welches per se kein Argument ist, weil es als Beispiel nicht überprüfbar ist), bekommt damit eine Antwort. ","replies":[]}]},{"poster":"kecskebika","date":"2017-03-04T08:19:41.042+0000","up_votes":1,"down_votes":0,"body":"Tut mir Leid, zu diesem Zeitpunkt konnte ich nur davon ausgehen, was mir erzählt wurde.\nJetzt, als ich selber Erfahrungen mit ihm machen musste, muss ich sagen, dass ich den Riot Support extrem freundlich finde.","replies":[]}]}]},{"poster":"kecskebika","date":"2017-03-03T19:31:30.790+0000","up_votes":1,"down_votes":3,"body":"Ich glaube das ist das klügste Zitat aus diesem Forum.","replies":[]}]}]}]}]}