{"poster":"CatSith","date":"2015-08-11T20:37:32.894+0000","title":"@Repertoir/Meddler Is Elise's Neurotoxin level 1 base damage being buff to compensate the 4% nerf?","subforum":"Gameplay","up_votes":2,"down_votes":7,"body":"It makes her Q the weakest poke with a high mana cost at level 1 in league. \n\n- Elise\nNeurotoxin (Human Q) percent of target&#039;s current health reduced to 4% from 8%.\n Level one damage : 40\nMana cost : 80","replies":[{"poster":"Meddler","date":"2015-08-11T21:20:30.217+0000","up_votes":14,"down_votes":1,"body":"We're nerfing the % damage in order to make Elise weaker, because we believe she's far too strong at present. Compensation buffing's not appropriate as a result, since it goes against the goals of the change. Compensation buffing can be the right approach in other contexts (e.g. removing power from a skill with little counterplay, adding it back in to a healthier spell), sometimes though what's needed is just a straight nerf.","replies":[{"poster":"CatSith","date":"2015-08-11T21:37:00.234+0000","up_votes":2,"down_votes":3,"body":"I understand nerfing the % damage is a good step to bring her power curve down, But why is lane Elise being affected because of her jungle power? Its not like I'm suggesting to increase the late game base damage.  Currently its 40/75/110/145/180.  What I'm suggest is 60/85/110/145/180.\n\nhaving such a low damage with a high mana cost for a level 1 spell isn't healthy.","replies":[{"poster":"Abyssphere","date":"2015-08-11T22:16:52.322+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=CatSith,realm=NA,application-id=3ErqAdtq,discussion-id=LwfREET3,comment-id=00030002,timestamp=2015-08-11T21:37:00.234+0000)\n>\n> I understand nerfing the % damage is a good step to bring her power curve down, But why is lane Elise being affected because of her jungle power? Its not like I'm suggesting to increase the late game base damage.  Currently its 40/75/110/145/180.  What I'm suggest is 60/85/110/145/180.\n> \n> having such a low damage with a high mana cost for a level 1 spell isn't healthy.\n\nPersonally I would have reduced its cost. Neurotoxin has such a high cost in the first place because of top lane Elise being too strong in the past, so now that it's weaker they could easily revert that.\n\nThat said I'm not sure Riot WANTS Elise to be viable top. She wasn't considered the healthiest top laner ever by the playerbase.","replies":[{"poster":"Tourian","date":"2015-08-12T00:23:56.731+0000","up_votes":1,"down_votes":0,"body":"Of course they should buff the cost now since the spell is half as good as it was then. But they won't and us Elise mains will have to suffer another half season having  to work twice as hard to do on par with any other jg.","replies":[]}]}]},{"poster":"Miraweave","date":"2015-08-12T17:56:24.430+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=LwfREET3,comment-id=0003,timestamp=2015-08-11T21:20:30.217+0000)\n>\n> We're nerfing the % damage in order to make Elise weaker, because we believe she's far too strong at present. Compensation buffing's not appropriate as a result, since it goes against the goals of the change. Compensation buffing can be the right approach in other contexts (e.g. removing power from a skill with little counterplay, adding it back in to a healthier spell), sometimes though what's needed is just a straight nerf.\n\nIf she became incredibly strong after the last set of buffs you gave her, why not just revert or tone down those buffs instead of nerfing her in other areas?\n\nAs I recall her stun duration was specifically nerfed in s3 when she was way too strong. You guys could probably revert that and maybe lower the healing and she'll probably be ok. Her Q *isn't* what's making her broken right now.","replies":[]},{"poster":"NicknameMy","date":"2015-08-11T21:31:05.303+0000","up_votes":1,"down_votes":5,"body":"His Cocoon seems to be currently have no counterplay as the missle speed is too high, especailly early? Would be a scaling missle speed a nice way to balance her, from 1400/1500 to 1600 depending on Cocoon level?","replies":[{"poster":"Nidalee SO NYAAA","date":"2015-08-11T21:34:38.302+0000","up_votes":4,"down_votes":1,"body":"\"His'!?","replies":[]},{"poster":"Crowe Stalker","date":"2015-08-11T21:36:58.049+0000","up_votes":2,"down_votes":0,"body":"1600 is the Old {{champion:7}} Distortion speed, and scaling speed of projectiles based on level is both weird and makes it so the later the game is, the less counterplay she actually has, which is counterintuitive since her weakness is supposed to be she doesn't scale well. I don't think too many people would mind 1500 missile speed on her Cocoon though.\n\nAlso, I'd like to ask @Meddler , was a Current Health component to her previous Neurotoxin tested? I admit, I don't play Elise much but I did like the concept of her Neurotoxin being a 3 second Damage over Time (you know, actually working like a Toxin) instead of as an upfront burst damage like it is now (which is more like an Acid)","replies":[]},{"poster":"Tourian","date":"2015-08-12T00:30:11.867+0000","up_votes":2,"down_votes":0,"body":"Yeah I saw the lcs match you're passing off as your own idea too, that wasn't the commentators point. The missile is really hard to hit after they needed the width so the speed increase was needed. \"No counterplay\" does not apply here since the spell is super thin super predictable. You can easily dash or flash it. No counterplay typically refers to targeted disables like old talon and leblanc silence.","replies":[]},{"poster":"Rinky Dinky","date":"2015-08-11T22:29:33.776+0000","up_votes":1,"down_votes":0,"body":"lol no","replies":[]}]},{"poster":"Linna Excel","date":"2015-08-11T23:14:20.046+0000","up_votes":1,"down_votes":0,"body":"Why on the human side?  Why not nerf her spider Q instead?","replies":[{"poster":"Skia Asteri","date":"2015-08-14T20:20:34.649+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Linna Excel,realm=NA,application-id=3ErqAdtq,discussion-id=LwfREET3,comment-id=00030004,timestamp=2015-08-11T23:14:20.046+0000)\n>\n> Why on the human side?  Why not nerf her spider Q instead?\n\nBecause then if she uses the spider form to get close to coccon, she has little follow up damage till after the stun is over.","replies":[]},{"poster":"Tourian","date":"2015-08-12T00:33:30.735+0000","up_votes":1,"down_votes":0,"body":"Because current HP is better than missing HP. Missing HP is really only useful at around  30 percent. %max health>%current>%missing.","replies":[]}]},{"poster":"LoopKat","date":"2015-08-12T20:33:33.315+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=LwfREET3,comment-id=0003,timestamp=2015-08-11T21:20:30.217+0000)\n>\n> We're nerfing the % damage in order to make Elise weaker, because we believe she's far too strong at present. Compensation buffing's not appropriate as a result, since it goes against the goals of the change. Compensation buffing can be the right approach in other contexts (e.g. removing power from a skill with little counterplay, adding it back in to a healthier spell), sometimes though what's needed is just a straight nerf.\n\nI still think the 80 mana cost is extremely harsh, Elise already has mana issues and 80 per Q is _brutal_ at all stages in the game (unless she goes for some crazy Ryze mana build, _which she shouldn't have to_).","replies":[]},{"poster":"Tourian","date":"2015-08-12T00:20:35.649+0000","up_votes":1,"down_votes":0,"body":"What I can't understand is why not just make the base percentage scale with rank (I.e. 4%/5%/etc) like they do with other base damage nerfs or keep the dot and the percentage but having the current health move to a dot would effectively nerf it because it recalculates each tick like liandrys. I really wish you guys would stick with getting rid of her percentage or do a full rework. I love this champion to death but her fluctuating viability is getting  on ryzes level except the peaks and troughs are more like 5 months. And we all know this pbe nerf is going to put her right back in the Kass-can for half a year.","replies":[]},{"poster":"Hard4Hamsters","date":"2015-08-11T23:31:04.605+0000","up_votes":1,"down_votes":0,"body":"I feel like this is not going to affect how powerful she is. Did you notice how her winrate went up 10% when her E duration at level 1 was brought up to its highest duration it's ever been? Yeah. That's the problem. Her E duration at level 1 is too high. It also has a higher missile speed than it did in season 3 albeit at a smaller missile width, but I feel like this won't address the problem that Elise is facing in terms of balance. She is going to miss out on some damage, yes, but she is still going to be a meta dominating pick until you nerf her over and over again until it is decided to reduce her E duration, thus putting her in a worse state than she was prior to 5.14.","replies":[]},{"poster":"Big Lincoln","date":"2015-08-11T23:19:37.019+0000","up_votes":1,"down_votes":0,"body":"why not just revert some of the buffs that made her so strong? IIRC there was a bonus put on her spiderling damage after using E, and then they got buffed to deal magic damage on every AA, and of course there's the buff to cocoon\n\nwouldn't toning down one of the current issues (imo) help reel her in?","replies":[]},{"poster":"Dr Poro","date":"2015-08-11T22:22:55.358+0000","up_votes":1,"down_votes":0,"body":"What about other high winrate+popularity champs? Xin, Janna, AHRI (I know she's getting a minor nerf on her passive, but I doubt that'll be neough, we'll see), Blitz, Annie to name a few.","replies":[]},{"poster":"Nidalee SO NYAAA","date":"2015-08-11T21:33:44.151+0000","up_votes":1,"down_votes":1,"body":"Is there a reason why the 8% was too strong? I don't fully understand how this makes a  difference","replies":[{"poster":"137434","date":"2015-08-11T21:58:37.595+0000","up_votes":1,"down_votes":0,"body":"This hurts her damage against tanks while lessening the impact against squishes. 8 to 4% may not seem like much but keep in mind that at level 1 that is a loss of about 20 damage minimum against a full health target.","replies":[]}]}]},{"poster":"137434","date":"2015-08-11T20:55:00.253+0000","up_votes":2,"down_votes":1,"body":"No, level one damage is 40 + 4% of target's current health...you can't really ignore that scaling because your target will always have health (or they would be dead). I wouldn't expect the base damage to be buffed because the entire point is to nerf the skill across the board.","replies":[{"poster":"CatSith","date":"2015-08-11T20:58:28.964+0000","up_votes":1,"down_votes":0,"body":"The point of the nerf is to bring down her mid/late game burst.  40+4% = 60-66 damage from a 500-650 hp target which is on average for level 1 champions.  That isn't a lot of damage for a cost of 80 mana.  While other champions have pokes with lower cds, longer range, half the mana cost, and better scaling.","replies":[{"poster":"137434","date":"2015-08-11T21:15:40.311+0000","up_votes":4,"down_votes":0,"body":"Most other champions also don't get a free additional, 0 mana cost, 60+ 4% (or maybe 8%? don't know if that scaling was nerfed too) of missing health ability (on a separate CD) at level one too...","replies":[]}]}]},{"poster":"Droogzy","date":"2015-08-11T21:47:50.825+0000","up_votes":1,"down_votes":1,"body":"I really don't see how Lane Elise is any different then Jungle Elise, damage wise. They both will do percentile damage which with her burst and sustained damage is a little excessive. If Elise is brought into lane, she needs to be curbed in power as well, I would argue even more so since she will have a higher income in the top or mid lane allowing her to do more damage than her jungle counter part. \n\nKinda sucks, Elise finally becomes viable and they're nerfing her again, one patch later, though she is undeniably overbearing/strong currently.","replies":[{"poster":"Tourian","date":"2015-08-12T00:35:59.962+0000","up_votes":1,"down_votes":0,"body":"Lane Elise doesn't work because her management cost is too high and too many top owners can make you irrelevant with just a cowl.","replies":[]},{"poster":"CatSith","date":"2015-08-11T22:16:00.351+0000","up_votes":1,"down_votes":1,"body":"Lane elise power is in her early game Q poke.","replies":[]}]},{"poster":"Droogzy","date":"2015-08-11T22:18:37.268+0000","up_votes":1,"down_votes":0,"body":"Which is exactly my point, if Jungle Elise can destroy someone so easily with Q, lane Elise is capable of doing it much more easily, higher income from lane, and more pressure to do so with.","replies":[{"poster":"CatSith","date":"2015-08-11T22:28:53.513+0000","up_votes":1,"down_votes":0,"body":"Jungling and top is two completely different roles.  Jungling she is ganking lanes in 2v1 or 2v3.  Top lane she is against mostly tanks and bruisers who have a lot of advantages against her, while having to watch out for ganks.  Jungle elise have creeps to farm without anyone to bother besides the occasionally counter jungle which isnt often.  Top lane is against another player with the occasional ganks.\n\nI dont see what kind of point you are trying to make with the income.","replies":[]}]},{"poster":"CatSith","date":"2015-08-11T20:52:13.531+0000","up_votes":1,"down_votes":2,"body":" down votes but no reason to say why I'm wrong? lol","replies":[]}]}