{"poster":"CatSith","date":"2018-03-26T19:47:34.229+0000","title":"@RiotRepertoir Any plans for Elise?","subforum":"Gameplay","up_votes":29,"down_votes":1,"body":"Shes been drastically affected by the meta shift and it hasn&#039;t gotten any better for her.","replies":[{"poster":"RiotRepertoir","date":"2018-03-27T00:31:26.271+0000","up_votes":41,"down_votes":2,"body":"Hopefully something for 8.7.","replies":[{"poster":"AirKingNeo","date":"2018-03-27T01:34:52.871+0000","up_votes":3,"down_votes":2,"body":"what about that Kayn passive change that will make him better in lane?","replies":[{"poster":"RiotRepertoir","date":"2018-03-27T17:53:17.740+0000","up_votes":2,"down_votes":0,"body":"Also in for 8.7.","replies":[{"poster":"Erdamon","date":"2018-03-27T20:05:19.621+0000","up_votes":3,"down_votes":0,"body":"I know I'm sidetracking once more but I'd like to ask if there's any other Rumble changes that might/will make it in the following days of this pbe cycle?","replies":[{"poster":"RiotRepertoir","date":"2018-03-27T22:28:26.492+0000","up_votes":3,"down_votes":1,"body":"I don't think so. I believe what's on the PBE is what we're planning on delivering at this point.","replies":[{"poster":"Scotty Rumble","date":"2018-03-28T05:18:18.046+0000","up_votes":3,"down_votes":0,"body":"Nothing will change unless you start listening to the rumble players, idk why you even bother. more and more rumble mains quitting the champ... malphite is a new favourite of rumble mains, he's even getting decent buffs on PBE lmao.","replies":[{"poster":"Scotty Rumble","date":"2018-03-28T05:20:00.757+0000","up_votes":2,"down_votes":0,"body":"Don't expect the new skin to sell well.","replies":[]}]},{"poster":"Erdamon","date":"2018-03-28T08:49:31.401+0000","up_votes":1,"down_votes":0,"body":"Well that's a shame, I guess I'll wait for the upcoming patches to see if there's some follow up work there, or a VGU at this point","replies":[]}]}]},{"poster":"I nid a leesch","date":"2018-03-27T22:11:51.184+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=RiotRepertoir,realm=NA,application-id=3ErqAdtq,discussion-id=yUGEyMJK,comment-id=000500010000,timestamp=2018-03-27T17:53:17.740+0000)\n>\n> Also in for 8.7.\n\nPersonal opinion those buffs are beyond pointless. She doesnt have dmg issues she has mana and clear issues. Her multicamp clear sucks ASS combined with the fact that her mana costs are cripplingly high. Clear raids with elise lvl 3 with no blue/red buff and see how long it takes. the only form of multiclear she has is her human form W and that doesnt do any dmg at all in the early stages. Suggested buffs is giving elise and her spiderlings temp increased attack speed when they kill a unit + lower mana cost/higher manabar. After elise's spiderform W attack speed buffs ends theres legit nothing for her to do so you have to switch between human form and spiderform 5 times and kite when You're doing raides. Her high mana costs basically make her a sucker for blue buff and it getting invaded means your early game is gone.\n\nEdit* the e buff is nice but pointless to its not nidalee in which you use q and then use it again a few seconds later. Youre forcing the enemy to decided between flashing or getting hit. E cooldown isnt relevent since you max it out last and assuming 25+ min elise's job to get her team ahead is over. Elise also doesnt buy any cdr or barely which means it stays 10+ cooldown late game.\n","replies":[]},{"poster":"AirKingNeo","date":"2018-03-27T18:20:57.565+0000","up_votes":1,"down_votes":0,"body":"Doesn't seem to be listed on Surrender@20, but I just want some Rhaast top.\n\nAlso, Conqueror kinda sucks and it's only good on Jax. Too many issues with it falling off and taking too long to stack in team fights. If you want a laning rune, Grasp is so much better than Conqueror.","replies":[]},{"poster":"Ultîma","date":"2018-03-27T18:02:50.621+0000","up_votes":1,"down_votes":0,"body":"Could we get some clarity about his passive? The in-game indicator is terrible at giving information, making the whole orb requirement arcane at best. Buffs are welcomed but I think Kayn's biggest failing is that no one knows how we're supposed to figure out the number of orbs we're supposed to collect, and how skewed we are towards Darkin or Shadow Assassin if we're ganking lanes pretty actively.","replies":[]}]},{"poster":"Spideraxe","date":"2018-03-27T19:17:20.501+0000","up_votes":1,"down_votes":0,"body":"Here are the numbers from DKlein if you aren't blocked by him https://twitter.com/danielzklein/status/978339845163462657","replies":[]}]},{"poster":"AbyssmalHydra","date":"2018-03-27T02:07:49.549+0000","up_votes":1,"down_votes":0,"body":"Any news possible to be acquired on the Lissandra passive change project?","replies":[{"poster":"RiotRepertoir","date":"2018-03-27T17:54:29.429+0000","up_votes":3,"down_votes":0,"body":"It's in progress, but I'm not sure exactly how close Meddler is to being ready to ship it. He'd probably be better to ask in one of his regular posts.","replies":[{"poster":"Shadow Hazard","date":"2018-03-27T18:00:11.937+0000","up_votes":1,"down_votes":0,"body":"I already doubt one for this but reasoning behind actively targeted removal of jungle viability for irelia. \n\nFor one that I am more hopeful for an answer on, you mentioned how ranged champs are still benefiting from rageblade noticeably more. Wouldn't a price nerf simply hurt everyone including the melee's. This wouldn't be the first time of bitterness about melee's taking a hit because ranged use's X better, heck this specifically happened to rageblade previously.","replies":[]}]},{"poster":"dome025","date":"2018-03-27T19:31:12.197+0000","up_votes":1,"down_votes":0,"body":"Here you go: https://boards.na.leagueoflegends.com/en/c/developer-corner/EEHXQ3kv-quick-gameplay-thoughts-march-23?comment=00020000","replies":[]}]},{"poster":"Almo","date":"2018-03-27T02:58:51.566+0000","up_votes":2,"down_votes":0,"body":"THANK YOU. I have stopped playing Elise since the changes in preseason and now the AP item changes. If I don't do everything 100% correct, I am punished right away and it always feels like I am playing from behind. \n\nThe item changes really just magnified that. I agree, her Q in human form feels very meh. She needs a better form of damage on the Q and some help on itemizing. It really sucks playing Elise right now.","replies":[{"poster":"Cowgirl Ed","date":"2018-03-27T12:16:32.253+0000","up_votes":2,"down_votes":2,"body":"Literally half the champion pool is in her same state","replies":[]}]},{"poster":"Tormentula","date":"2018-03-27T02:47:31.827+0000","up_votes":2,"down_votes":0,"body":"What really hurt her was removing the pen from haunting guise and putting it onto morello. Before she could powerspike into the mid game with guise then into % current health burn. \n\nNow she can only go 1500g oblivion orb then into 3100g liandrys. None of the other AP changes really benefits her either so she got hurt while everything else got stronger.\n\nI'm not sure what I'd suggest to fix that, but her human Q feels really weak, and that W nerf for worlds really hurt her build variety (I loved playing bruiser and tank elise, but its too low damage to even try now). Maybe buff her Q damage? or give it some amplifyer that increases damage like MR shred? Her mana cost is fine for a jungler so it would only help lane elise if that goes through.","replies":[{"poster":"Z3Sleeper","date":"2018-03-27T02:52:28.001+0000","up_votes":2,"down_votes":1,"body":"I don't think so. The only reason she got Liandry in the first place was for the early pen stat--most would stick with Haunting for quite awhile.\n\nOblivion orb fills the same role for the same price and same stats.\n\nThe real issue is just how power-creeped everything got with new runes that didn't affect her as much.","replies":[{"poster":"Tormentula","date":"2018-03-27T03:36:25.201+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Z3Sleeper,realm=NA,application-id=3ErqAdtq,discussion-id=yUGEyMJK,comment-id=000500030000,timestamp=2018-03-27T02:52:28.001+0000)\n>\n> I don&#x27;t think so. The only reason she got Liandry in the first place was for the early pen stat--most would stick with Haunting for quite awhile.\n\nShe got liandry because the pen from guise helped her mid game, and then building it into liandry gave her a %current health burn in addition to the pen and a nice amount of HP and AP\n\nWith oblivion orb she has to build it the same way as guise, but then that delays any other power spike items since morello doesn't actually give anything else except grevious wounds, so sure, WW is healing less.. but you're not doing the damage anymore to begin with that he would've been healing. \n\nThis leads her to spend 1500 gold for 15 pen, then spending more gold for another finished item (1500 for pen, 1600 for finish liandrys burn and stats vs. 1500 for pen, then either 1500 for grevious wounds you may not need and is flat out weaker then liandrys, or spend 2650 - 3100 for void/liandrys.) For a champ that always has to keep the momentum, this makes her fall off way sooner then before and that was already a huge weakness for elise to make up for her effectiveness. \n\n\n> The real issue is just how power-creeped everything got with new runes that didn&#x27;t affect her as much.\n\n\nThat's part of the issue too. Early game junglers in general are pushed out of the role in favor of tanks and effective gankers. Elise's niche was being effective early and helping the game end by 20 minutes, but j4, WW, Sej, etc do it better then become monsters later.","replies":[{"poster":"Z3Sleeper","date":"2018-03-27T04:30:52.024+0000","up_votes":1,"down_votes":0,"body":"What I meant to say is she doesn't NEED the burn. It was just tacked onto Haunting Guise and was cost efficient so Elises would pick it up.\n\nJust build Oblivion Orb and leave it as Oblivion Orb, don't upgrade it. Alot of people are doing that, it's the same deal as Haunting Guise.","replies":[{"poster":"Tormentula","date":"2018-03-27T19:13:32.259+0000","up_votes":1,"down_votes":0,"body":"Yea you build oblivion, then sit on it... then what? You gold sink into waiting for another full item and by the time you get it, you fall off.\n\nLiandries burn was super important for dealing with tanks. She built guise for pen but she upgraded guise for the burn to help her still kill everything mid game, it was such a great important item for her. Now she loses that mid game and can't fight anything except an isolated squishy (which the higher you climb you won't see as often, or you'll realize picking that person is free on so many other champs as well anyway.","replies":[]}]}]}]}]},{"poster":"Vekkna","date":"2018-03-27T16:13:55.702+0000","up_votes":1,"down_votes":0,"body":"Would be nice to see changes that enable play in other roles. She has so much potential as a bruiser in top, AP assassin in mid, or even as support. Like, she has a ton of on-hit synergy built into spider form, but it just doesn't work when it feels like it should.\n\nI just feel like mage form and spider form should both be a lot stronger individually, then balanced with equalized mana costs between forms and shared cooldowns on W, E, or both.\n\nI refused to play League for a long time, and Elise's concept was what finally hooked me into trying the game. Then I quickly learned that she was trash tier (season 5), she was strictly unviable outside of jungle, and neither of her forms was functional on its own. You can't even see your skill cooldowns after changing forms, which is nothing but lack of information dressed up as a skill requirement.\n\nHopefully someday she will live up to her potential instead of being one of the most (or *the* most) pigeonholed champ in the game.","replies":[{"poster":"GentlemanGhidora","date":"2018-03-27T17:49:32.350+0000","up_votes":1,"down_votes":0,"body":"I REALLY want on-hit bruiser Elise top to be a thing but she has no way of viably keeping herself from dying AND impacting the game if jungler/mid/bot need help before she can get the items to build that way.\n\nI want a tanky spider that can act as a front-line but if everyone, including supports get their core items before she does because the game is way too fast-paced (barring her miraculously getting fed which won't happen in a solo queue environment 90% of the time), she is, as you said, limited to strictly jungle and even then she's just not good enough because of what everything else there is that does her job and then some.\n\nElise is a team champion that CAN do well solo with a skilled player but that same skilled player can have far more impact playing basically anything else.","replies":[{"poster":"Vekkna","date":"2018-03-27T20:09:03.336+0000","up_votes":1,"down_votes":0,"body":"I wasn't thinking front line tank necessarily. More along the lines of a Warwick, Jax, or current Irelia.\n\nRight now Elise has 3 skills that deal 0 damage. If they shared W and E cooldowns between forms, it frees up a lot of power to add back into Qs and each form's WE. Like putting a tank steroid on spider W, moving the E spider buffs to W, a slow and damage on spider E landing, or having spider WE generate spiderlings. So it would play out where you engage with E, dps and survive and dps with W, then try to execute with Q (with the option of RQ to finish them off.)\n\nThen in mage form, if W jumped to targets affected by mage E or Q, she would have a couple different combo options. EWQRQ for stun combo, or QWRQE for a dive-and-escape. EQRQW to try and put more damage on a tankier target. Mage Q would be a skill shot that sent out spiderlings, like Yorick's blob. From there it would just be a matter of tuning.\n\nBut even an idea like that is more radical that it needs to be. They could probably carve out laning identities for her different forms just using hybrid ratios, or making changes like spider Q applying on-hits, spiderlings inheriting a % of bonus HP, or retooling her base AD around a sheen spider build.","replies":[{"poster":"GentlemanGhidora","date":"2018-03-29T01:37:29.565+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Vekkna,realm=NA,application-id=3ErqAdtq,discussion-id=yUGEyMJK,comment-id=0005000500000000,timestamp=2018-03-27T20:09:03.336+0000)\n>\n> I wasn&#x27;t thinking front line tank necessarily. More along the lines of a Warwick, Jax, or current Irelia.\n> \n> Right now Elise has 3 skills that deal 0 damage. If they shared W and E cooldowns between forms, it frees up a lot of power to add back into Qs and each form&#x27;s WE. Like putting a tank steroid on spider W, moving the E spider buffs to W, a slow and damage on spider E landing, or having spider WE generate spiderlings. So it would play out where you engage with E, dps and survive and dps with W, then try to execute with Q (with the option of RQ to finish them off.)\n> \n> Then in mage form, if W jumped to targets affected by mage E or Q, she would have a couple different combo options. EWQRQ for stun combo, or QWRQE for a dive-and-escape. EQRQW to try and put more damage on a tankier target. Mage Q would be a skill shot that sent out spiderlings, like Yorick&#x27;s blob. From there it would just be a matter of tuning.\n> \n> But even an idea like that is more radical that it needs to be. They could probably carve out laning identities for her different forms just using hybrid ratios, or making changes like spider Q applying on-hits, spiderlings inheriting a % of bonus HP, or retooling her base AD around a sheen spider build.\n\nFunnily enough; I actually WAS thinking in the same lines as a Jax (and to a lesser extent, Warwick) player. I probably just butchered how I phrased my thoughts. Disruptive, can take a decent few blows, and has a small trick or two to safely enter or exit a situation in an ideal environment. Nothing over the top like a Garen running in to silence someone for a long time while doing a ton of damage and being tanky and spamming out more damage/cc and expecting to survive more often than not regardless of circumstances.\n\nI don't mind dying if I did something stupid. I like to plan out how I'm going to do something as opposed to just blindly rushing in and having little expectations beyond hitting stuff every cooldown. A sheen build, maybe a BotRK in there, and just fill the gaps as the situation warranted while remaining in spider form most of the game is how I'd want to play her.\n\nI probably am overthinking this as I keep forgetting I need to account for her human form. Spider form is just so much more appealing to me for some strange reason.","replies":[]}]}]}]},{"poster":"Tormentula","date":"2018-03-28T12:22:53.077+0000","up_votes":1,"down_votes":0,"body":"Please don't go through with that Elise buff. Please reconsider what parts of her kit you're buffing. The ones on PBE have absolutely no noticable difference and don't fix any of her issues that she has right now. A lot of our Elise mains in discord really dislike these changes and not any of our 1 mils would prefer these changes to go through and reap more power budget in other places in her kit that need help. \n\nhttps://boards.na.leagueoflegends.com/en/c/gameplay-balance/t8wzvVzf-riotrepertoir-i-dont-think-these-are-the-buffs-elise-needs-please-think-this-over-carefully-otp\n\nTL;DR: pull the spider buff, pull the cocoon buff, give human Q a huge buff alone, or don't change her at all yet and revisit her when you plan on reworking a part of her kit. \n\nOr lower her AP scaling on W and increase its base, unlike what you guys did for 2017 worlds that really made her feel shitty. ","replies":[]},{"poster":"CatSith","date":"2018-03-27T21:48:03.060+0000","up_votes":1,"down_votes":0,"body":"Have you guys ever discussed about giving her E (cocoon) True sight when hitting an invisible target?","replies":[]}]},{"poster":"Kaìju","date":"2018-03-26T21:26:45.319+0000","up_votes":1,"down_votes":1,"body":"Having talked to higher tier players, I once worded it as, \"isn't Elise just an AP Lee Sin? An early game pseudo assassin that either goes full nuke or turns into a CC bruiser later?\" And they responded with, \"basically.\" But I see 100x less Elise than Lee Sin, despite the fact that they are supposed to be very similar I see far far far more Lee's, which makes me wonder why she isn't picked.","replies":[{"poster":"FlowDartX","date":"2018-03-26T22:45:23.362+0000","up_votes":5,"down_votes":1,"body":"AP is just unobjectively worse than AD rn\n:( \nthe items are probably too expensive...","replies":[{"poster":"SpecterVonBaren","date":"2018-03-27T01:35:39.861+0000","up_votes":5,"down_votes":0,"body":"Remember when someone having a full AD comp meant the tank on the other team was going to be able to ignore all their damage? I miss those days...","replies":[{"poster":"ZackTheWaffleMan","date":"2018-03-27T02:24:05.533+0000","up_votes":1,"down_votes":0,"body":"Just go rammus jg, malph top, and taric supp.","replies":[]}]}]},{"poster":"Ahristocats","date":"2018-03-26T21:27:47.923+0000","up_votes":2,"down_votes":5,"body":"both are extreme generalist that can do everything without a real specialization","replies":[{"poster":"Kaìju","date":"2018-03-26T21:38:21.815+0000","up_votes":1,"down_votes":0,"body":"Sure but my point is why is Elise not picked as much as Lee? Lee has the flashy insec sure but Elise just has a safer pick tool and more CC since a common item on her us Rylais, I imagine she would be picked more.","replies":[{"poster":"Bern","date":"2018-03-27T03:27:38.754+0000","up_votes":2,"down_votes":0,"body":"The insec matters a lot. Once you're past skirmishes and into teamfights, Elise (especially full AP Elise) isn't that great at going forward; she can only really kite back, and her engage is a linear skillshot that can be blocked. Lee Sin can actually go forward into the enemy team and get something done. It's a huge difference.\n\n\"Lee Sin falls off past midgame\" always had the asterisk note that, if you were a god, you could still make relevant plays late. Elisefalls off past midgame, but doesn't have the asterisk; no matter how good you are, you fall off like a damn rock (and you can't even build tank after a damage item or two without falling off even harder).","replies":[]},{"poster":"Ahristocats","date":"2018-03-26T21:44:25.393+0000","up_votes":2,"down_votes":3,"body":"are you talking about soloq or pro play?\n\nin pro play both are out of the meta","replies":[{"poster":"Kaìju","date":"2018-03-26T22:05:40.456+0000","up_votes":1,"down_votes":0,"body":"In pubs, not pro. I see a Lee Sin at least once a day, I see Elise honestly, maybe three or four times a season.","replies":[{"poster":"Doozku","date":"2018-03-27T00:38:02.564+0000","up_votes":2,"down_votes":0,"body":"Probably just because Lee Sin has a more appealing theme than Elise and a lot of the playerbase finds him really entertaining. He has a lot of mobility and ways to approach a fight where as Elise is fairly binary.","replies":[]},{"poster":"Tormentula","date":"2018-03-27T03:43:06.826+0000","up_votes":1,"down_votes":0,"body":"She's played a lot in korea, and she was pretty contested in higher elo season 6-7.\n\nLee is just more popular. Elise was a good match for him because they did the literal same things but Elise was more effective with her cocoon vs. lee's skill shot Q and trying to find a way on the carry to kick them. Elise also matches lee early, which is something not a lot of champs do. \n\nWhat really sucks though is Lee has a lot of base damage in his kit, and access to better AD items, so he can do a lot of damage and afford to go off-tank. Elise in previous seasons used to be able to do that, go off-tank and still 1v1 anybody and pick somebody with cocoon, but after season 7 worlds they nerfed her base damage so she can't go tank or she'll do less, but has to go glass cannon in order to use the little scalings they gave her. She used to be the variety build champ that you can go anything with and succeed if you're good with her, but rn shes limited and even the couple builds mains are using don't succeed nearly as well as before.\n\nTo say the least, ahead elise doesn't feel as good as ahead lee, and behind elise makes you never want to play her again while lee you can still pull some stuff off. ","replies":[]},{"poster":"Automated Riven","date":"2018-03-26T23:20:46.680+0000","up_votes":1,"down_votes":0,"body":"It's probably because Lee sin is more popular. They are around the samepower level but she doesn't have the highs and flash that he has.","replies":[]}]}]}]}]}]},{"poster":"OverpoweredSoap","date":"2018-03-26T22:17:27.296+0000","up_votes":5,"down_votes":0,"body":"I honestly just want her human form Q to be changed.\n\nMost boring part of her kit by far, a short ranged point and click damage spell. \n\nEverything else in her kit is at least interesting imo, her q just feels boring to use and boring to play against. \n\nI can't speak for the spell's effectiveness but I've been told in earlier seasons that it was a fine ability so yea.\n\nI don't play Elise much though, so take my opinion with a grain of salt.","replies":[{"poster":"KoKoboto","date":"2018-03-27T03:38:24.945+0000","up_votes":1,"down_votes":0,"body":"Yeah her W is pretty interesting but her Q is boring AF please change thanks","replies":[]}]},{"poster":"Feel Apathy","date":"2018-03-26T21:58:30.812+0000","up_votes":3,"down_votes":0,"body":"The {{item:3151}}  change hit her hard, as she got great benefit from the flat magic pen.\n\nI think a few nerf reverts will fix her, like spiders having more health and being quicker to attack/move.","replies":[{"poster":"Power Cosmic","date":"2018-03-27T16:39:38.558+0000","up_votes":1,"down_votes":0,"body":"{{item:3916}}  into {{item:3165}} \n\n Losing the %hp burn sucks tho and I don't know the gold difference off the top of my head","replies":[{"poster":"Tormentula","date":"2018-03-27T19:09:31.673+0000","up_votes":1,"down_votes":0,"body":"You sit on oblivion orb for pen, then spendmore gold for another finished item becaus morello is pretty much a gold sink.","replies":[]}]}]},{"poster":"Oleandervine","date":"2018-03-27T18:28:52.128+0000","up_votes":2,"down_votes":0,"body":"Any plans...\nhttps://youtu.be/_mVW8tgGY_w","replies":[]},{"poster":"Rïsk","date":"2018-03-27T16:58:28.654+0000","up_votes":2,"down_votes":0,"body":"I've been playing Elise since release.. Thousands of games on her. Was consistently master/chall. Some possible changes I'd consider; Elise needs mr arm on r reverted, E should be free to cast but smaller radius, or maybe make her spider W a little better for clearing so she keeps up with meta champs but doesn't become too strong.","replies":[]},{"poster":"O Fallen Scholar","date":"2018-03-27T12:32:52.597+0000","up_votes":2,"down_votes":0,"body":"She needs lower mana cost on Q (human form). Ur basically drained with 3 casts of Q without blue buff.","replies":[]}]}