{"poster":"Dreadful Force","date":"2016-04-23T16:06:49.666+0000","title":"troppi noob in ranked","subforum":"Discussioni generali","up_votes":3,"down_votes":10,"body":"non c&#039;&egrave; bisogno che scriva niente, tanto lo sapete benissimo tutti che a elo silver gold, ci sono piu tardi che minion in game, non si riesce a giocare un game normale, ogni queue io spero solo di non trovare tardi ,speranza per altro vana.\r\ntutti nel mio team sempre con 100 win in normal, placement ieri, 2/8 silver 3 e si va a far schifo in ranked, con il premade che &egrave; silver 2 che neanche lui sa giocare.\r\nsenza parole davvero","replies":[{"poster":"Dreadful Force","date":"2016-04-24T16:42:39.051+0000","up_votes":2,"down_votes":0,"body":"***","replies":[{"poster":"Severus Piton 19","date":"2016-04-24T17:08:28.053+0000","up_votes":1,"down_votes":1,"body":"PJSalt","replies":[]}]},{"poster":"Dreadful Force","date":"2016-04-24T16:37:04.936+0000","up_votes":2,"down_votes":0,"body":"***","replies":[{"poster":"Severus Piton 19","date":"2016-04-24T16:38:24.053+0000","up_votes":2,"down_votes":3,"body":"Vattene in bronzo e non scassare più allora :')","replies":[]}]},{"poster":"Dreadful Force","date":"2016-04-24T13:54:50.328+0000","up_votes":2,"down_votes":0,"body":"non ho mai detto di essere pro, ma dall'essere handicappato all'essere normo dotato ne passa.\ncazzo ogni game gente con 100 win in normal che non sa neanche cosa voglia dire giocare e la trovo in silver 1, ma come cazzo è possibile?\npoi dirmi che sono boostato proprio no, io assolutamente non sono mai stato boostato ne mi faccio boostare, a prescindere.\nquello che mi lascia perplesso è come diavolo si fa ad avere 100 win in normal ed essere silver 1/2, cazzo i tardi è giusto che stiano in bronzo non in gold e silver, ma non dico tardi perche io sono piu pro, ma tard nei confronti della lega a cui sono, cazzo, nel mio team un game su tre trovo gente normale gli altri due, tutte le lane fanno 0/8 nei primi 15 minuti, cioè come cazzo è possibile, le soluzioni sono che o sono tutti tardi e dovrebbero essere in bronzo o quelli di la sono tutti smurf, perche altrimenti non riesco a comprendere come sia possibile che facciano score del genere.\nio non sono challenger inside, ma santa madonna, dal far cagare al saper giocare decentemente, io non pretendo di essere carriato, pretendo solo di trovare gente normale, del mio elo o simile.\nin bronzo lo poso anche capire, sono il gradino piu basso, piu in giu non ci vai e normale che ci sia gente veramente senza mani, ma silver mi aspetto almeno che sappiano che stanno facendo, almeno un pochino.\nio invece incontro solo gente che ha fatto i piazzamenti da una settimana e che non sa giocare e la incontro silver 2, non è tanto normale.\nla sconfitta ci sta la si accetta, il game che si suca peso ok, il game che quelli dall'altra parte sono piu forte e si vede quando uno è forte, ci sta, ma perdere perche i compagni non sanno che stanno facendo e fanno cose a caso, che stranamente non sono mai giuste, no, non è accettabile, a tutti capita un bad game, ma c'è bad game e c'è essere scarsi e io non capisco perche gli scarsi sono in silver 2, con scarsi non intendo scarsi perche io sono pro, dico scarsi come per dire bronzo 4/5","replies":[]},{"poster":"lucanomax1994","date":"2016-04-23T16:11:37.203+0000","up_votes":1,"down_votes":2,"body":"***","replies":[{"poster":"Squacquerone","date":"2016-04-23T18:47:28.877+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=lucanomax1994,realm=EUW,application-id=MJVj50Jw,discussion-id=lIEFlqlX,comment-id=0001,timestamp=2016-04-23T16:11:37.203+0000)\n>\n> http://49.media.tumblr.com/0e20d463bee4b282d594f1633620b782/tumblr_nfuz2f2ejy1tztnnuo1_500.gif\n> \n> Una volta a te, una volta a loro.\n> Tanto nessuno si ricorda i game che vinciamo, in cui ci carriano hard.\n\nma tu sei lunatico forte, però","replies":[]},{"poster":"Shinkansen1926","date":"2016-04-24T12:48:04.916+0000","up_votes":1,"down_votes":1,"body":"Ho più di 340 ranked in questa season e il 54% di winrate; gioco per lo più in duo con un amico è purtroppo non più di 4-5 game al giorno causa impegni più importanti, per questo la scalata risulta molto più lenta nonostante il winrate.\nMAI capitato di essere carriato hard (come dici tu) se non in una, forse due partite che ricordo pure, nel mio caso vale la regola fai tutto da solo, puoi star certo che se a me capita il game in cui non gioco bene è persa in automatico, tante volte invidio quegli sculati che mi trovo contro con punteggi imbarazzanti tipo 1/10/0 e si portano a casa i 20 lp, mi fanno incazzare e non sai quanto ma, mai avuta questa fortuna xD","replies":[{"poster":"Severus Piton 19","date":"2016-04-24T13:29:35.379+0000","up_votes":2,"down_votes":1,"body":"Con la tua memoria potresti partecipare ai mondiali di memory","replies":[]}]},{"poster":"call me pawn","date":"2016-04-23T16:14:28.610+0000","up_votes":2,"down_votes":1,"body":"Sei fissato con karma, compratela e mainala senza rompere http://m.memegen.com/i4nq9z.jpg .","replies":[{"poster":"lucanomax1994","date":"2016-04-23T16:18:21.011+0000","up_votes":1,"down_votes":1,"body":"***","replies":[{"poster":"call me pawn","date":"2016-04-23T16:24:24.562+0000","up_votes":1,"down_votes":0,"body":"Era una cosa troll che quando la cliccava ti creava beh... Questo... Però non è andata bene xd.","replies":[]}]}]}]},{"poster":"DoubleT","date":"2016-04-23T22:51:04.300+0000","up_votes":3,"down_votes":1,"body":"Ti lamenti del gold e del silver? Ed io cosa dovrei dire? Guarda le mie ultime ranked! Bronzo 3! Guarda con che ritardati sto in team! Sempre a me i ritardati!\nUltima partita, Varus inutile, vinciamo la lane comunque...però dall'altra parte c'è Vayne, un champ che appena chiude BOTRK e IE va a farsi gli 1v5 e vince da sola, odiosa! Ed il mio team che non focussa lei ma preferisce killare Braum!\n\nSto scendendo ancora, rischio di scendere di nuovo a B4 per colpa di questi ritardati! Porca troia non ne posso più...in bronzo se ci capiti non ci esci, basta! è impossibile! non lo sopporto!","replies":[]},{"poster":"Boldstriker","date":"2016-04-24T11:27:54.105+0000","up_votes":1,"down_votes":1,"body":"-*\"Gna gna gna gna troppi noob mentre io sono bravo e merito di meglio!11!1!.\"*","replies":[{"poster":"Dreadful Force","date":"2016-04-24T14:03:23.151+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Boldstriker,realm=EUW,application-id=MJVj50Jw,discussion-id=lIEFlqlX,comment-id=0007,timestamp=2016-04-24T11:27:54.105+0000)\n>\n> -*&quot;Gna gna gna gna troppi noob mentre io sono bravo e merito di meglio!11!1!.&quot;*\n\nio non ho detto che merito di meglio, pero si è cosi.\nfai un ragionamento logico, ti va?\nallora io sono silver 2, vuol dire che il gioco mi crede di quell'elo, va bene lo accetto, so giocare in una determinata maniera, non sono challenger, lo capisco, c'è un sacco di gente piu buona di me, ok, evidentemente mi merito quell'elo, va bene ci sta;\nmi trovo in team, 4 persone che hanno fatto i piazzamenti da una settimana magari non hanno neanche tutte le rune, hanno 16 champ giusto per rompere il cazzo in ranked, per quale arcaico motivo dovrebbero essere al mio elo?\nio non pretendo di giocare con diamond e farmi carriare, ma visto che sono silver2 perche li mi hanno messo, pretendo di giocare con gente che ha la skill di silver 2, se poi sono piu buono salgo, secondo un altro ragionamento, se sei forte sali, se trovassi due team equilibrati e io sono piu forte dovrei salire, il problema è che i team non sono mai equilibrati per colpa del fattore scarsi, se tu metti un noob a silver 2 non puoi pensare che vinca contro gente notevolmente piu brava di lui, ma non perche io sono piu bravo di lui, ma perche tutti quelli di silver sono piu bravi di lui, cioè è troppo in alto per la sua skill, automaticamente se lui non riesce a vincere perche feeda ogni game, altre 4 persone perdono, poi dico ce ne fosse solo una nei miei game, almeno almeno 2 persone devono feedare senza ritegno, sempre che mi vada bene.\nintendo quando perdo peso, qualche game fortunatamente riesco anche a portarlo a casa","replies":[]}]},{"poster":"Kazushi San","date":"2016-04-24T19:52:40.105+0000","up_votes":1,"down_votes":0,"body":"Se sei bravo perché non sei diamond","replies":[]},{"poster":"call me pawn","date":"2016-04-23T16:11:19.902+0000","up_votes":1,"down_votes":1,"body":"Quindi quel \"1/8/4\" è puramente colpa del team, vero?","replies":[{"poster":"Dreadful Force","date":"2016-04-24T14:05:37.616+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=xXlollomegaXx,realm=EUW,application-id=MJVj50Jw,discussion-id=lIEFlqlX,comment-id=0000,timestamp=2016-04-23T16:11:19.902+0000)\n>\n> Quindi quel &quot;1/8/4&quot; è puramente colpa del team, vero?\n\nmai detto che alcuni game non li suco pure io, pero dei game che perdo perche li suco io e di game che perdo perche il team fa cagare, sono in proporzione 1/15","replies":[]}]},{"poster":"Sorcio84","date":"2016-04-24T09:47:11.735+0000","up_votes":1,"down_votes":0,"body":"Ultima ronked vinta\n\nhttp://matchhistory.euw.leagueoflegends.com/it/#match-details/EUW1/2631495669/204743050\n\nNasus va in tilt perchè perde la lane contro daria.\nIo cerco di far vincere il bot per pareggiare.\nVerso metà game ci riprendiamo.\n\nFine game, tutti e 5 i nemici al drago con base scoperta senza torri e due inibitori giu, invasa dai minion. Tiro dritto e butto giu il nexus.\n\n#GG MAP AWARENESS","replies":[]},{"poster":"Azharidan","date":"2016-04-23T16:25:37.069+0000","up_votes":1,"down_votes":1,"body":"Ce la est via https://youtu.be/X2WH8mHJnhM?t=3m10s","replies":[{"poster":"kharonte90","date":"2016-04-23T18:18:09.280+0000","up_votes":1,"down_votes":0,"body":"ahahaha fenomenale quel video","replies":[{"poster":"Azharidan","date":"2016-04-23T18:32:23.853+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=kharonte90,realm=EUW,application-id=MJVj50Jw,discussion-id=lIEFlqlX,comment-id=00030000,timestamp=2016-04-23T18:18:09.280+0000)\n>\n> ahahaha fenomenale quel video\nlov u","replies":[]}]}]},{"poster":"Darkinknight","date":"2016-04-25T00:15:05.751+0000","up_votes":1,"down_votes":1,"body":"Eppure basterebbe non far fare le 10 partite di classificaIone nella prima season di ranked,e partire direttamente dal b5..se sei bravo poi sali alla svelta,se non lo sei non rischi di trovarto con elo non tuoi a fare smadonnare gli altri..inoltre rallenterebbe la velocita di creazione account boostati da vendere","replies":[]},{"poster":"TORREro064","date":"2016-04-24T07:32:58.816+0000","up_votes":1,"down_votes":1,"body":"https://zombiesruineverything.files.wordpress.com/2013/07/morph1.jpg\ne se ti dicessi...\nche il gold boostato noob sei proprio tu?","replies":[]},{"poster":"Severus Piton 19","date":"2016-04-23T16:22:19.862+0000","up_votes":2,"down_votes":2,"body":"Spero di non trovarti mai in ranked.. Oh wait, nvm","replies":[]}]}