{"poster":"Dreadful Force","date":"2016-07-17T21:20:05.579+0000","title":"parche gli scarsi pickano karma senza saperla usare?","subforum":"Discussioni generali","up_votes":1,"down_votes":9,"body":"perche ogni volta che ho in team una karma, ma anche contro, beh quando c&#039;&egrave; in team una karma, l&#039;unica spell che mantra &egrave; la q?\r\nperche?\r\nogni santa volta potrebbe fare un fight della madonna semplicemente mantrando lo shield e invece mantra la q.\r\nquale &egrave; il disagio mentale dei player che usano karma?\r\npoi si vengono a bullare che loro full ap hanno fatto piu danno dei tank, cio&egrave; quale problema hanno.\r\ne tutti che hanno 100 win in normal se &egrave; tanto, ma perche devi pickare karma? ci sono 150 champ loro scelgono un champ non facile per usare solo meta del suo potenziale, poi si bullano come se avessero fatto il game loro, semplicemente perche facendo solo mantra q fanno danno.","replies":[{"poster":"Samel Seifer","date":"2016-07-18T06:48:38.514+0000","up_votes":4,"down_votes":0,"body":"Ci si potrebbe fare la stessa domanda sostituendo Karma con qualsiasi altro campione. \nIo invece mi chiedo \"Come fanno ad esistere persone che pretendono l'inesistenza di giocatori meno bravi?\". A me sembra un fatto normale, se non esistessero gli scarsi non esisterebbero nemmeno i pro, così come se non ci fossero gli sconfitti non potrebbero esserci i vincitori.","replies":[{"poster":"Dreadful Force","date":"2016-07-18T11:49:41.821+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Samel Seifer,realm=EUW,application-id=MJVj50Jw,discussion-id=1noZ7BRe,comment-id=0001,timestamp=2016-07-18T06:48:38.514+0000)\n>\n> Ci si potrebbe fare la stessa domanda sostituendo Karma con qualsiasi altro campione. \n> Io invece mi chiedo &quot;Come fanno ad esistere persone che pretendono l&#x27;inesistenza di giocatori meno bravi?&quot;. A me sembra un fatto normale, se non esistessero gli scarsi non esisterebbero nemmeno i pro, così come se non ci fossero gli sconfitti non potrebbero esserci i vincitori.\n\nsi potrebbe fare la stessa domanda per qualunque champ, ma il problema rimangono sempre gli scarsi, perche un champ viene giocato male da un player? perche non lo sa giocare o perche è scarso, io vedo gente che perde ma cmq sa giocare abbastanza bene, poi magari perde cmq, pero lo vedi se uno è handicappato o semplicemente ha sfigato quel game o anche che magari quello che ha contro è piu bravo di lui, pero se ci pensi in ranked questo pensiero non dovresti farlo, perche teoricamente si gioca allo stesso livello.\nmettiamo il mio caso,  io sono gold4 mi hanno retrocesso da poco da gold 3 perche io in game trovavo dei gold 3/4 che non avaveno la piu pallida idea di che stessero facendo, non erano tiltati, proprio non sapevano quello che facevano, come se avessero preso quell'account da due giorni e iniziassero a giocare adesso, adesso ditemi voi se è normale?\naltro caso mi è capitato di giocare ranked a elo gold 4 sempre e mi trovo in game 3 silver, 1/2 e un bronzo 1, ma con che logica io gold 4 dovrei giocare con un bronzi 1, caso strano ha feedato come il male sbagliando tutto lo sbagliabile; in ranked questo non è concepibile ne accettabile.\nquesto ragionamento non sarebbe nemmeno da affrontare parlando di ranked, non accetto che io sono gold 4 perche mi impegno ogni game e mi trovo in team gente che non ha idea di come si gioca oppure dei bronzi, no, io sono gold  e pretendo di affrontare dei gold, al massimo silver 1, altrimenti è ovvio che ci sara sempre lo scarso che feedera, ma allora che cazzo di senso ha che ci siano dei gradi?","replies":[]}]},{"poster":"Frattaglia","date":"2016-07-18T06:12:38.991+0000","up_votes":2,"down_votes":1,"body":"Perché la vogliono giocare. Fine del topic.","replies":[{"poster":"Ardens33","date":"2016-07-18T10:47:09.238+0000","up_votes":1,"down_votes":0,"body":"beh la domanda era ovviamente retorica, allora >  \"perché vogliono perdere?\" (sfruttando metà del suo potenziale)","replies":[{"poster":"Frattaglia","date":"2016-07-18T10:51:39.984+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Ardens33,realm=EUW,application-id=MJVj50Jw,discussion-id=1noZ7BRe,comment-id=00000001,timestamp=2016-07-18T10:47:09.238+0000)\n>\n> beh la domanda era ovviamente retorica, allora &gt;  &quot;perché vogliono perdere?&quot; (sfruttando metà del suo potenziale)\n\nSi ma se non giochi mai i campioni non li imparerai mai. Tra l'altro gli scarsi usano metà del potenziale di tutti i campioni... vorrei sapere ad esempio in bronzo silver quanti si ricordano che Janna può scudare anche le torri, tanto per dirne una...","replies":[{"poster":"Ardens33","date":"2016-07-18T11:35:36.836+0000","up_votes":1,"down_votes":1,"body":"boh io lo sapevo senza averla mai giocata :o","replies":[{"poster":"Dreadful Force","date":"2016-07-18T11:38:29.532+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ardens33,realm=EUW,application-id=MJVj50Jw,discussion-id=1noZ7BRe,comment-id=0000000100000000,timestamp=2016-07-18T11:35:36.836+0000)\n>\n> boh io lo sapevo senza averla mai giocata :o\n\ntraduzione?\nse ti riferisci a me, si non l'ho mai giocata, per lo meno, non l'ho mai giocata per impararla bene, l'ho giocata per provarla, non mi interessa, la lascio li dove è, pero so che ha tre spell piu la ulti che ne potenzia una e so che fanno le spell, grosso modo, figa in fight lo vedi se tira uno shield di massa se tira una catena diversa o se tira solo la q mantrata","replies":[{"poster":"Ardens33","date":"2016-07-18T12:45:40.549+0000","up_votes":2,"down_votes":0,"body":"scusa era un replay al post di frattaglia ( riguardo a janna e scudare le torri )","replies":[]}]}]}]}]},{"poster":"Floppyz","date":"2016-07-18T06:52:09.411+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Frattaglia,realm=EUW,application-id=MJVj50Jw,discussion-id=1noZ7BRe,comment-id=0000,timestamp=2016-07-18T06:12:38.991+0000)\n>\n> Perché la vogliono giocare. Fine del topic.\n\nBeh va anche considerato questo fenomeno per cui bisogna a tutti i costi imitare i pick di un certo livello, quando poi non vi sono le condizioni per cui funzionino alla stessa maniera.\n\nPoi è chiaro che uno picka quello che vuole (e te lo dice uno che ha passato diverse season a giocare solo Teemo quando doveva andare top...) però quando vedi 'ste cose in effetti non è che faccia piacere.","replies":[]}]},{"poster":"XxShido91xX","date":"2016-07-18T11:28:50.802+0000","up_votes":2,"down_votes":0,"body":"Per un semplice.motivo....se mantri la Q slowi  e fai doppio danno....in tf torna utile in quanto hai uno slow aoe e se fossero fessi da restarci sopra anche doppio danno ..se mantri lo shield dai uno shield piccolo che dura meno della metà del tempo.del tf, quindi supponendo.che il tank faccia il suo lavoro perche rinunciare a danni e slow x shieldare anche chi.non ne necessita? Semplicemente SE non necessita poiche è un tf in.cui gli adc non stanno al crntro e i mage stanno dove devono mantri la Q sotto ai piedi, tieni lo shield per chi ne ha realmente bisogno e hai piu probabilità di vincere il tf che non shieldando tutti togliendo il danno(presumendo sia karma ap mid) per magari uno shield che fatto 3 secondi dppo avrebbe salvato qualcuno","replies":[{"poster":"Dreadful Force","date":"2016-07-18T11:36:25.558+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=XxShido91xX,realm=EUW,application-id=MJVj50Jw,discussion-id=1noZ7BRe,comment-id=0004,timestamp=2016-07-18T11:28:50.802+0000)\n>\n> Per un semplice.motivo....se mantri la Q slowi  e fai doppio danno....in tf torna utile in quanto hai uno slow aoe e se fossero fessi da restarci sopra anche doppio danno ..se mantri lo shield dai uno shield piccolo che dura meno della metà del tempo.del tf, quindi supponendo.che il tank faccia il suo lavoro perche rinunciare a danni e slow x shieldare anche chi.non ne necessita? Semplicemente SE non necessita poiche è un tf in.cui gli adc non stanno al crntro e i mage stanno dove devono mantri la Q sotto ai piedi, tieni lo shield per chi ne ha realmente bisogno e hai piu probabilità di vincere il tf che non shieldando tutti togliendo il danno(presumendo sia karma ap mid) per magari uno shield che fatto 3 secondi dppo avrebbe salvato qualcuno\n\nsi ragionamento che ci puo stare, supponendo tante cose però, supponendo karma mid e che gli altri si facciano picchiare la faccia senza fare niente e che i loro carry siano in front line a prendere il poke di karma, in qualsivoglia altra situazione la q mantrata non serve presso che a niente, si slowa, lo fa anche la q normale, si se sono fessi e ci rimangono tu prendono doppio danno, si beh allora a sto punto presupponiamo che uno di loro vada afk e gg easy.\ncmq lo shield mantrato non fa uno shield piccolo, anzi è ottimo contro le team comp combo che mirano a disintegrarti il team in breve tempo con molte spell di massa, in piu speeda e non di poco, si non fa piu danni come un tempo, pero cmq sia è un ottimo modo per non essere chasati e per sopravvivere ad un engage avversario, tirare la q mantrata su un engage nemico non serve quasi a niente, loro cmq ti saltano in testa tu ok hai fatto un po di danno, che finisce sui tank che neanche lo sentono e il tuo team muore perche semplicemente ha preferito danno all'aiutare il team, a maggior ragione se è supp","replies":[{"poster":"XxShido91xX","date":"2016-07-18T11:44:02.809+0000","up_votes":2,"down_votes":1,"body":"Quello che stai dicendo tu è un team che forse può giocare coi lego! Cmq se fosse supp il discorso sarebbe totalmente l'opposto  proprio per questo io ho parlato sr fosse mid....cmq in un tf la gente normalmente si concetra un un punto e difficilmente scappa da ogni parte....lo shield ripeto nn serve lo speed se sei fermo, lo scudo va usato in un momento preciso non ad inizio fight...ovvio che se ho contro gente come velkox illaoi etc penso bene di mantrare lo shield quando ultano...sarei veramente stupido a non farloxD","replies":[{"poster":"Dreadful Force","date":"2016-07-18T11:54:12.257+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=XxShido91xX,realm=EUW,application-id=MJVj50Jw,discussion-id=1noZ7BRe,comment-id=000400000000,timestamp=2016-07-18T11:44:02.809+0000)\n>\n> Quello che stai dicendo tu è un team che forse può giocare coi lego! Cmq se fosse supp il discorso sarebbe totalmente l&#x27;opposto  proprio per questo io ho parlato sr fosse mid....cmq in un tf la gente normalmente si concetra un un punto e difficilmente scappa da ogni parte....lo shield ripeto nn serve lo speed se sei fermo, lo scudo va usato in un momento preciso non ad inizio fight...ovvio che se ho contro gente come velkox illaoi etc penso bene di mantrare lo shield quando ultano...sarei veramente stupido a non farloxD\n\nio cmq considero lo shield mantrato situazionale ovvio, ma non puoi sempre e solo spammare mantra q per fare danno, sapendo che di la possono ingaggiarti come tu spammi la r, sia che tu sia mid che supp,  a maggior ragione se si è sotto e a maggior ragione se di la ci sono un sacco di aoe, secondo me è imperativo tenersi la ulti e disingaggiare se serve, la q alla fine fa danno per un secondo, se pero crepi, il game è perso, se shieldi tutti hai molte piu probabilita di arrivare al fight dopo e tentare di fare un fight migliore, secondo me, uguale che uno sia mid o supp, danno puoi farlo anche senza mantrarla la q, lo shield su uno quando il tuo team muore fa molto poco","replies":[]}]}]}]},{"poster":"Il Freddo","date":"2016-07-18T07:54:03.021+0000","up_votes":3,"down_votes":1,"body":"Karma sarebbe non facile?","replies":[]},{"poster":"Zedant","date":"2016-07-19T09:53:38.916+0000","up_votes":1,"down_votes":0,"body":"Non penso che champ dificile da usare sia uguale ad usare un po di cervello,in quel caso sarebbe un champ dificile da far usare alle persone che non pensano.","replies":[{"poster":"Dreadful Force","date":"2016-07-20T12:00:56.962+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Zedant,realm=EUW,application-id=MJVj50Jw,discussion-id=1noZ7BRe,comment-id=0006,timestamp=2016-07-19T09:53:38.916+0000)\n>\n> Non penso che champ dificile da usare sia uguale ad usare un po di cervello,in quel caso sarebbe un champ dificile da far usare alle persone che non pensano.\n\nno pero se prendi un champ che ha bisogno di cervello e tu non lo usi, puoi fare solo schifo, quindi usare il cervello è imperativo, se usi un champ da idioti anche se non usi il cervello rendi, se pero ne prendi uno che ha bisogno di skill, non puoi pretendere di usarlo bene","replies":[{"poster":"Zedant","date":"2016-07-21T07:39:24.867+0000","up_votes":1,"down_votes":0,"body":"cervello?cose?","replies":[]}]}]},{"poster":"Dreadful Force","date":"2016-07-18T11:29:47.460+0000","up_votes":2,"down_votes":2,"body":"grazie cmq per il flame e le risposte sempre molto affettuose, molto gentili grazie a tutti, anche per i meno, evidentemente è pieno di giocatori di karma con 100 win normal in questo forum, beh ma se siete qua a scrivere e non vi trovo in ranked sono piu contento sinceramente","replies":[]},{"poster":"Dreadful Force","date":"2016-07-18T11:26:34.655+0000","up_votes":1,"down_votes":1,"body":"si ma, non avete capito di che sto parlando, io sto dicendo che in ranked ogni volta che vedo una karma che non è facile come champ, bisogna usare cervello per saperla giocare a pieno secondo me, perche la devono pickare per poi usare sempre la ulti sulla q e mai su qualsivoglia altra spell, sempre e solo sulla q, poi fare i fenomeni perche andando full danno hanno fatto piu danni dei tank, cioè ma che problema hanno?\nusano un champ male, se gli fai notare che non hanno mai usato il mantra su una spell differente dalla q ti flammano e non ci provano nemmeno ad usare la ulti su una altra spell.\nil punto di tutto è perche?\nok sono scarsi, pero dico non sono un pro  e nemmeno la uso, pero diamine lo vedi quando uno fa sempre una mossa e basta, anche chiedendoglielo non lo faranno mai di shieldare il team, piuttosto ti flammano a caso.\nche problema hanno i player di karma?\ncioè tutti con 100 win in normal, ok normale che ci siano, non mi sta bene che siano in gold e che facciano schifo, ma va beh lasciamo stare questo fatto, ma ci sono mille altri champ piu facili, karma ha praticamente 7 spell e loro ne usano tre, va beh il mantra lo shield e il poke, la catena non esiste e non serve, se devono mantrare una spell mantrano il poke, se il tuo team sta morendo, piuttosto  shieldano uno alla volta, ma cmq sia mantrano la q, ma perche?\nmi sembra siano domande lecite e considerazioni scontate","replies":[]}]}