{"poster":"ochamir","date":"2015-09-26T13:02:43.416+0000","title":"Minden ami Support Annie","up_votes":1,"down_votes":0,"body":"Seg&iacute;ts&eacute;geteket szeretn&eacute;m k&eacute;rni abban hogy ami fontos annie vel Build vagy b&aacute;rmi azt megosztan&aacute;tok velem.\r\nElőre is k&ouml;szi :)","replies":[{"poster":"MordSeeth","date":"2015-09-26T15:00:36.085+0000","title":null,"up_votes":1,"down_votes":0,"body":"http://www.mobafire.com/league-of-legends/build/hun-l-ttad-a-medv-met-annie-support-guide-by-fcg-senpa-409081\n\nEz magyar guide róla.\n\nAz itemeket nem ártana frissíteni, de a leírás alul viszonylag értékelhető.\n\nA masteryn annyit alakítanék, hogy az executionerre érdemes rakni 3 pontot, illetve az inspiration-re is kettőt. Viszont nem kell elmenni az utility 21. pontjáig, mert teljesen felesleges. És az 5% cd reduction is az, vagyis van helyette értékesebb. Tehát ilyen 12/0/18 vagy 13/0/17 a sup annie mastery\n\nSup annie recommended items in order: kezdő :kék support dagger, két/két poti, ward totem\naztán: ha viszonylag ideje korán benyeltetek killeket a pénzhez mérten, a 850es vagy az 1250es (ha netán véletlenül, vagy ks-ből killeltél is és van annyid) ap itemet. Ha a lane passive, nem fingatjátok egymást, vagy a jungel-es állandóan ott vicceskedik, akkor sightstone és a ward totem helyett a piros felszedős seprűt (ha a pénz még engedi, akkor sima cipő, ha nem akkor pink ward, értelemszerűen mindkettő sem árt).\nMain itemek: olcsó, out of combat gyorsan szaladós cipő, +20as movement enchanttal, sightstone (nem kell upgradeleni a pirosra csak max a legvégén)\nHa a botot durván nyertétek akkor Luden, Rabadon, Zhonya, Rylai, ha annyira, vagy egyáltalán nem nyertétek akkor; Rod of Ages, Rylai, Zhonya, 6. opcionális. Ha az ellenfélnél van kettő olyan, aki magic resre buildelt, akkor a void staff is kell. Ha durva ap dmg van akkor Abyssal és esetleg iron Solari is.\n\nNagyon nagy mértékben az enemy setuptól illetve a kialakult helyzetektől függ, így egy minden körülmények között érvényes build nem létezik.\n\nTalán; cipő, sightstone, rod of ages, Rylai, Abyssal Scepter, Rabadon","replies":[]}]}