{"poster":"Shroom Junkie","date":"2015-06-28T17:08:57.108+0000","title":"Is it just me or does Riot have to do one extreme or the other?","subforum":"Gameplay","up_votes":59,"down_votes":12,"body":"Seriously, its either, buff buff buff buff buff on a character, or nerf nerf nerf nerf nerf, until they&#039;re either called OP as fuck and get that nerf nerf nerf nerf, or completely unviable and everyone wants them buffed.\r\n\r\nEven when they only buff or nerf them once, or even just rework, it seems they go overboard. I mean, I&#039;m pretty new(only several months here) but in the nerfs and buffs I&#039;ve seen as well as heard of it seems like they can&#039;t just nerf&#039;em or buff&#039;em once, or nerf or buff one tiny thing, and then leave it at that, they gotta nerf or buff their whole kit and make everyone hate that champ. It seems the only rework that&#039;s really been good, or so I&#039;ve heard, is Sion who everyone praises the creator for finally getting a good rework or whatnot.","replies":[{"poster":"LegacyDAP","date":"2015-06-28T17:13:12.694+0000","up_votes":18,"down_votes":1,"body":"They only buff, buff, buff because they can't seem to get the balancing right the first time, and the meta shifts when they're also changing, and buffing everyone. \n\nFor example a buff on all assassins, and then next patch they remove health scaling on cinderhulk, and now a nerf on all assassins probably needs to be done several times to work for the current meta.\n\n^ This is just an example by the way.","replies":[{"poster":"Knight SoIaire ","date":"2015-06-28T17:24:50.189+0000","up_votes":3,"down_votes":3,"body":"thats on thing \nthe other is that riot doesnt realy do anything thatgreat to ballance the game \n\nusualy they simply throw changes around \ni understand that if champion gets op he needs to be brought down ... but as op noticed usualy they dont equalize him to others ... they simply spin the whell of who is on top this patch and who getsto be nerfed next patch \n\nand when you look at the changes ... and sometimes even the explanations behind them you will see that they dont do a good job \n\nazir is a perfect example ... the explanation behind the nerf was that azir is not meant to bully lanes \nwhile nerfs consisted of only one thing \nnerf to everything that was powerfull late game ... scalings ... and base damage on maxed skills \n\n\n\n\ni get your point ... league is too dynamic to simplyy predict the outcome \nbut there is nothing to predict when riot simply does random stuff \n\n\nand now the sated dewourer hit the pbe \n\nan item for late game junglers giving literaly 0 stuff late game wants and all the random stuff that could be put there \nquestion 1- why magic damage for ad based junglers ? its a toxic concept \nquestion 2 -why on hit effects ... there is nothing said about late game junglers relying on on hit effects ? is vayne a late game jungler ? \n\n\nleague is dynamic ... but that doesnt change the fact that riot doesnt even try ... they shuffle numbers so players wont feel stagnant and prolly drop the game ","replies":[{"poster":"LegacyDAP","date":"2015-06-28T17:39:35.513+0000","up_votes":3,"down_votes":1,"body":"Okay let me actually try to respond to that like I read it correctly.\n\nThrow changes around? I mean sure somewhat it feels like sometimes, because they don't listen to the community on what needs to be changed, and what shouldn't.\n\nBut Riot does know how to balance their own game, Rek'sai is rather good in higher elos, just worse in lower.\n\nActually Azir is meant to be a lane bully, but that's what they nerfed on him. His W Range was nerfed pretty bad, so he couldn't poke as much, but his Q stayed the same, so his soldier potential with AA's was basically nerfed, and his Q got buffed to still somewhat make him a lane bully, but more of a stay safe poker like Annie.\n\nWhat's wrong with Sated Devourer? It's literally everything that the Devourer enchantment needed. For one it rewards you for doing your job better by getting dragons and ganking. Now I'll answer what you said.\n\n1. Why magic damage? Probably because it's fucking scary watching {{champion:11}} {{champion:23}} {{champion:19}} carrying a {{item:3035}} while jungling.\n\n2. Who has on hit effects? {{champion:11}} {{champion:77}} {{champion:24}} {{champion:266}} {{champion:24}} plenty more, but the main scary ones are written here. They'll probably get nerfed too, so I mean don't be surprised when it happens.\n\nUnless I read on hit effects wrong.\n\nSo my point is they literally have to nerf champions constantly, because of these kind of changes. Everybody wanted devourer to be good, so they had to nerf other champions to compensate for the fact that it could be op on some other junglers, this is the point I stated above.","replies":[{"poster":"Crett","date":"2015-06-28T19:04:48.015+0000","up_votes":2,"down_votes":0,"body":"I hate that they took off the infinite scaling, but then again, 60 magic damage is probably enough considering it's doubled every other autoattack.\n\n{{champion:102}} \n{{item:3718}} {{item:3091}} {{item:3068}} \nThe end times are coming\nLiterally her entire kit loves this\nQ applies autos twice, W increases duration and adds 20 to each auto, E does 2.5% max health per auto, R increases up-time per auto","replies":[{"poster":"macromite","date":"2015-06-29T15:59:30.532+0000","up_votes":1,"down_votes":0,"body":"actually with the devourer q will proc auto's thrice.","replies":[{"poster":"Bodkins Odds","date":"2015-06-29T17:02:41.652+0000","up_votes":1,"down_votes":0,"body":"No, because the Phantom Strike isn't an on hit effect. It only applies on attack. It will reduced her Q cooldown twice as quickly though. She's gonna be scary(er) if this hits live.","replies":[{"poster":"macromite","date":"2015-06-29T20:35:52.548+0000","up_votes":1,"down_votes":0,"body":"you can set it up because her q is an auto attack.","replies":[]}]}]},{"poster":"ArkenStorm","date":"2015-06-29T17:32:29.491+0000","up_votes":1,"down_votes":0,"body":"the infinite stack shyvana was worse IMO","replies":[]}]},{"poster":"Knight SoIaire ","date":"2015-06-28T22:42:51.086+0000","up_votes":2,"down_votes":1,"body":"> Actually Azir is meant to be a lane bully, but that's what they nerfed on him. His W Range was nerfed pretty bad, so he couldn't poke as much, but his Q stayed the same, so his soldier potential with AA's was basically nerfed, and his Q got buffed to still somewhat make him a lane bully, but more of a stay safe poker like Annie.\n\n\nazir was meant to be a hypercarry with weak early and astonishing late \nthats also what was written in the patch notes \n\nriots changes contradicted what they themselves wanted to acomplish with them \n\n> Why magic damage? Probably because it's fucking scary watching   carrying a  while jungling.\n\nactualy its worse \nmagic damage means that they dont need to take that lastwhisper for their damage to go through because you cant propertly itemize mr/ar and hp at the same time \n\nthats why i consider magic damage bad\n\n> Who has on hit effects?      plenty more, but the main scary ones are written here. They'll probably get nerfed too, so I mean don't be surprised when it happens.\n\n\nlane jax killed \nlane yi killed \nlane aatrox killed \nlane udyr destroyed \n\nnon dewoured builds on those champions will make them obsolete \n\nowerpowered item cant be justified by owernerfing champions\nand i already see that some cheese builds that will synergize realy hard will pop up ... leading to more bad made nerfs that will destroy this game even more \n\n\n> But Riot does know how to balance their own game, Rek'sai is rather good in higher elos, just worse in lower.\n\nyou assume so after seeing how they do it ?\nif they would know how to do it and do it properly ... we wouldnt argue here because there would be no reason for it \n\nbut they work as they do ... they fix problems by creating other problems (something was op ... well enjoy it being up ... or vice versa)\n\n\n\n\ni base myself of what i see and what is clear to me \nriot says that azir cant be a lane bully ... and nerfs everything besides lane bullying \n\nriot makes a feral flare ... item synergizes with warwick to hard making him broken ... while at the same time making all of the junglers who use it good top tier and solo carry games .... response ? riot nerfs ww ... then guts the feral flare \n\nriot makes an item for late game junglers ... that provides some random stats and a random passive ... loads of toxicity because magic damage ... and synergizes to the insane level with random champions who arent even tied to jungling that hard (jax is mostly a laner and will go jungle for the item... vayne is the same .. i think that even kayle might try to get it ... diana jungle also will pop up)\n\n","replies":[{"poster":"ArkenStorm","date":"2015-06-29T17:32:02.697+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Hagane No Arashi,realm=EUNE,application-id=3ErqAdtq,discussion-id=u9yKopq1,comment-id=0000000000000001,timestamp=2015-06-28T22:42:51.086+0000)\n>\n\n> lane jax killed \n> lane yi killed \n>** lane aatrox killed** \n> lane udyr destroyed \n\nSay what?\n\nhttp://matchhistory.na.leagueoflegends.com/en/#match-details/NA1/1869319539/40401779?tab=overview\n\nhttp://matchhistory.na.leagueoflegends.com/en/#match-details/NA1/1869294830/40401779?tab=overview\n\nThat passive buff really helped him a lot","replies":[{"poster":"Knight SoIaire ","date":"2015-06-29T23:50:45.339+0000","up_votes":1,"down_votes":0,"body":"we are not talking about how aatrox currently is \n\nwe are talking about the future where aatrox gets nerfed becuase of hte power that sated dewourer would give him \n\nif champions are nerfed due to the junle item ... then they get killed in lane","replies":[]}]}]},{"poster":"LankPants","date":"2015-06-29T03:56:00.401+0000","up_votes":1,"down_votes":0,"body":">Who has on hit effects? {{champion:11}} {{champion:77}} {{champion:24}} {{champion:266}} {{champion:24}} plenty more, but the main scary ones are written here. They'll probably get nerfed too, so I mean don't be surprised when it happens.\n\nAlso {{champion:31}} , {{champion:131}} , {{champion:60}} , {{champion:105}} , {{champion:39}} , {{champion:10}} , {{champion:98}} , {{champion:102}} , {{champion:254}} and {{champion:5}} .\n\nThis item has plenty of viable users, and some of them are a lot more scary than Uydr, Aatrox and both Jaxes, namely {{champion:102}} , {{champion:10}} and {{champion:105}} .","replies":[{"poster":"Frikgeek","date":"2015-06-29T06:43:49.803+0000","up_votes":1,"down_votes":0,"body":"Cho's spikes are on-attack, not on-hit. Shen's passive does crap damage anyway so it doesn't matter. Xin's Q won't get 2 stacks from the new devourer as the stacks increase on-attack, that's why you can knock up a jax who's using his dodge.\n\nNot to mention that Cho, Shen, Shyvana, Vi, and Xin are much better off with Cinderhulk than a damage item anyway.","replies":[{"poster":"LankPants","date":"2015-06-29T08:25:34.837+0000","up_votes":1,"down_votes":0,"body":">Cho's spikes are on-attack, not on-hit.\n\nNot 100% about Cho, but I'll trust you I guess.\n\n>Shen's passive does crap damage anyway so it doesn't matter.\n\nShen's passive does quite a chunk of damage, there's a reason people went Wit's and Ionic Spark on Shen back in S2.\n\n>Xin's Q won't get 2 stacks from the new devourer as the stacks increase on-attack, that's why you can knock up a jax who's using his dodge.\n\nHis W does apply every 2 hits though, and Xin's never been one to shy away from extra AS and on-hit damage.\n\n>Not to mention that Cho, Shen, Shyvana, Vi, and Xin are much better off with Cinderhulk than a damage item anyway.\n\nCho and Shen are probably better with Cinder, I'd agree, but you could build a Devourer up on them if you wanted to deal more damage (at least if vorpal spikes procs with it).\n\nI think Cinder on Vi and Xin is really bad. You don't pick those two champs because you need a tank, you pick them because your team lacks physical damage. I think their main option will still be Warrior, but Devourer will be a sort of side item they can build to scale better into late game, abet sacrificing some of their early game (kind of what Cinder does now but a fair bit stronger).\n\nAs for Shyvana, this item is made for her. I'll just list off what the second hit does for her before considering itemisation.\n\n* Reduces Q cooldown\n* Extends W duration\n* Applies W on-hit damage\n* Applies E on-hit damage\n* Generates extra fury for R\n\nThen you can factor in Wit's End and BotRK both being rather strong items on Shyvana and you start to see how strong this item will be for her.","replies":[{"poster":"Frikgeek","date":"2015-06-29T16:53:53.452+0000","up_votes":1,"down_votes":0,"body":"This only applies to toplane shyvana if you take smite. IF you're jungling you won't have enough gold to get both your wit's end or botrk and the tanky items you need. You're simply better off with Cinderhulk+Randuin's than devourer+botrk.\n\nWarrior junglers are kinda dead, with Rek'sai being the rare exception because she can abuse those 5-7 minutes where's it's strong the hardest. Cinderhulk+Black Cleaver->full tank simply trumps Warrior's->full tank. You'll be tankier AND you'll do more damage.\n\n\nAnd how can you not be 100% sure about Cho? It's so obvious that his spikes are not an onhit effect. Just try hitting a jax while he's dodging(or anything while you're blinded) and you'll see that his spikes still spawn even though he never registers a hit.","replies":[{"poster":"LankPants","date":"2015-06-30T04:17:20.356+0000","up_votes":1,"down_votes":0,"body":">This only applies to toplane shyvana if you take smite. IF you're jungling you won't have enough gold to get both your wit's end or botrk and the tanky items you need. You're simply better off with Cinderhulk+Randuin's than devourer+botrk.\n\nI'm sorry, I didn't realise I'm not meant to spec into my E on jungle Shyvana. You don't both items for devourer to be good on Shyvana, she has a stupid amount of on-hits already, you don't even really need to build into it. The thing is, you can. Devourer/Sunfire/Wit's is fine for a 3 item build.\n\n>Warrior junglers are kinda dead, with Rek'sai being the rare exception because she can abuse those 5-7 minutes where's it's strong the hardest. Cinderhulk+Black Cleaver->full tank simply trumps Warrior's->full tank. You'll be tankier AND you'll do more damage.\n\nThis is just so wrong. Go back through your own match history and take a look at what people are building. Look at LCS/LSK/LPL, in every one of those regions pro players are building champs like Lee/Rengar/Eve/Nocturne with Warrior, oddly enough they're not building Rek'sai with warrior.\n\nIf you ever watch LCK Monte explains this literally every time Lee or a similar champ is picked. You don't pick these champs because you want a tank, there will always be better available options for a tank than Cinderhulk Lee or Vi. You generally only pick these champs when your team is super AP heavy already and you want to discourage MR stacking or when you need more early game on your team. In either case Warrior is a far better pick up than Cinderhulk.","replies":[]}]},{"poster":"ArkenStorm","date":"2015-06-29T17:34:31.662+0000","up_votes":1,"down_votes":0,"body":"I think shen with devourer is much better, at least in my elo. helps with faster clear because passive procs and more damage, This is my end build, with changes game to game obviously.\n{{item:3718}} {{item:3153}} {{item:3143}} {{item:3065}} {{item:3111}} {{item:3083}}","replies":[]},{"poster":"I Miss Cannon","date":"2015-06-29T16:34:14.888+0000","up_votes":1,"down_votes":0,"body":"The thing is that Vi can build Cinderhulk + Black Cleaver (i usually go Chilling Smite - Phage - Cinderhulk - Black Cleaver - Tank) and she'll still deal enough damage to do her job as anti-carry (Ultimate + Q + 2 AA's and a squishy is nearly dead). Warrior just gives you a stronger mid-game-powerspike while Cinderhulk makes you a better Lategame-Tank. Same counts for Xin expect he doesn't go Black Cleaver i guess.","replies":[]}]}]},{"poster":"Father Cthulhu","date":"2015-06-29T04:35:55.554+0000","up_votes":1,"down_votes":0,"body":"Auto Attack enhancers like Rengar Q or Shyv Q don't proc more than once from the new Devourer, though.","replies":[{"poster":"LankPants","date":"2015-06-29T04:40:14.131+0000","up_votes":1,"down_votes":0,"body":">Auto Attack enhancers like Rengar Q or Shyv Q don't proc more than once from the new Devourer, though.\n\nShyv's Q doesn't proc twice. The CD effect on Q, damage and duration on W, damage on E and Fury generation on R all do proc from a second hit though.","replies":[]}]}]},{"poster":"Kahti","date":"2015-06-29T02:46:52.150+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Verxint","date":"2015-06-29T02:54:59.411+0000","up_votes":1,"down_votes":0,"body":"Not quite... He just gets his thwop every other attack once he triggers the first one. But the damage doesn't double-apply on a single attack.","replies":[]}]}]}]}]},{"poster":"Icestar1186","date":"2015-06-28T22:50:56.207+0000","up_votes":8,"down_votes":0,"body":"{{champion:161}}","replies":[]},{"poster":"Silents429","date":"2015-06-29T07:14:08.432+0000","up_votes":6,"down_votes":0,"body":"Because balancing this game is hard to do, the butterfly effect is massive, and buffs need to be gradual to find a good ground. It's mentioned before they need results from live servers to get a better understanding on changes as well.\n\nSame as nerfing, only people act like a nerf means the end of the champion giving the impression it's overboard and the champion is now unusable (Which I will admit has occurred with some champions, but some for good reason {{champion:2}} {{champion:78}} {{champion:19}} )\n\nIf you are insisting every champion in this game is either overpowered or underpowered, you are very much wrong however.\n\nFor example, If we buff a champion, this champions buff could result in a rise of that champion, making him a FoTM, causing his counters, or champions that work well with him to also rise too, along with items suddenly being used different, maybe the buff made a certain item really strong on said champion, maybe because of his counters rising a certain item does well against this champion, and it continues branching out all over the place.\n\nI don't think people realize that the slightest of changes to a champion aren't just in a boxed environment, league is a massive ass constantly changing ecosystem, and it's impossible to keep anything consistent and balanced without causing a problem someplace else.","replies":[{"poster":"Sachabot","date":"2015-06-29T13:06:14.600+0000","up_votes":1,"down_votes":0,"body":"^^^^\nSomeone said it. Every fucking game on the planet does balancing like this. There's not a single proposed way that works better for game health.","replies":[]}]},{"poster":"Saianna","date":"2015-06-28T22:50:11.922+0000","up_votes":5,"down_votes":1,"body":"Warwick is the best example of Riots way of dealing with things:\n\n1. Warwick became OP with new devourer\n2. Nerf Warwick EXTREMALY hard\n3. Nerf devourer\n4. Leave Warwick sulking in corner","replies":[]},{"poster":"Mandang0","date":"2015-06-29T01:46:28.488+0000","up_votes":2,"down_votes":0,"body":"The problem is that Riot needs to convince players that they're actually making a difference, even if they're not.\n\nHonestly, most of the times people declare a champion \"dead\" or \"gutted\", they're still fine.  There are players today who still whine about 'Olaf'ing, all while Olaf sees play in professional leagues.  This is probably half of the problem, that Riot can't convince players that champions are actually closer to balanced than they're perceived, so Riot has to chain a string of nerfs/buffs together to finally sell that champ back to the playerbase.  Then again, when Riot lovetaps champions, it's no surprise they have to nerf them again afterward (like how Riot took over a year to balance Kassadin even though he was permaban the entire time in all regions).","replies":[{"poster":"Shroom Junkie","date":"2015-06-29T02:34:18.831+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Mandang0,realm=NA,application-id=3ErqAdtq,discussion-id=u9yKopq1,comment-id=0005,timestamp=2015-06-29T01:46:28.488+0000)\n>\n> The problem is that Riot needs to convince players that they're actually making a difference, even if they're not.\n> \n> Honestly, most of the times people declare a champion \"dead\" or \"gutted\", they're still fine.  There are players today who still whine about 'Olaf'ing, all while Olaf sees play in professional leagues.  This is probably half of the problem, that Riot can't convince players that champions are actually closer to balanced than they're perceived, so Riot has to chain a string of nerfs/buffs together to finally sell that champ back to the playerbase.  Then again, when Riot lovetaps champions, it's no surprise they have to nerf them again afterward (like how Riot took over a year to balance Kassadin even though he was permaban the entire time in all regions).\n\nPersonally I think Olaf is completely balanced. I don't get people who say he's OP or underpowered, especially underpowered, but that might just be my opinion.\n\nHowever Kassadin I do find completely useless. I've just never seen him do good, but it seems like before they nerfed him he was pretty OP.","replies":[{"poster":"YumaS2Astral","date":"2015-06-29T03:07:27.443+0000","up_votes":1,"down_votes":0,"body":"Kassadin was so OP when he had his silence, that he was banned 90% of time. Pre-rework Kassadin was possibly the most broken and powerful champion in the game, barring patch 4:20 Warwick, which was possibly the only champion that can be compared to Pre-rework Kassadin in terms of how broken and powerful he was.\n\nPeople that are starting to play League recently will possibly never know how broken Kassadin and Warwick used to be.","replies":[{"poster":"Sachabot","date":"2015-06-29T13:08:07.383+0000","up_votes":1,"down_votes":0,"body":"Really? I guess we're still not talking pre-rework Jax, who could achieve carry-level mixed damage with tank-level defense at the same time. As in, every decent Jax did that every game. I wasn't high enough to play ranked at the time, so I can't tell you about bans rates, but that was some BS.","replies":[{"poster":"ArkenStorm","date":"2015-06-29T17:36:14.488+0000","up_votes":1,"down_votes":0,"body":"oh did I love playing as that and curse the day I played against it. Jax built bork + trinity +full tank and never died and deleted people as fast or faster than zed before nerfs","replies":[{"poster":"Sachabot","date":"2015-06-30T00:31:58.161+0000","up_votes":1,"down_votes":0,"body":"No, we're talking further back. Before BoRK. I did Rageblade, Tabi, Tiamat, Rylai's, Gunblade, Atma's. If the game went that long, I'd sell my boots and buy Lichbane. And laugh as I crushed everyone underfoot.","replies":[]}]},{"poster":"Bodkins Odds","date":"2015-06-29T16:58:56.319+0000","up_votes":1,"down_votes":0,"body":"Nor release Xin Xhao.","replies":[{"poster":"Sachabot","date":"2015-06-30T00:30:46.923+0000","up_votes":1,"down_votes":0,"body":"Fair enough.","replies":[]}]}]}]}]},{"poster":"Leetri","date":"2015-06-29T05:52:49.885+0000","up_votes":1,"down_votes":0,"body":"Just like when Talon had his silence removed. \"omg just delete him from the game\", \"I want a refund\", \"might as well just remove him\" and so on. Guess what? Talon is still one of THE strongest assassins in the game.\nWhat annoys me to no end is when people say \"guess I'll stop playing (X)\" when Riot only nerfed their base MS by 5 or something small like that. People give up and make conclusions before they even try it or at the very least see it in game.","replies":[{"poster":"ArkenStorm","date":"2015-06-29T17:36:28.176+0000","up_votes":1,"down_votes":0,"body":"seriously though","replies":[]}]}]},{"poster":"Toru Itai","date":"2015-06-29T11:51:12.171+0000","up_votes":2,"down_votes":1,"body":"i played Sion as a melee adc, so i found that rework to be a compleate failure.","replies":[{"poster":"SnugglePuggle94","date":"2015-06-29T12:36:17.353+0000","up_votes":3,"down_votes":3,"body":"Cause Sion is not an adc bud. Take him top or jungle and he is not a failure.","replies":[{"poster":"Toru Itai","date":"2015-12-26T13:42:11.201+0000","up_votes":1,"down_votes":0,"body":"i took him top or jungle. \nand he could be played like an adc(not marksman) because 3 of his skills helped him do it.\nRanged targeted stun: to help him get to people\ndamage/max health:deal more damage / survive burst\n100% Lifesteal and50% attackspeed: to survive in team fights as a melee adc(think Yi Q)","replies":[]}]}]},{"poster":"Stugots","date":"2015-06-30T19:41:05.783+0000","up_votes":1,"down_votes":0,"body":"People seem to forget about runes / mastery and passives, i think it's what breaks this game a bit too much. Builds are fun and all but they don't belong in a MOBA, i only play LoL due to friends playing it and I would much rather play Dota or HoN due to the sheer balance of them games being more complete. What do they do that LoL doesn't, they don't have these bs runes / passives ( 5th skill ) and mastery.","replies":[]},{"poster":"Ancestor007","date":"2015-06-29T19:42:26.893+0000","up_votes":1,"down_votes":0,"body":"{{champion:161}}","replies":[{"poster":"Partholonian","date":"2015-06-30T00:09:03.961+0000","up_votes":1,"down_votes":0,"body":"His problem is he's balanced.  He actually has weaknesses as well as strengths, so why play him when you could be on some mobile manaless assassin?","replies":[{"poster":"JustMyBassCannon","date":"2015-06-30T00:09:27.913+0000","up_votes":1,"down_votes":0,"body":"Because it's very satisfying to fuck over said mobile manaless assassin by being a smarter player.","replies":[]}]}]},{"poster":"ShaftyMegee","date":"2015-06-29T00:45:19.429+0000","up_votes":1,"down_votes":0,"body":"There areally many sleeper op champs Mr OP","replies":[{"poster":"Shroom Junkie","date":"2015-06-29T00:53:18.860+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SanicSenpai,realm=NA,application-id=3ErqAdtq,discussion-id=u9yKopq1,comment-id=0004,timestamp=2015-06-29T00:45:19.429+0000)\n>\n> There areally many sleeper op champs Mr OP\n\nReally?\nSo, Jax wasn't OP on release? From what I hear, due to Dodge, he could just sit in the enemy's fountain for over a minute and not die, and basically rendered all AD champs' AA's null against him except for their abilities.\nWas that not OP? Obviously there have been other champions in which have been OP. Ryze was OP last patch, with a full 12 second root rendering most melee champs(with the exception of Kayle) useless until the root wore off.","replies":[{"poster":"ShaftyMegee","date":"2015-06-29T00:57:42.767+0000","up_votes":1,"down_votes":0,"body":"Don't get your wad bunched up in your pants OP, I'm not here to argue. I'm simply stating that there are many strong champs that aren't complained about cus they aren't the flavor of the month due to the lcs","replies":[{"poster":"Shroom Junkie","date":"2015-06-29T01:00:51.158+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SanicSenpai,realm=NA,application-id=3ErqAdtq,discussion-id=u9yKopq1,comment-id=000400000000,timestamp=2015-06-29T00:57:42.767+0000)\n>\n> Don't get your wad bunched up in your pants OP, I'm not here to argue. I'm simply stating that there are many strong champs that aren't complained about cus they aren't the flavor of the month due to the lcs\n\nAh, I see. So you're saying there are OP champs that aren't very popular, such as Yorick or Mordekaiser or whatever.","replies":[{"poster":"Bodkins Odds","date":"2015-06-29T17:00:05.987+0000","up_votes":1,"down_votes":0,"body":"Don't tell people that Yorick is OP. I have a friend who plays Yorick and I don't want to face any more of him.","replies":[]}]}]}]}]},{"poster":"Dengeden","date":"2015-06-29T08:21:58.671+0000","up_votes":1,"down_votes":0,"body":"You could also say that they only gradually balance champions instead of giving them some huge change that either make or breaks the champion... \n\nOn the other hand, please nourish the community's superiority complex over Riot more.","replies":[]},{"poster":"Arch Mage Magnus","date":"2015-06-29T07:33:24.813+0000","up_votes":1,"down_votes":0,"body":"The only champ Riot ever made that was balanced with Vel Koz. Whoever designed that champ needs a vacation. Sion himself had like 4 or so balance changes after the re-work, so that isn't even very successful.","replies":[]}]}