{"poster":"Shroom Junkie","date":"2015-07-05T23:48:30.512+0000","title":"Can we please nerf Cho'gath's kit?","subforum":"Gameplay","up_votes":3,"down_votes":29,"body":"EDIT: Downvoted within 10 seconds of post. Please people, read the damn post instead of just saying, \"uh oh hate downvoted\"\n\nSeriously, Rito, Cho&#039;gath is just so OP, and he&#039;s just not played that frequently so people don&#039;t give two fucks about him until they play against him, but here&#039;s his kit in a nut shell, and don&#039;t even think about denying it because you can just go right over to the wiki and see for yourself.\n\nPassive - Constant sustain through farming, making almost all poke null and void except the major constant poke like, say, Karthus. Even then he negates most of it with this.\n\nQ- A big-ass, long range AOE that you can&#039;t walk out of without boots(even then), that knocks you up then slows you and deals a metric fuckton of damage with or without AP(80/135/190/245/305(+ 100% AP)).\n\nW - Another big-ass AOE that you don&#039;t need to walk out of because its instant, that silences you for **2.5 seconds**(one of the longest silences in the game, excluding Rumble&#039;s self-silence passive- plus, its AOE which is just maddening).\n\nE - Constant, free poke that buffs his AA&#039;s so he can also be fair in consistent combat even while building AP.\n\nR - Darius&#039;s ult minus the extra passive stacks addition that acts as more than a smite as well as Nunu Q at rank 1(level 6 minimum) and lets Cho&#039;gath be naturally tanky by adding 90 - 900 health that can be halfed and then restacked every 40 fucking seconds if he dies.\n\nHis base stats are, from level 1 to level 18:\n\n574 &ndash; 1934 Health\n8.9 &ndash; 23.4 Health Regen Per 5 Seconds\n272 &ndash; 952 Mana\n7.2 &ndash; 14.9 Mana Regen Per 5 Seconds\n61 &ndash; 133 Attack Damage\n0.625 (+0% &ndash; 24.5%) Attack Speed\n28.9 &ndash; 88.4 Armor\n32.1 &ndash; 53.4 Magic Resist\n345 Movement Speed\n\nNow let&#039;s compare them with, say, Renekton.\n\n572 &ndash; 2051 Health\n8.0 &ndash; 20.7 Health Regen Per 5 Seconds\nNo mana stats\n58 &ndash; 111 Attack Damage\n0.665 (+0% &ndash; 45.1%) Attack Speed\n25.6 &ndash; 90.2 Armor\n32.1 &ndash; 53.4 Magic Resist\n345 Movement Speed\n\nSo you&#039;re telling me that a CC highly-damaging tank with more early health than Renekton, a fighter that&#039;s supposed to be viable throughout the entire game, and just 117 less health at level 18, has a fuckload more health regen at all levels, has more base AD than a character meant to be AD, though a little less attack speed but whatever, he&#039;s AP and only his E is meant for AA(though its fucking annoying), has 3.3 more armor at level 1 than Renekton, and only 1.8 less at level 18, and the same amount of magic resist?\n\nSeriously, he has such good early game stats, and due to his high-base damage abilities and ultimate scales into the late game extremely well.\n\n\nCho&#039;gath&#039;s only weaknesses are major early burst damage(which is uncommon and has to do with the champion at hand instead of counterplay), major constant poke(again, not counterplay unless you&#039;re brave - or stupid - enough to get in range for a bunch of melee AA&#039;s, or if you&#039;re AP and just a moron trying to AA him for maybe 70 damage, probably less), his mobility which really isn&#039;t much of a factor due to his knockup-slow in an AOE as well as silence for flashing/dashing(minus Kalista), and his mana costs.\n\nHis greatest weakness is mana costs. And they for some fucked up reason want to give him 1.4 to 2.9 base mana regen per second and 3.25 - 7.75 mana every time he kills a minion, not even counting masteries for another 1 mana per minion if he takes it.\n\nAnd this guy isn&#039;t even like Sona.\nSona, she takes all the aspects of a support and jam-packs them into one champion. The problem? The factors are all a lot lower than other supports. She doesn&#039;t heal as much as Soraka, she doesn&#039;t CC as well as Thresh, doesn&#039;t initiate as well as Malphite or fall back as well as Janna, and doesn&#039;t poke as well as Nami, or Soraka, or whatever(however its much easier but whatever). However she does have a nice butt...\n\nYet Cho&#039;gath takes all the aspects of everyone and jam-packs them into one champion. The problem? He doesn&#039;t have mobility, and, oh goodie, has mana! Just like most of the champions on League! WOOHOO! Buffs rito pls.\n\nSo, he has large AOE(knockup, slow, silence), large damage(base, %AP/AD), a built-in mega smite, natural tankyness, natural lane sustain(health and mana), and high base stats. Oh and he&#039;s huge so he gets to be a meat shield as well which is always great for them squishies.\n\nSo let me answer some arguments I have no doubt will come forth.\n\n\"But he has high mana costs!\"\nBut he also has high mana regen!\n\n\"His abilities have long cooldowns.\"\nThey also do burst damage and CC the target!\n\n\"But his E doesn&#039;t do damage to towers!\"\nHonestly I&#039;m not sure if this is even true but whatever.\nBut he also has high base AD!\n\n\"But he doesn&#039;t have a good early game without his ult tankiness!\"\nBut he also has CC, his passive for sustain, his base regens, and he still deals a fuckton of damage especially for the level!\nOh yeah and post-6 it really doesn&#039;t matter because now he&#039;s getting tankier every 40 seconds, unless he&#039;s a noob that doesn&#039;t eat it or otherwise is saving it for a gank or all-in.\n\n\"But he doesn&#039;t have mobility!\"\nBut he also has AOE-CC to run as well as tankyness to survive most all-ins as long as he reaches tower!\nAnd yeah pretty much everyone before recent didn&#039;t have much mobility. It was like \"ooh hey kassadin! well fuck never gonna catch this guy.\"\n\n\"But he can be CC&#039;d!\"\nBut so can everyone else(excluding Alistar and Olaf and slows on Master Yi)!\nthere&#039;s this new thing called a quicksilver sash you should look it up\n\n\"But he doesn&#039;t have a nice butt!\"\nYeah but technically I don&#039;t think he has a butt at all. Or at least, none that&#039;s shown. Maybe its on his lower belly?\n\n\nSo, Rito, can we please remove something of his? I don&#039;t care if its his natural tankyness, or his huge damage, or his AOE, or his mega smite. I really don&#039;t give a fuck just please, nerf SOMETHING to make this guy at least semi-balanced.\n\n\nSo please, if you have any arguments to this please step forward and don&#039;t be a noob that&#039;s just like &#039;poof downvote bcuz&#039; or some shit.","replies":[{"poster":"LaceUp23","date":"2015-07-06T00:16:55.273+0000","up_votes":7,"down_votes":1,"body":"You weren't downvoted because \"uh oh hate downvoted\". You were downvoted because of your content. Cho's kit doesn't need nerfed at all. Sure, his silence is strong. But his Q is one of the easiest CCs to avoid in the game. You could certainly make a case that he is overtuned number wise, and I would even agree with it. But his kit doesn't need nerfed.\n\nWeaknesses: No mobility, hard to land CC, and he has very very high mana cost that can be abused if you deny him farm.","replies":[{"poster":"Angry Monster","date":"2015-07-06T02:03:11.662+0000","up_votes":1,"down_votes":2,"body":"you are aware by saying something is over tuned; that the only correction is a nerf, right? The nerf could be less damage, the AOE radius, health return, mana costs, health gained ect. Something has to get lower to correct a over-tune. \n\nLowering any effective part of the kit is a nerf. So the OP saying he needs a nerf, you are agreeing with him.","replies":[{"poster":"LaceUp23","date":"2015-07-06T09:52:21.353+0000","up_votes":1,"down_votes":1,"body":"No. There is a difference between saying his kit needs nerfed because it contains to much and saying his numbers might need a bit of a nerf. If you don't understand, I'm not sure what to tell you.","replies":[{"poster":"Angry Monster","date":"2015-07-06T15:27:35.322+0000","up_votes":1,"down_votes":0,"body":"sry nerf is a nerf. You can disagree on the scope but you are on the same point. \n\nif you can not understand that, I do not know what to tell you.","replies":[]}]}]},{"poster":"CreationFlaw","date":"2015-07-06T07:13:05.832+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=LaceUp23,realm=NA,application-id=3ErqAdtq,discussion-id=kUxHlMuG,comment-id=0001,timestamp=2015-07-06T00:16:55.273+0000)\n>\n> You weren't downvoted because \"uh oh hate downvoted\". You were downvoted because of your content. Cho's kit doesn't need nerfed at all. Sure, his silence is strong. But his Q is one of the easiest CCs to avoid in the game. You could certainly make a case that he is overtuned number wise, and I would even agree with it. But his kit doesn't need nerfed.\n> \n> Weaknesses: No mobility, hard to land CC, and he has very very high mana cost that can be abused if you deny him farm.\n\nMost of that sounds like veigar. But his cc is also 1:1 scaling with a slow and his true damage scales off of AP.","replies":[]}]},{"poster":"khorney","date":"2015-07-06T01:01:50.975+0000","up_votes":1,"down_votes":2,"body":"Yawn fed ap varus kills him in 1 sec so how is cho op again","replies":[{"poster":"NemeBro","date":"2015-07-06T02:56:29.582+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=khorney,realm=NA,application-id=3ErqAdtq,discussion-id=kUxHlMuG,comment-id=0007,timestamp=2015-07-06T01:01:50.975+0000)\n>\n> Yawn fed ap varus kills him in 1 sec so how is cho op again\n\nAnd a fed Cho can kill an AP Varus just as easily, while offering more to his team.\n\nAlmost any champion when fed can kill a champ that isn't also fed.","replies":[]},{"poster":"Lugg","date":"2015-07-06T02:41:18.581+0000","up_votes":1,"down_votes":0,"body":"Fed AP Varus kills everyone. Try again.","replies":[{"poster":"khorney","date":"2015-07-06T03:23:17.981+0000","up_votes":1,"down_votes":2,"body":"Ty let's see if he understands that lol it's like what vayne does only 10x stronger lol plus if you build runaans you melt cs","replies":[]}]}]},{"poster":"Sona Ping","date":"2015-07-06T01:01:44.384+0000","up_votes":3,"down_votes":0,"body":"When people read \"Can we please nerf Cho'gath's kit?\"  they don't think:\n \"uh oh hate downvoted\"\n\nThey think: \"This guy has no idea what he is talking about.\", an idea which is soon confirmed by reading even a third of the wall you wrote. And when they do read your post and  it's a champion like Cho'gath, who if anything would be better off with the quality of his abilities buffed, and that wall of text that is just a list of the champs abilities and self-satisfied insults, they think \"This kid's just bitter and complaining because he keeps losing lane.\"\nTo Cho'gath, out of everyone.","replies":[]},{"poster":"Cedaelic","date":"2015-07-06T00:44:47.298+0000","up_votes":3,"down_votes":0,"body":"You do know his Q is easy as hell to dodge, right?\n\nYou have to be a blind chicken playing on a mouse pad to not dodge that.","replies":[]},{"poster":"Droogzy","date":"2015-07-06T01:57:28.252+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Coriandr,realm=NA,application-id=3ErqAdtq,discussion-id=kUxHlMuG,comment-id=,timestamp=2015-07-05T23:48:30.512+0000)\n\n> So you&#039;re telling me that a CC highly-damaging tank with more early health than Renekton, a fighter that&#039;s supposed to be viable throughout the entire game\n\nI was willing to consider your argument until you told me Renekton is viable throughout an entire game.\n\nNot even close to true in the slightest.\n\nCho'Gath is slow as hell and goes OOM insanely fast in the early game from 1-3 if he tries to trade with you. You literally can beat the crap out of him from 1-3 without any repercussions. \n\nYou talk about how no one has burst at 1-3, partially true, but you don't need burst at that level, you literally punish him repeatedly and the only thing he has to keep him going in the lane is his passive. \n\nHis knock up is incredibly telegraph and can be avoided the moment you get boots even if you're caught in the center. He's only going to get his silence off if he lands his knock up on you. ","replies":[{"poster":"Orbv","date":"2015-07-06T15:15:57.760+0000","up_votes":1,"down_votes":0,"body":"The be fair, the best combo Cho can get is with Rylai's.\n\nSilence (instant slow and silence) followed by rupture, and then feast. It's near impossible to avoid.","replies":[]},{"poster":"Lugg","date":"2015-07-06T02:40:37.834+0000","up_votes":1,"down_votes":3,"body":"Cho has one of the higher base movement speeds in the game. Cho rarely goes OOM thanks to his God level passive. If you go in to trade with him, you lose the majority of the time thanks to his silence, knockup and free harass from his AAs. He completely zones melee champions out of CS. The ONLY champions that can do anything to him have long range and they go OOM before they can actually kill him.","replies":[]}]},{"poster":"Icestar1186","date":"2015-07-06T00:44:55.373+0000","up_votes":2,"down_votes":0,"body":"You can make any champion sound broken if you try.\nAatrox has a revive passive that gives him free attack speed, a knockup gap closer, no mana costs, a ton of free sustain scaling off of his AD or bonus damage on every few autos, a slow skillshot that he can use for harass, and a ton more free attack speed on his ult.\nHe's also possibly the weakest meta toplaner in the game.","replies":[]},{"poster":"3TWarrior","date":"2015-07-06T00:09:56.399+0000","up_votes":3,"down_votes":1,"body":"well, unfortunately what makes chogath balanced in practice is that his tank stats are the weakest against all in champs and skirmishers\n\nhis high damage but high cooldowns make it an ineffective battle against another tank as well, take amumu for example, who can all-in chogath and take practically no damage in return while more than likely getting a kill\n\njax can negate a certain percent of all AOE damage done to him while his E is active, then stun chogath and proceed to whack his hp\n\nchampions that outrange chogath can easily poke down his hp (that is, unless they're twisted fate...why riot, why...)\n\nas for the comparison of renekton to chogath, chogath is supposed to be a tanky mage who is good at engaging but bad at getting engaged.  you may now kiss your butt goodbye XD\n\nrenekton, however, is meant exclusively to be a skirmisher who can quickly change targets, but with a lack of range, he can't match the current meta's demands\n\nfor instance, renekton against chogath can activate his dash ability to get out of its range instantly\n\nI had a very annoying match playing as chogath support(yes, it's a thing) against a kalista because she was so mobile and could easily engage compared to her defensive capability of negating engages\n\nmainly, it depends upon how your laner plays against the chogath or how your chogath plays against theirs","replies":[{"poster":"rockdalian","date":"2015-07-06T14:59:06.239+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=3TWarrior,realm=NA,application-id=3ErqAdtq,discussion-id=kUxHlMuG,comment-id=0000,timestamp=2015-07-06T00:09:56.399+0000)\n>\n> well, unfortunately what makes chogath balanced in practice is that his tank stats are the weakest against all in champs and skirmishers\n> \n> his high damage but high cooldowns make it an ineffective battle against another tank as well, take amumu for example, who can all-in chogath and take practically no damage in return while more than likely getting a kill\n> \n> jax can negate a certain percent of all AOE damage done to him while his E is active, then stun chogath and proceed to whack his hp\n> \n> champions that outrange chogath can easily poke down his hp (that is, unless they're twisted fate...why riot, why...)\n> \n> as for the comparison of renekton to chogath, chogath is supposed to be a tanky mage who is good at engaging but bad at getting engaged.  you may now kiss your butt goodbye XD\n> \n> renekton, however, is meant exclusively to be a skirmisher who can quickly change targets, but with a lack of range, he can't match the current meta's demands\n> \n> for instance, renekton against chogath can activate his dash ability to get out of its range instantly\n> \n> I had a very annoying match playing as chogath support(yes, it's a thing) against a kalista because she was so mobile and could easily engage compared to her defensive capability of negating engages\n> \n> mainly, it depends upon how your laner plays against the chogath or how your chogath plays against theirs\n\nI've done support cho gath surprisingly effective if you manage your mana and get frozen heart after boots/sight stone/gold item it's just a very passive lane unless you all in or poke but never all in cuz you won't have mana","replies":[{"poster":"3TWarrior","date":"2015-07-06T15:36:08.447+0000","up_votes":1,"down_votes":0,"body":"actually, once you have even a semblance of items, it's fun to all in and take out 90% of the carry/support's hp with a full rotation of abilities and just walk out","replies":[]}]}]},{"poster":"Fashion Mage","date":"2015-07-06T14:20:04.279+0000","up_votes":1,"down_votes":0,"body":"He's certainly badly designed. When old Soraka still had her sustain, people were QQ'ing about it like there was no tomorrow. As for Cho'gath... :p","replies":[]},{"poster":"Calabok","date":"2015-07-06T01:54:09.357+0000","up_votes":1,"down_votes":0,"body":"I like him at mid. I always kill him.","replies":[]},{"poster":"Mannysmoker","date":"2015-07-06T00:39:05.684+0000","up_votes":1,"down_votes":0,"body":"{{champion:90}} has the longest silence in the game ( 3 seconds ) which can hit more than one person as well..\n\n{{champion:31}} has tons of raw damage, but the lack of any mobility makes for his high base and scaling damage...also his cooldowns are quite big which means he has to land spells to be useful otherwise he gonna be a walking sack of meat for like 15 seconds..","replies":[{"poster":"Lugg","date":"2015-07-06T02:47:24.230+0000","up_votes":1,"down_votes":2,"body":"Cho's silence is just a half second lower and it can hit multiple people MUCH easier than Malz's. \n\nWith max CDR, Cho's Q is 5 second CD and W 8 second CD time. Not sure where you come up with 15 seconds since all of his abilities are lower that that with no CDR.","replies":[]}]}]}