{"poster":"TrolB3sz","date":"2015-08-21T22:58:38.473+0000","title":"Chat Ban=nincs szezon végi jutalom...","subforum":"Általános beszélgetés","up_votes":1,"down_votes":2,"body":"Ez igaz hogy ha volt chatbannod akkor nem kapunk jutalmakat szezon v&eacute;g&eacute;re???? egyszer sz&oacute;ltam be valakinek (el&eacute;gg&eacute; jogosan) kaptam a 75 meccses chatbannt. emiatt nem kapok? ez komoly? ..{{item:3070}}  {{item:3070}}","replies":[{"poster":"YiJaegar","date":"2015-08-22T07:08:29.895+0000","up_votes":1,"down_votes":0,"body":"Nincs jogos beszólás....\nBeszóltál büntetés jár érte, máskor majd meggondolod 2x is hogy megéri-e flamelni/szájkaratézni.","replies":[{"poster":"TrolB3sz","date":"2015-08-27T10:41:18.361+0000","up_votes":1,"down_votes":0,"body":"Tudod amikor anyámnak rákot kívánnak hárman csak visszaszólok....ha jól emlékszem ennyi volt EGÉSZ MECCSEN amit mondtam: Go sleep kids :D  Ha egy egész szezonon át dolgozol valamin és a VÉGÉN szólnak hogyha ezt-azt csináltál nem kapod meg a jutalmat az szar érzés de lemerem fogadni akik nem érdemelték mert mert boostoltatták magukat...De mindegy felhúzom akkor a kisebb accom még :) {{summoner:6}}","replies":[{"poster":"YiJaegar","date":"2015-08-30T07:26:16.896+0000","up_votes":1,"down_votes":0,"body":"Mutolod és reportolod játék végén és azért már 1-2 report után is bant kap, ha vissza szólsz egy szinten vagy vele...\n\nAz is sértegetés megérdemelted ez már tavaly is így volt, hogy a flamerek rendre nem kapták meg és ez így van rendjén.","replies":[]}]}]},{"poster":"Gotisho","date":"2015-08-22T10:59:46.202+0000","up_votes":1,"down_votes":0,"body":"Picit visszavettek a jutalomkorlátozásból:\nRiot Lyte:\n\nAzok akiknek a szezon végére nem lesz chat/ranked restriction akkor megkapják a jutalmakat.\nForrás: \"Players that have reformed and DO NOT HAVE Chat or Ranked Restrictions by Season end will still get Ranked Rewards\"\nViszont akik kaptak 7 naptól 14 napig terjedő bant toxikus viselkedés miatt az 5. szezonban azok nem fognak kapni semmilyen jutalmat\nForrás: \"Players that have been game banned for 7-14 days for excessive toxicity at any point during the 2015 Season will not get rewards\"","replies":[]},{"poster":"Vasipari Béla","date":"2015-08-21T23:38:04.220+0000","up_votes":1,"down_votes":0,"body":"Írtam az előbb erről egy posztot, ide is ezt tudom idézni:\n\n\"\nValószínűleg közösségi nyomásra enyhítenek a dolgon:\nCsak a 7-14 napos bant kapókat, visszaeső csevegési/rangsorolt korlátozottakat, valamint a többszörösen 20 perces várólistát kapókat fosztják meg a jutalmaktól\nForrás: https://www.reddit.com/r/leagueoflegends/comments/3hueeq/ranked_restriction_chat_restriction_and_game/\n\"","replies":[]},{"poster":"Vérontó","date":"2015-08-21T23:01:38.503+0000","up_votes":1,"down_votes":0,"body":"Hogyan sikerült úgy beszólnod hogy 75 meccseset kaptál?\nÚgy tudom ha jó magatartást mutatsz van esélyed az ajándékra úgy emlékszem tavaly is így volt.","replies":[{"poster":"R3wan","date":"2015-08-21T23:05:48.849+0000","up_votes":1,"down_votes":0,"body":"Biztos nem a beszólás mértéke volt durva, hanem a mennyisége. Egy kihágásért nem osztanak bant.","replies":[]}]}]}