{"poster":"Multidissimo","date":"2019-06-01T14:51:25.320+0000","title":"[Community/Family Friendly] Multidissimo startet neuen Kanal!","subforum":"Streams & YouTube","embed":{"description":"Welcome to MultiEUW's channel on Twitch. Watch them stream League of Legends and other content live and join the community!","url":"https://twitch.tv/MultiEUW","image":"https://static-cdn.jtvnw.net/jtv_user_pictures/8240a9d2-ce11-49c0-9b77-18647caa0a40-profile_image-300x300.png"},"up_votes":1,"down_votes":0,"body":"​Hallo Leute :)​​​\r\n\r\n\r\nSeit 1 Monat streame ich nun auf meinem neuen [Kanal \"MultiEUW\"](https://twitch.tv/MultiEUW)​. Auf Twitch bin ich ein alter Hase. Bereits seit April 2014 habe ich dort nämlich gestreamt. Zuerst unter dem Namen \"MultidissimoTV\" bzw. dann umbenannt in \"Multidissimo\". Diesen habe ich jedoch aufgegeben, da ich mein Main Game immer wieder gewechselt habe. Hin und wieder war dies auch League of Legends. So habe ich über die Jahre zwar über 25'000 Follower bekommen, jedoch keine wirklich bleibenden Zuschauer, was mir meine Motivation nach und nach genommen hat.\r\n\r\n\r\nMit dem Kanal MultiEUW mache ich einen Neustart und möchte mich nur noch auf LoL fokussieren. Bisher macht es mir super viel Spass und ich hoffe, auch dich bald im Chat begrüssen zu dürfen. Was bei meinen Streams etwas anders als bei den meisten ist, ist dass ich jeweils gleichzeitig auf [Twitch](https://twitch.tv/MultiEUW)​, [Mixer](https://mixer.com/MultiEUW)​ und [YouTube](https://bit.ly/2JbJ9s7)​ streame. Das hat verschiedene Gründe: Twitch kennen die meisten + ist LoL dort am beliebtesten, Mixer hat keine Verzögerung und YouTube finde ich am angenehmsten um vergangene Streams zu schauen. So dürfte für jeden etwas dabei sein.\r\n\r\n\r\n\r\nAuch möchte ich grundsätzlich erstmal keine Spenden, Subs usw. annehmen. Mir geht es rein darum, mit euch zu zocken und meine Plays mit euch zu teilen oder irgendwie festzuhalten. Auch wenn wenn ich mal ein schlechtes Game habe, bleibe ich cool und flame nicht. Toxische Leute oder solche die mit AFK drohen, wenn man einen Gank verkackt haben bei mir nichts zu suchen. Ja, ich bin Jungle Main, spiele aber auch gerne auf anderen Lanes - eher der Casual Spieler halt. Spieltechnisch bin ich absolut kein Profi und will es auch nicht sein. Mir geht es darum, Spass zu haben und aus Fehlern zu lernen.\r\n\r\n\r\nHier eine Übersicht an Champions die es bei mir zu sehen gibt:\r\n\r\nTop: {{champion:86}} {{champion:75}} {{champion:133}} \r\nJungle: {{champion:32}} {{champion:131}} {{champion:28}} {{champion:9}} {{champion:79}} {{champion:24}} {{champion:11}} {{champion:76}} {{champion:56}} {{champion:2}} {{champion:107}} {{champion:102}} {{champion:19}} {{champion:5}} {{champion:121}} \r\nMid: {{champion:34}} {{champion:42}} {{champion:69}} {{champion:112}} {{champion:8}} \r\nADC: {{champion:22}} {{champion:51}} {{champion:21}} {{champion:18}} \r\nSupport: {{champion:25}} {{champion:1}} {{champion:37}} {{champion:99}} \r\n\r\nIch freue mich auf dich und wenn du auch mal mit mir oder anderen Leuten zocken möchtest, erwarte ich dich sehnsüchtig auf meinem [Discord Server](https://discord.gg/3w5TjPm)​​​.","replies":[{"poster":"m1Kézz","date":"2019-06-09T08:17:51.879+0000","up_votes":1,"down_votes":0,"body":"Viel Spaß und Glück!\nBedenke, dass wenn du später Twitch Partner bist nicht mehr gleichzeitig auf YT streamen darfst. Da gibt es Bedingungen soweit mit bekannt ist.\n\nGruß","replies":[]},{"poster":"Multidissimo","date":"2019-06-09T07:45:02.284+0000","up_votes":1,"down_votes":0,"body":"{{summoner:4}} \n\nTwitch: https://twitch.tv/MultiEUW\nMixer: https://mixer.com/MultiEUW\nYouTube: https://bit.ly/2JbJ9s7","replies":[]}]}