{"poster":"Silver Uma Jan","date":"2016-07-05T10:31:05.093+0000","title":"Leaver und Feeder","subforum":"Spielerverhalten & Moderation","up_votes":3,"down_votes":6,"body":"Ich finde es schade dass in League so viel geflamed wird ein paar freunde von mir leaven und feeden regelm&auml;&szlig;ig aber werden nie bestraft und finden dass lustig","replies":[{"poster":"Sirrkas","date":"2016-07-05T10:33:45.124+0000","up_votes":5,"down_votes":0,"body":"Erstmal ist flamen nicht gleichzeitig feeden und leaven. Zudem wird jedes dieser Vergehen von einem eigenen System geahndet. Dem Leaverbuster entkommen sie sicher nicht, das Instantfeedbacksystem reagiert auf ihren Flame, sobald sie in genug Spielen Reports gesammelt haben. Beim Feeden ist das System aber sehr konservativ eingestellt und es bestraft nur wirklich offensichtliche Fälle.","replies":[{"poster":"Freiherr Alex","date":"2016-07-05T10:49:53.329+0000","up_votes":2,"down_votes":2,"body":">sobald sie genug Reports gesammelt haben\n\ndiese aussage von nem grünen könnte nur zu noch mehr \"all Report riven\" führen...du solltest die Wortwahl vielleicht überdenken oder bearbeiten ;)","replies":[{"poster":"Sirrkas","date":"2016-07-05T20:03:04.301+0000","up_votes":3,"down_votes":0,"body":"Ich habe aber nicht vor in jedem Beitrag zum Meldesystem 3 Din-A4 Seiten zu posten, um möglichst viel abzudecken. Aber so sollte es besser sein.","replies":[]}]}]},{"poster":"Skagerak","date":"2016-07-05T11:12:20.534+0000","up_votes":3,"down_votes":0,"body":"Ich  finde das es echt noch zu viele Flamer gibt jedoch schon viel weniger als vorher und bei weitem flamen Sie nicht mehr so schlimm da macht Riot einen echt guten Job. Was feeder angeht, die meisten denken ja das jemand der 0/4 steht ein Feeder ist das muss aber nicht unbedingt stimmen die emisten die solche stats haben können es eben nicht besser oder haben grad ein schlechtes game. Ich hatte seid 1000 games keinen intentional feeder mehr und ich weiß  immer noch wer das war ein voli der am ende 0/25 stand. Ihr müsst einfach mal nicht so schnell tilten es gibt soviele games die durch tilten verloren werden weil Leute denken nur weil es nach 10 min 0/6 fürs Gegenerteam steht das game schon verloren ist. Die Warheit ist aber das oft ( nicht immer es gibt halt ghames die kann man net carrien damit muss man halt einfach zurecht kommen) das Tilten und Flamen das game verliert und nicht der Feeder. Ich hab fast jeden Tag ein game das ich wegen Tiltern verliere obwohl noch alles drin gewesen wäre.","replies":[{"poster":"Silver Uma Jan","date":"2016-07-05T11:33:20.969+0000","up_votes":2,"down_votes":4,"body":"ich habe jede 10te runde einen der 2/16 steht und wenn man sagt \"play def\" dann kommt gleich \"shut up\" dass nervt mich","replies":[{"poster":"Antiqui","date":"2016-07-05T12:50:02.604+0000","up_votes":4,"down_votes":0,"body":"Jemand der gerade zerstört wird, vermutlich hard gecountert wurde, eventuell dazu noch vom jungler gesittet wird weil wegen easy gold; wird ziemlich angefressen sein und wenn dann das team kommt mit \"Stop feed\" \"play def\" \"stop pushing\" etc. von leuten die auf ihren eigenen lanes sitzen bleiben, kommt einem vor wie ein tritt in die Eier.\n\nWenn du dir eh sicher bist (oder unsicher je nach ansichtweise) das der kommentar als beleidigung rüberkommt, SCHREIB NICHTS.\n\nWenn du unbedingt was schreiben musst versuche es damit: \"let em push to turret, i will come to an gank\". Und nicht nur sagen, sondern auch machen. Und das beste ist. Wenn der Gank erfolgreich wird, hast du nicht nur den Laner zurück ins spiel gebracht, du hast vor allem respekt gewonnen! Nicht nur bei deinem  Laner sondern auch des gegners. Denn wenn der Gegner weiß das er ungehindert agieren kann, wird er auch towerdiven und sonstigen Schabernack machen, aber wenn er befürchten muss sich dabei die Finger zu verbrennen, spielt er auch vorsichtiger. Und dein Kumpel kann ein paar Minions mehr farmen.","replies":[]},{"poster":"hshtagniemehrcdu","date":"2016-07-05T12:08:09.215+0000","up_votes":5,"down_votes":2,"body":"> [{quoted}](name=244982131,realm=EUW,application-id=KYnfKGf0,discussion-id=gMk0Azn4,comment-id=00030001,timestamp=2016-07-05T11:33:20.969+0000)\n>\n> ich habe jede 10te runde einen der 2/16 steht und wenn man sagt &quot;play def&quot; dann kommt gleich &quot;shut up&quot; dass nervt mich\n\nMit deinen Wertvollen Ratschlägen solltest du dich eventuell als LCS Coach bewerben.","replies":[]},{"poster":"Skagerak","date":"2016-07-05T12:13:40.057+0000","up_votes":3,"down_votes":0,"body":"Dann gewinne eben die andern 9 Runden es gibt keine Ausreden warum man nicht aufsteigt entweder man ist gut genug oder man ist es nicht.","replies":[]},{"poster":"Good Guy Putin","date":"2016-07-05T21:32:21.406+0000","up_votes":1,"down_votes":0,"body":"Du hast dem Spieler auch nichts vorzuschreiben. Manche sind halt schlechter. Und als ob die schlechten Stats nicht reichen würde und man eh schon frustriert ist kommt da irgendein hans und meint , dass man mal defensiver spielen sollte. Da kannst du nicht erwarten ne freundliche Antwort zu bekommen.","replies":[]}]},{"poster":"Peettrane","date":"2016-07-05T11:24:45.222+0000","up_votes":1,"down_votes":3,"body":"Amen Bruder. Da haste vollkommen recht.","replies":[]}]},{"poster":"Peettrane","date":"2016-07-05T11:08:50.521+0000","up_votes":3,"down_votes":0,"body":"Ich finde die \"Feeder\" und Leaver bei weitem nicht so schlimm wie die Flamer... \n\nFeeder kann jeder werden, das heißt nicht das man es mit Absicht macht. Ein oder 2 Kills und es kommt zum Snowballen. \n\nWas mich nervt sind die Flamer... Wenn man was falsch macht die dann gleich an die Decke gehen. Mal nen Minion erwischt als Supporter und gleich geht's \"ist das dein Ernst\" oder man wird 5 mal zurück gepingt...  Solche Leute sollten erstmal ne Runde um den Block laufen oder bis zum nächsten Tag pausieren.","replies":[{"poster":"Uranbrennstab","date":"2016-07-06T11:08:07.128+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Peettrane,realm=EUW,application-id=KYnfKGf0,discussion-id=gMk0Azn4,comment-id=0002,timestamp=2016-07-05T11:08:50.521+0000)\n>\n> Ich finde die &quot;Feeder&quot; und Leaver bei weitem nicht so schlimm wie die Flamer... \n> \n> Feeder kann jeder werden, das heißt nicht das man es mit Absicht macht. Ein oder 2 Kills und es kommt zum Snowballen. \n> \n> Was mich nervt sind die Flamer... Wenn man was falsch macht die dann gleich an die Decke gehen. Mal nen Minion erwischt als Supporter und gleich geht&#x27;s &quot;ist das dein Ernst&quot; oder man wird 5 mal zurück gepingt...  Solche Leute sollten erstmal ne Runde um den Block laufen oder bis zum nächsten Tag pausieren.\n\nOder du greifst nicht die Minions an. Warum auch? Die Champion Modelle sind groß genug und der Attackmove bevorzugt im Zweifel den Champion.","replies":[]}]},{"poster":"Time2Whine","date":"2016-07-05T19:07:08.737+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=244982131,realm=EUW,application-id=KYnfKGf0,discussion-id=gMk0Azn4,comment-id=,timestamp=2016-07-05T10:31:05.093+0000)\n>\n> Ich finde es schade dass in League so viel geflamed wird ein paar freunde von mir leaven und feeden regelm&amp;auml;&amp;szlig;ig aber werden nie bestraft und finden dass lustig\n\nRichtig tolle Freunde hast du. Solchen Leuten hätte ich schon längst mal die Meinung gegeigt. {{sticker:zombie-brand-mindblown}}","replies":[{"poster":"Good Guy Putin","date":"2016-07-05T21:36:09.961+0000","up_votes":1,"down_votes":0,"body":"Naja oder er hat sich das nur ausgedacht. Der Leaverbuster erwischt jeden. Und sie feeden vllt auch unabsichtlich, haben aber trotzdem noch Spaß am Spiel und er flippt dafür aus.","replies":[]}]},{"poster":"Pointkiller","date":"2016-07-05T10:33:45.865+0000","up_votes":1,"down_votes":0,"body":"Ich komme aus GW2. Dort ist es nicht anders.","replies":[]}]}