{"poster":"Merion","date":"2015-10-02T00:24:00.746+0000","title":"Duda Reportes,","subforum":"Charlas Generales","up_votes":2,"down_votes":0,"body":"Me gustaria saber que pasa con los reportes que hago, ayer la pase muy mal en una partida tenia la noche para viciar y al terminar me acoste con lagrimas en los ojos de todo lo que me habia dicho un ADC en una Normal\r\nUno quiere jugar con toda la onda para divertirse para desconectar un rato del mundo y estan este tipo de personas bardeandote diciendote de todo...\r\nEncima no podes bloquearlos para no cruzartelos nunca mas, te los tenes que volver a ver en otra partida","replies":[{"poster":"LeonardoSB","date":"2015-10-02T04:06:03.294+0000","up_votes":1,"down_votes":0,"body":"te doy la solucion a tus problemas: es el comando \"/mute all\" o \"/ignore all\" obviamente sin las comillas, si bien el disfrute de un gran juego como es league of legends se ve afectado por las personas que te empareja en cada game, hay ciertas herramientas para disminuir el impacto negativo que tiene tu equipo hacia ti. si tienes pruebas de un comportamiento inapropiado de X jugador, ponte en contacto con soporte al jugador en la pagina oficial de riot games, adjunta las fotos o screenshots sacadas del juego (que generalmente es con la tecla F12) y envia tu denuncia a ellos, te responderán a los dias u horas dependiendo que tan ocupados estén.","replies":[]},{"poster":"Zikario Bastet","date":"2015-10-02T04:00:09.060+0000","up_votes":1,"down_votes":0,"body":"Al salir de la partida debes reportarlo con la opción correspondiente y con el nuevo sistema de seguro lo sancionaran, al momento que lo sancionen te llegara un aviso.","replies":[]},{"poster":"Rebkans","date":"2015-10-02T02:51:17.619+0000","up_votes":1,"down_votes":0,"body":"Hola mira, primero que nada, lamento mucho lo que te paso, la gente de este server ( no todos, obviamente) suele ser muy agresiva, pero eso no te tiene que afectar en lo mas minimo. Son solo gente inmadura ( por no decir otra cosa) que se creen superiores a los demas cuando en realidad son ellos mismos los que quedan mal, dan pena y hacen el ridiculo. Vos segui jugando,  que no te importe nada lo que diga algun flamer que solo se esconde  atras de una computadora. \n¿Sabes lo que podes hacer cuando te toque algun flamer? Mutearlos durante la partida y no te molestes en dirigirle ni una palabra. Luego lo reportas cuando termine la partida y despues lo bloqueas. Eso es ki mejor que podes hacer. Los reports estan siendo efectivos ultimamente gracias al nuevo sistema de Riot, asi que no te preocupes que tarde o temprano, van a terminar baneados.\nEspero que estes mejor y sigas jugando, suerte!","replies":[]},{"poster":"BioTron","date":"2015-10-02T00:25:09.161+0000","up_votes":1,"down_votes":0,"body":"Si alguien te puede hacer llorar o cambiar tu estado de animo para mal solamente usando palabras, no juegues a esto :S","replies":[]}]}