{"poster":"iwannadolucyliu","date":"2017-11-01T15:39:14.448+0000","title":"wie lange wird der ravenborn leblanc skin noch erhältlich sein?","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"interesse f&uuml;r den skin ist da aber dann hab ich im leblanc reddit gelesen dass leblanc gereworked wird... schon wieder... und ich w&uuml;rd gern die neue leblanc spielen bevor ich den skin kaufe!","replies":[{"poster":"mondmann97","date":"2017-11-01T18:08:25.562+0000","up_votes":1,"down_votes":0,"body":"Wenn der Skin dir gefällt, würde ich ihn kaufen. Nach nem rework wird er nur besser aussehen und ich hab auch Skins von Champions die ich nie/sehr selten spiele, da sie mir nunmal gefallen.","replies":[{"poster":"iwannadolucyliu","date":"2017-11-01T21:30:04.764+0000","up_votes":1,"down_votes":0,"body":"es ist kein 100%rework, soweit ich das verstanden habe wird ihr E und ihr passiv verändert vielleicht auch ihr ulti weil irgendjemand (von riot) meinte \"lb habe keine langen coodlowns\" aber ich mag ihr E und ihren passiv und ihre low cooldowns. ich glaube nicht dass sie ein visuelles update bekommt","replies":[]}]},{"poster":"Pure Cynicism","date":"2017-11-01T17:16:11.718+0000","up_votes":1,"down_votes":0,"body":"Es stimmt, dass LeBlanc ein neues Rework erwartet. Vermutlich erfahren wir nach Release des Pre Season-Patches mehr dazu. Ravenborn gehört zu den Halloween-Skins und erscheint jedes Jahr.\n\nEdit: Wie gerade auf Reddit zu lesen ist, wird noch heute (amerikanischer Zeit) die neue LB auf den PBE gebracht. Falls das stimmen sollte, kannst du dir Morgen früh einen ersten Eindruck verschaffen.","replies":[]},{"poster":"404 Clone","date":"2017-11-01T16:32:29.331+0000","up_votes":1,"down_votes":0,"body":"1. Leblanc wurde schon lange her gereworked. Ich glaub das war jetzt knapp 1 Jahr her.\n2. Zählt der ravenborn leblanc skin zu den Halloween skins. Die Halloween skins sind bis zum 2. November erhältlich, also Morgen.\nUm welche Uhrzeit die Skins morgen verschwinden weiß ich leider nicht.","replies":[{"poster":"iwannadolucyliu","date":"2017-11-01T16:33:07.891+0000","up_votes":1,"down_votes":0,"body":"ja is n halloween skin, sehr ärgerlich","replies":[]}]}]}