{"poster":"JPizzle132","date":"2018-06-20T08:46:50.615+0000","title":"Riot's (Bad) Philosophy is Damage = Fun","subforum":"Gameplay","up_votes":78,"down_votes":9,"body":"Riot&#039;s philosophy of Damage = Fun can actually be tracked down to earlier more balanced seasons. Their reasoning for way back in the tank meta, just in one example, a full armor/health rammus doing half a squishies health (that was actually alot of damage back then) with one combo: Damage = Fun.\n\nIn other words they made tanks do a disproportionately unfair amount of damage, even ones that don&#039;t build any damage items whatsoever, because less people would play tank designed champions that are just damage soakers/cc bots. Can that not simply be what tanks are instead of needing a now 2000 true damage ult? (Cho'gath)\n\nHistory of just a few meta solutions Rito has had over my long time with this game:\nMages too weak? Introduce CDR items and runes so that they can constantly spam their abilities and put out more damage (at which point timing ult cooldowns to strategize around became practically irrelevant, now you just use ult, back, get in lane and ult is probably back up again).\nGames too long? Increased damage towards towers!\nTanks too strong? Increase damage with increased armor pen/magic pen, and later even more with true damage.\nADC&#039;s too strong now? We&#039;ll nerf crit, essentially INCREASING EARLY GAME DAMAGE (which is now the whole game btw) by making only lethality, high early game damage strategies viable.\n\nEdit: I should say I do have fun still in the game, but mostly just in the first 10 minutes trying to beat my lane opponent. By about 15 minutes it is very obvious whether we're absolutely stomping them or getting absolutely stomped. Absolutely stomping an opponent that I know just can't come back isn't that satisfying, and getting absolutely stomped is a terrible experience right now because you just can't come back. ","replies":[{"poster":"FrozenDeath14","date":"2018-06-20T09:25:50.283+0000","up_votes":51,"down_votes":5,"body":"This is just what kids want. \nAny veteran gamer would know a good defence is a good offence aswell but the community in ALL games has been infested by kids playing games above their age level. \n\nJust like GTA any normal gamer would know they get ripped off with shark cards.. kids don't care Parents pay.\nCoD any gamer know that supply drops rip you off kids dont care poppa pay.\nEA with microtransactions they don't care half the community has others pay for it. (Another example of damage creep is similar to a specialist in CoD:Bo3 Battery. One option has her with an active armor that sucks up at least 2-3 hits the other gives a grenade launcher that is only good vs campers. Guess which one is popular? Yeh the launcher guess which one the pro players use? The armor.)\n\nTake League now. Game is a shitty mess kids don't care they think they deserve to climb without improving and they think that the rigged matchmaking is just bad luck. It is not i have personally tested it for years with new accounts since i had access to an extreme ammount of accounts even legally and not.\n\nPromo is rigged. I used to be a masters level player at my prime peaking at 100lp masters playing vs mid range challengers (500-600LP players) wasnt doing spectacular but held my own and carried via macro.Whne i smurfed in gold/plat had 95%+ winrate but one thing was always certain promos would always be harder than actual high elo games and half of them had RQ's.\n\nSystem is rigged aswell. Every winstreak equals a losestreak. My old premade is currently plat 5 with diamond 3 mmr and he had 100% winrate for 2 days straight he got nonstop inters and dropped and entire 30% winrate he was making a joke about it with me on facebook.\nInters are not punished for the sake of keepign the grind going.Intentional feeders rarely get punished this was tested in SEASON 6 during SEPTEMBER where i INTENTIONALLY LOST a total ammount of 30 games in a row without a single punishment and i had clear signs of griefing in all my games ( yeh i was a dick ).Inters are kept (besides the extreme ones of running under tower constantly) so people will grind more game to climb to their wanted division.\n\nMeanwhile people who get fed up get banned because it drives away the soft hearted community. Clear sign of it was a Soraka wintrading on STREAM in a tyler 1 video AND another example on MIDBEAST stream a few days ago i think.","replies":[{"poster":"JPizzle132","date":"2018-06-20T10:03:34.082+0000","up_votes":15,"down_votes":1,"body":"Yea dude League microtrades and macro used to be like a chess game with counter-play and positioning. Now post 15 minutes you're full health and try to ward over a thick wall right outside your base cause you're behind, a blue kayn flies out of a wall and your screen is grey before you even see the triple lethality items duskblade proc'd one single auto that did your full health bar. \nNow instead of consistent skill shots, wave management and positioning, it's all about whoever gets killed from full health in 0.1 seconds after a lucky stun in laning phase first. Whoever does that first has the advantage in the team fight at 20 minutes that decides the game.\nThat game with Soraka was painful to watch :/","replies":[{"poster":"IDEMO NA MUDA","date":"2018-06-21T07:40:02.701+0000","up_votes":3,"down_votes":1,"body":"You're both so right. That's why this season is so frustrating to us, older players. I've been playing this game since season two and even with that god damn old GP the game was so much fun. Unlikely of now. Riot is going from one end to the other one. \"Where is macro game anymore Riot? You've destroyed the entire macro game once was!\" - Overfuckingbuffed Banner of Command - \"What the fuck Riot? Even ADCs now buy a fucking Banner this is a shitshow wtf!!!\" - Deletes Banner entirely from the game \n\"Tanks are fucking broken Riot do something about them nerf them so we can play against them!\" - 150% of the entire AD itemization got true damage / hp% damage / pen \n\"Mages are super weak riot what the fuck!\" - Allow us to introduce you, TrUe DaMaGe To MaGeS aS wElL","replies":[]}]},{"poster":"Naymliss","date":"2018-06-21T11:21:04.310+0000","up_votes":1,"down_votes":0,"body":"Side note: pro players didn't often take specialist weapons because they had longer times to to recharge versus specialist abilities in bo3","replies":[]}]},{"poster":"King Lego","date":"2018-06-20T12:16:28.193+0000","up_votes":15,"down_votes":3,"body":"I don't even know what philosophy is anymore.\n{{sticker:slayer-jinx-unamused}} \nAs someone who took a philosophy course in my university (freshman year), it makes me doubt that any rioter even learned what philosophy truly is. Not even the basic.\nIf that's their big intention and idea, then i finally understand why i hear \"fire the entire live design team\" so often.\nIs it bad if i'm starting to agree with that statement?!?","replies":[{"poster":"heroikc","date":"2018-06-20T15:57:39.301+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=King Lego,realm=EUNE,application-id=3ErqAdtq,discussion-id=BLx3cq4m,comment-id=0003,timestamp=2018-06-20T12:16:28.193+0000)\n>\n> I don&#x27;t even know what philosophy is anymore.\n> {{sticker:slayer-jinx-unamused}} \n> As someone who took a philosophy course in my university (freshman year), it makes me doubt that any rioter even learned what philosophy truly is. Not even the basic.\n> If that&#x27;s their big intention and idea, then i finally understand why i hear &quot;fire the entire live design team&quot; so often.\n> Is it bad if i&#x27;m starting to agree with that statement?!?\n\nNope; that's how the idea snowballs.  Ironic, isn't it?","replies":[{"poster":"King Lego","date":"2018-06-20T18:33:33.284+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=heroikc,realm=NA,application-id=3ErqAdtq,discussion-id=BLx3cq4m,comment-id=00030000,timestamp=2018-06-20T15:57:39.301+0000)\n>\n> Nope; that&#x27;s how the idea snowballs.  Ironic, isn&#x27;t it?\n\nKinda is, yeah...","replies":[]}]},{"poster":"IDEMO NA MUDA","date":"2018-06-21T07:41:58.088+0000","up_votes":1,"down_votes":1,"body":"As soon as you start to agree with \"fire balancing team\" too, you have been welcomed to the community good sir","replies":[{"poster":"King Lego","date":"2018-06-21T08:31:33.933+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Saint Lauren Don,realm=EUNE,application-id=3ErqAdtq,discussion-id=BLx3cq4m,comment-id=00030001,timestamp=2018-06-21T07:41:58.088+0000)\n>\n> As soon as you start to agree with &quot;fire balancing team&quot; too, you have been welcomed to the community good sir\n\nYet, I don't even know if i should welcome the welcome...the game is just so confusing that i don't know what's going on, what's true and what's false, etc.\n{{sticker:zombie-brand-clap}} {{sticker:zombie-brand-mindblown}}","replies":[{"poster":"IDEMO NA MUDA","date":"2018-06-21T08:56:13.330+0000","up_votes":1,"down_votes":1,"body":"Quite understandable. Community in this game is full of toxic wankers ( including myself, but rather frustrated to the fucking oblivion rather than just straight up toxic, in my case ) so if you're kind of a new player ( like, season or two played for now ) i HIGHLY recommend you to quit playing it and play something fun.","replies":[{"poster":"King Lego","date":"2018-06-21T10:09:03.508+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Saint Lauren Don,realm=EUNE,application-id=3ErqAdtq,discussion-id=BLx3cq4m,comment-id=0003000100000000,timestamp=2018-06-21T08:56:13.330+0000)\n>\n> Quite understandable. Community in this game is full of toxic wankers ( including myself, but rather frustrated to the fucking oblivion rather than just straight up toxic, in my case ) so if you&#x27;re kind of a new player ( like, season or two played for now ) i HIGHLY recommend you to quit playing it and play something fun.\n\nStarted Season 4.\nBut i'm not that new to the community much. Specifically boards.\nI know how the game works, but with the changes Riot is doing, it makes me question if they know what they are doing.\nRight now the answer to that question is starting to be a big \"NO!\" and the Galio Q disaster, Banner of Command disaster, etc. these are proof enough that they are clueless.","replies":[{"poster":"IDEMO NA MUDA","date":"2018-06-21T11:00:17.284+0000","up_votes":1,"down_votes":1,"body":"Completely agreed. Even tho Hashinshin is like, a toxic and stupid fella, he has extremely good balancing ideas.","replies":[{"poster":"King Lego","date":"2018-06-21T11:29:15.554+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Saint Lauren Don,realm=EUNE,application-id=3ErqAdtq,discussion-id=BLx3cq4m,comment-id=000300010000000000000000,timestamp=2018-06-21T11:00:17.284+0000)\n>\n> Completely agreed. Even tho Hashinshin is like, a toxic and stupid fella, he has extremely good balancing ideas.\n\nI don't know.\nI wouldn't trust him with such a thing, even though he makes valid points that even riot agrees upon.","replies":[]}]}]}]}]}]}]},{"poster":"hi ìm groot","date":"2018-06-20T16:43:11.958+0000","up_votes":9,"down_votes":3,"body":"Watchin sysbot play nidalee on youtube, he tries to gank a 0/1/0 renekton. Renekton flashes on him and 100-0's him during the stun duration, all he had was a tiamat XD\n\nHow is this shit acceptable?","replies":[{"poster":"Handin Out Naps","date":"2018-06-20T17:59:20.315+0000","up_votes":5,"down_votes":4,"body":"Well when you are getting hit by like 10 ranged minions, renek has ult/ignite, and you have 0 armor.  What exactly do you expect to happen as a squishy champ?","replies":[{"poster":"hi ìm groot","date":"2018-06-20T18:14:31.775+0000","up_votes":9,"down_votes":5,"body":"> [{quoted}](name=Handin Out Naps,realm=NA,application-id=3ErqAdtq,discussion-id=BLx3cq4m,comment-id=00080000,timestamp=2018-06-20T17:59:20.315+0000)\n>\n> Well when you are getting hit by like 10 ranged minions, renek has ult/ignite, and you have 0 armor.  What exactly do you expect to happen as a squishy champ?\n\nRight? Wtf was he thinking not going seekers armguard before finishing his jg item.","replies":[{"poster":"Azeranth","date":"2018-06-20T18:56:59.227+0000","up_votes":7,"down_votes":0,"body":"The better question is, what was he thinking ganking a renekton in a lane where Renekton had full control?","replies":[]},{"poster":"Handin Out Naps","date":"2018-06-20T18:34:39.969+0000","up_votes":3,"down_votes":2,"body":"Ah thats all you got out of that.  Oh well no point trying to explain anything to you then.  Have a good day.","replies":[{"poster":"hi ìm groot","date":"2018-06-20T18:39:55.777+0000","up_votes":4,"down_votes":4,"body":"> [{quoted}](name=Handin Out Naps,realm=NA,application-id=3ErqAdtq,discussion-id=BLx3cq4m,comment-id=0008000000000000,timestamp=2018-06-20T18:34:39.969+0000)\n>\n> Ah thats all you got out of that.  Oh well no point trying to explain anything to you then.  Have a good day.\n\nRofl you say he has no armor like armor was an option at that stage of the game. Like this is literally what people are complaining about and you're just ignoring it or not seeing it. Damages to high + defenses to low = situations like that. Last season that would have been a perfectly reasonable gank.","replies":[{"poster":"Handin Out Naps","date":"2018-06-20T20:26:53.610+0000","up_votes":7,"down_votes":1,"body":"Damn its really hard to not respond to this kind of foolishness.  Im more concerned about how you read Renek has ult/flash/ignite, has a huge minion wave with him, and nidalee is a squishy champion (has no armor) and just went straight for the \"oh sorry for not building seekers first item\" arguement.  \nLike what in the world.  If you are a squishy jungler and you are going to gank a champion like renekton with that big of a wave, ult, both sums up and a level up aswell.  You should be playing it way differently than that guy did.  You should not be in range to get flash stunned on, you should be out of range until he is in kill range.  The whole gank was a suicide mission and if you couldnt see that right away you just shouldnt be jungling.\n\nhttps://youtu.be/EVGRpLQII0I please skip to 7:13 and explain to me how in the world this looks like a good idea.  If you think this is a good idea, learn why it isnt or do your top laner a favor and just never gank his lane.","replies":[{"poster":"hi ìm groot","date":"2018-06-20T20:47:51.523+0000","up_votes":1,"down_votes":4,"body":"> [{quoted}](name=Handin Out Naps,realm=NA,application-id=3ErqAdtq,discussion-id=BLx3cq4m,comment-id=000800000000000000000000,timestamp=2018-06-20T20:26:53.610+0000)\n>\n> Damn its really hard to not respond to this kind of foolishness.  Im more concerned about how you read Renek has ult/flash/ignite, has a huge minion wave with him, and nidalee is a squishy champion (has no armor) and just went straight for the &quot;oh sorry for not building seekers first item&quot; arguement.  \n> Like what in the world.  If you are a squishy jungler and you are going to gank a champion like renekton with that big of a wave, ult, both sums up and a level up aswell.  You should be playing it way differently than that guy did.  You should not be in range to get flash stunned on, you should be out of range until he is in kill range.  The whole gank was a suicide mission and if you couldnt see that right away you just shouldnt be jungling.\n> \n> https://youtu.be/EVGRpLQII0I please skip to 7:13 and explain to me how in the world this looks like a good idea.  If you think this is a good idea, learn why it isnt or do your top laner a favor and just never gank his lane.\n\nLol like you can't even figure out what the topic is. Whether or not that gank is suicide is irrelevant. The point was WHY it was suicide, but idk, I dont think you'll ever really get the topic so whatever. If you think certain champs just should never be gankable unless you're a bruiser jungler thats fine, but damn man at least have some sense of what you're talking about lol. Like I said, that gank would have been perfectly reasonable last season, and the subject is... damage... this season... but I think that might've gone over your head  : /","replies":[{"poster":"Handin Out Naps","date":"2018-06-20T21:05:49.424+0000","up_votes":5,"down_votes":1,"body":"No.  It.  Wouldn't.  You would have died last season aswell.  Too many minions.  Renek has a lvl up.  Renek has everything up.  This screams bad idea and always has.  Look at the wave.  Stop talking about damage.  Never in the history of league has this ever been seen as a good idea.  Get it through your head pls.","replies":[{"poster":"TehNACHO","date":"2018-06-20T21:17:39.425+0000","up_votes":4,"down_votes":0,"body":"Gonna side with Naps here. At this point it doesn't even matter whether or not damage is too high this season, that was a shit gank and the Nidalee was asking for it.","replies":[]},{"poster":"hi ìm groot","date":"2018-06-20T22:41:10.649+0000","up_votes":1,"down_votes":5,"body":"> [{quoted}](name=Handin Out Naps,realm=NA,application-id=3ErqAdtq,discussion-id=BLx3cq4m,comment-id=00080000000000000000000000000000,timestamp=2018-06-20T21:05:49.424+0000)\n>\n> No.  It.  Wouldn&#x27;t.  You would have died last season aswell.  Too many minions.  Renek has a lvl up.  Renek has everything up.  This screams bad idea and always has.  Look at the wave.  Stop talking about damage.  Never in the history of league has this ever been seen as a good idea.  Get it through your head pls.\n\nRight, because you say so. And everyone else who use to play squish junglers and find them completely impracticle THIS SEASON, as well as everyone else who has noticed that the damage is definitely alot higher than previous seasons, must all be out their minds. Handin out naps has spoken rofl.","replies":[{"poster":"Handin Out Naps","date":"2018-06-20T23:21:31.318+0000","up_votes":3,"down_votes":0,"body":"What in the world are you even saying Lol.?  Why are you suddenly talking about something completely different that I didnt even argue with you about?  Arguing with people on the boards is ridiculous.","replies":[]}]}]}]}]}]}]}]}]}]},{"poster":"Daddy Ants","date":"2018-06-20T15:58:59.691+0000","up_votes":8,"down_votes":2,"body":"*** Tanks should never be able to deal Lethal damage to a target without their team's assistance.**\n\nHow I see it is A Tank's job is essentially to be a damage sponge and provide utility to their team through Crowd Control.\n\nTanks should NOT be able to solo carries or anyone purely off their base damage.\n\nIf they want to do more damage then they should build AP/AD items which means a trade off on their survivability.\n\n\n--------------------------------------------------------------------\n\n\n*** Conqueror is a huge mistake to the game.  You should of just bought back Fervor of Battle.**\n\nNothing else I can say here.\n\nRemove this mistake of a rune in the preseason and replace it with Fervor\n\n-------------------------------------------------------\n\n*** Infinity Edge rework was a mistake.  **\n\nReducing the Critical damage amplifier to say 30-35% down from 50% would of been fine imo.\n\nGiving everyone access to True Damage takes away the niche's that some champions have.\n\n\n","replies":[{"poster":"AirKingNeo","date":"2018-06-20T16:25:05.158+0000","up_votes":2,"down_votes":8,"body":"Conqueror is weak right now, so idk what you're complaining about.","replies":[{"poster":"RainXBlade","date":"2018-06-20T19:23:23.963+0000","up_votes":4,"down_votes":1,"body":"> Conqueror is **weak**\n\nLol, look at Yi, Irelia, Jax and to an extent, Camille and Yasuo abusing conqueror. Those ~~bruisers~~ bastards are shredding anything they can dash onto.","replies":[{"poster":"Azeranth","date":"2018-06-20T20:02:51.617+0000","up_votes":2,"down_votes":0,"body":"Its the fact that those champions can abuse it early despite obviously having kist which go late game. The issue is not conqueror, its late game champions who have free and powerful early games as well (aka broken champions)","replies":[]},{"poster":"AirKingNeo","date":"2018-06-20T19:49:52.429+0000","up_votes":1,"down_votes":1,"body":"Yi: Abuses gold funneling. Isn't strong otherwise.\n\nIrelia: Broken by kit numbers.\n\nJax: Wasn't even competitively viable before Sterak's nerf.\n\nCamille: **DOESN'T EVEN USE CONQUEROR**; she uses Press the Attack\n\nYasuo: Actually, he's the only champion who's strong because he uses Conqueror well. Yasuo was dogshit before Conqueror, but other top laners like Jax, Kled, etc. didn't skyrocket like he did.","replies":[{"poster":"RainXBlade","date":"2018-06-21T23:24:22.855+0000","up_votes":1,"down_votes":0,"body":"Yi can be very strong w/o that \"Taric going mid and giving CS to Yi\" strat. It heavily depends on how fast you can get your Rageblade.\n\nOk, that I can agree with. Irelia's numbers are busted.\n\nJax is well, Jax. He has counterplay like learning how to keep your distance and engaging him when he doesn't have his E up. Despite that, he's pretty viable with the Triforce + Titanic combo.\n\nOk fine, true.\n\nYasuo still his issues like him being at the mercy of ADC balance.","replies":[]}]}]}]},{"poster":"Amoc","date":"2018-06-20T16:14:56.141+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Antenora,realm=EUW,application-id=3ErqAdtq,discussion-id=BLx3cq4m,comment-id=0006,timestamp=2018-06-20T15:58:59.691+0000)\n>\n> * Tanks should never do fatal damage to a target unless they sacrifice defenses to build damage.\n> * Conqueror is a huge mistake to the game.  You should of just bought back Fervor of Battle.\n> * Infinity Edge rework was a mistake.  Reducing the Critical damage amplifier to say 30-35% down from 50% would of been fine imo.\n\nI agree that Conqueror is a big mistake.  I understand what they were trying to do by allowing Bruisers to beat up tanks, it's brutally overtuned and when champs like Yi and Jax etc are using it, it's totally broken.  \n\nTanks ARE doing too much damage, I agree, but there's no reason they shouldn't be able to kill squishy enemies.  They shouldn't be able to do it as fast as assassins (Malph's ult-combo is like 100>0 sometimes), but they should be able to beat a lot of targets down eventually if they're ahead or they're able to stick on a squishier target.  If the tanks don't have at least meaningful damage, they're not going to be played.  Most bruisers these days have some crowd control of their own, so if you make tanks hit like wet noodles, bruisers will take over the role entirely.  \n\nInfinity Edge rework was not a mistake.  It was sorely needed.  Additional tuning maybe needed, but it was too much of a does-everything item and served as an absurd mid game power spike.","replies":[{"poster":"Champion Skin","date":"2018-06-21T15:21:51.048+0000","up_votes":1,"down_votes":0,"body":"> (Malph's ult-combo is like 100>0 sometimes)\n\nWell then again Malphite is pretty much a burst tank in that after bursting with R + E + Q he doesn't really have much follow up if the targets survive that burst","replies":[{"poster":"Amoc","date":"2018-06-21T15:59:06.531+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Champion Skin,realm=EUW,application-id=3ErqAdtq,discussion-id=BLx3cq4m,comment-id=000600000002,timestamp=2018-06-21T15:21:51.048+0000)\n>\n> Well then again Malphite is pretty much a burst tank in that after bursting with R + E + Q he doesn&#x27;t really have much follow up if the targets survive that burst\n\nHe actually does pretty good damage with W and E...he's just useless after ult if he gets kited.","replies":[{"poster":"Champion Skin","date":"2018-06-21T20:45:35.784+0000","up_votes":1,"down_votes":0,"body":"Even with 40% CDR it still takes 4.2 seconds for Malphite to get of a second E and yeah his W is pretty decent though he usually don't have any attack speed to support it yeah having damage equal to 250 AD auto attacks (130 AD +120 damage from W at rank 5 with around 300 Armor) but it still isn't that amazing given how prone Malphite is to getting kited and his lack of attack speed","replies":[{"poster":"Amoc","date":"2018-06-22T13:43:18.233+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Champion Skin,realm=EUW,application-id=3ErqAdtq,discussion-id=BLx3cq4m,comment-id=00060000000200000000,timestamp=2018-06-21T20:45:35.784+0000)\n>\n> Even with 40% CDR it still takes 4.2 seconds for Malphite to get of a second E and yeah his W is pretty decent though he usually don&#x27;t have any attack speed to support it yeah having damage equal to 250 AD auto attacks (130 AD +120 damage from W at rank 5 with around 300 Armor) but it still isn&#x27;t that amazing given how prone Malphite is to getting kited and his lack of attack speed\n\nNot really arguing with that.  He's not a champ I'd pick against everyone.  If the enemy team is heavy on AA (especially melee) however, his E (on a 4.2s cooldown, which is easy for Malph) provides a ton of utility for the team and he will kill squishies if he's not kited or peeled.","replies":[]}]}]}]}]},{"poster":"ImGodlyatYasuo","date":"2018-06-21T07:47:56.154+0000","up_votes":1,"down_votes":0,"body":"Man I remember the 800 damage naut did with his basic combo and electrocute level 5","replies":[]}]},{"poster":"Jamaree","date":"2018-06-20T09:03:24.907+0000","up_votes":9,"down_votes":18,"body":"To be fair, as much as this community wants to act like it didn't, people begged for a lot of these changes. People whined that games were too long, the meta got too stale, that tanks did no damage.","replies":[{"poster":"JPizzle132","date":"2018-06-20T09:17:50.540+0000","up_votes":9,"down_votes":0,"body":"Yea people did true -_- I think they were right though (maybe other than tanks, if they don't like the idea of actually just tanking, they should pick something else, not complain about tanks not doing damage disproportionately high considering their defensive stats), and riot just took it too far with every change. \nThey really hit a sweet spot though where tanks were doing a little too much damage, but at least there was team composition counter play to it. Games were just a little long at 50 minute averages, where it needed a little something to increase the pace just a touch to like 40 minutes (today's rift herald? Elder Dragon?). Alot of little tweaks to specific champions was what was needed. Instead it was \n*Lebelanc/kat pretty op in high elo*\n\"Nerf stats a little until it balances?\"\n\"Nah let's do this\"\n*removes abyssal scepter because of literally 2 champions, adds 7 new items, changes like 16 items (mostly increasing damage IE banshee's veil)*\n Everytime a balance problem showed up they were just like \"alright screw it\" and starting doubling effective damage on everything through a bunch of crazy ways.","replies":[]},{"poster":"TwitchInMyPants","date":"2018-06-20T14:57:44.955+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Jamaree,realm=NA,application-id=3ErqAdtq,discussion-id=BLx3cq4m,comment-id=0000,timestamp=2018-06-20T09:03:24.907+0000)\n>\n> To be fair, as much as this community wants to act like it didn&#x27;t, people begged for a lot of these changes. People whined that games were too long, the meta got too stale, that tanks did no damage.\n\nTanks doing no damage isn't a problem.  Bruisers basically being tanks with better damage is.  Those two roles constantly switch spots in the meta all the time due to how similar they are and Riot should have a historical precedent to know not to overreact to one being stronger than the other.  And besides that they've created situations where tanks do equal damage to bruisers while being way better at cc/durability and they've created situations where the tanks can't do reasonable damage wheras bruisers are able to be about as durable while doing it.  And the current situation is one where bruisers are able to just stack defense while having absurd damage with Conquerer so history is repeating itself once again, or they can just go full damage and compete with assassins for their role.\n\nAnd games being too long is complaining about the game being too passive and stalling to 50 minutes, not complaining about 30-40 minute average games.  It's not fun spending an hour doing nothing but farming.  It's also not fun getting blown up in literally 1-2 abilities even if you buy defense.  And I don't recall any complaints about a \"stale meta\" other than people wanting different roles in botlane, which they successfully did... by deleting 80% of adcs from the role lol.  Riot does change for the sake of change all the time so other than leaving a busted item like Ardent Censer in the game for 6 months there's been few periods where the meta has been allowed to just stagnate.","replies":[{"poster":"Jamaree","date":"2018-06-20T20:47:56.014+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=TwitchInMyPants,realm=NA,application-id=3ErqAdtq,discussion-id=BLx3cq4m,comment-id=00000001,timestamp=2018-06-20T14:57:44.955+0000)\n>\n> Tanks doing no damage isn&#x27;t a problem.  Bruisers basically being tanks with better damage is.  Those two roles constantly switch spots in the meta all the time due to how similar they are and Riot should have a historical precedent to know not to overreact to one being stronger than the other.  And besides that they&#x27;ve created situations where tanks do equal damage to bruisers while being way better at cc/durability and they&#x27;ve created situations where the tanks can&#x27;t do reasonable damage wheras bruisers are able to be about as durable while doing it.  And the current situation is one where bruisers are able to just stack defense while having absurd damage with Conquerer so history is repeating itself once again, or they can just go full damage and compete with assassins for their role.\n\nFair.\n\n> And games being too long is complaining about the game being too passive and stalling to 50 minutes, not complaining about 30-40 minute average games.  It&#x27;s not fun spending an hour doing nothing but farming.  It&#x27;s also not fun getting blown up in literally 1-2 abilities even if you buy defense.  \n\nI understand that people want for lower damage, but that is going to lead to is back to a tank meta all over again.\n\n>And I don&#x27;t recall any complaints about a &quot;stale meta&quot; other than people wanting different roles in botlane, which they successfully did... by deleting 80% of adcs from the role lol.  \n\nOh no, there were most definitely complaints about stale meta, how the meta would stay the same for nearly an entire season and the constant bitchcing about it.","replies":[]}]}]},{"poster":"HonestJohnTheCon","date":"2018-06-20T12:00:16.874+0000","up_votes":4,"down_votes":1,"body":"I can see how Riot falls into this line of thinking, though. Dealing damage is fun. Not dealing any damage whatsoever is not fun. Now obviously if you're 0/3/0 and put yourself in that position, then you should have played more carefully. But generally speaking, dealing very little damage is not fun.\n\nWhat Riot's been doing, though, is thinking that MORE DAMAGE = MORE FUN. Which is not the case.","replies":[]},{"poster":"DragonShea","date":"2018-06-21T05:22:30.828+0000","up_votes":2,"down_votes":0,"body":"Not everyone should have damage or be able to build it, if you are a support, you are gonna have to suffer for having so much damage. Hell that is one of the reasons why I believe that heal/shield power SHOULD stay as it allows supports to have enough power to be effective without having to full AP or full damage and lose out on utility or be able to do both.\n\nWhat needs to be done is better tuning of damage, there is too much of it and tank items don't feel like they are that effective while skirmishers now have insane damage and survivability to go in and deal insane amounts of damage without dying despite having little to no raw tankiness.","replies":[{"poster":"Champion Skin","date":"2018-06-21T15:03:49.399+0000","up_votes":1,"down_votes":0,"body":"> Not everyone should have damage or be able to build it\n\nWell if you don't want supports to be able to build damage why wouldn't you want them to build AP and just make all of their AP scalings into utility scaling meaning that no matter how much AP they build they still won't deal more damage (unless they build Lich Bane or build AD)","replies":[]}]},{"poster":"I Love Roses","date":"2018-06-20T14:54:05.956+0000","up_votes":1,"down_votes":1,"body":"I think it's totally fine, if people find it fun then why the hell not, I think it's super good.","replies":[{"poster":"Azeranth","date":"2018-06-20T19:05:47.063+0000","up_votes":2,"down_votes":0,"body":"There is a point where \"this makes it more fun for the player\" ends up making the game unfun for everyone else, and when you only benefit from 1 op champion yourself, but play agianst 5 op champions, you have no fun whatsoever","replies":[]}]},{"poster":"Nea104","date":"2018-06-20T18:12:54.770+0000","up_votes":2,"down_votes":0,"body":"They noticed that many people were fine with \"stomp/be stomped\" games even 1 year ago, and made it worse.\nStomp? Oh, I'm so good.\nStomped? My team sucks.\n\nMeanwhile, every game is a pointless one-shot fiesta. You can engage on a tank and get kills, instead of getting punished for being mindless.\nYou just need to burst your enemy before your enemy bursts you.\nFun game.","replies":[]}]}