{"poster":"Amihan","date":"2017-06-06T10:48:14.704+0000","title":"Lcs look so dull to watch nowadays....","subforum":"Esports","up_votes":1,"down_votes":1,"body":"Can we just give turret 100%  armour and magic resist when only 1 champion is split pushing?\r\nNo team bother to fight anymore its all about getting tower at the safest way.  i watched lck this whole week and it seems they&#039;re more focus on getting turrets instead of team fights..\r\nfk objective fk splitpush fk playing safe till late game. The game just look uninteresting to watch if its like that.\r\nCan we just make the game more rewards in making team fights or getting ace? or maybe lower turret gold??","replies":[{"poster":"BigBellBrute","date":"2017-06-06T18:01:29.725+0000","up_votes":1,"down_votes":0,"body":"The 1-3-1 early power comp is definitely a snowball comp either way.    If you get behind, you're pretty much going to lose.  If you get ahead, it's easy to win with.  \n\nBut the downside of the op's proposed change is if you make towers stronger like that, then you're going to go back to the 20 minutes of farm fest before the action starts or the 10 minutes of lane swap fest before the action starts.","replies":[]},{"poster":"III BAKURYU III ","date":"2017-06-06T17:13:28.969+0000","up_votes":1,"down_votes":0,"body":"What are you talking about with  \" nowadays\"  -it's been like this since the LCS was created 2013-X and even before that 2010-2012 when the LCS wasn't introduced the pros would still have these slower, more methodical type of games. \n\n \" I watched lck this whole week and it seems they're more focus on getting turrets instead of team fights\" \n - I doubt you actually watched any games from start to finish for that matter especially the LCK, you most likely \"watched\" 5 secs of certain games and went \" No fighting 24/7, only people with brains figuring out the best ways to win in the \"easiest\" was possible without any team getting a huge lead from 2-3 kills. \nThat's the difference between pros and X tier players in solo Q etc/viewers; pros can take a 1-2 kill lead and turn it into huge leads that eventually just wins them the game off of it. \n\n  If you don't want to watch here\n\nhttps://www.youtube.com/watch?v=zKn7_xRv0FI","replies":[]},{"poster":"Geauxx","date":"2017-06-06T11:21:38.540+0000","up_votes":1,"down_votes":0,"body":"i mean they get paid to win games, getting objectives is the most efficient thing.","replies":[]},{"poster":"SEKAI","date":"2017-06-06T10:58:29.956+0000","up_votes":1,"down_votes":0,"body":"One shouldn't balance the game specifically around spectacles or other artificiality. We're not doing some TV programme. It's also with the emphasis on \"making it more fun to watch\" that some of the past balance decisions were contrived and made absolutely no sense other than steering the pro scene in a certain direction. We don't want that to be THE game, no.","replies":[]}]}