{"poster":"Kobabida","date":"2015-04-20T19:13:30.145+0000","title":"Noch nie solch schlechte, aggressive, beleidigende Community erlebt !!!!!","subforum":"Spielerverhalten & Moderation","up_votes":10,"down_votes":9,"body":"Ich spiele LOL jetzt seit ca. einem Monat. Normalerweise bin ich auch nicht derjenige welcher sich im Forum auslassen mu&szlig;. Doch jetzt m&ouml;chte ich, nach verschiedennen Vorf&auml;llen, mal meine Meinung loswerden.\r\nNoch nie, und ich habe schon viele online spiele im laufe der Jahre gespielt, noch nie habe ich soch eine aggressive, beleidigende community erlebt. ich pers&ouml;nlich habe mich daher entschieden, auch wenn ich das Spiel gut finde, dieses einzustellen. Sich grundlos aufs &uuml;belste beleidigen zu lassen mu&szlig; ich nicht haben. Ich spiele dieses Spiel aus Spa&szlig;, diesen habe ich leider nicht mehr. Sicher gibt es auch viele faire vern&uuml;nftige Spieler, welche sicherlich auch in der Mehrheit sind, wenn man sich aber bei jedem 2tem Spiel die d&uuml;mmsten Beschuldigungen und Beleidigungen anh&ouml;ren mu&szlig;, zum teil weil diese flamer oft selber zu bl&ouml;d sind zum spielen oder einen fehler gemacht haben, f&uuml;r welchen sie dann einen Schuldigen suchen, vergeht einem schnell die Lust. Ja ich bin kein pro, so wie jeder der ein Spiel neu anf&auml;ngt. trotzdem habe ich mich so gut es geht eingelesen was bestimmte spielweisen Skillungen u.s.w angeht.  Das meine spielweise noch nicht perfekt sein kann, ok, kein Problem. Trotzdem denke ich das ich mich f&uuml;r einen Anf&auml;nger recht gut geschlagen habe. \r\nich habe einiges reportet, hoffe auch das man den Spielverlauf und den Chat einsieht, und das diese Spieler auch bestrafft werden. Ich hab den Eindruck das interessiert die gar nicht. Ansonsten w&uuml;rden die sich nicht so benehmen.\r\nHabe auch im Chat mitbekommen wie meine Teammitglieder aufs &uuml;belste Beleidigt wurden. Sehr lustig ist es auch wenn deutsche Spieler dann in ihrer Heimatsprache schreiben und beleidigende kommentare verfassen, im denken das man sie nicht versteht. \r\nIch hab trotz allem das spiel gerne gespielt, habe zum Gl&uuml;ck noch kein Geld ausgegeben (was ich eigentlich vorhatte, grade wegen den zu wenig vorhandenen runensiten). Mit ner guten community macht es bestimmt auch sehr viel spa&szlig;. Mir wurde dieser Spa&szlig; genommen. \r\nbb, hf, gl all","replies":[{"poster":"Sirrkas","date":"2015-04-20T19:29:40.513+0000","up_votes":7,"down_votes":0,"body":"Hallo Kobabida,\n\nsolche störenden Spieler gibt es schon Lange und Überall. Das Problem ist eher, die Spieler neigen besonders zu solchem Verhalten, wenn sie auf die Leistungen anderer angewiesen sind. Da man bei LoL alleine nicht viel erreichen kann, neigen manche Spieler eben dazu den Frust an den anderen auszulassen. \n\nAn den Reports stören sich einige. Wenn du magst kannst du das Forum durchsuchen. Es gibt hier viele \"Ich finde das Reportsystem blöd, weil ich zurecht bestraft wurde\"-Threads. \n\nFalls du sicher gehen willst, keine Flamer im Team zu haben, empfehle ich dir die [Liga der Gentlemen](http://boards.euw.leagueoflegends.com/de/c/clans-teams-de/EyJRt7XA-zocken-ohne-flamer-die-liga-der-gentlemen). Allerdings solltest du dir vorher sicher sein, dass du selbst die Regeln einhältst.","replies":[]},{"poster":"dat Zoidberg","date":"2015-04-20T19:20:48.519+0000","up_votes":3,"down_votes":0,"body":"Was soll man dazu sagen...nobody cares?\n\nTeilweise ist es schon übel was man erlebt. Aber du bist einfach noch recht unerfahren - es ist auf subjektive Wahrnehmung zurückzuführen, dass man in jedem zweiten Spiel solche Übeltäter erwischt. Kann ich absolut nicht bestätigen und spiele seit 2 Jahren. Solche Ausreisser kommen immer wieder mal vor weil es wirklich viele Idioten gibt, aber es ist im Laufe der Zeit besser geworden. Also werd erst mal 30 und lerne das Spiel besser kennen - wenn es dir gefällt.\n\nEs gibt da eine einfache Regel wenn man auf solche Zeitgenossen trifft: mute & report.\n\nAber wenn man so ein Sensibelchen ist ist es vermutlich die bessere Entscheidung, LoL nicht mehr zu spielen, denn früher oder später wird man immer wieder auf Idioten treffen. Mit etwas gesundem Selbstbewusstsein steht man einfach über diesem, pardon, Abschaum den man immer wieder mal trifft.","replies":[]},{"poster":"N00B FreshToasty","date":"2015-04-21T17:59:23.253+0000","up_votes":2,"down_votes":0,"body":"Ich gebe dir halbwegs recht. Zum Teil gibt es Typen, die sich echt schlech tbenehmen und jeden, der ihnen ein Sandkorn vor die Füße wirft, beleidigen. Manche tun dies sogar noch ohne, dass man etwas gemacht hat. Doch solche Spieler treffe ich eher selten, nicht in jedem zweiten Spiel ;) Wenn ich dann aber auf jemanden treffe, mute ich ihn einfach. Da ich ein sehr freundlicher Spieler bin, gehe ich nicht auf das geflame ein, doch wenn mein Bruder hinter mir sitzt, eskaliert er sehr oft. Statt nichts zu erwidern, greift er sich sofort die Tastatur, um eine beleidigende Antwort zu verfassen. Manchmal kann ich ihn noch beruhigen, jedoch nicht immer {{summoner:3}} \nIch bleibe eigentlich wie gesagt still und reporte die toxischen Spieler nachher.\nSehr viel öfter aber, spiele ich mit Leuten, die gar nichts sagen. Das ist nicht schlimm, ich fände es aber besser, wenn man in einem Team-Spiel auch mal miteinander kommuniziert und zwar nicht nur \"I go there\" sondern auch mal \"Thx for dragon\" etc.\nDann gibt es auch Leute, die genau das machen, was ich gerne hätte: Soziale Kommunikation.\nEin \"gj\" und ein \"hello\" ist ja auch schon mal nett. Wenn diese Leute sich dann auch noch während des Spiels unterhalten (über den chat),\ndann ist ihnen ein \"honor\" fast sicher...\n\nDas war so meine Sichtweise dazu. Ich hoffe, dass viele diese mit mir teilen.","replies":[{"poster":"eingew","date":"2015-04-21T18:12:08.315+0000","up_votes":1,"down_votes":0,"body":"Dein Bruder schreibt auf deinem Account? Aber dir ist bewusst, dass du damit Sperren riskierst?","replies":[{"poster":"N00B FreshToasty","date":"2015-04-21T18:34:25.335+0000","up_votes":1,"down_votes":0,"body":"Ja, das weiß ich. Aber was will man machen? Er ist größer als ich, es ist sein Computer etc.\nIch versuche es so oft ich kann zu verhindern, aber manchmal klappt das nicht :(","replies":[{"poster":"Taihuang","date":"2015-04-22T09:28:55.945+0000","up_votes":1,"down_votes":0,"body":"Vielleicht ihm sagen das du gerade spielst und er gefälligst die Finger von der Tastatur lassen soll?\n\nJeder von uns kann sich wohl in die Lage versetzen, da kämen bei mir erst die Aggressionen hoch wenn\nsich jemand meine Tastatur schnappt während ich zocke.\nWobei ich mich da schon frage .... wie soll das funktionieren?\nImmerhin hast du die Finger doch auf der Tastatur ....\n\nIch habe meinen kleinen Bruder früher auch mal gerne geärgert ....\naber es gibt sowas wie einen Kodex unter Gamern .... \n\nZeig beim nächsten Mal einfach Stärke und sag ihm das er seinen Mist \nschreiben kann wenn er sich mit seinem Account eingeloggt hat.\nWenn ihm das nicht passt braucht er dir ja nicht über die Schulter zu gucken.","replies":[]}]},{"poster":"N00B FreshToasty","date":"2015-04-21T18:39:27.354+0000","up_votes":1,"down_votes":0,"body":"P.S.: Es passiert aber auch nicht wirklich oft. Eine Sperre habe ich noch nie gekriegt.","replies":[]}]}]},{"poster":"Nephirelle","date":"2015-04-20T19:31:20.571+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Kobabida,realm=EUW,application-id=KYnfKGf0,discussion-id=hXujx8kE,comment-id=,timestamp=2015-04-20T19:13:30.145+0000)\n> Noch nie, und ich habe schon viele online spiele im laufe der Jahre gespielt, noch nie habe ich soch eine aggressive, beleidigende community erlebt. \n\nHast du bisher nur MMORPGs gespielt? So ein harscher Ton ist in den meisten kompetitiven Spielen leider Gottes der Normalzustand. Das heißt nicht, dass man das einfach akzeptieren sollte, aber ich bezweifel' stark, dass LoL in Sachen schlechtes Benehmen besonders hervorstechen soll.\n\nLetztendlich musst du für dich selbst entscheiden, was du für dich als zumutbar empfindest und was nicht - Spiele sollen Spaß machen und es gibt genügend andere gute Alternativen im Orbit. In dem Sinne wünsche ich dir noch viel Erfolg bei der Suche!","replies":[]},{"poster":"CARAJOLOCO","date":"2015-04-21T11:00:15.900+0000","up_votes":1,"down_votes":5,"body":"die wichtigsten punkte wurden genannt. du darfst es nicht an dich herankommen lassen, was aber nicht heißen soll, dass man die leute, die sowas tun einfach gewähren lässt.\n\ndeine optionen sind nun mal nur: während des spiels: muten, all chat ausstellen. nach dem spiel reporten (am besten auch mit kurzer notiz, denn manchmal sind die auswählmöglichkeiten nicht genug um den Report-Grund abzudecken).\n\nAuf Beleidigungen nicht eingehen... auch wenn du keine Schuld hattest, das ist denen egal, also gar nicht reagieren.\nDie Kommunikation aber auch nicht komplett einstellen, sondern nur so kommunizieren, dass es deinem Team etwas bringt (Pings, misses, calls für initiates...)\nAufs Game konzentrieren und den Spaß nicht verlieren ;)\n\nDas klappt meiner Meinung nach mit diesem Vorgehen am besten.\n\nWie kann man da jetzt noch helfen, dass dieses Problem eingedämmt wird?\nRiot Support anschreiben könnte was bringen, aber einen \"Kanal\" dafür bieten sie ja schon an: Reporten. \nWenn genügend reported wird, wird das Tribunal auch wieder verfügbar sein. Dieses befindet sich im \"Recess\" und seit neuestem erscheint eine \"Maintenance\"-Seite wenn man auf Tribunal klickt... evtl. gibt es bald wieder genügend Fälle, die man als Teil des Tribunals einsehen und bewerten kann.\n\nViele reporten ja auch völlig grundlos.. viele Flamer reporten schon aus Prinzip, quasi als Verteidigung, weil sie wissen mind. 1-3 Leute reporten ihn.\nDer Chat spielt bei jedem Report eine Rolle!\n\nDiese Seite hier ist recht neu und versucht auch dieses Problem in Angriff zu nehmen: [http://www.lolcure.net](http://www.lolcure.net)","replies":[{"poster":"eingew","date":"2015-04-21T13:10:48.178+0000","up_votes":1,"down_votes":0,"body":"> Wenn genügend reported wird, wird das Tribunal auch wieder verfügbar sein. Dieses befindet sich im \"Recess\" und seit neuestem erscheint eine \"Maintenance\"-Seite wenn man auf Tribunal klickt... evtl. gibt es bald wieder genügend Fälle, die man als Teil des Tribunals einsehen und bewerten kann.\n\nDas Tribunal ist down, weil es überarbeitet wird, es wartet nicht auf neue Fälle. Das Reportsystem funktioniert aber auch ohne Tribunal, unter anderem sorgt die Chatanalyse dafür, dass nur Spieler bestraft werden, die wirklich etwas falsch gemacht haben.","replies":[{"poster":"CARAJOLOCO","date":"2015-06-02T22:27:26.458+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=eingew,realm=EUW,application-id=KYnfKGf0,discussion-id=hXujx8kE,comment-id=00060000,timestamp=2015-04-21T13:10:48.178+0000)\n>\n> Das Tribunal ist down, weil es überarbeitet wird, es wartet nicht auf neue Fälle. Das Reportsystem funktioniert aber auch ohne Tribunal, unter anderem sorgt die Chatanalyse dafür, dass nur Spieler bestraft werden, die wirklich etwas falsch gemacht haben.\n\ndoch es wartet auch auf neue fälle. lies die ankündigung darüber\n\n@OrangeBubble: du machst es dir ja sehr einfach^^ gehe ich nicht weiter drauf ein ;)","replies":[{"poster":"Sirrkas","date":"2015-06-02T22:45:06.880+0000","up_votes":2,"down_votes":0,"body":"Du belebst einen Thread nach einem Monat wieder, um Fehlinformationen zu verbreiten?\n\nKlick doch mal auf den Tribunallink.\n\nhttp://euw.leagueoflegends.com/tribunal/de/\n\nDa kommt das hier dabei heraus.\nhttp://tribunal.euw.leagueoflegends.com/de_DE/maintenance.html\n\nEdit:\nAllerdings ist es schön zu sehen, dass solche Topics nie eingehalten werden. Der TE spielt gerade ziemlich fleißig LoL:\nhttp://www.lolking.net/summoner/euw/71518425#matches","replies":[{"poster":"CARAJOLOCO","date":"2015-06-02T23:04:46.015+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Sirrkas,realm=EUW,application-id=KYnfKGf0,discussion-id=hXujx8kE,comment-id=0006000000000000,timestamp=2015-06-02T22:45:06.880+0000)\n>\n> Du belebst einen Thread nach einem Monat wieder, um Fehlinformationen zu verbreiten?\n> \n> Klick doch mal auf den Tribunallink.\n> \n> http://euw.leagueoflegends.com/tribunal/de/\n> \n> Da kommt das hier dabei heraus.\n> http://tribunal.euw.leagueoflegends.com/de_DE/maintenance.html\n> \n> Edit:\n> Allerdings ist es schön zu sehen, dass solche Topics nie eingehalten werden. Der TE spielt gerade ziemlich fleißig LoL:\n> http://www.lolking.net/summoner/euw/71518425#matches\n\nIst keine Fehlinformation.... ja inzwischen ist die Meldung etwas anders, aber bis vor kurzen hieß es noch: \"The Tribunal is currently building more cases. Please return later to vote on summoner case files.\"\n\nDas ist zwar etwas älter: [Link](http://forums.eune.leagueoflegends.com/board/showthread.php?t=704024), aber bis vor kurzem erschien diese Meldung.","replies":[{"poster":"drexxsack","date":"2015-06-03T05:06:46.266+0000","up_votes":1,"down_votes":0,"body":"Auch zu diesem Zeitpunkt war bereits bekannt, dass das Tribunal down ist, weil es überarbeitet wird. Das hatten sie sogar groß auf der Frontpage bekannt gegeben.\nIm Gegensatz zu weiterführenden Informationen, war das also für alle leicht erreichbar.\n\nhttp://euw.leagueoflegends.com/en/news/game-updates/player-behavior/upgrading-tribunal\n\n\n> We’re going to temporarily put the Tribunal in maintenance mode while we upgrade the overall system to ensure players who deserve punishments receive them much faster than they currently do","replies":[]}]}]}]}]},{"poster":"OrangeBubble","date":"2015-05-03T11:24:32.122+0000","up_votes":2,"down_votes":1,"body":"Die Seite, für die du offenbar hier Werbung machst (mind. schon einmal gelesen), ist bullshit. Mehr als ein öffentlicher Pranger, wo der \"Skill\" und  das \"Verhalten\" von randoms bewertet wird, ist es nicht. Ganz ehrlich, wenn ich mit dir eine! Runde spiele, woher willst DU wissen, wie gut ich spiele oder wie nett ich bin? Wow, vllt hab ich mich EINE Runde daneben benommen, benehme mich aber die anderen 100 Runde tadellos oder sogar positiv. Dann gehst du auf die Seite, bewertest mich als negativ, weil ich eine Runde evtl ff gespammt habe und in wirklich kein bin ich gar nicht so negativ?.. \n\nZumal was bringt die Seite? Selbst wenn ich jetzt vor jedem Ranked mir die Spieler anschauen, das einzige, was sie evtl bewirkt, ist, dass ich VOR dem Spiel schon angepisst bin, weil ich sehe \"Aha Top und Mid scheinen Flamer zu sein, die haben negative Bewertungen bekommen\".  \n\nBeim besten Willen die Seite ist einfach nur Unsinn und wird sich sowieso nicht durchsetzen.","replies":[]}]},{"poster":"FiveFingerJoe","date":"2015-04-29T20:16:19.451+0000","up_votes":1,"down_votes":0,"body":"also wenn ich ins spiel komme ist meine erste aktion global chat mute. da brauchen wa auch nich drüber zu reden dat is ne janz klare kiste. die ganzen plagen in dem game dat muss man sich net geben\n\nmfg","replies":[]},{"poster":"Dermel","date":"2015-04-20T20:06:22.312+0000","up_votes":1,"down_votes":9,"body":"Die typischen Beleidigungen sind so allgemein, die jucken doch keinen mehr, also von daher... 10x so schlimm: Beleidigungen mit verdrehten Buchstaben die einen sebt zum Flame auffordern sollen!!! Ich finde auch, dass die Community hier nicht gerade die netteste it, die Gründe sind ja auch nur logisch, aber an mir liegt es nicht, versprochen ;-), ach ja an alle Flamer die diesen Vortrag downvoten: ihr untermalt die Kritik nur noch. ","replies":[{"poster":"HyperionCH","date":"2015-04-21T08:25:51.428+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Dermel,realm=EUW,application-id=KYnfKGf0,discussion-id=hXujx8kE,comment-id=0004,timestamp=2015-04-20T20:06:22.312+0000)\n>\n> Die typischen Beleidigungen sind so allgemein, die jucken doch keinen mehr, also von daher... 10x so schlimm: Beleidigungen mit verdrehten Buchstaben die einen sebt zum Flame auffordern sollen!!! Ich finde auch, dass die Community hier nicht gerade die netteste it, die Gründe sind ja auch nur logisch, aber an mir liegt es nicht, versprochen ;-), ach ja an alle Flamer die diesen Vortrag downvoten: ihr untermalt die Kritik nur noch.\n\nWarum sollten Beleidigungen mit verdrehten Buchstaben schlimmer sein?\n\n1. Die Chatanalyse erkennt sehr wohl auch solche Beleidigungen und diese Flamer werden genauso bestraft.\n\n2. Flaming (egal ob mit verdrehten Buchstaben oder korrekt geschrieben) rechtfertigt nie, dass man dann zurück flamet.","replies":[{"poster":"Dermel","date":"2015-04-21T14:22:51.019+0000","up_votes":1,"down_votes":4,"body":"Mal wieder typisch 6 Leute die nicht gescheit lesen können: hab ich etwa mit einem Wort erwähnt, dass zurückflamen erlaubt ist ??? Nur dass die dazu aufrufen wollen damit man selbst flamed und bestraft wird. Wie dämlich kann ma eigentlich sein und die message nicht verstehen???? ","replies":[{"poster":"HyperionCH","date":"2015-04-21T14:51:31.999+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Dermel,realm=EUW,application-id=KYnfKGf0,discussion-id=hXujx8kE,comment-id=000400000000,timestamp=2015-04-21T14:22:51.019+0000)\n>\n> Mal wieder typisch 6 Leute die nicht gescheit lesen können: hab ich etwa mit einem Wort erwähnt, dass zurückflamen erlaubt ist ??? Nur dass die dazu aufrufen wollen damit man selbst flamed und bestraft wird. Wie dämlich kann ma eigentlich sein und die message nicht verstehen????\n\n1. Bei meinem Beitrag habe ich primär einmal gefragt, warum du eine (absichtlich) falsch geschriebene Beleidigung 10x schlimmer sei.\n\n2. Ich habe nicht vorgeworfen, dass du \"Zurückflamen\" recthfertigst.\nIch habe nur 2 Argumente geliefert, warum (absichtlich) falsch geschriebene Beleidigungen nicht \"10x schlimmer\" sind, sondern gleich schlimm.\nArgument 1: Die Chatanalyse erkennt beides.\nArgument 2: Die Mates dürfen so oder so nicht darauf reagieren (ausser mit stillschweigenden Report natürlich; und wenn nötig: mute)\n\nDu kannst mir aber gerne Argumente zu deiner Behauptung liefern. Meine Gegenargumente habe ich wie gesagt bereits (2x) geliefert.","replies":[{"poster":"Dermel","date":"2015-04-21T15:10:26.620+0000","up_votes":1,"down_votes":2,"body":"OK ich Hans verstanden, ich hab mich echt unklar ausgedrückt und gedacht dass du mir unterstellen wolltest, das Gerücht über erlaubtes Zurückflamen verbreitet zu haben. Sorry nochmal für den etwas barschen....\"Zurückkommentar\" Würde sagen die Sache is gegessen{{item:2009}}","replies":[{"poster":"Sanctuary2056","date":"2015-04-21T19:37:10.243+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Dermel,realm=EUW,application-id=KYnfKGf0,discussion-id=hXujx8kE,comment-id=00040000000000000000,timestamp=2015-04-21T15:10:26.620+0000)\n>\n> ...ich hab mich echt unklar ausgedrückt und gedacht dass du mir unterstellen wolltest,...\n\nSolche \"Unterstellungen\" gibt es hier leider sehr oft. Also solche, die in Wirklichkeit gar keine sind, aber als solche aufgefasst werden.\n\nWenn dich soetwas stört, dann solltest du deine Einstellung zum flamen vielleicht nochmal überdenken. Ich versuche es mal zu erklären: Das was mich am flame stört sind nicht die Wörter ansich... gerade eindeutige Beleidigungen halte ich für sehr flach und ich denke sie werden auch von den wenigsten ernst genommen... das eigentliche Problem das ich in dem geflame sehe ist die feindseelige Art der Kommunikation. Wenn man wirklich dauernd so feindseelige Sprüche zu hören bekommt, geht man irgendwann wie selbstverständlich davon aus, dass alles was gesagt wird auch feindseelig ist. Genau SO entstehen diese Missverständnisse, die als Unterstellung aufgefasst werden! Das ist soetwas wie erzwungene Interpretation... \n\nIch hoffe ich konnte das verständlich ausdrücken ^^\nIm Großen und Ganzen wäre das Miteinander um vieles einfacher und entspannter, wenn man generell versucht nett zu sein. So lösen sich auch andere Probleme, die man ersteinmal gar nicht sieht. Geflame zu akzeptieren ist auf jeden Fall etwas, was auf den ersten Blick sinnvoll erscheint, bei genauerer Beobachtung aber nicht das bewirkt, was man eigentlich erreichen will.","replies":[]}]}]}]}]}]},{"poster":"MetaBunny","date":"2015-04-21T08:02:29.083+0000","up_votes":1,"down_votes":2,"body":"Im World of Tanks gibt es die Option den Chat aus zu schalten da ja die wichtige Kommunikation über Pings stattfindet und im Chat überwiegend Müll zu finden ist. Lol hat diese Option nicht, also muss man lernen mit den Kommentaren irgendwie zu Leben, die schlimmsten Gesellen kann man ja muten. Hatte meine besten Games übrigens immer wenn ich die vier Mitspieler vorsorglich gemuted habe, das geht vielen so. Also wenn man ernst spieleln möchte global chat aus schalten und die Team-mates gleich am Anfang muten, ist viel klick Arbeit aber lohnt sich.","replies":[{"poster":"Shiggyvara","date":"2015-04-21T08:09:02.249+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=MetaBunny,realm=EUW,application-id=KYnfKGf0,discussion-id=hXujx8kE,comment-id=0005,timestamp=2015-04-21T08:02:29.083+0000)\n>\n> Im World of Tanks gibt es die Option den Chat aus zu schalten da ja die wichtige Kommunikation über Pings stattfindet und im Chat überwiegend Müll zu finden ist. Lol hat diese Option nicht, also muss man lernen mit den Kommentaren irgendwie zu Leben, die schlimmsten Gesellen kann man ja muten. Hatte meine besten Games übrigens immer wenn ich die vier Mitspieler vorsorglich gemuted habe, das geht vielen so. Also wenn man ernst spieleln möchte global chat aus schalten und die Team-mates gleich am Anfang muten, ist viel klick Arbeit aber lohnt sich.\n\nEhrlich gesagt ist es schlicht einmal /ignore all schreiben. Soviel Arbeit ist das auch nicht.","replies":[{"poster":"MetaBunny","date":"2015-04-21T08:10:30.604+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FTHGN,realm=EUW,application-id=KYnfKGf0,discussion-id=hXujx8kE,comment-id=00050000,timestamp=2015-04-21T08:09:02.249+0000)\n>\n> Ehrlich gesagt ist es schlicht einmal /ignore all schreiben. Soviel Arbeit ist das auch nicht.\n\nDas mutet alle? Muss ich probieren :)","replies":[{"poster":"hshtagniemehrcdu","date":"2015-04-21T09:50:24.385+0000","up_votes":1,"down_votes":0,"body":"/mute team\nfür das eigene Team,\nAll-Chat kannst du in den Optionen abstellen.","replies":[]}]}]},{"poster":"eingew","date":"2015-04-21T13:12:02.843+0000","up_votes":1,"down_votes":0,"body":"Also meine besten Spiele hatte ich mit positiven Mates. Die gibt es schließlich auch :P Sogar mit Global Chat, ohne könnte ich den Gegnern schließlich kein \"gg\" o.ä. schreiben :)","replies":[]}]},{"poster":"eingew","date":"2015-04-20T19:23:58.357+0000","up_votes":1,"down_votes":1,"body":"Von anderen Mobas kann ich nicht sprechen, aber im Allgemeinen bei Onlinespielen habe ich eine völlig andere Erfahrung gemacht. LoL ist definitiv nicht am schlimmsten. Ich habe vorher sehr viel World of Tanks gespielt. Da hängt man ähnlich viel aufeinander und da wird mindestens genauso viel geflamet wie in LoL, vielleicht sogar schlimmer, weil es dort, so wie ich das mitbekommen habe, ein nicht ansatzweise so gutes Bestrafungssystem gibt wie in LoL. \nEin anderes Beispiel wäre Eve-Online. Okay, das ist ein völlig anderes Genre und man chattet weniger, hängt nicht so sehr aufeinander... was einige trotzdem nicht vom beleidigen abhält, von den Methoden dir Ingame-Währung abzuknöpfen möchte ich gar nicht erst anfangen...\n\nFakt ist einfach, dass man, egal was man Online spielt, immer ein dickes Fell braucht. Wenn einen Beleidigungen schnell treffen, dann sollte man davon die Finger lassen. Gerade im kompetitiven Bereich fallen durchaus harte Worte, was ich keineswegs unterstützen möchte (im Gegenteil, ich freue mich, dass vor allem Riot so viel für gutes Benehmen tut), davor kann dich im Endeffekt niemand schützen. Nur du selbst.","replies":[{"poster":"spharic","date":"2015-04-21T02:26:22.816+0000","up_votes":1,"down_votes":2,"body":"naja vllt ist es nur mêine subjektive Meinung, aber ich denke es hängt u.a. mit dem f2p Prinzip zusammen, das zieht einfach die Assis an.\n\nIch hatte diverse f2p mmo's gespielt wo aufs übelste gescammt, geflamed und was weis ich gemacht wurde, aber bei zB WoW hatte ich nie derartige Vorfälle, da waren wirklich alle sehr gechillt und freundlich. Vllt hatte ich da auch einfach nur Glück, kann ich nicht sagen^^","replies":[]}]}]}