{"poster":"NukedToasty","date":"2017-07-14T18:01:01.447+0000","title":"Flex-Matchmaking verbessern ?","subforum":"Melde einen Bug","up_votes":1,"down_votes":0,"body":"Flex-Matchmaking in 2k17 \r\n\r\n{{sticker:zombie-brand-mindblown}} \r\n\r\n\r\nhttps://gyazo.com/ce5408f9f8acbe91b4505af94b3d6a8b\r\n\r\nhttps://gyazo.com/8fe11e3bd689be3d1d4be71688de9b53\r\n\r\nhttps://gyazo.com/1eabafc26686920f0444e2cd437d45cf","replies":[{"poster":"MeMyselfandBaal","date":"2017-07-14T20:09:04.957+0000","up_votes":1,"down_votes":0,"body":"Wer regt sich denn jetzt noch übers FlexQue Matchmaking auf? Ja, das ist pures Chaos. Das liegt im wesentlichen daran, dass dies die Que ist, in der man mit seinen Freunden Ranked spielen soll. Und da diese Que ein eigenes Matchmaking hat, darf auch der Platin 2 Dude mit seinem Bronze 1 Kumpel spielen. Deswegen ist das Matchmaking in dieser Que auch... unfixbar. Und die einzige Lösung ist Abschaffen...\n\nWenn dir ein ordentliches Matchmaking wichtig ist, dann spiele Solo/Duo Que... Wenn du mit deinen Freunden in einem seriöseren Setting als Normal Draft zocken willst, dann gehe in die FlexQue in nehme das Matchmaking hin...","replies":[{"poster":"NukedToasty","date":"2017-07-14T20:36:29.089+0000","up_votes":1,"down_votes":0,"body":"Ist mir neu, dass Platin 1 und Bronze 1 zusammen in eine Lobby können. Muss man nicht mindestens G2 sein um mit jemanden zu queuen der P2 ist ?","replies":[{"poster":"MeMyselfandBaal","date":"2017-07-14T20:59:31.515+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=NukedToasty,realm=EUW,application-id=ImBE6GqA,discussion-id=RzNjeBHg,comment-id=00010000,timestamp=2017-07-14T20:36:29.089+0000)\n>\n> Ist mir neu, dass Platin 1 und Bronze 1 zusammen in eine Lobby können. Muss man nicht mindestens G2 sein um mit jemanden zu queuen der P2 ist ?\n\nFlex Que= Eigenes Matchmaking... ich sag das mal so: Als ich diese Que noch spielen \"musste\", weil während der Preseason SoloDuo nicht freigeschaltet war... spielte in gefühlt jedem Spiel ein Diamond Dude gegen einen Bronze Dude auf der Lane. Und das Spiel wurde dadurch entschieden, auf welcher Seite der Diamond Dude stand... auch wenn es schön ist eine Cassiopaia perfekt kiten zu sehen, macht Ranked Spielen so keinen Spaß...\nAber wenn der Platin 1 Dude einfach zu Beginn dieser Que mit dem Bronze 1 Dude angefangen hat... weil die eigentlich schon immer gemeinsam Ranked spielen wollten, es aber vorher nicht konnten... dann behalten die beiden in dieser Que unabhängig von ihrer \"Richtigen Wertung\" für immer in einem ähnlichen Bereich, so dass sie, obwohl sie sich in der SoloQ auseinander Bewegen, ewig zusammen spielen können.\nUnd ja, die Flex Que ist einfach nur eine richtig beschissene Idee gewesen. Das habe ich gleich gesagt und daran wird sich auch nichts mehr ändern... ich nutze sie hauptsächlich (und selbst dann nur mit schlechtem Gewissen) auf meinem Smurf... und da... müsste ich demnächst wieder nen paar Spiele sabotieren, damit ich nicht Gold werde... denn sobald ich Gold V bin, kann ich nicht mehr mit meinen Bronzefreunden \"Teamranked\" zocken...","replies":[]}]}]},{"poster":"Hydra","date":"2017-07-14T18:08:54.090+0000","up_votes":1,"down_votes":0,"body":"Git Gud.{{champion:157}}","replies":[]}]}