{"poster":"Soy Tom","date":"2019-05-02T20:58:48.358+0000","title":"No puedo entrar, se me queda en autenticando","subforum":"Problemas Técnicos","up_votes":9,"down_votes":0,"body":"Yo se, que todo esto es culpa de telered, una empresa de Argentina que es bastante mediocre, pero por favor, quiero que me digan cuando pueden llegar a solucionar esto, porque me voy a quedar atrás con la misiones, etc.","replies":[{"poster":"CodFish","date":"2019-05-02T21:28:01.532+0000","up_votes":2,"down_votes":0,"body":"Yo desde ayer que no puedo entrar, bastante malo el servicio de telered, ademas de jugar con lag repetidas veces no me deja entrar al juego :/","replies":[{"poster":"Mmm Sad","date":"2019-05-02T22:46:12.188+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=CodFish,realm=LAS,application-id=X54mVVp0,discussion-id=xEoO18mf,comment-id=0001,timestamp=2019-05-02T21:28:01.532+0000)\n>\n> Yo desde ayer que no puedo entrar, bastante malo el servicio de telered, ademas de jugar con lag repetidas veces no me deja entrar al juego :/\n\n\"Bastante malo el servicio de telered\" llevo 2 años con TeleRed y nunca me dieron mal servicio, no hables sin saber n.n.\nClaramente lo que digo parece que estoy defendiendo a la compañía pero sólo defiendo una mala acusación y espero que se arregle la porquería de error con los servidores del lolcito es muy pajoso no jugar :s.\nUn placer que tengas buen día ♥.","replies":[{"poster":"Its ok to flame","date":"2019-05-02T23:00:09.330+0000","up_votes":2,"down_votes":0,"body":"Estas justamente defendiendo a una mala compañia. ¿Por qué la juzgamos si no? Estuve como 6 meses en total con +150ms y ahora esto... Estaticen los servicios por dios ya fue esta mierda","replies":[{"poster":"Better ADC Wiin","date":"2019-05-02T23:02:27.584+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Its ok to flame,realm=LAS,application-id=X54mVVp0,discussion-id=xEoO18mf,comment-id=000100010000,timestamp=2019-05-02T23:00:09.330+0000)\n>\n> Estas justamente defendiendo a una mala compañia. ¿Por qué la juzgamos si no? Estuve como 6 meses en total con +150ms y ahora esto... Estaticen los servicios por dios ya fue esta mierda\n\nCambiate de empresa entonces xd","replies":[{"poster":"Its ok to flame","date":"2019-05-02T23:06:51.527+0000","up_votes":3,"down_votes":0,"body":"Ese es el problema pelotudo, las empresas de servicios tienen monopolios geográficos, no tengo alternativa. ESTATICEN. YA","replies":[]}]}]},{"poster":"CodFish","date":"2019-05-03T01:13:38.300+0000","up_votes":1,"down_votes":0,"body":"Si te digo que tengo que tengo lag constantemente es porque lo tengo, que gano con mentirte.. a eso sumale los cortes de 10 a 15 min, a mi el servicio me parece una completa mierda, a vos te puede funcionar bien pero en mi caso no..","replies":[]},{"poster":"Soy Tom","date":"2019-05-02T23:02:33.805+0000","up_votes":1,"down_votes":0,"body":"Bueno, por empezar, te felicito, pero la verdad, a mi desde que puse telered, no me trajo mas que problemas, Mmm Sad, nose de que región de Argentina sos, pero yo soy de Buenos Aires (Moreno, que sería provincia). Desde que contrate esta empresa, no me trajo mas que problemas y más problemas, hace poco me entere, que tengo 250 gb para gastar en un MES, osea, pensemos en un minuto de un vídeo de YouTube (a 1080p) se gastan al rededor de 27 mb, eso sería que en un video de 10 minutos, estaría gastando 270 mb, un juego de steam (dependiendo de cual, pero me refiero a los 3A) pesan al rededor de 20 gb, aprox, en un mes yo gasto mas de 250 gb, por ende después de gastar los dichosos 250 gb, me empieza a correr a 10 mb (me olvide de aclara que yo estoy pagando 20 mb).\nNunca me informe de esto, hasta que fui a la oficina mas cercana de telered, por esto y por muchas cosas más, es que la considero una empresa mediocre, pero igual no me refiero a esta sola, me refiero a la gran cantidad de empresas de Internet de Argentina que se manejan por la provincia, como pueden ser, bueno, telered, telecentro, skynet, etc.\nNo quiero cambiar y espero no cambiar tu opinión sobre la empresa, pero es entendible que haya gente que no este de acuerdo y que piense que este servicio es malo. Saludos","replies":[{"poster":"Soy Tom","date":"2019-05-02T23:06:00.344+0000","up_votes":1,"down_votes":0,"body":"Pd: no pongan \"cámbiate de empresa\", no es tan fácil como levantar el teléfono y decir \"hola quiero cambiar de empresa\", es mucho mas complejo, solo quiero que como empresa \"profesional\" que son, se dediquen mas al cliente y menos a la ganancia, pero no creo que se pueda dar.","replies":[]}]}]},{"poster":"Soy Tom","date":"2019-05-02T22:01:57.675+0000","up_votes":2,"down_votes":0,"body":"Si, a mi me pasa exactamente lo mismo, si bien me contacte al soporte me dijeron \"Estamos conscientes que hay un problema con el inicio de sesión, para algunas cuentas en Argentina y tenemos un equipo que trabaja para solucionarlo. Te pido disculpas por este inconveniente, pero generalmente este error se presenta por el proveedor \"telered\" .\"\nOjalá lo solucionen pronto.","replies":[]}]},{"poster":"Ermhac","date":"2019-05-03T01:41:57.035+0000","up_votes":1,"down_votes":0,"body":"Tengo TeleRED y es la primera vez que me pasa esto, ni siquiera tengo los famosos microcortes. Pero  no puedo negar que en momentos así me molesta","replies":[{"poster":"Soy Tom","date":"2019-05-03T11:32:18.497+0000","up_votes":1,"down_votes":0,"body":"A mí también es la primera vez que me pasa esto, pero no es la primera vez que tengo un problema con telered. Desde los microcortes hasta bajadas en los mb, lo único que me pone deja \"contento\" es que no es solo un problema mío y de mi región, sino que es de varios.","replies":[{"poster":"Ermhac","date":"2019-05-03T20:42:31.380+0000","up_votes":1,"down_votes":0,"body":"Por suerte ya lo solucionaron...","replies":[]}]}]},{"poster":"Black Dohko","date":"2019-05-03T04:35:25.395+0000","up_votes":1,"down_votes":0,"body":"A mi también Telered me anda muy bien, no solo no tengo micro cortes sino que las descargas son mas de lo que pago, streams en vivo sin problema.\n\nMuy cada tanto hay algun problema, 2 o 3 veces al año, les aviso y lo arreglan generalmente en el dia.","replies":[{"poster":"Soy Tom","date":"2019-05-03T11:30:28.014+0000","up_votes":1,"down_votes":0,"body":"Bueno, hace el favor de llamar y ver si pueden solucionar esto. Aunque no creo, porque la atención al cliente, se la pasan por atrás.","replies":[]}]},{"poster":"Lapram","date":"2019-05-02T23:41:38.942+0000","up_votes":1,"down_votes":0,"body":"no tiene ninguna solucion?¿","replies":[{"poster":"Soy Tom","date":"2019-05-02T23:54:55.606+0000","up_votes":1,"down_votes":0,"body":"Por el momento, no. Solo queda esperar.","replies":[]}]},{"poster":"multiSTX","date":"2019-05-02T23:20:12.461+0000","up_votes":1,"down_votes":0,"body":"Lo que mas me jode es que quizás ustedes que son mas chicos que yo y no saben pero por mes aumentan encima el costo del servicio que es una basura, yo pago por 10 mb y por lo general me anda bien el lol pero loco no pueden cobrar casi 1000 pesos de Internet por 10 mb que es poco en si y que anda mal.","replies":[{"poster":"Soy Tom","date":"2019-05-02T23:33:15.087+0000","up_votes":1,"down_votes":0,"body":"Tal cual, el servicio de 20 mb, esta al rededor de 1600 pesos, el cual es de funcionamiento cuestionable, hay momentos en los que anda bien y otros en los que anda mal, y por ese precio, deberían andar bien las 24 hrs del día.","replies":[]}]}]}