{"poster":"lPikachu","date":"2015-06-29T20:44:05.299+0000","title":"Fizz Híbrido, ¿Rendiría?, ¿Te apuntas a experimentar?","subforum":"Guias y consejos","embed":{"description":null,"url":"http://img08.deviantart.net/9784/i/2014/077/a/f/lol___fizz_by_luliyoyo-d7aocbn.png","image":null},"up_votes":1,"down_votes":0,"body":"Bueno, he estado experimentando en partidas normales, una extra&ntilde;a y algo efectiva build con Fizz {{champion:105}}  y es armarlo h&iacute;brido, pero no cualquier tipo de h&iacute;brido... si no que armarlo a miti/miti en sus estad&iacute;sticas.\r\n\r\nHe jugado varias partidas probandolo, y me da resultados buenos, pero aun as&iacute; dudo llevarlo al SoloQ...\r\n\r\nLa build que he probado es...\r\n{{item:2041}}  {{item:2003}} {{item:2004}}  Para comenzar...\r\n{{item:3057}} {{item:1001}}  First Back... o si me fue bien... {{item:1058}} \r\n\r\nNada raro hasta aqu&iacute; pero...\r\nFirst Item (Core): {{item:3157}}  - {{item:3078}}  - {{item:3020}}/{{item:3111}} \r\nLuego: {{item:3165}}    - {{item:3153}} \r\nLast Item: {{item:3026}} {{item:3102}} \r\n\r\nSe ve extra&ntilde;a pero me ha dado resultados por lo menos positivos, me suple muchas faltas con Fizz, y encima puedo doble mitigar las defensas de los enemigos, ademas de tener algo de DPS, sustento, AP, sum&aacute;ndole el combo de la R B&aacute;sicos, habilidades, puedo sumar r&aacute;pidamente mucho da&ntilde;o y aguantar a la vez y sin contar que puedo deletear a los carry aguantando mucho mas...\r\n\r\nEs una idea bastante loca, pero como he dicho a trav&eacute;s del experimento se dan resultados...\r\nTambi&eacute;n he pensado en hacerlo AD simplemente pero solo con el Zhonya como ayuda AP... pero...\r\n\r\nPero es una build que esta en desarrollo, y quisiera que los mains Fizz como yo podamos desarrollar una build netamente nueva e h&iacute;brida...\r\n&iquest;Alguien se apunta?&iquest;Alguien se une a experimentar la experiencia?\r\n\r\n---------------------------------------------------\r\nFormato del Experimento si quieres hacerlo:\r\n\r\nCondiciones del experimento:\r\n-Probar la build h&iacute;brida (prioriza ap como ad y suple las necesidades de mana y sustento a la vez el da&ntilde;o) o inventar la tuya y ponerla.\r\n-Explicar que suple la build, sus ventajas y desventajas.\r\n-Conclusiones Final en las partidas: (Anota tu experiencia, ojala lo pruebes en unas 3 a 5 partidas al menos).\r\n\r\n-------------------------------------------------------\r\nMi Experimento:\r\nProb&eacute; la build, como lo que explique al principio... {{item:3157}} {{item:3020}} {{item:3078}}{{item:3153}}  {{item:3165}} {{item:3102}} \r\nMe suple mucho en ambas necesidades, sustento, mana, heridas graves, da&ntilde;os por DPS, CD reducci&oacute;n, defensas, y al tener zhonya y la E puedo salvarme de situaciones complicadas, puedo entrar a pelear pudiendo sostenerme bien... \r\n\r\nMi Conclusi&oacute;n:\r\nAunque siento que el da&ntilde;o es mas lento en late, pude ver que es dif&iacute;cil mitigarlo ya que por lo general fizz ap es mitigable en league of tanks, pero el h&iacute;brido es mas complicado de contrarrestarlo.","replies":[{"poster":"rokushoger","date":"2015-06-30T12:11:32.655+0000","up_votes":1,"down_votes":0,"body":"Entrá al perfil de revenant en youtube y mira el fizz que juega él en top, te va a gustar.","replies":[]},{"poster":"rroca9","date":"2015-06-29T21:11:33.337+0000","up_votes":1,"down_votes":0,"body":"Cambiá Morello por {{item:3110}} y es la build de Fizz tank/efectos de impacto que se usa cuando lo juagas en top o jungla, mirá http://www.probuilds.net/guide/EUW/2176351157/372983\n\nRinde bastante, la diferencia es que tenes daño constante en vez de burst y duras más metido en una teamfight. Si mirás competitivo lo usan en top con smite/ignite y se ponen el smite rojo, el que hace que tus básicos hagan daño verdadero. Suerte!","replies":[]}]}