{"poster":"Zselétia","date":"2014-12-27T19:01:59.083+0000","title":"Elegem van","up_votes":1,"down_votes":0,"body":"Az lenne a kérdésem, hogy mikor lehet átmenni megint ingyen az EUW szerverre, mert nagyon elegem van abból, h egy ranked, v bármilyen meccset nem lehet elkezdeni mert már a lobbyban trollokkal kell \"küzdenem\".Tehát , mikor lehet átmenni ingyen az EUW-ra?","replies":[{"poster":"Zooty","date":"2014-12-27T19:09:13.787+0000","title":null,"up_votes":5,"down_votes":0,"body":"Nem valószínű hogy lehet majd a jövőben, amúgy meg nem lesz jobb ott se... Némíts mindenkit aki nem bír értelmesen beszélni, és játszd a saját játékod.","replies":[{"poster":"cryonsiceXjoe","date":"2014-12-28T15:54:30.844+0000","title":null,"up_votes":1,"down_votes":0,"body":"\"játszd a saját játékod\" egy olyan játékban, ami teljes mértékben a csapatjátékra épül? Nekem ezekből a trollokból van elegem, nem szólnak ss-t, nem segítenek, nem lehet nekik gankelni, csak vannak maguknak. Ilyen játékosok képtelenek a csapattal együttműködni, egyedül nekimennek az enemynek, és feedelés + flémelés a vége. Meccs végén lehet tiltani meg reportolni, de semmi értelme nincs solozni egy teamgame-ben.\nA téma létrehozójának pedig azt üzenem, hogy engem is nagyon idegesít, és ezért már nem is játszok annyit mint régebben, mert minden játékban van 1 troll, aki flamel + direkt feedel, 1 instalocker és 1 afk-s (ez egy átlagos ranked meccs, normál játékot szóba se hozom).","replies":[]}]},{"poster":"SportzMan","date":"2014-12-28T12:36:29.768+0000","title":null,"up_votes":3,"down_votes":0,"body":"Az előttem szólók jól mondják, nem valószínű hogy mostanság lesz ingyen transfer westre. És nem tudom besorolásod van, de gold 1-ig (illetve még ide tartozik a plat 5 is) ugyan olyan katasztrófa a játékosok hozzáállása mind a 2 szerveren... Szóval ne várd azt, hogy sokkal jobb lesz neked ott.. Inkább keressél egy duo partner, akinek a képességeiben megbízol, és akkor máris csak 3 \"trollt\" kaphattok és az ellenfélben pedig 5 \"troll\" lesz nagy valószínűséggel.","replies":[]},{"poster":"Deapimp","date":"2014-12-28T23:17:56.510+0000","title":null,"up_votes":1,"down_votes":0,"body":"Silver 5-be csodát ne várj, plat 1-2 környékén már lehet normálisan is solo q-zni de addig GL :)","replies":[]},{"poster":"Mind The Gap","date":"2014-12-28T21:38:28.326+0000","title":null,"up_votes":1,"down_votes":0,"body":"Igen, idegesítenek... Csak sajnos a lobbyba nem tett a Riot némító gombokat, ezért egyesével kell beírkálnom a nevüket az Ignore listre... Alig várom már a játékon belüli Mute all gombot, mert egyesével mute-olgatni kicsit kezd idegesíteni.","replies":[{"poster":"Deapimp","date":"2014-12-28T23:09:31.146+0000","title":null,"up_votes":1,"down_votes":0,"body":"/mute all","replies":[]},{"poster":"Brăd","date":"2014-12-28T23:02:58.532+0000","title":null,"up_votes":1,"down_votes":0,"body":"chat: /mute all\ntab menü: hangszóró ikon (név mellett)","replies":[]}]},{"poster":"R3wan","date":"2014-12-27T19:05:41.828+0000","title":null,"up_votes":1,"down_votes":0,"body":"Szerintem semmikor. A lokalizáció miatt volt ingyenes transfer EUNE szerverre. Ha át akarsz menni, akkor muszáj lesz rp-t venned hozzá.","replies":[]}]}