{"poster":"LNRGY","date":"2015-06-10T19:00:48.590+0000","title":"Endlich ein neuer Zac skin aber.......","subforum":"Skin- & Champion-Konzepte","up_votes":2,"down_votes":5,"body":"Ich hab das schonmal angesprochen doch jetzt fang ich mal anderst an.\r\n\r\nEndlich, f&uuml;r viele von euch vermutlich ein Traum der in erf&uuml;llung geht. Ein neuer Zac Skin kommt raus. \r\nDas ist auch erstmal echt geil da auch ich, selbst wenn ich ihn nicht sehr h&auml;ufig spiele, mitbekommen habe das Zac seit ner ewigkeit keinen neuen Skin bekommen hatte. (Ich glaube der einzge den er hat ist mit seinem release gekommen. Lieg ich da richtig?)\r\n\r\nJetzt kommt allerdings meine Frage an alle. (Vorrangig an Zed Spieler)\r\n\r\nFindet ihr es OK das Riot Rek`Sai jetzt schon nen neuen Skin gibt obwohl er im Grundegenommen erst rauskahm und Zed, der schon seit ewigen zeiten da ist nicht?\r\nWo ist den da die Logik? Nat&uuml;rlich passt Poolparty vermutlich garnicht zu Zed aber totzdem. \r\n\r\nWas kommt als n&auml;chstes? In 3 Wochen ein neuer Ekko Skin damit ihn jeder wieder spielt weil sie ihn im n&auml;chsten Patch totnerfen? (Versteht mich jetzt bitte nicht falsch. Das ding muss generft werden.\r\n\r\nAlso, was haltet ihr davon? Und wann denkt ihr kommt Riot auf die Idee einen Zed Skin zu machen?","replies":[{"poster":"Ηastur","date":"2015-06-11T14:31:59.807+0000","up_votes":1,"down_votes":0,"body":"Ich finde Annie oder Teemo könnten auch mal wieder einen vertragen.","replies":[{"poster":"xSheilax3","date":"2015-06-11T16:52:25.205+0000","up_votes":1,"down_votes":0,"body":"Teemo? Hatte er nicht einen Legendary Skin ^^' ?","replies":[{"poster":"Ηastur","date":"2015-06-12T01:10:36.290+0000","up_votes":2,"down_votes":0,"body":"pssst..\nBitte sags keinem, aber das war ein Spaß. :D","replies":[{"poster":"xSheilax3","date":"2015-06-20T12:04:46.717+0000","up_votes":1,"down_votes":0,"body":"Irgendwie habe ich nicht gelacht. :D","replies":[{"poster":"Syberslevers","date":"2015-06-21T00:49:08.270+0000","up_votes":1,"down_votes":0,"body":"Weil du keine Ironie verstehst Kappa","replies":[{"poster":"xSheilax3","date":"2015-06-21T12:42:04.046+0000","up_votes":1,"down_votes":0,"body":"Weil es nicht lustig war Kappa","replies":[]}]}]}]}]},{"poster":"Syberslevers","date":"2015-06-11T14:41:25.510+0000","up_votes":1,"down_votes":0,"body":"Weil Beide 8 Skins haben","replies":[{"poster":"Ηastur","date":"2015-06-12T01:09:53.633+0000","up_votes":1,"down_votes":0,"body":"Annie hat 10, wenn man den Standardskin mitrechnet, und somit mehr als alle anderen, knapp vor Ryze, der übrigens auch mal wirklich einen guten gebrauchen könnte. Wenn klugscheißen, bitte vorher informieren. =)","replies":[]}]}]},{"poster":"Veezey","date":"2015-06-10T19:32:21.038+0000","up_votes":1,"down_votes":2,"body":"Ich finds auch nicht gut, dass Rek'Sai jetzt schon einen neuen Skin bekommt.","replies":[{"poster":"B4nanaSplit","date":"2015-06-11T14:26:02.573+0000","up_votes":1,"down_votes":0,"body":"Warum? Wäre es besser wenn er gar keinen bekommt? Ich verstehe solche Leute einfach nicht!","replies":[{"poster":"Syberslevers","date":"2015-06-11T14:42:05.087+0000","up_votes":1,"down_votes":0,"body":"Nein. Nur nicht schon nen halbes Jahr nach release","replies":[{"poster":"B4nanaSplit","date":"2015-06-11T20:19:27.385+0000","up_votes":2,"down_votes":0,"body":"Ja warum? Ich will jetzt mal erklärt bekommen was daran schlimm ist das Rek'Sai einen Skin bekommt anstatt gnar oder Azir, nur weil Rek'Sai noch nicht lang draußen ist. Das ergibt so überhaupt keinen Sinn!","replies":[{"poster":"Syberslevers","date":"2015-06-12T16:58:36.386+0000","up_votes":1,"down_votes":0,"body":"{{champion:421}} ist nicht länger draußen. Riot wartet normal ein Jahr bevor die mit Skinrotationenn anfangen","replies":[{"poster":"B4nanaSplit","date":"2015-06-12T19:40:20.112+0000","up_votes":1,"down_votes":0,"body":"Jo, hab mich verschrieben. Und btw. Riot hat früher wenn Champs rausgekommen sind oft mehr als 2 Skins rausgehauen.","replies":[{"poster":"Syberslevers","date":"2015-06-13T15:12:23.652+0000","up_votes":1,"down_votes":0,"body":"Ja. Aber das haben sie über 2 Jaher nicht mehr gemacht nach \"nur\" 6 Monaten nen eunen Skin rauszuhauen","replies":[]}]}]}]}]},{"poster":"Veezey","date":"2015-06-11T14:57:09.623+0000","up_votes":1,"down_votes":0,"body":"Ist noch zu früh für sie. Davor müssten noch Azir und Kalista einen Skin bekommen und einige andere, die schon ewig warten.","replies":[]}]}]},{"poster":"Dute Universe","date":"2015-06-10T19:33:45.665+0000","up_votes":2,"down_votes":0,"body":"Neue Poolparty skins für Zac, Lulu, Rek, Mundo, Draven","replies":[]},{"poster":"Ehren Teemo","date":"2015-06-10T19:04:29.094+0000","up_votes":2,"down_votes":0,"body":"Lass sie doch Skins raus bringen wan sie wollen ...und bitte für Ted gibt es auch schon ein Haufen skins","replies":[{"poster":"Veezey","date":"2015-06-10T19:33:15.770+0000","up_votes":1,"down_votes":0,"body":"Ja 2 Skins sind natürlich extrem viel. Vorallem, wenn einer davon nur einmal pro Jahr erhältlich ist.","replies":[]}]},{"poster":"B4nanaSplit","date":"2015-06-10T20:18:25.296+0000","up_votes":3,"down_votes":1,"body":"Oh mein Gott... was ist daran unfair das Rek'Sai einen Skin bekommt ?? Wenn du Rek'Sai nicht spielst kann es dir egal sein; wenn du sie spielst sei froh. \nAber zu sagen so etwas ist \"unfair\" ist einfach so sinnlos.\nWarte einfach ab. Riot wird schon noch einen Skin für Zed entwickeln.","replies":[{"poster":"Syberslevers","date":"2015-06-11T05:25:06.598+0000","up_votes":1,"down_votes":4,"body":"Es ist nicht fair, weil es einige Champs gibt, die vor ihm rauskamen und keinen 2 Skin besitzen. {{champion:268}} {{champion:429}}","replies":[]}]},{"poster":"AI Tackras","date":"2015-06-11T16:06:18.292+0000","up_votes":5,"down_votes":3,"body":"Die meisten hier sind einfach nur der Tiefpunkt der League of Legends Szene.\n\"Mein Champ soll ein neuen Skin bekommen\" mimimi..\nHeult leise und macht dafür kein Thread auf.\n\nIst doch einfach nur dämlich.\nZed hat 2 Skins und das reicht vorerst!\nHolt euch Customskins wenn ihr jede Woche nen neuen braucht.","replies":[{"poster":"Enderized","date":"2015-06-21T01:04:41.625+0000","up_votes":1,"down_votes":1,"body":"Es geht um Reguläre Skins. Die Team-Skins betrachten die meisten Spieler nicht als Skins als solche, zumal sie immer nur zu Meisterschaften usw freischaltbar, kaufbar sind.\n\nSkins dienen den meisten Menschen dazu, zu zeigen, dass diese Willig sind, Geld in ein Spiel, welches ihnen gefällt, zu investieren, sowie um zu zeigen, dass sie einen Champion gerne spielen.\n\nDie 2 Zed Skins von denen du redest, sind kaum mehr als eine Retexturierung und minimale Modell-Changes wenn du mich fragst :)\n\nDas Zed überhaupt den 2. Skin bekommen hat, darf er alleine SKT T1 verdanken. Ansonsten hätte er immer noch keinen. Und wenn ich seinen Release\n> RELEASE DATE\n> 2012-11-13\n\nanschaue sind 2 Skins in der Zeit recht dürftig oder nicht?\n\nCustom Skins sind zwar auch nett, unterstützen aber weder finanziell Riot, noch kann man damit ''angeben''.","replies":[{"poster":"AI Tackras","date":"2015-06-21T19:39:47.820+0000","up_votes":1,"down_votes":1,"body":"Reichen vorerst. Siehe Zac, da hats gedauert.\nGibt genügend Champs die nur Retexured Skins haben. Ist doch auch nichts bei.\nWenn du einen neuen haben willst dann download dir nen Custom Skin.","replies":[{"poster":"Enderized","date":"2015-06-22T14:40:23.922+0000","up_votes":1,"down_votes":1,"body":"Ich zitiere mich mal selber:\n\n> Custom Skins sind zwar auch nett, unterstützen aber weder finanziell Riot, noch kann man damit ''angeben''.\n\nIch habe ausserdem nie gesagt, das ich einen neuen Skin will. Bin mit meinem SKT T1 Zed vollkommen zu frieden ;)","replies":[{"poster":"AI Tackras","date":"2015-06-22T15:35:51.895+0000","up_votes":1,"down_votes":1,"body":"Kauf dir nen Skin und ersetze den durch nen Custom. Unterstützt damit und kannst auch angegeben.\nWas ne attention whore ....","replies":[{"poster":"Enderized","date":"2015-06-22T16:49:53.141+0000","up_votes":1,"down_votes":1,"body":"Nur warum kaufe ich mir einen Skin, welchen ich dann eh ersetze? ;)","replies":[{"poster":"AI Tackras","date":"2015-06-23T07:28:04.335+0000","up_votes":1,"down_votes":1,"body":"Ganz einfach, du hast damit Riot unterstütz (was dir ja so wichtig ist) und kannst gleich noch mit einem Skin angeben (was du ja unbedingt nötig hast). Damit sind alle deine Wünsche erfüllt.","replies":[{"poster":"Enderized","date":"2015-06-23T11:30:12.486+0000","up_votes":1,"down_votes":1,"body":"Das nenn ich mal eine gelungene übertriebende Unterstellung xD\n\nKaufst dir auch einen Mercedes um mit einem Audi zu fahren, damit du Mercedes unterstützt? :)\n\nDie Logik ist in diesem Fall wohl eher nicht gegeben oder? ;)","replies":[{"poster":"AI Tackras","date":"2015-06-23T14:21:23.787+0000","up_votes":1,"down_votes":0,"body":"Richtig, die Logik fehlt in deinem Beispiel. Hat aber wenig mit meinem zu tun ;)\nUnterstützen tust du hier nur einen und das ist immer der gleiche. Macht kein Unterschied ^^\nNagut von dir habe ich auch kein durchdachten Post erwartet.","replies":[{"poster":"Enderized","date":"2015-06-23T18:15:49.745+0000","up_votes":1,"down_votes":0,"body":"> Mein Comment\n> Kaufst dir auch einen Mercedes um mit einem Audi zu fahren, damit du Mercedes unterstützt? :)\n\n> Dein Comment\n> Kauf dir nen Skin und ersetze den durch nen Custom. Unterstützt damit und kannst auch angegeben.\n\nVielleicht siehst du so besser die Parallelen? ;)\n\nDas mit dem\n\n> Nagut von dir habe ich auch kein durchdachten Post erwartet.\n\nfasse ich übrigens als persönliche Beleidigung auf ;)","replies":[{"poster":"AI Tackras","date":"2015-06-23T18:59:47.075+0000","up_votes":1,"down_votes":0,"body":"Immer noch schwachsinn :)\nUnd fasse es so auf wie du willst ;)","replies":[]}]}]}]}]}]}]}]}]},{"poster":"XOFree","date":"2015-06-21T20:51:49.822+0000","up_votes":1,"down_votes":0,"body":"wo er recht hat ^^ , hat er recht ^^","replies":[{"poster":"Enderized","date":"2015-06-22T14:41:13.199+0000","up_votes":1,"down_votes":0,"body":"Ich habe immer Recht :p\nNaja meistens zumindest :))","replies":[]}]}]}]},{"poster":"StickSlipEffekt","date":"2016-05-31T09:26:55.936+0000","up_votes":1,"down_votes":0,"body":"Ich finde es genau so doof wie du ich liebe zac zu spielen besonders im jungel habe jeden skin von ihm leider nur 2 und verstehe auch nicht wieso so selten oder praktisch nie ein zac skin raus gebracht wird klar spielen nicht so viele leute ihn aber es gibt genug andere champs die auch keiner spielt aber trotzdem 6 skins haben :(( \nUnd ich rede hier aus der patch note 6.10","replies":[{"poster":"Shadowscreen","date":"2016-05-31T09:46:59.990+0000","up_votes":1,"down_votes":0,"body":"der thread ist fast 1 Jahr alt, das Thema sollte also nicht mehr ganz aktuell sein :x","replies":[]}]},{"poster":"Protective Puppy","date":"2015-06-21T19:59:59.275+0000","up_votes":1,"down_votes":0,"body":"Riot macht Skins nach Ideen, nicht nach Champ-Releases.\n\nUnd einen Poolparty-Zed find ich nicht besonders schön.","replies":[]},{"poster":"holomolo","date":"2015-06-15T16:16:57.159+0000","up_votes":1,"down_votes":0,"body":"Zed hat doch 2 skins. SKT T1 skin","replies":[{"poster":"Enderized","date":"2015-06-21T00:59:14.698+0000","up_votes":1,"down_votes":0,"body":"Es geht um Reguläre Skins. Die Team-Skins betrachten die meisten Spieler nicht als Skins als solche, zumal sie immer nur zu Meisterschaften usw freischaltbar, kaufbar sind","replies":[]}]},{"poster":"XIII BTLmovies","date":"2015-06-21T00:55:36.769+0000","up_votes":1,"down_votes":0,"body":"So wie ich das mal gelesen habe ist es folgend : Riot geht nach keiner wirklichen Order, sie haben zwar ihre \"Wer braucht eig. einen Skin\"-Liste. Aber dennoch geht Riot eher nach Ideen. Wenn sie eine Idee für einen Skin haben und alle im Team den gut finden, wird er angefangen und wird erstellt. Dann iwann gehen sie zu einem Boss, stellen das vor und wenn er grünes Licht gibt, wird er erstellt. So in etwa, habe ich das verstanden.","replies":[]},{"poster":"iBangYourMum","date":"2015-06-13T12:00:55.928+0000","up_votes":1,"down_votes":0,"body":"ja oder nen gnar skin wäre auch geil","replies":[]},{"poster":"EoR Prof LoL","date":"2015-06-11T09:35:12.085+0000","up_votes":1,"down_votes":0,"body":"Ja klar weil Zed auch neue Skins braucht. Ich liebe es wie ignorant einige Spieler sein können. Zac bekommt nen Poolparty und ein Chroma Pack dagegen kann mann echt nichts sagen schließlich wurde PoolParty Zac schon vor knapp 2 Jahren gezeigt.\nDer Champion mit der jetzigen Höchstpriorität ist mit Abstand Yorick.\nEr kam 2 Jahre vor Zac raus und wir haben immernoch bloß die Anfangsskins.\nIch hab ja Verständnis das einige Champs auf Skins warten müssen weil diese viel Arbeit machen z.B. Udyr.\nAber 4 Jahre sind echt genug solangsam könnte denen mal was einfallen.\nMeine Idee: Farmer Yorick ersetzt die Geister durch Gemüße.\nReksais Skin verändert ihr gamefeeling kein Stück ich finds gut das Sie nen richtigen Skin bekommt.","replies":[{"poster":"Syberslevers","date":"2015-06-11T14:12:52.131+0000","up_votes":1,"down_votes":0,"body":"Du hast Recht. Es gibt aber 2 Skins zu Jorick. Würde mich über ein VU mehr freuen.","replies":[]}]},{"poster":"Rexarias","date":"2015-06-10T19:29:20.256+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Syberslevers","date":"2015-06-10T19:55:32.477+0000","up_votes":2,"down_votes":3,"body":"PBE. Jemals davon gehört. Die LOL-Szene geht steil, aber es gibt Leut die merken es nicht. Geh einfach auf Surrender at 20. Die ersten beiden Links","replies":[]}]},{"poster":"Death is Beauty","date":"2015-06-10T19:04:28.600+0000","up_votes":1,"down_votes":2,"body":"Also in irgendeinem YT Video habe ich mal gehört das Riot Champions bevorzugt Skins geben, bei dennen sie sich nicht ganz sicher sind ob diese Champions balanced sind. Ich kann aber auch falsch liegen also lieber nicht auf diese Theorie versteifen :'D","replies":[]},{"poster":"Syberslevers","date":"2015-06-10T19:13:08.714+0000","up_votes":1,"down_votes":3,"body":"Der {{champion:238}} Skin wird kommen. Die haben ihn so totgenerfed, das er wieder gepushed werden muss um wieder erfolg zu haben","replies":[]}]}