{"poster":"Mindstar","date":"2018-03-05T02:55:58.450+0000","title":"OCE Server Maintenance March 6th - 8th.","subforum":"Announcements","embed":{"description":null,"url":"http://status.leagueoflegends.com/#oce","image":null},"up_votes":3,"down_votes":0,"body":"Hey everyone!\r\n\r\nHeads up on maintenance happening within our datacenters from ~1am-7am AEDT (Sydney time) on March 6, March, 7, and March 8 that could affect the OCE servers. Since we&#039;re doing testing on redundant systems, we&#039;re hopeful that gameplay won&#039;t be impacted, though we&#039;ll be keeping a careful eye on player impact during the maintenance windows. If all goes well, no one will even notice it ever happened \\o/\r\n\r\nFor any changes, stay tuned to the Service Status Page, or right here on boards!\r\n\r\nCheers!\r\nMindstar","replies":[{"poster":"God Death 7th","date":"2018-03-13T04:06:49.625+0000","up_votes":1,"down_votes":0,"body":"Hi, have a problem that the latency rise a lot during this maintenance and it remains until now, how to fix it?","replies":[]},{"poster":"Essembie","date":"2018-03-06T22:09:49.384+0000","up_votes":1,"down_votes":0,"body":"Update speeds are horrendous.\n\n50kbps down (speed test shows connection gets 22mbps so it isnt at my end).\n\nfor a 9 gig update, we'll be done in 2,900 minutes which is only ....... 48 hours ......","replies":[]},{"poster":"Marion","date":"2018-03-06T22:04:09.003+0000","up_votes":1,"down_votes":0,"body":"I am having the same problem as GrimReaper. It's been happening for about 2 hrs now","replies":[]},{"poster":"Wyldfyre","date":"2018-03-05T22:43:34.731+0000","up_votes":1,"down_votes":0,"body":"Hey guys, have an issue where my last game ended and would not bring up the stats page or honor ability. So i hit skip waiting for stats.  After that it will not allow me to start a new game. I closed the launcher and opened again and it takes me back into looking for the previous game I was in that had finished, rinse repeat. \n\nNot worried, just letting you know of the bug.","replies":[{"poster":"Larry Fisherman","date":"2018-03-06T00:38:03.365+0000","up_votes":1,"down_votes":0,"body":"Has yours started working yet?","replies":[{"poster":"Wyldfyre","date":"2018-03-06T00:39:11.402+0000","up_votes":1,"down_votes":0,"body":"Nope, made a post in the help/support forum as well!\n\nJust tried again and it has started looking. will keep you posted on if it actually finds a game or not.","replies":[{"poster":"Wackednz","date":"2018-03-06T01:04:48.656+0000","up_votes":1,"down_votes":0,"body":"It's letting me queue again but didn't give me the win credit so wew lad.","replies":[]}]}]}]},{"poster":"Larry Fisherman","date":"2018-03-06T00:34:22.686+0000","up_votes":1,"down_votes":0,"body":"Just played a game and the stats wernt loading so I skipped them, came back my que wouldnt start so i relogged and it tried to tell me im still in a game. I repeated this process about 5x and even restarted my pc. Nothings working I would appreciate feedback. Oh and i done the full repair 3 times.{{item:3025}}","replies":[{"poster":"Mindstar","date":"2018-03-06T00:56:58.687+0000","up_votes":1,"down_votes":0,"body":"Hey thanks for the info.  The maintenance itself went on with no impact, but we'll check things out now to see if something else has happened.","replies":[]}]},{"poster":"Wackednz","date":"2018-03-06T00:13:35.185+0000","up_votes":1,"down_votes":0,"body":"Game ended over an hour ago and it's still saying it's in progress. Fix your shit.","replies":[]},{"poster":"Dyslexic","date":"2018-03-05T17:11:37.549+0000","up_votes":1,"down_votes":0,"body":"The game play is impacted it seems Memestar. Multiple drop outs last few games.\n\nEdit: iPrimus reports 'degraded' impact for WA, though nothing for SA. Could still possibly be related to this rather than server upgrades..","replies":[]},{"poster":"Best Evelynn OCE","date":"2018-03-05T03:43:17.874+0000","up_votes":1,"down_votes":0,"body":"Thanks for the heads up :D\n\n{{sticker:sg-miss-fortune}}","replies":[]}]}