{"poster":"Mindstar","date":"2017-09-30T02:06:55.898+0000","title":"On Tuesday's server issues (2017-09-26)","subforum":"Announcements","embed":{"description":"Continuing on from this mornings messaging with a fresh thread here. We&#039;ve been seeing an issue today that is causing players to see the Reconnect screen after finishing games. This can persist for some time and prevent players from starting new games. Where are we at now? (1500 AEST) We","url":"https://boards.oce.leagueoflegends.com/en/c/announcements/q5p0cT8H-oce-post-game-reconnect-issues-thread-2017-09-26","image":"https://cdn.leagueoflegends.com/apollo/assets/vb/boards-wallpaper.jpg"},"up_votes":1,"down_votes":1,"body":"Many of you might have experienced a few issues during our bumpy day on the server on Tuesday this week.  \n\nWe&#039;ve been talking a lot about what happened and why, and we wanted to give you all some visibility.  Below is a brief description of what happened, what we did, and what we&rsquo;ve learned along the way.\n\n**A change is in store...\n**\nOur store team provided a summary of the incident, explaining why we got to the point we found ourselves at on Tuesday morning:\n\n> A lot of things happen when a game starts and ends, IP/XP gain, IP/XP boost usage, etc. There is a large monolithic piece of software, internally called &quot;the platform&quot;, which is in charge of starting and finishing the game, and many things that happen within the game lifecycle. The platform is also in charge of saving player inventory, such as champs and skins. Because of this, LoL store logic is tightly coupled with the platform logic.\n \n> The platform served us well in the early days of the League, but as the game evolves it&#039;s becoming a bottleneck, and holding us back from delivering new contents to players. The League engineering team is now trying to move much of the platform logic out of the platform, and only leave key functionality (allocating, starting and finishing the game) to it. As a part of this effort, we built a new scalable and flexible player inventory system independent from the platform, and Emotes are the first content type served from this new inventory system.\n\n> On Tuesday, a store engineer was prototyping a new end-of-game processing system to replace some of the platform logic. The engineer was testing with OCE game data because test servers didn&#039;t have enough game data, and OCE was the only region with the new inventory system. The engineer thought it was pretty safe because his prototype was only reading the data and did not yet modify anything.\n\n> However, it was not safe because it consumed platform end-of-game messages and it caused other systems unable to receive the end-of-game messages. This stopped normal end-of-game logics for many of the games played in OCE.\n\n**Ghost in the Machine\n**\nThere were two major symptoms of the issue - one was loss of end of game information (LP, IP etc).  It is important to note that stats in Match History are separate and not usable to regenerate the former types of statistics.\n\nIn the case of LP - one of the first things we do in times of trouble is to disable Ranked.   We did this, and we re-enabled it soon after we thought we fixed the issue.   Unfortunately we jumped the gun on this, and the result was that some of you won (and lost) games that ultimately will not count towards your ranking.   This really, really sucks, and is one of the number one things we try to avoid at all times.   When stuff like this happens, it hits us in our own bronze hearts too and we feel the pain.  We&rsquo;re really sorry on this one and always want to do better.\n\nThe other symptom was being stuck in what we term a &ldquo;ghost game&rdquo;.  The platform is trained to send you back into your game (ie. if you disconnect for any reason) for as long as that game is running.  If the game ends, and the platform still thinks it is there, they become out of sync and players will get stuck.   We&rsquo;ve implemented a fail-safe that causes the platform to terminate games which run for too long.  To be safe, this is set to a few hours.\n\nThis left us in the unfortunate situation that for players who were unable to connect, even after we isolated &amp; disabled the service causing the problem, it took a number of hours for everyone to be able to play properly again.   This is definitely something we could have communicated better, and it was only in retrospect that we were able to effectively gauge the number of affected players.\n\n**Learnings  &amp; Managing Change\n**\nLeague&rsquo;s servers, our infrastructure, and our code is in a constant state of flux, and one of the very difficult parts of managing the service as a whole, is managing change.  We need to constantly balance the needs of making cool stuff happen, with the need to keep things running in a stable fashion.   Too many changes, and you find servers become unstable... not enough cool stuff, and the memes start to stack up for Riot can kill them :&rsquo;(\n\nSo in allowing our Product teams access to make changes to systems, we also introduce the risk of some changes being made that cause problems.  In the case of Tuesday&rsquo;s issue, the change made to our end of game workflow was not communicated to our Network Operations Centre - our 24/7 eyes and ears on all of LoL servers around the world - and as such was not known and evaluated during our troubleshooting process.  This was a big contributor to the number of people seeing issues.\n\nUltimately, the outcome of this issue is that we have all had to eat some humble pie and it is fair to say that we did not meet our own standards on this occasion.  We&rsquo;re taking the learnings from this incident and emphasising the need for effective communications amongst our various teams, so that this kind of thing does not happen again. \n\nIf you&rsquo;ve got any questions, AMA!\n\n--Mindstar","replies":[]}