{"poster":"PiXeL FuNKY","date":"2015-07-04T16:37:51.143+0000","title":"Dynast Der Lord der Finsternis","subforum":"Skin- & Champion-Konzepte","up_votes":1,"down_votes":3,"body":"So hier nun ab nach langem &uuml;berlegen eine kleine bearbeitung der Geschihcte und ein paar F&auml;higkeiten die aber noch nicht ganz durchdacht sind mit dem Schaden reichweite cooldown etc.\n\n\nGeschichte:Vor Tausend Jahren lebte einst Dynast der &uuml;berall nur als der Lord der Finsternis bekannt war, denn seine Verbindung zwischen ihm und der Finsternis war wie ein K&ouml;rper, der nur Tod und Finsternis bracht.\nSeine Armee war unvergesslich: die schwarze R&uuml;stung befleckt mit Tod, Elend und Verderben so Schwarz dass das Licht in ihr verschlungen wurde, die Klinge geschmiedet aus dem Erz eines vor Jahrhunderten gefallenen Meteoriten so hart das sie selbst Eisen mit Leichtigkeit durchdringt. Die Klinge wurde mit dem Saft der Todes Bl&uuml;te oder auch besser bekannt als den schwarzen Tod eingerieben sodass jeder der die Klinge zu sp&uuml;ren bekam in Sekunden starb.\nDoch einst war Dynast ein teil der H&uuml;ter des Lichtes, die Besch&uuml;tzer und Herrscher dieser Welt, doch seine Entscheidungen und Ziele gegen&uuml;ber der Menschen waren voller Finsternis und Verderben. Wodurch die H&uuml;ter des Lichtes beschlossen ihn zu verbannen und ihn in die Finsternis zu werfen. Doch was sie nicht ahnen konnten war das Dynast durch die Finsternis st&auml;rker wurde, er lernte in ihr zu Leben und sie zu kontrollieren. Er schwor sich sich an den H&uuml;tern des Lichtes zu R&auml;chen. Eines Tages wollte sich ihm \"der Schatten Mann\" anschlie&szlig;en, anstatt ihn aufzunehmen gab er ihm Macht, die Macht die Finsternis in seinem Umfeld zu beherrschen und er nannte ihn von nun an Nocturne. Nach 2 Jahren krieg mit Unz&auml;hligen Soldaten und Familien die bei dem Versuch den Lord aufzuhalten gefallen waren starteten die H&uuml;ter des Lichtes einen Versuch den Lord f&uuml;r immer aus der Welt zu schaffen. Doch die H&uuml;ter waren zu schwach um ihn und seine Armee aufzuhalten und so baten sie die 4 Gro&szlig;en Magier: Ifre, Ratwe, Tosne und Dwin um hilfe. Sie willigten ein zu helfen doch unter einer Bedingung, die H&uuml;ter des Lichtes m&uuml;ssen aufgel&ouml;st werden und die Herrschaft &uuml;ber die Welt m&uuml;sse den einzelnen St&auml;mmen unterlegt werden. Als die Vorkehrungen getroffen waren entschlossen sich die Magier nicht den Lord T&ouml;ten sondern beschlossen ihn und seine Armee in einer mystischen Welt zu verschlie&szlig;en, so sollten sich die H&uuml;ter des Lichtes ins Leben der Menschen einmischen so werden die Magier den Lord entfesseln um Chaos und Tod zu verbreiten. Damit des Gef&auml;ngnis Schl&uuml;ssel und Position nie in Vergessenheit geraten wird, wurden sie auf einer Unzerst&ouml;rbaren Schriftrolle niedergeschrieben und des st&auml;rksten Magiers des Jahrhunderts &uuml;bergeben.\nJahrhunderte vergingen bis Nocturne seine macht verbessern konnte wodurch er auch die Finsternis in der psychischen Welt der Beschw&ouml;rer kontrollieren sogar in ihr wandeln konnte. Seinen Erschaffer aus den F&auml;ngen des Gef&auml;ngnisses zu befreien erforderte viel Geduld und Macht die er durchs eintauchen in einer psychischen Welt der Beschw&ouml;rer erlangte. Als Nocturne den Lord befreite sehnte er sich nach der Macht durch die Beschw&ouml;rer und machte sich auf den Weg seinen Durst zu stillen. Dynast wollte nur noch seine Armee nach hundert von Jahren Qual und Elend befreien, doch die Schriftrolle mit der er seine Armee befreien konnte ist nach den vielen Jahren in Abwege geraten, was es dem Lord schwer macht sie ausfindig zu machen. Nicht lange da sprach sich herum das ein Magier mit arkaner Macht eine Unzerst&ouml;rbaren Schriftrolle im Besitz h&auml;tte. Dies weckte die neugier Dynasts der sich sofort auf dem weg machte um den Magier mit der Schriftrolle gegen&uuml;ber zu treten. Dynast folgte dem weg des Magiers worauf hin er zur Liga der Helden sto&szlig;te und ihr beitrat in der Hoffnung den Magier dort zu finden.\nDas Leben hat viele Fassaden doch die Finsternis hat nur eine, den Tod. Dynast 2015\n\n\nF&auml;higkeiten:Passivename:\nPassive: \n\nQname: Black death\npressshot\nQpassive: pro 1 finsternis erh&auml;llt dynast perma 8leben und 1 ap\nQaktiv: Umh&uuml;llt bis zu 3 gegner mit der finsternis, diese erhalten dann &uuml;ber eine zeit schaden und verlangsamt ihn f&uuml;r jeden gegner der umh&uuml;llt wurde bekommt Dynast 0,5 Finsternis/ ad schaden\n\nWname: Darkness prison\nPressshot\nW: Stuned den gegner und ein kreis aus finsternis umgibt ihn und zieht dann den gegner zu dynast er erh&auml;lt dann schaden/ap schaden\n\nEname:\npressshot\nE:L&auml;sst dynast durch die Finsternis wandeln was ihn erm&ouml;glicht durch einheiten zu gehen zudem hat er erh&ouml;hte mr und armor und leicht erh&ouml;htes tempo\n\nULTname: Erebos\nULT:Zieht die Finsternis aus der Umgebung(leichter Schaden) kombiniert sie dann mit seiner &Auml;thermagie um sich selbst zu verwandeln in den gott: Erebos gott der finsternis bekommt neue f&auml;higkeiten\n\nNeue f&auml;higkeiten bei der Ult:\nQname:Fear\nSkillshot\nQ:Erm&ouml;glicht es Erebos sich schnell durch die Finsternis zu bewegen was ihn dann erlaubt in die psychische welt eines gegners zu wandeln dort verweilt er kurz zerreisst seine gedanken und verursacht schaden danach wird er wieder zur h&auml;lfte zu seiner eingangsposition gebracht sollte erebos keinen gegner treffen so gelangt er nur zur ausgangposition seiner f&auml;higkeit / ad schaden ap schaden\n\n\nWname:\n\nW:\n\n\nEname:\nPassive\nE:L&auml;sst dynast durch die Finsternis wandeln was ihn erm&ouml;glicht durch einheiten zu gehen zudem hat er erh&ouml;hte mr und armor und erh&ouml;htes tempo\n\nDas mit den F&auml;higkeiten k&ouml;nnte nen bisschen verwirrend sein ich habe das n&auml;hmlich so aufgeschrieben wie ich mir das dachte.\nNunja das ist erstmal der Fortschritt den ich gemacht habe und ich w&uuml;rde mich &uuml;ber Feedback und verbesserungs vorschl&auml;ge freuen","replies":[{"poster":"Skelenth","date":"2015-07-04T22:21:21.638+0000","up_votes":1,"down_votes":0,"body":"\"Ich hab das Gefühl ich hab den schonmal gesehn.\" War jetzt das erste was ich gedacht hab, dann hab ich nochmal nachgelesen. Sorry.\nDie Geschichte hab ich größtenteils aus den oben genannten Gründen überflogen. Nochmal sorry.\nDie Fähigkeiten. Die Struktur, also der Aufbau der Fähigkeiten ist leicht verwirrend (Qname: Black Prison - Pressshot(?) - Q: blabla), wär einfacher zu erkennen wenn du das überarbeiten könntest.  Und jetzt zu den einzelnen Fähigkeiten:\n\nPassive: Nicht vorhanden:\nDas sollte geändert werden. Wenn dir nichts einfällt, pack einfach die Ressource rein. Ich nehme mal an das Dunkelheit seine Ressource ist?\n\nQ: Schwarzer Tod (ich bin mal so frei und übersetze)(ist btw eine Umschreibung für die (schwarze) Pest, also wäre das auch ein möglicher Name):\nWie ist das aufgebaut? Du castest eine Fähigkeit auf einen Gegner. Ok. AoE der höchstens drei Gegner beeinflusst? Wie wird das geregelt? Wenn es ein Target-Spell ist, hat es einen geringen CD im Verhältnis zur Dauer, dass du es auf drei Gegnern gleichzeitig haben kannst?\nWie ist das mit der Finsternis aufgebaut? Du Q-st wen und erhälst dafür permanent 8 Leben? Sion auf Ecstasy oder was?\n\nW: Dunkelheitsgefängnis:\nIst das  ein Skillshot? Point and Click? Ground Target(AoE)? Ansonsten vielleicht etwas stark.\n\nE: Kein Name (Wenn ich sie mir so ansehe würde ich sowas wie \"Schattenpfad\" oder so vorschlagen, aber das bleibt ja dir überlassen):\nIch denke dazu lässt sich nichts sagen. Ist eigentlich wie Kennen E nur ohne Schaden.\n\nR: Erebos:\nDazu lässt sich ja nichts sagen. Nur ne Frage: Ist es Toggle wie Swain's oder Nidalee's Ulti, oder ist es ein ablaufender Buff, in etwa wie Shyvana's oder Quinn's Ulti? (Außerdem: Wieso kann er sich in einen **Gott** verwandeln? Im LoL-Universum gibt es die meines Wissens nicht einmal.)\n\nR-Q: Furcht (Hab nicht nachgesehen, aber ich glaub so heißt schon Fiddle's Q):\nIch hab das jetzt so verstanden:\nDynast/Erebos springt einen Gegner an, knabbert ein bisschen an dem (metaphorisch gesehen) und springt wieder zurück. Richtig? In etwa so wie Quinn's E?\n\nR-W: Nicht vorhanden:\nAlso wenn du ihm schon ne zweite Form gibst, dann solltest du die auch vollständig verarbeiten.\n\nR-E: Kein Name:\nIst dasselbe wie seine normale E nur permanent?\n\nMein Fazit: Die Fähigkeiten sind schwer interpretierbar wenn ich das so ausdrücken darf. Wenn ich das so im Client lesen würde, würde ich kaum wissen was der Typ eigentlich macht. Der Aufbau deines Vorschlags ist äußerst irritierend. Schau dir dazu mal das hier an: [Wie erstelle Ich einen Championvorschlag?](http://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/EgZqEwio-leitfaden-wie-erstelle-ich-einen-guten-championvorschlag).\nDie Fähigkeiten haben keine Skalierungen, was eigentlich nicht zu verachten ist. Da kann man eigentlich nur Mist mit bauen. Allerdings finde ich die \"Q: Schwarzer Tod\" etwas stark: Er kann unendlich Leben und AP anhäufen und es fällt ihm leichter als Veigar und Sion, die jeweils nur eines davon bekommen. Ist er jetzt ein AP Bruiser? Ist er Melee? Ich nehms an (er hat ein Schwert). Wieso stößt ihn dann seine \"R-Q: Furcht\" vom Gegner weg? Ist er dann noch in der richtigen Reichweite?\nAußerdem kam mir beim Lesen immer mehr Gedanke, dass die Figur und das Konzept so aussieht als sei es aus einem Film/Anderen Spiel/Was-Auch-Immer. Ich mag mich täuschen, es ist nur mein Bauchgefühl. Zumal bringt der Championvorschlag nicht wirklich viel neues/innovatives ins Spiel. Muss zwar nicht sein, ist aber ein nettes Feature.\nMein Fazit ist lang geworden.\nMein Fazit-Fazit:\nIch werde ihm weder einen Daumen-Hoch noch -Runter geben, da er noch nicht fertig ist. \nTschüss und Gute Nacht und behalte im Hinterkopf: Ich habe dir gerade fast eine Stunde meiner wertvollen Lebenszeit geschenkt.","replies":[{"poster":"PiXeL FuNKY","date":"2015-07-05T11:49:26.033+0000","up_votes":1,"down_votes":2,"body":"Falss du mal gelesen hättest würdest du wissen das der champ noch nicht fertig ist aber egal :D Und es ist wohl logisch das wenn bei ner fähigkeit nichts steht das sie noch nicht erfunden ausgedacht wurde etc\n\n\n> [{quoted}](name=Skelenth,realm=EUW,application-id=L7E6lhzo,discussion-id=jOghhPYP,comment-id=0000,timestamp=2015-07-04T22:21:21.638+0000)\n>\n> \"Ich hab das Gefühl ich hab den schonmal gesehn.\" War jetzt das erste was ich gedacht hab, dann hab ich nochmal nachgelesen. Sorry.\n> Die Geschichte hab ich größtenteils aus den oben genannten Gründen überflogen. Nochmal sorry.\n> Die Fähigkeiten. Die Struktur, also der Aufbau der Fähigkeiten ist leicht verwirrend (Qname: Black Prison - Pressshot(?) - Q: blabla), wär einfacher zu erkennen wenn du das überarbeiten könntest.\n\n(Falls du mal gelesen hättest würdest du wissen wieso ich das so geschrieben hab) \n Und jetzt zu den einzelnen Fähigkeiten:\n> \n> Passive: Nicht vorhanden:\n> Das sollte geändert werden. Wenn dir nichts einfällt, pack einfach die Ressource rein. Ich nehme mal an das Dunkelheit seine Ressource ist?\n> \n> Q: Schwarzer Tod (ich bin mal so frei und übersetze)(ist btw eine Umschreibung für die (schwarze) Pest, also wäre das auch ein möglicher Name):\n> Wie ist das aufgebaut? Du castest eine Fähigkeit auf einen Gegner. Ok. AoE der höchstens drei Gegner beeinflusst? Wie wird das geregelt? Wenn es ein Target-Spell ist, hat es einen geringen CD im Verhältnis zur Dauer, dass du es auf drei Gegnern gleichzeitig haben kannst?\n> Wie ist das mit der Finsternis aufgebaut? Du Q-st wen und erhälst dafür permanent 8 Leben? Sion auf Ecstasy oder was?\n\n(Drei targets bedeuten 0,5 pro target finsternis was heisst 1,5 das heisst 1 finsternis das heisst perma 12 leben und 1,5 ap wenn denn drei gegner vorhanden sind. Und wie gesagt cooldown dauer reichweite etc sind noch nicht vorhanden wie oben gesagt durchlesen würde helfen.)\n> \n> W: Dunkelheitsgefängnis:\n> Ist das  ein Skillshot? Point and Click? Ground Target(AoE)? Ansonsten vielleicht etwas stark.\n\n(Wieso stark? dauer des stuns reichweite des ranziehens und die reichweite der fähigkeit sowie der schaden sind nicht vorhanden wie kannst du also darüber urteilen?)\n> \n> E: Kein Name (Wenn ich sie mir so ansehe würde ich sowas wie \"Schattenpfad\" oder so vorschlagen, aber das bleibt ja dir überlassen):\n> Ich denke dazu lässt sich nichts sagen. Ist eigentlich wie Kennen E nur ohne Schaden.\n> \n> R: Erebos:\n> Dazu lässt sich ja nichts sagen. Nur ne Frage: Ist es Toggle wie Swain's oder Nidalee's Ulti, oder ist es ein ablaufender Buff, in etwa wie Shyvana's oder Quinn's Ulti? (Außerdem: Wieso kann er sich in einen **Gott** verwandeln? Im LoL-Universum gibt es die meines Wissens nicht einmal.)\n\n(ich habe mir überlegt ist wie nen ablaufender buff und Gott weil wenn du mal gegoogelt hättest ist erebos der Gott der finsternis darum.)\n> \n> R-Q: Furcht (Hab nicht nachgesehen, aber ich glaub so heißt schon Fiddle's Q):\n> Ich hab das jetzt so verstanden:\n> Dynast/Erebos springt einen Gegner an, knabbert ein bisschen an dem (metaphorisch gesehen) und springt wieder zurück. Richtig? In etwa so wie Quinn's E?\n\n(kann sein das das fiddles fähigkeiten ist wenn das so ist bearbeite ich das ist nicht wie quinns e denn das ist nen skillshot mit dem du dich auch über mauer bewegen kannst wenn du es gelesen hättest würdest du es verstehen.)\n> \n> R-W: Nicht vorhanden:\n> Also wenn du ihm schon ne zweite Form gibst, dann solltest du die auch vollständig verarbeiten.\n\n(IST NOCH NICHT FERTIG SO WIEOBEN GENANT)\n> \n> R-E: Kein Name:\n> Ist dasselbe wie seine normale E nur permanent?\n\n(Wieso nicht bloß er hat erhöhtes lauftempo und nicht leicht erhöhtes zudem steigt die mr und armor höher was ich nich geschrieben habe aber eben gerade durchdacht habe)\n> \n> Mein Fazit: Die Fähigkeiten sind schwer interpretierbar wenn ich das so ausdrücken darf. Wenn ich das so im Client lesen würde, würde ich kaum wissen was der Typ eigentlich macht. Der Aufbau deines Vorschlags ist äußerst irritierend. Schau dir dazu mal das hier an: [Wie erstelle Ich einen Championvorschlag?](http://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/EgZqEwio-leitfaden-wie-erstelle-ich-einen-guten-championvorschlag).\n> Die Fähigkeiten haben keine Skalierungen, was eigentlich nicht zu verachten ist.     \n(Noch nicht fertig) \n Da kann man eigentlich nur Mist mit bauen. Allerdings finde ich die \"Q: Schwarzer Tod\" etwas stark: Er kann unendlich Leben und AP anhäufen und es fällt ihm leichter als Veigar und Sion, die jeweils nur eines davon bekommen. Ok das kann sein das sie vllt im bezug zu veigars q und sions w stark ist doch wie gesagt fähigkeiten cooldown reichtweite SIND noch nicht durchdacht wie schon gesagt ALLES durchlesen\n. Ist er jetzt ein AP Bruiser? Ist er Melee? Ich nehms an (er hat ein Schwert). Wieso stößt ihn dann seine \"R-Q: Furcht\" vom Gegner weg? Ist er dann noch in der richtigen Reichweite? \n\n(Nein er hat kein schwert falls du dir die geschichte durchgelesen hätetst würdest du es wissen)\n\n> Außerdem kam mir beim Lesen immer mehr Gedanke, dass die Figur und das Konzept so aussieht als sei es aus einem Film/Anderen Spiel/Was-Auch-Immer.\n\n(Er ist Frei erfunden kommt aus keinem film spiel etc)\n\n Ich mag mich täuschen, es ist nur mein Bauchgefühl. Zumal bringt der Championvorschlag nicht wirklich viel neues/innovatives ins Spiel. Muss zwar nicht sein, ist aber ein nettes Feature.\n\n(Neue sachen sind zwar gut doch passen nicht zu dem champ den ICH mir durchdacht habe, also alte sachen passen mehr zu im wobei neue sachen sind gut obwohl in dem champion auch neue sachen drin sind :P)\n\n> Mein Fazit ist lang geworden.\n> Mein Fazit-Fazit:\n> Ich werde ihm weder einen Daumen-Hoch noch -Runter geben, da er noch nicht fertig ist. \n> Tschüss und Gute Nacht und behalte im Hinterkopf: Ich habe dir gerade fast eine Stunde meiner wertvollen Lebenszeit geschenkt.\n\n\n\n\nSo jetzt habe ich 30 min meines lebens damit vergeudet dir klar zu machen das er noch nicht fertig ist hättest du ja alles gelesen würdest du es wissen\n\n\nUnd das du die geschichte schon mal gelesen haben könnest ist der grund das sie schon mal da war von mir. Habe mir dann sachen überlegt und wollte jetzt nen fazit verbesserung zu dem was neu ist den alten thread mit der geschichte die oben ist habe ich gelöscht\n\n\nMein Fazit zu deinem: Hättest du alles durchgelesen und nicht überflogen würdest du so gut wie alles verstehen\n\nNoch was zur Q da habe ich mir noch überlegt das sie ist ungefähr wie vlads fähigkeit im moment ich weiss nicht wie die fähigkeit bei vlad die targets wählt doch ich habe mir überlegt das maximal nur ein champion getarget wird und dann aber nur der der  prozentual am wenigsten leben hat zudem habe ich mir noch überlegt das wenn man Minions trifft sie nur 0,25 finsternis geben und champions nur 0,5 finsternis womit sich der prema buff verringert und nciht so heftig aus wirkt oder ich lasse es so wie es ist denn sagen wir mal man trifft 225 minions 13 champions 26 jungle monster(drache und co mit drinnen) (diese angaben entsprechen ungefähr die farm anzahl und die kills in einem game von ungefähr 30 min)mit der q dann hat man 225+ 13+26=264 targets hat die dann 264x0,5 finsternis= 132 finsternis ergeben dann hat man perma 1,056 leben und 132 ap was aber in einem game unmöglich ist weil wenn ich nen cd von 22 sec mache dann kannste ja mal q farmen wenn du lust hättest also ist das kein sion auf ecstasy oder nen veigar mit über 1200 ap. Der champ so wie ich das im moment sehe ist nen lat game champ. zudem habe ich auch noch night überlegt ob man sie unendlich stacken kann oder ob sie ne grenze hat und das wenn man stirbt die hälfte davon verliert wobei wenn ich mir das so überlege wenn man die hälfte verliert müsste ich die fähigkeit ein bisschen buffen","replies":[{"poster":"Skelenth","date":"2015-07-05T16:30:23.317+0000","up_votes":1,"down_votes":0,"body":"Entschuldige wenn ich mich nicht verständlich genug ausgedrückt habe. Ich wollte dir nicht vorwerfen, dass du deinen Champion schlecht durchdacht hast und, wie ich auch gesagt habe, sind neue, innovative Fähigkeiten auch nicht unbedingt nötig. Zu der Reichweitenfrage: In seiner Geschichte heißt es er hat eine \"Klinge\", daher hab ich gedacht er würde ein Schwert tragen.\nIch habe durchaus den kompletten Vorschlag gelesen, vielleicht habe ich ein paar Sachen übersehen, die entsprechend wichtig für das Verständnis sind.\nDann geh ich nochmal die Fähigkeiten durch:\n\nQ:\nAlso willst du es wie Vlad's E machen? Die Blutspritzer die an alle Gegner in der Nähe fliegen? Die hat kein Cap was Ziele angeht, allerdings kann ich es mir gut vorstellen:\nDynast umhüllt die drei Gegner, die ihm am nächsten stehen, mit Dunkelheit. Diese erhalten Schaden über Zeit und werden verlangsamt. Sollte ein Gegner mit diesem Debuff sterben erhält Dynast 3 Leben und 0.5 AP. Ist der Gegner ein Champion wird dieser Bonus verdoppelt.\nSo könntest du den Cooldown auf ungefähr 15 - 10 Sekunden runtersetzen, aber da ich den Schaden nicht kenne den die Fähigkeit machen soll, kann ich das Schlecht beurteilen.\n\nW:\nHast natürlich recht, aber meine Frage wurde auch nicht beantwortet. Wie wählst du das Ziel aus, das du an dich ran ziehen willst? So wie ich es verstanden habe läuft das so ab:\nDynast wählt einen Gegner. Dieser wird betäubt, kurz darauf zu Dynast herangezogen und erhält dann geringen Schaden.\nLäuft das so ab? Was ich daran zu stark finden würde, wäre der Point & Click Grab, aber ich kann es auch falsch verstanden haben.\n\nR:\nEs ist mir durchaus bewusst was Erebos ist, nämlich sowohl Gott der Finsternis, als auch Teil der Unterwelt in der griechischen Mythologie. Was mich daran stört, ist dass es im **LoL-Universum** keine Götter gibt. Sie werden in keiner Geschichte genannt. Aber das war auch das einzige was mich an der Fähigkeit gestört hat, ablaufender Buff klingt gut.\n\nR-Q:\nIch bitte um Verzeihung. Fiddle's Q heißt \"Erschrecken\", bzw. im Englischen \"Terrify\", gibt also kein Problem mit dem Namen.\n\n> Ermöglicht es Erebos sich schnell durch die Finsternis zu bewegen was ihn dann erlaubt in die psychische welt eines gegners zu wandeln dort verweilt er kurz zerreisst seine gedanken und verursacht schaden danach wird er wieder zur hälfte zu seiner eingangsposition gebracht\n\nDaraus konnte ich leider nicht schließen, dass es ein Skillshot ist. Habe ich nirgendwo gelesen, aber egal. Ist ja geklärt. Also läuft die Fähigkeit so ab:\nDynast kann in eine bestimmte Richtung \"springen\". Trifft er auf seinem Weg einen Gegner, bleibt er kurz bei diesem, verursacht Schaden und springt dann wieder die Hälfte des zuerst zurückgelegten Weges zurück. Trifft er keinen Gegner kehrt er zur Ausgangsposition seines Sprungs zurück.\n\nR-W: \nOkay, okay.\n\nR-E:\nIst gut.\n\nWird R-R auch noch belegt? Da es ein ablaufender Buff ist könnte man es so machen, wie bei Riven. Er könnte während seiner Ulti-Form noch eine Fähigkeit mehr besitzen. Nur eine Überlegung, ist nicht zwingend.\n\n> (Nein er hat kein schwert falls du dir die geschichte durchgelesen hätetst würdest du es wissen)\n\nIn der Geschichte heißt es er hat eine \"Klinge\". Benutzt er die nicht, oder ist damit kein Schwert gemeint?\n \n> (Er ist Frei erfunden kommt aus keinem film spiel etc)\n\nDann tut es mir Leid.\n\n> Neue sachen sind zwar gut doch passen nicht zu dem champ den ICH mir durchdacht habe\n\nDas ist in Ordnung.\n\n> So jetzt habe ich 30 min meines lebens damit vergeudet dir klar zu machen das er noch nicht fertig ist\n\nVergeudet trifft es gut, denn mir war bereits klar, dass er noch nicht fertig ist. Wenn du ein paar Zeilen über die Stelle schaust, wo du das hier gerade geschrieben hast wirst du folgendes sehen: \n>Ich werde ihm weder einen Daumen-Hoch noch -Runter geben, da er noch nicht fertig ist.\n\nSoviel dazu, dass ich alles überflogen hätte. Lediglich die Geschichte habe ich schnell gelesen, da ich sie erstens, im groben bereits kannte. Zweitens, sie nicht ausschlaggebend für die Bewertung von Fähigkeiten ist. Und drittens, sie es nicht einfacher macht die Fähigkeiten in ihrer Funktion zu verstehen. Schau dir deine Fähigkeitenbeschreibungen noch einmal an. Würdest du wissen, wie sie im Spiel funktionieren würden, allein anhand der Beschreibung? Ich denke nein. Deshalb habe ich auch den Link zur Erstellung eines Championvorschlages hier rein geschrieben. Er hilft maßgeblich beim Verständnis deines Champions.\n\nIn diesem Sinne, und in der Hoffnung, dass du mit dieser Kritik nun besser klar kommst, tschüss.","replies":[{"poster":"Balmung","date":"2015-07-05T16:58:37.893+0000","up_votes":1,"down_votes":0,"body":"Der TE kommt generell nicht mit Kritik klar, hat er schon in anderen Threads bewiesen.\n\nDie Fähigkeiten sind n ziemlich böses Kauderwelsch und einfach krank heftig - selbst ohne augenmerk auf Skalierungen und die fehlende Main-Passive hat er schon 6 (!) passive Effekte. Bonus Armor/MR und stackbare HP/AP, PD-Passive und mehr Movespeed.\nDazu Stun/Pull, scheinbar untargetable Q während Ult...ehrm, jow \"leicht\" überladenes Kit.\n\nUnd Erebos, so cool er auch zu sein scheint, 1:1 zu übernehmen ist bisschen...unkreativ?","replies":[{"poster":"PiXeL FuNKY","date":"2015-07-11T20:03:59.678+0000","up_votes":1,"down_votes":1,"body":"Bei Champion vorschlägen und Chatbans liegt bei mir mehr als einen kilometer mit der kritik die ich verkraften kann und nicht :)\nDie Fähigkeiten sind n ziemlich böses Kauderwelsch: mag sein aber hast du auch alles gelesen wenn ja dann weißt du das ich sie so geschrieben habe wie ich sie gerade im kopf hatte.\nWas meinst du mit untargetable Q während der Ult? verteh ich nicht\nKann sein ein bisschen viele Passive Atribute merke ich mir werde den Champion so oder so nochmal bearbeiten durch die Kritik von Skelenth und nicht durch deine sinnlose Kritik zu sagen das ich keine Kritik ab kann obwohl chatbann (meine einzigen Threads) und Champion Vorschlag für mich total was anderes sind und wobei ich auch bei den beiden unterschiedlich reagiere.\nSo Und zu mal gebe ich oft nur meine Meinung da wenn du dies oben durch mein böses Kauderwelsch nicht verstehen kannst dann komm nicht wieder zu diesen Threads zurück und bleib dort wo du bist denn niemand will jmd haben der keine sinnvolle kritik abgibt zumal auch noch auf jmd rumhackt durch Fehler die er in einigen Threads (eig nur bei einem bei mir also versteh ich das nicht:hat er schon in ANDEREN Threads bewiesen denn ich kam nur bei einem Thread von mir mit Kritik nicht klar) gemacht hat. Also Kleiner einen schönen abend noch und gute nacht","replies":[{"poster":"Balmung","date":"2015-07-11T20:48:35.681+0000","up_votes":1,"down_votes":0,"body":"Q:Ermöglicht es Erebos sich schnell durch die Finsternis zu bewegen was ihn dann erlaubt in **die psychische welt eines gegners zu wandeln** dort verweilt er kurz zerreisst seine gedanken und verursacht schaden danach **wird er wieder zur hälfte zu seiner eingangsposition gebracht **sollte erebos keinen gegner treffen so gelangt er nur zur ausgangposition seiner fähigkeit / ad schaden ap schaden\n\nLässt auf eine Art von Phasing oder Untargetable während des Ult-Q schließen, ansonsten macht \"psychische Welt in welcher er verweilt\" keinerlei Sinn.\n\nUnd das du keine Kritik ab kannst, in welcher Form auch immer, beweist deine Antwort leider erneut. Du schreibst extreme Textblöcke mit 90% unnötigem Text um mir im Endeffekt zu schreiben das ich wegbleiben soll? Wenn du nicht willst das man antwortet würde ich einfach sagen...dann ignorier es doch schlichtweg. Verbieten hier zu schreiben kannst du niemandem - angesichts der Schreibweise frage ich mich auch wer von uns beiden der \"Kleine\" sein soll.","replies":[{"poster":"PiXeL FuNKY","date":"2015-07-11T22:04:48.230+0000","up_votes":1,"down_votes":1,"body":"Wieso macht psychische welt keinerlei sinn das macht wohl viel sinn wenn du dir die geschichte mal durch liest habe ich erwähnt das nocturne seine macht erweitern konnte wodurch er in die psychische welt der beschwörer eindringen konnte das dynast der lord der finsternis die macht schon besaß kann er das dann wohl auch oder nicht? also macht es sinn.\nIch kann Kritik ab doch ich verteidige standpunkte sehr hart denn ich halte das was ich schreibe für am besten das heißt ich halte an meinen Punkt fest dies kann sich aber wie hier oben ändern wenn jmd wie skelenth mich zum nachdenken bringt mit z.b einer fähigkeit nehme ich in einer form dir kritik an und wie ich schon geschrieben habe werde ich darüber nachdenken den champion zu änder also defakto habe ich Kritik angenommen also.\nUnd zum Kleiner ganz einfach du bist für mich nicht bedeuten in dem Thread stellst behauptung auf die nicht stimmen.\nSelbst wenn du mir nicht von bedeutung bist heißt das für mich nicht das ich dir nicht antworte, denn ich kann nichts einfach liegen lassen wenn jmd z.b. du nicht alles kennst wenn du mich nicht kennst wo ich Kritik annehmen kann oder nicht, will ich ihm in diesem fall dir erklären wie es ist. Verboten zu schreiben habe ich dir nicht was ich meinte ist das wenn du nichts sinnvolles hast sollst du es für dich behalten und nicht zu schreiben. 90% unnötig denke ich nicht, wenn es dir nicht gefällt texte von mir zu lesen dann gibt es eine leichte Lösung, schreib einfach nichts mehr heir in den Thread denn ich werde dir immr antworten. Ich muss auch sagen ich bin ein wenig stur was sachen angeht die mich betreffen wo ich der meinung bin im recht, wahrheit, richtigkeit zu sein.","replies":[{"poster":"Skelenth","date":"2015-07-11T23:09:25.612+0000","up_votes":1,"down_votes":0,"body":"Ich will jetzt echt nicht der Typ sein, der immer wieder herkommt und rumnörgelt, aber inwiefern hat man es zu verstehen, dass jemand \"in der psychischen Welt\" seines Gegner ist? Es geht nicht um den Kontext, nicht um die Geschichte, es ist uns völlig egal warum er das kann, es geht einzig und allein darum, wie das **im Spiel** vorkommen wird. Jaja, er ist der König vom Nimmerleinsland und der Finsternis und allem, aber das sagt uns nicht, ob er nun während seiner R-Q verschwindet, untargetable wird, oder einfach nur neben dem Gegner steht und ein bisschen Gehirnsaft schlürft wie Malzahar, denn das ist es worum es hier geht.\n\nUnd wenn keiner von euch aufhören kann, den anderen der Kritikunfähigkeit zu bezichtigen: **Lasst das Thema einfach liegen!** Macht von mir aus nen Offtopic Thread auf, aber das gehört hier nun wirklich nicht rein.\n\nUnd zuletzt: Du gibst selbst zu, dass deine Fähigkeiten verwirrend sein können. Warum behebst du diesen Makel nicht einfach und machst einen verständlichen und übersichtlichen Text draus? Ich kopiere nicht grundlos immer diesen Link, um dich daran zu erinnern, dass es eine einheitliche Form gibt, die einfach von jedem verstanden werden kann und wird, wenn man sie denn benutzen würde. Du hast seid ich meine erste Antwort gegeben habe, kein einziges Mal deinen Thread editiert. Warum schreibst du das überhaupt, wenn du beim zweiten nachdenken 90% des Vorschlag wieder ändern willst, es aber nicht einmal tust?\n\n\nP.S.: \nWenn dir der oben stehende Text aggressiv vorkommt, ja das war er, aber selbst wenn ich jetzt wo ich fertig bin, nochmal darüber nachdenke was ich dir gerade geschrieben habe, werde ich es nicht ändern, da es eine ehrliche Meinung über die Gesamtheit dieses Threads ist. Ich versuche nur ehrlich zu sein, nicht dich zu beleidigen, wenn du das, wie auch immer, so verstanden haben könntest.\n\nP.P.S.:\nWie zur Hölle soll man erkennen, dass mit \"Klinge\" eine Armee gemeint ist?! o.O","replies":[{"poster":"PiXeL FuNKY","date":"2015-07-12T15:56:12.848+0000","up_votes":1,"down_votes":1,"body":"Wie soll man wie wissen das mit klinge  eine armee gemeint ist: ist es nicht mit klinge ist gemeint die klinge der armee aber naja nicht jeder hat das wissen einen normalen satz zu verstehen.\nUnd wie ich schon mal gesagt habe das ist bis jetzt nur der fortschritt den ich erarbeitet habe und wollte dazu nur mal nen paar kommis denn ich mache doch nicht den in voller form ins text und bild wenn er noch nicht fertig ist ich wollte lediglich nur wissen wie er im moment ankommt.\nUnd dazu das ich die fähigkeiten so mies geschrieben habe habe ich schon mehrmals gesagt wieso, wieso ich sie nicht ändere weil ich seit 14 tagen nicht mehr zu hause war um an meinem pc es zu ändern.\nIch werde das ja alles noch überarbeiten aber ich hatte wie gesagt keine zeit weil ich nicht da war.","replies":[{"poster":"Skelenth","date":"2015-07-12T16:52:16.411+0000","up_votes":1,"down_votes":0,"body":">aber naja nicht jeder hat das wissen einen normalen satz zu verstehen.\n\nDas werde ich jetzt mal so stehen lassen, ich halte das einer Antwort nicht würdig.\n\n>Und wie ich schon mal gesagt habe das ist bis jetzt nur der fortschritt den ich erarbeitet habe \n\nDann werde ich jetzt diesen Thread ignorieren bis er fertig ist, denn bis dahin ist es ja sowieso sinnlos.","replies":[]}]}]},{"poster":"Balmung","date":"2015-07-12T13:04:20.793+0000","up_votes":1,"down_votes":0,"body":"Ich werd dir nun ein einziges Mal zeigen was ich meine, wenn ich behaupte das du 90% unnützes Zeug in deinem Text hast:\n\n> [{quoted}](name=PiXeL FuNKY,realm=EUW,application-id=L7E6lhzo,discussion-id=jOghhPYP,comment-id=0000000200000000000100000000,timestamp=2015-07-11T22:04:48.230+0000)\n>\n> Wieso macht psychische welt keinerlei sinn das macht wohl viel sinn wenn du dir die geschichte mal durch liest habe ich erwähnt das nocturne seine macht erweitern konnte wodurch er in die psychische welt der beschwörer eindringen konnte das dynast der lord der finsternis die macht schon besaß kann er das dann wohl auch oder nicht? also macht es sinn.\n\n100% unnötiger Absatz, da du die Frage völlig ignorierst und mich auf Text verweist der nichts damit zu tun hat/die Frage erst aufgeworfen hat.\n\n> Ich kann Kritik ab doch ich verteidige standpunkte sehr hart denn ich halte das was ich schreibe für am besten das heißt ich halte an meinen Punkt fest dies kann sich aber wie hier oben ändern wenn jmd wie skelenth mich zum nachdenken bringt mit z.b einer fähigkeit nehme ich in einer form dir kritik an und wie ich schon geschrieben habe** werde ich darüber nachdenken den champion zu änder** also defakto habe ich Kritik angenommen also.\n\nDies ist die Aussage deines Textblocks, der Rest ist unnötiger Rechtfertigungsversuch.\n\n> Und zum Kleiner ganz einfach du bist für mich nicht bedeuten in dem Thread stellst behauptung auf die nicht stimmen. Selbst wenn du mir nicht von bedeutung bist heißt das für mich nicht das ich dir nicht antworte, denn ich kann nichts einfach liegen lassen wenn jmd z.b. du nicht alles kennst wenn du mich nicht kennst wo ich Kritik annehmen kann oder nicht, will ich ihm in diesem fall dir erklären wie es ist. \n\nIch belege gerade meine Behauptung. Ist übrigens echt putzig wie du mir schreibst das ich dir \"nichts bedeute\" und gleichzeitig versuchst deinen unverständlichen Text, zu dem eine Frage gestellt wurde, mit exakt dem gleichen Text zu erklären. Wenn einem jemand oder etwas nichts bedeutet ist es einem egal bzw. gleichgültig und dann bedarf es keiner weiteren \"Erklärung\".\n\n> Verboten zu schreiben habe ich dir nicht was ich meinte ist das wenn du nichts sinnvolles hast sollst du es für dich behalten und nicht zu schreiben. 90% unnötig denke ich nicht, wenn es dir nicht gefällt texte von mir zu lesen dann gibt es eine leichte Lösung, schreib einfach nichts mehr heir in den Thread denn ich werde dir immr antworten. Ich muss auch sagen ich bin ein wenig stur was sachen angeht die mich betreffen wo ich der meinung bin im recht, wahrheit, richtigkeit zu sein.\n\n4x \"schreib halt einfach nichtmehr\" in einem Textblock der sich immer wieder um diese Aussage dreht.\n\nIm Endeffekt ist noch immer die Frage offen was der Q eigentlich bringt, aber hey - wer \"Klinge\" mit \"Armee\" gleichsetzt...","replies":[{"poster":"PiXeL FuNKY","date":"2015-07-12T15:49:31.081+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Balmung,realm=EUW,application-id=L7E6lhzo,discussion-id=jOghhPYP,comment-id=00000002000000000001000000000001,timestamp=2015-07-12T13:04:20.793+0000)\n>\n> Ich werd dir nun ein einziges Mal zeigen was ich meine, wenn ich behaupte das du 90% unnützes Zeug in deinem Text hast:\n> \n> 100% unnötiger Absatz, da du die Frage völlig ignorierst und mich auf Text verweist der nichts damit zu tun hat/die Frage erst aufgeworfen hat.\n> \n> Dies ist die Aussage deines Textblocks, der Rest ist unnötiger Rechtfertigungsversuch.\n> \n> Ich belege gerade meine Behauptung. Ist übrigens echt putzig wie du mir schreibst das ich dir \"nichts bedeute\" und gleichzeitig versuchst deinen unverständlichen Text, zu dem eine Frage gestellt wurde, mit exakt dem gleichen Text zu erklären. Wenn einem jemand oder etwas nichts bedeutet ist es einem egal bzw. gleichgültig und dann bedarf es keiner weiteren \"Erklärung\".\n> \n> 4x \"schreib halt einfach nichtmehr\" in einem Textblock der sich immer wieder um diese Aussage dreht.\n> \n> Im Endeffekt ist noch immer die Frage offen was der Q eigentlich bringt, aber hey - wer \"Klinge\" mit \"Armee\" gleichsetzt...\n\nWOW du weisst nicht was ich damit meinte ich füge mal den text ein der in meiner geschichte drin ist\nSeine Armee war unvergesslich: die schwarze Rüstung befleckt mit Tod, Elend und Verderben so Schwarz dass das Licht in ihr verschlungen wurde, die Klinge geschmiedet aus dem Erz eines vor Jahrhunderten gefallenen Meteoriten so hart das sie selbst Eisen mit Leichtigkeit durchdringt. /Die Klinge wurde mit dem Saft der Todes Blüte oder auch besser bekannt als den schwarzen Tod eingerieben sodass jeder der die Klinge zu spüren bekam in Sekunden starb./ \nDie Klinge wurde mit dem Saft der Todes Blüte oder auch besser bekannt als den schwarzen Tod eingerieben sodass jeder der die Klinge zu spüren bekam in Sekunden starb \nDamit ist schlicht weg gemeint das die soldaten in der armee ihre klinge mit dem saft eingerieben haben idiot -.-\nDenn rest deines textes habe ich nicht durchgelesen\nIch setze klinge nicht mit Armee gleich mann mann mann jetzt frag ich mich echt vor von uns der kleinere ist wenn er noch nicht mal einen simplen text versteht.\nUnd wo schreibe ich bitteschön 4x schreib einfach nicht mehr?","replies":[{"poster":"Balmung","date":"2015-07-12T16:13:06.430+0000","up_votes":1,"down_votes":0,"body":"Ich bin mal so frei es für dich aufzuzeigen:\n\nVerboten zu schreiben habe ich dir nicht was ich meinte ist das **wenn du nichts sinnvolles hast sollst du es für dich behalten und nicht zu schreiben**. 90% unnötig denke ich nicht, wenn es dir nicht gefällt texte von mir zu lesen dann gibt es eine leichte Lösung, **schreib einfach nichts mehr heir** in den Thread denn ich werde dir immr antworten.\n\nSind alleine 2x im letzten Absatz.\n\nP.S: Es ist schon wirklich respektlos zu erwarten das sich jemand diesen, pardon, Mist durchzulesen hat auf den du dich ständig beziehst. Und selbst dann ist er dank keinem einzigen Satzzeichen, ständigen Wiederholungen und unnötiger Information schwierig zu verstehen.","replies":[]}]}]}]}]}]}]},{"poster":"PiXeL FuNKY","date":"2015-07-11T20:14:14.668+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Skelenth,realm=EUW,application-id=L7E6lhzo,discussion-id=jOghhPYP,comment-id=000000020000,timestamp=2015-07-05T16:30:23.317+0000)\n>\n> Entschuldige wenn ich mich nicht verständlich genug ausgedrückt habe. Ich wollte dir nicht vorwerfen, dass du deinen Champion schlecht durchdacht hast und, wie ich auch gesagt habe, sind neue, innovative Fähigkeiten auch nicht unbedingt nötig. Zu der Reichweitenfrage: \n\nIn seiner Geschichte heißt es er hat eine \"Klinge\", daher hab ich gedacht er würde ein Schwert tragen.\n\nNein heißt es nicht ich kann ja nochmal die wahrscheinliche Geschichten Zeile einfügen die zur verwirrung geführt haben könnte:\nDie Klinge wurde mit dem Saft der Todes Blüte oder auch besser bekannt als den schwarzen Tod eingerieben sodass jeder der die Klinge zu spüren bekam in Sekunden starb. Diese Zeile bezog sich auf seine Armee.\n\n> Ich habe durchaus den kompletten Vorschlag gelesen, vielleicht habe ich ein paar Sachen übersehen, die entsprechend wichtig für das Verständnis sind.\n> Dann geh ich nochmal die Fähigkeiten durch:\n> \n> Q:\n> Also willst du es wie Vlad's E machen? Die Blutspritzer die an alle Gegner in der Nähe fliegen? Die hat kein Cap was Ziele angeht, allerdings kann ich es mir gut vorstellen:\n> Dynast umhüllt die drei Gegner, die ihm am nächsten stehen, mit Dunkelheit. Diese erhalten Schaden über Zeit und werden verlangsamt. Sollte ein Gegner mit diesem Debuff sterben erhält Dynast 3 Leben und 0.5 AP. Ist der Gegner ein Champion wird dieser Bonus verdoppelt.\n> So könntest du den Cooldown auf ungefähr 15 - 10 Sekunden runtersetzen, aber da ich den Schaden nicht kenne den die Fähigkeit machen soll, kann ich das Schlecht beurteilen. \n\nWenn man das so machen würde würde die fähigkeit zu lasch sein für mich. Ich denke das ich diese Fähigkeit nochmal überdenke, wahrscheinlich eine ganz neue mache\n\n> \n> W:\n> Hast natürlich recht, aber meine Frage wurde auch nicht beantwortet. Wie wählst du das Ziel aus, das du an dich ran ziehen willst? So wie ich es verstanden habe läuft das so ab:\n> Dynast wählt einen Gegner. Dieser wird betäubt, kurz darauf zu Dynast herangezogen und erhält dann geringen Schaden.\n> Läuft das so ab? Was ich daran zu stark finden würde, wäre der Point & Click Grab, aber ich kann es auch falsch verstanden haben.\n\nIch habe mir das eig. so gedacht das es ein kreis Radius ist point and klick mäßig, doch wenn ich das so gerade durchdenke ist das ein bisschen dumm wahrscheinlich werde ich diese fähigkeit auch durchdenken vllt. neumachen.\n\n> \n> R:\n> Es ist mir durchaus bewusst was Erebos ist, nämlich sowohl Gott der Finsternis, als auch Teil der Unterwelt in der griechischen Mythologie. Was mich daran stört, ist dass es im **LoL-Universum** keine Götter gibt. Sie werden in keiner Geschichte genannt. Aber das war auch das einzige was mich an der Fähigkeit gestört hat, ablaufender Buff klingt gut.\n\nDas mag sein doch ich glaube bei Yorick oder Mordekaiser war das da heissen alle Fähigkeiten anch irgentwas was es in \"unserer\" welt gibt und dann auch im LoL Universum also wäre es durchaus berechtigt ihn  so zu nennen die Fähigkeit vllt änder ich das auch noch\n\n> \n> R-Q:\n> Ich bitte um Verzeihung. Fiddle's Q heißt \"Erschrecken\", bzw. im Englischen \"Terrify\", gibt also kein Problem mit dem Namen.\n> \n> Daraus konnte ich leider nicht schließen, dass es ein Skillshot ist. Habe ich nirgendwo gelesen, aber egal. Ist ja geklärt. Also läuft die Fähigkeit so ab:\n> Dynast kann in eine bestimmte Richtung \"springen\". Trifft er auf seinem Weg einen Gegner, bleibt er kurz bei diesem, verursacht Schaden und springt dann wieder die Hälfte des zuerst zurückgelegten Weges zurück. Trifft er keinen Gegner kehrt er zur Ausgangsposition seines Sprungs zurück.\n> \n> R-W: \n> Okay, okay.\n> \n> R-E:\n> Ist gut.\n> \n> Wird R-R auch noch belegt? Da es ein ablaufender Buff ist könnte man es so machen, wie bei Riven. Er könnte während seiner Ulti-Form noch eine Fähigkeit mehr besitzen. Nur eine Überlegung, ist nicht zwingend.\n\nKönnte man machen\n> \n> In der Geschichte heißt es er hat eine \"Klinge\". Benutzt er die nicht, oder ist damit kein Schwert gemeint?\n> \n> Dann tut es mir Leid.\n\nNein heißt es nicht ich kann ja nochmal die wahrscheinliche Geschichten Zeile einfügen die zur verwirrung geführt haben könnte:\nDie Klinge wurde mit dem Saft der Todes Blüte oder auch besser bekannt als den schwarzen Tod eingerieben sodass jeder der die Klinge zu spüren bekam in Sekunden starb. Diese Zeile bezog sich auf seine Armee.\n\n\n> Das ist in Ordnung.\n> \n> Vergeudet trifft es gut, denn mir war bereits klar, dass er noch nicht fertig ist. Wenn du ein paar Zeilen über die Stelle schaust, wo du das hier gerade geschrieben hast wirst du folgendes sehen: \n> \n> Soviel dazu, dass ich alles überflogen hätte. Lediglich die Geschichte habe ich schnell gelesen, da ich sie erstens, im groben bereits kannte. Zweitens, sie nicht ausschlaggebend für die Bewertung von Fähigkeiten ist. Und drittens, sie es nicht einfacher macht die Fähigkeiten in ihrer Funktion zu verstehen. Schau dir deine Fähigkeitenbeschreibungen noch einmal an. Würdest du wissen, wie sie im Spiel funktionieren würden, allein anhand der Beschreibung? Ich denke nein. Deshalb habe ich auch den Link zur Erstellung eines Championvorschlages hier rein geschrieben. Er hilft maßgeblich beim Verständnis deines Champions.\n\nIch kenn den Link das wahr von mir jetzt nur eine grobe beschreibung um den Fortschrit zu zeigen und etc.\n> \n> In diesem Sinne, und in der Hoffnung, dass du mit dieser Kritik nun besser klar kommst, tschüss.","replies":[]}]}]}]}]}