{"poster":"YasuOwO","date":"2018-07-02T02:50:53.019+0000","title":"que le pasa al emparejamiento","subforum":"Charlas Generales","up_votes":8,"down_votes":0,"body":"puros platinos y diamantes y eso que no soy muy bueno ademas soy unranked\n","replies":[{"poster":"asdmaskldmnkfl","date":"2018-07-02T18:50:47.111+0000","up_votes":2,"down_votes":0,"body":"Esto es lo que sucede, esas personas que están en diamante, master o challenger, fueron en algún momento gente nueva y subieron su cuenta a 30 igual q tu. Eran noobs Y perdian y ganaban tal como todos. Pasó el tiempo y comenzaron a jugar rankeds y dejaron de lado las normales. Entonces su mmr en normales es igual al tuyo pero en rankeds es superior. Se puede hacer algo, no el juego es así.\nSaludos","replies":[{"poster":"NLG Walter","date":"2018-07-02T22:38:05.966+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=drazerjx,realm=LAS,application-id=v7qsfXsE,discussion-id=39gd6Ifr,comment-id=00030000,timestamp=2018-07-02T15:24:07.468+0000)\n>\n> como haces para fijarte en esa página para Las? nomás me aparece NA, EUW y EUNE.\n\nNo se puede, el autor del sitio no tiene ganas de implementar el calculo de mmr para las otras regiones, y para colmo es la unica pagina que lo hace.\n\nDespues tenes esta, pero solo sirve para calcular flex y soloQ.\nhttps://www.lol-mmr.com/","replies":[]}]},{"poster":"Lord Parca","date":"2018-07-02T15:49:53.293+0000","up_votes":1,"down_votes":0,"body":"Si sos nuevo te explico que asi es el nuevo sistema, sos un ranked cosa q tenes un mmr estandar, ademas que el sistema desde hace 1 año fue actualizado con una ampliacion de emparejamiento para q encuentres partidas mas rapidamente, Faker se que en twiter x este sistema y nadie lo entendio diciendo q solo pasa en elo alto y que eso no afecta al resto. Siendo unranked te puede tocar cualquier cosa amego, salu2","replies":[]},{"poster":"NLG Walter","date":"2018-07-02T11:37:28.543+0000","up_votes":1,"down_votes":0,"body":"Es exactamente lo mismo cualquier modo de juego, la unica diferencia es que en Normal, Aram y Bosque Retorcido no existe el adornito de division ni las promos.\n\nAca podes calcular el MMR de aram y normales, para saber tu \"division\".\nhttps://na.whatismymmr.com/","replies":[{"poster":"frvnnko","date":"2018-07-02T15:24:07.468+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=NLG Walter,realm=LAS,application-id=v7qsfXsE,discussion-id=39gd6Ifr,comment-id=0003,timestamp=2018-07-02T11:37:28.543+0000)\n>\n> Es exactamente lo mismo cualquier modo de juego, la unica diferencia es que en Normal, Aram y Bosque Retorcido no existe el adornito de division ni las promos.\n> \n> Aca podes calcular el MMR de aram y normales, para saber tu &quot;division&quot;.\n> https://na.whatismymmr.com/\n\ncomo haces para fijarte en esa página para Las? nomás me aparece NA, EUW y EUNE.","replies":[]}]},{"poster":"Gamma Y","date":"2018-07-02T11:32:39.850+0000","up_votes":1,"down_votes":0,"body":"Porque jugas normal y en normal es aleatorio el tipo de personas que podes encontrarte, dudo que cuando juegues competitivo te toquen personas de platino en adelante, a menos que ganes muchas seguidas y generes un buen mmr.","replies":[]},{"poster":"NLG Walter","date":"2018-07-02T11:20:14.046+0000","up_votes":1,"down_votes":0,"body":"El MMR base es 1400, pertenece a las divisiones Plata 1 y Oro 5, si luego en posicionamiento llegas a ganar varias ranked tu MMR sube por las nubes, siendo emparejado con ex-platinos/ex-diamantes mancos con MMR de Oro 3 aprox.\n\n_(MMR es sinonimo de ELO, podes llamarle como vos quieras)_\nhttps://i.gyazo.com/809a280368af5e1b5f872c992ba09d7b.png","replies":[]},{"poster":"Nico Nico Nii","date":"2018-07-02T10:19:52.824+0000","up_votes":1,"down_votes":0,"body":"Porque cuando eres unranked tienes el elo de un oro, por ejemplo yo estoy jugando ranked y me toca de compañero un unranked, obviamente no sabe jugar y perdemos","replies":[]}]}