{"poster":"hajime saitto","date":"2016-07-20T04:47:05.716+0000","title":"LAN Y LAS en su maxima expresión \"eventos\"","subforum":"Charlas Generales","up_votes":6,"down_votes":2,"body":"Nada que decir,que es esto ? latam en su mayor y m&aacute;xima expresi&oacute;n ? por una parte todos los clubs hacen lo mismo echan a gente a diestra y siniestra y de parte de lan solo basta con mirar la imagen, ( lan es mi server) quer&iacute;a ayudar un poco a varios clubes y me echaban al toque o por ir mal ( jamas flamee) o por simplemente quitarme, fui activo con uno y me doli&oacute; much&iacute;simo que me sacaran cuando fui el que incentivo que hacer, que y cuando jugar, e incluso iban mal y como soy positivo en lan pues como que algunos no les agrado ese incentivo que les di y me sacaron , supongo que ellos ya tienen su puntaje completo en fin me doli&oacute; mucho, y aqui dejo algo que me encontr&eacute; entre las multitudes quejas de LAN y LAS disfruten viendo su comunidad \n\nLAN mi server ( me pasare a na y asunto arreglado) : https://k60.kn3.net/taringa/B/8/3/A/A/A/zeroxgamer2012/275.jpg\nLAS : https://k60.kn3.net/taringa/F/3/E/3/7/C/zeroxgamer2012/DB4.jpg","replies":[{"poster":"Quo","date":"2016-07-20T07:16:45.564+0000","up_votes":1,"down_votes":0,"body":"Dile a sparky que se jodio c: mirate ese post \n\nhttp://las.leagueoflegends.com/es/news/community/community-events/soylolero-y-las-recompensas","replies":[{"poster":"KShyGuy","date":"2016-07-20T19:24:48.605+0000","up_votes":1,"down_votes":0,"body":"Aunuqe creo que Sparky no lo hizo solo para joder a esa gente sino solo para que el tenga la skin sin hacer casi nada","replies":[]},{"poster":"Sonya Kyron","date":"2016-07-20T15:12:42.440+0000","up_votes":1,"down_votes":2,"body":"Excelente. En mi club varios ya tenían a diana infernal y jugaron muchísimo para ayudar a los demás incluso la usaron para que la viéramos. Me gusto mucho el trabajo en equipo.","replies":[]}]},{"poster":"Kanhou","date":"2016-07-20T06:38:59.987+0000","up_votes":1,"down_votes":0,"body":"Y el tema mas importante de todos, porque sigues mezclando LAS con LAN, ya no hay nada en comun entre los servidores, deja jugar a los de LAN felices que nosotros aca haremos lo mismo.","replies":[]},{"poster":"Chisolin","date":"2016-07-20T04:53:10.958+0000","up_votes":1,"down_votes":0,"body":"En cuanto a los clubes, pareces una mujer diciendo \"todos los hombres son iguales\", en los 2 clubes que estoy no se echo gente y si llegamos a Diana Infernal, de hecho llegamos y ahi quedamos, en 17.500, para que seguir...\n\nEn cuanto a las quejas de LAN con respecto a la comparación de eventos... Recuerdos... Recuerdos vienen a mi mente, veo, veo gente de LAS quejándose de un 2x1, LAN se rie, LAN dice que son regiones aparte... Aahhh pero cuando le dan algo exclusivo a LAS que ustedes tendran el año que viene: gg rito le dan todo a LAS y a LAN basura...","replies":[{"poster":"skysoul fenrir","date":"2016-07-20T05:24:03.289+0000","up_votes":1,"down_votes":0,"body":"yo quiero entrar a un club que por lo menos tenga lo suficiente para el bono de PI pero nada :c","replies":[]}]},{"poster":"MolotovKiller","date":"2016-07-20T05:12:33.483+0000","up_votes":1,"down_votes":0,"body":"El tema de Clubes que sacan gente deberian prohibirle tener skin siquiera o directamente prohibirles que puedan sacar algun premio (como la cajita) por ser tan rastreros. Respecto a los arañazos de la Fiesta de las Mascaras, todo empezo con el lloriqueo de LAN, negarlo es absurdo. Empezaron quejandose con que no se valia por que LAS estaba de vacaciones, despues por que les quitaron algo que no merecian ¿y ahora se quejan por el evento que nos toco a nosotros? ¿en serio?","replies":[]},{"poster":"ZanahoriaAsesina","date":"2016-07-20T04:49:44.576+0000","up_votes":1,"down_votes":0,"body":"https://img.buzzfeed.com/buzzfeed-static/static/enhanced/webdr05/2013/8/28/18/anigif_enhanced-buzz-14091-1377729402-7_preview.gif\n\nMacho, no se ve bien la imagen (al menos yo que soy medio ciego no veo), el resto todo bien!\n\nMal ahí Sparky.","replies":[{"poster":"hajime saitto","date":"2016-07-20T04:53:13.820+0000","up_votes":1,"down_votes":0,"body":"jajajaj ya la arregle la de lan sorry","replies":[]}]},{"poster":"hajime saitto","date":"2016-07-20T04:52:37.708+0000","up_votes":1,"down_votes":0,"body":"arregle las dos imagenes enjoy","replies":[]},{"poster":"ANYASZOMORÍTÓK","date":"2016-07-20T04:50:23.675+0000","up_votes":1,"down_votes":5,"body":"Interesante lo anotaré en mi lista:\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-","replies":[]}]}