{"poster":"Ghionova","date":"2017-12-10T11:05:18.054+0000","title":"Neuer Spielmodus: \"Reincarnation of History\" / \"Reincarnation of Legends\" WUNSCH!","subforum":"Karten & Spielmodi","up_votes":1,"down_votes":0,"body":"Hallo Beschw&ouml;rer,\r\n\r\nwie du dem Titel entnehmen kannst, geht es hier um die Wiedergeburt von alten Champions. Ich wei&szlig; man muss sich bei Ver&auml;nderungen anpassen und abschlie&szlig;en, jedoch gibt es bestimmt viele Beschw&ouml;rer die noch mal das &quot;alte League of Legends&quot; kennenlernen m&ouml;chten oder auch neue Beschw&ouml;rer, die den Anfang auch mal miterleben wollen. \r\n\r\nEs geht hierbei um die alte Karte, die alten Champs und die damals verf&uuml;gbaren Beschw&ouml;rerzauber, Runen und Meisterschaften.\r\nAlte Champs wie zum Beispiel wo Master Yi und Sion auf AP scalen konnten, Yorick seine Ghule beschw&ouml;ren konnte oder Fiora noch mit ihrer Ult mehrere Champions angreifen konnte. \r\n\r\nDu spielt also auf der alten Karte mit den alten Champs und deren damaligen Texturen und kannst so (noch mal) einen Sprung in die Vergangenheit machen.\r\n\r\nIch wei&szlig; nicht ob dies noch umsetzbar ist, w&auml;re jedoch ein Modus auf den sich bestimmt viele Beschw&ouml;rer freuen w&uuml;rden.\r\n\r\nZudem k&ouml;nnten die Runen und Meisterschaften nur f&uuml;r diesen Modus freigeschaltet werden, wo die Beschw&ouml;rer sie dann auch bearbeiten und anpassen k&ouml;nnen. \r\n\r\nIch w&uuml;rde mich &uuml;ber deine Meinung freuen!\r\n\r\nEinen sch&ouml;nen Tag w&uuml;nsche ich dir! :)\r\n\r\nGhionova{{champion:35}} {{champion:202}} {{champion:432}}","replies":[{"poster":"Nycaria","date":"2017-12-10T12:03:36.838+0000","up_votes":1,"down_votes":0,"body":"Wird es nicht geben, das wurde von Rito schon bestätigt. In einem der \"Frag Riot\" Teile gibts irgendwo ne Erklärung dazu.","replies":[{"poster":"Ghionova","date":"2017-12-10T12:20:43.119+0000","up_votes":1,"down_votes":0,"body":"Ah okay alles klar, vielen Dank!","replies":[]}]},{"poster":"MeMyselfandBaal","date":"2017-12-10T11:40:30.667+0000","up_votes":1,"down_votes":0,"body":"Der Modus wäre auf jeden Fall mal was... Also prinzipiell den \"Worlds-Patch\" jeder Saison mal als rotierenden Gamemodus auspacken... klingt interessant\n\nDas Problem ist... da LoL ein sich stetig weiter entwickelndes Spiel ist, würde ich nicht davon ausgehen, dass Riot die Vorgängerversionen noch irgendwo \"rumliegen\" hat. Gibt ja keinen Grund. Sprich: Mann müsste den letzten Season 1 Patch noch mal rauskramen und neu programmieren. Und das ist verdammt viel Aufwand...\n\nWenn Riot natürlich \"Keystone Patches\" irgendwo aufbehoben hat, wäre es ein wesentlich kleineres Problem die fix aufzuspielen. Ich würde aber nicht davon ausgehen.","replies":[{"poster":"Ghionova","date":"2017-12-10T12:04:24.551+0000","up_votes":1,"down_votes":0,"body":"Genau deswegen könnte ich mir das nicht so ganz vorstellen :) Wäre aber schön WENN haha :D","replies":[]}]}]}