{"poster":"Ghionova","date":"2018-09-17T21:51:32.666+0000","title":"[Championkonzept] Sandro, der Monsterjäger Bilgewassers","subforum":"Skin- & Champion-Konzepte","up_votes":1,"down_votes":0,"body":">**_Geschichte_**\n\nNoch vor langer Zeit, als Gangplank ein erfolgreicher, gef&uuml;rchteter und herrschender Pirat war, geh&ouml;rte Sandro zu seiner Crew. Sandro war ein gew&ouml;hnlicher Hafenarbeiter, der in seiner Freizeit durch Faustk&auml;mpfe zus&auml;tzlich Gold verdiente, um seiner Schwester finanziell unter die Arme zu greifen. Er hatte sich einen Namen gemacht. Jeder nannte ihn &quot;Shark&quot;, weil er in K&auml;mpfen so z&auml;h und gef&auml;hrlich wie ein Hai war. Um dies zu zeigen, trug er als Markenzeichen ein Hemd mit Hai-Motiv und eine Hai-Goldkette seines Vaters, die in den Bilgewasser-Legenden erw&auml;hnt wird. **_(1)_** .  \n\n**_(1)_**\n---\n_**Vater**_ : &quot;Hier mein Sohnemann. Ich m&ouml;chte dir etwas schenken.&quot;\n_**Sandro**_ : &quot;Was denn Vater?&quot;\n**_Vater_** : &quot;Eine Goldkette, du mochtest Haie doch schon seit du deinen Ersten mit 3 gesehen hast.&quot;\n**_Sandro_** : &quot;Aber das ist doch das Wertvollste was du hast Vater. Das kann ich nicht annehmen.&quot;\n**_Vater_** : &quot;Nein, ihr seid das Wertvollste was ich habe. Du und deine kleine Schwester. Ich bestehe darauf.&quot;\n**_Sandro_** : Och Vater, bist du dir sicher? Es ist die Goldkette aus den Legenden! Du kannst mir die nicht einfach so geben.&quot;\n**_Vater_** : &quot;Ja mein Sohn, ich wei&szlig; dass sie bei dir besser aufgehoben ist als bei mir. Au&szlig;erdem belastet mich diese Kette blo&szlig;.&quot;\n**_Sandro_** : &quot;Warum denn das? \n**_Vater_** : &quot;Weil sie mich sehr viel gekostet hat.&quot;\n**_Sandro_** : &quot;Wie viel denn?&quot;\n**_Vater_** : &quot;Familie... Freunde... Ehre... meine Vergangenheit. Sie ist eine Last die ich loswerden und vergessen will. Nimm sie bitte.&quot;\n**_Sandro_** : &quot;Okay Vater, wenn dir das so viel bedeutet, nehme ich die Kette an mich. Danke Vater!&quot;\n**_Vater_** : &quot;Pass gut auf diese Kette auf Sandro. Damit ist das Meer auf deiner Seite.&quot;\n**_Sandro_** : &quot;Versprochen! Danke Vater.&quot;\n\n---\nEines Tages kam Gangplank auf Sandro zu und bot ihm an, gegen gute Bezahlung seiner Crew beizutreten. Sandro willigte ein und seit dem war er ein gesch&auml;tztes Mitglied von Gangplanks Crew. Gemeinsam als Crew brachten sie Angst und Schrecken, enterten Schiffe und pl&uuml;nderten sie. Nach unz&auml;hligen Raubz&uuml;gen kam es zu einer Auseinandersetzung zwischen Sandro und Gangplank. Gangplank befahl keine Zeugen zur&uuml;ckzulassen. Sandro widersetzte sich dem Befehl von Gangplank, da er eine &auml;ngstliche Frau mit einem ungeborenen Kind unter dem Fu&szlig;boden bemerkte und sie mit einem Rettungsring entkommen lie&szlig;, bevor sie das Schiff in die Luft jagten **_(2) _**.\n\n**_(2)_**\n---\n**_Gangplank_** : &quot;Habe ich mich nicht klar ausgedr&uuml;ckt Sandro? Ich sagte KEINE ZEUGEN!&quot;\n**_Sandro_** : &quot; Ich k&ouml;nnte nicht damit leben ein Ungeborenes zu t&ouml;ten.&quot;\n**_Gangplank_** : &quot;Es gibt Regeln an die man sich halten muss. Du wei&szlig;t was beim ersten Verrat gefordert wird nicht wahr?&quot;\n**_Sandro_** : &quot;Einen Finger gegen ein ganzes Leben ? Fairer Handel. Das ist es mir Wert...&quot;\n---\n Gangplank bekam Sandros Handeln mit und als Strafe forderte er Sandros Mittelfinger. Sandros verst&uuml;mmelte rechte Hand hatte nun nicht mehr so viel Schlagkraft wie seine Linke, deshalb ging er zu einem Waffenschmied und Mechaniker, um einen Enterhaken an seinem rechten Arm anbringen zu lassen. Nach der Montage setzte er seine Aufgaben als Pirat fort, bis Gangplank eines Tages zu weit ging und den Fischkutter seiner Schwester als Ziel w&auml;hlte, um f&uuml;r seine gro&szlig;e Raubzug-Reise Proviant zu beschaffen. Dass es sich um ihren Fischkutter handelte, bemerkte Sandro erst als es schon zu sp&auml;t war. Es kam zu einem gewaltigen Konflikt zwischen Sandro und der Crew. Gangplank machte kurzen Prozess, enthauptete Sandros Schwester und schickte Sandro in der Haibucht &uuml;ber die Planke. Er weigerte sich jedoch zu springen und riss Gangplank mit ins Meer **_(3)_** . \n\n**_(3)_**\n---\n**_Sandro_** : &quot;Wieso!? Sag mir wieso hast du das getan Gangplank!? Sie war meine Schwester!!&quot;\n**_Gangplank_** : &quot;Ja... und das Ziel. Wir werden keine angefangene Aufgabe abbrechen. Zeugen k&ouml;nnen uns in den Ruin treiben... Das wirst du wohl nie lernen du Sturkopf!&quot;\n\n**_Sandro_** : &quot;Ich h&auml;tte nie im Leben gedacht, dass du und deine Crew &uuml;ber Leichen der Familienmitglieder gehen w&uuml;rdet. Ihr werdet daf&uuml;r bezahlen! Eines Tages wirst du alles verlieren Gangplank! Daf&uuml;r sorge ich!!!&quot;\n\n**_Gangplank_** : &quot;Die Crew zu verraten wird mit dem Tode bestraft. Anstatt dich zu enthaupten, werde ich dich &uuml;ber die Planke schicken. Ihr solltet nicht den selben Tod haben... das w&auml;re n&auml;mlich das Einzige was euch noch verbinden w&uuml;rde...&quot;\n\n(Sandro auf der Planke)\n\n**_Gangplank_** : &quot;Na los worauf wartest du! Die Monster warten auf dich. Spring runter oder ich werde nachhelfen m&uuml;ssen.&quot;\n**_Sandro_** : &quot;Die einzigen Monster die ich hier sehen kann, sind die die mich im Wasser sehen wollen....&quot;\n**_Gangplank_** : &quot;Na warte, dich werde ich eigenh&auml;ndig von der Planke werfen!&quot;\n**_Sandro_** : &quot;Dann werde ich dich mit in die Tiefe nehmen.&quot;\n---\nDaraufhin erschienen zwei besessene Haie, die Sandro in die Tiefe zogen. Die Haie brachten ihn zu einem Schiffswrack und seine Goldkette fing an zu leuchten. Der Luftmangel lie&szlig; Sandro in Ohnmacht fallen. Unz&auml;hlige Haie schwammen um Sandro und die Goldkette setzte ihre Kraft frei und verwandelte ihn in einen humanoiden Hai. Als Sandro in der Kabine des Kapit&auml;ns zu sich kam, bemerkte er seine Verwandlung und lachte vor Freude und Begeisterung. Als er das Schiffswrack verlassen wollte, begegnete er auf dem Schiffsdeck einer Geister Crew. Sie bedankten sich bei ihm mit einem Geschenk und verschwanden **_(4)_** . \n\n**_(4)_**\n---\n**_Shark-Kapit&auml;n_** : &quot;Du hast die Kette zur&uuml;ckgebracht und uns vom Fluch befreit. Wir danken dir.&quot;\n**_Shark-Crew_** : &quot;Vielen Dank!&quot;\n**_Sandro_** : &quot;Ich wusste dass die Legende stimmt. Wart ihr das, die mich hierher gebracht haben?&quot;\n**_Shark-Kapit&auml;n_** : &quot;Ja, wir hatten egoistisch gehandelt und uns ohne deine Erlaubnis vom Fluch befreit und dich als S&uuml;ndenbock missbraucht. Tut uns sehr Leid aber der Fluch qu&auml;lt uns schon seit Ewigkeiten.&quot;\n**_Sandro_** : &quot;Scherzt ihr? Ich w&auml;re bestimmt drauf gegangen. Mir wurde alles genommen was ich hatte und liebte. Dies ist die Gelegenheit neu anzufangen, als anderes Ich.&quot;\n**_Shark-Kapit&auml;n_** : &quot;Hmm, wir hatten mit einer anderen Reaktion gerechnet hehe... Nimm als Zeichen unserer Dankbarkeit und Entschuldigung diese Shark-Schiffskanone, sie ist noch intakt und kann dir in der Zukunft helfen... und lass jeden Wissen dass wir noch existieren!&quot;\n**_Sandro_** : &quot;Danke, ich muss jetzt los, eine menge Arbeit wartet auf mich... ich muss jetzt ein paar Monster jagen.&quot;\n---\nSandro schwamm zur&uuml;ck nach Bilgewasser, um dort ein neues Leben anzufangen und sich gegen Gangplank zu erheben.\n---\n>**_Bilgewasser-Legende - Das Schiffswrack der Sharks_**\n\nIn den Legenden steht geschrieben, dass ein verfluchtes Schiffswrack in der Haibucht liegt und alle gierigen Taucher und Piraten in Angst und Schrecken versetzt. Vor langer Zeit, als die Amphora Shark noch von einer Mannschaft besetzt wurde, waren sie in Bilgewasser durch ihre Hai-Dekorationen und ihren Stil bekannt. Die Amphora Shark bekam ihren Namen als die Piraten eine mystische verfluchte Goldkette in einer versunkenen Truhe gefunden haben. In der Truhe befand sich eine Nachricht in der drauf Stand, wann und wohin die Goldkette gebracht werden sollte. Die Nachricht enthielt folgende Botschaft: &quot;Falls jemand das hier lesen sollte, bin ich wahrscheinlich schon Fischfutter. Bringt diese Kette in genau 6 Jahren zur Krakenbucht. Andernfalls werdet ihr vom Meer heimgesucht. In genau 6 Jahren w&auml;re ich 50 geworden. Das w&auml;re das Alter, in dem mich der Fluch heimgesucht h&auml;tte..&quot; Die Shark-Piraten lie&szlig;en sich gewaltig zeit, bis sie sich doch dazu entschieden haben, die Goldkette zur Krakenbucht zu bringen. Einer der Crew wollte die Goldkette nicht abgeben und lief mit ihr in der Nacht davon. Die Shark-Piraten fuhren unbewusst los und erreichten die Krakenbucht gegen Mitternacht. Sie stellten fest dass die Goldkette und ein Crew Mitglied fehlte und wurden daraufhin von unz&auml;hligen Haien angegriffen, die das Schiff zerst&ouml;rten. Die Sharks sanken in die Tiefe und rissen den Fluch mit sich. Seit dem Tag schwimmen viele Haie in der Bucht und der Ort wurde in Haibucht umbenannt. Man sagt man k&ouml;nne den Fluch brechen, indem man die Kette zur&uuml;ck zur Amphora Shark bringt, dort die Kraft der Goldkette entfesselt und somit den Fluch bricht. Man munkelt dass die Kraft f&uuml;r denjenigen, der die Kette zur&uuml;ck zum Schiffswrack bringt,  ein Segen sei, oder... den Fluch in ihn hineinzieht.\n---\n\n>**_Artwork, Skills und Skizze_**\n\nArtwork: https://www.deviantart.com/ghionova/art/Championkonzept-Sandro-artwork-759379889\nSkills: https://www.deviantart.com/ghionova/art/Championkonzept-Sandro-artwork-skills-759379969\nVolles Bild: https://www.deviantart.com/ghionova/art/Championkonzept-Sandro-artwork-full-759380151\nSkizze: https://www.deviantart.com/ghionova/art/Championkonzept-Sandro-artwork-Skizze-759380231\n\n---\n\n> **_Aussehen &amp; Charakter_**\n\nSicherlich k&ouml;nnt ihr aus den obigen Bildern entnehmen, dass er  ein Hai-Hybrid ist, der mit einer Enterhaken-Kralle und einer Schiffskanone bewaffnet ist.\nEr sieht alle schrecklichen Menschen (wie Gangplank) als Monster der Gesellschaft und will all diese Monster beseitigen. Dabei ist er fest entschlossen und scharfsinnig. Vom Wesen her ist Sandro eine Mischung aus Besch&uuml;tzer und Raufbold. Gegner die ihn nicht (schwer) unterkriegen verh&ouml;hnt er. Er kann Haie kontrollieren und ihnen Befehle geben, die er auch gegen Feinde im Meer einsetzt. \n---\n> **_Login Animation_**\n\nVorschlag 1:\n\nMan sieht wie ein paar Piraten in ihrem Schiff Karten spielen. Eine Kanonenkugel zerst&ouml;rt die Wand von Au&szlig;en und er erscheint aus der Rauchwolke die dadurch entstand.\n\nVorschlag 2:\nSandro springt aus dem Meer empor und versucht einen Piraten mit seinem Maul zu schnappen.\n\nVorschlag 3: \nSandro steht beim Hafen, der Fischer vor Piraten verteidigt und die Piraten verjagt.\n\nUm dies etwas bildlich darstellen zu k&ouml;nnen, habe ich eine Skizze angefertigt.\nLogin-Animation-Skizze:  https://www.deviantart.com/ghionova/art/Sandro-Login-Animation-Skizze-764362715\n\n\n---\n\n>**_Charakter Animation_**\n\nNummer 1: Stand-Animation\nNummer 2: Lauf-Animation\nNummer 3: Sprint-Animation\nNummer 4: W-R&uuml;cksto&szlig;-Animation\nNummer 5: R-Tachgang-und-Sprung Animation\nNummer 6: P-Schnapp-Animation\nNummer 7: Q-Aushol-Animation\nNummer 8: 1/2/3 Tod-Animation\nNummer 9: Spruch (Bankdr&uuml;cken mit der Schiffskanone)\nNummer 10: Tanz (Posiert mit den Muskeln, hockt sich in die Knie und springt X-f&ouml;rmig auf. (Siehe auf Youtube Euro-Training von der Whats up Dad Folge: Ein bisschen zugelegt.)\n\nEbenso f&uuml;r die Animationen habe ich eine Skizze angefertigt.\nAnimation-Skizze: https://www.deviantart.com/ghionova/art/Sandro-Animation-Skizze-764362640\n----\n\n>**_Spr&uuml;che_**\n\nBann: Jetzt haben die Monster Freilauf...\n\nPick: Dann gehen wir mal auf Monsterjagd\n\nErste Bewegung: \n1.Das ist also der Ort wo viele Monster ihr Unwesen treiben...\n2.Heute habe ich ein gutes Gefühl bei der Sache.\n3.(Wenn Gangplank im gegnerischen Team ist) Ich rieche die Bestie!\n4.(Wenn Gangplank im selben Team ist) WIESO KANN ICH IHN NICHT TÖTEN!!! AAAAAAARRRRGHHH!!!\n\nAngriff:\n1.Das war erst der Anfang!\n2.Huch, zarter als gedacht.\n3.Wage es ja nicht zu fliehen!\n\nTodesstoß: \n1.Wie schwach...\n2.Von deinem Fleisch bekomme ich bestimmt Magenkrämpfe.\n3.Wer ist der Nächste!?\n4.Warum gebe ich mich mit so etwas ab?\n\nSandros Todesstoß:\n1. Was zum..!?\n2. Ich komme wieder!.... Nrgh.. \n3. Die Tiefe... wird... mich rächen....\n\nSTRG-1: Was steht heute auf der Speisekarte? Champignons? Was zur...? Achsoo Champions! Hahahah... ich sollte echt an meiner Handschrift arbeiten. (Holt einen Zettel raus, guckt erstaunt, und danach erleichtert.) Nur dieser Spruch l&ouml;st die Animation aus.\nSTRG-1: Hiiiii (Hai).... *panisch* -&gt; wo!? Hahah immer wieder gut! (Winkt mit der Hand, reagiert panisch und f&auml;ngt an zu lachen.) Nur dieser Spruch l&ouml;st die Animation aus.\nSTRG-1: Nur noch etwas aufw&auml;rmen bevor der Spa&szlig; losgeht. (Bankdr&uuml;cken mit der Schiffskanone) Nur dieser Spruch l&ouml;st die Animation aus.\n\nSTRG-2: Du bist so durch wie meine letzte Mahlzeit! \nSTRG-2: Beweise mir das du z&auml;h genug bist um lange genug durchhalten zu k&ouml;nnen!\nSTRG-2: Glaub mir, ich bin z&auml;her als ich aussehe... und das muss schon was hei&szlig;en. (Zeigt mit dem Daumen auf sich und guckt Stolz geradeaus.)\n\nSTRG-3: Heheh schau sie dir gut an... (Tanz)\nSTRG-3: Sooo muss das sein hahah... (Tanz)\n\nSTRG-4: Lach-Animation\n\nBegegnungen mit Champions (wichtigste)\n{{champion:21}} : Wir haben den selben Feind... Wir k&ouml;nnten sehr gute Freunde werden.\n{{champion:41}} : Wie f&uuml;hlt es sich an, alles zu verlieren? / Du hast alles verloren, welch Ironie des Schicksals. Du wirst niemals deinen Titel zur&uuml;ckerobern, daf&uuml;r sorge ich! / Das allergr&ouml;&szlig;te Monster... auf dem Silbertablett serviert! \n{{champion:104}} : Ein Dieb, ein Spieler, ein S&ouml;ldner... aber kein Monster.\n{{champion:4}} : Auf deine Tricks werde ich nicht hereinfallen.\n{{champion:105}} : Ein kleiner Happen auf Beinen. Snack. Weg.\n{{champion:420}} : Nagakabouros kontrolliert von einer Frau? Wer von euch ein Gott ist steht wohl fest.\n{{champion:111}} : Ich werde dich nicht aufhalten Nautilus. Deine Beweggr&uuml;nde sind nachvollziehbar.\n{{champion:555}} : Das werde ich nicht zulassen Pyke...\n\nKauf von Items (wichtigste)\n{{item:3071}} : Ein Beil. Hm.. H&auml;tte ich schon viel fr&uuml;her gebrauchen k&ouml;nnen.\n{{item:3742}} : Dieses Ding strahlt Schande aus! \n{{item:3065}} : Heheheheh... gut f&uuml;r den Stoffwechsel!!\n\n\n---\n\n>**_Itembuild_**\n\nTANK:{{item:3071}} {{item:3065}} {{item:3143}} {{item:3156}} {{item:3083}} {{item:3047}} /{{item:3111}} \nFIGHTER:{{item:3071}} {{item:3065}} {{item:3022}} {{item:3156}} {{item:3742}} {{item:3047}} /{{item:3111}} \nJUNGLE:{{item:1413}} {{item:3748}} {{item:3742}} {{item:3065}} {{item:3071}} {{item:3158}} /{{item:3117}} \nSUPPORT:{{item:3401}} {{item:3800}} {{item:3143}} {{item:3190}} {{item:3050}} {{item:3117}}/ {{item:3009}} \n\n\n---\n> _**Statistiken**_\n\nLVL 1-18: \nHP: 580-2240\nAD: 66-153\nAS: 0,621-1,126\nARMOR: 36-121\nMR: 32-60\nMS: 340\nRANGE: 200 &amp; 350\n---\n>**_Spielweise_**\n\nSandro ist ein Tank/Bruiser, der seinem Team im Kampf gut aushelfen kann. Mit seiner Combo kann er sich in die Gegner st&uuml;rzen, einen Gegner greifen und ihn zu seinem Team ziehen (R+Q+W). Ebenfalls kann er in einer brenzligen Situation mit seiner (W+Q) Combo entkommen und ggf. einen Gegner mitnehmen und in die Turmreichweite ziehen oder ihn den Todessto&szlig; verpassen. Seine Combo eignet sich gut um z.B. einen Gegner die Flucht zu erschweren, indem er ihn in seine Turmrichtung zieht, w&auml;hrend z.B. der Jungler ganken kommt, um den Fokus auf dieses Ziel zu legen. Seine Z&auml;higkeit macht ihn widerstandsf&auml;hig und robust. Je mehr Leben er hat, desto Z&auml;her kann er werden und desto mehr Fettreserven kann er anbauen. Diese kann er au&szlig;erhalb eines Kampfes oder w&auml;hrend eines Kampfes unter 30% HP einsetzen, die seine Lebensregeneration &sup1; und sein Lauftempo &sup2; vor&uuml;bergehend anheben, wenn gegnerische Champions verfolgt &sup2;. \n---\n> _**F&auml;higkeiten**_\n\n_**P - Auf-hai-ternde Mahlzeit**_\n\nSandro besitzt eine Fettreservenleiste, die er durch das Bei&szlig;en von Gegnern auff&uuml;llt. Der Anfangswert der Leiste betr&auml;gt ohne zus&auml;tzliches Leben 31,25 (aufgerundet 32)\n\n1: Auf-hai-ternde Mahlzeit\nWenn ein Gegner in Sandros Nahkampfreichweite steht, kann er alle 10 Sekunden ein St&uuml;ck vom selben Ziel abbei&szlig;en, dabei (100% Angriffsschaden) (+6% deines maximalem Lebens) normalen Schaden verursachen und es in seiner Leber speichern. Bei jedem Biss stellt Sandro 10-180 Leben (10 pro Stufe) (+ 8% deines maximalen Lebens) wieder her und baut 6-15% (0.5% pro Stufe) in der Fettreservenleiste auf. (Reduziert den Schaden und Heilung bei Vasallen und Monster um 20%).\nJe mehr maximales Leben Sandro besitzt, desto mehr Fettreserven kann er anbauen. (Obergrenze liegt bei 4000 Leben = 250 Fettreserven)\n\n2: Z&auml;he Haut\nSandro erh&auml;lt f&uuml;r jede Fettreserve 0.1 Z&auml;higkeit.\n\n**_Q - Enterhaken-Kralle_**\nErste Aktivierung:\nSandros n&auml;chster Angriff wird zu einem Nahkampfangriff, der Gegner im sichelf&ouml;rmigen Bereich 70/90/110/130/150 (+ 55% Angriffsschaden)  normalen Schaden verursacht und sich an den ersten getroffenen Champion festhakt. \n\nZweite Aktivierung:\nSandro kann das Ziel nach 3/2,5/2/1,5/1 Sekunde(n) zu sich ziehen.\n\nSollte Sandro sich durch andere Hilfsmittel als \"Shark-Schiffskanone\" und Blitz fortbewegen (Threshs Lanterne / Tahms Verschlingen / Tristana (Gegner) ult etc...) löst sich der Haken und das Ziel wird für 1 Sekunde um 40/45/50/55/60% verlangsamt.\n\n14/12,5/11/9,5/8 Sekunden Abklingzeit\nKeine Kosten\n200 Reichweite \n\n**_W - Shark-Schiffskanone_**\n\nPASSIV: Durchschlag:\nNormale Fernkampf-Angriffe durchdringen Gegner, die vor dem anvisierten Ziel stehen und verursachen 10/20/30/40/50 (+ 10% Fähigkeitsstärke) normalen Schaden.\n\nAKTIV: Kanonenkugel\nSandro schie&szlig;t eine Kanonenkugel auf ein kleines Gebiet und verursacht 50/80/110/140/170 (+65% Angriffsschaden) normalen Schaden. Gegner werden im Wirkbereich für 1,5 Sekunden um 50/55/60/65/70% verlangsamt. Falls Sandro im Wirkbereich steht, werden Gegner stattdessen leicht zurückgestoßen und er dabei um 350/450/550/650/750 Einheiten zur&uuml;ckgesto&szlig;en. \n\n14/13/12/11/10 Sekunden Abklingzeit\nKeine Kosten\n750 Reichweite\n\n**_E - Reiseproviant_**\n\nSandro verbraucht seine Fettreserven und wandelt diese innerhalb von 10/9/8/7/6 Sekunden in 10 Leben pro Fettreserve um. W&auml;hrend Sandro seine Fettreserven aufbraucht, erh&auml;lt er 15/20/25/30/35% Lauftempo wenn er sich auf gegnerische Champions zubewegt.\n(Kann im Kampf nur eingesetzt werden, falls du weniger als 30% deines maximalen Lebens hast)\n\nSollte Sandro bei über 170 Fettreserven \"Reiseproviant\" aktivieren, erhält er für 3 Sekunden 40/50/60/70/80% Angriffstempo. Sollte Sandro 220 Fettreserven haben und \"Reiseproviant\" aktivieren, erhält er für 3 Sekunden Immunität gegen kritische Treffer.\n\n30/27/24/21/18 Sekunden Abklingzeit\nKeine Kosten\n0 Reichweite\n\n**_R - Tauchgang des Schreckens_**\n\nSandro springt in die Tiefe und kann f&uuml;r bis zu 3 Sekunden frei im Wasser bewegen und keine F&auml;higkeiten aktivieren (au&szlig;er &quot;Reiseproviant&quot;). Während des Tauchgangs erleidet er nur 50/40/30% vom Gesamtschaden, den er erhalten würde. Nach 3 Sekunden springt er mit seinem gigantischen Maul aus der Tiefe hervor und verursacht an jedem getroffenen Gegner 135/255/375 (+ 30% Angriffsschaden) (+ 70% F&auml;higkeitsst&auml;rke) magischen Schaden und verlangsamt sie für 2 Sekunden um 40/50/60%. Falls ein Gegner im viereckigen Bereich steht, krallt Sandro einen zuf&auml;lligen Gegner mit der Enterhaken-Kralle fest.\n\n(Erneutes dr&uuml;cken der Ult zieht das Ziel zu Sandro.)\n\n150/125/100 Sekunden Abklingzeit\nKeine Kosten\n400 Sprung-Reichweite\n500 Radius (Angriff)\n120x450 Rechteck (Kralle) (Siehe Skill-Skizze)\n(Während des Tauchgangs ragt Sandros Haiflosse aus dem Boden und die Gegner können nur seine Flosse angreifen, was den verringerten Schaden erklären würde.\n\n---\n\n>  **_Skin_**\n\nIch habe mir ein Konzept ausgedacht. Sandro w&auml;re zur H&auml;lfte Fisch und zur H&auml;lfte Roboter. Er ist mit einer gr&uuml;n leuchtenden Enterhaken-Kralle und einer kybernetischen Bazooka ausger&uuml;stet. Ein Auge wurde mechanisch modifiziert und ist an einem Kabel angebunden. Sein Kiefer wurde entfernt und eine Metallkiefer mit gro&szlig;en Fangz&auml;hnen wurde implantiert. Dem Skin gebe ich den Namen: Haiborg!\n\nSelbstverst&auml;ndlich darf hier auch keine Skizze fehlen!\nKonzept f&uuml;r Haiborg-Sandro: https://www.deviantart.com/ghionova/art/Sandro-Haiborg-Skinkonzept-764362560\n\n\nIch bin auf eure Meinung sehr gespannt und hoffe ihr habt einen guten Eindruck von Sandro bekommen! :D \nFalls Fragen auftauchen, fragt einfach nach!\n\nLG\n\nGhionova","replies":[{"poster":"INoKami","date":"2018-09-23T19:12:03.229+0000","up_votes":1,"down_votes":0,"body":"Mir ist gerade langweilig und meines Animes laden noch im Hintergrund, damit ich nachher ruckelfrei schauen kann, also dachte ich mir \"Tun wir doch mal was nützliches und bewerten mal das Ding hier!\" Und genau das geschieht jetzt!\n\n---\n\n**Aussehen:** Ein... Wer-Hai. Kann man mögen, muss man nicht... ich bin eher so Fraktion \"Muss man nicht\". Aber immerhin kannst du zeichnen, nicht so wie ich, der nicht mal eine gerade Linie ziehen kann, selbst wenn er sich konzentriert...\n\n**Lore:** Die Idee mit den Gesprächen hat auf jeden Fall was, ist aber meiner Meinung nach etwas blöd gelöst, weil man dann immer hin- und herscrollen muss und ein bisschen aus dem \"Flow\" gerissen wird, weil man danach auch immer erst mal wieder schauen muss, wo man stehen geblieben ist. Ich persönlich hätte eher versucht, die Gespräche direkt in die Lore mit einzubauen.\nZur Lore selber: ...Hmmmja, es ist irgendwie nicht wirklich etwas besonderes. Ich bin leider mittlerweile zu einer Art Gegner von klischeebehafteten Storys geworden und leider lässt sich auch deine Lore da nicht freisprechen. Allem voran das \"Scheinbar nutzloses Familienartefakt erweist sich im letzten Moment als rettender Gegenstand\"-Klischee. Das Problem ist halt, so was habe ich schon gefühlt hundert Mal gelesen und irgendwann ist es halt nichts besonderes mehr, die \"Magie\" dahinter zieht einfach nicht mehr beim 101. Mal. Sorry.\nUnd auch die ganze Shark-Thematik ist mir ein bisschen zu viel, zu sehr \"in your face\", a.k.a. etwas weniger Haie hätten der Lore auch gut getan.\n\n**Texte:** Eigentlich gibt es pro Aktion (Joke/Taunt) immer nur eine Animation, drei verschiedene gab es noch nicht und wirkt irgendwie... überladen. Ansonsten: Du weißt, dass auch normalerweise Move-/Attack-Commands, Pick-/Ban-Sprüche und ein paar weitere dazugehören? Fehlen nämlich komplett. Die Sprüche selber... klar, ironische Sprüche bieten sich immer an und sind auch einfacher zu schreiben (ich sprech… schreibe aus Erfahrung), aber das führt mit sich, dass es, sofern der Charakter nicht darauf ausgelegt ist, irgendwie unglaubwürdig rüberkommt, man nimmt den Charakter nicht ernst. Und da ich dein Konzept eher als ernsteren Charakter sehe, weil er aufgrund der Lore eben viel mehr Gründe hat, ernst anstatt fröhlich zu sein, stellt sich hier auch das Glaubwürdigkeitsproblem...\nOder ich kann mir einfach nicht vorstellen, wie die meisten davon ernst klingen würden, was auch ein anderes Problem wäre...\n\n---\n\nZumindest schon mal etwas, also schauen wir mal, was die Fähigkeiten parat halten:\n\n**\nDie Passive:** Zuerst mal ein _*_ _ba dum tss_ _*_ für den Namen.\nEigentlich ein ganz normaler verstärkter AA mit einem gar nicht mal so schwachen Heal und einer Spezialressource. Nicht gut, aber auch nicht schlecht soweit. Schauen wir mal noch, was die anderen Fähigkeiten bringen, vor allem wegen der Spezialressource, vielleicht ändert sich ja meine Meinung.\nUnd es gibt eine Tenacity-Obergrenze? Wäre mir neu, aber wenn es so ist...\n(Ich hab zumindest mal in einem Vandiril-Viedo gesehen, dass man quasi 100% Tenacity haben kann... ich glaub, ab 96% ging nichts mehr, aber dann würden die 4% Differenz auch keinen Unterschied mehr machen...)\n\n**\nDie Q:** Noch ein verstärkter AA(-Reset sogar in dem Fall) und wieder mit HP-Scaling… den auf Tank zu spielen wird auf jeden Fall lustig. Die Fähigkeit hat was von einer besseren Pyke-Q, der man obendrein noch schlechter ausweichen kann. Sobald der AA sitzt, hat man quasi schon verloren.\n\n**\nDie W:** Also eine Malphite-W in permanent. Und das ist nur der passive Effekt? Andererseits macht diese Fähigkeit wenig Sinn auf einem Melee-Champ, da im Normalfall aufgrund der geringen Reichweite einfach nichts zwischen dir und deinem Ziel passen wird.\nDie aktive ist irgendwie eine Gragas-Ult Lite kombiniert mit einem Ziggs-W. Meiner Meinung nach muss mindestens einer der beiden Fähigkeiten (Knockback) runter.\n\n**\nDie E:** Ah, das machen die Fettreserven also... eine Beinahe-Mundo-Ult. Und Kritresistenz (die wir eigentlich schon so bei der Aktivierung bekommen, wieso also nochmal, wenn wir die Fähigkeit bei >170 Reserven aktivieren?). Und einen ordentlichen Schild. Schlicht und ergreifend überladen. Mit dem Heal kann man noch leben (auch wegen der 30% max. HP-Restriktion), aber kombiniert mit dem Rest ist das zu viel.\nUnd mir fällt jetzt erst auf, dass es ein ressourcenloser Champ (-> kein Mana o.Ä.) ist. Eieiei, das könnte imba werden...\n\n**\nDie R:** Der Hai der Fizz-Ult hat sich selbstständig gemacht? Denn so ungefähr liest sich die Fähigkeit. 3 Sekunden unangreifbar, frei beweglich und noch ein saftiger AoE zum Abschluss... das wird für Frust sorgen. Gerade auch deshalb, weil die Passive auf alle angewandt wird (und spätestens hier macht die W-Passive keinen Sinn mehr). Aber:\n\n* Welchen viereckigen Bereich? Der wird nirgendwo erwähnt?\n* Wieso ist auf einmal die Q mit im Spiel? Die wird nirgendwo erwähnt und ist in Verbindung mit dem restlichen Schaden und dem CC viel zu OP.\n\nBeides leider irgendwie schlecht/nicht nachvollziehbar/gar nicht erklärt.\n\nUnd ganz am Ende wie immer: **Der letzte Kommentar:**\n\nDu magst Haie, oder? Träumst du nachts von der 5-Mann-Fizz-Ult?\n..Ach, keine Ahnung, heute fällt mir nichts relevantes ein, was ich noch hinzufügen will xP\n\n---\n\n**\nDas Fazit:** Das Drumherum ist da und das ist schon mal etwas, wenn ich mir mal zum Vergleich andere \"Konzepte\" ansehe (Namesharing ist verboten, also müsst ihr selber herausfinden, wer gemeint sein könnte) und, seien wir mal ehrlich, viele der Sachen stören eher subjektiv als objektiv, also im Großen und Ganzen passabel. Die Fähigkeiten sind eher so \"Pyke nach 3-jähriger US-Marines-Ausbildung\", aber ich habe schon gesagt, was mich daran stört und werde es nicht wiederholen, also schließen wir das Kapitel mit vorläufigen **5/10 Punkten**.\n\nNatürlich habe ich bewusst das Wort \"vorläufig\" mit eingebaut, denn bei entsprechenden Verbesserungen bin ich gerne dazu bereit daran etwas zu ändern. Also, schauen wir mal, was daraus noch werden kann. Aber ich warne dich, wenn du versagst, schmeiße ich dich eigenhändig in ein Haifischbecken!\n\nHahahahahaha...haha..ha…\n\nOk, ich bin weg!\n\nMfG\n\nIncaedeus\n{{sticker:galio-happy}} \n_Leidenschaftlicher Galio-Main_","replies":[{"poster":"Ghionova","date":"2018-09-23T21:38:00.042+0000","up_votes":1,"down_votes":0,"body":"Hey, gewaltiger Text! Danke dass du dir da Zeit für nimmst! \nDann versuche ich mal deinen Wünschen gerecht zu werden.\n\nIch habe folgendes ergänzt:\n-Die Dialoge in die Story mit einbezogen.\n-Sprüche aktualisiert\n-Fähigkeiten angepasst,\nQ: %-Leben Schaden entfernt\nW: PASSIV Schaden drastisch verringert und Fernkampf angegeben\nW: AKTIV Debuff in Slow geändert und den Knockback nur eingeführt wenn Sandro selbst in der W steht.\nE: Schild entfernt, Angriffstempo hinzugefügt.\nR: \"Unverwundbarkeit\" gegen reduzierten Schaden ausgetauscht, P-Trigger durch Verlangsamung ersetzt.\nDen rechteckigen Bereich in der Ult angegeben \"(Siehe SKill-Skizze)\n\n> Die W: Also eine Malphite-W in permanent. Und das ist nur der passive Effekt? Andererseits macht diese Fähigkeit wenig Sinn auf einem Melee-Champ, da im Normalfall aufgrund der geringen Reichweite einfach nichts zwischen dir und deinem Ziel passen wird.\n\nSandro ist beispielsweise wie Jayce, sowohl \"Nahkampf\" als auch Fernkampf. Er benötigt näheren Kontakt mit dem Ziel um seine Q und P auszulösen. Bei den Basiswerten steht Angriffsreichweite 200(Nahkampf) und 350(Fernkampf). Er ist eigentlich ein Fernkämpfer, der von Nahkampfangriffen profitieren kann. \n\n> Und mir fällt jetzt erst auf, dass es ein ressourcenloser Champ (-> kein Mana o.Ä.) ist. Eieiei, das könnte imba werden...\n\nDie Passive ist in diesem Fall im Verhältnis mit der von Mordekaiser oder Rengar vergleichbar, da sie in dem Fall eine Leiste benötigen um zu funktionieren.\n\n> Wieso ist auf einmal die Q mit im Spiel? Die wird nirgendwo erwähnt und ist in Verbindung mit dem restlichen Schaden und dem CC viel zu OP.\n\nDas Festhaken bei der Ult macht keinen Schaden, andernfalls hätte ich es angegeben.\n\nIch hoffe ich konnte dem gerecht werden.\n\nLG\n\nGhionova","replies":[]}]},{"poster":"TheGanera","date":"2018-09-18T15:04:47.213+0000","up_votes":1,"down_votes":0,"body":"Mir ist gerade etwas langweilig, also schreib ich einfach auch mal ein bisschen was.\n\n> P - Auf-hai-ternde Mahlzeit\n> \n> Sandro besitzt eine Fettreservenleiste, die er durch das Beißen von Gegnern auffüllt. Der Anfangswert der Leiste beträgt ohne zusätzliches Leben 31,25 (aufgerundet 32)\n> \n> 1: Auf-hai-ternde Mahlzeit\n> Wenn ein Gegner in Sandros Nahkampfreichweite steht, kann er alle 10 Sekunden ein Stück vom selben Ziel abbeißen, dabei (100% Angriffsschaden) (+6% deines maximalem Lebens) normalen Schaden verursachen und es in seiner Leber speichern. Bei jedem Biss stellt Sandro 10-180 Leben (10 pro Stufe) (+ 8% deines maximalen Lebens) wieder her und baut 6-15% (0.5% pro Stufe) in der Fettreservenleiste auf. (Reduziert den Schaden und Heilung bei Vasallen und Monster um 20%).\n> Je mehr maximales Leben Sandro besitzt, desto mehr Fettreserven kann er anbauen. (Obergrenze liegt bei 4000 Leben = 250 Fettreserven)\n> \n> 2: Zähe Haut\n> Sandro erhält für jede Fettreserve 0.1 Zähigkeit und kann die Obergrenze der Zähigkeit überbrücken.\n\nIch bin mir nicht sicher, wie viel Zähigkeit anrichtet, daher fällt es mir hier sehr schwehr viel über diese Fähigkeit zu sagen.\nPrinzipiell gefallen mir zwar die Details, die du eingebaut hast, wie zum Beispiel, dass er seine Fettreserven in seiner Leber speichert, jedoch finde ich einen verstärkten normalen Angriff alle 10 Sekunden etwas langweilig.\n\n> Q - Enterhaken-Kralle\n> Erste Aktivierung:\n> Sandros nächster Angriff wird zu einem Nahkampfangriff, der Gegner im sichelförmigen Bereich 70/90/110/130/150 (+ 55% Angriffsschaden) (+ 5% des maximalem Lebens) normalen Schaden verursacht und sich an den ersten getroffenen Champion festhakt.\n> \n> Zweite Aktivierung:\n> Sandro kann das Ziel nach 3/2,5/2/1,5/1 Sekunde(n) zu sich ziehen.\n> \n> 14/12,5/11/9,5/8 Sekunden Abklingzeit\n> Keine Kosten\n> 200 Reichweite \n\nHier habe ich mehrere Fragen:\nSchleift er den Gegner, an dem er sich festhakt, beim Schlag mit?\nUnd was passiert, wenn Sandro sich zu weit von seinem Opfer entfernt?\nAn sich gefällt mir die Idee aber ganz gut.\n\n> W - Shark-Schiffskanone\n> \n> PASSIV: Durchschlag:\n> Normale Angriffe durchdringen Gegner, die vor dem anvisierten Ziel stehen und verursachen (20/25/30/35/40% Angriffsschaden) normalen Schaden.\n> \n> AKTIV: Kanonenkugel\n> Sandro schießt eine Kanonenkugel auf ein kleines Gebiet und verursacht 50/80/110/140/170 (+65% Angriffsschaden) normalen Schaden. Gegner werden im Wirkbereich leicht zurückgestoßen. Falls Sandro im Wirkbereich steht, wird er dabei um 350/450/550/650/750 Einheiten zurückgestoßen.\n> \n> 14/13/12/11/10 Sekunden Abklingzeit\n> Keine Kosten\n> 750 Reichweite\n\nWieder eine Frage:\nWerden Treffereffekte bei \"Sekundärzielen\" mit unverändertem Schaden ausgelößt?\nIch finde zudem den Sprung, den man erhält, sollte man sich im Einschlagsbereich befinden, sehr gefährlich in Verbindung mit dem hohen Zähigkeitswert.\nAußerdem gefällt mir der Name \"Kanonenkugel\" nicht. Aber das ist nun wirklich irrelevant.\n\n> E - Reiseproviant\n> \n> Sandro verbraucht seine Fettreserven und wandelt diese innerhalb von 10/9/8/7/6 Sekunden in 10 Leben pro Fettreserve um. Während Sandro seine Fettreserven aufbraucht, erhält er 15/20/25/30/35% Lauftempo wenn er sich auf gegnerische Champions zubewegt und kann in der Zeit keine kritischen Treffer erleiden.\n> (Kann im Kampf nur eingesetzt werden, falls du weniger als 30% deines maximalen Lebens hast)\n> \n> 30/27/24/21/18 Sekunden Abklingzeit\n> Keine Kosten\n> 0 Reichweite\n\nDiese Fähigkeit macht ihn natürlich zu einem Todfeind für ADCs, also zumindest für diejenigen, die auf kritische Treffer angewiesen sind.\nAußerdem glaube ich, das man dadurch, das man die Fähigkeit verbessert, effektiv Geschwindigkeit verliert.\nZudem stllt sich hier die Frage, wann diese Fähigkeit einzusetzten ist:\nVersuche ich durch sie meine Eröffnung zu stärken, oder verwende ich sie, um mein Leben zu retten?\n\n> R - Tauchgang des Schreckens\n> \n> Sandro springt in die Tiefe und kann für bis zu 3 Sekunden nicht anvisiert werden und keine Fähigkeiten aktivieren (außer \"Reiseproviant\"). Nach 3 Sekunden springt er mit seinem gigantischen Maul aus der Tiefe hervor und verursacht an jedem getroffenen Gegner 135/255/375 (+ 50% Angriffsschaden) (+ 50% Fähigkeitsstärke) magischen Schaden und löst bei jedem Gegner die \"Auf-hai-ternde Mahlzeit\" aus. Falls ein Gegner im viereckigen Bereich steht, krallt Sandro einen zufälligen Gegner mit der Enterhaken-Kralle fest.\n> \n> (Erneutes drücken der Ult zieht das Ziel zu Sandro.)\n> \n> 150/125/100 Sekunden Abklingzeit\n> Keine Kosten\n> 400 Sprung-Reichweite\n\nHier war einer der Grundgedanken, dass er in die Tiefe springt und geheilt zurückkehrt, oder?\nEigentlich gar keine so schlechte Idee, aber dann hätte ich entweder das Lauftempo, oder die Verhinderung des Schadens durch kritische Treffer aus **Reiseproviant** entfernt. Außerdem wäre es dann ganz schön gewesen, die Zeit, während der man abgetaucht bleiben kann mit der, während der die **E** aktiv ist gleichzusetzten.\nAuch hier habe ich wieder eine Frage: \nMan taucht immer an der Stelle wieder auf, an der man sich in die Tiefe gestürtzt hat, oder?\n\nDas waren ein paar Gedanken zu den Fähigkeiten. Auch wenn ich bei fast jeder etwas zu bemängeln hatte, finde ich den Champion durchaus solide.\n\n\n\nUnd natürlich noch ein bisschen pedanterie am Ende:\n\n> Das allergrößte Monster... auf dem Silberteller serviert!\n\nMeines Wissens nach heißt es \"auf dem Silbertablett\".","replies":[{"poster":"Ghionova","date":"2018-09-18T15:58:22.258+0000","up_votes":1,"down_votes":0,"body":"Hey,\n\n> Prinzipiell gefallen mir zwar die Details, die du eingebaut hast, wie zum Beispiel, dass er seine Fettreserven in seiner Leber speichert, jedoch finde ich einen verstärkten normalen Angriff alle 10 Sekunden etwas langweilig.\n\nDanke erstmal. Zu dem Thema mit \"alle 10 Sekunden\", damit ist jedes Ziel gemeint. Jedes gebissene Ziel hat eine Abklingzeit von 10 Sekunden. Es ist praktisch wie das Verfahren bei Yasuos E, wo er alle 0.2 Sekunden dashen kann, aber auch nur alle 6 Sekunden (glaube ich)am selben Ziel.\n---\n> Hier habe ich mehrere Fragen:\nSchleift er den Gegner, an dem er sich festhakt, beim Schlag mit?\nUnd was passiert, wenn Sandro sich zu weit von seinem Opfer entfernt?\nAn sich gefällt mir die Idee aber ganz gut.\n\nNein, wenn er ihn hinterher schleifen würde, hätte ich es beschrieben. Sandros Haken krallt sich nur am Ziel fest und bei erneuter Aktivierung zieht er es dann zu sich. Das mit der Entfernung werde ich überarbeiten. Ich werde folgendes hinzufügen: \"Sollte Sandro sich durch andere Hilfsmittel als \"Shark-Schiffskanone\" und Blitz fortbewegen (Threshs Lanterne / Tahms Verschlingen / Tristana (Gegner) ult etc...) löst sich der Haken und das Ziel wird für 1 Sekunde um 40/45/50/55/60% verlangsamt.\"\n---\n\n> Wieder eine Frage:\nWerden Treffereffekte bei \"Sekundärzielen\" mit unverändertem Schaden ausgelößt?\nIch finde zudem den Sprung, den man erhält, sollte man sich im Einschlagsbereich befinden, sehr gefährlich in Verbindung mit dem hohen Zähigkeitswert.\nAußerdem gefällt mir der Name \"Kanonenkugel\" nicht. Aber das ist nun wirklich irrelevant.\n\nSenkundärziele erleiden nur 40% von Sandros Gesamtangriffsschadens, dies werde ich genauer angeben. Dass Sandro im Wirkbereich stehen muss, steht bereits als letztes bei seiner W-Fähigkeit. Leider sind mir keine Synonyme für Kanonenkugel bekannt, deshalb wird es bei dem Namen bleiben ^^\n---\n> Diese Fähigkeit macht ihn natürlich zu einem Todfeind für ADCs, also zumindest für diejenigen, die auf kritische Treffer angewiesen sind.\nAußerdem glaube ich, das man dadurch, das man die Fähigkeit verbessert, effektiv Geschwindigkeit verliert.\nZudem stllt sich hier die Frage, wann diese Fähigkeit einzusetzten ist:\nVersuche ich durch sie meine Eröffnung zu stärken, oder verwende ich sie, um mein Leben zu retten?\n\nBeim erneuten lesen stelle ich fest dass ich dir da zustimmen muss. Werde es überarbeiten in folgendes: Sollte Sandro bei über 170 Fettreserven \"Reiseproviant\" aktivieren, erhält er in den ersten 3 Sekunden Immunität gegen kritische Treffer. Sollte Sandro 220 Fettreserven haben und \"Reiseproviant\" aktivieren, erhält er für 3 Sekunden einen Schild in höhe von 25% seines maximalen Lebens. \nDies soll dann ein kleiner Ansporn sein, seine Fettreserven zu speichern.\nHaie lagern Fettreserven in ihrer Leber um diese für lange Reisen als Futter vorrätig zu haben. Diese werden auch verbraucht wenn ein Hai Energie verbrauchen (im Endeffekt schneller schwimmen, jagen etc.) deshalb passt das Lauftempo ganz gut ( da er sein Ziel \"jagt\")\nDiese Fähigkeit kann für beides Situationen eingesetzt werden.\n---\n> Hier war einer der Grundgedanken, dass er in die Tiefe springt und geheilt zurückkehrt, oder?\nEigentlich gar keine so schlechte Idee, aber dann hätte ich entweder das Lauftempo, oder die Verhinderung des Schadens durch kritische Treffer aus Reiseproviant entfernt. Außerdem wäre es dann ganz schön gewesen, die Zeit, während der man abgetaucht bleiben kann mit der, während der die E aktiv ist gleichzusetzten.\nAuch hier habe ich wieder eine Frage:\nMan taucht immer an der Stelle wieder auf, an der man sich in die Tiefe gestürtzt hat, oder?\n\nDas waren ein paar Gedanken zu den Fähigkeiten. Auch wenn ich bei fast jeder etwas zu bemängeln hatte, finde ich den Champion durchaus solide.\n\nSandro kann während des Tauchgangs seine E einsetzen, allerdings seine W und Q nicht einsetzen (wie im Text beschrieben). Eine gewisse Heilung kann bestehen da seine Passive ausgelöst wird, sollte er ein Ziel treffen. Werde bei der Ult folgendes ergänzen: \"Sandro kann sich während des Tauchgangs frei bewegen.\"\n---\n> Meines Wissens nach heißt es \"auf dem Silbertablett\".\n\nJa da hast du Recht, war zu dem Zeitpunkt etwas abgelenkt ^^ Danke dir. \n\nHoffe ich konnte deine Fragen verständlich beantworten","replies":[{"poster":"TheGanera","date":"2018-09-18T16:47:35.991+0000","up_votes":1,"down_votes":0,"body":"> Leider sind mir keine Synonyme für Kanonenkugel bekannt, deshalb wird es bei dem Namen bleiben ^^\n\nWas hälst du von Karronade?\nLaut Wikipedia sind das leichte Kanonen, die seit dem Ende des 18. Jahrhunderts im Einsatz sind.\nhttps://de.wikipedia.org/wiki/Karronade","replies":[{"poster":"Ghionova","date":"2018-09-18T17:30:28.378+0000","up_votes":1,"down_votes":0,"body":"Jaa hört sich nicht schlecht an. Es sollte sich aber um eine schwere Schiffskanone handeln, da er eine Kanonenkugel mit Wucht und starkem Rückstoß abfeuern soll. Außerdem wäre dann der Taunt mit dem Gewicht heben sinnlos bzw. Blender-Like. xD","replies":[]}]},{"poster":"TheGanera","date":"2018-09-18T16:34:47.119+0000","up_votes":1,"down_votes":0,"body":"> R - Tauchgang des Schreckens\n> \n> Sandro springt in die Tiefe und kann für bis zu 3 Sekunden frei im Wasser bewegen, nicht anvisiert werden und keine Fähigkeiten aktivieren (außer \"Reiseproviant\"). Nach 3 Sekunden springt er mit seinem gigantischen Maul aus der Tiefe hervor und verursacht an jedem getroffenen Gegner 135/255/375 (+ 50% Angriffsschaden) (+ 50% Fähigkeitsstärke) magischen Schaden und löst bei jedem Gegner die \"Auf-hai-ternde Mahlzeit\" aus. Falls ein Gegner im viereckigen Bereich steht, krallt Sandro einen zufälligen Gegner mit der Enterhaken-Kralle fest.\n> \n> (Erneutes drücken der Ult zieht das Ziel zu Sandro.)\n> \n> 150/125/100 Sekunden Abklingzeit\n> Keine Kosten\n> 400 Sprung-Reichweite\n\nHier habe ich jetzt die Sorge, dass diese Fähigkeit einen sehr unabwendbaren Charakter bekommt.\nEventuell solltest du darüber nachdenken, ob es wirklich wichtig ist, dass Sandro aus dem Wasser irgendwo hinspringt.\nEr könnte auch sattdessen wie ein weißer Hai aus der Tiefe emporstoßen.\n\nAußerdem habe ich nirgendwo gefunden, wie groß dieser \"viereckige Bereich\" sein soll.\n\nZudem, und das ist wirklich nur eine kleinigkeit, würde ich Sandr sich einfach an dem nächsten Gegner, anstatt an einem zufälligen , festhaken lassen.","replies":[{"poster":"Ghionova","date":"2018-09-18T17:28:33.612+0000","up_votes":1,"down_votes":0,"body":"Das Rechteck ist leicht im Radius auf der rechten Seite seiner Ult wenn er aus dem Wasser springt. Deshalb ist positioning vor dem Erscheinen wichtig. Den Wirkbereich habe ich bei der Ult hinzugefügt. Sandro sollte wie der Weiße Hai seiner Beute auflauern und deswegen so im Wasser frei schwimmen können, damit er \"unerwartet\" irgendwo zuschlagen kann. :D","replies":[]}]},{"poster":"TheGanera","date":"2018-09-18T16:28:30.519+0000","up_votes":1,"down_votes":0,"body":"> Dass Sandro im Wirkbereich stehen muss, steht bereits als letztes bei seiner W-Fähigkeit.\n\nAh, dann war das, was ich geschrieben habe missverständlich.\nWenn Sandro direkt vor sich auf den Boden schießt, wird er auf der höchsten Stufe von **Kanonenkugel** 750 Einheiten zurückgestoßen, oder?\nDas heißt dann aber, dass er dies auch als Sprung benutzen kann.\n\nMir fällt jedoch gerade auf, dass das ganze deutlich weniger gefährlich ist, als ich zunächst dachte.\nBei genauerer Betrachtung erschienen mir die Grundwerte dieses Champions erstaunlich niedrig, so niedrig, dass sie vermutlich erhöt werden sollten.\nAbgesehen davon scheint der Champion eher ein Tank, denn ein Bruiser zu sein, da er mit Leben skaliert, sich selbst heilen kann, keine Schadensfähigkeit hat(bis auf seine ultimative Fähigkeit) und dafür zwei, die mit Massenkontrolle ausgestattet sind.","replies":[{"poster":"Ghionova","date":"2018-09-18T17:22:42.979+0000","up_votes":1,"down_votes":0,"body":"Um ihn am effektivsten zu nutzen sollte man auch AD Items kaufen, da alle auf AD und AP Skalieren, einige davon mit Leben. Darum eignet sich ein Bruiser Build für Sandro. Ich war der Meinung passende Werte ausgedacht zu haben, da ich von ausging, dass es sich dabei um ein sehr starkes Kit handeln würde.","replies":[]}]}]}]},{"poster":"Aspected Helios","date":"2018-09-18T06:39:23.810+0000","up_votes":1,"down_votes":2,"body":"habs nur überflogen und damit ist mir aufgefallen dass der dude viel zu stark ist und das wort \"schwanger\" wird und sollte niemals in league auftauchen ... genauso wie \"eine frau\" im sexistischen sinne lol selbst wenn es sinn macht","replies":[{"poster":"Ghionova","date":"2018-09-18T12:47:30.274+0000","up_votes":1,"down_votes":0,"body":"Habs überarbeitet. Aber zum Thema mit \"eine Frau\", wie würdest du es denn formulieren wenn du \"diese Frau\" nicht kennst und das einzige was du entnehmen kannst, ihr Geschlecht ist?","replies":[{"poster":"Aspected Helios","date":"2018-09-18T14:12:22.837+0000","up_votes":1,"down_votes":2,"body":"\"dir\"? lmao","replies":[{"poster":"Ghionova","date":"2018-09-18T14:31:24.473+0000","up_votes":1,"down_votes":0,"body":"... und weiter?","replies":[{"poster":"Aspected Helios","date":"2018-09-18T15:06:55.253+0000","up_votes":1,"down_votes":2,"body":"omg ... ersetze bei dem satz einfach das frauen ding mit \"dir\" ... jeez","replies":[]}]}]}]}]},{"poster":"PHUB Silphi","date":"2018-09-18T11:47:43.142+0000","up_votes":1,"down_votes":3,"body":"hab die passive schon gelesen und gedacht \" yop overtuned as fuck! könnte direkt bei riot arbeiten \"","replies":[]}]}