{"poster":"Ghionova","date":"2018-04-29T11:05:43.343+0000","title":"[Championkonzept] Darvul, der finstere Visionär","subforum":"Skin- & Champion-Konzepte","embed":{"description":null,"url":"https://scontent-ams3-1.xx.fbcdn.net/v/t1.0-9/31432643_975749235925678_3558852765239214080_o.jpg?_nc_cat=0&oh=99b1f63febe3b1e9247b90b33bd9cf99&oe=5B64A84E","image":null},"up_votes":1,"down_votes":0,"body":">** Darvul, der finstere Vision&auml;r**\n\nDie Inspiration f&uuml;r das Design des Champions stammt von einer Kreatur aus dem Spiel Raziel Dungeon Arena. Klar ist das Aussehen beinahe kopiert, aber ich finde es gibt zu wenige Champions die eine finstere Ritterr&uuml;stung tragen. Hierbei ist nur von Champions ohne Skins die Rede. Ich habe mir ein Konzept f&uuml;r einen Toplaner und Jungler &uuml;berlegt und hoffe es kommt bei euch gut an. :)\nHier eine Champion-Skizze und zwei Bilder: \nChampion-Skizze:\n[Champion-Skizze:](https://scontent-ams3-1.xx.fbcdn.net/v/t1.0-9/31432643_975749235925678_3558852765239214080_o.jpg?_nc_cat=0&amp;oh=99b1f63febe3b1e9247b90b33bd9cf99&amp;oe=5B64A84E)\n\n**(BILD 1)**\n[Vorstellung von Darvuls Aussehen](http://roleplayerschronicle.com/wp-content/uploads/2017/08/29977e1c-4be1-4c12-a348-404be3fec1e0.jpg)\n**_(BILD 2)_**\nDort w&auml;re der Name des Spiels zu sehen, ich will nicht dass das wie Werbung f&uuml;r ein anderes Spiel r&uuml;ber kommt. Deshalb warte ich erst bis sich ein Rioter meldet und es absegnet.\n----\n> **Story**\n\nSeit Anfang der Zeit existiert die absolute Finsternis. Die absolute Finsternis ist eine Parallelwelt in der seit langer Zeit zwei Völker im Krieg stehen. Vor dem Krieg herrschten Gott und Göttin und unter ihnen ihre Kinder an einer Seite. Der Sohn, Darvul, war der Erstgeborene und wurde mit dem Auge des Visionärs gesegnet, welches Kräfte von Seelen absorbieren und immer mächtiger werden kann. Das Auge des Visionärs kann in die Zukunft sehen und alle Folgen und Handlungen eines Lebewesens einkalkulieren. Er ist ein Halbgott der sich wie sein Vater nach Ordnung und Kontrolle sehnt. Seine Mutter und seine Schwester Imuriela waren das komplette Gegenteil. Sie sehnten sich nach Chaos und Zerstörung. Sie ließen sich durch Macht und Gier leiten. Seit dem gab es nur Meinungsverschiedenheiten und Probleme. Eines Tages sollte eines der Geschwister den Thron übernehmen, um über das Volk zu regieren und um ihre Unsterblichkeit zu erlangen. Voller Selbstbeherrschung und Entschlossenheit war sich Darvul seinem Sieg bewusst und das wusste auch seine Mutter. Die Zeremonie zum Thronfolger stand bevor. Sie wollte unbedingt ihre Tochter auf dem Thron sehen und plante ein Attentat auf Darvul, um ihren Traum zu verwirklichen. Darvul war den Beiden gegenüber sehr misstrauisch, da in letzter Zeit viel Chaos im Reich herrschte und er sie für den Auslöser hielt. Da das Auge des Visionärs bei Göttern nicht eingesetzt werden kann, aber bei Halbgöttern wirkt, durchleuchtete er seine Schwester und sah das Übel kommen. Darvul warnte seinen Vater vor der Zeremonie. Er glaubte erst nach großen Zweifeln an die Warnung seines Sohnes. Ihm blieb keine andere Wahl, also schickte seine Frau und Tochter und alle Bewohner die für ihre Ziele stehen ins Exil. Die Zeremonie wurde verschoben, da es zu keinem geschwisterlichen Kampf kam. Sie errichteten ihr eigenes Volk und seit dem stehen sie im Krieg. Darvul fiel auf, dass es keine Angriffe von außen gab, was er seltsam fand. So sandte er Spione aus, die seine Schwester beschatten sollten. Die Spione beobachteten wie das Portal des Herrschers, welches eine Reise in die Parallelwelt ermöglicht, offen stand und immer wieder Seelen hergebracht wurden. Imuriela verwandelte ihre Krieger in finstere Seelen, die sich so mit ihr in die Parallelwelt begaben um dort weitere starke Seelen zu finden und in die absolute Finsternis zu bringen damit sie anschließend von ihrer Mutter in einer Seelenschmelze in Sklaven- und Krieger-Seelen umgeformt werden. Sie erteilten Darvul bericht und er meldete dies sofort. Sein Vater war so sehr entsetzt über das Ausmaß an Bosheit von seiner Frau und Tochter, dass er Darvul in eine verborgene Kammer brachte, von der niemand sonst etwas wusste. Dort lag ein Schwert, welches Götter vernichten und Seelen in die absolute Finsternis zurückholen kann. Er übergab Darvul das Schwert und taufte es Darvulthym. Er befahl Darvul in die Parallelwelt zu reisen, um seine Schwester zu vernichten und um die Kräfte der Krieger-Seelen zu entnehmen und sie zurück zu schicken. So schlich er sich zum Portal des Herrschers und gelang in die Parallelwelt. Dank seinem dritten Auge konnte er seine Schwester leicht ausfindig machen. Er hatte sie bei einem Überfall auf ein Dorf ertappt und ging sofort dazwischen.  Es kam zum Kampf in dem sich keiner etwas schenkte. Er überraschte sie mit der Schnappfunktion seines Schwertes und teilte ihren Körper horizontal in zwei Stücke. Am Boden kriechend schickt sie ihre Seelen mit einer Nachricht zurück und lachte Darvul mit ihren letzten Atemzügen aus. Ohne ein Wort exekutierte er sie, nahm die Seele seiner Schwester auf, absorbierte ihre Kräfte und schickte sie zurück zu seinem Vater. Das Portal durch welches Darvul in die Parallelwelt kam hat sich geschlossen. Seine Mutter hatte es geschlossen, nach dem ihr die geflohenen Seelen davon berichtet haben. Seit dem ist er von seiner Heimat ausgesperrt und kann erst dann zurück reisen, wenn er die Kräfte von vielen Krieger-Seelen seiner Schwester absorbiert hat, die sich überall verbreitet und vermehrt haben. Er deckte mit seinen Augen viele Seelen auf und absorbierte deren Kräfte und schickte sie zurück. Eines Tages hörte er von einem Ort, an dem es von Chaos und Zerstörung nur so wimmelt und machte sich auf den Weg, auf den Weg nach Runeterra.\n\n**_&quot;Wir sollten die Dorfbewohner nicht t&ouml;ten, ihre Sch&auml;tze reichen uns aus! Grundloser Mord erz&uuml;rnt nur den Richter der Finsternis!&quot;_**\n_-Rechte Hand des Anf&uuml;hrers einer Diebesbande_\n**_&quot;Mein Sohn! Versprich mir ein anst&auml;ndiger Mann zu werden. Du sollst nicht so enden wie dein Papa!&quot; _**\n_-Besorgte ehemalige Gr&auml;fin des Unterbezirks von Noxus_\n**_&quot;Wenn dich ein finsterer Nebel umschleiert und du ein lautes zorniges Atmen h&ouml;rst, bete dass du nicht die gesuchte Person bist!&quot;_**\n_- Ein H&auml;ndler w&auml;hrend eines Raub&uuml;berfalls_\n----\n> **Zusatzinformation **\n\n* Je mehr Krieger-Seelen Darvul in die absolute Finsternis bringt, desto m&auml;chtiger wird sein Auge..\n* Imuriela und Darvul waren bis zum ihrem letzten Kampf Halbgötter. Darvul wurde nach der Entkr&auml;ftung von Imurielas Seele zum Gott und sie wurde zum gew&ouml;hnlichen Unterweltler.\n* In den Geschichten der Menschen wird Darvul als &quot;Richter der Finsternis&quot; bezeichnet.\n* Die letzten drei S&auml;tze unter der Story sollen Berichte von Menschen sein, um zu zeigen, dass Menschen Darvul f&uuml;rchten, respektieren und meiden wollen.\n* Es gibt zwei Arten von finsteren Seelen. Es gibt die M&auml;rtyrer-Seelen, die sich nur nach Chaos, Zerst&ouml;rung und Anarchie sehnen und es gibt die gew&ouml;hnlichen finsteren Seelen, die nicht von Darvuls Schwester negativ beeinflusst wurden. \n* Wer sich fragt was ein &quot;Schnappschwert&quot; ist, dazu mehr bei dem Unterthema &quot;Aussehen&quot; oder bei den &quot;F&auml;higkeiten&quot; die Q-F&auml;higkeit. :D\n\nPS: **BILD 3** Hier ein Bild von der Anfangszeit der absoluten Finsternis. (Das Bild ist ein Screenshot aus der Leere von Dishonored 2) \n[Die absolute Finsternis](https://i.pinimg.com/originals/45/47/95/454795b4d0baf113e3e352d298d46d1e.jpg)\n---\n> **Aussehen und Charakter**\n\n**Aussehen:** Siehe Champion Skizze. Darvul tr&auml;gt eine schwarze Ritterr&uuml;stung, hat zwei teuflische H&ouml;rner, sein drittes Auge und sein Schnappschwert.\nDas Schnappschwert kann sich wie eine Zange ausfahren und bei einem Gegner zuschnappen. Um euch ein Bild zu machen, ist es bei der Champion-Skizze die Q-F&auml;higkeit die zeigt, wie es gemeint ist.\n**Charakter:** Darvul, der Herrscher der absoluten Finsternis, regiert mit Strenge, Kontrolle und Ordnung. Er duldet kein Fehlverhalten, das der absoluten Finsternis schadet und bestraft dieses Fehlverhalten sehr streng. Er behandelt sein Volk mit Ehre, Respekt und Stolz, wohingegen er die M&auml;rtyrer-Seelen zu tiefst verabscheut. Er ist Menschen gegen&uuml;ber neutral, da sie ihm egal sind, es sei denn es sind finstere Seelen(M&auml;rtyrer-Seelen) im Spiel. Er ist nicht die Art von D&auml;mon, die alles vernichten will so wie M&auml;rtyrer. Er ist der Meinung, dass Ordnung und Kontrolle mehr Macht haben als Furcht und Schrecken.\n\n> **Animationen**\n\n**Login-Animation:** Da habe ich mir vorgestellt wie die Login Animation mit einer Nahaufnahme von Darvuls geschlossenem Auge beginnt und dann hinauszoomt. Man sieht ihn triumphierend in der absoluten Finsternis stehen so wie in dem Screenshot oben. Dann &ouml;ffnet er sein drittes Auge und man sieht ein Heer von finsteren Rittern, Chim&auml;ren, Drachen, Berserkern, Bestien und mehr wie sie marschieren (oder ggf.  im Hintergrund fliegen). Bild siehe Champion-Skizze.\n\n**Lauf-Animation:** Sollte eine Mischung aus der Laufanimation von Aatrox und Ekko sein.\n**Hast-Animation:** Beim Lauftemposchub sollte seine Hast-Animation &auml;hnlich wie die von PROJEKT: Yi sein.\n**Verlangsamung-Animation:** Er bewegt sich taumelnd fort, als w&uuml;rde er jeden Moment zusammenbrechen.\n**Kampf-Animation:**Sollte bei einem Schlag von rechts nach links sein Schwert mit beiden H&auml;nden halten und bei einem Schlag von links nach rechts nur mit der rechten Hand halten. Dazwischen ab und zu bei einer Drehung ausholen und einen Angriff ausf&uuml;hren.\n**Krit. Treffer-Animation:** Schl&auml;gt mit Wucht sein Schwert diagonal nach oben.\n**Sterben-Animation 1/2/3:** 1: Darvuls f&auml;llt zu Boden und rammt dabei sein Schwert in den Boden und erschafft ein Portal, welches ihn in die absolute Finsternis bef&ouml;rdert. 2: Darvul f&auml;llt zu Boden und seine finsteren Ritter ziehen ihn in die absolute Finsternis. 3: Darvul wird zu Schatten und verschwindet in seinem Schwert, welches anschlie&szlig;end auf den Boden f&auml;llt.\n---\n> Rolle &amp; Spielweise\n\nEr ist haupts&auml;chlich ein Bruiser (Offtank) Toplaner, der die Toplane mit seinen F&auml;higkeiten dominieren kann. Durch sein (Q)Schnappschwert hat er eine sehr gute Waveclear F&auml;higkeit die sich sehr gut mit Gefr&auml;&szlig;ige Hydra erg&auml;nzt. Durch (W) das Auge des Vision&auml;rs, kann er Ganks vorhersehen und vorr&uuml;bergehend sehen, wann F&auml;higkeiten wieder bereit sind. Die Schattenwelle kann einen Gegner vor&uuml;bergehend Gegner verlangsamen und bei einem Treffer gew&auml;hrt die F&auml;higkeit einen Schild und einen kritischen Schlag beim n&auml;chsten normalen Angriff. Die F&auml;higkeit kann zu Schar der Finsternis aufgewertet werden und gew&auml;hrt statt der Verlangsamung einen Fear-Effekt. Die Ult l&auml;sst in einem gro&szlig;en Kreis einen Nebel entstehen der die Sicht der gegnerischen Champions und allen Vasallen einschr&auml;nkt. Dies kann zum Vorteil im Falle eines gegnerischen Ganks genutzt werden. Zudem kann die Ult erneut aktiviert werden, dabei kann Darvul einen Sprung ausf&uuml;hren und beim Einschlag Gegner hochschleudern und den Gegner dabei &uuml;berraschen. Jedoch verfliegt die Dauer der eingeschr&auml;nkten Sicht, je nach dem wie viel Verb&uuml;ndete Champions sich in dem Nebel befinden. Darvul bleibt jedoch f&uuml;r die ganze Dauer des finsteren Nebels schwer zu sehen. Darvul kann Teamfights gut starten und den Gegner mit dem Einschlag &uuml;berraschen und sich somit in den ersten Sekunden des Teamfights einen Vorteil verschaffen. Zudem k&ouml;nnte man Darvul im Jungle spielen, da er durch sein Clear relativ gut ganken kann, gegnerische Wards und versteckte Champs aufsp&uuml;ren kann und um Gegner mit der Ult zu &uuml;berrumpeln.\n\nPS: Bei der Ult wollte ich noch anmerken: Es handelt sich dabei um eine Kr&uuml;mmung der beiden Welten. Im Inneren des finsteren Nebels werden Darvuls finstere Ritter erscheinen (darunter Chim&auml;ren, Ritter, Berserker und Hunde). Diese  k&ouml;nnen sich nicht bewegen, sind unangreifbar und starren den Gegner an, bis er zu nahe kommt. Dann greifen sie an und f&uuml;gen dem Gegner sehr wenig schaden zu gew&auml;hren Darvul allerdings einen geringen abfallenden Hast-Bonus. Jeder finstere Ritter kann jeden gegnerischen Champion nur ein Mal w&auml;hrend der Nebeldauer angreifen. Ich finde die Ult sollte mit der Story verbunden werden :)\n\n> **Runen**\n\nF&uuml;r offensive Runen sollte man die Schl&uuml;sselrune **Pr&auml;zision: Eroberer** /  **Dominanz: Elektrisieren** / **Zauberei: Arkaner Komet ausw&auml;hlen. Ich w&uuml;rde eher zur Eroberer Schl&uuml;sselrune tendieren, da er ein K&auml;mpfer ist. \n\n**Pr&auml;zision Runenseite:** Eroberer wie oben beschrieben. Legende: Z&auml;higkeit, perfekte defensive Rune um seine Z&auml;higkeit noch weiter zu steigern. \n\n**Dominanz Runenseite:** Elektrisieren, erh&auml;lt den Effekt schnell weil seine Q 2x aktivierbar ist. Argus Verm&auml;chtnis, erh&ouml;ht deinen AD-Wert und ist \nleicht zu stacken, weil du mit Auge des Vision&auml;rs Wards aufsp&uuml;ren kannst (mehr dazu bei den F&auml;higkeiten). Gefr&auml;&szlig;iger J&auml;ger gibt nochmal zus&auml;tzlich Lebensrauf auf F&auml;higkeiten, was sich gut eignet wenn Absolut finstere Pr&auml;senz bereit ist und du Gefr&auml;&szlig;ige Hydra und Tanz des Todes hast.\n\n**Zauberei Runenseite:** Arkaner Komet, andere Schl&uuml;sselrunen eignen sich nicht f&uuml;r Darvul. Der Ultimative Hut und &Uuml;berlegenheit geben dir Abklingzeitverringerung, was sehr gut zu Darvul passt, da seine F&auml;higkeiten hohe Abklingzeit besitzen und um seine Q so oft wie m&ouml;glich einsetzen zu k&ouml;nnen.\n\n**Entschlossenheit Runenseite:** Umklammerung der Toten, mehr Durchhalteverm&ouml;gen. / Nachbeben, Darvuls Hauptf&auml;higkeit l&ouml;st diese Rune aus. Unerschrocken, gibt dir zus&auml;tzliche Z&auml;higkeit.\n\n**Inspiration Runenseite:** Lohnt sich eigentlich nicht, weil eigentlich nur Kosmische Einsicht etwas bringen w&uuml;rde.\n\n> **Beschw&ouml;rerzauber**\n\nTypischer Toplaner{{summoner:12}} {{summoner:4}} \nAggressiver Spielstil {{summoner:14}} {{summoner:4}} \nMobiler Spielstil{{summoner:6}}{{summoner:4}} \nJungle{{summoner:11}} {{summoner:4}} \n\n> **Items**\n\n**Core Items**\n {{item:3071}} {{item:3074}} / {{item:3748}} \n_Schwarzes Beil_: Unerl&auml;ssliches Item, welches dir viel Abklingzeitverringerung und R&uuml;stungsdurchdringung gibt.\n_Gefr&auml;&szlig;ige Hydra_: Offensive Wahl, gute Waveclear und Angriffsschaden.\n_Titanische Hydra_: Defensive Wahl, gute Waveclear und die defensive Alternative zu Gefr&auml;&szlig;ige Hydra.\n\n**Offensive Items**\n{{item:3078}} {{item:3053}} {{item:3812}} {{item:3156}} \n_St&auml;rke der Dreieinigkeit_: Alternative zu Schwarzes Beil.\n_Steraks Pegel_: Erh&ouml;hter Basis-Angriffsschaden und enormer Schild + Z&auml;higkeit \n_Tanz des Todes_: Heilung durch F&auml;higkeiten und normale Angriffe + verringerter erhaltener Schaden\n_Schlund von Malmortius_: Aktiver Effekt gibt dir Lebensraub und Angriffsschaden\n\n**Defensive Items**\n{{item:3075}} {{item:3143}} {{item:3742}} {{item:3065}} \n_Dornenpanzer_: Gut gegen viele Angriffstempo-Champions + verringerte Heilung (klaffende Wunden)\n_Randuins Omen_: Starker Verlangsamungseffelt und verringerter erhaltener Schaden von krit. Treffern.\n_R&uuml;stung des toten Mannes_: Mobilit&auml;t und Durchhalteverm&ouml;gen.\n_Geistessicht_: Erh&ouml;hte Heilung aus allen Quellen.\n\n**Schuhe**\n{{item:3047}} {{item:3111}} \n_Ninja Tabi_: Verringerter erhaltener Schaden von normalen Angriffen.\n_Merkurs Schuhe_: Z&auml;higkeit.\n\n>** Attribute und Klasse**\n\nEigenschaft |**Wert + Levelbonus**\nHP |\t**630\t+ 94**\nHPReg |**9\t+0,6**\nMP\t|**285 + 57**\nMPReg\t|**5\t+0,8**\nLauftempo|\t**340\t**\nAngriffsschaden|\t**64\t+3,6**\nAngriffsgeschwindigkeit|\t**0,656\t+2,6%**\nR&uuml;stung|\t**36\t+3,6**\nMagieresistenz\t|**30\t+1,2**\nHitbox|\t**175**\t\nReichweite|\t**205**\n\n ---\n\n>**F&auml;higkeiten**\n\n\n  **_P - Kampfkunst des Visionärs_**\n\nWenn Darvul von einem gegnerischen Champion angegriffen wird, erh&auml;lt er f&uuml;r die n&auml;chsten 3 Sekunden **7 (+ 6% zus&auml;tzliche R&uuml;stung / Magieresistenz)** Rüstung und Magieresistenz. Der Bonus erhöht sich jede 7 Stufen um 10. (7/17/27) \n30/20/10 Sekunden Abklingzeit. (Abklingzeit reduziert sich jede 7 Stufen um 10 Sekunden.\n\nWenn Darvul **Schnappschwert Darvulthym** aktiviert, erhält er auf seinen nächsten normalen Angriff erhöhtes Angriffstempo und verursacht 110% Schaden.\n\n**_Q - Schnappschwert Darvulthym_**\n\n1. Aktivierung: Schwert schnappt zu und f&uuml;gt Gegnern **35/65/95/125/155 (+ 55% zus&auml;tzlicher Angriffsschaden)** normalen Schaden zu.\n2.Aktivierung: Schwert schnappt mit einer h&ouml;heren Reichweite zu, f&uuml;gt Gegnern **40/70/100/130/160 (+ 60% zus&auml;tzlicher Angriffsschaden)** normalen Schaden zu und st&ouml;&szlig;t alle getroffenen Einheiten in die Mitte der Klinge.\nDie Abklingzeit von **Schnappschwert Darvulthym** verringer sich f&uuml;r jeden getroffenen gegnerischen Champion um 0,25 Sekunden.\n\n(Gegnerische Champions können Darvuls Abklingzeitverringerung auf Schnappschwert Darvulthym nur ein Mal alle 4 Sekunden gewähren.)\n(Wartezeit bis zur zweiten Aktivierung 1 Sekunde)\n(Abklingzeit startet, wenn zweite Aktivierung innerhalb von 3 Sekunden nicht eingesetzt wird.)\n1.Aktivierung: Reichweite 250\n2.Aktivierung: Reichweite 350\n10 Sekunden Abklingzeit auf allen R&auml;ngen\n25/29/33/37/41 Manakosten\n\n **_W - Auge des Vision&auml;rs_**\n\nAktiv:Darvul erh&auml;lt f&uuml;r 6 Sekunden**_absolute Sicht_** in Laufrichtung und kann versteckte _**Wards, Champions und Fallen aufdecken**_(gegnerische Champions werden camoufliert angezeigt.) Darvul kann auch au&szlig;erhalb eines Busches hineingucken und **_Wards, Champions und Fallen aufdecken_**.  W&auml;hrend **Auge des Vision&auml;rs** aktiv ist, kannst du sehen, wenn die F&auml;higkeit eines gegnerischen Champions bereit wird.\n\nPassiv: Wenn du einen Champion t&ouml;test oder innerhalb von 3 Sekunden an einer T&ouml;tung beteiligt warst, l&auml;sst er bei seinem Tod eine finstere Seele fallen. Darvul erh&auml;lt f&uuml;r jede finstere Seele 3% Z&auml;higkeit. Wenn Darvul 5 finstere Seelen gesammelt hat, wird **_Schattenwelle_** in **_Ritterschar_** umgewandelt. Jeder gegnerische Champion kann maximal 1 finstere Seele fallen lassen.\n500/750/900/1150/1400 Reichweite\n60/54/48/42/36 Sekunden Abklingzeit\n80/85/90/95/100 Manakosten\n\n**_E - Schattenwelle / Ritterschar_**\n\n**_Schattenwelle_**: Darvul feuert eine finstere Schattenwelle ab, die Gegnern **_80/110/140/170/200 ( + 70% F&auml;higkeitsst&auml;rke) ( + 2,5% deines maximalem Lebens)_** magischen Schaden zuf&uuml;gt und sie f&uuml;r 1,5 Sekunde  um 20/25/30/35/40% verlangsamt.\n\n**_Ritterschar_**: Darvul beschw&ouml;rt eine Schar aus 5 finsteren Seelen die in einer Linie alles &uuml;berrennen. Dabei erhalten Gegner **_80/110/140/170/200 ( + 70% F&auml;higkeitsst&auml;rke) ( + 2,5% deines maximalem Lebens)_** magischen Schaden und erhalten 20% des verursachten Schadens als zusätzlichen magischen Blutungsschaden. Kanalisierungen werden unterbrochen.\n\n800 Reichweite\n18/17/16/15/14 Sekunden Abklingzeit \n90/95/100/105/110 Manakosten\n**_Schattenwelle_** ovale Hitbox\n**_Schar der absoluten Finsternis_** rechteckige Hitbox\n\n**_R - Finsterer Nebel_**\n\nAktiv: Darvul beschw&ouml;rt f&uuml;r 8 Sekunden einen finsteren Nebel mit seinen finsteren Rittern (3/6/9).\nDarvul erh&auml;lt nach einer Sekunde im Nebel **10/15/20%** Lauftempo.\nGegnerische Champions, die zu tief im finsteren Nebel stehen, werden von finsteren Rittern angegriffen und erleiden jeweils **1/2/3% ( + 10% F&auml;higkeitsst&auml;rke)** magischen Schaden. Jeder Champion kann von jedem finsteren Ritter nur ein Mal pro Nebeldauer angegriffen werden. \nIm Nebel werden für die ersten 2 Sekunden die Sicht von gegnerischen Champions verringert. Gegnerische Champions k&ouml;nnen Darvul w&auml;hrend der Dauer des Nebels schlechter wahrnehmen.\nW&auml;hrend des Nebels kann die ultimative F&auml;higkeit erneut aktiviert werden.\nDarvuls nächster Angriff wird verstärkt. Darvul springt zu einem gegnerischen Champion und fügt ihm 10/20/25% ( + 1% seines maximalem Lebens) normalen Schaden zu.\n\nPassiv: Falls Darvuls Leben im finsteren Nebel unter 30% fallen, erhält er für 3 Sekunden einen Schild in Höhe von 30% seines maximalem Lebens. \n\n\n**Finsterer Nebel** 1000/1500/2000 Reichweite\n2. Aktivierung: 500 Reichweige\n160/140/120 Sekunden Abklingzeit\n100/110/120 Manakosten\n(Wirkungsbereich ist kreisf&ouml;rmig) \n---\n> **Stimme und Zitate**\n\n**Stimme**:\nDarvuls Stimme h&ouml;rt sich metallisch an, da er durch seinen Helm spricht. Der Klang der Stimme h&ouml;rt sich relativ d&uuml;ster an , sollte dennoch entschlossen und ehrenhaft r&uuml;berkommen.\n\n**Zitate**:\nAuswahl: Bringen wir die Sache in Ordnung.\nBann: Du M&auml;rtyrer! Dich finde ich noch!\n\nErste Bewegung1: Ich sp&uuml;re ihre Anwesenheit...\nErste Bewegung2: Teamarbeit mit Menschen? Ist mir neu.\nErste Bewegung3: Ich finde euch!\n\nWitz1: Ordnung ist Kontrolle, Kontrolle ist Macht, Macht ist in Ordnung.\nWitz2: Du fragst dich wie mein Volk so drauf ist? ABSOLUT... finster...\nWitz3: Dich werde ich im Auge behalten...\n\nSpruch1: Sag mir bescheid wenn du jemanden siehst, der sich wie ein M&auml;rtyrer verh&auml;lt\nSpruch2: In der absoluten Finsternis werdet ihr es lieben!\nSpruch3: Viele verdienen es in eine Chim&auml;re verwandelt zu werden.\n\nTanz: Wackelt mit dem Fu&szlig;, schnippt mit der linken Hand und nickt mit dem Kopf.\n\nLache1: Ha-ha-ha-ha-haaaaaa (verh&ouml;hnendes Lachen)\nLache2: Hm-hm, heheheh (die Art von Lachen wenn jemand stolpert und hinfliegt)\nLache3: Huhohohoahahaha (diabolisches lachen)\n\nEinsatz Q1: Schnipp-Schnapp, Beinchen ab.\nEinsatz Q2: Was? Beine immer noch dran? \nEinsatz Q3: Wenn ihr nicht knien wollt, kriecht ihr!\n\nEinsatzW1: Ich sehe dich, ich sehe was du vorhast.\nEinsatzW2: Finstere Seelen, ich wei&szlig; wo ihr seid.\n\nEinsatzR1: Kommt herbei meine Ritter!\nEinsatzR2: Jetzt werde ich dich holen!\nEinsatzR3: Deine Zeit ist abgelaufen!\n\n\n>**Synergie**\n\nNocturne: Kann vor oder nach dem finsteren Nebel die Sicht der Champions verringern, damit sie so lange wie m&ouml;glich verringerte Sicht haben.\nIvern: Iverns Büsche machen es den Gegnern noch schwerer entdeckt zu werden.\n\n\n\nChampions mit Skillshots, die eine hohe Reichweite besitzen: Darvul kann gegnerische Einheiten ausfindig machen und so ihre Position verraten, damit seine Verb&uuml;ndete auf sie feuern k&ouml;nnen\n\n>**Credits**\n\n**_Geschichte:_** Ghionova\n**_Champion-Skizze:_** Ghionova\n**_Skillset:_** Ghionova\n**_Guide:_** Ghionova\n\n\nIch hoffe sehr ihr habt dieses Konzept mit Interesse und Freude gelesen! :)\nIch w&uuml;rde mich &uuml;ber konstruktive Kritik sehr freuen, ebenso h&ouml;re ich mir auch gerne Verbesserungsvorschl&auml;ge an und nehme sie zu Herzen :D\nVielen Dank f&uuml;rs Lesen und daf&uuml;r dass ihr euch Zeit genommen habt.\n\nEuer Ghionova","replies":[{"poster":"Doenerlord","date":"2018-04-30T07:59:01.890+0000","up_votes":1,"down_votes":0,"body":"Ich fange mal mit der Geschichte an:\n\nDa hätten wir zum einen \"Geordnetes Chaos\", welches von Darvul angestrebt wird. Das erinnert mich irgendwie an ein Morgenstern-Gedicht.\nWie ging das nochmal?\n\n> _Dunkel war's, der Mond schien helle, als ein Wagen blitzeschnelle langsam um die Ecke fuhr. Drinnen saßen stehend Leute schweigend ins Gespräch vertieft..._\n\nMir ist das auch alles etwas zu \"finster\"... Wenn jedes Nomen das Attribut \"finster\" bekommt, verliert das Wort seine Wirkung.\nDann das mit dem Portal: Die Schwester reißt sich das eigene Herz heraus, damit ihre Leute nach Runeterra kommen (Märtyrer sind übrigens nicht das gleiche wie Adepten, denn sie werden erst zu Märtyrern, wenn sie für ihren Glauben sterben), aber Darvul kann das Portal einfach so benutzen um ihr zu folgen?\n\nDie Statuswerte sind okay und dein Mini-Guide ist relativ klar strukturiert und nachvollziehbar.\n\nKommen wir also zu den Fähigkeiten:\n\n> \nP - Absolut finstere Präsenz\nAlle 19 Sekunden verursacht Schnappschwert Darvulthym 5/10/15/20% zusätztlichen Schaden und heilt dich um 5/10/15/20% des verursachten Schadens. Die Abklingzeit reduziert sich pro Stufe um 0,5 Sekunden. Der zusätzliche Schaden und Heilung erhöhen sich mit jeder Fähigkeit die ihre maximale Stufe erreicht hat.\n> \nDarvuls Rüstung verstärkt sich ab Stufe 6\nWenn Darvul von einem gegnerischen Champion angegriffen wird, erhält er für die nächsten 3 Sekunden 7/17/27(+ 6% zusätzliche Rüstung / Magieresistenz). Rüstung und Magieresistenz Skaliert mit dem Level der Ult.\n\nDiese Fähigkeit erinnert schon sehr stark an Nocturnes Passive. Zwar nicht ganz so stark, da es keinen Reset für Autoattacks und keinen AoE-Schaden gibt, aber dafür gibt es ja noch den unnormalen Armor-Buff. Dieser erinnert mich an Graves alte Passive, aber ich meine mich zu erinnern, dass die nicht auchnoch mit Rüstung und MR skaliert hat. Allein der zweite Effekt ist ziemlich genau so stark wie Shyvanas Passive, aber da es ja zusätzlich noch den ersten gibt, ist mir das etwas zu viel und zu stark.\n\n> \nQ - Schnappschwert Darvulthym\n1. Aktivierung: Schwert schnappt zu und fügt Gegnern 35/65/95/125/155 (+ 55% zusätzlicher Angriffsschaden) normalen Schaden zu.\n2.Aktivierung: Schwert schnappt mit einer höheren Reichweite zu, fügt Gegnern 40/70/100/130/160 (+ 60% zusätzlicher Angriffsschaden) normalen Schaden zu und stößt alle getroffenen Einheiten in die Mitte der Klinge.\nDie Abklingzeit von Schnappschwert Darvulthym verringer sich für jeden getroffenen Gegner um 0,25 Sekunden.\n> \n1.Aktivierung: Reichweite 250\n2.Aktivierung: Reichweite 350\n10 Sekunden Abklingzeit auf allen Rängen\n25/29/33/37/41 Manakosten\n\nAlso das Schnappschwert-Prinzip an sich gefällt mir recht gut. Allerdings verstehe ich nicht so ganz, wie das hier funktionieren soll. Du hast also einfach ein mal ne Jarvan Q und bei Reaktivierung noch eine, aber kombiniert mit einer Orianna Ulti?\nAn sich ist es ja cool die Gegner zusammenzuziehen (aber auch ziemlich OP, weshalb es höhere Abklingzeit haben sollte), aber wozu zwei Aktivierungen, wenn eh nur die zweite CC verursacht? Dann würde ich eher sagen, dass du bei der ersten Aktivierung nur nach vorne stößt und mit der zweiten die Klinge zuschnappen lässt (so dass man z.B. noch ne halbe Sekunde Zeit hat um das Schwert zu repositionieren oder als Gegner: ihm auszuweichen). Auch die Unterschiedliche Reichweite der beiden Aktivierungen verstehe ich hier nicht.\nAlso diese Fähigkeit musst du auf jeden Fall nochmal überarbeiten.\n\n> \nW - Auge des Visionärs\nAktiv:Darvul erhält für 6 Sekundenabsolute Sicht in Laufrichtung und kann versteckte Wards, Champions und Fallen aufdecken. Darvul kann auch außerhalb eines Busches hineingucken und Wards, Champions und Fallen aufdecken. Während Auge des Visionärs aktiv ist, kannst du sehen, wenn die Fähigkeit eines gegnerischen Champions bereit wird.\nPassiv: Wenn du einen Champion tötest oder innerhalb von 3 Sekunden an einer Tötung beteiligt warst, lässt er bei seinem Tod eine finstere Seele fallen. Darvul erhält für jede finstere Seele 3% Zähigkeit. Wenn Darvul 5 finstere Seelen gesammelt hat, wird Schattenwelle in Schar der absoluten Finsternis umgewandelt. Jeder gegnerische Champion kann maximal 1 finstere Seele fallen lassen.\n500/750/900/1150/1400 Reichweite\n60/54/48/42/36 Sekunden Abklingzeit\n80/85/90/95/100 Manakosten\n\n6 Sekunden Truesight? o.O\nDa wird ja selbst Lee Sin neidisch. Da die Abklingzeit jedoch recht hoch ist, bin ich fast einverstanden mit der Fähigkeit. Leider trägt sie zum Gameplay nicht wirklich etwas bei, aber sie passt gut zur Geschichte und dem Aussehen.\nEine Frage hätte ich noch: Wie soll einem denn angezeigt werden, ob  Gegner jetzt irgendwelche Fähigkeiten bereit haben? Quasi mit eingeblendeten Skill-Icons über/unter dem Gegner, wo die Abklingzeiten drinnen stehen? Ich kann mir unter deiner Beschreibung so gar nichts vorstellen. An sich aber eine nette Idee.\n\n> \nE - Schattenwelle / Schar der absoluten Finsternis\nSchattenwelle: Darvul feuert eine finstere Schattenwelle ab, die Gegnern 80/110/140/170/200 ( + 70% Fähigkeitsstärke) ( + 2,5% deines maximalem Lebens) magischen Schaden zufügt und sie für 1,5 Sekunde um 20/25/30/35/40% verlangsamt.\n> \nSchar der absoluten Finsternis: Darvul beschwört eine Schar aus 5 finsteren Seelen die in einer Linie alles überrennen. Dabei erhalten Gegner 80/110/140/170/200 ( + 70% Fähigkeitsstärke) ( + 2,5% deines maximalem Lebens) magischen Schaden und werden für 1,5 Sekunden in Furcht versetzt.\nWenn ein gegnerischer Champion getroffen wird, erhält Darvul einen Schild in Höhe von 50/70/90/110/130 ( + 8% seines maximalem Lebens), der 2,5 Sekunden bestehen bleibt.\n800 Reichweite\n18/17/16/15/14 Sekunden Abklingzeit\n90/95/100/105/110 Manakosten\nSchattenwelle ovale Hitbox\nSchar der absoluten Finsternis rechteckige Hitbox\n\nSchattenwelle: Okay, zwar wieder ein bisschen arg \"Finsternis\"-lastig und ich verstehe die AP- und HP-Skalierungen nicht, aber zumindest eine relativ vernünftige Fähigkeit mit ordentlich Utility.\nWas ist hier mit \"ovale Hitbox\" gemeint? fängt bei dir ganz schmal an, wird in der Mitte dicker und zum Ende hin wieder schmal?\n\nSchar der ...naja wie immer...:\n1,5 Sekunden Fear sind schon an sich echt stark. Vergleichen wir das mal mit Fiddles Q:\n\n> Flößt einer gegnerischen Einheit Furcht ein, sodass diese 1.25/1.5/1.75/2/2.25 Sekunden lang in Panik vor Fiddlesticks flieht.\n\nAuf **einen** Gegner in max. 575 Reichweite...\nEin AoE Fear mit 800 Reichweite, der auch noch üppigen (mit HP skalierenden???) Schaden ballert ist definitiv zu stark.\nUnd das Schild ist komplett überflüssig. Du fearst deine Gegner doch schon, hast also eh maximal eine Sekunde lang was von dem Schild. Außerdem sind 8% HP-Scaling für einen kleinen Bonusschild schon ziemlich happig. Bei 2000 Leben sind das immerhin schon 160 Schild zusätzlich zu dem Grundwert. Und warum muss die Fähigkeit nach 5 Kills so viel mehr können? Der Fear reicht doch völlig. Als Gegner von Darvul würde es mich schon ziemlich nerven, dass er auf einmal so op wird, wenn er 5 Kills bekommen hat.\nAußerdem bin ich sowieso der Meinung, dass ein einzelner Skill in sich nicht zu überladen sein und erst in Verbindung mit den anderen Skills sein ganzes Potential zeigen sollte.\nAber stell dir den mal in Verbindung mit der Q vor:\nErstmal Displace für alle Getroffenen (gehen wir mal so von 0,5 Sek CC dadurch aus) und anschließend einen zu 100% treffenden AoE Fear, der 1,5 Sekunden lang das gesamte Gegnerteam lahm legt, deftiv Schaden reinballert und dir auchnoch einen Schild gibt, für den Fall, dass jemand QSS benutzt.\nAlles muss irgendwie counterbar sein, aber das hier ist es leider nicht.\n\n> \nR - Finsterer Nebel\nDarvul beschwört für 8 Sekunden einen finsteren Nebel mit seinen finsteren Rittern (3/6/9).\nDarvul erhält nach einer Sekunde im Nebel 10/15/20% Lauftempo und 20/25/30% zusätzliche Abklingzeitverringerung auf Schnappschwert Darvulthym\nGegnerische Champions, die zu tief im finsteren Nebel stehen, werden von finsteren Rittern angegriffen und erleiden jeweils 1/2/3% ( + 10% Fähigkeitsstärke) magischen Schaden. Jeder Champion kann von jedem finsteren Ritter nur ein Mal pro Nebeldauer angegriffen werden.\nIm Nebel wird die Sicht von gegnerischen Champions verringert. Je mehr verbündete Champions drin stehen, desto schneller erhalten Gegner ihre volle Sicht zurück. (1.5 Sekunden pro verbündeten Champion) Gegnerische Champions können Darvul während der Dauer des Nebels schlechter wahrnehmen.\nWährend des Nebels kann die ultimative Fähigkeit erneut aktiviert werden.\nDarvul springt in ein Gebiet und schlägt dabei mit dem Schwert auf den Boden. Getroffene Gegner werden hochgeworfen und erhalten 15/20/25% ihres aktuellem Lebens normalen Schaden.\n> \nFinsterer Nebel 1000/1500/2000 Reichweite\n\\2. Aktivierung: 500 Reichweige\n160/140/120 Sekunden Abklingzeit\n100/110/120 Manakosten\n(Wirkungsbereich ist kreisförmig)\n\nAlso in etwa eine Nocturne Ulti, nur dass die Reaktivierung ein Galio-Ult-mäßiger Leap ist und kein Dash.\nHier noch eine Auflistung von allem, was unklar ist:\n\n- Was heißt \"zu tief im Nebel stehen\"? Gerade Trigger musst du deutlich präziser beschreiben.\n- Schaden: 1/2/3% ( + 10% Fähigkeitsstärke) wovon?\n- \"Im Nebel wird die Sicht von gegnerischen Champions verringert\", aber um wieviel und in welchem Ausmaß? Einfach Nearsight oder tatsächlich eine Verringerung der Sichtweite um XYZ GDU (wie bei Rek'Sai)?\n- \"Gegnerische Champions können Darvul während der Dauer des Nebels schlechter wahrnehmen\"???\n- Wie lange soll das ganze halten?\n- Was hat der Leap für eine Reisegeschwindigkeit? Instant-Cast wäre schon arg heftig, da du ja massig CC verteilst... und auch noch gut Schaden drückst.\n\nAlso mit dem Skillset bin ich echt nicht so zufrieden, das könnte man deutlich besser machen und ich hoffe du setzt dich nochmal dran ;)\n\nDann noch das Aussehen:\nIch finde es klasse, dass du dir die Arbeit gemacht und ein Bild gemalt hast. So hat man einen ziemlich genauen Eindruck davon, wie der Champion aussehen soll. Wie Aatrox. Schade eigentlich, weil ich ja sehe, dass du recht gut malen kannst.\n\nAlles in allem finde ich das Konzept etwas zu finsternis-mainstream-mäßig und gerade in der Story tauchen mir zu viele Ungereimtheiten auf.","replies":[{"poster":"Ghionova","date":"2018-04-30T08:45:07.725+0000","up_votes":1,"down_votes":0,"body":"Fähigkeiten gerade überarbeitet :D","replies":[{"poster":"Doenerlord","date":"2018-05-02T10:38:15.648+0000","up_votes":1,"down_votes":0,"body":"Also nochmal von vorne...\n\n- Bei der Q verstehe ich den Sinn der ersten Aktivierung nicht. Verlangsamt nur das Gameplay und verhindert improvisierte Sofortangriffe.\n- Die Manakosten bei der Q sind für einen CC Skill mit Doppelcast und hohem Schaden sehr gering\n- Wie soll man bei der W denn sehen bzw. wie soll es einem angezeigt werden, \"wenn die Fähigkeit eines gegnerischen Champions bereit wird\"?!\n- Gibt es keine Obergrenze für den Zähigkeitsbonus?\n- Warum macht du das mit den Seelen nicht einfach zur passiven, anstatt ständig Referenzen zwischen den Skills zu ziehen?\n- Wie breit sind die Hitboxen bi der E? 800x???\n- Warum sollen die Gegner nur die ersten zwei Sekunden vom Nebel verringerte Sicht haben?\n- Warum hat die Ulti einen MS-Buff UND einen Leap?? Absolut unsinnig.\n- Bei der Ulti: \"1/2/3% ( + 10% Fähigkeitsstärke) magischen Schaden\" **wovon??** Und wie kann man das AP-Scaling verstehen? +1% bei 10 AP?\n- \"Darvuls nächster Angriff wird verstärkt\" - inwiefern? Bonusschaden? OnHit Effekte? Beschreibe das genauer!\n- \"10/20/25% ( + 1% seines maximalem Lebens) normalen Schaden\" **WOVON???** Ich verstehe hier: Schaden in Höhe von 1% Darvuls Leben + 10/20/25% von wasauchimmer... Außerdem ist das Scaling auf Level 3 kleiner als auf Level 2, was immer blöd ist.\n- Warum sollte der Nebel auch noch einen Schild generieren? Du brauchst ihn nicht, weil dich eh keiner sehen kann und du auchnoch rumhüpfen kannst und erhöhtes Lauftempo hast. Mach keine Skills, die alles können und nicht counterbar sind!\n\nGruß,\nDoenerlord","replies":[]}]},{"poster":"Ghionova","date":"2018-04-30T11:34:44.762+0000","up_votes":1,"down_votes":0,"body":"Geschichte habe ich überarbeitet. :) Vielleicht kommt das besser an :D","replies":[]},{"poster":"Ghionova","date":"2018-04-30T08:59:44.222+0000","up_votes":1,"down_votes":0,"body":"Hey, \n\n> Mir ist das auch alles etwas zu \"finster\"... Wenn jedes Nomen das Attribut \"finster\" bekommt, verliert das Wort seine Wirkung.\nDann das mit dem Portal: Die Schwester reißt sich das eigene Herz heraus, damit ihre Leute nach Runeterra kommen (Märtyrer sind übrigens nicht das gleiche wie Adepten, denn sie werden erst zu Märtyrern, wenn sie für ihren Glauben sterben), aber Darvul kann das Portal einfach so benutzen um ihr zu folgen?\n\nBeim ersten Satz hast du recht :/ Haha hab die Namen der Fähigkeiten geändert. \nDas mit den Märtyrern wurde mir so beigebracht, werde ich in der Geschichte ändern.\nDarvul hat das Herz von seiner Schwester. Seit tausenden Jahren jagt er die Seelen und wird somit immer mächtiger. Er ist momentan (in der Gegenwart so wie er gespielt werden soll) nur in der Lage ganz gering durch die Macht seines Auges eine Raumverzerrung zu erzeugen. \nEr entzog die Kräfte aus der Seele seiner Schwester und jetzt ist sie eine ganz gewöhnliche Seele. Sie ist also nicht geflohen.\n\n>  und gerade in der Story tauchen mir zu viele Ungereimtheiten auf.\n\nDa bin ich mir nicht sicher was genau du meinst.","replies":[]}]},{"poster":"INoKami","date":"2018-04-29T15:17:19.668+0000","up_votes":1,"down_votes":0,"body":"Bevor du uns wieder ankommst, mach ich schon mal jetzt meine Bewertung!\n(Bitte nicht ernst nehmen, so bin ich halt^^)\n\n**Aussehen:** Also wenn ich so zeichnen könnte, wäre ich ja schon zufrieden xD\nNichts außergewöhnliches, aber auch nicht wirklich schlecht. Lassen wir so stehen.\n**Charakter:** ...Klingt hart, aber braucht keiner. Mit einigen guten Quotes kann man auch gut (genug) einen Charakter darstellen... (mehr dazu unten)\n\n**Lore:**\n...\nSchwierig. Gerade weil sie so wenig mit Runterra/der Liga zu tun hat, fällt es mir irgendwie schwer, sie als gut zu bewerten. Er hat sich irgendwann einfach mal dazu entschieden, hier einen Hausbesuch zu machen, einfach auf bloßen Verdacht... gut, so eine Lore findet sich auch in meiner Sammlung (Varla, aber nur die englische (bzw. gereworkte) Variante), aber sie hat wenigstens ein fest definiertes Ziel und nicht irgendwelche Vermutungen.\n\nOder stell ich mich schon wieder an?\n\n**Zusatzinformationen:** Nett gemeint, aber was sollen die uns bringen? In der Lore erfährt man ja noch zumindest, wer der Champ ist und was seine Motivationen sind, die Zusatzinfos sind fast zu viel des Guten.\n\n**Texte:** Ich nehme es schon mal vorweg: Wenn man die Lore und seine Fähigkeiten bedenkt... kann man die Quotes einfach nicht ernst nehmen. Dafür sind einfach zu viele Zeilen zu humorvoll für einen dunklen Charakter.\n\nHat jemand Fähigkeiten gesagt? Also dann, auf ins Getümmel!\n\n**\nDie Passive:** Hat ein bisschen was Snydra-haftes (Fähigkeiten-Verstärkung, wenn eine Fähigkeit auf maximaler Stufe ist)... na ja. Nicht sonderlich kreativ, eine 08/15-Passive.\nDer andere Teil: Wenn der Effekt schon mit der Ult (und nur mit der Ult) skaliert, wieso packst du sie dann nicht direkt auf die Ult?\n> erhält er für die nächsten 3 Sekunden 7/17/27(...). Skaliert mit dem Level der Ult.\n\nUnd was erhält er schönes?\n\n**\nDie Q:** Die Reichweite ist aber schon SEHR gering. Ebenso wie die Manakosten.\nDer CD-Reset hingegen ist übertrieben. Bei nur 10 Sek Basis-CD. Bei den Raptoren (6 Gegner) gibt es pro Aktivierung 3 Sekunden zurück, also 6 Sekunden gesamt, bei 40% CDR also ein direkter Reset.\n\n**\nDie W:** Der Effekt ist schon sehr stark. Champions wie Shaco, Twitch, Evelynn, Akali und co. werden weinen.\nUnd welche Fähigkeiten kann er damit \"aufdecken\"? Und wieso habe ich schon länger ein Konzept mit eben dieser Fähigkeit? (Mal ehrlich... gibt es überhaupt eine Mechanik, die bei mir noch nicht vorkam? xD)\nUnd hier wieder auch: eine Passive, die die E verstärkt... wieso ist dann dieser Effekt nicht auf der entsprechenden Fähigkeit? Das macht einfach keinen Sinn!\n\n**\nDie E:** Schattenwelle ist ok.\nSdaF ist eine Heca-Ult ohne den Dash, dafür mit einer Vlad-Ult, die nicht direkt heilt, aber einen entsprechenden Schild gibt. Viel zu stark.\n\n**\nDie R:** Hat gerade jemand gesagt \"Heca-Ult ohne den Dash\"? Tja, hier haben wir ihn...\nDie Fähigkeit ist viel zu überladen. Movespeed, ein Aoe-Effekt, der nicht wenig Schaden macht (wie groß ist die Wolke?), noch mehr CDR für die Q, weil die ja nicht schon stark genug ist, Kurzsichtigkeit für alle, und eine Malph-Ult, die Reichweite für Schaden eintauscht, der an die alte Eve-Ult erinnert (was für einen Engage echt nicht wenig ist).\n\nUnd zum Finale:\n**Die wichtigste Frage:** Auf die Gefahr hin, dass ich mich wiederhole: Wieso haben deine Fähigkeiten passive Effekte, die andere Fähigkeiten verstärken, aber nicht die, auf der sie platziert sind? Das ist einfach sinnfrei und unüberlegt...\n\n**\nDas Fazit:** Können wir heute eigentlich recht schnell abhandeln: Das Kit passt zum Thema, Aussehen und Lore sind ok, aber die Fähigkeiten sind meist zu stark und so toll es auch ist, zu sehen, wie viel Mühe man sich mit dem Konzept gibt, ist einiges davon einfach zu viel und trägt fast nichts konstruktives zum Konzept selber bei.  Macht zusammengerechnet **4/10 Punkte**.\n\nAlso dann, schauen wir mal, wie sich das entwickelt. Ich bin ja eh immer hier anzutreffen^^\n\nMfG\n\nIncaedeus\n{{sticker:galio-happy}} \n_Leidenschaftlicher Galio-Main_","replies":[{"poster":"Ghionova","date":"2018-04-30T08:21:10.256+0000","up_votes":1,"down_votes":0,"body":"Hey, kommen wir gleich zur Sache!\n\n> Schwierig. Gerade weil sie so wenig mit Runterra/der Liga zu tun hat, fällt es mir irgendwie schwer, sie als gut zu bewerten.\n\nWie in der Geschichte beschrieben, gab es 2 rivalisierende Parteien, die einer dient dem Chaos und der Zerstörung, die andere der Ordnung und Kontrolle. Da Imuriela ihre Saat in die andere Welt befreit hat und sie sich so vermehrt haben, hat es eine extrem große Auswirkung auf Runeterra, da jeder Märtyrer, jeder Psychopath o.ä. von Imurielas finsteren Seelen betroffen ist/sein kann. Imurielas finstere Seelen sind somit der Auslöser der totalen Zerstörung.\n\n> Er hat sich irgendwann einfach mal dazu entschieden, hier einen Hausbesuch zu machen, einfach auf bloßen Verdacht...\n\nEr hatte keine andere Wahl, da er Imurielas Seelen zurückholen muss, damit seine eigene Welt bestehen bleibt.\n\n\n>  gut, so eine Lore findet sich auch in meiner Sammlung (Varla, aber nur die englische (bzw. gereworkte) Variante)\n\nKeine Ahnung, habe mir deine Geschichte nicht durchgelesen, geschweige denn etwas von diesem Konzept gehört.\n\n> Zusatzinformationen: Nett gemeint, aber was sollen die uns bringen? In der Lore erfährt man ja noch zumindest, wer der Champ ist und was seine Motivationen sind, die Zusatzinfos sind fast zu viel des Guten.\n\nSollten eine Anregung für Teaser sein, die mit einbezogen werden könnten.\n\n> Texte: Ich nehme es schon mal vorweg: Wenn man die Lore und seine Fähigkeiten bedenkt... kann man die Quotes einfach nicht ernst nehmen. Dafür sind einfach zu viele Zeilen zu humorvoll für einen dunklen Charakter.\n\nDa brauche ich eine Erläuterung, da ich nicht genau weiß was du meinst. Bei mir kommt das so rüber als würdest du ihn auf Shaco-Basis stellen.\n---\nFähigkeiten Buffs werde ich bearbeiten.\n\n> Die Passive: Hat ein bisschen was Snydra-haftes (Fähigkeiten-Verstärkung, wenn eine Fähigkeit auf maximaler Stufe ist)... na ja. Nicht sonderlich kreativ, eine 08/15-Passive.\nDer andere Teil: Wenn der Effekt schon mit der Ult (und nur mit der Ult) skaliert, wieso packst du sie dann nicht direkt auf die Ult?\n\nDa eigentlich nur Syndra eine Passive besitzt, die bei der Maximierung einer Fähigkeit einen Buff gewährt, ist sie in meinen Augen nicht 0815. Dennoch finde ich eine Alternative für Darvuls Passiv.\n---\n> Q: Bei nur 10 Sek Basis-CD. Bei den Raptoren (6 Gegner) gibt es pro Aktivierung 3 Sekunden zurück, also 6 Sekunden gesamt, bei 40% CDR also ein direkter Reset.\n\nDa hast du dich verlesen, es sind 0,25 Sekunden und dann auch nur 1,5 Sekunden.\n\n> W: Der Effekt ist schon sehr stark. Champions wie Shaco, Twitch, Evelynn, Akali und co. werden weinen.\n\nDa stimme ich schon zu, ich werde es in camouflieren ändern, sodass sie sichtbar sind, aber nicht angreifbar für normale Angriffe.\n\n> W: Und welche Fähigkeiten kann er damit \"aufdecken\"?\n\nFähigkeiten die bei gegnerischen Champions aktiv wird.\n\n> W: (Mal ehrlich... gibt es überhaupt eine Mechanik, die bei mir noch nicht vorkam? xD)\n\nWie gesagt, keine Ahnung, ich lese selten Champion-Konzepte.\n\n\n> W: Und hier wieder auch: eine Passive, die die E verstärkt... wieso ist dann dieser Effekt nicht auf der entsprechenden Fähigkeit? Das macht einfach keinen Sinn!\n\nEs macht Sinn, weil _**das Auge**_ die absolute Finsternis formen kann. In dem Fall hat er mehr Macht je mehr finstere Seelen er gesammelt hat, welche seine Kraft verstärken. Deshalb ist der Buff in der W - Auge des Visionärs, weil das Auge den Einfluss auf seine finsteren Ritter hat.\n\n> E: SdaF ist eine Heca-Ult ohne den Dash, dafür mit einer Vlad-Ult, die nicht direkt heilt, aber einen entsprechenden Schild gibt. Viel zu stark.\n\nFurcht wird durch Blutungsschaden und Unterbrechung von Kanalisierung ersetzt. Schild wird auf die Ult übertragen.\n\n> Die R: Hat gerade jemand gesagt \"Heca-Ult ohne den Dash\"? Tja, hier haben wir ihn...\nDie Fähigkeit ist viel zu überladen. Movespeed, ein Aoe-Effekt, der nicht wenig Schaden macht (wie groß ist die Wolke?), noch mehr CDR für die Q, weil die ja nicht schon stark genug ist, Kurzsichtigkeit für alle, und eine Malph-Ult, die Reichweite für Schaden eintauscht, der an die alte Eve-Ult erinnert (was für einen Engage echt nicht wenig ist).\n\nIn der Champion-Skizze unten links ist ein Bild von Darvuls Ult zu sehen, die X-Markierungen sind finstere Ritter. Kommt ein gegnerischer Champ zu nahe, wird er von ihm angegriffen (max. 1x)\n\nBuffs werden bearbeitet. Der verringerte Sicht hält jetzt nur in den ersten 2 Sekunden an.  Zusätzliche Q Abklingzeit wird entfernt (hätte ich drei Mal lesen sollen haha) Der Sprung und das Hochschlagen werden durch einen normalen Angriff, der % Schaden zufügt und den Gegner betäubt, ersetzt.\n\nIch konnte hoffentlich alle Fragen beantworten :D\n\nMfG\n\nGhionova","replies":[{"poster":"INoKami","date":"2018-04-30T15:39:56.195+0000","up_votes":1,"down_votes":0,"body":"So, da bin ich wieder:\n\n* Ich glaube, die Diskussion über die Lore würde sich auf kurz oder lang festfahren, also lassen wir es einfach.\n* Wie, du liest keine Konzepte von anderen?! Verschwinde aus meinen Augen, du Unhold!\n* Irgendwie ist der Vergleich mit Shaco erschreckend passend...\n* Das 08/15 auf der Passiven war auf den Bonusschlag bezogen, nicht auf die Snydra-Komponente.\n* Was... 0,25 Sekunden? Entweder habe ich mich verlesen oder du hast es heimlich geändert und willst es nicht zugeben :*\n* Furcht wird durch andere Effekte ersetzt? Wäre mir neu...\n* Bei der Ult hast du einfach an meiner Kritik/meinen Fragen vorbeigeredet und hast irgendwas wiederholt, was selbst erklärend ist und auch nicht Teil meiner Anmerkungen war. Wie hast du das geschafft?^^\n\nUnd mit diesen Worten verziehe ich mich wieder und warte auf deine Reaktion :)","replies":[{"poster":"Ghionova","date":"2018-04-30T16:36:31.971+0000","up_votes":1,"down_votes":0,"body":"> * \n> Wie, du liest keine Konzepte von anderen?! Verschwinde aus meinen Augen, du Unhold!\n\nBin mir ziemlich sicher das Wort \"selten\" erwähnt zu haben.\n\n> *  Was... 0,25 Sekunden? Entweder habe ich mich verlesen oder du hast es heimlich geändert und willst es nicht zugeben :*\n\nNein du hast dich verlesen. Wenn ich einen Fehler mache, dann stehe ich dazu.\n\n> * Furcht wird durch andere Effekte ersetzt? Wäre mir neu...\n\nSteht nichts mehr über einen Furcht-Effekt in der Fähigkeit.\nRitterschar: Darvul beschwört eine Schar aus 5 finsteren Seelen die in einer Linie alles überrennen. Dabei erhalten Gegner 80/110/140/170/200 ( + 70% Fähigkeitsstärke) ( + 2,5% deines maximalem Lebens) magischen Schaden und erhalten 20% des verursachten Schadens als zusätzlichen magischen Blutungsschaden. Kanalisierungen werden unterbrochen.\n\n> * Bei der Ult hast du einfach an meiner Kritik/meinen Fragen vorbeigeredet und hast irgendwas wiederholt, was selbst erklärend ist und auch nicht Teil meiner Anmerkungen war. Wie hast du das geschafft?^^\n\nWas war denn dann deine Frage?","replies":[{"poster":"INoKami","date":"2018-04-30T17:06:26.562+0000","up_votes":1,"down_votes":0,"body":"* Selten ist mir zu selten.\nHach, was ein Wortspiel^^\n\n* Ja, mittlerweile ist der Fear weg. Doenerlord hat noch die unbearbeitete Variante kopiert und in der ist definitiv ein Fear vorhanden.\n\n* Ich hab gemeint, dass die Ult insgesamt zu überladen ist und statt darauf einzugehen (gut, mittlerweile hat sich da was getan), erklärst du mir, wie die Ritter im Nebel funktioniert... und wie groß der Nebel ist, weiß ich immer noch nicht.","replies":[{"poster":"Ghionova","date":"2018-04-30T17:26:33.973+0000","up_votes":1,"down_votes":0,"body":"> * Ja, mittlerweile ist der Fear weg. Doenerlord hat noch die unbearbeitete Variante kopiert und in der ist definitiv ein Fear vorhanden.\n\nAchso. :D\n\n> * Ich hab gemeint, dass die Ult insgesamt zu überladen ist und statt darauf einzugehen (gut, mittlerweile hat sich da was getan), erklärst du mir, wie die Ritter im Nebel funktioniert... und wie groß der Nebel ist, weiß ich immer noch nicht.\n\nDie ist mittlerweile auch überarbeitet wie du gesehen hast. Achja unten bei der Abklingzeit, Manakosten steht die Reichweite. Wenn er sie aktiviert ist es die Anzahl von Einheiten die sich von ihm aus entfernen.","replies":[]}]}]}]}]}]}]}