{"poster":"Reidlak","date":"2015-06-24T19:15:51.810+0000","title":"Sistema de ranked","subforum":"Charlas Generales","up_votes":2,"down_votes":2,"body":"Todo el mundo se queja de los trolls, de los AFK, de los \"Ni&ntilde;os rata\". Es seguramente m&aacute;s tratado en este foro. Mi pregunta es: &iquest;Es culpa del juego o de la comunidad? Obviamente \r\n** La comunidad es as&iacute; y no hay forma de arreglarla.**\r\nDe ah&iacute; sale mi duda, &iquest;Por qu&eacute; Riot se esfuerza tanto en intentar mejorar la comunidad (Que me parece perfecto) y** no en hacer un sistema para mejorar una gran parte de esto?**\r\nYo opino que los llamados trolls o ni&ntilde;os ratas son cosas que no se pueden borrar del juego, y lo que hace Riot es todo lo que puede hacer (Suponiendo que se agregue el tribunal inmediatamente) pero; &iquest;y los **AFK?**\r\nTener un AFK en tu team puede significar una derrota casi instant&aacute;nea (Pasar de estar adelante a perder muy r&aacute;pidamente), y aunque este sea** baneado, no arregla las cosas**\r\nDesde ac&aacute; sale mi bronca y me encantar&iacute;a si alg&uacute;n Rioter la pudiera resolver:\r\n**&iquest;Porque pierdo la misma cantidad de LP con un AFK?**\r\nPara el sistema, perder es lo mismo, no importa si tuve un jugador menos toda la partida o no.\r\n**Obviamente no se puede hacer que al tener un AFK, perder no signifique nada. Pero que signifique lo mismo tener AFK&#039;s a tener un equipo completo me parece completamente incorrecto.** Obviamente que este jugador se halla ido de la partida por un tiempo considerable, no 1 o 2 minutos (que tambien puede significar mucho en una partida)\r\nYo no soy la &uacute;nica persona que piensa igual en mi grupo de amigos. Me gustar&iacute;a conocer la opini&oacute;n de un Rioter, las ventajas y desventajas que conlleva esto.\r\nMuchas gracias y si pueden comenten su opini&oacute;n, sea quien sea!","replies":[{"poster":"racsus","date":"2015-06-24T19:20:10.497+0000","up_votes":1,"down_votes":0,"body":"Me parece que es una idea bastante interesante y a la vez justa, en cierta medida, si se establecen condiciones suficientes para aplicarla.\nSin embargo me salta la duda inmediatamente a la cabeza, de que siento que debe ser extremadamente dificil llevarla a cabo, y¿ como establecer las condiciones justa para que no haya un aprovechamiento de este metodo?  seria interesante que un rioter de su opinion pero seria una idea que habria que trabajar mucho :)","replies":[{"poster":"Reidlak","date":"2015-06-24T19:23:07.553+0000","up_votes":2,"down_votes":0,"body":"Claramente, para que funcione este método, el sistema de bans por abandono de partida debería ser mucho más estricto. Por eso mismo quiero saber la opinión de algún miembro del Staff :)","replies":[]}]},{"poster":"Reformed Ramona","date":"2015-07-06T03:55:39.950+0000","up_votes":1,"down_votes":0,"body":"En el caso de los afk' la idea seria q la partida lo considere y quite... muchisimo menos, estaria bueno eso. (como que vuelva el tribunal)\n\nEn el caso de trolls y esas cosas... tener un margen de \"quiteos\" poder quitear.. 1 partida especificando el porque... sin demora alguna ni perdida de lp, obviamente q despues del 3er quiteo quite lp y agrege tiempo de margen antes de poder reingresar. \nOjo, si te toca 3 veces el mismo trol es porque sos un bolu! si sabes que viene mal la cola no te metas... y si las cartas se dan que justamente, miticamente tenes 3 trolls en los 3 intentos, bueno. Mala suerte, garpa perder 8 antes q 16... (y yo que gano 28 )","replies":[{"poster":"Reidlak","date":"2015-07-06T19:44:33.041+0000","up_votes":1,"down_votes":0,"body":"Obviamente, Que el que se fue AFK pierda la cantidad completa de LP y que tengan un sistema de bans más estricto. Con los jugadores antideportivos no hay nada que hacer. De paso dejo uno que recién tuve el \"Placer\" de ver http://boards.las.leagueoflegends.com/es/c/comportamiento-del-jugador/a0Hy8aAT-comportamiento-antideportivo-de-xamax123","replies":[]}]},{"poster":"BsK AbbyZ","date":"2015-07-06T18:57:55.421+0000","up_votes":1,"down_votes":0,"body":"timo wn","replies":[{"poster":"BsK AbbyZ","date":"2015-07-06T18:58:24.574+0000","up_votes":1,"down_votes":0,"body":"viva teemo wn\n{{champion:22}}","replies":[]}]}]}