{"poster":"Viddyn","date":"2017-04-24T11:49:51.214+0000","title":"Mate f端r DuoQ gesucht. Akteull S5","subforum":"Clans & Teams","up_votes":1,"down_votes":4,"body":"Gr&uuml;&szlig;e euch,\r\n\r\nmein Name ist Viddyn und ich spiele schon seit nunmehr fast vier Jahren LoL. In dieser Zeit habe ich s&auml;mtliche lanes und Rollen ausprobiert und bin auf der midlane stecken geblieben. W&auml;re also super, wenn ihr kein Interesse an besagter lane besitzen w&uuml;rdet ;-)\r\n\r\nIn all meinen Spielen habe ich - wie sicher viele von euch, nach relativ guten Spielen diverse Leute zwecks DuoQ aus gerade absolvierten Spielen geaddet. Was anfangs nach einer guten l&ouml;sung erschien, hat sich relativ schnell als ziemlich ern&uuml;chernd erwiesen - waren es doch meist ungeduldige und sich schnell in der Wortwahl verh&auml;tschelnde Spieler die keinerlei selbstrefelxion oder gar Motivation besitzen.  Daher meine Bitte, meldet euch doch nur, wenn ihr &uuml;ber 18 und eine Menge Geduld und &quot;losefest&quot; seid, sowie eine gewisse geistige Reife besitzt. Gerne w&uuml;rde ich mich mit euch zusammen auf den Weg in die h&ouml;heren Elos begeben. Aber dieser Weg wird lang und ziemlich oft frustrierend sein, aber der Spa&szlig; am Spiel sollte nicht verloren gehen. Da ich im realen Leben im Schichtdienst arbeite, bitte ich zudem um Verst&auml;ndniss, dass ich nicht 24/7 spielen kann.\r\n\r\nAlso gut, hier nocheinmal die Zusammenfassung was ihr - sofern ihr Interesse habt mitbringen solltet:\r\n\r\n- Alter &uuml; 18+\r\n- Kein Midlaner (h&ouml;chstens sec)\r\n- Spa&szlig; am Spiel besitzen und motiviert sein\r\n- Ts3 tauglich\r\n- Runen sowie Masteryfest sein \r\n- Mindestens Silber 5 sein\r\n\r\nW&uuml;rde mich &uuml;ber zahlreiche Anfragen freuen\r\n\r\nViddyn","replies":[{"poster":"eRoxTX","date":"2017-04-24T23:16:41.354+0000","up_votes":1,"down_votes":0,"body":"_Online! Suche Spielerpool f端r (5)FlexQ / Ranked Teams! - \"eRoxTX\" - Kayle\n_\n\nDu bist interessiert an einer organisierten League of Legends Community mit Guides, Tipps  und spontanen/fixierten FlexQ/SoloQ Gruppen? Du f端hlst dich angesprochen auf diese Einladung?\n\n> Evening Coaching (5) LoL FlexQ - EuW\n> Date: 23.04.2017\n> Start: ~20:00-00.00\n> Voice: Discord/Teamspeak\n> Searching: JNG, MID, ADC, SUP\n> @everyone - \"eRoxTX\" Kayle ./W me\n\nJoin meinem Discord Server f端r weitere Informationen!\nLink: https://discord.gg/hm2Hhd3\nVielen Dank!\n\neRoxTX - Kayle/Annie","replies":[]}]}