{"poster":"Konnor Bleau","date":"2017-07-16T06:26:46.401+0000","title":"Come funziona lo smite?","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Sto cominciando ora a giocare jng, ma non capisco in che modo devo usare lo smite, so che posso usarlo seui champ, ma non fa danno, poi cambia colore, devo usarlo quando sto morendo in jng contro i mob no? Che significano i vari colori? &egrave; possibile usarlo per killare i champ?","replies":[{"poster":"HaIIeIujah","date":"2017-07-16T08:54:41.454+0000","up_votes":4,"down_votes":0,"body":"Allora, calma e sangue freddo.\n\n{{summoner:11}} , nella sua forma base, funziona solo sui mostri e solo sui mostri grossi. I due buff, i mostri più grossi di ogni campo ed ovviamente drago , baron e Rift Herald. Infligge danni ai mostri e ti cura di una percentuale della vita mancante, quindi va usato principalemtne per accelerare il tuo clear in jungla e per il sustain.\n\nComprando  {{item:3715}} {{item:3706}}  e le loro versioni potenziate lo Smite cambia colore.\n\nBlue Smite può essere usato sui campioni per una piccola botta di true damage e, cosa più importante, rubareu na partedella loro movement speed.\n\nRed Smite invece \"marchia\" un campione. Il marchio di suo non fa niente finché non lo autoattacchi: a quel punto infligge danno puro bonus nel tempo e riduce i danni che subisci da quel campione del 20% per 3 secondi, refreshandosi ad ogni autoattacco.","replies":[]},{"poster":"Ser Nalor","date":"2017-07-16T12:04:13.442+0000","up_votes":1,"down_votes":0,"body":"ti consiglio di seguire anche qualche guida su youtube/twitch di persone che giocano giungla e che spiegano il gameplay di quello che fanno per massimizzare l'uso dello smite e in quali situazioni va bene il blu piuttosto che il rosso e via discorrendo.\n\na tal proposito, sto seguendo più o meno il redbull factions e vedo che nei team organizzati competitivi si sceglie {{item:3711}} la maggior parte dei casi.\ncredo sia per un maggiore controllo della giungla e degli obiettivi.\nma se avete delucidazioni in merito, ne sarei contento non intendendomi molto di giungla xD","replies":[]},{"poster":"fedy99","date":"2017-07-16T08:51:01.922+0000","up_votes":1,"down_votes":0,"body":"Allora lo smite lo puoi usare i mostri grandi e quelli epici(baron elder drakes).Per i mostri epici ti consiglio di usarlo quando al mostro manca esattamente la quantità di smite necessaria per ucciderlo(cioè se il tuo smite fa 1000 e il mostro ha epico ha 1000 o meno lo usi e così te lo assicuri evitando che altri te  lo rubino).Invece sui campetti in giungla dovresti usarlo con quantità uguali o superiori al danno dello smite,cosi da sfruttare ogni singolo danno che soprattutto in early è essenziale, poi i campetti puoi anche farli senza lo smite.Puoi anche smitare i minions ma è INUTILE,certa gente in low elo lo fa quando ganka e la kill la prendi tu invece che lui.Lo smite lo puoi usare sui campioni solo se è blu o rosso.Quello blu ruba un po' di velocità all'avversario su cui lo hai usato e fa danni puri irrisori(tipo massimo 60,non ricordo bene,comunque sono pochi),quello rosso invece ti permette di subire meno danni da quello su cui lo hai usato e allo stesso tempo una parte dei tuoi danni si trasformerà in danni puri","replies":[]},{"poster":"schodlees","date":"2017-07-16T14:51:00.320+0000","up_votes":1,"down_votes":2,"body":"Troppo complicato studiarsi le spell","replies":[]}]}