{"poster":"jaiblitz","date":"2017-09-02T15:46:13.251+0000","title":"los baneos de 15 dias sin explicacion","subforum":"Jugabilidad, balance y narrativa","up_votes":2,"down_votes":7,"body":"yo pienso que por que antes de banear a un jugador no se dan el tiempo de revisar lo que realmente paso en la partida , osea como se van a demor 20 segundo en revisar lo que paso , ago esto por que ayer me toco top y un malditoo temo se iso auto-look en top y le pedi primero de buenas formas despues me enoje y flamie un poco , pero como no quieren que uno se enoje si no respeta el juego y ademas enves que me den la razon a mi me terminan baneando  a mi que no ise nada enves del teemo que arruino la partida. osea de que  estamos ablando aqui po de que le dan oportunidades a los trollos por asi decirse en ves de los jugadores con buena conducta y que respeta , y como quieren que uno respete si le salen con este chiste , y ahora tengo ban de 14 dias y al teemo nada y todo me team me dio la razon . y ahora no puedo jugar por esa maldita injusticia del juego . y riot no me ayuda ni hace nada.r toda una partida es como que pusieran a un niño de 9 que no sabe que hace,y apuesto a que mas de un jugador le a pasado esto.","replies":[{"poster":"Excorpion","date":"2017-09-02T16:25:33.101+0000","up_votes":1,"down_votes":0,"body":"> _**un malditoo temo**_ se iso auto-look en top y le pedi primero de buenas formas _**despues me enoje y flamie**_ un poco\n\nEsto es lo que importa... no hay nada más que decir.\n\nSi te encuentras a un tóxico, flammer, troll, o lo que sea... NO LE FLAMEES !!! solo lograrás que te baneen a ti.\nDa igual lo que pase, lo molesto que sea... agregaron MUTE a todas las cosas para que lo uses y no tengas que verlo o escucharlo, y aún hay gente que responde a esos tipos de personas ??\n\nPor otro lado, tu ban, es de 14 días... esos significa que hace poco, tuviste alguna sanción por lo mismo.\nDebes aprender a controlarte frente a estos casos y saber como actuar, a las finales, uno siempre tiene que protegerse a si mismo\n{{sticker:slayer-jinx-wink}}","replies":[{"poster":"jaiblitz","date":"2017-09-02T16:35:12.298+0000","up_votes":1,"down_votes":0,"body":"a , osea tu me estas diciendo que debo tratar bien  de quedarme callado frente a estos tipos que te hacen burla y dejarlos hacer lo que quieras?","replies":[{"poster":"Excorpion","date":"2017-09-02T16:47:08.030+0000","up_votes":1,"down_votes":0,"body":"No quedarse callado... dije claramente, no flammear.\nPero depende de la persona, si no puedes hablar sin usar flammeo, lo mejor sería simplemente no hablar con ellos.\nDe todos modos, no dejarías que hagan lo que quieran, a ellos les gusta que tu les repondas, por que saben que caerás con ellos... no alimentar al troll es lo principal, y si le das con que jugar, le harás el juego más divertido a el.","replies":[{"poster":"jaiblitz","date":"2017-09-02T16:54:17.086+0000","up_votes":1,"down_votes":0,"body":"sabes que tienes razon pero yyo solo pido que no sean tan injustos","replies":[{"poster":"Excorpion","date":"2017-09-02T16:56:27.850+0000","up_votes":1,"down_votes":0,"body":"Todos pasan por el mismo proceso, esos trolls pueden estar en cualquier fase de los reportes...\nantes de sanción > luego de sanción leve > luego de sanción media > luego de sanción grave > antes de ser permabaneados.\nCreo que es suficiente saber que tu tienes otra oportunidad, ellos tienen la misma oportunidad final, lo importante es... que tu lo logres ;)","replies":[{"poster":"SShadowj","date":"2017-09-02T17:31:19.130+0000","up_votes":1,"down_votes":0,"body":"Ojala fuera tan fácil como dicen. Pero todos somos diferentes, como te afecta a vos es diferente a como le afecta a los demás, y aunque todos estemos a veces escribiendo \"A mi no me afecta en nada, me estoy riendo de lo que me decís\" en realidad duele muchas veces y molesta, quieran o no, te cambia toda la partida entera.\n Lamentablemente jamás van a poder entender cosas que muy complicadas como los sentimientos de las personas, pueden estar metiendo ban permanente a gente que todo el tiempo se esfuerza en mejorar como por ejemplo yo, pero hay tantas cosas dentro de como reaccionas, desde mal días o cosas que tenes en la cabeza que no necesariamente se van a pesar de que pase tanto tiempo.\n Mejor que se pongan las pilas en buscar métodos para eliminar a los trolls que como todos sabemos ellos son el VERDADERO problema de este juego y no los flammers que pueden simplemente como siempre digo, dar ban de chat permanente y listo en vez de prohibir el jugar.","replies":[{"poster":"Excorpion","date":"2017-09-02T17:37:36.437+0000","up_votes":1,"down_votes":0,"body":"No digo que sea fácil, solo que yo ya me acostumbre :P","replies":[{"poster":"SShadowj","date":"2017-09-02T21:58:27.334+0000","up_votes":1,"down_votes":0,"body":"Me refiero a que básicamente suena fácil como lo plantean, pero obviamente la realidad es otra jaja, lamentablemente igual es verdad que safan mas los trolls que los flammers.","replies":[]}]},{"poster":"jaiblitz","date":"2017-09-02T19:22:54.604+0000","up_votes":1,"down_votes":0,"body":"estoy de acuerdo contigo amigo","replies":[]}]}]}]}]}]}]},{"poster":"xNeriaj","date":"2017-09-02T16:00:49.618+0000","up_votes":1,"down_votes":0,"body":"Aunque todo tu equipo haya hecho insta-lock, no tienes razones para enojarte e insultarlo, porque arruinas la experiencia de todos. No se tu, pero a mi no me gusta estar en partida mientras uno insulta a otro por una tonteria.\n\nSi te banearon tan rapido y  directamente 14 dias es porque lo insultaste demasiado o porque lo has hecho más veces. \n\nSi la partida a la que te refieres fue la de hace 18 horas aproximadamente. Entonces dejame decirte que teemo no trolleo al menos no se puede demostrar en su score ni en su build. Tu flammeaste, tu recibes la sancion te guste o no, si el realmente trolleo y me estoy equivocando, tambien recibira su sancion, al igual que tu. Y por mucho que te que quejes, no se reducira ni se eliminara tu ban.","replies":[{"poster":"jaiblitz","date":"2017-09-02T16:41:51.277+0000","up_votes":1,"down_votes":0,"body":"1mero no estoy tratando de que me saquen los 14 dias , solo estoy tratando de hacer algo con estos sujetos y flamear es decir andate de aki maldito tejon de mierda eso es mucho para riot?","replies":[{"poster":"xNeriaj","date":"2017-09-02T17:17:04.317+0000","up_votes":1,"down_votes":0,"body":"Hombre xD Si estabas enojado estoy muy muy seguro que no es lo unico que dijiste...","replies":[{"poster":"jaiblitz","date":"2017-09-02T19:23:36.844+0000","up_votes":1,"down_votes":0,"body":"no esque lo que me enoja esque ya fueron 4 veces seguidas que me hicieron auto look","replies":[]}]}]}]},{"poster":"vaVav","date":"2017-09-02T16:09:00.198+0000","up_votes":1,"down_votes":0,"body":"¡Hola **jaiblitz**!\n\nDéjame responder algunas cosas de tu post:\n\n> yo pienso que por que antes de banear a un jugador no se dan el tiempo de revisar lo que realmente paso en la partida , osea como se van a demor 20 segundo en revisar lo que paso\n\nSucede que a ti te sancionó el sistema de retroalimentación instantánea. Hazme caso de que, a pesar de ser una computadora, detecta de forma correcta cuando un jugador presentó actitudes negativas.\n\n>  despues me enoje y flamie un poco , pero como no quieren que uno se enoje si no respeta el juego y ademas enves que me den la razon a mi me terminan baneando a mi que no ise nada enves del teemo que arruino la partida.\n\nAl admitir que flammeaste, el punto anterior se responde solo :P\n\nEs normal que te puedas enojar, pero si lo expresas en el chat solo terminarás creando un mal ambiente y será mas que obvio que tarde o temprano te llegaría una sanción.\n\nAdemás, probablemente ya hayas pasado por esto antes como para recibir el de 14 días esta vez, ya deberías de aprender a comportarte.\n\nY, sucede que a Teemo no les apeteció reportarlo ya sea por que consideraron que el autopickear era algo obsoleto o por que el mayor problema de la partida fuiste tu.\n\n> osea de que estamos ablando aqui po de que le dan oportunidades a los trollos por asi decirse en ves de los jugadores con buena conducta y que respeta\n\nSucede que si los jugadores no aprenden el valor y peso que tienen los reportes, abundarán gente como ellos. A Riot se le dificulta descubrirlos si la comunidad no hace su parte, ¿Se entiende?\n\nPor cierto, que irónico que te describas como un jugador con buena conducta y que respeta sabiendo que esta discusión es debido a que te sancionaron por flammear. \n\n> y como quieren que uno respete si le salen con este chiste , y ahora tengo ban de 14 dias y al teemo nada y todo me team me dio la razon\n\nTu debes respetar siempre o pasaran estas cosas, simple.\n\nTampoco sabes si Teemo no fue sancionado y, si no fue así pero sigue realizando estas acciones trolls, probablemente no tarde mucho en llegarle una. \n\n¿En qué te dio la razón tu equipo?\n\n> y ahora no puedo jugar por esa maldita injusticia del juego . y riot no me ayuda ni hace nada\n\nNo veo la injusticia, te sancionaron por tus actitudes negativas, es más que correcta la misma. Además, obviamente Riot no te quitará la sanción o algo por el estilo, todos sabemos que no lo mereces.\n\n---------------------------------------------\n\nSi tienes alguna otra duda o deseas conversar sobre esto, puedes responder a mi comentario :)\n\n¡Saludos!\n_-NovaIncipere_","replies":[{"poster":"jaiblitz","date":"2017-09-02T16:38:38.477+0000","up_votes":1,"down_votes":0,"body":"pero oye , me vas a creer que me toco 4 trools en 4 partidas seguidas y quieres que no me enoje :) ademas en el otro punto tu dijiste que es una computadora la que ve las sanciones ya po seria muy diferente si fuera una persona real , ademas tu quieres que trates bien a estos tipos que se busrlan de uno? maensima justo me iba a poner a renkear","replies":[{"poster":"vaVav","date":"2017-09-02T16:44:43.782+0000","up_votes":1,"down_votes":0,"body":"> me vas a creer que me toco 4 trools en 4 partidas seguidas y quieres que no me enoje\n\nNo te digo que no te enojes, pero si expresas tu furia los resultados para ti no serán buenos :)\n\n> ademas en el otro punto tu dijiste que es una computadora la que ve las sanciones ya po seria muy diferente si fuera una persona real \n\nNo necesariamente, los reportes de los jugadores activan este sistema. El mismo ve en los registros de chat para comprobar si el usuario en cuestión realizó comentarios insultantes o subidos de tono y, en caso de que sea así, lo penaliza.\n\n> ademas tu quieres que trates bien a estos tipos que se busrlan de uno? \n\n¿Si? ¿No? ¿Mi opinión influirá?\n\nA mi parecer no es necesario que los trates bien, solo no los trates mal, caso contrario te sancionarán (y a la próxima es el permanente) y solo crearás un mal ambiente tanto en partida como un circulo vicioso de toxicidad entre los que se encontraban en la misma o en partidas futuras contigo.","replies":[{"poster":"jaiblitz","date":"2017-09-02T16:53:29.397+0000","up_votes":1,"down_votes":0,"body":"en lo ultimo estoy de acuerdo contigo  , pero que quieres que aga reprimirme? si no paran ,, no hacen caso y maensima te quieren reportar por algo que tu ganaste primero?","replies":[{"poster":"vaVav","date":"2017-09-02T16:54:29.773+0000","up_votes":1,"down_votes":0,"body":"Te quieren reportar por toxicidad, y están en lo correcto.\n\nNo hay excusa para flammear, ni que ellos trollearon ni que comenzaron, no existe.","replies":[]}]}]}]}]},{"poster":"Nehalem","date":"2017-09-02T15:58:09.891+0000","up_votes":1,"down_votes":0,"body":"Un algoritmo se encarga de las penalizaciones, no un mediador.","replies":[{"poster":"jaiblitz","date":"2017-09-02T16:42:11.376+0000","up_votes":1,"down_votes":0,"body":"igual es malo po","replies":[]}]},{"poster":"Kawatori","date":"2017-09-02T15:55:29.712+0000","up_votes":1,"down_votes":0,"body":"Si flameaste no importa lo que haya hecho el otro jugador el sistema te va a banear por toxico y el teemo si lo reportaste va a llegar a un tiempo donde su cuenta va a ser permabaneada.","replies":[{"poster":"jaiblitz","date":"2017-09-02T16:40:08.564+0000","up_votes":1,"down_votes":0,"body":"ojala sea a si , pero la lux flameo mas que yo yo solo le dije andate de aki maldito tejon de mierda y no hacia caso","replies":[]}]}]}