{"poster":"Dragonface","date":"2017-02-13T00:36:51.179+0000","title":"Someone declined ready check, \"Accept/Decline\" still stays up on screen and won't go away","subforum":"[ARCHIVED] Help & Support","up_votes":6,"down_votes":0,"body":"Title.\r\n\r\nWhen you get another ready check, it just doesn't pop up, the old one remains, and you can't accept it, so you get dropped out of queue.","replies":[{"poster":"Targons Blade","date":"2017-02-13T23:26:51.471+0000","up_votes":1,"down_votes":0,"body":"Is this continuously happening, or did it only happen once? Also, is this happening in the Beta Client or the Legacy Client?","replies":[{"poster":"Ipols","date":"2017-02-13T23:33:07.002+0000","up_votes":3,"down_votes":0,"body":"It happened to me for about 30 minutes and 2 failed queques then stopped. Beta client","replies":[{"poster":"Targons Blade","date":"2017-02-14T23:33:14.659+0000","up_votes":1,"down_votes":0,"body":"Can you swap over to the Legacy Client and let me know if it happens there as well? You can access it from login:\n\nhttps://support.riotgames.com/hc/en-us/article_attachments/215576628/Launch-Legacy-Client.jpg","replies":[{"poster":"Ipols","date":"2017-02-15T05:36:23.203+0000","up_votes":1,"down_votes":0,"body":"I cani do it but I don't understand: do you want me to play on the Legacy untill it happens? Am I missing something? Anyway I'll start using Legacy when I get home","replies":[{"poster":"Targons Blade","date":"2017-02-15T21:47:50.239+0000","up_votes":1,"down_votes":0,"body":"Yes, I'd like you to play some matches on the Legacy Client and let me know if you experience the same symptoms while using the Legacy Client. Sorry for not being clear! D:","replies":[{"poster":"Ipols","date":"2017-02-19T22:04:12.146+0000","up_votes":1,"down_votes":0,"body":"Hi! Weekend has ended for me right now:\nI only managed to play about 10 games on the Legacy client and it never happened to me, while I played about 3-4 game son the beta client (Ops! forgot to switch) and it happened once. Sample size too small probably to mean anything alone.\n\nCya","replies":[]},{"poster":"Karn Bishop","date":"2017-02-17T06:31:44.980+0000","up_votes":1,"down_votes":0,"body":"Since OP hasn't gotten back to you the glitch does not happen on the legacy client, furthermore if the new client is open but you are afk for a period of the the play button will also gray out forcing you to restart in order to continue playing.","replies":[]},{"poster":"Ipols","date":"2017-02-15T22:50:11.789+0000","up_votes":1,"down_votes":0,"body":"Ok I'll play on the Legacy untill monday, then I'll post down bere. I don't know how helpfull Can this be tbh since it looks like a rare bug. Cya on monday\nEdit: Just to be clear it happened once on the beta client and then never again","replies":[]}]}]}]}]}]},{"poster":"Karn Bishop","date":"2017-02-17T03:47:18.842+0000","up_votes":1,"down_votes":0,"body":"I also receive this issue on the new client, it is annoying.","replies":[]}]}