{"poster":"HK Shiroe","date":"2016-09-17T15:36:41.232+0000","title":"WIR SUCHEN DICH!","subforum":"Clans & Teams","up_votes":2,"down_votes":1,"body":"Hallo liebe League Community,\r\n\r\nIch suche Leute die Spa&szlig; an lol haben und einfach gerne mit anderen zusammen spielen und nicht nur alleine soloq spielen. Ich m&ouml;chte ein Team gr&uuml;nden, wo alle gemeinsam spielen und Spa&szlig; haben. Das Team soll nicht nur f&uuml;r die Rewards sein, sondern auch weiterhin bestehen. \r\n\r\nNun erstmal zum Team :\r\n\r\nWir haben noch keinen Namen, weil ich finde, dass das Team dar&uuml;ber entscheiden sollte und nicht nur ich alleine.\r\nUnser Ziel sind auf jeden Fall die Rewards, aber wir wollen so hoch kommen , wie es nur geht und m&ouml;glicher weise auch an kleineren Turnieren teilnehmen   ( Dr Pepper Cup, King of Spandau Cup etc)\r\nUnser Team hat feste Trainingszeiten, die mir sehr wichtig sind. Wann und wie lange diese gehen m&ouml;chte ich erst mit dem gesamten Team entscheiden.\r\n\r\nWas suchen wir : \r\n\r\nDie Rollen die uns noch fehlen sind \r\n\r\n- Support\r\n- Midlaner\r\n- Toplaner\r\n- Jungler\r\n\r\nIhr d&uuml;rft euch auch als Adc bewerben aber ihr w&auml;hrt dann nur der Ersatzspieler.\r\n\r\nWas m&uuml;sst ihr mit bringen:\r\n\r\n- Die Elo ist mir egal von Bronze 5 bis Dia 1 :D\r\n- Ihr solltet nicht flamen mal ab und zu etwas sagen ist in Ordnung, aber bitte nicht die ganze Zeit  flamen \r\n- Ihr m&uuml;sst kein bestimmtes Alter haben, aber ihr solltet euch angemessen verhalten ( nicht beleidigen, games leaven etc )\r\n- ein funktionierendes Mikrophon am besten ohne St&ouml;rger&auml;usche \r\n- ihr solltet stetig besser werden wollen und kritikf&auml;hig sein\r\n- TS3\r\n\r\nWir bieten: \r\n\r\nDa wir nur ein Team sind leider nicht viel.\r\n\r\n- Einen Teamspeak mit einem eigen Channel \r\n- Spa&szlig;ige games \r\n\r\nKurz noch etwas zu mir : \r\n\r\nName: Leon\r\nAlter : 15 \r\nRolle : AD \r\nElo: Gold 1\r\n\r\nWichtig ist noch zusagen, das alle die hier mit machen damit rechnen m&uuml;ssen mit Leuten zu spielen die nicht gut sind oder weit unter oder &uuml;ber ihrer Elo\r\n\r\nWenn ihr Lust und Interesse habt mir beizutreten und Spa&szlig; zu haben, dann addet mich in lol :  FDK Neko ninja","replies":[{"poster":"Only Blitzcránk","date":"2016-09-18T05:59:44.642+0000","up_votes":1,"down_votes":0,"body":"Würde gerne als Supporter agieren, gerne auch als Ersatz im Jungle. \n\nName : Max\nAlter : 19\nRolle : Supporter/Jungler\nElo : S2 Ziel bis nächsten Freitag G5\n\nHab bis zum 17.okt frei, kann aber ab dann auch regelmäßig zocken.\n\nHabe Dich mal eingeladen weiteres könnten wir ja auch dann dort besprechen.\nViele Grüße","replies":[]},{"poster":"Tavina","date":"2016-09-17T17:35:01.701+0000","up_votes":1,"down_votes":0,"body":"Hey :)\nalso ich hab dasselbe wie du vor :D erstelle auch gerade ein Ranked Team, hauptsächlich um aus Spaß zu spielen, aber eigentlich um sich den Ward skin zu erspielen :D\nHab gesehen, dass dir noch recht viele Leute fehlen, eventuell könnten wir ja deine Leute und meine Leute zu einem großen Team zusammen schmeißen\nLG","replies":[]},{"poster":"AmazingJX","date":"2016-09-17T16:35:32.430+0000","up_votes":1,"down_votes":0,"body":"Klingt gut Anfrage ist raus","replies":[]},{"poster":"Suprèmeleader","date":"2016-09-17T16:05:32.818+0000","up_votes":1,"down_votes":0,"body":"Ich hab dich geaddet","replies":[]}]}