{"poster":"Gau Oi Em O Dau","date":"2016-10-05T07:50:50.183+0000","title":"Elo boost are out of hand. What can we do to decreasing the number ?","subforum":"Miscellaneous","up_votes":2,"down_votes":0,"body":"I try to report many different account which i believe elo boost ( because their elo surprisingly rocket jump in last few week, they played the champ they never played before and get massive kill ).\r\nI have sent about 6 tickets but all of it get the same respond from RIOT. I&#039;m not sure, does RIOT actually reviewed all report ticket ? And giving out punishment to both booster and boosted player ?\r\n\r\nP/s : i even sent them a photo of one OCE challenger advertise elo boosting on facebook ( with his IGN ), but RIOT seem careless.","replies":[{"poster":"Nightjar","date":"2016-10-05T07:59:51.223+0000","up_votes":1,"down_votes":1,"body":"Well picking out boosters is great and all but also remember that some people are doing placements and getting placed in the wrong elo too so don't hate on them so much since they can't help it. Also sometimes when we pick a new champion it might just have been our pocket pick for some time and we were experimenting with new champions in normals (like after I got M7 Zilean and then moved on to try bard and morgana who I both suck at). \n\nI don't like boosting and I can't imagine why people feel good when they get boosted since I already feel embarassed playing in silver when I should probably be low bronze. So right now I'm currently working on playing more ranked between uni work and exams so that I can steadily lose more lp. Also switching summoner spell order is also not a good indicator to spot a booster unless it's temporary and only in their good games that's a pretty obvious one. the new champion thing kinda makes sense if they're playing it for the first time ever in a ranked game but if they just haven't played it much recently then it could just be a pocket pick.","replies":[{"poster":"Nightjar","date":"2016-10-07T15:22:55.732+0000","up_votes":1,"down_votes":0,"body":"hey what's the issue with pointing out that some people might just seem boosted because of chance during placements and got put in a higher/lower elo than they deserve.","replies":[]}]},{"poster":"Sneed","date":"2016-10-07T01:47:04.585+0000","up_votes":1,"down_votes":0,"body":"elo boosts are not out of hand lol","replies":[]},{"poster":"Trustworthy","date":"2016-10-06T17:59:26.212+0000","up_votes":1,"down_votes":0,"body":"It's end of Season bro.  I'm willing to bet at least 2 accounts every 2 games (1/10 reason i writ it like that is because everyone who boosts duo's pretty much) are being boosted. especially in Silver & Platinum . It's very comical to find someone and think oh they played incredible i'll add them after the game search them up on OP.GG find out they climbed 3 divisions today swapped from Top lane to ADC. Have a 100% win rate over 10 games on X adc's and 70% on 3-4 others over 20 games. \nRiot are oblivious as usual every season it's the same thing I've got people on my friends list who've gloated about boosting from Gold - plat to Diamond just for the boarders. Sometimes it's recurring people or some new friend i send in a ticket about them hoping they'd lose there boarder and skin so next season they'd reform and actually play the game this time. \nThey never get punished. From now on honestly people who ask me \"how can i get out of bronze?\" i'll tell them $30 and a boosting site my friend.\nAs for your question what can we do?\nWe essentially have to put our faith in Riot games, hoping they will pick up the slack they've been showing in this area. Just send a ticket in asking riot to check into the suspected account all you can do. Whether they look into these cases is debatable.\nTruth is if there was active punishment people would be more afraid of attempting it","replies":[]}]}