{"poster":"Jack Eron","date":"2018-09-10T13:40:06.477+0000","title":"Nunu supportként!","subforum":"Általános beszélgetés","up_votes":1,"down_votes":0,"body":"Mostan&aacute;ban r&aacute;kaptam a Nunu supportra, de lobbyban erősen meg kell n&eacute;ha k&uuml;zdeni a csapatt&aacute;rsakkal, hogy elfogadj&aacute;k, ugyanis valami&eacute;rt sokan trollpicknek tartj&aacute;k.\r\n\r\nBele&eacute;gett a k&ouml;ztudatba egy ilyen &quot;ha Lcs-n nem viszik akkor nem is support&quot;, vagy &quot;ha kicsi a winrateje akkor szar&quot;, vagy  csak sim&aacute;n kevesen j&aacute;tszanak vele, ez&eacute;rt csakis pocs&eacute;k lehet. Pedig potenci&aacute;l bőven van benne.\r\n\r\nEreklyepajzsal &eacute;s Qval gyakorlatilag folymatosan fenntarthatja a HPj&aacute;t, k&ouml;zben adja a goldot az adcnek, &iacute;gy ritk&aacute;bban fordul elő, hogy az adc v&eacute;letlen lasthiteli a cannont, vagy valahogy elmisselem.\r\n\r\nA W sim&aacute;n bokorb&oacute;l is ind&iacute;that&oacute;, &eacute;s alig van, aki ki tudn&aacute; dodgeolni, főleg, ha mondjuk a turret al&oacute;l kezdem el felh&uacute;zni. Neh&eacute;z kiker&uuml;lni, &eacute;s k&ouml;zvetlen k&ouml;zelről is az ellenf&eacute;l arc&aacute;ba nyomhat&oacute;, a mininokba meg csak akkor akad bele, ha &eacute;n is &uacute;gy akarom, vagy el&eacute;rte a maximumot.\r\n\r\nAz E &aacute;tpattog a mininokon, &eacute;s eleget slowol ahhoz, hogy j&oacute;csk&aacute;n megnehez&iacute;tse az ellenf&eacute;l dolg&aacute;t, aki ki szeretne menni a hat&oacute;k&ouml;r&eacute;ből. Ezek ut&aacute;n ugye m&eacute;g b&eacute;n&iacute;t is.\r\n\r\nAz ulti j&oacute;kora sebz&eacute;st okoz m&eacute;g tankk&eacute;nt is, &eacute;s a 95%ig emelkedő lass&iacute;t&aacute;s szint&eacute;n nem elhanyagolhat&oacute;.\r\n\r\nA spawnr&oacute;l a h&oacute;goly&oacute; miatt gyorsan ki&eacute;r, k&ouml;nnyen kezdem&eacute;nyez, stunol, lass&iacute;t, megtud v&eacute;deni egy adct, m&eacute;gis sokan haragudnak a pick miatt.","replies":[{"poster":"The One ESCANOR","date":"2018-09-10T14:03:04.221+0000","up_votes":1,"down_votes":0,"body":"\"megtud védeni egy adct\" na ott a hiba :D Low eloban 10 supportból 8 magát menti inkább mint az adc-t utána meg le noobozza hogy meghalt. Low elo playerek addig nem fogadják el a Nunu supportot ameddig konzisztensen nem ad pajzsot. \n\nMeg azért tudjuk hogy Nunu az egyik \"legkedveltebb\" troll karakter és aki supportnak viszi az biztos csak intelni akar.","replies":[{"poster":"Jack Eron","date":"2018-09-10T14:13:27.406+0000","up_votes":1,"down_votes":0,"body":"Én nem magamat mentem, de ostoba adcért nem is áldozom az életemet. Egyébként tök mindegy, milyen elóról beszélünk, ha ilyesmit pickelek, kb sosem fogják elismerni. Ha azzal jövök, mennyit nyertem vele, akkor meg majd jön a \"biztos szar volt az enemy\" szöveg, ami azért nem akkora hülyeség, hiszen az esetek 80%ában tényleg azon dől el egy meccs, hogy melyikünk a pocsékabb játékos. De azért hiba lenne ilyen egyszerűen leosztani valamit.","replies":[{"poster":"Gamma Ray01","date":"2018-09-10T19:05:45.778+0000","up_votes":1,"down_votes":0,"body":"A maradék 20%-ot meghagytad a laggnak és a ledobott a netnek? :D","replies":[{"poster":"Jack Eron","date":"2018-09-10T19:12:23.494+0000","up_votes":1,"down_votes":0,"body":"Természetesen","replies":[{"poster":"Gamma Ray01","date":"2018-09-10T19:22:19.017+0000","up_votes":2,"down_votes":0,"body":"A 20% laggból és ledobott a netből, hány % valódi és hány % a kifogásnak mondott? :D\n\nImádom ebben a játékban, hogy bármi gond van egy szóval simán tisztára mosod magad, lagg. Ezt beírod és már áldozat vagy. :D","replies":[]}]}]}]}]},{"poster":"Gregori","date":"2018-09-10T17:20:23.137+0000","up_votes":1,"down_votes":0,"body":"Nem tudom, én párszor hoztam már, senki sem flamelt érte lobby-ban. Meccsen mondjuk nem teljesítettem túl jól, de akkor sem tapasztaltam semmit.\n\nNéha úgy érzem, mintha én egy másik játékot játszanék mint a fórumozók többsége, engem annyira elkerül flame meg hasonlóak. Persze elvétve találkozok ilyesmivel, de akkor csak nevetek rajta.","replies":[{"poster":"Jack Eron","date":"2018-09-10T19:13:39.815+0000","up_votes":1,"down_votes":0,"body":"Akkor tényleg másik játékot játszol, vagy a fene tudja, nem nézed a chatet. Nálam nincs olyan, hogy nincs flamer vagy troll. Ha nem nálam, úgy akkor az ellenfélnél. Mindegy hogy draftról vagy rankedről beszélünk.","replies":[{"poster":"Knight Thyme","date":"2018-09-13T08:00:19.496+0000","up_votes":1,"down_votes":0,"body":"Pedig akadnak normalis csapatok. Persze segit, ha te is batoritoan es baratsagosan kommunikalsz.","replies":[{"poster":"Jack Eron","date":"2018-09-13T18:38:56.715+0000","up_votes":1,"down_votes":0,"body":"Nálam még nem segített, max 100 ból 1x. A játékosok döntő többsége sosem hallott még a stratégiáról csak éli  a kis világát, mintha a játék csak belőle állna.","replies":[]}]}]}]},{"poster":"Kai Keiki","date":"2018-09-10T18:48:02.911+0000","up_votes":1,"down_votes":0,"body":"Az a baj, hogy a Metát jelentős részben az LCS eseményei írják, pedig sok champ rendelkezik olyan képességekkel, amikkel tud máshol is érvényesülni, csak sajna az ember hajlamos begyöpesedni és beskatulyázni a dolgokat hogy mi mire jó és kész.\nÉn azt mondom, hogy míg tartod magad a Kódexhez, hozz mait szeretnél. Néha a járatlan út a legjobb.","replies":[{"poster":"Jack Eron","date":"2018-09-10T19:19:59.929+0000","up_votes":1,"down_votes":0,"body":"A hozz amit akarsz részt azért csak ésszel :D Mint például ma topon a ludenes, hextech revolveres AP garen. Röhej, nem is tudom, mi játszódott le a fejében. Teljesen ellehetetlenítette a csapata és a saját játékát, de biztos úgy gondolta, hogy azt hoz, amit akar.\n\nAz meg elég sajnálatos, hogy az Lcs a teljes játékosbázis 10%-át sem teszi ki, de azért az határozná meg a több millió játékos által játszott játék metáját...","replies":[{"poster":"Kai Keiki","date":"2018-09-10T21:16:54.013+0000","up_votes":1,"down_votes":0,"body":"Ne feltételezzük rögtön a legrosszabbat. :D\nAmúgy én eddig az MF support megjelenésétől kerültem őrületbe. Miért hitték azt hogy egy {{item:3303}} beékelése a megszokott buildbe supporttá teszi őket? :D Inkább csak útban voltak és nem látták el a feladatukat XD\nAmúgy megnézném azt a Játékot Garennel XD","replies":[{"poster":"Kai Keiki","date":"2018-09-11T10:31:30.931+0000","up_votes":1,"down_votes":0,"body":"Köztudott tény, hogy Supportolni bármivel lehet, én is ezt vallom. Viszont, ezek szerint csak nekem van csupa rossz tapasztalatom erről a felállásról.","replies":[]},{"poster":"Complex VN","date":"2018-09-11T10:15:25.395+0000","up_votes":1,"down_votes":0,"body":"Pedig az mf support teljesen jól működik arra amire ki lett találva.","replies":[]},{"poster":"Gamma Ray01","date":"2018-09-10T22:00:00.799+0000","up_votes":1,"down_votes":0,"body":"Igazából azt vettem észre, ha ügyetlen az ellenfél bármi jó szupportnak aminek van egy kis sebzése és cc-je. Kisebb szinteken szinte bármi működik szerintem.","replies":[]}]}]}]},{"poster":"Gamma Ray01","date":"2018-09-10T17:54:05.306+0000","up_votes":1,"down_votes":0,"body":"Nincs trollpick a játékban. Mindenki azt pickel amit akar ez a Riot Games álláspontja. Szabadon pickelhet mindenki mindent. Egy fontos dolog van, hogy a csapatot segítsd. Tehát amennyiben te soraka jg-t játszol és nem gankelsz sehol, mert nem tudsz, de bőszen nyomogatod az ultit, már akkor segítségére vagy a csapatnak.","replies":[]}]}