{"poster":"Krizalid","date":"2015-05-11T21:06:40.847+0000","title":"Champion Mastery points should be given for actual skill, not for victory","subforum":"Gameplay","up_votes":42,"down_votes":13,"body":"I think that it&#039;s unfair when one person can feed the whole game and somehow, by achieving victory, get much more points than someone who has been trying to win the match from the opposite team with a good or dramatically better k/d/a ratio. I mean, it&#039;s **not** Champion Mastery then - it&#039;s something what just goes along with your Wins/Loses ratio and just tells how long have you been wining the games. Wouldn&#039;t it be much better if you were actually rewarded for your efforts, even if you have lost the match? Wouldn&#039;t it actually show the true meaning of a graceful defeat?","replies":[{"poster":"GroundRuleDouble","date":"2015-05-11T21:11:43.704+0000","up_votes":15,"down_votes":12,"body":"You aren't mastering a champion if you don't use it to win the game.","replies":[{"poster":"Krizalid","date":"2015-05-11T21:16:57.826+0000","up_votes":9,"down_votes":7,"body":"And what if the player has the best k/d/a in the game and he's the only one who's trying to do something, while all his team feeds? He loses the game and he gets nothing, his efforts to win not only his own lane, but to save everybody were just a waste of time?","replies":[{"poster":"GroundRuleDouble","date":"2015-05-11T21:20:21.806+0000","up_votes":23,"down_votes":7,"body":"Usually (not always) if someone has a great KDA and they lose, it means that they were too busy helping themselves and not their team.\n\nThe goal of the game is to kill the nexus, not have a high KDA.","replies":[{"poster":"IcyPepper","date":"2015-05-11T21:57:47.673+0000","up_votes":10,"down_votes":2,"body":"This.\n\nI know people want to brag about their kda and how everyone else is a feeder, but this game is about objectives, not kills. Kills *help,* but they are not the only factor and when people focus solely on KDA and nothing else, the entire point of something like champion mastery is lost on them.","replies":[{"poster":"BestTristMyHaus","date":"2015-05-11T22:07:42.648+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=tombdragon,realm=NA,application-id=3ErqAdtq,discussion-id=mcF1QHw8,comment-id=0000000000000001,timestamp=2015-05-11T21:57:47.673+0000)\n>\n> This.\n> \n> I know people want to brag about their kda and how everyone else is a feeder, but this game is about objectives, not kills. Kills *help,* but they are not the only factor and when people focus solely on KDA and nothing else, the entire point of something like champion mastery is lost on them.\n\nI'm not saying KDA should be the defining characteristic (I would HOPE a support with 0 kills could still get a great score), but Victory is TOO heavily weighted IMO.  I've had games that I KNOW I've f'ed up, I literally played TERRIBLE and was FULLY AWARE of that.  I still get more Mastery Pts than I do in a loss no matter how I play in the loss, and not in that 250 vs. 200 kind of way, but minimum of 800 for a win and I don't think I've gone above 250 in a loss.","replies":[]},{"poster":"Fertsa","date":"2015-05-13T02:26:16.761+0000","up_votes":2,"down_votes":0,"body":"One game i was singed and all i did practically all match was push lane. my lane opponent went to teamfights that my team barely came out alive in, my team would then troll around the jungle and go back to farming while i pushed.\n\nAt the end of the game after my team won everybody on both teams agree i was the only one that actually did anything.\n\nMy score was 2/15/1\n\nKDA is extremely unimportant.","replies":[]}]},{"poster":"BigIdea","date":"2015-05-11T21:26:01.136+0000","up_votes":7,"down_votes":6,"body":"not true. league is a 5 person game. 3 or 4 feeding individuals will drag down 1 outperforming individual regardless of what he does. happens all the time.","replies":[{"poster":"GroundRuleDouble","date":"2015-05-11T21:27:15.911+0000","up_votes":4,"down_votes":4,"body":"That's why I said usually.  And \"usually\" is true.","replies":[{"poster":"WarlockLaw","date":"2015-05-11T22:05:45.179+0000","up_votes":4,"down_votes":2,"body":"Look at it this way, if somebody goes 0/X/0 but wins do they deserve more or less points than somebody with a score of say 7/7/7 on the enemy team where 7 < X. Also assume that the guy who only fed also had lower cs. With their current system you seem to get at least 500 points for winning and losing I have never seen earn much more than 300","replies":[{"poster":"Critmaster Garen","date":"2015-05-11T22:08:48.802+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=SLAYER6752,realm=NA,application-id=3ErqAdtq,discussion-id=mcF1QHw8,comment-id=000000000000000000000000,timestamp=2015-05-11T22:05:45.179+0000)\n>\n> Look at it this way, if somebody goes 0/X/0 but wins do they deserve more or less points than somebody with a score of say 7/7/7 on the enemy team where 7 < X. Also assume that the guy who only fed also had lower cs. With their current system you seem to get at least 500 points for winning and losing I have never seen earn much more than 300\n\ni have 1580 points for playing 1 ranked game with reksai. i just bought the champion and never played her before so these points have to be from that one single game. i really only played her, because our jungler slept in champ select and forgot to trade.\n\ndidnt even perform that greatly on her, but somehow still got that many points for winning.\n\nthis only shows that the system is kindof stupid.","replies":[]}]}]},{"poster":"SelflessTeammate","date":"2015-05-12T14:17:32.633+0000","up_votes":1,"down_votes":0,"body":"Yes true, actually. There is no argument, there can be no argument. You either are a team player or you aren't, and you win or lose as a team. There is no discussion possible, that's the system.","replies":[]}]},{"poster":"SelflessTeammate","date":"2015-05-12T14:17:00.761+0000","up_votes":1,"down_votes":0,"body":"^Please laminate this last line and frame it. I'm astonished how few people get this simple idea.","replies":[]}]},{"poster":"League of Potato","date":"2015-05-12T18:54:16.225+0000","up_votes":3,"down_votes":0,"body":"Not every person on your team needs a perfect kda to win. There are these things called objectives that are honestly much more important. I can't tell you how many games I've won because the other team was only going for kills rather than actually trying to get our nexus.","replies":[]},{"poster":"SelflessTeammate","date":"2015-05-12T14:13:37.073+0000","up_votes":3,"down_votes":0,"body":"An individual's KDA doesn't mean anything. That's why it's a team game, and you win or lose as a team, and only as a team. It's win or lose as a team, and that's it. No in-betweens.\n\nCommon misconception. Also, see above: I still get A's, even after a loss. The system probably is more sophisticated than KDA, as it should be, as KDA is a stupid thing to measure alone.","replies":[]}]},{"poster":"Critmaster Garen","date":"2015-05-11T21:22:07.701+0000","up_votes":5,"down_votes":2,"body":"> [{quoted}](name=13ennetto,realm=NA,application-id=3ErqAdtq,discussion-id=mcF1QHw8,comment-id=0000,timestamp=2015-05-11T21:11:43.704+0000)\n>\n> You aren't mastering a champion if you don't use it to win the game.\n\nthats not entirely fair. there are some games you cant carry. this is an extreme example, but there was a game recently where i went 4/1 relatively early on in the game.\n\nwhile my entire team managed to rack up scores like 1/8, 0/6 etc. all 4 of them. before i could even put my advantage to use to help them. there are sometimes these games that get thrown by that 1 lee sin who thinks hes a big shot and tries to dive 1v5 then gets killed. or some people having the strategic understanding of a rotten potato and walk right into a clearly visible ambush instead away from it and throw the game for your entire team.\n\ngames like these have nothing to do with the mastery over your particular champion.\n\nbottom line is i agree that victory or loss shouldnt impact mastery points, but how you performed in relation to your team, and everyone who plays this champ in general. \n\ni also think you should be able to lose mastery points and they should decay over time if you havent played a champ more than a month. the system should be more like the ranked lp system where it compares your performance to every other player playing this champion and your personal performance in regards to your team. pretty much like a seperate ladder just for that particular champion.","replies":[{"poster":"GroundRuleDouble","date":"2015-05-11T21:28:10.030+0000","up_votes":6,"down_votes":5,"body":"Usually, if you don't win, and you're doing great, it's because you're not doing what you can to help your team.  Of course there are some unwinnable games, but those are few and far between.","replies":[{"poster":"BestTristMyHaus","date":"2015-05-11T21:47:07.952+0000","up_votes":8,"down_votes":2,"body":"> [{quoted}](name=13ennetto,realm=NA,application-id=3ErqAdtq,discussion-id=mcF1QHw8,comment-id=000000010000,timestamp=2015-05-11T21:28:10.030+0000)\n>\n> Usually, if you don't win, and you're doing great, it's because you're not doing what you can to help your team.  Of course there are some unwinnable games, but those are few and far between.\n\nThat's garbage.  How about this:\nWhat if I have a game where the teams are even EXCEPT I'm best on my team and the opposing team has someone that is flat out BETTER than me.  Ignoring all the troll games, afks, dcs and whatnot (that happen ALL THE TIME), it is fairly reasonable to say if you believe in Riot's matchmaking abilities that I'm gonna be close to 50/50 simply because I SHOULD be playing on even ground. (opponent is equal or SLIGHTLY better/worse than me)  In that scenario, I can play perfectly, help the team as best I can but still LOSE, but NOT because I'm not playing my champion well, but simply because someone else is BETTER.  Just to use an extreme, If I'm gold quality and he's plat quality and EVERYONE else playing is bronze, how is it fair that plat's bronzies get a ton more Mastery Pts than me simply because they got lucky placement?","replies":[{"poster":"GroundRuleDouble","date":"2015-05-13T14:18:05.639+0000","up_votes":1,"down_votes":1,"body":"Why is everyone ignoring the word \"usually?\"","replies":[{"poster":"BestTristMyHaus","date":"2015-05-13T14:56:14.161+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=13ennetto,realm=NA,application-id=3ErqAdtq,discussion-id=mcF1QHw8,comment-id=00000001000000000000,timestamp=2015-05-13T14:18:05.639+0000)\n>\n> Why is everyone ignoring the word \"usually?\"\n\nASSUMING Riot's matchmaking is correct, any player SHOULD lose 50% (give or take) of the time because he's playing against EVEN competition.  Whether that is because One player is great and the other 4 are terrible, or all 5 are average or some variation in between, the fact (again, assuming you believe in the system) is that IF you are playing \"correctly\" you're going to win about half of your games (or you will be promoted).  With that in mind, how is it \"USUALLY\" that you would be playing \"wrong\" if you lose while playing well?\n\nAs a side note, to bring it back to the original point about mastery pts vs. game result.  Forget all that nonsense, FORGET the \"top\" end.  Let's instead focus on the BOTTOM end.  Let's say someone with \"S\" rank and insane (think 24-0-6, made up numbers btw) KDA deserves to only get 250 Mastery Pts because his team lost.  Fine, great, whatever.  You can't carry or rally the team, you suck, rah rah.  This isn't a question ABOUT him, what about the 0-15-3 MIDDLE laner that got carried by a god-like bot duo and an out of his mind Jungler, with an average Top.  Does THAT guy deserve 1000+ Mastery Pts just because he was \"on the right team\"?  Someone who has crap tier mechanics and is always caught out of position, but just \"right place, right time\" so pts for you.  THAT is appropriate?\n\nI ask because I've BEEN that latter guy in games.  I've had games where I KNOW I sucked.  I played TERRIBLE, I wasn't last hitting at all, I didn't group well, I got caught in bad places, long story short, I played awful by all conceivable metrics, but you know what, my TEAM still won (I didn't **intentionally** feed or AFK, so I had that going for me).  I would prefer a need to grind my way to being top flight with my champion and know that Mastery actually MEANS I know what I'm doing (both to others, and also to MYSELF) rather than get carried to top rank just to give myself a participation ribbon.","replies":[{"poster":"GroundRuleDouble","date":"2015-05-13T15:00:44.005+0000","up_votes":1,"down_votes":1,"body":"My answer is yes.  The 0/15/3 guy that his team carried him to a win deserves more mastery points than the 24/0/6 guy on the losing team because the first guy's team won.  Simple as that.  You should never be rewarded for being on a losing team.  I'll say that again.  You should never be rewarded for being on a losing team.  You can have more points than the other players on your team, sure.  But in the end, you lost.  The point of the game is not to get kills.  Farming kills is worthless if you don't use it to your advantage.","replies":[{"poster":"BestTristMyHaus","date":"2015-05-13T15:18:42.034+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=13ennetto,realm=NA,application-id=3ErqAdtq,discussion-id=mcF1QHw8,comment-id=0000000100000000000000000000,timestamp=2015-05-13T15:00:44.005+0000)\n>\n> My answer is yes.  The 0/15/3 guy that his team carried him to a win deserves more mastery points than the 24/0/6 guy on the losing team because the first guy's team won.  Simple as that.  You should never be rewarded for being on a losing team.\n\nSo the most important \"skill\" for **champion mastery** is \"luck of the draw\" in getting the right team, got it.","replies":[{"poster":"GroundRuleDouble","date":"2015-05-13T15:30:19.927+0000","up_votes":1,"down_votes":1,"body":"If you think winning is luck, then how do you explain the people that are consistently Diamond/Challenger?","replies":[{"poster":"SelflessTeammate","date":"2015-05-13T16:32:13.184+0000","up_votes":1,"down_votes":0,"body":"Law(s) of large numbers. Very important concepts to know if you think that makes sense. It's incorrect.","replies":[]}]}]}]},{"poster":"SelflessTeammate","date":"2015-05-13T16:30:44.159+0000","up_votes":1,"down_votes":0,"body":"Well...Riot's matchmaking system isn't correct. It's disastrously flawed, weighted very heavily toward initial performance, and there have been rather convincing articles on that.\n\nWish I had a link to that Reddit thread describing why MMR doesn't work, and we should just get used to that until a new system is in place, which I'm all for, but in the meantime, just focus on the concept of enjoying yourself with an inherently flawed system.","replies":[]}]}]}]},{"poster":"SelflessTeammate","date":"2015-05-13T16:26:08.156+0000","up_votes":1,"down_votes":0,"body":"Actually, because it's a 5v5 and you're always only one player, that's nonsense. You win some and lose some in solo queue, completely regardless of how good you may or may not be. It doesn't matter how good you are, you're still going to lose a whole lot. There is no way around that unless you're an established, organized team with a group philosophy of how to go about things, which varies in solo queue and requires personal adjustment. Accommodating other players and how they go about things in the games you share is an integral part of the game.\n\nThis is a basic aspect of League that so few people get, it's almost overwhelming. What part of \"team game\" is confusing everyone? What part of \"it isn't first to 50 kills\" are people not understanding? There are no individual victories. None. It doesn't exist in the game.","replies":[]}]}]},{"poster":"Malix Farwin","date":"2015-05-12T21:26:21.742+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=13ennetto,realm=NA,application-id=3ErqAdtq,discussion-id=mcF1QHw8,comment-id=0000,timestamp=2015-05-11T21:11:43.704+0000)\n>\n> You aren't mastering a champion if you don't use it to win the game.\n\nyou mean like how a someone who goes 0/15 gets carried can get more then someone who goes 20/0 but loses because of trolls/afks?","replies":[{"poster":"GroundRuleDouble","date":"2015-05-13T14:18:36.250+0000","up_votes":2,"down_votes":0,"body":"I can come up with rare cases, too.","replies":[]}]},{"poster":"Photos of Ghosts","date":"2015-05-13T16:15:25.793+0000","up_votes":1,"down_votes":0,"body":"Well, if you did the most damage to structures, took a lot of damage without dying, interrupted enemy abilities / used a lot of CC, dealt tons of damage, provided vision, why should you get a fifth of what you get when you're shamelessly carried?","replies":[{"poster":"GroundRuleDouble","date":"2015-05-13T17:29:54.146+0000","up_votes":1,"down_votes":0,"body":"Because you didn't destroy the nexus.  All that doesn't matter if you don't destroy the nexus.","replies":[]}]}]},{"poster":"Ghostcrawler","date":"2015-05-12T18:22:03.191+0000","up_votes":13,"down_votes":8,"body":"The goal of the champion mastery feature wasn't supposed to be another version of ranked, because you know, we have ranked.\n\nInstead it's more about champion affinity. If you want to proclaim to the world that you are a Syndra main, or you really love Volibear, or you've played a shit ton of Akali, you can communicate that through champ mastery. Because League is a competitive game and the never-ending path to mastery is one of our [design values](http://na.leagueoflegends.com/en/news/game-updates/features/dev-blog-design-values-league-legends) we did want to incorporate skill as part of the feature, but it's not the entire feature.","replies":[{"poster":"LoZfan03","date":"2015-05-12T18:44:28.885+0000","up_votes":10,"down_votes":0,"body":"> [{quoted}](name=Ghostcrawler,realm=NA,application-id=3ErqAdtq,discussion-id=mcF1QHw8,comment-id=0010,timestamp=2015-05-12T18:22:03.191+0000)\n> Because League is a competitive game and the never-ending path to mastery is one of our [design values](http://na.leagueoflegends.com/en/news/game-updates/features/dev-blog-design-values-league-legends) we did want to incorporate skill as part of the feature, but it's not the entire feature.\n\nI'd never argue against winning factoring in because that opens the door to more self-focused behavior patterns rather than team/game-focused one.  And I know the exact ratio used is more or less moot from a numbers perspective because it matters more how things average out in the long term than from game to game.  However...the current balance **feels** too dramatically skewed, much like the first version of Party IP.  I could be way off due to limited sample size, but it seems like you receive around 0-300 mastery points based on performance and then +1000 or +0 points depending on if your team won or not.  Of course you want the victory reward to be high enough to incentivize good behavior, but hopefully you can understand people's frustration when a poor performer or even troll on a winning team is _guaranteed_ over _three times_ as many \"mastery points\" as you for even the best personal performance of your life during a losing game.","replies":[{"poster":"Mandaari","date":"2015-05-12T20:25:11.946+0000","up_votes":3,"down_votes":0,"body":"As a side note, I think this same argument applies to MMR gains and I agree with it entirely.","replies":[]}]},{"poster":"Axel Nightroad","date":"2015-05-12T21:16:32.779+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Ghostcrawler,realm=NA,application-id=3ErqAdtq,discussion-id=mcF1QHw8,comment-id=0010,timestamp=2015-05-12T18:22:03.191+0000)\n>\n> The goal of the champion mastery feature wasn't supposed to be another version of ranked, because you know, we have ranked.\n> \n> Instead it's more about champion affinity. If you want to proclaim to the world that you are a Syndra main, or you really love Volibear, or you've played a shit ton of Akali, you can communicate that through champ mastery. Because League is a competitive game and the never-ending path to mastery is one of our [design values](http://na.leagueoflegends.com/en/news/game-updates/features/dev-blog-design-values-league-legends) we did want to incorporate skill as part of the feature, but it's not the entire feature.\n\nBut it isn't even Champion Mastery. It is How Many Times Have I Won With This Champion?\n\nYou can go 25/3/25 or something ridiculous and still only gain like 200 points because you made a single mistake and lost the game. Meanwhile you can go 0/25/0 and gain 1000 points because you got carried. That doesn't sound like mastery. At all.","replies":[]},{"poster":"Neamean","date":"2015-05-12T19:42:06.366+0000","up_votes":2,"down_votes":1,"body":"\"League is a competitive game\" but not everyone play it competitively. Champion Mastery should be more focus on people who play the game for fun or for people who want to play the champ they love not to win or defeat the opponent. Champion Mastery shouldn't be heavily impact by wins or losses but the time and efficiency(k/d/a) with the champ. Also Champion Mastery should also be allow in Bot vs AI this however is base my opinion that Champion Mastery should be less about competitiveness and more about having a goal that isn't win or lose.  It would be like an RPG where you grind some level for your character. That's what Champion Mastery should be more about putting the time into the champ than beating the opponent.","replies":[]},{"poster":"Kürama","date":"2015-05-12T23:45:53.246+0000","up_votes":1,"down_votes":0,"body":"By the way, could you answer my question [here?](http://boards.na.leagueoflegends.com/en/c/miscellaneous/N3bmIFB3-can-top-champions-be-switched-changed)","replies":[]},{"poster":"DrNova","date":"2015-05-12T21:37:15.238+0000","up_votes":1,"down_votes":0,"body":"They need to take longer to get, however.  Seems to rank up pretty fast","replies":[]}]},{"poster":"Zavern","date":"2015-05-12T05:28:33.035+0000","up_votes":6,"down_votes":1,"body":"I haven't played any matches since this was released, but from what I've read of the forums it sounds like if I play a Support and play expertly but lose I will get less points if I play bad and win.","replies":[]},{"poster":"Vistha Kai","date":"2015-05-12T21:07:51.696+0000","up_votes":3,"down_votes":0,"body":"Getting +1k affinity just for winning is plain stupid, if max affinity from the grade is about 300.\n\nChampion Mastery? Ha ha ha. No.\n\nRiot wouldn't know what a \"fundamental flaw\" is, even if it hit them in the face.","replies":[]},{"poster":"Firestartertot","date":"2015-05-12T08:16:40.953+0000","up_votes":1,"down_votes":2,"body":"***","replies":[{"poster":"Occams Raiser","date":"2015-05-12T08:20:32.418+0000","up_votes":3,"down_votes":1,"body":"that is the last thing they want.","replies":[{"poster":"Vistha Kai","date":"2015-05-12T21:05:32.939+0000","up_votes":3,"down_votes":0,"body":"Then Champion mastery is the exact opposite of what it should be.\nI can feed my minds out, win somehow and get 3 times more affinity than doing my damnest hard and not being able to win.\nHow is that suppose to be a \"champion\" mastery?","replies":[]}]},{"poster":"SelflessTeammate","date":"2015-05-12T14:24:04.100+0000","up_votes":3,"down_votes":1,"body":"This is actually the exact opposite of what it should be about.","replies":[]}]},{"poster":"IcyPepper","date":"2015-05-11T21:56:54.143+0000","up_votes":3,"down_votes":1,"body":">or dramatically better k/d/a ratio. \n\nWhy is KDA the only thing you bring up? Pretty sure it calculates far more variables than that, especially considering skill is more than your kills, it's what you do with them.\n\nSkill is more than killing the enemy, it's about achieving victory.","replies":[{"poster":"Phoenix Kotori ","date":"2015-05-12T16:32:26.434+0000","up_votes":3,"down_votes":0,"body":">Skill is more than killing the enemy, it's about achieving victory.\n\nYes but I've gotten A-S ranks before in lost games but the gains are worse than a C in a won game, that seems silly to me.","replies":[]}]},{"poster":"FourVsFive","date":"2015-05-11T21:21:11.246+0000","up_votes":3,"down_votes":0,"body":"its just an achievement system really, play X amount of games and unlock emote or whatever.","replies":[]},{"poster":"Wickedfates","date":"2015-05-12T14:17:46.923+0000","up_votes":1,"down_votes":0,"body":"actually, the points you get for champion mastery are not based off of your personal ability with that champ.... it is based off of your teams combined contribution to some unknown goal.... sry.... only the letter grade is urs, and no one knows what that's based off of either... heres a link:\n\nhttp://boards.na.leagueoflegends.com/en/c/gameplay-balance/vY21rfOY-champion-mastery-too-affected-by-outcome?comment=0013\n\n Riot Mirross (NA)\n - 4 days ago\n\nHey there,\n\nTotally understand that there's some dissonance here when you get back to back results like this.\n\nWhen we're working on design and balance here we have a range of factors. Most importantly, we want games to stay healthy competitive environments where everyone is trying to do the same thing (namely: win.)\n\nWe don't want people off farming lanes while the team is doing Baron, or trying to steal kills, or any other weird behavior that's focusing on min-maxing Champ Mastery rather than winning the game. For this reason, your champion points are based on your overall team's performance. We'll keep looking at the specific balancing and see if it needs tweaking.\n\nWe also want to be able to give you feedback on how well you're doing, and that's what we have the performance grades for - S through D. They compare how well you did in the game with everyone else in your region on that Champion and position (e.g. Rek'Sai jungle).\n\nGiving goals and feedback based on individual performance is a really interesting space that we may well move in to in future - we just have to be really careful about how we do it. Suggestions are welcome! :)","replies":[{"poster":"Randomonium","date":"2015-05-12T14:34:52.236+0000","up_votes":4,"down_votes":1,"body":"Doesn't change the fact that champion mastery should be about how well you do with a champion, not whether you win or lose. I shouldn't get more points winning with a C champion than I get losing with an S champion. That just doesn't make any sense.\n\nRiot could very easily make the system reward actual skill. The system could look at kill participation, turret damage, dragon/baron involvement, etc. Players  can't abuse the system if they don't know what factors are most important.","replies":[]}]},{"poster":"DrCyanide","date":"2015-05-12T14:34:37.051+0000","up_votes":2,"down_votes":0,"body":"The only S I got was when I lost the game. I'm pretty sure there are a lot more factors than win/loss being used.","replies":[{"poster":"thePandev","date":"2015-05-12T18:24:56.472+0000","up_votes":2,"down_votes":0,"body":"Except regardless of the S, you still get a lower amount of points than something like a C+ and a win. \n\nS and loss = 300 ish?\n\nSub par grade C+ for ex. and win = 1000 ish","replies":[]}]},{"poster":"Strawberrycocoa","date":"2015-05-12T14:16:06.308+0000","up_votes":2,"down_votes":0,"body":"Skill is not a measurable thing. You can't numerically or statistically track or validate \"skill\". The game can, however track data that shows hard numbers like \"gold earned\" \"deaths taken\" and \"won the game\".\n\nThe Champion System is fluff to create an illusion of progress for the players that get frustrated and feel like their \"LoL career\" isn't going anywhere.","replies":[]}]}