{"poster":"Tokijin","date":"2015-09-08T14:43:34.914+0000","title":"ma che succede??","subforum":"Discussioni generali","up_votes":1,"down_votes":5,"body":"sono abbastanza perplesso su come stanno cambiando le cose in game....\r\ncosa si stanno fumando alla riot? ma sul serio, che problemi hanno?\r\n\r\nIo ero rimasto del fatto che un tank,ripeto tank, non facesse una mazza di danno ma poteva prendere una barcata di danni per ingaggiare. Ora che schifo &egrave; successo? ti buildi danno salute e non ti butta gi&ugrave; piu nessuno? ma scherziamo?\r\n\r\nPrendo un esempio pi&ugrave; lampante cio&egrave; Garen...ma ci rendiamo conto dello schifo che stanno combinando?\r\nCapisco che a livello competitivo vengono giocati 2 campioni messi in croce ma dio mio cosi &egrave; un pelino esagerato eh\r\n\r\nbho, mi sfogo ma rimango sempre dubbioso quando escono le patch.","replies":[{"poster":"Ringiel","date":"2015-09-08T15:11:12.321+0000","up_votes":2,"down_votes":0,"body":"l'unico buff che ha ricevuto garen è stato sull'ulti quando viene utilizzata su un champ con la passiva,il resto è stato un nerf ... chiusa questa parentesi,è da quando è uscito il cinderhulk che i tank fanno troppi danni,e anche se la situazione è un pelino migliorata con il devourer(prima c'erano partite anche con 4 tank),finchè non verranno cambiati gli item per gli adc i tank rimarranno sempre al centro del meta ...","replies":[]},{"poster":"luxetumbra","date":"2015-09-08T15:50:54.596+0000","up_votes":2,"down_votes":1,"body":"garen attualmente è un problema perchè gli hanno buffato i danni (la e fa il 10% della vita massima del campione marchiato senza contare il danno base della spell), partendo dal pressuposto che fosse facile da kitare e poi gli hanno dato {{item:3071}} {{item:3742}}  cosi da avere più movement speed di yi in ulti buffato dalla passiva di janna, e {{item:3748}} cosi da avere danni che scalano sui tuoi hp massimi cosa che garen builda principalmente visto che la w gli da resistenze a gratis, gj riot.\nquesto è lo stesso problema che si ha con tutti i tank, olaf è particolarmente divertente con {{item:3742}}  {{item:3800}}  ed r ti arriva addosso come un treno, un amore.\ntutti i buff diretti e indiretti uniti alla semplicità del champion lo rendono devastante in mano a chiunque.","replies":[{"poster":"BrattishSolid6","date":"2015-09-08T20:19:50.072+0000","up_votes":1,"down_votes":0,"body":"> (la e fa il 10% della vita massima del campione marchiato senza contare il danno base della spell)\n\nLa passiva della R fa sì che ogni AA e ogni tic della E sul villain infliggano l'1% dei suoi hp max. Ergo, dipende da quanto sia maxata la E, da quanti tic il nemico effettivamente subisce, e ricordo che ci può essere un solo villain alla volta.\n\n> visto che la w gli da resistenze a gratis, gj riot.\n\nLa passiva della W conferisce 0,25 armor e magic resistence per unità uccisa, fino a un massimo di 30 punti. Significa che per raggiungere questo massimo si deve farmare 120 minion. La W premia se farmi, se non sai farmare o se il nemico ti nega il farm, i punti aggiuntivi te li scordi.\n\nPoi concordo sul fatto che ora sia decisamente forte, ma ci sono champ capaci benissimo di vincere una lane contro di lui (Shen, Darius, Singed, chiunque abbia un buon poke che neghi la sua passiva). Inoltre Garen si basa esclusivamente sul combattimento ravvicinato. Mettilo in top contro Quinn o contro Vayne, vediamo cosa riesci a fare.","replies":[{"poster":"luxetumbra","date":"2015-09-08T21:42:44.700+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=BrattishSolid6,realm=EUW,application-id=MJVj50Jw,discussion-id=AAXQcc6A,comment-id=00040000,timestamp=2015-09-08T20:19:50.072+0000)\n\n> Poi concordo sul fatto che ora sia decisamente forte, ma ci sono champ capaci benissimo di vincere una lane contro di lui (Shen, Darius, Singed, chiunque abbia un buon poke che neghi la sua passiva). Inoltre Garen si basa esclusivamente sul combattimento ravvicinato. Mettilo in top contro Quinn o contro Vayne, vediamo cosa riesci a fare.\n\nSai qual'é ora il grosso problema della lane contro garen é che se lo uccidi diventi il villajn se diventi il villain lui non può più perdere un trade contro di te e quindi un'azione che ti dovrebbe portare vantaggio ti mette in svantaggio.\nPer fortuna dovrebbero sistemare questa cosa con la prossima patch.\nIl secondo problema con garen ora é il late dove grazie ai nuovi item diventa quasi impossibile da kitare, ma quello é dovuto principalmente alla malsana quantità di forza che hanno dato ai nuovi item, speriamo che dopo essersi goduti dei mondiali dove tutti i toplaner faranno: {{item:3748}} {{item:3053}} {{item:3742}} e faranno i danni di un carry lì nervino riportando di conseguenza tutti i champion che come garen possono abusarne a valori accettabili.","replies":[]}]}]},{"poster":"Aramanthis","date":"2015-09-09T06:33:13.432+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=AnarcoSqualo,realm=EUW,application-id=MJVj50Jw,discussion-id=AAXQcc6A,comment-id=,timestamp=2015-09-08T14:43:34.914+0000)\n> Prendo un esempio pi&ugrave; lampante cio&egrave; Garen...ma ci rendiamo conto dello schifo che stanno combinando?\n> Capisco che a livello competitivo vengono giocati 2 campioni messi in croce ma dio mio cosi &egrave; un pelino esagerato eh\n\nallora ora rispondo e cerco di essere calmo....\nMA PORCA DI QUELLA CAZZO DI MISERIA COME PUOI NOMINARE GAREN!!!! CHE HA PURE RICEVUTO UN CAZZO DI NERF! E TRANQUILLO E SOLO FORTE PER VIA DI TRE CAZZO DI ITEM SGRAVI CHE NERFERANNO E SI SA GIA CHE FINE FARA' GAREN! VERRA MESSO NEL DIMENTICATOIO, DI NUOVO!\n\n._. detto questo, oh se le prendi da Garen scusa ma sei un pò nabbetto te, e facile da battere :|","replies":[{"poster":"Tokijin","date":"2015-09-09T11:05:45.607+0000","up_votes":1,"down_votes":0,"body":"magari te sei \"bravo\" e te lo sai gestire ma sei hai un top che te lo fidda te cosa pretendi di fare?\nPS: ho preso come ESEMPIO Garen ma ce ne sono molti altri che sono osceni ora :)","replies":[]}]},{"poster":"Dantazzo","date":"2015-09-08T14:48:34.402+0000","up_votes":1,"down_votes":0,"body":"Secondo me il problema è questo oggetto {{item:3748}} che è troppo sopra le righe.\nPer il resto se li buildavi con un pò di cervello anche prima molti tankoni facevano tanti danni ed erano molto resistenti.","replies":[{"poster":"Shàdows","date":"2015-09-08T15:08:56.182+0000","up_votes":1,"down_votes":1,"body":"guarda che  su garen non lo mai usato e cazzo ho arato sempre  quando lo giocato ma non mi sembra giusto che siano cosi sblianciati\n\ne hai ragione anche questo item e troppo forte lo devono nerfare","replies":[]}]},{"poster":"Shàdows","date":"2015-09-08T15:07:23.345+0000","up_votes":1,"down_votes":1,"body":"ho fatto una partita prima con garen ed e assurdo davvero snowallawo di brutto andavo contro 5 ucccidevo l adc e me ne andavo  con meta vita\ne stato easy  mi hanno gankato in 4 top a livello 6 ci sono morto ma 2 me li sono portati con me ceh veramente e assurdo devono blianciarl sto cazzo di gioco gia i tank a inzio season erano forti adesso bhe se giochi  tipo darius top garen mid olaf junlger nasus adc e mordekaiser support vinci il game easy perche non ti fanno danno ma tu ne fai tanto a loro e pure troppo \nspero che lo bilanceranno nella 5.18","replies":[]},{"poster":"Tokijin","date":"2015-09-08T14:52:32.278+0000","up_votes":1,"down_votes":1,"body":"bho io non so più che pensare...mi scoccia bannare campioni che prima te li sapevi gestire e ora fanno quello che vogliono per la mappa..mha","replies":[]}]}