{"poster":"Mayoné","date":"2019-03-10T23:54:58.832+0000","title":"Suspensión por 14 días sospechosa","subforum":"Comportamiento del jugador","up_votes":4,"down_votes":8,"body":"Buenas noches.\r\n\r\nVengo a comentarles algo. \r\n\r\nMe suspendieron 14 días la cuenta. Por \"tóxico\" como lo llaman ustedes.\r\nSi, lo admito, no soy el más amigable, acepto la suspensión, todo bien.\r\nAhora, me llamó la atención que la partida exacta por la cual me suspendieron, y fue solo por esta partida (es lo que me muestra el cliente cuando entro), \r\nfue cuando le comenté a otro jugador que 2 de los nuestros parecían bots: nunca hablaron, nunca pingueaban, no reaccionaban a los pings, iban siempre juntos.\r\n\r\nLes dejo el extracto de la conversación:\r\n\r\nDespués de la partida\r\nMayoné: Te di honor Ornn\r\nMayoné: Jugaste bien\r\nMayoné: El mid fedeado y se suicidaba\r\nMayoné: Bot...no sé, creo que son bots\r\nMayoné: Igualmente\r\nMayoné: Suele pasar\r\nMayoné: Cuando venis bien\r\nMayoné: Te ponen con tipos muy malos\r\nMayoné: Como ese bot\r\nMayoné: Ni escribian\r\nMayoné: Para mi eran bots\r\nMayoné: Suerte\r\n\r\nAcepto la suspensión (ni insulté, como mucho le habré dicho \"horrible\" a uno), pero esto me pareció cuanto menos sospechoso.\r\nIgualmente mejor, esto está cada vez más injugable. No me viene mal dejarlo.\r\n\r\nSaludos.","replies":[{"poster":"Senkess","date":"2019-03-11T00:00:00.665+0000","up_votes":4,"down_votes":1,"body":"\"extracto\" osea que la cortaste, pone el chat completo maquinola","replies":[{"poster":"Mayoné","date":"2019-03-11T00:04:36.859+0000","up_votes":1,"down_votes":2,"body":"Va el chat entero. Es bastante largo, por eso no lo puse en el original. Te soy sincero aparte, he tenido partidas que fui más \"tóxico\".\n\nIgualmente, aclaré que no me quejé de la suspensión. Me parece una estupidez lo de \"tóxico\" (ni siquiera insulté, existe la opción de mutear, hasta un filtro de insultos tenés), pero acepto las reglas.\n\nEl chat:\n\nPartida 1\nEn partida\nMayoné: DALE PAPUS\nMayoné: A BOS\nMayoné: Y SI MIRA TU NOMBRE\nMayoné: YA PERDIMOS\nMayoné: antes kata, reacciona\nMayoné: vamos igual\nMayoné: te dije que eras horrible\nMayoné: muteado\nMayoné: tira papu, está en bot\nMayoné: soy un rammus, que voy a hacer ahi?\nMayoné: jajaja miren lo que dice, es genial\nMayoné: terrible\nMayoné: no se si tomarlo en serio o me esta jodiendo\nMayoné: mira lo que dice JAJAJ\nMayoné: GRACIAS MAESTRO\nMayoné: Y chilenos fedeando, nada nuevo\nMayoné: son mas malos que comer de la basura\nMayoné: que dice\nMayoné: que haces kata?\nMayoné: es malo, no le dejes nada\nMayoné: no debes saber ni lo que es un dolar\nMayoné: si tenes 13 años\nMayoné: tranqui nene no te voy a discutir\nMayoné: sos menor\nMayoné: todas las linea smal\nMayoné: nada que hacer\nMayoné: si no ganan el 1 vs 1 el jg no puede hacer magia\nMayoné: son malos, que queres que haga?\nMayoné: magia no hago\nMayoné: mira como se regalan\nMayoné: ninguno gano un 1 vs 1\nMayoné: miralo al ornn\nMayoné: no se entero de nada el ornn\nMayoné: siguio farmeando\nMayoné: JAJAJ\nMayoné: al pedo te fedeo kata\nMayoné: me quedo en base\nMayoné: me aburri\nMayoné: No sos el peor, no entendes mucho el juego nomas\nMayoné: El peor lejos es el jihn\nMayoné: no entiende nada\nMayoné: mira las botas que se compra\nMayoné: El jhin dije papu\nMayoné: los dos full vida\nMayoné: y se van\nMayoné: si fedean a todos solo no puedo\nMayoné: mira el bot lo que va\nMayoné: flaco el jg iba igual que yo\nMayoné: te ganaba solo el kled\nMayoné: la pierde bot igual ornn, tranquilo\nMayoné: no sos tan malol, simplemente no entendes que con 2 lineas horribles el jg no puede hacer nada\nMayoné: la fedeo a kata y no sabe jugar\nMayoné: no tengo la culpa\nMayoné: te estoy explicando\nMayoné: que decis\nMayoné: no tengo jg\nMayoné: y me canse de gankear a kata\nMayoné: fedeo a kata\nMayoné: y resulta que es mala\nMayoné: que queres que haga\nMayoné: una buena kata ya nos hacia ganar\nMayoné: como iba a saber yo\nMayoné: que es malo\nMayoné: le explicaba al ornn\nMayoné: que no es mi culpa\nMayoné: fedear al mid\nMayoné: y que resulte malo\nMayoné: otra kata con 4 kills de ventaja ya nos hacia ganar\nMayoné: Esta es horrible\nMayoné: Si empezara la partida de nuevo ni en pedo gankeo a esta kata\nMayoné: sabiendo lo malo que es con ventaja\nMayoné: toy boludeando hace rato\nMayoné: me da paja\nMayoné: te di 4 kills\nMayoné: y te suicidabas\nMayoné: te vi\nMayoné: ok no entendes mucho, no te explico mas\nMayoné: comparas el daño de una kata con un rammus\nMayoné: oka","replies":[{"poster":"Mazoku","date":"2019-03-11T00:05:37.146+0000","up_votes":3,"down_votes":1,"body":"Bien aplicado. Ojala recapacites en estos 14 dias o te vayas a otro juego.","replies":[{"poster":"Mayoné","date":"2019-03-11T00:07:00.886+0000","up_votes":1,"down_votes":6,"body":"Si, nunca dije que estuvo mal aplicado. De hecho el tema del posteo no es ese. \nY si, me voy a ir otro juego, no tengas ningún tipo de duda. Esto está cada vez más parecido a un jardín de infantes que nunca.","replies":[{"poster":"PCtronix","date":"2019-03-11T00:10:37.584+0000","up_votes":3,"down_votes":0,"body":"entonces cual seria el tema del post ? ya que como titulo tienes \" Suspensión por 14 días sospechosa \"  y a la vez cortas parte del chat para pasar como \" no toxico \" ..","replies":[{"poster":"Mayoné","date":"2019-03-11T00:13:07.675+0000","up_votes":1,"down_votes":3,"body":"Fijate que a otro comentario más arriba le respondí con el chat completo.\n\nSi, fui \"tóxico\" para los estándares de este juego. \nTe parece que lo que dije amerita 14 días de suspensión? Es lo que escribe el 80% de la gente en todas las partidas.\n\nA mi al menos me llamó la atención.","replies":[{"poster":"PCtronix","date":"2019-03-11T00:20:30.661+0000","up_votes":4,"down_votes":0,"body":"en verdad .. si solamente es por esa \" estrofa \" igual tienes el ban, si vieras mas amenudo los bans de chats que caen aca en los foros, te sorpende lo que puedes NO decir ...","replies":[{"poster":"Mayoné","date":"2019-03-11T00:24:06.919+0000","up_votes":1,"down_votes":2,"body":"Creo que están demasiado estrictos con este tema, como que están apuntando a un público muy \"infantil\", dejando de lado lo competitivo. \n\nCosa de ellos igual, es su juego. Solamente estaría bueno que hagan algo más discriminado, una cola de ranked con cierto KDA, o algo \"abierto\" en donde te haces responsable de lo \"tóxico\" que pueda ser el chat. Como en el 99% de los juegos.","replies":[]}]},{"poster":"Excorpion","date":"2019-03-11T01:28:51.332+0000","up_votes":3,"down_votes":1,"body":"Si es de 14 días, es por que tienes sanciones anteriores o te reportaron mucho.","replies":[]}]}]},{"poster":"Mazoku","date":"2019-03-11T00:08:51.369+0000","up_votes":3,"down_votes":1,"body":"> Si, nunca dije que estuvo mal aplicado. \n\n-------\n\n> Esto está cada vez más parecido a un jardín de infantes que nunca.\n\nSi, respetar las reglas es una de las cosas que enseñan en el jardin de infantes.\n\nDesafortunadamente no todos son capaces de incorporar ese conocimiento como evidencia este hilo.","replies":[{"poster":"Mayoné","date":"2019-03-11T00:11:27.121+0000","up_votes":1,"down_votes":3,"body":"Tenés razón, hay que respetar las reglas por más estúpidas que sean. Lo digo en serio.\n\nTe repito de nuevo igual, el tema de mi posteo no es ese. Es lo sospechoso del ban justo cuando comento lo de los bots.\n\nSaludos.","replies":[{"poster":"Mazoku","date":"2019-03-11T00:13:24.936+0000","up_votes":3,"down_votes":0,"body":"> Es lo sospechoso del ban justo cuando comento lo de los bots.\n\nNo es sospechoso para nada. Venias toxiqueando como un campeon y te cayo un ban despues de dios sabe cuantos games arruinaste.\n\nEl sistema funciona por acumulacion y validacion de los reportes. Que te muestren un game no significa que solo fuiste toxico en ese, es sentido comun.\n\nSaludos.","replies":[{"poster":"Mayoné","date":"2019-03-11T00:16:35.960+0000","up_votes":1,"down_votes":3,"body":"Puede ser, cuando entro me muestra sólo esta partida como causante del ban. \n\nEn mi opinión, arruinar un game es fedear a más no poder o trollear una línea a próposito. No decirle \"horrible\" a uno.\n\nPero bueno, sobre gustos no hay nada escrito. A mi me gusta competir, a otros charlar con la gente.","replies":[{"poster":"Mazoku","date":"2019-03-11T00:20:05.398+0000","up_votes":3,"down_votes":1,"body":"> Puede ser, cuando entro me muestra sólo esta partida como causante del ban.\n\nNo, te muestra un game como prueba irrefutable de que fuiste toxico. No significa que esa partida fue el unico causal del ban.\n\n> En mi opinión, arruinar un game es fedear a más no poder o trollear una línea a próposito. No decirle \"horrible\" a uno.\n\nEn mi opinion ademas de esas formas de arruinar los games que mencionas estan los que spamean el chat amenazando a sus compañeros.\n\n> Pero bueno, sobre gustos no hay nada escrito. A mi me gusta competir, a otros charlar con la gente.\n\nMas que competir diria que te gusta abusar verbalmente de los demas antes que jugar LOL.","replies":[]}]}]},{"poster":"Paco87","date":"2019-03-11T00:14:06.597+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Mayoné,realm=LAS,application-id=PJAKt7ph,discussion-id=EmbAlWFA,comment-id=000000000000000000000000,timestamp=2019-03-11T00:11:27.121+0000)\n>\n> Tenés razón, hay que respetar las reglas por más estúpidas que sean. Lo digo en serio.\n> \n> Te repito de nuevo igual, el tema de mi posteo no es ese. Es lo sospechoso del ban justo cuando comento lo de los bots.\n> \n> Saludos.\n\nYo creo que es mera casualidad.","replies":[]}]}]}]}]},{"poster":"Jaraseki","date":"2019-03-11T00:05:38.291+0000","up_votes":2,"down_votes":1,"body":"Merecido jaja saludos","replies":[]}]}]},{"poster":"Paco87","date":"2019-03-11T00:06:02.906+0000","up_votes":2,"down_votes":0,"body":"Si NO reportaste por \"Trampa\" a ambos al final de la partida,\ny todavía no abriste un ticket pidiendo se revise tu caso para ver si realmente amerita 14 días suspendido,\nentonces podés perfectamente [ir al Soporte](https://support.riotgames.com/hc/es-419/requests/new),\npidiendo que se analice esa partida en cuestión, porque sospechás de que \n2 de tus compañeros en realidad eran \"bots\";\ny en el mismo también solicitar se revise tu chat.\n\nComo son 2 \"Tipos de solicitud\" distintos,\nyo pondría Tipo: \"Restricciones de chat y suspensiones de cuenta\",\ndespués llenaría bien todos los datos que me piden,\ny luego sí, pediría que se revise mi chat, y también la partida en cuestión por el tema de los bots.\n\nUn saludo bro!\n\nPD: Ni intentes que se revise tu chat, si hubo claros insultos u hostigamientos de tu parte,\npero en ese caso igual podés reportar a los supuestos bots.\n\n**EDIT:** Ahora ví en los comentarios las cosas que escribiste en la partida.\nPodés intentarlo jaja, pero no te garantizo nada.\nDe todas formas, podés por ejemplo, apelar a que te parece muy severa,\ny solicitar que sea de 7 dias, o de 25 partidas.","replies":[{"poster":"Mayoné","date":"2019-03-11T00:09:22.174+0000","up_votes":1,"down_votes":1,"body":"Si, fui tóxico. Le dije \"horrible\" a uno un par de veces y a otro que \"no entendía nada\". No me parece que amerite una suspensión de 14 días eso, pero bueno, su juego sus reglas. Olvidate que me den bola.\n\nSimplemente, repito, fui mucho más \"tóxico\" otras partidas y nada. En esta, que comento lo de los bots, me como un ban de 14 días.\n\nCuanto menos, sospechoso. Ojalá no borren en este post cuando lo vean.\n\nSaludos.","replies":[]}]},{"poster":"Holy Jacker","date":"2019-03-11T11:49:51.963+0000","up_votes":2,"down_votes":1,"body":"cualquiera el post , de que te quejas?","replies":[]}]}