{"poster":"Nightcristal","date":"2015-04-03T19:25:25.359+0000","title":"Des´kavcer","subforum":"Skin- & Champion-Konzepte","up_votes":0,"down_votes":0,"body":"Konzept Idee /=noch nicht ganz ausgereift\n\nMeine Idee w&auml;re der Champion Des&acute;kavcer ,ein Wesen von menschlicher Statur das eine gl&auml;nzende R&uuml;stung an hat ,zwischen den R&uuml;stungsplatten sind kleine und gro&szlig;e Abst&auml;nde aus denen eine schwarze Materie tropft und zwar senkrecht nach oben ,dort verschwindet diese dann nach ca. 1 Meter. Seine R&uuml;stungsplatten sind ab und an auch mit stacheln best&uuml;ckt. Dar&uuml;ber hinaus sieht man keinen Fetzen seinen Gesichts obwohl dies der ein zigste teil seines K&ouml;rpers ist der ohne R&uuml;stungsplatten oder schwarzer Materie ist. Dort ist eine dunkel grau Kapuze in der nichts ist als Finsternis.\n\nTop bzw. Mid Champion\n\nStroy/Geschichte : (vielleicht ein Wesen der Leere oder eine Verbindung mit Nocturne w&auml;ren logisch oder interessant.)\n Des&acute;kavcer war ein normaler Mensch mit dem Namen Desmond  viele Eigenschaften hatte er allerdings nicht er war nicht besonders Stark oder Klug aber auch nicht aggressiv dennoch war sehr gl&auml;ubig nachdem ihn die M&ouml;nche von Demacia aus all ihren Kl&ouml;stern warfen (Grund: er interpretierte die Geschichten Falsch oder beleidigend) errichtet er auf dem Land seine eigenen Gemeinde da diese aber nach ein Paar Jahren als Sekte oder Kultustische Bewegung angesehen wurde Verliesen viele Leute die kleine Gemeinde von Desmond. Die viele Arbeit die er hineingesteckt hatte , &uuml;ber Jahre und das Geld machten ihn nun da es niemand den mehr gab der in seiner Gemeinde war Arm , w&uuml;tend und verzweifelt fra&szlig; sich die Wut und die er all die Jahre angestaut hatte durch seinen K&ouml;rper wie ein Wurm durch Erde.So Alls er nach all diesen Jahren auf der Stra&szlig;e seine gesamte Wut hinaus schrie erh&ouml;rten ihn seine G&ouml;tter ,dass glaubte er zu mindestens den Alls der schwarze Engel hinabstieg und ihn mit nahm auf eine Schwebende Insel weit weit &uuml;ber den Schatteninseln dort wurde Desmond ein kr&auml;ftiger und Starker Mann mit einer schimmernden R&uuml;stung  mit dem Auftrag der Engel die Leute zu Bekehren streifte Desmond durchs Land ,so Alls er nach vielen weiteren Jahren erfolglosen Bekehrens sich entschloss ein Experiment zu wagen: Er nahm schwarze Essens aus den Meeren der Schatteninsel (das Wasser dem Nautilus seinen K&ouml;rper verdangt hatte )und Magie sowie andren Ritualen. Er wollte die Leute nun Bekehren , egal auf welche Weise .So wurde er wieder geboren als Des&acute;kavcer ,der Bekehrer .\n\nMotto: Der Glauben ist meine Schild ,die Magie meine Waffe ,mein K&ouml;rper ein Diener des Vollendeten.\n\n\nPassive: Schatten Sprint, jeder dritte erlittene Schaden gibt ihm mehr Lauftempo (die h&auml;lfe von Geist bspw. ) / Nahe Dunkleheit, je näher De´kavcer an seinem Gegner (Vassalle,Monster,Champion,Turm) ist desto mehr Schaden macht er seinem Gegener (es erhöt sich pro. Stufe)\n\nQ: Erzeugt aus den aufsteigenden schwarzen tropfen eine Kugel mit stacheln die Des&acute;kavcer auf Gegner werfen kann trifft sie bekommt Des&acute;kavcer die H&auml;lfte der Kugel zur&uuml;ck , diese kann er erneut abschie&szlig;en oder warten auf die n&auml;chste Q, (2 komplette Kugel , kumulativ )  =Magischer Schaden.\n\nW: Des&acute;kavcer springt in die Luft und Verharrt dort (bspw. 5 s. ) da er aus den schwarzen Tropfen Fl&uuml;gel entstehen l&auml;sst Von dort aus hat er 50% mehr Sicht , auch &uuml;ber Mauern kann er fliegen trotzdem ist er angreifbar erh&auml;lt Des&acute;kavcer Schaden in H&ouml;he (?) st&uuml;rzt er zu Boden , wo er noch einmal Fl&auml;chenschaden anrichtet .Seine Q Kugel richten von dort oben doppelten Schaden an, falls er E aktiviert hat ist sein n&auml;chster Angriff im Teleport Gebiet ein Sturzflug der den Gegner  schaden zuf&uuml;gt und bet&auml;ubt und verlangsamt ( oder zum schweigen bringt ) = Magischen Schaden\n\nE: F&uuml;r kurze 10 s. Kann sich Des&acute;kavcer in einem Bestimmten gibt herum Teleportieren ,wenn er am Ziel ist wird er f&uuml;r 1 sek. Unsichtbar , das steigert sich je &ouml;fter er sich im Vorbestimmten Radius herum Teleportiert. Sollte er allerdings getroffen werden wird die E sofort abgebrochen. Und alle Baffs verschwinden (Blue Baff, ...)\n\nR: Des&acute;kavcer umh&uuml;llt sich selbst mit der dunkler Materie , Sodass sich seine Leben verdoppeln  seine R&uuml;stung und seine Magieresistens steigen je nach Lvl. an (oder % ), dadurch wird er 3 mal so gro&szlig; und seine Q Kugel Fliegen doppelt so weit .Teleportieren mit der W kann er weiterhin nur das dies nicht mehr Unsichtbarkeit mit der Zeit gibt sondern F&auml;higkeitsst&auml;rke , seine W funktioniert auch anders , durch die Schwarzen Fl&uuml;gel kann er sobald er erneut die W einsetzt kurz zu Boden Springen und in einem gro&szlig;en Radius schaden anrichten.Die er h&auml;lt ca. 2 min. ( hat dementsprechende Abklingzeit )Nach einsetzen der R ist Des´kavcer verlangsamt und hat (wenn nicht weniger) die hälfte der Leben.\n\nDes&acute;kavcer normaler angriff sieht aus als ob er seine Hand ( &auml;hnlich Darth Vader ) ausstreckt und kurz durch die Luft Greift , er ist dementsprechend ein Fernk&auml;mpfer.\n\n\nDa ich nicht viel Ahnung von den verschiedenen Werten habe habe ich es gleich gelassen , falls ihr eine Idee habt oder auch mit den Werten besser auskennt schreibt es mir bitte.\n\nB. (R&uuml;ckruf): Des&acute;kavcer kniet sich hin und blickt in den Himmel kurz vor Ende erzeugt er schwarze Materie Fl&uuml;gel und verschwindet.\n\nWitz/Joke: Etwas wie:Wenn Licht so gut ist warum bekommt man dann Sonnenbrand oder wird Blind wenn man in die Sonne schaut , na ? Na? NAAAAAAAAAA?\n\nSagt wenn man Rabadons Todeshaube gekauft hat: Ein Hut der Macht , ein Hut der auf ewig mein sein soll !\nSagt wenn man Dorans Ring gekauft hat: Ein Ring, sie zu knechten, sie alle zu finden,\nIns Dunkel zu treiben und ewig zu binden . / Herr der Ringe Anspielung\n\nVerbesserungs Vorschl&auml;ge und Kritik (Positiv wie Negativ) ist erw&uuml;nscht :D\n\nHoffe Des&acute;kavcer gef&auml;llt euch auch...","replies":[{"poster":"GTB Ceratius","date":"2015-04-03T20:46:04.359+0000","up_votes":1,"down_votes":0,"body":"2 Minuten doppeltes Leben, Doppelte Resistenzen, 3fache Größe? \"Leicht\" OP. Ganz leicht.\n10 Sekunden so oft durch die Gegend springen wie man will? Auch extrem stark.\nAllgemein klingt das Ganze nach etwas ziemlich unbesiegbaren.","replies":[{"poster":"Nightcristal","date":"2015-04-03T20:53:13.819+0000","up_votes":1,"down_votes":0,"body":"Hab ihn herunter geputscht. Sag bitte auch wie ich ihn weniger Op machen kann, danke weiterhin für die Kritik{{summoner:31}}","replies":[]}]},{"poster":"XExEcUtOrX04","date":"2015-04-03T20:29:28.702+0000","up_votes":1,"down_votes":0,"body":"Schonmal daran gedacht das er mit der ult einfach mal 400 rüstung und 300 magieresi haben kann, dann kriegt den keiner mehr tot ( vorallem wenn das Leben auch noch verdoppelt wird)","replies":[{"poster":"Nightcristal","date":"2015-04-03T20:42:16.560+0000","up_votes":1,"down_votes":0,"body":"Oh, danke für den Hinweis das sich Rüstung und Magieresistenz verdoppeln habe ich jetzt geändert. Danke :D{{item:3098}} {{item:3416}} {{item:1038}} ","replies":[]}]}]}