{"poster":"GacamayoReaper","date":"2017-07-01T20:36:16.233+0000","title":"corrupción  conflictos de intereses  posible lucro  y falta a a probidad  en  ulol duoc viña del mar","subforum":"Torneos y Eventos de la Comunidad","up_votes":16,"down_votes":9,"body":"Porque en la casa de estudios de Ulol duoc es una verdadera mafia hay conflictos de intereses, falta a la probidad, la organizadora y sus organizadores en ves de hacer algo correctamente se apoya fielmente en ellos mismo con voz y voto , no respetan las reglas establecidas en los torneos, adem&aacute;s de las malas practicas en la organizaci&oacute;n e influencias, meda mucha pena por que tengo un poco de miedo por el mal clima que ya se genero pero, por ordenes del los organizadores debemos callar y quedar de acuerdo por la gran influencia que tienen, y nos dicen esto queda ac&aacute; y no sale para ning&uacute;n lado es como decir &quot;aqu&iacute; no ha pasado nada&quot; , me siento pasado a llevar por mis derechos de comunicar y adem&aacute;s me est&aacute;n negando expresamente el derecho de expresarme debidamente como ocultando y pasando por alto todo, siento que est&aacute;n vulnerando un derecho que es hablar pero, no me quedare callado , comento que el equipo de los organizadores juega en el torneo (a excepci&oacute;n de la organizadora ) siendo que no puede ser as&iacute; , por las reglas de Ulol que indica explicita mente y la organizadora avala todo esto y apoya en vez de colocar un freno, sigue adelante con su dictadora posici&oacute;n, adem&aacute;s de ser prueba viviente de todo lo que hacen realmente y el oscuro panorama que presenta no me siento seguro de ir al rifrivals que proponen, ya que el evento no se realiza en la casa de estudios duoc vi&ntilde;a del mar sino mas bien en un local , por lo que tengo entendido leyendo las reglas es en la casa de estudio por lo que me da a entender, adem&aacute;s seria poco l&oacute;gico Ulol en otro local que en la casa de estudios ( Ulocal , Urestobar) y se da para otras cosas pero, ellos est&aacute;n lucrando de alguna manera la cual no sabemos con exactitud, nos cobran 1000 por concepto entrada ya que es para no sobre poblar el local y que llegue mas gente ,la cual cancela y por lo tanto, no nos dan ning&uacute;n comprobante, y que en la entrada el dia del evento podemos entrar al local con nuestro Rut aun restobar presentando nuestro CI el cual llevan un registro pidiendo nuestros datos al adquirir una entrada a todo los organizadores involucrados, adem&aacute;s por la entrada pagada sin comprobante de la transacci&oacute;n, por que nos cobran ? la raz&oacute;n es por que est&aacute;n pagando el arriendo del local, siendo que revisando en otras universidades, como argentina ,ecuador , y Chile, Santiago espec&iacute;ficamente que est&aacute;n registrados en Ulol el evento del rifrivals, los eventos que estaba viendo la entrada es liberada y la hacen a todo publico, incluso algunos eran desde los 7 a&ntilde;os en la casa de estudios de argentina o en otras adem&aacute;s de ser de entrada liberada hay compromiso por parte de la organizaci&oacute;n y la casa de estudio stans y muchas cosas mas , ademas indicaban que se proyectar&iacute;a en un auditorio y se hace todo en un marco de comunidad, se nota discriminaci&oacute;n en ves de juntarnos como comunidad nos dispersan no todos tiene los medios y adem&aacute;s la lejan&iacute;a de esta , sin mencionar que tengo que tomar 2 buses para lograr llegar a otra ciudad para el evento de rifrivals , siendo que si se hubiese hecho en la casa de estudios no tendr&iacute;a que ir tan lejos y solo tomar mi cotidiano bus, as&iacute; se trabaja en Ulol vi&ntilde;a del mar, para mi Ulol ya es la peor experiencia que riot me ha entregado en mis 6 a&ntilde;os jugando lol, desde mis comienzos en el a&ntilde;o 2012 en marzo en el servidor de NA, en el juego es primera ves que no siento y no quiero jugar por la casa de estudio y como comunidad , y no quiero ser parte me siento super desmotivado , me preocupa ya que la organizadora es muy influyente en la casa de estudios y si me veo comprometido lo cual estoy haciendo al registrarme como Ulol vi&ntilde;a del mar me tendr&iacute;a que cambiar de universidad, ya que ella misma trabaja en dicha instituci&oacute;n y todo se vendr&iacute;a hacia mi, como focos de un problema m&aacute;s que comunicar lo que sucede. No entiendo podr&iacute;an explicar siendo que tienen los medios para hacer todo lo posible nos obligan ir a otro lugar en vez de nuestra casa de estudio..... No pens&eacute; que riot games fomentara la corrupci&oacute;n de inter&eacute;s, manipulaci&oacute;n de decisiones, falta a la probidad, probablemente lucro y transparencia, para m&iacute; es un latrocino como jugador y m&aacute;s que player como persona jam&aacute;s pens&eacute; que las organizaciones cambiaran tanto, me decepcionan Ulol.","replies":[{"poster":"Kleagle","date":"2017-07-01T20:45:08.864+0000","up_votes":16,"down_votes":2,"body":"En serio alguien que escribe así va a la universidad?","replies":[{"poster":"Nuke","date":"2017-07-02T04:34:59.728+0000","up_votes":1,"down_votes":0,"body":"#Traduccion de el texto a una forma mas comoda para el lector:\n\n> \"Corrupción conflictos de intereses posible lucro y falta a a probidad en ULoL duoc viña del mar\"\n\nPorque en la casa de estudios de \"ULoL duoc\" es una verdadera mafia. Hay conflictos de intereses, falta a la probidad, la organizadora y sus organizadores en vez de hacer algo correctamente se apoya fielmente en ellos mismo con voz y voto, no respetan las reglas establecidas en los torneos y las malas practicas en la organización e influencias, me da mucha pena por que tengo un poco de miedo por el mal clima que ya se generó. Pero, por ordenes del los organizadores debemos callar y quedar de acuerdo por la gran influencia que tienen, y nos dicen: \"Esto queda acá y no sale para ningún lado\". Es como decir \"aquí no ha pasado nada\".\n\n  Me siento pasado a llevar por mis derechos de comunicar y además me están negando expresamente el derecho de expresarme debidamente como ocultando y pasando por alto todo, siento que están vulnerando un derecho que es hablar pero, no me quedaré callado. Comento que el equipo de los organizadores juega en el torneo (a excepción de la organizadora) siendo que no puede ser así, por las reglas de ULol que indica explícitamente y la organizadora avala todo esto y apoya en vez de colocar un freno, sigue adelante con su dictadora posición, además de ser prueba viviente de todo lo que hacen realmente y el oscuro panorama que presenta no me siento seguro de ir al rifrivals que proponen.\n\n El evento no se realiza en la casa de estudios \"duoc viña del mar\" sino mas bien en un local. Por lo que tengo entendido leyendo las reglas es en la casa de estudio por lo que me da a entender. Además seria poco lógico ULoL en otro local que en la casa de estudios (Ulocal , Urestobar) y se da para otras cosas pero, ellos están lucrando de alguna manera (La cual no sabemos con exactitud), nos cobran 1000 por concepto entrada ya que es para no sobre poblar el local y que llegue mas gente, la cual cancela y por lo tanto, no nos dan ningún comprobante. En la entrada el dia del evento podemos entrar al local con nuestro Rut aun restobar presentando nuestro CI el cual llevan un registro pidiendo nuestros datos al adquirir una entrada a todo los organizadores involucrados, además por la entrada pagada sin comprobante de la transacción.\n\n¿Por que nos cobran? La razón es porque están pagando el arriendo del local, siendo que revisando en otras universidades, como Argentina, Ecuador y Chile, (Santiago específicamente) que están registrados en ULoL el evento del rifrivals, los eventos que estaba viendo la entrada es liberada y la hacen a todo publico, incluso algunos eran desde los 7 años en la casa de estudios de Argentina o en otras. Además de ser de entrada liberada hay compromiso por parte de la organización y la casa de estudio stans y muchas cosas mas.\n\nIndicaban que se proyectaría en un auditorio y se hace todo en un marco de comunidad, se nota discriminación en ves de juntarnos como comunidad nos dispersan. No todos tiene los medios y además la lejanía de esta, (Sin mencionar que tengo que tomar 2 buses para lograr llegar a otra ciudad para el evento de rifrivals) , siendo que si se hubiese hecho en la casa de estudios no tendría que ir tan lejos (Y solo tomar mi cotidiano bus), así se trabaja en \"ULoL viña del mar\". \n\nPara mi ULoL ya es la peor experiencia que Riot me ha entregado en mis 6 años jugando lol, desde mis comienzos en el año 2012 en marzo en el servidor de NA. _(Esto no tiene sentido, estamos en la Season 7. Si jugaste 6 años debiste empezar en el 2011, ya que el juego inicio el 2009, gg matematicas)_.\n\n En el juego es primera ves que no siento y no quiero jugar por la casa de estudio, como comunidad , y no quiero ser parte. Me siento super desmotivado. Me preocupa ya que la organizadora es muy influyente en la casa de estudios y si me veo comprometido lo cual estoy haciendo al registrarme como ULoL viña del mar me tendría que cambiar de universidad, ya que ella misma trabaja en dicha institución y todo se vendría hacia mi, como focos de un problema más que comunicar lo que sucede.\n\n No entiendo podrían explicar siendo que tienen los medios para hacer todo lo posible nos obligan ir a otro lugar en vez de nuestra casa de estudio... No pensé que Riot Games fomentara la corrupción de interés, manipulación de decisiones, falta a la probidad, probablemente lucro y transparencia, para mí es un latrocino como jugador y más que player como persona jamás pensé que las organizaciones cambiaran tanto, me decepcionan ULoL.","replies":[]},{"poster":"CaroI Danvers","date":"2017-07-01T20:56:39.064+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Topoisomerase,realm=LAS,application-id=QXeEMrF7,discussion-id=b6fxykvP,comment-id=0000,timestamp=2017-07-01T20:45:08.864+0000)\n>\n> En serio alguien que escribe así va a la universidad?\n\nayyyyy","replies":[{"poster":"El Impostor","date":"2017-07-01T23:11:22.675+0000","up_votes":1,"down_votes":0,"body":"Lmao","replies":[]}]}]},{"poster":"Yûrei","date":"2017-07-02T00:29:58.652+0000","up_votes":8,"down_votes":0,"body":"Soy Christopher, presidente del club DLG que convoca a las distintas sedes de DuocUC para concluir ULOL.\n\nPrimero, debes aprender a expresarte textualmente, no se entiende nada, no puedo prestarte ayuda si no comprendo tu problemática y nadie prestará atención a tus demandas si no son bien expresadas.\n\nSegundo, en relación a lo que dices, cito a continuación:\n\n\"comento que el equipo de los organizadores juega en el torneo (a excepción de la organizadora )\": Ningún organizador juega, eso se valida desde el inicio. DLG es la entidad que organiza ULOL en DuocUC, Javiera, es la representante de tu sede y la única organizadora oficial. Tú mismo indicas que ella no juega, así que este argumento que indicas quedaría descartado.\n\n\"ellos están lucrando de alguna manera la cual no sabemos con exactitud, nos cobran 1000 por concepto entrada ya que es para no sobre poblar el local y que llegue mas gente ,la cual cancela y por lo tanto, no nos dan ningún comprobante,\": No existen reglas respecto a que no se pueda cobrar conceptos de entrada a los eventos que la empresa del juego invite a organizar, es más, el concepto de entrada es usado para pagar gatos administrativos y de logística en el local, es algo obvio y se realiza en cualquier organización, como los centros de alumnos y sus bingos. No veo ninguna irregularidad en ello. Seguimos...\n\n\"ademas indicaban que se proyectaría en un auditorio y se hace todo en un marco de comunidad, se nota discriminación en ves de juntarnos como comunidad nos dispersan no todos tiene los medios y además la lejanía de esta\": Rift Rivals no se hará en Santiago, estás muy equivocado, yo represento a la capital y te lo digo desde ya. No viajes. Por otro lado, los chicos de ULOL DuocUC Viña están en su total autonomía de realizar el evento como crean pertinente, puesto que no siempre la institución nos presta sus instalaciones, como el auditorio, debemos buscar otras opciones como arrendar locales.\n\n\"No pensé que riot games fomentara la corrupción de interés, manipulación de decisiones, falta a la probidad, probablemente lucro y transparencia\": No entiendo mucho qué quieres decir, enserio que está un poco ilegible la escritura. Por lo que logro detectar, nombras a Riot Games como entidad patrocinadora y estás equivocado, Riot Games no patrocina a ningún evento, su calidad es la entregar las informaciones, es nuestra decisión realizar los eventos y actividades o no, de la manera en que podamos, con los recursos que se encuentren.\n\nPor favor, eres libre de hablar conmigo, ya que soy quien mantiene las relaciones con los directivos de la institución y los del club, pero no puedo revisar un caso sin fundamento como el que me presentas ahora, mucho menos si es ilegible.\n\nEspero que tu frustración pueda ser enfocada en algo más sano, ULOL habrá todos los años y estamos facultados para banear de nuestra liga a quienes tomen posiciones agresivas y contraprudentes con la comunidad. Como lo es esta difamación sin argumentos. Como DLG estamos en nuestro derecho de denunciar a League of Legends la situación argumentando \"difamación\". Por favor, no transformemos a ULOL en una batalla de difamaciones y siempre puedes hablar con uno de nosotros si tienes molestias en tu sede.\n\nSaludos cordiales,","replies":[]},{"poster":"Descrutmen","date":"2017-07-01T20:51:59.220+0000","up_votes":6,"down_votes":0,"body":"Joder, parece un libro, pon puntos entre parrafos.\n\n\n_Por ejemplo así._\n\n_**''Entonces eso fue lo que pasó.**_\n\n_**''Y después de todo eso...**_","replies":[]},{"poster":"Azhalith","date":"2017-07-02T02:48:25.184+0000","up_votes":4,"down_votes":0,"body":"COMUNICADO OFICIAL\nEstimados jugadores y parte de la comunidad:\nSoy Javiera, organizadora y líder de ULOL Duoc UC Viña del Mar.\nPrimero: debes saber redactar y expresarte, de manera que todos puedan entender lo que quieres compartir.\nEn este comunicado, daré a conocer, respalda y fundamentar los puntos que encontré relevantes en tu publicación, los cuales NO corresponden y no son ciertos:\n1.- Por qué el cobro de los $1.000 (mil pesos): este monto se pidió como condición del dueño del local en el que se realizaría en primera instancia este evento, ya que, como él nos explicó, este monto se usaría para pagar el arriendo del local (costear los servicios del personal que trabaja ahí).\n2.- Por qué se realizó como primera instancia en un local, antes que en nuestra casa de estudios: en primera instancia, se informó que se realizaría en un local, ya que, habíamos tenido una reunión con directiva de Duoc Viña del Mar, en la que ellos, al nosotros solicitar el teatro para realizar el evento, respondieron que esa posibilidad era muy difícil por temas administrativos, y nos tendrían una respuesta oficial pasado el plazo en el que tenía que mandar un correo a Riot, informando el lugar en el que se llevaría a cabo el evento (23 de junio), y por tanto, opté por buscar otros lugares para realizar el evento.\n3.- Por qué se cambió el evento a la casa de estudios, en segunda instancia: esto ocurrió ya que, habíamos solicitado a Duoc que publicitara el evento, pero al ser en un local donde se vende alcohol, por temas administrativos, no nos apoyaron, y el no tener publicidad por parte de ellos, era arriesgar en gran manera el evento. Añadiendo, faltando pocos días para el evento, no teníamos ni un 50% del dinero solicitado, por lo que no quería arriesgar la realización del evento. También, optamos finalmente por realizarlo en Duoc Viña del Mar, porque nos había llegado la respuesta por parte de la directiva de Duoc Viña del Mar, que SI nos facilitarían el teatro, y que por tanto, SI publicitarían el evento, agregando que obviamente al ser en nuestra casa de estudios, sería gratis. Finalmente, como sería entrada liberada, se dio aviso mediante grupo de Whatssapp de la comunidad, y Facebook, que el dinero les sería devuelto a las personas que habían pagado.\nMencionando como último punto, las personas mencionadas en esta publicación, Luciano Correa (Calm Heaven) y Alejandro Villegas (RR Alex), son quienes me ayudan, el único líder oficial y lo puedes ver en la pagina de ulol soy yo, me ayudan con los problemas y a gestionar también que es algo que no puedo todo sola. \nEsperando que la comunidad, tanto de League of Legends, como todas las otras que hayan visto esta publicación, vean que esta publicación se ocupó para difamar a la comunidad, estudiantes y a la mesa directiva de ULOL Duoc Viña del Mar, y que no expresa la realidad y lo transparente que hemos sido.\n\nPuedes preguntarle a cualquier miembro de nuestra comunidad, y te dirá todo lo que hemos realizado. Ya que nuestra comunidad es bastante unida y tenemos un hermoso ambiente, pregúntale a quien sea parte del club y te dirá lo mismo.","replies":[]},{"poster":"Ghalen","date":"2017-07-02T02:19:50.051+0000","up_votes":3,"down_votes":0,"body":"Sería conveniente que distribuyeras en párrafos todo ese amontonamiento de palabras, sino parece que estás leyendo la piedra Rosetta:\n\nhttp://i.imgur.com/8y0iVqR.jpg&noredirect","replies":[]},{"poster":"teslapls","date":"2017-07-02T00:58:17.240+0000","up_votes":3,"down_votes":0,"body":"que bien escribes papu xdddd","replies":[]},{"poster":"LCI Insight","date":"2017-07-02T00:17:22.410+0000","up_votes":3,"down_votes":0,"body":"Ossandón eres tú?","replies":[]},{"poster":"Tortuguita","date":"2017-07-01T22:09:43.122+0000","up_votes":3,"down_votes":0,"body":"Compañero , ve al grano. Es increíble como tanteas entre las aguas como un pez erratico","replies":[]},{"poster":"Eskipi","date":"2017-07-02T07:37:06.008+0000","up_votes":1,"down_votes":0,"body":"te sorprende que alguien entre a algo importante de este juego para lucrar xD? y que sea a costa de corrupcion y conflicto de intereses es parte del asunto, en el lucro el fin justifica los medios, despierta inocentón","replies":[]},{"poster":"madnessdirty","date":"2017-07-02T00:18:25.541+0000","up_votes":1,"down_votes":0,"body":"el gusto de revolverse y ahogarse en un vaso de agua el evento (iba) en un local particular no es un local del lol ni de la institución, si cobran 1000clp es porque el bar quiere tener un control o algo por el estilo, los dueños del local pueden hacer lo que quieran si esta dentro de la ley. Esta la opción, si no te acomoda. puedes faltar al evento y verlo con tu grupo de amigos :)  pd: yo voy al evento si iba a ser en el local en mi caso a mi me queda mas cerca y no pagaba locomoción como estudiante :3","replies":[]},{"poster":"SAD Katarina","date":"2017-07-02T00:17:49.077+0000","up_votes":1,"down_votes":0,"body":"Por favor, escribí entre parrafos xD. Me da mucha pereza leerlo así todo amontonado :(","replies":[]}]}