{"poster":"El Vuur","date":"2020-02-16T11:59:07.512+0000","title":"The client has been awful since it swapped to the new login screen, here are some frustration points","subforum":"Help & Support (OCE)","up_votes":1,"down_votes":0,"body":"​Guys,\r\n\r\nYou gotta fix this game client, it's doing my head in.\r\n\r\nI've done a full game repair.\r\nBeen working fine for years until the new client login was released.\r\nIf there is an easy fix please tell me! lol\r\n\r\nHere are my top ten:\r\n\r\n1. Frequently the client won't allow me to use chat at all except in game which is brutal pre-game\r\n2. The login process takes 10 years to get from clicking the icon to loading the home screen, is this related to your 10 year celebrations? Seriously though, it used to take 30 seconds before the login process changed, now takes 2 - 5 mins\r\n3. Frequently the first time I go to Loot it won't display anything, I've got to go to Store and then come back to Loot\r\n4. There are time at the end of the game I can't go back to a new game, and sometimes I can't even exit this screen to the home screen, only option is quitting the whole game and coming back in\r\n5. There are times I'll click play, it'll make a noise, and won't load the game selection screen\r\n6. There are times when the client loads it will say \"We weren't able to load this page... Retry\" (I'm on 50Mb with a 20ms ping)\r\n7. Some times when I log in and start a game I can't choose SR or ARAM, they have red exclamation marks on them, can only play ARURF &amp; Teamfight Tactics, the tool tip on it reads \"Can't Connect (Error:{{errorCode}}).\"\r\n8. After logging out if I try to start the client up again within 1 - 2 mins it won't start, have to wait longer, no processes in the background\r\n9. Periodically I'll load into ARAM champ select and it's completely black, I can hear which champ I've got, can't reroll or change anything like runes etc\r\n10. I can't see if anyone is still in the post-game screen, they all like they are not there (grayed out), but they comment, is this a new config or broken?\r\n\r\nThe fix to each of the above (except 8 lol) is often to restart the game client, sometimes several times, if it's not too annoying I'll just ignore the issue and hope fixed the next time I start the game.\r\n\r\nThis stuff is driving me, and others I've spoken to in-game, insane, you gotta get this client fixed as a priority! It's been a long time since you released the new login, I (we) have been more than patient. If the issue is at my installation please bear with my frustration.","replies":[]}