{"poster":"Moe BrotasticO","date":"2016-11-18T08:00:17.862+0000","title":"Club bug. (Owner)","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"I'm the owner of a Club and I have this weird bug that I can't write in Club Chat or add anyone to the list anymore. I've seen People getting it fixed and I think this is the right place to ask for it.","replies":[{"poster":"Porocles","date":"2016-11-18T19:37:17.962+0000","up_votes":2,"down_votes":0,"body":"I'd like to take a look and see if I can help.  What is the club name and tag?  Let me know!","replies":[{"poster":"Ravenharts","date":"2016-11-19T09:20:37.481+0000","up_votes":2,"down_votes":0,"body":"Any updates on club owners who can't see or interact with their club at all? :(","replies":[]},{"poster":"Moe BrotasticO","date":"2016-11-18T21:05:07.420+0000","up_votes":1,"down_votes":0,"body":"The Club Name is: ~303~\nBut we don't have a tag yet.  :)","replies":[{"poster":"Porocles","date":"2016-11-18T21:10:47.910+0000","up_votes":2,"down_votes":0,"body":"Refreshed!  HTTP would be an interesting tag!","replies":[{"poster":"Moe BrotasticO","date":"2016-11-18T22:27:24.329+0000","up_votes":1,"down_votes":0,"body":"Alright, I have just tried it out, but unfortunately I'm still having the issue. Here is some more Information about what is so weird:\n\n-My Club members don't see my name in the list but: \"**Summonername\"\n\n-Sometimes they see their name or the name of other members in the list instead of my name or \"**Summonername\"\n           --->But only after they clicked around a bit. You know, like right-clicking **Summonername select view Profile (btw, it\n                doesn't react to that) and doing stuff like that.\n\nEven though it might not have worked now, thank you still. ^^","replies":[{"poster":"Porocles","date":"2016-11-18T22:42:01.997+0000","up_votes":2,"down_votes":0,"body":"Thanks for letting me know about this.  I took another look, and it seems that there may be some lingering issues still left over from the [recent downtime](http://boards.na.leagueoflegends.com/en/c/miscellaneous/nMisJPK8-clubs-outage-oct-2016).  I'm poking around a bit to try and troubleshoot this and find what's up.  I'm seeing something slightly similar to what are you're seeing too.  At the same time, I've forwarded this information to interested parties because it's not one I've personally faced before.  Are you okay with me promoting someone in your club as I troubleshoot?\n\nWhen you have a chance, reach out to us in a [support ticket](https://support.riotgames.com/hc/en-us/requests/new) so we can keep track and help you individually.  In the meantime, I'll see if I can mess around with this.  You've been a bro, moe, and I look forward to doing whatever I can for ya.","replies":[{"poster":"Moe BrotasticO","date":"2016-11-18T22:52:07.059+0000","up_votes":1,"down_votes":0,"body":"Thank you Porocles. ^^\n\nChecking again, I have found some other things that might actually be of use:\n\n-When I log in, the Club Chat box Pops up like usually, but it only says \"joining...\"\n\n-When I use the Beta-Client I can't click on \"Clubs\", it's gray. But when I right-click it in the \"Online list\" I can click view Club and it Shows it. But all the names are gray, so I can't do anything. Instead of \"**Summonername\" there is just no name at all but it still Shows that someone is in this place and you can see the owner Symbol next to where the name should be. But \"Clubs\" is still marked gray and when I go to the shop for example and then want to have a look at the Club again, I have to do this Thing with the Chat box again.\n\n-I've even created a second account, but it seems to be having the same Problem... Although that one doesn't have a clan he also can't create one. When you click \"create\" it just doesn't react. (Moe Ruiz) [It's weird, because everything except the \"Moe\" in the name is different from the other, in the sense of E-Mail, Password....]\n\n-I also can't invite this new account to a Club. The owner of the Club always gets an error, saying that the Player still has to Play a game, even though I have done so already. (online)\n\n-My brother can create Clubs on his account and everything and has no issues. (Racky Ruiz)\n\n-I still get the same Problem when launching on another cumputer (like my brother's).\n\nTell me if I can do any more to help. :)","replies":[{"poster":"Porocles","date":"2016-11-18T23:54:49.820+0000","up_votes":2,"down_votes":0,"body":"Thank you for all of this detailed information!  Everything looks to be good now!  When you get a chance, relog and take a look.  Let me know.  :D","replies":[{"poster":"Moe BrotasticO","date":"2016-11-19T00:18:27.532+0000","up_votes":1,"down_votes":0,"body":"YOU DID IT, MAN! YOU'RE AMAZING! I really can't thank you enough man! ^^ :D\nMan... You have been so helpful and supportive right from the beginning. Riot Games can honestly consider themselves very lucky to have you in the Team! ^_^ I knew you could fix it, but I didn't expect it to all go so fast. Thank you so much for investing your time in helping me out! You really made my day, to say the least! \n\nAs our little journey here comes to an end, I'd just like to say thank you, for the hundredth time and I wish you all the best. I believe that you're going to make so many other people happy with what you're doing.\n\nYou're one hell of a support!    ^_^   ;D","replies":[]}]}]}]}]},{"poster":"Moe BrotasticO","date":"2016-11-18T21:25:01.182+0000","up_votes":1,"down_votes":0,"body":"Thank you so much for your time and efforts. I've seen you help out so many others already and I'm so happy you're the one helping me with this. I predict that everything is going to be fine now but unfortunately I'm not able to try it out right now. But later (hopefully still today) I can, so then I'm going to tell you about the result. Thanks again! ^_^","replies":[]}]}]}]}]}