{"poster":"sek0l","date":"2017-06-06T06:52:59.375+0000","title":"Sistema de PL","subforum":"Charlas Generales","up_votes":2,"down_votes":0,"body":"Hola, quer&iacute;a decirles por que gano tan poco PL &quot;18 o 19 a lo mas 20&quot; y si pierdo me restan 18 o 19. Bueno aqu&iacute; va la pregunta &iquest;por que a otros les dan 25 o 26 de PL y a m&iacute;(incluyendo otras personas) 18 y 19 de PL?(elo platino)&quot; es injusto en realidad por que uno le cuesta subir mas que al otro y igual se diferencia bastante 5 o 6 d&iacute;gitos y que te quiten casi todo lo que ganaste &quot;ni un brillo&quot; bueno esa es mi opini&oacute;n. Muchas gracias por su atenci&oacute;n.{{champion:157}} {{summoner:4}}","replies":[{"poster":"rokushoger","date":"2017-06-06T12:26:31.772+0000","up_votes":1,"down_votes":0,"body":"En realidad, es justamente por eso que estás diciendo, porque a vos te cuesta subir más.\nEl MMR se basa en partidas ganadas y perdidas, rachas de victorias y derrotas, etc.\nSi tu ganas demasiadas partidas, tu MMR sube, y el juego te da más puntos por partida, porque entiende que tu estás por encima del nivel que te está tocando jugar, entonces te da los puntos para que subas.\nSi por otro lado ganas aproximadamente el 50% de tus partidas, el juego te da más o menos lo mismo cuando ganas que cuando pierdes, para que te mantengas, y puedas demostrar que vales ganando más que las que pierdes, para pasar a estar en la primera situación.\nSi por último pierdes más de lo que ganas, el juego te da menos cuando ganas que cuando perdes, porque entiende que ese nivel en el que estás te supera, y tiende a querer bajarte de división.\n\nSaludos!","replies":[{"poster":"sek0l","date":"2017-06-20T16:56:02.898+0000","up_votes":1,"down_votes":0,"body":"ty :)","replies":[]}]},{"poster":"stonerock","date":"2017-06-06T11:02:14.778+0000","up_votes":1,"down_votes":0,"body":"Fijate en alguna pagina que te diga el elo, no es muy exacto pero a veces aciertan, por ejemplo:\nActualmente yo estoy en plata 3 pero me empareja con plata 1 y gold(5,4 y muy pocas veces 3 o 2)\nGano 25 lp y pierdo 12 aproximadamente, y me fije en una pag mi mmr y decia que era de gold V.\nMi elo a comparacion del tuyo es muy bajo (vos sos platino) pero aplica de igual manera.\nUn streamer hace un tiempo dijo que para subir eso tenes que ganar mas partidas de las que perdes aunque hay otros factores que influyen","replies":[{"poster":"Tomatexx","date":"2017-06-06T19:03:28.037+0000","up_votes":1,"down_votes":0,"body":"Uno de los factores de que te baje mucho el elo, es que juegues duoQ.","replies":[]}]},{"poster":"Ulphurus","date":"2017-06-06T07:05:47.588+0000","up_votes":1,"down_votes":0,"body":"Los pl que te dan o quitan van directamente relacionados con tu mmr. Alguien que tenga un buen mmr en relación a la división en la que este, obtendra mas pl debido a que por su buen desempeño y habilidad logro hacer subir su mmr","replies":[{"poster":"sek0l","date":"2017-06-06T10:52:18.091+0000","up_votes":1,"down_votes":0,"body":"tengo el mmr normal de hace rato llevo como un mes o mes y medio en platino, al principió me daban 22 o 23 de pl ahora me dan 18 xd. Vale si por la información{{summoner:7}}","replies":[{"poster":"rokushoger","date":"2017-06-06T12:28:08.183+0000","up_votes":1,"down_votes":0,"body":"Justamente que dices esto complemento entonces mi respuesta. Como hace bastante que estás en platino y no subes, asumo que estás ganando el 50% de tus partidas, y por tanto estás en el segundo punto que mencion en el otro comentario. El juego está asumiendo que estás bien donde estás y te mantiene ahí ganando lo mismo que pierdes hasta que logres romper el equilibrio de 50% de victorias y derrotas.","replies":[]}]}]}]}