{"poster":"Magallone","date":"2015-05-06T22:49:45.180+0000","title":"Malzahar fuori meta?","subforum":"Discussioni generali","up_votes":2,"down_votes":1,"body":"Ho giocato tutta la season 4 e le qualificazioni per la season 5 con Malzahar come main, facendo sempre buoni punteggi e spesso vincendo la lane. Dopo le ultime due o tre patch mi sono accorto di non riuscire quasi pi&ugrave; a vincere una lane, in effetti ho notato che moltissimi midlaner sono stati buffati e malzahar no, potrebbe essere per questo? Malzahar &egrave; fuori dal meta attuale?","replies":[{"poster":"Zarath93","date":"2015-05-07T03:08:10.998+0000","up_votes":4,"down_votes":0,"body":"malzar in soloq è devastante","replies":[]},{"poster":"Dantazzo","date":"2015-05-07T10:12:56.973+0000","up_votes":2,"down_votes":0,"body":"\"Fuori dal meta ma comunque forte\" cit. uno vestito da Malzahar che ho trovato a Lucca","replies":[]},{"poster":"Frattaglia","date":"2015-05-06T23:17:27.718+0000","up_votes":2,"down_votes":0,"body":"Considerando che la w fa danno % alla vita, e che è la stagione dei tank, io non credo.\n\nSemmai sono usciti dal meta quasi tutti gli assassini, ed erano loro a essere counterati da Malzahar :P","replies":[]},{"poster":"One Tax Man","date":"2015-06-16T23:12:14.714+0000","up_votes":1,"down_votes":0,"body":"Nono , malzahar continua ad essere un champ estremamente forte e fastidioso.\nOk che non ha mobilità e che certi personaggi con  gap closer o engage ti danno fastidio , ed è per questo che esiste la tua fantastica ulti che ti permette di far stuprare il bersaglio inerme dal tuo team. È vero , un quicksilver e ti giochi la ulti , però resta mooolto forte.\nin lane con la e ti harrassa in maniera fantastica , ha un silent tra i più lunghi ad area, danno % , tanto burst di ulti e quei voidlings che in lane rompono troppo le scatole.\nL'unico problema come ti hanno già detto è che lui è un anti assassin , ed ora gli assassin o fanno tutti schifo perché perma nerfati o fanno schifo perché ci sono troppi tank e non riescono a burstare le persone.\nÈ forte ed anche viable secondo me , ma solo in certi casi.","replies":[]},{"poster":"magickast83","date":"2015-06-16T12:47:22.610+0000","up_votes":1,"down_votes":0,"body":"io gioco malzar sopratutto potenziando la E, ed utilizzo il mostriciattolo come arma secondaria quando uso la ulti :)","replies":[]},{"poster":"Magallone","date":"2015-05-06T23:49:14.098+0000","up_votes":1,"down_votes":0,"body":"il fatto è che in lane gente come Diana e Ahri ti shottano prima che tu possa anche solo pensare di reagire xD","replies":[{"poster":"franz94","date":"2015-05-07T00:15:51.169+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Magallone,realm=EUW,application-id=MJVj50Jw,discussion-id=KAy8qkv7,comment-id=0001,timestamp=2015-05-06T23:49:14.098+0000)\n>\n> il fatto è che in lane gente come Diana e Ahri ti shottano prima che tu possa anche solo pensare di reagire xD\n\n onestamente no con malzahar non dovresti nemmeno entrare nel raggio delle loro spell a meno che non è che per la ult... inoltre ahri con la full combo la ammazzi di sicuro, scusa ma malzahar è counter di diana wtf l'unica cosa che devi evitare è il suo all-in","replies":[{"poster":"Frattaglia","date":"2015-05-07T06:42:12.455+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=franz94,realm=EUW,application-id=MJVj50Jw,discussion-id=KAy8qkv7,comment-id=00010000,timestamp=2015-05-07T00:15:51.169+0000)\n>\n> onestamente no con malzahar non dovresti nemmeno entrare nel raggio delle loro spell a meno che non è che per la ult... inoltre ahri con la full combo la ammazzi di sicuro, scusa ma malzahar è counter di diana wtf l'unica cosa che devi evitare è il suo all-in\n\nInfatti Malzahar soffre gli all-in (suggerisco di bannare Vi se lo volete giocare), ma se giocato bene non lo vedo troppo un problema contro Diana e Ahri.\nDi contro ha problemi contro gente con un raggio maggiore, tipo i maghi da distanza (io contro Annie ad esempio mi ci trovo malissimo).\n\nSecondo me resta un champ valido, ma come al solito enormemente dipendente dal posizionamento.","replies":[{"poster":"franz94","date":"2015-05-07T16:25:22.544+0000","up_votes":1,"down_votes":0,"body":"che soffre gli all-in è vero ma con il suo kit non dovresti mai trovarti in una posizione per gli all-in dato che è un ottimo farmer con le sue skill e dopo il 9 si fa intere wave con 1 skill...(tolti vi e buoni jarvan pùò evitare la maggior parte dei champ da all-in)\nhai ragione sul fatto che champ come annie, lux xerath sono difficili per malzahar ma questo è normale in quanto malzahar countera gli assassin ma i maghi lo \"counterano\" ","replies":[]}]}]}]},{"poster":"Magallone","date":"2015-05-07T08:47:46.813+0000","up_votes":1,"down_votes":0,"body":"Quello che intendevo dire è che contro Ahri e Diana se si vuole farmare si rischia sempre di essere shottati dalla loro combo. Lasciare che le visioni farmino per me non funziona almeno fino al livello 8/10,  e in tutti questo periodo sono esposto al loro gioco molto più aggressivo del mio","replies":[{"poster":"Jay Kenton","date":"2015-05-07T13:23:48.393+0000","up_votes":1,"down_votes":0,"body":"Ahri non è un grosso problema per te; Diana invece si però alla fine la Q è schivabile.","replies":[]}]},{"poster":"Jay Kenton","date":"2015-05-07T13:23:08.955+0000","up_votes":1,"down_votes":0,"body":"Era più forte contro gli assassini; contro i maghi viene outscalato facilmente.","replies":[]},{"poster":"Elraton94","date":"2015-05-07T12:25:24.367+0000","up_votes":1,"down_votes":0,"body":"Non ha mobility, in linea se il jungler è un pelo intelligente non lo fa vivere.","replies":[]},{"poster":"ViaMalinconiaN9","date":"2015-05-07T10:59:03.309+0000","up_votes":1,"down_votes":0,"body":"Io trovo malzahar un champ bellissimo da usare, ed è molto forte, la sua ulti è devastante, quando la uso scrivono sempre \"you ulti is cancer\" omg ovviamente io godo, non so proprio, perché non viene usato, è un peccato.","replies":[]},{"poster":"Lord Valotz","date":"2015-05-07T10:28:19.067+0000","up_votes":1,"down_votes":0,"body":"Se ha quasi il 54% di winrate non mi pare così male e contro Diana la distruggi, non può farmare e prima del 6 non ti fa nulla, in caso di un suo allin la ulti a tua volta e dato che se hai giocato correttamente avrai farmato più di lei quindi avrai più gold ecc non dovresti avere problemi in nessun 1vs1 ne con Diana ne con gran parte degli altri personaggi.","replies":[]},{"poster":"franz94","date":"2015-05-07T00:14:49.881+0000","up_votes":1,"down_votes":0,"body":"il problema 1  è che malazahar non è mai stato nel meta in quanto il suo counter è un item,  pero è sempre stato un ottimo pick per la soloq in quanto è un champ alquanto semplice come meccaniche ed era counter di tutti gli assassin, il fatto è che gli assassin sono fuori meta adesso.\n 2 malzahar dovrebbe essere ancora un buon pick in quanto tutto il suo kit oltre a fare da counter degli assassin è ottimo a distruggere tank pero visto che sono tank è più difficile fare kill.\n3 molti midlaner sono stati buffati perché prima sono stati nerfati, ahri gli hanno tolto il dfg e il danno extra nella e (ha dovuto cambiare stile di gioco da assassin per  tornata ad essere un mage e sorvoliamo sul periodo nel quale era op), fizz è diventato ad in quanto ap non faceva nulla, kassadin e veigar non ne parliamo, xerath aveva un bug che poteva eliminare molti danni dalla ult, ziggs nerfato tempo fa sulla q, akali nerfata sulla passiva in modo da complicare la combo(gia hanno in mente un rework) ecc. Malzahar è in una posizione migliore di tutti loro in quanto non riceve nerf da almeno 2 season gli ultimi sono stati un buff sul mana della ult","replies":[]}]}