{"poster":"Varela8182","date":"2016-12-08T07:23:57.643+0000","title":"¿Donde consigo una Skin gratis de Alistar?","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"Hola no se si algunas personas saben pero les pedir&iacute;a un gran favor en decirme como consigo una skin gratis cualquiera de Alistar porque es el champ que me gusta mucho para jugar de supp y que lo disfruto mucho.\r\nPd: Muchisimas gracias por leer el post y que tenga un lindo dia.\r\n{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"rokushoger","date":"2016-12-08T11:21:28.849+0000","up_votes":2,"down_votes":0,"body":"Antes en NA (no se si sigue existiendo esto, yo lo hice hace muchos años), por suscribirte al canal de youtube te regalaban a alistar desencadenado, y que yo sepa es la única forma (avalada por Riot) de obtener una skin gratis de alistar.\n\nLo otro es tener suerte que te salga en hextech, o bien que alguien se toque el corazón y te la regale (si te pasa esto último avisame que te voy a buscar y te llevo al casino, porque con esa suerte seguro pegamos el gordo).","replies":[{"poster":"Varela8182","date":"2016-12-08T11:53:03.182+0000","up_votes":1,"down_votes":0,"body":"Si yo e lee ido que hacían eso antes y en soporte salia que podías desbloquear skin, yo recién este año empezare jugar el lol y me encanta.\n\nSi me llegaran regalar una persona la skin no se, le haría un Testamento de agradecimiento ja ja.","replies":[]}]},{"poster":"vaVav","date":"2016-12-08T07:30:55.034+0000","up_votes":2,"down_votes":0,"body":"Si aún posees los 400 de RP que daban cuando creabas la cuenta, o reembolsos si ya los gastaste, te puedes comprar a Alistar Dorado.","replies":[{"poster":"Varela8182","date":"2016-12-08T07:38:28.423+0000","up_votes":1,"down_votes":0,"body":"Como te puedo decir pero como todo \"Noob\" o como le digan, al empezar jugar a League of legends gaste en cajas los RpS -.- y si estoy muy arrepentido, pude haberlo gastado en mejores cosas pero bueno ya es tarde y los reembolso nomas los gaste reembolsando campiones que no me gustaban. Decian que si me suscribia al canal de Youtube de  League of legends  regalaban una Skin pero nada.....","replies":[{"poster":"arondightFTW","date":"2016-12-08T07:59:13.384+0000","up_votes":1,"down_votes":0,"body":"Antes te daban una skin si te suscribías, pero youtube prohibio esta practica hace poco, por lo que ya no regalan a alistar dorado. \nCreo haber leido por ahi que se esta \"pensando\" otro modo para regalar a alistar dorado. asi que por ahora gratis no la vas a poder conseguir. creo..","replies":[{"poster":"Forgiato","date":"2016-12-08T08:06:35.903+0000","up_votes":1,"down_votes":0,"body":"era alistar desencadenado el que regalaban en el servidor de NA, por suerte lo tengo, y era asi como dices suscribiendote en el canal de yt de riot y si no me equivoco era exclusivo para ese servidor como lo es garen comando en LAS.{{champion:86}}","replies":[]},{"poster":"Varela8182","date":"2016-12-08T08:01:45.287+0000","up_votes":1,"down_votes":0,"body":"Que mal pero ojala tenga suerte en cajas.... lo que yo pensaba es que Riot deje hacer intercambio de skins me gane hace poco Pantheon Panadero y queria intercambiar pero veo que Riot no tiene ese sistema intercambio :C","replies":[{"poster":"arondightFTW","date":"2016-12-08T08:05:20.351+0000","up_votes":1,"down_votes":0,"body":"Si pusieran dicho sistema, perderían mucho dinero xd","replies":[]}]}]},{"poster":"vaVav","date":"2016-12-08T07:40:05.954+0000","up_votes":1,"down_votes":0,"body":"Eso lo dicen para ganar seguidores, es pura estafa.","replies":[]}]}]}]}