{"poster":"Artykyz","date":"2016-09-06T05:04:43.729+0000","title":"Qué pasa con los emparejamientos?","subforum":"Charlas Generales","up_votes":5,"down_votes":0,"body":"Qu&eacute; pasa que a cada rato en una normal siempre tocan una premade de 5? Se supone que es una normal el cual juego solo. No puedo hacer nada al respecto, siempre tryhardeandome, diveandome hasta un punto en el que me molest&oacute; y me puse a ragear porque me parece muy injusto este tipo de emparejamiento, lo peor de todo es que te dicen &quot;&ntilde;i&ntilde;i&ntilde;i manco, bronce&quot; entre otros, no puedo pasar un buen rato disfrutando del juego.","replies":[{"poster":"SenpaiDeathx","date":"2016-09-06T07:43:15.282+0000","up_votes":2,"down_votes":1,"body":"1+ man, soy de los que juega normal solitario y cada tanto te ponen en un team de premades o 3. Viviendo en su mundo, pickeando composiciones raras (ahiri adc, sona mid,etc) Ojala hubiera una cola de soloQ","replies":[]},{"poster":"Miroh","date":"2016-09-06T12:20:56.528+0000","up_votes":1,"down_votes":0,"body":"a mi gusta, ayuda a ganar experiencia jugando vs un equipo organizado","replies":[{"poster":"Artykyz","date":"2016-09-07T02:58:09.947+0000","up_votes":1,"down_votes":0,"body":"Que juegues con 5 que te tryhardean hasta incluso \"divearte\" la fuente no gana experiencia, lo único que ganas es una rabia total.","replies":[]}]},{"poster":"9081913DEL1","date":"2016-09-06T11:19:23.155+0000","up_votes":1,"down_votes":0,"body":"No es culpa de riot, la gente quiere jugar con su equipo, de hecho probar equipos competitivos es ir a probarlos a normal y dps torneos no al revés XD. el concepto es balancear ambos equipos, y si te fijas es probable que en tu equipo haya tambien uno o dos premades. por otro lado mientras el mmr de parejo te pueden poner con un lvl 7 y un challenger, todo es posible. \n\nQue te pongas a ragear ya es cosa tuya, y lo que te digan, bueno yo siempre recomiendo el mute all, salvo que conozcas a alguien (que cada vez es mas seguido).\n\nSaludos.","replies":[]},{"poster":"Blue Striker","date":"2016-09-06T08:04:42.514+0000","up_votes":1,"down_votes":0,"body":"normal, los parametros de matchmaking son completamente al azar, lamentablemente...","replies":[]},{"poster":"Gaunits","date":"2016-09-06T07:19:04.513+0000","up_votes":3,"down_votes":3,"body":"1_ como consejo te digo que mutees siempre al team enemigo \n2_ intenta tomarlo con gracia, vengo de una racha de 4 derrotas, unas por mi culpa otras no, no tuve rage en ninguna\n3_conoce gente y juga con 1 o 2 amigos :V\nsaludos","replies":[]}]}