{"poster":"Spawner1","date":"2020-01-10T15:03:46.571+0000","title":"Discussione sulle chest per il voto S","subforum":"Campioni e gameplay","up_votes":2,"down_votes":0,"body":"Salve volevo discutere insieme riguardo alle chest e sul metodo di come vengono date. A mio parere non mi sembra giusto che siano limitate 1 a campione e che non si possano ricevere se non possiedi il campione. Non mi sembrano giuste perchè ottenere il voto S non è facile da ottenere e in aram non puoi scegliere il campione e capita spesso che ti ritrovi gli stessi campioni che hai giocato e con cui la potresti quindi aver ottenuta. Inoltre se lo ottieni con un campione che non possiedi dovrebbe essere stato più difficile siccome il campione non ti è molto familiare e quindi non hai molta esperienza con lui. Inoltre alcune volte in aram nonostante tu abbia ottenuto molte assist e abbia fatto molti stun o effetti di controllo con un support ma ovviamente poche kill e uccisioni di minion ottieni solo un voto B+.\nEdit: ah e vorrei rimuovessero la possibilità di trovare i frammenti dei campioni (non le skin)","replies":[{"poster":"Hyuaska","date":"2020-01-10T16:29:59.362+0000","up_votes":2,"down_votes":1,"body":"A mio parere invece mi sembra giusto.\n\nPerchè?\n\n1. Ti incita a provare/imparare nuovi champ invece di rimanere solo su un campione, per l'amor di dio ci sono più di 100 champ, non sopporto quando vedo un giocatore giocare SOLO un champ tutte le partite con maestria 1M+.\n-\n2. Il voto S non è facile da ottenere, vero. Tuttavia se diamo un forziere per anche una B, bhè allora chi comprerebbe gli rp? Tanto ti danno forzieri anche se fiddi. Ti ricordo che una volta non c'erano manco i forzieri eh, perciò dovevi comprare e basta.\n-\n3. Aram è aram non ci puoi fare niente, ma come ti danno un champ con cui hai già preso un forziere lo stesso vale per gli altri.\n-\n4. \"Inoltre se lo ottieni con un campione che non possiedi dovrebbe essere stato più difficile siccome il campione non ti è molto familiare e quindi non hai molta esperienza con lui.\" è questo lo scopo, incitare i giocatori a provare e imparare ad usare più campioni invece che rimanere fossilizzati solo su uno, il che porta al punto 1\n---\nL'unica cosa che concordo con te è che ti danno B+ o voti del genere quando una S te la meriti, ma appunto hai poche kill e pochi minion. \n\nNon è sempre così, ma tante volte si.\n\nQuesto è il mio parere, come il tuo, non è una critica che sia chiaro.\n\nGl &amp; hf.","replies":[{"poster":"Spawner1","date":"2020-01-11T09:54:00.294+0000","up_votes":1,"down_votes":0,"body":"Sì sì tranquillo né me la prendo e né comincerò ad insultarti per avere un parere diverso {{sticker:sg-miss-fortune}} \nSemplicemente ti dico che rispetto il tuo parere anche se su molti dei punti sopra continuo a non essere d'accordo con te.. io sono un giocatore più da abisso ululante che da landa degli evocatori (tranne quando gioco per puro divertimento contro i bot hahah) quindi semplicemente vorrei che in aram venisse applicato un metodo leggermente diverso per l'assegnazione dei voti e delle chest ma ciò credo che rimarrà puramente nei miei desideri {{sticker:sg-miss-fortune}} \nBuona giornata, buona fortuna e buon divertimento! {{sticker:vlad-salute}}\nP.S.: io non intendevo minimamente dire di abbassare il voto a cui ti danno le chest","replies":[]}]}]}