{"poster":"Critmaster Garen","date":"2017-10-26T18:03:47.075+0000","title":"why is the new aftershock rune so conditional?","subforum":"Gameplay","up_votes":5,"down_votes":2,"body":"every other of the new keystones can be triggered by every single champion in the game. sure, in some cases they might not be great in terms of kit synergy (like you wouldnt take lethal tempo on a burst mage), but no one is actually excluded from taking any keystone rune, except for aftershock.\n\nthere are many fighters out there without immobilizing effects, that might want to pick up the rune. it seems unfair, that part of the tank and fighter pool can pick it up, and another part is entirely left out.\n\nwhy isnt every fighter, or champion in general allowed to pick up the rune?\n\nwhy is it that {{champion:77}} {{champion:122}} {{champion:59}} {{champion:5}} {{champion:19}} {{champion:150}} and many others amongst the fighters can pick it, but {{champion:86}} {{champion:2}} {{champion:420}} {{champion:82}} {{champion:75}} {{champion:83}} cant?\n\nconsidering that fighters in general arent prevented to take it, but only a specific random group, the restriction seems entirely arbitrary.","replies":[{"poster":"Tenth Leper","date":"2017-10-26T18:56:27.390+0000","up_votes":3,"down_votes":0,"body":"There are 2 boot runes and Cassiopia cannot have boots.","replies":[{"poster":"Critmaster Garen","date":"2017-10-26T19:03:25.574+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Tenth Leper,realm=NA,application-id=3ErqAdtq,discussion-id=A2wYnEH3,comment-id=0001,timestamp=2017-10-26T18:56:27.390+0000)\n>\n> There are 2 boot runes and Cassiopia cannot have boots.\n\nthey should honestly do something about that aswell.\n\nat the very least, they could just give her the 10 bonus movement speed of the boots at 10 minuts, when she equips that rune. (or earlier with kills/assists)","replies":[]}]},{"poster":"Frankbang","date":"2017-10-26T18:53:19.770+0000","up_votes":1,"down_votes":0,"body":"It's like what courage of the colossus is currently. Because it's triggered by CC it's inherently exclusive, but so many engage champs need something to help with their engage, hence aftershock. Just because the other Runes aren't technically exclusive, doesn't mean they aren't just as ineffective when taken by the wrong champs/styles. The point of the Runes was to give some niche power enhancements to as many classes as possible, and engage-tanks are a pretty big niche that deserve to have a specialized Rune. In the same way, the other champs you mentioned as not being able to choose it have alternative Rune options that give them an equally large power in their respective playstyles.","replies":[{"poster":"Critmaster Garen","date":"2017-10-26T19:02:59.922+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Frankbang,realm=NA,application-id=3ErqAdtq,discussion-id=A2wYnEH3,comment-id=0000,timestamp=2017-10-26T18:53:19.770+0000)\n>\n> It&#x27;s like what courage of the colossus is currently. Because it&#x27;s triggered by CC it&#x27;s inherently exclusive, but so many engage champs need something to help with their engage, hence aftershock. Just because the other Runes aren&#x27;t technically exclusive, doesn&#x27;t mean they aren&#x27;t just as ineffective when taken by the wrong champs/styles. The point of the Runes was to give some niche power enhancements to as many classes as possible, and engage-tanks are a pretty big niche that deserve to have a specialized Rune. In the same way, the other champs you mentioned as not being able to choose it have alternative Rune options that give them an equally large power in their respective playstyles.\n\ntheir only alternative in resolve is grasp.\n\nand grasp is highly situational. youre either in a matchup where you can repeatedly trade and stack it, or youre in a matchup that you have to farm out, in which case grasp sucks donkey dick and is simply not an option.\n\nin the second case youre basically locked out of the resolve tree for your primary choice since you dont have an alternative keystone.\n\nriot doesnt develop those runes for specific champion classes, but they actually took pride in the fact that any champion should be able to take any keystone rune and theyre just supposed to support certain playstiles.\n\nlike in the domination three theyre either supposed to support burst patterns or roaming for example.\n\neither way, the condition on the rune is entirely random and doesnt really serve a purpose. they can find another trigger that doesnt lock out a group of fighters from taking it who should be able to take it.","replies":[]}]}]}