{"poster":"Critmaster Garen","date":"2015-08-05T23:10:00.845+0000","title":"the more i see about garens villain system, the more i dislike it","subforum":"Gameplay","up_votes":34,"down_votes":6,"body":"initially it was just the problem of not being able to control who has the mark, which is an incredibly anoying mechanic.\n\nbut after thinking about it, i also came to realize that the true damage is actually not going to make much of a difference. the thing is, if it works as intended, its to be expected that the mark will usually stick to an assassin, adc or mage. simply someone who usually racks up a lot of kills.\n\nbut those champions are squishy enough, that with a proper midgame build i can take them down in one ability chain right now anyways. especially itemized into critical strike.\n\nthe main difference is, that its easier to get in range of those dudes and stick to them right now (with the right item build), than it will be after the changes.\n\nso the only nieche cases in which these changes are actually better for him in terms of damage compared to the live version, are if youre dealing with a relatively tanky carry type champion like a fed jax or irelia, who wants to get up close to you by himself. (and in that case youre probably the reason why theyre fed in the first place and cant duel them anyways).\n\nall the removal of his item diversity with crit items, his self slow on the spin and the nerf to the silence and tencity make him feel pretty terrible to play.\n\n\napparantly it wasnt enough, that he was susceptible to kiting. he actually now kites himself. this is the worst change you could come up with, next to the silence nerf and his new, and bland itemization.","replies":[{"poster":"Erijian","date":"2015-08-05T23:13:49.702+0000","up_votes":20,"down_votes":0,"body":"RiotRepertoir said Garen had too much mobility to be allowed to deal so much damage late game (With the E buff); that's why they added the 20% self-slow when even trying to attack an enemy champion.\n\nWilling to bet he/she has never once played Garen.","replies":[{"poster":"IcyPepper","date":"2015-08-05T23:21:58.774+0000","up_votes":1,"down_votes":0,"body":"Or any mobile assassin/mage ever... \n\nGranted, Garen is much, much tankier, but...","replies":[{"poster":"Critmaster Garen","date":"2015-08-05T23:24:42.621+0000","up_votes":6,"down_votes":0,"body":"> [{quoted}](name=tombdragon,realm=NA,application-id=3ErqAdtq,discussion-id=ownh6U3W,comment-id=00000001,timestamp=2015-08-05T23:21:58.774+0000)\n>\n> Or any mobile assassin/mage ever... \n> \n> Granted, Garen is much, much tankier, but...\n\nactually he seems squishier than before, since his w isnt a 1 point wonder anymore and will give him 10 mr/armor till midgame.","replies":[]}]},{"poster":"Critmaster Garen","date":"2015-08-05T23:16:51.876+0000","up_votes":7,"down_votes":1,"body":"> [{quoted}](name=Erijian,realm=NA,application-id=3ErqAdtq,discussion-id=ownh6U3W,comment-id=0000,timestamp=2015-08-05T23:13:49.702+0000)\n>\n> RiotRepertoir said Garen had too much mobility to be allowed to deal so much damage late game (With the E buff); that's why they added the 20% self-slow when even trying to attack an enemy champion.\n> \n> Willing to bet he/she has never once played Garen.\n\ni dont understand why he needs to be automatically punished for doing his job. i always hoped that they would remove the self slow on creeps somehow by mid and lategame.\n\ninstead they just made an anoying mechanic so much worse.\n\nalso, if they would actually play garen themselves or pay attention to how garen mains play the champion, then they had realized that most experienced garen players invest far more into offense than defense.\n\nfull tank garen with his life kit is garbage. its always been garbage, and people who actually play the champion dont build him all out tank, and its not how we want him to play.\n\ngoing 21/9/0 masteries and only 2 or 3 defensive items including cleaver is not rare.\n\ntheyre pidgeonholing him into heavy hp itemization, when hp builds are shit since bork is part of this game. i just dont see a reason to invest so much into a stat that loses its worth with 1 item.","replies":[]},{"poster":"Gunslinger744","date":"2015-08-06T09:36:30.840+0000","up_votes":4,"down_votes":0,"body":"Too much mobility.\n\nI think I just had an aneurysm.\n\n{{champion:429}} GAREN {{champion:157}} HAS {{champion:245}} TOO {{champion:238}} MUCH {{champion:92}} MOBILITY {{champion:76}} GUISE {{champion:55}}","replies":[]},{"poster":"Tusutaki","date":"2015-08-06T09:53:58.157+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Erijian,realm=NA,application-id=3ErqAdtq,discussion-id=ownh6U3W,comment-id=0000,timestamp=2015-08-05T23:13:49.702+0000)\n>\n> RiotRepertoir said Garen had too much mobility to be allowed to deal so much damage late game (With the E buff); that's why they added the 20% self-slow when even trying to attack an enemy champion.\n> \n> Willing to bet he/she has never once played Garen.\n\nTOO {{champion:120}}  MUCH {{champion:79}} MOBILITY {{champion:102}} TO {{champion:254}} DEAL {{champion:62}}  SO {{champion:24}} MUCH {{champion:76}} DAMAGE {{champion:421}} \n\nBRUISER EDITION","replies":[]},{"poster":"JAGMAG","date":"2015-08-06T16:35:35.790+0000","up_votes":1,"down_votes":0,"body":"idk a late game garren who builds only brutilzer for damage if he ever gets within melee range your fucked unless you have several kiting abilities","replies":[]},{"poster":"Icestar1186","date":"2015-08-06T00:53:55.870+0000","up_votes":1,"down_votes":0,"body":"Garen? Mobile? WTF.","replies":[]},{"poster":"Sir Yamazuki","date":"2015-08-06T00:15:53.750+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Erijian,realm=NA,application-id=3ErqAdtq,discussion-id=ownh6U3W,comment-id=0000,timestamp=2015-08-05T23:13:49.702+0000)\n>\n> RiotRepertoir said Garen had too much mobility to be allowed to deal so much damage late game (With the E buff); that's why they added the 20% self-slow when even trying to attack an enemy champion.\n> \n> Willing to bet he/she has never once played Garen.\n\nOr even seen Garen, he's one of the least mobile champions. There are a million champions who get mobility and cc while 100-0ing champions. Once again their logic like they did when they visually updated him is idiotic.","replies":[]}]},{"poster":"Gigahappytown","date":"2015-08-05T23:14:48.608+0000","up_votes":5,"down_votes":0,"body":"Attacking the villain should give you a 40% movespeed boost and 30% slow reduction","replies":[]},{"poster":"Vistha Kai","date":"2015-08-05T23:24:12.214+0000","up_votes":4,"down_votes":0,"body":">He actually now kites himself. \n\nSo true it hurts me inside.\nAnd I don't even play Garen.","replies":[]},{"poster":"Matezoide","date":"2015-08-05T23:16:25.992+0000","up_votes":3,"down_votes":0,"body":"To be honest, i think his new late game is worse now.\n\n\nSure, he deals more damage now even without the Villain system....\n\n\nBut you are also far more frail than ever, you have zero stickyness due to the massive slow, your Tenacity got deleted and his one form of CC took a huge nerf. On Live i rarely had issues killing ADCs that were out of position, for instance.\n\nThen theres the Villain system. I managed to make use it of fairly rarely, and although it got me a few kills, it is just too unreliable and seems to be eating a lot of Garen's power budget.","replies":[]},{"poster":"Icestar1186","date":"2015-08-06T00:55:05.983+0000","up_votes":2,"down_votes":0,"body":"I agree completely. While the Darius changes are not too objectionable, all the rest seem like they will cause serious problems. Skarner, especially, will have issues after this.","replies":[{"poster":"Critmaster Garen","date":"2015-08-06T00:56:34.698+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Icestar1186,realm=NA,application-id=3ErqAdtq,discussion-id=ownh6U3W,comment-id=0007,timestamp=2015-08-06T00:55:05.983+0000)\n>\n> I agree completely. While the Darius changes are not too objectionable, all the rest seem like they will cause serious problems. Skarner, especially, will have issues after this.\n\nthe skarner changes just seem pretty snowbally to either side.\n\nif his team is ahead in map control theyre even more ahead. if theyre behind, theyre even more behind.","replies":[{"poster":"Icestar1186","date":"2015-08-06T01:00:22.818+0000","up_votes":1,"down_votes":0,"body":"That, and it's much harder for him to stun multiple targets in a single fight. If the mark from your E runs out, you'll be waiting a while before you can use it again. Before, he could stack lots of stuns with his q. It's what made him useful in longer teamfights. Sure, his ult is pretty good at locking down a single target, but in longer fights he needs to get stuns off on whoever the main threat is.","replies":[]}]}]},{"poster":"Count Buffon","date":"2015-08-06T00:53:11.671+0000","up_votes":2,"down_votes":0,"body":"{{champion:36}}  18/4/5","replies":[]},{"poster":"Critmaster Garen","date":"2015-08-06T00:50:57.584+0000","up_votes":1,"down_votes":0,"body":"what scares me, is that they dont even understand that the attack range buff is not actually a buff or useful for him. they gave it to him because he has a big sword (seriously, that was his answer on the pbe thread).\n\nwhat it WILL mean for garen is, that between hitting an opponent from a further distance with his q to activating his spin, that hes 50 units further away from his target when he goes into the spin. which combined with the self slow makes it easier to walk out of it.\n\nso its not even a buff in that sense. not to mention, he doesnt even fucking auto much. he isnt darius who wants to auto his opponent between q casts to apply bleed stacks. theyre putting some of his power budget into a useless feature.\n\ni mean if he even ahd his crit scaling, then it would be somewhat useful with a ghostblade? but thats less of a useful option for him now.","replies":[]},{"poster":"Generalist","date":"2015-08-05T23:20:08.912+0000","up_votes":1,"down_votes":0,"body":"Thing is I can see this new garen being abused by enemy team.  His ulti is taken out of his hands and into the enemy team which I dislike.  It forces garen to dive the enemy back line for the adc with all the kills most game rather than be in the middle of the fight as brawler and cc sponge as well as soak up damage for his team.  This means you have to have another tank or brawler to fill this role now that Garen is at a disadvantage if he doesn't go straight for the villian","replies":[]}]}