{"poster":"Critmaster Garen","date":"2016-02-08T01:01:22.402+0000","title":"so is anything gonna be done for the resolve tree?","subforum":"Gameplay","up_votes":6,"down_votes":5,"body":"since you butchered the veteran scars mastery for tanks and fighters, most of them dont even bother with the tree anymore. they either go into ferocity or cunning.\n\nstregth of the ages is still weak with a gimmick attached that is completely useless by the time you get it.\n\ngarens highest winrate mastery build is thunderlords by far with a 10% difference to going into resolve.\nhttp://champion.gg/champion/Garen\n\nthis is ridiculous. you made the tree officially aimed at tanks and juggernauts and then just threw a load of masteries in there that are aimed at squishy carries to use for the early game, and even removed one of the few scaling masteries.\n\n\nplease to something really useful with strength of the ages and either replace useless masteries like tough skin and recovery, or buff them, or add more useful ones aimed at resistance and health stackers.\n\nideally we could use a few masteries that help us against adc in lane.","replies":[{"poster":"Best KhaZix Void","date":"2016-02-08T01:10:45.486+0000","up_votes":13,"down_votes":2,"body":"strength is used by most every jungler right now.\n\nGrasp is still used on every melee top\n\nBond is good on supports.","replies":[{"poster":"DeathBurst","date":"2016-02-08T04:01:10.596+0000","up_votes":3,"down_votes":2,"body":"Grasp is good, but no, a lot of melee top still take thunderlord, as exemplified by the champion.gg page OP linked.\n\nWhen a lot of fighters/tanks go deep into the tree intended for Assassins and Burst mages and are actually effective with it, there is an issue.\n\nThat being said, the sample size on champion.gg is small, so maybe the effectiveness is just an anomaly, and people are still using thunderlord just because they didn't took the time to read the patch notes.","replies":[{"poster":"AlwaysByMySide","date":"2016-02-08T08:45:33.657+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=DeathBurs7,realm=EUW,application-id=3ErqAdtq,discussion-id=zLAOo9gq,comment-id=00000001,timestamp=2016-02-08T04:01:10.596+0000)\n>\n> Grasp is good, but no, a lot of melee top still take thunderlord, as exemplified by the champion.gg page OP linked.\n> \n> When a lot of fighters/tanks go deep into the tree intended for Assassins and Burst mages and are actually effective with it, there is an issue.\n\nWhen you say \"a lot\", what you mean is \"pretty much just Garen\". \n\nBecause it's pretty much just Garen who is doing that, among tanks and heavy bruisers.","replies":[{"poster":"Critmaster Garen","date":"2016-02-08T12:08:42.052+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Memeglaive Garen,realm=NA,application-id=3ErqAdtq,discussion-id=zLAOo9gq,comment-id=000000010001,timestamp=2016-02-08T08:45:33.657+0000)\n>\n> When you say \"a lot\", what you mean is \"pretty much just Garen\". \n> \n> Because it's pretty much just Garen who is doing that, among tanks and heavy bruisers.\n\nlook into the statistics he linked. not actually a bad site. grasp is a good mastery for tanks and figters, but the tree is lacking in t1 and t2 masteries for them.\n\nyou really only go into the tree when you want the keystones. but even then, you can see strength of the ages and bond of stone are practically never picked.","replies":[{"poster":"AlwaysByMySide","date":"2016-02-08T20:02:39.335+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Critmaster Garen,realm=NA,application-id=3ErqAdtq,discussion-id=zLAOo9gq,comment-id=0000000100010000,timestamp=2016-02-08T12:08:42.052+0000)\n>\n> look into the statistics he linked. not actually a bad site. grasp is a good mastery for tanks and figters, but the tree is lacking in t1 and t2 masteries for them.\n> \n> you really only go into the tree when you want the keystones. but even then, you can see strength of the ages and bond of stone are practically never picked.\n\nProbably because they want to have something resembling laning presence, and Grasp of the Undying is bar none THE best mastery for that, better than Thunderlords. They both do roughly equal damage, but Grasp has a lower cooldown and also heals you.\n\nBond of stone? Only tanky ward bitches take that, or sometimes more supportive non-support tanks like Amumu.\n\nStrength of the Ages? The only champion I can think of that goes top lane that might want this mastery is MAYBE Nasus, since he doesn't have much lane presence anyway. \n\nWhen you say \"practically never picked\", what you mean is \"practically never picked... in top lane only, they're actually picked all the time in bottom lane and the jungle\".","replies":[{"poster":"Critmaster Garen","date":"2016-02-08T20:13:47.985+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Memeglaive Garen,realm=NA,application-id=3ErqAdtq,discussion-id=zLAOo9gq,comment-id=00000001000100000000,timestamp=2016-02-08T20:02:39.335+0000)\n>\n> Probably because they want to have something resembling laning presence, and Grasp of the Undying is bar none THE best mastery for that, better than Thunderlords. They both do roughly equal damage, but Grasp has a lower cooldown and also heals you.\n> \n> Bond of stone? Only tanky ward bitches take that, or sometimes more supportive non-support tanks like Amumu.\n> \n> Strength of the Ages? The only champion I can think of that goes top lane that might want this mastery is MAYBE Nasus, since he doesn't have much lane presence anyway. \n> \n> When you say \"practically never picked\", what you mean is \"practically never picked... in top lane only, they're actually picked all the time in bottom lane and the jungle\".\n\nno, practically never picked means practically never picked.\n\nstrength of ages, and bond of stone both have about 1.5% pickrate. even if bond of stone would be picked mainly on tank supports, it should generally get picked a lot more often than this.\n\nif every other game had a support tank on one team, the pickrate should still be around 5%.\n\nand if a lot of junglers would pick strength of ages then the same would go for that keystone.\n\nmy main issue however is not even the keystones (except stregth of the ages). its more with the t1 and t2 masteries. a lot of them are actually bad past lvlk 3 and dont scale. the other ones are very specific.","replies":[]}]}]},{"poster":"DeathBurst","date":"2016-02-08T15:20:10.571+0000","up_votes":1,"down_votes":0,"body":"Darius too. Olaf too. And Gnar. And Aatrox, Jax, Irelia, etc.\n\nIt's not bad that there is choice available, but it sure is strange to notice that so many melee tanky champs are going so deep into cunning.","replies":[]}]},{"poster":"LankPants","date":"2016-02-08T04:51:54.063+0000","up_votes":1,"down_votes":0,"body":"I'd recommend League of Graphs, unlike Champ GG they update constantly so the data shown is the last week approximately rather than the first 4 days of the patch.\n\nhttp://www.leagueofgraphs.com/champions/masteries/top\n\nWhile it's not perfect this shows that a lot of top laners are using Grasp of the Undying. Bear in mind though this covers every single top laner, including things like Rumble who should never use Undying.\n\nIf you look at some individual champs you can see that Grasp is quite popular on a lot of top laners.","replies":[]}]},{"poster":"LankPants","date":"2016-02-08T02:40:58.318+0000","up_votes":2,"down_votes":1,"body":"The keystones are fine, the problem is how terrible the lower tiers are.\n\nIn T2 there's one good mastery, and it's not actually good unless you have forms of regen in your kit. The problem is that Vet Scars is literally so bad that tanks who logically shouldn't take Runic Armour are running it because the base HP regen it gives is better than Vet Scars.\n\nTier 2 of resolve is actually painful in how little it does for you if your name isn't Mundo.","replies":[]}]},{"poster":"Meddler","date":"2016-02-08T02:09:34.023+0000","up_votes":10,"down_votes":6,"body":"We'll be continuing to work on the mastery system throughout the year, both balancing existing masteries and adding new ones (next addition likely being Expose Weakness returning as a tier 1 Ferocity keystone). As far as the resolve tree goes I don't feel it's in a terrible place at present, we're seeing some use of all the tier 3 keystones and a number of champions that are heavy resolve users are in pretty impactful spots power wise. It could certainly do with some more options at the Tier 1 and 2 keystone levels though, particularly since some of the existing options there are a bit too niche. \n\nAdditionally resolve's not going to be the right choice for every tough champion. It should generally be appealing to both tough champs who want to double down on their defense and squishier champs looking to get a bit of defense from somewhere. It's a tree that should be appealing to tanks and juggernauts, but it's not intended to be their 'official' tree, so if some of them feel better served in other trees that's all good.","replies":[{"poster":"LankPants","date":"2016-02-08T02:20:05.910+0000","up_votes":11,"down_votes":1,"body":">Additionally resolve's not going to be the right choice for every tough champion. It should generally be appealing to both tough champs who want to double down on their defense and squishier champs looking to get a bit of defense from somewhere. It's a tree that should be appealing to tanks and juggernauts, but it's not intended to be their 'official' tree, so if some of them feel better served in other trees that's all good.\n\nWhat else are tanks specifically going to use?\n\nThe other trees are garbage for them. Right now if I could sink 30 points into resolve as a tank I would, and that's with resolve having some fairly poor masteries outside of T3. The only masteries from other trees I take are the ones that help me to jungle faster.\n\nAlso the change from 4% HP to 45 flat HP was just terrible for tanky champs. Most tanks will have 700 HP at level 1, 4% max HP gives them 28 at this number. The difference at low levels is negligible but at higher levels the mastery is terrible. The change just left non-regen based tanks with nothing at this level.","replies":[]},{"poster":"HotChilly","date":"2016-02-08T03:48:07.505+0000","up_votes":3,"down_votes":0,"body":"Any thoughts about GP's ability to use Grasp of the Undying so well in top lane? Would removing his ability to proc it from range be enough to get him out of pick / ban in high elo?","replies":[]},{"poster":"Champion Skin","date":"2016-02-08T03:08:15.914+0000","up_votes":2,"down_votes":0,"body":"I feel like Resolve Keystones are mostly fine... though the lower masteries really aren't all that great so it is pretty useless going 12 into resolve which does kind of limit things","replies":[]},{"poster":"Critmaster Garen","date":"2016-02-08T02:13:03.939+0000","up_votes":3,"down_votes":2,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=zLAOo9gq,comment-id=0004,timestamp=2016-02-08T02:09:34.023+0000)\n>\n> We'll be continuing to work on the mastery system throughout the year, both balancing existing masteries and adding new ones (next addition likely being Expose Weakness returning as a tier 1 Ferocity keystone). As far as the resolve tree goes I don't feel it's in a terrible place at present, we're seeing some use of all the tier 3 keystones and a number of champions that are heavy resolve users are in pretty impactful spots power wise. It could certainly do with some more options at the Tier 1 and 2 keystone levels though, particularly since some of the existing options there are a bit too niche. \n> \n> Additionally resolve's not going to be the right choice for every tough champion. It should generally be appealing to both tough champs who want to double down on their defense and squishier champs looking to get a bit of defense from somewhere. It's a tree that should be appealing to tanks and juggernauts, but it's not intended to be their 'official' tree, so if some of them feel better served in other trees that's all good.\n\nsome additional t1 and t2 masteries would be really nice.\n\nwhats your opinion on recovery as a mastery? it really doesnt feel like it adds a lot to the tree. even for the first 5 points, 2hp5 seems rather weak. and thank you for responding.","replies":[{"poster":"LankPants","date":"2016-02-08T02:22:54.510+0000","up_votes":2,"down_votes":0,"body":">whats your opinion on recovery as a mastery? it really doesnt feel like it adds a lot to the tree. even for the first 5 points, 2hp5 seems rather weak. and thank you for responding.\n\n2hp/5 may seem low, but it's certainly more significant than 45 HP. In order to regenerate 45 HP that mastery only needs just under two minutes. It's certainly not great but at the moment it's still better than the tier two mastery, which I'd say is a huge problem.","replies":[{"poster":"Critmaster Garen","date":"2016-02-08T02:25:40.289+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=LankPants,realm=OCE,application-id=3ErqAdtq,discussion-id=zLAOo9gq,comment-id=000400000000,timestamp=2016-02-08T02:22:54.510+0000)\n>\n> 2hp/5 may seem low, but it's certainly more significant than 45 HP. In order to regenerate 45 HP that mastery only needs just under two minutes. It's certainly not great but at the moment it's still better than the tier two mastery, which I'd say is a huge problem.\n\nyea, but recovery, tough skin, the changed veteran scars. this all seems like its designed to be useful on lvl 1-3 and then you can forget about it.\n\nmeanwhile, even when 2% ability damage or 4% attack speed is not a lot, it still scales. there is so much % damage increase just in the t1 and t2 masteries of ferocity and cunning, that will still be useful into the lategame.\n\nmeanwhile a lot of the early resolve masteries seem like throwaway masteries that are completely insignificant past the first few levels. this is what makes it so hard wanting to go into that tree.","replies":[{"poster":"Rain NT","date":"2016-02-09T19:17:08.241+0000","up_votes":1,"down_votes":0,"body":"thats the answer, recovery should scale slowly in levels.","replies":[]}]}]},{"poster":"Meddler","date":"2016-02-08T02:46:09.116+0000","up_votes":7,"down_votes":5,"body":"The tier it's at has a really low power budget, somewhere around the 110g mark from memory. For its budget I feel it's a reasonable option. It's not going to be particularly noticeable, but little is with that little power in it.","replies":[{"poster":"SaltyKracka","date":"2016-02-08T16:28:24.623+0000","up_votes":2,"down_votes":1,"body":"And yet Assassin is uh...really damn powerful right now.","replies":[]},{"poster":"Earl Eulrich","date":"2016-02-08T12:54:10.494+0000","up_votes":2,"down_votes":1,"body":"you know, i think right now you could just easily get rid of all the filler masteries and make it keystone only, as that´s really what it´s all about and it´ll make it easier for newer players and for balancing. \nthe new masteries really don´t create much interessting choices - you pick a champion and a role and then you know 99% what your keystone will be for this game and that´s it.","replies":[]}]}]}]},{"poster":"Sohleks","date":"2016-02-08T01:29:20.309+0000","up_votes":5,"down_votes":0,"body":"12 resolve is the weakest 12. The most rare off spec. It would be nice if the brawn here was buffed slightly particularly for non dedicated tanks so that maybe carries or fighters/ap bruisers might actually situationally consider resolve for their off spec instead of cunning or ferocity.\n\nIMO give tough skin a lil higher versus champion value.\n\nThe major culprit is probably the mid tier keystones. Those are very rarely impactful. Spell reduction looks op on paper but it's not enough to hold its own.","replies":[]},{"poster":"PlatypusSurprise","date":"2016-02-08T01:16:48.195+0000","up_votes":4,"down_votes":2,"body":"All of the resolve keystones are seeing use right now >.>\n\nJust about every LCS jungler is running Strength of ages so I don't really think it's that weak...\nGrasp is run by tanky top laners (bursty ones still like thunderlords better)\nand Bond of stone is only being used for supports which is what it was designed for when they came out with it.","replies":[{"poster":"Critmaster Garen","date":"2016-02-08T01:26:24.995+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=PlatypusSurprise,realm=NA,application-id=3ErqAdtq,discussion-id=zLAOo9gq,comment-id=0002,timestamp=2016-02-08T01:16:48.195+0000)\n>\n> All of the resolve keystones are seeing use right now >.>\n> \n> Just about every LCS jungler is running Strength of ages so I don't really think it's that weak...\n> Grasp is run by tanky top laners (bursty ones still like thunderlords better)\n> and Bond of stone is only being used for supports which is what it was designed for when they came out with it.\n\ni think the main reason its picked up by every jungler is that its literally the only keystone that works for them. every other keystone is aimed at fighting champions and doesnt even trigger on jungle monsters.\n\nwhat else are you gonna take that assists you in jungling? deathfire touch? \n\nits not necessarily that stregth of the ages is good on junglers, but the only one that does anything at all on them.","replies":[{"poster":"Abyssphere","date":"2016-02-08T02:48:29.464+0000","up_votes":5,"down_votes":1,"body":"> [{quoted}](name=Critmaster Garen,realm=NA,application-id=3ErqAdtq,discussion-id=zLAOo9gq,comment-id=00020000,timestamp=2016-02-08T01:26:24.995+0000)\n>\n> i think the main reason its picked up by every jungler is that its literally the only keystone that works for them. every other keystone is aimed at fighting champions and doesnt even trigger on jungle monsters.\n> \n> what else are you gonna take that assists you in jungling? deathfire touch? \n> \n> its not necessarily that stregth of the ages is good on junglers, but the only one that does anything at all on them.\n\nEvery keystone makes you better at fighting champions and does basically nothing aside from that. Strength of the Ages is not a major exception to that - the vast majority of its power budget goes into giving you better survivability in fights. Its use in late game tankiness for team fights is comparable on junglers to Thunderlord's as a damage amp in ganks. SotA is being taken so much on junglers not because it's the only useful keystone on them (not at all the case) but because they're the only champions that can reliably and quickly stack it. If every role could stack it like junglers can then I imagine you'd be seeing it on a *lot* more people. I could envision an almost Thunderlord's-esque monopoly.\n\nPeople need to stop thinking that junglers don't do anything except... jungle. They fight people too, and keystones make them better at that.","replies":[]}]}]},{"poster":"Incognonymous","date":"2016-02-08T03:54:53.376+0000","up_votes":2,"down_votes":0,"body":"It's almost like a little more thought should've been put into the new mastery tree before the complete removal of the old one.","replies":[{"poster":"Khell DarkWolf","date":"2016-02-09T18:49:08.671+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Incognonymous,realm=NA,application-id=3ErqAdtq,discussion-id=zLAOo9gq,comment-id=0007,timestamp=2016-02-08T03:54:53.376+0000)\n>\n> It's almost like a little more thought should've been put into the new mastery tree before the complete removal of the old one.\n\nPretty much.\n\nR.I.P. Old masteries :(","replies":[]}]},{"poster":"LostFr0st","date":"2016-02-08T03:52:32.960+0000","up_votes":2,"down_votes":0,"body":"I would like the crit reduction mastery back in some form, idk about everyone else.  \nFirst/second item Randuin's isn't exactly the best choice.","replies":[]},{"poster":"The Yetii Rider","date":"2016-02-08T02:34:30.656+0000","up_votes":1,"down_votes":2,"body":"T1 has scaling armor/MR. Scales fine into the late game.\n\nThe Veterans Scars mastery was changed because of its synergy with Cinderhulk. \n\nIt's decent enough on non tanks. \n\n8% additional regen and healing scales perfectly fine.","replies":[{"poster":"Champion Skin","date":"2016-02-08T03:12:27.017+0000","up_votes":3,"down_votes":1,"body":"Veteran Scars is pretty horrible on everyone... on almost all champions it is better to take the improved regen (and shields and healing) simply because that will give you more HP because of potions and health regen","replies":[]}]},{"poster":"Luciferrr","date":"2016-09-12T22:26:37.533+0000","up_votes":1,"down_votes":0,"body":"I feel as if decreasing the original buffs from the masteries and making most of them scale better throughout the game throughout the game would satisfy. I think the masteries in the resolve tree are fine, aside from tough skin and veteran scars. Granted if you have veteran scars, strength of the ages and health runes or quints in your runeset the masteries would ass for a major bonus but I feel as if veteran scars is just a weak mastery past level 4 when (most) champions auto attack for over 60 damage by then anyways. And my problem with tough skin is basically the same, unless you have your runes and masteries set towards the same thing it just seems like making a diverse runes and mastery page and using them \ntogether is pointless.","replies":[]},{"poster":"Rain NT","date":"2016-02-09T19:14:01.095+0000","up_votes":1,"down_votes":0,"body":"Ehh theres champs that goes resolve tree, most junglers do for strength of the ages. I go wraith of the undying when im the top laner using a tank like irelia darius trundle mundo, sometimes I even go bond of stone when im top facing a strong aggressive champ top like riven or something for that 4% damage reduction.\n\nImo the ferocity tree is so bad UNTIL the penetration and the keystones, theres only two usable keystone and the only one thats really strong is Fevor. Most players wont even go Deathfire Touch because Thunderlord is better for laning, but it atleast has its use unlike Warlord Bloodlust :/.\n\nIn the defensive tree you can basically use every stat it gives you. And imo thats a good trait.\n\nImo cunning and resolve are my two favourite trees atm.","replies":[]},{"poster":"MysticFlameHaze","date":"2016-02-08T08:22:25.981+0000","up_votes":1,"down_votes":0,"body":"I love grasp of undying on GP, darius and Vi, it gives you a lot of survive ability in fights and the whole mechanic of it is really nice, you just have to be in combat for so long and there's no cooldown","replies":[]},{"poster":"Dominick Destine","date":"2016-02-08T01:11:37.187+0000","up_votes":2,"down_votes":2,"body":"There was no reason to nerf Bond of Stone and yet they did.","replies":[]}]}