{"poster":"Shinning Shogun","date":"2015-10-30T19:07:57.785+0000","title":"Ban Permanente? Rito, media pila","subforum":"Comportamiento del jugador","up_votes":3,"down_votes":8,"body":"Voy a ser breve, desde que empeze a jugar league of leguends (season 2) me cruce con todo tipo de jugadores y todo tipo de actitudes, pero algo que es muy molesto y todos sabemos, es la gente que juega mal. No hablo de partidas normales sino de las clasificatorias. Yo, siendo platino, espero que la gente que juega conmigo al menos tenga una idea de lo que hace, pero no es el caso en casi ninguna partida. Generalmente juego de jungla, una linea bastante criticada. La situacion fue la siguiente, Mi top pierde, el mid pierde y bot tambien, lo que ellos me plantearon (no de una buena forma obviamente) fue que tenia que gankear. Gankee e hice lo que pude pero igualmente perdimos, despues de esto me reportaron por AFK y RITO decidio bannearme la cuenta. Mi mid 2/13 mi top 2/9 mi support 2/7, Les parece justo? dejen comentarios {{champion:32}} {{summoner:3}}","replies":[{"poster":"Lince Salvaje","date":"2015-10-30T19:20:44.949+0000","up_votes":1,"down_votes":0,"body":"la verdad si te vas afk  merecido el ban lo tienes ademas nunca se banea por 1 partida, tienes que haber juntado muchos reportes ademas de tener un comportamiento repetitivo.\nte repito no te banearon por esa partida y siendo platino ya lo deberías de saber. :) saludos refórmate y empieza de nuevo","replies":[{"poster":"Shinning Shogun","date":"2015-10-30T19:27:00.463+0000","up_votes":4,"down_votes":1,"body":"No, la cosa es que no me fui afk, lo que si admito es que no tengo un buen comportamiento porque casi todas, o todas las partidas insulto a los que juegan mal.","replies":[{"poster":"II Thanatos II","date":"2015-10-30T22:30:42.064+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Shinning Shogun,realm=LAS,application-id=PJAKt7ph,discussion-id=ZYPApnts,comment-id=00010000,timestamp=2015-10-30T19:27:00.463+0000)\n>\n> No, la cosa es que no me fui afk, lo que si admito es que no tengo un buen comportamiento porque casi todas, o todas las partidas insulto a los que juegan mal.\n\n¿ Que ganas con insultar al que juega mal?,ese jugador no mejorarara magicamente porque lo insultes.\n\nCreo que te Banearon por Toxico, explicas que flameas en todas las partidas, eso quiere decir multitud de reportes, es decir el Ban esta bien ejecutado","replies":[{"poster":"Shinning Shogun","date":"2015-11-06T20:06:44.142+0000","up_votes":1,"down_votes":0,"body":"Obviamente no gano nada, pero pensalo por un minuto. Que hace un jugador que no sabe jugar de adc o support o lo que sea en platino?\n Se supone que en esa liga la gente sabe jugar, todos tenemos malas partidas ya lo se porque me pasa tambien, pero ya hay cosas que son cuestion de saber estrategia por ejemplo cuando freezear linea, cuando pushear,donde wardear, etc...\nMe equivoque en insultarlos? es complicado decir que si, no se, si esperan que los felicite por jugar mal?\n\nSaludos","replies":[]}]},{"poster":"Silver000","date":"2015-10-30T20:12:02.456+0000","up_votes":2,"down_votes":0,"body":"en ese caso de seguro te reportaron por eso","replies":[]}]}]},{"poster":"Hernan Bozzano","date":"2015-10-30T19:15:23.347+0000","up_votes":3,"down_votes":0,"body":"1- cuando top te flamea lo muteas\n2- cuando mid te flamea lo muteas\n3- cuando bot te flamea los muteas\n4- si te fuiste afk, hicieron bien en reportarte\n5- aca hay dos opciones: estas mintiendo o estas omitiendo informacion relevante, riot jamas banearia una cuenta (no especificas pero parece ser ban permanente) porque te fuiste afk una vez.\n6- si sentis injusta la sancion podes enviar un ticket al soporte.\n\ntu redaccion es bastante buena, usas las comas y hoy en dia nadie lo hace, sin embargo, permitime decirte que se dice \"crucé\"","replies":[{"poster":"Krilin Noda Oro","date":"2015-10-30T19:23:40.533+0000","up_votes":3,"down_votes":0,"body":"https://31.media.tumblr.com/d9ecaeb9b27bea32c98fbc3fd2a56884/tumblr_inline_nhr91p96TW1qk1op9.gif\n\nMejor dicho imposible.","replies":[]},{"poster":"Shinning Shogun","date":"2015-10-30T19:25:52.082+0000","up_votes":1,"down_votes":0,"body":"Si perdón, lo pase por alto, no me fui afk, seguí jugando hasta que termino la partida.","replies":[]}]},{"poster":"HornBore","date":"2015-10-30T19:48:52.719+0000","up_votes":1,"down_votes":0,"body":"Es al pedo jugar en serio en este juego, ni te gastes.. yo jugue las 10 partidas para estar en oro por las recompensas nomas, es imposible jugar en serio en este servidor, solo queda jugar normales trolleando o algun aram quizás. Si querés jugar en serio las clasificatorias te recomiendo el server de Brasil, o NA si no tenés mucho ping.\n\nSaludos","replies":[{"poster":"Shinning Shogun","date":"2015-11-06T20:06:26.086+0000","up_votes":1,"down_votes":0,"body":"Tenes toda la razon.","replies":[]}]}]}