{"poster":"AramOnlyDsdeLaS4","date":"2015-07-21T21:58:44.089+0000","title":"Actor de voz de Gangplank triste por culpa de rito","subforum":"Charlas Generales","embed":{"description":"3013 points and 881 comments so far on reddit","url":"https://www.reddit.com/r/leagueoflegends/comments/3e3qai/the_original_gangplank_voice_actor_is_sad_and_so/","image":"http://b.thumbs.redditmedia.com/YG-VWrHJRGGY2bg_Tw_Mamu-Hc7q1CELoTNZj0Q_tKk.jpg"},"up_votes":31,"down_votes":3,"body":"Solo quer&iacute;a compartir uno de los temas m&aacute;s hablados de hoy en reddit, en d&oacute;nde la comunidad mundial del lol apoya al viejo actor de la voz de gangplank, taric y otros champs, que con el rework a gp fue reemplazado por otro actor mediocre.\r\n\r\n El hombre se queja de que riot b&aacute;sicamente se cag&oacute; en su trabajo al ni siquiera consultarle que lo iban a reemplazar, siendo que el le dedic&oacute; mucho a la creaci&oacute;n de las voces  y tambi&eacute;n argumenta que a &eacute;l lo hab&iacute;an contratado cuando el lol no era lo que es hoy, y tras la fama y el &eacute;xito del juego, se comportaron muy mal con el pobre tipo.\r\n\r\nAc&aacute; est&aacute; la carta completa que dej&oacute; el actor.\r\nhttps://www.linkedin.com/grp/post/3544410-6028578303231668227","replies":[{"poster":"Nahejaz","date":"2015-07-21T22:33:43.370+0000","up_votes":7,"down_votes":0,"body":"Hola, me tome el trabajo de traducirlo (seguramente tenga errores)\n\n\"Hola a todos, soy la persona que hizo la voz de Gangplank, Taric y Heimendinget. El otro dia me entere que contrataron a otra persona para hacer la nueva voz de Gangplank sin nisiquiera contactarme a mi. No necesito decir que estaba en desacuerdo y estube mucho mas desacuerdo despues de ver las grabaciones. Parece una mala copia de lo que originalmente hize, siempre estube orgulloso de la voz que le di. Esperaba que las personas que crearon el personaje cuando el LOL era un brillo en los ojos de una persona (no tenia idea de como traducir esta frase), pense que tendrian mas respeto por la calidad de nuestro trabajo y que yo sea el primero en ser contactado para estos cambios ahora que esto es un gran juego.\n\nQue piensan de la nueva voz vs la vieja voz? Les importaria si derrepente su personaje favorito tiene una voz distinta? Si ese hubieras sido vos, no te gustaria poder hacer un buen trabajo para una compania no reconocida y luego no ser apartado cuando ellos se hacen reconocidos?\"\n\n(la proxima vez lo escribo todo junto y no bajo renglones en el bloc de notas)","replies":[{"poster":"d DeadRabbit b","date":"2015-07-22T05:10:30.918+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nahejaz,realm=LAS,application-id=v7qsfXsE,discussion-id=Ene0jpeL,comment-id=0004,timestamp=2015-07-21T22:33:43.370+0000)\n>\n> Hola, me tome el trabajo de traducirlo (seguramente tenga errores)\n> \n> \"Hola a todos, soy la persona que hizo la voz de Gangplank, Taric y Heimendinget. El otro dia me entere que contrataron a otra persona para hacer la nueva voz de Gangplank sin nisiquiera contactarme a mi. No necesito decir que estaba en desacuerdo y estube mucho mas desacuerdo despues de ver las grabaciones. Parece una mala copia de lo que originalmente hize, siempre estube orgulloso de la voz que le di. Esperaba que las personas que crearon el personaje cuando el LOL era un brillo en los ojos de una persona (no tenia idea de como traducir esta frase), pense que tendrian mas respeto por la calidad de nuestro trabajo y que yo sea el primero en ser contactado para estos cambios ahora que esto es un gran juego.\n> \n> Que piensan de la nueva voz vs la vieja voz? Les importaria si derrepente su personaje favorito tiene una voz distinta? Si ese hubieras sido vos, no te gustaria poder hacer un buen trabajo para una compania no reconocida y luego no ser apartado cuando ellos se hacen reconocidos?\"\n> \n> (la proxima vez lo escribo todo junto y no bajo renglones en el bloc de notas)\n\nLo podrías traducir como \"no era más que un sueño\", creo.","replies":[]},{"poster":"Vel God","date":"2015-07-21T22:41:29.445+0000","up_votes":1,"down_votes":0,"body":"Esta bien, solo el detalle de que en la carta él no se sentía en desacuerdo sino decepcionado","replies":[]}]},{"poster":"LST Slime Blue","date":"2015-07-22T15:54:32.527+0000","up_votes":3,"down_votes":0,"body":"Riot siempre caga a todo el mundo, no es de esperar menos","replies":[]},{"poster":"Vel God","date":"2015-07-21T22:29:59.009+0000","up_votes":3,"down_votes":0,"body":"LinkedIn y reddit están que arden, a ver que pasa con este foro...\n\nPD: Ese actor también hacia la voz de Heimerdinger y Taric","replies":[{"poster":"Gig GOD OF DEATH","date":"2015-07-21T22:53:03.464+0000","up_votes":2,"down_votes":0,"body":"Veamos...","replies":[]},{"poster":"BronzaKaiser","date":"2015-07-22T01:33:15.695+0000","up_votes":2,"down_votes":1,"body":"¿Que tiene que pasar en este foro? Es decir claramente es triste lo de él, pero nosotros tenemos al actor de doblaje original de Gangplank para LA (Carlos Segundo, la voz de Piccolo de Dragon Ball Z).","replies":[{"poster":"Marco","date":"2015-07-23T04:26:43.091+0000","up_votes":1,"down_votes":0,"body":"Nada (y el tipo que subio el post lo deja bastante claro ), pero si tiene que ver con el lol en general, ya que es una noticia de importancia al otro lado del mundo","replies":[]}]}]},{"poster":"Nameless1224","date":"2015-07-22T07:01:19.168+0000","up_votes":1,"down_votes":1,"body":"Hombre, no soy experto en sonido pero #1.- La voz del antiguo actor de {{champion:41}}  no me parece la gran cosa y #2.- La voz del nuevo actor no esta nada mal","replies":[{"poster":"xXGospellXx","date":"2015-07-22T11:33:37.716+0000","up_votes":2,"down_votes":0,"body":"El nuevo tiene una voz corriente y nada que ver con el viejo gp,al menos en la version en ingles uno parece un pirata y el nuevo parece un tipo cualquiera,y si tubiera que decir mejor parece mas un capitan de la marina que un capitan de un barco piratas...a la unica skin que le queda bien esa voz nueva es a la de marinero..","replies":[]}]},{"poster":"Jelly Bean","date":"2015-07-22T06:15:25.671+0000","up_votes":2,"down_votes":0,"body":"No termino de entender que está pasando con Riot Games, la voz anterior de Gangplank era genial, sobre todo la risa diabólica cuando casteaba su ulti, yo ya practicamente no juego, Blizzard logró atraerme nuevamente con su moba. No es mi intención comparar, son mobas totalmente distintos, pero las historias que tiene este ultimo son realmente geniales y creo que eso es algo que me llevó a elegir dicha franquicia una vez mas. Siendo honesto Riot, a mi parecer, empezó a venirse abajo cuando todo lo del conflicto de shurima y esas cosas con las que llego Azir, cambiar toda la historia ROTUNDAMENTE, pero por favor... Algunas personas nos enamoramos de las historias.\n\n(Ni mencionar de los cambios en Fiora)","replies":[{"poster":"xXGospellXx","date":"2015-07-22T11:30:08.941+0000","up_votes":1,"down_votes":0,"body":"Las historias o simplemente el Pool Champ que tiene,con todos los heroes conocidos,porque si vamos a historia no tiene ni de cerca algo comparable al LOL...solo tiene campeones famosos de todas sus franquicias,nada mas...y obviamente con lo mejor de todos los mobas,es decir tubo todo en bandeja de plata sin siquiera sufrir por sus errores y yo no valoro ese tipo de juegos que vienen sacan lo mejor de todos sus competidores,les meten personajes famosos y se creen mejor que todos..\nIgualmente que lo disfrutes.","replies":[]}]},{"poster":"Lysaru","date":"2015-07-22T04:17:16.069+0000","up_votes":2,"down_votes":0,"body":"Bueno si es actor deberia saber que estas cosas pasan, verdad?","replies":[{"poster":"mahoro","date":"2015-07-22T15:55:00.174+0000","up_votes":1,"down_votes":0,"body":"claro que lo sabe pero yo tambien no importa cuantos años de carrera tenga igual me sentiria pasado a llevar, aunque riot no tiene obligacion legal de avisarle (o no creo)","replies":[]}]},{"poster":"Sir Crucifix ","date":"2015-07-21T23:03:59.911+0000","up_votes":2,"down_votes":0,"body":"pedia mucho dinero , entonces agarraron a un croto le dieron una pornogalleta {{item:2052}} y traduci wachin","replies":[]},{"poster":"Te Stunneo Papi","date":"2015-07-21T22:06:56.187+0000","up_votes":2,"down_votes":0,"body":"the feels {{champion:32}}","replies":[]},{"poster":"jal243","date":"2015-07-22T00:39:21.251+0000","up_votes":2,"down_votes":1,"body":"Denle unas naranjas a ese tipo!!","replies":[]},{"poster":"T4T421","date":"2015-07-23T16:10:18.020+0000","up_votes":1,"down_votes":0,"body":"Pero ese es el gp en ingles, como afecta eso a las???  :v\nen las tambien le cambiaron si no me equivoco...","replies":[]},{"poster":"waffen SS","date":"2015-07-23T00:43:46.768+0000","up_votes":1,"down_votes":0,"body":"Se cagan en las cuentas llenas de skins de miles dando ban permanente no se van a cagar en este tipo","replies":[]},{"poster":"d DeadRabbit b","date":"2015-07-22T20:52:55.558+0000","up_votes":1,"down_votes":0,"body":"A Riot le importa muy poco las personas mientras entre plata, es cuestión de mirar como se manejan en el soporte.","replies":[]},{"poster":"I am bl4z","date":"2015-07-22T19:59:38.289+0000","up_votes":1,"down_votes":0,"body":"Así como uno es libre de elegir comprar lo que quiera y le convenga, si a rito no le gusta este servicio y requiere uno mas barato, o que le convenga por otro motivo esta en su derecho de comprar en otro lado, rito es dueño del personaje y puede hacer y deshacer con el.","replies":[]},{"poster":"DarkSoul98","date":"2015-07-22T08:22:24.492+0000","up_votes":1,"down_votes":0,"body":"A si es el mundo, no se hubiera metido en nada si después va a andar llorando.\nPuede ser conmovedor o lo que sea, pero el negocio es negocio y hay contratos de por medio. No se puede venderle el alma al diablo y después querer reclamársela","replies":[]},{"poster":"TheJoaSnipper15","date":"2015-07-22T07:35:57.561+0000","up_votes":1,"down_votes":0,"body":"* {{champion:41}} Por que cambiaron la voz de Gangplank.. es triste y estubo mal lo que hisieron T-T {{item:3151}}","replies":[]},{"poster":"Ashley Lea Monde","date":"2015-07-22T02:36:54.244+0000","up_votes":1,"down_votes":0,"body":"No estoy de acuerdo. Al tipo le pagan por un trabajo y ya. Depende de la empresa (en este caso Riot) si satisfechos cno tu trabajo te vuelven a llamar o no. No tienen ninguna obligación con el tipo. A menos que haya algún tipo de contrato de por medio que le otorgue derechos sobre las voces de dichos personajes.","replies":[]},{"poster":"diegoslash","date":"2015-07-22T01:40:24.639+0000","up_votes":1,"down_votes":0,"body":"mi mejor amigo se cago en todo lo cagable cuando le cambiaron la voz a gp (le encantaba jugar con gp)(tambien se caga en sus nuevas habilidades)\npero creo que pronto estare en su misma situacion dado que es el mismo actor quien le dio su sensual voz a taric , si pasa esto ya no sera lo mismo {{item:3151}}","replies":[]},{"poster":"Score","date":"2015-07-21T22:45:47.198+0000","up_votes":1,"down_votes":0,"body":"riot cuida su bolsillo\n\nLe pido el doblaje a un actor de doblaje famoso que me cobra caro o a un doblista de segunda que le pago la colacion, el transporte y se va feliz","replies":[]},{"poster":"Ufaaaaaaaaaa","date":"2015-07-21T22:34:20.240+0000","up_votes":1,"down_votes":0,"body":"no se por que le molesta, Riot es otra empresa. Ya no le importan sentimentalismos o el bienestar de la gente, no le interesa que se creen lazos con los campeones (si creas mucho lazo con uno, no compras a otro), no le interesa la historia, ni nada. Solo que los pro players estén conformes y se vendan los e-sports, y que se vendan campeones, skins, recoloraciones pedorras y demás cosas. $$$$$$ y nada mas.","replies":[]},{"poster":"Bruce Lee","date":"2015-07-21T22:30:57.602+0000","up_votes":1,"down_votes":0,"body":"esto es tan triste {{champion:32}} {{summoner:3}} {{item:3070}} {{item:3073}} {{item:3151}}","replies":[]},{"poster":"Craaazy Diamond","date":"2015-07-21T22:27:21.774+0000","up_votes":1,"down_votes":0,"body":"{{champion:32}}","replies":[]}]}