{"poster":"Shield of Ooo","date":"2015-02-16T17:22:04.724+0000","title":"MidWestUnder sucht neue Mitglieder!","subforum":"Clans & Teams","embed":{"description":"MidWestUnder","url":"http://midwestunder.weebly.com/","image":"http://midwestunder.weebly.com/uploads/4/3/5/3/43532297/7728218.png"},"up_votes":1,"down_votes":0,"body":"**Vorwort**\nManch einer lebt für den Kampf, andere sind für das Kämpfen geboren. Jetzt wollen wir wissen ob du bereit bist dich zu behaupten. Kein Kampf kann ohne Krieger ausgetragen werden. Hast du Mut genug dich uns anzuschließen? 2 Teams, 10 Krieger, ein Schlachtfeld. Bist du bereit dich in den Kampf zu stürzen?\nKannst du selbst ausweglose Situationen meistern und dein Team motivieren?\nDann bist du bei uns genau richtig! Wir wollen starke Krieger wie dich! Wir wollen deinen Mut, deine Ideen, deine Leistung.\nWas du dafür bekommst? Reicht dir der Respekt des ganzen Teams? Vielleicht sogar neue Freundschaften und gemeinsame Erlebnisse?\n\nWir von MidWestUnder wollen genau dich. Den Besten der Besten. Nicht weil du perfekt spielst, nicht weil du perfekte Leistung erbringst.\nSondern weil Du, Du bist. Besuche uns jetzt und gebe uns eine Chance dich kennen zu lernen. Wir würden uns freuen!\n\n**Vorausstzungen**\n- Eine Gewisse Geistige Reife\n- Deutsch\n- Mindestalter 16\n- Bereitschaft dein Wissen zu erweitern und die Fähigkeit im Team zu Arbeiten\n- Kenntnisse über die Rechte und Pflichten eines Teammitgliedes\n- Ein Freundliches, Respektvolles Auftreten\n- Regelmässig Zeit\n- Selbstständiges Informieren über Updates\n- Vertrauen in unsere Teammitglieder\n- Eine Gewisse Erfahrung in LoL falls du unserem Ranked Team beitreten möchtest\n\n**Das bekommst DU**\n- Respekt alle Teammitglieder\n- Unterstützung zu alle Fragen rund um League of Legends\n- Ein Team mit Zusammenhalt und Spass am Spielen\n- Einen eigenen Avatar von unserem Grafiker auf Wunsch\n- Wöchentliches Training\n- Einen aktiv genutzen Teamspeak\n- Gemeinschaftliches Spielen (Ein eigener Gmod Server ist bereits vorhanden, um ein Minecraft Server ist nun auch vorhanden)\n- Und vieles Mehr!\n\n**Jetzt bist du dran!**\nHaben wir dich überzeugen können oder bist du einfach nur neugierig geworden?\nDann bewerbe dich jetzt hier oder nimm über Skype mit uns Kontakt auf! Zeig uns das du dazugehören willst!\n\n**Bewerbungen nur per Skype oder Email**:\nSkype - dancey32     oder    Dennis     (Graves als Profilbild)\nWebsite - http://midwestunder.wix.com/midwestunder\nBitte als Betreff oder Anfrage MWU Bewerbung.\n\nEdit: Unsere neue Website: http://midwestunder.wix.com/midwestunder\n\nMit freundlichen Grüßen,\n**Shark**, Teamleader von MWU {{champion:133}}","replies":[{"poster":"Dute Sadlife","date":"2015-02-18T21:16:06.710+0000","up_votes":2,"down_votes":0,"body":"Hi Guardianshark! \nWir, Ich und ein Kumpel von mir suchen ein Team, wir haben uns eure Anforderung durchgelesen und fanden sie zusprechend! Leider haben wir momentan kein Skype, wären aber über Teamspeak3 zu erreichen! Wir haben reichlich Erfahrung, sind aber immer für Neues zu haben. Kritik ist uns sehr wichtig, schließlich sind Fehler dafür da um aus ihnen zu lernen, man selbst sieht häufig die eigenen Fehler nicht... Wir hoffen euch geht es genau so! Ich bin Main Toplane, mein Kumpel ist auf der Midlane zu finden! Wenn ihr weitere Fragen habt, addet mich einfach! \n\nMfG \nDute Steinzeit","replies":[]},{"poster":"Shield of Ooo","date":"2015-02-28T14:45:37.631+0000","up_votes":1,"down_votes":0,"body":"push it! {{champion:12}}","replies":[]},{"poster":"Shield of Ooo","date":"2015-02-22T14:37:24.169+0000","up_votes":1,"down_votes":0,"body":"Push{{summoner:31}} ","replies":[]},{"poster":"Shield of Ooo","date":"2015-02-18T08:35:49.272+0000","up_votes":1,"down_votes":0,"body":"push","replies":[]}]}