{"poster":"Bluerex","date":"2015-01-30T23:56:45.326+0000","title":"[Champion Concept] - Kay'Ohe, the Sower of Corruption","subforum":"Concepts & Creations","up_votes":376,"down_votes":41,"body":"# Kay'Ohe, the Sower of Corruption\n\nhttp://i.imgur.com/rPWu0X1.png\n\nKay'Ohe, a humanoid monster from the void, has been sent to spread corruption throughout Runeterra, in an effort to one day give his master enough strength to conquer.\n\n* * *\n\nKay'Ohe is a ranged mage that specializes in being a disruptive team fighter: His ability to apply slows, deal damage, and re-position quickly make him ideal for causing death and sorrow when fights break out.\n\n> http://hydra-media.cursecdn.com/wow.gamepedia.com/2/2e/Spell_mage_overpowered.png?version=9709db2f7658311bce6011e184dce358 Passive - __Strength in Corruption__\n> Grants bonus damage and movement speed while standing in _Corruption_.\n\n> _Corruption_\n> Some of Kay'Ohe's abilities apply a purplish black ooze on terrain called _Corruption_, which slow enemies. Corruption disappears over a brief time.\n\n* * *\n\n> http://hydra-media.cursecdn.com/wow.gamepedia.com/c/c6/Ability_warlock_handofguldan.png?version=58edc4e469745434dabb637257d73d82 Q - __Sow__\n\n> Kay'Ohe lobs a corruption orb onto an area, dealing damage upon impact. The flight path of the projectile applies _Corruption_, while the impact area applies a large amount of _Corruption_.\n\n> __Aspect Bonus:__\n> The orb is larger in size, causing the initial impact to be slightly larger and for the orb to bounce to another location. The second impact is a small area that does reduced damage.\n\n* * *\n\n> http://hydra-media.cursecdn.com/wow.gamepedia.com/5/58/Spell_nature_insectswarm.png?version=10c34459feaa600e36628e9ab95d1714 W - __Infest__\n\n> Kay'Ohe launches a swarm of voidling bugs in front of him, dealing damage and infesting the first enemy it contacts. Infested enemies are severely slowed for a brief duration.\n\n> __Aspect Bonus:__\n> Infest launches three swarms in a cone.\n\n* * *\n\n> http://hydra-media.cursecdn.com/wow.gamepedia.com/2/25/Ability_warlock_jinx.png?version=5b3ce37a19b045775a94a710be82dc24 E - __Consume__\n\n> Corruption and infestation consume all enemies it touches, dealing damage. Bonus damage is applied to those who are both Corrupted and Infested.\n\n> __Aspect Bonus:__\n> Consume briefly roots targets in place.\n\n* * *\n\n> http://hydra-media.cursecdn.com/wow.gamepedia.com/c/c0/Ability_warlock_howlofterror.png?version=284e3a7a4a4a155549bed11bc7edfc47 R - __Aspect of Corruption__\n\n> Kay'Ohe transforms into the Aspect of Corruption, granting additional bonus to all abilities and doubling his passive bonuses. Upon initial cast, the area around Kay'Ohe becomes corrupted.\n\n> Aspect of Corruption grants stacks which allows Kay'Ohe to quickly relocate to a position at any _Corrupted_ ground within range.\n\n> Visually, Kay'Ohe changes into a larger creature, featuring a larger frame but still maintaining a slim, mobile build.\n\n> http://i.imgur.com/XKvO23s.png\n\n* * *\n\n# Lore\n\nBeing from the void, there is much mystery surrounding Kay'Ohe. He is known to serve an unknown master who can only survive while living in 'The corruption'. Kay'Ohe travels from location to location as a scout, spreading as much corruption as he can, in an effort to give his master more influence over the world. \n\nThe world fears Kay'Ohe, not only for his strength and skill in battle, but if he succeeds in his mission, his unknown master could appear, bringing an unmeasured amount of suffering to all who get consumed in his vile corruption.\n\n* * *\n\n# Strengths and Weaknesses\n\nKay'Ohe is a strong, supportive team fighting mage that has the ability to, slow and root enemies, then re-position quickly to follow up with damage when team fights break out. To use him effectively, he needs to use his ultimate at the right time - preferably after the initiation of a teamfight occurs. Once the fight starts, he has all the tools needed to make sure enemies can't escape.\n\nHis weaknesses are to peel/disengage team comps. If an enemy team can bait out his ultimate, he has no tool to escape (as he lacks any form of escape when his ult is down.)\n\n* * *\n\n# Example combos\n\n__All-In:__ Q - R - W - E - R: If you are able to land a Q onto an enemy to spread corruption, you can use your ultimate to warp to the impact zone, infest and consume your enemy for burst, then use your last R stack to return to your original position\n\n__Flank :__ R - Q - R - W - E: Using the aspect bonus on your Q, you can re-position to the 2nd impact zone from your Q, allowing you to flank an enemy. From there you can infest/consume them for a kill.\n\nWhen performing the infest/consume combo, remember two things: 1) Consume does more damage if enemies are also on corruption. 2) Weave in auto attacks while enemies are infested, as the infest slow will keep them on corruption longer.\n\n# Art Credit\n\nThe images I used here have been modified slightly to match the void theme, but I credit the images to [Baizilla](http://baizilla.deviantart.com/), a talented artist on deviantArt. Here are the links to the images I used:\n\n[Image one](http://baizilla.deviantart.com/art/Marine-372725293)\n[Image two](http://baizilla.deviantart.com/art/Un-used-alien-design-for-Falling-Skies-season-2-435156914)","replies":[{"poster":"Riot Sweet","date":"2015-01-31T02:51:06.862+0000","up_votes":233,"down_votes":6,"body":"Really well constructed Champion Concept. Enjoyed that the skills, lore and art all added in their own way to the total package. +1 good sir.","replies":[{"poster":"Embertine","date":"2015-01-31T02:57:58.389+0000","up_votes":35,"down_votes":0,"body":"Oh wow, I haven't seen a Rioter comment on a champion concept in ages.\nGlad to know you guys (and gals) do look at the concepts.","replies":[{"poster":"Riot Sweet","date":"2015-01-31T19:34:10.705+0000","up_votes":71,"down_votes":1,"body":"> [{quoted}](name=Embertine,realm=NA,application-id=A8FQeEA8,discussion-id=etuTknPA,comment-id=00050000,timestamp=2015-01-31T02:57:58.389+0000)\n>\n> Oh wow, I haven't seen a Rioter comment on a champion concept in ages.\n> Glad to know you guys (and gals) do look at the concepts.\n\nA lot of us lurk and read a lot more than we comment on. #1 Lurker NA. {{champion:96}}","replies":[{"poster":"Akenero","date":"2015-01-31T20:16:54.108+0000","up_votes":14,"down_votes":1,"body":"I wish that all concepts at least got a comment from a rioter, because right now, I have NO idea if my concepts are any good whatsoever nor does ANYONE, aside from what the community says. I absolutely think that having a rioter comment, positive or negative, is a HUGE step forward for people, because any feedback can help out in all ways. Negative feedback says it's either a bad concept, or it's something that needs to be tweaked firstly.*sigh*maybe that's just me imagining that the community can impact these things.","replies":[{"poster":"MrBuffington","date":"2015-01-31T20:36:53.163+0000","up_votes":4,"down_votes":1,"body":"Have you tried submitting your concepts to Sir ArmaMalum's contests or the MCCC? They each do contests monthy and have judges that will give you feedback about the strengths and weaknesses of your design","replies":[]}]},{"poster":"Embertine","date":"2015-01-31T23:12:45.361+0000","up_votes":8,"down_votes":1,"body":"First time a Rioter has actually responded to me lol!","replies":[]},{"poster":"Hyrum Graff","date":"2015-02-24T02:54:58.365+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Riot Sweet,realm=NA,application-id=A8FQeEA8,discussion-id=etuTknPA,comment-id=000500000000,timestamp=2015-01-31T19:34:10.705+0000)\n>\n> \\#1 Lurker NA.\n\nThis is my note for you in client.","replies":[]}]}]},{"poster":"darkdill","date":"2015-01-31T03:06:48.486+0000","up_votes":7,"down_votes":67,"body":"Yeah, this one is actually very good by my standards. Making loads of creep and using it to give you a combat edge sounds cool. And the name has a pun to it: **KO!**\n\nBut you give only this guy a review? No fair!\n\nI've got two designs that could use feedback from a Rioter too!\n\nhttp://boards.na.leagueoflegends.com/en/c/skin-champion-concepts/RMnR5Jth-ebonmaw-the-terror-of-zaun\n\nhttp://boards.na.leagueoflegends.com/en/c/skin-champion-concepts/aGuGtOEQ-celes-the-hand-of-justice\n\nAnd please, don't just ditch them because of numbers!","replies":[{"poster":"Decaedeus","date":"2015-02-01T19:06:59.664+0000","up_votes":9,"down_votes":0,"body":"Shameless attention grab is shameless.","replies":[{"poster":"darkdill","date":"2015-02-01T20:45:42.168+0000","up_votes":7,"down_votes":8,"body":"Is it fair that he gets all the upvotes and all the rest of us concept creators get left in the dust?","replies":[{"poster":"Keagn","date":"2015-02-03T00:01:16.407+0000","up_votes":10,"down_votes":0,"body":"> [{quoted}](name=Yousosmart,realm=NA,application-id=A8FQeEA8,discussion-id=etuTknPA,comment-id=0005000100030000,timestamp=2015-02-01T20:45:42.168+0000)\n>\n> Is it fair that he gets all the upvotes and all the rest of us concept creators get left in the dust?\n\nYeah :/","replies":[{"poster":"Decaedeus","date":"2015-02-08T03:50:57.916+0000","up_votes":1,"down_votes":0,"body":"Wow he got pinned. \nNvm, that's blatant favoritism. \nA comment is fine, but a pin isn't.","replies":[{"poster":"Keagn","date":"2015-02-08T03:52:20.890+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=PolarVolcano,realm=NA,application-id=A8FQeEA8,discussion-id=etuTknPA,comment-id=000500010003000000000000,timestamp=2015-02-08T03:50:57.916+0000)\n>\n> Wow he got pinned. \n> Nvm, that's blatant favoritism. \n> A comment is fine, but a pin isn't.\n\nYeah, it was blown way out of proportion. But the amount of views and comments earns that.","replies":[{"poster":"FloRaider42","date":"2015-03-01T13:36:41.684+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Keagn,realm=NA,application-id=A8FQeEA8,discussion-id=etuTknPA,comment-id=0005000100030000000000000000,timestamp=2015-02-08T03:52:20.890+0000)\n>\n> Yeah, it was blown way out of proportion. But the amount of views and comments earns that.\n\nI think it went the other way around.\nFirst he got pinned then he got the views and comments, which is not really fair for other concepts that should get more recognition.\n\nGetting pinned is fine if it only for a short time, but it is unfair for other suggestions if this lasts for a long time.","replies":[]}]}]}]}]}]},{"poster":"Embertine","date":"2015-01-31T03:09:15.331+0000","up_votes":7,"down_votes":0,"body":"lol, I've learned that asking Rioters for reviews just doesn't get results. But you might as well seeing as it's rare to see them review any champion concept.","replies":[{"poster":"Krizalid","date":"2015-01-31T03:15:28.075+0000","up_votes":3,"down_votes":2,"body":"Where is it possible to catch a Rioter?","replies":[{"poster":"Embertine","date":"2015-01-31T03:18:50.950+0000","up_votes":3,"down_votes":0,"body":"Sorry somehow left out \"doesn't\" I'm gonna fix that. I apologize for the missunderstanding.","replies":[{"poster":"Krizalid","date":"2015-01-31T03:21:49.086+0000","up_votes":2,"down_votes":1,"body":"Oh, I see. Makes me sad that I can't catch an attention of one.","replies":[{"poster":"Embertine","date":"2015-01-31T03:26:39.010+0000","up_votes":3,"down_votes":1,"body":"I've seen Rioter KateyKhaos respond to some posts directed at her.\n\nhttp://boards.na.leagueoflegends.com/en/c/site-feedback/rs6uAMPE-riot-kateykhaos-what-is-hisher-job-exactly\n\nhttp://boards.na.leagueoflegends.com/en/c/story-art/EprAcwje-kateykhaos\n\nHowever she hasn't responded to all of them.","replies":[{"poster":"Krizalid","date":"2015-01-31T03:27:27.741+0000","up_votes":2,"down_votes":1,"body":"Thanks. I'll try doing something like that.","replies":[]}]}]}]}]}]}]},{"poster":"Vivid Mandala","date":"2015-01-31T16:52:34.137+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Riot Sweet,realm=NA,application-id=A8FQeEA8,discussion-id=etuTknPA,comment-id=0005,timestamp=2015-01-31T02:51:06.862+0000)\n>\n> Really well constructed Champion Concept. Enjoyed that the skills, lore and art all added in their own way to the total package. +1 good sir.\n\nDude. You got a Rioter Comment. This champ concept is going places. Holee Sheet. I look forward to seeing this champ (well revised version but something based on use of Corruption) late 2016, early 2017.","replies":[{"poster":"Hyrum Graff","date":"2015-02-01T06:24:26.698+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Prometheus Rise,realm=NA,application-id=A8FQeEA8,discussion-id=etuTknPA,comment-id=00050004,timestamp=2015-01-31T16:52:34.137+0000)\n>\n> Dude. You got a Rioter Comment. This champ concept is going places. Holee Sheet. I look forward to seeing this champ (well revised version but something based on use of Corruption) late 2016, early 2017.\n\nDo be aware, Sweet is a User Experience designer. She works on Boards, the Tribunal, and a couple other smaller projects -- not champion design.","replies":[]}]},{"poster":"FloRaider42","date":"2015-03-01T14:05:43.027+0000","up_votes":2,"down_votes":0,"body":"I do think that it is a good concept, but having multiple Rioter comments and being pinned gives this post an unfair advantage against other suggestions, which would deserve as much popularity.\n\nI do welcome the idea of more Rioter lurking around the forum and regularly pinning posts that they think need more attention, but to avoid an unfair advantage the posts should only be pinned for a short time and more posts should be pinned/commented on.\n\nI know this asks for a lot, but I do think that if you pin one post, all other posts should have a chance as well and the community should be given information on why a post was choosen and how long.","replies":[]}]},{"poster":"CataclysmCrash","date":"2015-01-31T04:21:03.279+0000","up_votes":28,"down_votes":6,"body":"I can't be the only fucking person that sees this \n\nhttp://i.imgur.com/0itPYQ0.png","replies":[]},{"poster":"Superonic","date":"2015-01-31T02:59:01.943+0000","up_votes":20,"down_votes":0,"body":"http://i.imgur.com/h3Fjjvs.jpg","replies":[]},{"poster":"ABlueQuaker","date":"2015-01-31T04:00:19.831+0000","up_votes":20,"down_votes":1,"body":"My only issue is that he's a void-born champion serving a void-born master who plots and schemes to take over the universe(s). It's not an instinctual urge. Every existent Void-born champion is based off an instinctual urge - Hunger, Knowledge, Evolution. For this champion to work at a thematic and conceptual level, his base desire needs to be more, well, basic.\n\nIt's fair enough if he wants to take over the world, but it needs to be driven by a primitive desire and not an overruling hierarchy.\n\nTry this:\n\nKay'Ohe was born from gluttony itself. A race of void-born creatures known as the Zza'Zang once dwelled in vast numbers in the depths of The Void.  Driven by the raw, instinctual urge to claim land for themselves. The Zza'Zang forget all morals when there is anything between them, and what they desire. It is not uncommon for a Zza'Zang to even kill its own siblings. In fact, of the 6 offspring birthed, in most cases only one will survive beyond its first moments of life.\n\nKay'Ohe, however, was the first offspring in hundreds of thousands of years to be born as a Ta'Zza'Zang, 'The Zza'Zang' - a rarity among the race that has such absolute lust for domination that it will eviscerate its entire hive, leaving only the strongest and most fearsome alive to guard and expand his territory.\n\nKay'Ohe has now made his way to runeterra - spreading his dominion in the outlying villages. It will take more than one Hero to save us from this corruption that is festering and growing across our world.\n\n*\"I hoped he couldn't come, but prepared for the day he would. Set aside our petty ideals and take up arms against him or see Runeterra fall into darkness!\"* ---Kassadin, 'The Void Walker'","replies":[]},{"poster":"Kindlejack","date":"2015-01-31T18:01:45.507+0000","up_votes":8,"down_votes":1,"body":"Cool concept! It feels super-cohesive and shows a high level of understanding of both the game and game design.\n\nHigh five!","replies":[]},{"poster":"Hook And Knockup","date":"2015-01-31T01:25:21.481+0000","up_votes":8,"down_votes":2,"body":"Starcraft Zerg says hi {{champion:17}}","replies":[]},{"poster":"TrubbleCleff","date":"2015-02-03T23:13:55.753+0000","up_votes":6,"down_votes":1,"body":"I think this champion is as solid as any others posted but does not spark the imagination in my opinion and make me want to play it. There have been several others that brought new playable, fun , original mechanics to the game that haven't gotten half as much attention. I don't mean to offend or be mean to the creator but im bothered that I have read dozens of champs some I wish were real right now to try and they get under 100 views 3 upvotes. Wish I had a red name to get some attention to champs I want to see come to life.","replies":[{"poster":"Flintfall","date":"2015-02-04T01:36:52.662+0000","up_votes":3,"down_votes":1,"body":"My thoughts exactly.","replies":[]}]},{"poster":"Hoffmisc","date":"2015-02-07T23:20:53.805+0000","up_votes":4,"down_votes":0,"body":"It's not that I hate this champion or think it's not good enough to be in league, but without the two red comments and being pinned I don't think that this champion would have gotten nearly as much attention as it has.\n\n155 upvotes and 72.9K views, this has been the only post in the Champion and Skin Concept board that has been pinned for a while, even more so for a champion concept.\n\nAgain I don't hate this champion at all, this comment is really just me being salty and nothing more. I'm jealous to say the least. You have a good kit but no numbers, something that I make standard on all of my champions, I just feel like all of the time and effort I into my concepts is absolutely pointless unless somehow I manage to a red to comment on them and I highly doubt that will ever happen.\n\nFeel free to just ignore this comment, it's really just jealousy with a dash (or cup) of salt.","replies":[]},{"poster":"JesuisPepelePew","date":"2015-01-31T00:37:06.631+0000","up_votes":3,"down_votes":1,"body":"idea makes it seem easy to be in the corruption all the time. and the triple infest needs some change. the teleporting, almost swain style fighter is cool","replies":[{"poster":"Bluerex","date":"2015-01-31T00:42:53.540+0000","up_votes":4,"down_votes":0,"body":"The only way to stay in corruption would be from your initial cast of R, and your Q. I think it would require skill to always be in corruption, since if you stand in it in lane pre-6, you're an easy target for skill shots, so you'd have to use it more as an engage/disengage rather than always be in it.\n\nI'm pretty happy with the balance - once you R you'll have an area around you to stay in corruption, but the ult doesn't last forever, and I feel you should be at your strongest when you ult.\n\nCorruption doesn't last forever - it does fade away after a brief time, so you are required to think carefully about your Q placements.","replies":[]}]},{"poster":"LordTekron","date":"2015-02-05T18:21:53.579+0000","up_votes":5,"down_votes":1,"body":"So, not to be an ass, but how long is this going to be stickied for? I mean it's a good idea, but I think it's had it's time in the sun for long enough and there should be room for some other concepts.","replies":[]},{"poster":"Embertine","date":"2015-02-02T12:05:28.491+0000","up_votes":5,"down_votes":1,"body":"MODS: Oh my! That looks like a penis! I better take that down real quick....\n\nLooks at the actual post.\n\nMODS: Oh nevermind, it's just an alien thing that LOOKS like it has a giant penis.\n\nProceeds to read the post.\n\nMODS: Hey! This is actually pretty good! +1!\n \n \n \n \nAtleast I think that may have happened. I have no way of knowing.","replies":[]},{"poster":"Hizsoo","date":"2015-01-31T16:26:05.081+0000","up_votes":5,"down_votes":1,"body":"I don't like this concept. There is no reason to call this creature the bringer (sower) of corruption, maybe something else.\nCorruption supposed to be in the feelings, for example, when you sacrifice a lot for only the possibility to gain something better or when you sacrifice thing that are judged as a better good for the people only for your own gain, that brings corruption.\nThe character you describe is more like a creature, who brings the organic materials for a race of creatures to live on, more like the Zergs in Starcraft.","replies":[]},{"poster":"eikeYLQvjM","date":"2015-01-31T08:54:42.554+0000","up_votes":5,"down_votes":1,"body":"I think this is a great champion design but I would like to warn you if the icons fr these abilities are taken from World of Warcraft. I could be wrong but the Q looks like Hand of Guldan and the E looks like soul swap. I'm only telling you this so Blizzard doesn't come hunting :)","replies":[]},{"poster":"Oxtard","date":"2015-01-31T03:54:32.594+0000","up_votes":5,"down_votes":1,"body":"God bless for no knock-ups and instead a root :^)","replies":[]},{"poster":"darkdill","date":"2015-02-02T18:31:50.411+0000","up_votes":3,"down_votes":0,"body":"I already commented on this one, but I thought I'd add another thought.\n\nIMO, the name \"Sower of Corruption\" sounds a little weird. If anything, a better title would be \"Seed of Corruption\" (at least IMO).\n\nHow does that sound?","replies":[]},{"poster":"Reaper Review","date":"2015-01-31T08:23:14.392+0000","up_votes":3,"down_votes":0,"body":"A part of me is curious about how many views/upvotes this thread would have if it didn't have a red post in it. The power of that Riot thumbprint on a thread isn't something to be taken lightly.\n\nI, personally, think that the Passive/Q interaction needs a slight tweak so it's not so similar to Nocturne's dusk trail. They grant bonuses to the exact same stats, MS and AD, and they grant them in the exact same way, by being on the flight path of their skillshot Q. *(The difference of course being that Kay's enemies don't leave a trail behind them when struck, so it's not fully a pursuit skill like Nocturne's.)*\n\nMechanically, it has enough disparity, but the bonuses granted by the corruption need to be changed up.","replies":[]},{"poster":"Fractured Twig","date":"2015-01-31T08:24:59.872+0000","up_votes":4,"down_votes":1,"body":"All these icons are from **WoW**... =P","replies":[]},{"poster":"Krizalid","date":"2015-01-31T18:04:49.213+0000","up_votes":5,"down_votes":2,"body":"Kinda overrated, thanks to red post.","replies":[]},{"poster":"LordTekron","date":"2015-02-27T21:37:55.695+0000","up_votes":2,"down_votes":0,"body":"So.. Gonna sound like an A-Hole when I say this but... THIS IS STILL F@CKING PINNED? I mean, it's a good idea, but is there a reason that it's hogging all this glory? Unless this is a subliminal sign that Riot is actually going to make this champion a reality, then it should have the spotlight shined onto another champion concept or something.\n\nAgain, no offense to you Bluerex, you've done a wonderful job with the concept, but seriously it's had it's time in the sun...","replies":[]},{"poster":"RonaldinhoGaúčho","date":"2015-02-17T19:05:57.303+0000","up_votes":2,"down_votes":0,"body":":3 skills pictures from WoW XD","replies":[]},{"poster":"TMarcTheAwesom","date":"2015-02-09T21:38:56.106+0000","up_votes":2,"down_votes":0,"body":"This sounds pretty awesome but pls dont let it be image 2. To me image to looks ugly af and it looks like he has a giant penis going up towards his chest XD no offence.","replies":[]},{"poster":"Bonan1554","date":"2015-01-31T01:22:29.335+0000","up_votes":2,"down_votes":0,"body":"Got the ability icons from wow?","replies":[{"poster":"Bluerex","date":"2015-01-31T01:40:37.562+0000","up_votes":2,"down_votes":0,"body":"Yep. They help give visuals to abilities, and they have so many icons you can always find something that matches.","replies":[]}]},{"poster":"SeductiveGrandpa","date":"2015-02-03T05:25:44.008+0000","up_votes":3,"down_votes":1,"body":"Oh, I forgot to ask, what would his friends/rivals be?","replies":[]},{"poster":"voetre","date":"2015-01-31T08:36:54.017+0000","up_votes":4,"down_votes":2,"body":"blizzard called, they want their spell icons back ;P","replies":[]}]}