{"poster":"GHT Feaster","date":"2016-08-27T00:22:13.864+0000","title":"5 LP Verlieren als bestrafung für nichts machen?","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":1,"body":"Hallo,\r\nNach dem ich heute nach einer 4 Game lose streak mir dachte noch ein letztes zu machen wurde bereits in der Champion Select das gefecht von verschiedensten Personen gestartet was damit endete das einer bereits das trollen ank&uuml;ndigt + Troll pick. Der andere die Champs bannt von anderen Spielern und am schluss das Team ein kompletter Troll war. Also was machen?`Nat&uuml;rlich muss ich Dodgen. Und daf&uuml;r wird man bestraft?Serious?\r\nVerstehe den Sinn des Systemes so nicht. Soll ich Ingame gehen?`20 Lp verlieren? Und dann reporten damit diese dann eine verwarnung kriegen? So kann das doch nicht funktionieren.","replies":[{"poster":"Leylania","date":"2016-08-27T02:25:55.631+0000","up_votes":1,"down_votes":0,"body":"Fälle wie deine sind bei sowas eher die Ausnahme. Das System soll vorbeugen, dass Leute einfach leaven weil ihnen irgendwas am Team nicht passt z.B. weil es nicht meta ist oder die Person nicht die gewünschte Position bekommen hat die er gerne haben wollte. Wer nicht damit klar kommt dass das eigene Team nicht immer perfekt ist egal aus welchem Grund muss halt mit einer Strafe rechnen, du weißt doch gar nicht ob ihr nicht vielleicht doch gewonnen hättet ( hatte mal 2 premade Trolle im Team die nach 0/20 feeden afk gegangen sind und wir haben das Ding einfach 3v5 mit gefeedeten Gegnern gewonnen, alles ist möglich). Etwa du akzeptierst solche \"Probleme\" im Team, oder nimmst eine Strafe fürs Dodgen hin, oder du hörst auf Ranked zu spielen, deine Entscheidung. An dem System ist nichts schlimm, klar trifft es auch mal einen Unschuldigen, meistens haben es die Leute allerdings verdient.","replies":[{"poster":"mhhmkaay","date":"2016-08-27T08:14:13.576+0000","up_votes":1,"down_votes":5,"body":"... blabla trolle im team akzeptiern und beleidungen obendrein xD alles normal.  Promos Doppelt machen kein grund erfahren warum das so ist, egal. nimms hin oder lass es. Die sollten auch mal schauen das die kinder unter kinder bleiben und matchmaking mit dem alter abgleichen ;) damit wäre schon viel gutes getan :)","replies":[{"poster":"Sirrkas","date":"2016-08-27T08:19:42.403+0000","up_votes":1,"down_votes":0,"body":"Die Spieler nach Alter sortieren würde als einzigen Effekt haben, dass die Wartezeiten steigen. Trolle und Flamer findet man in allen Altersklassen gleichermaßen.","replies":[{"poster":"mhhmkaay","date":"2016-08-27T08:34:39.902+0000","up_votes":1,"down_votes":4,"body":"ja ist n blödes thema. aber gibt einfach zuviel affenkinder im spiel.","replies":[]}]}]}]}]}