{"poster":"Doenerlord","date":"2018-04-16T10:34:18.575+0000","title":"Das Konzepte-Verzeichnis","subforum":"Skin- & Champion-Konzepte","up_votes":6,"down_votes":0,"body":"Dieser Thread soll erwähnenswerte Champion- und Itemkonzepte für die Nachwelt auflisten und allen die Lust haben die Möglichkeit bieten die wirklich guten Konzepte noch einmal durch zu gehen, obwohl diese leider oft auf den späteren Seiten des Forums untergehen.\n\n---\n\n# Top 5 Championkonzepte\n\n\n|I-Rang-I|I---------------------Name---------------------I|I----------------Autor----------------I|I-Upvotes-I|\n|-\n|**1.**|[Devargan, der Chefplaner](https://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/VfMjO0FZ-champion-konzept-devargan-und-mannschaft-der-chefplaner)|Incaedeus|1|\n|**2.**|[Sutera, die Nachtblüte](https://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/itOGn88J-championkonzept-sutera-die-nachtblate)|Doenerlord|1|\n|**3.**|-|-|-|\n|**4.**|-|-|-|\n|**5.**|-|-|-|\n\n---\n\n> # Funktionsweise\nZwar stellt dieser Thread das Verzeichnis für gelungene Championkonzepte dar, da aber wirklich viele Champions in diesem Forum gepostet werden, werde ich nicht alle davon in das Verzeichnis aufnehmen. Jeder kann sein Konzept(oder eins, das er gut findet) hier kurz vorstellen und das entsprechende Konzept verlinken, wenn er aufgelistet werden möchte.\nFür die Vorstellung müssen folgende Daten angegeben werden:\n* Champion-, Skin- oder Itemkonzept?\n* Name des Champions/Skins/Items\n* Konzept-Link\n> \nIch werde mit einer Jury aus drei Experten jeden einzelnen Antrag beurteilen und wenn wir alle drei zu dem Schluss kommen, dass das Konzept hier rein passt, aufnehmen.\nAuch wenn ein Vorschlag vielleicht nicht direkt aufgenommen wird, wäre ich bereit ihn nach gründlicher Überarbeitung erneut zu beurteilen.\nAlle Nutzer können in den Kommentaren Upvotes für Champions verteilen, und die für die beliebtesten wird es regelmäßig Aktionen wie die Übersetzung ins Englische oder das Zeichnen eines Artworks geben.\nWenn wir uns anstrengen und ordentlich zusammen arbeiten, können wir ja vielleicht tatsächlich irgendwann mal einen Community-Champion erwirken.\n\n---\n\n> # Championverzechnis\n* [Arkhanith, der endlose Verschlinger](https://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/kbezjEPO-champion-konzept-arkhanith-der-endlose-verschlinger) (Incaedeus) - 0 Votes\n* [Devargan, der Chefplaner (und Mannschaft)](https://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/VfMjO0FZ-champion-konzept-devargan-und-mannschaft-der-chefplaner) (Incaedeus) - 1 Vote\n* [Rishhikaz, die Schwarmkönigin](https://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/2ide65p6-champion-konzept-rishhikaz-die-schwarmkanigin) (Incaedeus) - 0 Votes\n* [Sutera, die Nachtblüte](https://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/itOGn88J-championkonzept-sutera-die-nachtblate) (Doenerlord) - 1 Vote\n* [Shikku, das Bruchstück](https://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/V2bgefsP-champion-konzept-shikku-das-bruchstack) (Incaedeus) - 0 Votes\n* [Trax, der Imperialist](https://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/Q9uFqbg2-championkonzept-trax-der-imperialist) (Ghionova) - 0 Votes\n* [Yinu'Hwari, die Mönche der Leere](https://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/HdWatrpy-championkonzept-yinuhwari-die-manche-der-leere) (TheGanera) - 0 Votes\n\n\n---\n\n> # Skinverzeichnis\n* _Noch kein Skin, Kein Autor (0 Upvotes)_\n\n---\n\n> # Itemverzeichnis\n* [Handschuhe des Bären](https://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/PFvqcljs-item-konzept-handschuhe-des-baaren) (Volidear) - 0 Votes\n* [AD-Supportitem Konzeptreihe](https://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/O3mB6O8b-itemkonzept-ad-support-itemreihe) (Lunaá) - 0 Votes\n\n---\n\n> # Erwähnenswerte Skill-Konzepte\n* _Noch kein Skill-Konzept, Kein Autor (0 Upvotes)_\n\n---\n\n> #Jury\n* Doenerlord\n* Incadeus\n* Lunaá\n\n---\n\n> # Teilnehmer\n>\n>\n##Artwork-Zeichner:\n* Nymphaéa\n>\n##Übersetzer\n* DE>EN: Doenerlord\n\n---\n\n> # Aktionen\nFolgende Konzepte werden ins Englische übersetzt und im englischen Forum veröffentlicht:\n- Keine\n> \nFür diese Champions sind Artworks in Arbeit:\n- Sutera, die Nachtblüte\n\n---\n\n> # Bewertung ausstehend\nDie Juroren sind angehalten diese Konzepte zu beurteilen und anzunehmen oder abzulehnen.\nEin (!) kennzeichnet solche Konzepte, die so bald wie möglich beurteilt werden sollten, da sie schon lange warten.\nDie [ ][ ][ ] stehen für erteilte Bewertungen durch die Juroren [Doenerlord] [Incaedeus] [Lunaá].\n> \n- [ ~ ][ X ][ ] [Izana, die geblendete Retterin](https://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/HivmyU51-champion-konzept-izana-die-geblendete-retterin)) von Incaedues\n> ","replies":[{"poster":"Ghionova","date":"2018-04-25T15:38:07.396+0000","up_votes":2,"down_votes":0,"body":"Hey, so wie ich das gelesen habe, sind noch einige Stellen für Champion-Konzepte frei? Ich hätte nämlich welche parat :D","replies":[{"poster":"INoKami","date":"2018-04-25T15:54:04.322+0000","up_votes":3,"down_votes":0,"body":"Dann gib uns bitte die Links zu den zu bewertenden Konzepten und wir schauen mal rein! Oder zumindest ich^^","replies":[{"poster":"Ghionova","date":"2018-04-25T16:16:25.037+0000","up_votes":1,"down_votes":0,"body":"Hey, du hast dir bereits ein Champion-Konzept von mir angeschaut, \"Kyathraa, das Unheil der Düsteren\". Das Ding ist, ich habe viele Championkonzepte entworfen, für wie viele hättest du denn Zeit? Mir ist erst beim Suchen aufgefallen, das die Bilder nicht abrufbar sind. \nBei einem jedoch lädt das Bild automatisch, also schicke ich dieses Konzept zuerst :)\n\nhttps://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/zVoz3IXG-championkonzept-moltice-vergeltung-der-unterdrackten\n\nHier ist noch eins ohne Bild, hat aber viele Upvotes :)\n\nhttps://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/BfFvvQKr-championkonzept-elijah-der-telekinet\n\nHier die Skizze, falls diese abrufbar ist: https://scontent-frx5-1.xx.fbcdn.net/v/t1.0-9/26167001_906503489516920_4791206197349160331_n.jpg?_nc_cat=0&oh=7419b6abfea9d321bcc682d9f3334940&oe=5B54D3C4\nPS: Ich bin momentan an der Entwicklung eines weiteren Champion-Konzepts :)","replies":[{"poster":"Lunaá","date":"2018-04-29T13:11:04.949+0000","up_votes":2,"down_votes":0,"body":"Bin auch dafür, diese in die Liste zu nehmen. Trotz der Ähnlichkeit zu Urgot beim ersten.\n\nFür das zweite würde ich die Lore nochmal überarbeiten (die ist wirklich an zahlreichen Stellen verbesserungsfähig, wie Incadeus schon schrieb), der Rest ist allerdings ok.\n\nDie Idee bei Trax finde ich auch super, das kann auch in die Liste","replies":[]},{"poster":"Doenerlord","date":"2018-04-28T21:52:56.469+0000","up_votes":2,"down_votes":0,"body":"Beide sind meiner Meinung nach ganz gut ausgearbeitet und sollten gerne in das Verzeichnis aufgenommen werden.\n\nGruß,\nDoenerlord","replies":[{"poster":"Ghionova","date":"2018-04-29T11:19:14.740+0000","up_votes":1,"down_votes":0,"body":"Ich habe mein extrem detailliertes Championkonzept vor wenigen Minuten hochgeladen. Ich weiß nicht ob ich bei meiner Anzahl schon genug vorgeschlagen habe aber wenn Interesse da ist, werde ich euch den Link zuschicken. Ich war dabei von deiner Struktur eines Konzepts echt beeindruckt und habe es genau so schön \"geschmückt\", weil es so einfach besser und übersichtlicher aussieht. Vielen Dank Doenerlord :)","replies":[{"poster":"Doenerlord","date":"2018-04-30T08:08:43.785+0000","up_votes":1,"down_votes":0,"body":"Den neuen Champion würde ich ehrlich gesagt im aktuellen Zustand ablehnen. Zwar passen Kit, Aussehen und Lore gut zusammen, sind aber im einzelnen betrachtet schlichtweg nicht gut.\nWenn du dir meine Kritik in dem entsprechenden Thread anschaust und für ein Rework berücksichtigst, denke ich vielleich nochmal drüber nach.\n\nGruß,\nDoenerlord","replies":[]}]},{"poster":"Ghionova","date":"2018-04-29T11:14:34.645+0000","up_votes":1,"down_votes":0,"body":"Vielen Dank! :)","replies":[]}]},{"poster":"INoKami","date":"2018-04-25T16:19:43.473+0000","up_votes":1,"down_votes":0,"body":"Mach´s am besten wie ich: such dir zwei oder drei aus (aus zweiundzwanzig^^), von denen du glaubst, dass sie einen Platz in der Liste der guten Konzepte verdient hätte und gib uns die Links. Rest übernehmen wir. Kannst es natürlich auch anders machen, aber dann dauert´s halt. Wir sind auch nur Menschen.\nZum einen sind die Links dafür, damit wir die Konzepte einfacher finden können und ja, evtl war ich schon bei dir... aber die anderen nicht :)","replies":[{"poster":"Ghionova","date":"2018-04-25T16:38:16.917+0000","up_votes":1,"down_votes":0,"body":"Danke für die schnelle Rückmeldung, da hätte ich noch ein weiteres Konzept welches ich gerne für die Auswahl \"nominieren\" möchte.\n\n**Trax, der Imperialist. **Die Inspiration kam durch Metroid Prime Hunters, wo ich einen Kopfgeldjäger namens Weavel gesehen habe. Weavel kann sich von seinen Beinen trennen und diese in ein Geschützturm umwandeln. Vielleicht ist das 1 zu 1 kopiert aber ich finde diese Idee für das Spiel schon erwähnenswert. :)\nHier die Skizze:\nhttps://scontent-frx5-1.xx.fbcdn.net/v/t1.0-9/31284246_973756816124920_2797197880740282368_n.jpg?_nc_cat=0&oh=8dcde7c092b4a2c1e0c019bb4bfb58c9&oe=5B6C3D0B\nHier der Link zum Champion-Konzept:\nhttps://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/Q9uFqbg2-championkonzept-trax-der-imperialist\n\nNochmals vielen Dank für die Zeit ;)","replies":[{"poster":"INoKami","date":"2018-04-29T10:27:43.235+0000","up_votes":1,"down_votes":0,"body":"So, bin die Konzepte mal durchgegangen. Kann jetzt nur die Super-Kurzfassung hinschreiben (weil Gründe), evtl. mach ich das nachher noch etwas detaillierter...\n\n* Moltice: Hübsche Idee, aber wegen der (schon von Lunaa erwähnten) Urgot-Ähnlichkeit und einigen Fähigkeiten, die fast identisch mit schon bestehenden sind, gibt's leider ein Nein.\n* Elijah: Nein. Die Lore wirkt überladen und stellenweise einfach an den Haaren herbeigezogen und selbst für einen Assasinen bietet das Kit zu viel Mobilität/zu viele Möglichkeiten im Allgemeinen.\n* Trax: Über die Zahlen und ein, zwei Fähigkeiten müssen wir mal noch reden, aber sonst finde ich die Idee interessant. Der kriegt ein Ja von mir.","replies":[{"poster":"Ghionova","date":"2018-04-29T11:20:28.021+0000","up_votes":1,"down_votes":0,"body":"Danke für das Feedback! :)\nIch habe vorhin das Championkonzept hochgeladen von dem ich in den letzten 4 Tagen gesprochen habe. Ich weiß nicht ob ihr bereits genug gelesen habt ^^' aber diese ist sehr detailliert.","replies":[]}]}]}]}]}]}]},{"poster":"BlackfrostAngel","date":"2018-10-09T11:57:01.955+0000","up_votes":1,"down_votes":0,"body":"Ich würde ganz gerne auf mein eigenes neues Konzept hinweisen:\n\nhttps://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/8foGwwLr-virintaria-die-haterin-der-ordnung-v2\n\nIch habe ein älteres Konzept von mir nochmal überarbeitet, da die Lore nicht mehr gut passen würde und die Fähigkeiten etwas veraltet waren.\nIch bin noch nicht 100% fertig , aber es sind eher kleinere sachen. Lore und Geschichten könnten dazu kommen, Quotes und evtl. wenn ich es irgendwie hinbekommen auch Concept-Art.\n\nPS: Der Link heißt zwar Haterin der Ordnung, aber das ist nur weil \"ü\" in Links nicht angezeigt wird ^^ Keine Sorge sie ist eine Hüterin, auch wenn ich auf den Titel nochmal im Text eingangen bin.","replies":[{"poster":"INoKami","date":"2018-10-20T07:41:51.789+0000","up_votes":2,"down_votes":0,"body":"So, ich hab mir mal den Werk durchgelesen, hier mal eine Kurzfassung meiner Gedanken:\n\n* Ich weiß nicht wirklich, was ich von der Lore halten soll. Konnte ihre Mission nicht erfüllen, ihre Heimat ist auch kaputt, sie hat quasi in allen Punkten versagt und die Göttin so \"Jo, kein Ding! Hier, hast ´ne zweite Chance!\" So eine Göttin will doch jeder haben oder? Ups, jemanden umgebracht? Kein Ding, ich vergebe dir!\n* Die Passive ist auf jeden Fall interessant, kann aber sehr schnell chaotisch werden. Das Problem kommt mit der W-Passiven, wenn auf einmal auch Verbündete aussuchen können, wen sie markieren und gerade in der SoloQ wird man dir damit mehr als ein Mal eine sinnvolle Konstellation kaputt machen bzw. erst gar nicht entstehen lassen.\n* Allgemein bietet sie schon SEHR viel Utility: Schilde für jeden, theoretischen 1,5 Sekunden-Stun auf Stufe 1 (Invades damit werden höchst spaßig!), dann mal noch einen Slow, der nicht ohne ist, Dmg-Reduction und noch HP-Kosten (glaube ich, weil da keine Einheit steht, was die Fähigkeit tatsächlich kostet), natürlich auch Bonus-Movespeed, weil das doch super mit Stuns/Slows synergiert und AoE-Heal der beinahe wie eine Short-Range-Soraka-Ult aussieht, nur jede Sekunde.\n\nAber zu deinem Glück sammeln wir nicht ausschließlich gute Konzepte, sondern auch gute Ideen. Und eigentlich ist die Idee bei dir nicht schlecht, an sich die Fähigkeiten sind auch interessant und ich will mal nicht so sein, das sollte für ein **Ja** reichen.\nKleiner Tipp noch für die Zukunft: wenn du noch nachträglich Sachen (wie bei dir z.B. die Voicelines) einbauen willst, bau sie bitte lieber in das Konzept selber ein und nicht in die Kommentare. Unten links unter deinem Thread gibt es ein kleines Feld namens \"Bearbeiten\", dort draufklicken und schon kannst du alles einfügen, wo und wie du willst. Es sieht einfach schöner aus (und tilgt auch dieses komische Gefühl in mir, dass du mit den \"Kommentaren\" deinen Thread künstlich pushen wolltest... ich wäre echt ein guter Verschwörungstheoretiker^^).\n\nAlso, bis zum nächsten Konzept!\n\nMfG\n\nIncaedeus\n{{sticker:galio-happy}} \n_Leidenschaftlicher Galio-Main_","replies":[{"poster":"BlackfrostAngel","date":"2018-10-23T14:30:49.375+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Incaedeus,realm=EUW,application-id=L7E6lhzo,discussion-id=EAqhZYG0,comment-id=00110000,timestamp=2018-10-20T07:41:51.789+0000)\n>\n> So, ich hab mir mal den Werk durchgelesen, hier mal eine Kurzfassung meiner Gedanken:\n> \n> * Ich weiß nicht wirklich, was ich von der Lore halten soll. Konnte ihre Mission nicht erfüllen, ihre Heimat ist auch kaputt, sie hat quasi in allen Punkten versagt und die Göttin so &quot;Jo, kein Ding! Hier, hast ´ne zweite Chance!&quot; So eine Göttin will doch jeder haben oder? Ups, jemanden umgebracht? Kein Ding, ich vergebe dir!\n> * Die Passive ist auf jeden Fall interessant, kann aber sehr schnell chaotisch werden. Das Problem kommt mit der W-Passiven, wenn auf einmal auch Verbündete aussuchen können, wen sie markieren und gerade in der SoloQ wird man dir damit mehr als ein Mal eine sinnvolle Konstellation kaputt machen bzw. erst gar nicht entstehen lassen.\n> * Allgemein bietet sie schon SEHR viel Utility: Schilde für jeden, theoretischen 1,5 Sekunden-Stun auf Stufe 1 (Invades damit werden höchst spaßig!), dann mal noch einen Slow, der nicht ohne ist, Dmg-Reduction und noch HP-Kosten (glaube ich, weil da keine Einheit steht, was die Fähigkeit tatsächlich kostet), natürlich auch Bonus-Movespeed, weil das doch super mit Stuns/Slows synergiert und AoE-Heal der beinahe wie eine Short-Range-Soraka-Ult aussieht, nur jede Sekunde.\n> \n> Aber zu deinem Glück sammeln wir nicht ausschließlich gute Konzepte, sondern auch gute Ideen. Und eigentlich ist die Idee bei dir nicht schlecht, an sich die Fähigkeiten sind auch interessant und ich will mal nicht so sein, das sollte für ein **Ja** reichen.\n> Kleiner Tipp noch für die Zukunft: wenn du noch nachträglich Sachen (wie bei dir z.B. die Voicelines) einbauen willst, bau sie bitte lieber in das Konzept selber ein und nicht in die Kommentare. Unten links unter deinem Thread gibt es ein kleines Feld namens &quot;Bearbeiten&quot;, dort draufklicken und schon kannst du alles einfügen, wo und wie du willst. Es sieht einfach schöner aus (und tilgt auch dieses komische Gefühl in mir, dass du mit den &quot;Kommentaren&quot; deinen Thread künstlich pushen wolltest... ich wäre echt ein guter Verschwörungstheoretiker^^).\n> \n> Also, bis zum nächsten Konzept!\n> \n> MfG\n> \n> Incaedeus\n> {{sticker:galio-happy}} \n> _Leidenschaftlicher Galio-Main_\n\n\nHeeeeeyy <3!!\nVielen Dank für die Antworten und die Kritik,\n\nIch möchte hier mal ein paar auf ein paar der Punkte eingehen:\n\nDie Lore ist erstmal nur so angedeutet, aber die Kritik an dem Verhalten der Gottheit verstehe ich nicht so sehr. Im Christentum glaubt man doch auch an unendlich viele Chancen und die immer bestehende Möglichkeit von Vergebung. \nHier ist es sogar strenger, da ihre die Vergebung nur zu Teil wird , da sie dafür an ihre Mission gebunden wird.\n\nEin großer Teil der W ist die Schwierigkeit sie optimal zu nutzen. Wenn man sie einfach so nutzen könnte , dann hätte sie einfach zu viele Möglichkeiten. Es ist sehr wichtig einen sehr guten Moment zu wählen.\n\nDie Utility hat man nur wenn man die Fähigkeiten auf bestimmte Weisen nutzt. \nSie hat keinen 1.5 Sekunden Stun auf Stufe 1, da hast du dich verlesen. Es ist notwendig von 2 Explosionen getroffen zu werden um betäubt zu werden. Sie kann mit der Q auf lvl 1 , aber keine andere Person binden um die 2. Explosion aufzulösen. \nDen Wert des Stuns kann man natürlich auch senken, alle Werte sind erstmal etwas hoch angesetzt.\nAuch gibt es keine Schilde für jeden. Es kann maximal für 2 Verbündete ein Schild geben, dass relativ geringe Werte hat und erst relevant wird wenn auch noch 2 Gegner gebunden sind, wenn die Bindung endet. Ich denke es wird nicht besonders einfach das Schild zu nutzen. Aber im Moment ist dieses Schild auch für mich etwas mit dem ich nicht ganz zufrieden bin. Man kann es nicht so gut selbst kontrollieren.\nDie Lauftempoerhöhung ist sehr kurz und nur nützlich um eines bessere Chance zu haben einen Stun zu treffen. Der Slow ist war tatsächlich etwas zu stark, ich habe ihn deutlich angepasst.\nDie Werte für die Passive sind sehr gering gehalten. Das Konzept enthält viel Heilung und dadurch gibt es auch Counterplaymöglichkeiten durch die Klaffenden Wunden. Deswegen muss die andere Utility auch schon spürbare Effekte haben, wenn man sie gut nutzt.\nGenerell könnte man einige Werte hin- und herschieben um die Utility in Grenzen zu halten. Das kann man so noch nicht absehen. \n\nDie nachträglich hinzugefügten Dinge wollte ich nicht noch direkt darunter packen, da ich schon jetzt immer ewig mit dem scrollen zu tun hab und das für mich Nachsätze sind, die nur Halbinteressant sind. Ich weiß schon wie man den Bearbeiten-Button drückt :D\n\nMfg \n\nBlackfrostangel","replies":[]}]},{"poster":"Doenerlord","date":"2018-10-23T15:48:29.440+0000","up_votes":1,"down_votes":0,"body":"Ich habe dir unter das Konzept einen Kommentar gesetzt.\nIch hoffe ich konnte dir damit ein bisschen helfen.\n\nAllerdings würde ich das Konzept aktuell ablehnen, aus dem einfachen Grund, dass es \"noch nicht 100% fertig\" ist.\nIch gebe Incaedeus Recht, wenn er sagt, dass nicht nur die besten Konzepte der Welt, die Riot so eins zu eins verwenden könnte, aufgenommen werden, jedoch habe ich schon den Anspruch, dass die Ersteller der Konzepte sich intensiv mit ihnen beschäftigen und sie zumindest fertigstellen, bevor sie sie hochladen.\nAus diesem Grund lehne ich z.B. Konzepte, die keine Hintergrundgeschichte oder Beschreibung des Champions enthalten grundsätzlich ab.\n\nLG,\nDoenerlord","replies":[{"poster":"BlackfrostAngel","date":"2018-10-28T13:57:15.213+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Doenerlord,realm=EUW,application-id=L7E6lhzo,discussion-id=EAqhZYG0,comment-id=00110001,timestamp=2018-10-23T15:48:29.440+0000)\n>\n> Ich habe dir unter das Konzept einen Kommentar gesetzt.\n> Ich hoffe ich konnte dir damit ein bisschen helfen.\n> \n> Allerdings würde ich das Konzept aktuell ablehnen, aus dem einfachen Grund, dass es &quot;noch nicht 100% fertig&quot; ist.\n> Ich gebe Incaedeus Recht, wenn er sagt, dass nicht nur die besten Konzepte der Welt, die Riot so eins zu eins verwenden könnte, aufgenommen werden, jedoch habe ich schon den Anspruch, dass die Ersteller der Konzepte sich intensiv mit ihnen beschäftigen und sie zumindest fertigstellen, bevor sie sie hochladen.\n> Aus diesem Grund lehne ich z.B. Konzepte, die keine Hintergrundgeschichte oder Beschreibung des Champions enthalten grundsätzlich ab.\n> \n> LG,\n> Doenerlord\n\nDie Beschreibung des Champions , sowie eine sogar weiterentwickelte Form der Hintergrundgeschichte waren doch schon beim Erstellen da.\nIch denke ein Konzept für einen Champion ist niemals 100% fertig. Man kann nie wissen, ob man nicht später Dinge ändern müsste ( für die Balanz oder in Verbindung mit den Geschichten anderer Champions).","replies":[{"poster":"INoKami","date":"2018-10-28T14:29:19.618+0000","up_votes":1,"down_votes":0,"body":"> Ich denke ein Konzept für einen Champion ist niemals 100% fertig.\n\nDem würde ich widersprechen. Balance-Changes kann man immer machen und solange es sich nur um Rejustierungen der Zahlen handelt, sehe ich darin keine große Änderung. Auch Anpassungen der einzelnen Fähigkeiten, solange sie nicht das gesamte Kit/den gesamten Playstyle des Konzepts umwerfen, halte ich nur für Kleinigkeiten. Eine wirkliche Änderung des Konzeptes ist es, wenn obiges zutrifft und/oder Lore bzw. Aussehen massiv verändert werden. Aber da es immer noch auf der alten Vorlage beruht, würde ich das als Champion-Konzept 2.0 sehen. Ähnlich mit dem, was ich mal im englischen Forum gemacht habe: Ein, zwei Fähigkeiten geändert, Lore teilweise umgeschrieben, aber es beruht immer noch auf dem alten Konzept und wurde mehr oder weniger einfach aktualisiert.\n\nIch kann verstehen, woher der Satz kommt (ich meine, wenn wir uns mal die Patchnotes vor Augen führen, kann man auch leicht denken, Riot bekommt ihre Champions auch nie fertig...), aber für mich gibt es eigentlich nur Updates, die durchaus auch größere Änderungen enthalten, den Kern des Champions aber beibehalten (z.B. Nunu) und komplette Neugestaltungen eines Champions, die ich aber als komplett neuen Champion ansehen würde, weil sich bis auf den Namen und das grobe Aussehen/Grundthema alles geändert hat (zB. Galio, Sion).","replies":[{"poster":"BlackfrostAngel","date":"2018-10-28T14:45:07.940+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Incaedeus,realm=EUW,application-id=L7E6lhzo,discussion-id=EAqhZYG0,comment-id=0011000100000000,timestamp=2018-10-28T14:29:19.618+0000)\n>\n> Dem würde ich widersprechen. Balance-Changes kann man immer machen und solange es sich nur um Rejustierungen der Zahlen handelt, sehe ich darin keine große Änderung. Auch Anpassungen der einzelnen Fähigkeiten, solange sie nicht das gesamte Kit/den gesamten Playstyle des Konzepts umwerfen, halte ich nur für Kleinigkeiten. Eine wirkliche Änderung des Konzeptes ist es, wenn obiges zutrifft und/oder Lore bzw. Aussehen massiv verändert werden. Aber da es immer noch auf der alten Vorlage beruht, würde ich das als Champion-Konzept 2.0 sehen. Ähnlich mit dem, was ich mal im englischen Forum gemacht habe: Ein, zwei Fähigkeiten geändert, Lore teilweise umgeschrieben, aber es beruht immer noch auf dem alten Konzept und wurde mehr oder weniger einfach aktualisiert.\n> \n> Ich kann verstehen, woher der Satz kommt (ich meine, wenn wir uns mal die Patchnotes vor Augen führen, kann man auch leicht denken, Riot bekommt ihre Champions auch nie fertig...), aber für mich gibt es eigentlich nur Updates, die durchaus auch größere Änderungen enthalten, den Kern des Champions aber beibehalten (z.B. Nunu) und komplette Neugestaltungen eines Champions, die ich aber als komplett neuen Champion ansehen würde, weil sich bis auf den Namen und das grobe Aussehen/Grundthema alles geändert hat (zB. Galio, Sion).\n\nDann ist mein Konzept nach deiner Definition 100% fertig. Alle Fähigkeiten sind bis auf evtl. die Werte in der finalen Form und die Lore wird sich nicht mehr ändern, außer neuere Geschichten würden Änderungen nötig machen. \nDem zweiten Teil deiner Antwort kann ich nicht ganz zustimmen, aber das hat eigentlich nichts mit dem Thema hier zu tun.","replies":[]}]}]}]}]},{"poster":"CosmicSphere","date":"2018-06-22T14:39:43.978+0000","up_votes":2,"down_votes":0,"body":"Hier ist mein Champion Konzept: Aq'Ehl, der Puls der Leere (2.0)\n\nHier der Link: \n\nhttps://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/PETMFKJE-champion-konzept-aqehl-der-puls-der-leere-20\n\nHabe diesmal hoffentlich auf alles geachtet was vorallem Incaedeus manchmal kritisiert hat;) und Geschichte, Interaktionen, Build usw. gemacht. Hoffe ihr findet es gut und nehmt es vlt. in dieses Verzeichnis auf:).","replies":[{"poster":"Doenerlord","date":"2018-08-20T15:43:12.578+0000","up_votes":1,"down_votes":0,"body":"In der aktuellen Form werde ich wohl Veto einlegen müssen.\n\nViel Glück beim nächsten Mal!","replies":[]}]},{"poster":"INoKami","date":"2018-04-21T17:40:31.046+0000","up_votes":2,"down_votes":0,"body":"So, ich finde, es ist auch an der Zeit, selber einige meiner Vorschläge einzureichen:\n\n* **Shikku, das Bruchstück:** Ein Tausendfüßler, der ständig Kristalle ausgräbt und mit Steinkugeln um sich wirft? Ja, genau daraus besteht sein Konzept! Für alle, die AP-Jungler lieben, ein Fan von \"Easy to learn, hard to master\"-Konzepten sind und es sich zutrauen, mit Kugeln zu jonglieren!\nhttps://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/V2bgefsP-champion-konzept-shikku-das-bruchstack\n\n* **Rishhikaz, die Schwarmkönigin:** Habt ihr manchmal Probleme damit, dass ihr euch immer auf der Kluft alleine fühlt? Dann ist Rishhikaz die Lösung für eure Probleme! Für alle, die AP-Jungler lieben (warte... schon wieder?!), keine Insektenphobie haben und irgendwo im Herzen auch RTS mögen!\nhttps://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/2ide65p6-champion-konzept-rishhikaz-die-schwarmkanigin\n\n* **Devargan (und Mannschaft), der Chefplaner:** Mein Neuling unter den Konzepten... aber mit der Größte! Sein Plan ist nämlich, die ganze Karte umzubauen und sie dann mit allerlei aberwitzigen Maschinen zu bestücken! Für alle, die gerne ihr Team mit Feuerkraft den Rücken freihalten und den inneren Architekten mal wieder rauslassen wollen!\nhttps://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/VfMjO0FZ-champion-konzept-devargan-und-mannschaft-der-chefplaner\n\n\nUnd wenn wir schon dabei sind... bisher wird ja anscheinend nur darüber abgestimmt, ob wir Konzepte in die Liste aufnehmen oder nicht. Aber wird es dann auch innerhalb der Liste ein Ranking geben oder ist sie einfach eine Art Sammelbecken für gute Konzepte?","replies":[{"poster":"Lunaá","date":"2018-04-25T17:49:38.409+0000","up_votes":1,"down_votes":0,"body":"Schwierig zu bewerten.\n\nDie Ideen und Einfälle sind schön, sie bringen etwas neues, und ich finde, das sollte auch gewürdigt werden, sowie damit andere Leser \"etwas andere\" Konzepte sehen können.\nDa macht das denke ich nichts aus, wenn die Konzepte vllt nicht ins Spiel passen","replies":[]}]},{"poster":"Volidear","date":"2018-04-16T12:10:56.067+0000","up_votes":2,"down_votes":0,"body":"Also wenn sich sonst niemand findet, würde ich wohl als Jury-Mitglied helfen. Ich habe zwar nicht viele Konzepte geschreiben (eins xD), aber ich denke, dass ich recht gut in Balancing und generellem LoL-Gameplay bin.\nHier ist mein erstet selbst erstelltes Item-Konzept (würde ich auch hier listen lassen): [Handschuhe des Bären](https://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/PFvqcljs-item-konzept-handschuhe-des-baaren)\nWenn ich sonst noch irgendwie helfen kann, bin ich gerne dabei.\n\nRoar-","replies":[{"poster":"Lunaá","date":"2018-04-25T16:48:44.430+0000","up_votes":1,"down_votes":0,"body":"Ich denke auch, es würde hier rein passen. Samt Patchnotes ist es ein Konzept, in dem auch auf die Community eingegegangen wurde, ich finde es gut","replies":[]}]},{"poster":"CosmicSphere","date":"2018-12-28T20:00:59.219+0000","up_votes":1,"down_votes":0,"body":"So nach den Lob von INoKami (Incaedeus:)) stelle ich mein Konzept des unendlichen Drachens hier rein in der Hoffnung das es von der Jury als gut empfunden wird:)\n\nhttps://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/sIPNH4F4-champion-konzept-aixares-der-unendliche-drache","replies":[]},{"poster":"BlackfrostAngel","date":"2018-11-01T13:30:36.438+0000","up_votes":1,"down_votes":0,"body":"Ich habe ein weiteres Konzept erstellt und bitte um Einsicht :)\n\nhttps://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/9iPPzTgE-issos-der-uberlebende-eisgeborene","replies":[]},{"poster":"TheGanera","date":"2018-10-01T15:09:44.288+0000","up_votes":1,"down_votes":0,"body":"Auch wenn es bereits von Incadeus kritisiert wurde, reiche ich auch mal ein Championkonzept ein.\nEin paar kleinere Aspekte habe ich schließlich verändert.\n\n**Yinu'Hwari, die Mönche der Leere**\nEin Konzept, das unter der Leitfrage \" Warum soll ich nur einen Champion kontrollieren, wenn ich auch fünf beherschen kann\" entstanden ist.\nhttps://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/HdWatrpy-championkonzept-yinuhwari-die-manche-der-leere","replies":[{"poster":"Lunaá","date":"2018-10-25T12:14:31.675+0000","up_votes":1,"down_votes":0,"body":"Die Idee ist eigentlich super, aber die Umsetzung ist dafür echt schwierig. Liegt natürlich an der Steuerung der einzelnen Mönche, welche sich für mich als sehr kompliziert herausstellt.\nIdee gut, Umsetzung theoretisch gut, Spielbarkeit extreeeeeeeeeem schwer\nSollte aber in die Championkonzepte-Liste aufgenommen werden","replies":[]},{"poster":"INoKami","date":"2018-10-01T15:21:15.681+0000","up_votes":1,"down_votes":0,"body":"Kann es sein, dass du noch ein bisschen was daran hinzugefügt hast? Falls ja, wieso hast du es nicht gesagt? (Es gab jetzt nur so viele Sachen, bei denen ich mich gefragt hab \"War das schon vorher da?\" Falls ja... mein klassisches Kurzzeitgedächtnis wieder mal...)\n\nAuch wenn es nicht perfekt ist von den Fähigkeiten her, ist es dennoch gut, das Drumherum ist auch sehenswert und deswegen würde ich mal sagen, das Konzept bekommt ein Ja von mir!\n{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"INoKami","date":"2018-10-20T07:44:04.277+0000","up_votes":1,"down_votes":0,"body":"Eine Sache, die mir gerade aufgefallen ist: Doenerlord, du hast dem Konzept ein **Nein** gegeben (laut dem Bewertung ausstehend-Tab), aber ich finde nirgendwo eine Begründung dazu. Bin ich einfach blind und übersehe die oder gibt es sie gar nicht (öffentlich zugänglich)?","replies":[]},{"poster":"TheGanera","date":"2018-10-01T16:21:44.819+0000","up_votes":1,"down_votes":0,"body":"Ja ein paar kleinigkeiten, wie das Ehrfahrungsmaximum habe ich noch hinzugefügt.\nDas meißte müsste auch in den Patch Notes vermerkt sein.\n\nAnsonsten vielen Dank für dein Urteil.","replies":[]}]}]},{"poster":"INoKami","date":"2018-09-30T13:58:57.811+0000","up_votes":1,"down_votes":0,"body":"Auf das die Liste wachsen möge... ich versuche es wieder!\n\n**Izana, die geblendete Retterin:** Es gibt drei Arten von Menschen: Die, die Oneshots mögen, die, die die Gegner mit einer gezielten Combo umlegen wollen und die, die einfach nur siebenhunderttausend Geschosse mit mehr... oder weniger Sinn und Verstand über das Schlachtfeld feuern wollen. Und wenn du zur dritten Kategorie gehörst, wird Izana relativ sicher dein neuer Main werden! Für alle, die gerne Chaos unter den Gegnern verbreiten, für die Katarina zu lasch ist und mit Geschossen um sich werfen wollen wie ein gewisser Präsident mit unnötigen Twitterbeiträgen…\n\n(https://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/HivmyU51-champion-konzept-izana-die-geblendete-retterin)","replies":[{"poster":"Lunaá","date":"2018-10-25T12:09:43.424+0000","up_votes":1,"down_votes":0,"body":"Du magst es, wenn dein Konzeptcharakter das Spiel fast für sich alleine spielt bzw ein \"OP-Gefühl\" vermittelt, oder?\n\nBalancing-technisch muss ich Doenerlord zustimmen, scheint ein bisschen viel Schaden zu sein, der potenziel möglich wäre, das machen die extra hohen Manakosten als Rechtfertigung auch nicht besser.\nAuch wenn \"Bullet-Hell\" in dem Konzept wirklich zum Vorschein kommt, sind mir das ein wenig zu viele Kugeln, die da möglich sind, und das für nur Tasten drücken.\n\nMit ein wenig weniger Schaden und Geschossen defenitiv trotzdem Ja","replies":[]},{"poster":"Doenerlord","date":"2018-10-17T12:18:37.784+0000","up_votes":1,"down_votes":0,"body":"Ich habe dir mal einen Kommentar da gelassen. Für mich wäre das in aktueller Form ein nein, aber mit ein bisschen Balancing könnte das schon anders aussehen.\n\nGruß,\nDoenerlord","replies":[]}]},{"poster":"Doenerlord","date":"2018-10-10T16:51:52.002+0000","up_votes":1,"down_votes":0,"body":"Hallo zusammen,\nIch bin mir sicher, dass euch schon aufgefallen ist, wie inaktiv ich in den letzen Tagen war.\nDafür gibt es Gründe, die ich hier nicht weiter erläutern möchte.\nIch werde mich in ein paar Tagen wieder melden und dann auch mal wieder Konzepte durchgehen.\nVielen Dank für Ihre Geduld ;)\n\nGruß,\nDoenerlord","replies":[]},{"poster":"TaiiKii","date":"2018-07-27T16:23:48.622+0000","up_votes":1,"down_votes":0,"body":"Hey, \n\nIch würde mein Konzept gerne vorstellen. \nEs handelt sich um Skullyer, den Schattengänger (Mir fiel nichts besseres ein)\n\nGrundkonzept baute auf die Hintergrundgeschichte von Dr. Mundo auf, welcher ja probiert den Perfekten Mörder zu erschaffen. Wodurch ich auf meine W und R Fähigkeit kam, konnte mir aber keinen guten Zusammenhang aufbauen wodurch ich das Grundkonzept behalten habe aber einige dinge verändert habe. Ich würde mich freuen, wenn Ihr es euch mal anschauen könntet\n\nArt: Championkonzept\nName: Skullyer, der Schattengänger\nhttps://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/Yve6mBXg-skullyer-der-schattengaanger-champion-konzept","replies":[{"poster":"Doenerlord","date":"2018-08-20T16:37:26.130+0000","up_votes":1,"down_votes":0,"body":"Der Link scheint irgendwie ungültig zu sein.\nWurde der Thread vielleicht umbenannt, verschoben oder sonst etwas?\n\nGruß,\nDoenerlord","replies":[{"poster":"INoKami","date":"2018-08-26T08:51:52.121+0000","up_votes":1,"down_votes":0,"body":"Er hat den Thread wieder runter genommen, nachdem ich mal drüber gegangen bin. Wäre in diesem Zustand sowieso ein Nein von mir gewesen. Hab ein paar Tage später noch mit ihm gechattet, deshalb mein Hintergrundwissen :)","replies":[]}]}]},{"poster":"INoKami","date":"2018-06-22T20:59:18.024+0000","up_votes":1,"down_votes":1,"body":"Um das mal hier etwas voran zu bringen, will ich auch mal wieder einen Versuch wagen: Ein neues Konzept zum Abstimmen!\n\n**Arkhanith, der endlose Verschlinger:** Du bist größenwahnsinnig, irgendiwe voll böse und magst große Schadenszahlen? Dann wirst du mit diesem Champ eine Menge Freude haben! FÜr alle, denen Xerath zu langweilig ist und krampfhaft versuchen wollen, die Aufmerksamkeit des Teams (und auch gegnerischen Teams, leider) auf dich zu lenken!\n\n(Den hier meine ich:https://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/kbezjEPO-champion-konzept-arkhanith-der-endlose-verschlinger)","replies":[{"poster":"Lunaá","date":"2018-08-20T19:46:23.243+0000","up_votes":1,"down_votes":0,"body":"Von mir aus, alles ist im Konzept enthalten, warum also nicht\n\nIch sollte eig auchmal eines meiner Konzepte veröffentlichen ...","replies":[]},{"poster":"Doenerlord","date":"2018-08-20T16:35:20.342+0000","up_votes":1,"down_votes":0,"body":"Wäre ich mit einverstanden, aber der erste Teil des Passive gefällt mir wie gesagt garnicht.\n\nGruß,\nDoenerlord","replies":[]}]},{"poster":"Lunaá","date":"2018-05-17T08:23:24.718+0000","up_votes":1,"down_votes":0,"body":"Hier ist meine Itemkonzeptreihe eines Ad-Supportitems:\n\nhttps://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/O3mB6O8b-itemkonzept-ad-support-itemreihe\n\nDie Namen der Items sind: Meuchelmesser -> Schattendolch -> Relikt der Schlacht","replies":[{"poster":"Doenerlord","date":"2018-05-18T11:55:55.759+0000","up_votes":1,"down_votes":0,"body":"Ich bin dafür.\nAllerdings musst du es nochmal überarbeiten. Deine Patches sind noch nicht \"live\" ;)\n\nGruß,\nDoenerlord","replies":[{"poster":"Lunaá","date":"2018-05-18T13:52:21.923+0000","up_votes":1,"down_votes":0,"body":"Meinst du damit, ich soll sie auch im Original anpassen? Eigentlich wollte ich das da so stehen lassen, damit die Leser die ursprüngliche Version zuerst sehen und nicht verwirrt werden, wenn sie Kommentare lesen wie \"der Effekt muss weg\", der Effekt aber schon weg ist, weil das Original  angepasst habe.\n Aber ist denke ich besser wenn ich die auch im Original anpasse, die Patchnotizen können sie ja immer noch lesen","replies":[]}]}]},{"poster":"Westcoast38","date":"2018-05-14T22:47:56.711+0000","up_votes":1,"down_votes":0,"body":"Ich hätte ebenfalls paar Konzepte allerdings habe ich  diese auf einen Account von einer Freundin erstellt auf welchen ich kein Zugriff mehr habe.\nGeht das trotzdem :/?","replies":[{"poster":"Doenerlord","date":"2018-05-15T06:37:59.219+0000","up_votes":1,"down_votes":0,"body":"Du kannst alles vorschlagen wozu du noch einen Link hast, sollten die Konzepte jedoch abgelehnt werden, hättest du natürlich keine Möglichkeit mehr sie anzupassen und neu zu posten.\n\nGruß,\nDoenerlord","replies":[{"poster":"Westcoast38","date":"2018-05-16T17:03:07.048+0000","up_votes":1,"down_votes":0,"body":"Ich werde dann die Konzepte überarbeitet in meinem Account nochmal veröffentlichen. Sind ja eh meine :)","replies":[]}]}]},{"poster":"Doenerlord","date":"2018-04-25T18:00:27.922+0000","up_votes":1,"down_votes":0,"body":"Sehr schön, so langsam kommt ja leben in die Bude. Ich mache für heute Abend das letzte Update und gebe Devargan auch direkt ein Upvote mit, weil Incadeus so viel Arbeit rein gesteckt hat. :)\n\nGruß,\nDoenerlord","replies":[]}]}