{"poster":"Pacsa","date":"2014-12-30T09:08:40.285+0000","title":"Fejlesztési ajánlat","subforum":"Általános beszélgetés","up_votes":2,"down_votes":2,"body":"Üdvözlök mindenkit! Nekem leginkább egy kérdésem lenne hogy hol lehet megosztani a Riot-tal fejlesztési tippeket mert egy nagyon fontos változtatást kellene eszközölni a rangsorolt játékokkal kapcsolatba. Ezt az egészet egy nagyon elkeserítő mérkőzés ihlette. Egy majdnem 40 perces mérkőzés alatt sikerült vereséget szenvednem aminek az oka nem más mint a csapatom gyakorolatlansága. Sajnos nagyon sokszor találkozni olyan játékosokkal (sajnos GoldV felett is) akik nagyon kevés tapasztalattal rendelkeznek vagy éppen olyan hőst hoznak rangsorolt mérkőzésre akit éppen akkor vettek meg. Ezért gondoltam egy olyan kis apróságra hogy a rangsorolt játék ne hősszámhoz legyen kötött hanem min 500 normál GYŐZELEM-hez. Természetesen ez mind lvl30+. Lehet soknak tartjátok de számomra ez egy nagyon jó megoldás lenne arra hogy a rangsorolton az döntsön hogy mennyire vagy ügyes ne az hogy kikapsz egy feeder, gyakorolatlan, csapatjátékra képtelen embert vagy sem. Segítségeteket előre is köszönöm,\r\nÜdv egy elkeseredett játékos!","replies":[{"poster":"Vasipari Béla","date":"2014-12-30T18:31:22.117+0000","up_votes":1,"down_votes":0,"body":"500 győzelem? Több, mint egy éve játszok, és még mindig nincs annyi. Ezt nem gondoltad át rendesen.","replies":[{"poster":"Pacsa","date":"2014-12-30T22:01:14.793+0000","up_votes":1,"down_votes":0,"body":"Az egy dolog hogy több mint 1 éve. én akkor kezdtem mikor {{champion:106}} bekerült és 635 normál győzelmem van. de bőven 1000 feletti normál játék. Ez sok mindentől függ de szerintem egyáltalán nem sok az 500.","replies":[{"poster":"Haruszame","date":"2014-12-31T00:31:37.515+0000","up_votes":1,"down_votes":0,"body":"500 győzelemhez ha feltételezünk egy 50% győzelmi arányt akkor 1000 lejátszott játék kell, ami mondjuk átlagosan 30 percig tart. Ez 500 óra játékidő ami durván 21 napos folyamatos játékkal lenne elérhető, amit azért egy kicsit soknak érzek. Ezenkívül a problémát szerintem nem oldja meg. 1500 győzelem után is vihetek olyan hőst rangsorolt mérkőzésre akivel sosem játszottam, mint ahogy lehetek megfontolt 150 győzelem után is. Tudás és tapasztalatbeli különbség pedig mindig lesz valamennyi.","replies":[]}]}]},{"poster":"R3wan","date":"2014-12-30T14:07:52.529+0000","up_votes":1,"down_votes":0,"body":"Az a helyzet, hogy nem te vagy az első, aki ezzel előáll. Biztos vagyok benne, hogy nem is az utolsó. A probléma az ezzel, hogy olyanokkal tolna ki ez a rendszer, akik 500 győzelem elérése nélkül is megtanultak játszani. Nem beszélve a smurf accountokról. 500 játék rengeteg. Tény, hogy kiszűrne nagyon sok rossz játékost, de megbüntetne mások miatt olyanokat is, akik nem érdemlik meg. A valódi gond a fejekben, nem a győzelmek számában van. A mentalitáson kellene javítani valahogy.","replies":[]},{"poster":"Api a Durva","date":"2014-12-30T09:44:08.811+0000","up_votes":1,"down_votes":0,"body":"Az a baj ezzzel ,hogy nincs ezzel baj {{champion:36}} .\nJó ötlet de akkor sem szűröd ki azt , hogy valaki akkor vette meg a champion-t és first play-el \n:/ erre nincs megoldás . \nDe figyu nyersz 2 ranked-et és el is felejted és ez tapasztalat ( **HOGY A KÖTEKEDŐ EMBEREKTŐL ELVEGYEM AZ ÖRÖMÖT NEM NEM NEM SAJÁT TAPASZTALAT HANEM EGY BARÁTOMMAL UGYAN EZ VOLT.**) De ne hagyjad , hogy rontsa a játékélményed :**próbáld élvezni a szart is ** ez csak egy tanács egy unrankedestől de én megpróbáltam segíteni.","replies":[]}]}