{"poster":"FlowerSwag","date":"2018-03-03T13:15:08.155+0000","title":"Solución a los AFK","subforum":"Jugabilidad, balance y narrativa","up_votes":8,"down_votes":5,"body":"Que es lo que m&aacute;s nos molesta de los AFK? obviamente la desventaja que tenemos.\r\nyo creo que para balancear las rankeds con un afk deber&iacute;an poner bonificaciones por cada afk que tengamos, algo tipo &quot;por cada jugador desconectado la fuente cura 20% m&aacute;s r&aacute;pido hasta que el jugador se conecte denuevo&quot; o algo relacionado con la generaci&oacute;n de oro autom&aacute;tica (cuando te dan 1 oro por segundo). O como minimo echarlo de la partida y reemplazarlo con un bot.","replies":[{"poster":"Chisspitas","date":"2018-03-03T14:05:46.398+0000","up_votes":2,"down_votes":9,"body":"***","replies":[{"poster":"yOCobain","date":"2018-03-03T14:10:21.880+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Chisspitas,realm=LAS,application-id=xQmJPO8F,discussion-id=ZLdNhQs0,comment-id=0000,timestamp=2018-03-03T14:05:46.398+0000)\n>\n> para eso existe el remake boludito\n\n1) Sos un maleducado, habla bien sin insultar.\n\n2) Después del minuto 3 no hay mas remake. Y si se te va afk uno a minuto 10 o 20 te jodio toda la partida y no hay remake que valga. Ídolo. \n\nLee bien el post antes de tirarte a bardear a alguien. Los afk no existen sólo antes del  minuto 3. ¿Jugas al LoL vos? ","replies":[{"poster":"Yanx99","date":"2018-03-03T14:18:35.228+0000","up_votes":3,"down_votes":0,"body":"alguien se enojo Xdddddddd","replies":[{"poster":"yOCobain","date":"2018-03-03T14:27:37.832+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Yanx99,realm=LAS,application-id=xQmJPO8F,discussion-id=ZLdNhQs0,comment-id=000000000000,timestamp=2018-03-03T14:18:35.228+0000)\n>\n> alguien se enojo Xdddddddd\n\nMalll. Cómo le va a hablar así? Me lo imagino en la vida  respondiendo de esa manera a cualquier persona. Debe tener la cara llena de golpes si se maneja así xD","replies":[]}]}]}]},{"poster":"Hachux","date":"2018-03-03T15:12:27.813+0000","up_votes":2,"down_votes":0,"body":"A mi parecer con un ban ya es suficiente.\n No se como funcione el sistema de baneos de Lol, pero seria bueno si a estos jugadores que se quedan afk se los tratara asi.\n1ra vez  afk: Cola de espera de 5 Min\n2da vez \"\" :     \"\"   \"\"     \"\"      \"\" 10 Min\n3ra vez: \"\" :     \"\"   \"\"     \"\"      \"\" 20 min\n4ta vez: \"\" :     \"\"   \"\"     \"\"      \"\" Ban 14 Dias\n5ta vez: \"\" :     \"\"   \"\"     \"\"      \"\" Permaban.\n\n Obviamente todos alguna vez nos hemos quedado afk en alguna partida, ya sea por un motivo de urgencia o  cualquier otro. Entonces, a mi parecer la solución seria la de arriba.\n Obviamente que tenga un tiempo limite, es decir, si te quedas afk las 4 o 5 veces por semana tienes tu ban. Porque no tendría sentido que las veces que te quedas ausente se acumulen, es decir, me he quedado afk 2 veces esta semana, el próximo mes una vez mas y el otro mes por un problema tuve que abandonar la partida. (Seria baneado y no tendría sentido)\n Esto se debe aplicar a las veces que se queda afk un jugador muchas veces seguidas en poco tiempo.\nSaludos{{champion:86}}","replies":[{"poster":"Revòlver Ocelot","date":"2018-03-03T15:35:13.358+0000","up_votes":1,"down_votes":0,"body":"No hablamos de como sancionar al AFK, sino de como compensar al team que tiene un jugador menos...Ademas, el leaverbuster ya de por si es un sistema de 10 puntos (con algunas excepciones claro esta) que detecta siempre al jugador que se va AFK.","replies":[{"poster":"Hachux","date":"2018-03-03T15:47:15.841+0000","up_votes":1,"down_votes":0,"body":"Es que en mi opinión, matar a un bot es extremadamente facil.\n El equipo enemigo siempre hará focus al bot y así terminarían fedeandose. \nLo de oro tampoco me parece tan bueno... Lo único es lo de regeneración de vida... eso si podría ser","replies":[]}]},{"poster":"Yanx99","date":"2018-03-03T15:35:20.039+0000","up_votes":1,"down_votes":0,"body":"con ese tipo de ban yo estaria baneado por que el juego se me cierra solo Xddd","replies":[]}]},{"poster":"yOCobain","date":"2018-03-03T14:09:24.006+0000","up_votes":2,"down_votes":0,"body":"Me parece viable. No habría forma de abusar de algo tan mínimo como un buff pero balancearia las cosas. Me parece buena idea.","replies":[]},{"poster":"PasoPackXHonores","date":"2018-03-03T15:41:49.351+0000","up_votes":1,"down_votes":0,"body":"La solución es mano dura para los AFK. Bans por días o semanas. Y se acabó la joda. Ayer 3 afk en una misma ranked por que no gankeaban al top. Está lleno de gente llorona. Y la partida siguiente, el enemigo tuvo 2 afk y fue injusto.","replies":[]},{"poster":"Juanopilucool","date":"2018-03-03T15:16:08.521+0000","up_votes":1,"down_votes":1,"body":"No seria  mas facil que se ponga en algun modo tipo bot  con esteroides","replies":[]},{"poster":"Top Lucian","date":"2018-03-03T14:45:08.455+0000","up_votes":1,"down_votes":1,"body":"Básicamente yo hice un post diciendo una solución para los AFK (Dar un pequeño BUFF) pero a casi nadie le agradó, eso quiere decir que prefieren seguir teniendo AFK para así tener una excusa del por que perdieron.\n\n Personalmente lo del oro, en late cuando ya están full build, es totalmente inútil. \n\n Lo del bot creo que si está mejor. Mínimo para que haya un poco de presencia xd.","replies":[]}]}