{"poster":"Mister Kappita","date":"2015-11-30T15:08:17.130+0000","title":"Mantenimiento","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"Cuanto dura el mantenimiento? :v {{item:3070}} Quiero rankear","replies":[{"poster":"Hwaxinghz","date":"2015-11-30T15:16:38.548+0000","up_votes":1,"down_votes":0,"body":"No lo se, pero espero que nos devuelvan un Ping estable aunquesea a 90, si es menos mucho mejor. No puede ser que estemos jugando con 180+ de ping porque si... eso es lamentable para un servidor Latino Americano Sur (no está en Ucrania el Server para que ande con lag).\nOjalá se solucione todo.\n\nEl otro día (ponele el lunes pasado) estuvieron 2 días con mantenimiento y desde entonces 180 ms estables.","replies":[{"poster":"LeonardoSB","date":"2015-11-30T16:21:21.380+0000","up_votes":2,"down_votes":0,"body":"hermano, muchas personas de este servidor jugaban con 270 de ms, 180 no es nada...nisiquiera conoces lo que es lag.","replies":[{"poster":"Hwaxinghz","date":"2015-11-30T18:28:38.592+0000","up_votes":1,"down_votes":0,"body":"Conozco lo que es el lag... Pero te digo, si fuesen 180 ms con pérdida de paquetes del 0% no es lag, de hecho en EuW tenía ese ping y tenía 1% de pérdida de paquetes y no sentía tanto el ping como acá que son 180 ms pero con 44% de Pérdida de paquetes.\nEl ping es relativo, también en NA tenía ese mismo ping y no tenía tampoco nada de pérdida de paquetes y me andaba como acá jugando con 60-70 de ping.\n\nSi tienen más de 200 eso es de preocupación, pero no es tanto por el ping, mas que nada como dije, la pérdida de paquetes es algo muy molesto y eso desencadena errores en la RED y por lo tanto desconexiones por menos ping que tenga uno. En mi caso, no vivo a 4234123 km del servidor para que me de tantos MS, tengo mi amigo que vive a 4 km de mi casa (en la otra ciudad) y le anda a 35 MS obviamente no usa el mismo ISP que yo, pero por eso te digo, el ISP de ARNET está muy mal ultimamente por esos enlaces fallados que conectan con Movistar Chile.\n\nSí, se lo que es el lag y es insoportable jugar así, de hecho, siempre tengo que bancarme el lag cuando tengo amigos que juegan con 40-30-20 de ping, me molesta mucho. Igual que esos 270 MS que hay en URUGUAY, eso no puede seguir pasando. Desde por ejemplo NA se puede jugar en Corea si se quiere con buen ping, desde Europa se puede jugar a Rusia con buen ping, acá a medio país de distancia, que medio, a 1000 KM de distancia (ponele) está insoportable el lag, no puede seguir pasando, esto no es problema de Riot, es un error de RED internacional. Pero sí, me quejo porque tengo la mejor conexión que puedo comprar en este pueblo y me enferma tener que soportar 180 MS cuando hace no menos de 6 meses jugaba con 50-60... Es lamentable","replies":[]}]}]},{"poster":"PishulaSunrise","date":"2015-12-01T00:08:20.620+0000","up_votes":1,"down_votes":0,"body":"Es mi idea o soy solo yo, nose puede a las de lol","replies":[]},{"poster":"ShiroKitsune","date":"2015-11-30T15:39:13.879+0000","up_votes":1,"down_votes":0,"body":"yo tengo problemas para unirme a partidas y mas encima me tira leaverbuster ,ojala que termine pronto :({{summoner:3}} {{summoner:3}}","replies":[]}]}