{"poster":"4y5tvb8","date":"2018-05-04T01:35:22.371+0000","title":"Ranked Game starts, Loading screen doesnt appear (cont.)","subforum":"Help & Support (OCE)","up_votes":3,"down_votes":0,"body":"Tries to connect, says &quot;retry&quot; or &quot;cancel&quot;, I&#039;ve tried both options and it takes me back to home page. I check opgg, IM IN A GAME. I try creating a game but nothing happens. I logout then log back in, and there&#039;s a 50% chance I get into a game. \n\nI&#039;ve now lost 2-3 games because I CAN&#039;T EVEN CONNECT TO THE GAME. That&#039;s 50-70 lp, 2-3 hours of other games where I have to come late to game. This is frustrating and tilting.\n\nI've reset my comp. I've logged out many times. I basically cant even play because the game just wont start despite going through full champ select and only way to know im in game is to check opgg.\n\nGoing to test the \"Initiate full repair\" option now.\n\nOk well that's 3 games lost to leaver completely out of my control. The weird part is that it happened before but still reconnected after i logout. Then it became a 50/50 chance, and now its just wont connect.\n\nThis is beyond tilting. I literally played yday with no issues and this comes up. I remember some patch being installed on league while i was in client and ever since its caused this problem. \n\nSO i've went from 90-something lp to less than 10 now. Come late to 3-4 games and its all because of this issue. \n\nI just saw the response below but way too tilted or bothered atm after having wasted 6 hours of playing games late and half games being leaves. Actual joke if this stands.","replies":[{"poster":"Ninox","date":"2018-05-04T01:43:39.396+0000","up_votes":1,"down_votes":2,"body":"1. Update your graphics card drivers.\n2. Update your DirectX: http://www.microsoft.com/en-us/download/details.aspx?id=35 (never DL anything DirectX from anywhere except Microsoft).\n3. Disable and remove any custom skins or third party programs interacting with the game.\n4. Run a client repair: Settings gear in the top right of the client > Initiate Full Repair\n5. Clean reinstall your League of Legends with the Hextech Repair Tool: https://support.riotgames.com/hc/en-us/articles/224826367-Automated-Troubleshooting-Hextech-Repair-Tool\n6. Contact support: https://support.riotgames.com/hc/en-us/requests/new\n\nTest in a **custom** game after each step to see if the issue is fixed. The most likely to work is the clean reinstall, but it's good practice to do the first 3 anyway.","replies":[{"poster":"4y5tvb8","date":"2018-05-04T03:08:55.285+0000","up_votes":1,"down_votes":0,"body":"Just tested a custom and it randomly works. I'm not sure if its safe to join a ranked game now since this problem is so random and confusing. I guess I'll just wait until there is a reply to this from someone at Riot since im going to risk more lp and time wasted.\n\nAlso, punishing me with Leaverbuster for a problem that's misleading (since it worked the first few times i logged out) and clearly out of my control, doesn't help. ","replies":[{"poster":"Gehirn","date":"2018-05-04T03:53:19.170+0000","up_votes":2,"down_votes":1,"body":"Hey there, seeing a few players have this issue and they all seem to be coming through Optus.\nI would hold off on starting a game for now. It may help us if you could follow the tracert instructions linked [here](https://support.riotgames.com/hc/en-us/articles/201752674#wq2) and send the results to ocelivereports@riotgames.com.","replies":[{"poster":"4y5tvb8","date":"2018-05-04T11:11:07.868+0000","up_votes":1,"down_votes":0,"body":"So 3 games lost from leaves. 2-4 games I come late. Some games randomly work which makes this misleading.\n\nI followed your steps which took another 1-2 hours (including reinstalling the entire game, constantly relogging and making customs). And despite everything being out of my control, I've lost 90lp. \n\nYou honestly think this is fair for the players affected by this?","replies":[]}]}]},{"poster":"4y5tvb8","date":"2018-05-04T02:58:17.811+0000","up_votes":1,"down_votes":0,"body":"1. Updated - Still doesn't work\n2. Done - Still doesn't work\n3. Only had plays tv (just like many Pro's and streamers use) and stopped it from starting to test - Still doesn't work\n4. Done - Still doesn't work\n5. Done - Still doesn't work\n6. Tried sending a support ticket under technical issues - TELLS ME TO LOG IN WHEN IM ALREADY LOGGED IN.\n\nI even did a clean reinstall and still nothing. Im done trying anything you guys suggest since it just leads to more wasted time. Wasted so many hours and lost over 90lp.","replies":[{"poster":"Ninox","date":"2018-05-04T10:33:43.904+0000","up_votes":1,"down_votes":0,"body":"The login for the support page and the website (boards) are seperate. \nhttps://i.imgur.com/IrSBuzi.png\nThere are currently issues with the login transition preventing players from easily logging into support. There are two current workarounds which ususally work:\n\n1: Open the support page in an incognito/private window and follow the process as normal, pressing the login button when prompted.\n2: Log out of the website **from the support page**, and then follow the process as normal, pressing login when prompted.\n\nIf your support page has the blank \"OC\" login in the top right, you're good to go. If it only has your summoner icon with \"OCEANIA\" it means the support page is seeing you as logged in on the website and not in support.\n\n___\n\nAs for your issue though, i you are connecting through Optus it appears to be an issue on their end. Follow through what Gehirn said and hang tight.","replies":[]},{"poster":"esp","date":"2018-05-04T04:24:10.190+0000","up_votes":1,"down_votes":0,"body":"yeah support page is buggy you have to log out on it and log back in....","replies":[]}]},{"poster":"4y5tvb8","date":"2018-05-04T02:05:41.580+0000","up_votes":1,"down_votes":0,"body":"Btw tried testing a custom and im stuck in it now. Can't do anything else in terms of starting games. Opgg confirms im in a game yet I have full use of my client.","replies":[]},{"poster":"4y5tvb8","date":"2018-05-04T02:02:20.130+0000","up_votes":1,"down_votes":0,"body":"Is there any way to get the lp lost from 3 games? This was completely out of my control. And the issue itself worked after i logged out the first time. It just randomly decided not to work at random times. So infuriating I can't even get myself to test this unless I get all that lp back from an issue that's not even in my control.","replies":[]}]}]}