{"poster":"John Candy","date":"2016-02-13T18:35:45.555+0000","title":"Hilfe bei PvP.net Kernel.","subforum":"Hilfe & Support","up_votes":2,"down_votes":0,"body":"Hallo Leute, \r\nich habe Probleme mit dem PvP Kernel Patcher!\r\nUnd zwar, wenn ich LoL starte wird mir das Logo angezeigt dann wird es kurz schwarz hinter dem Logo und es kommt &quot;PvP.net Kernel reagiert nicht&quot;. \r\nDas Problem ereignete sich nachdem ich &quot;Elophant&quot; runtergeladen hatte, davor hatte ich LoL noch auf. Musste es jedoch schlie&szlig;en nach dem Programm. Danach versuchte ich LoL zu starten leider ging das nicht, habe Elophant sofort wieder deinstalliert und auf Viren &uuml;berpr&uuml;ft. Keine da gott sei dank, aber woran liegt es dann?\r\nSuche jetzt schon seit ca. 4 Stunden nach Threads mit Antworten und habe alles ausprobiert was geht damit der Kernel wieder funktioniert. Leider erfolglos...\r\nIch kann auch komischerweise nicht mehr LoL runterladen, mein Kumpel hatte es probiert und bei ihm geht es nur bei mir nicht. \r\nHabe es schon 3 mal deinstalliert und mit dem CCleaner danach aufger&auml;umt. \r\nEs funktioniert immer noch nicht.\r\nDas mit dem &quot;Run as Administrator&quot; funktioniert auch nicht.\r\nIch bin grade wirklich verzweifelt und wei&szlig; nicht mehr was ich tun soll...\r\nW&auml;re dankbar f&uuml;r Antworten,\r\nLg eine verzweifelte LoL-Spielerin","replies":[{"poster":"fallêNAngel","date":"2016-02-15T17:00:16.229+0000","up_votes":1,"down_votes":0,"body":"Ich hab den Support angeschrieben und bekam diese Hilfreiche antwort: \"Hallo,\n\ndieser Fehler tritt normalerweise auf, wenn deine Systemuhr nicht richtig synchronisiert und auf das aktuelle Datum und die korrekte Uhrzeit eingestellt ist.\n\nDer folgende Artikel aus unserer Knowledge Base zeigt dir, wie du deine Systemuhr synchronisieren kannst:\nFühre bitte diese Schritte durch:\nKlicke auf start \nschreibe in das kleine Suchfenster unten \"CMD\" \nschreibe \"ipconfig /release\" und warte kurz bis die IP Adresse entlassen wird \nschreibe \"ipconfig /renew\" und warte kurz bis eine neue IP Adresse zugewiesen wurde \nschreibe \"ipconfig /flushdns\" und schliesse das CMD Fenster\n\nFalls du danach erneut ein Problem haben solltest, überprüf deinen Rechner mit Malware Bytes:\n\nhttp://www.malwarebytes.org/mwb-download/\"\n\nUnd der teil mir dem CMD hat mir geholfen das es  wieder funktioniert und wieder \"reagiert\". Hoffe das wird bei dir auch Funktionieren :)","replies":[]},{"poster":"hi im Vreeyx","date":"2016-02-14T10:57:21.950+0000","up_votes":1,"down_votes":0,"body":"Selbes Problem , ebenfalls alles versucht..","replies":[{"poster":"John Candy","date":"2016-02-14T14:58:23.613+0000","up_votes":1,"down_votes":0,"body":"Habe mal den Riot Support angeschrieben, vielleicht können die helfen.","replies":[]}]},{"poster":"Kim Jong Illaoi","date":"2016-02-13T22:05:04.988+0000","up_votes":1,"down_votes":0,"body":"Also Elophant ist runter, der PC neugestartet und League of Legends frisch installiert - dennoch kommt beim Starten des Spiels immer die Fehlermeldung bzgl. des PvP.net Kernel?","replies":[{"poster":"N3CROW","date":"2016-02-14T09:22:42.750+0000","up_votes":1,"down_votes":0,"body":"Ip hilfsdienst beendet? Hat bei mir damals immer geholfen","replies":[{"poster":"John Candy","date":"2016-02-14T14:57:34.601+0000","up_votes":1,"down_votes":0,"body":"Ja, funktioniert auch nicht","replies":[]}]},{"poster":"John Candy","date":"2016-02-14T14:54:00.370+0000","up_votes":1,"down_votes":0,"body":"Richtig, kann nicht mal mehr LoL erneut runterladen von der Seite.\nIch klicke auf den Download Button aber es passiert nichts.","replies":[]}]},{"poster":"legofreak1","date":"2016-02-13T22:39:53.796+0000","up_votes":1,"down_votes":0,"body":"Mit dem neuen Update reagieren einige Antivirenprogramme etwas überempfindlich, schau bitte nach, ob das bei dir der Fall ist und Dateien gelöscht oder in Quarantäne verschoben wurden und stelle diese entsprechend wieder her.","replies":[{"poster":"John Candy","date":"2016-02-14T14:56:44.208+0000","up_votes":1,"down_votes":0,"body":"In der Quarantäne bei Avira ist es nicht, aber danke für deine Antwort.","replies":[]}]},{"poster":"Katowi","date":"2016-02-13T22:24:51.207+0000","up_votes":1,"down_votes":0,"body":"Liegt wohl an riot. Ich habe genau das gleiche Problem.\nhttp://boards.euw.leagueoflegends.com/de/c/hilfe-support-de/cIdqJfzL-pvpnet-kernel-reagiert-nicht\n\nEs scheint auch so das man den Client momentan nicht mehr runter laden kann ...\n\nWenn ich hier auf der Seite versuche den client für west europa runter zu laden kommt Seite nicht verfügbar\n\nhttps://signup.euw.leagueoflegends.com/de/signup/redownload?type=new","replies":[{"poster":"John Candy","date":"2016-02-14T14:54:38.481+0000","up_votes":1,"down_votes":0,"body":"Ja bei mir genau das gleiche.","replies":[]}]}]}