{"poster":"Frankie Sinatra","date":"2018-09-15T05:45:10.892+0000","title":"\"TANQUES\" Tema serio","subforum":"Jugabilidad, balance y narrativa","up_votes":3,"down_votes":6,"body":"Hola amigos hoy le vengo a hablar sobre uno de los roles mas importantes en las partidas de League of legends.\r\nEl Tanque ese el cual resiste mucho da&ntilde;o y ayuda al team a conseguir objetivos y asi llegar a la victoria \r\nPero Hay un problema que espero esten de acuerdo conmigo y que riot haga algo al respecto , El rol de tanque es muy bueno para iniciar tfs o tan solo suportear en la botline Peeeeeeeeeeeeeroooo Hay algo que no se entiende que ese campeon al ser tanque{{champion:31}} {{champion:516}} {{champion:33}} {{champion:111}} {{champion:36}} {{champion:106}} {{champion:14}} {{champion:98}} {{champion:223}} {{champion:89}} {{champion:86}} {{champion:86}} {{champion:201}} {{champion:53}} {{champion:12}}  En especial (GAREN)\r\n\r\nPoseen la Capacidad de Eliminar muy rapidamente a los enemigos (Oneshotear) de tal manera de que es ya absurdo de su da&ntilde;o , Champs com Shen que tienen Cota de espinas y NADA MAS pero te quitan 300 por basico lo que no tiene sentido alguno o que tal GAREN hablemos de garen ,\r\n\r\nEste champ es muy pero MUY DIFICIL DE USAR....no Ya que cualquiera puede hacer Q,E,R y llevarse un asesinato por la cara Eso es divertido y todo pero piensa por un momento que sintio el otro ,que piensa , &quot;esta considerando borrar el lol?&quot; y mas si flashea{{summoner:4}} {{summoner:7}} o tira curar lo cual no lo salva porque la R de garen lo &quot;persigue&quot;\r\n\r\nLlevo un 2 a&ntilde;os jugando al lol y todavia no llego al entendimiento de porque los tanques tienen tanta capacidad de eliminar a los otros tan facilmente \r\n\r\nESTO NECESITA ARREGLO QUE UN TANQUE SEA TANQUE por algo se lo caracteriza como &quot;TANQUE&quot; NO QUE EL TANQUE venga y te desaparezca como hacen la mayoria de asesinos como Zed , Syndra,Talon,Etc (Y ese es otro tema muy serio tambien)\r\nNo que lleve al jugador a borrar el juego por frustracion de no poder hacerle nada al otro (y me nos si se buildea cosas ya muy TANQUES y sigue oneshoteandolo) Eso significaria un jugador menos de lol y espero que riot le ponga importancia\r\n\r\nPero eso es todo espero que ustedes compa&ntilde;eros de League of legends concuerden con mis preocupaciones acerca del juego\r\n\r\nPD: Riot &quot;arreglar el juego&quot; no es sacar un modo, buffear a los champs con nuevos skins y Esperar que compren Rp para tu codisia...\r\n\r\nGracias , amigos si se tomaron la molestia de leer con un Saludo y un abrazo **Frankie Sinatra**\r\n{{sticker:vlad-salute}}","replies":[{"poster":"Bunny Loli","date":"2018-09-15T11:30:34.789+0000","up_votes":5,"down_votes":0,"body":"Garen es un Juggernaut, no un tank.","replies":[]},{"poster":"I love fiora","date":"2018-09-15T06:18:21.489+0000","up_votes":4,"down_votes":1,"body":"Garen no es ningún tanke, anda leete la clasificación de clases de post y luego resube este post, si vas a estar haciendo posts de opinión asegúrate que lo que dices sea correcto, mundo tanke? Anda revisa por favor.\n\nPara el que quiera leer esto, aconsejo no hacerlo, alguien que no sabe ni las clases o fortalezas y debilidades no tiene poder de iniciar una discusión sobre justo eso, el poder de una clase","replies":[{"poster":"Frankie Sinatra","date":"2018-09-15T19:34:50.161+0000","up_votes":1,"down_votes":0,"body":"No digo que mundo sea tanke Si no que tiene mas daño que el adc y TANQUEA -_-{{sticker:sg-ahri-1}}","replies":[]}]},{"poster":"DavowO","date":"2018-10-03T21:17:22.371+0000","up_votes":1,"down_votes":0,"body":"Si vamos al caso, un tanque no tendría por qué tener menos capacidad de eliminar enemigos que otros roles. ¿Alguna vez viste un tanque que solo sirva para tapar balas?\nSegundo, tanto como Garen y Volibear son juggernauts. Por cierto, no veo como ayuda a tu argumento sobre los tanques haciendo más daño del que necesitan poniendo a champs hechos para supportear como Tahm, Leona, Braum, Blitz y Alistar.\n\nEn conclusión, te estás quejando de ganas. No estamos en un meta de tanques y los mismos están en un buen puesto. Es más, hace bastante no veo un tanque que no sea support. Bruisers y juggernauts están mas fuertes en el momento.\n\n¡Saludos! {{sticker:sg-ahri-2}}","replies":[]},{"poster":"IIIIIIIIIIIIIIII","date":"2018-09-15T08:39:48.615+0000","up_votes":1,"down_votes":0,"body":"{{item:3070}} {{champion:29}} \n\n{{sticker:sg-miss-fortune}}","replies":[{"poster":"Falkon","date":"2018-09-15T18:09:18.089+0000","up_votes":1,"down_votes":0,"body":"Debe haber un mensaje oculto en algun lado","replies":[]}]},{"poster":"Dat Butterfly","date":"2018-09-15T06:21:17.209+0000","up_votes":1,"down_votes":0,"body":"Según lo que tengo entendido los Tanques son los que protegen a los magos y tiradores ya que absorben todo el daño durante las peleas en equipo.  ¿Por que unos están mas fuertes?  No sabria decirte, pero hay que ver como esta el Meta. \n\nTambien puede ser las estadisticas del campeon: tanto su vida como armadura.","replies":[]}]}