{"poster":"xfKNloco68","date":"2017-01-22T23:40:26.676+0000","title":"HILFEEE :D","subforum":"Hilfe & Support","up_votes":2,"down_votes":1,"body":"Hey HEy :(\r\n\r\nnachdem ich meinen rechner restarten musste kommt auf einmal diese meldung ( war vorher auf deutsch jetz auf einmal auf englich ^^)\r\n\r\n*LoL path has not yet been set.. Please Browse to you Lol directory* (auf deutsch hie&szlig; es iwas mit &quot;dateipfad konnte nicht gefunden werden oder so ?\r\n\r\nund da ich am PC &quot;nichts&quot; kann, au&szlig;er zocken xd,  brauche ich eure HILFE BITTE ! :)","replies":[{"poster":"Gin","date":"2017-01-22T23:55:13.330+0000","up_votes":1,"down_votes":0,"body":"Ich weiß zwar nicht warum, aber deine Verknüpfung für League of Legends hat einen falschen oder keinen Pfad hinterlegt.\n\nUm das zu umgehen, öffne mal deinen \"Riot Games\" Ordner, und dort gehst du in \"League of Legends\".\n\nDort musst du dann folgendes machen:\n\n* Wenn du den **alten Client** benutzt: Rechtsklick auf \"lol.launcher.exe\" und dann Verknüpfung erstellen. Zieh die erstellte Verknüpfung dann auf deinen Desktop und führ die aus. \n\n* Wenn du den **neuen Client** benutzt: Rechtsklick auf \"LeagueClient.exe\" und dann Verknüpfung erstellen. Zieh die erstellte Verknüpfung dann auf deinen Desktop und führ die aus. (Also genau das selbe, nur mit einer anderen Datei)\n\nDann kannst du diese Verknüpfung benennen wie du willst, und es sollte funktionieren.\n\nSollte das dein Problem nicht beheben, deinstalliere und reinstalliere League of Legends.","replies":[{"poster":"xfKNloco68","date":"2017-01-23T00:02:28.788+0000","up_votes":1,"down_votes":0,"body":"Hey :) dankefür die hilfe. Das habe ich schon probiert, hat aber iwie nicht geholfen... Beim genaueren hinsehen, habe ich festgestellt, dass bei mir die verknüpfungen \"lol.launcher.admin\" und \"lol.launcher\" heißen.. da fehlt bei beiden die \".exe\" und einen dateinamen mit \".exe\" kann ich nicht in den lol ordner finen :(","replies":[{"poster":"Gin","date":"2017-01-23T00:07:28.203+0000","up_votes":1,"down_votes":0,"body":"Das ist so auch richtig, ich habe nur vergessen dass ich bei mir eingestellt habe dass die Dateiendungen angezeigt werden.\n\nStatt \"lol.launcher.exe\", einfach nur \"lol.launcher\". Und statt \"LeagueClient.exe\" dementsprechend \"LeagueClient\".\n\nAber da das so oder so nicht geholfen hat würde ich dir raten es einfach mal neuzuinstallieren.","replies":[{"poster":"xfKNloco68","date":"2017-01-23T00:12:35.193+0000","up_votes":1,"down_votes":0,"body":"funkt. leider nicht...:( \n\nd.H, ich muss jetzt LoL de- und reinstallieren ? mit den ganzen Updates 0_o ?","replies":[{"poster":"Gin","date":"2017-01-23T00:18:16.654+0000","up_votes":1,"down_votes":0,"body":"Wäre der sicherste Weg. Alternativ kannst du mal probieren den Client mit dem [Hextech Repair Tool](https://support.riotgames.com/hc/de/articles/224826367-Automatisierte-Fehlerbehebung-Hextech-Repair-Tool) zu reparieren.","replies":[{"poster":"xfKNloco68","date":"2017-01-23T00:35:42.325+0000","up_votes":1,"down_votes":0,"body":"bin nicht der fan von probieren :) aber trotz. allen thx 4 help <3\n\nbin grad am updaten .... :( wäre ja alles kein problem wenn ich nicht grad mit dem handy online wäre da inet z. Zt. nicht funzt ... xd","replies":[{"poster":"Gin","date":"2017-01-23T15:24:10.145+0000","up_votes":1,"down_votes":0,"body":"Zwei Stunden neuinstallieren ist immer noch besser als stundenlang nicht spielen können und das Problem suchen :)","replies":[]}]}]}]}]}]}]}]}