{"poster":"floti99","date":"2019-01-30T10:45:21.988+0000","title":"Gründung eines neuen Teams im Gold - Plat Bereich","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Guten Abend,\n\nwie schon oben erw&auml;hnt suchen wir Spieler f&uuml;r ein Team, welches wir komplett neu aufbauen wollen.\n\nGesucht sind die Rollen: Jgl, Mid und Marksman\n\nGeplant ist ein Team, welches das Ziel hat, sich nicht nur w&auml;hrend der Games gut zuversteht, sondern auch abseits der Kluft einen vern&uuml;nftigen Draht zu pflegen &uuml;bt.\n\nGeplant ist ebenfalls eine stetige Teilnahme an kompetitiven Turnieren im Bereich 5vs5. Um das jedoch sinnvoll umzusetzten, sowie auch &uuml;berhaupt einen Erfolg genie&szlig;en zu k&ouml;nnen, wird im Vorfeld folgendes &quot;gefordert&quot;:\n\nDiziplin - nicht nur in Hinsicht auf Kritik, sondern auch in Hinsicht auf Erscheinen zu abgemachten Trainingszeiten, welche notwendig sind, um die o.g. Ziele anzupeilen und zu verwirklichen.\n\nSpa&szlig; am kompetitiven Spiel - nicht jedermanns Sache, da regelm&auml;&szlig;iges Training und tryharden gerne mal in Games m&uuml;ndet, an denen man nicht so ganz Spa&szlig; an dem hat was man gerade Spielt und man eine gewisse Pflicht hat welches &uuml;ber das Hobbyspielen hinaus geht.\n\nEigenkritik - zu jedem Improvement z&auml;hlen Fehler. Diese sind wichtig, um voranzukommen. Tilt sowie Flame ist daher unangebracht. Sehe die Fehler als eine Treppe, die du immer weiter hinauf steigst.\n\nTiltproof - erkl&auml;rt sich glaub ich von selbst.\n\nTeamkommunikation - klar.\n\nNun zu den Bestandsvoraussetzungen:\n- Headset mit halbwegs guter Quali\n- Im o.g. Elobereich\n- Mindestalter - 18 Jahre\n- eine gewisse Spielerfahrung (ist aber kein muss!)\n\nFalls ich Dich mit der Wall of Text noch nicht abgeschreckt habe, erl&auml;utere ich noch einmal kurz die Vorteile des Teams.\n\nDich erwarten nicht nur reines Teamplay, sondern dank der Unterst&uuml;tzung von Gamers Evolving Taskforce auch, ein professioneller Clan welcher Chancen auf Weiterbildung durch high-Elo-Player, sowie auch interne, individuelle Teamunterst&uuml;tzung bietet.\n\nFalls du Interesse hast, einfach adden. Danke f&uuml;r deine Zeit.\n\nGr&uuml;&szlig;e floti99","replies":[{"poster":"INSP SoouLi","date":"2019-01-30T12:31:59.815+0000","up_votes":1,"down_votes":1,"body":"Sobald ihr eine Organisation sucht, könnt ihr euch gerne bei uns melden :)\n\n\nWarum urFATALITY eSports !?\n……………………………………………………………………………………………………………………\n\n» urFATALITY eSports ist eine seit 2012 existierende aktive Community!\n» 160 aktive Mitglieder!\n» 100% Wiedererkennungswert!\n» Strukturierte Organisation!\n» Professionelle Mitarbeiter für jeden Bereich!\n» Wir achten sehr auf unsere Community und bieten allen Mitgliedern ein familiäres Umfeld!\n» Unsere Hauptspiele sind League of Legends, CS:GO und PUBG\n\n\n\nWas suchen wir? Was können wir euch bieten?\n……………………………………………………………………………………………………………………\n\n» Du hast es satt Solo-Queue zu spielen und möchtest Anschluss finden?\n» Du möchtest endlich ein Team gründen und findest keine Mitspieler?\n» Dein Team sucht eine anständige Orga, die dir alles bieten kann?\n» Du suchst viel Spaß und Gelegenheiten Interne Pcw‘s & Cups zu absolvieren?\n» Du möchtest, dass deine Clips auf unserem YouTube Kanal gesehen werden?\n» Du bist über 16 Jahre alt und besitzt über 500 Spielstunden in einem von unseren 3 Games?\n» Du hast keinen Game-Ban, bist mindestens Gold Rang in LOL, Master Guardian Elite in CS:GO oder bist mind. Gold in PUBG?\n\n» » » DANN BIST DU BEI UNS GENAU RICHTIG!\n\n\n\n» Wir bieten dir/euch:\n» Einen vielseitigen gut überschaubaren Teamspeak mit reichlichem Plugins & Tools und dazu eine Aktivität mit stets über 70 Membern täglich!\n» Ein ordentliches Forum für die gesamte Community zum Austauschen & wichtige Informationen!\n» Coaching für Teams & Spieler\n» Interne Cups & Pcw's\n» urFATALITY eSports SHOP\n» Professionell & League Teams\n» Professionelle EPS Gameserver für unsere Teams\n» Viele nette Leute zum Zocken\n» Eine Menge Spaß!\n» Für Streamer ein eigenen internen Bereich\n» Für Donator (natürlich freiwillig) Sonderrechte\n» Eine proffesionelle Homepage!\n» und noch vieles mehr ...\n\n……………………………………………………………………………………………………………………\n\n\n\nWorauf wartest du noch?\nBewirb dich jetzt!\n\nTeamSpeak 3 IP: ts.urfatality.com\n\n(Einfach auf den Teamspeak connecten und über euch in den Bewerberchannel joinen. Außerdem findet ihr hier noch den Link, um eure Bewerbung einzutragen! Die Bewerbung sollte alle Informationen beinhalten, die ihr in der Vorlage findet.) urfatality.com/joinus (Wichtig!)\n\nE-Mail: support@urfatality.com\n\nWir freuen uns auf Euch! :)","replies":[{"poster":"floti99","date":"2019-01-31T21:29:52.105+0000","up_votes":1,"down_votes":0,"body":"Nein","replies":[]}]},{"poster":"Hey Fishbones","date":"2019-01-30T11:31:12.714+0000","up_votes":1,"down_votes":0,"body":"Wenn ihr noch einen Gold Adc sucht dann bin ich euer Mann :)","replies":[{"poster":"floti99","date":"2019-01-30T12:18:52.134+0000","up_votes":1,"down_votes":0,"body":"Ich hab dich mal geaddet","replies":[]}]}]}