{"poster":"Stewie Griffin","date":"2016-01-23T13:57:29.587+0000","title":"Team Ranked S6","subforum":"Esports","up_votes":16,"down_votes":1,"body":"Buenas! Como muchos ya sabr&aacute;n esta season no hay Team Ranked, las eliminaron por completo del juego. &iquest;Por qu&eacute;? No lo entiendo la verdad, sinceramente lo encuentro una estupid&eacute;z, supieran cuentos equipos profesionales, semi-profesionales y equipos de amigos hab&iacute;an, con ganas de jugar, divertirse o de aprender, mejorar y ser reconocidos a nivel nacional o internacional. Tengo un equipo, llegamos a Platino III, nos gusta participar de torneos y eventos, en el equipo era 1 Master, 3 Diamond y yo Platino. Esta season qued&eacute; Silver (lo de menos, se sube) y mis amigos en Platino y dos de ellos ya subieron a Diamond, el tema es que en el modo din&aacute;mico solo se puede jugar con gente que este una liga m&aacute;s alta o m&aacute;s baja que el otro, por lo tanto yo no puedo participar con mis compa&ntilde;eros en ese modo, y la verdad es algo que me frustra BASTANTE, me molesta y no me gusta, en las team ranked uno pod&iacute;a jugar con qui&eacute;n quisiera, sin importar la liga, les puedo apostar que en un team de puros diamond hasta un silver puede jugar bien y hacer un buen trabajo para el equipo.\r\nEsta season est&aacute;n practicamente &quot;obligando&quot; a subir a la gente de low elo para poder jugar con sus amigos de elo alto, lo que por un lado es bueno, mejorar, aprender y esas cosas, pero aun asi no le veo la gracia al haber sacado las Team Ranked.\r\nTengo un amigo el cual se iba a retirar de League of Legends, ya hab&iacute;a cumplido su meta, era Challenger, el juego se le tornaba bastante aburrido y pr&aacute;cticamente casi no jugaba, hasta que entro a un Team, conocio amigos, aprendi&oacute; a trabajar en equipo, se motiv&oacute; y sigi&oacute; jugando, hoy hablando con el le coment&eacute; sobre el tema, y creanme que se bajon&eacute;o bastante al saber que ya no podr&iacute;a jugar Team Ranked. \r\nNo entiendo que tiene Riot en la cabeza al sacar algo tan importante como las Team Ranked, yo quer&iacute;a llegar lo m&aacute;s alto con mi team, mejorar, aprender a tener un mejor trabajo en equipo, etc pero ahora no podr&eacute; :/ lo encuentro super injusto. \r\nClaro, algunos dir&aacute; que juege normales y esas cosas, pero ... dejeme decirles algo, NO ES LO MISMO!\r\nQUE VUELVAN LAS TEAM RANKED :( RIOT PLS! \r\nPD: No tengo buena redacci&oacute;n xD.","replies":[{"poster":"Riot Maggical","date":"2016-01-23T19:56:17.551+0000","up_votes":4,"down_votes":10,"body":"Hola Jiraiya Sensei,\n\nLamento que te sientas así, pero te entiendo un poco. La verdad es que tenés lugares donde jugar con tus amigos y participar en eventos oficiales y competir. Para eso creamos los Torneos Nacionales, ¿acaso se anotaron para jugar en ellos?\n\nPor otro lado si lo importante es jugar con amigos y mejorar no hace falta el Ranked Team para eso, pueden hacerlo en Normales simplemente. Además se vienen más sorpresas pronto para gente como vos, tienen que esperar nada más pero te aseguro que los Ranked Team se sacaron por algo mucho más importante y significativo.\n\nTen confianza, un abrazo.","replies":[{"poster":"ChronoGrandpa","date":"2016-01-23T20:12:21.832+0000","up_votes":14,"down_votes":2,"body":"> [{quoted}](name=Riot Maggical,realm=LAS,application-id=Ky2nrTjR,discussion-id=Aem3mhJl,comment-id=0000,timestamp=2016-01-23T19:56:17.551+0000)\n>\n> Hola Jiraiya Sensei,\n> \n> Lamento que te sientas así, pero te entiendo un poco. La verdad es que tenés lugares donde jugar con tus amigos y participar en eventos oficiales y competir. Para eso creamos los Torneos Nacionales, ¿acaso se anotaron para jugar en ellos?\n> \n> Por otro lado si lo importante es jugar con amigos y mejorar no hace falta el Ranked Team para eso, pueden hacerlo en Normales simplemente. Además se vienen más sorpresas pronto para gente como vos, tienen que esperar nada más pero te aseguro que los Ranked Team se sacaron por algo mucho más importante y significativo.\n> \n> Ten confianza, un abrazo.\n\nMaggical, avisale a los otros rioters que estan tomando cafe que se esta quemando el server","replies":[{"poster":"ZombieCrow","date":"2016-01-23T21:03:33.864+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=ElTatoX,realm=LAS,application-id=Ky2nrTjR,discussion-id=Aem3mhJl,comment-id=00000000,timestamp=2016-01-23T20:12:21.832+0000)\n>\n> Maggical, avisale a los otros rioters que estan tomando cafe que se esta quemando el server\n\njajaja +1","replies":[]},{"poster":"Raptor","date":"2016-01-24T01:14:57.827+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=ElTatoX,realm=LAS,application-id=Ky2nrTjR,discussion-id=Aem3mhJl,comment-id=00000000,timestamp=2016-01-23T20:12:21.832+0000)\n>\n> Maggical, avisale a los otros rioters que estan tomando cafe que se esta quemando el server\n\njajaja + 100","replies":[]}]},{"poster":"Frank295","date":"2016-01-31T02:51:33.244+0000","up_votes":2,"down_votes":0,"body":"No es lo mismo, jugar normales (aunque sea en premade de 5) es diferente a team ranked. En las team ranked podías tener una liga en el equipo, y con eso, podías saber cómo se desempeñaba el equipo (en partidas normales también se puede, pero es diferente, en las rankeds los dos equipos ponen mucho esfuerzo, y en normales no tanto, además del matchmaking, en normales te puede tocar contra gente unranked, bronces o gente de liga inferior, y puede hacerlo más fácil jugar contra gente de menor nivel).\nAdemás, lo que dijiste de los torneos nacionales o regionales, no aplica en todos los casos, jugar contra jugadores de elo alto, si vos sos de elo no tan alto, es difícil. Y para inscribirse, todos sus miembros deben tener más de 16 años (no entiendo el sentido de esta regla, siendo que esos torneos no son presenciales, pero bueno, el señor Rito así lo quiere), y hay equipos de buen nivel que tienen jugadores menores, que no se pueden inscribir sólo por eso.","replies":[{"poster":"Riot Maggical","date":"2016-01-31T04:03:51.817+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Frank295,realm=LAS,application-id=Ky2nrTjR,discussion-id=Aem3mhJl,comment-id=00000005,timestamp=2016-01-31T02:51:33.244+0000)\n>\n> No es lo mismo, jugar normales (aunque sea en premade de 5) es diferente a team ranked. En las team ranked podías tener una liga en el equipo, y con eso, podías saber cómo se desempeñaba el equipo (en partidas normales también se puede, pero es diferente, en las rankeds los dos equipos ponen mucho esfuerzo, y en normales no tanto, además del matchmaking, en normales te puede tocar contra gente unranked, bronces o gente de liga inferior, y puede hacerlo más fácil jugar contra gente de menor nivel).\n> Además, lo que dijiste de los torneos nacionales o regionales, no aplica en todos los casos, jugar contra jugadores de elo alto, si vos sos de elo no tan alto, es difícil. Y para inscribirse, todos sus miembros deben tener más de 16 años (no entiendo el sentido de esta regla, siendo que esos torneos no son presenciales, pero bueno, el señor Rito así lo quiere), y hay equipos de buen nivel que tienen jugadores menores, que no se pueden inscribir sólo por eso.\n\nNadie te está diciendo que juegues normales, te digo que esperes que se vienen novedades para que puedas competir con tus amigos y equipo, solamente que no va a ser Ranked Team, es algo nuevo.","replies":[{"poster":"Ulvehund","date":"2016-03-31T17:11:49.834+0000","up_votes":3,"down_votes":1,"body":"En realidad, más arriba hay comentarios, y cito \"Si lo importante es jugar con amigos y mejorar no hace falta el RankedTeam, pueden hacerlo en normals simplemente\". Están diciendo que juguemos normales.\n\n Me parece a mí, dos meses después de esta conversación, que fué un gran desatino el hecho de sacar las RT. Con mis amigos somos 5, nos conocemos en persona, podemos organizarnos, jugamos practicamente todos los días y más o menos rondamos el mismo ELO todos, ellos siempre estuvieron en platino y ahora me sumé yo que arranqué el año pasado (sigo en oro). El tema es que uno de los chicos es diamante, y siempre que termina sus 10 de posicionamiento queda platino 1, por lo que podemos jugar juntos como mucho, 10 partidas antes que ascienda a Diamante y no lo dejen emparejarse conmigo (sin contar, que mis amigos platino quedan en oro 3 o 4 después de las primeras 10, por ende con ellos tampoco puede jugar por un tiempo).\n Sin embargo las ranked team nos permitian (más que nada a mi) jugar con gente que tenía muchísimo mas nivel y aprender mucho. A mi me pusieron a supportear al diamante y aprendí muchísimo. Sinceramente creo que la razón más importante de que haya mejorado tanto fueron las RT.\n He jugado contra challengers que nos pasaron por arriba 1,2,3 y mil veces, hasta que en un momento nos volvió a tocar contra challengers y estuvimos a poco de ganarles, y ahí es donde la habilidad nos jugó en contra, pero el caso es que hemos mejorado muchísimo, y con este sistema nuevo nos están negando, no sólo a nuestro equipo sino también a todos los otros, la oportunidad de aprender más y más rápido.\n Ahora sin las RT jugamos normals casi siempre para poder jugar los 5, pero la primer noche que dijimos \"Vamos a practicar para anotarnos en algún torneo\" en el otro equipo había un TF adc y una karma JG. Así no aprendemos nada, ni siquiera con el mayor de los optimismos. Yo dije \"Bueno, por lo menos sabemos que karma JG no rinde\" nos reímos, la pasamos bien, pero ya sabíamos que Karma JG no rendía y el hecho de haber querido practicar y que nos pongan eso enfrente realmente nos desmotivó para intentar llegar a algo.\n Insisto en que las RT TIENEN que estar, no hay margen para sacarlas, creo que no hay excusa que justifique el hecho de privarnos de jugar en equipo. No se si las novedades prometidas tienen algo que ver con lo de los clubes, de ser así simplemente fué una mala desición el cambio. Que se entienda, no estoy criticando a RIOT ni mucho menos a los moderadores/empleados/etc, simplemente hago una critica constructiva desde mi punto de vista (y el de algunas personas más) sobre algo que considero una mala desición.\n\n Nunca es tarde para volver sobre sus pasos, y más en este caso, les agradeceríamos inmensamente la prueba de que también son seres humanos y pueden equivocarse pero también enmendar los errores.\n Gracias por el espacio.","replies":[]},{"poster":"Sporkion","date":"2016-04-28T04:57:11.274+0000","up_votes":1,"down_votes":1,"body":"los grupos?","replies":[]},{"poster":"Frank295","date":"2016-02-01T00:53:19.953+0000","up_votes":1,"down_votes":1,"body":"Lo sé, pero sólo digo porque vos en un comentario dijiste que si lo importante era jugar con tus amigos y mejorar, podías hacerlo en normales (con mi comentario no decía que no se pudiese, sólo que suele haber más afk's, trolls, o gente probando campeones, etc.).\nGracias por la respuesta.","replies":[]},{"poster":"Smug Lee Main","date":"2016-01-31T06:21:00.983+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Riot Maggical,realm=LAS,application-id=Ky2nrTjR,discussion-id=Aem3mhJl,comment-id=000000050000,timestamp=2016-01-31T04:03:51.817+0000)\n>\n> Nadie te está diciendo que juegues normales, te digo que esperes que se vienen novedades para que puedas competir con tus amigos y equipo, solamente que no va a ser Ranked Team, es algo nuevo.\n\nSe pasaría por mi post señor rito? :(","replies":[]}]}]},{"poster":"DeigoHMD","date":"2016-01-23T22:03:34.189+0000","up_votes":3,"down_votes":0,"body":"Si pero aún así era agradable tener un equipo no competitivo para pasarla bien, es decir para ver el nivel de juego en conjunto y esas cosas, tenía uno con mis amigos era las tortas de jalea y aunque no jugábamos casi nada era como algo nuestro, no se si entiendes :/","replies":[{"poster":"Riot Maggical","date":"2016-01-23T23:23:02.161+0000","up_votes":3,"down_votes":2,"body":"> [{quoted}](name=dahumadaxd12,realm=LAS,application-id=Ky2nrTjR,discussion-id=Aem3mhJl,comment-id=00000001,timestamp=2016-01-23T22:03:34.189+0000)\n>\n> Si pero aún así era agradable tener un equipo no competitivo para pasarla bien, es decir para ver el nivel de juego en conjunto y esas cosas, tenía uno con mis amigos era las tortas de jalea y aunque no jugábamos casi nada era como algo nuestro, no se si entiendes :/\n\nY te aseguro que lo que se viene es aún mejor y va a ser suyo :)","replies":[{"poster":"Hwaxinghz","date":"2016-01-23T23:40:44.023+0000","up_votes":3,"down_votes":2,"body":"GG con el misterio de Riot :P.\n\nEspero que sea pronto si es una sorpresa ....{{sticker:slayer-jinx-catface}}","replies":[]},{"poster":"Alex098","date":"2016-04-18T16:08:40.439+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Riot Maggical,realm=LAS,application-id=Ky2nrTjR,discussion-id=Aem3mhJl,comment-id=000000010000,timestamp=2016-01-23T23:23:02.161+0000)\n>\n> Y te aseguro que lo que se viene es aún mejor y va a ser suyo :)\n\ny todabia 3 meses despues de haber leido este post y tener la misma queja, no ah venido nada bueno, para que sacaron team ranked me pregunto.\nLo unico copado q an implementado fue ranked de 5 pero team ranked estaba mucho mejor","replies":[{"poster":"Kran30","date":"2016-05-01T12:02:36.629+0000","up_votes":1,"down_votes":1,"body":"osea qe si somos del mismo equipo los invito a mi team y jugamos aparece la etiqeta ?S","replies":[]}]},{"poster":"alhasthor","date":"2016-01-24T04:04:06.356+0000","up_votes":2,"down_votes":2,"body":"> Y te aseguro que lo que se viene es aún mejor y va a ser suyo :)\n\n\nesto tiene algo q ver con los clubes q anunciaron?? {{sticker:slayer-pantheon-popcorn}}","replies":[]}]}]},{"poster":"Stewie Griffin","date":"2016-01-26T04:26:16.477+0000","up_votes":4,"down_votes":1,"body":"No es lo mismo jugar normales que Team Ranked .... en normales sale de todo, en Team Ranked la dificultad va aumentando a medida que el equipo va subiendo y mejorando y se va tornando más emocionante el juego. \nLo PEOR que pudieron haber echo esta season es quitar las Team Ranked, sinceramente la cagaron, asi de simple.\nMi meta era llegar lo más alto con mi team y ahora no puedo .... de los torneos si participamos, pero no podemos entrenar seriamente en \"normales\" ya que el nivel de juego no es lo mismo! ¿Por que no entienden eso? Este juego cada vez va empeorando más :/ lo unico que me motiva a jugar es mi equipo y ahora ya ni puedo jugar con ellos ....  Nosotros entrenabamos de Lunes a Viernes y ahora no jugamos ... no hay team ranked ... cuale s la gracia jugar normal si no es lo mismo que Team Ranked! :(","replies":[]},{"poster":"Stewie Griffin","date":"2016-01-26T04:22:54.990+0000","up_votes":3,"down_votes":1,"body":"No es lo mismo jugar normales que Team Ranked .... en normales sale de todo, en Team Ranked la dificultad va aumentando a medida que el equipo va subiendo y mejorando y se va tornando más emocionante el juego. \nLo PEOR que pudieron haber echo esta season es quitar las Team Ranked, sinceramente la cagaron, asi de simple.","replies":[]},{"poster":"Quab","date":"2016-07-17T20:37:58.827+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Riot Maggical,realm=LAS,application-id=Ky2nrTjR,discussion-id=Aem3mhJl,comment-id=0000,timestamp=2016-01-23T19:56:17.551+0000)\n>\n> Hola Jiraiya Sensei,\n> \n> Lamento que te sientas así, pero te entiendo un poco. La verdad es que tenés lugares donde jugar con tus amigos y participar en eventos oficiales y competir. Para eso creamos los Torneos Nacionales, ¿acaso se anotaron para jugar en ellos?\n> \n> Por otro lado si lo importante es jugar con amigos y mejorar no hace falta el Ranked Team para eso, pueden hacerlo en Normales simplemente. Además se vienen más sorpresas pronto para gente como vos, tienen que esperar nada más pero te aseguro que los Ranked Team se sacaron por algo mucho más importante y significativo.\n> \n> Ten confianza, un abrazo.\n\nYo jegue al nivel 30 hace 3 dias, dejemne opinar un momento sobre esto.\n\nNo hay nada peor que meterse en blind picking (normal) y ver que tenes dos de tu equipo que son grupo, y que los enemigos son todos del mismo club con tag y todo; empieza el partido y BAM!! los dos, que se conocieron en ranked plata4, terminan siendo masacrados por los de oro1.\n\nY pretenden que esto pase tambien en ranked ?\n\nSeamos honestos: el 80% de la comunidad va a jugar solo, por lo menos hasta que consiga un pool de amigos suficientemente grande como para realmente jugar en un equipo construido.\n\nLo que si debe haber es ranked grupos ENTEROS, 5 monchos en el equipo contra otro de cinco premades.\n\nYo vengo de jugar en EUW y alla el LoL es bastante diferente, no se si decir \"avanzado\" pero puedo decir que si implementan las mismas cosas en los servidores mas pequeños, como este, los grupos van a tener muchas actividades para hacer que simplemente hacer queue en ranked.","replies":[]},{"poster":"Shadowlites","date":"2016-05-18T13:14:59.355+0000","up_votes":1,"down_votes":1,"body":"es joda ? hacen torneos nacionales ? esta perfecto me encanta pero no se pusieron a pensar que no todos somos challengers que vivimos de eso ? en esos torneos te agarran 5 pibes que se la pasan jugando todo el dia y ya esta en 20 minutos tenes que tirar ff porque te sacaron una ventaja abusiva. Esos torneos son para competir no para pasarla bien como concretan ahi arriba. De ultima hagan torneos como decirlo amateurs, donde solo vean cuentas abajo de diamante o de platino , donde sabes que podes jugar sin que te aplasten la linea en un abrir y cerrar de ojos. No quita que la gente con cuentas smurf entre pero bueno por lo menos vez que jugas con gente de tu nivel.","replies":[]},{"poster":"Kran30","date":"2016-05-01T11:59:23.453+0000","up_votes":1,"down_votes":1,"body":"una pregunta osea qe el team qe cree no sirve de nada ?? o como hago para jugar ??","replies":[]},{"poster":"CuervoArtorias","date":"2016-04-18T16:35:56.063+0000","up_votes":1,"down_votes":1,"body":"Se que esto ya es de hace mucho pero... Lo de \"te aseguro que los Ranked Team se sacaron por algo mucho más importante y significativo.\" ¿Tiene que ver con meter normales donde hay bans, meter clubes (así se mantienen las siglas, ya sea de tu antiguo team, etc, etc)?\n\nO sea... ¿Pusieron esas opciones para que las ausencias de las ranked team no sean tan grandes, hasta que se implemente lo otro?\nSi todo esto era parte de un plan que se les acaba de ocurrir... Bien hecho, esta todo friamente calculado.{{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"ixtus","date":"2016-03-16T02:29:34.156+0000","up_votes":1,"down_votes":1,"body":"hola pero entiendo que talvez lo sacaron para hacer algo mas grande pero gente como yo que no puede ir a los eventos o torneo por que tenemos que trabajar osea no somos todos challenger y estaba muy bueno el tema de ranked team por que era una forma de competir desde una casa hace mucho tiempo que no le dedico tiempo a las ranked ni al lol pero hace un tiempo que venimos jugando juntos en team en una casa con unos amigos y no podemos hacer un team para jugar los 5 disculpame pero me parece una idiotes sin ofender no es lo mismo jugar una normal que con otro team de 5 :/","replies":[]},{"poster":"TBP SoulReaver","date":"2016-02-21T03:52:40.551+0000","up_votes":1,"down_votes":1,"body":"peroo.... hay mas oros platas y bronces que platinos y diamantes como para jugar en torneos nacionales :/... que vuelvan los team ranked ctm","replies":[]},{"poster":"l Void l","date":"2016-01-23T22:21:09.078+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Riot Maggical,realm=LAS,application-id=Ky2nrTjR,discussion-id=Aem3mhJl,comment-id=0000,timestamp=2016-01-23T19:56:17.551+0000)\n>\n> Hola Jiraiya Sensei,\n> \n> Lamento que te sientas así, pero te entiendo un poco. La verdad es que tenés lugares donde jugar con tus amigos y participar en eventos oficiales y competir. Para eso creamos los Torneos Nacionales, ¿acaso se anotaron para jugar en ellos?\n> \n> Por otro lado si lo importante es jugar con amigos y mejorar no hace falta el Ranked Team para eso, pueden hacerlo en Normales simplemente. Además se vienen más sorpresas pronto para gente como vos, tienen que esperar nada más pero te aseguro que los Ranked Team se sacaron por algo mucho más importante y significativo.\n> \n> Ten confianza, un abrazo.\n\nIntriga pls {{item:3151}}","replies":[]}]},{"poster":"SFG Kalahari","date":"2016-01-24T05:13:04.463+0000","up_votes":3,"down_votes":0,"body":"Espero que lo que vayan a poner en el server en \"remplazo\" de las team ranked sea bueno y que le guste a todo el mundo. Ahora.. quiero hacer una pregunta, como hace alguien que quiere entrar a la escena competitiva sin poder formar parte de un equipo?","replies":[{"poster":"Riot Maggical","date":"2016-01-24T13:49:37.732+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=SFG Kalahari,realm=LAS,application-id=Ky2nrTjR,discussion-id=Aem3mhJl,comment-id=0001,timestamp=2016-01-24T05:13:04.463+0000)\n>\n> Espero que lo que vayan a poner en el server en \"remplazo\" de las team ranked sea bueno y que le guste a todo el mundo. Ahora.. quiero hacer una pregunta, como hace alguien que quiere entrar a la escena competitiva sin poder formar parte de un equipo?\n\nMi recomendación acá es que juegues mucho SoloQ y rankees en lo más alto de la Cola Individual de Clasificatorias. Ahí jugarás seguido con nuestros jugadores profesionales y si lo hacés bien te van a notar y cuando necesiten un nuevo jugador seguramente se acordarán de vos. Eso pasó muchísimo y sigue pasando.","replies":[{"poster":"Technø","date":"2016-01-24T16:06:59.213+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Riot Maggical,realm=LAS,application-id=Ky2nrTjR,discussion-id=Aem3mhJl,comment-id=00010000,timestamp=2016-01-24T13:49:37.732+0000)\n>\n> Mi recomendación acá es que juegues mucho SoloQ y rankees en lo más alto de la Cola Individual de Clasificatorias. Ahí jugarás seguido con nuestros jugadores profesionales y si lo hacés bien te van a notar y cuando necesiten un nuevo jugador seguramente se acordarán de vos. Eso pasó muchísimo y sigue pasando.\n\njajajajajaja osea que no se puede jugar team ranked por que capas me llaman dejame de joder yo quiero jugar con mis amigosy rankear juntos no me interesa ser profecional","replies":[{"poster":"Riot Maggical","date":"2016-01-24T19:30:18.428+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=GoKuB,realm=LAS,application-id=Ky2nrTjR,discussion-id=Aem3mhJl,comment-id=000100000000,timestamp=2016-01-24T16:06:59.213+0000)\n>\n> jajajajajaja osea que no se puede jugar team ranked por que capas me llaman dejame de joder yo quiero jugar con mis amigosy rankear juntos no me interesa ser profecional\n\nEstas leyendo mal mi respuesta. Yo respondí eso ESPECÍFICAMENTE a esta pregunta: _\"Ahora.. quiero hacer una pregunta, como hace alguien que quiere entrar a la escena competitiva sin poder formar parte de un equipo?\"_\n\nNo lo respondí de forma general para explicar porque sacamos el Ranked Team. No te confundas por favor.","replies":[]}]},{"poster":"GatóMonstruo","date":"2016-01-24T19:29:16.738+0000","up_votes":1,"down_votes":1,"body":"Como dice Maggical, en high elo muchos de los \"jugadorazos\" del lol hacían duo con otro miembro de su team. Es muy sencillo darse cuenta si un jugador es bueno/malo/regular, etc.  Para que te saques las dudas, espectá a los Challangers y vas a ver lo que son esas partidas, son orgásmicas.","replies":[]}]},{"poster":"La corrupción","date":"2016-01-24T15:18:39.656+0000","up_votes":1,"down_votes":1,"body":"lo que dijo maggical, un jugador coreano fdr o no se que se la pasa jugando solo q, ya lo tienen visto varios equipos a futuro, por ahora no jugo en competitivo","replies":[]}]},{"poster":"KINGZONE PraY","date":"2017-08-31T15:34:37.422+0000","up_votes":1,"down_votes":0,"body":"Hola buenos dias , por lo que tengo entendido se vienen muchos cambios en la etapa de clasificatoria competitiva , creo que seguramente se aplicaran las cantidad de colas clasificatorias y seguramente en esa aparezca alguna donde puedas jugar con amigos o conocidos o gente de tu agrado. \nPor otro lado también quiero , expresar lo mi humilde opinión sobre el ranked team , creo que representaba algo mas que la liga que estaba y que todo el mundo se lo tomaba de manera competitiva y que jugar con tus amigos era la mejor manera de que uno pueda mejorar , ya que es el momento de poder aprender o reflexionar cuando uno juega con un jugador de elo alto  , a que me refiero si ese jugador tiene algún vinculo relacionado con el otro jugador , es mas fácil el aprendizaje , ya que uno puede aceptar una critica mas fácil de un conocido que un randon.\nTambién mi opinión respecto de a la cola clasificatoria flex , creo que al no poder jugar de 4 jugadores , te obliga a jugar de a 5 , para ser un verdadero team , y siempre en relación a esa cola , vas a tener jugadores que no conoces o que simplemente intentan o su sentido del juego va por otro carril totalmente diferente a los que están acompañándote en tu juego.\nLa ranked team es algo original del juego y seguramente no va a volver , pero estaría bueno que riot pueda escuchar a los usuarios y se re-plante algunas cosas relacionado a ese tema , el juegos es de los usuarios ,  poder hacer una votación seria y masiva , ya que nosotros como jugadores somos los que elijemos todo los días el juego y  el método de partida que queremos jugar/competir  , cierto que no  podemos interferir en los objetivos del servidor , pero aveces con una comunidad abierta  es mucho mas fácil .\nNo es una critica esto solamente es un punto de vista , también me parece que como volvió la SoloQ , tambien en algun momento la ranked team no sea guardada en el cajón de los recuerdo . \nCreo que sin mas nada que agregar , Un Saludo y ojala algún rioter pueda leer lo que escribí\nUn Afectuoso saludo Invocadores!","replies":[]},{"poster":"Dustskull","date":"2016-11-07T16:49:07.029+0000","up_votes":1,"down_votes":0,"body":"es la pura y santa verdad, jugando aleatorio es muy dificil salir del elo hell sueles perder partidas por trolls afk o simplemente gente que no entiende el concepto del early mid y late y la vision del juego, yo de llevar jugando 4 meses llegue a oro 1 siendo soporte y asi como mismo he bajado porque no es posible tener buenos resultados cuando eres de una linea que lamentablemente no vas a generar desequilibrio como JG o SUP es muy dificil carrear cuando el equipo rival esta jugando de mejor manera y tu equipo ni siquiera conoce los wards.... a diferencia de jugar team ranked que ya tienes mayor comunicacion  te entiendes mejor todo tu equipo sabe a lo que juegan las composiciones son en base a alguna estrategia etc..... con la cantidad de niños de 12 años jugando en elo hell creo q se pierde gran cantidad de buenos jugadores en bronze solo por este motivo, yo al menos jugando contra platinos y diamantes me mantengo en nivel y hasta he sido carry de una que otra partida como soporte... eso te dice que el team ranked deberia volver porque se esta perdiendo muchos buenos jugadores solo por el sistema de rank  que esta actualmente","replies":[]},{"poster":"Quab","date":"2016-07-17T20:26:27.349+0000","up_votes":1,"down_votes":0,"body":"MOMENTO!!\n\nEn ranked ya no se puede ir con equipos !?\n\nAFK me fui a jugar ranked !\n\n(Me van a masacrar con los votos negativos, jaja)","replies":[]},{"poster":"ORO V FOREVER","date":"2016-06-19T22:42:48.919+0000","up_votes":1,"down_votes":0,"body":"Si lo que prometian que iba a ser mejor que las rankeds team era lo de los clubes y las etiquetas la pifiaron feo, se pueden equivocar son humanos, pero fue un error enorme haber sacado las R5. Ojala las puedan meter de nuevo! \nSalu2","replies":[]},{"poster":"Nanoide","date":"2016-01-24T21:35:52.519+0000","up_votes":1,"down_votes":2,"body":"Riot maggical, puedo pedir si por favor, banean la cuenta good vayne y sarkinar please","replies":[{"poster":"AA Seba","date":"2016-02-14T18:29:39.175+0000","up_votes":1,"down_votes":0,"body":"ahora lo que yo no entiendo es lo siguiente: sacan las ranked team, pero te siguen dejando crear teams, y despues te sale el cartelito pedorro que tu team entro en inactividad porque no jugas, pero si no te dejan jugar!!","replies":[{"poster":"el kurt","date":"2016-02-26T21:38:39.364+0000","up_votes":1,"down_votes":0,"body":"Quizas esto sea una pista de lo que se viene! quien sabe quizas se armen mini torneos bronzas? XD","replies":[]}]},{"poster":"AA Seba","date":"2016-02-14T18:30:07.053+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Profanity72,realm=LAS,application-id=Ky2nrTjR,discussion-id=Aem3mhJl,comment-id=0002,timestamp=2016-01-24T21:35:52.519+0000)\n>\n> Riot maggical, puedo pedir si por favor, banean la cuenta good vayne y sarkinar please\n\nel comentario mas bronce que vi, como se animas a postear estas cosas?","replies":[]}]},{"poster":"Smílock","date":"2016-02-14T04:13:15.042+0000","up_votes":1,"down_votes":0,"body":"Hola, tengo gran conocimiento sobre los diseños de juegos, también escribo y fui a una escuela de teatro, amo relatar partidas cuando estoy solo y se sobre animación, también toco la guitarra y un poco de teclado, amo la música y tengo muchísimas ideas que me gustaría compartir. desde que conocí el juego me puse de meta poder trabajar para riot, en cualquiera de sus actividades, me encantaría ganarme la vida en algo que me apasiona, no soy tan bueno como para ganarme la vida jugando profesionalmente ni me interesa mucho el cosplay así que solo me gustaría saber si existe la posibilidad de trabajar para riot en algún aspecto, desde ya muchas gracias y un saludo enorme.","replies":[]},{"poster":"DoveSsy","date":"2016-01-27T18:46:15.515+0000","up_votes":1,"down_votes":1,"body":"RIOT MAGGICAL que pasara Equipos de clasificatoria? osea que pasara con los equipos armados que quieren asender?","replies":[]}]}