{"poster":"Killer Kactus","date":"2019-07-24T03:20:08.365+0000","title":"My opinion on the playerbase and an unfair ban.","subforum":"Player Behavior","up_votes":2,"down_votes":13,"body":"I'm a new player. I've been playing for about a month and in my opinion, league isn't getting many new players. There are 6-7 Smurfs in my games that constantly BM. It's new player experience seems to be terrible, to the point where I feel like I'm stuck playing bots.\r\n\r\nComing from CS:GO and other games that pretty much let you say whatever my recent ban was a shock.\r\n\r\nI said 'GLHF f*gs' at the start of the game, like how I usually would any team game. Giant mistake. Instantly some loser soy boy white knight said I was homophobic. Me a teammate, and some of the enemy were confused. How the hell is that homophobic?\r\n\r\nHave none of you guys seriously never called your friends B*tches or F*gs before? Its extremely commonplace for anybody like 12-25 years old.\r\nThey said any use of the word 'F*g' is apparently homophobic. So if a gay guy tells his friends he's a f*g then he's being homophobic? If I'm chilling in my room and I randomly say 'F*g' then I'm homophobic? That doesn't click with me.\r\n\r\nThey said It was hate speech. How? I feel like saying the word 'Gay' isnt hate speech, but something like 'I Hate Gays' is. Saying 'GLHF F*gs' gives literally no sign of hate anywhere. I clearly dont hate gays because I said 'GLHF F*gs.' I said it like how I would've any other of my friends, and I obviously dont hate my friends.\r\n\r\nHoly hell, dont make the internet your safe space. It's pretty pathetic you need one already, dont make it bigger. It's gotten to the point where 'Speech' is now considered 'Hate Speech.'","replies":[{"poster":"Periscope","date":"2019-07-26T05:19:31.129+0000","up_votes":1,"down_votes":0,"body":"This subforum is not an area to discuss hate speech, nor is it an area for players who show no inclination to reform. As such, this post has been locked.\n\nIf you have any questions about this moderation action, don't hesitate to reach out to the Boards Moderation Team via:\n\n* The [**NA Boards Discord**](https://boards.na.leagueoflegends.com/en/c/community-moderation/7rtKBZLi-boards-moderation-discord-verification)\n* The [**Discuss the Boards**](https://boards.na.leagueoflegends.com/en/c/community-moderation) sub-board","replies":[]},{"poster":"Hotarµ","date":"2019-07-24T03:36:50.133+0000","up_votes":6,"down_votes":0,"body":">I said 'GLHF f*gs' at the start of the game, like how I usually would any team game. Giant mistake. Instantly some loser soy boy white knight said I was homophobic. Me a teammate, and some of the enemy were confused. How the hell is that homophobic?\n\n While you may not have meant it in a derogatory way the word at it's very core _is_ discriminatory, hateful, _and_ homophobic.\n\n Also, homophobia is a serious topic that some people still have to deal with on a daily basis, it doesn't make them a \"loser soy boy white knight\" if they don't like to see that language in a recreational activity.\n\n>Have none of you guys seriously never called your friends Btches or Fgs before? Its extremely commonplace for anybody like 12-25 years old.\nThey said any use of the word 'Fg' is apparently homophobic. So if a gay guy tells his friends he's a fg then he's being homophobic? If I'm chilling in my room and I randomly say 'F*g' then I'm homophobic? That doesn't click with me.\n\n I don't think it makes you completely homophobic and I don't think it makes you a bad person, but in regular social settings that's not something people are usually comfortable with. \n \nPersonally I don't say that to my friends, but if we did use that word as commonplace language, we'd know that it's a controversial word with a sensitive history and we would be polite enough to not use it towards people we don't know. That's just a combination of common sense and common decency, honestly.\n\n>Holy hell, dont make the internet your safe space. It's pretty pathetic you need one already, dont make it bigger. It's gotten to the point where 'Speech' is now considered 'Hate Speech.'\n\n For one, \"Hate speech\" is an **[actual term defined by the Merriam-Webster dictionary. ](https://www.merriam-webster.com/dictionary/hate%20speech)**\n\n>Definition of \"hate speech\"\n: speech expressing hatred of a particular group of people\n\n While you may not have meant it in a hateful manner, the word is inherently negative due to the troubled history and controversial topics surrounding it. \n\n Also, what's wrong with someone taking issue with hateful speech like that? Life sucks sometimes and some people just want to kick back and enjoy a game of League without seeing homophobic slurs thrown around. Nothing wrong with that.","replies":[{"poster":"Killer Kactus","date":"2019-07-24T20:13:08.253+0000","up_votes":1,"down_votes":6,"body":"You guys seem to have a soft mentality, which is everything I expected to be honest. And you treat your game like its some kind of zen relaxing shit, but its not. Quite the opposite. \n\nTheres nothing wrong with having an issue when somebody says they hate gays. But if somebody says 'good luck have fun %%%s' then whats the issue? My use of the word %%% is obviously not derogatory in anyway, so I'd treat it like a joke. And If I was dumb enough to think it was serious, then most I would think is 'damn this guys kinda a douche' and continue on my way. If i was really a soy boy then I would just mute them. But I dont wither when somebody calls me a term, even if they do say it in a way that specifically conveys hate.\n\nAnd it brings me to my next point. I could attach virtually every point to the word 'Bitch' which seems to be allowed in this community, and is actually pretty common. Whats the difference? If I said 'GLHF bitches' then it would be all great and dandy. It's a discriminatory sexist term too.\n\nIf somebody in your community was so scared to see the word '%%%' then I'd assume they would have the censor thing on at all times.","replies":[{"poster":"rujitra","date":"2019-07-24T20:40:55.830+0000","up_votes":1,"down_votes":0,"body":"The word you use is a word whose only purpose in the standard, accepted definitions of the English language in North America is to hate gays. Thus, when you say there's nothing wrong with having an issue when someone says they hate gays, you're saying there's nothing wrong with having an issue with that word.\n\nThe word \"bitch\", on the other hand, actually *didn't* start as a sexist term, and has only *rarely* been used to express sexism.","replies":[{"poster":"Killer Kactus","date":"2019-07-24T20:58:30.680+0000","up_votes":1,"down_votes":2,"body":"A simple google search tells me it used to be the 'ultimate insult', and started out as a term used to describe women as belligerent, unreasonable, malicious, a control freak, rudely intrusive or aggressive.","replies":[{"poster":"rujitra","date":"2019-07-24T21:02:09.476+0000","up_votes":2,"down_votes":1,"body":"Key word, used to be. The original definition of the word was not sexist - it was literally a word for \"female dog\". It began being used with sexist tones, but nowadays it's simply another curse word.","replies":[{"poster":"Killer Kactus","date":"2019-07-24T21:22:46.566+0000","up_votes":1,"down_votes":2,"body":"Thats what '%%%' should be too.","replies":[{"poster":"rujitra","date":"2019-07-24T21:24:40.841+0000","up_votes":2,"down_votes":1,"body":"You are free to have that opinion, but your opinion of what it \"should be\" does not change what the common and accepted usage and definition of that word are.","replies":[]}]}]}]}]},{"poster":"Hotarµ","date":"2019-07-24T20:59:18.964+0000","up_votes":3,"down_votes":1,"body":"> You guys seem to have a soft mentality, which is everything I expected to be honest. \n\n Nope, not at all. I'm actually pretty tame and forgiving when it comes to those words. Call me a soyboy, white knight, SJW, snowflake, whatever cute nicknames you want to come up with. \n\nThat's cool. I just think we should treat each other with common decency and refrain from using words (within reason) that might genuinely offend someone. If being a decent human being makes me a snowflake, then I'll wear that label with pride.\n\n Thankfully, Riot agrees with my thought process and forbids that language. If you want to use it then do it in a Discord or through private messages because it's not welcome here, end of discussion.\n\n> Theres nothing wrong with having an issue when somebody says they hate gays. But if somebody says 'good luck have fun %%%s' then whats the issue? My use of the word %%% is obviously not derogatory in anyway, so I'd treat it like a joke. And If I was dumb enough to think it was serious, then most I would think is 'damn this guys kinda a douche' and continue on my way. If i was really a soy boy then I would just mute them. But I dont wither when somebody calls me a term, even if they do say it in a way that specifically conveys hate.\n\n It's sad that you think everyone else has the problem. If they take issue with a touchy word, they're a soyboy, an idiot, or incapable of leaving a \"safe space.\"\n\n Treat your fellow man with respect. \n\n> If somebody in your community was so scared to see the word '%%%' then I'd assume they would have the censor thing on at all times.\n\n  Nobody is \"scared\" to see the word, I can't help but notice you keep saying that.\n\n I'm personally not offended by the word and my gay friends that play aren't, either. In fact, their reaction isn't even one of disgust, it's just annoyance. \n\n_\"Oh haha, that guy is so funny, he said f-g, haha\"_ in a sarcastic tone, then they mute the person and report them at the end of the game. It doesn't offend them and I'd be willing to bet that the majority of people feel the same way. It's childish, annoying, and wrong, even if it's not your intention to harm someone.","replies":[{"poster":"Killer Kactus","date":"2019-07-24T21:39:39.708+0000","up_votes":1,"down_votes":2,"body":"> Nope, not at all. I'm actually pretty tame and forgiving when it comes to those words. Call me a soyboy, white knight, SJW, snowflake, whatever cute nicknames you want to come up with.\n\nThen you're not those terms you listed if you're 'pretty tame and forgiving'\n\n> t's sad that you think everyone else has the problem. If they take issue with a touchy word, they're a soyboy, an idiot, or incapable of leaving a \"safe space.\"\n\nThat's the entire reason of them being a soyboy, is that they're taking major offense to a (not even that touchy and is used commonplace among most of the gaming community [except league apparently]) word, and they get me banned because I jokingly called everybody 'fgs' and told them to have fun and good luck.\n\n> Nobody is \"scared\" to see the word, I can't help but notice you keep saying that.\n\nObviously nobodys scared of it, it's an exaggeration. It describes their reaction, how hard they shun the word, freak out, and have a breakdown when they see it, like satan or something.\n\n> I'm personally not offended by the word and my gay friends that play aren't, either. In fact, their reaction isn't even one of disgust, it's just annoyance.\n\nGreat! thats what I like to see.","replies":[]}]}]}]},{"poster":"Umbral Regent","date":"2019-07-24T03:42:19.961+0000","up_votes":4,"down_votes":1,"body":"> I said 'GLHF (omitted)' at the start of the game...\n\nThat's not an unfair ban. Riot doesn't allow homophobic slurs.\n\n> Have none of you guys seriously never called your friends Btches or (omitted) before? Its extremely commonplace for anybody like 12-25 years old.\n\nWere they your friends? 'Cause I don't think they were your friends, so the argument of \"haven't you ever used [insert insult here] with your friends\" doesn't pass here.\n\nRegardless of how you trade insults and talk with your friends, you agreed to the [Terms of Use](https://na.leagueoflegends.com/en/legal/termsofuse) upon account creation (and you also do so any time you update the game), and part of the Terms of Use was a [Code of Conduct](https://na.leagueoflegends.com/en/legal/termsofuse#code-conduct) which you agreed to follow.\n\nAnd in that Code of Conduct is the following;\n\n> **5.1. Can I troll, flame, threaten or harass people while using the Riot Services? (No. If you do, you might get banned.)**\n>\n> ...\n>\n> The following are examples of behavior that warrant disciplinary measures:\n>\n> ...\n>\n> v. _Transmitting or communicating any content which, in the sole and exclusive discretion of Riot Games, is deemed offensive, including language that is_ unlawful, _harmful_, threatening, abusive, harassing, defamatory, vulgar, obscene, sexually explicit, or racially, ethically, or _otherwise objectionable_;\n\nIn other words, _no flaming, and **no hate speech.**_\n\n> They said any use of the word '(omitted)' is apparently homophobic. So if a gay guy tells his friends he's a (omitted) then he's being homophobic? If I'm chilling in my room and I randomly say '(omitted)' then I'm homophobic? That doesn't click with me.\n\nAs far as the rules are concerned, yes, any usage of the word is deemed homophobic. There are many other less hate-charged words to denote someone as being homosexual, and there are a blue billion words to call someone \"friends\". You opted for a homophobic slur.\n\n> They said It was hate speech. How?\n\nWell, let's see; the fact that the word is largely associated with dehumanizing homosexuals? Much like how friends trading insults is common, that information is common knowledge as well.\n\n> I feel like saying the word 'Gay' isnt hate speech, but something like 'I Hate Gays' is.\n\nIn that much, you're right.\n\n> Saying 'GLHF (omitted)' gives literally no sign of hate anywhere. I clearly dont hate gays because I said 'GLHF (omitted).'\n\nThe word alone holds connotations of hate. That's why it's _hate_ speech. It's a word largely used to express hate over an unchangeable aspect of someone's character, in this case, their sexuality.","replies":[{"poster":"Killer Kactus","date":"2019-07-24T20:42:27.819+0000","up_votes":2,"down_votes":3,"body":"Riot doesnt allow homophobic slurs? Censor them. Simple enough.\n\nThey dont have to be my friends to jokingly call a bunch of randoms online %%%s in an in game lobby. I was using that argument to convey how commonplace those terms were, and how many people hating on me right now have used them as well. Just because they're not my friends doesnt mean I have to be all formal and shit with them.\n\nNow your argument is based around the fact that What I said was hate speech, and then you say It wasn't when you say 'In that much, you're right' So thats confusing as hell.","replies":[{"poster":"Imperial Pandaa","date":"2019-07-24T21:31:40.136+0000","up_votes":2,"down_votes":0,"body":"It is censored if you have the language filter turned on, so are common cuss words. I don't care about cuss words, so I turn the filter off. I do have a problem with things considered hate speech.\n\nThey should all be your friends if you are going to call them such. Why? Because you don't know the circumstances for the others. Have been in chat groups with gay people and two had very different experiences. One was comfortable with calling themself a fg and others as such. Another had been harshly discriminated with and harassed with the same exact word. So we asked the comfortable one to refrain from such language. Because they were Respectful, they did.","replies":[{"poster":"Killer Kactus","date":"2019-07-24T21:42:55.660+0000","up_votes":1,"down_votes":2,"body":"I know thats why I'm saying. They should have a permanent filter for any supposed 'hate speech.' So unexpecting people like me dont get hit with a ban for saying 'glhf %%%s' And people will be less affected too.","replies":[{"poster":"Imperial Pandaa","date":"2019-07-24T21:45:27.917+0000","up_votes":3,"down_votes":0,"body":"Or people could just be more respectful and not use that language.","replies":[{"poster":"Killer Kactus","date":"2019-07-24T22:08:14.831+0000","up_votes":1,"down_votes":3,"body":"This is the internet you're talking about. Nobodys a fuckin saint here. You hear about the dude that stabbed the kid over call of duty?\nYou cant expect some call of duty kid that spent his entire life screaming profanity over a trash mic to walk in and be Jesus Christ himself. In fact, you cant expect anybody to do that.","replies":[{"poster":"Imperial Pandaa","date":"2019-07-24T22:48:33.106+0000","up_votes":3,"down_votes":0,"body":"This is the internet is a poor excuse. It is what we make of it. Whether that be a chill place to hang out; a place to frag some noobs; or a hellscape is up to us. Every place is going to be different to an extent.\n\nYou don't need to be a saint though. Sometimes we get angry, and sometimes we need to vent; but we are still reaponsible for our actions. Obviously you weren't angry in this case. You did what you feel is normal and have been given a stern warning that this is not a norm for this game community.","replies":[]}]}]}]}]},{"poster":"Umbral Regent","date":"2019-07-25T18:59:01.851+0000","up_votes":1,"down_votes":0,"body":"> Riot doesnt allow homophobic slurs? Censor them. Simple enough.\n\nSimply censoring the words isn't feasible, as you can use multiple different characters to produce the same word, and Riot would either have to somehow manage to censor _every_ possible iteration of the word, or make a point to ban people for trying to bypass the filter.\n\nSo we'd wind up right back at square one.\n\n> They dont have to be my friends to jokingly call a bunch of randoms online %%%s in an in game lobby.\n\nI disagree. If they're not your friends, then you don't know what they're comfortable/willing to deal with, and you should keep those unknown sensibilities in mind when interacting with them.\n\n> I was using that argument to convey how commonplace those terms were, and how many people hating on me right now have used them as well.\n\nCommonplace != good/acceptable behavior. Flaming is commonplace too, but it's not welcome behavior. Likewise, there are a lot of behaviors that are or have been commonplace that were/are absolutely atrocious. Never take commonality as an indicator that something's fine.\n\nAs for people using those terms; one thing that's worthwhile to note is that we aren't hating on you, we're explaining Riot's policies (as well as our opinions) on hate speech. Beyond that, while some of us probably use hate speech liberally in our social circles, we only do so knowing that the friends/people we're talking to in said circles are fine with us saying it.\n\nAt the end of the day, though, we err on following the rules, since we don't know the people we get matched with, can't know their situations, and really can't know what they would and wouldn't be okay with hearing/seeing.\n\n> Just because they're not my friends doesnt mean I have to be all formal and shit with them.\n\nCertainly not, but there are still rules you've got to follow. I'd be surprised if I saw anyone being particularly formal with people, especially if it was because they were strangers.\n\n> Now your argument is based around the fact that What I said was hate speech, and then you say It wasn't when you say 'In that much, you're right' So thats confusing as hell.\n\nI'm not sure how it's confusing. All I did was affirm that this statement about hate speech;\n\n> I feel like saying the word 'Gay' isnt hate speech, but something like 'I Hate Gays' is.\n\nWas correct. Saying \"gay\" isn't hate speech, but saying \"I hate gays\" is; the latter communicates explicit hate for gay people, while the former is simply saying \"gay\".\n\nGranted, there are cases where using the word \"gay\" can hold negative connotations and border hate speech (such as saying \"that's so gay\" as a way of saying that something was dumb or awful or whatever else), but by and large, saying \"gay\" in and of itself isn't problematic.\n\nI still wouldn't randomly blurt it out though, personally, but hopefully you get my point.","replies":[]}]}]},{"poster":"rujitra","date":"2019-07-24T03:24:31.319+0000","up_votes":4,"down_votes":3,"body":"This is a game for enjoyment. Hate speech isn't necessary and isn't welcome in League, period.","replies":[{"poster":"Killer Kactus","date":"2019-07-24T20:14:03.410+0000","up_votes":1,"down_votes":3,"body":"Then have league censor it if it was so fuckin scary to see the word '%%%' on your screen.","replies":[{"poster":"rujitra","date":"2019-07-24T20:17:52.728+0000","up_votes":2,"down_votes":2,"body":"Bulletproof vests don't make shooting at someone okay.","replies":[{"poster":"Madjack01","date":"2019-07-24T20:30:29.553+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=rujitra,realm=NA,application-id=ZGEFLEUQ,discussion-id=KIP3XUic,comment-id=000100000000,timestamp=2019-07-24T20:17:52.728+0000)\n>\n> Bulletproof vests don't make shooting at someone okay.\n\nYou're not helping your case with this analogy.","replies":[{"poster":"rujitra","date":"2019-07-24T20:39:02.820+0000","up_votes":2,"down_votes":0,"body":"Please explain how the analogy is inaccurate.","replies":[{"poster":"Killer Kactus","date":"2019-07-24T20:49:39.639+0000","up_votes":2,"down_votes":1,"body":"'Bulletproof vests don't make shooting at someone okay.'\n\nOf course it doesnt but nobody will shoot at you if they know you have a bullet proof vest on right?\n\nA bullet proof vest is for 'Just in case' but if you censor it, there is no chance somebody will call somebody a 'fg'\n\nExplain the logic for banning me for saying 'fg' and not censoring the word itself. The reason you banned me is so I couldnt keep saying it right? Simply just ban the word! Then I wouldn't have gotten banned, then I would have realized 'oh you cant say the word' then we wouldn't be wasting our time arguing over this stupid shit, AND THEN YOUR PLAYERS WOULDN'T EVER HAVE TO SEE SOMEBODY TYPE 'FG' IN THE CHAT!\n\nSo many pros, cant see any cons other than a bit of work to censor it.","replies":[{"poster":"rujitra","date":"2019-07-24T20:51:14.928+0000","up_votes":2,"down_votes":0,"body":"The logic is the same - the existence of bulletproof vests does not absolve a shooter of responsibility for the shooting.\n\n\"Oh well they could've just worn a bulletproof vest/not been in that area/not made him mad\" - it's all victim blaming, and that's not how life works.","replies":[{"poster":"Killer Kactus","date":"2019-07-24T21:20:18.672+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"rujitra","date":"2019-07-24T21:33:11.360+0000","up_votes":2,"down_votes":1,"body":"This is a video game that people play for entertainment and diversion from their real life. Your actions are akin to someone talking/chewing loudly or being on their phone in a movie theater. Your actions are detracting from the experience for people - and even if they have the censor on, it's almost always very clear what word you used - it's not acceptable, period.\n\nYou agreed to the rules, either follow them or feel free to find another game to play that's more your style. I encourage you to rethink how you act though, because acting with this sort of attitude in real life will bring you next to no benefit, but will ruin relationships with other people, lead to you losing your job, and potentially getting into run-ins with the law for harassment. It's not \"being a pussy\" to want to be able to enjoy a video game without someone doing something that's completely unnecessary.\n\nSeriously though - it's completely unnecessary. The **ONLY** reason you would say something like that is to be \"edgy\", or because you're **intentionally** trying to make others uncomfortable.","replies":[{"poster":"Killer Kactus","date":"2019-07-24T21:59:39.721+0000","up_votes":1,"down_votes":1,"body":"> Your actions are detracting from the experience for people - and even if they have the censor on, it's almost always very clear what word you used - it's not acceptable, period.\n\nI have a great idea for a censor actually. What if you replaced every curse word with like just a set number of hashtags, no matter how many characters it has, like 3. Then they dont know what word anybody used.\n\n>  I encourage you to rethink how you act though, because acting with this sort of attitude in real life will bring you next to no benefit, but will ruin relationships with other people, lead to you losing your job, and potentially getting into run-ins with the law for harassment.\n\nYou said something about escaping real life and then now you're saying how something I do in something that's supposed to be different than real life will effect real life. Also It wont ruin relationships with my friends because like i said, its pretty commonplace for guys to walk up to their friends and go 'whats good %%%s.' Obviously I dont walk over to my boss and call him a %%%, because you need to be formal. But you don't need to be formal in a damn video game.\n\n> It's not \"being a pussy\" to want to be able to enjoy a video game without someone doing something that's completely unnecessary.\n\nObviously it's not. It's being a pussy because a random stranger that jokingly said 'good luck have fun %%%s' online ruined your in game experience. Me and literally everybody i know would just say 'You too btch' and laugh about it. \n\n> Seriously though - it's completely unnecessary. The ONLY reason you would say something like that is to be \"edgy\", or because you're intentionally trying to make others uncomfortable.\n\nI know right, no other reasons. Not because its commonplace and its just what me and millions of other people talk like at all. I'm obviously trying to intentionally harass people.\n\nBut yeah you're pretty right actually. It was unnecessary, but to be honest plenty of things millenials and gen z's do are unnecessary, but we always find a reason to do it anyways.","replies":[]}]}]}]}]},{"poster":"Madjack01","date":"2019-07-24T21:13:29.736+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=rujitra,realm=NA,application-id=ZGEFLEUQ,discussion-id=KIP3XUic,comment-id=00010000000000000000,timestamp=2019-07-24T20:39:02.820+0000)\n>\n> Please explain how the analogy is inaccurate.\n\nIt's a physical attack, not even remotely proportionate when compared to insulting someone, a bulletproof vest doesn't offer complete protection and certainly does not take the criminal aspect of shooting someone away (compared to fa.ggot=hate speech, ???=only insinuates an insult).\n\nBut just the thing about how disproportionate it is, is inaccuracy enough.","replies":[{"poster":"rujitra","date":"2019-07-24T21:16:22.474+0000","up_votes":2,"down_votes":2,"body":"No, that's not how analogies work. You are describing **equivalency** - not an analogy. Obviously an analogy is not going to be exactly the same - it is intended to describe the *idea* or *concept* - not describe the exact same situation with different specifics.\n\nRegardless, the idea is the same - the existence of a *mitigation* tool does not excuse the inappropriate behavior.","replies":[{"poster":"Madjack01","date":"2019-07-24T21:50:48.945+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=rujitra,realm=NA,application-id=ZGEFLEUQ,discussion-id=KIP3XUic,comment-id=0001000000000000000000010000,timestamp=2019-07-24T21:16:22.474+0000)\n>\n> No, that's not how analogies work. You are describing **equivalency** - not an analogy. Obviously an analogy is not going to be exactly the same - it is intended to describe the *idea* or *concept* - not describe the exact same situation with different specifics.\n> \n> Regardless, the idea is the same - the existence of a *mitigation* tool does not excuse the inappropriate behavior.\n\nI wasn't discussing the correct conceptual usage of analogies, you just assumed that. Exaggerating and neglecting other key aspects do not serve your argument during a regular discussion, using an analogy doesn't magically change that.\n\nThat being said the abstraction you link to both of them is not correct.  Censorship in this context is not a mitigation tool, but a prevention tool. Unless you deem that Riot should punish the intent to express insults or hate speech, rather than the actual expression of those sentiments. It's the implication of the latter idea which I have trouble with.","replies":[]}]}]}]}]}]}]}]},{"poster":"KFCeytron","date":"2019-07-24T20:34:09.390+0000","up_votes":1,"down_votes":1,"body":"https://i.imgur.com/O5kuSN2.gifv","replies":[]},{"poster":"Koiyaki","date":"2019-07-24T03:59:18.250+0000","up_votes":1,"down_votes":1,"body":"Feel free to way watever u want to ur friends in dm or voice, but when ur talking to randoms, they arent ur friends. they dont know you. And trying to find intent over anonymous text chat is near impossible. Ur afe doesn't matter either. If you were to call me the non hard r n word i wouldn't like it either. I'm black ansd i don';t like either iterations. I don't know wat race u are, i dont care wat race u are, and we are not friends, as such i dont want it in my game, as many other would agree. \n\nCase end point, if you wouldnt say it in a profession mixed company, dont say it to randoms on a screen\n\njust my 2 cents","replies":[{"poster":"Killer Kactus","date":"2019-07-24T20:31:20.445+0000","up_votes":2,"down_votes":3,"body":"Ah a fellow black guy lmao. In CS:GO and plenty of other games, you boot it up and jump into a randoms, you hear dudes chanting the n-word, 'fg' and many other things. I dont know them. I dont take offense either.\n\nIf I hopped into a competitive in CS:GO and I said 'sup bitches lets do this shit ima go A' or something I wouldn't get 'OH MY GOD OH MY GOD OH MY GOD YOU ARE SO SEXIST SUCH A BIGOT DISGUSTING GET BANNED!' No. I would get 'Hell yeah man lets kick ass' or 'Damn right I'll come with you A'\n\nTrying to find intent over text is pretty easy actually.\n'I FUCKING HATE YOU YOU FUCKING SUCK YOU PIECE OF SHIT TRASH' I could tell they dont like me.\n'Sup fgs lets kick ass' I could tell this dude is laid back and chill.\n'I gay people are so stupid what the hell' I could tell this dude doesn't like gay people.\n'?' This guy is trying to BM.\n'Noooooooo Really?' This guy is being sarcastic.\n\nFor that case end point thing, since when did anybody ever treat a game lobby like a 'profession mixed company'?","replies":[]}]},{"poster":"Killer Kactus","date":"2019-07-24T03:20:48.141+0000","up_votes":1,"down_votes":7,"body":"Looking forward to seeing some comments! I don't know how dead the forum is though, so I hope I get some!","replies":[{"poster":"CharDeeMcDenniz","date":"2019-07-24T11:42:25.466+0000","up_votes":1,"down_votes":1,"body":"i dont think you're gonna like what you hear","replies":[{"poster":"Killer Kactus","date":"2019-07-24T19:47:40.079+0000","up_votes":1,"down_votes":5,"body":"Nah I was right about the league community. This is exactly what I expected lmao.\n\n\nLmao of all the comments here that are even more controversial, I dont know why the positive one gets the most dislikes. The entire league community is backwards I guess.","replies":[{"poster":"CharDeeMcDenniz","date":"2019-07-25T09:00:52.380+0000","up_votes":1,"down_votes":0,"body":"does this fantasy world you live in have a name?","replies":[]}]}]}]}]}