{"poster":"Aletheiacracy","date":"2019-07-26T05:35:30.522+0000","title":"Chat Logs? A rant about boards.","subforum":"Discuss the Boards","up_votes":2,"down_votes":18,"body":"I've noticed people posting chat logs. Chat logs show what the person was saying all game. And then people pick it apart searching for the _\"you can never ever say that under ANY circumstance Ever NEVER\"_ comment in the entire dialogue, then beat you over the head with it. \r\n\r\nBut if you copy &amp; paste the entire discussion to show reference? It's \"naming and shaming\".\r\n\r\ni.e.\r\n\"You're not allowed to show why your actions were actually the response of an intelligent human being that had to deal with the literal trash this game generates.\"\r\n\r\nSo next time somebody posts a chat log and your criticism is that they sad \"wow you're bad\" or \"get a life loser\", then know this: \r\n\r\nyou're just a part of the problem. \r\n\r\nAnd if you are like me, and you're just tired of the passive-aggressive belligerence and the totalitarianism being enforced, and reinforced, by the people mentioned above- then I think it's time we find a new platform to discuss the game.\r\n\r\nBoards, seems to me, to be the pestering Susan that wants to speak for the entire neighborhood, when said neighborhood doesn't want Susan around. And so said neighborhood becomes influenced in policy by Susans sad remarks, and then the real turmoil begins. Now the community thinks it acts in the neighborhoods best interest, and enforces Susans policies in the name of the neighborhood.\r\nBecause quite frankly, I believe the majority of players strongly disagree with what Riot and its followers so casually call \"community standards\".\r\n\r\nBack to the solution. Maybe one already exists? Let's find a new platform to discuss the game where we can set the precedent.\r\n\r\nA safe space.. to be free from safe spaces.","replies":[{"poster":"Periscope","date":"2019-07-26T05:48:28.140+0000","up_votes":6,"down_votes":0,"body":"Hey,\n\nI removed your post and ya, it was for naming and shaming. I get that it was a post about how you were keeping calm under not so great situations, but you did have his name mentioned in your post along with negative things associated with the player, including that they were previously permabanned and that they'd called their teammates names. It's fine to repost, but without the other player's name.","replies":[{"poster":"Aletheiacracy","date":"2019-07-26T06:07:48.024+0000","up_votes":1,"down_votes":14,"body":"Hey, \n\nI get that it can be hard to break away from the routine. I understand you've been given a dialogue to sell, and that you believe you are enforcing the message of your narrative, but you should try gaining some perspective. I encourage you to study more world history, and look into politics. You might also learn to better appreciate the opinions and disservices of the greater community. It's fine to have an opinion, but you will find that opinions carry little weight. Discussion itself is a practice of making sense of the real, and by its nature can never fully observe the real. It's why we say, \"actions speak louder than words\", but I digress. It seems both superfluous and pretentious for you to attempt to carry out a discussion, considering your position is that of execution. \n\nAnd the overall point being:\nIn politics, one does not execute authority and then retract their position by feeling the need to explain themselves, to do so shows weakness. If you have any political aspirations then take this advice with you. People that deserve power, that actually have \"the divine right to rule\" do not answer to their subjects.","replies":[{"poster":"rujitra","date":"2019-07-26T16:21:19.359+0000","up_votes":4,"down_votes":0,"body":"The moderator did not delete your post based on their authority.\n\nThey deleted your post based on the rules.\n\nYou are using a red herring to vaguely insult someone you disagree with. You further seem to never actually carry out discussion on these boards - you only look for people who agree with you and if you *do* respond to someone who disagrees, it's either an insult or is completely off topic, as if you haven't even tried to understand their points.","replies":[{"poster":"Aletheiacracy","date":"2019-07-26T17:05:07.261+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"rujitra","date":"2019-07-26T17:12:54.979+0000","up_votes":2,"down_votes":0,"body":"You mention you are discontent with the current shaming rule. Multiple users here have provided you multiple very valid reasons for the rule. You haven't responded to any of the reasoning whatsoever.","replies":[]}]}]},{"poster":"KFCeytron","date":"2019-07-26T06:54:49.542+0000","up_votes":3,"down_votes":0,"body":"Next time you go to someone's house and they tell you to take off your shoes, don't.\n\nInstead, tell them this:\n\n> [{quoted}](name=Aletheiacracy,realm=NA,application-id=6heBIhQc,discussion-id=I7UV6tty,comment-id=00000000,timestamp=2019-07-26T06:07:48.024+0000)\n>\n> Hey, \n> \n> I get that it can be hard to break away from the routine. I understand you've been given a dialogue to sell, and that you believe you are enforcing the message of your narrative, but you should try gaining some perspective. I encourage you to study more world history, and look into politics. You might also learn to better appreciate the opinions and disservices of the greater community. It's fine to have an opinion, but you will find that opinions carry little weight. Discussion itself is a practice of making sense of the real, and by its nature can never fully observe the real. It's why we say, \"actions speak louder than words\", but I digress. It seems both superfluous and pretentious for you to attempt to carry out a discussion, considering your position is that of execution. \n> \n> And the overall point being:\n> In politics, one does not execute authority and then retract their position by feeling the need to explain themselves, to do so shows weakness. If you have any political aspirations then take this advice with you. People that deserve power, that actually have \"the divine right to rule\" do not answer to their subjects.\n\nSaving that for copypasta.","replies":[{"poster":"GatekeeperTDS","date":"2019-07-26T11:08:59.236+0000","up_votes":2,"down_votes":0,"body":"People like the OP never understand \"my house, my rules\" applies to all private entities. And yet, they never dislike Riot's rules enough to stop mashing the button to queue up for the next game.","replies":[]}]}]}]},{"poster":"rujitra","date":"2019-07-26T06:19:48.060+0000","up_votes":6,"down_votes":0,"body":"There are multiple problems with permitting people to shame other players with \"evidence\" by name:\n\n* For much of the types of \"evidence\", there is no way to verify authenticity - this includes screenshots, which can also be edited.\n* If players are allowed to shame, it discourages others from posting true opinions and having discussion.\n* There's really no valid discussion to be had that's useful in any way.","replies":[]},{"poster":"KFCeytron","date":"2019-07-26T05:49:52.204+0000","up_votes":4,"down_votes":0,"body":"The only chat messages included in your chat log are your own for a single, extremely good reason: they are the only ones taken into account for your punishment, because they're the only ones in your control. The things other players said and did in your match might produce in you an impulse to do certain things that may include breaking LoL's rules, but your behavior is your own, and you are responsible for it. If you really think about it, this is a good thing. If a toxic player's goading could exempt you from punishment for your flaming them, calling for reports, etc., then it would logically go the other way as well, resulting in punishments for players who didn't necessarily break any rules but weren't quite as friendly and positive as their teammates. Can you imagine a world where \"didn't participate in the dance party and ignored all of our jokes\" was a valid report that could get someone suspended for two weeks? We don't want that situation anymore than we want \"called our support a braindead waste of space\" to be considered an _invalid_ report just because, say, the support was telling their team to harm themselves while they merrily ran it down mid.","replies":[{"poster":"Aletheiacracy","date":"2019-07-26T05:55:42.967+0000","up_votes":1,"down_votes":15,"body":"You have a lot to learn about the art of influence. \nYour response is dictated in logic, the very structure of your sentence, the movement of your fingers as they tapped out the correct sequence of letters is simply because you are responding to what I said. \nHow much control do you think you really have?\n\nOrange rabbits in razor blade swim shorts? Biscuit half moon summer rockets?","replies":[{"poster":"usul1202","date":"2019-07-26T06:14:32.592+0000","up_votes":4,"down_votes":0,"body":"Are you serious with that? Like, do you think there's some magical text I can write here that would make you say hatespeech (beyond threats, which the IFS actually does consider before issuing a punishment)? People have control of what they type.","replies":[]},{"poster":"rujitra","date":"2019-07-26T19:50:11.155+0000","up_votes":2,"down_votes":0,"body":"Do you ever actually respond to discussion? Or do you simply make off topic posts and insult people, then when you don't like the response you delete it?","replies":[]}]}]},{"poster":"Ulanopo","date":"2019-07-27T01:09:26.305+0000","up_votes":3,"down_votes":1,"body":">Back to the solution. Maybe one already exists? Let's find a new platform to discuss the game where we can set the precedent.\n\nYes, that would be best. Here's the thing, you've already said the Boards community isn't for you, so finding somewhere else that gives you what you want would be appropriate.","replies":[]}]}