{"poster":"Rayitas","date":"2016-10-06T03:11:08.359+0000","title":"Insostenible la mentira del duoq y el MMR","subforum":"Problemas Técnicos","up_votes":8,"down_votes":4,"body":"Me podrian explicar esta mentira de emparejamiento por favor? &iquest;o restablecerme los PL?\nAntes de iniciar revise los MMR y en 2 o 3 de esos de mi equipo segun op.gg habian jugado mucho DduoQ y podia no ser exacto su MMR...\n\nDejo imagenes;\nhttp://oi65.tinypic.com/versxk.jpg\nhttp://oi67.tinypic.com/294lbnd.jpg\n\nBasicamente fedearon a cassiopeia, ninguna linea gano, no hicieron nada, y yo perdi mi linea por el adc que tenia, ademas de que no logre conectar los ganchos. Y despues ya era muy tarde, ya habian fedeado todas las lineas.\n\nComo pueden emparejar a un oro V con bronces? tengo el MMR correcto, no me merecia esto....\n\n_____________\nEdito; me acabo de dar cuenta que no era ranked, pero aun asi me parece insostenible, bronces y 1 oro vs platas y oros....","replies":[{"poster":"Quo","date":"2016-10-06T03:15:32.300+0000","up_votes":2,"down_votes":0,"body":"Lo gracioso es que en teoria en la cola dinamica un oro no puede rankear con un bronce, pero parece que esto no aplica para emparejamiento en solo xD","replies":[]},{"poster":"9081913DEL1","date":"2016-10-06T10:24:32.947+0000","up_votes":2,"down_votes":1,"body":"Me parece que si de arranque estas \"revisando a tu equipo\", el que te pones la soga al cuello sos vos.\nPrimero juga tu campeon y tu linea. Deja a los demas jugar sus lineas en paz. Si fedean o no en general no se debe a su liga, se debe a que el oponente es mejor, o que su jungla esta jugando de forma mas activa.\n\nPartidas se ganan y se pierden, no es culpa de nadie, asi son los juegos, que sean bronce ellos no te excusa de no pegar una q para que tu lucian pueda carrearte. \n\nEn gral hay miles de crypost, seria tan sencillo entender que debemos mejorar y que no esta afuera la culpa. El mmr esta bien, preferirias jugar contra maestro? me parece logico, b5-bronce que tanta diferencia pensas que hay entra bronce y platino en las? Eso no es culpa de riot, del mmr, de los emparejamientos, es tema de la comunidad que se manda a jugar sin practicar 2 segundos como hacer lo minimo.\n\n\nSaludos.","replies":[]},{"poster":"Asercaca","date":"2016-10-06T22:19:06.865+0000","up_votes":1,"down_votes":0,"body":"lloras por una normal, ni me imagino lo que debes ser jugando ranked xd{{sticker:zombie-brand-facepalm}}","replies":[]},{"poster":"Yoen","date":"2016-10-06T04:13:06.280+0000","up_votes":1,"down_votes":1,"body":"Lamentablemente en RANKED también pasa \n:(","replies":[]},{"poster":"zelaya19","date":"2016-10-06T04:00:29.150+0000","up_votes":1,"down_votes":1,"body":"Me hiciste acordar que tuve que supportear a un adc (jugando yo en forma de soloQ) que era oro 4 pero enfrente nos tocó un duo bot platino 3-4, le dieron una paliza épica a mi adc. \n\nEl pobre estaba impotente, mira que cuando les suele ir mal suelen flamear o echar culpas pero mi adc le ponía ganas y en medio de la partida pedía disculpas y se sentía muy triste por no dar la talla. Creo que los otros 3 eran premades y para balancear el matchmaking(Promedio oro2-3) pues toco esto.\n\nPor lo general nunca tuve problemas salvo una vez que me tocó un equipo de 5  jugando yo solo y me partieron la cara, rotaba a la bot y tenía el tp de Lissandra y, Lux y Zac siguiéndome.","replies":[]},{"poster":"Rìsotto Nero","date":"2016-10-06T03:14:52.225+0000","up_votes":3,"down_votes":4,"body":"crypost nr 973#","replies":[]},{"poster":"Texter Redrum","date":"2016-10-06T03:44:12.568+0000","up_votes":4,"down_votes":6,"body":"Sos un lloron que no sabe ni mandar una ranked, es una normal capo, calmate!","replies":[]}]}