{"poster":"Cerberus959","date":"2016-11-18T15:28:09.959+0000","title":"Szar a LOL mint az atom.","subforum":"Általános beszélgetés","up_votes":2,"down_votes":8,"body":"Kedves Riot és minden felhasználó.\r\nTegnap beléptem egy meccsre este és minden simán indult de amikor beléptünk a haverokkal a pályára mindenkinek beszart a játék.\r\nnem tudom mi lett vele mindenki kilépett meg vissza és azt hittük jó lesz de nem így lett mert semmit sem tudunk venni mivel nem jelétek meg a képességek se a bolt semmi csak a karakterek alap támadását tudtuk használni. Még egyszer kiléptünk és láss csodát helyre jött. Na de itt jelentkezett egy másik gond a szar FPS droppok. Nekem és haverjaimnak átlagosan 130-100 FPS szokott lenni attól függ éppen mennyien vagyunk egy adott helyen.De amikor ez a szám hirtelen 3 meg 5 ugrik utánna meg vissza fel és emiatt semmit sem tudok csinálni na ez már kiborító.Nem tudom még ki találkozott ilyen hibákkal de minden egyes update után egyre szarabb lesz ez a játék.Úgyhogy kedves Riot b+ meg a jó anyádat hogy egy ilyen szart mersz kiadni.Szégyen ez a játék már.","replies":[{"poster":"Nemin","date":"2018-05-12T07:51:33.999+0000","up_votes":1,"down_votes":0,"body":"Egy éves thread. **Lezártam.**","replies":[]},{"poster":"Cerberus959","date":"2016-11-18T19:52:36.601+0000","up_votes":1,"down_votes":2,"body":"***","replies":[{"poster":"Brăd","date":"2016-11-18T20:11:51.307+0000","up_votes":5,"down_votes":0,"body":"http://imgur.com/0uyDpOB?1","replies":[]}]},{"poster":"Mind The Gap","date":"2016-11-18T15:52:33.952+0000","up_votes":4,"down_votes":0,"body":"Hjajjaj, kémiából lesz mit tanulni. Az atom nem szar, és nem is tartalmaz szart:\nhttps://www.kullabs.com/uploads/55254826e4b0baeae3c80f3a-eabollich-1428509554189-atoms1.jpg","replies":[{"poster":"Imiking ","date":"2016-11-18T16:25:28.590+0000","up_votes":3,"down_votes":0,"body":"Tényleg, Elementalist Luxnak meg kéne mutatni a peridópusos rendszert :P","replies":[{"poster":"Mind The Gap","date":"2016-11-18T16:58:52.822+0000","up_votes":1,"down_votes":0,"body":"Dobna tőle egy hátast, az biztos! ;)","replies":[]}]},{"poster":"Shirodrake","date":"2016-11-18T18:52:36.180+0000","up_votes":1,"down_votes":0,"body":"De a szar  tartalmaz atomot.","replies":[{"poster":"Mind The Gap","date":"2016-11-18T19:07:23.576+0000","up_votes":1,"down_votes":0,"body":"Na az már más tészta!","replies":[]}]}]},{"poster":"Lerpkat","date":"2017-01-23T13:58:41.571+0000","up_votes":2,"down_votes":0,"body":"Megoldás egyszerű: Senki ne lolozzon oszt csá. Régen sem volt még internet se mégis mindenki jót szórakozott másutt ezt a szart meg le is törlöm a %%%%ba kinek hiányzik ez a szar.","replies":[]},{"poster":"Lerpkat","date":"2017-01-23T13:57:01.796+0000","up_votes":2,"down_votes":0,"body":"Nem, igaza van, egy használhatatlan nulla az egész játék, a community, meg az új client, meg alapból az egész játék nem ér semmit, a FPS szánalmasas rossz ahhoz képest hogy mekkora rendszerigénye kéne legyen egy ilyen egyszerű felülnézetes 3D fosnak, totál minimum grafon is lag spike, hol itt hol textúra hibák, stb, néha be se tudsz lépni miatta vagy tölt egy évig.\nA másik az hogy FPS drop van, ok hogy full minimumra állítom rankeden hogy azé persze van 100 FPS, vagy akármennyi, de akkoris érezni hogy ha valaki meghal vagy egy champion formot vált, valami komolyabb spellt elnyomnak, ledroppol az FPS, ez még ok is, de mikor 5 FPS ed van és besétálsz torony alá vagy véletlenül bemész TF ba és 2 mp ig ne tudsz semmit csinálni az nemhogy kellemetlen de tönkreteszi az egész játékot és a játékélményt is.\nMeg ott van az ÚJ client 2k17, NAH HAGGYÁMÁ? Olyan laggos mint a szar, LOWSPEC módban is szánalmas, egyik pillanatban még 10 secnél van a champion pick time, aztán belaggol és annyit látsz hogy kiléptél te meg még kattintani sem tudsz, komolyan ez mi? Meg amilyen lassan is tölt be az elején még egy komoly gépen is az is elképesztő. Hogy lehet ilyen szart gyártani? Én magam is programozom néha, meg tanulok ilyesmit de hogy lehet ILYEN SZART csinálni? Kérdezem a fejlesztőket??????????????????? Verik a %%%%ukat 24/7 be, dől a lé, néha direct beraknak valami troll bugot a játékba aztán ez meg az levan tiltva, persze kijavítják, megy a passió rendesen, de valami normális munkát kiadni a kezük közül nem tudnak, mi a %%%% van tán a célhardverre mentek? Lehet. Minek az hogy jól is fusson? MInek....simán 200 fps kéne legyen a legszánalmaabb gépen is ezzel a nulla rendszerigényű fossal, a client meg nem kéne laggoljon , de miért is laggol? Nagyon egyszerű. Mert lusták mint a %%%%om és képtelenek valami értelmeset gyártani azért, csak dőljön a lé, mindenki levan szarva, mert tudatt alatt mindenkit csak a pénz érdekel nem a felhasználhatóság vagy a érdemi haszon. EZÉRT IS EGY KALAP SZAR. Jah meg profin tudnak CG re programozni de annak az APInak a hazsnálatánál ki is merült a képességük, mert egy normálsi enginet nem tudnak írni ezek a férgek, meg normálsi dinamikus memóriaketelőt hogy ne legyen hiper lagg mikor egy játékbeli, textúra, hang, objektum betöltődik.\nJah és maga a színvonala az egésznek kezd leeseni, majdcsak kiégnek aztán seni nem játszik ezzel a szarral, úgyis jön jobb játék ki egyszer, aztán ez a fos is leég a %%%%ba. Vagy robbanjon föl a %%%%omba az egész játék szerver, égjen le, meg is érdemlik, biztos fognák a fejüket a RIOTNAL, hogy most k%%%%lal hordják e a vizet vagy megnyalja a konnektort bassza meg","replies":[{"poster":"csabaibalint00","date":"2018-05-12T07:50:12.204+0000","up_votes":1,"down_votes":0,"body":"Ez így igaz!","replies":[]}]},{"poster":"Temp65432","date":"2016-11-18T15:51:23.051+0000","up_votes":1,"down_votes":0,"body":"az atom nem szar.","replies":[{"poster":"VampVik","date":"2016-11-18T23:19:13.873+0000","up_votes":1,"down_votes":0,"body":"Igaz, de a szar is atomokból áll.","replies":[{"poster":"Temp65432","date":"2016-11-19T11:24:04.920+0000","up_votes":2,"down_votes":0,"body":"minden szar atom, de nem minden atom szar. Deep af.","replies":[]}]}]},{"poster":"Brăd","date":"2016-11-18T20:11:18.198+0000","up_votes":2,"down_votes":0,"body":"Ezennel megadom neked az \"E-Napi shitpost awardot\". Légy büszke! Ilyen keveseknek adatik meg többször egy életben.","replies":[]},{"poster":"Shirodrake","date":"2016-11-18T19:11:18.177+0000","up_votes":2,"down_votes":0,"body":"Ó Istenem! Szegény gyermek.  Áld meg őkelmét a ban jóságával.  Neveletlen pereg nyelve erre epekedve.","replies":[]},{"poster":"SquatEye","date":"2016-11-18T16:25:51.842+0000","up_votes":2,"down_votes":0,"body":"Érdekes, a patch az egy általános dolog, és van akinek semmi baja nincs a klienssel, vagy mondjuk max évente 1-2 alkalommal... hihetetlen, nem igaz? Persze, az is lehet h kivételesen mindenkinél beszart egyszerre valami rajtatok kívül álló ok miatt, de erre a következőket tudom mondani:\n\na) nem adtok infot a gépekről, nem keresitek meg a supportot, így aztán segíteni is rohadt problematikus\nb) kicsit ellentmondásos hogy szerinted valami sz*r (már meg sem merem jegyezni, hogy ingyen van), de azért játszol vele / dühöngsz miatta. Nem érdemes, hagyd abba, töröld le, haladj tovább. ","replies":[]},{"poster":"Cerberus959","date":"2016-11-18T18:03:13.059+0000","up_votes":2,"down_votes":4,"body":"királyak a válaszok ja várj még sem de ez a játék akkor is egy kalap szart sem ér és bekaphatja a RIOT.","replies":[{"poster":"Maximilition","date":"2016-11-19T17:23:17.980+0000","up_votes":3,"down_votes":0,"body":"A megoldás egyszerű: Ne LoL-ozz.","replies":[]},{"poster":"csabaibalint00","date":"2018-05-12T07:51:31.079+0000","up_votes":1,"down_votes":0,"body":"ja pont így","replies":[]}]},{"poster":"Imiking ","date":"2016-11-18T16:28:22.998+0000","up_votes":3,"down_votes":2,"body":"https://hu.wikipedia.org/wiki/Atom\nAz atom a filozófiában valaminek – például a térnek, az időnek, a folytonosságnak, vagy az anyagnak – a valamilyen szempontból való elemi, tovább már nem osztható egységeit jelenti (atomosz gör. „oszthatatlan”). A fizikában ezeket elemi részecskéknek nevezzük","replies":[]},{"poster":"Sylasi Elvtárs","date":"2016-11-18T16:18:28.109+0000","up_votes":1,"down_votes":0,"body":"Inkább a megnyilvánulásaidat kellene szégyellni. Elég megnézni a többi hozzászólásodat itt fórumon...","replies":[]}]}