{"poster":"Riot Ahab","date":"2015-06-05T20:54:27.896+0000","title":"NA Server Roadmap Update: South Bridge pt. 2 & ISP Peering","subforum":"[ARCHIVED] Help & Support","up_votes":17,"down_votes":2,"body":"*Edit: Thanks everyone for taking the time to read and sharing your questions! The NA Roadmap Team is signing off for the evening, but stay tuned in the future for more updates!*\n\n*TL;DR: As of this week, we&rsquo;ve installed all PoPs hardware to complete the South Bridge (with the exception ATL - more on that below), and we have an update on partnered ISPs you can find at the bottom of this post. Today, we pull back the curtain to tell you more about our  process for working through peering agreements&mdash;if you fancy a little walk through the exciting world of internet exchanges and peering protocols, read on!*\n\nHey, everyone! Riot Ahab here with another update on the [NA Server Roadmap](http://boards.na.leagueoflegends.com/en/c/help-support/WH8doH76-na-servers-and-the-future).\n\n[Last time](http://boards.na.leagueoflegends.com/en/c/help-support/hXxTbpiI-na-server-roadmap-south-bridge-update), we updated the progress made along the South Bridge, which included bringing the Ashburn and Atlanta PoPs online. Ashburn is humming along, but we ran into some workflow system issues which has delayed the ATL PoP from coming online. We&rsquo;re actively working through the issue and should see it come online soon.\n\nNow, progress on the South Bridge drives back west along the southern US to close the loop, bringing Dallas, Denver, and Los Angeles online as of this week.\n\nhttp://i.imgur.com/E0u3CZR.jpg\n\n**So now Phase 2 is done?**\n\nThis update completes almost all of the hardware installation of Phase 2 of the NA Server Roadmap&mdash;so in terms of hardware, yes, this phase is mostly complete! But building this direct network is like building a new computer: first you collect and assemble the hardware, but installing all the necessary programs takes additional time once it&rsquo;s up and running. \n\nBringing hardware online at key internet exchanges across NA is the *relatively* easy part. Next comes reaching out to local ISPs at those PoP sites and setting up contractual agreements to get your League traffic *off* the ISP&rsquo;s network and *on* to ours. \n\n**Yeah, yeah, Ahab &ldquo;it&rsquo;s an ongoing process&rdquo; - *you always say that.***\n\nFair enough. How about instead of talking in generalities about the &ldquo;partnering process,&rdquo; we instead walk through what goes into working with ISPs? *Note:* I&rsquo;ll be simplifying quite a bit of information to avoid getting lost in the weeds here, but feel free to follow up with questions should you want to dive into the nitty-gritty in the comments below!\n\n**Step One: IXs, ISPs and plotting the map.**\n\nWe start by keeping an eye on where League traffic travels and curating a list of which ISPs are carrying the most League data. This list can shift and change as new ISPs start up, old ones merge, territories of ISPs expand or contract, or as players switch their choice of ISP. Using this list, we plot out where the data travels and where the ISPs are located&mdash;and most, if not all, that data has to make stops through Internet Exchange Points (or IXs).\n\nIXs are key interconnection crossroads where ISPs can exchange data between their networks to make sure your information gets to wherever it needs to go. Using our ISP data, we identified the key IXs where we wanted a presence for the NA-dedicated network, then set up hardware in those areas (i.e., all the PoPs on our network map).\n\nhttp://i.imgur.com/E0u3CZR.jpg\n\nYou may notice there aren&rsquo;t any Canadian PoPs on the map. This doesn&rsquo;t mean Canadian players won&rsquo;t get in on the benefits of the network or we&rsquo;ve somehow forgotten you! Since Canadian traffic needs to cross the border to access the game servers, we focused on setting up PoP links on the most direct paths we can find to the IXs that service Canadian traffic. For western Canadian ISPs, that access point is in the Seattle IX. For central and eastern Canada, TOR-IX (Toronto) and QIX (Quebec) both connect back to Chicago through the same capacity used by high-frequency trading financial institutions.\n\n\n**Step Two: Setting up the PoP hardware and reaching out to ISPs.**\n\nThe hardware we set up at those key IXs are the PoPs (points of presence) we&rsquo;ve referred to throughout these North and South Bridge updates. They allow us to interface with the local internet exchanges, and route League traffic directly toward the game servers. But having the hardware near an IX isn&rsquo;t enough&mdash;we need to convince ISPs to agree to transfer League data over to our network via the PoPs!\n\nOnce our hardware is properly installed and connected to a local IX, we begin reaching out to ISPs who are on that particular exchange (that we identified back in step one).\n\n\n**Step Three: Setting up peering agreements.**\n\nThe vast majority of ISPs we reach out to (around 75%), route through &ldquo;public exchanges&rdquo; with open peering policies. Open peering means that all we need to do is contact the participating ISPs with a request to peer their League traffic through us instead. It&rsquo;s then a matter of configuring some software to automate that peering process and putting it into action. Overall, this process can take anywhere from 24 hours to 6 months, depending on how responsive a particular ISP is.\n\nSome ISPs operate private connections outside of public exchanges, which means they handle their data exchanges themselves. This gets a little more complicated, but only because we have to go where these ISPs are and install hardware to connect to their systems. Most ISPs are pretty open to this, and it&rsquo;s just a matter of housing the hardware and getting software in place to route that League traffic to our direct network. This approach represents anywhere from 5-10% of ISPs we peer with.\n\nThe remaining ISPs we peer with operate paid peering policies. Usually these ISPs take some time to set up agreements with because there&rsquo;s contractual back and forth once we&rsquo;ve made the initial introductions and both parties agree to the scope of the peering project. This type of peering agreement can take anywhere from 30 days to 8 months to put into action.\n\n\n**Step Four: Putting data into motion.**\n\nWith hardware and agreements in place, League data then flows from your local home network through your ISP&rsquo;s system to the nearest PoP, where it then enters our direct network and travels on the fastest possible route to the game servers.\n\nThat&rsquo;s the plan, anyway. As with any complex system, however, there can be hiccups and crossed wires. Users of WOW! Internet experienced just that a few months back when our peering agreement went online&mdash;an issue surfaced because the routing software was sending players&rsquo; League data through a nasty bottleneck. Players quickly notified both Riot and WOW! customer service, which helped us team up with WOW! to solve the problem quickly and get Leauge data flowing correctly again.\n\nA huge portion of ongoing work comes from bringing ISP agreements online then making sure data is routed properly. We may see a national ISP servicing multiple PoPs, so extra care is required to make sure they&rsquo;re correctly routing local data. For example, we may only strike up a single blanket agreement with Comcast, but we&rsquo;ll need to make sure the geography makes sense and traffic from Dallas isn&rsquo;t being routed through the New York City PoP.\n\n\n**Step Five: Continued tweaking, support, and optimization**\n\nAs the ISP and internet exchange landscape continues to shift and change, we&rsquo;ll continue to monitor and adjust the dedicated League network to make the most of your connection to League. While the last of the network hardware might be placed, it&rsquo;ll be an ongoing effort to optimize the flow of data with the partners we work with from across the telecom industry. \n\n\n**So&hellip; if Phase 2 is done, what happens next?**\n\nIn future updates, we&rsquo;ll continue to keep you informed of ISPs we add to our peering partner list. Aside from that, the next [NA Server Roadmap](http://boards.na.leagueoflegends.com/en/c/help-support/WH8doH76-na-servers-and-the-future) update will focus on Phase 3 of the plan: a centralized server move. In that post we plan to cover details of this centralized move with dates, locations, and expected impact. Stay tuned!\n\nQuestions? Comments? The NA Server Roadmap team will be hanging out in the thread for a few hours, so feel free to hit us up!\n\nWe&rsquo;ll wrap up this post with an update to the list of partnered  ISPs with finalized agreements! New additions since last update will appear in **bold**. Keep in mind that we&rsquo;re still in talks with lots of other ISPs, so if you don&rsquo;t see yours on this list, it doesn&rsquo;t mean we&rsquo;re not planning to peer with them&mdash;only that we haven&rsquo;t finalized an agreement yet! \n\nThanks for reading, and stay tuned in the weeks to come for more NA Server Roadmap updates!\n\n**3Z Canada**\n**Abovenet Communications**\n**Alaska Communications**\n**Altopia**\nAtlas Networks Corporation\nBell Canada *(correction - we featured this ISP in our last update, but we&rsquo;ve hit a snag and are currently working through logistics. More updates to follow!)*\nCenturyLink\nCharter Communications\nClear Wireless\n**CoastCom**\n**Cogeco Cable**\nCogent Communications\nComcast Cable Communications\nCox \nCTS Communications Corp\n**Electronic Box**\nEltopia\n**Fibrenoire Internet**\nFrontier Communications\nGoogle Fiber\nHurricane Electric\nInterconnected Associates\n**Level 3 Communications**\n**Lightspeed Communications**\nLS Networks\n**Molalla Communications Systems Inc.**\nNetRiver\n**Network for Education and Research in Oregon (NERO)**\nNTT America\n**Oricom Internet**\nPavlov Media\nPocketinet Communications\nRogers Cable Communications\nSaskatchewan Telecommunications (SaskTel)\nShaw Communications\n**Sonoma Interconnect**\n**Start Communications**\nSyringa Networks\nTDS Telecom\nTekSavvy Solutions\nTELUS Communications\nTeraGo Networks\nThreshold Communications\nTime Warner Cable\n**Vanoppen.biz**\nVerizon *(correction - we featured this ISP in our last update, but we&rsquo;ve hit a snag and are currently working through logistics. More updates to follow!)*\nVideotron Ltee\nVision Net\nWiscNet\n**WindWave Communications**\nWorldlink\nWOW! Internet\n\n_Thanks everyone for your questions! This thread's comments are being disabled and archived - please jump back [here](http://boards.na.leagueoflegends.com/en/c/help-support/WH8doH76-na-servers-and-the-future) to the main post and scroll to the bottom to find the most recent NA Server Roadmap update if you have any questions you'd like addressed!_","replies":[{"poster":"xFa","date":"2015-06-05T21:06:58.552+0000","up_votes":7,"down_votes":2,"body":"I think most people are anticipating Phase 3. Can you give us an ETA on the new server location? Will it be this year?","replies":[{"poster":"Riot Ahab","date":"2015-06-05T22:27:25.709+0000","up_votes":18,"down_votes":0,"body":"Yes -- Phase 3 (the centralized server move) will happen this year.\n\nThe next update you'll see from the NA Server Roadmap team will contain information and details around it.","replies":[{"poster":"pbN","date":"2015-08-13T02:24:14.880+0000","up_votes":1,"down_votes":0,"body":"Hi Ahab!\n\nI am worried about AT&T U-Verse. My ping, compared to other services in Dallas, is not optimal when connecting to Riot's servers in LA. With this move I expect my ping to be lowered greatly, BUT, I do not see it (AT&T U-verse) in the list. Any feedback regarding it?","replies":[]}]}]},{"poster":"1Rival","date":"2015-06-15T01:36:41.630+0000","up_votes":8,"down_votes":0,"body":"I just hope that Riot won't be partial to the West Coast players when determining the location of the centralized servers.  Where the West Coast have been spoiled with the 15-30 ping... and Riot feeling bad for suddenly make them have to deal with 65-80 ping from the centralized servers.  \n\nBut that also brings up another point...  \n\n_Hoping that Riot doesn't skew the centralized servers towards the West_ because **THEY THINK** \"East coast players will be happy with just any improvement from their 80-120 ping they have been getting for the past 5 years\"\n\n***The furthest East Coast state should have the SAME ping as the furthest West Coast state (Not counting Hawaii and Alaska, as they are outliers)***","replies":[{"poster":"Drunk Rummate","date":"2015-06-15T16:35:16.836+0000","up_votes":2,"down_votes":0,"body":"I think they're going to be more focused on finding a location that's fairly central but also inexpensive to maintain a high quality connection.  I doubt they'll think about east vs. west coast too much outside of keeping it fairly balanced without spending too much money.","replies":[]},{"poster":"D1G3R4T1","date":"2015-06-15T12:47:04.961+0000","up_votes":2,"down_votes":0,"body":"logged in to up vote this, as a player who lives in Florida, i feel complete centralization would be the most fair, or somehow manage an east coast and west coast server tied into and central server.","replies":[]}]},{"poster":"QuiteDwarff","date":"2015-06-05T23:41:45.821+0000","up_votes":8,"down_votes":1,"body":"What about suddenlink?","replies":[{"poster":"Alorand","date":"2015-06-06T01:25:30.045+0000","up_votes":4,"down_votes":0,"body":"Yeah would love an update on Suddenlink","replies":[{"poster":"Chanch","date":"2015-06-06T03:07:32.837+0000","up_votes":2,"down_votes":0,"body":"3rded","replies":[]}]}]},{"poster":"Sleeplessone","date":"2015-06-05T21:29:37.327+0000","up_votes":1,"down_votes":0,"body":"Tangentially related but what's the outlook on IPv6 being implemented?","replies":[{"poster":"Steeb","date":"2015-06-05T22:50:22.791+0000","up_votes":3,"down_votes":0,"body":"The completion of Phase 2 will not specifically address the issue with IPv6 and League Client.  The real issue is the platform that we use to build the PVP.net client (Adobe Air) doesn't like to work that well with IPv6.  We are currently working to find the best solution to address this problem so that we can be somewhat future proof.","replies":[{"poster":"PaperMache7","date":"2015-06-06T00:22:41.944+0000","up_votes":5,"down_votes":0,"body":"AKA not using adoble air.","replies":[{"poster":"K 2","date":"2015-06-06T01:10:30.138+0000","up_votes":1,"down_votes":0,"body":"there's no pulling the wool over your eyes! great work Watson!","replies":[{"poster":"PaperMache7","date":"2015-06-06T01:21:44.560+0000","up_votes":2,"down_votes":0,"body":"I'd rather you call me Sherlock, thank you very much.","replies":[]}]}]}]}]},{"poster":"DocSarge","date":"2015-06-05T22:10:15.316+0000","up_votes":4,"down_votes":1,"body":"Very interested to know the status of AT&T U-verse","replies":[{"poster":"WizardOTL","date":"2015-06-05T22:51:00.482+0000","up_votes":5,"down_votes":0,"body":"In talks with them now, should have things sealed up soon, and then we need to move to actual peering. Give us about 90 days.","replies":[]}]},{"poster":"gg git diff","date":"2015-06-05T21:34:32.034+0000","up_votes":6,"down_votes":1,"body":"Still notably missing from the ISP list is AT&T U-Verse. Any progress?","replies":[{"poster":"WizardOTL","date":"2015-06-05T23:07:08.336+0000","up_votes":3,"down_votes":0,"body":"In talks with them now, should have things sealed up soon, and then we need to move to actual peering. Give us about 90 days.","replies":[]}]},{"poster":"YiffMyHoleDaddy","date":"2015-06-05T21:32:34.212+0000","up_votes":6,"down_votes":1,"body":"Any plans on working with AT&T?","replies":[{"poster":"Riot Ahab","date":"2015-06-05T22:48:49.356+0000","up_votes":4,"down_votes":1,"body":"We're in contact with AT&T and are actively working out an agreement, but it may take some time before things are finalized and working the way we want them to be.","replies":[]}]},{"poster":"gubigubi","date":"2015-06-06T03:22:37.484+0000","up_votes":4,"down_votes":0,"body":"If I can get under 80 ping I will lose my metaphorical shit.","replies":[]},{"poster":"KvZoN","date":"2015-06-05T23:56:27.019+0000","up_votes":4,"down_votes":0,"body":"What about Bright House Networks?","replies":[{"poster":"WizardOTL","date":"2015-06-06T00:31:59.907+0000","up_votes":2,"down_votes":0,"body":"They have not replied to us. I think they are content being purchased by Charter. :(","replies":[{"poster":"Oll Korrect","date":"2015-06-06T04:21:11.111+0000","up_votes":2,"down_votes":0,"body":"They are being bought out. **Link** http://www.tampabay.com/news/business/corporate/charters-reported-10b-acquisition-could-be-bad-news-for-tampa-bays-bright/2223519","replies":[]},{"poster":"Mojobones","date":"2015-06-06T01:31:55.853+0000","up_votes":2,"down_votes":0,"body":"If they're bought by Charter would bright house customers gain the improvements since you guys already have an agreement with Charter?","replies":[]}]}]},{"poster":"The Gabbler ","date":"2015-06-05T23:56:24.229+0000","up_votes":4,"down_votes":0,"body":"Bright House? Also, I live in Florida so does this mean that I will ping from my house to GA? If so, that will be very exciting although I wished for Miami lol","replies":[]},{"poster":"Artravus","date":"2015-06-06T00:43:35.020+0000","up_votes":3,"down_votes":0,"body":"Have you guys talked to Suddenlink about working with them? It's one of the two main ISPs in West Virginia along with Frontier, who you've already partnered with.","replies":[]},{"poster":"Windup Orianna","date":"2015-06-06T00:21:35.956+0000","up_votes":3,"down_votes":0,"body":"I never get answered but here it goes.\n\nAny leads on communications with Suddenlink?\n\nAnd, I live in West Virginia and average about 90-115 ping. Would it be lowered with this?","replies":[{"poster":"Artravus","date":"2015-06-06T00:45:01.356+0000","up_votes":2,"down_votes":0,"body":"I'm in the same situation. Hopefully they will partner with Suddenlink but it seems like a Suddenlink thing to do to refuse them.\n\nEDIT: I'm usually getting 90-100 ping in Charleston, but when I'm in Athens at Concord University (they have Frontier) my ping is down to nearly 70.","replies":[]}]},{"poster":"BeechNutNYourEye","date":"2015-06-06T00:21:16.704+0000","up_votes":3,"down_votes":0,"body":"Are you guys in talks with Suddenlink?","replies":[]},{"poster":"KrazyAttack","date":"2015-06-06T00:14:28.683+0000","up_votes":3,"down_votes":0,"body":"Still no Suddenlink ISP listed is starting to get concerning, 8th largest ISP in USA.","replies":[]},{"poster":"VertexMuffin","date":"2015-06-05T23:59:47.744+0000","up_votes":3,"down_votes":0,"body":"Any plans with Bright House Networks?","replies":[]},{"poster":"The Stark Family","date":"2015-06-05T23:34:57.236+0000","up_votes":1,"down_votes":0,"body":"What about Windstream Internet?","replies":[{"poster":"WizardOTL","date":"2015-06-05T23:39:29.619+0000","up_votes":3,"down_votes":0,"body":"We are working with them, but they are moving fairly slow :(","replies":[{"poster":"ayNigerianPrince","date":"2015-06-06T20:08:27.924+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Riot WizardOTL,realm=NA,application-id=osqw6G4M,discussion-id=Ffh2dJXf,comment-id=00120000,timestamp=2015-06-05T23:39:29.619+0000)\n>\n> We are working with them, but they are moving fairly slow :(\n\nProbably about as slow as the Internet speeds they provide. Paying for 3mb getting less than 1. Fuck you windstream.","replies":[]}]}]},{"poster":"Niko1","date":"2015-06-06T02:17:21.531+0000","up_votes":2,"down_votes":0,"body":"Can you give a rough estimate on long ATT will take?","replies":[]},{"poster":"Swag McYoloScope","date":"2015-06-06T01:51:13.401+0000","up_votes":2,"down_votes":0,"body":"So New York is all done with? I'm still at the same ping I've always been. 100-120\n\nMy ISP is TWC","replies":[]},{"poster":"MiKeOxBig00","date":"2015-06-06T00:40:55.884+0000","up_votes":1,"down_votes":0,"body":"As you try to get agreements with the rest of your targeted ISPs, will the other part of the project continue? Or is this a sort of you can't start with step 3 until step 2 is 100% complete? Not saying that everyone should have to have Comcast to play LoL but it seems stupid for people that have \"Bob's Communication\" as their ISP because it costs $4 a month to set the whole program back right?","replies":[{"poster":"Riot Ahab","date":"2015-06-06T00:47:02.235+0000","up_votes":2,"down_votes":0,"body":"Nope, all phases in the NA Server Roadmap have been concurrent - as we've been building the network and hammering out agreements, we were scouting new game server locations, negotiating contracts, and working through prep-work to take Phase 3 online. Phase 2 will likely continue for the foreseeable future as continued tinkering, optimization is required.","replies":[]}]},{"poster":"Pìtou","date":"2015-06-06T00:04:25.781+0000","up_votes":2,"down_votes":0,"body":"Just wondering, If i live in texas, rather close to dallas actually, how far will this drop my ping, which is now around 80-90?","replies":[]},{"poster":"Belf","date":"2015-06-05T23:14:29.774+0000","up_votes":2,"down_votes":0,"body":"Cablevision?","replies":[{"poster":"WizardOTL","date":"2015-06-05T23:40:09.153+0000","up_votes":2,"down_votes":0,"body":"Maybe Monday. We have our connection up, just testing.","replies":[]}]},{"poster":"Invisible Frog","date":"2015-06-05T23:15:10.845+0000","up_votes":2,"down_votes":0,"body":"If you're on Comcast, you might have some buffer bloat issues. There is a test here for it: http://netalyzr.icsi.berkeley.edu/","replies":[]},{"poster":"nothingxs","date":"2015-06-05T21:21:56.794+0000","up_votes":2,"down_votes":0,"body":"Just to note -- if you guys have done something RECENTLY with Comcast in the South Florida region, the connection's actively gotten worse -- you may be experiencing the same bottleneck issues as WOW! and may want to peek into that. I can give more details, but ping has gotten significantly worse and I now experience packet loss and bad ping spikes. I do trust that Riot will get everything figured out in due time, though!\n\nTHIS IS ALL INCREDIBLY FASCINATING AND I WISH I WAS PART OF THIS PROJECT WTF. Y'all better document this so I can get my learn on, thanks in advance RITO.","replies":[{"poster":"McHaten","date":"2015-08-06T13:04:47.488+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=nothingxs,realm=NA,application-id=osqw6G4M,discussion-id=Ffh2dJXf,comment-id=0001,timestamp=2015-06-05T21:21:56.794+0000)\n>\n> Just to note -- if you guys have done something RECENTLY with Comcast in the South Florida region, the connection's actively gotten worse -- you may be experiencing the same bottleneck issues as WOW! and may want to peek into that. I can give more details, but ping has gotten significantly worse and I now experience packet loss and bad ping spikes. I do trust that Riot will get everything figured out in due time, though!\n> \n> THIS IS ALL INCREDIBLY FASCINATING AND I WISH I WAS PART OF THIS PROJECT WTF. Y'all better document this so I can get my learn on, thanks in advance RITO.\n\nYou do know the LAN (latin american north) server is in Florida right? you could be playing with 20 or less ping. You only have to change 4 letters in a file and the game has all English when on that server","replies":[{"poster":"nothingxs","date":"2015-08-17T22:23:02.810+0000","up_votes":1,"down_votes":0,"body":"I'm fully aware. It's actually in Miami. I know where the datacenter is. That doesn't mean all my friends play in LAN -- they all mostly play in NA.\n\nI have an account on both servers.","replies":[]}]}]},{"poster":"Xzous","date":"2015-06-06T10:20:02.016+0000","up_votes":2,"down_votes":1,"body":"What about brighthouse network?","replies":[]},{"poster":"zSomax","date":"2015-06-05T22:52:22.485+0000","up_votes":2,"down_votes":1,"body":"Any chance you guys will partner with networks in Mexico? I know there is the LAN server but I have many friends who don't live here and play on NA and I don't want to move to another server because I wouldn't be able to play with them.","replies":[]},{"poster":"Revity","date":"2015-08-20T23:14:18.444+0000","up_votes":1,"down_votes":0,"body":"Can you elaborate on the status of Peering with Time Warner Cable? We in Lincoln, NE are getting a minimal decrease with the move. (~105 to ~ 92).  I noticed that in the previous update it had \"Time Warner Cable (We've hit a snag and are currently working through logistics. More updates to follow!)\"  I'm curious if this has anything to do with the almost negligible decrease in ping?\n\nThanks!","replies":[]},{"poster":"TileFloor","date":"2015-06-05T23:26:05.091+0000","up_votes":1,"down_votes":0,"body":"I live near Denver - am I ever going to lose the 30-40 ping I gained last December?","replies":[]}]}