{"poster":"Riot Ahab","date":"2015-04-16T21:55:06.685+0000","title":"NA Server Roadmap: South Bridge update","subforum":"[ARCHIVED] Help & Support","up_votes":32,"down_votes":2,"body":"*EDIT: Thanks everyone! Stay tuned in the coming weeks for more updates from the NA Roadmap team!*\n\nHey everyone! Riot Ahab here with another update on the [NA Server Roadmap](http://boards.na.leagueoflegends.com/en/c/help-support/WH8doH76-na-servers-and-the-future). \n\n[Last time](http://boards.na.leagueoflegends.com/en/c/help-support/APgXgX6W-na-server-roadmap-update-addressing-the-qs-in-quality-connections), we chatted about what goes into creating a \"quality connection\"; and how factors beyond ping, such as routing paths and packet loss, can seriously impact the connection between your machine and the League game servers. We also recapped the multi-phase approach we're implementing here on the NA Server Roadmap team to address those factors.\n\nThis time, we want to give you an update on the progress we're making building out the South Bridge - a series of point of presence (PoP) hardware locations snaking across the southern US that will serve as \"on-ramps\" to our dedicated network.\n\nhttp://i.imgur.com/E0u3CZR.jpg\n\nHere's what we showed you last time, with the \"North Bridge\" serving the northern US & Canada largely complete. After some hardware shipping delays, we've now installed hardware in the first South Bridge PoPs. Earlier this week we pushed the Ashburn and Atlanta PoPs online, bringing a majority of the eastern seaboard onto the network. \n\n**So, what does this mean for me, Riot?**\n\nAs a general note, players in these regions likely won't feel much of a difference in their ping since it's an ongoing process to work with local ISP offices to route their League data to the closest PoP. Even then, we're seeing at best a 10% reduction in ping in the most positive cases.\n\nWhat players near these PoPs WILL experience is less packet loss and a more stable connection, since their data isn't hopping across every internet exchange between them and the game servers, instead now following a direct path along our dedicated network.\n\n**Ok, that sounds neat, what's the catch?**\n\nBringing a PoP online doesn't work perfectly for everyone at the get-go. It's the start of an ongoing process as we work with partnered ISPs to make sure they're efficiently handing off your data to our network. Lots of this is handled by algorithms, which can sometimes go a little wonky when we introduce new PoPs. \n\nIf you discover your connection actually gets markedly worse, don't panic! Inform both your ISP customer support as well as [support.riotgames.com](http://support.riotgames.com). Between the two of us, we should be able to figure out what's happening to your data and get things running smoothly.\n\nAs a helpful reminder, it's always a good idea to double check your own connection at home before investigating issues with your ISP. For some players, seemingly innocent things like router location or playing on wifi can have big ping implications. More [connection troubleshooting info](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues) can be found on the Riot support site.\n\n**How about the rest of the network?**\n\nWe're already at work setting up hardware in the remaining PoPs (Dallas, Denver, Los Angeles) along the South Bridge of the network. Dallas and Denver should be online within the next month and LA within about two, but we'll keep you posted if we hit any hiccups.\n\nThe other big news to report is an update to the list of partnered ISPs. What this means is these ISP partners are actively working with our team to funnel your League traffic to the closest PoP onramp to our direct network. Don&rsquo;t fret if you don&rsquo;t yet see your ISP on this list, as odds are we&rsquo;re already in active talks with them! At this point, **we&rsquo;ve now implemented, are working to implement, or are negotiating peering agreements with the 20 largest ISPs in NA.** \n\nWe've got the team (myself, Riot WizardOTL, ADillonMostDirty and RiotZwill) hanging around in this thread for the next couple hours, so let us know if you have any questions and we'll be happy to answer!\n\nPartnered ISPs (new additions in **bold**):\n\nAtlas Networks Corporation\n**Bell Canada**\nCenturyLink\nCharter Communications\nClear Wireless\nCogent Communications\nComcast Cable Communications\n**Cox**\nCTS Communications Corp\nEltopia\nFrontier Communications\nGoogle Fiber\nHurricane Electric\nInterconnected Associates\nLS Networks\nNetRiver\nNTT America\nPavlov Media\nPocketinet Communications\nRogers Cable Communications\nSaskatchewan Telecommunications (SaskTel)\nShaw Communications\nSyringa Networks\nTDS Telecom\nTekSavvy Solutions\nTELUS Communications\nTeraGo Networks\nThreshold Communications\nTime Warner Cable\n**Verizon**\nVideotron Ltee\nVision Net\nWiscNet\nWorldlink\nWOW!\n\n_Thanks everyone for your questions! This thread's comments are being disabled and archived - please jump back [here](http://boards.na.leagueoflegends.com/en/c/help-support/WH8doH76-na-servers-and-the-future) to the main post and scroll to the bottom to find the most recent NA Server Roadmap update if you have any questions you'd like addressed!_","replies":[{"poster":"brightawakening","date":"2015-04-17T01:27:04.018+0000","up_votes":12,"down_votes":0,"body":"AT&T U-Verse????","replies":[{"poster":"Riot Ahab","date":"2015-04-17T01:45:18.585+0000","up_votes":6,"down_votes":0,"body":"We haven't forgotten! Still working on getting all 20 of the biggest ISPs figured out, some just take a little longer.","replies":[{"poster":"zane yalgir","date":"2015-04-30T05:48:10.385+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Riot Ahab,realm=NA,application-id=osqw6G4M,discussion-id=hXxTbpiI,comment-id=000c0000,timestamp=2015-04-17T01:45:18.585+0000)\n>\n> We haven't forgotten! Still working on getting all 20 of the biggest ISPs figured out, some just take a little longer.\n\nyour saying i can finally leave bronze via solo carrying becuase my ping wont be 140 O_o\n\ni sill remember playing a 30 ping lee and the feeling of gg there is no way to win his reactions are so fast he clearly has a better connection \n30 ping > my 140 ping was no contest","replies":[{"poster":"Rikoo","date":"2015-07-05T11:54:01.055+0000","up_votes":1,"down_votes":0,"body":"Be glad it was 140, and not my daily 320 xD","replies":[]}]},{"poster":"Gillyhoo","date":"2015-04-17T07:01:10.985+0000","up_votes":2,"down_votes":0,"body":"Thanks for all your hard work. I look forward to playing at regular ping and not spiking over 2000. lmao! The wait will be worth it. \\(ouo)/","replies":[]},{"poster":"a truth untold","date":"2015-08-18T02:35:38.184+0000","up_votes":1,"down_votes":0,"body":"Can you guys also do the ISP CIK Telecom please, I've been getting lag spikes and MANY of my other friends are using the same isp. HELP RIOT","replies":[]}]}]},{"poster":"Daen","date":"2015-04-16T22:05:10.572+0000","up_votes":8,"down_votes":1,"body":"Thanks so much for these updates!","replies":[{"poster":"dArtagnan","date":"2015-04-16T22:16:41.080+0000","up_votes":10,"down_votes":0,"body":"We are just doing what we can to keep everyone informed.  But we appreciate your kind words! :D","replies":[]}]},{"poster":"tedthedestroyer","date":"2015-04-17T01:14:25.870+0000","up_votes":10,"down_votes":1,"body":"any news on ATT uverse?","replies":[]},{"poster":"Matthevv","date":"2015-04-17T10:11:19.955+0000","up_votes":1,"down_votes":7,"body":"Can we please stop calling this the \"NA\" server road map when it is clearly the \"USA\" server roadmap? I love how Riot is working hard at improving the connection for US players but don't give a crap about us Canadians. We are not even on the roadmap.","replies":[{"poster":"Electric Guitar","date":"2015-04-17T11:47:48.374+0000","up_votes":7,"down_votes":0,"body":"75% of canadians live within 100 miles of the US border which means you are about as close to the backbone as many states in the US.  Also, there are many canadian ISPs on that list.","replies":[{"poster":"Matthevv","date":"2015-04-17T12:15:19.471+0000","up_votes":1,"down_votes":6,"body":"> [{quoted}](name=TinyURL,realm=NA,application-id=osqw6G4M,discussion-id=hXxTbpiI,comment-id=00320000,timestamp=2015-04-17T11:47:48.374+0000)\n>\n> 75% of canadians live within 100 miles of the US border which means you are about as close to the backbone as many states in the US.  Also, there are many canadian ISPs on that list.\n\nFuck the Quebecois, amirite? Glad to see Riot cares about rural Americans but doesn't give a second thought to rural Canadians.","replies":[{"poster":"Electric Guitar","date":"2015-04-17T13:08:40.688+0000","up_votes":10,"down_votes":0,"body":"You are shifting the goalposts so you can maintain your anger right now.  That makes me think you only care about being angry and not actual conversation.","replies":[{"poster":"Karlyr","date":"2015-04-25T16:08:48.007+0000","up_votes":2,"down_votes":0,"body":"Without saying that being in Quebec, the deal with Bell Canada made my ping drop from 120 to 80.\n\nHe's just being a douche.","replies":[]}]}]}]}]},{"poster":"Watersmith","date":"2015-04-17T01:57:02.981+0000","up_votes":5,"down_votes":0,"body":"Brighthouse Networks is a pretty large ISP, are you guys working anything out with them?","replies":[]},{"poster":"EnderForHegemon","date":"2015-04-17T00:27:31.998+0000","up_votes":2,"down_votes":0,"body":"Just last week I was getting concerned and annoyed at the lack of follow up from the NA Roadmap guys. There hadn't been any change to the tentative timeline, but neither had we gotten any announcement letting us know that the timeline was being followed. This is another example of riot not letting its players down in terms of keeping the dialogue going, and holding themselves accountable. Glad to see this.","replies":[{"poster":"Thulack","date":"2015-04-17T01:08:23.128+0000","up_votes":2,"down_votes":0,"body":"There was a post on surrender@20 website like a month ago from Riot saying that the hardware was delayed from overseas due to natural disasters and it was going to be delayed some.","replies":[{"poster":"Riot Ahab","date":"2015-04-17T01:34:53.080+0000","up_votes":5,"down_votes":0,"body":"Yep, there was some shipping problems that delayed the rollout of this update (bringing the start of the South Bridge online). It's tough because we're aiming to keep to regular updates, but sometimes scheduling, contractual hiccups or typhoons keep us from having useful and informative news to share. Thanks for being patient and sticking with us!","replies":[]}]}]},{"poster":"Jingerbeardman","date":"2015-04-17T00:27:30.505+0000","up_votes":3,"down_votes":1,"body":"Hmmm this is all very interesting, I am excited to see improvements once the infrastructure is fully operational.\n\nI am not surprised that At&t is not on the list yet... They are major dweebs (one of my new favorite words) when it comes to their network.","replies":[{"poster":"Riot Ahab","date":"2015-04-17T01:32:38.633+0000","up_votes":4,"down_votes":0,"body":"Woah woah woah, \"dweebs\" is a pretty strong term here. ;)\n\nLots of ISPs (AT&T included) have been super helpful and open to conversations. Some just take longer than others to hammer out an agreement is all!","replies":[{"poster":"ICantNameMe","date":"2015-04-17T05:12:02.876+0000","up_votes":1,"down_votes":0,"body":"Any info on Cablevision? Last time i contacted them, they said they had no information about being contacted by Riot, and a post on the last thread said that Riot had contacted their peering group with no response. Has communication broken down somewhere?","replies":[{"poster":"WizardOTL","date":"2015-04-17T15:44:11.370+0000","up_votes":2,"down_votes":0,"body":"We have an agreement to peer with them in NYC. Just setting it up now.","replies":[]}]},{"poster":"ChimeiTekinaNasu","date":"2015-04-17T01:50:23.200+0000","up_votes":2,"down_votes":0,"body":"You also in negotiation with Suddenlink??\n\nAlso, a friend of mine with Time Warner, which I see on your list, has been getting random lags recently. Would that have anything to do with the PoPs, or just random moments of lag?? Cause he only gets it for a little while, then it just goes away later on.","replies":[]}]}]},{"poster":"disregardable","date":"2015-04-16T22:27:48.306+0000","up_votes":4,"down_votes":0,"body":"How long are we looking before we get another update on the new server location?","replies":[{"poster":"Riot Ahab","date":"2015-04-16T22:41:46.979+0000","up_votes":3,"down_votes":2,"body":"No date yet on when we'll reveal details around Phase 3 of the NA Server Roadmap (a centralized server move). A lot of it depends on finalizing agreements and making sure hardware is moving where it's supposed to.\n\nRest assured, when we're cleared and ready to share details we'll make sure everyone is well informed!","replies":[]}]},{"poster":"Dokusei","date":"2015-04-24T20:31:58.254+0000","up_votes":3,"down_votes":0,"body":"so out of all the other regions why is NA the only one that has to go through some long process of getting a giant bridge connection instead of just giving us a east coast server","replies":[]},{"poster":"ToValueOrToEulav","date":"2015-04-17T05:53:18.185+0000","up_votes":3,"down_votes":0,"body":"I Know it wouldnt be easy but why doesnt Riot just bring put up a server on the east coast..... They have the money and we all know...","replies":[]},{"poster":"The Horizon","date":"2015-04-17T02:41:29.387+0000","up_votes":3,"down_votes":0,"body":"Hey Zwill not much of a question just glad to see your working at Riot after what happened at Waystone Games best of luck man.","replies":[]},{"poster":"Tyrannoscoreus","date":"2015-04-17T02:30:06.058+0000","up_votes":1,"down_votes":0,"body":"Aww, the Time Warner Cable partnership is already done? My ping hasn't changed at all...","replies":[{"poster":"dArtagnan","date":"2015-04-17T02:34:42.074+0000","up_votes":3,"down_votes":1,"body":"Depending on your connection and your route, you may not see that much change to your ping at all.  However, with these 'highways', your connection should be much more stable and have less packet loss!","replies":[{"poster":"Riot Ahab","date":"2015-04-17T02:40:19.873+0000","up_votes":3,"down_votes":0,"body":"And to build on this point, simply because you see your ISP on the list and don't see an impact on your connection doesn't mean we're done. There's a lot of additional work to do once we sign the agreements that involves working with ISPs to help route local traffic to local PoPs. Otherwise your traffic could hop around inefficiently before hitting the stable network.","replies":[]}]}]},{"poster":"Vokra","date":"2015-04-17T01:37:25.775+0000","up_votes":3,"down_votes":0,"body":"I hate to be _that_ guy, but is there any news on the partnerships with the ISP's in the Niagara region? There are really weird ass ISP's here especially on the Canadian side. The one I'm with is called Cogeco communications.","replies":[]},{"poster":"Aerothal","date":"2015-05-08T21:00:43.680+0000","up_votes":2,"down_votes":0,"body":"i never had a problem with stability. what has been happening for me since season 3 is PING CREEP.\nI used to have 70 ping. Season four it went up to 130. now its back down to 105, but that's still huge.\nAnd i am not even on the east coast, i am in the mid-west.\nI heard a lot of high elo players reminisce about how they can play with \"high\" ping (60 was high for them) but they could not get off some combos they get off at 20-40 ping.\nI guess i will never know.\nIn any case, i wish you would work on lowering ping!\nEverything is getting better when it comes to technology. \nHow come your ping is increasing over the years?\nI do not understand!","replies":[]},{"poster":"Dazaruk","date":"2015-04-28T04:07:45.349+0000","up_votes":2,"down_votes":0,"body":"I'm hoping there's something going on with AT&T because my gameplay has become extremely unbearable. I'm getting 2-3 times the normal ping and getting the \"attempting to reconnect\" message way more often now.","replies":[]},{"poster":"xJvicexSZN","date":"2015-04-17T07:16:36.239+0000","up_votes":1,"down_votes":0,"body":"So no Optimum for New York? fuck me =/","replies":[{"poster":"WizardOTL","date":"2015-04-17T15:40:47.751+0000","up_votes":2,"down_votes":0,"body":"We actually have an agreement to Peer with Optimum! Just have to get it set up :)","replies":[]}]},{"poster":"thyAshes","date":"2015-04-17T02:29:30.426+0000","up_votes":3,"down_votes":1,"body":"You guys need to get in touch with Mediacom. They own basically a monopoly on a major part of the Eastern Shore of Maryland, Deleware, and Virginia. My ping on NA server is 150-60 average and 140 on a good day. It makes the game unplayable and I have no other ISP's in my area.","replies":[{"poster":"Penguin Eclipse","date":"2015-04-17T14:52:36.412+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=SYN Ashes,realm=NA,application-id=osqw6G4M,discussion-id=hXxTbpiI,comment-id=0015,timestamp=2015-04-17T02:29:30.426+0000)\n>\n> You guys need to get in touch with Mediacom. They own basically a monopoly on a major part of the Eastern Shore of Maryland, Deleware, and Virginia. My ping on NA server is 150-60 average and 140 on a good day. It makes the game unplayable and I have no other ISP's in my area.\n\nIt is highly unlikely Mediacom will want to peer with Riot. They are not known for making many direct connections. Although it shouldn't matter as long as Mediacom's upstream providers peer with Riot.","replies":[]}]},{"poster":"Robert Mugabee","date":"2015-04-17T14:30:45.871+0000","up_votes":2,"down_votes":0,"body":"Are you looking for contractual help with this to do the physical POP builds? I have a small collective of people who are avid League of Legends players and who have helped plan and rapidly deploy POPs around the world for some of the world's biggest technology players. If you are interested with help, please contact me!","replies":[]},{"poster":"Kankberry","date":"2015-04-17T11:16:50.035+0000","up_votes":2,"down_votes":0,"body":"So, I haven't seen much information about the true north of the US.... Alaska! And we aren't on that map.... Are there any plans for the far northerners?","replies":[]},{"poster":"atomicpunk","date":"2015-04-17T03:49:25.581+0000","up_votes":2,"down_votes":0,"body":"My ping has definitely gotten worse within the last few days. When it's \"stable\" it sits about 5ms higher than it was before. That I can handle. What I can't handle are the insane spikes reaching 1000+. The timing of this problem definitely seems to have coincided with these new POPs coming online.\n\nI'm using AT&T DSL (not U-verse, I think this is only ADSL). Location is Gainesville, FL. I have friends I play with from the same area that have experienced similar problems. \n\nI submitted a message to Riot support that included network logs and such. Hope it helps...","replies":[]},{"poster":"ninjabubbles3","date":"2015-04-17T03:18:12.255+0000","up_votes":2,"down_votes":0,"body":"Why is there an LA one coming? Isn't there already a Riot server in LA. I live there and seem to get around 45-60 ping. However packet loss is a problem occasionally. Hopefully this will fix it","replies":[{"poster":"dArtagnan","date":"2015-04-17T03:23:49.613+0000","up_votes":3,"down_votes":1,"body":"We are preparing the eventual Phase 3, where the servers will be moved to a more centralized location.  Once that happens, we will want to make sure that the LA area has a PoP as well that will connect them as efficiently as possible to the new server home! And of course, we want to have as stable connections as possible until then!","replies":[]}]},{"poster":"Threeric","date":"2015-04-17T01:26:39.582+0000","up_votes":1,"down_votes":0,"body":"Awesome. When I started playing in Season 3 my ping was ~70 (in KS). Now it hovers around 100-110. Since you are now working with Cox, the ISP I have, do you think you will be expecting lowered ping in my area?","replies":[{"poster":"WizardOTL","date":"2015-04-17T02:36:52.576+0000","up_votes":2,"down_votes":0,"body":"We don't have out COX connections up yet, still waiting on Fiber to be run. As soon as we have the connections up, we believe we should be able to help.","replies":[]}]},{"poster":"Monstrous Yi","date":"2015-04-17T01:53:59.681+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Riot Ahab","date":"2015-04-17T02:13:03.158+0000","up_votes":2,"down_votes":0,"body":"Not necessarily. \n\nThe work the NA Roadmap team is doing with NA ISPs wouldn't impact your local traffic (where a lot of packet loss and inefficient pathing hops happen), but once your traffic crosses the Atlantic and gets to NA, you'd be on this dedicated network outlined above. Which would make that travel back and forth more efficient, but likely wouldn't make your connection markedly faster (but possibly more stable).","replies":[]}]},{"poster":"FatedTitan","date":"2015-04-17T01:34:44.337+0000","up_votes":2,"down_votes":0,"body":"Sadly, the past two days have had more DC and packet loss than normal.  I'm on Cox out of New Orleans.","replies":[]},{"poster":"Xangup","date":"2015-04-17T01:22:30.122+0000","up_votes":2,"down_votes":0,"body":"Any update on getting in contact with RCN ISP?\n\nhttp://www.rcn.com/about-rcn\n\nServes quite a few cities and areas in the East/North East","replies":[]},{"poster":"Amocoru","date":"2015-04-17T01:17:21.248+0000","up_votes":2,"down_votes":0,"body":"Really appreciate the update, but until it means our individual clicks are as responsive for the rest of us as they are to the West Coast, this is sort of just a pipe dream. I appreciate that my ping has gotten more stable since the updates started, but it still feels MUCH better to just play on LAN as an East Coast resident.","replies":[]}]}