{"poster":"Mephistophela92","date":"2015-05-19T18:01:30.609+0000","title":"Suche Ranked Team!","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hey!\r\n\r\nIch, weiblich, 23, suche nach einem lockeren Ranked Team. Ich spiele bevorzugt ADC, Supp und Mid gehen aber auch ganz gut.\r\nBin zur Zeit dank kleiner Pechstr&auml;hne wieder Silber 5, strebe aber diese Season Gold an, da sollte das Team dann bestenfalls auch landen :)\r\nWenn ihr also Interesse habt, Silber oder Gold seid und gerne aktiv spielen wollt, meldet euch.\r\nSkype und auch TS vorhanden, allerdings kein Server.\r\n\r\nMeldet euch doch am Besten vorher hier, da ich oftmals von Bots geadded werde und daher nicht mehr einfach ingame annehme.\r\nUnd bitte keine Anfragen von kostenpflichtigen Clans oder dergleichen. :)\r\n\r\n\r\nLG, Mephistophela92","replies":[{"poster":"InsaneRyusei","date":"2015-05-23T16:45:24.711+0000","up_votes":2,"down_votes":0,"body":"Hi!\n\nIch bin ebenfalls weiblich und habe ein ranked team. Einer von uns ( support) nimmt sich eine unbestimmte Auszeit, deshalb ist das momentan total schade, da wir nur immer mit externen Leuten spielen können. Deshalb würden wir uns wünschen, jetzt endlich mal wieder eine feste Person ins Boot zu nehmen. \n\nWenn du lust hast, dann melde dich ;)\n\nLG, insaneryusei","replies":[{"poster":"Mephistophela92","date":"2015-05-23T18:09:58.598+0000","up_votes":1,"down_votes":0,"body":"Hey!\n\nAn sich gern, nur was ist, wenn diese Person wieder kommt? Wäre schade, dann quasi wieder aus dem Team geworfen zu werden :D Wo spielt ihr denn? :)\n\n\nLG, mephistophela92","replies":[{"poster":"InsaneRyusei","date":"2015-05-30T19:37:13.010+0000","up_votes":1,"down_votes":0,"body":"Ich will sowieso in mehreren ranked teams spielen. Bin so gut wie jeden Tag on und es kommt momentan einfach viel zu wenig zusammen mit den leuten...Wir haben gerade mal die 5 promospiele und mussten ständig mit unterschiedlichen Leuten spielen, deswegen war das auch nichts. Das muss jetzt anders werden;)","replies":[{"poster":"Mephistophela92","date":"2015-06-01T20:26:43.432+0000","up_votes":1,"down_votes":0,"body":"Ah :) Ja, ich bin zur Zeit leider krank, daher nicht online.. Aber in ein paar Tagen sollte es gehen :)","replies":[]}]}]}]}]}