{"poster":"Judge Drakoo","date":"2017-09-21T10:35:18.859+0000","title":"Panoramica sui percorsi delle Rune","subforum":"Campioni e gameplay","up_votes":13,"down_votes":1,"body":"Le rune arriveranno sul PBE la prossima settimana. Sarà un ciclo molto più lungo, e volevamo fare un sommario generale prima del loro arrivo, in modo da darvi un'idea più accurata di quel che sta per succedere. Pubblicheremo presto un secondo articolo in cui parleremo del futuro nello sviluppo delle rune e di cosa si possono aspettare i giocatori al lancio nel PBE, così come in futuro. Per ora, rune!\r\n \r\n-----\r\n\r\nEhilà! Oggi parleremo dei percorsi nel nuovo sistema di rune in arrivo durante questa pre-stagione. Questi sono i nostri tentativi di spezzare il sistema di rune in gruppi tematici più grandi e differenziati. La precedente versione di rune e maestrie aveva delle categorie che erano quasi esclusivamente funzionali. I glifi e i sigilli avevano finito con l'essere gruppi alquanto arbitrari, e le tre categorie di maestrie dovevano andare a supplire a troppi bisogni in contemporanea. Vorremmo che i percorsi abbiano dei punti di forza molto chiari e un forte gameplay, ma che allo stesso tempo siano complementari a tematiche fantasy eccitanti. \r\n\r\nPerciò, da cosa sono fatti gli elementi funzionali di un percorso? In primo luogo, ci aspettiamo che la maggior parte dei giocatori scelga un percorso basato sulla runa chiave che vuole usare. A quel punto si selezionano tre rune non chiave da quel percorso. Si riceve anche un lieve bonus alle statistiche, che usiamo per bilanciare i percorsi fra loro e per differenziare ulteriormente i campioni che scelgono quello specifico percorso. Come abbiamo detto in passato, dovreste anche essere in grado di scegliere un percorso secondario con due sole rune, per arricchire la vostra possibilità di personalizzazione.\r\n\r\nMa quali saranno i percorsi effettivi, una volta arrivate le rune? Ne parleremo fra un attimo...\r\n\r\n**Nota a margine: Cos'è successo alle rune maggiori?**\r\nAbbiamo parlato coi giocatori del concetto di rune \"maggiori\" e fatto dei test interni sui cambiamenti. Quando c'è stata della tensione sulle scelte da fare e sull'interfaccia, è diventato chiaro che la distinzione aveva un costo elevato ma che dava benefici solo minimi al gameplay. Non abbiamo modificato le rune in sé, ma abbiamo rimosso il concetto di \"maggiori\" dall'esperienza di selezione. All'arrivo delle rune, ci saranno solo rune chiave e rune standard.   \r\n\r\n**Avvertimento di lavori in corso:** i nomi dei percorsi e i dettagli sulle loro tematiche e funzioni stanno ancora venendo sviluppati e abbiamo ancora dei problemi da risolvere. Per esempio, sappiamo che alcuni dei nomi danno l'impressione di escludere alcuni dei loro campioni principali, e di non essere coerenti con la loro tematica (sì, stiamo parlando di te, \"Stregoneria\"). Ci occuperemo di ciò più avanti nel processo, ma volevamo comunque parlarne con tutti voi e avere delle opinioni in merito.\r\n\r\n**I percorsi che stiamo attualmente sviluppando sono i seguenti:**\r\n\r\n* **Stregoneria**\r\n * Tematica: imbriglia la magia selvaggia per potenziare le tue abilità e scoprire una riserva illimitata di energia.\r\n * Funzione: potenzia il lancio di magie e il potere magico, e aiuta a usufruire di qualche lancio di abilità in più.\r\n * Esempi: runa chiave Meteorite\r\n\r\n\r\n* **Risolutezza**\r\n * Tematica: diventa un colosso che controlla l'avanguardia della battaglia. \r\n * Funzione: resistenza concentrata, assieme a modi per sfruttare quella resistenza con altre forme di potere.\r\n * Esempi: runa chiave TRR\r\n\r\n\r\n* **Precisione**\r\n * Tematica: surclassa i tuoi avversari con incredibili raffiche e abili colpi. \r\n * Funzione: potenziamento degli auto-attacchi e potenziamento agli schemi di danno consistente.\r\n * Esempi: runa chiave Berserk\r\n\r\n\r\n* **Dominazione**\r\n * Tematica: caccia le tue prede e festeggia nella gloria dell'uccisione.\r\n * Funzione: traccia, insegui e finisci i tuoi bersagli, con mobilità e danni a raffica.\r\n * Esempi: runa chiave Luna di Sangue\r\n\r\n\r\n* **Ispirazione**\r\n * *Diverso dagli altri - Ispirazione è un percorso che si concentra sul dare opzioni uniche che si rifanno alle preferenze del giocatore, non alle funzionalità di classe.*\r\n * Tematica: infrangi le regole per battere i tuoi nemici in astuzia. \r\n * Funzione: piega le regole del gioco a tuo vantaggio per sfruttare al meglio le nuove opzioni, le strategie, o la conoscenza del gioco. \r\n * Esempi: Teletrasporto canalizzato, Ogni cosa a suo tempo e Credito.\r\n\r\n\r\nQuindi, ecco a voi i percorsi! Quali combinazioni non vedete l'ora di provare?","replies":[{"poster":"UltraLion","date":"2017-09-24T07:10:06.379+0000","up_votes":1,"down_votes":0,"body":"Io leggendo questi rami, ancora prima di vedere tutte le caratteristiche so già che i tiratori sceglieranno precisione, i tank risolutezza e blabla\nLe nuove rune non servivano per far si che si differenziassero le scelte? A me sembra che le scelte saranno ancora più uguali rispetto a prima, fra rune e maestrie c'era sempre qualcosa che cambiava, ora c'è il ramo quasi obbligato a seconda del ruolo, o forse mi sfugge qualcosa che non è menzionata qua","replies":[]},{"poster":"Helenaaa","date":"2017-09-22T14:39:44.194+0000","up_votes":1,"down_votes":1,"body":"Ma le rune e le maestrie saranno già tutte disponibili dal livello 1 di un account, oppure  ci saranno a disposizione già set di rune predefiniti e dovrai sbloccarle man mano che sali di livello?","replies":[]},{"poster":"Trumpnivia","date":"2017-09-22T13:54:31.313+0000","up_votes":1,"down_votes":1,"body":"Aspettate un'attimo, io uso la maestria del razziatore della tempesta su Anivia in quanto shottare e uscire dai fight velocemente è una cosa fortissima, ora dopo questo sistema come potrei fare? ricordatevi che anche Vladimir che è un AP lo utilizza, a volte anche Annie","replies":[]},{"poster":"Dainsleif09","date":"2017-09-21T11:59:51.833+0000","up_votes":1,"down_votes":1,"body":"\"piega le regole del gioco\",questa frase mi fa presumere già 2 cose:\n1. potrebbe essere il più broken dei 4\n2.potrebbe essere il primo a venire nerfato\n\nper adesso,non vedo l'ora di sbizzarirmi con le possibili combinazioni^^","replies":[]}]}