{"poster":"Moostauche","date":"2017-02-12T11:32:27.109+0000","title":"Your Account is in the process of transferring","subforum":"[ARCHIVED] Help & Support","embed":{"description":"Imgur: The most awesome images on the Internet.","url":"http://imgur.com/a/Da9Cq","image":"http://i.imgur.com/aTSsIWK.jpg?fb"},"up_votes":1,"down_votes":0,"body":"Hi All,\n\nI was wondering if anyone encountered the same problem. I haven't been playing League of Legends for months, my last game was in July 2016. Two days ago I decided to re-download the game and start playing again but for some reason I'm unable to log into my account and it's very weird. \n\nIn a nutshell, my level 30 account is gone with all the progress and skins. I'm actually unable to log-in with my credentials onto EU WEST server where my account SHOULD be. Instead, my credentials work with the EU NE server where I was able to log-in and had to give myself a new summoner name and was awarded a level 5 account - not April first yet guys, cmon ( **:)** ). Changing my email/password etc. did not help. \n\nI've attached a screen with error I get when trying to log in EU WEST.\n\n@RIOTers\nI have logged a ticket 2 days ago and still no response. Since I reside in Ireland, I understand that Head Office is closed in Dublin over the weekend but surely you guys have an international support team that looks into these tickets? \n\nBest Regards,\n\nMoostauche","replies":[{"poster":"Targons Blade","date":"2017-02-13T03:31:00.076+0000","up_votes":1,"down_votes":0,"body":"Our support agents answer tickets on a first-come-first-served basis. I took a look at your account and it seems you've already received a reply today. If you run into issues with waiting an unreasonable amount of time for a reply, let me know.","replies":[{"poster":"weekdy","date":"2017-05-30T01:23:20.976+0000","up_votes":1,"down_votes":0,"body":"Im having the exact same issue","replies":[]}]},{"poster":"Kyubey Kills","date":"2017-04-30T19:51:55.499+0000","up_votes":1,"down_votes":0,"body":"i'm having the same issue has it been resolved for anyone?","replies":[]}]}