{"poster":"Udul","date":"2019-02-17T01:23:46.262+0000","title":"L'unico vero problema del gioco","subforum":"Discussioni generali","up_votes":2,"down_votes":0,"body":"Gioco a lol da tanti anni,ci ho dedicato molto tempo,e nonostante il gioco mi piaccia molto continuo a riscontrare un unico vero problema che allontana le persone dal gioco.\r\nTutte le persone che rovinano volontariamente il gioco agli altri,senza una motivazione,e che non vengono mai puniti.\r\nSe reporti qualcuno perch&egrave; ha flammato,trollato,insultato o in qualche modo infastidito altri giocatori presenti in partita (cosa che succede a livelli minori un game ogni due,e a livelli pesanti almeno una volta a settimana,persone che giocano attivamente contro il team) ricevi un notifica di punizione (anche minima,non ha importanza,basterebbe a far capire che il loro comportamento non &egrave; ben accetto) meno di... dieci volte l&#039;anno? Esagerando? \r\nPurtroppo sono una persona che non sopporta le ingiustizie,anche nella vita comune mi ritrovo a contrastare chiunque ne faccia e il vero fastidio &egrave; che sul gioco mi ritrovo impotente,senza un vero modo di poter migliorare il sistema in qualche modo.\r\nLa domanda adesso &egrave;... perch&egrave; la riot non agisce in modo da migliorare la propria community,risaputa per essere tossica,cosa che ha allontanato tantissimi giocatori?\r\nnon riesco a credere che in tutti questi anni quei (pochi) tentativi di migliorare il sistema siano andati completamente a vuoto. Ditemi,cosa non riesco a notare?\r\ngrazie in anticipo delle eventuali risposte","replies":[{"poster":"Power Mac","date":"2019-02-17T08:19:28.050+0000","up_votes":3,"down_votes":0,"body":"L'equivoco è a monte. Non esiste un nesso necessario tra quella che tu chiami notifica di punizione e il fatto che un utente sia stato punito: quell'avviso compare solo in casi eccezionali, in genere quando il tuo report è stato determinante, o l'ultimo di una lunga serie, od ancora ha avuto efficacia immediata per le regole dei bot; potrebbero esistere altri casi in cui ciò avviene, ma sono pur sempre eccezioni alla regola. \nPer farti un esempio pratico, mi è capitato di reportare un utente tossico mal sopportato dal team in cui ero premade e in chat vocale. Dopo il mio report, a fine partita, si è disconnesso perché era stato bannato immediatamente: mi è arrivata una notifica contestualmente? No.\nIl sistema funziona, salvo rari casi: semplicemente, ti sembra che funzioni male perché ci sono troppi flamer (e non pochi si \"salvano\" smettendo di usare la chat o stando quieti per un certo periodo), e non finiranno mai. È come quando viene arrestato uno spacciatore: mezzo minuto dopo qualcuno gli subentra e si ricomincia daccapo.","replies":[{"poster":"SweetKhaZix","date":"2019-02-18T22:18:48.047+0000","up_votes":1,"down_votes":0,"body":"I casi in cui il sistema non funziona non sono cosí rari, in tutti gli altri giochi ci sono comunity 10 volte migliori di quella di LoL, non ci vuole molto, basta che prendano spunto da una buona gestione deli ban piú che della comunity, allo stato attuale non vale neanche la pena giocare.","replies":[{"poster":"Power Mac","date":"2019-02-19T14:27:05.717+0000","up_votes":1,"down_votes":0,"body":"Su questo non so esprimermi perché gioco solo a LoL. Posso solo dire che quei pochi che conosco che giocano sia a LoL che ad altri giochi online (perlopiù MMORPG), mi hanno sempre detto che la community di LoL è messa male, ma negli altri giochi è assai peggiore, soprattutto perché il sistema di ban non è altrettanto efficiente. Sinceramente, al di là del continuare a perfezione i bot, non riesco a concepire un solo metodo per rendere ancora più severo il sistema di ban di LoL, a meno di renderlo totalmente sproporzionato ed ingiusto.","replies":[]}]}]},{"poster":"Clearωay","date":"2019-02-17T11:33:19.596+0000","up_votes":1,"down_votes":1,"body":"Ha detto tutto Power Mac, usa il comando /mute all e sei apposto. ","replies":[]},{"poster":"Elizabeth Lyones","date":"2019-02-17T09:59:17.703+0000","up_votes":1,"down_votes":1,"body":"Già... {{sticker:slayer-jinx-unamused}} \nSono d'accordo con te, non so cosa si potrebbe fare per migliorare la community e non lo sanno neanche i rioter {{sticker:sg-janna}}","replies":[]}]}