{"poster":"DontLetMeJungle","date":"2016-06-05T10:25:40.503+0000","title":"Riot Bewertungssystem ( D - S)","subforum":"Champions & Gameplay","embed":{"description":"Every game is a story; visit the new League of Legends match history to check out how this one ends and share your own!","url":"http://matchhistory.euw.leagueoflegends.com/en/#match-details/EUW1/2697556919/29796827","image":"https://cdn.leagueoflegends.com/match-history/opengraph_icon.jpg"},"up_votes":1,"down_votes":0,"body":"Versuche zu verstehen warum Ori S + und Fiora S bekommt, Ich mit Heca aber nur A  :D\r\nErkl&auml;rungen?","replies":[{"poster":"HyperionCH","date":"2016-06-07T07:18:46.396+0000","up_votes":3,"down_votes":0,"body":"Du vergleichst die Leistung mit deinen Mates und dies ist falsch.\n\nDie Benotung erfolgt im Vergleich mit anderen Heca (in gleicher Rolle und Elo) undda waren zu viele besser als du.","replies":[]},{"poster":"GoW Linc","date":"2016-06-05T10:43:50.873+0000","up_votes":2,"down_votes":0,"body":"du warst nicht gut genug","replies":[{"poster":"DontLetMeJungle","date":"2016-06-05T11:44:56.569+0000","up_votes":1,"down_votes":3,"body":"und das von einem Silber 1 Spieler ... das tut doppelt weh ..","replies":[{"poster":"GoW Linc","date":"2016-06-05T13:27:47.358+0000","up_votes":1,"down_votes":0,"body":"ist so: in silber ist es halt einfacher besser als der durchschnitt zu spielen :D. die anderen hecas in deiner elo haben durchschnittlich wohl ein paar sachen besser gemacht als du.\nIch müsse wahrscheinlich nichtmal halbsogut spielen wie du um ein s mit heca zu bekommen ;D","replies":[]}]}]},{"poster":"OrangeBubble","date":"2016-06-05T11:02:55.393+0000","up_votes":1,"down_votes":0,"body":"Zum Einen geht es um den Durchschnitt.\nZum anderen hat Fiora mehr DMG gemacht, mehr Ward gesetzt usw. Dann kommen noch Tower/Inhibitoren dazu in der Wertung.","replies":[{"poster":"Thresh Can V1 ","date":"2016-06-07T07:08:37.949+0000","up_votes":1,"down_votes":1,"body":"Hast du M7? scheint nicht so, das system nimmt einen durchsnitt, wenn in deinem Team die 2 S spieler schlechter wären, dann hättest du S bekommen, es wird immer eine messlatte gelegt und an dieser wird dann bewertet. Sprich, hast du nur feeder im team, aber du gehst richtig ab und ihr gewinnt, bekommst du locker S hast du aber noch einen Spieler im team der mega abgeht, dann fällst du je nach dem schlechter aus. Wards haben nix damit zu tun. Es geht um die Spezifischen Klasseneigenschaften, DMG, Tank, heal etc... nur Stats die auch in der tabelle zu sehen sind. Und was ganz wichtig ist, nicht sterben im Mid und Late game, da das system die Todzeit berechnet und du anfangs nicht lange tod bist. Es geht um alles, tower und inhibs sind egal, wichtig ist überall assists zu haben, ÜBERALL, dann kommt es auf kills nicht mehr an (wenn du sup oder tank spielst)","replies":[{"poster":"Good Guy Putin","date":"2016-09-09T11:38:33.286+0000","up_votes":1,"down_votes":0,"body":"Das stimmt so nicht. Deine Leistung wird mit anderen Spielern mit dem selben Champ auf der selben Position verglichen. Das ist Fakt \nIch hatte auch schon Games wo 6 Leute ein S+- hatten. Das würde mit deiner Erklärung aber gar nicht hinkommen.","replies":[]},{"poster":"OrangeBubble","date":"2016-06-07T14:28:30.975+0000","up_votes":1,"down_votes":0,"body":"Dein Kommentar kann nicht ganz hinhauen, dann hätte mein Freund mit seiner Zyra nicht in fast jeden Spiel ein S als Support, obwohl er nicht wie du sagst, an fast jedem Kill eine Beteiligung hat. Just saying.\nAußerdem hatte er ein S+ obwohl er 10 Tode hatte, weil eben alles andere (Objectsbeteilung, Killbeteiligung, Dmg an Champions, Wardanzahl).\nUnd Riot selber sagte, es geht nicht nur um Stats, also.\n\n/edit: Keine Ahnung, was du mit deinem M7 willst.","replies":[{"poster":"Thresh Can V1 ","date":"2016-06-08T10:07:32.419+0000","up_votes":1,"down_votes":3,"body":"ggwp Report!","replies":[]}]}]}]},{"poster":"Shiggyvara","date":"2016-09-09T10:51:59.268+0000","up_votes":1,"down_votes":0,"body":"http://matchhistory.euw.leagueoflegends.com/de/#match-details/EUW1/2834385466/201195003?tab=overview\n\nAls Sup 22 Minuten gegnerischer Surrender (Endergebnis 22:7)\nMeine Stats 2/0/6; 18 Wards gestellt 4 oder 5 gecleart \nErgebnis B+\n\nDas Einzige, womit ich mir das miese Ergebnis erklären kann ist, dass ich nur an 8 Kills beteiligt war, während es bei 2 anderen 9 und bei Einem 10 Kills Beteiligungen waren.\n\nDennoch so richtig versteh ich es net.","replies":[]}]}