{"poster":"Saykan","date":"2015-04-04T10:44:40.960+0000","title":"Para cuando Rito para cuandoooo!?!?! *bored* *sadwalk*","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"Ya hacia tiempo que el _**Creador de equipos**_ se dec&iacute;a estar en todos los modos y que paso?\n  ya paso medio a&ntilde;o o mas o menos ni idea bien y aun asi sigue como un modo aparte que no se puede jugar\n ya que divide la gente y la mayor&iacute;a no le gusta esperar tanto tiempo hasta crear el team \n_**( si estaria en todos los modos y no fuera aparte, no tendria el problema de tardar mas de 15-20-30 minutos en formarse un team ) **_\n\npara cuando rito pondr&aacute; el modo **_Creador de equipos_** en todas los modos para cuando?  {{champion:32}} {{item:3070}}\n\n\n\nhttps://www.youtube.com/watch?v=26qdgsVVQEo   <-------- Primeros dias del Team Builder en el PBE _**( donde solo y exclusivamente estaba el creador de equipos ) **_ para los que vengan a decir que tardas mas de 20 minutos en crear un team  \"** por cierto los primeros dias con el team builder en LAS era exactamente lo mismo la misma velocidad para crear un team **","replies":[{"poster":"xKeyNx","date":"2015-04-04T12:53:05.227+0000","up_votes":2,"down_votes":1,"body":"Vos decis que el creador de equipos ya no sea opcional que sea la unica opcion... Estas re loco, la minoria de gente juega con eso","replies":[]},{"poster":"Rock the Climber","date":"2015-04-04T15:34:13.260+0000","up_votes":1,"down_votes":1,"body":"si estaría en todos los modos y no fuera aparte igual tardaría, ya que nadie quiere ir supp, y casi todos quieren ir mid o top. prueba de ello es que las primeras lineas que siempre cantan en normal son top y mid, y las ultimas son jg o supp. es por eso que tarda, no por que poca gente lo juegue, es que poca gente quiere ir supp.","replies":[{"poster":"Saykan","date":"2015-04-05T03:42:38.871+0000","up_votes":1,"down_votes":1,"body":"primero que nada y tratare de responderle a @xKeyNx tambien actualmente esta tan dividida la seleccion de campeones que los pocos que lo juegan se saturan y terminan por no tocarlo jamas, el modo cuandio salio tubo mucho positivismo pero no podes probarlo si se divide la gente \nen la cola normal como decis no es que \"TODOS QUIEREN IR TOD MID Y ADC\" muchos piden soporte pero aun asi estan en la cola normal y no en el creador de equipo ._. ya que ( COMO TODOS ESTAN EN LA COLA NORMAL ES MAS RAPIDO ) si estaria solo el creador de equipo y aun faltarian \"soportes\" el sistema te avisa asi que alguien si o si por obligacion vera eso y va a ir soporte sin ser obligado ni nada como por ejp cuando vas actualmente a la misma aveces faltan adc o soporte y pickeas esas lineas para ver si es mas rapido y lo es imaginate ahora SOLO estan el creador de quipo","replies":[{"poster":"Rock the Climber","date":"2015-04-05T05:04:31.543+0000","up_votes":1,"down_votes":1,"body":"obligar a jugar a la gente a un modo que poca gente le gusta, sólo para saciar a unos pocos, es una muuuuy mala idea. Es como si pusiera únicamente dominion o bosque retorcido, para que no tengan que esperar ya que unos pocos lo juegan. Y conociendo esta comunidad que se pone loca cuando le sacan las ranked 1 día, hacer eso sería como cortarles un pie. Estaría bueno que riot haga lo que tu dices por una semana y ver como reacciona la gente, ya que solo estamos especulando y sería un debate eterno","replies":[{"poster":"Saykan","date":"2015-04-05T11:06:03.187+0000","up_votes":1,"down_votes":0,"body":"1- no es un modo aparte el  juego sigue siendo el mismo \n2- no trae complicaciones, si no soluciones:\n**\" peleas innecesarias por lineas, el anticiparte a tener bien tus runas y maestrías y gran gran oportunidad de ir a la linea que vos realmente queres  \" **\nasí que por favor no vengas a comparar modos de juego como dominion aram etc  con esto ._.  si no se termina el debate aca mismo \n\n ACTUALMENTE _**SON 2 ENTRADAS**_ PARA IR AL _**MISMO LUGAR**_\n PERO UNA ES MAS POPULAR QUE LA OTRA AUNQUE SEA UN ASCO EL MODO ALEATORIO DE PICKEO \n PEOR AUN PARA LOS QUE TIENEN UN MAL PC (POR QUE SIEMPRE ENTRAN ULTIMO) \n O SON NIÑO QUE DIRECTAMENTE SE FRUSTRAN Y EMPIEZAN A TROLEAR POR QUE LES QUEDO SOPORTE O UNA LINEA QUE NO QUERÍAN\n APARECEN LOS DOBLE TOP, DOBLE MID, EL FLAMEO LA FALTA DE GANAS DE JUGAR LA PARTIDA\n POR QUE NO VAS CON EL CAMPEÓN QUE QUERÍAS IR   ETC ETC\n\nsi estuviera solamente** 1 entrada** ( el creador de equipo )_** no hay que esperar nada **_\nyo mismo presencie el inicio del creador de equipos cuando recién salio **( TODO EL MUNDO ESTABA EN EL CREADOR DE EQUIPOS )** y los equipos se armaban en _**menos de 5 minutos**_ nadie se quejaba todos estaban cómodos no había problema alguno, aparte de afk, trolls o jugadores sin habilidad que siempre estarán por mas que hagan lo que hagan","replies":[]}]}]}]}]}