{"poster":"Archkyrie","date":"2017-10-11T23:37:01.436+0000","title":"Kayle & Morgana Rework: Lore","subforum":"Story, Art, & Sound","up_votes":15,"down_votes":2,"body":"Evening, All.\r\nFor the past several years. Riot games has made a huge effort to fix and improve the older champions of League of Legends. Personally, I think that the champion updates have gone a long way towards giving this game more character and playability, and have been an overall success.\r\n\r\nNow {{champion:10}} &amp; {{champion:25}} were my literal first two champions in League of Legends; I loved them then, and they still have a special place in my roster. After seeing how successful the updates of other older champions updates have been, I am quite excited about their _eventual_ rework (I have no illusions about how long it will be before these two have their moment). Gameplay-wise, Graphics-wise, there are improvements that can be made, but this post is focused on the _story_ behind the characters, something I am very interested in generally when it comes to this game. The purpose of this post is to open up a discussion about what we do or do not want to see happen to the epic of &quot;Kayle and Morgana&quot;.\r\n\r\n...\r\n\r\nFirstly, lets consider what there is to preserve. In a word...little. Even before the League Universe began to solidify, and much of the old lore of the game was reconnected, {{champion:10}}&#039;s and {{champion:25}}&#039;s story was rather short. Inter-dimensional beings, sisters on opposite sides of a civil war, fighting for order and justice vs freedom and individuality. The story has promise, but it was never fully developed. There were a few bits of development, like {{champion:25}}&#039;s Sinful Succulence Bakery (I treasure that skin {{item:2054}} ), but not many. The game, in it&#039;s earlier stages, didn&#039;t have time for individual stories of great depth, so their saga remained short and sweet.\r\n\r\nLooking at the League Universe now, which has very good stories that show the characters of the champions more fully, you will notice that there is no mention of either sister outside of their short bios, which have been eddied to at least make some sense in the current context of the game world. No comics, No short stories; the few external stories that were present before have been retconned. What we are left with is a surprisingly small amount of actual story for these characters.\r\n\r\n...\r\n\r\nSo what about their characters? Taking directly from their bios, you can get a few basic concepts. {{champion:10}} is a champion of justice, fighting against evil, but the centuries of killing evil has taken a toll on her spirit. {{champion:25}} fights against tyranny, and for freedom, but in the process has become tainted by her evil doings. There is actually not much to their characters in their actual lore.\r\n\r\nAnd yet, {{champion:10}} and {{champion:25}}have so much character, right? Most of the personality we associate with these two is not actually from their lore; rather, it was extrapolated by the fan base to fill the void that was their characters. For example, it has been inferred that {{champion:25}} was originally fighting for good causes, before falling into evil methods, when really her story just says that she was evil and rebellious. And from fact that {{champion:10}} disowned {{champion:25}}, people came to the conclusion that {{champion:10}}&#039;s rejection led to {{champion:25}} falling.\r\n\r\nIt&#039;s not that these are _wrong_ interpretations; they&#039;re actually good characterizations that people chose for these sisters. It&#039;s just that they aren&#039;t actually in the lore. I saw this come up when {{champion:3}} was updated. People were upset(myself included) that his stoic and determined resolution had been replaced by a brash and hearty character. To which Riot replied, &quot;Well, he didn&#039;t actually have that character before. He was just kind of sad and mopey.&quot; Which is true; his story and voice lines were really basic; the story we had imagined was just that: imagined.\r\n\r\n...\r\n\r\nSo what is it we want to add or preserve? This is where discussion comes in. Here I will include my own opinion:\r\n\r\nStory-wise, they should still be sisters, they should still be enemies, and they should still be opposites in personality. I personally don&#039;t care it they don&#039;t remain _literal_ angels (angels don&#039;t really have a place in this universe anyway, as of yet), but they should still be exotic and powerful beings among humans. Oh, and they should still have wings.\r\n\r\nTheir character is where it gets interesting. One common concept I have heard often is that, contrary to the binary good and evil that is represented in their stories, {{champion:10}} fights for order, not necessarily good, while {{champion:25}} fights for chaos, not necessarily evil. To use D&amp;D alignment (which is extremely useful), {{champion:10}} is lawful neutral, and {{champion:25}} is chaotic neutral, rather than lawful good and chaotic evil, respectively. Or, taking it to an extreme, {{champion:25}} is lawful evil, and {{champion:25}} is chaotic good. Personally. I _love_ this interpretation; it makes both characters more human, and lets you empathize with either of them. {{champion:25}} would be much more interesting as a fighter for freedom who has made some _very_ questionable choices, but is not really totally evil at heart, and want&#039;s to share an ideal of freedom and self expression with the world. {{champion:10}}, meanwhile, who fought valiantly for the good of the world, has become jaded after centuries of faithful service, and has become a zealot for governmental control.\r\n\r\nLet&#039;s talk about their location. {{champion:10}} has always been a Demacian. Full as it is with righteous champions and defenders of good, she doesn&#039;t really stick out among their ranks currently. But if she was the _bad_ Demacian? Despite the lore change for Demacia and Noxus that places neither empire in a strickly &quot;good&quot; or &quot;bad&quot; classification, Demacian&#039;s are still seen as the good guys, and Noxians as the bad guys. {{champion:10}} could be the Demacian that took Demacian ideals too far. She resides in Demacia, and is regarded as a champion of the kingdom, for her protecting of the city state. But she doesn&#039;t really fight for them, but for order, and makes decisions that negatively affect individuals for the good of the kingdom. Also, being suspicious of magic and otherworldly beings, the Demacian people don&#039;t outright reject her, but they do fear and distrust her, and she can see it in the eyes of the people when she is in public, further jading her and turning her against the common people.\r\n\r\nConversely, {{champion:25}} could be Noxus&#039;s first &quot;good&quot; champion. Contrary to {{champion:10}}&#039;s treatment, in Noxus, if you are useful, you are accepted, so {{champion:25}} would meet curiosity, and maybe some suspicion, but overall acceptance. However, Noxus is still a corrupt empire, and it goes about conquering nearby peoples, which is very much against her beliefs. So, she becomes a freedom fighter, an she fights to overthrow Noxus. In the process she becomes a symbol of freedom to those who feel oppressed by the Noxian regime.\r\n\r\nHow do they feel about each other. Once, being family, they loved each other. Over time, though, their ideals began to diverge. Trying to preserve a scrap of their original lore, I&#039;ll say that Morgana wanted to reconcile with Kayle, but she had become to dogmatic, and ultimately rejected and tried to kill morgana, who escaped and fled to Noxus, while Kayle remained in Demacia. How they came to live their in the first place depends on their origin story, which I do not, as of yet, know.\r\n\r\n...\r\n\r\nNow I have a few words about their appearance. Before this, I never liked {{champion:10}}&#039;s base skin, because of the helmet, but for the ideas I am suggesting, the helmet actually makes a lot of sense, since she is hiding her face from the populace, both because they reject her and because she feels superior to them. So as far as her general appearance, I personally don&#039;t want any real changes. I do want her graphics quality to match the level of newer champions and updates, but for her appearance as a character, no suggestions. I have skins without helmets if I ever want to play her without one anyway.\r\n\r\nNow {{champion:25}} needs work. Obviously she will need a new model and new animations. But as a character, her appearance is just weird. A long skirt and... a bra? And mascara. I guess new initial design was supposed to be &quot;evil, so also seductive&quot;, but I don&#039;t feel like that&#039;s part of her character. Personally, I don&#039;t like sexually explicit characters at all; I understand that Riot makes some of these characters to please the players, but for {{champion:25}}, it&#039;s just not necessary. As she is a fighter who fights for a cause, I would suggest more utilitarian regalia over a dress, anyway. Sort of similar to what Xayah wears; they are fellow freedom fighter&#039;s after all.\r\n\r\nOne thought I personally had on the wings. What if, instead of having a pair of sickly, useless wings, she had one perfectly whole wing, but had lost the other? I think this would be a great expression of her character. She has fought for her cause for a long time, and has made difficult sacrifices. One wing means no natural flight, so it&#039;s a significant detriment. Perhaps the loss was caused by {{champion:10}} in the event that caused them to become enemies. {{champion:10}}, meanwhile, is whole in body, but is injured in soul.\r\n\r\n...\r\n\r\nWell, now it comes to discussion. Most of what has been said in this post has been my opinion, and I don&#039;t pretend to think that my opinion is going to define their update. Ultimately, what I want is for their update to be good. Really good. I struggled initially to accept the changes made to {{champion:}} and {{champion:78}}, but ultimately, they were really good updates. I want the saga of &quot;Kayle and Morgana&quot; to be even better. So, what I&#039;m hoping for is a discussion of really, really _good_ ideas of how the update can be a success. I welcome critique of my own ideas, ideas of your own, or links to pages that already cover this entire subject that I hilariously failed to notice before posting. Hopefully, the update teams at Riot can benefit from the combined cognition of...however many of us participate. Who knows, maybe no one will, but we can certainly hope.\r\n\r\nHere&#039;s to the tale of &quot;Kayle and Morgana&quot;. May it be retold through the centuries and improved upon each and every telling.\r\n\r\nCheers.","replies":[{"poster":"6FlagsFunnelCake","date":"2017-10-12T03:42:47.706+0000","up_votes":10,"down_votes":1,"body":"My theory, and I know we've heard this many times before, they're gonna be reworked into having some connection to Targon.\nNot exactly the Mount Targon, the the Targonian Space Empire. I feel like it's already been hinted. We know how Aurelion Sol broke free from Targonian control, right? The voices of the Aspects, far in the stars through Targon's empire, began conflicting and debating with one another, leaving Aurelion free from their grasp. This honestly sounds like just the kind of inter-dimensional civil war we need for Kayle and Morgana.","replies":[{"poster":"Dreamspitter","date":"2017-10-12T08:55:48.072+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=BonzaiBuddy,realm=NA,application-id=6kFXY1kR,discussion-id=WisrHcjP,comment-id=0003,timestamp=2017-10-12T03:42:47.706+0000)\n>\n> My theory, and I know we&#x27;ve heard this many times before, they&#x27;re gonna be reworked into having some connection to Targon.\n> Not exactly the Mount Targon, the the Targonian Space Empire. I feel like it&#x27;s already been hinted. We know how Aurelion Sol broke free from Targonian control, right? The voices of the Aspects, far in the stars through Targon&#x27;s empire, began conflicting and debating with one another, leaving Aurelion free from their grasp. This honestly sounds like just the kind of inter-dimensional civil war we need for Kayle and Morgana.\n\nI swear Targon is the weirdest part of the 'lore'. I mean like Halo _Forerunenrs_, Assassin's Creed _Ones Who Came Before_ , or other such stuff. I dunno how I should feel about it.","replies":[{"poster":"Warlord Dienekes","date":"2017-10-12T13:40:34.513+0000","up_votes":3,"down_votes":1,"body":"Personally, I hate it. But determining what you like or dislike is up to you.","replies":[]}]},{"poster":"Warlord Dienekes","date":"2017-10-12T13:43:09.596+0000","up_votes":2,"down_votes":1,"body":"Yeah I remember pointing out when new Targon was released that the space empire stuff sounds pretty damn close to Morg and Kayle. \n\nNot sure how I'd feel about them actually becoming the space Targs though.","replies":[]},{"poster":"Wrathof300","date":"2017-10-12T05:21:16.747+0000","up_votes":2,"down_votes":1,"body":"Unless they become Vastayans, I believe they will be connected to Targon. I was actually gonna post this weekend my theory on Kayle and Morg being Aspects from a different planet, under Targon's control.","replies":[]}]},{"poster":"DarkRitual","date":"2017-10-12T02:49:22.847+0000","up_votes":5,"down_votes":1,"body":"I don't want it to be the cliche of \"I look evil but am really the good one. Hugs for everyone!\" crap.\n\nChaos vs Order is decent, but feels overdone in recent times (I blame Assassin's Creed mostly).\n\nI'd rather them be fighting for the same thing, just going about it differently. This still lets them be in disagreeement, but not direct enemies.\nSaving people? Kayle wants to help everyone. Morgana wants to kill bad people so there's less threats to everyone else.\nThis would offer a lot more opprotunity for depth and further individual story progression.","replies":[{"poster":"Votable Jester","date":"2017-10-12T16:59:55.221+0000","up_votes":2,"down_votes":1,"body":"In just that little post you dramatically changed Kayle's character.  She's the arbiter sentencing the evil people to death, not the compassionate doctor trying to save a bunch of patients.","replies":[{"poster":"DarkRitual","date":"2017-10-12T17:48:31.091+0000","up_votes":1,"down_votes":2,"body":"Because that's not a flat overdone personality or anything.\nI offered one way to change things.\nI just want them to be more unique and not just bland overdone tropes.","replies":[{"poster":"Votable Jester","date":"2017-10-12T22:18:28.124+0000","up_votes":2,"down_votes":0,"body":"Good looking angelic character is the epitome of good.  That's your unique look on her?","replies":[{"poster":"DarkRitual","date":"2017-10-12T22:24:04.325+0000","up_votes":1,"down_votes":0,"body":"That's what I **DON'T WANT HER TO BECOME.** \nAngels are good. Bad Angels become fallen angels. BOOOOORRRRIIIIINNNNNGGGGGGG. Do something new, different, and interesting with the characters.","replies":[{"poster":"Votable Jester","date":"2017-10-12T22:57:16.699+0000","up_votes":3,"down_votes":0,"body":"But that's what you seemed to describe for Kayle.  Your Morgana certainly has some character (a little similar to the old anti-hero, but still).  Basically anything is a cliche at this point really.\n\nI think putting them as Kayle supporting the law (which she sees as keeping the good and majority safe) while Morgana supports the people (willing to break and directly oppose the laws for them).  They both have dark sides here with Kayle eventually punishing relatively innocent people for minor infractions and Morgana breaking the laws so much that she becomes a bit corrupted (breaking laws includes learning that dark magic).\n\nThey wouldn't be totally original characters like that, but they would both have their own outlook on the world that is justifiable.  I think that reasonable/human characters are more interesting than characters that are unique for the sake of being unique.","replies":[{"poster":"DarkRitual","date":"2017-10-13T00:37:37.509+0000","up_votes":2,"down_votes":0,"body":"I'd give in on being unique if they are INTERESTING at least.\n\nBut even within defined character cliches, characters can be made unique in other ways.\n\nTahm is plenty interesting, even if his basic character isn't exactly unique. Enough different things are added in to make him his own unique thing.\n\nKled is an example of a champion who is unique and interesting.","replies":[]}]}]}]}]}]}]},{"poster":"Culinary","date":"2017-10-12T12:17:35.536+0000","up_votes":4,"down_votes":1,"body":"Great to find someone else who enjoys {{champion:25}} {{champion:10}} lore as much as I do.\n\nWhat I like about it is that there is no \"good\" or \"bad\" one, it's all personal interpretation.\n\nI'm absolutely dying for a VU for them, not just because {{champion:25}} is my main (and my waifu). But because you could do so much with their voices/models/splash arts.\n\nI'm also still waiting for this skin. I made this a while ago but I think it fits really well. But unfortunately it won't ever happen until the VU happens eventually. (or riot thinks it's a bad idea)\n\nhttps://boards.na.leagueoflegends.com/en/c/skin-champion-concepts/TuvReqGJ-skin-concept-pool-party-morgana","replies":[{"poster":"Archkyrie","date":"2017-10-13T04:23:13.281+0000","up_votes":2,"down_votes":0,"body":"These sisters are in desperate need of a pair of matching skins, and a more light-hearted theme like pool party would be perfect for the occasion. I love the beach ball shield, especially if it rotated like her base shield does. Here's hoping it will happen.","replies":[]}]},{"poster":"Votable Jester","date":"2017-10-12T02:41:33.586+0000","up_votes":4,"down_votes":1,"body":"I'd want them both to be \"neutral\" in that they can both be empathized and sided with by players.  To summarize their views, Kayle believes the people should serve the law while Morgana thinks the law should serve the people.\n\nTo further their views, I'd have Kayle focused on the numerous vile people who have been exposed and dealt with by the law.  She sees the law as protecting the people from their most dangerous members.  Morgana on the other hand would be focused on those who received overly harsh or even inaccurate sentences.  She sees the law as something that hurts the people and must be reformed.\n\nThey should also acknowledge each others' views on the matter and simply consider their side to be better overall (Kayle thinking a small sacrifice for the many, Morgana thinking that sacrifice of any innocents is intolerable).  This would provide them with deeper characters.\n\nI think the most fundamental part of Kayle and Morgana's lore is that both sides have their merit, and that is something that must remain.","replies":[]},{"poster":"Skankintoopiv","date":"2018-04-23T20:35:04.957+0000","up_votes":2,"down_votes":0,"body":"I do love most of what you've posted here, and I agree for the most part. I know I'm commenting on something MONTHS old, but with their rework likely approaching soon, I figured I needed to get my two cents in on this before they are set in their ways.  \n\nThe Angels Kayle & Morgana come from are not \"good\" but \"Lawful\". They're more akin to say, Hellknights from Pathfinder. An army of Law, built to fight chaos, not evil. They fear chaos as entropy will be what brings an end to the world.  As such they seek a harsh authoritarian rule over everything. Kayle wears her Helmet because she has literally given up her own personality in order to fight for absolute order. She cast out Morgana as her last act of mercy, destroying her wings in the process. After that, she donned the helmet for good and gave up her everything to fight for law. \n\nMorgana, on the other hand, fights for free will. Allow creatures to exist as they wish, not forced into the cookie cutter mold that the Angels want them to be. She puts this idea above all else, even morality and as such is willing to stoop to dark magic, or anything that will give her side the upper hand (including using the summoners power when that was a thing lore-wise.) \n\nI'd say lore wise just make this an ancient battle or whatever. Hell it could have ended in the destruction of both side of the war, and Kayle & Morgana could have just been the two prominent commanders on each side. I'd hate to see them made to be plain runeterrans, or aspects of Targon, or whatever. Just cuz it seems meh. I suppose I wouldn't HATE the idea of them being aspects of Law & Chaos, but still. \n\nI pretty much agree with looks, Kayle should stay about the same. She is meant to be an nondescript knight in shining armor because she has given up herself in the fight for law. Morgana should not be dressed all \"dark and sexy\". She isn't there to make people lust after her she is there to fight for freedom. Hell I could see her with an almost communist military outfit, or just clothes that generally fit. Just because they're opposites in Alignment & Methods doesn't mean they need to have one with no skin showing and one with nothing but skin showing. While I agree Morgana has nothing to hide, she also would use anything she could to her advantage so I can't imagine her running around naked for no reason.","replies":[]},{"poster":"LusterCrown","date":"2018-03-05T19:26:59.024+0000","up_votes":2,"down_votes":0,"body":"I love concept that defines {{champion:25}} as Fallen Angel fighting against the tyrany of absolute justice ordered by {{champion:10}}  I don't know why Riot  didn't took to develop their storyline yet.  \n   But in future and new lore of {{champion:25}}  I would like to see her as strong, confident and doesn't want revange at all cost not Fallen but \"Uprised\" Angel. Maybe Riot finally use idea of whip weapon and add it to Morgana's battle style (seriously like Kayle finghting with huge sword and powerfull deffence and offence might and {{champion:25}} ....just...spells:P) The only thing that they should keep in the rework of her are Dark Binding and the Black Shield. \n   How about putting Black Shield on the  enemy? For example: under the spell, enemy couldn't get any of possitive buffs and his armour ' n MR  will be lowered - I just think. And one more thought, I'm open at conect {{champion:25}} in a place there Black Rose has it source or maybe use part of sinister magic of the Well under the Immortal Bastion? What do you guys think?","replies":[]},{"poster":"NightmareScholar","date":"2017-10-17T06:21:45.345+0000","up_votes":2,"down_votes":0,"body":"I agree with the premise that Kayle and Morgana need a serious lore update and I think that there are a lot on interesting ideas here. I think I've managed to itemize my thoughts well enough on what can be done.\n1. Definitely keep them siblings but their relationship as siblings needs to be distinct from the other siblings in League. \nHow is the dynamic of Kayle and Morgana uniquely memorable in comparison to Lux and Garen, Darius and Draven, Nasus and Renekton, Ornn and the other demigods, and Cassiopeia and Katarina (I actually don't know where Riot stands in regards to Cass and Kat or if their relationship is even canon anymore but that's besides the point)? I think keeping their antagonism based on their respective principles, order vs. freedom, would be the best way to keep their relationship interesting since the only other siblings who are opposed to one another are Nasus and Ren (who fight each other because Xerath drove Ren insane), and Ornn and Volibear (who fight because Volibear killed Ornn's followers). Keep their divide grounded in ideological differences, then build off of that divide. Blinded by righteousness versus freedom tainted with malice is a good base for characters.\n2.  Regarding their origins.\nI've read a few posts that think that linking Kayle to Damacia and Morgana to Noxus would be a good move. I certainly do understand the idea but I have to disagree. Though I do think it would be interesting if they represented the ideals of their respective alignment in a similar way that Karma does for Ionia but I don't know how Riot could do that without creating some internal logic issues. In those circumstances I think they could make them like patron deities for the two nations but I'm not completely sold on that idea. Connecting them with Targon is an interesting idea but it could come at the risk of creating a dynamic that mirrors Leona vs. Diana (Targonian ideals of justice vs heresy). If Kayle and Morgana keep the same general conflict but associate it with Targon, what can they add to the story of the Tagonians? Also don't make them Vastayans, I like the Vastaya and the changes they brought to the lore but not these two.\n3. Visual updates: Yes. Kayle I think is overall fine (a few touch ups) but Morgana needs a tune up. I say she should keep the massive skirt since the only other champ to have that kind of attire is Sona, but her top half could use a bit more something something. I really don't mind that she wears only a bra to cover her top half (I'm not exactly prudish) but something like sleeves or some sort décor like jewelry or tattoos to add some additional detail might be nice. I think they should keep the damaged wings but if they can find an even more visually interesting and lore relevant replacement for them then I will be fine.","replies":[]},{"poster":"PokladnicaZla","date":"2017-10-12T18:05:53.301+0000","up_votes":2,"down_votes":1,"body":"That's has been such  breeze of fresh air to read. Many have the misconception that {{champion:10}}  is good and  {{champion:25}}  is evil,but you summed it perfectly.\nI read it all really fast ( sry was hyped) ,but what are their origins? Where do they come from,if they are still sisters? Why do they have wings?","replies":[{"poster":"Archkyrie","date":"2017-10-13T04:42:22.361+0000","up_votes":2,"down_votes":0,"body":"Well, personally, I didn't give as much thought to their origin as I did to their personalities. I've heard a lot of comments about them potentially being connected to the lore of Mount Targon, in which case they might not be literal \"servant of gods\" angels, but more like \"long lived alien species with wings\" angels. They should still have seraphic characteristics, imho, just in keeping with their original design.","replies":[]}]},{"poster":"DariusDemiurge","date":"2017-10-12T04:25:57.164+0000","up_votes":2,"down_votes":1,"body":"First off the two things you said that I disliked. \n\nChanging Morgana's look, I love her look now and she should remain very similar. Maybe restore her wings yet claim she enjoys walking like the common lesser races. (For Kayle they should give her the night hunter rengar treatment with a toggle for her helmet.)\n\nThen secondly they should remain angels.  Magic the gathering does angels, no reason league can't. We got demons, demigods, and everything else. \n\nAs for Kayle she should be lawful evil. Originally good, but started to grow cold and less forgiving. Punishing even the smallest mistakes or transgressions harshly. \n\n Morgana should be chaotic good. She means well but will erase someone from existence if she deems it for the better. I like to think of her in a sense like Marvel's punisher. He kills the worst criminals for the betterment of the common people. Eliminate the problem. \n\nOr perhaps riot can toss in a backstory of jealousy and fear on Kayle. Perhaps Morgana was going to ascend and become a seraphim (or some other high rank form among angels.) then the leader of the angels. (I want more angels.) Kayle didn't like the idea of losing her position and pushed forward with actions that forced Morgana's. (I like to think Kayle was slightly jealous of Morgana in some sense.)\n\nMaybe they could be tied to sol in someway, guardians of existence but bickered over what way was best to get things done. Ended up fighting and separating.\n\nOr riot could be lazy and just make them goddesses of noxus and demacia or some other aspects. \n\nTyping on my phone, plus distractions made lose my train of thought sadly. Gg moderate. But I love the angels and hope riot does a good job on everything about them. Many people can confirm my love on the boards. For now I await patiently but with a bit of anxiety on riot's work.\n\nPS: they better not fucking become vastayans. ","replies":[{"poster":"Archkyrie","date":"2017-10-13T04:33:07.078+0000","up_votes":2,"down_votes":0,"body":"If they get made into vastayans, I'm just going to start laughing. And then sobbing uncontrollably.","replies":[]},{"poster":"Dreamspitter","date":"2017-10-12T08:50:35.902+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=DariusDemiurge,realm=NA,application-id=6kFXY1kR,discussion-id=WisrHcjP,comment-id=0004,timestamp=2017-10-12T04:25:57.164+0000)\n>\n> First off the two things you said that I disliked. \n> \n> Changing Morgana&#x27;s look, I love her look now and she should remain very similar. Maybe restore her wings yet claim she enjoys walking like the common lesser races. (For Kayle they should give her the night hunter rengar treatment with a toggle for her helmet.)\n> \n> Then secondly they should remain angels.  Magic the gathering does angels, no reason league can&#x27;t. We got demons, demigods, and everything else. \n> \n> As for Kayle she should be lawful evil. Originally good, but started to grow cold and less forgiving. Punishing even the smallest mistakes or transgressions harshly. \n> \n>  Morgana should be chaotic good. She means well but will erase someone from existence if she deems it for the better. I like to think of her in a sense like Marvel&#x27;s punisher. He kills the worst criminals for the betterment of the common people. Eliminate the problem. \n> \n> Or perhaps riot can toss in a backstory of jealousy and fear on Kayle. Perhaps Morgana was going to ascend and become a seraphim (or some other high rank form among angels.) then the leader of the angels. (I want more angels.) Kayle didn&#x27;t like the idea of losing her position and pushed forward with actions that forced Morgana&#x27;s. (I like to think Kayle was slightly jealous of Morgana in some sense.)\n> \n> Maybe they could be tied to sol in someway, guardians of existence but bickered over what way was best to get things done. Ended up fighting and separating.\n> \n> Or riot could be lazy and just make them goddesses of noxus and demacia or some other aspects. \n> \n> Typing on my phone, plus distractions made lose my train of thought sadly. Gg moderate. But I love the angels and hope riot does a good job on everything about them. Many people can confirm my love on the boards. For now I await patiently but with a bit of anxiety on riot&#x27;s work.\n> \n> PS: they better not fucking become vastayans.\n\nWhy is adding more gods to the game 'lazy'?  That aside LMAO Vastayans. Usually they're multiple animals, or full humanoid animal. I don't think Rito would try it. But it would be funny.","replies":[]}]},{"poster":"darkdill","date":"2017-10-12T05:43:49.141+0000","up_votes":1,"down_votes":1,"body":"Have to vote \"Other\" because Good and Evil are polarizing ideals, and can't be seen as constants.","replies":[{"poster":"Dreamspitter","date":"2017-10-12T08:46:12.066+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Yousosmart,realm=NA,application-id=6kFXY1kR,discussion-id=WisrHcjP,comment-id=0006,timestamp=2017-10-12T05:43:49.141+0000)\n>\n> Have to vote &quot;Other&quot; because Good and Evil are polarizing ideals, and can&#x27;t be seen as constants.\n\nUnless.....this were Dungeons and Dragons or other settings where they're \"cosmic\" forces? \n\nI will say that like real people, they both believe they are doing 'good'.","replies":[]}]},{"poster":"Dreamspitter","date":"2017-10-12T08:44:52.130+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Archkyrie,realm=NA,application-id=6kFXY1kR,discussion-id=WisrHcjP,comment-id=,timestamp=2017-10-11T23:37:01.436+0000)\n> \n  I saw this come up when {{champion:3}} was updated. People were upset(myself included) that his stoic and determined resolution had been replaced by a brash and hearty character. To which Riot replied, &amp;quot;Well, he didn&amp;#039;t actually have that character before. He was just kind of sad and mopey.&amp;quot; Which is true; his story and voice lines were really basic; the story we had imagined was just that: imagined.\n> \n \nI'm going to agree with you on that one\n\nhttps://www.youtube.com/watch?v=D4EPyuwV9ME\n\nOld Galio voice over, since the old lines aren't on the LoL wiki.","replies":[]},{"poster":"Epicurus","date":"2017-10-12T01:15:38.376+0000","up_votes":2,"down_votes":1,"body":"I made [this](https://boards.na.leagueoflegends.com/en/c/story-art/MvIQeEi2-kayle-and-demacia) thread a few months back on how Kayle could fit in with the updated xenophobic Demacia. It didn't generate much discussion though.\n\nI think the biggest factor in Kayle and Morgana's stories is _why _ they are in Runeterra. Are they here by choice? Or are they trapped here and trying to return home? Or is their home destroyed, and they trying to rebuild it? Depending on what her end game is, Morgana might not care about the corruption of Noxus, as she has no plans of staying and it not concerned about a lesser species such as Runeterrans.","replies":[{"poster":"Dreamspitter","date":"2017-10-12T08:59:45.884+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Epicurus,realm=OCE,application-id=6kFXY1kR,discussion-id=WisrHcjP,comment-id=0000,timestamp=2017-10-12T01:15:38.376+0000)\n>\n> I made [this](https://boards.na.leagueoflegends.com/en/c/story-art/MvIQeEi2-kayle-and-demacia) thread a few months back on how Kayle could fit in with the updated xenophobic Demacia. It didn&#x27;t generate much discussion though.\n> \n> I think the biggest factor in Kayle and Morgana&#x27;s stories is _why _ they are in Runeterra. Are they here by choice? Or are they trapped here and trying to return home? Or is their home destroyed, and they trying to rebuild it? Depending on what her end game is, Morgana might not care about the corruption of Noxus, as she has no plans of staying and it not concerned about a lesser species such as Runeterrans.\n\nAnd will there be more of them?\n\nOr will they just remain \"those two characters\" not connected to existing ones, or new ones.\n\nI kind of wonder if we will get a new hero, like Kayn or Evelyn that somehow add to the lore surrounding them.","replies":[]}]},{"poster":"LastAzAzEL","date":"2018-03-01T16:04:24.329+0000","up_votes":1,"down_votes":0,"body":"https://boards.na.leagueoflegends.com/en/c/story-art/bv1wGA9d-the-darkin-orphan-golden-queenand-the-golden-skin-boy-theorytargon-shurima-darkin?show=new\n\n\nmade a few theorys here,","replies":[]},{"poster":"Wrathof300","date":"2017-10-12T05:33:58.680+0000","up_votes":2,"down_votes":3,"body":"I like your interpretation that Kayle should be lawful evil and Morg chaotic good. It lines up with my own theory I have about the sisters being connected to Targon actually.(except my twist on it is that, Kayle is still the hero and Morg the villain of the story)\n\nI would we actually need more corrupt Noxians as the 'good' Noxians would be: Darius, Katarina, Talon perhaps even and Riven. \nSwain and the Black Rose represent a different type of corruption than the corruption Darius and Urgot seek to root out of Noxus.","replies":[]},{"poster":"Zyranium","date":"2017-10-12T23:18:45.292+0000","up_votes":1,"down_votes":3,"body":"I'd love to see those two, becoming superior demonic entities\n\n{{champion:25}} = Demon of Envy\n{{champion:10}} = Demon of Pride\n\nBoth should be superior goddesses from Noxus and Demacia, loved and feared, those two would represent the power of the realms they lead.\n\nI know Demacia isn't really into Magic things, but they have living superheros giant gargoyles, and it was proved that they have a religion based on \"The Veiled Lady\". Seems quite familiar huh ? Helmet/Veil \n\n{{champion:25}}  should become the leader of the Black Rose along with {{champion:7}} , manipulating the people, controling them, and feeding from their despair, Morgana main theme is Black Magic and Pain, literally cursing the ground and unchaining her enemies with spiritual chains.\n\nI don't really know what could be their origins, and I will hate Riot forever if they make them Vastayan, too easy","replies":[]}]}