{"poster":"Croc463","date":"2019-07-23T20:49:36.760+0000","title":"How to fix this destroyed game","subforum":"Gameplay","up_votes":3,"down_votes":16,"body":"We all know it, the game is fucking trash right now, it's (for me) in the worst state of all time and I don't even say it just because my one trick champ is literally unplayable, even Minecraft is just more fun than this bugged and bad designed bullshit at thus point.\r\n\r\nSo riot can whether just revert the game to Season 4, or Season 6 without Dynamic Queue and before Courage of the Collosous.\r\n\r\nIf not, then the game will never be fun to play ever again unless they do this:\r\n\r\n- First of all, start balancing around high elo!\r\n\r\n- Remove every season 8/9 Champion, they just have too much shit in their kit, unhealthy for the game, not fun to play against and making the champ high skill cap is not an excuse for having a champ do everything, it doesn't matter if the champ has trash base stats or is just bad, like Akali right now, just knowing that the champ is ingame with such a bad designed kit gives me cancer.\r\n\r\n- Remove Duskblade, this item is just way too unskilled, cheap, OP and bad designed to be allowed to exist, it shouldn't be in the game.\r\n\r\n- Nerf some Assassins/Buff some Assassins (AD Assassins only), as example, look at Zed and Shaco, Zed is way too overbuffed and is good in early, mid and Lategame meanwhile Shaco is bad in all states of the game.\r\n\r\n- Buff weak mages like Anivia, Viktor, Ziggs, Fizz, Veigar, Azir, Ekko, etc (Just some small buffs)\r\n\r\n- Revert Morellos (lol) and make a new item for AP which gives Healing reduction for less Gold like Executioners for AD.\r\n\r\n- Revert Runes, the Runes right now are full of too much Damage, Sustain and Tenacity, it's disgusting how u get 1 shot when ganking and the enemy support CC's you for just one second and proc all of his stuff (as example, Bard - Electrocute / Cheap Shot / Scorch).\r\n\r\n- Balance around Champion and not items (like Duskblade)\r\n\r\n- Buff AD Assassin items \r\n\r\n- Make Jungle actually fun again and don't let it have to perma gank to soak EXP from laners because jungle doesn't give EXP anymore (?)\r\n\r\n- Bring back Tracker's Knife (Warding Jungle item)\r\n\r\n- Bring back old Red Trinket and have to wait for level 9 to buy the one we have right now (Like Blue Trinket)\r\n\r\n- Revert PD (LOLXD?) or add Lifeline Effect to GA so ADC's can't just go Tabis/GA/PD and never dies\r\n\r\n- Change Tabis effect from 12% less dmg to atfer an enemy Champion AA you, his Attack speed is decreased by ~8%, but increase armor to ~30/35\r\n\r\n- Bring back Armor Penetration (why even make Penetration for AD Champs Scale with level, any reason? no? oh ok well done rito)\r\n\r\n- Make more MR items, especially for tanks\r\n\r\n- Buff boots of Swiftness and Boots of Lucidity as they are both way too weak and dont get bought besides Lucidity for when u play with transcendence.\r\n\r\nIf anyone wants to ask why 'this or that change' especially and why it should be, do so below please, and if anyone thinks something else has to change that I didn't include or forgot, please tell us below-","replies":[{"poster":"Jng Account","date":"2019-07-23T20:59:47.952+0000","up_votes":5,"down_votes":1,"body":"First you ask for balancing around high elo, then you ask for Azir buffs? If something, he is on the way to get more nerfs lul\n\nYou also want to bring back the unheatlhy amount of vision that green smite brought to high ranks, why?\n\n(Why are you acting like Minecraft wasn't fun???)","replies":[{"poster":"N0t even Cl0ne","date":"2019-07-23T21:28:48.870+0000","up_votes":1,"down_votes":3,"body":"I said small buffs, and it's not like Azir is OP or something\n\nBut you're kinda right about green smite, hmm, idk, I have to talk to some people abt that I guess","replies":[{"poster":"Anxious Veigar","date":"2019-07-24T08:38:31.351+0000","up_votes":1,"down_votes":0,"body":"Azir is actually really strong.","replies":[]}]}]},{"poster":"MagicFlyingLlama","date":"2019-07-23T21:03:39.668+0000","up_votes":4,"down_votes":1,"body":"> lv14 account\n\n>  start balancing around high elo!\n\nNow, why dont you want us to see your main?","replies":[{"poster":"Croc463","date":"2019-07-23T21:23:56.721+0000","up_votes":1,"down_votes":4,"body":"Sorry, I looked up Boards on this account and just got the idea to make this post, heres my (Last) Main tho as it's banned :/ \nhttps://i.imgur.com/QfY7z0q.jpg","replies":[{"poster":"N0t even Cl0ne","date":"2019-07-23T21:27:51.933+0000","up_votes":1,"down_votes":1,"body":"I know it's not high elo but tbh, Elo doesn't really matter when saying this, or why should it?","replies":[{"poster":"MagicFlyingLlama","date":"2019-07-24T00:18:16.456+0000","up_votes":2,"down_votes":1,"body":"Because you dont have a clue how this game works or what high elo looks like, and it shows.","replies":[{"poster":"Croc463","date":"2019-07-24T17:20:26.066+0000","up_votes":1,"down_votes":0,"body":"Balance team full of golds and silvers guess im too bad :)","replies":[]}]}]}]}]},{"poster":"TakaDama","date":"2019-07-24T18:17:56.716+0000","up_votes":1,"down_votes":0,"body":"1. They already do in a way; Riot bases a good bit of their decisions based on feedback from professional players. However, because these are professional players, most of the feedback has viewer participation as well as player enjoyment in mind; I even believe it has been said that pros play more cautiously than normal while competing due to how one bad play can literally throw you out of the bracket for a hefty monetary prize.\n\n2. While the overloaded kits are an issue, this more a side effect of Riot pushing these champions too hard so that older players will try to pick them up. They then get nerfed straight to the Shadow Isles, making the whole process questiobable as a balancing mechanic. To be clear, I welcome well-thought out champion designs to break up monotony, but most designs lately haven't been well-thought out.\n\n3. I actually think Duskblade could stand be reworked so that it has more applications but overall a much weaker effect; in fact basing it off of the sudden impact rune in Domination would be a good start for allowing it to be tuned down.\n\n4. Shaco honestly needs a rework at this point, or at least some cohesion as far as his scaling goes. As for Zed, they already took away his AD buff from W and Ult, but that doesnt address the issue of his safety with the second cast of W and Ult.\n\n5. Outside of classifying Fizz and Ekko as mages (they are AP assassins), I agree that mages should be buffed, or at least made a viable option to assassins.\n\n6. This the first thing I will disagree on, but I will also admit that the AP Grievous Wounds item being a tier 3 item compared to the tier 2 Bramble Vest for tanks and tier 2 Executioner's Calling for AD is awkward, if anything I would actually swap the magic penetration with grievous wounds on the orb (literally cant recall its name).\n\n7. Runes Reforged are fine as a replacement for masteries, however they still need to be looked into as a replacement for runes, especially since I can't think of any buffs or changes that have been released to compensate for the lack of runes ever showing up, including an attack speed counterpart to Doran's Blade.\n\n8. Not really sure what you mean here as itemization can make or break a champion; for example when Black Cleaver and Phage was reworked originally to provide movespeed instead of a chance of slowing the enemy, juggernauts got a massive boost in playability. However if a champion and item combo is broken, then I would actually tweak both to compensate so that the champion can still be played without the item and the item can still be used on other champions.\n\n9. This almost conflicts with your argument against Duskblade, but I actually undertand this as make other AD assassin items comparable to Duskblade; I actually can't think of anyone that wants Youmuu's Ghostblade before Duskblade.\n\n10. As a former jungle main I actually agree with this; at the very least make farming and control junglers viable again.\n\n11. I wouldnt mind a rework to Tracker's Knife and Ranger's Trailblazer, but having either return in their previous incarnations would not be the best idea.\n\n12. I actually believe the current red trinket needs to be buffed with actual vision for bushes; the fact that you still have to walk into a bush to target an invisible ward, trap, or champion is pretty bad to me.\n\n13. I keep forgetting they made Phantom Dancer the dueling Zeal upgrade; I would honestly like to see it keep a ghosted effect and maybe a small boost in MS on attack to help with kiting.\n\n14. Last one I want to address as I am eating out and have no charger nearby, but Lethality was actually introduced as a way for Assassins to feel relevant at all stages of the game no matter how bad or good they start off. Unfortunately, it is overtuned right now.","replies":[]},{"poster":"G Master Hung","date":"2019-07-23T23:13:13.490+0000","up_votes":1,"down_votes":0,"body":"I get a lot of high elo players are pissed about the game being broken up there, but I think you should remind yourself that a majority of players are in lower elos.","replies":[{"poster":"Croc463","date":"2019-07-24T17:21:57.734+0000","up_votes":1,"down_votes":0,"body":"they should absolutely balance around high elo, just think of it.\n\nIf anyone whos low elo plays Meta champs they will get out of low elo and get higher elo, so everyone who doesn't play meta champs or just don't get higher elo obviously don't care about their rank and rather want to have fun, so they probably wouldn't even mind it?","replies":[]}]},{"poster":"N0t even Cl0ne","date":"2019-07-23T21:30:05.843+0000","up_votes":1,"down_votes":7,"body":"Really cool that people just downvote this without writing anything about why, just sayin","replies":[]}]}