{"poster":"Hi Im shaCocaiNe","date":"2015-11-28T11:34:33.257+0000","title":"Troller im Champselect","subforum":"Spielerverhalten & Moderation","up_votes":2,"down_votes":6,"body":"Ich habe mit ein paar Freunden ein gechilltes Normal gestartet, wir gehen in die Lobby und schreiben unsere Positionen. Nat&uuml;rlich gibt&#039;s immer wieder mal Troller die dann instalocken usw. aber eine Person hat einfach mal nichts gepickt. Nach f&uuml;nfzig Sekunden pickt sie auf einmal Kindred im Jgl, obwohl ich schon Jgl war und trollt und geht nach lvl 7 afk. N&auml;chstes game schreibe ich wieder Jgl, Random instalockt Lee Sin Jgl. Community ist das euer Ernst?","replies":[{"poster":"Bocherto","date":"2015-11-28T12:45:46.675+0000","up_votes":6,"down_votes":1,"body":"Teambuilder.","replies":[]},{"poster":"aRated","date":"2015-11-29T16:50:00.170+0000","up_votes":5,"down_votes":1,"body":"Also mein persönlicher Favorit ist der Troller T4. Im Gelände der König und auch auf der Straße kann er sich sehen lassen.\n\nhttp://www.motorstown.com/images/troller-diesel-01.jpg","replies":[]},{"poster":"Daivarax","date":"2015-11-30T09:12:46.546+0000","up_votes":2,"down_votes":1,"body":"Teambuilder auch bald im Solo ranken?","replies":[{"poster":"4 R4nd0m N008","date":"2015-11-30T09:37:13.735+0000","up_votes":3,"down_votes":0,"body":"Ja, kommt bald.","replies":[]}]},{"poster":"Zulwar","date":"2015-11-30T09:24:00.606+0000","up_votes":2,"down_votes":0,"body":"Den einzigen Verstoß von Kindred sehe ich das AFK gehen. Ansonsten kein Verstoß zu verzeichnen und über Lee und du nichts näher beschrieben.","replies":[]},{"poster":"Crounty","date":"2015-11-28T12:51:08.226+0000","up_votes":3,"down_votes":2,"body":"Auf welche Troller triffst du denn genau? Also ich hab noch nie einen gesehen, aber vieles von denen gehört. Mir persönlich gefällt der neue Troller T4.\n\nhttp://www.troller.com.br/\n\nBtw: Die Zeit vor Teambuilder war schlimmer, da hat jeder rumgeheult dass es nur Trolle gab und jeder in Normal instalockt UND wünschten sich Teambuilder dass es solche Probleme nicht mehr gibt. Jetzt wo es Teambuilder gibt, heulen immernoch welche rum dass es Trolle in Normals gibt, obwohl Riot genau deswegen Teambuilder erstellt hat UND veröffentlicht hat. Also was wollt ihr denn noch in den Arsch geschoben bekommen? Wenn du keine Trolle in der Champselect willst dann spiel in Teambuilder, denn dafür existiert das auch.","replies":[]},{"poster":"Revilous","date":"2015-11-28T11:52:29.788+0000","up_votes":2,"down_votes":3,"body":"Was hast du denn gegen Duo Jungle?{{sticker:slayer-jinx-wink}}","replies":[{"poster":"Hi Im shaCocaiNe","date":"2015-11-30T12:56:49.993+0000","up_votes":1,"down_votes":1,"body":"Eigentlich nix, das Problem war sie hat alles gelasthittet  ^^","replies":[]}]},{"poster":"Epic Melons","date":"2015-11-29T17:14:22.461+0000","up_votes":1,"down_votes":1,"body":"Ja, dass ist unser Ernst {{champion:18}}","replies":[]}]}