{"poster":"Lince Salvaje","date":"2016-05-19T12:56:52.240+0000","title":"Que hacer con los jugadores al final de la partida ?¿","subforum":"Comportamiento del jugador","up_votes":5,"down_votes":0,"body":"Buenas a todos.\r\nme vino la duda ya que me ha pasado varias veces...\r\nles toca partida normal (nadie flamea, nadie trollea) todo normal.\r\nel team enemigo gana la partida pero durante el juego no abrieron la boca, pero al llegar a la pantalla de resultados es donde empiezan a flamear de forma intensa y a joder con izi tutorial  (partida casi de 60 min).... \r\nen esos casos...\r\nque se puede hacer ? el sistema de reportes tiene acceso a el chat del lobby y del final de la partida ? acaso esa tierra es territorio de nadie y podemos flamear como queramos ?\r\nes comprobable y baneable?\r\nalguien sabria responderme  ?&iquest;","replies":[{"poster":"ZanahoriaAsesina","date":"2016-05-19T13:45:30.639+0000","up_votes":1,"down_votes":0,"body":"Podes reportar a alguien que tuvo un comportamiento inaceptable durante la partida pero también en la selección de campeones o en la pantalla de resultados.\n\nTengo entendido que hace unos años el tribunal no guardaba las conversaciones de sala de resultados o de la selección, quiero creer que con la cantidad de jugadores que hay ahora ya empezaron a guardar alguna clase de registro de todo (sean chats,salas,etc).\n\nOjala aparezca un Rojo para aclarar las dudas de todos, de ultima yo cada vez que tengo alguna duda media complicada lo consulto por soporte.\n\nSaludirijillos.","replies":[{"poster":"Ch4puLin","date":"2016-05-19T16:13:48.705+0000","up_votes":2,"down_votes":0,"body":"En su momento habían dicho (@Lyte, ex encargado de comportamiento en NA) que esos logs no estaban en el tribunal para mostrar, pero si los tenían guardados.","replies":[{"poster":"ZanahoriaAsesina","date":"2016-05-20T00:09:27.865+0000","up_votes":1,"down_votes":0,"body":"Gracias por corregirme (:","replies":[]}]},{"poster":"Lince Salvaje","date":"2016-05-19T14:16:28.183+0000","up_votes":1,"down_votes":0,"body":"En teoria debería de quedar guardado.... pero hasta que no este confirmado no  se que hacer.","replies":[]}]},{"poster":"Sirek","date":"2016-05-19T13:27:13.575+0000","up_votes":1,"down_votes":0,"body":"En el reporte colocas \"Jugador se burla en el Lobby\"....","replies":[{"poster":"Lince Salvaje","date":"2016-05-19T13:33:19.168+0000","up_votes":2,"down_votes":0,"body":"entra en conducta antideportiva... pero la duda iria si hay registro de eso...\nporque de no ser asi, que no se pueda comprobar, seria tierra de nadie y mis reportes serian considerados spamm","replies":[{"poster":"Sirek","date":"2016-05-19T14:20:18.488+0000","up_votes":2,"down_votes":0,"body":"Yep, entra en esa categoría, ahora, no se si Riot tiene los ChatLog de los Lobby (aunque muchos han dicho que si lo tiene).  Por lo menos en lo personal reporto hasta los de mi equipo cuando se empiezan a burlar en el Lobby (Aunque sean premades xD)","replies":[]}]}]},{"poster":"Shion Archimago","date":"2016-05-19T13:32:46.516+0000","up_votes":2,"down_votes":1,"body":"ni idea si funciona pero por las dudas reporto de todas formas y le pongo \"dice gg easy very tutorial en la pantalla de resultados\" o algo asi","replies":[]},{"poster":"Mazer Rakham","date":"2016-05-19T23:34:11.743+0000","up_votes":1,"down_votes":0,"body":"Si mal no recuerdo esto lo había aclarado Exca una vez. Si, guardan los registros de chat de selección y final de partida. La cuestión es que cuando reportes aclares en donde fue así les facilitas el trabajo y lo encuentran mas rapido. Entonces, cuando te pase eso, aclara dónde fue y el motivo del report. Mientras más datos des, mejor.","replies":[]},{"poster":"Icesoul","date":"2016-05-19T16:49:49.753+0000","up_votes":1,"down_votes":0,"body":"No guardan el historial del lobby por lo que tengo entendido lamentablemente :/","replies":[]},{"poster":"lordeman10","date":"2016-05-19T15:28:03.259+0000","up_votes":1,"down_votes":0,"body":"yo copio y pego la conversación queda algo así el reporte\n\n> dijo esto en el aftergame: \n> jugadorX: sos un @@~@~#|#\n> jugadorX: soraka de @@~€€@¬\n> jugadorX: te quedaste toda la partida en el |@#~€€@\n> jugadorX: y por eso me mori 24 veces hijo de @~@#@#@#","replies":[]},{"poster":"Kamen Rider Woz","date":"2016-05-19T13:09:56.896+0000","up_votes":1,"down_votes":0,"body":"yo igual aunque no digan nada durante la partida, las acciones dicen mas que las palabras, y respecto a lo del lobby pone una explicacion de lo que dijeron en ese chat no se colocando al final \"paso en el lobby\", igual ellos deben tener todos los logs de todas las partidas, chat de juego, pick y lobby supongo.","replies":[]},{"poster":"BUSCANDO A JORGE","date":"2016-05-19T13:00:58.383+0000","up_votes":1,"down_votes":5,"body":"Pero que lince intergalactico loco.","replies":[]}]}