{"poster":"Lince Salvaje","date":"2016-12-08T14:03:50.098+0000","title":"De quien es la culpa ?","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"Quiero dejarles una partida para analizar y decir de donde viene la culpa....\r\n\r\nhttp://matchhistory.las.leagueoflegends.com/es/#match-details/LA2/400206751/200836904?tab=overview&amp;participant=1\r\n\r\nSi bien se que es un juego en equipo y que todos tenemos un poco de culpa.... el  duo de bot todo el tiempo estaba ech&aacute;ndole la culpa a alguien...\r\nLes dejo la partida para que &quot;analicen&quot; ustedes mismos y decidan quien tuvo mayor culpa.\r\nPara aclarar: Blits se peleo con tristana, vendio todo lo de supp se compro ap y se fue a top con malphite al minuto 12.\r\nNADIE subio a compensar el campeo de blits.\r\ny un 45% del da&ntilde;o total del team es mio....\r\nademas de mf jugaba a mele contra amumu porque seg&uacute;n su l&oacute;gica da igual la distancia es amumu y se puede acercar f&aacute;cil para que se va a alejar.\r\npero bueno analicen ustedes y saquen conclusiones","replies":[{"poster":"Ks Erwyn","date":"2016-12-08T15:56:48.283+0000","up_votes":1,"down_votes":0,"body":"Vi wardeo poco y nada, y en este meta debió hacerse una fiesta a costa del early de Amumu, wardeando su jg para rastrearlo y contragankearlo, zed murió una sola vez en linea(a pesar de no saber buildearse XD)  y sus restante muertes se dieron cuando hizo roam o roto a ayudar, pero gano muy poco oro en general. Se pierde por la suma consecutivas de varios errores propios y en conjuro\n\nDraftear mal tmb hace perder partidas, mientras la compo rival esta balanceada y cada champ potenciaba las habilidades y compensaba las debilidades del otro, tu compo se basaba mucho en cazar de a un individuo ,carecían de poder de desengage contra un team fuerte en TFs y con capacidad de chase.A partir de cierto min. se denota como se volvieron claves tanto {{champion:32}} como {{champion:54}} participando en un 60% de las muerte rivales de su equipo.\n\nSi hay que recalcar algo tuyo en particular, te moriste 2 veces en un lapso de 1 min al mismo tiempo que tu team perdió 2 torres.","replies":[]},{"poster":"9081913DEL1","date":"2016-12-08T14:21:06.703+0000","up_votes":1,"down_votes":0,"body":"Por que zed top?\nEn si yo creo que fallo la composicion, vi.... osea no esta mal pero contra ese grupo de campeones no tienen como cortar un engaje y basicamente ninguno es buen tank, salvo la vi que igual iba a buildear ad.\n\nLa idea de elise soporte, no es mala y en duo puede funcionar. O te puede salir tremendamente mal, ambos champs con mal inicio son muy blandos.\nPor que fuiste karth? Hubiera pickeado algo con cc mas claro, como un aurelion o algo de eso. El zed no me convence, a quien le vas a hacer el pick up? \nIgual no te vendria mal comprar un ward de control de vez en cuando ;)\nSaludos.","replies":[{"poster":"Lince Salvaje","date":"2016-12-08T14:49:51.427+0000","up_votes":1,"down_votes":1,"body":"En si, si nos faltaba un tanke.\n\nPor otro lado, el zed es mid, no top.\nel top soy yo karthus.\nfui Karthus por el echo de que me esta dando buenos resultados en top.\ntiene buen daño, no es tan propenso a encontrarse asesinos en esa linea, es bueno en 1 vs 1 y limpiando oleadas, Una ulti global que quita 3/4 de vida al mid, adc y supp.\nTiene algo de cc con rylai y la W lo cual sirve para escapes.\nSi tenes un poco de caderas podes bajarte un tanke solo con la E y un par de Q.\n\nEn cambio en la selección yo era el primer pick. nadie tenia nada marcado asique no sabia con que iba a ir mi team, tampoco se dignaron a hablar por el chat cuando pregunte que iban asique elegí algo con lo que me siento seguro\n\nLo de los centinelas generalmente los compro ._. no se porque no los compre en esa partida, supongo que porque tenia un blits ap en top al min 13 y un malph que se tankeaba la torre con el blits y no podía salir mucho ni agarrar algo de terreno, supongo yo.\n\nigualmente creo que bot debería habar aprovechado mas la ventaja de 2 vs 1 que tenían...","replies":[]}]}]}