{"poster":"NG Drakuboy","date":"2015-07-22T12:39:49.564+0000","title":"HUD","subforum":"Melde einen Bug","up_votes":1,"down_votes":1,"body":"Warum sind Rankeds nicht davon betroffen?","replies":[{"poster":"OSaftKiller","date":"2015-07-22T12:42:21.824+0000","up_votes":1,"down_votes":2,"body":"Damit die Leute Zeit haben, sich an das neue zu gewöhnen und Ranked Games nicht durch die noch fehlende Übersicht der Leute negative beeinflusst werden.\n\nDas neue HUD ist an sich übersichtlicher als das alte, aber man braucht Zeit um die neue Übersicht für sich selber auch zu bekommen. Derzeit bin ich noch etwas hilflos meinen Bildschirm im Spiel nach den Informationen die ich brauche am ab Croosen, bzw., hab halt noch Schwierigkeiten mit dem HUD.:D","replies":[{"poster":"NG Drakuboy","date":"2015-07-22T12:43:40.963+0000","up_votes":1,"down_votes":0,"body":"Hast ja Recht, bei mir ist es genauso. Dennoch spiele ich ausschließlich Rankeds, was mir das gewoehnen daran nicht grade erleichtert :P","replies":[{"poster":"OSaftKiller","date":"2015-07-22T12:44:57.695+0000","up_votes":1,"down_votes":1,"body":"Spiel erst mal normals, kann ja nicht Schaden. Mach ich derzeit auch. Ansonsten wirst du nachher erschlagen wenn das neue HUD in die Rankeds kommst, hast du Free down Elo.;):D","replies":[{"poster":"NG Drakuboy","date":"2015-07-22T12:46:11.029+0000","up_votes":1,"down_votes":1,"body":"Ja, ich glaube das einzige Problem ist, das so viel auf einem Fleck ist, aber wird schon ^^","replies":[{"poster":"OSaftKiller","date":"2015-07-22T12:49:31.955+0000","up_votes":1,"down_votes":1,"body":"Ich finde es super das alles auf einem Flechk ist, jetzt muss ich nicht mehr nach links und recht hin und her schauen. Mein großes Problem mit dem neuen Patch ist eigentlich nur, das immer angesagt wird, wenn der Gegner den Drake oder Baron gemacht hat. Man braucht was diese beiden Objektives angeht jetzt kaum noch überlegen. Glaub der Timer wird auch immer aktualisiert, selbst wenn man keine Vision auf den Drake oder Baron hatte, wenn die Gegner den gemacht haben.","replies":[]}]}]}]}]},{"poster":"KingxOfxHeaven","date":"2015-07-22T13:02:53.316+0000","up_votes":1,"down_votes":1,"body":"Ich hoffe nur, dass die nicht solange mit dem Übergang warten (also mit dem Übernehmen in Rankeds).\nEinfach aus dem Grund: Wenn man nun eine Woche normals gespielt hat und man damit nun vertraut ist, man dann aber ein Ranked startet nach einer Woche muss man sich sofort wieder umstellen, was zur Verwirung führen könnte mMn.","replies":[]}]}