{"poster":"Toomindu","date":"2016-06-23T18:40:28.346+0000","title":"Vayne only? Hier die (lvl 7) Tipps die ich für mich selbst gefunden habe!","subforum":"Champions & Gameplay","up_votes":1,"down_votes":1,"body":"Hallo Beschw&ouml;rer!\r\nIch gehe hier mal ein wenig auf meine Erfahrung ein mit Vayne, ich werde unter anderem &uuml;ber top Vayne, jungle Vayne aber auch adc Vayne reden.\r\n\r\nSo, fange ich mal mit Vayne im generellen an. Ich bin zwar kein Gosu oder ein Challenger, trotzdem habe ich Erfahrung gesammelt. Ich mag es, Vayne &uuml;verwiegend auf attackspeed zu spielen, aber ich gehe jetzt einfach auf die Top-Vayne ein.\r\n\r\nTop-{{champion:67}} \r\n\r\nAlso, es gibt auf der top lane jede menge an Champs, aber ich mach jetzt mal so 2 matchups wo ich etwas dr&uuml;ber sage\r\n1. Matchup: {{champion:67}} vs {{champion:69}} \r\n    Dieses matchup hat mir sehr Spa&szlig; bereitet und ich m&ouml;chte zum einem noch mal klar stellen, dass Cassiopeia unmobil ist und ohne {{summoner:4}} SEHR leicht zu ganken oder zu t&ouml;ten ist. Also, die langsame Schlange kann man ganz einfach countern: {{item:3078}} , das ist es (man kann auch ein {{item:3022}} einbauen, habe ich jetzt aber in dem match nicht gemacht). Btw., ich baue {{item:3044}} -&gt; {{item:3153}} -&gt; {{item:3078}} und dann einfach attack Speed oder anderes. \r\n\r\n2. Matchup: {{champion:67}} vs {{champion:86}} \r\n  Schnell gesagt: Langsam und einfach zu kiten. der Itembuild ist jetzt nicht gro&szlig;&szlig;artig anders, aber man kann eher auf einen {{item:3071}} zur&uuml;ckgreifen, denn armor pen is gegen einen tank, der sogar Cloth armor first war, sehr gut. {{item:3022}} ist hier ebenfalls eine Option.\r\n\r\nVayne Jungle (ich habe keine gro&szlig;e Erfahrung, deswegen nur kurzes)\r\nStarten sollte man mit der w, und auf jeden fall den Support bitten 2 oder 3 hits zu tanken oder ein hard-pull einfordern.\r\n\r\nVayne ADC\r\nIch selber bin kein gro&szlig;er fan, weil vayne erst im lategame zur Geltung kommt wenn das early nicht zischt. Wenn man also ein supp hat, der passiv spielt, und man jetzt nicht ne Schlafm&uuml;tze als Gegner hat, dauert es mit dem Powerspike lange. Aber gute Synergy habe ich trotzdem gefunden: Bard, weil man ganz einfach, wenn der Gegner an einer Wand steht, nicht wegkommt, aber auch Leona, die viel cc mitbringt und somit den adc im Gegnerteam schnell cc&#039;n kann.\r\n\r\nSch&ouml;n, ich hoffe ich habe euch etwas mit auf den Weg gegeben,\r\nGr&uuml;&szlig;e und viel Spa&szlig; beim Vayne spielen in der Kluft :) !\r\n\r\nPs. Die matchups auf top sind nur Beispiele, es gibt nat&uuml;rlich viele andere und Cassiopeia sieht man nicht jeden Tag ;)","replies":[{"poster":"Vint","date":"2016-06-24T11:10:05.040+0000","up_votes":1,"down_votes":0,"body":"Vote4sticky","replies":[]},{"poster":" 4 sec too late","date":"2016-06-24T08:25:34.467+0000","up_votes":1,"down_votes":0,"body":"Naja hilfreich ist es für mich als kompletter adc noob nicht gewesen ;p\n\nAber etwas Arbeit und es könnte was werden ^.\n\nZunot einfach die Mobafire guides heranziehen","replies":[]},{"poster":"I love you Malon","date":"2016-06-23T20:37:53.016+0000","up_votes":1,"down_votes":0,"body":"mit tipps dachte ich eher an Mechanics ... aber key ...","replies":[]},{"poster":"AI RealSuperSand","date":"2016-06-23T20:01:20.883+0000","up_votes":1,"down_votes":0,"body":"hilft mir auf jeden fall super auf meinen vayne vs cassio lanes. und wer hätte gedacht, dass man im jungle gerne pulls hätte und mit dps startet...\nwieder was gelernt.","replies":[]}]}