{"poster":"GabrielARG","date":"2017-07-14T06:20:12.986+0000","title":"Problemas de conexión en el sur de Argentina.","subforum":"Problemas Técnicos","embed":{"description":"Hola!","url":"https://boards.las.leagueoflegends.com/es/c/charlas-generales/nXUEE9Xg-presentacian-e-informacian-proyecto-mudanza-de-servidor-las-de-santiago-a-buenos-aires-opiniones","image":"https://cdn.leagueoflegends.com/apollo/assets/vb/boards-wallpaper.jpg"},"up_votes":2,"down_votes":0,"body":"Le&iacute; completo el post del enlace y me parece una muy buena idea para mejorar la conexi&oacute;n no solo de Argentina, tambi&eacute;n de Uruguay y Paraguay. \r\nNo tengo nada personal para decir que el post indicado no haya dicho, concuerdo por completo.","replies":[{"poster":"Armo pelopinchos","date":"2017-07-14T12:59:17.145+0000","up_votes":1,"down_votes":0,"body":"Gabriel, hola! Podría ser un problema de tu empresa de internet (según las rutas que estén tomando a determinadas horas para enviar paquetes al servidor).\n\nTengo un amigo que Santa Cruz que tiene contratado AR-LINK (creo que se llama así) y tiene el mismo problema.\n\nMe quedo pendiente esperando más info Gabriel, abrazo grande.","replies":[{"poster":"GabrielARG","date":"2017-07-19T21:20:11.374+0000","up_votes":1,"down_votes":0,"body":"Sin duda es el proveedor de internet, tengo amigos en mi ciudad con mi mismo internet y sufren del mismo problema, pero me ah pasado en partidas donde me sube el ms, lo digo en el chat y a varios jugadores también les pasa, o sea que no es solo aquí.","replies":[]}]},{"poster":"Vaendrys","date":"2017-07-14T06:27:35.998+0000","up_votes":1,"down_votes":0,"body":"Dudo que funcione mejor. Soy de Uruguay y me va perfecto en ms, no creo que pueda mejorar.","replies":[{"poster":"GabrielARG","date":"2017-07-14T06:41:41.757+0000","up_votes":1,"down_votes":0,"body":"Eso en tu caso, en el caso de miles de jugadores de Argentina y algunos de Uru, Par y Bol (mas frecuente en el sur de Argentina) sufren de subidas de latencia repentinas, 260 o 300 ms es mas común en mi caso.","replies":[{"poster":"Vaendrys","date":"2017-07-14T06:51:48.019+0000","up_votes":1,"down_votes":0,"body":"En Uruguay dudo, tengo contratados uno de los peores planes de Antel, no me instalaron fibra optica, y se chorrean los cables cada nada, hasta las conexiones brindadas en liceos es mejor que la mia xD\nIgual por temas de infraestructura, y principalmente de economia(No es que Argentina sea precisamente estable economicamente) dudo que lo hagan.","replies":[]}]}]}]}