{"poster":"Tuningwolle","date":"2017-02-03T21:24:49.780+0000","title":"Bots oder Scripting","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":3,"body":"Hallo Forum,\r\n\r\nich bin relativ gefrustet. Seit ca 2 Wochen passiert es mir immer wieder, dass ich in einem Kooperativen Spiel mit Teamkollegen lande, die nicht auf den Chat reagieren. So weit so gut, machen manche halt nicht. jetzt ist es aber so, dass diese Kollegen keine Masteries besitzen, komische Itemkombinationen kaufen und was das nervigste ist: FEEDEN wie bl&ouml;d. Mit nem Kumpel zusammen und einem dieser &quot;Bots&quot; ist das ja ganz sch&ouml;n, da kann man sich absprechen und koordinieren. Aber wenn man alleine mit zwei diesen &quot;Bots&quot; im Team ist, dann kann man machen was man will. Es zerst&ouml;rt mir einfach das Spiel...\r\n\r\nEs geht mir einfach darum, dass RIOT bitte sich besser darum k&uuml;mmert, dass automatisierte Spieler, &quot;Bots&quot;, Scripte, wie auch immer, nicht mehr mit echten Spielern gemischt werden sollen. So schwer kann das doch nicht sein...","replies":[{"poster":"Sałtyy","date":"2017-02-03T21:55:48.061+0000","up_votes":1,"down_votes":0,"body":"DU meinst bot games oder?\nIch versteh das Problem nicht, du bist lvl 30, du gewinnst das doch eh 1 vs 5 xDD\n\nBot accs werden aber meist eh gebannt ^^","replies":[{"poster":"OPChampsSucks","date":"2017-02-03T22:17:06.462+0000","up_votes":1,"down_votes":0,"body":"Gegen gefeedete normal bots 1v5 ist ziemlich schwer auch locker für nen platin aufwärts","replies":[{"poster":"CYPHΕR","date":"2017-02-06T13:32:13.256+0000","up_votes":1,"down_votes":0,"body":"Also ich spiele mit allen möglichen Champs die ich sonst überhaupt nie spiele ohne Probleme 1v5 gegen Bots (z.B. wenn ich noch auf Mitspieler warten muss die aber bereits Ingame sind). Meist zögere ich das Spiel noch absichtlich über die normalen 20-25 Minuten hinaus und setze mir alternative Sieg-Bedingungen wie \"es dürfen nur Minions getötet werden\" oder \"Pushen nur durch ZZ und Banner\" oder ähnliches, damit die Matches nicht zu langweilig werden.\n\nWer wirklich auf Win 1v5 gegen Bots spielt sollte das innerhalb von 15-20 Minuten locker schaffen, da die Bots kaum Gegenwehr leisten und man nach 10 Min Laning so an XP und Gold ordentlich ahead sein sollte (selbst ohne Kills).","replies":[]},{"poster":"Balmung","date":"2017-02-05T13:43:58.298+0000","up_votes":1,"down_votes":0,"body":"Nicht wirklich. Bots lassen sich extrem leicht manipulieren und einzeln picken, dafür muss man nur deren Verhaltensmuster ein wenig kennen, was sich nach ein paar Games eingestellt haben sollte.","replies":[]},{"poster":"Sałtyy","date":"2017-02-04T11:39:05.858+0000","up_votes":1,"down_votes":0,"body":"Jein, kommt halt auf den Champ an, aber ich finde meist is man eh so gefeedet, dass es nicht stört oder?","replies":[]}]}]},{"poster":"antitomatexd","date":"2017-02-03T21:58:24.330+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"OPChampsSucks","date":"2017-02-03T22:16:18.214+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=banned bec flame,realm=EUW,application-id=KYnfKGf0,discussion-id=gsshYyXE,comment-id=0001,timestamp=2017-02-03T21:58:24.330+0000)\n>\n> Feeder gibt es immer...man muss halt carryen! Scripten ist immer obvious wenn Sie autododge haben und dann werden Sie auch schnell gebannt. \n> Rito kümmert sich schon um Scripter und ich glaube nicht das der Gegner in deiner Elo immer scripted.\n\nNix lesen gelernt in der Schule du hast. Wenn du n Kommentar schreibst dann versteh erstmal den Text auf den du antwortest","replies":[]}]}]}