{"poster":"TimFromAccountng","date":"2015-02-01T11:15:03.533+0000","title":"Make you favourate Game/Anime champ","subforum":"Miscellaneous","up_votes":3,"down_votes":0,"body":"**Rock Lee, The Ninja?**\r\n\r\nHe wants to prove that despite he has no special ability's, he can be a Ninja just like Shen/Akali/Zed/Kennen.\r\nWhen vs a Ninja Champ he'd get a little buff ; **Determined**- Rock Lee must prove his way of the Ninja. +1 AD\r\n\r\n**Passive: Cherished  Student**\r\n\r\nUpon reaching 1 HP Gai (his sensei) appears, refusing to let anybody kill his cherished student. (Anivia/Zac style passive). Granting Rock Lee some time to recover.\r\n\r\nPassive: every 3rd auto attack against the same target heals rock lee for  26 / 32 / 38 / 44 / 50 (+ 70% AP)\r\nSustain aimed to be like xin's in effectiveness.\r\n\r\n**Q. Dynamic Entry!\r\nRange: 600 \r\nCD: 12 secs**\r\n\r\n\r\nRock Lee fly kicks, closing the gap on a target hitting it for 5/7/10/12/15% of max health + (100% Bonus AD) slowing the enemy by 40%.\r\n**Dynamic Entry can only be used while out of combat.**\r\n\r\n**W. Springtime of Youth CD: 6/6/5/5/4**\r\n\r\n\r\nEpowers Rock Lee's next AA, 20/60/80/100/120 (+10% Bonus AD)\r\nRock Lee gains attack 20/25/30/35/40% attack speed. (AA reset)\r\n\r\n**E. Leaf Tornado CD 16/14/12/11/10**\r\n\r\n\r\nRocklee sweaps the legs out from his opponents, knocking up all opponents around him. Doing 60/90/120/150/180 + (90% Bonus Attack Damage).(small knockup, not alistar/malph size)\r\n\r\n**R. Open the gates.\r\nCD: 100/80/65secs**\r\n\r\n\r\nRock lee pushes his body beyond its natural limits, granting him bonus 25/30/40 AD and movement speed 10/15/20% lasting 10 secs, Gains Primary Lotus ability.\r\n\r\n**Primary Lotus:**\r\n\r\nRock lee knocks the target up, pushing his body to the point of breaking he follows the target delivering a devistating combo. 400/600/800 damage + (150% Attack Damage).\r\nAfter using primrary lotus Rock Lee's is completely fatigued. Applying fatigued debuff to himself, slowing movement speed by 90% and reducing damage by 50% for 10 seconds.\r\n\r\nThis kit is aimed at jungle, early ganking style similar to lee/xin. Being able to use his revive passive for safer dives.\r\nHe has some sustain in his passive and attack speed to help survive the harsh jungle.\r\nHis Q can only be activated if he is out of combat, this is aimed at giving him a weakness so ranged/poke teams are able to abuse this.\r\n\r\nHe could also top lane, but would be best used as a counter pick as ranged champs who could keep him in combat such as Kennen/Gnar or Moakai would deny him his gap closer.\r\n\r\nHis ultimate applys a hefty debuff so Rock Lee players would use it when they are sure it's a 1v1. We believe this will seperate good Rock Lee players from the great. :P\r\n\r\nI'd imagine he would build similar to Lee sin, 1-2 damage items usually or he would become paper. However QSS synergises well with his ult as he  could remove his fatigue debuff which I think makes him somewhat unique. Sheen effects would work well.\r\n\r\nHe's a good ally for Yasuo who could use his windwall to keep him from behing poked and put into combat. Also Rock Lee can setup Yasuo ults with his E.\r\n\r\n\r\nMy numbers might be too much/not enough but thats easily balaced..right?\r\nI did try to compare his spells to similar spells to get an idea for damage, but comparing spells individually and not as a whole can lead to a kit that has too high/low damage.\r\n\r\nOh a little easter egg quote, When he first see's an enemy/Ally Ahri he'd say \"huh.. 9 tails..Fox? No that's Impossible\"","replies":[{"poster":"Fog","date":"2015-02-01T21:58:34.099+0000","up_votes":2,"down_votes":0,"body":"Yuuki Asuna / Asuna Fiora.\n\nDuelist\t\n\t\nAsuna regenerates 400 + (Asuna's level) health over 6 seconds each time she deals damage. Striking champions will cause this effect to stack up to 4 times.\n\nLunge\tRANGE: 600 COST: 10 MANA COOLDOWN: 16 / 10 / 8 / 4 / 0\nACTIVE: Asuna dashes forward to strike her target, dealing tons of damage. Asuna can perform the dash a second time within 4 seconds at no mana cost.\n\nRiposte\tCOST: 10 MANA COOLDOWN: 10 / 9 / 8 / 4 / 0\nPASSIVE: Asuna's attack damage is increased ten fold.\nATTACK DAMAGE: 21 / 69 / 100 / 666 / 9000\nACTIVE: Asuna parries the next basic attack within 1.5 seconds and deals tons of magic damage to the attacker. Works against champions, large monsters, and large minions, Dazza, Bazza, turrets, fountain.\n\nBurst of Speed\tCOST: 5 MANA COOLDOWN: 10 / 9 / 7 / 5 / 0\nACTIVE: Asuna temporarily gains additional Attack Speed for 60 seconds. Each basic attack or  Lunge she lands during this time increases her Movement Speed for 60 seconds, stacking up to 100 times.\nKilling a champion refreshes the cooldown on Burst of Speed. Assists reduce the cooldown by half of the base amount.\n\n\nBlade Waltz\tRANGE: 13000 COST: 10 MANA COOLDOWN: 60 / 30 / 0\nACTIVE: Asuna dashes around the battlefield — becoming an immortal object in the process — dealing tons of damage to random enemy champion(s) 9000 times. Hits against the same target deal 400% damage. The first and last attack will be against the same target. Each strike applies every effect in the game.","replies":[{"poster":"Dawaraven","date":"2015-02-02T04:16:11.360+0000","up_votes":1,"down_votes":0,"body":"Sounds kinda like ryze kit!","replies":[]}]},{"poster":"Knuuckles","date":"2015-02-02T03:00:07.204+0000","up_votes":1,"down_votes":0,"body":"there are a lot of semi copyrighted champs/skins but blatantly taking a character from a prestigious anime like naruto would either be a massive law suit or would cost riot a LOT of money to get the rights to, which im sure is not worth it to please the minimal fan base","replies":[{"poster":"Fog","date":"2015-02-02T03:26:15.701+0000","up_votes":1,"down_votes":0,"body":"You mean like Grey Veigar and King Rammus. Obviously no relation there.","replies":[{"poster":"Dawaraven","date":"2015-02-02T04:17:17.606+0000","up_votes":1,"down_votes":0,"body":"wtf is grey veigar meant to reference? Fairy tail?","replies":[{"poster":"Knuuckles","date":"2015-02-02T22:14:09.477+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Dawaraven,realm=OCE,application-id=Ntey9fRZ,discussion-id=EEEPbEAj,comment-id=000300000000,timestamp=2015-02-02T04:17:17.606+0000)\n>\n> wtf is grey veigar meant to reference? Fairy tail?\n\nyou need to stay in more","replies":[{"poster":"Dawaraven","date":"2015-02-03T00:04:12.903+0000","up_votes":1,"down_votes":0,"body":"That was obvious b8","replies":[]}]},{"poster":"Fog","date":"2015-02-02T08:30:16.209+0000","up_votes":1,"down_votes":0,"body":"Greybeard Veigar.","replies":[]}]}]}]},{"poster":"Project Xayah","date":"2015-02-02T09:17:40.430+0000","up_votes":1,"down_votes":0,"body":"I know it wont happen but I'll join in. Keep in mind I didn't put much time into it though.\n\n**Monkey D. Luffy** - **King Of The Pirates**\n\n**Passive: Rubber Man** - Luffy is made of rubber giving him greater resistance to physical attacks. *(small armour buff per level)*\n\n**Q: Gum Gum Pistol** - Luffy stretches his arm backwards then hurls it forwards, damaging and knocking back enemies hit. *(minions and monsters knocked back, stops on first enemy champion hit with slight knockback)*\n\n**W: Gum Gum Gatling** - Luffy makes quick repetitive punches with both arms, damaging enemies in a cone in front of him over time. *(similar to Pantheon's Heartseeker Strike)*\n\n**E: Armament** - Luffy is able to empower his attacks, dealing additional damage for each strike. *(toggle ability, drains resource or health while active)*\n\n**R: Second Gear** - Luffy increases blood flow in his body, becoming empowered at the expense of his health. *(toggle ability, drains health while active, small bonus to movespeed, damage and attack speed while active)*","replies":[]},{"poster":"GoldenTomat0","date":"2015-02-01T11:40:15.965+0000","up_votes":1,"down_votes":0,"body":"you have %%%% taste in anime.\n\n\n\n**Inferno cop, Inferno cop**\n\nPassive: **Immunity**\n\nInferno cop is immune to all damage\n\nq: **gun**\n\nInferno cop fires his gun, instantly killing whoever it targers\n\nw: **Purgatory flame**\n\nInferno cop deals 50% of his enemies max hp to the enemies directly infront of him.\n\ne: **Team Fire**\n\nInferno cop summons Hellfire boy and Mecha cop to stun all his enemies.\n\nr: **Inferno Car**\n\nInferno cop transforms into a car, gaining a 500% ap, ad, armour, magic resist, hp regen, mana regen, and movement speed boost.","replies":[{"poster":"Slim Chaedi","date":"2015-02-01T20:49:11.610+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=GoldenTomat0,realm=OCE,application-id=Ntey9fRZ,discussion-id=EEEPbEAj,comment-id=0000,timestamp=2015-02-01T11:40:15.965+0000)\n>\n> you have %%%% taste in anime.\n> \n> \n> \n> **Inferno cop, Inferno cop**\n> \n> Passive: **Immunity**\n> \n> Inferno cop is immune to all damage\n> \n> q: **gun**\n> \n> Inferno cop fires his gun, instantly killing whoever it targers\n> \n> w: **Purgatory flame**\n> \n> Inferno cop deals 50% of his enemies max hp to the enemies directly infront of him.\n> \n> e: **Team Fire**\n> \n> Inferno cop summons Hellfire boy and Mecha cop to stun all his enemies.\n> \n> r: **Inferno Car**\n> \n> Inferno cop transforms into a car, gaining a 500% ap, ad, armour, magic resist, hp regen, mana regen, and movement speed boost.\n\nGandalf, The %%%%ing Wizard\n\nPassive: You Shall Not Pass\nHoly %%%% what the %%%%, you can't walk into his team's base to fight the Nexus, what is this?\n\nQ: Gandalf's Fire Blast\nWow, its fire. You burn someone and they die.\n\nW: Charm\nIts like Ahri's, but locks on and is global because %%%% Gandalf is sexy.\n\nE: Adventure\nFor some reason you can convince Yordles on the enemy team to get dragon for you.\n\nR: The Two Towers\nGandalf makes Two Towers and they can't be destroyed. Wherever he wants. I know that makes no sense but I had to fit in the name of one of the books somewhere.\n\nI think mine counters yours.","replies":[]},{"poster":"TimFromAccountng","date":"2015-02-01T11:52:45.253+0000","up_votes":1,"down_votes":0,"body":"I dunno, that movement speed sounds too much.\n\nAlso %%%% you! I don't care if Naruto went to %%%% Rock Lee is still awesome.","replies":[]}]},{"poster":"Dawaraven","date":"2015-02-01T20:19:25.074+0000","up_votes":1,"down_votes":0,"body":"San - all of nidalee abilities. Except change the cat to a wolf.","replies":[]}]}