{"poster":"JustDecibel","date":"2017-09-25T14:54:39.498+0000","title":"Disconnect nur in League of Legends - kein Einzelfall","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Guten Tag, \nund zwar hatte ich Dienstag Nacht, sowie vor ca 40 min folgendes Szenario in einem Spiel. Ich habe mit mehreren Freunden eine runde Lol gespielt. Pl&ouml;tzlich hatte ich, sowie jeweils 1-2 andere Mitspieler (insgesamt 3 Personen in den Spielen) zeitgleich einen Disconnect. Auf die Sekunde genau. Allerdings nur in League of legends. Wir konnten weiterhin Skypen/TS benutzen und Surfen etc. Dieser Disconnect hielt mehrere Minuten an. Bei einem Neustart von Lol war es in dieser Zeit nicht m&ouml;glich wieder ins Spiel zu kommen. Auch nicht sich anzumelden, da keine Verbindung zu den Servern von Lol hergestellt werden konnte. Dieser Dc hielt ca 4 Minuten an, bis wir schlie&szlig;lich wieder Zeitgleich reconnecten konnten. Der Ping war ebenfalls bei allen Stabil. Keine Laggs oder Anzeichen, dass Internet Probleme bestehen. Der Gedanke, dass es an den Internetprovider liegen k&ouml;nnte kam uns ebenfalls in den Sinn, allerdings versteh ich nicht ganz, warum wirklich nur in Lol die Verbindung unterbrochen wurde und kein Reconnect m&ouml;glich ist. Des Weiteren f&uuml;hrte der erste Fall dazu, dass es zu einer Que mit einer geringeren Priorit&auml;t erhalten habe. Diese wurde jetzt verl&auml;ngert. \nIch selbst habe keine Idee wie ich das Problem l&ouml;sen kann, da ich effektiv keine Schuld habe, dass es &uuml;berhaupt aufgetreten ist, ich kein Einzelfall bin  und es auch nicht in jedem Spiel passiert, sondern scheinbar jederzeit aus dem nicht passieren kann. \nVielleicht hat hier jemand den gleichen Fall erlebt, eine L&ouml;sung parat oder Riot wird einfach informiert, dass Probleme mit einem Provider oder ihren Servern bestehen. \n\nEDIT: \nInternet Provider: Mnet\nWindows 10 - Home 64 bit\nLol sowie Windows vor 4 Tagen neu Installiert\n\nNetzwerk-Log-Ergebnis von: https://support.riotgames.com/hc/de/articles/209765743\n\"Du hast während des ganzen Spiels kein Paket verloren, was auf eine sehr stabile Verbindung hinweist.\"\n\n\nMit freundlichen Gr&uuml;&szlig;en","replies":[{"poster":"Gin","date":"2017-09-26T06:42:28.067+0000","up_votes":1,"down_votes":0,"body":"Du kannst in den [folgenden Beitrag](https://support.riotgames.com/hc/de/articles/201752664-Fehlerbehebung-bei-Verbindungsproblemen) mal reinschauen.\n\nProbiere dort mal folgende Punkte aus:\n\n* Firewall-Fehlersuche\n* Port-Forwarding\n* VPN- und Proxy-Verwendung\n* IP-Erneuerung und DNS-Leerung\n\nZusätzlich kannst du noch probieren den Client als Administrator auszuführen und dein Antivirusprogramm vorübergehen zu deaktivieren um es anschließend nochmal zu probieren.\n\nSolltest du irgendeinen Fehlercode oder eine Fehlermeldung bekommen, wären diese auch hilfreich.","replies":[{"poster":"JustDecibel","date":"2017-09-26T10:25:41.837+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Gin,realm=EUW,application-id=7hciEY9w,discussion-id=tMEnkRZT,comment-id=0000,timestamp=2017-09-26T06:42:28.067+0000)\n>\n> Du kannst in den [folgenden Beitrag](https://support.riotgames.com/hc/de/articles/201752664-Fehlerbehebung-bei-Verbindungsproblemen) mal reinschauen.\n> \n> Probiere dort mal folgende Punkte aus:\n> \n> * Firewall-Fehlersuche\n> * Port-Forwarding\n> * VPN- und Proxy-Verwendung\n> * IP-Erneuerung und DNS-Leerung\n> \n> Zusätzlich kannst du noch probieren den Client als Administrator auszuführen und dein Antivirusprogramm vorübergehen zu deaktivieren um es anschließend nochmal zu probieren.\n> \n> Solltest du irgendeinen Fehlercode oder eine Fehlermeldung bekommen, wären diese auch hilfreich.\n\nEs erscheint keine Fehlermeldung. Kein Bugsplash. Nichts außer, dass halt keine Verbindung mehr vorliegt wie bei einem DC.\nIch hab kein Virenprogramm drauf, da ich das System erst neu aufgesetzt habe und außer Treibern und Lol nicht installiert/gedownloaded habe. \nDie anderen Vorschläge kann ich leider nicht außprobieren. Ich hatte leider eine 5 min Sperre, da ich letzte Woche einen Bluescreen hatte. Nach dem ersten DC wurden daraus dann 10 min. Diese habe ich runtergespielt (5 Spiele) und nach zwei Spielen kam es wieder zum Serverfehler und ich habe eine 20 min Sperre für 5 Spiele erhalten. Daher kann ich kein Spiel starten um die genannten Vorschläge zu testen. Zum einem, da die Gefahr besteht, dass ich wieder raus fliege und zum anderen ist es absurt 20 min zu warten, weil der Server bzw die Lol-Netzwerkprogrammierung offentsichlich Probleme hat. (siehe inzwischen 6 Beiträge im Forum mit verschiedenen Inet Providern).\n\nTrotzdem danke für deinen Versuch zu helfen. ","replies":[{"poster":"Gin","date":"2017-09-26T12:10:03.301+0000","up_votes":1,"down_votes":0,"body":"Ein Custom Game sollte es auch tun.\n\nUnd das 6 Leute im Forum Probleme mit der Verbindung haben heißt noch gar nichts. \n\nInsbesondere wenn das Problem von Person zu Person variiert, und man bedenkt dass täglich mehrere Millionen Beschwörer das Spiel spielen ohne irgendwelche Probleme spielen - mich eingeschlossen.\n\nIch bin jetzt seit 10 Monaten in Hilfe & Support aktiv unterwegs, und die häufigste Problemursache waren schon immer Probleme mit der Internetverbindung.\n\nFalsch eingestellte Firewalls, Probleme beim Provider, Ports sind gesperrt, eine wackelige WLAN-Verbindung usw.\n\nDas soll nicht heißen dass die Server nie Probleme haben, einfach nur dass du deutlich mehr Beiträge sehen würdest wenn es Probleme mit den Servern oder Lol allgemein gäbe.","replies":[{"poster":"Dr Swiffer","date":"2018-11-03T12:22:42.420+0000","up_votes":1,"down_votes":0,"body":"1 jahr ist der scheiss alt und immernoch haben se nichts dran gemacht XD bekomme das seit ein paar patches kannim ts labern und neben mir kann nen dude sitzen der im selben internet ist und ich bekomme trotzdem nen dc :D ich sehe wie sehr sich mphe gegeben wird um das problem zu beheben !!!","replies":[{"poster":"Gin","date":"2018-11-03T17:12:14.647+0000","up_votes":1,"down_votes":0,"body":"Das Problem in diesem Thread lag - (Zumindest war das meine Vermutung da ja keine weitere Rückmeldung kam was mich darauf schließen lässt dass er das Problem ausfindig machen konnte) - beim Spieler selber.\n\nWenn du Probleme hast ins Spiel zu kommen, dann stimmt etwas mit deinem Setup nicht da mir aktuell keine Störungen bekannt sind. Mögliche Ursachen sind unter anderem: Deine Firewall, die Gameconfig und deine Einstellungen/Settings, eine beschädigte Installation, Antivirus-Programm oder andere Anwendungen funken dazwischen etc. etc.\n\nSo easy es ist Riot für alles zu blamen nur weil man Probleme hat, in diesem Fall musst du bei dir selber schauen was die Ursache des Problemes ist.\n\nAm besten startest du in dem du: \n\n* Dir das [HRT](https://support.riotgames.com/hc/de/articles/224826367-Automatisierte-Fehlerbehebung-Hextech-Repair-Tool) herunterlädst\n* dieses installierst, \n* ausführst, \n* den Haken bei \"Force Repatch setzt,\n* das Programm durchlaufen lässt,\n* und anschließend testest ob es dein Problem behoben hat oder nicht.\n\nSollte es dadurch nicht behoben werden, können wir immerhin schon mal eine fehlerhafte Installation von League ausschließen, sowie eine falsch konfigurierte Firewall.\n\nDas Hextech Repair Tool packt außerdem deine Logs direkt in eine .rar Datei und legt diese auf deinem Desktop ab.\n\nDiese kannst du dann auf einer Filesharing-Seite (Dropbox etc.) deiner Wahl hochladen und ich kann mir diese dann anschauen und mir versuchen daraus zu erschließen wo genau das Problem auftritt und was du machen sollst um dieses zu beheben.\n\n---\n\nIch rate dir allerdings zu deinem Problem einen neuen Thread aufzumachen anstatt diesen weiterhin zu infiltrieren da dein Problem mit dem oben genannten nichts zu tun hat.","replies":[]}]}]}]}]}]}