{"poster":"SunriseSkaterKid","date":"2015-07-16T22:20:35.526+0000","title":"Riven is not Broken and here's why","subforum":"Gameplay","up_votes":8,"down_votes":24,"body":"Riven is not broken, ill give you a few reasons as to why you all think she is the most broken champ ever. (Note: Im not a riven main so dont think im writing this because i love the champ, im simply stating the obvious as to why shes not broken)\r\n\r\n&quot;She snowballs soo hard and does soo much damage&quot; excuse.\r\n\r\nHeres why she snowballs: In your bronze, silver, gold, plat, even low diamond games she gets fed because of one reason: Dumb ass laners. Too commonly i see people say &quot;omg so broken riot nerf please report lol scrub playing ez champ&quot; and that person saying that is playing {{champion:57}} top and their first back was a {{item:1026}} and {{item:1001}}. Why on earth would you be building damage against a champ that is specifically used to nuke squishy champs like Mids and ADC&#039;s. BUILD A {{item:1031}}. There&#039;s a reason why armor is a direct counter to a riven. How on earth will a riven do damage to an armored champion when all her abilities do AD damage (hint: She wont do any damage.) Then that same {{champion:57}}  dies in lane 5 times and she gets fed and everyone complains that shes nuking you out which leads me to my next point\r\n\r\nYour team doesn&#039;t know how to play against her\r\n\r\nRiven is a Master Yi type champ, if you let her run past your team and onto your squishes SHE WILL DESTROY THEM THAT&#039;S HER JOB. Is it really that hard for a {{champion:111}} or a {{champion:79}} to just hard CC her? She gets blown the hell up if you just stun her and lock her down LIKE ANY BURST CHAMP. You could literally {{champion:4}} gold card her and in that stun duration your team can 100-0 her and shes out of the fight. \r\n\r\n&quot;But she kills me in 3 seconds as an adc&quot; \r\n\r\nWait.... what? You&#039;re near her as an adc? WHY??! \r\n\r\nThis is such a common complaint. And the simple answer is that you blow at positioning. Why on earth are you even in range of her? All of her abilities have the range of an auto attack, she needs to get close to do damage which also leaves her vulnerable to CC when shes in your back line which leads to an easy kill on her since you can burst her in seconds. Its so easy, if you see a riven running full speed at you JUST KITE! DONT JUST STAND THERE AND TAKE IT. Now i understand if she flashes on top of you that&#039;s something that can be hard to control but still thats about once in every 4 team fights and even then you can flash out of her range and continue to kite. \r\n\r\n&quot;But shes soo op in (Blank) oriented team comp&quot; \r\n\r\nWell, aren&#039;t all champs op in specific team comps? Kogmaw is the best ADC in protect the carry comps, Jayce is op in poke comps, Nautalius is op in hard engage comps, I&#039;m failing to see your point in this excuse. \r\n\r\n Now I do understand that a fed riven can be the most annoying champ but its not that hard to stop her. Can riot tweak her a little bit and change some of her abilities? Of course, they can do that to so many champs to balance the game. Is she as broken as we all think? Not in the slightest,   it comes down to how you play against her. If you let her just run to your backline and kill your carries of course shes op, but if you shut her down early in lane (Build armor), CC her, peel for your carries, etc. I dont see why you cant handle this champ. \r\n\r\nYou can choose to write this off as a BS post about someone who knows nothing but face it, this champ is strong, yes that is true, but is she really that broken? No.","replies":[{"poster":"Deep Terror Nami","date":"2015-07-16T22:24:09.125+0000","up_votes":6,"down_votes":1,"body":"Riven confirmed to be broken\n\nhttp://i.gyazo.com/7cbebd4afba813481acd6055e4bb59a7.png","replies":[]},{"poster":"InsaneSamurai","date":"2015-07-16T23:22:15.632+0000","up_votes":5,"down_votes":1,"body":"So apparently in the LCS someone finally went Riven and the enemy team just avoided her for most of the game.  Sounds balanced to me :P","replies":[{"poster":"SunriseSkaterKid","date":"2015-07-16T23:25:09.071+0000","up_votes":3,"down_votes":3,"body":"Why? because if the enemy team showed themselves top with riven there they got a twisted fate ulti+a rek'sai knockup. Thats not the champ being broken, thats the team knowing that getting kills on her is good and if they dont then the top riven pick will be completely useless. . Or do you not watch the games?","replies":[{"poster":"InsaneSamurai","date":"2015-07-16T23:29:00.002+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=TOBGYN,realm=NA,application-id=3ErqAdtq,discussion-id=Gjbn5TGI,comment-id=00040000,timestamp=2015-07-16T23:25:09.071+0000)\n>\n> Why? because if the enemy team showed themselves top with riven there they got a twisted fate ulti+a rek'sai knockup. Thats not the champ being broken, thats the team knowing that getting kills on her is good and if they dont then the top riven pick will be completely useless. . Or do you not watch the games?\n\nI got a recap from a friend, and that's not what I was saying.  From what I heard the team fighting against the Riven didn't even want to fight her.  It sounds like we may be referencing different games but I can't be sure since I didn't see it myself.\n\nAll I'm saying is if the pro players conclude that the best option against a champ is to not even try to fight them, maybe something is wrong.","replies":[{"poster":"SunriseSkaterKid","date":"2015-07-16T23:36:51.192+0000","up_votes":3,"down_votes":1,"body":"If you're referencing the games today ill tell you what happened\n\nHuni had a 150 CS lead on the enemy top laner because ROC decided to let their adc try to snowball instead of their rumble. Everytime rumble attempted to go top lane Febiven would Destiny to top lane and stun rumble and Reignover would come and knock up rumble and then they would give the kill to Huni by letting him execute with R. The only reason no one wanted to go top was because ROC didn't have any tank to deal with a riven which is one of my points BTW. And if anyone went near top they were 3 man gang banged and killed.","replies":[{"poster":"InsaneSamurai","date":"2015-07-16T23:41:24.672+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=TOBGYN,realm=NA,application-id=3ErqAdtq,discussion-id=Gjbn5TGI,comment-id=0004000000000000,timestamp=2015-07-16T23:36:51.192+0000)\n>\n> If you're referencing the games today ill tell you what happened\n> \n> Huni had a 150 CS lead on the enemy top laner because ROC decided to let their adc try to snowball instead of their rumble. Everytime rumble attempted to go top lane Febiven would Destiny to top lane and stun rumble and Reignover would come and knock up rumble and then they would give the kill to Huni by letting him execute with R. The only reason no one wanted to go top was because ROC didn't have any tank to deal with a riven which is one of my points BTW. And if anyone went near top they were 3 man gang banged and killed.\n\nAh ok I get ya now.  Makes sense but it's odd that they ended up with skewed comps like that being pros.","replies":[]}]}]}]}]},{"poster":"MalzaharAnyLane","date":"2015-07-16T22:49:26.034+0000","up_votes":4,"down_votes":1,"body":"This was posted last night, and thoroughly rebutted.\n\nA Diamond 1 Riven main got his ass completedly chewed and mathed back down, there is no reason to post any other threads saying Riven is fine. She is not, and hasn't been for years.","replies":[]},{"poster":"Critmaster Garen","date":"2015-07-17T00:04:38.977+0000","up_votes":2,"down_votes":0,"body":"i think what throws many people off, is that she can be a lane bully who still scales strong (or at least not shitty) into the lategame.\n\nthis causes an effect that when she snowballs off her lane, shes a massive threat to the entire team. similar to what happens when melee carries or irelia snowballs.\n\nonly that those have a weak early game to compensate.\n\nher mobility is also fairly unrestricted. she isnt forced to target enemy or allied units like jax or yasuo for example. making her more mobile than those champions, and making it hard to play around her mobility.\n\nflash, w, q, q, q auto attack doesnt leave you many options at level 4, when she locks you up with cc. maybe a way to fix her would be to remove that knockup from early ranks of her q, and have it at full strength at rank 5. and then give her some small buff for her lategame.","replies":[{"poster":"xJLx MCHammer","date":"2015-07-17T00:31:55.363+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Critmaster Garen,realm=NA,application-id=3ErqAdtq,discussion-id=Gjbn5TGI,comment-id=0006,timestamp=2015-07-17T00:04:38.977+0000)\n>\n> i think what throws many people off, is that she can be a lane bully who still scales strong (or at least not shitty) into the lategame.\n> \n> this causes an effect that when she snowballs off her lane, shes a massive threat to the entire team. similar to what happens when melee carries or irelia snowballs.\n> \n> only that those have a weak early game to compensate.\n> \n> her mobility is also fairly unrestricted. she isnt forced to target enemy or allied units like jax or yasuo for example. making her more mobile than those champions, and making it hard to play around her mobility.\n> \n> flash, w, q, q, q auto attack doesnt leave you many options at level 4, when she locks you up with cc. maybe a way to fix her would be to remove that knockup from early ranks of her q, and have it at full strength at rank 5. and then give her some small buff for her lategame.\n\nnailed it","replies":[]},{"poster":"SunriseSkaterKid","date":"2015-07-17T00:56:26.141+0000","up_votes":1,"down_votes":1,"body":"Which is why i said \"Dumb ass laners\" Its not that shes so broken. its that the players dont understand her and cant get through their head that you shouldnt really fight a riven early unless you are like a darius or someone who has a dick ton of damage. Just farm her out, get armor and then go from there.","replies":[]}]},{"poster":"Erockandroll","date":"2015-07-16T22:50:43.368+0000","up_votes":3,"down_votes":1,"body":"This is why I don't pick Glass cannon laners and Junglers. Defenses seem to be more gold efficient than Offensive stats. Probably because your needing to tank the entire enemy team as the teams tank. And the major trade off for defenses being better is that you lack tower trading and objective taking power. But as a top laner, those don't matter as much. (unless your playing the split pusher.) \n\nAlso in the laning phase, Building tank stats is easy cause you only need to focus on one kind of stat that early in the game. (that to counter you Opponent.) Usually when I'm up in the top lane (which is not that often) I usually pick Sion. I can usually Rush Frozen Heart, which would cut her damage in half, while giving me much more frequent poke. What would she do against that? Call in her Jungler? Most likely her Jungler is either AD, making the Frozen Heart rush a double whammy. Or another tank. Making it that much more difficult to take down while (if my teammates are smart) another objective is pressured when the enemy Jungler shows top lane. \n\nThe only other way Riven can possibly snowball like that is if she pulls off a Teleport gank. Yet the problem with that is A) As a Tank, I have enough CC to stop the TP should I see her channeling it. Or B) As the Top laner, Match her TP. This can be tricky if you don't know she's TPing, yet a smart top laner would Identify good positions where a TP gank would be helpful.","replies":[{"poster":"SunriseSkaterKid","date":"2015-07-16T23:26:39.993+0000","up_votes":3,"down_votes":2,"body":"Exactly my point, these kids dont understand how to face a Riven. Its utterly disappointing that the community cant wrap their bronze brains around the points your making which are 100 percent true and valid.","replies":[]}]},{"poster":"CasterGilgamesh","date":"2015-08-09T21:27:55.235+0000","up_votes":2,"down_votes":1,"body":"people are so quick to go on the riven hate train when she honestly is over rated but don't worry hopefully riot won't listen to these idiots and you know what i'm not scared to get down voted because i'm right","replies":[{"poster":"Jefftiffy","date":"2015-08-09T21:32:32.624+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=EmperorGilgamesh,realm=NA,application-id=3ErqAdtq,discussion-id=Gjbn5TGI,comment-id=0008,timestamp=2015-08-09T21:27:55.235+0000)\n>\n> people are so quick to go on the riven hate train when she honestly is over rated but don't worry hopefully riot won't listen to these idiots and you know what i'm not scared to get down voted because i'm right\n\nYou are going to get downvoted for necro'ing a thread that should have stayed dead. Regardless of whether Riven is broken or not. Let it die.","replies":[]}]},{"poster":"Full Psycho","date":"2015-07-16T23:41:24.484+0000","up_votes":1,"down_votes":0,"body":"I'm low elo and even I understand this. You explained it very well and actually made everyone (hopefully) sit back and think about this. (Well those who don't know about this, this isn't important to higher elo I assume). \n\nAny glass cannon carry (Yi, Riven, AP Ekko) do massive damage but have little to no defensive stats. Get that \"useless jungler\" or \"Stupid support\" to CC them and you get LP fer dayz'.","replies":[{"poster":"SunriseSkaterKid","date":"2015-07-16T23:46:29.791+0000","up_votes":2,"down_votes":1,"body":"Thanks! I understand many people will disagree due to their hatred for riven but if you think about it its all about knowing how to play against her","replies":[{"poster":"Full Psycho","date":"2015-07-16T23:51:27.413+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=TOBGYN,realm=NA,application-id=3ErqAdtq,discussion-id=Gjbn5TGI,comment-id=00050000,timestamp=2015-07-16T23:46:29.791+0000)\n>\n> Thanks! I understand many people will disagree due to their hatred for riven but if you think about it its all about knowing how to play against her\n\nI personally hate Riven, I think she is annoying on many levels. I don't dislike her for being \"broken\". She's just good at nuking... like every other glass cannon carry xD. Throw a stun at her and watch her perform a magic trick - of disappearing!","replies":[]}]}]},{"poster":"Akali MIA Care","date":"2015-07-16T22:37:46.563+0000","up_votes":3,"down_votes":3,"body":"tldr;\n\nM8, any champion that can auto 4 times in 1 second through animation canceling is broken.\n\nany argument against that statement is 100% invalid.","replies":[{"poster":"redniwediS","date":"2015-07-16T22:53:59.419+0000","up_votes":1,"down_votes":3,"body":"I don't think you're using the term invalid correctly...  Mainly because I know you're not using it correctly, but still.","replies":[{"poster":"Akali MIA Care","date":"2015-07-16T22:58:58.505+0000","up_votes":2,"down_votes":1,"body":">  \"in·val·id2\n> inˈvaləd/\n> adjective\n> adjective: invalid\n> \n>     not valid, in particular.\n>         (especially of an official document or procedure) not legally recognized and therefore void because contravening a regulation or law.\n>         \"the vote was declared invalid due to a technicality\"\n>         synonyms:\t(legally) void, null and void, unenforceable, not binding, illegitimate, inapplicable\n>         \"the law was invalid\"\n>         antonyms:\tbinding\n>         (**especially of an argument, statement, or theory) not true because based on erroneous information or unsound reasoning.\n>         \"a comparison is invalid if we are not comparing like with like**\"\n>         synonyms:\tfalse, untrue, inaccurate, faulty, fallacious, spurious, unconvincing, unsound, weak, wrong, wide of the mark, off target; More\n>         untenable, baseless, ill-founded, groundless;\n>         informalfull of holes\n>         \"the theory is invalid\"\n>         antonyms:\ttrue\n>         (of computer instructions, data, etc.) not conforming to the correct format or specifications.\" \n\n**Tell me again i used it incorrectly, please.**\n\nI don't think you're using the term \"know\" correctly... Mainly because I know you're not using it correctly, but still.","replies":[{"poster":"redniwediS","date":"2015-07-16T23:13:09.950+0000","up_votes":1,"down_votes":3,"body":"You're stating that his entire argument is incorrect simply because Riven can attack four times in one second.  If that is not a perfect example of \"unsound reasoning\" then I have gone completely insane.\n\nYou literally used an invalid argument to call his argument invalid.","replies":[{"poster":"Akali MIA Care","date":"2015-07-16T23:17:07.738+0000","up_votes":2,"down_votes":2,"body":"So you're saying that auto attacking 4 times in 1 second (level 1 mind you) with Q animation canceling in balanced?\n\nHow is saying that 4 autos in 1 second with animation canceling is broken an invalid argument? It's not, because it's a broken mechanic that requires you to cancel built in animation to get damage off faster.\n\nShe CANCELS half her animations, how is that by any means balanced?\n\nBy the way, now that you understand what invalid means... You're an invalid(noun, not adjective this time). sit back down.\n\n\nAnd his argument is that the laners against riven are bad and feed her, lmao that's just a dumb argument in general.\n\nStop trying to defend a mechanic that's been plaguing this game for years, it's broken and it's time to be fixed.","replies":[{"poster":"redniwediS","date":"2015-07-16T23:22:59.909+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=ObiWannaBlowMe,realm=NA,application-id=3ErqAdtq,discussion-id=Gjbn5TGI,comment-id=00010000000000000000,timestamp=2015-07-16T23:17:07.738+0000)\n>\n> So you're saying that auto attacking 4 times in 1 second (level 1 mind you) with Q animation canceling in balanced?\n\nWow, I thought people finally grew out of this old diversionary tactic.  You put words I haven't said in my mouth and yell at me about them.  Really, go back and read what I've said, you won't find anything agreeing with the OP.  On top of this your \"evidence\" used to call his argument invalid has nothing to do with his actual argument.  That is what makes it unsound, and therefore invalid.\n\nI don't remember the name of it, but this is a well documented type of argument you're using here.  You basically push focus to something else after you lose an argument so you can keep arguing, and since the argument is still going you don't have to face the fact that you lost the original argument.  You can keep pushing the topic further and further until the other participants either leave due to frustration or you finally end up on a topic where you can win.\n\nAlso, you literally called another human being invalid.  Perhaps while I'm sitting down you can go outside and do something other than use insults even a 5 year old wouldn't use.","replies":[{"poster":"Akali MIA Care","date":"2015-07-16T23:27:19.871+0000","up_votes":2,"down_votes":1,"body":"I didn't put words in you mouth.\n\nYou said my argument of her animation cancellations was invalid. Which it clearly isn't\n\nAnd i didn't lose an argument? you got educated and now are trying to divert like you're accusing me of doing.\nYou're not even touching the rest of my points. kind of sad actually.\nOh and do i really have yo go over this again?\n> in·va·lid1\n> ˈinvələd/\n> noun\n> noun: invalid; plural noun: invalids\n> \n>     1.\n>     a person made weak or disabled by illness or injury.\n>     \"an invalid husband\"\n>     synonyms:\till person, sick person, valetudinarian; More\n>     patient, convalescent, shut-in\n>     \"a home for invalids\"\n>     ill, sick, sickly, ailing, unwell, infirm, in poor health, indisposed;\n>     incapacitated, bedridden, housebound, frail, feeble, weak, debilitated\n>     \"her invalid husband\"\n>     antonyms:\thealthy\n\nI called you this one, not the adjective.\n\nplease learn english before starting an argument with me.","replies":[{"poster":"redniwediS","date":"2015-07-16T23:37:01.889+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=ObiWannaBlowMe,realm=NA,application-id=3ErqAdtq,discussion-id=Gjbn5TGI,comment-id=0001000000000000000000000000,timestamp=2015-07-16T23:27:19.871+0000)\n>\n> I didn't put words in you mouth.\n\nHa!  You're funny.\n\n> [{quoted}](name=ObiWannaBlowMe,realm=NA,application-id=3ErqAdtq,discussion-id=Gjbn5TGI,comment-id=00010000000000000000,timestamp=2015-07-16T23:17:07.738+0000)\n>\n> So you're saying that auto attacking 4 times in 1 second (level 1 mind you) with Q animation canceling in balanced?\n\nThe rest of your points you're referring to all point at this quote.  You said that I think this is balanced.  I have not offered my opinion on whether this is balanced or not.  Go reread what was said for proof.  I think it's safe for me to ignore them.\n\n> [{quoted}](name=ObiWannaBlowMe,realm=NA,application-id=3ErqAdtq,discussion-id=Gjbn5TGI,comment-id=0001000000000000000000000000,timestamp=2015-07-16T23:27:19.871+0000)\n>I called you this one, not the adjective.\n\nYeah, I know.  No one uses that as an insult.  You're reading so deep between the lines simply so you can prove me wrong on something.  Why don't you try acting like a grown up, realize you've lost the argument, and learn from it so you don't make these mistakes again.\n\nAnd yes I can say you're acting like a child, you're using insults instead of points.  That's a hallmark of childish argument structure.","replies":[]}]}]}]}]}]}]}]},{"poster":"Hex the FenFen","date":"2015-07-17T01:22:49.822+0000","up_votes":1,"down_votes":0,"body":"I'm Silver 2 and I deal with Riven by playing Bruiser Quinn....It is actually very easy if you know when to vault.","replies":[]}]}