{"poster":"B0ostedPanda GOD","date":"2015-12-05T21:34:35.419+0000","title":"Premade für's carrien gesucht! :)","subforum":"Clans & Teams","up_votes":1,"down_votes":1,"body":"Heii\r\nIch bin auf der Suche nach einem netten, verst&auml;ndlichen und etwas guten Premade f&uuml;r Ranked.\r\nIch bin nicht der allerbeste, daher solltet ihr mich zwar auf meine Fehler aufmerksam machen, aber\r\nbitte nicht anfangen zu beleidigen oder flamen.\r\nDaher sollte derjenige Skype besitzen. Damit ich mehr Kontakt zu denjenigen habe.\r\nEs w&auml;re richtig nice jemanden zu finden der mich lehrt besser zu werden.\r\nUnd meine Info&#039;s sind:\r\nIch bin 13 Jahre alt.\r\nMeine Position ist ADC.\r\nIngamename ist: Vayne is mad\r\nEinfach adden und anschreiben w&auml;re toll!\r\nMotto: Nicht jeder Bronze Spieler ist schlecht. Ein Bronzie kann ein Gold jederzeit schlagen!","replies":[{"poster":"Sneaky Pepper","date":"2015-12-05T22:31:23.899+0000","up_votes":2,"down_votes":0,"body":"Ein Bronze kann einen Gold nicht schlagen, sonst wäre der Bronzie ja nicht Bronzie.","replies":[{"poster":"Larsybang","date":"2015-12-05T22:33:14.752+0000","up_votes":1,"down_votes":0,"body":"Ist ja nur sein Motto ;) \nIch denke er wird nicht total blöd sein","replies":[{"poster":"Sneaky Pepper","date":"2015-12-05T22:34:55.764+0000","up_votes":1,"down_votes":0,"body":"Doch ist er, wie gesagt, ein Bronze kann keinen Gold schlagen, sonst wäre er selbst schon Gold und nicht Bronze. Denk mal darüber nach.","replies":[{"poster":"Larsybang","date":"2015-12-05T22:35:43.512+0000","up_votes":1,"down_votes":0,"body":"Mir ist das schon klar aber es kann ja trotzdem sein Motto sein um sich zu verbessern ;)","replies":[{"poster":"Sneaky Pepper","date":"2015-12-05T22:36:44.391+0000","up_votes":2,"down_votes":0,"body":"Dann sollte es heissen \"Ein Bronzie bleibt nicht für immer ein Bronzie\" oder \"Ein Bronzie kann mit Übung einen Gold schlagen\" und nicht \"Ein Bronzie kann JEDERZEIT einen Gold schlagen\".","replies":[{"poster":"Conkery","date":"2015-12-06T18:39:26.124+0000","up_votes":1,"down_votes":0,"body":"iSneaky Pepper, als Randinfo. \nDas Motto stammt von mir.\nIch habe es ihn gesagt weil das mein Motto ist.\nUnd es ist wahr. Ein Bronzie KANN ein Gold schlagen.\nIch habe selbst nie Rankeds gespielt und fing vor 4-5 Tagen wieder an und kam von Bronze selbst auf S3 jetzt. \nDa mein Freund jetzt momentan krank ist kann ich nicht weitermachen.\nAlso was du sagst ist Schwachsinn.\nIch war selbst Jahrelang Bronze und habe nie Rankeds gespielt UND schlug einige Gold in 1vs1 oder in 5vs5.\nEs gibt einige Spieler die Bronze spielen und nicht Rankeds spielen. \nOder einfach nur nicht für's Carrien da sind.\nBeispiel Support. Alleine kann er nicht viel wenn er gegen ein ADC spielt.\nBronze Spieler sind nicht gleich Müll.\nAhja als Beweis: http://www.fotos-hochladen.net/uploads/whenweduoque2t0js1qngv.png\n18er Ranked Winstreak.\nIch war Bronze.\nUnd wenn du damit jetzt kommst ''Ahh jaaaa, Bronze sind nur schlechte Spieler''\nIch hatte einige Smurfs dabei.","replies":[{"poster":"Sneaky Pepper","date":"2015-12-07T20:55:08.482+0000","up_votes":1,"down_votes":0,"body":"Genau das habe ich gesagt, ein Bronzie kann keinen Gold schlagen. Wenn du Bronze bist und keine Rankeds spielst aber trotzdem besser bist, dann bist du halt kein Bronzie. Mit einem Bronzie meine ich einen, der auch verdient Bronze ist, wenn das nicht in deinem Schädel reinging.","replies":[{"poster":"Conkery","date":"2015-12-16T09:12:01.745+0000","up_votes":1,"down_votes":0,"body":"Ich verstehe wirklich nicht was du unter ''Bronzie'' verstehst.\nEin ''Bronzie'' ist ein Spieler der in Bronze hängt. Egal ob er es verdient, und oder es ist.\nEin Bronzie ist ein Bronze Spieler. Mehr nicht damit du es kappierst!\nDeine Logik ist nicht gerade einleuchtend.\nEin Bronzie kann einen Gold ''Jederzeit'' schlagen. \nEs ist so.\nUnd ein Bronzie ist immer noch ein BRONZESPIELER und niemand der es Verdient. Das hast du nämlich selbst gesagt und niemand anderes!\nDann sag doch ganz einfach Wood-Division","replies":[{"poster":"CooL Ice Tea","date":"2015-12-16T13:16:35.184+0000","up_votes":1,"down_votes":0,"body":"Bin auf dem Main Platin 1, wenn ich nen Smurf habe der Bronze 1 ist und mit dem gegen nen Gold gewinne, bin ich jetzt Bronze oder bin ich Platin von der Wertung des Matches her? \n\nWenn jemand einen höheren Skill level als Bronze hat und nur nicht ranked spielt mit seinem acc der vor nem dreiviertel jahr geranked wurde heisst das nicht das er noch Bronze spieler ist. Diesen Spieler würde ich als unranked ansehen.","replies":[]},{"poster":"HHaie tabbian","date":"2015-12-16T09:16:56.114+0000","up_votes":1,"down_votes":0,"body":"Es gibt niemanden, der unverdient in Bronze festhängt. Ich würde aber auch sagen, dass es möglich ist, dass ein Bronze Spieler mal in einem Spiel besser ist als ein Goldspieler. Aber nur wenn der Goldspieler einen sehr sehr schlecht Tag hat und einen Champ spielt, den er sonst nie spielt und der Bronzespieler einen sehr sehr guten Tag hat. Das \"jederzeit\" würde ich lieber weglassen.","replies":[]}]}]}]}]}]}]}]}]},{"poster":"Its me Boomblama","date":"2015-12-05T21:50:43.285+0000","up_votes":1,"down_votes":0,"body":"Ich hab dir eine anfrage geschickt ^^\nIts me Boomblama in game\n{{summoner:4}} {{sticker:slayer-jinx-catface}}","replies":[]}]}