{"poster":"xRisingStarx","date":"2017-01-23T23:34:54.018+0000","title":"A moment of silence for Zyra","subforum":"Story, Art, & Sound","up_votes":3,"down_votes":10,"body":"Let&#039;s give a moment of silence to Zyra, who has gone 1183 days without a new skin. Good job Riot for keeping up with this negligence with stupid excuses like &quot;she is difficult to make skins for&quot;, &quot;she has a mage update&quot; etc while such excuses does not apply to other popular champions. Diana, who just got an Infernal skin less than a year ago gets the Blood Moon skin this time. Once again, good job Riot.","replies":[{"poster":"Big Lincoln","date":"2017-01-23T23:42:13.043+0000","up_votes":4,"down_votes":0,"body":"> while such excuses does not apply to other popular champions.\n\nprobably because they aren't as hard to make skins for","replies":[{"poster":"xRisingStarx","date":"2017-01-23T23:45:45.581+0000","up_votes":2,"down_votes":4,"body":"> [{quoted}](name=Big Lincoln,realm=NA,application-id=6kFXY1kR,discussion-id=U9zUiojI,comment-id=0001,timestamp=2017-01-23T23:42:13.043+0000)\n>\n> probably because they aren&#x27;t as hard to make skins for\n\nJinx is as hard to make skins for but she has 3 in the span of 2 years, what's the excuse here?","replies":[{"poster":"I Stealth I","date":"2017-01-24T11:46:06.836+0000","up_votes":2,"down_votes":0,"body":"Jinx.....skin......hard.....to....make?\n\nlol, dude you're high\n\nTalon went with no skin since 2012, get in line, (SSW doesn't count as part of the skin line as it is an e-Sport skin,  don't ask me, ask riot)","replies":[{"poster":"xRisingStarx","date":"2017-01-24T12:43:16.668+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=StealthVortex88,realm=OCE,application-id=6kFXY1kR,discussion-id=U9zUiojI,comment-id=000100000000,timestamp=2017-01-24T11:46:06.836+0000)\n>\n> Jinx.....skin......hard.....to....make?\n> \n> lol, dude you&#x27;re high\n> \n> Talon went with no skin since 2012, get in line, (SSW doesn&#x27;t count as part of the skin line as it is an e-Sport skin,  don&#x27;t ask me, ask riot)\n\nIt's not according to me tho don't quote me on this. It was Riot Kateykhaos the one who mentioned that alongside Zyra, Jinx, Thresh and Lulu are the top hardest champions to make skins for due to various models. So do your research before claiming I'm \"high\".","replies":[{"poster":"I Stealth I","date":"2017-01-24T21:47:28.861+0000","up_votes":1,"down_votes":1,"body":"You're still high,\n\nIf Zyra deserves anything, it should be a significant nerf to her plants","replies":[{"poster":"xRisingStarx","date":"2017-01-25T01:00:03.889+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=StealthVortex88,realm=OCE,application-id=6kFXY1kR,discussion-id=U9zUiojI,comment-id=00010000000000010000,timestamp=2017-01-24T21:47:28.861+0000)\n>\n> You&#x27;re still high,\n> \n> If Zyra deserves anything, it should be a significant nerf to her plants\n\nLmao bet you're dumb as fuck irl.","replies":[]},{"poster":"xRisingStarx","date":"2017-01-25T01:01:45.700+0000","up_votes":1,"down_votes":0,"body":"If I'm high then what are you? Lmao","replies":[{"poster":"I Stealth I","date":"2017-01-25T03:15:31.186+0000","up_votes":1,"down_votes":1,"body":"I'm high up in a different plane of existence","replies":[{"poster":"xRisingStarx","date":"2017-01-25T03:43:38.029+0000","up_votes":1,"down_votes":0,"body":"Gfy mate, you don't belong here.","replies":[{"poster":"I Stealth I","date":"2017-01-25T04:03:08.364+0000","up_votes":1,"down_votes":0,"body":"try and make me leave then we'll see\n","replies":[{"poster":"xRisingStarx","date":"2017-01-25T04:29:53.048+0000","up_votes":1,"down_votes":0,"body":"That's up to you, just sayin you don't belong here :) triggered?","replies":[{"poster":"I Stealth I","date":"2017-01-25T04:44:53.557+0000","up_votes":1,"down_votes":0,"body":"nah","replies":[]}]}]}]}]}]}]}]}]}]}]},{"poster":"Solidair3","date":"2017-01-23T23:52:28.842+0000","up_votes":3,"down_votes":0,"body":"Let's unpack this a bit.\n\nFor reference, I like Zyra a lot and agree she needs a new skin. I like her undead skin a lot, it's the one I always use and fire Zyra looks super hacky (It's from another time, but man do I love that splash art.)\n\nBut anyway, I digress. First and foremost, Infernal Diana did NOT count toward her \"recently received a skin\" status because it is a \"special\" skin. It was voted for by the community, and counted as an event skin. Worlds team skins (like skt zyra) fit into this category, too. Diana's previous skin before infernal was also technically an event skin, but I think it's still in the shop because it was her first non-release skin, and they felt she deserved to keep it.\n\nSecond, there has been community outcry since the inception of the blood moon line (and Diana's co-existence; She was released after the line was already established if I recall) so there is much reason to have it around, and a lot of people are pretty pleased about it.\n\nAnd finally, a subjective point: I don't think Blood Moon would fit with Zyra very well. I don't know that blood red spooky plants would really be enough to do her justice; she already has a spooky skin, anyway. I think there are better options for her.\n\nI think your anger is justified, I want a new Zyra skin, too, and I'm willing to bet you that the Skins team knows that she needs one pretty badly. I bet you she's gonna get one this year, and hopefully it'l be really rad.","replies":[{"poster":"xRisingStarx","date":"2017-01-23T23:54:56.185+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Solidair3,realm=NA,application-id=6kFXY1kR,discussion-id=U9zUiojI,comment-id=0003,timestamp=2017-01-23T23:52:28.842+0000)\n>\n> Let&#x27;s unpack this a bit.\n> \n> For reference, I like Zyra a lot and agree she needs a new skin. I like her undead skin a lot, it&#x27;s the one I always use and fire Zyra looks super hacky (It&#x27;s from another time, but man do I love that splash art.)\n> \n> But anyway, I digress. First and foremost, Infernal Diana did NOT count toward her &quot;recently received a skin&quot; status because it is a &quot;special&quot; skin. It was voted for by the community, and counted as an event skin. Worlds team skins (like skt zyra) fit into this category. Diana&#x27;s previous skin before infernal was also technically an event skin, but I think it&#x27;s still in the shop because it was her first non-release skin, and they felt she deserved to keep it.\n> \n> Second, there has been community outcry since the inception of the blood moon line (and Diana&#x27;s co-existence; She was released after the line was already established if I recall) so there is much reason to have it around, and a lot of people are pretty pleased about it.\n> \n> And finally, a subjective point: I don&#x27;t think Blood Moon would fit with Zyra very well. I don&#x27;t know that blood red spooky plants would really be enough to do her justice; she already has a spooky skin, anyway. I think there are better options for her.\n> \n> I think your anger is justified, I want a new Zyra skin, too, and I&#x27;m willing to bet you that the Skins team knows that she needs one pretty badly. I bet you she&#x27;s gonna get one this year, and hopefully it&#x27;l be really rad.\n\nThanks for understanding that it is very frustrating as a Zyra main. I'm hoping to see a more dark and magical skin theme for her soon.","replies":[{"poster":"Mig89","date":"2017-01-24T13:32:35.310+0000","up_votes":3,"down_votes":0,"body":"I want to see the idea for an ultimate skin that someone had for her. Kinda like the new lux skin but she changes season throughout the game.","replies":[{"poster":"xRisingStarx","date":"2017-01-24T13:46:31.695+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Mig89,realm=NA,application-id=6kFXY1kR,discussion-id=U9zUiojI,comment-id=000300000000,timestamp=2017-01-24T13:32:35.310+0000)\n>\n> I want to see the idea for an ultimate skin that someone had for her. Kinda like the new lux skin but she changes season throughout the game.\n\nFour Seasons Zyra :) Yes that's a really good concept but I'd rather they hold that off for now because we basically gotta wait another whole year for her ultimate skin so I hope in the mean time she can at least receive a 1350RP or legendary skin.","replies":[]}]}]}]},{"poster":"lightdragoon88","date":"2017-01-23T23:48:12.075+0000","up_votes":3,"down_votes":0,"body":"{{champion:6}} I have gone almost 2,000 days without a new skin.","replies":[{"poster":"Limmie","date":"2017-01-24T09:39:03.947+0000","up_votes":2,"down_votes":0,"body":"When they rework Urgod they better release a new skin along. And it better be Star Guardian. Or else.","replies":[]}]},{"poster":"Hethalean","date":"2017-01-23T23:41:13.897+0000","up_votes":3,"down_votes":2,"body":"I'm not sure open mocking and hostility is a great way to get Riot on your side for a Zyra skin.","replies":[]}]}