{"poster":"IHannah BakerI","date":"2016-06-24T05:20:45.979+0000","title":"[Platin II] Midlaner sucht nach einem motivierten, engagierten Rankedteam","subforum":"Clans & Teams","up_votes":1,"down_votes":1,"body":"Guten Tag,\r\n\r\nZu mir und meinen Zielen/W&uuml;nschen:\r\n\r\nmein Name ist Robin, ich bin 19 Jahre jung und bin seit s3 in LoL aktiv. Ich bin main midlane und bin ein aktiver Spieler, der sowohl Rankeds als auch mal Normals zum Itembuilds/Champs testen spielt.\r\nIch bin momentan in Platin 2 und m&ouml;chte mich selbst nach Dia5+ hoch spielen, da ich aber haupts&auml;chlich gerne im Competetive Bereich spielen m&ouml;chte, wo man als Team zusammen trainiert, tryhardet, spiele analysiert und an Turnieren teilnehmen m&ouml;chte, suche ich jetzt ein Team.\r\nDieses muss nicht unbedingt schon l&auml;nger bestehen, jedoch sollte Motivation, eine gewisse Grundstruktur, Kritikf&auml;higkeit, Zeit und den gewissen Skill von der Elo G3+ haben. Zur gew&uuml;nschten Struktur geh&ouml;rt au&szlig;erdem die Kommunikation preferiert per Ts und unter einer gut strukturierten Organisation zu spielen, w&auml;re ich nicht abgeneigt.\r\n\r\nChampionpool:\r\n\r\nTier 1[sehr viel Erfahrung/Spielpraxis, besten Champs von mir]:\r\nTier 2[viel Erfahrung/Spielpraxis, auf gutem Niveau]:\r\nTier 3(mittelm&auml;&szlig;ige Erfahrung/in &Uuml;bung]:\r\n\r\nErfahrung:\r\n\r\nMein Championpool kommt durch aktives Spielen im Teamranked und Solozustande, welches sich auf das Testen/&Uuml;ben von optionalen Champs und Meta Champs bezieht. Dem hinzuf&uuml;gend bin ich auch offen f&uuml;r andere Champs, die Meta werden oder erw&uuml;nscht sind.\r\nIch spiele eigentlich t&auml;glich und bin ab ca. 18/19 Uhr online. Desweiteren habe ich schon in ein paar Teams gespielt, wodurch einen gutes Wissen bez&uuml;glich Training, Analyse, Kommunikation und Teamplay habe. Die bisherigen Teams haben sich im Bereich von Gold/High Gold --&gt; High Plat/Low Dia bewegt.\r\nLetztendlich gab es oft Probleme wegen Teamhoppern bei neuen Teams, Kritikf&auml;higkeit bei manchen Leuten, Motivation/Zeit die investiert in LoL und das Team gesteckt wird.\r\n\r\nFalls Ihr interssiert seid, addet mich per LoL-Client; Ign: Bergmite oder antwortet im Forum.\r\n\r\nAnsonsten noch einen sch&ouml;nen, sonnigen Freitag :)\r\nund\r\nViel Gl&uuml;ck und Spa&szlig; in der Kluft\r\n\r\nBergmite","replies":[]}