{"poster":"Excløigg","date":"2016-11-09T18:13:06.483+0000","title":"Una burla.","subforum":"Charlas Generales","up_votes":7,"down_votes":0,"body":"Encuentro que Riot a tomado varias decisiones equivocadas a lo largo de los a&ntilde;os, pero creo que esta fue la peor de todas, siento que estamos siendo pasados a llevar, nosotros como usuarios, quienes tenemos que soportar a los ni&ntilde;os rata, los flameos y los pickeos de &quot;zed supp&quot;, la selecci&oacute;n oculta no sirve, fomenta los toxicos y la mala relaci&oacute;n del server que ya es mucha, siento que riot no se pone las pilas en cuanto a peticiones, que este foro a sido creado solo para expresar el descontento, pero solo es eso, no nos escuchan, no nos toman en cuenta, quitar el modo reclutamiento es una P&Eacute;SIMA IDEA , aun no comprendo a quien se le puede haber ocurrido semejante estupidez.\r\nDeseo sinceramente que vuelva a ser introducido el modo reclutamiento, porque la mayor&iacute;a de la comunidad lo quiere.","replies":[{"poster":"CKats Hellville","date":"2016-11-09T18:15:46.696+0000","up_votes":1,"down_votes":6,"body":"\"uienes tenemos que soportar a los niños rata, los flameos y los pickeos de \"zed supp\", la selección oculta no sirve, fomenta los toxicos y la mala relación del server que ya es mucha\"\n\nQueres evitar los flameos? /mute all . \n\nHace tu juego, no les des bola a los otros y si te joden sacas captura de pantalla y lo mandas al soporte. \n\nSaludos","replies":[{"poster":"bluerising","date":"2016-11-09T18:22:30.373+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=CKats Hellville,realm=LAS,application-id=v7qsfXsE,discussion-id=hGl3h9Ri,comment-id=0000,timestamp=2016-11-09T18:15:46.696+0000)\n>\n> &quot;uienes tenemos que soportar a los niños rata, los flameos y los pickeos de &quot;zed supp&quot;, la selección oculta no sirve, fomenta los toxicos y la mala relación del server que ya es mucha&quot;\n> \n> Queres evitar los flameos? /mute all . \n> \n> Hace tu juego, no les des bola a los otros y si te joden sacas captura de pantalla y lo mandas al soporte. \n> \n> Saludos\n\nGenial eso recuperara mis horas perdidas en este trolleo de 20 minutos, claro que solución amigaso.","replies":[{"poster":"CKats Hellville","date":"2016-11-09T18:51:42.289+0000","up_votes":1,"down_votes":4,"body":"Cuando es asi y empiezan a trollear no jueges y listo (si ves que no queres ponerte de mal humor por unos pibitos) , es re simple.. minimizas el lol y te pones  hacer otra cosa (de vez en cuando entras para que no te adviertan de que estas afk) OJO, no digo que este bien pero si ya tenes un game perdido  y tenes niños ratas .. que vas a hacer? madearte por culpa de ellos? no no, simplemente ignoras y listo.. No te lo digo de mala manera pero me parece una boludes madearte por culpa de gente que esta del otro lado de la pantalla..","replies":[]}]},{"poster":"L9 Letalis Umbra","date":"2016-11-09T18:49:03.955+0000","up_votes":1,"down_votes":0,"body":"El soporte no es para pasarselas reportando gente. Sólo casos particulares dónde sean ultra graves, onda ~~vital~~ desearle la muerte a él o algún cercano, burlarse de una condición ya sea fisiológica o sexual, etc.\nHay gente que lleva casos simples como que te dijo \"sos un %#%&\", pero eso sólo basta con reportarlo al final de la partida y si sigue con el comportamiento se le baneará. Por casos como esos es que a veces la gente de soporte no puede responder rápidamente casos que realmente valen la pena.\nSi tienes poca paciencia, está bien. /mute all... Pero si eres paciente, es mejor ignorar, leer lo que escribe y reportar con buenos argumentos al final de la partida, así se le hace un mejor seguimiento.","replies":[{"poster":"CKats Hellville","date":"2016-11-09T18:53:37.160+0000","up_votes":1,"down_votes":0,"body":"obvio siempre al finalizar la partida un report.. (siempre y cuando lo merezca) Pero, ademas de eso.. si viene flameando desde el champ select y vez que en los primeros 10 minutos no para de flamear (pongo 10 min como tope, algunos mas otros menos) se procede a mutear al individuo, si vez que los de tu team siguen respondiendole a su flameo lo desmuteas y le sacas captura a todo lo que concideres ofensivo y que \"arruine la experiencia del juego\"","replies":[{"poster":"L9 Letalis Umbra","date":"2016-11-09T19:03:23.038+0000","up_votes":1,"down_votes":0,"body":"Pero el tema es que se llenaría el soporte de reportes, que no cambiará en nada. Debido que es lo mismo que reportar al final de la partida.\nTu sólo trata de que el equipo lo ignore y/o mutee y que sigan con la partida (Obviamente reportandolo al final). Ya que respondiendole están dando la atención que es lo que el busca. Si se le ignora se terminará aburriendo","replies":[]}]}]}]},{"poster":"Aiur is life","date":"2016-11-09T18:23:58.239+0000","up_votes":1,"down_votes":0,"body":"Esos son los niños ratas que solo usan {{champion:238}} {{champion:157}} {{champion:92}} {{champion:122}}","replies":[]}]}