{"poster":"Stellante","date":"2019-07-26T20:33:03.442+0000","title":"ragazzi ma...","subforum":"Discussioni generali","up_votes":2,"down_votes":1,"body":"ci sta un bel gruppetto che mi aiuta a diventare oro anche se mi piacerebbe vedere lo smeraldo o il cristallo nel mio bordino in ranked però perdo sempre con i campioni che uso faccio 0/10/4 però ho tanta bunona volontà {{sticker:sg-soraka}}","replies":[{"poster":"Jiro is my waifu","date":"2019-07-26T21:00:28.993+0000","up_votes":4,"down_votes":0,"body":"non per cattiveria,non fraintendermi,ma pur essendo non high elo il gold va meritato,concentrati un po' di più su come gestisci le partite,guarda build e rune da siti specializzati,e vedi che col tempo i risultati arriveranno,senza bisogno di spintarelle","replies":[]},{"poster":"XPY99","date":"2019-07-26T22:34:59.512+0000","up_votes":3,"down_votes":1,"body":"Sei  livello 38, bronzo 2 è già un ottimo risultato per il tuo livello, ci sono tante meccaniche che sicuramente ancora non conosci e considera che in platino c'è il 12% dei giocatori e in diamante il 3%\nSe vuoi un consiglio, e se hai tempo, inizia a seguire le partite competitive [](https://www.twitch.tv/pg_esports) ogni venerdì/sabato dalle 17/18 alle 22/23 c'è il campionato europeo con il commento in italiano, ascolta sopratutto le critiche che fanno al team che perde","replies":[{"poster":"Linkimaru 2099","date":"2019-07-27T15:21:26.484+0000","up_votes":1,"down_votes":0,"body":"Dal competitive non impara niente un liv 38 bronzo 2... anzi al massimo impara cose sbagliate, sarebbe come far seguire una lezione universitaria di matematica ad un ragazzino delle elementari che ancora sta studiando le tabelline... quindi lo sconsiglio a meno che non vuole vederle per divertimento immaginando ci sia un enorme disclaimer \"dont try this at home\". \nOltretutto il competitive e la soloq son due mondi distinti e separati, soprattuto in low elo molte cose che funzionano benissimo non funzionano assolutamente nelle partite dei pro player e viceversa (vedi champ come master yi che in low elo fanno 1v9 e nel competitive non si sognerebbero mai di pickare).\n\nPiuttosto meglio leggere qualche guida alla SOLOQ per principianti o seguire qualche video su youtube tipo \"unranked to diamond\" dove vede come scalare partendo dal basso, ciò che realmente funziona e ciò che non funziona nei diversi livelli della classifica.","replies":[{"poster":"Don Draven","date":"2019-08-07T21:35:31.964+0000","up_votes":1,"down_votes":0,"body":"Però voglio precisare come Master Yi alle lcs l ho visto pickare una volta e per di più da un incompetenza fatta a persona che a quanto pare nonostante fosse un proplayer non aspettava i CC per usare la Q.\n\nInsomma...","replies":[]},{"poster":"XPY99","date":"2019-07-27T17:57:16.343+0000","up_votes":1,"down_votes":0,"body":"Infatti ho parlato di critiche degli errori, un over estensione, oppure fare una gank, vedere come adattano le build al team avversario, che pick countera che pick, sono quelle sia in competitivo che in soloq \nNaturalmente non bisogna prendere ad esempio i game dei G2 che semplicemente giocano ad un altro gioco","replies":[]}]}]},{"poster":"ChiffonFairchild","date":"2019-07-28T20:59:37.003+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Stellante,realm=EUW,application-id=MJVj50Jw,discussion-id=nJmYMTOT,comment-id=,timestamp=2019-07-26T20:33:03.442+0000)\n>\n> ci sta un bel gruppetto che mi aiuta a diventare oro anche se mi piacerebbe vedere lo smeraldo o il cristallo nel mio bordino in ranked però perdo sempre con i campioni che uso faccio 0/10/4 però ho tanta bunona volontà {{sticker:sg-soraka}}\n\nPer me va bene giocare, se sei disponibile la sera dalle 10-11 in poi io sono qui, prima non posso, che lavoro quasi tutti i giorni (tranne quando la salute non me lo permette)\n* Aspetto la tua richiesta d'amicizia a ChiffonFairchild. Otp soraka e sona, ma gioco di tutto(come supp) tranne thresh e blitz\n{{sticker:sg-janna}}","replies":[{"poster":"Don Draven","date":"2019-08-08T16:15:36.883+0000","up_votes":1,"down_votes":0,"body":"Wow tranne thresh e blitz,otp soraka e sona,sei la persona più skillata ever hahaha {{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"ChiffonFairchild","date":"2019-10-21T20:58:54.386+0000","up_votes":1,"down_votes":0,"body":"beh generalmente gli unici thresh e blitz che vincono sono quelli che non beccano mai un grab e vengono carriati. quindi sì,sono skillato perchè carrio ^_^ \ne come ho detto ad un master oggi in ranked: \n{{sticker:sg-lulu}} > git gud","replies":[]}]}]},{"poster":"nseme","date":"2019-07-28T15:46:09.162+0000","up_votes":1,"down_votes":0,"body":"Non è proprio il posto giusto per reclutare cmq ho un clan aggiungimi e scrivimi che ti aggiungo, reclutiamo gente da bronzo alto in su poi inserirti in un team del tuo elo e apprendere fai tuoi mates{{summoner:4}}","replies":[]},{"poster":"Mikikø","date":"2019-07-28T09:05:14.003+0000","up_votes":1,"down_votes":0,"body":"Se vuoi aggiungimi così facciamo una partita insieme e vediamo gli errori che fai, in modo da corregerli, una volta corretti gli errori più gravi a Gold ci puoi arrivare tranquillamente.","replies":[]},{"poster":"Baolo2005","date":"2019-07-27T18:04:06.290+0000","up_votes":1,"down_votes":1,"body":"{{summoner:31}} ","replies":[]},{"poster":"Cromarlimo","date":"2019-07-27T12:20:19.284+0000","up_votes":1,"down_votes":1,"body":"Ci sono trolls in bronzo, argento, oro e platino, non ti preoccupare del rank e gioca per divertirti. Io ti consiglio di non spendere soldi ma è una tua libera scelta. Se ti serve allenamento basta non giocare classificato e incrementare le tue abilità in altre modalità.\nPersonalmente l'esperienza ludica odierna  è disastrosa, e lo dico come vecchio player, motivo per cui ho abbandonato LOL, io ti consiglio di cambiar gioco.","replies":[]}]}