{"poster":"Bruther Momentum","date":"2016-09-25T23:53:49.879+0000","title":"PC","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"Okay, I'm all league player (obviously) and I've had a fun time playing it over the past 2-3 years playing new champs going different builds. But the one thing is that I've been running on laptop this whole time not gaming either just a Windows 7 DELL laptop it works well don't get me wrong but recently I've been receiving lag but not your normal frame rate drops either. From the start of the game to about 3-4 minutes in its fine, but then it declines once almost to 1 fps and it doesn't go back up either. All my setting are very low or off for performance yet it still lags uncontrollably I've closed all my other tabs when playing and even restart my whole laptop just to make sure. But still nothing. I was wondering if anyone (preferably a riot employee) were to help me with this issue.\r\n\r\nP.S. Upgrading to a desktop is impossible since I don't have the money for one","replies":[{"poster":"Dadron3","date":"2016-09-26T01:29:24.390+0000","up_votes":2,"down_votes":0,"body":"Had a similar problem last week. It seemed my graphics drivers needed to be update. If you own a dell computer you should be able to search if all your drivers are updated by going to the official dell website and following their instructions.\n\n  http://www.dell.com/support/home/us/en/04#technical-support\n\nHope it helps","replies":[]},{"poster":"Gear Jammer","date":"2016-09-27T04:14:30.809+0000","up_votes":1,"down_votes":0,"body":"Sounds like a memory leak make sure your using full screen mode alsonif windows 8 make sure windows updates as there was a memory leak issue with all full screen programs on win8 at one time","replies":[]},{"poster":"Targons Blade","date":"2016-09-26T20:28:28.733+0000","up_votes":1,"down_votes":0,"body":"Updating your system drivers as *Dadron3* mentioned is a good first step for sure. Typically FPS issues are caused by malfunctioning display drivers or windows power settings. If you continue to see this issue after updating your system drivers, I recommend working through the steps outlined in our [FPS troubleshooting guide.\n](https://support.riotgames.com/hc/en-us/articles/201752684-Low-Frame-Rate-FPS-Troubleshooting)\n\nLet me know if those steps caused any change.","replies":[]}]}