{"poster":"FalconPawwwwnch","date":"2017-06-23T19:07:41.141+0000","title":"No champions should have access to %damage reduction except for tanks and MAYBE juggernauts","subforum":"Gameplay","up_votes":103,"down_votes":26,"body":"Squishy mobile carries should not have access to them at all because shit like the current patch happens","replies":[{"poster":"Big Lincoln","date":"2017-06-23T19:23:43.075+0000","up_votes":22,"down_votes":4,"body":"riot should buff tank items to what we had in earlier seasons \n\nand then gut % reduction","replies":[{"poster":"Salron","date":"2017-06-23T19:24:51.679+0000","up_votes":45,"down_votes":1,"body":"Remember when Warmogs could give 1300 hp\nNow it gives 800 lol","replies":[{"poster":"YumaS2Astral","date":"2017-06-23T22:06:11.247+0000","up_votes":1,"down_votes":0,"body":"When it used to give 1300 HP? Back when I played this game, it had 1000 HP.","replies":[{"poster":"Darkwind","date":"2017-06-23T22:39:00.931+0000","up_votes":5,"down_votes":0,"body":"Originally, it was an infinite stacking mechanic similar to Sion. It gave like 4 hp per minion, 50 for a kill and 25 for an assist. Numbers fudged from memory.\n\nOnce they capped it, it was at like 1500 hp for quitea while.\n\nThis item has been nerfed a LOT lol","replies":[{"poster":"Skelenth","date":"2017-06-23T23:52:26.522+0000","up_votes":4,"down_votes":0,"body":"Wasn't that item called Leviathan?","replies":[{"poster":"Solidarius","date":"2017-06-24T00:06:38.218+0000","up_votes":5,"down_votes":1,"body":"remember when you could build warmongers and atamas,\n\nman those where the days :D","replies":[{"poster":"The Soulforged","date":"2017-06-24T02:15:30.048+0000","up_votes":2,"down_votes":0,"body":"atmas always has had shit stats though","replies":[]}]}]}]}]},{"poster":"Tails9016","date":"2017-06-24T04:14:27.320+0000","up_votes":2,"down_votes":0,"body":"Pepperidge farm remembers\n~~I don't since I started playing late last year~~","replies":[]}]},{"poster":"Sahn Uzal","date":"2017-06-23T19:28:29.661+0000","up_votes":12,"down_votes":0,"body":"https://www.youtube.com/watch?v=Wbd5UtuBcnE\n\nI miss these days.\n\nTanks Rushing Frozen hearth, gives them lots of protection against AD champions, but doesn't do anything against AP champions.","replies":[{"poster":"Salron","date":"2017-06-23T19:32:53.063+0000","up_votes":19,"down_votes":0,"body":"2017 and we still don't have a Pure MR item FeelsBad","replies":[{"poster":"Sahn Uzal","date":"2017-06-23T19:36:20.822+0000","up_votes":7,"down_votes":1,"body":"I just miss when FH SV was the thing everyone rushed.\nTanks were doing what tanks were doing, instead of... whatever IBG Sunfire is supposed to be trying.","replies":[]},{"poster":"Pater Gascoigne","date":"2017-06-23T20:06:51.909+0000","up_votes":5,"down_votes":0,"body":"I miss Force of Nature :(","replies":[]}]}]},{"poster":"Kalarepa","date":"2017-06-23T20:46:26.706+0000","up_votes":7,"down_votes":2,"body":"Nope, can't be done. If ADC mains can't melt everyone (including tanks) in few seconds, they spam forums asking Riot for buffs or nerfs to the other classes. And Riot listens.","replies":[]},{"poster":"Daddy Tie Me Up","date":"2017-06-25T12:16:54.554+0000","up_votes":1,"down_votes":0,"body":"Buff tank items? Fuck no I dont want to see noodle fights ever again. Yes damage reducrtion should be striaght out removed but fuck buffing tank items fuck tanks.","replies":[]}]},{"poster":"Salron","date":"2017-06-23T19:22:58.071+0000","up_votes":4,"down_votes":5,"body":"What about supports","replies":[{"poster":"FalconPawwwwnch","date":"2017-06-23T19:32:36.111+0000","up_votes":23,"down_votes":0,"body":"Only if they're tanks\n\nLike Braum and Alistar","replies":[]},{"poster":"Ben Sharpio","date":"2017-06-23T19:32:06.201+0000","up_votes":16,"down_votes":8,"body":"No... you guys have low CD point and click shields. That's enough for you.","replies":[{"poster":"Nymzo","date":"2017-06-23T21:16:29.742+0000","up_votes":2,"down_votes":3,"body":"There is not a single warden that can give a point and click shield to an ally.\n\nUnless you mean {{item:3401}} and{{item:3190}} but they are items.","replies":[{"poster":"macromite","date":"2017-06-23T21:40:04.638+0000","up_votes":11,"down_votes":0,"body":"{{champion:44}} not a warden apparantly.","replies":[{"poster":"SorryForYourLoss","date":"2017-06-24T18:21:52.550+0000","up_votes":3,"down_votes":0,"body":"{{champion:43}} has a warden skin though","replies":[]}]}]},{"poster":"Salron","date":"2017-06-23T20:07:42.657+0000","up_votes":10,"down_votes":0,"body":"Theres different kinds of supports\nLike op said below which could be Ali or Braum","replies":[{"poster":"BakedLotion","date":"2017-06-25T03:12:58.478+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Face The Win,realm=NA,application-id=3ErqAdtq,discussion-id=XGBrKQVL,comment-id=000100000000,timestamp=2017-06-23T20:07:42.657+0000)\n>\n> Theres different kinds of supports\n> Like op said below which could be Ali or Braum\n\nAli and Braum are tanks.\nSupport isn't even a class\nIt's just another word for \"ADC's bitch\"\n","replies":[]}]}]}]},{"poster":"RizHippoKhan","date":"2017-06-23T19:46:46.865+0000","up_votes":3,"down_votes":5,"body":"  I feel like {{champion:102}} should get like 10/20/30% slow or damage reduction in dragon form (it scales down with her fury so if like if a lv 6 shyv ults she immediately gets 10% and it becomes 9% when her fury falls to 90 and 8% as her fury falls to 80 and so on.)\n \n Since {{champion:102}} is a juggernaut that only gets tanky by building tanky,I feel this would be a good move.","replies":[{"poster":"zxinferxz","date":"2017-06-23T20:05:13.214+0000","up_votes":4,"down_votes":1,"body":"Please give Mundo that same % damage reduction you're talking about. Because at least Shyvanna I can safely assure you, is in a better spot than him. Lmao","replies":[{"poster":"Ralanr","date":"2017-06-23T20:10:00.171+0000","up_votes":19,"down_votes":1,"body":"Do not give Mundo anything but a full VGU. His current kit is so fucking bullshit.","replies":[{"poster":"zxinferxz","date":"2017-06-23T20:28:14.338+0000","up_votes":9,"down_votes":2,"body":"As a Mundo autist that is climbing to diamond right now off spamming him in jungle: He's fun and his kit is fine. Everything else in the game is wrong, though. S6 mundo was gorgeous, top tier jungle pick, nobody knew why it was so good except the people that ran it, then Riot destroyed the jungle spawn rates, made it harder to clear, destroyed the smite buffs (That gromp buff was nice), destroyed zz'rot, and made armor feel like it was made of butter, nowadays I build 300 armor and still melt to physical damage. Tank in 2k17 LUL","replies":[{"poster":"Ralanr","date":"2017-06-23T20:43:53.935+0000","up_votes":2,"down_votes":1,"body":"You mean the season where he got a bunch of new masteries and no adc bought GW?","replies":[{"poster":"zxinferxz","date":"2017-06-23T21:24:09.774+0000","up_votes":3,"down_votes":1,"body":"Fam, I get bursted down by people that don't have GW on me. Undying Breath is the only good Mundo mastery right now unless you take Stoneborn (lol), and it deals 120 damage, and heals you for 60 hp, when you have 4k hp","replies":[{"poster":"Ralanr","date":"2017-06-23T21:25:20.086+0000","up_votes":1,"down_votes":0,"body":"Talking about season 6. Not now.","replies":[{"poster":"zxinferxz","date":"2017-06-23T21:39:06.989+0000","up_votes":3,"down_votes":2,"body":"Well yeah that's the issue, this isn't season 6, and you're saying the champ's kit needs a rework, it doesn't. None of the people that currently play him think he needs a rework, otherwise they wouldn't be playing him, and the sole reason nobody else plays him except for the autists that main him, is because he's so far behind the powercurve it's absurd, and because, why would you bring a \"tank\" with zero cc to top, in the middle of the tank in 2k17 LUL meta? He doesn't even need a buff, he needs tanks in general to get a buff, just like Shyvanna; all the champs that were \"fine\" in s6, should still be fine now, and if they aren't, then buffing them up to par isn't the way to fix it. Only way to fix it would be to, as you said, give Shyvanna like 30% damage reduction, and then also give Mundo's ult a 30% damage reduction or some dumb thing like that, when that will just beat around the bush without actually fixing the current issue with the game. Turning every tank into Galio or Zac tier of broken, shouldn't be what the community considers \"balance\"\n\nBut then you pick a tank and- oh boy, did you _not_ ban Fiora and Vayne (Probably not an issue considering the current broken ADCs will destroy her, but still)? You're in for a treat!","replies":[{"poster":"Chembaron Yamada","date":"2017-06-24T04:40:49.505+0000","up_votes":3,"down_votes":0,"body":"There are different reasons for a champion to require a VGU.\nAnd Dr. Mundo is definitely in need of one.\n\n1. Visuals: His model is probably the worst in the whole game. He doesn't fit in, he looks more like a comic character than an actual champion in the league of legends.\n2. Matching lore and gameplay fantasy: There is way more potential coming from his lore to make something great out of Mundo.\n3. Outdated kit: You may think otherwise, but I play him as well and think that he definitely needs a new kit. There is almost no skill expression in his current one, he just has one skillshot with his Q and the rest is a bunch of passive effects you can trigger on demand. His passive is basically just more health regen than other characters. He lacks tools to make plays. Right now he can just poke you down with Q and then run you over. And he gets countered way too hard with grevious wounds.","replies":[{"poster":"zxinferxz","date":"2017-06-24T07:34:56.788+0000","up_votes":1,"down_votes":0,"body":"I don't want Riot to ruin my champion like they already ruined quite a few","replies":[{"poster":"Chembaron Yamada","date":"2017-06-24T09:57:52.950+0000","up_votes":3,"down_votes":0,"body":"Well, Dr. Mundo is already confirmed to be on the tier 1 list for a complete VGU....\nHe will get it. Probably not in the next 2 after Urgot and Evelynn (since it got stated they want to focus some not Zaun related champs because we already got Warwick and Urgot), but some time in the future.\n\nAnd honestly, I can't wait for it. Dr. Mundo just has great potential with his lore. I want his kit to live up to that.","replies":[]}]}]}]}]}]}]}]}]}]}]},{"poster":"GelsominoKiller","date":"2017-06-23T21:09:02.914+0000","up_votes":14,"down_votes":1,"body":"I agree that carries with general %dmg reduction can be overbearing.\n\nHowever, your statement is false. %dmg reduction can be a very precious tool to craft divers and fighter kits. WW's E, for example, gives him a sizeable amount of tankyness, but in a telegraphed, temporary and conditional way (if you use your fear, you lose your defensive steroid). I would look at a champion kit and role and then judge if the %dmg reduction is justified or not.","replies":[]},{"poster":"PePsiLemoNN","date":"2017-06-24T08:03:01.820+0000","up_votes":2,"down_votes":1,"body":"Just because you say so ? Ok lol . \n\nAlso {{item:3812}} doesn't reduce the damage , it delays it , so nerfing it's ''lifesteal/spellvamp'' might work cause then you would need to build some other lifesteal items to be efficient","replies":[{"poster":"Thilmer","date":"2017-06-24T09:39:48.023+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=PePsiLemoNN,realm=EUW,application-id=3ErqAdtq,discussion-id=XGBrKQVL,comment-id=0015,timestamp=2017-06-24T08:03:01.820+0000)\n>\n> Just because you say so ? Ok lol . \n> \n> Also {{item:3812}} doesn&#x27;t reduce the damage , it delays it , so nerfing it&#x27;s &#x27;&#x27;lifesteal/spellvamp&#x27;&#x27; might work cause then you would need to build some other lifesteal items to be efficient\n\n\"30% delayed damage\" turns into \"no damage\" as soon as you have 30% lifesteal. And most adcs have that with {{item:3812}}  and other ítem.\n\nThat is more damage reduction than any tank can get, in a class that in theory should be easy to kill with burst damage.","replies":[]}]},{"poster":"General Esdeath ","date":"2017-06-23T20:28:40.189+0000","up_votes":4,"down_votes":0,"body":"If only defensive items were limited to melee champs only so we could reduce the amount of adc's that are \"broken\" because of said items","replies":[{"poster":"PrinceOfStorms","date":"2017-06-23T21:35:00.037+0000","up_votes":1,"down_votes":1,"body":"Alternatively, just remove all defensives from AD items.","replies":[{"poster":"General Esdeath ","date":"2017-06-23T21:57:52.022+0000","up_votes":1,"down_votes":0,"body":"Why? I think both should have defense, hence {{item:3157}} and {{item:3026}}","replies":[{"poster":"PrinceOfStorms","date":"2017-06-24T05:28:55.127+0000","up_votes":2,"down_votes":0,"body":"Zhonyas on mages is fine since you actually have to press it (and AP champions as a general rule have less sustained damage than AD champions). GA just auto-revives you. If Riot won't outright remove GA, change it into an active (same CD) where you get the GA death protection for 5s, and if you live beyond that it's wasted, similar to how Zilean ult works.","replies":[{"poster":"General Esdeath ","date":"2017-06-24T13:07:13.548+0000","up_votes":2,"down_votes":0,"body":"I'm fine with it because 5 minute CD but I think it should build out of pickaxe to reduce AD. Also if they get caught and die they just rez in the middle of a team they die. But I do wish it was active that made you enter Stasis.","replies":[{"poster":"NineTailedMystic","date":"2017-06-25T02:55:16.098+0000","up_votes":1,"down_votes":0,"body":"The _last_ thing AD Assassins and ADCs need are a Stasis effect.","replies":[{"poster":"General Esdeath ","date":"2017-06-25T02:56:57.140+0000","up_votes":1,"down_votes":0,"body":"And AP assassins and burst mages need something that lets them wait for CD's while you can do nothing?","replies":[{"poster":"NineTailedMystic","date":"2017-06-25T03:23:20.743+0000","up_votes":1,"down_votes":0,"body":"ADs have auto attacks that actually do something. They also often have cooldowns much lower than APs.\n\nEx: Zed's cooldowns at max rank, no CDR, are 6/14/3/80. Lux's are 11/10/10/50.\n\nDo you really think Zed should be able to go in, blow up his target, Stasis, then blink back out? It'd be like before Fizz E was nerfed so he could E, Zhonya's, E.","replies":[{"poster":"General Esdeath ","date":"2017-06-25T03:57:03.218+0000","up_votes":1,"down_votes":0,"body":"An AA from a Vayne does much less than a Q from {{champion:45}}","replies":[{"poster":"NineTailedMystic","date":"2017-06-25T04:08:39.113+0000","up_votes":1,"down_votes":0,"body":"At a much faster rate than Veigar Q. \n\nAt 40% CDR, Veigar Q has a 3s CD. I wouldn't doubt Vayne gets up to 1.5 AS, so I'm going to use that as an easy number. Vayne gets 4.5 AAs in the time of 1 Veigar Q.","replies":[{"poster":"General Esdeath ","date":"2017-06-25T04:38:14.894+0000","up_votes":1,"down_votes":0,"body":"Which you have an easy time setting up to counter, same as with Zhonyas.","replies":[{"poster":"NineTailedMystic","date":"2017-06-25T05:16:27.581+0000","up_votes":1,"down_votes":0,"body":"Sure, if it's a bad scenario to use the Stasis. But if you use your Stasis _properly_, they don't get to counter it.\n\nhttp://i.imgur.com/W6g4qGU.jpg?noredirect\n\nUsing your Stasis against an enemy Zed in the middle of a team fight, so he can be properly focused and you avoid his combo. Hard to punish someone in the back line.\n\n\nhttp://i.imgur.com/k6XtgkH.jpg?noredirect\n\nUsing your Stasis against an enemy Zed while you're alone, as he will promptly kill you after your Stasis.","replies":[{"poster":"General Esdeath ","date":"2017-06-25T05:37:40.905+0000","up_votes":1,"down_votes":0,"body":"Even in team fights it's possible to get burst after a good set up.","replies":[]}]}]}]}]}]}]}]}]}]}]}]}]},{"poster":"OHminus","date":"2017-06-24T02:53:40.942+0000","up_votes":3,"down_votes":0,"body":"Tanks? Do you mean {{champion:119}} {{champion:104}}{{champion:29}} ???","replies":[]}]}