{"poster":"CookedChickens","date":"2017-07-01T08:22:21.184+0000","title":"Raven - The shadow's Daughter. Champion concept.","subforum":"Player Creations","up_votes":1,"down_votes":0,"body":"Raven&#039;s kit is based on the fact that she changes weapons, like changing forms. But you actually have three to them. These four weapons can be changed by being in a particular province of an enemy champion. She is an assassin that is based on a system where she wants to get into 1v1s. You play/build her differently depending on what weapon you decide to use. She has very high single target damage. But has to charge up her abilities before going into a duel or she won&#039;t be as powerful. Let&#039;s get into it.\r\n\r\nPassive: By clicking on an edge of a wall, she can perch herself upon it. Whilst doing this, she isn&#039;t invisible but she is hard to see. She can only come down on the side of the wall she stood up on but can walk along the wall. \r\n\r\nIf using knives-\r\nMelee\r\n\r\nQ- Takedown- After being on a wall, Raven can jump onto an enemy, if it is a minion, they take damage and are stunned, if it is an enemy champion, they take damage and are slowed. This ability can also be used to launch herself from one wall to another.\r\n\r\nW- Ankle slashes- Raven along the ground, slashing at the ankles of the champions and minions she passes. If she doesn&#039;t slash a champion on her way, she throws her blades out in all directions. If she does hit an enemy champion, they are slowed and take damage, but she doesn&#039;t throw her knives out.\r\n\r\nE- Double takedown- Raven pounces off the ground and slashes at an enemy. If another enemy champion is in close proximity to them, she flips off that the champ she is on and onto the other. She slashes at both of them then backs flips off the final one.\r\n\r\nIf using black magic-\r\nMelee\r\n\r\nQ- Takedown- After on a wall, Raven can tag onto a champion, her shadow follows the champion, the enemy team can&#039;t see her, only the enemy she latches onto. After 1.5 seconds of tagging onto them, she comes out and dashes through them, poisoning them and dealing damage in a ring around her.\r\n\r\nW- Poisoning attack- Raven&#039;s auto attack&#039;s burn her enemies for a short period of time, if the enemy dies from this effect, Raven heals herself from their suffering. Every fourth basic attack, she burns her fist straight through her enemy, dealing extra damage.\r\n\r\nE- Explosive twin- Raven creates a clone that she sends to the closest enemy when it reaches them, it blows up into a ring of black fire and burns there for a few seconds.\r\n\r\nIf using Shurikens-\r\nRanged\r\n\r\nQ- Piercing Blades-  Raven throws a shuriken at an enemy, infused with black magic, it silences that enemy and slows them. If it kills the enemy, Raven is healed. The ability stacks for the time that she doesn&#039;t use it. She charges it until a point where it becomes a massive black blade that pierces straight through an enemy and into the space behind them. After it hits one person, the damage is increased to the people behind the target.\r\n\r\nW- Wall run- Raven jumps onto a wall. An arrow appears on the from the champion to the cursor. Raven follows the arrow, jumping from wall to wall, she can&#039;t go over a wall but can go all the way around it and also can jump to adjacent walls, if the gap between them is too large, she pounces off the wall and throws shurikens in a cone in front of her. The effect can last up to 20 seconds and the longer she stays on the wall, the more damage the release will deal, if she stays too still on a wall, she leaps off it. She gets massively increased movement speed during the effect.\r\n\r\nE- Heightened senses- Ravens attack speed, movement speed and attack damage are all increased. During this effect, if she uses wall run, she becomes a small raven that can fly around the map, she can&#039;t fly over walls but has even higher movement speed and the ending effect becomes much more powerful.\r\n\r\nAnd Finally\r\nR- Weapon Switch- Raven&#039;s  R ability has three buttons on it for faster, more specific switches, but when you press the button on your keyboard, it switches to the next one, in the order of, Shurikens, Knives, Magic. And her final form, Raven :) The Raven form has a 5-minute cooldown, so you must use it wisely. You only unlock Raven form at Lvl 11.\r\n\r\nIn Raven form.\r\n\r\nPassive- Raven can fly over walls, and perch on them, and her abilities become much more powerful, but only for a short duration.\r\n\r\nQ- Double Swipe- Raven dashes foes with her talons, dealing massive damage. She then comes back after and picks them up for a short period.\r\n\r\nW- Vulture- If Raven kills an enemy in this form, she feeds on their bodies, heals and gives an extra ten seconds to their death timer.\r\n\r\nE- Raven flies so high, only her shadow can be seen, and she becomes un-targetable for a few seconds, before smashing back down, dealing damage, and slowing enemies, this effect happens in a massive raven shaped effect on the ground. \r\n\r\nR- Raven- Raven screams and falls out of her raven form. She stuns herself for a few seconds, and then gets back, with slightly drained stats.\r\n\r\n\r\nOK, so I know I dreaming, but isn&#039;t it a cool idea, I mean she is so versatile and so cool. Anyway, BYE GUYS{{champion:34}} {{sticker:slayer-jinx-catface}}","replies":[]}