{"poster":"Wizzelgarden","date":"2016-05-19T13:26:17.909+0000","title":"Noch einer, der grundlos gebannt wurde. Bitte lest euch das hier mal durch!!","subforum":"Spielerverhalten & Moderation","up_votes":3,"down_votes":8,"body":"Ich wurde von Montag auf Dienstag permanent gebannt. In der E-Mail stand, dass ich Dritt-Anbieter-Software verwendet habe. Allerdings habe ich absolut NICHTS der gleichen gemacht bzw. verwendet. \r\nDaraufhin habe ich in meiner Verzweiflung den Riot Support angeschrieben. Der meine jedoch nur, dass ich Exploits ausgenutzt habe bzw. geskriptet habe.\r\n\r\nAuf meine Nachfrage, ob sie denn da ganz sicher sein, weil ich ja WIRKLICH NICHTS gemacht habe, wurde das nur bejaht, &quot;wir verh&auml;ngen solche Strafen nur wenn wir ganz sicher sind&quot;. Seit dem habe ich keine Antwort mehr vom Support auf weitere Nachfragen bekommen.\r\n\r\nMein Wort bringt dem Support zwar auch nichts, aber ich habe zu 100% nichts gemacht. Und was mich jetzt gerade noch richtig daran aufregt. \r\n\r\nIch sehe hier 5 Threads innerhalb der letzten 24 Stunden von Leuten, die auch alle grundlos gebannt wurden, auch alle wegen angeblichen skripten. Und das nur im Deutschen Bereich. Und ich wette es gibt noch viel mehr, die einfach (noch) keinen Foreneintrag geschrieben haben.\r\n\r\nEs ist klar, das die Software von Riot, die solche Hacker ausfindig macht, nicht perfekt sein KANN, keine Frage. Aber ich bitte doch wenigstens darum, dass wenn jemand den Support in voller Verzweiflung anschreibt, dass er wenigsten ernst genommen wird. \r\n\r\nIch hatte das Gef&uuml;hl, dass ich ihn ihren Augen einfach nur &quot;Ein Hacker bin der es nicht zugeben will&quot;. \r\n\r\nDer Support bzw das Riot Team kann sich doch mal bitte ernsthaft &uuml;berlegen, ob es nicht momentan einen Fehler im System gibt. \r\n\r\nIhr k&ouml;nnt mir doch nicht erz&auml;hlen, dass alle Leute jetzt im Forum nur so tuen, all wenn sie nichts gemacht h&auml;tten, dass ist ja l&auml;cherlich. Und gerade die Tatsache dass es so viele sind, und alle AUCH WEGEN ANGEBLICHEN SKRIPTEN gebannt wurden, best&auml;rkt doch nur dass es sich um einen Fehler handeln MUSS.\r\n\r\nIch bitte den Support inst&auml;ndig, sich der Sache anzunehmen und die Accounts freizuschalten. Von mir aus auch mit vor&uuml;bergehenden Einschr&auml;nkungen oder &auml;hnlichem.\r\n\r\nAber es kann doch beim besten Willen nicht sein, dass mehrere Leute einfach grundlos gebannt werden, und dann vom Support nicht mal ernst genommen werden.\r\n\r\nKlar ist der Support immer h&ouml;flich etc. Aber alleine, dass die Nachrichten die man von ihnen erh&auml;lt auf das Komma genau die Gleichen sind. Ich bekomme trotzdem das Gef&uuml;hl, hier nicht ernst genommen zu werden.\r\n\r\nBitte Riot, sucht nach der offensichtlichen Schwachstelle bzw Fehlerquelle in eurer Software und entbannt mich und die anderen User, die nichts verbrochen haben.\r\n\r\nMit freundlichen Gr&uuml;&szlig;en,\r\nLeon","replies":[{"poster":"flak2k","date":"2016-05-19T15:11:29.966+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=487970657250726f,realm=EUW,application-id=KYnfKGf0,discussion-id=APljNtJE,comment-id=,timestamp=2016-05-19T13:26:17.909+0000)\n>\n\n> Auf meine Nachfrage, ob sie denn da ganz sicher sein, weil ich ja WIRKLICH NICHTS gemacht habe, wurde das nur bejaht, &amp;quot;wir \n> verh&amp;auml;ngen solche Strafen nur wenn wir ganz sicher sind&amp;quot;. Seit dem habe ich keine Antwort mehr vom Support auf weitere Nachfragen bekommen.\n\n> Ich habe tatsächlich vor einem halben Jahr mal MKLoL bentutz. Seit dem ein Freund aber einen Ein-Tages-Ban deswegen bekommen hat, habe ich es sofort deinstalliert.\n> Ich selbst wurde aber damals nie verwarnt oder ähnliches..\n\n\nIch verstehe die Aufregung nicht. Du gibst ja selbst zu, dass du MKLoL verwendet hast.\nInsofern stimmt das \"WIRKLICH NICHTS\" nicht und Riot hat dich dafür gebannt.","replies":[{"poster":"Wizzelgarden","date":"2016-05-19T15:14:27.369+0000","up_votes":1,"down_votes":0,"body":"Naja, vor ca einem halben Jahr benutzt, nie eine Verwarnung oder ähnliches dafür bekommen.Dann deinstalliert. Und nach einem halben Jahr werde ich dann dafür permabanned?!","replies":[{"poster":"flak2k","date":"2016-05-19T15:25:01.240+0000","up_votes":3,"down_votes":0,"body":"Aber die Situation ist damit eine andere, als du in dem ersten Post dargestellt hast.\nJa, du hast geskriptet.\nJa, du hast das vor einen halben Jahr eingestellt.  (Weil du gemerkt hast, dass man dabei erwischt werden kann)\nJetzt erbittest du Kulanz, weil das schon lange her ist und du die nie wieder skripten wirst, anders ausgedrückt du willst du angemessene Bestrafung diskutieren.\n\nGrundsätzlich hat die Erkennung aber tadellos funktioniert und war KEIN false positive.\nDu bist ein weiteres Beispiel derer, die behaupten nie etwas getan zu haben. Wie bei alle anderen ist das aber falsch, aber du bist der Meinung das sollte nicht zählen.\n\nWas die Kulanz angeht, hängt das vielleicht auch von der Intensität der Nutzung ab, aber das ist nur eine Vermutung meinerseits.","replies":[{"poster":"Wizzelgarden","date":"2016-05-19T15:45:25.115+0000","up_votes":1,"down_votes":0,"body":"Naja, aber alle die früher die früher das Tool genutzt haben haben eine zweite Chance dafür bekommen","replies":[{"poster":"Wizzelgarden","date":"2016-05-19T15:46:36.153+0000","up_votes":1,"down_votes":0,"body":"Aber ist ja jetzt egal, es hat sich ja als Bug herausgestellt.","replies":[]}]}]}]}]},{"poster":"Shiny Absol","date":"2016-05-19T17:10:06.724+0000","up_votes":2,"down_votes":0,"body":"Es kann durchaus sein, dass du \"ausversehen\" gebannt wurdest, da ein anderer User wieder entbannt wurde (heute). Er wurde auch wie du in der Bann Welle gebannt und hat sich auch nichts zu schulden kommen lassen. Ein Freund von mir wurde heute auch entbannt. Der war ganz baff als er sich gestern eingeloggt hat und merkt er ist Perma gebannt xD Scheinbar hat Riot irgendeinen Fehler gemacht.","replies":[]},{"poster":"hshtagniemehrcdu","date":"2016-05-19T13:43:24.295+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=487970657250726f,realm=EUW,application-id=KYnfKGf0,discussion-id=APljNtJE,comment-id=,timestamp=2016-05-19T13:26:17.909+0000)\n>\n\n> Ihr k&amp;ouml;nnt mir doch nicht erz&amp;auml;hlen, dass alle Leute jetzt im Forum nur so tuen, all wenn sie nichts gemacht h&amp;auml;tten, dass ist ja l&amp;auml;cherlich. \n\nDoch, ganz genau das ist der Fall.\nDie einen behaupten es wider besseren wissens, andere denken, dass ihre Drittanbieter Programme/Makros etc ganz normal sind.\nSelbst Leute die einen Chatlog voll wüster Beleidigungen posten, behaupten, nichts gemacht zu haben.","replies":[{"poster":"Wizzelgarden","date":"2016-05-19T13:49:07.092+0000","up_votes":1,"down_votes":1,"body":"Blöd nur, dass es in den letzten Wochen/Monaten immer wieder vereinzelt vllt. eine Beschwerde alle 1-2 Tage gab, und jetzt auf einmal eine richtige Welle. Und selbst wenn alle lügen, ich wurde ja auch grundlos permabanned. \nOhne das ich MKLoL oder ähnliches benutzt habe..","replies":[{"poster":"Sirrkas","date":"2016-05-19T20:08:18.425+0000","up_votes":1,"down_votes":0,"body":"Das liegt daran, dass bei 3rd Party Programmen immer in Wellen gebannt wird. Da gibt es alle paar Wochen Leute, die alle gleichzeitig gebannt werden.","replies":[]}]}]},{"poster":"Humpelstilzche","date":"2016-05-19T13:34:57.219+0000","up_votes":2,"down_votes":0,"body":"Ich machs mal kurz: MkLoL benutzt?","replies":[{"poster":"MrManie","date":"2016-05-19T13:57:37.881+0000","up_votes":1,"down_votes":0,"body":"MKlol Tool was ist das überhaupt für ein ding????\nnur aus reiner neugier.","replies":[{"poster":"Wizzelgarden","date":"2016-05-19T14:03:27.231+0000","up_votes":1,"down_votes":0,"body":"Man kann alle Skins, die man jemals kaufen konnte, auch limitierte etc. kostenlos benutzten, aber man hat sie halt nur selbst gesehen, dh andere halt nicht.\nAußerdem hatte es einen Jungletimer, Wardskins und konnte das Spiel in Spectatormode aufnehmen","replies":[]}]},{"poster":"Wizzelgarden","date":"2016-05-19T13:45:35.261+0000","up_votes":1,"down_votes":0,"body":"Nein, ich weiß dass das kack Tool verboten ist.","replies":[]}]},{"poster":"LegendaryXenon","date":"2016-05-19T13:42:49.699+0000","up_votes":1,"down_votes":0,"body":"Wenn ihr euch so sicher seid, informiert den Verbraucherschutz oder einen Anwalt.  Sollte es aber auch nur kleinste Fehler eurerseits geben, verliert ihr garantiert.","replies":[{"poster":"ThisOneDiesALot","date":"2016-05-19T14:50:50.267+0000","up_votes":1,"down_votes":0,"body":"Es bringt weder was den Verbraucherschutz zu informieren noch sich einen Anwalt zu nehmen. Der europäische Sitz von Riot sitzt nämlich in Irland, wenn ich mich recht erinnere. Die Verbraucherschützer werden mit den Schultern zucken und die Anwälte jeden wieder vor die Tür setzen, denn was sie daran verdienen könnten wären vielleicht 100 euro für einen gewaltigen formellen Aufwand. Das wird niemand machen.","replies":[]},{"poster":"Wizzelgarden","date":"2016-05-19T13:49:59.014+0000","up_votes":1,"down_votes":0,"body":"Ja, man hat bestimmt große Chancen wenn man zum Anwalt geht.\nIch: \"Ich habe nicht geskriptet.\"\nRiot: \"Unser System sagt du hast geskriptet.\"\nVerloren....","replies":[{"poster":"LegendaryXenon","date":"2016-05-19T14:06:34.064+0000","up_votes":1,"down_votes":0,"body":"Ich denke nicht das es so einfach ist das abzucanceln, ob es den Aufwand wert ist bzw die Prozesskosten steht auf nem anderen Blatt. Es soll ja auch Anbieter geben die mit einem Anwaltsschreiben genauer prüfen.","replies":[]}]}]},{"poster":"Sihari","date":"2016-05-19T14:03:55.410+0000","up_votes":1,"down_votes":0,"body":"Wenn du MKLoL inder Vergangenheit genutzt hast und dadurch eine Verwarnung von RIOT bekommen hast, dann kann es sein, dass du zu unrecht gebannt wurdest. Vorhin hat ein RIOTler geschrieben, dass sie die Daten der Spieler, die damals MKLoL genutzt hatten fälschlicher Weise auch als Beweis für die neue Bannwelle genutzt haben. Wenn du zu diesen Personen gehörst, dann wirst du bald wieder entbannt, denn dieser Bann war tatsächlich nicht gerechtfertigt. Sollte das nicht bald passieren, dann schreib den Support noch einmal an.\nWenn du aber MKLoL nie genutzt hast, dann wird, auf welche Weise auch immer, dein Account einmal auf einem PC aufgerufen worden sein, auf dem ein schädliches Drittanbieterprogramm installiert war.","replies":[{"poster":"Wizzelgarden","date":"2016-05-19T14:05:25.186+0000","up_votes":1,"down_votes":0,"body":"Hey, hast du einen Link zu dem Post von dem RIOTler bitte?\nIch habe tatsächlich vor einem halben Jahr mal MKLoL bentutz. Seit dem ein Freund aber einen Ein-Tages-Ban deswegen bekommen hat, habe ich es sofort deinstalliert. \nIch selbst wurde aber damals nie verwarnt oder ähnliches..","replies":[{"poster":"SeaHorseCalamity","date":"2016-05-19T14:12:44.891+0000","up_votes":1,"down_votes":0,"body":"wenn du selbst nicht verwarnt wurdest könnte es schwierig für dich werden.\nin dem fall müsstest du das programm installiert haben, nachdem die bannwelle mit den warnungen rausgegangen ist.\nwenn das der fall ist könnte es schwierigkeiten geben. bleib auf jeden fall dran. wer nicht ruft wird nicht gehört.","replies":[{"poster":"Wizzelgarden","date":"2016-05-19T14:28:05.615+0000","up_votes":1,"down_votes":0,"body":"Naja, vllt wird mein Account in Zuge der Zurücknahme der Permabanns auch entbannt.","replies":[]}]},{"poster":"Protective Puppy","date":"2016-05-19T14:11:25.616+0000","up_votes":1,"down_votes":0,"body":"http://boards.euw.leagueoflegends.com/en/c/player-behaviour-en/E7AuPQHJ-mkjogomklol-suspensions","replies":[{"poster":"Wizzelgarden","date":"2016-05-19T14:14:52.238+0000","up_votes":1,"down_votes":0,"body":"ok, danke dir :)","replies":[]}]}]}]},{"poster":"dat Zoidberg","date":"2016-05-19T14:02:10.598+0000","up_votes":1,"down_votes":0,"body":"Hier im Forum kannst du auf jeden Fall nichts erreichen. Ich vermute, der Support wird zudem gar keine Einsicht haben, welche konkrete Drittanbietersoftware verwendet worden ist. Sogenannte \"false positives\" sind mir bisher nicht bekannt. Vielleicht hat mal jemand anderes auf deinem System LoL gespielt und irgendetwas verwendet, wovon du aber nichts weisst.\n\nDas beste wird sein, sich auf den US-Forenbeitrag zu berufen laut dem Permabanns wegen mklol aufgehoben worden sind.","replies":[]},{"poster":"P4inHunt3r","date":"2016-05-19T13:50:55.707+0000","up_votes":1,"down_votes":0,"body":"das ist bei mir genau so ... ich hoffe das ist wirklich ein fehler von riot und das wird rückgängig gemacht denn das trifft momentan sehr viele ...","replies":[]},{"poster":"Uranbrennstab","date":"2016-05-19T13:45:37.850+0000","up_votes":1,"down_votes":0,"body":"Die Leute werden in Wellen gebannt. Also logisch das \"auf einmal\" alle damit ankommen. Und ja, es ist möglich und wahrscheinlich, dass alle lügen oder mindestens unwissend sind, was genau sie gemacht haben. Ich fände es auch besser, wenn einem genau gesagt wird, \"du hast das und das Programm benutzt.\" Aber das wird nicht passieren.","replies":[{"poster":"Wizzelgarden","date":"2016-05-19T13:51:30.629+0000","up_votes":1,"down_votes":1,"body":"Stimmt, ich bekomme nur gesagt dass ich skripte bzw Exploits ausgenutzt habe. Genaueres würde ja dafür sorgen - ausnahmsweise mal eine verständliche Begründung - dass es in Zukunft schwerer wird WIRKLICH skriptene Leute zu enttarnen.","replies":[]}]}]}