{"poster":"Coach Autoboost","date":"2019-07-03T22:32:59.596+0000","title":"Torneo de Teamfight Tactics #1 - 5 de Julio - Comunidad de Teamfight Tactics","subforum":"Teamfight Tactics","up_votes":4,"down_votes":2,"body":"**Hola bienvenidos al post del torneo #1 de Teamfight Tactics para LAN/LAS.**\r\n\r\n**Fechas:**\r\n 5 de Julio y 6 de Julio (Solo si es necesario el segundo dia, con suerte se acaba todo el 5 de Julio).\r\n\r\n**Requisitos:**\r\n1.- Tener una cuenta que pueda jugar Teamfight Tactics en **NA** (Por que NA? es un server neutral y porque si hago el torneo en LAS se quejan los de LAN, si lo hago en LAN se quejan los de LAS).\r\n2.- Estar en Discord, entrar al canal de #teamfight_tactics y obtener el rol de @Tactician (Solamente taggeame con @Autoboost en ese canal Y dime en que regiones juegan para darte el rol). Ejemplo: @Autoboost Juego en LAN/NA.\r\n3.- Tener una cuenta de Twitch (Por ahí estaré organizando el torneo cuando inicie y tratar de terminar rápido las rondas).\r\n\r\n**Formato:**\r\nMi plan inicial es hacer 7 lobbies, 6 de 8 jugadores y 1 de 7 jugadores, después el ganador de cada lobby jugara en un lobby final de 8, el ganador de esa partida se lleva el premio.\r\nEste formato quiere decir que pueden jugar un total de 55 jugadores, en caso de que se necesiten mas slots voy a tratar de ajustar el formato.\r\n\r\n**Premio:**\r\n10 USD al primer lugar + Rol de Discord \"Tactical God\" (Tal vez se agregan mas premios en lo que inicia el torneo).\r\n\r\n**Registro:**\r\nEl día Miércoles 3 de Julio se publicara un mensaje en el canal de #anuncios en Discord con un google form donde meterán sus datos y luego cuando haga el stream (5 de Julio), los estaré llamando para crear los lobbies, cuando terminen tienen que enviar un screenshot con su victoria en el canal de #teamfight-tactics para tener acceso al ultimo lobby.\r\n\r\n**Links:**\r\nDiscord: https://discord.gg/BxJYNCp\r\nFacebook: https://www.facebook.com/AutoboostLoL\r\nTwitch: https://www.twitch.tv/Autoboost","replies":[{"poster":"Runth","date":"2019-07-03T23:26:05.452+0000","up_votes":2,"down_votes":0,"body":"hacen un torneo en un modo en beta, q estupidez","replies":[{"poster":"romanelpro2","date":"2019-07-04T01:13:06.381+0000","up_votes":2,"down_votes":0,"body":"Lo que no entiendo, por que en NA... o sea, los de LAN a LAS no tienen ni distancia casi, es mas creo que suben 20 MS nomas.\n\nPero los de LAS se tienen que pasar a NA o tener una cuenta en NA y jugar con 180 MS?, siendo que los de LAN tienen muchos menos MS que LAS en NA. Medio crontadictorio todo, creo que no tiene las ideas muy claras.\n\nPero bueno, muchos de desesperan por ser \"los primeros\", por la exclusividad...","replies":[]}]},{"poster":"romanelpro2","date":"2019-07-03T22:47:55.364+0000","up_votes":1,"down_votes":0,"body":"Sin ofender... no podes man hacer un torneo de un modo de juego que tiene mas bugs que el viejo mordekaiser.\n\nCreo que para que te salga bien, deberias esperar que arreglen los bugs, como consejo solamente, despues es decision tuya, pero ahi va a sacar ventaja uno sobre otro por los bugs. Saludos.","replies":[{"poster":"SeanFelices","date":"2019-07-03T23:18:06.242+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=romanelpro2,realm=LAS,application-id=EGxEJBjs,discussion-id=a9OgE9Xg,comment-id=0000,timestamp=2019-07-03T22:47:55.364+0000)\n>\n> Sin ofender... no podes man hacer un torneo de un modo de juego que tiene mas bugs que el viejo mordekaiser.\n> \n> Creo que para que te salga bien, deberias esperar que arreglen los bugs, como consejo solamente, despues es decision tuya, pero ahi va a sacar ventaja uno sobre otro por los bugs. Saludos.\n\nPoder, puede y lo hace. Los que compitan tienen en claro que es una Beta.\n\nSaludos .","replies":[]}]}]}