{"poster":"TSM Kutter","date":"2018-03-03T06:41:30.290+0000","title":"Gracias Riot.","subforum":"Charlas Generales","up_votes":1,"down_votes":3,"body":"Acabo de perder una partida con un afk desde el minuto 1 y no nos dejaron tirar remake, gracias desde ya, no hacen una bien.","replies":[{"poster":"PIÑERAq1o","date":"2018-03-03T06:49:45.208+0000","up_votes":1,"down_votes":0,"body":"para algo existe el surrender a los 15 xd","replies":[{"poster":"Nine Iota","date":"2018-03-03T06:58:39.469+0000","up_votes":4,"down_votes":0,"body":"El surrender te saca puntos, el remake no","replies":[]}]},{"poster":"Pialsato","date":"2018-03-03T08:14:10.055+0000","up_votes":2,"down_votes":2,"body":"Tu: Gracias Riot\nRiot: De nada Capo","replies":[{"poster":"RAYORM999","date":"2018-03-03T14:54:40.469+0000","up_votes":1,"down_votes":0,"body":"bueno tu juegas normales y no sabes de clasificatorias, con tu comentario ignorante no tienes por que estar hablando aqui, cuando deberia ser diferentes sanciones clasificatorias y normales jajaja, algo mas inteligente podias decir. pls","replies":[{"poster":"Pialsato","date":"2018-03-03T15:41:55.870+0000","up_votes":1,"down_votes":1,"body":"No juego clasificatoria? Algo mas inteligente no podias decir?\nAdemas el ignorante eres tu ni 10 clasis has jugado  puedes usar mejor tu razonamiento antes de hablar pls jajajja","replies":[{"poster":"RAYORM999","date":"2018-03-03T23:52:13.678+0000","up_votes":1,"down_votes":1,"body":"tengo dos cuentas  jajaja y si se lo que hablo que al final dijiste inversamente lo que dije yo, pobre piensa un poco lo que dirás sin que sea lo que dije yo porfa","replies":[{"poster":"Pialsato","date":"2018-03-04T01:57:20.678+0000","up_votes":1,"down_votes":1,"body":"Bueno lo q tu digas  eres uno mas q piensa q tiene razon dice no juego clasificatoria jajajaj y por si no sabias lo ultimo fue para  burlarme ovbiamente necesitas un mejor razonamiento piensa un poco pobre  jajajjs","replies":[{"poster":"RAYORM999","date":"2018-03-04T04:22:06.560+0000","up_votes":1,"down_votes":0,"body":"jajaja eso que me da risa que te metas en un tema que no tienes nada que ver, al final solo pasaste por aqui por lo aburrido que estabas y de seguro nadie te habla jaja, tipica rata que no tiene mas que hacer.","replies":[{"poster":"Pialsato","date":"2018-03-04T14:21:35.361+0000","up_votes":1,"down_votes":1,"body":"A mi me da risa la gente como tu q dicen q los otros son ratas cuando se nota bastante q tu si eres rata.\nY por si no sabias yo solo comente algo tu te metistes piensa bien antes de hablar se nota  q el q estaba aburrido de su vida eras tu","replies":[{"poster":"RAYORM999","date":"2018-03-08T00:58:25.418+0000","up_votes":1,"down_votes":0,"body":"me encanta como copias mis palabras cambiándolas textualmente jajajaja de seguro pasas todo el día al frente del monitor de tu pc en foto o jugando jaja , has algo productivo ratita mantenida","replies":[{"poster":"Pialsato","date":"2018-03-08T04:01:13.062+0000","up_votes":1,"down_votes":1,"body":"A mi me encanta lo rata q eres q me contesta despues de 4 dias no tenias nada mejor que hacer raton? Se te acabo el queso? Tus papis ya no te mantienen o q cosa jajajaj","replies":[{"poster":"RAYORM999","date":"2018-03-17T19:29:33.214+0000","up_votes":1,"down_votes":0,"body":"si te contesto a los dias sera por que tengo cosas  que hacer tengo una vida, no como tu que pasas pendiente aca ratonsito, jajaja ni sabes que decir, de verdad siento lastima por ti, deberías salir al mundo exterior a socializar  jajaj pobresito","replies":[{"poster":"Pialsato","date":"2018-03-17T23:17:40.800+0000","up_votes":1,"down_votes":0,"body":"Jajajajja no sabes q decir y solo dice ratoncito  en todo lo que pones y si supongo que tienes una vida no despues de todo eres un raton de alcantarilla tienes q buscar un lugar para dormir xq ni tus padres te quieren juntos Xd Xd Xd me da lastima tu vida jajajjajaj y por si no sabias tengo una vida, tengo obligaciones pero sabes que se organizar mi tiempo no como tu pequeño raton anda a tu madriguera nomas o busca queso  que eso seguro nomas haces","replies":[]}]}]}]}]}]}]}]}]}]}]},{"poster":"Danshid","date":"2018-03-03T14:46:47.914+0000","up_votes":1,"down_votes":0,"body":"el remake solo esta si no se pudo conectar, si compro items es un afk mas","replies":[{"poster":"TSM Kutter","date":"2018-03-03T23:45:16.987+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Danshid,realm=LAS,application-id=v7qsfXsE,discussion-id=KvK6nJ9K,comment-id=0003,timestamp=2018-03-03T14:46:47.914+0000)\n>\n> el remake solo esta si no se pudo conectar, si compro items es un afk mas\n\nNo compró items, y nunca se conectó, es la última partida que jugué con Shaco, se puede ver claramente","replies":[]}]},{"poster":"Urxnium","date":"2018-03-03T15:22:55.534+0000","up_votes":1,"down_votes":0,"body":"-Riot: De nada.","replies":[]},{"poster":"TSM Kutter","date":"2018-03-03T07:28:11.240+0000","up_votes":1,"down_votes":2,"body":"Claro, me tengo que fumar una partida entera (no se querían rendir) y encima que me quiten puntos por un error del juego? Dejá nomás.","replies":[]}]}