{"poster":"Jayrassic","date":"2015-12-19T16:41:26.703+0000","title":"[Gameplay] Fiddle sticks Ultimate instantly casting.","subforum":"Report a Bug","embed":{"description":null,"url":"https://i.gyazo.com/f1ce985ceb427d7dbe777f5bb65bf5a2.gif","image":null},"up_votes":56,"down_votes":2,"body":"_**I HAVE ISOLATED THE CAUSE OF THIS BUG, SO IF YOU DON'T WANNA READ ALL THIS ORIGINAL POST CRAP. SCROLL DOWN**_\n\n* Please remember to upvote so this stays on top untill its fixed <3\n\nBeen playing a lot of fidd Lately, but today was one hell of a first for me. \nwas clearing my Raptors and then proceeded to try and ult on top of the Lucian and Ahri pushing our mid lane. and the moment i hit ult it went off. shot me to the destination. and then had fiddle flying around like he was Jesus for a bit. totally caught me off guard. i didn&#039;t even have the reaction time to throw any other spells out.\n\n~~but E Was on Cooldown. drain had just come off cool down a few seconds prior.~~ the only thing i can tell is i killed a small raptor with a auto at the same moment i pressed my ult almost? not sure if that would have any cause or relation to the issue. \n\n~~the items on me at the time were a stalkers blade, Needlessly large rod, boots, pink ward, and a biscuit that was being used before the ult cast. and was about half duration left in use when i casted the ult. ~~\n\n\nThis is a pretty crappy .Gif of what happened. but the game replay was saved on Op.GG If you wanna take a look at the game yourself. \nhttp://na.op.gg/summoner/userName=untoldfears\nThe start point of the replay on OP.GG is pretty much right before the ulting insta cast. \ngonna jump into a custom game tho and see if i can reproduce this right now. will update if i find anything else out.\n\n\n* UPDATE 1: I have managed to reproduce the instant cast Fiddle sticks ult. ~~while consuming a biscuit ~~and the instant i auto killed a little raptor by pressing ult there is no channel time required. going to try other ways now to see if this is doable in other instants\n\n*  Update 2: have confirmed that the Biscuit has nothing to do with the bug. as i just instantly ulted after killing a small raptor with a auto attack. going to now test this on other mobs and lane minions\n\n* Update 3: So far it seems the only requirement is that you cast your ult the very. VERY MOMENT your auto connects and kills a jungle mob or a minion. (have gotten it to work on small raptors. small wolfs, caster minion, and red buff small creatures. or w/e they're called\n\n* Update 4: Tried to reproduce this instant cast effect without smite as a summoner spell. it still works. makes me curious if to this is a fiddle sticks issue or. a channel skill issue?\n\n\n> _**TL;DR / Final Conclusion **_\n**FiddleSticks** can** _Instantly_ **cast his ult and **_ignore the Channel time_** if you are to attempt to cast it within a millisecond of a window frame of his auto attack animation when last hitting a minion or jungle creep. \n\n**_Rito Please Fixarino,_**\n\n_**THIS IS EASILY ABUSE-ABLE AND CAN BE A COMPLETE GAME CHANGER. SPECIALLY IN LANE. I DON'T LIKE SAYING THIS BUT PLEASE DISABLE MY STICK HUSBAND. AND FIX HIM WITH DUCT TAPE**_       \n ~~Feel free to buff him a little too while you're at it <3~~","replies":[{"poster":"Jayrassic","date":"2015-12-19T17:02:27.457+0000","up_votes":18,"down_votes":0,"body":"really wish this skill didnt have such a long cd while testing this.. haha{{item:3070}}","replies":[{"poster":"MeleeNuke","date":"2015-12-21T01:22:44.759+0000","up_votes":3,"down_votes":0,"body":"Sandbox mode rito pls.","replies":[]}]},{"poster":"Nekolie","date":"2015-12-20T00:41:27.027+0000","up_votes":5,"down_votes":0,"body":"This seems like the same bug that made instant recalling possible. I wonder if it works on more channels.\n\nSomeone should try {{champion:4}}'s Ultimate or {{champion:80}}'s. This might affect every single channel in the game.\n\nEdit: {{champion:154}}'s slingshot might be able to do it too. I'd be interested to see how it would affect {{champion:161}} or {{champion:19}} though.","replies":[]},{"poster":"jmaishere","date":"2015-12-19T22:49:05.475+0000","up_votes":2,"down_votes":0,"body":"Is it reproducible on any channel ult champion?","replies":[{"poster":"Jayrassic","date":"2015-12-20T09:41:52.036+0000","up_votes":4,"down_votes":0,"body":"i was to tired to try and test this but i'm gonna give TF And Pantheon a try out here in a bit and see if its possible.","replies":[{"poster":"Kiefziel","date":"2015-12-20T22:04:54.409+0000","up_votes":1,"down_votes":0,"body":"This bug does not appear to work with Karthus.  I tried on both the raptor camp and lane minions but he still requires the full channel to ult.","replies":[]}]}]},{"poster":"Kiefziel","date":"2015-12-20T21:48:16.340+0000","up_votes":1,"down_votes":0,"body":"I repro'ed this bug first try.  Get 6 then head to the raptor camp.  Three autos will nearly kill the baby raptors, then, while your final auto attack is mid-flight, hit R.  You'll instantly land wherever  your cursor is, ult active.\n\nIf this bug works on minions and other camps besides raptors, then the ease with which this bug can be exploited effectively makes Fiddle's ult broken.  Anyone could abuse this.","replies":[{"poster":"Jayrassic","date":"2015-12-20T21:59:45.271+0000","up_votes":3,"down_votes":0,"body":"I got it to work on everything i tried. caster minions. melee minions. and siege minions. gromp. red buff. Tried it on dragon once but he lived my auto with 1hp and i was to tired to try again ; ~; this is a insane exploit and a easy game changer for Lane Fiddle\n{{sticker:zombie-brand-mindblown}}","replies":[]}]},{"poster":"FistOfSharkiesha","date":"2015-12-20T14:22:53.285+0000","up_votes":1,"down_votes":0,"body":"Why the fuck haven't they given us a sandbox mode?... Shit like this is extremely difficult to test for when it's a 2minute+ cooldown.","replies":[{"poster":"Jayrassic","date":"2015-12-20T16:40:48.969+0000","up_votes":3,"down_votes":0,"body":"hahaha yea, i kept rush building CDR before i hit level 6 in a custom game. to help speed things up","replies":[]},{"poster":"Lû Bû","date":"2015-12-20T21:25:24.000+0000","up_votes":1,"down_votes":0,"body":"because SMITE is better, LOL=Runescape 3, SMite=GuildWars 2\n\n\nSimple","replies":[{"poster":"Jayrassic","date":"2015-12-20T21:54:46.544+0000","up_votes":1,"down_votes":0,"body":"eh, they're both fine in their own way, smite gets boring fast for me tho. like 2-3 games and im done for the day. but honestly all moba's are kinda poop in general. 8)","replies":[]}]}]},{"poster":"Hethalean","date":"2015-12-19T17:56:46.359+0000","up_votes":2,"down_votes":1,"body":"Is this related to the instant cast recall bug during the summer of 2015 I wonder?","replies":[{"poster":"Jayrassic","date":"2015-12-19T18:01:38.797+0000","up_votes":3,"down_votes":0,"body":"seems to be kind of its own breed. but pretty much the same concept. for the instant recall you had to have specific skills or buy a {{item:3077}} /{{item:3074}}  in order to get that to work. this seems to be a lot simpler in the means that _**all you have to do is cast your ultimate the very instant you auto to last hit a minion / jungle creep.**_","replies":[]}]},{"poster":"Disulfiram","date":"2015-12-19T17:19:28.962+0000","up_votes":2,"down_votes":4,"body":"If it works on minions, I think they should leave it in... it would make lanesticks way stronger, maybe strong enough to be actually viable as a laner.\n\nMaybe just mention it in the ulti's tooltip?\n\n{{sticker:slayer-pantheon-rainbows}}","replies":[{"poster":"Jayrassic","date":"2015-12-19T17:24:56.920+0000","up_votes":4,"down_votes":0,"body":"it takes some practice but this is easily abuse-able. and yea. i've only been able to pull it off once but it works on minions. but i've so far gotten it to work off minions. small wolfs. small raptors. and small red buff doods. \n\nPersonally i feel lane fiddle is stronger then jungle fiddle atm cause runeglaive is just a waste of gold on him :c","replies":[{"poster":"Disulfiram","date":"2015-12-19T17:31:49.925+0000","up_votes":2,"down_votes":1,"body":"As far as I know, they're adding a mini-{{item:3285}}  for AP junglers.\n\n{{sticker:slayer-jinx-catface}}","replies":[{"poster":"Jayrassic","date":"2015-12-19T17:34:48.233+0000","up_votes":2,"down_votes":0,"body":"yea, its a lovely alternative and im looking forward to it C: \nmain reason why i've been brushing up on fiddle again. getting my scarecrow hun bun out of the closet. \n\nThey're also making Luden's echo passive a \"Unique passive: Echo\" So you cant stack the two~","replies":[]}]}]}]},{"poster":"tsunami boy","date":"2015-12-22T06:38:14.155+0000","up_votes":2,"down_votes":0,"body":"I found a YouTube video of this glitch from about a month ago. It looks like this has been in the game for a while now {{champion:9}} . https://www.youtube.com/watch?v=EWgWgjPxJlU","replies":[{"poster":"Jayrassic","date":"2015-12-22T15:46:07.215+0000","up_votes":1,"down_votes":0,"body":"Jebus. Even more reason to try and keep this post afloat :c we know how it works now. and there ls even more video's of it now since this post. so hopefully Riot will take notice. simple game play bugs are one thing but. the fact this is insanely easy to replicate and. can be abused in ranks let alone anywhere else ~~(i mean yea its only preseason but... if you really wanted to free MMR boost before the actual season starts so you can place higher next time around? this is one hell of a way to get a free upper hand in a game...)~~","replies":[]}]},{"poster":"Disulfiram","date":"2015-12-20T21:58:33.686+0000","up_votes":2,"down_votes":0,"body":"Someone posted this on YouTube... looks like you can also proc this when killing wards.\n\nhttps://www.youtube.com/watch?v=82jfoA7ypRQ","replies":[{"poster":"Jayrassic","date":"2015-12-21T21:09:59.183+0000","up_votes":2,"down_votes":0,"body":"Yup yup it works on nearly anything it seems. the only thing i haven't been able to try is another champion. so long as you can last hit it. it seems to work. only things i have yet to try. Turret's and other buildings ofc. ZZ'Rot Portal, And other Champions and their passives. AKA Le blanc clone and Zac Jelly blobs. but from what everything else has proven. im sure its possible.","replies":[]}]},{"poster":"Quantum Lotus","date":"2015-12-20T00:49:51.452+0000","up_votes":1,"down_votes":0,"body":"I'm pretty sure the bug has to do with him auto attacking the raptors. I only suspect this is the case because there are multiple auto attacking bugs live right now.","replies":[{"poster":"Jayrassic","date":"2015-12-20T09:44:42.619+0000","up_votes":2,"down_votes":0,"body":"its not just raptors. i gave i tested it on almost everything. gromp. raptors. minions, siege minions. all of it works. its just a matter of hitting your ult as you're last hitting something. and once you get into the groove of it. its insanely easy to reproduce.","replies":[{"poster":"Disulfiram","date":"2015-12-20T10:34:45.419+0000","up_votes":1,"down_votes":0,"body":"Is it only on last hits or does it work on not-deadly hits too?\n\nI would try this myself in a custom game, but I haven't been able to pull it off...","replies":[{"poster":"Jayrassic","date":"2015-12-20T10:55:16.846+0000","up_votes":2,"down_votes":0,"body":"unless i was just getting the timing off only when i don't last hit. it has to be a deadly hit. cause its gotten to the point where i can easily reproduce it at like 90% of the time on anything. but when i try it without last hitting it doesn't go. maybe im just bad :c","replies":[{"poster":"Disulfiram","date":"2015-12-20T11:44:01.886+0000","up_votes":1,"down_votes":0,"body":"Thank you.\n\nMight it have something to do with the Feast mastery then?","replies":[{"poster":"Jayrassic","date":"2015-12-20T12:46:55.512+0000","up_votes":2,"down_votes":0,"body":"seeing how i was using Double edged Sword instead of Feast. does not seem to be the case~","replies":[]}]}]}]}]}]},{"poster":"BIue Monk","date":"2015-12-20T00:27:31.765+0000","up_votes":1,"down_votes":0,"body":"The ultimate seems pretty instant, but is it dealing any damage ? You animated picture looks like it's actually doing no damage at all.","replies":[{"poster":"Jayrassic","date":"2015-12-20T09:41:00.429+0000","up_votes":2,"down_votes":0,"body":"Yes it still gets off its full damage. if you watch the minions around me are dying and there's gold income popping above Fiddle's head.","replies":[]},{"poster":"commit an hero","date":"2015-12-20T21:26:55.287+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=BIue Monk,realm=EUW,application-id=LqLKtMpN,discussion-id=eWTEzeiE,comment-id=0008,timestamp=2015-12-20T00:27:31.765+0000)\n>\n> The ultimate seems pretty instant, but is it dealing any damage ? You animated picture looks like it's actually doing no damage at all.\n\nI looked at the reply and it did no damage.","replies":[{"poster":"Disulfiram","date":"2015-12-20T21:54:57.044+0000","up_votes":1,"down_votes":0,"body":"At the start of the gif in this thread Lucian is full HP, while when Fiddle retreats he already lost quite a bit, even though the tower did not target him and Fiddle didn't use other skills... saying that Fiddle's ulti is responsible for that missing HP seems like a pretty safe guess.","replies":[{"poster":"Jayrassic","date":"2015-12-20T22:01:55.049+0000","up_votes":1,"down_votes":0,"body":"exactly lol. the only thing thats \"off\" with this is after the cast fiddle does the Jesus pose and fly's around like he's channeling. other then that its a full instant cast ult. Damage and all.","replies":[]}]},{"poster":"Jayrassic","date":"2015-12-20T21:57:23.005+0000","up_votes":1,"down_votes":0,"body":"then. how did Lucian get to half hp? and all the surrounding minions die at the same time? o-o... it does full damage. i've cleared countless minion waves when trying to replicate it and testing it out?","replies":[]}]}]},{"poster":"ImDoneBeingNice","date":"2015-12-21T22:35:42.364+0000","up_votes":1,"down_votes":0,"body":"Give's a new meaning to the Surprise Fiddle sticks skin","replies":[]},{"poster":"XShadowAlkX","date":"2015-12-21T20:29:16.805+0000","up_votes":1,"down_votes":0,"body":"Have you tested this with recall? or tp?","replies":[{"poster":"Jayrassic","date":"2015-12-21T20:42:01.680+0000","up_votes":1,"down_votes":0,"body":"yes i did. and to the best of my testing it did not work.","replies":[]}]},{"poster":"DEN15 512","date":"2015-12-20T20:30:40.177+0000","up_votes":1,"down_votes":0,"body":"damn this is actually really easy to abuse wtf\n\ngot it on my second try","replies":[{"poster":"Jayrassic","date":"2015-12-20T21:58:23.441+0000","up_votes":1,"down_votes":0,"body":"yup. insanely easy to pull off. and give you a massive upper hand if you plan fiddle in a lane. no reaction time. GG\n**RIOT PLEASE NOTICE ME AND FIX THIS**","replies":[]}]},{"poster":"Brynhildr","date":"2015-12-20T11:55:22.281+0000","up_votes":1,"down_votes":0,"body":"Like the fact that when you're moving after cast it looks like you are still channeling. Go back to the Cornfields Fiddle you're drunk.","replies":[]},{"poster":"Catastrop","date":"2015-12-20T00:18:55.283+0000","up_votes":1,"down_votes":0,"body":"It also happened with on LotPK. While dashing to the Poro King, I targetted the area close to him because their were 3 enemies grouped and it immediately went off.","replies":[]},{"poster":"Suicidal4Link","date":"2015-12-21T03:00:43.752+0000","up_votes":1,"down_votes":1,"body":"RIP","replies":[]},{"poster":"Only Play Darius","date":"2015-12-20T10:03:03.206+0000","up_votes":1,"down_votes":1,"body":"{{champion:30}} test please","replies":[]},{"poster":"Troll for Trump","date":"2015-12-20T08:46:26.948+0000","up_votes":1,"down_votes":1,"body":"Spaghetti coding","replies":[]},{"poster":"Hoetry in Motion","date":"2015-12-20T00:13:20.096+0000","up_votes":1,"down_votes":1,"body":"This looks like fun...\n{{champion:103}} {{champion:103}} {{champion:103}} {{champion:103}}","replies":[]},{"poster":"BIue Monk","date":"2015-12-19T23:53:50.095+0000","up_votes":1,"down_votes":1,"body":"Even with this bug as the normal behaviour, Fiddle wouldn't be playable atm, so its K.","replies":[]}]}