{"poster":"Geaari","date":"2015-11-19T13:43:43.696+0000","title":"Mejora en la selección de campeones en clasificatoria.","subforum":"Charlas Generales","up_votes":1,"down_votes":7,"body":"Qu&eacute; tal, \r\n  Como les va, bueno, capaz es algo que ya han repetido varias veces, juego desde pr&aacute;cticamente la season 3 o 2 la verdad no me acuerdo, pero quer&iacute;a preguntar, es posible poner un bot&oacute;n que diga Quit, en la selecci&oacute;n de campeones?. O es necesario si o s&iacute;, cerrar el cliente?.","replies":[{"poster":"Hwaxinghz","date":"2015-11-19T13:53:37.260+0000","up_votes":1,"down_votes":2,"body":"Es necesario cerrar si o si el cliente... Lamentablemente no se ha aplicado ese botón aún. Proximamente lo van a aplicar con la nueva selección de campeones.","replies":[{"poster":"Neo Gaussrik","date":"2015-11-19T14:26:16.180+0000","up_votes":4,"down_votes":0,"body":"Esto no es cierto! ^^;\n\nLa nueva seleccion de campeones tiene algunas instancias que equivalen a un \"dodge\", como no bloquear o elegir un campeon cuando es tu turno, pero a mi saber no hay ni hay planes de agregar un boton para esquivar partidas.","replies":[{"poster":"Kyousuke","date":"2015-11-19T14:29:29.006+0000","up_votes":2,"down_votes":0,"body":"pero seria bueno que agregaran eso para salir de la partida para evitar tener que relogear, sigue comiéndose la sanción pero almenos no tiene que esperar a que vuelva a abrir el cliente \n\npd: el foro esta cambiado no?","replies":[{"poster":"Neo Gaussrik","date":"2015-11-19T14:44:28.619+0000","up_votes":2,"down_votes":0,"body":"Pensamos que es mejor evitar que los jugadores sientan que quieren salirse de una partida, ya que asi disminuimos el tiempo que toma entre presionar el boton \"Jugar\" y en efecto estar en una partida.\n\nPD: Cambiado como?","replies":[{"poster":"Kyousuke","date":"2015-11-19T15:22:37.987+0000","up_votes":1,"down_votes":0,"body":"si hay uno que dice \"mid o afk main teemo filo infinito\" y ves su historial con 15 derrotas seguidas igualmente vas a irte por mas que no tenga el boton XD no lo considero incentivar ya que si se va lo hace por que quiere y sabe las consecuencias.\n\nno veo bien los comentarios de respuestas y esta todo uno bajo del otro en lugar de respuestas en recuadros","replies":[{"poster":"yOCobain","date":"2015-11-19T15:29:37.661+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=yuichikun,realm=LAS,application-id=v7qsfXsE,discussion-id=pKnnEgTV,comment-id=00000000000000000000,timestamp=2015-11-19T15:22:37.987+0000)\n>\n> si hay uno que dice \"mid o afk main teemo filo infinito\" y ves su historial con 15 derrotas seguidas igualmente vas a irte por mas que no tenga el boton XD no lo considero incentivar ya que si se va lo hace por que quiere y sabe las consecuencias.\n> \n> no veo bien los comentarios de respuestas y esta todo uno bajo del otro en lugar de respuestas en recuadros\n\nPero no estas teniendo en cuenta los casos en los que empiezan con \"salganse gg perdemos\" porque en un pick poco convencional pero que puede servir.\n\nLa no existencia del botoncito ayuda a que no tengas a la conciencia diciéndote\" salite salite salite vas a perder\"\n\nMuchos entonces por lo que te digo puede que empiecen de mala manera peeo si la fórmula dio resultado... se va a arrepentir de todo lo qud decía.\n\nY esos casos ocurren MUCHO. No son una minoría","replies":[]},{"poster":"Neo Gaussrik","date":"2015-11-19T15:33:13.086+0000","up_votes":1,"down_votes":0,"body":"Y si elegir el carril en el que vas fuera antes de seleccion de campeones?\n\nEse jugador ya va mid. No tiene por que amenazar con irse, asi que este tipo de problemas al menos desaparece.","replies":[{"poster":"Kyousuke","date":"2015-11-19T18:32:53.491+0000","up_votes":1,"down_votes":0,"body":"igual siempre paso y siempre pasara, cuando no quieren en a la linea cierran cliente apenas agarran todas las posiciones que querías y no tenes ganas de jugar en la que te queda (soporte) seria lo mismo \n\npd: gaussrik no sabes alguna manera de bajar el peso del cliente? ya me pesa 32 gb y no quiero reinstalar D:\nsabes si van a poner algo en un futuro para que no ocurra eso? ","replies":[{"poster":"Neo Gaussrik","date":"2015-11-19T19:04:44.429+0000","up_votes":1,"down_votes":0,"body":"Creo que no estas entendiendo el concepto.\n\nEliges tu carril primero.\n\n*Despues* entras a seleccion de campeon.\n\nComo te vas a pelear por posiciones? -Tu- elegiste ir mid.\n\nPD: Nop. :/ El juego es pesado!","replies":[{"poster":"Kyousuke","date":"2015-11-19T19:57:25.445+0000","up_votes":1,"down_votes":0,"body":"es que a la mayoría le pesa 5-6-8 como mucho pero a mi ya 32 con tantas actualizaciones :| no quita los parches anteriores y eso lo hace pesado, hay otros juegos que cambian los datos para que el parche reemplace a los archivos en lugar de ir agregando mas y mas haciéndolo mas pesado cada parche.","replies":[{"poster":"Desaroll","date":"2015-11-19T21:55:31.137+0000","up_votes":1,"down_votes":0,"body":"Para empezar, puedes eliminar todos los archivos que hay en la carpeta \"Logs/\" (Por las dudas no borres las carpetas, vé 1 por 1 y borra los archivos. Son registros, se vuelven a crear luego).\n\nSi juegas hace mucho, esos archivos se acumulan.\n\nDudo que te libere demasiado, pero algo es algo.\n\nSuerte!","replies":[{"poster":"Kyousuke","date":"2015-11-19T22:04:42.568+0000","up_votes":1,"down_votes":0,"body":"ya lo hice anoche y se borraron 500mb nomas XD","replies":[{"poster":"Desaroll","date":"2015-11-19T22:50:27.548+0000","up_votes":1,"down_votes":0,"body":"Worth it (?) xD","replies":[]}]}]}]}]}]}]},{"poster":"Neroh","date":"2015-11-19T16:06:53.257+0000","up_votes":1,"down_votes":0,"body":"> no veo bien los comentarios de respuestas y esta todo uno bajo del otro en lugar de respuestas en recuadros\n\nJusto debajo del texto del creador del tema donde dice \"COMENTAR\" en grande, abajito sale un hipervinculo que dice **\"cambiar a vista cronológica\"** o **\"Mostrar en discusión\"** (según lo que tengas puesto actualmente).\n\nLa versión en **Mostrar en discusión** es la que tu dices que se ven cuadritos y bien citados los comentarios.","replies":[{"poster":"Kyousuke","date":"2015-11-19T18:26:59.006+0000","up_votes":1,"down_votes":0,"body":"{{sticker:slayer-pantheon-thumbs}} ten {{item:2052}}","replies":[]}]}]},{"poster":"LGBT Valentina","date":"2015-11-19T21:40:47.524+0000","up_votes":1,"down_votes":0,"body":"Pero creo que como jugador, sabes que es extremadamente molesto tener que cerrar cliente y abrirlo...\nTendrian realmente q poner un boton el cual varias veces le tengas que dar, cuando salis de 1 partida\nQuit? are u sure? y esperas 5 segundos\npodrian hacer algo realmente, o poner la X causa por la cual el jugador dodgea y que sirva como informacion (aveces report por X troll, si guardaran el chat de champ select)","replies":[]}]}]},{"poster":"Hwaxinghz","date":"2015-11-19T15:59:29.505+0000","up_votes":1,"down_votes":0,"body":"Me faltó ese pequeñísimo detalle... Solo que al seleccionar un campeón y luego dodgear te ponen 5 minutos de cola (20 si te saliste antes), en cambio, si no seleccionas campeón y dodgeas (o esperas al tiempo) te ponen de una 20 minutos de cola de baja prioridad (30 o más si te saliste antes).\n\nAhora, lo que he visto, si mal lo recuerdo un botón para salir (equivalente al cerrar el cliente) por eso lo comenté, pensé que era oficial. Pero bueno, no puedo decir nada","replies":[]}]}]},{"poster":"Im Her Oni san","date":"2015-11-19T13:55:55.613+0000","up_votes":2,"down_votes":0,"body":"el problema que hay con poner un boton de \"Quit\" o .. \"salir\" es que seria mucho mas dificil entrar a una partida pk todos se saldrian... \nesa es la respuesta que siempre dan a esta pregunta XDD\n {{sticker:slayer-jinx-catface}}","replies":[]}]}