{"poster":"Peel Your ADC","date":"2015-05-17T01:00:31.743+0000","title":"Volibear is very deceiving throughout most of the game in terms of power","subforum":"Gameplay","up_votes":8,"down_votes":6,"body":"You think you can just kill him at level 2 and don&#039;t have ignite? \n\nLevel 4? Time to fight voli without my jungler!\n\nIt&#039;s 3 minutes and 25 seconds into the game? Better stick around in my lane while jungle voli goes back to get his jungle item and heal up.\n\nLevel 6? His ult doesn&#039;t deal that much damage.\n\nNo way his passive will save him. I&#039;ll just dive him under tower.\n\nRip in many bite-sized pepperonis.\n\nEdit: For everyone who says he falls off late game-\n\n{{item:3800}} .\n\nHe wants the booty.","replies":[{"poster":"360D3GR3SS","date":"2015-05-17T01:43:33.286+0000","up_votes":1,"down_votes":0,"body":"He falls off simply because of extremely telegraphed play. All of his abilities are extremely low range and he himself has almost no peel besides a mediocre slow and a small distance flip. Honestly just a bad late game champion with a huge power pike in the early game.","replies":[{"poster":"macromite","date":"2015-05-17T02:07:50.973+0000","up_votes":7,"down_votes":1,"body":"Let me tell you a magical thing that you should think about next time you play voli. no one ever expects the flash q. no one.","replies":[{"poster":"360D3GR3SS","date":"2015-05-17T03:14:13.368+0000","up_votes":1,"down_votes":0,"body":"Very True! It gets me off guard all the time. I did take this into consideration, however I try to evaluate a champion's power excluding summoner spells as everyone has access to them. Flash can be powerful but honestly if it is your only means of getting to a target you are far less potent than other picks and less potent in general.","replies":[{"poster":"Peel Your ADC","date":"2015-05-17T14:42:13.348+0000","up_votes":1,"down_votes":0,"body":"If flash is your only way to avoid not dying to him, then he made a good choice in a pick.","replies":[{"poster":"360D3GR3SS","date":"2015-05-17T22:08:43.102+0000","up_votes":1,"down_votes":0,"body":"There is a reason league is dominated by mobile champions, any top picks can easily get away without flash.","replies":[{"poster":"Peel Your ADC","date":"2015-05-17T23:28:21.377+0000","up_votes":1,"down_votes":0,"body":"I have this nasty habit of banning things that are annoying to catch like Kalista or Leblanc. It helps.","replies":[{"poster":"360D3GR3SS","date":"2015-05-17T23:50:02.265+0000","up_votes":1,"down_votes":0,"body":"what about azir zed riven graves ezreal gragas leesin? you can't ban all mobile champions or even come close. Also if they land any sort of cc on you, you immediately lose you engage potential","replies":[{"poster":"Peel Your ADC","date":"2015-05-18T00:41:01.493+0000","up_votes":2,"down_votes":0,"body":"Implying that anyone plays Azir currently, it doesn't mean you just swaglyfe yolo your way into any ol blind pick. If they got a shitton of ways to deny you, then unfortunately you're gonna have to use your team as bait. Either that or don't attempt to start that kind of fight without them being distracted by your mid getting caught or something. Bloodlust is a good distraction.\n\nBut if Riven ever tries to fuck with Voli, she will get bitten. Two of her skills have to be used to just keep him off her, which means she isn't trading. If she isn't trading then she isn't a problem. If she does have the balls to press R, hit R as well and see who does more damage.","replies":[{"poster":"360D3GR3SS","date":"2015-05-18T01:04:44.829+0000","up_votes":1,"down_votes":0,"body":"IM talking about escaping, riven does not even have to fight him LOL. My whole argument is that he cannot effectively get to his target. Also you failed to address the other 30 champions that can easily escape, without flash, a volibear ","replies":[]}]}]}]}]}]},{"poster":"ABlueQuaker","date":"2015-05-17T03:21:36.977+0000","up_votes":1,"down_votes":0,"body":"{{item:3800}} + {{item:3111}}\n\nOr if any ally has:\n\n{{item:3271}} + {{item:3800}} + {{item:2138}}\n\nEDIT: Or even {{item:3069}} (Although Talisman really isn't a cost efficient item tbh because it's the only support item that provides NO MEANINGFUL combat stats)","replies":[]}]}]},{"poster":"ZephyrDrake","date":"2015-05-17T01:53:24.006+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=360D3GR3SS,realm=NA,application-id=3ErqAdtq,discussion-id=wrTYz0vO,comment-id=0001,timestamp=2015-05-17T01:43:33.286+0000)\n>\n> He falls off simply because of extremely telegraphed play. All of his abilities are extremely low range and he himself has almost no peel besides a mediocre slow and a small distance flip. Honestly just a bad late game champion with a huge power pike in the early game.\n\nyou have not played against good Volis have you? this is like saying that Nasus sucks late game, he doesn't. Voli is going to charge at you and he is most likely going to have some type of help getting there whether it's from an item he himself bought or from his team. He can also just flank you and destroy your backline rather easily while the rest of his team deals with your frontline","replies":[{"poster":"360D3GR3SS","date":"2015-05-17T03:15:59.556+0000","up_votes":1,"down_votes":0,"body":"You mean like every other jungler? One of the reasons voli has a bad late game is BECAUSE he relies on his team to do exactly what you just said.","replies":[{"poster":"ZephyrDrake","date":"2015-05-17T09:06:00.186+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=360D3GR3SS,realm=NA,application-id=3ErqAdtq,discussion-id=wrTYz0vO,comment-id=000100000000,timestamp=2015-05-17T03:15:59.556+0000)\n>\n> You mean like every other jungler? One of the reasons voli has a bad late game is BECAUSE he relies on his team to do exactly what you just said.\n\nso every jungler is bad late game, good to know","replies":[{"poster":"360D3GR3SS","date":"2015-05-17T22:07:47.097+0000","up_votes":1,"down_votes":0,"body":"LOL no sorry i was a not very clear:  \"voli can just flank you and destroy your back line\" every other jungler can do that.","replies":[]}]}]},{"poster":"BluePolarizer","date":"2015-05-17T07:22:39.730+0000","up_votes":1,"down_votes":1,"body":"Nasus does suck in the ultra late game because while his damage is uncapped his tankiness is capped. He gets rekt by 4 protect 1 comps with Kog, Jinx, Vayne, Cassiopeia or Azir in the 1 position. He is best in the mid-late game when tankiness and huge damage matter, whereas late game it is AOE and range that matter since everyone's damage is absurd.","replies":[{"poster":"Peel Your ADC","date":"2015-05-17T14:44:27.864+0000","up_votes":1,"down_votes":0,"body":"If you get to the point where it is lategame and everyone's damage is absurd, you should be dying for your country/team since they obviously were jerking off in every fight prior to 35 minutes. \n\nVoli is very disruptive since ignoring him gets everyone killed. His team doesn't take the chance to follow up? Well that's just natural selection in Ranked.","replies":[]}]}]}]},{"poster":"BluePolarizer","date":"2015-05-17T01:08:49.893+0000","up_votes":5,"down_votes":0,"body":"he falls off like a rock late game though so it's all good.","replies":[{"poster":"ZephyrDrake","date":"2015-05-17T01:11:20.883+0000","up_votes":3,"down_votes":2,"body":"> [{quoted}](name=BluePolarizer,realm=NA,application-id=3ErqAdtq,discussion-id=wrTYz0vO,comment-id=0000,timestamp=2015-05-17T01:08:49.893+0000)\n>\n> he falls off like a rock late game though so it's all good.\n\nhardly, the way his bite scales off his health and with his displacement abilities he doesn't fall off nearly as much","replies":[{"poster":"doublelift fg","date":"2015-05-17T15:22:20.190+0000","up_votes":1,"down_votes":0,"body":"his bite is physical, and everybody has 100 armor+ late game which reduce the damage by 1/2","replies":[{"poster":"ZephyrDrake","date":"2015-05-17T15:26:29.369+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=doublelift fg,realm=NA,application-id=3ErqAdtq,discussion-id=wrTYz0vO,comment-id=000000000000,timestamp=2015-05-17T15:22:20.190+0000)\n>\n> his bite is physical, and everybody has 100 armor+ late game which reduce the damage by 1/2\n\nbecause he will use his bite on the tanks","replies":[{"poster":"GloriousKaiser","date":"2015-05-17T15:36:13.820+0000","up_votes":2,"down_votes":0,"body":"{{item:3157}} {{item:3026}}","replies":[]},{"poster":"doublelift fg","date":"2015-05-17T17:08:43.138+0000","up_votes":1,"down_votes":0,"body":"if you have armor runes you starts with nearly 30 armor\nADC have 3.5 armor/lvl, this gives you 64 bonus armor. congrate it makes nearly 100\nand this is without a defensive itemsl like {{item:3026}} or {{item:3143}}  specialy omen which is the best against voli","replies":[{"poster":"Peel Your ADC","date":"2015-05-17T17:15:23.357+0000","up_votes":1,"down_votes":0,"body":"I remember there was a post further up that said lategame an adc will kill voli in 8-9 autos.\n\nIf an adc can rip through 240+ armor like that, why can't he?","replies":[]}]},{"poster":"Peel Your ADC","date":"2015-05-17T17:14:32.201+0000","up_votes":1,"down_votes":0,"body":"I'll bite anything missing over half their HP since the scaling is fun.\n\nAlso, he CAN take armor penetration. Doesn't need to be much. But he CAN take it.","replies":[]}]}]}]},{"poster":"CreationFlaw","date":"2015-05-17T01:50:09.576+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=BluePolarizer,realm=NA,application-id=3ErqAdtq,discussion-id=wrTYz0vO,comment-id=0000,timestamp=2015-05-17T01:08:49.893+0000)\n>\n> he falls off like a rock late game though so it's all good.\n\nwait what? Getting bit for 600 lategame doesn't feel like falling off when he can literally 1v1 almost anybody while being practically full tank ;o\nI've had Voli's just run through my team to the carry, cc and destroy them because movement speed steroid and a knockup, and a slow, and massive aoe damage with his ult ;-;","replies":[{"poster":"BluePolarizer","date":"2015-05-17T07:12:32.624+0000","up_votes":1,"down_votes":1,"body":"peel better. A late game ADC should be wrecking Voli in 8-9 autos (5 seconds) while you hold him down. When I play support or tanky top/jungle there's no Udyrs/Volis/random immobile melees that can get to my carries because I know how to peel.\n\nIf Voli is giving you so much trouble... how the hell do you survive against {{champion:120}} {{champion:11}} {{champion:24}} {{champion:238}} {{champion:7}} {{champion:105}} {{champion:39}}{{champion:102}}  who actually can get to your carries without taking hits, and who are either tanky as fk while dealing way more damage than Voli and have hard CC to boot, or are slippery as fk and kill carries in a few autos?","replies":[{"poster":"Peel Your ADC","date":"2015-05-17T14:40:17.943+0000","up_votes":1,"down_votes":1,"body":"Best part is that if the intended target lacks a lot of disengage on their own, they can get their peel and voli can effectively sandwich their frontline between himself and his follow up while thunder claws and the bite make approaching not the best idea.\n\nSo it's cool that Janna kept Kalista alive. What about the rest of the team? Gonna peel those bouncing lightning arcs off them too? Make them not have less than half health so the bite doesn't chunk them?\n\nAnd what exactly is an item build to shave off 4k of health and 240+ armor in 8-9 autos? I want to know what it is and use it.","replies":[]}]},{"poster":"Peel Your ADC","date":"2015-05-17T02:13:51.979+0000","up_votes":1,"down_votes":2,"body":"Lol just 600 health?\n\nHe rolls in, presses R and three auto attacks nearly kill a mage or adc because he's so stupidly deceptive.\n\nI love it :3","replies":[]}]}]},{"poster":"Sooko","date":"2015-05-17T02:07:37.867+0000","up_votes":1,"down_votes":0,"body":"One of the biggest misconceptions about Voli is that they should win early vs him.\n\nI don't know where the idea of Volibear being at his strongest late game came from, but man I have earned some kills off that. I mean, sure he becomes super beefy full build, but his damage is none, as well as his little utility.","replies":[{"poster":"Peel Your ADC","date":"2015-05-17T02:12:40.302+0000","up_votes":1,"down_votes":0,"body":"There are very few champions I'd want to play versus Volibear at any point in time. You literally cannot let him get into melee range and be squishy. Yes you need both.\n\nAt some point, someone is going to fuck up and get flipped with flash down and then all hell breaks loose","replies":[{"poster":"Sooko","date":"2015-05-17T02:20:08.012+0000","up_votes":2,"down_votes":0,"body":"A few things I can't stand as Volibear: Vayne, Cassiopeia, Teemo, Rylai's\n\nA good Q can win fights, but the kiting you get until that good Q arrives is dreadful. I feel literally exhausted once I am no longer ganking/laning as Voli and finally use my Q on somebody. Feels great to do it right though... Plus, with a Frozen Mallet, a Randuin's, a Chilling Smite and Righteous Glory, he becomes one of the stickiest mofos in the game. It did feel good to batter down that full tank Garen with my team's Malphite from our base all the way to theirs, slowly chipping his HP til he died.","replies":[{"poster":"Peel Your ADC","date":"2015-05-17T14:37:53.880+0000","up_votes":3,"down_votes":0,"body":"Vayne can go rot in a hole with Ezreal.\n\nIf I ever get first pick and want to voli, I have a tendency of banning things that are annoying to gank. Like Leblanc. Or Kalista. Or leblanc.","replies":[]}]}]}]},{"poster":"Shroom Junkie","date":"2015-05-18T00:48:34.669+0000","up_votes":1,"down_votes":0,"body":"I got first blood with Tryndamere with teleport and ignite summoner spells at about 1:00 against a Volibear.\nGot ignite? Got early game damage? Volibear? Where?\n:3","replies":[{"poster":"Peel Your ADC","date":"2015-05-19T22:51:53.433+0000","up_votes":1,"down_votes":0,"body":"Where in the hell would anyone be at a minute into the game to die?\n\nPeople are too busy checking reddit with league muted to even leave the base before 45 seconds","replies":[{"poster":"Shroom Junkie","date":"2015-05-19T23:58:47.542+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FioraTheExplora,realm=NA,application-id=3ErqAdtq,discussion-id=wrTYz0vO,comment-id=00070000,timestamp=2015-05-19T22:51:53.433+0000)\n>\n> Where in the hell would anyone be at a minute into the game to die?\n> \n> People are too busy checking reddit with league muted to even leave the base before 45 seconds\n\nIn lane.\nAnd, I rarely find someone who doesn't leave base before 1:00 without being DC'd.\n\nAnyway, I was in the bush closest to his tower, he came and I stealth hit him until he was in the bush then retaliated. He went full-in and by the time he tried to leave it was too late. I E'd(Spinning slash) in and killed him just as he got under tower. I ignited about 1/2 of his health in so his passive would only go 15%, and a lot less per second.","replies":[{"poster":"Peel Your ADC","date":"2015-05-21T00:53:31.433+0000","up_votes":1,"down_votes":0,"body":"Sounds like a scrub","replies":[]}]}]}]},{"poster":"Blue Collar Bear","date":"2015-05-17T17:23:30.141+0000","up_votes":1,"down_votes":0,"body":"....\n\nDo s/he got a booty?","replies":[]},{"poster":"My Desired Name","date":"2015-05-17T15:40:49.543+0000","up_votes":1,"down_votes":0,"body":"Volibear easily gets kited by ADC's lategame, but early and mid-game he is a freakin monster.","replies":[{"poster":"Peel Your ADC","date":"2015-05-17T17:12:56.485+0000","up_votes":1,"down_votes":0,"body":"He gets kited by certain adcs lategame, like Vayne Kalista or Ezreal.\n\nThe rest better have flash up or a support that loves them.","replies":[]}]},{"poster":"SleepyLionCub","date":"2015-05-17T04:10:41.440+0000","up_votes":1,"down_votes":0,"body":"Honestly, voli is never in a horrible position. And can get quite scary when fed. However his waveclear is very bad, and he doesnt have any ranged harass, or very long cc.","replies":[{"poster":"Peel Your ADC","date":"2015-05-17T14:46:15.751+0000","up_votes":1,"down_votes":1,"body":"Cinderhulk and maxing his E makes the whole waveclear problem manageable.\n\nDeath is a CC. He can inflict it the moment you make a mistake. Just win before you make a mistake and then yes, he has no long cc.","replies":[{"poster":"doublelift fg","date":"2015-05-17T15:23:44.907+0000","up_votes":1,"down_votes":0,"body":"his E has rofl damage if you max it you are doing terribly.","replies":[{"poster":"Peel Your ADC","date":"2015-05-17T17:12:13.603+0000","up_votes":1,"down_votes":0,"body":"Don't disrespect the creep fear. It's essential.","replies":[]}]}]}]},{"poster":"Vistha Kai","date":"2015-05-17T16:00:16.242+0000","up_votes":1,"down_votes":0,"body":"Voli hits minions 3 times, then bites you for 1000000 damage at level 2, because he has a doran's shield. RiP","replies":[]}]}