{"poster":"Peel Your ADC","date":"2015-04-14T05:12:04.069+0000","title":"Watching the dragon timer is pretty darn useful, but sometimes people just can't group for it","subforum":"Tips & Tricks","up_votes":2,"down_votes":1,"body":"We all have the timer since we actually took the last two. Now why in the heck is it so hard for some people to not notice the constant pinging over the dragon pit 45 seconds before it spawns?\r\n\r\nWe have timers for this very reason!\r\n\r\nIf you hear a shitton of pings, it probably means check the minimap and check a timer because either something is under seige and a jungle objective is up.\r\n\r\nAnd when we just let people get these objectives for free, it starts hurting a lot more gradually later on in the game, especially when it&#039;s contested super-late.","replies":[{"poster":"M4nTiCoR3","date":"2015-04-14T13:34:16.263+0000","up_votes":2,"down_votes":0,"body":"Knowing when to contest a dragon And when to take advantage of other free objectives instead is critical. If you can claim a tower or steal an enemy jungle buff or even take a baron while the enemy is busy at dragon the trade is much better than contesting a lost fight.\n\nBeing able to gage good fights seperates the good players from the bad. You really should never engage in a fight you don't have the overwhelming advantage in. If you don't find another fight or objective or minion wave to farm up Instead. At the end of the day, eventually everyone hits the level 18 and 6 item cap. If you can survive long enough it will boil down to one critical engament and whichever team picks the better fight will win or throw the game.","replies":[{"poster":"Peel Your ADC","date":"2015-04-14T13:50:40.780+0000","up_votes":1,"down_votes":0,"body":"I think the point was missed. It isn't about letting objectives go for something else of greater value. We have the power as a group to bully them off objectives when we have the right amount of people.\n\nIt just becomes irksome when we're doing well and all of a sudden they just swipe a free dragon because everyone decided to recall 20 seconds before it spawned for no reason whatsoever or go to the opposite side of the map, despite someone trying to bring attention to a certain point on the map. When someone feels the need to ping baron or dragon 6 times, its really upsetting to see the jungler go farm a wave of creeps slowly, taking smite along with them and then using it on creeps before joining their team over a lost objective.","replies":[{"poster":"M4nTiCoR3","date":"2015-04-14T13:55:48.664+0000","up_votes":3,"down_votes":0,"body":"Point taken. The inability of players to understand when to pressure and when to retreat is most infuriating. I find it amazing how many players win a fight and recall immediately when free objectives are on the map...like wise ones that do push and stay too long and get caught because they can't understand respwan timers and retreat pings. Makes me pull my hair out.","replies":[{"poster":"FedAsFuk","date":"2015-04-16T02:31:58.235+0000","up_votes":1,"down_votes":0,"body":"The main thing I see alot is people wanting to immediately be at dragon, but lets say you have no side wave control mid is in middle of lane, even if you are stronger and as long as you aren't giving 5th drag there are times to just give the drag over, hell even 5th drag is not instant GG. Back to point, if you risk losing a ton if the fight goes wrong, why risk it? The biggest thing in soloQ or even ranked 5s is just not throwing, get your lead play it aggressive but try to minimize risk, if you have all lanes pushing and can be at drag then great do that, if not don't go \"OMG top isn't here\" because they are pushing a wave that could take tower, they are minimizing the risk, which will actually win you more games.\n\nPeople focus so much on a dragon buff, when especially in soloQ the game timers are RARELY long enough for 5th drag, and if it gets to that point it is either one team unable to end despite being ahead and having multiple dragons stolen, sneaks, however the enemy team gets it or a team is facerolling and wants 5th drag just because, I can honestly not think of any situation where we needed 5th drag, \n\nAlso as far as giving away drag goes, it comes down to team comps, for example teams with terrible siege it is fine to give 2nd drag to because they will have a very hard time using it.","replies":[{"poster":"Peel Your ADC","date":"2015-04-17T00:59:08.537+0000","up_votes":1,"down_votes":0,"body":"So with the timer clearly displayed for all to see since we easily secured the last two with no hiccups because we're better at taking it if we have smite, why wait until drag is up to go push out a lane? What were you doing a minute and a half ago?\n\nPeople will do stupid stuff for baron, especially the team without it. Bait them into trying it and get an even bigger advantage.","replies":[{"poster":"FedAsFuk","date":"2015-04-17T01:44:57.436+0000","up_votes":1,"down_votes":0,"body":"Because they also can push waves, maybe the wave was pushed until 20 seconds before, it is better to stall then risk losing the fight and more, it does not matter if the dragon goes down at spawn or 15s later. If you give up a dragon for a big wave then give it to a carry, giving up a dragon is actually good for 300g in the pocket of your ADC or other carries","replies":[{"poster":"Peel Your ADC","date":"2015-04-18T04:50:46.074+0000","up_votes":1,"down_votes":0,"body":"Tell me more about how a Fiddlesticks and Volibear can shove a huge wave 20 seconds before a major objective is contested and then have time to run over to their team, position correctly and then still contribute to the fight rather than dealing with said huge wave a minute and half before the jungle camp spawned?\n\nCause for me, if there's dragon that we need coming up, I do this thing called \"pressuring the map\" where I give my team an advantage of making the enemy team choose between going back when low, leaving a minion wave at their top tower with our teleporting splitpusher ready to knock it down and generally make splitting up seem like a bad idea.\n\nNow if I can do it and then communicate what I'm doing, what stops others?","replies":[]}]}]}]}]}]}]},{"poster":"IcyPepper","date":"2015-04-14T05:15:33.448+0000","up_votes":1,"down_votes":0,"body":"It really depends at times, like on what side you're on, your team comp, and how ahead/behind you are.\n\nI've seen people with heavy losses continue to force teamfights, going \"Group group group group\" without even proper positioning. Strength in numbers does not mean much if the enemy team has more gold, better teamfighting, and better tactics. It's just like the infamous \"group mid\" people used to say when losing.\n\nIf you're ahead, I agree with you. Contest dragon if your team is capable of it, and prepare ahead of time instead of grouping up at the last second. But even if you're behind, don't let them take it for free. Try to take a tower as trade, do Baron if it's late-game, or try stealing it.","replies":[{"poster":"Peel Your ADC","date":"2015-04-14T05:19:41.759+0000","up_votes":1,"down_votes":0,"body":"It's not about grouping up like we're in bronze.\n\nIt's about the guy with smite needs to be down here before the other guy with smite shows up and just takes it. Vision control around the pit before it spawns puts pressure on the enemy team to make risky plays and get caught out trying to get the timer.\n\nGetting caught out can make it so that one less person is there to help.\n\nOne less person around after dragon turns into a free tower.\n\nYou got two dragons before easily. Why just give up one for no reason whatsoever?","replies":[{"poster":"IcyPepper","date":"2015-04-14T05:25:03.591+0000","up_votes":1,"down_votes":0,"body":">You got two dragons before easily. Why just give up one for no reason whatsoever?\n\nI'm just speaking in general. If I already got two dragons, people already know what they're doing by then and can easily secure a third (or at least I'd hope).\n\nAnd scuttlebug is nice. Always secure it if possible.","replies":[{"poster":"Peel Your ADC","date":"2015-04-14T05:32:53.560+0000","up_votes":1,"down_votes":0,"body":"Yeah you'd think that. But its really weird how the jungler just goes to farm krugs when dragon spawns at 25-30 minutes, show up late, die, and suddenly that's a tower or baron.\n\nScuttlebug? The thing we kill 45 seconds before drag spawns or the thing we hit while contesting the dragon 20 seconds AFTER it spawned?","replies":[{"poster":"IcyPepper","date":"2015-04-14T05:34:48.175+0000","up_votes":1,"down_votes":0,"body":"Not all junglers do that, only bad ones. Please don't generalize us :(\n\nAnd scuttlebug before! Before! Makes contesting dragon easier when everyone's moving like a cheetah to zone out the enemy.","replies":[{"poster":"Peel Your ADC","date":"2015-04-14T05:40:19.525+0000","up_votes":1,"down_votes":0,"body":"When junglers actually do that, it makes me instantly regret not jungling myself.","replies":[{"poster":"IcyPepper","date":"2015-04-14T05:42:28.951+0000","up_votes":1,"down_votes":0,"body":"If I know I can't take the dragon, I do something else.\n\nI suck at Volibear, and I found this out the hard way, but I managed to take a tower (and almost another) while my team stalled the enemy at dragon.\n\nAlways get something for something, never let the enemy get a complete advantage!","replies":[{"poster":"Peel Your ADC","date":"2015-04-14T05:44:43.460+0000","up_votes":1,"down_votes":0,"body":"It's when people literally just let it happen! We're all full health, went back, bought some items, they were kinda low and had to back after we did.\n\nAnd then we just wait for them to get nice and charged up before doing an objective. And play the game on mute since six pings over dragon pit are annoying to hear and must mean it's time to farm on the other side of the map.","replies":[]}]}]}]}]}]}]}]}]}