{"poster":"Tenken","date":"2016-07-15T02:49:48.239+0000","title":"''La Espada Celestial'' Capítulo 18: El Valor de los Yordles","subforum":"Creaciones de la comunidad","up_votes":18,"down_votes":1,"body":"Hola a todos, se que he estado ausente &uacute;ltimamente, pero ahora que sal&iacute; de vacaciones puedo dedicarme a mis cosas, entre ellas poder continuar con mi historia e iniciar con la nueva saga que se viene pr&oacute;ximamente; espero les guste este cap&iacute;tulo.\n\nComo siempre, les dejare los temas de los cap&iacute;tulos en un comentario.\n\n[**Cap&iacute;tulo Anterior**](http://boards.las.leagueoflegends.com/es/c/creaciones-de-la-comunidad/hiQjyru8-la-espada-celestial-capautulo-17-los-visitantes)\n\n----------------------------------------\n\n&lsquo;&rsquo;_Ha llegado el momento, pero esta vez parecemos tener apoyo_ &rsquo;&rsquo;\n\nLa b&iacute;peda maquina se puso de pie lentamente; era algo que jam&aacute;s hab&iacute;a visto, muy diferente a los enormes golems que custodiaban la entrada de la **Academia de Pilt&oacute;ver** y que a veces serv&iacute;an para experimentos y muchas veces como m&aacute;quinas de carga.\n\nEste ten&iacute;a una enorme cabina en el torso de su cuerpo, del cual no se distingu&iacute;a si pose&iacute;a piloto, a pesar de que la voz escuchada anteriormente parec&iacute;a indicar que s&iacute;; adem&aacute;s de poseer armas a la vista; sus brazos parec&iacute;an estar listos para masacrar al enemigo, un taladro en el izquierdo y un gran ca&ntilde;&oacute;n en el derecho.\n\n-&iquest;No me escuchaste?, su&eacute;ltala o veras lo que es bueno, te dar&eacute; 5 segundos- Dijo una decidida voz desde dentro de aquel hombre de hierro, con sus brazos apuntando al enorme invasor y sus compa&ntilde;eros.\n\n-1, 2 &hellip; &iexcl;5!- Grit&oacute; la m&aacute;quina, encendiendo sus dos pies y embistiendo al hombre, haciendo que casi perdiera el equilibrio y cayera al suelo, pero soltando a **Tristana** quien parec&iacute;a estar bien.\n\n-Ll&eacute;vensela de aqu&iacute; y p&oacute;nganse a salvo, yo me encargar&eacute; de esto- Dio la orden, siendo obedecida por los **Yordles** que presenciaban el heroico acto del inc&oacute;gnito piloto.\n\nComenz&oacute; a golpear al resto de los invasores, riendo cuando ellos hac&iacute;an sus pobres intentos por contraatacar a aquel invencible hombre de acero; algunos disparaban contra &eacute;l, pero aquellos impactos rebotaban por un escudo que proteg&iacute;a su enorme cuerpo, record&aacute;ndome aquel traje protector que use para escapar del **Cuartel general de Pilt&oacute;ver**.\n\n-Mejor ni me lo muevan- Dijo el piloto, tenia cierto tono burlesco y arrogante; o quiz&aacute;s estaba demasiado emocionado luchando.\n\nDe su brazo derecho salieron unas brillantes llamas que hicieron retroceder a la mayor&iacute;a de sus atacantes; aquella maquina parec&iacute;a tener una gran cantidad de accesorios dentro de &eacute;l, incluso en un momento comenz&oacute; a salir m&uacute;sica de dentro de &eacute;l; tal cual como la tienen la mayor&iacute;a de los transportes, como la nave de **Corki**.\n\n-&iexcl;Mas estilo no puedo tener se&ntilde;ores!, ahora, &iquest;Quien sigue?- Pregunt&oacute; mientras segu&iacute;a reduciendo a los **Noxianos** que intentaban atacarlo.\n\n---------------------------\n\nA pesar de que me gustar&iacute;a pasar desapercibido en esta ocasi&oacute;n, no pude evitar sentirme algo agradecido con dicha acci&oacute;n, sin duda tendr&iacute;a que ayudar nuevamente.\n\nMi mente intent&oacute; r&aacute;pidamente de analizar la situaci&oacute;n; poder encontrar algo que me ayudara a pasar desapercibido al igual que nuestro espontaneo h&eacute;roe, record&eacute; que **Corki** me hab&iacute;a brindado del prototipo **Jetki I** para cuando lo necesitara e incluso me hab&iacute;a dicho que pod&iacute;a repararlo cuando quisiera.\n\nCorr&iacute; lo m&aacute;s deprisa que pude, dirigi&eacute;ndome al taller que esperaba no hubiera sufrido grandes cambios desde mi ausencia; al llegar vi que aquel peque&ntilde;o taller era ahora algo m&aacute;s grande, sin embargo aquel familiar olor a aceite y grasa no parec&iacute;a haber cambiado.\n\nPero no hab&iacute;a tiempo de contemplar todo a detalle, deb&iacute;a encontrar aquella capsula donde se sol&iacute;a poner el prototipo; no estaba por ninguna parte, a pesar de ser algo frustrante no me pareci&oacute; demasiado raro, despu&eacute;s de todo; a&ntilde;os no son d&iacute;as ni semanas.\n\nDesde ah&iacute; pod&iacute;a o&iacute;r el sonido de metal chocando e incluso un ruido parecido a las llamas o fuego ardiendo; por un momento me hizo recordar a las llamas que rodeaban y quemaban la plaza de la capital de **Ionia**; un evento que intentaba sacar de mi cabeza.\n\nNo ten&iacute;a armas aqu&iacute;, pero mi casa; deb&iacute;a haber algo ah&iacute; que pudiera ayudarme en esta pelea; as&iacute; que me dirig&iacute; hacia all&iacute;, indic&aacute;ndole a los Yordles que quedaban que me siguieran.\n\nToqu&eacute; la puerta antes de entrar, con **Veigar** abri&eacute;ndola con mucha cautela; ten&iacute;a su enorme **Bast&oacute;n M&aacute;gico** en mano, me pregunt&eacute; de donde lo habr&iacute;a sacado, en el mundo de **Lulu** nunca lo vi portarlo y tampoco al viajar hacia este continente.\n\nAl entrar not&eacute; que hab&iacute;a uno de los hombres de **Noxus** en el suelo, parec&iacute;a haber sido atacado por el mismo Mago Blanco frente a m&iacute;; record&eacute; que ten&iacute;a algo guardado en el casi vac&iacute;o ropero que ten&iacute;a esta casa; no tarde mucho en abrirlo, tomar aquella arma y dirigirme hacia afuera, encarg&aacute;ndole nuevamente a **Veigar** el cuidado de nuestros ciudadanos.\n\nAl salir r&aacute;pidamente no not&eacute; que **Tristana** estaba entre ellos, siendo tratada por sus amigos y compa&ntilde;eros.\n\nMientras corr&iacute;a hacia un callej&oacute;n, comprob&eacute; si esta arma a&uacute;n segu&iacute;a en condiciones; era el regalo que **Geni** me hab&iacute;a dado como un recuerdo de nuestra amistad y estad&iacute;a en la **Ciudad del Progreso**; el **SablePistola Hextech**.\n\nParec&iacute;a tener su tiempo sin usar, pero eso no significo problema al equiparlo y usarlo. En aquel callej&oacute;n hab&iacute;a bastantes cajas apiladas entre s&iacute;, pod&iacute;a subirme a ellas y poder ver si aun hab&iacute;a gente en la entrada de la ciudad, al ver que hab&iacute;a un par de **Noxianos** ah&iacute;, decid&iacute; abrir fuego sin dudarlo; dejando aturdido a uno de un par de impactos.\n\nEl hombre que quedaba se dio cuenta de mi presencia y entro a la ciudad, seguramente rumbo hacia el callej&oacute;n; tratando de jugarle en contra, salte hacia fuera de aquel callej&oacute;n, quedando fuera de la ciudad y dirigi&eacute;ndome a la entrada de esta.\n\nAl asomarme dentro cont&eacute; a siete hombres tirados en el suelo, algunos da&ntilde;ados y otros incluso quemados; haciendo un c&aacute;lculo me di cuenta de que contando el que **Veigar** hab&iacute;a reducido solo nos quedar&iacute;an dos hombres que derrotar, contando aquel que me vio.\n\n---------------------------------------\n\nEntr&eacute; a la ciudad, tratando de ver entre el humo que ahora hab&iacute;a dentro; tratando de divisar a alguien, enemigo o amigo; quien fuera para poder hacer algo; sea salvar o atacar.\n\nHaciendo un esfuerzo de ignorar aquel humo asfixiante; divis&eacute; a dos figuras luchando, eran dos figuras enormes; aquella m&aacute;quina y el enorme sujeto que hab&iacute;a lastimado a **Tristana**, acababa de notar que el hombre era casi tan alto y ancho como su contrincante met&aacute;lico.\n\nEscondi&eacute;ndome en una esquina, fije mi mirada en el enemigo, apuntando con mi arma hacia su cuerpo; y en un momento dicha maquina pareci&oacute; inclinarse hacia la derecha, como si me estuviera mirando.\n\n-&iexcl;Ag&aacute;chate!- Grit&oacute; la cabina, haciendo que me tirara al suelo y oyera como algo se disparaba.\n\nAl mirar hacia atr&aacute;s, pude ver al tipo que me hab&iacute;a visto antes; estaba pegado a la pared, atravesado por un enorme arp&oacute;n que ten&iacute;a dos cuchillas parecidas a las lanzas, clavadas profundamente en su pecho, aquel sujeto seguro ya estaba muerto.\n\nAhora solo nos quedaba derrotar al &uacute;nico **Noxiano** que quedaba; aquel bland&iacute;a en sus manos un enorme y largo martillo, que pose&iacute;a una punta en un extremo, parecida a un aguij&oacute;n, seguramente suficiente para perforar cualquier superficie, aquello me hizo temer por la seguridad del piloto.\n\nAs&iacute; que corr&iacute; hacia ellos; tratando de no ser visto por el armado hombre invasor; el piloto parec&iacute;a estar perdiendo la lucha, mientras me acercaba pod&iacute;a ver como se apoyaba en una de sus rodillas y se cubr&iacute;a con la mano que ten&iacute;a el taladro.\n\nEn un momento o&iacute; un ruido parecido al del vidrio que se rompe, y vi como el martillo estaba dentro de la cabina donde estaba aquel piloto; sin embargo la maquina a&uacute;n se mov&iacute;a, lo que sin duda significaba la sobrevivencia del posible **Yordle**.\n\n-&iexcl;No, no te calientes ahora!...- Se oy&oacute;, mientras la maquina se quedaba inm&oacute;vil, en aquella posici&oacute;n, sin que su brazo levantado cayera de su lugar; parec&iacute;a como si me hubieran quitado toda energ&iacute;a a aquella bestialidad.\n\nEl **Noxiano** golpe&oacute; por segunda vez la cabina, el piloto peg&oacute; un grito, no se dolor sino uno de susto, no ten&iacute;a miedo; sino que parec&iacute;a esquivar el golpe en aquel espacio reducido; quedando a merced de un posible golpe certero y mortal.\n\nEse hombre estaba mucho m&aacute;s armado y protegido que el resto de sus compa&ntilde;eros, mi forma **Yordle** no bastar&iacute;a para ganarle a alguien como &eacute;l, no conseguir&iacute;a moverlo ni siquiera un poco.\n\nSin pensarlo m&aacute;s me acerque corriendo hacia &eacute;l y lo embest&iacute; con todas mis fuerzas, apart&aacute;ndolo del piloto; cayendo al suelo y golpe&aacute;ndolo en el rostro m&uacute;ltiples veces, quedando aparentemente inconsciente.\n\nEl **SablePistola** hab&iacute;a ca&iacute;do de mis manos y estaba tan alejado como el martillo de mi oponente vencido; respiraba agitadamente mientras me pon&iacute;a de rodillas; tomando todo el aire que pudiera en mi cuerpo.\n\nEn ese momento algo hizo un ruido de eyecci&oacute;n, al voltear vi que la cabina estaba en el suelo a pocos metros de m&iacute;, de aquel hombre de acero sali&oacute; un peque&ntilde;o **Yordle**, de una estatura menor a la del resto.\n\n------------------------------------------------------\n\nVest&iacute;a un atuendo muy particular; una especie de traje, como la de los superh&eacute;roes de las historietas que **Geni** me sol&iacute;a prestar en la academia, sujetos con largas capas, cascos y m&aacute;scaras que ocultaban su identidad; este no era diferente al resto; sin embargo m&aacute;s que una apariencia heroica este **Yordle** se tambaleaba, parec&iacute;a estar bastante mareado con toda la acci&oacute;n acontecida.\n\n-Wow, que manera de hacer un debut- Dijo, mientras se quitaba su casco, el cual ten&iacute;a unos largos y brillantes lentes del color del fuego, al igual que los acabados de su incre&iacute;ble traje y robot.\n\nAquel bajo ese valor no era nadie m&aacute;s que **Rumble**, quien al mirarme se qued&oacute; completamente sorprendido; sus ojos estaban abiertos de par en par.\n\n-Pero t&uacute;, &iquest;No eres un **Yordle**?- Me dijo.\n\nBaj&eacute; la mirada para observar mis manos, no ten&iacute;an rastro de pelaje y mi estatura era la de un joven humano, al alzar la mirada pude observar como el resto de los habitantes estaban ah&iacute; frente a m&iacute;, tan sorprendidos como &eacute;l.\n\nNo pod&iacute;a articular palabra alguna, m&aacute;s que sentir mis propios jadeos de cansancio; y esperar que pasara lo que tuviera que pasar&hellip;\n\nDespu&eacute;s de que todo se calmara, los dem&aacute;s ciudadanos que quedaban se reunieron alrededor m&iacute;o, saliendo entre la multitud un singular **Yordle**, de apariencia mayor, quien me recordaba un poco a **Heimerdinger**; ya que este ten&iacute;a un bigote blanco similar al de &eacute;l, pero este vest&iacute;a de traje y corbata.\n\n-Es cierto, nunca te present&eacute; con &eacute;l, **Tenken** te presento al alcalde de nuestra ciudad; el **Se&ntilde;or Dennison Jadefellow**- Me dijo **Tristana**, quien estaba sentada en el suelo conmigo al igual que **Veigar**.\n\nEl alcalde me salud&oacute;, d&aacute;ndome las gracias por ayudar a su pueblo, adem&aacute;s de agradecer a Rumble por su heroica haza&ntilde;a; despu&eacute;s de hablar de la importancia de la seguridad en la ciudad, me pidi&oacute; que me retirar&aacute; de la ciudad, nuevamente agradeciendo mi ayuda.\n\n-Debes estar bromeando, **Tenken** ha hecho m&aacute;s por nosotros de lo que usted ignora se&ntilde;or, defendi&oacute; la **Academia de Pilt&oacute;ver** y la misma ciudad cuando ocurri&oacute; aquel caos hace unos a&ntilde;os- Dijo **Tristana**, con un rostro algo enojado y disgustado.\n\n-Tambi&eacute;n ayud&oacute; a proteger la **Isla de Ionia** y a sus habitantes; tambi&eacute;n salv&aacute;ndome a m&iacute;- Dijo **Veigar**, quien a pesar de no ser un ciudadano de **Bandle**, se levant&oacute; tambi&eacute;n a defenderme.\n\n-&iquest;Otra vez se&ntilde;orita **Tristana**?, ya se lo dije muchas veces; eso no le incumbe a nuestra tierra, lo siento; pero tenemos reglas- Respondi&oacute; el anciano alcalde, mientras nos daba la espalda y lentamente caminaba fuera de nosotros.\n\n-**&iexcl;Al demonio con las reglas, &eacute;l puede defendernos de Noxus!**- El alcalde se detuvo al o&iacute;r dichas palabras, sin dar la vuelta.\n\n-Recuerden que nuestro m&aacute;s poderoso aliado est&aacute; desaparecido, no podemos permitir que esto suceda de nuevo, s&eacute; que somos un pueblo fuerte, pero necesitamos aliados para no caer en las manos de ellos otra vez- Dijo la reconocida artillera, mirando a los ciudadanos; no le hablaba al alcalde sino a ellos.\n\nLa multitud comenz&oacute; a hablar entre s&iacute;, intercambiando opiniones; la mayor&iacute;a estando de acuerdo con ella, **Rumble** parec&iacute;a no opinar al respecto, m&aacute;s bien parec&iacute;a estar algo apenado y profundamente decepcionado de alguna forma.\n\n**Tristana** pidi&oacute; nuevamente que se me diera una oportunidad; el alcalde dio una vuelta y lentamente camin&oacute; hacia m&iacute;, quedando en frente de m&iacute;.\n\n-Espero que no nos decepcione **Tenken**; Bienvenido a **Ciudad Bandle**- Me dijo, d&aacute;ndome la mano como se&ntilde;al de respeto, mientras el resto de ciudadanos **Yordles** vitoreaban y aplaud&iacute;an aquella alianza formada en un momento de gran peligro.\n\n&lsquo;&rsquo;_No lo decepcionar&eacute;, ni a usted ni a nuestra ciudad_ &rsquo;&rsquo;\n\n----------------------------------------\n\nGracias por leer, si vieron que el cap&iacute;tulo tuvo alg&uacute;n error o si simplemente tienen alguna cr&iacute;tica, sugerencia o algo mas, si&eacute;ntanse libres de comentar.\n\nIntentar&eacute; ponerme al d&iacute;a con mi historia lo mas pronto que pueda.\n\nSaludos y suerte! ( ^ 3^){{champion:85}} ❤\n\n[**Capítulo Siguiente**](http://boards.las.leagueoflegends.com/es/c/creaciones-de-la-comunidad/xXnY2Yjm-tiempos-oscuros-capitulo-1-la-advertencia)\n\nhttps://i.ytimg.com/vi/vD5rjTNUncQ/maxresdefault.jpg","replies":[{"poster":"WenaMapache","date":"2016-07-18T04:00:45.309+0000","up_votes":3,"down_votes":0,"body":"Tal como dijo Heimer, si dejaran de lado la discriminación, sería un pueblo más que fuerte frente a cualquier amenaza.\n\nAún así.\n\nHAIL TEEMO\n\nBuen capitulo bro, aunque me da pena Rumble. Siempre quiere destacar y muy poco lo toman en cuenta.","replies":[{"poster":"Tenken","date":"2016-07-18T04:21:55.557+0000","up_votes":2,"down_votes":0,"body":"See recuerdo lo que dijo **Heimer** respecto a eso.\n\nLo bueno es que finalmente aceptaron mi estadía en la ciudad, sin embargo tengo que demostrar que no los decepcionaré, en cuanto a **Rumble**; la verdad es que ni yo se por que estaba deprimido, quizás sea por lo mismo que tu dices...\n\nEl siguiente capitulo sera el inicio de la nueva saga que tendrá que ver con este conflicto, posiblemente la publique mañana; entre otras cosas estaba esperando tu comentario.\n\nSaludos y suerte! ( ^ 3^)http://i.imgur.com/dP2JdDJ.png?1 ❤","replies":[]}]},{"poster":"FurchiDC","date":"2016-08-23T02:22:46.893+0000","up_votes":2,"down_votes":0,"body":"Este Rambel, bien valiente. Y como no Tenken como siempre salvando el día! jaja. Noxus la va a pensar dos veces antes de atacar ahora >:D.\n\n\n--\n>Saludos. {{champion:134}}{{item:3211}}{{champion:84}}","replies":[]},{"poster":"Solo Levèling","date":"2016-07-15T13:26:40.166+0000","up_votes":1,"down_votes":0,"body":"Hola Tenken , me gusto leer tu fanfic , es una historia que detalla bien los hechos sobre todo en las batallas . Cosa que lo hace facil de imaginar y enganchar al lector.\n\nRealizando una lectura rapida solo pude encontrar un pequeño error , _‘’Han llegado el momento, pero esta vez parecemos tener apoyo ’’_ , creo que se colo la letra N , en el HAN , después de eso , me gusto como organizaste cada párrafo de la historia para que el fanfic no sea tan pesado al realizar una  lectura con la vista.\n\nTambien iba a pedirte si me podes pasar un link del primer capitulo para leer la historia desde el principio y entenderla por completo ,\n\nY una cosita mas , si tienes un poco tiempo me gustaria que leyeras el fanfic que estoy realizando , como soy nuevo en esto de escribir fanfic, me gusta escuchar las criticas , en especial de gente que tambien escribe fanfics al igua que tu .\n\nEso es todo , espero seguir leyendo tus fanfics en esta seccion del foro.{{sticker:slayer-pantheon-popcorn}}","replies":[{"poster":"Tenken","date":"2016-07-15T20:03:56.948+0000","up_votes":2,"down_votes":0,"body":"Lo de ''HaN llegado el momento'' lo corregí bastantes pocos minutos de publicar el cap, así que seguramente tenias abierto el link desde antes.\n\nEn cuanto a mi historia, esta ya lleva bastante (Tiene aproximadamente 9 meses desde que comenzó), pero te dejo el link del prologo:\n\nhttp://boards.las.leagueoflegends.com/es/c/creaciones-de-la-comunidad/pAjhAwYH-historia-de-league-of-legends-la-espada-celestial-prologo\n\n---------------------------------------\n\nEn cada capitulo tendrás un link al capitulo siguiente (También tengo una saga llamada 1610, que no tiene link con los capítulos de la saga principal, así que te lo dejare aquí, pero te recomiendo que los leas al final, ya que tiene que ver con personajes que aparecen a lo largo de mi historia):\n\nhttp://boards.las.leagueoflegends.com/es/c/creaciones-de-la-comunidad/OAPTAhcQ-1610-el-segundo-invocador\n\n----------------------------------------\n\nSi he visto un aumento en las historias desde que yo publique la mía, pero prefiero no leerlas, ya que podría pensar que me están plagiando hasta el saludo...\n\nSaludos y suerte! ( ^ 3^)http://i.imgur.com/dP2JdDJ.png?1 ❤","replies":[{"poster":"Solo Levèling","date":"2016-07-15T20:12:42.372+0000","up_votes":1,"down_votes":0,"body":"{{sticker:slayer-pantheon-thumbs}} saludos","replies":[]}]}]},{"poster":"Nombre ofensivo","date":"2016-07-15T14:58:03.154+0000","up_votes":2,"down_votes":0,"body":"para cuando lo compilas en un .pdf?","replies":[{"poster":"Tenken","date":"2016-07-15T19:57:24.655+0000","up_votes":2,"down_votes":0,"body":"En un PDF?\n\nNunca lo había pensando, pero supongo que cuando termine todas mis sagas (Excepto 1610, ya que esta es independiente a pesar de ubicarse en el mismo universo) ya que aun queda muchísimo por escribir.\n\nSaludos y suerte! ( ^ 3^)http://i.imgur.com/dP2JdDJ.png?1 ❤","replies":[]}]},{"poster":"Tenken","date":"2016-07-15T02:49:55.507+0000","up_votes":2,"down_votes":0,"body":"Primer Tema (El Piloto):\n\nhttps://www.youtube.com/watch?v=jutjibGzrJw\n\n---------------------------\n\nSegundo Tema (Intentando Ayudar):\n\nhttps://www.youtube.com/watch?v=bvuTNHLOTDM\n\n----------------------------------------\n\nTercer Tema (Devolviendo el favor):\n\nhttps://www.youtube.com/watch?v=93JyJ5RIwpw\n\n------------------------------\n\nCuarto Tema (El Pacto)\n\nhttps://www.youtube.com/watch?v=iGib1zwIw0g\n\nSaludos y suerte! ( ^ 3^)http://i.imgur.com/dP2JdDJ.png?1 ❤","replies":[]}]}