{"poster":"Tenken","date":"2015-08-31T22:42:47.136+0000","title":"¿Cuales son tus videojuegos favoritos?","subforum":"Charlas Generales","up_votes":2,"down_votes":0,"body":"Tengo curiosidad e interés de nuevo:\n\nCuales son tus juegos o sagas de videojuegos favoritos y para que consola o plataforma?\n\nEntre los m&iacute;os est&aacute;n:\n\n-Resident Evil 2 y 3 (PSX y GCN).\n-Pokemon Platino (NDS).\n-Super Mario Bros 3 (NES y GBA).\n-Star Wars Jedi Knight: Dark Forces II (PC).\n-Metal Gear Solid (PSX y GCN).\n-Super Smash Bros (N64, GCN, Wii y 3DS).\n-Banjo-Kazooie/Tooie (N64 y XBOX: 360)\n-Fallout (PC, XBOX360, PS3)\n\nEntre muchos otros y por supuesto League Of Legends, cuales son los tuyos?\n\nSaludos y suerte! {{champion:85}}","replies":[{"poster":"Platinum491","date":"2015-08-31T23:20:36.125+0000","up_votes":1,"down_votes":0,"body":"Pokémon Cristal: El primer juego que juge en toda mi vida, tendria aproximadamente unos 4 años cuando lo jgue por primera vez. Aun recuerdo el hermoso equipo que tenia\nFinal Fantasy: Estos 3 juegos (el siguiente que voy a nombrar tambien) eran de el hijo del cuñado de mi tio (suena confuso) por lo tanto no podia jugarlos mucho pero un mes me presto la gameboy con los 3 juegos y desde ahi comenzo un amor por los juegos de estrategia y las cosas secretas\nMetroid Fusion: El juego estaba ingles asi qeu nunca entendi nada, a lo mucho llege al primer boss pero siempre me gusto, cuando ya fui un poco mayor lo logre \nCave Story: Este juego me atrajo mucho, mas que nada porque un dia lo vi por ahi tirado y me dijeron que si lo queria lo tomaba y jugaba, ese juego me encanto en todo sentido, la musica, el modo de jugar, ermozo","replies":[{"poster":"Tenken","date":"2015-08-31T23:28:35.388+0000","up_votes":2,"down_votes":0,"body":"A pesar de que mi Pokemon favorito es el Platino (Mas que nada por la cuarta generación que me gusto mucho), Red y los Mystery Dungeon, creo que el Pokemon Cristal era el que mas te ofrecía (Sin caer en cosas como la Torre Batalla o La batalla de la Frontera), por tener 2 regiones con sus respectivos gimnasios y Pokemons únicos, realmente se sentía como jugar 2 juegos en 1.\n\nHe visto muchas veces el Cave Story pero nunca me he dignado a jugarlo, supongo que debería darle una chance alguno de estos días, quien sabe si me termina gustando.\n\nSaludos y suerte! {{champion:85}}","replies":[]}]},{"poster":"Chockad","date":"2015-08-31T22:54:06.044+0000","up_votes":2,"down_votes":0,"body":"Hola Teken,soy Chockad,quizas me recuerdes en foros como Steel el vengador de hie... okno\nEn mi caso mis videojuegos favoritos son:\nToda la Saga Resident Evil (PSX)\nSoul Reaver Legacy of Kain (PSX)\nMedievil I y II (PSX)\nGran Turismo (PSX,PS2,PS3)\nBully (Ps2,PC)\nTodos los Grand Theft Auto (PC,Ps2,PS3)\n Pero si tuviera que elegir uno,sin duda elegiria Soul Reaver Legacy of Kain\n\nMuy buen foro,puedes pasarte por los mios.\nTe ha hablado Chockad y te deseo....Buenas noches {{champion:4}}","replies":[{"poster":"Tenken","date":"2015-08-31T22:58:11.037+0000","up_votes":1,"down_votes":0,"body":"Se nota que te gusta Soul Reaver amigo xD.\n\nOye yo no me olvido de la gente tan fácilmente {{summoner:3}}.\n\nSaludos y suerte! {{champion:85}}","replies":[]}]},{"poster":"EdgeGore","date":"2015-09-01T01:56:33.694+0000","up_votes":1,"down_votes":0,"body":"Pokemon Zafiro, Kirby, Crash Bandicoot, Sonic advance, Zelda ocarina del tiempo... básicamente todos los juegos que hoy juego con el emulador GBA y N64 xD, lamentablemente tube que ir mirando como Crash Bandicoot moria y Sonic quedó en la sombra que es ahora :'( \n\nTambien Age of Empires II, Call of duty I, warcraft III y Doom II\n\nsi es por juegos onlines eh jugado bastantes pero solo me han atraído (en orden del más antiguo al más reciente que he jugado) Flyff, World of Warcraft, World of tanks y League of Legends. hay otros como Metin2, Dofus o incluso Dota 2 que los jugué un poco, pero jamás consiguieron conquistar mi interés, en cambio a esos cuatro juegos me podia pasar 24 horas jugando sin parar, y cuando sentia que habia llegado a un nivel bueno me creaba una smurf en esos juegos xD\n\nPD: tambien cuando tenia 13 años me gustaba Minecraft, y todavia quizas un poco, yo jugaba con mis amigos a sobrevivir y construir casas y hacer cosas con creatividad como castillos, no como ahora que minecraft son casi puros juegos del hambre y casi solo minijuegos ¬¬","replies":[]},{"poster":"Navaldeus","date":"2015-09-01T00:54:33.874+0000","up_votes":1,"down_votes":0,"body":"En orden no específico:\n\n* Banjo-Kazooie / Banjo-Tooie [N64]\n* Final Fantasy VI [SNES / GBA]\n* Metroid Prime [Trilogía]\n* Monster Hunter Tri [Wii]\n* Pokémon Emerald [GBA]\n* Super Mario World [SNES / GBA]\n* Super Smash Bros. [Saga]\n* The Legend of Zelda [Saga]\n* Xenoblade Chronicles [Wii]\n\n{{champion:267}}","replies":[]},{"poster":"YanXi","date":"2015-09-01T00:04:35.500+0000","up_votes":1,"down_votes":0,"body":"Mis juegos favoritos son\nResident Evil gran serie de juegos lastima que al pasar los años lo convertieron muy shooter y menos survival horror\nSilent hill jugué hasta el 4 y me gustaron con una gran historia un OST muy bueno y el favorito de esta saga es el 2\nMetal Gear Solid una saga de juegos muy buenos pero lo que me gusto mas de MGS fue la historia larga y compleja que tiene\nY varios mas como Dead Space,FEAR solo el 1 y sus expansiones,Half-Life,Portal,etc\n\nSaludos","replies":[]},{"poster":"Beelzebub","date":"2015-08-31T23:33:33.800+0000","up_votes":1,"down_votes":0,"body":"lol mi juego favorito","replies":[]},{"poster":"Il Bardolino","date":"2015-08-31T23:10:47.812+0000","up_votes":1,"down_votes":0,"body":"Yo tengo la teoria de que todos tenemos un disco, una pelicula, un libro o, en este caso, un juego que marca un antes y un despues personal, que es el que pasa a orientar nuestros gustos. Juegos favoritos tengo muchos, pero son dos los que guardan un lugar especial en mi corazón: **Grim Fandango** y **Metal Gear Solid**.\n\nGrim Fandango es una joya oculta de la aventura grafica. Me acuerdo fijo que me lo habian regalado para una Navidad cuando era niño... y no lo pude jugar por un tiempo debido a que la computadora no lo corria. Una vez que lo llegué a jugar, me encontré con un juego bastante dificil (hoy en dia y de las veces que lo pase lo hago en dos patadas) pero MUY divertido, con una historia verdaderamente atrapante y unos personajes por demás de carismaticos (Larga vida a Chepito). Para los que quieran aprovechar, hace poco se remasterizó.\n\nY qué decir de Metal Gear Solid? Me considero amante del cine, y jugar al primer MGS simplemente me voló la cabeza. Es posiblemente el juego que más me impactó, el que me dio ganas de jugar juegos por su historia, ademas de tener, casi indiscutiblemente, el MEJOR doblaje al español en la historia de los videojuegos. Una saga que me fue acompañando a lo largo de los años y que en estos dias estare despidiendo con el anticipado The Phantom Pain.","replies":[{"poster":"Tenken","date":"2015-08-31T23:17:59.885+0000","up_votes":1,"down_votes":0,"body":"Te creo, pues yo he oído de Grim Fadango pero nunca he tenido oportunidad de jugarlo.\n\nAdemas de que el primer Metal Gear Solid me enseño algunas cosas, por ejemplo algunas cosas sobre como sobrevivir en un entorno ártico.\n\nhttps://www.youtube.com/watch?v=QkNl61qYlOI\n\nSaludos y suerte! {{champion:85}}","replies":[]}]},{"poster":"MatiasZERO","date":"2015-08-31T23:13:12.903+0000","up_votes":1,"down_votes":0,"body":"Ufffff, he jugado muchos, y tengo algunos recuerdos, pero supongo algunos otros los olvide.\n\n* Metal gear: Alcancé a jugar el 1, 2 y 3, de la consola de Sony. El 4 no pude, pero me vi todas las escenas por youtube, para seguir la historia. xD\n* Super Mario: Jugué muchos, como el rpg, el 2, el 3, mario world, entre otros. Pero el que más recuerdo, fue el Mario 64. Me lo terminé completo, y luego comencé  a subir la dificultad yo solo. Recuerdo le puse la cámara en primera persona, y me lo terminé así xD. Nunca vi alguien mas terminarlo de esa forma. xD \n* Final Fantasy: El que más jugué fue sin duda el 8, del cual tengo los mejores recuerdos. Una gran historia, era de esos juegos que no querías detenerte, para seguir la historia y saber qué pasaba luego.\n* Hitman: Este juego un día lo vi, y me puse a jugarlo sin conocerlo. Me encantó. xD Seguí jugando hasta el 3 creo, o 4, ya no recuerdo. Hacer esas misiones en sigilo era uuufff, de lo mejor. \n* Max Payne: El 1 y el 2. El 3 no, ya que no me gustó tanto. Pero el 2, tenía de las mejores historias en un videojuego, seguido bien de cerca por el 1. Si alguien no lo ha jugado, deberían probarlo sin duda, la historia lo vale.\n\nPara no extenderme más xD, solo nombraré algunos otros, como RE del 1 al 3. Dino crisis, Parasite eve, Jet force Gemini, Goldeneye 007, Soul reaver, entre otros muchos... que si los pongo todos esto no acabo nunca. \n\nXD.-","replies":[]},{"poster":"S04 Ragnar ","date":"2015-08-31T22:54:14.150+0000","up_votes":1,"down_votes":0,"body":"Word of Walcraft (lo era asta la 3ra expancion luego de eso no lo juegue mas porque no me gusto) DK PROFANO :D","replies":[]},{"poster":"FallenDemonX","date":"2015-08-31T22:49:57.833+0000","up_votes":1,"down_votes":0,"body":"- Final Fantasy (saga completa, inluyendo la mayoria de spin offs)\n\n- Dust: An Elysian Tail (Xbox One, PC)\n\n- Super Smash (Saga completa)\n\n- Silent Hill (saga completa)","replies":[]}]}