{"poster":"LeyendaRankeQ","date":"2019-10-30T21:49:34.516+0000","title":"Que emparejamiento de M.","subforum":"Charlas Generales","up_votes":1,"down_votes":7,"body":"Dios que Bronca este emparejamiento, Acabo de terminar mi cuarta partida en mi otra cuenta y fue la cuarta derrota estaba apunto de subir a Oro 2, Y lo peor es que me empezo a tocar gente que no tiene ni la mas minima idea de donde estan parados, 2 partidas donde los de bot fedean y me voy bot gano la linea bot y fedea el top A bueno... Sigo en bot por las dudas, la 4 y el jg no sabia gankear ni hacer objetivos\nLes juro las ganas de putear que tenia!!!. De insultarlos de decirle todas sus verdades pero quiero cambiar y por eso me calle. Mi score en las 4 fue impecable obvio que en una termine 1/4 para no dejar a mi equipo abandonado y que me reporten por no participar. \nLa unica razon por la que juego Lol es por las Ranke pero asi con este sistema deplorable que tienen no se puede. Es una M. No pedia que me pusieran con Faker solo que no fedeen y aguanten nada mas pero era mucho pedir.\nY ya los Rioter empezaron a poner Dislike, xD tipico de las lo bueno es que este server es un asco. Y de a poco se va hundiendo. Que Bueno que Riot no le presta atencion a este servidor que sigan los Bugs trolls Afk usuarios con Apodos ofensivos Rioter que renuncian por mal trato de la empresa xD Que este server arda Asi nos va a ir en vez de apoyarnos nos tiramos con todo entre nosotros xD. Que bueno que a Riot ni le interese Las asi debe ser por la gente que existe aca. Aguante NA, Korea, Europa ahi esta la gente decente y que si recibio educacion de sus padres no como esta que lamentablemente me toco compartir xD. ","replies":[{"poster":"Shíru","date":"2019-10-30T22:01:06.020+0000","up_votes":1,"down_votes":0,"body":"Y como quieres que te emparejen? Me refiero al sistema a usar","replies":[{"poster":"LeyendaRankeQ","date":"2019-10-31T11:18:55.536+0000","up_votes":1,"down_votes":1,"body":"Estaria bueno por el Score quizas. Me puse a pensar que mis ultimas partidas tengo buen score entonces deberian emparejar a la gente que cuida eso. Creo que si fuese asi los usuarios cometerian menos errores. Entregar mas pl al que se esfuerza y al que fue carreado darle la mitad. Shiru yo te conozco a vos... e.e Me suena tu nick xD.","replies":[{"poster":"Tenori Taiga","date":"2019-10-31T15:21:13.137+0000","up_votes":3,"down_votes":0,"body":"Las kills no son un objetuvo, son una herramienta. Ir matando por el mapa no te da la victoria si no tiras el nexo. Podes ir 20/0 matando gente a diestra y siniestra, mientras que un trynda 0/15 te hace un boquete en la base y te tira el nexo. Podes sacarme 4 kills, que si te saco 100 minioms y 3 torres voy mejor que vos. Podes estar feedeadisimo, que sino sabes cerrar una partida, no cas a ganar.\nEl problema compañero, es que no entendes el juego(no te lo digo de forma despectiva). Y entre las cosas que no entendes, esta el sistema de MM. El sistema de MM, se basa en un sistema (a priori) similar al sistema elo. Te junta con gente de tu mismo nivel de habilidad. Y esto se mide en torno a ganar o perder partidas. En corto plazo puede fallar el sistema, pero a la larga, si mereces ganar ganas, sino mereces ganar, vas a perder, porque es imposible que ganes 30 partidas seguidas que no merecias ganar, o wue piersas 30 partidas seguidas por factores externos (entendiendo que el unico factor constante en todas tus partidas sos vos).\nDeberias aplicar la famosa frase, no sos vos, soy yo. Y ver porque constantemente sufris de derrotas, y que esta en tu control para cambiarlo (porque salvo que puedas ejercer control mental, no vas a controlar a tus compañeros). Si venis sin prepotencia y con ganas de mejorar, un monton de gente va a aportar un granito de arena, y con esfuerzo, tiempo y paciencia vas a ir progresando y llegando cada vez mas lejos.\n\nPor ultimo, un sistema basado en el score, solo te va a emparejar con gente que cuida el kda, no necesariamente con gente que sepa jugar, por todo lo expuesto arriba. Saludos","replies":[]},{"poster":"tacito92","date":"2019-10-31T15:26:01.369+0000","up_votes":1,"down_votes":0,"body":"por score podes ir 30/0/90 y perder siempre por que no haces objetivos, el lp se basa en el % de victorias que tengas.\nel score es lo de menos mientras sigas ganando, no es lo mismo un team 90/0/100 que pierde siempre que un team 0/100/0 que gana siempre.\nsi alguien tuviera que apostar lo haria a favor del 0/100/0 por que es casi seguro que ganaran teniendo en cuenta el ejemplo que doy. (muy exagerado el ejemplo)","replies":[]}]}]},{"poster":"rama144","date":"2019-10-30T22:08:01.247+0000","up_votes":4,"down_votes":1,"body":"Me parece que te crees mejor de lo que sos mira lo que le comentaste a otro ..........\n\n\"Am DE silver no es difícil salir, lo digo por que yo en esta cuenta ni me tomo enserio las partidas y estoy en palta dos pero si le echo ganas ( Y la verdad no me interesa subir a Oro ) subo a Oro en 1 dia. Ahora si es verdad si estas en plata no todo es culpa de tu team sean trolls o no\"\n\n\" no soy ningun salame para venir a darmela de agrandado y decirte \" 200 pirtidis ni is ti tim sis vis plitita \" espero haberte ayudado\",pero sos el salame agrandado que dice subo a oro 1 en un dia y despues escribe estos post de no poder subir a oro 2 y tambien el salame que dice que no trata de jugar enserio osea si fuera cierto te das cuenta que jugando sin ganas y sin importarte ganar perjudicas a la gente que le toca con vos ? \n\n\"Subo a oro en 1 dia\"  pero aca estamos pidiendo que mejoren el emparejamiento y tratando de subir a oro 2\n\nPd: Me encantaria saber que liga es palta 2 por que quiero subir a tomate 1 ","replies":[{"poster":"tacito92","date":"2019-10-30T22:43:39.220+0000","up_votes":1,"down_votes":0,"body":"yo en clasificatoria flexible llegue a oro 4, ponele que habia premades da igual, yo jugaba por mi cuenta como soporte, 5 partidas de posicionamiento las gane trabajando en equipo y las otras 5 troleaban o manqueabamos todos como dios manda.\n5 de 5 y termine en oro 4, estoy cerca de la promo a oro 3, bien por mi.\n\nEN SOLO Q!!,2 partidas las gane dando lo mejor de mi, en las otras 5, flamers, trols, afk, de todo.\nhace rato jugando janna perdi una partida que no debia haberse perdido, para el colmo me emparejan con oros 2 y platinos 4, 5.\nbien ahi, carreada facil, no?.\nsoy main soporte y no puedo jugar mi main?, que clase de..... esto es mas que una mala racha de partidas, estamos cerca del final de season y la gente trolea a esta altura pero paren un cacho es demaciado troleo, un poco mas y tengo que jugar con un traje anti radiacion por el nivel de toxicidad.\npor mi parte habia iniciado bien, positivo, buena onda con un braum 2/0/19 pero despues de eso fue un infarto de partida tras otro.\ntuve que jugar una clasificatoria sin adc por que este dio 3 muertes y se fue afk.\nparen un cacho, paren un cacho por dios, hasta los platinos rivales decian en ocaciones que jugaba bien a pesar de la horrible partida. D:","replies":[{"poster":"rama144","date":"2019-10-30T23:37:52.883+0000","up_votes":1,"down_votes":0,"body":"Bueno eso es otra cosa como dijiste se acaba la temporada gente desesperada por subir tanto que se ponen toxicos o la trollean por que vienen perdiendo seguido y se frustran y todo lleva a eso.\nDespues esta el otro caso de gente que se queja desde principio de año y uno se tiene que poner a pensar si me tocan troll a los demas no ? o por que a algunos no les cuesta subir y a mi si de 200 partidas (sin mencionar gente con 500 o 1000 partidas)  cuantos trolls pueden salir de verdad ????\n\nyo maineo sup tambien, pero este año jugue flex tambien solo como adc y jg  que como soporte 0 farmeo de adc para probar y decir que tan dificil es subir (osea jugando adc que no es mi linea para comparar a algun oro o plata  main adc que no pueda subir) de plata 3 a platino 4 tarde 120 partidas como adc/jg  y te digo que fue suave me trollearon ???? si claro que si me trollearon o flamearon premades /tambien gente sin muchas ideas pero subi  y te puedo asegurar que el 80 % fue por jugar bien no me refiero main beta popy faker 2.0 sino tan simple como objetivos/ mantener vision en mapa estar atento al mapa y ayudar a tus compañeros con eso que generalmente  muchos en ligas bajas ni miran el mapa o no se imaginan la ruta del jg tomar buenas decisiones tanto en linea como juego tardio no tiltearse jugar tranki etc de plata a platino no se nesesita ser un gran jugador sino conocer conceptos basicos y \"aplicarlos bien!!!\" ademas de obvio  y tristemente no es quien mete la mejor jugada sino quien la caga primero por decirlo de alguna manera y aprovechar eso \n\nPD: Cuando uno no puede subir es por algo , todos piensan que son buenos y cuando pierden le echan la culpa a los demas claro te trollean pero un 10 % como mucho de todas tus partidas las demas que pasa ? ese es el momento de reflexionar que nesesitas mejorar capas que no es con el champ sino conceptos básicos, por ejemplo cuando a uno le resulta muy muy facil llegar a oro y despues les cuesta muchisimo subir  es por el tope de nivel   ","replies":[{"poster":"tacito92","date":"2019-10-30T23:58:27.497+0000","up_votes":1,"down_votes":0,"body":"uno puede mejorar y ser dios pero el juego es de 5 vs 5, si lo demas tiran para atras toda la partida no hay mas que decir, yo he sido positivo y practicamente me escupieron en la cara.\nsolo en flex gane 7 de 14 y me ha tocado partidas en las que soy bueno y soy malo, el punto no es que yo tenga una mala partida o no si subo o bajo o si mi habilidad tiene un limite.\nel punto es la toxicidad que vuelve injugable al lol.\nyo ahora estoy en promo para oro 3 en flex, jugue con nautilus  y termine algo asi como 11/14, el thresh rival 1/11/18, el early fue una pesadilla y remontarla no fue facil, jinx me insultaba a cuatro manos y mas de una ves se tiro de cabesa siendo que lucian era mas fuerte en early.\ntodos cometen errores?, si, ¿eso les da excusa para flamear, trolear, etc  y volver insoportable una partida?, no. bueno, eso.","replies":[{"poster":"rama144","date":"2019-10-31T01:49:39.038+0000","up_votes":1,"down_votes":0,"body":"\" ¿eso les da excusa para flamear, trolear, etc y volver insoportable una partida?\" Por supuesto que no y tenes razon es un 5 vs 5 pero en todas las partidas te trollean y te flamean ?? y la partida de nauti esta bien pero y las demas ?? como las partidas donde usaste a braun y morgana y terminaste 0/4/1    1/6/2  0/8/3 y varias mas asi con scores muy malos no me vas a decir que en todas te trollearon y flamearon .\n\n\nVarios puntos para corregir braun aery o garra mortal de maestria no funca tambien tenes que aprender a llevar extenuacion como soporte prender para personajes como nami soraka y depende, no podes tener una partida con un zed enemigo y su jungla un rengar y no tener extenuacion usando ignite, otra cosa en casi todas las partidas te duplican los wards puestos o te triplican etc etc mira podes mejorar en varios aspectos importantes que son muy basicos como extenuar es muy muy importante y seguro estas pensando ahhh pero aseguro kills de que te sirve asegurar una kill tu principal objetivos es apoyar al equipo un adc sin salto dash vs un zed (por ejemplo) es muy dificil escapar pero si tu sup tiene extenuar te puede salvar las papas y dejar al zed vendido etc etc","replies":[{"poster":"tacito92","date":"2019-10-31T03:52:47.389+0000","up_votes":1,"down_votes":1,"body":"a las runas nos las entiendo pero no afecta mucho al gameplay, el ignite es por que me gusta ser agresivo mas alla de si sale o no bien xD\npero muchas de las partidas que decis que termine 0/8 tenes que mirarlas bien, el contexto del 0/8 no implica que yo alla echo todo mal, hasta los rivales decian que jugaba bien y que no debia calentarme la cabesa.\nrecien logre en flex superar la promo en la que me estanque tanto, ahora soy oro 2.","replies":[{"poster":"rama144","date":"2019-10-31T05:13:48.360+0000","up_votes":1,"down_votes":0,"body":"\"pero muchas de las partidas que decis que termine 0/8 tenes que mirarlas bien, el contexto del 0/8 no implica que yo alla echo todo mal, hasta los rivales decian que jugaba bien y que no debia calentarme la cabesa.\"\n\nBueno respondiste solo muchas cosas estas en oro 2 pero no entendes las runas .... y si son muy importantes las runas y puede afectar el game ademas te gusta jugar agresivo esta bien pero recorda que mas que un asesino luchador sos el sup cuidar al adc es tu trabajo principal ademas  de controlar vision  etc osea en el primer comentario que escribiste dijiste que te tocaban los que manqueaban  para un jugador decente si no conoces las runas que es suuuuuper basico es como el tutorial de lol conocer las runas si no wardeas y no cuidas al adc eso seria manquear de esto sale la gente que se queja pero no ve sus propios defectos\n\n\nPD: Cuando terminas con scores muy feos y un rival te dice que jugas bien por all el 90 % de las veces es para burlarse de alguno de tus compañeros mas especificamente el adc que seguro boqueo en all\n\n\n\n","replies":[{"poster":"tacito92","date":"2019-10-31T15:23:27.141+0000","up_votes":1,"down_votes":0,"body":"yo no puedo controlar lo que haga el adc, me remito a lo que sucede en las partidas.\nantes que nada soy el soporte del equipo que me toque, no solo del adc y hace se hace dificil esa labor si la otra persona no coopera haciendo su parte.\nyo solo tengo un rosa y uno normal hasta terminar la mision del item de soporte, justo seria que los demas wardearan tambien y no solo yo.\ntodo el team termina con score feo si se va perdiendo la partida, mas si se inician peleas de equipos que no se pueden ganar y tiene que saltar el soporte a parar la pelea para que el equipo se pueda retirar a base. \nmuy facil te resulta criticarme si no jugaste conmigo","replies":[{"poster":"rama144","date":"2019-10-31T22:32:03.000+0000","up_votes":1,"down_votes":1,"body":"No es criticar sino dar un consejo osea no jugué con voz pero si me contas sobre tu team  que son malos etc pero al mismo tiempo me decis que no conoces las runas veo que tus wards son menos de la mitad que el sup enemigo y no usas extenuacion sino solo prender puedo especular mucho todos pasamos por la fase es culpa del team pero cuantas partidas realmente podes perder por el team y cuantas por falta de autocritica  nadie es un buen jugador de la anda sino que se aprende te lo digo por experiencia propia\n\nPD: Veo que probaste extenuar muy bien tambien estas wardeando mas y ganaste las 2 partidas te recomiendo mirar alguna guia de runas creeme que es muy importante","replies":[{"poster":"tacito92","date":"2019-10-31T23:22:44.528+0000","up_votes":1,"down_votes":0,"body":"wardeo lo mismo de siempre, nunca cambie los habitos de wardeo.\nlo de extenuar es muy ocasional que lo uso.\nperdi por que hice roaming a mid, deje al adc para generar ventaja a favor nuestro y el adc se ofendio y fedeo jajajaja.  (el roaming salio perfecto xd)\nluego intente razonar con el y no habia caso, hasta reconocio que troleaba pero ya lo reportamos xD\nme llego un aviso sobre uno de los reportes, castigaron a otro jugador que reporte anteriormente xd","replies":[]}]}]}]}]}]},{"poster":"LeyendaRankeQ","date":"2019-10-31T11:10:05.830+0000","up_votes":1,"down_votes":2,"body":"Ahora estoy en Oro 4 y estaba recien en promo para oro 3 pero se me fue todo abajo la primera mi linea la re gane tire torre iba 1/0 y los de Bot comienzan a fedear bajo les digo voy bot subna top y se va a afk por que le roban minions la bronca que me dio y jamas insulte por que no quiero ser mas toxico. Igual la perdimos y la segunda. Lo mismo gane mi linea tire torre pero esta vez el supp se enoja por algo y se va a mid a trolear yo no lo podia creer dos veces trolls en mi promo no sabes las ganas de putearlos que tenia me puse a insultar en voz alta aca en mi cuarto la re verenda... No escribi nada Y me fui a base. Y acabo de perder otra Lo peor es que no pierdo por que fedeo Eso me da mas bronca gano mi linea bajo a ayudar y hacen cualquier cosa de ultima me voy a base y me quedo afk cuando veo que los enemigos estan tirando el nexo.","replies":[{"poster":"tacito92","date":"2019-10-31T21:44:08.156+0000","up_votes":1,"down_votes":0,"body":"no podes calentarte por que luego te cae ban, yo juego como puedo y si sale bien bien, si fedeamos y le ponemos tripa y corazon hasta ganar la partida bien igual a pesar del score, pero la buena onda ayuda a que todos quieran ganarla","replies":[]}]}]}]}]},{"poster":"LeyendaRankeQ","date":"2019-10-31T11:14:48.281+0000","up_votes":1,"down_votes":1,"body":"Es que es extraño. Estoy estancado hace un meses en Oro 3 en mi otra cuenta ahora estoy en oro 4\nY en esta cuenta boludeando casi elijiendo cualquier champ gano de la nada. Y no me cuesta mucho subir a oro es verdad en la que estoy en oro 4 baje hace poco a plata hasta plata 3 y en dos dias subi a oro de nuevo. Aca tambien la puedo subir fijate mi historial. Pero me quedo estancado en oro 3 no se por que de ahi no puedo subir. Quizas es por que ya vengo con la mentalidad de no voy a poder subir a oro 2 y es asi por que antes estaba en plata 4 y siempre decia jamas subire a oro y con muchas ganas en una semana subi a oro. Es mentalidad y emparejamiento.","replies":[{"poster":"rama144","date":"2019-10-31T22:37:10.307+0000","up_votes":1,"down_votes":0,"body":"No es extraño como le explique al otro amigo plata y oro 4 es casi lo mismo toda liga v que ahora es 4 es el limite donde te das cuenta si estas para subir o no.Es como cuando uno llega a oro por primera vez y es complicado y al año siguiente subis sin darte cuenta pero despues se complica o la gente en platino 4 estancada que sube y baja sube y baja \n\nA mi parecer en la division 4 y 3  no existe mucha diferencia pero en 2y mas en 1 se nota que sube un poco el nivel generalmente","replies":[]}]}]},{"poster":"L9 Skasha","date":"2019-11-05T11:39:05.191+0000","up_votes":2,"down_votes":0,"body":"Cuentas en oro y en la main no llegas a diamante 1? Deja de perder tiempo intentando sentirte mejor que los demas y mejora xd","replies":[]},{"poster":"FNC Juan Perón","date":"2019-11-01T15:47:13.608+0000","up_votes":2,"down_votes":1,"body":"Viejo, como te da la cara para quejarte, tenes 45% winrate en soloQ y el miserable porcentaje de 33% en flex, has ganado apenas el 38% de tus partidas con uno de tus mains que es teemo... deja de llorar y ponete a jugar dale","replies":[{"poster":"LeyendaRankeQ","date":"2019-11-02T20:02:28.778+0000","up_votes":1,"down_votes":2,"body":"Mi Main es Teemo? XDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDD \nListo con comentarios como el tuyo ni ganas de entrar a este foro igual ya me acostumbre esta comunidad es una M terriblemente. Vos sos solo uno mas saluditos :3.","replies":[{"poster":"FNC Juan Perón","date":"2019-11-03T15:16:00.194+0000","up_votes":1,"down_votes":0,"body":"https://www.leagueofgraphs.com/es/summoner/las/LeyendaRankeQ#championsData-soloqueue 39 partidas con teemo 38% winrate... me baso en como jugas, solo venís a llorar a los foros pero no haces nada para mejorar...","replies":[{"poster":"LeyendaRankeQ","date":"2019-11-05T04:31:23.808+0000","up_votes":1,"down_votes":1,"body":"En esta cuenta juego por diversion nada mas xDDDDDDDDD Ahora el Winrate determina que champ es tu main segun vos xDDDDDDDDDDDDDDD JAJAJA, Ay este chico xD. \nVengo a llorar xDDDDDD x,D. Vengo a decir que tal esta el emparejamiento si llorara diria devuelvamen mis pl o no juego mas xD. Para entender esas cosas se debe terminar minimo la primaria Fijate xD. Besitos Heater :* xD.","replies":[{"poster":"FNC Juan Perón","date":"2019-11-05T14:04:21.552+0000","up_votes":1,"down_votes":1,"body":"No el winrate amigo, la cantidad de rankeds jugadas, y porque no publicas tu crypost y tus respuestas llenas de \"XDDDDDDDDDDDDDD\" y carentes de sentido desde tu \"main account\" así uno te puede dar una critica constructiva de porque estas hardstuckeado en oro, y si, estas llorando , y eso que pusiste al final.\n\n> Para entender esas cosas se debe terminar minimo la primaria Fijate xD. Besitos Heater :* xD.\n\nse nota a leguas que sos un nene de máximo 16 añitos que no va a ver mas allá de oro en su vida. pero bueno, segui llenando de \"XDDDDDDD\" tus respuestas y cryposteando, porque casi todos tus posteitos son igual de llorones.\nSalu2 y suerte con el hardstuck {{sticker:slayer-jinx-catface}}","replies":[{"poster":"LeyendaRankeQ","date":"2019-11-06T04:30:08.582+0000","up_votes":1,"down_votes":1,"body":"\"Un nene de 16 añitos\" Tenes que rebajarte a esos insultos discretos ? Mira amiguito se te enojaste no te calentes \"Postesitos\" Se nota que te jode algo xD. Y hasta pones una imagen para creer que estas en lo cierto y terminas ganando xD. No se yo nunca te insulte ... Nunca te dije nada xD. Solo me rei de tu conclusion absurda \" Tenes buen winrate por ende es tu main \" xD. Es que es vergonzoso eso Y quedaste como un... xD. Bueno besitos que no te duela mucho bb. :*","replies":[{"poster":"FNC Juan Perón","date":"2019-11-06T11:16:30.052+0000","up_votes":1,"down_votes":0,"body":"> Para entender esas cosas se debe terminar minimo la primaria Fijate xD.  \n\n\nSi me rebaje a algo fue a tu nivel, porque si alguien insulta no tan discretamente acá sos vos papi.\n\nDije que tenes \"MAL winrate con un campeón\" no bueno (pero parece que no sabes leer porque ya es la 2 vez que decís eso), y que ese es tu segundo campeón mas jugado en ranked desde la cuenta que estas llorando (39 rankeds), es simple, nadie te insulta, te aconseje que en lugar de venir y postear eso y seguir \"retrucando\" con repuestas llenas de \"XD\" vayas y practiques, porque si no subes de liga no es culpa de tus teams, o de tu emparejamiento, sino de que algo estas haciendo mal, pero no te entra en la cabeza parece. Nadie esta enojado con vos, pasa que ya cansa meterse al foro y encontrar puro \"ay mis tims\" \"Ay los trols\" \"ay awante korea y na\". Pero bueno, seguramente vas a responder algo lleno de \"XD\", sin sentido, pero que en tu cabeza va a sonar como \"mmm ci XD ahora XD tengo rason XD, aora vamos a jubar unas rankeds XD y a kejarme del empajeramiento XD si si XD\"\n\nSaludos viejo, y la mejor de las suertes saliendo de tu hardstuck, porque créeme, la necesitas.","replies":[{"poster":"LeyendaRankeQ","date":"2019-11-07T04:43:36.160+0000","up_votes":1,"down_votes":0,"body":"\"Papi\" La gente que usa diminutivos esconde la bronca para insultar de manera indiscreta y disimulada yo estoy re calmado UwU Jajaja yo me rei man vos hasta me escribis la constitucion de no se que jajaja relajate por que te pones asi xP.","replies":[]}]}]}]}]}]}]}]}]}