{"poster":"LeyendaRankeQ","date":"2019-10-13T21:06:50.337+0000","title":"Me banearon el Chat.","subforum":"Reclutamiento","up_votes":4,"down_votes":2,"body":"Hola no vengo a quejarme recibí un ban de 10 partidas por Flamer. A lo cual aplaudo por que así tiene que ser. \r\n1 Aclaro que no flamee por que mi equipo jugaba mal flamee por que me empezaron a insultar y decir que mierd... Haces.. Pero flamear es flamear\r\n2 Lo mas importante es como fue el ban... Oseaaa flamee en una partida me salgo entro a jugar otra y  ya tenia el ban :O \r\nHaber de 1 segundo para el otro ya tenia el ban!!! Lo mas curioso es que un jugador decía ya mande el ticket a un \" supp \" Algo asi creo lei. \r\nEs chistoso por que yo mande semejante Ticket de un usuario que flameaba mal pero mallll y se quedo afk y nunca paso anda con ese usuario.\r\nVi su historial y sigue troleando... Increible. \r\nBueno eso me tengo merecido el ban por que asi debe ser. Pero fue sospechoso como paso. Osea \" Ya mande un ticket \" Ban en instantes oseaa. Gracias por leer buen dia.","replies":[{"poster":"FNC PlayMaker","date":"2019-10-13T21:33:10.217+0000","up_votes":4,"down_votes":0,"body":"Cuando el ban es tan rápido no es por ticket ni nada, es el sistema automático y sólo funciona cuando recibis bastante cantidad de reports en un game. O sea te reportaron tanto de tu equipo como del enemigo","replies":[{"poster":"LeyendaRankeQ","date":"2019-10-13T22:22:12.980+0000","up_votes":1,"down_votes":1,"body":"Si eso me puse a pensar. Pero salio un video de un tipo que reporto a otro por que usaba una estrategia con teemo supp y el tipo dijo mi amigo te va a mandar de vacaciones 2 semanas ja y ban!. Por suerte se supo que paso y el que baneo a ese teemo por no hacer nada lo sancionaron. Igual ta fue seguro fue por que me reportaron los 9 es chistoso que ellos me flamearan feo y siguen asi como si nada xD. Saldooaosidoasidaosdkasdk.","replies":[]}]},{"poster":"SADiCAT","date":"2019-10-17T19:06:23.062+0000","up_votes":2,"down_votes":0,"body":"A mi me bannearon por que en una ranked unos premades me empezaron a insultar y yo me defendi.... al final de la partida mande el ticket con capturas de pantalla de todo lo misógino que me habian dicho y unos dias despues me encuenteo con el cartel de ban con todas mis respuestas a los flameos de los tipos esos que me atacaron entre 3, la conclusion es... rito me banneo con mi propio ticket, que nada te sorprenda de esta empresa, nada.\nLo que te aconsejo si te flamean es que no les contestes y simplemente trollees afk farm, si se da una tf mandate a ver si sacas unas kills y divertite lo que queda de partida, quien sabe, tal vez se termine ganando esa partida, me ha pasado\nsi no decis nada y trolleas rito no te bannea tan facil...\n{{sticker:slayer-pantheon-popcorn}}","replies":[{"poster":"LeyendaRankeQ","date":"2019-10-25T21:02:40.635+0000","up_votes":1,"down_votes":0,"body":"Si eso es bueno para los flamer osea que aprendan, pero eso tambien te juego en contra lo digo por que ya van dos veces que dije la primera dije No troleen plis que si no bajo a plata y el Hdp dijo ahora le doy kills al mid y troleeo asi bajas que bronca no escribio nada y su build era de troll y el amigo el duo igual, me fije su historial tenia buenas partidas y otras eran muy trolls lo reporte y todo y el tipo hoy sigue jugando despues otra pero esta vez la dije en flex jaaa cosa que en flex no me importa perder partidas es Flex y el tipo decia que queres? estoy afk alghun problema¡? JAJAJA yo me empeze a reir por que era una Flex y le salio re mal. Lo que me da bronca es que estos dos los de mi equipo y el equipo contrario no decian nada parecian complices nada les decian. Ahahahha pero cuando yo fedeo sin querer o etc se juntan todos y te reportan me paso 3 veces y eso si que me llena de bronca. Esta comunidad es una mierda es la realidad mejor no hablar. Saludos.","replies":[]}]},{"poster":"corxeea1","date":"2019-10-14T02:40:27.925+0000","up_votes":2,"down_votes":0,"body":"Amigo te digo si trolleas no es un ban ni penalizacion aunque puede ser frustante asi es . si flammeas es normal que te banen ya que es una conducta antideportiva y no pienses que por ser troll la gente la van a banear no asi no es tu baneo es justo .","replies":[{"poster":"LeyendaRankeQ","date":"2019-10-15T22:58:14.408+0000","up_votes":1,"down_votes":0,"body":"Bueno pero no me estoy quejando, xD. Es mas ni me importa que me hayan baneado el chat no me molesta por que yo ni escribo jajaja. \nLo que me da bronca es como fue tan rápido la sanción y cuando yo mando pruebas pero pruebas de que flamean o trolean o me dicen \" Estoy afk algún problema?\" ( Por que antes le dije jueguen bien plis que es mi promo ) Osea pruebas reales donde se ve como se quedan afk o flamean muy feo nunca paso nada XD. Y no ando mandando tickets por que si solo mande 1 pero despues nunca mas. Y Me fije su historial y sigue lo mas normal jugando. xD.","replies":[]}]},{"poster":"Tigresita","date":"2019-10-13T21:11:36.918+0000","up_votes":3,"down_votes":1,"body":"Primero .. creo que lo mejor que podes hacer en esas situaciones es silenciar a los que te estan molestando.. asi no te comes el ban vos (riot es muy injusto).. y segundo.. volve a mandar el ticket en la pagina del soporte.. y si te sale bot blitzcrank, pedi hablar con alguien real... A mi una vuelta me re flamearon solo por ser mujer y no banearon al tipo, y cuando hable con el soporte , le dije \"no puede ser que yo la haya pasado tan mal y que este tipo siga feliz de la vida, a mi me banearon una vuelta por decir mancos y el me dice gorda antisocial y no lo banean, como funciona el soporte entonces? \" y lo banearon en segundos jajajaja... solo por reclamar... intentalo tal vez funcione.. saludos :3","replies":[{"poster":"LeyendaRankeQ","date":"2019-10-13T22:19:15.861+0000","up_votes":2,"down_votes":1,"body":"Gracias beiesaaaa pero no mandare nada osea no me interesa realmente. ja. Es mas me senti muy mal la primera vez que me llego el cartelito de que mi reporto fue verificado y el flamer sancionado jaaa besos grax por leer.","replies":[]}]},{"poster":"Respect The Axe","date":"2019-10-13T22:14:23.584+0000","up_votes":2,"down_votes":1,"body":"son 10 partidas total asi te calmas un rato xD","replies":[{"poster":"LeyendaRankeQ","date":"2019-10-15T23:01:26.956+0000","up_votes":1,"down_votes":0,"body":"1 No estoy alterado\n2 Nunca me queje del ban ( Osea lee )\n3 Pense que el ban era 5/5 lineas pero para 10 partidas y es 5/5 para cada partida hasta cumplir 10. XDDDDDDDDDDD Oseaaaa Jajaja. \n4 Nunca escribo xDDDDDDDDD. \n5 Es mucho pero mucho peor la Sancion que te meten de 20 minutos por estar \"Afk\" xD. \n xP.","replies":[]}]}]}