{"poster":"ESPL Vazon","date":"2017-12-11T20:46:30.880+0000","title":"Upgraden von Mastery 6 / 7 zu teuer? | Was meint ihr?","subforum":"Client Diskussion","up_votes":1,"down_votes":0,"body":"Hey alle zusammen,\r\n\r\nich bin erst vor kurzem Level 30 mit meinem Smurf gekommen und wollte mal einfach etwas loswerden. Und zwar, ist mein Ziel meinen Main Teemo {{champion:17}}  wieder Mastery 7 zu bringen. Nun habe ich bei YouTubern gesehen, dass das aufwerten eines Champion zu Mastery 6 schon alleine &uuml;ber 3000 Blaue Essenzen kostet. **Ich finde es f&uuml;r &quot;neue&quot; Spieler etwas zuviel.** \r\nDenn man m&ouml;chte sich ja auch neue Champions kaufen, damit man seinen Champion Pool vergr&ouml;ssert, ohne das man sich die gew&uuml;nschten Champs mit Riot Points kaufen muss.\r\nUnd nicht jeder Spieler hat gerade mal eben 3000 Blaue Essenzen zur Verf&uuml;gung. Ich finde bei diesem Punkt wurde mehr an die Erfahrenen Spieler gedacht, da diese ja (meistens) alle Champions bereits besitzen und sich IP aufgeh&auml;uft hat. Nun wurden ja die IP&acute;s entfernt und durch Blaue Essenzen ersetzt. Dadurch haben die meisten eine Masse an BE bekommen und k&ouml;nnen sich die Aufwertungen easy leisten. Ich finde das gegen&uuml;ber neuen Spieler bzw. Spieler die sich lieber Champions holen, ein wenig unfair.\r\n\r\n{{sticker:zombie-nunu-bummed}} \r\n\r\nWelche Probleme noch dazu kommen? \r\nMan stelle sich nun vor, ein Spieler hat bereits seinen Lieblingschampion auf Mastery 5. Nun hat er in den letzten 2 Games, mind. ein S- gehabt und damit 2 Mastery 6 Tokens erhalten, die man ben&ouml;tigt um einen Champion aufzuwerten. Problem...\r\nEr hat nicht genug BE (auch keinen Shard / Permanent Shard vom gew&uuml;nschten Champion) und kann sich also die Aufwertung nicht leisten. Was zur Folge hat, wenn er weiterspielt und er z.B. ein S oder S+ bekommt, w&uuml;rde er theoretisch einen Mastery 7 Token erhalten, was aber nicht geht, da er ja den Champion nicht auf Mastery 6 hat. \r\nErgebnis: **Er verliert (sozusagen) einen Mastery 7 Token, nur weil er sich die Aufwertung nicht leisten kann.**  {{item:3070}} {{item:3070}} \r\n\r\n_*Und ja mir ist bewusst, dass er wenn er Mastery 6 endlich geworden ist, er Gl&uuml;ck mit der Bewertung haben kann und trotzdem schnell Mastery 7 Tokens bekommt. _\r\n\r\nWas ich viel besser finden w&uuml;rde, ist wie &quot;davor&quot;.\r\nEinfach den Preis auf 500 Blaue Essenzen setzen und schnell hat man seine Aufwertung. Denn 500 Blaue Essenzen zu sammeln geht wesentlich schneller als &uuml;ber 3000.\r\n\r\n{{sticker:slayer-pantheon-thumbs}} \r\n\r\n_*Ja mir ist auch bewusst, dass man Gl&uuml;ck beim Ziehen haben kann und drei 975 RP Champions aus den Level-UP Kapseln bekommt (die umgerechnet &uuml;ber 1000 Blaue Essenzen geben)._\r\n\r\n\r\nAber was meint ihr?\r\n**Findet ihr den aktuellen Betrag ganz okay oder seht ihr es genauso wie ich?\r\nIch habe eine Umfrage ge&ouml;ffnet und stimmt einfach nur ab! :D**\r\n\r\n{{sticker:sg-lux-2}} \r\n\r\n**! Bevor ihr abstimmt, betrachtet bitte aber auch die Seite von einem &quot;neuen&quot; Spieler, der nicht Tonnen von BE besitzt und sich nicht alles leisten kann! Danke &lt;3 !**","replies":[{"poster":"Drachenlord1510","date":"2017-12-11T21:33:44.536+0000","up_votes":2,"down_votes":1,"body":"> Ich will dir nichts unterstellen, aber solche Meinungen kommen meistens von Spieler, die bereits ihre Lieblingschampions auf Mastery 7 haben und damit kein anderer den so schnell bekommt\n\nIch habe nur insgesamt fünf Champions auf Mastery 5, 6 oder 7. Also zwei in Mastery 7, zwei in Master 6 und nochmal einen in Mastery 5. Der Rest ist 4 oder tiefer. Also das trifft halt wirklich nicht auf mich zu.\nMich stört es nur, dass es absolut keine Herausforderung ist, Master 6 oder 7 auf einem Champ zu erspielen. Solang man einfach oft spielt, kriegt das jeder irgendwann, solang man nicht mit Absicht feedet.\nDass die Mastery-Stufen etwas kosten, ist die letzte kleine Barriere, die einem bis auf die paar S's in den Weg gestellt wird. Ich finde die BE-Barriere auch nicht gut, weil sie auch absolute nichts mit Skill zutun hat, aber besser als keine Barriere. Meiner Meinung nach sollten die EP-Kosten weg, aber stattdessen unbedingt dann etwas neues hin, dass Leute davon abhält, Mastery 7 ohne irgendwelche Leistung zu bekommen.","replies":[]},{"poster":"BananenXD","date":"2017-12-14T09:46:40.168+0000","up_votes":1,"down_votes":0,"body":"du bist also mit grademal level 30 main eines einzigen champs ... gratuliere - du brauchst keine anderen - spielst ja eh nur einen und fürs ranked gibts die ersten 90` und 180`skinns aus den levelboxen - muss man ja nicht können sondern nur haben damit man mit den main ins ranked kann ...\n\nwenn du aber als neuling interesse in neuen champs hast dann:\nsparst du dir sämmtliche esenzen und levelst nur die aus den levelkapseln up - wenn du wirklich einen main gefunden haben solltest dann bist du mit level 5 glücklich und freust dich über den shard aus ner kiste für die aufwertung \n\n\nfür mich - spiele seit 2 jahren - \nich level grade einige auf meinen main-pos auf lev 5 - habe viele lev 6 und 7 aber ich hebe mir mit den neuen systhem sämmtliche shards die ich aufwerten werde weil ich ihn noch nicht habe und sämmtliche shards die ich für ein ggf lev 6 und 7 brauche auch auf!\ndies bedeutet das 2 shards meiner mains nicht in die BE einfließen - ich entscheide also freiwillig diese zu geben - ich weiß dass ich den champ kann - die pos. kann - genügend andere champs habe um langsamer den rest zu bekommen","replies":[]},{"poster":"Drachenlord1510","date":"2017-12-11T20:51:13.974+0000","up_votes":1,"down_votes":0,"body":"> nicht jeder Spieler hat gerade mal eben 3000 Blaue Essenzen zur Verfügung\n\nMastery 6 und 7 sollen ja auch keine Meilensteine sein, sondern etwas Besonderes, das man sich nur leisten kann, wenn man wirklich viel Zeit und Arbeit in den Champion steckt. Wenn jeder Mastery 6 und 7 bekommen würde, dann würde sich Mastery 7 noch unspektakulärer anfühlen, als es sich sowieso schon anfühlt.\n\nIch finde die \"hohen\" Kosten gut und meiner Meinung nach könnte Mastery 7 sogar noch deutlich anspruchsvoller sein. Vielleicht noch mehr Tokens sammeln oder so.","replies":[{"poster":"ESPL Vazon","date":"2017-12-11T21:20:52.391+0000","up_votes":1,"down_votes":0,"body":"> \"Mastery 6 und 7 sollen ja auch keine Meilensteine sein, sondern etwas Besonderes, das man sich nur leisten kann, wenn man wirklich viel Zeit und Arbeit in den Champion steckt.\"\n\nHä, aber das ist doch ein Meilenstein. :D\nDu hast mit diesem Champion etwas geschafft, weil du viel Arbeit reingesteckt hast. Also = Ein Meilenstein\nSagt sogar Riot, wenn du einen Champ aufwertest: \"Glückwunsch XY, du hast einen neuen Meilenstein mit XY erreicht.\"\n\n>\"Wenn jeder Mastery 6 und 7 bekommen würde, dann würde sich Mastery 7 noch unspektakulärer anfühlen, als es sich sowieso schon anfühlt.\"\n\nIch finde nicht das je mehr Leute deinen Champion auf Mastery 6/7 haben, dein Mastery 6/7 unspektakulärer anfühlt. Wenn du dich wirklich spektakulär fühlen möchtest, dann spiele solange deinen Champion, bis du in der Top 3 Masterypoints Liste bist.\nAusserdem soll Mastery 7 nicht symbolisieren: \"Guckt mich an, ich bin nun einzigartig weil ich XY auf Mastery 7 habe!!\" sondern, es soll deinen Mates sagen: \"Dieser Spieler kennt diesen Champion sehr gut, weiss wie er gespielt wird & was für Kombos/Mechanics es gibt.\"\n\n>\"Ich finde die \"hohen\" Kosten gut und meiner Meinung nach könnte Mastery 7 sogar noch deutlich anspruchsvoller sein. Vielleicht noch mehr Tokens sammeln oder so.\"\n\nIch will dir nichts unterstellen, aber solche Meinungen kommen meistens von Spieler, die bereits ihre Lieblingschampions auf Mastery 7 haben und damit kein anderer den so schnell bekommt, sagt man \"Bitte erhöht die Anforderungen, damit man nicht so schnell meinen Champ auf Mastery 7 bekommt.\"\nDenn viele aus meiner FL die bereits ihre Champions auf 7 haben, sind ebenfalls der Meinung, dass die aktuellen Kosten fair sind.\nJedoch andere die in der (fast) gleichen Situation sind wie ich, sind der gleichen Meinung wie ich, dass die Kosten zu hoch sind. (Nicht alle!)\n\n\nAber das ist meine Meinung :D \n{{sticker:slayer-jinx-catface}}","replies":[]},{"poster":"Necromant","date":"2017-12-11T20:55:05.806+0000","up_votes":1,"down_votes":0,"body":"Würde es irgendwie mit den Masteriepunkten als auch den S-Rängen addierten damit es ausschlaggebender ist.","replies":[]}]},{"poster":"Oriius","date":"2017-12-12T03:21:22.730+0000","up_votes":1,"down_votes":1,"body":"Die kosten sind wirklich enorm teuer. ich wäre ehrlich gesat dafür das man die blauen essenzen dafür ganz weglässt aber die benötigten token stark erhöht (mind 200%) . Hab gestern und heute jeweils 5 std oder so gespielt und 2k BE gesammelt :3","replies":[]}]}