{"poster":"Encarnox","date":"2015-04-07T00:25:13.102+0000","title":"Ventajas de las rankeds","subforum":"Guias y consejos","up_votes":1,"down_votes":0,"body":"Hola,hace dos meses que soy lvl 30 y tan s&oacute;lo he jugado 6 clasificatorias porque no s&eacute; que tiene de bueno,si me dan un algo especial o ventaja en cierta cosa.\r\nTambi&eacute;n me podr&iacute;an decir para que sirven las promos u otras cosas.\r\nSaludos.","replies":[{"poster":"nifu","date":"2015-04-07T16:15:41.345+0000","up_votes":1,"down_votes":0,"body":"para que jugar en primera divicion  si podes jugar en la D o el nacional B para que jugar la libertadores o para que jugar un mundial?. si al final es solo jugar. el ser humano por naturaleza es competitivo tiene que mejorar y superar a los demas decir \" soy el rey del fakin mundo\"","replies":[]},{"poster":"lordeman10","date":"2015-04-07T01:14:22.517+0000","up_votes":1,"down_votes":0,"body":"la idea de jugar clasificatorias es conseguir una clasificación por tu desempeño, es para jugar en forma competitiva contra otros jugadores que también les interesa (en teoría) jugar en serio \n\nhay permios como los que ya te nombraron\n\n\ny el juego es diferente, la gente juega pensando en ganar, no es como normales donde la gente usa campeones que no domina por completo o usa items o juega lineas a las que no está acostumbrado acá uno va a hacer lo que ya sabe, aunque en ligas bajas esto no se da a medida que avanzas se cometen menos errores+\n\ncada partida que juegues te da puntos de liga (LP) o te los quita si perdés, juntando 100 puntos entras a promo para subir de división, una promo puede ser ganar 2 de 3 partidas para subir una división o 3 de 5 para subir una liga.. hay unas cuantas ligas sería mejor que lo leas de una fuente como wiki o algo así ","replies":[]},{"poster":"pelitos","date":"2015-04-07T01:01:46.708+0000","up_votes":1,"down_votes":0,"body":"Te recomiendo examinar y leer cada articulo de esta pagina de manera minuciosa.\n\nhttp://gameinfo.las.leagueoflegends.com/es/game-info/","replies":[]},{"poster":"SilentRado","date":"2015-04-07T00:58:22.288+0000","up_votes":1,"down_votes":0,"body":"El año pasado a todos los que terminaban en la liga Bronce cuando terminaba la temporada le daban un icono de invocador, a los que terminaban en plata le daban un icono de invocador junto con un marco para la pantalla de carga que era plateado.\n\nPara los que eran Oro, Platino, Diamante, Master y Aspirante (Challenger) le daban muchas cosas mas.\n\nPara aquellos que no jugaban las 10 partidas de posicionamiento no les daban absolutamente nada.","replies":[]},{"poster":"LygaNN","date":"2015-04-07T00:52:22.875+0000","up_votes":1,"down_votes":0,"body":"Si juegas ranked te demuestra en que grado de jugador estas, lo bueno que eres, etc.\nVentajas ? muchas, marco de tu division, iconos, skin victorioso y nada mas.","replies":[]},{"poster":"xAirWolf","date":"2015-04-07T00:35:45.074+0000","up_votes":1,"down_votes":0,"body":"Las rankeds es el modo competitvo del juego, al final de cada temporada mientras mas diviciones estes te dan premios como por ejemplo de oro para arriba, un personaje con skin,marco,icono,ect.\n\nLas promos son para subir de divicion.","replies":[]}]}