{"poster":"SleepySlayer","date":"2016-11-04T09:56:28.820+0000","title":"Riot Games is DEAD","subforum":"Player Behavior","up_votes":2,"down_votes":28,"body":"The game and company you know and love do not exist anymore, they are controlled by the money hungry Chinese that bought them (Tencent). Nu-Riot is here to ban you for vague reasons and help you open up a new account to re-spend all your money on. But, if you&#039;re a pro player or streamer with a decent following, just contact any one of the player behavior support specialists and you&#039;ll get your account un-banned and will be hurting the community again in no time! It&#039;s an absolute disgrace what this game and company has become and how HOSTILE they are to their playerbase, even to veterans who&#039;ve played since beta. Just goes to show who they really value in their community, the pros and streamers that make them money, and the hopelessly addicted who will keep making accounts to spend money on without question of why they were banned.","replies":[{"poster":"Deep Terror Nami","date":"2016-11-04T10:10:27.907+0000","up_votes":10,"down_votes":0,"body":"> they are controlled by the money hungry Chinese\n\nYes, Tencent bought the majority of Riot. No, they don't actually interfere with the game.\n\n> Nu-Riot is here to ban you for vague reasons\n\nIf you are uncertain what resulted in your punishment feel free to post your reform card (chat logs) here and we can go over it with you. If you didn't get any or need more information you can submit a ticket.\n\n> and help you open up a new account to re-spend all your money on\n\nThey don't ban because they want a player to buy stuff they bought already, they ban because a person is a problem in the community. Leaving those people in the community drives the rule-following customers away and is worse for business than losing the toxic players. If a player doesn't want to improve their behavior Riot would prefer they don't come back.\n\n> and how HOSTILE they are to their playerbase\n\nWhere are they being hostile? Being banned does not count, as it is not done for malicious reasons and is the fault of the person failing to follow the terms they agreed to.","replies":[{"poster":"Awkward Couch","date":"2016-11-04T13:20:50.472+0000","up_votes":3,"down_votes":0,"body":"> Yes, Tencent bought the majority of Riot. No, they don't actually interfere with the game.\n\nPeople also fail to realize that Tencent also has a majority stake in both Blizzard/Activision and Epic Games.  Also people have no idea what it means to be a public stock option.\n\n> open up a new account to re-spend all your money on\n\nI have never understood this argument, if a company bans you and you don't get your money back that you put into that account, why would you still spend money on that game?  No one has ever been able to explain that to me.","replies":[{"poster":"EndlessSorcerer","date":"2016-11-04T13:23:20.665+0000","up_votes":1,"down_votes":0,"body":"> I have never understood this argument, if a company bans you and you don't get your money back that you put into that account, why would you still spend money on that game? No one has ever been able to explain that to me.\n\nAddiction?","replies":[{"poster":"Awkward Couch","date":"2016-11-04T13:31:21.321+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=EndlessSorcerer,realm=NA,application-id=ZGEFLEUQ,discussion-id=gfLWo2hz,comment-id=000400000000,timestamp=2016-11-04T13:23:20.665+0000)\n>\n> Addiction?\n\nMaybe, but I don't think that's necessarily true for all people who spend money on another account after they are banned.  I just see this excuse a lot when people say Riot is just money hungry.","replies":[{"poster":"EndlessSorcerer","date":"2016-11-04T13:34:31.669+0000","up_votes":1,"down_votes":0,"body":"Honestly, I'm half convinced that people just check previous post-ban threads and copy their arguments rather than come up with their own.\n\nThey don't seem to understand that removing a toxic player is better for business and the community than allowing them to continue ruining games (discouraging other players).\n\nThey don't need the banned player's money and don't want them to play the game.","replies":[{"poster":"Awkward Couch","date":"2016-11-04T13:39:44.453+0000","up_votes":1,"down_votes":0,"body":"> They don't seem to understand that removing a toxic player is better for business and the community than allowing them to continue ruining games (discouraging other players).\n\n100% agree, that's what I've been saying, especially since Tyler1's ban.  But this is League of Legends, logic and reason has no place here.  :)","replies":[]}]}]}]}]}]},{"poster":"Zezockary","date":"2016-11-04T10:08:04.523+0000","up_votes":4,"down_votes":0,"body":"Riot games operates independently of tencent. Tencent knows if they started making riot do things then it would cause the game to lose money because chinese and american economies are too different for them to understand.\n\nCan you give me a ln example of a streamer or content creator being unbanned? Cause I have never heard of it.\n\nIf you get banned it is your own fault for breaking terms of service, and spending money on a new account is your own choice. I imagine if anything the people that refuse to purchase anything after being banned lose riot more money than the ones that keep buying make them.","replies":[{"poster":"EndlessSorcerer","date":"2016-11-04T13:26:07.019+0000","up_votes":1,"down_votes":0,"body":"> Can you give me a ln example of a streamer or content creator being unbanned? \n\nI know there was a pro-player who was banned _from competitive play_ for toxicity in solo-queue and it was later reversed.  However, they were only unbanned in pro-play and their old account was never unbanned.\n\nThat's the closest thing to an example I can think of in the 4 years I've played the game.","replies":[{"poster":"Angry Monster","date":"2016-11-04T21:52:08.213+0000","up_votes":1,"down_votes":0,"body":">I know there was a pro-player who was banned from competitive play for toxicity in solo-queue and it was later reversed. However, they were only unbanned in pro-play and their old account was never unbanned.\n\nThat was cause of a policy change. Originally one banned account was enough to removed you from pro play. Riot changed that philosophy in general.  It had nothing to do with a specific player and in several pro players in NA and Eu have benefited from this revision.","replies":[]}]},{"poster":"Awkward Couch","date":"2016-11-04T13:33:41.684+0000","up_votes":1,"down_votes":0,"body":"> Can you give me a ln example of a streamer or content creator being unbanned? Cause I have never heard of it.\n\nTo be fair to the OP, GoodGuyGarry who is a pretty big streamer got banned for 3rd party programs, and imaqtpie was banned for being in a boosted account, both of which (I think qt's ban got resolved but I'm not 100% sure) got the bans reversed.","replies":[{"poster":"dapositiveviking","date":"2016-11-04T16:03:33.377+0000","up_votes":1,"down_votes":0,"body":"sometimes accounts that level insanely quickly are flagged for boosting so that might've been qtpies case. not sure of the case specifics though","replies":[{"poster":"Awkward Couch","date":"2016-11-04T17:16:53.849+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=dapositiveviking,realm=NA,application-id=ZGEFLEUQ,discussion-id=gfLWo2hz,comment-id=000200010000,timestamp=2016-11-04T16:03:33.377+0000)\n>\n> sometimes accounts that level insanely quickly are flagged for boosting so that might&#x27;ve been qtpies case. not sure of the case specifics though\n\nI wonder what happened to that situation.  I never heard if that got resolved or not.","replies":[]}]}]}]},{"poster":"midnight oil24","date":"2016-11-04T12:30:06.654+0000","up_votes":3,"down_votes":0,"body":"Oh my god, if you don't like this then leave the game. If you don't want to leave, be glad that Riot gives you things like sandbox mode and returns Solo/Duo queue. They didn't need to do that, and people are still telling them they don't care about the playerbase.","replies":[]},{"poster":"Kei143","date":"2016-11-04T11:15:47.733+0000","up_votes":3,"down_votes":0,"body":"SleepySlayer 's account is DEAD\n\nso salty","replies":[]},{"poster":"TyrekGoldenspear","date":"2016-11-04T10:02:26.845+0000","up_votes":2,"down_votes":0,"body":"I think you have your tin foil hat on a little too tight.","replies":[]},{"poster":"Talon12","date":"2016-11-04T10:09:45.887+0000","up_votes":1,"down_votes":0,"body":"Tencent bought like 90% of riot games at start of S3, and finished rest of it mid S4...\n\nAnd ~~riot ~~ rito still operate independantly to tencent.","replies":[{"poster":"Deep Terror Nami","date":"2016-11-04T10:13:21.639+0000","up_votes":1,"down_votes":0,"body":"Heyy, what you doing out of OCE?","replies":[{"poster":"Talon12","date":"2016-11-05T01:14:03.747+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Deep Terror Nami,realm=NA,application-id=ZGEFLEUQ,discussion-id=gfLWo2hz,comment-id=00030000,timestamp=2016-11-04T10:13:21.639+0000)\n>\n> Heyy, what you doing out of OCE?\n\ndont give me that you keep coming into oce. And im here because im sick of the people in oce.","replies":[]}]}]},{"poster":"Frostmorne","date":"2016-11-04T16:12:38.079+0000","up_votes":1,"down_votes":0,"body":"well if tencent has anything to do with a game. I know its a huge money cash grab. we all know this. dont act ignorant. we all should know how tencent works now. jeez dont be gullible people. Stay WOKE! Kappa","replies":[]},{"poster":"DrCyanide","date":"2016-11-04T13:28:56.784+0000","up_votes":1,"down_votes":0,"body":"> But, if you're a pro player or streamer with a decent following, just contact any one of the player behavior support specialists and you'll get your account un-banned and will be hurting the community again in no time!\n\nSomeone forgot to tell Tyler1 that!","replies":[]},{"poster":"Timethief49","date":"2016-11-04T10:01:31.120+0000","up_votes":1,"down_votes":1,"body":"So you got banned? Which reasoning? If Flame we can discuss it with your chatlogs","replies":[]},{"poster":"SleepySlayer","date":"2016-11-04T21:46:18.265+0000","up_votes":1,"down_votes":2,"body":"Here comes the Drones defending their failing game. Heres a tip for people who think they know who they are defending, I've been playing this game for a very VERY long time and have seen the changes Tencent has placed upon Riot over the years. Back in the day if you were perma-banned and you contacted support about it they would actually listen to what you had to say and help you understand why you were banned and what rules you violated. Nu-Riot gives you a reform card and tells you to fuck off, even after you tell them that some rules are vague and not all options for improvement are on the reform cards. Let me give you an example of how Bro-Tier old Riot was in comparison to Nu-Riot, I've had friends that used to play that would send in drawn pictures of their favorite champ in MS Paint with text saying that they're sorry and old Riot would respond with their support staff grading the picture and unbanning the account. Nu-Riot only cares enough if you make another account and spend money on it, no matter how toxic you are to the community you're golden if you're dumb enough to keep spending money on their game. They are AGGRESSIVELY targeting their playerbase and people who play often to ban them without any hope of getting unbanned because they know people will come back to play and spend money, if this isn't hostile towards the community, nothing is.","replies":[]},{"poster":"Fury619","date":"2018-08-14T15:13:54.713+0000","up_votes":1,"down_votes":3,"body":"This game died cause the company focused more on trying to be a babysitter to the community playing the game instead of just focusing on the game. If the person logging on can't deal with his teammates on his own he has no business playing this game. Game became a giant whine fest of tattletale little babies screaming ill report you he said she said bullcrap. That's why me and everyone I know quit playing this game. An what takes over? A competitive game that people can say anything they want. Battle Royales.  That's why your game is dead. Logged in, just to type this won't be checking responses from a dead forum.","replies":[]}]}