{"poster":"pepi99 manc0","date":"2018-03-13T00:57:48.873+0000","title":"cual es su objetivo con los tankes?","subforum":"Jugabilidad, balance y narrativa","up_votes":16,"down_votes":2,"body":"algo que me parecio absurdo es el da&ntilde;o que le meten a los tankes que mas de 3 a&ntilde;os que juego lol no lo entiendo, da&ntilde;o verdadero, movilidad que concepto buscan? que tengan que salir todos corriendo de un garen o chogat xq te mete la R y te hace 1000 de da&ntilde;o verdadero? cual es la funcion? no estan hechos para aguantar? o tambien buscan que peguen? los offtanks, aguantan y pegan mucho mas, desventaja? generalmente son melee pero se te pueden acercar facil por su movilidad o habilidades, creo que son consientes de esto, o quizas estan jugando otro juego paralelo como cuando postearon &quot;adc mata a tank&quot; si lo mata con 3 aliados mas xq si no el tank se lo solea a menos que sea un adc anti tank. no me molesta que aguanten xq para eso estan molesta lo imparables que son y el dmg que le meten{{sticker:zombie-brand-mindblown}}  prefiero mil veces que balanceen los tanques que nivelen otros champs que te borran de un combo","replies":[{"poster":"Ks Erwyn","date":"2018-03-13T01:28:04.772+0000","up_votes":10,"down_votes":1,"body":"sigo sin entender por que la gente confunden colosos con tankes...\n\n{{sticker:sg-lulu}}","replies":[{"poster":"Tortuguita","date":"2018-03-13T02:04:11.464+0000","up_votes":4,"down_votes":1,"body":"Both tienen daño. Y es exagerado-¿Para que diferenciarlos ?","replies":[{"poster":"Ks Erwyn","date":"2018-03-13T02:55:47.300+0000","up_votes":4,"down_votes":1,"body":"hay una diferencia, los tankes puros ganan por cansancio/dps(a dps me refiero a la capasolar+cota+spam de habilidades) mientras aguantan, un coloso tiene un kit de daño definido o habilidades para rematar.","replies":[{"poster":"Tortuguita","date":"2018-03-13T03:07:27.234+0000","up_votes":1,"down_votes":0,"body":"Como siempre , tienen ese daño exagerado plus una resistencia que sobrepasa a una montaña. Seas coloso o tank tienes las stats mas \"balanced\" del juego xD","replies":[{"poster":"Ks Erwyn","date":"2018-03-13T10:44:49.716+0000","up_votes":1,"down_votes":0,"body":"ya me estoy frotando los dedos para usar a shacotanke en el 8.6....\n\n{{sticker:sg-lulu}}","replies":[{"poster":"Tortuguita","date":"2018-03-13T17:41:39.984+0000","up_votes":1,"down_votes":0,"body":"The Nightmares...","replies":[]}]}]}]},{"poster":"LGBT Valentina","date":"2018-03-13T17:06:12.955+0000","up_votes":1,"down_votes":0,"body":"Los tankes tienen movilidad en general. Algun elemento + algun tipo de iniciacion o disagage\n\nLos tankes solo tienen daño en early game y en mid game entran en su power spike, por tener un mix de daño y un mix de 2 items tankes\n\nLos colosos no tienen movilidad directamente, solo caminan. En general mientras mas se alarga la partida mas fuertes son, pero eso varia en cada elo. Los adc les hacen Out scale a los colosos por que los kitean. Los tankes al iniciar dan una ventana de oportunidad\n\n\nCho no es tanke, garen no es tanke, darius no es tanke, nasus no lo es, yorick no lo es, etc. Algunos tienen un mix de coloso y tanke\n\nOrn en si es un mix, pero tira mas para el lado tanke por la baja movilidad que posee (aunque ese champ no sirve mas desde el cambio a la W hue)\n\nAlgunos champs pueden cambiar su rol en base a lo que el equipo necesita esa partida, obviamente no es lo mismo un Malphine que un renekton que se buldeo full tank por que tenia 3 ADC en su team (kinkred jg-corki mid-vayne adc y supp el q se te cante). El malphine cumple mejor su funcion de tanke, pero en early renekton saca ventaja al ser bruiser y va al mid game con 1 item mas y cambia su funcion a tanke durante toda la partida\n","replies":[{"poster":"Tortuguita","date":"2018-03-13T17:37:25.602+0000","up_votes":1,"down_votes":0,"body":"Mas haya de su escala de daños en early o late game en aberrante ver como un campeón que no tiene su \"fuerte\" en esta estadística de todas formas sea early/late game pueda destruirte solo buildeandose defensas , es que no existe lugar de donde coger esa cosa. Soy Kha'zix top y hasta el día de hoy todos los tanks bajan aun mas que yo al especializarme en daño... ¿Que sentido tengo para ser asesino si el tank provoca el mismo daño y aguanta 5 veces mas? Te parece que como perciben a los tanks riot games esta realmente correcto cuando aun a lvl 18 un maokai full tank puede meterme un combo y seguir destruyéndome la barra de salud...\n\nPuedo ir a cualquier otro juego y veré que los \"Tank / Colosos\" tienen daño pero esta controlado , aquí es totalmente ridículo y un ornn con mascara abisal solamente en su inventario y el resto defensas puede hacer mas daño a mi carry con 1/2 de su combo que yo a su carry necesitando que el este aislado xD\n\nNo me quejo que me ganen los tanks o bruisers , eso esta bien , pero que metan de tal forma esos daños es totalmente ridículo. Puedes ganarme en cc y utilidad por ende ganas las tfs y demás , pero en mi stats principal no puedes hacerlo ... es que no es así como funciona xD","replies":[{"poster":"LGBT Valentina","date":"2018-03-13T18:11:38.565+0000","up_votes":1,"down_votes":0,"body":"**Mas haya de su escala de daños en early o late game en aberrante ver como un campeón que no tiene su \"fuerte\" en esta estadística de todas formas sea early/late game pueda destruirte solo buildeandose defensas , es que no existe lugar de donde coger esa cosa. **\n\nEl kiteo es tu respuesta\n\n**Soy Kha'zix top y hasta el día de hoy todos los tanks bajan aun mas que yo al especializarme en daño... ¿Que sentido tengo para ser asesino si el tank provoca el mismo daño y aguanta 5 veces mas? Te parece que como perciben a los tanks riot games esta realmente correcto cuando aun a lvl 18 un maokai full tank puede meterme un combo y seguir destruyéndome la barra de salud...**\n\nSi usas un champ que no esta diseñado para lane es otro tema. Counters en si existen, pero no sirve tu comparacion\n\nLa diferencia de un tanke y un asesino, no es el DMG en si, es que tan rapido sea. Me parece correcto que un tanke en late le gane a un asesino en terminos de DPS. ¿Que hace el asesino haciendole cheese a un tanke en late?, no tiene sentido eso. Matas a squish no a tankes (mas haya que te podes hacer DD-BC y LW)\n\n\nLa habilidad del asesino, es matar con rapides al objetivo primordial y ganar la TF. El objetivo del tanke es abrir la ventana para que el asesino mate al carry, el objetivo del coloso es romper las bolas y si llega al enemigo (obligado a usar Flash/Ghost o depende del engage de un tanke o comprar items que te dejan atrasado pero fortalezen tus debilidades) matarlo\n\n\nEj: Kayn. El darkin en todas las etapas del juego hace mas daño que el asesino, incluso Riot lo dijo. La diferencia es que el asesino mata al carry entre 0.4-0.75 y el Darkin en 2-3 segundos, en esos 2-3 segundos el darkin muere por kiteo\n\n\nEn los juegos que hablas, en parte es peor jugar esos personajes. Esta pesando para el soloq y que la experiencia del jugador no sea una mierda. Tenes que pensar el juego asi\n\nAunque sea un juego en equipo, el SOLOQ es SOLOQ","replies":[{"poster":"Tortuguita","date":"2018-03-13T18:29:14.749+0000","up_votes":1,"down_votes":1,"body":"Todo lo que expones tendría sentido y seria realmente \"disfrutable\" si el meta del juego no estaría 24/7 con los tanques destruyéndote season tras season con sus stats desbalanceadas , es una verdad que todo jugador de league sabe. El meta tank ha deformado tanto league of legends que en sus inicios cuando podías jugar Olaf full ad y sacar diversión / competitividad a partes iguales ahora solo le debes sacar off-tank por que de lo contrario quedas totalmente inútil a comparación de la media de tank/colosos del meta actual.\n\nCansado de ver en top o jungla a las Sejuanis,Zac,Shyvana,Udyr que rushean tabi / encantamiento de coloso (creo que se llama asi) y de un combo te revientan , es que no tiene ni el mas mínimo sentido y no es para nada divertido. Al final seguramente puedes superarles por que llegas a sus carrys y los destruyes de un combo pero hasta ese entonces y aun allí esos champs siguen dando todo el asco jugar contra ellos de una forma totalmente vomitiva.Esta tan incrustado en el meta de forma tan obscena el rushear tabi que las otras botas parecieran que no existen en absoluto y es aun mas insano lo que me puede denegar en daño un adc solamente con las tabi o el Udyr solo con tabi y martillo de caufield me destruye aun el yendo 0/4... ¿Que tipo de balance es eso? Si me pusiera a jugar ese tipo de cosas o ww mitad de mi materia gris quedaría totalmente inútil por que sé que aun yendo 0/4 puede tankear la de dios y pegar aun mas que mi useless 7/2 (llego a ir 0/4 con Kha'zix y simplemente no existe remontada alguna).\n\nPuedo seguir hablando de lo irritante que es este league of legends (especialmente en top) desde la S4 con los tanks/colosos dándote todo el asco con su equilibrio perfecto entre cc/vida/resistencias/daño pero voy pasando , solo debes ver como el 8/10 de las personas prefiere tankearse de forma obscena antes de ir por algo mas \"risky\" por que saben que es el mejor modo de jugar ahora mismo , con vida y daños porcentuales...","replies":[{"poster":"LGBT Valentina","date":"2018-03-13T18:52:12.446+0000","up_votes":1,"down_votes":0,"body":"**Todo lo que expones tendría sentido y seria realmente \"disfrutable\" si el meta del juego no estaría 24/7 con los tanques destruyéndote season tras season con sus stats desbalanceadas , es una verdad que todo jugador de league sabe. El meta tank ha deformado tanto league of legends que en sus inicios cuando podías jugar Olaf full ad y sacar diversión / competitividad a partes iguales ahora solo le debes sacar off-tank por que de lo contrario quedas totalmente inútil a comparación de la media de tank/colosos del meta actual.**\n\nEso es mentira. Solo hubo 3 season donde los tankes tuvieron impacto (salvo una season, el resto duro 6-7 parches). Si previamente antes de la s3, los tankes existian lo desconosco por que todo era op en ese momento\n\nY olaf quedo inutil (y todos los bruiser, salvo que tengas un kit broken como camile-riven), gracias a que los ADC De mierda y en general, todos los champs, mas específicamente los adc y mids, nunca pararon de buffearles los DMG. No te sirve de nada ser full AD o bruiser, si ni te podes acercar \n\n\n**Cansado de ver en top o jungla a las Sejuanis,Zac,Shyvana,Udyr que rushean tabi / encantamiento de coloso (creo que se llama asi) y de un combo te revientan , es que no tiene ni el mas mínimo sentido y no es para nada divertido**\n\nEsos son problemas de los items, no de los campeones. Las tabi hace años son un problema y las tabi con la rama basica de la HP\n\n**Esta tan incrustado en el meta de forma tan obscena el rushear tabi que las otras botas parecieran que no existen en absoluto y es aun mas insano lo que me puede denegar en daño un adc solamente con las tabi o el Udyr solo con tabi y martillo de caufield me destruye aun el yendo 0/4...**\n\nEso en si esta bastante bien. Si me kiteas a muerte estando 0/7 con un ADC, no le veo el problema que un udry con tabi y un item de AD, le rompa la cabeza a un squish que este feed y le gane por Stats basicas y daños bases/escalados mejores \n\nEl problema, es el tabi. No los champs y las tabi no generan problema solo en los tankes, generan problema en casi todos los roles. Curiosamente los tankes se benefician poco de las tabi. Las tabi es basicamente anti burts y DPS, el tanke de por si ya lo es con sus items, pero mientras mas defensas suma, peor escalan\n\n**Si me pusiera a jugar ese tipo de cosas o ww mitad de mi materia gris quedaría totalmente inútil por que sé que aun yendo 0/4 puede tankear la de dios y pegar aun mas que mi useless 7/2 (llego a ir 0/4 con Kha'zix y simplemente no existe remontada alguna).\n**\nPesima comparacion\n\nPrimero por que WW Esta op desde que salio\nSegundo por que WW es un champ de mid game y un late game \"decente\"\nTercero por que casi todos los asesinos del juego (por no decir todos), estan orientados a early game. Si fracasan, no deberian poder remontar con facilidad. Si fallas en tu fuerte, no mereces remontar habiendo hecho todo mal en lo que se suponia que sobresalías \n\n**Puedo seguir hablando de lo irritante que es este league of legends (especialmente en top) desde la S4 con los tanks/colosos dándote todo el asco con su equilibrio perfecto entre cc/vida/resistencias/daño pero voy pasando , solo debes ver como el 8/10 de las personas prefiere tankearse de forma obscena antes de ir por algo mas \"risky\" por que saben que es el mejor modo de jugar ahora mismo , con vida y daños porcentuales...**\n\nLa top lane esta arruinada desde mediados de S3, no por los tankes y colosos, eso es muy falso. La top lane esta arruinada por que se basa en pickear lo mas OP y aunque pickies su counter, el counter ni le puede hacer frente\n\nMientras mas HP y daño, haya que buldearse, mas culpa tiene el daño y los Carrys son los culpables de ellos, no los tankes. Si la gente no juega champs con riesgo es debido a que:\n1: El daño es tan alto que no pueden acercarse a los carrys\n2: Un rol varia su funcion y se especializa en protejer a los carrys (normalmente acompañado de items op. Ej: Season actual y previa con los items de supp)\n3: El Snowall del juego es tan alto, que ya no es necesario que el JG gankee la linea, ya con bajarte 40-50% de HP en un gank, la linea puede estar decidida y los JG estan forzados a gankear y divear, debido a que los tiempos de respawn de la JG es ALTISIMO por que Riot odia el farmeo en la jg \n\nNo tienen la culpa en si los tankes y los items tankes (aunque los items tankes, aveces si la tienen, paso pocas veces, pero sucedio) por querer curar el daño que provocan los carrys al tener daños tan elevados \n\n\nCuriosamente es mejor tener daños bases que %, pero bueno..... es tu opinion, aunque los numeros se rian","replies":[{"poster":"Tortuguita","date":"2018-03-13T19:47:48.653+0000","up_votes":1,"down_votes":1,"body":"El hecho que los carrys tengan tanto daño y no puedas acércate a ellos (cosa que no puede hacer olaf por que le destrozan el cerebro) es lo que hace aun mas llamativos los picks safe de los tankes por que aun enfrentándote a terribles daños como los de Ej: Xayah el tank es el único que se les puede acercar sin tener que recibir tanto castigo y hacerle un daño de lo mas decente. (plus te haces cota de espinas y CUALQUIER champ que depende de life steal puede irse a llorar)\n\nEs en este momento cuando recuerdo al ornn irse con 10% de la vida y yo un 5% cuando el solo comprándose cota , brillo y tabi contra mi Danza de la muerte y tres dorans pudo sobrevivir y ademas bajarme toda la vida. (Flipo en colores como el oro en los items de tanks dan aun mas profit que un item de 3650 jaja xD) Es increíble como un solo item + las stats bases de un campeon pueden contrarrestar de maneras alucinantes mi modo de jugar (Olaf full ad Q + W max) solo gastándote 1000 de oro , es un ofertón.\n\nLo de los items de tank o simplemente de defensa es un total desfase, simplemente debes ver la cantidad de oro que gastas en hacerte una cuchilla para que el top tank de turno se rushee unas tabi y te pueda seguir sacando ventaja o una rica cota de mallas para que tu daño sea totalmente minúsculo y ellos sigan siendo efectivos con su daño porcentual.\n\nLa mejor parte es que los asesinos tienes su mejor fase en early y puede ser verdad pero los tanks fácilmente te la contrarrestan comprando tabi y items de defensa hasta donde les tapa la visión plus las runas de tank que dan aun mas beneficios que las de dominación (solo ves electrocutar en competitivo por que las otras dos se quedan súper atrás) El tank con todas las balanced stats que tiene sigue siendo decentemente efectivo durante todo el match hasta en early en donde los asesinos son \"fuertes\" como tu expones se quedan en la basura contra un ornn que les rushea cota de espinas y un brillo para hacerles un combo y destrozarles completamente la barra de vida xD\n\nNo puse las season en donde los tanks dieron y dan todo el asco , my bad. (Seria desde a fines de la s3 hasta la actualidad) era increíble ver como se peleaban 5min las tfs para ver quien se reventaba la cabeza mas duro contra la pared hasta que uno de los dos caía , ahora no es tan así por que los carrys los están manteniendo a raya pero contra cualquier otro rol los tanks tienen muchas probabilidades de ganar simplemente por las stats + items sin mucho esfuerzo.\n\nNo digo que los tanks deban desaparecer ni tampoco que los perseguiré con una antorcha por todo la grieta sino que podrían hacer un daño decente pero no que de un combo me puedas bajar mitad de vida sin ningún item de daño... así no funciona .-.\n\nPero es tu opinión , a pesar de que un ornn me aguante el combo solo con una habilidad , con la runa se cure el daño de mi Q+W en la cara y ademas con el brillo me saque aun mas que mi Q al estar el aislado se te rían muy fuerte xD","replies":[{"poster":"LGBT Valentina","date":"2018-04-11T23:38:51.657+0000","up_votes":1,"down_votes":0,"body":"**El hecho que los carrys tengan tanto daño y no puedas acércate a ellos (cosa que no puede hacer olaf por que le destrozan el cerebro) es lo que hace aun mas llamativos los picks safe de los tankes por que aun enfrentándote a terribles daños como los de Ej: Xayah el tank es el único que se les puede acercar sin tener que recibir tanto castigo y hacerle un daño de lo mas decente. (plus te haces cota de espinas y CUALQUIER champ que depende de life steal puede irse a llorar)**\n\nEsto es mentira, cualquiera tank se va kiteado y con los kits actuales hasta se ignora y le hacen disagage con los supps. \nPick up, es no existia antes con los tankes\n\n\n**Es en este momento cuando recuerdo al ornn irse con 10% de la vida y yo un 5% cuando el solo comprándose cota , brillo y tabi contra mi Danza de la muerte y tres dorans pudo sobrevivir y ademas bajarme toda la vida. (Flipo en colores como el oro en los items de tanks dan aun mas profit que un item de 3650 jaja xD) Es increíble como un solo item + las stats bases de un campeon pueden contrarrestar de maneras alucinantes mi modo de jugar (Olaf full ad Q + W max) solo gastándote 1000 de oro , es un ofertón.**\n\nEso no tiene nada que ver con los tanks, eso es problema de los tiempos\n\nQue las GW existan muestra lo pobre que es el balance. Todos los life steal del juego son pateticos vs GW y sin GW son op, entonces en que quedamos?. Gracias Riot games por ser tan down\n\n\n**La mejor parte es que los asesinos tienes su mejor fase en early y puede ser verdad pero los tanks fácilmente te la contrarrestan comprando tabi y items de defensa hasta donde les tapa la visión plus las runas de tank que dan aun mas beneficios que las de dominación (solo ves electrocutar en competitivo por que las otras dos se quedan súper atrás) El tank con todas las balanced stats que tiene sigue siendo decentemente efectivo durante todo el match hasta en early en donde los asesinos son \"fuertes\" como tu expones se quedan en la basura contra un ornn que les rushea cota de espinas y un brillo para hacerles un combo y destrozarles completamente la barra de vida xD**\n\nY...\nSi el asesino se tira al tank, la verdad es para volver al aserrado 5 y volver a aprender las cosas basicas del lol\n\n\n**No puse las season en donde los tanks dieron y dan todo el asco , my bad. (Seria desde a fines de la s3 hasta la actualidad) era increíble ver como se peleaban 5min las tfs para ver quien se reventaba la cabeza mas duro contra la pared hasta que uno de los dos caía , ahora no es tan así por que los carrys los están manteniendo a raya pero contra cualquier otro rol los tanks tienen muchas probabilidades de ganar simplemente por las stats + items sin mucho esfuerzo.**\nNo, eso solo fue 1 season\n\nAhora los Carry hacen RIGHT CLICK, peor que los que se quejan de yi y trynda + RANGO + KITE. Que tiene mas burts que un asesino y entran en power spike al min 20\n\nLos \"tanks\", sirve por que se buldean items tanks y no pierden utilidad. El ser tanke no lo define el kit, solo hace que no decaiga. LOS ADC son problema de que el resto de las lineas y clase sea una mierda, lo unico que les hace \"frente\" (patetico llamarles a eso frente) son los tankes, por que se arman items tankes y proporcionan CC, no daño. Solo daño en early\n\n\n**Pero es tu opinión , a pesar de que un ornn me aguante el combo solo con una habilidad , con la runa se cure el daño de mi Q+W en la cara y ademas con el brillo me saque aun mas que mi Q al estar el aislado se te rían muy fuerte xD**\n\nLas runas \"tanke\" son HYPER OP en early game. Solo las tanke, son HYPER MEGRA ULTRA OP en early game y todos los champs la usan, por que es un anti burts literalmente\n\nTe repito, ataca al problema, mata a la raiz, no empieces cortando las hojas \n\nComente tarde xq era un post largo y me gusta entrar al foro a ver bardo","replies":[]}]}]}]}]}]}]}]},{"poster":"pepi99 manc0","date":"2018-03-14T00:46:42.672+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ks Erwyn,realm=LAS,application-id=xQmJPO8F,discussion-id=GfltnGde,comment-id=0002,timestamp=2018-03-13T01:28:04.772+0000)\n>\n> sigo sin entender por que la gente confunden colosos con tankes...\n> \n> {{sticker:sg-lulu}}\n\ntank o coloso no te parece exagerado el daño para todo lo que aguantan?","replies":[{"poster":"Dog Bulling","date":"2018-03-14T13:29:36.489+0000","up_votes":1,"down_votes":0,"body":"No realmente, porque hay que considerar que les toma varios segundos realizar una ejecución a un carry, sumado al tiempo en el cual deben llegar hacia tí. El único que encuentro ridículo es {{champion:31}} porque hace un Oneshot en toda regla, pero el resto necesitan quitarte más de la mitad de su vida para luego rematar, y su carencia de movilidad o CC fiable hace que les sea muy dificil alcanzar a alguien, sobretodo a enemigos móviles o que están recibiendo Peel.","replies":[]}]},{"poster":"AcosadorDeViejas","date":"2018-03-13T16:48:40.201+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ks Erwyn,realm=LAS,application-id=xQmJPO8F,discussion-id=GfltnGde,comment-id=0002,timestamp=2018-03-13T01:28:04.772+0000)\n>\n> sigo sin entender por que la gente confunden colosos con tankes...\n> \n> {{sticker:sg-lulu}}\n\nJaja colosos , una nueva clase? en serio jaja.","replies":[]}]},{"poster":"Tortuguita","date":"2018-03-13T01:14:27.629+0000","up_votes":6,"down_votes":2,"body":"Shhh que los tanques son la vaca sagrada de Rito , los tocas a ellos y el juego se pone patas para arriba. (?","replies":[{"poster":"Mazoku","date":"2018-03-13T01:33:34.865+0000","up_votes":3,"down_votes":1,"body":"Esos son los ADC. Jugar un game sin adc es casi insta loss...\n\n{{sticker:sg-lulu}}","replies":[{"poster":"I TzaR I","date":"2018-03-13T01:37:41.140+0000","up_votes":1,"down_votes":0,"body":"Jugar un game sin cualquier rol es instaloss xd","replies":[{"poster":"Mazoku","date":"2018-03-13T01:38:54.983+0000","up_votes":3,"down_votes":0,"body":"ADC no es un rol, es una cualidad de un champ xd.","replies":[]}]}]}]},{"poster":"Neo Gaussrik","date":"2018-03-13T18:30:17.199+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=The Dodger,realm=LAS,application-id=xQmJPO8F,discussion-id=GfltnGde,comment-id=,timestamp=2018-03-13T00:57:48.873+0000)\n>\n> algo que me parecio absurdo es el da&amp;ntilde;o que le meten a los tankes que mas de 3 a&amp;ntilde;os que juego lol no lo entiendo, da&amp;ntilde;o verdadero, movilidad que concepto buscan?\n\nUn tanque es un campeon que recibe daño para que sus aliados no lo hagan.\n\nEn un MMORPG, un tanque puede lograr esto mediante una mecanica de agresion para que los enemigos elijan atacarlo. En un FPS, un tanque necesita alguna mecanica para incentivar a los enemigos a atacarlo, como ser muy grande o poder poner barreras.\n\nEn League of Legends, esto significa que cada tanque necesita alguna razon por la cual no lo puedes ignorar- ya sea por su control de masas, daño persistente, o habilidad de atajar los ataques apuntados a sus aliados.\n\n> que tengan que salir todos corriendo de un garen o chogat xq te mete la R y te hace 1000 de da&amp;ntilde;o verdadero?\n\nGaren no es un tanque, es un coloso. Su funcion es hacer daño.\n\nEn el caso de Cho'Gath, se le permite hacer tanto daño subito porque carece de habilidades de movilidad, y la manera de evitarlo debiera ser no dejarlo llegar a melee.","replies":[{"poster":"DkA Darkito","date":"2018-03-14T00:29:36.314+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Riot Gaussrik,realm=LAS,application-id=xQmJPO8F,discussion-id=GfltnGde,comment-id=0007,timestamp=2018-03-13T18:30:17.199+0000)\n> \n> En League of Legends, esto significa que cada tanque necesita alguna razón por la cual no lo puedes ignorar- ya sea por su **control de masas**, **daño persistente**, o habilidad de** atajar los ataques apuntados a sus aliados**.\n\nSi bien es cierto que los tanques necesitan tener alguna herramienta para lograr que los enemigos lo ataquen a él, ¿Consideras justo/balanceado que hayan tanques que posean 2 o 3 de estas cualidades que mencionaste?\n\n Por dar un ejemplo, Ornn tiene mucho CC en área y con bajo enfríamento, y al mismo tiempo, tiene un daño elevadísimo si se lo aplica a un squishy (y contra no tan squishys también es un daño considerable).","replies":[{"poster":"Dog Bulling","date":"2018-03-14T15:24:37.447+0000","up_votes":1,"down_votes":0,"body":"Todo indica que no es un gran problema, ya que el necesita como 12 segundos para matarte, y si eres ADC encima esa enorme vida permite al tirador curarse un montón.","replies":[]}]},{"poster":"Digidoxs","date":"2018-03-13T18:52:36.489+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Riot Gaussrik,realm=LAS,application-id=xQmJPO8F,discussion-id=GfltnGde,comment-id=0007,timestamp=2018-03-13T18:30:17.199+0000)\n>\n> Un tanque es un campeon que recibe daño para que sus aliados no lo hagan.\n> \n> En un MMORPG, un tanque puede lograr esto mediante una mecanica de agresion para que los enemigos elijan atacarlo. En un FPS, un tanque necesita alguna mecanica para incentivar a los enemigos a atacarlo, como ser muy grande o poder poner barreras.\n> \n> En League of Legends, esto significa que cada tanque necesita alguna razon por la cual no lo puedes ignorar- ya sea por su control de masas, daño persistente, o habilidad de atajar los ataques apuntados a sus aliados.\n> \n> Garen no es un tanque, es un coloso. Su funcion es hacer daño.\n> \n> En el caso de Cho&#x27;Gath, se le permite hacer tanto daño subito porque carece de habilidades de movilidad, y la manera de evitarlo debiera ser no dejarlo llegar a melee.\n\nIgual, creo que se entendió el punto de la pregunta. Creo que la pregunta seria \"¿Que planean hacer algo con los tanques?\" No creo que no solo por lo casual, en mi caso es mas por el competitivo. ¿Tienen planeado algún cambio que afecte a los tanques y haga bajar su prioridad ante campeones que no son tanques?","replies":[{"poster":"Neo Gaussrik","date":"2018-03-13T20:36:30.754+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Reno Jackson,realm=LAS,application-id=xQmJPO8F,discussion-id=GfltnGde,comment-id=00070000,timestamp=2018-03-13T18:52:36.489+0000)\n> &quot;¿Que planean hacer algo con los tanques?&quot; No creo que no solo por lo casual, en mi caso es mas por el competitivo.\n\nAl menos en el corto plazo (8.6) tenemos algunos cambios a objetos y maestrias que los van a afectar, pero no hay cambios directo a campeones tanques que yo me haya enterado.","replies":[{"poster":"Digidoxs","date":"2018-03-16T20:06:56.499+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Riot Gaussrik,realm=LAS,application-id=xQmJPO8F,discussion-id=GfltnGde,comment-id=000700000000,timestamp=2018-03-13T20:36:30.754+0000)\n>\n> Al menos en el corto plazo (8.6) tenemos algunos cambios a objetos y maestrias que los van a afectar, pero no hay cambios directo a campeones tanques que yo me haya enterado.\n\n¿Va a ser suficiente? Porque acabo de tener una Poppy enfrente. Que, literalmente, no se bajaba ni entre 3 personas. Hizo mas daño que muchos de la partida. Entiendo que los tanques tengan que ser una amenaza. Pero, seamos realista. No puede ser que hagan 42k de daño, con items que solo le dan vida. En general, deberían darse cuenta que los tanques predominan en el juego. \nPD: Perdon por la tardanza en responder","replies":[]}]}]},{"poster":"Dog Bulling","date":"2018-03-13T19:09:58.977+0000","up_votes":1,"down_votes":0,"body":"Aparte hay otro detalle que no se consideró en esa lista, y es el elevado daño base de un tanque ¿Que pasaría con los tanques sin ese daño base considerable? Lo que pasaría es que también estarían condenados a perder la fase de lineas, ya que al inicio ellos no aguantan mucho más que un mago o un ADC y no puedes esperar que el jungla te gankee (A pesar de como facilitas esos 2vs1), y encima implicaría que no aguantarás lo necesario para aportar en TFs. \nEsto se apreció cuando hicieron los cambios a {{item:3068}} junto al rework de tanques, la cual perdió algo de daño hacia campeones; ¿Que pasó? Que los tanques en Top quedaron en un estado lamentable durante más de un mes, y eso que solo fueron 10 de daño por segundo menos (Nadie se fijó en ello porque nos centramos más en cuan roto quedaron {{champion:154}} {{champion:113}}, lo horrible de la nueva R de {{champion:57}} y los nuevos objetos de tanques).\n\nPor lo demás si, los tanques de verdad no tienen tanto daño, lo que pasa es que pueden mantenerse en batalla mucho tiempo, lo cual les permite pegar más (Digo, 200 de DPS por 10 segundos equivalen a 1000 de DPS por 2 segundo). Y si que tienen un daño que les permite limpiar decentemente, e incluso ganar algunos 1vs1 si lo juegas bien, pero no mucho más, y en juego tardío se quedan muy cortos de daño, perdiendo ante casi cualquier campeón de daño sostenido considerable.","replies":[{"poster":"Neo Gaussrik","date":"2018-03-13T20:39:03.301+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Dog Bulling,realm=LAS,application-id=xQmJPO8F,discussion-id=GfltnGde,comment-id=00070001,timestamp=2018-03-13T19:09:58.977+0000)\n>\n> Aparte hay otro detalle que no se consideró en esa lista, y es el elevado daño base de un tanque ¿Que pasaría con los tanques sin ese daño base considerable?\n\nSi el tanque no es una amenaza a los acarreadores enemigos, ¿por que les prestarian atencion en vez de ignorarlos?\n\nNo todos los tanques presentan esta amenaza, pero si no lo hacen, necesitan otra mecanica para incentivar al enemigo a pegarles a ellos y no a sus aliados.","replies":[{"poster":"Dog Bulling","date":"2018-03-14T13:47:11.959+0000","up_votes":1,"down_votes":0,"body":"Te entiendo, pero en top SI NECESITAN ese daño base de decente (Tampoco digo más que el rival, pero como mínimo que no sea prácticamente despreciable) para poder enfrentarse a otro laner que se haga a daño si juegan bien. En la jungla daño extra a monstruos basta para no quedarse cortos de nivel y evitar que sean un lastre (Para eso la {{item:3751}}) , y si es soporte el daño es completamente prescindible. \n\nY es que, por mucho CC que un tanque tenga en top, este debe acompañarse con un poco de daño sostenido, o si no perdería prácticamente todos los intercambios, debido a que al inicio ellos no son mucho más resistentes que el rival. Ese problema se puede apreciar con {{champion:111}}, que está muy mal en estos momentos, ya que tiene el daño y aguante de un soporte, junto al bajo peel y elevado consumo de maná de un toplaner (Vamos, que tiene lo peor de ambos mundos, lo cual le impide funcionar muy bien tanto en bot como en top, a pesar de las toneladas de CC que aporta).","replies":[]}]},{"poster":"Tortuguita","date":"2018-03-13T19:51:45.232+0000","up_votes":1,"down_votes":0,"body":"Pues si pero luego ves como Ornn te combea solo con brillo y te destroza y te quedas (¿Que paso aquí...?)","replies":[]}]},{"poster":"Jin Kaien x3","date":"2018-03-14T03:36:36.388+0000","up_votes":1,"down_votes":0,"body":"lo que deberian arreglar  es el daño de la r de {{champion:31}} , ya que si activas{{item:3193}}  y tiras r al ser daño verdadero no se reduce y eso ya es mucha ventaja para un cho","replies":[]}]},{"poster":"Rick Silence","date":"2018-03-13T01:04:38.140+0000","up_votes":2,"down_votes":0,"body":"Seh, algunos tanques tienen demasiado daño ._.","replies":[]},{"poster":"Eligandini","date":"2018-03-13T01:51:00.129+0000","up_votes":1,"down_votes":3,"body":"Si hace 3 años que jugas y sabes como es el meta game, que los champions con daño de top buildean vida, etc. A que vienen estos temas en el foro? aparte de que nunca dan la cara los rioters para contestar esto.\n\nLa vida es simple muchachos, este juego es asi, si lo jugamos es porque claramente nos divierte y si no es como otros juegos donde los tanques solo tanquean, pues agradezcan, porque por algo juegan a este y no al otro.","replies":[{"poster":"Tortuguita","date":"2018-03-13T02:03:08.364+0000","up_votes":2,"down_votes":1,"body":"No tiene sentido , por que me guste el juego (algunas partes) no significa que deba bajar la cabeza por el daño asqueroso de un ornn con cota , es que no tiene ni el mas mínimo sentido. Y ademas si siguiéramos esa filosofía el meta seguiría stuck desde la temporada 1 xD.","replies":[]}]},{"poster":"Sonne","date":"2018-03-13T14:32:59.511+0000","up_votes":1,"down_votes":0,"body":"Yo tampoco entiendo el daño de los tanques. Cuando termino las partidas siempre veo las estadísticas y cada vez me sorprenden más.\n\nUn Malphite y un Rammus, full armadura y vida (es decir, pura itemización defensiva), que terminaron haciendo el mismo daño e incluso un poco más que una Lux mid.......\n\n¿Cuál es la lógica? Siquiera tienen ítems de daño y lo hacen, además de aguantarse la vida porque su build es sólo defensa :/","replies":[{"poster":"Bot Murloc","date":"2018-03-13T15:59:46.954+0000","up_votes":1,"down_votes":0,"body":"el de rammus no entiendo mucho tampoco por q la armadura deberia aumentarle solo el AD, en cambio en malphite la armadura le aumenta el daño de la E y la W, y tambien gana armadura pasiva por la W","replies":[{"poster":"Dog Bulling","date":"2018-03-13T18:53:16.714+0000","up_votes":1,"down_votes":0,"body":"¿Sabes que ese bonus de AD de la pasiva fue removido hace como 8 meses?\n\nActualmente Rammus gana daño mágico en sus básicos con la armadura, y el daño que recibe el rival por su W se rige por el daño de la pasiva.","replies":[{"poster":"Bot Murloc","date":"2018-03-14T13:27:57.880+0000","up_votes":1,"down_votes":0,"body":"aaaahhh weeeee q frutadaaaaaa","replies":[{"poster":"Dog Bulling","date":"2018-03-14T15:13:17.020+0000","up_votes":1,"down_votes":0,"body":"Ni tanto, ya que ahora sus básicos activan el {{item:1039}} , por lo que sufre menos y limpia más rápido. Aparte, ahora Rammus adquiere un porcentaje extra de armadura con su W en vez de un bonus fijo (Hasta 90% de tu armadura actual), la E otorga un buff de AS si tienes activa otras habilidades, y encima la Q disminuye su CD a más de la mitad si la maxeas, así como tiene un hitbox mucho más cómodo de usar. Por último, su R mete un slow acumulativo. Eso sí, la W te ralentiza considerablemente.\n\nEn síntesis, ahora aguanta más, escala mejor con la armadura, limpia mejor, tiene aún mejores gankeos y ya no es un pick exclusivo ante equipos full AD. No es de sorprender entonces los múltiples nerfeos que ha recibido en estos últimos parches, porque esa cosa estaba rota.","replies":[]}]}]}]}]},{"poster":"Jin Kaien x3","date":"2018-03-14T03:43:17.119+0000","up_votes":1,"down_votes":0,"body":"los colosos hacen daño, hay que aceptarlo, pero que algunos hagan daño y que además te bajen armadura eso ya es exagerado, vease{{champion:75}} {{champion:86}}","replies":[]},{"poster":"killerbeatit","date":"2018-03-13T18:49:21.484+0000","up_votes":1,"down_votes":0,"body":"Queria comunidad de lol ..al escribirles esto estoy triste, nuestros tanques han sido derrocados Y REEMPLAZADOS POR EL BENÉVOLO GENERAL GAREN \nTodos amamos a garen y a su glorioso daño...\nCon amor : the dogger","replies":[]},{"poster":"Bot Murloc","date":"2018-03-13T16:05:18.330+0000","up_votes":1,"down_votes":0,"body":"seee, yo empece a jugar malphite mid y tengo bastantes victorias en contra de midlaners bastante poderosos, como vladimir, talon u orianna. \nobviamente malph full ap\n\npero sacando eso los tanques en general son un chiste a veces en el balance q debe de haber entre daño y resistencia","replies":[]},{"poster":"Rockett6","date":"2018-03-13T11:20:41.003+0000","up_votes":1,"down_votes":1,"body":"Hablale a Garen sobre eso, movilidad absurda con la Q y cd mas corto que la de un chino, mas armadura con la W y te banca 40 millones de tortazos, y con la E tambien mas daño para vo aaaa y la R, te quedan 500 de vida y decile adios a tu vida.\n Balancear tankes? Kappa","replies":[{"poster":"Ch4puLin","date":"2018-03-13T14:33:49.022+0000","up_votes":1,"down_votes":0,"body":"Pero no es tanque","replies":[]}]}]}