{"poster":"Noeł","date":"2015-06-19T13:43:12.272+0000","title":"Suchen noch Mitglieder für Ranked Team (Support ab Gold IV)","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hi, ich und ein Kumpel sind grade dabei ein Ranked Team zu starten. Gesucht wird zurzeit **SUPPORT**. Optimal w&auml;re es wenn sich Leute im Elobereich so ab Gold IV.\r\nFeststehende Lanes:\r\nJungle (BSG Deja Wu): Mains     {{champion:62}} {{champion:421}} {{champion:28}} {{champion:32}} {{champion:20}} \r\nADC (Crypto Sabre) : Mains    {{champion:42}} {{champion:104}} {{champion:222}} {{champion:15}} \r\n\r\nFreue Mich auf eure Anfragen\r\nLG Crypto Sabre","replies":[{"poster":"Tabi","date":"2015-06-19T13:54:40.941+0000","up_votes":1,"down_votes":0,"body":"Ich war erst sehr interessiert als ich euren Thread las und wollte euch schon adden, da ich annahm, dass ihr dann sicherlich auch mind Gold IV seid, oder eben höher. Doch ihr seid ja alle Silber, oder gar Bronze...\nIhr solltet in eurer eigenen Elo suchen und nicht darüber, bzw zumindest dann die Anforderungen für eventuelle Interessenten auf eure Elo setzen.","replies":[{"poster":"Noeł","date":"2015-06-19T13:57:09.744+0000","up_votes":1,"down_votes":0,"body":"Das ist nicht das Ranked Team für das wir einen support suchen... Unsere Mitte und Top sind Platin und mein alter acc ist auch gold V... und unser Jungler ist auch nur kurzzeitig gedroppt","replies":[{"poster":"Tabi","date":"2015-06-19T14:24:33.932+0000","up_votes":1,"down_votes":0,"body":"Selbst wenn dein \"alter\" Account Gold V ist, warum sucht ihr dann ab Gold IV? Man droppt nicht ohne Grund (auf deinen jungler bezogen) Aber wie dem auch sei. Ich mag es nicht, wenn man sich selbst als besser einschätzt. Trotzdem wünsche ich euch viel Spaß und vor allem Erfolg bei der Suche.","replies":[{"poster":"Noeł","date":"2015-06-19T15:17:47.290+0000","up_votes":1,"down_votes":0,"body":"weil wir auch gold v nehmen würden... aber wenn man gold v schreibt schreiebn einen auch silber an... außerdem haben wir uns geeignigt das man ab gold iv schreibt.. und die team elo (von solo que her) liegt auch über gold iv","replies":[]}]}]}]}]}