{"poster":"Maudìt","date":"2016-10-08T13:32:37.356+0000","title":"Problema ping quando sono su LOL","subforum":"Aiuto e supporto","up_votes":1,"down_votes":0,"body":"Salve ragazzi, vorrei una mano su un problema che onestamente non so proprio come risolvere, in pratica quando loggo su LOL non sempre ma spesso mi aumenta il ping, a volte fa solo delle &quot;impennate&quot; e poi torna normale, altre come oggi appena loggo il ping va dai 600 ai 3000 finch&egrave; non chiudo LOL...\r\n\r\nLa cosa strana &egrave; che se io loggo su LOL aumenta vertiginosamente il ping anche a mio fratello che gioca su un altro PC, se chiudo LOL a lui il ping torna normale sui 65 ms.\r\n\r\nQualcuno di voi ci capisce qualcosa e sa darmi una mano?","replies":[{"poster":"Chroniicles","date":"2016-10-08T16:41:04.142+0000","up_votes":1,"down_votes":0,"body":"Quello che dice junko è essenzialmente vero. Però il più delle volte si tratta di aggiornamenti automatici del sistema che vengono messi a scaricare e che purtroppo impattano negativamente sul gioco.\nInfatti se vai a guardare i dettagli di quel gruppo di processi, probabilmente sarà Windows update a saturare la banda.\nPurtroppo con win 10 l'unica strada percorribile è impostare la propria connessione come \"a consumo\", perché disabilitare gli aggiornamenti potrebbe causarti problemi poi in altri ambiti","replies":[]},{"poster":"JunkoHermanBrood","date":"2016-10-08T14:29:04.962+0000","up_votes":1,"down_votes":0,"body":"Mi correggo svchost.net non è un virus ma sono dei processi di windows, però talvolta questi processi possono essere attaccati da virus che li fanno funzionare in maniera anomala.\n\n{{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"JunkoHermanBrood","date":"2016-10-08T13:52:22.483+0000","up_votes":1,"down_votes":0,"body":"Ciao Maudit, ho avuto anche io un problema simile!\nGiocate entrambi utilizzando la stessa connessione?\nUtilizzi Windows 10?\nIn ogni caso ti consiglio di fare così:\n\nCrea una Partita personalizzata affinchè tu possa fare alcuni test senza compromettere le partite.\n\n* Apri la Gestione Attività / Vai su Prestazioni\n* In basso vedrai una sorta di ContaKilometri/ Clicca la voce APRI MONITORAGGIO RISORSE\n* Troverai 4 voci ( Panoramica, CPU, Memoria,Disco, \"RETE\"\n* Clicca su rete, e controlla se c'è aperto un processo che sta consumando Banda in maniera anomala.\nTe ne accorgerai dal numero, se il numero è molto alto vuol dire che c'è qualche processo che sta utilizzando molta Linea.\n\nPer esempio io avevo un processo che si chiamava \"svchost.net\" che mi consumava molta Banda Internet e succedeva esattamente quello che succede a te.\nAvvolte il processo si apriva anche quando lo chiudevo alla fine ho ripristinato il PC.\nPerchè leggendo in svariati Forum sono arrivato a conclusione che fosse un virus, ho ripristinato il sistema perché il mio pc è nuovo e non avevo molti dati. \nSe per te fare il ripristino potrebbe essere una soluzione troppo drastica, ti consiglio di guardare su qualche Forum per mettere in quarantena il Virus se si dovesse trattare di virus.\n\nSpero di esserti stato d'aiuto, un saluto da JunkoHermanBrood{{item:3649}}","replies":[]}]}