{"poster":"Meeko","date":"2019-06-06T20:34:51.120+0000","title":"Orianna S S+ elérése. Hogyan?","up_votes":1,"down_votes":0,"body":"Sziasztok.\r\nKérlek titeket hogy részletes tippeket adjatok hogyan tudok miden {{champion:61}} val S S+ elérni?\r\nElőre is köszönöm a tippeket és tanácsokat! {{summoner:4}} {{summoner:14}}","replies":[{"poster":"Afelers","date":"2019-06-06T22:16:09.227+0000","title":null,"up_votes":2,"down_votes":0,"body":"Kb. ugyanaz mint mindenki mással: legyen jó farmod és legyen minél több kiosztott sebzésed. Orinak a Q-ja jó arra az esetre ha éppen nem tudsz aa-t használni, ezzel könnyebb tartani a 10 cs/min arányt. A többi csak folyamatos poke.\n(Ezért nem tetszik nekem ez a rendszer leginkább, de) ha értékelésre játszol, sokat segít, ha late-ben elkezded vinni a jungle campeket.","replies":[{"poster":"Gresident","date":"2019-06-07T10:05:26.736+0000","title":null,"up_votes":1,"down_votes":0,"body":"Az op.gg sem jobb, sokszor a csapat legszarabbja kapja a legnagyobb op pontot.","replies":[{"poster":"Afelers","date":"2019-06-07T12:15:30.031+0000","title":null,"up_votes":1,"down_votes":0,"body":"Az OP Score más, de szerintem inkább érdemel magasabb pontszámot az, aki többet wardol vagy inkább az objektívákra megy ahelyett hogy ész nélkül killekre/jó statra játszik. A LoL-ban kapott rang javarészt csak farmról és sebzésről szól, csomószor kapják olyanok az S-t, akiknek valóban volt sok sebzése, csak éppen a teamfightokból direkt kimaradtak, nehogy meghaljanak, ezzel hagyva veszni a csapatot.","replies":[{"poster":"kiskeni","date":"2019-06-09T09:12:36.199+0000","title":null,"up_votes":1,"down_votes":0,"body":"Miért, a másik véglet jobb? Fed és felismeri nagy hirtelen, hogy Ő az új Rambo (azt már forgatja is újra a filmet és egyéb butaságok) :D\nNem igazán van átmenet, optimális helyzet meg még ritkább. Mondjuk nem tudom, ha én fed vagyok, akkor törekszek arra, hogy oszoljon az arany a csapatban, illetve megyek is mint az őrült és remélem, hogy követnek. Előbbit fed-ként már nagyon nehéz elérni, mert lehelsz egyet és elporladt valaki, míg a csapattársaid lenyomnak egy full bányaműszakot, mire egyáltalán félhp-znak valakit :D Márpedig ugye az nem jó, ha csak egy csapattárson koncentrálódik a csapat összes előnye. A megyek mint őrült része pedig teljesíthető, ekkora már felismerik, hogy engem érdemes követni (remélhetőleg).","replies":[]}]}]},{"poster":"Meeko","date":"2019-06-07T08:39:34.645+0000","title":null,"up_votes":1,"down_votes":0,"body":"Köszi a segítséget.","replies":[]}]},{"poster":"kiskeni","date":"2019-06-09T09:15:45.921+0000","title":null,"up_votes":1,"down_votes":0,"body":"Te neked a megoldást egy szó jelenti: offrole. Vidd olyan lane-re azt a hőst, ahol a kutya sem játssza. Mivel a rendszernek így nem lesz viszonyítási alapja más játékosok teljesítményéhez képest, vagy jóval kevesebb játékost fog nézni, azok többsége is javarészt rosszul teljesített adott offrole-ban, ezért neked elég lehet akár egy közepes szinten is játszanod Orianna-t az S/S+ osztályzatért. Sokszor próbáltam ezt, mindig bevált.","replies":[]},{"poster":"ScreamForMeBaby","date":"2019-06-07T16:05:42.309+0000","title":null,"up_votes":1,"down_votes":0,"body":"Minél több farm, minél több kill. Ennyi a titok. Esetleg javallott premadeben bohóckodni, mert ha supp role-on mész és a társad az adc, akkor lehet trükközni. Bár gondolom ezt is ismeri már mindenki ennyi év után.","replies":[]}]}