{"poster":"d00mface","date":"2019-04-04T22:01:41.347+0000","title":"Thank you, Riot, for wharf rats!","subforum":"Story, Art, & Sound","up_votes":10,"down_votes":0,"body":"I'm relatively new to the game and never had a chance to play on the Bilgewater map before now, nor see the wharf rats in person, and I'm so glad I get the opportunity to now! \r\n\r\nI know in lore they're supposed to be bigger and scarier, but in game I just wanna squish their little cheeks. I love their designs; they look so dumb its cute. I'd love some merch with their cute dumb faces on it, or maybe plushies? Both?\r\n\r\nAlso, do you think wharf rats and poros would get along if they met? Would they fight? Would they share snax?","replies":[{"poster":"Carnival Knights","date":"2019-04-05T23:11:20.705+0000","up_votes":7,"down_votes":0,"body":"Considering the wharf rat diet (as I understand it) includes (but is not limited to) garbage, plant matter, insects, fish, amphibians, birds, small mammals, medium mammals, large mammals, rotten meat, fresh meat, dead bodies, alive bodies, and occasionally other wharf rats, it's likely that wharf rats and poros wouldn't get along.\n\nYou could try putting them together, though. \n\nMight be fun.","replies":[{"poster":"Terozu","date":"2019-04-06T01:21:25.706+0000","up_votes":4,"down_votes":0,"body":"I like to think nothing could legitimately prey on a poro due to how adorable they are.","replies":[]},{"poster":"d00mface","date":"2019-04-06T07:44:04.512+0000","up_votes":2,"down_votes":0,"body":"{{sticker:sg-janna}}","replies":[]},{"poster":"ZaneShadow","date":"2019-04-06T23:57:50.618+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Carnival Knights,realm=NA,application-id=6kFXY1kR,discussion-id=OxoqGUii,comment-id=0004,timestamp=2019-04-05T23:11:20.705+0000)\n>\n> Considering the wharf rat diet (as I understand it) includes (but is not limited to) garbage, plant matter, insects, fish, amphibians, birds, small mammals, medium mammals, large mammals, rotten meat, fresh meat, dead bodies, alive bodies, and occasionally other wharf rats, it's likely that wharf rats and poros wouldn't get along.\n> \n> You could try putting them together, though. \n> \n> Might be fun.\n\nPerhaps... for the poro.\n\nhttps://nexus.leagueoflegends.com/en-us/2017/09/ask-riot-honor-capsules-pls/","replies":[]}]},{"poster":"Ebonmaw Dragon","date":"2019-04-05T05:35:48.419+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=d00mface,realm=EUW,application-id=6kFXY1kR,discussion-id=OxoqGUii,comment-id=,timestamp=2019-04-04T22:01:41.347+0000)\n>\n> Also, do you think wharf rats and poros would get along if they met? Would they fight? Would they share snax?\n\nI think that the poros would become the new snax.","replies":[{"poster":"NotaRobot1006","date":"2019-04-05T06:09:30.154+0000","up_votes":3,"down_votes":0,"body":"Nonsense, the poros would overwhelm the wharf rats with the power of snuggles. The goodness that poros naturally radiate would be so profound, so intense that it would transform the wharf rats into Bilgewater Poros.\n\nThey still look exactly the same, they just act like poros now.","replies":[{"poster":"Chembaron Yamada","date":"2019-04-05T16:04:21.978+0000","up_votes":3,"down_votes":0,"body":">As you slip the squishy, pastel meat into your mouth, your mind floods with every imaginable color: magenta, indigo, seafoam, chartreuse! With each juicy gnash of your teeth, a different flavor overwhelms your palate: cotton candy, chokecherry, salted sea bass, toasted coconut! You swallow the tender morsel and your throat tickles as it slides down your gullet. You get the feeling like you have to sneeze, but can’t. As you pinch another bite from the plate, eager in anticipation of all the colors and flavors it will unlock, you feel a tiny itch ripple in your stomach. You can’t help but cough—a little at first, then A LOT. Sprays of fluff and fur erupt from your mouth like confetti. The itch in your stomach grows into a sharp, stabbing pain, like something tiny is trying to beat down the door of your innards with fists made of knives. Your guts swell and stretch as you cry out to your gods for mercy, for death, for anything that could bring an end to the blinding pain. Through your tears, you watch as two pointed horns rip through your skin’s membrane, thrashing and mighty like a bull through a matador’s cape. A basketball-shaped creature struts from your gaping stomach, slick and sticky with your blood, then plumes its fur in one swift PUFF. Blood splatters across your face. Your shaking eyes finally behold the creature in all its splendor—standing soft and sweet as a sunlit dandelion atop your retching, soon-to-be corpse. It unfurls its big pink tongue and licks your pallid cheek. That’s the last thing you see.\n\n>Or so the story goes. So yeah, not a lot of people try it anymore.\n\nThis was the answer when Riot got asked if people are eating poros.\nLet's all pray for the wharf rats to never try eating them.","replies":[]}]}]},{"poster":"NotaRobot1006","date":"2019-04-05T00:12:45.929+0000","up_votes":3,"down_votes":0,"body":"They're just so cute!","replies":[]},{"poster":"Terozu","date":"2019-04-05T14:03:19.931+0000","up_votes":2,"down_votes":0,"body":"I think that when a Bilge water champ is played their team should have a Wharf Rat in their base, since Freljordiam champs get a poro.","replies":[]}]}