{"poster":"AuroraExecution","date":"2015-12-10T15:54:10.887+0000","title":"Consejos para pelear contra yasuo","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"Buenas, como andan? Ultimamente me estoy cruzando con varios yasuos, y a pesar de haberle jugado muchas veces, todavia no le puedo encontrar la vuelta y la gran mayoria de las veces pierdo la linea. Los champs que acostumbro a usar son azir, ahri, talon. Que me recomiendan contra ese champ?","replies":[{"poster":"Platinum491","date":"2015-12-10T18:38:52.554+0000","up_votes":1,"down_votes":0,"body":"Quitale el escudo a basicos y Yasuo tiene las defensas de un ADC sin este, burstealo pues su fuerte son los trades de 3 segundos en adelante, hazle tu daño en menos tiempo que ese y luego retrocede inmediatamente (Como lo harias contra Cassy), con Talon pre6 juega algo pasivo quitandole el escudo cuando puedas, a nivel 2 sube la Q y si te intenta tradear el pegas un basico, caminas hasta que se le quite el shield, tiras WQ y perfectamente se le fue mas vida de la que se te fue a ti, Post 6 espera a que tenga el tornado y apenas lo gaste tira la E y el combo, Si no muere quedara con una cantidad de vida muy baja y se quedara sin ulti y la Q a nivel bajo tiene un cd que si bien no es muy largo es considerable para ganar un trade\n\n{{champion:112}} ¡Únete a la evolución!","replies":[]},{"poster":"Apollyne","date":"2015-12-10T16:45:08.303+0000","up_votes":1,"down_votes":0,"body":"Mantene distancia y farmea, no trates de tradearle (Salvo que veas que es horrible, siempre los hay)\nUna buena idea es tener campeones con habilidades para defenderte y  farmear desde lejos, como por ejemplo:\n{{champion:61}} {{champion:99}} {{champion:127}} {{champion:103}} {{champion:245}}","replies":[]},{"poster":"alop55555","date":"2015-12-10T16:40:50.157+0000","up_votes":1,"down_votes":0,"body":"si yasuo te pushea linea a full llama inmediatamente a tu jg para obligarlo a retroceder para que no pierdas farm ni recibas daño por ese push","replies":[]},{"poster":"Whitesse","date":"2015-12-10T16:38:26.759+0000","up_votes":1,"down_votes":0,"body":"La manera de hacerle counter es banearlo, kappa","replies":[]},{"poster":"DayronDrakend","date":"2015-12-10T16:16:17.963+0000","up_votes":1,"down_votes":0,"body":"Quita su escudo a básicos, esperas que gaste el muro,  luego le das con todo, mantén distancia obviamente.","replies":[]},{"poster":"Z5 Lexhus","date":"2015-12-10T15:59:29.740+0000","up_votes":1,"down_votes":0,"body":"Lleva extenuar, intenta mantener la distancia con el y cuando ultee intenta alejarte porque es ahi cuando comienza a verse los criticos","replies":[]}]}