{"poster":"21021996","date":"2019-07-06T13:00:29.676+0000","title":"Garchis in extremis: caída de FPS constante en una PC de calidad","subforum":"Problemas Técnicos","up_votes":6,"down_votes":0,"body":"Buenas, hace como dos eses vengo teniendo serias caídas de FPS en momentos random de la partida, generalmente cuando hay una team-fight o cuando peleo contra un enemigo. Pensé que habria sido un mal parche y o iban a arreglar, pero siguen sacando parches y esto no se soluciona.\r\n\r\nMi especificaciones son buenas:\r\n\r\n*** i7 7700HQ\r\n* 16GB RAM \r\n* GTX 1060 6GB\r\n**\r\n\r\nYa intente de todo:\r\n\r\n1. Reinstalé el LoL\r\n2. Reinicie la PC\r\n3. Actualicé y reinstalé el driver de gráfica\r\n4. Baje los gráficos al mínimo\r\n\r\nPero no deja de suceder. Estoy jugando a 120FPS constantes y de repente baja a 6, 7 FPS, si tengo suerte a 12FPS. Resulta super incomodo y tilteante, ya que no es algo que pasa una vez por partida, si no una vez cada 1 minuto o menos.\r\n\r\nNecesito saber que hacer antes de volverme loco.\r\n\r\nGracias.","replies":[{"poster":"LastWarriorZ","date":"2019-07-06T15:09:34.865+0000","up_votes":3,"down_votes":0,"body":"Hola! Asegurate de tener el juego en modo pantalla completa, y de tenerlo bloqueado a 60fps. También podes probar ejecutarlo como administrador o desactivando el antivirus, quién sabe. Y por último, si estás jugando en una notebook o cualquier portátil podes probar cambiar las configuraciones de energía, ponerlo en máximo rendimiento y mantenerlo enchufado a la corriente. Si nada de esto lo soluciona y como decís ya lo reinstalaste y actualizaste drivers, quizás tengas que reinstalar windows o alguno de tus componentes esté dañado. Ah, también deberías descargar crystaldisk para chequear el estado de tu disco duro, por las dudas nomás.","replies":[]},{"poster":"AleBostero12","date":"2019-10-08T05:32:43.989+0000","up_votes":1,"down_votes":0,"body":"hola maestro, pudiste solucionar el tema? ando con el mismo problemita.","replies":[{"poster":"21021996","date":"2019-10-27T14:16:44.132+0000","up_votes":1,"down_votes":0,"body":"Si, instalé ThrottleStop e hice undervolt a mi CPU y grafica, ya que recalentaba y jodia los FPS","replies":[]}]}]}