{"poster":"Freyah","date":"2016-05-03T04:36:50.329+0000","title":"I don't even know if I'm allowed to post this, shit","subforum":"Miscellaneous","up_votes":0,"down_votes":2,"body":"Anyone up for a trade in a sense\r\nLooking for someone that&#039;s willing to buy me Yasuo for one of my Steam accounts, we can discuss it further if you&#039;d like\r\nAdd moi gents- DayTorax\r\n\r\nRiot pls no ban if I&#039;m not allowed to post this, I didn&#039;t know. :(","replies":[{"poster":"Tele","date":"2016-05-03T05:19:30.235+0000","up_votes":2,"down_votes":0,"body":"I haven't spoken to a moderator on how this would be interpreted, but it looks dodgy from what we have on the [Universal Rules](http://boards.oce.leagueoflegends.com/en/c/announcements/BjArMH2B-boards-universal-rules):\n\n> _\"If you’re trying to sell a **game account** or service that violates our TOS, please don’t; however, if you absolutely have to try it here, expect that you'll be losing access to the boards and possibly your game account. TL;DR: posts attempting to sell anything will be removed.\"_\n> \n> All depends on whether, _\"game account\" _ refers to only League accounts or other game accounts as well.\n\nPersonally I wouldn't risk it, your post will be taken down anyway because it's trying to sell something. So you might as well take it down now and avoid any trouble.","replies":[]},{"poster":"GigaPube","date":"2016-05-04T08:22:06.422+0000","up_votes":1,"down_votes":0,"body":"riven main who cant quite grasp animation cancelling by any chance?","replies":[]},{"poster":"Olee","date":"2016-05-03T06:06:42.134+0000","up_votes":1,"down_votes":0,"body":"A) You don't want Yasuo, everyone in this server will know to hate you\nB) I'm kidding and it's totally up to you who you want\nC) Well, I'm kind of kidding.... I'll definitely come to hate you\nD) It's really really not that hard to grind it out man. Make sure to snatch up all your daily IP bonuses and play lots, if you REALLY wanted to just grind, try playing Co-op bots.","replies":[]}]}