{"poster":"PhoenixEmerald","date":"2017-09-16T15:15:39.307+0000","title":"Origini, la nascita delle Regioni e dei Campioni di Valoran - Ionia - Irelia, Jhin e Karma","subforum":"Creazioni della community","up_votes":5,"down_votes":3,"body":"Eccomi di nuovo qui con il secondo post! ^^\n\nChiedo scusa se spezzo cos&igrave; il thread sulle Origini dei Campioni di Ionia, ma mi sono accorta di un _piccolo_ dettaglio: il formato dei commenti ha un limite di lunghezza! D: Non riuscivo, pertanto, a postare in un unico commento le origini di Irelia, Jhin e Karma... Ho deciso di fare cos&igrave;, creer&ograve; una serie di thread per ogni regione, specificando nel titolo di quali Campioni tratter&ograve; l&#039;origine in quella specifica discussione, spero che cos&igrave; possa essere un attimo pi&ugrave; equilibrato! :)\n\nIntanto, qui riporto il link al thread precedente dove ho parlato di: [IONIA, AHRI e AKALI](https://boards.euw.leagueoflegends.com/it/c/creazioni-della-community-it/AzXvkGtX-origini-la-nascita-delle-regioni-e-dei-campioni-di-valoran-ionia).\n\nE siccome non l&#039;avevo gi&agrave; fatto, linko anche le loro pagine Universo, in modo che sia pi&ugrave; facile raggiungerle: [Ionia](http://universe.leagueoflegends.com/it_IT/region/ionia/), [Ahri](http://universe.leagueoflegends.com/it_IT/champion/ahri/), [Akali](http://universe.leagueoflegends.com/it_IT/champion/akali/). \n\nBene, proseguiamo! ^^\n\n{{champion:39}} [**Irelia - Il Volere delle Lame**](http://universe.leagueoflegends.com/it_IT/champion/irelia/) {{champion:39}}\n\n**Etimologia nome** \n\nIrelia &egrave; un nome di cui, purtroppo, non ho trovato un&rsquo;origine certa o precisa! :&rsquo;( Tuttavia non mi sono arresa ed ho scoperto l&rsquo;esistenza di un nome inglese molto simile, ossia [Irelee](http://www.thinkbabynames.com/meaning/0/Irelee). Questo nome deriva da una pronuncia alternativa del nome [Aurelia](https://it.wikipedia.org/wiki/Aurelia_(nome)) di origine latina ed a sua volta proveniente dal nome [Aurelio](https://it.wikipedia.org/wiki/Aurelio). L&rsquo;origine di quest&rsquo;ultimo &egrave; stata spesso considerata legata al nome romano &ldquo;Aurelius&rdquo; portato dalla &ldquo;Gens Aurelia&rdquo;, il quale &egrave; collegato ai termini latini &ldquo;aurum&rdquo; (oro) ed &ldquo;aureus&rdquo; (dorato). Sotto quest&rsquo;aspetto, il significato del nome Aurelio/a si accosta principalmente con la lucentezza dorata delle lame di Irelia, nonch&eacute; con lo scintillio di alcune sue abilit&agrave;, anche se la connessione &egrave; piuttosto irrisoria. Per&ograve; alcune fonti affermano come questa etimologia non sia veritiera: il nome Aurelio dovrebbe derivare da un diminutivo di &ldquo;auris&rdquo; (orecchia, pertanto &ldquo;dalle piccole orecchie&rdquo;) oppure da &ldquo;Auselius&rdquo;, una latinizzazione del nome del Dio sabino del sole &ldquo;Ausel&rdquo;. Irelia potrebbe avvicinarsi pi&ugrave; a quest&rsquo;ultimo significato in quanto, come il sole, risorge dall&rsquo;oscurit&agrave; della morte grazie all&rsquo;intervento di Soraka tramite cui pu&ograve; continuare la sua battaglia contro i soldati noxiani. Non credo possa fare riferimento a [Marco Aurelio](https://it.wikipedia.org/wiki/Marco_Aurelio) (Imperatore di Roma) n&eacute; ad [Aurelia Cotta](https://it.wikipedia.org/wiki/Aurelia_Cotta) (madre di Giulio Cesare), in quanto le vicende dei due personaggi storici si discostano moltissimo da Irelia, per quel poco che ancora sappiamo di lei tramite la sua lore non ancora rivisitata.\n\n**Ispirazione Campione**\n\nIrelia &egrave; un Campione che trae la propria ispirazione sia dalla figura del [Lich](https://it.wikipedia.org/wiki/Lich), sia da quella del [samurai](https://it.wikipedia.org/wiki/Samurai), due personaggi appartenenti a culture differenti. Il Lich pare forse la connessione pi&ugrave; azzardata delle due, essendo un tipo di creatura non-morta solitamente legata ad un immaginario decisamente pi&ugrave; negativo di quello che, invece, Irelia rappresenta con la sua determinazione per proteggere Ionia dall&rsquo;invasione di Noxus. Tuttavia il riferimento si trova nelle caratteristiche del Lich e non tanto nell&rsquo;aspetto (perch&eacute; i Lich sono spesso tratteggiati come creature praticamente scheletriche): quest&rsquo;essere &egrave; solitamente qualcuno che voglia ottenere una parvenza di vita eterna e pertanto lega la propria anima ad un oggetto particolare, trasformandolo nel suo filatterio. Se questo venisse distrutto per il Lich verrebbe la morte vera e propria. \n\nQuesti aspetti s&rsquo;intrecciano abbastanza con la sorte di Irelia, decisa dalla scelta di Soraka di salvare la sua vita legandola al mondo terreno e dal fortissimo desiderio della Campionessa di restare accanto alla sua patria. L&rsquo;unione di queste due volont&agrave; permette ad Irelia non solo di rialzarsi dopo essere stata colpita dalla potente maledizione di un negromante, ma trasforma la spada del padre in un vettore tramite cui si manifesta il suo &ldquo;volere&rdquo;, appunto: la lama si muove autonomamente seguendo i desideri di Irelia. Un &ldquo;filatterio&rdquo; piuttosto intraprendente, a cui potrebbe essere legata la fortuna o la sfortuna di Irelia: se il collegamento fosse effettivamente lo stesso che vi &egrave; fra il Lich ed il filatterio, allora dovrebbe stare ben attenta al fatto che nessuno distrugga la lama, per evitare una prematura dipartita (anche se, tecnicamente, dovrebbe gi&agrave; essere una non-morta)! :&rsquo;(\n\nQuesta connessione con il Lich si amalgama con quella pi&ugrave; preponderante del guerriero samurai, anche se molti aspetti fanno riferimento ad una versione romanzata di quest&rsquo;ultimo. Infatti, la W di Irelia si chiama &ldquo;Stile di Hiten&rdquo; e l&rsquo;ultima parola pu&ograve; riferirsi ad una cosa in particolare: allo stile [Hiten Mitsurugi-ryū](http://kenshin.wikia.com/wiki/Hiten_Mitsurugi-ry%C5%AB), una tecnica di spada fittizia derivante dal manga Rorouni Kenshin, proprio perch&eacute; entrambi i personaggi utilizzano abilit&agrave; simili. Infatti, lo stile Hiten Mitsurugi-ryū &egrave; stato sviluppato per far s&igrave; che un samurai potesse sconfiggere da solo molti nemici, un fine da cui sembra prendere spunto la passiva di Irelia: diminuisce tantissimo l&rsquo;efficacia dei crowd control se si trova ad affrontare da sola molti nemici. Basato sulla tecnica realmente esistente dell&rsquo;&rdquo;ichi no tachi&rdquo; (non c&rsquo;&egrave; origine certa, alcuni la fanno risalire all&rsquo;arte marziale fondata da [Matsumoto Bizen-no-kami Masanobu](https://en.wikipedia.org/wiki/Matsumoto_Masanobu)), la quale prevede che il samurai si muova nel raggio d&rsquo;azione della spada avversaria permettendogli di colpire, ma scagliando un contrattacco al primo movimento offensivo. Una tecnica il cui punto di forza &egrave; senz&rsquo;altro il tempismo nel colpire il nemico prima che egli possa effettivamente porre in essere la propria strategia. Da questo punto di vista, quest&rsquo;arte si avvicina alla E di Irelia con cui lei pu&ograve; applicare uno stun od uno slow prima che l&rsquo;avversario possa attaccarla, se il suo evocatore dimostrer&agrave; un buon tempismo! :D\n\nLo stile dell&rsquo;Hiten Mitsurugi-ryū, inoltre, richiede per i praticanti un&rsquo;incredibile dose di velocit&agrave; ed agilit&agrave; quasi invisibili all&rsquo;occhio umano; Irelia le dimostra molto bene con la sua Q, saltando da un minion all&rsquo;altro e procurando lievi attacchi di cuore ai giocatori avversari, impreparati al peggio! :P Insomma, se la caratteristica principale di questo stile fittizio &egrave; la capacit&agrave; di effettuare manovre offensive e difensive attraverso movimenti minimi, per permettere al praticante di conservare al massimo l&rsquo;energia ottimizzando il contrattacco, allora Irelia sarebbe in grado di competere perfino con Rorouni Kenshin! ;) Ma c&rsquo;&egrave; un altro dettaglio tramite cui Irelia e Kenshin sono accomunati, seppur casuale: nell&rsquo;universo di Rorouni Kenshin, la tecnica dell&rsquo;Hiten Mitsurugi-ryū &egrave; solitamente conosciuta da sole due persone, ossia il maestro e l&rsquo;allievo che l&rsquo;apprender&agrave;; Irelia e suo fratello Zelos sono gli unici ad essere a conoscenza dei segreti dello stile del padre, morto inaspettatamente! Coincidenze?! S&igrave;, molto probabilmente, ma questo non fermer&agrave; la mia natura complottistica! :O :P Altro piccolo dettaglio interessante: nell&rsquo;animazione in cui muore la spada di Irelia le trafigge il ventre, un chiaro riferimento al seppuku, il suicidio considerato onorevole dai samurai. \n\nDal punto di vista dell&rsquo;aspetto fisico, l&rsquo;armatura di Irelia sembra ispirata alle [armature giapponesi](https://it.wikipedia.org/wiki/Armatura_giapponese#/media/File:Japanese_Armour_Diagram_by_Wendelin_Boeheim.jpg), soprattutto a quella classica del samurai. Non ne sono sicura, ma Irelia sembra una Campionessa decisamente collegata con la cultura giapponese sotto molti aspetti, pertanto ritengo che questo riferimento sia corretto! Per quanto riguarda l&rsquo;aspetto estetico, Irelia potrebbe rievocare la bellezza delle [Tennyo](https://it.wikipedia.org/wiki/Tennin), spiritelli della mitologia giapponese spesso considerati analoghi ai nostri angeli e di cui il termine Hiten rappresenta un nome alternativo.\n\n**Relazioni**\n\nIrelia ha una relazione accertata all&rsquo;interno della sua biografia, ovvero quella con Soraka. Quest&rsquo;ultima, infatti, ha salvato la vita di Irelia dalla potente maledizione di un negromante, per&ograve; non si sa se questo collegamento potrebbe resistere ad una rivisitazione della lore della Campionessa. Per quanto concerne Karma non c&rsquo;&egrave; un collegamento accertato in modo chiaro, ma entrambe le Campionesse sono due grandi condottiere di Ionia che hanno sulla schiena il &ldquo;Mantello del Decoro&rdquo;: un simbolo che solo i pi&ugrave; valorosi ioniani possono ricevere. Questo fatto lascerebbe supporre che Irelia e Karma si siano incontrate per questo motivo, forse stringendo amicizia grazie al loro obiettivo comune di salvare Ionia dall&rsquo;invasione di Noxus. Per quanto riguarda Singed, nella lore non rivisitata, &egrave; stato responsabile dell&rsquo;attacco batteriologico al villaggio natio di Master Yi il quale ha ucciso praticamente tutti gli abitanti; Irelia potrebbe aver assistito a questo fatto orribile o potrebbe aver giurato di vendicare le vittime, purtroppo non &egrave; dato saperlo con certezza. Per Syndra&hellip; Be&rsquo;, vuole uccidere i &ldquo;patetici leader di Ionia&rdquo;, credo che Irelia l&rsquo;abbia presa un po&rsquo; sul personale, ma giusto un po&rsquo;! :P\n\n{{champion:202}} [**Jhin - Il Virtuoso**](http://universe.leagueoflegends.com/it_IT/champion/jhin/) {{champion:202}}\n\n**Etimologia nome** \n\nJhin deriva dal termine mandarino &ldquo;jin&rdquo; che vuol dire &ldquo;oro&rdquo;, da qui l&rsquo;epiteto con cui viene chiamato da Shen e Zed, ossia &ldquo;Demone Dorato&rdquo;. Tuttavia potrebbe fare un ulteriore riferimento ai [Jinn](https://it.wikipedia.org/wiki/Jinn), i famosi geni della cultura araba che possono essere creature maligne, benigne o neutralmente benevole; la radice semitica del loro nome deriva dalle parole &ldquo;nascondere&rdquo; (alcuni interpretano pi&ugrave; letteralmente in: &ldquo;creature che sono celate alla percezione&rdquo;), &ldquo;pazzo&rdquo;, &ldquo;giardino&rdquo; ed &ldquo;embrione&rdquo;. Tutti questi riferimenti semitici possono legarsi tranquillamente al personaggio di Jhin: un umano molto pi&ugrave; vicino ad un essere soprannaturale dalla natura maligna per via della sua follia, la cui identit&agrave; &egrave; celata da una maschera e che vorrebbe rendere le sue vittime &ldquo;perfette&rdquo; lasciando che dai loro corpi sboccino rose, fiori ed altre amenit&agrave;. Gee, what an ass! :P \n\nPer quanto riguarda il nome Khada, questa parola potrebbe fare riferimento a diverse cose: al [Khata](https://en.wikipedia.org/wiki/Khata), una sciarpa cerimoniale nella cultura del Buddismo Tibetano e del Tengrismo, considerata simbolo di purezza e compassione ed indossata solitamente durante eventi cerimoniali quali nascite, matrimoni, funerali, diplomi ed arrivo o partenza degli ospiti; i Khata possono essere sia di colore bianco, sempre segno di purezza del cuore, sia di colore giallo oro ed i Khata buddisti, tibetani e nepalesi presentano, inoltre,  un [Ashtamangala](https://en.wikipedia.org/wiki/Ashtamangala) (sono otto segni di buon auspicio in molte religioni indiane). Il collegamento potrebbe esserci nel mantello bianco che Jhin indossa sempre, come se partecipasse costantemente ad un funerale (che &egrave; ben lieto di causare! :P). Un ulteriore riferimento potrebbe esserci con uno degli Ashtamangala, ossia il fiore di loto, simbolo della purit&agrave; primordiale del corpo, della parola e della mente la quale fluttua sopra le acque torbide dell&rsquo;attaccamento e del desiderio; in aggiunta, simboleggia anche la rinuncia o l&rsquo;abbandono ed i &ldquo;loti interni del corpo&rdquo;, ossia i centri d&rsquo;energia (chackra). Insomma, siccome Jhin ama tanto far sbocciare fiori sopra le sue vittime, sollevandole dalla loro esistenza imperfetta per purificarle, colpendole in punti ben precisi quasi mirasse a dei particolari &ldquo;centri&rdquo; d&rsquo;energia (com&rsquo;&egrave; accaduto a Zed, Sona, Garen e Vi durante il periodo di promo), direi che il collegamento tanto azzardato non &egrave;! :D\n\nNella lingua hindi, in pi&ugrave;, esiste il termine &ldquo;KhaDaa&rdquo;, il quale pu&ograve; voler dire diverse cose, tuttavia credo che la parola la quale si avvicini di pi&ugrave; a Jhin sia &ldquo;Khadan&rdquo;: quest&rsquo;ultima si pu&ograve; tradurre in inglese in &ldquo;quarry&rdquo; che nella terminologia della caccia pu&ograve; voler dire &ldquo;preda&rdquo; o &ldquo;bottino di caccia&rdquo;; oppure a livello figurato pu&ograve; significare &ldquo;bersaglio&rdquo;. Queste spiegazioni possono riferirsi, ovviamente, al fatto che Jhin sia ormai un sicario mandato a &ldquo;caccia&rdquo; dei bersagli scelti dalla congrega che lo ha liberato dalla prigionia.\n\nSanto cielo, altro che &ldquo;[small name, big ego](http://tvtropes.org/pmwiki/pmwiki.php/Main/SmallNameBigEgo)&rdquo;, qui siamo sul &ldquo;big name, big ego&rdquo;! :P E preparatevi lettori: siccome Jhin &egrave; uno dei pi&ugrave; recenti campioni usciti, la Riot ha fornito un SACCO di informazioni sulla sua creazione. Aspettatevi un papiro lungo ottocentomila chilometri! :O\n\n**Ispirazione Campione**\n\nPrima, per&ograve;, entriamo nel mood con un [grande classico](https://www.youtube.com/watch?v=LdLQf1Ef9Ns)! :P\n\n_&ldquo;Ogni pistola ha la sua voce e questa la conosco&rdquo;._\n\nDai ragazzi, Jhin trasuda italianit&agrave; da tutti i pori e per fortuna! :P Mi riferisco in particolare ai riferimenti agli spaghetti western, al Carnevale di Venezia ed all&rsquo;opera italiana. S&igrave; &egrave; vero, Jhin trae parziale ispirazione anche dal personaggio storico di [Simo H&auml;yh&auml;](https://it.wikipedia.org/wiki/Simo_H%C3%A4yh%C3%A4), un cecchino finlandese che si dice abbia ucciso almeno 500 persone nel periodo della Guerra d&rsquo;inverno fra la Finlandia e l&rsquo;Unione Sovietica (1939-40). Di questo numero spropositato, almeno 259 vittime furono ammazzate tramite l&rsquo;utilizzo di un fucile da cecchino! Se questa terrificante cifra si accosta alle grandissime abilit&agrave; da cecchino di Jhin (giusto per aumentare lo sconvolgimento, nessuno dei due ha mai usato un&rsquo;ottica telescopica per uccidere i propri bersagli!), non si pu&ograve; dire lo stesso dell&rsquo;atteggiamento o del carattere: Simo ha sempre considerato il suo impressionante lavoro niente pi&ugrave; che un dovere compiuto al meglio, mentre Jhin&hellip; be&rsquo;, diciamo solo che ha una personalit&agrave; molto pi&ugrave; instabile! :P\n\nTuttavia, come rivela la stessa Riot, lo sviluppo di Jhin &egrave; partito dalla base che egli fosse una sottospecie di misterioso robot cowboy che potesse mostrare al meglio le vere abilit&agrave; di un tiratore scelto (la parte robot cowboy &egrave; stata parzialmente tolta e rimodellata nella skin Mezzogiorno di Fuoco). E Jhin si dimostra proprio un letale cecchino come lasciano presagire le sue abilit&agrave; W ed R: la prima diventa improvvisamente pi&ugrave; efficace quando un alleato colpisce un Campione nemico (immobilizzandolo per un po&rsquo;), esattamente come un cecchino ha pi&ugrave; possibilit&agrave; di colpire un bersaglio se un suo alleato lo aiuta a scoprirne la posizione! La seconda si amalgama con il fatto che il cecchino spari i suoi colpi da posizioni protette e lontane dal combattimento, potendo anche mancare il bersaglio come accadrebbe nella vita reale. Insomma, Jhin cerca di prendere spunto da una [figura realistica di cecchino](https://it.wikipedia.org/wiki/Tiratore_scelto), il quale non ha un fuoco rapido ma deve ricaricare con attenzione il proprio fucile, cercando di sprecare meno proiettili possibile (la sua passiva riutilizza molto bene questo concetto).  \n\nPraticamente un tiratore scelto che veste italiano perch&eacute;, si sa, noi sappiamo come apparire eleganti e distinti sempre e comunque! :P Okay, ci sono ancora due dettagli da sottolineare, prima di muoversi verso la parte &ldquo;made in Italy&rdquo;: Jhin pare prendere ispirazione anche dal personaggio di [Erik del Fantasma dell&rsquo;Opera](https://it.wikipedia.org/wiki/Fantasma_dell%27Opera_(personaggio)), ma non tanto perch&eacute; abbia un volto deforme (anzi, da quello che si sa Jhin sarebbe in grado di confondersi tranquillamente con la folla per via del suo aspetto comune), quanto per il concetto: ha comunque una lieve deformit&agrave; costituita dalla gobba ed inoltre &egrave; profondamente legato all&rsquo;opera per via del suo atteggiamento teatrale, della maschera e del titolo &ldquo;Virtuoso&rdquo;. Effettivamente, tutti questi fattori sono collegati indissolubilmente con l&rsquo;opera  teatrale (che, ricordiamo, &egrave; intrinsecamente legata all&rsquo;Italia! :P): la parola [&ldquo;Virtuoso&rdquo;](https://it.wikipedia.org/wiki/Virtuosismo) indica un termine utilizzato negli ambiti artistici per identificare una persona con capacit&agrave; artistiche eccezionali. Nel mondo della musica, si tratta in particolare dell&rsquo;abilit&agrave; di suonare in modo egregio gli strumenti e di cantare in modo eccelso i brani musicali delle opere, sacrificando di molto la capacit&agrave; d&rsquo;interpretazione in favore di una potente bravura tecnica. Questo aspetto si pu&ograve; evincere in Jhin nel momento in cui si considera la sua ricerca della perfezione, attraverso un&rsquo;innegabile abilit&agrave; tecnica nell&rsquo;utilizzo del fucile da cecchino, legata alla brutalit&agrave; delle sue opere, per cos&igrave; dire.\n\nTuttavia, c&rsquo;&egrave; un fattore che amalgama un po&rsquo; tutta la visione artistica di Jhin, ossia la sua passione morbosa per il numero quattro: la musica della sua schermata login gioca attorno a motivi di quattro note, il suo nome ha quattro lettere, quattro Campioni sono stati utilizzati per introdurre il suo personaggio, ecc. Com&rsquo;era sospettabile, questa scelta del numero quattro non &egrave; per nulla campata per aria! :P Infatti, nelle culture orientali questa cifra &egrave; stata sempre associata ad immagini molto negative, solitamente alla morte, a titolo d&rsquo;esempio: il quattro si pronuncia &ldquo;shi&rdquo; in giapponese&hellip; Aspetta un po&rsquo;, dov&rsquo;&egrave; che troviamo la sillaba &ldquo;shi&rdquo; nella cultura giapponese, scritta con un altro kanji? Esattamente, nella parola &ldquo;morte&rdquo;! Ed in un altro nome basilarmente collegato a questo concetto: lo [Shinigami](https://it.wikipedia.org/wiki/Shinigami). Per chi ha mai visto Death Note, questa creatura non rappresenta di certo una novit&agrave;: uno spirito soprannaturale che viene anche trattato come una divinit&agrave;, lo Shinigami solitamente invita gli esseri umani alla morte ed &egrave; solitamente tratteggiato quale un mostro, un aiutante, una creatura delle ombre ed un angelo caduto. Caratteristiche che si avvicinano tantissimo a Jhin ed al suo desiderio di far ascendere le sue vittime procurandogli leggere cause di morte! :P Eh ragazzi miei, la terra &egrave; rotonda e prima o poi si torna sempre al punto di partenza! :P\n\nUn attimo! Non abbiamo ancora parlato delle ultimissime connessioni, ovvero la maschera ed il perch&eacute; abbia citato Sergio Leone, gli ultimi due aspetti collegati alla cultura italiana (ve l&rsquo;avevo detto che sarebbe stato un papiro). Allora, sono assolutamente convinta del fatto che la maschera del buon vecchio Jhin faccia riferimento alle maschere del [Carnevale di Venezia](https://it.wikipedia.org/wiki/Carnevale_di_Venezia) che, a loro volta collegate alle maschere della [Commedia dell&rsquo;arte](https://it.wikipedia.org/wiki/Commedia_dell%27arte). La maschera, all&rsquo;interno dell&rsquo;ambito carnevalesco veneziano, aveva il compito di livellare la nobilt&agrave; con il popolo celando le differenze di ceto sociale per far s&igrave; che si creasse una sorta di uguaglianza almeno durante l&rsquo;evento. Da questo punto di vista Jhin si avvicina a questo concetto per via del fatto che, nella sua biografia, quando viene scoperto chi si celasse dietro l&rsquo;identit&agrave; del Demone Dorato tutti rimasero stupiti nel comprendere che fosse un semplice macchinista, senza una storia particolare alle spalle. Aspetti simpatici legati alle [maschere della Commedia dell&rsquo;arte](https://it.wikipedia.org/wiki/Maschera_(commedia_dell%27arte)): le maschere erano indossate anche dagli addetti ai lavori dei teatri in cui si sarebbero svolte le commedie, proprio come Jhin &egrave; un macchinista del teatro ed usa una maschera molto simile a quella dell&rsquo;arte per nascondere il suo volto; le maschere della Commedia dell&rsquo;arte prendevano spunto dalle maschere del volto del demonio dell&rsquo;iconografia del 1400-1500, proprio come Jhin rappresenta una figura demonica come lascia intendere il soprannome Demone Dorato e la sua natura folle e maligna. Non saprei a quale maschera potrebbe fare riferimento, in particolare.\n\nEd ora passiamo alla parte spaghetti western! :P Okay, teoricamente la skin Mezzogiorno di Fuoco ha molti pi&ugrave; riferimenti ai film di Sergio Leone di quanti ne abbia il Jhin originale, ma si possono cogliere alcuni omaggi anche in lui! :D Innanzitutto, il modo in cui Jhin indossa la sciarpa o mantella assomiglia tantissimo a [come l&rsquo;uomo senza nome dei film di Sergio Leone indossa il caratteristico poncho](http://vignette2.wikia.nocookie.net/dollarstrilogy/images/7/77/ClintEastwood.jpg/revision/latest?cb=20101224231131), mentre nella maschera che Jhin indossa scorgo una certa somiglianza con [Sentenza](http://vignette3.wikia.nocookie.net/dollarstrilogy/images/0/06/Angel_eyes.jpg/revision/latest?cb=20110330092209) (o Angel eyes, nella versione d&rsquo;oltreoceano), il cattivo de &ldquo;Il Buono, il Brutto ed il Cattivo&rdquo; interpretato dal compianto Lee Van Cleef. Ovviamente quest&rsquo;ultimo aspetto &egrave; interamente una mia supposizione, ma il fatto che Sentenza sia un assassino a pagamento il quale porta sempre a termine i lavori che gli vengono affidati (persino delle sue stesse vittime, purch&eacute; paganti! :P), mi suggerisce che un certo collegamento con la nuova natura di Jhin, mercenario della congrega ioniana che lo ha liberato dalla prigionia, sotto ci sia! :P \n\nPer concludere, parliamo un po&rsquo; del nome di Whisper: potrebbe essere collegato al nome delle [cartucce Whisper](https://en.wikipedia.org/wiki/Whisper_(cartridge_family)), un gruppo di cartucce d&rsquo;armi da fuoco pi&ugrave; legato al potenziare le prestazioni dei proiettili in termini di letalit&agrave; e precisione, anzich&eacute; per scopi prettamente militari. Tendono ad essere cartucce dalla velocit&agrave; supersonica, un po&rsquo; come i proiettili della pistola di Jhin ed assolutamente letali come questi. Solitamente, le cartucce personalizzabili di questo tipo vengono usate per la caccia o per passione, un po&rsquo; come l&rsquo;arte dell&rsquo;omicidio perfetto sia quella favorita di Jhin! :P \n\nBene, direi che con le ispirazioni di Jhin vi ho decisamente rotto le scatole, passiamo alle relazioni! :D\n\n**Relazioni**\n\nPer via del fatto che il padre di Shen l&rsquo;abbia catturato quando il figlio e Zed erano ancora suoi discepoli, Jhin &egrave; collegato con entrambi i Campioni, che fra l&rsquo;altro sono pronti a fermarlo di nuovo. Zed sembra quello pi&ugrave; desideroso di ucciderlo, mentre Shen nutre sentimenti conflittuali sul tiratore scelto, forse diviso dalle brutalit&agrave; che ha visto compiere al Demone Dorato e dalla visione pi&ugrave; misericordiosa del padre. Akali &egrave; l&rsquo;altro membro dell&rsquo;Ordine Kinkou con cui Jhin ha un collegamento e probabilmente pu&ograve; essere che anche la giovane sia stata coinvolta nella missione per catturarlo, anche se stranamente manca Kennen all&rsquo;appello. Probabilmente la rivisitazione della lore dell&rsquo;Ordine Kinkou chiarir&agrave; al meglio le distinzioni fra i suoi tre membri.\n\nUn altro collegamento interessante, che si trova nelle battute di Jhin, &egrave; nelle sue provocazioni a Sona. &Egrave; vero che il Campione provoca anche Garen, un altro dei personaggi che sono stati utilizzati per promuoverlo, ed altri Campioni i quali non hanno avuto nulla a che fare con lui, ma il caso di Sona pu&ograve; avere ulteriori sviluppi: Sona &egrave; una musicista e Jhin potrebbe aver sentito parlare delle sue abilit&agrave; durante la prigionia o le sue missioni per compito della congrega. Il suo astio per la forma d&rsquo;arte che Sona esegue, considerandola inferiore ai suoi capolavori, pu&ograve; essere facilmente spiegabile.   \n\n{{champion:43}} [**Karma - L&#039;Illuminata**](http://universe.leagueoflegends.com/it_IT/champion/karma/) {{champion:43}}\n\n**Etimologia nome**\n\n[ Occidentali&rsquo;s Karmaaaaaaa...](https://www.youtube.com/watch?v=-OnRxfhbHB4)\n\nS&igrave; scusate ragazzi, ma &egrave; dura restare concentrati con tutte le origini pi&ugrave; disparate! :P \n\nE sono profondamente contenta che l&rsquo;etimologia del nome Karma sia sostanzialmente semplice, infatti deriva dal [Karma](https://it.wikipedia.org/wiki/Karma): una parola utilizzata in lingua sanscrita e pāli per indicare i termini &ldquo;azione&rdquo;, &ldquo;lavoro&rdquo; o &ldquo;atto&rdquo;. Ovviamente, il riferimento pi&ugrave; importante &egrave; rappresentato dal suo uso nel principio spirituale di causa ed effetto delle religioni asiatiche, il quale stabilisce che gli intenti e le azioni di un individuo (come cause) influenzano il futuro del suddetto (come effetti). I buoni propositi ed atti portano ad un buon Karma e ad una futura felicit&agrave;, mentre male intenzioni ed atti portano ad un Karma negativo e ad una futura sofferenza. Quest&rsquo;idea &egrave; essenzialmente connessa al concetto della rinascita o reincarnazione, perch&eacute; le azioni e le intenzioni di una persona possono anche influenzare le sue vite future. In particolare il nome di Karma trae origine dalla credenza buddista legata al concetto, il quale stabilisce il risultato del ciclo di reincarnazione detto Samsarā. Solo chi segue gli insegnamenti del Buddha potr&agrave; spezzare il ciclo di rinascita. La Campionessa, da questo punto di vista, sembra mostrarsi in antitesi con il concetto di Karma: lei vuole spezzare il ciclo tradizionalista del pacifismo estremo per coniugare la necessaria scesa in battaglia per proteggere Ionia con gli intenti di pace. Insomma, un nome che nasce dall&rsquo;esigenza del contrasto a quanto sembra! :D\n\n**Ispirazione Campione**\n\nKarma &egrave; uno di quei Campioni che ha un&rsquo;origine abbastanza definita (grazie al cielo). Se il discorso del Karma si collega molto con la sua storia, in modo da contrastarla, la sua R deriva esattamente dal concetto del [mantra](https://it.wikipedia.org/wiki/Mantra). Il mantra viene considerata una sottospecie di sacro mormorio che, una volta proferito, si crede possa alterare lo stato di coscienza del soggetto dando a colui che lo pronuncia poteri psicologici e spirituali. La ulti della Campionessa, infatti, serve per garantire ulteriori effetti alle sue altre abilit&agrave; rendendole pi&ugrave; potenti del normale, proprio come dovrebbe fare una preghiera mantra una volta pronunciata. Tuttavia Karma si avvicina come figura ad un soggetto in particolare, ovvero a [Gautama Buddha](https://it.wikipedia.org/wiki/Gautama_Buddha). Buddha &egrave; fondamentalmente il fondatore del buddismo, un asceta ed eremita che insegnava una via di mezzo fra i piaceri dei sensi ed il severo ascetismo alla base del Movimento Śramana. Da questo punto di vista, anche per via del titolo Illuminata, Karma si avvicina al personaggio perch&eacute; cerca di coniugare le tradizioni pacifiste di Ionia con il bisogno di combattere gli oppressori provenienti da Noxus, nonostante non si possa dire che ella si prefiguri esattamente come un esempio preciso di [filosofia buddista](https://it.wikipedia.org/wiki/Buddhismo). Infatti, Karma ha un profondo attaccamento con la sua terra, essendo considerata la stessa personificazione di Ionia, una fonte di desiderio decisamente contrastante con il bisogno di staccarsi dalle brame e sofferenze terrene! :D\n\nEd il personaggio di Karma sembra contrastare un po&rsquo; la figura di [Mahatma Gandhi](https://it.wikipedia.org/wiki/Mahatma_Gandhi), per via del fatto che sia disposta a compiere gesti violenti per riuscire a liberare Ionia dall&rsquo;invasione di Noxus, seppure cerchi sempre di minimizzare il pi&ugrave; possibile questi. Da questo punto di vista, Karma sembra avvicinarsi al detto di origine latina &ldquo;[Si vis pacem, para bellum](https://it.wikipedia.org/wiki/Si_vis_pacem,_para_bellum)&rdquo;, ossia: &ldquo;Se vuoi la pace, preparati alla guerra&rdquo; (fra l&#039;altro, assomiglia tantissimo ad una delle sue battute nella Lega).      \n\n**Relazioni**\n\nKarma porta, come Irelia, il Mantello del Decoro, il pi&ugrave; alto segno di onorificenza concessa da Ionia nei confronti del suo popolo. Sono entrambe valenti condottiere (dovrebbero essere anche entrambe membri del Consiglio degli Anziani di Ionia) e pertanto non &egrave; ingiustificato ritenere che si siano conosciute per il loro obiettivo comune. La connessione con Lee Sin &egrave; sostanzialmente inspiegata, ma potrebbe essere che si siano conosciuti sul campo di battaglia per difendere Ionia dai reggimenti di Noxus. E Syndra&hellip; Be&rsquo;, di sicuro non vorr&agrave; lasciarsi ammazzare cos&igrave; facilmente dalla Campionessa con la passione per l&rsquo;oscurit&agrave;! :P\n\nEd ho finito! :D Ripeto, anche in questo post, se ci fossero delle cose che ho tralasciato non esitate a riferirmele! ;) Mi rendo conto che Karma sia stata la pi&ugrave; breve, finora, dei Campioni e pertanto potrei non avere detto tutto sul suo conto: se qualcuno avesse qualche altro riferimento per lei non esiti a dirmelo! ;) \n\nNel prossimo post parler&ograve; di: Kennen, Master Yi e Lee Sin! ;)","replies":[{"poster":" HegeKyras","date":"2017-09-27T12:36:02.345+0000","up_votes":2,"down_votes":0,"body":"apprezzo davvero tanto questo tipo di lavoro da te svolto,mi piace davvero conoscere ogni minimo particolare di ciò che mi piace,infatti avrò riletto le lore dei campioni almeno 2/3 volte per ognuno quindi GG{{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"HaIIeIujah","date":"2017-09-16T15:52:21.815+0000","up_votes":1,"down_votes":0,"body":"Non vedo dove sia la somiglianza tra Simo Haya e Jhin. Sono _abissalmente_ diversi se non per il fatto che entrambi hanno usato un fucile da cecchino. E no, quella non è una similitudine sufficiente.","replies":[{"poster":"PhoenixEmerald","date":"2017-09-16T20:23:03.639+0000","up_votes":1,"down_votes":1,"body":"Ciao Tera, grazie ancora una volta per il feedback! {{sticker:slayer-jinx-catface}} \n\nPer quanto riguarda il collegamento con Simo Hayha, ne ho visto un accenno sulla [wiki inglese di LoL, nella pagina dedicata a Jhin, alla sezione \"Trivia\"](http://leagueoflegends.wikia.com/wiki/Jhin). Chiaramente, prima di citare un possibile collegamento con Jhin ed il personaggio di Simo Hayha ho letto sia la [pagina wikipedia in inglese](https://en.wikipedia.org/wiki/Simo_H%C3%A4yh%C3%A4), sia la [pagina wikipedia in italiano](https://it.wikipedia.org/wiki/Simo_H%C3%A4yh%C3%A4).\n\nCome sottolineavo nella stessa descrizione, né Jhin né Simo possono considerarsi totalmente simili, infatti hanno un modo di approcciarsi alla loro abilità con il fucile da cecchino completamente differente. Ho semplicemente sottolineato le somiglianze decisamente plausibili che possono tranquillamente indicare una certa ispirazione al personaggio di Simo Hayha:\n\n* Entrambi partono da origini umili, Simo un contadino e Jhin un macchinista di teatro. Nessuno dei due ha mai fatto particolare pratica con il fucile, prima del loro ingresso uno nell'esercito e l'altro nella congrega segreta.\n\n*  Entrambi sono dei professionisti nella loro \"arte\" e senza bisogno di utilizzare un mirino telescopico. Infatti, controllando [il modello di Jhin](http://www.lolking.net/models?champion=212&skin=0) si nota che il fucile che utilizza per la ulti non abbia un mirino, a differenza di Caitlyn che ha una ulti che gioca, appunto, sul fatto che il suo fucile abbia un mirino. E non è una cosa comune utilizzare un fucile di precisione così, soprattutto quando entrambi colpiscono da distanze abbastanza lontane (Simo poteva colpire un bersaglio addirittura da _400 metri, senza utilizzare un mirino telescopico_! Un mostro! O__o)\n\n* Questa è più una mia supposizione, infatti non l'ho voluta aggiungere perché poteva essere un po' tirata: la Guerra d'Inverno a cui partecipa Simo è un conflitto relativamente breve (1939-40) ed avviene fra URSS e Finlandia perché l'Unione Sovietica voleva il controllo di alcuni territori su suolo finlandese. Ecco, mi ha stupito il fatto che, come Jhin opera per conto indiretto di Ionia facendo il sicario (Ionia invasa da Noxus un po' come la Finlandia viene attaccata dalla Russia), così anche Simo difendeva il suo paese appostandosi in solitaria con il suo fucile e giusto una mitraglia per gli scontri ravvicinati. Da quel che pare dalle nuove modifiche delle lore, inoltre, sembra che l'invasione di Noxus sia avvenuta in maniera lampo su Ionia, per poi essere arrestata sulle tratte costiere dove accadono schermaglie fra i due schieramenti (sembra proprio una guerra lampo che porta, come risultato, a dei rapporti molto tesi).\n\nInsomma, io diverse somiglianze le ho viste, poi quello che ovviamente mi sembrava discordante fra i due personaggi l'ho evidenziato nella stessa mia _prolississima_ discussione! :P","replies":[{"poster":"HaIIeIujah","date":"2017-09-16T20:34:23.179+0000","up_votes":2,"down_votes":0,"body":">  Ecco, mi ha stupito il fatto che, come Jhin opera per conto indiretto di Ionia facendo il sicario (Ionia invasa da Noxus un po' come la Finlandia viene attaccata dalla Russia)\n\n\nJhin viene imprigionato ben prima dell'Invasione di Ionia, e viene liberato solo dopo che essa si è già conclusa- non dal governo, ma da una cabala segreta. Non sappiamo quanto sia durata la guerra stessa, ma è stata una guerriglia prolungata (dalla lore di Riven).\n\nTra l'altro, la GUerra d'Inverno non fu affatto simile alla Blietzkrieg impiegata nella guerra tra Reich e la Francia ( o invero alla successiva invasione stessa dell'URSS da parte dei Nazisti): fu uno lento stallo al confine lungo quasi sette mesi, seguita da una lenta avanzata.\n\nDue anni, nel contesto di una guerra moderna tra nazioni sovrane, sono una guerra estesa. In confronto la Guerra Lampo contro la Francia durò _quarantasei giorni._\n\nTrovo la prima una somiglianza fin troppo vaga, la seconda inesistente (nell'unica short story in cui lo vediamo lavorare a lungo raggio, Jhin ha un sistema di lanterne per segnare la distanza.) e la terza una diretta contraddizione.\n\nAbbiamo da una parte un patriota che ha combattuto per difendere la sua casa e dall'altra un serial killer narcisista che uccide unicamente per la sua sola arte.\n\nHo dimenticato di segnarlo prima, quindi lo aggiungo qui: il fatto che io stia commentando su ciò che trovo errato non vuol dire che non apprezzi il lavoro. Si chiede chiaramente quanto sforzo ci stai mettendo e ti auguro buona fortuna nella continuazione. Su questo (e sulle fonti del forum precedente) penso però tu abbia oggettivamente sgarrato, e volevo commentare per permetterti di ricontrollare/correggere.","replies":[{"poster":"PhoenixEmerald","date":"2017-09-17T09:48:36.278+0000","up_votes":1,"down_votes":1,"body":"> Jhin viene imprigionato ben prima dell'Invasione di Ionia, e viene liberato solo dopo che essa si è già conclusa- non dal governo, ma da una cabala segreta. Non sappiamo quanto sia durata la guerra stessa, ma è stata una guerriglia prolungata (dalla lore di Riven).\n\n[Dalla lore di Jhin](http://universe.leagueoflegends.com/it_IT/story/champion/jhin/): \n\n> Intanto, fuori dalle mura della prigione, Ionia era sconvolta dall'invasione dell'impero noxiano, cosa che portò a una situazione di forte instabilità politica. La guerra risvegliò in quella tranquilla nazione il desiderio di morte e distruzione. Lo stato di pace e di equilibrio per cui Kusho si era battuto era stato distrutto radicalmente dalla presenza di gente diabolica e alleanze segrete che combattevano in nome del potere. Alla ricerca disperata di un modo per contrastare il potere del ninja e gli spadaccini Wuju, **una congrega all'interno del consiglio decisionale** stava cospirando per la liberazione di Jhin, con l'idea di trasformarlo in un'arma terrificante.\n\nIl motivo per cui ho detto che Jhin opera per conto **indiretto** di Ionia è proprio il fatto che una **congrega all'interno del consiglio decisionale** lo abbia \"liberato\" dalla sua prigionia per usarlo per i suoi scopi, dato che, come si legge nei primi periodi che ho riportato, l'invasione di Noxus (a quanto pare) aveva sconvolto l'armonia all'interno dello Stato scatenando una sorta di opposizione interna allo stesso Governo di Ionia.\n\nPoi, non credo che la lore di Riven possa essere utilizzata come un buon indicatore, attualmente, di come si sia svolto il conflitto di Ionia: è abbastanza vecchia e non è stata ancora rivisitata, né toccata dai recenti fumetti pubblicati dalla Riot. Una lettura più recente e decisamente più informativa è stata data dal [fumetto su Darius  ](http://universe.leagueoflegends.com/it_IT/comic/darius/bloodofnoxus). In questo fumetto, Darius e Quill si stanno ritirando da Ionia e sono sulle navi in prossimità della costa, pertanto ritengo che la guerriglia si sia spostata oltre i confini di Ionia e **credo** (l'avevo sottolineato che era una mia supposizione, per questo non l'avevo aggiunta al testo! :P) che possa essere stata una guerra piuttosto veloce, scomposta e sostanzialmente in stallo. Tutto questo, non toglie il fatto che Jhin sia utilizzato indirettamente per conto di una parte del governo stesso di Ionia (dalla sua stessa lore citata sopra) ed operi in solitaria, proprio come faceva Simo! :)\n\n> Tra l'altro, la GUerra d'Inverno non fu affatto simile alla Blietzkrieg impiegata nella guerra tra Reich e la Francia ( o invero alla successiva invasione stessa dell'URSS da parte dei Nazisti): fu uno lento stallo al confine lungo quasi sette mesi, seguita da una lenta avanzata.\n\nOkay, non volevo specificarlo perché mi pareva banale: mi riferisco, ovviamente, alla durata della guerra, di neanche un anno (1939-40). Logico che sia diversa dalla Guerra Lampo, una tattica militare totalmente diversa per il contesto in cui essa è stata utilizzata e che è \"lampo\" di solo nome: i conflitti mondiali in cui è stata adoperata non sono sicuramente né brevi né semplici che dir si voglia. :)\n\n> Trovo la prima una somiglianza fin troppo vaga, la seconda inesistente (nell'unica short story in cui lo vediamo lavorare a lungo raggio, Jhin ha un sistema di lanterne per segnare la distanza.) e la terza una diretta contraddizione.\n> \n> Abbiamo da una parte un patriota che ha combattuto per difendere la sua casa e dall'altra un serial killer narcisista che uccide unicamente per la sua sola arte.\n> \n> Ho dimenticato di segnarlo prima, quindi lo aggiungo qui: il fatto che io stia commentando su ciò che trovo errato non vuol dire che non apprezzi il lavoro. Si chiede chiaramente quanto sforzo ci stai mettendo e ti auguro buona fortuna nella continuazione. Su questo (e sulle fonti del forum precedente) penso però tu abbia oggettivamente sgarrato, e volevo commentare per permetterti di ricontrollare/correggere.\n\nOkay, siamo ad un palese impasse perché informandomi sulla wiki inglese di LoL alla pagina di Jhin, eppoi leggendo la wiki in italiano di Simo Hayha eppoi quella in inglese sempre su di lui, io ho visto delle somiglianze e le ho spiegate anche fin troppo nel dettaglio, sia nel primo post, sia nella tua risposta (sono una persona estremamente prolissa)! :P \n\nE Jhin è vero che utilizza delle lanterne nel racconto, ma a livello di gameplay non c'è alcuna corrispondenza con questo modo di evidenziare le posizioni, forse perché Jhin è in grado di colpire un bersaglio anche senza bisogno di usare questo stratagemma.\n\nE giusto perché mi sembra d'uopo sottolinearlo: io utilizzo il condizionale quando parlo di queste origini (a meno che ci sia qualcosa confermato dalla Riot o qualcosa di a dir poco palese evidenza, come nel caso del nome Karma), oppure sottolineo come l'ispirazione possa essere parziale. Come ho scritto anche sopra, ci sono delle somiglianze ma Jhin non è identico a Simo ed ho ribadito che, come persone, sono totalmente differenti e che Simo abbia solo deciso di compiere il suo dovere di soldato al meglio (in un modo quasi _inumano_  per l'abilità dimostrata), mentre Jhin ha in mente tutt'altro quando si mette all'opera.\n\nTrovo un po' strano che abbia dato fastidio questo dettaglio, perché quando nella lore di Akali ho fatto presente che aveva delle somiglianze con Jade o Black Orchid ho ribadito che avessero personalità completamente differenti l'una dall'altra, pur avendo in comune dei dettagli che ho esplicato. Così come ho ribadito che Irelia utilizza la tecnica utilizzata da Kenshin ma non è Kenshin o Karma assomiglia a Budda ma non si avvicina caratterialmente o filosoficamente a lui.","replies":[]}]}]}]}]}