{"poster":"Heselar","date":"2017-03-22T13:38:10.776+0000","title":"Nuova voce di Lux : Parliamone qui (Più alcuni bug)","subforum":"A Runeterra si parla italiano","up_votes":4,"down_votes":1,"body":"Volevo segnalare alcuni bug e problemi/feedback, nonch&eacute; creare una discussione in generale per il nuovo v.o. di {{champion:99}}  essendo che nessuno ne parla e nessuno si sia manco accorto dell&#039;aggiornamento a quanto pare, e anche perch&eacute; &egrave; il mio main.\n\nPremettendo che amo l&#039;italia, l&#039;italiano, il mondo del doppiaggio e sono fluente in inglese a livello praticamente madrelingua ma continuo ad usare il client italiano. E non voglio disprezzare il lavoro dei rioter italiani in alcun modo. \n\nMa andiamo al dunque.\n\nBug:\n\n*  Il volume &egrave; bassissimo, non si riesce quasi a sentire ci&ograve; che dice, cosa che non accadeva con la vecchia voce. Ovviamente le mie impostazioni sono rimaste tutte uguali. Per&ograve; boh, potrei essere solo io, fatemi sapere se riscontrate la stessa cosa.\n* Alcune frasi sono scomparse, sebbene questo aggiornamento sia classificato come un&#039;espansione, non una sostituzione del doppiaggio. Si pu&ograve; notare facilmente soprattutto nel joke/battuta (ctrl+1) dove {{champion:99}}  ha solo il &quot;botta e risposta&quot; dell&#039;arcobaleno, quindi 2 battute/jokes, mentre prima ne aveva 4. (Si, quattro, cosa di cui molti non erano a conoscenza poich&eacute; per sentire la quarta dovevi usare il joke 6 volte di fila, per qualche strano motivo) Pu&ograve; darsi anche che questo non sia un bug, ma una scelta dei rioter di tenere solo quelle nuove, perch&eacute; in effetti stonerebbero molto la vecchia e la nuova voce insieme. Entriamo pi&ugrave; in dettaglio su questa cosa.\n\n{{sticker:zombie-brand-mindblown}} &quot;Vecchia e nuova voce? Ma la doppiatrice &egrave; la stessa!&quot;\n\nVero, per&ograve; essendo passati circa 5 anni dalla registrazione della voce originale e quella nuova si pu&ograve; notare come la voce sia molto diversa, giustamente, pi&ugrave; matura e , a mio parere, non pi&ugrave; adatta ad un personaggio come {{champion:99}}  che ha una voce alta e squillante . Si sente che &egrave; parecchio forzata. Senza togliere nulla alla talentuosa doppiatrice che ha invece fatto un ottimo lavoro con {{champion:21}} e la maggior parte delle forme di {{champion:99}}  elementalista, dove spiccano le voci della forma ghiaccio, fuoco, e oscurit&agrave;, che sono da brivido. Mentre invece cadeva in alcune altre, soprattutto forma mistica, per lo stesso motivo di prima. (Troppo forzata)\n\nEDIT: Aggiungo cosa ne penso sulle nuove frasi in generale (Con cui la Riot italiana non c'entra) e cioè che abbiano cambiato totalmente la personalità del personaggio. Cosa che non è per forza un male... Non so ancora che pensarne, aspetterò la nuova lore che facendo 2+2 verrà presto con un probabile evento di Demacia.\n\nQuesto &egrave; solo il mio parere, fatemi sapere cosa ne pensate voi. {{sticker:slayer-jinx-wink}}","replies":[{"poster":"patmax17","date":"2017-03-30T13:59:23.222+0000","up_votes":1,"down_votes":0,"body":"Perchè questo post ha una sola risposta? :(\n\nIo non ho lux ma l'ho beccata in game due o tre volte, e la nuova voce mi è sembrata estremamente acuta e fastidiosa, molto più macchietta di prima - anche se ammetto di non aver sentito molto, quindi potrei sbagliarmi. Mi confermi comunque che la doppiatrice è rimasta la stessa?\n\nAlso, hai letto le nuove lore di Demacia? Tipo la metà hanno a che fare con Lux in un modo o nell'altro, posso capire perchè abbiano colto l'occasione per ridoppiarla :)","replies":[]},{"poster":"SickAnto","date":"2017-03-22T14:08:44.279+0000","up_votes":1,"down_votes":0,"body":"A me sembra ancora adatta per Lux e non sento tanta differenza.","replies":[]}]}