{"poster":"GameBeu","date":"2015-06-04T22:42:48.879+0000","title":"LiebeS Riot Team","subforum":"Hilfe & Support","up_votes":2,"down_votes":4,"body":"Zuerst mal das positive:\r\n\r\nIhr seid stets bem&uuml;ht f&uuml;r Balance zu sorgen und interagiert mehr mit euren Kunden als Blizzard. /GOODJOB\r\n\r\nAllerdings...\r\n\r\nwas ihr in letzter Zeit an serverperformance liefert ist eine Frechheit und ihr solltet euch sch&auml;men soviel Kohle einzufahren und ne derma&szlig;en beschissene Leistung abzuliefern, seit Monaten. Ich werde gebannt weil ich son ach so gemeiner gameleaver bin, dabei kann ich n scheiss dreck daf&uuml;r das jedes 3. meiner Games entweder erst garnicht startet oder mir mitten im Game die connection fl&ouml;ten geht, und das SEIT MONATEN. Der neue Client und der neue summoners rift haben NICHTS verbessert, im gegenteil, und eure neue serverbase in Holland scheint auchn dreck zu taugen.\r\n\r\nDazu kommt euer l&auml;cherliches Report-System das die Leute wesentlich toxischer macht als n&ouml;tig und GARNICHTS bringt. Dummer aktionimus um eure prim&auml;re zielgruppe von 12-15 j&auml;hrigen zufriedenzustellen und ihnen n machtinstrument in die Hand zu dr&uuml;cken das sicherlich einzelne Leute arg &auml;rgert, aber eure frei erfundenen &quot;120000% of players who got chatrestricted improved their behaviour a lot&quot; haben noch nie jemandem geholfen, in bronze bis low diamond sieht man leute selten n 2. mal und dar&uuml;ber schie&szlig;t man sich arg selbst ins bein wenn man bei allen als der flamer bekannt is.\r\n\r\nAn alle Kinder die jetzt ganz emp&ouml;rt sind das ich was negatives schreibe und nich &quot;good job, wp, n1, may i suck ur dick plz?&quot;, hier n tip: Euch passt nich was geschrieben wurde? euch gef&auml;llt die ausdrucksweise nich? Dr&uuml;ckt oben rechts das X und lest es nicht, hilft auch im Summoners rift wenn ihr wiedrr 0/12 steht und jemand sagt &quot;wew another feeding mid again&quot; und ihr instant in eure &quot;SO TOXISCH MUCH FLAME REPROT REPRTO RITO PLZ Q__Q&quot; kinderkacke verfallt, das equivalent zum X im browser ist der ignore-button ingame.\r\n\r\nP.S.: ich hab ne 50k leitung und kann jedes andere online game mit downloads und stream und 9 opera tabs offen haben und ich habe keine probleme, nur in LoL kommts oft (gern mehrmals am tag) vor das ich 20 minuten spiele, keine probleme habe, und pl&ouml;tzlich der ping zwischen 30 und absurd hohen zahlen hin und herschwankt, ich glaub das h&ouml;chste was mir der client angezeigt hat war was um die 8.400 MS, gern aber auch den klassischen 500ms und attempting to reconnect shit.","replies":[{"poster":"Kaitri","date":"2015-06-04T23:12:47.776+0000","up_votes":2,"down_votes":1,"body":"bei den servern... ich kann nichts dazu sagen, diverse haben sich über dcs beschwert hat aber aufgehört, jetzt gibts nur mehr probleme über drophacks. klar riot könnte was tun und auch schneller aber ich denke sie sind schon dabei. \n\ndas reportsystem bringt genau bei den leuten nichts, bei denen auch alles andere nichts bringt. diese sorte von menschen existiert und sie wird immer existieren, die sorte von mensch, die ganz egal was sie tut, immer sagt alle anderen sind scheiße und schuld.\nich liebe das aktuelle report system und ich finde es einfach so befriedigend wenn leute posten \"gg 14 tage bann und ich weiß nicht warum\" und ihren toxischen chatlog anhängen :D \n\nwenn du den \"klassischen\" 500ms shit hast, dann drophack inc :D","replies":[]},{"poster":"GameBeu","date":"2015-06-07T21:00:24.415+0000","up_votes":1,"down_votes":0,"body":"Good Job Rito, hab jetzt seit 3 stunden n botgame am laufen in das ich nich connecten kann, euer schrott client sagt ich solle meine Firewall checken, hab ich getan, is extra für euch ausgestellt, HILFT ABER NICHTS O_o\n\nGenausowenig wie Lol client neustarten, rechner neustarten, in den RAD ordner gehn dateien löschen und neu downloaden, aber es liegt SICHERLICH an MEINER firewall.\n\nWofür genau habt ihr nochmal die RP preise angehoben?","replies":[]}]}