{"poster":"Player00017","date":"2015-04-12T16:27:52.071+0000","title":"kha'zix jungle","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Vorrei giocare kha&#039;zix jungle,sar&agrave; la mia prima volta in jungle che consigli mi date?\r\ncome lo dovrei buildare?\r\n{{champion:121}} love kha&#039;zix {{champion:121}}","replies":[{"poster":"Pizz Uh Jin","date":"2015-04-12T21:09:07.638+0000","up_votes":1,"down_votes":0,"body":"Sono di nuovo qua! \n\nRiprendo le parole common: non sapendo che tu fossi livello 12 ti ho consigliato di giocarlo in giungla... In qualsiasi caso se proprio vuoi imparare adesso a giocare in giungla, non usare kha'zix! È molto difficile da usare in questo ruolo. Piuttosto prova xin zhao per esempio (il mio primo jungler :') ) oppure master yi che sono molto più semplici e ti insegnano le meccaniche base. \n\nKha zix per ora usalo in lane, è molto piú semplice giocarlo lì.\n\nP.S. giocare in giungla è il ruolo più complicato per un nuovo giocatore e ti consiglio di arrivare almeno al livello 20 per farti un po' di maestrie per cominciare a \"junglare\"!","replies":[{"poster":"Player00017","date":"2015-04-13T13:55:52.963+0000","up_votes":1,"down_votes":0,"body":"grazie di nuovo per la risposta :D\ncomunque la mia prima partita la farò lo stesso con kha'zix(si sono stupido) ma non mi accontento delle vittorie facili...","replies":[{"poster":"Pizz Uh Jin","date":"2015-04-13T15:03:33.657+0000","up_votes":1,"down_votes":0,"body":"\"Stupido\" mi sembra una parola grossa :D Non c'è nulla di male a provare qualcosa, ma sappi che comunque non è facile usare kha'zix, in particolare in giungla!","replies":[]}]}]},{"poster":"A Yordle ln Heat","date":"2015-04-12T16:36:16.327+0000","up_votes":1,"down_votes":0,"body":"Posso essere il più sincero possibile con un livello 12 quale tu sei?\nKha'Zix è un jungler difficile da usare. Tanto difficile.\nNon cominciare con lui a provare la giungla; ci sono tanti altri champ con cui è meglio cominciare.\n\nPoi col tempo riprenderai Kha'Zix, ma per ora prendi dei champ più semplice e alla tua portata.","replies":[{"poster":"99White Terror99","date":"2015-04-13T14:05:06.655+0000","up_votes":1,"down_votes":0,"body":"Approvo in pieno, io appena raggiunti i 6300 IP avevo comprato Rengar, sarò stato sotto il lvl 10, volendo fare jungler, si sono stato stupido -.-\nMa pria ero ancora più stupido perchè la mia primissima partita l'ho giocata Kha'Zix jungler XD\nComunque dopo col lvl 10 e lo smite ho iniziato a giocare Rengar jungler, ma facevo schifo e mi sono allenato con altri\nSolo ora, da un pò ho ripreso Rengar e riesco a giocarlo benino\nPrima allenati, abbi pazienza, arriverà il momento anche per te di spadroneggiare in giungla con Kha'Zix ma non ora...\n\ne forse un giorno ci affronteremo, i due cacciatori della giungla {{champion:107}} vs{{champion:121}}","replies":[]}]},{"poster":"fenixz","date":"2015-04-12T21:35:43.200+0000","up_votes":1,"down_votes":0,"body":"Kha'zix, attualmente, fatica molto. Il meta attuale lo esclude un pò, e si \"auto-esclude\" già di suo, visto i nerf che ha subito.\nPoi il discorso è sempre il solito, tutto è giocabile, dipende da mille fattori, ma allo stato attuale delle cose è dura junglarlo.\nSe è la tua prima volta in giungla, ti sconsiglio vivamente di giocarci khazix. Sarebbe un trauma.","replies":[{"poster":"Player00017","date":"2015-04-13T13:52:40.377+0000","up_votes":1,"down_votes":0,"body":"mi sa che hai ragione...dovrei aspettare di giocare jungle con kha'zix peccato.\nperò prima o poi lo giocherò finchè non diventerò bravo...\nsì,mi piace complicarmi la vita :D","replies":[]}]},{"poster":"REDekar","date":"2015-04-12T17:43:41.101+0000","up_votes":1,"down_votes":0,"body":"kha zix è moolto complicato da usare in giungla t consiglio di iniziare con altri comunque, di solito omen + brutalizer + hydra se no ti consiglio di andare su dei siti di lol dove puoi guardare la build dei pro","replies":[]},{"poster":"Jay Kenton","date":"2015-04-12T16:34:27.020+0000","up_votes":1,"down_votes":0,"body":"Aspetta la prossima patch.","replies":[]}]}