{"poster":"Weaning","date":"2015-07-27T17:03:34.262+0000","title":"Me contestan esto después de mandar un ticket","subforum":"Problemas Técnicos","embed":{"description":null,"url":"http://s11.postimg.org/dy513jnqa/Sin_t_tulo.jpg","image":null},"up_votes":2,"down_votes":1,"body":"Voy a hacer una denuncia de eloboost, lleno todos los campos como mi nombre de cuenta, mi nick en el servidor, la denuncia y como se lee ah&iacute; pregunto \"d&oacute;nde puedo denunciar a un jugador\"\n\nY me contesta que van a investigar a esta persona.\n\nQu&eacute; persona si nunca di un nick? No s&eacute; para qu&eacute; me tomo el tiempo de mandar la denuncia si me contesta un bot.\n\nhttp://s11.postimg.org/dy513jnqa/Sin_t_tulo.jpg","replies":[{"poster":"Ozarcus","date":"2015-07-27T17:18:57.566+0000","up_votes":2,"down_votes":0,"body":"Te responden bots, a mi por ejemplo envié un par de bugs que hasta ahora no se solucionaron, envié capturas y un video y me dicen que ponga una captura del error... GG soporte {{champion:106}}","replies":[]},{"poster":"MorochoCandente","date":"2015-07-27T18:17:33.869+0000","up_votes":1,"down_votes":0,"body":"El soporte, de manera AUTOMATICA te envia un mensaje respondido por un bot, que tiene respuestas sobre el tema que estas preguntando, si en el asunto pones eloboost, el bot te va a dar las preguntas y respuestas frecuentes sobre eloboost y el soporte.\n\nSi respondes a ese bot, tu caso pasa a ser atendido por un miembro del soporte.\n\nEsto se hace mas que nada a modo de respuesta rapida, ya que muchas veces, con la primera respuesta del bot alcanza, y se hace por que si los miembros del soporte tuvieran que responder TODAS las consultas una por una, se demorarian muchisimo tiempo en resolverlas todas.","replies":[{"poster":"Weaning","date":"2015-07-27T21:19:36.319+0000","up_votes":1,"down_votes":0,"body":"No fue así, mandé un ticket a una sección de preguntas generales con el título \"denunciar eloboost\".\n\nMe llegó al día siguiente que mi mail se recibió y pronto iba a tener respuesta de un miembro de soporte, casi 1 semana después me llega eso sin siquiera saber a quién iba a denunciar.\n\nMandé preguntando dónde podía denunciar y me responden que están analizando mi denuncia.","replies":[]}]},{"poster":"ZanahoriaAsesina","date":"2015-07-27T17:23:48.355+0000","up_votes":1,"down_votes":0,"body":"No creo que necesiten saber el nombre, lo más probable es que te usen como un punto para empezar a buscar algo que no cuadra ej: tu historial de partidas.","replies":[]},{"poster":"Lucrexio","date":"2015-07-27T17:21:54.187+0000","up_votes":1,"down_votes":0,"body":"\"Si estas ausente durante mi lucha, no esperes estar presente en mi éxito\" xD dat bot Oscar Wilde jajaja","replies":[]},{"poster":"feed no jutsu","date":"2015-07-27T17:18:46.451+0000","up_votes":1,"down_votes":0,"body":"Si crees que el soporte de Riot es así de fácil, no, no lo es, no puedes ir al soporte y preguntar algo demasiado simple, la mayoría son bots y pocas veces personas reales, es algo complejo de entender.","replies":[]}]}