{"poster":"I DeMo I","date":"2016-04-23T09:28:04.959+0000","title":"Bannen aller assasins in der Gamemode-rotation!","subforum":"Champions & Gameplay","up_votes":2,"down_votes":7,"body":"Guten Tag,\r\nda letztens die neue Gamemode-rotation rausgekommen ist, ist mir direkt mal was aufgefallen.\r\nIn jedem Spiel gibt es einen Assasin und dieser Carried immer das ganze Team und zerst&ouml;rt dadurch die Spielerfahrung aller anderen.\r\nIn The Ascension waren es gr&ouml;&szlig;tenteil nur Assasinen die gebannt wurden und das vollkommen zurecht.\r\nGenau wie in Legende des Porok&ouml;nigs und nun URF.\r\nAssasinen zerst&ouml;ren dabei wirklich extrem die Spielerfahrung jeder die gegen diese Spielen.\r\nVor allem weil es gr&ouml;&szlig;tenteils nicht mal mehr Spa&szlig; macht Assasinen zu spielen sondern es wieder nur um das Gewinnen geht.\r\nIch wollte deswegen mal fragen ob es nicht eine m&ouml;glichkeit w&auml;re diese aus der Gamemode-Rotation zu bannen.\r\nDie Gamemode-Rotation ist zum Spa&szlig; gedacht, was allerdings durch die Assasinen wieder zum totalen Tryhard Mode gemacht wird und es einfach keinen Spa&szlig; macht.\r\nL.G. DeMo2407","replies":[{"poster":"Lagbeard","date":"2016-04-23T09:54:31.699+0000","up_votes":2,"down_votes":0,"body":"Assassinen erforden koordiniertes Counterplay, gerade in diesen Fundmodes. Da man allerdings meist Solo mit Randomleuten am Start ist, gestaltet sich das schwierig, auch weil viele diese Spiele (verständlicherweise) nicht besonders ernst nehmen. Daher sind Assassinen bei 5 Randoms stärker, als im abgesprochenen Team. \nUnd sie Profitieren sehr von den Boni der Spielmodi:\n\nAscension: Ein Aufgstiegener Assassine verliert seine Schwäche: Die Squishyness (falls das ein Wort ist). Er hat also die Tankyness eines Bruisers mit dem Schadensoutput eines Assassinen und ist daher sehr stark. Dazu kommt die verzweigte Map mit sehr geringer Vision, die es leicht macht, Gegner zu isolieren.\n\nURF: Permanente Oneshotrotation: Schaden ist im Urf wichtiger als Verteidigung, da die Boni, gerade die CDR vom URF Offensive Items mehr unterstützen als Defensive (Außer bei Champs, die direkt mit Defensiven Items skalieren wie Mundo). Das liegt einfach daran, dass die meisten Spells offensiver Natur sind.\n\nLegend of the Poro-King: Naja, ehrlich gesagt kenne ich den Modus kaum, hab ihn letzen Winter drei mal gespielt. Aber hier sind mir Assassinen nicht besonders Übermächtig vorgekommen. \n\nUnd was den Spaß angeht: Woher willst du wissen, ob der Zed im URF Zed picked, weil er Tryhardet? Ich denke schon, dass Assassinen in diesen Modi Spaß machen.","replies":[{"poster":"Enderized","date":"2016-04-23T10:03:15.137+0000","up_votes":2,"down_votes":0,"body":"Ich finde andere Dinge viel schlimmer als Assasinen in Fun Modes.\n\nin URF: Urgot, Ekko (auf Fulltank) oder Azir ^^","replies":[{"poster":"LokiOdinson","date":"2016-04-23T10:24:09.534+0000","up_votes":1,"down_votes":0,"body":"> Ich finde andere Dinge viel schlimmer als Assasinen in Fun Modes.\n \n> in URF: Urgot, Ekko (auf Fulltank) oder Azir ^^\n\nWie unterscheiden sich Urgot, Ekko oder Azir in Fun Modes von \"Assas(s)inen\"? Ist das gleiche Problem, gibt also keinen Unterschied.","replies":[{"poster":"Enderized","date":"2016-04-23T10:35:35.842+0000","up_votes":1,"down_votes":0,"body":"Urgot ist keine Assasine.\nEkko als Fulltank ist keine Assasine.\nAzir ist keine Assasine.","replies":[{"poster":"LokiOdinson","date":"2016-04-23T10:59:34.140+0000","up_votes":1,"down_votes":0,"body":"Miss Fortune ist auch kein Assassine, aber ich wäre dennoch für einen Bann dieser. Denn wer sein E spammen kann und sich dann noch während der Dauer zurückzieht für 2 Sekunden und ein weiterem E sollte ebenso aus dem Verkehr gezogen werden wie ein Azir oder Ekko oder Urgot.\n\nOb Urgot, MF, Zed - jeder Assassine gehört genauso gebannt wie ein Champion der unlauteren Wettbewerb durch URF betreibt, so wie Ekko, Urgot oder Azir.\n\nOb Urgot schlimmer ist als MF oder einem Assassinen? Viel Spaß bei dem Erklärungsversuch dieser falschen Ansicht.","replies":[{"poster":"Enderized","date":"2016-04-23T11:17:51.898+0000","up_votes":1,"down_votes":0,"body":"Urgot: Spam Q - Lock E Permaslow W + Shield, dmg reduction passive, lockdown R + additional Resistances.\n\nJa Urgot ist schlimmer als MF :)","replies":[{"poster":"LokiOdinson","date":"2016-04-23T14:08:19.852+0000","up_votes":1,"down_votes":0,"body":"> Ja Urgot ist schlimmer als MF :)\n\nAh, meinst du?\n\nMF: E... E... E... E... Urgot muss dich wenigstens mit dem Gift erreichen, aber MF braucht nur das E und manchmal (sehr selten) ihre Ult. Fin.\n\nE topt Q-E-W-Urgot, denn MF braucht nur einen Finger ;) Aber danke für´s mitreden.","replies":[{"poster":"D4RKEVA","date":"2016-04-23T18:02:39.722+0000","up_votes":1,"down_votes":0,"body":"mf ist meha bad in urf ...\n\nJayce outranged und dmged sie\nEzreal auch\nShaco zed etc kommen ran...\n\n\nSie hat keine gapcloser und keinen burst! Ihre e ist eher meh in urf","replies":[]}]}]}]}]}]},{"poster":"JannaTheSecond","date":"2016-04-23T10:10:44.383+0000","up_votes":1,"down_votes":0,"body":"Oder Hecarim ._.","replies":[]}]},{"poster":"LokiOdinson","date":"2016-04-23T10:32:22.044+0000","up_votes":1,"down_votes":1,"body":"> Woher willst du wissen, ob der Zed im URF Zed picked, weil er Tryhardet? Ich denke schon, dass Assassinen in diesen Modi Spaß machen.\n\nKlar tun sie Tryharden und Spaß dabei haben - mit Cheats gewinnen macht ja auch Spaß. Nur eben nicht den fairen Spielern.\n\nDu sagst es selber :\"Schaden wichtiger als Verteidigung\" - und in URF werden die Burst-Schaden-Champs noch einmal gebufft, von daher sind Assassinen natürlich OP und sollten deswegen gebannt werden. Also gibt es keinen Grund sich nicht zu wünschen Assassinen mögen dort gebannt werden, geschweige denn irgendwelche Ausreden von wegen \"Assassinen erforden koordiniertes Counterplay\" - Counterplay ist nutzlos wenn ein Burstchampion mit EXTREM-Schaden dich One-Shoted. Wer mit einer Rota tot ist, kann nicht countern.","replies":[{"poster":"Lagbeard","date":"2016-04-23T10:49:11.520+0000","up_votes":1,"down_votes":0,"body":"Zed kann, so stark er auch sein mag, meiner Meinung nach nicht mit einem Cheat verglichen werden. Du wirfst damit jedem Zed Spieler die gleiche unfaire Motivation vor, die Cheater haben was unangebracht beleidigend und sehr verallgemeinernd ist.\n\nDes weiteren, das scheint wohl nicht klargeworden zu sein, bin ich gegen einen Allgemeinen Ban der Assassinen. \nNatürlich ist URF unbalanced, da fehlen 6 Jahre Patchnotes. Aber ich finde, dass man deswegen niemandem seinen Champ verbieten kann. Es gibt auch außerhalb der Assassinen Champs, die gut von den Buffs Profitieren, xerath, Ziggs, Lux oder Supporter wie Sona zum Beispiel. Genauso gibt es Champs, die mit den Buffs gar nichts Anfangen können, wie Nasus. In URF geht es nun mal ums Rumballern bis der Arzt kommt, und ich finde man sollte den Spielern keinen Vorwurf machen, mit welchem Champ sie rumballern.","replies":[{"poster":"LokiOdinson","date":"2016-04-23T10:55:51.792+0000","up_votes":1,"down_votes":2,"body":"Jeder der allein um des Sieges willen zu unlauteren Mitteln greift - sei es ein Cheat, einen Noobchamp oder einen durch Buffs überbufften Meta-Champion oder (Achtung!!) einen Assassinen der Aufgrund von Urf das Doppelte an Schaden macht und damit jeden Counter One-shotet - nutzt die gleichen Mittel eines Cheaters: ein Mittel um das faire Spiel mit unfairen, unausbalancierten Mitteln zu beugen, nach seinen Gunsten zu richten und letzten Endes einen Sieg zu bekommen.\n\nDeswegen: Wenn man URF spielt dann sollte es auch nach den selben Regeln wie sonst gehen: Faire Champions gegen faire Champions.","replies":[{"poster":"Lagbeard","date":"2016-04-23T11:03:08.135+0000","up_votes":1,"down_votes":0,"body":"Ein Cheater bricht die Regeln des Spiels, ein Assassine nutzt vollkommen legitime und erlaubte Mittel. Da wird überhaupt nichts gebeugt. \n\nWir spielen ein Spiel, dieses Spiel hat Regeln. Diese Regeln machst nicht du, diese Regeln macht RIOT als Spielentwickler. Und diese Regeln besagen, dass Cheaten verboten ist. Diese Regeln besagen aber nirgends, dass Champions unfair sind und nicht benutzt werden dürfen. \n\nEhrlich gesagt verstehe ich nicht, wie du Leuten vorwerfen kannst, ein Spiel zu beugen oder gar Regeln zu brechen, wenn du mir nicht die Regel nennen kannst, die Gebeugt oder gebrochen wurde.","replies":[{"poster":"LokiOdinson","date":"2016-04-23T14:23:53.014+0000","up_votes":1,"down_votes":0,"body":"Ganz einfach: Eine MF zu spielen die dauernd nur ihr E spammt - gerade jetzt in URF der Fall, ebenso wie der Schatten-Flash-Zed - ohne jegliches Risiko eingehen zu müssen da sie ihr E aus einer Reichweite spammen kann die du nicht überbrücken kannst. Das ist Cheaten.\n\nMan nimmt die Regeln von Riot - Welche, mal nebenbei, mit jedem unausbalancierten neuen OP-Champion aktiv Einfluss nehmen wer gewinnt und wer nicht (Siehe Darius in den letzten Worlds - 2 Pentas nach 12 Spielen nach seinem Rework) - und führt sie das in URF noch mehr ins Lächerliche. Oder willst du behaupten das ein Match welches (wie so oft) durch das Picken von bestimmten Champions (Azir, Zed, MF, Ekko, Urgot) bereits vorentschieden ist, fair ist?\n\nURF mag zwar keine Regeln haben, aber wenn RIOT Aurelion Sol-Spieler nur deswegen 6 Sterne gegeben hat damit er auch weiter nichts ausrichten kann gegen E-Spam-MF, Schatten-Flash-Zed, Jump-Cheat-LeBlanc und viele andere, dann hätten sie sie sich die Mühe sparen können und alles außer Assassinen und ADC´s gleich normal lassen können weil sie eh verlieren.\n\nRemember: URF gewinnt nicht wer Kämpfe lange überlebt - es gewinnt nur der der den meisten Extrem-Burst-Schaden raushaut. Das Team mit Assassin und ADC gewinnt eh, Tanks, Mages, Supporter und all die Subklassen können einpacken.\n\nDie neue Art von URF: Spiel nur Schadensklassen, denn alles andere ist GG. Und das passt ja gut zu Tryhards und Cheatern, oder? Gewinnen, egal mit welchen Mitteln. Glücklicherweise gibt Riot diese Mittel aus Unwissenheit :) Frage dich nur mal wieso Hecarim in vielen vorherigen URFs gebannt wurde - wurde das gemacht weil er keinen Spaß bringt? Oder weil er durch URF unschlagbar wurde, wie eine MF die nichtmal in den Kampf treten muss solange sie ihr E spammen kann? Oder ein Zed, der einen Flash jede 5. Sekunde hat? Oder ist in URF die CD nur 2 Sekunden?^^","replies":[{"poster":"Lagbeard","date":"2016-04-23T15:07:24.400+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=LokiOdinson,realm=EUW,application-id=Wj1wcocU,discussion-id=ANyLvebH,comment-id=000000010000000000000000,timestamp=2016-04-23T14:23:53.014+0000)\n>\n> Ganz einfach: Eine MF zu spielen die dauernd nur ihr E spammt - gerade jetzt in URF der Fall, ebenso wie der Schatten-Flash-Zed - ohne jegliches Risiko eingehen zu müssen da sie ihr E aus einer Reichweite spammen kann die du nicht überbrücken kannst. Das ist Cheaten.\n\nNein, das ist eine vom Spiel erlaubte und unterstützte Kampfhandlung. Es wurde weder der Programmcode verändert, noch wurde illegale Drittanbieter Programme benutzt. Es ist nicht verbotenes geschehen.\n\n> [{quoted}](name=LokiOdinson,realm=EUW,application-id=Wj1wcocU,discussion-id=ANyLvebH,comment-id=000000010000000000000000,timestamp=2016-04-23T14:23:53.014+0000)\n> \n>Man nimmt die Regeln von Riot - Welche, mal nebenbei, mit jedem unausbalancierten neuen OP-Champion aktiv >Einfluss >nehmen wer gewinnt und wer nicht (Siehe Darius in den letzten Worlds - 2 Pentas nach 12 Spielen nach >seinem Rework) - >und führt sie das in URF noch mehr ins Lächerliche. Oder willst du behaupten das ein Match >welches (wie so oft) durch >das Picken von bestimmten Champions (Azir, Zed, MF, Ekko, Urgot) bereits >vorentschieden ist, fair ist?\n\nNatürlich ist es Fair, denn auch wenn einige Champs immer stärker sind als andere, so haben BEIDE Teams die Möglichkeit, diese Champs zu Bannen oder zu Picken und man kann auf diese Picks reagieren und das eigene Team anpassen. Es geht nicht darum auf Teufel komm raus OP Picks zu sichern, sondern seine Picks mit einer Strategie zu einer Teamkomp zusammenzufügen. Darius hatte in den letzten Worlds übrigens eine Winratio von 50%. \n\n\n> [{quoted}](name=LokiOdinson,realm=EUW,application-id=Wj1wcocU,discussion-id=ANyLvebH,comment-id=000000010000000000000000,timestamp=2016-04-23T14:23:53.014+0000)\n>Jump-Cheat-LeBlanc\n\nAuch hier wurde weder der Programmcode geändert noch ein Drittanbieterprogramm verwendet. Ergo: Kein Cheat.\n\n\n> [{quoted}](name=LokiOdinson,realm=EUW,application-id=Wj1wcocU,discussion-id=ANyLvebH,comment-id=000000010000000000000000,timestamp=2016-04-23T14:23:53.014+0000)\n>\n>Die neue Art von URF: Spiel nur Schadensklassen, denn alles andere ist GG. Und das passt ja gut zu Tryhards und >Cheatern, oder? Gewinnen, egal mit welchen Mitteln. Glücklicherweise gibt Riot diese Mittel aus Unwissenheit :) >Frage dich nur mal wieso Hecarim in vielen vorherigen URFs gebannt wurde - wurde das gemacht weil er keinen >Spaß bringt? Oder weil er durch URF unschlagbar wurde, wie eine MF die nichtmal in den Kampf treten muss >solange sie ihr E spammen kann? Oder ein Zed, der einen Flash jede 5. Sekunde hat? Oder ist in URF die CD nur 2 >Sekunden?^^\n\nMag sein, dass URF schlecht balanciert ist. Aber wie du schon sagtest: RIOT gibt diese Mittel selbst. Daher kann man RIOT vielleicht einen Vorwurf machen, nicht aber den Spielern, die sie Regelkonform(!) nutzen. \n\nUnd was das Tryharden angeht: Solange du dich an die Regeln hälst, war in LoL schon immer der Sieg wichtig. Es gibt meiner Meinung nach kein \"tryharden\". Du gehst in die Kluft und entweder du gewinnst oder du verlierst. Dazwischen läuft das Spiel, in dem du dein Ding durchziehst und das beste raushaust, was du kannst. Wenn du nicht gewinnen willst, warum spielst du dann? Macht dir das gewinnen keinen Spaß?","replies":[{"poster":"LokiOdinson","date":"2016-04-23T15:48:50.468+0000","up_votes":1,"down_votes":2,"body":"> Ehrlich gesagt verstehe ich nicht, wie du Leuten vorwerfen kannst, ein Spiel zu beugen oder gar Regeln zu brechen, wenn du mir nicht die Regel nennen kannst, die Gebeugt oder gebrochen wurde.\n\nEhrlich gesagt verstehe ich nicht wie du Leute verteidigen kannst die betrügen. Denen jedes Mittel recht ist - sei es ein Cheat von Drittanbietern oder das ausnutzen von überbufften, unausbalancierten Champions von Riot selbst (was kaum einen Unterschied macht) - um den fairen Wettkampf mit unlauteren Mitteln zu beugen um seine Siegeschancen mit unlauteren Mitteln zu seinen Gunsten zu biegen.\n\nVielleicht liegt es aber auch daran das du selbst jemand bist der liebend gerne sich an Meta´s klammert um einem fair ausbalancierten Match aus dem Weg zu gehen, was dir den Sieg durchaus leicht macht, auch wenn es durchaus auch bis zu einem gewissen Grad an Betrug grenzt, denn immerhin zeichnet ein ehrlicher Wettkampf aus das nur die Spieler entscheident sind wer gewinnt - nicht die Spielsteine.\n\nGewiss hast du (wieder) eine andere Ansicht und das ist okey. Als Prediger in der Wüste aus Ehrlosigkeit und wo Gewinnen die Mittel (fair und auch unfair) heiligt, bin ich Spieler wie dich gewohnt, von daher... lasse ich es ab hier. Ich habe meine Meinung gesagt und finde es nun sinnlos sie gegen Leuten wie deinesgleichen auch noch verteidigen zu müssen.\n\n\nJa, in URF sollten Champions gebannt werden die einen Kampf gewinnen ohne wirklich darum kämpfen zu müssen, indem sie aus sicherster Entfernung oder mit betrügerischen Tricks arbeiten, ohne das RIOT der Fairness wegen eingreift.","replies":[{"poster":"TerrorRaven","date":"2016-04-23T17:43:24.090+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=LokiOdinson,realm=EUW,application-id=Wj1wcocU,discussion-id=ANyLvebH,comment-id=00000001000000000000000000000000,timestamp=2016-04-23T15:48:50.468+0000)\n>\n> Ehrlich gesagt verstehe ich nicht wie du Leute verteidigen kannst die betrügen. Denen jedes Mittel recht ist - sei es ein Cheat von Drittanbietern oder das ausnutzen von überbufften, unausbalancierten Champions von Riot selbst (was kaum einen Unterschied macht) - um den fairen Wettkampf mit unlauteren Mitteln zu beugen um seine Siegeschancen mit unlauteren Mitteln zu seinen Gunsten zu biegen.\n> \n> Vielleicht liegt es aber auch daran das du selbst jemand bist der liebend gerne sich an Meta´s klammert um einem fair ausbalancierten Match aus dem Weg zu gehen, was dir den Sieg durchaus leicht macht, auch wenn es durchaus auch bis zu einem gewissen Grad an Betrug grenzt, denn immerhin zeichnet ein ehrlicher Wettkampf aus das nur die Spieler entscheident sind wer gewinnt - nicht die Spielsteine.\n> \n> Gewiss hast du (wieder) eine andere Ansicht und das ist okey. Als Prediger in der Wüste aus Ehrlosigkeit und wo Gewinnen die Mittel (fair und auch unfair) heiligt, bin ich Spieler wie dich gewohnt, von daher... lasse ich es ab hier. Ich habe meine Meinung gesagt und finde es nun sinnlos sie gegen Leuten wie deinesgleichen auch noch verteidigen zu müssen.\n> \n> \n> Ja, in URF sollten Champions gebannt werden die einen Kampf gewinnen ohne wirklich darum kämpfen zu müssen, indem sie aus sicherster Entfernung oder mit betrügerischen Tricks arbeiten, ohne das RIOT der Fairness wegen eingreift.\n\nIch verstehe deine Argumentation in keinster Weise. Wenn ein Champ zu stark ist, ist das kein Betrug, sondern \"Gamedesign\" (was nebenbei den meisten aktuellen Spielen fehlt) bzw. \"Balancing\". Es ist nicht verboten, wenn man einen Champ spielt, der in der aktuellen meta besonders stark ist und ist daher nicht gleichzusetzen mit den Nutzen von Cheatsoftware von Drittanbieter. Deiner Logik nach säßen in der LCS, LCK, ect. nur Betrüger, weil die Champs spielen, die zur Zeit sehr stark sind. Balancprobleme sind nun mal in LoL vorhanden und man muss wohl oder übel damit auskommen und das Beste daraus machen, bis Riot es bei einem Update ändert. Da LoL aber inzwischen extrem gewachsen ist mit über 130 Champs, werden wir wohl nie ein 100% ein Spiel haben, was restlos ausgeglichen ist. Lediglich DOTA 2 kommt beim vergleichbaren Umfang an die Bezeichnung \"Balanced\" sehr nah ran.","replies":[{"poster":"LokiOdinson","date":"2016-04-23T20:01:50.167+0000","up_votes":1,"down_votes":2,"body":">  Balancprobleme sind nun mal in LoL vorhanden und man muss wohl oder übel damit auskommen und das Beste daraus machen, bis Riot es bei einem Update ändert.\n\nAlso ebenfalls betrügen? Wie die \"Profis\" in den LCS? Oder glaubst du wirklich das auch nur einer von ihnen nicht \"betrügen\" würde mit einem OP-Champion, um an das Preisgeld zu kommen? Oder auch nur wenigsten für einen Sieg? Die sind doch die Speerspitze der Philosophie \"Der Sieg heiligt die Mittel, egal ob legal oder nicht\".\n\n> Da LoL aber inzwischen extrem gewachsen ist mit über 130 Champs, werden wir wohl nie ein 100% ein Spiel haben, \n\nWer ist daran schuld? Riot selbst, also keine Ausrede für sie für schlechtes Balancing, sondern ein Grund für Shitstorm jeglicher Art. Ihr Job und den sollen sie gefälligst auch machen.\n\n\n> Lediglich DOTA 2 kommt beim vergleichbaren Umfang an die Bezeichnung \"Balanced\" sehr nah ran.\n\nSchonmal etwas von \"SMITE\" gehört? Ist kleiner und jünger als LoL, zählt aber zu den besten ausbalancierten Spielen überhaupt. Denk mal darüber nach ob es \"unmöglich\" ist oder einfach nur \"einfacher\" die Balance unausgeglichen zu lassen.","replies":[{"poster":"TerrorRaven","date":"2016-04-23T21:25:00.994+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=LokiOdinson,realm=EUW,application-id=Wj1wcocU,discussion-id=ANyLvebH,comment-id=0000000100000000000000000000000000000000,timestamp=2016-04-23T20:01:50.167+0000)\n>\n> Also ebenfalls betrügen? Wie die &quot;Profis&quot; in den LCS? Oder glaubst du wirklich das auch nur einer von ihnen nicht &quot;betrügen&quot; würde mit einem OP-Champion, um an das Preisgeld zu kommen? Oder auch nur wenigsten für einen Sieg? Die sind doch die Speerspitze der Philosophie &quot;Der Sieg heiligt die Mittel, egal ob legal oder nicht&quot;.\n> \n> Wer ist daran schuld? Riot selbst, also keine Ausrede für sie für schlechtes Balancing, sondern ein Grund für Shitstorm jeglicher Art. Ihr Job und den sollen sie gefälligst auch machen.\n> \n> Schonmal etwas von &quot;SMITE&quot; gehört? Ist kleiner und jünger als LoL, zählt aber zu den besten ausbalancierten Spielen überhaupt. Denk mal darüber nach ob es &quot;unmöglich&quot; ist oder einfach nur &quot;einfacher&quot; die Balance unausgeglichen zu lassen.\n\nHui, da hat sich aber eine Menge Hass in dir aufgestaut. Das Balancing nicht unbedingt zu ihren Stärken gehört ist denke ich kein Geheimnis. Wobei das sich im Vergleich zu früher gebessert hat (ich erinnere mal an Jax mit 100% Ausweich-Chance, DFG, AP-Yi, als LeBlance, Kassadin und Talon noch einen Silence hatten, Ryze mit Perma-Snare und vielen mehr) Trotzdem ist deine Reaktion völlig überzogen, unsachlich und ohne jegliche Grundlage. Es gibt keine Regel, die einem verbietet, etwas zu spielen, was besonders stark ist. \nWeswegen soll es Betrug sein, wenn man einen Champ bzw. Champ-Gruppe spielt, die gerade besonders stark ist? Dann kann man gleich \"Mirror One for All\" als einzigen Modus einführen, wo dann jeder den selben Champ spielt.\nVon Smite habe ich nur am Rande gehört.","replies":[{"poster":"LokiOdinson","date":"2016-04-25T08:34:41.713+0000","up_votes":1,"down_votes":0,"body":"Es ist kein Hass - es ist Enttäuschung. Ich bin enttäuscht davon das Riot es nicht gebacken bekommt sich Zeit zu nehmen um Champions - egal ob neu oder nach Rework oder überhaupt nach jedem Patch - auf einer Ebene zu halten das es auch wirklich fair ist. Sie haben Geld um die asiatischen Progamer auch in Zukunft zu bezahlen (selbst nachdem diese sich beschweren das die Preisgelder zu klein wären) und um ganze Stadions zu mieten und Coca-Cola-Logos zu zeigen, aber von dem ganzen Geld mal anständige Leute für das Balancing nutzen? Oder alte Champs erst nach halben oder ganzen Jahren zu reworken, während jeder 3. Monat im Zeichen eines neuen Champions steht? Da fehlt mir Verständnis für. Ebenso für alle Leutchen die sagen \"Ach, die haben doch 130 Champions, die können sie nicht Balancen\". Entschuldige, aber wer ist den Schuld an 130 unausgeglichenen Champions? Riot selbst und kein anderer. Dann zu sagen das man Nachsicht und Verständnis für sie haben soll ist einfach nur falsch. Und im Vergleich zu früher hat sich viel verändert - nicht nur LoL, sondern z.B.  auch die Politik. Doch es gibt ja auch genug Menschen die - berechtigt - die Politik von heute kritisieren, anstatt - wenn wir deine Philosophie übertragen würden - zu sagen \"Wir sollten froh sein, wir hatten doch früher den Nationalsozialismus\".\n\nDu sagst es selber: \n> Das Balancing nicht unbedingt zu ihren Stärken gehört ist denke ich kein Geheimnis.\n\nDas ist aber traurig für ein Weltbekanntes Unternehmen das auf schlechtem Balancing versucht ganze Weltmeisterschaften mit Preisgeldern für über zehntausend Dollar als \"fair\" darzustellen. Und die Mirror Matches haben wir doch schon jetzt: Geh in Urf rein und du wirst Shaco entweder gepickt oder gebannt sehen, genauso wie du jeden neuen OP-Champion im Normal gepickt oder gebannt siehst. Das ist der selbe Effekt: in jedem Spiel würde jeder sie gerne nehmen wollen wenn sie es können. Man kann also sagen das jedes Match auf jeden Fall ein Mirror Match wäre wenn man wirklich die Chance hätte doppelt und dreifach zu picken. Pro Picks zeigen es ja auch: Wenn es um Preisgelder geht dann wird nicht das gepickt was Spaß macht, sondern das was gewinnt - nichts anderes. Unausbalancierte Champions sind da Gold wert und Skrupel haben die ja auch nicht.\n\nSollte also eines Tages Riot es wirklich geschafft haben ein faires, ausgeglichenes Matchmaking mit ausgeglichenen Champions bewerkstelligt zu haben, dann nicht wegen Leuten die ihn sanft auf die Schulter klopfen und ihnen sagen \"Ihr gebt schon euer Bestes\", sondern Leuten die ihnen in den Po treten und sie anbrüllen \"Das könnt ihr besser!\"\n\n\nPS (und sorry für den langen Text, denn das habe ich nicht kommen sehen, aber so muss das mal gesagt werden):\n\n> Von Smite habe ich nur am Rande gehört.\n\nDann solltest du es mal versuchen, um zu wissen was möglich ist wenn man sich anstrengt, anstatt nach Ausreden zu suchen hinter denen sich Riot verstecken kann und bereits macht.","replies":[]}]}]}]}]}]}]}]},{"poster":"SeaHorseCalamity","date":"2016-04-23T11:25:00.881+0000","up_votes":1,"down_votes":0,"body":"um eins klarzustellen: in urf geht es nciht um balance. assassinen sind stark, man kann sie aber auch sehr gut countern (auch zhoyas hat geringeren cooldown, sowie alle cc fähigkeiten.)\nich hab z.B. mit shen schon einigen zedspielern heute das spiel verdorben.\nwenn man keine assassinen mehr hat, haben einige champs keinen counter mehr. (finde also den fehler: du willst die champs, die für natürliche balance da sind aus dem game entfernen, wodurch bei anderen viel von der countermöglichkeit verloren geht)\n\nim urf ist nahezu jeder champion lächerlich op, wenn man weiß was man tut. nur weil wahrschienlich deine lieblingschamps von assassinen gecountert werden, heißt das noch nicht, dass man nichts gegen sie tun kann.","replies":[{"poster":"LokiOdinson","date":"2016-04-23T14:06:15.158+0000","up_votes":1,"down_votes":0,"body":"Und das sagst du in einem Tread den nichtmal ich eröffnet habe?^^\n\nOffenbar teilen andere die gleiche Meinung. Nur weil dein Lieblingschamp ein Assassine ist - vermutlich Zed oder vielleicht doch ein ADC wie MF, also zwei in URF unschlagbare Champions - heißt das nicht dass du bei Entscheidung, Assassinen zu bannen, mitreden solltest. Das wäre so als würde man Cheatern erlauben mitzureden ob man Cheats verbieten sollte.","replies":[]}]}]}]}]}]},{"poster":"TerrorRaven","date":"2016-04-23T13:04:06.723+0000","up_votes":1,"down_votes":0,"body":"Du hast anscheinend das Prinzip hinter URF wohl ein wenig falsch verstanden. URF ist quasi wie der \"Unendlich Munition\"-Cheat in Ego-Shootern.\nWenn du alle Assasins aus den Modus entfernen willst, kannst du gleich den ganzen Modus entfernen. Jeder Champ hat in den Modus irgendwas, was OP ist. \n\nTeemo mit Perma-Blind und Pilz-Spam\nGaren, der ewige Bayblade\nSona mit AOE-Heal-Spam\nLeona, vor der man quasi nicht entkommen kann\nRiven, die mehr Zeit mit Hüpfen und Dashen als mit Laufen verbringt\nHecarim, der unaufhaltsame Hubschrauber\nDer unfangbare Ezreal\nVladimir mit seinen unzähligen Pool-Partys\nusw.\n\nURF ist quasi ein Cheat-Modus, wo Balancing zweitrangig ist.","replies":[{"poster":"Haudruppmoor","date":"2016-04-26T07:29:38.773+0000","up_votes":1,"down_votes":0,"body":"> Jeder Champ hat in den Modus irgendwas, was OP ist.\n\nSeh ich auch so.\n\nAber Garen is dooof, der bringt net soviel. Ahri is da schon besser und sogar Tristana geht ab wie Zäpfchen, die reinste Hupfdohle. Sind aber immer noch squishy, wie alle Assasins was auch ihre Schwäche ist die der TE mal ausnutzen sollte. \n\n\nmfg\nMB","replies":[]},{"poster":"Sirrkas","date":"2016-04-23T18:18:38.445+0000","up_votes":1,"down_votes":0,"body":"Bermudadreieck-Bard, Fang-mich-wenn-du-kannst-LB/Shaco sind auch mit von der Party^^","replies":[{"poster":"TerrorRaven","date":"2016-04-23T18:51:11.521+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sirrkas,realm=EUW,application-id=Wj1wcocU,discussion-id=ANyLvebH,comment-id=00040000,timestamp=2016-04-23T18:18:38.445+0000)\n>\n> Bermudadreieck-Bard, Fang-mich-wenn-du-kannst-LB/Shaco sind auch mit von der Party^^\n\nNur die Permaheulsuse Amumu ist mal wieder nicht eingeladen worden.{{sticker:slayer-jinx-wink}}","replies":[{"poster":"Sirrkas","date":"2016-04-23T20:22:00.386+0000","up_votes":1,"down_votes":0,"body":"Der konnte die Einladung nicht entziffern, weil die Schrift von seinen Tränen völlig verwischt wurde (er weint noch, weil Draven seine Party geklaut hat).","replies":[]}]}]}]},{"poster":"Gang Hei","date":"2016-04-25T10:55:42.533+0000","up_votes":1,"down_votes":0,"body":"win = fun, tryhard = win --> tryhard = fun\n\nn00bz 0mfg r0flmao l0l","replies":[]},{"poster":"wolf454","date":"2016-04-24T00:46:53.160+0000","up_votes":1,"down_votes":0,"body":"Zed geht voll klar in urf^^\nIch Main annie und die zerstört zed locker (klar kommt schaden durch aber meist nie genug und der kill ist Safe für mich^^) \nUnd nein ich try harde nicht als anime es macht für mich einfach nur Spaß sie zu spielen und zu bürsten muhaha^^\nEdit ich finde das balanciert im normalen Spiel super^^ Grundregel ist immer wenn du deinen champ besser beherrschst als der Gegner gewinnst du auch^^","replies":[]},{"poster":"Schesam","date":"2016-04-23T11:06:14.850+0000","up_votes":1,"down_votes":0,"body":"Shaco und Fizz wird für mich in Urf immer permabann sein, da das einfach abnormal ist... Fizz mit ner gefühlten Sekunde cd auf seiner e ist einfach toxic as fck.","replies":[{"poster":"Good Guy Putin","date":"2016-04-24T00:34:44.973+0000","up_votes":1,"down_votes":0,"body":"Die beiden banne ich auch immer. Aber auch weil ich sie sowieso hasse :D","replies":[]},{"poster":"Enderized","date":"2016-04-23T11:53:29.554+0000","up_votes":1,"down_votes":0,"body":"1.8 sekunden :D","replies":[]}]},{"poster":"SeaHorseCalamity","date":"2016-04-23T11:18:37.604+0000","up_votes":1,"down_votes":0,"body":"wenn ich das richtig verstehe: du willst assassinen bannen, weil die sie nicht magst und sie op sind. sie machen aber ungaublich viel spaß zu spielen.\nallerdings sind auch viele andere lächerlich stark im URF. hab mit shen schon einigen leuten den spaß versaut und galio ist auch nicht besser. der helicopterhecarim hat auch seine berechtigung. es ist meiner meinung nach also ziemlich unabhängig von der rolle des champions, ob sie zu stark sind. es hängt davon ab, wie stark die von urf profitieren, was viele champs tun, nicht nur assassinen.","replies":[]},{"poster":"LokiOdinson","date":"2016-04-23T10:22:12.582+0000","up_votes":1,"down_votes":5,"body":"Dazu muss man aber auch sagen das es nicht nur Assassinen betrifft.\n\nKleines Beispiel: Aurelion Sol ist nutzlos mit seinen 5 od. 6 Sternen, wenn eine MF - hier der Kritikpunkt - **ab Level 1 ihr e spammen kann. Reichweite, e, weglaufen (e funktioniert derweile immernoch), Reichweite, e, weglaufen.**\n\nBraucht keinen Skill für sowas, aber Riot durchdenkt sowas ja nur halb.","replies":[{"poster":"D4RKEVA","date":"2016-04-23T18:06:39.650+0000","up_votes":1,"down_votes":0,"body":"Aurelion sol ist auch kacke in urf ...\n\nMf aber auch\n\n\n\nPick maokai/blitz/lb/zed/ekko/ahri/shaco/lux/morgana etc etc und kill sie","replies":[]}]}]}