{"poster":"Dom2","date":"2018-02-06T18:27:15.374+0000","title":"Mordekaiser","subforum":"Campioni e gameplay","up_votes":1,"down_votes":2,"body":"2 anni a mandare tiket x mordekaiser e oggi ho scoperto che c'era un fortum apposta :(\r\nCe` la possibilita` di avere il vecchio kit di mordekaiser visto che da quando e` stato reworkato non se lo incula piu` nessuno?\r\nIn realta` mi bastarebbe avere semplicemente la vecchia Q visto che la nuova e` fottutamente lenta xD.\r\n grazie","replies":[{"poster":"mangialavandini","date":"2018-02-06T21:25:48.318+0000","up_votes":1,"down_votes":0,"body":"nope, non c'è un modo.\n\nMa sono sicuro che fra poco comparirà un caro main Mordekaiser che ti dirà il contrario.","replies":[{"poster":"Dom2","date":"2018-02-07T10:42:21.896+0000","up_votes":1,"down_votes":0,"body":"lo spero almeno vedo come la vede un main, essendo stato main di questo champ prima del rework ora fatico tanto infatti non los to piu` pickando, ed e` un peccato visto che e` stato sto champion a farmi appassionare di questo gioco","replies":[{"poster":"mangialavandini","date":"2018-02-07T10:53:30.161+0000","up_votes":2,"down_votes":0,"body":"Strano non abbia già commentato, comunque ecco a te lo storico.\n\n http://euw.op.gg/summoner/userName=FINAL+LINKIMARU\n\ne questa è un build for fun\n\n https://boards.euw.leagueoflegends.com/it/c/discussioni-generali-it/HlZptGZ6-speed-god-morde-new-meta-breaker-op-build\n\nIn caso prova ad aggiungerlo e chiedi a lui","replies":[]}]},{"poster":"Windkai","date":"2018-02-13T23:18:01.999+0000","up_votes":1,"down_votes":0,"body":"Bè sono morde main con ben 400k mastery e ti posso dire che morde è forte ma fatica contro certi champion broken..tipo xerath, zoe, velkoz, kassadin (mid), darius, pantheon, irelia, heimerdinger (top) e poi adc non se ne parla...","replies":[]}]},{"poster":"Power Mac","date":"2018-02-07T08:17:24.756+0000","up_votes":1,"down_votes":0,"body":"Senza essere neanche lontanamente main, secondo me l'attuale kit di Mordekaiser (diverso ma pur sempre non un rework totale) è enormemente superiore al vecchio. La E era inutile in passato, la W non curava e la R non ti dava il drago. Inoltre, ora hai una percentuale garantita di scudo. La Q sarà anche più lenta ma ora fa molto più danno, soprattutto al terzo colpo. Al massimo, abbisogna di un nuovo aggiornamento delle abilità!","replies":[{"poster":"Dom2","date":"2019-05-19T15:07:02.280+0000","up_votes":1,"down_votes":0,"body":"si vede che non lo hai mai giocato allora :)\ncome dicevo basterebbe la vecchia q niente di piu`","replies":[{"poster":"Power Mac","date":"2019-05-20T08:59:55.782+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Dom2,realm=EUW,application-id=cAOZwaUi,discussion-id=2E1IwWJi,comment-id=00010001,timestamp=2019-05-19T15:07:02.280+0000)\n>\n> si vede che non lo hai mai giocato allora :)\n> come dicevo basterebbe la vecchia q niente di piu`\n\nInutile che fai il sarcastico, è stato uno dei primi campioni che ho giocato, e fino a un po' di tempo fa era il mio miglior toplaner. La vecchia Q non faceva neanche la metà dei danni dell'attuale, soprattutto al terzo colpo, senza contare lo scaling sia con ap che con ad (ottimo per la hextech gunblade). Fatti due domande se nessuno la chiede indietro (magari gira il forum americano e vediti i suoi 172 o giù di lì bug): le urgenze di Morde sono ben altre, e per fortuna tra qualche mese vedremo il rework.\nTra l'altro, rispondi di nuovo ad un vecchissimo commento contraddicendoti pure? Not bad at all.","replies":[]}]},{"poster":"Dom2","date":"2018-02-07T10:40:32.464+0000","up_votes":1,"down_votes":0,"body":"ciao non sono d`accordo prima avevi comunque un discreto sustain semplicemente tirando una Q (avendo gia lo spellvamp) La E era il suo punto di forza infatti con una E ben piazzata riuscivi sia a farmare che fare un buon trade, che ora la ulti ti da il drago lo trovo figo ed utile .\nIo infatti l`unica cosa che non mi piace di questo nuovo mordekaiser e la Q molto lenta e macchinosa e non puoi permeterti di dare 3 basic attack per arrivare al max dmg visto che ci sono champion cn 2 skill tirano giu` un team {{champion:134}} {{champion:142}} {{champion:101}}","replies":[]}]},{"poster":"P R O Void Omen","date":"2018-02-07T13:07:54.882+0000","up_votes":1,"down_votes":0,"body":"Visto che ho ripreso questo Champ da poco, posso dire che è infinitamente divertente, stamattina ero 0/5/2 e ho finito il game 15/8/12 xD, ho fightato 1 Vs 3 per 5 minuti uccidendo tutti, poi sono respownati e li ho killati di nuovo da solo, morendoci, però è stato divertente. Alla fine del game ho controllato i danni e, in un game di 31 minuti, ho fatto la bellezza di 200.000 danni magici circa","replies":[]}]}