{"poster":"googaingan","date":"2020-01-06T04:18:41.335+0000","title":"Why does Riot control chat so intensely?","subforum":"Player Behavior","up_votes":1,"down_votes":20,"body":"I've never understood what's wrong with \"toxicity\". Every function a player has in this game is optional and mutable. Muteable pings, muteable chat, disabled chat, blocking, etc. Why is text chat in a video game censored and punished so heavily??? If your a typical 30+ account playing ranked, you know league, you've heard and seen things and outside of that, people in the real world know league is a toxic wasteland. All Riot's system does is provide benefit to those who can avoid the detection of the system or those who are passive-aggressive, stoking the fires of the truly toxic players, who then go crazy in chat and then receive punishment. But not the person who spam pings ?'s and provokes people non-directly. Go to any \"gamer\" you know and ask them about league's community. More often than not, in real life and the internet, the consensus is that league has an awful, toxic community. Clearly, the bans and chat restrictions have barely curbed toxicity and just loses loyal players and money, so why not change the system to something more realistic, perhaps more on Mute culture or a better profanity filter. I just don't get why people should have to change and hide who they are just because others don't understand how to use the functions the game provided. \n\nedit: yes free speech doesnt apply to companies\n\nnvm forget Tencent own's it all which means [~~if whinnie the pooh doesnt like it, it go bye bye~~](https://www.polygon.com/2019/10/11/20910127/riot-games-hong-kong-protests-statement)","replies":[{"poster":"GatekeeperTDS","date":"2020-01-06T04:27:03.014+0000","up_votes":10,"down_votes":2,"body":"This free speech shit again. League is Riot's living room. Just as you control your own living room, they control theirs. Follow the rules or one way or another, you won't be playing.","replies":[]},{"poster":"DuskDaUmbreon","date":"2020-01-06T04:34:17.562+0000","up_votes":5,"down_votes":0,"body":"Because toxicity leads to tilt, which leads to feeding (intentional or otherwise). You can mute it, sure, but that doesn't mean you didn't already have to listen to it.\n\n>people in the real world know league is a toxic wasteland\n\nSo...why should Riot do nothing to fix that? That's like seeing your bathroom is disgusting then refusing to clean it *because* it's disgusting.","replies":[{"poster":"googaingan","date":"2020-01-06T04:39:52.223+0000","up_votes":1,"down_votes":7,"body":"> Because toxicity leads to tilt, which leads to feeding (intentional or otherwise). \n\nTilt has existed since the dawn of man; if the point of the system is to remove tilt, there is far more they can do then just blocking out \"meanies\"\n\n> So...why should Riot do nothing to fix that? That's like seeing your bathroom is disgusting then refusing to clean it because it's disgusting.\n\nRiot Lyte goes to clean his musty ass bathroom, so he sends in 15 monkeys with toothbrushes to clean it. Why not hire a cleaner? (IE Go about cleaning the bathroom in a reasonable way. There have been too many case studies that have found just dropping ban hammers doesn't always get the results your looking for)","replies":[]}]},{"poster":"KFCeytron","date":"2020-01-06T04:21:36.685+0000","up_votes":6,"down_votes":1,"body":"Because by the time you have to mute someone's shit your experience has already been ruined.\n\nYou have a right to free speech, guaranteed by the government. However, so does everyone else. This right only protects you from the government, which is restricted from passing laws that infringe on your right to free speech, assembly, and so on. It doesn't force other private entities, such as Riot Games, to provide you with a platform and compel everyone to listen to you. We all have the right not only to speak freely, but also to not listen if we so choose. When Riot restricts your chat privileges (not a right - a privilege), they are choosing not to listen to what you have to say, and choosing not to transmit it to other players. If a theater employee asks you to quiet down during a movie, or a friend tells you not to swear at their house, or a newspaper rejects your submission, they are not infringing on your right to free speech. They are exercising their own.","replies":[{"poster":"googaingan","date":"2020-01-06T04:28:33.359+0000","up_votes":1,"down_votes":10,"body":"define a \"ruined experience\" due to toxicity. its been my firm belief that if you cant handle literal text on the internet, your chat shouldn't be on. why censor and block text? why not group the \"bad apples\" with other bad apples? ive heard dota uses a similar system, and they seem to be just as if not more popular than league.\n\n> they are not infringing on your right to free speech. They are exercising their own.\n\ni get that, it just feels off.\n\n2 other points\n\nwhile i understand restricting use of chat, why ban an account just because of in-game text?\n\nalso, i dont know how long you've played league, but over the course of your time, have you noticed chat becoming \"cleaner and cleaner\"? or has it been more or less the same. any comments on passive aggressive text?","replies":[{"poster":"KFCeytron","date":"2020-01-06T04:46:52.677+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=googaingan,realm=NA,application-id=ZGEFLEUQ,discussion-id=rEQkATfE,comment-id=00000000,timestamp=2020-01-06T04:28:33.359+0000)\n>\n> define a \"ruined experience\" due to toxicity.\n\n\"This Twisted Fate has Twisted Panties and his constant belittling me is pissing me off and making me perform even worse than I already was. I hope this match ends soon because I'm real tired of the grey screen and the 'wot a gr8 adc' flame.\"\n\n> [{quoted}](name=googaingan,realm=NA,application-id=ZGEFLEUQ,discussion-id=rEQkATfE,comment-id=00000000,timestamp=2020-01-06T04:28:33.359+0000)\n>\n> its been my firm belief that if you cant handle literal text on the internet, your chat shouldn't be on. why censor and block text?\n\nWe can handle it, but we don't want to, and we shouldn't have to.\n\n> [{quoted}](name=googaingan,realm=NA,application-id=ZGEFLEUQ,discussion-id=rEQkATfE,comment-id=00000000,timestamp=2020-01-06T04:28:33.359+0000)\n>\n> why not group the \"bad apples\" with other bad apples? ive heard dota uses a similar system, and they seem to be just as if not more popular than league.\n\nThis concept is known as \"Prisoner's Island.\" On \"Prisoner's Island\": https://nexus.leagueoflegends.com/en-us/2017/01/ask-riot-banished-to-prisoners-island/\n\n> [{quoted}](name=googaingan,realm=NA,application-id=ZGEFLEUQ,discussion-id=rEQkATfE,comment-id=00000000,timestamp=2020-01-06T04:28:33.359+0000)\n>\n> i get that, it just feels off.\n\nThat's not the Constitution's fault.\n\n> [{quoted}](name=googaingan,realm=NA,application-id=ZGEFLEUQ,discussion-id=rEQkATfE,comment-id=00000000,timestamp=2020-01-06T04:28:33.359+0000)\n>\n> while i understand restricting use of chat, why ban an account just because of in-game text?\n\nBecause Riot wants people to stop breaking the rules about in-game text so that the people with manners can have a nice time playing our video game.\n\n> [{quoted}](name=googaingan,realm=NA,application-id=ZGEFLEUQ,discussion-id=rEQkATfE,comment-id=00000000,timestamp=2020-01-06T04:28:33.359+0000)\n>\n> also, i dont know how long you've played league, but over the course of your time, have you noticed chat becoming \"cleaner and cleaner\"? or has it been more or less the same. any comments on passive aggressive text?\n\nI've been playing since 2011, and the average PvP match is as silent as a tomb. There's some praise, the occasional light/brief flame, and VERY rarely some \"wow why is this person not permabanned\" stuff. Like, a few times a year, if that. It's a bit more lively in co-op (when all the players are humans and not leveling scripts, anyway). I haven't noticed much change over time.","replies":[{"poster":"googaingan","date":"2020-01-06T05:13:38.846+0000","up_votes":1,"down_votes":3,"body":"> \"This Twisted Fate has Twisted Panties and his constant belittling me is pissing me off and making me perform even worse than I already was. I hope this match ends soon because I'm real tired of the grey screen and the 'wot a gr8 adc' flame.\"\n\n\n\"constant\" why not mute after the first message?\n\n> I've been playing since 2011, and the average PvP match is as silent as a tomb. \n\nlucky you, i dont know if its mmr difference or what, but i dont have that pleasure.\n\n> We can handle it, but we don't want to, and we shouldn't have to.\n\nthen mute.\n\n\n> prisoners island\n\nokay? why not? riot sums up this concept by writing it off as \"anti-reform\" which doesn't make sense.\nwhy not use a similar system to matchmaking? assign players a score based on behavior and q with similarly scored players?\nsimilar to the commies system, and I know riots huge fans of them","replies":[{"poster":"KFCeytron","date":"2020-01-06T05:19:22.767+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=googaingan,realm=NA,application-id=ZGEFLEUQ,discussion-id=rEQkATfE,comment-id=0000000000000000,timestamp=2020-01-06T05:13:38.846+0000)\n>\n> \"constant\" why not mute after the first message?\n\nFor the same reason I'm still in this thread: the hope that things will improve if I give them a chance. But even after the first message, the damage has been done.\n\n> [{quoted}](name=googaingan,realm=NA,application-id=ZGEFLEUQ,discussion-id=rEQkATfE,comment-id=0000000000000000,timestamp=2020-01-06T05:13:38.846+0000)\n>\n> lucky you, i dont know if its mmr difference or what, but i dont have that pleasure.\n\nWell, climb the ladder, I guess.\n\n> [{quoted}](name=googaingan,realm=NA,application-id=ZGEFLEUQ,discussion-id=rEQkATfE,comment-id=0000000000000000,timestamp=2020-01-06T05:13:38.846+0000)\n>\n> then mute.\n\nThen behave. Muting means someone has already gotten annoyed.\n\n> [{quoted}](name=googaingan,realm=NA,application-id=ZGEFLEUQ,discussion-id=rEQkATfE,comment-id=0000000000000000,timestamp=2020-01-06T05:13:38.846+0000)\n>\n> okay? why not? riot sums up this concept by writing it off as \"anti-reform\" which doesn't make sense.\n> why not use a similar system to matchmaking? assign players a score based on behavior and q with similarly scored players?\n> similar to the commies system, and I know riots huge fans of them\n\nIt makes perfect sense. If toxic players just get tossed in with more toxic players instead of being encouraged to improve their behavior, they'll simply get more toxic. That's very clearly anti-reform.\n\nKnow what's even easier for most people than muting at the first sign of trouble? Behaving ourselves.","replies":[{"poster":"googaingan","date":"2020-01-07T00:30:52.418+0000","up_votes":1,"down_votes":3,"body":"> even after the first message, the damage has been done.\n\nwhat damage??? why is everybody who plays this game so sensitive?\n\n> Behaving ourselves.\n\na lesson in life is that not everybody does that. we live in the real world, not riot's dystopian society where everyone has to put a tongue into their teammate's asshole. riots approach to \"player reform\" has failed. and it shows in player numbers, people's perspective on the game and the environment people play it in.","replies":[{"poster":"KFCeytron","date":"2020-01-07T00:50:11.875+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=googaingan,realm=NA,application-id=ZGEFLEUQ,discussion-id=rEQkATfE,comment-id=000000000000000000000000,timestamp=2020-01-07T00:30:52.418+0000)\n>\n> what damage??? why is everybody who plays this game so sensitive?\n\nThe damage of being irritated. It's not about sensitivity; it's about having to deal with irritants in a video game.\n\n> [{quoted}](name=googaingan,realm=NA,application-id=ZGEFLEUQ,discussion-id=rEQkATfE,comment-id=000000000000000000000000,timestamp=2020-01-07T00:30:52.418+0000)\n>\n> a lesson in life is that not everybody does that. we live in the real world, not riot's dystopian society where everyone has to put a tongue into their teammate's asshole. riots approach to \"player reform\" has failed. and it shows in player numbers, people's perspective on the game and the environment people play it in.\n\nAnd the life lesson for people who don't do that is that they get punished in this real world, in which Riot and their game exist. It's just like behaving yourself at a grocery store, art gallery, library, or friend's house - whenever you're interacting with people, basically. Riot holds all the cards here, so either abide by their rules (which most players agree with, by the way) and maintain an account, or don't and lose your account. It's up to you.","replies":[]},{"poster":"TrulyBland","date":"2020-01-07T01:27:11.381+0000","up_votes":2,"down_votes":0,"body":">not riot's dystopian society where everyone has to put a tongue into their teammate's asshole.\n\nIf the only way **not** to be actively negative that you can come up with is putting a tongue into your teammate's asshole, then that's on you. Most people, including some who disagree with Riot's rules, have found that the simple act of shutting up instead of flaming works well enough.\n","replies":[]}]}]}]}]}]}]},{"poster":"MagicFlyingLlama","date":"2020-01-06T05:49:17.071+0000","up_votes":4,"down_votes":0,"body":"Because nobody wants to listen to some redhat vent their incoherant rage in a game they play for fun.","replies":[]},{"poster":"Modi","date":"2020-01-06T04:44:47.805+0000","up_votes":4,"down_votes":1,"body":"> Another less well thought out point; why does a company based in America not follow the constitution, which is very liberal about free speech.\n\nLess thought out? You need to read the constitution before spouting off about free speech. Here's [the actual text of the first amendment](http://hrlibrary.umn.edu/education/all_amendments_usconst.htm):\n\n> _***~~Congress~~***_ shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof; or abridging the freedom of speech, or of the press; or the right of the people peaceably to assemble, and to petition the Government for a redress of grievances.\n\n# The first amendment has *nothing* to do with how a private entity polices speech on its private property.\n\n---\nNow that is out of the way, we can get more into the other part of your post. I'm going to do an exercise replacing some words in key excerpts of your post.\n\n>  I've never understood what's wrong with **\"law breaking\"**. ... All **the justice** system does is provide benefit to those who can avoid the detection of the system ... stoking the fires of the **other criminals**, who then go crazy and then receive punishment. ...  **the world still** has **criminals**. Clearly, **laws, jailing, and ticketing**  have barely curbed **criminality** ... I just don't get why people should have to change and hide who they are just because others don't understand how **to protect them selves and belongings from criminals**\n\nThe example is extreme hyperbole, but the argument boils down to this: \"clearly there is still toxicity in league despite banning people, why bother with banning?\" It is analogous to \"clearly there are still criminals despite the efforts of the justice system, why bother prosecuting suspected criminals?\"\n\nIt is a logical flaw to think \"because their efforts don't fix *everything*, then why bother doing *anything*?\" I don't even want to imagine what kind of nightmarish shithole this game would become if Riot removed all their chat policies.","replies":[{"poster":"googaingan","date":"2020-01-06T04:55:17.444+0000","up_votes":1,"down_votes":6,"body":"> The example is extreme hyperbole, but the argument boils down to this: \"clearly there is still toxicity in league despite banning people, why bother with banning?\"\n> It is a logical flaw to think \"because their efforts don't fix everything, then why bother doing anything?\"\n\nmy issue boils down to the \"efforts\". i can make a similar argument for our justice system, which you referenced. toxic people will remain forever and always, just as crimes in the US will forever be committed. maybe we should change the way we deal with the people who do these things. In my experience, riots punishment's dont stop players, just anger them even further.","replies":[]}]},{"poster":"Prandine","date":"2020-01-07T09:43:57.492+0000","up_votes":0,"down_votes":0,"body":"Freedom of speech does not mean freedom of speech consequences, nor does it apply to privately owned businesses such as Riot Games. For instance you can't yell \"fire!\" in a crowded theater, incite a riot or plan to kill the president and expect not to be held accountable for it. As for the mute argument, yes people should use it if need be but it's meant to be a band-aid solution at most and is not an excuse for poor behavior. If the only way you can interact with others is in a way that forces them to mute you then you're doing something wrong and need to fix it asap.\n\nAs for the punishment system angering people, in my experience the only people it angers are those who are mad that they can't get away with being jerks or bullies, &amp; rather than take responsibility for their behavior they'd rather blame others instead &amp; cry foul whenever they're actually held accountable for their actions. People seem to think that because it's a video game or the internet that it gives them a license to be a jerk and behave however they want accountability free, and that anyone who dares complain about it is an \"insert insult here\". From what I've seen it's the people who act like this who are actually the sensitive/\"insert insult here\" ones since they're the ones throwing a fit over being punished &amp; having their playthings taken away from them for poor behavior. It being the internet or a game shouldn't mean abandoning all basic forms of common sense and decency, and if someone is dead set on being hostile to others than LoL isn't for them.\n\nYes the IFS isn't perfect and needs improvements in the gameplay trolling detection department, and yes the game will never be free of toxic players (no online multiplayer game will though), but clearly it does work. We shouldn't coddle and protect the people who just want to make others miserable (and thus drive away business &amp; potential customers), but instead protect the ones who actually provide enjoyable and fun (or at the very least neutral) experiences for others.","replies":[]}]}