{"poster":"googaingan","date":"2020-01-02T03:11:46.024+0000","title":"i cant enjoy this game no matter how hard i try","subforum":"Rant","up_votes":1,"down_votes":0,"body":"been having a great time getting back into league since my new account but the second I hit ranked, I find I cannot enjoy the game whatsoever.\r\n\r\nlost all my \"Honor\" levels because I went off on a chogath who intentionally sabotaged the game and got a comfy 10 game chat restriction. this makes ranked play very difficult, obviously.\r\n\r\nthis particular game, as a S4 I play Azir bot lane, not support. my alistar, who was a higher division of silver than I was, boggled me with everything he did. he couldn't land the WQ, refused to engage at any point in lane and ran at every opportunity. upon death(mine, due to being abandoned to a cheese [Lux and Malphite] lane); \"noob\" \"fk noob\" \"noob azir\" . eventually he gave up and just stopped coming bot. leaving me alone. my words alone were: \"malp what are u doing man\" and eventually when the \"noob\"s piled up i asked him why he was being toxic and intentionally not playing the game. at this point, our JG irelia, top lane shyv both dig in on me and call me toxic, telling the alistar, and the rest of the team to mute me. our mid even gets in a dig about not understanding how to play my character. i felt like i was in the fucking twilight zone.\r\n\r\nthe other team, had an olaf jg who was in every lane, multiple times, solo'd all 4 dragons as soon as he could and all-around shit on us. our top lane lost lane, mid held. and bot lane\r\n\r\n!!!!LUX RANT!!!!\r\nWHY DOES THIS CHARACTER, MORE SO HOW HAS THIS CHARACTER BEEN ALLOWED TO BE IN SUCH A FUCKING D I S G U S T I N G SPOT FOR YEARS????????? Q SNARE IS RIDICULOUS IN LENGTH(time) AND IN LENGTH (width)! WHO THOUGHT THAT HITBOX WAS OKAY????????????????? NOT TO MENTION THE E THAT ALWAYS LANDS, BUT DONT WORRY, IF YOUR THE AVERAGE LUX PLAYER, YOUR BRAIN SHOULD BE ABOUT THE SIZE OF A DUST MITE, SO WHEN YOU INEVITABLEY MISS, ITS A FREE SINGED W AND YOU CAN REDETONATE IT FOR STUPID DAMAGE. DRUMROLLLLLLLLLLL THE 2 SECOND COOLDOWN ULTIMATE. WHAT CHARACTER IN THIS VIDEO GAME HAS BEEN ALLOWED TO HAVE THIS OVERPOWERED AN ULTIMATE FOR THIS LONG?!!?!?!??! ITS WIDE, YOU ONLY GET A BIT TO DODGE AND IT OBLITERATES ANY SQUISHY!!! AND IF YOU KILL?!?!?!? LIKE FUCKING WHAT?!!!!! 20 SECOND BASE LEVEL 3 COOLDOWN LIKE !?!?!? IS IT FOR MONEY?!?!?! SKINS ?!!? IS IT SOME SICK JOKE?!???????????? I HATE LUX PLAYERS AND THE CHARACTER SO MUCH I DONT KNOW IF YOU CAN TELL SERIOUSLY I HAVE NO GREATER HATRED IN THE WORLD WHY IS THIS OKAY?\r\n!!!!LUX RANT OVER!!!!\r\n\r\nwith the power of the lux and the full ap malph, level 6+ skirmishes were over before they began. so we lose, but not as I desperately try to play the game because the thought of being in silver for another second gives me an internal brain hemorrhage. the alistar however, continually berates me and the team by \"noob\"ing as he walks around the map, no clear objective or anything he just sorta vibed while dropping /ff's as often as he could. \r\n\r\nthis experience was awful, but I find it more frustrating then I think it would have been just at surface level. in every ranked game I play, something along these lines. A L W A Y S happens. and it's out of your control, completely out of your control. solo q? you can try your hardest, but you have 4 ?'s you have absolutely NO control over. at any point in the game, no matter how good anyone's doing, a player can turn angry, flaming everyone and beginning the slow ugly internal defeat that is chat. they could maybe, just leave the game. decide not to play with the team. it goes on and on. yet somehow, people judge Solo/Duo as the rank that \"matters\"? It is just a clustered clown fiesta, where you pick the champions riot decided to make good this week, and pray you win. I fucking loathe this game. it has taken so much from me. wasted so much of my time, yet I don't think I'll ever quit. not because its the only game my friends play anymore, not because it feels like a waste not applying years of experience and skill, and not because its fun. its so that maybe, perhaps one day I can play with that alistar again, and make him experience the least fun league experience yet experienced because that's what I just sat through, my first game of 2020. my optimism and happiness literally was thrown out the window because of how awful that game was. I was gonna say I had \"no words\" to describe it but I think I just typed plenty and my frustration should be apparent. fuck this game","replies":[{"poster":"Hitman the great","date":"2020-01-02T21:10:02.212+0000","up_votes":2,"down_votes":0,"body":"tbh, I read ur thing, first of all, if you are looking for fun, why are you playing ranked, go PBE\nsecond, like, seriously? you are silver, you should know being toxic doesn't win you the game, why don't you just mute alistar or anyone thats bothering you. common sense, please.\nthird, you are also being toxic. sorry for being harsh, but being toxic as a response to toxicness doesn't make this game any better.\nfourth, sure, lux is broken, but while she wasn't nerfed, people using them are called geniuses because they know that it will get them a win, especially if its ranked. \nfifth, go in the game with a positive attitude: in ranked, your attitude affects the outcome of the game.\nsixth, if you are just going to complain about everything, you are never going to improve, or have fun.\nseventh, you are only level 33, how are you silver 4, you smurf+idiot+stupid head and whatever. there is no way you can play ten placement games and only gain 3 levels of experience idiot.\n\nI suggest that you calm down for a bit dude.","replies":[{"poster":"googaingan","date":"2020-01-02T22:21:53.823+0000","up_votes":1,"down_votes":0,"body":"1~ I dont know if its competitive nature, but I cant have fun playing this game unless its ranked, normals arent fulfilling uses of time for me, I feel if im gonna sit and try to be good at a game, id like to be rewarded for my effort.\n2~ I dont get what I did that was toxic that game, not saying im not a toxic player but that particular game I think I only used chat like 3 times just to ask \"why\"\n3~ same as 2\n4~ which is the frustrating part about league, options and variety are sucked out of the game because if you want to win, you just pick **riots favorite champions** and  youll do great.\n5~ i try. so hard\n6~ complaining got me to plat in s5 and s6, its my belief that understanding the parts of the game that riot has fucked only helps because you understand whats viable and what isnt (kinda how azir apc isnt)\n7~ preseason i think, 10 games it threw me in s4. but i def played atleast 20+ ranked games including flex and a few ARAM's and normals and im barely 34 riots not the biggest fan of giving champions unless your the one buying it with RP.\n\ni uninstalled league, i cant play the game anymore so this is my ~~calming down~~","replies":[]}]},{"poster":"Disco Swiss","date":"2020-01-02T19:11:55.083+0000","up_votes":2,"down_votes":0,"body":"Dont play Bot\nPlaying bot without a friend is like a blindfolded dentist trying to perform surgery.\nNo one will have fun.\n\nIf youre looking for enjoyment in league you aren't going to find it in ranked. Ranked is not for fun.\n\nLux.\nLaning against her bubble blast ye that big suck.\nLux players have a dustmite brain?? Thats also true, but dont say that if youre losing to her :(","replies":[]},{"poster":"citlalli5755","date":"2020-01-02T06:30:23.664+0000","up_votes":2,"down_votes":0,"body":"I love this game so much.  it's the people who play this that make this game miserable.  this game has the worst community.","replies":[]},{"poster":"FioraWillCarry","date":"2020-01-09T21:49:19.539+0000","up_votes":1,"down_votes":0,"body":"Sounds like you were having fun in Norms, decided to try ranked only to discover you're no where near as good as you thought you were. It happens. You'll get used to it.","replies":[]},{"poster":"XAltinaOrionX","date":"2020-01-03T04:47:13.781+0000","up_votes":1,"down_votes":0,"body":"Idk how many times I uninstall league and than 2mth or 3 mths later I came back. I know we adults have other shit to do, but i can't give up on game I literally tired. I must blame the media which means Google for the majority of the news on League of Legends to keep me from missing so much.\n\noh before i forget dropping from plat to silver is kinda lying for your own rank regardless of smurf etc. Self confidence is  a great tool to have but don't over extended, or we can't take it seriously.","replies":[]}]}