{"poster":"Thomasloco","date":"2015-07-28T16:58:05.072+0000","title":"La voz de la partida","subforum":"Charlas Generales","up_votes":3,"down_votes":1,"body":"en mi opinion y creo que la de mucha gente, no estan muy contentos con la voz que relata la partida, aparte de que tiene sonidos roncos y un poco desagradables, habla mas de lo debido, tendrian que cambiar a la voz anterior, La que solo te hacias un penta para escuchar ese : P-P-P-P-PENTAKILL! y la que hablaba lo justo y necesario, no hablaba de mas ni decia cosas de muelles y rios que no tienen mucho que ver...\r\nentiendo que estamos en esto de aguasturbias y todo eso, pero eso el relator hablar de muelles y todo eso, pero creo que deberian cambiarlo, \r\n\r\nSaludos","replies":[{"poster":"ł Misery ł","date":"2015-07-28T21:17:25.609+0000","up_votes":1,"down_votes":0,"body":"Debería haber una opción para elejir el locutor (como en Dota 2).","replies":[]},{"poster":"Fantalox","date":"2015-07-28T19:45:17.747+0000","up_votes":1,"down_votes":0,"body":"A mi me gusta el nuevo anunciador, junto con la musica me hacen meterme mucho en el ambito pirata, y eso me encanta!","replies":[]},{"poster":"Dildo de Moria","date":"2015-07-28T19:16:50.915+0000","up_votes":1,"down_votes":0,"body":"Prometía mucho el cambio de anunciador pero ami tampoco me gusta :I","replies":[]},{"poster":"Airways","date":"2015-07-28T18:51:38.431+0000","up_votes":1,"down_votes":0,"body":"Ami sinceramente no me gusta :(","replies":[]},{"poster":"låan","date":"2015-07-28T18:46:47.117+0000","up_votes":1,"down_votes":0,"body":"De acuerdo, me da asco el nuevo relatador.","replies":[]},{"poster":"XVII The Star","date":"2015-07-28T17:37:20.940+0000","up_votes":1,"down_votes":0,"body":"Estuve esperando todo el evento para escuchar un penta pirata, ayer conseguí uno y no recuerdo como era jajaja.\nA mi me gusta este nuevo anunciador, pero siento que para las partidas clasificatorias debería estar desactivado.","replies":[]},{"poster":"SPC Crashk","date":"2015-07-28T17:04:15.873+0000","up_votes":1,"down_votes":0,"body":"A mi sinceramente me encanta, y si pudiera quedarme con este nuevo anunciador definitivamente me lo quedaria ^^","replies":[]}]}