{"poster":"Names Are Scarce","date":"2015-07-28T16:13:42.028+0000","title":"Corsair Quinn Eyepatch","subforum":"Report a Bug","up_votes":1,"down_votes":0,"body":"After looking at her in-game skin and her splash art, I have come to a conclusion. The eye patch in-game is on the right eye. The eye patch in the splash art is on the left eye.\n\nEdit: Actually, everything on lolking.net is a mirror image of her splash art. I don't know whether it looks that way in-game or not, but everything is on the wrong side.\n\nEdit to my edit: I just looked at her other skins. They all have her holding the crossbow in her left hand, so it's just the splash art that is wrong.","replies":[{"poster":"lightdragoon88","date":"2015-07-28T16:19:24.587+0000","up_votes":2,"down_votes":0,"body":"Quinn splash is flipped so that her image isn't block by the stats on the game page. \n\nThis is the actual splash: \n\nhttp://ddragon.leagueoflegends.com/cdn/img/champion/splash/Aatrox_3.jpg\n\n\nEdit: They did the same thing with Pool Party Zac\n\nThe Pool Party splash is this: http://ddragon.leagueoflegends.com/cdn/img/champion/splash/DrMundo_8.jpg\n\nBut for Zac, it is flipped: http://ddragon.leagueoflegends.com/cdn/img/champion/splash/Zac_2.jpg","replies":[{"poster":"Names Are Scarce","date":"2015-07-28T16:24:58.369+0000","up_votes":1,"down_votes":0,"body":"Oh, cool. Thanks for telling me. That makes sense.","replies":[{"poster":"moonstones","date":"2015-07-28T16:33:51.202+0000","up_votes":3,"down_votes":0,"body":"Yup! This is correct. It's actually not uncommon to see splash art flipped for a better composition in the Champion Details Page. :]","replies":[]}]}]},{"poster":"Serevas","date":"2015-07-28T16:17:31.141+0000","up_votes":2,"down_votes":0,"body":"Oddly enough in Aatrox's Sea Hunter splash art the eye patch is on her right eye.","replies":[]},{"poster":"Names Are Scarce","date":"2015-07-28T16:23:26.563+0000","up_votes":1,"down_votes":0,"body":"Her in-game skin has her spiky ponytail high up on the back of her head. I think it would look a lot better if it was slightly lower, so it wasn't sticking up like a porcupine on her head. She has nice hair in the splash art, though.","replies":[]}]}