{"poster":"KleinTyli","date":"2017-11-24T22:45:12.532+0000","title":"Matchmaking Preseason untragbar","subforum":"Champions & Gameplay","up_votes":1,"down_votes":1,"body":"Hallo,\r\nich will mich hier mal ausgiebig &uuml;ber das Matchmaking in der Preseason auslassen.\r\nMeine Ausgangssituation: Ich spiele meist in einer Dreiergruppe, zwischen Silber 4 und Gold1 . In 100% der Spiele spielen Plats mit. In mehr als 25% der Spiele spielen wir nur mit Platin.\r\n\r\nErkl&auml;rung? \r\nWir spielen in der Truppe viele normals &uuml;ber die Season, haben demnach eine gesch&auml;tzte MMR von aus dem Bauch heraus Gold4.\r\nJa, ich kenne die Ausrede mit &quot;die Plats spielen viel Ranked und wenig normals und landen deshalb tiefer als normal&quot;. Denn die schieben dank Seasonende alle in die normal Q.\r\n\r\nTrotzdem nehme ich dies nicht als Erkl&auml;rung an. Das Spiel ist die letzten Wochen nahezu unspielbar geworden weil st&auml;ndig irgendeiner der schw&auml;cheren im Team von einem Plat3 bis Plat1 vergewaltigt wird. Ein Silber 4 kann einfach nicht gegen Platin 1 lanen. Sollte es auch nur 20 Minute ohne Feed n gut gehen, dann kommt der Plat trotzdem mit 100 Farm und 2 Items mehr von der Lane.\r\n\r\nRito MUSS die MMRs aneinander koppeln. Es muss nicht 1:1 sein, aber zumindest soweit wie im Ranked dass ein Bronze/silber nicht mit einem Plat ins gleiche Game kommen kann.\r\n\r\nLG Tyli","replies":[{"poster":"THD Commodus","date":"2017-11-25T00:06:42.195+0000","up_votes":3,"down_votes":0,"body":"Ich verstehe nicht warum man sich im normalgame über das matchmaking beschweren sollte. Ich glaube es würde schon helfen, wenn man als Spieler aufhören würde vor jeder Runde auf diversen Seiten die elo seines Gegners nachzuschauen. Dadurch entsteht Angst die normal nicht anstehen würde. Außerdem tryhardet im normal game sowieso fast niemand. Es war schon immer so das die elo im normal game Bund gemischt ist. Außerdem bin ich immer noch der Meinung das es nicht schaden kann gegen bessere Spieler zu lanen , weil man sich dadurch nur verbessern kann. Ich würde an die Sache gelassen rangehen und als Möglichkeit sehen mich zu verbessern. Und ich würde aufhören vor jedem game die elo der Gegner zu Checken...\nMfG","replies":[]},{"poster":"Oriius","date":"2017-11-25T05:47:11.352+0000","up_votes":1,"down_votes":0,"body":"1. Ja ich kann dich verstehen\n2. Sorry aber das ein s4 gegen ein plat 1 nicht lanen kann stimmt einfach nicht xd bin selber s4 und lane regelmäßig mit tagabhängig zwischen 50-80% erfolgreich gegen meine platin- dia 1 gegner. Es ist aber eben wie du sagtest ... irgendwann nimmt der platin dann den schwächsten auseinander und das ist dann oft fatal für das gesamte Team. Wer die Lane gewinnt entscheidet daher nie das Spiel \n\nIch bin ehrlich gesagt auch weiter bereit gegen Plat-Dia zu spielen denn nur durch stärkere Gegner werde ich selber stärker jedoch bringt mir das absolut nichts wenn man dann wirklich leute hat die ebenfalls s4 sind aber eben statt 3k Games nur 100 games gespielt haben und somit auch die s4 sehr realistisch ist. Schlecht spielen ist zwar kein verbrechen aber es ist immer verzweifelnd wenn jemand auseinander genommen wird der neu ist weil das matchmaking komplett  rip ist xd","replies":[]},{"poster":"mondmann97","date":"2017-11-25T03:00:43.526+0000","up_votes":1,"down_votes":0,"body":"Dann spiel doch einfach Ranked, wenn dir das Normal-Matchmaking nicht gefällt.","replies":[]},{"poster":"KleinTyli","date":"2017-11-25T09:21:00.412+0000","up_votes":1,"down_votes":1,"body":"Ich checke hier nicht vor jedem Game, aber dass ein Low silber gegen einen high Platin ohne zu feeden spielen kann ist Mumpitz. Bei gold 3 und Platin 3 sind extreme Skillanstiege die sogar ein blinder sieht. \nEs sind einfach Spiele , die man nicht gewinnen kann die mich aufregen. Ja, lol macht am meisten Spaß wenn's eng ist, aber diese unmöglichen spiele in denen 5 Plats gegen 2 Plats 2 silber und 1 gold kommen gehen einfach nicht\n Ich selbst bin gold2 und habe schon Probleme in einem full Plat game mitzuhalten. Wenn dann einer der silber Spieler auf den sololanes spielt ist diese Seite der Map einfach . \nÜbrigens ist der Punkt an dem ich nach der ELO schaue meistens der, wenn aus irgendeinem Grund eine lange farmtechnisch eskaliert. Ein oberer Plat macht einfach 9cs pro Minute wohingegen in silber der Schnitt bei 6 liegt. Das kann man auch mit 100ganks und Gruppen nicht mehr richten.","replies":[]}]}