{"poster":"Riot Schmiot","date":"2019-12-12T18:58:13.460+0000","title":"Optional username update prompt is back in-client","subforum":"Dev Corner","up_votes":1,"down_votes":0,"body":"A few weeks back we paused the in-client Riot Account Update prompt when we ran into delays getting email notifications out along our originally-planned timeline. We know that this rollout created some confusion – needing to change a username isn’t fun for anyone – and we’re sorry for that. This change is necessary prep for launching our future games, and getting this done now will make your first experiences with those games much better down the road.\r\n\r\nNow that most players have received an email if they need to make a change to their Riot Account, **we’re going to start rolling out in-game notifications** for players that need to update to globally unique usernames (you can find out more about why we’re doing this on the [Riot Support FAQ](https://support.riotgames.com/hc/en-us/articles/360037264394-Riot-Accounts)). \r\n\r\nThese pop-ups are going to be dismissable for now, so you can skip it until you’re ready to make the change before it becomes non-dismissable in January. Also, now that most players who need to make a change have an email listing their accounts, it should be much easier to figure out if you’re blocking yourself with a name in another region (or a PBE account), or if it’s another player entirely. \r\n\r\nWe’ve also updated the [Riot Support FAQ](https://support.riotgames.com/hc/en-us/articles/360037264394-Riot-Accounts) with more details, some additional context, and a few tips that might help out.","replies":[{"poster":"Quáx","date":"2019-12-12T19:17:50.151+0000","up_votes":2,"down_votes":1,"body":"Why????","replies":[{"poster":"Dynikus","date":"2019-12-12T19:24:52.786+0000","up_votes":6,"down_votes":1,"body":"> [{quoted}](name=Quáx,realm=NA,application-id=A7LBtoKc,discussion-id=m6mNwJhj,comment-id=0003,timestamp=2019-12-12T19:17:50.151+0000)\n>\n> Why????\n\nbecause Riot is rolling over from a \"league of legends\" account to a \"Riot Games\" account. Think of it like using 1 battle.net, origin, or steam account to log in to all of your games on their respective clients. Rather than having a different account for World of Warcraft, Diablo 3, Overwatch, Hearthstone, etc, everything is compiled under 1 main account. \nHow riot is going about doing it is all wrong though imho. The easiest solution I feel would be to just have a completely separate \"Riot Games\" account creation, and make you link your league of legends account to it. Or if they really want to just use accounts that already exist, wipe the whole thing clean and have everyone pick a username.","replies":[]}]},{"poster":"Drultime","date":"2019-12-12T19:31:18.268+0000","up_votes":2,"down_votes":0,"body":"Can you provide a way for people who were blocking themselves, and who, in some sense, were forced to change their username, to revert it to what it originaly was after changing the other accounts' linked usernames ?","replies":[{"poster":"Riot Schmiot","date":"2019-12-12T21:56:23.073+0000","up_votes":6,"down_votes":2,"body":"We’re working on an update that will let you make that swap yourself early next year, so if you have both accounts, you'll be able to make the swap then. Expect to hear more in January.","replies":[{"poster":"Naqel","date":"2019-12-16T03:15:06.422+0000","up_votes":3,"down_votes":0,"body":"What about people who had their usernames on accounts with good standing for many years (over 9 years in my case), who got \"sniped\"?\n\nJust a big middle finger to those people? \"First-come first-serve\" to people who've been with you the longest, and often had prestigious usernames that someone else will most likely sell for a quick buck?","replies":[]}]},{"poster":"Dynikus","date":"2019-12-12T19:36:27.295+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Drultime,realm=EUW,application-id=A7LBtoKc,discussion-id=m6mNwJhj,comment-id=0004,timestamp=2019-12-12T19:31:18.268+0000)\n>\n> Can you provide a way for people who were blocking themselves, and who, in some sense, were forced to change their username, to revert it to what it originaly was after changing the other accounts' linked usernames ?\n\nYou can contact support and they can do it for you. They were able to change my NA account back to my old username, and change my PBE account to just have \"pbe\" added to the end of it.","replies":[]}]},{"poster":"Makos","date":"2019-12-13T00:22:06.443+0000","up_votes":3,"down_votes":0,"body":"Just a quick note for old PBE users (2012-2013 or whatever); your username might be duplicate only because your old PBE account has the same username, contact support to get it fixed.","replies":[{"poster":"Silent Pace","date":"2019-12-13T04:42:22.714+0000","up_votes":1,"down_votes":0,"body":"I asked about that and a bunch of other things, but they immediately solved my request and sent me a scripted answer. I'll try again.","replies":[]}]},{"poster":"Shíny","date":"2019-12-12T19:31:58.771+0000","up_votes":3,"down_votes":0,"body":"Do you have any plans for those of us that had to change our username before the emails rolled out?","replies":[]},{"poster":"Naqel","date":"2019-12-16T03:11:18.641+0000","up_votes":2,"down_votes":0,"body":"> These pop-ups are going to be dismissable for now, so you can skip it until you’re ready to make the change before it becomes non-dismissable in January. \n\nAnd after that, I guess my adventure with League, and Riot Games in general, is going to be over, since I apparently cannot keep my current username and I refuse to continue to use any Riot service under a different one.\n{{sticker:sona-playing}}","replies":[]},{"poster":"Dynikus","date":"2019-12-12T19:15:43.735+0000","up_votes":3,"down_votes":1,"body":"Fortunately, I won't have any problems because my username is unique after sorting out my NA/PBE/EUW accounts, but for players that _do_ have to change, is there any chance Riot will do anything to prevent names being taken by newer or inactive accounts? \n\nIE: Someone on NA has had their level 280 account with the username \"Bob\" for 10 years. Someone on RU has a level 5 account that they created 3 years ago with the same username, and they haven't touched it since the day they created it. Is the NA player just shit out of luck because that player is never going to log back in?\nIt seems like you could just wipe the slate clean, and give usernames to whomever claims them first. That way people who currently have unique names won't have an issue, players that want to change their usernames can, and players who have their names taken by inactive accounts won't be fucked over because that player is never going to change it. It also adds less confusion on Riot's end with making sure emails have been sent out. \nAlternatively, have everyone create a Riot account, have players link their league accounts to it, and just retire being able to use their league account to log in. ","replies":[]},{"poster":"Pixelsage","date":"2019-12-17T19:29:59.836+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Riot Schmiot,realm=NA,application-id=A7LBtoKc,discussion-id=m6mNwJhj,comment-id=,timestamp=2019-12-12T18:58:13.460+0000)\n>\n> We know that this rollout created **some** confusion – needing to change a username isn’t fun for anyone – and we’re sorry for that.\n\nUnderstatement of the year.\n\nShould have just let people continue signing in with their username+region combination and let THAT be the globally unique identifier while you figured out how to let people sign in using their email. Or sent out a notification to inactive/old accounts that you'll be modifying their username to accommodate the more seasoned players, and let seasoned players keep their usernames. There were many better ways to handle this migration.","replies":[]},{"poster":"acandybar","date":"2019-12-13T03:49:01.933+0000","up_votes":1,"down_votes":0,"body":"So, who gets the username if there's a duplicate username.","replies":[{"poster":"Dynikus","date":"2019-12-13T07:47:34.140+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=acandybar,realm=NA,application-id=A7LBtoKc,discussion-id=m6mNwJhj,comment-id=0007,timestamp=2019-12-13T03:49:01.933+0000)\n>\n> So, who gets the username if there's a duplicate username.\n\nThe last person to change it. If the person that has your username doesn't play anymore, you're pretty much screwed.","replies":[]}]}]}