{"poster":"Tehlawlfirm","date":"2015-09-06T11:08:26.311+0000","title":"Warding-  The difference between Bronze & Diamond","subforum":"[ARCHIVED] Miscellaneous","up_votes":69,"down_votes":0,"body":"I'm starting to see now a huge difference on how wards play a huge part in the Game.  Last season on another Account I got to silver 1 before I was banned for using a 3rd party program ( Custom Skins I guess).  I quit for awhile and came back and I've always known how important wards were as support but never as anything else.  I always used the free ward I had and that was about it.. Even then I'd forget to use it when it was up sometimes or didn't pay to much attention to where I put it, I figured a ward is vision at least somewhere so what does it matter where I put it. Then the last game I played someone had placed a ward right next to ward I already placed.. Which is a waste of vision since we already had vision there.\n\nOver the coarse of the last month I have been paying attention to games I play in and realized the majority of the games lost was  because people were getting caught out and dying. I would play support and I could place 3 wards and 1 pink and at any given time but the map is so huge there is no way as a support I can ward the whole map and given vision where it is needed the whole game.  I started paying attention to players on my team and noticing none of them buying wards not even a pink. They wouldn't even use the free wards they had and never bothered to upgrade those ward.. \n\nI remember one game someone told me \"It's only supports role to ward the map and other players shouldn't buy wards because they have to worry about their build\".  I know the common misconception is to think  \"Duh...  everyone should ward\"  but in reality if you pay attention to you games in casual and low elo games you will notice how unimportant people think wards are and don't even bother to upgrade their wards let alone use the free ones they have.\n\n\nThen I started watching Diamond games on up and noticed everyone was getting wards and placing them everywhere and always upgrading their free trinkets.  I noticed how they avoided getting ganked and caught out and knew where the enemy was on the map to set up ganks. So I would like to tell everyone out there that if you are new and leveling up or you are bronze/silver to start buying wards and upgrading your trinkets. 100 gold for a pink is worth saving your team mates from ganks or setting up a potential gank.\n\nThere is a reason high rank players say wards wins games and it's not for shits &amp; giggles.  If you aren't buying a pink ward or upgrading your trinket you are decreasing the chance of your team winning the game.  It's not just the supports job to ward, it's a huge freaking map and a support can only throw 3 wards down and 1 pink which covers only a small section of the map.\n\nI think lower elo players worry so much about getting kills and trying to carry that they think that is the easiest way to get higher elo. While it plays a factor in how good you are, wards play an even bigger factor because you can be 10-0-0  and lose your lead by getting caught out and ganked.\n\nIf anyone disagrees that wards are important and it's not just the supports job to ward I suggest you go watch an LCS game or a Diamond on up game and then come back here and try to argue it.  It doesn't matter if you only you and the support are warding, don't not ward just because your team mates don't ward. Do your part, that's all you need to do.\n\n\nSide not:  for 5s teams I think it would also be a good idea to plan out sections for your team mates to ward that way there is no confusion on where wards are suppose to go.\n\n\nI","replies":[{"poster":"Archon X","date":"2015-09-06T11:12:13.669+0000","up_votes":22,"down_votes":0,"body":"Strongly support this post. As a support main it makes me rather happy with the adc uses their trinket to get river bush/tribush/lane bush warded before I get my sightstone. On the rare occasions I play adc I make sure to use my trinket, at least as a show of respect to the support.\n\nI know you were talking about mid/late game and not laning phase, just want to say that the extra trinket ward during laning phase from the adc makes a difference.","replies":[{"poster":"THEJJSLAY","date":"2015-09-06T17:30:04.932+0000","up_votes":2,"down_votes":0,"body":"on the flip side though when the adc doesn't use their trinket all of laning phase and you want them to jump into a pit tho","replies":[{"poster":"CubedJustice","date":"2015-09-06T17:51:59.929+0000","up_votes":16,"down_votes":0,"body":"A pit that may or may not contain enemies. You wouldn't know, you don't have vision on it.","replies":[]}]},{"poster":"Tehlawlfirm","date":"2015-09-06T11:53:01.483+0000","up_votes":7,"down_votes":0,"body":"Ya I just had another game with no one warded ever, didn't even bother using their free wards and people got caught out left and right and died then complained there was no vision. Smh\n\nHell top didn't even ward his own lane in phasing and got ganked 3 times and blamed  me for not warding when I'm bot and support... lol","replies":[{"poster":"Ternt","date":"2015-09-07T01:11:23.021+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Tehlawlfirm,realm=NA,application-id=cIfEodbz,discussion-id=JOjZUvAl,comment-id=00000000,timestamp=2015-09-06T11:53:01.483+0000)\n>\n> Ya I just had another game with no one warded ever, didn't even bother using their free wards and people got caught out left and right and died then complained there was no vision. Smh\n> \n> Hell top didn't even ward his own lane in phasing and got ganked 3 times and blamed  me for not warding when I'm bot and support... lol\n\nI've had many games on junglers where nobody buys a single ward outside of their Warding Trinket. Even games where I buy sightstone on junglers, I still buy 3+ before I get my sightstone and these people wonder why they constantly are getting ganked and killed. Instead of thinking about what they could have done to prevent the problem, they blame me and I respond with \"Buy wards so you know when they'll gank.\" and then they ignore me and still don't buy wards. Then flame me at the end of the game when we lost because X champion got fed because pushing a lane with no ward coverage is apparently how this game is supposed to be played.","replies":[]}]}]},{"poster":"disregardable","date":"2015-09-06T12:27:15.870+0000","up_votes":6,"down_votes":1,"body":"Keep in mind that wards don't really solve the problem of not getting caught out. 8 out of 10 games I'll upgrade my ward trinket- freelo.gg says I ward like a challenger player. Doesn't stop me from dying like a Bronze player. I'll never forget the last game I played with a platinum player- she was my support. She wanted to go in on our enemy lane, and I didn't. She asked me, \"Why not go in? Their jungle already showed top\". I looked at the map, and the jg must have left top lane a while ago. She had just been  paying that much attention that she knew where the jg last was. That literally shocked me, because I'd **never** paid that much attention before. Now I kind of try to pay attention, but...I'm pretty shit at it still.","replies":[{"poster":"Tehlawlfirm","date":"2015-09-06T12:31:52.209+0000","up_votes":10,"down_votes":0,"body":"Wards mean nothing without map awareness.","replies":[]}]},{"poster":"MakeThemRemember","date":"2015-09-06T19:10:02.702+0000","up_votes":5,"down_votes":0,"body":"I shake my head so much at people who say \"OTHER CHAMPS NEED TO WORRY ABOUT THEIR BUILLLLDDDSSS {{summoner:14}} {{summoner:14}} {{summoner:14}} \" \n\n**No.** _Just stop._\n\n100g is NOT going to kill you or stop you from getting your items. Stop making excuses for being a crappy team mate.","replies":[{"poster":"skyknyt","date":"2015-09-07T02:32:55.812+0000","up_votes":2,"down_votes":0,"body":"Yep, and even if that Pink is at a shitty spot deep in your own jungle, you now KNOW that area is safe and you can retreat to it. Definitely worth that 100 gold.","replies":[{"poster":"Etherealist","date":"2015-09-07T04:55:25.757+0000","up_votes":3,"down_votes":0,"body":"Because if you don't get killed because you know that area is safe to retreat to, then you are denying 300 gold, making it a 200 gold difference then them getting a kill. Definitely worth it.","replies":[{"poster":"skyknyt","date":"2015-09-07T10:41:54.048+0000","up_votes":1,"down_votes":0,"body":"Yep, exactly.\n\nAnd you might even be setting up a counter gank with someone else's teleport.","replies":[]}]},{"poster":"MAN OF INTELLECT","date":"2015-09-08T01:35:01.238+0000","up_votes":2,"down_votes":0,"body":"In fact, I usually put my pinks pretty far back so if any enemy support gets greedy and tries to take it out, we have an easy time collapsing on him and killing him.","replies":[]}]}]},{"poster":"DazedOnlooker","date":"2015-09-06T21:07:28.069+0000","up_votes":3,"down_votes":0,"body":"**Only 1 game where this happened last week**\n\n*Won our lane because i keep a greed ward in the river/pink in tri*\n\n{{champion:14}} *Enemy Comes to gank via teleport into the river bush*\n\n{{champion:37}} {{champion:15}} *We Back towards our turret.we saw him tele in*\n\n{{champion:14}} *Proceeds with gank anyway*\n\n{{champion:222}} {{champion:37}}(Enemy sona sup) {{champion:14}} *Gets Deleted because our mid saw the tele from his lane on the mini map, and came to assist us*\n\n{{champion:15}} {{champion:91}} Killing Spree!!\n\n{{champion:14}} *Tries to gank again w/o tele*\n\n{{champion:37}} *deep ward pinked their jg, so we saw him coming*\n\n{{champion:91}} *Also warded around our mid. Sion gave up ganking mid*\n\n{{champion:15}} *Triple Kill!!*\n\n{{champion:114}} *Pinked top enemy jg + River*\n\n{{champion:14}}  *goes to gank top*\n\n{{champion:114}} *Double Kill!!*\n\n{{champion:14}} *GG AFK'd*\n\n**Victory!**\n\n**My games throughout the REST of the week**\n\n{{champion:37}} *Warded around bot like usual*\n{{champion:21}} *Only used basic trinket the whole game, did not help ward, we still won the laning phase though*\n\n**Meanwhile at Top Lane**\n\n{{champion:122}} *Did not ward, overextended, was low, then spammed Assist pings for our jg to gank*\n\n\n{{champion:122}} *An Ally has been Slain!*\n\n{{champion:92}} *Enemy Double kill!*\n\n{{champion:122}} \"Jg why are u soo bad!?\"\n\n{{champion:76}}  \"Dude i'm behind and your low, there was not much i could do there\"\n\n{{champion:122}} \"THEN WHY DID U COME GANK ANYWAY???\"\n\n{{champion:76}}  \"Why did u ping?...\"\n\n{{champion:122}} \"Stfu\"\n\n{{champion:92}} *Executed*\n\n**Meanwhile Mid**\n\n{{champion:90}} *Did not ward, Overextended, overstayed his welcome with less than 50% HP*\n\n{{champion:90}} *An ally has been slain!*\n\n{{champion:115}} *An enemy is Unstoppable!!*\n\n{{champion:90}} \"OMG JG Help me! they are camping me WTFFFFF!!\"\n\n{{champion:37}} \"Guys please use your wards\"\n\n{{champion:90}} \"stfu and do ur job. U ward!\"\n\n{{champion:37}} \"My lane is warded.\"*And probably the reason my lane isnt feeding*\n\n{{champion:76}}  *An ally has been slain!*\n\n{{champion:92}}*Executed*\n\n\n*All turrets are down, we now have 0 vision outside our base, no one is helping me ward. And the enemy team keeps clearing all of my wards*\n\n{{champion:122}}  *Goes to facecheck Drag*\n\n{{champion:122}} *Got caught out. Dies 1v3*\n\n{{champion:122}} \"Omfg SUP WARD.\"\n\n{{champion:37}} \"Its not safe for me to go alone, don't wanna end up like you.\"\n\n{{champion:122}} \"DO UR JOB\"\n\n{{champion:37}} \"Upgrade your trinket, 3 wards and a pink is not enough to save us right now, so please help ward\"\n\n{{champion:76}} \"Goes to facecheck jg, dies just outside our base. 1v5, all of them were waiting in the bush in the jg just outside our base\"\n\n{{champion:37}} \"You should probably upgrade your trinket now don't you think?\"\n\n{{champion:90}}  \"An ally has been slain!\"\n\n{{champion:76}}{{champion:21}} *goes to facecheck our blue buff*\n\n{{champion:92}} *Enemy Double Kill!*\n\n{{champion:92}}{{champion:115}} {{champion:222}} {{champion:1}} {{champion:24}} *Executed*\n\n**Defeat!!**","replies":[]},{"poster":"BruisingEmu","date":"2015-09-06T20:44:28.700+0000","up_votes":3,"down_votes":0,"body":"Simple fact.\nA ward is 75 gold. If it saves you from a gank? You didn't miss the 3 waves of farm you are going to miss for being dead.\nProfit.\nWard spots their jungler and your jungler coordinates with you for a counter-gank?\nMega profit.\n\nDon't have a ward? Relinquish all this pressure in lane because you're going to chance it and go without protection.\n(Also how about recommended items suggest a single green ward if you don't have any in your inventory?)\n\nTL;DR Wear protection. Be safe","replies":[{"poster":"Fiveofswords","date":"2015-09-06T21:12:26.567+0000","up_votes":2,"down_votes":0,"body":"you can ward and still be ganked. and whether you warded or not a gank doesnt need to kill you. No wards are not just gank prevention...the bigger idea is that if youknow where the enemy is then you know how to counteract their movement. For example if im in bot lane and i see 5 enemies in top lane im goign to push to their inhibitor turret, or kill dragon, or something. But this is because i have a brain and i think about that stuff. If everoyne else on my team is stupid they cant use this information so its pointless to ward for them.","replies":[]},{"poster":"BlkStar100","date":"2015-09-06T22:16:24.080+0000","up_votes":1,"down_votes":0,"body":"Against Evellyn and some other who use invisibility ( Shaco , Rengar , Talon ) pink is the only ward that can offer protection .","replies":[]}]},{"poster":"TurquoiseYoshi","date":"2015-09-06T17:43:20.919+0000","up_votes":1,"down_votes":0,"body":"That's why I buy Sightstone on junglers. Because I get free wards.","replies":[{"poster":"chipi99","date":"2015-09-06T19:32:57.295+0000","up_votes":3,"down_votes":0,"body":"Upgrading trinket is usually better unless you are playing those dragon soloers that need red trinket.","replies":[{"poster":"TurquoiseYoshi","date":"2015-09-06T19:40:29.010+0000","up_votes":1,"down_votes":0,"body":"I personally prefer to be able to be basically a second support in terms of warding, since then we would actually be in complete control of the map and we wouldn't get caught as easily.","replies":[{"poster":"DazedOnlooker","date":"2015-09-06T22:03:46.810+0000","up_votes":1,"down_votes":0,"body":"I also love to buy a {{item:2045}} as a jungler,as well as a {{item:3364}} to give me greater odds of pulling off a gank without being spotted along the way.","replies":[{"poster":"TurquoiseYoshi","date":"2015-09-06T22:34:33.557+0000","up_votes":1,"down_votes":0,"body":"I really only get Ruby Sightstone once I've gotten full build. The extra ward just isn't worth it.","replies":[]}]}]}]},{"poster":"BlkStar100","date":"2015-09-06T22:30:07.184+0000","up_votes":1,"down_votes":0,"body":"Sacrificing 800 g and still having to get gold for the jungler item , boots and other core items  and also not falling behind ? You are a god if you manage that all the times .  Sightstone is good on Lee Sin as it offers him that dash over the wall but I don't see the point in buying Sightstone . You could as well buy 2 greens , 1 pink and still do pretty fine .","replies":[{"poster":"TurquoiseYoshi","date":"2015-09-06T22:37:02.220+0000","up_votes":1,"down_votes":0,"body":"I don't fall behind because I play Amumu and just powerfarm the first 10 minutes. I don't gank often, so when I gank, it always works because everyone has their ults/flash/secondary summoners, because I don't gank often enough for them to get used.","replies":[{"poster":"BlkStar100","date":"2015-09-06T22:49:07.622+0000","up_votes":1,"down_votes":0,"body":"Hmmm ,  it is your way of ganking I guess . I believe that works when your team fares pretty  well in their lane ( not overextending , playing well, warding etc. ) . As Ammumu your ganks will be always strong if the bandage lands . How do you perform when 2 lanes are losing but 1 is winning ?","replies":[{"poster":"TurquoiseYoshi","date":"2015-09-06T23:20:59.431+0000","up_votes":1,"down_votes":0,"body":"If my lanes are losing, I'm not really going to do very well. That's why I try to keep that from happening. If somebody gives up a kill, I try to gank there to get gold back in our teams' pockets. I know that if the lanes fall far behind, I've lost, so I try to prevent that at all costs.","replies":[{"poster":"BlkStar100","date":"2015-09-06T23:31:53.339+0000","up_votes":1,"down_votes":0,"body":"So your answer is that you will prevent that from happening . Still sacrifices need to be made to achieve , that or high micro management in terms of controlling the flow of the match by using your ganks perfectly timed and executed succesfully . If you can do that you are wonderful . Well, I wish you the best flow control that anyone can achieve :) .","replies":[{"poster":"Tehlawlfirm","date":"2015-09-07T17:21:56.793+0000","up_votes":1,"down_votes":0,"body":"If your lanes are losing it's on them or on you for not ganking. Buying wards helps them from getting ganked, if they have no map awareness then that's on them. If you are only farming jungle and their jungle is ganking bot repeatedly and you aren't helping bot or taking advantage to gank another lane then that's on you.","replies":[]},{"poster":"TurquoiseYoshi","date":"2015-09-06T23:39:55.148+0000","up_votes":1,"down_votes":0,"body":"Eh, I'm really not that great. Sometimes my strategies work, sometimes they don't. Sometimes I'm the one giving enemies an early lead. I just try to control the flow of the game and choose when the game ends to make sure we don't get destroyed.","replies":[]}]}]}]}]},{"poster":"Tehlawlfirm","date":"2015-09-07T17:18:53.276+0000","up_votes":1,"down_votes":0,"body":"If you are ahead you buy sightstone, if you aren't you buy pinks/wards here and there.  If you main focus is building core items to get kills , whats the point if you can get ganks or get ganked from no vision?","replies":[]}]}]},{"poster":"LordForrest","date":"2015-09-06T18:19:57.516+0000","up_votes":3,"down_votes":0,"body":"This is so sad, but true.  Its even more ironic because the the current state of warding was change to what it is to get rid of the idea of only the support warding.\nBefore there was no limit to wards, basically all the support was suppose to do was by mad wards and throw them everywhere.\n\nEven after the change that was meant to simultaneously destroy that idea and make it easier to ward, people still don't and unbelievably think the support is still suppose to do it with 3 stealth and 1 vision ward.\n\nFor instance, my one friend who got me back into league, literally refuses to upgrade his trinket.  It absolutely stumps because he is aware of vision's importance and actively complains when our team does a shitty job with it.  His excuse that makes me face palm is that 250 gold is too much to spend on something that is not necessary nor going to help in teamfights.\n\nPeople just don't realize how cost effective {{item:3361}} {{item:3362}} are when it comes to wards.  Upgrade and using the stealth totem at 9 is so damn good, you can pretty much supply the majority of your warding needs as a top or mid with this item.  Granted buying wards is still a good practice, this just alleviates some of the cost.","replies":[{"poster":"IcyPepper","date":"2015-09-06T21:25:11.227+0000","up_votes":1,"down_votes":0,"body":">It absolutely stumps because he is aware of vision's importance and actively complains when our team does a shitty job with it\n\nBut...\n\n... he's part of the problem!","replies":[{"poster":"LordForrest","date":"2015-09-07T02:26:24.970+0000","up_votes":1,"down_votes":0,"body":"yeah, i like i said it stumps me that he knows about the importance of vision, but can't understand how good a level 3 trinket is.\n\nFor instance using the trinket 4 times to place a ward more than pays for the cost and every ward used after is more money in your pocket that wasn't spent on wards and wasn't lost due to death or other shenanigans caused by no vision.","replies":[]}]}]},{"poster":"Fiveofswords","date":"2015-09-06T19:03:29.253+0000","up_votes":1,"down_votes":0,"body":"No, its not the wards that make the difference. the difference is that the players know how to use the information that the wards give them. A diamond player will actually have a point behind what they do, while bronze players just wander the enemy jungle hoping to win some 1v1 duel.","replies":[{"poster":"BlkStar100","date":"2015-09-06T22:20:13.524+0000","up_votes":2,"down_votes":0,"body":"I've actually seen some diamonds that didn't required warding . They relied solely on the last jungle gank position and ther sixth sense of danger  . Ofc they were micro managing at the highest level and their champion had escapes or flash up in case things gone south .","replies":[{"poster":"Tehlawlfirm","date":"2015-09-07T17:32:00.866+0000","up_votes":2,"down_votes":0,"body":"Any diamond player can do great in low elo games but when you get to higher elo if your team doesn't ward gl.","replies":[]}]},{"poster":"Tehlawlfirm","date":"2015-09-07T17:31:07.198+0000","up_votes":1,"down_votes":0,"body":"That doesn't make sense.. wards don't make the difference but the information the wards gives do.   You need wards to get that information so yes wards do make the difference. A Pink ward alone can save you from shaco, eve  etc  or can totally screw over akakli and teemo.","replies":[]}]},{"poster":"AmazingBeaver","date":"2015-09-06T12:28:32.816+0000","up_votes":1,"down_votes":0,"body":"Vision is life , but only if you  know how to benefit form  it. I main  sup and i have  a good warding  game , but  i swear mofos  dont even watch the minimap to see whats going on , U have to ping them 3 billion times  for them  to  revert eyes to  see that  they are getting ganked or that the  team is fighting  / dying .","replies":[{"poster":"Tehlawlfirm","date":"2015-09-06T12:31:31.983+0000","up_votes":2,"down_votes":0,"body":"We'll that falls on your team mates if they have no map awareness but if you are warding you are doing your job correctly.","replies":[]}]},{"poster":"High5","date":"2015-09-06T19:39:47.958+0000","up_votes":2,"down_votes":1,"body":"This is a fundamental problem with the game and the teaching tools.  It's entirely Riot's fault and everytime they joke about it, it makes it worse.\n\nFine, you don't want to influence item builds and how people pay champs.  This is problem with players even understanding the game though and it's something that Riot could fix if they wanted to.  You want better games, help players get better instead of expecting everyone to reinvent the wheel.","replies":[]},{"poster":"Lugg","date":"2015-09-06T15:57:02.213+0000","up_votes":2,"down_votes":1,"body":"You need to add PSA to your title. It still amazes me how little people ward. You get a free trinket that is very cheap to upgrade at level 9. \n\nVision control may be the most important part of the game. Being able to see where your enemy is and what they are doing, while hiding your own position, is a tremendous advantage. It allows you to control objectives and get picks. \n\nOn a good team, the support AND jungler will have sightstones with upgraded sweepers. They are the best roles for this since they roam the entire map. \n\nWards do equal wins.","replies":[{"poster":"High5","date":"2015-09-06T19:37:34.120+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lugg,realm=NA,application-id=cIfEodbz,discussion-id=JOjZUvAl,comment-id=0008,timestamp=2015-09-06T15:57:02.213+0000)\n>\n> You need to add PSA to your title. It still amazes me how little people ward. You get a free trinket that is very cheap to upgrade at level 9. \n> \n> Vision control may be the most important part of the game. Being able to see where your enemy is and what they are doing, while hiding your own position, is a tremendous advantage. It allows you to control objectives and get picks. \n> \n> On a good team, the support AND jungler will have sightstones with upgraded sweepers. They are the best roles for this since they roam the entire map. \n> \n> Wards do equal wins.\n\nThe problem is that riot fails to teach the basics of the game.  I understand them not wanting to tell people who to play champs, but this is an every champ problem at the most basic level.\n\nWhen people don't ward and run blindly into jungles and expect you to follow them, I stop playing at 100%.  At level 30, I expet people to have a basic understanding of the map, objectives and vision.  Again, it's not a not knowing all the champions thing.  It's basic lack of understanding about the game.","replies":[{"poster":"Lugg","date":"2015-09-06T21:24:35.506+0000","up_votes":1,"down_votes":0,"body":"Agreed. Riot should have some instructional challenges you have to complete before actually playing. Have a last hitting exercise, ward locations on the map exercise, jungle clear exercise, etc.","replies":[{"poster":"BlkStar100","date":"2015-09-06T22:33:43.821+0000","up_votes":1,"down_votes":0,"body":"They could upgrade the tutorial by adding new levels toward the purpose of perfectioning those said above . Atm there is the custom mode to help you last hit in peace .","replies":[]}]}]}]},{"poster":"RyzeRework","date":"2015-09-06T13:24:40.991+0000","up_votes":2,"down_votes":1,"body":"Wards don't really do much good I can have a ward place anywhere I can ping the enemy passing the ward but it seems like no matter if its a jungler or a mid laner they walk right Through a ward and the lane that gets ganked stays pushed to the turret","replies":[{"poster":"Tehlawlfirm","date":"2015-09-07T17:27:50.176+0000","up_votes":1,"down_votes":0,"body":"Wards do great in higher elo, but the purpose in lower elo isn't really to give your team vision because chances are they won't even pay attention to the map but rather the wards are for your benefit so you can push and carry your team and not get caught out. If your team has map awareness great, but for low elo it's more a benefit to you then your team.","replies":[]}]},{"poster":"Tehlawlfirm","date":"2015-09-07T17:36:40.493+0000","up_votes":1,"down_votes":0,"body":"What I hate the most is when I get teleport and there are no wards anywhere to teleport to help my team mates out or gank.  It's like i'm top with teleport, I just killed nasus and I can teleport bot and help them get some kills but there are no wards and if their are wards they aren't in a bush where teleport would benefit from, its like support decided to put the ward by dragon for better vision but there isn't a single ward in the lane bush, meanwhile I'm telling them to throw a ward down so I can teleport gank and they are ignoring me. Then at the end of the game I get a  \"Verbal Abuse\" report because supposedly I offended them by telling them how to play \"Place a ward\"... The whole set up is really a joke imo.","replies":[]},{"poster":"Ada Wong","date":"2015-09-07T16:35:42.400+0000","up_votes":1,"down_votes":0,"body":"So how is communication in Diamond and above, I know that Bronze - Gold players to me all flat out suck was S1 last season played with Gold Players on my team and they were god awful?\n\nLike I understand the difference between warding, and what Higher Elo players actually do with wards compared to lower elo.","replies":[]},{"poster":"Cipse","date":"2015-09-07T04:26:12.196+0000","up_votes":1,"down_votes":0,"body":"I wish people in my elo warded more (I'm in Bronze).\n\nWhenever I play mid, I generally feel a bit edgy without wards because it allows me to be aggressive without really worrying about ganks - especially since there are two ways a jungler can approach the mid lane.\nI also feel the same way early as support cause a lot of adc's don't want to ward even before I've gone back once.\n\nMy favourite spot to ward whilst mid (at the moment) is around the enemy raptors because I can take the three small raptors and run or take the whole camp if the jungler is spotted somewhere else (after the mid wave is pushed, of course).\nAlso helps bot know that the jungler is top and top know if a potential gank may be coming.","replies":[]},{"poster":"SteelStallion","date":"2015-09-07T03:45:45.114+0000","up_votes":1,"down_votes":0,"body":"Here's something I've noticed not even a lot of higher ranked players do;\n\n_**UPGRADE YOUR F@!CKING TRINKET. **_ IT'S AMAZING.  3 WARDS?  WOW.  FREE STEALTH WARDS?  OMG.  TEMPORARY ELIXIR ON SCAN?  CYA LATER TEEMO.\n\nIT'S 250 GOLD PER PERSON FOR RIDICULOUS MAP CONTROL ALL GAME.  **UPGRADE.  YOUR.  TRINKETS.  ASAP.**","replies":[]},{"poster":"I GANK LANES","date":"2015-09-07T00:33:36.788+0000","up_votes":1,"down_votes":0,"body":"upgrades ward every game and is in silver only because low elo can't ward crew","replies":[]}]}