{"poster":"Ghi","date":"2016-02-29T07:49:46.749+0000","title":"This game needs a Story Mode.","subforum":"Gameplay","up_votes":168,"down_votes":24,"body":"It might take a long time to create something of the like, but I feel that it would be totally worth it.\r\n\r\nI think this could make the different lores much more appealing since champion lores aren&#039;t given much attention nor well-displayed, and players normally need some random incentive to become curious about a champion and even have to do a little &quot;digging&quot; in order to learn each of their stories. In addition, this could make the game much more interesting, interactive, or even fun. Players who are new to champions could simultaneously learn and practice the champion&#039;s abilities as well. A champion&#039;s story cannot be played unless bought, of course.\r\n\r\nThe story modes should surround each champion&#039;s current lore from beginning to end. They don&#039;t have to be long nor difficult.\r\n\r\nFor example, in starting up a story mode for Master Yi, there could be some textual introduction to Master Yi&#039;s lore accompanied with several images that pertain to the progressing context. Then it would transition to Noxian soldiers standing in front of Master Yi in the middle of a burning village or something. At this point, Master Yi&#039;s abilities are introduced and you are able to test them on the Noxian soldiers. After defeating them, you tread on, fighting Noxian soldiers along the way. At the end of the path, Master Yi would end up at another part of the village, seeing some dead villagers and Singed&#039;s poison gas all around. In the middle of the poison gas, you see Singed appear laughing as the poison affects Master Yi, resulting in him fainting. This would then transition to another scene full of texts and images about Master Yi&#039;s vengeance, training, and encounter with Wukong, who could serve as some sort of &quot;final boss&quot; to Master Yi&#039;s lore post-scene. The ending scene would conclude the lore with some more text, and the player would end up at a results screen.\r\n\r\nAlthough some champions may not have a lore that suggests any sort of combat, there is always room for creativity.\r\n\r\nShould the story modes have any sort of reward? I&#039;m not sure. Maybe, I guess? Probably minor hextech stuff? Maybe less IP/EXP than what you usually get in an actual game? Only a reward for playing the first time (assuming it&#039;s replayable)? Idk. I can&#039;t really say since I have no stance on whether or not it&#039;s a good idea. But I can definitely say that I think that having a story mode is a great one.","replies":[{"poster":"Melledoneus","date":"2016-02-29T13:45:25.413+0000","up_votes":31,"down_votes":0,"body":"{{champion:33}} would have the worst campaign ever.","replies":[{"poster":"HayRoss","date":"2016-02-29T15:01:46.939+0000","up_votes":31,"down_votes":0,"body":"1. Wander around desert\n2. Flash of light, then a maze\n3. Use your ult at nothing for shits and giggles\n4. Buy a thornmail\n5. Resume step 1","replies":[{"poster":"Melledoneus","date":"2016-02-29T15:07:01.483+0000","up_votes":21,"down_votes":0,"body":"Chapter 1: Ok.","replies":[{"poster":"KrimsonKnight","date":"2016-03-01T08:59:51.936+0000","up_votes":2,"down_votes":0,"body":"Chapter 2: Hmm.","replies":[{"poster":"Sahn Uzal","date":"2016-03-01T20:08:32.475+0000","up_votes":1,"down_votes":0,"body":"Chapter 3: Alright","replies":[]}]}]}]},{"poster":"Ghi","date":"2016-02-29T20:53:51.170+0000","up_votes":4,"down_votes":1,"body":"Lmaooo.","replies":[]}]},{"poster":"Khâmul","date":"2016-02-29T08:54:15.080+0000","up_votes":20,"down_votes":0,"body":"OFC it should have a story mode. But riot is soooo sloooooooooooooooooooooow about lores that you can wait for 2150 for a story mode to be developped","replies":[{"poster":"Mistress Madoka","date":"2016-02-29T19:05:25.978+0000","up_votes":4,"down_votes":0,"body":"Or they can Finally become Riot Game**s** And release a LoL Story Mode Game :D","replies":[{"poster":"UB3R 1337 H4X","date":"2016-02-29T22:53:43.174+0000","up_votes":2,"down_votes":0,"body":"Well they made... erm... The poro grab game?","replies":[{"poster":"Hemulus","date":"2016-03-01T02:13:43.962+0000","up_votes":3,"down_votes":0,"body":"That was fun.  It should be easier to find.  Riot should add an arcade tab on the site with old stuff like Blitz's Poro Roundup and Cho'gath Eats the World.","replies":[]}]},{"poster":"Marshmallow Wolf","date":"2016-03-01T09:51:45.043+0000","up_votes":1,"down_votes":0,"body":"riot game not riot games","replies":[]}]}]},{"poster":"Enchanté","date":"2016-02-29T11:56:35.083+0000","up_votes":21,"down_votes":1,"body":"Instead of making a story mode I'd like Riot to make a full animated movie for all the interactions between champions and residence (Noxus, Ionia, etc). Make them around 2 hours and sell it to movie theaters, $$$$$$$$","replies":[{"poster":"Ralanr","date":"2016-02-29T19:06:36.818+0000","up_votes":7,"down_votes":0,"body":"Or a tv/web series because a movie isn't enough to give all champions the credit their mains want. \n\nOr books!","replies":[{"poster":"Kagagiou","date":"2016-03-01T20:35:18.762+0000","up_votes":1,"down_votes":0,"body":"Books, what're THOSE!?\n\nNo but seriously, a web series at least.","replies":[]}]},{"poster":"Pogba1","date":"2016-03-01T02:28:48.315+0000","up_votes":2,"down_votes":0,"body":"Or maybe a trilogy of movies?","replies":[]},{"poster":"Gogoatee","date":"2016-03-01T00:43:28.392+0000","up_votes":2,"down_votes":0,"body":"this is much more possible. If a story mode WAS developed, it wouldnt be backstory style, it would jsut be in chronological order, skipping around to different peopel and events. while this would be cool, this would probably be a whole different game, so riot will have to hire a second team to make said game. it would be good, but would be expected to come out in 2020 at least and would def be a game u pay for (or if its mmo, f2p model like rs3). Honestly, i say start with an animated series, and if it works, out, much, much, later, when riot has the resources (which i dont care how big this game is, they dont have the resources right now) they could make a lore-based game","replies":[]},{"poster":"Virgin Ray","date":"2016-03-01T07:09:51.429+0000","up_votes":1,"down_votes":0,"body":"There would be like 0 character depth considering there are 100+ champions.","replies":[]}]},{"poster":"Malicious Metal","date":"2016-02-29T20:15:06.297+0000","up_votes":9,"down_votes":0,"body":"Razing a fortress as Mordekaiser would be pretty darn Brutal.","replies":[{"poster":"Baron of Bread","date":"2016-02-29T21:13:22.704+0000","up_votes":2,"down_votes":0,"body":"Also getting killed several times.","replies":[{"poster":"Nechronia","date":"2016-03-01T01:52:08.327+0000","up_votes":5,"down_votes":0,"body":"Wait... isn't that just playing a game of league as Mordekaiser?","replies":[]},{"poster":"Sahn Uzal","date":"2016-03-01T20:10:10.097+0000","up_votes":1,"down_votes":0,"body":"Play some Skyrim, wear some Iron armor and try to beat enemies that are way too strong for you at your current level.\n{{summoner:31}}","replies":[]}]}]},{"poster":"resumed","date":"2016-02-29T17:36:13.628+0000","up_votes":9,"down_votes":0,"body":"build thornmail on ashe or trundle will will take the freljord","replies":[]},{"poster":"KarKzz","date":"2016-02-29T18:13:14.080+0000","up_votes":7,"down_votes":0,"body":"Great idea, store it there, so riot can care about it.\n\n[Sandbox][Replay system]\n[Honor system]     [~~Evelyn~~]\n[Community feedbacks]\n[~~Dominion~~]\n[*Insert your idea here]","replies":[{"poster":"morris1","date":"2016-02-29T18:39:57.740+0000","up_votes":3,"down_votes":0,"body":"[Ao Shin]","replies":[{"poster":"KarKzz","date":"2016-02-29T18:58:37.891+0000","up_votes":2,"down_votes":0,"body":"Well, ao shin is getting \"reworked\" into an other dragon. So basicaly, only the name and the visual disapear, sime elements of his kit will remain.","replies":[{"poster":"Nahara","date":"2016-02-29T19:57:05.205+0000","up_votes":2,"down_votes":0,"body":"I think it's the other way around. The kit, IIRC, was no-good but the concept and visuals will probably be what survived the reboot.","replies":[{"poster":"KillerKell","date":"2016-03-01T05:39:09.932+0000","up_votes":1,"down_votes":0,"body":"The 'visual' was the Eastern Dragon style... it was the Body Length that led to an impossibly large Hit Box and a very awkward 'instant turn around', as we have no Turning Radius.","replies":[{"poster":"Mistress Madoka","date":"2016-03-01T06:20:32.161+0000","up_votes":1,"down_votes":0,"body":"They had a lot of issues dealing with the Model and Hitbox(es) Which ultimately got him Iceboxed and apparently Re-born as Aurelion Sol (Who has the same Initials so that's cool)","replies":[]}]}]}]}]}]},{"poster":"allthemuslims","date":"2016-02-29T17:21:24.522+0000","up_votes":6,"down_votes":0,"body":"I would also like to add a campaign mode where you choose which faction to start in and then have to conquer all of the different places in Runeterra for your faction, like you start out with your region's champions and then gain access to more and more as you conquer more places. You then have to deploy champions where you think you need to defend from invaders and also to move in on foreign lands, and they can only move so far each turn. It doesn't all have to be true MOBA style gameplay, there could be things like ticket based deathmatch, defend your base, steal the intel (which would give you information on the current whereabouts of that faction's champions), dominion, etc... all using the current league assets. We have enough champions in each region that we could almost make this work out (Obviously regions with higher champion density would have to be set at a handicap or everyone would choose Noxus/Demacia and no one would pick the void since the void is massive and only has a few champions). Obviously this would take a massive amount of time to play out, but we could definitely either do multiple real time servers running these (unlikely since these would fill up almost instantly) or have it be singleplayer and offline. \nIf you guys like this I'll try to work out a more formal proposal and turn it into a post later.","replies":[]},{"poster":"Makuta Teridax","date":"2016-02-29T11:08:12.647+0000","up_votes":2,"down_votes":8,"body":"I will only say it once: \"Gangplank is dead and has been disabled from all queues.\" Now imagine if every character who would be thought dead had this happen to them.","replies":[{"poster":"Ghi","date":"2016-02-29T11:12:22.036+0000","up_votes":7,"down_votes":0,"body":"That's an entirely different matter from what I had intended. I'm asking for a permanent addition to the game, not an event.","replies":[]}]},{"poster":"Yash Gautam","date":"2016-02-29T20:35:06.243+0000","up_votes":4,"down_votes":0,"body":"Logged in just to upvote this","replies":[]},{"poster":"Mhihnj","date":"2016-02-29T12:25:41.385+0000","up_votes":4,"down_votes":0,"body":"so basically:\nhttp://i.imgur.com/xmtfEHm.png\n","replies":[]},{"poster":"KillerKell","date":"2016-03-01T05:37:04.344+0000","up_votes":3,"down_votes":0,"body":"There should be a Mode for what the Game was INTENDED to be.\n\nYou choose a Champion.  Then you are 'Summoned'.  You are given the description of WHY you were Summoned.  What conflict is this that your Team and the Opposing Team are fighting over?\n\nWhich would mean that you would generally only fight with Champions on 'your side'.  If you went Ashe you would find yourself MAINLY fighting on the Side of Freljord, with the Summoner that Summoned you being one that is trying to help a current Freljord 'situation'.  Like some other 'Faction' trying to edge in on Freljord Land.\n\nTo which then the Battles could get bigger, joining Factions.  As Noxia and the Death Isles try to take over, perhaps Ionia and Piltover join forces to defend.\n\nYou would ONLY play the ONE Champion you selected, and be matched with others ALSO in Story Mode (Bots would just be to simple/easy).  Every single Champion would have their own Story woven into the overall story of the Summons.  Say at 5 Wins and/or Matches you get a nice Backstory Cut Scene unique to your Champion.  And it adds on and on at certain 'Milestones'.\n\nOf course, making Champion Skins and Avatars and Ward Skins part of this (for free, but at the cost of intense play time in the Story Mode) would be awesome.  Say 3 Skins, like 'Early Gangplank' 'Mid-Story Gangplank' and 'Story Complete Gangplank' with each Skin focused on how the Champion may have looked at that time (younger, skinnier, different weapon or color of clothing, etc.).\n\nFor instance \"Early Jax\" could be BEFORE he was so bad-ass that he was forced to fight with a Lamp Post in the League... so \"Early Jax\" Skin he'd have an actual weapon.  \"Mid Jax\" could be when Weapons became boring to him, so he went Bare Hands.  Then \"Story Complete\" would be Jax with his Lamp Post, but some polish or change to make it distinct (maybe even just a Border on his Default Skin?).\n\nThe 'Good' would be you'd get your Champion 100% of the time... and no 'copy Champions' would be allowed, so only One Unique Champion per Match.  This way you don't find yourself defending Freljord... with 4 other Ashe.","replies":[]},{"poster":"Nahara","date":"2016-02-29T19:59:16.671+0000","up_votes":3,"down_votes":0,"body":"Hey, if Telltale Games gave Minecraft a story mode...","replies":[]},{"poster":"Stillname","date":"2016-02-29T18:46:41.290+0000","up_votes":3,"down_votes":0,"body":"You want them to develop 120+ campaigns? The bare minimum number of missions each campaign would need to not suck would be 5 So they would have to develop 600+ missions.\n\nFor comparison Final Fantasy Tactics (a purely mission based game and a long one at that) probably had around 500 and hundreds of those are super generic. Not to mention that I can't think of a 2nd game that comes close to that number of missions.\n\nAt best it would be a dynasty warriors style story mode where you do the same 7 campaigns and just swap out your generic character and lines for each mission and pretend it is catered to you but that game (which is a full release pve game also) still only has around 35 playable characters which is still nowhere near league size.\n\nThe most direct comparison is Star Craft for which blizzard develops 3 campaigns for each expansion (which are a little higher quality then they would need but most people still wouldn't consider them worth buying the game for) and it still takes them a long time to do just those 3.\n\nEven those little website animations that go with the events they launch take weeks to prepare and they would need to do hundreds of those.\n\nNot saying all of this just to rain on your parade (it is cool to picture how each campaign would be) I'm just trying to help give you some perspective on why it isn't reasonable that Riot could do this and have it not suck.\n\nTldr: This would be a huge undertaking for a development studio prepared to handle it and I don't see a single way Riot could do it even if they wanted to.","replies":[{"poster":"charcharmunro","date":"2016-03-01T04:45:46.112+0000","up_votes":2,"down_votes":0,"body":"Could just have various \"main characters\" have their own story modes. Yi, Garen, Katarina, Ryze, Kassadin, Shen, Caitlyn, Viktor, etc.","replies":[]}]},{"poster":"Silents429","date":"2016-02-29T20:02:02.407+0000","up_votes":2,"down_votes":3,"body":"No, not only is this a huge waste of resources, but it's a friggin Moba game.\n\nI'd rather they expanded on lore by making more comics and videos regarding it instead. \n\n\nI can't even fathom how horrible the gameplay of the story mode would be.","replies":[{"poster":"Hedgehog Hustler","date":"2016-02-29T21:02:31.175+0000","up_votes":3,"down_votes":0,"body":"Dota has/had a story mode in the making.","replies":[{"poster":"Silents429","date":"2016-02-29T21:28:00.999+0000","up_votes":2,"down_votes":0,"body":"That doesn't mean it will be good.","replies":[]}]}]},{"poster":"rtbf225618241","date":"2016-02-29T16:55:53.532+0000","up_votes":2,"down_votes":1,"body":"Right now, i'm just hoping that's where all their money is going.","replies":[{"poster":"KarKzz","date":"2016-02-29T18:30:29.396+0000","up_votes":2,"down_votes":0,"body":"They closed dominon that still had a decent played base (0,5% of 27+ millions is more than some game can ever dream of.) To save something like 10K / year.\n\nAnd you expect them to invest money on something that don't make them gain money ?","replies":[{"poster":"Silents429","date":"2016-02-29T20:02:34.098+0000","up_votes":1,"down_votes":0,"body":"FYI.\n\n0.5% was rounded up, and majority of that was bots.","replies":[{"poster":"KarKzz","date":"2016-03-01T16:33:04.326+0000","up_votes":1,"down_votes":0,"body":"Did you ever played it ? I had 250 - 300 games on it, and never ever saw a bot.","replies":[{"poster":"Silents429","date":"2016-03-01T18:38:22.774+0000","up_votes":1,"down_votes":0,"body":"Well if you didn't see it, I guess they weren't there.","replies":[{"poster":"KarKzz","date":"2016-03-01T22:09:23.182+0000","up_votes":1,"down_votes":0,"body":"There was bots, but it's not as \"big\" as people made it. Bots MMR sanks like titanic pretty quickly. So you may have got 1 -2  bot in your first game if you are unlucky. Also, most bot were less than lvl30.\n\nYou can expect to see those bots in other game modes now. Probably 3v3 or aram.","replies":[{"poster":"Silents429","date":"2016-03-01T22:35:14.504+0000","up_votes":1,"down_votes":0,"body":"You're underplaying it, Dominion was full of bots and people you just played with. \n\nBots won't thrive as well in Aram and 3v3.","replies":[]}]}]}]}]}]}]},{"poster":"Zorasama","date":"2016-02-29T09:08:39.976+0000","up_votes":3,"down_votes":1,"body":"They just removed Dominion because it cost them $$$, and this seems like to cost them even more than Dominion so...","replies":[]},{"poster":"StealthWarden","date":"2016-02-29T17:28:43.540+0000","up_votes":3,"down_votes":5,"body":"Worst idea ever\n\nReason:\n\nThis would require an actual story line....Which would employ the same lore team that can barely put together a paragraph for a champion. The story mode that riot would output would be so pathetic Riot would have no choice but to give us our money back from a free to play game.","replies":[{"poster":"Yash Gautam","date":"2016-02-29T20:39:56.996+0000","up_votes":2,"down_votes":0,"body":"I honestly think they would do a great job with what lore they already have.","replies":[]}]}]}