{"poster":"unPali","date":"2015-02-08T05:20:54.582+0000","title":"No entre a ninguna liga, ayuda porfavor","subforum":"Problemas Técnicos","up_votes":1,"down_votes":1,"body":"Hola, armo esto para que alguno de los rioters me quite esta duda. Yo era unranked desde que hicieron el reinicio (como es normal) hasta hoy a la noche, que supuestamente terminaba de jugar las 10 partidas. Antes de jugar la ultima, entre a mi perfil y vi el logo azul de unranked que abajo decia \"9 de 10 jugadas\" tenia, 4 ganadas, 4 perdidas, y una abandonada por un corte de luz. En total hacen 9 partidas.\r\nAl final termine de jugar la ultima partida y en vez de aparecer la notificacion de actualizacion de liga, dice \"No se han jugado suficientes\" (o algo por el estilo) Entonces lo primero que hago, entro en mi perfil, a lo que el logo azul habia desaparecido como si no fuera lvl 30 (y sigue sin aparecer). Mi duo entra en mi perfil y aparece 6 de 10 jugadas. Entonces se me ocurre preguntarle a otro amigo por chat que me diga que liga aparecia abajo de mi nombre en el chat \"dice que sos bronce 3\" aliviado entro a LOL KING para confirmar, y me dice PLATA 4 \"5 ganadas, 4 perdidas\" ahora mas contento y a la vez confundido, entro a otra pagina similar LOL SKILL, y aca fue muy raro, porque como que no tenia absolutamente NINGUN DATO (ENTIENDASE: cantidad de partidas, cantidad de oro por partida, cantidad de partidas jugadas, etc) tampoco aparecia que estuviera en una liga en clasificatoria, y tampoco aparecia el logo de bronce 1 en el que estoy con mi team.\r\nPorfavor riot necesito que me ayuden y me digan que hacer, por ahora se me ocurren dos cosas, jugar otra clasificatoria para ver si se arregla, o simplemente cortarme las venas con pan lactal hasta la muerte. :C\r\n\r\nATTE: RaZZoR97","replies":[{"poster":"JVCK","date":"2015-02-08T05:40:10.253+0000","up_votes":1,"down_votes":0,"body":"Juega una más y ahi te va a acomodar en una liga. Me acaba de pasar lo mismo en un cuenta, jugue las 10 y extrañamente al jugar la 11 me coloco en una liga.","replies":[]},{"poster":"FeedMeLumia","date":"2015-02-08T05:35:13.187+0000","up_votes":1,"down_votes":0,"body":"https://www.youtube.com/watch?v=RLjRe-EGQ94","replies":[]}]}