{"poster":"Kanzaki Aria","date":"2014-10-21T22:49:41.546+0000","title":"Please Buff Nautilus' Size","subforum":"Gameplay","up_votes":251,"down_votes":12,"body":"I remember the very first time I saw Nautilus{{champion:111}}  in LOL. He was a humongous and towering figure; arguably, the biggest champion in the entire game. This seemed appropriate, considering his overall strength in-game, and the fact that his lore even mentions him donning his \"hulking diver's suit.\" \n     But when I look at Nautilus{{champion:111}}  today, he really seems to be lacking his grim and threatening image. His size has been significantly reduced over time and now matches the height of many other non-tanky champions. I find this change to be saddening and I feel that it's taking away from his true power. He seems like a mere flea in comparison to other tanks such as Sion{{champion:14}} , Zach{{champion:154}} , and  fully stacked cho' gath{{champion:31}}.  I would love nothing more than to see his size increase to fit other members of his class and to better showcase his titan-like strength over his squishier foes. This is shown perfectly in the \"New Dawn\" cinematic, with his grand entrance and massive girth. Not to mention the fact that other champions had to literally look up to meet his eyes.\n\nThis wouldn't be a buff nor a nerf. Just a simple visual update to show both champions and summoners exactly what they're dealing with when they battle toe-to-toe with \"The Titan of the Depths.\"","replies":[{"poster":"The Red Warden","date":"2014-10-21T23:11:38.929+0000","up_votes":56,"down_votes":1,"body":"I would really like it if Naut's size increased greatly when his w is active. Another champion that also needs a size increase is{{champion:82}}. The lore describes him an 8 foot tall metal juggernaut, yet in game he is shorter than most normal humans like {{champion:236}} and {{champion:104}}","replies":[{"poster":"CobaltBlue64","date":"2014-10-22T00:53:20.861+0000","up_votes":2,"down_votes":0,"body":"Lucian is incredibly tall. Or at least he looks pretty tall","replies":[{"poster":"Gypsyleeboy","date":"2014-10-22T02:29:13.101+0000","up_votes":26,"down_votes":1,"body":"he's a basketball player","replies":[{"poster":"Doominator10","date":"2014-10-22T13:32:58.895+0000","up_votes":7,"down_votes":1,"body":"No, he plays soccer","replies":[]}]},{"poster":"Raptamei","date":"2014-10-22T16:21:48.631+0000","up_votes":3,"down_votes":2,"body":"> Lucian is incredibly tall. Or at least he looks pretty tall\n\nBlack men are good at basketball.","replies":[{"poster":"I Script Xerath","date":"2014-10-22T16:45:13.160+0000","up_votes":2,"down_votes":5,"body":"Ya thats not racist or anything XD","replies":[{"poster":"Vellich0r","date":"2014-10-22T17:28:36.088+0000","up_votes":12,"down_votes":1,"body":"its not, its stereotyping :P","replies":[{"poster":"Malhammers","date":"2014-10-22T22:00:54.600+0000","up_votes":3,"down_votes":1,"body":"Its not..its looking at NBA statistics and stating the obvious.","replies":[{"poster":"MrGoldTech","date":"2014-10-23T01:17:06.879+0000","up_votes":8,"down_votes":0,"body":"people saying that Lucian playing basketball is racist... when the only black champion in LoL carries two handguns and runs quickly.","replies":[]}]},{"poster":"xCoonsx","date":"2014-10-22T19:45:33.130+0000","up_votes":4,"down_votes":5,"body":"which can be racism","replies":[{"poster":"Vellich0r","date":"2014-10-23T01:40:27.328+0000","up_votes":8,"down_votes":1,"body":"but the particular comment wasn't racist, just a stereotype","replies":[]}]}]}]}]}]},{"poster":"kanacho","date":"2014-10-22T00:56:09.308+0000","up_votes":8,"down_votes":3,"body":"He also needs a kit rework, fitting a more tankier play style instead of a glass-cannon vamp-steal mage. Some people build him tankier, yet the numbers that do are quite small. He tends to simply get HP from liandrylai's and after those 2 items, it's pretty much straight AP and vamp steal. Not much of a variety, nor would it fit a larger tank-like appearance.\n\nMordekaiser needs a Gameplay update, and a Visual Update 100%","replies":[{"poster":"PhoenixUnreal","date":"2014-10-22T03:24:08.197+0000","up_votes":3,"down_votes":1,"body":"I hate tanky Morde, and I dislike spellvamp as a first buy. I really love DFG {{item:3128}} in combination with  is ult. just something to think about. I love Glass cannon with a last item {{item:3143}} \n\nA {{summoner:4}} {{item:3128}} Ult from Morde is more than enough to kill even tanks.\n(This requires you to position VERY carefully though.)\n\n-PhoenixUnreal","replies":[{"poster":"Flawless Fetus","date":"2014-10-22T14:56:19.931+0000","up_votes":7,"down_votes":0,"body":"> \n> -PhoenixUnreal\n\nWhat inspires people to type their name on forum/webpages where their same name is already displayed?  I never got that.","replies":[]}]},{"poster":"Lynari","date":"2014-10-22T03:56:33.058+0000","up_votes":2,"down_votes":0,"body":"*spell vamp","replies":[]},{"poster":"The Red Warden","date":"2014-10-22T01:06:01.972+0000","up_votes":2,"down_votes":0,"body":"O.K. for a second there I was really confused since I thought you were talking about Naut. Yes, I agree that Morde needs a complete relaunch like the one that Sion received and Riot has confirmed they are going to do that. \n\nThe only parts of his current kit are his passive and that his ults makes ghost servants out of the people you kill. Also going by his thematic it would make more since if was either a tank or heavy bruiser since what else would a undead lord that wears a giant suit of metal and who controls metal be. \n\nWhen he does get his vu I am really hoping that one of his jokes is either about Huehuehue or his connection to BRAZIL","replies":[]}]},{"poster":"Theorchero","date":"2014-10-22T07:52:54.751+0000","up_votes":3,"down_votes":0,"body":"> I would really like it if Naut's size increased greatly when his w is active. Another champion that also needs a size increase is{{champion:82}}. The lore describes him an 8 foot tall metal juggernaut, yet in game he is shorter than most normal humans like {{champion:236}} and {{champion:104}}\n\nThat's a good point.\n\nI don't know about his W change, though. It doesn't make much sense thematically for him to grow when he uses his shield.","replies":[]},{"poster":"Hoi Im Temmo","date":"2014-10-22T15:49:30.325+0000","up_votes":2,"down_votes":0,"body":"Those who know the way of the hue, know that size doesn't mean everything :3","replies":[]}]},{"poster":"Riot Scruffy","date":"2014-10-24T04:30:05.626+0000","up_votes":32,"down_votes":1,"body":"When we were evaluating Sion's new size during development, we compared him to a bunch of the other tanks in terms of size. A few of them (like maokai, malphite etc) seemed like they were smaller than they should be in game. \n\nWe should take a look at Nautilus and see if there's room for him to get a little size bump. He's definitely never going to be as big as he is in the cinematic, but there may be a bit of room on him. No promises tho.","replies":[{"poster":"Jamnon","date":"2014-10-27T02:54:29.327+0000","up_votes":5,"down_votes":0,"body":"Just for kicks, how big would his model have to be, to be as big as he was in the cinematic? Just photo-shop it for brevity. Sorry I dunno how to otherwise I would.","replies":[]},{"poster":"Kanzaki Aria","date":"2014-10-24T23:13:05.716+0000","up_votes":2,"down_votes":0,"body":"Thank you, I really appreciate it.","replies":[]}]},{"poster":"Gensing","date":"2014-10-22T01:35:32.781+0000","up_votes":15,"down_votes":0,"body":"Almost all tanks excluding Sion, Zach and Cho'gath need to have a size increase. To be honest any champ  who buys {{item:3143}}{{item:3065}} and {{item:3083}} on a consistent basis need to be large. ","replies":[{"poster":"Shosuko","date":"2014-10-22T02:48:14.315+0000","up_votes":4,"down_votes":2,"body":"Maybe they should just look into having size adjust based on certain purchases.  Think if all of these tanky champs started out only slightly larger, but scaled up in size based on their armor / mr / health values.  The first size up could be triggered with simple rune / mastery set ups, but have a few scales they could increase through itemization.\n\nI think this would be a pretty nifty feature as you could visibly see which tanky champ is tankier at times.  Also you could build super size yordle amumu ^_^","replies":[{"poster":"7ha7guy777","date":"2014-10-22T03:22:54.784+0000","up_votes":3,"down_votes":0,"body":"Zac already does this so they could probably implement it on other tanks. i feel that a size increase is a very minor indirect peeling buff because naturally \"large enemies are dangerous\" is kind of programmed into our heads (hence some people focusing new Sion even though the ADC is plowing away at their team)\nin case it wasn't clear, i support the Naut size increase","replies":[{"poster":"Kanzaki Aria","date":"2014-10-22T03:38:22.560+0000","up_votes":7,"down_votes":0,"body":"I love the idea of making tanks bigger as a whole. Like you said, we automatically assume that \"large enemies are dangerous.\" So people would be more likely to focus them. And as a tank, this is exactly what you would want.","replies":[]}]}]},{"poster":"clickhead","date":"2014-10-22T04:59:29.933+0000","up_votes":3,"down_votes":0,"body":"Why would they make Shen large? He's a ninja.","replies":[]}]},{"poster":"LuckyReden","date":"2014-10-22T02:15:07.878+0000","up_votes":13,"down_votes":0,"body":"I agree with this, and also why Isn't Malphite bigger? Look at his splash art, he is 100's of times bigger than the humans in it, and he looks hardly menacing as a rock elemental who isn't bigger than Vi.","replies":[{"poster":"7ha7guy777","date":"2014-10-22T03:24:05.870+0000","up_votes":2,"down_votes":0,"body":"it might be for camo purposes. some people have mistaken malphite for ancient golem","replies":[]}]},{"poster":"TwoD","date":"2014-10-22T00:43:42.656+0000","up_votes":8,"down_votes":0,"body":"Also {{champion:54}} , man have you seen this guy in his Splash Art? Yeah, that's actually how big he is story/lorewise.","replies":[]},{"poster":"Gunpoint","date":"2014-10-22T02:57:11.275+0000","up_votes":7,"down_votes":0,"body":"You people act as if buffing Nautilus through increasing his size/hitbox and Q missle width is a bad thing. Nautilus isn't the best jungle pick, and he's not even that great of a tank despite all of his cc. Buffing his size MIGHT be what nautilus needs. That and make his W damage persist after shield is popped >_>","replies":[]},{"poster":"WhereTheNamesAt","date":"2014-10-22T00:36:21.409+0000","up_votes":7,"down_votes":0,"body":"I think they should make Nautilus's size equivalent to the size of him in *The New Dawn* cinematic. I mean goddamn he was huge and it would make him feel like 20x more epic.","replies":[]},{"poster":"SkyblazeHydraX3","date":"2014-10-22T00:49:09.547+0000","up_votes":3,"down_votes":2,"body":"This is an awesome idea *thematically*, but what about *technically*? Nautilus is meant to be this massive lumbering juggernaut, but increasing his size will also come with some technical changes.\n\nHis Dredge Line, for example. If they simply increased his model size that would mean his anchor would be larger as well. Yet when he throws his Q around, it would end up looking smaller. But if they increased the projectile size of his anchor, that would mean increasing its hitbox size, which could have an unknown effect on his balance and gameplay. And what about his Riptide? In order to fit his new size it would need a buff to its visual and hitbox range as well.","replies":[{"poster":"Kanzaki Aria","date":"2014-10-22T01:08:51.932+0000","up_votes":6,"down_votes":0,"body":"It's mainly a matter of perception. If they were to increase his increase his hit box, he would be more likely to be hit by skillshots, which would make him take more damage and could be considered a nerf. But {{champion:111}}  is also very durable and it probably wouldn't have that negative of an impact on players. He would be able to soak up more damage in teamfights which could be considered a buff. But you should also consider champions like {{champion:154}}  and {{champion:31}} , who are able to change their sizes mid-game. The changes to their abilities are barley noticed. Overall I doubt it would be anything game breaking.\n\nAs far as his Q goes. {{champion:111}} throws his anchor \"vertically\" not \"horizontally.\" so any cosmetic changes to the width of his anchor would not affect the ability.","replies":[]}]},{"poster":"kDrakari","date":"2014-10-22T00:59:28.437+0000","up_votes":6,"down_votes":0,"body":"I think Riot only (somewhat) recently decided that \"tanky\" champions should have significantly larger models and hitboxes than others, so new tank champions (Braum, Mega Gnar) and reworked tank champions (Sion) are pretty gigantic compared to a lot of other champions. Nautilus definitely should be brought to the same size, but they might be planning to do so alongside a rework (hopefully a small one, he could use some love but I think a lot of his kit is fine).\n\nNothing but Cho'Gath should be the size of full-stack Cho'Gath though, that's something special (as it should be).","replies":[{"poster":"kanacho","date":"2014-10-22T01:01:48.239+0000","up_votes":3,"down_votes":1,"body":"Well Lulu's Ultimate can change that pretty quick :)","replies":[]}]},{"poster":"Galgus","date":"2014-10-22T02:27:27.054+0000","up_votes":7,"down_votes":1,"body":"Sion really needs to be smaller.\n\nI get that he is a big guy, but unless he is part giant he needs to have human proportions.\n\nBesides, Braum already took the \"Strongest man\" niche.","replies":[{"poster":"Kanzaki Aria","date":"2014-10-22T03:15:21.498+0000","up_votes":1,"down_votes":0,"body":"Braum does seem rather small, especially since his lore and splash art depicts him to be a lot bigger. It would be nice if they made him larger, but not quite as large as Sion. i think human tanks should be larger than normal people, but nothing too crazy.","replies":[{"poster":"Galgus","date":"2014-10-22T04:53:21.142+0000","up_votes":3,"down_votes":0,"body":"Sion just isn't human in his proportions - tank or otherwise.\n\nBeing huge and strong is the entirety of Braum's background as a fighter - Sion has the war niche to fill so he doesn't need to be as large.\n\nBraum is far from normal in his lore, if punching through a mountain and carrying a huge, heavy metal door around like a shield is any indication.","replies":[]}]}]},{"poster":"The Ruined King","date":"2014-10-22T23:22:06.449+0000","up_votes":1,"down_votes":0,"body":"Technically, it would be a buff/nerf if they increased his size because then, his hitbox would be increased (or at least it should be anyways). Which means he's easier to hit, yes, but that's the point of playing someone like Naut, Sion, Zac, Cho, etc. They're as big as they are so they can take those hits for their team in fights. His early game might suck more though, because he can be kinda squishy early, which is why he's counter jungled so easily.","replies":[{"poster":"Sire Hippington","date":"2014-10-25T01:29:37.040+0000","up_votes":5,"down_votes":0,"body":"that would be the idea, but currently tanks have pretty low sustain besides Alli, mao and Mundo(the only tanks played at worlds...).\nThat means they can get poked down rather easy, while a carry can sustain him self back with a few AAs(cc is pretty hard for a carry though)\nBack in the days of FoN+Warmongs, Bodyblocking+damagesoaking actually was a thing for tanks...","replies":[]}]},{"poster":"Merxamers","date":"2014-10-24T13:02:25.041+0000","up_votes":4,"down_votes":0,"body":"some champions need their size decreased. Have you guys seen {{champion:11}}  model? He's enormous!","replies":[]},{"poster":"xJLx MCHammer","date":"2014-10-22T01:59:00.721+0000","up_votes":4,"down_votes":0,"body":"I would like them to increase the size for serval Champions including naut","replies":[]},{"poster":"Knalxz","date":"2014-10-22T01:44:39.171+0000","up_votes":1,"down_votes":1,"body":"If they do that it would be an unintentional nerf to Jungle Naut because he'd have a bigger hit box. Support Naut would be better but thats only because he would be bigger.","replies":[{"poster":"Kanzaki Aria","date":"2014-10-22T01:49:05.952+0000","up_votes":4,"down_votes":0,"body":"How would having a bigger hit box nerf jungle {{champion:111}} ?","replies":[]},{"poster":"PhoenixSlayer13","date":"2014-10-22T13:19:42.575+0000","up_votes":3,"down_votes":0,"body":"Not technically true.  The hit box doesn't conform directly around the champion.  From what I understand Riot uses three sizes: small, medium, and large.  I'd wager that Naut is already large, and increasing his model size a bit probably won't result in his hit-box changing unless Riot feels that the gameplay doesn't make sense.","replies":[]}]},{"poster":"Amish Jew","date":"2014-10-27T00:54:06.372+0000","up_votes":3,"down_votes":0,"body":"Yes! I love this champion, and making him bigger would make him better at doing what he does best: being a massive CC tank.","replies":[]},{"poster":"551202","date":"2014-10-22T18:30:18.942+0000","up_votes":3,"down_votes":0,"body":"> I remember the very first time I saw Nautilus{{champion:111}}  in LOL. He was a humongous and towering figure; arguably, the biggest champion in the entire game. This seemed appropriate, considering his overall strength in-game, and the fact that his lore even mentions him donning his \"hulking diver's suit.\" \n>      But when I look at Nautilus{{champion:111}}  today, he really seems to be lacking his grim and threatening image. His size has been significantly reduced over time and now matches the height of many other non-tanky champions. I find this change to be saddening and I feel that it's taking away from his true power. He seems like a mere flea in comparison to other tanks such as Sion{{champion:14}} , Zach{{champion:154}} , and  fully stacked cho' gath{{champion:31}}.  I would love nothing more than to see his size increase to fit other members of his class and to better showcase his titan-like strength over his squishier foes. This is shown perfectly in the \"New Dawn\" cinematic, with his grand entrance and massive girth. Not to mention the fact that other champions had to literally look up to meet his eyes.\n> \n> This wouldn't be a buff nor a nerf. Just a simple visual update to show both champions and summoners exactly what they're dealing with when they battle toe-to-toe with \"The Titan of the Depths.\"\n\ntotally agree! {{champion:12}}, {{champion:54}},{{champion:57}}  and {{champion:36}}  need that too (or a vu)","replies":[]},{"poster":"Jamnon","date":"2014-10-22T23:52:52.926+0000","up_votes":1,"down_votes":2,"body":"Tanks do need to be larger than non-tanks, in general. However, if you make them all bigger, suddenly none of them feel big enough? Idk just a thought.\n\nI feel like it would be ok if you make them all one size, bigger than non-tanks and that would be ok.\n\nThe whole \"growing sizes in the game\" feels like it should solely be a {{champion:31}}  thing.","replies":[{"poster":"Cain the Enabler","date":"2014-10-24T21:42:56.047+0000","up_votes":3,"down_votes":0,"body":"> Tanks do need to be larger than non-tanks, in general. However, if you make them all bigger, suddenly none of them feel big enough? Idk just a thought.\n> \n> I feel like it would be ok if you make them all one size, bigger than non-tanks and that would be ok.\n> \n> The whole \"growing sizes in the game\" feels like it should solely be a {{champion:31}}  thing.\n\n{{champion:154}}","replies":[]}]},{"poster":"GrandMa5TR","date":"2014-10-23T03:37:01.605+0000","up_votes":1,"down_votes":1,"body":"If you make Naut bigger then every champion get's a little smaller. So all a sudden you no longer will have massive tank's towering over the battle field, You will only have just another tank.","replies":[]}]}