{"poster":"ArchíverKill","date":"2018-11-13T02:05:01.520+0000","title":"¿Como van a terminar la season?","subforum":"Charlas Generales","up_votes":8,"down_votes":0,"body":"Buenas, quiero ver la felicidad de la gente que termino en el elo que quiso\r\nen mi caso no cumpli mi meta de la smurf porque tengo una hija de 1 mes que tengo que encargarme, pero orianna no me pierdo\r\n\r\nMain: Oro 1 100PL\r\nSmurf: Plata 1 75pl\r\n\r\n&iquest;Ustedes?\r\n{{sticker:slayer-jinx-wink}}","replies":[{"poster":"Without Codes","date":"2018-11-13T02:07:47.867+0000","up_votes":2,"down_votes":1,"body":"Soloq: Diamond 4\nflex: Diamond 5 \n\n{{sticker:sona-playing}}","replies":[]},{"poster":"Celebi","date":"2018-11-13T14:42:54.010+0000","up_votes":1,"down_votes":0,"body":"Mi meta fue llegar de plata IV a platino V jugando puramente kindred lo logré y subi a platino en los ultimos 3 dias porque no me gusta jugar clasificatorias (quedaba ahi porque le tengo miedo a eso de la inactividad xD)\n\ny en flex nada, odio esa modalidad ademas de que no tengo con quienes jugarla.","replies":[]},{"poster":"Celebi","date":"2018-11-13T14:42:34.644+0000","up_votes":1,"down_votes":0,"body":"Mi meta fue llegar de plata IV a platino V jugando puramente kindred lo logré y subi a platino en los ultimos 3 dias porque no me gusta jugar clasificatorias (quedaba ahi porque le tengo miedo a eso de la inactividad xD)\n\ny en flex nada, odio esa modalidad ademas de que no tengo con quienes jugarla.","replies":[]},{"poster":"SpectreChazer","date":"2018-11-13T02:12:08.280+0000","up_votes":1,"down_votes":0,"body":"Solo Q: Oro III\nFlex: Oro V\nLo que si me costo fue llegar a 50 Rankeds jugadas {{sticker:sg-lulu}}","replies":[{"poster":"ArchíverKill","date":"2018-11-13T03:43:36.979+0000","up_votes":1,"down_votes":0,"body":"50? Para que?\nYo en la smurf con las 10 de posicionamiento plata 1 y de ahi jugue pocas\n¿te dan algo por las 50?","replies":[{"poster":"lMrDarksl","date":"2018-11-13T13:31:45.088+0000","up_votes":1,"down_votes":0,"body":"Para hacer más completa la respuesta de Kono, si llegaste a Oro V en una de las colas te dan a Orianna victoriosa, si llegaste en ambas colas, te dan un chroma (el esmeralda/ verde) y en todas las demás regiones por llegar a oro en la cola 3vs3 del bosque retorcido además te dan otro chroma (ámbar / naranja), en LAS como no está habilitado, el requisito para obtener ese Chroma es tener al menos 50 rankeds jugadas (se cuentan ambas colas, soloq y flex) En resumen, si llegaste a ORO V y jugaste más de 50 rankeds, ya tendrías a Orianna y uno de los Chromas.","replies":[]},{"poster":"SpectreChazer","date":"2018-11-13T05:28:36.292+0000","up_votes":1,"down_votes":0,"body":"otro chroma porque no hay rankeds de bosque retorcido","replies":[]}]}]},{"poster":"adepfuan","date":"2018-11-13T04:09:54.023+0000","up_votes":1,"down_votes":0,"body":"comenze a jugar hace 1 o 2 meses, no muy seguido pero jugaba xD, y luego de llegar a lvl 30 hace 1 o 2 semanas, no recuerdo xD, juge mis primeras 10 rankeds en flex porque senti que si queria empezar mejor ahi xD, bue la honda es que llege a plata 4 y me siento muy feliz xD pense que estaria en bronze pero estoy en plata xD","replies":[]},{"poster":"Rohaerlyn","date":"2018-11-13T03:56:03.372+0000","up_votes":1,"down_votes":0,"body":"D5 en soloq\nplatino 1 en flex\nllegue a honor 2 hace 3 dias\nhace 6 horas cayó un rayo a la vuelta de mi casa y la baja tension no me deja ni prender la pc","replies":[]},{"poster":"PÉTØ","date":"2018-11-13T03:48:36.176+0000","up_votes":1,"down_votes":0,"body":"SoloQ : Platino 5\nFlex: Platino 5\nHonor : 1 xd :v","replies":[]},{"poster":"Trickster","date":"2018-11-13T03:47:13.857+0000","up_votes":1,"down_votes":0,"body":"me meti solo a comentar, porque igual tengo una hija y para peor me quebre la muñeca y ahora tengo titanio en ella (tengo excusa para ser manco)\npero todo bien ya recuperado de la muñeca tengo mas funcionalidad y igual nacio mi hija tiene 28 dias casi cumple el mes ajjaja\n\nde mis 5 cuentas solo me falto una dejarla en oro =(","replies":[]},{"poster":"Symbiotic","date":"2018-11-13T03:43:33.807+0000","up_votes":1,"down_votes":0,"body":"Solo q: Platino 1\nFlex: Platino 5\nMe hubiera gustado llegar a diamante, pero igual estoy contento, estuve mucho tiempo estancado entre platino 5-4 y en 1 semana logré llegar a platino 1, después no me dieron las manos para llegar a mi meta, pero igual contento.","replies":[]},{"poster":"Loli On Bush","date":"2018-11-13T02:51:27.536+0000","up_votes":1,"down_votes":0,"body":"soloq: platino 5\nflex: NA\n\nsupongo que es un logro bastante grande subir de silver 1 a platino 5. por otro lado, las flex las juego con amigos troleando o sin tomarlo en serio. en ese modo de juego si no se juega con premades es dificil escalar.","replies":[{"poster":"Cônsistency","date":"2018-11-13T03:01:53.630+0000","up_votes":1,"down_votes":0,"body":"No te creas que es dificil escalar, es más fácil de lo que crees, yo que era un diamanco estancado re hard, terminé en master, no subí a Challenger pq deje de jugar nada más","replies":[{"poster":"Loli On Bush","date":"2018-11-13T03:05:06.242+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Łast Høpe,realm=LAS,application-id=v7qsfXsE,discussion-id=4baGJzlH,comment-id=00060000,timestamp=2018-11-13T03:01:53.630+0000)\n>\n> No te creas que es dificil escalar, es más fácil de lo que crees, yo que era un diamanco estancado re hard, terminé en master, no subí a Challenger pq deje de jugar nada más\n\npueder ser, velo como un arma de doble filo(?. puede que te toquen trolls en tu equipo o en el otro XD. pero sinceramente, tengo una impresión bastante mala de las flex:(","replies":[]}]}]},{"poster":"diabetín","date":"2018-11-13T02:57:34.093+0000","up_votes":1,"down_votes":0,"body":"soloq: unranked\nflex: unranked\n{{sticker:sg-lulu}}","replies":[]},{"poster":"Wawüz","date":"2018-11-13T02:42:41.921+0000","up_votes":1,"down_votes":0,"body":"Solo Q: Oro 5\nFlex: Plata 3\nVictorias: 39\n\nMas que todo me dedico a jugar ARAMS y mi meta era conseguir la skin mas los cromas, lamentablemente me di cuenta mas temprano que tarde que no soy muy fanatico de jugar en la grieta asi que solo pude conseguir la skin victoriosa base, sin los cromas, pero bue.. eso es lo principal.","replies":[]},{"poster":"Renekor","date":"2018-11-13T02:08:34.704+0000","up_votes":1,"down_votes":0,"body":"Oro v en flex y oro 4 en duo\n\nQueria llegar a platino pero no pude, igual la tenia dificil porque hace poco mas de 1 semana que empece a rankear. Al menos gane el skin con los chromas\n\nA que hora dan los premios? etc","replies":[{"poster":"Mascheranox","date":"2018-11-13T02:34:58.485+0000","up_votes":1,"down_votes":0,"body":"Le van a ir llegando a la gente hay que esperar,algunos les llega al toke a otros en dias","replies":[]}]},{"poster":"Mascheranox","date":"2018-11-13T02:31:28.528+0000","up_votes":1,"down_votes":0,"body":"Mi meta era llegar a oro en SoloQ \nEn flex intente pero sin mucha importancia por que no me gusta rankear ahi,twngo mala experiencia en ese modo de ranked\nOsea mi meta era llegar a oro y despues levelear el honor por suerte hoy se me dio y estoy conforme.\n\nLo unica decepcio fue el campeon victorioso pense que iba a salir un campeon de la linea de soporte","replies":[]},{"poster":"Gatito xfas","date":"2018-11-13T02:19:48.944+0000","up_votes":1,"down_votes":0,"body":"Solo Q: Diamante V 18 pl (hoy jugue solo una ranked que fue la que gane y me dieron esos 18 pl)\nFlex: Oro v 100 pl\nMe hubiera gustado intentar llegar a Master pero no me alcanzaba el tiempo, y no tenia los suficientes campeones como para intentarlo \nIgual estoy contento","replies":[]}]}