{"poster":"ArchíverKill","date":"2017-05-04T11:48:32.070+0000","title":"No puedo progresar","subforum":"Charlas Generales","up_votes":2,"down_votes":0,"body":"Buenas, bueno el tema es que soy unranked (ya lo se, 100% random y aclaro que es normal no me vengan a decir que no me queje) pero me sale muchas partidas con diamante/challenger y nose, siento que no puedo progresar porque no estoy a tanto nivel de jugabilidad, &iquest;no hay una manera de que me salga gente de menos liga? solo hago este post como un desahogo para los diamantes que me rompen el orto y se re aprovechan :,v","replies":[{"poster":"Rayito","date":"2017-05-04T12:27:04.915+0000","up_votes":1,"down_votes":0,"body":"Tenes que perder mucho para que te baje el elo en normales, justo ayer en una partida me toco contra un challenger y la verdad fue bastante fácil ganar. Tal vez ver la liga antes te mete presión, deberías verla después del gane.","replies":[{"poster":"Afrojacks","date":"2017-05-04T12:30:46.826+0000","up_votes":1,"down_votes":0,"body":"las normales no te suben o bajan el elo amigo, las ranked si, mi consejo es que juegues las 10 rankeds y veas que pasa. De otra manera tu elo no va a bajar y vas a seguir en la misma situación.","replies":[{"poster":"Rayito","date":"2017-05-04T12:47:16.551+0000","up_votes":2,"down_votes":0,"body":"Se ve que no entiendes lo que es el mmr. Te lo explico rápido, tienes un mmr separado las normales de las rankeds. Como de todos los modos de juego, aram, ascensión, ect. Cuando haces las 10 de posicionamiento te da una liga en relación a tu mmr auque esto no es perfecto muchos tienen mas mmr que su liga (o menos) y eso se refleja en la ganancia de lp.","replies":[{"poster":"Afrojacks","date":"2017-05-04T12:58:35.800+0000","up_votes":1,"down_votes":0,"body":"elo y el mmr son dos cosas muy distintas, mover el mmr a través de normales es algo que lleva mas tiempo que si bajas tu elo con rankeds, se podria decir que es mucho mas estático, sino cada vez que aprendes a usar un champ o le enseñas a un amigo a jugar (que en estos caso varias veces pierdes) tu elo se bajaría injustamente, en conclusión, yo recomiendo rankear y ver en que ligas quedas eso va afectar tu elo bastante","replies":[{"poster":"Pascut","date":"2017-05-04T13:00:38.476+0000","up_votes":3,"down_votes":0,"body":"Deja la droga; jugar rankeds no afecta en nada al mmr de las normales, cada cola (aram, normal, ranked, 3v3) tiene un mmr separado que se sube JUGANDO CADA UNA DE ESAS COLAS; jugando rankeds solo subis tu mmr EN RANKED","replies":[]},{"poster":"Rayito","date":"2017-05-04T13:21:18.994+0000","up_votes":1,"down_votes":0,"body":"Al chico lo van a seguir emparejando asi en normales hasta que pierda bastante, las rankeds no tienen nada que ver con este tema.","replies":[]}]}]}]}]},{"poster":"Conejito Feliz","date":"2017-05-04T17:09:03.054+0000","up_votes":1,"down_votes":0,"body":"Segui perdiendo y vas a ir bajando","replies":[]},{"poster":"Diegotg2","date":"2017-05-04T14:35:40.775+0000","up_votes":1,"down_votes":0,"body":"Quieres progresar ? Entonces juega ranked\n\nQuieres progresar ? Juega con personas mejores que tu\n\nQuieres progresar ? Entonces has algo distinto de lo que siempre haces","replies":[]},{"poster":"VodkaCL","date":"2017-05-04T14:29:41.461+0000","up_votes":1,"down_votes":0,"body":"justamante si quieres progresar es mucho mejor que te emparejen con diamantes o challenger como dices porque asi aprendes como juegan ellos. A mi en normales me emparejan con bronces o gente que recien empieza a jugar porque nunca juego normales y la verdad es bastante aburrido","replies":[]}]}