{"poster":"Niyumi","date":"2017-02-19T23:09:56.758+0000","title":"\"WE PUT QUALITY BEFORE MONEY\"","subforum":"Gameplay","up_votes":3,"down_votes":20,"body":"... Hecarim has been BEYOND broken for two seasons now, you have yet to nerf him -- instead claiming it&#039;s COTC that makes him broken, even though he was broken before that was even a mastery.\n\nIllaoi was ABSOLUTELY broken in the right hands, yet not everyone could play her, so you buff her so much a retard can excel with her because whales couldn&#039;t play her.\n\nAD champions were broken as is, and then you buff lethality because \"Talon is 'weak'\"-- apparently one shotting people is weak.\n\nADCs are literal gods, yet you call them weak and refuse to nerf lifesteal.\n\nYou talk so much about counterplay, but never add it to champions. In fact, you nerf the champions that DO have counterplay.\n\nYou spend a year to rework a champion when an amateur team could do it in a few days to a week.\n\nYou claim you&#039;re focusing so much manpower on updating the client and that&#039;s why you can&#039;t do things when, again, an amateur team could do it rather easily.\n\nI could go on for HOURS with all the bullshit you spew and do, but it&#039;s not like anyone would believe me anyway; their heads are too far up their asses for that. I wish I could go back in time to when companies ACTUALLY GAVE A FUCK ABOUT ANYTHING, and maybe I could slap a few bratty kids and make them stop worshiping F2P before it goes and destroys all of gaming. But no. I&#039;m stuck here, being miserable, thanks to greed.","replies":[{"poster":"Mecha MaIphite","date":"2017-02-19T23:41:18.355+0000","up_votes":6,"down_votes":0,"body":"Not sure why you're still allowed to post tbh.","replies":[{"poster":"VoidStaresBack","date":"2017-02-19T23:49:06.400+0000","up_votes":3,"down_votes":0,"body":"With Caitlyn gone, we have to have somebody shitposting to amuse us.","replies":[{"poster":"MissingKayo","date":"2017-02-20T00:29:43.964+0000","up_votes":1,"down_votes":0,"body":"What if Sciela was Caitlyn's alt?","replies":[]}]},{"poster":"MissingKayo","date":"2017-02-19T23:44:48.034+0000","up_votes":2,"down_votes":1,"body":"Because Sciela's shitposts are always funny.","replies":[]}]},{"poster":"MissingKayo","date":"2017-02-19T23:30:18.644+0000","up_votes":4,"down_votes":0,"body":"Illaoi wasn't ever broken though.","replies":[{"poster":"Niyumi","date":"2017-02-19T23:41:36.353+0000","up_votes":1,"down_votes":4,"body":"If you had a brain and knew how to play her she was. Now people who don't even know how to play her can carry because she lost any counterplay she actually had.","replies":[{"poster":"oSEXYPLATYPUSo","date":"2017-02-20T00:02:31.240+0000","up_votes":1,"down_votes":0,"body":"doesnt lulu beat her ? \n\nLULU TOP beats octobitch","replies":[{"poster":"Ark Sorcerer","date":"2017-02-20T00:25:45.533+0000","up_votes":1,"down_votes":0,"body":"Hasn't Lulu been nerfed some time back so she can no longer do that? I prefer a fed Lulu over a fed Illaoi but I doubt Lulu could do it.","replies":[{"poster":"oSEXYPLATYPUSo","date":"2017-02-20T00:52:11.895+0000","up_votes":1,"down_votes":0,"body":"lulu won lane due to dps and her polymorph anytime octobitch tried to all in you you just polymorph and spam laugh","replies":[{"poster":"Ark Sorcerer","date":"2017-02-20T01:01:03.368+0000","up_votes":1,"down_votes":0,"body":"I mean... I won't argue. All I remember is that some time ago Lulu got a nerf in that regard-- her top lane form.","replies":[]}]}]}]},{"poster":"MissingKayo","date":"2017-02-19T23:42:12.539+0000","up_votes":2,"down_votes":0,"body":"What? That is so completely wrong I am actually struggling to believe you just typed that out.","replies":[{"poster":"Niyumi","date":"2017-02-20T00:03:22.711+0000","up_votes":1,"down_votes":2,"body":"Read carefully: People who have a brain and know how to play her.","replies":[{"poster":"MissingKayo","date":"2017-02-20T00:29:17.353+0000","up_votes":1,"down_votes":0,"body":"And you're still wrong.","replies":[]},{"poster":"Ark Sorcerer","date":"2017-02-20T00:25:06.132+0000","up_votes":1,"down_votes":0,"body":"I have a brain and I can't carry as Illaoi. I would screw up that w a lot (becuase I have to be mindful of nearby tentacles). There is use E then ult to get an extra tentacle and quickly press W. With the soul from E, then the tentacles can keep slapping. I know this but I can't do it on the fly one my first game with her.","replies":[]}]}]}]},{"poster":"Automated Riven","date":"2017-02-19T23:31:35.099+0000","up_votes":1,"down_votes":0,"body":"she still isnt. without  her ult she is the most worthless champ in the game","replies":[]}]},{"poster":"Dynikus","date":"2017-02-19T23:27:48.969+0000","up_votes":4,"down_votes":0,"body":"Didn't you make a ridiculous claim about how fast riot should be able to do something before? IIRC you said making a toggleable mask for bloodmoon diana should only take an hour or something.\nThe fact that you think a full vgu would take an amateur team a few days just shows how little you know about game development. ","replies":[{"poster":"Niyumi","date":"2017-02-19T23:40:41.727+0000","up_votes":1,"down_votes":3,"body":"Animate her lifting her arm to her face, make the mask (THAT ALREADY DETACHES) attach to her hand, have her put her hand down, flag mask as hidden. Wow, so hard. Then just reverse the whole thing for putting it on.\n\nOkay then, tell me why it would take more than just a few days, if you know so much about development.","replies":[{"poster":"SithesisLord","date":"2017-02-20T01:19:08.950+0000","up_votes":1,"down_votes":0,"body":"You´re seemingly forgetting the fact they´ll need to MODEL HER A FACE AND REDO HER ENTIRE MODEL'S UVWs, considering she only has her mouth insides modelled.\n\nYou literally know shit when it comes to 3D modelling and texturing for games.","replies":[{"poster":"Niyumi","date":"2017-02-20T01:34:57.975+0000","up_votes":1,"down_votes":1,"body":"Except... she takes her mask off in her backing animation, so she already has a face. In fact, she already HAS an animation to take off her mask.","replies":[{"poster":"SithesisLord","date":"2017-02-20T01:42:27.595+0000","up_votes":1,"down_votes":0,"body":"And? She has one in the back animation. Good, it´s more than enough.\n\nI don´t see how making her take her mask off any place else make the skin better.\n\nMake every other BM skin have toggles for mask removal then. Fair's fair.","replies":[{"poster":"Niyumi","date":"2017-02-20T02:27:25.378+0000","up_votes":1,"down_votes":1,"body":"I don't care one way or another, I don't play Diana. I'm just calling out Riot for outright lying to people -- whether it be greed or laziness I don't know.","replies":[]}]}]}]}]}]},{"poster":"Ark Sorcerer","date":"2017-02-19T23:13:51.637+0000","up_votes":1,"down_votes":3,"body":"I understand some of your points. Not the Hec one but everything with AD champions, one shotting, lethality, and counterplay. As a mage player myself, I see me having to quit being a mage for a few months  before mages get a buff or AD get a severe nerf. Oh Syndra and Zyra. I loved you both. Now you are both weak.","replies":[{"poster":"TheHappyReaperz","date":"2017-02-19T23:37:04.399+0000","up_votes":4,"down_votes":0,"body":"Mage main, complaining about how people get oneshot. \nhttp://www.memegen.com/m/pyjmlh.jpg","replies":[{"poster":"Ark Sorcerer","date":"2017-02-19T23:40:26.718+0000","up_votes":1,"down_votes":1,"body":"I find their to be a difference between using 3-5 abilities to kill an enemy versus 3-5 auto attacks to kill an enemy.\n\nI find Talon one shotting fine. I find Jinx killing me with three autos questionable designed.","replies":[]}]}]},{"poster":"Handy Sandy ","date":"2017-02-19T23:11:12.590+0000","up_votes":3,"down_votes":0,"body":"Every time I see a post like this \n\nhttps://www.youtube.com/watch?v=LiSIU_U-ZmY","replies":[]},{"poster":"Limmie","date":"2017-02-19T23:45:32.815+0000","up_votes":2,"down_votes":0,"body":">Illaoi was ABSOLUTELY broken in the right hands\n\nIllaoi is a typical noobstomper champion, she's good at exploiting people who don't know how to play against her but really bad against those that do. That's why her winrate goes down the further you go on the elo ladder, it's more about the opponent not knowing what to do than the player.","replies":[{"poster":"Niyumi","date":"2017-02-20T00:18:16.561+0000","up_votes":1,"down_votes":2,"body":"Used to be that way, then they added % health damage to her W, and MASSIVELY buffed her tentacle damage (even a good player is goinna take a hit or two).","replies":[]}]}]}