{"poster":"Niyumi","date":"2017-06-17T03:34:02.009+0000","title":"I remember a time when a company like Riot would never exist.","subforum":"[ARCHIVED] Miscellaneous","up_votes":1,"down_votes":12,"body":"Not even half the fucking bullshit and lies Riot pulls would have put them out of business 10-15 years ago. Beck, Merril? They would NEVER be able to make another game again, because people would know they're shitty, greedy people.\r\n\r\nWhat happened to the gamers that gave a fuck? Did they all die or something? I don't understand how gaming could have gotten so shitty so quickly.\r\n\r\n* Blatantly OP champs that Riot ignores or buffs, even though literally everyone agrees they need nerfs if anything (Win Nhao's round of buffs not along ago, Akali's recent buffs, Shyvana's recent buffs, Yi's recent buffs, Draven's recent buffs, Riven's recent buffs, etc.)\r\n\r\n* Openly admitting to balancing around what's popular / the spotlight\r\n\r\n* Openly admitting champs like Lee are extremely broken, but also profitable so will never be nerfed meaningfully.\r\n\r\n* Spending years to do what a high school / college team could do in a week while claiming to put quality above all else (And Riot had upwards of $2B in profit last year, so they can afford to hire actual teams instead of skeleton teams)\r\n\r\n* Outright saying that bugs that have been around for years (Jayce hammer bug, Syndra ult bug, etc.) just aren't worth the effort to fix-- again despite stating quality comes before all else.\r\n\r\n* Double standards everywhere (Drain tanks doing too much damage but ADCs are fine, animation cancelling being bad but fine on Riven, etc.)\r\n\r\n... I remember a time when a company that pulled things like that would literally be laughed out of the industry. But I guess people don't care about quality anymore so long as something is shiny, pretty and distracting for their goldfish brain, and gives them something they can preen about in front of their goldfish-brained friends.","replies":[{"poster":"Crett","date":"2017-06-17T03:40:34.526+0000","up_votes":7,"down_votes":0,"body":"that'd be a more compelling argument if you pulled up quotes from rioters as examples of these things you're saying they do; this just sounds like a big heap of vitriol as is, and will probably just be deleted in short order\n\n\nEDIT: i was wrong it didn't get deleted lmao","replies":[{"poster":"Niyumi","date":"2017-06-17T04:10:25.446+0000","up_votes":1,"down_votes":5,"body":"Go read through their articles they spit out, ask someone for the link of the post talking about Lee being broken.","replies":[{"poster":"GankedByWindows","date":"2017-06-17T04:50:48.238+0000","up_votes":5,"down_votes":0,"body":"If you're making the claim, you have to provide the evidence. I remember the Lee quote being more along the lines that he is fun to play/watch, so they would rather him be popular than someone like Nunu until they can get all champions to Lee's fun level.","replies":[]}]}]},{"poster":"Marshbouy","date":"2017-06-17T03:37:00.234+0000","up_votes":4,"down_votes":0,"body":"If you hate this game and riot so much then just fucking leave. No one wants you here.","replies":[{"poster":"Niyumi","date":"2017-06-17T04:10:01.807+0000","up_votes":1,"down_votes":2,"body":"It's not just this game though, it's nearly every game these days.","replies":[]}]},{"poster":"reaperteaser","date":"2017-06-17T05:21:26.823+0000","up_votes":3,"down_votes":0,"body":"its not that riot doesnt take feedback, its that players are less understanding about how balance works.  so they have to use data from the actual game (that takes time to collect) to make their balance changes.  even after they take the time to collect data about under/over- performing champs/items/masteries/ect. they then have to come up with a way to help (buff/nerf/power shift) that wont break/dumpster other champs/items/masteries/ect. in the process.  balence is an art that takes patience and keen insight to master.  and while riot might not make the best of decisions all the time they do still have equality in mind when working on balance.","replies":[]}]}