{"poster":"Niyumi","date":"2017-07-24T11:40:36.457+0000","title":"So what does Vayne give up for her fucking bullshit everything?","subforum":"Gameplay","up_votes":4,"down_votes":13,"body":"The highest ADC damage in the game, % max health true damage, god-tier sustain, passive DR because of PD, the highest MS in the game when she chases someone, 2s CD invisibility, MASSIVE AD steroid, absurd mobility, hard CC and self peel, 100% targeted, braindead kit..\n\nLike, what downside does she have? What fucking weakness does she have? She can legitimately 1v5 and win. In what world is she fair or balanced?","replies":[{"poster":"Viktor Von Lazer","date":"2017-07-24T11:44:33.608+0000","up_votes":4,"down_votes":0,"body":"a laning phase. You could make any champ sound broken just listing out their strengths only.","replies":[{"poster":"Niyumi","date":"2017-07-24T11:46:11.648+0000","up_votes":1,"down_votes":8,"body":"As I said below, you put a point in Q and W, and your \"weak early game\" is not a thing anymore. Sure you might be weak without both, but once you have both you rival Draven in lane damage.","replies":[{"poster":"Skylarke","date":"2017-07-24T12:04:41.158+0000","up_votes":6,"down_votes":0,"body":"You cannot be serious. \n\nDraven with a single point in Q beats a Vayne with 1 point in Q and W.","replies":[{"poster":"Avienal","date":"2017-07-24T13:05:01.640+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Skylarke,realm=EUW,application-id=3ErqAdtq,discussion-id=vfX9eP66,comment-id=000100000000,timestamp=2017-07-24T12:04:41.158+0000)\n>\n> You cannot be serious. \n> \n> Draven with a single point in Q beats a Vayne with 1 point in Q and W.\n\nSounds about right, Draven's Q can be constantly refreshed on axe catch and he can just press the Q again if vayne forces draven to not catch a axe with her E. That one gimmick alone makes the similarities in mana cost and damage 'values' early on between the both of them a complete joke since Vayne's atleast burning mana to constantly use hers, Draven can keep 'refreshing' his Q to where he regens the mana back and he doesn't really need to use his W and E much beyond kill securing which he basically gets every time, even when a lane is slightly pushed into the enemy lane(because Draven GIVES no fuck if you used flash to escape his EWQQQ spam combo, he still gets you with his R).\n\nSeriously, Draven needs to get hit somewhere, can we give him the same nerfs as Caitlyn by hard hitting his attack speed to force him to demand attack speed early on or suffer on being able to land autos properly? That or just do the damn job Riot and hard up the mana cost on Q and cut out some of the damage on the ability alone since its over tuned way too high.\n\n{{sticker:zombie-brand-facepalm}}","replies":[]}]}]},{"poster":"Avienal","date":"2017-07-24T12:58:37.612+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=falllightbringer,realm=NA,application-id=3ErqAdtq,discussion-id=vfX9eP66,comment-id=0001,timestamp=2017-07-24T11:44:33.608+0000)\n>\n> a laning phase. You could make any champ sound broken just listing out their strengths only.\n\nShe may lack wave clear, but a good sum of ADCs in general easily resolve that with a support or rather EZ high damage and neglible mana costs that don't really ruin them(where high damage empowered autos barely cost mana vs. AoE 'pokes'). She has a freakin passive that lets her add bonus true damage every third shot on a target so she isn't that screwed over in wave clear. As much as {{champion:119}} is where both of them have ridiculously strong Q damage outputs without proper power pulled out of somewhere on them to cost them, Draven could ATLEAST be forced to a very screwed over position if he does not get early game kills, but instead he could easily ignore that and just build up a bunch of adoration stacks and then soon as he gets one of them, he spirals out of control thanks to that bonus gold, especially since gets +50 BASE gold on a champion kill on top of the regular gold.\n\n{{sticker:slayer-jinx-unamused}}","replies":[]}]},{"poster":"archerno1","date":"2017-07-24T12:29:25.912+0000","up_votes":2,"down_votes":0,"body":"She has no poke on laning phase, she has no waveclear early, no pushing power. Entire early game she will be pushed under tower forced to struggle for CS while being poked by enemy ADC and support. Just by existing she gives up laning to enemy team.","replies":[]},{"poster":"Geauxx","date":"2017-07-24T11:42:35.268+0000","up_votes":2,"down_votes":0,"body":"Her entire early game and half her mid game is what she gives up.","replies":[{"poster":"Niyumi","date":"2017-07-24T11:45:19.309+0000","up_votes":1,"down_votes":8,"body":"You hit level 2 and put a point in Q and W and her \"weak early game\" is over. Her MASSIVE Q buff made sure of that.\n\nTry again.","replies":[{"poster":"Phelas","date":"2017-07-24T11:47:32.348+0000","up_votes":1,"down_votes":0,"body":"Waveclear and the ability to siege, she has next to zero utility and on top of that no ruunans interaction unlike every other hypercarry in the game.","replies":[]},{"poster":"TS Media","date":"2017-07-24T11:56:08.346+0000","up_votes":3,"down_votes":0,"body":"When you bring up \"massive Q buff\" I assume you're talking about the buff where they let her Q deal 70% increased AD bonus damage. Just for bringing that up, your entire rant, reasoning and problem have all now become null.","replies":[{"poster":"Niyumi","date":"2017-07-24T11:58:03.455+0000","up_votes":1,"down_votes":6,"body":"No, the one where they let her Q crit, and increased the damage it does, all at the same time.","replies":[{"poster":"BeatzBoyFTW","date":"2017-07-24T12:08:10.796+0000","up_votes":3,"down_votes":0,"body":"Yeah, that got nerfed in Patch 6.24. Her maximum Q ratio is now just 50% bonus AD _from 70%_ in order to counteract her one-shotting crits. Even Riot has stated it:\n\n#\"When we last visited Vayne, we buffed Tumble’s scaling to compensate for the strength of lane bullies. The net result of that change: Vayne (a late-game hypercarry) now has a powerful mid-game spike once Tumble is maxed and she completes her Infinity Edge + Statikk Shiv combo. With mid-game dueling mastery, Vayne no longer has to wait to scale before she becomes a dominant threat. We’re reverting Tumble’s previous buff to get her back to her late-game-focused ways.\"\n\nIf this is still something that you can't grasp with your mind, I suggest you check back on what the hell you did wrong.","replies":[]},{"poster":"Geauxx","date":"2017-07-24T12:18:38.086+0000","up_votes":2,"down_votes":0,"body":"It's ok to keep trying, you're just giving everyone good laugh at this point.","replies":[]}]}]}]}]},{"poster":"dolphinosplash24","date":"2017-07-24T14:18:58.212+0000","up_votes":1,"down_votes":0,"body":"Play vayne and get challenger then","replies":[]},{"poster":"Sujiren","date":"2017-07-24T11:57:44.408+0000","up_votes":1,"down_votes":0,"body":"Single target only,no wave clear low range, loses to every adc till 2/3 crit items, also squishy as hell even for an adc.","replies":[{"poster":"Niyumi","date":"2017-07-24T12:00:16.391+0000","up_votes":1,"down_votes":1,"body":"{{item:3087}} says hello.\n\nMost ADCs are single target.\n\n550 is the same range as most ADCs.\n\nAnd she beats every ADC from level 2 on if she's any good.","replies":[{"poster":"Sujiren","date":"2017-07-24T12:13:22.245+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sciela,realm=NA,application-id=3ErqAdtq,discussion-id=vfX9eP66,comment-id=00030000,timestamp=2017-07-24T12:00:16.391+0000)\n>\n> {{item:3087}} says hello.\n> \n> Most ADCs are single target.\n> \n> 550 is the same range as most ADCs.\n> \n> And she beats every ADC from level 2 on if she&#x27;s any good.\n\n550 range may be standart for most adcs, but  they have abilities that extend far abov their range. Think Jhin w and r hit from offscreen away, ezreal q that has way more than his aa range, lucian q, etc. She does not beat any 1 since level 2, the heck you talking about. Lethality adcs will burst her with their abilities before she can do anything, crit adcs will bully her with superior range and damage. She is completely reliant on her support and jungler to carry her during the early game, so she can get her item spikes and start dueling people with her stealth.","replies":[]}]}]},{"poster":"Viktor Von Lazer","date":"2017-07-24T11:51:39.218+0000","up_votes":1,"down_votes":0,"body":"Do you know what her range is? Are you literally just letting her walk up to you and smack your little head across the pavement? Who can't bully and out range her during lane? Her damage is a joke till items.","replies":[{"poster":"Niyumi","date":"2017-07-24T11:57:10.337+0000","up_votes":1,"down_votes":4,"body":"550? Yeah, just like every other ADC. Wanna know what 90% of the roster's auto range is? 125-175.","replies":[{"poster":"Viktor Von Lazer","date":"2017-07-24T12:47:51.839+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Sciela,realm=NA,application-id=3ErqAdtq,discussion-id=vfX9eP66,comment-id=00020000,timestamp=2017-07-24T11:57:10.337+0000)\n>\n> 550? Yeah, just like every other ADC. Wanna know what 90% of the roster&#x27;s auto range is? 125-175.\n\nLike every other? hello Ashe and Cait. Do you know there are also things called abilities as wel? which is what you use for the majority of the lane phase. Their abilities out range her.","replies":[]}]}]}]}