{"poster":"Eunji carry me","date":"2015-08-03T18:32:51.113+0000","title":"Warum bestraft werden für das AFK-Gehen, obwohl trotzdem vor hat zu surrendern? :D","subforum":"Allgemeiner Chat","up_votes":1,"down_votes":8,"body":"Also hier ist meine Story: Ich habe in einem game, eine Vayne und einen Olaf gehabt, die rumgetrollt haben. Nun mit rumtrollen meine ich in den Gegner hirnlos laufen und sich umbringen lassen. Da ich wusste, dass wir das Spiel somit nicht mehr gewinnen werden und da das Spiel nur an den Nerven zieht, bin ich AFK gegangen. Ich war AFK f&uuml;r ( GANZE ) 5 Minuten in einem wertlosen Spiel und kassiere 5 Spiele mit Low-Priority-Queue. Also frag ich mich, warum werde ich f&uuml;r sowas bestraft??{{champion:32}}","replies":[{"poster":"Zamonianer","date":"2015-08-03T19:23:14.798+0000","up_votes":3,"down_votes":0,"body":"Ein Spiel und niedrige Priorität? Wieso kommt mir das nur irgendwie unglaubwürdig vor...\nDavon abgesehen: Nur weil etwas geplant war (und vermutlich geschehen wäre), was die \"Straftat\" mehr oder weniger \"negiert\", ist es immer noch verboten.\nDiese Logik ist ungefähr so wie \"Sie können mich doch nicht für diesen Diebstahl bestrafen, die Firma hätte eh Konkurs anmelden müssen!\"... oder noch extremer \"Er wollte doch Suizid begehen, wieso wollen sie mich dann für den Mord belangen?\"...\n\nGruß,\nZamo","replies":[]},{"poster":"Marksmansitter","date":"2015-08-04T06:39:55.423+0000","up_votes":1,"down_votes":0,"body":"Alleine die frage wieso man nicht afk gehen darf wenn man denkt das man sowieso verloren hat .......\n\nDie Brasilianer sind nach dem 0:4 bei der Fußball-WM auch nicht einfach so vom Platz gegangen ;) außerdem gibt es ab und zu spiele die plötzlich gedreht werden können .. besonders im late game.","replies":[{"poster":"chilledkroete","date":"2015-08-05T09:00:17.462+0000","up_votes":2,"down_votes":0,"body":"Das können die Brasilianer dann ja in ein paar Jahren nochmal üben.^^\n\n7:1, never forget","replies":[]}]},{"poster":"Blurm","date":"2015-08-03T18:50:40.455+0000","up_votes":2,"down_votes":2,"body":">kassiere 5 Spiele mit Low-Priority-Queue.\n\nWenn du in älteren Posts hier im Forum guckst, wirst du sehen, das einige in den letzten Tagen für einfaches 5-Minuten-afk-sein 'n 2 Wochen Bann bekommen haben, also schätz dich glücklich.\n\n> Ich war AFK für ( GANZE ) 5 Minuten in einem wertlosen Spiel\n\nLeavebuster is watching YOU, nicht das Game. Außerdem gibt es nie einen gerechten Grund afk zugehen, schließlich kann man selbst SPiele mit 2 Total-Feedern noch wenden.","replies":[{"poster":"Darkr3sQ","date":"2015-08-03T20:45:45.548+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Blurm,realm=EUW,application-id=YnZkMR0R,discussion-id=IB4WAHuo,comment-id=0001,timestamp=2015-08-03T18:50:40.455+0000)\n>\n> Wenn du in älteren Posts hier im Forum guckst, wirst du sehen, das einige in den letzten Tagen für einfaches 5-Minuten-afk-sein 'n 2 Wochen Bann bekommen haben, also schätz dich glücklich.\n\nDas scheint irgendwie an mir vorbei gegangen zu sein.\nMeines Wissens bekommt man diese 14 Tage bzw. Perma-Sperre nur für\n- Negatives Verhalten im Chat\n- Nutzen von 3rd-Party-Programmen\n- Eloboost\n\nDarüber hinaus bekommt man ne Email, die einen informiert. Für AFK, so zumindest mein Wissensstand, bekommt man lediglich die Low Priority Queue.","replies":[{"poster":"Blurm","date":"2015-08-04T11:10:43.629+0000","up_votes":1,"down_votes":0,"body":"Einige haben neulich auch gejammert, das die wegen Afk 2 Wochen bekommen haben :D","replies":[{"poster":"Darkr3sQ","date":"2015-08-05T04:35:20.928+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Blurm,realm=EUW,application-id=YnZkMR0R,discussion-id=IB4WAHuo,comment-id=000100000000,timestamp=2015-08-04T11:10:43.629+0000)\n>\n> Einige haben neulich auch gejammert, das die wegen Afk 2 Wochen bekommen haben :D\n\nJammern kann man viel. Wie gesagt: Es wäre mir neu, wenn es aktuell für AFK etwas anderes gibt, als die Low Priority Queue. Ich habe jetzt auch durch eine Google-Suche keinen Thread gefunden, wo sich über einen 14 Tage bann wegen AFK-gehen beschwert wurde.","replies":[]}]}]}]},{"poster":"o bAshTi o","date":"2015-08-03T18:39:13.936+0000","up_votes":1,"down_votes":0,"body":"Weil das System automatisiert ist und keine anderen Faktoren berücksichtigen kann, als AFK-Zeiten.","replies":[]}]}