{"poster":"Predone00","date":"2016-02-12T23:06:41.038+0000","title":"Ma si rischia veramente il ban?","subforum":"Discussioni generali","up_votes":2,"down_votes":4,"body":"Ragazzi una domanda, ho iniziato a giocare a lol da qualche mese il gioco &egrave; fantastico ,entusiasmante ecc...\r\nLa domanda che mi sorge &egrave; :i tempi di penalit&agrave; per abbandono afk si vanno sempre a sommare o dopo un po&#039;di tempo di annullano perch&egrave; beh, non mi andrebbe molto di beccarmi una bann .\r\nGrazie :)","replies":[{"poster":"beozo","date":"2016-02-13T00:15:56.655+0000","up_votes":12,"down_votes":1,"body":"se parti col presupposto di andare afk puoi disinstallare lol","replies":[{"poster":"TheAwesomeJ","date":"2016-02-13T00:24:30.884+0000","up_votes":3,"down_votes":2,"body":"Peccato che posso mettere solo un +1 per volta.","replies":[]}]},{"poster":"Capoz","date":"2016-02-12T23:33:40.854+0000","up_votes":4,"down_votes":0,"body":"Basta non andare AFK ;)","replies":[]},{"poster":"Elle C","date":"2016-02-13T02:27:47.428+0000","up_votes":2,"down_votes":0,"body":"Detto terra terra le penalità vanno in crescendo... Prima ti becchi varie le code a bassa priorità poi se ti dimostri recidivo e insisti col tuo comportamento negativo il tuo account viene bannato per periodi di volta in volta più lunghi fino al permaban... La pulizia della \"fedina\" per \"buona condotta\" avviene se durante un certo periodo di tempo di gioco dopo la tua ultima infrazione non hai commesso quello o altri atti recriminati dalla riot... In questa eventualità ti arriverà una notifica dalla riot con scritto che ti sei dimostrato un giocatore positivo per la community... È bene specificare ancora che si parla di tempo di gioco quindi se lasci laccount inutilizzato per un mese la tua fedina rimarrà comunque in fase di verifica","replies":[]},{"poster":"luxetumbra","date":"2016-02-12T23:29:25.819+0000","up_votes":3,"down_votes":1,"body":"Il sistema di penalità per afk attribuisce un valore di \"tossicità\" al tuo account maggiore é questo valore più alte saranno le penalità minore é il calore più basse saranno le stesse, per aumentare questo valore bisogna semplicemente andare afk, di contro per abbassarlo basta giocare molte partite senza andare afk.\nQuindi se smetti per un po' (si parla di mesi) di andare afk non rischi il ban per un afk dovuto a un problema improvviso o a un problema tecnico.","replies":[]},{"poster":"Aegis Winebeard","date":"2016-02-13T07:11:42.434+0000","up_votes":1,"down_votes":0,"body":"È una cosa che vedo spessissimo: i nuovi giocatori proprio non lo capiscono che non devono andarsene dalle partite.\nHo fatto avvicinare una decina di miei amici al gioco oramai e, tra questi, diversi ci hanno messo parecchio a capire questa cosa.\nUno si è perfino fatto permabannare un account.\n\nSTACCI attento: Lol rimane un gioco online, lasciare le partite rovina l'esperienza degli altri giocatori, è facilissimo prendere un ban per questo.\nTutti i report sono bene o male con l'obbiettivo di punire persone che rovinano l'esperienza ad altri e, in particolare, andare afk è una delle più punite.\nQuindi, non abbandonare e sarai sicuro di stare bene, continua e verrai permabannato di sicuro.","replies":[]},{"poster":"IwillReportYouXD","date":"2016-02-12T23:35:55.107+0000","up_votes":1,"down_votes":8,"body":"non ti banneranno mai, sai quanti afk ci sono e non li fanno nulla...","replies":[{"poster":"Elle C","date":"2016-02-13T02:20:13.597+0000","up_votes":2,"down_votes":0,"body":"Stronzate...","replies":[]}]}]}