{"poster":"Kamedin","date":"2018-01-23T17:14:15.024+0000","title":"\"Meine Teammates sind schlecht\" ist ne Ausrede","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":17,"body":"Hallo, das wird hier nicht der sehr wahrscheinlich häufige Beitrag \"Ich verliere immer, weil meine Mates so schlecht sind, obwohl ich der übelst super krasse challenger bin\"\r\n\r\nWie viele auch stehe ich vor dem Problem, dass ich aus Bronze nicht rauskomme, und mit vielen habe ich auch oft als Gespräch, dass ich Mates habe, dessen Gehirn bei der Geburt aus irgendeinem Grund entnommen worden zu sein scheint.\r\n\r\nFirst of all, ich bin selber nicht der Profi schlechthin und bei mir ist auch Luft nach oben.\r\n\r\n Also haqbe ich mich mit vielen Spielern unterhalten (Paltin oder höher), bevorzugt nur Paltin oder höher und in einer Sache waren die sich alle einig.\r\n\r\nIch solle das Spiel halt carrien (keine ahnung wie man das schreibt, juckt mich auch nicht) und praktisch so geil spielen dass ich die Fehler der anderen ausmerze.\r\n\r\nIn einigen Punkten verstehe ich das auch. Dass ich selber \"safe\" spiele, nicht zu greedy bin um ein unbeabsichtigtes feeden meinerseits zu vermeiden, dass ich eine mapawareness entwickle um rechtzeitig zu roamen und damit anderen lanes zu helfen und/oder zu ss´en.\r\n\r\nJetzt liste ich mal einige Punkte auf, die es mir unmöglich machen, das Spiel so zu beeinflussen, dass es egal ist, wie schlecht meine mates sind\r\n\r\n> Chasing to death : ich habe das wirklich JEDES Spiel dass midnestens einer einem Gegner hinterherläuft, weil er low ist, obwohl besagter mate selber unter 200 HP ist, was ihn aber nicht daran hindert, trotzdem in den Tower reinzuspringen. Und als wäre das keine Lektion, aus der er lernt, nein, jedes verdammte mal bringt der selbe spieler den selben mist\r\n\r\n> Focus the Tank : Von den Teamfights ganz zu schweigen. Ebenfalls ein Fall, der JEDES spiel bei mir vorkommt. Der gegnerische Tank tacht auf. Und als wäre er ein roter Laserpoint - Punkt und meine Mates Katzen, fangen sie an, einen Garen mit 4000-5000k Leben in seinen Tower zu chasen. Dort wartet schon der Rest des Gegnerteams und schlachtet mein ganzes Team ab. Auch ein Ding, wo man sagt, okay, machen wir nicht wieder, die verarschen uns, NEIN! Jedes mal der selbe Mist\r\n\r\n> Baron und Dragons : wie gesagt, ich bin nicht der beste, aber ich habe in sämtlichen Spielen die Erfahrung gemacht, dass man sich dem Baron und nem Dragon witmen sollte, wenn Ein großteil des Gegnerteams tot (inkl. Jungler) und hinter dem epischen Monster Vision ist, das wenn ein Steal versuch der Gegner unternommen wird, amn das frühzeit erkennen und kontern kann. ERST RECHT; WENN MAN EH SCHON VOM ANDEREN TEAM DOMINIERT WIRD.\r\nIhr könnt euch denken, was ich meine oder?\r\n\r\n>  Ab und an waren wir auch mal das dominierende Team und der Sieg stand uns eigentlich sicher. Selbst in jedem Teamfight haben wir ein gutes Bild abegegeben. Wieso ich an solchen Situationen trotzdem IMMER verliere ist die Tatsache, dass urplötzlich die Leute anfangen, komisch zu ticken. Eoin Teamfight geht los, und JEDES mal verpissen sich mindestens 2 Mates, weil sie meinen noch eben das Greifvogellager zu vernichten, MITTEN IM FIGHT, und obwohl DEREN BUILD VOLL IST! Fazit: Teamfight verloren, weil die restlichen 3 bzw 2 einfach weiter fighten weil hat ja das ganze Spiel geklappt, wird jeze auch klappen, sterben, die gegner pushen einmal, zack, verloren\r\n\r\nAbgesehen von diesen zwei hauptgründen weshalb wir immer verlieren, gibt es massig andere, aber mein Punkt ist, dass ich auf diese Dummheit keinen Einfluss habe. Wenn am Ende eine Kata 22/2 steht und eine 24/3 Vayne da kann ich ein noch so guter Carry sein.\r\n\r\nAber wenn mir Paltin udn Dia Spieler sagen, das geht, dann muss das ja gehen. Also:\r\n\r\nEs muss ja irgendwelche Tricks und Kniffe geben, wie man das Spiel zugunsten meines Teams beeinflussen kann, auch wenn 4/5 Spielern scheiße sind.\r\nIch rede hier von angeblich unbekannten Tipps, die aber reiner Menschenverstand sind, aber trotzdem irgendwie keiner weiß0, zum Beispiel wie wichtig Vision ist etc\r\n\r\nIch war letzte Season Silber(habe erst aber der Haälfte der Season angefangen mit ranked und zwischenzeitlich 2 Monate Pause gemacht)\r\nWollte diese Season durchstarten bis Gold (weil ich glaube dass ich von der Leistung her in Gold gut aufgehoben bin) mit einer kleinen Liebäuglerei zu Platin.\r\nNaja, platziert wurde ich B4, war bis gestern abend B3 und bin jetzt B5 eben wegen den genannten Scheiß dingen.\r\n\r\nMittlerweile zocke ich als ADC mit TP damit ich, wenn sich die Situation ergibt, Backdoor Stück für Stück Tower für Tower kaputt mache.\r\n\r\nja ich weiß, das ist auch der falsche Weg, an der Loose rate macht das auch nichts, aber zumindest sind wir dem Sieg dann immer deutlich näher.\r\n\r\nIngame ist dann jeder der absloute LOL Experte, ich hoffe von denen gibts hier auch genug die mir gute Tipps geben können.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nPS: Achja abgesehen von dem Beitrag wollte ich nur eben anmerken, dass jeder Spieler seine Persönliche schwarze Liste haben sollte, in die man jeden Stecken kann, der nach einem Spiel mindestens 5 Reports kriegt, damit man mit dem nie wieder in ein matchmaking kommt. halbes jahr, dann merken diese ganzen leute, die wegen EINEM KS (die es meiner meinung nach nicht gibt) anfangen zu trollen, dass sie kein Spiel machen können, weil eben keiner mit denen zocken will.","replies":[{"poster":"Nohgolgh","date":"2018-01-24T03:34:22.121+0000","up_votes":12,"down_votes":0,"body":">Hallo, das wird hier nicht der sehr wahrscheinlich häufige Beitrag \"Ich verliere immer, weil meine Mates so schlecht sind, obwohl ich der übelst super krasse challenger bin\"\n\nDoch geanu das wird er. \n\n>Wie viele auch stehe ich vor dem Problem, dass ich aus Bronze nicht rauskomme, und mit vielen habe ich auch oft als Gespräch, dass ich Mates habe, dessen Gehirn bei der Geburt aus irgendeinem Grund entnommen worden zu sein scheint.\n\nDeine Mates und deine Gegner werden nach MMR mit dir gematcht. Offensichtlich braucht man dann kein Hirn, um dich zu schlagen, sondern kann dies über das Rückenmark erledigen. \n\n>Ich solle das Spiel halt carrien (keine ahnung wie man das schreibt, juckt mich auch nicht) und praktisch so geil spielen dass ich die Fehler der anderen ausmerze.\n\nNein, das stimmt so nicht. Um (langfristig) zu climben, musst du nur besser sein, als der mittlere Spieler deiner MMR. Hierbei gibt es jedoch ein paar Dinge zu beachten. \n\n1. Wenn du einen Champion spielst, der alleinig geringen Impact hat (z.B einen Tank), dann wird dein climb wesentlich länger dauern. \n2. Das Maß für \"besser\" ist schwierig zu fassen. Schließlich gibt es viele verschiedene Skillsets, die ein Spieler haben kann, zum Beispiel CSing, Trading, Warding, map awareness, Itemization, Mechanics (die dann auch noch massiv vom Champion abhängen), decision making, champion knowledge, objective control. Man muss nicht in allen Kategorien besser sein als seine jetzige MMR und die Kategorien spielen unterschiedlich stark rein. Für Bronze sind generell gesprochen jedoch Csing, Trading und map awarness diejenigen, die primär am meisten bringen. Noch RELATIV wchtig ist Itemization, den Rest würde ich erstmal ignorieren, bis ich mittleres Silber bin. \n\nUnd in keinem des Aspekte scheinst du gut zu sein: \n\nhttps://matchhistory.euw.leagueoflegends.com/de/#match-details/EUW1/3503377881/36188572?tab=overview\n\nDu hast das geringste Gold im ganzen Spiel, weniger als dein Support. Du hast das niegrigste Level im ganzen Spiel, derjenige mit dem höchsten Level ist vier Level über dir. Dies ist zu erklären über deine lausige CS-Quote von 43%. Um aus Bronze rauszukommen sollte diese im Mittel bei 50%-60% liegen. In der Lane scheinst du die Cs nicht zu treffen und dein Interplay mit der Map setzt dich noch weiter zurück, da du nicht einmal mehr die Erfahrung aufsaugst. \n\nDas führt dann auch dazu, dass du mit einer Vayne mit nur einem Item rumläufst, während deine Gegner mit zwei, teilweise drei Gegenständen rumlaufen. Klar bleibt dein Schaden dann zurück. Der Thresh hat mit seinen zwei Gegenständen länger durchhalten können und dementsprechend merh Schaden gemacht als du. \n\nDu hast in 24 Minuten gerade mal vier wards gesetzt. Das ist einer alle sechs Minuten. Selbst, wenn du nur dein Trinket benutzen würdest und permanent Level eins sein würdest, könntest du einen Ward alle drei Minuten auf die Map bringen. Dementsprechend sieht man auch nichts und wird jedesmal vom Jungler oder Midlaner überrascht. \n\nDeine Itemization halte ich auch für fragwürdig, wobei das bei einem Item nicht abschließend beurteil werden kann. Ich bin kein Vayne-Spieler und kann dementsprechend in diesem Aspekt nur semikompetente Antworten geben. Ich halte den Start mit Infinity Edge für falsch, gerade wenn man behind fällt. Der voll ausbau lohnt sich nicht wirklich, weil man nur 20% Crit hat. Das Infinity Edge würde ich nur dann fertig stellen, wenn ich übelst snowballe. Die Validen Optionen für mich wären gewesen, entweder auf die Klinge des gestürzten Königs zu gehen (stärkster Einzelpowerspike von allen Builds und dementsprechend vermutlich die beste Option wenn behind). Nur das Statics zu bauen (gibt Angriffstempo für die W und Waveclear, ohne sich selsbt zu sehr gefährden zu müssen) oder erst ein Riesenschwert zu bauen, um Ad zu haben und dieses erst nach dem Statics zur Klinge der Unendlichkeit auszubauen (oder sogar erst nach Rapidfire+Statics). \n\nAllein von den Stats her, kann ich dir sagen, dass vermutlich du der schlechteste Spieler im ganzen Team warst. \n\n\n\n> Chasing to death : ich habe das wirklich JEDES Spiel dass midnestens einer einem Gegner hinterherläuft, weil er low ist, obwohl besagter mate selber unter 200 HP ist, was ihn aber nicht daran hindert, trotzdem in den Tower reinzuspringen. Und als wäre das keine Lektion, aus der er lernt, nein, jedes verdammte mal bringt der selbe spieler den selben mist\n\nErstmal ist chasen tatsächlich etwas, was einem das Spiel sehr schnell verlieren kann. Ironischerweise wird sich über den Chase nicht oder seltener beschwert, wenn dieser erfolgreich war. Es war trotzdem ein schlechter Spielzug. Ich glaube dir allerdings nicht, dass du dich nicht daran beteiligst oder irgendetwas sinnvolles stattdessen machst. Zudem handelt es sich beim Chasen eher um Phänomen des Mid. und Lategames. In bronze kommt es tatsächlich vor allem darauf an, seine ersten zehn Minuten solide runterzuspielen. \n\n> Focus the Tank : Von den Teamfights ganz zu schweigen. \n\nIch finde diese Bronze-Logik immer wieder amüsant. Dein Ziel im Teamfight ist es, die gegnerische Frontline auszuschalten, bevor deine Frontline weg ist. Focus the Tank ist genau das Richtige. Die Teamfights in bronze gehen oftmals genau deswegen verloren, weil sich ein paar Helden denken, dass es doch eine gute Idee ist, am Tank vorbeizulaufen. Wenn du am Tank vorbeirennst, um die gegnerische Backline anzugreifen, dann focust der Tank und die gesamte Backline dich, weil du plötzlich zur frontline geworden bist. Und grundsätzlich reagieren adcs allergisch auf CC. Es ist DEIN JOB, den Tank fertig zu machen. \n\n>Ebenfalls ein Fall, der JEDES spiel bei mir vorkommt. Der gegnerische Tank tacht auf. Und als wäre er ein roter Laserpoint - Punkt und meine Mates Katzen, fangen sie an, einen Garen mit 4000-5000k Leben in seinen Tower zu chasen. Dort wartet schon der Rest des Gegnerteams und schlachtet mein ganzes Team ab. Auch ein Ding, wo man sagt, okay, machen wir nicht wieder, die verarschen uns, NEIN! Jedes mal der selbe Mist.\n\nDas ist die Chasebeschwerde, zu der ich mich bereits geäußert habe. \n\n> Baron und Dragons : wie gesagt, ich bin nicht der beste, aber ich habe in sämtlichen Spielen die Erfahrung gemacht, dass man sich dem Baron und nem Dragon witmen sollte, wenn Ein großteil des Gegnerteams tot (inkl. Jungler) und hinter dem epischen Monster Vision ist, das wenn ein Steal versuch der Gegner unternommen wird, amn das frühzeit erkennen und kontern kann. ERST RECHT; WENN MAN EH SCHON VOM ANDEREN TEAM DOMINIERT WIRD.\nIhr könnt euch denken, was ich meine oder?\n\nDeine Erfahrung ist falsch. Ein weiteres Problem von Bronze-Spielern, ist es Drachen hoffnungslos überzubewerten und Türme hoffnungslos unterzubewerten. \n\nAls ganz gute Nutzenbewertung hat sich für mich rausgestellt: \n\nInhibitor-Turm+ Inhibitor>2 Türme> Baron=Inhibitor>Inhibitor-Turm>sonstiger Turm>Ozeandrache (innerhalb erster 10 Minuten)> Infernaldrache>1 Minionwelle>Bergdrache>Ozeandrache (nach 10 Minuten)>Winddrache \n\nBegründung: Baron und Inhibitor geben direkten Druck auf die Basis, da sie dir pushende Waves verpassen. Der Inhibitorturm öffnet die Basis und macht es damit oft unnötig, den riskanten Baron zu holen. Alle anderen Türme geben massiv Gold, lassen deine Wave weiter pushen (=Vision auf der Map) und nehmen dem gegner Vision und einen Rückzugsort. Der Ozeandrache erhöht dein Tradepotential innerhalb der Lane massiv, während der Infernaldrache einen geringen aber sehr konsistenten Bonus darstellt. Somit kann man bei beiden verantowrten, die erfahrung einer Wave zu verlieren (obwohl das nicht schon ist). bei den anderen beiden Drachen und beim Ozeandrachen nach der Laningphase erhältst du keinen konsistenten Bonus und wenn du behind bist, dann wird der Gegner  Trades und Engage suchen (Ozeandrache braucht Ruhepahse zwischen Trades), du wirst Objectives deffen und nicht pressuren müssen (Bergdrache bringt dann nichts) und du wirst dementsprechend mehr reagierend als agierend speilen, was Mapbewegung bedeutet (Winddrache nicht so toll). \n\nDem Nutzen muss aber ein Risiko gegenübergestellt werden. So ist der Baron oft ein riskanter Call. \n\n>Ab und an waren wir auch mal das dominierende Team und der Sieg stand uns eigentlich sicher. Selbst in jedem Teamfight haben wir ein gutes Bild abegegeben. Wieso ich an solchen Situationen trotzdem IMMER verliere ist die Tatsache, dass urplötzlich die Leute anfangen, komisch zu ticken. Eoin Teamfight geht los, und JEDES mal verpissen sich mindestens 2 Mates, weil sie meinen noch eben das Greifvogellager zu vernichten, MITTEN IM FIGHT, und obwohl DEREN BUILD VOLL IST! Fazit: Teamfight verloren, weil die restlichen 3 bzw 2 einfach weiter fighten weil hat ja das ganze Spiel geklappt, wird jeze auch klappen, sterben, die gegner pushen einmal, zack, verloren\n\nIch habe NICHT EIN EINZIGES SPIEL  auf den letzten 20 Spielen in deiner Matchhistory gefunden, wo ihr übel gut wart, am Fullbuild und dann den Teamfight verloren habt. Außerdem sind random Teamfigths sowieso ein Problem in Bronze. Jedesmal wenn ihr groupt und einen random fight anfangt, verliert Xp auf den Sidelanes und riskiert, das Spiel zu verlieren. Man kloppt sich nur, wenn man etwas gewinnen kann, was das Risiko wert ist. \n\n>Abgesehen von diesen zwei hauptgründen weshalb wir immer verlieren, gibt es massig andere, aber mein Punkt ist, dass ich auf diese Dummheit keinen Einfluss habe. Wenn am Ende eine Kata 22/2 steht und eine 24/3 Vayne da kann ich ein noch so guter Carry sein.\n\nZwei Shutdowns auf die Kata und ihr ganzer Lead ist weg. Je länger das game dauert, desto schwere wird es für Kata relevant zu bleiben.  Vayne ist natürlich ein anderes Kaliber. In deinen letzten 60 Spielen findet sich übrigens keines, wo das von dir beschriebende Szenario eingetreten ist.","replies":[{"poster":"Nohgolgh","date":"2018-01-24T04:06:26.884+0000","up_votes":5,"down_votes":0,"body":">Es muss ja irgendwelche Tricks und Kniffe geben, wie man das Spiel zugunsten meines Teams beeinflussen kann, auch wenn 4/5 Spielern scheiße sind.\nIch rede hier von angeblich unbekannten Tipps, die aber reiner Menschenverstand sind, aber trotzdem irgendwie keiner weiß0, zum Beispiel wie wichtig Vision ist etc. \n\nNaja, das scheinst du offensichtlich nicht zu wissen. Ein Beispiel habe ich dir bereits in deinem letzten Spiel genannt. \n\n\"Aber das war ja ein verlorenes Spiel. Da waren die pösen Partner dran schuld...\"\n\nNun in den gewonnenn Spielen bist du nicht zwangsläufig besser. \n\n\nhttps://matchhistory.euw.leagueoflegends.com/de/#match-details/EUW1/3503318556/36188572?tab=overview\n\nDeine CS-Quote ist 50% Du hast drei Items als Vayne und in einem 35 Minuten-Spiel gerade mal 8,5 K schaden gemacht, was zwei Drittel deines Supportes Tahm kench sind. Damit hast du den neidrigsten Schaden im gesamten Spiel gemacht. Goldtechnisch, bist du keine 100 Gold vor deinem Support.  Jeder hat in diesem Spiel gute Stats außer du. Du wurdest hart gecarried. \n\nDein Warding ist mit 7 Wards wieder mal unter aller Sau. \n\nUnd ich habe nicht besonders schlechte Spiele herausgepickt. Dein Warding ist grundsätzlich unter aller Sau. Auf deinen letzten 25 Spielen, war geanu eines dabei, wo man sagen kann, dass du vernünftig gewardet hast ( [das](https://matchhistory.euw.leagueoflegends.com/de/#match-details/EUW1/3502060265/36188572?tab=overview) . ).\n\n>Ich war letzte Season Silber(habe erst aber der Haälfte der Season angefangen mit ranked und zwischenzeitlich 2 Monate Pause gemacht)\n\nNein, du hast auf Bronze 3 geendet,mit einer negativen Winrate. Du wurdest Silber eingerankt, aber das Spiel hat entschieden, dass du da nicht hingehörtst (zu Recht). \n\n>Wollte diese Season durchstarten bis Gold (weil ich glaube dass ich von der Leistung her in Gold gut aufgehoben bin) mit einer kleinen Liebäuglerei zu Platin.\n\nPlatin wird nichts. Wenn du dich super hart reinhängst und eine steile Lernkurve hinlegst, dann ist low gold drin. Aber nur dann. Um ins untere Silber zu kommen, musst du erstmal die Basics können, was nicht der Fall ist. \n\n>Naja, platziert wurde ich B4, war bis gestern abend B3 und bin jetzt B5 eben wegen den genannten Scheiß dingen.\n\nDu bist im unteren  Bronze, weil du nicht ein einziges der Basics drauf hast. \n\n>Mittlerweile zocke ich als ADC mit TP damit ich, wenn sich die Situation ergibt, Backdoor Stück für Stück Tower für Tower kaputt mache.\n\nJa... Wieso nicht gleich unter den gegnerischen Turm rennen, wenn man den Summoner aufgibt, der im 2v2 beiden Spielern Extraleben gibt. \n\n>ja ich weiß, das ist auch der falsche Weg, an der Loose rate macht das auch nichts, aber zumindest sind wir dem Sieg dann immer deutlich näher.\n\nWenn es nichts bringt, außer, dass du dich gut fühlst, dann lass es. Ihr verliert mit so etwas die Lane. \n\n>PS: Achja abgesehen von dem Beitrag wollte ich nur eben anmerken, dass jeder Spieler seine Persönliche schwarze Liste haben sollte, in die man jeden Stecken kann, der nach einem Spiel mindestens 5 Reports kriegt, damit man mit dem nie wieder in ein matchmaking kommt. halbes jahr, dann merken diese ganzen leute, die wegen EINEM KS (die es meiner meinung nach nicht gibt) anfangen zu trollen, dass sie kein Spiel machen können, weil eben keiner mit denen zocken will.\n\nIch glaube du unterschätzt die Anzahl der Spieler auf dem Server. Deswegen gibt es die Report-Funktion.","replies":[]}]},{"poster":"Kamedin","date":"2018-02-02T09:09:41.870+0000","up_votes":1,"down_votes":3,"body":"Oh cool, wieso dachte ich dass dieser Thread gelöscht wurde. An die wenigen, die mir eine vernünftige Antwort gaben, sehr herzlichen Dank, muss ich halt einsehen dass es ein Gedulds- und vor allem ein Glücksspiel ist, irgendwann hochzukommen. Bin im Moment Bronze 2. sieht aber danach aus dass ich bald wieder runterfalle auf B3, wo ich diesesn Monat dann schon das vierte mal wäre :D\n\nDer Gerät LoL: \n\ndanke, einfach nur danke, ich kann dir in jedem erdenklichen Punkt einfach nur zustimmen..\n\nSirrkas: \n\nIch weiß nicht ob du schwer von Begriiff bist oder mit Absicht so tust, weil du ja so ein feiner ober mega hammer pro bist, auf jeden fall hättest vor allem DU dir deine Kommis sparen können\n\nUnd du hast mir zugesehen? Toll, wüsste gerne wie du das gemacht hast :D\n\nMindMinder:\n\nehm ja ok, Mister Weiß-Alles-Besser\n\nNohgolgh:\n\nFinde ich toll, dass du dir die Mühe gemacht hast, so einen langen Text zu schreiben, aber nach den ersten zwei/drei Quotes weigere ich mich weiter zu lesen, schade alles umsonst.\n\nIch finde das alles eine absolute Frechheit, wie du meinst, mich hier zu beleidigen, obwohl ich einen Sachlichen Thread reingestellt habe.\nDu, mein Freund, kannst dich glücklich schätzen, wir nicht gegenüber stehen, sonst würdest du nicht mal Ansatzweise dein Maul soweit aufmachen, und wenn, würdest du es sehr schnell bereuen, du geboosteter Möchtegernprofi.\n\nUnd das ist auch ein Ding was ich am Spiel hasse, bzw an der Anonymität des Internets. Solche möchtegern Proller die online einen auf erhaben tun und meinen, so scheiße mit anderen umzugehen, aber ich wahren Leben DIE Versager schlechthin sind. Mach weiter so mein Freund, du wirst sehen was du davon hast..","replies":[{"poster":"eingew","date":"2018-02-03T08:02:40.784+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Kamedin,realm=EUW,application-id=KYnfKGf0,discussion-id=znhTiyqh,comment-id=000f,timestamp=2018-02-02T09:09:41.870+0000)\n>\n> Oh cool, wieso dachte ich dass dieser Thread gelöscht wurde.\n\nSofern du einen Thread nicht selbst löschst taucht oben rechts neben deinem Namen bei dem kleinen Ausrufezeichensymbol eine Zahl auf, ähnlich wie du daneben auch die Antworten auf deinen Thread oder deine Kommentare aufrufen kannst.\n\n> Nohgolgh:\n> \n> Finde ich toll, dass du dir die Mühe gemacht hast, so einen langen Text zu schreiben, aber nach den ersten zwei/drei Quotes weigere ich mich weiter zu lesen, schade alles umsonst.\n\nIch habe das Gefühl, dass du die Dinge viel zu persönlich nimmst. Immerhin warst *du* es, der angefangen hat auf diesem Ton auszuteilen und jetzt beschwerst du dich, wenn jemand die Leute, bei denen es dich offenbar nicht gestört hat, sie so zu beleidigen, in Schutz nimmt und dir sagt, dass du kein Stück besser bist? Eine Ziemliche Doppelmoral, wenn du mich fragst.\n\nNohgolgh hat dir einige gute Tipps da gelassen. Vielleicht war der Ton unangemessen, das bedeutet aber nicht, dass sein Kommentar wertlos ist.\n\n> Ich finde das alles eine absolute Frechheit, wie du meinst, mich hier zu beleidigen, obwohl ich einen Sachlichen Thread reingestellt habe.\n\nLies nochmal das zweite Zitat, was Nohogolgh da in seinem Kommentar angegeben hat. Bist du dir sicher, dass sich das als sachlich bezeichnen lässt? Und wenn du dir deinen Thread nochmal durchliest und dabei ehrlich zu dir selbst bist, bin ich mir sicher, dass du auch einige andere Formulierungen findest, die sich sicher nicht als sachlich bezeichnen lassen. Jedenfalls würdest du, würde jemand so über dich reden, dich vermutlich aufregen. Jedenfalls tust du das gerade, nachdem jemand zumindest teilweise so über dich geredet hat.\n\n> Du, mein Freund, kannst dich glücklich schätzen, wir nicht gegenüber stehen, sonst würdest du nicht mal Ansatzweise dein Maul soweit aufmachen, und wenn, würdest du es sehr schnell bereuen, du geboosteter Möchtegernprofi.\n\nWenn du so auch im Chat mit deinen Mitspielern umgehst, wundert es mich überhaupt nicht, dass diese tilten und schlechter Spielen. Aber das ist dann *dein* Verdienst, der dich weiter unten hält.\n\n> Und das ist auch ein Ding was ich am Spiel hasse, bzw an der Anonymität des Internets. Solche möchtegern Proller die online einen auf erhaben tun und meinen, so scheiße mit anderen umzugehen, aber ich wahren Leben DIE Versager schlechthin sind. Mach weiter so mein Freund, du wirst sehen was du davon hast..\n\nVielleicht solltest du damit anfangen, dich an deinen eigenen Standards zu messen, denn alles, was du hier so vorwurfsvoll bemängelst, hast du in deinem eigenen Verhalten längst selbst so gezeigt.","replies":[]},{"poster":"Sirrkas","date":"2018-02-05T12:10:34.768+0000","up_votes":2,"down_votes":0,"body":">Sirrkas:\n>\n>Ich weiß nicht ob du schwer von Begriiff bist oder mit Absicht so tust, weil du ja so ein feiner ober mega hammer pro bist, auf jeden fall hättest vor allem DU dir deine Kommis sparen können\n>\n>Und du hast mir zugesehen? Toll, wüsste gerne wie du das gemacht hast :D\n\nDas ist ziemlich einfach. Bei op.gg deinen Namen eingeben, wenn du gerade im Spiel bist, kann man das Live Game anklicken und dann zusehen. Und nach dem was ich da gesehen habe, kann ich nicht behaupten, dass du ein besonders guter Spieler wärst. Ob du Silber oder Bronze bist, ist mir egal. Du hast aber selber genug Fehler gemacht und das Spiel verlassen ist auch nicht gerade die feine englische Art.\n\nWenn man selber ein Leaver ist, sollte man sich nicht über andere Spieler beschweren, die man für Trolle hält.\n\nEs ist übrigens erheiternd zu sehen, wie du von \"Sirrkas war etwas hilfreich\" zu \"Sirrkas war nur gemein\" schwenkst.","replies":[]}]},{"poster":"Kamedin","date":"2018-01-23T17:49:07.161+0000","up_votes":2,"down_votes":9,"body":"Wow, also ich hab mir ja sagen lassen dass die lol community die ekelhafteste ist, die es gibt aber ich wollte es nicht glauben.\n\n---Allerbester Boss: Danke für die geilen Tipps zum Thema Gameplay, habe dir sogar ein Beispiel gegeben aber bist nicht in der Lage, einen Kniff aus deinen (wahrscheinlich profiähnlichen) Plays zu geben sondern einfach nen coolen Kommi dazulassen. Top\n\n\n---Angel Ayume: hast du dir meine Beispiele durchgelesen? Ich glaube nicht.\n\n\n---Sirrkas: Ich kann mich leider nicht daran errinnern, einen meiner Gegner jemals dafür ausgelacht zu haben, einen so dummen Fehler gemacht zu haben, wie die von mir beschriebenen\n\n---CMan: Naja hier musst du einfach davon ausgehen, dass ich mich ausgiebeig selbst reflektiere, was ich definitiv tue, bevor ich an ijemand anderes denke.\n   Und du scheinst auch nicht alles gelesen zu haben. Dieser \"Mist\" bringt mein Team zumindest öfter und knapper an den Sieg als wenn ich \"Ottonormal\" - Mäßig spiele\n\n\n\n\nNaja aufgrund der Tatsache dass ich hier anstatt konstruktiver Hilfe nur Müll kriege (auser Sirrkas mehr oder weniger), was ich leider auch befürchtet habe, kann dieser Thread auch geschlossen werden. Danke für die Hilfe...NICHT!","replies":[{"poster":"MeMyselfandBaal","date":"2018-01-23T19:13:10.172+0000","up_votes":5,"down_votes":0,"body":"Der erste gut gemeinte Tipp: Geh nicht AFK. Niemals. Es gibt keinen Grund AFK zu gehen. Und selbst wenn das Spiel beschissen steht und es hoffnungslos ist, kannst du immer noch was lernen. Zum Beispiel wie du dich als Vayne positionieren kannst um trotz eines Groldrückstandes noch Schaden rauszuhauen...\n\n2.) Lass das mit den Trollbuilds sein. Auch wenn du gegebenenfalls erst kurz vor Schluss deine Items verkaufst. Ich drehe ja jedes Jahr mehrere Spiele, in denen der Gegner mindestens einen Inhibitor zerstört. Wenn nicht sogar mehr. Weil ich auch in diesen Momenten möglichst effektive Items habe und mich voll darauf konzentriere, das Spiel noch zu drehen. Du scheinst innerlich immer wieder aufzugeben. Anders sind deine AD Items auf Leona und Zyra nicht zu erklären. \nVersuche unabhängig vom Spielstand immer das optimale aus deiner Position herauszuholen. Und selbst wenn es dir für dieses Spiel nichts mehr bringt... dann hilft es dir vielleicht im nächsten Spiel, wo der Abstand zum Gegner nicht so extrem ist.\nUnd gerade in Bronze, wo alle haufenweise Fehler machen... werden so viele sichere Siege theoretisch weggeworfen. Aber dann nimmt das andere Team den Throw nicht an, weil sie komplett getiltet sind... das ist nebenbei ein allgemeines SoloQue und kein Bronze Phänomen. In meinem einem Placement Spiel heute haben wir dem Gegner mindestens 4 Chancen auf ein Comeback gegeben, aber die sagten \"Nein Danke\"... \n\n3.) Suche dir mal nen paar Guides für nen paar anständige Runen. Wenn du in deinem Itembuild quasi komplett auf Lifesteal verzichtest, brauchst du den in den Runen anstelle des für die meisten ADCs ziemich sinnlosen Kometen. Gerade auf Vayne... also ich bin mir nicht sicher, ob der Q dem Kometen auslöst... wenn nicht, hast du mit deinem Condemn genau einen Spell, den du nutzen kannst, um den Kometen zu triggern... du kannst ja mal im Client nachgucken, wie viel Schaden du mit der Rune machst. Danach machst du dann ein Spiel mit Fleet Fotwork und vergleichst die Unterschiede.\n\n4.) Versuche mehr zu warden. Den Gegner kommen zu sehen hilft einem extrem dabei seine Angriffe zu überleben. Oder ihn im gewardeten Busch zu töten. Auch als ADC hast du ein Trinket, welches du regelmäßig nutzen kannst.\n\n5.) Lese dir die Itembeschreibungen nochmal durch und frage dich dann, ob deine Itembuilds so sinnvoll sind. Also selbst in deinem statistisch gesehen extrem guten Veigar Spiel triffst du halt schon auf den ersten Blick Entscheidungen, die einfach nur Kopfschütteln auslösen: 2 Mal Rabadons? Entschuldigung, aber wer so was macht, gehört definitiv nicht nach Gold. Rabadons ist so ziemlich das teuerst Item im Spiel. Hauptsächlich wegen dem \"Einmalig Passiv\" Teil. Sich diese einmalige Passive 2 Mal zu kaufen, bringt dir überhaupt nichts. Wenn du dir stattdessen nen Zhonyas kaufst und im richtigen Moment nutzt... oder nen Stab der Leere. Oder sonst irgendwas nützliches... dann erhöhst du deine Chancen dieses Spiel zu gewinnen.","replies":[{"poster":"Dermel","date":"2018-01-24T14:44:09.588+0000","up_votes":3,"down_votes":0,"body":"> Es gibt keinen Grund AFK zu gehen. \n\nAber wie sieht es aus mit:\nHausbrand?\nStromausfall?\nEntführung?\netc.\n\nheute bin ich aber wieder lustig\n{{sticker:zombie-brand-facepalm}}\n\nDavon abgesehen ist das hier ein sehr guter Leitfaden für viele Standardfehler in Bronze.","replies":[{"poster":"MeMyselfandBaal","date":"2018-01-24T16:02:49.794+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Dermel,realm=EUW,application-id=KYnfKGf0,discussion-id=znhTiyqh,comment-id=000700010000,timestamp=2018-01-24T14:44:09.588+0000)\n>\n> Aber wie sieht es aus mit:\n> Hausbrand?\n> Stromausfall?\n> Entführung?\n> etc.\n> \n> heute bin ich aber wieder lustig\n> {{sticker:zombie-brand-facepalm}}\n> \n> Davon abgesehen ist das hier ein sehr guter Leitfaden für viele Standardfehler in Bronze.\n\nWar natürlich eine Übertreibung... Richtig wäre: Es gibt keinen In Game Grund um AFK zu gehen...","replies":[]}]}]},{"poster":"Sirrkas","date":"2018-01-23T18:06:07.993+0000","up_votes":3,"down_votes":1,"body":">---Sirrkas: Ich kann mich leider nicht daran errinnern, einen meiner Gegner jemals dafür ausgelacht zu haben, einen so dummen Fehler gemacht zu haben, wie die von mir beschriebenen\n\nKeine Ahnung was du meinst. Wenn du aber dein eigenes Team auslachst, kann das zu einem Bann führen.\n\nWas mir zu dir auffällt. Als ADC hast du immer Arkaner Komet dabei. Warum? ADCs synergieren mit anderen Keystones deutlich besser. Etwa dem verzögerten Angriffstempobuff. \n\nEin Rush auf Inf Edge scheint mir nicht sonderlich schlau zu sein, für Vayne. Wenn du Hilfe zu Builds brauchst, sieh dir Guides an. Meistens gehen ADC auf {{item:1038}} und bauen dann etwas mit Attackspeed, etwa {{item:3087}}. Das sollte die DPS höher schrauben, als ein einzelnes {{item:3031}}.\n\nManchmal verkaufst du alle Items um dir unbrauchbare Items zu holen. Zwar kurz vor Spielende, aber das ist nicht hilfreich.\n\n>Naja aufgrund der Tatsache dass ich hier anstatt konstruktiver Hilfe nur Müll kriege (auser Sirrkas mehr oder weniger), was ich leider auch befürchtet habe, kann dieser Thread auch geschlossen werden. Danke für die Hilfe...NICHT!\n\nIch hab dir etwas zugesehen. Du läufst offenen Auges in einen Yasuo, stirbst fast und kannst nur überleben, weil du ihn an die Wand tackerst und fliehst. Kurz darauf läufst du in die Mitte. 3 Gegner. Nami ist gefählich nah an dir dran, sie wirkt ihre Bubble, du rollst rein und bist tot. Gehst afk und wärst sicher der erste in dem Spiel, der die 5 Reports erhalten hätte und damit auf der Blacklist der anderen steht. \n\nNach dem kurzen Abschnitt würde ich dich jetzt nicht als jemanden mit Platinpotential betrachten. Wenn du wirklich aufsteigen willst, musst du als erstes deine eigenen Fehler erkennen. Dann an denen arbeiten und üben. Dann steigt man von selbst auf.","replies":[{"poster":"T Ocean","date":"2018-01-23T21:26:36.818+0000","up_votes":1,"down_votes":3,"body":"> Keine Ahnung was du meinst. Wenn du aber dein eigenes Team auslachst, kann das zu einem Bann führen.\n> \n\nWieso das bitte? Ich wurde auch schon ausgelacht für dumme Fehler, aber ich bin kein so großer Spießer das ich mich gleich persönlich angegriffen fühle...","replies":[{"poster":"Sirrkas","date":"2018-01-23T21:41:31.228+0000","up_votes":2,"down_votes":0,"body":"Weil es ziemlich stark nach einem Verstoß gegen den Weg der Beschwörer klingt. \n\nhttps://euw.leagueoflegends.com/de/featured/summoners-code","replies":[{"poster":"T Ocean","date":"2018-01-23T22:13:42.649+0000","up_votes":2,"down_votes":3,"body":"Das kling für mich nach einem verstoß gegen meinen Humor.\nWenn ich in echt ausrutsche lachen meine Freunde auch, aber da lache ich lieber mit als sie aus meinem Leben zu sperren haha :)\nAber jetzt ernsthaft nehmt nicht alles so extrem ernst, es ist und bleibt ein Spiel und Riot hat bestimmte regeln was ich auch verstehe.\n\nAber es gibt einen unterschied bei auslachen und fertigmachen/blamen, jeder in meinem Team schreibt auch 'hahahah' wenn ich aus versehen gegen eine Wall flashe, da gebe ich lieber zu das es dumm war als mich zu beschweren :)","replies":[{"poster":"Sirrkas","date":"2018-01-23T22:17:09.505+0000","up_votes":4,"down_votes":1,"body":"Deine Situation lässt sich nur nicht wirklich auf ein Spiel mit Fremden anwenden. \n\nWenn deine Freunde dir sagen, man hast du gefailt. Findest du das vielleicht lustig. Andere vielleicht auch, wenn das ihre Freunde bei ihnen machen. Wenn man jetzt aber die Freunde durch Fremde ersetzt und auch noch die Nachrichten auf den Text reduziert, also Mimik, Stimmlage etc. wegfallen. Können die Leute das auf unterschiedlichste Weiße aufnehmen.\n\nWenn du dich nicht daran störst, wenn dir jemand \"haha\" schreibt, ist das ok. Das ist dein Ding. Aber das heißt nicht, dass alle das in Ordnung finden, wenn man das mit ihnen macht.","replies":[{"poster":"T Ocean","date":"2018-01-23T22:23:44.232+0000","up_votes":2,"down_votes":2,"body":"Also mit auslachen verstehe ich ein kleines 'haha nice one <3' aber kein 'Wow you suck'\nAlso vllt habe ich das falsch interpretiert aber als auslachen verstehe ich ein 'haha' und eine sarkastische bemerkung maximal :)\n\nUnd nur so zum Thema, hatte gerade ein flamendes Team und habe sie dazu gebracht sich z uverstehen und wir hatten sogar ein comeback :)\nAber wenn man 1v3 flash weil man einen kleinen 'Faker' Moment hat sollte man einfach zugeben 'Sry my bad that was stupid' so erspart man sich Flame und kann eventuell sogar gewinnen.\nHat jetzt nicht so viel damit zu tuen aber bin stolz drauf :'D","replies":[{"poster":"Sirrkas","date":"2018-01-23T22:28:39.910+0000","up_votes":2,"down_votes":1,"body":"Für mich ist auslachen eher \"haha, you suck so hard\". Schließlich bedeutet es eher verspotten oder sich über jemanden lustig machen. \n\nJa, etwas wie \"sry mb\" oder ähnliches, beugt oft etwas in der Art vor. Hatte auch ein richtig angenehmes Ranked, da hat der ADC das quasi gespammt. Alle 5 Minuten etwas wie \"not my day\" \"mb\" \"sry my fault\". War aber ohnehin kaum ausschlaggebend, habe ich eben die stompende Top- und Midlane unterstützt, da es dem ADC an Items fehlte.","replies":[]}]}]}]}]}]}]},{"poster":"7deadLeeSlnz","date":"2018-01-24T12:44:52.161+0000","up_votes":3,"down_votes":0,"body":"> hier musst du einfach davon ausgehen, dass ich mich ausgiebig selbst reflektiere\n\nWürdest du wirklich Selbstreflexion ausüben, würde dieser Thread nicht zu 75% aus blamen deiner Teammates bestehen.Daraus resultiert auch, dass man dir sagt, dass du allein dafür verantwortlich bist aufzusteigen.\nDeine nicht vorhandene Selbstreflexion sieht man auch daran, wie du nicht mal ansatzweise versuchst aus den Kommentaren etwas mitzunehmen. In gewisser Weise bist du etwas 'lernresistent' und wenn ich mir dazu alle anderen Kommentare durchlese, triffst das, was du über die Community sagst, am Meisten auf dich zu.","replies":[]},{"poster":"Angel Ayume","date":"2018-01-23T20:08:27.080+0000","up_votes":2,"down_votes":1,"body":"Ja natürlich hab ich deine Beispiele durchgelesen, sonst würde ich doch nicht drauf antworten.\nAber wieso sollten NUR die Bronzespieler in DEINEM Team diese Fehler machen?\nDiese Fehler machen auch die Gegner, sie fallen dir wohl nur nicht negativ auf, weil ihr ja dadurch Kills bekommt.\n\nAber was für Hilfe erwartest du denn? Das wir dir sagen, dass du recht hast? Das hast du nunmal nicht. Ja sicher hast du damit Recht, dass deine Mates dieses Fehler auch machen, aber eben nicht nur deine Mates sondern auch deine Gegner. \nUnd diese Fehler musst du eben entsprechend ausnutzen, du musst besser spielen als deine Gegner und musst die Fehler die deine Mates machen mit deinem besseren Spiel ausgleichen. Wie willst du sonst aufsteigen? \nDu bist nunmal die einzige änderbare Konstante. Deine Mates ändern sich nicht, du kannst das aber schon. Und wenn du dich nicht verbesserst sondern auf dem selben Skill-Stand bleibst wie am Anfang einer Season, dann wirst du letztendlich nicht aufsteigen. \nDeswegen sind einige Menschen - egal in welcher Elo sie auch sein mögen - harstuck. Wenn man hardstuck ist, dann verbessert sich nicht sondern hängt auf einem Spielniveau fest verbessert man sich, dann steigt man auch auf.","replies":[]}]},{"poster":"nox5555","date":"2018-01-29T21:34:39.225+0000","up_votes":2,"down_votes":0,"body":"Ja, deine Teammates sind richtig schlecht, deswegen sind sie ja auch b4/5.","replies":[]},{"poster":"T Ocean","date":"2018-01-23T19:22:41.918+0000","up_votes":1,"down_votes":7,"body":"Nein, 'Mein Team ist schlecht' ist keine Ausrede, zumindest ist es bei mir oft der fall das es leider der Wahrheit entspricht :'D\nGlaub mir es gibt Teams die nicht funktionieren und man verliert, passiert auch den besten...\nVor allem in Bronze bekommt man viele schlechte Teams, in Silver legt sich das alles meiner erfahrung nach ein bisschen.\nAber es gibt definitiv (vor allem in Bronze) schlechte Teams. Du musst einfach jedes Spiel carrien versuchen, den Teamwork wirst du dort bestimmt nicht so schnell finden geschweige denn Motivation :)","replies":[{"poster":"SSI CptHaunted","date":"2018-01-23T21:30:52.808+0000","up_votes":1,"down_votes":0,"body":"Teamwork in Bronze ist ein absolutes Fremdwort, außerhalb von Premades. Genau wie der Toplaner TP nur hat um schneller wieder auf der Lane zu sein, der Jungler nicht weiß wann er wo unterstützen muss oder wie er am Besten den gegnerischen Jungler lokalisiert, der ADC hat n beschissenes Positioning, Kommunikation ist so oder so grottig, Wards werden auch eher zufällig mal dort hingestellt wo sie grad gut aussehen usw. Leute die gefeedet sind überschätzen sich komplett und tun so als wären sie unbesiegbar, Nashor oder Elder werden nicht nach nem Teamfight gemacht sondern es wird einer mittendrin provoziert...die einzige Chance die man hat ist ehrlich genug zu sein sich seine Fehler einzugestehen und sich zu verbessern, denn nur dann ist man in der Lage das Spiel auch wirklich ins Ziel zu tragen.\n\nWer sich wundert, dass ich zu Mid und Sup nix gesagt habe...das spiel ich zu selten.","replies":[{"poster":"T Ocean","date":"2018-01-24T19:30:30.797+0000","up_votes":1,"down_votes":2,"body":"Nice wie viele Downvotes ich bekomme :'D\nJeder der Downvoted war bestimmt paar Jahre nicht in Bronze...","replies":[{"poster":"Angel Ayume","date":"2018-01-24T20:18:57.491+0000","up_votes":2,"down_votes":0,"body":"Liegt daran, dass du es so geschrieben hast, als wären nur die Teammates Schuld daran, wenn du verlierst. ^^ \nNatürlich sind deine Teammates schlecht, sie sind Bronze. Bronzespieler sind eben die schlechtesten Spieler in LoL. ABER wenn du selbst Bronze bist, dann gehörst du nunmal auch zu den schlechtesten Spielern. \n\nUnd ich war erst letzte Season in Bronze. ;) \nVon der MMR her sogar 2x.","replies":[{"poster":"T Ocean","date":"2018-01-25T08:08:38.178+0000","up_votes":1,"down_votes":0,"body":"Ich bin Aktuell in SIlver 3, weil du mich gerade als 'einer der schlechtesten' bezeichnest :'D","replies":[{"poster":"Angel Ayume","date":"2018-01-25T13:05:39.433+0000","up_votes":2,"down_votes":0,"body":"Ist ja egal welche Elo du bist. Wärst du Bronze würde es stimmen. \nAber zu sagen die Teammates sind zu schlecht um aus Bronze rauszukommen stimmt schlichtweg einfach nicht. Bist du ebenfalls ein Bronzespieler und gehörst au dahin bist du nunmal genauso schlecht. Und egal in welcher Elo man sitzt man muss besser sein als die Gegner um eine Liga höher zu steigen. Das gilt au für die Diaspieler. Sind sie nicht gut genug kommen sie nicht nach Master. ^^","replies":[]},{"poster":"Sirrkas","date":"2018-01-25T12:07:43.029+0000","up_votes":1,"down_votes":0,"body":"Mir wird angezeigt du bist gerade Silber 5.","replies":[{"poster":"T Ocean","date":"2018-01-25T13:50:50.374+0000","up_votes":1,"down_votes":0,"body":"Lose streak :) Leider bald wieder Bronze, war aber bei silver 3","replies":[]}]}]}]}]}]}]},{"poster":"Snowgen","date":"2018-01-24T11:04:20.288+0000","up_votes":1,"down_votes":0,"body":"Ich finde es herrlich , dass du im ersten Satz schreibst \" Das hier wird nicht der klassische Mates Flame Beitrag \", und danach nur noch deine Mates geflamed werden. Vorallem steht im TItel \" Meine Teammates sind schlecht - ist ne Ausrede \", die du dann selber verwendest. \n\n\nDu fragst nach Tricks und kniffen, wie man aus Bronze raus kommt? Ganz einfach - spiel besser und vorallem spiel um besser zu werden und um das Spiel zu lernen und nicht nur für den Climb. Ausserdem solltest mehr auf dich selbst achten, statt irgendwelche Romane über Bronze Fehler deiner Mates zu schreiben. Hättest du Potential nach oben, dann wären solche Games kein Problem für dich.","replies":[{"poster":"Sirrkas","date":"2018-01-24T12:57:34.921+0000","up_votes":2,"down_votes":0,"body":"Seit dem Thread ist er von Teleport Flash ADC auf Heal Flash ADC gewechselt.","replies":[]}]},{"poster":"Angel Ayume","date":"2018-01-23T17:31:26.275+0000","up_votes":2,"down_votes":0,"body":"Zu deinen Punkten trifft alles sehr wahrscheinlich dann ja auch auf deine Gegner zu. \nErgo seid ihr alle gleich gut oder gleich schlecht. \nUnd wenn ihr alle gleich gut oder gleich schlecht seid, dann entscheidet einer letztendlich wer das Game gewinnt, und genau dieser EINE bist DU. \nDU alleine bist die einzige Konstante die änderbar ist alle anderen Spieler ob Gegner oder Mitspieler kannst du nicht ändern. \n\nWillste aufsteigen, dann musst DU dafür was machen und nur du alleine.","replies":[]},{"poster":"CMan","date":"2018-01-23T17:29:56.043+0000","up_votes":2,"down_votes":0,"body":"Es reicht nicht, nur die ganzen blöden Fehler deiner Mates zu erkennen. Es ist zwar grundsätzlich richtig, dass du darauf achtest, den Mist nicht zu machen, aber:\n\nErstens machen die Gegner exakt die gleichen blöden Fehler. Denn offensichtlich kommen Gegner und Mitspieler aus dem selben Spielerpool.\nDa ist es dann dein Job, die Gegner für diese Fehler zu bestrafen. Das scheinst du nicht zu vermögen.\n\nZweitens scheinst du viel zu sehr auf die Verbündeten zu schauen und viel zu wenig auf dich selbst.\nFinde heraus, was deine Stärken sind und wie du mit diesen Vorteile generierst.\n\nUnd nein, es ist keine Lösung, irgendwelchen Mist zu machen wie TP Splitpush ADC. Wenn du selber doch weißt, dass es Mist ist, dann mach es nicht.\n\nSpiele um deine Stärken rum. Das ist das wichtigste. Denk in Ruhe darüber nach, wo die liegen.","replies":[]},{"poster":"Allerbester Biss","date":"2018-01-23T17:33:25.492+0000","up_votes":2,"down_votes":1,"body":"Du bist halt Bronze!\nLeb damit. Es gibt keinen Trick den alle außer Bronze Spieler kennen.\nDer Unterschied jedoch ist, dass Bronze spieler das Spiel entweder nicht kennen weil sie neu sind oder sie einfach nicht besser werden können/wollen.\nEs gibt halt manche denen strategisches Denken/ voraussehendes Denken nicht möglich ist.\nUnd genau da bist du drinnen.\n\nSo und jetzt musst du dich entscheiden wer von diesen Mensch du bist.","replies":[]},{"poster":"Sirrkas","date":"2018-01-23T17:31:21.166+0000","up_votes":2,"down_votes":1,"body":"Spiele die man nicht gewinnen kann, hat jeder mal. Auch Teammates, die gerne einen schlechten Engage starten und dann anderen die Schuld geben (hatte ich heute erst). \n\nDer Trick ist, die schlechten Spieler, sind in beiden Teams. Wenn dein Team immer dem Gegner nachläuft um den Kill noch zu machen, wird das auch so oft bei den Gegnern vorkommen. Nicht unbedingt in dem einzelnen Spiel, aber über eine Vielzahl der Spiele hinweg schon. \n\nWenn man jetzt besser als die aktuelle Division ist, schafft man es, mehr Spiele zu gewinnen als zu verlieren. Da das eigene Team immer jemanden hat, der etwas besser als die anderen ist. Das kann man aber nicht daran fest machen, ob man sich selbst für Gold oder Platin hält. Menschen sehen sich gerne selbst als besser an, als sie es eigentlich sind, vor allem, wenn sie nicht all zu viel Ahnung von etwas haben. \n\nIn der Richtung gibt es den Dunning Krüger Effekt:\n\nhttps://www.youtube.com/watch?v=pOLmD_WVY-E\n\n\n\nZu der Blacklist. So etwas ist meist eine schlechte Idee. Das Matchmaking soll fair sein und nicht danach arbeiten, wen man selber mag und wen nicht. Das erhöht nur für alle die Wartezeiten. In den Grenzbereichen der Elo, kann das sogar genutzt werden, um die besseren Spieler auszusortieren. Wie soll der beste Spieler EUW jemals seinen Platz verlieren, wenn er kaum verliert, da die anderen Challenger alle auf seiner Blocklist sind? Und ja, ich habe gelesen, dass du das erst möglich machen willst, wenn da 5 Reports in einem Spiel zustande kommen. Aber das lässt sich da ganz einfach arrangieren, die kennen sich alle da oben.","replies":[]},{"poster":"Meisterball","date":"2018-01-23T17:18:25.741+0000","up_votes":1,"down_votes":0,"body":"TL:DR","replies":[{"poster":"Sirrkas","date":"2018-01-23T17:22:36.615+0000","up_votes":2,"down_votes":1,"body":"Siehe die Überschrift, aber ohne den Zusatz nach den Anführungszeichen. Zumindest scheint es darauf hinauszulaufen.","replies":[]}]},{"poster":"and i carry","date":"2018-01-24T03:41:53.628+0000","up_votes":1,"down_votes":0,"body":"Interessa t das ich b3 diese Season gestartet habe und jetzt s2 bin, obwohl ich die gleichen Mates wie du bekomme. Wenn man verliert liegt es nicht am Team sondern daran, dass man selbst nicht gut genug war für ein 1vs9. Du solltest vermutlich dich mal darauf fokusieren besser zu werden und nicht nur zu spielen dann kannst auch du elo gainen. Ich meine du spielst Comet auf Vayne,Cait ?XDDD und hast miserable Cs Werte.","replies":[{"poster":"Sirrkas","date":"2018-01-24T13:02:57.642+0000","up_votes":1,"down_votes":0,"body":"Wo kommt eigentlich dieses 1vs9 her? Das kann man bestenfalls noch gegen Bots schaffen.","replies":[{"poster":"Nordwolf87","date":"2018-01-24T14:15:00.480+0000","up_votes":1,"down_votes":0,"body":"Naja du alleine gegen 5 gegner und 4 mates die dir dein game versauen = 1vs9 xD","replies":[{"poster":"Sirrkas","date":"2018-01-24T14:29:52.990+0000","up_votes":1,"down_votes":0,"body":"Ja, das ist aber dann auch wirklich unmöglich und doch etwas arg übertrieben, so etwas gewinnen zu sollen. Außer vielleicht gegen Bots mit 4 Levelbots im eigenen Team.","replies":[]}]}]}]},{"poster":"Pure Cynicism","date":"2018-01-23T18:09:10.910+0000","up_votes":1,"down_votes":0,"body":"Der geheime Trick besteht darin, deine Lane zu stompen. Als Toplaner zB 3-0 von der Lane gehen, mit 50 CS Vorsprung. Und dann den Turm holen und weiterpushen. Wenn die Gegner zu 2. kommen, beide töten und den nächsten Turm holen. Wenn die Gegner dann zu 3. kommen, Botlane gehen und dort die Türme holen usw. Wenn du das jedes Spiel genau so machst, kommst du locker auf 90% Winrate. Denn genau das ist der Weg, den High Elo Spieler gehen, wenn sie in Bronze oder Silber smurfen.","replies":[{"poster":"SSI CptHaunted","date":"2018-01-23T21:36:09.558+0000","up_votes":1,"down_votes":0,"body":"Dazu musst du in der Lage sein jede Lane zu stompen. Das würde bedeuten, dass du locker 3-5 Divisionen zu tief bist, wenn nicht sogar noch mehr und der direkte Lanegegner immer schlechter. Nen Smurf und n normaler Spieler, der sich langsam aber sicher hochspielen will ist kein wirklich angebrachter Vergleich. Abgesehen davon kann es dir durchaus passieren, dass während du deine Toplane stompst auf der Mid oder Botlane genau das Gleiche passiert.","replies":[{"poster":"Pure Cynicism","date":"2018-01-23T21:44:50.310+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=HauniHaunted,realm=EUW,application-id=KYnfKGf0,discussion-id=znhTiyqh,comment-id=00080000,timestamp=2018-01-23T21:36:09.558+0000)\n>\n> Dazu musst du in der Lage sein jede Lane zu stompen. Das würde bedeuten, dass du locker 3-5 Divisionen zu tief bist, wenn nicht sogar noch mehr und der direkte Lanegegner immer schlechter. Nen Smurf und n normaler Spieler, der sich langsam aber sicher hochspielen will ist kein wirklich angebrachter Vergleich. Abgesehen davon kann es dir durchaus passieren, dass während du deine Toplane stompst auf der Mid oder Botlane genau das Gleiche passiert.\n\nJedenfalls hat das bei mir funktioniert, als ich Bronze war und besser werden wollte. Champ aussuchen, Guides lesen, Champ spammen, Profit. Macht aber irgendwie in Bronze keiner.","replies":[]}]}]},{"poster":"Sirrkas","date":"2018-01-23T17:47:54.926+0000","up_votes":1,"down_votes":0,"body":"Ich hab dir eben ein wenig zugesehen, willst du einen Kommentar darüber?","replies":[]},{"poster":"need elo police","date":"2018-01-23T20:27:05.576+0000","up_votes":2,"down_votes":5,"body":"es geht für mich nicht unbedingt um die Teammates. Wenn man zu jemanden sagt \"das und das hast du falsch gemacht\" oder \"du bist schlecht\" oder irgendetwas negatives sagt spielen 90% der Spieler die sich angegriffen fühlen schlechter, ob absichtlich oder nicht. Ich glaube viele wissen nicht dass das Schreiben im Chat großen Anteil daran hat ob jemand gut oder schlecht spielt. Wenn man öfters bei guten Aktionen good job oder well played schreibt kann das nur positives bringen.\n\nUnd die Platin oder höher Spieler sollten einfach ihre Klappe halten von wegen \"du musst halt besser spielen und die Fehler anderer ausmerzen\". Viele wurden sowieso geboosted ... außerdem kannst du nicht Spiele alleine gewinnen, das ist fakt. Wenn du 20 Kills mit Yasuo hast oder einfach deine Lane gewinnst heißt es nicht unbedingt dass du gut gespielt hast ... wenn du die Hilfe vom Jungler bekommst ist das ein großer Vorteil. Oder als ADC die ganzen Kills abstaubst und am Ende alles wegrotzt ... ist ja auch schwer die ganze Zeit aa zu machen und am Ende ist der Gegner tot, das hat ja so viel mit besser spielen zu tun.\n\nEs ist und bleibt ein Teamgame, und das ist was Spiele gewinnt. Kein einzelner guter Spieler der so viel besser ist als die anderen.","replies":[]},{"poster":"Meisterball","date":"2018-01-23T17:20:18.787+0000","up_votes":1,"down_votes":5,"body":"Wenn du stuck bist bist du scheiße mehr gibt es nicht","replies":[]}]}