{"poster":"Client May Crash","date":"2014-02-25T03:22:03.927+0000","title":"@Riot, A Moment for a Student?","subforum":"[ARCHIVED] Miscellaneous","up_votes":9,"down_votes":0,"body":"Hey everyone, I'm a freshman in college looking to get into game design, specifically if possible someday Character Rigging. I've seen people do it and I've done it some on my own and it's loads of fun! I finally feel like I have a tangible goal in life!\r\n\r\nThat being said, I've been tasked in my History of Games and Animation class with interviewing a professional in the industry and who better than to talk to a rigger from my favorite games company ever? If there are any rioters that could possibly get me in touch with one of the your rigging fellas (and/or lady fellas), I'd love to get a chance to talk to them and delve into their journey to Riot and assorted other things! Much appreciated!","replies":[{"poster":"JesterCapp","date":"2014-02-25T19:58:48.359+0000","up_votes":6,"down_votes":0,"body":"Hello! I am a rigging fella. :) Bob LLama had a good idea. Post a discussion on the \"Inside Riot Games\" LinkedIn group, something like \"Looking for Riot Rigging Artist.\" I will look for that discussion and message you personally on there. :) Or if you're resourceful and manage to find my contact info, feel free to also email me directly. :P Cheers!","replies":[{"poster":"Client May Crash","date":"2014-02-26T01:30:59.750+0000","up_votes":2,"down_votes":0,"body":"Thanks a ton JC! (Can I call you JC? lol) I look forward to getting to talk to you personally and thank you for giving me the opportunity! You'll be hearing from me soon!","replies":[]}]},{"poster":"Bob LLama","date":"2014-02-25T18:47:42.140+0000","up_votes":5,"down_votes":0,"body":"Howdy good sir.\n\nI poked around to see what I could find, and it was mentioned to me that you should start first by checking the LinkedIn group.\n\nCheers,\nLouis","replies":[{"poster":"Client May Crash","date":"2014-02-26T01:29:04.218+0000","up_votes":2,"down_votes":0,"body":"Thank you so much! I most definitely will! I appreciate the help :)","replies":[]}]},{"poster":"MXXIV","date":"2014-02-25T23:48:02.115+0000","up_votes":2,"down_votes":0,"body":"Don't forget to post the interview here too. We're curious!","replies":[]},{"poster":"2k Chat Ban","date":"2014-02-25T07:42:43.529+0000","up_votes":3,"down_votes":1,"body":"Help 'em out riot! Give 'em a skin too.","replies":[]},{"poster":"Client May Crash","date":"2014-02-25T18:07:06.674+0000","up_votes":2,"down_votes":1,"body":"Thanks for the support guys! Much appreciated :)","replies":[]},{"poster":"Tomahawks I 23","date":"2014-02-25T09:56:03.403+0000","up_votes":2,"down_votes":1,"body":"Someone give this man a cookie!!!!!!!!","replies":[{"poster":"Rhyto","date":"2014-02-26T14:36:11.590+0000","up_votes":1,"down_votes":0,"body":"{{item:2052}} It has been done. {{champion:56}}","replies":[]}]}]}