{"poster":"GetRIGHTKLICKED","date":"2018-09-08T17:43:11.794+0000","title":"-15 für leaver","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":7,"body":"schon geil wenn man wegen lag -15 bekommt obwohl man versucht zu reconnecten und so gut es geht zum sieg beizutragen. und dann wundert man sich warum fortnite besser l&auml;uft als league haha.","replies":[{"poster":"Shuowian","date":"2018-09-08T18:06:15.206+0000","up_votes":7,"down_votes":0,"body":"Dumm nur, das Fortnite voll der Mist ist.","replies":[{"poster":"Alpacana","date":"2018-09-08T18:10:19.743+0000","up_votes":2,"down_votes":0,"body":"Das sieht jeder anders denke ich^^\n\nFortnite hat momentan einen Hype, also mögen es wohl relativ viele Menschen, das kann man nicht abstreiten.\nGenau so einen Hype hatte LoL allerdings auch in Season 4~ und mittlerweile geht der Fortnite-Hype auch schon wieder zurück (heute war LoL von den Viewerzahlen auf Twitch sogar über Fortnite).\nJedes (erfolgreiche) Spiel hat früher oder später einen Hype und jedes (erfolgreiche) Spiel wird irgendwann auch aussterben.\nOb League momentan ausstirbt? Naja, sieht nicht so aus als ob League in nächster Zeit nochmal einen Hype erfährt, aber von Aussterben ist es meiner Meinung nach noch sehr weit entfernt.\n\n\nAllerdings ist das ja auch gar nicht Thema des Threads. Um darauf zurückzukommen:\nSorg dafür, dass dein Internet stabil läuft und du wirst solche Probleme auch nicht bekommen @TE","replies":[]}]},{"poster":"Shooter90","date":"2018-09-08T17:45:43.564+0000","up_votes":4,"down_votes":0,"body":"Tja wie wäre es dann mal sich um eine anständige Leitung zu bemühen? Wenn du Disconnects (regelmäßig ) hast sind Multiplayer Games leider das falsche Hobby.","replies":[]},{"poster":"zoroyashie","date":"2018-09-19T08:16:05.340+0000","up_votes":1,"down_votes":0,"body":"Du erschwerst das Spiel nur für dein ganzes Team, alle haben 15lp verloren wegen dir. Ich empfehle dir bei Fortnite zu bleiben, anstatt jedem das Spiel zu versauen.","replies":[]},{"poster":"Qbert","date":"2018-09-13T07:25:49.015+0000","up_votes":1,"down_votes":0,"body":"Du musst ja wenigstens 5min aus dem Spiel gewesen sein ... das wird dann schon eher an dir als an Lol gelegen haben.\n\nUnd niemand wundert sich, dass Fortnite besser läuft als Lol, wieso auch, ist ein komplett anderes Genre...","replies":[{"poster":"CrunchCake97","date":"2018-09-13T07:52:45.583+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Qbert,realm=EUW,application-id=ip27PlEH,discussion-id=RvThOuKk,comment-id=0004,timestamp=2018-09-13T07:25:49.015+0000)\n> Und niemand wundert sich, dass Fortnite besser läuft als Lol, wieso auch, ist ein komplett anderes Genre...\n\nGenau und LoL hat auch nur so schlechte Karten in der Gewinnung von neuen Spielern weil die Community von LoL einfach so Toxic ist. Ausserdem ist das Spiel alles andere als einsteigerfreundlich...","replies":[{"poster":"Qbert","date":"2018-09-13T07:56:27.540+0000","up_votes":1,"down_votes":0,"body":"Da muss ich dir recht geben... aber ich persönlich kenne kein MOBA was wirklich einsteigerfreundlich ist ... sie sind einfach alle sehr komplex ... gerade wenn du so viele Helden zur Verfügung stellst ... dann noch die Gegenstände, schwierig rein zu kommen.\n\nDass die Community Toxic ist, ist wirklich sehr schade, aber das findet man an sehr vielen Spielen - leider.","replies":[{"poster":"CrunchCake97","date":"2018-09-13T07:58:31.621+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Qbert,realm=EUW,application-id=ip27PlEH,discussion-id=RvThOuKk,comment-id=000400000000,timestamp=2018-09-13T07:56:27.540+0000)\n>\n> Da muss ich dir recht geben... aber ich persönlich kenne kein MOBA was wirklich einsteigerfreundlich ist ... sie sind einfach alle sehr komplex ... gerade wenn du so viele Helden zur Verfügung stellst ... dann noch die Gegenstände, schwierig rein zu kommen.\n> \n> Dass die Community Toxic ist, ist wirklich sehr schade, aber das findet man an sehr vielen Spielen - leider.\n\nJa stimmt aber weißt du was ich gut fände, wenn es direkt fürs Team ersichtlich wäre \"Hey der ist Level 8 und kompletter Anfänger\" - wer weiß vielleicht würde der eine oder andere etwas Rücksicht nehmen und nicht gleich beim ersten Fehler im All Chat anfangen zu flamen.","replies":[{"poster":"Qbert","date":"2018-09-13T08:02:30.985+0000","up_votes":1,"down_votes":0,"body":"Oh das sehe ich kritisch ... auf der einen Seite hätte das durchaus Vorteile, jemanden in irgendeiner Form zu markieren ... bspw. eben das Level anzeigen ... auf der anderen Seite \"prangerst\" du den Spieler damit auch ein wenig an ... alles joint die Lobby und das erste was kommt \"oh man, wieder ein Noob\" oder so etwas ...\n\nIch spiele derzeit wieder mehr WoW, auch wenn ich dafür kaum Zeit habe ... die Instanzen und die Bosse kenne ich noch nicht so gut, was mache ich also? Ich sage meiner Gruppe Bescheid, weil man in WoW auch nicht als Neuling gekennzeichnet ist ... so wissen alle Bescheid \"ok, der weiß noch nicht so richtig was er tut\" und ich warne die Leute gleich vor ^^ \n\nDa muss man mMn schon selber aktiv werden ... denn ich behaupte mal ganz kühn, dass dir dann in 90% der Spiele auch geholfen wird bzw. du nicht geflamet wirst, wenn du von Anfang an sagst \"Leute, ich bin neu ... bitte habt Verständnis, Tipps sind willkommen\" ... nur diese Eigeninitiative haben die Leute heutzutage nicht mehr\n\nZum Abschluss lass mich schwadronieren:\n\n>Jeder ist selbst seines Glückes Schmied","replies":[{"poster":"Angel Ayume","date":"2018-09-13T16:29:55.702+0000","up_votes":1,"down_votes":0,"body":"Das du vor Flame sicher bist, nur weil du sagst, dass du ein Neuling bist, ist leider, leider nicht richtig. \n\nAls ich damals angefangen habe zu spielen, habe ich oft gesagt, dass ich Anfänger bin und keine Ahnung von dem Spiel habe. Trotzdem wurde ich immer wieder geflamed, es hat die Leute nicht interessiert, dass ich Anfänger bin oder nicht. \n\nUnd auch andere Anfänger mit denen ich gespielt habe, waren nach ihrer Aussage leider nicht sicher. Die Spieler die flamen ist es schlichtweg egal, ob es sich um einen Anfänger handelt oder nicht, Hauptsache sie können ihrer Frust, dass jemand feedet an  denjenige auslassen.","replies":[{"poster":"Qbert","date":"2018-09-14T05:57:29.616+0000","up_votes":1,"down_votes":0,"body":"Das habe ich doch auch nicht behauptet :) \nAber ich habe positive Erfahrungen gemacht, ausgeschlossen habe ich Flame nicht ... war auch gar nicht so impliziert","replies":[]}]},{"poster":"CrunchCake97","date":"2018-09-13T08:05:26.472+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Qbert,realm=EUW,application-id=ip27PlEH,discussion-id=RvThOuKk,comment-id=00040000000000000000,timestamp=2018-09-13T08:02:30.985+0000)\n>\n> Oh das sehe ich kritisch ... auf der einen Seite hätte das durchaus Vorteile, jemanden in irgendeiner Form zu markieren ... bspw. eben das Level anzeigen ... auf der anderen Seite &quot;prangerst&quot; du den Spieler damit auch ein wenig an ... alles joint die Lobby und das erste was kommt &quot;oh man, wieder ein Noob&quot; oder so etwas ...\n> \n\nJa das stimmt schon aber irgendwie muss man das mal angehen, leider weiß ich nicht so richtig wie :c","replies":[]}]}]}]}]}]},{"poster":"XenesisCH","date":"2018-09-13T07:23:35.056+0000","up_votes":1,"down_votes":0,"body":"Birnen sind keine Äpfel!","replies":[]},{"poster":"Cenâreth","date":"2018-09-11T11:32:46.691+0000","up_votes":1,"down_votes":0,"body":"Also ich hatte bis jetzt keine Laggs, vielleicht läuft ja mein Toaster besser als deiner. ;)","replies":[]}]}