{"poster":"Photos of Ghosts","date":"2015-11-04T11:59:39.692+0000","title":"[NEW CHAMPION SELECT] Petition to add more selectable roles","subforum":"Gameplay","up_votes":9,"down_votes":6,"body":"This new champ select basically deletes the possibilities to double jungle, duo jungle, full roam, river, duo top, duo mid, solo bot and 5-men push.","replies":[{"poster":"Photos of Ghosts","date":"2015-11-04T12:10:12.392+0000","up_votes":5,"down_votes":0,"body":"Ok, so apparently RIot has the intention to add this to BLIND PICK too. What the actual fuck. What the actual living fuck.","replies":[{"poster":"Cowgirl Ed","date":"2015-11-04T12:12:40.742+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Photos of Ghosts,realm=EUW,application-id=3ErqAdtq,discussion-id=VrRTkIXQ,comment-id=0000,timestamp=2015-11-04T12:10:12.392+0000)\n>\n> Ok, so apparently RIot has the intention to add this to BLIND PICK too. What the actual fuck. What the actual living fuck.\n\nThe thing is they said in their page \"double jungle 2016!\" so they're either handicapped or they messed up something","replies":[{"poster":"Photos of Ghosts","date":"2015-11-04T12:18:13.346+0000","up_votes":2,"down_votes":1,"body":"Erm\n\n> handicapped\n\nr00d","replies":[{"poster":"Cowgirl Ed","date":"2015-11-04T12:27:50.302+0000","up_votes":2,"down_votes":3,"body":"Btw check this:\nhttp://na.leagueoflegends.com/en/site/2016-season-update/new-champ-select.html\ngo to Position Assignment in Play to your Strengths and read the last line","replies":[{"poster":"Photos of Ghosts","date":"2015-11-04T13:29:00.988+0000","up_votes":1,"down_votes":0,"body":"I know, where do you think I got this post from.","replies":[]}]}]}]}]},{"poster":"Mr Malrin","date":"2015-11-04T12:33:39.232+0000","up_votes":3,"down_votes":1,"body":"the champ select doesn't delete the possibility of this at all. you are just assigning yourself a meta lane/role if you want to do other than that nothing is preventing you from doing so. you can still do 5 man smite double top etc etc. this new way of champ select is designed for a cleaner meta based way of getting things in order, you still have the option of trolling your team by going double jungle regardless.","replies":[{"poster":"Photos of Ghosts","date":"2015-11-04T13:28:43.145+0000","up_votes":4,"down_votes":0,"body":"Difference is that you now engage to play what you picked. Lyte stated that not respecting the picked role is a bannable offense. And double jungle isn't and wasn't trolling; but it will be now punished as such.","replies":[{"poster":"Wheatloaf","date":"2015-11-04T13:40:51.617+0000","up_votes":2,"down_votes":1,"body":"If you queue up with the full 5 people, you can double jungle or whatever floats your boat. If you can get your team to agree to let you, you can do w/e the fuck you want. It may not be explicitly stated in the system, but there are still ways.","replies":[{"poster":"Photos of Ghosts","date":"2015-11-04T13:51:06.546+0000","up_votes":3,"down_votes":0,"body":"Fact is - you can currently pick your own strategy, since it's your call and if it doesn't work it will affect others only during one game while it will affect you as long as you apply it. Now, if your team disagrees - or starts feeding on purpose because they disagree - you're reportable.","replies":[{"poster":"qetzel","date":"2015-11-04T14:47:38.042+0000","up_votes":1,"down_votes":0,"body":"Communication has always been important in this game. If you wanted to double jungle when the rest of your team didn't (for whatever reason) it isn't exactly fair to them.\nI am almost 100% certain the current analogue is considered a reportable offence.","replies":[{"poster":"Photos of Ghosts","date":"2015-11-04T15:08:07.910+0000","up_votes":2,"down_votes":1,"body":"There's currently a legitimate strat called \"River Shen\" consisting of locking in Shen with ignite and exhaust, saying RiverShen in chat, not saying anything else all game long and disregarding the team's comp. It works, it's borderline freelo and Riot purposely made a reference  to it by adding Scuttlecrab with Shen's dash and plate, which allows RiverShen to heal up while roaming.\nBy s6 standards, it's now bannable.","replies":[]}]}]}]}]}]},{"poster":"The Sword Saint","date":"2015-11-04T15:07:11.688+0000","up_votes":2,"down_votes":2,"body":"It's the same as before - if you can convince your team to let you do your weird shit, it's all good. However the power and convenience that is NOW being ADDED is specifically targeted at the standard lane setup. You can't gain that power and convenience if you try and go against the standard lanes in super weird way, you have to negotiate with your team _like you'd have to do already anyway_.","replies":[{"poster":"Photos of Ghosts","date":"2015-11-04T15:18:06.971+0000","up_votes":4,"down_votes":1,"body":"Riot always stated that you could pick whatever you wanted and no strategy could be imposed to you even by the majority. Now instead you can be banned for going ADC and support jungle.","replies":[{"poster":"xFrostKnightx","date":"2015-11-04T17:00:13.132+0000","up_votes":3,"down_votes":0,"body":"\"You can play any champion in any role and position you like...\nAs long as it's Tank top, Burst mid, CC/Assassin jg and  Ranged AD/Support bot.\"  - Riot\n\n2 mid 1 bot Meta will happen Season 6! Force the change! \nEverything should be viable, any positioning should be viable, changing champions (aka Mordekaiser/eve/zac) to force them into \"traditional\" lanes and changing them to fit, champions that want to lane and Riot nerfs their laning so they stay a \"jungle\" champion. \nThis isn't diversity, this is telling us it HAS to be the way it is currently and change is not possible because riot is not willing to let things change.\n\nIf 2 mid, 1 bot becomes a thing to control both buffs and have x2 map pressure while also having better map vision. Riot will find a way to nerf it so we go back to  adc/sup bot.","replies":[]}]}]},{"poster":"fwL7umeoQe","date":"2015-11-04T19:26:08.880+0000","up_votes":2,"down_votes":1,"body":"Thank god you're in EU so I don't have to deal with troll's like you in ranked trying to double jungle lmao.","replies":[{"poster":"Photos of Ghosts","date":"2015-11-04T22:45:48.311+0000","up_votes":1,"down_votes":0,"body":"I don't. I'm just saying that meta could evolve before this and now it'll be stuck by definition.\nAlso I was the ADC in a double jungle team. I managed to 1v2 their ADC and decently fed jungle Twitch.","replies":[]}]},{"poster":"ArbiterOfTruth","date":"2015-11-04T15:49:19.593+0000","up_votes":2,"down_votes":1,"body":"The new champ select does not remove strategies like the ones you listed. It looks a lot like teambuilder if anything it should be less restrictive. When teambuilder came out people were spouting off things like riot is enforcing a meta and things like that an now we have people doing the same thing all over again. If you want double jungle how about you communicate with your team before the match starts the same goes for all the other things you listed. Those are strageies what the new champ select is assigning is where you want to be at the start of the game aka position.","replies":[{"poster":"xFrostKnightx","date":"2015-11-04T17:11:00.320+0000","up_votes":1,"down_votes":0,"body":"It's too bad that unless someone want's to dodge or you want to be reported the second you say your idea, it's not possible. \nThere's no option to say \"I want 2 mid/ I want 3 top\"  instead you have to pick other lanes, then when you get matched up people will complain that \"gg solo bot\"/\"gg double jungle\"/\"gg 2 top and 2 bot my team is troll\".\n\nOne laner disagrees and refuses to comply because \"It's 2 bot buddy, I picked mid/top not bot\" or \"You are locked in as ADC bot with your duo. So you stay bot\".\n\nThey then have the right to report you and you will be banned.  ","replies":[{"poster":"ArbiterOfTruth","date":"2015-11-04T17:23:59.722+0000","up_votes":1,"down_votes":0,"body":"You can still get a team of five and do crazy stuff like that.\n\nAside from that what's with the downvotes?","replies":[]}]}]},{"poster":"EmittingXs","date":"2015-11-04T19:29:47.917+0000","up_votes":1,"down_votes":0,"body":"Please add to the list \"Asexual Jungler,\" \"Demi-Top,\" and \"Confused Pan Support\" because I feel like you're specifically excluding me from the game at this point. / end sarcasm\n\nYour made up roles are quite silly though.","replies":[]},{"poster":"Gnart Even Close","date":"2015-11-04T13:18:16.430+0000","up_votes":1,"down_votes":0,"body":"you can join queues with the new clubs and stuff like that, so there will always be people to play with.","replies":[]},{"poster":"Photos of Ghosts","date":"2015-11-04T12:19:11.086+0000","up_votes":1,"down_votes":0,"body":"And also the discrimination towards loner players increases everyday. What if what you're looking for is making the \"Playing with strangers\" experience better and leave your teammates as improved people.","replies":[]}]}