{"poster":"Race the Jayce","date":"2016-08-05T03:22:07.737+0000","title":"When you try to play a bot match and end up with 9 bots instead of 5.","subforum":"Gameplay & Strategy","embed":{"description":"Every game is a story; visit the new League of Legends match history to check out how this one ends and share your own!","url":"http://matchhistory.oce.leagueoflegends.com/en/#match-details/OC1/142330090/202086706?tab=overview","image":"https://cdn.leagueoflegends.com/match-history/opengraph_icon.jpg"},"up_votes":5,"down_votes":0,"body":"I&#039;m absolutely certain I just played a bot match with 4 bots on my team. It was horrifying.","replies":[{"poster":"Project Xayah","date":"2016-08-05T08:42:41.186+0000","up_votes":1,"down_votes":0,"body":"Smegging hell, this sh!t again? Glad I'm putting my effort into Paragon rather than LoL now...","replies":[{"poster":"JasonWazza","date":"2016-08-05T11:02:56.892+0000","up_votes":1,"down_votes":0,"body":"I mean this never stops because Riot don't give enough of a shit to stop it.","replies":[{"poster":"Project Xayah","date":"2016-08-05T23:01:34.460+0000","up_votes":1,"down_votes":0,"body":"It's more of a \"comes and goes\" kind of thing. There are times when it's really bad and there are times when it's really good.","replies":[{"poster":"JasonWazza","date":"2016-08-06T02:39:20.673+0000","up_votes":1,"down_votes":0,"body":"No it really isn't a comes and goes kinda thing.\n\nAt best sometimes it isn't 4 every game and is 2 every game, but it never goes to much more of an extent then that.","replies":[{"poster":"Project Xayah","date":"2016-08-07T05:55:36.532+0000","up_votes":1,"down_votes":1,"body":"Before I stopped playing LoL, I was mostly into ARAM/Bots. I can most certainly assure you that it is more of a \"comes and goes\" kind of thing, ranging anywhere from 1 every 10 or so games (which, let's face it, is pretty much expected, things like this will never be 100% eliminated) to 3-4 every game, with the latter being a bit more uncommon.","replies":[{"poster":"JasonWazza","date":"2016-08-07T06:41:33.158+0000","up_votes":1,"down_votes":1,"body":"Just so we are clear, Level 30 games of ARAM/Bots do not count.\n\nFact is at that point, an account is already right to be sold and is no longer being played by a bot.","replies":[{"poster":"Project Xayah","date":"2016-08-07T23:58:27.220+0000","up_votes":1,"down_votes":1,"body":"The assumption being I only played on level 30 accounts...","replies":[]}]}]}]}]}]}]},{"poster":"Ascalon127","date":"2016-08-05T08:54:11.059+0000","up_votes":1,"down_votes":0,"body":"I know right? This always happens to me. Especially in intermediate bots. They will always feed. I lost to bots onc because of this very reason","replies":[]}]}