{"poster":"Phi Gamma Delta","date":"2016-05-24T01:51:42.548+0000","title":"Tibbers huge butt will not stun [GAMEPLAY]","subforum":"Report a Bug","up_votes":28,"down_votes":2,"body":"Hello Riot Staff,\r\n\r\nWhen Annie has four stacks indicating stun is ready to go.  She goes in slyly or flashly into the enemy&#039;s comfort zone and summons the almighty Tibbers.  Tibbers, invading the enemy&#039;s personal space, somehow does not stun the enemy.  The enemy laughingly strolls away escaping the mighty wrath of Annie and Tibbers.  However, the next time Annie met the enemy, she gives it another try.  Lo and behold, the enemy is stunned and rekked within seconds of Tibbers appearances.  \r\n\r\nThat is the scenario that many players playing as Annie are facing.  Stun is not stunning when using Tibbers.  I do not know how to reproduce the stun as it seems very random.  Thanks for looking into this and helping making the game a better experience to all players! ^.^\r\n\r\nHave a wonderful day,\r\n\r\nConcerned Annie Player{{champion:1}}","replies":[{"poster":"Perforated","date":"2016-05-24T01:55:41.588+0000","up_votes":11,"down_votes":0,"body":"It also happened to me a couple of times, and seemed to occur erratically. Stunning using Q or W works fine, but tibber stun sometimes does not stun at all.","replies":[]},{"poster":"Rosotee","date":"2016-05-24T01:56:37.216+0000","up_votes":6,"down_votes":0,"body":"As an Annie main this needs to be fixed. It's making me lose out on many 4-5 man Tibber stuns and it's screwing over the tide of the fight. FeelsBadMan #FixTibberStun","replies":[]},{"poster":"Xeruon","date":"2016-05-24T08:08:47.384+0000","up_votes":5,"down_votes":0,"body":"Incoming \"muh muh cancer champs dont need bugfixes\"","replies":[]},{"poster":"Morribyte","date":"2016-05-24T03:13:04.668+0000","up_votes":5,"down_votes":0,"body":"Thanks for this. I've had this issue and I just kept thinking that I must've missed.  It probably has to do with how they changed W to \"not cheat\".","replies":[]},{"poster":"Jumpfox103","date":"2016-05-24T03:23:03.524+0000","up_votes":3,"down_votes":0,"body":"Come on Riot..... Annie opponents can't #feeltheburn and it's killing her,  sometimes literally!","replies":[]},{"poster":"Zeal Seeker","date":"2016-05-24T18:27:44.111+0000","up_votes":2,"down_votes":0,"body":"As an annie main, I can confirm that the ult stun is acting strange, sometimes stunning one person but not the other. I havent been playing much lately but noticed that it started occuring after the mage update.","replies":[]},{"poster":"The Deckowner","date":"2016-05-24T18:03:51.133+0000","up_votes":2,"down_votes":0,"body":"http://leaguecraft.com/meme/asset/meme_760px_10083.jpg","replies":[]},{"poster":"NeonPanda","date":"2016-05-24T04:16:56.675+0000","up_votes":2,"down_votes":0,"body":"This has happened to me as well.","replies":[]},{"poster":"GOL Undecayed","date":"2016-05-24T11:40:32.089+0000","up_votes":1,"down_votes":12,"body":"Yh no thanks, you probably missed cuz Annie is a piss easy champ to play with high reward for low skill apart from in higher Elos where positioning becaomes important, regardless she's still broken... Stop playing Annie.\n___________________________________________________________________________________________________________________\nI swear {{champion:86}} {{champion:1}} should just be locked champions as soon as you hit 30","replies":[{"poster":"BetaDude40","date":"2016-05-24T12:18:20.432+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=GOL Undecayed,realm=EUW,application-id=LqLKtMpN,discussion-id=zEEFR80r,comment-id=0007,timestamp=2016-05-24T11:40:32.089+0000)\n>\n> Yh no thanks, you probably missed cuz Annie is a piss easy champ to play with high reward for low skill apart from in higher Elos where positioning becaomes important, regardless she&#x27;s still broken... Stop playing Annie.\n> ___________________________________________________________________________________________________________________\n> I swear {{champion:86}} {{champion:1}} should just be locked champions as soon as you hit 30\n\nOnce again, people misinterpret a bugfix as adding power to a champion's kit. How unsurprised I am.\n\nIf they are supposedly only played by low-skill people, though, then why do you keep losing to them? :)","replies":[{"poster":"GOL Undecayed","date":"2016-05-24T15:46:43.804+0000","up_votes":1,"down_votes":4,"body":"Because as I mentioned it is 'high reward for low skill', to dumb it down (if I must) you have a much greater chance at winning with these two champions compared to that of say someone like Shaco, because it requires an individual to think :)","replies":[{"poster":"SSJTribe","date":"2016-05-24T16:34:39.335+0000","up_votes":1,"down_votes":1,"body":"using Shaco as an example of someone hard to play LMAO. You probably think Zed is hard too.","replies":[{"poster":"GOL Undecayed","date":"2016-05-24T18:00:56.327+0000","up_votes":1,"down_votes":2,"body":"I've never played Shaco or Zed, I'm just saying in comparison to Annie and Garen, Shaco is harder to play, I personally think Shaco is bullshit too so relax, he goes invisible as soon as you want to kill him and Assassinates from a 5 year stealth its dumb but not as dumb as the other two, who don't even fall off because of their utility and broken kits and no I don't think Zed is hard to play but at least his ultimate doesn't give him a theoretical 5 man stun, his actually has that thing... What's it called? Oh yh Counterplay which goes beyond simply buying an item. (Which was QSS)","replies":[]}]}]}]}]},{"poster":"ayNigerianPrince","date":"2016-05-24T07:07:52.269+0000","up_votes":3,"down_votes":3,"body":"This is why I'm not gold. I swear.","replies":[{"poster":"Backup4now","date":"2016-05-24T07:37:24.604+0000","up_votes":4,"down_votes":3,"body":"There are many things I want to say to this comment.\n1. More like CUZ UR BAD\n2. Shoulda had a bigger premade group\n3. Katarina players deserve no mercy\n4. Xx...xX is probably why\n5. Might want to play freelo instead of the dark child. Fizz seems to not be banned often....\n6. People who swear lose an arbitrary percentage less games compared to those who don't","replies":[{"poster":"ayNigerianPrince","date":"2016-05-24T14:30:31.364+0000","up_votes":2,"down_votes":2,"body":"i agree with everything youve said but why did we both get downvoted ;[[","replies":[]}]}]},{"poster":"72691359DEL1","date":"2016-06-06T16:37:12.086+0000","up_votes":1,"down_votes":0,"body":"I posted a similar thing a few weeks back:\n\nhttp://boards.na.leagueoflegends.com/en/c/gameplay-balance/Ki6pTnqO-tibbers-is-not-stunning\n\nReally hope this gets looked into. My theory is that the actual radius does not match the tooltip radius.","replies":[]},{"poster":"bulldoggamer","date":"2016-05-24T15:21:50.539+0000","up_votes":1,"down_votes":0,"body":"Not like it matters. Tibbers can auto you for 1500 in 2 sec anyway.","replies":[{"poster":"Phi Gamma Delta","date":"2016-05-26T18:11:27.032+0000","up_votes":1,"down_votes":0,"body":"I think you are exaggerating the 1500 for 2 seconds XD","replies":[{"poster":"bulldoggamer","date":"2016-05-26T18:17:07.116+0000","up_votes":1,"down_votes":0,"body":"Sadly i am not (I really wish i was). I was playing sivir and got killed from about 1400 from Tibbers autos and Tibbers autos alone after i killed the annie. Death recap said it about 1500 damage in just over 2 seconds. I had to get a glass of water because i was so salty afterwards.","replies":[]}]}]},{"poster":"toriFIC","date":"2016-05-25T09:34:16.340+0000","up_votes":1,"down_votes":0,"body":"I've literally stopped playing because of this bug! Annie is my main and I KNOW I shouldn't be \"missing\" my ult stuns. A lot of people are saying that it's an intentional change and that riot have added a very slight delay to the stun (I tend to disagree with this because I've missed stuns on people right next to me not moving - I even made a post with a video where you can see the ludens procing from the ult, but no damage is dealt and the stun fails AND you see the stun counter go from full to one to zero on cast) but if that IS the case then at the very least riot should acknowledge it so we can change our play style/move on from searching the forums all the time.","replies":[]}]}