{"poster":"KestrelGirl","date":"2018-06-27T05:58:41.357+0000","title":"Worldbuilding: Geography of Runeterra (and more!) (MEGAPOST!!)","subforum":"Story, Art, & Sound","up_votes":15,"down_votes":2,"body":"Of course we don&#039;t have a full map of Runeterra - if the most believable fan map I&#039;ve seen has anything to say, the Medarda Heirloom is just a tiny square of the world as we know it. But we at least know most of what direction everything is in, so I&#039;ll work off that. Here we go! I would absolutely love it if a Rioter could tell me how correct - or incorrect - I am on many of these points!\n\n**Demacia:** Southwestern quarter (or strip?) of the northern continent, with territory on the north coast of the unnamed strait between Valoran and Shurima (and more). (The western edge of the Medarda Heirloom features an ostensibly Demacian city where no Noxians are permitted ashore.) A mix of plains, rolling hills, and mountains, with much of the land that has not been cleared for agriculture/building covered in deciduous forest or lush grasses. Drier with more extreme temperatures toward the interior, and snow on the mountains/in the northern parts of Demacia. West coast of Demacia (if there is not another nation on the coast of the continent instead) is a marine west coast climate, cool and rainy. Note that much of the rock in Demacia is petricite. Cities and villages look somewhat medieval, but there is a lot of open space compared to a Noxian fort for instance. Architecture is palatial, open, and airy, with a lot of circles and arches and a hell of a lot of petricite.\n\n**Noxus:** Located to the east of Demacia. I imagine Noxus has a Mediterranean climate or similar - it&#039;s definitely arid, so my home state of California sounds like a good comparison given the damn drought! Mostly mountainous with stretches of habitable foothills and some plateaus, Noxus&#039;s lack of natural resources has made them as warlike as they are. Cities, towns, and forts are built for utility rather than navigability, with winding narrow streets - very medieval western European. Architecture is imposing but very functional, and looks hostile - darker stone or wood, very squarish, etc.\n\n**Ionia:** A mixture of terrain that is influenced heavily by the native magic of the island chain - many land forms appear downright magical (lots of amazing rock formations), though the parts of it that aren&#039;t as magically influenced are still very diverse: hills and mountains, grasslands, jungles, even a desert. Climate is very varied, think Japan, but I imagine the cooler mountain territory is toward the north end of the island chain, the warm grasslands and perhaps the Ghetu Desert are further south, and the sweltering jungles lie at the southern tip (which is likely in the tropics). I&#039;d imagine the architecture of an Ionian village looks more elven than East Asian due to the fact that it&#039;s mostly made of living trees.\n\n**Shurima:** Occupies at least a great portion of the southern continent. It&#039;s not all sand dunes! Rather than look at the real world, I look at Elona from the Guild Wars universe as an inspiration for Shurima: while there is still lots of sand, it still has a huge amount of terrain variance, with mountains, fertile rivers, and coastline. Different parts of the desert may have different types of sand or feature more outcroppings or rock formations. Climate is as arid as you&#039;d imagine, though it can get pretty cold at night further inland, and it&#039;s more temperate in any mountain ranges that may exist. Seasonal rains flood rivers around Shurima, and presumably the population is very dependent on these to grow crops. The northeast coast of Shurima, closest to Noxus, probably has something more like a Mediterranean climate (like Noxus), or at the very least a wet and dry season.\n\n**Freljord:** Located to the northwest of Demacia, most likely, if we assume the arrow pointing to it on the Heirloom is a sea route. It&#039;s not all snow and ice! Think of Scandinavia: mountains (probably mostly mountains in this case), fjords, glacial lakes, southern lowlands, and then actual tundra to the far north. There is some volcanic activity, for instance in Ornn&#039;s mountain forge; this is not something we see anywhere else, to my knowledge, unless there are any volcanoes in Ionia etc. (EDIT: there's one further south, where Shyvana was born.) Climate varies depending on latitude, provided it isn&#039;t magically affected or Runeterra doesn&#039;t use the half-arsed excuse of &quot;it&#039;s not Earth.&quot; Ashe and the Avarosans probably live in the cool/temperate south, Sejuani and the Winter&#039;s Claw in the colder mountains and tundra, and Lissandra and her Frostguard to the far, far north, where everything really is snow and ice. Architecture varies, but is usually somewhere between gothic and Nordic (or fantasy-Nordic).\n\n**Bilgewater and the Serpent Isles:** Bilgewater is just part of the island chain called either the Serpent Isles or Blue Flame Isles, depending on who you ask. It&#039;s the most desolate of the islands, hence the use of ships as building material and the need to ship in food from elsewhere. Because... it is literally all rock. But that&#039;s not true for the rest of Buhru territory: the other islands are more like parts of Kaua&#039;i (I&#039;ve been there but I feel like there&#039;s a better comparison). Rocky, not a lot of room for crops, but very fertile and tropical in climate and biosphere. (Seafood, fruit, nuts, seeds, and root vegetables are presumably most of the constituents of the Buhru diet.) Also I guess it has some nice gold veins because Buhru temples are gold-plated. Climate varies: tropical heat is balanced by the cooling ocean, which may or may not lead to frequent storms at sea. We don&#039;t know much of anything about Buhru architecture but if we do see it, I won&#039;t be surprised if it has a lot of Aztec influence.\n\n**Piltover-Zaun:** Just east of Noxian territory, so shares its (maybe) Mediterranean climate. Somewhere between Victorian and Italian architecture in Piltover, steampunk-Victorian in Zaun. Not much geography to speak of considering the city&#039;s small horizontal area - it&#039;s basically built around a giant ravine on the coast.\n\n**Mount Targon:** No headcanons for this one. Any geographical info about the area is already established. Along with its major magical influence on the terrain, and it being a pretty small area, we have no clue where in Runeterra it is, though most educated guesses I&#039;ve seen place it in northwestern Shurima.\n\n**Void:** The actual Void is probably something of an is-not, but the caves below Shurima where the border between worlds grows thin (which are also where Kai&#039;Sa spent half her life) look a lot like the Dragonbrand in Guild Wars 2. Except more organic than crystalline. That is basically all I can provide.\n\n**Shadow Isles:** EDIT: The one resource I have is that it's southeast of Bilgewater, which means it's positioned kinda like New Zealand. (Thanks comment section!) So back when it was the Blessed Isles, it was probably nice and temperate with fertile fields and forests, kind of like the hemispherical opposite of Demacia.","replies":[{"poster":"Bioluminescence","date":"2018-06-27T15:15:31.368+0000","up_votes":12,"down_votes":0,"body":"O to the Em Gee I love this.\n\n{{sticker:katarina-love}} \n\nGoing through this was spooky in places, your estimates were so on the nose.  (One or two places you were a bit off, but that is only to be expected!)  I wouldn't have imagined the average player knowing about marine west coast biome types, so props to you :D\n\nYou should print this out and keep it for when the three-continent Runeterra map comes out - I think you'll be interested in how close or otherwise you've gotten in places.  I also hope you'll find that there hasn't been much in the way of half-assing anything!  (I _really_ hope that.)","replies":[{"poster":"KestrelGirl","date":"2018-06-27T16:10:04.523+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Bioluminescence,realm=NA,application-id=6kFXY1kR,discussion-id=h3EEMTek,comment-id=0004,timestamp=2018-06-27T15:15:31.368+0000)\n>\n> O to the Em Gee I love this.\n> \n> {{sticker:katarina-love}} \n> \n> Going through this was spooky in places, your estimates were so on the nose.  (One or two places you were a bit off, but that is only to be expected!)  I wouldn&#x27;t have imagined the average player knowing about marine west coast biome types, so props to you :D\n> \n> You should print this out and keep it for when the three-continent Runeterra map comes out - I think you&#x27;ll be interested in how close or otherwise you&#x27;ve gotten in places.  I also hope you&#x27;ll find that there hasn&#x27;t been much in the way of half-assing anything!  (I _really_ hope that.)\n\nTHANK YOU SO MUCH!!! I'm so happy to hear I was mostly accurate - and surprised I was able to use last semester's college geography course to my advantage so soon! (I wonder what's on continent #3... Is it just Ionia?)","replies":[]},{"poster":"Ifneth","date":"2018-06-27T15:20:40.428+0000","up_votes":1,"down_votes":4,"body":"> [{quoted}](name=Bioluminescence,realm=NA,application-id=6kFXY1kR,discussion-id=h3EEMTek,comment-id=0004,timestamp=2018-06-27T15:15:31.368+0000)\n>\n> O to the Em Gee I love this.\n> \n> {{sticker:katarina-love}} \n> \n> Going through this was spooky in places, your estimates were so on the nose.  (One or two places you were a bit off, but that is only to be expected!)  I wouldn&#x27;t have imagined the average player knowing about marine west coast biome types, so props to you :D\n> \n> You should print this out and keep it for when the three-continent Runeterra map comes out - I think you&#x27;ll be interested in how close or otherwise you&#x27;ve gotten in places.  I also hope you&#x27;ll find that there hasn&#x27;t been much in the way of half-assing anything!  (I _really_ hope that.)\n\nThee continent map?  That means we have Valoran, Ionia, and the Shadow Isles confirmed as the Runeterran continents.  Next questions: what is the shape of Runeterra itself, and where do these continents lie on it?","replies":[{"poster":"Bioluminescence","date":"2018-06-27T15:38:49.341+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Ifneth,realm=NA,application-id=6kFXY1kR,discussion-id=h3EEMTek,comment-id=00040000,timestamp=2018-06-27T15:20:40.428+0000)\n>\n> Thee continent map?  That means we have Valoran, Ionia, and the Shadow Isles confirmed as the Runeterran continents.  Next questions: what is the shape of Runeterra itself, and where do these continents lie on it?\n\nI have confirmed no such thing! Don't put text in my mouth :P  \nThe three continents have been discussed before in other threads - it shouldn't be a surprise to the cartographer-players here.","replies":[{"poster":"Terozu","date":"2018-06-27T16:25:34.269+0000","up_votes":1,"down_votes":0,"body":"Are you going to be expanding to the area south of what used to be called Kumungu Jungle?","replies":[{"poster":"Bioluminescence","date":"2018-06-27T17:04:48.617+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Terozu,realm=NA,application-id=6kFXY1kR,discussion-id=h3EEMTek,comment-id=0004000000010000,timestamp=2018-06-27T16:25:34.269+0000)\n>\n> Are you going to be expanding to the area south of what used to be called Kumungu Jungle?\n\nI'm not sure how to answer this one.  \n\nThere is an area that would have once been called the Kumungu Jungle (let's just call it 'The Jungle' for ease of reference just now) but I'm not sure what you mean about expanding to the area south of the Kumungu.  Do you mean the area that was drawn as south on the old, blob, map (the Plague Jungles)?  Or do you mean something else?","replies":[{"poster":"Terozu","date":"2018-06-27T17:19:01.910+0000","up_votes":1,"down_votes":0,"body":"The \"Unkown Lands\" on My Fizz no ult's map.\n\nhttps://m.imgur.com/jRKchM1?r\n\nI thought the idea of there being lands unaffiliated and unexplored by the northern continents could be a really interesting and hoped you might incorporate it.\n\nI was wandering of you were going to expand the map down there.\n\nI got really excited over the idea and created a whole tribe of people with their own words, and even theorised how they might be blocked off from the rest of Runeterra from some magical radiation caused by the Rune wars.  I know its silly but i just love the idea. :b","replies":[{"poster":"Bioluminescence","date":"2018-06-27T17:36:18.802+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Terozu,realm=NA,application-id=6kFXY1kR,discussion-id=h3EEMTek,comment-id=000400000001000000000000,timestamp=2018-06-27T17:19:01.910+0000)\n>\n> The &quot;Unkown Lands&quot; on My Fizz no ult&#x27;s map.\n> \n> https://m.imgur.com/jRKchM1?r\n> \n> I thought the idea of there being lands unaffiliated and unexplored by the northern continents could be a really interesting and hoped you might incorporate it.\n> \n> I was wandering of you were going to expand the map down there.\n> \n> I got really excited over the idea and created a whole tribe of people with their own words, and even theorised how they might be blocked off from the rest of Runeterra from some magical radiation caused by the Rune wars.  I know its silly but i just love the idea. :b\n\nOoooh.\n\nThere are definitely areas that are unexplored, independent areas, and areas that _we've_ not seen yet (and there's a lot of room for more than just three continents) but I can't say where those are yet.","replies":[]},{"poster":"Whyte Lyon","date":"2018-06-27T21:40:51.237+0000","up_votes":1,"down_votes":0,"body":"The latest lore happens to mention a character had visited some lands over the western sea. So far there is no official landmass across that way, implying the ground works for something new and unexplored.\n\nI can only imagine your 'unknownlands' to be like this, rather its out furthest west not furthest south.","replies":[{"poster":"Terozu","date":"2018-06-27T22:57:40.013+0000","up_votes":1,"down_votes":1,"body":"The unknown lands were a fan thing not an official lore thing.\n\nBio said itd be interesting to have unexplored lands so i was hoping theyd include them in the new map.","replies":[]}]}]}]}]},{"poster":"Ifneth","date":"2018-06-27T16:50:02.068+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Bioluminescence,realm=NA,application-id=6kFXY1kR,discussion-id=h3EEMTek,comment-id=000400000001,timestamp=2018-06-27T15:38:49.341+0000)\n>\n> I have confirmed no such thing! Don&#x27;t put text in my mouth :P  \n> The three continents have been discussed before in other threads - it shouldn&#x27;t be a surprise to the cartographer-players here.\n\nOooh, another player mentioned that some Riot text suggests Shurima might not be on Valoran.\n\nBum bum buuuuuum...","replies":[{"poster":"KestrelGirl","date":"2018-06-27T18:17:50.954+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Ifneth,realm=NA,application-id=6kFXY1kR,discussion-id=h3EEMTek,comment-id=0004000000010001,timestamp=2018-06-27T16:50:02.068+0000)\n>\n> Oooh, another player mentioned that some Riot text suggests Shurima might not be on Valoran.\n> \n> Bum bum buuuuuum...\n\nthe continents are PROBABLY:\n\n- Valoran - Demacia, Noxus, Freljord\n- Southern continent - Shurima, possible jungles\n- Ionia","replies":[{"poster":"Lady Faceless","date":"2018-06-27T18:58:21.558+0000","up_votes":1,"down_votes":0,"body":"Valoran - Demacia, Noxus, Freljord, Piltover & Zaun\nUnnamed southern continent - Shurima & Mt. Targon (see Taliyah lore)\nIonia - well Ionia\nShadow Isles & Serpent Isles/Blue Flames Isles are only isles which don't belong to any continent","replies":[]}]}]}]},{"poster":"Baron Von Bangin","date":"2018-06-27T15:34:43.421+0000","up_votes":2,"down_votes":0,"body":"Considering that in the recent stories Riot has put out, they mention something along the lines of \"from Shurima to Valoran.\" I'm assuming Shurima is likely a major one rather than the shadow Isles.","replies":[]}]},{"poster":"Nylisa","date":"2018-06-27T17:29:49.031+0000","up_votes":1,"down_votes":0,"body":"How long does it take Riot lore team to come up with these details? i'm a novice writer and i've been working on something for several years now. but sometimes i see stuff like this about League or other sophisticated stories and instead of getting inspiredi feel discouraged that i can't just come to this level of details. despite trying my best to research.\n\ni know its one person vs a big team of professionals but it still sometimes get me down so i wonder how this process works for you. i was going to make a separate post about this but i wasn't sure if i can get any replies.","replies":[{"poster":"Bioluminescence","date":"2018-06-27T17:49:29.638+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Nylisa,realm=EUW,application-id=6kFXY1kR,discussion-id=h3EEMTek,comment-id=00040003,timestamp=2018-06-27T17:29:49.031+0000)\n>\n> How long does it take Riot lore team to come up with these details? i&#x27;m a novice writer and i&#x27;ve been working on something for several years now. but sometimes i see stuff like this about League or other sophisticated stories and instead of getting inspiredi feel discouraged that i can&#x27;t just come to this level of details. despite trying my best to research.\n> \n> i know its one person vs a big team of professionals but it still sometimes get me down so i wonder how this process works for you. i was going to make a separate post about this but i wasn&#x27;t sure if i can get any replies.\n\nDon't get discouraged!  You only see the outcomes, not the problems and process.\n\nBuilding a setting or a world is an endless task, but it can be made of tiny individual tasks that are totally manageable on their own.  Some days, you feel inspired and confident enough to work on the big questions - but some days you can work on the smaller, more personal scale, questions.\n\nIt's good also to have a goal in mind - some world building is higher priority than others (as I'm sure many folks here can confirm), so it's important not to neglect the big goals that will have knock on effects.  But if your goal is to make a novel in your world, then answer the big questions that effect everything, and then focus on the relevant details for your story.  There are diminishing returns in working out the cobbling methods of the people on the opposite side of the world from your novel's story, if there are no shoe-related story-lines in your book :D","replies":[{"poster":"Nylisa","date":"2018-06-27T18:14:06.656+0000","up_votes":1,"down_votes":0,"body":"Thank you for replying but im not sure if i understand this part.\n\n>There are diminishing returns in working out the cobbling methods of the people on the opposite side of the world from your novel's story, if there are no shoe-related story-lines in your book :D\n\nCould you please explain  further?","replies":[{"poster":"Bioluminescence","date":"2018-06-27T18:21:27.592+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Nylisa,realm=EUW,application-id=6kFXY1kR,discussion-id=h3EEMTek,comment-id=0004000300000000,timestamp=2018-06-27T18:14:06.656+0000)\n>\n> Thank you for your reply but im not sure if i understand this part.\n\nI mean that, there are thousands of things you could try to work out for a world.  Maybe even millions of things.  Some of those things will be big things like \"What intelligent species live there?\" or \"What kind of planet is it - is it a planet?\".  Some things are small things like \"What color are the seedpods of a specific tree in a specific valley?\" or \"How does a specific NPC tie their shoes?\"\n\nYou could answer every question, but some questions are more valuable to answer than others - depending on your goal.\n\nIf you are making a farming game set in that specific valley - then the color of those seedpods might actually be pretty important!  But if you're writing a political novel set in the secret halls of government, then seedpod color is probably not very valuable to you.  There are other, more important questions to answer first :D","replies":[{"poster":"Nylisa","date":"2018-06-27T18:42:14.117+0000","up_votes":2,"down_votes":0,"body":"Then i think im on right path , because i cant think of many details i worked on, that wasnt important to building this universe. Basic details such as agriculture, architecture, geography.\n\nTo quote Kestrelgirl here, i dont want to half ass these details so it tire me sometimes when i push so hard to make sure the details are accurate, its just too much work. \n\nDoing this helps me appreciate the work you guys doing more often even though i complain sometimes.\n\nSo thank you for taking the time to answer me.","replies":[]}]},{"poster":"KestrelGirl","date":"2018-06-27T18:18:29.284+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Nylisa,realm=EUW,application-id=6kFXY1kR,discussion-id=h3EEMTek,comment-id=0004000300000000,timestamp=2018-06-27T18:14:06.656+0000)\n>\n> Thank you for your reply but im not sure if i understand this part.\n> \n> Could you please explain  further?\n\nIf your story has nothing to do with shoes, then there's no point in researching shoemaking methods. Analogy I guess.","replies":[{"poster":"Nylisa","date":"2018-06-27T18:44:18.826+0000","up_votes":1,"down_votes":0,"body":"A fine example thank you :)","replies":[]}]}]}]}]},{"poster":"Whyte Lyon","date":"2018-06-27T15:44:54.603+0000","up_votes":1,"down_votes":0,"body":"Didnt Ahri's lore mention a desert in Ionia, something about being a sea that dried up? \n\nWould love to learn how someday.","replies":[{"poster":"Bioluminescence","date":"2018-06-27T15:53:01.928+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Whyte Lyon,realm=OCE,application-id=6kFXY1kR,discussion-id=h3EEMTek,comment-id=00040001,timestamp=2018-06-27T15:44:54.603+0000)\n>\n> Didnt Ahri&#x27;s lore mention a desert in Ionia, something about being a sea that dried up? \n> \n> Would love to learn how someday.\n\nThe Ghetu Sea, yes.  \n\nMan, I can't tell you how confused folks who aren't as into the lore get when you talk about some place called a \"sea\" and it's positioned on land.  Accidentally had folks trying to 'correct' the mistake and place it off the coast instead. ;)  Totally understandable.","replies":[]}]},{"poster":"Chromatic Eagle","date":"2018-06-27T18:56:15.504+0000","up_votes":1,"down_votes":0,"body":"JoJo part 8 will get an anime before this map comes out.","replies":[]}]},{"poster":"Ebonmaw Dragon","date":"2018-06-27T18:31:13.909+0000","up_votes":1,"down_votes":0,"body":"I just want to mention that, if Mechs VS Minions is canon, Bandle City is near the Magma Chambers... for reasons","replies":[{"poster":"KestrelGirl","date":"2018-06-27T21:13:14.037+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Ebonmaw Dragon,realm=NA,application-id=6kFXY1kR,discussion-id=h3EEMTek,comment-id=0005,timestamp=2018-06-27T18:31:13.909+0000)\n>\n> I just want to mention that, if Mechs VS Minions is canon, Bandle City is near the Magma Chambers... for reasons\n\nBandle City is in the spirit realm so nope.","replies":[{"poster":"Ebonmaw Dragon","date":"2018-06-27T21:15:57.212+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=KestrelGirl,realm=NA,application-id=6kFXY1kR,discussion-id=h3EEMTek,comment-id=00050000,timestamp=2018-06-27T21:13:14.037+0000)\n>\n> Bandle City is in the spirit realm so nope.\n\nNot really confirmed as far as I know, and even if it is, maybe the Magma Chamber is in the Spirit Realm as well...\n\nThat would explain why we will never see it in game.","replies":[]}]}]},{"poster":"Whyte Lyon","date":"2018-06-27T11:17:12.456+0000","up_votes":2,"down_votes":0,"body":"Fellow GW2 player, or at least on the occasion anyway. \n\nIve always wanted an area like the Branded zones put somewhere in Runeterra. In this case my thoughts were the crazy crystal corruption is seared across some inaccessible land, created from a cataclysm during one of the Rune Wars. A long scar, with perpetual hazardous storms being a reminder to the world of the irreversible effects such runes could bring.\n\nOn the other hand I would really love Draconis Mons to be a location somewhere too. Just the idea of a volcano imbued with so much magic that its hollow interior can sustain life and flora grows. A little bit \"Journey to the Center of the Earth' like. \n\nCool ideas that one can only dream of something similar.","replies":[{"poster":"KestrelGirl","date":"2018-06-27T16:07:53.363+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Whyte Lyon,realm=OCE,application-id=6kFXY1kR,discussion-id=h3EEMTek,comment-id=0001,timestamp=2018-06-27T11:17:12.456+0000)\n>\n> Fellow GW2 player, or at least on the occasion anyway. \n> \n> Ive always wanted an area like the Branded zones put somewhere in Runeterra. In this case my thoughts were the crazy crystal corruption is seared across some inaccessible land, created from a cataclysm during one of the Rune Wars. A long scar, with perpetual hazardous storms being a reminder to the world of the irreversible effects such runes could bring.\n> \n> On the other hand I would really love Draconis Mons to be a location somewhere too. Just the idea of a volcano imbued with so much magic that its hollow interior can sustain life and flora grows. A little bit &quot;Journey to the Center of the Earth&#x27; like. \n> \n> Cool ideas that one can only dream of something similar.\n\nYessss! (I think Runeterra might need a few more volcanoes than are currently known to begin with...)","replies":[{"poster":"Bioluminescence","date":"2018-06-27T19:05:50.916+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=KestrelGirl,realm=NA,application-id=6kFXY1kR,discussion-id=h3EEMTek,comment-id=00010000,timestamp=2018-06-27T16:07:53.363+0000)\n>\n> Yessss! (I think Runeterra might need a few more volcanoes than are currently known to begin with...)\n\nWell, we know of two in player-facing canon at the moment.  You mentioned one (connected to Ornn) but there is another :)  \n\nVolcano Clue:\nNot as nice a place to raise a daughter, as you might imagine.","replies":[{"poster":"KestrelGirl","date":"2018-06-27T21:14:43.825+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Bioluminescence,realm=NA,application-id=6kFXY1kR,discussion-id=h3EEMTek,comment-id=000100000000,timestamp=2018-06-27T19:05:50.916+0000)\n>\n> Well, we know of two in player-facing canon at the moment.  You mentioned one (connected to Ornn) but there is another :)  \n> \n> Volcano Clue:\n> Not as nice a place to raise a daughter, as you might imagine.\n\nAha! The volcano where Shyvana was born - thanks Cetri! Wonder how close to Demacia it is - I imagined Demacia as being midlatitude...","replies":[{"poster":"Whyte Lyon","date":"2018-06-27T21:26:41.972+0000","up_votes":2,"down_votes":0,"body":"It cant be too close. I imagine on the basis that Dragons dont live near Demacia on account of it hindering their elemental flame.","replies":[]}]},{"poster":"Cetri","date":"2018-06-27T20:19:39.857+0000","up_votes":2,"down_votes":0,"body":"The other one is the one where Shyvana was born, yes? Which is... somewhere on or near the equator, but not necessarily anywhere near Demacia.","replies":[]}]}]}]},{"poster":"Nylisa","date":"2018-06-27T06:26:13.304+0000","up_votes":2,"down_votes":0,"body":"> look a lot like the Dragonbrand in Guild Wars 2\n\n\nPretty much nailed it with this example. first thing i thought about when i was reading up on Void. although it appears that Void itself is more complex, at points based on evidence and what Riot is telling us. i feel like Void is a place where aspects of Reality can be distorted. when i think of Void i don't imagine a massive cave full of voidlings crawling on top of each other. i imagine a upside down world where everything is chaotic and makes no sense. \n\n\nNice work with rounding this information.","replies":[{"poster":"KestrelGirl","date":"2018-06-27T06:31:27.961+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nylisa,realm=EUW,application-id=6kFXY1kR,discussion-id=h3EEMTek,comment-id=0000,timestamp=2018-06-27T06:26:13.304+0000)\n>\n> Pretty much nailed it with this example. first thing i thought about when i was reading up on Void. although it appears that void is more complex, at points based on evidence and what Riot is telling us. i feel like Void is a place where aspects of Reality can be distorted. when i think of Void i don&#x27;t imagine a massive cave full of voidlings crawling on top of each other. i imagine a upside down world where everything is chaotic and makes no sense. \n> \n> There is a Question here about the Void, about how it makes people insane, instantly when in direct contact with it. is it like a defense mechanism, an effect that make people insane or is it  what they see that destroys their sanity! \n> \n> then again...Sanity is for the weak &gt;:D \n> \n> Nice work with rounding this information.\n\nThank you!\n\nYeah, I was primarily imagining the very physical, not-so-upside-down but convoluted caves beneath Shurima. The actual Void does distort reality and makes no sense.","replies":[{"poster":"Nylisa","date":"2018-06-27T06:40:12.754+0000","up_votes":1,"down_votes":0,"body":"Yes, Sorry i got a bit off topic there.the Void sucked me in!\n\nthose Caves are still a bit strange to me though. if they are actually just Caves.how come Kai'sa took so long to find her way outside? if there is a Cave there is most likely a way out of it. and with Void digging and going outside i wonder how she never found any of these ways out in 10 years. maybe Void does something to these Caves that they are not accessible by everyone.\n\ni was thinking Why Shurima?! is the Void itself is in same space as Shurima but in a different dimension? ","replies":[{"poster":"Pale Mask","date":"2018-06-27T12:10:24.170+0000","up_votes":1,"down_votes":0,"body":"> those Caves are still a bit strange to me though. if they are actually just Caves.how come Kai'sa took so long to find her way outside? if there is a Cave there is most likely a way out of it. and with Void digging and going outside i wonder how she never found any of these ways out in 10 years. maybe Void does something to these Caves that they are not accessible by everyone.\n\nSince the caves were created by Void corruption, even if Kai'Sa wasn't actually in the Void itself, the aberrant, Void-warped structure of the caves and the mind-affecting energies coursing through them would make them incredibly hard to navigate.\n\n> i was thinking Why Shurima?! is the Void itself is in Shurima but in a different dimension?\n\nI don't think the Void is part of the same universe as Runeterra. It's more likely an alternate plane of (non)existence.","replies":[{"poster":"Nylisa","date":"2018-06-27T16:31:42.955+0000","up_votes":1,"down_votes":0,"body":">I don't think the Void is part of the same universe as Runeterra. It's more likely an alternate plane of (non)existence.\n\nthat's what i mean as well . Void and Shurima occupying same space ( or paralleled spaces) but in 2 different dimensions or plane of existence.","replies":[]}]}]}]}]},{"poster":"ClonieMor","date":"2018-06-27T20:27:07.149+0000","up_votes":1,"down_votes":0,"body":"As far as I remember from Icathia's short story, the city was located at the eastern part of Shurima, near the sea. Probably in this region we may find the most touched-by-the-Void landscape.","replies":[]},{"poster":"Johnny El Rojo","date":"2018-06-27T14:11:06.081+0000","up_votes":1,"down_votes":0,"body":"Seeing the Shadow Isles are so much to the south that they are located even far from the equator, most probably would had a similar climate to New Zealand before getting cursed. If {{champion:57}} and {{champion:83}} biographies serve of any indicator, they would had vast forests and fertile crops.","replies":[{"poster":"KestrelGirl","date":"2018-06-27T16:15:10.409+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Johnny El Rojo,realm=EUW,application-id=6kFXY1kR,discussion-id=h3EEMTek,comment-id=0003,timestamp=2018-06-27T14:11:06.081+0000)\n>\n> Seeing the Shadow Isles are so much to the south that they are located even far from the equator, most probably would had a similar climate to New Zealand before getting cursed. If {{champion:57}} and {{champion:83}} biographies serve of any indicator, they would had vast forests and fertile crops.\n\nHey, that's a good comparison! Added!","replies":[]}]},{"poster":"Pale Mask","date":"2018-06-27T12:21:57.944+0000","up_votes":1,"down_votes":0,"body":"https://vignette.wikia.nocookie.net/leagueoflegends/images/2/26/Shadow_Isles_Black_Mist.png/revision/latest?cb=20170219101605\n\nAccording to this image, the Shadow Isles appear to be southeast of Bilgewater.","replies":[{"poster":"KestrelGirl","date":"2018-06-27T16:11:00.835+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Tharizdûn,realm=EUW,application-id=6kFXY1kR,discussion-id=h3EEMTek,comment-id=0002,timestamp=2018-06-27T12:21:57.944+0000)\n>\n> https://vignette.wikia.nocookie.net/leagueoflegends/images/2/26/Shadow_Isles_Black_Mist.png/revision/latest?cb=20170219101605\n> \n> According to this image, the Shadow Isles appear to be southeast of Bilgewater.\n\nOld map, but probably still holds some water. Good point. I'll make an edit.","replies":[]}]}]}