{"poster":"iAmDrive","date":"2016-05-10T01:28:35.965+0000","title":"Account Hacked","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"Hi I made this account to get a response from the community or a rioter for my hacked account. My account \"Lost Driving\" was hacked yesterday and I've spent a lot of money on the account but I haven't received a reply or anything yet, and I tried to provide information for my account as well as I possibly could, but I was sad I didn't get to play today since the account still seems to be hacked. The reason for why I got hacked is because I clicked a link that a trusted real life friend sent me, and after I talked to him he told me he wasn't even playing at the time I received the link so I talked to another friend and he said it was some sort of \"phisher\" (not too sure with what that is). I'm not familiar with how long riot takes to respond to hacked accounts, but I was really hoping I could get the account back in time for ascension and urf again because I really like the new game mode rotation that they've added. My ticket number for the ticket that I filed to recover my account is #21598125 Please someone help me out with how long it would take for a reply from riot or what will happen if someone did something malicious with my account. I'd really like to get access of my account as soon as possible and I love to play league everyday. Thank you to everyone who tries to help me!","replies":[{"poster":"dArtagnan","date":"2016-05-10T04:47:01.824+0000","up_votes":3,"down_votes":0,"body":"I went ahead and took a look at your ticket.  From my initial investigation, it looks like it went to one of our automated services to see if we can immediately recover your account back to you.  Unfortunately, some of the info you have entered doesn't match what we have recorded for your account.  Because of this, it was properly escalated to one of our Account Recovery Specialists, and they should be able to help you out and get it back to you!\n\nFor the time being, just sit tight, and you'll get a response in the near future!","replies":[{"poster":"kwikyman","date":"2017-11-07T06:38:19.527+0000","up_votes":1,"down_votes":0,"body":"My account got hacked tot like half a year ago and i'm super sure it's hacked by a frenshman couse i clicked tot auto log in tot the league of legenda website and my email adressen Changed, van you please help me riot","replies":[]},{"poster":"SoBakedDude","date":"2016-06-25T20:37:54.927+0000","up_votes":1,"down_votes":0,"body":"Hello, my account has been hacked today from the same exact thing! could i be helped too??? Ive submmited a ticket already","replies":[]},{"poster":"bubbycafe","date":"2016-05-16T03:05:20.712+0000","up_votes":1,"down_votes":0,"body":"Hi, my account was also hacked recently, and my ticket is #21670396. Do you know how long it could take to get it back?  Thanks~","replies":[]},{"poster":"iAmDrive","date":"2016-05-10T05:01:44.946+0000","up_votes":1,"down_votes":0,"body":"Ok thanks for helping out! I am willing to share credit account numbers through email with riot if needed, and if the person who is in control of the account does anything, will I be penalized for it too?","replies":[{"poster":"DarkRitual","date":"2016-05-10T17:35:41.590+0000","up_votes":1,"down_votes":0,"body":"If it's proven hacked, Riot won't punish you for things done while it was comrpimised, fortunately.","replies":[{"poster":"iAmDrive","date":"2016-05-10T21:50:59.041+0000","up_votes":1,"down_votes":0,"body":"Ok thanks for the reassurance and hopefully they can get back to me soon!","replies":[]}]}]}]},{"poster":"CrashBash95","date":"2017-04-07T15:12:12.738+0000","up_votes":1,"down_votes":0,"body":"how long does it take to recover a hacked account. Give me a real life number without beating around the bush ( like depends on  ... or based on .... )","replies":[]}]}