{"poster":"Gandalff","date":"2015-09-30T00:18:33.022+0000","title":"Server Skin (Not about the money)","subforum":"Miscellaneous","up_votes":9,"down_votes":1,"body":"Hey Riot and Community,\r\n\r\nI&#039;ve played league since all the way back in season 2, and I can happily say that it is my favourite game. In my four years of playing it I have never really been disappointed or unhappy about a decision riot has made as a business or a service provider. That is until I saw the &quot;server skin&quot;. Now before you stop reading and start labeling me as some form of cancer that just wants free stuff, I want to make it clear that I have little problem with riot asking for money for the skin. They are a business. They make money. The more they make the better i can enjoy their game. However I do have a couple of problems with this server skin. \r\n\r\nFirstly, I just don&#039;t understand how it fits into any sort of Oceanic theme. Given that the ability particles and sounds aren&#039;t on PBE yet and I can&#039;t actually see the final product, I still feel somewhat upset that the skin supposedly designed to represent our server is really just arclight/Jucticar Kassadin with a southern cross in the splash. Like, the southern cross doesn&#039;t really even represent the whole of the region. Though it is indeed very visible in the sky, it has more recognition as the symbol on the Australian and New Zealand flags then anything (New Zealand being in the process of changing flag.) and I&#039;d argue that you can see the southern cross in the sky anywhere in the southern hemisphere, not just OCE. I know there seems to be a common misconception that no one cared about the server skin, but that really isn&#039;t true. There was a steady stream of forum and boards posts giving some great ideas and input. Literally the only time other than this that I had posted in the boards was to discuss the server skin. I just feel like the riot design team has done an abyssmal {{item:3001}} job of representing our region. http://boards.oce.leagueoflegends.com/en/c/miscellaneous/UfQZtU6s-oce-skin (my post 10 months ago. Got no views but it shows i care{{item:3070}} )\r\n\r\nSecondly, the charity thing is a great idea. I am really happy that riot does things like this. Especially the artificial reef, that is just an awesome thing to do. However, if you are going to donate portions of our server skin profits to charities, why not make it a thing on all the servers? It would be an awesome way to represent the oceanic region because as a whole i feel like the people of Oceania are are considered some of the nicest in the world, up there with Canadians and Scandinavians. Instead the sum of our discounted price is all that is going to charity, like how much do you think that will even be? I know I probably won&#039;t be buying the skin and a tonne of my friends won&#039;t be either. Personally I&#039;m going to donate the five dollars to charity off my choice and not feel guilty about not getting the skin. \r\n\r\nLast of all, why kassadin? Like I really enjoy playing kassadin and wouldn&#039;t reroll him if i got him on aram, but seriously he is one of the top 10 least played champs and has one of the lowest win rates. Basically he sucks. He was nerfed into the ground.\r\nKassadin stats: http://www.elophant.com/league-of-legends/champion/kassadin/stats\r\n\r\nWell that is about all for me, though it will be nice to get a reply, I know that riot really won&#039;t as they seem to be dodging the whole topic, basically I would just like to know why this skin was chosen, and I am also curious to hear a reason for player having to pay for it (again not that I would mind if it was a good skin, but more because other server skins were and I&#039;d like to know why our isn&#039;t.). \r\n\r\nThanks for taking the time to read if you did,\r\nsee ya on the rift","replies":[{"poster":"Maraudaur","date":"2015-09-30T03:49:53.832+0000","up_votes":4,"down_votes":3,"body":"Hey man,\n\nRemember OCE includes more countries than just Aus and NZ.\n\nHave you by any chance had a read of this community post? - http://boards.na.leagueoflegends.com/en/c/story-art/gmjG4aQE-the-new-kassadin-skin-is-heavily-astronomy-based\n\n> Okay, so when I first looked at this picture, I failed to see how this skin had a connection to OCE. Kassadin's attire seemed to be rather not matching the culture of the region as I know it.\n> \n> That was before I realized that the art contained stars, many stars. The stars appearing on his costume and in the background suggested to me that the skin is meant to be very celestial inspired. Certainly stars are not uncommon on the flags of the region (particularly the Southern Cross), but that's not really anything special. In that case, we have to look at the cultures of indigenous peoples.\n> \n> I first looked at the Maori people of New Zealand, already knowing they have some folklore around the stars and have used them to navigatre the oceans way back in the past. I did some light digging and found this: http://www.astronomynz.org.nz/maori-astronomy/taatai-arorangi-maori-astronomy-2.html\n> \n> For Australia, this: http://astrogeo.oxfordjournals.org/content/47/5/5.27.full \n> Papua New Guinea has some mountains called the Star Mountains. That's all I was able to find quickly.\n> \n> Most other countries in the region are small island nations, which probably at least used the stars for navigation. Astronomy is therefore likely an appropriate theme for Oceania, though I await further information on the skin.","replies":[{"poster":"Gandalff","date":"2015-09-30T05:52:35.346+0000","up_votes":5,"down_votes":0,"body":"I did see that! Thanks for the follow up though. My main irk is that the southern cross can be seen from anywhere in the southern hemisphere, including africa and south america. Like, every country in history has used stars to navigate at some point or another. I don't know, having seen the particles now it is a pretty awesome looking skin. I guess that to me it just isn't really \"oceanic\". Thanks for the response! It's good to know you guys really do read this stuff.","replies":[{"poster":"Maraudaur","date":"2015-09-30T06:15:15.092+0000","up_votes":2,"down_votes":4,"body":"Thats a fair sentiment. The skin was inspired by our regions history with the stars (including the southern cross) which may not 100% yell OCE. But we had a lot of trouble creating an acceptable skin that was a blatant representation of our region.\n\nWe definitely keep an eye on the boards. Always looking for feedback and try to jump in when we can.","replies":[{"poster":"Talon12","date":"2015-10-03T08:58:06.891+0000","up_votes":1,"down_votes":0,"body":"So our server skin is cosmic kassadin... That doesn't seem that exciting, sorry.","replies":[]}]}]},{"poster":"JasonWazza","date":"2015-09-30T08:31:34.520+0000","up_votes":3,"down_votes":1,"body":"So serious question, why didn't you announce this on the original post?\n\nThis honestly looks like you just got lucky with someone coming up with a loose interpretation of how this is actually related to OCE.\n\nNot to mention it honestly doesn't represent OCE and instead represents any and all cultures that have anything to do with stars.\n\nHell this is more relevant to Greek's then OCE as most constellations are Greek in origin.","replies":[{"poster":"Maraudaur","date":"2015-09-30T08:48:57.749+0000","up_votes":4,"down_votes":7,"body":"The original post was more discussing the pain around the regionally inspired skin. We were planning on talking more about the inspiration when the skin was actually released.\n\nLike I said earlier it may not 100% yell OCE. But we had a lot of trouble creating an acceptable skin that was a blatant representation of our region. There are a lot of different cultures in our region.","replies":[{"poster":"Kieshwa","date":"2015-10-01T12:01:06.957+0000","up_votes":4,"down_votes":0,"body":"Hahahah noooooooo way. You're just ditching some other skin on us and pretending that was the intention all along. No WAY that took two years in development.\n\n100% someone said \"Oh you made a Kassadin skin with stars, f*ck it, we'll call that one the Oce skin, people in Oce have some stars on their flag, draw in a small southern cross or something in the splash so it looks like it was it all along\"\n\n\"Don't forget to charge them too, even if others servers had multiple skins free, and we made them wait two years for an unthemed skin!\"\n\n\"If they bitch, say we'll give them a 50% discount, even though we already discount all 1350 skins by 25% on release. Hopefully they'll be too dumb to notice\"\n\nWeak effort Riot, seriously.","replies":[]},{"poster":"Autismo Extremo","date":"2015-09-30T10:18:18.095+0000","up_votes":4,"down_votes":3,"body":"So you admit it doesn't even represent oce but you're making it the oce skin? Keep being a joke riot, love it.","replies":[]}]}]}]},{"poster":"FillInTheBlank","date":"2015-09-30T10:29:20.425+0000","up_votes":3,"down_votes":0,"body":"Yeah the skin doesn't represent anything about Oceania.\nThe entire world used stars for navigation.\n\nIf you can't make 1 skin that represents all of Oceania make multiple. Uncle Sam Ryze and Statue of Karthus are 2 skins both to represent the USA.","replies":[{"poster":"ƒamous","date":"2015-09-30T14:56:33.524+0000","up_votes":4,"down_votes":0,"body":"To be fair, NA is made up mainly of Americans, and if you know Americans like I know Americans, all they care about is themselves. NA was easier to make skins for as again, all they care about is themselves. America is recognised on more of a global scale so people can easily tell that Uncle Sam Ryze and Statue of Karthus represent America.\n\nI do agree with what you're saying. Russia got 3 skins for free, yet OCE gets 1 bullshit skin for free for having to deal with a laggy server under the impression that we'd be getting a server skin for free, only to find out that it doesn't represent OCE at all, and it's going to cost money.\n\nBiggest joke lmfao.\n+1 Riot gj!!!!!!","replies":[]}]},{"poster":"Eye of Sauron","date":"2015-09-30T02:31:55.817+0000","up_votes":5,"down_votes":1,"body":"If the server skin is a nunu skin about a kiwi riding a kangaroo throwing coconut and earthquakes as his ult i will buy the skin with or without donation...but not with this. Charity had become a marketing method to boost the skin sales and give more \"reasons\" to buy this skin...which suppose to be free.","replies":[]},{"poster":"Only Heimer","date":"2015-09-30T15:39:33.220+0000","up_votes":4,"down_votes":1,"body":"ROFL \"um peoples of OCE used stars to navigate the oceans\". what a brain dead response. the whole world used stars to navigate. seriously riot just thinks their entire player base are dumb and it's fucking insulting.\n\nRiot just made a cool skin for kassadin and decided to package/market it as the OCE skin because it relates to human history, and you know, OCE are humans too.","replies":[]},{"poster":"Talon12","date":"2015-10-03T08:56:39.404+0000","up_votes":1,"down_votes":0,"body":"Why because Cosmic kassadin repreents jackall","replies":[]}]}