{"poster":"Resp0nse","date":"2016-12-15T09:45:03.784+0000","title":"Elo wieder verbuggt?","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":8,"body":"Hallo liebe Leute,\n\neine Frage zu den Platzierungen habe ich. Ist diese wieder verbuggt wie in der Pre-Season die Flex-Que? Letzte Season kam ich mit meinen Placement Matches bei 7 Wins / 3 Loses in Silber 2 und diese Season kam ich mit 6 Wins / 4 Loses in Bronze 1? Viele aus meinem Team sind auch ins unterste Bronze gestuft worden? *Maximton* iiiiiihihihihiiiihiiihiiist das normal? \n\nDanke f&uuml;r die Antwort.\n\nPS: Dies ist kein Flame, nur eine Frage. Es wundert mich halt. Muss ich halt aus Bronze spielen. Ist m&ouml;glich^^ Daher bitte kein Hate ;)","replies":[{"poster":"Killerkante","date":"2016-12-15T13:54:39.519+0000","up_votes":1,"down_votes":0,"body":"Was mich wundert ist, dass echt nur Spieler unter Gold sich darüber beschweren, ganz selten gibt es Heulsusen die darüber eingestuft sind. (dann wahrscheinlich aber welche die nur durch Placement luck hoch gekommen sind)\nEgal darauf will ich auch nicht hinaus, diese Season ist ein etwas anderer resett als sonst, glaub hardresett.\n\nIst also nicht verbuggt sondern so vorgesehen, zumindest bei dem was ich bisher gelesen habe.","replies":[{"poster":"Resp0nse","date":"2016-12-15T14:16:20.431+0000","up_votes":1,"down_votes":0,"body":"War doch keine Beschwerde. Ich weiß das ich nicht der beste bin. Darauf will ich gar nicht hinaus. Mich wunderte es halt nur das ich letzte Season mit nur einem Win mehr in Silber gestuft wurde und diese Season halt in Bronze. Muss ich mich halt raus spielen. Sag ich ja nichts gegen. Also bin ich keine Heulsuse, sondern jemand, der Fragen stellt ;) Darf man das nicht mehr? Fand jetzt nicht das das ne Mega Heulsusen Aktion war :(","replies":[{"poster":"Killerkante","date":"2016-12-15T14:24:21.012+0000","up_votes":1,"down_votes":0,"body":"War nicht an dich gerichtet, kannst eig nur alles bis \"Egal..\" ignorieren, bzw nicht ernst nehmen.\nWar auch eher bezogen auf Threads wo die Leute wirklich wie babys rumgeheult haben.\n\nps: sorry","replies":[{"poster":"Resp0nse","date":"2016-12-15T15:07:42.556+0000","up_votes":1,"down_votes":0,"body":"Alles gut^^ Ich hab den Vorsatz in S7 nie wieder tilted zu sein^^ war auch so selten angepisst, aber diesmal nehm ich alles locker, n lose is n lose. Auch wenn ich jetzt schon wieder ne losing streak von 4 hab. Aber egal^^ Nach Niederlagen kommen auch wieder Siege. Hab nur Angst das ich direkt wieder abgestuft werde. Ich mein, ich geb mein Bestes. Es sind auch Teilweise sichere Spiele, aber dann wird jemand gecatcht oder schlechter Fight und GG. :( Weißt du wieviele Niederlagen ich haben darf bis ich wieder abgestuft werde?","replies":[{"poster":"Killerkante","date":"2016-12-15T15:25:11.234+0000","up_votes":1,"down_votes":0,"body":"ist MMR abhängig, kann nur ein einziger lose sein oder auch 3+\nAußer du meinst eine komplette Liga, das dauert ewig bis du da abgestuft wirst, sofern überhaupt möglich ohne inaktivität\nHab letzteres zumindest noch nie so mitbekommen","replies":[{"poster":"Resp0nse","date":"2016-12-15T17:54:15.143+0000","up_votes":1,"down_votes":0,"body":"nene. Ne Liga Absteigen wäre heftig. Dann wäre ich so schlecht, das Riot mich wieder auf LvL29 runterstuft :P Bin ja im Moment Bronze","replies":[]}]}]}]}]}]},{"poster":"DanionVibit","date":"2016-12-15T14:39:15.894+0000","up_votes":1,"down_votes":0,"body":"Einmal zur Klarstellung, du wirst IMMER beim Reset tiefer eingestuft!\n\nGenerell musst du einiges über die Rangliste wissen um zu verstehen was da passiert. \n\nEine kurze Erklärung:\nBei jedem Seasonanfang gibt es einen Soft-Reset. Das heißt du musst eine neue Einstufung spielen (Die 10 Spiele) und dabei ist der höchst erreichbare Rang bei Platin 1. Das ist auch der Knackpunkt warum 99% aller Spieler niedriger eingestuft werden als in der vorherigen Season. Es muss der ganz Diamant, Master und Challanger Tier kompensiert werden. Dabei ist es in der SoloQ schlimmer als in der neue FlexQ, da dort kaum Spieler im Master/Challanger Tier waren.\n\nEs gibt also zwei Herangehensweisen bei einer neuen Season. Du spielst sofort und gehst das (eigentlich) bekannte Problem ein etwa 1,5 Tiers zu droppen (egal wie gut die Einstufung für dich lief). Dafür bekommst du allerdings pro Sieg ordentlich mehr Punkte, da deine \"Hidden-MMR\" ja nicht großartig gesunken ist. \n\nAls nächstes (was ich mache) ist du wartest etwa ein bis zwei Monate bis du dich Einstufen lässt, denn innerhalb der ersten paar Wochen verschiebt sich die Rangliste wieder Richtung nach oben. Somit spielst du eigentlich wieder in deinem \"eigentlichen\" Bereich und du wirst nicht all zu viel tiefer eingestuft (etwa 1 - 0,5 Tiers).\n\nAber egal was du machst, man wird meist niedriger eingestuft als vorher.\n\nIch bin eigentlich das beste Beispiel, dass das System gut funktioniert. Ich habe mich in der zweiten Woche direkt in der FlexQ einranken lassen. Ich war in der Preseason bis Gold 3 gekommen und wurde nach 3 Siegen und 7(!!!) Niederlagen in Silber 2 eingestuft. Also bin ich 4 Devision gedroppt und bekomme 25 LP pro Sieg und bin schon wieder Silber 1 kurz vor der Promotion. \n\nKeep calm and carry on!\n\n{{sticker:slayer-jinx-wink}}","replies":[{"poster":"Resp0nse","date":"2016-12-15T15:04:52.346+0000","up_votes":1,"down_votes":0,"body":"Das nenn ich mal ne Erklärung. Ich wusste ja das ich droppe, aber S4 habe ich Silber 2 beendet, S5 mit Silber 2 gestartet und jetzt so gedroppt. DAS war mein \"Problem\" sag ich mal. Aber danke für die Erklärung :){{sticker:slayer-pantheon-thumbs}}","replies":[]}]},{"poster":"ΔRC RΔFUNZΞL","date":"2016-12-15T13:30:13.660+0000","up_votes":1,"down_votes":0,"body":"ja rip","replies":[]},{"poster":"ZîraeI","date":"2016-12-15T09:46:49.711+0000","up_votes":1,"down_votes":0,"body":"Also das klingt ziemlich normal für mich. Ich bin auch von Platin 5 aus in Silber 3 gestartet. Entsprechend ist aber auch deine MMR angepasst d.h.: Du steigst sehr schnell wieder auf bis du bei deiner alten Elo angekommen bist.\n\nIn meinem fall heißt das ich Skippe viele Divisionen, kriege extrem viel LP pro win und verliere nur minimale werte bei einem Lose.","replies":[{"poster":"Resp0nse","date":"2016-12-15T09:49:47.604+0000","up_votes":1,"down_votes":0,"body":"Ah ok. So ist das dann geregelt. Danke für die Antwort! :) Viel Glück beim climben.","replies":[]}]}]}