{"poster":"PiKe","date":"2016-03-26T00:24:53.611+0000","title":"BAJA calificacion  para los sup!!","subforum":"Charlas Generales","up_votes":82,"down_votes":13,"body":"ahora, yo no entiendo, esto ya lo puse antes, pero aca tengo una prueba fehaciente. QUE TENGO QUE HACER PARA QUE ME DE UNA S O S+ SIENDO SUP?!?!!?!?\n\nhttp://puu.sh/nU3g3/4a5f0da6e9.jpg\n\nOsea es ilogico lo que plantea el sistema, es muy injusto para los que jugamos de support. La verdad nose bien como funciona, pero me parece que deber&iacute;a haber diferenciaci&oacute;n con respecto por lo menos a la posici&oacute;n de support, osea esta bien te da S+ por uqe saliste 14-5-25 , obvio saliste positivo, pero ponele en una partida rapida, 20- 25 mins, a salis 0-2-10 y te pone B o B+ osea deberia diferenciarse en la posicion que estas, osea si sos suport, no deberias llevarte las kills y deber&iacute;as tener mas assis, deberia contar los wards que pongas, los que sacas, las asistencias. etc.\n\nMe parece muy injusto, que vos a pesar de hacer tu trabajo como suport, y terminas perdiendo , y te manda una C o C+ y por ahi no fediaste, pero saliste que se yo en una partida de 20 -25 mins saliste 0-5-12 , osea para un suport, que pierde la partida no es para ponerte una C, osea vos ves que en esa partida uno que salio 2-5-8 ya le pone una B+ o A- entonces , osea me parece muy injusto que el sistema no te califique por lo que estas haciendo en la partida, y sea general para todos, por que la verdad, osea todo muy lindo, pero siempre parece que jugaste para la mie*, y me da la sensaci&oacute;n de que siempre hago mal las cosas, pero nose , creo que me siento algo discriminado siendo sup.\nOsea somos los mas relegados siempre , los que menos tienen en cuenta, pero somos igualmente necesarios como &uacute;tiles para las partidas, y que siempre te terminen poniendo una mala calificaci&oacute;n , por lo menos a mi me molesta mucho . y parece que nadie le importa, hace cuanto esta el sistema este?, nadie le dio pelota a esto ?\n\nMe parece que deber&iacute;an por lo menos ajustarlo , o decir bien que califica, as&iacute; vamos todos atras de la kill de ultima , sacamos maestria, si es a eso lo que apunta el sistema...\n\nAlgun rioter??","replies":[{"poster":"hombrequearaña","date":"2016-03-26T00:49:24.924+0000","up_votes":13,"down_votes":2,"body":"Lo mas probable es que te falto presencia global en objetivos.\n\nSi rito no tomara en cuenta el rol de soporte no hubiera tenido tantos cambios desde la S2, un buen soporte decide el early game y su adc el late game.\n\nSi el sistema de rito esta mal tarde o temprano se daran cuenta de esto gracias a que en ranked pueden tener datos objetivos de cantidad de gente que tiene S en el rol de soporte.","replies":[{"poster":"PatrickKane","date":"2016-03-26T01:00:27.554+0000","up_votes":4,"down_votes":0,"body":"Yo tengo una partida con soraka donde morí más veces y tuve menos asistencias, sin embargo saque S+. Además el sistema toma en cuenta tus wards, el daño que hiciste a los campeones enemigos, etc.","replies":[{"poster":"Hell Darking","date":"2016-03-26T01:23:10.098+0000","up_votes":2,"down_votes":10,"body":"soy un sup que casi no wardea (ojo que si wardeo los objetivos importantes como drake y baron) asi que si toma en cuenta eso estoy jodido..","replies":[{"poster":"Gastoon11","date":"2016-03-26T01:26:14.809+0000","up_votes":14,"down_votes":0,"body":"todo el tiempo tenes que wardear , dejas todo el mapa negro","replies":[]},{"poster":"Pit Zahat","date":"2016-03-26T19:20:22.607+0000","up_votes":3,"down_votes":0,"body":"No se pk me imagino q es un silver4-5 y usa a morgana/annie supp full AP xDDD","replies":[{"poster":"Akari Kuro","date":"2016-05-03T07:25:04.833+0000","up_votes":1,"down_votes":0,"body":"clarooo, odio cuando ni wards compran","replies":[]}]}]}]},{"poster":"IGNORE ALL","date":"2016-03-26T01:02:17.291+0000","up_votes":4,"down_votes":3,"body":"Le dices que le falto presencia y de 36 kills él estuvo en 29..","replies":[{"poster":"hombrequearaña","date":"2016-03-26T01:23:25.764+0000","up_votes":11,"down_votes":2,"body":"> [{quoted}](name=NoPickees EsoMID,realm=LAS,application-id=v7qsfXsE,discussion-id=hhZ4xJ5f,comment-id=00090001,timestamp=2016-03-26T01:02:17.291+0000)\n>\n> Le dices que le falto presencia y de 36 kills él estuvo en 29..\n\nPresencia en objetivos, no todos son kills y asistencias.\n\nHay: Torres, Dragones, Heraldo, Barones, Wards colocados, Wards enemigos destruidos, tambien podria estar tomando en cuenta en nami la sanacion realizada, despues de todo la formula de calculo de rito es secreta.","replies":[]}]}]},{"poster":"Elemetrixx","date":"2016-03-26T05:41:03.345+0000","up_votes":7,"down_votes":0,"body":"Esto es simplemente MI opinión:\n\nTodos sabemos que el ROL de support es el menos preferido de los jugadores, pero la gran mayoría de quienes prefieren jugar support lo hacen bien. A que quiero llegar a esto? A que por ejemplo la cantidad de jugadores que juegan bien Nami es mucho mayor (proporcionalmente) a los que juegan bien a Zed, entonces, para el sistema S- S S+ seria un rendimiento mucho mas exigente que para un campeon a quien MUCHISIMA gente usa mal, con promedios bajos en KDA, Objetivos, Wards, etc.","replies":[]},{"poster":"Neo Gaussrik","date":"2016-03-27T00:52:08.953+0000","up_votes":10,"down_votes":3,"body":"Hola, Pike!\n\n> [{quoted}](name=PiKe,realm=LAS,application-id=v7qsfXsE,discussion-id=hhZ4xJ5f,comment-id=,timestamp=2016-03-26T00:24:53.611+0000)\n>\n> ahora, yo no entiendo, esto ya lo puse antes, pero aca tengo una prueba fehaciente. QUE TENGO QUE HACER PARA QUE ME DE UNA S O S+ SIENDO SUP?!?!!?!?\n\nEsencialmente, tienes que jugar al campeon de manera de tener, con ese campeon, en esa posicion, uno de los mejores desempeños entre todos los jugadores jugando ese campeon en esa posicion.\n\n> Osea es ilogico lo que plantea el sistema, es muy injusto para los que jugamos de support.\n\nNo realmente, pues solamente estan compitiendo con otros jugadores de soporte.\n\n> osea esta bien te da S+ por uqe saliste 14-5-25 \n\nEl KDA es una metrica inventada por jugadores, y nosotros no la usamos internamente. Te aseguro que el numero de kills no tiene nada que ver! (Yo mismo he sacado S en multiples ocasiones usando a Soraka, Bardo o Sona, y como te podras imaginar, no saque grandes cantidades de asesinatos...)\n\n> Me parece muy injusto, que vos a pesar de hacer tu trabajo como suport, y terminas perdiendo , y te manda una C o C+ y por ahi no fediaste\n\nNotaras que casi todos los jugadores sacan bajos puntajes cuando pierden. Esto es mas o menos lo que esperarias ver de una buena metrica de desempeño; una fuerte correlacion entre buenas calificaciones y exito.\n\nAnimo. Ya vas en A+; te falta muy poco para llegar a S-! Solo queda seguir mejorando un poco mas! :)","replies":[{"poster":"PiKe","date":"2016-03-27T01:30:54.837+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Riot Gaussrik,realm=LAS,application-id=v7qsfXsE,discussion-id=hhZ4xJ5f,comment-id=0043,timestamp=2016-03-27T00:52:08.953+0000)\n>\n> Hola, Pike!\n> \n> Esencialmente, tienes que jugar al campeon de manera de tener, con ese campeon, en esa posicion, uno de los mejores desempeños entre todos los jugadores jugando ese campeon en esa posicion.\n> \n> No realmente, pues solamente estan compitiendo con otros jugadores de soporte.\n> \n> El KDA es una metrica inventada por jugadores, y nosotros no la usamos internamente. Te aseguro que el numero de kills no tiene nada que ver! (Yo mismo he sacado S en multiples ocasiones usando a Soraka, Bardo o Sona, y como te podras imaginar, no saque grandes cantidades de asesinatos...)\n> \n> Notaras que casi todos los jugadores sacan bajos puntajes cuando pierden. Esto es mas o menos lo que esperarias ver de una buena metrica de desempeño; una fuerte correlacion entre buenas calificaciones y exito.\n> \n> Animo. Ya vas en A+; te falta muy poco para llegar a S-! Solo queda seguir mejorando un poco mas! :)\n\nHola Gaussrik ,\n\nCon respecto a esto ,\n>\"Esencialmente, tienes que jugar al campeon de manera de tener, con ese campeon, en esa posicion, uno de los mejores desempeños entre todos los jugadores jugando ese campeon en esa posicion.\"\n\nLa verdad a mi no me interesa que me comparen con los mejores de LAS o NA , osea yo quiero que me califiquen por como jugue en la partida por que obvio, si te comparan los que estan mas alto elo y jugando mucho mas tiempo, obvio que vas a tener menos puntaje, me pareceria doblemente injusto que comparen una performanse de otra persona , para darte la tuya...\n\n>\" El KDA es una metrica inventada por jugadores, y nosotros no la usamos internamente. Te aseguro que el numero de kills no tiene nada que ver! (Yo mismo he sacado S en multiples ocasiones usando a Soraka, Bardo o Sona, y como te podras imaginar, no saque grandes cantidades de asesinatos...)\"\n\nEsto es completamente mentira, si miras mi score, sali 1-2-29  y me da A + tengo un amgio que jugamos recien, salio 5-7-11 y  farmeo 324 minions, y le puso S+ jugando de top...\nSi leiste comentarios del hilo, veras que todos los que salieron con una kill mas que la muerte, a todos les dio S o S+ , entonces , si se fijan las kills, por que la verdad, entre salir 1-2-29 y salir 3-2-29  para un suport da igual, su trabajo es asistir y estar en las kills,  no las kills en si mismas, Por que la discriminación entre uno u otro?? si el trabajo es el mismo.  En ese puinto es en el que siento que falla el sistema, por que obvio, hay champs por ejemplo, la soraka , no realiza daño quizas no te llevas las kills, pero la cantidad de vida que podes curar a todo el team , es 10 mil veces mas grande que eel que puede curar una nami o una janna o una sona, entonces, obviamente si calcula el daño curado, todos los demas champs que no curen como una soraka van a estar por debajo del standard.\n\n> Notaras que casi todos los jugadores sacan bajos puntajes cuando pierden. Esto es mas o menos lo que esperarias ver de una buena metrica de desempeño; una fuerte correlacion entre buenas calificaciones y exito.\n> \n> Animo. Ya vas en A+; te falta muy poco para llegar a S-! Solo queda seguir mejorando un poco mas! :)\n\nBueno y esto ultimo, es obvio que si perdes, te van a bajar el puntaje, a lo que voy es que, ponele que salis en una partida , que perdes de sup , salis 0-5-13 por lo general en este score, te pone de una b- a una c , y no baja de eso.  Por mas que vos hayas echo lo que tenias que hacer muchas veces salen mal las otras lineas y bueno, perdes, pero , de ahi a ponerte una C por ese score?, mmmmmm nose para mi no es justo,  mientras los otros que quizas farmearon 200 minions y salen 1-6-10  les ponen de B- a A-  entonces,  la verdad es muy injusto el sistema para los support, o no maneja bien el trabajo que se hace...\nYo creo que deberian realizar una revisada al sistema, por que en verdad ahora, si no jugas con un premade que saque S,  no te llevas caja o premio, y si seguimos en este plan de bajarle la calificacion al sup por X motivo, en cierto punto me siento discriminado.\n\npor ultimo, estaria bueno saber que es lo que cuenta el sistema  para saber que aspectos debemos tener en cuenta para poder recibir la caja, por que la verdad, esta es una partida que salio de bien a muy bien y  que no me den una S o s-  por esa partida,  y muchas otras que pasan cosas similares, es muy injusto, y la verdad me molesta tener que pensar de ir otra linea para poder ganar cajas..","replies":[{"poster":"Neo Gaussrik","date":"2016-03-27T17:29:53.129+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=PiKe,realm=LAS,application-id=v7qsfXsE,discussion-id=hhZ4xJ5f,comment-id=00430001,timestamp=2016-03-27T01:30:54.837+0000)\n>\n> La verdad a mi no me interesa que me comparen con los mejores de LAS o NA\n\nY, sin embargo, casi todos nuestros mecanismos de clasificacion de habilidad son con respecto a otros. Tu division y liga en clasificatorias depende de cuanto ganas con respecto a otros, tu MMR depende de cuanto ganas con respecto a otros, etc.\n\nEs un juego competitivo! No debiera sorprenderte que se te compara con otros al momento de evaluar que tan bueno eres.\n\n> Esto es completamente mentira, si miras mi score, sali 1-2-29  y me da A + tengo un amgio que jugamos recien, salio 5-7-11 y  farmeo 324 minions, y le puso S+ jugando de top...\n\nCorrelacion no es causalidad. Insisto, he sacado S multiples veces en partidas sin asesinatos y sin labrar subditos.\n\n> En ese puinto es en el que siento que falla el sistema, por que obvio, hay champs por ejemplo, la soraka , no realiza daño quizas no te llevas las kills, pero la cantidad de vida que podes curar a todo el team , es 10 mil veces mas grande que eel que puede curar una nami o una janna o una sona, entonces, obviamente si calcula el daño curado, todos los demas champs que no curen como una soraka van a estar por debajo del standard.\n\n... va a ser realmente necesario que te ponga un screenshot de una S con Soraka para que me creas? ^^;\n\n> Bueno y esto ultimo, es obvio que si perdes, te van a bajar el puntaje\n\nLo tienes al reves. Dado que la manera en la que jugaste llevo a que perdieras, una buena metrica de que tan bien jugaste naturalmente tendera a evaluarte mas bajo.\n\nEn otras palabras, las mismas jugadas que llevaron a la derrota son las que llevaron a un mal puntaje, no es que el juego vea \"Oh, perdio, entonces le bajamos la clasificacion\".\n\n> Yo creo que deberian realizar una revisada al sistema, por que en verdad ahora, si no jugas con un premade que saque S,  no te llevas caja o premio, y si seguimos en este plan de bajarle la calificacion al sup por X motivo, en cierto punto me siento discriminado.\n\nAun a riesgo de ser reiterativo, insisto: se puede sacar S con soporte, y, en efecto, es el rol con el que mas consistentemente logro sacar S (personalmente).\n\n> por ultimo, estaria bueno saber que es lo que cuenta el sistema \n\nNoooooo\n\nSi hicieramos explicitas las metricas que busca el sistema entonces le dariamos las herramientas a los jugadores para explotarla y dedicarse a sacar puntaje en vez de jugar a ganar, lo cual va directamente en contra de nuestro objetivo de hacer de LoL el juego mas entretenido que podamos hacer.\n\nSi bien es posible que cambiemos las metricas a futuro, dudo muchisimo que alguna vez hagamos publicas las metricas del sistema.\n\nEspero poder haber aclarado algunas dudas! Incluso si no estamos de acuerdo con respecto a como se mide el desempeño, espero que al menos se entienda un poco mas el por que lo hacemos asi. Saludos!","replies":[{"poster":"alvi san","date":"2016-03-27T19:59:07.808+0000","up_votes":3,"down_votes":0,"body":"Entiendo la razón del porqué no se pueden mostrar las metricas, pero entonces se vuelve una cuestión de fe si creerte o no. Yo en lo particular considero que es mucho, pero mucho más difícil conseguir una S con soporte que con adc, siendo que yo juego ambas lineas y he obtenido reiteradas veces S en ambas.\n\nPor lo tanto, para dilucidar esto y que no sea algo solo de fe, propongo que muestren datos; por ejemplo, que porcentaje de las S se concentra en top, mid, adc, supp y jungla. Si el sistema es correcto debería estar más o menos equilibrado. \n\nEn resumen no mostrar la tabla de medición pero si los resultados, es decir, evidenciar a través de estadística. Estoy claro que yo podría poner en duda toda la estadística y decir que te inventaste los números, pero al menos yo no lo haré.\n\nSaludos,","replies":[]},{"poster":"Guidomage","date":"2016-03-27T20:31:24.319+0000","up_votes":1,"down_votes":0,"body":"Perdone, señor Riot Gaussrik, pero yo logré un 0/2/25 con Janna y me dieron un A-. ¿Tan buenas son las otras Jannas? Otra duda, ¿con quién se nos compara? ¿Con todo LAS? ¿Gente de nuestra liga? ¿Todo LoL?","replies":[{"poster":"Natchin","date":"2016-03-28T12:58:07.452+0000","up_votes":2,"down_votes":0,"body":"Me interesó tu pregunta así que me puse a investigar tu partida.\n\nPuedo decirte que no compraste ningun pink y pusiste sólo 12 wards normales durante los 36 minutos que duró la partida.\n\nEn contraste con la Morgana del equipo enemigo que puso 41  wards normales en esa misma partida. Es más, pusiste la misma cantidad de wards que Vayne (tu adc) y menos que blitzcrank e irelia, como si fuera poco, todos ellos compraron pinks. Tampoco te compraste la piedra vidente.\n\nEn resumen, y no es por resfregártelo en la cara ni nada, es sólo la explicación de tu calificación, el que no hayas conseguido una S está completamente justificado, ya que un support que no le otorga visión a su equipo no está haciendo un buen trabajo.","replies":[]},{"poster":"Neo Gaussrik","date":"2016-03-28T12:26:40.107+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Guidomage,realm=LAS,application-id=v7qsfXsE,discussion-id=hhZ4xJ5f,comment-id=0043000100000004,timestamp=2016-03-27T20:31:24.319+0000)\n>\n> Perdone, señor Riot Gaussrik, pero yo logré un 0/2/25 con Janna y me dieron un A-. ¿Tan buenas son las otras Jannas? Otra duda, ¿con quién se nos compara? ¿Con todo LAS? ¿Gente de nuestra liga? ¿Todo LoL?\n\nTengo entendido que es con LAS.\n\nTambien, insisto, el KDA es independiente de la clasificacion. :)","replies":[]}]},{"poster":"SpectacledBearer","date":"2016-03-28T10:36:45.153+0000","up_votes":1,"down_votes":0,"body":"> Si hicieramos explicitas las metricas que busca el sistema entonces le dariamos las herramientas a los jugadores para explotarla y dedicarse a sacar puntaje en vez de jugar a ganar, lo cual va directamente en contra de nuestro objetivo de hacer de LoL el juego mas entretenido que podamos hacer.\n\nO sea que estás admitiendo que el sistema es explotable? Se supone que justamente el sistema debería medir que tanto aportas para la victoria del team. Si el sistema es bueno, el 'explotarlo' no terminaría siendo una guía de las cosas más importantes para ganar? O estás admitiendo que el sistema es defectuoso?","replies":[{"poster":"Neo Gaussrik","date":"2016-03-28T12:29:40.454+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SpectacledBearer,realm=LAS,application-id=v7qsfXsE,discussion-id=hhZ4xJ5f,comment-id=0043000100000005,timestamp=2016-03-28T10:36:45.153+0000)\n>\n> O sea que estás admitiendo que el sistema es explotable? Se supone que justamente el sistema debería medir que tanto aportas para la victoria del team. Si el sistema es bueno, el 'explotarlo' no terminaría siendo una guía de las cosas más importantes para ganar? O estás admitiendo que el sistema es defectuoso?\n\nTodo sistema creado por seres humanos es explotable, SpectacledBearer.\n\nSomos muy buenos creando reglas, pero tambien somos muy buenos encontrando falencias en sistemas, y cualquier sistema examinado por suficientes personas durante suficiente tiempo va a mostrar que tiene fallas.\n\nLuego entras en una especie de lucha eterna entre las personas que intentan parchar el sistema y las que buscan explotarlo. En este caso, revelar los detalles del sistema no lograria nada mas que dar herramientas a aquellos jugadores que quieren buscar una manera de explotar el sistema, por lo que no tenemos ninguna intencion de hacerlo!","replies":[{"poster":"iNGENiO","date":"2016-03-28T17:25:18.097+0000","up_votes":1,"down_votes":1,"body":"Buscar formas de explotar el sistema genera que el sistema se corrija y se mas confiable.\n\nQue el sistema sea cerrado indica que puede haber gente explotando el sistema sin que nadie se entere. (la hay siempre la hay).\n \nSi el sistema fuera abierto, generaría mucha mas confianza en los usuarios, y se podrían corregir problemas y todo seria mas transparente.\n\n\"La especie de lucha eterna entre las personas que intentan parchar y los que buscan explotar el sistema\" genera que el sistema sea cada vez mejor, menos vulnerable y de mejor calidad.\nAhora la desinformación de los sistemas cerrados genera bronca e inseguridad a los usuarios.\n\nAhora cuando digo revelar los datos del sistema. no digo que quiero las claves para entrar al código de LOL. Digo que la interacción con los sistemas que utilizamos tiene que ser conocida en detalle por los usuarios. Ejemplo seria decir hay un %0.10 de pase tal cosa, que disminuye un 0.40 si pasa tal otra.  Entonces seria claro y nadie se quejaría de lo que no puede saber. Y también podrían salir a la luz cosas que son injustas y que no se pueden ver si el sistema es cerrado.\n\nRevelar los detalles del sistema, genera confianza en los usuarios. Cosa que no hay ya que todo el mundo duda constantemente de Riot y sus sistemas SECRETOS. MMR, emparejamientos, Sanciones, puntuaciones y porcentajes de que salgan llaves por ejemplo.\n\nQuien compite en un deporte en el cual no conoce las reglas? Pues el sistema de ligas para la gente que juega LOL en forma recreativa y no profesional esta realmente llena de secretos y reglas ocultas.\nTe emparejan en partidas de la manera que Riot se le canta. Tenes un MMR oculto que solo riot sabe como se genera. Tenes una puntuación en las partidas que no sabemos porque es. Cada tanto caen unas llaves, con un porcentaje que es según dicen no lineal y cada vez menos chances de que caigan al mes con un reseteo mensual. \n\nEs una burla estar en un sistema así del que nada se sabe. Ni siquiera sabemos si es un sistema justo. Claramente pienso que no lo es porque no tengo ninguna información y forma de constatarlo.\n\nUna pena.","replies":[{"poster":"Neo Gaussrik","date":"2016-03-28T17:31:52.574+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=iNGENIO 40,realm=LAS,application-id=v7qsfXsE,discussion-id=hhZ4xJ5f,comment-id=004300010000000500000001,timestamp=2016-03-28T17:25:18.097+0000)\n>\n> Que el sistema sea cerrado indica que puede haber gente explotando el sistema sin que nadie se entere. (la hay siempre la hay).\n\nEsto es poco probable debido a la enorme cantidad de tiempo de estudio organizado que tomaria hacer una ingenieria en reverso al sistema.\n \n> Si el sistema fuera abierto, generaría mucha mas confianza en los usuarios, y se podrían corregir problemas y todo seria mas transparente.\n\nEn este caso, nos parece que los costos son mucho mayores al beneficio.\n\n> Es una burla estar en un sistema así del que nada se sabe. Ni siquiera sabemos si es un sistema justo. Claramente pienso que no lo es porque no tengo ninguna información y forma de constatarlo.\n\nNo realmente; es lo mismo que nuestro sistema de emparejamientos, cuyos detalles tampoco vamos a revelar. Puedes evaluar si es justo o no basado en su desempeño, pero no tenemos intencion de dar a conocer los detalles, pues el daño que haria es mayor al beneficio.","replies":[{"poster":"PiKe","date":"2016-03-28T18:25:53.612+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Riot Gaussrik,realm=LAS,application-id=v7qsfXsE,discussion-id=hhZ4xJ5f,comment-id=0043000100000005000000010000,timestamp=2016-03-28T17:31:52.574+0000)\n>\n> Esto es poco probable debido a la enorme cantidad de tiempo de estudio organizado que tomaria hacer una ingenieria en reverso al sistema.\n> \n> En este caso, nos parece que los costos son mucho mayores al beneficio.\n> \n> No realmente; es lo mismo que nuestro sistema de emparejamientos, cuyos detalles tampoco vamos a revelar. Puedes evaluar si es justo o no basado en su desempeño, pero no tenemos intencion de dar a conocer los detalles, pues el daño que haria es mayor al beneficio.\n\nOK viendo que ya no me va a contestar, nose bien el motivo. pero bueno, \n\nReitero,  todo de nuevo...\n\n> [{quoted}](name=PiKe,realm=LAS,application-id=v7qsfXsE,discussion-id=hhZ4xJ5f,comment-id=004300010000000500000000,timestamp=2016-03-28T14:14:22.686+0000)\n>\n> Hola Gaussrik algun comentario para esto? \n> \n> http://boards.las.leagueoflegends.com/es/c/charlas-generales/hhZ4xJ5f-baja-calificacion-para-los-sup?show=flat&comment=0043000100000003\n> \n> \n> Perdon por ser medio molesto, pero necesitaria ver que se puede hacer al respecto, osea veo que no soy el unico con el problema... \n> \n> Como lei  de aca \n> \n> Seria bueno que nos compartas el % de S que tienen los que juegan de suports con respecto a otras lineas , para poder dilusidar, y ver mas en Macro , y ver si es algo general, o es algo mas puntual de algunos casos como el mio..\n> \n> O por lo menos ver algunas estadisticas algo, como para poder ver, nose bien si desde algun lado lo puedo se puede realizar, pero estaria bueno tenerlo, y ver esos datos de alguna manera.\n\nnecesitariamos ver estadisticas, ver si todo lo que pensamos tiene algun sustento, o ver si tenes razon vos, por lo que vemos los Supports que se llevan kills les ponenen S , o terminan en \"positivo\"  segun el \"KDA\"  son los que sacan S, los que no se llevan kills y tienen mas asistencias nunca llegan a la S, si lees alguno de los comentarios y las imagenes que suben, te das cuenta que todos los que sacaron s  es por que se llevaron kills sin importar  todo lo demas....\n\n\nRespondeme por favor a algo :S","replies":[{"poster":"Neo Gaussrik","date":"2016-03-28T19:14:33.279+0000","up_votes":1,"down_votes":0,"body":"^^;\n\nRelajate! Tengo una cantidad limitada de atencion que prestarle a las cosas y las estadisticas que estas pidiendo no las tengo a mano!","replies":[{"poster":"PiKe","date":"2016-03-29T13:26:19.883+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Riot Gaussrik,realm=LAS,application-id=v7qsfXsE,discussion-id=hhZ4xJ5f,comment-id=004300010000000500000001000000010000,timestamp=2016-03-28T19:14:33.279+0000)\n>\n> ^^;\n> \n> Relajate! Tengo una cantidad limitada de atencion que prestarle a las cosas y las estadisticas que estas pidiendo no las tengo a mano!\n\nseguimos esperando T_T","replies":[{"poster":"Neo Gaussrik","date":"2016-03-29T13:53:11.435+0000","up_votes":2,"down_votes":2,"body":"PiKe. :p\n\nMira, existen herramientas de estadisticas internas a Riot. Yo puedo facilmente ver, por ejemplo, cuanto se juega un campeon a lo largo del tiempo o cuanto gana de acuerdo al parche asociado.\n\nLo que me estas pidiendo no esta disponible como una busqueda dentro de nuestras herramientas! Tengo que solicitar la informacion de otros, que pueden estar bastante ocupados, y como te imaginaras esto no va a ser una prioridad para ellos... ^^;\n\nCuando te digo que la distribucion de S es la misma para cada campeon en cada posicion es la misma, es porque los creadores del sistema me dijieron esto, pero para poder corroborarlo con estadisticas hace falta bastante trabajo!","replies":[{"poster":"PiKe","date":"2016-03-29T14:05:56.527+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Riot Gaussrik,realm=LAS,application-id=v7qsfXsE,discussion-id=hhZ4xJ5f,comment-id=00430001000000050000000100000001000000010000,timestamp=2016-03-29T13:53:11.435+0000)\n>\n> PiKe. :p\n> \n> Mira, existen herramientas de estadisticas internas a Riot. Yo puedo facilmente ver, por ejemplo, cuanto se juega un campeon a lo largo del tiempo o cuanto gana de acuerdo al parche asociado.\n> \n> Lo que me estas pidiendo no esta disponible como una busqueda dentro de nuestras herramientas! Tengo que solicitar la informacion de otros, que pueden estar bastante ocupados, y como te imaginaras esto no va a ser una prioridad para ellos... ^^;\n> \n> Cuando te digo que la distribucion de S es la misma para cada campeon en cada posicion es la misma, es porque los creadores del sistema me dijieron esto, pero para poder corroborarlo con estadisticas hace falta bastante trabajo!\n\nEsta perfecto que las estadisticas no dependan de vos, y lo entiendo, pero esto creo que es lo suficientemente importante como para poder tener visibilidad , osea no somos pocos los que tenemos problemas con respecto a estos puntos que te plantie, se que quizas hay otras cosas, pero esto no deja de ser importante, y creo que deberian darle bola, por que si en verdad hay un problema, esta afectando a muchas personas, y no podemos verlo por que no tenemos las estadisticas. y para cuando las tengan, seguramente si es como planteamos, las personas que fueron afectadas,  va a ser un numero mucho mas grande que si se ataca desde el principio.\n\nYo voy a revisar a ver si puedo hacerlo por las riot api ,  y no creo que sea tanto trabajo sacar unas estadisticas sobre posisiones y calificaciones. pero bueno voy a ver que puedo hacer.... por que es algo que se necesita ver, para ver si es que tenemos razon nosotros o no. pero bueno  la idea no es minimizar el problema  sino tratar de resolverlo, nosotros planteamos las posibles fallas por lo menos deberian pegarle una revisada, y no quedarse con que todo es perfecto.  \n\neso es lo que mas me molesta , pero bueno en fin, seguire esperando las estadisticas.","replies":[{"poster":"Neo Gaussrik","date":"2016-03-29T14:10:43.705+0000","up_votes":2,"down_votes":1,"body":"Sin animos de ofender, he visto exactamente 1 jugador que tiene un problema con el sistema de puntajes; lo que he estado escuchando en general es que los jugadores han tenido pocos problemas consiguiendo cofres y que el recurso limitante ahora mismo son las llaves.\n\nNo voy a ignorar tu solicitud solamente porque sea de un jugador en particular, pero al mismo tiempo espero que entiendas si te digo que tambien tengo otras cosas que hacer.","replies":[]}]}]}]}]}]}]}]}]}]}]}]},{"poster":"Tutancadead","date":"2016-03-27T02:18:54.126+0000","up_votes":2,"down_votes":0,"body":"Tengo una queja sobre este \"sitema\" Yo soy main Soraka y estuve pelando estos dias por una S (apenas dos partidas por dia) Solo lograba A+.\n\nSaque velcos cansado de curar gente y vole al rival obtuve mi S-. Tenia \"Kda\" Hermosos 3/0/11. Soy el que mas ward puso, el segundo en daño hizo y estuve en casi todo los objetivos. Sin contar que ganke. Todo esto siendo support. (Partida Stomp)\nEntonces mi dudas es, si con todo esto me pusieron un S-.. que necesitaba para S? Tenia que tener farm también? Soy support no puedo farmear. (Puede que falten cosas no lo dudo)\nComo el sistema se da cuenta cuando es uno Support? o Jungla? Se da cuenta? Diferncia Velocos mid de Vel support?","replies":[{"poster":"PiKe","date":"2016-03-27T03:09:52.469+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Tutancadead,realm=LAS,application-id=v7qsfXsE,discussion-id=hhZ4xJ5f,comment-id=00430002,timestamp=2016-03-27T02:18:54.126+0000)\n>\n> Tengo una queja sobre este \"sitema\" Yo soy main Soraka y estuve pelando estos dias por una S (apenas dos partidas por dia) Solo lograba A+.\n> \n> Saque velcos cansado de curar gente y vole al rival obtuve mi S-. Tenia \"Kda\" Hermosos 3/0/11. Soy el que mas ward puso, el segundo en daño hizo y estuve en casi todo los objetivos. Sin contar que ganke. Todo esto siendo support. (Partida Stomp)\n> Entonces mi dudas es, si con todo esto me pusieron un S-.. que necesitaba para S? Tenia que tener farm también? Soy support no puedo farmear. (Puede que falten cosas no lo dudo)\n> Como el sistema se da cuenta cuando es uno Support? o Jungla? Se da cuenta? Diferncia Velocos mid de Vel support?\n\npara mi esa es una de laa claves . para mi como dije al principio, no esta diferenciado el sup. pero bueno estaria bueno que aclaren las dudas...\n\n\n por otra parte a todos los q sacan s  pueden tirar una imagen del final de la partida similar a como hice yo? asi podemos ver que diferencias hay??","replies":[{"poster":"Tutancadead","date":"2016-03-27T04:59:44.691+0000","up_votes":1,"down_votes":0,"body":"Esto sirve?\nhttp://matchhistory.las.leagueoflegends.com/es/#match-details/LA2/311263441/50877411?tab=overview\nesto es S-\n\nhttp://matchhistory.las.leagueoflegends.com/es/#match-details/LA2/310526816/206897?tab=stats\nEsto es A+\n\nSi me exigen ese nivel.. No nunca voy a sacar S. No tengo siempre Stomps.\n\n\nPD: Yo no publico el nombre de ningun invocado fue Riot.\nPD2: soy el mismo jugador asi que imaginaran que estuve en la misma cantidad de objetivo mas o menos. y con la misma cantidad de ward.","replies":[{"poster":"Nido","date":"2016-03-27T21:03:45.040+0000","up_votes":2,"down_votes":0,"body":"No voy a dejar opiniones, solo datos para que cada quién opine lo que quiera.\n\n--------------------------------Vel'Koz--------------------Soraka---------\n:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::\nDuración----------------22min----------------------32min----------\n:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::\nKDA-----------------------------14---------------------------10.5------------\nKP------------------------------50%-------------------------60%------------\n:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::\nDaño a camp.\t----------14k--------------------------4.1k------------\nDaño infl.-------------------42k-------------------------8.3k------------\n:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::\nDaño curado---------------0-------------------------32.2k-----------\nDaño recib.--------------6.4k------------------------8.8k------------\n:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::\nWards coloc.-------------18---------------------------29--------------\nWards p/min------------0.81-----------------------0.90------------\nWards destr.---------------0-----------------------------0---------------\nWards rosas----------------1-----------------------------1---------------\n:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::\nOro ganado---------------9.1k------------------------8.9k-----------\nOro p/min------------------413-------------------------278------------\nSubditos---------------------29----------------------------3---------------\n\nCualquier error en los datos, avisar y corrijo!","replies":[]}]},{"poster":"alvi san","date":"2016-03-27T20:05:51.390+0000","up_votes":2,"down_votes":0,"body":"Se trata muchas veces de lo peleado que esta la partida y la diferencia entre los niveles de tu equipo versus el otro, por ejemplo, si el sistema interno de riot calcula que tu equipo tiene mayores posibilidades de ganar y sacas un 2/1/13 es distinto a si lo sacas cuando el sistema predice que perderas. No es que el sistema quiera que ganes o pierdas, trata de llegar al 50% pero eso es imposible y muchas veces se ve reflejado en el tiempo de espera, entre mayor sea el tiempo de espera es más probable que los equipos es interna y externamente desbalanceados, es decir en un mismo equipo jugadores con varias divisiones de diferencia sin ser premade y contra un equipo en condicione similares.\n\nEn resumen, importa como jugaste y contra quien jugaste.\n\nPS: Yo he sacado S en ranked con nami de supp, no es comun pero lo he hecho y no precisamente estompeando sino que haciendo bien el papel de supp, pero como he dicho antes, se nota que es más dificil una S con supp que con adc","replies":[]}]},{"poster":"LaReinaPingüino","date":"2016-03-27T03:37:52.405+0000","up_votes":1,"down_votes":0,"body":"En mi caso si no tengo kills, no muero nunca y tengo como alrededor de 15 assist me da S, si tengo una o 2 kills ya me baja a S- (aunque tenga el resto del kda igual que en el caso anterior). Al menos me ha pasado así con {{champion:40}}, {{champion:267}}, {{champion:37}} y {{champion:16}}, no se si sea igual en suports sin sustain o suports tanke.","replies":[{"poster":"Tutancadead","date":"2016-03-27T04:56:39.289+0000","up_votes":1,"down_votes":0,"body":"Osea que el punto es no morir. Gracias.\nPor otro lado Si el punto es no morir esta mal. Mas sobre todo con Soraka.\nPara sacar S Con Soraka tenes que jugar de forma tal que Riot no la considera Sana XD","replies":[{"poster":"LaReinaPingüino","date":"2016-03-27T05:37:20.839+0000","up_votes":1,"down_votes":0,"body":"lol\n\nBueno pero a mi se me hace mas fácil no morir de todas ellas con Jana y Nami, porque tienen harto cc.\n\nY lo que le molesta a Riot de Soraka es que la armen tanke y yo no la armo nunca de tanke.... :'(\n\nNo soy autistaaaaaaaaaaaaaaa {{item:3151}} ","replies":[{"poster":"Tutancadead","date":"2016-03-27T05:40:18.726+0000","up_votes":1,"down_votes":0,"body":"Las dos build de Soraka sun Autistas.\n\nSobre no Morir.. si puede ser a cambio tenes que jugar siempre atrás de los tankes y arriesgarte poco. La verdad eso lo veo como un mal support. XD","replies":[{"poster":"LaReinaPingüino","date":"2016-03-27T05:49:37.562+0000","up_votes":2,"down_votes":0,"body":"Yo no, porque autista es cuando no te arriesgas porque no te involucras en las team fights y no armas jugadas y yo si me arriesgaba, baiteaba (eso es lo mas entretenido de ser suport flan en mi opinión), armaba jugadas con el cc y las activas de {{item:3069}} y {{item:3092}} \n\nsi me venían a matar era facil tirarles una e de soraka, por ejemplo y flashear o usar {{item:3069}} para correr aparentemente sola hacia mi equipo entero que estaba en el arbusto y que terminaba deleteando a los rivales.\n\nHAy distintos tipos de suport, si eres flan no deberías estar absorviendo mucho daño, para eso está el tanke, no significa que no estés suporteando al equipo, sólo lo haces de otra forma.","replies":[{"poster":"Tutancadead","date":"2016-03-27T15:22:29.965+0000","up_votes":2,"down_votes":0,"body":"Yo hago todo menos Baitear (prefiero que baite otro y yo lo curo).\n\nEs autismo en el sentido en la poca interacción que tenes con el enemigo. Osea si usas bien a Soraka Nunca estas en riesgo real (Exepto baitar).\nAunque estas a rango del rival, lo estas cuando el rival no puede alcanzarte por que tus aliados lo bloquean, O puede.. y tu E mas algo item lo anula. No necesitas Tirar Q complicadas solo a un rival que no se puede mover.\n\nEn cambio una Lulu o Nami va a estar en Riesgo real para intentar sacar mas provecho a sus habilidades y armar jugadas, haciendo que la posicion de riesgo saca su mallor potencial. Soraka n., No se beneficia mucho de tomar el riesgo.\nPor otro lado Lulu y Nami tiene que estar mas cociente de la posición de su rival para entrar y tirar skills y hacer buenas jugadas. En cambio una Soraka tiene que estar consciente solo de su team (y apuntar alguna E)\n\nPd: igual es mi opinion.","replies":[]}]}]}]}]}]}]},{"poster":"V for Vice","date":"2016-03-30T17:15:29.484+0000","up_votes":1,"down_votes":0,"body":"Gauss, si hay métricas para el desempeño personal, ¿sería posible que implementaran un sistema, en rankeds, donde si sales con una S o A,  te dé un boost a los LP cuando ganes y una rebaja a los LP cuando pierdas? Y así recompensar a los jugadores que hicieron una buena partida aunque sus compañeros lo hagan perder. Y equivalentemente si sacas una mala calificación ganes menos LP en la victoria y pierdas más en la derrota. Y así penalizar a los feeders y no dejar que suban de liga los carreados.","replies":[]}]},{"poster":"Nombre ofensivo","date":"2016-03-26T00:32:30.930+0000","up_votes":10,"down_votes":3,"body":"no tiene que ver tu nota con el KDA, no se hace con ese numero ya que podría generar hordas de usuarios mejorando el kda solo por skins, el calculo que utiliza riot es secreto y menos mal que sigue así. Yo saco notas S llendo supp, me pongo la partida al hombro y si todo sale bien las saco, aunque no tenga un kda extraordinario, saludos","replies":[]},{"poster":"lastoneyea","date":"2016-03-27T22:05:25.078+0000","up_votes":3,"down_votes":0,"body":"Como va a ser normal que yo saque A y mi ADC S+\n\nhttps://i.gyazo.com/8b1a6146e0d76b5c8e2309d8ce22a5ba.png","replies":[]},{"poster":"MatiLee","date":"2016-03-26T15:25:43.564+0000","up_votes":3,"down_votes":0,"body":"1º NO MORIR\n2º Si el adc fue a base, murio, o fue a otra linea, FARMEAR\n3º Asistir otras lineas.\n\nEso sería lo básico","replies":[]},{"poster":"danye15000","date":"2016-03-26T00:28:16.356+0000","up_votes":1,"down_votes":0,"body":"pues, yo me saque s con sona sup :P (PERO NO TENIA MAESTRIA 5 PUTA BIDA)","replies":[{"poster":"Hayato","date":"2016-03-26T07:20:39.768+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=danye15000,realm=LAS,application-id=v7qsfXsE,discussion-id=hhZ4xJ5f,comment-id=0001,timestamp=2016-03-26T00:28:16.356+0000)\n>\n> pues, yo me saque s con sona sup :P (PERO NO TENIA MAESTRIA 5 PUTA BIDA)\n\nNo importa si tenes o no maestría  5 para obtener el cofre, importa el rango que saques que sea S-, S, S+","replies":[]}]},{"poster":"ViDa AS","date":"2016-03-26T00:28:44.676+0000","up_votes":3,"down_votes":0,"body":"jajaja recien con lux termine 3/3/13 o algo asi y me dio una b+ jajaja","replies":[]},{"poster":"waffen SS","date":"2016-03-28T11:04:12.395+0000","up_votes":2,"down_votes":0,"body":"los unicos q sacan S son los yasuo, los zed, los yi, y en definicion los mismos champ izis y rotos de toda la vida","replies":[]},{"poster":"Sir AZØR","date":"2016-03-27T02:21:08.218+0000","up_votes":2,"down_votes":0,"body":"Pues yo eh sacado muchas veces S con diferentes supports! Saludos lesmart","replies":[]},{"poster":"tarzaneado","date":"2016-03-27T02:13:02.615+0000","up_votes":2,"down_votes":0,"body":"compra un par d pinks, esa es la clave, juegues en la posicion que juegues","replies":[]},{"poster":"Haund","date":"2016-03-27T01:20:50.201+0000","up_votes":2,"down_votes":0,"body":"Yo entendí más o menos como va el sistema, básicamente tenes que participar en 2/3 de los kills del team","replies":[]},{"poster":"SheTwistedMyFate","date":"2016-03-27T00:10:33.527+0000","up_votes":2,"down_votes":0,"body":"que raro XD, yo he jugado con bardo, thresh y poppy supp y me han dado S+ o S :/","replies":[]},{"poster":"Kukaplanero","date":"2016-03-26T23:17:58.143+0000","up_votes":2,"down_votes":0,"body":"He sacado S-, S e incluso S+ yendo de soporte con varios champs, la calificación es distinta para cada campeón, por lo que no sólo es superarse a sí mismo en rendimiento sino también tener un desempeño bueno en comparación a la media de ese personaje","replies":[]}]}