{"poster":"aeristhagoddess","date":"2016-03-31T14:50:03.184+0000","title":"SUCHE DEUTSCHEN CLAN ZUM VERWEILEN!!!!!!!!!!!!!!!!!!!!","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Suche deutschen Clan zum verweilen und in einem Team spielen zu k&ouml;nnen.\r\n\r\nBin Main Toplane Z. Z. Gold.\r\n\r\nAdded mich : FatsoOfAllTrades","replies":[{"poster":"Rushdie","date":"2016-03-31T17:23:57.852+0000","up_votes":1,"down_votes":0,"body":"Was nur 20 Ausrufezeichen ? Um einen richtig guten Clan zu finden brauchst du mindestens 30!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","replies":[]},{"poster":"Ehren Teemo","date":"2016-03-31T16:02:29.800+0000","up_votes":1,"down_votes":0,"body":"hey vielleicht wär das ja was für dich ^^\n\nTrick Deadly Community sucht aktive Spieler für den LoL Bereich!\nWir sind eine gaming Community, welcher neu eröffnet wurde. Und sind nun auf der Suche nach Spielern , welche sich uns in unserem LoL Bereich anschließen möchten.\nTrotz einer gewissen Ernsthaftigkeit beim Spiel steht der Spaß im Vordergrund, was dazu führt, das für Flamer kein Platz bei uns ist. Die Gemeinschaft und das Zusammenspiel, liegt uns in der Community am Herzen.\nWas bieten Wir?\naktive Gemeinschaft.\nfunktionierende Communitystrucktur.\nkompetente und motivierte Führungsebene.\nTipps und Ratschläge von erfahrenen Spielern.\nDie Möglichkeit ein eigenes Ranked Team aufzubauen.\nClaninterne Spiele.\nrespektvoller Umgang miteinander.\nSpieler im Elo Bereich von Silber bis Diamond\nDesweiteren Besitzt unsere Community einen eigenen spielberecih für Heros of The Storm\nFür beide Bereiche steht ein von uns gesponserter Musikbot zur Verfühgung.(24h online)\nDesweiteren bieten wir euch die freiheit, euch eure benötigte Channel selbstständig in Form von Sub-Channel zu gestalten.\n\nWas erwarten Wir?\nMindestalter von 16 Jahren\nregelmäßige Aktivität\nTeam- und Kritikfähigkeit\ngeistige Reife\nEin Funktionierendes Headset\nFalls du Interesse an der Community hast, melde dich einfach direkt bei mir ingame \nTDC Lizart \nOder schau gleich auf unserem ts vorbei IP: TrickyDeadly.voiceserver.me","replies":[]},{"poster":"LastHopeNcO","date":"2016-03-31T14:55:03.131+0000","up_votes":1,"down_votes":0,"body":"Hallo, \n\nUnser Esports Clan breitet sich momentan noch auf League of Legends aus. \nWir suchen noch gute Spieler in der höheren Ligen und oder Fertige Teams.\n\nFalls Interesse von euch besteht einer neuen Community beizutreten und diese Auszubauen würde ich mich freuen wenn ich euch/dir auf unserem Teamspeak begrüßen kann.\n\nSolltest du aber vorab noch mehr Infos haben wollen kannst du dir gerne unseren Forum Post durchlesen und unsere Homepage begutachten.\n\nForum Post: http://boards.euw.leagueoflegends.com/de/c/clans-teams-de/MxigK3A5-tribunal-e-sports-sind-wir-deine-neue-lol-community\n\nTS: 212.224.121.15:5194","replies":[]},{"poster":"Shacoláde","date":"2016-03-31T14:52:12.819+0000","up_votes":1,"down_votes":0,"body":"DAS KANN MAN AUCH KLEIN SCHREIBEN. DANN MEINT MAN AM ANFANG NICHT GLEICH DAS ES WIEDER EIN RAGETHREAD IST.","replies":[]}]}