{"poster":"KaminoX","date":"2017-02-10T23:18:28.455+0000","title":"@ Riot PROJECT// LORE (Any answer that sums this up will suffice)","subforum":"Story, Art, & Sound","embed":{"description":"Uploaded by League of Legends on 2016-08-06.","url":"https://www.youtube.com/watch?v=3vylNCUu4eA&t=53s","image":"https://i.ytimg.com/vi/3vylNCUu4eA/hqdefault.jpg"},"up_votes":2,"down_votes":0,"body":"so we all know the Champions taken and given enhancements through PROJECT:\r\n1. {{champion:157}} \r\n2. {{champion:114}} \r\n3. {{champion:238}} \r\n4. {{champion:236}} \r\n5. {{champion:89}} \r\n6. {{champion:22}} \r\n7. {{champion:55}} \r\n8. {{champion:245}} \r\n9. {{champion:11}} \r\n10. //UNKNOWN//\r\n\r\nNow there is a certain Quote PROJECT: Ashe has towards PROJECT: Yasuo regarding Yone We all know Yone was (supposed) to have been slain by his brother but this particular quote has me curious: &quot;They have your brother, but he is not beyond saving.&quot; what exactly does this mean for Yone?","replies":[{"poster":"Kindlejack","date":"2017-02-11T16:58:06.231+0000","up_votes":8,"down_votes":0,"body":"That line was a nod to the first PROJECT event where a lot of players were convinced that the last silhouette (Yi) was going to be Yone. A set of skins would be a very different way for us to launch a new champion, but I admire player's theorycrafting. So maybe in the PROJECT universe he thought he killed his brother (perhaps indirectly by getting him involved) and Ashe is giving him hope that they can still save him. Hope is one of Ashe's primary themes, and you can see in her PROJECT lines she knows just what to say to motivate her troops.","replies":[{"poster":"KaminoX","date":"2017-02-13T18:55:11.523+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Kindlejack,realm=NA,application-id=6kFXY1kR,discussion-id=uO3AmNQ9,comment-id=0001,timestamp=2017-02-11T16:58:06.231+0000)\n>\n> That line was a nod to the first PROJECT event where a lot of players were convinced that the last silhouette (Yi) was going to be Yone. A set of skins would be a very different way for us to launch a new champion, but I admire player&#x27;s theorycrafting. So maybe in the PROJECT universe he thought he killed his brother (perhaps indirectly by getting him involved) and Ashe is giving him hope that they can still save him. Hope is one of Ashe&#x27;s primary themes, and you can see in her PROJECT lines she knows just what to say to motivate her troops.\n\nI like this comment thank you, I do hope to see a twist and that Yone is alive and rebuilt as a PROJECT as a Yasuo main I'd love to see Yone as a Champion kinda like how Sion and Urgot got \"reborn\".","replies":[{"poster":"Kindlejack","date":"2017-02-18T05:08:31.271+0000","up_votes":2,"down_votes":0,"body":"What do you think of something like a Yone skin for Yasuo? Is that kind of Lore character-swap something you think would make a cool skin or nah?","replies":[{"poster":"Sir Poodle","date":"2017-02-18T05:31:43.334+0000","up_votes":1,"down_votes":0,"body":"I think it would be kind of cool, but a little awkward since, IIRC, Yone has no wind powers.","replies":[{"poster":"Kindlejack","date":"2017-02-18T05:35:29.520+0000","up_votes":3,"down_votes":0,"body":"Yeah, we've experimented with such things but never had results that we're confident in. Completely changing who you're playing but with the same abilities is kinda weird and not really satisfying imo.","replies":[{"poster":"Breaku","date":"2017-02-19T18:33:28.907+0000","up_votes":1,"down_votes":0,"body":"Not for nothing, but I actually think it would be really cool to see a champion launch out of a skinline's universe. \n\n\"PROJECT: Yone\" could be a champion, no?","replies":[]},{"poster":"T8 Speedwagon","date":"2017-02-19T18:06:09.689+0000","up_votes":1,"down_votes":0,"body":"This doesn't mean that a barrell running around the rift and placing explosive gangplanks isn't cool","replies":[]},{"poster":"ABlueQuaker","date":"2017-02-19T16:08:56.594+0000","up_votes":1,"down_votes":0,"body":"You could use Yone as a Mk I for the PROJECT skins which would make the skin line more of a possible future than an alternate reality.","replies":[]},{"poster":"KaminoX","date":"2017-02-18T17:25:41.427+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Kindlejack,realm=NA,application-id=6kFXY1kR,discussion-id=uO3AmNQ9,comment-id=00010000000000000000,timestamp=2017-02-18T05:35:29.520+0000)\n>\n> Yeah, we&#x27;ve experimented with such things but never had results that we&#x27;re confident in. Completely changing who you&#x27;re playing but with the same abilities is kinda weird and not really satisfying imo.\n\nLet me ask you what do you think it'd be like to have both Yasuo and Yone in the League of Legends? I'm not good at trying to word this lol sorry have you guys ever considered both of them one with Wind one without it and I assume Yone would be a Samurai as well but his kit would be somewhat like his brother's just well different i guess in more ways than one, How do you think his kit would look if you had to design it or talk about it?","replies":[{"poster":"EROTIC RAID BOSS","date":"2017-02-18T20:24:49.856+0000","up_votes":1,"down_votes":0,"body":"Out of curiosity why are you so interested in yone?","replies":[{"poster":"KaminoX","date":"2017-02-19T15:49:49.716+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Monado II,realm=NA,application-id=6kFXY1kR,discussion-id=uO3AmNQ9,comment-id=0001000000000000000000020000,timestamp=2017-02-18T20:24:49.856+0000)\n>\n> Out of curiosity why are you so interested in yone?\n\nthe same reason everyone is interested in a persons back story we know so little about Yone and since i'm a Yasuo main I would like to know more about his brother is that bad? I've been playing Yasuo for 3 years and just recently posted about this.","replies":[]}]}]},{"poster":"EROTIC RAID BOSS","date":"2017-02-18T20:22:30.314+0000","up_votes":1,"down_votes":0,"body":"What about doing the ascended that originally had ezreal and sivirs weapons? I think it would be kinda cool to see that and see how you keep their basic silhouettes while giving ez a gazelle head or whatever lol.  \n\nI guess the main issue id see is they'd need voice overs and the interest in those skins is probably pretty niche so you'd wanna do them as 750s or something.  But I always thought it would be cool\n\nI'm sure it's similar with senna, would Lucian players want their one legendary skin to be a different character entirely? \n\n","replies":[]},{"poster":"patmax17","date":"2017-02-18T13:24:58.289+0000","up_votes":1,"down_votes":0,"body":"I'm not a fan of yone, but I've been thinking of genderbender skins for some champs (when it's appropriate). I don't know if you are familiar with Avengers Academy (a mobile app by marvel), but there they had a very successful [Lady Loki ](http://avengers-academy.wikia.com/wiki/Loki?file=Lady_Loki_Unlocked.png) skin (of course this works particularly well for loki since he taking on a female appearance is already canon - they also had lady Thor or example, but that's another character altogether)\n\nIn general, I'd like to see such experiments with skins, of course you would need to chose the right champs and skins, but I trust you <3","replies":[]},{"poster":"Hige","date":"2017-02-18T06:26:31.780+0000","up_votes":1,"down_votes":0,"body":"in the end it would look like some sort of rule 63 yasuo skin ._. not like that would be a bad thing...\n\nEdit: wait... Yone is male?!!?! XD oops","replies":[]}]},{"poster":"nosafterburn","date":"2017-02-19T04:04:55.256+0000","up_votes":1,"down_votes":0,"body":"{{champion:157}} : You've never been to dojo after pork-n-beans night have you?","replies":[]}]},{"poster":"KaminoX","date":"2017-02-18T15:19:15.910+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Kindlejack,realm=NA,application-id=6kFXY1kR,discussion-id=uO3AmNQ9,comment-id=000100000000,timestamp=2017-02-18T05:08:31.271+0000)\n>\n> What do you think of something like a Yone skin for Yasuo? Is that kind of Lore character-swap something you think would make a cool skin or nah?\n\nthat would be amazing but wouldn't it have to be like a Legendary or something considering he'd need different quotes? I'd love to see him as an like \"experimental\" champion and if it doesnt work out get scrapped unless its already been done but a lore swapped skin I've never heard of that and as a Yasuo main I'd love to see it. :)","replies":[]}]}]},{"poster":"KGB watching U","date":"2017-02-18T20:28:33.294+0000","up_votes":1,"down_votes":2,"body":"give irelia a new skin","replies":[]}]},{"poster":"Ebonmaw Dragon","date":"2017-02-10T23:32:53.181+0000","up_votes":4,"down_votes":1,"body":"Do not mix canon lore, with skin lore. Yone WAS killed by Yasuo in the canon lore... however, its possible that the Yone from the PROJECT universe was kidnaped by someone or something like that.","replies":[{"poster":"midnight oil24","date":"2017-02-19T18:11:19.124+0000","up_votes":1,"down_votes":0,"body":"I mean, the game itself is non-canon. It used to be, but now it's just some guys fighting on the rift. So they could do it, I wouldn't have a problem with it.","replies":[]},{"poster":"KaminoX","date":"2017-02-10T23:41:57.370+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=Ebonmaw Dragon,realm=NA,application-id=6kFXY1kR,discussion-id=uO3AmNQ9,comment-id=0000,timestamp=2017-02-10T23:32:53.181+0000)\n>\n> Do not mix canon lore, with skin lore. Yone WAS killed by Yasuo in the canon lore... however, its possible that the Yone from the PROJECT universe was kidnaped by someone or something like that.\n\nno need to get salty im just curious is all","replies":[]}]},{"poster":"boo910","date":"2017-02-18T20:34:42.675+0000","up_votes":1,"down_votes":0,"body":"the best skins are the prototypes you made when releasing champs. make them skin plz!","replies":[]}]}