{"poster":"Metham0rph","date":"2015-08-07T14:57:32.295+0000","title":"Yasuot kritizálók","subforum":"Általános beszélgetés","up_votes":2,"down_votes":2,"body":"Mi&eacute;rt van az hogy {{champion:157}} a főgonosz &eacute;s sokan nerfeln&eacute;k sz&iacute;vesen ? Felkapott karaker &eacute;s sokan j&aacute;tszanak vele ez&eacute;rt el&eacute;gg&eacute; szem előtt van. De egy {{champion:6}} vagy ak&aacute;r {{champion:126}} nem b&aacute;ntsa senki kedv&eacute;t. Pedig ha megn&eacute;zz&uuml;k a p&eacute;ld&aacute;nak felhozott k&eacute;t champet egyik&uuml;k sem egy gyenge champ... Ha {{champion:126}} minden k&ouml;rben, minden ellens&eacute;ges teamben ott lenne, szerintem hirtelen nagyon zavarna mindenkit hogy t&uacute;l erős. t&uacute;l ideges&iacute;tő, nemde ? Nem a favoritom  {{champion:157}}  de szerint &iacute;gy j&oacute; ahogy van.","replies":[{"poster":"CelticDemon","date":"2015-08-07T16:01:46.645+0000","up_votes":3,"down_votes":0,"body":"Természetes, hogy szúrja mindenki szemét, elég 1 statik shiv ahhoz hogy le pentázzon. A q-ja szánalmasan nagy sebzést okoz, a w-je pedig egyszerűen nevetséges, hogy semmi nem megy át rajta a Lux ultin kívül. Ettől függetlenül szerintem egy kis át dolgozással simán lehetne belőle is értelmes karakter, de a jelen állapotában nem nevezném valami skilles karakternek.","replies":[{"poster":"mmateexd","date":"2015-08-07T18:14:19.607+0000","up_votes":1,"down_votes":0,"body":"Statik nem elég neki....nem véletlen hogy Yasuo mid gameben a legerősebb vagyis veszel neki egy {{item:3087}} {{item:3031}} {{item:3153}} és full op vele....de ha veszel egy ap magenek egy {{item:3165}} {{item:3089}} {{item:3285}} akkor a Yasuo szépen 1-2 hitből meg is öli. \nÉrtelem szerűen Yasuot a játék elején kell megölni ahányszor csak lehet és utána már nem ér semmit sem.","replies":[{"poster":"CelticDemon","date":"2015-08-07T19:37:07.889+0000","up_votes":2,"down_votes":0,"body":"A nem ér semmit résszel csak annyi bajom van, hogy 2-3 napja tapasztaltam ennek az ellenkezőjét. Vladimir mideztem Yasuo ellen és hát nem igazán ment neki a dolog, pontos statra nem emlékszem de úgy 0/5-6 körül járhatott, lement botra , persze a botos csapatársam nem is foglalkozott vele, és mivel nem ment hátra nem értem oda időben. Yasuo meg szerezte az első killjét. Ez bőven elég volt neki arra hogy vegyen itemet és a játék további részére felhozza magát 11/10 körüli statra ahonnan is elkezdte carryzni a teljes játékot. Én szerintem elég egy embernek hibáznia és Yasuo onnan megállíthatatlan.","replies":[{"poster":"Razer1912","date":"2015-08-07T23:03:17.232+0000","up_votes":1,"down_votes":0,"body":"Ehez a 11/10 hez megkérdeznék 2 dolgot volt knock up a teamjában?\n2 elkezdetek teamfightolni mert ott simán lehet killeket szerezni","replies":[]}]}]},{"poster":"Mind The Gap","date":"2015-08-08T07:29:40.828+0000","up_votes":1,"down_votes":0,"body":"Yasuo szerinted nem tud átmenni a saját falán? Akkor az már 2 a Lux ultival.(POLYÉN LEVÖL KILENCVEN9)","replies":[]},{"poster":"Razer1912","date":"2015-08-07T16:34:00.196+0000","up_votes":1,"down_votes":0,"body":"\"w-je pedig egyszerűen nevetséges, hogy semmi nem megy át rajta a Lux ultin kívül.\" Nagyon sok minden más átmegy rajta a lux ultihoz hasonlóan.","replies":[{"poster":"CelticDemon","date":"2015-08-07T17:49:30.040+0000","up_votes":1,"down_votes":0,"body":"Lux ultin kívül én eddig semmit nem láttam rajta át menni, pl: egy adc ultiját soha nem láttam keresztül menni a falon. Persze ezzel nem azt mondom, hogy lehetetlen másnak átmenni, de az én személyes tapasztalatom szerint más nem nagyon tud átmenni a rajta.","replies":[{"poster":"CV VelociRapi","date":"2015-08-07T21:13:00.939+0000","up_votes":1,"down_votes":0,"body":"Minden ami lövedék azt az a szél fal megfogja de minden ami lézer alapú mint pl Lux ultija meg Vel'Koz ultija azt nem tudja megfogni ergo keresztül hatol rajta\nDe az az érdekes hogy Azir Q ját megfogja vagyis megállítja de a katonáinak a támadásai azok persze áthatolnak rajta meg ha jól tudom Azir basic attack ja is át tud hatolni mivel nem lövedék típusú","replies":[]},{"poster":"Razer1912","date":"2015-08-07T20:05:33.758+0000","up_votes":1,"down_votes":0,"body":"A xerath Q is átmegy rajta a swain madarak is. Meg azért a 20 sec cd rajta elég nagy vegyük csak figyelembe egy kata Q max 8-9 sec cd az akalijé szintén","replies":[]},{"poster":"AsD The Dreamer","date":"2015-08-07T19:42:24.125+0000","up_votes":1,"down_votes":0,"body":"A Viktor q utáni basic attack átmegy. Meg a Swain q is.","replies":[]}]}]}]},{"poster":"ClashDomi","date":"2015-08-11T05:42:34.157+0000","up_votes":1,"down_votes":0,"body":"Yasuo-t szerintem nem kell nerf-elni!\n1.Igaz nagy a Damage van!\n2.Ha a forgó szelet kitudod kerülni akkor kell lecsapni rá mert nem tud ultizni így!\n3.Kell tudni ellene játszani!{{champion:157}}","replies":[]},{"poster":"Shirodrake","date":"2015-08-07T21:50:54.579+0000","up_votes":1,"down_votes":0,"body":"Ja nem csípem, de leginkább csak a szél falát. Ez is lehet csak azért van, mert leginkább a ranged csampikat favorizálom. (leszámítva 1-2 tankot)\n\nUgyanakkor nem tudom, de ha azt a szélfalat elvennék tőle az túl nagy érvágás lenne a számára.\n\nAz, hogy mobilis, meg nagy a sebzése, szerintem tökre rendben van. \nA tornádók hajigálását sem érzem különösebben veszélyesnek. Rendben, azok, de más hasonló veszélyes spellek tömkelegével van tele a játék.\n\nSzóval nem tudom nem mondom azt hogy nerfelni kéne, de az sem hogy pont jó.  Én inkább mint mondottam egy W átalakítás mellett érvelnék.\n\nHa a szélfal kapna X életerőt lövedékekkel szemben.\n1. Oké szétlövöd, de általában az első lövés a fontos.\n2. A szélhez nem igazán illik, hogy életereje van és sebzőik.\n\nMásik lehetőség, hogy a szélfal nem megsemmisítené, hanem eltérítené a  lövedékeket (Alap támadások és a targetes spellek spellshottá alakulnának) ezután pedig sebzést okozhatna mind szövetségesnek mind pedig ellenfélnek egyaránt.\n\nPersze még ott van a szélfal idejének csökkentése, de szerintem ez is kényes dolog.\n\nX érték felett kb nem igazán hatna meg, de X alatt, meg lehet használhatatlanná tenné a skillt.\n\nTöbb llhetőség is számba jöhet, de nekem az eltérítéses dolog tetszik, még ha jó pár **** ******* ***** helyzetet is teremtene.","replies":[{"poster":"R3wan","date":"2015-08-08T12:29:53.456+0000","up_votes":1,"down_votes":0,"body":"Kezdetnek ki kéne javítani a szél fal azon fura szokását, hogy akkor is véd, ha a támadásra merőlegesen rakják le. Ezt sokszor láttam már. Másik, ami zavar, hogy akkor is véd, ha úgy teszi le, hogy egyébként már túlment a támadás azon a vonalon, ahova a fal kerülni fog. Minimum úgy alakítanám át, hogy akkor legalább szökkenjen hátra egyet és úgy rakja maga elé a falat.","replies":[]}]},{"poster":"YiJaegar","date":"2015-08-08T10:01:29.490+0000","up_votes":1,"down_votes":0,"body":"A legnagyobb baj az vele hogy 2 tárgyal már közel 100% critje van és skilles hősböl átmegy AA huszárba mint amilyen {{champion:11}}  és {{champion:23}}.\n\nSzerintem amit módosítani kellene az a passiv crites része, valahogy úgy hogy a crit sebzése teljes értékű legyen, de a bónusz crit esély 50% legyen ne 100%.\n\nMeg az e-jét átdolgoznám csak oda ugrássá rendes cd-vel és fizikai sebzéssel illetve akire rácsúszik azon a következő alaptámadása/q-ja 100% crit chance legyen.","replies":[{"poster":"Razer1912","date":"2015-08-08T11:58:39.007+0000","up_votes":1,"down_votes":0,"body":"Hát azért a crit chance nem sokat ér AD nélkül.\nMeg úgyebár Yasou ultija nem teszi megölhetetlenné. Csak tank pusztítóvá :D","replies":[]}]},{"poster":"AsD The Dreamer","date":"2015-08-07T15:01:06.878+0000","up_votes":1,"down_votes":0,"body":"Sorry m8 de Yasuot minden második játékban látok. Urgotot normálom szerintem ötször láttam. Jayce se gyakori pick low eloban.","replies":[{"poster":"Metham0rph","date":"2015-08-07T15:03:04.167+0000","up_votes":1,"down_votes":0,"body":"Igazad van, épp emiatt írok, szerinted ha Urg vagy Jayce minden második körben ott lenne, nem szurná hirtelen mindenki oldalát ? :--/ mert személyem szerint Urgot vagy Jayce nem egy low champ főleg ha az ember tud mit kezdeni velük","replies":[{"poster":"AsD The Dreamer","date":"2015-08-07T15:11:08.167+0000","up_votes":1,"down_votes":0,"body":"Dehogy is nem szúrná.\n**VÉLEMÉNY VESZÉLY.**\n\nCsak a yasuohoz kellő skill nem valami sok.\n\nhttp://images.wikia.com/mungyodance/images/3/39/1354237059761.jpg","replies":[{"poster":"CV VelociRapi","date":"2015-08-07T15:17:11.406+0000","up_votes":1,"down_votes":0,"body":"de még is több skill kell hozzá mint egy olyan karakterhez ahol elég csak a fejedet verned a klaviatúrába és máris megöltél mindenkit","replies":[{"poster":"CrissTo","date":"2015-08-07T16:06:47.224+0000","up_votes":1,"down_votes":0,"body":"Ez enyhe utalás {{champion:55}} ? :D xd","replies":[{"poster":"CV VelociRapi","date":"2015-08-07T17:16:41.387+0000","up_votes":1,"down_votes":0,"body":"Ő is egy közülük de még ott van Master Yi, Ryze, Akali, Sona,  még egy szinten Riven is ilyen karakter\nDe Kata Ryze és Master Yi a legsúlyosabb az összes közül ","replies":[{"poster":"CrissTo","date":"2015-08-07T23:13:16.206+0000","up_votes":1,"down_votes":0,"body":"Master yii-t azért nem tartom közéjük, mert annyira vissza lett nerfelve a legeleje Otta, hogy ha valaki semmit nem ért a játékhoz akkor semmit nem ér vele...De igen a többivel egyet értek.","replies":[]}]}]},{"poster":"AsD The Dreamer","date":"2015-08-07T15:22:20.353+0000","up_votes":1,"down_votes":0,"body":"Az igaz.\nDe kevesebb egy Jaycehez vagy egy Urgothoz.","replies":[]}]},{"poster":"Razer1912","date":"2015-08-07T15:49:26.081+0000","up_votes":1,"down_votes":0,"body":"Azért hogy egy teamfight ot megfordíts ahoz kell skill :D\nMellesleg urgothoz Köll skill?! csak annyi hogy elkell találnod az E vel aztán megnyomod a W-t és addig nyomogatod a Q-t amíg a szerencsétlen emberkének az élete el nem párolog.","replies":[{"poster":"AsD The Dreamer","date":"2015-08-07T16:22:38.749+0000","up_votes":1,"down_votes":0,"body":"Ja de Urgot hamar kifogy a manából. Yasuo meg no cost csemp. Csak nem Yasuo main vagy?","replies":[{"poster":"Razer1912","date":"2015-08-07T16:34:58.682+0000","up_votes":1,"down_votes":0,"body":"Ssssss Assasinokkal szeretek játszani általában :D","replies":[{"poster":"AsD The Dreamer","date":"2015-08-07T17:26:43.492+0000","up_votes":1,"down_votes":0,"body":"Tehát a no brain champek.\n\nYasuo, Akali, Katarina, Yi.","replies":[{"poster":"Razer1912","date":"2015-08-07T17:45:10.611+0000","up_votes":1,"down_votes":0,"body":"Ez nem teljesen igaz katázni nem igazán tudok és nem is akarok. Yi zni nem szeretek.\nAhri akali Zed Yasou Lb stb.\nEzek mellet adc-zek és jungleözök is szóval nem csak no brain champek :D","replies":[]}]}]}]}]},{"poster":"Metham0rph","date":"2015-08-07T15:14:31.686+0000","up_votes":1,"down_votes":0,"body":"Köszönöm a hozzászólásod van igazság... de itt mindig megosztott vélemény lesz szerintem, na de \"izlések és pofonok\" {{champion:157}}  jó igy","replies":[]}]}]}]},{"poster":"Tazsam","date":"2015-08-07T21:39:47.984+0000","up_votes":1,"down_votes":0,"body":"Személy szerint soha sem játszom yast de ettől függetlenül buffolnám, legalábbis részben. A kezdő hpja mára már nevetségesen alacsony, és a kitjét is faragták eleget. Visszapörgetném a kezdeti állapotra csak egy dolgon változtatnék, ha hozzáér a falához akkor az megszakad (mindegy, hogy átüt vagy átmegy rajta esetleg a forgószele megy keresztül). Így elvesztené azt az előnyét, hogy tiki takizik a falon keresztül és közben gyakorlatilag sérthetetlen.\nEzzel a változtatással ismét high risk / high win champ lehetne, pont mint amilyennek szánták.\nAz meg, hogy hogy állítod meg jelenleg közel sem annyira bonyolult. Ahogy megszerzi az első 3 killjét (vagy komoly farm előnye van) már rusholsz is a thornmail+ninja tabira. Ha nem elég és mannás vagy akkor frozen heart, ha mana nélküli akkor meg randuin. Ha meg nem hoztatok tankot a meccsre akkor meg is érdemlitek.","replies":[]},{"poster":"CrissTo","date":"2015-08-07T16:07:25.436+0000","up_votes":1,"down_votes":0,"body":"{{champion:126}}  NERF PLS! ...AZ a kis \"champ\" vesz egy {{item:3035}} -t és vége! -.-'","replies":[]},{"poster":"Razer1912","date":"2015-08-07T15:51:47.066+0000","up_votes":1,"down_votes":0,"body":"Yasou azért szúr mindenkinek szemet mert megtudja nyerni a teamfightokat gyerekesen könnyen. De úgyan úgy simán ellehet picsázni lane fázisban ha ügyesebb vagy mint egy yasou.\nMíg urgot sem és jayce sem egy igazán teamfight orientált champ.\nUrgot és jayce is poke-olni van a teamfight elött aztán meg csak ott van hogy sebzést osszon mint egy AD carry\nMax urgotnak ott az engage az ultival jaycenek meg a kalapácsal.","replies":[]},{"poster":"Mind The Gap","date":"2015-08-08T07:28:42.282+0000","up_votes":1,"down_votes":1,"body":"Akinek nincs skillje a karakter ellen, az úgyis nerfeltetni akarja.","replies":[{"poster":"Razer1912","date":"2015-08-08T11:59:33.420+0000","up_votes":1,"down_votes":1,"body":"Jap.\nViszel ellene egy Akali-t és már hello szia nincsen yasouval para :D\nVagy egy Diana-t és level 8-9 után szintén vered.\nVagy egy zed-et ha yolo vagy és szeretsz az outplay el küszködni :D","replies":[]}]}]}