{"poster":"NORBIT1234","date":"2020-02-06T04:50:54.199+0000","title":"AN NOW I HAVE BEEN FUCKING BANNED FOR 14 DAYS WELL FUCK YOU RIOT","subforum":"Miscellaneous","up_votes":2,"down_votes":1,"body":"Im so fuckking pissed off cause being banned for 1 fucking game 14 day ban that is but when i ban people for fucking feeding trolling or afk i see them in the fuckingg next game its so fuckking bullshit every game i then lose i lose 25 or 20 lp and when i win thats a 10 to 15 lp which means i have to win twice so bullshit what more do you want i have been conssistent with my game play and matches and this is what i fucking get well fuck you","replies":[{"poster":"TheDemonEmperor","date":"2020-02-06T07:23:05.087+0000","up_votes":6,"down_votes":1,"body":"You can use this time to read some books and learn life skills. Because boy oh boy. You desperately need it.","replies":[]},{"poster":"Spacewalker","date":"2020-02-06T07:25:38.495+0000","up_votes":2,"down_votes":3,"body":"This is actually true. Despite a team mate afking after dying to illaoi top 3 times before minions spawn, they never cop a punishment. But the minute you call someone an idiot, you've commit unfathomable levels of sin and will be treated like a child with a 14 day ban by riot support. You can literally name your account idiot ffs","replies":[{"poster":"C9 Snocky","date":"2020-02-06T11:43:16.635+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Spacewalker,realm=OCE,application-id=Ntey9fRZ,discussion-id=3y25ZQ0p,comment-id=0001,timestamp=2020-02-06T07:25:38.495+0000)\n>\n> This is actually true. Despite a team mate afking after dying to illaoi top 3 times before minions spawn, they never cop a punishment. But the minute you call someone an idiot, you've commit unfathomable levels of sin and will be treated like a child with a 14 day ban by riot support. You can literally name your account idiot ffs\n\nNobody has ever been temp banned for saying 'idiot' once. Almost nobody is ever even banned for 1 game of flaming, it's usually atleast 2.","replies":[{"poster":"Spacewalker","date":"2020-02-07T05:56:20.948+0000","up_votes":1,"down_votes":3,"body":"fake news bro","replies":[]}]}]},{"poster":"2manysooks","date":"2020-02-09T02:46:25.265+0000","up_votes":1,"down_votes":0,"body":"Unfortunately 14 days means this is your 2nd or 3rd ban in a short amount of time. Meaning your being reported for typing in chat. A report of 3 consecutive games triggers a ban. You know you were abusive so dont try and pretend this is the first time you typed abusive text.\nOnly way to solve this is to mute everyone and not type in chat. You can troll, afk, feed whatever as long as you dont type they have no proof.\nFlawed system and no punishment for people spam reporting everyone.\nSo dont type in chat, and if you cant do that dont play the game if its not fun. Thats all you can do","replies":[]},{"poster":"DarkShade918","date":"2020-02-07T00:58:11.118+0000","up_votes":1,"down_votes":0,"body":"Good, maybe now you'll stop spamming boards (at least for 14 days)","replies":[]}]}