{"poster":"dragon poo","date":"2016-12-26T06:37:08.508+0000","title":"why is rengar still as broken as he was in the asassin update?","subforum":"Gameplay & Strategy","up_votes":2,"down_votes":2,"body":"title.","replies":[{"poster":"Fitzky","date":"2016-12-26T07:13:36.298+0000","up_votes":1,"down_votes":2,"body":"Because the majority of Riot are bronze/silver and don't know what they're doing, their own player base knows more about the game then they do","replies":[{"poster":"Talon12","date":"2016-12-26T08:00:38.992+0000","up_votes":3,"down_votes":0,"body":"Rengar isn't broken by any means, he snowballs well, but if he doesn't snowball or falls behind even he is mediocre at best, he doesn't run in and 1 hit your adc anymore, the only way he can do that now is if the adc is out of position, the cast of his q also elapses 0.725 second making his damage come quite slowly in comparison to old 0.05, he also has no reliable sustain anymore, meaning if he misses his heal window he takes a lot of damage, the CC immunity Valor Carrys mentioned also comes at a sacrifice to well over 50% of rengar's burst damage as well, new rengar isn't just assassinate the same target over and over be fed and unstoppable, he is based on short 3 second windows where he has a large advantage but is extremly vulnerable for the time between those windows, with those windows ranging from 22-8 seconds to 88-55+ second, depending on his availability to ult, jumps and all basic spells, the removal of his 30% bonus total damage nerfed town to only 20% bonus is also extremely large, his ad boost used to feel an impact at 3 stacks, the impact is now near minimal until 5 stacks","replies":[{"poster":"dragon poo","date":"2016-12-26T11:17:05.301+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Talon12,realm=OCE,application-id=FjGAIbRv,discussion-id=JE8Y7TPh,comment-id=00010000,timestamp=2016-12-26T08:00:38.992+0000)\n>\n> Rengar isn&#x27;t broken by any means, he snowballs well, but if he doesn&#x27;t snowball or falls behind even he is mediocre at best, he doesn&#x27;t run in and 1 hit your adc anymore, the only way he can do that now is if the adc is out of position, the cast of his q also elapses 0.725 second making his damage come quite slowly in comparison to old 0.05, he also has no reliable sustain anymore, meaning if he misses his heal window he takes a lot of damage, the CC immunity Valor Carrys mentioned also comes at a sacrifice to well over 50% of rengar&#x27;s burst damage as well, new rengar isn&#x27;t just assassinate the same target over and over be fed and unstoppable, he is based on short 3 second windows where he has a large advantage but is extremly vulnerable for the time between those windows, with those windows ranging from 22-8 seconds to 88-55+ second, depending on his availability to ult, jumps and all basic spells, the removal of his 30% bonus total damage nerfed town to only 20% bonus is also extremely large, his ad boost used to feel an impact at 3 stacks, the impact is now near minimal until 5 stacks\n\nive seern a feeding rengar come in a delete a back line and you are telling me he is mediocore at best, ive seen hime jsut become immune to every cc, he is as mini olaf ult.","replies":[{"poster":"MrPine","date":"2016-12-28T23:51:10.403+0000","up_votes":1,"down_votes":0,"body":"well I can see the problem, where's the front line Tanks protecting the carries? You can't blame an assassin for killing an unprotected adc/apc. It's the only thing they can do lol..","replies":[{"poster":"dragon poo","date":"2016-12-29T04:47:29.284+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=MrPine,realm=OCE,application-id=FjGAIbRv,discussion-id=JE8Y7TPh,comment-id=0001000000000001,timestamp=2016-12-28T23:51:10.403+0000)\n>\n> well I can see the problem, where&#x27;s the front line Tanks protecting the carries? You can&#x27;t blame an assassin for killing an unprotected adc/apc. It&#x27;s the only thing they can do lol..\n\nhow do you peel an assassin that has an olaf ult as a basic ability? it takes less than 1.5 seconds to kill an adc as any assassin, and if the assassin has complete cc invulnerability, then you literally cant peel for the adc/apc. the only peel you can give is a shield if you have face of the mountain or  are a support with a shield. but unless you are tahm kench, there is no way to protect them.","replies":[]}]},{"poster":"Talon12","date":"2016-12-26T13:31:18.653+0000","up_votes":1,"down_votes":0,"body":"If you didn't read i specified how he needed windows to actually do anything.\n\nAnd a rengar going from 0/7 to 2/8 isn't such a big deal, were they full hp? did they have heal OR exhaust? were they lower level? there are so many factors that would have allowed him to kill them the main likely being his window of power, target wasn't full hp and they had no summoner spells/support. New rengar is very strong in his windows of power yes, but mediocre outside of them, maybe you are blind and didn't read, skimming the text doesn't work for this sort of thing.","replies":[]}]},{"poster":"Fitzky","date":"2016-12-27T01:06:25.925+0000","up_votes":1,"down_votes":1,"body":"https://youtu.be/ZkmUS0bm1_M?t=2m10s\n\n","replies":[{"poster":"Talon12","date":"2016-12-27T01:46:31.650+0000","up_votes":1,"down_votes":0,"body":"Jhin was behind anyway, lower level than general level of team and 2/4, that rengar was ahead had 3 complete items and all his stacks, it was also one of rengar's power windows when all his spells are up and jhin was out of position and able for rengar to use empowered ult on him, you all have invalid points, so far all you people have shown as your proof are the windows of power I already talked about and where the rengar is ahead. Please give me actual proof.","replies":[{"poster":"Fitzky","date":"2016-12-27T06:28:54.668+0000","up_votes":1,"down_votes":1,"body":"Even if rengar is way ahead and jhin is way behind there was no room for counterplay other then trying to run away which ultimately just ended in a 0.03 second death which in my opinion is ridiculous. Riot even stated they wanted to remove rengars one-shotting potential altogether but as you can clearly see they failed.","replies":[{"poster":"MrPine","date":"2016-12-28T23:47:13.716+0000","up_votes":1,"down_votes":0,"body":"If someone's behind an entire item or two and a few levels ofcourse a one shot is possible especially if the rengar is ahead a kill or two.. it's not rengars \"broken\" it's the victim not being good enough at reading the situation. Every game is different.","replies":[]}]}]}]}]},{"poster":"SEKAI","date":"2016-12-27T04:06:44.158+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Fitzky,realm=OCE,application-id=FjGAIbRv,discussion-id=JE8Y7TPh,comment-id=0001,timestamp=2016-12-26T07:13:36.298+0000)\n>\n> Because the majority of Riot are bronze/silver and don&#x27;t know what they&#x27;re doing, their own player base knows more about the game then they do\n\nBecause your mechanical skill and game-skill clearly translate to mathematical, statistical and/or simulation analysis skills.\n\nWhat about we flip the argument around and argue within your context: The vast majority of players in LoL are Bronze and Silver too, so why do you say that we know about the game more than they do?\n\nI'm not defending or attacking either side of OP's argument, but I just found your gross generalisations and assumptions to be pretty bad and want to throw my 2 cents on it.","replies":[{"poster":"Fitzky","date":"2016-12-27T06:47:23.955+0000","up_votes":1,"down_votes":2,"body":"Alright first of all, players are in bronze/silver for a reason, if you really think your game knowledge is that of a gold player and your in bronze then obviously your wrong. Games aren't won by raw mechanical skill, knowing when to fight, taking objectives, itemisation etc, are all important factors in winning the game. If your in bronze then clearly you can't do any of that effectively. Now I just saw a Rioter a few days ago comment on a post admitting to being bronze 3 which honestly shocked me, knowing that the decision of which champions/items are going to be nerfed/buffed in the next patch are in the hands of BRONZE players is appalling. Now you said that the majority of LoL players are bronze and silver, yes, you are correct. What I'm referring to is pro/high elo players which I often watch who stream and talk about patch notes and share their opinions. Compared to what I hear from \"community riot talks\" they sound like they know and could balance the game far better then Riot could ever do.\n\nHere's an idea Riot, fire your Balance Team, and get LS, Scarra etc to balance the game for you.","replies":[{"poster":"SEKAI","date":"2016-12-27T06:55:40.886+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Fitzky,realm=OCE,application-id=FjGAIbRv,discussion-id=JE8Y7TPh,comment-id=000100010000,timestamp=2016-12-27T06:47:23.955+0000)\n>\n> Alright first of all, players are in bronze/silver for a reason, \n\nIn the case of Riot: They have work to do and not have time playing games 8hr a day to climb their ranks. The system is designed to throw obstacles at you by teaming you with lower MMR people whenever you're winning too much or during promo, do you think they have got the time and energy to do their work AND playing the game to high ELO or even pro level? Are you serious?\n\nAlso, the skills required to perform good at the game has very little to do with the skills required to design and/or balance good at the game. You're literally comparing apples to oranges.\n\n> [{quoted}](name=Fitzky,realm=OCE,application-id=FjGAIbRv,discussion-id=JE8Y7TPh,comment-id=000100010000,timestamp=2016-12-27T06:47:23.955+0000)\n> Here&#x27;s an idea Riot, fire your Balance Team, and get LS, Scarra etc to balance the game for you.\n\nNo. Wanna know why? Because there is an inevitable conflict of interest.\n\nPros wants to win the game to earn their bucks. Developers wants to make the game and balance it.\n\nWhen you have not just players, but players who survive by playing the game and min-maxing the shit out of it, to balance the said game. You've got issues, or at least a very high potential of it. And with that in mind, do you still want to risk the game's future on that?\n\nJust like how movie critics, no matter how professional or how cultured they are, don't simply equate to them being good directors at all; being professional players doesn't mean they will be good developers or balancers. Those 2 are completely different topics and subjects.\n\nThat said, pros CAN be A PART OF the balance team, that's okay, but to say having only pros balancing the game is a ludicrous suggestion.","replies":[{"poster":"Fitzky","date":"2016-12-27T12:38:09.892+0000","up_votes":1,"down_votes":1,"body":"With the many changes that we have seen over past patches (Syndra getting true damage, Lee Sin receiving useless nerfs, The RENGAR rework) it's clear Riot need a new balance team. Even if they don't have the time on their hands to actually play the game and climb the ladder, for a company that has worked on a game for over 10 years how are they still not able to properly balance out their game? When they test things out such as Camille doing 900 true damage in one Q and letting it go through to live servers only to say later \"Camille seems to be doing more then we expected\", its pretty awful of them. It honestly makes me question whether the people there actually know what they're doing? Like when they come up with an idea like that do they share it around with say, 10-20 other people? Does everyone agree \"yep that seems balanced lets go through with that\" then a week later \"oh dear Camille is broken just like the majority of new champs we release looks like we'll have to nerf her damn didn't see that coming\". \n\nI remember a little while ago when I was playing CSGO when the new R8 revolver was released, the weapon was so broken that the whole community complained and you know what Valve did? They apologised and rebalanced the weapon. They knew they fucked up, they knew they made a mistake, and they fixed the problem. Back to Riot and we have a champion called Lee Sin who has an attack speed boost, true sight, 2 dashes, a shield, lifesteal/spellvamp, a slow and a 600 dmg ultimate which Riot think that nerfing will completely balance the champion. Who was the monkey 5 years ago that came up with this champ? Who thought this was a good idea? In truth, out of all the gaming companies I've seen, Riot has to be the most clueless and least intelligent bunch of people. I often wonder how many positive surveys they get back about champion design/balance, I'd really like to see a number one day because I can bet you the majority won't agree League is balanced, it hasn't been for a long time, heck, the game was more balanced back in s1-2 when the game was loaded with game breaking bugs. Riot need to actually communicate what is going through their heads when they look at what to balance because it looks pretty clear that they buff/nerf the wrong champions in the wrong ways (Please justify giving syndra TRUE DAMAGE). Please justify why true damage is even A THING, another broken aspect of the game that doesn't even need to exist. There's so much in the game that needs proper balancing you could go through the entire champion list A-Z and every single champion would need a tweak in some way. You might as well release a patch with an entire \"overhaul\" of Leagues champions at this point. \n\nRiot have already redeemed themselves with upgrading their client and integrating replays, but maybe it's time they actually pay a little bit more attention to what's going on behind the scenes.","replies":[{"poster":"SEKAI","date":"2016-12-27T15:36:53.963+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Fitzky,realm=OCE,application-id=FjGAIbRv,discussion-id=JE8Y7TPh,comment-id=00010001000000000000,timestamp=2016-12-27T12:38:09.892+0000)\n>[stuff]\n\nI will agree only on 2 things where Riot is seriously fking up:\n\n1. Favourtism - Favouring certain champs over another, favouring 1 tactic over another and locking strategic diversity themselves, demanding ADCs to be center of the game's balance and that they have to appear in every match... etc.\n2. Not listening to player feedback - PBE is now entirely for show as no matter how much players are against an idea on PBE they will still do it completely unchanged, even there are instances where individual Rioters come out questioning and semi-opposing the idea but they still go with it anyway.\n\nBUT\n\nOutside of that, I don't agree (used to though, but that's for another time). S1 and S2 weren't more balanced, it was chaotic and broken as hell where literally a team of bruisers would just eat any and everybody like breakfast and it was also around the time when that unfathomably broken ass AP Yi made his debut, and when Lee became a thing. There was a reason why Riot made that crap-shoot S3 where they nerfed anything remotely tanky beyond the ground and buffed the living hell out of ADCs and assassins, because of the issues we faced in S2, and it's just be Riot trying to joggle between tanky vs damage and risk vs reward afterward for the seasons onwards.\n\nOutside of the problems I listed above, and ignore all the favoured top 30-ish champs and toss the meta out of the window, the game is actually pretty balanced for the very most part. Sure many balance decision sucked (whenever CertainlyT wants to rework champions, or the fact he made Thresh), but any others were actually pretty alright, and a few more were legit good (such as most of the recent reworks for instance). \n\nSo no, I don't agree that Riot is full of monkeys which you believe. I merely believe that Riot has been divided into 2 factions where one are legit thinking about the future of the game and treating the game fair, while the other seem to be consist of the individuals that contribute to the more negative aspects of the game. And this is trouble, sure, but not in the way you make it out to be.","replies":[]}]}]}]}]}]},{"poster":"Cakemeisting","date":"2016-12-27T04:31:03.032+0000","up_votes":1,"down_votes":0,"body":"I ban him every time.","replies":[]},{"poster":"ZoesNutSock","date":"2016-12-26T11:20:47.883+0000","up_votes":1,"down_votes":0,"body":"Because He Is Broken{{champion:107}} Wait is he?\n","replies":[]},{"poster":"Valor Carrys","date":"2016-12-26T07:03:50.500+0000","up_votes":1,"down_votes":1,"body":"Because Rito balancing thinks that Rengar needs to be CC immune.","replies":[]}]}