{"poster":"souledgealpha","date":"2015-04-05T21:37:11.207+0000","title":"Unfaires Ranglistensystem","subforum":"Ligen & gewertete Spiele","up_votes":2,"down_votes":1,"body":"So\n\nIch bin jetzt an dem Punkt angelangt, wo ich mir ernsthaft &uuml;berlege mit LoL auzuh&ouml;ren.\nEs ist einfach nur frustrierend. Ich wurde diese Season in Silber 4 eingestuft und hab mich dann in den letzten Monaten auf Silber 1 hochgek&auml;mpft. Vor einer Woche hat allerdings eine Loosingstreak (13 der letzten 17 spiele verloren) begonnen und so bin ich jetzt wieder in Silber 3 mit 3 P&uuml;nktchen. Also drauf und dran wieder in Silber 4 abzusteigen.\nIch finde es unm&ouml;glich, dass so etwas passieren kann. Man hat einfach keinen Schutz vor dem Abstieg, aber f&uuml;r den Aufstieg muss man erst ewig LP sammeln und dann auch noch die Promo machen.\nSo bin ich jetzt nach monatelangem Spielen (~200 Games) wieder fast genau da, wo ich am Anfang der Season war... innerhalb einer Woche!!\n\nich will mich jetzt gar nicht &uuml;ber Feeder, AFKs usw. aufregen (insgesamt haben Gegnerteams die ja genauso, ich hatte jetzt eben Pech und in kurzer Zeit sehr viele in meinen Teams) aber ich finde man sollte da die Spieler deutlich besser vor dem Abstieg sch&uuml;tzen (z.B. eine Art Relegation oder \"Abstiegs-Promo\").\nIch meine, weit &uuml;ber 100 Spielstunden, einfach f&uuml;r die Katz, nur weil man in einigen, insgesamt relativ wenigen Games Pech hatte. Sorry, aber da werde ich mich wohl um andere Spiele umsehen, die nicht so unendlich frustrierend sind.","replies":[{"poster":"MeMyselfandBaal","date":"2015-04-05T22:47:50.868+0000","up_votes":2,"down_votes":0,"body":"Wenn du in einer 3W und 17 L Serie weiter spielst... machst du genau an der Stelle den entscheidenden Fehler. Wenn ich so eine Serie habe, mache ich erst mal komplett eine Pause... und dann spiele ich erst mal nen paar Normals...\n\nWenn du schon leicht angefressen in das Spiel gehst, musst du dich nicht wundern, dass dann auch nichts funktioniert. Ich spiele mittlerweile nur noch Ranked, wenn ich mich richtig gut fühle und Bock drauf habe. \n\nUnd dass es keinen Schutz vor Abstiegen gibt, stimmt so auch nicht... jedes Mal, wenn du mit 0 LP ein Spiel verloren hast und deswegen nicht sofort wieder abgestiegen bist (sondern de facto 0 LP verloren hast), hat genau dieser Schutz gegriffen. Und ja, das kommt vor... genau so wie anti-Läufe vorkommen... mach mal 2 Wochen ne Ranked-)Pause, dann geht das vorbei...","replies":[]},{"poster":"UL AimLike","date":"2015-04-05T21:48:06.293+0000","up_votes":2,"down_votes":5,"body":"Es ist so einfach aus Bronze, Silber, Gold zu kommen wenn man spielen kann. Ja du bist sicherlich der jenige der immer Trolls kriegt. Such erstmal deine eigenen Fehler.","replies":[{"poster":"nızzy","date":"2015-04-05T22:24:58.352+0000","up_votes":2,"down_votes":0,"body":"Find ich ist ein bisschen hart ausgedrückt aber im endeffekt hat er ja recht.","replies":[]},{"poster":"souledgealpha","date":"2015-04-05T22:35:04.274+0000","up_votes":1,"down_votes":0,"body":"Nein, ist es nicht, wenn man kein Spieler auf Dia Niveau ist.\n Und hast du meine Text eigentlich gelesen? Ich hab ja geschrieben, dass die jeder mal hat, bei mir nur zufällig in diesen paar Spielen eben relativ viele. Ich beschwer mich jetzt darüber, dass man durch diese Pech, dass jeder mal hat, so schnell so weit absteigen kann...","replies":[{"poster":"Meme Liker","date":"2015-04-06T06:35:22.636+0000","up_votes":2,"down_votes":1,"body":"doch ist es, ganz einfach du kannst dagegen nicht argumentieren weil er Recht hat und du nur versuchst die Schuld auf die anderen zu schieben.","replies":[]},{"poster":"Veezey","date":"2015-04-06T13:52:38.912+0000","up_votes":1,"down_votes":0,"body":"Doch es ist wirklich einfach aus Bronze rauszukommen. \nSicher hat hat jeder Mal einen schlechten Tag. Man sollte dann einfach mal eine Auszeit vom Ranked nehmen, wenn es nicht so gut läuft.","replies":[]}]}]},{"poster":"Veezey","date":"2015-04-05T21:56:37.405+0000","up_votes":2,"down_votes":1,"body":"Wenn du deine Divison nicht halten kannst, dann bist du eben noch nicht gut genug.","replies":[{"poster":"souledgealpha","date":"2015-04-05T22:31:28.418+0000","up_votes":1,"down_votes":0,"body":"Naja ich war in Season 4 immerhin schon in der Gold-Promo. Außerdem verliere ich meine Lane nur relativ selten...","replies":[{"poster":"Veezey","date":"2015-04-06T13:42:59.518+0000","up_votes":1,"down_votes":0,"body":"Die Lane ist aber nicht alles. Du musst also noch iwo anders Defizite haben.","replies":[]}]}]},{"poster":"i had fun once","date":"2015-04-06T12:02:42.450+0000","up_votes":1,"down_votes":0,"body":"Ich hör immer direkt mit Rankeds auf, wenn ich 3 Spieler am Stück verliere. Man kommt sonst zu schnell in einen tilt Modus und setzt sich selbst unter Druck, weil \".. man ja jetzt gewinnen muss!!1\"\nArams zum abkühlen oder auch ein ganz anderes Game. Oder rausgehen.\n\nViele Spiele werden eben durch die Moral oder den Kampfgeist verloren und gewonnen.","replies":[]},{"poster":"Meme Liker","date":"2015-04-06T06:34:39.205+0000","up_votes":1,"down_votes":0,"body":"du bist einfach nicht gut genug um aus silber rauszukommen ? Ich hab in dia 5 ne 60 % winrate und verliere mehr punkte als ich gewinne","replies":[]},{"poster":"Riraga","date":"2015-04-06T01:26:59.989+0000","up_votes":2,"down_votes":2,"body":"L2P","replies":[]},{"poster":"KingKääääs","date":"2015-04-06T01:27:56.752+0000","up_votes":1,"down_votes":3,"body":"Ja bitte hör auf mit League of Legends ein oder zwei scrubs weniger würden diesem spiel sehr gut kommen hinzu kommt das du wahrscheinlich einfach nur toxic bist und dich niemand mag.","replies":[]}]}