{"poster":"XxChrissi04Xx","date":"2016-11-19T08:07:13.529+0000","title":"Permaban","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":25,"body":"Ich w&uuml;rde gerne mein Account wieder bekommen ich habe dort sehr viel Geld reingestopft.\r\nIch wei&szlig; ich habe geflamt und das habe ich oft genug bereut.\r\nEs tut mir so leid ich m&ouml;chte mein acc wieder haben geht das noch weil ich,schw&ouml;re wenn ich noch mal flame k&ouml;nnt ihr mich Ip bannen.\r\nBitte es w&auml;re so wichtig ich habe so viel Zeit reingesteckt : (  ( \r\nOder ich w&auml;re schon der gl&uuml;cklichste Mensch wenn es auf 3Monate oder so w&auml;r bitte Ich liebe dieses Spiel und ohne kann ich nicht : (!\r\n{{champion:157}}                   {{champion:84}}            {{champion:5}} \r\nLvl6                                       Lvl6                                    lvl6","replies":[{"poster":"Antiqui","date":"2016-11-19T08:48:52.263+0000","up_votes":19,"down_votes":0,"body":"Ich wähle in deiner Umfrage Option Nummer 3: Nein, Perma heißt Perma","replies":[{"poster":"Dermel","date":"2016-11-19T12:00:09.707+0000","up_votes":5,"down_votes":0,"body":"Die beiden Optionen, die er gibt, zeigen ja schon, dass er sich nicht ändern wird... wähle auch 3","replies":[]},{"poster":"LegendaryXenon","date":"2016-11-19T13:50:23.405+0000","up_votes":1,"down_votes":0,"body":"Auch 3","replies":[{"poster":"Sidooon","date":"2016-11-19T15:36:32.232+0000","up_votes":1,"down_votes":0,"body":"Bin dabei","replies":[]}]},{"poster":"Wernicke","date":"2016-11-19T10:08:19.540+0000","up_votes":1,"down_votes":0,"body":"Schließe mich dieser Wahloption an!","replies":[]}]},{"poster":"MeMyselfandBaal","date":"2016-11-20T15:33:56.116+0000","up_votes":10,"down_votes":0,"body":"freut ihr euch eigentlich auch immer, wenn ihr bei Abstimmung die Wahl zwischen \"Ja sicher\" und \"prinzipiell schon\" habt? Ich denke mir dann immer: So müssen die Wahlzettel meiner Eltern in der DDR auch ausgesehen haben: Willst du direkt für die SED stimmen oder indirekt?","replies":[]},{"poster":"Humpelstilzche","date":"2016-11-19T08:39:05.164+0000","up_votes":7,"down_votes":0,"body":"Sorry dass ich keine besseren Nachrichten für dich habe, aber: Nein. \n\nPermabans die für Toxicity ausprochen wurden, werden NIE aufgehoben. Es gibt keine Ausnahmen. \nEs ist egal wieviel Geld du ausgegeben hast. Und, so erfreulich es auch ist, dass du dein Verhalten bereust, es ist auch egal wie Leid es dir tut. Permanent gesperrte Accounts sind für immer weg. Je früher du dich mit dieser Tatsache anfreundest, desto besser. \n\nDeine Reue kommt schlicht und einfach zu spät. Du wurdest ausdrücklich gewarnt, vermutlich sogar mehrfach. Zusätzlich wurde dir klipp und klar gesagt, dass weiteres Fehlverhalten zum Perma führt und dennoch hast du weitergemacht. Du hattest deine Chance und hast sie versiebt, jetzt ist es zu spät. Der Gedanke dass du bei einem Perma alles verlierst und welche Folgen das für dich hat...diesen Gedanken hättest du dir machen sollen, bevor es zu spät war. \n\nEs steht dir natürlich frei einen neuen Account zu machen (und nein, das Zeug von deinem alten Account lässt sich natürlich nicht übertragen) und allen (vor allem dir selbst)  zu beweisen, dass du kein schlechter Mensch bist und dich bessern kannst. Deinen Account bring dir das aber nicht zurück, sorry. Der ist ein für alle mal verloren.","replies":[]},{"poster":"Arzog93","date":"2016-11-19T08:19:58.434+0000","up_votes":7,"down_votes":0,"body":"jedes mal wenn so ein beitrag geschrieben wird sollten die anderen einen euro bekommen dann wär das ganze forum reich^^","replies":[]},{"poster":"TerrorRaven","date":"2016-11-19T08:10:57.332+0000","up_votes":5,"down_votes":0,"body":"Nein. Permabann wegen Flamen werden nicht aufgehoben oder verkürzt. Es ist auch egal, wie viel Geld du ihn deinen Account investiert hast.","replies":[]},{"poster":"Vanity21","date":"2016-11-19T08:59:29.794+0000","up_votes":3,"down_votes":27,"body":"JA ACCOUNT ZURÜCK. Perma banns sind unnötig wenn jemand flamet mutet ihn doch einfach... dafür ist es doch da. außerdem werden viele reported weil sie provoziert wurden  oder einfach nur einen schlechten tag hatten und die Wut rauslassten... ist doch nicht schlimm. Also bitte Rito entfernt diese perma banns und macht einfach nur banns über ne gewisse zeit. Das reicht doch :)","replies":[{"poster":"SorisDynasty","date":"2016-11-19T09:08:24.655+0000","up_votes":8,"down_votes":0,"body":"Flamen ist unnötiger als Permabans. Es ist ein Spiel. D.h. es ist dafür da, Spaß zu haben. Wenn nun jemand ankommt und mich währenddessen ständig beleidigt, wird dieser Spaß eingeschränkt. Und eine Mute-Funktion ist kein Freifahrtsschein fürs Flamen.\n\nGanz simpel: Wer sich nicht an die Regeln, denen er zugestimmt hat, hält, muss mit den Konsequenzen leben. Und Flaming ist 100% nicht erwünscht.","replies":[{"poster":"gamerman3000","date":"2016-11-19T10:27:42.170+0000","up_votes":1,"down_votes":2,"body":"Ich geb dir Recht, aber es gibt ja auch Ranked Games, die dann dafür da sind sich zu verbessern. Und dann gibt es halt Leute die cilmben wollen weil sie später vielleicht Proplayer werden wollen. Das ist für mich dann wiederrum nichtmehr 'nur zum Spaß'","replies":[{"poster":"LegendaryXenon","date":"2016-11-19T13:56:13.840+0000","up_votes":3,"down_votes":0,"body":"Wer Proplayer werden will und in seiner Elo an casuals scheitert, der wird kein Pro.\n\nDavon ab brauchen richtige Pros ein mindset, das auf sich selbst fokussiert ist, gerade in der soloq","replies":[]},{"poster":"eingew","date":"2016-11-19T10:46:13.892+0000","up_votes":2,"down_votes":0,"body":"Das ist richtig, dann aber durch Flame die Motivation des Teams zu sabotieren... ist eigentlich noch schlimmer.","replies":[]}]}]},{"poster":"Sirrkas","date":"2016-11-19T09:10:16.623+0000","up_votes":8,"down_votes":0,"body":">JA ACCOUNT ZURÜCK. Perma banns sind unnötig wenn jemand flamet mutet ihn doch einfach... dafür ist es doch da. \n\nDie Option jemanden zu muten, ist dafür da, dass man zukünftigen Flame nicht mehr ertragen muss. Wenn es aber so weit ist, dass man jemanden muten möchte, hat der schon die Spielatmosphäre zerstört. Die Option jemanden stumm zu schalten, ist keine Ausrede dafür, Flamen zu dürfen. \n\n>außerdem werden viele reported weil sie provoziert wurden oder einfach nur einen schlechten tag hatten und die Wut rauslassten... ist doch nicht schlimm. \n\nWer sich in einem Spiel nicht benehmen kann, sollte sich erst einmal über die mangelnde Selbstbeherrschung kümmern. \n\n>Also bitte Rito entfernt diese perma banns und macht einfach nur banns über ne gewisse zeit. Das reicht doch :)\n\nDie Banns erfüllen das Kriterium doch schon. Sie halten ja nur ein paar Jahrhunderte^^","replies":[{"poster":"Shakês Beer","date":"2016-11-19T15:03:44.676+0000","up_votes":1,"down_votes":5,"body":"***","replies":[{"poster":"Sidooon","date":"2016-11-19T15:36:08.094+0000","up_votes":4,"down_votes":0,"body":"Erstens hat diese Krankheiten generell nciht nru was mit Beleidigungen zu tun\nZweitens erst recht nicht das mann solche schreibt, der jenige spricht dann und schreibt nicht\nDRittens wenn man weiß man hat solch eine Krankheit einfach seine Chatfunktion abstellen","replies":[{"poster":"Shakês Beer","date":"2016-11-19T15:45:24.068+0000","up_votes":1,"down_votes":6,"body":"***","replies":[{"poster":"Antiqui","date":"2016-11-19T21:35:57.756+0000","up_votes":3,"down_votes":0,"body":"Klugscheißmodus: Die Figur Sheldon Cooper ist offiziell in der Serie kein Autist oder hat Sonstige ICD Klassifizierte Verhaltenskrankeheiten [ (SIC) :\" Wir haben das zweimal prüfen lassen\"], andererseits wird Sheldon so dargestellt das er womöglich am \"Asperger Syndrom\" leidet, nicht am Autismus (auch wenn der übergang fliessend ist)","replies":[]},{"poster":"eingew","date":"2016-11-19T16:31:46.620+0000","up_votes":3,"down_votes":1,"body":"> -Fehlendes Einfühlungsvermögung\n\nWenn man schon ein Problem damit hat, Menschen nicht als Objekte wahrzunehmen, wieso lässt man sich dann von Objekten provozieren? Ich raste ja auch nicht aus, nur weil mich eine Wespe sticht oder vor mir her fliegt... Mangelnde Selbstbeherrschung zu disziplinieren ist ja kein Hexenwerk.\n\nNiemand verlangt in einem Leaguematch Bindung oder Einfühlsvermögen. Wenn man nicht in der Lage ist, seine Mitmenschen einzuschätzen, dann ist ein Schuss ins Blaue nicht gerade eine gute Lösung bei Verbündeten.\n\n> -Zerstörtes Selbstbewusstsein da viele Autisten gemobbt werden, da sie anders sind - Sheldon Cooper ist hierbei wirklich ein Gottgleichen vorzeige Objekt, auch wenn die Rolle nur gespielt wird.\n\nGerade das Abkapseln sollte hier doch recht gut funktionieren:\n\n> Schreib mal wie man seine Chatfunktion KOMPLETT abstellt.\n\nSelbstbetrug. Vielleicht reicht für einige schon ein \"/mute all\" vor jedem Spiel. Andere schieben vielleicht lieber den Chat aus dem Bild. Oder man legt auf seine Entertaste ein Makro, wodurch man instant nochmal Enter drückt, sodass man nichts in den Chat schreiben kann.\n\nDas einzige was ein Problem sein kann ist Überemotionalität. Aber auch das kann man einfach dadurch beheben, indem man nichts schreibt.","replies":[]}]}]},{"poster":"eingew","date":"2016-11-19T16:33:54.612+0000","up_votes":3,"down_votes":0,"body":"Tourette äußert sich nur in geringer Anzahl der Fälle im zwanghaften äußern von Schimpfwörtern. Es fällt mir sehr schwer, mir vorzustellen, dass einer von denen aufgrund eines Zwangs ein ganzes Wort oder gar ganze Sätze in den Chat eintippt. Das sind kurze Impulse, die etwa so lange dauern, wie man braucht, um das Wort auszusprechen... in derselben Zeit das zu schreiben dauert länger... und ist ein ganz anderer Impuls. Es fällt mir schwer, das als Begründung für permanent schlechtes Verhalten ingame zu sehen.\n\nAutisten sind nur in vereinzelten Fällen besonders aggressiv und es ist bisher unklar, ob die Aggressionen überhaupt mit dem Autismus zu tun haben (man sollte also normalerweise durchaus etwas dagegen tun können).\n\nSchizophrenie wird nicht umsonst gerade in extremen Fällen bevorzugt stationär behandelt. Ich würde in dem Fall einfach empfehlen, nur in eingeweihten Premadegruppen zu spielen. Ich denke es gibt auch diverse Clans, die da mit sich reden lassen würden. Abgesehen davon ist diese Krankheit ja in vielen Fällen durch eine Behandlung eher temporär.","replies":[]}]}]},{"poster":"Wernicke","date":"2016-11-19T10:09:47.651+0000","up_votes":4,"down_votes":0,"body":"> ...wenn jemand flamet mutet ihn doch einfach... dafür ist es doch da....\n\nNur weil eine solche Option vorhanden ist, heißt das nicht, dass das ein Freifahrtschein zum flamen ist und nicht bestraft werden sollte. Eigentl ganz einfach oder?","replies":[{"poster":"Vanity21","date":"2017-08-04T12:11:31.293+0000","up_votes":1,"down_votes":0,"body":"ich sage ja nicht das das ein \"Freifahrschein\" ist dennoch kann man ihn muten und ihn ignorieren und \"Bestrafen\" aber halt kein Permabann.","replies":[]}]}]},{"poster":"0 DMG LUL ","date":"2016-11-19T18:38:20.986+0000","up_votes":2,"down_votes":0,"body":"Eine Frage an den Verfasser dieses Threads : WARUM SCHREIBST DU DEIN FLAME IN DEN CHAT?! man kann ohne Konsequenzen hinter bzw .vor  dem Bildschirm\nden Gegner beleidigen , verfluchen , was auch immer , aber warum damit in den (/all)-Chat ? {{sticker:zombie-brand-facepalm}} \nJEDER hat Games wo er sich mal vergisst oder einfach einen schlechten Tag hat, ABER dass lasst man doch NICHT an den Mates im Game aus.. \nNaja ,vielleicht hast du ja was aus den Konsequenzen gelernt. Sieh dein Ban doch mal positiv: du kannst von vorne anfangen und mit gutem Beispiel vorangehen. Ich meine den selben Fehler kann man ja nicht zweimal begehen (oder doch ? ) .\n{{sticker:slayer-jinx-wink}}","replies":[]},{"poster":"Mythology","date":"2016-11-19T14:30:16.853+0000","up_votes":2,"down_votes":0,"body":"Finde auch dass du deinen Account nicht zurück bekommen solltest. Du verstößt mit deinem Verhalten gegen den Summoner Code, und andere Spieler spielen möglicherweise schlechter, wenn du sie beleidigst. \nHättest du dir vorher überlegen sollen anstatt jetzt im Forum zu schreiben.","replies":[]},{"poster":"Shakês Beer","date":"2016-11-19T14:54:44.493+0000","up_votes":1,"down_votes":6,"body":"Eig. solltest du dein Geld relativ leicht wiederbekommen, wenn du noch nicht Volljährig bist können deine Eltern einfach sagen, dass sie dir nie erlaubt oder gar verboten haben Geld für LoL auszugeben wodurch alle Abgeschlossenen Rechtsgeschäfte sofort unwirksam sind.\n\n//Edit: Der richtige Begriff wäre NICHTIG nicht Unwirksam. ","replies":[{"poster":"Sidooon","date":"2016-11-19T15:32:35.395+0000","up_votes":2,"down_votes":1,"body":"Da sist falsch, bitte informiere dich vorher.","replies":[{"poster":"Shakês Beer","date":"2016-11-19T15:46:07.466+0000","up_votes":1,"down_votes":4,"body":"***","replies":[{"poster":"Sirrkas","date":"2016-11-19T18:16:17.671+0000","up_votes":2,"down_votes":1,"body":"Kennst du den Taschengeldparagraphen? Der gestattet Minderjährigen, mit ihrem Geld mehr oder weniger, frei zu verfügen. \n\nSicher, man könnte versuchen damit zu argumentieren, dass er das Geld der Eltern nicht hätte ausgeben sollen. Ich glaube aber nicht, dass er alles auf einmal ausgegeben hat um damit RP zu kaufen. Das werden eher viele kleinere Beträge über einen längeren Zeitraum gewesen sein und wenn den Eltern das angeblich nicht aufgefallen ist, dürfte es recht schwer werden, damit Erfolg zu haben.","replies":[{"poster":"Shakês Beer","date":"2016-11-19T18:55:12.467+0000","up_votes":1,"down_votes":3,"body":"***","replies":[{"poster":"RAG Ryve","date":"2016-11-19T19:02:40.764+0000","up_votes":2,"down_votes":2,"body":"Sorry aber bitte schmeiß nicht mit solchen Sachen um dich. Glaubst du wirklich ein Milliardenunternehmen wie Riot hat in seinen AGB´s nicht alles, wirklich alles, abgeklärt damit es nicht möglich ist mit sowas zu kommen wie \"Mein Kind ist minderjährig, ich will mein Geld zurück\"?  Dann bitte Versuch das, ich bin mir sicher das Geld wirst du niemals sehen. Zumal kein Anwalt den Normalsterbliche sich leisten können bei uns Riot je wegen irgendwas anklagen würde.","replies":[{"poster":"Shakês Beer","date":"2016-11-19T19:12:03.776+0000","up_votes":2,"down_votes":5,"body":"***","replies":[{"poster":"RAG Ryve","date":"2016-11-19T19:13:49.939+0000","up_votes":2,"down_votes":3,"body":"Indem Sie dieser Vereinbarung zustimmen, erklären Sie, dass Sie eine volljährige Person sind, welche nach an ihrem Wohnsitz geltenden Recht voll geschäftsfähig ist und somit einen rechtsgültigen Vertrag abschließen darf. Sie dürfen Ihren minderjährigen Kindern, für die Sie die Elternschaft oder die Vormundschaft besitzen, erlauben, das Spiel über Ihr Spielkonto zu spielen, jedoch nur, wenn Sie die volle Verantwortung für das Verhalten der Kinder, die das Spiekonto benutzen, übernehmen.\n\nAus den AGB´s. \nHier noch ein bisschen was.\n\nSie stimmen zu, dass Sie für das Konto über keine Eigentumsansprüche oder Urheberrechte verfügen.\n\n\n\nSIE STIMMEN ZU, DASS ALLE ANFALLENDEN GEBÜHREN UND ANDERE KOSTEN FÜR GEBÜHRENPFLICHTIGE DIENSTLEISTUNGEN (EINSCHLIEßLICH, JEDOCH NICHT BESCHRÄNKT AUF RIOT-PUNKTE (WIE UNTEN DEFINIERT)) IM VORAUS ZU BEZAHLEN SIND UND NICHT GANZ ODER TEILWEISE ZURÜCKERSTATTET WERDEN KÖNNEN. SIE HAFTEN FÜR ALLE GEBÜHREN, DIE DURCH IHR SPIELKONTO ENTSTEHEN, INKLUSIVE ALLER GEBÜHREN, DIE OHNE IHRE ZUSTIMMUNG ENTSTANDEN SIND.\n\n\nDiesen Dingen hat jeder der LoL spielt zugestimmt, wir haben an diesen Acc keinerlei Ansprüche, garnichts. ","replies":[{"poster":"Shakês Beer","date":"2016-11-19T19:26:55.151+0000","up_votes":2,"down_votes":3,"body":"***","replies":[{"poster":"RAG Ryve","date":"2016-11-19T19:42:56.656+0000","up_votes":2,"down_votes":3,"body":"Du bezweifelst jetzt wirklich das die AGB´s gegen Gesetze verstoßen oder unzulässig sind? Ich würde jetzt einfach mal raten das an solchen AGB´s wie von Riot, Blizzard, usw die besten Anwälte gearbeitet haben die man sich derzeit leisten konnte in diesem Fachgebiet. \n\nTut mir leid aber auf eine Diskussion ob Riot unzulässige AGB´s benutzt lasse ich mich nicht ein, in Amerika müssen Firmen die Mikrowellen herstellen und verkaufen darauf vermerken das man keine Haustiere reingeben darf und du glaubst in einem Land wo man alles wegen allem verklagt machen die offensichtliche Fehler in Ihren AGB´s wodurch sie verklagt werden können? Bezweifle ich aber viel Spaß wenn du Leuten hier weiterhin Hoffnung machen willst das diese Ihr Geld zurückbekommen nach einer Rechteabtretung, welche durchaus zulässig ist, sowas unterschreiben Leute bei allem möglichen Blödsinn.","replies":[{"poster":"Shakês Beer","date":"2016-11-19T19:44:21.701+0000","up_votes":2,"down_votes":2,"body":"***","replies":[{"poster":"Maíko","date":"2016-11-21T14:10:26.832+0000","up_votes":1,"down_votes":1,"body":"Es gibt 2 Punkte die dagegensprechen, einfach das Geld zurück zu bekommen:\n\nZum ersten würde Riot jegliche Anfrage ignorieren, bis eine offizielle Klage eingereicht wird.\nUnd dann kommt es zum Gerichtsstreit der bei weitem teurer ausfällt, als man an Geld zurück bekommen würde.\n\nUnd ja, Riot würde rechtlich dagegen vorgehen...unter anderem für so etwas haben sie eine eigene Rechtsabteilung.\n\nZweitens müsste der Kunde natürlich nachweisen können, wann und wie viel Geld er investiert hat.\nEbenfalls muss der Kunde beweisen können, dass nicht die Eltern sondern wirklich das Kind diese Einkäufe getätigt hat.\nDenn die Beweislast liegt beim Kunden und solange sie nicht alles auf den Tisch legen können haben sie keine Chance den Rechtsstreit zu gewinnen.","replies":[]}]},{"poster":"Anislkr","date":"2016-11-20T17:44:02.879+0000","up_votes":1,"down_votes":1,"body":"Die AGB sind in solchem Fällen völlig irrelevant. Die Vorschriften des Minderjährigenrechts finden immer Anwendung. Geht man davon aus, dass es sich um einen Minderjährigen handelt und dieser die RP nicht in Rahmen des §110 BGB gekauft hat, ist der Vetrag schwebend unwirksam (§108 I BGB). Verweigern die Eltern die Zustimmung ist der Vertrag ex tunc nichtig, also kann das Geld zurückverlangt werden (Theoretisch im Gegenzug für die Skins).\n \nDas dies laut AGB nicht möglich ist, ist nicht weiter hinderlich, da ein Großteil der Rechte eines Verbrauchers, insbesondere das Minderjährigenrecht, nicht eingeschränkt werden dürfen. Die AGB sind an dieser Stelle selbstverständlich trotzdem gut durchdacht, nur eben auf andere Fälle von Forderungen bezogen. Auch die besten Anwälte können geltendes Recht nunmal nicht durch AGB umgehen.\n\nDas so etwas möglich ist und auch mit einer solch einfachen Begründung zeigt sich bei den klassichen Handyrechnung Fällen, in denen Kinder für mehrere hundert oder tausend Euro Premium Leistungen in Spielen erkaufen. Hier gibt es einige Fälle, die vor Gericht gekommen sind und die bestätigen, dass solche Verträge stets nichtig sind.\n\nProblematisch ist allerdings, wenn die RP auf lange Zeit und ggf. auch in kleinen Beträgen gekauft wurden. Hier ist es um einiges schwieriger, wie bei der Handy-/Telefonrechnung zu argumentieren. In solchen Fällen sollte man sich immer im Wege der außergerichtlichen Einigung an Riot wenden; die Möglichkeit wird in den AGB sogar beschrieben.\n\nUnhinderlich ist nebenbei ein falsch angegebens Alter, die in den AGB erklärte Zustimmung der Eltern oder sonstige Rechteabtretungen. Ich finde es an dieser Stelle relativ amüsant, dass du dich so oft auf die AGB berufst, aber die Einordnung dieser ins juristische Gesamtbild so stark verfehlst. In welchem Rahmen solche AGB gelten ist Erstsemsterstoff im Jurastudium und relativ leicht herauszufinden. Abgesehen davon sollte einem das natürliche Rechtsgefühl doch sagen, dass ein Unternehmen, welches auf eine Alterverifizierung verzichtet das Risiko an Geschäften mit Minderjährigen trägt. Und das ein Unternehmen einen Minderjährigen Verbraucher sicherlich nicht in seinen Rechten einschränken kann.","replies":[]}]}]}]}]}]},{"poster":"Sirrkas","date":"2016-11-19T19:00:30.658+0000","up_votes":3,"down_votes":2,"body":"Wie man sieht, stehen die Chancen also sehr schlecht, damit argumentieren zu können. Nachträglich verbieten ist etwas schwer. Einmal abgesehen davon, wissen wir noch nicht einmal, ob er überhaupt Minderjährig ist und wenn er das ist und auch nur einen Nebenjob wie Zeitungsaustragen hat, war es das wohl auch schon, mit der Argumentation.","replies":[{"poster":"Shakês Beer","date":"2016-11-19T19:03:31.874+0000","up_votes":2,"down_votes":4,"body":"Seine Chancen stehen GUT.\nWenn er einen Nebenjob hat dann eher schlecht weil, dann gelten da andere Rechte welche die Rechte seiner Eltern einschränken,  aber alles im allem hab ich mir bei meinem Post schon was gedacht.\n\nAber es ist nicht unwahrscheinlich, dass er minderhährig ist.\nWelcher Erwachsene verhält sich so? ","replies":[{"poster":"Sirrkas","date":"2016-11-19T19:14:05.516+0000","up_votes":2,"down_votes":1,"body":">Seine Chancen stehen GUT.\n\nDas Problem ist, wir können beide schlecht darüber urteilen. Das würde ein Richter klären müssen.","replies":[]}]}]}]}]}]}]}]},{"poster":"Escitalopram","date":"2016-11-19T08:39:07.727+0000","up_votes":2,"down_votes":1,"body":"Ein Flamer weniger. ","replies":[]},{"poster":"Atsùra","date":"2016-11-19T18:09:24.939+0000","up_votes":1,"down_votes":0,"body":"Sorry, aber du hast viel zu spät bereut und das einzige, WAS du bereust, ist dein zum Fenster rausgeschmissenes Geld. Woran du im Endeffekt auch selber Schuld bist. Niemand mag Flamer, also lerne dich zu beherrschen oder spiele ein anderes Spiel. Das dein Account weg ist, ist ganz gut.","replies":[]},{"poster":"Queen Noth","date":"2016-11-19T11:58:05.305+0000","up_votes":1,"down_votes":0,"body":"Wieder ein \"Bann weg!\", Heul Thread *gähn*\n\nKönnen die Flamer etwas origineller werden mal?\nSo \"Total zu unrecht!\", \"Ich nur ein bisschen in 80 Chatzeilen beleidigt!\", oder drohende Klage an Riot.... das ist doch spannend. \nSo der richtige Unterhaltung für den Abend, besser als RTL\n\n{{sticker:slayer-pantheon-popcorn}}","replies":[]}]}