{"poster":"P0wwer","date":"2019-12-02T04:07:29.930+0000","title":"DRAGON ANCESTRAL ESTUPIDAMENTE ROTO","subforum":"Charlas Generales","up_votes":2,"down_votes":7,"body":"Me parece una reverendisima estupidez que ahora el drake ancestral te da una pasiva que te deletea cuando tenes menos del 20% de la vida. Entiendo que quieran forzar el tiempo de duración de los games para que sea mas dinámico y se castigue de una manera mas severa los errores al ser un juego competitivo. Pero tener una pasiva que te deletea cuando estas en late game me parece algo estúpidamente injusto. Se olvidaron de las habilidades individuales, de lo complicado que a veces resultar remontar un game o lo difícil que es farmear cuando tenes presión de kill y buildearte para intentar carrear el game. Todo esto para que una pasiva te mate cuando tenes 20% de la vida.","replies":[{"poster":"DIBUJE PICHICHI","date":"2019-12-02T04:24:11.259+0000","up_votes":4,"down_votes":0,"body":"Que tan malo podes ser para no terminar los games antes de la aparicion del dragon ancestral xd","replies":[{"poster":"SpringZero00","date":"2020-01-13T08:09:33.893+0000","up_votes":1,"down_votes":0,"body":"Si hiciste objetivos y la partida se alarga más de 36 minutos que es cuando aparece el Drake ancestral, entonces es porque estás perdiendo tiempo al pedo o buscando kills. La partida la podés cerrar tranquilamente en menos de 25 minutos (que ya es demasiado).","replies":[]},{"poster":"ManucioElSucio","date":"2019-12-02T15:04:44.445+0000","up_votes":1,"down_votes":0,"body":"La verdad que si man jugué como 25 o mas partidas ya y en ninguna llegue a ver al ancestral","replies":[{"poster":"I souls destroy","date":"2020-01-13T04:35:43.702+0000","up_votes":1,"down_votes":0,"body":"El dragon ancestral se obtiene cuando tienes 4 dragones asesinados \n\n{{sticker:slayer-jinx-catface}}","replies":[]},{"poster":"Tamer 01","date":"2019-12-02T16:08:50.788+0000","up_votes":1,"down_votes":0,"body":"me pasa lo mismo es casi imposible llegar a ver al ancestral","replies":[]}]},{"poster":"OwenS","date":"2019-12-02T13:31:16.949+0000","up_votes":1,"down_votes":0,"body":"Por ahora solo pude jugar 2 partidas con ese dragon y ni siquiera se le ve el efecto de las alas o el soplido cuando se activa la pasiva del buffo >:(\n\nEncima que es raro que un game llegue a tal momento y me desilucióno.","replies":[{"poster":"ManucioElSucio","date":"2019-12-02T15:04:16.978+0000","up_votes":1,"down_votes":0,"body":"Me jodes que no se ve la animación, alta estafa man, igual seguro es por las tostadoras pero igual loco alta estafa","replies":[]}]}]},{"poster":"diabetín","date":"2019-12-02T08:08:32.479+0000","up_votes":2,"down_votes":0,"body":"de 20 partidas solo en 1 llegué a ver un dragon ancestral, sinceramente tardan mucho en salir","replies":[]},{"poster":"VenganceZ","date":"2019-12-02T04:32:39.767+0000","up_votes":2,"down_votes":0,"body":"Es sencillo, el dragón anciano es una r de pyke maestría 7 full pentakills. El que lo tiene gana automáticamente la partida ahr. Está muy fuerte, me ha pasado que el equipo que consigue el dragón anciano hace que el otro team se rinda automáticamente de lo roto que está (y el ruido que hace cuando sale el espíritu del dragón da orgasmos auditivos)","replies":[]},{"poster":"VenganceZ","date":"2019-12-02T04:35:56.956+0000","up_votes":1,"down_votes":3,"body":"Eu, una partida debería definirse en los primeros 15 minutos de la partida y el equipo que va perdiendo tendría que rendirse para no perder el tiempo. Es gracioso como la gente en este servidor no se rinde, creyendo que una partida que está súper perdida se puede dar vuelta. Partidas en las que van 5 a 25 con las torres de tier 1 tiradas, 3 drakes en contra y un heraldo. Osea, flaco, todo bien, pero está perdida, rendite y a la próxima.","replies":[{"poster":"WhiteMax","date":"2019-12-02T09:50:46.225+0000","up_votes":2,"down_votes":0,"body":"Eso solo pasa cuando el equipo tiene puros feeders. Si la estuvieron peleando durante toda la partida aun queda chance de la tipica TF donde los que van ganando no se juntan y/o lo arruinan y mueren todos, tardan 50 seg en revivir y da tiempo a romperles nexo.","replies":[]},{"poster":"Sweet Carrot","date":"2019-12-02T04:59:57.432+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=VenganceZ,realm=LAS,application-id=v7qsfXsE,discussion-id=0GhIhV1d,comment-id=0002,timestamp=2019-12-02T04:35:56.956+0000)\n>\n> Eu, una partida debería definirse en los primeros 15 minutos de la partida y el equipo que va perdiendo tendría que rendirse para no perder el tiempo. Es gracioso como la gente en este servidor no se rinde, creyendo que una partida que está súper perdida se puede dar vuelta. Partidas en las que van 5 a 25 con las torres de tier 1 tiradas, 3 drakes en contra y un heraldo. Osea, flaco, todo bien, pero está perdida, rendite y a la próxima.\n\nNo todas las partidas se definen al min 15, el caso especifico que das obviamente deberian rendirse, pero si la diferencia no es tan grande o la diferencia que existe solo es en 1 linea no necesariamente esta perdida.","replies":[]}]},{"poster":"WhiteMax","date":"2019-12-02T09:52:05.579+0000","up_votes":2,"down_votes":1,"body":"A ver si tu tienes 1000 de vida y tienen el drag, imaginate que ahora tienes 800 de vida mientras les dure el drag. No es tan dificil.{{sticker:zombie-brand-clap}}\n\nEl hecho de que le den tanta relevancia al dragon esta para que se jueguen mas team fight (que es lo que gusta ver en el competitivo) en vez de jugar a lo teemo, escondiendose en arbustos para ir matando uno por uno.","replies":[]},{"poster":"SpringZero00","date":"2020-01-13T08:05:17.312+0000","up_votes":1,"down_votes":0,"body":"Cual sería la diferencia para vos entré que deletee el buffo del Drake o una Zoe AP??","replies":[]},{"poster":"I souls destroy","date":"2020-01-13T04:34:49.051+0000","up_votes":1,"down_votes":0,"body":"El dragon ancestral se obtiene cuando tienes 4 dragones asesinados {{sticker:slayer-jinx-catface}}","replies":[]},{"poster":"Carmat","date":"2019-12-02T18:30:18.440+0000","up_votes":1,"down_votes":0,"body":"Este dragon ancestral me gusta , porque si llegamos hasta esa instancias es que la partida está en su climax y ya se debe de terminar.Por ejemplo justo ayer me toco una partida después de mucho tiempo que duro mucho,estábamos entre la espada y la pared , el enemigo se hace el drag ancestral, nosotros sabíamos que podíamos perder en TF , pero nuestro support cazó a dos descuidados tuvimos ventaja numérica y entramos casi hasta el nexo enemigo , quedando las cosas iguales, luego de nuevo salio el drag ancestral , sabíamos que tenia de ser nuestro , hicimos un intercambio baron por ancestral, sabíamos que teníamos ventaja en TF y no lo desaprovecharíamos como el otro team, nos juntamos en mid y forzamos la TF ... GANAMOS por el buff del drag lo supimos aprovechar mas que el otro team y Ganamos :D .\n\nTotalmente satisfecho con estos cambios a los drag especialmente al ancestral , premia a los team mas coordinados y te permite cerra una partida siempre y cuando el team sepa hacerlo.","replies":[]},{"poster":"ManucioElSucio","date":"2019-12-02T15:06:42.437+0000","up_votes":1,"down_votes":0,"body":"Capo el drake sale muuuuuy en lategame, por eso mismo lo crearon, no es que sea injusto, es para que se termine la partida de una vez porque ya la alargaron demasiado. Es simple la mecánica no se de que te quejas.","replies":[]},{"poster":"Fransoi ","date":"2019-12-02T14:43:36.936+0000","up_votes":1,"down_votes":0,"body":"la realidad es que sacaron el ancestral para eso que marqué el final de la partida literal","replies":[]}]}