{"poster":"astenar","date":"2018-06-26T16:17:17.379+0000","title":"Chiedevamo un gioco bilanciato?","subforum":"Discussioni generali","up_votes":12,"down_votes":0,"body":"quello che sta accadendo in questi giorni &egrave; la conseguenza delle richieste eccessive di bilanciamento, quello che stiamo provando non &egrave; la conseguenza di troppa forza di alcuni campioni ma, al contrario, la totale perdita di una stella polare:il senso di smarrimento\r\nVOLEVAMO UN GIOCO BILANCIATO?!?!?\r\necco il gioco bilanciato (citazione a kenrhen,spero di averlo scritto bene).\r\nLa possibilit&agrave; del tutto che avviene in questi giorni nella landa degli evocatori &egrave; appunto un perfetto bilanciamento di campioni e ruoli. \r\ninfatti ad eccezione di 2/3 champ troppo forti({{champion:39}} {{champion:8}} {{champion:163}} ...) e di una classe che sta predominando(ma neanche troppo) sulle altre i bruiser, ora tutto &egrave; possibile.\r\nbruiser in corsia superiore, inferiore e ogni tanto anche mid,\r\nil funneling mid corsia un tempo pensata come fondamentale e fulcro di apertura di ogni partita viene data ad un support che(nella composizione di funneling) segue un carry({{champion:145}} {{champion:11}} {{champion:30}} ...) e devolve tutta la partita a farlo scalare molto velocemente \r\ne udite udite &egrave; crollato il pilastro fondamentale che reggeva LoL da diversi anni: gli ADC.\r\nQuesto ruolo privilegiato dalla riot e mai troppo toccato a causa della paura di uno sbilanciamento,che ha reso sempre pi&ugrave; forte e centrale questo  ruolo nel tempo, &egrave; stato spodestato.\r\nquesto vuol dire che &egrave; diventato ingiocabile il ruolo di tiratore? no, &egrave; stato solamente spostato, o temporalmente o fisicamente.\r\nfisicamente: in altre corsie, con il ruolo di funneling con {{champion:145}} {{champion:236}} , o semplicemente con la giungla con {{champion:104}} {{champion:203}} {{champion:29}} \r\ntemporalemente: semplicemente i tiratori da critico sono stati spostati molto pi&ugrave; avanti nel gioco, un bravo giocatore che sa farmare raggiung&agrave; comunque la sua massima forza a 35 min con 4 oggetti, dando comunque la possibilit&agrave; di avere un decente early-mid game con {{item:3095}}.\r\ncomunque tiratori non da critico sono comunque viabili, {{champion:236}} {{champion:119}} {{champion:81}} {{champion:21}} .\r\nl unica nota finale sui tiratori &egrave; che i loro oggetti costano un po troppo ma questo verr&agrave; (da quanto ho capito) risolto domani.\r\nla botlane non &egrave; pi&ugrave; rimasta un dominio incotrastato di una classe sola di champion, i tiratori, ma &egrave; stata aperta a molte pi&ugrave; varianti, doppio mago, combattente e support, doppio support... questo semplice fatto, che a molti potrebbe far storcere il naso, non &egrave; mai accaduto per nessun altro ruolo. La top si &egrave; aperta ai tiratori nelle season passate, ed anche ai maghi da danno sostenuto, in jungla bazzicano quasi tutte le classi, in mid sono appordati da poco i combattenti, ma da un po ci sono anche tiratori quali{{champion:42}} e una volta si giocava anche {{champion:236}}, oltre ai soliti maghi e assasin, e il ruolo di supporto ormai &egrave; aperto anche a maghi quali {{champion:63}} {{champion:143}} , cosa impensabile verso la season 2,3 e anche 4.\r\nl unico ruolo un po ora sbilanciato &egrave; la giungla, poich&eacute; ora &egrave; preferibile (in solo duo, ma anche in competitivo) giocare champion aggressivi e in grado di contestare obbiettivi e in particolare argogranghio.\r\n\r\ntutto potrebbe concludersi con la patch di domani ma vorrei comunque lasciarmi ad una riflessione finale:\r\nin molti giochi il metagame non &egrave; dettato da un team di sviluppatori ma per lo pi&ugrave; dai giocatori, esempio pokemon. \r\nil competitivo in questi giochi &egrave; gestito con una enome&quot;patch&quot; a inizio anno e molte volte possono passare anni prima che un determinato soggetto over power venga nerfato. Ma i giocatori di questi giochi rispondono con un comportamento attivo, loro sono i fautori del meta: esistono si le cose forti, ma vengono affiancate cose out-meta ma contemporaneamente contro il meta. e cos&igrave; il meta stesso ne risente ed &egrave; in continua mutazione e evoluzione anche senza delle vere e proprie patch di aggiornamento. secondo me con al patch 8.11 e 8.12 eravamo arrivati anche noi a questo punto, un momento in cui chiunque poteva pensare al puzzle chiamato metagame e aggiungere un pezzetto, ma la comunity non ha, a mio parere, risposto molto bene, continuando nella sua passivit&agrave; all&#039; ombra del competitivo, lamentandoci di come le cose cambiano, invece di adattarci ad esse. E questo si &egrave; anche rispecchiato un po nel competitivo; chi si &egrave; adattato sta giocando il resto &egrave; stato messo per il momento in panchina.\r\n\r\nspero che mi sia spiegato bene e che vi abbia dato qualche spunto di riflessione, \r\nnon sono bravissimo a scrivere ne tanto meno a giocare a LoL, molte informazioni potrebbero essere inesatte ma il messaggio generale rimane quello: la riot ci ha un po &quot;viziati&quot; in questi anni dandoci un po la pappa pronta e girando la minestrina. ora siamo passati alla pasta e non sappiamo come comportarci, vi dico: proseguite nel gioco, divertitevi e (soprattutto)  sperimentatevi.","replies":[{"poster":"SuraKnight","date":"2018-06-26T16:32:22.836+0000","up_votes":4,"down_votes":12,"body":"Inizi dicendo che il gioco ora è bilanciato. Poi parli di champ un pò sbroccati, di classi che buildano critico abbastanza inutili, di carry in giungla e midlaner spariti. C'è qualquadra che non cosa :D","replies":[{"poster":"astenar","date":"2018-06-26T16:42:21.360+0000","up_votes":6,"down_votes":0,"body":"poter giocare qualsiasi cosa in qualsiasi ruolo( con i dovuti se), è proprio la definizione di bilanciamento eccessivo, non ci sono più le scelte obbligate ma si gioca quello che si vuole, e questo si vede nelle draft competitive. quando prendono un irelia, viene sempre detto e mo questo champion dove gioca? quando prendono braum ci sono sempre due scelte possibili. occhio non sto dicendo che questo sia un bene ma è la definizione di bilanciamento. in più non ho mai detto che il gioco sia bilanciato al 100% ciò è impossibile, alcuni champ sono e rimangono forti.\ni mid laner non sono spariti, si gioca zoe, malzahar, cassio, ryze, yasuo, talon ... le build da critico sono buone semplicemente molto costose. \nla tua definizione di bilanciamento è: un top laner tank\\combattente, mid un assasin\\mago, bot un tiratore con support ... ma questo è un gioco ordinato, non bilanciato, un gioco in cui o fai questo oppure perdi non è bilanciato è un gioco in cui l obbiettivo è chiaro, questo era il fulcro del discorso","replies":[{"poster":"SuraKnight","date":"2018-06-26T18:21:03.177+0000","up_votes":3,"down_votes":8,"body":"> [{quoted}](name=astenar,realm=EUW,application-id=MJVj50Jw,discussion-id=c7Jfe3JG,comment-id=00000000,timestamp=2018-06-26T16:42:21.360+0000)\n>\n> poter giocare qualsiasi cosa in qualsiasi ruolo( con i dovuti se), è proprio la definizione di bilanciamento eccessivo, non ci sono più le scelte obbligate ma si gioca quello che si vuole, e questo si vede nelle draft competitive. quando prendono un irelia, viene sempre detto e mo questo champion dove gioca? quando prendono braum ci sono sempre due scelte possibili. occhio non sto dicendo che questo sia un bene ma è la definizione di bilanciamento. in più non ho mai detto che il gioco sia bilanciato al 100% ciò è impossibile, alcuni champ sono e rimangono forti.\n> i mid laner non sono spariti, si gioca zoe, malzahar, cassio, ryze, yasuo, talon ... le build da critico sono buone semplicemente molto costose. \n> la tua definizione di bilanciamento è: un top laner tank\\combattente, mid un assasin\\mago, bot un tiratore con support ... ma questo è un gioco ordinato, non bilanciato, un gioco in cui o fai questo oppure perdi non è bilanciato è un gioco in cui l obbiettivo è chiaro, questo era il fulcro del discorso\n\n\"La possibilità del tutto che avviene in questi giorni nella landa degli evocatori è appunto un perfetto bilanciamento di campioni e ruoli.\" \nCit.\nComunque abbiamo due idee differenti di cosa significhi bilanciare lol :D","replies":[{"poster":"astenar","date":"2018-06-26T18:41:09.447+0000","up_votes":3,"down_votes":0,"body":"per bilanciare si intende estendere il concetto \" scelgo questo a posto di quello non perché è più forte ma perché mi piace di più\" a tutti i champ, esempio attuale ora irelia è pick or ban, è al di sopra di tutti gli altri champ quindi non è bilanciata. ma scegliere a priori (cioè senza aver deciso tattiche o strategie) tra lucian e miss fortune pensando mf mi piace di più, questo è sinonimo di bilanciamento. \nripeto che ciò non è un bene esteso a tutto il metagame e ritorno al discorso di prima","replies":[{"poster":"SuraKnight","date":"2018-06-26T19:42:20.232+0000","up_votes":2,"down_votes":6,"body":"> [{quoted}](name=astenar,realm=EUW,application-id=MJVj50Jw,discussion-id=c7Jfe3JG,comment-id=0000000000000000,timestamp=2018-06-26T18:41:09.447+0000)\n>\n> per bilanciare si intende estendere il concetto &quot; scelgo questo a posto di quello non perché è più forte ma perché mi piace di più&quot; a tutti i champ, esempio attuale ora irelia è pick or ban, è al di sopra di tutti gli altri champ quindi non è bilanciata. ma scegliere a priori (cioè senza aver deciso tattiche o strategie) tra lucian e miss fortune pensando mf mi piace di più, questo è sinonimo di bilanciamento. \n> ripeto che ciò non è un bene esteso a tutto il metagame e ritorno al discorso di prima\n\nFortunatamente il concetto di bilanciamento non è universale xD\nAnche adesso puoi scegliere di pickare il champ che vuoi. Se però ti ritrovi con una team comp inutile senza sinergia poi non lamentarti. Anche i pick dei champ sono frutto di una certa strategia, se leviamo pure quella....\nSul rendere giocabili tutti i champ concordo, ma questo non ha niente a che fare con i ruoli ricoperti nella landa a parer mio.","replies":[{"poster":"HugeNerf","date":"2018-06-27T16:18:04.344+0000","up_votes":1,"down_votes":1,"body":"si ma raga sta dicendo la sua... non serve mettere down vote senza commentare","replies":[{"poster":"pinkmanTS","date":"2018-06-27T23:22:16.123+0000","up_votes":1,"down_votes":3,"body":"Il problema è che quello che è stato detto è oggettivo quello che sta rispondendo lui no. Il tema è in riferimento a come è lol adesso, mentre lui risponde contrapponendo il prima al dopo.  Il gioco è bilanciato ora più che mai non al 100% com è ovvio che sia, ma quando c'è libertà di usare un champ in diversi ruoli e quando ogni ruolo può avere pick diversi tra di loro senza risentirne allora si può dire che il gioco è bilanciato e così è. Ovvio un Darius sarà sempre più forte di un Sion in corsia ma questo non rende un gioco sbilanciato. Ci son sempre champ con un early migliore e champ con un late migliore. Ma in genere i champ più improntati all early sono più facili da punire in quanto rischiosi da usare. Un azir riuscirà sempre a farmare e a scalare mentre una katarina sarà sempre più facile da punire. \nQuello che porta la gente a mettere down vote non è non l essere d accordo ma non trovare senso nelle risposte date secondo me.\nNon si può non essere d'accordo con un discorso quando questo è oggettivo.\n {{sticker:vlad-salute}}","replies":[{"poster":"SuraKnight","date":"2018-06-28T09:35:45.435+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=pinkmanTS,realm=EUW,application-id=MJVj50Jw,discussion-id=c7Jfe3JG,comment-id=0000000000000000000000000001,timestamp=2018-06-27T23:22:16.123+0000)\n>\n> Il problema è che quello che è stato detto è oggettivo quello che sta rispondendo lui no. Il tema è in riferimento a come è lol adesso, mentre lui risponde contrapponendo il prima al dopo.  Il gioco è bilanciato ora più che mai non al 100% com è ovvio che sia, ma quando c&#x27;è libertà di usare un champ in diversi ruoli e quando ogni ruolo può avere pick diversi tra di loro senza risentirne allora si può dire che il gioco è bilanciato e così è. Ovvio un Darius sarà sempre più forte di un Sion in corsia ma questo non rende un gioco sbilanciato. Ci son sempre champ con un early migliore e champ con un late migliore. Ma in genere i champ più improntati all early sono più facili da punire in quanto rischiosi da usare. Un azir riuscirà sempre a farmare e a scalare mentre una katarina sarà sempre più facile da punire. \n> Quello che porta la gente a mettere down vote non è non l essere d accordo ma non trovare senso nelle risposte date secondo me.\n> Non si può non essere d&#x27;accordo con un discorso quando questo è oggettivo.\n>  {{sticker:vlad-salute}}\n\nE cosa avrei detto di tanto sbagliato? Che per me il gioco non è così bilanciato come sostenete voi? \nScusate, la prossima volta mi adeguo a quello che scrivete. \n:D\nPs: di oggettivo nel post c'è solo la descrizione della situazione nella landa. Tutto il resto sono pareri personali opinabili da tutti. Lo stesso autore del post invita alla riflessione e specifica più volte che è un suo pensiero.\nIo ho parlato solo della parte non oggettiva.","replies":[{"poster":"HugeNerf","date":"2018-06-28T11:07:21.501+0000","up_votes":1,"down_votes":0,"body":"per me   non dovevi usare quel sarcasmo all' inizio.. credo che ti abbiano inquadrato male.. comunque l' importante è non insultarsi, alla fine abbiamo avuto tutti una conversazione abbastanza tranquilla :D\n CI SI VEDE GUYS","replies":[]}]},{"poster":"HugeNerf","date":"2018-06-28T08:15:26.335+0000","up_votes":1,"down_votes":0,"body":"d' accordissimo.. ma se devi mettere down vote commenta.. ovviamente non riferito a te, anzi sei stato molto gentile a rispondermi in toni educati :=) \n\np.s : c' è da dire che lui ha messo del sarcasmo all' inizio","replies":[]}]},{"poster":"SuraKnight","date":"2018-06-27T18:23:04.557+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=HugeNerf,realm=EUW,application-id=MJVj50Jw,discussion-id=c7Jfe3JG,comment-id=000000000000000000000000,timestamp=2018-06-27T16:18:04.344+0000)\n>\n> si ma raga sta dicendo la sua... non serve mettere down vote senza commentare\n\nAmen fratello :D","replies":[]}]}]}]}]}]}]},{"poster":"spot99","date":"2018-06-27T13:23:03.236+0000","up_votes":3,"down_votes":1,"body":"Un carry, che sia un mago o un tiratore, deve essere un campione che fa molti danni (o in poco tempo o costantemente) a costo di essere molto vulnerabile. \nSi parla spesso solo e soltando degli adc, ma anche i midlaner meritano una discussione a riguardo.\n\nParto quindi proprio dai midlaner, soprattutto i maghi. Dal mio punto di vista al momento  i midlaner fanno pochi danni(escludendo i casi che comprendono quei campioni op o quelli in cui il player riesce a snowballare), ma non sono molto vulnerabili. Ne è una conferma il fatto che gli assassin( a meno che non siano nettamente più bravi dell'avversario) in midlane non eccelano anche quando sono contro dei maghi squishy. Questo perché ci sono item come il banshee, la zhonya, l'arcangelo(in particolare lo scudo), il rylai e il roa( per gli hp che danno) che permettono anche ai midlaner squishy di essere comunque meno vulnerabili di quanto debbano essere. \nPer renderli quindi più \"carry\" nel vero senso della parola, la riot dovrebbe renderli più vulnerabili (non quanto gli adc privi di un support) e un po' più dannosi. Non penso quindi che si tratti di un nerf o di un buff, ma di una modifica ai punti di forza e di debolezza di questi campioni.\n\n\nPer quanto riguarda gli adc prima facevano molti danni verso alcune classi di campioni, ma erano anche invulnerabili se protetti da dei support decenti. Siccome sono dei carry, il problema principale a mio avviso non erano i danni che facevano, ma l'invulnerabilità che acquisivano grazie a particolari support. Immaginatevi ad esempio la combo kog maw+lulu di prima ; pensate che il problema fossero i danni di kog maw o i potenziamenti dati dalle spell di lulu?\nLa riot quindi doveva principalmente rendere più vulnerabili gli adc, cosa che è effettivamente successa, dato che sono state abbassate alcune statistiche e dato che sono stati nerfati quei support che rendevano, come ho già detto, invulnerabili gli adc. E fino a qui poteva essere un bilanciamento giusto, ma la riot ha deciso di modificare anche il modo di far danno deli adc. La maggior parte degli adc infatti faceva i danni come se facessero a gara su chi assassinava più velocemente il nemico. mentre faticavano non poco contro i full tank se privi di un support con l'ardent. Ora invece in late game non shottano i nemici squishy, ma fanno più danni ai tank.\n\nSi può dire quindi che il loro problema attualmente è proprio quello di essere troppo bilanciati di per se( forse solo il costo delle build è un tantino sbagliato, ma non lo sarebbe più se i game durassero di più), ma troppo deboli nel meta in cui si trovano, dove eccellono proprio gli anti adc, cioè i bruiser.\n\n\nSiccome gli adc fanno molti danni ai tank ora come ora, pickare un tank non ha senso attualmente, a meno che non si voglia counterare i danni dei maghi. Ma proprio perché i maghi non fanno molti danni, i tank effettivamente non sono più indispensabili. Per questo la gente utilizza i bruiser, che sono forti contro gli adc, ma che allo stesso tempo non hanno contro dei midlaner cosi letali da poterli ostacolare. \n\n\nGiungendo quindi al punto, buffando i danni dei midlaner in modo che siano più forti contro gli squishy e anche contro i bruiser( che non sono dei veri tank), i full tank torneranno ad essere in alcuni game indispensabili, ma questa volta non saranno più immortali, dato che gli adc sono finalmente antitank come avrebbero dovuto sempre essere.\n\n\nSi avrà quindi uno scenario in cui:\n\n-I tank counterano i midlaner, ma vengono counterati dagli adc.\n-I bruiser counterano gli adc, ma vengono counterati dai midlaner.\n\n\nPer me se si raggiunge questo risultato, allora si potrà veramente parlare di bilanciamento.","replies":[{"poster":"GMiracleBlade","date":"2018-06-29T00:16:02.346+0000","up_votes":1,"down_votes":0,"body":"FATE ARRIVARE QUESTO COMMENTO ALLA RIOT","replies":[]}]},{"poster":"Saibbo","date":"2018-06-27T10:10:38.007+0000","up_votes":3,"down_votes":1,"body":">oggetti costano un po troppo ma questo verrà (da quanto ho capito) risolto domani.\ntutto potrebbe concludersi con la patch di domani \n\n{{item:3031}}  ~~3700~~ => 3600\nche bella barzelletta\n{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"astenar","date":"2018-06-27T11:20:01.849+0000","up_votes":1,"down_votes":0,"body":"Effettivamente mi aspettavo qualcosina in più sui carry da critico, invece hanno preferito buffare singolarmente alcuni champion.","replies":[]}]},{"poster":"Erax157","date":"2018-07-03T15:56:42.676+0000","up_votes":0,"down_votes":0,"body":"Sono convinto che la bravura del player sia giocare intorno al meta se necessario. Un Player abbastanza intelligente è capace di plasmare il meta come dici tu. Diversamente da questo si giocano i campioni in meta. Se devo essere sincero quando ho capito come funzionava il meta su league of legends sono rimasto abbastanza sollevato e l'ho trovato molto piu flessibile e malleabile di altri giochi. Di conseguenza io ho sempre considerato il meta fino a un certo punto e ho giocato sempre campioni che mi piacessero fregandomene se fossero o meno in meta. Credo di poter dire che l'aver imparato a usare bene quei champion mi abbia anche dato una discreta bravura.","replies":[{"poster":"astenar","date":"2018-07-04T00:21:15.643+0000","up_votes":1,"down_votes":0,"body":"Siamo abbastanza della stessa opinione, io meta c è, questo non è negabile, ne è sbagliato giocare con io meta. Ma bisogna sapersi adattare, e se necessario giocare anche antimeta","replies":[]}]},{"poster":"The Fluffy Lamb","date":"2018-06-26T19:55:01.516+0000","up_votes":1,"down_votes":0,"body":"Il tuo concetto di bilanciamento è \"intrigante\". \nA me basta che lascino kindred così com'è. Che il resto vada a farsi fottere, al momento. Finalmente posso giocarla senza vivere i game divertendomi.\n\nHo passato mesi a sputare sangue e bile e ora il gioco mi piace. Tutti sti cambiamententi non mi toccano più di tanto, io gioco tutto decentemente (consiglio a tutti di imparare un po di tutto)","replies":[]},{"poster":"Ser Nalor","date":"2018-06-26T18:19:35.317+0000","up_votes":1,"down_votes":0,"body":"Mi piace la riflessione finale.\n\nPer il resto: che il gioco non possa essere del tutto bilanciato è anche abbastanza normale, ci sono tantissime variabili tra champ, oggetti, ecc ecc.\n\nQuello che, come dici tu, è mancato in questi anni è proprio una scelta molto ampia di combinazioni in tutta la mappa. Ora è possibile nonostante è sacrosanto il fatto che vada migliorata e ulteriormente bilanciata così da non lasciare proprio out alcune tipologie di champ.\n\nSecondo me è stato il cambiamento immediato che ha fatto reagire male tutti ma, d'altronde, non penso che sarebbe stato efficace se fatto a piccole dosi.","replies":[{"poster":"astenar","date":"2018-06-26T18:43:40.862+0000","up_votes":1,"down_votes":0,"body":"io dico meno male che un gioco non può essere totalmente bilanciato, poiché risulterebbe noioso. ci stiamo avvicinando ad un bilanciamento e ad un apertura di metagame rispetto agli anni precendenti.\nla riot sta facendo un ottimo lavoro con i bilanciamenti. nelle season passate c'erano periodi davvero sbilanciati ma ora con un po più di attenzione questi periodi si stanno eliminando o accorciando incredibilmente","replies":[]},{"poster":"SuraKnight","date":"2018-06-26T18:24:50.501+0000","up_votes":2,"down_votes":5,"body":"> [{quoted}](name=Ser Nalor,realm=EUW,application-id=MJVj50Jw,discussion-id=c7Jfe3JG,comment-id=0001,timestamp=2018-06-26T18:19:35.317+0000)\n> \n> Secondo me è stato il cambiamento immediato che ha fatto reagire male tutti ma, d&#x27;altronde, non penso che sarebbe stato efficace se fatto a piccole dosi.\n\nTutti questi cambiamenti derivano solamente da un tentativo di nerf agli adc e agli oggetti da critico. È una sorta di effetto collaterale. La riot comincerá a tornare sui suoi passi giá da domani.","replies":[{"poster":"Ser Nalor","date":"2018-06-26T19:16:01.736+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=SuraKnight,realm=EUW,application-id=MJVj50Jw,discussion-id=c7Jfe3JG,comment-id=00010000,timestamp=2018-06-26T18:24:50.501+0000)\n>\n> Tutti questi cambiamenti derivano solamente da un tentativo di nerf agli adc e agli oggetti da critico. È una sorta di effetto collaterale. La riot comincerá a tornare sui suoi passi giá da domani.\n\nDiciamo che spero non torni totalmente sui suoi passi ma che vada a fare migliorie \"di fino\" per far tornare anche gli adc da critico più considerati rispetto ad ora.","replies":[]}]}]},{"poster":"Erax157","date":"2018-07-03T15:59:12.620+0000","up_votes":0,"down_votes":0,"body":"Sono convinto che la bravura del player sia giocare intorno al meta se necessario. Un Player abbastanza intelligente è capace di plasmare il meta come dici tu. Diversamente da questo si giocano i campioni in meta. Se devo essere sincero quando ho capito come funzionava il meta su league of legends sono rimasto abbastanza sollevato e l'ho trovato molto piu flessibile e malleabile di altri giochi. Di conseguenza io ho sempre considerato il meta fino a un certo punto e ho giocato sempre campioni che mi piacessero fregandomene se fossero o meno in meta. Credo di poter dire che l'aver imparato a usare bene quei champion mi abbia anche dato una discreta bravura.","replies":[]}]}