{"poster":"Rykox","date":"2017-05-17T12:55:30.288+0000","title":"Wie geht man mit absichtlichen feedern um (konstruktive Idee)","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":0,"body":"Hallo liebe Leser :) \r\n\r\nDies soll kein Angriff auf Riot oder ein plumpes beschweren sein, sondern eine evtl konstruktive Idee wie man das Problem mit den Menschen regelt die absichtlich feeden. Wie ich gestern in einem Rankedgame leider wiedermal miterleben musste das jmd geschrieben hat das wir alle dreck sind, das sein smurf ist und er kein bock auf ein spiel hat in dem er gecamped wird, wonach er dann in die Gegner rein gerannt ist und auch geschrieben hat er rennt nur noch attackmove dr&uuml;ckend auf die lane und l&auml;sst sich umbringen, habe ich mir mal heute einen klaren Kopf gefasst und nachgedacht was denn das beste w&auml;re wie Riot damit umgehen w&uuml;rde. \r\n\r\nSo nun aber hier mein Gedanke. Wieso macht man es nicht bei solchen Spielern die daf&uuml;r reported werden und auch daf&uuml;r eine Strafe bekommen, wie bei den leavern f&uuml;r ein remake. Diejenigen die Premade sind bekommen die LP abgezogen und der der die Strafe bekommt, bekommt nunmal seine strafe. Ich empfinde das, wenn ich so dr&uuml;ber nachdenke, eigentlich eine sehr faire Herangehensweise da ja alle Andern immer noch versuchen ein normales Rankedgame zu spielen und daf&uuml;r indirekt bestraft werden von riot und direkt von der absichtlich feedenden Person. \r\n\r\nWie gesagt das ist ein versuchter konstruktiver beitrag zu diesem ganzen Thema und ich w&uuml;rde mich sehr freuen wenn ich genauso konstruktive Kritik zu meinem Beitrag bekommen w&uuml;rde. Ideen sind nat&uuml;rlich auch willkommen von allen die welche hier im Forum teilen m&ouml;chten :)\r\n\r\nVielen Dank f&uuml;rs lesen und jeglicher Beisteuerung einer &Uuml;berlegung :)","replies":[{"poster":"Humpelstilzche","date":"2017-05-17T14:06:48.985+0000","up_votes":8,"down_votes":0,"body":"Es gibt ein paar Probleme bei der Idee:\n\n1)  LP/Ligen-Inflation. \nDas Ligen-System ebenso wie das MMR-System sind relative Systeme, d.h. jeder einzelne Spieler wird nicht anhand objektiver Kriterien platziert (z.B. Anzahl Siege oder sowas), sondern relational, d.h. er wird mit anderen verglichen. In so einem System (der IQ wäre übrigens ein anderes Beispiel für ein solches System), darf man nicht einfach so Leute nach oben schieben, ohne andere nach unten zu schieben. Beim IQ würde das z.B. dazu führen, dass der Durchschnitts-IQ immer höher werden würde, was aber nicht sein darf, da der Durchschnitts-IQ per Definitition immer 100 ist. \nIm Fall von League würde es bedeuten, dass langsam aber stetig die gesamte Community in immer höhere Ligen rutscht, bis dann irgendwann die oberen alle gerammelt voll sind. Das darf in einem relativen System nicht sein, es können nicht alle die besten sein. \nSolltest du dir überlegt haben dass ja der Feeder den kompletten LP-Verlust alleine tragen kann, kommt es zu Problem 2:\n\n2) Zerstörung des Matchmakings\nWenn ein Spieler wegen einer einzelnen Niederlage die selben Verluste tragen muss wie die von mehreren Niederlagen, ist die logische Konsequenz, dass er viel schneller absteigt. Bei diesem Prozess verringert sich aber ja nicht durch magische Weise sein Skill, er ist ja immernoch so gut wie vorher. Das wiederum bedeutet, dass er ziemlich schnell mit Spielern gematcht wird, die deutlich schlechter sind als er. Das zerstört zum einen die Qualität des Matchmakings, zum anderen empfindet es der ein oder andere Feeder vlt sogar als erstrebenswert diese Strafe zu bekommen um ein wenige \"noobs zu bashen\". \n\n3) Potentieller Missbrauch\nHat man die Möglichkeit einen einzelnen Spieler die Konsequenzen für eine Niederlage tragen zu lassen, kannst du dich drauf verlassen, dass das Leute versuchen zu ihrem Vorteil auszunutzen. Berühmte Youtuber oder Streamer können z.B. die Fans in ihren Matches einfach bitten zu feeden, um die Konsequenzen der drohenden Niederlage zu vermeiden. Oder man bezahlt Leute dafür das zu tun. Oder man provoziert Spieler mit voller Absicht, damit sie es von alleine machen. \n\nUnd, last but not least:\n\n4) Wirkungslosigkeit der Strafe\nWie steigt man normalerweise ab? Indem man verliert! Wer verliert auf jeden Fall und mit voller Absicht? Absichtliche Feeder! \nJemand der absichtlich feedet, nimmt willentlich und mit voller Absicht in Kauf, dass er an Rang verlieren wird. Dein Vorschlag ist im wesentlichen, diese Leute damit zu bestrafen dass sie absteigen....eine Strafe die sie auch jetzt schon betrifft und ihnen offensichtlich völlig egal ist. Wäre es ihnen wichtig nicht abzusteigen, würden sie garnicht erst feeden. \nDem Großteil der Feeder wäre deine Strafe also sowas von egal und damit wäre sie wirkunglos. \n\nIch hoffe das ist die Art von konstruktiver Kritik, die du dir gewünscht hast.","replies":[{"poster":"Awsane","date":"2017-05-17T19:04:52.968+0000","up_votes":1,"down_votes":0,"body":"ich beneide dich, wie gut du das so schön strukturiert darstellst\n\ndarf ich das copy pasten für ggf andere Beiträge weil solche Vorschläge kommen ja des Öfteren?\n\nggf sollte man das hier auch mal unter einem neuen Beitrag Zusammenstellen mit anderen Themen, wie Vorteile/Nachteile des AUtofillsystems auch im Vergleich zu früher, dann könnte man die Leute darauf Verweisen (so wie der MMR-Info Post)","replies":[{"poster":"three stodges","date":"2017-05-18T06:32:15.461+0000","up_votes":1,"down_votes":2,"body":"Ich kann dein copy pasten nicht zustimmen und halte es für unangebracht, sich mit dem Spiel und eventuell vorhandenen Mängeln zu beschäftigen kann nie verkehrt sein , trainiert auch die Gehirnzellen.\n\nIch bin seit 4 Jahren in dem Game und habe mich auch damals  mit einem Thema beschäftigt und dazu einen Thread erstellt und \ndas war auch der einzigste ( auf anderen Acc) er hieß: afk Spiele ohne Punktebewertung ,mir ging das persönlich ziemlich auf den Keks,  10 Spiele am Tag zu machen und teilweise 50 % afk ler im Team zu haben ,schon beim Start des Spieles empfand Ich als ungerecht.\n\nMein damaliger Thread war zu 100 % Missbrauch sicher und Eloinflation ausgeschlossen vielleicht diente er sogar als Vorlage zum heutigen Remake was mir aber egal ist. Im übrigen ist es auch schwer hier in der Community wenn du etwas 100 % sicher hast dafür upvotes zu bekommen auch wenn die Idee noch so gut ist, es kamen aber auch Aussagen wie endlich mal eine gute und brauchbare Idee zum Thema afk.\n\nIch sehe hier auch neben Eloinflation noch ein anderes Problem ,das Spiel geht schon 20 Minuten oder länger und ein Mitspieler fängt jetzt erst an absichtlich zu feeden, diese Spiele dann wie beim Remake ohne Punktevergabe zu Bewerten geht einfach nicht, dann würden das alle machen und es würden vermutlich nie Punkte vergeben.","replies":[{"poster":"Awsane","date":"2017-05-18T14:34:58.934+0000","up_votes":3,"down_votes":0,"body":"Also \n\n1. kannst hat dein Einspruch kaum Wirkung auf mich, weil nach meinen Verständnis darf nur die Person, die es geschrieben hat (derjenige der die Rechte besitz) Einspruch erheben, wenn ich irgendjemanden in der Musik sample kann derjenige und der Künstler mir zugestimmt hat kann ja auch nicht eine nebenstehende Person sagen, nein, tue es nicht.\n\n2. habe ich mir darüber selber schon Gedanken gemacht, du kannst ja gerne mein Forenprofil durchsuchen, da werden einige Post zu genau diesem Thema sein und ich bin eigenständig darauf gekommen, welche Probleme das System hat und sie stimmen mit Humpels nur überein, \nich bin nur nicht so gut im Aufschreiben, deswegen habe ich ihn gefragt ob ich es übernehmen kann weil seine Version ist einfach aufgeräumter als alles was ich zu Papier bringe\n\n3. Verlinke den bitte, dann sehe ich mir den gerne an, aber die Suchfunktion hier im Forum ist nicht gut\n\n4. könntest du mir bitte erklären, wie du auf die upvote/communityproblematik kommst, bzw wie sich das auf meine vorherige Aussage bezieht, weil ich sehe dazu keinen Zusammenhang, aber du scheinst einen zu haben und ich würde ihn gerne nachvollziehen können\n\n5. Ich weiß selber, dass Humpels Beitrag nicht alle Probleme umfasst, aber diejenigen die er geschildert hat sind gut dargestellt, deine Idee mit der Sieger geht leer aus, ist mir auch schon vorher bewusst gewesen, und ja sie Fehlt\nbtw wie kommst du auf die Idee, dass ich denke, dass er alle Probleme erfasst hat, ich lobe ihn für die Struktur/Form nicht für Inhalt oder Vollständigkeit","replies":[]},{"poster":"Sirrkas","date":"2017-05-18T09:32:46.821+0000","up_votes":2,"down_votes":1,"body":"Kann es sein, dass du auf den falschen Beitrag geantwortet hast? Lediglich der erste Satz scheint sich auf diese Diskussion zu beziehen.","replies":[{"poster":"three stodges","date":"2017-05-18T10:04:44.450+0000","up_votes":1,"down_votes":3,"body":"Kann es sein das du Zusammenhänge nicht erkennst ?","replies":[]}]}]},{"poster":"Humpelstilzche","date":"2017-05-17T19:06:20.883+0000","up_votes":1,"down_votes":0,"body":"Danke für das Kompliment. Und ja klar, kannst du gerne zitieren.","replies":[]}]}]},{"poster":"BadBigus","date":"2017-05-17T13:14:09.154+0000","up_votes":1,"down_votes":9,"body":"dazu kommt das Riot nicht interessiert.. das System ist nicht die Bohne auf fairplay oder gutes Aufsteigen ausgelegt.\nLiga und MMR system sind mega undurchsichtig.. jeder Trottel kann ranked spielen.. \nLeute haben mitlerweile ihre 3-4 Accs zwischen einfach gewechselt wird falls mal einer ne Sperre hat.\n\nEs gibt diverse Mittel wie man sowas verhindern könnte, aber alle hätten zufolge das man entweder viele Spieler und so wiederum Geld verliert, oder auf direkten Weg Geld verliert. (oder man es halt abusen könnte).\nSprich 1 Acc pro IP, oder ähnliches System für Ranked wie in der ESL sprich verifiziertes Spielerprofil... aber ja wie gesagt würde alles dazu führen das weniger Menschen spielen würden weil Riot halt direkt mehre Tausend Accs bannen müsste","replies":[{"poster":"Gordalf","date":"2017-05-17T13:18:46.586+0000","up_votes":1,"down_votes":0,"body":"Warum sollten Leute nicht erlaubt werden zu smurfen? \n+Ich lebe in einer WG, 1 Acc pro IP wäre da echt kacke....\nMehr als ein Acc für soloq zu haben ist mehr als ok finde ich.\n\n..und aufsteigen kann man ohne größere probs in dem System, aber ist halt 5v5 und net 1v1 also kann es durchaus frustrierend sein manchmal.","replies":[{"poster":"BadBigus","date":"2017-05-18T22:42:38.309+0000","up_votes":2,"down_votes":1,"body":"Es geht hierbei nicht darum wg Accs zu sperren.. auch nicht um 1 IP per router.. xD \nWie gesagt habe ja auch den Vergleich zur ESL gezogen (und auch der Verweis das nur für Rangliste nicht für Normals), wenn man sich für Ranglisten spiele verifizieren müsste könnte man Flamern, Trollern, etc sehr leicht entgegen wirken und sie so wirklich für eine gewissen Zeit vom Spiel/ Ranked ausschliessen. Wieso das relevant ist erklär ich gleich.\n\nDer Punkt ist einfach das man eigentlich nicht mehr als einen Acc braucht da man ja zeitgleich eh nur auf einem spielen, das jetzt irgendwelche wirklich bekannten Streamer etc. vllt mal ein Acc haben wo sie nicht gleich 100 leute Spammen ist auch verständlich.  (Ich habe mitlerweile auch 3 30er Accs  zwischen SIlber und Dia 5 mit reichlich shit drauf so is das nicht).\n ABER es gibt keinen sinnvollen Grund mehr als einen Acc zu haben. da man ja ehh nur auf einem Spielen kann.\n\n;Mann muss sich einfach fragen wozu werden denn Smurfs genutzt ? \nZum Noobs trashen in lower elo, oder troll builds ausprobieren und feeden, flamen oder Freunde die reichlich lower geranked sind zu pushen.\nNichts davon ist wirklich sinnvoll für eine gesunde Community.\nFakt ist halt man kann so viel flamen wie man will und falls man wirklich mal ein Bann kriegt switcht man einfach den Acc.\nDas Riot überhaupt handel mich ebay Accs etc erlaubt spricht auch dafür wie einfach es ist einen Account auf instant Ranked level zu bekommen. Glaube neuer unranked 30er acc je nach champ anzahl bekommt man schon ab 15 Euro bei ebay.","replies":[{"poster":"Sirrkas","date":"2017-05-19T06:45:09.722+0000","up_votes":2,"down_votes":0,"body":">;Mann muss sich einfach fragen wozu werden denn Smurfs genutzt ?\nZum Noobs trashen in lower elo, oder troll builds ausprobieren und feeden, flamen oder Freunde die reichlich lower geranked sind zu pushen.\n\nDas sind ein paar Gründe aber nicht alle. So kann man den Smurf auch nutzen, um einem Freund den Einstieg nicht zu schwer zu machen. Man muss auf dem Smurf ja nicht versuchen seien Bestleistung abzurufen. Wenn man aber einen ganz neuen Spieler, der keine Mobas kennt, mit seinem Hauptaccount mitnimmt, wird der unter Garantie zerstört. Und ihm zu sagen, er soll erst mal 100 Spiele alleine machen, wird dem Freund sicher nicht so sehr gefallen wie ein \"klar, ich spiel mal mit dir und erklär es Schritt für Schritt\". \n\nAuch wenn dann der Freund am Anfang im PvP verlieren wird, die beiden neuen Accounts werden dann schneller als schwach eingestuft und treffen nicht mehr auf deutlich zu starke Gegner. Nimmt man den Stufe 30er, wird das Problem für den anderen immer bestehen bleiben. \n\nDes weiteren erstellen einige auch neue Accounts, um zu üben. Wenn jemand Toplane auf Platinniveau spielt, heißt das noch lange nicht, dass er als ADC da mithalten kann. Da ist er vielleicht nur Silber. Mit einem Smurf, kriegt man dann eine passende Herausforderung und kann daran wachsen.\n\n>Fakt ist halt man kann so viel flamen wie man will und falls man wirklich mal ein Bann kriegt switcht man einfach den Acc.\n\nUnd verliert alles, was auf dem alten Account war. Ja. Machen einige sicher, aber deswegen nicht alle. \n\n>Das Riot überhaupt handel mich ebay Accs etc erlaubt\n\nIch weiß ja nicht, wo du das her hast. Aber das ist etwas ganz neues. Riot erlaubt das ganz sicher nicht. Aber ein Verbot hat noch nie die Leute davon abgehalten, etwas zu tun. Ja, man kann im Internet auf einigen Seiten Accounts kaufen. Aber ich habe noch nie gesehen, dass da irgendwo stand, Riot hätte garantiert, dass der Account nicht gebannt werden könnte.","replies":[{"poster":"BadBigus","date":"2017-05-24T23:22:45.504+0000","up_votes":1,"down_votes":0,"body":"Ja ich bin mir ziemlich sicher das ich dass schon erwähnt hatte aber es geht hierbei hauptsächlich um Ranked... \nNormals und funmods kratzen bei sowas eher nicht wirklich.\n\nWenn du jedoch auf Ranked hinaus möchtest bekräftigst du sogar mein Argument..\nDein unerfahrener Kumpel sollte nicht mit dir Ranked spielen, genau dagegen wurde ja sogar von Riot eine Elodistanzgrenze für Premades eingeführt.\n\nDas Gedankenexperiment ist hier ja ziemlich easy..\n\n1. Dein Freund entspricht seiner Elo + du = hohe Chance auf gute Winrate -> resultiert jedoch darin das dein Freund ÜBER SEINEM Skilllevel spielt, was dazu führt das sobald er ohne dich spielt warscheinlich ziemlich schlecht (für seine Elo) spielen wird -> Resultat davon sind oft harte Flamer und Feeder.\n\n2. Dein Freund ist schlechter als seine Elo und wird sowieso nur von dir gecarried, muss ich wohl nicht erzählen wieso das schlecht ist.\n\nUnd dazu kommt noch das man 5 Gegner die chance nimmt ein Game auf einem vernümpftigen ihnen eigentlich angepassten Gegnerlevel zu gewinnen. Mit all den Smurf accs die es mitlerweile gibt ist ein \"balanced\" Matchmaking überhaupt nicht mehr möglich.","replies":[{"poster":"Sirrkas","date":"2017-05-24T23:29:35.639+0000","up_votes":1,"down_votes":0,"body":"Wenn es bei dem Gesprächsabschnitt ausschließlich um Rankeds ging, ja, da sind Smurfs störend und Untergraben meist die Idee einer Rangliste. \n\nWobei ich dann noch das Argument als valide ansehen würde, bei dem jemand auf seinem Smurf Champions übt, die er noch lange nicht auf dem Niveau seiner Mains spielen kann. Also zum Beispiel ein Diaspieler, der zwar mit seinen Toplanern da klar kommt, aber wenn er anfangen würde ADC zu spielen, nur auf Goldniveau wäre.","replies":[]}]},{"poster":"Cenâreth","date":"2017-05-19T19:13:04.314+0000","up_votes":1,"down_votes":0,"body":"Ich geb dir schon Recht was den Hauptaccount betrifft, allerdings nutzen die meisten ihre Smurfs eher darin die Leute in den Low Elos runterzudrücken oder dort zu halten. Hab schon viele erlebt die mich angeprangert haben ob ich dass mit Morgana Supp überhaupt carrien kann und haben dann absichtlich reingefeedet. In 50 % der Fälle gewann ich trotzdem. Und es ist kein Geheimnis dass Riot u.a. auch einige Profi Spieler in den letzten Jahren gebannt hat teilweise aus diesem aber auch teilweise aus anderem Grund.","replies":[]}]},{"poster":"three stodges","date":"2017-05-19T07:49:30.072+0000","up_votes":1,"down_votes":0,"body":"Glaube nicht nur bei Ebay man nutze goggle : wie seriös das ist ka.","replies":[]}]},{"poster":"RAG Ryve","date":"2017-05-17T17:37:57.851+0000","up_votes":1,"down_votes":0,"body":"Das mit den IP Vorschlägen kannst sowieso knicken, 90% der Leute wissen nichtmal wie man seine IP wechselt bzw das dies überhaupt geht.\nIst nicht schwer das ich plötzlich ne Amerikanische IP benutze und in Österreich rumsitz.","replies":[{"poster":"BadBigus","date":"2017-05-18T22:46:11.568+0000","up_votes":1,"down_votes":0,"body":"Ja wie bereits im obrigen Text erleutert wollte ich auch nur ein paar Möglichkeiten aufzählen.\nDas nur IP kontrolle nicht wirklich effektiv sein kann ist mir durchaus bewusst.\n \nBei der Spieler Anzahl und dem Umsatz den Riot selbst in EUW generiert wäre es jedoch ein leichtes für sie ein System zu etablieren um Spielerverhalten zu kontrollieren, dazu auch der Verweis auf die ESL.","replies":[]}]}]},{"poster":"RAG Ryve","date":"2017-05-17T17:34:28.385+0000","up_votes":4,"down_votes":0,"body":"Mein lieber Freund. Erkläre mir mal bitte warum es Riot weniger um Geld gehen sollte. Korrigiere mich wenn ich falsch liege aber um dieses Spiel zu spielen muss man nichts bezahlen, allerdings kostet es Riot eine Menge durch weiterentwicklung. Ebenso sind Turniere nicht gratis und müssen ebenfalls finanziert werden. Wenn die jetzt weniger auf Geld achten sollten würdest du sehr bald ein Pay2Win LoL haben denn irgendwo muss das Geld herkommen.\n\nUnd deine Aussage zum aufsteigen reicht mir schon um zu erkennen das du einfach nurn Typ bist der glaubt er gehört nach Dia aber dort nicht hinkommt weil ja alle anderen Schuld sind.\nDa frage ich mich dann komischerweise wie ich es letzte Season in Platin geschafft hab und jetzt auch wieder drin bin, wurde diese Season nämlich ebenfalls in Gold 5 eingestuft.","replies":[{"poster":"BadBigus","date":"2017-05-18T23:03:20.025+0000","up_votes":2,"down_votes":2,"body":"\"kostet Riot eine Menge durch Weiterentwicklung\" :D \n\nAlso tut mir leid wenn ich jetzt leicht lachen muss, wir spielen seit 6 Jahren auf der gleichen Map die einmal grafisch überarbeitet wurde, im Jahr kommen ca 4-5 neue Champs raus um mal kurz  auf die Skins zu kommen lasse ich hier einfach mal ein kleines video .\n ( https://www.youtube.com/watch?v=3EchAHFCv80) \nMir ist durchaus bewusst auch weil ich in einem ähnlichen Berufszweig tätig bin das dort noch mehr Kosten hinter einem ganzen Franchise stehen, trotzdem sollte man verstehen das Riot mehr als nur ein bisschen von Non - Profit weg ist. Die Meisten Zahlen die ich gefunden habe, natürlich unverifiziert da Riot keine genaueren Daten veröffentlich pendeln sich da bei jährlichen Profit  (im Vgl. zu Ausgaben von ca 300-400% ein) und das ist eine Menge Holz.\n\n\nBei einfachen Gegenüberstellung von Anzahl an Skins und allen anderen Sachen wird wenn man aufs Geld schnell klar was sich für Riot mehr lohnt. Und ich sage ja auch nicht das es falsch ist Geld zu verdienen. Aber es ist mitlerweile mehr als offensichtlich das es Riot mehr um Geld als um Gameplay geht. Das sieht man schon an unfassbar vielen Patches die obwohl sie auf dem PBE schon als völlig lächerlich überprüft wurden es trotzdem immer und immer wieder auf live server schaffen. \nDas geht los bei völlig übertriebenen Champion buffs bis zu kompletter meta shift als lethality grad rauskam, oder das neueste völlig overpowerd reworks oder völlig useless reworks. #seju #zac \nFür kleine Games wäre dies schon lange ein Todesurteil gewesen.","replies":[{"poster":"RAG Ryve","date":"2017-05-19T06:19:17.661+0000","up_votes":1,"down_votes":0,"body":"1. Es geht hier nicht nur um die Änderungen Kollege, Riot ist ein Unternehmen mit, keine Ahnung wie vielen Mitarbeitern, glaubst du die sitzen alle unbezahlt Zuhause bis irgendwem bei Riot eine neue Idee kommt? \n\n2. Und das ist natürlich noch immer das wofür ich die meisten auslache. Auf dem PBE können viele kaum was testen weil der PBE-Ping meist eher zu hoch ist. Mal abgesehen davon spielen auf dem PBE auch nicht die Mehrheit der LoL-Spieler, wo bekommt man also brauchbare Daten her? Richtig, auf dem Live Server.\nDie Champs sind deshalb OP wenn sie live gehen damit sie mehr gespielt werden und mehr Feedback zurückkommt, wenn ein Cahmp useless ist, spielt ihn keiner und Riot hat dann keine Ahnung was genau alles verbessert werden muss. Dann ist er erst total schwach, wird dann viel zu OP und DANN komm ein gutes balancing rein.\n\nIch bin mir sicher, jeder der immer wieder die Zeit hat sich über das Balancing zu beschweren hat jahrenlange Erfahrung in einer der größten und Erfolgreichsten Firmen in Sachen Moba´s und kann das natürlich viel viel besser.","replies":[{"poster":"BadBigus","date":"2017-05-24T23:14:52.292+0000","up_votes":1,"down_votes":0,"body":"Wie gesagt... habe ja einen link eingefügt ...\nHabe deinen ersten Punkt darin auch aufgeführt und erklärt das Riot trotzdem nichtmal ansatzweise das an Geld/ Franchise fliessen lässt was es verdient. Für so ein erfolgreiches Unternehmen funktioniert einfach viel zu viel noch viel zu schlecht.\n\nFrüher war das noch \"ok\" einfach weil \"LoL\" viel schneller als erwartet zu Erfolg gekommen ist und sie einfach nicht mit dem nachrüsten hinterhergekommen sind. Mitlerweile reden wir hier aber von einem 7 Jahre alten spiel (ohne Beta/Alpha zeit).\n\nZu deinem 2. Punkt is einfach quatsch.\nMuss man gar nicht weiter drauf eingehen.\nWenn man auch nur ansatzweise interessiert an Streamern oder Foreneinträgen zu aktuellen Patches ist.\nGibt es mindestens 200 Youtuber die jeden Patch alles haarklein auseinander nehmen , spielen und analysieren.\n\nNe Woche bevor die Reworks von Seju/zac/mao kamen wussten schon alle das Seju extrem broken wird und es war klar das es \"broken\" ist.. was passiert, es wird trotzdem implementiert und Seju climbed direkt zu Platz 1 Banrate und Winrate geht durch die Decke bis sie ne Woche später wieder genervt wird. \nGleiches Beispiel passt bei Maokai.\nUnd egal wohin man schaut es ist immer der gleiche Ablauf...\nTank meta -> tank nerf , Lethality eingeführt 2/3 Woche broken -> genervt, neue Champs gereworked -> genervt.\n\nUnd wie du schon sagtes eben \" nach jahrelanger Erfahrung sollte man sowas wohl eigentlich gut hinbekommen\"","replies":[]},{"poster":"Sirrkas","date":"2017-05-19T06:55:25.902+0000","up_votes":1,"down_votes":0,"body":">Die Champs sind deshalb OP wenn sie live gehen damit sie mehr gespielt werden und mehr Feedback zurückkommt, wenn ein Cahmp useless ist, spielt ihn keiner und Riot hat dann keine Ahnung was genau alles verbessert werden muss. Dann ist er erst total schwach, wird dann viel zu OP und DANN komm ein gutes balancing rein.\n\nDas ist eine interessante These und könnte vielleicht sogar stimmen. Wobei ich aber weniger glaube, dass Riot die absichtlich zu stark gestaltet. Das ist etwas, das einfach passiert. Die Probe auf dem PBE muss ja nicht repräsentativ für die Liveserver sein und es kann immer sein, dass etwas wichtiges übersehen wurde. Auch von den Spielern. Bei Lucian war es ja glaube ich so, dass er eigentlich OP raus kam, aber noch keiner wusste, was man machen muss, um ihn OP zu haben.","replies":[{"poster":"RAG Ryve","date":"2017-05-19T07:51:07.816+0000","up_votes":1,"down_votes":0,"body":"Ich glaube auch nicht das sie absichtlich viel zu stark aufgespielt werden, ich bin mir aber sicher das sie eher etwas zu stark als zu schwach released werden da es schwer ist den Mittelpunkt zu finden, dafür muss der Champ ja in jeder Elo mal gespielt werden und auch ein Vergleich von Profispielern sollte vorhanden sein.\n\nDas beste Beispiel dafür ist wohl Azir. In Bronze braucht man da nicht die unglaublichen Plays erwarten aber sollte er nur eine Spur zu stark sein eskaliert er in der LCS zb total.","replies":[]}]}]}]}]}]},{"poster":"Soúp","date":"2017-05-17T13:03:13.769+0000","up_votes":1,"down_votes":0,"body":"Wie du damit umgehen solltest? Es bleiben dir (meiner Meinung nach) nur 2 Optionen:\n\nDu/ihr ignoriert ihn. Vermutlich will er bewusst euren Hass schüren und freut sich, wenn ihr anfangt ihn zu beschimpfen. \n\n1. Dadurch, dass er ignoriert wird, ist ihm das getrolle zu langweilig und er fängt an richtig zu spielen.\n2. Es ist ihm komplett egal, ob andere reagieren und er trollt weiter. \n\nDa kannst du nichts machen. \n\nZu deiner Idee:\nSolche Sachen wurden hier schon 10000x durchgekaut. Es ist zu leicht zu abusen. Wenn ein Spieler merkt, dass das Team am verlieren ist, wird einfach solange jemand beschimpft/gemobbt/etc, bis dieser deshalb anfängt zu trollen ..","replies":[]}]}