{"poster":"Nameless Hero","date":"2015-05-01T13:37:34.223+0000","title":"Helena The Swamp Witch","subforum":"Concepts & Creations","up_votes":2,"down_votes":3,"body":"Hey guys, this is another champion concept that I thought of. I love New Orleans culture and I got pissed off when someone on the forums said that League of Legends didn&#039;t need a black female champion. \n@ Riot: Here&#039;s my champion concept. Please tell me what you think of her \n\nHelena the Swamp Witch\nRole: Support\nRange: 450, variable\n\nInspiration: \nErzulie Gogol from Witches Abroad - Terry Pratchett\n[Marie Laveau the Voundoun lady of New Orleans](http://www.voodooonthebayou.net/marie_laveau.html)\nTia Dalma from Pirates of the Carribean\n\n**GENERAL DESIGN PHILOSOPHY**\nI wanted to make a non-evil voodoo witch because I personally dislike the hollywood version of Voodoo doctors that we see with HOTS&#039; witch doctor and also because I wanted my witch to be heroic instead of just being a generic creepy villain. Character wise, Helena is a champion that sits on the fence between Good and Eveil. She loves her family very very much and despite being widowed for the last 8 years, is still loyal to her dead husband but she will not hesitate to commit the worst atrocities if it means being one step closer to rescue her daughter. As such, she has to constantly choose between \"Warm\" magic - buffing, removing curses or \"Cool\" magic - stealing buffs, cursing, etc. Even Baron Saturday, her ultimate, is a doubled edged sword.\n\nI chose the name Helena in order to make her more relatable to american audiences and to reflect her relationship with Baron Saturday. Check out the factoids at the bottom of the page.\nRight now she is closest to the gamestyle of Udyr BUT I am exploring the possibility to have her travel with a permanent pet zombie and have her play like a more seductive Yorick where she can revive all dead corpses for a short duration.\n\n**GAMEPLAY CORE CONCEPTS**\nHelena is a versatile support that has 3 different \"Dresses\" that modify her abilites. \nHer kit is essentially binomial to reflect her ambiguous nature. I.e. the same ability can be used to either cc an enemy or buff an ally. \nBut her most iconic ability is when she calls Baron Saturday to grant semi invulnerability to her whole team... before leaving everyone hangovered and vulnerable. \n\n\n**APPEARANCE**\nHelena is a mixed ancestry middle aged Haitian woman. She wears a white raglan blouse, uplift corset, gitane dress, red sash and heavy gold earrings and bracelets. She is beautiful in a curvy kind of way and has one of the warmest and most enticing personality of the game... until she gets serious. In game, she is accompanied by Legba, a black cockerel that is her link to the spirit world. She wields a totem pole adorned with chicken feathers and ram skulls. Since her whole kit is based around her 3 dresses please refer to the following to have an idea of what she looks like.\n\nBase Form\nhttp://fc00.deviantart.net/fs70/f/2011/101/b/2/cinders___concept_art_by_vinegar-d3dqrty.jpg\nCinders - Concept art by Vinegar-d3dqrty from Deviant art\n\nWhen Chanelling Erzulie \nhttp://s1068.photobucket.com/user/Terry_Loo/media/chow275voodooLady_zpssg7asg8x.jpg.html\nhttp://www.aeronik.com/blog/764/activities/voodoo-lady/\nErzulie the Voodoo witch - Concept art by Adam Duncan\n\nWhen Chanelling Dantor \nhttp://s1068.photobucket.com/user/Terry_Loo/media/tumblr_m28v59bZyl1rty7tao1_1280_zpsss2zcpb4.jpg.html\nhttp://womenfighters.tumblr.com/image/20824072421\nSeelah the Paladin from Wayne Reynolds \n\nWhen Chanelling Baron Saturday\nhttp://tracywong.deviantart.com/art/Voodoo-Queen-121394413\nVoodoo Queen by Tracy Wong\n\n**PASSIVE: Old Legba**\nHelena&#039;s black cockrel acts as a conduit between worlds. He stores charges that allow her to transform. Max 2, \n8 second cd before next cast. Takes 20s to accumulate a charge.\n\n**AUTO ATTACK** \nHelena lobs a black orb from her staff\n\n**Q : _Rhum piment&eacute; - Jalapeno Grog_** - Variable effects\n_That will put some lead on your pencil_ \n\"Saludos!\" On Ally: Helena lobs a bottle of heavily spiced Rhum to an ally who gets bonus attack and movement speed for 3s before getting slowed.\n\"AARGHH\" On enemy: Helena throws the Rhum to the **face** of an enemy who gets blinded and silenced for 1.5s. 2x mana consumpion\nPassive: Q changes according to Helena&#039;s dress\n\n**W: Erzulie ** Loa of love and feminity - 30s cooldown\n_&hearts; Thank you, you shouldn&#039;t have &hearts;_\nOn cast: Helena channels the spirit of Erzulie, STEALS all the enemy buffs ONCE in a **SHORT** area around her and gains a slight movement speed boost. Buffs that she can steal: Nunu&#039;s blood boil, Janna&#039;s, Leona&#039;s, Morgana&#039;s, Vi&#039;s and Blitzcrank&#039;s shield, Zhonya&#039;s effect, Wukong&#039;s invisibility, etc. BUT\nShe need to be in melee range for it to work. In Erzulie form, she has very low base armor and deals reduced damage. If she missed her steal she is completely exposed. Helena can cancel this ability early.\nPressing Q on an ally grants bonus . Pressing Q on an enemy sends an air smooch that slows her target.\n\n**E: Dantor ** Loa of family and protection - 20s cooldown\n_I will protect you_\nOn cast, Helena stuns enemies around her for 0.5s and doubles her armor stats. She becomes a tanky melee warrior but her movement speed is halved. Helena can cancel this ability early.\nPressing q lets her dash to an ally interposing herself between her ally and the nearest enemy. \n\n**R: Baron Saturday** Loa of masculinity, death and rebirth - 90s cooldown.\n_Let&#039;s dance Bitch!_\nOn cast, Helena channels the powerful Baron Saturday and starts to dance to distract the Loa of Death from doing his job. She becomes unable to use her W and E and auto attacks. In this form, all heroes in a medium area around her becomes pallid, zombie like and immune to death, slows,stuns and poison. Everyone is still vulnerable to dmg, snares, blind and true damage. Q becomes a mini nuke. \nHelena can still die. Killing her stops the effect. \n\nThat&#039;s all. I will post her lore in a sort while. \n\n\nPlease tell me in the comments what you think of her. Any criticism, good or bad is helpful. \n\n\nIf you like her, check out the other champion that I made:\n[Su the Wandering Calligrapher - ](http://boards.na.leagueoflegends.com/en/c/skin-champion-concepts/nm245ouh-su-the-wandering-calligrapher)","replies":[{"poster":"Riot Lutzburg","date":"2015-05-01T21:12:47.583+0000","up_votes":1,"down_votes":0,"body":"Hey Hero,\n\nI really appreciate the dedication to the unique culture that you've captured in Helena here.  It's certainly interesting and very much unexplored, but I also worry that it's far too niche and self-serving to be appreciated or enjoyed by mass audiences.  Describing Helena with one sentence, \"a witch doctor who tosses tonics and concoctions at other champions to buff/debuff them,\" doesn't sound immediately exciting or interesting.  The kit itself is also kind of, I dunno, uninspired?  I'm not sure.  I read the whole thing twice but to be honest, I can barely remember anything about her mechanics or kit.  Helena's theme is very strong and interesting, if only for the novelty, but nothing about her kit seems memorable.\n\nI'm not sure if there's a way to salvage that or if it's even a problem, since it's just the opinion of one person.  If the kit could be as memorable and interesting as her visual identity and theme, you'd be onto something.","replies":[{"poster":"Nameless Hero","date":"2015-05-02T17:38:32.941+0000","up_votes":2,"down_votes":0,"body":"Alright, I appreciate your comments. \n\nFor the niche audience it's true. I mostly explore unexplored concepts and try to make them playable. That's my hobby and strategy really.\n\nAs for her kit, I also think that her kit needs to be overhauled with some better and simpler mechanisms. \n\nOh well back to the drawing board.","replies":[{"poster":"Riot Lutzburg","date":"2015-05-02T19:12:52.012+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nameless Hero,realm=EUW,application-id=A8FQeEA8,discussion-id=GIcj6aZH,comment-id=00020000,timestamp=2015-05-02T17:38:32.941+0000)\n>\n> Alright, I appreciate your comments. \n> \n> For the niche audience it's true. I mostly explore unexplored concepts and try to make them playable. That's my hobby and strategy really.\n> \n> As for her kit, I also think that her kit needs to be overhauled with some better and simpler mechanisms. \n> \n> Oh well back to the drawing board.\n\nAwesome, good luck!","replies":[]}]}]},{"poster":"Occams Raiser","date":"2015-05-01T17:36:02.332+0000","up_votes":2,"down_votes":0,"body":"If Runterra is a mythical place, why are black people still the voodoo doctor? I have noticed that there has never been a black tinker genius. I never see a black rocketeer.","replies":[{"poster":"Nameless Hero","date":"2015-05-01T19:04:50.506+0000","up_votes":1,"down_votes":0,"body":"Dear Occams. I have supported you when you wanted a black champion but on this subject I say: \nFuck you. I made her coz Voodoo witches are cool not because she's black. \n\nSeriously bro, if you are going to diss her just because she's a traditionally black character then you have serious issues man. \nCheck her concept, she is not a tradional evil crone and I went out of my way to portray both her and voundoun positively. \n\nAnd by the way, I already created the black champion that you requested [Delora the Crystal Wrath ](http://boards.na.leagueoflegends.com/en/c/skin-champion-concepts/FfqkHLsQ-community-champion-concepts-delora-the-crystal-wrath) and you didn't even comment. \n","replies":[{"poster":"Occams Raiser","date":"2015-05-01T19:17:14.807+0000","up_votes":2,"down_votes":0,"body":"I'd didn't say they weren't. I said they were trite.","replies":[{"poster":"Nameless Hero","date":"2015-05-01T21:04:02.219+0000","up_votes":1,"down_votes":0,"body":"Well, she's mixed ancestry, not black and I'm not going to change that just because you don't like her skin colour.","replies":[{"poster":"Occams Raiser","date":"2015-05-01T23:24:39.884+0000","up_votes":1,"down_votes":0,"body":"I wouldn't expect you to. Do you. Trite Master Nameless","replies":[]}]}]}]}]},{"poster":"stours69","date":"2015-05-01T15:33:51.403+0000","up_votes":1,"down_votes":0,"body":"really nice like the idea but i would make her an old lady and reduce couldown on certain ability tho i dislike the E i would change it a bit for another god of this panteon","replies":[{"poster":"Nameless Hero","date":"2015-05-01T19:27:31.067+0000","up_votes":1,"down_votes":0,"body":"Thank you, this is indeed an idea that i was considering. \n\nOne idea that I had was that she had traded her beauty in exchange of voodoo powers and thus her base form would be an old woman. \nBut her ultimate would allow her to counter these effects and restore her youth for a limited time. \n\nPersonally I am afraid that making her base form an old woman would be unpopular among the fan base but if your post is sufficiently upvoted I might reconsider my decision and rewrite her lore.\n\nTo the forumers, what do you think? Would it be better that character was an old woman or would it be better to keep her young and attractive?","replies":[]}]}]}