{"poster":"MangoKimiko","date":"2015-05-28T17:25:26.567+0000","title":"Ekko & Champion vorschlag","subforum":"Champions & Gameplay","up_votes":1,"down_votes":4,"body":"Ekko, total balance, garnicht broken und 2 - hittet &uuml;berhaupt garnicht nach 2 Items.\r\n\r\n____\r\n\r\nWie w&auml;re es mit einem Champion, der am besten kein CD hat wie {{champion:92}}  ,  Resets nach nem Kill wie {{champion:55}} , eine Ulti wie Ekko, eine Passive wie {{champion:67}} blo&szlig; auf alle Champs und am besten ein Schild wie {{champion:157}}","replies":[{"poster":"Veezey","date":"2015-05-29T12:44:18.476+0000","up_votes":1,"down_votes":0,"body":"Ich finde das einzige was an Ekko broken ist, ist die Ulti und die Passive etwas.","replies":[]},{"poster":"PlanetenPlatzer","date":"2015-05-28T18:37:34.755+0000","up_votes":1,"down_votes":0,"body":"Genau genommen besteht dein Vorschlag nur aus diesen Punkten:\n\n3 verschiedene Passive: ein Schild, Resets und Laufgeschwindigkeit erhöhen\n\nFähigkeiten mit keiner Abklingzeit.\n\n\nHmm, ich denke das reicht noch nicht ganz","replies":[{"poster":"MangoKimiko","date":"2015-05-29T05:35:49.955+0000","up_votes":1,"down_votes":0,"body":"Hast noch den dreier Hit vergessen, wie bei Vayne oder Gnar.\n\nNen Stun wäre auch noch recht gut","replies":[]}]},{"poster":"ClAO KAKAO","date":"2015-05-28T19:35:42.746+0000","up_votes":1,"down_votes":0,"body":"Klar, Ekko scheint momentan stark zu sein, war aber Rek'Sai am Anfang auch und viele andere Champions auch bis man versteht was man gegen sie unternehmen kann.\nIm Fall von Ekko ist ein bisschen CC, sprich Silence oder Stun z.B. schon oft ausreichend, denn es besteht dann weit höheres Risiko mit ihm reinzugehen, schließlich ist er auch Melee.","replies":[{"poster":"spharic","date":"2015-05-29T01:25:46.843+0000","up_votes":1,"down_votes":0,"body":"rek'sai wurde x mal generft lol (und ist immernoch topo tier jungler)","replies":[{"poster":"MangoKimiko","date":"2015-05-29T05:34:38.605+0000","up_votes":1,"down_votes":0,"body":"Wenn ich generell einen Champ rausbringen, der nicht mit Dorans schon total Broken ist, sprich würde ich einen Champ rausbringen, der am anfang schwach ist, damit man sieht was genau man ändern kann, oder lässt sich von den Gamern verschlagen, was geändert werden könnte.","replies":[]}]}]},{"poster":"Nuix","date":"2015-05-28T17:38:05.582+0000","up_votes":1,"down_votes":0,"body":"Ein solcher Champion wäre mittlerweile viel zu schwach :)","replies":[]},{"poster":"Kaitri","date":"2015-05-28T17:28:13.239+0000","up_votes":1,"down_votes":0,"body":"langsam solltest du wissen das es für riot (und generell jede firma) sehr schwert ist einen neuen champ ins spiel zu bringen der nicht zu stark/schwach ist, wird normal eh sofort angepasst. keiner weiß wie man mit/gegen ihn spielt also ist es doch eh ausgeglichen.","replies":[]}]}