{"poster":"Croffins","date":"2019-06-24T23:17:44.504+0000","title":"Ma che meraviglia xd","subforum":"Discussioni generali","embed":{"description":"Croffins - Che game splendido - League of Legends - Twitch","url":"https://www.twitch.tv/videos/443772269","image":"https://static-cdn.jtvnw.net/s3_vods/61aa3a70a860c74c62a2_croffins_37508607926_2335648601//thumb/thumb443772269-640x360.jpg"},"up_votes":1,"down_votes":1,"body":"Disconnessione dalla partita totalmente a caso, 4 minuti circa per riconnettermi perchè il client fatto veramente molto bene doveva bloccarsi, essere lento, freezarsi fino a dovermi far chiudere il processo, dirmi che non avevo internet quando invece c'era, e il gioco doveva dare critical error giusto per dare quella punta di gusto in più. Torno dopo 4 minuti di agonia ormai rassegnato a perdere lp, e dopo un'azione discutibile da parte mia vengo pure chiamato handicappato e spazzatura. Non so voi ma gira e rigira belle le nuove skin ma i vecchi problemi restano, non sanno fare un client, non sanno risolvere i soliti bug di \"non hai internet controlla la connessione\" e soprattutto \"il sistema di report a fine partita funziona perfettamente\", ma sarò sfigato io a beccare l'unico game in cui la gente decide di dover essere tossica, non credo certo alla favola della gente che flamma ogni game, che baggianate xd. Comunque alla fine non ho preso leaver magicamente, e ho fatto i miei report. Per quanto riguarda il client/gioco freezato/crashato/impallato/malfunzionante e la community assolutamente disgustosa questa non è la prima, come neanche la decima volta che ho a che fare con problemi del genere, purtroppo però mentre devo serbare dei dubbi sul funzionamento del fantasmagorico sistema di report, posso stare abbastanza sicuro che questa non sarà l'ultima volta che mi troverò in una situazione simile, ma tanto non credo alla riot importi. Vorrei poter convincere tutti i player del mondo a non shoppare quelle qazzo di skin per 2 settimane, neanche 1 RP acquistato, magari così alla riot si accorgono che qualcosa non va, sempre che non siano troppo impegnati a molestare le impiegate.","replies":[{"poster":"IceEragon","date":"2019-06-25T09:47:12.738+0000","up_votes":1,"down_votes":0,"body":"Ciao,\npurtroppo sai quante volte anche a me è capitato (come anche ad altri giocatori sicuramente...)\nHo un pc vecchiotto, processore Amd phenom x4 945 2009.\nQuindi non sto lì a capire effettivamente se è il pc o il client che fa p...a\n\n\nSicuramente c'è qualcosa che non va con il client.\nIl client della PBE è ancora peggio\n\nNel video annunciato dalla riot su LOL PLS, non avevano annunciato l'arrivo di un nuovo client?","replies":[{"poster":"Croffins","date":"2019-06-25T11:13:31.596+0000","up_votes":1,"down_votes":0,"body":"Non so a che video ti riferisca, ma questo client è già il secondo quindi se il video era vecchio sappi che hanno già fatto, e il client vecchio funzionava molto meglio di questo, grafica più brutta ma sticazzi onestamente.","replies":[{"poster":"IceEragon","date":"2019-06-25T12:03:23.862+0000","up_votes":1,"down_votes":0,"body":"Ciao, \nil video si chiama RIOT PLS se non sbaglio, è in lingua inglese uscito pochi giorni fa.\nMi sembra che il nuovo client dovesse funzionare su base motore chrome ma non ho ben capito..\nNon so se nel tuo video stai già utilizzando questo nuovo client oppure no..","replies":[{"poster":"Croffins","date":"2019-06-25T14:41:37.294+0000","up_votes":1,"down_votes":0,"body":"Riot pls è tipo un format in cui la riot risponde a domande dei giocatori, il video non si chiama riot pls e basta, ci sarà dell'altro, in ogni caso non l'ho visto appena posso dò un'occhiata, non credo il client sia cambiato però perchè non ho visto aggiornamenti, il funzionamento è praticamente lo stesso con gli stessi bug e tutto e la grafica è uguale, se il video è uscito qualche giorno fa mi sembra pure strano che abbiano già fatto tutto. Comunque il problema principale non era solo il client, ma mi è proprio crashata la connessione in game e ho visto dal forum che non sono l'unico, avranno fatto qualche cazzata boh.","replies":[{"poster":"Croffins","date":"2019-06-25T15:13:37.985+0000","up_votes":1,"down_votes":0,"body":"Ok ho visto il video, decisamente il client nuovo non è ancora arrivato.","replies":[]}]}]}]}]}]}