{"poster":"AlienPrimate","date":"2017-04-09T07:51:56.030+0000","title":"This is my problem with not having tribunal.","subforum":"Player Behavior","up_votes":2,"down_votes":2,"body":"Look at the end game chat and then look at the damage dealt in this ARAM game.  First off, who reports for ARAM anyways and second, reporting for someone&#039;s build should never be acceptable unless it is obvious trolling like AP Vayne or stacking tears.\n\nhttp://matchhistory.na.leagueoflegends.com/en/#match-details/NA1/2470851184/209287161?tab=overview\nhttp://i.imgur.com/8KhLMlJ.png","replies":[{"poster":"MisterSki","date":"2017-04-09T16:13:26.278+0000","up_votes":1,"down_votes":2,"body":"The enemy team had little to no armor so I am not sure why you built the way you did. It isn't a viable build for shyv and you deserved every report you got. You trolled regardless of if you want to admit it or not.","replies":[{"poster":"AlienPrimate","date":"2017-04-09T21:46:17.732+0000","up_votes":3,"down_votes":0,"body":"How is it not a viable build but AP trist is?  I did 33k damage and she did 24k damage.  I decided on building her AP when I saw my team before the game even started.  Her ult + E does 770 + 130% AP burst and then 120+20% AP per second in a very large AOE.  You can easily hit the entire enemy team consistently with the combo in ARAM.  Her W scales about equally off of AD and AP and does magic damage both on hit and from the burn.  The bonus damage from the on hit effect of her E mark is magic damage.  Pretty much all damage she does besides her auto attacks is magic damage so magic penetration is strong on her.","replies":[{"poster":"MisterSki","date":"2017-04-10T23:33:05.424+0000","up_votes":1,"down_votes":2,"body":"You lost all ability to soak damage? You are a TANK not an AP mage. Trist AP is troll AF too. If you want to build troll shit feel free but, don't be surprised when you get shit for it.","replies":[{"poster":"AlienPrimate","date":"2017-04-10T23:57:32.310+0000","up_votes":2,"down_votes":0,"body":"Last time I checked, you don't need 4 people on the same team to soak up damage.","replies":[{"poster":"MisterSki","date":"2017-04-11T00:01:23.197+0000","up_votes":1,"down_votes":1,"body":"The only true tank you had was Darius and Trundle.... So about that 4 people thing... Think you need to work on your math some more kiddo","replies":[]},{"poster":"MisterSki","date":"2017-04-10T23:59:37.418+0000","up_votes":1,"down_votes":1,"body":"Last time I checked in ARAM if the game goes late it's the team with the MOST tanks that wins.","replies":[]}]}]}]}]},{"poster":"RallerenP","date":"2017-04-09T08:07:38.772+0000","up_votes":2,"down_votes":0,"body":"False reports do not get you banned. \n\nViable but unconventional builds are allowed. You will not get punished for this game, but you should also not punish others for false reporting.\n\nAlso I don't really see how having a tribunal will change anything. They would still report you.","replies":[{"poster":"AlienPrimate","date":"2017-04-09T08:26:03.382+0000","up_votes":1,"down_votes":5,"body":"Tribunal removes the chance of unjust punishment from reports.","replies":[{"poster":"TrulyBland","date":"2017-04-09T08:38:12.144+0000","up_votes":3,"down_votes":0,"body":"It doesn't \"remove\" it, at most it would reduce it (which I don't even believe). And even if it did lower that already abysmal number (1 in 6000 when the system was still new and not as fine-tuned) of unjust punishments which would be fixed by support either way, it would do so at the expense of a huge delay between offense and punishment and a massively lower sensitivity.","replies":[]},{"poster":"MUSHROOM MIDGET","date":"2017-04-11T04:23:17.227+0000","up_votes":1,"down_votes":0,"body":"HUGE numbers of trolls voted on the tribunal to try to punish people who didn't deserve it.  that is part of the reason they took it down","replies":[{"poster":"AlienPrimate","date":"2017-04-11T11:24:27.459+0000","up_votes":1,"down_votes":0,"body":"Considering my experience with the tribunal that is a blatant lie.  A lot of people I voted to pardon were voted to \"overwhelmingly not punish.\"  If there were actually HUGE numbers of trolls, I would have never had 100% majority accuracy with 80% or higher votes to pardon people.","replies":[]}]},{"poster":"RallerenP","date":"2017-04-09T08:40:09.368+0000","up_votes":2,"down_votes":0,"body":"I wouldn't know about that (I heard some quite nasty things about it), but it still would make no difference in this matter. You won't get punished for this game, you won't be punished by false reports, the chances of that is ***very*** slim. \n\nThe tribunal was slow and ineffective, which was why it was removed. IMO the IFS is way better than a tribunal since the rules are set by riot 100%. I trust the IFS a 1000 times more than I did the tribunal.","replies":[]},{"poster":"Zezockary","date":"2017-04-09T10:22:57.995+0000","up_votes":1,"down_votes":2,"body":"Actually, the tribunal had a much higher rate of false positives because most people in it waited for the timer to be done then hit punish without looking at the case.","replies":[]}]}]},{"poster":"EvilDustMan","date":"2017-04-09T10:32:22.678+0000","up_votes":1,"down_votes":0,"body":"Okay. Are you saying you got punished for this?","replies":[]}]}