{"poster":"CSB BlackStar","date":"2018-04-25T20:53:50.774+0000","title":"Nice-Ones Multigamingclan sucht dich!!!","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Wir, der NiceOnes Clan wollen ein gro&szlig;er Multigaming Clan werden der sich in vielen Spielen einen Namen machen m&ouml;chte. Da es viel Arbeit ist, haben wir schon ein kleines Team im Clan aufgebaut, woraus auch die Hierarchie, die entstanden ist. Wir m&ouml;chten aber auch nicht den Spa&szlig; h&auml;ngen lassen und an alles zu ernst rangehen, weswegen wir auch gerne jedermann freie Channel anbieten, die sie benutzen k&ouml;nnen. Mitgliedern bieten wir die M&ouml;glichkeit, aus eigener Interesse Teams f&uuml;r verschiedene Spiele zu bilden, dadurch k&ouml;nnen auch Teamleiter entstehen die, die Spielgruppe koordinieren. M&ouml;chte man hingegen einfach nur in Ruhe mit seinen Freunden und Kollegen spielen, ist dies nat&uuml;rlich auch kein Problem.\r\n\r\nWir bieten momentan an:\r\n\r\neinen vServer mit komplett eigenem Teamspeak Server\r\ngut struktuierten und durchdachten Teamspeak Server\r\nein Stammbaum an Spielern\r\nein Erfahrenes und faires Adminteam\r\nbei Interesse auch eigene Server, wie z.B Minecraft,Trouble in Terrorist Town\r\nClaneigenes Konto f&uuml;r komplett freiwillige spenden.\r\n\r\nWieso also solltest du zu uns kommen?\r\nGanz einfach. Wir bieten nicht den bekannten Stress aus Multigaming-Clans oder Communitys. M&ouml;chtest du dich uns anschlie&szlig;en kannst du das gerne tun. M&ouml;chtest du dich hingegen aber nur umschauen und brauchst ein Teamspeak mit Freunden, auch kein Ding. Ebenfalls hast du bei uns keine Pflichten wie z, b: t&auml;gliche Anwesenheit.\r\n\r\nBesuch uns doch einfach mal in unserem Teamspeak!\r\nAnsprechpartner sind:\r\nVec, Kijumix3, LeDucky\r\n\r\nTeamspeak: ts3.nice-ones.de\r\nzu erreichen.\r\n\r\nMfG. BlackStar","replies":[{"poster":"NG Karasu","date":"2018-04-26T16:03:55.464+0000","up_votes":1,"down_votes":0,"body":"Hey,\n\nDürfte ich die Member zahl im bereich lol wissen ?","replies":[]}]}