{"poster":"Exael","date":"2016-07-11T05:11:17.655+0000","title":"Algun Rioter? me equivoque en el concurso :P","subforum":"Creaciones de la comunidad","embed":{"description":"Base el traje especificamente en el Libertador Bernardo O'Higgins, padre de la patria de Chile, y su Rifle es un fusil BAKER acorde a la epoca de las independencias latinoamericanas (fecha de uso 1800-1835) y con una mira convencional acoplada para que no perdiera la esencia de \"rifle francotirador\".","url":"http://woobox.com/fmj33h/gallery/4YiV47uJq40","image":"http://s3-external-1.amazonaws.com/offertabs/offer/fmj33h/large/810_578321c840ea0-CaitlynMadredelaPatria2.jpg"},"up_votes":14,"down_votes":1,"body":"Hola, si algun Rioter ve este post, acabo de subir mi entrada para el concurso de fanart, pero no le puse el nombre de invocador (lo se, a veces soy muy volado xd) hay alguna forma de re-subirlo, dejar constancia que yo lo subi o simplemente quede descalificado? (seria una pena D:)\r\n\r\nEsop","replies":[{"poster":"Riot Nebo","date":"2016-07-11T16:44:14.420+0000","up_votes":6,"down_votes":0,"body":"Hola\n\nNo quedas descalificado, pero si quedas ganador, buscaremos la información de contacto de corre electrónico, entonces atento a nuestro correo para facilitarnos tus datos.\n\nUn abrazo,","replies":[{"poster":"Exael","date":"2016-07-11T16:56:29.960+0000","up_votes":1,"down_votes":0,"body":"Woohoo!, gracias :)","replies":[]}]},{"poster":"vaz2001","date":"2016-07-11T13:48:02.619+0000","up_votes":4,"down_votes":0,"body":"\"Las ilustraciones que no estén firmadas y resulten ganadoras, el premio será entregado a Riot Cóndor quien lo donará a la Fundación Porogalletas para Colaboradores de Comunidad (FPCC).\nPueden subir solo una participación. Si se equivocan, no pueden volver a enviar otra foto, así que recomendamos mucho cuidado al subir la imagen a menos de que sean amigos de Ekko\"","replies":[]},{"poster":"GinTaicho","date":"2016-07-14T00:23:43.544+0000","up_votes":1,"down_votes":0,"body":"Que bueno que si o si se contactarán contigo, esta muy bueno tu trabajo!\n{{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"Lucio22","date":"2016-07-12T08:54:51.470+0000","up_votes":1,"down_votes":0,"body":"hola, no lei los comentarios, pero te queria decir un par de cosas que pienso de tu fanart (no se si se lo cataloga como dibujo o que onda, no quiero tirar abajo el laburo de nadie):\n1- no lo lograste, pero se nota mucho que intentaste usar el estilo que usan los de riot para los concepts, lo cual me encanta. no quiero darle puntaje de mas ni de menos, pero creo que es un 8 solido, capaz que un 9.\n2- a riesgo de sonar gay/puto/malaonda/etc: era necesario el escote ese? no digo que este mal, pero creo que la preferiria con la parte pectoral (por asi decirlo) del uniforme posta.\n3- no estoy del todo seguro, pero me parece que le rompiste el tobillo derecho (o por lo menos, se lo dañaste), porque no creo que sea normal que se doble asi.\n4- esto no tiene mucho que ver, y lo pregunto por burro nomas: O'Higgins es el padre de la patria de chile? pensaba que se lo consideraba a san martin. si de casualidad este ultimo punto jode o suena a mala onda o pedante, no es la intencion, solo pensaba que posta era san martin (por algo chile es el lugar donde se le hizo la primera estatua)","replies":[{"poster":"Exael","date":"2016-07-12T15:23:32.835+0000","up_votes":1,"down_votes":0,"body":"1.- No pretendo que se parezca a nada, asi es como dibujo, puedes ver el resto [aqui ](http://exael-x.deviantart.com/)\n2.- Anatomicamente si se puede poner el pie de esa manera, es forzado, pero se puede\n3.- Junto con San Martin son considerados algunos de los Libertadores de America, pero O'Higgins es el Padre de la Patria en Chile","replies":[{"poster":"Lucio22","date":"2016-07-12T18:21:15.372+0000","up_votes":1,"down_votes":0,"body":"0.-} agregago un simbolo mas como para romper un poco las pelotas\n1.-} tenes razon, se puede ver que asi es tu estilo en particular, pero realmente me recordo a los concepts (que, viendolos ahora, no se parecen tanto. se nota que lo vi de tan buena calidad al dibujo que me trajo los oficiales a la mente). si de casualidad te jodi, no fue la intencion\n2.-} al rato de escribirlo, estuve tan al pedo como para intentarlo (en pata, obvio), y si se puede, aunque empieza a doler el empeine\n3.-} gracias por decirme, se que no tiene nada que ver con nada, pero es ese tipo de datos que me encantan (como el por que de que el salvador y honduras tienen una bandera que es muuuuuy similar a la argentina)\n4.-} espacio extra\n5.-} ya ta, tenes fanarts de skullgirls, sos un groso. si fuera por mi te declaraba ganador ya mismo (? (fuera de joda, me gusta mucho tu arte/dibujos/fanarts/perros voladores/como quieras decirle)","replies":[{"poster":"Exael","date":"2016-07-12T22:45:22.520+0000","up_votes":1,"down_votes":0,"body":"Gracias, Skullgirls es de lo mejor, no tanto por las mujeres voluptusas (aun que en parte... ejem) sino por las mecanicas de juego, es como los juego antiguos y ademas es de ambientacion Art-deco, uno de mis estilos favoritos ademas del art nouveau","replies":[{"poster":"Lucio22","date":"2016-07-13T07:24:27.102+0000","up_votes":1,"down_votes":0,"body":"a skullgirls lo considero el segundo mejor juego de pelea de la actualidad (siendo el primero killer instinct), por su estilo, como se complementa la musica al mismo, la originalidad de los personajes, el humor que tiene y la dificultad que tiene (no es sumamente jodido pero tampoco es facil, si no esta en el punto exacto, esta cerca). tambien me gusta que todo es dibujado a mano, lo cual hace aun mas increible el hecho de que, aparentemente, tiene el record de total de frames\np/d: aguante squiggly","replies":[]}]}]}]}]},{"poster":"vaVav","date":"2016-07-11T05:24:20.209+0000","up_votes":1,"down_votes":0,"body":"Me paso algo similar, no puse el hashtag, así que edité la foto y la resubi con el face de mi hermana (;v) y explique lo que pasó.\n\nHaz lo mismo, o espera respuesta de un rioter, ojalas no quedes descalificado, está bueno el dibujo.","replies":[{"poster":"vaVav","date":"2016-07-11T05:27:40.327+0000","up_votes":1,"down_votes":0,"body":"PD: ¿Con qué programa editaste la imagen y que tipo de fuente usas?","replies":[{"poster":"Exael","date":"2016-07-12T22:48:45.562+0000","up_votes":1,"down_votes":0,"body":"Lo hago con paint tool sai y al final lo termino con photoshop para correcciones de color","replies":[]}]}]},{"poster":"Icesoul","date":"2016-07-11T15:41:34.112+0000","up_votes":1,"down_votes":0,"body":"No man, te quedo re piola, felicidades.","replies":[]},{"poster":"ManuelAlcayaga","date":"2016-07-11T09:17:22.112+0000","up_votes":1,"down_votes":0,"body":"le di +1 para apoyar la causa, la verdad te quedo bastante bien.\nesperemos que algun rioter lo vea","replies":[]}]}