{"poster":"A Superb Villain","date":"2015-09-23T13:40:21.428+0000","title":"I Think We Should All Take a Moment to Appreciate Braum's Mom","subforum":"Story, Art, & Sound","up_votes":202,"down_votes":4,"body":"{{champion:201}} \n&quot;Mother always said - don&#039;t lose!&quot;\n&quot;Mother always said - float like iceberg, sting like thrown iceberg.&quot;\n\nI know that last line is a reference to Muhammad Ali, but assuming Braum is honest, and he really has no reason to be, he&#039;s **BRAUM**, then his mother sounds like a very confrontational woman, the kind that would suplex you into the ice if you crossed the line. Let&#039;s face it, this is the woman that gave birth to the _Heart of Freljord_, a man that wrestles dragons and punches through mountains. That Braum&#039;s mother would offer such words of encouragement like &quot;don&#039;t lose,&quot; speaks volumes about her personality. She did not tell her son, &quot;try your best&quot; or &quot;fight for what&#039;s right&quot; or even &quot;never give up,&quot; her command was a very simple &quot;don&#039;t lose.&quot; A fight breaks out? She would expect someone to hit hard like a thrown iceberg; literal of figurative, that is a monumental task, and since Braum did beat through a mountain with his bare hands, I think she was being literal. Braum&#039;s jovial disposition only makes it more amusing, considering how deadpan she sounds.\n\nI think it is safe to say Braum&#039;s mother was a badass.","replies":[{"poster":"Maple Crusader","date":"2015-09-23T13:59:52.854+0000","up_votes":77,"down_votes":0,"body":"Makes you wonder about other the parents of other champs.\n\n{{champion:154}} He was raised as a good kid by **Zaunite scientists**. Zaun's scientists aren't all amoral jerks who tinker and experiment for SCIENCE.\n{{champion:1}} Her parents managed to keep her under control\n{{champion:51}} Supported Cait's dream of becoming a cop. Imagine their pride when she became the sheriff of their hometown.","replies":[{"poster":"GreenLore","date":"2015-09-23T15:20:33.637+0000","up_votes":28,"down_votes":0,"body":"In Zacs case it also looks like at least one of his parents is quite the cheerful person him/herself\n\nI mean the test reports that were released as a teaser,have comments like \"tons of damage!\" and \"amazing...and cute!\" written all over them.","replies":[{"poster":"Nahara","date":"2015-09-23T18:24:06.472+0000","up_votes":8,"down_votes":1,"body":"Considering they were normal people willing and able to bust him out of a high-security weapons research facility, and have the cunning to evade the security force meant to return Zac, they were pretty hardcore and showed a loving, caring, morally strong side of Zaun that gets sadly lost amid the rogues gallery of psychotic mad scientists that are the city's normal representatives.","replies":[{"poster":"GreenLore","date":"2015-09-23T18:41:08.336+0000","up_votes":11,"down_votes":0,"body":"Overall I think Zaun is one of the most diverse city states when it comes to morality and I really like that.\nYou have good people like Zac and Ekko\nEvil guys like Mundo and Singed\nAnd then there are some who are kinda in the middle of that,like Viktor(good intentions,but questionable methods) and Twitch(the whole incident where he killed those scientists was just one big misunderstanding)\nSure it is more on the dark side in terms of morality,but thats not bad in itself.\n\nPiltover and Demacia have pretty much only good or neutral champs,while noxus and the shadow isles have only evil or neutral ones.","replies":[{"poster":"Wulf Helhammer","date":"2015-09-23T19:09:41.262+0000","up_votes":4,"down_votes":3,"body":"You forgot Janna. She's from Zaun too.\n\nAnd I would say the Viktor is now in the evil camp, but he was pushed that way and doesn't realize it","replies":[{"poster":"GreenLore","date":"2015-09-23T21:36:47.914+0000","up_votes":5,"down_votes":0,"body":"I only wanted to give 2 examples for every group\nThere are of course also Janna(even though she left zaun),blitzcrank,Warwick and Jinx.\n\nViktor is in my opinion on the darker side of the gray area.\nHe really seems to believe that his glorious evolution is going to help humanity,but it doesn't mean that his methods are acceptable.\nDepending on future lore release he might go into a more evil or neutral direction,we can't be sure about that.","replies":[]}]},{"poster":"2000boxes","date":"2015-09-24T06:40:42.483+0000","up_votes":2,"down_votes":0,"body":"what about ionia?\nthey have evil/good/middle people too","replies":[{"poster":"GreenLore","date":"2015-09-24T09:07:23.613+0000","up_votes":2,"down_votes":0,"body":"Yeah,but they also seem to be a bit divided by that.\nI mean Syndra and Zed are arguably evil,but their lore also is about how they clashed witht he ionian traditions.\nVarus is in the more grey area(i think,its hard to say when we have so few lore about him),but his lore is also about how he abandoned his duty eventually.\nMeaning that most who still fully support ionia are more on the good or light-grey side of the moral spectrum.","replies":[{"poster":"2000boxes","date":"2015-09-24T21:55:34.044+0000","up_votes":1,"down_votes":0,"body":"exactly\nso ionia is much more diverse than zaun","replies":[{"poster":"GreenLore","date":"2015-09-24T21:59:58.994+0000","up_votes":1,"down_votes":0,"body":"More like\n\"If you are for ionia you are good,if you are against it you are bad\"\nThe Ninjas are somewhat varied though.","replies":[{"poster":"2000boxes","date":"2015-09-24T22:03:23.723+0000","up_votes":1,"down_votes":0,"body":"ya but then you have people like lee sin and varus and wukong and master yi and yasuo to spice things up","replies":[{"poster":"GreenLore","date":"2015-09-24T22:45:53.341+0000","up_votes":1,"down_votes":0,"body":"Yeah,but Varus abandoned his post for vengance,so while he might not be against Ionia anymore,he doesn't seem to work for it anymore either,he now does his own thing.\nYi and Wukong don't really seem neutral,there isn't much that goes against them being good people and Yasuo simply didn't want to be punished for something that he didn't do and he pretty much killed those assassins in self defense because of that(and again he himself isn't really part of ionia anymore)\n\nLee sin is pretty much a good guy.\nYes he destroyed a whole village,but that was by accident and he has deep regrets about that.\nI mean he later lit himself on fire causing his eyes to be destroyed as a peaceful protest against noxus.","replies":[{"poster":"2000boxes","date":"2015-09-29T02:11:34.401+0000","up_votes":1,"down_votes":0,"body":"that's what i'm saying\nionia's characters have so much more depth to them compared to zaun\nall zaun has is good, bad, questionable\nionia actually has really well developed characters\nall we know about zaun's characters is their life goal \nionia we actually get some backstory","replies":[]}]}]}]}]}]}]}]}]},{"poster":"HayRoss","date":"2015-09-23T21:30:16.749+0000","up_votes":1,"down_votes":0,"body":"\"tons of damage\"\n\nZac dealing tons of damage? Since when?","replies":[{"poster":"HighH1","date":"2015-09-23T23:35:17.792+0000","up_votes":3,"down_votes":0,"body":"Pull an UberDanger and go FULL AP","replies":[]}]}]},{"poster":"Sharjo","date":"2015-09-23T14:15:57.819+0000","up_votes":13,"down_votes":0,"body":"> {{champion:51}} Supported Cait's dream of becoming a cop. Imagine their pride when she became the sheriff of their hometown.\n\nHer mum's also an amazing scientist who helped make Cait's gadgets and the like.","replies":[{"poster":"Chaotic Reks","date":"2015-09-23T15:09:57.646+0000","up_votes":4,"down_votes":0,"body":"so she's the one behind the cog-shooting rifle...","replies":[]}]},{"poster":"Spizzle9000","date":"2015-09-23T19:35:59.453+0000","up_votes":13,"down_votes":2,"body":"> [{quoted}](name=LungDrakkar,realm=NA,application-id=6kFXY1kR,discussion-id=3tm0AWPd,comment-id=0002,timestamp=2015-09-23T13:59:52.854+0000)\n>\n> Makes you wonder about other the parents of other champs.\n> \n> {{champion:154}} He was raised as a good kid by **Zaunite scientists**. Zaun's scientists aren't all amoral jerks who tinker and experiment for SCIENCE.\n> {{champion:1}} Her parents managed to keep her under control\n> {{champion:51}} Supported Cait's dream of becoming a cop. Imagine their pride when she became the sheriff of their hometown.\n\n{{champion:238}}: He was an orphan and he killed the sensei who allowed him to train at the Kinkou Order's base.\n\n{{champion:114}}: Cheated to win duels, not to mention teaching his daughter to be an egotistical, pretentious, overly- competitive douche.\n\n{{champion:86}} & {{champion:99}}: Raised their children to blindly follow the orders of the Lightshield dynasty and basically gave their children away happily.\n\n{{champion:8}}: He's a deranged, sadistic killer. His parents were/are (assuming he hasn't killed them yet) Noxian nobles, so we can safely assume they have some rather questionable values.\n\nI really wonder.\n\nEdit: Fixed stuff about Fiora.","replies":[{"poster":"Ralanr","date":"2015-09-23T20:45:16.803+0000","up_votes":8,"down_votes":0,"body":"{{champion:36}}: Alluded to have killed his (and not in self-defense).\n{{champion:84}}: Following in the footsteps of her mother.\n{{champion:122}} & {{champion:119}}: Orphans.  Darius probably had to mature faster to take care of his older brother.  It's possible he got Draven's job as an executioner so that he'd be less likely to die in battle.  Draven probably sees this as being coddled and thus is trying to make a name for himself...in the most extreme sense so he's not referred to as the younger brother of Darius.\n{{champion:3}}: Failing to save his creator made him go into a deep depression.  Either it was because he failed his designed task or he failed to protect his 'father'\n{{champion:38}}: Cares a lot about his daughter.\n{{champion:89}}: I'm...I'm drawing a blank honestly.  Mt.Targon needs some updating.\n{{champion:80}}: They probably are proud of him.  Considering he follows their culture.\n{{champion:107}}: Taught him how to hunt.  Was human too.\n{{champion:98}}: Followed in his fathers footsteps...which really sucked for when his dad got tortured in front of him as part of a test.\n{{champion:134}}: What parents?\n{{champion:102}}: Dad killed by another dragon (who was her mom?).\n\n\nIt's a mix.","replies":[{"poster":"ShatteredSanity","date":"2015-09-23T21:41:59.968+0000","up_votes":6,"down_votes":0,"body":"{{champion:102}} 's mom is a human. She's a half dragon, which made her an outcast among other dragons. Her dad protected her from this one dragon that was hunting them for years, until that one dragon got the better of him.\n\n{{champion:55}} , {{champion:69}} , and {{champion:91}} 's father has been missing for a view years now, but Talon hasn't given up looking for him. General DuCoteau was apparently a progressive Noxian, who took Talon in rather than killing him. He's also responsible for training Katarina, so he was pretty badass. I don't think we know anything about Katarina and Cassiopia's mother though.\n\n{{champion:22}} 's mom was in charge of the Avarosa clan before she was.\n\n{{champion:245}} Ekko's parents are rather absentee.\n\n{{champion:81}} 's parents are never actually mentioned, but his Uncle is currently running one of the shops on the Howling Abyss.\n\n{{champion:39}} 's father was an Ionian military guy, and it's his swords that she carried into battle with her.\n\n{{champion:38}}  is a father, and he failed to stop his daughter from being sacrificed to the Void by Malzahar. Speaking of which:\n\n{{champion:90}} 's parents, if they're still alive, must be heartbroken that either their son went missing, or that he went missing and then started hearing rumors that he is now a mad prophet trying to usher the Void into Runeterra.\n\nAnd we can't forget {{champion:61}} 's father, who went mad with grief over his daughter's death and built a robot with his daughter's personality and appearance to replace her.","replies":[]}]},{"poster":"FizzicallyNothin","date":"2015-09-24T13:54:34.161+0000","up_votes":3,"down_votes":0,"body":"No, her FATHER was caught cheating in his last match. Fiora herself was a great duelist.","replies":[]}]},{"poster":"Ralanr","date":"2015-09-23T15:17:25.601+0000","up_votes":3,"down_votes":0,"body":"Heck her Parents are from Noxus.  That alone makes me think they aren't horrible people. \n\nWe know little about how much they interact with Annie, but we do know they don't want politics to influence their lives.","replies":[{"poster":"sir vile","date":"2015-09-23T17:21:15.502+0000","up_votes":2,"down_votes":8,"body":"anyone else think annies warlock dad is actually THE warlock from the -game-that-shalt-not-be-named","replies":[{"poster":"Sharjo","date":"2015-09-23T18:31:25.943+0000","up_votes":6,"down_votes":0,"body":"Dude Warlock in Dota 2's an Oglodi. Unless Annie's half red-skinned Dota 2 orc then there's not a chance in hell.","replies":[{"poster":"Zorsus","date":"2015-09-23T18:54:05.440+0000","up_votes":2,"down_votes":1,"body":"How dare you mention that forbidden name?","replies":[{"poster":"Sharjo","date":"2015-09-23T20:30:33.916+0000","up_votes":3,"down_votes":0,"body":"Look I like Elder Titan and Visage, plus I'm hyped for Pit Lo-sorry, Abyssal Underlord, so I'll play Dota 2 occasionally regardless of what anyone here thinks! HAH!","replies":[{"poster":"doombotMECHA","date":"2015-09-23T23:07:04.109+0000","up_votes":1,"down_votes":0,"body":"OD is the best. but I played one game vs. pudge mid and never again.......blind hooks........from across mid.........owww","replies":[{"poster":"Sharjo","date":"2015-09-23T23:20:33.646+0000","up_votes":2,"down_votes":0,"body":"There's so much bollocks in Dota 2 but I still kinda like it. Not as much as League, but eh, different strokes for different blokes and what not!","replies":[]}]}]}]}]}]}]}]},{"poster":"Narasimha","date":"2015-09-23T16:12:40.406+0000","up_votes":30,"down_votes":0,"body":"\"Wait, Braum, how do you know how a thrown iceberg feels like?\"\n\"Mother was a very visual person. She showed Braum how to milk goats, how to cut wood, and how to throw icebergs.\"","replies":[{"poster":"DazedOnlooker","date":"2015-09-23T22:43:20.699+0000","up_votes":6,"down_votes":0,"body":"> \"Mother was a very visual person. She showed Braum how to milk goats, how to cut wood, **and how to throw icebergs**.\"\n\nSomething here is not like the others..","replies":[{"poster":"DorkunedAuras","date":"2015-09-24T01:32:36.491+0000","up_votes":16,"down_votes":0,"body":"Yeah, where would one find wood to cut in the Freljord?","replies":[{"poster":"Narasimha","date":"2015-09-24T15:59:05.054+0000","up_votes":3,"down_votes":0,"body":"\"Braum's mother was very patient woman. She bought sapling, planted it, watered it, raised it, and watched over it. And when it was full grown tree, Mother looked on her work with pride and joy.\nAnd then cut it down.\"","replies":[]}]}]}]},{"poster":"Noctius28","date":"2015-09-23T16:00:35.920+0000","up_votes":29,"down_votes":0,"body":"I like to believe the reason Braums mom said \"Don't loose\" is because she knew her boy would only ever fight for the good of all and the protection of his kin, showing how much she trusted Braum to always do good\n\nBut my favorite parents from league are Zacs parents, not only did they show us that not all Zaunites are bad, \nbut they risked their lives to save an experiment, nothing more than a little flubber with basic intelligence\nThey showed the kind of love you wish every parent gave their child, \nthey believed he would be more then they could ever imagine, \nthey gave him the confidence and stable childhood (that more then half the league never had) to become a honorable and confident adult who uses his powers for good\nThis all for a flubber made in in a vial in a lab\nTheir love has no limitations or preconceptions about \"as long as he has 10 fingers and 10 toes\" kind of stuff\nThey loved him for who and what he was\nHow many people can you say that about?\n\nGod bless Zacs parents!\nMay Kindred never take them\nMay Bard watch over them for eternity","replies":[{"poster":"AutoreactiveCD4","date":"2015-09-23T18:15:32.426+0000","up_votes":8,"down_votes":0,"body":"I loved the teaser for Zac. You saw a great progression of their thinking without seeing anyone at all. The silhouette made Zac look like an absolute monster, then he turns out to be this great protector of the innocent due to his parents raising him right.","replies":[]},{"poster":"Ralanr","date":"2015-09-23T20:46:46.764+0000","up_votes":7,"down_votes":0,"body":"They're the Ma and Pa Kent of Valoran.","replies":[]},{"poster":"Twiggles","date":"2015-09-23T16:04:02.882+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Noctius28,realm=EUW,application-id=6kFXY1kR,discussion-id=3tm0AWPd,comment-id=0003,timestamp=2015-09-23T16:00:35.920+0000)\n>\n> I like to believe the reason Braums mom said \"Don't loose\" is because she knew her boy would only ever fight for the good of all and the protection of his kin, showing how much she trusted Braum to always do good\n> \n> But my favorite parents from league are Zacs parents, not only did they show us that not all Zaunites are bad, \n> but they risked their lives to save an experiment, nothing more than a little flubber with basic intelligence\n> They showed the kind of love you wish every parent gave their child, \n> they believed he would be more then they could ever imagine, \n> they gave him the confidence and stable childhood (that more then half the league never had) to become a honorable and confident adult who uses his powers for good\n> This all for a flubber made in in a vial in a lab\n> Their love has no limitations or preconceptions about \"as long as he has 10 fingers ans 10 toes\" kind of stuff\n> They loved him for who and what he was\n> How many people can you say that about?\n> \n> God bless Zacs parents!\n> May Kindred never take them\n> May Bard watch over them for eternity\n\nAmen.","replies":[]},{"poster":"Zorsus","date":"2015-09-23T18:55:07.135+0000","up_votes":4,"down_votes":1,"body":"> \"Don't loose\"\n\nI don't know man, Braum seems tight enough.","replies":[]}]},{"poster":"Zedex","date":"2015-09-23T16:20:43.056+0000","up_votes":14,"down_votes":0,"body":"I'm actually hoping they make an old woman type champion. Braums mommy would be a perfect fit for that.\n\n\n\"Lissandra, you are very bad Ice Witch! Go take a time out!\"","replies":[{"poster":"sir vile","date":"2015-09-23T17:29:41.525+0000","up_votes":23,"down_votes":1,"body":"braums mom \nSupport/Tank\npassive - not dead yet (every 200 seconds falling below 20% health makes braum's mom take 50% less damage for 5 seconds)\nQ - DON'T LOSE (braum's mother smacks a nearby allied champion causing them to have increased combat stats temporarily)\nW - Throw iceberg (braum's mom lobs a chunk of ice at a target location dealing % of own health damage and slowing. the move can be charged to deal more damage but with a higher cast time, at max charge the iceberg will stun for  0.25-1.50 seconds)\nE- crook (braum's mom strike an enemy with her shepherd's crook, knocking them away and interrupting channels)\nR- GOAT MILK! (braum's mom carries bottles of magic milk with her that heal a champ based on their max hp and grant bonus armour (max 3 stacks , 60 second CD per stack))","replies":[{"poster":"blkKalameet","date":"2015-09-24T01:21:42.171+0000","up_votes":3,"down_votes":0,"body":"I want this to happen sooooo very much","replies":[]}]}]},{"poster":"TaoistMaster","date":"2015-09-23T21:02:28.125+0000","up_votes":17,"down_votes":0,"body":"{{champion:26}} is his own grandpa.\n\n\n{{champion:41}} Killed his dad, which actually made his dad proud.","replies":[{"poster":"sir vile","date":"2015-09-26T05:56:39.401+0000","up_votes":2,"down_votes":0,"body":"deep in the shadow isles a man eats a ghostly orange. a single tear running down his cheek. remembering the man who killed him and thinking...\"i've never been more proud\"","replies":[{"poster":"TaoistMaster","date":"2015-09-27T01:27:57.587+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=sir vile,realm=EUNE,application-id=6kFXY1kR,discussion-id=3tm0AWPd,comment-id=00090000,timestamp=2015-09-26T05:56:39.401+0000)\n>\n> deep in the shadow isles a man eats a ghostly orange. a single tear running down his cheek. remembering the man who killed him and thinking...\"i've never been more proud\"\n\nBrings a tear to my eye every time..","replies":[]}]}]},{"poster":"Sharjo","date":"2015-09-23T13:56:43.489+0000","up_votes":6,"down_votes":0,"body":"I can picture it now, Ashe coming to Braum's farm in Freljord with the intention to ask him to join the Avarosan cause, and they end up having the best time; she shows him the ways of the box, he shows her how to milk cows, they reminisce about their mums, they have a good laugh and Braum ends up joining Ashe's cause.","replies":[{"poster":"A Superb Villain","date":"2015-09-23T22:58:27.280+0000","up_votes":6,"down_votes":0,"body":"Please, no, my heart, I can't let it grow any larger; they will revoke my membership to Advocates of Evil.","replies":[{"poster":"Sharjo","date":"2015-09-23T23:00:54.013+0000","up_votes":4,"down_votes":0,"body":"Put away your worried face! I'm sure that even the Advocates of Evil must admit that Braum's too nice a guy to not like! Perhaps not to each other's faces but they're all secretly thinking it, surely!","replies":[{"poster":"A Superb Villain","date":"2015-09-23T23:03:48.517+0000","up_votes":4,"down_votes":0,"body":"######He's just so affable.","replies":[]}]},{"poster":"2000boxes","date":"2015-09-24T06:50:39.022+0000","up_votes":3,"down_votes":0,"body":"the acronym for your secret society is A.O.E...","replies":[{"poster":"Malicious Metal","date":"2015-09-24T07:28:35.033+0000","up_votes":2,"down_votes":0,"body":"{{champion:112}} \n{{champion:45}} \n{{champion:82}} \n{{champion:63}} \n{{champion:25}} \n{{champion:8}} \n{{champion:90}} \n{{champion:30}} \n\nWe indiscriminate. All shall feel the malicious power me control equally!","replies":[]}]}]}]},{"poster":"Tesla Effect","date":"2015-09-23T19:55:03.799+0000","up_votes":5,"down_votes":1,"body":"Probably Russian Mom.","replies":[]}]}