{"poster":"Pit Zahat","date":"2016-04-29T09:14:29.833+0000","title":"\"Dota es mejor.....","subforum":"Comportamiento del jugador","up_votes":64,"down_votes":19,"body":"....en su sistema de reportes q lol&quot;\n\nbueno obviamente esto fue un click bait para q tenga hartos views el post. Pero es q de verdad creo q riot deberia implementar el mismo sistema de reportes q dota, para lo q no sepan el sistema de dota es parecido al de lol pero se tiene 3 &quot;tickets&quot; de reporte por semana, por lo cual solo puedo reportar a 3 personas por semana asi q es mucho mas eficiente en el sentido q no llegan tantos spam reportes al sistema ya q ahora si se tendra q pensar si realmente vale la pena usar 1 de tus tickets en un &quot;troll menor&quot; xD  y adicionalmente si la persona a la cual reportaste la sancionan el sistema te devuelve el ticket q gastaste, es decir, si al q reportaste realmente lo sancionaron eso significa q usaste bien tu ticket no a lo tonto como &quot;me robo un farm lo voy a reportar xD&quot; asi q te lo devuleven\n\nGGIZI winner winner chicken dinner\n\nde verdad encuentro raro q riot (considerando todo lo q a copiado a otros mobas) aun no implemente este sistema, ojalas un rioter responda esto, dudo  (y lo digo sin ofender) q un rioter tenga autoridad o las ganas de q esto llege a HQ para q lo hagan realidad eso si xD\n\nEDIT: todos dice \"pero si ya use mis 3 reports y me toca un 4to troll?\" obviamente no lo podras reportar pero el punto es q esos 3 previos report fueron efectivos, es decir, sancionaron a esos 3 (y ahi te devuelven los tickets).... ahora piensen en el sistema actual, tienes infinitos reports y de los 12982 q reportas muy probablemente a ninguno sancionan.... asi q es 3 reports efectivos vs infinitos reports q no hacen nada. ;)","replies":[{"poster":"Snooow","date":"2016-04-29T14:51:46.347+0000","up_votes":16,"down_votes":1,"body":"Entonces si en la semana gastaste 2 tickets y en una partida hay 2 flamers, ¿tenes que elegir entre reportar a el que le deseo cancer a tu familia o el que te decía que te suicidaras?","replies":[{"poster":"Pit Zahat","date":"2016-04-29T19:02:23.296+0000","up_votes":3,"down_votes":0,"body":"Si, exactamente pero con este sistema al q reportas lo van a banear o puedes seguir como esta ahora q reportas a los 2 y a ninguno lo penalizan :) (pero asumo q psicologicamnete te sientes bien por reportarlos aunque no es hagan nada :) )","replies":[]}]},{"poster":"Reverze","date":"2016-04-29T14:18:21.764+0000","up_votes":11,"down_votes":5,"body":"Osea, que tú quieres ¿Restringir la cantidad de reports para que el sistema funcione mejor al no tener tanto spam o para pensar cuando usarlo? NO, idea PÉSIMA...\nNo hacen caso a los reports de hoy día y lo van a hacer con 3 reportes semanales... PLZ un poco de lógica... \n\nSi te ahorras un report por \"un troll menor\" para usarlo luego... Y no lo tenes que usar luego, ese troll, (al que no reportaste por ahorrarte tu \"ticket\") que te jodio la partida, seguirá libre por ahí con esa suerte (o no) pero darle la chance de que siga es PEOR que reportarlo y que no hagan nada...\n\nAcá lo que tienen que hacer es que hagan algo con los reports... Ponen el botín hextech ¿Para que? Para incentivar a los jugadores \"buenos y con buena actitud\", pero y porque no hacen algo para que los jugadores ni se piensen en trollear o flamear... Cualquiera puede jugar excelente una partida y luego trollear mil si quiere total no lo sancionarán... Luego jugar otra excelente partida y así sucesivamente... Así \"engañan\" al sistema que riot tan \"\"ingeniosamente\"\" pensó...\n\nQue los reports sirvan de algo, que el sistema de honores sirva de algo, que se sancione y que se incentive a jugar bien SIEMPRE o dar lo mejor en cada partida... No poner cosas para \"incentivar la buena actitud\" (muy falsa en la mayoría de los casos)...","replies":[{"poster":"Pit Zahat","date":"2016-04-29T19:06:08.960+0000","up_votes":3,"down_votes":0,"body":"wait wait wait deja citarte en esto \"Si te ahorras un report por \"un troll menor\" para usarlo luego... Y no lo tenes que usar luego, ese troll, (al que no reportaste por ahorrarte tu \"ticket\") que te jodio la partida, seguirá libre por ahí con esa suerte (o no) pero darle la chance de que siga es PEOR que reportarlo y que no hagan nada...\"  tu crees q en el sistema actual a ese troll menor q reportaste le paso algo? claramente no, no le llego ni un aviso es decir para efectos practicos no lo reportaste","replies":[]}]},{"poster":"Zesc","date":"2016-04-29T14:29:44.231+0000","up_votes":4,"down_votes":0,"body":"Nooo es tan así............en Dota tus reportes son mas severos, en dota reportas 3 veces pero en las 3 veces siempre pasa algo, mucha gente se quejo de reportes injustos que no tiene idea de por que fueron reportados...\n\nEntonces tus reportes siempre van a hacer algo, sea inocente o no, pero como tenes 3 preferis guardartelos para reportar a alguien que se lo merezca en vez de \"trolear\".\n\nPor lo que veo funciona bastante bien el report en Dota, en el sentido en que la gente lo entiende y la toxicidad pasa por otras cosas no por un afk o un feeder....\n\nEn el caso de lol tienen otra vision, ellos no buscan ser \"estrictos o severos\" buscan que el jugador cambie su actitud, tanto en cosas chicas como grandes. Entonces se vuelve un sistema muy complejo en donde tienen que revisar miles de casos. \nPero el mayor problema es que te toca alguien que murió 1/ 14/5 , lo reportas  y no sucede nada, probablemente por que esa persona no siempre tenga ese score, entonces no es alguien que es un troll ,es alguien que tuvo una mala partida, la realidad es completamente diferente... y casos similares pasa con gente que se queda en la fuente dando vueltas, gente que hace trollpicks y como no hay siquiera un sistema de replays, no pueden verificar nada al 100%.\n\nEn mi punto de vista riot debe ser mas severos. EL dota2 tiene un castigo que me pareció muy bueno que sucede cuando te reportan por X motivo a veces te ponen en una cola de baja prioridad, básicamente te matchea con gente que esta en tu situación, al ser menos que los demás tardan en encontrarte partidas y probablemente después de esa experiencia empieces a mejorar tu actitud....","replies":[]},{"poster":"EvaAnderson","date":"2016-04-29T13:36:00.206+0000","up_votes":4,"down_votes":0,"body":"Vos estas dando al usuario 3 reportes por dia, ponele que jugaste 10 partidas y te guardaste el ultimo reporte para la ultima partida por las dudas, y resulta que en esa partida todo fue bien.... perdiste un reporte por pensar que el afk de la partida 8 no era tan importante como un supuesto futuro troll que regala kills, insulta, les avisa al equipo enemigo cuando estas en baron/draco y ademas tambien se va afk.\n\nPonele que 3 usuarios de cada 10 sigue esa logica, la de guardar el reporte hasta la ultima partida y termina no usandola, te perdes millones de reportes por dia, ya de por si eso no me parece eficiente.\n\n\nLa idea, creo, es que vos puedas reportar desde lo mas basico hasta lo mas jodido, ellos te ponen filtros (las categorias de reportes) y en base a eso establecen prioridades, ademas de que imagino que si el reporte tiene comentarios suma mas prioridad al igual que (imagino) el hecho de que en una misma partida el tipo se coma mas de 2 reportes le sumaria importancia, y tambien imagino que la repeticion de reportes a la misma persona (sin filtrado de prioridad) es un must para darle un ban permanente. No pongo en tela de juicio el metodo que utilizan, porque si es como lo describi me parece que (obviamente con mas ajustes) se puede llegar a tener buenos resultados, lo que no se es si, por ejemplo, para banear a alguien necesitas tener un 5% del total de los usuarios pasados a reportes criticos (o de prioridad alta). De ser asi el porcentaje deberia ser inversamente proporcional a la cantidad de usuarios, es decir, tenes 67 millones de usuarios y con un 5% baneas, necesitas 3.350.000 reportes.... no todos reportan y me parece una cifra enorme, imaginate cuando llegues a tener 90 millones de usuarios, vas a necesitar 4.500.000 reportes! o ponele que este en un 1% de los 67 millones, serian 670.000 sigue siendo muchisimo!\n\n\n\nPD: Todo lo que escribi, intente que este en 'potencial' porque realmente no se como majena RIOT el sistema de reportes/baneos\nPD2: Me aburri de escribir","replies":[{"poster":"EvaAnderson","date":"2016-04-29T13:39:02.772+0000","up_votes":1,"down_votes":5,"body":"ha, ademas, puede ser que RIOT utilize un sistema de puntos:\n\nreporte de afk -> +10 puntos\nreporte de afk con comentario -> +12 puntos\nreporte de insultos -> 5 puntos\nreporte de insultos con comentario -> 7 putntos\n\n\ny cuando llegas a un total de, no se, poenle 20.000 puntos te banean\n\n\nque se yo, solo pasaba por aca","replies":[{"poster":"BOT Yásuo","date":"2016-04-29T14:14:21.081+0000","up_votes":5,"down_votes":0,"body":"De ir sumando de a 10 puntos por afk y 5 por insultos necesitas irte afk 2000 partidas para que te baneen...","replies":[]}]},{"poster":"Rayito","date":"2016-04-30T14:11:32.433+0000","up_votes":1,"down_votes":0,"body":"El sistema castiga de una a los afk, no necesitas reportarlos. Solo no castiga a los que no abandonan nunca menos de 3% de partidas abandonadas, si tenes mas de 3% te meten en partidas de baja prioridad con los otros kiters por una partida después 3 y 5.\n\nPd: 3% del total de todas tus partidas ejm de 1000 serian 30.\n\nPd2: Abandonos rotundos ósea salir y no volver, si te quedaste afk y volviste es muchísimo mas severo el castigo, eso si no te quede mucho afk en las partidas por que te meten castigo igual aunque vuelvas xD","replies":[]}]},{"poster":"Excalibeer","date":"2016-05-02T20:29:28.781+0000","up_votes":2,"down_votes":1,"body":"Mi pregunta es, cual es la diferencia si ambos sistemas banean sgún la consistencia ne la votación?  \n\nO acaso prefieres tres tickets y que cada voto termine si o si en un castigo?  Lo encuentro muy vulnerable.\n\n-Excalibeer","replies":[{"poster":"DieOrSovngarde","date":"2016-05-04T12:04:09.573+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Riot Excalibeer,realm=LAS,application-id=PJAKt7ph,discussion-id=hQhorzYr,comment-id=0018,timestamp=2016-05-02T20:29:28.781+0000)\n>\n> Mi pregunta es, cual es la diferencia si ambos sistemas banean sgún la consistencia ne la votación?  \n> \n> O acaso prefieres tres tickets y que cada voto termine si o si en un castigo?  Lo encuentro muy vulnerable.\n> \n> -Excalibeer\n\nSi hemos de elejir, siempre es mejor calidad que cantidad. Si supieramos que limitarnos a 3 tickets, coherentes y justificados, terminan ajusticiando al jugador toxico; que asi sea. A que reportar a mansalva y ver que aun sigue jugando y creer que el resto de los jugadores lo van a reportar en un lapso de 5 a 20 partidas sera reportado bajo los mismos motivos, si es que no ponen \"Play Again\" y yendose del lobby.","replies":[{"poster":"Excalibeer","date":"2016-05-04T14:37:25.506+0000","up_votes":1,"down_votes":0,"body":"Cómo haces que los reportes sean coherentes y justificados?  De momento este es un problema pues reportamos muy disperso.\n\n-Excalibeer","replies":[{"poster":"Luzar","date":"2016-05-05T06:20:14.913+0000","up_votes":1,"down_votes":1,"body":"El problema aca es que hay jugadores del LoL que te reportan por cualquier cosa y por culpa de esta gente te banean  permanentemente :/, a mi no me a pasado nunca pero lo se por muchos amigos.","replies":[{"poster":"Excalibeer","date":"2016-05-05T14:13:00.145+0000","up_votes":3,"down_votes":0,"body":"No he visto a alguien baneado por \"cualquier cosa\".  \nSí he visto a personas con un prontuario de toxicidad que llega a doler la panza, y los juegos que gatillaron el baneo fueron menos tóxicos que lo habitual, pero de igual forma hizo cosas que no queremos en juego.  \nSegún el ex-jugador, lo banearon por reportes falsos, de un premade o \"lo flamearon y lo hicieron responder\".  Pero en todos los casos han sido personas a) con prontuario nutrido y b) con un comportamiento malo en esos juegos finales.  \n\nSin embargo, no se descarta la posibilidad que alguna vez la estadística juegue en contra de un pobre ser, así que si me muestras un caso con gusto lo audito.\n\n-Excalibeer","replies":[]}]}]}]},{"poster":"Zyvix","date":"2016-05-04T14:50:47.710+0000","up_votes":1,"down_votes":0,"body":"Mi pregunta es, si ven tanta infinidades de foros sobre esto, porque no hacen algo? porque tu sistema de reports solo veo gente q se queja de baneos y sanciones sin razon y solos 1 o 2 ratitas baneadas, cuando tendrian que ser miles, tu sistema de report no sirve para nada.\n\nDejen de hacer tantos cambios de champs que cansados estamos de cambios en champs y metanle onda al juego posta, como los reports y otras cosas mayores que hacer cambios de numeritos en un champ\n\nNv","replies":[{"poster":"Excalibeer","date":"2016-05-04T15:53:02.667+0000","up_votes":3,"down_votes":0,"body":">  solo veo gente q se queja de baneos y sanciones sin razon  \n\nCada vez que veo uno lo verifico y contesto, no he visto ninguno injustificado.  Si me muestras un caso lo veo de inmediato.\n\n> Dejen de hacer tantos cambios de champs  \n\nUna cosa no se relaciona con la otra.  La cantidad de jugadores que disfrutan de los champs, arte y el juego son muchos más que los que andan perdiendo tiempo arruinándole el juego a los demás.  \n\n> tu sistema de report no sirve para nada.  \n\nPorqué estamos viendo cosas tan distintas?  \nEstá bien que tenemos mucho que mejorar: es lento, no retroalimenta, no hay buena información de cómo usarlo mejor, etc.  Pero tiene una excelente tasa de reforma, no he visto un baneo por toxicidad mal hecho y solo con hablar del tema en el foro la cantidad y calidad de reportes aumentan y esto por supuesto que hace más efectivo el sistema.  \nA diario entran personas de luto por sus permaban, algunos admitiendo y otros negando.  \nBaneamos a cientos al mes, a veces cientos en un día.  \n\nSin embargo hay personas que piensan que no sirve para nada.  \n\nMi mea culpa es que quizá no hemos desarrollado buenos canales de información para que se entienda mejor como reportar, los efectos del mismo y que muchos de los que más resienten el sistema son, en efecto, los flamers que le temen.  Qué dices?\n\n-Excalibeer","replies":[]}]},{"poster":"Pit Zahat","date":"2016-05-18T19:40:01.768+0000","up_votes":1,"down_votes":0,"body":"No es lo q haces lo q importa, es la percepcion de tu publico objetivo lo q importa.  (Es cosa de ver la mentira q vende Donal Trump, pero la gente le cree xD)\nY para q nos vamos a mentir el target de lol son (en gral y no quiero generalizar) niños de entre 12-18 años, q por cualquier cosa se \"calienta\" y reporta, lo cual genera una saturacion de la informacion y un muestreo exagerado y redundante de reports.... por eso CREO q podria ayudar este sistema","replies":[]},{"poster":"El Socialismo No","date":"2016-05-03T21:24:43.402+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Riot Excalibeer,realm=LAS,application-id=PJAKt7ph,discussion-id=hQhorzYr,comment-id=0018,timestamp=2016-05-02T20:29:28.781+0000)\n>\n> Mi pregunta es, cual es la diferencia si ambos sistemas banean sgún la consistencia ne la votación?  \n> \n> O acaso prefieres tres tickets y que cada voto termine si o si en un castigo?  Lo encuentro muy vulnerable.\n> \n> -Excalibeer\n\nYo creo que funciona su sistema de castigo, el problema es que no genera en ningún momento la idea de que de verdad funciona. Es como si el sistema de reportes fuese más bien una cuestión de fe, y mientras no se cambie esa sensación a nada que te deja un reporte, la gente seguira sin reportar y se seguirán llenando los foros de todo el mundo pidiendo mejorar el sistema de sanciones.\nEs cosa de ver el extasis que genera cuando le llega a alguien la notificación de que su reporte causo una sanción, es como si explotaran de alegría, ya que se siente más como un milagro, que como una efectiva herramienta contra los malos invocadores.","replies":[{"poster":"Excalibeer","date":"2016-05-04T04:22:25.710+0000","up_votes":1,"down_votes":0,"body":"Creo que diste en el blanco...tomé nota, gracias.\n\n-Excalibeer","replies":[]}]}]},{"poster":"Rayito","date":"2016-04-30T13:58:28.751+0000","up_votes":3,"down_votes":0,"body":"Te hago una corrección, cuando reportas y tu reporte hizo algo o fue \"valido\" te dan 2 reportes en vez de uno por que hiciste algo bueno para la comunidad.\n\nIgual pienso que hay muchísimas cosas que el dota 2 tiene muy superiores que el lol: Mapas custom creados por la comunidad, sandbox, repeticiones, mercado de la comunidad, ver partidas en vivo de alto mmr, el foro es 20 veces mejor xD, y sobre todo las creaciones de la comunidad pueden ser votadas para verlas dentro del juego <3","replies":[{"poster":"NICO PELDAÑO","date":"2016-04-30T23:27:43.148+0000","up_votes":1,"down_votes":0,"body":"La gracia es que le dan 2 tickets por 1 que gastaron si reportan bien porque quieren que la gente que reporta correctamente se encargue de limpiar el servidor por así decirlo.","replies":[{"poster":"Rayito","date":"2016-05-01T15:01:21.277+0000","up_votes":1,"down_votes":0,"body":"Exacto si sos alguien que reporta bien te dan mas chances de seguir haciéndolo.","replies":[]}]},{"poster":"Pit Zahat","date":"2016-05-01T05:11:32.865+0000","up_votes":1,"down_votes":0,"body":"todas las otras cosas q dices q son mejor (q tienes razon, son mejores) pero son mucho mas dificiles de implementar en terminos de horas de trabajo y personal requerido, lo q digo yo son como 5 lineas de codigo, se hace en un segundo xD ...estamos claro q hay mucho por mejorar pero vayamos de a poco","replies":[{"poster":"Rayito","date":"2016-05-01T14:58:46.776+0000","up_votes":1,"down_votes":0,"body":"Obvio, pero para los que seguimos los dos juegos, vemos las diferencias y en lo que puedan mejorar. Soñar no cuesta nada y si bien los dos juegos son excelentes les falta por mejorar.\n\nSaludos","replies":[]}]}]},{"poster":"Sunday Holiday","date":"2016-04-29T22:01:50.572+0000","up_votes":3,"down_votes":0,"body":"slither.io es mejor que agar.io","replies":[]},{"poster":"Pablove90","date":"2016-04-29T13:06:00.411+0000","up_votes":3,"down_votes":0,"body":"a mayor cantidad de reportes que uno haga menos importancia o valor tienen sus reportes.. lo que importa no es la cantidad si no la variedad.. el sistema sirve y mas que el del dota... pasa que el dota deveria tener 10 veces la cantidad de jugadores que tiene para que se manifiesten los problemas que hay aca... (en julio del año pasado sensaron 67 millones de jugadores en lol contra 7,9 del dota)  hay docenas y docenas de permabaneados por dia y solo en las y inclusive algunos de estos tienen la cara de venir al foro a hacer un post diciendo que el ban fue injusto, que le devuelvan la plata que invirtieron o simplemente insultar sin filtro alguno y justificandose\nel sistema sirve pero la comunidad es muy grande...\nel problema no es de riot, ni del sistema de reporte, el problema es de casa, es nuestra cultura... los latinos en general y esto se ve en todos lados.. mira streamings europeos y mira streaming chilenos o argentinos... ya el vocabulario es avergonsante e incluso nos interesa mas ver al nordic lord barbakhan, o el rubio este que no me acuerdo el nombre antes que ver un master haciendo guias, didacticas, strems, etc...\nno considero que este ni bien ni mal pero somos asi\n\nsi riot siempre falla en menospreciar a los jugadores nuevos (cosa que admitio pero sigue fallando)\ntambien riiot hace mal en no hacer que los jugadores mejoren su nivel y no solo eso si no que los jugadores aprenden mal porque arrancan del lv 1 con 0 conocimiento y estos aprenden mas de lo que hacen y dicen los que fueorn permabaneados y tienen que arrancar de lv 1 \nosea se mezcla al nuevo player con el player toxico\ny despues aprenden lo que ven y tenes un lv 10 o lv 20 diciendo gg izi manco nuv etc\n0 proteccion, 0 motivacion, 0 tutoriales oficiales, etc","replies":[]},{"poster":"rokushoger","date":"2016-04-29T12:38:36.659+0000","up_votes":4,"down_votes":3,"body":"No estoy de acuerdo. Encuentro genial que pueda reportar todo lo que sea reportado sea mayor o menor, un mal comportamiento debe ser reportado y merecer castigo.","replies":[{"poster":"xxxcanabisxxxx","date":"2016-04-29T17:02:26.321+0000","up_votes":2,"down_votes":1,"body":"y el 100% de las veces es castigado ?","replies":[{"poster":"rokushoger","date":"2016-04-29T19:07:07.124+0000","up_votes":2,"down_votes":1,"body":"Y en que hace la diferencia a mi opinión que te diga si o no a eso?","replies":[{"poster":"xxxcanabisxxxx","date":"2016-04-29T20:15:01.154+0000","up_votes":2,"down_votes":1,"body":"en que la diferencia recae en el resultado final,, si son castigados el sistema funciona y si no lo son ..algo anda mal asi de simple","replies":[{"poster":"LaReinaPingüino","date":"2016-04-30T03:18:20.182+0000","up_votes":2,"down_votes":0,"body":"Lo que anda mal es que muchos no reportan a esos tipos, lo que anda mal es que muchos no usan el sistema, no el sitema en si.","replies":[{"poster":"xxxcanabisxxxx","date":"2016-04-30T22:16:37.495+0000","up_votes":1,"down_votes":0,"body":"la mayoria reporta al final de partida ..te lo digo xq juego con amigos y hermanos , si uno trollea report al final pero mas alla de eso no pasa nada casi nunca :c","replies":[]}]},{"poster":"rokushoger","date":"2016-05-02T12:21:49.280+0000","up_votes":1,"down_votes":0,"body":"Eso no cambia el hecho que todo mal comportamiento debe ser castigado, y para que sea castigado debe ser reportado. Si limitas el número de reportes de un usuario estás limitando la funcionalidad del sistema, ya que este funciona mejor cuanto más reportes de un mismo tipo reciba.","replies":[]}]}]},{"poster":"EvaAnderson","date":"2016-04-29T20:10:26.461+0000","up_votes":2,"down_votes":1,"body":"y el 100% de los 3 reportes es castigado? tampoco! como puse antes, podes poner 1 solo report por mes y sin embargo no tenes un 100% de efectividad como plantean hacer con 3 reportes!","replies":[{"poster":"Pit Zahat","date":"2016-04-29T23:38:41.628+0000","up_votes":1,"down_votes":1,"body":"claramento no seria el 100%, pero como la muestra a analizar sera mucho menor y los datos mas confiables esto aunmentaria mucho la eficiencia del sistema","replies":[{"poster":"EvaAnderson","date":"2016-04-30T12:19:07.933+0000","up_votes":1,"down_votes":1,"body":"Tampoco sabes si los datos son mas confiables, eso es algo hipotetico tuyo","replies":[{"poster":"Pit Zahat","date":"2016-05-01T05:14:27.788+0000","up_votes":1,"down_votes":0,"body":"es una extrapolacion, ya es es un hecho q el banrate de este sistema es infimo, y obviamente con una muestra menor a analizar se pueden obtener resultados mas rapidos y con mayor correlacion","replies":[{"poster":"rokushoger","date":"2016-05-02T12:23:51.583+0000","up_votes":1,"down_votes":0,"body":"Donde están las pruebas de que el banrate es ínfimo?","replies":[]}]}]},{"poster":"rokushoger","date":"2016-05-02T12:23:24.741+0000","up_votes":1,"down_votes":0,"body":"Y también será mucho menor la cantidad de castigados que lo merecen, y será también mucho mayor la cantidad de gente que se sale con la suya. Es como que un gobierno dijera \"me voy a centrar en eliminar la pobreza de cierta zona y nada más porque me resulta más fácil hacerlo, y los demás que se pudran\".","replies":[]}]}]}]}]},{"poster":"ZyXEL 001","date":"2016-04-29T20:14:52.072+0000","up_votes":2,"down_votes":1,"body":"No funciona porque la comunidad acá es más tóxica. Es preferible un método estadístico y/o acumulativo acá (Cómo el método actual, que es mucho mejor que el tribunal).\n\nCon solo 3 reportes solamente puede incluso jugarte en contra ya que el sistema da por supuesto que tus reportes están siendo usados de manera correcta y la experiencia indica que muchos no reportan correctamente:\n\nUn ejemplo, un Yasuo aliado que salió 1-9 porque lo está aprendiendo a usar, entonces ya muchos empiezan a decir \"report mid, report yasuo\", van y lo reportan. Si tuviesemos el sistema del dota el pobre que no hizo mas que tener una mala partida se comería hasta un posible ban y desperdician un reporte que puede servir potencialmente para gente tóxica.\n\nEntonces, en esta comunidad no es funcional. Mucho egocentrismo.","replies":[{"poster":"Pit Zahat","date":"2016-04-29T23:30:26.859+0000","up_votes":2,"down_votes":0,"body":"hahahaha eso es justamente lo contrario ha lo q haria el sistema, es sistema (en teoria) haria q esos \"malos juegos\" q todos tenemos no sean reportados (por la mayoria de los players) ya q esperarian usar el ticket en algo mas importante","replies":[]}]},{"poster":"Donlans","date":"2016-04-29T16:29:24.681+0000","up_votes":2,"down_votes":0,"body":"entonces supongo que ahi los reports valen mucho mas, y no se reporta a un  jugador por jugar simplemente mal como aca","replies":[{"poster":"EvaAnderson","date":"2016-04-29T20:06:26.533+0000","up_votes":2,"down_votes":0,"body":"si reportas a alguien por  jugar mal, dejame decirte que estas equivocadisimo! no podes reportar a alguien por jugar mal, y menos en una normal! y tal vez en Ranked el loco esta teniendo solo un mal dia y lo vas a reportar por eso?? OMG!!!","replies":[{"poster":"Donlans","date":"2016-04-29T20:26:02.234+0000","up_votes":1,"down_votes":0,"body":"sé muy bien que no se puede, es más, hacer eso es ridículo pero la gente lo hace, o acaso me vas a decir que nunca has estado en una partida donde un grupo de jugadores empieza a pedir report a otro porque va 2/6, perdió la linea o falló el smite del barón?","replies":[{"poster":"EvaAnderson","date":"2016-04-30T12:21:06.373+0000","up_votes":1,"down_votes":0,"body":"no recuerdo haber reportado a alguien asi, es mas, cuando piden report por alguien que va mal me dan ganas de reportar a esos que estan pidiendo report al otro flaco. (no lo hago porque no es motivo de report, pero tengo ganas de hacerlo)","replies":[]}]}]}]},{"poster":"Katastrofica","date":"2016-04-29T12:26:15.080+0000","up_votes":2,"down_votes":0,"body":"Pues si, el implementar unos reportes mas limitados haria que se empieze a usar mejor, pero imagínate que acabas de reportar un troll por ir zed full mana, luego a uno por riven ap y un teemo por... que mas da, reportar a teemo vale todo, incluso si costara 3 tickets.\n\nPero después me toca un jayce supp que roba todas las kills, no se hace el piedravidente, y cuando le pides que se lo haga solo da una kill al adc enemigo y se va afk, se acaba de llevar una gran cantidad de oro que le servirá al equipo, solamente por irse (ya que tenia varios kill steal) \n\nEso si, estoy seguro de que mejor sistema que el actual, en cuanto a no spamear reportes... es mas eficiente, pero deberia de haber algo como \"El jugador al que reportaste tuvo su ban, +100 pi\" y si, es una idea que solo sirve a jugadores nuevos y que posiblemente nadie use pero... sigue compenzando el hecho de banear correctamente.\n\nPor ahora lo único que tenemos en lol es que cada vez que reportas sin motivo, haces que tus próximos reportes tengan menos importancia, que es bastante bueno, pero un jugador nuevo no tiene manera de saber como y a quien \"reportar\" despues de todo, si eres lvl bajo y te toca un smurf solo dirá \"REPORT AL YI ADC POR NO SABER QUE ES ADC\" y si, lo he visto bastante seguido en mis cuentas de nivel bajo :(\n\nEspero, Riot siga ayudando a el limpiar la toxicidad de la comunidad y, pronto lleguemos a algo mejor :( , quien sabe... quizas ALGUN DIA... vuelva el tribunal, y que solo dejen entrar a gente de buen comportamiento...\n\nSuerte.{{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"NickMachineBroke","date":"2016-04-29T17:56:48.925+0000","up_votes":2,"down_votes":2,"body":"Pensa como si Dota y LoL fueran pacientes, y tu seas su doctor, y recetas esta cura para sus enfermedades.\n\nLa misma cura no servira para los dos pacientes, porque tienen caracteristicas diferentes\n\nEn cambio, lo que si me gustaria, es que si uno se va a AFK, que corra el tiempo suficiente como para venderle todas sus cosas y el oro se reparta entre los miembros del equipo restante, como en dota y ademas se gane oro extra por el afk :P","replies":[{"poster":"Prince Y Pitto","date":"2016-04-29T18:30:55.575+0000","up_votes":3,"down_votes":1,"body":"pero piensa q los 2 pacientes tienen el mismo sistema, cuerpo, mente y los mismos problemas, la diferencia es que fisicamente se ven diferentes (Uno es rojito y el otro Azul xD)","replies":[{"poster":"NickMachineBroke","date":"2016-04-29T18:44:14.154+0000","up_votes":2,"down_votes":1,"body":"No, la verdad que no xD","replies":[]}]}]},{"poster":"Daaaaaake","date":"2016-04-29T22:25:47.957+0000","up_votes":2,"down_votes":1,"body":"viejo la idea es crear distintos juegos.. si te gusta el dota vayase a jugar dota.\nNo puedes decirle al cod que tenga las mismas ideas que el overwatch me entiendes? osea que todo juego tiene sus sistemas y modos de juego... esa es la idea de que hayan tantos diversos juegos creo yo.","replies":[]}]}