{"poster":"Dayleaf","date":"2017-10-22T22:11:09.466+0000","title":"Mal ping y desconexiones al azar","subforum":"Problemas Técnicos","up_votes":6,"down_votes":0,"body":"Buenas,\r\n\r\nNecesito ayuda con un problema de conexi&oacute;n, aparentemente y de manera aleatoria, sufro de ping alto y desconexiones sin raz&oacute;n alguna, lo extra&ntilde;o es que no parece ser ni la red ni el PC en si, sino el LoL. Puedo jugar otros juegos sin problemas, ni ping ni nada, puedo ver v&iacute;deos como siempre, pero a veces al LoL le pegan estos &quot;atracones&quot; de conexi&oacute;n que arruinan partidas, ocurren en cualquier momento del d&iacute;a, sin aviso y pueden durar desde unos pocos segundos hasta varios minutos (10 - 20). No soy muy conocedor en temas de inform&aacute;tica y eso, entonces no se que puede ser lo que ocasione el problema, lo &uacute;nico que me queda claro es que solo pasa con el LoL.\r\n\r\nGracias de antemano y un saludo.\r\n\r\n{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Renfk HS","date":"2017-10-24T19:38:14.021+0000","up_votes":1,"down_votes":0,"body":"Llevo tratando de jugar una semana, es desesperante. Contraté fibra óptica para jugar y todo iba perfecto hasta el jueves de la semana pasada... Llamé a mi proveedor y no hay ni un problema, los videos y descargas me van 10/10, pero el LoL a 16 ms y luego de repente a 2000 y luego 500 y desconecta. Deberían ya arreglarlo, por lo menos no soy la única, así que no es problema mío. Por dios, ni siquiera puedo creer que los de Riot no hayan puesto todavía atención a este gran problema UGH...\n{{sticker:sg-soraka}}","replies":[]},{"poster":"Poppy Rising","date":"2017-10-23T23:33:46.932+0000","up_votes":1,"down_votes":0,"body":"Estoy igual, nadie conectado a wifi, solo mi pc, no hay nada en segundo plano consumiendo internet, puedo jugar cualquier otra cosa, overwatch, csgo, menos lol, entro a una partida y el ping de dispara a 1000-2000ms sin razon alguna, el internet en si empieza a fallar, no carga las paginas, ni nada, saco el juego y el internet vuelve a la normalidad, no se que onda","replies":[]},{"poster":"Jockey Batds","date":"2017-10-22T23:23:30.796+0000","up_votes":1,"down_votes":0,"body":"Hay  q bueno saber q no soy la única, pues a mi tbn me pasa, aveces ha subido hasta 5 mil de ms 2 mil, aveces se desconecta sin razón alguna,  avece smis ms están bien y como q los fps bajan, se pone feo e incomodo, y eso no me pasa con otros juegos, tengo buena pc, y corro juegos mas pesados q este. Veo videos youtube de todo, y nunca veo una conexión .Otra cosa rara q me pasó es q aveces he jugado y se desconecta el moden y las lucer verdes del moden desaparecen y solo queda una de color rojo , asi como q si te apagaran el moden, y solo pasa cuando juego LOL con otros juegos, no pasa eso, Soy de Perú y lo poco q estoy informada es q, Movistar de Perú etc, sus conexiones servidores esas cosas, son malas aquí, ni sé por q pero veo q otros lugares tbn les pasa. Y estoy harta y algo deprimida por q, cuando empece a jugar LOL durante 5 meses, o 6  jamás me paso estas cosas, solo ah pasado desde q empesó eso de als guardianas estelares, desde ahí comenzó a tener problemas el juego. Y ya me está aburriendo el lol por tantos defectos. \n Ahh q incomodidad >3< !!!\n\n{{sticker:sg-ahri-1}}","replies":[]},{"poster":"R0mn","date":"2017-10-22T22:50:12.129+0000","up_votes":1,"down_votes":0,"body":"Igual ami, se me desconecta y conecta al azar. Me esta jodiendo muchisimo las partidas {{sticker:zombie-nunu-tears}}","replies":[]},{"poster":"Urgot Peronista","date":"2017-10-22T22:19:56.703+0000","up_votes":1,"down_votes":0,"body":"me pasa absolutamente lo mismo y también me sucede que el champ se queda quieto 12 segundos exactos, todo alrededor sigue igual, pero no puedo moverme. esto viene pasándome hace 3 días","replies":[]}]}