{"poster":"Supermoo9","date":"2018-07-17T08:59:55.004+0000","title":"Ohmwrecker get's rejected by player-base, ability to ignore turrets is now OP","subforum":"Gameplay","up_votes":9,"down_votes":5,"body":"{{item:3056}} gives an entire team the ability to tower dive w/o a wave. Yes it isn&#039;t the greatest item, but it is still a tanky item. Akali suddenly has the ability to negate a turret for just herself and suddenly the player-base screams &quot;OP!&quot; and &quot;UNFAIR!&quot; Riot just needs to buff {{item:3056}} by decreasing it&#039;s cost. Drop it down to 2100 and lose the CD reduction and {{item:3067}} aspect, have it build from {{item:2053}} and {{item:1028}}. Players would buy it more and complain less. It&#039;s got a good mechanic as everyone is pointing out w/Akali, it just costs too much for not worth it.\r\n\r\nAnother option for the Ohmwrecker is to give it the Zhonya&#039;s treatment. Replcace the Kindlegem with a new item like {{item:2420}} where you can get 1 use out of it but it can still build into the full item. Would also lose the Ruby Crystal and HP altogether.","replies":[{"poster":"JackMcSnipeyz","date":"2018-07-17T09:11:59.151+0000","up_votes":5,"down_votes":2,"body":"Ohmwrecker - a semi expensive item that is designed for tanks with shitty stats and long CD active.\n\nAkali - a hyper mobile assassin who only needs seconds to 1 shot you who can also tower dive you with a basic ability while being hyper mobile.\n\n\nGood comparison OP.","replies":[{"poster":"Supermoo9","date":"2018-07-17T09:30:43.739+0000","up_votes":2,"down_votes":0,"body":"All I was pointing out was that it is not a new concept. The Application is new, but negating a tower is not new in the slightest. The \"shitty\" stats are fixable if Rito actually cared (but they don't and we know it). \n\nAlso, that was some really good constructive criticism you gave, I'm impressed.","replies":[]},{"poster":"LeftyRaydy","date":"2018-07-18T15:23:52.443+0000","up_votes":1,"down_votes":0,"body":"This is exactly what I was thinking lol. If anything this just makes the item look worse when Akali gets it free haha. I bet the OP thought he was clever with this discussion lol.","replies":[]}]},{"poster":"BLACK REALM GOD","date":"2018-07-17T09:45:33.169+0000","up_votes":1,"down_votes":0,"body":"dont you dare change my ohmwrecker. it's carrying me to diamond.","replies":[{"poster":"Supermoo9","date":"2018-07-18T01:58:06.254+0000","up_votes":1,"down_votes":0,"body":"I would love to see what champs/builds you use. Genuinely interested. I think it's a cool item but I can never justify it in serious gameplay","replies":[{"poster":"BLACK REALM GOD","date":"2018-07-18T02:44:52.617+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Supermoo9,realm=NA,application-id=3ErqAdtq,discussion-id=ToIuZjEj,comment-id=00020000,timestamp=2018-07-18T01:58:06.254+0000)\n>\n> I would love to see what champs/builds you use. Genuinely interested. I think it's a cool item but I can never justify it in serious gameplay\n\nit's all there. op.gg it.\n\nthat being said... i am only bronze v/bronze iv. though when i play for realsies (meaing i use ohmwrecker and a few other items) i tend to climb very quickly.\n\nhttp://na.op.gg/summoner/userName=black+realm+god.","replies":[]}]}]},{"poster":"Critmaster Garen","date":"2018-07-18T02:13:52.989+0000","up_votes":1,"down_votes":0,"body":"this isnt comparable to ohmwrecker.\n\nohmwrecker is a 300 health and 50 armor item.\n\nwhy would i buy such an item, when i can get a 400 health and 60 armor item for almost the same price?\n\n\ni can either buy an item that allows me to disable a turret for like 2 shots, or i can buy an item that has better defensive stats and just lets me absorb those two extra shots, while also helping me out in every other situation than turret dives. the choice is obvious.\n\nohmwrecker is also not on a 20 second cooldown and doesnt allow to drop turret aggro multiple times in a fight.","replies":[{"poster":"Akali is SO HOT","date":"2018-07-18T02:26:04.491+0000","up_votes":1,"down_votes":0,"body":"Because you want to be edgy and buy a bad item","replies":[]}]},{"poster":"AlienPrimate","date":"2018-07-17T09:39:10.057+0000","up_votes":1,"down_votes":0,"body":"If you look at the value of the stats on Ohmwrecker it is actually really gold efficient without the active.  The reason nobody gets it is because it is an item that pushes a winning team even further ahead but offers defensive stats.  You build defense when losing, not when winning.  To make the item useful it needs to be given the option to either buff allied towers or disable enemy towers depending on what you target.  Giving an ally tower something like the storm barrier from nexus siege would go a long way to putting it in a good spot.","replies":[{"poster":"Aptest","date":"2018-07-17T13:58:44.482+0000","up_votes":1,"down_votes":0,"body":"Ohmwrecker is not bought because by the time you complete the item champions that buy defensive stats can tank the tower anyway with their alternative more slot efficient purchase and champions that buy offensive stats are put behind by purchasing the wrong stat and champions that could rush the active are getting it too late for it to matter and if the active could be rushed it would cause a major QQ as a dive everywhere meta is evolved around it. \n\nbut i guess some fringe play styles could evolve around this item.","replies":[]}]},{"poster":"LightningShado","date":"2018-07-17T13:45:27.987+0000","up_votes":1,"down_votes":0,"body":"True. It makes no sense.","replies":[]}]}