{"poster":"Guerrero lXl","date":"2018-09-24T00:04:45.336+0000","title":"Mal emparejamiento para las flex","subforum":"Jugabilidad, balance y narrativa","embed":{"description":null,"url":"https://drive.google.com/file/d/1s6bLja9DtMl0HZN9zb9gKwO2FepRNhl6/view?usp=sharing","image":"https://lh6.googleusercontent.com/6VJ_pvhMORe71_o4oe5pJGT527XGGi20T5Y4x7t_Ngz4qSu725VClUVPrtE=w1200-h630-p"},"up_votes":4,"down_votes":1,"body":"Hola comunidad y personal de Riot. Tuve la necesidad de iniciar esta discusi&oacute;n por aqu&iacute; porque hoy termine muy frustrado nuevamente por el (a mi modo de verlo) mal emparejamiento en partidas Flex.\r\n&iquest;A qu&eacute; me refiero?\r\nB&aacute;sicamente, cuando uno entra a una Flex, lo emparejan con gente de MMR similar al nuestro en Flex. Pero ac&aacute; hay algo que no est&aacute; contemplado (y si lo est&aacute; recomiendo trabajar en lo que voy a explicarles). Hay personas que no jugan tanto a Flex, tal vez que en todo el a&ntilde;o no dedican mas de 20 partidas a esto, prefieren las rankeds Solo Q (clasificatoria cl&aacute;sica). Entonces, cuando se les da por jugar Flex, se los empareja con gente de MMR de Flex y pasan cosas como lo que pueden observar en el link adjunto. Ah&iacute; se puede ver un incre&iacute;ble desbalance de nivel de jugadores. Claro est&aacute;, que probablemente en Flex tengamos similar MMR, porque posiblemente ese Diamante 5 (en Clasificatoria cl&aacute;sica) no dedico para nada tiempo a las Flex, pero no quita que el tiene un nivel incre&iacute;blemente diferente a los platas con los que yo jugada, incluso a mi, un simple Oro 4.\r\nEl equipo enemigo ten&iacute;a un Diamante 5, un Platino 5, un Platino 3, Oro 4 y 5. Mi equipo un Platino 5, un Oro 4 (yo, a punto de descender jajaja), un plata 1 y dos plata 3. O sea, esa partida estaba perdida antes de empezarla, la diferencia de nivel de jugadores, por masque el MMR de Flex sea similar, es incre&iacute;blemente frustrante para mi equipo.\r\nMe gustar&iacute;a que me digan si ya tienen esto en cuenta y van a pensar la forma de solucionarlo. Si van a poner platinos en un team que del otro lado tambi&eacute;n los haya en igual magnitud por favor, prefiero esperar 1 min 30 seg y jugar 35 minutos una partida que puedo ganar o sentir que hice todo lo posible y fue una partida peleada y no entrar en 10 seg. a una partida perdida desde el inicio por una incre&iacute;ble diferencia de niveles.\r\nMe gustar&iacute;a saber que opina tambi&eacute;n la comunidad al respecto, estoy volcando esta frustraci&oacute;n aqu&iacute;, no por una o dos partidas de este tipo. A diario me encuentro con situaciones similares que hacen que me frustre, juego una partida de estas y se me quitan las ganas de jugar por el resto del d&iacute;a, porque ped&iacute; 35 minutos en algo que nunca podr&iacute;a ganar, las personas se enojan y buscan un culpable dentro del equipo, pero tal ves, no est&aacute; toda la raz&oacute;n de la derrota.\r\nMuchas gracias para quien se tom&oacute; el tiempo de leer semejante post, esperando pronta respuesta de Riot, saludos cordiales, Federico E. Perez","replies":[{"poster":"Wyman","date":"2018-09-24T15:29:39.139+0000","up_votes":2,"down_votes":0,"body":"Estaba en promo a Diamante en flex, y me pusieron 2 oros ( 4 y 5 en flex Y en soloq) y 1 unranked en mi team, y el otro team tenía todos platinos y diamantes. Estaba jugando a la mañana, imagino que por eso fué... Pero fué bastante frustrante te juro.-\n\nEn parte por eso me gusta flex, porque sirve para practicar más que las normales, ya que, son más \"serias\" y te puede tocar contra gente de un elo mucho mayor al tuyo. Desde que estoy en platino 1 me toca contra diamantes y masters, a veces challengers, de soloq y de flex, como no hay muchos jugando en ese mmr me parece que toca así, pero a veces te puede pasar como me pasó en esa promo. Una espada de doble filo. Pero boe si sos bueno vas a carrear a los goldies/silverinos/platimancos/diamancos o del elo menor que sean los que te toquen según tu elo.\n\nCuando iba subiendo en flex me pasaba mucho de que en mi team habían platas porque tenían un premade oro, re hartante, pero había que mejorar para carrear. \n\nEn fín, me parece que está bueno el sistema y que no debería ser cambiado. Yo lo usé para mejorar bastante. Te dejo mi experiencia como humilde consejo. Saludos.","replies":[{"poster":"Guerrero lXl","date":"2018-09-24T23:00:04.687+0000","up_votes":1,"down_votes":0,"body":"En realidad no quiero que dejen de ponerme gente de mayor nivel de juego, solo quiero que los distribuyan mejor. ¿Se entiende la diferencia?\nQue si de un lado va a haber un Diamante 5 (Solo Q) y dos Platinos (Solo Q), que de mi lado haya algo similar, no solo gente Plata. A eso me refiero, porque tal vez uno pueda aprender algo mientras le rompen toda la base en 18 minutos, pero que pase partida por medio, es frustrarte. La ultima (hoy por la mañana) estaba 5/1/3 , gankeaba y llevábamos kills. Pero al minuto mi línea (que acababa de dejarle un kill mas el farm y ayudado a golpear la torre) moría en mano a mano, y no los culpo, contra un Platino 3 mano a mano, seguro que muero bastante, tienen otro nivel del juego, otro entendimiento, farmean mejor, se buildean mejor en base a su team y el enemigo, pikean con mas entendimiento del juego. Pero de todas maneras gracias por tu comentario.\nEn resumen, solo creo que deben emparejar mejor el MMR de las Solo Q dentro de las Flex y viceversa, para una partida mas pareja, donde  realmente perdemos porque de a poco fueron tomando mejor los objetivos, o tu TOP murió muchas veces por coordinación de ganks y no porque lo mató 10 veces free un Diamon.","replies":[]}]},{"poster":"Haruhi","date":"2018-09-24T04:50:52.980+0000","up_votes":2,"down_votes":1,"body":"Esto puede sonar horrible pero se animan a dejar de llorar?\n\nDesde un principio todo el mundo sabia que esto iba a pasar y tambien se sabia que esta cola iba a estar llena de gente que jugaba con sus amigos de elo bajo...\n\nSin ofender pero si los stompea una persona de su elo se quejan de que su team era horrible, si los stompea un unranked se quejan de que el emparejamiento esta mal o que es smurf, si les pasa por arriba alguien que en otra cola tiene mas elo ya lloran porque riot no toma nada en cuenta pero si ustedes stompean son los p**os amos...\n\nTe aviso que en SoloQ tambien hay muchisima gente que el flex nos lleva muchas divisiones... y es algo normal que siempre va a pasar...\n\nAparte ya estamos a fines de season, por lo cual es normal ver a gente de mucho elo (o almenos mas que el promedio) jugando en otras colas para llegar lo mas alto posible y conseguir las recompensas de ambas colas....\n\nY por ultimo... Deberias agradecer jugar contra gente que te stompea... asi aprendes a jugar (y no lo digo de mala, yo soy un silver bien manco al cual pasan pasando por arriba), nadie aprende a jugar o mejora si siempre se enfrenta contra lo mismo... jugar contra gente mejor que uno implica que te castiguen cada fallo, por lo cual aprendes a solucionar estos y a adpatarte a diferentes situaciones...","replies":[{"poster":"Guerrero lXl","date":"2018-09-24T14:42:55.104+0000","up_votes":1,"down_votes":0,"body":"Entiendo tu punto de vista y lo respeto. Pierde un poco de sentido para mi, viniendo de un Plata. Si me decís que sos Platino y gracias a que te golpearon por años llegaste ahí, bueno... pero no es el caso. De todas maneras te entiendo, no estoy de acuerdo. Pienso diferente, creo que Riot debería tratar de que uno tenga la sensación de que su desempeño puede ayudar en la partida. Dejé ahí un link nuevo, otra partida con gran diferencia de niveles. En un momento iba 5/1/3 o algo así. Y aun así no pude hacer nada, porque por mas que gankeaba, las lineas con platinos y diamantes los reventaban a mis aliados, y no los culpo, yo en su lugar estaría igual, no creo poder ganarle a un Diamante 5. Lo que digo es que uno se esfuerza 35 minutos en una partida que no la va a perder por falta de desempeño o energía, si no, por el simple hecho de que el enemigo tiene una increíble diferencia de nivel. Y si, podrás aprender mucho, no me molesta en una normal jugar contra un equipo de profesionales, pero cuando tu ascenso de liga depende de que ganes, es molesto esto.","replies":[{"poster":"Haruhi","date":"2018-09-24T14:59:30.294+0000","up_votes":1,"down_votes":0,"body":"Enserio te entiendo, a todos nos da bronca que nos stompeen pero el juego es asi y hay que adaptarse\n\nEn todo caso juga en premade de 5 e intenta equiparar la diferencia de nivel con una buena coordinacion en team","replies":[{"poster":"Guerrero lXl","date":"2018-09-24T23:04:46.709+0000","up_votes":1,"down_votes":0,"body":"Si, eso lo hago, juego con mis amigos y cuando perdemos entre amigos, normalmente no me frustra, porque entendemos que es nuestra culpa en la totalidad. El problema es si juego solo. De hecho, no quiero que cambien la modalidad ni nada. Solo hago referencia a que emparejen también el MMR de Solo Q dentro de las Flex y viceversa ¿Qué sería esto? Que si en un lado tenemos 1 Diamon y dos Platinos (de Solo Q), no coloques puros Platas (Solo Q) del otro, que haya similitud de MMR, que de los dos lados hayan Platinos y Diamons de Solo Q en similar magnitud y la partida va a ser super interesante. Que si soy el Plata que va a morir un par de veces mas porque me toco un Diamon en frente, no me preocupe que del otro lado va haber un plata contra otro Platino o Diamon que va a estar en mi misma situación.\nDe todas maneras, aprecio mucho tu comentario, muchas gracias, saludos.","replies":[]}]}]}]},{"poster":"Perturbado2","date":"2018-09-24T00:51:39.774+0000","up_votes":1,"down_votes":0,"body":"Yo me las tomo para trolear xD. pero es lógico que sea así el elo de solo Q no tiene nada que ver con las flex y viceversa. Si no quieres que te pase juega soloQ. que es mas parejo, si no juega en team que para eso se diseño las Flexq.","replies":[{"poster":"Guerrero lXl","date":"2018-09-24T23:00:52.110+0000","up_votes":1,"down_votes":0,"body":"Sería genial que las pruebas raras (trollear) lo hagas en normals jajajaja. Te deben reportar seguido así.","replies":[{"poster":"Perturbado2","date":"2018-09-25T02:33:27.591+0000","up_votes":1,"down_votes":0,"body":"al termino de trolear lo uso para decir que pruebo campeones  con los cuales no me siento cómodo jugando en la main ej: ninguno de los campeones que use en esta cuenta los jugué en la main, va  por ahí alguno en alguna partida pero rara vez. En las flex hago algo similar entro y juego campeones que no uso con frecuencia. No me refería trolear al termino de entro y fedeo o flameo, eso jamas lo hago, que eh tenido partidas malas seguro, como todos, pero no de ese tipo de trolls.","replies":[{"poster":"Guerrero lXl","date":"2018-09-27T03:09:33.978+0000","up_votes":1,"down_votes":0,"body":"Ahhhh jajajaj ahora queda más claro. Yo también me doy el gusto de jugar campeones con los que no soy experto. No los pruebo en Flex, digamos que los juego 1ero en modo herramienta de practica, varias normals, luego Flex y por ultimo Solo Q.","replies":[]}]}]}]},{"poster":"Guerrero lXl","date":"2018-09-24T14:36:43.872+0000","up_votes":1,"down_votes":0,"body":"https://drive.google.com/file/d/1gxaJVOrpu2VmxlikrUnzzGMqGNeYniky/view?usp=sharing\nAquí les dejo otro caso. Partida por medio me está sucediendo. Deberían realmente trabajar en esto.","replies":[]}]}