{"poster":"KzG Arconte","date":"2016-10-07T13:20:31.593+0000","title":"¿es viable usar azir???","subforum":"Guias y consejos","up_votes":1,"down_votes":2,"body":"acabo de jugar 2 partidas con azir, ayer y hoy y en ambas me quedes sin palabras. \n\nel daño de la Q solo lo hace un soldado, creo que le disminuyeron el rango del desplazamiento de la q tambien, tambien el rango para sacar el soldado tiene menos rango (?), se sigue bugeando en las paredes... la e ya no tira al aire al campeon que impacta, sus soldados ya no meten tanto, etc etc, ademas de que la w ya no mete daño a la torre y con suerte le quitas un 0,0000000000000001% de vida a la torre por basico. ( podrias estar todo el dia pegandole XD ) \n\n\nahora la pregunta es.  ¿vale la pena seguir jugando azir? hace 4 meses que no veo a faker, dopa, bj etc, etc usando azir en soloQ. ( incluso en profecionales que ahora lo domina es syndra ) \n\n\nPD: NO ES UNA QUEJA ES UNA PREGUNTA.","replies":[{"poster":"Makostrike","date":"2016-10-07T14:23:42.869+0000","up_votes":3,"down_votes":0,"body":"Si es viable, lo que pasa es que el \"meta\" de ahora lo dejó fuera. Ahora a todos les dio por Syndra, cuando hace dos meses nadie la quería. Es verdad, a Azir le llego un nerf fuerte hace unos 3 o 4 parches, precisamente porque estaba \"demasiado fuerte\", cuando en realidad era porque estaba popular, siempre ha sido un campeon fuerte. Es la lógica de Riot, en un tiempo más nerfean a Syndra u otro champ popular. No te parece extraño que hayan bufado a Riven justo cuando re lanzaron la skin de campeonato ¿Que paso? magia Riven con la skin en la mayoria de las partidas XD.\n\nAhora, el tema importante: Azir no es un campeón fácil, de hecho es de los más difíciles del juego. No es solo levantar los soldados y tirar la Q, hay que considerar el posicionamiento, hay que saber kitear cuando estas atacando con los soldados (que es lo mas dificil porque te toma mucha concentración), el timing correcto para todas la variantes del Shurima Shuffle a la distancia que sea, los insec bajo torre o los que dividen al equipo enemigo, atravesar bien las paredes, saber cual es el rango real de la Q para escapes y como aumentarlo dependiendo del como E+Q, tener conciencia de que es un papel, saber cuando o no entrar, etc. Al ser tan difícil es normal que no todos los que lo juegan puedan sacarle el 100% ya que estas pendiente todo el rato de hacer cosas que mecanicamente son complejas XD. Es verdad todo depende de las manos, pero nada que la practica no pueda alcanzar. \n\nEl es mi main y creo que es el único campeón con el que me siento seguro, me costo mucho entender y de hecho la maestria 5 que le saque hace tieeeeeempo fue a base de derrotas XD, pero me fije más en sus debilidades que fortalezas y ahí mejoré con el (Igual hace mucho no lo uso). Si antes pegaba más, pero siempre hay formas de equiparar.\n\nIntenta jugarlo con velocidad de ataque (AS)  y verás como cambia la cosa. Si usas las botas berserker más el diente de nashor y AS en runas más el escalado de la W facil puedes llegar a 1.7 - 2.0 de velocidad de ataque (a eso suma los items que creas conveniente) y la ult pierde toda relevancia, salvo para cosas tácticas. Ahora si es por experimentar y estas frente a un AP suma el {{item:3091}} \n\nTen por seguro que un tiempo más lo van a buffar y lo más probable es que le han un rework XD de algo que ellos mismos provocaron. En League hay campeones que necesitan más ajustes que Azir y Riot ni los toca... osea, les pega con una aguja de coser... {{champion:238}} {{champion:157}} {{champion:96}} \n\nSaludos!!!","replies":[]},{"poster":"Borriic II","date":"2016-10-07T19:57:35.069+0000","up_votes":1,"down_votes":0,"body":"Es viable? pues si, supongo que si, todo con la suficiente habilidad y practica es viable\n\nes recomendable? NOOOOO, en el tiempo que te toma dominar al 100% un campeon mecanicamente complicado, debil en el meta y con builds poco eficientes te puedes subir a diamante facilmente jugando Yasuo/zed/irelia/master Yi o puedes dominar 2 o 3 campeones de mecanicas un poco mas sencillas pero que a la larga te conviene mas al darte versatilidad como jugador\n\na mi modo de ver jugar azir actualmente es una perdida de tiempo, pero esta en ti y en los objetivos que te pongas a fin de cuentas, si quieres llegar a ser el mejor azir del mundo... pues juega azir, si tus objetivos son mejorar como jugador o levantar elo, piensa en decantar por otros personajes :) \n\nsaludos :)","replies":[{"poster":"KzG Arconte","date":"2016-10-09T14:47:32.871+0000","up_votes":1,"down_votes":0,"body":"jajaja estaba esperando esta respuesta... ME ARREFIERO AL CAMPEON MEN NO SI UNO SABE USARLO O NO. PUEDES IR CON BRAND APRETAS 2 TECLAS Y MATAS 5 SOLO POR LO FUERTE Y ROTO QUE ESTA ACTUALMENTE. azir en su tiempo bajaba 90% de la vida de 1 Q de  sus soldados, ahora esa q con suerte quita un 10% de vida... a eso me arrefiero, si sigue siendo viable utilizarlo por lo nerf que esta. en su tiempo en dimaond quedaba 15/0 si queria, pero ahora con suerte matas a alguien...","replies":[{"poster":"Borriic II","date":"2016-10-10T15:36:40.399+0000","up_votes":1,"down_votes":0,"body":"Entonces si ya sabe la respuesta para que pregunta? :P {{champion:17}} {{item:3077}} \n\nobvio que si agarras un brand un malza o alguna de esas mierdecillas rotas te fedeas y carreas todo (a menos que otro de tu team fedee mas a un rival) \n\npero ya te respondi, para jugar competitivamente no es viable azir, cualquiera de las bestias de mid te revienta, a menos que tengas como objetivo llegar a ser el mejor azir del mundo, le pongas mucho esfuerzo y tal y manejes todas las mecanicas a la perfeccion, eventualmente vas a jugar contra gente con menos manos que vos y aunque ellos tengan un zed van a fallar hasta la ulti y como vos vas a ser bueno les ganaras la linea igual y de algun modo mataras al adc rival antes que el te mate de un critico porque tenes un mago de papel con poco alcance y mecanicas complicadas, pero si sos una persona normal (no asiatico) seguramente no vas a viciar a esos extremos y lo mas sano es jugar personajes mas amigables con el meta :)","replies":[]}]}]},{"poster":"L9 Letalis Umbra","date":"2016-10-07T15:11:17.372+0000","up_votes":1,"down_votes":1,"body":"Todo es viable si sabes usarlo","replies":[{"poster":"KzG Arconte","date":"2016-10-07T15:38:47.823+0000","up_votes":1,"down_votes":1,"body":"haz usado azir? usalo 1 partida y vuelves a este post. {{sticker:slayer-pantheon-popcorn}} ","replies":[{"poster":"L9 Letalis Umbra","date":"2016-10-07T15:47:46.451+0000","up_votes":1,"down_votes":0,"body":"Si, si he usado a Azir, inclusive después de los nerfeos, e igual sigue siendo viable si lo usas con cabeza","replies":[]}]}]},{"poster":"wattefak","date":"2016-10-07T15:10:44.723+0000","up_votes":1,"down_votes":0,"body":"Para mi antes dependia de tu habilidad, daba igual quien te salia en linea (vease viktor, lb, syndra)... Pero con los nerfs quedo en el campeon que te saquen y en la composición general. No dejo de ser viable pero si es mas \"riesgoso\"","replies":[]},{"poster":"EH AMEO KE TE PA","date":"2016-10-07T14:39:20.625+0000","up_votes":1,"down_votes":0,"body":"creo que esta bien para un campeon que en late con rylai y diente de nashor te baja medio equipo con 5 ataques basicos","replies":[]},{"poster":"Yazuò","date":"2016-10-07T14:04:41.959+0000","up_votes":1,"down_votes":0,"body":"Te explicare lo siguiente azir es un campeón con mecánicas superiores a la de muchos ap que van a la mid lane, es del grupo de los Ap que tienen un early de mierda y en late te hacen mierda a todo el equipo, piensa lo siguiente  has usado a viktor? ese campeon no es similar a azir pero sus mecanicas son igual de avanzadas lo primero que azir no tiene un early muy estable y en late sirve mucho ya que tienes mucho daño y tus soldados hacen daño AOE","replies":[]},{"poster":"Mecha Sétt","date":"2016-10-07T14:03:57.272+0000","up_votes":1,"down_votes":0,"body":"Hola, parte de la base que TODO campeon es viable, solo depende del a itemizacion, estilo de juego, y de la composición. \n\nRespondiendo directamente. Si, es viable. A pesar de tener un mal early, en late sigue siendo un poderoso campeon.","replies":[]},{"poster":"iNGENiO","date":"2016-10-07T13:36:20.655+0000","up_votes":1,"down_votes":0,"body":"Todo depende de tus manos! :D","replies":[]},{"poster":"ZanahoriaAsesina","date":"2016-10-07T13:27:40.900+0000","up_votes":1,"down_votes":0,"body":"https://www.youtube.com/watch?v=tjXp_DtpG8M","replies":[]},{"poster":"TheSystruction","date":"2016-10-08T00:49:03.783+0000","up_votes":1,"down_votes":1,"body":"azir hasta que nerfeen el rylai sigue siendo muy viable en silver y en oro, puesto que es un seguro de vida de cara al  juego tardío, en plata es fundamental llevar asquerosidades de late asi, porque las partidas suelen ser largas y tediosas","replies":[]},{"poster":"Crazy lyrics","date":"2016-10-07T13:48:40.264+0000","up_votes":1,"down_votes":1,"body":"la verdad que es el mid con peor win rate, daño de soldados disminuido en early, duracion de la ulti muy reducido, nerf al nashor y futuro nerf a la rylai (entre otros nerf) creo que hay mejores opciones ahora\nazir estaba muy fuerte pero lo nerfearon demaciado","replies":[]}]}