{"poster":"KzG Arconte","date":"2018-04-04T09:31:01.393+0000","title":"2 dudas.","subforum":"Problemas Técnicos","up_votes":2,"down_votes":0,"body":"Hace tiempo que tengo este problema, tengo entendido que no solo me sucede a mi. \r\n\r\nAntes de que salgan los minions en la grieta del invocador tengo 400 fps ( es un ejemplo) luego de que salen tengo 250, llegan a linea y tengo 200 y mientras mas minutos pasan en la partida mas disminuyen esos fps, 180,160,140, 80,50 como minimo... &iquest;por que sucede esto? no me ocurre en ningun otro juego. \r\n\r\nLo otro es que desde hace un par de meses ( las desconexiones de servidores y otras cosas que sucedieron en argentina y chile) he notado un lag en el juego, puedo tener 0 de ms pero hay una sensacion de retardo en cualquier accion que yo efectue, hacer un click para que el personaje camine tara 0,5s en responder el personaje es casi indetectable... pero siempre lo presiento. como dije esto me sucede desde que sucedio eso de que en argentina estaban teniendo problemas con el servidor, que se cayo y no recuerdo que habia ocurrido. &iquest;por que razon puede afectarme a mi? tengo amigos que les sucede lo mismo.","replies":[{"poster":"Zevko","date":"2018-04-04T09:45:00.840+0000","up_votes":2,"down_votes":0,"body":"La verdad sobre lo de los fps no se mucho, te recomendaria que los límites a 60 o 80 dado que es alpedo tenerlos a 400 innecesariamente, seguramente limitarlos te solucione el problema\n\nY esto ami casi nunca me pasa, pero el otro dia yo estaba jugando y sentía como un \"delay\" y tenía 15 MS, es el servidor pero realmente por lo menos ami no me pasa muy seguido.","replies":[{"poster":"KzG Arconte","date":"2018-04-04T12:08:52.581+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Tziiah,realm=LAS,application-id=X54mVVp0,discussion-id=XacnfMFm,comment-id=0000,timestamp=2018-04-04T09:45:00.840+0000)\n>\n> La verdad sobre lo de los fps no se mucho, te recomendaria que los límites a 60 o 80 dado que es alpedo tenerlos a 400 innecesariamente, seguramente limitarlos te solucione el problema\n> \n> Y esto ami casi nunca me pasa, pero el otro dia yo estaba jugando y sentía como un &quot;delay&quot; y tenía 15 MS, es el servidor pero realmente por lo menos ami no me pasa muy seguido.\n\nsli 1080ti, i7 8700. aun sacando el sli persiste el problema ( por si es el tipico problema del sli en los juegos) leí por algun lado que se debia  a que mientra mas tiempo transcurria mas datos se almacenaban \"en la partida\" entonces habia que procesar mas cosas y bla,bla xD. pero no se... la verdad lol siempre ha tenido perdida de fps absurdos, es un juego en donde aunque lo bajes a low el problema sigue.","replies":[{"poster":"HitmannKiller","date":"2018-04-04T12:16:19.923+0000","up_votes":1,"down_votes":0,"body":"capas son una imitación  de la salada","replies":[]}]}]},{"poster":"xShadow10","date":"2018-04-04T17:47:25.870+0000","up_votes":1,"down_votes":0,"body":"·   Lo de que tu personaje 'tarde' en reaccionar siendo que tus MS se mantienen bajos y estables puede deberse en realidad a la \"Pérdida de paquetes de datos\". Si querés saber mas de esto, te dejo [la página de Riot que explica sencillamente esto](http://lagreport.las.leagueoflegends.com/es/lag) (lo que está abajo del video que te aparece apenas entras a la página).\n\n·   Además, usando [esa misma página](http://lagreport.las.leagueoflegends.com/es/), te sugiero que chequees qué tan bien ha estado funcionando tu Internet (puedes revisar las estadísticas de 30 días, 7, o el mismo día de hoy si es que ya has jugado alguna partida).\n\n ·   Fijate si la pérdida de paquetes que te mencioné se encuentra por debajo del 1% (que es lo recomendado). Cuanto mas cerca de 0%, mejor se supone que está yendo todo.\n\n·   Por último te dejo [una imagen de mis estadísticas](https://imgur.com/a/ltopu), para que veas de lo que hablo. \n\nSuerte!","replies":[{"poster":"KzG Arconte","date":"2018-04-05T23:26:08.769+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=xShadow10,realm=LAS,application-id=X54mVVp0,discussion-id=XacnfMFm,comment-id=0002,timestamp=2018-04-04T17:47:25.870+0000)\n>\n> ·   Lo de que tu personaje &#x27;tarde&#x27; en reaccionar siendo que tus MS se mantienen bajos y estables puede deberse en realidad a la &quot;Pérdida de paquetes de datos&quot;. Si querés saber mas de esto, te dejo [la página de Riot que explica sencillamente esto](http://lagreport.las.leagueoflegends.com/es/lag) (lo que está abajo del video que te aparece apenas entras a la página).\n> \n> ·   Además, usando [esa misma página](http://lagreport.las.leagueoflegends.com/es/), te sugiero que chequees qué tan bien ha estado funcionando tu Internet (puedes revisar las estadísticas de 30 días, 7, o el mismo día de hoy si es que ya has jugado alguna partida).\n> \n>  ·   Fijate si la pérdida de paquetes que te mencioné se encuentra por debajo del 1% (que es lo recomendado). Cuanto mas cerca de 0%, mejor se supone que está yendo todo.\n> \n> ·   Por último te dejo [una imagen de mis estadísticas](https://imgur.com/a/ltopu), para que veas de lo que hablo. \n> \n> Suerte!\n\n200megas con fibra optica, en todos los videojuegos me va 10/10, el unico problema es en league of legends, le pregunte a varios amigos (ex compañeros de escuela), en total son 7 y todos tienen esa \"sensacion\". ademas uno que otro vive en otra ciudad y tiene otro proveedor de internet. agregando que aveces pregunto en partidas y uno que otro de ves en cuando ( si es que no ignoran...) responden que si.  todo esto lo volvi a ratificar luego de que cree el post.","replies":[]}]}]}