{"poster":"GoldenBossOp","date":"2017-01-02T05:52:14.824+0000","title":"Por gente como esta la comunidad esta siendo peor","subforum":"Comportamiento del jugador","up_votes":4,"down_votes":6,"body":"TODO EMPEZ&Oacute; CON INSULTOS A NUESTRO JG QUE ERA UNA MUJER (a lo cual le dijo &quot;Ah, ya entiendo porque eres tan fracasada, eres una chica&quot;), TAMBI&Eacute;N FLAMEABA A TODO EL EQUIPO Y NOS ACUSABA DE SER &quot;GORDOS , FRACASADOS Y V&Iacute;RGENES SIN VIDA SOCIAL&quot; (Perd&oacute;nenme por desubicarme al poner esto pero lo hago para que vean algunos de los insultos de este jugador) Y MUCHOS OTROS GRAVES MOTIVOS MAS... Riot por favor tienen que hacer algo con este tipo de personas, por culpa de gente como esta  la comunidad del LOL cada vez esta siendo peor  y se pierde de una hermosura de  juego como es el League of Legends. Gracias. De parte de un lolero mas...{{summoner:1}}","replies":[{"poster":"Kyousuke","date":"2017-01-02T05:55:27.099+0000","up_votes":1,"down_votes":1,"body":"lo hacen, para algo esta el botón de reporte :D si lo reportas el sistema lo terminara baneando por que gente asi suele repetir lo mismo siempre, mientras que no reporten nunca habrá castigo, cada día sale un post en el foro de \" rito pls me banearon permanentemente y no hice nada\", lo unico que debes hacer es silenciarlo, tragarse la partida sea derrota o victoria y al final abrir un reporte y pedir a tu team y al rival que lo reporten por flammer.","replies":[{"poster":"Darkrer","date":"2017-01-02T06:04:42.043+0000","up_votes":1,"down_votes":1,"body":"si pero algunos de los bans son simplemente mas tiempo de cola en las partidas","replies":[{"poster":"Kyousuke","date":"2017-01-02T06:41:42.511+0000","up_votes":1,"down_votes":1,"body":"WTF!!!???? donde viste eso??? el BAN es que no podes ingresar a tu cuenta, lo de cola en la partida es el LEAVERBUSTER y eso te agarra automático cuando salís de muchas partidas, son 2 cosas totalmente distintas","replies":[{"poster":"Darkrer","date":"2017-01-02T07:15:23.336+0000","up_votes":1,"down_votes":1,"body":"usualmente le sancionan no 1 sino varias partidas","replies":[{"poster":"Kyousuke","date":"2017-01-02T07:32:39.961+0000","up_votes":1,"down_votes":1,"body":"repito eso es el LEAVERBUSTER, el baneo y el leaver son 2 cosas totalmente distintas y separadas","replies":[{"poster":"Darkrer","date":"2017-01-02T08:12:08.399+0000","up_votes":1,"down_votes":0,"body":"ok entonces fue mi error, pero aun asi las sanciones son poco seberas XD","replies":[{"poster":"9081913DEL1","date":"2017-01-02T10:16:57.538+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Darkrer,realm=LAS,application-id=PJAKt7ph,discussion-id=84fRTx88,comment-id=000000000000000000000000,timestamp=2017-01-02T08:12:08.399+0000)\n>\n> ok entonces fue mi error, pero aun asi las sanciones son poco seberas XD\n\nGenio de la vida, como puedes decir que son poco severas, si no sabes cuales son las sanciones?\n\nSaludos.","replies":[]}]}]}]}]}]}]}]}