{"poster":"TTryHard","date":"2017-08-14T21:47:29.059+0000","title":"porque tanto odio a los mains riven yasuo?","subforum":"Comportamiento del jugador","up_votes":6,"down_votes":2,"body":"digo acabo de perder una partida por una vayne con lag, nos estompearon y todo fui riven contra una poppy y le gane linea y se puso a insultarme a mi por usar riven solo por decir &quot;almenos gane linea xd&quot; y empezo a decir &quot;las rivens nunca pierden&quot; &quot;main riven, tipico ni&ntilde;o rata &quot;, &quot; tienes 10 a&ntilde;os &quot; y la verdad no es primera vez que sufro este tipo de acoso, que acoso no puedo jugar tranquilo el campeon que yo quiera si recibir acoso? acaso no seran ellos los rata que insultan a una persona solo por llevar un campeon? quiero respuestas haber si una de estas personitas me dice porque llegan a odiar a siertos personas por usar tal champ","replies":[{"poster":"MotaLove","date":"2017-08-14T22:11:48.164+0000","up_votes":4,"down_votes":0,"body":"Como dice abajo \"Sunrise Jayce\", eso que dijo es tipico de main yasuo y riven frustrado, todavia tengo la foto de a la main riven platino 3 que le rompi el cu%& con una cuenta lvl 1 en un uno vs uno.\n\nSe supone que no le ganaba nadie a el segun lo que decia.\n\nEl odio no es a los champs, es a los jugadores que lo usan, en la vida me gano un yasuo o riven en linea, el odie viene a la actitud que tienen siempre, a ellos 2 NUNCA, PERO NUNCA, los vas a matar porque jugaste bien, SIEMPRE LOS MATAS PORQUE TIENEN LAG, siempre se les laguea en el momento que los matas, pero despues matan a un compañero y estan tirando maestria.\n\n\"Tienen lag\", pero para tirar flash reaccionan en 0.1 segundo, cuando les ganas, todos los champs con los que les ganas estan rotos segun ellos, son flamers a morir, si pierden la culpa siempre es la culpa de su jg, o de su team, y en tu equipo, nunca te va a tocar un yasuo o riven bueno, siempre van a ser los tipicos 0/8 que te arruinan todas las partidas...","replies":[{"poster":"Maddïe","date":"2017-08-15T20:18:02.211+0000","up_votes":1,"down_votes":0,"body":"maaal jajajaja aunque una vez me toco un yasuo que no era toxico y carreo, nos cagamos de risa y lo raro era que no tenia skin ni m7 o.o","replies":[]}]},{"poster":"MorochoCandente","date":"2017-08-14T21:53:33.833+0000","up_votes":4,"down_votes":0,"body":"Se trata asi a los mains riven, yasuo, vayne, thresh, por que la mayoria de las personas que usan estos campeones (no todos) siempre suelen ser toxicos, ademas se dice que son campeones \"sin mecanicas\" \"faciles\" y esas cosas.\n\nVos no tenes que darle importancia a lo que digan, sabes las veces que me insultaron por carrear con garen? muchisimas.\n\nSimplemente al que te insulta, mute y segui la tuya, no dejes que te afecte, despues de todo, los campeones estan para usarse.","replies":[{"poster":"WhiteMax","date":"2017-08-15T18:47:35.335+0000","up_votes":2,"down_votes":0,"body":"Te falto añadir el tema de que \"siempre\" toca en el equipo al \"main\" 0/7 y al equipo rival el main real 11/0.","replies":[]},{"poster":"Deucalion","date":"2017-08-17T11:29:27.495+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=MorochoCandente,realm=LAS,application-id=PJAKt7ph,discussion-id=UkltdOhc,comment-id=0000,timestamp=2017-08-14T21:53:33.833+0000)\n>\n> Se trata asi a los mains riven, yasuo, vayne, thresh, por que la mayoria de las personas que usan estos campeones (no todos) siempre suelen ser toxicos, ademas se dice que son campeones &quot;sin mecanicas&quot; &quot;faciles&quot; y esas cosas.\n> \n> Vos no tenes que darle importancia a lo que digan, sabes las veces que me insultaron por carrear con garen? muchisimas.\n> \n> Simplemente al que te insulta, mute y segui la tuya, no dejes que te afecte, despues de todo, los campeones estan para usarse.\n\najajja los que maineamos {{champion:412}}  somos flamers por la mas sencilla razón gastan el p....{{summoner:4}}( y 9 de cada 10 jugadores solo creen que la lampara mete el escudo)  cuando tienen la lampara alado o enfrente y eso nos tiltea  porq luego te dicen {{champion:412}}  de m.... ni una p.... lampara","replies":[]}]},{"poster":"juuby","date":"2017-08-14T22:15:33.492+0000","up_votes":3,"down_votes":0,"body":"https://image.prntscr.com/image/1bUXCLFtTYCBAQy5MTxLeQ.png\nimagina el odio que me como yo con esos champs :c","replies":[{"poster":"DarkSpartan117","date":"2017-08-15T00:05:55.341+0000","up_votes":1,"down_votes":1,"body":"xd","replies":[]}]},{"poster":"kiuhm","date":"2017-08-14T22:21:57.665+0000","up_votes":1,"down_votes":1,"body":"Por mi parte, la mayoria de las rivens con las que me enfrente tenian una personalidad bastante particular. Si les ganas te dicen \"no podes 1 vs 1, sos malisimo\", si te ganan se burlan. \nEl problema que les veo es que se atribuyen a si mismos las habilidades de este campeon, es decir, ellos creen que el daño que causan, que su capacidad para escapar o tankear es resultado de sus maravillosas manos y que el campeon no tiene nada que ver.","replies":[{"poster":"Main Thresh s4","date":"2017-08-15T02:34:45.758+0000","up_votes":1,"down_votes":0,"body":"En realidad, en campeones como yasuo o riven el mayor burst* viene de la cancelacion de animaciones y los combos bien ejecutados, dale algun de los 2 champ a un \"novato\" por asi decirlo y vas a ver que no es l so mismo que alguien que sabe como cancelar una animacion o que sabe un buen como de cualquier champ","replies":[{"poster":"kiuhm","date":"2017-08-15T16:36:13.584+0000","up_votes":2,"down_votes":0,"body":"Si pero que una riven se escape aprentando QQQ E y te espamee maestria como si fuera una azaña que solo un challenger pueda ejecutar, te das cuenta del nivel de madurez que pueden llegar a tener sus mains.","replies":[{"poster":"Main Thresh s4","date":"2017-08-16T16:10:10.668+0000","up_votes":1,"down_votes":0,"body":"Y si te pica tanto que alguien te spamee la maestria creo que el problema es tuyo XDD ponerse a chasear una riven es medio sharo","replies":[{"poster":"kiuhm","date":"2017-08-16T16:42:17.530+0000","up_votes":1,"down_votes":0,"body":"Recien me fije en tu historal, sos main riven pls... Que te voy a decir?","replies":[{"poster":"Main Thresh s4","date":"2017-08-19T19:42:49.027+0000","up_votes":1,"down_votes":0,"body":"Main riven? solo jugue las 10 primeras para que la acc no se quede sin marco, no ando subiendo maestrias ni perdiendo el tiempo en eso. Una cosa es usar bien un campeon y otra usarlo 99 de 100 partidas","replies":[]}]},{"poster":"Deucalion","date":"2017-08-17T11:36:01.154+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=KRAZYAIM2,realm=LAS,application-id=PJAKt7ph,discussion-id=UkltdOhc,comment-id=0004000000000000,timestamp=2017-08-16T16:10:10.668+0000)\n>\n> Y si te pica tanto que alguien te spamee la maestria creo que el problema es tuyo XDD ponerse a chasear una riven es medio sharo\n\nno pica ya te pone enfermo porq 9 de cada 10 jugadores que usan riven y yasuo tienen la M7 una cosa es sacarla una sola vez otra es esquivar una skill y spamearla como la risa de {{champion:117}}  es molesta","replies":[]}]}]}]}]},{"poster":"Sunrise Jayce","date":"2017-08-14T22:06:50.163+0000","up_votes":2,"down_votes":1,"body":"porque como no les pueden ganar en la fase de lineas, dicen \"sin mecanicas\" o \"champ noob\", aun asi como dijo el morocho no les des atencion, que ellos no sepan como funciona el juego y los champs no es algo que te deba importar ;)","replies":[]},{"poster":"M I X X T R Ø T","date":"2017-08-15T08:47:26.798+0000","up_votes":1,"down_votes":0,"body":"Yo hice que una Riven Top se vaya AFK con mi Kassadin (? Si,  countereo Rivens yendo Kassadin (Ya no lo juego) \nY tiltee a un Yasuo \"supp\" agresivo yendo Vayne,  es genial la sensación","replies":[]},{"poster":"Lastrom","date":"2017-08-15T03:13:24.076+0000","up_votes":1,"down_votes":0,"body":"No les des bola, no pasa nada, simplemente mutealos o diles ''jaja'' y mutealos después xD. Ojalá que la comunidad deje de ser así, pero bueno, somos quienes somos ¿no?","replies":[]},{"poster":"TSW Rorschach","date":"2017-08-15T01:58:22.331+0000","up_votes":1,"down_votes":0,"body":"De lo normal que he podido ver suele ser:\n-Consideran que el campeón es fácil para matar.\n-Consideran que todos los que usan al campeón son escoria que usan campeones específicos para creerse pros mientras te refriegan en la cara que te están ganando.\n-Odian el kit de habilidades del campeón en sí (Yasuo con el muro de viento, el tornado, su pasiva de criticos, etc :v )\n\nCon respecto al primer punto, Riven es muy buena robándote la barra de vida sin mucho esfuerzo, pero tiene lo suyo y para muchos resulta divertida de jugar y aprender, especialmente cuando dueleas contra otro luchador {{champion:114}} {{champion:39}}. Sin embargo, por la primera parte, muchos dicen que es un campeón fácil. \n\nCon respecto al segundo punto, los campeones que decís (Yasuo, Riven, etc) tienen ese estereotipo fijado por culpa de muchos jugadores del \"Tipico tóxico que se cree pro incluso cuando no hizo nada o él mismo tira abajo la partida\". Entonces, cada vez que te encontrás con un campeón que ves, no es realmente que odias al personaje, sino **a la persona que lo usa**. \n\nEn conclusión, si te gusta jugar Riven, jugá Riven y listo. Gente así va a haber siempre y por desgracia, no es solo con esos champs que se la agarran xd a mi me re flammeaban cuando usaba Bardo porque \"Qué mecánica tiene eso si solo usa los básicos?\". A este punto creo que hay acoso hasta por si tu pj es rubio o morocho :v","replies":[]},{"poster":"Mobius One","date":"2017-08-14T23:01:29.165+0000","up_votes":1,"down_votes":0,"body":"Porque los jugadores de esos campeones están acostumbrados a infligir gran cantidad de daño con mucha facilidad, por ende cuando les sale mal suelen alterarse (porque claro, si es fácil, ¿Por qué me cuesta? De seguro es porque le ayudaron...) entonces se frustran. He visto por ahí que Riot puso una estadística de los campeones que se van más afk, y más alto de todo estaba Riven, por una gran diferencia. Supongo que, por el motivo que dije más porque con Riven es dificil remontar, deciden tirar la toalla fácil. Yasuo en cambio... va 0/11 pero con una ulti ya puede marcar gran diferencia.","replies":[]}]}