{"poster":"YH1Palestine","date":"2017-06-25T21:43:48.925+0000","title":"New elements masters","subforum":"Story, Art, & Sound","up_votes":3,"down_votes":11,"body":"we already have a master for wind {{champion:157}}  and for earth {{champion:163}}  but when will we have a master for dark, light, water, fire. like a real master not fire champ like brand and my idea to do like you did with rakan and xayah get two new champs in the same time and they could be brothers like light and dark every one took a way of there father and mother and the story should be like an angel love a demon adn got those cildren that had a human what looks like a human body with the power of dark and light it will be really intersting ihope everybody support this idea.\nthanks for reading.\n\n\nediting: because many started talking about dark magic we are not talking about magic we are talking about darkness and lightness not a kind of magic and about that we get a new due champions is not really a abd idea because many started playing the due cahmpions in bot and everybody love how they have so many mechanics togather and lol started making a big diffrence in cahmpions lore and abilites and i think change and making new ideas and much more mechanics would just make the game even better  and i dont think all champions should have 4 abilites and 1 passive thats is not important but every champ should be in the same skill level and power as others and that doesnt stand  by the number but the skill needed for the champ and the power but we need to get b to the topic about a new due is a great idea and bringing the world of demons and angels to the world of lol would be amazing","replies":[{"poster":"GreenLore","date":"2017-06-26T00:34:48.858+0000","up_votes":5,"down_votes":0,"body":"Overall we have humans who use the elements and elementals themselves for a lot of elements already(even if you include some nonstandard elements,like lightning,poison or even pure magic)\nI mean in terms of elemental beings one could say that we have {{champion:34}}  {{champion:63}} {{champion:427}} {{champion:57}} {{champion:40}}  {{champion:54}} {{champion:56}} {{champion:101}} what we'd be missing would be a water elemental though\n\nAnd in terms of element-users that aren't elementals themselves we've got\n{{champion:1}} {{champion:268}} {{champion:69}} {{champion:85}} {{champion:127}} {{champion:99}} {{champion:267}} {{champion:13}} {{champion:163}} {{champion:157}} {{champion:238}} {{champion:143}} \n\nAnd {{champion:82}} used to be our metal mage.\n\nSo in a way we've got your light&dark duo already with {{champion:99}} and {{champion:238}}","replies":[{"poster":"Fasmodey","date":"2017-06-26T01:16:25.445+0000","up_votes":2,"down_votes":0,"body":"I like comparing Lux and Syndra to each other. They feel like opposite characters.\n\nSyndra is dark mage of LoL IMO.","replies":[{"poster":"GreenLore","date":"2017-06-26T08:45:34.752+0000","up_votes":1,"down_votes":0,"body":"I wouldn't see Syndra as a dark mage,because the only thing dark about her abilities are her orbs.\nShe is more like a telekinesis mage,as almost all of her abilities are about moving things with her mind(the orbs are merely there so that she always has something to move)","replies":[{"poster":"Fasmodey","date":"2017-06-26T10:53:19.160+0000","up_votes":1,"down_votes":0,"body":"Dark mages are sometimes not about literally darkness, but looking. Darkness and purple are usually related. Black and purple are color of darkness. Which 2 colours Syndra has.\n\nAnd Im pretty sure she does her telekinetic powers with her W skill. Telekinesis is high likely not the only thing she can do. Spheres are not in her gameplay just because of \"clarity problems\".","replies":[{"poster":"GreenLore","date":"2017-06-26T11:40:05.499+0000","up_votes":1,"down_votes":0,"body":"Her W,E and R all use telekinesis.\nW holds/throws something\nE pushes away\nR throws even more stuff at the enemy.\nAnd in the lore she even lets a castle float.\n\nAll of these things are typical telekinetic abilities.\nMeanwhile the only thing that connects Syndra to darkness is the fact that her abilities are purple&black.\nBut by that logic we could say that Ryze and Xerath are water mages.\n\nAnd I don't know how her spheres would be only there for clarity reasons.She has them so that she always has something to manipulate.\nIt's similar Azir,who has the ability to summon soldiers,because he can't fill the fantasy of a unit commander if he doesn't have units to command.","replies":[{"poster":"Fasmodey","date":"2017-06-26T12:29:06.113+0000","up_votes":1,"down_votes":0,"body":"> R throws even more stuff at the enemy.\n\nIt is saying like Lux is also a telekinesis mage because how she throws projectiles too or like saying Taliyah is not an earth mage because she throws rocks with her mind.\n\nTelekinesis mage is never a thing. Many mages can use telekinesis. It is a super generic description which doesn't give a single hint about how a mage works.\n\nIt is also possible that Syndra doesn't use typical telekinesis. I mean, she high likely uses her ''dark magic'' to manipulate other materials, so It is not a direct telekinetic power.\n\nIn other say, she covers a material with her dark magic, then she bends the dark magic, and material is controlled by her dark magic. Her W in gameplay is exactly this.\n\nShe is known for her spheres, not her telekinetic powers. Xerath is not known for his telekinetic powers either, but his arcane magic.","replies":[{"poster":"GreenLore","date":"2017-06-26T17:04:53.833+0000","up_votes":1,"down_votes":0,"body":"Taliyah,Lux and Annie all use their respective element in all of her skills(even tibbers is burning) and their lores talk about them using Earth/Light/Fire respectively.\n\nHowever the only thing that links Syndra and darkness is the color of her skill effects\nIf her effects were red would she be a fire mage?No of course she wouldn't.\n\nAnd nothing in Syndras lore talks about manipulating darkness,so there isn't really a reason to believe that she uses dark magic.\n\nAnd Xerath has telekinetic powers in the lore,but they aren't part of his skillset or core to his character and just because he can do it,doesn't mean we can't have a champ who specializes in this ability,because Xerath can also use fire in the lore,yet we have Brand and Annie in the game.\nMeanwhile Syndra uses telekinese in her main lore(letting a castle float,killing her master with a telekinetic push) and it makes up 3 of her 4 active skills(and the last one exists to support the other ones)","replies":[{"poster":"Euthenaasia","date":"2017-06-26T22:30:47.402+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=GreenLore,realm=EUW,application-id=6kFXY1kR,discussion-id=Ndn1gMqv,comment-id=0005000000000000000000000000,timestamp=2017-06-26T17:04:53.833+0000)\n>\n> Taliyah,Lux and Annie all use their respective element in all of her skills(even tibbers is burning) and their lores talk about them using Earth/Light/Fire respectively.\n> \n> However the only thing that links Syndra and darkness is the color of her skill effects\n> If her effects were red would she be a fire mage?No of course she wouldn&#x27;t.\n> \n> And nothing in Syndras lore talks about manipulating darkness,so there isn&#x27;t really a reason to believe that she uses dark magic.\n> \n> And Xerath has telekinetic powers in the lore,but they aren&#x27;t part of his skillset or core to his character and just because he can do it,doesn&#x27;t mean we can&#x27;t have a champ who specializes in this ability,because Xerath can also use fire in the lore,yet we have Brand and Annie in the game.\n> Meanwhile Syndra uses telekinese in her main lore(letting a castle float,killing her master with a telekinetic push) and it makes up 3 of her 4 active skills(and the last one exists to support the other ones)\n\nLux is also capable of invisibility in the lore.","replies":[{"poster":"GreenLore","date":"2017-06-26T22:54:24.288+0000","up_votes":1,"down_votes":0,"body":"Yes,she does it by manipulating the light around her,so she is still a full light mage.","replies":[]}]},{"poster":"Fasmodey","date":"2017-06-26T18:02:24.296+0000","up_votes":1,"down_votes":0,"body":"Neither pushing people with purple coloured magic is telekinesis, nor manipulating dark spheres through enemies. Only thing I would say that looks telekinetic about Syndra is her W, and even it probably works in way I descripted above,  which is not a direct telekinesis. And floating a castle is something I imagine as a colossus W skill of her. I don't know about you tho.\n\nAs I said, if unleashing spheres through enemies is telekinesis, then using fireballs is also telekinesis.\n\nIf she is not a dark magic user, I would never call her a telekinesis mage either.","replies":[{"poster":"GreenLore","date":"2017-06-26T19:10:32.535+0000","up_votes":1,"down_votes":0,"body":"Of course pushing people falls under telekinesis as well.\nTelekinesis is the ability to move things around through psychic/magic powers.\nSo pushing someone with magic is a form of telekinesis.(she also used something like this in the lore,when she killed her mentor,as she slammed him against the wall)\nhttps://vignette1.wikia.nocookie.net/powerlisting/images/f/fd/Force-push-o.gif/revision/latest?cb=20131122175830\n\n\nAnd what makes Syndras ult something related to telekinesis is that we know that she moves her orbs with telekinesis,because her W does exactly that(and it even talks about using telekinetic powers)\nSo  her ult is basically just a more extreme version of her W.\n\n\nOverall I'd like to know what would you'd expect from a telekinesis mage?\nI would expect a telekinesis mage to be able to to hold opponents,throw them,knock them away and to hurl objects at them.\nWhich is exactly what Syndra does.","replies":[{"poster":"Fasmodey","date":"2017-06-26T19:19:47.291+0000","up_votes":1,"down_votes":0,"body":"I would expect having no dark spheres and other stuffs from a telekinesis mage.\n\nA full telekinesis mage would make it without notice. Like there wouldn't be purple energy around of an item when she uses her powers.\n\nYoda's force is exactly what I'm talking about. If Yoda used a purple light in there, I wouldn't say It is telekinesis. Syndra would use a sphere, or waves made of ''dark magic'' to push Darth Sidious.\n\nIt means she uses her purple/dark/unknown/ magic to manipulate materials.","replies":[{"poster":"GreenLore","date":"2017-06-26T21:46:34.872+0000","up_votes":1,"down_votes":0,"body":"So essentially your problem is that her skills have a visual effect that accompanies them and that she can make orbs(which like I said is mostly there so that she always has something to toss at the enemy)\n\nTbh.I think that the effects are mostly done for clarity reasons and because it gives skins more opportunities.\nAfter all it'd be rather hard to dodge invisible attacks(or really difficult to see if she carries a minion behind her) and would be really lame if she had invisible skill effects,as skins couldn't really change much.","replies":[{"poster":"Fasmodey","date":"2017-06-26T21:52:09.189+0000","up_votes":1,"down_votes":0,"body":"If she did not have dark spheres, they wouldn't even exist in her splash art and login screen animation.\n\nI don't think It is because of clarity.","replies":[{"poster":"GreenLore","date":"2017-06-26T22:53:58.890+0000","up_votes":1,"down_votes":0,"body":"Of course she has dark spheres and even her magic is depicted as purple energy.\nI'm just saying that the reason why they decided to give her these effects is because of gameplay reasons.","replies":[{"poster":"Fasmodey","date":"2017-06-26T23:28:42.656+0000","up_votes":1,"down_votes":1,"body":"I'm not saying you're wrong but we can't be sure about that. :p\n\nMay be it is, may be it is not. But still, Syndra's primary power comes from her spheres. Spheres are identity of her magic. Telekinesis can only be his secondary power.","replies":[]}]}]}]}]}]}]}]}]}]}]},{"poster":"Lady Faceless","date":"2017-06-26T11:40:42.741+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=GreenLore,realm=EUW,application-id=6kFXY1kR,discussion-id=Ndn1gMqv,comment-id=000500000000,timestamp=2017-06-26T08:45:34.752+0000)\n>\n> I wouldn&#x27;t see Syndra as a dark mage,because the only thing dark about her abilities are her orbs.\n> She is more like a telekinesis mage,as almost all of her abilities are about moving things with her mind(the orbs are merely there so that she always has something to move)\n\nI don't remember who post it, but s/o had the theory that Syndra's dark spheres could be black holes. In the same theard, however, the theory got instant debunked, since even a black hole as small as one of her sphere woul be able to swallow the whole Runeterra.\nI still like the thought/theory that Syndras power is actully manipulating gravity. Telekinsesis has a lot of similiarities, but isn't exactly the same thing.","replies":[]}]}]},{"poster":"xScarfy","date":"2017-06-26T09:22:33.026+0000","up_votes":1,"down_votes":0,"body":"Nami can be considered a water element-user.","replies":[{"poster":"GreenLore","date":"2017-06-26T09:41:03.810+0000","up_votes":1,"down_votes":0,"body":"Dang I knew I forgot someone.\nAdded her to the list now;)","replies":[]}]},{"poster":"Electro522","date":"2017-06-26T01:16:37.957+0000","up_votes":1,"down_votes":0,"body":"How are {{champion:69}},{{champion:13}}, and {{champion:143}} \"element-users\"? I wouldn't really consider poison, arcane energy, and plants an element.","replies":[{"poster":"GreenLore","date":"2017-06-26T08:43:40.238+0000","up_votes":1,"down_votes":0,"body":"Thats why I said \"even if you include some nonstandard elements\".\nNot everyone would see these things as elements,but its not uncommon for games to classify these things as their own elements.","replies":[]}]}]},{"poster":"YH1Palestine","date":"2017-06-25T21:44:25.521+0000","up_votes":1,"down_votes":0,"body":"really guys plz support my idea i would love to see a new amazing story in lol","replies":[{"poster":"Lady Faceless","date":"2017-06-26T09:24:35.525+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=joindevil,realm=EUW,application-id=6kFXY1kR,discussion-id=Ndn1gMqv,comment-id=0000,timestamp=2017-06-25T21:44:25.521+0000)\n>\n> really guys plz support my idea i would love to see a new amazing story in lol\n\nConsidere this: Maybe your idea isn't that good?\nWe already got a dual-realase with our love birds, so another dual-realase won't happen in near future.\nAs well we have a lot of elemenatlist mage and spirits, so their are other tropes to cover. \nThe Kayle and Morgana Dual-VGU could go for the light/dark thematic, however I hope Riot keeps their old lore in mind and focus more on the order vs freedom aspect. And even this confirmed VGUs won't happen in near future.\nWe shouldn't forget that their still big parts of the Lore aren't up-to-date as for Noxus (hopefully with the Urgot VGU), Ionia, Bandle City, Void and Freljord could need a touch-up too. Bilgewater and Shurima felt unfinished as well.\nRiot is currently trying to combine Champion realases and VGU with world-building/lore updates (see Xayah and Rakan - Vastaya Introducition, Galio VGU - Demacia Update, Piltover and Zhaun Lore Update with WW VGU and Camille...).\nAlso, even if I don't like every lore update (Targon lore is still BS), in this and last year the got some well-written stories as well with [The Weakest Heart](http://universe.leagueoflegends.com/en_GB/story/camille-weakest-heart/) and[ For Demacia](http://universe.leagueoflegends.com/en_GB/story/for-demacia/) as examples.\n\nTL;DR: Other region/world-building as whole is more important rn, and the idea itself is just boring and generic.","replies":[]}]},{"poster":"Linna Excel","date":"2017-06-26T00:12:13.540+0000","up_votes":3,"down_votes":0,"body":"I thought Janna was the wind master.","replies":[{"poster":"YH1Palestine","date":"2017-06-26T19:57:16.153+0000","up_votes":1,"down_votes":0,"body":"janna use wind magic if you read her lore","replies":[]}]},{"poster":"Kairoptra","date":"2017-06-25T21:45:55.814+0000","up_votes":1,"down_votes":0,"body":"Water: {{champion:267}} \nDon't know what to tell you concerning the fire, since you won't consider {{champion:63}} :/\nNice idea with light and dark, tho.","replies":[{"poster":"YH1Palestine","date":"2017-06-25T21:48:21.357+0000","up_votes":1,"down_votes":0,"body":"i concider him but he is just burned i mean he is on fire we nee dw human who can controll fire not made from fire if you understrand what i mean like we yasuo will fly from win and taliyah will di efrom a big rock pushed over him but brand will keep burning xD","replies":[{"poster":"YH1Palestine","date":"2017-06-25T21:48:43.227+0000","up_votes":1,"down_votes":0,"body":"but the most important is the dark and light brothers","replies":[{"poster":"Kindlejack","date":"2017-06-25T23:22:10.613+0000","up_votes":2,"down_votes":0,"body":"My favourite mid matchup:\n{{champion:99}}  v {{champion:238}}","replies":[{"poster":"nosafterburn","date":"2017-06-25T23:36:09.828+0000","up_votes":3,"down_votes":2,"body":"that's my favorite ship next to {{champion:91}}  x {{champion:202}} .   I can still picture them now\n\n {{champion:91}} : This is my favorite knife.\n\n{{champion:202}} : You should see what i could do with it in 4 strokes...\n\n\n\nEdit: yeah.... srry. this isn't creepy at all {{sticker:zombie-brand-facepalm}} ","replies":[{"poster":"Fasmodey","date":"2017-06-26T01:17:13.353+0000","up_votes":2,"down_votes":0,"body":"ugh wut :d","replies":[]}]}]}]},{"poster":"Euthenaasia","date":"2017-06-26T22:32:45.731+0000","up_votes":1,"down_votes":0,"body":"Then what is {{champion:1}} ? She is considered one of the most powerful magic users next to Syndra due to her power still growing as she ages.","replies":[]},{"poster":"Placentas","date":"2017-06-26T00:41:14.489+0000","up_votes":1,"down_votes":0,"body":"Annie","replies":[]},{"poster":"Kairoptra","date":"2017-06-25T21:59:32.647+0000","up_votes":1,"down_votes":0,"body":"Oooooooh I getcha {{sticker:slayer-pantheon-thumbs}}","replies":[]}]},{"poster":"Kindlejack","date":"2017-06-25T23:21:14.546+0000","up_votes":2,"down_votes":0,"body":"{{champion:1}}","replies":[]}]},{"poster":"Sancre","date":"2017-06-26T11:21:10.880+0000","up_votes":1,"down_votes":0,"body":"Fire {{champion:1}} {{champion:63}} {{champion:102}} \nStarfire (Fire^2) {{champion:136}} \nEarth {{champion:163}} {{champion:268}} \nCristal (Earth^2) {{champion:44}} {{champion:72}} \nAir {{champion:40}} {{champion:157}} \nWater {{champion:267}} {{champion:420}} {{champion:105}} \nNature {{champion:57}} {{champion:427}} {{champion:143}} \nIce {{champion:34}} {{champion:20}} {{champion:201}} {{champion:113}} {{champion:127}} \nPoison {{champion:69}} \nThunder {{champion:85}} \nArcane {{champion:13}} {{champion:101}} \nLight {{champion:99}} {{champion:131}} {{champion:89}} {{champion:10}} \nDarkness {{champion:56}} {{champion:238}} {{champion:28}} {{champion:25}} \nBlood {{champion:8}} {{champion:266}} \nTime {{champion:26}}\nPain {{champion:17}} \n\n\nIsn't what you are suggesting a champion like Dante from the last DMC? Nephilim born of an angel and a demon, powers of light and darkness","replies":[{"poster":"Moonboy65","date":"2017-06-26T13:11:12.889+0000","up_votes":1,"down_votes":0,"body":"you forgot a few more\nIce {{champion:22}} {{champion:48}} \nMusic {{champion:37}} \nEarth {{champion:54}} {{champion:421}} {{champion:33}} {{champion:72}} \nPoison {{champion:29}} {{champion:6}} {{champion:96}} {{champion:27}} \nThunder (should be renamed to Electricity) {{champion:106}} {{champion:53}} \nShould have a Dark Magic element {{champion:134}} {{champion:25}} {{champion:7}} {{champion:30}} {{champion:38}} {{champion:90}} {{champion:110}} {{champion:83}} {{champion:45}} {{champion:161}} \nDarkness {{champion:120}} {{champion:429}} {{champion:91}} {{champion:35}}\nMetal {{champion:82}} \nFire {{champion:103}} \n\nthose are just my guesses for thse elements","replies":[{"poster":"GreenLore","date":"2017-06-26T19:16:28.482+0000","up_votes":1,"down_votes":0,"body":"Morde doesn't use metal anymore.","replies":[{"poster":"YH1Palestine","date":"2017-06-26T19:56:14.074+0000","up_votes":1,"down_votes":0,"body":"it need to be a human who was born with the abilite of darkness and not some creature and ahri doesnt have the abilite of fire and if we talk about elements we cant say magic like janna but a mster like yasuo you never say yasuo use air magic but use his body to controll air and how is azir an earth master he is suppose to be a god for poeple and controll them not controll the earth","replies":[{"poster":"GreenLore","date":"2017-06-26T21:47:45.746+0000","up_votes":1,"down_votes":0,"body":"Azirs soldiers are made of sand(he doesn't control actual people),thats why he was listed as an earth mage.\n\nAlso you yourself used Yasuo as an example for a wind champ.","replies":[]},{"poster":"Sancre","date":"2017-06-26T21:03:37.159+0000","up_votes":1,"down_votes":0,"body":"Azir controls sand magic to a level so high that it can make thousands of forms out of it and controll them all, and even rebuild a city. Isn't that an earth mage?\n\nThe ability of darkness from the moment of being born is another way to say Syndra in my opinion, while lux is the one born with light\n\nAbout the void, they seem to use something different to magic, so I wouldn't categorize them as dark elemental magic users.","replies":[]}]}]}]}]},{"poster":"Killaburn","date":"2017-06-26T21:20:23.627+0000","up_votes":1,"down_votes":0,"body":"the one elemental use that we dont have are: paper master,fungimancer,necromancer,hair power and steel elementalist","replies":[]},{"poster":"Ralanr","date":"2017-06-26T19:28:41.807+0000","up_votes":1,"down_votes":0,"body":"Annie is your fire master.","replies":[]},{"poster":"Digielf","date":"2017-06-26T05:28:19.133+0000","up_votes":1,"down_votes":0,"body":"we already have champions for every element and some elements got more than 1","replies":[]},{"poster":"Gîn san","date":"2017-06-26T01:05:22.458+0000","up_votes":1,"down_votes":0,"body":"sounds interesting {{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"Duckies124","date":"2017-06-25T21:56:08.297+0000","up_votes":1,"down_votes":0,"body":"Wouldn't{{champion:99}}  be the Master of light since she could control it but I don't know if she can control sun light like{{champion:89}} moon light{{champion:131}} or star light{{champion:16}} {{champion:136}}","replies":[{"poster":"YH1Palestine","date":"2017-06-25T22:03:26.250+0000","up_votes":1,"down_votes":0,"body":"nice exempel on lux but we cant count moon and sun light because i dont mean like that a kind of light but like lux but i wanted to make a great story also","replies":[{"poster":"YH1Palestine","date":"2017-06-25T22:11:26.635+0000","up_votes":1,"down_votes":0,"body":"and i wanted to be like the light is using his power for evil and the champion cn say liek *light makes people trust me ....i hate that it makes me mad* but the dark can be a fighter trying to get his brother back to good and say *dark isnt evil it can be good also* or it can be brothers who cancel each others because light cancel dark.","replies":[]}]}]},{"poster":"zed 413","date":"2017-06-25T21:56:49.415+0000","up_votes":1,"down_votes":0,"body":"i like this idea :D","replies":[]}]}