{"poster":"BEST RIVEN plz","date":"2017-10-25T18:04:38.182+0000","title":"problemi in game","subforum":"Aiuto e supporto","up_votes":1,"down_votes":0,"body":"sto scrivendo questo post, quindi con iternet fuonzionate, mentre in game continua a disconnettersi e riconnettersi. quindi perder&ograve; il game quindi mi reportano e tutto perch&egrave;?? boh...","replies":[{"poster":"Saibbo","date":"2017-10-25T18:06:56.535+0000","up_votes":1,"down_votes":0,"body":"Prova a guardare questo : http://euw.leagueoflegends.com/it/news/riot-games/editorial/confronta-la-tua-connessione-con-il-rapporto-lag\n\nOppure scarica l'\"Hextech Repair Tool\" che magari ti può aiutare e ultima risorsa mandare un ticket al supporto.","replies":[{"poster":"BEST RIVEN plz","date":"2017-10-25T18:17:21.892+0000","up_votes":1,"down_votes":0,"body":"Non è un problema id lag mio ( ne sono sicuro al 100%) questo problema era gia successo, capita casualmente e non riesco a muovermi, vedo/non vedo i champion , vedo i minions non moiono all'improvviso o si teleportano, compro oggetti ma non li compra.. \nAvevo gia disinstallato e reinstallato tutto ma sembra che il problema sia tornato.\nAd esempio se adesso starto un altro game funziona senza problemi, è proprio una cosa che succede a caso senza motivo..","replies":[{"poster":"Saibbo","date":"2017-10-25T18:23:02.604+0000","up_votes":1,"down_votes":0,"body":"si e' probabilmente un problema di perdita di pacchetti, leggi l'articolo e vai su : https://lagreport.euw.leagueoflegends.com/it/ controlla ti dice tutto sulla connessione, se non hai drop di FPS, non e' altro. Potrebbe essere soltanto che hai il firewall che blocca la connessione, personalmente non mi viene altro in mente.","replies":[{"poster":"BEST RIVEN plz","date":"2017-10-25T18:31:40.644+0000","up_votes":1,"down_votes":0,"body":"sono in game ora e fuonziona a meraviglia....\nnon me lo spiego\n","replies":[{"poster":"Saibbo","date":"2017-10-25T18:40:49.737+0000","up_votes":1,"down_votes":0,"body":"Magari può succedere che in certi orari c'e un alto numero di gente che si connette nella tua zona (magari qualcuno in casa tua che si connette al modem) che satura la rete e crea la perdita di pacchetti o comunque rallentamenti","replies":[{"poster":"BEST RIVEN plz","date":"2017-10-25T18:55:26.339+0000","up_votes":1,"down_votes":0,"body":"boh, può essere, proverò a controllare meglio anche se mi sembra strano visto che non ho di questi problemi con altri giochi tipo overwatch.. \n\ngrazie mille per l'aiuto :) :)","replies":[]}]}]}]}]}]}]}