{"poster":"KageNoOkami","date":"2017-08-30T00:48:25.076+0000","title":"Die Elo-Hölle existiert.","subforum":"Champions & Gameplay","up_votes":6,"down_votes":22,"body":"Durch einige versaute Placement Matches hatte ich das Vergn&uuml;gen, gegen und mit Bronze-Spielern spielen zu d&uuml;rfen. Ich selbst spiele ausschlie&szlig;lich KhaZix, ich brauche mein Team also dringender als sie mich, denn alleine rei&szlig;e ich gar nichts, wenn das Gegnerteam koordiniert spielt und ich keine isolierten Ziele finde. \r\n\r\nJedes Matchmaking war reinstes Russisch Roulette. Ich selbst hatte kaum Einfluss auf einen Sieg oder eine Niederlage, da keine Wards gesetzt wurden, permanent geflamet  oder gefeedet wurde. Es kam nur auf eines an: Welches Team erwischt die wenigsten Feeder. \r\n\r\nMit sehr viel Gl&uuml;ck erwischte ich 2-3 Runden einigerma&szlig;en gute Teammates, die ich in der Lage war zu carrien. Sie waren nicht gut, aber haben einigerma&szlig;en safe gespielt. \r\n\r\nIch selbst bin momentan in Gold 5 und merke, wie leicht ich ein Spiel nach dem anderen gewinne, weil mein Team mit mir harmonisiert und wei&szlig; was es tut. \r\n\r\n\r\nEigentlich m&ouml;chte ich nur darauf aufmerksam machen, dass einige BronzeSpieler die keine Lust haben viel Zeit in das Spiel zu investieren, f&uuml;r eine l&auml;ngere Zeit dem Zufall ausgeliefert sind, insofern sie nicht Duo-Queuen k&ouml;nnen. In einer h&ouml;heren Elo hat der einzelne Spieler einen weitaus gr&ouml;&szlig;eren Impact auf den Ausgang eines Spiels als in niedriger Elo. Ich wei&szlig; nicht wie, aber es ist unfair f&uuml;r die guten Spieler die absolut nichts f&uuml;r ihr Versagen k&ouml;nnen, und irgendwann Quitten weil sich das einfach niemand geben m&ouml;chte. \r\n\r\n\r\nDazu kommt die Tatsache, wie asozial viele dieser BronzeSpieler sind. Mein Beileid an all die Spieler die in der Elo-H&ouml;lle gefangen sind.","replies":[{"poster":"Alekra","date":"2017-08-30T03:23:02.905+0000","up_votes":7,"down_votes":1,"body":"Wer muss auch bei solchen Titeln kichern?","replies":[{"poster":"Sirrkas","date":"2017-08-30T08:17:55.527+0000","up_votes":2,"down_votes":1,"body":"Beim Titel nicht.","replies":[{"poster":"Alekra","date":"2017-08-30T14:06:53.840+0000","up_votes":1,"down_votes":0,"body":"Naja solange du was zu kichern hast, ist doch alles im grünen Bereich :p","replies":[]}]},{"poster":"KageNoOkami","date":"2017-08-30T07:06:49.228+0000","up_votes":1,"down_votes":14,"body":"Also ich muss ja kichern wenn ich mir dein Ranking so ansehe.","replies":[{"poster":"Qbert","date":"2017-08-30T08:07:49.424+0000","up_votes":5,"down_votes":1,"body":"mit nem Smurf schreiben, aber salty sein ... du bist nicht besser als die Leute, die du versuchst anzuprangern ^^","replies":[{"poster":"KageNoOkami","date":"2017-08-30T08:13:52.347+0000","up_votes":2,"down_votes":11,"body":"Doch... doch ich denke schon, lieber Qbert.","replies":[{"poster":"Qbert","date":"2017-08-30T08:15:33.705+0000","up_votes":7,"down_votes":2,"body":"du schaffst es wirklich problemlos, dich selbst ins Aus zu manövrieren, Hut ab!","replies":[]}]}]},{"poster":"HHaie tabbian","date":"2017-08-30T09:44:15.032+0000","up_votes":2,"down_votes":0,"body":"Und ich darf dann laut lachen, wenn ich mir deinen Rang angucke?","replies":[]},{"poster":"Dreadlord Mike","date":"2017-08-30T13:03:37.093+0000","up_votes":1,"down_votes":0,"body":"Muss ich auch wenn ich deines ansehe :P","replies":[]}]}]},{"poster":"XenesisCH","date":"2017-08-30T08:16:37.291+0000","up_votes":5,"down_votes":0,"body":"> Eigentlich möchte ich nur darauf aufmerksam machen, dass einige BronzeSpieler die keine Lust haben viel Zeit in das Spiel zu investieren, für eine längere Zeit dem Zufall ausgeliefert sind, insofern sie nicht Duo-Queuen können. In einer höheren Elo hat der einzelne Spieler einen weitaus größeren Impact auf den Ausgang eines Spiels als in niedriger Elo. Ich weiß nicht wie, aber es ist unfair für die guten Spieler die absolut nichts für ihr Versagen können, und irgendwann Quitten weil sich das einfach niemand geben möchte. \n\nAngenommen jemand hat nicht viel Zeit und kann \"nur\" ein Spiel pro Tag spielen, dann hat er nach dem Softreset etwa 10 Monate Zeit bis zum Saison Ende, um sich wieder auf die ELO vor dem Reset zu spielen. In Zahlen ausgedrückt wären das 30 Spiele pro Monat mit 10 multipliziert, was insgesamt 300 Spiele ergibt. Wer es nach so vielen Spielen nicht mehr auf seine Vorjahres ELO schafft, muss sich mit der Möglichkeit anfreunden, dass er womöglich nicht mehr so gut spielt wie im Vorjahr ;-).\n\nZudem möchte ich noch anmerken, dass ich dein Verhalten bzw. Einstellung gegenüber Bronze- und Silberspieler ein keiner Weise teile und deine herabwürdigende Art diesen gegenüber nicht angebracht finde.","replies":[]},{"poster":"NVG Scythe","date":"2017-08-30T02:09:16.445+0000","up_votes":4,"down_votes":0,"body":"Du hast zwar recht in manchen punkten, zum beispiel das bronze spieler weniger warden und dass viele asozial sind, aber zu sagen dass man deswegen schlechter aufsteigen kann ist völliger schwachsinn weil die gegner ja genau die gleichen probleme haben nur dass da potenziell 5 spieler so drauf sind und in deinem team ja nur 4 :)","replies":[{"poster":"KageNoOkami","date":"2017-08-30T02:36:02.105+0000","up_votes":1,"down_votes":2,"body":"Das ist wahr. Man selbst steigt zwangsläufig auf, wenn man es verdient. Aber es dauert viel länger von Bronze auf Silber zu steigen, als von Silber auf Gold, da man hier meist Spieler findet die wenn sie mal 0/3 spielen nicht tilten und feeden sondern brav Towerhuggen und auf den Jungler warten.","replies":[{"poster":"Sirrkas","date":"2017-08-30T08:31:30.282+0000","up_votes":2,"down_votes":0,"body":"Das kann ich nicht bestätigen. Es dauert etwa gleich lange. Es ist zwar schon etwas her, dass ich Bronze war. Allerdings habe ich nach der Einstufung 40 Spiele von Bronze 3 nach Silber 5 gebraucht. In der nächsten Season habe ich mit der Anzahl an Spielen Gold erreicht und auch irgendwo in Silber gestartet.","replies":[{"poster":"KageNoOkami","date":"2017-08-30T08:37:54.273+0000","up_votes":1,"down_votes":5,"body":"40 Spiele für 2 Divisionen im Low-Elo-Bereich? Wow das ist wirklich schlecht.","replies":[{"poster":"Μalcolm Graves","date":"2017-08-30T09:03:52.912+0000","up_votes":5,"down_votes":0,"body":"Er hat auch geschrieben dass es länger her ist. Aber Btw ich denke dass du selber richtig toxic bist. So wie du die Personen, die hier kommentieren anpöbelst. \nPS: die Elo-Hell gibt es nicht","replies":[{"poster":"KageNoOkami","date":"2017-08-30T09:08:01.794+0000","up_votes":1,"down_votes":6,"body":"No. Ingame bin ich absolut nich toxic. Ich mute direkt das ganze Team.","replies":[{"poster":"PoppyIsMyWaifu","date":"2017-08-30T10:47:11.588+0000","up_votes":3,"down_votes":1,"body":"\"Ich mute direkt das ganze Team\" \n\n\"da keine Wards gesetzt wurden, permanent geflamet\" \n\nEin Hellseher o.o sie flamen und er kriegt es trotz mute hin. HEY LEUTE wir haben einen Hellseher ^-^ schaffe ich Dia diese Season ?","replies":[]}]}]},{"poster":"Sirrkas","date":"2017-08-30T08:50:39.958+0000","up_votes":1,"down_votes":0,"body":"Ich hab als meist Leona Support gespielt. Locker 3 Spiele wurden im Lategame durch vereinzelte Wards gewonnen. Da warten dann 3 Gegner in einem Busch, werden überrascht, sterben und wir können einfach die Mitte runter laufen. Das 2vs5 können die anderen nicht gewinnen.","replies":[]}]}]},{"poster":"NVG Scythe","date":"2017-08-30T02:57:31.395+0000","up_votes":2,"down_votes":0,"body":"''Mein Beileid an all die Spieler die in der Elo-Hölle gefangen sind.'' Wenn du meinem kommentar recht gibst ist man ja auch nicht gefangen^^ Ja es kann schon sein dass silber teammates beim carrien angenehmer sein können als bronze mates aber dafür sind die bronze spieler auch viel einfacher zu zerstören also würde ich nicht denken dass man es deswegen als smurf in silber einfacher hat, ich hab bis jetzt bronze5 bis dia2 soloq erlebt und kann sagen dass es die elohell nicht gibt, man kann nur einfach in keiner elo einen garantierten win haben egal wie gut man ist, selbst die besten spieler können nicht jedes game gewinnen, dafür sind die mechanics zu easy","replies":[]},{"poster":"Uranbrennstab","date":"2017-08-30T05:43:55.160+0000","up_votes":1,"down_votes":0,"body":"Das ist, vorsichtig ausgedrückt, eine sehr gewagte These. Andere würden Bullshit sagen. Ich war auch in Bronze, bin über Silber und jetzt seit der letzten Season Gold gekommen. Eins habe ich sehr schnell erkannt. Ob High Bronze oder Low Gold,  es sind 100% die selben Spieler, mit der selben sinnlosen und von Unverständnis zeugenden Spielweise. \nIch hatte letztens ein Spiel, in einem Full AD Team, wo unser Alistar Support dann irgendwann angefangen hat AP zu kaufen, weil wir ja Magic damage brauchen, dass war dann Gold V.\nJungler, die nicht wissen was sie tun, Toplaner die denken der TP ist dafür da um auf dem Endscreen zu trollen, Menschen die sich für Support Mains halten und dann E-girls ohne Ardent spielen. Genau solche Leute sind Alltag und die Mehrheit in Gold, Silber und Bronze. Und wenn ich meinen Bekannten glauben darf auch Platin und low Dia.","replies":[{"poster":"Sirrkas","date":"2017-08-30T08:38:37.521+0000","up_votes":1,"down_votes":0,"body":"Zumindest werden die Leute nach oben hin leicht besser. Es muss ja nicht viel sein, aber ein Unterschied ist da.\n\nEiner aus meinem Bekanntenkreis zum Beispiel war Bronze 3 oder 4 und hat Ahri \"Support\" gespielt. Weil, er mag Ahris Aussehen und sie hat ja einen CC. Schaden war keiner da, auf der Lane dann doch gerne weit hinter dem ADC stehen und Farm nehmen, weil man braucht ja Gold. War richtig anstrengend mit so was zu spielen. Es hat zwar grob ein halbes Jahr gedauert, aber inzwischen spielt er Soraka, da ist das hinter dem ADC stehen nicht schlimm sondern meist ok. Er hat gelernt was Wards sind  und Schaden macht er genau so viel wie davor. Seitdem er das geändert hat, steigt er langsam auf und ist schon fast Silber 5. Ich weiß nur nicht, ob er das schon schaffen kann.\n\nEdit:\n\nWas meinst du eigentlich mit \"E-girl\" in Bezug auf Supporter?","replies":[{"poster":"Uranbrennstab","date":"2017-08-30T09:06:57.913+0000","up_votes":1,"down_votes":0,"body":"Lustige Anekdote: Eine flüchtige Bekannte von mir ist/war Ahri Main und hat eine wette gewonnen, in der es darum ging erfolgreich jeweils ein Spiel mit Ahri auf jeder Position mit entsprechendem Build zu bestreiten. Hat zwar wenig mit deiner Aussage zu tun, ich musste nur daran denken.\n\nBestimmt werden die Spieler besser, aber die Anzahl an Totalausfällen bleibt konstant hoch.","replies":[{"poster":"Sirrkas","date":"2017-08-30T09:47:36.543+0000","up_votes":1,"down_votes":0,"body":"Wie lange hat sie dafür gebraucht? Also die Anzahl an Spielen.","replies":[{"poster":"Uranbrennstab","date":"2017-08-30T09:51:15.560+0000","up_votes":1,"down_votes":0,"body":"Nicht sehr viele Spiele, ich glaube unter 10.","replies":[]}]}]}]},{"poster":"KageNoOkami","date":"2017-08-30T06:42:35.023+0000","up_votes":1,"down_votes":1,"body":"In Bronze ist jedes Spiel Roulette. In Silber findet man häufig den Durchschnittsspieler, nicht gut aber er weiß halbwegs was er da macht. Goldspieler sind in der Regel recht dezent. Sie kennen ihren Charakter, tilten nicht direkt und flamen den Chat nicht voll. \nGibt natürlich immer Ausnahmen. \nWas Platin und Diamant angeht, ist das denke ich nur purer tilt wenn mal einer aus der Rolle fällt. Je höher die Liga desto höher der Frust, wenns mal nicht weitergeht. Kann ich aber auch durchaus nachvollziehen. \n\nAn sich hab ich den Text verfasst da es mir einfach zum zweiten Mal in Folge passiert. Letzte Season und diese Season. Spiele mit High-Silber-Kollegen waren ausnahmslos spielbar und spaßig. Spiele mit Bronze-Spieler waren immer mit enormen Flame und Feed verbunden, haben absolut keinen Spaß gemacht. \n\nVielleicht hatte ich einfach nur Pech, aber an meiner Spielweise liegts trotzdem nicht, obwohl das vermutlich wieder einige behaupten. Andernfalls hätte ich es nicht zweimal innerhalb 2 Tagen von Bronze auf Gold geschafft.","replies":[{"poster":"Uranbrennstab","date":"2017-08-30T07:14:47.658+0000","up_votes":1,"down_votes":0,"body":"Ich würde gerne mal deine Gold und Silber Spiele haben. Meine laufen meistens so ab, dass du dir, am liebsten schon Minute 10, den surrender Vote wünschst. Dein Team verkauft dich, spuckt dich an und gewinnt dann ab und zu mal und manche Spiele kann man auch carryn, aber von der Aussage, die wissen was sie tun, oder es sind dezente Spieler nehme ich mehr als eine Armlänge Abstand.","replies":[{"poster":"KageNoOkami","date":"2017-08-30T07:27:22.809+0000","up_votes":1,"down_votes":0,"body":"Willst mal zamm spielen :D? Zocke jede Nacht zwischen 3 Uhr und 6 Uhr morgens.","replies":[{"poster":"Uranbrennstab","date":"2017-08-30T07:30:55.417+0000","up_votes":1,"down_votes":0,"body":"Da schlafe ich, muss leider Tagsüber arbeiten.","replies":[]}]}]}]}]}]}]},{"poster":"Dreadlord Mike","date":"2017-08-30T14:13:32.977+0000","up_votes":4,"down_votes":1,"body":"Ich finde deinen Post äußerst amüsant da ungefähr 90% einfach nur falsch ist.\n\n1: Du spielst auschließlich Kha Zix und nimmst an dass du als Assasin dein Team brauchst was auf deine fehlende Praxis mit dem Champion schließen lässt.\n\n2: Du hast in Bronze gespielt und denkst wirklich dass man dort sein Team braucht xD . Besonders in Low elo kann man wenn man gut genug ist ohne Probleme 1vs5 carrien. \n\n3: Wenn du selbst keinen Einfluss auf Sieg oder Niederlage hast bist du einfach zu schlecht. Als jungler hast du den meisten Einfluss von allen Rollen. Wenn du da trotzdem nichts bewerkstelligen kannst kann ich dir verraten, liegt es nicht am Team sondern an dir.\n\n4: Statistisch gesehen hat das Enemy Team immer mehr Feeder als deines da du ja keiner sein solltest. Dies heißt das die winchance in deinem Team jedes game höher sein sollte.\n\n5: Soloq hat nur wenig mit Glück zu tun da die games die wirklich vom \"Team\" verloren werden sich auf ein minimal beschränken.\n\n6: Hm du tust dir leicht als Jungler wenn dein Team gut spielt so ein Zufall aber auch. Lass mich dir was verraten, die meisten Leute spielen gut wenn ihr Team sie carried.\n\n7: Du scheinst wohl keine Ahnung von high elo zu haben wenn du mit Aussagen ankommst wie \"In einer höheren Elo hat der einzelne Spieler einen weitaus größeren Impact auf den Ausgang eines Spiels als in niedriger Elo\". \nDiese Aussagen kann ´falscher nicht sein.\nIn Low elo kann man ohne Probleme 1vs5 carrien sogar als Platin scrub, in high elo sieht das alles ganz anders aus.  Ein kleiner Fehler kann dein game verlieren wo in Low die meisten Fehler nichtmal bemerkt werden.\n\n8: Jeder spieler kann was für sein Versagen, es gibt immer Dinge in einem Spiel die man besser machen kann auch wenn man von sich denkt dass man perfekt spielt. Mit deiner Aussage \"aber es ist unfair für die guten Spieler die absolut nichts für ihr Versagen können\" belegst du einfach dass du noch viel zu wenig Ahnung von League hast.\n\n9: In jeder elo gibt es asoziale Spieler, in bronze/silber/Gold fällt es nur mehr auf weil es einfach viel mehr Spieler gibt.\n\nUnd als 10 ein Abschlusswort:\n Es gibt keine ELOHELL, Spieler die dies denken sind einfach nur in der jetzigen Elo gefangen weil ihr skill nicht aussreicht ihre games zu carrien. \n\nBitte höre auf dein \"Wissen\" zu verbreiten dass absolut nichts mit der Realität zu tun hat.\nDeine Toxische Art und dein Fachwissen zeigen genau was für eine Art von Spieler du bist. \nJene Art die nur die Schuld aufs Team schieben und nicht eine Sekunde daran denken würden dass sie versagt haben und nicht ihr Team.","replies":[]},{"poster":"Angel Ayume","date":"2017-08-30T17:34:05.060+0000","up_votes":1,"down_votes":1,"body":"Papperlapapp. Alles quatsch, was du da redest. \nWenn du gut genug bist, kannst du als Assassine das Game alleine carrien. xD \nDa du das nicht kannst, bist du eben auch nicht gut genug und gehörst genauso nach Bronze wie deine Mitspieler und deine Gegner. \nSetz die rosarote Brille ab und erkenne deine Fehler. \nDanke und auf Wiedersehen.","replies":[{"poster":"KageNoOkami","date":"2017-10-19T19:00:59.932+0000","up_votes":1,"down_votes":3,"body":"So ein Quatsch Girl. Ich spiele mindestens auf Gold Niveau. Wenn du dir die Mühe machst mit mir zu spielen beweis ich dir das. ","replies":[{"poster":"Angel Ayume","date":"2017-10-19T19:43:33.780+0000","up_votes":2,"down_votes":0,"body":"Wow. Du schaffst es nach 2 Monaten zu antworten xDD \n\nDie Elo Hell existiert nur in deinem Kopf, nichts weiter. \nWenn man gut genug ist steigt man auch auf, wenn man nicht aufsteigt, dann ist man schlichtweg nicht gut genug.","replies":[{"poster":"KageNoOkami","date":"2017-10-19T20:03:33.203+0000","up_votes":1,"down_votes":2,"body":"Ich steige easy auf, aber es dauert mir einfach viel zu lang.... Ich möchte mich keine 6 Runden abplagen um eine Division aufzusteigen. Ich brauche mindestens 15 Spiele von Silber 3 (aktuell) auf Gold 5. Sagen wir mit Promotions und evtl. einer versauten Promotion sogar um die 20. Das macht in etwa 10 Tage, die ich auf Silber rumdüdel... vergeudete Zeit :(.","replies":[{"poster":"Angel Ayume","date":"2017-10-19T21:39:28.403+0000","up_votes":2,"down_votes":0,"body":"Interessant, dass du das so genau weißt, wo du doch erst 10 Rankedgames gespielt hast. \nAnstatt große Töne zu spucken mach doch einfach mal das von dem du da redest und spiel dich innerhalb von 15 Games auf Gold V. \n\nAch ja und solltest du jetzt davon reden, dass du das doch easy schon auf einem anderen Account geschafft hast, dann frage ich mich, wieso du hier im Forum einen Thread mit deinem Smurf und nicht mit deinem Main Account erstellst.","replies":[]}]}]}]}]},{"poster":"Oriius","date":"2017-08-30T02:38:37.234+0000","up_votes":2,"down_votes":0,"body":"Das Problem liegt nicht an der bronze elo selbst sondern an den Spielern die diese teilweise missbrauchen.\n\n1. Bronze elo ist vorallem an Anfänger gerichtet die dementsprechend u.a keine Wards setzen können weil sie das noch nicht richtig verstehen. Ich selber hatte ebenfalls keine Ahnung warum man geld für Pink wards verschwenden soll wenn man 75 gold für was anderes investieren könnte.\n\n2. Es gibt einfach immer mehr Leute die aus ihrer aktuellen Main elo fliehen und bewusst nen Bronze 5 Acc hochlvln nur um leute zu nerven und grundlos aufzuregen. Ich finde dort sollte ein stärkerer Riegel vorgesetzt werden nur es ist eben schwierig sowas per System direkt auszufiltern.\n\n3. und das ist das wichtigste: Spieler in der Bronze elo halte ich solang sie berechtigt dort sind für wahnsinnig angenehm sowohl vom spielen als auch vom verhalten, jedoch die Leute die alle vom Skill ein wenig über bronze liegen fangen direkt an neulinge auf härteste weise zu beleidigen etc. Das dann der Spielstil von neulingen abfällt find ich verständlich^^\n\nDementsprechend halte ich das eher für eine patt situation. Dein team wird im schnitt genauso viele Anfänger im Team haben bzw leute die noch nicht so viel über league wissen wie das gegnerteam und dementsprechend ist es gerade in dieser elo sehr einfach durch eigenen skill viel umzureißen. Daher halte ich hier die Elo hell nur für teilweise gegeben und zwar im sinne das eben gerade die anfänger nicht so viel über das Spiel wissen und dementsprechend durch mangelndes warding etc ein game losen können.\n\nGut das Matchmaking versagt sowieso zunehmdend immer mehr aber ich persönlich habe keine Ahnung wie ich in Bronze spielen würde wenn ich da selbst jetzt wäre. Sonst könnte ich das wesentlich besser beurteilen.\n\nich würde sagen eine Elo Hell ist in Bronze sehr zweifelbar sondern erst in Elo´s wo jedenfalls laut System Spieler sein sollen mit gleichem Können (was in Bronze ja logischerweise nicht der Fall sein kann weil jeder da anfangen musste(99%)). Zb S4 G5 D5\n\nNatürlich ist eine Elo hell meist für jeden persönlichen selbst definierbar und richtet sich meist nach seinem eigenen maximalem Erfolg und dort wo man stehen bleibt ist die \"elo hell\" für besagten Spieler jedoch habe ich selbst die Erfahrung machen müssen das nicht nur meine aktuelle Elo (S4) sondern auch regelmäßig bestimmte Divisionen immer wieder als \"Hell\" bezeichnet wird weil dort vorallem die gepushten leute drin spielen oder leute die einfach nur wahnsinniges Glück mit den Teams hatten. zB Platin 5 oder Dia 5 ist immernoch eine beliebte boosterelo und dementsprechend spielen dort teilweise Flachpfeifen die nichtmal nach Gold5 geschweige Silber 5 gehörten. Also bestimmte wenige elo´s sind schon \"zufälliger\" als andere daher würde ich nicht zwingend abstreiten das eine elo hell existiert. Man steigt jedoch IMMER auf wenn man wirklich besser spielt als seine aktuelle ELO ... die Frage ist nur wann. 100 Games 1000 Games 5000 Games...\nmein s4 ranking beginnt eigentlich immer erst mit einer losingstreaks von 10-15 Games bevor ich wieder n paar Lp sammle. dementsprechend verbrate ich alleine dafür fast 8 stunden an zeit nur zum verlieren. das nachzuholen brauch mind. das doppelte an Zeit bevor ich aufsteigen kann. dementsprechend finde ich die zeiten um hier weiterzukommen viel zu extrem und dann sind fürs vergnügen eher normal games zu raten.","replies":[]},{"poster":"Epic Melons","date":"2017-08-30T01:14:57.570+0000","up_votes":3,"down_votes":2,"body":"Wow, was bist du nur  für 1 guter Spieler. Ohne dich hat kein Team eine Chance auf den Sieg.","replies":[]},{"poster":"LightRain","date":"2017-08-31T19:30:37.540+0000","up_votes":3,"down_votes":5,"body":"Wie hier immer alle super schlau daherreden. Es gibt die Elo Hell, und zwar in Bronze!\n\nNirgends gibt es mehr Feeder und afk Spieler als hier. Den Leuten ist es egal wo sie mit ihrem Account stehen, dann verliert man halt ein Spiel, das ist hier so vielen egal. In meinen letzten 30 Games hatte ich 3 AFK Spieler, all Spieler waren in meinem Team und waren automatisch verloren. \n\nHier gewinnt nicht wer besser ist oder vom skill in Silber Gold gehört, hier gewinnt der der am wenigsten Feeder + AFK Spieler ins Team bekommt. Wie oft habe ich eine Botlane die1:8 nach 15min steht.","replies":[{"poster":"HyperionCH","date":"2017-08-31T19:43:04.400+0000","up_votes":1,"down_votes":0,"body":"Aber Feeder und Afkler helfen doch beim Climb.\n\n4 potentielle Feeder/Akler in eigenen Team, 5 beim Gegner.\nEs sei denn, man gehört selbst dazu, aber dies hat dann nichts mit Elo-Hell zu tin.\n\nOder erklär uns, wieso in Bronze mehr Feeder/Akler im eigenen Team sein sollen (denn nur dann sind sie der Grund, dass man nicht climbt).","replies":[]},{"poster":"Waldschrat86","date":"2017-09-01T09:21:58.481+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=LightRain,realm=EUW,application-id=Wj1wcocU,discussion-id=sw8ptYRO,comment-id=000c,timestamp=2017-08-31T19:30:37.540+0000)\n>\n> Wie hier immer alle super schlau daherreden. Es gibt die Elo Hell, und zwar in Bronze!\n> \n> Nirgends gibt es mehr Feeder und afk Spieler als hier. Den Leuten ist es egal wo sie mit ihrem Account stehen, dann verliert man halt ein Spiel, das ist hier so vielen egal. In meinen letzten 30 Games hatte ich 3 AFK Spieler, all Spieler waren in meinem Team und waren automatisch verloren. \n> \n> Hier gewinnt nicht wer besser ist oder vom skill in Silber Gold gehört, hier gewinnt der der am wenigsten Feeder + AFK Spieler ins Team bekommt. Wie oft habe ich eine Botlane die1:8 nach 15min steht.\n\nNö hier gewinnt der, der besser ist und die ganzen Grobmotoriker ausspielt, ist nirgends einfacher als dort.\nBin Main Sup, stabiles Gold, das letzte mal als ich SoloQ zu Saesonbeginn Bronze gesetzt habe, habe ich mich mit Trynda Top, ohne Erfahrung in Split oder Matchups da rausgespielt und glaub mir meine Teams haben oft genug gefeedet, aber das ist sowas von egal, weil der Gegner auch nichts peilt, hab immer 2 Inhis eingerissen dann war das Ding gelaufen, egal was mein Team fabriziert hat.","replies":[]},{"poster":"Shadowscreen","date":"2017-09-01T09:56:11.284+0000","up_votes":1,"down_votes":0,"body":"Und genau das stimmt nicht.\nDie ELO hell ist die ELO in der du mit deinem Skill einfach nicht mehr carrien kannst.\nWenn das bei dir Bronze ist, dann ist das so, lerne dich zu verbessern und aktzeptier, dass DU fehler machst.","replies":[]}]},{"poster":"Der Wohltäter","date":"2017-08-30T10:47:04.934+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=KageNoOkami,realm=EUW,application-id=Wj1wcocU,discussion-id=sw8ptYRO,comment-id=,timestamp=2017-08-30T00:48:25.076+0000)\n>\n>  Ich selbst spiele ausschlie&amp;szlig;lich KhaZix,\n\nErster Schritt zum Erfolg.\n\n> ich brauche mein Team also dringender als sie mich, denn alleine rei&amp;szlig;e ich gar nichts, \n> \n\nAls Kha`Zix bist du nicht unbedingt auf dein Team angewiesen. Es ist natürlich toll, wenn das Team mit dir spielt, aber es ist keine Notwendigkeit.\n\n\n>wenn das Gegnerteam koordiniert spielt und ich keine isolierten Ziele finde. \n\nAbwarten. Als Assassine, vor allem als Kha`zix, ist Timing das Wichtigste im ganzen Spiel.","replies":[]},{"poster":"HyperionCH","date":"2017-08-30T08:50:06.552+0000","up_votes":1,"down_votes":0,"body":"Warum eigentlich soll es in Bronze schwieriger sein?\nWeil das eigene Team keine Wards setzt und das Gegnerteam koordiniert spielt? Alle haben ha die gleiche Eli, weshalb die Gegner genauso wenig Wards setzen wird (für einen Jungler wie Kha ein grosser Vorteil) und das eigene Team im Schnitt ähnlich koordiniert spielt.\n\nKann höchstens sein, dass der TE einfach viel besser wurde und dies rascher als sein climb.\n\nAber ich kann ja testen.\nIch bin durch schlechte Einstufungen (letztes Jahr 0:10) auch in Bronze gefallen ind habe bis jetzt nur wenig Rankeds gespielt. Kann es ja mit Rankeds wieder versuchen und dann schauen wir, ob dies wirklich schwer ist. ;)","replies":[{"poster":"KageNoOkami","date":"2017-08-30T08:55:05.868+0000","up_votes":1,"down_votes":2,"body":"Es ist nicht schwerer, es ist einfach nur Glück. Das Team mit weniger Feedern gewinnt. In Silber feeden die meisten nicht vollkommen rein, kennen das Spiel schon gut genug. Kannst also was reißen, da Gegner nicht total fed sind nach ner Weile. Aber egal wie hoch dein Skill is, mit ner 4/1 Score gewinnt man nicht gegen einen 15/0 Mundo/Garen, egal wie schlecht der Gegner auch is.","replies":[{"poster":"HyperionCH","date":"2017-08-30T10:41:20.972+0000","up_votes":1,"down_votes":0,"body":"Auf der anderen Seite:\n\nIn deinen Team sind 4 potentielle Feeder (wenn du keiner bist), beim Gegner 5.\nDeshalb müsste es in Bronze einfacher sein.","replies":[]},{"poster":"Μalcolm Graves","date":"2017-08-30T09:10:36.733+0000","up_votes":1,"down_votes":0,"body":"als kha zix gewinnst auch nicht gegen einen 0/0 Garen/Mundo , weil es fcking tanks sind und kha ein assasin","replies":[{"poster":"KageNoOkami","date":"2017-08-30T09:14:55.147+0000","up_votes":1,"down_votes":0,"body":"Würd ich so nicht behaupten. Klar, dein Goal sind ADC/Assassin/APC aber mit den richtigen Items kriegst du auch Tanks klein.","replies":[]}]}]}]},{"poster":"Hakkuu","date":"2017-08-30T10:11:45.246+0000","up_votes":1,"down_votes":0,"body":"Du schreibst doch selbst, dass du scheinbar relativ zügig da raus gekommen bist. Wo ist also das Problem, wenn die Spieler auf Bronze Niveau eben länger brauchen, um da raus zu kommen - schließlich ist es ihr Skill Level. Du bist hingegen vielleicht ein \"Goldspieler\" und jetzt auch wieder da angekommen, wo du hin gehörst/wolltest.\nWer sich natürlich selbst verbessert, und besser als die anderen Bronze Spieler ist, hat sofort höhere Chancen, auf Silber aufzusteigen. Denn: Guter Spieler + 4 Trolls > 5 Trolls.\n- Ist jetzt natürlich sehr hart formuliert, aber so beschreibst du es ja.","replies":[]},{"poster":"Fluxx","date":"2017-08-30T02:13:20.971+0000","up_votes":2,"down_votes":2,"body":"Hallo KageNoOkami,\n\nAmen. :) Was du da beschreibst kann ich so unterschreiben. Ich möchte jedoch hinzufügen, dass auch in hoher Elo oft einmal eine schwankende Synergie untereinander herrscht, wenn es darum geht, was wann zu tun ist. Das führt dann auch gerne mal zu Kommentaren wie dem von Epic Melons. Außerdem möchte ich unterstreichen, dass der Jungler mit den größten Impact auf den Verlauf des gesamtes Spieles hat, da du darüber bestimmst wie hoch die Pressure auf den Lanes ist wenn du einmal das nötige Knowledge hast, kannst du auch mal Mates durch das Game bringen, die eben viel weniger Wissen als du. Wenn du climben möchtest, wirst du akzeptieren und feststellen müssen, dass dich stets Spieler begleiten werden, die ein Game gerade mal nicht Ernst nehmen durch schlechte Laune o.Ä. oder gerade wirklich einmal nicht gut sind. Das Ziel bei solchen Games ist es für DICH, als derjenige, der es besser weiß, diese lässigen Spieler auf deinen Schultern zumindest bis ins Late zu bringen, solltest du ohne das Team nicht enden können. Denn wenigstens im Late könnte auch eine Bronze Vayne enorm für den Win beitragen, und wenn diese nur einen gegnerischen Carry ausschaltet. Egal wie weit dein Team zurück liegt, jede Kleinigkeit kann dich einem Win näher bringen und diese gillt es auszubauen. \n\nGruß :) {{champion:222}}","replies":[]},{"poster":"Herr Hübsch","date":"2017-08-30T09:27:55.035+0000","up_votes":1,"down_votes":5,"body":"Also derzeit muss ich der elo-hell zustimmen. Ich bekomme oft plat+ in meinem team, trotz meines S3 accounts, die so hart reinfeeden und trollen wie kein bronze je könnte. Die gestehen auch offen das sie es mit absicht tun wenn man sie darauf anspricht mit begründungen wie \"ihr spielt doch eh alle scheisse auf eurer elo also isses egal\".","replies":[{"poster":"KageNoOkami","date":"2017-08-30T09:34:18.149+0000","up_votes":1,"down_votes":5,"body":"Mann diese Plat+ Spieler sagen offen heraus die Wahrheit. Das lob ich mir.","replies":[]}]}]}