{"poster":"DrakoDRK","date":"2019-10-10T12:11:12.768+0000","title":"Glacials total verbuggt","subforum":"Teamfight Tactics","up_votes":1,"down_votes":1,"body":"Hallo\r\n\r\nIch hatte eben 2x Glacial auf dem Feld, Lissandra sowie Ashe. Und die frieren einfach mal nichts ein und dealen auch kaum DMG. Das ist total verbuggt aber so richtig. Macht echt kein Spass mehr so zu spielen zur Zeit. \r\nMeine Synergien werden teilweise einfach aufgelöst und dann habe ich in den Fights keine Bonus Synergien zur Verfügung während dem die Gegner mir richtig auseinander nehmen. \r\n\r\nGrüsse\r\nDrako","replies":[{"poster":"G2 Slippi","date":"2019-10-10T12:15:35.859+0000","up_votes":2,"down_votes":0,"body":"Dass die Bonianzeige verbugged ist, ist bekannt (einfach oben auf das gelbe Rufzeichen klicken, dort kannst du es nachlesen).\n\nDass Glacials manchmal nichts einfrieren bei einem 2er Glacial Bonus ist normal, da die Chance auf einfrieren doch eher gering ist. Besser noch zwei Glacials dazu und du wirst sehen dass viel öfter eingefroren wird ;)","replies":[{"poster":"DrakoDRK","date":"2019-10-10T12:33:19.488+0000","up_votes":1,"down_votes":1,"body":"Ich kenne den Bonus von Glacials da ich meistens auf Glacial gehe. Doch da passierte nichts in dem Game. Auch die Fähigkeit von Lissandra wurde nicht ausgelöst.\nSchreibe nicht zum Spass so ein Post.","replies":[{"poster":"G2 Slippi","date":"2019-10-10T12:57:33.200+0000","up_votes":3,"down_votes":0,"body":"Wollte damit nur sagen, dass ich mit 2er Glacial auch schon öfter das Problem hatte, dass der Bonus kaum ausgelöst wurde, was sich mit 4er Glacial dann aber gelöst hat.\n\nWollte nur helfen, sry, wenn du dich in irgendeiner Weise angegriffen gefühlt hast.","replies":[]}]}]},{"poster":"Yuiwara","date":"2019-10-11T14:21:14.149+0000","up_votes":1,"down_votes":0,"body":"das mit glacials kann ich nicht bestätigen. was ich allerdings habe ist, dass die randpositionierten einheiten ab und zu untätig sind, obwohl sie gegner in reichweiter haben. bewegen sich auch nicht. bewegen sich idr dann erst, sobald sie getroffen werden.","replies":[]}]}