{"poster":"R3Lapsed","date":"2015-10-23T11:35:38.076+0000","title":"Riot Support versagt auf ganzer Linie ...","subforum":"Hilfe & Support","up_votes":34,"down_votes":16,"body":"Hallo zusammen,\r\n\r\nIch w&uuml;rde hier gerne auf einen Vorfall, den ich mit dem Support von Riot Games machen musste, aufmerksam machen, welcher mittlerweile die dauerhafte Sperrung meines Accounts zur Folge hat.\r\n\r\nEs fing damit an, dass ich nach l&auml;ngerer Pause mal wieder in meinen Account einloggen wollte. Allerdings musste ich dabei feststellen, dass meine Anmeldedaten nicht mehr funktionierten und mein Account (laut angezeigter Meldung) in ein anderes Gebiet transferiert wurde - ganz offensichtlich wurde er Opfer eines Hackangriffs. Dies habe ich nat&uuml;rlich dem Support von Riot gemeldet, welcher sich auch relativ zeitnah mit der Sache befasst und meinen Account nach EUW zur&uuml;cktransferiert hat. Soweit sogut, bis hierhin war ich sehr zufriedem mit der Arbeit von Riot. Aber was danach geschah ist meines Erachtens nicht tragbar f&uuml;r ein Unternehmen, dessen Finanzierung und Erfolg im weitesten Sinne von Kundenzufriedenheit lebt.\r\nDer Account wurde n&auml;mlich nicht auf einen fr&uuml;heren Stand zur&uuml;ckgesetzt, sondern mir so &uuml;berlassen, wie ihn der zwischenzeitliche Nutzer hinterlassen hatte. Also konnte ich augenscheinlich davon ausgehen, mein Konto wie zuvor nutzen zu k&ouml;nnen und mit den Vor- und Nachteilen des Hackangriffs umgehen zu m&uuml;ssen. Nachteile waren nat&uuml;rlich das komplette L&ouml;schen meiner Freundesliste, sowie der Masteries und &auml;hnlichem. Ein vermeintlicher Vorteil allerdings war eine Gro&szlig;e Menge an Riot Points, die sich auf dem Account befanden. Ich dachte, ich k&ouml;nnte diese nun so benutzen, wie ich auch mit allen anderen &Auml;nderungen leben musste, dem war allerdings nicht so. \r\n\r\nIch habe von den Punkten erst einmal eine Namens&auml;nderung durchgef&uuml;hrt, damit ich so vielleicht aus dem Fokus der Hacker gerate und einen Folgeangriff vermeide. Schon am n&auml;chsten Tag bekam ich eine E-Mail von Riot Games, in der mir mitgeteilt wurde, dass mein Account nun aufgrund unauthorisierter Zahlungen dauerhaft gesperrt worden ist. Ich habe nat&uuml;rlich sofort das Ticket wieder ge&ouml;ffnet und dem Mitarbeiter versucht zu erkl&auml;ren, dass ich nur die Punkte benutzt habe, die nach dem Hackangriff auf meinem Account waren (Ich h&auml;tte den Account liebend gerne wieder so erhalten, wie ich ihn zur&uuml;ckgelassen habe - ohne Punkte und somit ohne Probleme). \r\n\r\nAb diesem Zeitpunkt war jegliches Zuvorkommen des Support-Mitarbeiters verschwunden. Genauer gesagt hat der Bearbeiter meines Tickets zu einem Mitarbeiter von Riot Games gewechselt, welcher mir nur mitteilte, dass ich f&uuml;r die Sicherheit meines Accounts selbst verantwortlich bin und nun f&uuml;r die 50 Euro (!) an Punkten aufkommen m&uuml;sse oder der Account bleibt dauerhaft gesperrt. Was zur H&ouml;lle? Erst bin ich Opfer eines Hackangriffs und dann soll ich auch noch daf&uuml;r bezahlen? Wie k&ouml;nnen denn &uuml;berhaupt unauthorisierte Zahlungen mit auf einem Account vorhanden Punkten get&auml;tigt werden, liebe Riot Mitarbeiter? Liegt dieser Fehler auch wieder beim Kunden? Au&szlig;erdem war die Vorgeschichte mit dem Hackangriff komplett klar, selbst wenn ich f&uuml;r die Sicherheit meines Accounts eigenverantwortlich bin, wie kann denn hier so wenig Entgegenkommen aufgebracht werden?\r\nAuf die Forderung die Punkte zu l&ouml;schen und die Transaktion einfach r&uuml;ckg&auml;ngig zu machen wurde nicht geantwortet. Auch bei zwei weiteren Tickets, die ich daraufhin geschrieben habe und einem vernichtenden R&uuml;ckmeldebogen auf meine Supportanfrage wurde nicht reagiert. Erst als ich nach mittlerweile mehrerer vergangener Wochen den Vorschlag gemacht habe, die Punkte f&uuml;r meine get&auml;tigte Transaktion zu bezahlen, den Rest aber bitte von meinem Account entfernt haben m&ouml;chte, kam wieder eine kurze Antwort, welche nur nochmal die Sache mit den zu zahlenden 50 Euro wiederholte. Mit welcher Begr&uuml;ndung k&ouml;nnen die Punkte nicht einfach entfernt werden? Selbst nach meinem Vorschlag, f&uuml;r die von mir get&auml;tigte Transaktion selbst aufzukommen. Was bewegt Riot dazu, derma&szlig;en darauf zu beharren, diese ganz offensichtlich nicht vom Kunden georderten Punkte von diesem bezahlen zu lassen?\r\n\r\nIch folgere hier einen mehr als mangelhaften Kundensupport von Riot Games und hoffe damit den ein oder anderen zu erreichen, der &auml;hnlich schlechte Erfahrungen gemacht hat. So kann sich Riot Games gerne mal ein Bild davon machen, wie vom eigenen Support mit Kunden umgegangen wird, die hier schon den ein oder anderen Euro investiert haben. Riot Games - Nein danke!\r\n\r\nMfG,\r\nReLapse","replies":[{"poster":"KingVegetaa","date":"2015-10-23T11:51:54.014+0000","up_votes":3,"down_votes":1,"body":"zu aller erst, tut mir leid, dass dir diese Geschichte widerfahren ist, keiner mag es, von Hackern angegriffen zu werden...\n\nNun zu deinen Punkten:\n1. Freundesliste - Masteries: Das geht ganz schnell (natürlich außer den Freunden, die du im RL nicht kanntest) könntest du sie schnell wieder einfügen und sagen, dass du das bist und das die dich annehmen sollen. Masteries: kann man ganz schnell wieder zusammen stellen und nochmal optimieren, da sich einiges geändert hat (siehe Mordekaiser, Garen und Co...)\n\n2. und das ist typisch Riot halt: Wenn es ums Geld sind antworten sie, wenn nicht, wird einfach mit Copy Paste eine Antwort zusammen gefügt, die meistens nichts mit der eigentlichen Frage zu tun hat.\nMeistens ist es so, dass, wenn z.b. das Konto nicht gedeckt ist oder ähnliches man das Spielekonto sperrt.\nAllerdings, so wie ich das verstanden habe, hattest du ja schon Riot Punkte und hast sie nur ausgegeben oder?\nWie soll das unautorisiert sein?  Würde auch gerne von einer öffentlichen Stelle mal was hören.","replies":[{"poster":"HyperionCH","date":"2015-10-23T12:34:24.023+0000","up_votes":10,"down_votes":1,"body":"> [{quoted}](name=KingVegetaa,realm=EUW,application-id=7hciEY9w,discussion-id=6ETEkzOL,comment-id=0001,timestamp=2015-10-23T11:51:54.014+0000)\n>\n> Allerdings, so wie ich das verstanden habe, hattest du ja schon Riot Punkte und hast sie nur ausgegeben oder?\n> Wie soll das unautorisiert sein?  Würde auch gerne von einer öffentlichen Stelle mal was hören.\n\nSo wie ich es verstanden habe, hatte er nach dem Rückerhalt des Accounts mehr RP als vor seiner Pause.\nIch vermute, sein Account wurde gehandelt und der \"neue Nutzer des Accounts\" kaufte sich RP. Dies würde wie folgt aussehen:\n\n- Der TE fällt auf Phishing aus (es ist wohl eher Phishing gewesen und nicht Hacking).\n- Der Phisher übernimmt den Account, löscht alle Kontakte und Masteries/Runenseiten.\n- Der Phisher wechselt den Account in eine andere Region.\n- Der Phisher verkauft den Account.\n- Der Käufer kauft sich RP (z.B. mit Banküberweisung)\n- Der TE verlangt den Account zurück und bekommt ihn auch.\n- Der Käufer merkt nun, dass er den Account verloren hat (zu Recht) und stoppt die Überweisung.\n- Riot hat nun RP vergeben, aber die RP wurden nicht bezahlt: automatische Perma-Sperrung des Accounts\n\nDer Account des TE hat also RP auf dem Konto, die nicht bezahlt wurden (vom TE auch nicht bestellt wurden). Dummerweise hat der TE dann auch noch mit den nicht bezahlten RP den Nickname-Change bezahlt. Damit kann man wohl nicht sagen, man solle einfach die nicht bezahlten RP wieder abbuchen (wäre sonst im Minus, vermute ich).\n\nDem TE bleibt nichts anderes üblich (sofern er nicht die RP bezahlen möchte), als beim Support die Sache zu erklären. Dass auf jenem Account vom Käufer noch RP gekauft wurden, macht das Ganze einfach komplizierter und dies ist in der Kommunikation über e-mail nicht immer sofort verständlich.\n\nDem TE kann ich übrigens anraten, seine e-Mail-Adresse zu verifizieren und grundsätzlich bezüglich Passwörter die allgemeinen Grundregeln einzuhalten (z.B. sollte das PW für den Client nicht der selbe sein wie für die Mailbox). Damit ist man besser von Phishing-Aktionen geschützt.","replies":[{"poster":"R3Lapsed","date":"2015-10-23T13:56:14.506+0000","up_votes":5,"down_votes":5,"body":"Gute Darstellung des Problems, aber es bleibt die Kernfrage: Warum kann Riot nicht soweit entgegenkommen, die Punkte von meinem Account zu löschen und so die Problematik relativ einfach zu lösen? \nOb man nun die Namensänderung rückgänig macht oder ich diese bezahle spielt keine Rolle, sie wollen den vollen Betrag der (anderweitig) georderten Punkte - 50 Euro sind Ihnen dabei wohl mehr wert, als ein zufriedener Kunde...","replies":[{"poster":"Crounty","date":"2015-10-23T15:01:58.157+0000","up_votes":9,"down_votes":1,"body":"Lies dir die AGB durch.\n> WEITERHIN ERKENNEN SIE AN UND STIMMEN ZU, DASS RIOT POINTS UND VIRTUELLE GEGENSTÄNDE KEINEN GELDWERT BESITZEN UND DIESE NICHT IN BARGELD ABGELÖST WERDEN KÖNNEN, UND DASS SIE FÜR ALLE BELASTUNGEN IHRES KONTOS, AUCH NICHT AUTORISIERTE BELASTUNGEN, VOLLUMFÄNGLICH VERANTWORTLICH SIND.\n\n\nhttp://euw.leagueoflegends.com/de/legal/termsofuse#fees-riot-points-billing-\nPunkt V\n\nSteht in den AGB's wie du siehst, d.h die haben das Recht dich dazu zu bringen Geld zu bezahlen selbst wenn es jemand anders war, klar es ist schon unfair, dass jemand anderes gekauft hat und du am ende bezahlen musst, aber in den AGB's steht auch, dass du um deinen Account zu sorgen hast, ob du jetzt gehackt wurdest oder nicht ist nicht Riot's Schuld. Die hätten auch anders damit umgehen können und einfach deinen Account sperren können ohne dir die Chance zu geben den zurück zu erlangen, das liegt alles in deren Gewalt.\n\nEdit: Von mir aus könnt ihr mich downvoten, ändert nichts an der Wahrheit. Hab nur das widergespiegelt, was in den AGB steht, die **ihr alle **akzeptiert, wenn ihr das Spiel spielt und schon als ihr euren Account erstellt habt.","replies":[{"poster":"R3Lapsed","date":"2015-10-23T15:21:27.008+0000","up_votes":3,"down_votes":3,"body":"Dass sich Riot mit solch einer Klausel absichert ist mir vollkommen klar. Das schließt allerdings nicht aus, dass in Einzelfällen auch kulant gehandelt werden kann (sollte!). Denn das kann keineswegs ein dauerhaft guter Umgang mit dem Kundenstamm eines Unternehmens sein. \n\nIch möchte hier  vor allem zeigen, welche Problematiken sich durch ein solches Verhalten (wenn auch ausgelößt durch feste Klauseln) ergeben. Riot sollte es sich nicht erlauben können, seine Kunden einfach durch in der AGB festgelegte Regeln abzuspeisen.\n\nEine Möglichkeit wäre beispielsweise gewesen gleich bei der Accountwiederherstellung darauf hinzuweisen oder direkt den Account ein paar Monate zurückzusetzen oder von mir aus jetzt noch mit dem Löschen der Punkte kulant zu reagieren oder oder oder... dies allein reicht als Erklärung für diesen Fall ganz sicher nicht aus. Denn das ist einfach nur eine Absicherung seitens Riot, um von Hackangriffen etc. eher noch zu profitieren (denn sie würden ja keinen Schaden davon tragen, die Punkte oder sonstige Transaktionen einfach zu löschen)!","replies":[{"poster":"Crounty","date":"2015-10-23T15:32:48.872+0000","up_votes":2,"down_votes":1,"body":"Klar, es gibt viele Möglichkeiten, aber du bist sicher nicht der einzige dem das passiert ist und wenn die das ein bisschen lockern würden, dann gäbe es wieder Leute, die das noch mehr ausnutzen würden und das am Ende Riot schadet UND dann würden noch mehr Leute mit dem gleichen Problem oder die die das schon mal hatten kommen und ihr Geld zurück wollen und und und, also siehst du wie kompliziert das ist und was das für Probleme mit sich bringt :P.","replies":[]}]}]}]}]}]},{"poster":"Zero000","date":"2015-10-23T12:28:07.736+0000","up_votes":2,"down_votes":2,"body":"Erstmal, nur du selbst bist für deine Accountdaten verantwortlich und damit auch was mit deinem Account gemacht wird. Hierbei solltest du dir die Frage stellen wie der vermeintliche \"Hacker\" an dein Passwort und Accountname gekommen ist, die liegen normalerweise nicht einfach auf der Strasse rum.\n\nDann ist es eine Sache festzustellen ob du der Besitzer des Accounts bist, eine ganz andere ob das was mit dem Account gemacht wurde auch wirklich vom vermeintlichen \"Hacker\" getan wurde.\nAuch weis ich nicht über was du mit dem Support gesprochen hast, wenn es nur um der Server Transfer ging ist es klar das nicht mehr passiert ist. Auch ist es normal das bei einem Server Transfer die Freundeslisten verschwinden. Ob man die überhaupt wiederherstellen kann weis ich nicht. \nMasteries sind schnell neu erstellt je nachdem wie es bei Riot funktioniert eventuell den Aufwand nicht wert.\n\n>welcher mir nur mitteilte, dass ich für die Sicherheit meines Accounts selbst verantwortlich bin und nun für die 50 Euro (!) an Punkten aufkommen müsse oder der Account bleibt dauerhaft gesperrt. Was zur Hölle? Erst bin ich Opfer eines Hackangriffs und dann soll ich auch noch dafür bezahlen? Wie können denn überhaupt unauthorisierte Zahlungen mit auf einem Account vorhanden Punkten getätigt werden, liebe Riot Mitarbeiter? \n\nDas mit den 50€ ist auch recht einfach. Dein \"Hacker\" hat sich damit RP gekauft, diese Zahlung hat er vermutlich rückgängig gemacht als er gesehen hat das er den Account nicht mehr hat. Nun wurden Riot die vorher überwiesenen 50€ wieder abgezogen, die RP sind aber noch auf dem Account. Entsprechend wird der Account gesperrt bis dieser Fehlbetrag behoben ist.\n\n> diese ganz offensichtlich nicht vom Kunden georderten Punkte von diesem bezahlen zu lassen?\n\nWo ist das offensichtlich?","replies":[{"poster":"R3Lapsed","date":"2015-10-23T13:22:27.869+0000","up_votes":2,"down_votes":1,"body":"Offensichtlich in dem Sinne als das ich Riot ganz einfach zutraue, nachzuvollziehen wer wann welche Transaktionen getätigt hat. Der Zeitpunkt des Accountverlusts ist bekannt, sowie der Zeitpunkt des Servertransfers, unterschiedliche Bankverbindungen sind zu erkennen und und und. \nWenn man sich der Sache annimmt, kann mit Sicherheit herausgestellt werden, dass ich diese Punkte nie bestellt habe und dann ist es wohl auch ein Leichtes diese einfach wieder vom Account zu entfernen.\n\nDie Problematik mit den Punkten ist mir klar, aber selbst wenn der Hacker (oder neue Accountnutzer) die Zahlung zurückzieht, ist es doch wohl nicht zu viel verlangt diese Punkte vom Account zu löschen. Denn ich möchte mir selbst aussuchen für welche Punkte ich wann bezahle!\n\nUnd zu deinem ersten Punkt: Ich denke die Art wie es zu der Accountübernahme kam, spielt hier keine Rolle. Ich habe mittlerweile entsprechende Vorkehrungen getroffen... Zudem habe ich mit Riot natürlich nicht nur über den Servertransfer gesprochen, sondern wie beschrieben sogar in mehreren Tickets auf die Problematik aufmerksam machen wollen und dies in ähnlichem Umfang wie hier.\nHier geht es viel eher um das Verhalten seitens Riot Games, wie mit dieser Problematik umgegangen wird, sobald irgendwie Geld abgegriffen werden kann. Ich bin mir sicher, Einige würden nachgeben und das Geld bezahlen... Ich für meinen Teil bin einfach nur maßlos enttäuscht von dieser Art des Kundensupports!\n\nPS: Der Verlust der Freundesliste stellt hier für mich das geringste Problem dar... Der Fokus liegt ganz klar auf den von mir zu bezahlenden RP!","replies":[{"poster":"HyperionCH","date":"2015-10-23T13:40:05.366+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=R3Lapsed,realm=EUW,application-id=7hciEY9w,discussion-id=6ETEkzOL,comment-id=00030001,timestamp=2015-10-23T13:22:27.869+0000)\n>\n\n> Die Problematik mit den Punkten ist mir klar, aber selbst wenn der Hacker (oder neue Accountnutzer) die Zahlung zurückzieht, ist es doch wohl nicht zu viel verlangt diese Punkte vom Account zu löschen. Denn ich möchte mir selbst aussuchen für welche Punkte ich wann bezahle!\n\nDas Problem ist wohl, dass du jene RP selber auch benutzt hast, um den Namechange durchzuführen.\nWenn Riot die RP wieder rausnimmt, dann wäre das RP-Konto dann wohl im Minus.\n\nVielleicht ist es möglich, dass du nur einen Teil der RP bezahlen musst; nämlich so viel, dass der Namechange damit bezahlt ist (und das RP-Konto - nach Abzug der \"fremden 50 Euro\" - im Plus landet).","replies":[{"poster":"R3Lapsed","date":"2015-10-23T14:01:35.248+0000","up_votes":3,"down_votes":1,"body":"das würde ich liebend gerne tun, wird mir von Riot aber nicht ermöglicht. ;-)\n\nDass ich diese Punkte nicht ausgeben darf, konnte ich zudem vorher nicht wissen. Über diese Information wäre ich natürlich dankbar gewesen, hätte Riot den Account vielleicht einfach überprüft oder auf einen vorherigen Stand zurückgesetzt anstatt ihn mir einfach in diesem Zustand auszuhändigen und mich somit ins Schlamassel zu reiten. Auch ein Weg seine Forderungen einzutreiben... aber ganz sicher kein Weg der Kunden zufrieden stellt.","replies":[{"poster":"HyperionCH","date":"2015-10-23T14:29:54.451+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=R3Lapsed,realm=EUW,application-id=7hciEY9w,discussion-id=6ETEkzOL,comment-id=0003000100000000,timestamp=2015-10-23T14:01:35.248+0000)\n>\n\n> Dass ich diese Punkte nicht ausgeben darf, konnte ich zudem vorher nicht wissen. \n\nSorry, sehe ich persönlich anders.\nDu wusstest offenbar, dass du nicht so viele RP hast und diese RP wohl nicht dir gehören.\nEntsprechend kann man erwarten, dass die RP weggenommen werden.","replies":[{"poster":"Ruebentoni","date":"2015-10-23T14:53:52.407+0000","up_votes":7,"down_votes":0,"body":"Wenn eine Rückgabe eines \"geklauten Accounts\" durch Riot gemacht wird, würde ich persönlich davon ausgehen, dass dieser danach zur sofortigen freien Verfügung steht.\nKlar hat er kein Recht auf die RP, aber das Problem ist wohl, dass die RP nicht durch Riot zurückgebucht werden. Anscheinend findet aber eine Nötigung zum Kauf der RP statt, was ich nicht in Ordnung finde.","replies":[{"poster":"Crounty","date":"2015-10-23T15:27:10.390+0000","up_votes":2,"down_votes":1,"body":"Findest du nicht in Ordnung, aber das dürfen die machen, da du den AGB zugestimmt hast, in denen explizit steht, dass es egal ist ob du oder jemand anderes RP gekauft hat, dass es am Ende auf dich zurückfällt, wenn es Probleme gibt.","replies":[]}]},{"poster":"R3Lapsed","date":"2015-10-23T14:50:34.825+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=HyperionCH,realm=EUW,application-id=7hciEY9w,discussion-id=6ETEkzOL,comment-id=00030001000000000000,timestamp=2015-10-23T14:29:54.451+0000)\n>\n> Entsprechend kann man erwarten, dass die RP weggenommen werden.\n\nSie werden allerdings gar nicht weggenommen, sondern in voller Höhe in Rechnung gestellt.","replies":[]}]}]}]}]},{"poster":"Termii TFT","date":"2015-10-23T12:41:18.443+0000","up_votes":2,"down_votes":1,"body":"Bei einem Server transfer geht die FL nicht verloren. Du kannst sie zwar auf dem anderen Server nicht abrufen, wenn du aber zurück transferierst, bekommst du deine alte FL zurück.","replies":[]}]},{"poster":"Support an Bord","date":"2015-10-23T12:39:39.638+0000","up_votes":2,"down_votes":1,"body":"> Ich habe von den Punkten erst einmal eine Namensänderung durchgeführt, damit ich so vielleicht aus dem Fokus der Hacker gerate und einen Folgeangriff vermeide.\n.\n\n>\n> und nun für die 50 Euro (!) an Punkten aufkommen müsse oder der Account bleibt dauerhaft gesperrt.\n\nMich stellt irgendwie die Frage, wieso will Riot  50 € für die Namesänderung ?  oder sollst du die komplett aufgeladenen RP bezahlen? \n\n\nca 10ner Namesnänderung geben und Rest an RP sollen sie einfach vom Acc löschen versteh das irgendwie net :O","replies":[{"poster":"R3Lapsed","date":"2015-10-23T12:58:04.624+0000","up_votes":6,"down_votes":1,"body":"Nein, ich soll die ganzen RP bezahlen...\n\nLetzteres habe ich vorgeschlagen, wurde von Riot Games allerdings abgelehnt!","replies":[{"poster":"Support an Bord","date":"2015-10-23T14:02:56.580+0000","up_votes":2,"down_votes":1,"body":"ah ok ---hmm das ja frech :O  bei den RP für Namensänderung ok.. ich mein is auch schon abfuck genug aber nun komplette RP is irgednwie .. naja sprachlos bin ich :O","replies":[]}]}]},{"poster":"Shiggyvara","date":"2015-10-24T11:24:55.949+0000","up_votes":4,"down_votes":0,"body":"Sicherlich von beiden Seiten doof gelaufen, wie sie sich verhalten haben.\nDer TE hätte sicher keine RP ausgeben dürfen, von denen er wusste, dass sie nicht mit seinem Geld aufgeladen worden sind (selbst wenn der Accountdieb  das Geld tatsächlich aufgeladen hätte).\nVon Riot einen Account rückzutransferieren ohne darauf zu achten, ob noch irgendwelche unsauberen Zahlungsvorgänge auf dem Account laufen und den ursprünglichen Besitzer dann zu informieren, dass er noch Geld aufladen muss ist allerdings auch nicht sonderlich...klug...gehandelt.\n\nWirkliche Brisanz hätte das ganze in meinen Augen allerdings, wenn der TE keine RP ausgegeben hätte und trotzdem zur Zahlung aufgefordert werden würde.\nSo ist das ganze wie geschrieben ne ziemlich doofe Sache für beide Seiten. Meiner Meinung nach hätte man sich hier kulant zeigen sollen und halt den RP Betrag der zur Namensänderung nötig war einfordern sollen und den Rest rückabwickeln.","replies":[]},{"poster":"M1thrand1r","date":"2015-10-23T14:43:40.356+0000","up_votes":5,"down_votes":1,"body":"Ich sehe deine Chancen da sehr gering. In erster Linie bist du nämlich dafür verantwortlich dass dir die Kontrolle über deinen Account abhanden gekommen ist und somit eigentlich auch dafür dass du für 50€ einmal Punkte erstattet hast. Wenn du zum Beispiel  Kino Gutscheine geschenkt bekommst und drei Wochen später hingehst und dafür Bargeld willst werden die dir auch sagen Pech gehabt. Und wenn diese Gutscheine dann noch gar nicht bezahlt wurden dann wirst du wahrscheinlich erst recht Probleme bekommen. Als Firma wäre es für RIOT zum Beispiel auf Dauer ein ziemlicher Verlust wenn einfach jeder mal Riotpunkte kaufen kann und die wenn er es sich doch anders überlegt wieder Geld zurücküberwiesen haben will. Geld dass die Firma schon in die Gewinne mit einberechnet hat. Auch wenn es in deinem Fall natürlich wirklich blöd für dich ist, 50€ RIOT wahrscheinlich auch nicht weiter auffallen würden und du eigentlich nur etwas dafür kannst dass dein PC/PW ungeschützt/unsicher ist, schickt RIOT wahrscheinlich auf sowas einfach mal ne Standartmeldung von wegen Rückerstattung (auch Teilrückerstattung) ist leider nicht möglich. \nIch wünsche dir trotzdem viel Glück dass du eventuell einen netten Supportmitarbeiter erwischt, dem du das ganze vielleicht im TS oder auch per Ticket gut erklären kannst und der dir vielleicht ausnahmsweise eine Rückerstattung macht.","replies":[{"poster":"Phridolin","date":"2015-10-24T07:31:36.987+0000","up_votes":1,"down_votes":2,"body":"Wow, per TS geht das mittlerweile auch oder habe ich da etwas verpasst? Ich finde du hast schön geschrieben, aber was ich finde fehlt ist, dass er genauso gut, rein theoretisch, sein gesamt investiertes Geld von seinem alten Acc zurückfordern könnte, was die 50 E mit Sicherheit locker ausgleichen. Nur würde Riot, das nicht tun, wie du ja schon super beschrieben hast. \nNatürlich ist der Kunde durch sein Passwort teilweise verantwortlich für die Sicherheit seines Acc. Jedoch liegt der bei weitem größere Teil der Verantwortung bei Riot. \n\nEntschuldige bitte die Frage, aber: Willst du wirklich in einer Realität leben, in der Riot munter mit deinem Geld arbeitet und alle Schuld, falls es zu Komplikationen kommen sollte, beim Kunden liegt? Ich nicht.","replies":[{"poster":"Patter91","date":"2015-10-24T07:33:01.797+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Roald91,realm=EUW,application-id=7hciEY9w,discussion-id=6ETEkzOL,comment-id=00080000,timestamp=2015-10-24T07:31:36.987+0000)\n>\n> \n> Jedoch liegt der bei weitem größere Teil der Verantwortung bei Riot. \n\n\nFühre das bitte aus.","replies":[{"poster":"Phridolin","date":"2015-10-24T07:41:05.996+0000","up_votes":1,"down_votes":3,"body":"Nunja, Riot stellt den Account und die digitale Plattform sowie Güter. Wir investieren in das Unternehmen, mehr oder weniger. Da kann man auch diverse Sicherheitsvorkehrungen erwarten, wie bei einem Auto. Wenn ich bereit bin mehr Geld für eine sichere S-Klasse auszugeben und nicht \"nur\" in eine A-Klasse, dann erwarte ich nicht nur mehr Komfort sondern auch mehr Sicherheit - so auch im Umgang mit meinen Daten. Sonst kann Riot gleich eine Funktion einbauen, dass man sein ganzes Geld zurückverlangen kann. Was bestimmt eine Heidenarbeit ist. Viel Spaß!","replies":[{"poster":"Patter91","date":"2015-10-24T07:44:35.845+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Roald91,realm=EUW,application-id=7hciEY9w,discussion-id=6ETEkzOL,comment-id=0008000000000000,timestamp=2015-10-24T07:41:05.996+0000)\n>\n> Nunja, Riot stellt den Account und die digitale Plattform sowie Güter. Wir investieren in das Unternehmen, mehr oder weniger. Da kann man auch diverse Sicherheitsvorkehrungen erwarten, wie bei einem Auto. Wenn ich bereit bin mehr Geld für eine sichere S-Klasse auszugeben und nicht \"nur\" in eine A-Klasse, dann erwarte ich nicht nur mehr Komfort sondern auch mehr Sicherheit im Umgang mit meinen Daten. Sonst kann Riot gleich eine Funktion einbauen, dass man sein ganzes Geld zurückverlangen kann. Was bestimmt eine Heidenarbeit ist. Viel Spaß!\n\nUnd das ist jetzt wo ausgeführt?\nWelche Sicherheitsmaßnahmen soll man noch bereitstellen, außer einem verifizierbaren E-Mail-Konto und dem AUSDRÜCKLICHEN Hinweis, immer und immer wieder, keine unbekannten Links zu klicken oder seine Daten weiterzugeben (und selbst das sollte eigentlich selbstverständlich sein und der Fakt, dass Riot darauf hinweisen muss, ein Armutszeugnis für die Menschheit)? Gegen die Dummheit und die Naivität ist nunmal kein Kraut gewachsen.","replies":[{"poster":"Phridolin","date":"2015-10-24T08:07:17.248+0000","up_votes":1,"down_votes":1,"body":"Nunja, ich habe und werde auch nie irgendwelche \"Links\" und anderweitiges anklicken. Jedoch gibt es bestimmt jüngere, die, ja, etwas naiver sind, was aber eigentlich nichts verwerfliches sein sollte... Dummheit schon eher, jedoch wird dies zu oft nebeneinander gestellt, was traurig ist. \n\nRiot könnte z.B. (mehr) Leute engagieren, die Daten von Usern kontrollieren um solches \"Hacking\" vorzubeugen, oder ihre Firewall weiter verstärken/verbessern etc. ( das sind natürlich Beispiele eines Nicht-Informatikers) \n\nEs gibt bei weitem größere Armutszeugnisse in der Menschheit als auf solche kleinen, banalen Dinge aufmerksam machen zu müssen.\n\n> Und das ist jetzt wo ausgeführt?\n\nIch erwähne hier plausible und humane Tatsachen und keine Paragraphen, sry.","replies":[{"poster":"Sirrkas","date":"2015-10-24T08:16:41.128+0000","up_votes":3,"down_votes":0,"body":"Wie stellst du dir vor, dass Riot Mitarbeiter einstellt, die Hacking vorbeugen sollen? Meistens werden die Leute gephisht. Das heißt, sie geben ihre Daten selbst weiter. Vorbeugen kann man da absolut gar nichts, außer die Leute eben daran zu erinnern, ihre PIN nicht zusammen mit der EC-Karte im Geldbeutel aufzubewahren und an den erstbesten Unbekannten weiterzugeben, der ihnen verspricht, nur 5 € auf deren Konto überweisen zu wollen.\nDie Firewall von Riot zu verbessern, hätte da auch sicher keinen Einfluss darauf. Schließlich werden sich die Zugangsdaten erschlichen und nicht vom Riotserver gestohlen.","replies":[{"poster":"Phridolin","date":"2015-10-24T08:22:04.299+0000","up_votes":1,"down_votes":2,"body":"Ich verstehe nicht wo ihr alle aus seinem Text herauslest, dass er seine Daten weitergegeben hat?!\n\nIch bin ersteinmal nur von mir ausgegangen. Und ich habe und werde meine Daten nicht weitergeben - und gehe deswegen von einem Fall aus, bei dem man keinen \"Fehler\" vom User voraussetzen kann. Deswegen meine Vorschläge. :)","replies":[{"poster":"RoderickAndara90","date":"2015-10-24T08:57:39.422+0000","up_votes":4,"down_votes":1,"body":"Accounts werden nicht gehackt. Der Aufwand würde in keinem Verhältnis zum Nutzen stehen.\n\nMan kommt meist durch 2 Wege an Accounts:\n\nBot-Force oder Boot-Force oder du nennst es noch ganz anders: Hier Programmiert man ein Programm das im Prinzip immer wieder versucht das richtige Passwort zu erraten und sich einzuloggen. Das ist allerdings für die angegriffene Plattform recht einfach zu erkennen. (Weil im normal Fall niemand hunderte Male hinter einander sein PW falsch eingibt)\n\nund\n\nPhishing: Hier denkt man sich eine Strategie aus die den Eigentümer eines Accounts dazu verleitet dir freiwillig seine Daten zu geben. Zum Beispiel versprichst du ihm dann Skins zu kaufen oder RP auf zu laden oder oder oder. Je kreativer du bist desto wahrscheinlicher ist es das Jemand dir seine Daten gibt.\n\nGegen Bot-force kann nur Riot etwas tun. Gegen Phishing kannst nur du etwas tun.\n\nRiot tut seinen Job offensichtlich ganz gut denn sonst würden täglich Tausende Accounts gehackt. Die Summonernamen aller Spieler sind schließlich durch Foren oder LoL-King frei einsehbar, sogar die von Pro-Playern.\n______________________________________\n\nHacking wäre eine ganz andere Liga. Dabei müsste jemand direkt auf das Computernetzwerk von Riot zu greifen und die Daten von dort kopieren. Wenn die Leute soweit kommen würden, würden sie allerdings wertvolleres stehlen als nur ein paar Accounts von Teenis. ; )","replies":[{"poster":"Phridolin","date":"2015-10-24T09:25:37.484+0000","up_votes":1,"down_votes":0,"body":"Wow, okay. Danke für die plausible Erklärung. Muss wahrscheinlich schwer sein einem einfachen Dude, wie mir, der sich noch nicht mit dieser Materie intensiv befasst hat, alles so zu erklären. Danke!\n\nNun, ich ging dann halt von \"Bot-Force\" aus.  Aber Pishing, was ich durchaus schonmal gehört und gelesen habe ^^, ist wohl wahrscheinlicher...\n\nStimmt, wahrscheinlich gibt es bei Hacking wirklich interessantere Daten als ein paar Acc. (Teenies würde ich jedoch weglassen, da es auch ältere Dudes gibt - mich eingeschlossen :P )","replies":[{"poster":"PwnGU1N","date":"2015-10-25T03:32:20.571+0000","up_votes":1,"down_votes":0,"body":"Könnte auch ein Keylogger sein, der Passwörter mitschreibt.\nNachdem man gehackt wurde, sollte man deshalb unbedingt auf Viren prüfen,\nalle PWs (die gleich sind) ändern und auf jedenfall sichere wählen.\nIch z.B. habe keine gleichen Passwörter und jedes besteht aus 24 Zeichen. \nBeispiel: 12Y,+E#~z!?PQs|nMf%x9Gkj\"\nIst effektiv gegen Brute-Force, da es lang ist und kein \"normales\" Wort ist.","replies":[]}]},{"poster":"PwnGU1N","date":"2015-10-25T03:24:01.840+0000","up_votes":1,"down_votes":0,"body":"Was soll denn Boot-Force sein? Kenne nur Brute-Force.","replies":[]}]}]}]}]}]}]}]}]}]},{"poster":"Ludovico","date":"2015-10-23T13:00:53.493+0000","up_votes":3,"down_votes":0,"body":"Auch von meiner Seite aus Beileid.\n\nWas die Transaktion angeht, habe ich erst vor wenigen Tagen einen ähnlichen Fall in den NA Foren gelesen, dort wurde auch auf die entsprechende Begründung von Riot Games eingegangen... vllt finde ich ihn ja nochmal. \n\nHoffe das klappt alles noch!","replies":[]},{"poster":"Humpelstilzche","date":"2015-10-23T12:23:14.150+0000","up_votes":4,"down_votes":3,"body":"> Auf die Forderung die Punkte zu löschen und die Transaktion einfach rückgängig zu machen wurde nicht geantwortet\n\nWie lange hast du gewartet?\n\n> Auch bei zwei weiteren Tickets, die ich daraufhin geschrieben habe und einem vernichtenden Rückmeldebogen auf meine Supportanfrage wurde nicht reagiert. \n\nIch frage deshalb, weil das Spammen von Tickets deiner Sache nicht zuträglich ist. Jedes mal wenn du dein Ticket \"bumpst\" oder weitere Tickets eröffnest, landest du wieder am Ende der Warteschlange. Diese Methode schützt den Support vor Spam und verhindert dass Spammer früher bearbeitet werden als normale User. \n\nIch kann mich im Bedarfsfall gerne mal nach deinem Ticket erkundigen, aber vorher muss ich natürlich wissen ob da überhaupt irgendwas ungewöhnlich ist, oder ob es sich eine völlig normale oder selbst verursachte Wartezeit handelt. \n\nGanz generell kann ich dir sagen dass die meisten Unternehmen, inklusive Riot, bei Verstößen gegen die Nutzungsbedingungen sehr strikt vorgehen. Das gilt unter anderem auch für entstandene Schäden durch den Verlust des Accounts, für dessen Sicherheit laut Nutzungsbedingungen der Nutzer selbst verantwortlich ist. Ich weiß nicht wie Riot bei einem Fall wie deinem vorgeht, aber rein präventiv möchte ich dich darauf hinweisen, dass deine Chancen nicht soooo gut stehen. Ich will nicht ausschließen dass dir geholfen werden kann, aber ich halte es für unwahrscheinlich.","replies":[{"poster":"Méldis","date":"2015-10-23T17:29:50.783+0000","up_votes":5,"down_votes":2,"body":"ok, mal angenommen riot macht das nicht weil ihnen die nutzungsbedingungen so wichtig sind und sie den standpunkt vertreten: jeder ist selbst für die sucherheit seines accounts verantwortlich.\n\nwarum wurde sein account dann überhaupt nach EUW transferiert?\n\nfür mich als absolut neutralen beobachter o hne jegliches hintergrundwissen sieht es nämlich so aus: \"na gut, transferieren wir ihm den account halt zurück, aber dann sperren wir ihn weil er die RP verwendet und wetten wir greifen 50 euro von einem verzweifeltem suchti ab.\"\n\nwenn sich der fall wurklich so zugetragen hat wie vom TE geschildert und wenn riot wirklich weiterhin auf ihren nutzungsbestimmungen behaart, dann find ich das in diesem fall einfach ganz ganz schwach.","replies":[{"poster":"Humpelstilzche","date":"2015-10-23T18:31:22.062+0000","up_votes":3,"down_votes":3,"body":"> na gut, transferieren wir ihm den account halt zurück, aber dann sperren wir ihn weil er die RP verwendet und wetten wir greifen 50 euro von einem verzweifeltem suchti ab.\"\n\nIch bin mir ziemlich sicher dass das nicht der Gedankengang dahinter war. Ich kenn die Jungs und Mädels mittlerweile ganz gut und das sind alles keine bösen Menschen. \nIch weiß nicht genau was den Support angetrieben hat hier so zu handeln, böse Absicht war es aber sicherlich nicht.","replies":[{"poster":"NastySurprise","date":"2015-10-25T13:26:58.698+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Humpelstilzche,realm=EUW,application-id=7hciEY9w,discussion-id=6ETEkzOL,comment-id=000200010000,timestamp=2015-10-23T18:31:22.062+0000)\n>\n> Ich bin mir ziemlich sicher dass das nicht der Gedankengang dahinter war. Ich kenn die Jungs und Mädels mittlerweile ganz gut und das sind alles keine bösen Menschen. \n\nAch Humpel...außer dir, Legofreak und PureIc3 (was macht Maurice eigentlich aktuell?) sind alle offiziellen Mitartbeiter \"Devil in disguise\". ;)\n\nNein ernsthaft, ich selbst hatte noch nie Probleme mit dem Support. Im Gegenteil, bei den Dingen die ich dem Support bisher zu getragen habe waren sie freundlich, hilfsbereit und sehr kulant. Aber auch ich kenne die Schattenseiten des Supports. Denn ich kenne einen ganz ähnlichen Fall. Der Account eines Freundes aus Norwegen wurde gehackt und in die Türkei transferiert. Da hat der örtliche Riot Support sich nicht einmal bemüht den Account zurück zu transferieren, sie haben den ursprünglichen Besitzer des Accounts mit \"Da hast du eben Pech gehabt\" abgespeist und er wird seinen Account nicht zurück erhalten. \n\nIn dem hier vorgetragenen Fall frage auch ich mich - wenn du vorher genau wußtest das das Riot Points sind die du selbst nicht gekauft hat - wieso fragst du nicht (um eine Sicherheit zu haben) zu erst beim Support nach was mit eben jenen RP ist bevor du einfach eigenständig handelst und zumindest einen Teil davon ausgibst? Fragen kostet doch nichts. Das war schon ein wenig naiv zu denken, das dir die RP die sich nun auf deinem Konto befinden, zur freien Verfügung stehen.","replies":[]}]}]},{"poster":"R3Lapsed","date":"2015-10-23T13:03:54.174+0000","up_votes":2,"down_votes":1,"body":"Ich habe ca. 2-3 Wochen gewartet bis dann eine kurze, oberflächliche Antwort auf das ursprüngliche Ticket kam, die keineswegs näher auf mein Problem eingegangen ist (Riot möchte seine 50 Euro und damit scheint das Problem aus deren Sicht erledigt).\n\nJedenfalls scheitert es nicht daran, dass sie auf mein Problem (zeitlich) nicht mehr eingehen, sondern dass sie es gar nicht erst wollen (siehe deren letzte Antwort)!","replies":[]}]},{"poster":"Méldis","date":"2015-11-05T07:59:44.536+0000","up_votes":1,"down_votes":0,"body":"wie ist denn die sache ausgegangen? ist riot dabei geblieben?","replies":[{"poster":"R3Lapsed","date":"2015-11-12T21:03:17.850+0000","up_votes":2,"down_votes":1,"body":"Nein... Ich habe seit diesem Post weder eine Antwort auf mein Ticket erhalten noch gab es eine öffentliche Stellungnahme. Es ist und bleibt eine ganz schwache Leistung des Riot Supports...\n\nIch habe meinen Account mittlerweile aufgegeben, da ich wie schon gesagt diesen Betrag nicht bezahlen werde. Leider wird es Riot dabei kein bisschen stören einen Spieler bzw. 50€ (oder auch mehr?) verloren zu haben...\n\nAllerdings hoffe ich damit auf das Problem aufmerksam gemacht und vielleicht auch den ein oder anderen Spieler zu einer Riot-Investition weniger bewogen zu haben... vielleicht wurde der Post aber auch von Riot wahrgenommen und sie versuchen wenigstens solche Probleme in Zukunft anständiger zu lösen, wäre mit Sicherheit die beste Variante!","replies":[{"poster":"legofreak1","date":"2015-11-12T21:05:26.831+0000","up_votes":3,"down_votes":2,"body":"Wie wärs, wenn du uns die ganze Geschichte erzählst? Was du hier gepostet hast, ist nicht alles und doch recht lückenhaft. Wenn du schon Anschuldigungen erhebst, dann bitte vollständig. Siehe dazu meinen Kommentar von vor ca. 3 Wochen:\nhttp://boards.euw.leagueoflegends.com/de/c/hilfe-support-de/6ETEkzOL-riot-support-versagt-auf-ganzer-linie?comment=0010","replies":[{"poster":"R3Lapsed","date":"2015-11-13T00:01:24.664+0000","up_votes":1,"down_votes":1,"body":"Welche Informationen fehlen denn deiner Meinung nach bzw. wo siehst du Lücken? Ich habe es eigentlich ziemlich schlüssig erzählt...\nGeht es dir um die Ursache der Accountübernahme (wenn ja: welche Rolle spielt das hier?)? Ich habe jedenfalls kein Account-Sharing betrieben, nur ich kannte die Daten. Vermutlich war das PW zu unsicher... Ich weiß es nicht, habe aber wie gesagt mittlerweile entsprechende Maßnahmen unternommen (bringt mich allerdings nun auch nicht weiter!). \nErklär mir bitte inwiefern das nun in Bezug zur Reaktion des Riot Supports steht!? es spielt hier keine Rolle...","replies":[{"poster":"legofreak1","date":"2015-11-13T00:10:39.357+0000","up_votes":3,"down_votes":2,"body":"Natürlich spielt es eine Rolle, sonst würde ich dich nicht explizit hiernach fragen. Du weichst meiner Frage danach auch immer wieder aus. Wie gesagt, wenn du Hilfe und die Community auf deine Seite ziehen möchtest, dann liefer die gesamte Geschichte und nicht nur Bruchstücke davon, die du dir passend für deine Geschichte zurechtgelegt hast. Wenn du unschuldig bist, musst du nicht verbergen, wie du deinen Account verloren hast.","replies":[{"poster":"Shiggyvara","date":"2015-11-13T10:02:46.069+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=legofreak1,realm=EUW,application-id=7hciEY9w,discussion-id=6ETEkzOL,comment-id=00110000000000000000,timestamp=2015-11-13T00:10:39.357+0000)\n>\n> Natürlich spielt es eine Rolle, sonst würde ich dich nicht explizit hiernach fragen. Du weichst meiner Frage danach auch immer wieder aus. Wie gesagt, wenn du Hilfe und die Community auf deine Seite ziehen möchtest, dann liefer die gesamte Geschichte und nicht nur Bruchstücke davon, die du dir passend für deine Geschichte zurechtgelegt hast. Wenn du unschuldig bist, musst du nicht verbergen, wie du deinen Account verloren hast.\n\nEs gibt die Möglichkeit des Accountverkaufs.\n\nDann macht sich Riot in meinen Augen tatsächlich rechtlich schuldig, indem sie Beihilfe zu Betrug geleistet hätten, wenn ihnen dementsprechende Informationen vorliegen und sie den Account dennoch rücktransferieren und spielbar halten, wenn der Alte Accountbesitzer die Schulden des Neuen bezahlt.\nIn so nem Fall wär dann nur Komplettstillegung angebracht.\n\nAlso was dubiose Anschuldigungen angeht gibtst du hier grade auch kein tolles Bild ab...","replies":[{"poster":"HyperionCH","date":"2015-11-13T11:15:38.214+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FTHGN,realm=EUW,application-id=7hciEY9w,discussion-id=6ETEkzOL,comment-id=001100000000000000000001,timestamp=2015-11-13T10:02:46.069+0000)\n>\n> Dann macht sich Riot in meinen Augen tatsächlich rechtlich schuldig, indem sie Beihilfe zu Betrug geleistet hätten, wenn ihnen dementsprechende Informationen vorliegen und sie den Account dennoch rücktransferieren und spielbar halten, wenn der Alte Accountbesitzer die Schulden des Neuen bezahlt.\n> In so nem Fall wär dann nur Komplettstillegung angebracht.\n\nSo wie ich es verstanden habe, hat Riot schlicht und einfach den Account so schnell wie möglich dem alten Accountbesitzer (der offenbar durch Phishing den Account verlor) zurückgegeben.\nDies ist ja meist auch im Sinn des Spielers, dass sie ihren verlorenen Account rasch wieder bekommen.\n\nRiot kann aber bezahlte RP nicht einfach wieder vom Konto nehmen, selbst wenn sie von jemandem anderen (jener Spieler, der den Account illegal erworben haatte) bezahlte. Dies ist rechtlich nicht zulässig.\n\nAlso muss Riot den RP-Betrag einfach auf dem Konto lassen. Jener Spieler, der zwischenzeitlich den Account hatte (und RP kaufte) machte natürlich die Zahlung rückgängig. Ab diesem Zeitpunkt (und nicht früher) darf Riot die RP wieder vom Konto abziehen.\n\nDummerweise hat der TE jene RP selber verbraucht, die eigentlich nie seine gewesen wäre. Er hätte ja davon ausgehen sollen, dass diese RP wieder abgezogen werden.\nIch meine, was würdest du tun, wenn du z.B. plötzlich 1 Mio. Euro auf deinem Bankkonto hast und du weissst, dass da wohl eine Fehlüberweisung war? Wenn du die Million selber brauchst, obwohl du weisst, dass es nicht deine sind, dann ist es auch deine Schuld, dass die Bank später die Buchung rückgängig macht und man nun 1 Mio. Euro Schulden hat.\n\nDies wäre zumindest die Ausgangslage anhand den Infos hier. Wie erwähnt sind da schon einige Lücken vorhanden.\n\nEs ist aber keineswegs so, dass der TE die Schulden des zwischenzeitlichen Nutzers bezahlen.\nEr muss seine Shop-Einkäufe (z.B. Nickname-Änderung) bezahlen, die er selber konsumierte, jedoch mit RP zahlte, die nicht von ihm stammen (jene RP wurden wieder weggenommen; vermutlich nach einer Rückbuchung des anderen Nutzers).\n\n\"Komplettstilllegung\" ist ja mehr oder weniger vorhanden. So lange der TE nicht seinen Shop-Konsum bezahlt, liegt der Account brach.","replies":[{"poster":"legofreak1","date":"2015-11-13T11:45:50.226+0000","up_votes":3,"down_votes":2,"body":"> [{quoted}](name=HyperionCH,realm=EUW,application-id=7hciEY9w,discussion-id=6ETEkzOL,comment-id=0011000000000000000000010000,timestamp=2015-11-13T11:15:38.214+0000)\n>\n> Dies wäre zumindest die Ausgangslage anhand den Infos hier. Wie erwähnt sind da schon einige Lücken vorhanden.\n\nUnd wir haben keine Bestätigung dafür, dass sämtliche gegebenen Infos der Wahrheit entsprechen. Viele der Geschichten, die hier und im Spielerverhalten auftauchen, zeigen, dass Permagebannte Spieler das blaue vom Himmel lügen würden, um ihren Account wieder zurückzubekommen. Man muss die Geschichte also mit einer gehörigen Portion Misstrauen lesen.","replies":[{"poster":"HyperionCH","date":"2015-11-13T12:41:18.695+0000","up_votes":3,"down_votes":2,"body":"Dies kommt natürlich auch vor, wenn auch nicht immer.\nOft werden Aussagen seitens Riot Support auch nur falsch verstanden (OK, möglicherweise wird es auch gerne absichtlich falsch verstanden).\n\nDass der TE natürlich nicht mehr Infos preisgeben möchte, macht natürlich stutzig.\n\nZwar wird \"Phishing\" zwar oft fälschlicherweise als \"Hacking\" bezeichnet, jedoch klärt sich dieser Irrtum oft rasch, weil der jeweils betroffene Spieler genau erklärt, was passiert ist.\nDer TE hier jedoch vermeidet es immer, genaue Details zu geben, wie er den Account verloren hat. \"Echtes Hacking\" kann man - wie du es auch richtig sagst - ausschliessen. So lange der TE hier nicht mehr Angaben macht, kommt man leider nicht an der Annahme vorbei, dass da wohl auch etwas faul ist in seiner Story.","replies":[{"poster":"R3Lapsed","date":"2015-11-13T20:14:44.486+0000","up_votes":3,"down_votes":1,"body":"> Dass der TE natürlich nicht mehr Infos preisgeben möchte, macht natürlich stutzig.\n\nWo genau leßt ihr das denn immer raus? Ich habe hier zuvor mehrfach angeboten, dass ihr mich gerne nach allen Infos fragen könnt. Denn mir selbst fallen keinerlei Lücken auf ...\n\nUnd denkt mal über Folgendes nach: Warum sollte ich hier eine Stellungnahme seitens Riot fordern, wenn ich etwas zu verbergen hätte? Würde das nicht vollkommen nach hinten losgehen? Damit könnten sie mich ja auffliegen lassen und ich würde hier als Vollidiot dastehen... glaubt mir, diese Schmach würde ich mir nicht antun.\n\nIhr könnte gerne weiter auf eurer Meinung beharren, ich würde hier etwas Falsches erzählen oder verbergen... beweisen kann ich es sowieso nicht. Einer Lösung wird uns das Ganze allerdings kein bisschen näher bringen!","replies":[{"poster":"legofreak1","date":"2015-11-13T20:17:31.978+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=R3Lapsed,realm=EUW,application-id=7hciEY9w,discussion-id=6ETEkzOL,comment-id=0011000000000000000000010000000000000000,timestamp=2015-11-13T20:14:44.486+0000)\n>\n> Ich habe hier zuvor mehrfach angeboten, dass ihr mich gerne nach allen Infos fragen könnt.\n\nEs wurde danach gefragt und eine eindeutige Antwort hast du bis jetzt nicht gegeben.","replies":[{"poster":"R3Lapsed","date":"2015-11-13T20:30:16.928+0000","up_votes":1,"down_votes":2,"body":"> Accounts werden nicht einfach so gehackt. Niemand macht sich die Mühe und hackt sich in RIOTs Datenbanken, um dann einen einzelnen wertlosen Account zu klauen. Es gibt mehrere andere Möglichkeiten, wie dir dein Account abhanden gekommen ist. Wenn du die ganze Geschichte postest, kann man zumindest besser spekulieren, warum der Support so gehandelt hat.\n\nIch nehme an du beziehst dich nach wie vor hierauf?\n\nAlso: Ich habe den Account weder verkauft, noch geshared, noch sonst irgendwas, dass man mir in Richtung Sicherheit vorwerfen könnte... einzig wie schon erwähnt ein vermutlich zu unsicheres Passwort!\n\nZudem bin ich vor diesem Vorfall nie negativ aufgefallen, ich habe noch keinen Bann oder Ähnliches bekommen und bin auch nicht komplett ohne Investitionen in das Spiel geblieben (sodass man hier vielleicht weniger Entgegenkommen erwarten dürfte...).","replies":[{"poster":"HyperionCH","date":"2015-11-13T21:05:33.820+0000","up_votes":3,"down_votes":0,"body":"Wie bereits erwähnt:\n\nDass ein Hacker versucht, das Passwort zu hacken ist sehr, sehr, sehr, sehr unwahrscheinlich.\nWozu soll man sich denn auch diese Mühe machen?\n\n- Der Aufwand ist riesig, um nur gerade einen einzigen Account zu hacken.\n- Wenn die e-mail verifiziert ist, dann ist die Hacker-Arbeit trotzdem umsonst (ausser man hat beim e-mai-Account das selbe Passwort; aber dann hättest du ein ganz anderes Problem!)\n- Der Ertrag ist viel zu niedrig. Sorry, aber wie viel ist schon ein Silber-Account wert? (bin selber Silber; soll also nicht herablassend sein).\n- Damit der Ertrag bei so viel Aufwand für den Hacker rentabel ist, müsste er schon direkt bei Riot hacken. Aber a) es ist nicht bekannt, dass im grossen Stil Accounts geklaut wurden und b) würden andere Game-Account wohl rentabler sein (z.B. Sony Playstation, Steam, etc.)\n- Der Aufwand ist für Verbrecher viel geringer - mit grösserem Ertrag -, wenn sie Phishing betreiben.\n\nDa die ersten Punkte alle ausschliessen, dass Hacker am Werk waren (weder beim Riot-Server - da sonst mehr Accounts betroffen wären - noch bei dir alleine - da zu viel Aufwand für den Hacker), bleibt somit nur Phishing übrig, wenn die Story mit dem geklauten Account stimmt.\nJedoch hättest du in diesem Fall eine Seite anklicken müssen, wo du dich mit dem LoL-Account anmelden musst (z.B. \"Free-RP\" oder anbebliches \"Tribunal\", um jemanden vor einem ban zu helfen, etc.). Davon hast du nie etwas gesagt und obwohl wir Phishing angesprochen haben, bist du immer noch fest von Hacking überzeugt.\n\nEs ändert sich nichts. Die Story ist lückenhaft und unglaubwürdig.","replies":[]}]}]}]}]}]}]}]}]}]}]}]}]}]}