{"poster":"Hyperhaze","date":"2017-05-22T18:55:14.523+0000","title":"I want to make sure the Tribunals justice is served!","subforum":"Player Behaviour","up_votes":1,"down_votes":2,"body":"Riot It would be highly appreciated if you had a look into the oceanic player [REMOVED] for AFKing and intentionally feeding in ranked match that my team was dominating. Also the other players [REMOVED] and [REMOVED] who encouraged [REMOVED] to feed to them when they realized what was going on in the match, and also coached him on how to reset his gold value in the game so he could feed more gold to them. I&#039;m not sure if what [REMOVED] and [REMOVED] did is an offense but I know for a fact that the [REMOVED] ruined the game experience for my entire team because of a blue buff he didn&#039;t recieve. Follow link for evidence [REMOVED]\n\nThe reason for his &quot;unhelpful&quot; behavior in the match was due to a blue buff he didn&#039;t recieve...","replies":[{"poster":"YellowBrickRoad","date":"2017-05-22T19:29:32.147+0000","up_votes":2,"down_votes":3,"body":"They wont do shit.\n\nThey dont care.","replies":[{"poster":"Hyperhaze","date":"2017-05-22T19:36:03.136+0000","up_votes":3,"down_votes":1,"body":"get out of my thread","replies":[{"poster":"YellowBrickRoad","date":"2017-05-22T19:45:54.365+0000","up_votes":1,"down_votes":2,"body":"https://www.youtube.com/watch?v=HldZ79Bef5Q\n\nopen your bloody eyes mate.\n\nYou think your special, you think your particular case of feeding is more important than the millions of cases a year of the same exact thing that go unpunished?\n\n#bringbackthetribunal\n\nHeres another piece of juicy info that proves the system doesnt work.\n\nhttps://images.discordapp.net/.eJwFwVsOhCAMAMC7cADKu-ptCBI0q5TQGj82e_ed-apnXmpTh8jgDWA_udDcNQvN3KpuRO2qeZysC92QRXI57tqFwcZlQeuiMc7EFTFZ8NbZZEJIbvXoMaCDp386vV2P3tTvDwYMItU.xLquNpdAiuUU4NoTy7KDtloB5mI\n\nThats all one guy, follow that youtube link.\n\nRiot says they dont have enough evidence to ban him.\n\nYeah because across 13 accounts in 9 different regions all doing nothing but feeding, you couldnt find a shred of evidence to ban him, good job riot.\n\nFace it, their automatic system only bans on trigger words.\n\nAnd your report wont even be looked at by a human, unless its a repeated offence.\n\nSo if all they do is feed, they wont get banned, period.","replies":[{"poster":"MasterMirkinen","date":"2017-05-22T23:56:57.643+0000","up_votes":3,"down_votes":1,"body":"That's actually not true, I just checked all that accounts and they are all banned.\n\nI'm not saying that the system is perfect but saying we don't care is an awful thing to say considering how many people and time is put on it to try to make it better. We have some solid features already and more to come and our objective will always be to reward sportmanship and punish basd behavior.\n\nOne thing to remember is that while we do manual auditing some time, it impossible to scale (with 100milions players a month this doesn't scale) so our systems will only punish players once the \"crime\" is done (this until we acquire some precog...).\n\nThe best thing to do is to report the player and \"feed\" the system.\n\n@YellowBrickRoad, the summoner name you mentioned is not a LOL player. I found this one though that seems the one you are talking about:\nhttps://oce.op.gg/summoner/userName=AmazingCrazy+\n\nI'm ver sorry you had this experience but from his match history, it looks like he had a bad game. It happens. it is not cool but it is not enough to punish straight away the player. Be reassured that if the player systematically misbehave and the community reports him/her, he will be punished.\n\nMM","replies":[{"poster":"YellowBrickRoad","date":"2017-05-23T02:43:29.980+0000","up_votes":2,"down_votes":1,"body":"I have a list of players that have been repeatedly misbehaving and reported for over two years without the system so much as slapping their wrist.\n\nTalk is cheap.","replies":[]},{"poster":"trolledallmylife","date":"2017-05-24T02:15:42.922+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=MasterMirkinen,realm=OCE,application-id=T8eq2lFQ,discussion-id=acQPj8vn,comment-id=0000000000000000,timestamp=2017-05-22T23:56:57.643+0000)\n> That&#x27;s actually not true, I just checked all that accounts and they are all banned.\n> \n> I&#x27;m not saying that the system is perfect but saying we don&#x27;t care is an awful thing to say considering how many people and time is put on it to try to make it better. We have some solid features already and more to come and our objective will always be to reward sportmanship and punish basd behavior.\n> \n> \n> MM\n\nHow many people and time to make it better? Tell me EXACTLY what you have done to the punishment system that was not already there 4-5 years ago? \n\nThe stupid automated system you have in place can be easily abused and has not changed or improved at all! \n\nAFK system - already there since beginning, easily abused by moving the mouse of attking a minion once a while\nVerbal abuse system - already there since beginning, easily abused by swearing in another language or using ACRONYMS such as KYS instead of kill yourself\nINT feeding system - already there since the beginning, easily abused by attking an enemy champ before u tower dive \n\nYou should seriously consider firing all the devs working on the punishment system because they are getting paid to do NOTHING!\n{{sticker:zombie-brand-facepalm}}","replies":[{"poster":"alsex","date":"2017-05-27T03:16:11.901+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=trolledallmylife,realm=OCE,application-id=T8eq2lFQ,discussion-id=acQPj8vn,comment-id=00000000000000000001,timestamp=2017-05-24T02:15:42.922+0000)\n>\n> How many people and time to make it better? Tell me EXACTLY what you have done to the punishment system that was not already there 4-5 years ago? \n> \n> The stupid automated system you have in place can be easily abused and has not changed or improved at all! \n> \n> AFK system - already there since beginning, easily abused by moving the mouse of attking a minion once a while\n> Verbal abuse system - already there since beginning, easily abused by swearing in another language or using ACRONYMS such as KYS instead of kill yourself\n> INT feeding system - already there since the beginning, easily abused by attking an enemy champ before u tower dive \n> \n> You should seriously consider firing all the devs working on the punishment system because they are getting paid to do NOTHING!\n> {{sticker:zombie-brand-facepalm}}\n\nYeah I know right.. IKR\nHow about just saying \" Sicko \" Saying this gets you ban.\nOr just saying moron or moronic.. But if you say \" Stop fing little kids you sico \" NO BAN!!!!!!! Great job riot. \n\nhere is a meme just for you riot.\n\nhttps://media.licdn.com/mpr/mpr/AAEAAQAAAAAAAAVuAAAAJGJhYmZlNjY1LTA2NDgtNDEyZS1hNjM2LTJhM2ExMDMwYjliYg.jpg","replies":[]}]}]}]}]}]}]}