{"poster":"RaviRaptor","date":"2018-09-21T00:22:55.466+0000","title":"Odyssee","subforum":"Allgemeiner Chat","up_votes":1,"down_votes":0,"body":"Ich muss jetzt einfach mal etwas zu diesem Modus loswerden was mich ganz sch&ouml;n bedr&uuml;ckt und gerade nach einer weiteren Niederlage mit arroganten random Mitspielern mit negativen Gedanken zur&uuml;ckl&auml;sst, weshalb ich schon wieder keine Lust auf das Spiel im Allgemeinen habe..\r\n\r\nIch h&auml;nge nun schon seit gef&uuml;hlt 20 Games an dem letzten Schwierigkeitsgrad von Odyssee. Ich habe noch immer die Mission diesen Schwierigkeitsgrad zu gewinnen, eine Mission diesen mit 5 gleichen Champions zu gewinnen und die Mission den Modus mit nur 3 ausger&uuml;steten Augmentierungen zu Gewinnen. Alles sch&ouml;n und Gut, jedoch spiele ich Solo und nicht mit Premades (ich wei&szlig; das w&auml;re dann Wohl sehr viel einfacher). Nun bin ich also schon mit sehr vielen randoms in die Queue gegangen und in fast jeder Runde kamen Leute rein und schrieben Dinge wie z.b. &quot; only Yas pls&quot; oder &quot;only 3 (2) augs pls&quot; ich denke mir also OK versuchen wir es. Ihr k&ouml;nnt es euch denken: Verloren. Verloren. Verloren.\r\n\r\nIch &Uuml;berlege also und komme so auf den Gedanken dass man den Modus wohl nur vern&uuml;nftig Besiegen kann wenn man genug Augmentierungen ausger&uuml;stet hat, habe in den ganzen Niederlagen auch langsam aber sicher alle Freigeschaltet, denke nun also kann es losgehen.\r\n\r\nAber nein, denn IMMER wenn ich in eine neue Auswahl komme gibt es Mitspieler die nur 3 oder 2 Augmentierungen ausger&uuml;stet haben m&ouml;chten. In meinem letzten Spiel, &uuml;ber dass ich nun gerne Reden m&ouml;chte, war also ein 2er Premade welches in die Champselect kam und meinte &quot;all 2 augs&quot;.\r\nEin anderer Mitspieler war dessen ebenfalls nicht sehr Gl&uuml;cklich und fragte nach 3 Augmentierungen. Sie lie&szlig;en sich aber nicht von Ihrem Vorschlag abbringen, auch nachdem besagter Spieler den Vorschlag machte es erst mit 3 Augmentierungen zu versuchen und sollten wir gewinnen spielen wir einfach erneut als Team mit 2 Augmentierungen. Weil ich langsam die Schnauze voll davon habe und endlich mal Gewinnen m&ouml;chte schreibe ich meinem Team &quot;we will loose with just 2 augs&quot; und lasse meine Augementierungen drin.\r\n\r\nNun kommen wir also ins Spiel und Sie sehen, dass sowohl ich, als auch das andere Teammitglied mehr als 3 Augmentierungen ausger&uuml;stet haben.\r\nWas ist also die Reaktion der zwei? Nat&uuml;rlich Flamen Sie uns und Beleidigen und Drohen mit AFK und versuchen zu Surrendern. \r\nDies ist nicht das erste mal dass ich diese Reaktion sehe und ich finde es unm&ouml;glich warum nicht einfach trotzdem gespielt werden kann.\r\n\r\nIch mache den Fehler und lasse mich auf eine Diskussion mit einen von den beiden ein (normalerweise schreibe ich sogut wie nie, aber an manchen stellen habe auch ich einfach keine Geduld mehr).\r\nEr flamed unglaublich stark und beleidigt mich und fragt warum ich nicht einfach geschrieben h&auml;tte dass ich damit nicht einverstanden sei, denn dann h&auml;tte er sich das ersparen k&ouml;nnen, seine kostbare Zeit und direkt dodgen. Ich schreibe, dass ich geschrieben habe ich bin nicht einverstanden und dass wir verlieren w&uuml;rden wenn wir das tun. Er erwidert einfach nur ich h&auml;tte das nicht getan, nun wie er meint. Jetzt unterstellt er mir dass ich bestimmt nichtmal eine Mission habe, also schreibe ich Ihm, dass ich die Mission habe den Modus zu Gewinnen und ich das gerne endlich mal tun w&uuml;rde aber st&auml;ndig verliere. So muss ich mir also nun anh&ouml;ren dass das dann ja nur an mir liegen w&uuml;rde und der Modus ja sooo einfach zu gewinnen sei. Also schreibe ich ihm dass er nicht so arrogant sein soll und nur weil jemand nicht damit einverstanden ist was er will, er deshalb anderen das Spiel nicht versauen soll. Nun schiebt er mir meine Anschuldigung zu, er schreibt ich solle nicht so arrogant sein und andere ihre Mission kaputt machen weil ich nicht auf sie h&ouml;re.  \r\n.. sagt der, der sich nichtmal auf einen Kompromiss einlassen wollte sondern nur sein Fordern durchdr&uuml;cken will.. Mag ich immer gerne sowas. Naja und damit war das Spiel dann auch schon vorbei und in der Lobby danach werd ich nochmal richtig als faggot etc. beschimpft.\r\n\r\nNun und eigentlich ist dieses Spiel jetzt auch nur der Ausl&ouml;ser gewesen nach vielen vielen Niederlagen und anderen arroganten Menschen in diesem Modus die ich treffen durfte und ich m&ouml;chte eigentlich wirklich gerne diese Belohnungen bekommen, aber die Menschen die da Spielen machen mir es wirklich schwer es weiter zu versuchen. Ich bin einfach nur traurig dass so viele so sind und mir f&auml;llt nunmal derzeit wirklich vermehrt bei odyssee auf..\r\n\r\nIch wei&szlig; nicht ob Ihr &auml;hnliche Erfahrungen gesammelt habt oder nicht, ich wollte mir das wirklich einfach nur gerade mal von der seele reden/schreiben, weil sonst platz ich auch irgendwann ^^\r\n\r\nDanke wer es bis hier gelesen hat. Ich w&uuml;nsche niemanden solche Mitspieler {{sticker:sg-zephyr}} \r\n\r\nRant Ende.\r\n{{sticker:sg-shisa}}","replies":[{"poster":"JimmyGltchyOld","date":"2018-09-21T15:11:13.035+0000","up_votes":2,"down_votes":0,"body":"***","replies":[{"poster":"RaviRaptor","date":"2018-09-21T20:46:59.596+0000","up_votes":1,"down_votes":0,"body":"Cool vielen Dank für den tipp! {{sticker:slayer-pantheon-thumbs}}","replies":[]}]},{"poster":"Xarim","date":"2018-09-21T06:59:18.215+0000","up_votes":2,"down_votes":0,"body":"Hey,\n\nBin auch gerade richtig genervt.\n\nIch versuche seit einer Stunde diesen Modus zu spielen, ohne Erfolg.\n\nIch lese immer im chat:\n\n-all ziggs oder yasuo\n-2 aug\n-3 aug\n\nUnd wenn der Spieler nicht das bekommt was er will dann steht er im Spiel einfach AFK rum wenn man nicht direkt Aufgibt.\n\n\n\nDer Modus ist nicht so schlecht wird aber komplett durch die ganzen Quest zerstört und so macht das einfach keinen Spaß.\n\nMan hätte eventuell mehrere Warteschlangen für die Verschiedenen Quest machen sollen.\nSo das alle die sich für die 2 Aug Warteschlange anmelden auch dan nur 2 aug ausrüsten können.","replies":[{"poster":"RaviRaptor","date":"2018-09-21T20:49:04.424+0000","up_votes":1,"down_votes":0,"body":"Sehe ich auch so. \n\ndas mit den verschiedenen Warteschlangen wäre wirklich eine gute Idee\n\nVielen Dank für deine Rückmeldung :) Freut mich dass ich nicht alleine bin {{sticker:slayer-jinx-wink}}","replies":[]}]}]}