{"poster":"Zerbrecher","date":"2015-08-07T23:30:22.760+0000","title":"Ladezeiten... ich brech ab !","subforum":"Melde einen Bug","up_votes":3,"down_votes":2,"body":"Hallo ihr Raufbolde, Schlingel und Matrosen.\r\n\r\nKennt ihr das Gef&uuml;hl, ihr wollt einfach nur mal ne schnelle, gem&uuml;tliche Runde LoL spielen, weil gleich euer Kahn ablegt und ihr diesen Termin nicht verpassen wollt, doch dann wird eure Eurphorie gebremst, denn die Ladezeiten rasieren euch den Bart ab.\r\n\r\nEs ist ja nicht so, dass die Grafik von LoL die die 7 Meere &uuml;bertreffen w&uuml;rde, dennnoch habe ich das Gef&uuml;hl, dass man w&auml;hrend der Ladezeit das Ende der Weltenscheibe &uuml;berfahren k&ouml;nnte... ich habe schon des &ouml;fteren meiner Crew damit gedroht den n&auml;chsten Ladebalken &uuml;ber die Planke laufen zu lassen, jedoch bin ich kein mieser Kapit&auml;n. Ich verdammt nochmal der beste Kapit&auml;n, der die 7 Weltmeere durchsegelt hat. Ich habe so manche Wellen durchbrochen.\r\n\r\nARRRRRRR packt mich grad die Wut !\r\nDie Ladezeiten lassen mein Zahnfleisch faulen.\r\n\r\nIch ersuche nun den LoL-Kapit&auml;n um eine Parl&eacute; auszuhandeln.\r\nARRRRRRRRRR !","replies":[{"poster":"TurtleMari","date":"2015-08-11T10:48:38.440+0000","up_votes":1,"down_votes":0,"body":"Um den letzten Teil mit dem faulendem Zahnfleisch solltest du dir evtl. so gaanz langsam Sorgen machen.. <_>","replies":[{"poster":"Zerbrecher","date":"2015-08-11T18:46:19.122+0000","up_votes":2,"down_votes":0,"body":"Hab mir ne Smite-Zahnbürste besorgt.\n\nJetzt gibt es im Kieferbereich erstmal keine Probleme mehr... der Putzvorgang war ziemlich zerschmetternd, aber davon habe ich mich bereits erholt.","replies":[]}]},{"poster":"Zerbrecher","date":"2015-08-08T17:22:24.266+0000","up_votes":2,"down_votes":0,"body":"ARRRRRRR !\n\nWo habt ihr euren Humor gelassen? Dafür werde ich euch kielholen ihr Landratten !","replies":[]},{"poster":"Kaitri","date":"2015-08-09T23:43:26.070+0000","up_votes":1,"down_votes":0,"body":"meinst du perle?\n\nkingdom hearts 2 reference <3","replies":[{"poster":"Zerbrecher","date":"2015-08-10T18:24:04.313+0000","up_votes":1,"down_votes":0,"body":"Auch wenn Kingdom Hearts wirklich sehr geil ist, habe ich einfach bloß das Parlé gemeint.. Verhandlungsrecht oder sowas ist das eigentlich, ich fand es aber einfach etwas lustiger, da ich keine zu ernste kritik ausüben wollte, obwohl ich diese Ladezeiten doch als Problem ansehe, denn ich frage mich wo das noch hinführen soll.\n\nNaja.. wie gesagt.. ich wollte etwas humorvoll sein, aber irgendwie kam der Humor hier, trotz des Gangplankevents, nicht so richtig an.\nBzw kam hier nichts was zur Diskussion beigetragen hätte.\nWenn 20mio Spieler gerne nen Ladebilschirm möglichst lange anstarren, dann werde ich mich nicht dazwischen stellen, sonst piekt mir hier noch einer ins Auge oder so.\n\nKingdom Hearts finde ich auch sehr, sehr geil. :))\nGames dieser Art sterben leider aus, vermute ich...","replies":[{"poster":"Kaitri","date":"2015-08-10T18:39:03.326+0000","up_votes":1,"down_votes":0,"body":"naja das problem ist nicht das lol suckt, sondern das viele pcs gerade im low elo bereich sucken.\nwenn man sich challenger bereich so ansieht da ladet es oft nicht länger als 10sek :D","replies":[{"poster":"Zerbrecher","date":"2015-08-10T22:05:17.851+0000","up_votes":1,"down_votes":0,"body":"Naja also bei uns ist es oftmals so.. wir haben recht gute Rechner und da braucht der Ladebildschirm bis 100% erstmal so ca10-15sek... danach aber, wenn alle auf 100% sind, bleibt es dann auch erstmal so stehen... mindestens für die doppelte Zeit.\nDann gibt es gewisse Fehler, die gelegentlich Verbindungsabbrüche verursachen.. das zieht es dann nochmal in die Länge.\nMag sein, dass es an der Low Elo liegt, aber ich hab jetzt mal vergleichsweise ein anderes Moba installiert, bei dem man sich von hinten sieht, alles ist viel detailreicher und größer.\nDa beträgt die Ladezeit, wenn es wirklich lange dauert, 15 Sek.\n\nGerade wenn man sowas mal erlebt hat, geht einem dann der LoL Ladebildschirm auf die Nerven, da ich nicht denke, dass das andere Game nur von Mid-/Highend Pcs gespielt wird.\n\nDer Spielfluss wird dadurch oftmals so sehr gebremst, dass man sich angewöhnt hat, während der Ladezeiten etwas anderes zu tun.. auf Klo gehen, Instantnudeln kochen, eine rauchen, oder so.\n\nDa LoL preislich gesehen extrem viel teurer ist, frage ich mich wo die Kohle hinfließt, denn die Meisterschaften werden bei beiden Games durch Skins (Verkäufe) mitfinanziert und zudem hat LoL etwas mehr als doppelt so viele Spieler... das ist schon ein ganzer Haufen.\n\nIch würde hier ja nicht kritisieren, wenn mir LoL egal wäre, so langweilig ist mir nicht.. ich spiele gern mal das und mal das... aber momentan eher das andere, weil man einfach durchgehend zocken kann, wenn man möchte.. man bestimmt quasi selbst die Pausen.","replies":[{"poster":"Kaitri","date":"2015-08-10T23:01:59.515+0000","up_votes":1,"down_votes":0,"body":"wie ist lol den teuer? du musst keinen cent dafür ausgeben um es in vollen zügen spielen zu können. du kannst dir sogar custom skins runterladen!","replies":[{"poster":"Zerbrecher","date":"2015-08-11T18:43:48.009+0000","up_votes":1,"down_votes":0,"body":"Es geht dabei um die Preise im Shop... ist schon ein Unterschied wenn man im gut programmierten Game 23€ bezahlt und man alle Champs, inklusive der Champs die zukünftig released werden, besitzt.\n\nOder max 5€ für nen Skin, den man in LoL mit nem Legendären vergleichen könnte, da Sounds und alles komplett verändert worden sind.\n\nDa sind eben doch preisliche Unterschiede vorhanden, wie gesagt, es geht eben darum, dass genug Geld vorhanden wäre... aber es wird wohl eher in den Porsche-Fuhrpark der Chefetage investiert, nehme ich an. :D","replies":[{"poster":"Kaitri","date":"2015-08-11T19:12:31.520+0000","up_votes":1,"down_votes":0,"body":"du kannst champs ja auch mit IP kaufen.\n\nund iwer wird sowieso immer probleme ingame oder beim verbinden oder mit xy haben und dann neue server fordern. leute sind nie zufrieden :D","replies":[{"poster":"Zerbrecher","date":"2015-08-12T22:40:46.353+0000","up_votes":1,"down_votes":0,"body":"Beide Spiele sind Free To Play.\n\nEgal.. hab LoL erstmal an den Nagel gehängt... es war mal ne schöne Zeit, vor langer Zeit und jetzt soll es wohl für mich nicht mehr sein.\n\nIch glaube heutzutage darf man einfach nichts mehr verlangen... einfach die Zeit genießen, solange sie schön ist und sich trennen, wenn es nicht mehr schön ist.\n\nIch denk mal die Unreal 3 Engine ist der von LoL einfach extrem weit vorraus.","replies":[]}]}]}]}]}]}]}]},{"poster":"Busty Botter","date":"2015-08-08T09:07:55.007+0000","up_votes":1,"down_votes":0,"body":"Der Zerbrecher bricht ab, willst du uns damit etwas sagen Kaptain? :)","replies":[{"poster":"Zerbrecher","date":"2015-08-10T22:07:41.730+0000","up_votes":1,"down_votes":0,"body":"Ich war seit Ende der Beta standhaft, aber mittlerweile hab ich das Gefühl ich habe insgesamt mindestens ein halbes Jahr im Ladebildschirm verbracht.\n\nDa bricht dem härtesten Käptn das Holzbein ab.","replies":[]}]},{"poster":"Zerbrecher","date":"2015-08-09T18:04:13.283+0000","up_votes":1,"down_votes":0,"body":"Ok, dann halt mal ernsthaft... findet ihr die teilweise bis zu 5 Minuten Ladezeit in LoL angenehm?\n\nIch mein ich bin nicht hier um zu sagen wo es um einiges besser läuft, weil sonst wieder die Werbeflames kommen, aber es ist definitiv möglich die Ladezeit auf ein Maximum von 30 Sekunden zu setzen, wenn man hier und da noch etwas optimiert. Und bei 30 Sekunden mein ich den Typen, der mit nem 4/86er spielt und die anderen dann \"leider\" 30 Sekunden lang warten lässt.\n\nEs kommen seit Jahren keine neuen Maps, da könnte man doch durchaus mal damit anfangen das Vorhandene zu optimieren, oder bin ich da zu anspruchsvoll?","replies":[]},{"poster":"Deathinger","date":"2015-08-08T09:57:05.511+0000","up_votes":1,"down_votes":0,"body":"Du bist 1 1/2 Monate zu früh... If u know what i mean :D","replies":[]},{"poster":"FailerOfWorld","date":"2015-08-08T09:04:35.518+0000","up_votes":1,"down_votes":0,"body":"Ess ein paar Orangen, ist gut gegen den Zahnfleischausfall :D","replies":[]}]}