{"poster":"Valou007","date":"2017-08-29T15:25:11.234+0000","title":"Dimenticare e Superare","subforum":"Campioni e gameplay","up_votes":3,"down_votes":2,"body":"Ragazzi non sono qui per lamentarmi o altro, ma solo per discutere un po con voi sui campioni rilasciati dalla riot stella dicendo che sono finalmente perfettamente SBi ehemm bilanciati...Fatta questa premessa iniziamo.\r\nPrendiamo come esempio uno dei miei primi main sul 3 account e anche su questo {{champion:136}} oooooh  il drago galattico che tutti hano dimenticato :3 Ma per quale motivo.. ora vi elenco qualche counter {{champion:266}} {{champion:103}} {{champion:84}} {{champion:32}} {{champion:268}} {{champion:164}} {{champion:131}} {{champion:245}} {{champion:60}} {{champion:105}} {{champion:150}} Ecco fatto pensate un po tutti questi e non ho avuto nemmeno bisogno di scorrere con la rotella del mouse ... Questo perch&eacute; la Riot crea e poi dimentica creando altri campioni e altri e altri che superano sempre quelli vecchi.. kayne ad esempio credo che onehitti un rakan o una xayah fuori posizione con una semplice combo .. sempre pi&ugrave; utile di Ivern che al massimo stunna e fa fare il resto agli alleati, e poi creano e buffano senza pudore ripetendo quando scrivi: WE MALEDETTI NERFATE UN PO DI CHAMP CHE SI PERDE RANKED SU RANKED ... E NON E&#039; GIUSTO loro ti risponderanno con un cordiale e     _AMATISSIMO_    **BUONA FORTUNA NELL&#039;ARENA DELLA GIUSTIZIA** ma che giustizia che ci sono i champ rotti nel culo e tu che sei un player che ha il cervello cerchi di evitare questi &quot;clicca per vincere&quot; oppure sai che devi per forza bannare {{champion:157}} {{champion:67}} {{champion:122}} .. ma non perch&eacute; poi gli trovi contro .. ma per paura che un tuo alleato prenda questi cosi che una volta in game vanno 1 v 5 e flammano quello che &egrave; appena respawnato dicendo che non doveva morire xd!!!11! Ragazzi spero che abbiate capito cio che volevo dire.. ho un po cazzeggiato ma spero di aprire una discussione che non si offenda nessuno ne i main vayne o i main yasuo etc etc.. volevo solo aprire un dibattito dicendo che la riot crea e buffa per renderci la vita difficile e poi ci danno le icone AGGRATIS e le EMOTE che sono inutili al CA","replies":[{"poster":"Dr LouD","date":"2017-08-29T15:35:21.562+0000","up_votes":3,"down_votes":0,"body":"Per esigenze di gameplay non si possono bilanciare 130 campioni contemporaneamente per renderli TUTTI competitivi ... è impossibile, perchè appena buffi qualcosa, automaticamente stai indirettamente nerfando qualcos'altro, e viceversa.\n\nPer il discorso del draghetto galattico poi, metà dei 'counter' che hai elencato sono deboli e nemmeno in meta, esattamente come lui.","replies":[]},{"poster":"astenar","date":"2017-08-29T16:12:49.607+0000","up_votes":2,"down_votes":0,"body":"È chiaramente impossibile bilanciare tutti i champ, ma anche se fosse possibile prova a seguiere questo ragionamento. \nLa riot tra tot anni riuscirà a creare un meta perfetto in cio tutti i champ sono totalmente equibilanciati e tutti utilizzabili al 100%. Tu decidi di andare mid e piccare il campion X il tuo main. Trovi contro di te un altro avvesario che ha piu o meno le tue capacità ma lui è main del champ Y che ti countera completamente. Chi vincerebbe? Sarebbe piu giusta una vittoria del genere?\nBhe io dico di no. Il fatto che esistono solo una parte di champ realmente competitivi serve appunto per creare un meta. È vero che esistono champion un po più sbilanciati e champ che magari vengono un po dimenticati ma sta appunto alla bravura dei giocatori trovare risposte aduguate e adattarsi al meta il più possibile. una volta capito questo trova tu una risposta al meta attuale. Kayne puo onehittare rakan e xaya da soli? Bhe allora sarebbe meglio non girare da soli per le lane se c è kayne nel game.","replies":[]},{"poster":"Mh012","date":"2017-08-31T05:33:26.292+0000","up_votes":1,"down_votes":0,"body":"\"Ranked di piazzamento, prima partita, al 10 min ho una farm stra buona di 80 minion, guardo la Vayne in bot... 32!! 5 minuti dopo... 42 farm 0/5..\" Cit.","replies":[]},{"poster":"mattuoto","date":"2017-08-30T08:19:18.490+0000","up_votes":1,"down_votes":2,"body":"a mio avviso sarebbe opportuno che gli sviluppatori rallentassero la frequenza di rilascio di nuovi champ e aumentassero l'impegno nel migliorare i campioni già rilasciati. \n\nguardando le statistiche di utilizzo o il win rate dei vari campioni ci si accorge che ce ne sono parecchi inutilizzati ed inutilizzabili. alcuni altri con meccaniche ormai vecchie e altri ancora con concept completamente avulsi dal gioco. \n\nalmeno un terzo dei personaggi andrebbe rivisto e invece si continua a far uscire roba ogni 3 mesi... è chiaro che è il modo migliore di far soldi però non mi sembra la procedura più \"solida\" perché più personaggi rilasci, più sarà gravoso il lavoro di bilanciamento del gioco.","replies":[{"poster":"A Yolo Singed","date":"2017-08-30T17:47:35.696+0000","up_votes":1,"down_votes":0,"body":"Ci sono più team che lavorano a più cose contemporaneamente.","replies":[]}]},{"poster":"MisogiKumagawa","date":"2017-08-29T22:19:20.978+0000","up_votes":1,"down_votes":0,"body":"Yasuo,darius e vayne,so clichè\nPer counterare darius c'è quella bella cosa chiamata KITING,inoltre se vedi che darius èin passiva/sta per entrare in passiva bisogna focussarlo istant.\nPer counterare yasuo esistono questi 2 bellissimi item che odio poichè mi counterano la mia amata {{champion:39}} ,che sono{{item:3047}}  e {{item:3075}} (anche {{champion:33}} lo countera ma nessuno vorrà mai giocare un champ cosí noioso per fortuna)\nInfine,per vayne,semplicemente in lane la abusi come una  *parola censurata se no vengo instabannato* e finisci il game il più velocemente possibile\n\nP.S mannaggia a chi fatto sti casini con gli asterischi","replies":[]},{"poster":"Into The Mid","date":"2017-08-29T18:13:50.585+0000","up_votes":1,"down_votes":0,"body":"La questione di counter esisterà sempre.\nPerciò esiste la champion pool: \navere diversi champ da usare ma non per bellezza ma per adeguarti meglio alla team comp.\n\nPoi puoi essere counterato in early ma di solito se te la giochi bene e arrivi in late o almeno a fare TF il tutto si bilancia.","replies":[]},{"poster":"5Dragon66","date":"2017-08-29T15:44:26.988+0000","up_votes":1,"down_votes":0,"body":"22","replies":[]}]}