{"poster":"Pls Buff Shen","date":"2015-12-27T23:14:00.794+0000","title":"Help, assassini in giungla","subforum":"Campioni e gameplay","up_votes":1,"down_votes":0,"body":"NON LI SO USARE! MANCO LE BASI! Ogni volta che vado con gente come {{champion:121}} {{champion:107}} e a volte {{champion:64}}  in giungla pulisco i campi che &egrave; una meraviglia, ganko anche decentemente ma quando si grouppa faccio schifo e finisco col feedare. Giusto per farvi capire con {{champion:121}}  ho fatto 3/10/8 mentre con {{champion:98}}  Jung con build inventata al momento con cose tipo {{item:3146}} {{item:1414}} ho finito in 15/3/17 carryando da solo il mio team che era discreto,qualche consiglio? su di loro uso rune rosse atk speed e quintessenza AD, per le altre classiche Armor e MR.. ditemi la vostra(apparte che sono nabbo con loro, gi&agrave; lo so).","replies":[{"poster":"Ste the ripper","date":"2015-12-28T00:21:34.593+0000","up_votes":1,"down_votes":0,"body":"Trovo parecchio strano che tu pulisca bene la jung con kha...\nComunque se giochi assassini in mid sono uguali a quelli in jng in late, non cambia molto se no gioca i classici pick tank, ma tra uno shen full ap e un assassin vedo poca differenza nel modo di giocare ( si vede la differenza nei risultati) cioè una volta che ti fai shen ap non puoi ingaggiare e devi buttarti sui carry per scoppiarli esattamente come fa un assassino.\n\nDetto ciò nel dettaglio kha è un finisher, devi aspettare la fine del fight e come una cavalletta saltare e shottare prendendo i reset.\nRengo può ingaggiare, devi shottare i carry ( possibilmente isolati) con la sua ulti non dovrebbe essere difficile.\nLee non è un assassin, early game ganki e invadi, late devi ingaggiare con gli insec, siccome non saprai farli cerca di andare sui carry come puoi e rompere le balle, poi se ogni tanto con il flash riesci a tirare un bel calcio su 5 fai una cosa buona :)","replies":[{"poster":"Pls Buff Shen","date":"2015-12-29T00:43:53.137+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ste the ripper,realm=EUW,application-id=cAOZwaUi,discussion-id=NaqKJ5w0,comment-id=0001,timestamp=2015-12-28T00:21:34.593+0000)\n>\n> Trovo parecchio strano che tu pulisca bene la jung con kha...\n> Comunque se giochi assassini in mid sono uguali a quelli in jng in late, non cambia molto se no gioca i classici pick tank, ma tra uno shen full ap e un assassin vedo poca differenza nel modo di giocare ( si vede la differenza nei risultati) cioè una volta che ti fai shen ap non puoi ingaggiare e devi buttarti sui carry per scoppiarli esattamente come fa un assassino.\n> \n> Detto ciò nel dettaglio kha è un finisher, devi aspettare la fine del fight e come una cavalletta saltare e shottare prendendo i reset.\n> Rengo può ingaggiare, devi shottare i carry ( possibilmente isolati) con la sua ulti non dovrebbe essere difficile.\n> Lee non è un assassin, early game ganki e invadi, late devi ingaggiare con gli insec, siccome non saprai farli cerca di andare sui carry come puoi e rompere le balle, poi se ogni tanto con il flash riesci a tirare un bel calcio su 5 fai una cosa buona :)\n\ngrazie per i consigli^^ comunque se vedi shen lo fatto bruiser aveva 200 AP 100 AD e 120 Armor e MR con 3000 hp xD ma anche se lo faccio full ap posso ingaggiare e oneshottarne uno, gli altri si aspettano che sono tank :). con kha la giungla mi sembra facile, Kite e uccidi i mostricciatoli attorno e poi con la Q fai danni osceni al mostro solitario, dopo il primo back posso farmi tranquillamente tutti i campi(anche nemici) con lee invece c'è stata una volta in cui sono morto al red.... che vergogna.","replies":[]}]},{"poster":"ubercodlegend200","date":"2015-12-27T23:17:32.478+0000","up_votes":1,"down_votes":0,"body":"Le ragioni boy sono le seguenti gli assassin non stanno decisamente bene in un meta in cui i bruiser fanno più danno andando full tank, late ciò che ti tocca fare è splitpushare o punire chi è fuori posizione o sei feddato o in genere in tf esplodi  senza risultati","replies":[]}]}