{"poster":"Purino","date":"2016-08-08T21:59:49.679+0000","title":"Quarto ban in ranked...pareri!","subforum":"Campioni e gameplay","up_votes":1,"down_votes":0,"body":"visto l&#039;ammontare dei personaggi nn sarebbe opportuno mettere il 4&deg; ban?! voi cosa ne pensate?","replies":[{"poster":"Kopoo","date":"2016-08-08T22:13:21.830+0000","up_votes":2,"down_votes":1,"body":"Ne hanno parlato qualche mese fa nell' \"Ask Riot\", ti faccio il copia-incolla del parere della Riot:\n\n\"**Visto che emergono sempre più campioni, la quantità di ban nella selezione del campione verrà modificata?\n**\nNon crediamo che il numero di ban debba crescere in modo lineare con il numero di campioni disponibili.  Ragionando per assurdo, potremmo ritrovarci con un numero di ban talmente alto da inficiare la selezione del campione.\n\nSe decidessimo di aumentare i ban, lo faremmo solo per promuovere una certa diversità nelle squadre o per dare vita a competizioni più interessanti. L'organizzazione dei giocatori è un fattore importante nell'argomento dei ban. Con troppi pochi ban, i campioni più frustranti sono inattaccabili. Con troppi ban, si finirebbe per non riuscire mai a giocare con i campioni desiderati.\n\nAl momento stiamo discutendo se un ban per giocatore (e quindi 5 per squadra o 10 in totale) sia una proposta sensata. Questo aumenta leggermente il numero di ban, ma soprattutto dà a tutti la possibilità di scegliere chi non vedere nella squadra nemica.  Non sappiamo se questa modifica vedrà mai la luce: volevamo solo darvi un'idea di come stiamo affrontando la questione.\n\n(RISPOSTA BONUS!) Leggendo diversamente la domanda, ci siamo chiesti se nascondesse una preoccupazione per il numero massimo di campioni che LoL può ospitare. Probabilmente esiste un limite, ma data la frequenza di nuovi campioni presentati in questo periodo ci vorranno anni prima di doverci preoccupare di averne troppi. - Ghostcrawler\"","replies":[]},{"poster":"ILoveTiramisu","date":"2016-08-15T07:22:08.468+0000","up_votes":1,"down_votes":0,"body":"No, il mio motivo principale è il tempo. Non mi piace aspettare tanto in campion selection, gia devo aspettare la gente indecisa a pickare che aspetta fino alla fine.","replies":[]},{"poster":"Øne Trick Pony","date":"2016-08-08T22:01:23.169+0000","up_votes":1,"down_votes":0,"body":"Non lo vedo opportuno. Si è vero ci sono molti più champ ma quelli realmente in meta sono pochissimi. E poi qual è il bello se non tryhardare contro questi champ op? xD","replies":[]}]}