{"poster":"Eac0","date":"2015-10-18T00:27:49.977+0000","title":"Sconforto e disgusto","subforum":"Discussioni generali","up_votes":2,"down_votes":5,"body":"Sceso ancora di lega grazie ad una striscia di partite negative.\r\nCerto ora tutti i sapientoni verranno a dire che la colpa &egrave; mia e blah blah blah.\r\nOvvio se il tuo team sfoggia una master yi top che esordisce con un 0/12 e conclude con 7/21 perch&eacute; si &egrave; svegliato con il cazzo storto su per il culo e ha deciso di feedare &quot;tanto non mi fanno niente se mi reportate quindi trollo&quot;; la colpa &egrave; ovviamente mia che non sono abbastanza bravo da carriare.\r\nPoi &egrave; sempre colpa del jungler se la lane feeda no?","replies":[{"poster":"FuryTheFenix ITA","date":"2015-10-18T00:34:03.490+0000","up_votes":1,"down_votes":3,"body":"Eh....capita...io oggi mi sono fatto un second account e sto ri iniziando d'accapo.\nProva anche tu,prendilo come un allenamento extra","replies":[{"poster":"twitchtv Vodky","date":"2015-10-18T00:51:37.320+0000","up_votes":12,"down_votes":1,"body":"Lo scopo? Invece di farmare pi e comprarti champ o pag di rune vai a fare il grosso con i novellini? Piuttosto fatti normal a diritto che ti alleni meglio no?","replies":[{"poster":"FuryTheFenix ITA","date":"2015-10-18T10:39:46.102+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Albo,realm=EUW,application-id=MJVj50Jw,discussion-id=0gK2KAqn,comment-id=00000000,timestamp=2015-10-18T00:51:37.320+0000)\n>\n> Lo scopo? Invece di farmare pi e comprarti champ o pag di rune vai a fare il grosso con i novellini? Piuttosto fatti normal a diritto che ti alleni meglio no?\n\nLa mia situazione è diversa;sono arrivato al 30 a forza di co op vs Ia(pc scrauso) quindi ho skippato tutto un programma di \"evoluzione\"dei player e inoltre giocavo SOLO e SEMPRE supporto.dopo ho preso un pc nuovo e ho fatto le ranked vincendone 6 su 10 fine.\nVolevo ri iniziare da capo per capire effettivamente TUTTI i ruoli con TUTTE le variabili.\nSono stanco di essere flammato a gogo perchè \"oh my god you blablabla\" e poi di smurf se ne incontrano parecchi.\nSeriamente,apprezzo il tuo pensiero....ma voglio solamente....iniziare da capo.","replies":[{"poster":"twitchtv Vodky","date":"2015-10-18T11:13:05.360+0000","up_votes":3,"down_votes":0,"body":"Bro, i flamer stanno dappertutto. Dal lv 5 in poi non aspettarti di trovare gente tutta peace & love visto che il matchmaking si basa sul tuo MMR e quindi troverai la stessa gente di adesso che flamma il triplo perchè frustrata e vuole raggiungere il 30 il più velocemente possibile. Poi ovvio fai come ti pare ma secondo me è meglio se farmi sul main account ^^","replies":[{"poster":"FuryTheFenix ITA","date":"2015-10-18T12:15:09.219+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Albo,realm=EUW,application-id=MJVj50Jw,discussion-id=0gK2KAqn,comment-id=0000000000010000,timestamp=2015-10-18T11:13:05.360+0000)\n>\n> Bro, i flamer stanno dappertutto. Dal lv 5 in poi non aspettarti di trovare gente tutta peace & love visto che il matchmaking si basa sul tuo MMR e quindi troverai la stessa gente di adesso che flamma il triplo perchè frustrata e vuole raggiungere il 30 il più velocemente possibile. Poi ovvio fai come ti pare ma secondo me è meglio se farmi sul main account ^^\n\nvedo come va,al massimo torno nell'account principale.","replies":[]}]}]},{"poster":"Mix Licantropo","date":"2015-10-18T08:42:17.539+0000","up_votes":1,"down_votes":4,"body":"Ha pure scritto allenamento extra(impar ad usare dei champ,per poi mainarli),ma dato che qui nessuno capisce l italiano, devono attaccare qualcuno, perchè ignoranti.","replies":[{"poster":"BrattishSolid6","date":"2015-10-18T09:10:40.499+0000","up_votes":3,"down_votes":0,"body":"Se proprio vuoi parlare di ignoranza: impara, l'italiano, perché.\n\nAlbo ha semplicemente detto che non è un'idea vantaggiosa imparare nuovi champ contro dei principianti, o usare quelli che già si mainano contro principianti. Non è un allenamento, non si migliora. Se devi allenarti per una gara di sollevamento pesi, ti eserciterai coi pesi da 10/20/30Kg o andrai in un'altra palestra per fingere di essere scarso e usare quelli da 5Kg? Se si vuole imparare un nuovo champ lo si gioca in normal qualche volta. Se non lo si vuole provare subito in un game si può usare la custom o la coop e scoprire le abilità.\nFarsi un secondo account può essere divertente, ma non aiuta a migliorare. Secondo me. (E secondo Albo a quanto ho capito).","replies":[{"poster":"Mix Licantropo","date":"2015-10-18T11:47:33.529+0000","up_votes":1,"down_votes":1,"body":"Che esempio di merda è?dio mio... senza parole.\nSi infatti provare un champ in custom o contro i bot è utilissimo.\nVa beh basta, è inutile continuare questa discussione.","replies":[{"poster":"BrattishSolid6","date":"2015-10-18T18:52:45.601+0000","up_votes":1,"down_votes":0,"body":"Semplicemente non si migliora giocando coi più deboli. Se vuoi imparare a usare un champ puoi usarlo contro avversari nabbi (quindi custom vs bot, coop vs bot o con smurf vs principianti). Ma in qualunque di questi tre casi avrai contro avversari \"non forti\", e il massimo che puoi imparare è come usare il champ in modo tranquillo, senza pressione. E se bisogna scegliere, tra far passare una partita frustrante a dei principianti o giocare contro dei bot senza dar fastidio a nessuno, a parità di guadagno si giocano le coop o le custom. Se invece si vuole migliorare con un champ attraverso il match up con giocatori capaci, allora i discorsi dello smurf e del secondo account non hanno senso. \n\nSenza contare che \"l'imparare champ nuovi\" lo si fa benissimo sul main account. Mettiamo che voglio imparare a usare Lux (?) e uso il mio secondo account. Prima di tutto devo avere 3150IP. E per guadagnarli devo giocare. Quindi devo \"perdere tempo\" raccimolando IP su questo account. Poi la compro, magari mi piace e capisco come usarla. A questo punto? A questo punto dovrei aspettare di guadagnare altri 3150IP sul main per permettermela. Non ha senso, impieghi il doppio del tempo per uno stesso risultato.","replies":[]}]}]}]}]}]},{"poster":"Eac0","date":"2015-10-18T10:13:19.810+0000","up_votes":2,"down_votes":0,"body":"Faccio una precisazione, il titolo del mio post si riferisce esclusivamente al videogioco :D\nFiguriamoci.\nPoi fare le ranked sostanzialmente mi diverte anche perché è li che ci si mette alla prova, ma non è che le gioco perché \"se non salgo sono scarso\".\nInvece i commenti velenosi tipo quello di ILouD mi fanno irritare.\nSempre nell'ambito di un videogioco e di un forum ad esso legato.","replies":[{"poster":"Dr LouD","date":"2015-10-18T12:29:06.496+0000","up_votes":2,"down_votes":0,"body":"Sono velenosissimo.","replies":[{"poster":"Eac0","date":"2015-10-18T13:11:49.446+0000","up_votes":1,"down_votes":0,"body":"LOL","replies":[]}]}]},{"poster":"DeathJehuty","date":"2015-10-18T09:15:38.260+0000","up_votes":2,"down_votes":0,"body":"Guarda, fino a 1 mese e mezzo fa ero in scia negativa nella ranked, difatti il mio mmr si è abbassato drasticamente e guadagnavo 15 lp a vittoria e ne perdevo 25, quindi ho optato per smettere di rankare  (sceso da silver 3 a 5). Ho ripreso 3 giorni fa e sono risalito in silver 4 facilmente e sono quasi in promo per S3.\nRilassati, farti cattivo sangue non aiuta. E una volta che sei in scia negativa ti consiglio di abbandonare per un po e resettare la mente con le ranked u.u","replies":[]},{"poster":"Eac0","date":"2015-10-18T01:39:22.364+0000","up_votes":3,"down_votes":1,"body":"Infatti la risposta da ebete non ha tardato ad arrivare.\nSono invece d'accordo con te ALBO.","replies":[]},{"poster":"Dr LouD","date":"2015-10-18T00:52:18.201+0000","up_votes":5,"down_votes":4,"body":"Wow, un Master Yi top che fa questi identici score per tutte queste partite di seguito nel tuo team, che sfortunato che sei!","replies":[]},{"poster":"Eac0","date":"2015-10-18T01:45:09.530+0000","up_votes":2,"down_votes":2,"body":"Tra l'altro  \"sapientone platino\" prenditi la briga di entrare nel merito se vuoi commentare sarcasticamente e non stupidamente.\nVedi che c'è anche di peggio nei vari team delle partite che ho perso.\nPoi per carità il platino sei tu io sono solo un povero bronzo quindi non capisco niente del gioco per definizione giusto?","replies":[{"poster":"Dr LouD","date":"2015-10-18T12:34:37.449+0000","up_votes":1,"down_votes":0,"body":"http://weknowyourdreams.com/image.php?pic=/images/salt/salt-09.jpg","replies":[]}]},{"poster":"anagoor","date":"2015-10-18T09:11:31.747+0000","up_votes":1,"down_votes":0,"body":"Ti dirò, da quel punto di vista ci vuole un po' di fortuna, tuttavia se sei in una serie negativa non penso che tu abbia trovato un {{champion:48}} in tutte le partite.\nLe serie negative capitano, nella prima parte della season ero sceso da g2 a g5 ed avevo solo il 35-40% di win rate sul mio main... non so che dirti, a meno che non aspiri ad una lega superiore ti consiglio di smettere di rankare, come ho detto ero sceso a g5 dove mi mancava una sconfitta per scendere a s1, ho smesso di rankare per due mesi e in tre settimane sono arrivato a g3(o g2 non ricordo). Provaci.","replies":[]}]}