{"poster":"toyreduro","date":"2017-10-30T02:46:18.480+0000","title":"La gente toxica que uno debe encontrar.","subforum":"Comportamiento del jugador","up_votes":7,"down_votes":1,"body":"Pasar de una partida con 4 premades que te flamean y te dicen que te vallas afk para luego pedirte report cuando juegas seguro xd\r\n(porque obvio tu supp ya te abandono mil veces para hacer roam con sus premades y no le servis)\r\nCon sus obvio flameos incluidos, obviamente.\r\nPara luego pasar a una partida donde por un error minimo y dar una segunda kill, cuando mi supp se regalo la first de por si solito y tener clavados 200ms (desconosco la causa, estoy usando arnet via wifi, y aunque se que es mejor por ethernet no tengo los medios para pagar uno mejor) y que todos me flameen por estar jugando solo xd con lag, y pedirles que me expliquen porque soy malo. Claro, jugar con lag es ser mal jugador...\r\n\r\nMe gustaria que me compartan historias de mierda como las que les cuento c: Asi no me sentir&eacute; s&oacute;lito cuando me baneen por partidas asi, y es que rito y su sistema son una mierda, no contextualizan nada y dejan todo a merced de una maquina, cuando estas no podr&iacute;an entender todo lo que sucede en el juego.\r\nYo no tendria drama en trabajar leyendo reportes a diario xd que me contraten y hago de tribunal.","replies":[{"poster":"MrTonga","date":"2017-10-30T14:02:38.412+0000","up_votes":2,"down_votes":0,"body":"Obvio que te van a banear como te metes a jugar con 200ms papaaa","replies":[{"poster":"Verp","date":"2017-10-30T18:43:17.407+0000","up_votes":1,"down_votes":1,"body":"Dijo que no sabia la razon de eso nadie controlo los fallos de internet","replies":[]}]},{"poster":"El Impostor","date":"2017-10-30T02:58:47.844+0000","up_votes":1,"down_votes":1,"body":"Mientras no les contestes a sus insultos, nada pasará.\n\nSi te fijas mas abajo en este sub, todos los baneados porque \"una premade de 4 me reportó xdxddxdxdddd\" les contestaron, fueron reportados con razones y se comieron el ban.","replies":[{"poster":"Bastante Simple","date":"2017-10-30T03:25:45.785+0000","up_votes":3,"down_votes":1,"body":"Ahí es cuando recuerdas lo patético e inutil que es riot en cuanto a calidad de sistema, me tocaron dos premades de 4 el mismo día, morían todo el rato, fui el unico en botar torre completamente solo sin jg, flameaban todo el rato y porque les pones \"dejate de morir porfa\" te penalizan ya que los cuatro te reportan por ser epictrol4premadeforlife. \nAdivina..... me bloquearon el chat y a ellos qué¿ cuando cumplieron con todo lo marcable en el cuadro de reporte.\n\nBueno como siempre digo altos inutiles los de riot, ya no sorprende y ya no espero nada de un personal patetico que solo posta en topics de memes y borra los topic que estadisticamente y con evidencias les demuestra el inutil sistema que tienen.\n\nNo me extrañaría que me borren otro post más, entiendan riot, son penosos, que borren los post que demuestran el asco de sistema de reporte que tienen no cambiara nada, apliquen ban en el juego mejor y dejen de tirarse las pelotas en el foro.\ngracias por nada.","replies":[{"poster":"El Impostor","date":"2017-10-30T03:50:13.344+0000","up_votes":1,"down_votes":1,"body":"Algo les dijiste a las premades que si gatilló tu castigo, o eres toxico de antes y esos reports justificados eran lo único que faltaba.\n\nSi así te expresas en el foro, no quiero ni pensar en como la toxiqueas en el juego.\n\nBueno, buena suerte con eso de perder las recompensas, saludos.","replies":[{"poster":"Bastante Simple","date":"2017-10-30T03:57:45.813+0000","up_votes":2,"down_votes":1,"body":"En un comienzo tenia un comportamiento ejemplar, pero que te pasen estas situaciones todos los dias en cada partida y saber que riot no hace nada por solucionarlo hace que lo ejemplar desaparezca, de que te sirve ser pedir por favor al mid que no muera si va a terminar 0/15 de todas formas? esto se gana jugando, eres el tipico jugador que de ser por ti banearia al que en una partida dice \"juega bajo torre porfa, dejate de feedear, como tan malo\" en vez de al \"feeder 1/15\" y trol SILENCIOSO (no usa el chat) que arruina las partidas, ¿cierto?\n\nQue escriba asi en el foro no significa que sea asi en el juego, altos prejucios tienes, y si soy asi en el foro es por la bronca que le tengo a riot, no te imaginas la que le tengo.\n¿Por que habría de enojarme con jugadores que no tienen la culpa del mal sistema de riot? bajo esa logica estaría baneado hace meses y no es el caso, es por que juego, que parte no entendiste de que el banchat fue por un premade trol, hasta me agregaron post partida para decirme \"jajajaja vez el cartelito????, por imbecil\".\n\nEn conclusión, eres parte del problema, no de la solucion, sigue lamiendole las botas a riot, tal vez te den una skin.","replies":[{"poster":"El Impostor","date":"2017-10-30T04:04:25.107+0000","up_votes":1,"down_votes":0,"body":"\"juega bajo torre porfa, dejate de feedear, como tan malo\" \n\nAhi mismo colaste un insulto hacia el que ha muerto mucho.\n\nQuizás para ti ese \"como tan malo\" no es ofensivo, pero no sabes si para otros si, y eso es suficiente para que recibas un castigo, ya estamos algo grandes para decir \"el empezó\".","replies":[{"poster":"Bastante Simple","date":"2017-10-30T04:48:25.856+0000","up_votes":1,"down_votes":1,"body":"Ya capté tu forma de pensar y no pienso desgastarme argumentando con un simple jugador, porque sé que nunca estarás mal bajo tu logica.\nEl sistema de reportes es patético y para nadie es un secreto, no vale la pena argumentar con información, evidencias y todo lo que quieras, una porque no eres de riot y otra porque el sistema seguirá igual, asi que gg.","replies":[]}]}]}]}]},{"poster":"Br1bkn","date":"2017-10-31T23:27:22.807+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Éste no es Diego,realm=LAS,application-id=PJAKt7ph,discussion-id=WusJgaPO,comment-id=0000,timestamp=2017-10-30T02:58:47.844+0000)\n>\n> Mientras no les contestes a sus insultos, nada pasará.\n> \n> Si te fijas mas abajo en este sub, todos los baneados porque &quot;una premade de 4 me reportó xdxddxdxdddd&quot; les contestaron, fueron reportados con razones y se comieron el ban.\n\na mi me dijeron \"MORITE VOS Y LA SIDOSA DE TU MADRE\", \"morite chileno de un terremoto\" , \"chileno sin mundial\" ,\"WEON CALENCHU\", le respondí con insultos menos de la mitad de fuertes que esos y sin embargo a mi me restringen el chat y a ese tipo al parecer no le hicieron nada aunque lo haya reportado al soporte, no me salió  la retroalimentacion instantánea\n\nAh y el tipo como me restringieron chat me agrega y me dice por chat \"JAJJA TE BANEARON CHILENO DE MIERDA\" pero me bloqueo instantaneamente y no alcancé a sacar pñantallazo, pero aun así para rito el malo soy yo","replies":[{"poster":"Bastante Simple","date":"2017-11-01T05:03:55.093+0000","up_votes":1,"down_votes":0,"body":"Lo mas gracioso es el cartel que aparece de las 10 partidas, ese donde sale la supuesta partida agresiva que flameaste y leo mi super agresividad con cosas como \"porfa deja de morir\" \"aguanta a que bote y te voy a ayudar\" \"wardea\", pero como te reportaron un premade de 4 y riot tiene puros guatones que les da flojera revisar las partidas, terminas baneando automaticamente por una maquina.","replies":[]}]}]},{"poster":"Spíroz","date":"2017-10-31T03:13:56.285+0000","up_votes":2,"down_votes":1,"body":"El sistema es perfecto,funciona muy bien,si no hay motivo de sancion,te pueden reportar 40 trillones de veces,pero no te va a pasar nada,ya no es como antes,saquen ese mito de sus cabezas,y juegen despreocupados,siempre con actitudes que sean sanas,que no proboquen mal en algo ajeno a nosotros,y por si quieres saber,yo cree un programa para la gente con problemas de auto-control.\n[Clickea aca :D](https://boards.las.leagueoflegends.com/es/c/charlas-generales/503P3eJu-para-todos-los-que-creean-nesesitar-reformarselos-invitocompartir)\nagradeceria que me dejen un voto positivo,me ayuda mucho a que mas gente lo vea,para poder ayudar a todos los posibles :D\n\ny animos :D\n\n{{sticker:slayer-jinx-catface}}","replies":[]},{"poster":"Luketa55","date":"2017-10-30T21:55:24.107+0000","up_votes":1,"down_votes":0,"body":"Amigo el LOL es un juego de lo mas toxico y por desgracia si lo quieres jugar deberas aguantar a esa gente por mas injusto que sea por que al fin y al cabo no puedes cambiarlos y por mucho que los mutees arruinan la partida.\nPero en fin no hay nada que hacer si rito te dice que los reportes y al final no pasa nada, es una lucha de uno mismo","replies":[]}]}