{"poster":"Kageyama Tobio","date":"2017-09-03T09:42:35.867+0000","title":"Neo Pax Sivir","subforum":"Miscellaneous","up_votes":2,"down_votes":0,"body":"Hey Summoners,\r\n\r\nI was wondering will Neo Pax Sivir be available to attendees at PAX Aus or will I need to just forge it with gemstones? \r\n\r\nThanks,\r\n\r\nKageyama Tobio :)","replies":[{"poster":"Lord Sesshomaru","date":"2017-09-03T11:43:53.196+0000","up_votes":1,"down_votes":0,"body":"Neo Pax Sivir will be available at Pax Australia.\n\nhttp://oce.leagueoflegends.com/en/news/champions-skins/skin-release/neo-pax-sivir-and-epic-capsules-now-live\n\nUnfortunately, the rest of us who don't happen to live in Melbourne _(or even in Australia)_ will have to use up 10 gemstones... :/","replies":[{"poster":"Klavinmour","date":"2017-09-03T16:41:41.495+0000","up_votes":1,"down_votes":0,"body":"I got it for free cause I already have PAX Sivir :D\nSucks NEO PAX doesn't have a boarder to tell people I own the original...","replies":[{"poster":"Lord Sesshomaru","date":"2017-09-03T20:50:22.553+0000","up_votes":2,"down_votes":0,"body":"The jealousy is real! xD\n\nI have to waste 10 gemstones (i only have 7...) to get a skin I would get for free If i just happened to be born an Aussie instead of a Kiwi... _(racism?)_\n\nThats a little annoying, but I suppose having the original skin and playing it is enough though? :P","replies":[{"poster":"Klavinmour","date":"2017-09-04T06:14:53.507+0000","up_votes":1,"down_votes":0,"body":"Eh yeah and no, I like to cycle between skins.\nUntil now for Sivir it's really just been PAX and Spectacular.\n\nI don't like how my friend gets constantly bombarded with \"hurr how much did that cost you\" whenever he plays with a skin made from gemstones, so I want that boarder to say \"I got this because I have the original, I didn't spam the crafting system\".","replies":[{"poster":"Lord Sesshomaru","date":"2017-09-04T08:37:41.114+0000","up_votes":1,"down_votes":0,"body":"Tbh, I hate limited edition skins just because of what they represent.\n\nThey are only valuable when other people don't have them.\nWhich means the only thing that makes them valuable, is the fact that people want to feel better than someone else because they have something and the other person doesn't.\n\n_(What other reason is there for wanting something 'limited?')_\n\nTo use you as an example here; you didn't _work_ for PAX Sivir. There were no missions or charity donations or the like.  Either you rocked up to an event because you happened to live in a country where that event was held, or you were given or bought a code online somewhere.\n\nWhy should you be rewarded for that? What have you done to deserve it?\nEither you were lucky that you lived next to an event, or you were lucky that someone sold you a legit code.\n\nI can understand borders when they are earned, like the Yasuo and Riven borders.\nNo one misses out on the chance to get a cool skin, but players who were around at the time and actively participated in the VS. event, can get a little nod to show that they were part of the fight between Light and Dark. It's not much, and everyone can still enjoy all the skins without having to fly around the world.\n\nWhy should you get a border just for being lucky enough to live in a country where they gave skins out for free?\nYou already get 2 free skins because of that.  One of which, 95% of the planet weren't even given the opportunity to get, and will **never** get again.  And the other costs such an astronomical amount _(for what lets be honest, is a very average skin)_, that most people just straight up wont get it _(even if they do manage to earn the 10 gemstones in the couple of months allocated)_.\n\nSo personally, if it were me, id be counting my lucky stars that I get 2 limited edition skins, for almost no effort at all, just for living in proximity to where someone decided to hold an event! While the rest of the world toils away at the chance to get just one of them, and mourns the fact that they will **NEVER** own the other. \n\nIm not aiming this directly at you btw, just at the idea behind 'limited edition' skins.\n\n_________\n\nI think _value_ should be measured by the quality of the product, and not by how many people won't have it. \n\nFor example, I think its pathetic that Neo Pax Sivir, is more valuable that Elementalist Lux, when Lux is by far a more superior product.\n\nAnd falsely introducing that limitation into a product _(e.g. a line of code)_ that has no physical limitations _(as opposed to something like Gold, which is limited because there can only physically be a finite amount of it)_ is just terrible.\n\nBut this is of course just my opinion.\n\n\n[EDIT]: And I say this as an owner of every legacy skin in the game _(except heartseeker Vayne)_ and nearly all of the limited icons, boarders, wards, and all that other exclusive stuff too. So I fall for it as much as the next man.  But that doesn't mean I agree with it.","replies":[]}]}]}]}]},{"poster":"Jason","date":"2017-09-03T17:00:51.609+0000","up_votes":1,"down_votes":0,"body":"NEO Pax Sivir is discontinued, you will only get the non neo version\n\nor something","replies":[]}]}