{"poster":"jcw3","date":"2014-12-10T22:48:09.746+0000","title":"Update Failed Stuck at 32%","subforum":"[ARCHIVED] Help & Support","up_votes":3,"down_votes":0,"body":"I was having a lot of issues with bugsplats, and I had already tried repairing the files in my game. I decided to redownload the game earlier today after it working fine yesterday minus the bugsplats. Now I can't get past the 32% on the launcher. I have tried deleting several folders and files in my League application (running on Mac client) and repairing the client. It always gets to the same spot where an unspecified error occurs and it gives me the options of saving my logs and continuing then just sits at 0.49 MB and 0 Kbps. Does anyone know how to fix this issue? I have not had an issue patching before and didn't have one when I was downloading the 4.21 patch the first time when my game was actually working.\n\nEdit: stuck on step 1/2 updating interface if that matters.","replies":[{"poster":"Digital Ram","date":"2014-12-10T23:23:37.639+0000","up_votes":2,"down_votes":0,"body":"Hey jcw3,\n\nHave you checked out the [Wrenchmen's toolbox](http://boards.na.leagueoflegends.com/en/c/help-support/peVhMJAo-the-wrenchmens-toolbox-common-solutions-to-your-problems-technical-issues) yet? The patching section have a few steps that should help you patch up your game!","replies":[{"poster":"jcw3","date":"2014-12-10T23:30:32.641+0000","up_votes":1,"down_votes":0,"body":"I actually have tried everything in that guide. I have reinstalled multiple times and deleted certain folders from other solutions I found and none of them have worked. It always starts and then stops at the exact same place every time I try.","replies":[{"poster":"jcw3","date":"2014-12-10T23:34:24.816+0000","up_votes":1,"down_votes":0,"body":"Also, I haven't had any issues downloading the patches that have been out recently. With 4.21 for example, it downloaded no problem. But since uninstalling and reinstalling the game, this is where I get stuck. I was just playing on this computer and this internet connection last night with no problems other than the bugsplats that I was trying to reinstall to fix because I had read that other people had managed to fix their issues with bugsplatting by reinstalling when the repair tool didn't work.","replies":[{"poster":"Digital Ram","date":"2014-12-10T23:39:26.343+0000","up_votes":1,"down_votes":1,"body":"Thanks for the info. You probably went through this, but I just want to make sure you checked out the [Patching Issues](https://support.riotgames.com/hc/en-us/articles/202969434-Patching-Issues) page as well. If none of those steps resolve your problem, I recommend you [submit a support ticket](https://support.riotgames.com/hc/en-us/requests/new).","replies":[{"poster":"GreenHatGamer","date":"2014-12-11T00:00:07.183+0000","up_votes":1,"down_votes":0,"body":"I have also been having this problem, I've sent tickets, I've followed the steps, and NOTHING has helped.","replies":[]},{"poster":"jcw3","date":"2014-12-10T23:41:52.055+0000","up_votes":1,"down_votes":0,"body":"I did indeed :( I will submit a ticket then. Was just hoping there would be an easy fix.","replies":[]}]}]}]}]},{"poster":"lick my noob","date":"2015-06-11T04:29:10.609+0000","up_votes":1,"down_votes":1,"body":"Hi guys, not sure if this is still an issue for some, but;\n\n**Workaround found by reijkobayashi.**\n\n**Quote:**\nHad this problem all day. Finally working after doing this.\n\nOk so open windows explorer.\n\nNavigate it to \"C:\\Riot Games\\League of Legends\\RADS\\projects\\lol_air_client\\releases\\0.0. 1.107\"\n\nInside the 0.0.1.107 folder create a file called; \"S_OK\" \n\nAll caps and it *MUST NOT HAVE A FILE TYPE EXTENSION.* \n\nTo create a blank file just create a notepad file or something and remove the .txt.\n\nThen close out of the launcher reopen and it works now.\n\n--\n\nHope this helps, it helped me immediately. \n\np.s - make sure to have all lol programs closed before trying!","replies":[{"poster":"EGYPSUS","date":"2015-06-28T04:18:31.403+0000","up_votes":1,"down_votes":0,"body":"It looks like it works.","replies":[]}]},{"poster":"EGYPSUS","date":"2015-06-28T04:08:48.187+0000","up_votes":1,"down_votes":0,"body":"I always get this issue, and I never seem to be able to fix it. Is it maybe related to using a 3G internet connection?","replies":[]},{"poster":"Panicwave","date":"2014-12-10T23:33:19.685+0000","up_votes":1,"down_votes":0,"body":"I've sent logs through now, and I've also done everything in the 'The launcher stops downloading' section of The Wrenchmen's toolbox. I don't really want to reinstall League again.","replies":[{"poster":"jcw3","date":"2014-12-11T00:07:25.570+0000","up_votes":1,"down_votes":0,"body":"neither the repatch or the repair did anything for me. I'm reinstalling but hopefully the install will get past 32% this time although it doesn't seem to be working at all.","replies":[]}]},{"poster":"Panicwave","date":"2014-12-11T00:04:17.469+0000","up_votes":1,"down_votes":0,"body":"The re-patch didn't work so I am repairing now...","replies":[]},{"poster":"Panicwave","date":"2014-12-10T22:59:12.477+0000","up_votes":1,"down_votes":0,"body":"I have the exact same problem. Past forums have said just to leave it and it will work itself out, which does work ( I know this from past experiences). Just a bit annoying I can't play LoL.","replies":[{"poster":"GreenHatGamer","date":"2014-12-11T00:01:00.252+0000","up_votes":1,"down_votes":0,"body":"How long did it take to sort out, exactly?","replies":[]},{"poster":"jcw3","date":"2014-12-10T23:18:52.260+0000","up_votes":1,"down_votes":0,"body":"Do you mean like leave it loading and it will load eventually even though it says error? or do you mean they will eventually fix it?","replies":[]}]},{"poster":"Panicwave","date":"2014-12-10T23:49:55.460+0000","up_votes":1,"down_votes":0,"body":"I have forced a re-patch and am waiting now, hopefully no repair needed.","replies":[]}]}