{"poster":"dentop1","date":"2016-02-03T08:21:16.697+0000","title":"Domanda.","subforum":"Campioni e gameplay","up_votes":2,"down_votes":2,"body":"Secondo voi come vi sembra jhin?? \r\nSecondo me non &egrave; chi sa che cosa sgravo mi sembra non troppo forte non troppo bilanciato, basta che gli prend un assassin o yasuo poi gg lo killi come nulla.\r\nQuesto e quello che pens&ograve; di jhin. Datemi il vostro parere,grazie.\r\n\r\nP.s scusate se avr&ograve; fatto qualche errore di grammatica.","replies":[{"poster":"Hype GENERAL ZOD","date":"2016-02-04T11:47:35.553+0000","up_votes":1,"down_votes":0,"body":"Conta che la gente nn da giocare contro jhin ancora,appena la gente gli prende le misure e da come contrastarlo la situazione cambia. Appena uscito Bard riusciva a vincere anche Mid e top.....giusto per dire ,giocare contro campioni che nn sai cosa fanno,quando attaccarli e nn sai i loro danni ti fa perdere chiunque tu usi (per quello tendenzialmente é iper bannato,non perché sia forte ma perché sia un interrogativo per tutti). Appena uscito con Bard ho fatto  qualcosa tipo 15-3-20 mid e 12-2-10 top(con quadrakill) cio rende Bard OP? Proprio no.","replies":[]},{"poster":"Demigod Summoner","date":"2016-02-03T10:34:18.815+0000","up_votes":1,"down_votes":0,"body":"Guarda i miei due ultimi game. Ah sono uno scarsone come ADC.","replies":[]},{"poster":"Hype GENERAL ZOD","date":"2016-02-03T10:15:23.397+0000","up_votes":1,"down_votes":0,"body":"Secondo me proprio non é sbilanciato. Vayne,graves per me sono piu forti (per dirne due),fa tantissimi danni ma solo quello,att.speed bloccato e ricarica ogni 4 colpi. Permaban perché la gente nn ci sa giocare contro appena gli prendono le misure sparisce dalla scena ,almeno secondo me","replies":[]},{"poster":"Nibbio Bianco","date":"2016-02-03T08:59:59.764+0000","up_votes":1,"down_votes":0,"body":"Lento e debole in early game, lento e forte in late game. \n\nRiven invece è veloce e forte in early game, veloce e debole in late game. \n\nQuindi se dovessero giocarlo in mid pickate Riven.","replies":[]},{"poster":"Ucr0niA","date":"2016-02-03T08:25:17.877+0000","up_votes":1,"down_votes":0,"body":"E' appena uscito, la maggior parte delle persone lo gioca con item e maestrie ridicole, è ancora presto per parlare del suo impatto in game, ancora non ho visto uno che beccava con la W nemici colpiti dalle sue mine a distanza per dirne una.\n\nPer quanto mi riguarda, è un ottimo momento per giocare {{champion:201}} , data la probabilità di averlo contro.","replies":[{"poster":"dentop1","date":"2016-02-03T08:29:17.897+0000","up_votes":1,"down_votes":0,"body":"Si hai ragione e appena uscito ma secondo te e sbilanciato? Giusto per sapere  il parere degli altri.","replies":[]}]}]}