{"poster":"Marto","date":"2015-07-14T23:31:45.522+0000","title":"Idea para evitar partidas con personas indeseables","subforum":"Comportamiento del jugador","up_votes":5,"down_votes":0,"body":"Hola.\r\n\r\nHoy, despu&eacute;s de varias partidas con personas que entraban a la selecci&oacute;n de campe&oacute;n para rankeados diciendo que si no les daban la linea que quer&iacute;an trolleaban (y otros individuos que no les daban la linea porque, es cierto, eso solo los incentiva a seguir haci&eacute;ndolo), se me ocurri&oacute; que deber&iacute;a haber alg&uacute;n sistema para desincentivar a estos jugadores y permitir que la gente que est&aacute; atrapada en la selecci&oacute;n con ellos se salve. Ante la situaci&oacute;n, obviamente decid&iacute; salir de la partida, con las penalizaciones que eso implica. \r\n\r\nMi idea es que se pueda salir una cantidad de veces limitada al d&iacute;a de selecci&oacute;n de campeones de rankeadas, cosa de poder evitar tener que aguantar 30 minutos durante la partida a un troll (algo bueno para los que quieren jugar en serio) y de pasada que los jugadores que hacen esas amenazas tarden m&aacute;s en jugar (ya que si dicen eso la mayor&iacute;a de la gente se saldr&aacute; de la partida). \r\n\r\nNo es la idea del siglo pero creo que es &uacute;til para desincentivar el comportamiento desagradable de algunos jugadores y alivia un poco a la gente que los tiene que aguantar d&iacute;a a d&iacute;a.\r\n\r\nSaludos y perd&oacute;n si no est&aacute; en la secci&oacute;n que corresponde !","replies":[{"poster":"Neo Gaussrik","date":"2015-07-15T18:00:36.381+0000","up_votes":2,"down_votes":0,"body":"Si implementaramos esto, no sientes que muchos jugadores elegirian usarlo cuando:\n\n- Alguien elige un campeon que no les gusta\n- Alguien toma un rol que ellos querian antes que ellos\n- No les gusta el perfil de alguno de sus aliados\n\netc?\n\nLa consecuencia seria alargar las colas mucho para los jugadores, ya que cada vez que entras a seleccion de campeones puedes esperar que alguien se va a salir- varias veces antes de finalmente poder llegar a una partida.\n\nLos castigos por salirse estan ahi precisamente para evitar esto- por ello, no creo que el resultado final seria particularmente positivo para los jugadores. :S","replies":[{"poster":"Alkayr","date":"2015-07-17T14:42:19.481+0000","up_votes":1,"down_votes":0,"body":"¿Y si se implementara un report en el lobby? especialmente para estos casos.\n Cosa de decir \"bien, me quieren trollear así que voy a quitear, perder PI, etc PERO al menos puedo esperar que se implemente un castigo\"","replies":[{"poster":"Neo Gaussrik","date":"2015-07-17T16:14:32.104+0000","up_votes":2,"down_votes":0,"body":"Esto es mas prometedor inicialmente- se ve como que no alargaria las colas, verdad?\n\nPero, espera. Significa esto que despues de reportar el reporte tiene que ser procesado para ver si amerita castigo? En este caso, igual no soluciona tu problema- el proceso tarda mas de lo que se demora en comenzar la partida, y entonces igual te ves en una partida con un troll y tienes que jugarla.\n\nO significa esto que el reporte no seria procesado y simplemente asume que la gente que reporta tiene la razon? Porque, en este caso, -si- se presta para abusos: puedes convencer a tu equipo de \"reportar\" a alguien porque eligio teemo o zilean o algun otro campeon que no te gusta, y de nuevo tenemos el problema de las colas.\n\nEs un problema dificil!","replies":[{"poster":"PoLiLLa17","date":"2015-07-18T23:35:07.291+0000","up_votes":3,"down_votes":0,"body":"Veo que no tienen ganas de laburar.. Contratame a mi y te tiro en una semana 100 opciones diferentes de como solucionar el problema. A ver si a todas le podes argumentar lo mismo..","replies":[]},{"poster":"Alkayr","date":"2015-07-17T23:41:19.607+0000","up_votes":1,"down_votes":0,"body":"\nA ver... mi concepto de reporte era que, cuando un usuario acumulaba cierta cantidad se le hacía un seguimiento... en dicho caso, uno se daría cuenta de si los reportes fueron por pickear un teemito, o ya sea por pickear una lane que ya pickearon antes (hay un veigar mid y pickean un azir alegando que veigar puede suportear), flamear en el chat, amenazar de trollear, etc.... \nAhora una aclaración muy importante, no conozco con precisión como funciona el sistema de reportes, por lo tanto no se si lo que sugiero es posible {{champion:32}}","replies":[]}]}]},{"poster":"Giorse","date":"2015-07-15T19:14:13.741+0000","up_votes":2,"down_votes":0,"body":"entonces que hacemos? De entrada sabemos que alguien va a trollear la partida desde la seleccion de campeones y tenemos que estar obligados a jugarla. No solo es una molestia, es una perdida de tiempo. Y encima tenemos que perder los que tratamos de hacer bien las cosas.","replies":[{"poster":"Neo Gaussrik","date":"2015-07-15T19:20:08.184+0000","up_votes":3,"down_votes":0,"body":"Aunque se que es una respuesta frustrante, lo correcto de hacer en este caso es jugar la partida y reportar al troll al final. :/\n\nEste es uno de esos casos en el que tenemos que admitir que no tenemos una buena solucion al problema.","replies":[{"poster":"NiTr0xGamer","date":"2015-07-27T21:26:26.843+0000","up_votes":1,"down_votes":0,"body":"Y de que sirve reportar al final? si total no pasa nada luego de reportarlo, yo eh reportado muchos trolls y todavia los veo jugando","replies":[]},{"poster":"Giorse","date":"2015-07-15T20:29:27.047+0000","up_votes":1,"down_votes":0,"body":"Bueno, gracias por admitirlo por lo menos. Lo que estaría muy bueno es que haya moderadores que monitoreen partidas. Veo que hay mucha gente que uno reporta con motivos mas que evidentes y así y todo siguen jugando como si nada. Tengo pruebas de gente que estoy siguiendo y sigue jugando.","replies":[{"poster":"NoobStyle","date":"2015-07-15T22:22:32.036+0000","up_votes":1,"down_votes":1,"body":"cual es el problema de q hay un troll en un game? no te va a pasar siempre. trolls hay en todas las divisiones. no estas en las divisiones bajas culpa de los trolls. lo estas por tu mal desempeno.\na todos nos han tocado trolls,afk, flamers y muchos hemos llegado a ligas altas. \nde ultima, si entrasdte a un champ select y hay un troll, quitea. perderas solo 3 LP que no son nada. no perderas MMR q es lo importante.\nsaludos!","replies":[{"poster":"Giorse","date":"2015-07-16T18:02:20.064+0000","up_votes":1,"down_votes":0,"body":"Me parece que poco jugas al LOL. Mira, yo estoy en una división baja y puedo jugar mal, como vos quieras. Pero van 6 promos seguidas que pierdo solo porque me toca gente que se va afk o gente que trollea, asi de simple. Casi todas las partidas me toca gente tóxica, pierde una vez y se pone a insultar a todos, se van afk o trollean.\nYo puedo jugar mas o menos, o mal. Pero tóxico no soy. Te lo puedo asegurar.","replies":[{"poster":"NoobStyle","date":"2015-07-16T22:19:51.190+0000","up_votes":1,"down_votes":0,"body":"ahi vi q eres bronce. hace poco que juego? puede ser. juego desde la s3 y soy diamante 5.\ntu hace cuanto q juegas?\nme canso de decirle esto a todo el mundo, si estas en bronce aprende a carrear, aprende a ganar 4 vs 5, a ganar con troll, con afk, carreala tu. me cree hace un tiempo otra cuenta, empece a jugar desde bronce y la subi a platino. con afks, doble jungla, sin adcs, trolls, flamers. y sali. y tu q pasa? sigues en bronce.\nno es para q te enojes. a mi me pasaba lo mismo q a ti, cuando sali d plata y llegue a oro por primera vez queria llegar a platino. pero era mediocre. no carreaba mis partidas, el top fedeaba y yo lo insultaba, perdia mi promo para oro 1 por un afk y decia q era culpa de los afk. me tocaban trolls y decia q era culpa de los trolls. y la verdad sabes cual era? q yo no podia carrear.\ncuando mejore mi nivel, empece a jugar mejor, a carrear games 4 vs 5, con trolls, a ganar mas de las q pierdo. se me hizo facil llegar a platino. llegue 2 cuentas y una la tengo en diamond. y paso eso, no espere q me carrearan. hubo partidas q jugue mal, hubo partidas q me trollearon, q me sacaron mi jungla siendo yo first pick, tuve afks, y no putie, no insulte ariot. segui y segui. y aqui estoy. asi q no culpes a RIOT, el problema eres tu.\nsaludos!","replies":[{"poster":"Alkayr","date":"2015-07-17T14:37:27.813+0000","up_votes":1,"down_votes":0,"body":"Ambos tienen razón.... si estas en bronce/plata es por ser malo, podes mejorar ahi... pero hay que decir que también es bastante difícil salir de bronce","replies":[{"poster":"NoobStyle","date":"2015-07-18T00:12:25.544+0000","up_votes":1,"down_votes":0,"body":"dificl es llegar a challenger donde hay solo 100 jugadores. bronce no es dificil, si mejoras sales facil.","replies":[{"poster":"Marto","date":"2015-07-18T03:55:38.477+0000","up_votes":1,"down_votes":0,"body":"Creo que sigue habiendo un problema en tu argumentación. Yo acepto que no soy suficientemente bueno como para carrear un 4vs5 o un 4vs6 (con un jugador feedeando). No tengo problema en aceptarlo y, dado el contexto, YO no soy capaz de salir de plata. \n\nPero el problema va más allá. El problema es que ese tipo de jugador pueda afectar a tal punto el funcionamiento del juego que sea necesario aprender a jugar independiente de tu equipo, aprender a jugar como un jugador individual en un juego de equipos. Tu crees que los clanes profesionales juegan independientemente de su equipo ? Dale, toma el ejemplo de Challenger. Yo voy más allá. Tu crees que KLG ganó jugando solo ? No. League of Legends es un juego de equipo, de trabajo en conjunto y cómo tal, debiera incentivar el trabajo en equipo.\n\nMás abajo veo a Gaussrik nuevamente comentando que esta propuesta implica más tiempo en las colas. Veo criticas al sistema pero no veo que realmente se le pregunte a la comunidad: ¿Prefieren tener que jugar la promo con un troll o demorarse 2 minutos más en encontrar partida?","replies":[{"poster":"NoobStyle","date":"2015-07-20T19:43:31.888+0000","up_votes":1,"down_votes":0,"body":"me estas comparando equipos de nivel Mundial con gente de bronce,plata oro platino en el server LAS. el nivel se nota y mucho. primero tenes q mejorar vos para poder salir de tu liga.\nen todas las divisiones tocan trolls,afk y feeders y no por eso todos estamos estancados en ligas bajas. \notra cosa es q Ranked Team o Liga internacionales poco tienen q ver con lo q nosotros jugamos diariamente q es el SOLOQ, ahi depende mas de la habilidad del jugador o el duo que del equipo. no es lo mismo 5 personas q juegan hace meses, con team speak o skype. q 5 desconocidos, jugando a ciegas.\npor eso, el problema no son los feeders,afk o trolls. esos estan en todas las ligas. el problema es una constante en cada juego que pierdes. y esa constante querido amigo, eres tu.\npiensa q hay msa probabilidades q toquen toxicos en el equipo de enfrente q en el tuyo. a ellos les pueden tocar 5. a ti 4, porq tu no eres el toxico.\nsi quieren salir de ELOS bajos, mejoren su nivel de juego.\ndespues el tema de JUEGO DE EQUIPO, jugar de a5, composiciones, lo hablamos cuando sean challenger o tengan q ir algun mundial.\nes simple!\nsaludos!","replies":[]}]}]}]}]}]}]},{"poster":"Neo Gaussrik","date":"2015-07-15T21:09:36.747+0000","up_votes":1,"down_votes":1,"body":"El problema es que aunque suena como una buena idea, es impracticable- la cantidad de partidas que hay comparado con la cantidad de Rioters es descomunal, y solo podriamos filtrar una infinitesimal fraccion de los partidos incluso si nos dedicaramos a esto full-time. :/","replies":[{"poster":"Zhúkov","date":"2015-07-16T20:05:15.423+0000","up_votes":1,"down_votes":0,"body":"Y para qué pago ? contraten más rioters (?) {{champion:27}}","replies":[]}]}]},{"poster":"PoLiLLa17","date":"2015-07-18T23:28:35.180+0000","up_votes":1,"down_votes":0,"body":"La verdad, me encanta como no se les ocurren posibilidades de lidiar con estas cosas. En el Heroes of newarth estaba la votacion para expulsar de la partida a una persona por estar AFK, y la exp y oro se incrementaba para el equipo con uno menos, para que la partida siguiera siendo \"jugable\" no digamos pareja. Se podría pensar en algo similar para el caso de los trolls. Y como siempre digo en todos mis posts, poner a chilenos y argentinos en un mismo server es muy mala idea. De los flammers no se libran nunca. Acuerdense de eso!","replies":[]}]}]},{"poster":"Abÿzeth","date":"2015-07-16T00:54:37.733+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Riot Gaussrik,realm=LAS,application-id=PJAKt7ph,discussion-id=lBiN0mNy,comment-id=0005,timestamp=2015-07-15T18:00:36.381+0000)\n>\n> Si implementaramos esto, no sientes que muchos jugadores elegirian usarlo cuando:\n> \n> - Alguien elige un campeon que no les gusta\n> - Alguien toma un rol que ellos querian antes que ellos\n> - No les gusta el perfil de alguno de sus aliados\n> \n> etc?\n> \n> La consecuencia seria alargar las colas mucho para los jugadores, ya que cada vez que entras a seleccion de campeones puedes esperar que alguien se va a salir- varias veces antes de finalmente poder llegar a una partida.\n> \n> Los castigos por salirse estan ahi precisamente para evitar esto- por ello, no creo que el resultado final seria particularmente positivo para los jugadores. :S\n\nY no sería más fácil un sistema de votación dentro de la partida, son 5 jugadores, si uno esta trolleando, que necesite un máximo de 3 votos para ser expulsado de la partida y una penalización de 5 minutos para volver a entrar?","replies":[]},{"poster":"Marto","date":"2015-07-16T00:25:35.284+0000","up_votes":1,"down_votes":0,"body":"Pero justamente al implementarlo como votación y no como algo individual se evita que sea solo por maña de 1. Es lo mismo que pasa cuando alguien tira surrender y nadie vota que si.\n\nRespecto a lo que dijo NoobStyle (más abajo), el hecho de que a todos les pase no lo hace mejor, al revés, mayor justificación aún para buscar alguna solución. Además si bien es cierto que en los tiers altos hay trolls, en Bronce y Plata está plagado. En un día fácilmente me han tocado 2 de 5 partidas.\n\nLamentablemente al ser rankeado, tener que jugar y perder sabiendo desde el principio que pasará no debería ser opción. Personalmente no me molestaría esperar un poco más para comenzar un rankeado si me aseguro de tener gente que quiere jugar y no solo molestar al resto.","replies":[]}]},{"poster":"Maxilpm","date":"2015-07-15T21:28:13.587+0000","up_votes":3,"down_votes":0,"body":"Seria bueno que aparezca una tipo votacion para expulsar al troll de seleccion de campeon  ,  asi como el surrender \n\"Dejenme Top o trolleo\" ,  y es expulsado por votacion , y que a ese troll le den cola de baja prioridad de uno 30 min en ranked o 10 en normal o depende las veces que lo expulsen , es una buena idea ... es la unica forma de parar a estas ratas.\n {{item:3044}} {{champion:29}}","replies":[{"poster":"PoLiLLa17","date":"2015-07-18T23:25:17.127+0000","up_votes":1,"down_votes":0,"body":"Es muy buena idea, el tema es que pasa si ese troll esta en duo? Ya hay 2 personas que no lo van a votar como troll.","replies":[]}]},{"poster":"Kyousuke","date":"2015-07-15T02:47:13.370+0000","up_votes":2,"down_votes":0,"body":"votación antes de partida para expulsar","replies":[]},{"poster":"PROPH3T","date":"2015-07-14T23:49:47.407+0000","up_votes":2,"down_votes":0,"body":"La idea es buena pero, pensa que muchos la pueden usar tambien como escapatoria para no tener que ir en la posicion que no gusta..","replies":[]},{"poster":"Excorpion","date":"2015-07-14T23:46:32.323+0000","up_votes":2,"down_votes":0,"body":"Es una idea que yo mismo había concebido, pero con una variante... \nQue la mayoría del Teamse ponga en acuerdo para salirse de esta selección de campéon...\nY el jugador que supone peligro (el troller), sea advertido o sancionado desde ese momento...\nasi no pueda unirse a partidas durante un tiempo... la verdad es una buena idea","replies":[]},{"poster":"Zhúkov","date":"2015-07-16T20:35:40.801+0000","up_votes":1,"down_votes":0,"body":"Yo opino que todos hemos sido personas indeseables para algún otro, es parte del juego, y más del soloQ que se trata de jugar con 4 personas random y tratar de ganar, obvio que es molesto pero aguantatela, te acostumbras xD {{item:2010}}","replies":[]},{"poster":"Árahel","date":"2015-07-16T05:36:38.206+0000","up_votes":1,"down_votes":0,"body":"Es buena la idea pero tengan un poco mas de paciencia y reporten al final de la partida y si pueden con pruebas para que ese troll este pemabaneado del juego ademas si prestan atencion varias personas con mala actitud estan siendo baneados. solo es cuestion de intentar carrear y si se pierde reportar. Igual seria muy bueno alla alguna herramienta en la seleccion de campeon para ese jugador que este en promo no termine siendo perjudicado por ese troll","replies":[]},{"poster":"Ghosthead","date":"2015-07-15T00:05:46.525+0000","up_votes":1,"down_votes":0,"body":"Tiene sus cosas buenas y sus cosas malas, los trols podrían tomar provecho de esto si es que se agrega","replies":[]},{"poster":"Bucéfalø","date":"2015-07-14T23:51:34.801+0000","up_votes":1,"down_votes":0,"body":"Yo igual lo apruebo","replies":[]}]}