{"poster":"foxMichael","date":"2017-11-10T02:24:41.700+0000","title":"Crees que deberian de volver a dar esencia azul despues de las partidas???","subforum":"Charlas Generales","up_votes":6,"down_votes":4,"body":"No se uds. pero de verdad que te den esencia azul solo cuando logras subir de nivel es un asco, preferia el sistema antiguo y poder conseguir PI para poder comprar mis cosas, ahora solo parese una siniestra foma de hacer que la gente gaste en RP.","replies":[{"poster":"BlindGuardians","date":"2017-11-10T14:09:00.352+0000","up_votes":1,"down_votes":0,"body":"TOTALMENTE DE ACUERDO !! te invito a pasar por otro post en charlas generales que ya tiene bastantes +1 y que habla de los puntos negativos que surgen a partir de estos cambios. Nos partieron y ese post lo dice clarito. esto no le gusto a nadie. {{sticker:sg-shisa}} \nhttps://boards.las.leagueoflegends.com/es/c/charlas-generales/2v0HWPRi-mi-opinion-sobre-el-nuevo-sistema-de-ea?sort_type=recent","replies":[]},{"poster":"Remor","date":"2017-11-10T04:04:43.643+0000","up_votes":1,"down_votes":0,"body":"Deberia volver, me salio la capsula con jax\nosea q o lo hago esencia azul por 200, o lo hago campeon, q me pide 800...\nosea{{sticker:sg-ahri-1}}","replies":[]},{"poster":"More Powder CLEO","date":"2017-11-10T02:57:57.382+0000","up_votes":1,"down_votes":0,"body":"La tasa de ingresos es muy baja.Las personas que dicen que el sistema funciona cuando lleguen a niveles donde tengan que jugar 200 partidas para poder subir de nivel no diran lo mismo.Todo es cuestion de logica.Mas nivel + EXP.\nNo subir de nivel=no ingreso por lo tanto debemos invertir MAS TIEMPO en un juego para obtener moneda dentro del mismo juego que antes la obteniamos jugando solo 2 dias.Resumen:El sistema es muy malo","replies":[]},{"poster":"Fan de Jizeru","date":"2017-11-10T02:46:43.070+0000","up_votes":1,"down_votes":0,"body":"se gana menos chicos hagan los calculos \nun datito lean reddit esta quedando al caga por el cambio de PI a ESENCIA","replies":[]},{"poster":"Zafphlyn","date":"2017-11-10T02:35:46.030+0000","up_votes":1,"down_votes":0,"body":"Es lo mismo o mejor el nuevo sistema solo que en vez de recibir un puchito en cada partida recibis todo de golpe al subir de nivel encima podes comprar campeones con descuento si es que te llega su fragmento a la larga vas a ver que podes comprar más campeones que antes pero igualmente va a seguir siendo lento como antes (que la gente parece que se olvida que tampoco era mucha la ganancia de pi) ganabas 1000 por día y si jugabas mucho.","replies":[]},{"poster":"2801","date":"2017-11-10T02:32:13.875+0000","up_votes":1,"down_votes":1,"body":"Lo mismo que WhiteMax, gano más y encima me parece más practico, ahora, el problema es las personas que les faltan poquitas EA para su campeón de x cantidad, pero bueno, en lo demás es mejor.","replies":[]},{"poster":"WhiteMax","date":"2017-11-10T02:30:03.569+0000","up_votes":1,"down_votes":1,"body":"Naaa ahora gano mas que antes. De que me sirve ganar 70 por partida si igual necesitaba seguir jugando para juntar la cantidad necesaria.","replies":[]}]}