{"poster":"PriXeD","date":"2017-11-21T22:50:40.245+0000","title":"Nerf Zoe","subforum":"Jugabilidad, balance y narrativa","up_votes":7,"down_votes":12,"body":"Asco.","replies":[{"poster":"Daeronir","date":"2017-11-28T16:10:16.005+0000","up_votes":4,"down_votes":0,"body":"chicos esta mierda esta rotisima se que los nuevos champs es sus comienzos tambien pero esto ya es otro nivel loco ajjajajajajajaja tienen que nerfearla de una loco enserio","replies":[]},{"poster":"Malzahur","date":"2017-11-22T06:47:00.868+0000","up_votes":4,"down_votes":0,"body":"Zoe no esta rota al inicio de la partida ,el problema y por el que se vuelve muy rota y espero que la nerfeen es cuando uno esta en el Lategame con su bajo enfriamiento tiene el combo del cc mas la Q y te revienta (sino me equivoco con el maximo de reduccion de enfriamiento la tenes a la habilidad del cc cada 4 o 5 s),osea un adc o un mago tendra que estar cada 4 s atento a una habilidad que es muy facil tirarla con su ulti y despues no podes escapar de su Q ya que el cc dura mucho tiempo.Riot porfavor reduzcanle el daño y el tiempo de cc","replies":[{"poster":"Not Personal","date":"2017-11-22T14:56:14.045+0000","up_votes":1,"down_votes":0,"body":"Zoe no esta tan rota, la gente todavia no sabe jugarle, he visto gente que cuando tiro la r me corren en vez de esperar a que vuelva, o tiran sus ccs a mi primer portal apenas lo  tiro, osea que cuando vuelvo ya los esquive. Tiene movilidad pero tambien depende mucho de los hechizos de invocador (cosa que no esta SIEMPRE DISPONIBLE) y su daño depende mucho de su rango, no es tan facil meter la q  si no esta el campeon stnueado o dormido. Tiene muchisimas mecanicas y formas divertidas de usarla, pero tambien es facil countrearla si sabes ser paciente o inteligente.","replies":[{"poster":"Malzahur","date":"2017-11-22T23:17:32.787+0000","up_votes":3,"down_votes":0,"body":"Man lo que dije es porque jugue contra una zoe buena y le ganaba la linea pero ya en el late game uno esta obligado a lanzarse (mas siendo una leblanc)y le metia mucho pero el cc que tiene ,no solo tiene un alcance ridulo y en enfriamiento y duracion igual o mayor de ridiculo, ella era buena tengo que admitirlo pero no cambia el hecho que me tiraba el cc a una distancia tremende o tiraba la r se acercaba y te la pegaba (que por cierto hay que ser muy malo para no pegar el cc teniendo la R),bueno con el combo R E Q creo que casi es implosible estar esquivandola todo el tiempo ,man esta rota cuando te toque alguna mas o menos buena que enfrentes veras que es muy injusto.","replies":[{"poster":"Kadalso","date":"2017-11-26T16:15:46.897+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Malzahur,realm=LAS,application-id=xQmJPO8F,discussion-id=qknBrNYz,comment-id=000300000000,timestamp=2017-11-22T23:17:32.787+0000)\n>\n> Man lo que dije es porque jugue contra una zoe buena y le ganaba la linea pero ya en el late game uno esta obligado a lanzarse (mas siendo una leblanc)y le metia mucho pero el cc que tiene ,no solo tiene un alcance ridulo y en enfriamiento y duracion igual o mayor de ridiculo, ella era buena tengo que admitirlo pero no cambia el hecho que me tiraba el cc a una distancia tremende o tiraba la r se acercaba y te la pegaba (que por cierto hay que ser muy malo para no pegar el cc teniendo la R),bueno con el combo R E Q creo que casi es implosible estar esquivandola todo el tiempo ,man esta rota cuando te toque alguna mas o menos buena que enfrentes veras que es muy injusto.\n\nEsta rota, Movilidad excesiva, el stun que tiene es más facil de meter y dura bastante como una {{champion:25}}  y tiene el alcance de {{champion:101}}  y la w le da 3 misiles cuando recolecta hechizos en teamfight, eso es un abuso siempre alguien va gastar algún flash para huir siendo que la R la puede usar para  escapar siendo que la ulti ya se lo permite. La q funciona como la de {{champion:76}}  nada más que es más facil de meter por que al poder cambiar de dirección reactivandola, no hay patrón para estudiar y aprender a esquivar. Siempre alguno te va a venir con el cuento de que no sabes jugarle cuando en el juego hay campeones que estan para atrás o que tengas que pickear x champ solo para ganarle.  Más que seguro me llenarán de negativos, pero lo que dije es innegable.  Un saludo.\n\nPD en High elo la están empezando a banear","replies":[]}]}]}]},{"poster":"Gol D Roger","date":"2017-11-26T01:32:37.158+0000","up_votes":3,"down_votes":0,"body":"Pensar que no esta rota es algo muy pelotudo realmente un campeon que tenga una cantidad de daño ridiculo en una sola habilidad spameable y hasta muy fácil de pegar teniendo uno de los mejores cc del juego.\ncuando pensé que no podían sacar un campeón mas sidoso que  yasuo salio esta reverenda mierda","replies":[]},{"poster":"dscpnak","date":"2017-11-21T23:02:52.685+0000","up_votes":4,"down_votes":1,"body":"wow debe ser tiempo record en cry posts...","replies":[]},{"poster":"Rakan Wawita","date":"2017-11-21T22:55:59.369+0000","up_votes":2,"down_votes":0,"body":"counter:Evitar q Evitar e obligarla a intentar escapar con la ult stunearla matarla :P\n\n>Saludos y suerte en las partidas!!!!:D  :{{champion:150}} Adc junto a {{champion:497}} Supp y el gank de {{champion:142}}","replies":[]},{"poster":"Quilltro","date":"2017-12-04T11:09:27.474+0000","up_votes":1,"down_votes":0,"body":"Típico New Champ Broken, siempre salen así para vender skin, pero en este caso se les fue de las mano el campeón tiene el mayor rango de habilidades spameables y ademas dispara bombas nucleares, le basta con pegar 1 \"q\" y si no mata a alguien lo deja en coma y gg teamfight, y ni tiene que ir feed, el cc que tiene es ultra fácil aplicarlo si se le acercan (ni menciono que aumenta su rango si atraviesa muros o estructuras) y si la dejas libre te pokea bestialmente aun de lugares sin vision {{item:3151}} ","replies":[]},{"poster":"bombastico","date":"2017-11-22T15:01:23.906+0000","up_votes":1,"down_votes":0,"body":"Igual es divertido ver a la gente que intenta escapar con la ulti xD","replies":[]},{"poster":"The Steel Shadow","date":"2017-11-22T05:14:31.030+0000","up_votes":2,"down_votes":2,"body":"340 de velocidad de movimiento en un campeón que ya tiene movilidad, vaya horrible balance, 540 de rango de autoataque, vaya que horror... parece que es la creación favorita de alguien que la quiere ver 100% rota y que no halla sido creada porlas, esas 2 estadísticas están op, bajenlas","replies":[]}]}