{"poster":"Hi im Fossi","date":"2016-07-20T12:08:00.019+0000","title":"/Remake eine Belohnung  für den Gewinner","subforum":"Allgemeiner Chat","up_votes":1,"down_votes":3,"body":"Wie w&auml;re es wenn ihr bei dem &quot;/Remake&quot; einfach dem dann sogenannten &quot;Gewinner-Team&quot; eine &quot;Belohnung einbaut. Beispielsweise 5 LP oder irgendwas was weil das ist halt bl&ouml;d wenn man 5 Minuten auf sein game wartet ( In h&ouml;heren Ligen nat&uuml;rlich l&auml;nger) und dann kommt man rein und denkt sich &quot; Endlich kann ich zocken&quot; und dann wird man nach 2-3 Minuten wieder rausgeschmissenen weil da einer afk ist. Weil dem der AFK ist werden ja auch Punkte abgezogen","replies":[{"poster":"MrWhiteHD","date":"2016-07-20T12:10:50.931+0000","up_votes":2,"down_votes":0,"body":"Als ich mit Ranked angefangen habe, wurde ich in Bronze 1 eingestuft. \nDann wollte ich ein Spiel spielen und jemand hatte ein DC und wir haben ein remake gemacht, und ich wurde abgestuft, weil es als niederlage gezählt hat. \nIch dachte es wird ungewertet das Spiel.","replies":[{"poster":"InfectedGreed","date":"2016-07-20T12:12:05.101+0000","up_votes":1,"down_votes":0,"body":"dann war der afkler dein premade und daher gibts für dich auch Punkteabzug...sonst könnte man das System ausnutzen.","replies":[{"poster":"SorisDynasty","date":"2016-07-20T14:02:40.686+0000","up_votes":2,"down_votes":0,"body":"Premade-Strafen gibt es erst für Diamond-Spieler, meiner letzten Info nach.","replies":[{"poster":"InfectedGreed","date":"2016-07-21T06:47:28.532+0000","up_votes":1,"down_votes":0,"body":"Ja ich glaube du hast Recht, hatte das auch so verstanden, war mir aber nicht 100% sicher.\n\nDa hilft nur ein Ticket.","replies":[]}]},{"poster":"MrWhiteHD","date":"2016-07-20T12:14:22.775+0000","up_votes":2,"down_votes":2,"body":"Ich habe alleine gespielt. Deswegen habe ich es nicht verstanden.\nSpiele sehr selten mit premades, weil ich nur Schlechte kenne oder welche die heftig flamen und ich mir das ingame nicht antun will wenn jemand das team runterzieht.\n\nich versuche immer andere aufzubauen, denn davon hat man mehr, als wenn man flamt und diese person dadurch schlechter Spielt.","replies":[{"poster":"InfectedGreed","date":"2016-07-20T12:17:18.823+0000","up_votes":1,"down_votes":0,"body":"Das ist, abgesehen von einem Bug, die einzige Erklärung.\n\nWir hatten gestern auch ein Match abgebrochen, weil unser ADC afk war und ich hab keine Punkte verloren.\n\nSchreib mal n Ticket an den Support.\n\ngreetz","replies":[{"poster":"MrWhiteHD","date":"2016-07-20T12:20:46.571+0000","up_votes":1,"down_votes":0,"body":"Das ist jetzt bestimmt 2 wochen her, wusste nicht das man tickets schreiben kann.","replies":[{"poster":"shivaluna","date":"2016-07-20T13:11:42.078+0000","up_votes":2,"down_votes":0,"body":"probiers einfach :)","replies":[]}]},{"poster":"HHaie tabbian","date":"2016-07-21T08:51:26.636+0000","up_votes":1,"down_votes":0,"body":"Soweit ich weiß, verlierst du erst ab Dia Punkte, wenn es dein Premade ist, der den remake auslöst.\n/Edit: Sorry, hätte wohl erstmal weiter runterscrollen sollen ;)","replies":[]}]}]}]}]},{"poster":"wolf454","date":"2016-07-22T00:08:32.909+0000","up_votes":1,"down_votes":0,"body":"Nah nicht lp vlt. 5 rp oder so^^ oder ein schlüssselteil:D","replies":[]},{"poster":"Sir Fabi Of The","date":"2016-07-21T21:49:58.477+0000","up_votes":1,"down_votes":0,"body":"Ja gut, dann fangen wir jetzt an gebottete Accounts zu kaufen gleichzeitig zu queuen und jedesmal zu /remake'n\nDer acc verliert dann 20 lp und man kriegt dafür 45 auf andere aufgeteilt\nRinse and repeat\nInfinite Lp\nProfit","replies":[]},{"poster":"oneshot Vasco","date":"2016-07-21T17:04:57.222+0000","up_votes":1,"down_votes":0,"body":"also wenn dann würde ich diese 5 LP allen 9 anderen geben. weil die anderen 4 aus dem afk team haben ja auch ihre zeit gewartet :p","replies":[]}]}