{"poster":"Nelpolian","date":"2016-11-18T03:25:06.824+0000","title":"I Have never been so personally insulted","subforum":"Miscellaneous","up_votes":3,"down_votes":3,"body":"Let me start by stating that I absolutely love playing Singed. He is probably my favorite champion, and although I am high bronze (I dont play him in ranked since I&#039;ve learned more meta champs) I truly believe that Singed can be played anywhere, anyway. \r\nRecently my friend told me about an article he read, which basically outlined that Riot threatened to Permanently Ban the highest mastery Singed in the player base (over 2 million, just to mention) because he: &quot;Failed to communicate with his team&quot; and &quot;Failed to work with his team&quot;.\r\nLet me start by saying, YES he does  (or did) play using smite and counter jungling, leaving the ADC to fend for themselves for a few minutes (OH THE HORROR), but its not like he didn&#039;t tell his team about it. In almost every game he played in, he alerted his team about what he was doing. He HONESTLY wanted to win, and had over a 50% win rate, and has now dropped heavily in elo, going from somewhere around plat, to now silver, close to bronze. \r\nI am TRULY appalled with Riot, and after giving such a positive review on their treatment of players, I feel used, and honestly betrayed. \r\nAnd failing to work with teammates? He made sure to (while countering the enemy jungler, no less) gank for his team, helping his team to win more than just bottom lane.\r\nI don&#039;t know, maybe im just ranting because I use empathy too much, but if you enjoyed playing a champion to the point where you have played him more than anyone else in the world, and the developers shut you down and basically tell you no more playing him how you enjoy, would&#039;t you be mad too?","replies":[{"poster":"MegaV78G87","date":"2016-11-18T03:53:07.344+0000","up_votes":3,"down_votes":1,"body":"He is currently gold I believe, and there is something I want to point out that riot said which I find to be interesting when talking about this issue. In the section titled (Laning phase and the Mid-game) in the first sentence they say \"Who says supports have to hang out in the bot lane?\" Um... Honestly bringing smite as a support has the benefit of putting the enemy jungler behind early, but with the risk of getting caught by the enemy. It is risky but it helps your team out if pulled off correctly, and only a few champs can do it that fit in the support role. You would only want to steal the one side that the enemy jungler is not at and you want to leave if you are spotted to avoid getting jumped by the enemy then you return to lane and support like normal. Chilling smite and challenging smite have their benefits, and the one that gives you extra wards is good for a support as well. Having 2 people with smite on the team makes it a bit easier to control objectives like dragon and baron/rift. It is often better, in my opinion, if the support jumps in drag pit and steals dragon with smite from the enemy and dying for it than to have the jungler do the same and die. Smite for ivern support makes sharing buffs with your adc easier but it is possible to share buffs with your adc without smite though it might take a bit longer.\nhttp://na.leagueoflegends.com/en/featured/champion-reveal-ivern-green-father\n\nI once took smite mid as nunu and I did pretty well, but we lost the match because the enemy had an illaoi and we did not build our team well enough to deal with her ult. Also smite can now heal more than the actual summoner spell heal, so if you build chilling smite then you have a slow and a heal that holds up to 2 charges and a much lower cooldown than heal and exhaust (yes exhaust has its benefits over just a slow but there is the heal to take into consideration, and since krugs will likely be killed less often it is almost 100% reliable to use as a source to smite and heal from then return to lane). For tanks 100 + 10% of their hp is really good. Heal heals for 90-345 hp and is 50% effective if more than one heal spell is used in a short time, but for the heal from smite say your a tank with 3000 hp and you have 2 charges ready for smite you will be healed for 100 + 10%  which would be 400 hp already and in a few seconds if you need it you can heal for another 400 hp by smiting the same or a different camp, making fights in the jungle a possible way of turning around a fight or surviving one. People can find creative ways to win matches and they shouldn't be banned for it, unless it is really unhealthy for the community.","replies":[]},{"poster":"Fitzky","date":"2016-11-18T03:30:37.935+0000","up_votes":3,"down_votes":1,"body":"Yeah it was a pretty bad move by Riot tbh but they still think it was the right thing to do when the majority of the community disagree","replies":[]},{"poster":"Erøse","date":"2016-11-18T12:47:56.718+0000","up_votes":1,"down_votes":0,"body":"I feel like Riot is implementing the meta now. He did not \"fail\" to communicate with his team since he told his team in the lobby precisely what he was gonna do and don't give me that bullsh*t about him not supporting because as far as I know, a support is not only a support for the AD carry but rather a support for the whole team. He is in fact supporting his whole team because when he invades the enemy jungler, the jungler now knows the location of the enemy jungler and can counter jungle easily. \n\n\nRiot is just......","replies":[]},{"poster":"The Wanak King","date":"2016-11-18T04:09:36.889+0000","up_votes":1,"down_votes":1,"body":"im still waiting to see if anyone comments back on my comment? http://boards.oce.leagueoflegends.com/en/c/gameplay-strategy/ueqVEGpw-support-singed-though?comment=0000 first comment :3 tell me am i not right??","replies":[]}]}