{"poster":"Kyo Hatori","date":"2017-05-27T05:17:45.957+0000","title":"¿Yasuo necesita un nerf?","subforum":"Charlas Generales","embed":{"description":"Imgur: The most awesome images on the Internet.","url":"http://imgur.com/a/LtaD5","image":"http://i.imgur.com/VlVV1rv.jpg?fb"},"up_votes":13,"down_votes":5,"body":"He visto estos d&iacute;as gente de ambos bandos bombarde&aacute;ndose con afirmaciones tales como:\r\n\r\n-&quot;Yasuo est&aacute; roto, nerf&eacute;enlo&quot;\r\n-&quot;Yasuo no est&aacute; roto, solo no sabes jugarle&quot;\r\n\r\nEstas discusiones han hecho correr rios de tinta (bueno, r&iacute;os de datos. Porque estamos en internet, entienden? internet, datos jajaja, vale p&eacute;guenme) y creo que ambas afirmaciones son err&oacute;neas y ambas son ciertas. Me explico.\r\n\r\nLa realidad est&aacute; a la mitad. No est&aacute; roto, pero tampoco est&aacute; equilibrado. \r\nYasuo no ha sabido encontrar su rol. Si te pon&eacute;s a pensar qu&eacute; rol cumple el yasuo? si tu, el yordle del gorrito horrible\r\n\r\n{{champion:17}} Yasuo est&aacute; hecho para estompear el late game.\r\n\r\nUmmm algo asi, otra respuesta? si tu el chico de complejo de megalomania\r\n\r\n\r\n{{champion:119}} Es un duelista, pero peor que DRAAAAVEEENN!\r\n\r\nExacto.\r\n\r\nYasuo es un duelista de late game. Es algo parecido a lo que hace {{champion:24}}  o {{champion:114}} . He notado que la mayor&iacute;a piden que le saquen la W a Yasuo, pero perder&iacute;a su esencia, una especia de Aang el avatar del viento, pero este en su versi&oacute;n m&aacute;s demacrada, borracho, asesina maestros y con unos malentendidos &eacute;picos con su peluquero y sus geles de cabello. \r\n\r\nPensalo a Yasuo como una Fiora. Un duelista excelente, con una habilidad que lo hace inmune por unos segundos. Que es invencible en 1 vs 1. Pero con sus particularidades. Tiene que ser de late game por ejemplo y muy &aacute;gil. \r\n\r\nPero . . . (ac&aacute; viene lo que tienen que arreglar) Hay que equilibrarlo de acuerdo a su rol.\r\n\r\n_**Debe ser malo en Team Fights: **_: Se aclaro bastante. Los duelistas son buenos duelistas, no pod&eacute;s tener un duelista que encima sea bueno en team fights porque estar&iacute;a desequilibrado. No recuerdan a Camile cuando estaba tan rota?\r\n\r\nHay que admitir que dos de sus habilidades no corresponden a su rol. El muro de viento lo protege tanto a &eacute;l como a sus aliados. Aqu&iacute; es un error gigante, no pod&eacute;s tener en un duelista una habilidad de utilidad como la de Braum. Incluso no es q te reduce el da&ntilde;o la W. Te elimina los proyectiles. Lo que yo har&iacute;a para que est&eacute; &quot;equilibrado&quot; es que solo afecte a Yasuo, o sino, que dure mucho menos. Osea es una habilidad que ayuda al team entero, y lo has visto al muro en lvl alto?? es algo de locos la verdad.\r\n\r\nLa ulti tampoco encaja con su rol. Ten&eacute; en cuenta que debe ser malo en Team Fights. No puede ser que tenga una habilidad de control de masas que ni siquiera requiera apuntar. No est&aacute; cumpliendo su rol. Lo que yo modificar&iacute;a ser&iacute;an dos cosas. Que solo afecte a un champ enemigo, y que tengas que seleccionar vos al champ. Algo como que por ejemplo, vos marc&aacute;s con la ulti a un champ, lo levantan y le haces mucho da&ntilde;o. O no se, algo m&aacute;s al rol duelista y no que sea una orianna con complejo de Gok&uacute; ( y si, lo digo por el peinado jaja. Nunca me cansar&eacute; de esa broma )\r\n\r\n\r\n_**Es un champ de late game:**_: Y como champ de late game debe ser bastante d&eacute;bil en early pero fuerte en late. Creo que no est&aacute; roto, pero tampoco es justo, que un champ como yasuo llegue a late y si o si, puedas matar y recuperarte muy r&aacute;pido. Lo se de primera mano. Deber&iacute;a pagar caro las malas decisiones, y se le deben premiar las acertadas. No puede ser que una vayne, una kindred, un garen, un galio, una cassio paguen tan caro tener un mal early, hasta casi quedar in&uacute;tiles. Pero un Yasuo pueda remontar mucho m&aacute;s f&aacute;cil que ellos. Es injusto realmente. Y todos cumplen un rol de carrys. De nuevo, no es un champ acomodado a su rol.\r\n\r\n**_Debe pensarse como un champ situacional_**: Yo no se ustedes, pero estoy cansado de ver yasuos en TODAS LAS PARTIDAS. Creo que el otro problema de rol de yasuo es que lo piensan como asesino. Y como dijimos antes, no es asesino, es un split pusher, de late game y duelista. No deber&iacute;a ser reemplazo de champs como katarina, Talon, FIzz, Zed, Akal&iacute;. Porque es un champ split pusher, duelista y de late game. Su objetivo es tirar torres, su objetivo es tener movilidad. Pero tambi&eacute;n debe entenderse que hay muchos champs y que pueden cumplir una funci&oacute;n igual o mejor de acuerdo al team. \r\nSI ves que un champ tiene un porcentaje de pick rate y de ban rate importante (a yasuo no lo nerfean a&uacute;n porque su win rate no es alto) deber&iacute;an prestarle atenci&oacute;n. Su win rate no es alto porque lo usan muchos que no conocen el champ, pero quien lo conoce, sabe que es mejor que otros hard carry, y no es su funci&oacute;n ir mid, o adc, o jg, o que se yo. Su funci&oacute;n es pushear y ganar pronto. \r\n\r\n_**&iquest;Qu&eacute; propongo?**_\r\n\r\nDejemos claro el rol de Yasuo. Y lo arreglemos para ese rol, si es un champ (vuelvo a repetir) de split push, de late game y duelista, bueno. Que as&iacute; sea, pero que tenga las ventajas y desventajas de ese rol. No le demos herramientas tan fuertes de team fights, y no le nerfeemos tanto el early. Nerfeemos el late game, y que sea un champ para ganar r&aacute;pido. Y si le vas a dar la tremenda movilidad que tiene, entonces hacelo m&aacute;s blandito y no se, quitale el escudito que tiene de pasiva. Riot sabe mejor que yo c&oacute;mo equilibrar.\r\n\r\nAclaro algo, yasuo no est&aacute; roto. Est&aacute; DESEQUILIBRADO. Tiene un problema de identidad.\r\n\r\nArreglemos eso, lo definamos, y ver&aacute;n que se acabar&aacute; el &quot;pls nerfeen a yasuo, rito trol&quot; o &quot;yasuo es izi, y es para mancos sin mecanicas&quot;.\r\n\r\n\r\n\r\nFelices Pesadillas ≧◠ᴥ◠≦","replies":[{"poster":"RazorToddy","date":"2017-05-27T09:28:39.700+0000","up_votes":7,"down_votes":0,"body":"Yasuo es ADC punto.","replies":[{"poster":"Turing Test","date":"2017-05-27T13:36:09.837+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=RazorToddy,realm=LAS,application-id=v7qsfXsE,discussion-id=FEFAWOkZ,comment-id=0006,timestamp=2017-05-27T09:28:39.700+0000)\n>\n> Yasuo es ADC punto.\n\nhttp://s1.postimg.org/h02bqhdhr/Sin_t_tulo.png","replies":[]}]},{"poster":"zelaya19","date":"2017-05-27T06:10:11.932+0000","up_votes":6,"down_votes":0,"body":"> [{quoted}](name=Kyo Hatori,realm=LAS,application-id=v7qsfXsE,discussion-id=FEFAWOkZ,comment-id=,timestamp=2017-05-27T05:17:45.957+0000)\n>\n> He visto estos d&amp;iacute;as gente de ambos bandos bombarde&amp;aacute;ndose con afirmaciones tales como:\n> \n> -&amp;quot;Yasuo est&amp;aacute; roto, nerf&amp;eacute;enlo&amp;quot;\n> -&amp;quot;Yasuo no est&amp;aacute; roto, solo no sabes jugarle&amp;quot;\n> \n\nEso siempre se ve pero es más por el comportamiento de las personas que juegan Yasuo, y por la gente que no sabe enfrentarlo, ambas cosas se mezclan y generan odio hacia el campeón.\n\n> La realidad est&amp;aacute; a la mitad. No est&amp;aacute; roto, pero tampoco est&amp;aacute; equilibrado. \n> Yasuo no ha sabido encontrar su rol. Si te pon&amp;eacute;s a pensar qu&amp;eacute; rol cumple el yasuo? si tu, el yordle del gorrito horrible\n> \n> {{champion:17}} Yasuo est&amp;aacute; hecho para estompear el late game.\n> \n\nEstoy de acuerdo!\n\n > {{champion:119}} Es un duelista, pero peor que DRAAAAVEEENN!\n> \n\nHay duelistas más peligrosos que Yasuo a esa altura, pero no suelen ser pickeados con tanta frecuencia y son más débiles al principio (Jax o Maestro Yi por ejemplo). \n\n\n> Yasuo es un duelista de late game. Es algo parecido a lo que hace {{champion:24}}  o {{champion:114}} . He notado que la mayor&amp;iacute;a piden que le saquen la W a Yasuo, pero perder&amp;iacute;a su esencia, una especia de Aang el avatar del viento, pero este en su versi&amp;oacute;n m&amp;aacute;s demacrada, borracho, asesina maestros y con unos malentendidos &amp;eacute;picos con su peluquero y sus geles de cabello. \n> \n> Pensalo a Yasuo como una Fiora. Un duelista excelente, con una habilidad que lo hace inmune por unos segundos. Que es invencible en 1 vs 1. Pero con sus particularidades. Tiene que ser de late game por ejemplo y muy &amp;aacute;gil. \n> \n\n\nSacando el muro de viento es un personaje que no posee control de masas, el cual como es demasiado efectivo contra Nami, Braum, Graves, etc, es completamente inútil contra personajes como Irelia, Lissandra, Pantheon, etc (Es una habilidad menos). Y posee un CD muy alto, aclarando que Yasuo no se construye items que disminuyan  CD (salvo Danza de la muerte, muy situacional).\n\n\n> _**Debe ser malo en Team Fights: **_: Se aclaro bastante. Los duelistas son buenos duelistas, no pod&amp;eacute;s tener un duelista que encima sea bueno en team fights porque estar&amp;iacute;a desequilibrado. No recuerdan a Camile cuando estaba tan rota?\n> \n> Hay que admitir que dos de sus habilidades no corresponden a su rol. El muro de viento lo protege tanto a &amp;eacute;l como a sus aliados. Aqu&amp;iacute; es un error gigante, no pod&amp;eacute;s tener en un duelista una habilidad de utilidad como la de Braum. Incluso no es q te reduce el da&amp;ntilde;o la W. Te elimina los proyectiles. Lo que yo har&amp;iacute;a para que est&amp;eacute; &amp;quot;equilibrado&amp;quot; es que solo afecte a Yasuo, o sino, que dure mucho menos. Osea es una habilidad que ayuda al team entero, y lo has visto al muro en lvl alto?? es algo de locos la verdad.\n> \n> La ulti tampoco encaja con su rol. Ten&amp;eacute; en cuenta que debe ser malo en Team Fights. No puede ser que tenga una habilidad de control de masas que ni siquiera requiera apuntar. No est&amp;aacute; cumpliendo su rol. Lo que yo modificar&amp;iacute;a ser&amp;iacute;an dos cosas. Que solo afecte a un champ enemigo, y que tengas que seleccionar vos al champ. Algo como que por ejemplo, vos marc&amp;aacute;s con la ulti a un champ, lo levantan y le haces mucho da&amp;ntilde;o. O no se, algo m&amp;aacute;s al rol duelista y no que sea una orianna con complejo de Gok&amp;uacute; ( y si, lo digo por el peinado jaja. Nunca me cansar&amp;eacute; de esa broma )\n> \n\nYasuo no es tan efectivo como parece, en situaciones puede ser muy fuerte. Piensa que Yasuo no es bueno haciendo picks por su cuenta (Ahri, Twisted Fate, Fizz, Elise, etc), no es tan buen splitpusher como otros personajes (Tryndamere, Fiora, Singed, Jax). Las únicas habilidades que posee en una teamfight es su muro de viento y su ulti ya que sobre el muro de viento he hablado, si le quitamos el potencial de teamfight que tiene nos quedaría un personaje que dentro de los duelistas, sería uno de los peores en 1 v 1 y que no aporta nada más.\n\nPaso a explicar sobre su definitiva, no es algo tan trivial como \"Alistar lo levanta y ultea\", pero Yasuo es un personaje situacional, necesita de campeones que levanten y eso no es para nada trivial. Un Yasuo sin personajes que levanten depende exclusivamente de su tornado, y alguien con dos dedos de frente no se va a comer el tornado o mejor aún, en la jungla no tiene como cargar el tornado salvo los propios bichos de la jungla o exponiéndose.\n\nPiensen en los personajes que poseen Knock Ups y en los que no tienen, Yasuo es situacional y cuando uno juega Yasuo se arma una **composición en base a el** de la misma manera que uno pickea Maokai o Shen y Lulu para crear una composición alrededor de Kog'Maw. Y esa composición en base a Yasuo se basa en hacer el mayor daño posible en una teamfight, la cual es facílmente contrarrestable ya que generalmente los campeones que se usan son débiles en early (Y si ese daño no alcanza en teamfight son aplastados).\n\n\n\n> _**Es un champ de late game:**_: Y como champ de late game debe ser bastante d&amp;eacute;bil en early pero fuerte en late. Creo que no est&amp;aacute; roto, pero tampoco es justo, que un champ como yasuo llegue a late y si o si, puedas matar y recuperarte muy r&amp;aacute;pido. Lo se de primera mano. Deber&amp;iacute;a pagar caro las malas decisiones, y se le deben premiar las acertadas. No puede ser que una vayne, una kindred, un garen, un galio, una cassio paguen tan caro tener un mal early, hasta casi quedar in&amp;uacute;tiles. Pero un Yasuo pueda remontar mucho m&amp;aacute;s f&amp;aacute;cil que ellos. Es injusto realmente. Y todos cumplen un rol de carrys. De nuevo, no es un champ acomodado a su rol.\n> \n\nEstás seguro? Garen no es de late game, si no de early game. Eso es porque dejan remontar a Yasuo, la partida se debe terminar cuanto antes. Deja farmear a un Gankplank o a una Vayne que vaya 0/7 y verás en late game como te desarman. En todo caso, las malas decisiones las toma el equipo que lleva la ventaja por ir confiados, Yasuo no es un campeón ignorable, es como Katarina o Darius que si no los CCeas te desarmará toda la TF.\n\n> **_Debe pensarse como un champ situacional_**\n> \n\nYa respondí esta parte.\n\n> SI ves que un champ tiene un porcentaje de pick rate y de ban rate importante (a yasuo no lo nerfean a&amp;uacute;n porque su win rate no es alto) deber&amp;iacute;an prestarle atenci&amp;oacute;n. Su win rate no es alto porque lo usan muchos que no conocen el champ, pero quien lo conoce, sabe que es mejor que otros hard carry, y no es su funci&amp;oacute;n ir mid, o adc, o jg, o que se yo. Su funci&amp;oacute;n es pushear y ganar pronto. \n> \n\nEso es cuestión de popularidad, pero si fuese tan hard carry como creen, en elo alto se usaría bastante cuando en realidad su presencia es casi nula salvo por algún OTP (Yassuo, Arkadata, etc).\n\n\n \n> _**&amp;iquest;Qu&amp;eacute; propongo?**_\n> \n> Dejemos claro el rol de Yasuo. Y lo arreglemos para ese rol, si es un champ (vuelvo a repetir) de split push, de late game y duelista, bueno. Que as&amp;iacute; sea, pero que tenga las ventajas y desventajas de ese rol. No le demos herramientas tan fuertes de team fights, y no le nerfeemos tanto el early. Nerfeemos el late game, y que sea un champ para ganar r&amp;aacute;pido. Y si le vas a dar la tremenda movilidad que tiene, entonces hacelo m&amp;aacute;s blandito y no se, quitale el escudito que tiene de pasiva. Riot sabe mejor que yo c&amp;oacute;mo equilibrar.\n> \n\nNerfear el late game sería matar al campeón, tiene un early débil que a lo sumo está un poco potenciado por el buff a los items de críticos pero nada que no se pueda arreglar.\n\n> Aclaro algo, yasuo no est&amp;aacute; roto. Est&amp;aacute; DESEQUILIBRADO. Tiene un problema de identidad.\n> \n\n\nYasuo tiene una identidad bastante clara a mi parecer. Problema de identidad lo tiene Teemo, Urgot, entre otros.\n\n\n> Arreglemos eso, lo definamos, y ver&amp;aacute;n que se acabar&amp;aacute; el &amp;quot;pls nerfeen a yasuo, rito trol&amp;quot; o &amp;quot;yasuo es izi, y es para mancos sin mecanicas&amp;quot;.\n> \n\nNunca se va a acabar eso, la gente tiene un odio al campeón bastante irracional.\n\n> Felices Pesadillas ≧◠ᴥ◠≦\n\nIgualmente ≧◠ᴥ◠≦\n\nSi tu pregunta es si soy main Yasuo, pues no. Si lo he jugado pero no es mi main ni de cerca (es Ahri).\n\nPd: No se si se quotea mal o yo quoteo mal que se coloca así, todo desfigurado el texto :(","replies":[{"poster":"Edden","date":"2017-05-27T18:03:21.106+0000","up_votes":1,"down_votes":0,"body":" Vengo a dejarles unos consejos que les van a ser de utilidad a la hora de pelear contra un Yasuo. Para empezar soy main Yasuo, amo este personaje con todo mis ser y se que es un personaje frustrante contra el cual jugar, pero también tiene muchas desventajas las cuales puedes aprovechar para dejarlo en la ruina, acá van:\n\n-En la fase de lineas tienes que dejar que pushee la lane, un yasuo con la lane pusheada no tiene espacio para iniciar una pelea 1 vs 1, si dashea por tus minions termina en tu torre, así que se tiene que limitar a farmear. Tu jungla debería aprovechar la situacion y gankearlo, porque tampoco tiene escape a diferencia de muchos otros midlaners.\n\n-Si no sabes cuando tradearle ni como, la respuesta es sencilla. Inicia un trade en el momento exacto en el que gasta el tornado, te va a dar el tiempo suficiente para tradearle e irte antes de que tenga otro, sobre todo en early game, antes del trade quitale el escudo con un básico y si eres un pj a base de skillshots, hazle gastar el muro, tiene muchísimo cd a lvl bajo y alto también aunque menos.\n\n-No importa que vaya 0/6/2, después de que se armó el filo, va a pegar bastante, pero no va a tener oro para sus items defensivos, por lo que va a ser muy fácil de matar, elimínenlo rápido, ccenlo y mátenlo a el primero en cada tf, e intenten ganar lo mas rápido posible la partida.\n\n-Yasuo no es un pj que suele hacer roaming, es mas un splitpusher, estén atentos y caiganle de a varios cuando intente pushear, a diferencia de otros personajes, un yasuo en early/mid game no tiene chances de nada contra 3 y menos si alguno tiene cc.\n\n-Yasuo tiene un gran y amplia rama de counters a los que simplemente, no es posible ganarles linea si lo usan masomenos bien: Irelia, Darius, Malzahar, Akali, Diana, Riven, Pantheon, Renekton, Fiora, Fizz, Garen, etc. Aunque la mayoría de estos no son midlaners, puedes permitirte pickearlos si ves que hay un yasuo mid en el team enemigo, le vas a hacer la vida imposible.\n\nEsto es lo que yo haría si me toca jugar contra un Yasuo, espero que les sirva, saludos!","replies":[]},{"poster":"Kyo Hatori","date":"2017-05-27T15:03:22.361+0000","up_votes":1,"down_votes":0,"body":"Me encantó el vistaso tan claro e interesante que dijiste. Espero que también le echen una hojeada los que pasen asi se hacen con otra opinión tan interesante.\n\nThanks por pasarte  ≧◠ᴥ◠≦","replies":[]}]},{"poster":"Kyousuke","date":"2017-05-27T05:35:45.882+0000","up_votes":3,"down_votes":0,"body":"> La ulti tampoco encaja con su rol. Tené en cuenta que debe ser malo en Team Fights. No puede ser que tenga una habilidad de control de masas **que ni siquiera requiera apuntar**. No está cumpliendo su rol.\n\nno requiere apuntar pero requiere una condición que NINGÚN otro personaje tiene ese impedimento a la hora de lanzar un ultimate, quien dijo que yasuo es bueno en tf? XD lo único que tiene es ccear un poco y causar daño pero si se mete en tf de una esta mas muerto que un {{champion:17}} \ny camille nunca fue ni es buena para tf :P \nyasuo gana popularidad y es tan spam por lo divertido que es su kit y la cantidad de plays que puede realizar con su ultimate y sus escudos, es como {{champion:64}} {{champion:67}} {{champion:55}} {{champion:103}}  campeones con un requerimiento de habilidad bastante elevado y de kit divertido \npero concuerdo con que no esta claro su rol, yo siempre lo vi como duelista luchador al estilo {{champion:5}} {{champion:24}}  y no como asesino full ad","replies":[{"poster":"Kyo Hatori","date":"2017-05-27T14:57:02.725+0000","up_votes":4,"down_votes":0,"body":"Camile cuando estaba rota el problema es que era buenisima en TF. Por eso la nerfearon, ya que el objetivo es que fuera buena en 1 vs 1.","replies":[]},{"poster":"Mr Society","date":"2017-05-27T06:11:21.468+0000","up_votes":1,"down_votes":0,"body":"pues camille es un {{champion:64}} pero con una insec areal y dependiente de un enemigo","replies":[]}]},{"poster":"FF 15 Pls","date":"2017-05-27T06:09:42.898+0000","up_votes":2,"down_votes":0,"body":"Yasuo es catalogada como duelista, asesino, tanque, split psuher y un poco de utilidad, si es de late game no tiene que tener cdr tan bajos desde nivel 1 ademas su velocidad de ataque desde nivel 1 es la mas alta ni un adc tiene esa velocidad de  ataque a nivel 1. No necesita un nerfeo en los daños mas bien necesita un nerfeo en sus reducción de enfriamiento  en early y mid game, si esta hecho para el late game porque debe tener cdr tan bajos desde nivel 1,  si fuese así con todos entonces pónganle a vayne una q de 1 segundo una e de 1 segundos o a fiora, jax lo mismo son de late game todos ellos y sus habilidades tiene un cdr de 6 segundos el promedio hasta nivel 6, pero yasuo siendo tambien de late game su cdr promedio es de 2 segundo hasta nivel 6, o lo hacen de early game o de late game no tiene que ser ambos.","replies":[{"poster":"ˆMKˆ zZz","date":"2017-05-27T15:23:27.681+0000","up_votes":1,"down_votes":1,"body":"La Q de Yasuo dura 4 segundos.","replies":[]}]},{"poster":"El Grando Smokio","date":"2017-05-27T05:38:07.958+0000","up_votes":2,"down_votes":0,"body":"si tan solo le quitaran ese muro o que baje su duración entre mas proyectiles bloquea y que desaparezca instantáneo si bloquea un ulti estaría balanced xD","replies":[{"poster":"Thortilla86","date":"2017-05-27T20:53:51.512+0000","up_votes":1,"down_votes":0,"body":"Mejor sería que bloquee completamente el primer proyectil y luego una cierta cantidad de daño dependiendo del nivel de la habilidad","replies":[]},{"poster":"Kyo Hatori","date":"2017-05-27T14:57:43.564+0000","up_votes":1,"down_votes":0,"body":"eso también estaría. Que solo bloquee un proyectil","replies":[{"poster":"Nuke","date":"2017-05-27T15:57:07.446+0000","up_votes":1,"down_votes":2,"body":"¿Uno solo? Tampoco exageremos O.o\nPor mi que le dejen ese muro, pero que nerfeen la pasiva y esa Q con daño absurdo :/","replies":[]}]}]},{"poster":"Nuke","date":"2017-05-27T12:50:02.326+0000","up_votes":5,"down_votes":4,"body":"> Aclaro algo, yasuo no está roto. Está DESEQUILIBRADO.\n\nhttps://i.gyazo.com/d2fbaf107d1601853856738b8a46a5f7.png\n\nNo le busques la quita pata al gato, esta Desequilibrado > Desbalanceado > ROTO.\n\n¡Un saludo!","replies":[{"poster":"Kyo Hatori","date":"2017-05-27T15:04:04.586+0000","up_votes":1,"down_votes":0,"body":"jajajaja","replies":[]}]},{"poster":"davichost","date":"2017-05-28T08:20:28.829+0000","up_votes":1,"down_votes":0,"body":"me dio paja leer todo, nesecita un nerf no, un rework de habilidades como Fiora","replies":[]},{"poster":"XMasterLasheronX","date":"2017-05-28T05:38:46.639+0000","up_votes":1,"down_votes":0,"body":"a Yasuo lo Nerfearon! Solo la E ...\n#Riot solo quiere ver el Mundo Arder","replies":[]},{"poster":"faster51","date":"2017-05-27T20:57:54.299+0000","up_votes":1,"down_votes":0,"body":"NO, pero igual lo nerfeamos\n#muajajjaja\nhttp://k30.kn3.net/taringa/6/6/2/1/4/9/caprichoarabe/A88.gif","replies":[{"poster":"Edden","date":"2017-05-28T01:52:49.679+0000","up_votes":1,"down_votes":0,"body":"Jajajajajaja","replies":[]}]},{"poster":"MrDec","date":"2017-05-27T08:21:21.161+0000","up_votes":1,"down_votes":0,"body":"La verdad que tenes razón, planteaándolo asi yasuo no debería poder ofrecer utilidad a su team, como con el muro de viento.\nEs buena la idea de que lo toqueteen para que quede como un duelista sin mucho que hacer en tf.","replies":[]},{"poster":"Cool As Me","date":"2017-05-27T07:20:59.708+0000","up_votes":1,"down_votes":0,"body":"yo creo que is kent","replies":[]}]}