{"poster":"Kyo Hatori","date":"2017-01-11T15:09:26.766+0000","title":"Términos que quizá desconozcas","subforum":"Nuevos jugadores","up_votes":15,"down_votes":2,"body":"Debe ser bastante com&uacute;n que est&eacute;s jugando partidas, y que de repente te tiren un &quot;brb, ez, wp&quot; y tu quedes como O_O&quot; -qu&eacute; se supone que dijo . .. \n\nA mi hasta ayer me pasaba que me tiraban algo asi y yo decia &quot;espero que no sea que la est&eacute; cag**ndo&quot;\n\nAqu&iacute; la explicaci&oacute;n de algunos t&eacute;rminos m&aacute;s utilizados in game y en los foros de League of legends.\n\n**_Ez_** - Hasta donde tengo entendido es algo parecido a decir &quot;izi&quot; del anglicismo easy, que se traduce f&aacute;cil. Lo que no se es si tiene la connotaci&oacute;n negativa del izi que es motivo de report por ser una mala actitud hacia el adversario, o tiene otra connotaci&oacute;n. Agradecer&iacute;a asesoramiento jaja\n\n**_brb_** - Literalmente &quot;Be right back&quot; vuelvo enseguida, indica que no teclear&aacute; nada por un rato. En partida sería que vuelve a base, sea porque tiene poca vida, o mucho oro o bueno. Le apetece volver :v\n\n**_b_** - básicamente es parecido a brb pero distinto. Es cuando le indicas a algún aliado que vuelva a base.\n\n**_izi_** - Como explique anteriormente ser&iacute;a un anglicismo de &quot;easy&quot; f&aacute;cil, pero se usa para mojarle la oreja a tu contrincante. Provocarlo para que se enoje. Recomiendo no usarlo pues es motivo de report si lo usas constantemente.\n\n**_dat_** - Viene de &quot;that&quot; ese, b&aacute;sicamente se&ntilde;alas a alguien. Ejemplo, dat amumu. En temporadas anteriores aparentemente (no fui testigo directo del hecho) se usaba para indicar si algo estaba roto, o estaba manqueando mucho. Actualmente se usa para indicar un error o una manqueada.\n\n**_wp_** - Significa &quot;well played&quot; bien jugado. Lo usan al final de la partida para felicitar a ambos equipos de la partida. Es bueno usarlo siempre al final, pues motiva al buen ambiente y a la competencia m&aacute;s saludable, aunque la hayas pasado mal. jaja.\n\n**_gj_**  - &quot;good job&quot; buen trabajo. Cuando en tu equipo se consigui&oacute; una primera sangre, o hizo algo muy bien, lo sueles felicitar con un gj.\n\n**_report_** - No creo que se necesite mucha traducci&oacute;n para esto, pero ante la duda . . . se usa para pedir reporte al final de la partida por un mal comportamiento.\n\n**_worth_** - &quot;vale la pena&quot; una jugada arriesgada que sale bien, tambi&eacute;n le dicen &quot;worthy&quot;. También se da con los trades. Ponele que el equipo enemigo te mató al mid, pero a cambio tiraste torre. O que hagan drake y vos haces heraldo y torre, en ese caso ese Trade sería worth. (Trade =intercambio)\n\n**_gg_** - &quot;good game&quot; buen juego. Aunque no creas, en la comunidad de League of legends se usa de forma sarc&aacute;stica. Nunca digas gg, a lo sumo di gj. Porque se usa mucho para criticar a tu propio equipo (si, se que suena est&uacute;pido pero asi es) si lo matan, si no les gusta algo en particular. Obviamente recomiendo no usarla.\n\n**_kappa_** - Este t&eacute;rmino ha causado tanta pol&eacute;mica, miles de v&iacute;deos, miles de discusiones. Creo que originalmente apareci&oacute; en Twitch, el canal de streamings. Para resumirtelo, significa &quot;sarcasmo&quot;. Pod&eacute;s usarlo como, &quot;que bueno que sos usando a nidalee . . . kappa.&quot;  O algo menos ofensivo.\n\n**_main_** - Ser&iacute;a algo como, dominio de algo. Es cuando tienes experiencia en cierta l&iacute;nea (top, mid, jg, adc, supp) o con cierto champ. Llevas jug&aacute;ndolo muchas horas, pero muuuuuuchas horas, y conoces bastante bien su da&ntilde;o, y la mejor manera de usarlo. Por eso oir&aacute;s decir &quot;maineo a yasuo, esta partida es gg izi&quot; jaja. Na broma, se usa para indicar que conoces bien un champ.\n\n**_op_** - Literalmente &quot;over power&quot; que algo est&aacute; roto o est&aacute; muuy fuerte. \n\n**_lol_** - No amiguito mio, no significa League of legends . .  bueno a veces si. Significa &quot;Lots of laughs&quot; partirse de la risa. Otras variaciones son &quot;lul&quot; o tambi&eacute;n la carita &quot;XD&quot;.\n\n**_Throwear_** - Viene de &quot;throw&quot; lanzarse. Es como cuando ten&eacute;s un yasuo feedeado o muy noob que se cree Gok&uacute; y se lanza solo contra 5. Qu&eacute; pasa con &eacute;l luego de eso lo dejaremos para un v&iacute;deo de Brazzers . . . (si no entendiste el chiste, significa que no tienes la mente como yo jaja)\nMe han pasado el dato que se usa para cuando tirás la partida, vas con mucha ventaja en tu equipo y una mala jugada o TF puede tirar (throwear) la partida\n**_Feed_** - Este concepto suelen decir que es cuando llevas muchas kills. Pero es m&aacute;s complejo que eso, es b&aacute;sicamente llegar antes a tener m&aacute;s oro, m&aacute;s objetos y por ende m&aacute;s poder en fases tempranas del juego. Pero les dejar&eacute; un v&iacute;deo para que realmente entiendan el concepto, ya que es bastante complicadete\n\nhttps://www.youtube.com/watch?v=Q3551-9Tv44\n\n\n**_Push_** - Ser&iacute;a empujar. Se refiere a las l&iacute;neas y los minions. La idea de pushear va intimamente relacionada con tirar torretas y as&iacute; avanzar hacia el nexo enemigo. Hay 3 conceptos que se ramifican de este t&eacute;rmino son: Split push, Slow push, y freeze o frizar.\nPara que se entienda, pues es un arte largo de explicar les dejo otro v&iacute;deo de esta youtuber.\n\nhttps://www.youtube.com/watch?v=BMQXRzDnvXg&amp;t=9s\n\n**_zonear_** - es evitar que el enemigo se acerque a los minions a farmear. Se hace poniendose entre tus minions y el enemigo y solo se debe hacer si eres más fuerte que el enemigo y si tienes wardeada la zona para evitar que te gankeen. También se usa para alejar a un pj de una pelea. Ejemplo sos {{champion:86}}  y te vas contra {{champion:51}} {{champion:432}}  para alejarlos de la Team fight. O también para alejar a los enemigos de alguna zona como barón o drake.\n\n**_lasthitear_** - sería como farmear, das el último golpe a los minions para obtener oro.\n\n**_TF_** - Team fight, traducido pelea de equipo. No creo que requiera mucha más explicación xD.\n\n**_baitear_** - Sería cuando haces de carnada para que el enemigo se confíe o lo puedas tentar a venir a una emboscada, bukakke o trampa.\n\n**_divear_** Literalmente bucear. Es cuando te mentes bajo la torre enemiga para atacar a pesar del daño que esta te produzca. \n\n**_tiltear_** - es un concepto difícil ya que no lo tengo muy claro, pero es algo como tener una mala partida o tener un mal momento en la partida. Es algo como frustración, una serie de jugadas que te salen mal y los otros sacan ventaja, hace que te frustres, te tiltees.  También parece indicar que es cuando tienes una mala partida y te vuelves flammer o tóxico. Se puede relacionar con elohell cuando llevás mucho tilteado.\n\n**_MMR_** - Match Making RatingEl MMR es directamente reflejado en los LP que ganamos y perdemos. Estos funcionan en un sistema de puntuacion que consisten en 40 puntos por juego, y esos puntos (sean ganados o perdidos) van a ser distribuidos/removidos en cada juego respectivamente a como se compara tu MMR comparado a el MMR de el resto de tu equipo (luego se explica mas a fondo). Así que en si el MMR es reflejado en como el sistema estima un valor numérico de tus habilidades (todo a un nivel matemático). \nEs lo que determina tu valor como jugador. Recuerda que lo que le importa a este sistema de puntos es las victorias, y la racha de victorias, no tu desempeño dentro del juego como tener buen KDA. Aunque tener buen KDA ayuda a ganar más partidas ergo mejorar tu MMR\n\n**_ELO_** Este es un tema de lo más complicadete. Básicamente está relacionado con el MMR, define la liga en la que estás por el sistema de puntos. Por ahí he leído en foros antiguos que el \"elo\" como tal ya no existe, solo se usa el sistema de puntos MMR. Un sistema parecido al cuadro de abajo\n\n>1150 – Bronce I\n1200 – Plata V\n1250 – Plata IV\n1300 – Plata III\n1350 – Plata II\n1400 – Plata 1\n1450 – Oro V\n1500 – Oro IV<\n \n**_EloHell_** - Aunque no creas está muy relacionado con el tilteo. Es cuando el margen de frustración es muy alto, y estás estancado en cierta liga o cierto \"elo\". No ganas partidas o no puedes mejorar de alguna manera como gamer. Salir de elo hell es un tema de lo más interesante pero lo trataré en otro momento :D\n\n\n**harassing** - Hostigar al enemigo, aprovechar la ventaja de tu campeón por sobre el laner rival, impidiendole farmear o pokeandolo.\n\n**poke** - Abuso de habilidades continuas para dañar al enemigo y dificultarle la línea, tratando de recibir el menor daño posible.\n\n**ty** - Thank you, es decir Gracias\n\n**mia **- Missed in action, por su traducción Perdido en acción; refiere a que se perdió rastro de determinado enemigo, no se lo ve en el mapa.\n\n**Leash** Protección, lo veo más que nada a los jungleros cuando empiezan que los ayudan. Lo llaman Leash, creo que también se aplica a la hora de cuidar a los carrys de la partida.\n\nEstos son los que recuerdo, si hay m&aacute;s, o crees que he traducido mal por favor h&aacute;zmelo saber. Hay expresiones que a&uacute;n desconozco y que seguir&aacute;n saliendo. Seguir&eacute; editando el post asi vamos agregando palabras. Por cierto gracias a los que contribuyen con palabras para hacer más completo el post :D\n\nPor cierto seguramente hay un glosario ya en el foro, pero no lo supe encontrar, y no creo que est&eacute;n todas las palabras que cito aqu&iacute; arriba. Espero poder ayudar a la comunidad.\n\nFelices Pesadillas {{sticker:slayer-jinx-catface}}","replies":[{"poster":"Mugman Rojo","date":"2017-01-11T16:11:12.498+0000","up_votes":9,"down_votes":0,"body":"yo pensaba que wp era wena partida :v","replies":[{"poster":"CoronavirusC0V","date":"2017-01-11T17:22:16.840+0000","up_votes":2,"down_votes":0,"body":"misma intencion, distintas palabras xD","replies":[]}]},{"poster":"resnov15","date":"2017-01-11T15:13:15.501+0000","up_votes":1,"down_votes":0,"body":"sonear era pegarle al dragon o el baron e irse?","replies":[{"poster":"Turing Test","date":"2017-01-11T15:48:38.681+0000","up_votes":6,"down_votes":0,"body":"> [{quoted}](name=resnov15,realm=LAS,application-id=njUm58At,discussion-id=2zyXPlFR,comment-id=0000,timestamp=2017-01-11T15:13:15.501+0000)\n>\n> sonear era pegarle al dragon o el baron e irse?\n\n{{champion:37}}","replies":[{"poster":"resnov15","date":"2017-01-11T16:02:00.221+0000","up_votes":1,"down_votes":0,"body":"Sona Sona http://dxnews.com/upload/Image/Papua-New-Guinea_P29LL.jpg","replies":[]}]},{"poster":"CoronavirusC0V","date":"2017-01-11T15:18:58.762+0000","up_votes":2,"down_votes":0,"body":"tambien denegar farm al enemigo, le zoneas la linea cuando tenes ventaja","replies":[]},{"poster":"Kyo Hatori","date":"2017-01-11T15:15:56.931+0000","up_votes":1,"down_votes":0,"body":"me mataste, ya lo averiguo y lo agrego. Thanks :D","replies":[{"poster":"CoronavirusC0V","date":"2017-01-11T15:43:17.105+0000","up_votes":1,"down_votes":0,"body":"{{sticker:slayer-pantheon-thumbs}}  perfecta definicion","replies":[{"poster":"Kyo Hatori","date":"2017-01-11T15:45:12.459+0000","up_votes":2,"down_votes":1,"body":"(^-^)b","replies":[]}]}]}]},{"poster":"Hi im Eleven","date":"2017-01-11T22:02:24.142+0000","up_votes":4,"down_votes":0,"body":"Terminos que seguramente conoces:\n\n-Manco: El loco te dice que no sabes jugar.\n-Sacowea: El chileno te insulta (creo (? ).\n- ¿Que tai haciendo aweonao?: Te pregunta que haces, ya que sos malisimo\n-Pt: Es igual al manco, solo que mas argentino.\n-GG Report x campeon: Aca es cuando sos malisimo, troleas o flameas, te piden report.\n- Me voy afk, dan asco: El pibe se quiere ir porque son malisimos todos.\n- Troleo: El demente quiere feedear e irse afk, ya sea porque perdio linea o le robaron farm.","replies":[]},{"poster":"ELmagohoscuro","date":"2017-01-11T19:00:36.385+0000","up_votes":4,"down_votes":0,"body":"Me da risa que post tan buenos e informativos como estos tengan tan pocos positivos, en vez si pones: \"Nerf al roto de Yasuo pls\" o \"+1 para que que vuelva reclutamiento normal\" te llueven los positivos.","replies":[{"poster":"Kyo Hatori","date":"2017-01-11T21:49:29.039+0000","up_votes":1,"down_votes":0,"body":"es verdad jaja. Estúpido y sensual yasuo {{champion:157}}","replies":[]}]},{"poster":"Andrés Calamaro","date":"2017-02-01T03:23:43.017+0000","up_votes":2,"down_votes":0,"body":"Muy buen post! \n\nzonear - Se utiliza para refenciar el control de una zona. Por ejemplo, zonear dragón, es acercarse y tomar control indirecto del área, acechar, colocar wards.\n\nharassing - Hostigar al enemigo, aprovechar la ventaja de tu campeón por sobre el laner rival, impidiendole farmear o pokeandolo.\n\npoke - Abuso de habilidades continuas para dañar al enemigo y dificultarle la línea, tratando de recibir el menor daño posible.\n\nty - Thank you, es decir Gracias\n\nmia - Missed in action, por su traducción Perdido en acción; refiere a que se perdió rastro de determinado enemigo, no se lo ve en el mapa.","replies":[{"poster":"Kyo Hatori","date":"2017-02-01T15:06:54.451+0000","up_votes":2,"down_votes":0,"body":"Buenisimooo! ahora lo agrego. Gracias por tu comentario :D","replies":[{"poster":"Andrés Calamaro","date":"2017-02-02T00:19:49.609+0000","up_votes":2,"down_votes":0,"body":"Por nada, muy útil tu post entre tanta basura, a las órdenes!","replies":[]}]}]},{"poster":"Hell Darking","date":"2017-01-11T15:59:11.014+0000","up_votes":2,"down_votes":0,"body":"kappa nacio por los speedruners de twitch\n\"que buena, te pasaste mario en 33:13:98 pero te saltaste la etapa bonus... kappa\"","replies":[]},{"poster":"Thails SirYordle","date":"2017-01-11T16:04:09.028+0000","up_votes":2,"down_votes":1,"body":"Buen post lince","replies":[]},{"poster":"Excorpion","date":"2017-01-11T15:36:07.487+0000","up_votes":2,"down_votes":1,"body":"> wp - Significa \"well player\"\n\nWell Played*","replies":[{"poster":"Kyo Hatori","date":"2017-01-11T15:38:53.770+0000","up_votes":1,"down_votes":0,"body":"Arreglado, thanks :D","replies":[{"poster":"Excorpion","date":"2017-01-11T16:00:15.716+0000","up_votes":2,"down_votes":1,"body":"{{sticker:slayer-jinx-catface}}","replies":[]}]}]},{"poster":"Kokoro Chacarero","date":"2018-02-25T02:49:46.075+0000","up_votes":1,"down_votes":0,"body":"Buena idea la de la publicación. Sin embargo me encuentro con que a varios términos no se les da el significado original, sino que se explican de acuerdo al uso ERRÓNEO que le dan acá en LAS. Como cuando ven a alguien morir 3 veces y automáticamente es un \"Troll\".\n\n**Trinket** - Baratija (tu slot nº 4).\n\n**Sweep/Sweepear** - Limpiar visión con el trinket rojo.\n\n**Focus** - En una situación en la que hay varios objetivos EN RANGO, concentrar el daño en el objetivo de mayor prioridad, o el que represente una mayor amenaza para tu carry.\n\n**Ez/izi** - Ayuda! Tengo complejo de micropene y serios problemas de autoestima!\n\n**OP** - OverPowered, un elemento del juego que está muy por delante del resto en caunto a poder.\n\n**Main** - Tu rol/campeón principal. Sólo se tiene un main.\n\n**lol** - _laughing out loud_\n\n**Throw** - Viene de \"arrojar\" la ventaja por la ventana en inglés. El término es autoexplicatorio, hiciste una jugada estúpida, ambiociosa e innecesariamente arriesgada y tiraste por el caño tu ventaja/partida.\n\n**Feed** - Alimentar en inglés. Significa hacer a un/los enemigo/s significativamente más poderoso/s que el resto de los jugadores mediante muertes reiteradas. Puede ser intencional ó no.\n\n**Fed** - Participio de feed, traducido forzosamente como \"alimentado\". Un campeón que se encuentra por delante de la curva de poder de la partida en términos de nivel y oro.\n\n**Push** - Le agregaría que las oleadas de minion te dan cierto control sobre el mapa, en el sentido de que el enemigo siempre va a tender a ir a limpiarlas, de lo contrario pierde oro y xp, además de salud de sus torretas y visión. Es importante usar la presión generada por un push para ayudarte en al toma de un objetivo, pues pones al rival en una situacion loose/loose, donde tiene que optar por perder una cosa o la otra.\n\n**Leash** - Ayudar con daño a alguien a hacer un campamento de la jungla. Lo que mencionas despues es \"peel\".\n\n**Disjointear** - Desligar. Se usa para señalar que intercambias el aggro de una torre con otra entidad con alguna habilidad. También se puede disjointear CC y daño.\n\n**Pull** - Sinchar. Término proveniente de los MMORPG. Puede referirse a provocar algun creep para que te ataque. Tambien se usa para indicar que saques al dragon del dragon pit.","replies":[]},{"poster":"WilfreCheesemice","date":"2017-01-23T18:41:16.838+0000","up_votes":1,"down_votes":0,"body":"El elo ya no existe, es el mmr, pero se usa igual. es decir; el elo, es como jugas, y eso hace que te emparejen con gente como vos. a un bronce no lo van a poner con diamantes. pero elo también se le dice a lo que vos explicaste.","replies":[{"poster":"Kyo Hatori","date":"2017-01-24T01:30:52.687+0000","up_votes":1,"down_votes":0,"body":"He estado averiguando y es cierto eso que dices. Aunque quedó como jerga de comunidad el término de elo. \nGracias por tu comentario :D","replies":[]}]},{"poster":"Trasero Epitelio","date":"2017-01-13T19:09:25.763+0000","up_votes":1,"down_votes":0,"body":"Hg Fl","replies":[]},{"poster":"DarkLuny","date":"2017-01-12T13:54:32.278+0000","up_votes":1,"down_votes":0,"body":"Como odio los tipos dicen izi :(","replies":[{"poster":"Kyo Hatori","date":"2017-01-13T01:26:49.736+0000","up_votes":1,"down_votes":0,"body":"yo igual xD","replies":[]}]},{"poster":"F de Flan","date":"2017-01-11T21:06:58.355+0000","up_votes":1,"down_votes":0,"body":"Excelente post amigo. Como aporte whort; el contexto sería costo<beneficio ej. en algun trade o intercambio por ejemplo llevarte una doble en un 2 x 1, intercambiar una muerte aliada por una torre o un drake, torre por baron, etc. Espero se entienda.\nThrow: más que lanzar seria tirar la partida. Se aplica por ej. Un team que tiene una gran ventaja y con alguna jugada o tf vende la partida. Lo contrario sera un come back. Que es cuando un champ o el team se recupera y vuelve a la partida.\nPor ultimo, tilt; yo lo explicaria como \"frustrado\" estar tilteado es cuando no te sale nada en pa partida. Mayormente a causa de alguna jugada del rival, campeo o Yasuo. Uno queda tilt y empieza a errar last hits. Morir y morir. Como ejemplo seria cuando algun futbolista anda en mala racha y no puede encontrarse con el gol (?\nLa razon de estos términos es una comunicación más rápida ya que se abrebia lo máximo posible.\nK se usa para decir 'ok' aunque muchos de los que les digo creen que es \"Qué\" -.-\" \nPd: si no esta muy claro es porque lo escribo desde el cel y me da perecita reescribir\nSlds!","replies":[{"poster":"Kyo Hatori","date":"2017-01-11T21:49:01.397+0000","up_votes":1,"down_votes":0,"body":"Gracias por los datos, ya los agregué. Buena contribución :3","replies":[]}]},{"poster":"Kyousuke","date":"2017-01-11T15:51:41.328+0000","up_votes":1,"down_votes":0,"body":"errores \n1. zonear no solo es evitar que farmee o denegar exp sino también alejar al enemigo de una determinada zona ya sea dragon, baron o algún buff ya que tu equipo lo esta haciendo o debes evitar que lleguen a ese punto, también se le dice zonear a alejar a un pj de una pelea, ejemplo sos un {{champion:86}} en una tf y vas por {{champion:51}}  que esta con {{champion:432}} entonces te vas solo contra esos 2 y los \"zoneas\" para que no hagan nada en la tf \n2.brb se usa para indicar que regresa a base y ya vuelve, ejemplo estas en bot y tenes baja vida decís brb para que tu compañero juegue pasivo y te espere ya que tenes que ir a comprar o curarte","replies":[{"poster":"Kyo Hatori","date":"2017-01-11T16:28:09.652+0000","up_votes":1,"down_votes":0,"body":"Corregido, gracias por tu comentario :D","replies":[]}]},{"poster":"Rebkans","date":"2017-01-11T15:54:17.613+0000","up_votes":1,"down_votes":0,"body":"El **brb** tambien es usado para avisarle a alguien que vas a volver a la base. Principalmente ocurre  en la linea de bot cuando alguno de los dos se  tiene que ir para curarse o comprar algo en la tienda.","replies":[]},{"poster":"Shirotani","date":"2017-01-11T15:51:35.801+0000","up_votes":1,"down_votes":0,"body":"WP significa \"well playe**d**\"","replies":[]}]}