{"poster":"GammelFighter","date":"2015-04-06T01:23:23.292+0000","title":"Wie Carry ich in Platin?","subforum":"Spielerverhalten & Moderation","up_votes":4,"down_votes":3,"body":"Hallo, ich brauche dringend Hilfe, ich bin momentan geranked in Platinum V, bin eigentlich main adc, aber spiele im Moment das was mein Team braucht. Ich versuche jedes Spiel (ranked) zu gewinnen, weil ich hab mir dieses Jahr das Ziel Diamond gesetzt.\r\n\r\nIch fange mal an, ich habe vor ca. 7 Tagen recht viel SoloQ gespielt, bin von Platinum V auf Platinum IV gekommen und dort bis Platinum IV ~85 LP gekommen, dann habe ich begonnen ein Game nach dem anderen zu verlieren. Und ich habe keine Ahnung warum, ich bin der Meinung das ich mich nicht verschlechtert habe, ich habe zuletzt aus 10 Games (3 Wins/7 Loses) 8 Mal meine Lane gewonnen, wir haben trotzdem durch misspositionings die entscheidenden Teamfights trotzdem verloren. Nachdem ich dann sehr viele Spiele verloren habe, habe ich versucht mich mehr meinem Team anzupassen: bspw. bin ich nicht immer adc gegangen sondern habe geschaut was mein Team braucht. Ich habe dann versucht jedes Mal wenn ich auf der Lane vorne war andere Lanes die nicht so gut aussahen zu ganken und durch ein paar Kills ins Snowboalen zu bringen. \r\n\r\nBspw. Als mid-Laner versuche ich meine Lane unter den Turret zu pushen und dann die Top/Bot Lane zu ganken.\r\n           Als top-Laner versuche ich jedes Mal wenn ich TP Up habe und auf der Bot Lane ein 2v2 (Supp + ADC gegen Supp + ADC) engaged wird direkt dort mit dem TP zu ganken. \r\n           Als ADC versuche ich wenn meine Lane enemies gerade back gegangen sind mit meinem Support die Mid Lane ganken zu lassen oder ich schreibe meinem Support er soll auf die Mid Lane roamen und versuchen dort mit dem Jungler oder alleine durch einen Kill eventuell den Tower zu pushen.\r\n\r\nWenn Bspw. meine Top Lane gerade haushoch verliert, wie soll ich dann verfahren, ich hatte ein Spiel wo ich die Top Lane, die schon 0/6 oder so stand versucht diese zu ganken, trotz des 1v2 f&uuml;r den Gegner hat dieser dann trotzdem durch schon mehrere komplette Items einen von uns mitgenommen. Soll ich die Top Lane dann lieber in Ruhe lassen, sprich wenn sie schon 0/2 steht und versuchen auf die Bot Lane zu rotieren? Und wie stelle ich am besten die Ganks auf die Bot Lane an, meistens habe ich bemerkt das bei mir nur Lane Ganks &ouml;fters Erfolg haben. Wenn ich von der Mid aus komme dann ziehen sich die Gegner meist schon auf der H&auml;lfte zur&uuml;ck und ich habe Erfahrung und Last Hits auf der mid Lane verpasst und falle wieder auf meiner Lane zur&uuml;ck.\r\n\r\nWie kriege ich das Beispielsweise hin, das mein Team auf meine Calls h&ouml;rt? Ich wei&szlig; das klinkt ein bisschen so als wenn ich sage meine Teammates k&ouml;nnen nichts, aber wenn wir Beispielsweise 5v5 sind und dann die Gegner zu 5. auf den Drachen gehen und wir nur einen auf der Mid Lane den Gegnern zu sehen geben und der Baron von uns durch ein Pink Ward gewarded ist und ich dann instand schreibe &quot;Baron&quot; und Baron Pinge, wieso wird dann nicht auf mich geh&ouml;rt? Wir sind schlussendlich in den Dragon Fight reingegangen und haben diesen 1:3 verloren und die Gegner haben sich den Baron gepickt (Ich habe vorher nachgegeben und bin zu meinem Team gesto&szlig;en). Ich habe bemerkt das ich erst komplett gefeeded sein muss, damit mein Team auf meine Calls h&ouml;rt. Ich meine verbessert mich bitte wenn ich falsch liege, aber der Baron w&auml;re doch die bessere Variante gewesen, oder? \r\n\r\nIch will momentan stetig an mir arbeiten um ein besserer LoL Spieler zu werden und mein diesj&auml;hriges Ziel Diamond zu erreichen, habe jedoch gemerkt, wenn ich Normals spiele gewinne ich diese meist locker und einfach ohne wirkliche gegenwehr meiner Gegner und kann diese dann Carrien, mein Problem ist aber dann, dass ich dies nicht aufs ranked &uuml;bertragen kann und dort dann auch mein Team carrien kann. Liegt es daran, dass ich zu oft mit meinem Freund gespielt habe, der selbst &quot;nur&quot; Silber ist? \r\n\r\n\r\nIch nehme jetzt mal noch ein recht frisches Beispiel &uuml;ber ein Spiel was ich Tryhard versucht habe zu gewinnen um wieder in die Promos zu Platinum IV zu kommen:  http://matchhistory.euw.leagueoflegends.com/en/#match-details/EUW1/2052799379/38251225?tab=overview\r\n\r\nIch nenne dieses Spiel NUR als Beispiel und m&ouml;chte nicht sagen, dass ich alles was meine Teammates aus meiner Sicht falsch gemacht haben richtig gemacht h&auml;tte:\r\n\r\nWir hatten eine Premade Bot Lane die mich gebeten hatte kein ADC zu picken, weil sie gerne zusammen Bot Lane wollten. Wir hatten einen Jax gegen Wukong Top Lane, Mich als Ahri gegen einen Ziggs in der Mid Lane, Thresh + Vayne gegen Caitlyn + Blitzcrank auf der Bot Lane und Rek&acute;Sai gegen Volibear im Jungle. Ich habe am Anfang Safe auf meiner Mid Lane gegen Ziggs gespielt und versucht jeden Farm zu picken und habe dann mit Level 7 angefangen zu roamen, da ich wusste das ein Ziggs nicht das Roaming Potenzial hat wie eine Ahri. Ich habe mir die Top Lane ausgesucht, weil diese viele Probleme mit seinem Gegner hatte durch 3 early Ganks von dem gegnerischen Jungler. Ich habe die Top Lane 3 Mal gegankt und jedes Mal ist ein Kill f&uuml;r mich rausgesprungen. Ich habe jedes Mal den gegner all-ined und alles auf ihn benutzt nur um diesen down zu kriegen und habe nicht darauf geachtet, dass der Jax die Kills kriegt. Meine Bot Lane hat trotz mehrfacher Ganks von unserem Jungler trotzdem die Lane mit gro&szlig;em Abstand Verloren.  Weil sich die Vayne oder der Thresh vom Blitzcrank hooken haben lassen und sie dann gestorben sind. Wir konnten so oft den Drake nicht fighten, weil bei uns jedesmal einer oder mehr Leute tot waren oder gerade zu weit weg vom Geschehen. Wir haben dann schlussendlich 3 oder 4 Drakes an die Gegner verloren. Erst dann haben wir angefangen die Drakes zu fighten und direkt 2 gekriegt. Als die Gegner gerade daran waren den 3. oder 4. Drake zu machen habe ich wieder geschrieben, dass wir wenn die Gegner den Drake anfangen wir uns den Baron holen. Das w&auml;re auch so weit gut gegangen, wenn nicht unser Thresh Solo gecatched wurden w&auml;re und gestorben w&auml;re. Schlussendlich hat sich das Team dann dazu entschieden weder den Baron noch den Dragon zu fighten. Wie kriege ich das hin, dass diese Solo Catch Ups nicht stattfinden? Ich meine, eigentlich finde ich, dass man voraussetzen kann, dass man in der high Gold/low Platinum Elo wei&szlig; das man alleine, wenn das Team weit weg ist keinen Busch facechecken sollte/kann. Wie kriege ich das hin, dass wenn meine Teammates sich nicht frei von einem Blitzcrank grabben lassen wenn dieser durch Pings vorher gespottet wurde? Wir waren dort auf der Bot Lane als der Baron Buff der Gegner gerade auslief und diesen den Tier 2 Turret versucht haben zu pushen der Blitz hat sich in den Busch bei den Golems gestellt und unser Thresh ist dann zu weit nach vorne gegangen und hat sich in 4 Leute hooken lassen. Wie vermeide ich solche missplays? \r\n\r\nAls das dann das 2.  oder 3. Mal passiert ist (nicht das gleiche Szenario aber &auml;hnliches) und wir geaced wurden und die Gegner den finalen Push auf unseren Nexus anfingen habe ich dann angefangen zu flamen (--&gt; Thresh hat gg geschrieben und ich habe darauf geantwortet: &quot;u did it GG&quot;), ich m&ouml;chte dazu sagen, dass das die erste Aktion in dem Spiel war wo ich geflamt habe, weil ich einfach echt sauer war, dass dieser Thresh erst auf der Bot Lane die Caitlyn gefeeded hat und dann sich darauf in den Teamfights einfach free hooken lassen hat und wir deshalb dann die Teamfights verloren hatten, klar ich wei&szlig; das jeder mal ein schlechtes Spiel hat usw. Meine frage ist da einfach; habt ihr irgendwelche Tricks wie ihr da ruhig bleibt? Ich wei&szlig; ich bin ein emotionaler Spieler, aber versuche das dann in solchen Situationen zur&uuml;ckzuhalten, nur es klappt halt nicht immer, wie man daran sehr gut sieht.\r\n\r\n\r\nIch w&auml;re sehr daran Interessiert, wenn mich vielleicht ein Diamond Spieler ein wenig &quot;coachen&quot; k&ouml;nnte und mir helfen k&ouml;nnte meine Fehler aufzudecken und diese zu vermeiden. Da meist einige sagen das die Leute die unter 18 sind zu jung f&uuml;r so ein coaching sind m&ouml;chte ich dazu sagen, dass ich erst 16 bin.\r\n\r\nMit Freundlichen Gr&uuml;&szlig;en\r\nGammelFighter","replies":[{"poster":"Phobos Selini","date":"2015-05-01T11:49:35.893+0000","up_votes":3,"down_votes":0,"body":"Ranked MMR != Normal MMR. Gerade wenn man mit Freunden spielt, die eine deutlich andere MMR haben wird das Matchmaking für das einzelne Spiel aber auch die MMR Entwicklung insgesamt verzerrt.\n\nEs kann ja sein, dass Du tatsächlich in der Laningphase ganz ordentlich bist. Aber dann sollte bei häufigen Niederlagen die Schlussfolgerung doch auf der Hand liegen: In den anderen Spielphasen bist du es nicht.\n\nEasyWin Katarina hat schon Recht wenn er Dich als typischen Elohell Verschwörer tituliert, denn Du beschreibst Dich selber eigentlich nur als guten ambitionierten Spieler, der nur ein paar Tipps braucht um das Spiel quasi 1vs5 zu carrien. Die Fehler machen nur die anderen. Das haben wir schon so oft im Forum gelesen.\nDas einzige was Dich besser machen kann, ist Deine eigenen Fehler zu analysieren und an Dir zu arbeiten. Solocatches siehst du übrigens auch noch im Challenger Stream.\n\nDann ist es auch noch die völlig falsche Einstellung einfach so zu behaupten Diamond werden zu wollen. Hast Du irgendeine Grundlage, die eine solche Einschätzung rechtfertigt? Wenn ein Bundesligaverein das Saisonziel ausgibt auf einem Championsleague-Platz zu landen, dann ziehen die Verantwortlichen meist vergangene Ergebnisse und gut fundierte Prognosen aufgrund des Kaders zu rate. Ein Verein mit diesem Ziel wird vorher mindestens schon um die EL mitgespielt haben.\nDu hingegen warst letzte Season Gold und willst auf einmal zwei Ligen steigen. Das ist sicherlich möglich für manchen, aber eben auch nicht einfach nur eine Sache von einer gewissen Zeitinvestition und der bloßen Absicht.\nSetz Dir lieber das Ziel einfach besser zu werden! Der Aufstieg kommt dann ganz nebenbei als Bonus.","replies":[{"poster":"GammelFighter","date":"2015-05-01T22:52:07.777+0000","up_votes":1,"down_votes":0,"body":"Ja ich spiele wirklich nicht schlecht auf der Lane, aber wie schon gefühlt 10 mal erwähnt möchte ich an mir arbeiten, damit ich diese Fehler halt nicht mache und wieso ich dann die Spiele verliere trotz einer gewonnenen Lane. Das Ziel Diamond diese Season habe ich sowieso schon gestrichen, wegen Schule undso und fehlender Motivation zu LoL.","replies":[]}]},{"poster":"MahouShoujoRakka","date":"2015-04-09T17:04:18.091+0000","up_votes":3,"down_votes":0,"body":"Besorg dir mal eine andere Begrifflichkeit.\nWenn du in 8 von 10 Spielen die Lane tatsächlich gewinnst, solltest du locker 6 oder 7 davon nach Hause bringen können. Mit einer wirklich gewonnen Lane kannst du das Spiel nämlich komplett diktieren. Und wenn du es dann immer noch throwst, ist es halt auch dein Fehler.","replies":[]},{"poster":"EasyWIN Katarina","date":"2015-05-02T09:57:02.866+0000","up_votes":2,"down_votes":0,"body":"Ok, ich sag mal so, dass es als ADC besonders schwer ist kann ich mir lebhaft vorstellen und den scheinst du ja zu mainen. \nIch bin vermutlich der schlechteste ADC der Welt, kenne aber das Phänomen gerade auf der Botlane, ich fange gut an und es endet dann damit, \ndas irgend ein Rengar, Vi, Shaco oder sonstwas ins Gesicht springt und nach einem 2:0 mit vielleicht 20-30 cs Vorsprung endet das Spiel auf zauberhafte weise \nmit einem 2:12.. Und ich frage mich immer wieder, wie man diese Klasse überhaupt spielen kann. \n\nWobei mit Duo-Q + Skype sieht die Sache wohl wesentlich besser aus. Vielleicht solltest du dir einen Plat-Support als festen Mate besorgen. Weil: du spielst vermutlich jedes zweite oder dritte Game gegen ein Duo-Q Team auf der Botlane, dass der Gegner ADC da am Ende besser abschneidet ist fast vorprogrammiert, da er vermutlich via Skype mit seinem Mate koordiniert spielt. Das dürftest du spätestens im Teamfight merken, wenn der Gegnersupport perfekt auf seinen ADC abgestimmt ist, während deiner irgendwo rumhampelt, weil er nicht weiß was du gerade vorhast.","replies":[]},{"poster":"BadabingBadaboom","date":"2015-04-09T14:57:27.503+0000","up_votes":3,"down_votes":1,"body":"Spiel einfach wie challenger, dann schaffst du es easy aus platin.","replies":[]},{"poster":"Meme Liker","date":"2015-04-06T06:22:36.112+0000","up_votes":3,"down_votes":1,"body":"Ich hab mir das zwar nicht durchgelesen aber spiel einfach immer deine Lane und deinen Champ.","replies":[]},{"poster":"EasyWIN Katarina","date":"2015-04-24T15:23:13.681+0000","up_votes":2,"down_votes":1,"body":"\" Und ich habe keine Ahnung warum, ich bin der Meinung das ich mich nicht verschlechtert habe, ich habe zuletzt aus 10 Games (3 Wins/7 Loses) 8 Mal meine Lane gewonnen, wir haben trotzdem durch misspositionings die entscheidenden Teamfights trotzdem verloren. \"\n\nhttp://euw.op.gg/summoner/userName=GammelFighter \n\nSorry TE, aber du behauptest, 8 der  10 Games hättest du deine Lane gewonnen. Du hattest allein in den letzten 4 Rankeds \n3 mal eine KDA von 1 oder sogar 0. Sorry, das habe ich nicht nicht weiter durchgelesen. Ein klassischer Fall von \"Dunning Kruger\". \n\nBeispiel, dein Graves Game: du hast 3-7-6, bei 176 cs und dein Gegner Jinx hat 14 / 3 / 6 und 234 cs und eine KDA von fast 7! \n\nSorry, aber \"ich gewinne 8 von 10 Games meine Lane\" sieht anders aus! Lane gewinnen heißt nicht \"ich werde zerhauen.\", sondern \"ich zerhaue!\" !\n\nÜber deinen 0-2-0 Vladimir will ich mich erst gar nicht äußern... ich frage mich, wie ein Platinspieler der das Prinzip verstanden haben müsste hier auf die Idee kommen kann zu fragen, warum er nicht weiterkommt! \n\nBei einem Bronzespieler würde mich das ja nicht wundern, aber auf Platin sollte man doch eigentlich wissen,  wann man besiegt wurde...","replies":[{"poster":"GammelFighter","date":"2015-04-25T18:22:36.966+0000","up_votes":0,"down_votes":2,"body":"Ich finde es toll wie du darüber urteilen kannst ohne bei den Spielen selbst dabei zu sein, ich gebe dir nur mal so einen Tipp es gibt sowas das nennt sich TFs und da kann der gegnerische adc dann recht viele Kills kriegen ;-) und seine KDA pushen aber ich weiß sowas lernt man nicht so schnell ;-) wenn du demnächst mal bei einem von meinen Games zugeschaut hast dann kannst du bitte wieder deinen Mund öffnen danke :*","replies":[{"poster":"EasyWIN Katarina","date":"2015-04-26T14:52:10.989+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=GammelFighter,realm=EUW,application-id=KYnfKGf0,discussion-id=AxGmkUU5,comment-id=00090000,timestamp=2015-04-25T18:22:36.966+0000)\n>\n> Ich finde es toll wie du darüber urteilen kannst ohne bei den Spielen selbst dabei zu sein, ich gebe dir nur mal so einen Tipp es gibt sowas das nennt sich TFs und da kann der gegnerische adc dann recht viele Kills kriegen ;-) und seine KDA pushen aber ich weiß sowas lernt man nicht so schnell ;-) wenn du demnächst mal bei einem von meinen Games zugeschaut hast dann kannst du bitte wieder deinen Mund öffnen danke :*\n\nIch brauch mir deine Spiele nicht anzugucken, denn ich weiß schon worauf du hinaus willst: Du bekommst immer die schlechten Mates, stimmts?\n\nIch könnte jetzt damit anfangen, dass du die einzige Konstante bist und die warscheinlichkeit, einen schlechten Mate zu bekommen in deinem Team nur 4 ist und im anderen 5 aber lassen wir es. :)\n\nSo lange du nicht einsehen willst, dass DU der EINZIGE bist der DEIN Elo vergeigt oder es zum steigen bringt, so lange ist jede Diskussion mit dir Perlen vor die Säue, sorry. \n\nUnd deine argumente bringt jeder Bronze und Silberspieler auch im Forum, ich meine, wir alle lesen dieses \"ich gewinne meine Lane aber verliere wegen den Mates\" nicht zum ersten mal....\n\nEs ist dabei im Übrigen furz egal, ob du Platin, Gold, Diamant oder Challenger bist: die Formel ist immer gleich, wer besser spielt, dessen Elo steigt. Wer schlechter ist, der fällt.  Warum schaffen es denn andere und du nicht? Weil sie Glück haben? Sicher nicht. Dass ich DAS einem Platinspieler erklären  muss, ist schon bezeichnend... \n\nWas willst du hier überhaupt? Das dich alle bedauern und sagen: \"oh der arme, der spielt doch so gut, die anderen sind schuld, dass er 0-2-0 aus der Lane geht\"??\n\nIch meine ich spekuliere jetzt vielleicht nur, aber vielleicht, NUR VIELLEICHT, bist du schlicht nicht so gut wie du glaubst zu sein. *Schulterzuck*","replies":[{"poster":"GammelFighter","date":"2015-04-28T12:21:08.825+0000","up_votes":0,"down_votes":1,"body":"Ich merke es bringt nichts mit dir zu deskutieren, du denkst ich sehe mich nicht als einzige Konstante in dem System? Deswegen frage ich auch nach Tipps um mein Spiel zu verbessern. Fu** the Logic.","replies":[]}]}]}]},{"poster":"EasyWIN Katarina","date":"2015-05-01T11:49:46.167+0000","up_votes":1,"down_votes":0,"body":"Warum habe ich das nur kommen sehen, dass es in einem \"ich bin Plat und du Silber\" endet. =D\n\nIch habe nie gesagt dass ich aktuell gut spiele, aber im Gegensatz zu DIR habe ich das Prinzip verstanden, nämlich dass \nich selbst verantwortlich bin. Und NOCHMAL, in deiner Matchhistory sehe ich NIRGENDWO was von einem 3:0 aus der Lane gehen. \n\nDu feedest in JEDEM deiner letzten Rankeds HAUSHOCH! Genau wie ich übrigens, um dir gleich den Wind aus den Segeln zu nehmen, aber ICH verstehe wenigstens dass es an mir  liegt und rede mir nicht wie du bei 2:9 stats ein, dass ich die  Lane gewonnen hätte!\n\n\"Du\" (oder wer auch immer....) hast das letzte mal gut gespielt vor 23 Tagen, DA hattest \"Du\" regelmäßig eine KDA von 5, 7 oder 10! Nun hast DU plötzlich permanent eine von 0,5 oder schlechter. Ganz so, wie wenn ein Gold-5 Spieler sich auf Platin boosten lässt, der schneidet dann auch so ab. \n\nDeine äußerst plumpen Beleidigungen am Ende - da gehe ich mal nicht drauf ein... sie zeigen aber dass du ganz sicher nicht in der Platinliga spielst zumindest nicht bei deinen Manieren. Du verdienst wirklich nicht, dass dir jemand hilft. Rede dir einfach weiter ein, dass du mit 3:0 aus der Lane gehst, ich sehe in deiner Matchhistorie nur 8:9, 7:15 (mit Silber Spieler im Gegnerteam, soviel zu deinem \"in Silber carry ich\"), 4-9, 0:5, 9:14, dass sind deine letzten Games, du gewinnst ganz offensichtlich \"80% die Lane\", ROFL!\n\nUnd ich freue mich schon darauf hier schreiben zu können: \"und da war er nur noch Gold\". :)\n\n","replies":[{"poster":"GammelFighter","date":"2015-05-01T22:48:03.042+0000","up_votes":1,"down_votes":0,"body":"Die Beleidigung am Ende tut mir Leid, dass mit der Laning Phase, ob du es mir jz glaubst oder nicht stimmt wirklich, deswegen will ICH ja eben wissen, wieso ich die Spiele dann so verliere, was ICH für Fehler mache, mir ist es schon klar das es an mir liegt das ich die Fehler mache in den TFs nur ich ERKENNE diese selbst nicht und weiß nicht woran ich AN MIR arbeiten soll um besser zu werden. Wie ich hier irgendwo schon geschrieben habe, denke ich nicht das ich mich in letzter Zeit verschlechtert habe. Und normal Games solltest du bei mir außer Acht lassen, ich habe mir extra die -15% Wartezeit Runen nach dem Tod gekauft, um besser Feeden zu können *Grins* (muss man nicht verstehen)","replies":[]}]},{"poster":"EasyWIN Katarina","date":"2015-04-29T03:28:16.951+0000","up_votes":1,"down_votes":0,"body":"Nein, es bringt nichts mit DIR zu diskutieren, denn sobald man dir was anderes sagt als dass DU deine Losses verursacht hast kommt ein \"WARST DU BEI MEINEM GAME DABEI??\" - nein, war ich nicht, aber auch kein anderer hier im Forum, aber wenn du so Geschichten bringst wie \"ich gewinne 8 von 10 games meine Lane\" und man schaut in deine Matchhistorie, dann sieht man eine 4-9 jinx, gefolgt von einem 0-5-3 shen, dann ein 9-14-1 Vlad, danach ein 0-2-0 Vlad, sorry aber du spielst einfach nur klasse. Ist es das was du hören willst? Du warst vor wenigen Tagen noch bei rund 2000 lks und nun bei 1800. Du weist ja: jeder kommt wieder dahin zurück wo er hingehört..","replies":[{"poster":"GammelFighter","date":"2015-05-01T10:36:16.335+0000","up_votes":1,"down_votes":3,"body":"Diggah ohne witz was reißt du eigentlich dein maul auf. Adde mich ingame als Freund schau dir meine Spiele an DANN REDE WEITER. solche Leute wie du regen einfach auf, WAS IST DARAN VERKACKT NOCHMAL SO SCHWER zu verstehen, DASS ICH WISSEN WILL WENN ICH ALS JINX 3-0 AUS DER SCHEIß LANE RAUS GEHE AN FEHLER MACHE DAS ICH DAS SPIEL DANN NOCH VERLIERE. Du spielst was, Silver III und meinst mit reden zu können gib mir deine Account Daten in Silver ist es für mich 0 Probleme ein Spiel mit 3-0 zu carrien aber ICH WEIß NICHT WAS ICH verkackt NOCHMAL ICH ICH ICH ICH ICH im MID bzw. End Game falsch mache. Wenn du es jz noch nicht verstanden hast dann wünsche ich dir ein schönes Leben","replies":[]}]},{"poster":"FeniX x Mei","date":"2015-04-16T14:56:51.050+0000","up_votes":1,"down_votes":0,"body":"Was für mich persönlich bis dia 1 gut funktioniert hat ist z.b nur Riven zu spielen egal ob mid oder top.\nIch fühle mich mit Riven einfach viel sicherer weil ich den Champ so viel gespielt hab und einfach gegen jedes matchup weiß, was ich zutun habe und da in SOlo Q meist split push der schlüssel ist bin ich mit Riven am besten aufgehoben. \nHabe zwar nicht so viel gespielt bin aber derzeit in Diamond 3 mit 30/10 Riven und beim nächsten Ranked sucht rausch wenn ich zeit habe versuch ich es dann wieder auf Dia 1 / master.","replies":[]},{"poster":"MisterLuckyLP","date":"2015-04-07T07:39:04.153+0000","up_votes":1,"down_votes":0,"body":"Ich hab es mir bis zum Link angesehen! Ich bin selber kein großer Ranked Spieler, aber wenn deine Mitspieler oder deine Gegner dich provozieren und absichtlich feeden dan ignoriere sie einfach! Denn es bringt nichts wennn man ihnen Aufmerksamkeit schenkt, indem man beginnt zu flamen , weil das ist das was die Feeder wollen, dass man sich aufregt! Also immer Ruhig bleiben und den Mitspiler bzw. Gengner wenn er nervt zu ignorieren! LG","replies":[]},{"poster":"HeTossMySalade","date":"2015-04-06T23:28:48.557+0000","up_votes":1,"down_votes":0,"body":"Ich fühl echt mit dir. Mir geht es leider genau so wie dir. Letze Season hab ich mich inerhalb kürzester Zeit (Allein ohne DuoQ) von Bronze 5 in Gold 3 gespielt. Diese Season hab ich es schon bis Gold 1 geschaft, wo ich leide feststecke. Leider stell ich fest, dass ich nichtmehr wie den Rest der Zeit 1vs5 carrien kann als Jinx oder Riven. Viele Leute halten sich in Platin für Götter und meinen sie haben es nicht nötig serious zu spielen. Oft frag ich mich VORM PC ob manche Menschen komplett blöd sind oder es extra tun. Nichts desto trotz versuche ich meine Lanes zu bekommen und wenn das nicht klappt, spiel ich nach Möglichkeit etwas was das Team untersützt(Nautilus, Lulu,Orianna) und versuche das mein Team irgendwie zu untersützen. Leider verliere ich zur Zeit nur Rankeds und hatte zu allem überfluss noch 2x die gleichen \"Wir gehen AFK wenn unser Team mehr als 2x stirbtPremades\" im Team. Aber was solls, hab sie reported und versuchs später nochmal. Das wichtigste ist dein Ziel nicht aus den Augen zu verlieren und immer weiter zu versuchen! Wenn du merkst du wirst mad, mach ne Pause, triff dich mit Freunden und am nächsten Tag geht's weiter! HF und GL in SoloQ. (P.S. gibt noch´n kleinen Trick um nicht mad zu werden, aber den verrate ich nicht im Forum, add mich wenn du ihn wissen willst)","replies":[]},{"poster":"Kháos","date":"2015-04-06T13:09:07.870+0000","up_votes":1,"down_votes":0,"body":"und versuch nicht leute zu sachen zu bringen die sie von alleine nicht machen wenn du zb. sagst hey supp geh mid roamen und er hat keine ahnung wie er das machen soll bringt dich das als adc behind und wenn kein kill oder turret o.ä. bei rausspringt ist es einfach nur timewaste und bringt dich unnötig behind.\nAnsonsten einfach garnichts schreiben ausser villt sowas wie my bad oder sorry. mehr nicht falls dich einer flamed ignorieren oder muten.\nviel glück bei deinem Ziel.","replies":[]},{"poster":"Big Lincoln","date":"2015-04-06T09:04:57.159+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=GammelFighter,realm=EUW,application-id=KYnfKGf0,discussion-id=AxGmkUU5,comment-id=,timestamp=2015-04-06T01:23:23.292+0000)\n Meine frage ist da einfach; habt ihr irgendwelche Tricks wie ihr da ruhig bleibt?\n\nIgnorieren -> Muten -> Nach dem Spiel reporten falls nötig.\nIch weiß es ist schwer aber am besten du schreibst gar nichts drauf, auch nicht sowas wie \"Thresh muted\" falls du ihn mutest.","replies":[]},{"poster":"HHaie tabbian","date":"2015-04-06T07:36:25.184+0000","up_votes":1,"down_votes":0,"body":"Ich hab mir ungefähr die hälfte durchgelesen. Es interessiert wenig, wenn du einzelne Spiele beschreibst. Es gibt immer Spiele, die man mit seinem aktuellen Niveau nicht gewinnen kann.\nAb Platin geht es mehr als in Bronze-Gold darum, deine Rolle richtig zu spielen. Du bist zwar teilweise noch in der Lage, die Spiele alleine zu gewinnen, aber dafür brauchst du eben wesentlich bessere Mechaniken als in Bronze-Gold. Als Adc musst du z.B. darauf achten, in teamfights möglichst lange zu überleben. Es bringt dir nichts, wenn du den gegnerischen Supporter raus nimmst, und dann krepierst. Hingegen ist es als burst-apc midlaner oft schon genug, wenn du es vor deinem Tod schaffst, in teamfights deine combo rauszubringen und damit 1-2 gegnerische carrys tötest.\nSolche Dinge musst du verstehen, und wenn du es dann noch schaffst, Champions zu finden, die dir Spaß machen und auf denen zu konstant gut spielst, dann steht deinem Aufstieg eigentlich nichts mehr im Weg. Es kann natürlich trotzdem mal passieren, dass du 4-5 Spiele in Folge verlierst. Das ist eben Zufall. Wenn du 50 Mal eine Münze wirst, wird es auch vorkommen, dass du sowohl öfter Zahl als auch Blatt hintereinander bekommst. Du solltest dir nur Sorgen machen, wenn du in den Niederlagen wirklich schlecht spielst. Dann (und sonst auch) solltest du analysieren, was du falsch machst. Dafür eignet es sich oft, die Spiele aufzunehmen und dann nachher anzuschauen.","replies":[]}]}