{"poster":"ScottyMcDavern","date":"2016-04-19T03:19:05.983+0000","title":"Pre-mades = Toxicity","subforum":"Player Behaviour","up_votes":4,"down_votes":1,"body":"I get matched up with a pre-made of 3-4 players every 2-3 games. These players like to gang up on you if you make a simple mistake. Why does Riot feel that Dynamic queue is the only way to go when the League community suffers from being so toxic? Sure people can be toxic in solo queue but at least I didn&#039;t feel like I was being ganged up on every other game. You can&#039;t even report those players because it&#039;s 1 report vs 3.\r\n\r\nEnd of rant, I will now go back to being abused every game...","replies":[{"poster":"Klavinmour","date":"2016-04-19T03:41:54.213+0000","up_votes":1,"down_votes":1,"body":"It's no different to how ranked used to be, and is no different to how normals are.\nWell except in Normals if you call first a premade of 3 or 4 will threaten to report you if you don't go the position none of them want to play.\n\nDynamic queue's functionality isn't the problem, the problem is the community itself.\nAlso it doesn't matter, you can report a premade if you wish, I remember a post back sometime where I think it was Lyte saying that premades have lower importance on reports than others.","replies":[{"poster":"ScottyMcDavern","date":"2016-04-19T04:01:48.956+0000","up_votes":3,"down_votes":0,"body":"Lol, it doesn't only happen in normals. I had to go udyr support because of a premade. I'm saying it is more toxic when you're in a game with premades because they gang up on you. At least with old ranked it didn't feel like you were being ganged up on.","replies":[{"poster":"Klavinmour","date":"2016-04-19T05:09:08.102+0000","up_votes":1,"down_votes":0,"body":"If you were forced out of your Dynamic Queue position, report them.\n\nThe whole point of Dynamic Queue is that you get what you queue for. If the queue gives you Jungle you're the jungler, unless if you agree to swap with something with no pressure.\n\nPeople have already been permabanned for not accepting the rules of the system, report anyone who forces you out of your chosen position and they will be too.","replies":[]}]}]},{"poster":"Erøse","date":"2016-04-19T10:32:43.025+0000","up_votes":1,"down_votes":0,"body":"I have 1 tip for you\n\npress enter> type \"/mute all\". Now just focus on your game without seeing those negative chat","replies":[]},{"poster":"Dyl","date":"2016-04-19T22:33:50.316+0000","up_votes":1,"down_votes":1,"body":"They're fixing it apparently. I read recently they're tweaking various things with dyno queue to stop it from being such a bad experience for solo players. If the various tweaks and fixes don't work, Riot will apparently consider releasing a second queue for truely solo players that dynamic queued players can't access.\n\nEdit: It's in the latest 'Riot Pls'. It more focuses on how unfair it is if you get vs a serious 4+1, while your team is a casual 4 and you're solo queue (plus other combinations), though it still relates to the problems you see.\n\n> We don’t expect you to rent out a gaming house with four friends just so you can stay in Plat, but we do want to support a queue that levels up in competition like any other team sport: through leadership, cooperation, and, yes, raw skill. All athletes possess these attributes in different measures, but they understand and value them intrinsically. Prior to the launch of dynamic queue, we felt like we had a competitive ladder that over-indexed on the raw skill and individualism parts instead of naturally promoting all-around great teamplay.\n> \n> When the team made its recent update, a lot of players took away the conclusion of “no solo queue” -- that we were hiding from a hard conversation by being purposefully vague. In reality, we’re not making a call on solo queue because there are some critical issues we need to fix in dynamic queue to understand what’s actually missing. Promising solo queue in our original announcement was premature - a knee-jerk reaction to a situation we were still figuring out - and our silence on the matter (outside of some miscommunications) only made things more suspicious.\n> \n> Here’s the rundown: We know that for some players, dynamic queue undermines individual recognition of skill, and that’s not something we can solve with iterative improvements. It’s a philosophical difference. But, we know a lot of things that can be solved with iterative improvements, and our current top three priorities are improving the solo player experience against premades, lowering queue times, and smoothing out role selection weight. In an ideal (and optimistic) world, getting these numbers right would make a second queue unnecessary, but it’s not something we’re dismissing as of yet. Right now we're prioritizing the stability and health of a single queue - two would split the ranked player base and have a significant impact on wait times - and this is not a decision we’re taking lightly.\n> \n> When it comes to a philosophical stance, however, we do want to be clear: we believe that dynamic queue is closer to representing a healthy, competitive landscape in League of Legends than solo/duo queue. We’re not saying this to present a binary ‘one or the other’ situation -- it’s a belief in the same way we know we’re under-serving those who want a way to measure (and communicate) their individual performance. This will be an ongoing conversation as we finish stabilizing dynamic queue and develop a deeper understanding of what we should be prioritizing next.\n\n","replies":[]},{"poster":"Supreme God","date":"2016-04-19T05:15:06.893+0000","up_votes":1,"down_votes":2,"body":"false","replies":[]}]}