{"poster":"lnsanityManatee","date":"2015-12-07T01:49:17.896+0000","title":"This Yi...","subforum":"Gameplay","embed":{"description":null,"url":"http://imgur.com/kQcZf6l","image":"http://imgur.com/kQcZf6ls.png"},"up_votes":1,"down_votes":2,"body":"So this guy is just flaming the whole match because his Malphite laning partner is new, lagging, and just having a bad game. Calling everyone names the whole match, being toxic as all hell, and generally just bringing the team down. Just wanted people to see this.\n\nThis is the kind of behavior that ruins games for other people. I really wish Riot would crack down harder on people like this. I report them every time and nothing ever comes of it.\n\nEDIT: How do I change what board this is in? I put the wrong one on accident.\n","replies":[{"poster":"DreamMode","date":"2015-12-07T04:14:56.624+0000","up_votes":2,"down_votes":1,"body":"It's one game. Exit the game menu proceeding the victory/defeat splash screen and move on. Some people are idiots, you posting/sharing it here just gives them more of a voice.","replies":[]},{"poster":"Reformed Dunni","date":"2015-12-07T04:11:31.678+0000","up_votes":1,"down_votes":0,"body":"Sadly the new player experience for league sucks. Players can barely learn anything by playing against level 30 smurfs and players like that Yi ruin it for them as well. Riot is starting to crack down Lyte is developing a system to target these player. Answer to the edit: You can't once you've made the post you can change the board so you'll have to make it over","replies":[]},{"poster":"MilfHuntUnitXJ9","date":"2015-12-07T05:10:35.739+0000","up_votes":1,"down_votes":1,"body":"Wow dude, so you're telling me this kind of shit doesn't happen 1 in 3 games?? Aww man you're blowing my mind!!!! And you even made a thread to prove it??!?? \n\n-1","replies":[]},{"poster":"GetMariahCarried","date":"2015-12-07T04:30:45.066+0000","up_votes":1,"down_votes":1,"body":"Welcome to League. Downvoted, 'cause there's no need to broadcast others' everyday toxicity.","replies":[]}]}