{"poster":"what you deserve","date":"2017-01-18T08:45:12.436+0000","title":"How does failing promos even work?","subforum":"Gameplay","up_votes":1,"down_votes":0,"body":"How does it determine how much LP to give you afterwards? I just dodged my last game of promos and now I&#039;m at 73? I had 98 before my last game.","replies":[{"poster":"SirTeemoMushroom","date":"2017-01-18T09:00:27.960+0000","up_votes":1,"down_votes":3,"body":"depends on your win streak... how k/d , cs, time alive, items bought , gold earned etc.","replies":[{"poster":"Deep Terror Nami","date":"2017-01-18T09:05:25.293+0000","up_votes":3,"down_votes":0,"body":"Personal performance has absolutely nothing to do with MMR or LP gains. The only factor is your MMR compared to the opponent's (measuring the difficulty of the match), and if you won or lost.","replies":[{"poster":"SirTeemoMushroom","date":"2017-01-18T09:48:52.909+0000","up_votes":1,"down_votes":3,"body":"so... you wanna tell me, if you get 0-25/12  you will get the same lp with someone who's on win streak , carrying hard and full build all the games? pretty sure not.","replies":[{"poster":"Geauxx","date":"2017-01-18T09:50:16.463+0000","up_votes":1,"down_votes":0,"body":"depending on the mmr of everyone, yea, but your  K/d, cs, time alive, items, gold have 0 to do with it.\n\nits all about your mmr and current rank while in the mmr\n","replies":[]},{"poster":"Deep Terror Nami","date":"2017-01-18T10:11:34.473+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=roQHEBA2,comment-id=0001,timestamp=2016-11-28T19:43:04.420+0000)\n>\n> It&#x27;s been brought up. The concern we have with anything that modifies LP gain/loss that isn&#x27;t &#x27;your team won/didn&#x27;t win&#x27; is that it can distort player behavior in game at the expense of their team. At present if you&#x27;re trying to maximize your odds of gaining LP the best thing you can do is whatever increases your team&#x27;s chances of winning the most. If you add LP incentives to personal champion grades however you end up with some situations where players are encouraged to try and maximize their grade at the expense of their team. That leads to cases like players refusing to defend because they think the game&#x27;s already over and they don&#x27;t want to get any more deaths, players farming to try and increase their CS for grade purposes instead of just winning the game, players going for repeated kills on weak enemy champs instead of just taking an objective etc.\n\nhttps://support.riotgames.com/hc/en-us/articles/201752954-Matchmaking-Guide#q2","replies":[]}]}]},{"poster":"what you deserve","date":"2017-01-18T09:25:23.792+0000","up_votes":1,"down_votes":0,"body":"Pretty sure that's 100% untrue.","replies":[]}]},{"poster":"Deep Terror Nami","date":"2017-01-18T08:49:23.777+0000","up_votes":1,"down_votes":0,"body":"You lose and gain LP for each match as usual, so it's simply calculated the same as it always is; dodging a series game counts as a loss. One thing to note is that while you can go above 100 LP for a win (not the one that puts you in promos), it will not display the extra.","replies":[]}]}