{"poster":"Craiqz","date":"2019-01-02T11:10:13.293+0000","title":"Der Multigaming Clan \" NoIdeaWhatDisIs '\" sucht aktiv neue Member für Familiäres Gaming!","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"**_Heiho LoL-Community, _**\r\n\r\n{{sticker:sg-kiko}} \r\n\r\nWir, NoIdeaWhutDisIs, sind momentan aktiv auf der suche nach neuen Member, die nach dem gem&uuml;tlichen Feierabend abends Lust haben, mit ein paar Freunden lockere Spiele anzugehen. \r\n\r\n**Kurz &uuml;ber uns:**\r\n\r\nAuch wenn wir uns gern als ein Multigaming-Clan betiteln bestehen momentan unser haupts&auml;chlicher Zeitvertreib aus dreierlei Dingen: League of Legends,  Black Desert Online und Overwatch, allerdings sind sind wir auch stetig aufmerksam f&uuml;r kommende Interessante Spiele die aufkommen sollten. \r\n\r\nNoIdeaWhutDisIs ist aktuell eine kleine und famili&auml;re Gruppe und das ganze w&uuml;rden wir auch gern dabei belassen. Wir wollen uns untereinander kennen, zusammen Spa&szlig; haben und den Alltag des Lebens eine nette Alternative oder einen Ausgleich bieten. Zusammenhalt, Toleranz, und vor allem Freundlichkeit steht bei uns an erster Stelle. Daher wollen wir auch toxisches sein, Tilt und Engstirnigkeit auf ein Minimum reduzieren, denn auch in losing games kann man trotzdem noch Spa&szlig; haben ! \r\n\r\nUnser Clan wurde erst vor kurzem gegr&uuml;ndet, z&auml;hlt momentan auch nur bis zu 15 Member an und wir wollen es noch ein bisschen aufstocken, auf dass man sich untereinander kennt, aber auch teilweise immer jemand da ist, mit dem man spielen kann. Alterstechnisch sind wir sehr aufgeschlossen, jetzt allein haben wir bereits eine Spann von 18 - 30 und sind immer aufgeschlossen Menschen gegen&uuml;ber, die sich reif und Verst&auml;ndnisvoll benehmen k&ouml;nnen.\r\nHierzu muss aber auch gesagt werden, dass wir gern mal etwas albern sind, uns sehr gern im Talk auch einfach mal reden oder auch einfach nur von Animes schw&auml;rmen. \r\n\r\n_Unsere Richtlinien:_\r\n\r\n- Mindestalter von 18 (Ausnahmen best&auml;tigen die Regel)\r\n- Toleranz\r\n- geistige Reife\r\n- wenig &#039;Tilt&#039;\r\n- Offen f&uuml;r neues\r\n- Kein Beef untereinander: Wenn ihr Probleme mit dem einen oder anderen Member habt, l&ouml;st es nicht mit verbalen, erniedrigenden Worten, sondern gesittet mit oder ohne einem Mod, oder geht demjenigen aus dem Weg\r\n- Kein &#039;Hass&#039; gegen Animes haben\r\n\r\n_Was erwartet dich bei uns:_\r\n\r\n- Discord Server\r\n- eine famili&auml;re Gruppe\r\n- Spa&szlig; am spielen, statt purer Tryhard\r\n- Aufgeschlossenheit und Freundlichkeit\r\n- Toleranz\r\n- Humorvolle Gruppe (manchmal vielleicht auch ein bisschen albern)\r\n- Spielererfahrung in allerlei Games\r\n- Easy &#039;Weebs&#039;\r\n\r\n_M&ouml;glichkeiten uns zu erreichen:_\r\n\r\nFalls du es auch leid bist, st&auml;ndig allein zu spielen, immer diesen oder jenen TS joinen zu m&uuml;ssen, wenn du mal ruhig eine Runde allein spielen willst und/oder alle anderen Clans viel zu unpers&ouml;nlich geworden sind, bist du bei uns herzlich Willkommen. \r\nMelde dich einfach bei unserem Chefchen Craiiqz (LoL-Ingame: Craiiqz / Discord: Craiqz#0854 ) oder auch bei Yuki ( LoL-Ingame: Lynnette / Discord: Yuki#9708 ). Wir werden dich mit Freuden s&auml;mtliche offenen Fragen beantworten und dich herzlich auf unseren Discord Server einladen. Alles kann gekl&auml;rt werden, ob nun schriftlich durch Chat oder auch auf dem Server in einem pers&ouml;nlichen Gespr&auml;ch. \r\n\r\nWenn du bis hierhin alles durchgelesen hast, Respekt, du bist der **Hammer** ! Wir freuen uns auf dich,\r\nMit freundlichen Gr&uuml;&szlig;en,\r\n\r\n**die NoIdeaWhutDisIs - Gruppe\r\n {{sticker:sg-ahri-2}} **","replies":[]}