{"poster":"xr4pTor","date":"2017-01-08T14:08:12.010+0000","title":"Permanenten Bann","subforum":"Spielerverhalten & Moderation","up_votes":2,"down_votes":13,"body":"Peace,\r\nwurde soeben Permanent gebannt, wegen flamen, obwohl es nichtmal Hetzreden o.&auml;. waren. Naja ihr k&ouml;nnt nichts machen hab nur ne Frage.\r\nDas League Punishment System hat sich ja &uuml;ber die Jahre stark verbessert mit Chat-Logs und sowas, aber ich habe noch die Frage ob man von einem Permanenten Bann wieder entbannt werden kann. \r\nZumindestens irgendwie 3 Monate bann, denn nur aggressiv werden ohne Rassistisch oder &auml;hnliches zu sein und dann einen Permanenten Bann zu kriegen ist schon ein bisschen &uuml;bertrieben, wenn man mal die Leute sieht die ultra Rassistisch sind und kein Ban kriegen.\r\n\r\nlg.","replies":[{"poster":"zoriax","date":"2017-01-08T17:37:58.095+0000","up_votes":3,"down_votes":0,"body":"Nichts für ungut aber mich freut es. Einer weniger der dieses Spiel berbal zerstört und jeden mit einem schlechten Gefühl aus den Game gehen lässt. sei es flamen im Team oder ein Easy nach dem Win...","replies":[]},{"poster":"Doo ","date":"2017-01-08T14:48:09.507+0000","up_votes":4,"down_votes":1,"body":"weißt du was \"permanent\" bedeutet?\nEin Flamer weniger ist immer gut.","replies":[]},{"poster":"Angel Ayume","date":"2017-01-08T14:10:14.774+0000","up_votes":3,"down_votes":1,"body":"Chatlogs bitte. Dann können wir hier über deinen Bann diskutieren. \nBevor wir aber nicht wissen, was du deinen Mitspielern an den Kopf geworfen hast, können wir da nicht viel sagen.\n\nUnd ein permanenter Bann wird nicht zurück genommen. Das sagt dieser Bann doch bereits aus, er ist permanent.","replies":[]},{"poster":"Yamató","date":"2017-01-08T14:32:44.227+0000","up_votes":2,"down_votes":1,"body":"Da sind die Chattlogs nicht nötig,. Permamente Banns werden nur zurück gezogen wenn sie durch einen Fehler im System verteilt werden. Permabanns sind sonst wie der Name schon sagt unaufhebbar.","replies":[]},{"poster":"Sirrkas","date":"2017-01-08T14:32:15.890+0000","up_votes":2,"down_votes":1,"body":"Banns werden grundsätzlich nicht zurückgenommen. Ausnahmen bilden da Banns wegen Zahlungsverzug und fehlerhaft vergebene Banns. Da man für einen Permabann aber nicht Hetzreden verwenden muss, sondern normales Flamen reicht, wenn man die anderen Strafen ignoriert, wirst du nicht entbannt werden. \n\nDer 2 Wochenbann war die letzte Warnung und da müsste dir auch ausdrücklich mitgeteilt worden sein, dass es beim nächsten Vergehen einen Perma gibt. Dabei ist es dann auch egal, ob man fremdenfeindliche Reden schwingt oder nur jemanden Noob oder Idiot nennt.","replies":[]},{"poster":"Sturmwarnung","date":"2019-01-04T08:50:31.226+0000","up_votes":1,"down_votes":1,"body":"***","replies":[{"poster":"Darkr3sQ","date":"2019-01-04T08:51:36.038+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sturmwarnung,realm=EUW,application-id=KYnfKGf0,discussion-id=EjPLomep,comment-id=0007,timestamp=2019-01-04T08:50:31.226+0000)\n>\n> LOL iS DEAD ....\n> Ich versuche mit Absicht seit über 2 Monaten einen permanenten Bann zu erreichen. Ich trolle, ich beleidige, ich ruinieret mitlerweile schon dutzende Spiele. Eine 14tägige Strafe habe ich auf einer Backe abgesessen. Danach habe ich ohne Besserung meine Vorhaben weiter fortgesetzt. Das schlimmste danach sind höchstens mal 20min warten für ein Spiel. In der Zeit mache ich mir einen leckeren Latte Machiatto und ruiniere das Spiel und ergötze mich an den Kommentaren in aller Welt.\n> Riot ist eine Schlafmütze die nur Geld will... dieses Spiel ist am Ende.\n\nWenn Du nicht mehr LOL spielen willst, kannst Du es auch wesentlich einfacher haben: Schreibe den Support an und bitte darum, dass Dein Account gesperrt wird.\nAbgesehen davon stellt sich mir die Frage, warum Du einen 2 Jahre alten Thread wiederbeleben musst, um uns mitzuteilen, was Du doch für ein toller Hecht bist.","replies":[]}]},{"poster":"Megamaexx","date":"2017-01-09T10:04:20.460+0000","up_votes":1,"down_votes":0,"body":"Für “normales“ flamen, durchläuft man mehrere Stufen bis zum Permabann. Bei Hetzreden, Homophobie etc. kann sofort ein Permabann erfolgen. \n\nIch nehme an, dass du mehrere Stufen durchlaufen hast.","replies":[]},{"poster":"Wernicke","date":"2017-01-08T17:28:19.400+0000","up_votes":1,"down_votes":0,"body":"> wurde soeben Permanent gebannt, wegen flamen, obwohl es nichtmal Hetzreden o.ä. waren. \n\nIst auch nicht nötig! Es geht nicht explizit um Beleidigungen, sondern um negativen chat. Man muss kine Schimpfwörter auspacken um eine Strafe zu riskieren. \nWenn du nun ein perma hast ist ja eh schon vorher was vorgefallen und du hast die Warnungen schlicht ignoriert. Oder du hast so extrem geflamed das du Strafstufen übersprungen hast. In beiden Fällen kannste dir aber ja selber ausrechnen das der perma ein perma bleibt oder?! ^^","replies":[]}]}