{"poster":"Zéddó","date":"2018-11-21T19:46:21.670+0000","title":"faires Matchmaking?!","subforum":"Champions & Gameplay","up_votes":2,"down_votes":3,"body":"Hallo zusammen, \r\n\r\nalso ich m&ouml;chte es kurz halten. \r\n\r\nVielleicht sehe ich das ja falsch, oder vielleicht bin ich da auch zu doof f&uuml;r um es zu verstehen, ABER....\r\n\r\n.....ich hatte vor einiger Zeit dem RIOT Support mal ein Ticket geschrieben mit der Bitte, mir zu erkl&auml;ren wie das Matchmaking funktioniert. Dies liegt daran, dass ich nicht verstehe wie ich mit lvl 28 gegen Spieler mit lvl 120+ und meist auch noch recht hoch in der Elo zocken &quot;muss&quot;?!\r\n\r\nDie Antwort war leider recht unbefriedigend: &quot;Wir versuchen die MMR fair zu halten!&quot;\r\n\r\nIch habe keine MMR, da ich lvl 28 bin. Meine Mates haben auch keine MMR. Wir MMR 0 gegen ein Team mit MMR 1300+?\r\n\r\nVielleicht habe ich ein anderes Verst&auml;ndnis von Fairness?","replies":[{"poster":"Angel Ayume","date":"2018-11-21T21:54:15.650+0000","up_votes":2,"down_votes":1,"body":"> Ich habe keine MMR, da ich lvl 28 bin. Meine Mates haben auch keine MMR. Wir MMR 0 gegen ein Team mit MMR 1300+\n\nDas stimmt nicht. Du und deine Teammates haben sehr wohl eine MMR, es ist nicht abhängig vom Level ob man eine MMR hat und wie hoch diese ist. Und eure MMR scheint in etwa genau so hoch zu sein wie die der Lvl 120+ Spieler. \n\nSollte da jemand sein mit dem ihr gematched wurdet, der im SoloQ viel höher geranked ist, beispielsweise Diamant, dann liegt das daran, dass er im Norma-Modus eine ähnliche MMR hat wie ihr. Denn jede Queue hat ihre ganz eigene MMR, bedeutet, dass der Lvl 120er im Ranked vllt eine MMR von Diamant hat, aber im Normal eben eine MMR von einem Silberspieler. :) \n\nÜbrigens rein zur Info: Seiten wie op.gg kannst du was die MMR angeht nicht vertrauen. Sie ist lediglich ein ganz grober Richtwert, weicht aber nicht selten extrem von der eigentlichen MMR ab. Die MMR weiß nur Riot und diese kannst du nirgendwo einsehen. \n\nAber sei nicht traurig. Es kommt nicht so oft vor, das man im Normal gegen weit höher gerankte spielen muss. In der Regel spielt man gegen die, die auf dem etwa gleichem Niveau spielen. :) Ist lediglich eine Ausnahme, wenn da mal ein Dia oder so zwischen ist.","replies":[]},{"poster":"NVG Scythe","date":"2018-11-21T20:30:03.826+0000","up_votes":2,"down_votes":1,"body":"es gibt einen großen unterschied zwischen normal mmr und ranked mmr, wenn du nach lvl 30 kein einzieges normal mehr zockst kannst du selbst in challenger gegen silber im normal gematcht werden.\n\nWenn du viel hintereinander gewinnst kann es durchaus sein dass du als lvl 28 gegen viel bessere gematcht wirst aber warum heulst du so rum?\n\nGit Gud lol","replies":[{"poster":"Zéddó","date":"2018-11-21T20:48:37.813+0000","up_votes":2,"down_votes":2,"body":"also zunächst einmal frage ich mich was du glaubst hier andere anmachen zu können \"was heulst denn so rum\"?! Vielleicht bist du ja auch einer von denen die es witzig finden sich nen smurf zu machen um dann Anfängern zu zeigen \"das ich zu schlecht für meinen eigenen ELO-Berich bin, aber wenigsten einen Anfänger killen kann!\". Sagt vor allem was über deine Person und dein Mindeset aus. Eher traurig. \n\nABER....das ist ja klassisch für diese Community....","replies":[{"poster":"e621 Rengar","date":"2018-11-21T21:43:11.593+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Zéddó,realm=EUW,application-id=Wj1wcocU,discussion-id=xK0LMNgd,comment-id=00010000,timestamp=2018-11-21T20:48:37.813+0000)\n>\n> also zunächst einmal frage ich mich was du glaubst hier andere anmachen zu können &quot;was heulst denn so rum&quot;?! Vielleicht bist du ja auch einer von denen die es witzig finden sich nen smurf zu machen um dann Anfängern zu zeigen &quot;das ich zu schlecht für meinen eigenen ELO-Berich bin, aber wenigsten einen Anfänger killen kann!&quot;. Sagt vor allem was über deine Person und dein Mindeset aus. Eher traurig. \n> \n> ABER....das ist ja klassisch für diese Community....\n\nUnd was ist mit den Challengers die sich Smurfs machen ? Sind die dann auch zu schlecht für ihre Elo?\nDieser Satz hat halt überhaupt nix damit zu tun ob man sich n Smurf macht oder nicht\n\nUnd wenn du mit lv 28 mit 120ern ins Team kommst heißt das für mich aber auch nur das die 120+ Leute ziemlich scheisse sind und du auf deren Nivaeu bist \n\nUnd wieso haben sich 99% der spieler angewöhnt auf fkn op.gg lolking oder was auch immer die Zahlen ernst zu nehmen.\nDie jeweiligen Seiten haben so ca genau 0 ahnung welche Hidden MMR du hast ","replies":[]}]}]},{"poster":"ΔRC RΔFUNZΞL","date":"2018-11-21T20:19:41.228+0000","up_votes":1,"down_votes":0,"body":"1300 mmr ist btw mid silber soweit ich weiß xD 1500 wäre gold und 1700 ungefähr platin (kann es bei plat schwer sagen da ich mit high platin auf 1900 mmr bin","replies":[]}]}