{"poster":"DragonOfTheVoid","date":"2016-05-19T02:55:25.321+0000","title":"Is this a joke riot/tencent?","subforum":"Miscellaneous","up_votes":1,"down_votes":1,"body":"Mark of armour penetration              ip 1      tier 2 = +1 armour penetration \r\ngreater mark of armour penetration ip 410 tier 3 = +1.28 armour penetration \r\n\r\nThis goes on and on like do you wont to do the maths or should i ?. \r\nWtf is this you can spend 1 ip and get + 1 and for just 409 more ip you can get a extra 0.28 come on riot this is a joke that is a 409% ip increase fore lees then 30% more armour pen nice. \r\njust who came up with this?{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"VeganCrossfitter","date":"2016-05-19T03:13:41.400+0000","up_votes":1,"down_votes":1,"body":"Most people have no other use for their ip but runes, really it only takes 3 wins to get 400 ip.","replies":[{"poster":"DragonOfTheVoid","date":"2016-05-19T03:41:48.433+0000","up_votes":1,"down_votes":1,"body":"ok now you need what 9 runes to fill marks? 3 wins times 9 = 27 wins now times that 3 more times = 81 wins.\nThats not for quintessences lets do that now we will say 1500 ip as you can get both 1050 ip and 2050 ip runes 400ip you need to times that by 4 then you have 1600 ip now from that you will need to play 12 games just for 1 tier 3 rune times that by 3 then you have 36 games 36+81=117 wins if you lose you need to win about 40 more games.\n if your at my stage of champs i need to buy 68 more champs and i have played near 1k games not every one has been playing sins se 0.","replies":[{"poster":"fattyhotdogs","date":"2016-05-19T09:27:41.906+0000","up_votes":3,"down_votes":0,"body":"Play more games then. League of Legends is a **_FREE_** game.\n\nYou can play it for **_FREE_**\n\nTake what you get and put up with it","replies":[{"poster":"DipperOCE","date":"2016-05-19T10:14:00.961+0000","up_votes":1,"down_votes":0,"body":"Runes are the most influential early game stats... they shouldn't be hidden behind a paywall (pages) and play time (runes), and especially not levels (it's a moba).","replies":[{"poster":"fattyhotdogs","date":"2016-05-20T05:46:20.478+0000","up_votes":3,"down_votes":0,"body":"If anybody hasn't played enough games to have the rune pages that they want, then an extra 0.28 armor penetration is not going to have an influence on their game.. Those games will be influenced by decisions in play and difference in experience. Someone with 100 games and 10.24 armor penetration probably won't notice the extreme influential power of their armor pen vs someone with 250 games and 8 armor pen\n\nIf they have played enough games but chose instead to spend their IP on champions, then that's their own damn fault.","replies":[]},{"poster":"DragonOfTheVoid","date":"2016-05-19T11:07:14.571+0000","up_votes":1,"down_votes":0,"body":"ty a player with a brain","replies":[]}]}]},{"poster":"VeganCrossfitter","date":"2016-05-21T16:25:30.161+0000","up_votes":1,"down_votes":0,"body":"if you have 1k games and cant afford runes, try a new game because this one isn't for you. Also, please add punctuation that was a mess to read.","replies":[]}]}]},{"poster":"Corehog","date":"2016-05-20T06:17:21.873+0000","up_votes":1,"down_votes":0,"body":"Here's an easy solution, if the tier 2 runes are cheaper, just use those. \n\n> Mark of armour penetration ip 1 tier 2 = +1 armour penetration\ngreater mark of armour penetration ip 410 tier 3 = +1.28 armour penetration\n\n> This goes on and on like do you wont to do the maths or should i ?.\nWtf is this you can spend 1 ip and get + 1 and for just 409 more ip you can get a extra 0.28 \n\nIt's not like Riot are forcing you to choose between the tiers.\n\nAlso you could, if you were so inclined, just buy Riot points and spend money to get more rune pages. If not, just play a few games and purchase a rune page with IP.","replies":[]},{"poster":"GigaPube","date":"2016-05-19T12:55:12.769+0000","up_votes":1,"down_votes":0,"body":"is this post a joke? never mind the sarcasm ive seen your posts before, i know it isnt. of course the rioters response couldnt possibly address the concerns of someone so naive as to how riot have designed their game along with their rune and IP system. to sum it up for you and those alike, you spend next to nothing so you can get by with seemingly balanced stats compared to your enemies. if you choose to play more competitively you spend your \"experience points\" for slightly better in game stats if you truly think its worth it. if you dont, you have some similar adequate stats, you can go buy other things, but you dont complain about getting out-stated in a game (similar to calling someone a scripter if they outplay you). i dunno how you or anybody could possibly complain, this is only a good thing for all parties and its riot that loses money, shame on you for whining at such a selfless act from rito","replies":[{"poster":"CHEESYLEEKS","date":"2016-05-19T16:30:47.800+0000","up_votes":1,"down_votes":0,"body":"riot cucking 101","replies":[]}]},{"poster":"Maraudaur","date":"2016-05-19T03:45:50.875+0000","up_votes":1,"down_votes":0,"body":"Hey Snakeowen,\n\nOriginally when we had runes the cost seemed too high so we have done the following listed below. While the price reductions now might not make as much sense from a IP ratio perspective they are much less painful to obtain.\n\nA short while ago, there was discussion around making “rune bundles” to help out players who were just getting started on their tier 3 rune pages. After some thought, however, we came to the conclusion that we could do something easier…\n\nSo we permanently discounted T3 runes by 50% about 8 months ago - http://oce.leagueoflegends.com/en/news/store/sales/starter-t3-runes-permanent-discount-2-weeks\n\nRecently (just under a month ago) we also announced we would be changing tier 2 runes to 1 IP and removing all tier 1 runes. http://oce.leagueoflegends.com/en/news/store/sales/starter-tier-2-runes-go-1-ip-sale\n\n> Back in patch 6.5, we halved the experience required to reach Summoner level 30 and saw positive results across the board.\n> We also mentioned that last year’s permanent discount on Tier 3 runes was necessary preparation to ensure new level 30s could afford viable rune setups. Then we thought about it and realized we could do better, so…\n> We’re doing that.\n> On 19/05/2016 at 6AM AEST, we’ll be putting all tier 2 runes on sale permanently for 1 IP each*.\n> Additionally, Tier 2 runes will be accessible at Summoner level 1, and all Tier 1 runes will be permanently retired.\n\nHope this helps clarify why the numbers may be a bit weird but the overall outcome has been great for players so far.","replies":[{"poster":"Buttsubushi","date":"2016-05-19T09:51:00.956+0000","up_votes":1,"down_votes":0,"body":"Good stuff, now you just have to lower the cost of Rune Pages and then we are all set.","replies":[]},{"poster":"DragonOfTheVoid","date":"2016-05-19T04:02:18.147+0000","up_votes":1,"down_votes":2,"body":"for players just starting yes but for players that have been playing for near 2 years we still need to play 117 games for 1 rune page a full tier 3 rune page just one i only have 2 a ad and ap rune page all teir 3 that took me 234 games lets say they all went for 25 mins thats 5850 mins=97 hours and thats 4.0625 days that no sleep non stop for just 2 rune pages i beter not eat if i wont more pages and dont even get me started on the stupid  6300 ip for a new rune page. \n\nnot pay to win plz you cant get runes with rp no but you can get a ip boost for just $5 but that will only get you a ip boost for 3 days.","replies":[{"poster":"Mozzie25","date":"2016-05-19T06:27:08.886+0000","up_votes":1,"down_votes":0,"body":"They halved the price on teir 3 runes. That makes it easier for everyone to buy them. I only have 2 rune pages but I made the decision to go after more champs instead of rune pages. I'm guessing you made the same decision. Don't blame riot for your decision. \n\nYou should be happy these prices changes make it much easier for you to gain extra runes","replies":[{"poster":"DragonOfTheVoid","date":"2016-05-19T07:23:39.215+0000","up_votes":1,"down_votes":2,"body":"arr you dum im not blaming riot for anything im just saying its stupid how much it cost to get a single rune page more then 4 days that would be no food no water no sleep nothing but who is going to do that so instead of 4 days it will take you around 4 weeks just for 1 rune page","replies":[{"poster":"Niji","date":"2016-05-19T09:14:57.696+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=snakeowen,realm=OCE,application-id=Ntey9fRZ,discussion-id=KMrEjx8A,comment-id=0001000000000000,timestamp=2016-05-19T07:23:39.215+0000)\n>\n> arr you dum im not blaming riot for anything im just saying its stupid how much it cost to get a single rune page more then 4 days that would be no food no water no sleep nothing but who is going to do that so instead of 4 days it will take you around 4 weeks just for 1 rune page\n\nRiot like to jew people hard with the rune page prices so people either buy boosts or forgo buying champs with ip and spend rp on champs instead","replies":[]}]}]}]}]}]}