{"poster":"DragonOfTheVoid","date":"2015-10-01T09:33:52.677+0000","title":"Can we deleat this champ?","subforum":"Miscellaneous","up_votes":1,"down_votes":6,"body":"Ok so {{champion:27}} is just such a stupid champ I  was nasus in top lane as {{champion:75}} and one lane at first until he started to proxy farm ow bass now before you go and say ow he is ezy to beat just go kill him here is the thing a {{champion:27}} with {{item:3116}} {{item:3040}} {{item:3151}} is so bs he goes tank after this he dose a shit tone of damage slows and is tanky now despite he can get up to 600 speed with his ult and {{item:3009}} {{item:3742}} and slow  nasus down to a crawl whilst doing 300 damage if you just touch his trail now before you say im a nub me and 2 mates made a customs game with {{champion:19}} {{champion:67}} and could not catch him after we could not get the ww ult on singe we got singe to let us ult him but as soon as ww ult was over we were back to the running game and even if we did kill him lets face it he will just go back and do it agene and we would have to deal with him agene now whilst me and my mid lanner was going and killing the singe in bass there mid and jg were pushing top and mid with 0 contestant singe is a champ that fells like he was not made for this game plz just remove him until you rework his q all of his other ability&#039;s are fine its just the q \r\n\r\npleases 1+ this up and vote so riot can see this it only takes 2 seconds","replies":[{"poster":"ƒamous","date":"2015-10-02T02:01:04.075+0000","up_votes":2,"down_votes":1,"body":"It'd be nice if you spoke English. There is also such a thing called grammar, you should learn about it.","replies":[{"poster":"DragonOfTheVoid","date":"2015-10-02T03:22:08.665+0000","up_votes":1,"down_votes":3,"body":"hahahah I am speaking English I don't know what your going on about","replies":[]}]},{"poster":"SEKAI","date":"2015-10-01T10:24:08.285+0000","up_votes":2,"down_votes":1,"body":"Remember that meme?\n\nYeah. Never chase Singed.\n\nBut really, picking Nasus into this guy is probably the root of this problem.","replies":[{"poster":"DragonOfTheVoid","date":"2015-10-01T11:43:03.054+0000","up_votes":1,"down_votes":0,"body":"hahahah picking nasus into this guy hahahah this is in a normal game every one assumes that you can only talk about ranked games on the boards","replies":[]}]},{"poster":"GigaPube","date":"2015-10-01T10:16:53.517+0000","up_votes":2,"down_votes":1,"body":"gr8 b8 m8","replies":[{"poster":"DragonOfTheVoid","date":"2015-10-01T11:43:30.169+0000","up_votes":1,"down_votes":1,"body":"numbers don't go in words","replies":[]}]},{"poster":"VENI VIDI VICI","date":"2015-10-01T13:35:46.885+0000","up_votes":1,"down_votes":1,"body":"Alright you think singed is broken? Play him for a few games. Singed is weak without items meaning huge late game potential if he is allowed to scale. Sound familiar{{champion:75}}  Play the dam game and get good. Remember you're bronze 3. You don't know much about the game yet. Try learn","replies":[{"poster":"DragonOfTheVoid","date":"2015-10-01T14:21:40.832+0000","up_votes":1,"down_votes":0,"body":"iv been playing near 2 years now yes im not some lcs player but im no nub \nas for the bronze 3 I stoped playing ranked after 2 weeks as I found many toxic players trolls afk's and dc's I don't play ranked as that is were 90% of the toxic players trolls ect","replies":[{"poster":"VENI VIDI VICI","date":"2015-10-03T10:28:11.637+0000","up_votes":1,"down_votes":0,"body":"You're bronze 3 until you prove you know something about the game.. You don't have to prove anything, but we can't take you seriously.","replies":[]}]}]},{"poster":"Garens Harem","date":"2015-10-02T11:54:25.659+0000","up_votes":1,"down_votes":0,"body":"cancerous bait","replies":[]},{"poster":"Mar3thyu","date":"2015-10-01T09:37:17.137+0000","up_votes":1,"down_votes":0,"body":"just play {{champion:421}} top rush bc then go for tanky you can hold a lane because of passive sustain","replies":[{"poster":"DragonOfTheVoid","date":"2015-10-01T09:47:19.630+0000","up_votes":1,"down_votes":0,"body":"its not holding lane that's fine I won lane got 3 kills on him as he kept going to far in on me its that 15 to 20 min mark were he gose into your bass and gets fed whilst taking out mid and top lanes as there is no minions to help you push so he then takes mid and top or top and jg away witch allows the enemy to push a lane top for example with a jg and mid lanner so many think he is a bad champ and cant do shit but all what he was made for was to take 2 people away from lane and let his team push have you ever tried to hold a lane with 0 minions and 4 people pushing you will loss its not about lane I don't care if I loss lane if I do il a team fight or b go into split push mode get fed off cs and make that fed  person have to deal with me its about the stupid proxy farming and letting him have a slow on his q if anything happens in game because of this post I bet they will just take away the slow on {{item:3116}} and say ow fixed but it wont","replies":[]}]}]}