{"poster":"DragonOfTheVoid","date":"2016-02-26T09:28:46.640+0000","title":"Mount Targon","subforum":"Miscellaneous","embed":{"description":"Like any place of myth, Mount Targon is a beacon to dreamers, madmen and questors of adventure. Those who survive the arduous journey to the foot of the titanic mountain find a sky shimmering with celestial bodies; the sun and moons, but also constellations, planets, fiery comets that streak the darkness, and auspicious arrangements of stars.","url":"http://oce.leagueoflegends.com/en/site/mount-targon/","image":"http://s.lolstatic.com/site/mount-targon/e495c118916d4fff37ad32010377589bbbe2d381/img/share/mt-share-1024x1024.jpg"},"up_votes":2,"down_votes":1,"body":"Like any place of myth, Mount Targon is a beacon to dreamers, madmen and questors of adventure. Those who survive the arduous journey to the foot of the titanic mountain find a sky shimmering with celestial bodies; **the sun and moons**, but also constellations, planets, fiery comets that streak the darkness, and auspicious arrangements of stars. **The people living at the mountain&rsquo;s base believe these to be aspects of long-vanished stellar beings, creatures powerful and ancient on a scale beyond human comprehension.**\r\n\r\nAo Shin now Aurelion Sol \r\nThe champions initial name, Aurelion Sol, is comprised of two words that derive from Latin. \r\n◾ Aurelion resembles the word &quot;Aurum&quot;, which means &quot;**gold**&quot; in Latin. \r\n◾ Aurelion may also be a portmanteaux of &quot;Aurum&quot; and English word &quot;**Lion**&quot;, combining to mean **Golden Lion**. \r\n◾ Sol is the Latin name for the Sun. \r\n\r\nso we are looking at a **gold sun **or **Golden Lion**. \r\n\r\nNow going of this id like to think that there is a very high chance that this is Aurelion Sol.","replies":[{"poster":"TrashDonnut","date":"2016-02-26T10:00:25.714+0000","up_votes":1,"down_votes":0,"body":"Aurelion Sol is scheduled for mid 2016 tho.","replies":[{"poster":"DragonOfTheVoid","date":"2016-02-26T10:49:39.368+0000","up_votes":1,"down_votes":0,"body":"and they can say that but imagine they say mid 2016 come out with it in a week the hype would be huge just log in and boom Aurelion Sol","replies":[{"poster":"dodo hunter","date":"2016-02-26T18:40:16.543+0000","up_votes":1,"down_votes":0,"body":"They would not say when he will be released unless he is almost finished. I think this will be a teaser and he will be released april-may.","replies":[]}]}]},{"poster":"Rcade Circles","date":"2016-02-27T05:32:58.268+0000","up_votes":1,"down_votes":0,"body":"2 extras. To tell you the truth i can be it and not it","replies":[]},{"poster":"kouryuho","date":"2016-02-27T05:01:28.057+0000","up_votes":1,"down_votes":0,"body":"will there be a moon creature too?","replies":[{"poster":"DragonOfTheVoid","date":"2016-02-27T05:02:54.595+0000","up_votes":1,"down_votes":0,"body":"I hope it would make sens think about it like moon and sun vs some great evil like the void","replies":[]}]}]}