{"poster":"Azirious Mistake","date":"2017-03-29T23:29:40.017+0000","title":"@Riot you royally screwed up the Aatrox rework, heres how I would've done it.","subforum":"Gameplay & Strategy","up_votes":2,"down_votes":1,"body":"1. His passive is awful, half the time the tooltip might as well be: &quot;every 2 minutes, you can delay your death by 4 seconds by going invulnerable and healing 30% health before getting bursted down again in half a second.&quot; this is a counter-intuitive gameplay pattern that punishes the player by going in, and that is if the player can even stack their passive, which is nigh-on impossible because stacks decay almost instantly. Long-story short, the risk far outweighs the reward. Heres how I would&#039;ve done it:\n\nHealth after reviving: 30% flat -&gt; 30-80% scaling with level, makes him less oppressive in the early game while letting him do something after reviving lategame.\nStack decay: after 5 seconds out of combat -&gt; after 8 seconds after combat.\nHUD: Blood effect surrounds the screen (Like Darius&#039; passive) because Aatrox is meant to be a badass, not a p***y.\n\n2. The next problem Aatrox suffers is getting to enemies, his Q has a very short range and having to jump in the air before he actually moves to his location makes it way less reliable and leaves Aatrox even more vulnerable to CC than he already is. Here&#039;s how I wouldve done it.\n\nDark Flight: Range boosted by 100 units.\n\n3. Aatrox&#039;s ult also leaves a lot to be desired, it&#039;s flat damage component is usually useless and for the short wind up time, thats DPS youre losing, it only makes sense that it should do something else that can benefit Aatrox. In addition, I think Riot should abandon the paradigm of &quot;landing the perfect Aatrox ult&quot;, it makes sense for Evelynn but not for Aatrox, thats just stupid since it doesnt even apply CC. A few ideas on ult changes include:\n\n1: Doubling Hellbent&#039;s benefits.\n2: A brief vacuum style CC followed by a slow. (Like Diana&#039;s Moonfall)\n3: Instantly activating Hellbent. (Would only be usable when Aatrox&#039;s passive is fully stacked)\n\nI hope you take these changes into consideration, because Aatrox really needs it. #GiveAatroxaChance","replies":[{"poster":"Roguestoney","date":"2017-03-30T02:18:17.192+0000","up_votes":1,"down_votes":0,"body":"To be fair it was a pointless attempt before they rework him completely in the upcomming reworks. \n\nWhat just happened was supposed to be a band-aid. Which was not good.","replies":[{"poster":"Azirious Mistake","date":"2017-03-30T02:24:21.649+0000","up_votes":1,"down_votes":0,"body":"well as long as this insult to our intelligence is only a temporary thing then thats cool.","replies":[]}]}]}