{"poster":"The Tower","date":"2015-06-01T15:13:44.358+0000","title":"Ein Wort über den Spaß an LoL","subforum":"Champions & Gameplay","up_votes":4,"down_votes":3,"body":"Hey Community!\r\nIch w&uuml;rde gerne etwas zur Community beitragen und schreibe hier meine pers&ouml;nliche Meinung &uuml;ber LoL und unsere Community!\r\n\r\n**WARNUNG**: _Dieser Text enth&auml;lt eine pers&ouml;nliche Meinung! Diese ist an niemanden gerichtet und dient lediglich dazu, zum Nachdenken anzuregen. Wer mit dieser Meinung nicht &uuml;bereinstimmt, kann das gerne als Antwort schreiben. Ebenfalls, f&uuml;r alle kritikunf&auml;higen Leute in dieser Community ist hier der Punkt wo ihr aufh&ouml;ren solltet zu lesen, denn dieser Text wird vermutlich herbe Kritik beinhalten, welche zu meiner Meinung geh&ouml;rt. Auch ist das hier kein Rage, sondern einfach frei, ohne Groll geschrieben. Viel Spa&szlig;!_\r\n----------------------------------------------------------------------------------------------------------------\r\nIch habe mir &uuml;ber die letzten 2 1/2 Jahre ein klares Bild &uuml;ber die Community, das Spiel selbst und dessen &Auml;nderungen verschafft. Als erstes spreche ich das Spiel selbst an:\r\n\r\nIch finde, dass das Spiel an sich das Genre MOBA bedeutungsvoll ver&auml;ndert hat. Es ist meiner Meinung nach ein balanciertes Spiel, sowohl allein stehend, als auch im Vergleich zu anderen Spielen im MOBA-Genre. Aber, es ist und war bei weitem nicht perfekt! W&auml;hrend einige Elemente im Spiel kostante Buffs und Nerfs erhalten haben, wurden andere Elemente schlicht vernachl&auml;ssigt bzw. vergessen. Ein gutes Beispiel daf&uuml;r bietet Dominion. Dominion ist an sich ein toller Spielmodus, welcher etwas Abwechselung in das Spiel einbringt, welcher aber seit ewiger Zeit vergessen wurde und immer noch das alte Design beinhaltet. Klar, dieser Modus ist auch heftig unterspielt, aber es geht ums Prinzip. Ein anderer m&ouml;glicher Kritikpunkt, wovon ich beinahe jeden Tag etwas mitbekomme, ist das Reportsystem. Es ist mir unklar, wie es genau funktioniert, und das sollte eigentlich nicht passieren. Ich finde, als Spieler habe ich das Recht zu erfahren, wann ich eine Strafe bekomme und was ich daf&uuml;r tun muss. Ein anderer Gesichtspunkt dieses Kritikpunktes ist die Ausnutzbarkeit dieses Systems. Nein, ich finde nicht, dass es Spieler unfair behandelt und jeder Bann oder jede Chat-Sperre seine Daseinsberechtigung hat, jedoch ist dieses System, trotz variabler Gewichtung der Reports, ausnutzbar. Bestes Beispiel hierf&uuml;r bin ich. Ich habe insgesamt 3 mal eine Meldung bekommen, dass ich wegen anz&uuml;glicher Sprache reported wurde, wobei ich eigentlich nie etwas in den Chat schreibe, au&szlig;er meiner Lane und Fragen nach Ganks. Bis jetzt habe ich daf&uuml;r auch keine Strafe bekommen, aber ich frage mich, wieviele &quot;normal&quot; gewichtete Reports n&ouml;tig sind, um jemanden, der nichts getan hat, zu bestrafen. Man kann mir nicht erz&auml;hlen, dass so etwas nicht funktionieren w&uuml;rde, denn auch ein System wie dieses, welches den Chat mitliest bestraft jemanden, der nichts getan hat wenn dieser beispielsweise 1000 Reports erhalten hat. Nat&uuml;rlich ist dies reine Spekulation, aber ich denke, dass dies funktioniert. Von Reports nun zu etwas, was dazu f&uuml;hrt: **Trolls**\r\nIch hatte wirklich sch&ouml;ne Spiele und Spiele, von denen ich gar nicht erst anfangen m&ouml;chte zu reden. In einigen habe ich versagt, in anderen andere und in seltenen F&auml;llen (Ja, dieser Fall tritt bei mir nur selten auf) haben wir diesen einen Spieler, der sich nicht an die Gegebenheiten anpassen will und deshalb trollt (vorzugsweise, weil er Mitte nicht bekommen hat). Gut, k&ouml;nnte man jetzt sagen, das liegt bestimmt an Premades oder daran, dass man einen schnelleren PC hat als andere oder an ganz anderen Gr&uuml;nden, es sollte trotzdem nicht passieren, dass jemand so fixiert auf eine Position ist, dass er diese in jedem Spiel spielen muss, weil er doch nichts anderes kann und nicht geforced werden m&ouml;chte. Aus diesem Grund war ich auch f&uuml;r den Team Builder, weil dieser die Trollm&ouml;glichkeit zu eliminieren schien. Falsch gedacht! Ich hatte bald darauf ein Spiel, wo die Lanes festgelegt waren, wir ein Spiel gesucht haben und unser augenscheinlicher Support auf der Mitte zu finden war. Moment, bitte was? Ja, ganz recht. Er wollte uns klar machen, dass er sonst nie Mitte bekommt, weil diese nie requested wird und er deshalb Support eintr&auml;gt, weil die ja gesucht werden wie Atlantis. Als er dann nicht bekam, was er wollte fing er an, zu den Gegnern zu laufen und zu Tanzen, was den Gegnern einfache Kills erm&ouml;glichte und wir das Spiel in der 20sten Minute aufgaben. Nat&uuml;rlich haben wir ihn gemeldet, trotzdem sollte es so etwas nicht geben. Nat&uuml;rlich k&ouml;nnte man jetzt anmerken, dass wir ihm einfach die Lane h&auml;tten geben sollen, aber wir hatten keine Lust auf einen Zed-Support. Im Endeffekt n&uuml;tzt alles nichts: Es gibt nun mal diese Art von Spielern. Eine L&ouml;sung daf&uuml;r gibt es vermutlich auch nicht, da ein neues System auch wieder missbraucht wird. Aber das war jetzt viel negatives. Kommen wir doch zu sch&ouml;nen Dingen, wie die verschiedenen Spielmodi von League of Legends, welche Riot uns zeitgebunden anbietet. Es war viel vertreten: Von einem ehemaligen Bug, wo jeder den selben Champion spielen konnte &uuml;ber einen Spielmodus, welcher 6 Spieler in jedes Team quetschte bis hin zu einem Modus mit 80% Abklingzeitverringerung und keinen Manakosten. Dass viele der Spielmodi sehr beliebt waren, ist keine Frage. Mir stellt sich jedoch die Frage: Warum will jeder, dass diese Spielmodi permanent verf&uuml;gbar sind? Ist es nicht gut, zur&uuml;ckgehalten zu werden um genug Aufregung f&uuml;r das n&auml;chste Wiedererscheinen aufzubauen? Meine Meinung dazu ist: Doch, ist es. Sogar sehr. Ich glaube nicht, dass es besonders sinnvoll w&auml;re einen der Spielmodi (Beispielsweise URF) permanent verf&uuml;gbar zu machen, da nach einer Zeit die Luft aus dem Spielmodus ist und niemand mehr Lust darauf hat. Dies ist keine schwarze Magie, sondern erweiterte Marktstrategie kombiniert mit Psychologie-Tricks. Aber ich will euch hier nicht mit Psychologie zudr&ouml;hnen, weil ich wei&szlig;, dass es sowieso niemanden interessiert. Was ich damit sagen will, ist, dass die Spielmodiauswahl bei LoL sehr ausgekl&uuml;gelt ist und dies definitiv so bleiben sollte. Ihr habt ja auch nicht Lust auf jeden Tag Spaghetti, oder? ;) Bestimmt haben es einige schon gemerkt: Riot ist ziemlich spielerbasierend. Die meisten der Ideen sind von Spielern (Dazu z&auml;hle ich auch die Spieler im Riot-Team, nicht wahr Kengen? ;) ) und die Resonanz auf neue Champions ist &uuml;berragend. Oft werden neue Ideen f&uuml;r Champions gefunden, weil man etwas im Hintergrund von einem bestehenden Champion gesehen hat (Vel&#039;Koz) oder es ist einfach eine Skinidee, welche unglaublich dazu passen w&uuml;rde (Spaghetti-Monster Vel&#039;Koz), das meiste kommt von den Fans und das ist wirklich gut. Ich liebe Spiele mit Player-Input. Alles in allem ist das Spiel wirklich toll und ein entscheindender Bestandteil des Genres.\r\n\r\nKommen wir jetzt zur Community:\r\nMittlerweile gibt es viele Wege nach Rom bzw. viele Wege, wie die LoL-Community betrachtet werden kann. Au&szlig;enstehende bezeichnen sie als besonders toxic, innenstehende bezeichnen andere Spiele als nicht vergleichbar mit so einem guten Spiel. Auch gibt es viele Plattformen, wo sich die Community etabliert, wie zum Beispiel dieses Forum, Reddit oder YouTube. Ich picke mir jetzt die meiner Meinung nach schlechteste Community heraus: **YouTube**! Noch nie in meinen 12 Jahren als Spieler von Computerspielen habe ich eine Manifestation von Kindern in dieser Gr&ouml;&szlig;e &uuml;ber ein Spiel erlebt. Da ist die CoD-Community ein Witz gegen. &Uuml;ber Tipps, welche nichts bringen, Tutorial-Videos von unerfahrenen Spielern bis hin zu den Kindern, die ihr Lieblingsspiel verteidigen ist alles dabei. Nat&uuml;rlich besteht die Community nicht nur aus Kindern, ich extremisiere das hier nur ein bisschen. Jedoch ist es teilweise wahr. Es gibt viele Kinder in der Community. Manche sind echt in Ordnung aber die meisten sind Extremf&auml;lle. Aber es sind nicht die Kinder selbst, die diese Community auf YouTube &quot;verderben&quot;, sondern ihre Argumentation. Immer wieder lese ich, dass jemand sich dar&uuml;ber beschwert, dass er get&ouml;tet wurde, weil er gebaited wurde oder ihm nicht in einem 1v5 nicht geholfen wurde, jegliche Kritik &uuml;ber das eigentliche Team zul&auml;sst, aber sich verteidigt, dass er daf&uuml;r sicher nichts kann und dass das Team schuld ist, nicht er. Meiner Meinung nach sollte man wenigstens seine Fehler einsehen. Man sollte erkennen, dass man Fehler macht und daraus lernen. Vermutlich gibt es gar nicht so viele Kinder auf YouTube, sondern das sind lernresistente Spieler, die es einfach nicht verstehen und mit dem Kopf durch die Wand wollen &agrave; la Full-Glasscannon.  Aber genug davon. Ich will mich nicht beschweren. Die LoL-Community ist um einiges besser als andere Communities.\r\n\r\nFazit: Das Spiel ist wirklich, trotz Verbesserungsm&ouml;glichkeiten, ein echter Blickfang und ich werde es auch weiterhin spielen.\r\n\r\nDas ist meine bescheidene Meinung. Wenn ihr nicht damit einverstanden seid, dann k&ouml;nnen wir gerne dar&uuml;ber diskutieren. Ich bin da ziemlich offen und einsichtig.\r\n\r\nEuer Tower!","replies":[{"poster":"OrangeBubble","date":"2015-06-01T15:16:38.648+0000","up_votes":7,"down_votes":0,"body":"Kannst du mir einen Gefallen tun? Kannst du Absätze benutzen? Dann würde ich den Text lesen, aber so als Fließtext gehts nicht :s","replies":[]},{"poster":"E x o IB i T e","date":"2015-06-01T16:15:20.089+0000","up_votes":2,"down_votes":0,"body":"Text auch ohne(!) Absätze gelesen und ich muss sagen, ich stimme dir da vollkommen zu! Vorallem das spätere Beispiel mit der YT-Community hat gut gepasst, und finde ich war ein sehr gutes Beispiel. Aber wie schon erwähnt: LoL ist ein gutes Spiel, aber nicht perfekt. Selbiges gilt für die Community.\nÜbrigens finde ich es gut, das sich mal jemand soviel Zeit nimmt so einen Text zu schreiben und seine Meinung rauszuhauen. (Daumen-Hoch-Smiley xD)","replies":[]},{"poster":"Kiimahrii","date":"2015-06-02T18:58:33.527+0000","up_votes":1,"down_votes":0,"body":"Bin mal so frei auch meine Meinung zu äußern: \n\nIch finde das Spiel selbst ist hervorragend designt. Das tatsächliche, einzige Problem, worauf alle anderen basieren, ist folgender:\n\nDie Community ist gezwungen, als Team zu spielen. Dies ist nicht unbedingt schlecht, aber Sprache, Nationalität, Alter, Interessen, und besonders wie \"ernst\" man das Spiel nimmt bzw. was man erreichen möchte, fällt nicht nur völlig auseinander, sondern auch noch Anonym.\n\nGenau deshalb zieht die Community das Spiel selbst runter. Die gegenseitige Abhängigkeit um zum Erfolg zu kommen und die tatsache, dass nur ein Team gewinnen kann, tun alles andere als die tatsächliche Competition zu fordern. 95% der Community, wenn nicht sogar mehr, sind nunmal normale Spieler.\n\nWas übrig bleibt sind die Profis: diese haben das Vergnügen ihr Talent zu nutzen, gefordert von alle Menschen die an eSports interessiert sind und diese Profis, und auch nur SIE, sind die einzigen die eine Gemeinschaft als Gruppe bilden und nicht mehr voneinander \"Abhängig\" sind, sondern \"miteinander\" Spaß haben. \n\n\nMit den oben genannten Punkten erziele ich keine Kritik, ich bin nicht so gut im Ausdrücken. Aber worauf ich hinaus will ist folgendes:\n\n**Vergleichen wir eSports mit Fußball:**\n\nDie Maße ist davon begeistert, Geld fließt in Strömen und Nationalität, Sprache, Alter, etc. sind völlig irrelevant. Lediglich die gemeinsame Interesse besteht.\n\nJetzt ergeben sich folgende Unterteilungen:\n\n- diejenigen, die professionel für Cash spielen und ein Idol für den Rest der Welt sind\n_Diese haben alles, worauf alle anderen hinaus möchten. Spaß, Geld, Teamarbeit_\n\n- diejenigen, die die Sache ernst nehmen und ein Verein (hier in lol: Team) gründen/beitreten um aufzusteigen\n_Man beachte das es unzählige Faktoren für das Nichtgelingen gibt_\n\n- diejenigen, die meinen talentiert genug zu sein um ein Profi zu sein (zB Fanatiker)\n_Um die dafür nötige Leistung zu erbringen gibt es immer irgendetwas \"im Weg\" (ausreden)_\n\n- diejenigen, die es schön finden und gerne ein Teil sind, es selbst aber nicht so ernst nehmen, Spaß im Vordergrund\n_Hier zählen auch diejenigen, die Lernfähig sind_\n\n- diejenigen, die aufgrund einer Störung sich in keines der o.g. Gruppen zuordnen können und verzweifeln (Trolls, Hooligans)\n\n\n**Fazit:** Egal zu welche Gruppe man angehört, das Aufeinandertreffen gemischter Gruppen verursacht Probleme. Da sind welche die Spaß haben wollen und ein Loose akzeptieren könnten auch wenn sie ihr bestes geben, der Andere, der seine Ansprüche zu hoch setzt und ein Loose nicht akzeptieren kann und der andere, der Aufgrund einer schlechten Klassenarbeit nicht richtig dabei ist und gefeedet hat.. alle ziehen sich gegenseitig runter und am Ende gehören sie alle der letzten Gruppe an. Welcher Fußballverein wurde schon freiwillig ein wichtiges Spiel spielen, mit eine Person die bisher nur mit Freunden auf der Straße Fußball gespielt hat? Wie soll da Teamwork ohne Vorarbeit entstehen?\n\nAus meiner persönlichen Erfahrung:\n\nIch hab wegen dieses Spiel Freundschaften zerbrechen sehen. Ich habe eine Zeitlang ebenfalls zur untersten Gruppe gehört. Wichtig ist nur die richtige Einstellung. Zu finden was man erreichen möchte, wie man dieses Spiel spielen möchte, welche Gruppe man angehört möchte, und schließlich dafür auch etwas zu tun. Eine Mannschaft zum aufsteigen wird sich nicht durch deinen DuoQ Nachbarn ergeben (zumindest unwahrscheinlich). Spaß wirst du nicht mit jmd haben dessen Mutter ständig den Router ausschaltet. Alleine wirst du schon mal gar kein Spaß haben. Ich persönlich habe in LoL mein \"Fußball\" gefunden. Denn ich hasse Fußball. Aber ich liebe eSports. Ich bin ein Fan begeistert von den Profis, und spiele aus Spaß Freundschaftsspiele; nicht weil ich von mir selbst untalentiert zu sein, aber die Rankingladder zu fokusieren hat ergeben, das Seriosität und Scheitern nicht einfach nur kein Spaß machen, sondern negative Auswirkungen auf meinen Reallife haben. Heutzutage habe ich 1800 Wins nur in Normals (also gut 5-6000+ Spiele insgesamt) und vlt. eines Tages, werde ich nach Rankings streben. Aber ohne Übung, kein Meister.","replies":[{"poster":"Krypax","date":"2015-06-03T12:06:04.195+0000","up_votes":1,"down_votes":0,"body":"Ich finde es super was du da geschrieben hast und bin voll deiner meinung vielleicht findet riot daa ja irgendwann mal eine lösung denn das spiel ist meinen empfindens nach alleine nicht lange spielbar(habe zum glück meine community wo sich immer schnell nen 5er Team zusammenstellen lässt)  worauf ich hinaus will ist das du es mit deinen punkten gut triiffst und man sich am leute sucht die genauso spielen wie man selbst auch spielen will.\n\nMfg Panda und ich finde die community von lol zwischen inaktzeptabel und nicht so toll","replies":[{"poster":"Kiimahrii","date":"2015-06-04T10:55:18.833+0000","up_votes":1,"down_votes":0,"body":"Mal darauf zu erinnern das die öffentliche Chaträume seit Ewigkeiten gesperrt sind und sich absolut nichts in diesem Sinne getan hat.","replies":[]}]}]},{"poster":"SFG Deathstroke","date":"2015-06-02T09:09:27.884+0000","up_votes":1,"down_votes":0,"body":"Bei dem letzten Punkt mit der Community Stimme ich dir voll und ganz zu. \n\nIch möchte jetzt aber nicht speziell die Kinder ansprechen. Die gibt es fast in jedem spiel auch in den fsk 18 ;p Die stören mich eigentlich in LOL auch nicht, vielmehr dass viele spieler in den Spielen selber immer zuerst dem Team die schuld gegeben wird und man selbst den fehler nicht einsieht, sich entschuldigt und die sache ist gegessen. \n\n Ebenfalls negativ finde ich es wenn man einen Anfänger/ spieler der was neues lernt oder einfach noch nicht so gut ist zu tode flamet. Ich meine jeder hat einmal klein angefangen und anstatt dass man solche Leute fertigmacht sollte man sie ermutigen ihnen tipps geben sie akzeptieren und ich weiss auch dass diese negative haltung in der regel nur dazu führt dass Anfänger dann noch unsicherer werden und demendsprechend dann auch den Spass am Spiel verlieren. Jeder macht Fehler im Spiel es gibt keinen perfekten Spieler in LOL. \n\nIm allgemeinen bin ich mit unserer Community aber sehr zufrieden ich habe früher zu der ego-shooter community gehört und kann echt behaupten dass die unsere um ein vielfaches besser ist. \n\nAn diesem Punkt danke für deine Ehrliche Meinung die du hier für uns alle geschrieben hast meinen Respekt dafür. {{champion:35}}","replies":[]},{"poster":"The Tower","date":"2015-06-01T18:24:15.694+0000","up_votes":1,"down_votes":0,"body":"Ich nehm mir mal den Rat mit den Absätzen zu Herzen :D Ich schreib selten solche Texte, aber ich werds mir merken, danke ^^","replies":[]},{"poster":"SuperplexP","date":"2015-06-01T18:08:31.420+0000","up_votes":1,"down_votes":0,"body":"Zuallererst: Schöner Post, ABER: Absätze und Überschriften skalieren mit der Länge des Textes.\n\n\"Ein gutes Beispiel dafür bietet Dominion. Dominion ist an sich ein toller Spielmodus, welcher etwas Abwechselung in das Spiel einbringt, welcher aber seit ewiger Zeit vergessen wurde und immer noch das alte Design beinhaltet.\"\n\nSeh ich haargenau so. Inzwischen besitzen sowohl 3vs3 als auch Aram eigene Patchnotes, nur Dominion geht leer aus. Hier möchte ich auch noch in den Raum werfen, dass 3vs3 auch gerne mal eine Solo Rangliste gebrauchen kann. Ich würds dann zocken.\n\n\n\"Klar, dieser Modus ist auch heftig unterspielt\"\n\nDies liegt eben vor allem an oberem Punkt. Sämtliche Designmängel, Gameplayaktualisierungen, Quality-of-Life-Changes und punktuelles Championrebalancing, also alles was grade 3vs3 so populär gemacht hat fehlt bei Dominion.\n\n\n\"Ein anderer möglicher Kritikpunkt, wovon ich beinahe jeden Tag etwas mitbekomme, ist das Reportsystem. Es ist mir unklar, wie es genau funktioniert, und das sollte eigentlich nicht passieren.\"\n\nAuch hier stimme ich voll und ganz zu. Wenigstens Ban- und Restrictiongründe sollten einer Strafe beiliegen. Und das neue Tribunal aufzubauen dauert einfach schon viel zu lange.\nMehr Informationen über das System könnte aber auch zu einem gewissen Grad des Ausnutzens führen a la \"einen Report kann ich mir noch leisten, erst danach bekomm ich einen Ban\".\n\n\n\"Bestes Beispiel hierfür bin ich. Ich habe insgesamt 3 mal eine Meldung bekommen, dass ich wegen anzüglicher Sprache reported wurde, wobei ich eigentlich nie etwas in den Chat schreibe, außer meiner Lane und Fragen nach Ganks.\"\n\nHier gibts Infos drüber. Die Meldung sagt nur, dass man reported wurde. Gebannt wird man dafür trotzdem nicht, auch wenn natürlich extreme Grenzfälle vorkommen können.\n\n\n\"in seltenen Fällen (Ja, dieser Fall tritt bei mir nur selten auf) haben wir diesen einen Spieler, der sich nicht an die Gegebenheiten anpassen will und deshalb trollt\"\n\nDeshalb plädier ich auf enorme Strafen für ebensolche Trolls. Grade in Rankeds ist nunmal ein 0/10er Full Ap Nidalee Support (schon oft gesehen, leider viel zu oft *seufz*) deutlich schlimmer als ein Flamer, der normal spielt.\n\n\n\"Warum will jeder, dass diese Spielmodi permanent verfügbar sind? Ist es nicht gut, zurückgehalten zu werden um genug Aufregung für das nächste Wiedererscheinen aufzubauen?\"\n\nWar nicht Aram auch mal so ein Special-Mode? Und der hat immernoch ordentlich Feuer. Grade URF würd ich auch gerne permanent sehen wollen.\n\n\n\" Über Tipps, welche nichts bringen, Tutorial-Videos von unerfahrenen Spielern bis hin zu den Kindern, die ihr Lieblingsspiel verteidigen ist alles dabei.\"\n\nKann ich trotz ordentlicher Youtube-Aktivität nicht bestätigen. Hört sich aber echt lustig an. Kannst mir ja mal ein paar Links schicken. Insbesondere die Fail-Guides scheinen echt interessant zu sein.\n\n\n\"Die LoL-Community ist um einiges besser als andere Communities.\"\n\nEigenen Erfahrungen nach ist jede MOBA-Community und die Comm. von CS-GO besser. Was da noch drunter kommt? Ich hab keine Ahnung.\n\n\nMeine 50 cents.\n\nmfG Plexi","replies":[]},{"poster":"I love you Malon","date":"2015-06-01T16:51:50.977+0000","up_votes":1,"down_votes":0,"body":"Seid ihr alle Lesefaul? :D\n\nDas Spagetti beispiel war perfekt:\nAls URF wieder verfügbar war suchtete mein Freund und ich es tagelang und nach einer Woche hat es uns aufgeregt >.<\n\nImmer dieser Ezreal, dann war es wieder Nidalee, dann Shaco usw!\n\nGleiche Sache mit Weihnachten:\nWer will das schon jeden Monat haben? O.o\n\nIch hab den ganzen Text gelesen und es errinert mich an ein Deutschthema dessen Namen ich vergas.\nÄhnlichkeit mit der \"Rede\" ^^\nStimm dir in allen Punkten zu :3\nDer Titel war erschreckend :D\nDachte schon wieder so ein Flamerkiddie wird von nem Ekko verprügelt und heult sich die Augen nun im Forum aus xP","replies":[{"poster":"OrangeBubble","date":"2015-06-01T17:49:22.353+0000","up_votes":1,"down_votes":0,"body":"Ich lese längere Texte, nur keine Fließtexte ohne Absätze.\nIst ja nicht zu viel verlangt da ein paar Leerzeilen reinzuhauen, oder? o.o","replies":[]}]},{"poster":"erzi222","date":"2015-06-01T15:37:03.249+0000","up_votes":1,"down_votes":0,"body":"viel zu lang, dass liest niemand, ehrlich.\n\nbzw so unschuldig kannst aber net gewesen sein, du solltest um eine strafe bangen.","replies":[{"poster":"Nerkahl","date":"2015-06-01T17:22:58.320+0000","up_votes":1,"down_votes":0,"body":"wiso sollte es niamand lesen? was drin steht ist doch sinnvoll und auch berechigt.","replies":[]}]},{"poster":"Veezey","date":"2015-06-01T16:33:12.649+0000","up_votes":1,"down_votes":0,"body":"Mit Absätzen wäre der text wirklich leichter zu lesen xD\n\nIch stimme dir Größtenteils zu. Das Reportsystem ist nicht so ausnutzbar wie du glaubst. Wie du schon gesagt werden die Chats überprüft. Wird da nichts gefunden, wirst du auch nicht bestraft egal wie oft du reportet wurdest. Sollte dennoch ein Fehler auftreten und du wirst fälschlicherweise bestraft, kann man sich immer noch an den Support wenden.\n\nZu den Funmodi kann ich nur sagen: Sicher wäre es nicht sinnvoll die Modi dauerhaft zu integrieren, aber dennoch sollten sie öfter kommen als nur ein mal im Jahr. ^^","replies":[]},{"poster":"haha weed lol xd","date":"2015-06-01T16:11:03.634+0000","up_votes":1,"down_votes":0,"body":"Die beste Community hat \" Dark Souls \" ! ! !","replies":[]},{"poster":"Kaitri","date":"2015-06-01T15:33:26.207+0000","up_votes":1,"down_votes":0,"body":"tl:dr\nabsätze :D","replies":[]},{"poster":"Revilous","date":"2015-06-01T15:30:41.600+0000","up_votes":1,"down_votes":0,"body":"ohne Absätze lese ich diesen Text nicht!","replies":[]},{"poster":"KEEYAY","date":"2015-06-01T17:34:05.898+0000","up_votes":0,"down_votes":0,"body":"Tja \"Voll in Ordnung\" führt :D","replies":[]}]}