{"poster":"94469 Marksman","date":"2016-05-26T11:56:56.345+0000","title":"Das Aufsteigen ist viel zu schwer.","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":7,"body":"Bin momentan in Silber 1 (Main adc) versuche wieder in Gold zu kommen aber da ich immer 1 Win 1 Loose 1 Win 1 Loose usw. habe komme ich nicht weiter.\r\n\r\nSo sieht das etwa aus:\r\n\r\n1.Win: Ich stehe 15/2 \r\n1.Loose: Ich stehe anfangs 3/1 dann kommt der gegnerische Midlaner auf meine Lane der schon 8/0 steht\r\n2.Win ich stehe 13/3\r\n2.Loose: Alle Lanes verlieren au&szlig;er meine.\r\n3.Loose: Ich habe einen afk in meinem Team\r\n4.Loose: Ich verliere weil ich einen Mage support habe mit dem ich nichts anfangen kann\r\n3.Win: Ich stehe 10/2 \r\n5.Loose: Mein Team surrendert einfach obwohl wir das gewinnen k&ouml;nnten.\r\n6.Loose: Die Gegner sind 4er Premade wir haben keine Premades.\r\n7.Loose: Ich verliere meine Lane, Jungler kommt nicht ganken.\r\n\r\nWenn ich durch 1 Win nur 20 LP bekomme und durch 1 Loose wieder 19 abgezogen bekomme wie soll ich dann aufsteigen wenn 90% meiner verlorenen Spiele wegen meinem Team sind.\r\n\r\nNat&uuml;rlich sind die Spiele jetzt nicht alle genauso wie ich sie genannt habe, aber sehr &auml;hnlich.\r\n\r\nIch habe auch gemerkt dass mein Team mich noch nie gecarried hat ich muss immer einen guten Score haben, um zu gewinnen.\r\n\r\nKann Riot nicht irgendwas machen, dass wenn man eine Loosing Streak hat, dass man weniger Punkte abgezogen bekommt?","replies":[{"poster":"SKT T1 1ND3R","date":"2016-05-26T17:13:15.953+0000","up_votes":5,"down_votes":0,"body":"***","replies":[{"poster":"ü ö","date":"2016-05-26T18:02:21.913+0000","up_votes":2,"down_votes":0,"body":"Gut erklärt, ob das helfen wird darf leider trotzdem bezweifelt werden..","replies":[]}]},{"poster":"Revilous","date":"2016-05-26T12:42:17.878+0000","up_votes":1,"down_votes":1,"body":"Mit schlechten Stats zu gewinnen wäre ja auch ein bisschen Einfach oder? Natürlich braucht man einen guten Score um zu gewinnen oder hast du schonmal ein Team gewinnen sehen, dass mit 20 Kills hinten liegt?\n\nIn der History sieht man, dass du nur gewinnst, wenn du gute Stats hast und genau so soll es doch auch sein--\n\nÜbrigens kannst du nicht aufsteigen wenn du immer die Schuld auf andere abschiebst und dich selbst nicht verbesserst..","replies":[{"poster":"94469 Marksman","date":"2016-05-26T13:12:34.215+0000","up_votes":1,"down_votes":1,"body":"Es kann aber nicht meine Schuld sein wenn meine Top und Midlane nach 10 Minuten schon 0/5 stehen...","replies":[{"poster":"OT Riku","date":"2016-05-28T07:05:16.574+0000","up_votes":1,"down_votes":0,"body":"Warum kannst du dann nicht nach 10 Minuten schon 5/0 stehen ?\nEs gibt immer spiele die man nicht gewinnen kann. \nAber zu sagen du verlierst immer wegen deinem Team ist gelogen.\nDann müsstest du ja jedes Spiel Positiv stehen und das tust du auch nicht.","replies":[]}]}]},{"poster":"Chri","date":"2016-05-27T07:28:00.086+0000","up_votes":1,"down_votes":0,"body":"es gibt schon diese aufstiegshilfe, aufsteigen ist 100% nicht schwer wenn du gut genug spielst meiner meinung hat riot das diese season zu einfahc gemacht mit der aufstiegshilfe","replies":[]},{"poster":"Spicavius","date":"2016-05-26T17:22:03.144+0000","up_votes":1,"down_votes":0,"body":"http://boards.euw.leagueoflegends.com/de/c/champions-gameplay-de/W5Equaw9-was-ist-nur-los-im-low-elo\n\nWürde dir diesen Thread hier empfehlen mal zu lesen. Vllt sind da hiflreiche Tipps für dich dabei","replies":[]},{"poster":"dat Zoidberg","date":"2016-05-26T13:38:47.489+0000","up_votes":1,"down_votes":0,"body":"Sofern deine Winrate höher als 50% ist wirst du früher oder später auch aufsteigen. Das Problem ist, dass es ewig dauert wenn man nicht jeden Tag ein Dutzend Ranked Spiele bestreitet.","replies":[]},{"poster":"SeaHorseCalamity","date":"2016-05-26T13:29:48.065+0000","up_votes":1,"down_votes":1,"body":"Das System ist ganz einfach: Es werden 10 Spieler mit ähnlicher MMR ausgesucht und zufällig auf 2 Teams verteilt. Das reicht shcon um zu wissen: Die Gegner sind nicht immer besser als dein Team, sondern statistisch glech gut. (Die größten ungereimtheiten gibt es hierbei im mittleren Silberbereich, weil da die Placements anfangen)\n\nSomit bleibt nur eine Variable übrig, die über den Verlauf deiner Games etscheidet: DU.\nBist du besser als der Durchschnittsspieler in dem Game gewinnst du mehr Games als du verlierst. Steigst also auf.\nBist du schlechter, steigst du ab.\nTrolls, Afks, Ragequits etc. gibt es auch im Gegnerteam, die hindern dich also auch nciht am Aufsteigen.\n\nRein Mathematisch sind die Niederlagen übrigens zu 80% der Fehler des Teams. (meine einfache Rechnung, da 4/5 Spielern im Team nicht du sind, ohne berücksichtigung sämtlicher Fakten)","replies":[]}]}