{"poster":"Asudurga","date":"2017-08-11T15:53:24.421+0000","title":"Riot cancelled my billing agreement? Help!","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"So just as the arcade event comes around, I find out I am unable to use Paypal to pay for what I want from Riot. This is due to my billing agreement with them being cancelled BY Riot on August 10th. I sent a support ticket to no reply and I have gotten no help from other sources on how to uncancel by billing agreement. \r\n\r\nI'm also left at a disadvantage being unable to call due to distance charges and my personal smartphone having no signal to call.\r\n\r\nhttp://i.imgur.com/r8v0dVu.png","replies":[{"poster":"Broporo","date":"2017-08-11T21:40:54.676+0000","up_votes":1,"down_votes":0,"body":"That type of error specifically means that Paypal is having troubles processing the payment, possibly due to the billing agreement being canceled if it was. Those agreements may be automatically canceled if you change the associated email, and changing the password might have disabled it as well. Let me know if that's the case or not!","replies":[{"poster":"Asudurga","date":"2017-08-11T21:46:38.681+0000","up_votes":1,"down_votes":0,"body":"Nope, it's none of those. Same E-mail and I only changed my password which of course was verified as an attempt to fix the issue.","replies":[{"poster":"Broporo","date":"2017-08-12T00:35:25.608+0000","up_votes":1,"down_votes":0,"body":"Straaaaange. I'm not entirely sure what might have happened with that billing agreement (billing issues aren't *quite* my forte), so go ahead and hit up our billing team in a [**ticket**](https://support.riotgames.com/hc/en-us/requests/new). They'll be able to let you know what might have gone wrong and how to prevent it in the future!","replies":[{"poster":"Asudurga","date":"2017-08-12T01:25:00.589+0000","up_votes":1,"down_votes":0,"body":"I hit up a support ticket last night, still nothing.","replies":[]}]}]}]},{"poster":"Valeeva","date":"2017-08-11T19:20:02.874+0000","up_votes":1,"down_votes":0,"body":"So it removed your automatic \"one-click\" payment.\nYou should still be able to pay for your RP manually by logging in fully instead of automatically.","replies":[{"poster":"Asudurga","date":"2017-08-11T20:21:10.047+0000","up_votes":1,"down_votes":0,"body":"Nope, it then just tells me that it can't log me in. I can log in normally just fine as I said, but through the client I can't. Even if I transferred funds, I can't log in to use them.","replies":[]}]}]}