{"poster":"Act Panzer","date":"2015-06-02T04:16:27.498+0000","title":"¿Un buffeito a Shyv? Lo digo con humildad.","subforum":"Charlas Generales","up_votes":9,"down_votes":7,"body":"Shyvana sigue siendo un personaje no tan convincente para rankeds o en general el competitivo, siendo un tanque tiene escaso cc, que radica principalmente en su R que tampoco es tan trascendente en las tf (aparte si fallas, quedas totalmente despocionado). En top rinde m&aacute;s que en jungla, al no tener un tan efectivo gankeo. Es &iacute;tem dependiente, si no tiene una espada del rey arruinado o mazo de hielo, perseguir a un objetivo se vuelve frustrante. Y su pasiva es sumamente pobre, otorga 5/10/15/20 de armadura y mr, que aunque se duplican en forma de drag&oacute;n, sigue siendo poco en comparaci&oacute;n con otros tanques. Otro tanque como Garen, solo la pasiva de su W la otorga con un punto 30% de armor y mr, antes J4 con su E 22 de armadura, la W de amumu, etc. La E de shyvana, si bien es cierto sirve para hacerle un poco m&aacute;s de da&ntilde;o al enemigo con ataques b&aacute;sicos, si un enemigo se va con poca vida depu&eacute;s de una tf, no sirve tirarle la E porque casi no hace da&ntilde;o, y lo peor es que en forma de drag&oacute;n la E a pesar de estar en forma de cono, tiene menos alcance. En fin, para ajustarla al meta actual le hacen falta unos peque&ntilde;os buffeitos opino humildemente.\r\n\r\nPD: antes de dar tu dedito abajo, o decir &quot;na, no hace falta nada&quot; &quot;est&aacute; rota&quot;, agradecer&iacute;a tus argumentos.","replies":[{"poster":"XVII The Star","date":"2015-06-02T05:10:07.524+0000","up_votes":8,"down_votes":2,"body":"(+1) Bien argumentado, entre comillas tu post.\nPensaba darte un negativo, pero la gente perdería interés en este post y me parece que podría salir un thread bastante interesante de todo esto.\nSin embargo Shyvana está muy bien donde está ahora, sólo que su enfoque es distinto.\nNo es el tanque de cc que te agarra y no te deja escapar, ni es el que puede ser muy molesto en tf, ni el que mas se cura.\nShyvana es un campeón de desafío y protección, es tan fuerte que pocas veces alguien te ganará si se te lanza en el carril, si tuviera un enganche sería demasiado roto, ya que en forma humana su rol es de duelista innato.\nAquí va la parte de que Shyvana es un campeón \"objetodependiente\" lo cual está bien, es parte del campeón. No es un Pantheon o un Fizz que tiene un Early Game tan brutal que no depende de los objetos que le compres, puedes empezar con wards y terminará matando sí o sí en un intercambio.\nShyvana es un campeón de late con un enfoque claramente instaurado y, me atrevería a decir que **Shyvana es uno de los campeones mas balanceados del juego**, de eso estoy casi seguro.\n\nAcá te explicaré lo que planteas y lo refutaré con mis argumentos, ya que uso bastante a la hija del dragón.\n\n**1ro: \"No es tan convincente\"**\nDiste justo en el clavo mi buen amigo, Shyvana es un campeón con picos de poder muy predecibles cuando se le usa sin la experiencia suficiente, además su winrate oscila entre el 53% y el 47%; lo cual es bastante bajo comparado con el resto, fuera de todo lo que mas impacta es su baja popularidad, lo que no debería importarte, yo he jugado partidas magistrales con Galio y Taric, no usado no siempre es más débil, mas bien incomprendido.\nY en base a esa incomprensión es que los invocadores que se dan el tiempo de aprender a fondo al campeón en sí logran carrear partidas, sin embargo no hacen la pelea contra los miles de invocadores que escogen Shyvana sin saber o para probarla, y como no está rota, mas bien balanceada, su winrate decae.\n\n**2do: \"Su R no es tan trascendente en Teamfigths\"**\nTotalmente equivocado, para explicartelo volveré un poco atrás en tu post cuando dices que no entiendes el enfoque de Shyvana como un tanque, ya que no se cura, ni tiene toneladas de CC.\nBien, el enfoque de Shyvana es un tanque de daño, si, escuchaste bien, es un tanque con una capacidad feroz de aguantar e infligir daño, sería como una especie de Xin Zhao, pero en vez del CC, le ponen mas daño.\n¿Para que sirve la R de Shyvana entonces? Fácil, para **juntar a los enemigos**, esto es esencial dentro de las mecánicas de Shyvana gracias a su ridículo poder de área de efecto, cuando está en forma de dragón se transforma de, duelista antitanques, a un ultratanque capaz de infligir ridículas cantidades de daño de área.\nMe explico, cuando la **E** *Aliento de fuego* es lanzada mientras Shyvana está bajo el efecto de *Descendiente del dragón*, su R, esta deja marcados a todos los enemigos dentro de un área, por lo cual, al lanzar la **Q** ***Mordida Gemela* aplica TODOS LOS EFECTOS DE IMPACTO EN ÁREA, incluyendo el brillo.** Entonces le estarás sacando una cantidad grosera de daño, más un porcentaje ridículo de su vida máxima y dejandolos a todos juntos para que el mago lance su hechizo mas poderoso. ¿El ulti de Shyvana no sirve en tf? Por favor.\nLuego no está de más recordar que su **W** en forma de dragón deja quemándose el suelo, lo cual es una capa solar colocada en un punto del mapa que crece y crece mientras más peleas.\n\n**3ro: \"Su E no sirve para rematar\" ; 4to \"Es dependiente de los ítem\"**\nPrimero... ¡¿QUIÉN DIABLOS LANZA LA E DE SHY PARA REMATAR?¡ Esta debería ser tu arma de iniciación, maximiza ridículamente el daño de tus autoataques, especialmente contra objetivos tanques.\nSegundo, por supuesto, los objetos hacen a Shy lo que es.\nSu **Pasiva** te permite que sólo sea necesario buildearle vida, lo que te deja bastantes espacios vacíos en su build, Su **W** es una capa solar y su **E** es una *Espada del Rey Arruinado*.\n\nGracias por tomarte la molestia de crear este thread, espero que mi comentario te haya servido.","replies":[{"poster":"Act Panzer","date":"2015-06-02T08:19:00.706+0000","up_votes":5,"down_votes":0,"body":"Primero que nada, agradezco tu buen ánimo y disposición para responder, últimamente no se ve mucho en LAS.\n\nEstoy muy de acuerdo con tus argumentos, muy bien expuestos y fundamentados, te diría \"me retracto, tienes toda la razón\", y en efecto sería así si tus argumentos los calzas en el competitivo, en los torneros regionales y mundiales; donde shyvana efectivamente está balanceada. \nLamentablemente, en el escenario actual, en las clasificatorias Solo Q, el trabajo en equipo está subestimado, o mejor dicho es casi nulo. No hay planificación de estrategias, y se debe simplemente al hecho de que los jugadores están en lugares diferentes, o simplemente les acomoda jugar solos, en su carril, y tener kills y recurrir a tf para terminar la partida, donde por supuesto hay un componente de trabajo en equipo pero mucho menos que en el competitivo oficial.\nTomando en cuenta esto, Shyv, no es del tanque tipo del meta actual que tiene también un potencial destructivo si es bien ocupado, me refiero a Sejuani, Garen, Mundo, Zac, Skarner, entres otros. En comparación a estos Shyv está en desventaja, a eso me referí. Y en un escenario así, o nerfeas a todos los campeones tanques que tienen buen CC y potencial destructivo para que estén balanceados, o buffeamos a nuestra querida Shyv para hacerla más acorde al meta actual.\n\nY en cuanto a lo que dijiste amigo sobre la Ult para juntar, su E para pegar básicos con %, + su Q en área + su W que hace daño explosivo, estoy de acuerdo, muy, pero insisto, en las clasificatorias Solo/Duo esas características se ven mermadas porque no siempre lo lograrás, pues no siempre hay teamwork. El daño de shyv en early y late dependiendo de sus objetos, puede ser mucho, pero sigue siendo demasiado fácil para tu contrincante escapar de ti, al no tener shyvana algo de CC aparte de su Ultimate para detener a un objetivo particular, como otros campeones tanques.\n\nEn fin amigo, quizá todos miramos desde distintas perspectivas el balance de un campeón. Y aunque Shyv está balanceada necesita buffs para equipararse al meta actual y a los demás tanques. \n\n¡Agradezco el tiempo que tomaste para responder, saludos!\n\nP.D: hace unos parches atrás en el PBE, habían subido el daño de la E de Shyvana hasta un max de 360 o 380 en nivel 18. Dijeron que el cambio aún no está preparado, asi que se mantiene el daño max de 220 en nivel 18 actualmente (lo cual sigo encontrando que es bajísimo). Si hubiera sido diseñado simplemente para dar básicos más dañinos, no le hubieran puesto tanto alcance a la E.\nEs mi humilde opinión. Gracias!","replies":[{"poster":"Samun","date":"2015-06-02T14:59:46.590+0000","up_votes":1,"down_votes":0,"body":"Es que el juego no se balancea acorde al SoloQ. Se balancea acorde a nivel profesional de equipos. Shyv esta en una posicion excelente actualmente. Te lo digo como un Shyv Main en Top. Hay pocos que puedan pelearle y si farmeas lo suficiente te volves un muro de acero (no al nivel de Sion) con suficiente daño para borrar al ADC o APC enemigo. Igual si revisas el PBE le buffearon (no quiere decir que pase al Live) la W y estuvieron viendo un par de cambios para la R y la E hace unos parches. El rango en la E es para last hitear si tenes una linea dificil o zonear eficazmente al enemigo. Más de una vez he matado gente bajo torreta simplemente de pokear con la E. Tiene bastante daño en linea, sobre todo si se usa runas de Pen Mag.","replies":[{"poster":"Neo Gaussrik","date":"2015-06-02T15:45:29.103+0000","up_votes":2,"down_votes":1,"body":"Queria hacer notar que no, no balanceamos a nivel profesional de equipos.\n\nLa mayor parte de los cambios lo hacemos apuntados a jugadores expertos- en general nivel Platino para arriba. En ocasiones es necesario hacer ajustes para otras audiencias, como por ejemplo un campeon que este demasiado poderoso en ligas bajas, o un campeon que este demasiado dominante en competitivo, pero estos son la minoria de los cambios.","replies":[{"poster":"Tatsuya","date":"2015-06-02T16:11:13.519+0000","up_votes":1,"down_votes":2,"body":"ugh... entonces el nerfs como el ult de Zed fue juzgado por el criterio de nivelarlo para la audiencia de bajo nivel?.","replies":[{"poster":"Neo Gaussrik","date":"2015-06-02T16:29:55.476+0000","up_votes":3,"down_votes":0,"body":"No, ese cambio en particular fue para disminuir la confiabilidad de algunos patrones de juego de Zed, que estaban causando algunos problemas incluso a altos niveles.\n\nComo dije, los cambios apuntados a otros niveles de juego son muy infrecuentes.","replies":[]},{"poster":"snáke","date":"2015-06-02T16:27:37.714+0000","up_votes":1,"down_votes":2,"body":"Shyvana para mi tiene un buen mid game, decae al final porque escala de forma pobre. El problema es que si le das un cc algo tenes que sacarle y ese algo es daño, porque con el daño que hace si le dan un cc mas fuerte se puede transformar en el viejo renek (cosa q nadie desea)\n> [{quoted}](name=Tatsu Kun,realm=LAS,application-id=v7qsfXsE,discussion-id=h9NBhR4N,comment-id=00010000000000000000,timestamp=2015-06-02T16:11:13.519+0000)\n>\n> ugh... entonces el nerfs como el ult de Zed fue juzgado por el criterio de nivelarlo para la audiencia de bajo nivel?.\n\naudiencia de bajo nivel? lol que estamos hablando de la tv/radio? XD\nA zed lo nerfiaron porque era ridiculamente facil y no requeria ninguna habilidad escaparse o hacer plays...\nAdemas te recuerdo que tiene una fase de linea super facil, no tiene problemas de sustain y puede farmear a distancia si lo desea y a eso sumale que puede hacerle bullyng a la mayoria de los champs...","replies":[{"poster":"Tatsuya","date":"2015-06-02T16:32:19.009+0000","up_votes":1,"down_votes":3,"body":"¿es ironico no?, gente que opina que zed esta roto son oro para abajo.","replies":[]}]}]},{"poster":"Jade Fang","date":"2015-06-02T22:47:14.119+0000","up_votes":1,"down_votes":1,"body":"definitavente no tendrian que hacer cambios a campeones en ligas bajas... pobres lo que lo usan en altas .-.","replies":[]}]}]}]}]},{"poster":"Neo Gaussrik","date":"2015-06-02T14:03:22.682+0000","up_votes":4,"down_votes":0,"body":"Saludos, Act Panzer!\n\nEn mi opinion, Shyvana sufre en particular en dos etapas del juego- al comienzo, cuando le cuesta empujar la linea debido a su vulnerabilidad contra otros luchadores o contra campeones de rango, y al final, cuando sus bajos ratios de escalamiento la hacen crecer menos que su oponentes.\n\nIndependientemente de mi opinion, el equipo de diseño esta mas o menos de acuerdo contigo, asi que estan evaluando buffs para Shyvana. :)\n\nSuerte en tus partidas!","replies":[{"poster":"Funes7","date":"2015-06-02T14:37:24.877+0000","up_votes":2,"down_votes":0,"body":"¿La idea no es siempre que un campeon sufra en una de las etapas del juego y no en dos ?\n\nPor ejemplo un DR.mundo que sufra en early, pero en mid y late se vuelva un demonio inmatable... Entre otros.","replies":[{"poster":"Hwaxinghz","date":"2015-06-02T15:07:21.726+0000","up_votes":1,"down_votes":0,"body":"Para mi viene por ese lado, yo he visto porque en las ligas altas se pickea, en composiciones medias tanques, en early sufre un poco, pero ni bien llega a nivel 6 se vuelve bastante tanque y si la dejas armarse un poco después de haber hecho 1 o 2 kills en línea ya se vuelve bastante fuerte.\nSegún mi opinión es un campeón balanceado que requiere de la habilidad de uno como jugador para sacarle el máximo provecho, es algo obvio, pero si una Shyvana no es demasiado buena o no piensa en el verdadero potencial del campeón, en EARLY la va a pasar realmente mal y ya no es muy \"valiosa\" en Mid-Late, ya que ha perdido la oportunidad de armarse y si es demasiado tarde ya no va a resistir lo suficiente y no va a meter el daño que debería meter en una tf en área (mas allá de la resistencia al daño, un poco armada es brutal lo que quita con una E Q en forma de dragón en área).\nAdemás no quiero decir con esto \"Bah todos los campeones si se arman son buenos y te la tiras de pro\", porque no es cierto, una Riven, si tuvo mal EARLY y no logró kills ni farmear demasiado bien, en Mid y Late Game es mas Useless que asesina (como se suele ver en los vídeos). En cambio una Katarina con un solo ítem, ya sea farmeando y muriendo 30 veces, saca Eco de Luden y ya se deletea a uno, cosa que no pasa con Shyvana, no deletea y tampoco podrá resistir demasiado si no tuvo un buen early.\nPongamos el ejemplo de que se enfrenta contra Vladimir, es un enfrentamiento muy difícil, lo mas probable es que Shyvana se quede atrás y no pueda ser tan fuerte como se estima que fuese, en ese caso lo más inteligente que uno puede hacer es Roamear, cambiar línea con el Mid, pero casi siempre eso no se puede hacer y todos sabemos lo jodido que es enfrentarse uno usando un melee contra un Mago y encima con un sustain impresionante como lo es Vladimir (como ejemplo), ni le vas a mosquear.\n\nCreo que si pickea uno a Shyvana debe estar seguro de que no vas a ser el único tanque de la partida porque en el caso que te valla mal en línea, no vas a servir demasiado en tf ya que te deletearán rápido. Es preferible estar en una composición Tanque (Shyvana)-Asesino (Zed, Yasuo, Talon, LeBlanc)-Tanque (Maokai, Nautilus, Hecarym)-Utility (Karma, Nami, Janna, Thresh)-Carry (Tristana, Caitlyn, Vayne, Graves, Sivir) (top-mid-jg-sup-adc respectivamente).","replies":[]}]}]},{"poster":"Nunca Pierdo","date":"2015-06-02T22:56:24.333+0000","up_votes":2,"down_votes":0,"body":"por mas daño que le aumenten, si no le agregan ALGO de cc o un rework de habilidades, la gente no va a usarla, es un cono corriendo no tiene ningun peligro una shyvana 0 cc, si la e sloweara o algo asi o pasara algo como en brand que cuando esta prendido fuego y tiras la q stunea, pero ni eso, merece un rework o que le addeen cc","replies":[{"poster":"Fancer","date":"2015-06-03T00:35:29.355+0000","up_votes":1,"down_votes":0,"body":"Completamente de acuerdo, arreglar su E y darle una pizca de CC estaría muy bueno. Saludos.","replies":[]}]},{"poster":"Alternis","date":"2015-06-02T14:21:07.812+0000","up_votes":2,"down_votes":0,"body":"yo siempre que estaba gratis la usaba y hace poco que la rebajaron la compre y sufre muchisimo pero como dijeron arriba la van a bufear :3 yo note que armarla tanke tanke no rinde pero armarle trinidad y espada del rey arruinado y despues todo tanke pegas de lo lindo ademas de que es un campeon experto en hacer split push y tiene una ulti  bastante buena si la metes bien .{{champion:102}}","replies":[]},{"poster":"ZorroDorado","date":"2015-06-02T14:08:07.062+0000","up_votes":2,"down_votes":0,"body":"Según tengo entendido anunciaron en el PBE que van a buffearla, asi que pronto podremos ver a mas {{champion:102}}  en acción! :D","replies":[{"poster":"Fancer","date":"2015-06-03T00:34:13.530+0000","up_votes":1,"down_votes":0,"body":"Así es amigo, pero solo hicieron un cambio a su W, le bajaron el crecimiento por AD y ahora cada vez que pega un básico inflinge daño mágico adicional, parecido a su E.\nCreo que aún falta que mejoren su E, o alguna pizca de CC. Saludos.","replies":[]}]},{"poster":"Dark Helel","date":"2015-06-02T04:55:10.170+0000","up_votes":2,"down_votes":1,"body":"ya la buffearon en el pbe,asi q espera el prox parche....","replies":[]}]}