{"poster":"JG Stitch","date":"2015-12-17T19:38:57.325+0000","title":"[Graunacht-Kurzgeschichte] Icathias Ruf","subforum":"Community-Kunstwerke","up_votes":1,"down_votes":0,"body":"Hallo, wie auch die meisten anderen hier, die ihre Geschichten bereits gepostet haben, geh&ouml;re ich nicht zu den gl&uuml;cklichen Gewinnern, aber ich bin ziemlich zufrieden mit meiner Geschichte und m&ouml;chte sie euch deswegen hier nun auch zeigen. Wie man evtl. sehen kann ist es nur ein Ausschnitt einer gr&ouml;&szlig;eren Geschichte. Deshalb w&uuml;rde ich mich &uuml;ber Meinungen freuen und entsprechend dann auch vlt noch die Vorgeschichte verschriftlichen : )\r\n\r\n**Icathias Ruf**\r\n\r\n\r\nDurch die pechschwarzen Wolken &uuml;ber den Schatteninseln, die den Schein des Vollmonds dieser Nacht vollkommen schluckten, zuckten grelle Blitze am Himmel. Es hatte den Anschein, als w&uuml;rde alles schlafen, doch im Nebel dieses Landes w&auml;re dies undenkbar gewesen, so auch nicht diese Nacht. Zwischen den Ruinen erhob sich ein Gem&auml;uer von beachtlicher Gr&ouml;&szlig;e. Die Zeit war auch an diesem nicht spurlos vor&uuml;bergegangen, teilweise war das Dach eingest&uuml;rzt und Fenster waren eingeschlagen. Doch im Zentrum befand sich ein gro&szlig;er Rundbau, welcher von nahezu unbeschadeter Sch&ouml;nheit gl&auml;nzte. Eine unangenehme Ruhe herrschte hier an diesem Ort, doch, wer ganz genau hinh&ouml;rte konnte das Rascheln unvorstellbarer Wesen in den B&uuml;schen h&ouml;ren, die nur darauf warteten sich auf ihre unvorsichtige Beute zu st&uuml;rzen. Man k&ouml;nnte meinen, dass sich diese Nacht in keinster Weise von all den vorangegangenen N&auml;chten auf den Schatteninseln unterschied, denn niemand ahnte, dass hier in dieser einen sich die Zukunft von Valoran und ganz Runeterra entscheiden w&uuml;rde.\r\n\r\n&bdquo;Ich h&auml;tte nicht erwartet, dass Ihr mich so lange warten lassen w&uuml;rden&ldquo;, schallte die dominante Stimme einer Frau durch den hohen Raum. \r\n&bdquo;Ich habe keine Eile, denn wir sind zeitlos. Es gibt Orte, an denen keine Zeit existiert&ldquo;, es klang, wie die Stimme eines Mannes, doch etwas war sonderbar, es war, als w&uuml;rde jemand oder eher etwas anderes durch ihn sprechen. Ein kleines bizarr wirkendes Wesen trat aus dem Schatten des Ganges. Es hatte vier kurze stelzenartige Beine, welche so spitz waren, als w&auml;ren es seine Waffen und an seinem Kopf leuchteten drei kreisrunde Augen. Unschwer war zu erkennen, dass es sich dabei um ein Wesen nicht aus dieser Welt handelte. Hinter diesem Tierchen betrat die Quelle der Stimme den Raum. Auf den ersten Blick konnte man anhand seines fremdartigen violetten Gewandes erkennen, dass sein Herkunftsort ein anderer war. Bis auf die leuchtend blauen Augen und die wenigen braunen Haare, die unter seiner Kapuze zum Vorschein kamen, war sein Gesicht vollkommen verh&uuml;llt. Sein Blick folgte der Treppe, die sich vor ihm in die H&ouml;he erstreckte, an deren Ende ein gewaltiges, steinernes Podest war, welches von gemusterten S&auml;ulen geschm&uuml;ckt wurde.\r\nSie sa&szlig; auf dem Thron aus Marmor inmitten des Podests. &bdquo;Meine Geduld allerdings ist zeitlich begrenzt und an diesem Ort ist Zeit mehr, als nur ein Ger&uuml;cht&ldquo;, entgegnete sie mit gereiztem Ton. Die wei&szlig;en, langen Haare fielen ihr &uuml;ber die Schultern und ihre Augen funkelten mit dem Edelstein ihres Kopfschmucks um die Wette. \r\nW&auml;hrend das kleine Wesen unten an der Treppe stehen blieb begann er die Treppe zu erklimmen, es war allerdings mehr ein t&auml;nzelndes Schweben, als ein Gehen, als w&uuml;rde die Schwerkraft auf ihn keinerlei Einfluss haben.\r\n&bdquo;Prophet, sagt mir, wieso habt Ihr ausgerechnet mich ausgew&auml;hlt&ldquo; , ihre Stimme war eiskalt und nahezu emotionslos. Ja Emotionslos, sie war eine der wenigen Personen, die nur eine Sorte davon kannte und zwar Wut.\r\n&bdquo;Ich habe die Geschichten geh&ouml;rt. &Uuml;berall, nicht nur in Shurima, erz&auml;hlt man von der dunklen Herrscherin und ihrer fliegenden Festung &uuml;ber Ionia&ldquo;, er setzte sich neben sie auf die Armlehne des Throns.\r\n&bdquo;Findet Ihr nicht, dass es ein wenig gewagt war nur anhand von Geschichten, die man sich erz&auml;hlt zu handeln? Unter anderen Umst&auml;nden h&auml;tte ich euch m&ouml;glicherweise sogar get&ouml;tet.&ldquo;\r\nEs war schwer zu erkennen, ob er l&auml;chelte, da der Gro&szlig;teil seines Gesichts nach, wie vor nicht zu sehen war. \r\n&bdquo;Ich kam in dem Wissen, dass ich mein Ziel erreiche&ldquo;, ruhig und vollkommen sorglos kamen ihm die Worte &uuml;ber die Lippen.\r\n&bdquo;Ach ja? Es gab viele die dies behaupteten und nun teilen sich ihre Gr&auml;ber die Friedh&ouml;fe Ionias.&ldquo;\r\nAls wolle er ihr mit dem Blick in ihre Augen antworten wandte er sich ihr zu.\r\n&bdquo;Nein, ich bin keiner diese leichtgl&auml;ubigen J&auml;mmerlinge, denn ich habe es gesehen. Ich werde nicht sterben, nicht bevor ich es geschafft habe, meine Visionen sind eindeutig, von daher war es nie eine Option zu dieser Zeit durch Eure Hand zu sterben. Wobei wenn es doch so gewesen w&auml;re, dann w&auml;re ich immerhin mit dem Gedanken dahingeschieden durch eine Person zu sterben, die Verstanden hat wahre Macht zu nutzen.\r\nEin leichtes l&auml;cheln zeichnete sich auf ihrem Gesicht ab. &bdquo;Viele haben es &uuml;ber die Jahre gewagt mit ihren W&uuml;nschen vor mich zu treten, doch keiner dieser W&uuml;nsche war so unerreichbar und dennoch reizend zugleich. Doch Eure Sorglosigkeit gegen&uuml;ber des Vorhabens finde ich immer noch ungew&ouml;hnlich.&ldquo;\r\n&bdquo;Ich bin in den letzten Jahren durch ganz Runeterra gereist, auf der Suche nach Verb&uuml;ndeten, die diesen absurden Plan unterst&uuml;tzen w&uuml;rden. Doch die meisten lehnten es ab, weil sie Angst hatten. Angst ist neben der Sterblichkeit die gr&ouml;&szlig;te Schw&auml;che, man kann noch so m&auml;chtig sein, wenn man nicht in der Lage ist diese zu nutzen ist man es nicht wert sie &uuml;berhaupt zu besitzen. Das ist der Grund f&uuml;r meine Sorglosigkeit, weil ich nur noch in dieser Welt f&uuml;r mein Ziel lebe und ich mir sicher bin es zu erreichen. So oft habe ich es vor mir gesehen und nur wenn meine Visionen real werden kann ich endlich zu meiner wahren Heimat. Sie ruft mich Nacht f&uuml;r Nacht und erinnert mich an meine Aufgabe. Meine Visionen haben es mir immer und immer wieder gezeigt. Es ist der einzige Weg und deswegen werde ich ihn gehen.&ldquo;\r\nStill lauschte sie seinen Worten und begann sich auszumalen, was sie erwarten w&uuml;rde.\r\n&bdquo;Eure wahre Heimat? Ihr meint die Leere?&ldquo;\r\n&bdquo;Gewiss, so ist es.&ldquo;\r\n&bdquo;Der Prophet der Leere bittet mich um Hilfe, wer h&auml;tte das gedacht. Aber Ihr sagtet, Ihr h&auml;ttet sie gesehen, zeigt mir, was Ihr begehrt.&ldquo;\r\n&bdquo;Auf Euren Wunsch&ldquo;, er stand auf, ging hinter den Thron, griff &uuml;ber den R&uuml;cken hinweg und legte eine Hand auf ihren Kopf. Seine Visionen gingen auf sie &uuml;ber, die meisten h&auml;tten behauptet es seien &uuml;ble Visionen, doch eben diese versetzten die dunkle Herrscherin in Staunen. Es zeigten sich hier Bilder einer zerst&ouml;rten Stadt in einer W&uuml;ste, eine dunkle Welt besiedelt von au&szlig;ergew&ouml;hnlichen Wesen und ein Portal.\r\n&bdquo;Gibt es au&szlig;er Euch &uuml;berhaupt Menschen, die das Gl&uuml;ck hatten dies zu sehen?&ldquo;\r\n&bdquo;Wenige und noch weniger, die es &uuml;berlebt haben, einer dieser wenigen ist Kassadin, er k&auml;mpft ebenfalls in der Liga der Legenden, manche nennen ihn daher auch den Leereng&auml;nger.&ldquo;\r\n&bdquo;Wieso ist er heute nicht hier?&ldquo;\r\n&bdquo;Kassadin hat nicht den wahren Wert von dem erkannt, was ihm offenbart wurde, er m&ouml;chte Runeterra vor der Leere bewahren&ldquo;, ein gewisses Ma&szlig; an Zorn schwang deutlich in den Worten mit.\r\n&bdquo;Auch wenn es l&auml;cherlich ist zu glauben, dass er dies schaffen k&ouml;nne, so hat er schon mehrmals versucht sich mir in den Weg zu stellen. Allerdings ist es unaufhaltsam, denn einige wenige sind schon hier.&ldquo;\r\nSie lachte laut auf. &bdquo;Das ist die Art von Schw&auml;che, die ich verabscheue, er hat diese Ehre nicht verdient, wenn er sich gegen seine Offenbarung stellt.&ldquo;\r\n&bdquo;So ist es.&ldquo;\r\nIhr Blick fiel auf das Wesen am unteren Ende der Treppe. &bdquo;Ist dies etwa...&ldquo;\r\n&bdquo;Aus der Leere.&ldquo; Er setzte sich wieder zu ihr. &bdquo;In Runeterra nennen sie viele Voidlinge. Sie handeln in den meisten F&auml;llen nicht eigenst&auml;ndig, doch haben sie die einzigartige Gabe einem Ruf zu folgen und somit die Grenze der Welten zu durchbrechen, zumindest f&uuml;r eine gewisse Zeit.&ldquo;\r\nNoch w&auml;hrend er am erz&auml;hlen war stand sie auf.\r\n&bdquo;Sagt mal, gibt es zur Zeit &uuml;berhaupt eine M&ouml;glichkeit in die Leere zu gelangen&ldquo;, die Muster der W&auml;nde hatten zwar ihre Zuwendung doch die Worte waren ganz alleine an ihn gerichtet.\r\n&bdquo;Keine, die zuverl&auml;ssig w&auml;re.&ldquo;\r\n&bdquo;Ich m&ouml;chte sie sehen. Ja ich m&ouml;chte sie mit meinen eigenen Augen sehen, es ist unfassbar, was all den k&uuml;mmerlichen Wesen Runeterras verborgen bleibt, deren Verstand so begrenzt ist.&ldquo;\r\nEr schaute ihr nach. &bdquo;Ich habe Ihnen den Weg gezeigt und gemeinsam w&uuml;rden wir das schaffen. Andererseits hei&szlig;t es seine Heimat zu verraten.&ldquo;\r\n&bdquo;Eine Heimat zu verraten, die dich verbannt hatte ist nicht schwer. Lange habe ich die Magie dieser Welt studiert, in dieser Zeit sagten viele, dass auch Magie Grenzen habe, ich wollte es nie glauben, aber was ist wenn die einzige Grenze jene ist, die Runeterra von der Leere trennt.&ldquo;\r\n&bdquo;Die Antwort ist so nah und dennoch im Moment zu fern um nach ihr zu greifen, aber glaubt mir schon bald werdet ihr die Gelegenheit haben.&ldquo; Er stand auf und ging in ihre Richtung, blieb jedoch hinter ihr stehen. &bdquo;Icathia ist der Schl&uuml;ssel.&ldquo;\r\n&bdquo;Ich geh&ouml;rte zu den Personen, die Icathia lediglich f&uuml;r einen Mythos hielten, doch wenn es stimmt, was ihr sagt, dann ist diese Stadt also die Verbindung zur Leere.&ldquo;\r\n&bdquo;Es g&auml;be keinen Grund zu l&uuml;gen, ich war dort, ich habe sie gesehen und bin somit einer der wenigen, der genau wei&szlig;, wo die &Uuml;berreste sind.&ldquo;\r\nSie drehte sich zu ihm um. &bdquo;Wie genau habt Ihr eigentlich vor Icathia wieder aufzubauen?&ldquo;\r\n&bdquo;Icathia ist eine der wenigen Verbindungen zur Leere in Runeterra, doch durch die Zerst&ouml;rung ist diese nur sehr unzuverl&auml;ssig. Das Portal &ouml;ffnet sich nur sehr selten und das dann auch nur f&uuml;r kurze Zeit. W&uuml;rde man jedoch die Stadt wieder aufbauen k&ouml;nnte man die Verbindung zwischen den Welten st&auml;rken und das Portal kontrolliert f&uuml;r einen bestimmten Zeitraum &ouml;ffnen.&ldquo;\r\n&bdquo;Aber eine Stadt baut man ja nicht einfach mal so wieder auf.&ldquo;\r\n&bdquo;Das stimmt, aber wenn es in Runeterra etwas in F&uuml;lle gibt, dann ist es Magie.&ldquo;\r\n&bdquo;Doch auch Magie kommt nicht von irgendwo, sie hat meist eine Quelle und die Menge die wir ben&ouml;tigen w&uuml;rden k&ouml;nnten weder Ihr, noch ich stellen.&ldquo;\r\nEr wandte sich der Treppe zu und schaute zum Voidling hinab, welcher immer noch gehorsam dort wartete. &bdquo;Es sind die Richtfelder.&ldquo;\r\n&bdquo;Die Richtfelder? Ich verstehe nicht ganz.&ldquo;\r\n&bdquo;In der Kluft der Beschw&ouml;rer, in der Kristallnarbe, in der heulenden Schlucht und auch hier auf den Schatteninseln im Gewundenen Wald gibt es Quellen die m&auml;chtiger als alles andere in ganz Valoran sind und zwar die Nexus. Mit der Energie aus den Kristallen der Nexus lie&szlig;e sich dies alles in nur wenigen Tagen bewerkstelligen.&ldquo;\r\nIm Dach war eine kleine &Ouml;ffnung durch welches tats&auml;chlich ein wenig Mondlicht fiel, welches sich durch die schwarzen Wolken am Himmel gek&auml;mpft hatte.\r\n&bdquo;Gut, das w&auml;re in der Tat der Fall, aber seid Ihr wirklich der Meinung, dass man zu zweit die Nexus anzapfen kann, immerhin sind dies Richtfelder f&uuml;r t&auml;gliche K&auml;mpfe&ldquo;, sie trat unter die &Ouml;ffnung.\r\n&bdquo;Wir sind nicht zu zweit. Wie ich bereits sagte haben es wenige bereits nach Runeterra geschafft, sie sind nicht so undankbar wie der Leereng&auml;nger und werden jederzeit f&uuml;r ihre Heimat k&auml;mpfen, au&szlig;erdem wei&szlig; ich aus sicherer Quelle, dass das Portal sich schon bald wieder f&uuml;r einen Tag &ouml;ffnen wird.&ldquo;\r\nDer Kopfschmuck reflektierte den Mondschein und erleuchtete den ganzen Raum. &bdquo;Und Ihr seid der Meinung, dass jemand oder etwas in dieser Zeit hindurchkommt.&ldquo;\r\n&bdquo;Ich bin nicht der Meinung, ich bin mir g&auml;nzlich sicher.&ldquo; Ein seltsames Ger&auml;usch ert&ouml;nte am Ende der Treppe. &bdquo;Auch wenn ihre Zeit begrenzt ist werden sie jederzeit meinem Ruf folgen.&ldquo; Der Voidling l&ouml;ste sich langsam auf. \r\nEr  ging wieder zum Thron zur&uuml;ck und beobachtete das funkelnde Licht.\r\n&bdquo;Werden wir an jenem Tag beginnen?&ldquo;\r\n&bdquo;Ja, so ist es geplant. Zur Graunacht.&ldquo;\r\nSie lachte leise vor sich hin. &bdquo;Zur Graunacht, wie passend. Jedes Jahr wurde Runeterra von Unheil heimgesucht in dieser und auch dieses Jahr wird niemand verschont bleiben, wie es scheint.&ldquo;\r\n&bdquo;In der Tat. Kann ich also davon ausgehen, dass Eure Unterst&uuml;rzung sicher ist?&ldquo;\r\n&bdquo;Darum braucht Ihr euch keine Sorgen zu machen, wenn es sich lohnt f&uuml;r etwas zu k&auml;mpfen, dann ist es etwas wovon man sich selbst etwas erhofft. Mein Interesse ist geweckt, ich m&ouml;chte die Leere sehen, au&szlig;erdem hat mir Runeterra nichts mehr zu bieten, wie es heute ist, also ist meine Hilfe gewiss. Doch eine Frage h&auml;tte ich noch.&ldquo;\r\n&bdquo;Welche w&auml;re?&ldquo;\r\n&bdquo;Wieso habt Ihr darauf bestanden, dass wir uns auf den Schatteninseln treffen? Ich erkenne den Sinn dahinter nicht.&ldquo;\r\n&bdquo;Ich wollte lediglich sicher gehen, dass wir alleine sind. Zeugen w&auml;ren nicht gerade f&ouml;rderlich gewesen.&ldquo;\r\n&bdquo;Und hier soll dies der Fall sein? Nach all dem, was ich &uuml;ber diesen Ort geh&ouml;rt habe gibt es durchaus einige omin&ouml;se Gestalten, die sich hier herumtreiben.&ldquo;\r\n&bdquo;Das mag sein, doch ich habe selbst daf&uuml;r gesorgt, das keiner sich all zu nahe an die Ruinen herantraut. Falls es dennoch jemand tut, so ist es sicherlich dessen Tod.&ldquo;\r\nLangsam stieg er die Treppe hinab.\r\n&bdquo;Gibt es noch letzte Fragen?&ldquo;\r\n&bdquo;Wie seht Ihr die Erfolgschancen&ldquo;, rief sie ihm mit einer ungew&ouml;hnlichen Mischung aus Stolz und Unsicherheit nach.\r\n&bdquo;Das Ausgehen ist eindeutig, da bin ich mir sicher. Lange genug wurden wir unterdr&uuml;ckt und alleine um dies zu beenden wurde ich geboren. Nur deswegen wurde mir die Gabe geschenkt das zu sehen, was uns alle unweigerlich erwartet. Nat&uuml;rlich verlangen wir daf&uuml;r Opfergaben, doch diese dienen nur einem h&ouml;heren Zweck, so sollten sich diese geehrt f&uuml;hlen. Icathia ruft, wenn wir diesem Ruf folgen ist ein Erfolg unvermeidlich.&ldquo;\r\n&bdquo;Bedenkt, dass man sich dagegen auflehnen wird. Eben diese naiven Schw&auml;chlinge haben Angst vor der Ver&auml;nderung und wollen diese nicht einfach hinnehmen.&ldquo;\r\n&bdquo;Das st&ouml;rt mich nicht, die die sich nicht der Leere unterwerfen werden von ihr verschlungen&ldquo;, sein lautes Lachen f&uuml;llte den Raum mit einer K&auml;lte, die einem Schneesturm in Freljord gleichk&auml;me.\r\n&bdquo;Es wird Zeit, dass die Welt sich ver&auml;ndert und sich die aus dieser Welt verbannten aus den Fesseln der Unterdr&uuml;ckung befreien.&ldquo; Noch ein letztes mal, ehe er wieder im Dunkel des Ganges verschwand blieb er stehen. &bdquo;Dunkle Herrscherin, sie werden kommen, ohne Frage und ich hoffe, dass Ihr euch an unser Abkommen haltet.&ldquo;\r\n&bdquo;Wagt Ihr es mir zu drohen, obwohl Ihr meine Hilfe erwartet?&ldquo; Es klang nicht ganz so selbstsicher, wie es h&auml;tte sollen, aber dennoch war ihre Stimme durchdringend genug, um die Geschichten &uuml;ber sie glaubhaft zu machen.\r\n&bdquo;Gewiss nicht. Wir sehen uns zur Graunacht.&ldquo; Mit einem Lachen verschwand er endg&uuml;ltig in der Lichtlosigkeit des Ganges.\r\nSie schaute ihm noch eine Weile nach, auch wenn sie sich sicher war, dass er das Geb&auml;ude bereits verlassen hatte. Er hatte eine seltsame Art, die sie einerseits misstrauisch machte, doch auf der anderen Seite auch anzog. Drau&szlig;en ert&ouml;nten die Schreie fremdartiger Kreaturen. Waren diese auch aus der Leere? &bdquo;Grenzen sind da, um &uuml;berwunden zu werden und Macht ist es wof&uuml;r ich lebe. Kein Opfer ist zu gro&szlig;. Macht geh&ouml;rt nur denen, die bereit sind sie zu nutzen.&ldquo; \r\n\r\nDie Nacht neigte sich dem Ende, ebenso wie das Treffen zweier Personen, welche das Schicksals zweier Welten in ihren H&auml;nden hielten. Einer davon war der Prophet der Leere, der seinem Ziel noch nie so nahe stand und die andere war die dunkle Herrscherin, welche sich von den Visionen hatte hinrei&szlig;en lassen. \r\nEs w&uuml;rde nur noch wenige Minuten dauern, bis die Sonne aufging, doch solange schlummerten noch die Menschen und Tiere Runeterras in ihren sorglosen Tr&auml;umen. Es war die Graunacht, die alles ver&auml;ndern sollte. Schon lange sind sie da, doch hielten sie sich zur&uuml;ck und warteten, bis ihre Zeit gekommen war. Ihr Einmarsch wird unvermeidbar sein, so wie es der Prophet gesehen hatte. Die Rache der Leerenwesen wird St&auml;dte zerst&ouml;ren und tausende das Leben kosten. \r\nDoch viel weniger die Frage danach, wie die Zukunft aussehen wird ist die, wer versuchen wird sie aufzuhalten. Die Welt war voll von legend&auml;ren Kriegern, Sch&uuml;tzen und Magiern, doch die Bedrohung war fremd.\r\nSie werden kommen...","replies":[]}