{"poster":"Jánná","date":"2017-04-15T18:00:20.503+0000","title":"ranscrollen deaktivieren?","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hi,\r\n\r\nkann man das rein und rausscrollen auf dem Muasrad ingame (um z.b den Champion n&auml;her zu betrachten) deaktivieren?\r\nIch hab es schon mit dieser Input Datei ausprobiert und habe danz zum schlusas \r\n\r\n[MouseSettings]\r\nRollerButtonSpeed = 0\r\n\r\ndas eingegeben aber irgendwie funktioniert das nicht.\r\nMein Mausrad ist kaputt bzw zu locker und das kann echt fatal f&uuml;r mich sein.\r\n\r\nDankesch&ouml;n f&uuml;r die Hilfe!\r\nLG","replies":[{"poster":"AI Yjuq","date":"2017-04-15T18:30:26.113+0000","up_votes":2,"down_votes":0,"body":"1. Logge dich in LoL über den Client ein.\n2. Wechsel in das Verzeichnis \"C:\\Riot Games\\League of Legends\\Config\" und lösche die \"input.ini\"\n3. Öffne die \"PersistedSettings.json\" mit einem Texteditor wie Notepad z.B. (Mach dir am besten eine Sicherungskopie vorher)\n4. Suche nach folgenden Eintrag:\n\n> \"name\": \"MouseSettings\",\n                    \"settings\": [\n\nAm besten die Suchfunktion des Editors benutzen. Als Eingabe müsste \"MouseSettings\" schon reichen um die Zeile zu finden.\n\nFalls sie nicht existiert, suche nach folgendes: \"input.ini\". Füge dann entsprechend nach der geschweiften Klammer dies hier hinzu:\n\n> {\n                    \"name\": \"MouseSettings\",\n                    \"settings\": [\n                        {\n                            \"name\": \"RollerButtonSpeed\",\n                            \"value\": \"0\"\n                        }\n                    ]\n                },\n\nFalls der Eintrag schon existierte, füge einfach nur das hier darin ein:\n\n> {\n                            \"name\": \"RollerButtonSpeed\",\n                            \"value\": \"0\"\n                        }\n\nStarte ein Custom Game damit die Settings übernommen werden. Danach müsste das Scrollen ingame definitiv ausgeschaltet sein. Alternativ schick mir einfach deine \"PersistedSettings.json\" zu, indem du diese auf https://pastebin.com/ z.B. postest. Dann kann ich dir die nötigen Settings korrekt einfügen.","replies":[{"poster":"Jánná","date":"2017-04-15T19:28:54.224+0000","up_votes":1,"down_votes":0,"body":"in diesen \"persistedsetting\" gibt es kein \"mousesettings\" und auch kein \"input.ini\". aber es war schon richtig die input.ini vorher zu löschen oder?","replies":[{"poster":"recon","date":"2017-04-15T19:48:36.863+0000","up_votes":1,"down_votes":0,"body":"Lad deine PersistedSettings.json Datei einfach mal hier hoch: https://files.wrenchbox.de/\nIch füg dir das dann ein.","replies":[{"poster":"Jánná","date":"2017-04-15T20:26:44.004+0000","up_votes":1,"down_votes":0,"body":"Ich hab das jetzt bei deinem link auf der Website gemacht, da dein Name gelb ist und ich glaube du bist son supporter,dementsprechend etwas vertrauensvoller. :D","replies":[{"poster":"recon","date":"2017-04-15T20:42:28.363+0000","up_votes":1,"down_votes":0,"body":"https://files.wrenchbox.de/PersistedSettings.json\nEinfach den Inhalt komplett kopieren und den Inhalt deiner Datei überschreiben.","replies":[{"poster":"Jánná","date":"2017-04-17T14:45:46.794+0000","up_votes":1,"down_votes":0,"body":"Habe es gerade gemacht, habe dann nochmal mein leaguze neu gestrartet und in einem freien Spiel ausprobiert, aber er scrollt immernoch. :/ naja was solls,trotzdem dankeschön an alle die mir geholfen haben!!! (:","replies":[{"poster":"recon","date":"2017-04-17T16:31:53.667+0000","up_votes":1,"down_votes":0,"body":"Hast du den Client dabei offen gehabt oder nicht? Es ist wichtig, dass du den offen hast, wenn du die Datei überschreibst. Ansonsten wir diese einfach wieder zurückgesetzt.\n\nAlso:\n- Client starten und einloggen\n- Datei öffnen und mit dem Inhalt von meinem Link komplett überschreiben\n- Speichern\n- Spiel starten und testen\n- Wenn alles klappt, Client neustarten","replies":[]}]}]}]}]},{"poster":"AI Yjuq","date":"2017-04-15T19:47:12.384+0000","up_votes":1,"down_votes":0,"body":"Dieser Eintrag müsste dort aber existieren. Lade deine PersistedSettings.json mal auf https://pastebin.com/ hoch.","replies":[]}]},{"poster":"recon","date":"2017-04-15T18:32:45.252+0000","up_votes":1,"down_votes":0,"body":"Danke für die Anleitung :)\nWar mir nicht bewusst, dass das Ganze in die neue Config verlagert wurde.","replies":[{"poster":"AI Yjuq","date":"2017-04-15T18:45:21.898+0000","up_votes":1,"down_votes":0,"body":"Achja, die PersistedSettings.json wird bei jedem Betreten eines Games mit den Server synchronisiert. Das sind die Einstellungen die vom Server direkt kommen. Änderungen welche an diese gemacht werden, werden als Settings an den Server geschickt und beim Einloggen einmalig eben abgerufen.\n\nDie input.ini sind die Settings, die lokal verfügbar sind. Sollte keine input.ini existieren, so wird diese aus der PersistedSettings.json generiert. Daher ist es empfehlenswert Änderungen an der PersistedSettings.json vorzunehmen und die input.ini zu löschen. Wie die Synchronisation zwischen der input.ini und PersistedSettings.json aussieht, weiß ich nicht. Es verhält sich jedenfalls komisch wenn man nur eine der beiden Dateien verändert. Da steig ich momentan noch nicht durch.\n\nDas sind aber lediglich Beobachtungen die ich gemacht habe, habe dazu keine Dokumentationen gefunden, die von Riot stammen.","replies":[]},{"poster":"AI Yjuq","date":"2017-04-15T18:33:32.041+0000","up_votes":1,"down_votes":0,"body":"Da lässt sich so einiges mit machen. Hab da mal ein wenig drin rum gestöbert. ^^","replies":[]}]}]},{"poster":"recon","date":"2017-04-15T18:16:18.457+0000","up_votes":1,"down_votes":0,"body":"Soweit ich weiß geht das leider nicht mehr.","replies":[{"poster":"AI Yjuq","date":"2017-04-15T18:22:22.614+0000","up_votes":1,"down_votes":0,"body":"Doch, das geht noch. Habe das erst letztens gemacht.","replies":[{"poster":"recon","date":"2017-04-15T18:24:08.761+0000","up_votes":1,"down_votes":0,"body":"Na dann zeig uns doch mal bitte wie das funktioniert.","replies":[{"poster":"XExEcUtOrX04","date":"2017-04-15T19:34:17.656+0000","up_votes":1,"down_votes":0,"body":"Er hat auch nen Schraubenschlüssel, er weiß wie das geht :D\n\nIst man eigentlich Semi-Wrenchman wenn man den blauen Schraubenschlüssel hat? :D","replies":[{"poster":"AI Yjuq","date":"2017-04-16T07:14:32.692+0000","up_votes":1,"down_votes":0,"body":"Nein, das Icon hat man erhalten, wenn man für den Alpha Client ein Tester war ^^\n\nMeine Wrenchman Bewerbung wurde damals abgelehnt. :(\nAber meine Chancen als Adjudicator sehen nicht schlecht aus. Zumindest wurde ich schon mal für ein Gespräch eingeladen. Yay~~","replies":[{"poster":"XExEcUtOrX04","date":"2017-04-16T12:00:48.528+0000","up_votes":1,"down_votes":0,"body":"... Du hast gerade meinen Witz kaputt gemacht :(","replies":[]},{"poster":"recon","date":"2017-04-16T09:30:21.064+0000","up_votes":1,"down_votes":0,"body":"Das war bereits in der ersten Phase. Wir hatten einige Monate später eine zweite Phase in der du dich nochmals bewerben hättest können ;)","replies":[{"poster":"AI Yjuq","date":"2017-04-16T09:50:18.699+0000","up_votes":1,"down_votes":0,"body":"Ach Gott, wenn ich zur ersten nicht angenommen wurde bringt auch eine 2te nichts. Habe ja schon alles in der Bewerbung geschrieben gehabt, was ich für wichtig erachtet habe. Was soll's. Hält mich trotzdem nicht davon ab, hier Hilfestellung zu geben. Nur ist halt mein Name dann nicht gelb. xD","replies":[{"poster":"recon","date":"2017-04-16T10:03:00.751+0000","up_votes":1,"down_votes":0,"body":"> Nur ist halt mein Name dann nicht gelb. xD\n\nDas ist doch aber nicht das Gelbe vom Ei \n{{sticker:zombie-brand-mindblown}}","replies":[]}]}]}]}]}]}]}]},{"poster":"Nycaria","date":"2017-04-15T18:33:17.577+0000","up_votes":1,"down_votes":0,"body":"Du kannst es prinzipiell auch einfach auf andere Tasten legen. Ich hatte es damals mit meiner alten Maus auf den Hoch und runter Pfeiltasten. Weiß allerdings nicht, ob das noch geht.","replies":[]}]}