{"poster":"japiwe","date":"2017-04-20T18:47:56.561+0000","title":"Orianna zu wenig Schaden","subforum":"Champions & Gameplay","up_votes":2,"down_votes":2,"body":"Ist es normal, dass Orianna mit zwei bis drei items (Morellos, Rabbadons und Ludens) kaum Schaden mach, oder bin ich einfach nur boosted?\nDie Gegner hatten keine MR.\n\nEdit: Scheinbar habe ich tatsächlich etwas falsch gemacht, in anderen Games habe ich mit diesen Items sehr viel Schaden gemacht, aber ohne Ultimate habe ich niemanden geoneshotet. Und die will ich nicht immer benutzen, da sie im Teamfight viel nützlicher ist. :/","replies":[{"poster":"Cayce","date":"2017-04-20T19:00:20.814+0000","up_votes":4,"down_votes":0,"body":"Also sofern du die Items nicht bei Minute 50 erst zusammen hast, hast du was falsch gemacht ^^ Ori ist mit einer vollen Combo definitiv in der Lage Champions zu oneshotten.","replies":[]},{"poster":"charmelikeahri","date":"2017-04-20T20:05:48.343+0000","up_votes":1,"down_votes":0,"body":"Ja irgendwas hat du falsch gemacht ^^ Ori ist INSANE stark im Moment, sie hat viel zu viel DMG, zoned Leute insane gut und Teamfightet wie ein Monster.\n\nDas Ori keinen Schaden macht sollte wohl er ein Spaß sein denke ich ^^ (grade bei den Items Oneshotest du Leute ohne MR mit einer Combo)","replies":[]},{"poster":"TerrorRaven","date":"2017-04-20T19:19:14.134+0000","up_votes":1,"down_votes":4,"body":"Das ist normal. Sie hat einen geringen Grundschaden, aber dafür ausgezeichnete AP-Skalierungen.Deswegen ist sie im Late-Game auch erst richtig stark.","replies":[{"poster":"charmelikeahri","date":"2017-04-20T20:03:32.328+0000","up_votes":1,"down_votes":0,"body":"Welche Ap Skalierungen meinst du? Ach die! Stimmt die sind insane! Komisch er hat schon 3 Items die insgesamt um die (+Runen, Masteries) 400 Ap besitzten. Das ist insane viel und VIEL mehr wird eine Orianna nicht anschaffen (weitere Gegenstände sind Stundeglas 60 Ap und Voidstaff 60 oder 80? AP).\nDas er mit diesen Items seine Scalings voll ausnutzt ist klar, dass er keinen Schaden macht liegt nicht an der Spielphase sondern an seinem Skill","replies":[]}]}]}