{"poster":"OTP REQUIEMBOW","date":"2016-03-05T13:33:12.671+0000","title":"Bug in aram ed alcune skillshot","subforum":"Campioni e gameplay","up_votes":1,"down_votes":0,"body":"ciao a tutti, ho notato ultimamente che qualche volta in aram quando lancio la snowball, essa va esattamente nella direzione opposta a quella indicata, succede anche con ancune spells come la R di nami... anch&#039;essa qualche volta va al contrario e idem per il flash (e questa cosa &egrave; successa anche ad alcuni streamer), poi oltre questo in alcune partite mi ritrovo ad avere l&#039;hitmarker degli skillshot (la Q di thresh o la Q di braum) sfalsate di qualche grado rispetto la direzione in cui si trova il puntatore, &egrave; una cosa che quando succede rimane per tutta la partita.... quando parlo di qualche grado intendo dire anche 25-30 gradi, cose oscene insomma... non &egrave; un errore causato magari dalla foga del fight, perch&egrave; quando torno in base metto l&#039;esecuzione della spell non rapida la provo a vuoto mirando un punto preciso e 10 volte su 10 questa va altrove mancando il punto di parecchio anche, appena si ripresenter&agrave; di nuovo questo problema far&ograve; un piccolo video per chiarire quel che intendo, nel frattempo qualcuno sa dirmi se si tratta di semplici bug oppure &egrave; il mio pc che &egrave; fuso? (non penso dato che &egrave; nuovo e performante)","replies":[{"poster":"Chroniicles","date":"2016-03-05T13:43:33.472+0000","up_votes":1,"down_votes":0,"body":"Fin'ora siamo a conoscenza di bug sulla q di thresh, ma non riguardano la direzione in cui punti lo skillshot bensì il mancato \"grab\" in determinate situazioni in cui l'avversario viene chiaramente colpito. \nVorrei farti notare una cosa: non so se sia il tuo caso, ma chi gioca da notebook nel 99% dei casi usa il mouse, molti lasciano comunque attivo il touchpad che viene inavvertitamente sfiorato mentre si gioca e provoca lanci palesemente sbagliati di spell","replies":[{"poster":"OTP REQUIEMBOW","date":"2016-03-05T14:23:52.932+0000","up_votes":1,"down_votes":0,"body":"no gioco da pc fisso, e anche bello performante, in piu in questo problema il grab si disallinea anche dall'indicatore della spell.. è per questo che ho fatto il post altrimenti avrei continuato a pensare che fosse un errore mio... che magari avessi mosso il puntatore all'ultimo momento prima di castare la spell.... cmq dato che ancora non ne eravate a conoscenza, se e quando mi si ripresenta il problema mando un ticket con video allegato","replies":[{"poster":"Chroniicles","date":"2016-03-05T14:54:02.330+0000","up_votes":1,"down_votes":0,"body":"Potresti anche controllare se i driver directx siano aggiornati\n\n> Aggiornare le DirectX\nDirectX è una serie di Interfacce di Programmazione di un'Applicazione (API in inglese) sviluppate da Microsoft. Questa API permette a varie applicazioni di interagire con l'hardware del tuo computer senza sapere in anticipo di che tipo di hardware si tratti. Molte applicazioni usano DirectX, ma l'utilizzo più diffuso è relativo ai giochi, quelli che sfruttano molto di più l'hardware.\nCosa significa?\nSe stai usando una versione obsoleta di DirectX, League of Legends avrà dei problemi a interagire con il tuo hardware (scheda video, mouse, tastiera, casse ecc.). Questo può provocare una serie di errori come blocchi dei driver, input errati di mouse e tastiera, o mancanza di audio.\n\nhttp://support.microsoft.com/kb/179113","replies":[{"poster":"OTP REQUIEMBOW","date":"2016-03-05T22:22:13.555+0000","up_votes":1,"down_votes":0,"body":"oook  grazie della dritta, lo aggiorno e vi aggiorno nel caso in cui ricapiti","replies":[]}]}]}]},{"poster":"DeathJehuty","date":"2016-03-05T13:36:56.762+0000","up_votes":1,"down_votes":0,"body":"manda un ticket al support, non mi e ancora mai capitato per fortuna, ma se ne sei certo manda un ticket si (non spammarli che senno ti ributtano in fondo alla coda)","replies":[{"poster":"OTP REQUIEMBOW","date":"2016-03-05T14:25:18.945+0000","up_votes":1,"down_votes":0,"body":"è una cosa che mi capita ogni tanto... diciamo che capita 1 game ogni settimana e mezzo, per cui è una cosa che non capita spesso, ma mi è capitato in ranked è rodevo come un castoro, dato che missavo tutti i grab e non per colpa mia","replies":[]}]}]}