{"poster":"James Smith","date":"2017-11-12T19:05:53.744+0000","title":"Fix the mac client???? This has been a problem for months???","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"Literally 99% of the time you attempt to login it comes up with \"trying to reconnect\" and it will never reconnect leaving you with no choice but the close the game or once you login the game will let you click every menu but not a single one will open? Genuinely cannot play the game because the mac client is woeful? Anyone care to give me some advice or fix this? \r\n\r\nDon't care for the \"get windows\" comments","replies":[{"poster":"Broporo","date":"2017-11-12T23:56:24.943+0000","up_votes":1,"down_votes":0,"body":"I wouldn't necessarily suggest windows since Mac still has just as good OS's, but I would probably consider updating your network settings like port forwarding and DNS to try and get a little smother connection with our servers. Check out those steps in the [**connection guide**](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues#section-mac) if you aren't sure of what to do, and please let me know if this doesn't help so I can dig a little more with you!","replies":[{"poster":"robogim","date":"2017-11-14T14:52:43.203+0000","up_votes":1,"down_votes":0,"body":"Im sorry but riot cannot continue to ask their mac users to 'check the connection guide' we have all done every step mulitple times this is down to riot not us you need to update the client it is unusable and it is stopping us from being able to play your game which is especially annoying when some of us have invested so much into your game in the form of time and money","replies":[{"poster":"Bellmo","date":"2017-11-17T20:45:33.709+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=robogim,realm=EUW,application-id=osqw6G4M,discussion-id=AvyyEhQM,comment-id=00000000,timestamp=2017-11-14T14:52:43.203+0000)\n>\n> Im sorry but riot cannot continue to ask their mac users to &#x27;check the connection guide&#x27; we have all done every step mulitple times this is down to riot not us you need to update the client it is unusable and it is stopping us from being able to play your game which is especially annoying when some of us have invested so much into your game in the form of time and money\n\nits a fucking joke what these guys do on this forum. thinking were just dumb. if you open a support ticket they tell you that its a known issue and they are working on it. but it exists since 3 month now. i get the feeling monkeys are working faster than them","replies":[]}]}]}]}