{"poster":"AxEMasTer45","date":"2014-04-23T13:03:16.417+0000","title":"Oceania","up_votes":1,"down_votes":0,"body":"Üdvözlet.\r\nAzt szeretném kérdzni hogy majd oceániáról is meg lessz-e oldva az ingyen áthozás eune-ra mert 1 ik barátomnak kölcsönadtam az accountomat még régebben és átvitte oceániára.\r\nÉs túl sok munkám van benne hogy ne hozzam vissza ésjelenlg nem telikeég rp-re a visszaszállításhoz eune-ra.\r\nVagy az accotát lehetne hozni?\r\nEgy pool partyziggset kaptam érte az accra hogy átvitte.\r\nHa kell azt le is lehet venni ha kell akár ziggset is. \r\nAccount neve: DieFerike \r\nElörre is köszönöm \r\nWentzel Norbert","replies":[{"poster":"Creatinpak","date":"2014-04-23T17:28:19.019+0000","title":null,"up_votes":2,"down_votes":1,"body":"Helyesírás 1!- es","replies":[{"poster":"NesThaesis","date":"2014-04-23T17:34:56.045+0000","title":null,"up_votes":1,"down_votes":0,"body":"Te így azért jöttél fel a fórumra, hogy mindenkinek beszólj? Mert akkor szerintem rossz helyre jöttél.","replies":[]}]},{"poster":"iSPZ","date":"2014-04-23T13:10:11.492+0000","title":null,"up_votes":1,"down_votes":0,"body":"EUW -> EUNE irányban ingyenes a transzfer lehetőség. Egy kérvényt írj [itt](https://support.leagueoflegends.com/requests/new), magyar nyelven!","replies":[{"poster":"Xchaos886","date":"2014-04-26T10:37:11.201+0000","title":null,"up_votes":1,"down_votes":0,"body":"Sajnos a support nem tud segíteni ilyen esetben. Én NA szerverről akartam áthozni az accomat, írtam nekik, de a válaszuk sajnos az volt, hogy csak westről van ilyen lehetőség, a többi szerveren ki kell fizetni a 2600RP-t.","replies":[]}]},{"poster":"NesThaesis","date":"2014-04-23T13:24:05.751+0000","title":null,"up_votes":1,"down_votes":0,"body":"Nemhiszem, hogy ez megoldható lenne, elég botor dolog volt átvinni oceanic szerverre az accountot főleg, hogy az a világ túloldalán van, és nagyobb a ping is azon a szerveren. Ezt az átvitelt még akkor kellett volna szóvá tenni, amikor átkerült az account. Ja és a jövőben semmilyen formában ne add meg se a felhasználó nevedet , se a summoner nevedet fórumon, sőt még az e-mail címet ami hozzá tartozik, ha intézkedésre kerülne sor a Riot Gamesnek kell nyitni egy jegyet a support részen, ahol elkérik az adatokat egy privát levélben. Ha fórumokon osztod meg az adataidat az gyengíti a profil biztonságát.","replies":[]}]}