{"poster":"Pazzo omicida","date":"2016-01-25T17:54:55.248+0000","title":"Quanti user linux ci vorrebbero per interessare la riot a sviluppare LOL per linux?","subforum":"Discussioni generali","up_votes":4,"down_votes":1,"body":"Quale sarebbe la percentuale di utenti linux per rendere interessante l&#039;idea di sviluppare il gioco per quest&#039;ultimo?\r\n&Egrave; ovvio che molti usano windows solo per i giochi, ad esempio io ho un pc con su windows solo per LOL.\r\nNon viene sviluppato perch&eacute; ci sono pochi utenti linux a quanto pare, ma si &egrave; mai provato a fare un sondaggio da qualche parte per vedere in quanti quale sistema operativo preferirebbero?","replies":[{"poster":"kirchhoff","date":"2016-01-25T18:04:39.025+0000","up_votes":1,"down_votes":0,"body":"Tanti, gli utenti linux sono il 5%, gli utenti mac il doppio.\nI giocatori Linux sono <1% su Steam.\n\nSe un giorno dovessero crescere gli utenti, bisogna anche capire se c'è l'interesse (se la RIOT avesse accordi con la Microsoft questa metterebbe un veto allo sviluppo del gioco per altre piattaforme [lo ha già fatto con un'altro gioco])","replies":[{"poster":"Whommy","date":"2016-01-25T20:15:12.291+0000","up_votes":4,"down_votes":0,"body":"il problema è la frammentazione di linux e il poco supporto driver per le schede video sul sistema operativo stesso\n\nanche a patto di riuscire a creare un client apposito si rischia di avere enormi problemi e bug di stabilità ad ogni minimo aggiornamento del sistema operativo o dei driver \"quasi fatti a mano\" della gpu.\n\nl'unica sarebbe creare un client per una sola distribuzione linux e solo per una determinata gamma di schede, ma i costi sono abissali in rapporto alla percentuale degli eventuali giocanti.\n\ndirettamente windows con macchina virtuale è possibile giocare a patto di avere un signor pc","replies":[{"poster":"kirchhoff","date":"2016-01-25T22:52:30.029+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Whommy,realm=EUW,application-id=MJVj50Jw,discussion-id=3GtWy50E,comment-id=00000000,timestamp=2016-01-25T20:15:12.291+0000)\n>\n> il problema è la frammentazione di linux e il poco supporto driver per le schede video sul sistema operativo stesso\n> \n\nI binari girano su qualsiasi distribuzione (a patto di avere le librerie)\n\n> anche a patto di riuscire a creare un client apposito si rischia di avere enormi problemi e bug di stabilità ad ogni minimo aggiornamento del sistema operativo o dei driver \"quasi fatti a mano\" della gpu.\n\nLa valve non sta avendo questi problemi con le steam machine\n\n> \n> l'unica sarebbe creare un client per una sola distribuzione linux e solo per una determinata gamma di schede, ma i costi sono abissali in rapporto alla percentuale degli eventuali giocanti.\n\nFanno come ha fatto la Valve: pacchetto per ubuntu/debian (che si può convertire in rpm per red hat) e gli altri si attaccano.\n\n> \n> direttamente windows con macchina virtuale è possibile giocare a patto di avere un signor pc\n\nSenza accelerazione hardware ... quanti fps??","replies":[{"poster":"Whommy","date":"2016-01-26T09:30:10.103+0000","up_votes":2,"down_votes":0,"body":"> La valve non sta avendo questi problemi con le steam machine\n\nÈ una base hardware conosciuta a differenza dei normali pc con installata una distribuzione \n\n> Fanno come ha fatto la Valve: pacchetto per ubuntu/debian (che si può convertire in rpm per red hat) e gli altri si attaccano.\n\n Valve ha investito sulle steam machine e sul porting dei giochi, è tutto un altro tipo di azienda e di business rispetto a Riot.\nAnche se le sorgenti del client fossero open source, l'investimento di programmazione sarebbe in perdita...ed già è da ammirare il supporto a mac.\nIl problema è che la riot tiene ben stretto il suo client, quindi una programmazione esterna anche da parte di una community di volontari è molto improbabile.\n\n> Senza accelerazione hardware ... quanti fps??\n\n\"è possibile\", non comodo XD","replies":[{"poster":"kirchhoff","date":"2016-01-26T16:33:43.305+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Whommy,realm=EUW,application-id=MJVj50Jw,discussion-id=3GtWy50E,comment-id=0000000000000000,timestamp=2016-01-26T09:30:10.103+0000)\n>\n> È una base hardware conosciuta a differenza dei normali pc con installata una distribuzione \n> \n\nLe steam machine non sono tutte uguali. puoi scegliere il modello. Ma di fatto sono debian stabile + steam (che è quello che ho sul computer di casa) + pacchetti aggiuntivi che trovi nel repository di steamos. Potrei installarli sul mio debian e farlo diventare una \"steam machine\".\n\n>  Valve ha investito sulle steam machine e sul porting dei giochi, è tutto un altro tipo di azienda e di business rispetto a Riot.\n\nSi, la valve è un'azienda più grande con più giochi e che si vuole espandere, la riot ha avuto fortuna nel creare il gioco più giocato al mondo (ma a livello tecnico non ne è all'altezza) se ne stanno pentendo adesso di aver creato un client che è una schifezza\n\nMi ricordo ancora quando dissero che non volevano prendersi il rischio di aggiungere bug nel cercare di migliorare certe parti del gioco (penso fosse a riguardo della tecnologia riguardante gli incanti sulle scarpe)\nquesto modo di ragionare non è il massimo\n\n> Anche se le sorgenti del client fossero open source, l'investimento di programmazione sarebbe in perdita...ed già è da ammirare il supporto a mac.\n> Il problema è che la riot tiene ben stretto il suo client, quindi una programmazione esterna anche da parte di una community di volontari è molto improbabile.\n\nsource engine non è opensource, non lo è nemmeno unity","replies":[]}]}]}]}]},{"poster":"Chroniicles","date":"2016-01-25T18:34:22.377+0000","up_votes":1,"down_votes":0,"body":"Lessi tempo fa una discussione, sempre in merito al rendere un multiplayer online viabile su linux: premetto che non ricordo con chiarezza i dettagli e che quindi non voglio sbilanciarmi a scrivere cavolate, il succo era che oltre ai chiari problemi di portabilità del codice ci sono moltissimi altri problemi strutturali che rendono il tutto abbastanza improponibile (seguendo il criterio costo/guadagno)","replies":[{"poster":"Giovarco","date":"2016-01-26T11:17:06.795+0000","up_votes":3,"down_votes":0,"body":"E io considererei un'altra cosa. LoL in sé e per sé non è programmato come si deve: il famoso spaghetti-code di cui si parla tanto. Fare il porting di un software fatto male già in partenza è come tirarsi la zappa sui piedi. Io non posso immaginarmi il codice che hanno scritto fino ad oggi i programmatori della Riot, ma immagino sarà una mole gigantesca. Io mi rifiuterei solo a leggere un codice senza design pattern e/o norme di buona programmazione.","replies":[]}]},{"poster":"NiraBlade","date":"2016-01-25T18:52:42.578+0000","up_votes":1,"down_votes":0,"body":"il problema è che la maggioranza utilizza windows e chi utilizza linux sa già che non è il massimo come sistema operativo per giocare, quindi o hanno un secondo pc oppure hanno 2 dischi per far girare entrambi >.> però avevo fatto delle prove tempo addietro, ero riuscita a far partire lol utilizzando wine. Ma ti dico già che non ne vale la pena: girava male e avendo entrambi non sono andata a scervellarmi più di tanto.\n---\nNon conviene ora come ora programmare interamente per linux, l'utenza è troppo ristretta e i costi (tempo, opportunità, programmazione) sono troppo elevati rispetto ai ricavi. Francamente non lo farei neanche io se fossi nella posizione di decidere, il rischio di perderci è troppo alto.","replies":[{"poster":"kirchhoff","date":"2016-01-25T23:11:05.151+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=NiraBlade,realm=EUW,application-id=MJVj50Jw,discussion-id=3GtWy50E,comment-id=0003,timestamp=2016-01-25T18:52:42.578+0000)\n>\n> il problema è che la maggioranza utilizza windows e chi utilizza linux sa già che non è il massimo come sistema operativo per giocare, \n\nIn che senso non è il massimo? L'ecosistema dei driver è quello che è (a causa del fatto che ... vedi sotto)\n\n>quindi o hanno un secondo pc oppure hanno 2 dischi per far girare entrambi >.> però avevo fatto delle prove tempo addietro, ero riuscita a far partire lol utilizzando wine. \n\noO\n\n>Ma ti dico già che non ne vale la pena: girava male \n\nPer girare gira, ma ha problemi di fps\n\n>e avendo entrambi non sono andata a scervellarmi più di tanto.\n\nFai te che io mi scaricavo una patch, la applicavo ai sorgenti di wine, lo compilavo e lo usavo (tutto questo solo per risolvere un problema grafico che mi faceva crashare dalle TT [oltre che rendere le icone degli oggetti dei quadrati rossi ...]).\nQuando hanno cambiato versione di openssl a causa di hearthbleed ... li sono cominciati altri casini ...\n\nPoi sono passato a playonlinux, installi tuttoinunclick e gg. (Sempre wine è, ma con tutta la configurazione ed altro in automatico)\n\n> ---\n> Non conviene ora come ora programmare interamente per linux, l'utenza è troppo ristretta e i costi (tempo, opportunità, programmazione) sono troppo elevati rispetto ai ricavi. Francamente non lo farei neanche io se fossi nella posizione di decidere, il rischio di perderci è troppo alto.\n\nL'utenza non c'è perchè i giochi non ci sono, i giochi non ci sono perchè l'utenza non c'è ... è la storia del cane che si morde la coda.\n\nLa questione se fare un gioco su di un'altra piattaforma parte dal motore del gioco stesso.\nes.: la Valve ha sviluppato il suo Source Engine già dall'inizio per Linux, adesso N giochi (coff Dota 2 coff) possono girare su Linux grazie a quello (e stanno puntando si espandersi con le Steam Machine) la quota giochi su Steam per linux è di 1800\n\nStessa cosa per Unity 3D (il motore di Hearthstone) Hearthstone non c'è per Linux, ma farne un port sarebbe semplice.","replies":[{"poster":"NiraBlade","date":"2016-01-26T08:06:03.970+0000","up_votes":3,"down_votes":0,"body":"Si scusa mi sono spiegata da cani :V intendevo che si sa che linux non è il sistema operativo per eccellenza quando si parla di videogiochi quindi non penseranno mai \"installo linux per videogiocare\". \n>storia del cane che si morde la coda\n\nEsattamente quello che intendevo, gj :V che poi ci siano imprese che hanno programmato e programmeranno per linux non vi è dubbio.","replies":[]}]}]},{"poster":"Demigod Summoner","date":"2016-01-25T21:08:01.349+0000","up_votes":2,"down_votes":7,"body":"Linux è la cacca... quindi perchè perderci tempo?","replies":[{"poster":"kirchhoff","date":"2016-01-25T22:53:25.949+0000","up_votes":1,"down_votes":1,"body":"lalalal","replies":[]}]}]}