{"poster":"Guiboulou","date":"2015-11-15T18:59:33.529+0000","title":"I can cope with all pre-season changes but one","subforum":"Gameplay","up_votes":93,"down_votes":11,"body":"Wards. I cannot comprehend the reasoning behind this decision. I am a mage main. I don&#039;t mind the AP itemization nerfs that much. I can live with the mana changes. I cannot under any circumstances accept the fact that I have literally no way to place more than one ward at a time (+1 pink I might not always be able to defend) unless I buy a Sightstone.\r\n\r\nI used to upgrade my yellow trinket first thing after getting to level 9. I&#039;d always have a ratio of approximately one ward per minute at the end of the game. 3 wards on the map at all time post-level-9. The upgraded yellow trinket was my best friend last season. It was so amazing. I had a mini-Sightstone that was slot and cost efficient. I have been stripped from it. We have been stripped from it. I thought trinkets were supposed to allow the rest of the team to easily lend a helping hand to supports with map vision. Now, unless we use the blue trinket and manage to place our fragile wards in places the enemies won&#039;t destroy them, we cannot help much. The new yellow trinket is worse than the old non-upgraded one. You need twice the level now to get the same efficiency as before, and that is WITHOUT THE POSSIBILITY TO PLACE MORE THAN ONE WARD AT A TIME. I don&#039;t get it.\r\n\r\nAnd I am terribly disappointed. I understand this is a pre-season and that nothing is set in stone, but the season 2O16 better not carry on with the actual vision state. If that&#039;s really what you guys at Riot are going for, at least make a Sightstone equivalent for every class. Do something. Just because baddies didn&#039;t ward does not mean those who did have to pay.\r\n\r\nExplain yourself. Fix things. Please.\r\n\r\n**TL;DR - Ward changes make me sad. Impossible to place more than 1 ward + 1 pink unless you buy Sightstone. And NO, extremely fragile wards [blue trinket upgrade] do not satisfy me. **","replies":[{"poster":"Sacranshu","date":"2015-11-15T20:03:01.013+0000","up_votes":39,"down_votes":2,"body":"I have to agree, it seems to punish players who bought wards and upgraded their trinkets and reward players who don't care about warding. A very strange choice indeed.","replies":[{"poster":"longnecksam","date":"2015-11-16T18:15:56.732+0000","up_votes":3,"down_votes":1,"body":"Its too help new players learn to ward (that's my guess).","replies":[{"poster":"Hiemdol","date":"2015-11-17T04:40:03.674+0000","up_votes":1,"down_votes":0,"body":"While a fine guess, I am wondering what you are basing that on. There is nothing about the change to the number of maximum wards a yellow trinket that encourages a new player to understand the importance of raw information in a game like League in so far as I see it. As far as I can tell there is very little about the new trinkets that are wholly more intuitive to new players to League and Mobas in general over the old trinkets. \n\nI personally agree with the OP but as I said what made that your guess?","replies":[{"poster":"longnecksam","date":"2015-11-17T15:41:56.932+0000","up_votes":1,"down_votes":0,"body":"Insta buying the wards (for people who forget to buy it), and adding more charges.","replies":[]}]}]}]},{"poster":"SrirachaLimes","date":"2015-11-15T22:49:32.115+0000","up_votes":7,"down_votes":14,"body":"\"I cannot under any circumstances accept the fact that I have literally no way to place more than one ward at a time\"\n\nI'm pretty sure it's possible to place 2 wards with the new trinket. It holds 2 charges.","replies":[{"poster":"RasCaelestis","date":"2015-11-16T00:02:38.565+0000","up_votes":22,"down_votes":0,"body":"It can, but not until later in the game, and also you need to wait an obnoxiously long time for the thing to 'recharge'.  For the first part of the game it only holds one charge.  \n---\nAs a mid-laner I used to buy a few wards nearly every time I went back, and would swap out my Warding Totem for a Sweeping Lens on my first recall.  I'd also get a Vision Ward and drop it in a different spot based on the game.  When it died, I'd get a new one and drop it somewhere else.  It started off as an experiment to see how it worked, and at my Elo, Silver IV, it worked really well.  Having the wards helped my team with vision, and having the Sweeper meant that if my lane went well, I could roam with relative safety and gank regardless of who I was playing (mostly immobile mages).  With Sweeper, I could also destroy wards I saw my lane opponent drop, making it safer for my team's jungler to come in.  \n\nUnder this new system I can't do that.  Rather than spending 75-150 gold per back, now I will need to either delay my damage/utility items in order to buy Sightstone for 800 gold in a time where most AP items now cost even more than they used to, or go without the extra vision and safety.  \n----\nI've been playing since the very beginning of Season Three and I understand meta shifts, but in this one where towers can't protect you and where you can be blown up in seconds by any AD champion, vision is even more important than ever.  To go this far to remove it has eliminated a lot of the strategy to this game.  \n\nThis patch added a lot of RNG in the form of additional crit to items, but it also added randomness to overall gameplay.  Last season there was still a lot of the map that was not as visible as it was in previous seasons, but right now I feel like it's a crap-shoot if I leave a lane without sight of the entire enemy team.","replies":[]}]},{"poster":"Solidair3","date":"2015-11-16T01:05:46.479+0000","up_votes":13,"down_votes":0,"body":"At the very least riot, lower the cd on the charges. I spend so much time without an available ward.","replies":[]},{"poster":"Ralanr","date":"2015-11-15T22:52:02.290+0000","up_votes":11,"down_votes":0,"body":"You know what bothers me?  When an ADC doesn't ward the river while your ward is on cooldown. It's that small point early game, which only makes it more frustrating when the ADC pushes lane while the river is unwarded!","replies":[{"poster":"Azure Hamster","date":"2015-11-16T20:15:27.349+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Ralanr,realm=NA,application-id=3ErqAdtq,discussion-id=Tq3UUkte,comment-id=0004,timestamp=2015-11-15T22:52:02.290+0000)\n>\n> You know what bothers me?  When an ADC doesn't ward the river while your ward is on cooldown. It's that small point early game, which only makes it more frustrating when the ADC pushes lane while the river is unwarded!\n\nI'm an ADC, and I ward the damned river. I feel your pain, as I support, too.\n\n{{champion:51}}","replies":[]}]},{"poster":"Auryiel","date":"2015-11-16T05:45:17.749+0000","up_votes":7,"down_votes":0,"body":"It's like good players who used ward trinkets are being punished now\n\nAnd that's coming from someone who plays almost exclusively ARAM and forgot about the trinket upgrade until about level 11 in most of my 10 (lol) ranked games\n\nThat's honestly a stupid and unfair change","replies":[]},{"poster":"Canidae","date":"2015-11-16T07:00:11.644+0000","up_votes":6,"down_votes":0,"body":"Those blue trinkets are underrated though. Short CD, infinite duration, RIDONK cast range (no moar pseudo face-checking bushes for meh =w=)nice vision, like if you pick good places to hide them U can get a TON of map vision. Last time I used one, ended a sub-40 min game with like 5+ wards on the map. That game one other player had gotten the blue upgrade and that map was lit up like a christmas tree.","replies":[{"poster":"Guiboulou","date":"2015-11-16T14:02:29.738+0000","up_votes":1,"down_votes":0,"body":"Haha I have to admit you're right, but I can't exactly place them everywhere I would like to do so since they're visible and terribly fragile. With pinks, you at least have a chance to try and defend them. Not with the blue wards. =/","replies":[{"poster":"Duke Anax","date":"2015-11-16T22:52:15.675+0000","up_votes":2,"down_votes":0,"body":"Well you can ward the small river bushes, they are hard to reach for a midlaner and give nearly total protection from ganks. As a backup you can ward the bushes behind wolfes and behind the pits.","replies":[{"poster":"Guiboulou","date":"2015-11-17T00:13:56.017+0000","up_votes":2,"down_votes":0,"body":"Thanks for the advice, though I'm mostly trying to get vision post-laning phase. ^_^","replies":[{"poster":"Duke Anax","date":"2015-11-17T12:14:20.263+0000","up_votes":2,"down_votes":0,"body":"well post laning phase I have the map covered in blue wards.\n\nI start with the rather save bushes on my side of the jungle, knowing the enemy is not there is almost as valueable as knowing where they are.","replies":[{"poster":"Guiboulou","date":"2015-11-17T13:27:05.019+0000","up_votes":2,"down_votes":0,"body":"Alright, fair enough. I'll try it out.","replies":[]}]}]}]}]}]},{"poster":"Hinagiku33","date":"2015-11-16T01:16:14.953+0000","up_votes":8,"down_votes":2,"body":"...you know, I really miss Wriggle's Lantern right about now...","replies":[{"poster":"ShatoSummoner","date":"2015-11-16T15:48:43.469+0000","up_votes":4,"down_votes":0,"body":"But...Tracker's Knife is basically a Wriggles now...2 wards on a jungle item.","replies":[]}]},{"poster":"Dehitay","date":"2015-11-15T22:15:47.860+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=Guiboulou,realm=NA,application-id=3ErqAdtq,discussion-id=Tq3UUkte,comment-id=,timestamp=2015-11-15T18:59:33.529+0000)\n>\nat least make a Sightstone equivalent for every class. \n\nThis is actually a stroke of genius. I didn't even think about this, but it would be perfect. Junglers and Supports already have one. All you need is something that's effective enough to be used on each class type, but not effective enough to be preferred over other things if you want to do more damage.","replies":[{"poster":"Guiboulou","date":"2015-11-16T02:02:33.239+0000","up_votes":3,"down_votes":0,"body":"Would actually be pretty cool and I don't think it would be that hard. Heck, they could even rework existing items that grant health and are not used much by slapping a Sightstone passive on 'em.","replies":[]}]},{"poster":"A Chaotic Mind","date":"2015-11-16T19:10:04.270+0000","up_votes":4,"down_votes":1,"body":"They choose to adopt a Dota 2 approach to vision by reducing the max amount of wards that a team can place (unless spending gold and item slots for vision). The aim of this change is to make impossible to just lit up the map and choke the enemy team from objectives like we see half of the time in the LCS. \n\nImo this is the right decision because you cant just spend 250 gold and ward half the enemy jungle when splitpushing or doing Baron/Drag. Also now every ward is more important and require to _think_ where and when u want to use it","replies":[{"poster":"DrNova","date":"2015-11-16T20:17:33.453+0000","up_votes":2,"down_votes":0,"body":"Another bad desicion based around pro play.\n\nYour average solo q team does not ward that heavy, and in average its maybe every other team that even wards efficiently.","replies":[{"poster":"TotalJerk","date":"2015-11-17T08:04:03.959+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=DrNova,realm=NA,application-id=3ErqAdtq,discussion-id=Tq3UUkte,comment-id=00140000,timestamp=2015-11-16T20:17:33.453+0000)\n> \n> Your average solo q team does not ward that heavy, and in average its maybe every other team that even wards efficiently.\n\nAnd this is inexcusable. I understand that Riot should not exclusively balance around pro play, but soloQ players aren't neglecting the vision game because of a lack of skill, they are failing to ward because they are often actively choosing to neglect it despite understanding the importance of vision. Riot should definitely not have to balance their teamwork and strategy focused game around shortsighted and/or selfish play, either. If a player knows what the right decision is, and chooses not to make said decision, then quite frankly, fuck them.","replies":[]},{"poster":"A Chaotic Mind","date":"2015-11-16T21:36:53.704+0000","up_votes":1,"down_votes":0,"body":"If the average soloq team doesn't focus on vision they shouldn't be hit as hard by this change. \nOn the other hand at the highest level of play 1-2 wards  can decide a game (think about going in blind in the baron pit). \n\nImo they should decide between raw stats or lot of vision not spend a total of 1300 gold (2 trinket+sighstone) and spam ward on cd closing the game at 10-15 min because the enemy can't even walk out of the base","replies":[]}]}]},{"poster":"Bladerunner7777","date":"2015-11-17T15:46:12.317+0000","up_votes":2,"down_votes":0,"body":"I'm a jungle main and I love the sightstone machete upgrade so I can't really complain","replies":[{"poster":"Guiboulou","date":"2015-11-17T22:25:29.174+0000","up_votes":1,"down_votes":0,"body":"Haha I wish mages had an equivalent item. ^_^","replies":[]}]},{"poster":"Chibi Templar","date":"2015-11-17T05:55:39.476+0000","up_votes":2,"down_votes":0,"body":"I feel like I'm back in Season 1 where almost NOBODY fucking warded.","replies":[]},{"poster":"Mestm97","date":"2015-11-17T05:51:20.914+0000","up_votes":2,"down_votes":0,"body":"Im just like you, Mid Top or even ADC i used to upgrade my trinked ASAP now i have to use the blue one and ward my jungle so i have the false ilusion im helping with vision","replies":[{"poster":"Guiboulou","date":"2015-11-17T13:34:00.756+0000","up_votes":1,"down_votes":0,"body":"At least we can scout areas every minute if we accept to give the enemies half a minion's worth in gold. I don't like this, but it's better than warding your own jungle all the time I guess. T_T","replies":[]}]},{"poster":"Boswick","date":"2015-11-16T23:27:41.624+0000","up_votes":2,"down_votes":0,"body":"I always take the tracker jungle item this season for that reason. No clue why riot deleted green wards. At least pinks are cheap now.","replies":[]},{"poster":"BadmoonBC","date":"2015-11-16T21:38:37.156+0000","up_votes":2,"down_votes":0,"body":"Amen man\nI always was proud that I would ward just as\nMuch as the support(I'm a mid main), and now we never have vision\nThanks rito","replies":[{"poster":"Guiboulou","date":"2015-11-16T22:38:36.905+0000","up_votes":1,"down_votes":0,"body":"{{item:3070}}","replies":[]}]},{"poster":"Kal Vas Flam","date":"2015-11-16T21:04:43.690+0000","up_votes":1,"down_votes":1,"body":"They probably got tired of seeing ward wars in pro games and decided to nerf vision. I don't really see the issue here tbh. Yeah, you're blind, but so is the other team. I mean people act like they're at an unfair advantage or something.","replies":[{"poster":"Guiboulou","date":"2015-11-16T21:08:18.883+0000","up_votes":1,"down_votes":0,"body":"Oh, I am not saying I'm at an unfair advantage. It's just... at my elo, people ward little. I had crazy vision control all by myself. More often than not, I had a total of wards placed that exceeded the amount of wards placed by the entire enemy team. Hence, for those who warded a lot, it is a punishment. We lose the advantage we had over those who did not care much about warding, and they somewhat win since we get pulled back to their level. Do you get my point of view? =/","replies":[{"poster":"Kal Vas Flam","date":"2015-11-16T21:10:03.658+0000","up_votes":2,"down_votes":0,"body":"I see, so what you need to do here is main {{champion:92}}. Then you won't have this issue of shitty low ELO players not warding anymore, well at least not for much longer.","replies":[{"poster":"Guiboulou","date":"2015-11-16T21:12:20.066+0000","up_votes":1,"down_votes":0,"body":"Oh God, I wasn't expecting that hahaha. But why would I want my enemies to ward? D:","replies":[]}]}]}]},{"poster":"FiniteParadox22","date":"2015-11-16T20:36:16.420+0000","up_votes":2,"down_votes":0,"body":"Honestly I don't understand why they didn't just make the upgrade free at level 9. Rather than all this bonkers just slaughter vision control for no apparent reason.","replies":[{"poster":"Guiboulou","date":"2015-11-16T21:02:45.305+0000","up_votes":1,"down_votes":0,"body":"Well, I guess free vision cannot be crazy good. There has to be at least a small cost to good vision control. I was actually expecting them to make the trinket upgrades more expensive. ô.o But anything would be better than what we have right now. :(","replies":[]}]},{"poster":"PandahHeart","date":"2015-11-16T18:55:54.398+0000","up_votes":2,"down_votes":0,"body":"I always bought wards when I played mid lane. Then I loved my upgrade at level 9 so I could keep placing wards. Sometimes I would look at the after game stats and noticed I placed the second most wards on my team, sometimes even the most, as a mid laner. If the sight stone had a great upgrade for mid laners (well I mostly play ap mages or ap assassins) I would definently buy one. \n\nA few times last season I tested out getting a sight stone on my mid lane, if I was snowballing. It worked but I preferred upgrading my trinket so I could have unlimited wards.","replies":[]},{"poster":"EcchiOtakuTM","date":"2015-11-16T17:13:28.864+0000","up_votes":2,"down_votes":0,"body":"Mages weren't nerfed but everyone agrees yellow should have never been nerfed I need 2 wards at lvl 9 I always upgraded for 2 wards at lvl 9\n\n\nNow I can only have 1 on my top/mid the bot lane however I do admit as an adc I only used yellow until I could upgrade to the blue ranged one","replies":[]},{"poster":"hhaavviikk","date":"2015-11-16T16:59:15.506+0000","up_votes":2,"down_votes":0,"body":"the blue trinket is a better ward trinket then the ward trinket","replies":[]},{"poster":"katsup","date":"2015-11-16T15:54:24.200+0000","up_votes":2,"down_votes":0,"body":"I couldn't agree more. The ward changes are terrible. Even sightstone only holds 3 charges instead of 4. As a support, I haven't bothered to upgrade to sweepers anymore because i need to use the free trinket plus sightstone just so I don't have to go back to the store every 3 minutes. To be fair, at my level it doesn't hurt me too much (since hardly anyone wards), but I know how important vision is to winning and it has turned around games for me in the past. I really wish they would add the old trinket, even if you have to pay for it. It was the best 250g ever spent.","replies":[]},{"poster":"Randomonium","date":"2015-11-16T13:09:39.769+0000","up_votes":2,"down_votes":0,"body":"Yeah, I feel like I'm getting punished this season. In the mid game I would light up the enemy jungle so we could rotate with ease and get picks but now I can't do that alone anymore.","replies":[]},{"poster":"Dethkilr","date":"2015-11-16T06:11:47.494+0000","up_votes":2,"down_votes":0,"body":"Agree 100%. Just keep the trinket the same and let us pay gold to upgrade it to how it used to be. But dear god the whole map is so dark now because even with these new wards it seems like only one person on the team decides to use them (EVEN THOUGH THEY ARE FREE). Lower the cooldown of getting a new ward so that we can actually reach the 3 ward limit. Why the hell should it be there if the only person who can reach it is the support?","replies":[]},{"poster":"magic pole","date":"2015-11-15T21:50:54.968+0000","up_votes":2,"down_votes":1,"body":"yes and i also don't like blue bc i believe it gives like 15 gold for killing. Those can really add up.\n\nim unsure about their direction, but it seems like warding as a team is the best method, and i like that encouragement. however this is solo q were talking about so idk","replies":[]},{"poster":"Sinister Anubis","date":"2015-11-17T16:02:52.206+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Guiboulou,realm=NA,application-id=3ErqAdtq,discussion-id=Tq3UUkte,comment-id=,timestamp=2015-11-15T18:59:33.529+0000)\n>\n> Wards. I cannot comprehend the reasoning behind this decision. I am a mage main. I don&#039;t mind the AP itemization nerfs that much. I can live with the mana changes. I cannot under any circumstances accept the fact that I have literally no way to place more than one ward at a time (+1 pink I might not always be able to defend) unless I buy a Sightstone.\n> \n> I used to upgrade my yellow trinket first thing after getting to level 9. I&#039;d always have a ratio of approximately one ward per minute at the end of the game. 3 wards on the map at all time post-level-9. The upgraded yellow trinket was my best friend last season. It was so amazing. I had a mini-Sightstone that was slot and cost efficient. I have been stripped from it. We have been stripped from it. I thought trinkets were supposed to allow the rest of the team to easily lend a helping hand to supports with map vision. Now, unless we use the blue trinket and manage to place our fragile wards in places the enemies won&#039;t destroy them, we cannot help much. The new yellow trinket is worse than the old non-upgraded one. You need twice the level now to get the same efficiency as before, and that is WITHOUT THE POSSIBILITY TO PLACE MORE THAN ONE WARD AT A TIME. I don&#039;t get it.\n> \n> And I am terribly disappointed. I understand this is a pre-season and that nothing is set in stone, but the season 2O16 better not carry on with the actual vision state. If that&#039;s really what you guys at Riot are going for, at least make a Sightstone equivalent for every class. Do something. Just because baddies didn&#039;t ward does not mean those who did have to pay.\n> \n> Explain yourself. Fix things. Please.\n> \n> **TL;DR - Ward changes make me sad. Impossible to place more than 1 ward + 1 pink unless you buy Sightstone. And NO, extremely fragile wards [blue trinket upgrade] do not satisfy me. **\n\neven tho you have a ward doesn't mean you will place it. It makes it so you dont need to spend the money on the wards it feels much like season 1","replies":[]},{"poster":"CasterGilgamesh","date":"2015-11-16T20:55:09.074+0000","up_votes":1,"down_votes":1,"body":"I'm fine with the vision changes as a support I already ward I just have two suggestions \n1.increase the amount of wards each player can place \n2.drastic increase in the amount of ward charges in items such as sight stone and the jungler item.\n3.fuse targonembrace and items like that with the sight stone so supports don't need to chose \n4.let the yellow trinket hold 3 wards.\n5.increase the duration of the red trinket and its range","replies":[{"poster":"Guiboulou","date":"2015-11-16T21:04:40.055+0000","up_votes":1,"down_votes":0,"body":"I would actually hate to see the amount of wards each player can place increase. I think it would be a terrifying pressure for supports, since everyone would expect them to have the entire map lit all by themselves. It would be season 2 all over again. .-.","replies":[{"poster":"CasterGilgamesh","date":"2015-11-16T21:42:57.384+0000","up_votes":1,"down_votes":0,"body":"The thing different from season 2 is now supports save tons of money and get sight stone plus gold income items now junglers also get a free sight stone if they chose which really helps I had in mind letting people place 5 wards on the map and let stone and the jungle stone carry 10 wards carries can have yellow having Three wards this helps in landing and in late game.as I support im fine with having to ward I love contributing with the vast majority of wards and I hope the jungler stone can get the jungler to be involved as well and if riot could just take it a step father with my idea Vision could be at its strongest without being a burden on the carries as much. Ps I love the new blue upgrade its so useful as a support player who reaches the max amount of wards really fast plus that range is godly","replies":[]}]}]}]}