{"poster":"RGuerreroZ","date":"2017-12-16T02:03:33.497+0000","title":"¿seria bueno o malo personificar un campeón?","subforum":"Charlas Generales","up_votes":2,"down_votes":3,"body":"Cuando hablo de personificar, es que en el chat usar hablar con la actitud que tiene este campeon, sea actitud seductora con ahri (aunque seas hombre), Una actitud agresiva con Darius, Una tenebrosa con Thresh, egoc&eacute;ntrica con Draven, o alegre con Lux, obviamente con los campeones que tienen una actitud positiva no deber&iacute;a de haber ning&uacute;n problema, pero seria tan malo personificar un campeon aunque este sea malo, por ejemplo a mi me gusta mucho usar Darius, Aureli&oacute;n sol, Draven, thresh, etc, personajes que tal vez en un dialogo no serian muy agradables, me gustaria que al usarlos poder hablar como si yo fuera ellos, lo cual haria el juego que en si tmb esta en la categoria de Rol, no deberia ser mucho problema, pero que opinan","replies":[{"poster":"BG King Fratus","date":"2017-12-16T02:22:17.377+0000","up_votes":3,"down_votes":0,"body":"Eso va a depender mucho. Como hoy en dia la comunidad es muy sensible, si tiras frases egocentricas o sobradoras como Draven, te van a pedir report.\n\nDe todas formas, siempre que uso Taric y mis enemigos estan stackeando armadura, nunca falta mi frase de: \"Ni tanta armadura va a resistir tanta penetracion :* \" {{champion:44}}","replies":[{"poster":"Yamisuke","date":"2017-12-16T02:45:52.191+0000","up_votes":2,"down_votes":0,"body":"Yo cuando me toca gente mala digo: \"Por que siempre me tocan los feos?\" O lo pienso(?","replies":[]}]},{"poster":"Jınx","date":"2017-12-16T02:21:30.283+0000","up_votes":2,"down_votes":1,"body":"Creerte un personaje de lol? Cada dia mas locos estos foreros","replies":[{"poster":"RGuerreroZ","date":"2017-12-16T02:43:38.995+0000","up_votes":1,"down_votes":0,"body":"men, tienes el nombre de jinx como tu nick, dime que no te gustaria hablar en el chat como ella, tanto como burlarte como animar a tu equipo","replies":[]}]},{"poster":"KongosLover","date":"2017-12-16T02:15:50.543+0000","up_votes":1,"down_votes":0,"body":"Pregunta rara pero interesante, yo opino que aunque en determinadas situaciones pueda ser gracioso, adoptar una actitud \"egocéntrica\" (por poner un ejemplo) con Draven, no aportaría mucho a tus aliados, por no decir que resta... Todo lo que pueda resultar de molestia para tus compañeros es mejor evadirlo. \nIgualmente, depende de la situación que te encuentres, lo mejor en una partida es siempre ser positivo (sin rallar en ser un bob esponja, que está cada 2 segundos diciendo un comentario, para que al final te muteen)\nComo te repito, tu situación es extraña pero yo no le veo nada de malo personificar a un campeón mientras no afectes a otros! Y en todo caso, me imagino que la mayoría estamos para divertirnos {{sticker:slayer-jinx-wink}} \nSuerte!","replies":[{"poster":"RGuerreroZ","date":"2017-12-16T02:48:52.960+0000","up_votes":1,"down_votes":0,"body":"bueno el punto de personificar es que sea gracioso, sea mas animada la partida y en si que todos se diviertan mas, en lo que podria ser solo una partida común y corriente, en una partida epica, por que todos fueron su personaje","replies":[]}]},{"poster":"Oblivion awaits","date":"2017-12-16T02:19:02.862+0000","up_votes":1,"down_votes":0,"body":"El hilo más turbio que lei en el foro.","replies":[{"poster":"RGuerreroZ","date":"2017-12-16T02:47:42.752+0000","up_votes":1,"down_votes":0,"body":"en que sentido?","replies":[]}]},{"poster":"Hnk Kenshiro","date":"2017-12-16T02:22:18.475+0000","up_votes":1,"down_votes":0,"body":"Si molesta a la gente y te reporta, es malo.\n\nSi no les molesta, pos no.","replies":[]},{"poster":"Wawüz","date":"2017-12-16T02:12:23.980+0000","up_votes":1,"down_votes":0,"body":"Supongo que esta bien si juegas con amigos, despues en partidas de emparejamiento creo que es irrelevante y hasta puede resultar molesto para algunos.","replies":[]}]}