{"poster":"RGuerreroZ","date":"2018-01-25T19:18:32.552+0000","title":"¿por que en top se da que se rompen ciertos campeones que en sus posiciones no lo estan?","subforum":"Charlas Generales","up_votes":3,"down_votes":1,"body":"antes del mini rework xin zao tenia una fuerte jugabilidad en la linea superior (lo se por que lo usaba ahi), lo cual lo ayudaba a carrear partidas facilmente (para algunos fue bendito ese mini-rework, para otros una maldici&oacute;n), pero tmb hay varios carris, como en el caso de vayne, que siendo un campeon de late, en early en top se vuelve un problema puesto que la distancia y el da&ntilde;o verdadero de su w perjudica a muchos tanques mele, los cuales abundan en top, tmb se dio el caso de talon, despues del mini rework de asesinos, se volvio un campeon que no podias gankear, por lo grueso de los muros, un salto de cualquier campeon no podia superarlo, tmb esta el caso de tahm kench, un soporte, que en su posici&oacute;n original no destaca tanto, mas que para desenganchar al adc ante un gank o ataque enemigo, ya que sus mecanicas a diferencia de otros soportes tanques, como blitz, thresh, alistar, braum, entre otros estan dise&ntilde;ados para perjudicar a los adc, o campeones a distancia, tahm esta para joder a meles, lo cual en top, es una pesadilla por su conjunto de habilidades, otro caso es k6 y rengar, la cual al haber 3 arbustos sus pasivas obtienen un plus que en la jg al gankear no tienen, que es el da&ntilde;o constante de estos, rengar es capaz de derretir tanques producto de esto, y k6 fedearse hasta mas no poder si le tocan campeones sin mucha movilidad","replies":[{"poster":"Hell Darking","date":"2018-01-25T19:32:35.387+0000","up_votes":1,"down_votes":0,"body":"^^^^^\nbest advice ever","replies":[]},{"poster":"LeVampire","date":"2018-01-25T19:25:57.001+0000","up_votes":1,"down_votes":2,"body":"Porque algunos campeones mientras más lejos estan de su Equipo ganan +50 de Daño y +100 de Vida.\n\nJk.   PORQUE LA GENTE SABE JUGARLOS y ya!.  Countea, informate de que hace cada Personaje y Ya.","replies":[{"poster":"RGuerreroZ","date":"2018-01-25T21:47:55.257+0000","up_votes":1,"down_votes":0,"body":"men, te puedo decir que incluso sin saber jugarlos, a un darius lo mantuve bajo su torre por que tenia miedo de tradear cuando use a tahm, lo mismo con vayne o graves, solo por que le parti la madre, y esto fue cuando recien compre lo campeones","replies":[]}]}]}