{"poster":"RGuerreroZ","date":"2018-01-01T04:03:02.510+0000","title":"¿que campeones tienen habilidades que pueden ser perjudicadas por aliados?","subforum":"Charlas Generales","up_votes":6,"down_votes":0,"body":"pensando en Ryze que usa los minioms para ejercer su efecto domino y alcanzar con mayor facilidad al enemigo, pero si estos son asesinados por los aliados puede perder el ritmo y quedar sin da&ntilde;o en masa, algo similar pasa con swain y su R, quien puede usar los minioms para que su R mande cuervos y al regresar le mantengan sanando de forma prolongada durante una batalla, pero que otros campeones tienen habilidades que dependen que sus aliados no hagan algo en especial para que funcione su combo o alguna habilidad en especial","replies":[{"poster":"Juice Wrld","date":"2018-01-01T09:48:54.776+0000","up_votes":4,"down_votes":0,"body":"Los Tahm Kench te comen y se flashean entre los 5.\n\nTengo traumas y que :v","replies":[]},{"poster":"UnMainMordeTonto","date":"2018-01-01T07:21:47.739+0000","up_votes":2,"down_votes":0,"body":"La E de zoe, si le pegan antes de que llegue tu Q, GG combo.","replies":[{"poster":"Nôll","date":"2018-01-01T13:17:22.487+0000","up_votes":1,"down_votes":1,"body":"No te olvides de su W. Yo la uso de supp y si mi adc no me deja los globos me corta mucho las alas (no puedo curarlo, no puedo aplicarle cc a los enemigos, no puedo dañarlos). \nEl tema es que gasto mucho maná como supp combeando muchas veces a los enemigos y tener algo en mi w hace mucha diferencia.","replies":[]}]},{"poster":"Mazer Rakham","date":"2018-01-01T04:47:55.740+0000","up_votes":2,"down_votes":0,"body":"Aparte de los que te dijeron, Anivia con el muro puede dejarte mal parado o salvar al enemigo (igual que Taliyah con su R)\nLa cantidad de Alistar que movieron enemigos para el otro lado creo que es incontable","replies":[]},{"poster":"Nisinunglacert","date":"2018-01-01T04:21:37.427+0000","up_votes":2,"down_votes":0,"body":"Todos los champ que tienen habilidades que afectan de igual manera a enemigos y aliados. Ejemplo: Bardo, Taliyah, etc.\nO sino los champ como Tahm Kench que te pueden cortar un combo, ya sea por quitarte a tu objetivo o quitarte a **vos** del medio de la pelea.","replies":[]},{"poster":"Tomas3D","date":"2018-01-01T04:18:32.960+0000","up_votes":2,"down_votes":0,"body":"-yasuo por ejemplo nescesita minions tambien\n-todas las habilidades de canalizacion pueden ser interrumpidas si un trundle te tira un pilar de hielo adecuado\n-R's como por ejemplo la de nunu pueden ser arruinadas por la r de poppy\n-las R's de miss fortune,vel koz,etc son arruinadas si un aliado aleja al objetivo.\n-Tahm kench puede arruinar todo tipo de habilidad que nescesite canalizar o no te puedas mover mientras la lanzas solo con comerselos\n-La R de sion puede ser interrumpida por el pilar de trundle\n-Un tahm kench puede comerse a un zilean mientras tiro su r para salvarse y soltarlo en medio de la tf cuando se le acabo :V\n\nesos son todos los que conosco","replies":[{"poster":"dscpnak","date":"2018-01-01T18:10:52.100+0000","up_votes":1,"down_votes":0,"body":"la r de sion la para el pilar? seguro? no se ee","replies":[{"poster":"Only Supp0rt","date":"2018-01-01T18:22:03.231+0000","up_votes":1,"down_votes":0,"body":"Sion choca contra algo para parar, con lo que sea, Campeones, estructuras, y eso xd. El pilar si lo para xd","replies":[{"poster":"dscpnak","date":"2018-01-01T18:37:29.230+0000","up_votes":1,"down_votes":0,"body":"aaaaaaaaaa vos decis chocando ahora si, pense que si lo movia con el pilar a sion lo frenaba","replies":[{"poster":"Tomas3D","date":"2018-01-01T19:47:28.782+0000","up_votes":1,"down_votes":0,"body":"la r de sion se para hasta con el zz {{item:3512}}","replies":[]}]}]}]}]},{"poster":"Rick Silence","date":"2018-01-01T04:20:19.405+0000","up_votes":1,"down_votes":0,"body":"Todos los campeones con skillshot pueden ser perjudicados por campeones con habilidades que muevan a los enemigos de lugar.\nY tahm kench comiendo a los aliados en momentos poco oportunos, puede perjudicar a todos los campeones :v","replies":[{"poster":"Néd Stark","date":"2018-01-01T06:23:20.098+0000","up_votes":2,"down_votes":1,"body":"No solo skillshots, me ha pasado que siendo amumu y al momento de ultear, Jannas y bardos aliados han ulteado estropeándome todo.","replies":[]}]},{"poster":"Lapou","date":"2018-01-01T21:03:05.325+0000","up_votes":1,"down_votes":0,"body":"Kalista que te mete la lanza en medio del rio y te viola el team enemigo :v un clasico","replies":[]},{"poster":"MarKowniKoff","date":"2018-01-01T17:31:56.952+0000","up_votes":1,"down_votes":0,"body":"La cura de nami daña a brand(? ah no que asi no funciona? xd","replies":[]},{"poster":"CoronavirusC0V","date":"2018-01-01T15:04:19.911+0000","up_votes":1,"down_votes":0,"body":"la R de jarvan, me ha pasado que me han dejado encerrado bajo torre y yo he echo lo mismo pero en la ulti de rumble xD, tambien habilidades de empuje como son la de alistar, janna, vayne que una que otra vez has visto como salvan al enemigo y este se va tan tranquilo a un basico de vida","replies":[]},{"poster":"Soviet Yunyun","date":"2018-01-01T04:34:56.285+0000","up_votes":1,"down_votes":0,"body":"pues se me ocurren estas ademas de las mencionada, la Q de irelia que resetea el cd al asesinar un minion, irelia puede usar los minion para saltar y acercarse al enemigo, evadir habilidades u otras cosas, la Q de mf que si mata un minion el rebote hace mas daño.","replies":[]}]}