{"poster":"Teie","date":"2017-12-03T17:57:26.482+0000","title":"Sugerencia Para Riot  [[Nombres de Invocador]] - Ayuda de la comunidad-","subforum":"Charlas Generales","up_votes":4,"down_votes":2,"body":"Hoy por la tarde estaba buscando nombres de invocador para utilizar y me encontr&eacute; con que algunos de estos eran inutilizables (ya estaban en uso). Pero lo que mas me llam&oacute; la atenci&oacute;n fue que varios de estos nicks estaban en propiedad de cuentas de nivel uno. S&eacute; que &eacute;sta informaci&oacute;n es irrelevante al deliberar sobre esta sugerencia pero a lo que quiero llegar es:\r\n&iquest;Por qu&eacute; riot no borra las cuentas abandonadas? (o no borra las cuentas pero el nombre de invocador si) &iquest;Por qu&eacute; desperdiciar tantos buenos nicks para cuentas que nunca tuvieron un uso?\r\nS&oacute;lo quer&iacute;a aclarar esto y al menos las cuentas que hace tiempo no est&aacute;n activas se les borre el nick (obviamente enviar un aviso antes de ser borrado su nombre de invocador). Gracias, s&oacute;lo deseaba llamarme &quot;Bosnio&quot;. (Y)","replies":[{"poster":"ZanahoriaAsesina","date":"2017-12-03T19:17:32.648+0000","up_votes":2,"down_votes":0,"body":"> Gracias por contactar con el equipo de Soporte. Con respecto a tu consulta el sistema que se encarga de la limpieza de los nombres de Invocador lo hace de forma automática cuando estos cumplen los requisitos estipulados.\n\n> Desde Soporte no podemos cambiar ni modificar ningún nombre de Invocador que esté todavía en uso, por tanto, la mejor manera de comprobar si el nombre está disponible o no, es intentado hacer el cambio en la tienda. Si este se encuentra libre podrás cambiarlo, sino lo está te avisará de que ese Invocador todavía está en uso.\n\n;__;","replies":[]},{"poster":"Score","date":"2017-12-03T18:39:15.813+0000","up_votes":2,"down_votes":0,"body":"la ultima actividad del nombre de invocador \"bosnio\" lvl 5 fue hace 2 semanas","replies":[]},{"poster":"SKT T1 Bank","date":"2017-12-03T18:02:32.733+0000","up_votes":1,"down_votes":3,"body":"Esto se hace, se te pone un nick de geroglificos si te toman la cuenta por abandonada, pero si esta baneada entonces permanece ahi el nick.\n\npreguntale a los de soporte.","replies":[{"poster":"Nuke","date":"2017-12-03T18:05:58.235+0000","up_votes":1,"down_votes":0,"body":">  se te pone un nick de geroglificos \n\nLOL\n¿Me mostrás alguna? xD","replies":[{"poster":"vaVav","date":"2017-12-03T18:23:07.564+0000","up_votes":1,"down_votes":0,"body":"Es mentira.","replies":[{"poster":"Nuke","date":"2017-12-18T22:29:24.454+0000","up_votes":1,"down_votes":0,"body":"¡¡¡AHHHH NOOOO!!!\nInterveniste en mi conversacion con Bank, estoy OFENDIDA ahora mismo, la verdad, INDIGNANTE tu conducta Nova.\n\nCof cof es broma no te lo tomes enserio como lo de antes, Cof cof.","replies":[{"poster":"vaVav","date":"2017-12-18T22:35:50.114+0000","up_votes":1,"down_votes":0,"body":"Me parece interesante el hecho de que te hayas gastado buscando algo antiguo para destacar un punto el cual gané, con la finalidad de quedar mejor después de arrebatar cualquier argumento que poseías. La gente normalmente lo hace cuando discute conmigo.\n\n¿Será tradición? No lo se, pero me acostumbré.\n\nAdemás, el comentario está muy mal escrito, ya que con dos palabras podrías haberte expresado mucho mejor; De nada.\n\nPues si, te arruiné la ilusión, es cierto, pero te \"salvé\" de quedar como ignorante. O al menos destacarlo. Nuevamente.\n\nPor otra parte, el comentario viene totalmente al caso, dado a que es una respuesta final al planteamiento del hilo, no como en tu caso.\n\nNo respondas, no hace falta, ahórrate la molestia de quedar mal nuevamente.","replies":[{"poster":"Nuke","date":"2017-12-18T22:43:49.928+0000","up_votes":1,"down_votes":0,"body":"> Me parece interesante el hecho de que te hayas gastado buscando algo antiguo para destacar un punto\n\nEs un chiste, no lo uso como argumento, es tonto jajaja.\n\n> un punto el cual gané, con la finalidad de quedar mejor después de arrebatar cualquier argumento que poseías. La gente normalmente lo hace cuando discute conmigo.\n\nSi, man ganaste. SEGURO :v\nNo quedo mejor, es solo un chiste como ya dije y no lo uso como argumento.\n\nNo me arrebataste ningún argumento hasta ahora, bueno, tal vez si, pero los respaldé con otros para salir ganando c:\n\n> Además, el comentario está muy mal escrito, ya que con dos palabras podrías haberte expresado mucho mejor; De nada.\n\nAcá no entendí nada tampoco v:\n\n> Pues si, te arruiné la ilusión, es cierto, pero te \"salvé\" de quedar como ignorante. O al menos destacarlo. Nuevamente.\n\n\"\"\"Nuevamente\"\"\"\"\nClaro, porque, cada vez que Kenshiro hace una encuesta o duda, no le estamos respondiendo o resolviendo la duda. No, estamos \"Salvándolo de su ignorancia\". Si, si. \n\n> Por otra parte, el comentario viene totalmente al caso, dado a que es una respuesta final al planteamiento del hilo, no como en tu caso.\n\nSi, pero es un chiste, no un argumento.\nSe que esta fuera de contexto y en circunstancias diferentes :P\n\n> No respondas, no hace falta, ahórrate la molestia de quedar mal nuevamente.\n\nLo ponés al final, que oportuno :v\nClaro, porque yo \"quedé mal\". Es raro (En este caso directamente no lo es) quedar mal en un debate el cual yo gané. Lo siento si te humillé, no era mi intención. \n\nSaludos.","replies":[{"poster":"vaVav","date":"2017-12-18T22:45:56.284+0000","up_votes":1,"down_votes":0,"body":"Recién veo el comentario que pusiste. Debes avisar en casos así, no llega la notificación si no sigue en un hilo. Responderé en uno anterior para que se creen más espacios.","replies":[{"poster":"Nuke","date":"2017-12-18T22:48:55.861+0000","up_votes":1,"down_votes":0,"body":"Ni te molestes.\nY si ya lo hiciste, srry pues xD.\n\nNo tengo ganas de discutir mas. Tal vez lo lea para reirme, pero escribir de un tema tan absurdo es cansador. Y valla que absurdo, fue un comentario cómico al que reaccionaste mal.\n\nSi querés tomarte esto como un /ff, tomatelo asi, total me da igual que la gente se sienta orgullosa de un \"logro\" que consiguieron sin siquiera haga una jugada próxima la otra persona.","replies":[{"poster":"vaVav","date":"2017-12-18T23:15:35.077+0000","up_votes":1,"down_votes":0,"body":"Si la otra persona no hace una \"jugada próxima\" obvio que será un logro, victoria, merito o como se lo pueda tomar cualquiera.\n\n¿O qué suponías? ¿Que si en un debate público no respondes saldrás empatando o algo así?","replies":[]}]}]}]}]}]}]},{"poster":"SKT T1 Bank","date":"2017-12-03T18:54:58.975+0000","up_votes":1,"down_votes":0,"body":"te ponen letras y numeros como un codigo, mis amigos que vinieron de na tienen cientos de smurfs de cuando daban rp por referidos, n ose si sabias eso y esas cuentas quedaron en el olvido andan lvl 5 lvl 10 y por ahi, y tienen nombres como\n\nadadsf3r1f41g41g\n\ny antes se llamaban Magodeoz, por ejemplo.","replies":[]},{"poster":"Katastrofica","date":"2017-12-03T18:41:57.483+0000","up_votes":1,"down_votes":0,"body":"En teoría, te ponen lo mismo que si te banean por nombre inapropiado, nada más :(","replies":[]}]}]},{"poster":"vaVav","date":"2017-12-03T18:05:04.521+0000","up_votes":1,"down_votes":0,"body":"Se hace. Pero tienen que pasar un tiempo hasta que se pueda.\n\nActualmente son seis meses más uno por cada nivel de la cuenta. Creo que hay formas para ver cuando estarán disponibles, pero no las recuerdo.","replies":[{"poster":"Teie","date":"2017-12-03T18:07:32.061+0000","up_votes":1,"down_votes":0,"body":"hice una cuenta con X nombre hace 3 años (inactiva), y sigue estando ahí...","replies":[{"poster":"vaVav","date":"2017-12-03T18:16:05.135+0000","up_votes":1,"down_votes":0,"body":"Hasta que nadie reclame el nick sigue siendo de propiedad del usuario que le creó.","replies":[{"poster":"Teie","date":"2017-12-03T19:13:28.255+0000","up_votes":1,"down_votes":0,"body":"ya lo reclamé varias veces","replies":[{"poster":"vaVav","date":"2017-12-03T19:54:28.115+0000","up_votes":1,"down_votes":0,"body":"¿A la cuenta que hiciste hace tres años?","replies":[{"poster":"Teie","date":"2017-12-03T21:01:33.836+0000","up_votes":1,"down_votes":0,"body":"sep","replies":[{"poster":"vaVav","date":"2017-12-03T21:02:48.568+0000","up_votes":1,"down_votes":0,"body":"¿Me dices el nick, por favor?","replies":[{"poster":"Teie","date":"2017-12-03T21:11:48.766+0000","up_votes":1,"down_votes":0,"body":"Teie","replies":[{"poster":"vaVav","date":"2017-12-03T21:18:06.885+0000","up_votes":1,"down_votes":0,"body":"Acabo de intentar cambiarme el nick a ese y me dio que está habilitado :l","replies":[]}]}]}]}]}]}]}]}]}]}