{"poster":"KazuelaRealRap","date":"2017-10-07T01:30:08.032+0000","title":"¿Hay alguna forma de no participar de las MISIONES?","subforum":"Problemas Técnicos","up_votes":5,"down_votes":4,"body":"A algunos les parecera que estoy loco, o lo que sea.\r\nPero no quiero iconos gratis que no me interesan por ganar 1 partida.\r\nHay alguna forma de no estar en las misiones, sin que influya un rioter modificando algo o sin el factor de no tener que jugar?\r\nYo s&eacute; que van a decir que es solo un icono bla bla bla pero es algo m&aacute;s profundo","replies":[{"poster":"vaVav","date":"2017-10-07T01:35:16.934+0000","up_votes":3,"down_votes":1,"body":"Mhh.. No existe un botón para desactivarlas la verdad, creo que muy pocos son los que no quieren realizarlas.\n\nPor otra parte, solo te podría recomendar que no equipes ningún icono de Worlds, para evitar sacar cualquier misión que precise de este. Tampoco las juegues si te lo ofrecen, aun que esto es muy obvio.\n\nPero no veo el problema real en sacarlas, te dan **Piezas de Worlds** con las que puedes desbloquear cosas mucho más interesantes que un icono que, si no te gusta, nadie te obligará a usarlo :P","replies":[{"poster":"KazuelaRealRap","date":"2017-10-07T01:44:47.224+0000","up_votes":1,"down_votes":3,"body":"A mi las misiones complejas no me molestan porque las evito, pero esas del icono por ganar una partida me joden de manera radical, solo el que riot me lo de ya me pone en un debate mental por el perfeccionismo bla bla bla, la cosa es que deberían poder desactivarse, no ser obligatorias xd, igual gracias por la respuesta","replies":[{"poster":"Danshid","date":"2017-10-07T11:06:18.517+0000","up_votes":1,"down_votes":0,"body":"No entiendo en que manera te puede joder un icono mas (?)","replies":[]}]}]},{"poster":"Aslicolly17","date":"2017-10-07T02:13:02.267+0000","up_votes":1,"down_votes":0,"body":"yo ignoro las misiones, solo cumplí una que es obligatoria pero las demás requieren de un ícono en especial equipado y esas no las tomo en cuenta y sigo con mi vida","replies":[]},{"poster":"InsTicC","date":"2017-10-07T02:07:13.760+0000","up_votes":1,"down_votes":0,"body":"Ignorando las misiones :D","replies":[]}]}