{"poster":"LuserHD","date":"2016-08-15T23:38:50.319+0000","title":"Hacker Attacke und Verhalten von Riot!","subforum":"Hilfe & Support","embed":{"description":"Meine Accounts wurden gehackt und das ist passiert! ► Instagram: https://instagram.com/mrmaikap_/ ► Twitch Stream: http://www.twitch.tv/mrmaikap ► LOLCommunity http://www.youtube.com/MrMaikAp ► Facebook https://www.facebook.com/Mrmaikap","url":"https://www.youtube.com/watch?v=YFoUKYpQ7lQ","image":"https://i.ytimg.com/vi/YFoUKYpQ7lQ/hqdefault.jpg"},"up_votes":2,"down_votes":3,"body":"Wahrscheinlich haben das schon mehrere gemacht,aber ich schreibs jetzt einfach nochmal. Das was  Maik erz&auml;hlt hat, wie ihr(Riot) euch verhalten habt , ist unter aller Sau. Wie kann man nur so wenig Respekt und Vertrauen in eine Person, die die LoL-Community in Deutschland ernsthaft gepr&auml;gt hat, haben. EInfach nur l&auml;cherlich! Ich hoffe ich kann mit diesem Eintrag ein bischen was bewegen!","replies":[{"poster":"Sree","date":"2016-08-16T05:02:07.522+0000","up_votes":1,"down_votes":0,"body":"Mehrere Themen zu erstellen erreicht genau den gegenteiligen Effekt, von dem, was ihr euch wuenscht. Ihr wollt Aufmerksamkeit und das jeder es liest? Dann schreibt alle in das gleiche Thema, damit es auf der Frontseite bei den heissen Themen landet. Wenn ihr eure Kommentare auf viele verschiedenen Themen aufteilt, landet keines davon oben.\nNutzt am besten das bisher groesste Thema dazu, um das zu erreichen: [Riot: Wir stehen zu unserer Inkompetenz](http://boards.euw.leagueoflegends.com/de/c/hilfe-support-de/fcm9L60o-riot-wir-stehen-zu-unserer-inkompetenz)","replies":[]},{"poster":"Sirrkas","date":"2016-08-15T23:40:45.610+0000","up_votes":3,"down_votes":2,"body":"Er sagt doch in dem Video selbst, dass er mit den Informationen, die für eine Anfrage beim Support zum erhalten der Accountdaten freizügig umgegangen ist. Vielleicht hat der \"Hacker\" sogar die Infos direkt aus seiner Nase gezogen.","replies":[{"poster":"schmatziHD","date":"2016-08-16T00:00:30.831+0000","up_votes":2,"down_votes":1,"body":"***","replies":[{"poster":"LuserHD","date":"2016-08-16T00:08:11.800+0000","up_votes":1,"down_votes":0,"body":"Nein! Ich würde die freie Meinung von einem niemals bannen! Genau so was möchte ich doch bewirken!Feuer in der Diskussion!{{champion:1}}","replies":[{"poster":"Sirrkas","date":"2016-08-16T00:47:39.428+0000","up_votes":1,"down_votes":0,"body":"Niemand wird für seine Meinung gebannt. Wenn die Mods aber seine \"Meinung\" sehen (viele Flamer nennen ihre Beleidigungen hier gerne \"Meinung\"), die in etwa so aussieht \n>Und wenn es so wär dann währ Riot ohne Scheiss einfach nur..........ein stück Scheisse. \n\nkann ich mir gut vorstellen, dass der Post deswegen gelöscht wird und nicht wegen der Meinung, dass der Account freigeschalten werden soll. \n\nEr hat sich glaube ich auch eher an Riot damit gewendet, als TE kannst du schließlich nichts löschen, außer deine eigenen Beiträge.","replies":[{"poster":"LuserHD","date":"2016-08-16T00:52:32.449+0000","up_votes":1,"down_votes":0,"body":"Aber ist ein Flame nicht eine starke negative Meinung? Ok ich bin langsam müde :D  Bis Morgen!{{sticker:slayer-jinx-catface}}","replies":[{"poster":"Sirrkas","date":"2016-08-16T00:54:01.580+0000","up_votes":1,"down_votes":0,"body":"Hängt von der Definition ab. Beleidigungen und so etwas wie jemanden als \"Scheisse\" bezeichnen, zähle ich aber immer darunter.\n\nBis Morgen.","replies":[]}]}]}]},{"poster":"Sirrkas","date":"2016-08-16T00:17:39.906+0000","up_votes":1,"down_votes":0,"body":"Zu erst einmal bin ich kein Riotmitarbeiter. Der grüne Name bedeutet, ich bin Volunteer. Ich bin nicht angestellt und einmal abgesehen davon, dass mein Name grün ist, unterscheide ich mich nicht von einem normalen LoL-Spieler. Einmal abgesehen davon, dass ich den grünen Namen quasi dafür erhalten habe, mich gut über das Reportsystem informiert zu haben und die Infos im Forum zu teilen. \n\nJa, die Accountdaten hat er laut dem Video vom Support. Wenn er selbst allerdings schon so etwas sagt: https://youtu.be/YFoUKYpQ7lQ?t=11m28s\nKlingt das zumindest für mich so, als ob er mit seinen Daten zu freizügig umgegangen ist. Für eine Accountwiederherstellung (ich nenne den Prozess des Accountdatens erlangen jetzt einfach mal so) muss man eine Reihe von Fragen beantworten, die eigentlich nur der Ersteller wissen kann. Da sind dann solche Sachen dabei wie \"erster gekaufter Champion\", \"erster gespielter Champion\", \"erster gekaufter Skin\", \"Zahlungsmethode\" eventuell alte Paysafecardcodes. Wenn man genug davon beantwortet, glaubt der Support natürlich, dass sie mit dem ursprünglichen Besitzer reden. Woher sollte ein Phisher auch so etwas wissen. \n\nZudem habe ich noch nicht erlebt, das Riot die Spieler abhängig von ihrer Bekanntheit anders behandelt. Wenn dann gab es da bisher eher Vorzüge für Pros und Youtuber oder berühmtere werden strenger bestraft. Das einzig negative in der Richtung sind wohl \"Lifetimebans\", die wird ein normaler Nutzer aber nicht erreichen können. Da wird jeder Account auf Sicht permanent gesperrt, sobald bekannt ist, dass man der Besitzer ist. Also mit anderen Worten wohl nur bei Berühmtheiten hilfreich, die damit Geld verdienen. \n\nDas mit der IP kontrollieren ist auch so eine Sache. Viele haben wechselnde IPs und wenn der Hacker sich so viel Mühe gemacht hat, dass er genug Informationen hat um sich glaubhaft als ursprünglicher Besitzer darzustellen, hat er vielleicht auch dafür gesorgt, dass der Riotsupport bei ihm IP sieht, die aus der selben Region stammt. \n\nIch kann nachvollziehen, dass du dich darüber aufregst, dass er aus deiner Sicht ungerecht behandelt wurde. Es wäre aber sicher eher in seinem Interesse, wenn seine Fans sich ordentlich benehmen, wenn sie über das Thema sprechen. Die Leute werden euer Verhalten nämlich mit Maik in Verbindung bringen. \n\nWenn du willst kannst du auch ein kleines Gedankenexperiment machen. \n\nDu bist der Supporter und erhältst eine Anfrage zur Accountwiederherstellung. Der Spieler weiß alles über den 3 Jahre alten Account was man nur wissen kann. Liebste Champions in den ersten Monaten, am meisten gespielter Modus, mit wem er oft Premade gespielt hat etc. Dann kommt noch ein zweiter Spieler, der ebenfalls sagt, er sei der ursprüngliche Besitzer und gibt genau die gleichen Antworten. Was würdest du dann machen?\n\nSolltest du darüber weiter reden wollen, würde ich aber den [Thread ](http://boards.euw.leagueoflegends.com/de/c/hilfe-support-de/fcm9L60o-riot-wir-stehen-zu-unserer-inkompetenz)hier empfehlen, da ist schon ausführlicher darüber geredet worden.\n\nUnter anderem findet man da solche Beiträge:\n\n> [{quoted}](name=Nohgolgh,realm=EUW,application-id=7hciEY9w,discussion-id=fcm9L60o,comment-id=0002,timestamp=2016-08-15T17:55:46.412+0000)\n>\n> Du kennst nur eine Seite der Geschichte. Ich glaube nicht, dass Riot dem Hacker &quot;einfach so&quot; die Daten gegeben hat, sondern, dass der sich von Maiks Kanälen durchaus die Infos geholt hat, die er benötigte (z.B erster Champion und Loginname). Insofern handelt es sich beim Riot-Support nicht um völlig durchgeknallte Blödiane, sondern die haben erstmal das Standard-protokoll der Kontowiederherstellung durchgeführt. Riot stellt sich nun auf dem Standpunkt, dass Maik seine Daten besser hätte schützen müssen und der Fehler auf seiner Seite vorliegt und daher ist auch die Kontosperrung nicht der Vorgang eines paranoiden Psychopathen, sondern ein ganz rationales Vorgehen. Maik könnte, wenn er den Hacker preisgäbe, mit einigen Chancen auf Erfolg klagen, sodass der Support sein Konto freimacht oder ihm doch wenigstens Geld zurückgibt. Aber solange er meint, Straftäter decken zu müssen, wird er rechtlich keine Chancen haben und die Sperrung des Kontos behält in meinen Augen dann auch ihre Legitimität.\n\n\n\nEdit:\n\nDas Thema als solches finde ich durchaus interessant. Ich werde den Fall privat (um noch einmal klarzustellen, dass ich kein Riotmitarbeiter bin) weiter verfolgen, falls es noch mehr Infos geben wird. Aktuell bin ich mit meinen Erfahrungen zu gebannten Spielern aber noch nicht überzeugt, dass sich Maik richtig verhalten hat. Er hat einige Aussagen im Video gemacht, die eher gegen ihn sprechen und bevor ich mir weiter ein Bild vom Fall mache, würde ich eigentlich auch gerne Screenshots vom Ticketverlauf sehen. Also von allen. Das wäre dann zudem eine gute Möglichkeit seine Glaubwürdigkeit besser einschätzen zu können.\n\nLeider ist es hier nun einmal so, dass Spieler mit einem Bann nichts mehr zu verlieren haben. Die Lügen sind dann teilweise so dreist, dass Käptn Blaubärs Seemannsgarn dagegen alt aussieht. ","replies":[{"poster":"LuserHD","date":"2016-08-16T00:24:51.367+0000","up_votes":1,"down_votes":0,"body":"Erstmal danke,dass du so schnell antwortest! Kann man es denn nicht so machen, dass der Hacker es bestätigt, dass er es war und zwar gegen den Willen von Maik? Oder habe ich es nicht richtig verstanden?","replies":[{"poster":"Sirrkas","date":"2016-08-16T00:28:05.053+0000","up_votes":1,"down_votes":0,"body":"Wie schon gesagt, ich bin kein Riotmitarbeiter. Wenn der Hacker aber in einem Ticket dem Support gegenüber gesteht, dass er Maik damit nur ärgern wollte und nicht der Besitzer des Accounts ist, sollte es das für ihn um einiges leichter machen, den Zugriff zurückzuerhalten. \n\nWeitere Diskussionen dazu, sollten aber vielleicht hier hin verschoben werden:\n\nhttp://boards.euw.leagueoflegends.com/de/c/hilfe-support-de/fcm9L60o-riot-wir-stehen-zu-unserer-inkompetenz","replies":[{"poster":"I am Dope","date":"2016-08-16T00:40:49.261+0000","up_votes":1,"down_votes":1,"body":"deswegen der begriff \"in den arsch geschoben\"\n\nund falls du das video geschaut hast wirst du darin sehen das der hacker versucht hat mit ihm den support anzuschreiben, und riot darauf hin mit einer cp &pst antwort geantwortet hat","replies":[{"poster":"Sirrkas","date":"2016-08-16T00:42:54.519+0000","up_votes":1,"down_votes":0,"body":"Ich habe das Video gesehen, deswegen bin ich auch nicht davon überzeugt, dass er darin die komplette Wahrheit sagt. Er sagt stattdessen sogar selbst, dass er wohl selbst genug Daten an die Öffentlichkeit getragen hat, um damit die Accountwiederherstellung beim Support zu beantragen.","replies":[{"poster":"I am Dope","date":"2016-08-16T00:47:00.574+0000","up_votes":1,"down_votes":0,"body":"in welcher sekunde und minute sagt er bitte das er zu offen damit umgegangen ist \ner konnte ABSOLUT nichts dafür das riot ohne weiter nachzufragen die account daten rausgegeben hat","replies":[{"poster":"Sirrkas","date":"2016-08-16T00:52:34.831+0000","up_votes":1,"down_votes":0,"body":"https://youtu.be/YFoUKYpQ7lQ?t=11m28s\n\nHier ist die Stelle. \n\nWenn er schon sagt \"jeder weiß XY\" klingt das für mich so, als würde er so etwas öfter erzählen. Mit etwas Recherche scheint man bei ihm laut seiner Aussage genug Infos zu kriegen, um sich als Accountersteller ausgeben zu können. Man kann ihm vielleicht zu gute halten, dass er nicht wusste, dass so etwas möglich ist (ich höre gerade auch zum ersten mal von so einem Fall) aber es klingt dann doch stark nach fahrlässigem Umgang mit seinen Daten.","replies":[]}]}]}]},{"poster":"I am Dope","date":"2016-08-16T00:41:59.339+0000","up_votes":1,"down_votes":1,"body":"und wo du weitere diskussionen hin verschieben willst ist mir wurscht ich hoffe das der shitstorm so groß wie möglich wird und dafür werde ich mich einsetzen","replies":[]}]}]},{"poster":"LuserHD","date":"2016-08-16T00:35:35.394+0000","up_votes":1,"down_votes":0,"body":"Aber ich bin jetzt mal ganz ganz ehrlich. Für mich ist Maik einer der ehrlichsten und gutherzigsten Menschen, die ich je getroffen habe. Natürlich kann man sich täuschen.Jeder Mensch verändert sich ,wenn es um Geld geht. Dennoch ist Maik Maik und hoffentlich ist er es in dieser Situation geblieben,","replies":[]},{"poster":"GerAvos","date":"2016-08-16T00:29:23.440+0000","up_votes":1,"down_votes":0,"body":"Ich denke mal dass der \"hacker\" diese fragen beantworten konnte, weil Maik durch seine youtube videos über die jahre hinweg solche sachen erzählt hat (liebste champions in den ersten monaten, etc).","replies":[]}]}]},{"poster":"LuserHD","date":"2016-08-15T23:55:47.853+0000","up_votes":2,"down_votes":1,"body":"Aber sollte man nicht wenigstens ein bischen weiter gehen(Wie gesagt IP-Check). Und selbst wenn es ,unbeabsichtigt, seine Schuld war, sollte der SUPPORT(auf deutsch:UNTERSTÜTZUNG) ihn mehr unterstützen!","replies":[]}]},{"poster":"I am Dope","date":"2016-08-16T00:21:57.035+0000","up_votes":2,"down_votes":1,"body":"habe das video eben gerade auch gesehen und wollte selber einen thread dazu eröffnen, werde ich auch noch tun.... aber nun erstmal hier\n\n\nIch finde es ist ein absolutes No Go einen Account permanent zu sperren ohne gründliche untersuchungen durchgegührt zu haben....\nder support hat zwar geschrieben das er gründliche untersuchungen unternommen hat... aber so viele copy and paste antworten wie man beim support zurück bekommt... mit sicherheit auch nur um den clienten abzuwimmeln....\n\nRiot hätte zumindest mal darauf antworten können in dem sie sagen das sie sich umfangreich informieren.... nachdem sie die LogIn IP-Standorte festgestellt haben, könnte man den clienten fragen wo er sich in der und der Zeit eingeloggt hat, kann das mit der anschrift etc. überprüfen und vergleichen (dann wäre es auch mal nützlich das facebook etc. informationen wie standort weiter verkaufen). Dann kann man auch schauen ob er der wirkliche besitzer ist, da der Hacker im normal nicht die adresse bsp: der Oma weiß.\n\nEs gibt immer möglichkeiten von den spielinhabern das nachzuprüfen und ich finde in solchen fällen wird VIEL zu wenig aufwand betrieben....\nes gibt leute für die sind 500€ EIN RIESEN HAUFEN GELD stellt euch vor er wäre ein jugendlicher ohne festes einkommen, hat sein taschengeld dort rein gesteckt....\nwas soll das denn 500€ auch wenn es \"nur\" ein online spiel ist das geld was dort rein gesteck wurde ist ECHTES geld.\n\nRiot HOFFENTLICH (auch wenn ihr es eh nicht machen werdet) nehmt ihr euch diesen fall zu herzen und:\n\n1. GEBT IHM SEINEN ACCOUNT WIEDER, er kann sogar mit YOUTUBE beweisen das es sein account ist\n\n2. GEHT BEI SOWAS VORSICHTIGER MIT PERMABANS UM\n\n3. FORSCHT NACH, es gibt leute die haben nur einen account der ihr leben bedeutet\n\n4. geht vorsichtiger mit der scheiße um ihr habt dem hacker einfach so ohne nach zu forschen die daten gegeben. ich hoffe maik ist so schlau und verklagt euch auf schadensersatz für fahrlässige hilfe beim diebstahl\n\nmit freundlichen und enttäuschten grüßen -.-","replies":[{"poster":"Sirrkas","date":"2016-08-16T00:40:44.995+0000","up_votes":1,"down_votes":0,"body":">geht vorsichtiger mit der scheiße um ihr habt dem hacker einfach so ohne nach zu forschen die daten gegeben. ich hoffe maik ist so schlau und verklagt euch auf schadensersatz für fahrlässige hilfe beim diebstahl\n\nAktuell hört es sich für mich so an, als ob Maik persönlich die nötigen Daten für eine Accountwiederherstellung dem \"Hacker\" überreicht hat. Gut möglich, dass der unter den Videos scheinbar unverfängliche Fragen gestellt hat wie \"was war der erste Champ, den du gekauft hast\". Wenn Maik darauf jedes mal Wahrheitsgemäß antwortet, hat der im Nu genug Infos, um sich glaubwürdig als Accountinhaber darzustellen. Ich weiß nicht wie du dir weitere Nachforschungen vorstellst. Sollen sie ein Passbild mit einer Kopie des Ausweises per Post verlangen?","replies":[{"poster":"I am Dope","date":"2016-08-16T01:34:53.161+0000","up_votes":1,"down_votes":0,"body":"weitere nachforschungen im sinne von check die IP hintergründe, das ist absolut kein thema, kurz bei facebook vorbei geschaut, DONE.","replies":[]}]}]},{"poster":"haha weed lol xd","date":"2016-08-15T23:56:39.177+0000","up_votes":1,"down_votes":0,"body":"Kann er sich einfach wieder nen Diamond Account kaufen wie er es davor gemacht hat :^) no Problemo","replies":[{"poster":"LuserHD","date":"2016-08-15T23:57:30.352+0000","up_votes":1,"down_votes":0,"body":"Es geht ja um das Geld(Skins etc.)","replies":[]}]},{"poster":"Eve iS mY BiTcH","date":"2016-08-15T23:40:25.103+0000","up_votes":1,"down_votes":1,"body":"Push","replies":[]}]}