{"poster":"God kimchi","date":"2019-06-09T21:55:42.886+0000","title":"CAN I GET BANNED FOR TRASH TALKING MY IRL FRIEND AND SWEARING TO HIM?","subforum":"Player Behaviour","up_votes":1,"down_votes":0,"body":"My friend sent in a ticket to troll me cuz I swore at him a lot which is common thing we do when we are at school and in chats. I never swear in game so would it be problem???","replies":[{"poster":"Project Xayah","date":"2019-06-10T01:47:42.589+0000","up_votes":2,"down_votes":1,"body":"It depends a lot more on the situation than anything else really. Using team/all chat does provide a bit of risk with this, though it usually depends on how far you take it and the players you are with (specifically, how inclined they are to report). You'll definitely want to avoid any zero tolerance behaviours (racism, sexism, homophobia, suicide encouragement etc.). So far as swearing goes, it's not an issue in and of itself (people can turn on the profanity filter if they don't want to see swearing), but it does become an issue when \"directed\" (for example \"fuck you\" or \"fuck off\" could be problematic). It probably wouldn't help if any punishments were to occur, but you could both try informing the other players in-game that you are friends and it's just being used as banter, which might make them less inclined to report (again, probably wont change the outcome of any reports).\n\nHonestly, in a situation like this, I think the best thing you could do is use some alternate method of communicating, such as private messages (which you can use in-game via \"whispers\"), or some kind of VoIP program. It means you can just say whatever and Riot either wont do anything (because it's a private convo) or they wont have jurisdiction (they can't police what happens in a private Discord/Teamspeak server, for example).","replies":[]},{"poster":"jonZooz","date":"2019-06-10T04:44:19.749+0000","up_votes":1,"down_votes":0,"body":"Yes 200%","replies":[]},{"poster":"xXDiddimsXx","date":"2019-06-09T23:22:50.612+0000","up_votes":1,"down_votes":0,"body":"i got my friend banned for 2 weeks so yes it is","replies":[]}]}