{"poster":"Apphroditte","date":"2015-07-25T01:18:08.570+0000","title":"Well outraged Fiora players , you got what you wanted","subforum":"Gameplay","up_votes":7,"down_votes":3,"body":"Although i liked the new splash as it was , Heres the updated Fiora splash/model currently on the pbe ( ͡&deg; ͜ʖ ͡&deg;)\n","replies":[{"poster":"Vistha Kai","date":"2015-07-25T01:22:27.472+0000","up_votes":20,"down_votes":1,"body":"I don't even play Fiora. I just hate when Riot pulls a dick move like that.\n\nPlus the most enraging thing about this hole situation, for me, was how Ironstylus said \"it's too much work to change her in-game hair now\" and then started speaking out of his ass about UV map MAYBE getting screwed in the process.\n\nAbout a goddamn texture they already changed 3 times by then!","replies":[{"poster":"Purodyuusaa","date":"2015-07-25T01:31:03.237+0000","up_votes":9,"down_votes":1,"body":"It's funny how something so difficult to change as her hair was so quickly changed right?\n\nIronStylus has a severe disability in public relations.  Anyways, here's hoping they take a similar approach to I've seen some shit Fiora, Grandma's Curtains Fiora, and Blow Up Fiora edition.","replies":[{"poster":"Krys Star","date":"2015-07-25T06:40:43.606+0000","up_votes":2,"down_votes":0,"body":"Not to be rude, but if you've seen pics of him... He looks like he'd be very awkward in social situations, especially in groups.","replies":[{"poster":"Purodyuusaa","date":"2015-07-25T09:05:46.135+0000","up_votes":5,"down_votes":0,"body":"Preface: This post is just casual conversation. \n\nGroups and real life are one thing but we're talking about properly articulating a thought onto a message board or forum without sounding like a dick in the process.  A thought where should you choose to, you could take several hours to get right.  You and I aren't going to do that but when you're speaking to upset customers, it might benefit someone in IronStylus's position to reread his posts before he's certain that's exactly what he wants to say.  This all goes back to that \"lack of communication\" jargon they like to throw around.\n\nThis isn't one of the parrot's tools in his skill set.","replies":[]}]}]},{"poster":"Stonington","date":"2015-07-25T03:32:52.865+0000","up_votes":9,"down_votes":8,"body":"> [{quoted}](name=Vistha Kai,realm=EUNE,application-id=3ErqAdtq,discussion-id=vPfJ2o90,comment-id=0002,timestamp=2015-07-25T01:22:27.472+0000)\n>\n> I don't even play Fiora. I just hate when Riot pulls a dick move like that.\n> \n> Plus the most enraging thing about this hole situation, for me, was how Ironstylus said \"it's too much work to change her in-game hair now\" and then started speaking out of his ass about UV map MAYBE getting screwed in the process.\n> \n> About a goddamn texture they already changed 3 times by then!\n\nIronstylus hates attractive women. It's like he's on a mission to make every woman in league unattractive. I remember a while back he was talking about giving Eve a VU where she wasn't a sexy dominatrix type.\n\nLook at the majour female splashes that were changed. Players had a problem with Ahri, Katarina, and now Fiora. Not to mention the Akali sideboob controversy. Sona had a breast reduction. Sejuani is now fully dressed with a rougher face. He seriously wants every woman in the game to be ugly.","replies":[{"poster":"Knight SoIaire ","date":"2015-07-25T07:51:11.649+0000","up_votes":7,"down_votes":0,"body":"i wonder thou .... for me ahri is still sexy in her splash \n\n\nwhat i think that he does isnt making women ugly .... but taking the sexuality out of the centre ... so instead of advertising a champion through boobs he tries to advertise their theme instead","replies":[{"poster":"Apphroditte","date":"2015-07-25T08:01:46.302+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=Hagane No Arashi,realm=EUNE,application-id=3ErqAdtq,discussion-id=vPfJ2o90,comment-id=000200010000,timestamp=2015-07-25T07:51:11.649+0000)\n>\n> i wonder thou .... for me ahri is still sexy in her splash \n> \n> \n> what i think that he does isnt making women ugly .... but taking the sexuality out of the centre ... so instead of advertising a champion through boobs he tries to advertise their theme instead\n\nwell isn't that what it should be ? sure we have some \"sexy' champions that you want to play because of that but not every champ has to be some sort or seduction goddess. Im talking in terms of the splash , the design of the outfit is sleek and looks nice , the colors mesh well and while very stylized ( what people are calling angular and cartoony) is a very defined and polished aesthetic. Of course style is subjective and people will love and hate it as we've seen. Pushing a champion through theme is much more interesting than making them sexy giving them a weapon and saying \"here she's a duelist\".","replies":[]}]},{"poster":"Hupsis","date":"2015-07-25T08:24:25.805+0000","up_votes":2,"down_votes":1,"body":"You mean that you actually want Eve to look like a stripper...\nShe looks so untasty that it would be a blessing for everyone if she got a VU and was given a more fitting attire.\n\nFemale champions should represent themselves in other ways than pretty face and big guns. Fiora's new splash being a good example. She has more personality and less sex appeal.\n\nAhri's new splash was originally good and then the communtily demanded that the face would be made more oriental and now she looks like an obaa-san (granny). The only champion that is supposed to be the epitome of beauty.\n\nI seriously believe that Riot is listening to the vocal minority too much and ignores the fact that most people that are actually fine with the changes are not coming to the boards to say \"Good job Riot\".","replies":[{"poster":"Vistha Kai","date":"2015-07-25T11:04:31.282+0000","up_votes":1,"down_votes":0,"body":"I for one actually like changes they made to Ahri's splash, since before she barely looked like Ahri or \"just as every fit female in clothes like that\" even.","replies":[{"poster":"Hupsis","date":"2015-07-25T11:39:00.384+0000","up_votes":1,"down_votes":1,"body":"In the end it doesn't really matter. I'm fine with what Riot is doing with **their** splash art. I'm just irritated cause the community is being so noisy and rude when it comes to graphical assests. Feedback is ok but some people just don't know when to stop.\n\nWe can expect a huge commotion when Eve gets a VU eventually cause I doubt Riot will keep her stripper looks. And when the community demands that she should remain as a stripper... I REALLY hope Riot will draw the line there (traditional skin would be ok tho).","replies":[{"poster":"Vistha Kai","date":"2015-07-25T11:44:12.306+0000","up_votes":1,"down_votes":0,"body":"Again, last time I heard Ironstylus speaking about Eve, he said she will keep most if not all of her seductress look.\n\nUnless he was just dicking us like he did with the \"we won't change Fiora's hair cuz tech\" LeReddit post.","replies":[{"poster":"Hupsis","date":"2015-07-25T11:53:07.006+0000","up_votes":2,"down_votes":0,"body":"Ugh... let's just hope it won't be as untasty as it currently is.\nSeductress theme can work without stripper attire.","replies":[{"poster":"Vistha Kai","date":"2015-07-25T11:56:10.500+0000","up_votes":1,"down_votes":0,"body":"It may work even with a stripper attire. All depends on how said attire looks like.\n\nRight now she's a BDSM vampire bitch, so I can see why some people might be put off.","replies":[{"poster":"Hupsis","date":"2015-07-25T12:31:48.242+0000","up_votes":1,"down_votes":0,"body":"Well yeah. I'm not sure how vast the stripper clothing category is so it's hard to say what counts as stripper clothing and what doesn't. Riot just has to make sure she doesn't look too lewd.","replies":[]}]}]}]}]}]}]},{"poster":"Rinky Dinky","date":"2015-07-25T15:08:28.263+0000","up_votes":1,"down_votes":0,"body":"Uhm.  \n\nLeona?\n\nThat champ is his baby","replies":[]},{"poster":"Vistha Kai","date":"2015-07-25T10:52:55.157+0000","up_votes":1,"down_votes":0,"body":"Last time I checked he wanted to keep her vampire-ish seductress theme.","replies":[]}]}]},{"poster":"Lavaniel","date":"2015-07-25T02:28:08.437+0000","up_votes":6,"down_votes":1,"body":"It's an improvement, I can tolerate it this. GJ Riot","replies":[]},{"poster":"Only Play Darius","date":"2015-07-25T01:18:51.628+0000","up_votes":6,"down_votes":1,"body":"Thank god. Her old hairstyle just looked bad.","replies":[]},{"poster":"ZomfgItsNull","date":"2015-07-25T03:43:55.967+0000","up_votes":4,"down_votes":0,"body":"**_That_** actually is an improvement... but to a more important matter, what about the skins?","replies":[]},{"poster":"Critmaster Garen","date":"2015-07-25T01:33:12.152+0000","up_votes":4,"down_votes":0,"body":"i was indifferent about the change, but the new one looks more like the the fiora i know.","replies":[]},{"poster":"Mannysmoker","date":"2015-07-25T03:48:22.474+0000","up_votes":3,"down_votes":0,"body":"Ppl complain about the weirdest things, First was cuz of {{champion:103}}'s old art was better than the new one, i even saw a guy saying that her chin was disproportionated and the needed to change it or put the old art, then {{champion:55}}  got a new art the same shenanigans, she looks like a dude, look at that face, now is {{champion:114}} her hair, her red bangs, look at that face she looks like cruella...I don't wanna know what would happen if they give {{champion:37}} a new art and ppl don't like it, i assume the boards will explode with petitions/complains to change it or make it better..","replies":[{"poster":"ZomfgItsNull","date":"2015-07-25T04:07:52.575+0000","up_votes":4,"down_votes":1,"body":"Lets hope they never \"update\" your favorite champion's look so you don't have to complain.","replies":[{"poster":"Mannysmoker","date":"2015-07-25T04:26:51.645+0000","up_votes":1,"down_votes":1,"body":"I dont think they gonna update {{champion:429}} anytime soon or {{champion:119}} or {{champion:8}} so...yea.","replies":[]}]},{"poster":"DJ Di0","date":"2015-07-25T05:40:19.486+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Mannysmoker,realm=NA,application-id=3ErqAdtq,discussion-id=vPfJ2o90,comment-id=0008,timestamp=2015-07-25T03:48:22.474+0000)\n>\n> Ppl complain about the weirdest things, First was cuz of {{champion:103}}'s old art was better than the new one, i even saw a guy saying that her chin was disproportionated and the needed to change it or put the old art, then {{champion:55}}  got a new art the same shenanigans, she looks like a dude, look at that face, now is {{champion:114}} her hair, her red bangs, look at that face she looks like cruella...I don't wanna know what would happen if they give {{champion:37}} a new art and ppl don't like it, i assume the boards will explode with petitions/complains to change it or make it better..\n\nHmm. Riot's art has gotten a lot better over the years, so I wouldn't mind a new Sona splash at all.","replies":[]}]},{"poster":"AtheosisX","date":"2015-07-25T01:47:43.556+0000","up_votes":4,"down_votes":1,"body":"A definite improvement.  Good to see them take the feedback and actually make changes.  Now if only they would do the same with the new HUD...","replies":[{"poster":"oMdwo","date":"2015-07-25T01:55:25.105+0000","up_votes":2,"down_votes":0,"body":"as this man who posted this was a supporter of the new fiora splash, i am a HUD supporter, and i honestly think the HUD thing is blown way out of porportion\nthats just my opinion","replies":[{"poster":"Apphroditte","date":"2015-07-25T02:02:06.637+0000","up_votes":2,"down_votes":0,"body":"i actually really enjoy the new HUD too, sure initially i couldn't find certain things but once i figured all out its a nice visual update, looks much sleeker and modern\np.s. i actually think the in-game model does look significantly better with this hair , even if i liked how the splash was originally ","replies":[]}]}]},{"poster":"ZyniX","date":"2015-07-25T07:41:16.007+0000","up_votes":1,"down_votes":0,"body":"Still waiting for the fix to royal gaurd..","replies":[{"poster":"SoultakerKatana","date":"2015-07-25T20:34:09.823+0000","up_votes":2,"down_votes":0,"body":"her in game model still looks bad needs more fixing","replies":[]}]},{"poster":"NvrGivUp","date":"2015-07-25T06:13:00.514+0000","up_votes":2,"down_votes":3,"body":"Nobody better say that RIOT doesn't listen to its playerbase. RIOT has done so much over the years.","replies":[{"poster":"Noin Lucrezia","date":"2015-07-25T07:12:28.633+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=NvrGivUp,realm=NA,application-id=3ErqAdtq,discussion-id=vPfJ2o90,comment-id=000a,timestamp=2015-07-25T06:13:00.514+0000)\n>\n> Nobody better say that RIOT doesn't listen to its playerbase. RIOT has done so much over the years.\n\nReplays.gif","replies":[]},{"poster":"KING ATTILA","date":"2015-07-25T07:13:39.750+0000","up_votes":1,"down_votes":0,"body":"That's a funny joke.","replies":[]},{"poster":"Apphroditte","date":"2015-07-25T06:35:58.556+0000","up_votes":1,"down_votes":1,"body":"^^^","replies":[]}]},{"poster":"Arc Noir","date":"2015-07-25T02:02:26.381+0000","up_votes":2,"down_votes":0,"body":"That actually helps a lot, now we can talk about her balance.","replies":[]},{"poster":"OverpoweredSoap","date":"2015-07-25T01:19:46.046+0000","up_votes":2,"down_votes":0,"body":"I kinda think the splash art looks better without the new hairstyle.\n\nBut the model looks waaaaay better with the hair like though.","replies":[]},{"poster":"Tengrichan","date":"2015-07-25T08:01:40.594+0000","up_votes":3,"down_votes":1,"body":"Then you compare it to the old art and model and realise it's inferior as she didn't need this kind of VU.","replies":[]},{"poster":"Reprom","date":"2015-07-25T12:28:57.240+0000","up_votes":2,"down_votes":1,"body":"You got what you wanted, so step aside kids. We want to discuss more important things, not some useless splash.","replies":[]},{"poster":"Simonizer86","date":"2015-07-27T17:51:00.981+0000","up_votes":1,"down_votes":0,"body":"As a Fiora main, the art is not really the biggest problem with her rework...but her ult! how to screw a nice champs...don't know why the remove her ult when champs like Vlad have his pool of blood doing the same and its not even his ult! I know it was a noob ult and i understand why they removed it but to put this boring ult instead with so low chance of success...I just don't understand where Rito is going, you want to remove noob ult but you put annoying as hell champs like Kalista? And you keep ult like Trynd and kayle? Or Poppy?","replies":[]},{"poster":"SoultakerKatana","date":"2015-07-25T20:27:19.422+0000","up_votes":1,"down_votes":0,"body":"WOW they added her bangs. Do you really think that was her only problem. First of all let me say her splash art is fine gj riot u listen. Now lets focus on her ingame model.  First of all i ve seen pictures of her up close front view and its looking good. they need to shorten her eyes and face abit and thats all. Now her hair needs to move closer to her face and from the birds eye view her face still looks long. They need to change her face structure from that angle. old fiora looks the same at all angles so riot needs to do the same. The close aren't  y problem cuz they look good even on the old face which i made in PS( http://imgur.com/IXG1FEv ). If they can make this face close to the old one we will stop complaining and praise them. We aren't fools we know they can do it.","replies":[]},{"poster":"Gallowgrim","date":"2015-07-25T20:16:50.246+0000","up_votes":1,"down_votes":0,"body":"All this has me worried as hell for the butchering Cait's likely to get,given every freakin' slut-shamer on the Boards wants to put her in pants, cover her up, and take away all her whimsy...","replies":[]},{"poster":"TheRakkun","date":"2015-07-25T13:47:39.733+0000","up_votes":1,"down_votes":0,"body":"Can we please put that chin to a grindwheel, it looks like Nigel Thornberry made a cameo.","replies":[]},{"poster":"NorthernDruid","date":"2015-07-25T12:50:55.821+0000","up_votes":1,"down_votes":0,"body":"Cool, now when is she gonna get a real pose and when is her run animation gonna be running and not skipping.\n\nFiora's new running animation is the silliest thing in league. Only rivaled by her new godawful unbalanced pos in the splash.","replies":[]},{"poster":"Shénzhì","date":"2015-07-25T11:06:04.584+0000","up_votes":1,"down_votes":0,"body":"She was so much better on the first or second VU........","replies":[]},{"poster":"Knight SoIaire ","date":"2015-07-25T07:48:53.113+0000","up_votes":1,"down_votes":0,"body":"i dont realy think that they changed the face much \ni just think thatthey adjusted the shape so she doesnt look this evil now \n\n\n\nbut im satisfied with the result i think ... those bad things are also a part of your champion experience .... if we are talking about being unique fiora lost some this way ... but i wonder how i will feel about in the end","replies":[]},{"poster":"Sasogwa","date":"2015-07-25T11:47:37.733+0000","up_votes":1,"down_votes":1,"body":"Well.. TY RIOT for listening at least once","replies":[]},{"poster":"FantasySniper","date":"2015-07-25T04:42:58.949+0000","up_votes":1,"down_votes":1,"body":"Her face is still a little too plastic, but it's still a huge improvement.\n\nNow to fix that thing on her shoulder.","replies":[]}]}