{"poster":"Knife Life Chara","date":"2015-10-30T15:24:32.536+0000","title":"Wofür sind Reports gedacht ?","subforum":"Spielerverhalten & Moderation","up_votes":3,"down_votes":1,"body":"Kann mir einer erkl&auml;ren wof&uuml;r Reports gut sind , wen das System so oder so schon Flamer oder Afk&#039;ler erkennt und Bestraft? Das macht Reports doch eigentlich nur &Uuml;berfl&uuml;ssig oder nicht ? :O","replies":[{"poster":"dat Zoidberg","date":"2015-10-30T15:28:19.592+0000","up_votes":3,"down_votes":0,"body":"Was AFKler und Leaver angeht im Prinzip schon. Bei Flamern oder anderweitiger negativer Einstellung geht es darum, einen Trigger auszulösen, so dass der Chat des entsprechenden Spielers überprüft und analysiert wird.","replies":[]},{"poster":"Lovvlyexe","date":"2015-10-30T15:30:02.470+0000","up_votes":1,"down_votes":0,"body":"wenn sie es mal erkennen würden bekomme immer noch jedes 2 game 1 afk","replies":[{"poster":"Sirrkas","date":"2015-10-30T15:39:12.641+0000","up_votes":2,"down_votes":0,"body":"AFKler werden auch nicht sofort permanent gebannt, wenn sie mal nicht ein Siel zuende spielen. Zudem kann man die Leute schlecht im Vorraus bestrafen.","replies":[]}]},{"poster":"Anopka","date":"2015-11-13T21:13:10.154+0000","up_votes":1,"down_votes":0,"body":"Reports sind dafür da, um Spieler zu melden für unsportliches Verhalten. Das System erkennt zwar schon viele Dinge inzwischen selbst, aber manche Dinge eben auch nicht. Manche Spieler verhalten sich zwar zunächst unmöglich, entschuldigen sich aber auch anschließend (auch wenn das eher die wenigsten tun, aber auch solche Spieler gibt es hier in der Community), manche setzen aber immer noch einen drauf. Durch die Reports lässt sich eben am ehesten auch feststellen, welche Spieler von der Community akzeptiert werden, und welche nicht.","replies":[]},{"poster":"HyperionCH","date":"2015-10-30T15:32:47.796+0000","up_votes":1,"down_votes":0,"body":"Bezüglich AFK/DC erkennt das System sofort, wenn jemand nicht am Spiel teilnimmt. In diesem Fall braucht es wirklich keinen Report, da der Leaverbuster dies bereits erledigt.\n\nBei Flamern ist es jedoch so, dass das System den Chat erst analysiert, wenn jemand oft reportet wird. Das System wäre auch sonst überfordert, wirklich bei jedem Game die chatlogs durchzuschauen.","replies":[]},{"poster":"Knife Life Chara","date":"2015-10-30T15:48:01.979+0000","up_votes":1,"down_votes":1,"body":"Ok Danke ^^","replies":[]},{"poster":"PapaJLBaer","date":"2015-11-01T00:48:22.089+0000","up_votes":1,"down_votes":5,"body":"Das Reportsystem erfüllt nur einen Zweck.\n\nDir ein gute Gefühl zu geben.\n\nEs ist wie ein Politiker:  Sagt vieles was du hören willst macht aber das Gegenteil.\n\n\nDu kannst soviel Reporten wie du möchtest. Mit sehr viel Glück wird der eine Bestraft.\nDas Grund Problem beleibt.\n\nSehe so. Einer von 1000 Tropfen Wasser trifft auch den heißen Stein in der Wüste.","replies":[]}]}