{"poster":"Troll de Bronce","date":"2018-09-03T18:56:10.431+0000","title":"El estigma de ser un main Yasuo.","subforum":"Comportamiento del jugador","up_votes":7,"down_votes":17,"body":"Hola he vuelto.\nNo les voy a mentir. Maineo Yasuo desde que empec&eacute; a jugar al LoL hace un a&ntilde;o mas o menos. Tengo varias cuentas smurf en las cuales a todas les he puesto a Yasuo y en dos de ellas tengo skins para el champ. Suelo jugar otros campeones de vez en cuando y en distintos roles, pero de base soy main mid Yasuo. He hecho todo lo que est&aacute; a mi alcance y hasta lo imposible por jugarlo bien y creo que lo estoy logrando, aunque a veces manqueo contra otros campeones los cuales me hacen mucho counter o no me dejan farmear, como una LeBlanc, Wukong o un Gnar, a esos practicamente se me hace imposible ganarles en mid.\n\nDesde que soy main Yasuo me ha tocado enfrentarme a todo tipo de situaciones en las cuales he sido estigmatizado por cada error cometido por el team, cualquier error, por m&aacute;s m&iacute;nimo que sea, la culpa era toda del Yasuo por ser &quot;manco&quot; o &quot;rata&quot;.\n\nPor ejemplo, hoy me toc&oacute; jugar con un team bastante t&oacute;xico. Ya desde que picke&eacute; a Yasuo y dije dos veces en el chat &quot;gan&eacute; mid&quot; en la seleccion de campeón, empezaron a flamearme y a decirme cosas como &quot;Sabes usar a Yasuo?&quot; &quot;campe&oacute;n sin manos alv :v&quot; y el Ryze que quer&iacute;a ir mid estaba escribiendo cosas como  &quot;YA SABEMOS QUE GANASTE MID, RATA MARICON&quot; (si, lo escribió asi todo en mayusculas para intimidar)\n\nAsi que bueno, me toc&oacute; ir contra una Katarina en mid, no ha pasado nada relevante en todo momento excepto que logr&eacute; matar 3 veces a esa Katarina y en la ultima de las veces que la mat&eacute;, el jg y el adc vinieron y me gankearon desde atras de mi torre y me mataron agarrándome por sopresa cuando ten&iacute;a poca vida y estaba backeando bajo mi torre, en tan solo esa primera muerte m&iacute;a mi team empez&oacute; a flamearme y a pedir &quot;Report Yasuo manco troll&quot; por el canal /all para que todos lo vieran. En eso puls&eacute; &quot;Tab&quot; y mir&eacute; la lista de scores y vi que los de bot de mi team ya habian fediado a la Vayne enemiga, iba 6/1, mientras que los otros de mi team iban 0/3, 1/4 y asi... y aun asi segu&iacute;an flameandome y culpandome por todo, cuando la triste realidad para ellos es que yo era quien los carreaba a ellos. Yo iba 7/2 en ese momento y pod&iacute;a matar con facilidad al supp, al jg y al mid, excepto por el adc Vayne el cual me resultaba imposible porque ya estaba feed. Cada vez que la Vayne enemiga me alcanzaba y me mataba, todo mi team me flameaba y ped&iacute;a report, y bueno, al final esa partida la perdimos.\n\nYo siempre trato de jugar sin alterarme y siempre reporto a este tipo de jugadores t&oacute;xicos al final de la partida, pero nunca hacen nada al respecto minimo siquiera una sancion asi que ah&iacute; siguen. Y yo sigo comiendome el estigma de ser un main Yasuo y que me flameen por cada error cometido en las partidas, sin importar si el error lo cometen ellos y no yo, porque cuando matan a alguno de mi team siempre yo soy el &quot;manco, el que no ayuda, etc&quot; cuando yo siempre que puedo voy a asistirlos y siempre voy dando aviso y se&ntilde;ales en el mapa y advirtiendo por chat local los lugares donde se dirigen los del team rival para salvar a mi team de alguna muerte repentina por no ver por donde caminan.\n\nEn fin, perdon por este crypost extenso, pero termin&eacute; esa partida muy tilteado y ten&iacute;a que expresarme en algun lado.\n\nEspero que no me den tanto negativos jaja xd","replies":[{"poster":"StąrDust","date":"2018-09-03T19:43:15.724+0000","up_votes":7,"down_votes":0,"body":"Te seré sincero, en los 4 años q jugué LoL, solo vi un Main yasuo en ranked que era muy bueno, parecía saber los timings de habilidades (CD) de los enemigos, esquivaba todo y hasta se hizo 2 pentakills 1 vs 5, y nunca se burló del rival (cosa que si hacen la gran mayoría de los \"Main yasuo\"). Esto fue hace 2 años y estaba en plata pero a principios de temporada.\nEn cambio los demás se hacen los pro, se burlan, dicen \"izi\" y te spamean la maestría 5 o 7 tanto cuando mueren como cuando matan de pura suerte o lo ayuda algún aliado. O están los que lloran muchísimo por los ganks o diveos que le hacen o les ganes 1 vs 1 en buena ley, entonces empiezan a regalar un par de kills (siempre spameando las maestrías al morir) dicen report X línea (generalmente hechan la culpa al jg) y se van AFK con kda 1/5/0.\n\nEs por eso que los \"Main yasuo\" tienen mala fama y todos te dicen eso. Ojo es solo mi opinión y seguro q muchos coinciden con esto.","replies":[{"poster":"Main Cocina S3","date":"2018-09-03T22:32:28.558+0000","up_votes":4,"down_votes":0,"body":"como olvidar al main yasuo desde la beta que puso en el all\n> report supp no me ayuda\n\ny era mid","replies":[{"poster":"StąrDust","date":"2018-09-03T22:52:54.549+0000","up_votes":1,"down_votes":0,"body":"Es que el 99% de los Main yasuo (en LAS, desconozco cómo serán  en las demás regiones) son así.","replies":[]}]}]},{"poster":"Doven","date":"2018-09-03T20:14:03.173+0000","up_votes":5,"down_votes":0,"body":"No entiendo, no entiendo porque te afecta lo que alguien te diga en una normal, tu yasuo es malo y tenes que empezar por aceptarlo, empeza a jugar champs mas faciles como annie y vas a ver como vas a mejorar mas tarde, tu elo es muy bajo y ni siquiera es merecido, deberias estar puesto en bronce 5 honestamente, en lo unico que te concentras es en las peleas, pero adivina que? no estamos jugando street fighter, es un juego de estrategia. Deja de llorar porque te flamean y empeza a mutearlos. Concentrarte en mejorar tu farm y tu habilidad mecanica.","replies":[]},{"poster":"Expectø Patronum","date":"2018-09-03T19:11:16.717+0000","up_votes":3,"down_votes":1,"body":"los tipicos main yasuo m7 que me tocan en ranked XD\n tu promedio de kda con yasuo es  malisimo, ni hablar del winrate\n1 victoria 6 derrotas kda promedio 3/10/5\nno se si las trolleaste o en realidad te va tan mal XD","replies":[{"poster":"Bienzahar","date":"2018-09-03T19:12:57.449+0000","up_votes":6,"down_votes":1,"body":"Y ojo, tiene smurfs xDDD","replies":[]}]},{"poster":"Diosmo","date":"2018-09-03T21:40:05.096+0000","up_votes":4,"down_votes":0,"body":"Hay 140 campeones en LoL y siempre vemos posts de dos en especial, Yasuo y Zed. Como que cansa la cosa.","replies":[]},{"poster":"MirRawrs","date":"2018-09-03T21:10:26.595+0000","up_votes":2,"down_votes":0,"body":"¿Estás escribiendo esto desde tu cuenta main? Si es así, ¿por qué hacerte smurf's cuando puedes dedicarte a mejorar en la main? :s","replies":[]},{"poster":"Errør 404","date":"2018-09-03T20:46:49.166+0000","up_votes":5,"down_votes":5,"body":"Y... Mirá, sos main Yasuo, un champ cliché, sin originalidad ni creatividad, creado única y exclusivamente para VENDER a todos los que, como vos, buscan al superclasico \"samurai rebelde\". \n\nComo si fuese poco, por alguna razón todos los main Yasuo son super soberbios, como si fuese un logro hacer un penta con un champ que, desde su lanzamiento, está roto. \n\nAún así, creo que te respeto ligeramente mas que a un main Yi o Trynda, ya que Yasuo tiene algunas mecanicas.\n\nEn fin, solo quiero que sepas que cuando hacés un penta y tirás maestria, estás afirmando que no tenés nepe. \n\nUn saludo!! :)","replies":[]},{"poster":"BiIIy the Kid","date":"2018-09-03T22:27:47.089+0000","up_votes":1,"down_votes":3,"body":"porque como no saben jugar y siempre les ganan los yasuos se desquitan con los yasuos de su equipo, asi de simple","replies":[]}]}