{"poster":"Toastersaot","date":"2016-08-30T19:58:38.131+0000","title":"Riot, thanks for going through on the idea I had for Yasuo a few weeks back","subforum":"Gameplay","embed":{"description":"This change will hurt Tanky Bruiser Yasuo with Zero Crit, but won&#039;t do much to Normal Crit Yasuo, who hits 100% Crit very Quickly. Please consider this for a change, as playing against this is just way too frustrating and needs to be gutted as a build path.","url":"http://boards.na.leagueoflegends.com/en/c/gameplay-balance/H3dUlFEl-make-yasuos-ult-armor-pen-apply-only-to-critical-strikes","image":"http://cdn.leagueoflegends.com/apollo/assets/vb/boards-wallpaper.jpg"},"up_votes":5,"down_votes":1,"body":"[](http://www.surrenderat20.net/p/current-pbe-balance-changes.html#balance)\r\n\r\nA few weeks ago, I made a post called &quot;Make Yasuo Armor Own only apply to critical strikes.&quot;\r\n\r\nYesterday I checked Surrender@20. They actually went through with the change.\r\n\r\nI&#039;m so glad Riot listened to the community on this issue, and I hope it happens again in the future.\r\n\r\nAlso just saying it here but it won&#039;t hurt his laning phase. It&#039;s BONUS Armor Pen, not flat pen. It&#039;s only good against tanks stacking armor.","replies":[{"poster":"Meddler","date":"2016-08-31T03:51:57.840+0000","up_votes":11,"down_votes":0,"body":"Thanks for the suggestion, seemed like a really good one at first glance that from the look of it will stand up under further scrutiny too!","replies":[{"poster":"ProfDrDeath","date":"2016-08-31T05:59:39.458+0000","up_votes":3,"down_votes":0,"body":"Apologies for bothering you with something offtopic, but a recent discussion in theses boards lead to a question that requires picking of a Rioter's brain (metaphorically speaking) to answer:\n\nIn 5.8, Blade of the Ruined King's recipe was change to include Recurve Bow, which was made the basic on-hit effect item in that patch. With this, the on-hit effect's minimum damage was increased from 3 to 10.\nIn 5.22, Recurve Bow's on-hit damage was increased to 15.\nDoes this mean that Blade of the Ruined King's minimum damage was also increased to 15?","replies":[]},{"poster":"Arthastheiceking","date":"2016-08-31T13:23:02.694+0000","up_votes":1,"down_votes":2,"body":"BRING SOLOQ BACK","replies":[{"poster":"Hello I am Bird","date":"2016-08-31T13:44:13.701+0000","up_votes":1,"down_votes":0,"body":"Oh, brother.","replies":[]}]},{"poster":"Decrit","date":"2016-08-31T10:45:43.859+0000","up_votes":1,"down_votes":0,"body":"Yo!\n\nJust saying that i am sorry for every people that will catch the occasion to spam under your comment! :P","replies":[]},{"poster":"Skyroar","date":"2016-08-31T08:25:18.783+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=BLEZEMau,comment-id=0000,timestamp=2016-08-31T03:51:57.840+0000)\n>\n> Thanks for the suggestion, seemed like a really good one at first glance that from the look of it will stand up under further scrutiny too!\n\nMeddler, have you ever considered making Yasuo slightly more latency-friendly as well, and perhaps slightly (only slightly) mechanically-extensive? It seems like the champion's mechanics are currently balanced for high play, making all those who love his style suffer.\n\nIt would be cool if his window to trigger EQ's melee whirlwind was extended by 1/4 of a second or so. My EQ combo doesn't seems to work sometimes for no actual reason other than what I suspect to be ping issues. Likewise, making his melee Q slightly (only slightly) easiert to hit, so that you don't get a miss even when you swear that it went through your opponent's body. Those changes shouldn't have much of an impact in high play, where good players can already do those consistently, but it would be nice QoL changes to lower--level Yasuo players.","replies":[{"poster":"WoonStruck","date":"2016-08-31T08:27:21.649+0000","up_votes":1,"down_votes":0,"body":">it would be nice QoL changes to lower--level Yasuo players.\n\nActually, you're talking about straight buffs that would make higher level Yasuo players far more oppressive, due to what they can get away with.\n\nRather than Riot changing their game for you, I suggest you get a Powerline Adapter/replacing your router (provided its a local issue), or look into one of the many ping fixes. ","replies":[]}]},{"poster":"Photos of Ghosts","date":"2016-08-31T08:04:29.723+0000","up_votes":1,"down_votes":0,"body":"Have you seen this one? http://boards.na.leagueoflegends.com/en/c/gameplay-balance/TEnXF9pt-how-to-make-reksai-stronger-in-non-competitive-teams-without-voicechat","replies":[]},{"poster":"MunchCrunchLunch","date":"2016-08-31T04:09:18.551+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=BLEZEMau,comment-id=0000,timestamp=2016-08-31T03:51:57.840+0000)\n>\n> Thanks for the suggestion, seemed like a really good one at first glance that from the look of it will stand up under further scrutiny too!\n\nmeddler you got any plans to buff rageblade for melees. i do agree that ragebalde needed changes from last time it was really godly on melees. even though it was still strong on ranged champs. any ideas? the on hit on it has been nerfed by about 66%. it got a little bit more base stats. but the attack speed is less. no aoe damage.  \n\nany plans for it. thanks. currently. no melee champion actually successfully buys it even when fed it doesn't seem like its worth building over pretty much anything else. its a kog maw kayle item atm. and its very strong on them but thats about it.\n\n\nalso am happy you guys didn't buff kled. hes been doing better than most new releases. and his winrate jumped by a whole 4% since last patch since people are getting used to him. he might be too strong. or just balanced. am not gonna call him undeniably overpowered. but he does seem like he has a little too many strong points.\n\n\nalso what do you think of jungle kog maw. its quite honestly feels like playing against a devoure rageblade yi with 600+ range and is currently in my opinion and some people too strong and hard to put behind. from my experience. he can clear jungle. faster than many meta junglers because of his W. jungle item true damage and base damages from W helps him clear so well early and its very hard to put him behind. before he grows too overwhealming.\n\n\ni hope i didn't ask too many questions.","replies":[]}]}]}