{"poster":"KilwaChan","date":"2017-01-30T23:31:31.689+0000","title":"Mi primera Ranked y solo recibi malos tratos, baneos y reports","subforum":"Nuevos jugadores","up_votes":4,"down_votes":2,"body":"Hola ^^u no se como deberia empezar, aunque quizas deberia por el momento en que decidi entrar a una ranked u.u\r\n\r\nFue bastante bien los primeros...2 minutos??? Luego el sup del equipo comenzo a agredirme verbalmente ._. osea, no le dije nada.\r\nMe correspondio jg en la partida, y...ese es el problema: en cada partida que voy solo me dejan adc o sup, y, como todos tenian ya sus campeones solo me dejaron ese rol u.u fue muy feo.\r\nPerdimos la partida, pero seguian ofreciendome ban y reports :&acute;c \r\n\r\nQuizas necesito practicar mucho mas, no hare 5 pentakills seguidas con 1 boton u-u pero deberia haber un poco de respeto :c el rank no te hace el mejor del mundo, menos en el lol, al menos eso es lo que creo.\r\n\r\nNo se que opinaran, a lo mejor estoy exagerando demasiado, pero es mi pensamiento.\r\nDe antemano, gracias por aceptar mis palabras ^^u{{champion:25}}","replies":[{"poster":"Hwaxinghz","date":"2017-01-30T23:45:27.760+0000","up_votes":3,"down_votes":0,"body":"Lo que te recomiendo es que juegues muchas Normales. Muy muchas Normales antes de empezar con las rankeds.\n\nTienes 8 victorias Normales nada más (en la Grieta del Invocador). Tienes que jugar mínimo hasta alcanzar las 100-200 victorias Normales así poder tener algo de práctica antes de mandarte a Clasificatorias.\n\nSinceramente te lo recomiendo porque sino terminaras frustrándote mucho.\n\nhttp://i.imgur.com/2sH4Ns1.png?noredirect\n\nAhí muestro una imágen de tu Perfil. Practica más en Normales así tienes más experiencia para Clasificatorias. De otro modo vas a acabar en Bronce 5 y después, cuando aprendas a jugar mejor, te darás cuenta que desperdiciaste un valioso tiempo para aprender en un inicio que es Cuando el Elo (o MMR de la cuenta) está \"vírgen\" (esto quiere decir que antes de que acabes las 10 primeras partidas clasificatorias, tu \"nivel de cuenta\" que no es 30, es un número especial que te mide como jugador, no está definido, por lo que aprendiendo a jugar en Normales podrás tener un mejor nivel personal y, posteriormente, clasificar mucho mejor. En otras palabras, practica más en Normals y tendrás mejores resultados y MENOS gente tóxica como la que te ha estado tocando en esa partida).","replies":[{"poster":"Kyo Hatori","date":"2017-01-31T00:08:22.457+0000","up_votes":2,"down_votes":0,"body":"Además de aprender qué rol y qué campeón va mejor. Apoyo totalmente a este muchacho, debes conocer a la perfección las mecánicas de tu champ, y los conceptos básicos como pushear, divear. (dejo link de un glosario que hice http://boards.las.leagueoflegends.com/es/c/nuevos-jugadores/2zyXPlFR-taorminos-que-quizaa-desconozcas)\n\nLuego de tener muchas partidas y campeones y roles definidos puedes empezar a jugar competitivamente. Antes no, porque será dañino para ti y para los que jueguen contigo jaj.\n\nFelices Pesadillas {{sticker:slayer-jinx-catface}}","replies":[]}]},{"poster":"luchocabbe","date":"2017-02-14T14:44:24.946+0000","up_votes":1,"down_votes":0,"body":"Pasa Claro que si, yo quede en plata 3 jugando solo un año, y recibi en las ranked mucho. pero mucho insulto, en inutil ponerte a discutir, en esos momentos el /mute all es lo mejor. como te dijieron mas abajo juga muchas muchas normales, otra que te recomiendo es que si te vas a meter a ranked lo hagas con amigos, asi ellos saben como jugas y viceversa, y no vas a tener problemas a la hora de jugar( una buena sesion de skype entre todos , asi ademas se divierten) Abrazo y suerte en tu ranked!","replies":[]},{"poster":"EliLove UWU","date":"2017-02-10T20:19:28.559+0000","up_votes":1,"down_votes":0,"body":"te dejo por aca un grupo donde estoy tratando de ayudar a la gente en su juego suerte,https://www.facebook.com/groups/1794336260887234/","replies":[]},{"poster":"Lord Maxlum","date":"2017-01-30T23:35:42.636+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Marcos3009","date":"2017-02-09T05:48:40.954+0000","up_votes":1,"down_votes":0,"body":"jajajajja","replies":[]}]},{"poster":"El Grando Smokio","date":"2017-01-31T03:37:26.234+0000","up_votes":1,"down_votes":0,"body":"THIS IS LAS, el flameo te seguirá hasta challenger no hay salvacion","replies":[]},{"poster":"Å være","date":"2017-01-31T01:04:26.886+0000","up_votes":1,"down_votes":0,"body":"Yo juego rankeds a veces cuando me siento inspirado y la verdad es muy tenso el clima de soloQ ,ojo yo no tengo mucha experiencia,ya que juego pocas rankeds por que la verdad me pone de muy mal animo la actitud que presentan algunas personas,si, es una ranked tenes que tener una actitud de querer dar todo pero ya hay personas que al minimo error ya se descargan toda la partida a travez del chat y a mi eso la verdad me aleja de las rankeds,aunque creo que lo que mas me molesta es que resalten hasta el minimo error y eso es lo que perjudica mas al que esta jugando pero  bueno supongo que hay que acostumbrarse a que las rankeds son asi.","replies":[]},{"poster":"Sir Crucifix ","date":"2017-01-31T00:22:06.902+0000","up_votes":1,"down_votes":0,"body":"Hay gente que se toma las rankeds en serio , y creen que por estar en diamante platino saben jugar","replies":[{"poster":"martincarp","date":"2017-01-31T00:34:21.342+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sir Crucifix ,realm=LAS,application-id=njUm58At,discussion-id=sb7Hr87y,comment-id=0003,timestamp=2017-01-31T00:22:06.902+0000)\n>\n> Hay gente que se toma las rankeds en serio , y creen que por estar en diamante platino saben jugar\n\nHay gente que por estar en Plata V creen que saben jugar y son dioses del ligoleshen.\n\nNo tengo nada contra los Plata V, obviamente, pero mi punto es que no se necesita estar en Platino o Diamante para encontrar jugadores agrandados.","replies":[]}]},{"poster":"Americans","date":"2017-01-30T23:47:20.429+0000","up_votes":1,"down_votes":0,"body":">baneos y reports\n\nNadie te baneo, de que bans hablas? No se te puede banear por jugar mal.","replies":[]}]}