{"poster":"Adawasdawada","date":"2016-11-02T09:29:10.337+0000","title":"Suche Team / Teamaufbau Schlacht um Runeterra","subforum":"Battlegrounds-Turniere","up_votes":1,"down_votes":0,"body":"Guten Tag,\r\n\r\nIch und ein mate sind auf der Suche nach einem Team, bzw. w&uuml;rden zur Not auch selbst eines Gr&uuml;nden.\r\nZiel des Teams ist es erstmal vollkommen Spontan bei der Schlacht von Runeterra mitzuspielen. \r\nAufgrund des Zeitmangels wird es uns nicht M&ouml;glich sein uns gro&szlig;artig einzuspielen, von daher sollte das ganze als Just4Fun angesehen werden.\r\n\r\nZu uns:\r\nDia 5 Midlaner - &quot;Sensei Palugi&quot;\r\nPlat 5 Jungler - &quot;adawasdawada&quot;\r\n\r\nWir haben schon gemeinsam in einem Organisierten Team gespielt und haben eine sehr Gute Jgl/Midlane Synergie. \r\nDes Weiteren besitzen wir viel Turnier und Teamranked Erfahrung aus einem voherigen Team, welches sich aufgrund des Zeitweise deaktivierten Teamrankeds aufl&ouml;sen musste.\r\nTS und sogar ein eigenes Forum kann ich zur Verf&uuml;gung stellen.\r\n\r\nF&uuml;r uns gibt es nun zwei Szenarien.\r\n1:\r\nIhr habt ein Team und sucht zuf&auml;llig einen Jungler/Midlaner oder eine Bot-Lane. (Wir w&uuml;rden sonst auch gemeinsam auf die Bot-Lane ausweichen)\r\nDann added mich und wir k&ouml;nnen das ganze kurz beschnacken. W&auml;re aber super wenn ihr zumindest hohes Gold seit :)\r\n\r\n2:\r\nIhr seit Einzelk&auml;mpfer und sucht auch noch nach einem Team f&uuml;r Runeterra. \r\nDann kommentiert hier bitte kurz was zu eurer Person, Username und welche Position ihr Maint. \r\nIch werde euch dann ggf. adden und das weitere mit euch beschnacken.\r\nGesucht werden dementsprechend 4-5 Spieler  (TOP, BOT, 1-2 Substitutes Allrounder)\r\n        \r\nWenn wir uns verstehen k&ouml;nnen wir anschlie&szlig;end auch gerne gemeinsam bei anderen TUrnieren mitspielen oder n&auml;chste Season zu 5 in die neue FlexQ gehen. \r\n\r\nWichtig: Wir haben nur noch bis Morgen Zeit uns zu registrieren, also nicht z&ouml;gern und auf auf! :)","replies":[{"poster":"Adawasdawada","date":"2016-11-03T06:44:23.651+0000","up_votes":1,"down_votes":0,"body":"Hallo und danke an alle Interessenten. Wir haben nun eine eingespielte Bot-Lane und suchen nun noch jemand der bereit ist auf der Top-Lane zu spielen.\nEin Sub für die Mid-Lane wäre auch noch super :)","replies":[]},{"poster":"ALPHA PHÖN1X","date":"2016-11-02T15:19:07.424+0000","up_votes":1,"down_votes":0,"body":"Moin, bin silver 4 und kann notfalls in jeder lane spielen, maine aber jng und hab ts.Meldet euch bei interesse.","replies":[]},{"poster":"Hitomononono","date":"2016-11-02T13:42:25.505+0000","up_votes":1,"down_votes":0,"body":"Hey ! wäre Gerne dabei, bin Platin 3 Main Support - zu mir selbst, bin 21 Jahre jung und im TS eher der ruhige Typ was nicht heißt das ich keinen Humor habe ^^ \nmein In-Game Name ist HPG Pacman","replies":[]},{"poster":"Chaosgamer42","date":"2016-11-02T12:18:37.119+0000","up_votes":1,"down_votes":0,"body":"Also ich könnte bei eurem team mitmachen suche grade auch noch ein team und position ist mir egal kann kann jede lane spielen  bei intresse meldet euch bei mir","replies":[]}]}