{"poster":"PlanetenPlatzer","date":"2015-02-22T21:41:32.297+0000","title":"STATISTIK - Leaver in 100 Spielen:","subforum":"Spielerverhalten & Moderation","up_votes":13,"down_votes":3,"body":"Ranked Solo Q ~Gold 1 - Platin 5 Elo\n\n**Inhaltsverzeichnis:**\n\n1. Vorwort (Unwichtiges Zeug um sympathisch zu Wirken)\n2. Die Statistik\n3. Genaue Informationen über die Statistik\n4. Zusammenfassung über die Statistik + KEM\n5. Verschiedene Stastiken + Links\n6. Endwort + mögliche Edits\n\n\n**1. Vorwort**\n\tWillkommen jener Beschwörer, der sich gerade auf diesem Forum des Spiels League of Legends herumtreibt.\n \tDieser Beitrag existiert auch im alten Forum. [Klicke hier um dorthin zu Gelangen](http://forums.euw.leagueoflegends.com/board/showthread.php?p=18689015#post18689015)\n\n\tIn einem anderen Thread (im alten Forum), habe ich mit ein paar Anderen - mehr oder weniger - aktiven Forenmitgliedern darüber diskutiert, ob es wirklich so \t\t\tviele Leaver in den einzelnen Runden gibt. Dort habe ich Hoch und Heilig versprochen 100 Spiele zu spielen, und mit zu Schreiben, wie viele Spieler nicht bis zum \t\tEnde durch halten; sprich leaven. Jedoch möchte ich es nicht hierbei belassen, sondern eine Serie daraus entwickeln. Weiteres erfahrt ihr unter \"6. Endwort +  \t\tmögliche Edits\", weiter unten.\n\n\tIch denke, dass dies doch sehr viele interessiert. Und deswegen hier die versprochene Statistik über die Leaver aus 100 Spielen (alle Ranked):\n\n**2. Die Statistik**\n\n\tSpiel 9:  \tLeaver im eigenen Team \t\t\n\t\t\tDisconnect nach ca. 10 Minuten; Grund: unbekannt\n\n\tSpiel 13: \tLeaver im gegnerischen Team \t\t\n\t\t\tDisconnect nach ca. 15 Minuten; Grund: Ragequit\n\n\tSpiel 17: \tLeaver im gegnerischen Team\t\n\t\t\tDisconnect nach ca. 10 Minuten; Grund: Ragequit\n\t\n\tSpiel 27: \tLeaver im eigenen Team\t\t\n\t\t\tDisconnect nach ca. 10 Minuten; Grund: Ragequit\n\n\tSpiel 51: \tLeaver im gegnerischen Team\t\n\t\t\tDisconnect nach ca. 20 Minuten; Grund: Ragequit\t\n\n\tSpiel 82: \tLeaver im eigenen Team\t\n\t\t\tGrund: unbekannt, kam nie ins Spiel -> AFK seit Minute 1\n\n\n\n**3. Genaue Informationen über die Statistik**\t\nDie gesamte Statistik, besteht aus 100 Spielen, die im Spielmodus: Solo Q (Ranked) abgeschlossen wurden. Aufgezeichnet wurde die Statistik vom Spieler League of \t\tShaco, welcher in diesem Zeitraum in der Liga ~Platin 5 vertreten war. Die 100 Spiele wurden über den Zeitraum von 4 Wochen gespielt. Dies sind 3-4 Spiele pro Tag \t\t(ich wollte die Statistik noch unbedingt fertig bekommen, bevor das alte Forum schreibgeschützt ist). Genauer gesagt erstreckt sich dieser Zeitraum, vom 23. Jannuar \tbis zum 21. Februar. Alle Spiele wurden alleine gespielt. Das bedeutet kein Premade an meiner Seite.\n\t\n\tIn den Spielen 24, 43, 66, 80 und 94 war jeweils 1 Spieler für kurze Zeit afk.\n\n**4. Zusammenfassung über die Statistik + KEM**\t\nIn 100 Spielen 3 Leaver im eigenen Team.\n\tIn 100 Spielen 3 Leaver im gegnerischen Team.\n\tIn 100 Spielen 6 Leaver insgesamt.\n\tIn 100 Spielen 4 Ragequits, ein unbekannter Disconnect und ein Ladefehler.\n\tDie meisten Leaver, leaven nach ca. 10 Minuten. \n\tIn 100 Spielen wurden 2 der 6 Spiele gedreht (Team das zuerst zurücklag gewann 5vs4, durch afk im jeweils gegnerischen Team).\n\tIn den 6 Spielen hat immer das Team mit den 5 Spielern gewonnen. \n\tDas Team mit den 4 Spielern hat 6 Mal verloren.\n\tIn 6 Spielen hat das Team mit den 4 Spielern kein Einziges mal aufgegeben.\n\n\tKurze Eigene Meinung (KEM): Ich finde, 6 Leaver in 100 Spielen zu haben, ist ein normaler Wert. Natürlich wäre es schön gar keine zu haben, aber das ist nur ein \t\tWunschdenken. \n\t\n**5. Verschiedene Statistiken + Links**\n\t**Eine Übersicht für alle Statistiken findet ihr hier:**\n\n\t[Übersicht](http://boards.euw.leagueoflegends.com/de/c/spielerverhalten-de/YAQP8EQk-lol-leaver-statistik-ubersicht)\n [Gleiche Statistik im alten Forum](http://forums.euw.leagueoflegends.com/board/showthread.php?p=18689015#post18689015)\n\nSicher ist, dass alle weiteren Statistiken nurnoch auf dem neuen Forum veröffentlicht werden. \n\n\n**6. Endwort**\t\nIn Zukunft möchte ich noch mehr, meiner eigenen Statistiken veröffentlichen. Diese können allerdings nicht Schlag auf Schlag erfolgen, da ich erst einmal 100 Spiele \tdes jeweiligen Spielmodus' spielen muss/will/soll/werde. \n\n\n\tDas wars von mir und meiner ersten Statistik. Bitte nennt mir Verbesserungsvorschläge bzw. weitere Dinge die ich in die Statistik einbringen sollte/könnte. \n\tRechtschreib- Ausdrucks- und Grammatikfehler bitte ignorieren.\n\t\n\tDu hast weitere Fragen zur Statistik? - Adde mich oder schreib hier drunter bzw. unter anderen Statistiken einen Kommentar bzw. Beitrag. Ich beantworte gerne eure \t\tFragen.\n\n\n\n\t\n\tEuer League of Shaco!  \n\n\t-Why so serious? \n\n\n***Edit 1: Aus irgendeinem Grund wurden Punkt 4 und 5 nicht in den Beitrag übernommen. \nEdit 2: Fehler verbessert. Über dem Inhaltsverzeichnis Spielmodus hinzugefügt.***","replies":[{"poster":"hshtagniemehrcdu","date":"2015-02-22T22:14:28.673+0000","up_votes":2,"down_votes":0,"body":"Eine Art \"Schlussfolgerung\" o.ä. von dir wäre wohl interesssant.\nGibt es Besonderheiten/Auffälligkeiten?\nWird irgendeine \"verbreitete/bekannte\" Meinug besttäigt oder wiederlegt?\nO.ä.","replies":[{"poster":"PlanetenPlatzer","date":"2015-02-22T22:23:47.235+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Eleandor317,realm=EUW,application-id=KYnfKGf0,discussion-id=Eoy7VebQ,comment-id=0001,timestamp=2015-02-22T22:14:28.673+0000)\n>\n> Eine Art \"Schlussfolgerung\" o.ä. von dir wäre wohl interesssant.\n> Gibt es Besonderheiten/Auffälligkeiten?\n> Wird irgendeine \"verbreitete/bekannte\" Meinug besttäigt oder wiederlegt?\n> O.ä.\n\nWas mir aufgefallen ist, ist dass Midlaner am öftesten ragequitten.  **Edit:** Das kann sich natürlich auch nur um einen Zufall gehandelt haben.\nWas sicherlich jeder schön gehört hat, ist dass Spieler die am flamen sind, nur noch herumstehen, sich nicht konzentrieren und nur am Schreiben sind. Dass ist auch 2-3 Mal passiert. \n\nWas genau meinst du mit verbreiteten bzw. bekannten Meinungen? Welche wären das zum Beispiel?","replies":[{"poster":"Humpelstilzche","date":"2015-02-22T22:53:12.519+0000","up_votes":3,"down_votes":0,"body":"Mit so einer Schlussfolgerung (also die über die Midlaner) wäre ich angesichts der winzigen Stichprobe (6 leaves) extrem vorsichtig. \nDas ist in etwa so wie wenn ich 6 mal würfeln würde und auf Basis dessen eine Aussage darüber machen würde, wie bzw. ob der Würfel gezinkt ist.","replies":[{"poster":"PlanetenPlatzer","date":"2015-02-23T17:56:26.752+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Humpelstilzche,realm=EUW,application-id=KYnfKGf0,discussion-id=Eoy7VebQ,comment-id=000100000000,timestamp=2015-02-22T22:53:12.519+0000)\n>\n> Mit so einer Schlussfolgerung (also die über die Midlaner) wäre ich angesichts der winzigen Stichprobe (6 leaves) extrem vorsichtig. \n> Das ist in etwa so wie wenn ich 6 mal würfeln würde und auf Basis dessen eine Aussage darüber machen würde, wie bzw. ob der Würfel gezinkt ist.\n\nHab meinen Kommentar editiert. Natürlich könnte dass auch nur bei mir der Fall gewesen sein, allerdings habe ich zu diesem Zeitpunkt wohl nicht daran gedacht. \nWelche Rolle wirklich am öftesten dem Ragequit verfällt, wird sich aber noch zeigen. ;)","replies":[]},{"poster":"ZerShmtterling","date":"2015-02-23T15:02:42.255+0000","up_votes":1,"down_votes":1,"body":"sehe ich auch so, ich habe zB die erfahrung gemacht das toplane oft ragequitted und früher war es eher jungle, obwohl adc auch oft war eine zeit lang. am seltensten scheinen aber echt die supporter zu ragequitten... könnte aber auch daran liegen das ich meist support gespielt habe letzte saison.","replies":[]}]}]}]},{"poster":"The Real SLeYgA","date":"2015-02-22T21:49:18.915+0000","up_votes":1,"down_votes":0,"body":"Interessant ich hatte in meinen bis jetzt 6 gespielten Placements auf meinem Smurf schon halb so viele Leaver wie du :(\n\nIch denke dass die Elo eine wichtige Rolle spielt, da Leaver häufiger verlieren und deswegen in nierdrigeren Elo-Bereichen eine vielfaches an Leavern zu finden ist....","replies":[{"poster":"CMan","date":"2015-02-22T21:55:54.944+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=The Real SLeYgA,realm=EUW,application-id=KYnfKGf0,discussion-id=Eoy7VebQ,comment-id=0000,timestamp=2015-02-22T21:49:18.915+0000)\n>\n> \n> Ich denke dass die Elo eine wichtige Rolle spielt, da Leaver häufiger verlieren und deswegen in nierdrigeren Elo-Bereichen eine vielfaches an Leavern zu finden ist....\n\nDieser Mythos hält sich schon so lange, aber die Statistik sagt nein. http://euw.op.gg/statistics/tier/\nLeaver sind in allen Ligen gleichermaßen vertreten.","replies":[{"poster":"Humpelstilzche","date":"2015-02-22T22:01:49.941+0000","up_votes":3,"down_votes":0,"body":"Diese Statistik ist auch insofern nicht weiter verwunderlich, da die meisten Leaver nicht absichtlich leaven und insofern Dinge wie Ehrgeiz oder Professionalität keine signifikante Rollen spielen. Ebenso wenig hat anders rum die Leave-Rate einen starken Einfluss auf die Elo, da die Spieler nur sehr selten leaven und der Einfluss somit minimal ist. \n","replies":[]},{"poster":"xXKUR0S4K1Xx","date":"2015-02-22T22:29:16.189+0000","up_votes":2,"down_votes":2,"body":"Statistik ist schlichtweg falsch (8 aus 10000 heisst nur 0.8% der spiele hat einen leaver im eigenen oder gegnerischen team). Zählt wahrscheinlich ,wie andere poster schon sagten, nur leute die von minute 1 bis ende nich da sind. Das hat logischerweise technische Gründe. Aber in den low Elo's quitten die Leute andauernd weil sie kein Bock mehr haben und in höheren Elo's so gut wie garnich. Hatte selber länger keinen ragequitter mehr im team (ausser in Dominion komischerweise, wahrscheinlich weil die Leute den Modus nicht ernst nehmen) aber mein Kumpel hat die andauernd. Immer wenn ich spectate is da ein leaver.","replies":[{"poster":"CMan","date":"2015-02-22T22:40:04.270+0000","up_votes":1,"down_votes":2,"body":"***","replies":[{"poster":"The Real SLeYgA","date":"2015-02-22T22:50:15.205+0000","up_votes":3,"down_votes":0,"body":"Wieso? Jeder darf seine Meinung sagen. Alles was er getan hat, war die Statistik mit seinen Erfahrungen zu vergleichen. Er hat nicht einmal die Statistik selbst angezweifelt, sondern nur das was darin aufgenommen wurde und was nicht.\n\nWas wäre das für eine Welt, in der ich nur noch Aussagen treffen darf wenn ich selbst eine Studie zum Thema gemacht habe?","replies":[]},{"poster":"xXKUR0S4K1Xx","date":"2015-02-22T23:10:05.542+0000","up_votes":1,"down_votes":0,"body":"Das nennt man anekdotischen Beweis. Meine Erfahrung und die jedes anderen Spielers (Op miteinbezogen) weichen so stark von der Statistik ab das es statistisch sehr signifikant ist. Ergo die wahrscheinlichkeit das die Statistik -so wie man sie normalerweise interpretieren würde- falsch ist ist extrem hoch. Das heisst entweder sind die Zahlen falsch (bezweifle ich) oder man muss die statistik anders interpretieren als zuvor angenommen. Daher kommt die Annahme das nur \"komplette\" leaves gezählt werden, also nur Leute die von Anfang bis Ende nicht im Spiel waren. \n\nMan kann auch anders darüber nachdenken um sich den Gedankengang zu erleichtern: Man zähle alle Spieler im Spiel die für mindestens 10 Sekunden einen dc haben. Jetzt haut die Statistik auf jeden Fall total daneben. Dass heisst es muss eine mindest Zeit geben in der ein Spieler afk war. Die ist meiner Vermutung nach das ganze Spiel, weil sonst anekdotisch gesehen die Statistik nicht hinkommt und es verhältnismässig einfacher wäre als ein spezielles Zeitlimit zu setzen (wie sollte man das auch machen).\n\nDaher gibt die gegebene Statistik wenig zur Diskussion bei.","replies":[]}]}]},{"poster":"ZerShmtterling","date":"2015-02-23T14:59:46.157+0000","up_votes":1,"down_votes":0,"body":"sehe ich das richtig das laut deiner statistik nur 7-8 leaver in 10000 spielen sind ? von daher kann diese \"statistik\" nicht richtig sein und ist totaler mumpiz...7-8 in 10k spielen...das wäre ein traum wenn es jemals so weit kommen sollte :D\nich habe mich letzte saison von bronze 1 nach gold 4 hochgespielt und im niedrigen silber bereich waren auf jeden fall die meisten leaver. und das war in mehr als \"nur\" 6 von 100 spielen der fall. ich denke schon das die elo ein grossen anteil daran hat.","replies":[{"poster":"PlanetenPlatzer","date":"2015-02-23T17:54:31.383+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=ZerShmtterling,realm=EUW,application-id=KYnfKGf0,discussion-id=Eoy7VebQ,comment-id=000000000003,timestamp=2015-02-23T14:59:46.157+0000)\n> ich habe mich letzte saison von bronze 1 nach gold 4 hochgespielt und im niedrigen silber bereich waren auf jeden fall die meisten leaver. und das war in mehr als \"nur\" 6 von 100 spielen der fall. ich denke schon das die elo ein grossen anteil daran hat.\n\nOb das stimmt kann ich nicht genau sagen, da ich schon ewig aus Silber draußen bin. Einen Unterschied von Gold zu Platin bemerke ich allerdings nicht.","replies":[]},{"poster":"4 R4nd0m N008","date":"2015-03-16T14:38:44.635+0000","up_votes":1,"down_votes":0,"body":"Ich habe in Normal Games glaube ich nicht mal 6 Leaver auf 100 Games.","replies":[]}]},{"poster":"The Real SLeYgA","date":"2015-02-22T22:11:11.494+0000","up_votes":1,"down_votes":0,"body":"Ah okay danke für die Berichtigung meiner falschen Annahme :)\n\nStimmt das mit den ca. 0,08%? Das hieße in 100 Rankeds nur ein Leaver im Durchschnitt. OP hat schon 6%, und ich denke dass die meisten in hundert Spielen mindestens einen Leaver hatten...","replies":[{"poster":"Humpelstilzche","date":"2015-02-22T22:20:26.079+0000","up_votes":2,"down_votes":0,"body":"Ich denke das op gg nur in der Lage ist \"komplette\" Leaves zu sehen, also solche die auch in der History stehen. Die Dunkelziffer der Kurzzeitleaves dürfte schon etwas höher sein. \nKomplette Leaves erlebe ich selbst allerdings auch sehr selten. Und ich spiele (zumindest momentan) primär Normals, wo laut Riot die Leaver-Rate etwa doppelt so hoch ist wie im Ranked. Insofern kommen mir die Statistiken schon recht glaubhaft vor.","replies":[]}]},{"poster":"Gumpuz","date":"2015-04-18T12:35:34.094+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Klemens,realm=EUW,application-id=KYnfKGf0,discussion-id=Eoy7VebQ,comment-id=00000000,timestamp=2015-02-22T21:55:54.944+0000)\n>\n> Dieser Mythos hält sich schon so lange, aber die Statistik sagt nein. http://euw.op.gg/statistics/tier/\n> Leaver sind in allen Ligen gleichermaßen vertreten.\n\nMoin erstmal,\nes tut mir leid dir da widersprechen zu müssen. Aber in meiner Liga Bronze 4 kann ich dir mit mittlerweile sehr guter Erfahrung sagen dass jedes dritte Spiel jemand afk geht. Es ist schön zu hören dass bei euch da oben nur 3-6% raus gehen aber in Bronze sieht es einfach komplett anders aus. Und v vom flamen will ich gar nicht erst anfangen.","replies":[{"poster":"eingew","date":"2015-04-18T12:37:38.352+0000","up_votes":1,"down_votes":0,"body":"Und inwiefern sind eigene subjektive Erfahrungen hilfreich, um die Allgemeinheit in einer Liga zu beschreiben? Vor allem, wo du selbst so viel Einfluss auf deine Spiele hast bezweifle ich, dass man daraus eine Statistik machen kann, die für alle Aussagekräftig ist.","replies":[]}]}]}]},{"poster":"Aquera","date":"2015-05-22T22:23:29.888+0000","up_votes":2,"down_votes":0,"body":"Ich habe in Statistik gelernt, dass man mit 100 Dingen/Spielen keine Statistik anführen sollte. Wenn du 2000 - 2500 Spiele dokumentiert hast, dann wäre das etwas genauer. Wer sagt dir, dass in den nächsten 20 Spielen nicht 10 Leaver dabei sind? Bei der von mir aufgeführten Menge, haben sich mögliche Ausreißer eingependelt und geben einen etwas wahreren Wert wieder.\n\nIch hab auch mal Tage an denen verläuft alles reibungslos und dann gibt es wieder genau den einen Tag im Monat an dem ich denke ich könnte die ganze Comm an die Wand fahren mit ihrem Geleave. Jüngstes Beispiel war erst diese Woche. Hatte 4 Leaver in 4 Spielen (aufgeteilt 1:3).  Danach war \"X\" oben rechts angesagt. \n\n6 % mögen zwar nicht viel sein, aber das ist ein Faktor von vielen.\n\nDann gibts noch die X % die ab Minute 10 FF20 schreiben.\nDann gibts noch die X % die absichtlich feeden/trollen.\nDann gibts noch die X % die laggen aber keinen DC/Leave haben.\nDann gibts noch die X % die durch Flame die eigenen Mitspieler verunsichern.\n\nOverall würde ich sagen kommt es zu einem viel höheren %-Satz an misslungenen Spielen, die abseits des spielerischen Geschehnisses einfach als \"Nicht gewinnbar\" eingestuft werden sollten. Das ganze trägt natürlich NICHT dazu bei, dass man schlechter spielt (da das im gleichen Verhältnis in etwa dem Gegnerteam auch passiert), aber die Lust am fair Play ist einfach nicht kontinuierlich gegeben.  \n\nMein Fazit:\n\nDeine in zu wenig Spielen herausgefilterten 6 % spiegeln nicht das reale Fairplay oder die Anzahl an gescheiterten Spiele durch Leaver. \nDu kannst zwar jetzt anführen, was dir in genau 100 Spielen in Punkto \"Leaver\" erwartete, aber ich weiß jetzt nicht genau, was du damit bewirken willst.\n\nVerbesserungsvorschläge:\n\nDu holst dir Freunde/Freiwillige ins Boot die in ihren unabhängigen Spielen dir in vertraulicher Weise richtige Daten liefern, damit du nicht von deinen 100 Spielen ausgehen musst, sondern auf einen viel größeren Pool zurückgreifen könntest. Damit bist du viel wissenschaftlicher und genauer.","replies":[{"poster":"PlanetenPlatzer","date":"2015-05-22T22:43:37.933+0000","up_votes":1,"down_votes":0,"body":"Diese Statistik zeigt nicht wie viele Spiele \"nicht gewinnbar\" waren. Sie zeigt auch nicht die ganzen Sorten von Spielern die du aufgelistet hast.\nAlles was sie zeigt ist, wie viele Spieler denn tatsächlich die Verbindung verloren (mit Absicht oder auch nicht) haben.\n\nFür mich reichen die 100 Spiele schon. Und wenn das deine Meinung ist gut so. Außerdem will ich damit nichts für mich \"bewirken\". Es geht einfach darum, dass es so etwas noch nicht gab und viele Spieler denken, es wären doch sooo viele. Wenn es aber eine Statistik gibt, die sie auch sehen, dann regen sie sich gleich nicht mehr so auf. Natürlich gilt das nicht für alle.\nUnd außerdem ist es auch interessant. Und \"wissenschaftlich\" muss es ja nicht sein.\n\nLg","replies":[{"poster":"Aquera","date":"2015-05-22T23:40:41.907+0000","up_votes":1,"down_votes":0,"body":"Dir steht es frei, den Teil auszuklammern indem ich das andere Zeug angeführt habe. Das war eher ein Zusatz und muss jetzt nicht unbedingt mit deinem Post in Einklang stehen. Trotzdem trägt das wie du gerade schön sagtest dazu bei \"sich aufzuregen\".\n\nDennoch sind 100 Spiele allgemein nicht aussagekräftig genug.\nWenn es für dich reicht, dann ist es ja schön, aber definitiv nichts, mit dem du argumentieren kannst. (bzw. noch nicht argumentieren kannst)\n\nEben du erwähnst zwar, dass die Spieler nun eine Statistik sehen würden (deine) und es ja gar nicht so viele wären die leaven und genau an dem Punkt ist deine Statistik !NOCH!!!!! nicht aussagekräftig genug. [Erklärung oben]\nDaher auch mein Verbesserungsvorschlag.\n\nDie Formulierung \"Statistik\" setzt voraus, dass es auf einer wissenschaftlichen Basis fungiert, da alle Elemente, die zu einer Statistik führen der Mathematik obliegen und diese ist eine Wissenschaft. \n\nBitte sehe das nicht als negative Kritik, sondern ich wollte dir dabei helfen. Weil was bringt dir jetzt der nackte Wert \"6 %\", wenn morgen Summoner Y eine Statistik posted mit 3.000 Einträgen und er kommt auf 11 % Leaver. Wem willst du dann noch etwas beweisen. Aber ich finde es prinzipiell gut, dass du dich damit befasst und dies wohl noch ausweiten wirst.\n\nEdit:\n\nEs spielen auch noch andere wichtige Faktoren eine Rolle. Du hast angegeben täglich etwa vier Spiele absolviert zu haben. Diese werden sich auch auf eine bestimmte Tageszeit beschränken und da **kann** der Hase im Pfeffer liegen. Weil es kann Stoßzeiten geben, in denen es besonders viele Leaver gibt in Relation oder sogar weniger.\n\n- Allgemeine Altersschichten zu verschiedenen Uhrzeiten\n- Gelegenheitsspieler zu bestimmten Zeiten, die das Spiel anders aufgreifen, als der der 100 % Tryharded\n- Wochentagbedingte Zeiten (Wochenende auch mehr Leute, die unter der Woche arbeiten und dort keine Zeit haben zu spielen)\n- Ferienzeiten unterm Jahr\n- Ereignisse in LoL (Saisonstart - Saisonende - IPBoosts - neuer Champ - etc.)\n\nUnd genau deswegen empfehle ich von möglichst vielen Leute an Daten zu kommen, wenn dir das eventuell am Herzen liegt =)","replies":[{"poster":"PlanetenPlatzer","date":"2015-05-23T01:24:36.440+0000","up_votes":1,"down_votes":0,"body":"Ich nehm's auch nicht negativ auf. So genau nimmt es mit der \"Statistik\" doch niemand, außer dir.\n\nWenn morgen tatsächlich so jemand kommt, dann finde ich das gut. Mir ist es egal ob ich derjenige bin der so etwas macht oder jemand anderes. Und wie du ja weißt, will ich das Ganze ausbreiten. Außerdem ist bei der nächsten Statistik (ich nenne es weiterhin so) sowieso schon die Uhrzeit der Wochentag und das Datum dabei.","replies":[]}]}]}]},{"poster":"cremnik","date":"2015-02-23T12:32:01.176+0000","up_votes":2,"down_votes":0,"body":"Super Beitrag, obwohl ich eigentlich keiner Statistik glaube, die ich nicht selbst gefälscht hab ;)","replies":[]},{"poster":"MahouShoujoRakka","date":"2015-02-23T00:26:26.784+0000","up_votes":2,"down_votes":0,"body":"Wie schon angesprochen, die Stichprobe ist sehr klein.\nAllerdings muss ich sagen, dass ich mittlerweile tatsächlich den Eindruck habe, dass trotz op.gg Statistik in Bronze mehr Leute leaven.\nGrund: Habe zwei Bronze-Spieler in meiner FL, die ich ab und an mal spectate und einen Spielkommentar mache. Beide haben rote Badges, es ist also nicht davon auszugehen, dass sie durch toxicity mehr Leaver als ein Durchschnittsspieler haben(eher weniger, auch von meinem persönlichen Eindruck her).\nUnd die Anzahl an Leavern in den bisher beobachteten Spielen war schon...hoch. Oft auch solche Part-Time-Leaves. Da ist der gegnerische Sion von Minute 10 bis 22 afk und die eigene Tristana von Minute 27 bis 35. Im gleichen Spiel. Und ich gehe ebenfalls davon aus, dass op.gg nur nach \"Leave\" als Spielausgang Ausschau hält und nicht nach Leaverbuster-Flags, die in der Riot API sowieso nicht auslesbar sein werden.\n\nAnsonsten kann ich deine Statistik ein bisschen erweitern, wenn du möchtest, im Spielverlauf haben sich ja genug Rankeds angesammelt und anhand von Level/Farm kann man die AFKler auch nachträglich einfach identifizieren. Kostet halt nur ziemlich viel Zeit.","replies":[]},{"poster":"Anbo","date":"2015-02-22T23:12:06.318+0000","up_votes":2,"down_votes":1,"body":"Mach mal ne Statistik über Beleidigungen oder Schuldzuweisung. Ich habe die Erfahrung gemacht die Leute mit den \"schlechtesten\" Stats geben häufiger anderen die Schuld.","replies":[]},{"poster":"MrAmbulance","date":"2015-05-09T16:40:14.971+0000","up_votes":1,"down_votes":1,"body":"**Liebe Riot-Mitarbeiter und jeder Mitspieler,**\nich wollte mal eine Sache loswerden zum Thema \"Leaver\" und dem neuem System vom Riot was da gegenwirken soll. Ich habe kein Problem, wenn jemand das Spiel verlässt bevor das Spiel losgeht. So bin ich wenigstens sicher, das der Typ der gerade abgebrochen hat, sich nicht zwingt das Spiel zu spielen und die ganze zeit rumheult, weil er irgend etwas nicht bekommt und deswegen andere runterzieht.\n\nDoch dadurch, dass man bestraft wird, weil man vor spielbeginnt das spiel verlässt und nicht wärend man im Spiel ist, zwingen sich zu viele das Spiel auf.\nWas Demotiviert.\nDazu kommt wenn schon in der Championselect Sprüche wie \"top or troll\" kommen oder als last pick gefordert wird einen champ nicht zu bannen, obwohl dieser Champ zur Zeit sehr op ist oder jemand ohne was zu sagen einlog was nicht nur außerhalb der meter ist, sonder einfach komplett Idiotisch ist, ist das leaven mehr als berrechtig, wenn das Ziel nur einmal das Aufsteigen in der Liga ist und kein \"normal\" spiel wo alle nur so spielen und auch mal lustige combinationen ausprobieren wollen.\n\nEs kann nur mal nicht sein das solche leute es ausnutzten das andere bestraft werden wenn sie denjenigen nicht machenlassen was sie wollen.\n\nDie die ein normales Ligaspiel machen wollen, sollten nicht deswegen bestraft werden, wenn sie leaven oder sich zwingen mit diesen Leuten zu spielen. Es lässt nur diejenigen frusten die eigent lich nicht rumflamen wollen weil sie koplett am spiel verzweifeln weil sie von keinem mit vernuft erhört werden nein sie werden meistens nocht beleidigt, weil sie versuchen das spiel noch zum Sieg zu reißen, was den Spielspaß drastisch reduziert.\n\nEs ist in Ordnung neue meta auszuprobieren, problem ist aber und wird immer sein, das es Leute gibt den es nicht interessirt ob andere Ranken wollen um aufzusteigen. Sie öffnen ein Rankspiel statt ein normal spiel.\n Gerade, wenn die den noch einen raufsetzten mit \"first time\", da kann ich am liebsten ausrasten und das obwohl ich eigentlich ziemlich ruhiger Mensch bin.\n\nIch bitte euch das System zu überarbeiten und lieber eine Bannfunktion einzufügen wo leute die ihre eigenen Mates trollen aus den Rankspielen gebannt werden, für eine weile.","replies":[{"poster":"PlanetenPlatzer","date":"2015-05-09T21:01:10.795+0000","up_votes":1,"down_votes":1,"body":"Meta* nicht \"Meter\" xD\n\nNun, da kann man leider nicht sehr viel ändern. Wenn man die Strafe entfernen würde, dann würden die Leute die ganze Zeit über aus der Championauswahl fliehen. Eben, weil ihnen irgendetwas nicht gefällt. Daher kann man die Strafe nicht einfach entfernen.\n\nMan könnte es so machen, dass man eine Strafe bekommt, wenn man 3x nacheinander rausgeht. Aber ich wäre trotzdem dagegen, weil die Leute dann eben 2x mal fliehen würden, bevor sie mit einem Spiel einverstanden sind.\n\nUnd das wäre ziemlich nervig, oder etwa nicht? :)\n\nAußerdem solltest du deine Meinung als eigenen Beitrag veröffentlichen, hier wirst du leider nicht sehr viele Leute erreichen, weil der Thread schon etwas gealtert ist.","replies":[{"poster":"MrAmbulance","date":"2015-05-09T21:13:32.920+0000","up_votes":1,"down_votes":0,"body":"sry, meine Rechtschreibung ist unter aller sau. Hab dafür kein Talent. lieber hab ich aber Leaver vor dem spiel als in dem spiel und ich bin der Meinung das Leute dessen Ziel ist eine Runde zu trollen in Rank-Games das die bei mehrmaligen auffallen einfach ein Rank-Gameverbot von mehreren tagen bekommen. Um sowas zu verhindern. aber danke für den hinweiß wegen dem \"einen neuen beitrag\" eröffnen","replies":[]}]}]},{"poster":"Twait","date":"2015-03-24T20:05:46.135+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"eingew","date":"2015-03-25T20:59:23.218+0000","up_votes":1,"down_votes":0,"body":"http://euw.op.gg/statistics/tier/\n\nDas ist zwar nicht perfekt, weil die Statistik Leaver lange nicht so genau erkennt, wie der Leaverbuster selbst, sollte aber zeigen, dass die Rate der Leaver an sich, sich nicht besonders stark unterscheidet.","replies":[]}]},{"poster":"ThanhSon","date":"2015-03-16T21:19:21.580+0000","up_votes":1,"down_votes":0,"body":"Bitte verschiedene Ligen ausprobieren, wäre total cool.","replies":[{"poster":"PlanetenPlatzer","date":"2015-03-17T21:28:06.188+0000","up_votes":1,"down_votes":0,"body":"Ich habe auch einen smurf account der noch unranked ist. Von welcher Liga hättest du denn gern mehr Informationen?","replies":[{"poster":"ThanhSon","date":"2015-03-18T15:31:28.328+0000","up_votes":1,"down_votes":0,"body":"Silber  Gold,  perfekte Elo am besten so hoher  Silber Bereich da sich dort viele aufhalten:)","replies":[{"poster":"PlanetenPlatzer","date":"2015-03-18T16:43:39.283+0000","up_votes":1,"down_votes":0,"body":"Gut, ich werde einmal die 10 Spiele spielen und dann sehen wir ja wohin ich eingestuft werde. Wahrscheinlich werde ich ein paar Spiele spielen müssen bis ich in der passenden Liga und Division angekommen bin.","replies":[]}]}]}]},{"poster":"PwnedAkkon ","date":"2015-02-28T19:11:27.458+0000","up_votes":1,"down_votes":0,"body":"Sehr gut gemacht.","replies":[]},{"poster":"xXEpicVayneXx","date":"2015-02-24T20:51:18.635+0000","up_votes":1,"down_votes":0,"body":"Meiner Meinung nach Ragequiten Adc am meisten.","replies":[{"poster":"PlanetenPlatzer","date":"2015-02-25T19:32:28.624+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=LuckyCraftFisheR,realm=EUW,application-id=KYnfKGf0,discussion-id=Eoy7VebQ,comment-id=0005,timestamp=2015-02-24T20:51:18.635+0000)\n>\n> Meiner Meinung nach Ragequiten Adc am meisten.\n\nIch habe gerade mit der Aufzeichnung einer neuen Statistik angefangen. Vielleicht stimmt deine Meinung ja mit ~Gold 4 Elo in Normal Games überein. ;)","replies":[]}]},{"poster":"Arrabbiato","date":"2015-03-16T14:06:33.118+0000","up_votes":1,"down_votes":2,"body":"Interessante Statistik..würde mich freuen so eine afk-rate zu besitzen :)\nPlacement spiele 6 AFKer = 6/10 verloren = Gold III ging das Elend weiter, was meiner Meinung nach die Brutstätte jedes AFKer ist. \nVon meinen bisher 48 abgeschlossenen Spielen waren +/- 1  15 AFKer (in meinem Team) , und erstaunlicherweise 1 Fall im Gegnerteam gehabt.\nDas einzig gute daran ist, dass ich mittlerweile vor Wut 90 Kg Bankdrücken schaffe, den AFKer sei Dank :D \nDenke mal ab Gold II müsste sich das stabilisieren. Wünsche euch allen viel Glück!","replies":[{"poster":"PlanetenPlatzer","date":"2015-03-16T17:39:51.297+0000","up_votes":2,"down_votes":1,"body":"Wieso sollten die Spieler ab Gold 2 nicht mehr so häufig leaven?","replies":[]}]}]}