{"poster":"4MeRockz","date":"2017-11-05T13:36:10.141+0000","title":"Unlock Permanently Banned Accounts ReFormed Players","subforum":"Player Behavior","up_votes":222,"down_votes":121,"body":"I'm sure everyone in the community knows friends who has been toxic and inappropriate in their league games. Some of you may even know friends who have gotten banned for a week, 2 weeks or even permanently banned. Some of these players don't realize the harshness of the punishment riot can bring to your account.\r\n\r\nWell, I happen to be that person. I was permanently banned for saying a bunch of stupid things that meant nothing to me at the time. I truly feel bad for the people that had to go through my behavior. I severely regret the hundreds of dollars I spent on the game only for it to go to waste. That's why I'm here to make a statement and tell anyone that exhibits toxic behavior to stop now, it will only get worse.\r\n\r\nI feel like many people that have been permanently banned, didn't know the true punishment to behaving in such a way. I also feel that many perma-banned players have been reformed, myself included and want to continue playing League of Legends with their group of friends. I believe that Riot should unlock all permanently banned accounts starting fresh this new season. This will allow everyone to get a chance to reform and prove themselves on the Summoner's Rift.\r\n\r\nPlease consider unlocking permanently banned accounts this upcoming season. I'm sure the community will come together again.","replies":[{"poster":"Prandine","date":"2019-08-10T16:56:09.953+0000","up_votes":0,"down_votes":0,"body":"While Necromancy may be handy (and sometimes needed) in media, it is not the case for old forum threads. Please avoid using such magic and be mindful of how old threads are before posting.\n\nFeel free to contact us at the [Moderation Discord](https://discordapp.com/channels/230113905668653056/306220435262144512) or at [Discuss the Boards]( https://boards.na.leagueoflegends.com/en/c/community-moderation) for any questions, comments or concerns about this. Thank you and have a good day.","replies":[]},{"poster":"Prandine","date":"2017-11-05T14:03:20.654+0000","up_votes":61,"down_votes":34,"body":"From the [Tribunal FAQ](http://forums.na.leagueoflegends.com/board/showthread.php?t=2411284): \n\n>**Why can’t you give permanent banned players a second chance? You will receive a better player. **\nActually, this is the unfortunate problem. Allowing permanently banned players another chance is an extremely damaging cost. Do you know what the success rate of the Level 20 Challenge was? 5%. Do you know that for each person, they clearly outlined the toxic behaviors and had 1 on 1 conversations with the players to try to improve their behavior? These are players that were hand-picked by Player Support staff because they felt the pleas from these players were genuine. The success rate was still 5%. \n\n>Do you know how many games on average these players played? 100 games / month. When a permanently banned player fails to reform, they are creating miserable experiences for hundreds, maybe thousands of players a month. That's not a cheap cost or a low risk and we cannot consciously justify that, for the sake of the rest of our players.","replies":[{"poster":"Remex","date":"2017-11-05T22:23:39.316+0000","up_votes":33,"down_votes":6,"body":"yeah man this is 100% true i was toxic but when i did a new acc i becomed a good player gets from b5 to g5 in weeks then goes to stuck in plat but i started a new life why we never give mercy or give another chance .. {{champion:32}}","replies":[]},{"poster":"StayFwesh","date":"2017-11-10T05:33:53.330+0000","up_votes":24,"down_votes":1,"body":"Do you realize how easy it is to ban someone who plays 100 games a month? If they are at that level of toxicity, and they play 100 games a month which is about 3 games a day, they can easily be picked up by the tribunal system in a couple of days. Second, they picked the wrong peoeple for said test. They picked them based on their \"genuine pleas\" how about picking those who spent a lot of money and time and actually achieved a good rank, lets say plat or higher. These are the true players who value their accounts and time spent. Thirdly, @Prandine, we are human, not pieces of steel. We are flexible not always by-the-book. Maybe thats how you got the blue arbitur rank, but how about thinking about the community as a whole and not simply defending riot because that's how you became \"successful.\"","replies":[{"poster":"Prandine","date":"2017-11-10T06:42:31.200+0000","up_votes":5,"down_votes":11,"body":"> [{quoted}](name=JaxTheTrollx,realm=NA,application-id=ZGEFLEUQ,discussion-id=2bNAe0Ee,comment-id=00000008,timestamp=2017-11-10T05:33:53.330+0000)\n>\n> Do you realize how easy it is to ban someone who plays 100 games a month? If they are at that level of toxicity, and they play 100 games a month which is about 3 games a day, they can easily be picked up by the tribunal system in a couple of days.\n\nI participated in the Tribunal back in the day and it was far from perfect. One major issue was that we'd often get cases from months back. Couple that with the fact that it was slow to process cases. Was the Tribunal helpful during its time? Yes. Would it still work today? In the form it was before it shut down most likely not.\n\n>Second, they picked the wrong peoeple for said test. They picked them based on their \"genuine pleas\" how about picking those who spent a lot of money and time and actually achieved a good rank, lets say plat or higher. These are the true players who value their accounts and time spent.\n\nRank achieved and/or money spent do not always equal good behavior, and even back then those two did not exempt players from being held accountable for their behavior. If they truly valued their accounts and time spent then they wouldn't have consistently behaved poorly to the point where they lost their accounts, and then they wouldn't have had to go through the lv.20 challenge in the first place to try to redeem themselves. Even today people still try to use the \"but I spent money on the game\" excuse to justify their poor behavior to no avail, so that excuse didn't work back then and it certainly doesn't work now.\n\n>Thirdly, @Prandine, we are human, not pieces of steel. We are flexible not always by-the-book. Maybe thats how you got the blue arbitur rank, but how about thinking about the community as a whole and not simply defending riot because that's how you became \"successful.\"\n\nI'm aware that we're human, and even I have my moments where I get frustrated and angry with people I play with/against. However, I simply yell and rage at the screen instead of in the chat to vent my frustrations. If more people did that or simply chose different outlets outside of the game to vent their frustrations then chances are we'd have less people getting punished for poor behavior (or at least for chat-related behavior anyways).\n\nAs for my Arbiter title I got it by being knowledgeable about things player behavior related and helping out in that area for so long. It's certainly not for defending Riot 24/7 as I certainly don't agree with everything they do, such as removing Dominion as a permanent game mode, but that's a topic for another thread.","replies":[{"poster":"scazzman","date":"2017-11-11T00:18:45.254+0000","up_votes":8,"down_votes":4,"body":"> [{quoted}](name=Prandine,realm=NA,application-id=ZGEFLEUQ,discussion-id=2bNAe0Ee,comment-id=000000080000,timestamp=2017-11-10T06:42:31.200+0000)\n>\n> I participated in the Tribunal back in the day and it was far from perfect. One major issue was that we'd often get cases from months back. Couple that with the fact that it was slow to process cases. Was the Tribunal helpful during its time? Yes. Would it still work today? In the form it was before it shut down most likely not.\n> \n> Rank achieved and/or money spent do not always equal good behavior, and even back then those two did not exempt players from being held accountable for their behavior. If they truly valued their accounts and time spent then they wouldn't have consistently behaved poorly to the point where they lost their accounts, and then they wouldn't have had to go through the lv.20 challenge in the first place to try to redeem themselves. Even today people still try to use the \"but I spent money on the game\" excuse to justify their poor behavior to no avail, so that excuse didn't work back then and it certainly doesn't work now.\n> \n> I'm aware that we're human, and even I have my moments where I get frustrated and angry with people I play with/against. However, I simply yell and rage at the screen instead of in the chat to vent my frustrations. If more people did that or simply chose different outlets outside of the game to vent their frustrations then chances are we'd have less people getting punished for poor behavior (or at least for chat-related behavior anyways).\n> \n> As for my Arbiter title I got it by being knowledgeable about things player behavior related and helping out in that area for so long. It's certainly not for defending Riot 24/7 as I certainly don't agree with everything they do, such as removing Dominion as a permanent game mode, but that's a topic for another thread.\n\nim under the honest belief that the level 20 challenge was rigged to fail so that riot could say \"we tried that\" 2 main indicators of this are A. a simple \"you got reported\" warning. would be enough to make you fail, which by the way. even false reports could trigger. and B. the candidates were hand picked by riot. they claim they chose the ones most likely to succeed. but what if in fact they did the opposite? choose people who would screw up so they had a patsy?","replies":[{"poster":"TrulyBland","date":"2017-11-11T04:08:02.057+0000","up_votes":2,"down_votes":1,"body":"The simple \"you got reported\" warning (that admittedly could be triggered with false reports) didn't exist back then. Back then a warning was essentially the first punishment tier.\n\nAlso: What exactly would they gain from doing this? I mean, there's some effort involved in even setting up the system for the challenge... why put in even more effort just to invalidate the first bit of effort?\nThis conspiracy theory has the same flaw as the one that the moon landing was faked: If it had been faked, that would have actually required **more** effort (at the time).","replies":[{"poster":"scazzman","date":"2017-11-11T04:16:45.099+0000","up_votes":4,"down_votes":3,"body":"> [{quoted}](name=TrulyBland,realm=EUNE,application-id=ZGEFLEUQ,discussion-id=2bNAe0Ee,comment-id=00000008000000000000,timestamp=2017-11-11T04:08:02.057+0000)\n>\n> The simple &quot;you got reported&quot; warning (that admittedly could be triggered with false reports) didn&#x27;t exist back then. Back then a warning was essentially the first punishment tier.\n> \n> Also: What exactly would they gain from doing this? I mean, there&#x27;s some effort involved in even setting up the system for the challenge... why put in even more effort just to invalidate the first bit of effort?\n> This conspiracy theory has the same flaw as the one that the moon landing was faked: If it had been faked, that would have actually required **more** effort (at the time).\n\nsimple. they wanted them to fail so they could say \"they deserved it\" use them as justification for not allowing reformed players to have their old accounts back. and say \"we tried it with these guys but it didnt work\" as they pushed to replace the tribunal with an automated system in order to reduce human involvement","replies":[{"poster":"TrulyBland","date":"2017-11-11T04:46:17.609+0000","up_votes":1,"down_votes":2,"body":"So you are saying that they rigged the project so they can use the rigged project's outcome as a justification of **not** doing the thing that they already put more effort in than would be necessary if they hadn't decided to rig it?\n\nHow does that make sense? What would they actually have to gain from this resource wasting circular logic?\n\nI also fail to see how this has literally **anything** to do with the automated system, seeing as how an automated system **further** reduces the actual effort something like the level 20 challenge would require; provided that it actually worked.","replies":[{"poster":"scazzman","date":"2017-11-11T05:03:04.109+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=TrulyBland,realm=EUNE,application-id=ZGEFLEUQ,discussion-id=2bNAe0Ee,comment-id=0000000800000000000000000000,timestamp=2017-11-11T04:46:17.609+0000)\n>\n> So you are saying that they rigged the project so they can use the rigged project&#x27;s outcome as a justification of **not** doing the thing that they already put more effort in than would be necessary if they hadn&#x27;t decided to rig it?\n> \n> How does that make sense? What would they actually have to gain from this resource wasting circular logic?\n> \n> I also fail to see how this has literally **anything** to do with the automated system, seeing as how an automated system **further** reduces the actual effort something like the level 20 challenge would require; provided that it actually worked.\n\nit was a PR move. they wanted to make it look like they were giving them a second chance. while simultaneously using the players involved as a scapegoat to demonize permabanned players as \"the worst of the worst\"","replies":[{"poster":"TrulyBland","date":"2017-11-11T05:21:05.666+0000","up_votes":3,"down_votes":2,"body":"You're still not really giving any reasons that wouldn't also be applicable if they simply did the project properly.\nI'm not asking why they would do a rigged challenge in a frictionless vacuum, I'm asking for a direct comparison: Why rig the project, rather than just doing it properly?\nHaving a successful and non-rigged challenge would have required less effort, it would have been an even **better** PR move, and while they would have had fewer scapegoats, those scapegoats would make even finer scapegoats (only 0.06% of the community gets permabanned, only x% stay permabanned).\n\nSo once again and more clearly than I've asked before:\nWhat advantage does a rigged failed experiment have over an unrigged successful experiment?","replies":[{"poster":"scazzman","date":"2017-11-11T08:44:44.545+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=TrulyBland,realm=EUNE,application-id=ZGEFLEUQ,discussion-id=2bNAe0Ee,comment-id=000000080000000000000000000000000000,timestamp=2017-11-11T05:21:05.666+0000)\n>\n> You&#x27;re still not really giving any reasons that wouldn&#x27;t also be applicable if they simply did the project properly.\n> I&#x27;m not asking why they would do a rigged challenge in a frictionless vacuum, I&#x27;m asking for a direct comparison: Why rig the project, rather than just doing it properly?\n> Having a successful and non-rigged challenge would have required less effort, it would have been an even **better** PR move, and while they would have had fewer scapegoats, those scapegoats would make even finer scapegoats (only 0.06% of the community gets permabanned, only x% stay permabanned).\n> \n> So once again and more clearly than I&#x27;ve asked before:\n> What advantage does a rigged failed experiment have over an unrigged successful experiment?\n\nbecause them succeeding would imply that riot screwed up by permabanning them in the 1st place. and that a season long ban would have been more applicable","replies":[{"poster":"TrulyBland","date":"2017-11-11T09:45:02.250+0000","up_votes":4,"down_votes":1,"body":"First off: That's debatable. The threat of a permaban is a lot more real when you technically already had one.\n\nSecondly: It wouldn't imply Riot \"screwed up\" because it's Riot's and **only** Riot's decision how many chances they are willing to give people. There's nothing to screw up here, it's their decision. They have to draw the line somewhere, and they will always have to draw it before somebody is reformed (otherwise they'd never permaban anybody).\n\nBut most importantly: If a season long ban would have been more applicable, then why would Riot not want to do season long bans? Less permabans = Less customers lost.","replies":[]}]}]}]}]}]}]}]}]}]},{"poster":"DrCyanide","date":"2017-11-06T17:55:58.645+0000","up_votes":16,"down_votes":4,"body":"Lets not pretend that's an Apples to Apples comparison for today. The Level 20 challenge was at a time when it was significantly harder to earn a Permaban in the first place. The average permabanned player today would likely have received few hundred games of Chat Restrictions instead of a Permaban on the old system. Yes, the incentive to change was there, but the problems were much deeper rooted at the time of the challenge.\n\nThe Level 20 challenge needs to be redone, with players who are banned in the current system going through it. They can even raise the level cap to accommodate for the easier leveling that exists now, just to keep it fair. I'm confident that the success rate would be drastically better than 5%.\n\n----\n\nNow, OP, the worst punishment someone I personally know has ever received is a 10 game chat restriction. That covers a dozen or more players. It's not that hard to find better ways to vent your frustrations. I think some people wait too long before they try to change, waiting until they get a 14 day ban before trying to mend their ways. I think those players would be helped by 1 more tier of punishment between the 14 day ban and the Permaban. \n\nHowever, I absolutely disagree with the notion that *every* permabanned account should be unbanned. I'm on the fence about players who show reform getting back their account, but a unilateral unban would simply cause more harm than good.","replies":[{"poster":"CeleJo","date":"2017-11-09T08:50:48.525+0000","up_votes":10,"down_votes":1,"body":"we now speak of new season 7bans, all who was baned before with old reibunal system has quit game long ago or starten new acc with different atitude.i have tones of banned frineds they was mean and troll that was worthy ban,but now if u play alot games for example, couple of reports ruin u,if u get intu argument u get chat ban instant after game its bullshit cuz some ppl just look for it... and bam u banned u try write letters explain,and then u get nothimg even if ban wasnt rly worth it.u have to unserstand this new ban system is such crap","replies":[]}]},{"poster":"Endstationxx123","date":"2017-11-07T19:58:21.515+0000","up_votes":10,"down_votes":1,"body":"Yes...its really true ...i got perma ban in my account and i totally regret that so much...maybe its true to give another chance :D","replies":[]}]},{"poster":"Daddy Asura","date":"2017-11-06T06:34:22.550+0000","up_votes":19,"down_votes":0,"body":"I agree, I got banned a year ago permanently and I completely deserved it no excuses, I missed the game and I made a new account and it's been a while, I've reformed, getting lots of honors, climbed to D5 in less than 50wins.  And everything is going smooth, but still nothing can replace the first account, It has so many memories and it is truly different, I've reformed and I wish to get my old account back even if I was forbidden to use the chat\n\nI don't get the point of permanent ban, people still can make new accounts and continue the toxicity in league's community. That will not fix the problem. I know few people who got banned over 6 times, still make smurfs and destroys match making as unranked when they were in fact master/challenger and they still get banned. I think banning for 2-6 months or permanently locking the chat is enough to make a player reform rather than permanent.\n\nAnd I think if a player already reformed on a second account, why not give them  their old accounts a second chance? They've reformed anyways and they're still playing and they're still a part of the community, all of these take place but on another account, why not give their old accounts a second chance? Is it associated with being punished? Well there is no need for punishment if you've already reformed and begging for a second chance. And even if they've not reformed, they would never put the second chance to waste, speaking from experience I am certain of it. And if they do, then permanent ban is the way to go.\n\nAnd people who disagree, I know you disagree because of the amount of intentional feeding, afk and toxic teammates you get in your games, but trust me, if they get permanently banned Most of them will get back with other accounts. and mostly if they get a second chance they will never repeat this mistake again","replies":[]},{"poster":"themachamp","date":"2017-11-06T22:00:24.588+0000","up_votes":20,"down_votes":2,"body":"In response to the blue arbiters defending Riot:\n\nFirst off, getting permabanned now is far more punishing than getting permabanned 6-7 years ago. Back then it was nothing to make a new account and get back the mere 50-ish champions and still be able to get all of the exclusive and rare skins back. If you get banned today... then damn you have around 140 champions to unlock and you have lost all of your old content that will likely never come back( like riot singed, pax jax, ufo corki, etc) People have a lot more to lose today compared to back then. With the chance to get back lost \"treasures\" in a sense, that would encourage and promote continued reform.\n\nSecond....Riot and the arbiters love to bring up the level 20 challenge, but here is the problem. That program was flawed and doomed from the start on Riot's end more than anything else.  I mean they hand picked players to represent the community instead of having some sort of program or filter to chose the real best possible candidates. This is would be like having a manager hire someone because they like them, not because they are the best possible person for the job. Anytime a person(s) are hand picked for something then it immediately adds subjectivity to the experiment over objectivity. They delude themselves into thinking they have the best of the best for the program. Riot's  \"picks\" failed and Riot wrongly assumed that if their picks had such a poor performance then the community as a while would have poor a performance.   The other major problem was the sample size.....holy crap was it small.  There is no way a sample size that small should be able to represent the community as a whole. Especially now that league has grown to over 100 million players+.  To give people some perspective as to how small and unfair the sample size was(compared to today).... Imagine I flipped a penny 200,000 times but only chose 10 flips to represent the out come.  The 10 flips from my sample were 8 heads and 2 tails....I will now conclude from my sample that a penny will land on heads 80% of the time.  Now imagine riot decided to pick 10 people out of 200,000 permabanned players to represent them and prove reform is possible and determine if others will get a chance to get their accounts back.  9 out of 10 fail and riot declares a 90% fail rate and scraps the program. That is a rough example to show you how skewed the sample size was compared to the amount of players today. \n\nThird..this will go more on the conspiracy side of things but some people (myself included after reading all i could find on the level 20 challenge) think Riot actually wanted it to fail and chose the cream of the crap to represent the community in hopes that it would. This way Riot can always go \"sorry we tried\" whenever the topic of un-banning permabanned accounts comes up. They will also make more money when most ( hey, league is an addicting game) make new accounts and buy RP for boosts and to get back their favorite skins and champions that were lost.","replies":[{"poster":"ISuckWithThresh","date":"2017-12-20T17:28:29.927+0000","up_votes":7,"down_votes":0,"body":"You explained exactly my situation.\nI spent like 3 years or more on my account made over 1000 ranked games each season.\nI play normals rarely but considering I made 1000 games a season is pretty big number. I am pretty sure that everybody who plays that many games as I do will have these moments in which someone tilts him. I switched on my smurf account in EUNE and holy shit its damn impossible to earn BLUE ESSENCE. The other day I leveled up earning under 900 essence. To level up you need min 10 games which feels really unrewarding considering there are over 140 champions in the game. It will take you 4-6 levels (depends on the shards BE you get) to buy a 6300 champion. took me to get to level 35 to buy Lee Sin who is worth 4800.\n\nI really want to be able to use this account once again... Not only because I had all the champions or 50+ skins but also because I had my friend list pretty much full and I belive it or not I spent more time speaking with them each day than playing the game. I tried making another account in EUW but I don't earn enough to continue playing. But ever since I got the perma ban I haven't said a single word worth banning. I've been flamed many many times but for some reason this time I didn't flame back. I am actually trying to reform , I would do ANYTHING in order to get this account back.\nI love this game even tho Riot sometimes make terrible decisions I keep getting back to it. I tried quitting it multiple times (even after the perma ban) But I enjoy the competative part of the game so much even If I complain about it. Now I am mindlessly playing games on my smurf account ALONE, nobody to talk to. The game feels emptier.\nPeople say ''you don't appreciate things until you lose them'' for a reason. I don't think they will do something about the perma banned account but I will continue looking for a way to get it back.","replies":[]}]},{"poster":"Scary Door","date":"2017-11-16T15:25:02.902+0000","up_votes":14,"down_votes":0,"body":"This idea is brought up on a semi-regular basis, Riot has commented on it before.  \n\nSeveral years ago, Riot had such a program on an experimental basis whereby they gave permanently banned players one last chance on their account to reform.  The results were very easy to predict, An overwhelming majority of them were banned again within a matter of days or weeks or toxic behavior.  \n\nPersonally, I believe permanent bans are a waste of time in a free-to-play game where individuals can easily create or acquire new accounts.  A better solution to handle those that are perpetually toxic is an invisible, permanent mute.  The player doesn't know that they are muted, they can see their own chat, their friends can see their chat, but other players (not on their friends list) cannot see their chat, therefore they have no idea that they have been permamuted and thus the problem has been rectified.","replies":[]},{"poster":"KoksLoOby","date":"2017-11-06T13:08:26.130+0000","up_votes":17,"down_votes":4,"body":"Please riot give second chance to perma banned accounts .They will be carefully next time pls riot....{{summoner:13}}","replies":[]},{"poster":"Mìnd","date":"2017-11-06T02:13:05.851+0000","up_votes":10,"down_votes":1,"body":"Was personally banned for using \"cheats\" which I have miserably tried to prove wrong, but ended up getting the same auto-reply message, so there was literally 0 chances of me trying to get myself unbanned no matter how hard I tried to appeal the ban.\n\nIf Riot would give me just one chance to prove to them that I was a clean player, I'd be extremely thankful, but again, trying with them is useless as you'll always get the SAME message, no matter what you say.\n{{sticker:zombie-brand-clap}}","replies":[{"poster":"Reaver King","date":"2017-11-06T14:50:41.545+0000","up_votes":3,"down_votes":0,"body":"The exact same thing happened to me! They perma banned my account without so much as proof of my so called \"cheating\", and even though I appealed it for a month, I received\n the same message every time.","replies":[{"poster":"Mìnd","date":"2017-11-08T11:49:53.201+0000","up_votes":3,"down_votes":0,"body":"Really sad... hopefully something will be done to us. Really want to get back on my account.\n{{sticker:zombie-nunu-bummed}}","replies":[]}]}]},{"poster":"Fudanshii","date":"2017-12-01T10:18:03.877+0000","up_votes":8,"down_votes":0,"body":"I honestly put so many hours into league, hundreds, and i also put over a thousand dollars into my account. The way the system is is absolutely absurd, they never take the chatlog into consideration, only what you said. No context, no reading it in entirety from both ally and enemy teammates. I'm still devastated a year later that my account is gone. I loved league so much, to the extent in which I wanted to become a concept artist for the company some day and help create champions. \n\nI honestly believe the ban should be lifted for everyone in this upcoming new season, and those who truly are reformed will not have their accounts banned (because they will be following the rules and will not be reported, etc). To prevent anything bad happened in serious ranked games, give all of these previously perma-banned account a year suspension from ranked. This will weed out those who are actually trolls and just enjoy acting ridiculous (and it will happen in normal games, so there will be no true negative outcome for the teammates).\n\nThis will allow honest, truly reformed players to show Riot that they are reformed and are better players, and they will be able to pick off where they left off. I tried to make a new account, and it is basically impossible to get to where I was. There is a complete change in the system (IP merging with Essence), and it will take years for me (without spending the same amount of cash, nd even more just like i had on my previous account) to get the champions I had back, let alone all the skins.\n\nPlease take this into consideration, Riot.","replies":[{"poster":"ISuckWithThresh","date":"2017-12-20T18:12:18.449+0000","up_votes":7,"down_votes":0,"body":"I really do like your idea about the 1 year ranked ban. But I don't think riot give any fucks about the communiuty suggestions. They care about graphs and statistics or a way to make money out of something new they implement. By unbanning perma banned accounts with the 1 year rank ban would do no good for them . Insted they will spend their time on creating new emotes and chromas.","replies":[]}]},{"poster":"themachamp","date":"2017-11-06T12:23:12.433+0000","up_votes":9,"down_votes":1,"body":"I agree with the OP. The fact that Riot did a flawed program 6+ years ago doesn't mean that we should suffer and not be afforded opportunities today. Its akin to \" well 5 years ago your brother wrecked the car so we are not going to let you drive\".","replies":[]},{"poster":"TheUn4Given IV","date":"2017-11-06T17:21:36.169+0000","up_votes":10,"down_votes":2,"body":"That’s true bro i was plat2 and i get prema ban but i am really good now and i get diamond 4 after the ban so pls we really need another chance ❤️","replies":[]},{"poster":"Ahm9dGtx","date":"2017-11-06T16:11:02.251+0000","up_votes":8,"down_votes":1,"body":"i  have more than 100 skin in my old account perm banned.. now i play with new account and never bought  rp cuz i m affraid i got perm ban again and waste my money so i hope my account back .","replies":[]},{"poster":"Mooon147","date":"2017-11-06T16:56:35.764+0000","up_votes":9,"down_votes":2,"body":"There isn't a reason not to give everyone a chance. If you dont unban their old accounts, they can easily make new accounts and either be as toxic as before, or they are reformed and aren't toxic at all. If it is the former, there is no way to stop their cycle of making new accounts. If it is the latter, giving their old accounts back may act as an incentive to keep up the positive behaviour. Second, there are many players who were permabanned on the old system so it creates some sort of unfair scale. It is also much easier to get banned the longer you have played. As a league player since s2, pissing people off for 5 years and getting a couple reports per year is the same as a new toxic player being reported often in one season.. I believe riot should also \"reset\" punishment every season and not have it stacking for our entire \"account life\"","replies":[]},{"poster":"Valkγrie","date":"2018-02-11T14:13:15.395+0000","up_votes":7,"down_votes":1,"body":"Just gonna sneak in a little text here don't worry it's not a book just more than expected ;)\n\nIf you perma-banned a player for their bad behaviour, usualy the outcome of this will be negative anyways, because the player that got banned just starts to hate on you instead and therefore if they create another account, they are most likely going to do the same things again. Eventually.\n\nSome players are bad at reading the texts which includes, if it says, the next time you behave bad you get a perma-ban and players that get perma banned are usualy clueless of what it feels like to be permanently banned until its too late.\n\nQ: \"How hard could it be to read a small text... pfff, tragic\"\nA: \"everyone is not you ok? some people have diagnoses that can change performance in reading or they are just ignorant thralls ;)\"\n\nAfter a perma they can feel regretful as fast as they see the screen with the message \"Permanently banned\" even tho they had a 14 days suspension, they do not understand the meaning of perma and forget that they have to better themselves.\n\nAnd when it's too late they change their attitude instantly, fighting to get it back trying everything, making new accounts to prove that \"hey riot pls, I have become a better player!\" But what they want is usualy the account back and as a key to the lock you show your improvements and hopefully it can bring you what's behind the lock, but it doesn't and that can become frustrating... very very, frustrating.\n\nReason 1: \n\nThey spent money on the game, and at some cases, alot of money... which makes them Regret the time they spent/depressed about losing it all/feeling lost and angry, which leads us to Rage/hate against the game itself which makes their next account even worse than the first one, ( I know some friends that got perma-ban and they are even worse now) giving them the right to make new accounts can help, but lifting their main accounts ban can help more, the outcome of one more chance: Thankful/appreciation/happiness/motivation/liking.\n\nR: \"you only write this for your own fortune..\"\nA: \"trust me I do it for the better of the players and their attitudes, I want to help them see it from the side I do\"\n\nReason 2: \n\nWhen they make a new account they start from lower elo if they were high elo, and a toxic players behaviour wont really get better when they play trough all the elos while they are freshly perma-banned, alot of negative feelings and thoughts are corrupting their minds, the human brain is a big bundle of chaos sometimes, we know this and I understand how you think, the easiest way to get rid of someone is just to throw them aside.\nHowever looking away from poor people is also easy, pretend not to see them sitting there with their cups outside a store-entry, meaning: Ignoring the problem and how to help them.\nOfcourse it's your game and your published rules, but who said it can't change and who said a bad player can't become a good player, in either skill and behaviour.\n\nR: \"It's their own fault they can't find succsses in this world, you are on your own!\"\nA: \" Damn, how cold of you to think that? are we not supposed to help one another as a race? or do we still make differences between Black and white, good and evil, Lucifer and Jesus? pick a side?\"\n\nConclusion =\n\nBy giving the player a chance to enter their old account with all of their things: skins/pages/lvls etc.\nIt would encourage them to better their attitude, be a better player and appreciate your kindness.\n\n~Treat people they way you want to be treated yourself, with respect and understanding but also making sure that these players will get the message and reform in the best way possible~ \n\nQ: \"But you got perma-banned once how can you say 'treat people the way you want to be treated' when you didn't do it yourself?\"\nA: \"Because I have changed, and I'm lucky to be one of that kind.\"\n\nIt's not impossible, people can change some can't but the majority can, we are smart afterall and if we get a second chance we usualy don't mess it up the next time.\n\nquote: I do not appreciate bad behaviour, I used to be in a dark place in my early league days, but reformed and change my attitude beyond my imagination, only to prove riot wrong and I had an account from season 1 that i spent a hell lot money on and I wish nothing more than to get a chance to login in on it again. \nI collected skins and I bought alot of skins for my friends all the time, because they had no money. to be exact i had over 250+ skins and gifted 100+ skins  just to be nice and I just loved the skins alot.\n\nI know some of you guys will say: \n\nR: \"If you cared so much then why did you not improve your attitude earlier\"\nA: \"Because I had no idea what it was like to get the ban, seeing myself as an ignorant shit back then, and I regret it 100%\"\n\nR: \"give the accounts to the people that doesn't have any skins etc.\"\n\nA: \"Why? it's not like I was rich... I saved money every month to buy some skins, I went to school and studied the breath out of myself just to get that money... I worked hard for it and the past years I've worked on a regular job with regular people just like you, but I decided myself to save the money and buy skins, just becasue I have 300 skins doesn't mean I'm a rich spoiled brat? \"\n\nR: \"blame yourself, it's noone elses fault!\" \n\nA: \"I'm not stupid I know that it's my fault, but why does that have to mean I'm not allowed to regret it and show it, possibly redeem myself?\"\n\nAnd just because I got banned doesn't mean I can't reform and prove you wrong, because I already did!\n\nThanks for reading and have a wonderful day! love and cheers from - Grandma Diana!{{champion:131}}","replies":[]},{"poster":"GreatWhiteNorth","date":"2018-04-03T23:09:22.680+0000","up_votes":5,"down_votes":0,"body":"Nice try Tyler","replies":[]},{"poster":"Meowdyy","date":"2018-01-15T23:18:45.328+0000","up_votes":5,"down_votes":0,"body":"will Riot actually care about this post? i really hope so, i mean 4k people voted here..Riot come on {{sticker:sg-janna}}","replies":[]},{"poster":"Rekt Saii","date":"2017-12-16T17:21:38.984+0000","up_votes":5,"down_votes":0,"body":"I wish I could at least look at my accounts information, I have old friends on there who I'll never be able to contact again because I was toxic in a a couple games scattered across a year..","replies":[]},{"poster":"Igly170","date":"2017-12-11T12:18:40.466+0000","up_votes":5,"down_votes":0,"body":"I hope this will be true.. i really want my account back","replies":[]},{"poster":"Ichig0XKur0saki","date":"2018-06-30T21:08:42.519+0000","up_votes":6,"down_votes":1,"body":"The reporting system and the way people get punished in leageu is pure ****** and bulschit.\nAnd thats me being nice, youre system is fraude and faulty. Never seen this kind of reporting system even close in any other game its pure ******. I realy despice this game now for that system i love the game itself the community is pure ****** the most of them. And the reporting system is so fraude and faulty its schameful. Good job riot or i dont know who is in charge for this system u wil lose loads of players this way. GL HF <3","replies":[]},{"poster":"Gives It Hard","date":"2018-04-08T08:33:20.581+0000","up_votes":6,"down_votes":1,"body":"Another one of those cases where Rito doesn't look into false reporting or instigated \"toxicity\", i.e. a player silently trolling another in order to elicit a reportable response. Rito is just handing out bans like candy now for what should, at the most, only be chat restrictions. This new system is bunk and needs to be updated. Rito just lost a paying player. This company and its community has gone to the wayside.","replies":[]},{"poster":"RobertAIR","date":"2018-05-31T04:32:44.608+0000","up_votes":4,"down_votes":0,"body":"welcome, im RobertAIR my account was here perma banned, and to be honest, for being here toxic, and i show regret for my toxic talk at chat, im a human, and i didnt had easy in the last two months, in rael life i had true hell, and every other player that started some agresive talk, or to flame i did responded with my attack, riot, im sorry, and i will never again do this mistake, i have been playing here for almost 8 years, i lost not only my account, but also much money for skins, runes, you know riot points, My Wife did also received gifts from me, and also friends, riot, im truly sorry for being here toxic, and i ask for one last chance, when you unban me, i will never again show such toxic actions to the community, cuz my 8 years, are gone, i did also send to unban my account to riot support here in poland, no idea if they give me a chance, please riot, i only wish for one last chance, when i will be reported one more time after my unbanned account, then sure, ban it for ever, then you can show no mercy to my account and even delete it, i just ask for one last chance here","replies":[{"poster":"fifalegend","date":"2018-06-09T08:09:56.029+0000","up_votes":4,"down_votes":0,"body":"Same story here :/","replies":[]}]},{"poster":"kokoberi","date":"2018-04-14T13:54:04.178+0000","up_votes":4,"down_votes":0,"body":"just perma mute them and unlock them","replies":[{"poster":"SaverWest HD","date":"2018-04-27T11:13:27.397+0000","up_votes":4,"down_votes":0,"body":"^^^^^ much better solution. Might not even be perma mute but just a SEASON mute.","replies":[]}]},{"poster":"Naija Nightmare","date":"2018-03-04T20:45:45.811+0000","up_votes":4,"down_votes":0,"body":"The thing that truly sucks is that this game creates toxic players, and banning isnt much a cure as it is a palliative treatment. If you want less (btw less toxic not non cause its impossible) riot needs to implement changes to the game that truly enhance the player experience. When i start this game it was fun but after thousands of games of hundreds of unfair loses Im a toxic mess and its hard to feel any true remorse when you feel your toxicity is warranted any remorse felt after say a ban is purely just from additive nature of lol and wanting to play on your main account but toxic players will either just quit game not really getting rid of the flow of toxic players being created or the clever toxic players that find ways to finesse getting reported. The first actual step in the right direction riot made imo was the remake option. I lost tons of ranked games cause of afkers and it felt terrible to just have to accept that you werent going to get lp and riot wasnt going to do anything about it and at best you could get afker penalized but thats not what you truly care about its the lp (ps before someone says get good, ive won numerous 4v5's, but I shouldnt have to). There should be a non exploitable system in place where in the event  teammate trolls in game, starts inting, or being troublesome in the game something can be done about it in game, it should even be able to confer with enemy team to validate if your teams grievances are warranted as well as incentives for enemy team to tell truth cause as long as they will win there are some enemies that dont give a f what you were dealing with. \n\nI conclude Im a toxic player player who caught the toxic bug way back and it too late for me and tbh Id be super cool getting banned from this game cause its super frustrating at times, super addictive and super time consuming. But this is a plea to riot to change this, its too late for me but hundreds of new players get on league all the time and hundreds of active users are on all the time and get corrupted by the system they are made to deal with in lol. And although many apathetic ppl will be like well if you dont like it dont play, its about liking the game but not the bs the game comes with. I think although its a TEAM game updates should be made to reward individual performance. Win/Lose simply shouldnt be sole the marker of if you deserve to rank up or get demoted. I get its to promote better team play but alot of times low elo ranked games consist of one person getting fed or doing well and enabling or compensating for team so they can win, rarely have I had games where it was a good battle back and forth between the teams. Everyone will tell you no one gets upset during a satisfying game where both sides are playing their best and pulling their weight and difference in winning team fights is merely a good outplay. We are generally okay getting outplayed but the feeling of being cheated and robbed out of a fair game is what creates alot of the monsters on Lol.","replies":[]},{"poster":"krakch54","date":"2018-01-18T17:20:29.850+0000","up_votes":4,"down_votes":0,"body":"Plz let us a second chance","replies":[]},{"poster":"Hi Your Auntie","date":"2018-03-30T22:09:35.362+0000","up_votes":5,"down_votes":1,"body":"Riot won't care about our account. I got my ban 2 years ago. And they told me I have no second chance at all. It is great to see people are giving up LOL and start playing Fortnite now (Well, at least they care about us). Last weekend during the LCS playoff, people chose to watch Fortnite (not even tournament) > LOL (500k vs 200k). Young teenagers choose to play the popular games (Like Fortnite, PUBG or New games in future), and then Riot doesn't care about the people who still playing LOL or want to play LOL.","replies":[{"poster":"Prandine","date":"2018-03-30T22:38:48.326+0000","up_votes":1,"down_votes":8,"body":"> [{quoted}](name=Hi Your Auntie,realm=NA,application-id=ZGEFLEUQ,discussion-id=2bNAe0Ee,comment-id=0111,timestamp=2018-03-30T22:09:35.362+0000)\n>\n> Riot won&#x27;t care about our account. I got my ban 2 years ago. And they told me I have no second chance at all. It is great to see people are giving up LOL and start playing Fortnite now (Well, at least they care about us). Last weekend during the LCS playoff, people chose to watch Fortnite (not even tournament) &gt; LOL (500k vs 200k). Young teenagers choose to play the popular games (Like Fortnite, PUBG or New games in future), and then Riot doesn&#x27;t care about the people who still playing LOL or want to play LOL.\n\nOkay, so Fortnite got more views than the LCS quarterfinals (again, quarters, not semis, the 3rd place match or finals), what's your point? That has nothing to do with how Riot handles player behavior. As for your ban you most likely got at least 3 separate chances to improve your behavior and failed to do so. Riot doesn't unban accounts unless it was done in error, and while I don't know the specifics of your case if they're upholding the ban then most likely it was not done in error. Riot upholding their policy does not mean that they don't care: if anything it shows the opposite, that they care enough about their players to not lift bans not given in error just because a few disgruntled players can't accept or admit fault.","replies":[{"poster":"Hi Your Auntie","date":"2018-03-31T05:13:31.716+0000","up_votes":4,"down_votes":0,"body":"Look, in this post, people are looking for unbanning their account. Look at the how people reply to this post. (I saw most of the people said: I am sorry, please give me a second chance.) I don't play LOL anymore it's not because of the ban, and I don't expect RIOT to unban my account. I just want to let RIOT and everybody know few things: First, people regretted it and want to have a second chance. If RIOT says no, okay, people will decide to quit LOL (Imagine you lose all your skin, level, elo and TIME. Many people are not willing to start everything all over again). There are always other options in this world, LOL is not the only game. So basically, A. Not letting people to come back and be a good player. B. People are choosing other popular games like Fortnite. C. Losing population. Also, Prandine, I apologized if you think my comments are bad or not making any sense or just being hater. BUT I really hope LOL can keep their population and remain their popularity in the ESPORT field, no offense to RIOT or any other LOL players. :)","replies":[{"poster":"Prandine","date":"2018-03-31T12:57:13.543+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=Hi Your Auntie,realm=NA,application-id=ZGEFLEUQ,discussion-id=2bNAe0Ee,comment-id=011100000000,timestamp=2018-03-31T05:13:31.716+0000)\n>\n> Look, in this post, people are looking for unbanning their account. Look at the how people reply to this post. (I saw most of the people said: I am sorry, please give me a second chance.) I don&#x27;t play LOL anymore it&#x27;s not because of the ban, and I don&#x27;t expect RIOT to unban my account. I just want to let RIOT and everybody know few things: First, people regretted it and want to have a second chance. If RIOT says no, okay, people will decide to quit LOL (Imagine you lose all your skin, level, elo and TIME. Many people are not willing to start everything all over again). There are always other options in this world, LOL is not the only game. So basically, A. Not letting people to come back and be a good player. B. People are choosing other popular games like Fortnite. C. Losing population. Also, Prandine, I apologized if you think my comments are bad or not making any sense or just being hater. BUT I really hope LOL can keep their population and remain their popularity in the ESPORT field, no offense to RIOT or any other LOL players. :)\n\nI'm aware many are asking for another chance, but look at it from Riots point of view: they've already given the player multiple chances already to no avail, and if they give just anyone who asks another chance then what does that say about them as a company that tries to look out for its player-base? The line has to be drawn somewhere. While some players may genuinely be sorry for their actions and may in fact never have another punishment again if given the chance not everyone is like that sadly. Who's to say that some people asking for another chance are just claiming that they've reformed when they actually haven't? Riot's already been down that road before with the lv.20 challenge (which failed spectacularly btw) and it's not a chance they feel comfortable taking again, and given many of the forum posts I've read from banned players over the years I honestly don't blame them.\n\nPeople are still free to make a new account and prove that they've reformed on that one (which some people have actually managed to do btw), but their old accounts are gone forever, as there has to be some lasting reminder of the potential consequences for consistently poor behavior. I'm aware that not everyone is comfortable spending time or money again on another account and that's their decision to make. I'm also aware that there are other game options besides LoL, and if people prefer those games more over LoL then more power to them. Riots behavioral standards are not for everyone, and there are plenty of other games out there with less strict rules on player behavior (whether that's good or bad depends on your point of view).\n\nAs far as Esports are concerned that's a completely separate team from the Player Behavior team. You said and I quote: \n\n> It is great to see people are giving up LOL and start playing Fortnite now (Well, at least they care about us). Last weekend during the LCS playoff, people chose to watch Fortnite (not even tournament) > LOL (500k vs 200k). Young teenagers choose to play the popular games (Like Fortnite, PUBG or New games in future), and then Riot doesn't care about the people who still playing LOL or want to play LOL.\n\nWhat you didn't take into consideration was that the LCS match last weekend was for Quarterfinals, which that getting less views than say the Semifinals, the 3rd place match or even the Finals is to be expected. Also, whenever a new MOBA game comes out many people are quick to make the claim that it'll somehow be the \"LoL killer\", much how like many players were quick to make the claim that new MMOs would be the \"WoW killer\", neither of which ever ended up being true as both games still remain popular and played often by many players to this day. If Fortnite retains its popularity then good for them, but that doesn't necessarily mean that Riot won't care about its newcomer or veteran players if that does indeed happen.","replies":[{"poster":"Hi Your Auntie","date":"2018-03-31T23:12:13.079+0000","up_votes":4,"down_votes":0,"body":"Well, you got your point in Riots point of view. But I hope RIOT can look at from player's point of view. There's no 100% right or wrong in this world. As you said, RIOT is not gonna unban ANY ACCOUNTS. I mean if RIOT thinks this is the right way to do it, then no one can change their decision. Everybody knows the fact, LOL is losing players now (btw, semi-final views still lower than Fortnite and Fortnite doesn't have any tournament now, more streamers are switching to Fortnite now). As you can see, some veteran players still want to come back and play LOL IN THEIR OLD ACCOUNT. Just don't regret it until most of the people losing all the interest to play this game and RIOT start saying: We are going to unban all accounts, welcome back. No one will care anymore. This is just my point of view and again EVERYTHING I said here is just my suggestion to make this game better. If RIOT management really looks at this post for the past 5 months (or not), they should think about what to do with these Permanently banned accounts. Penalty or 1 year banned or 2 years banned maybe.","replies":[{"poster":"Prandine","date":"2018-04-01T00:54:51.289+0000","up_votes":0,"down_votes":2,"body":"> [{quoted}](name=Hi Your Auntie,realm=NA,application-id=ZGEFLEUQ,discussion-id=2bNAe0Ee,comment-id=01110000000000000000,timestamp=2018-03-31T23:12:13.079+0000)\n>\n> Well, you got your point in Riots point of view. But I hope RIOT can look at from player's point of view. There's no 100% right or wrong in this world. As you said, RIOT is not gonna unban ANY ACCOUNTS. I mean if RIOT thinks this is the right way to do it, then no one can change their decision.\n\nIf you ask me Riot is also looking at it from the players point of view as well, as if you remove a problem player from the game you make it less likely that the other players will be negatively impacted by that particular player. To quote [Kei143](https://boards.na.leagueoflegends.com/en/c/player-behavior-moderation/mmh6PidR-the-dreaded-downvoteers-in-this-discussion-board?comment=0001000100000000000100000004): \n\n>When Riot permabans someone, their philosophy is \"the chances of this guy reforming isn't a whole lot, we'd rather not have him in the game\". Thus in their eyes, they have already written off the toxic player as a paying client.\n\n>From a business standpoint, do they want to remove the toxic guy who has spent $500 but is causing a negative environment for 4-9 other players in every game? Those non-toxics are also spending $500 and probably will spend more, promote the game more when they are enjoying the game AND they won't cause a negative environment.\n\n>I personally think it is a fine argument to protect the ones that are paying money and aren't toxic rather than protecting the ones that may pay the same amount but are toxic.\n\nYes Riot can't stop people from making new accounts but the chronic misbehavers will eventually find that their newer accounts also punished as well if they continue to misbehave.\n\n>Everybody knows the fact, LOL is losing players now (btw, semi-final views still lower than Fortnite and Fortnite doesn't have any tournament now, more streamers are switching to Fortnite now).\n\nYou seem to think that \"esports viewership=total game popularity\" when that's not 100% true. While esports viewership can be used as a sign of games popularity you have to keep in mind that not everyone watches esports, so just because two separate games have different viewerships (which could be for a number of reasons including but not limited to time slots for live broadcasts and teams playing at that time) does not mean that that particular game is losing players.\n\n>As you can see, some veteran players still want to come back and play LOL IN THEIR OLD ACCOUNT. Just don't regret it until most of the people losing all the interest to play this game and RIOT start saying: We are going to unban all accounts, welcome back. No one will care anymore. This is just my point of view and again EVERYTHING I said here is just my suggestion to make this game better. If RIOT management really looks at this post for the past 5 months (or not), they should think about what to do with these Permanently banned accounts. Penalty or 1 year banned or 2 years banned maybe.\n\nNo, a 1 or 2 year ban does not accomplish Riot's goal of Reform. Besides, if a chat restriction and/or a 2-week ban isn't enough for someone to get the hint that ruining other peoples games with poor behavior is not tolerated here then what is? How many chances are you going to give someone before you finally realize that they'll never stop behaving poorly and need to be removed from the premises for good?\n\nI understand your concerns but again while some people do change and improve just like in real life the line has to be drawn somewhere, and if it's clear that no matter how many chances someone gets they'll always keep causing trouble then they just need to be removed from the game/community/establishment permanently.","replies":[{"poster":"Hi Your Auntie","date":"2018-04-01T04:58:28.477+0000","up_votes":3,"down_votes":0,"body":"As I said, it has no right or wrong answer for this. If RIOT thinks people will create a new account to start all over again and change their in-game behavior, then go for it. We have nothing to said. Looks like running a company has no democracy. If any people google search \"unban lol account\" and click to this post, I have to say sorry to you because you will not get what you ask for :)  Go create a new account, start all over again if you are still interested to play this game.","replies":[]}]}]}]}]}]}]},{"poster":"Sofıa","date":"2017-11-07T11:41:55.485+0000","up_votes":6,"down_votes":2,"body":"Yes please Riot, I really tried to stop being toxic, I can't play in any other account other than mine... give us another chance {{sticker:sg-soraka}}","replies":[]}]}