{"poster":"Hellioning","date":"2015-01-26T17:56:31.259+0000","title":"All this lore is cool and all...","subforum":"Story, Art, & Sound","up_votes":7,"down_votes":5,"body":"But Riot seems to have a problem with realizing how many times something should be said. Take Amumu's new video and the accompanying comic thing. That claims that 'Amumu is sad and wants friends.' His lores, both short and long, also say that 'Amumu is sad and wants friends'. 'Amumu is sad and wants friends' is also basically the message behind every one of his voice lines.\r\n\r\nLikewise, Kalista has a video, a short story, a brief lore, and her entire voice over to say 'Kalista is a spirit of vengeance.' \r\n\r\nI'm glad that Riot is giving us a bunch of lore, in many varied in different lores. I, personally, don't mind the large amount of text-only lore, but some people do, so I'm glad that they're giving us multiple media to consume the lore in. But did they expect us to only read/watch/enjoy on piece of media per champion? Do they need to spend that much effort on character establishment, instead of saving some of that for later development?","replies":[{"poster":"Narasimha","date":"2015-01-26T19:05:10.519+0000","up_votes":9,"down_votes":0,"body":"I don't think you understand how sad and friendless Amumu really is. You should go watch it a few more times to get the point through.","replies":[]},{"poster":"RoyaiChaos","date":"2015-01-26T19:07:13.326+0000","up_votes":7,"down_votes":0,"body":"Well now we can understand **WHY** he's sad and can't get friends.","replies":[{"poster":"Chromatic Eagle","date":"2015-01-26T23:21:57.642+0000","up_votes":1,"down_votes":0,"body":"This. I mean they could always be better at showing, but at least they didn't just tell us why he's alone.","replies":[]}]},{"poster":"Solideus","date":"2015-01-26T19:04:36.194+0000","up_votes":5,"down_votes":0,"body":"That is the case for any characters in a strong IP; just look at the kinds of stories batman tend to star in. They all boil down to different ways of telling the audience about the same character.\n\nWe'll get more development later on, but they are likely solidifying the groundwork for most champions before they start revisiting the cast. There are so many characters to get through, it's to be expected that they are prioritizing characters that need work with the basics rather than furthering the narrative for characters that are at a good place quality-wise. I believe they'll get there eventually though.","replies":[{"poster":"Hellioning","date":"2015-01-26T19:41:58.973+0000","up_votes":3,"down_votes":1,"body":"The difference with something like Batman is that each new story might be someone's first Batman story, so they have to explain how there was a little kid who loved his family very much and then they died and now he's angstry and dressing like a bat.\n\nLeague is the only place these characters exist; Amumu is one of the first characters in the game. I think everyone already gets that he's sad and also a mummy by now. I don't know why they're spending time making a music video about how sad and alone he is when they could be either focusing on the champions that are still in a weird place post-retcon or fleshing out older champions...like Amumu.","replies":[]}]},{"poster":"Sneak Dog","date":"2015-01-26T21:10:05.415+0000","up_votes":2,"down_votes":0,"body":"These videos aren't in-depth lore, the diary was that. These videos are more 'shallow' characterisation.","replies":[]},{"poster":"Chromatic Eagle","date":"2015-01-26T23:24:13.195+0000","up_votes":1,"down_votes":0,"body":"To be fair, his story only showed why he can't touch people. The video shows why he shouldn't even be allowed near any living being. Those tantrums.","replies":[]},{"poster":"Revan Sulli","date":"2015-01-26T18:20:53.657+0000","up_votes":1,"down_votes":0,"body":"Bump","replies":[]},{"poster":"Silents429","date":"2015-01-26T19:38:56.982+0000","up_votes":2,"down_votes":3,"body":"Can you not make a click bait thread? So I can downvote it without having to click it.","replies":[]}]}