{"poster":"MMM DELICIOSO ","date":"2017-07-27T01:26:19.693+0000","title":"Es mentira que las skins no dan ventajas en el juego! gg pay to win LoL","subforum":"Charlas Generales","up_votes":3,"down_votes":20,"body":"Como las habilidades cambian al tener otra skin, ciertas skins de color claro tambi&eacute;n les cambian las habilidades a ese color. Y uno que esta acostumbrado a dodgdear cualquier habilidad como Faker al ser de un color casi intangible el skillshot tiene muchas m&aacute;s probabilidades de que te pegue. Eso es una clara ventaja de tener dinero en este juego. Maldito pay to win.\n\nLee Sin GodFist tiene una Q que es muy transparente, no tiene una gran animaci&oacute;n por lo cual tampoco uno se puede avivar de que la tiro. \n\nLa skin definitiva de Lux es igual, habilidades muy transparentes casi imposible de visualizar. gg shiot y sus roturas","replies":[{"poster":"FacuUzumaki","date":"2017-07-27T02:05:17.588+0000","up_votes":4,"down_votes":0,"body":"tambien es malo para los que no tienen, ya que algunos se confian y creen ser buenos por tener skins y son malisimos(sin intencion de onfender)","replies":[]},{"poster":"Dyaebl","date":"2017-07-27T01:28:16.015+0000","up_votes":4,"down_votes":0,"body":"Vos no sos daltonico, no sabes lo que es jugar contra una lux elementalista... bueno... supongo que era elementalista porque nunca vi 1 ** skill","replies":[{"poster":"MMM DELICIOSO ","date":"2017-07-27T01:28:51.985+0000","up_votes":1,"down_votes":4,"body":"Es cualquiera, la ventaja que dan las skins de ese calibre es muy alta.","replies":[{"poster":"Cris300","date":"2017-07-27T02:41:22.816+0000","up_votes":2,"down_votes":0,"body":"men, no es un pay to win, es la habilidad de una persona con ese campeon, yo solo utilizo las skins cuando se jugar con X campeon, aunque habeces las skins tienen un poco de ventaja, hace un tiempo una skin de yasuo tenia un fallo (no se cual) y tiraba basicos o habilidades mas basicos pero eso se arregla, tambien hay parches donde X campeones estan fuertes y otros no, asi que no confundas una cosa con otra","replies":[{"poster":"MMM DELICIOSO ","date":"2017-07-27T03:10:18.277+0000","up_votes":1,"down_votes":1,"body":"No hablamos de habilidad, no hablamos de campeones más fuertes que otros, hablamos de skins que tienen ventaja al tener habilidad/skillshots que son simplemente difíciles de detectar. Y en un juego de este calibre se nota la diferencia. Solo eso.","replies":[{"poster":"LightDagger","date":"2017-07-28T06:24:10.371+0000","up_votes":1,"down_votes":0,"body":"Mejora tu habilidad visual. Lol no es pay to win","replies":[]}]}]}]}]},{"poster":"Grosero","date":"2017-07-27T02:20:45.664+0000","up_votes":3,"down_votes":0,"body":"Yo encuentro que las habilidades de Lux elementalista son un asco en ese sentido, demasiado claras y a veces, teniendo tantas luces y efectos entre medio, ni se alcanzan a ver","replies":[]},{"poster":"Dustbin","date":"2017-07-27T01:31:13.422+0000","up_votes":3,"down_votes":0,"body":"Y el gancho de IBlitzcrank??? se van a la mierda","replies":[]},{"poster":"Hnk Kenshiro","date":"2017-07-27T01:30:20.561+0000","up_votes":2,"down_votes":0,"body":"Es sabido, hay skin bloqueadas para torneos de hecho.\n\nPersonalmente es más molesto las que cambian el tamaño del campeón, por ejemplo renek tierra calcinada, es una miniatura de renek.","replies":[{"poster":"MMM DELICIOSO ","date":"2017-07-27T01:48:50.053+0000","up_votes":1,"down_votes":1,"body":"tremendo pay to win kenshiro espero que no tengas skins de ese tipo porque se me cae un idolo","replies":[]}]},{"poster":"KzG Arconte","date":"2017-07-29T07:37:44.628+0000","up_votes":1,"down_votes":0,"body":"Lo que si me parece extraño es el de la skillshot de lux... despues del parche 7.13 te roza y te estunea... he visto repeticiones y enviado tickets a soporte y me dicen que lo tomaran en cuenta con un copiar y pegar incluido. pero siguen sin corregirlo... ( les he enviado vídeos y replays) la cuestion es que solo me sucede des ves en cuando, si lo intento en personalizada no ocurre nada... ( no se si lo habran solucionado así en secreto o algo asi ya...)","replies":[{"poster":"MMM DELICIOSO ","date":"2017-07-29T17:47:59.696+0000","up_votes":1,"down_votes":0,"body":"Me acaba de pasar en una Normal. Me tiro una Q una Lux con Skin definitiva no me rozo pero paso cerca obviamente y es como si me hubiera pegado igual.","replies":[]}]},{"poster":"Kerpłunk","date":"2017-07-27T05:03:49.043+0000","up_votes":1,"down_votes":3,"body":"bueno,si fueras bueno jugando no necesitas ser un \"pay to win\" ya que con cajas podes desbloquear muchos skin como yo :)\nno gaste un solo peso desde que juego y tengo mas de 30 skins todas obtenidas de cajitas.\nasi que tu argumento de \"pay to win\" es invalido.","replies":[{"poster":"LightDagger","date":"2017-07-28T06:27:01.978+0000","up_votes":1,"down_votes":0,"body":"Bueno lo de cajas es suerte, a mí me tocan puros campeones o skins de jg, y jg no es mi fuerte xD","replies":[{"poster":"Kerpłunk","date":"2017-07-28T19:18:20.373+0000","up_votes":1,"down_votes":0,"body":"no es suerte...solo hay que terminar con un buen score,hacer objetivos,farm,etc...yo al principio solo maineaba mid y desde que salieron las cajas y me largaron skins aprendi a mainear todas las lineas,en algunas soy peor que otras pero me defiendo en todas ellas","replies":[{"poster":"LightDagger","date":"2017-07-29T05:44:13.147+0000","up_votes":1,"down_votes":0,"body":"Me refería al contenido de las cajas, la ultima skin que me salió fue de hecarim, de eso hará 2 o 3 meses. El resto puros fragmentos de campeones.","replies":[{"poster":"Kerpłunk","date":"2017-07-29T07:19:09.237+0000","up_votes":1,"down_votes":0,"body":"bueno,eso si xD a mi al principio me tocaban puros fragmentos de campeones,pero despues ya no,solo skins y centinelas,gemas,cosas asi..incluso una vez me tocaron 5 gemas seguidas..es decir,me toco una gema y la forje en una caja y llave,en esa misama caja me toco otra gema entonces hice lo mismo y en esa caja otra gema mas y asi hasta 5 veces xD esa vez saque 2 skins en menos de 1 minuto jaja","replies":[{"poster":"LightDagger","date":"2017-07-29T07:33:19.418+0000","up_votes":1,"down_votes":0,"body":"Sos de los míos jaja las gemas para cajas\n\nCreo que me quejaré más contigo, y creo que maineare esto ahora xD http://prntscr.com/g1sdpx","replies":[{"poster":"Kerpłunk","date":"2017-07-29T15:37:20.680+0000","up_votes":1,"down_votes":0,"body":"jajajaja a mi me toco la de cho'gath jurasico y aprendi a mainearlo solo por la skin xD\nquien no aprendio a mainear un champ solo para usar una skin? xDD","replies":[]}]}]}]}]}]}]},{"poster":"Columpio","date":"2017-07-27T11:06:32.685+0000","up_votes":1,"down_votes":0,"body":"Se pusieron a pensar que faker no usa skin? Y es uno de los mejores del mundo. La ventaja esta en las manos.","replies":[]},{"poster":"Koijhy","date":"2017-07-27T06:40:55.626+0000","up_votes":1,"down_votes":0,"body":"encontre un skin que basicamente te da aviso si hay enemigos invis o alguien en un pasto ( fue parcheada mucho tiempo después)\n\nla animacion de corrida de zombie brand cambia cuando hay un enemigo cerca, por ende si el enemigo esta en un pasto ( donde no hay ward) o incluso un enemigo invisible este cambia su forma de caminar indicando que hay alguien ahi\n\nhttps://www.youtube.com/watch?v=WL4h2DfOn74","replies":[]},{"poster":"Krew i Wino","date":"2017-07-27T04:41:07.621+0000","up_votes":1,"down_votes":0,"body":"eso pasaba con la fate del inframundo en la s3 creo o s4 no se veia su q y te sacaba un cuarto de vida :v","replies":[]},{"poster":"Sir Crucifix ll","date":"2017-07-27T03:26:25.494+0000","up_votes":1,"down_votes":0,"body":"si da ventaja , no es lo mismo usar una lux asi nomas que una elementalista , corki no es lo mismo el clasico que el de la nave arcade , kayle comun no es la misma que la de alas E, ezreal lo mismo .. te ayudan bastante","replies":[]},{"poster":"Koijhy","date":"2017-07-27T03:11:46.925+0000","up_votes":1,"down_votes":0,"body":"por algo hay skins banearas de los matchs profesionales, como i-blitz, claramente dan una ventaja\nincluso hay otros como el de zigg veraniego, su q llega mas lejos\nla q de  ezreal pulsefire es mas rapida etc, \n\npone Skins That Buff Your Champion en youtube y miralos\n\nhttps://www.youtube.com/watch?v=8a8f-x89QPI\n\nhttps://www.youtube.com/watch?v=pc-Wd3jIM7k","replies":[{"poster":"MMM DELICIOSO ","date":"2017-07-27T03:13:15.353+0000","up_votes":1,"down_votes":5,"body":"No entiendo, la mayoría me da la razón (cosa que tengo) pero tengo negativos. gg comunidad de bronces","replies":[{"poster":"Koijhy","date":"2017-07-27T03:19:59.638+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=MMM DELICIOSO ,realm=LAS,application-id=v7qsfXsE,discussion-id=sdYAxdOi,comment-id=00050000,timestamp=2017-07-27T03:13:15.353+0000)\n>\n> No entiendo, la mayoría me da la razón (cosa que tengo) pero tengo negativos. gg comunidad de bronces\n\nni te fijes en los negativos, no importan realmente\n\n-el tema de las skins con buff tecnicos es sabido por Rito pero como no tienen un impacto a nivel profesional no les interesa.\n cientos de veces me han quitado daño con skills que ni me rosaron solo porque la animacion del skin es mas pequeña que la hitbox del standart","replies":[]}]}]},{"poster":"Yitán","date":"2017-07-27T04:14:36.761+0000","up_votes":1,"down_votes":2,"body":"lloran por cada cosa ¯\\_(ツ)_/¯","replies":[]}]}