{"poster":"MMM DELICIOSO ","date":"2017-07-28T01:05:14.842+0000","title":"Solución: Como parar un Nasus feed si tenes un potus de adc","subforum":"Guias y consejos","up_votes":5,"down_votes":4,"body":"No podes. Nasus feed es broken.","replies":[{"poster":"Xeport","date":"2017-07-28T01:22:05.933+0000","up_votes":2,"down_votes":0,"body":".-. oc {{champion:33}}","replies":[]},{"poster":"rokushoger","date":"2017-07-31T14:05:02.254+0000","up_votes":1,"down_votes":0,"body":"Mantenten lejos, pokea, ve como muere miserablemente sin llegar nunca a rango.","replies":[{"poster":"MMM DELICIOSO ","date":"2017-07-31T23:53:05.072+0000","up_votes":1,"down_votes":0,"body":"Si sos melee y luchador? Y tené en cuenta el título que para algo está.","replies":[{"poster":"rokushoger","date":"2017-08-01T10:49:07.023+0000","up_votes":1,"down_votes":0,"body":"Hay otros campeones en tu team además de ti y del adc. Seguramente haya un mago adelante.\nAdemás nasus necesita un juego temprano tranquilo para stackear su Q, si lo dejaste crecer, entonces además del adc que no puede pararlo en ese momento, la culpa es del top que lo dejó crecer. Bajo esas dos circunstancias es justo que nasus sea imparable no?","replies":[{"poster":"MMM DELICIOSO ","date":"2017-08-01T19:17:29.893+0000","up_votes":1,"down_votes":0,"body":"Tranquilo? Es imposible que Nasus no stackee su Q al menos que vos como top también te quedes en tu línea como un potus denegandole farm. Que un champ te obligue a permanecer en tu línea y a ser tremendamente vulnerable a ganks enemigos porque para denegar farm tenes que estar adelante de tus minions. \n\nNo hay chance de que Nasus no este OverPowered. Como dice el título si tenes un adc que se quedo atrás no lo bajas con nada.","replies":[{"poster":"rokushoger","date":"2017-08-02T11:25:08.788+0000","up_votes":1,"down_votes":0,"body":"Nasus no tiene un early fuerte, a menos que vayas con campeones sin sustain, melee, y de poco daño (en cuyo caso es tu culpa, porque el sería \"tu counter\").\nSi le vas haciendo trades y no lo dejas farmear, no solo no va a subir su Q, sino que va a tener que volver a base para que no lo mates, y ahí aprovechas a roamear a otras lineas.\nAdemás como te dije, parar un Nasus no es solo tu trabajo, porque lógicamente no te vas a quedar afk en top, para algo hay un jungla, un mid, un support y un adc. Aunque el adc sea malo, hay otras tres personas.","replies":[]}]}]}]}]},{"poster":"MuffinElZangano","date":"2017-07-28T01:24:32.995+0000","up_votes":1,"down_votes":0,"body":":'v","replies":[]},{"poster":"TermidorAsd","date":"2017-07-28T01:37:51.893+0000","up_votes":1,"down_votes":2,"body":"Sos lvl 10 que esperas?... te van a emparejar con gente de ese nivel que todavia ni sabe jugar al igual que vos.\n\nEn esos lvls van a decir que yi y soraka estan rotos...","replies":[]}]}