{"poster":"Cpt Pants","date":"2015-02-06T19:41:41.319+0000","title":"[Champion Concept] Miscela - The Chameleon","subforum":"Concepts & Creations","up_votes":38,"down_votes":7,"body":"**Miscela - The Chameleon**\n\nhttp://i.imgur.com/l08wTWb.png?1\n\nA few notes:\n- Miscela means \"Blend\" in Italian.\n- Miscela is female.\n- Miscela is designed to be played as the player chooses, AD or AP.\n- Miscela's ultimate has a few case by case situations that need explaining, for example Shyvana ultimate.\n- Miscela - The Chameleon is an attempt to completely break the rules of the game on how a champion works and should work - but still remaining balanced and playable on both sides. If it fails to do so, I would love to hear why.\n- I here by allow Riot to use some, or all of the ideas in this concept, without any compensation.\n\n\n\n**Passive: Battle Chameleon**\n\n- Basic attack range: 125\n- Every third basic attack Miscela gains + 125 range for that basic attack (250 total).\n- Additionally, her basic attack will deal an additiona 15% Total AD + (0.4 AP) magic damage.\n\n**Q: Tongue Slap / Prey Grab**\n\nPassive: *Hitting an enemy with Tongue Slap / Prey Grab restores 2% + (2% per 100 ap) of maximum hp.*\nUnblended - Tongue Slap: *Miscela launches her long and sticky tongue to a target destination, damaging the first enemy hit for physical damage and slowing them.* \nBlended - Prey Grab: *Reveals Miscela and after a short delay Miscela launches her long sticky tongue in a line, stunning and pulling the first enemy hit and dealing magic damage.*\n\n- Tongue Slap damage: 60/90/120/150/180 + (0.6 Total AD) + (0.7 AP) magical damage.\n- Tongue Slap slow: 30%.\n- Tongue Slap cooldown: 8/7/6/5/4 seconds.\n- Prey Grab damage: 60/90/120/150/180 + (0.6 Total AD) + (0.7 AP) magical damage.\n- Pull speed = Miscela's movement speed. Miscela cannot move during the ability.\n- Prey Grab cooldown: 14 seconds.\n- Prey Grab stun duration: 0.75 - 1.5 seconds, depending how far the target is, max stun duration is reached at 75% of skillshot range.\n- Tongue Slap / Prey Grab range: 1000~\n\n**W: Blend / Unblend**\n\n*Miscela blends with her surroundings and becomes stealthed after 1 second. While stealthed Miscela gains new abilities, increased vision range and is slowed by 25% while stealthed.*\n\n- Vision increase works on low walls (edges of the river for example).\n- Maximum Blend duration: 4 Seconds.\n- Cooldown: 12/11/10/9/8 Seconds (starts after Miscela becomes unblended).\n- Miscela's first auto attack after blend will apply Battle Chameleon.\n\n**E: Bite & Punch / Sticky Leash**\n\nUnblended - Bite & Punch: *Miscela's next basic attack hits twice for physical and magical damage per hit.*\nThe first hit being a bite (physical) and the second a punch (magical). The punch briefly knocks back a miniscule distance.\nBlended - Sticky Leash: *Miscela reveals herself and launches her sticky tongue on a targeted enemy, then dashes towards him*\n\n- Bite & Punch damage: 50%/65%/60%/65%/70% Total AD + (0.35 AP), two hits, one physical one magical (maximum of 140% AD + 0.7 AP Hybrid damage).\n- Bite & Punch cooldown: 8/7.5/7/6.5/6 seconds.\n- Sticky Leash damage: 50/75/100/125/150 + (0.5 Total AD) + (0.7 AP) magical damage. Damage is applied when the tongue connects with the enemy.\n- Sticky Leash cooldown: once per blend (8 seconds).\n\n\n**R: Mimicking the Surrounding**\n\n*Miscela can choose a target champion on the enemy team and mimic one of their abilities. Miscela cannot mimic another ability until the cooldown is over. Mimicking the Surrounding has a set minimum cooldown or as the enemy ability - higher one of the two. After using the ability and the cooldown finishes, Miscela needs to select an ability again.*\n\n- Choosing an enemy opens an evolution like selection bar for choosing an ability.\n- After the ability has been used and the cooldown finishes, Miscela has to select an ability to mimic again. It can be the previous ability.\n- Cooldown: 90/75/60 seconds or as enemy ability - the higher of the two.\n- Range (choosing a mimic target): 2500\n- Damage: Instant burst (single and AoE) / single target DoT abilities deal a total of 200/300/400 + (0.5 Total AD) + (0.6 AP) damage.\n- AoE DoT effects deal 400/600/800 + (1 Total AD) + (1.2 AP).\n- Multiple part abilities will deal a total of 200/300/400 + (0.5 Total AD) + (0.6 AP).\n- Possible infinite abilites will deal 30/55/80 + (0.15 Total AD) + (0.2 AP).\n- If the original ability applies a form of hard crowd control, the damage is reduced by the following formula: X / Y = Damage (X is ability damage by kind of ability (see above), Y is duration of cc). Damage cannot be amplified by this formula.\n- Miscela CAN NOT mimic an ability that provides a mimic (LeBlanc/Herself) / shape shifts / passives.\n\n**Change List:**\n\n- Removed root from Branch Hugging. (Thanks to MojoBronzeClub)\n- Passive now deals magic damage instead of true damage. (Thanks to qetzel)\n- Blend duration is now 4 seconds from 8 seconds. (Thanks to qetzel)\n- Added a negative multiplier to the ultimate damage if the ability has a form of hard crowd control. (Thanks to qetzel)\n- Reduced basic attack range to 125 from 175 (400 range with passive).\n- Prey Grab stun duration changed to 0.75 - 1.5 seconds depending on distance traveled from flat 1.5 seconds. (thanks to Google This)\n- Adjusted numbers on a few abilities, overall reduction in damage.\n- Changed Tongue Slap / Prey Grab passive values to provide less health with more consistent numbers. (Thanks to Arcane Flux)\n- Changed Tongue Slap damage to magical.\n- Added approximate range on Tongue Slap / Prey Grab. (Thanks to Levan)\n(17/06/2016) Revisited\n- Lowered the range on empowered basic attack - 250 max.\n- Renamed Branch Hugging to Sticky Leash.\n\nPicture taken from Google image search.\n\nWould love to hear your feedback!","replies":[{"poster":"HyenDryGG","date":"2015-02-06T19:46:07.187+0000","up_votes":2,"down_votes":0,"body":"Very interesting concept, but I'm going to leave this up to the professionals =]","replies":[{"poster":"Cpt Pants","date":"2015-02-06T19:48:58.616+0000","up_votes":5,"down_votes":0,"body":"You don't have to be a professional to say what you like, what you don't like, and what you think can be different to be better :)","replies":[]}]},{"poster":"TheKingDodo","date":"2015-02-07T05:48:01.273+0000","up_votes":3,"down_votes":0,"body":"Gromp's sexy sister","replies":[{"poster":"Cpt Pants","date":"2015-02-07T08:11:45.718+0000","up_votes":1,"down_votes":0,"body":"You made me lol good sir.","replies":[]}]},{"poster":"Dbl U","date":"2015-02-07T00:06:05.756+0000","up_votes":3,"down_votes":0,"body":"First off, Love the creativity. A chameleon of all things. Outstanding.\n\nNow for the problems.\nThe stun duration on the pull is a tad too long. You're taking away the shine that supports like blitz and thresh have. \nPlus she has a gap closer. This is just... outrageous. She's basically a {{champion:89}} and {{champion:53}} . Fix it.{{summoner:11}} \n\nHow? That's for you to decide.\n\nSuggestion. Make the pull work similar to {{champion:44}}  stun. The farther away the more rewarding. You just landed a skill shot, great job. The stun duration should be lessened like I said above but only to closer champions. well Both. 1.25 far is my recommendation. You can alter the other part yourself.\n\nThe ult. Dear god that ult. First problem. You can CHOOSE it? That's a tad horrifying. Plus with your idea you did not mention what would happen when the \"ult\" comes off cool down. The ult should only copy one of the last two abilities used. Take out the other \"factors\" because that's just absurd. I'm sorry it really is. Make it do the same amount of damage based on Miscela's stats. (Reduced ratios though, 0.1 less or something, because we don't want to see 2 lasers shooting down a line. This ult seems really broken though. Considering she can copy more pulls. Blitz's Thresh's Hers...){{champion:53}} {{champion:412}} \n\nMy suggestions aren't the best. But hey. They're something! So is this concept. Great job European!\n\n\nEdit:No need to follow everything word for word. Just ideas to add to your idea. Suggestions.","replies":[{"poster":"Cpt Pants","date":"2015-02-07T00:23:49.690+0000","up_votes":1,"down_votes":0,"body":"First of, thank you for the big reply.\n\nPull: I like your thinking. I will consider changing the pull to have a longer stun the further the target is.\n\nUltimate: The idea is that after you used the ability and it comes of cooldown, you choose again. I still think she should be able to choose based on an entire enemy kit, and not just last abilities used. I want to try and balance around that, and not nerf it.\n\nThank you very much!","replies":[]}]},{"poster":"DarthPancake","date":"2015-02-07T05:23:16.610+0000","up_votes":2,"down_votes":0,"body":"Yes. All my yes.","replies":[]},{"poster":"SpiceIsRight","date":"2015-02-06T22:50:05.362+0000","up_votes":2,"down_votes":0,"body":"Interesting concept:\n\nPassive- Right now this is a sort of laning-only passive. It might make sense and broaden its utility if you made each auto in succession gain some distance then every third does the bonus damage? \n\nW: I'd recommend that her other abilities while blended simply don't have a cooldown (aside from ultimate) because she can only be blended for 4 seconds anyway (so when blending, cd on Q/E are reset). This is especially true to avoid micromanagement of separate cooldowns. It wouldn't be fun to blend only to realize your Q is on cooldown and won't be usable until after you're unblended. I also appreciate that there is a movement slow alongside the stealth! This is both thematic and a way other stealthed units should be balanced.\n\nR- I can appreciate the mimic style ultimate but want to make a quick suggestion. For players of Miscela, trying to figure out which category of spell mimicked meets what criteria for damage is too much of a hassle and too time consuming in the fray of battle. I'd suggest making it actually mimic how the ability works. Some might say this is \"OP,\" but  you have already severely made each choice matter. Do I steal a Fizz troll pole to escape, or do I say screw it and grab the Malphite's ult to turn the tide and sacrifice myself at the benefit of setting up a Yasuo ult? Both would have the same cooldown. If you desired to make it a little less harsh, abilities with under 25 seconds CD (base cooldown) could place the Ult on a flat 25 seconds (not reduced by CDR). \n\nIf you'd like to share the love, maybe comment and vote on my champion [here](http://boards.na.leagueoflegends.com/en/c/skin-champion-concepts/UtEoA1ud-a-champion-is-revealed-dreaming-of-red-reply). I know you've already commented once, but the kit has come a long way since first posted. I think you may like the changes.","replies":[{"poster":"Cpt Pants","date":"2015-02-07T00:33:07.434+0000","up_votes":1,"down_votes":0,"body":"Another long post! God I love these :D\n\nPassive: Her unblended Q slows. It allows her to keep the enemy close to fight him. Her base kit revolves around auto attacking that one guy to death. Her ultimate is what makes her more special by giving her a choise of going more teamfight or single target (based on the enemy team).\n\nW: Blended Q threath is immense. It can't be up everytime she stealths. It has to have a meaningful cooldown. Unblended E has a low enough cooldown already, so is blended E. So they should always be up when blended.\n\nR: The ability is not designed to be used in the fray of the battle (though it can be). Shortcuts work on her ultimate the same way they work on Kha'Zix'es evolution and Viktor's evolution (CTRL+Q/W/E/R) the tricky part is with shape shifters, but it shouldn't be used in a fight anyway to choose - hence the 2500 range. Plus, it has a minimum cooldown of 60 seconds (reduced by cdr) or as high as the enemy cooldown (reduced by cdr). The higher cooldown of the two will be selected. So it does have a meaningful cooldown as well.\n\nI will check your champion tomorrow. It is 2:30 AM currently and I need the sleep :)\n\nThanks for the good comment. Even though I disagree it helps me look at the kit in different eyes, which helps me make decision about it. Appriciate it!","replies":[]}]},{"poster":"Flintfall","date":"2015-02-06T20:13:08.403+0000","up_votes":1,"down_votes":0,"body":"Your Q title has Pray Grab instead of Prey Grab :P","replies":[{"poster":"Cpt Pants","date":"2015-02-06T20:17:03.294+0000","up_votes":2,"down_votes":1,"body":"My bad lol\n\nFixed.\n\nImagine a praying holy chameleon though...","replies":[{"poster":"Flintfall","date":"2015-02-06T20:26:23.276+0000","up_votes":1,"down_votes":0,"body":"Haha!\n\nI like this concept, nice work :)\n\nEDIT: If I had to change one thing though, make Prey Grab fling Miscela to the enemy instead of making it like a Blitz hook, that way you can also set up your melee attacks (Outside of Branch hug).\n\nFor ranges make Prey Grab longer, but less reliable, while Branch Hug can be a shorter dash (or maybe have her fly to a wall?)","replies":[{"poster":"Cpt Pants","date":"2015-02-06T20:29:13.242+0000","up_votes":1,"down_votes":0,"body":"Throw in an upvote then? :D","replies":[{"poster":"Flintfall","date":"2015-02-06T20:31:06.997+0000","up_votes":1,"down_votes":0,"body":"Already have :P\n\n######sorry for the edits","replies":[{"poster":"Cpt Pants","date":"2015-02-06T20:53:28.758+0000","up_votes":2,"down_votes":0,"body":"Prey grab is intended to be a slow pull to close the gap / fast pull to pick off an enemy. I don't think making it a mobility spell is the way to go...\nAlso, it functions much more like a skarner ult than a blitz grab. Plus it has counterplay - dodge, and cleanse / crucible / tenacity.\n\nI'm in process of changing branch hug into a different ability. Wanna help me think of anything?\nThe current root version is problematic due to a choice between a pull or a root - sacrificing one feels bad. Also, the kit is really strong as is. It can be replaced to something weaker too.","replies":[{"poster":"Flintfall","date":"2015-02-06T20:59:41.664+0000","up_votes":1,"down_votes":0,"body":"What would be cool is that Branch Hugging could be re-cast if he hits a wall. Have her enter a state where she sticks to the wall, and can re-cast the ability again. Have this repeat each time she hits a wall, and you have interesting jungle mobility.\n\nPrey grab is a bit hard to be unique thematically, maybe have it drag the enemy back to her (a bit) slowly as a channel, and the enemy can still use abilities while in that effect (gap closers could possibly make them escape the effects).\n\nObviously these aren't perfect solutions, but we can springboard off them. I think they bring interesting cc and help to make the kit a bit less binary.\n\nEDIT: proper gender connotations ","replies":[{"poster":"Cpt Pants","date":"2015-02-06T21:04:10.480+0000","up_votes":1,"down_votes":0,"body":"I don't think a high range melee champion that has range deserves high mobility, even in very certain situations...\n\nYour prey grab suggestion is interesting but just pushed the enemy to go mobile - IM SICK OF THIS META haha.\n\nE blended should be something that an ap champion can use to deal damage and an ad champion can use for utility. Any ideas?","replies":[{"poster":"Flintfall","date":"2015-02-06T21:12:56.368+0000","up_votes":1,"down_votes":0,"body":"Let's think from the stealth perspective instead then. The Q allows for a pull grab, that's engagement. We could make her slippery, and make the E a non-targeted dash, keeping the same engagement possibilities, but make it more unreliable.\n\nAnother option is to remove the dash, but keep the effects, forcing a decision to engage with Q or walk up to them and E (with reduced mobility).","replies":[{"poster":"Cpt Pants","date":"2015-02-06T21:28:06.883+0000","up_votes":1,"down_votes":0,"body":"Again, mobility is too much for this kind of kit.\nShe can't have free mobility...","replies":[{"poster":"Flintfall","date":"2015-02-06T21:42:45.645+0000","up_votes":1,"down_votes":0,"body":"We could go with the second option then, remove the dash but keep the root and magic damage.","replies":[{"poster":"Cpt Pants","date":"2015-02-06T21:45:25.417+0000","up_votes":2,"down_votes":0,"body":"I just chose to make it a targeted dash that deals damage.\n\nA chameleon is not encouraged to go into the enemy, especially when she's slowed. It feels out of place.\n\nA targeted dash does not provide free mobility, and fits with wanting to hit the enemy for the passive procs. :)","replies":[{"poster":"Flintfall","date":"2015-02-06T21:49:04.897+0000","up_votes":1,"down_votes":0,"body":"Ah, that makes sense.\n\n","replies":[]}]}]}]}]}]}]}]}]}]}]},{"poster":"Colonel Lapoose","date":"2015-04-29T05:17:36.462+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Cpt Pants,realm=EUW,application-id=A8FQeEA8,discussion-id=EZY7EBtG,comment-id=00010000,timestamp=2015-02-06T20:17:03.294+0000)\n>\n> My bad lol\n> \n> Fixed.\n> \n> Imagine a praying holy chameleon though...\n\nPraying holy chameleon! There is her first skin. :D","replies":[{"poster":"Cpt Pants","date":"2015-05-01T06:00:51.910+0000","up_votes":1,"down_votes":0,"body":"Her Idle animation would be sitting on her back legs and her front ones would be held together like (open palm style).\nAnd she would have that circle above her head.\n\nHaha, made me chukle.","replies":[]}]}]}]},{"poster":"SpiceIsRight","date":"2015-02-09T17:58:13.386+0000","up_votes":2,"down_votes":1,"body":"That's a very valid point! It could be a great champion for learning if you can get past initial frustration from a few missed ults :) good point.","replies":[]},{"poster":"Sontran118","date":"2015-02-08T17:32:04.993+0000","up_votes":2,"down_votes":1,"body":"Ok...RIOT I THINK YOU NEED A NEW MEMBER!!!\n+1","replies":[{"poster":"Cpt Pants","date":"2015-02-08T18:26:46.122+0000","up_votes":1,"down_votes":0,"body":"Thank you for the kind words :)\n\nI'd love to work there if I ever get the chance, I doubt a singe champion concept and kit will do, but in actuallity from another champ I designed a year ago Rek'Sai has two abilities haha, burrows (used to be portals) and 3 auto attack.\n\nLink: http://boards.na.leagueoflegends.com/en/c/skin-champion-concepts/MPfFX1HG-champion-suggestion-avasha-the-master-of-the-morgon-relics-including-kit-and-lore","replies":[]}]},{"poster":"qetzel","date":"2015-02-06T21:12:36.977+0000","up_votes":2,"down_votes":1,"body":"I would say... The passive is nice, but reminds me too much of Diana. True damage may be a little bit much though.\n\nI would also say that your AP playstyle is the same as the AD playstyle. This means that only one will be played - whichever one turns out to be better. There is no real choice. What you need to do is to emphasize the importance of Auto Attacks if you want to play her as an AD champion (See Katarina - she has both ratios, but it is the same play. AP is chosen almost all the time).\n\nOn the ultimate, why did you choose to change the damage based on the type of ability rather than the actual ability. I understand it could be easier to code, but CC abilities become massive with this (most CC abilities have a trade-off in damage).\n\nI like the blend idea though, particularly the self slow. Chameleon's are supposed to lie in wait, ambush their prey, so this is good. It also limits the abilities otherwise incredible power. Perhaps a greater slow or a shorter duration would be better though. It wouldn't make much sense for a Chameleon with a speed boost (e.g. from Lulu) to run into the middle of the enemy team.\n\nMy final question is \"Why would I ever want to pick this champion?\". What does she bring to the table? What is her nieche. What teams does she work well with>If she can just be played in any game without thoughts like this, it causes problems (See Thresh as an example).\n\n\nOverall, a good idea. It needs some design tweaks and professional balance tweaks though.","replies":[{"poster":"Cpt Pants","date":"2015-02-06T21:27:44.307+0000","up_votes":1,"down_votes":0,"body":"Thank you for the thought out replay.\nI will adress your points in the order you represented them:\n\nPassive: I chose true damage to make it easy to understand that the damage will be applied regardless of which build patch you chose.\nUnder a closer look I think it would be better as magic damage.\n\nPlaystyle: I understand what you are saying, and at the same time I think it's fine, but in a different execution.\nI think the player can choose which way to play her in order to fill a role for the team.\n\nUltimate: Good point. I'll add a negative multiplier, CC abilities have their damage cut by length of CC.\nFor example a 1.5 CC would result in X / 1.5 = damage (x being the original base damage of the ultimate)\n\nBlend: I will take a closer look at the duration. Though I believe it's about balance in that point, which is hard to do without actual palytests...\n\nWhy play Miscela: I find that she fills a bruiser - pick off role, that also brings interesting gameplay and makes the enemy team think twice which champions they take - since one of their abilities at one point of the game can be her's.","replies":[{"poster":"qetzel","date":"2015-02-06T21:46:24.515+0000","up_votes":1,"down_votes":0,"body":"Good answers. Thank you.","replies":[{"poster":"Cpt Pants","date":"2015-02-06T21:47:41.190+0000","up_votes":1,"down_votes":0,"body":"No. \nThank YOU!\n\n:)","replies":[]}]}]}]},{"poster":"MrFluffyPuffy","date":"2016-08-28T08:24:16.629+0000","up_votes":1,"down_votes":0,"body":"The concept and the kit is very solid. But you need to think again about the ultimate. It won´t work, because many animations wouldn´t fit to the model, for example Garen´s Q/E/R. Also it makes the champion to much dependent on the enemy team. Despite this I don´t see much trouble in this kit.","replies":[]},{"poster":"Cpt Pants","date":"2016-06-17T20:06:21.668+0000","up_votes":1,"down_votes":0,"body":"Bump.\nIt's been over a year, wanna see what people think today.","replies":[]},{"poster":"Tamur","date":"2015-02-08T23:48:46.288+0000","up_votes":1,"down_votes":1,"body":"Really nice kit \n\nThese are the items that I would use {{item:3078}} {{item:3146}} {{item:3089}}  {{item:3031}} {{item:3124}}  & finish it off with either {{item:3101}}, {{item:3072}} or some form tank item.\n\nUpvote #26","replies":[{"poster":"Cpt Pants","date":"2015-02-09T17:38:44.584+0000","up_votes":1,"down_votes":1,"body":"What about survivability? Remember you are melee :)\n\nI think for ad:\n{{item:3266}} {{item:3153}} {{item:3078}} {{item:3083}} {{item:3110}} {{item:3143}}  / {{item:3035}}  / {{item:3102}} \n\nAnd ap:\n{{item:3266}} {{item:3027}} {{item:3089}} {{item:3115}} {{item:3135}} {{item:3157}}  / {{item:3026}}\n\nThanks for the nice words and upvote! :)","replies":[{"poster":"Tamur","date":"2015-02-09T19:35:59.554+0000","up_votes":1,"down_votes":0,"body":"Those are nice too\n\nHow about \n{{item:3265}} {{item:3141}} {{item:3041}} {{item:3105}} {{item:3031}} {{item:3089}}?\n\nTake look at one of mine\n\nhttp://boards.na.leagueoflegends.com/en/c/skin-champion-concepts/Iybn7OHF-adan-the-devoted-defender\n\nhttp://boards.na.leagueoflegends.com/en/c/skin-champion-concepts/tj5hOfm0-zimn-the-wuju-demon\n\nhttp://boards.na.leagueoflegends.com/en/c/skin-champion-concepts/fG4ulwei-xcedros-the-deadly-blade-of-zuan","replies":[]}]}]},{"poster":"SpiceIsRight","date":"2015-02-08T17:28:51.048+0000","up_votes":1,"down_votes":0,"body":"What about for those champions you aren't familiar with? Guess I'm thinking from more of a tl:dr perspective during the heat of battle. But I suppose it's already one's own fault for not knowing the other's champ abilities by heart too though.","replies":[{"poster":"Cpt Pants","date":"2015-02-09T17:40:00.814+0000","up_votes":1,"down_votes":0,"body":"That's why you have a description for each skill + by looking at the enemy you can understand how each skill works (after reading).","replies":[]}]},{"poster":"SpiceIsRight","date":"2015-02-07T22:20:17.268+0000","up_votes":1,"down_votes":0,"body":"Thanks again for the help!\n\nLooking over the current kit of Miscela I really only see small tweaks since you've already discussed why you didn't want to change from other suggestions (which all made sense):\n\n1. Tongue Slap: Heal might be a little strong for AP builds. At 70% health and let's say an average mid-game AP of 400 AP, that's 1+(9)*3 = 28% Max Health recovery. This is huge considering the cooldown is 4 seconds (no CDR accounted for) and no itemizing boosts. Either a nerf to scaling is probably in order or maybe no scaling aside from 1% increasing for every X% missing health?\n\n2. Ultimate- Needs some clarification numbers (i.e. how long does the mimic DoT last? same as enemy champs duration or a set amount?)\n\n3. Ultimate- Quality of life for ultimate.... When the ultimate brings up the evolution panel, rather than show the enemy abilities, what if the game already has each champion ability given a designated Icon and Color to match the mimic damage you've suggested. So for instance, mimicking an Ezreal Q (Mystic Shot) would show a Red Arrow. The red stands for burst damage, and the arrow stands for ranged ability. Thus from icon alone you recognize the ultimate will produce a ranged, burst damage ability without clutter of it having to exactly match a mystic shot while also setting a standard for defining which abilities fit which damage type?\n\n\nI also did and didn't make a few changes on my champion:\n\nDidn't:\n\n1. Didn't alter Q, I think the damage reduction is necessary (not worth nerfing standard Q to earn a vamp off of consecutive casts, damage from using the ability with no CD is worth it in my book).\n2. Didn't alter E either, but I understand your concerns. It's meant to mostly be escape/farming tool anyway. Though it makes the ability linear, I think the mechanic is too fun to back down on. \n\nDid:\n\n*R- wasn't impervious to flashes etc... (from note section) and 3 seconds is less than Jarv's at 3.5\n\n1. Opted to go the auto-attack route realizing some damage is better than none. As it stands, it's likely that the barrier will have a minimum of 2 autos (because the standard scenario outside a quick escape use is 1 for both Maverick and a designated target) to be shot off in the reduced time of 2.5 seconds. It seems a bit steep, but considering those champions outside the barrier can attack it too, it seems like a decent balance? It's a tough thing, the key I was going for here was to offer a destructible ultimate. Also, this requires a minimum attack speed of >1.0 to break earlier and seems more than enough of a distraction from attacking Mavrik.\n2. Changed passive to damage reduction of enemy champs inside because damage boosters (R.I.P. DFG) seem to be out of the picture.","replies":[{"poster":"Cpt Pants","date":"2015-02-08T17:22:26.868+0000","up_votes":1,"down_votes":0,"body":"1. You are right, it is waaaay to high. Nerfing it.\n2. Same duration as mimiced ability.\n3. Nope. It's more clear IMO to show the ability icon and a description of what it will do.","replies":[]}]},{"poster":"MochaShakes64","date":"2015-02-07T20:00:13.243+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Cpt Pants","date":"2015-02-07T20:01:46.073+0000","up_votes":1,"down_votes":0,"body":"Why do you think that? Please elaborate :)","replies":[{"poster":"MochaShakes64","date":"2015-02-07T20:06:39.538+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Cpt Pants","date":"2015-02-07T20:09:24.539+0000","up_votes":1,"down_votes":0,"body":"It has a 2500 range exactly for that reason, so you don't choose it in the middle of the fight.\nAnd your point brought it to my attention, I did not made it clear which damage type the ability will be doing.\nI'm considering either magic or same as mimicked ability. Leaning towards mimicked ability.\n\n Your thoughts?\n\nP.S. Thanks :D","replies":[{"poster":"MochaShakes64","date":"2015-02-07T20:14:14.052+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Cpt Pants","date":"2015-02-07T20:18:43.273+0000","up_votes":1,"down_votes":0,"body":"I don't think taking the damage of the enemy would be a good idea.\nWhat if your team is winning? Why would you want a weak ability?\nPlus, the idea is that it doesn't matter which character or ability you take, it has to have reliable damage (if it is a damaging ability).\n\nThe ultimate probably needs nerfs, but I still think it should have it's own damage.","replies":[{"poster":"MochaShakes64","date":"2015-02-07T20:25:01.575+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Cpt Pants","date":"2015-02-07T20:26:33.200+0000","up_votes":1,"down_votes":0,"body":"I don't have a rioter comment, but here's hoping!\n\nAdd me in the launched I'll see what I can do about your champ...\n\nCpt Pants","replies":[{"poster":"MochaShakes64","date":"2015-02-07T20:30:06.148+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Cpt Pants","date":"2015-02-07T20:33:24.121+0000","up_votes":1,"down_votes":0,"body":"Oh whoops, I meant add me to friends in the game and now I noticed we are on different servers...\n\nComment here tomorrow and I will try to help you. Deal?","replies":[]}]}]}]}]}]}]}]}]}]}]}