{"poster":"SoloQ Adventure","date":"2015-02-24T22:51:46.782+0000","title":"Matchmaking Im Ranked","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":0,"body":"Also es ist volgender maßen:\r\nIn Season 4 habe ich es bis Platin V geschafft, wo ich auch stolz drauf bin. Jetzt habe ich meine Placement-matches abgeschlossen mit glaube 7 W und 3 L. Riot hat mir die Liga Gold I zugeteilt womit ich komplett zufrieden bin. Ich sagte mir es könnte schlimmer kommen und ich fing an mich hochzuspielen. nach ein bisschen Zeit habe ich es geschafft 83 Punkte zu holen und war nun fast am Ziel, wieder in Platin zu kommen. Ab dann ging es los. Die Gegner waren echt gute Spieler, wo man wirklich einer Herausvorderung entgegenstand. Es hat superviel spaß gemacht sich mit ihnen zu messen. Meistens gehe ich in die Mitte. Dort räume ich zu 80% immer ab und denke mir:\"So, den habe ich aus dem Spiel geholt\". im Mid-game wurde aus dem Gegnerischen Mid-Laner von 1/5 plötzlich ein 9/5. Kaum war die laning Phase vorbei, Fingen meine Partner an zu feeden, zu flamen, manchmal gab es AFK (away from keyboard). Wir haben in Grunde das Game im Kasten gehabt, nur hat mein Team IMMER nach oder auch manchmal während der Laning-phase nur gefeedet,geflamet etc. ich habe nun 13 Punkte in Gold I. ich Verliere nurnoch !! Eigentlich wollte ich diese Season sogar weiterkommen, aber der Traum verschwindet immer mehr, je mehr Rankeds ich Spiele und auch immer verliere. Von 6 Rankeds nun habe ich 1 gutes Team bekommen. Ich weiß nicht warum es so unbalanced ist, aber ich  würde mich freuen, wenn das Matchmaking mal überarbeitet wird.\r\n\r\nHier mal ein Beispiel was ich unter Troll/Flame verstehe:   \r\nIch habe Karthus in der Mitte gewählt, habe die Lane auch halten können und hatte SEHR mit Mana zu kämpfen. Ich habe den Jungler gefragt ob ich den Blue-Buff haben dürfte. Seine Antwort war: \"NO MY JUNGLE MY BUFFS! WHEN YOU STEAL ME 1 MONSTER I GO AFK\". Er hat sich den Blue genommen und jetzt kommt das Verwunderliche: Der Jungler war ein Rek'Sai der ja SOOOO viele Manaprobleme hat.\r\nAlso Riot. Wenn ihr wollt, dass das Ranked spielen mehr Spaß macht, dann ÄNDERT das Matchmaking. Bitte. Ich weiß wie es aufgebaut ist, aber irgendwie scheint es so dass es seinen Zweck nicht erfüllt. Ich Fühle mich in Gold I wie in Bronze III.\r\n\r\nLG                   Mr Lekwin\r\n\r\nWer noch so weit kommen will, muss mit dem ersten Schritt anfangen. -mr lekwin","replies":[{"poster":"SoloQ Adventure","date":"2015-02-27T15:38:15.177+0000","up_votes":1,"down_votes":0,"body":"Schön zu sehen, dass ich nicht der einzige bin :) und das mit Rek'Sai war schon etwas her. Danke für die Unterstützung und ihr hattet Recht. Ich war ein bisschen angepisst. Ist bei mir so, wenn ich in einer looseserie feststecke. nochmal danke","replies":[]},{"poster":"Phyrax","date":"2015-02-25T05:35:35.509+0000","up_votes":1,"down_votes":0,"body":"> Ich weiß nicht warum es so unbalanced ist, aber ich würde mich freuen, wenn das Matchmaking mal überarbeitet wird.\n\nWas hat das Matchmaking damit zutun, dass du schlechte Spieler/Flamer/AFKler in deinem Team hast? Sie hätten genauso gut im gegnerischen Team landen können, es ist nicht so das solche Leute eine eigene MMR-Gruppe zugewiesen haben und dann unfair auf beide Teams aufgeteilt werden...","replies":[{"poster":"Iron IV dude","date":"2015-02-25T11:02:26.021+0000","up_votes":1,"down_votes":0,"body":"Naja, seit Rito mit der Überarbeitung des Matchmakings für S5 durch ist, habe ich das Gefühl seeeehr viel mehr Idioten anzutreffen als sonst (Egal ob im gegnerischem Team oder im eigenem)\nIn S2-S4 gab es nur sehr selten ein Match das von anfang an einseitig war, aber jetzt?\nEs ist auch vollkommen egal wie gut man Spielt oder was man macht.\nIm Jungle rettest du dem ADC den Arsch, währen Mid und Top so derbe feedet, dass man dort keinen Fuß mehr hinsetzen darf.\nBist du Top geht alles schief bevor du überhaupt lvl 5 bist.\nAls Support kannste sowieso nicht allzu viel machen (wirst sowieso nur zu geflamed wieso nur 4 Wards auf der Map sind *sigh*)\nUnd als ADC kommst du dann erst an wenn das spiel schon 5/2000 steht.\n\nOder es ist genau andersrum und du kannst deine Lane so hard verlieren wie du willst, und gewinnst trotzdem.\nVon 150 Games hatte ich vielleicht 5-10 wo ich sagen kann \"wow, bis zum letztem TF spannend und ausgeglichen gewesen\" bei allen anderen war nach 10 Minuten meist eine Tendenz zu erkennen und ab 25 schon entschieden.\n\nLiegt vielleicht an den ganzen Assassinen derzeit.","replies":[]}]},{"poster":"MeMyselfandBaal","date":"2015-02-25T01:51:23.308+0000","up_votes":1,"down_votes":0,"body":"hmm... machst du wegen jedem Idioten gleich eine Thread auf... Und ja, die RekSai könnte einfach ein Idiot gewesen sein... aber so was kommt halt vor... und da muss man sich dann halt auch mal drauf einstellen... und es gibt nirgends ein von Riot geschriebenes Gesetz, dass besagt, dass der Jungler die Buffs auf seine Mitspieler verteilen muss... es wird zwar im Allgemeinen als das Effektivste angesehen, ist deswegen aber noch lange kein Gesetz... \n\nOh und den Unterschied zwischen RekSai und Jarvan IV, Fizz und KhaZix sollte man auch mal lernen... bei deinen letzten 3 Niederlagen war jedenfalls keine RekSai in deinem Team... Und wenn Fizz dir den Bluebuff nicht gibt um mit seiner Ulti mehr Plays zu machen, ist das ne ganz andere Aussage als wenn das ne RekSai sagen würde... ich sag's ja nur... Vielleicht regst du dich gerade auch nur ein bisschen zu sehr auf, weil du in einer Niederlagenserie steckst... das kommt vor...","replies":[{"poster":"Hi im ar0Xx","date":"2015-02-25T09:52:07.543+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=MeMyselfandBaal,realm=EUW,application-id=ip27PlEH,discussion-id=dyixcoT0,comment-id=0000,timestamp=2015-02-25T01:51:23.308+0000)\n>\n> hmm... machst du wegen jedem Idioten gleich eine Thread auf... Und ja, die RekSai könnte einfach ein Idiot gewesen sein... aber so was kommt halt vor... und da muss man sich dann halt auch mal drauf einstellen... und es gibt nirgends ein von Riot geschriebenes Gesetz, dass besagt, dass der Jungler die Buffs auf seine Mitspieler verteilen muss... es wird zwar im Allgemeinen als das Effektivste angesehen, ist deswegen aber noch lange kein Gesetz... \n> \n> Oh und den Unterschied zwischen RekSai und Jarvan IV, Fizz und KhaZix sollte man auch mal lernen... bei deinen letzten 3 Niederlagen war jedenfalls keine RekSai in deinem Team... Und wenn Fizz dir den Bluebuff nicht gibt um mit seiner Ulti mehr Plays zu machen, ist das ne ganz andere Aussage als wenn das ne RekSai sagen würde... ich sag's ja nur... Vielleicht regst du dich gerade auch nur ein bisschen zu sehr auf, weil du in einer Niederlagenserie steckst... das kommt vor...\n\nNaja natürlich kommt es vor, dass man ne Niederlagenserie hat, oft ist es allerdings so, dass die Teams nicht ausgeglichen sind. Entweder man wird richtig weggestompt oder man stompt richtig weg. Selten ist es so, dass ein Match nur knapp entschieden wird. Ich finde viele Leute einfach zu Toxisch. (vll liegt es am Alter) \n\nIch verliere lieber n Game, wo es vll durch einen blöden Teamfight entschieden wurde, als n Match wo einer AFK war oder ähnliches.","replies":[]}]},{"poster":"Zebrafliege","date":"2015-02-25T08:01:18.065+0000","up_votes":1,"down_votes":0,"body":"Mach dir keinen Kopf ich hab das gleiche Pech im Moment war letzte season plat 2 ohne irgendwelche Probleme und jetzt in plat 5 so eine kranke Pech Serie ich Krieg nur auf die Nase egal was ich spiele wo ich spiele wie ich spiele 3 oder 4 Leute feeden:D oder wenn man  mal als Team ahead kommt spielen alle yolo die hard und man verliert es noch","replies":[]}]}