{"poster":"Gabvy2018","date":"2017-03-22T14:41:54.875+0000","title":"Parche 7.6 -  Tenés algun problema ? Postealo acá!","subforum":"Problemas Técnicos","embed":{"description":"Saludos, invocadores. Bienvenidos a la versión 7.6, en la que se ven los resultados del entrenamiento de Galio y comienza a saltar de un lado a otro del mapa. Esta vez vamos a tomarlo con mucha calma, pero eso no implica que no tengamos cambios.","url":"http://las.leagueoflegends.com/es/news/game-updates/patch/notas-de-la-version-76","image":"http://las.leagueoflegends.com/sites/default/files/styles/wide_medium/public/upload/patchnotes_2017header.jpg?itok=kGznRpFA"},"up_votes":10,"down_votes":1,"body":"Bueno como saben desde hoy est&aacute; el parche 7.6 corriendo en nuestro servidor. \n\nLes pido por favor como siempre, si todos los errores que vean los pueden ir reportando ac&aacute;. \n\nSi bien no contesto cada uno de los mensajes no se desesperen, la idea es poder obtener la informaci&oacute;n y lograr un foro que se ayude mutuamente tambi&eacute;n. La mejor forma de ayudar a resolver los problemas es lo siguiente:\n- Que bajes el Herramienta de reparaci&oacute;n hextech del siguiente [link](https://s3-us-west-2.amazonaws.com/player-support/tools/Hextech%20Repair%20Tool.msi)\n- Recopiles los registros de tu juego usando la Herramienta de reparaci&oacute;n hextech. \n\t Para recopilar los registros, las siguientes opciones deben estar activas antes de presionar el bot&oacute;n Iniciar. \n\t\tEl resto puedes desactivarlas excepto las que ya estan marcadas por defecto: \n\t\t\t** - Recopilar registros del sistema  y LoL **\n\t\t\t** - Usar p&uacute;blico (dentro de la secci&oacute;n de DNS). ** \n- Esto va a dejar un archivo Registros LoL.zip en tu escritorio, que puedes subir a cualquier repositorio (mega o googledrive) para que pueda revisarlos y ver exactamente donde est&aacute; su problema (tambi&eacute;n se pueden crear un ticket/chat [aqu&iacute;](https://support.riotgames.com/hc/es-419/requests/new) y subir toda la info para que se resuelva a trav&eacute;s de nuestra plataforma de soporte).\n\n\nIre actualizando el post a medida que encuentre soluciones para los problemas mas frecuentes. \n\nEdit: el error de los chromas que no se pueden comprar por PI ya está reportado, lo estamos revisando. \n\nEdit 2: \n\nEl Error de los campeones que usan habilidades de auto ataques ya está reportado, hoy haremos un fix de esto y simplemente dejarán de ver este problema. \n\nRespecto a aquellos que se le cierra el juego de la nada, les pido por favor si pueden hacer los pasos de mas arriba y subir toda la info que puedan :) . ","replies":[{"poster":"Tomyrex143","date":"2017-03-22T14:42:24.156+0000","up_votes":4,"down_votes":1,"body":"Si, tengo un problema. Sigo siendo manc.. ah no, eso no es problema del parche :(","replies":[{"poster":"Gabvy2018","date":"2017-03-22T14:42:52.129+0000","up_votes":13,"down_votes":0,"body":"Juga galio papu :D","replies":[]}]},{"poster":"Høürs","date":"2017-03-22T17:46:15.525+0000","up_votes":7,"down_votes":0,"body":"No se si lo arreglaran ya que es muy tedioso pero cuando subes de nivel de invocador osea del 1 al 30, las maestrías para ponerlas tienes que reiniciar el cliente y esto con el antiguo cliente no pasaba, y lo peor que cuando subes de nivel al igual que las maestrías los hechizos de invocador también no los deja elegir, espero que algún rioter me lea desde ya muchas gracias :)","replies":[{"poster":"HeadHunter Jayce","date":"2017-03-22T17:47:00.397+0000","up_votes":1,"down_votes":0,"body":"Verdad","replies":[{"poster":"Gabvy2018","date":"2017-03-22T18:36:14.565+0000","up_votes":1,"down_votes":1,"body":"Este bug ya está reportado, lo cierto es que LCU tiene como prioridad mejorar el desempeño para que la experiencia dentro del juego no se vea perjudicada.","replies":[{"poster":"Høürs","date":"2017-03-22T21:13:08.133+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=Riot Gabvy,realm=LAS,application-id=X54mVVp0,discussion-id=IhyJN7eR,comment-id=000f00000000,timestamp=2017-03-22T18:36:14.565+0000)\n>\n> Este bug ya está reportado, lo cierto es que LCU tiene como prioridad mejorar el desempeño para que la experiencia dentro del juego no se vea perjudicada.\n\nPerdón por mi ignorancia pero que es LCU y que tiene que ver el cliente/selección de campeones, con la experiencia dentro del juego?","replies":[]}]}]}]},{"poster":"ramchuchin","date":"2017-03-22T15:42:55.364+0000","up_votes":7,"down_votes":0,"body":"juge una partida y cada vez que fallaba una Q de tresh en el chat aparecian insultos,lo pueden arreglar ese bug?","replies":[]},{"poster":"Seiji","date":"2017-03-22T15:09:21.194+0000","up_votes":2,"down_votes":0,"body":"En la pestaña \"Coleccion\" cuando seleccionas GALIO para ver las Habilidades sigue figurando el antiguo Galio :V","replies":[{"poster":"Gabvy2018","date":"2017-03-22T15:18:05.506+0000","up_votes":6,"down_votes":0,"body":"Yay, ahí lo vi. Gracias! :)","replies":[]}]},{"poster":"Matas23","date":"2017-03-22T15:02:59.432+0000","up_votes":5,"down_votes":0,"body":"Luego de instalar hoy el parche,y jugar un aram,tuve unos cuantos \"bugs\" visuales\nComo estos:\nhttps://gyazo.com/9979134e52a7a170a47ee4bd18771cd2.png (no se ven los demas campeones en el Tab)\nhttps://gyazo.com/12409df8a099789f8aae507acfc5bda4   (este no se si es un bug o no)\n\no este al pegarme con una q la karma(un bug del hud que me molesto casi toda la partida,cada vez que un enemigo me lanzaba una habilidad o basicos)\n\nhttps://plays.tv/video/58d28cb1f098a985e9/ste-bug-  \nSon bugs por una instalacion mala del parche u otra cosa?\nEs la primera vez que me sucede esto luego de una instalacion de un parche...\nHelp me Gabvy D:","replies":[{"poster":"Gabvy2018","date":"2017-03-22T15:17:06.745+0000","up_votes":4,"down_votes":0,"body":"Eso tiene pinta de que el cliente no pudo actualizar todo bien, podrías reparar el cliente e intentar reproducir el error ?","replies":[{"poster":"marcetton","date":"2017-03-22T20:08:40.726+0000","up_votes":2,"down_votes":0,"body":"ese bug pasa algunas veces al minimizar en pantalla de carga.\nme ha pasado en todos los modos de juego pero no es el 100% de las veces q minimizas es como que queda mal cargada la interfaz y \nlo he arreglado un par de veces saliendo de partida y recargando la misma.\nestaria buena alguna opcion tipo \"reload Ui\" para evitar perder tanto tiempo cuando pasan errores de este tipo.\nsaludos!","replies":[]}]}]},{"poster":"SenpaiDeathx","date":"2017-03-22T14:48:04.147+0000","up_votes":6,"down_votes":1,"body":"Este parche fixea el vació que dejo ella en mi corazón? :(","replies":[{"poster":"Gabvy2018","date":"2017-03-22T14:52:07.190+0000","up_votes":6,"down_votes":1,"body":"Obvio papá ! no viste lo que está galio ? :D","replies":[]}]},{"poster":"Salvor","date":"2017-03-22T14:44:29.704+0000","up_votes":2,"down_votes":0,"body":"Genial! quiero saber cuanto pesa el parche aprox. \nGracias Gabvy!","replies":[{"poster":"Gabvy2018","date":"2017-03-22T14:51:42.735+0000","up_votes":4,"down_votes":0,"body":"El parche pesa 250 mb, eso es lo que verás en el cliente de legado. En el cliente nuevo, en cambio verás solo 90 mb, ya que en este cliente los parches so mas livianos y se bajan datos progresivamente.","replies":[{"poster":"Esti","date":"2017-03-22T14:53:22.566+0000","up_votes":2,"down_votes":0,"body":"A mí en el cliente nuevo, en el botón jugar, me salia que debia descargar 570mb .-.\n¿Es normal?","replies":[{"poster":"Gabvy2018","date":"2017-03-22T14:59:49.229+0000","up_votes":3,"down_votes":0,"body":"Es irregular que pase eso, seguramente hay actualizaciones que no quedaron bien y por eso está intentando descargar tanto. De todas formas deberías extraer los logs como lo marque arriba en el post.","replies":[]}]}]}]},{"poster":"RodriiB","date":"2017-03-22T18:24:29.326+0000","up_votes":1,"down_votes":0,"body":"Gabvy no se si es un problema o es que realmente hay poca gente jugando. Las colas tanto en solo q como flex tiran 5 min o 5:30 min de cola. Paso algo?","replies":[{"poster":"Gabvy2018","date":"2017-03-22T18:34:27.443+0000","up_votes":3,"down_votes":0,"body":"hay menos gente jugando a estos horarios, recuerda que ya arrancaron las clases :)","replies":[]}]},{"poster":"Leöna","date":"2017-03-22T18:31:43.353+0000","up_votes":3,"down_votes":0,"body":"Hola, el problema es q no me deja comprar el croma por pi :v ya lo reporte (estoy decesperado xddd)","replies":[]},{"poster":"BronzaKaiser","date":"2017-03-22T18:18:43.301+0000","up_votes":3,"down_votes":0,"body":"no puedo comprar ningun chroma con PI -> http://imgur.com/a/haZN2","replies":[{"poster":"1221","date":"2017-03-22T18:24:59.253+0000","up_votes":1,"down_votes":0,"body":"Same, +1 al que le pasa así lo lee un rioter (yo probé con ambos clientes y no me deja)","replies":[{"poster":"Gabvy2018","date":"2017-03-22T18:35:19.818+0000","up_votes":2,"down_votes":0,"body":"Gracias, voy estar investigando. Debe ser un error de la tienda.","replies":[]}]}]},{"poster":"TaEnGre","date":"2017-03-22T16:47:01.874+0000","up_votes":3,"down_votes":0,"body":"Hola, tengo un problema que no vi nunca en mi vida ni en ningun foro, ya lo publique\n\nhttp://boards.las.leagueoflegends.com/es/c/ayuda-y-soporte/A7r4Rci5-ayudaaa-problema-al-actualizar","replies":[{"poster":"Gabvy2018","date":"2017-03-22T17:33:01.889+0000","up_votes":2,"down_votes":0,"body":"Para esto lo primero que aconsejo es reparar el cliente, dado que vos no llegas hasta esa parte. Te diria que intentes reinstalar .","replies":[]}]},{"poster":"Weon","date":"2017-03-22T15:30:37.023+0000","up_votes":3,"down_votes":0,"body":"tengo un problema con el parche, cuando selecciono a {{champion:3}} obtengo un campeon totalmente diferente que solo comparte el nombre :(\n**Q.E.P.D: La tristeza del guardian**\n\nahora en serio... {{item:3137}} y {{item:3181}} siguen existiendo dentro del juego o solo estan sus cenizas en los foros(?","replies":[]},{"poster":"Nísta","date":"2017-03-22T15:19:09.779+0000","up_votes":3,"down_votes":0,"body":"Se solucionó el \"bug\" que hacía que a muchos en lugar de hacer el ping amarillo normal les hacía el celeste?","replies":[{"poster":"Gabvy2018","date":"2017-03-22T17:31:55.762+0000","up_votes":2,"down_votes":0,"body":"Si, ese bug fue solucionado el parche anterior.","replies":[]}]},{"poster":"PROPHENCY","date":"2017-03-22T14:56:21.298+0000","up_votes":2,"down_votes":0,"body":"Che gaby compre dos packs de cofres de 10 cofres +1 set adicional y otro de 5+ escencia naranja , un total de 27 cofres de los cuales 25 pude abrir , dos de ellos se bugearon en el cliente nuevo ,al entrar y salir no estaban y en el Botín tenía exactamente los mismos skins y, campeones, realmente me cuesta mucho ganar la guita y necesito que me den una mano.. Estos errores del cliente nuevo me tienen bastante podrido","replies":[{"poster":"Gabvy2018","date":"2017-03-22T15:15:34.554+0000","up_votes":3,"down_votes":0,"body":"Prophency, \n\nPor lo que vi en tu cuenta los cofres y todo está ahí. Te recuerdo que el cliente nuevo, es una beta y por ende puede tener ese tipo de errores que normalmente se solucionan reiniciando el cliente (para cuando ves contenido que se muestra de una forma incorrecta). \n\nEstuve viendo y abriste 28 cofres el día de ayer asi que lo que viste está bien.","replies":[]}]},{"poster":"sxea ","date":"2017-04-05T16:11:29.758+0000","up_votes":2,"down_votes":0,"body":"si yo tengo un problema\nMe acabo de comprar una pc gamer para poder jugar mejor y mas fluido al lol pero el problema es que entro a la partida y tengo unos 350 fps y 56 ms y se me sigue lageando (me salen tarde las skill shot , el champ me deja de correr de golpe , se muere tarde el pj ) necesito ayuda para saber q es o que puedo hacer ya instale los drivers en la computadora y ya probe en reparar el lol para ver si algun archivo estaba dañado y asi y todo me sigue pasando lo del lag .Por favor ayuda ahora q tengo una pc y deje la cafetera q tenia para póder jugar tranquilo sin ningun tipo de interrupcion se me sigue lageando .   {{item:3151}}","replies":[{"poster":"Akirachan7u7","date":"2018-01-15T19:02:43.169+0000","up_votes":1,"down_votes":0,"body":"Me pasa exactamente lo mismo,salvo que sigo teniendo mi tostadora :u","replies":[]}]},{"poster":"DWG Crush","date":"2017-04-05T03:10:08.118+0000","up_votes":2,"down_votes":0,"body":"{{champion:67}} :Hola, buenas noches, hoy eh tenido un día que estaba jugando normal tranquilamente y de un segundo a otro me anda tipo con lag, pero tenia 40 de ms y nadie se movía, los moustros no le bajaban la vida al igual que los subditos, no se si es mi pc o es problema con los servidores, pero si alguien tiene una solución a todo esto le agradecería demasiado, muchas gracias de antemano, no se si es LAG MENTAL o algo ni ideaa pero ayudeeeenme pls\n\nPAIS: Uruguay\nMS normal: 46 ms\nFPS normal: 264\nGraficos: Medio\n\n{{sticker:zombie-brand-clap}}","replies":[]},{"poster":"S3XY Dolape","date":"2017-04-04T17:15:34.990+0000","up_votes":2,"down_votes":0,"body":"Mi problema actualmente es que se me bajaron los fps a 15... normalmente anda el juego entre 130 y 160 per o de un dia a otro se bajaron a 15... Probe con reinstalar los driver de la placa de video de la mother y hasta reinstale el juego... pero esto sigue igual\ntengo un internet de 20 mb siempre andubo genial el lol pero ahora apenas si puedo moverme","replies":[]},{"poster":"Manaos Cola","date":"2017-04-03T03:25:37.274+0000","up_votes":2,"down_votes":0,"body":"Desde la 7.6 que el lol anda medio colgado, tengo 40ms y la sensación es como si tuviera 160ms. La verdad que es algo molesto.","replies":[]},{"poster":"llllllllllllllll","date":"2017-03-30T21:16:16.472+0000","up_votes":2,"down_votes":0,"body":"TENGO UN PROBLEMA CON EL NUEVO PARCHE NUNCA PERO NUNCA EN LAS TUVE PICO DE PING DE 500 200 400 2000 se va y vuelve se va y vuelve, en este ultimo aprche en los anteriores nunca paso nada no iporta la hora dia como lo soluciono asi no puedo jugar","replies":[]},{"poster":"YsTevez11","date":"2017-03-29T05:28:56.257+0000","up_votes":2,"down_votes":0,"body":"no me abre el juego me salta bugslpat \n{{sticker:zombie-brand-facepalm}} ","replies":[]},{"poster":"xDosed","date":"2017-03-27T06:05:02.518+0000","up_votes":2,"down_votes":0,"body":"Estaba jugando un partida en ranked, cuando cargaba el juego marcaba 999 de ping, cuando entro marcaba 2000 de ping, todo iba peor, cerre el juego y lo vollvia abrir y salto un cartel que decia: Error desconocido, lo sentimos ya enviamos un reporte al servidor... Cuestion que la partida obviamente la perdi y por un problema del server, si me reportaron que no me penalicen :(","replies":[]},{"poster":"Chisolin","date":"2017-03-24T01:09:17.237+0000","up_votes":1,"down_votes":0,"body":"No se si es error del parche pero ya que me sucede desde que se actualizo, lo clasifico como tal...\nCada que termina una partida la resolucion del launcher se pone al minimo, no importa cuantas veces lo vuelva a poner como estaba si lo guarde y lo cierro, vuelve a la resolucion minima y es molesto","replies":[{"poster":"Gabvy2018","date":"2017-03-24T20:23:54.217+0000","up_votes":2,"down_votes":0,"body":"Control + \"-/+\" te sirve para agrandar/achicar respectivamente. \n\nVoy a revisar por que no se guarda la configuración, en teoria deberia ser porque no estás corriendo el juego en modo admin,.","replies":[]}]},{"poster":"sentey26","date":"2017-03-23T17:55:09.588+0000","up_votes":1,"down_votes":0,"body":"http://i68.tinypic.com/300v1bp.jpg Esto sera un error que no se pueda ver bien las bombas de zilean en ese punto ?","replies":[{"poster":"Gabvy2018","date":"2017-03-24T18:00:45.196+0000","up_votes":2,"down_votes":0,"body":"Gracias por el reporte, tenés razón no se puede divisar bien el area de impacto de las bombas.","replies":[]}]},{"poster":"Arrat","date":"2017-03-23T16:53:32.349+0000","up_votes":2,"down_votes":0,"body":"No es un error de este parche, pero lleva varios parches mal, me estoy refiriendo a la voz en la selección de campeones de Yorick, que sigue siendo la misma desde antes del rework, tal como paso en su momento con Sion. Espero que lo solucionen porque se que invirtieron mucho en ese retrabajo y es una pena que siga con esta frase vieja en la selección.","replies":[]},{"poster":"BiXe","date":"2017-03-23T01:00:19.312+0000","up_votes":1,"down_votes":0,"body":"Se buguea al elegir champs (cliente nuevo) ya hice un post con esto, además de que la interfaz de menu in game se ve asquerosamente grande...\n\nhttp://boards.las.leagueoflegends.com/es/c/ayuda-y-soporte/dGrehfbn-promo-perdida-gracias-a-bug-de-cliente-otra-vez","replies":[{"poster":"Gabvy2018","date":"2017-03-23T14:32:38.423+0000","up_votes":2,"down_votes":0,"body":"Ese bug, se soluciona reparando el cliente y respecto al tamaño con Ctrl + la tecla +/- podés agrandar o achicar su tamaño.","replies":[]}]},{"poster":"TSM Biøfrost","date":"2017-03-22T19:23:41.606+0000","up_votes":1,"down_votes":0,"body":"Con respecto a los chromas, no testean estas cosas antes de lanzarlas?","replies":[{"poster":"Gabvy2018","date":"2017-03-23T14:11:39.985+0000","up_votes":2,"down_votes":0,"body":"Si, eso se hace en un ambiente de pruebas. A veces hay inconsistencias entre un ambiente y otro, entonces se generan estos inconvenientes. Ya debería estar solucionado.","replies":[]}]},{"poster":"Nekroz Brionac","date":"2017-03-23T02:15:05.850+0000","up_votes":2,"down_votes":0,"body":"mi problema mas alla de este parche (aunque en este también pero mas leve) es que cada x tiempo me agarra lag teniendo 70 ms (el campeón se traba con la ultima orden de movimiento, los minions se quedan quietos golpeando nada, cosas de lag)\n\nYa probé desinstalar el  juego y volver a instalar (aunque ahora no descargue el cliente beta), use la herramienta Hextech, pase un antivirus por si era algo de la pc y nada. Empezó después de actualizar al parche 7.5 y sigue en este.","replies":[]},{"poster":"V for Vice","date":"2017-03-22T19:45:01.339+0000","up_votes":2,"down_votes":0,"body":"Desapareció todo el contenido de la pestaña botín, es decir fragmentos de campeones, llaves, gemas, esencia, etc.","replies":[]}]}