{"poster":"Luni","date":"2016-03-23T02:57:26.267+0000","title":"Que opinan del \"\"\"\"\"\"\"Balance\"\"\"\"\"\"\"\"\" de estos champs(? - muchas comillas por supuesto-","subforum":"Charlas Generales","up_votes":5,"down_votes":5,"body":"{{champion:23}}  {{champion:238}}  {{champion:114}}  {{champion:5}}  {{champion:17}}  {{champion:80}}  {{champion:105}}  {{champion:11}} \n\nAlguien me dijo esto recientemente : &quot;es asi mi amigo siempre va a ser mas rentable darle mas herramientas y da&ntilde;o a campeones de moda como  {{champion:238}}  {{champion:157}}  o  {{champion:7}} {{champion:105}}  porque de quien te pensas que son las skin mas vendidas? por ende que mas plata le entra a riot, exacto de esos 4 ascos de campeones...desgraciadamente esta minado de fan boys que alimentan continuamente un buffeo tras buffeo tras buffeo a esos 4, aaa no ojo le bajaron 5 de da&ntilde;o a la R de zed pero bue le creamos un objeto {{item:3147}}  para que ultee dos veces  ...desgraciadamente estos  {{champion:38}}  {{champion:134}} {{champion:115}}  {{champion:69}}    son especies en vias de extincion\n\nPD: me falto uno olvidado tambien   {{champion:91}}  para que veas que no soy un hater de asesinos jajaaj (pero estoy bastante cerca)&quot;\n\n\nNo s&eacute; que opinan. Una vez expuse las razones por las cuales uno de estos champs deber&iacute;a ser nerfeados, y me cagaron a negativos, por que obvio alguien hablando mal de yi cuando - ya sabemos todos quienes usan los champs de &quot;solo q&quot;-  \n\nRiot a menudo dice &quot;riesgo recompensa&quot; si est&aacute;s tomando un riesgo en tu elecci&oacute;n esta deber&iacute;a ser mayormente recompensada. - de hecho lo han dicho muy a menudo- Pero veo que champs con cierto nivel de complejidad de los que se supone que &quot;deber&iacute;as tener una ventaja extra por el riesgo que uno est&aacute; tomando al pickear&quot;  no tienen ventaja alguna. \n\nY la idea en realmente debatir, por que es medio indignante por ejemplo no s&eacute; que tu equipo le vaya muy bien y pierdas por que un Trynda que iba 0/21 te baje todo en &iquest;dos minutos? Est&aacute; bien vos podr&iacute;as decir &quot; tu equipo se distrajo mucho. Est&aacute;bamos en una tf y cuando backeamos ya nos rompieron el nexo. O sea que alguien que tuve un desempe&ntilde;o p&eacute;simo puede tranquilamente bajarme 82 torres en pocos minutos cuando usualmente tengo que ir de a dos o 3 para hacer tal tarea.  O no s&eacute; backdorear con un {{champion:201}} ponele, pero tarda su momento a menos que quede en lasthit la torre. \n\nQuiero decir me gustaria hablar de coherencia y todos seamos coherentes al respecto. Por que hay champs que se comen el juego y uno que tenes que hacer todo un viaje para algo y van, te meten una q y gg izi. encima la mayor&iacute;a te dicen gg izi. y es como e.e . Y despues Riot dice que c&oacute;digo del invocador cuando yo creo que desde el vamos no hay una iniciativa real sino que termina alimentando todo esto. \n\nas&iacute; que bueno.\n\nQue comienze el bardo(? - digo por que de seguro va a ser as&iacute;-\n\n\nPor otra parte me hace gracia los negativos gracias por tanto niños rata{{sticker:slayer-jinx-wink}} ","replies":[{"poster":"EI xD","date":"2016-03-23T03:21:10.032+0000","up_votes":3,"down_votes":0,"body":"los 4 champs \"ascos\" todos tienen que ponerse a melee para el burst, cc papu","replies":[{"poster":"Luni","date":"2016-03-23T03:30:15.920+0000","up_votes":1,"down_votes":0,"body":"Fajín mercurial, gg izi. Por otra parte es irónico que algunos luchadores con mucho daño te puedan clavar cc, pero si sos AP cagaste por que no tenes cimitarra mercurial que te ofrezca estadísticas además de sacarte del lío como si tiene los AD y que además brinda robo de vida, y una cantidad de daño importante.","replies":[{"poster":"EI xD","date":"2016-03-23T03:37:40.045+0000","up_votes":1,"down_votes":0,"body":"? la cimitarra no te saca una r de naut o una de lee, ademas es un solo cc, con que tengas un tf y un taric por tener un ejemplo en el team cagaron, es cuestion de saber jugarles","replies":[{"poster":"Rolando Magic","date":"2016-03-23T07:02:26.398+0000","up_votes":1,"down_votes":0,"body":"La cimitarra te saca la R de lee al igual que las naranjas de gp y la ulti de shaco, también elimina levantamientos\nhttps://www.youtube.com/watch?v=FgIQtqIX3aw","replies":[]}]}]}]},{"poster":"Ufaaaaaaaaaa","date":"2016-03-23T03:15:36.759+0000","up_votes":2,"down_votes":0,"body":"Tryndamere: está muy bien. Gran duelista y splitpusher, pobre teamfighter.\n\nZed: extremadamente roto, deberían nerfearlo.\n\nFiora: ligeramente op. Podrían hacerle algun minimo retoque (ciertamente no está rota al nivel de Zed)\n\nXin: Roto, el devorador simplemente lo hace roto. Cuestión a revisar, ya que no es problema del campeón en particular, sino de el item que le da una sinergia enorme.\n\nTeemo: PLS, ¿teemo?\n\nPantheon: deberían darle algún ligero buff. Aunque sea la base y escalados de maná.\n\nFizz: tiene un kit muy pete. O lo dejan como está o lo dejan al nivel de Kassa. Complicado ajustarlo.\n\nYi: solucionaron el problema del Yi asesino offtank. Fuera de eso, el mismo de siempre. Un asesino extremadamente vulnerable al hard cc.\n\nYasuo: realmente es un problema como el de Fizz o Kassa, es su kit. EL doble crit realmente lo hace muy roto.\n\nLeblanc: buen champ, balanceado y countereable. Poco que ver con los otros. \n\nTalon: en los niveles 1-5 es un minion, ahí es donde se lo puede destruir. Podría hacerselé algun retoque, pero es un champ decente, que ya bastante lo nerfearon y ahora SI se requiere manos para jugarlo (y eso es suficiente).","replies":[{"poster":"Luni","date":"2016-03-23T03:28:03.758+0000","up_votes":1,"down_votes":1,"body":"Yo creo que Trynda tiene un sustain demasiado elevado, podrás decir pobre teamfighter, pero siempre se lleva dos o tres. fácilmente. Lo que sí es sensible al cc, literalmente lo he matado más veces con {{champion:37}}  y {{champion:43}} , que con un {{champion:126}} o {{champion:131}}, además su ulti tiene un CD bastante bajo por la ventaja que recibe por él.\n\nFiora hace bastante daño, con unos buenos ganks es un pj que lo podes mantener bajo control. Pero te puede divear fácilmente o trolear el ignite o cosas parecidas con esa habilidad que deniega habilidades, etc. Y además la escalada de velocidad de movimiento y velocidad de ataque, hay que saber tradearle pero es un dolor de cabeza intenso.\n\nPantheon, buff(? bloquea cantidad ridícula de daño, tiene free dive, movimiento global, un CC altísimo, dificil de matar, y el tipo como que te stunee y te mande su otra habilidad ya fuiste historia, además tradea fácilmente tirando su lanza que tiene un daño considerable y tiene un CD demasiado bajo. \n\nTeemo, si, teemo. A menos que vayas con un champ específico para counterearle, con que se arme dos ítems te erradica. Y lo digo de toodas las veces que lo tuve que counterear muchas les gane obvio que con un {{champion:57}} o un {{champion:98}} , pero sino pfff. \n\nYo no he mencionado a Leblanc, es complicadita counterearle, y hace bastante daño, pero es un papel. si sabes predecir los movimientos de quien la usa, uno ya tiene cierta ventaja. \n\nYasuo es muy sensible al cc, pero por otra parte, no le dan los dedos de las manos de las veces que ni se fedea y con dos ítems se hace un cuadra.  Con poca vida encima.\n\nFizz tambien tiene free dive, o deniega daño y cc con esa E que lo vuelve intargeteable además provoca un daño a niveles descomunales - supongo que conoces la descripciones de sus habilidad, y las escaladas que tiene-","replies":[{"poster":"MD Abýssou","date":"2016-03-23T03:33:12.393+0000","up_votes":1,"down_votes":0,"body":"de todos los que dijiste, el unico campeon que no esta balanceado es fiora, pero ya le quitan daño en su pasiva, hay que ver como evoluciona","replies":[]}]},{"poster":"MD Abýssou","date":"2016-03-23T03:30:23.921+0000","up_votes":1,"down_votes":0,"body":"muy buen resumen","replies":[]}]},{"poster":"Hachi","date":"2016-03-23T03:01:16.199+0000","up_votes":2,"down_votes":0,"body":"Los champs que Riot nerfea son los que ven a menudo en competitivo, no los que los bronces dicen que están rotos. \nSí, hay excepciones, pero por favor, a todo se le puede ganar si sabes jugar. {{champion:202}}","replies":[{"poster":"Luni","date":"2016-03-23T03:04:26.798+0000","up_votes":2,"down_votes":1,"body":"Nunca te paso de realmente farmear bien, no fedear al enemigo y te rompa todo despues sin tener alguna explicación de eso(? por que vos me podes decir, le podes ganar a todo si sabes jugar. Bueno. cuando te hacen 1000 de daño con dos basicos con un par de ítems(?. Aún cuando lo stuneas, lo ralentizas , y usas todo tu condenado combo(?\n\n\nYo tengo la creencia que hay champs que no se usan en competitivo por una cuestión implícita de dignidad Dx. \n","replies":[{"poster":"Shiny Teemo","date":"2016-03-23T04:26:43.526+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Luni","date":"2016-03-23T10:14:21.595+0000","up_votes":1,"down_votes":0,"body":"Como decía un trynda con un par de objetos te hace mil de daño, Aunque en competitivo, usan también conformaciones como mucho burst y CC. No me extrañaría ver a una {{champion:113}} , por que está bastante fuerte, aún más que {{champion:201}} . Pero {{champion:105}} , que en buenas manos es casi inmune al control de masas y deletea lo que se le canta las ganas, no lo usan. Y no tiene mal early y mucho menos mal late","replies":[]}]},{"poster":"dscpnak","date":"2016-03-23T04:19:12.401+0000","up_votes":1,"down_votes":0,"body":"la respuesta justa","replies":[]}]}]},{"poster":"Ishek","date":"2016-03-23T03:00:25.212+0000","up_votes":2,"down_votes":0,"body":"Para Zed está planeado un nerf, a Fiora y Yi los nerfean en el parche de mañana, a Talon ya lo nerfearon este parche, Teemo es Teemo, y al resto hay que saber jugarles, por algo justamente son asesinos","replies":[{"poster":"Luni","date":"2016-03-23T03:11:26.421+0000","up_votes":1,"down_votes":1,"body":"Yo a zed lo mato relativamente fácil.  Es un champ frágil a pesar de todo. Talon es cosa aparte por que por más que tengas lente revelador el tipo es invisible y se mueve a 80 millas por hora. Teemo ya es un asco. siempre he dicho que su kit de habilidades es como que tiene todo demasiado servido esconderse en el bush en 0,5 segundos, me parece como ya medio broma, suelo usar lente revelador para desactivar sus trampas si soy jg y lo voy a ir a gankear, pero aún así saca demasiado por su pasiva. Si usas un champ que no sé no está tan roto,  no hace taaanto daño, o es tank, estás frito. Y eso que le hago frente a champs complicados y estoy aconstumbrado como a {{champion:238}} , {{champion:245}} , {{champion:99}} ,{{champion:7}} , {{champion:36}}  , {{champion:201}} , entre otros que son difíciles, de hecho una vez estaba en midlane y me toco una {{champion:55}} y un {{champion:157}} e iba {{champion:43}} . No recuerdo haber nunca dado una paliza tan grande, y eso que farmear es complicado con ella, y es un viaje tradear por que tenes que exponerte - o sea no podes tradear detras de los minions- y el escudo no cubre taaanto daño como otros champs si lo hacen","replies":[]}]},{"poster":"TerrSinManos","date":"2016-03-23T10:49:31.475+0000","up_votes":1,"down_votes":0,"body":"A ver, en cuanto a Zed y Fizz estoy medianamente de acuerdo contigo. Son campeones mecánicamente complejos (como Riven, Le Blanc o Yasuo) pero su problema es que no se necesita dominarlos bien para meter daño, porque tienen mucho. Y si les quitan daño, los dejan useless, pues son asesinos que dependen de deletear gente.\nFiora es mecánicamente muy compleja, y no cualquiera puede timear su w bien. Ahora, eso no quita que tenga demasiado daño siendo Tank, pero esperemos que el último nerf haya solucionado eso.\nXin Zhao sí que estoy de acuerdo contigo.  El buff que recibió es un inentendible, y cualquiera con muñones puede jugarlo medianamente bien y sacar ventaja. Riot logic?\nTeemo y Panth son campeones de early, como Renekton o Lee. Si no logran matar a alguien o sacar una buena ventaja en cs, pierden muchísima efectividad de cara al late. De modo que nerfearlos sería un despropósito, teniendo en cuenta eso.\nCon Yi o Trynda pasa lo contrario. No son muy buenos es early, pero si los dejas llegar a late son bestias. Y ahí está la clave: aprovechar su mal early para ganarla antes. Y es que así es la vida, al iwal que Nasus o Gangplank. Aproximadamente cada 20 súbditos (corrijanme si me equivoco) es el equivalente a una kill, y si dichos campeones hacen lo que tienen que hacer (farmear de cara al late) van a meter el infierno en algún momento. Así funcionan. El asunto está en sí meten el infierno al minuto 30 o al 50, y ahí entra lo que tu Team haga. De modo que me parece que, si bien el balance está lejos de ser perfectos, en muchos casos que tú mencionas como \"rotos\", sí hay cierto \"riesgo-recompensa\"","replies":[{"poster":"Luni","date":"2016-03-23T15:36:03.611+0000","up_votes":1,"down_votes":0,"body":"Estoy de acuerdo con lo de {{champion:11}} , aúnque tampoco es muy dificil de armarlo y tampoco necesita tantos ítems, si va jg con que se haga devorador ya con ese item puede deletear a quien se le de la gana. \n\n{{champion:92}} bueno primero es un champ fácil de usar, pero no cualquier la domina bien; aunque en ciertos aspectos está un poco pasada de OP. Pero si le juegas bien le ganas, no tiene un sustain tan elevado como {{champion:23}} , que tradeas con él por más que tu le hayas sacado mas vida, hitea 3 veces a un par de minions y ya se curó; y yo creo que más que su ulti misma creo que se cura en exceso , y más que hay dos maestrías actualmente que benefician demasiado eso. \n\n{{champion:238}} es verdad que está pasado de OP ultimamente pero con los champs que utilizo siempre le gano en el peor de los casos le empato. \n\n{{champion:105}} Yo creo que lo más roto que tiene es que además de provocar un daño tremendo con su E es que es intargeteable, es humillante como se te ríe en la cara, tu puedes tener 3/4 de vida, pero el cabrón te limpia bajo torre, es como wut(?\n\n{{champion:7}} complicada, pero es de papel, tenes que saber predecirla. {{champion:105}} por más que vos puedas predecir su jugada su E te arruina la existencia misma. \n\n{{champion:80}} la lanza que tira tiene un daño considerable un CD muy bajo, te stunea y bloquea daño, stuns.etc. Yo creo que es bastante grosero a veces. Podra tener solo un buen early como dices, pero tiene herramientas para counterear practicamente a cualquier champ. Es melee pero tiene demasiada facilidad para denegar daño y ganar trades. Puede ultearte bajo torre, stunearte, bloquear daño y matarte, fácilmente.  Cuando se supone que la torre debe \"disuadir\" al enemigo frente a la ventaja que podría llegar este en línea. Otra cosa, no es taan dificil de usar\n\n{{champion:17}} Igual que panth tienen un kit de habilidades que les deja todo servido, no se expone para tradear, se esconde fácilmente, deniega habilidades, y su pasiva genera un daño muy acusante. {{champion:69}}  {{champion:27}} y {{champion:29}} , Que usan \"envenenamiento\" tampoco es tan grosero. Me parece que le deberían bajar un poco.  En lvl 3 500 de vida con un par de habilidades es como \"Oye calmate viejo\". \n\n{{champion:23}} como he mencionado, puede fedear a todo tu team, pero te baja torres a min 35 como si fuera un tren, es como ¿?¿?¿? No me parece que tenga lógica. \n\n{{champion:41}} Mete mucho daño , pero es relativamente frágil, su W que lo salva de problemas, tiene un enfriamiento razonable. \n\n{{champion:75}} Si, un buen nasus es más razonable que se farmee las torres, por que su ventaja es su misma desventaja si lo dejas farmear su q estás en problema pero es muy sensible al CC, no tiene tanta movilidad, y cualquiera le puede hacer 1vs1 razonable. Y en late sigue siendo sensible al CC de hecho full tank con Shen en min 40 le gano con cierta facilidad. \n\nCon riesgo y recompensa me refiero a champs como {{champion:34}}  {{champion:60}} {{champion:43}} {{champion:126}} {{champion:72}} {{champion:20}} {{champion:57}}  Que son más complicados de usar, muchos se exponen en determinados momentos, si bien tienen variadas herramientas, no tienen todo servido, tenes que pensar mejor las jugadas, saber cuando te vas a exponer, como.etc. O tenes capaz todo un combo, pero con la posibilidad de fallar alguna habilidad, O sea siempre tienes lugar a un error como a un acierto, y eso depende de ti; denegar o no  una o tal cosa. Por que elise puedes usar rapel para evitar daño o perseguir a alguien, pero una vez que lo haces no hay vuelta atrás y no lo puedes hacer cada 5 segundos como muchos de estos champs, se cura, pero tampoco como lo hace {{champion:23}}. Jayce con un par de ítems pone un buen daño, tiene varias herramientas, un CC digno, un buen rango, tiene un buen daño, pero excepto que esté buildeado hasta los dientes ni de coña te mete en 2 o 3 basicos 1000 de daño.","replies":[]}]},{"poster":"Runth","date":"2016-03-23T10:16:42.756+0000","up_votes":1,"down_votes":0,"body":"la janna el nerf de su escudo deberia haberlo echo hace muuuuchisimo tiempo y ahora se dieron cuenta\n\nlos demas, meh, si el player no tiene manos usar esos champs, seguro terminaran manqueando , pero los nerf la verdad son necesarios pero no abusarlos algo q no sera concreto \n\ntiene un nombre, se llamaba... ventaja ciclica..... cliclo de fortaleza/debilidades..... no recuerdo la palabra","replies":[{"poster":"Luni","date":"2016-03-23T10:37:31.616+0000","up_votes":1,"down_votes":0,"body":"Yo creo que para generar un balance hay que establecer cierta coherencia. Ni si quiera lo puse a {{champion:96}} y eso que te clava daño hasta las pestañas. Me hace gracias que haciéndole 1vs1 con {{champion:126}} , lo pueda matar fácilmente antes que el a mí, pero un {{champion:23}} me mate de un solo básico. Además se cura mucho más que otros campeones con robo de vida, y el cc que te clava es muy GG, suelo counterearlo con {{champion:60}} que tiene un buen CC y me las puedo tomar con rápel, para denegar daño, y obligarlo a que divee con su ulti.\n\nDejando de lado eso, - como para si usar trynda y a yi se necesitara manos-\n\nHay champs que estan relegadisimos, con buenas mecánicas, que son complejos, que su combo es bastante extenso, pero están en situación de desventaja. \n\nEl escudo de janna no me parece mal. Además los AD hacen con pocos básicos daños superiores a mil, y los AP en general, excepto veigar no tienen una escalada tan grande por otra parte, no hay ítems con armadura para AP como {{champion:43}} , {{champion:99}} , si se quiere un {{champion:30}} . El {{item:3157}} tiene gran utilidad, pero la estadística que ofrece en armadura no es algo que vos digas, genera una real diferencia. Es más como item defensivo el {{item:3116}} , me parece mas util en muchos casos. \n\nNo exactamente, se puede llegar hablar de champs, sino de ítems. ","replies":[]}]},{"poster":"Rolando Magic","date":"2016-03-23T07:00:24.785+0000","up_votes":1,"down_votes":0,"body":"Algo que me causa mucha risa de Riot es la idea de \"counter play\" que tienen en la cabeza, donde nerfean a un campeon/objeto por no poder contrarrestarlo y en el siguiente parche se lo pasan por el forro y sacan un champ/buffeo fruta y todos felices. Ademas pienso que la idea de riesgo-recompensa tampoco es la mejor donde muchos campeones no tiene casi ni riesgo para lo que podes conseguir un ej clarisimo {{champion:41}} que sin importar lo que pase vos farmeas y en x minuto ganas la partida.Todo esto pasa en ligas que no le importan a Riot ya que en maestro/retador/E-sports esto no pasa por obvias razones y es a donde realmente apunta la empresa. \nAhora volviendo a lo que decís (por mas que nunca me fui porque no empece e.e) no creo que los campeones sean asi por la plata que dan, dan plata porque a la gente le gustan y son muy jugados capas este relacionado a su desbalance pero no gira en torno a lo que genera de beneficio para la empresa su nerf/buff (pienso yo) y comparto en que estan rotos solo por tener demasiada movilidad, es absurda a tal punto de un zhonyas cada 8 segundos con {{champion:105}}\nSaludos{{champion:131}}","replies":[]},{"poster":"Numerítos","date":"2016-03-23T04:05:07.538+0000","up_votes":1,"down_votes":0,"body":"yo se que estan algo desvalanceados, pero igual los enfrento, yo ayudo a mi team, por ejemplo, voy {{champion:72}}  y le hago peel a mi adc quedandome cerca de el y si llega un asesino PAM! le doy una R y es kill para mi adc, o mejor aun, no les dejo atacar con el taunt en área de {{champion:3}}, hay muchos campeones, mas de uno le hace counter a otro es cosa de ver bien sus habilidades, saludos \n\n{{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"Nerfed Tokiih","date":"2016-03-23T03:34:55.183+0000","up_votes":1,"down_votes":0,"body":"Claro campeones como annie tienen taaanto riesgo y taaal recompensa como flash r = tf pero ojo mucho riesgo en habiidades en aerea y dirigidas con muuuy poco daño seguro.... agarra a zed yasuo lb y fizz y trata de hacer las cosas de las que te quejas y despues vemos que haces....","replies":[]},{"poster":"pajarit0","date":"2016-03-23T03:01:42.949+0000","up_votes":1,"down_votes":0,"body":"no creo que talon pero los demas si","replies":[]}]}