{"poster":"JPiRodriGGuez","date":"2015-04-26T20:42:44.679+0000","title":"La clasificacion para unrankeds","subforum":"Off-topic y temas personales","up_votes":1,"down_votes":0,"body":"Hola comunidad lolera, recientemente me jugue unas clasificatorias, jugue 4 y gane 2 me faltan 6 para definir en donde quedare, es la primera vez que juego rankeds y quisiera saber como quedaria si quedo con 2 victorias (obviamente en bronce) pero algunos me dicen que ya podria quedar hasta en bronce 1 y si gano una mas (con suerte) o a lo mucho dos quedaria en plata, y si gano mmm no se 7/10 podria quedar hasta oro o.O\r\nPero otros me dicen que si gane 2 quedo bronce 3 como mucho, o que tengo que ganar 5 o 6 para ser plata , y tengo que ganar las 10 para quedar en oro\r\n\r\nPARA LOS MAS EXPERIMENTADOS, saben mas o menos como quedaria? repito que son mis primeras rankeds.","replies":[{"poster":"Jonshi","date":"2015-04-26T21:12:35.641+0000","up_votes":1,"down_votes":0,"body":"Depende del elo que tengas con los champs que jugas + las victorias. \nYo tuve 8 derrotas y 2 victorias (una con sona y otra con caitlyn), y termine en BII. Mi elo con Cait era de 1.418, por ahi, por lo que era alto. Pero es solo segun el emparejamiento (2 plata, 2 bronces y un unranked para ese momento, y la ganamos con una riven enemiga feedeada O.o)","replies":[{"poster":"JPiRodriGGuez","date":"2015-04-27T22:19:04.549+0000","up_votes":1,"down_votes":0,"body":"pues gane una con janna y otra con leona, con leona desde que me la compre e jugado mm no se unas 20 partidas y perdi dos como mucho y no bromeo te invito a ver mi historial ja, con janna tambien siempre me va muy bien, a si que debo tener buen elo, y ademas las partidas que perdi realmente no fue por mi y me refiero a que termine con muchos mas asesinatos y asistencias que muertes, en fin hoy jugue un par mas y ambas en derrotas, espero ganar almenos 2 de las 4 que me quedan a si por lo menos puedo aspirar a caer en plata, y si no bronce sera, supongo que el 90% de las personas han caido en bronce en algun momento de su vida...","replies":[{"poster":"Jonshi","date":"2015-04-27T22:32:24.214+0000","up_votes":1,"down_votes":0,"body":"Mira: Segun LoLSkill, tenes 1,318 con Leona y 1,273 con Janna. Ponele que te va a emparejar con BIII o BII (por lo que en una PUEDE que caiga con vos, siempre y cuando mi elo de 1,418 con los champs me lo permita :3), ya que a mi con 1,418 de elo me emparejaba en unrankeds con SilverV. Puede que, si ganas estas, o las perdes pero tus stats son muy buenas, estarias BII o BI. Fijate luego de las 10 rankeds cuanto elo tenes con los champs.\nY con el tema del ELO, es simplemente asi: Si vos tenes un buen juego con x champs, vas a ser buenisimo con esos champs GANES O PIERDAS. Es como si apostas 2 pesos a cara y un amigo tuyo apuesta 10 a cruz. Ganes o pierdas vas a salir estadisticamente ganando. El Elo es una medicion que se usa para saber las habilidades de los jugadores de ajedrez (y ahora del LoL). Si perdes partidas, pero tus numeros son buenos, tu elo disminuira menos. En ese caso, lo mejor es mejorar tus numeros y luego las partidas seran ganadas estadisticamente :3","replies":[{"poster":"JPiRodriGGuez","date":"2015-04-29T16:30:04.495+0000","up_votes":1,"down_votes":0,"body":"Me puedes pasar la pagina en donde te has fijado eso? y otra cosa, las primeras partidas que juegue y gane, una vez que me hallan depositado en una liga, esas victorias me daran muchos puntos (15 por lo menos) o me pasara como a algunos que tienen que ganar como 10 partidas o mas para llegar a los 100 puntos, me refiero a los de elo bajo por supuesto...","replies":[{"poster":"Jonshi","date":"2015-04-29T18:28:21.269+0000","up_votes":1,"down_votes":0,"body":"LoLSkill.net es la pagina.\nCuando te pongan en una liga vas a empezar con 0 puntos, y, dependiendo de tu elo, tus numeros y tal, si es victoria te daran mas o menos puntos. Pero la media es entre 10 y 15 LP, con elo y emparejamiento de tu rango (Los que se quejan en el foro tienen un elo bajisimo :v)","replies":[]}]}]}]}]},{"poster":"Etihw","date":"2015-04-26T20:56:46.258+0000","up_votes":1,"down_votes":0,"body":"No estoy seguro de como funciona con presición, pero puedes tomar cada win como una sub-division, empezando en bronze 5.\n\n0 wins -> bronze 5\n1 win -> bronze 4\n2 wins -> bronze 3\n3 wins -> bronze 2\n4 wins -> bronze 1\n\n5 wins -> plata 5\n6 wins -> plata 4\n7 wins -> plata 3\n8 wins -> plata 2\n9 wins -> plata 1\n\n10 wins -> oro 5\n\nAunque esto no es preciso, y puede que empiezes en alguna liga mayor con menos wins. o vice-versa.\nPero generalmente asi es como he visto a la gente quedar.\n\nSi has jugado rankeds en la season pasada, tambien va a afectar, pero como dices, si son tus primeras, entonces deberia quedar más o menos como te dije.\nPuede variar un poco, pero no sera más alla de 1 division.","replies":[{"poster":"JPiRodriGGuez","date":"2015-04-27T22:21:11.521+0000","up_votes":1,"down_votes":0,"body":"entonces me voy olvidando de mi marco doradito {{item:3151}}","replies":[{"poster":"Sindo","date":"2015-04-28T15:45:21.302+0000","up_votes":1,"down_votes":0,"body":"Y mira yo empece a rankear la season pasada y gane 5 de las 10 partidas y quede bronce 1, no me tome las ranked muy enserio y termine en plata 3. Rankear no es muy difícil la verdad solo debes tener fe en ti mismo y veras que es mas facil de lo que te imaginas. Creo que llegaras a Oro suerte mi amigo","replies":[]}]}]}]}