{"poster":"C9 Admiral Akbar","date":"2018-01-18T22:56:52.115+0000","title":"WTF Placements?!?!??!?!?!?!?!","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":3,"body":"Ich habe heute meine placements zuende gespielt und war letzte season Plat 5 und wurde mit 7-3er placements gold 5 platziert. Ein freund von mir war letzte season Gold 4 hat die placements nur 6-3 gespielt und kam silber 1. An der MMR hat es sicher nicht gelegen, denn die war bei uns beiden schlecht. Ich w&uuml;rde nur gerne wissen mit welcher begr&uuml;ndung ich so schlecht platziert wurde. Danke schonmal im vorraus.","replies":[{"poster":"Pandeonor","date":"2018-01-19T06:15:19.073+0000","up_votes":2,"down_votes":0,"body":"1.) Weil nicht die letzte Season sondern die Preseason bzw. MMR zum Zeitpunkt des Reset zählt.\n\n2.) Weil die MMR einer 5er Liga bis zur MMR der darunterliegenden Division reichen kann.","replies":[]},{"poster":"Qbert","date":"2018-01-19T05:48:33.666+0000","up_votes":1,"down_votes":0,"body":"Ganz simpel: Pech.\n\nDas gehört dazu ... einfach durchziehen und wieder climben. Nicht vergessen, es ist ein Spiel und soll dir Spaß bescheren, keinen Stress. :)","replies":[{"poster":"Vapertank","date":"2018-01-19T23:47:18.562+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Qbert,realm=EUW,application-id=ip27PlEH,discussion-id=kZhOkbpW,comment-id=0003,timestamp=2018-01-19T05:48:33.666+0000)\n>\n> Ganz simpel: Pech.\n> \n> Das gehört dazu ... einfach durchziehen und wieder climben. Nicht vergessen, es ist ein Spiel und soll dir Spaß bescheren, keinen Stress. :)\n\nDieses Spiel macht schon seit einigen Seasons keinen Spaß mehr, und an jedem Seasonstart ist das Ranked spielen wieder aufs neue ein einziger Krampf. Vorallem wenn mit Missionen auch noch unterstützt wird, dass Spieler fürs Games grinden und reintrollen belohnt werden. Lächerlich.","replies":[]},{"poster":"C9 Admiral Akbar","date":"2018-01-19T14:25:11.263+0000","up_votes":1,"down_votes":0,"body":"Ich meine ich schaffe es bestimmt wieder platin aber kostet halt zeit","replies":[]}]},{"poster":"SuicidePlank","date":"2018-01-19T00:36:50.449+0000","up_votes":1,"down_votes":0,"body":"Wahrscheinlich war die MMR in der Preseason nicht so klasse, ich hab die Season G1 beendet und ich in der Preseason nach Dia5 hochgespielt. Mit 6 - 4 wurde ich Platin 1 geplaced.","replies":[]},{"poster":"Jinx1967","date":"2018-01-18T23:26:41.126+0000","up_votes":1,"down_votes":0,"body":"Du wurdest nicht schlecht platziert, wenn dann wurde dein Kollege gut platziert. Du hattest eine Gold MMR und wirst dann auch mit 7 Wins leicht unterhalb der S7 Elo platziert.\n\nZu deinem Kollegen: Wenn er Gold 4 ist kann seine MMR ja nicht so schlecht sein. Ansonsten einfach mal op.gg verlinken.","replies":[]},{"poster":"Avorox","date":"2018-01-18T23:06:41.716+0000","up_votes":1,"down_votes":0,"body":"Ist doch eig nen ganz normaler Start. Ich bin die letzten 3 Jahre mit 6/4 Placements immer ne komplette Liga gedroppt.","replies":[]}]}