{"poster":"xXM3liod4SXx","date":"2017-04-26T11:53:27.615+0000","title":"Shen! Top o jungle? è affidabile come champion??","subforum":"Campioni e gameplay","up_votes":1,"down_votes":0,"body":"Salve a tutti, da qualche giorno mi &egrave; presa la scimmia di spammare shen top o rare volte anche jungle... mi piace come champ, ma... la mia domanda &egrave;: &egrave; affidabile? Mi spiego: capiti con un team alleato scarsuccio, un darius recupera tutto, ma shen? Ha questa possibilit&agrave;?\r\nUna build con un minimo di danno per shen qual&#039;&egrave;? Io stavo provando la seguente:\r\nsun fire , omen , mercury , idra titanica , trinity , banshee - come toplaner ovviamente, che ne pensate voi? lavora meglio in top o in jung?","replies":[{"poster":"Kian987","date":"2017-04-26T20:59:15.126+0000","up_votes":2,"down_votes":0,"body":"Shen è una cacca. L'ho iniziato a capire dalla S4 ed ora ne sono convinto. Premetto che gioco solo Shen da sempre su tutti i miei account dove ho raggiunto il vergognoso record di 1.6 milioni di punti mastery. Perchè fa schifo?\n\nPrima di tutto preciso che in normal, in ELO bassi e in team di premade Shen è ok. In soloQ quando capiti con 4 perfetti sconosciuti che non hanno idea delle tue intenzioni, di quello che stai per fare e di quanto vuoi spingerti in ogni decisione che prendi e soprattutto in ELO alti, Shen è una merda.\n\nDal 2010 questo maledetto champion ha un difetto che non è stato mai risolto nemmeno con il rework. 3 delle sue 4 spell non scalano con niente. Mi riferisco alla Q ed alla R che scalano, anche molto male, con gli AP che nessuno Shen sano di mente in una ranked in ELO alto in soloQ si sognerebbe di fare. Archiviato questo c'è la W, già molto limitata nei suoi effetti, che ha un CD di 18 secondi con il quale sei costretto a stare per 10, 12 o fino anche 15 livelli. In più non fornisce alcuna protezione contro avversari che fanno danni con le spell. In definitiva se in top lane hai un mago o un qualsasi champion che non basa tutti i suoi danni sugli attacchi base, hai 2 spell che non scalano, 1 che non serve a niente e la E, l'unica spell decente di Shen, che ha comunque un CD di 16 secondi, succhia mezza barra di energy ed è uno skill shot.\n\nChe altro? Trinity force, frozen heart, frozen gauntelt. 3 item fortissimi che sulla carta starebbero bene su Shen se non fosse per il fatto che danno tonnellate di mana inutile. Ne consegue che uno Shen non può considerare il loro acquisto e quindi rieccoci con la stessa build che fanno tutti gli Shen del mondo: sun fire, spirit, titanic, ninja/mercury ed uno tra zz Rot, warmog o randuin. \n\nShen è un champion inflessibile che difficilmente si può adattare a stili di gioco e build differenti, per tutta la laning è facile da counterare, zonare, outfarmare ed è anche facile che perda la prima torre. È concepito per perdere passivamente la lane e subire per tutto il tempo per far vincere il team che se però sta perdendo lo rende inutile. Aggiungamoci i pochi item acquistabili, il fatto che abbia pochissimi matchup equilibrati e tantissimi da incubo. Ne vale la pena? Non erano meglio, più sicuri ed affidabili questi?\n\n{{champion:266}} {{champion:245}} {{champion:122}} {{champion:31}} {{champion:164}} {{champion:114}} {{champion:105}} {{champion:3}} {{champion:41}} {{champion:86}} {{champion:150}} {{champion:420}} {{champion:126}} {{champion:39}} {{champion:10}} {{champion:240}} {{champion:111}} {{champion:75}} {{champion:82}} {{champion:57}} {{champion:54}} {{champion:2}} {{champion:80}} {{champion:78}} {{champion:58}} {{champion:92}} {{champion:68}} {{champion:13}} {{champion:27}} {{champion:50}} {{champion:23}} {{champion:48}} {{champion:62}} {{champion:157}} {{champion:83}} \n\nDal rework è stato nerfato 3 volte prima nel danno poi nello shield e poi ancora nel danno e nell'utility ma la RIOT si è dimenticata di alzargli le stat di base che sono tra le più basse del gioco per un tank. Così basse da essere paragonabili a quelle di Tristana che, al netto di rune, ha praticamente le stesse stats per tutto l'early. In conclusione nel pro-play va bene perchè sono tutti premade. Per colpa dei pro-player chi lo usa in soloQ a fatica ora si deve subire anche i nerf.","replies":[{"poster":"xXM3liod4SXx","date":"2017-05-07T00:39:22.094+0000","up_votes":1,"down_votes":0,"body":"Oi spero tu possa leggere il prima possibile per darmi la tua opinione al riguardo! :D\nho provato anzi azzardato, shen jung con: item jung attack speed, lama del re in rovina, scarpe mercury , sunfire, omen e corazza spirituale (scettro dell'abisso non ha effetto sulla Q di shen...) diciamo che mi sono trovato molto bene \n(come rune e maestrie: rune ho usato le gialle hp x lv , glifi MR x liv , quintessenze 4.5% Attack speed x3 , rossi armor e se non erro anche 1 su 9 di quelle gialle armor non ricordo) \nmaestrie: 18 6 6 (ovviamente fervor) in piu' ho distribuito 3 su pen armor e 2 su magic pen \n\n\nin sostanza fa bei danni in mid game, in early purtroppo succhia un pochino... ma appena messo l'item jung il gioco cambia totalmente... se poi chiudo anche la lama re avoglia... un mundo con 4500hp gli tiravo giu' metà vita con 3 colpi (ovviamente con il bonus della spada che attraversa l'avversario) però oh... 3 spadate metà vita nonostante avesse tanta magic res e armor ... mi sembra un ottimo valore per un \"champ brutto\" xd che dici? :) fammi sapere cosa ne pensi e se avrai modo tu stesso di testare questa build \nl'hof atta a c***o ma si è rivelata piu' pro del previsto..","replies":[{"poster":"Kian987","date":"2017-05-10T12:36:20.394+0000","up_votes":1,"down_votes":0,"body":"Mi fa piacere che ti stia divertendo con Shen ma, purtroppo, io torno a ripetere che un conto sono le normal e le ranked in ELO bassi e ben altro sono le ranked quando sali di ELO. Nei primi casi mi sono divertito anche giocando Shen con Mejai e Zhonya, con 14% bonus health (5.400 HP e più), tutto damage (Infinity, Trinity, Wits, Botrk), tutto shield, tutto regen ecc. Worka tutto fintanto che giochi game facili. In ranked in ELO alto passi la laning phase a domandarti chi te lo abbia fatto fare a pikkare Shen. \n\nComunque sicuramente parte del problema sono io che probabilmente non so più giocarlo al meglio perchè sono con le palle a terra e demoralizzato da 1 anno e mezzo di nerf diretti e indiretti e rework. Però anche a guardare gli altri main non se la passano bene. I game si decidono in early. Shen è da late e richiede un team che sia ancora in partita. Arrivarci è un'impresa.","replies":[{"poster":"xXM3liod4SXx","date":"2017-05-10T15:07:39.331+0000","up_votes":1,"down_votes":0,"body":"no vabbè ti chiedevo per sapere cosa ne pensassi tu, non è un best champ però boh è  comunque divertente! lo userò finchè potrò :D a me personalmente diverte molto per la sua Q principalmente","replies":[]}]}]},{"poster":"xXM3liod4SXx","date":"2017-04-27T01:28:21.202+0000","up_votes":1,"down_votes":0,"body":"ti ringrazio per la spiegazione, era giusto per capire se shen fosse un champ utilizzabile o no, mi piace il \"mini burst\" E-Q-W piu' che altro apprezzo il lavoro che svolge la Q (i danni li ho sempre visti, almeno fino a mo)... peccato però.. avesse skill leggermente diverse sarebbe stato un bel champ, la Q mi piace veramente tanto (parliamoci chiaro: è anche figo d'estetica :3)","replies":[]}]},{"poster":"HaIIeIujah","date":"2017-04-26T12:00:43.767+0000","up_votes":2,"down_votes":0,"body":"Shen è un peeler, e come tale richiede che almeno un membro del tuo team sia moderatamente feedato. E' sorprendentemente buono in 1v1, specie contro i tank, ma non aspettarti di poter solocarryare una partita senza essere socenamente feedato.\n\nLa trinity è virtualmente inutile su di lui. Funziona meglio in top che in jungla.","replies":[]},{"poster":"Sarchiapon","date":"2017-04-30T22:00:14.239+0000","up_votes":1,"down_votes":0,"body":"Uno dei campioni più pallosi in assoluto, sia da giocare che da affrontare. E' il campione che riesce più di tutti a essere estremamente utilissimo in mille situazioni...ma a dare comunque l'impressione che non faccia assolutamente niente.\nSarà che, nonostante il rework l'abbia migliorato molto, rimane comunque strano che un ninja dia un idea di pesantezza così inesorabile. Forse avrebbero dovuto osare un pò di più con il rework.","replies":[]},{"poster":"Khail the Crow","date":"2017-04-26T20:34:38.170+0000","up_votes":1,"down_votes":0,"body":"Guarda, col meta attuale non saprei. L'ho usato parecchio in giungla, e gli squishy me li mangiavo senza problemi, anche i meno squishy. Però ora trovo che con un full tank e {{item:3075}}  finisci per fare più danno.","replies":[]},{"poster":"xXM3liod4SXx","date":"2017-04-26T18:29:25.173+0000","up_votes":1,"down_votes":0,"body":"uhm... diciamo che mi piace shen anche per il fatto di potermi muovere tra le lane... ultimate+tp come build ragazzi?? consigli? andare full tank + idra ?","replies":[]},{"poster":"wattbatt","date":"2017-04-26T15:35:34.349+0000","up_votes":1,"down_votes":0,"body":"decisamente no, shen non è fatto per \"recuperare\", serve peropiù a rompere molto i co*** ai nemici in una teamfight, ma per quanti danni gli dai non può shottare i champ squishy","replies":[]},{"poster":"NOLIMIT Vladimir","date":"2017-04-26T12:06:22.093+0000","up_votes":1,"down_votes":0,"body":"È come una LuLu o una Janna: è un peeler della Madonna, ha ingaggio e disingaggio in team fight molto veloce ma se capiti con delle scimmie puoi essere anche 30 1 ma perderai il game","replies":[]},{"poster":"JRobich","date":"2017-04-26T11:59:59.789+0000","up_votes":1,"down_votes":0,"body":"uno shen giocato bene è migliore di un darius giocato bene","replies":[{"poster":"Ringiel","date":"2017-04-26T12:02:23.694+0000","up_votes":1,"down_votes":0,"body":"se i tuoi carry sono bravi ti do ragione,ma se ti trovi in low elo è molto meglio {{champion:122}}","replies":[]}]}]}