{"poster":"nomiS 4 eva","date":"2016-04-20T12:10:16.879+0000","title":"Diana und Feuer?","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Nur mal ne Umfrage um zu schauen ob andere genauso denken.\nVorab. Ich bin ein gro&szlig;er Diana Fan und spiele sie dementsprechend &ouml;fters, besonders im Jungle.\nNun ist Sie aber einer der Champions dessen Lore mir sehr gef&auml;llt und ich denke jeder wei&szlig;, dass sie, anders als die Solari, den Mond verg&ouml;ttert. Darum Frage ich mich warum man einen Feuer-Themed Skin f&uuml;r Sie released.\nIch finde ihn selbstverst&auml;ndlich h&uuml;bsch und klingen tun die F&auml;higkeiten auch gut.\nAber Es ist ein kleiner wiederspruch mit diesem Champion ^^\nAlso die Frage ob ihr einen solchen Skin lieber mit Leona gesehen h&auml;ttet, oder ihr es gerade wegen diesem Konflikt mit ihrer Lore interessant findet.\nUnd schreibt mal ob ihr euch jetzt noch einen Feuer Skin f&uuml;r Leona w&uuml;nscht oder ihr Leona jetzt stattdessen einen Mondlicht o. &auml;. geben w&uuml;rdet.\n\nGr&uuml;&szlig;e Simon :)","replies":[{"poster":"UOL LagsAlot","date":"2016-04-20T12:46:13.538+0000","up_votes":3,"down_votes":0,"body":"Hallo nomiS 4 eva,\n\nDiana hat keinen Feuer-Skin bekommen, weil es gut zu ihrer Geschichte passt, sondern weil sie eine Abstimmung gewonnen hat.\n\nBeim All-Star Event im Dezember 2015 sind zwei Teams gegeneinander (mit gemischten Regionen) angetreten.\n- Team Feuer (LCK, LMS & NA LCS) \n- Team Eis (LPL, EU LCS & IWC).\n\nDavor gab es eine Abstimmung für verschiedene Champions, welcher einen Skin erhalten soll (entsprechend des Gewinnerteams). Diese Champions waren Teemo, Diana und ein Champion, der mir leider entfallen ist. Diana hat diese Abstimmung gewonnen und bekam nun den Skin mit dem Thema des Gewinnerteams, also Team Feuer.\n\nFalls du noch Fragen hast, stehe ich dir gerne zur Verfügung. :)\n{{sticker:slayer-jinx-catface}}","replies":[{"poster":"nomiS 4 eva","date":"2016-04-20T19:17:58.509+0000","up_votes":1,"down_votes":0,"body":"Danke für die Info. Hatte das Event zwar mitbekommen, wusste aber nichts von dem Skin :)","replies":[]},{"poster":"Life Mark","date":"2016-04-20T14:00:43.832+0000","up_votes":1,"down_votes":0,"body":"Nautilus wenn ich mich recht erinnere^^","replies":[]}]},{"poster":"Im a Papaya","date":"2016-04-20T13:10:59.781+0000","up_votes":2,"down_votes":0,"body":"Vel'Koz ist ein Psychopatisches, wissbegieriges Monster aus einer finsteren Zwischenwelt .\nHat einen Skin der ihn als heiliges, gottgleiches Wesen dastehen lässt mit entsprechender Hintergrundgeschichte.\nAlso sieht man das ein Skin nicht gerade zum Champ passen muss, auch wenn ich gerade die Ironie an diesen Skin so zu schätzen weiß.","replies":[{"poster":"nomiS 4 eva","date":"2016-04-20T19:19:37.619+0000","up_votes":1,"down_votes":0,"body":"Ich hab ja auch eine Option gegeben bei der man eben diese Ironie oder Konflikt (wie ich es genannt habe) schätzt :)","replies":[]}]},{"poster":"Humpelstilzche","date":"2016-04-20T12:49:38.517+0000","up_votes":2,"down_votes":0,"body":"Skins haben grundsätzlich keinen Bezug zu der Lore.\n\nedit: Bzw etwas korrekter: Skins haben keinen Bezug zur \"Standard\"-Lore. D.h. manche gehören zu einer Art alternativen Lore (z.B. Swain als junger Mann oder Kassadin bevor er in Kontakt mit der Leere kam), andere dagegen zu einer völlig abgedrehten und sinnfreien Lore (so ziemlich alle lustige/alberne Skins). ","replies":[{"poster":"nomiS 4 eva","date":"2016-04-20T19:21:24.818+0000","up_votes":1,"down_votes":0,"body":"Ich dachte vielleicht, dass aber gerade bei diesem Skin der gegensatz zur entstehung beigetragen hat. Aber es stellt sich raus, dass es ein Event war der uns diesen Skin beschert hat :P","replies":[]}]},{"poster":"Ahri a Stark","date":"2016-04-24T19:40:39.242+0000","up_votes":1,"down_votes":0,"body":"Die Umfrage ist witzig, man kann gar nicht gegen den Skin voten","replies":[{"poster":"nomiS 4 eva","date":"2016-04-25T20:20:41.223+0000","up_votes":1,"down_votes":0,"body":"ich bin davon ausgegangen, dass man nicht einfach gegen einen Skin ist. Sollte er jemandem nicht gefallen ignoriert man ihn einfach( siehe: \"ist mir relativ egal\"). Aber andere Optionen, wie die einen ähnlichenSkin  für andere Champs (hier Leona) zu entwerfen, hatte ich berücksichtigt. In dem Glauben es würde allen genuge tun :)\nIch hoffe doch du hast nichts gegen den Skin xD\nWenn dem so ist kauft man ihn schlicht nicht. Aber ich denke doch du verstehst warum ich die Auswahl nicht gegeben habe :)\n\nLG Simon {{sticker:slayer-jinx-catface}}\n\n","replies":[]}]},{"poster":"Cayce","date":"2016-04-20T13:39:04.558+0000","up_votes":1,"down_votes":0,"body":"Ich muss sagen, ich mag den Skin nicht so sehr, aber weniger weils net zur Lore passt, sondern weil er mir optisch nicht gefällt. Fand aber damals die Champs bei der Abstimmung eher meh, gerade für Feuer. EU hätte mal carrien sollen! xP","replies":[]},{"poster":"Sihari","date":"2016-04-20T12:44:34.728+0000","up_votes":1,"down_votes":0,"body":"Nun ja, der Skin wurde ein Feuerskin, weil Team Feuer im Feuer gegen Eis-Turnier gewonnen hat.\nDavor konnte man abstimmen, welcher Champion einenn neuen Skin bekommen soll. Diese Abstimmung hat Diana gewonnen, weswegen es jetzt diese Kombination gibt.","replies":[]}]}