{"poster":"Señor W1z","date":"2015-02-09T18:11:03.724+0000","title":"Cana die Beschützerin der Wölfe","subforum":"Skin- & Champion-Konzepte","up_votes":5,"down_votes":2,"body":"Hallo dies ist ein weiteres Championkontzept von mir Cana die Beschützerin der Wölfe.Sie soll ein Ap jungler bzw. ein Ap Bruiser sein weil es kaum Ap Bruiser In League of Legends gibt. Obwohl sie ein Ap Champion ist soll viel mit Autoatacks arbeiten. Canas charackter soll so aussehen wie eine durchschnittliche Frau wie auf dem Bild was hinzugefügt habe. sie kämpft mit 2 Wölfen sie heißen Luna und Dextro \r\n\r\nGrundwerte\r\n\r\nLeben: 590,2 (+90 pro Level)\r\nLebensregeneration: 4,28 (+0,4 pro Level)\r\nMana: 281 (+45 pro Level)\r\nManaregenaration: (+0,6 pro Level)\r\nAngriffsschaden: 60 (+3 pro Level)\r\nAngriffstempo: : 0,67 (+2,9 pro Level)\r\nRüstung: 28,20 (+2,7 pro Level)\r\nMagieresistenz (+1,25 pro Level)\r\nReichweite: 150\r\nLauftempo: 350\r\n\r\n\r\nFähigkeiten:\r\n\r\nPassive: Jeder erste normale Angriff auf einen Champion beschwört einen Wolf (Luna) der einen Angriff ausführt der 50/80/110/140/170/200/230 + 0,7 Ap\r\nAbklingzeit: 10 sekunden pro Ziel\r\n\r\nQ: Cana führt einen verstärkten normalen Angriff aus der 60/80/110/150/180+ 0,6 ihrer Fähigkeitstärke als magischen Schaden verursacht und Beschwört ebenfalls einen anderen Wolf (Dextro) dieser macht die Hälfte des Schadens seiner passiven. Wenn jedoch Canas Q ihr erster nomarler Angriff auf ein Ziel ist beschwört er beide Wölfe (wegen seiner passiven und der Q) und halt den Gegner für 10/10,2/1,5/2,0 sekunden\r\n Abklingzeit: 7/6/5/4/4\r\n\r\nW:\r\npassiv: die Magieresistenz aller Gegner in der Umgebung ist um 10/20/30/40 Reduziert\r\n\r\nAktiv: Alle folgenden Fähigkeiten und normale Angriffe in den nächsten 2/3/4/5 sekunden hinterlassen klaffende Wunden die 1% des maximalen Lebens des Ziels als magischen schaden über 1 sekunde verursacht und heilt sich um diesen. Abklingzeit: 15/13/12/11/10\r\n\r\nE: Schickt einen Wolf  in eine Bestimmte Richtung wenn dieser ein Ziel trifft, verursacht er 50/70/100/150/190 + (0,55%) ihrer Fähigkeitsstärke als magischen Schaden. Beim Reakivieren dieser Fähigkeit teleportiert sich Cana an der Ort wo der Wolf gerade ist (der Wolf kann durch Wände laufen) Reichweite: 700  Abklingzeit: 20/18/16/14/11\r\n\r\nR: Canas normale Angriffe machen in den nächsten 5/6/7 zusätzlich (0,3/0,35/0,4) von Canas Fähigkeitsstärke als zusätzlichen magischen Schaden Abklingzeit: 60/50/40\r\n\r\nGeschichte: \r\nIn ihrem Dorf galt Cana immer als normales Kind  doch niemand wußte ihr dunkles Geheimniss ihr Vater war ein Diener der Lissandra und so verärbte er ihr ein bisschen seiner Magie Cana konnte mit Tieren sprechen und konnte Bruchteile der Magie. Als sie geboren wurde floh er mit seiner Familie aus der Dienerschaft der Lissandra auf der Flucht starb Canas Mutter so das ihr Vater sie alleine groß ziehen musste er brachte ihr bei bruchteile der Magie zu beherschen. Doch irgendwann verschwand ihr Vater einfach so und als dann noch im Dorf raus kam das Cana Magie beherschte wurde sie im Dorf verachtet und verjagt als sie in der Wildnis kein Essen hatte wurde sie von drei Wölfen aufgefunden und auf gezogen von einer Wolfmutter und zwei Wolfsjungen. und so wuchs sie auf und übte das Kämpfen mit den Wölfen. Als sie erwachsen war nahm sie sich vor ihre Vater zu finden un so tritt sie der Liga der Legenden  um imformationen über ihren Vater zu bekommen.\r\n\r\n\r\nTipps mit Cana:\r\nBei einem Gank sollte man darauf achten das der erste Normale Angriff ein Q ist damit es ein effektiver Gank wird\r\nMan sollte im jungle am anfang sehr viel Hilfe verlangen da man nicht viel sustain hat\r\n\r\nTipps gegen Cana\r\n\r\nMan sollte sich nie von der passiven + Q  combo treffen lassen\r\nMan kann sie early leicht counterjunglen das sie kaum sustain im jungle hat","replies":[{"poster":"carsten1","date":"2015-02-10T00:01:13.650+0000","up_votes":1,"down_votes":0,"body":"Super Konzept ! \nRespekt ! :) \nKönnt mir den Champion gut vorstellen in der Kluft soweit er \nzumindest nicht so OP sein würde . \nSo'n Ap-jgler fehlt mir auch . Großes Lob ! :)\n(Ich würd die Kopfbedeckung ändern , andere fellfarbe eher Dukel oder nur Haare .\nAber da gibts ja meinungsverschiedenheiten von daherr . )\n\nMfg . Carsten","replies":[{"poster":"Señor W1z","date":"2015-02-10T05:45:01.438+0000","up_votes":2,"down_votes":0,"body":"Sehe ich genauso es gab aber kein passendes Bild deswegen habe ich das genommen","replies":[]}]},{"poster":"Youngersfield","date":"2015-02-09T18:54:48.515+0000","up_votes":2,"down_votes":0,"body":"So an sich keine schlechte Idee. Aber das was hier beschrieben wird ist viel zu krank OP. Wenn man das zusammenfasst hat sie: \n1) Einen nicht zu unterschätzenden burst dmg.\n2) Ein sehr guten Sustain. (auf der lane)\n3) Einen recht netten Burst gegen tanks.\n4) Ein recht gutes ap scaling und Magic resi shredder. \n5) ein moderates Laufspeed\n6) Hohe mobility\n7) und soll tanky sein?\n\nSry aber ein Champ hat immer stärken und schwächen. Zb. Yi einen sehr hohen dmg output aber kein CC\noder Ziggs eine hohe range dafür aber keinen Burst ( sofern nicht gefeedet natürlich)\nBei ihr sehe ich aber Nur + sie hat sowohl range um nicht gepoked werden zu können ohne gegenwehr als auch cc mobilty und hohen burst.\nUnd Sustain ( wenn Top o Mid gespielt, was bei Ihrem skillset einfach echt geil wäre)\nDas ist schlichtweg zu viel.","replies":[{"poster":"Señor W1z","date":"2015-02-09T18:56:59.129+0000","up_votes":1,"down_votes":0,"body":"das kann sein aber sie soll ein jungler werden und den sustain braucht sie in jungle","replies":[{"poster":"Youngersfield","date":"2015-02-14T11:55:14.455+0000","up_votes":1,"down_votes":0,"body":"Genau da liegt dein Denkfehler. Sie ist als jungler VON DIR geplant. Nur weil du es so möchtest, wird sich die Community aber nicht daran halten. Wenn gemerkt wird \"Hey die hat einen burst CC un Sustain\" wird jeder erstmal sagen. Okay fk jungeln ich geh mid/top mid Ihr.","replies":[]}]},{"poster":"Señor W1z","date":"2015-02-09T21:05:17.537+0000","up_votes":1,"down_votes":0,"body":"Bedenke aber sie ist ein nahrkämpfer und jungler sie wird es nacher im Team fight auch nicht gerade leicht haben","replies":[]},{"poster":"Nekrodex","date":"2015-02-09T19:57:04.749+0000","up_votes":1,"down_votes":0,"body":"Ich kann dir nur recht geben so ein champ wäre viel zu op aber die idee und das konzept findesehr gut.","replies":[]}]},{"poster":"TheUnknown98","date":"2015-03-21T22:28:15.888+0000","up_votes":1,"down_votes":0,"body":"Ja! Und bitte mit Special taunt zu Warwick","replies":[]},{"poster":"X4LiF3","date":"2015-03-21T22:24:40.455+0000","up_votes":1,"down_votes":0,"body":"Extrem Geil 1^^","replies":[]},{"poster":"BananaMuffin12","date":"2015-02-16T19:36:41.653+0000","up_votes":1,"down_votes":0,"body":"Sie könnte ja Nidalee ihre Schwester sein :D{{champion:76}}","replies":[]},{"poster":"Freefall013","date":"2015-02-14T21:38:24.005+0000","up_votes":1,"down_votes":0,"body":"Ist meiner Meinung nach eine gute Idee, sehr Kreativ! Vielleicht müsste das Balancing ihrer Fähigkeiten noch etwas angepasst werden, ansonsten wäre es aber ein Champ, den es so in League noch nicht gibt. \n\nOb der Champ zu stark wäre kann ich nicht richtig beurteilen, die Idee finde ich jedoch sehr gut :)","replies":[]},{"poster":"Señor W1z","date":"2015-02-14T21:27:03.555+0000","up_votes":1,"down_votes":0,"body":"stimmt auch wieder","replies":[]},{"poster":"X4LiF3","date":"2015-02-13T15:04:06.648+0000","up_votes":1,"down_votes":0,"body":"not bad.{{champion:266}}","replies":[]},{"poster":"CP IR3PTiL3I","date":"2015-02-10T00:06:06.506+0000","up_votes":1,"down_votes":0,"body":"Ich finde die Passiv von der W ein bissen übertrieben 40 auf maximaler stufe aber sonst gute überlegung","replies":[{"poster":"Señor W1z","date":"2015-02-10T05:47:01.608+0000","up_votes":1,"down_votes":0,"body":"Es sollen 40 sein nich 40% den Wert zieht auch das höllenzepter ab","replies":[]}]},{"poster":"Miscalculated","date":"2015-02-09T18:47:02.174+0000","up_votes":1,"down_votes":0,"body":"Hallo princeFire,\n\nerstmal ein Lob and die Championidee und deine Kreativität.\nSolch ein Champion in League of Legends könnt ich mir gut vorstellen.\n(Selbstverständlich müssen/sollten paar Änderung vorgenommen werden bezüglich  der Grundwerte und Steigerungen)\n\nMit freundlichen Grüßen\n\nxRekt by Jason\n","replies":[{"poster":"Señor W1z","date":"2015-02-09T18:48:27.502+0000","up_votes":1,"down_votes":0,"body":"danke dachte ich mir auch man brauch einen Ap jungler der auch gleichzeitig ein bruiser ist in LoL","replies":[]}]},{"poster":"Kaisa94","date":"2015-02-09T18:21:58.176+0000","up_votes":1,"down_votes":0,"body":"Hört sich gut an :) Hier und da müssten natürlich noch Änderungen vorgenommen werden aber ich finde die Idee an sich schon nicht schlecht ;) Denke aber dass du dich bei dem Angriffstempo bei der Level-Skalierung vertan hast :P","replies":[{"poster":"Señor W1z","date":"2015-02-09T18:34:41.107+0000","up_votes":1,"down_votes":0,"body":"ok danke","replies":[]}]}]}