{"poster":"CyTék","date":"2016-01-17T16:44:25.887+0000","title":"Championvorschlag: Lice, der cybernetische Krieger","subforum":"Skin- & Champion-Konzepte","up_votes":2,"down_votes":2,"body":"Ich habe mir ein paar Championvorschl&auml;ge durchgelesen und an Hand vorhandener Champions die Stats und Attacken einer eigenen Figur erstellt.\nich w&uuml;rde gerne wissen ob dieser Champion zu op w&auml;re und Verbesserungsvorschl&auml;ge h&ouml;ren.\n\nName: Lice, der cybernetische Kopfgeldj&auml;ger\nHerkunft: Unbekannt\nAngeh&ouml;rigkeit: Keine\nSpezies: Cyborg (Halb-Mensch)\nLane: Jungle/Top-Lane (Spells    {{summoner:4}} {{summoner:11}}    ODER    {{summoner:4}} {{summoner:12}} )\nPrim&auml;re Rolle: Assasine\nSekund&auml;re Rolle: K&auml;mpfer\nWaffen: Schwert, Transformierbare Pistole\nFeinde: {{champion:115}} {{champion:74}} \nFreunde: {{champion:112}} {{champion:27}} \nStats:\n\nLeben: 718(+83)\nLebensregeneration: 6,13 (+0,8)\nMana: 345,48 (+36)\nManaregeneration: 6(+0,9)\nReichweite: 175\n\nAngriffschaden: 53,278 (+4,1)\nAngriffsgeschwindigkeit: 0,682 (+3,1%)\nR&uuml;stung: 34,14 (+2,8)\nMagierresistenz: 25(+0)\nLauftempo: 345\n\nF&auml;higkeiten:\n\nNormale Attacken sind Nahkampfattacken mit seinem Schwert\n\nPassive (Elektronisches Schild):\nWenn Lice unter 100 Leben ger&auml;t aktiviert er sein Energieschild, dass ihm +75 R&uuml;stung und +3 Lebensregeneration f&uuml;r 5 Sekunden gew&auml;hrt.\nAbklingzeit: 30s\n\nQ (Luftschuss):\nLice zielt auf einen Gegner, macht einen Raketenflug (fliegt mit seinen Raketenschuhen, siehe E) in die Luft schie&szlig;t auf das Ziel und verursacht 20/30/40/50/60\nphysikalischen Schaden und fliegt auf den Gegner zu, landet neben ihm und verursacht mit seinem Schwert zus&auml;tzlich 5% seines Angriffschadens als magischen Schaden.\nLice&#039; Luftschuss kann durch Stuns unterbrochen werden und er kann w&auml;hrend er in der Luft ist von Fernk&auml;mpfern angegriffen werden. Knockups, wie Alistars Sto&szlig; in den Boden,\nunterbrechen seinen Luftschuss nicht.\nManakosten: 30/40/50/60/70\nAbklingzeit: 10s/9s/8s/7s/6s\nReichweite: 550\n\nW (Schlitzschlag):\nLice schwingt sein Schwert, bewegt sich schnell in die gew&auml;hlte Richtung und schlitzt getroffene Gegner auf, verursacht dadurch 50/80/110/140/170 physikalischen Schaden\nund getroffene Gegner werden f&uuml;r 3 Sekunden um 40% ihres Lauftempos verlangsamt.\nManakosten: 50/60/70/80/90\nAbklingzeit: 13s/11,5s/10s/8,5s/7s\nReichweite: 475\n\nE (Raketenflug):\nLice aktiviert seine Raktenschuhe und fliegt damit an den gew&auml;hlten Zielort. An dem Ort an dem er seinen Raketenflug aktiviert, bleibt nachdem er losfliegt f&uuml;r 2 Sekunden\nein kleines Feuerfeld das, wenn ein Gegner darin steht 50/60/70/80/90 magischen Schaden &uuml;ber 3 Sekunden verursacht.\nWenn er landet entsteht eine kleine Schockwelle mit der Reichweite 300, die 30/40/50/60/70 physikalischen Schaden verursacht und das Lauftempo\ngetroffener Gegner f&uuml;r 1,5 Sekunden um 30% verringert. W&auml;hrend Raketenflug kann er nicht verlangsamt werden und nicht gestunt werden.\nManakosten: 60/65/70/75/80\nAbklingzeit: 20s/18s/16s/14s/12s\nReichweite: 990\n\nR (Transformation)\nLice Transformiert seine Pistole in eine cybernetische Windklinge, diese Windklinge bleibt f&uuml;r 60 Sekunden (oder l&auml;nger), au&szlig;er sie wird durch benutzen der transformierten R fr&uuml;her entfernt.\nW&auml;hrend er diese aktiviert hat erh&auml;lt er 4 neue Attacken\nManakosten: 50\nAbklingzeit: 60/45/30 (wenn die Ultimate nur f&uuml;r 60 Sekunden h&auml;lt ist die Abklingzeit die doppelte)\n\nQ - Transformiert (Elektronische Drehung)\nLice dreht sich 2 Mal im Kreis w&auml;hrend er seine Klingen um sich herumh&auml;lt (er dreht sich und schlitzt die Gegner dabei auf) jede Drehung f&uuml;gt jedem getroffenem Gegner\nim Umfeld 30/40/50/60/70 physikalischen Schaden zu.\nManakosten: 25/40/55/70/85\nAbklingzeit: 10s/9s/8s/7s/6s\nReichweite: 300\n\nW - Transformiert (Raketenschub)\nLice schie&szlig;t nach vorne und schl&auml;gt drei Mal in die ausgew&auml;hlte Richtung. Jeder getroffene Schlag macht 80/110/140/170/200 physikalischen Schaden.\nManakosten: 50/60/70/80/90\nAbklingzeit: 13s/11,5s/10s/8,5s/7s\nReichweite: 800\n\nE - Transformiert (Raketenflug mit Schlag)\nWie der Name schon sagt ist dies einfach nur ein Raketenflug der bei der Landung eine Elektronische Drehung ausf&uuml;hrt,die 30/40/50/60/70 zus&auml;tzlichen physikalischen Schaden\nzu.\nManakosten: 70/75/80/85/90\nAbklingzeit: 16/14/12/10/8\n\nR - Transformiert (Elektronischer Wurf)\nLice wirft sein transformiertes Schwert in eine gew&uuml;nschte Richtung, welches wenn es trifft 200/400/600 magischen Schaden verursacht und den Gegner um 20% seines Lauftempos\nf&uuml;r 3 Sekunden verlangsamt. Reaktiviert Lice diese F&auml;higkeit fliegt er zu diesem Gegner hin, verliert jedoch seine Windklinge und dadurch auch seine neuen Attacken.\nManakosten: 80/90/100\nAbklingzeit: 60/45/30\n\nLice&#039; Geschichte:\n\n(Dieser &quot;Mann&quot; in dieser Geschichte wird vielleicht auch noch als Championvorschlag eingesendet.)\nLice war einst ein normaler Mensch, doch durch seine einsame Kindheit in den Slums von Zaun wurde ihm gezeigt, dass es nicht immer einfach ist zu &uuml;berleben. Als er erwachsen wurde, wurde er auf einmal mitten in Zaun angegriffen von einem sehr gerissenen Krieger, der ihn mit der Kraft der Geschwindigkeit besiegte. Lice jedoch wehrte sich, schlug den Krieger nieder und schlug ihn bewusstlos. Er brachte ihn jedoch nicht um, denn er wollte wissen wer dieser Mann war. Es stellte sich heraus, dass es ein Auftragskiller war, der ihn umbringen sollte, da Lice gef&auml;hrlich f&uuml;r den Auftraggeber werden k&ouml;nnte. Lice verzieh dem Killer und sie wurden langsam Freunde (&uuml;ber mehrere Tage). Der Mann brachte ihm das k&auml;mpfen mit Waffen bei und mit Lice mechanischer Begabung baute er ein Schwert und eine transformierbare Pistole. Er wurde immer brutaler und kaltbl&uuml;tiger, letzendlich wurde er sogar zu einem Auftragskiller. Der Mann und Lice taten sich zusammen und sie gr&uuml;ndeten die sogenannten Speed-Warriors. Sie k&auml;mpften beide gemeinsam und nutzten ihre Geschwindigkeit und ihre Auftr&auml;ge leichter auszuf&uuml;hren. Eines Tages bekamen sie den auftrag einen Yordle in Bandle City umzubringen. Sie wurden vom Auftraggeber gewarnt, dass es explosiv werden k&ouml;nnte. Die beiden ignorierten ihn und begannen mit ihrem Anschlag auf den Yordle. Sie hatten alles geplant und es lief perfekt, sie waren kurz davor ihn in eine Falle zu locken als der Yordle pl&ouml;tzlich durch einen Bewegungssensor erschreckt wurde. Er bemerkte, dass er verfolgt wurde und sah Lice, der auf den Yordle zust&uuml;rmte. Der Yordle warf im letzten Moment eine Bombe, die Lice im Gesicht erwischte. Sein ganzer K&ouml;rper war zerst&ouml;rt. Der Yordle entkam und der Mann brachte Lice in seinen Unterschlupf er fand eine Heilstation steckte ihn hinein und aktivierte sie, die Maschine machte Lice zu einem Cyborg, um ihn am Leben zu erhalten. Lice wachte nach ein paar Tagen wieder auf, doch er war nurnoch auf Rache aus. Er wollte diesen Yordle t&ouml;ten.\n\n\n\nPS: Die Reichweite ist nach der Einheit der Wiki gemacht und die Leben anhand von anderen Toplanern gemacht, also dürfte dies nicht zu OP sein. (Falls jemand dies nicht glaubt, der soll auf die Wiki schauen)","replies":[]}