{"poster":"Ðoyle","date":"2016-01-14T15:31:02.278+0000","title":"Warsong Album lags","subforum":"Hilfe & Support","up_votes":3,"down_votes":0,"body":"Hi,\nich hab das Problem, dass mein Ordner des Warsong Album am laggen ist. Mehrere meiner Freunde haben dies auch. Beim &ouml;ffnen oder markieren der Lieder h&auml;ngt sich der Ordner auf und erst nach wenigen Minuten kann man es weiter benutzen, danach lagt es trotzdem weiter. Ich bezweifle das es an meinen / unseren Rechnern liegt.\nBtw, die Songs sind euch echt gelungen, props!{{item:3052}} \nMfG","replies":[{"poster":"îts a god","date":"2016-01-16T11:33:49.341+0000","up_votes":1,"down_votes":0,"body":"Ich habe das gleiche Problem und habe mal etwas ausführlicher getestet:\n\nWenn ich den Ordner im Windows-Explorer öffne, hängt sich dieser für ein paar Minuten auf, bevor er den Ordnerinhalt anzeigt.\nWenn man sich die Dateien allerdings in der Konsole (Eingabeaufforderung) auflisten lässt, tritt das Problem nicht auf.\nIch habe mir die Dateien spaßhalber auch mit dem 7zip-Filemanager anzeigen lassen, auch hier funktioniert das ohne Probleme.\n\nBei den Abspielprogrammen hat sich bei mir der Windows Media Player ebenfalls aufgehangen (er Spielte zwar die Musik ab, aber Eingaben haben eine Weile gebraucht um ausgeführt zu werden).\nDer VLC Media Player, sowie der MPV spielten die Dateien ohne Probleme ab.\n\nZuletzt ist mir aufgefallen, dass wenn man die Dateien auswählt, sich die Eigenschaften anzeigen lässt und das \"Details\"-Register auswählt, braucht es wieder eine Weile, bis die Details angezeigt werden.\n\nIch denke, dass es ein Fehler unter Windows ist, dass die Meta-Daten nicht richtig ausgewertet werden können. Villeicht passiert das auch nur in Windows 10 Systemen (das ist jetzt eine Vermutung, da ich selbst ein Windows 10 am laufen habe). Vielleicht könnt ihr ja mal schreiben, welches Betriebssystem ihr verwendet um zu sehen, ob nur Windows 10 Benutzer betroffen sind, oder dieses Problem bei allen auftritt.\n\n-- KillaHobbit","replies":[{"poster":"Zefiiel","date":"2016-01-16T12:00:39.877+0000","up_votes":1,"down_votes":0,"body":"ich hab auch Win 10. Klingt also sehr logisch. hab die Songs auch auf den handy und da kann ich sie normal auswählen.","replies":[{"poster":"Dymence","date":"2016-01-16T14:29:58.179+0000","up_votes":2,"down_votes":0,"body":"Nein, es ist leider nicht nur ein Windows 10 problem. Ich benutz Windows 7 und hab genau dasselbe Problem.","replies":[{"poster":"Ðoyle","date":"2016-01-18T15:44:34.806+0000","up_votes":1,"down_votes":0,"body":"Bei Windows 8.1 läufts auch nicht.","replies":[]}]}]}]},{"poster":"Danimineiro","date":"2016-01-14T19:25:29.571+0000","up_votes":2,"down_votes":0,"body":"Habe dasselbe Problem. Wenn ich versuche das Album zu öffnen friert der Windows Explorer ein stürzt komplett ab und startet dann neu. Wenn ich dann das Album öffne ist mein ganzer Pc langsam.","replies":[]},{"poster":"Zefiiel","date":"2016-01-16T00:41:54.230+0000","up_votes":1,"down_votes":0,"body":"Same here. Mein Media Player raucht komplett ab und wenn ich versuche die Lieder neu rein zu packen dauert das ewig und hängt sich die ganze zeit auf.\nDie Lieder sind Hammer geil. hoffe das es irgendwie gefixt werden kann..","replies":[]}]}