{"poster":"BVB09","date":"2019-07-10T21:41:04.904+0000","title":"Item- Glück","subforum":"Teamfight Tactics","up_votes":1,"down_votes":0,"body":"Ich finde das Item System ist ziemlich Glücklich , mannchmal bekommt man bei denn anfangs Vasallen 5 und mannchmal 0.. Ich wäre dafür das fest zu setzten wieviele man bekommt.. z.b : 1 vasallen Welle immer 1 Item nach Zufall , 2 Welle immer 1 Item und 3 Welle immer 2 Items.. In denn dazwischen gesetzten Wellen immer 2 Items und bei Drachen und co 1 besonderes Item.. Ist nur ein Beispiel , aber dann ist es halt fairer.. Alternativ in der 2 Welle 2 items und in der 3 anfangs Welle 3 Items , das wäre meiner Meinung nach aber zuviel des guten.. Als zusätzliche alternative immer mindestens 1 Item und der rest ist zufall.","replies":[{"poster":"611FVNKBlv","date":"2019-07-10T22:08:54.213+0000","up_votes":3,"down_votes":0,"body":"Die Diskussion um die Itemvergabe wird noch lange herrschen , irgendwo auch berechtigt aber letzendlich gewinnt man nicht nur durch items. Irgendwo finde ich ist genau das die Herausforderung die ich suche. Wie du den anfänglichen Nachteil zu deinen Gunsten drehst. \n\nAllerdings fände ich es ebenfalls durchaus fair wenn zumindest 1 Item innerhalb der 3 Wellen garantiert droppt. Mehr items kann aber gerne glückssache bleiben.","replies":[{"poster":"RM Heartmeander","date":"2019-07-10T22:42:53.857+0000","up_votes":1,"down_votes":0,"body":"Na ja wenn es so geht wie bei mir, dann hast du keine Freude mehr.\nDu startest mit einem Item und kriegst eines, dass dir nicht's bringt (wie z.B. ionic Spark).\nDazu kriegst du dann von jeder Einheit immer nur 2 und kannst keine auf 2 Upgraden.\nDas geht dann so lange, bis du bei den Krugs bist und trotz richtiger Aufstellung durch schlechten Roll nicht's hast und gegen die Krugs verlierst wo noch 2 überleben und du keine Items kriegst und gammelst dann mit 1 Item rum während andere schon 3 haben.\n\nDa ist nicht's mehr mit zurückkommen.","replies":[{"poster":"II3RDB4NG","date":"2019-07-11T04:38:49.480+0000","up_votes":2,"down_votes":0,"body":"Ja, bis zum patch nächste Woche wird das so bleiben.\nIst gewollt, kp warum, lasst uns künstlich ein Mega Frustrationslevel aufbauen.","replies":[]},{"poster":"611FVNKBlv","date":"2019-07-11T13:11:05.095+0000","up_votes":1,"down_votes":0,"body":"da ist nichts mehr mit zurückkommen? 80% meiner TfT-Runden laufen genau so ab. Nutze den Goldvorteil den du so erhälst einfach clever aus :) Durch die Losingstreak die du so höchstwahrscheinlich hast darfst du in der pickphase IMMER firstpicken was ultrastark sein kann. Durch die Losingstreak erhälst du IMMER extragold. Spar auf über 50 an für Zinsen . Steck alles in shoplvl zb  und gewinne dadurch das du mehr aufstellen kannst und somit mehr boni erhalten kannst. außerdem kommst du so früh an stärkere champs als die anderen was dir am ende sogar n t3 draven/yasuo etc ermöglicht. Wenn du nicht durch Items gewinnst dann gewinnst du anders :) ","replies":[]}]},{"poster":"Alustus","date":"2019-07-11T02:40:07.702+0000","up_votes":1,"down_votes":0,"body":"Naja die Items entscheiden am einem gewissen Niveau dann über sieg und niederlage.\nZumal die Items auch sehr stark sind ein Stufe 1 Champ kann mit 3 Items einen Stufe 3 Champ im 1v1 besiegen, das hat einfach zuviel einfluss.\nDas kannst du nicht wirklich ausgleichen.\n\nDie Herasuforderung hast du ja immer noch wenn du nicht die Items bekommst die du willst/brauchst selbiges bei den CHamps.\nSprich das umdenken /strategie ändern würde weiterhin bestehen bleiben.\n\nNur macht es keinen Spaß wenn man selber mit Teamcombs arbeitet und einen Champ mehr hat und der gegner einen random haufen hat aber dennoch gewinnt einfach nur weil er doppelt soviele Items hat.","replies":[]}]},{"poster":"Staatsanwalt","date":"2019-07-11T09:42:45.862+0000","up_votes":1,"down_votes":0,"body":"Für mich wäre der beste weg, dass jede creep runde man eine auswahl an 3 items erhält. Und um den Glücksfaktor zu behalten, gibts eine chance von 5 Prozent auf eine zweite Runde.  So ist dass ganze ausgeglichener und man kann besser planen.","replies":[]}]}