{"poster":"WoadKethunt","date":"2017-02-13T02:09:07.922+0000","title":"Leveling up a new account","subforum":"Miscellaneous","up_votes":1,"down_votes":1,"body":"i&#039;ve been meaning to get my other account to level 30 for a while now but the normals games on it are so felesbadman every game is decided on if the enemy team has a smurf\r\n\r\ni just wanna know whats the fastest way to level it up is aram better or should i stick with normals i would rather not play coop since i played like a good 300-400 ai games to get my main account to level 30","replies":[{"poster":"Talon12","date":"2017-02-13T08:10:22.948+0000","up_votes":1,"down_votes":0,"body":"Blood moon is by far the best xp grind the game has seen in a long time, gaining the xp that you would gain from playing just a normal game (73 loss base and 129 win base xp) and games last 10 minutes on average.\n\nYou will earn xp approximately ~300% faster in blood moon for losses than you would playing a normal game and winning on average. Its the way to go to level up an account no questions asked.","replies":[]},{"poster":"JasonWazza","date":"2017-02-13T03:28:11.178+0000","up_votes":1,"down_votes":0,"body":"Personally when i leveled my second account to 30 i did co-op vs AI because outside of 4 bots (which could potentially lose the game) you would win nearly every game.\n\nARAM is full of bots, and normals is really mismatched below 30 (due to smurfs)","replies":[]},{"poster":"Desmond Miles","date":"2017-02-13T03:20:05.114+0000","up_votes":1,"down_votes":0,"body":"blood moon is giving pretty good ip and xp atm, if you wanna play blood moon ill be there","replies":[]},{"poster":"Wean","date":"2017-02-13T02:44:49.925+0000","up_votes":1,"down_votes":1,"body":"Are you saying that when you entered champion select, that if your teemmates could not tell whether if the enemy team has a smurf account or not some of them would dodge the queue or something? Or are you saying that after the champion selection if anyone in your team could not tell whether anyone in the enemy team has a smurf account they would just get away from the keyboard and not playing?\n\nIf that is the case why don't you just try a party mode?\nYou can do ARAM, but that's not the only thing.\nThere are rotating game modes like Ascension, Definitely not Dominion. Keep your eyes on these game modes and play them as much as you can.\nRemember that if you are under level 30, and you fight against someone who is already level 30, there may be a huge difference, it all depends on how many runes has been applied into a rune page.\nSmurf accounts does not make a champion stronger even if the player had experience with that champion before.","replies":[{"poster":"WoadKethunt","date":"2017-02-13T03:00:18.884+0000","up_votes":1,"down_votes":0,"body":"nah people dont dodge or afk anymore than in lvl 30 games im referring to a solo carrying riven whos acc is level 15 and shes playing like a diamond player or the 30/0 yasuo these players are playing much much better than there summoner level would suggest \n\nregardless i just want to know which game mode had the highest xp per hours gains","replies":[{"poster":"Wean","date":"2017-02-13T03:18:55.023+0000","up_votes":1,"down_votes":0,"body":"PVP would certainly let you gain more experience, however I cannot be certain that this game mode with grant you the highest xp. The longer you play, the more xp you get.\nYou can go and buy xp boosts using Riot points from the League of Legends store, this will give you more xp per game.","replies":[]}]}]}]}