{"poster":"Gomezzz","date":"2016-11-17T11:05:07.522+0000","title":"alguien que sepa sobre conexiones a internet y me saque una duda","subforum":"Problemas Técnicos","up_votes":2,"down_votes":0,"body":"hola quer&iacute;a preguntarles sobre algo y espero que me responda alguien que sepa del tema sobre las conexiones de wifi de internet, el tema es el siguiente yo soy de argentina y tengo 3 megas de velocidad la cual me cuesta alrededor de $650 pero ahora tengo una pc propia en mi pieza y la del comedor ya no la uso mas pero mi familia ve muchas peliculas desde esa misma pc durante todo el dia, y yo tengo temor de que cuando este jugando al lol  desde mi pc la computadora del comedor este en uso y eso me agarre mucho lag cosa que se me haga imposible jugar, asi que yo necesitar&iacute;a que me digan que cantidad de megas  necesitar&iacute;a para jugar al lol y no tener lag mientras mi familia miran peliculas o navegan por internet","replies":[{"poster":"wattefak","date":"2016-11-17T12:15:41.621+0000","up_votes":1,"down_votes":0,"body":"Creo que con 1mbps (= 1024kbps) asignado se juega sin lag (sino con 1,3-1,5 seguro). Dependiendo de tu router tendras que hacer lo siguiente:\n\n- Asignar direccion ip a tu pc (ej. 192.168.0.100)\n- poner un limite de velocidad (subida, bajada, puertos abiertos) a tu ip y hacer lo mismo para otras ip's que accedan al wifi (ej. 192.168.0.101-192.168.0.199). Para subida da igual que pongas para todos lo que te asigna tu proovedor (si no sabes pon 10000kbps y listo xD), lo que te interesa cambiar es la velocidad de bajada (pon lo que te sobre de lo que pusiste para ti completando los 3mb) . Los puertos tambien da igual que esten por defecto. (Si no te aparece esa opcion son del 1 al 65535 los que existen)\n\nEso es lo mas basico para poder jugar tranquilo, sabiendo eso ya puedes limitar velocidad y acceso a internet para cada dispositivo.Eso si tendras que googlear por pasos por que es diferente para cada marcas (y en algunos casos modelos) (yo tengo tp-link tl-wr741nd por si tienes alguna duda)","replies":[{"poster":"Gomezzz","date":"2016-11-17T16:26:37.431+0000","up_votes":1,"down_votes":0,"body":"es cierto que un router seria el principal y la diferencia con los demas router es que ese recibe mejor la señal de internet? por que si es asi entonces yo podria configurar mi router de la pieza para que sea ese el principal y no el que tengo en el comedor?","replies":[{"poster":"wattefak","date":"2016-11-17T22:43:46.828+0000","up_votes":1,"down_votes":0,"body":"Como? No te entendi bien a que te refieres, pero supongo que dices que tienes 2 routers (no(?)). Bueno, de ser asi tienes 1 que es repetidor de señal, con que modifiques el principal esta bien. Igual si quieres comprobarlo te conectas con el pc al repetidor y haces un test de velocidad. Si no funciona deben ser 2 routers independientes (aunque eso seria raro) por lo que toca repetir los procesos en el segundo. \nLa diferencia de calidad en conexion para el repetidor en una casa generalmente es minima, con que no tengas paredes demasiado gruesas e interferencias de canal (hasta hay apps de celulares para comprobarlo ej. Wifi analyzer)","replies":[]}]}]},{"poster":"ghost134","date":"2016-11-17T11:08:00.755+0000","up_votes":1,"down_votes":0,"body":"yo tengo 50 megas y otra compu que usa wifi. Si juego en que usa wifi al cabo e un rato el ping se me sube a 1000 y baja a 40. vos con 3 megas y de ahi wifi no me quiero imaginar.. es imposible que jueges usando wifi y que no tengas lag mientras toda tu familia use internet para ver peliculas.","replies":[{"poster":"Gomezzz","date":"2016-11-17T11:17:25.687+0000","up_votes":1,"down_votes":0,"body":"entonces la unica que me queda es jugar cuando no se este usando la otra pc?","replies":[{"poster":"mhcarrizo","date":"2016-11-17T21:55:11.183+0000","up_votes":1,"down_votes":0,"body":"como tecnico de fibertel, mi recomendación es que para jugar aumentes un poco el ancho de banda, y utilices un enlace ethernet para tu pc. no es para nada recomendable jugar utilizando un enlace wifi.","replies":[{"poster":"mhcarrizo","date":"2016-11-17T21:59:05.525+0000","up_votes":1,"down_votes":0,"body":"tambien se pueden aplicar restricciones para el uso del ancho de banda para la otra pc... pero es un poco mas complicado de configurar","replies":[]}]}]}]},{"poster":"Sonya Kyron","date":"2016-11-17T15:04:57.094+0000","up_votes":1,"down_votes":0,"body":"hola, con 3MB pordes hacer las 2 cosas y con 6MB también, el tema es que tenes que configurar todo para que:\n1- En el comedor no usen resoluciones HD, tienen que usar SD 480p\n2- Usar un router que permita funciones de restricción de ancho de banda etc.\n\nrecorda que el LOL solo necesita 70 KB/s para funcionar equivalente a casi 1/5 de la velocidad de internet de una conexión de 3MB.","replies":[]},{"poster":"MLCPWhatsApp","date":"2016-11-17T13:59:40.245+0000","up_votes":1,"down_votes":0,"body":"Mira, yo tengo fibertel, 6 mb, pago 1200 por mes con el televisor +HD, ... y juego al lol perfecto, PERO, cuando alguien entra con su celular o computadora, etc, y abre YOUTUBE o se pone a bajar algo... GG IZI, los MS me suben a 700 900 .1000, una locura...","replies":[]},{"poster":"Ji ji ji","date":"2016-11-17T11:35:15.404+0000","up_votes":1,"down_votes":0,"body":"sino hace como yo, cuando juego al menos una partida le cambio la contraseña al wifi o el AP ajjaja","replies":[]},{"poster":"Ji ji ji","date":"2016-11-17T11:34:18.717+0000","up_votes":1,"down_votes":0,"body":"pedi otra bajada de internet, sino siempre vas a renegar, es lo mas facil, pedi 1 mb nomas lo mas barato, nomas para el juego o los juegos online, despues la otra dejala para descargar, ver peliculas, etc","replies":[]}]}