{"poster":"Señor Shíro","date":"2017-10-14T08:23:54.429+0000","title":"Impact als Top - Tank in low Elo (Silber-Platin)","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Ist es m&ouml;glich als Tank &gt;auf der Toplane&lt; impact zu haben und ein game zu carryn? Habe das Gef&uuml;hl als Tank bist du mega auf deine Mates angewiesen und hast keinen Einfluss auf all das, was nicht auf der Toplane passiert. Na klar man hat ja noch TP aber in low Elo ist es in den meisten F&auml;llen so, dass viele nicht wissen wie sie den TP am besten einsetzen. Daf&uuml;r braucht man gutes decisionmaking und Wissen dar&uuml;ber wo der Jungler ist, ob man mit dem TP was ausrichten kann, ob jetzt seine mates zu safen oder um was zu holen. Und dazu noch aufpassen dass die eigene Toplane nicht zu Grunde geht. \r\nDie einzige Option w&auml;re also irgendwie die eigene lane zu gewinnen. \r\n\r\nOder wie seht ihr das?\r\nBeispiele, Argumente etc. \r\nWie hat man als Tank auf der Toplane impact?\r\n{{sticker:poppy-wink}}","replies":[{"poster":"Pure Cynicism","date":"2017-10-14T08:56:49.744+0000","up_votes":2,"down_votes":0,"body":"Tank zu spielen bietet Meta-unabhänig verschiedene Vor- und Nachteile.\n\nZunächst die Vorteile: Du bist immer nützlich. Ein Champ wie Nautilus hat immer seinen CC, ob er 20-0 oder 0-20 steht. Er ist meist auch immer tanky genug, um seinen CC vor seinem Tod anbringen zu können. Zudem sind Tank Items immer günstiger als offensive Items. Nichts ist schlimmer, als eine 0-4 Riven zu haben, die nach 20 Minuten immer noch an ihrem ersten Item herumbastelt. Ihr spielt dann bis zu ihrem 3. Item 4-5.\nUm Impact zu haben, musst du entweder den gefährlichsten Carry der Gegner ablenken, bedrohen oder je nach Tank töten (Nautilus kann das nur selten, Mundo kann es ab und zu, Poppy kann es meistens - so mal als Beispiel). Oder - was viele vergessen - du kannst auch deinen eigenen Carry beschützen. Dein Adc ist 5-0, aber der gegnerische Zed ist auch 5-0? Dann halte deinem Adc den Zed mit deinem CC vom Leib und du wirst gewinnen.\nDu brauchst als Tank auch keine krassen Mechanics, Poppy gehört da mit ihrer W wohl noch zu den schwierigsten. Tanks sind vor allem für Spieler geeignet, die mehr im Kopf als in den Fingern haben, mal radikal ausgedrückt.\n\nUmgekehrt kannst du Spiele kaum alleine gewinnen. Ein Ausnahme mache ich hier wieder bei Tanks wie Poppy (ja, mein Lieblingstank auf der Top). Die kann die Lane gegen Champs wie Yasuo oder Riven easy gewinnen und bis zum späten Midgame noch alles solo töten, wenn sie Feed hat. Ansonsten bist du aber immer nur die CC-Maschine und der Fleischball. Wenn dein Team nutzlos ist, bist du es oft auch. Hatte schon Games, in denen ich zwar die Lane gewonnen habe, aber der gegnerische Adc so früh so fett war, dass ich nicht zwei Sekunden tanken konnte.\nHinzu kommt: Mit Champs wie Yasuo oder Riven kannst du deutlich schneller climben, wenn du mechanisch fit bist. Du gewinnst die Lane und kannst dann alles duellieren, im Midgame kannst du in 3 Gegner springen, 2 töten und entkommen.\n\nIn der aktuellen Meta ist es noch mal was anderes. Verliert deine Bot hart, kannst du als Tank schon fast afk gehen. Umgekehrt ist es ein free Win, wenn deine Bot gewinnt. Ist die Bot even, musst du eigentlich nur noch für den Hypercarry peelen und du gewinnst. Peel ist bis ins hohe Platin ein Fremdwort.\n\nZusammenfassend noch mal, natürlich nur meine Meinung: \n\nBist du mechanisch unsicher und willst dich langsam verbessern: Spiele Tank, nutze dein CC, peele gut und du wirst climben.\nBist du mechanisch sehr stark und willst schnell Elo bekommen: Spiele einen Carry, gewinne immer die Lane und snowballe.\n\nNoch ein letzter Hinweis: Ein mittelmäßig beherrschter Tank ist viel stärker als ein mittelmäßig beherrschter Carry. Um das beste aus beiden Welten zu vereinen, empfehle ich einen Champ mit Schaden, Tankyness und ein wenig CC. Da fallen mir ein: {{champion:122}} {{champion:86}} {{champion:420}} {{champion:39}}{{champion:24}}{{champion:58}} {{champion:62}}{{champion:2}} {{champion:59}} {{champion:240}} {{champion:48}} {{champion:83}}.","replies":[{"poster":"Señor Shíro","date":"2017-10-14T10:08:21.649+0000","up_votes":1,"down_votes":0,"body":"Danke für deine Antwort, war hilfreich! Hätte da aber noch 2 Fragen\n\n1. Peel sagt mir zwar was, aber viele bis Platin machen das höchstens unbewusst und haben nicht wirklich ein Bild davon, kannste da vielleicht 1 oder 2 Beispiele nennen? \n\n2. Mechanisch bin ich tatsächlich nicht sehr gut, brauche immer etwas mehr Zeit um die Situation zu überdenken und darauf zu reagieren. Mit champs wie bsp. Yasuo, Zed oder allgemein alle assasins und squishy fighter hab ich Probleme. Wollte sie zwar immer schon können aber ich denke zu langsam, wenn man mir aber Zeit gibt dann kommt was gutes bei raus :D\nJetzt meine Frage dazu: Kann man dieses \"auf die Sekunde wissen was man machen muss\" bzw. mechaniks lernen? Denke wenn man einen Champ ganz gut drauf hat kann man ihn blind und muss nurnoch auf die Situation achten. Im Prinziep wie Autofahren^^","replies":[{"poster":"Pure Cynicism","date":"2017-10-14T10:24:48.897+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Shirosuko,realm=EUW,application-id=Wj1wcocU,discussion-id=8xJGdMg9,comment-id=00000000,timestamp=2017-10-14T10:08:21.649+0000)\n>\n> Danke für deine Antwort, war hilfreich! Hätte da aber noch 2 Fragen\n> \n> 1. Peel sagt mir zwar was, aber viele bis Platin machen das höchstens unbewusst und haben nicht wirklich ein Bild davon, kannste da vielleicht 1 oder 2 Beispiele nennen? \n> \n> 2. Mechanisch bin ich tatsächlich nicht sehr gut, brauche immer etwas mehr Zeit um die Situation zu überdenken und darauf zu reagieren. Mit champs wie bsp. Yasuo, Zed oder allgemein alle assasins und squishy fighter hab ich Probleme. Wollte sie zwar immer schon können aber ich denke zu langsam, wenn man mir aber Zeit gibt dann kommt was gutes bei raus :D\n> Jetzt meine Frage dazu: Kann man dieses &quot;auf die Sekunde wissen was man machen muss&quot; bzw. mechaniks lernen? Denke wenn man einen Champ ganz gut drauf hat kann man ihn blind und muss nurnoch auf die Situation achten. Im Prinziep wie Autofahren^^\n\nZu 1: Nehmen wir wieder Poppy. Sie hat als Adc einen Hypercarry, die Gegner haben Zac und Yasuo. Im Normalfall wird Zac auf den Adc springen, Yasuo ulten und der Teamfight ist für dich verloren. Außer du stellst dich vor deinen Adc und blockst den Zac Engage mit deiner W. Zac wird dann komplett useless sein. Falls doch jemand zu deinem Adc vordringt, kickst du ihn mit der E weg, slowst ihn mit der Q. Hiflt das alles nichts, nutzt du deine Ult und haust sie in die Base. Jedem Spieler ist klar, dass das ein gutes Play  von Poppy ist, aber kaum jemand macht es bewusst. Wenn du das aber jedes Spiel machst, wirst du echt relevant sein. Das geht auch mit Nautilus, Maokai, usw. Mit Cho geht es teilweise auch. Viele Spieler in Bronze und Silber gehen davon aus, dass ihr Adc Crap ist und Peel daher nichts bringt. Dabei wird übersehen, dass die Gegner und sie selbst ja ebenso gut/schlecht sind. \n\nZu 2. Ich denke, das ist zwar möglich, aber das dauert ewig. Auch wenn du ein perfekter Yasuo Spieler bist, kannst du mit einem Missclick immer noch einen falschen Dash machen. Du musst dafür ja auch alle Match Ups kennen. Ich glaube nicht, dass es das wert ist. Du kennst die 80-20 Regel? Um ein Ziel zu 80% zu erreichen, musst du 20% der Zeit aufwenden, du die für die vollständige Zielerreichung brauchst. Daraus folgt, dass Perfektion 5x so viel Zeit benötigt. Wenn dir Yasuo usw. Spaß machen, hau rein. Aber wenn du mechanisch eh nicht so gut bist, würde ich dir davon abraten.","replies":[]}]}]},{"poster":"Kolivanne","date":"2017-10-15T12:28:29.939+0000","up_votes":1,"down_votes":0,"body":"**tanks/bruiser**\nich finde die championvorschläge von Ceiwyn gut, da sie alle in die richtung bruiser gehen. \ndu hast ein kernitem für schaden und kannst dann einfach tanky bauen, wenn es nötig ist.\n\nsmart pings sind wichtig, wenn du mit deinem champion kämpfe eröffnest, beispiel nautilus. sonst hälst du deine backen umsonst hin^^\n\n**die karte/ sicht auf herald und fluss**\ndamit dein TP global gut kommt, solltest du die karte im blick behalten. mit der zeit kannst du dann einschätzen, was der gegner wahrscheinlich tut.\nplatziere augen in der nähe des heralds oder im camp des roten buffs. sicht ist alles und erleichtert dir dann auch, ob sich ein TP lohnt oder nicht.\n\n**TP üben/ alternativen zu TP**\nspielst du einen bruiser, ist es manchmal vielleicht besser entzünden oder erschöpfen dabei zu haben, um deine lane zu gewinnen. machst du druck auf deiner lane, muss sich der gegner schon mal entscheiden, ob er sich um dein team oder dich kümmert. mit augen sorgst du dann dafür, dass sie alle ihre zeit bei dir oben verschwenden und dein team holt sich in der zeit türme und anderes tolles zeug.\n\nTP solltest du vor 6 erst mal nur für dich benutzen (du musst ja auch erstmal eine grundlage haben). in der zeit pingst du jedoch schon mal fleißig, dass deine anderen lanes dir augen zum porten bereitstellen.\nhast du cc und dein top lane gegner will sich TP? gib ihm saures mit cc und breche seinen TP ab! \nalle anderen situationen sind erfahrungen und hängen von den team kombis ab.\n\n**match ups/ eigene erfahrung**\ndenke, ein wichtiger punkt der dir hilft, ob nun TP nehmen oder nicht. kannst du deine lane allein gewinnen? bei nein nimm TP und behalte deine andere lanes im auge. ich habe {{champion:78}} eine zeit top gespielt, weil ihr w die combos vieler anderer kaputt macht und du durch das kit gut vor ganks geschützt bist.\nda ihr ultimate meinen spielstil jedoch nicht mehr unterstützt, habe ich sie fast nur noch als jungler gespielt^^\n\nam besten kann deine frage beantwortet werden, wenn du schreibst, auf welche champs du bock hast.\n\n{{sticker:sg-poppy}}","replies":[{"poster":"Señor Shíro","date":"2017-10-15T20:04:39.239+0000","up_votes":1,"down_votes":0,"body":"Danke erstmal :)\nAuf welche Champs ich bock hab, da habt ihr beiden erstmal ganz gut ins Schwarze getroffen, Poppy ist einer dieser Champs :D\nDazu kommen noch Gragas, Galio was Tanks angeht.\n\nBin aber momentan eh noch auf Spielstylefindung^^ \nHatte die ganze Season über Top gemaint, was Vorteilhaft ist wenn ich mich wieder dafür entscheide. Zu der Zeit aber otp Swain.\nSonst bin ich noch am schwanken zwischen Mid Mages und adc \nDeshalb hatte ich auch diesen Comment geschrieben. \n\nAuf Bruiser hab ich auch bock, aber die meisten pack ich mit Yasuo etc. in eine Kiste weil sie ja viel mehr mechaniks vordern^^","replies":[]}]}]}