{"poster":"EXID","date":"2018-02-10T14:17:21.555+0000","title":"Gold elo players losing games on purpose so they can lower their mmr on OCE server","subforum":"Player Behaviour","up_votes":2,"down_votes":1,"body":"Hey riot\n\nSo today I qued up with a duo by the duo of champ and champ the OCE servers. Our team was winning and then being fed\nchamp decided to stay in base and dance. I asked him\nwhat the problem was and he said he wanted to derank and lower his mmr. If you look at his match\nhistory he was gold last season and is sitting at high bronze to low silver. He has an about 15 percent wr on champ yet he gets fed every game because his duo ganks him and takes kills\nthen he throws by dancing and holding fellow team aged hostage by making them ff. I thought this was a one time thing but then I looked at match history and their was an evident pattern of throwing and intentionally losing.\n\nCould you please take a deeper look into this riot? It would be really appreciated. Running someone else&#039;s climb because you want a lower rank is not okay\n\n1. Thanks :(","replies":[{"poster":"ladiesRdelicious","date":"2018-02-12T04:47:07.115+0000","up_votes":1,"down_votes":0,"body":"\"ruining someone elses climb*\"-needs to be an option in the post game. i wish i could report people for this omg.","replies":[{"poster":"Ninox","date":"2018-02-12T12:32:14.563+0000","up_votes":1,"down_votes":1,"body":"You can report people for this sort of behaviour, and it does get punished (can take a lil while though). You can report them under both Negative Attitude (which includes griefing) and usually Intent Feeding as well. Negative Attitude is kind of the catch all for anything negative that doesn't explicitly have it's own report.\n\nAll that said, I would definitely recommend putting some comments in the report detailing what they're doing when it isn't something that has a specific report category.","replies":[{"poster":"Hacks4Dayz","date":"2018-02-16T01:27:48.075+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Seras Dragon,realm=OCE,application-id=T8eq2lFQ,discussion-id=0vgA5PGE,comment-id=00000001,timestamp=2018-02-12T12:32:14.563+0000)\n>\n> You can report people for this sort of behaviour, and it does get punished (can take a lil while though). You can report them under both Negative Attitude (which includes griefing) and usually Intent Feeding as well. Negative Attitude is kind of the catch all for anything negative that doesn&#x27;t explicitly have it&#x27;s own report.\n> \n> All that said, I would definitely recommend putting some comments in the report detailing what they&#x27;re doing when it isn&#x27;t something that has a specific report category.\n\nI know for a fact Riot doesnt give to bloody shits about inting players UNLESS THEY SAY IT!\nI can link a few accounts of people I know in real life that have taken it to the next level where they log onto an account they paid 5 bucks for { Which ToS and EuA stats that this is not allowed }  only to go into a game and int. Really just log in and mute everyone and int.\nWhy did they do this?\n\nBecause they wanted to prove that Riot doesnt do anything on the OCE side but take your cash. In fact I think they will be uploading a video about in a week or so.\nHow they have int'ed from gold to B5 and Riot has done nothing. Because they say nothing.","replies":[]}]},{"poster":"Exarch Leona","date":"2018-02-12T05:42:45.766+0000","up_votes":1,"down_votes":0,"body":"Yeah but then rito would need to ban them people, and if they did BAM, no more LoL.\n\n\nWAIT, RITO, DO THIS.","replies":[]}]}]}