{"poster":"PDAR","date":"2017-12-27T16:07:21.846+0000","title":"Campeones que hacen dragón a nivel 3 solos","subforum":"Guias y consejos","up_votes":7,"down_votes":1,"body":"Yo busque varias veces que campeones e hace el drag&oacute;n a lv 3 pero no encontr&eacute; pr&aacute;cticamente nada o contenido des actualizado de la temporada 5 o 6. A medida de que vallan comentando los ir&eacute; agregando 1 a 1. Se guardaran los 2 smites para el drag&oacute;n utilizandolos para curarse el maximo posible (a no ser de casos especiales) y abra dos rutas la ruta 1 que seria blue grompo y lobos y la ruta 2 es blue grompo cangrejo y lobos\nLista:\nOlaf: {{champion:2}} Machete poticion reutilizable ruta 1, bakeo comprar espada larga talism&aacute;n o cristal de rubi,  subir w,e,w y espamearlas en el drake, para ir mas r&aacute;pido puedes tanquear 3 torretasos para que tengas menos vida y mas velocidad de ataque runas precisi&oacute;n o dominaci&oacute;n.\nWarwick: {{champion:19}}  este es el mas conocido pero igual lo dir&eacute; : Machete de cazador y perla del rejuvenecimiento, ruta 1 bakeo  espada larga , subir q,w,q runas dominacion o presicion\nVi {{champion:254}}  : Machete y pocion reutulizable , ruta 1 si ves que no podes as la ruta 2, baqueas y compras espada larga, subir w,e,q runas dominacion preferiblemente electrocutar.\nNunu {{champion:20}} : Machete y poci&oacute;n reutilizable ruta 1 baquear y comprar talism&aacute;n o cristal de rub&iacute;, subir q,w,q runas brujeria calamidad. PD: si cosigues apariencia espiritual tabis de ninja, mole de cenizas, y tormento de liandary antes de minuto 30 te haces baron solo\nLee sin {{champion:64}} : Machete de cazador y poci&oacute;n reutilizable, ruta 1 bakeo espada larga o talism&aacute;n subir w,q,e runas dominaci&oacute;n. Dato importante no espames la habilidades como loco hay que aprovechar al m&aacute;ximo su pasiva y su robo de vida/ vampirismo de hechizo\nDr.Mundo {{champion:36}} : Esta si que no se la esperaban. Machete 3 pociones, ruta 1 usar 1 pocion en la primera ruta y el resto en el dragon, bakear y comprar talisman o espada larga subir e,q,e runas depredador (yo lo uso asi ya que no encontre alguna runa que me beneficiara asi que me arme asesino y funciono)\nXin zhao {{champion:5}} : machete pocion reutilizable ruta 1, subir e,w,q bakear y comprar espada larga runa estrategia ofensiva.\nMaokai {{champion:57}} : Talisman 3 pociones, ruta 1 gastar solo 1 pocion bakear y comprar machete y pocion si pueden, subir e,q,w runa reververacion (perdonen la ortografia). Nota importante: maokai se hace el dragon pero por muy poco por eso hay que tirar sus habilidades para bajarle y enfriamiento de la pasiva.\nShivana {{champion:102}} :Machete pocion reutilizable ruta 1 bakear y comprar espada larga o talisman o daga, subir w,e,q runa estrategia ofensiva\nFIddlesticks {{champion:9}} : talisman y pocion reutilizable ruta 1 y para el dragon ya que el sufre mucho sin el blue asi que hay que aprobecharlo todo lo posible , subir w,e,w guardar almenos 1 smite pero recomiendo los 2 usar runas a su eleccion\nGraves {{champion:104}} : Este solo lo hace si estas de lado azul (izquierdo), machete 3 pociones ruta 1 bakear comprar talisman y si puede mas pociones matar red y hacer dragon subir e,q,e\nUdyr {{champion:77}} : machete pocion reutilizable ruta 1 baquear comprar machete subir q,w,q runas dominacion y presicion PD: fijate en los enfrimientos cuando la habilidad que usaste llega a la mitad de su cd activa la otra, a si tambien el udyr se termino drake con toda la vida con las runas de presicion no se como.\nJax {{champion:24}} : machete 3 pociones ruta 1 gastando solo 1 pocion, bakear comprar talisman otra pocion ir a red , y luego drake espamear todo como desquisiado subir e,w,q PD: solo probado contra dragon de tierra y solo funciona de lado azul como graves\nTeemo {{champion:17}} : antes de que me maten a palo miren este video aca les explica todo https://www.youtube.com/watch?v=1KdAQrCP2iI&feature=youtu.be\nRunas brujeria: cometa arcano, anillo de flujo de mana , trasendencia/concentracion absoluta, caminante sobre el agua\nValor: piel de hierro revitalizar","replies":[{"poster":"Kalakaua","date":"2017-12-28T00:57:34.712+0000","up_votes":2,"down_votes":0,"body":"ah que buenos tiempos cuando malzahar podia matar al dragon al nivel 2","replies":[]},{"poster":"Kyo Hatori","date":"2017-12-27T16:31:06.813+0000","up_votes":1,"down_votes":0,"body":"Nidalee cuando tenga el machete completo. Suele ser nivel 5 si vas bien xD\n\nNo es lo que pides pero amo este champ :D","replies":[{"poster":"PDAR","date":"2017-12-27T16:43:39.166+0000","up_votes":2,"down_votes":0,"body":"Toda ayuda es bienvenida","replies":[{"poster":"Kyo Hatori","date":"2017-12-27T16:46:53.119+0000","up_votes":1,"down_votes":0,"body":"<3","replies":[{"poster":"PDAR","date":"2017-12-27T16:50:12.203+0000","up_votes":1,"down_votes":0,"body":"dime otro champ que amas y que sea jungler para ver  si lo puedo meter","replies":[{"poster":"Kyo Hatori","date":"2017-12-27T19:48:36.891+0000","up_votes":1,"down_votes":0,"body":"{{champion:203}}  y {{champion:28}} . Pero kindred necesita si o si el machete completo, y mínimo 4 marcas. Por lo menos era asi antes de las nuevas runas, ahora no tengo idea.\n\nY eve no tengo idea :v","replies":[{"poster":"PDAR","date":"2017-12-28T04:07:44.677+0000","up_votes":1,"down_votes":0,"body":"si pones piel de hierro con eve creo que lo haces\npero no se tu cuentame aver si puedes","replies":[{"poster":"Kyo Hatori","date":"2017-12-28T14:27:13.216+0000","up_votes":1,"down_votes":0,"body":"ya lo probaré :v","replies":[]}]}]}]}]}]}]},{"poster":"ficuS","date":"2017-12-27T18:28:34.382+0000","up_votes":1,"down_votes":0,"body":"y {{champion:107}} ?","replies":[{"poster":"PDAR","date":"2017-12-28T04:09:54.412+0000","up_votes":3,"down_votes":1,"body":"jejejjeje no lo tengo ademas sufre como desgraciado en la primera ruta","replies":[{"poster":"ficuS","date":"2017-12-28T20:52:25.861+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=PDAR,realm=LAS,application-id=8sKIclmi,discussion-id=EXT4d5Fm,comment-id=00050000,timestamp=2017-12-28T04:09:54.412+0000)\n>\n> jejejjeje no lo tengo ademas sufre como desgraciado en la primera ruta\n\nJajaj lo acabo de hacer, y hasta usando mal una vez la W me lo hice.\n\nhttps://youtu.be/evBSjBHGmu4\nRunas (Lo que importa para hacerte el dragón es la segunda rama):\nhttps://las.leagueoflegends.com/es/featured/preseason-update/8100-8112?build=10220105","replies":[{"poster":"PDAR","date":"2017-12-29T21:25:32.190+0000","up_votes":1,"down_votes":0,"body":"Un pinshi aplauso para que veo si hay un emoji de eso\n{{sticker:sg-poppy}}  pongo esto porque no encontre uno de un aplauso ademas tengo hambre :V","replies":[]}]}]}]},{"poster":"1471juan","date":"2017-12-28T13:07:04.464+0000","up_votes":1,"down_votes":0,"body":"{{champion:84}} ?","replies":[]},{"poster":"Punchygus","date":"2017-12-27T23:17:57.270+0000","up_votes":1,"down_votes":0,"body":"Todo eso aplica dependiendo de como le vaya a tu equipo y de la vision que haya en el lugar. Si el jungla enemigo es inteligente no te va a dejar hacer esto","replies":[]},{"poster":"SKT T1 Bank","date":"2017-12-27T16:12:54.035+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"PDAR","date":"2017-12-27T16:16:04.645+0000","up_votes":1,"down_votes":0,"body":"despues abro el pbe y pruebo eso aunque detalla mas porque yasuo es bastante dudoso","replies":[{"poster":"SKT T1 Bank","date":"2017-12-27T18:17:35.862+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Katastrofica","date":"2017-12-27T19:33:10.267+0000","up_votes":1,"down_votes":0,"body":"Lo acabo de probar, es cierto, termine reventado pero al parecer yasuo si puede con el dragón a nivel 3 (En mi caso, subí 2 niveles a la Q y 1 a la W, porque me pareció que la E no aportaría mucho, quizás es mas facil con ella)\n\nEdit: Lo acabo de probar de nuevo, intentando que sea mas eficiente, si compras {{item:1041}} , puedes hacer red-sapo-blue-lobos, backear, comprar {{item:1036}} , {{item:1006}} y dos {{item:2003}} \n\nSolo use el smite 1 vez y logre matarlo :)\n\nEdit 2: Con riven hice lo mismo y obtuve los mismo resultados, intente hacerlo con kayn, pero quizas sea dificil de replicar https://imgur.com/a/HAhZQ (Solo use el smite 1 vez, quizas si esperan al cooldown sea mas facil, pero no vale la pena hacer el drake si van a esperar) (Pd: el nivel 4 es porque el dragón da experiencia)","replies":[]}]}]}]},{"poster":"PDAR","date":"2017-12-27T16:44:47.885+0000","up_votes":1,"down_votes":0,"body":"pos voy a agregar a graves y udyr si puedo tambien jax","replies":[]},{"poster":"exrex","date":"2017-12-27T16:24:32.237+0000","up_votes":1,"down_votes":0,"body":"Muy buen post, el unico que uso es WW y recomiendo que lo hagan al level 4 con la tiamat, de otra manera perdes tanto tiempo que no lo vale realmente.","replies":[{"poster":"PDAR","date":"2017-12-27T16:44:10.357+0000","up_votes":1,"down_votes":0,"body":"de echo terminas el drake mas o menos a los 3:45 no pierde tanto","replies":[]}]},{"poster":"Hnk Kenshiro","date":"2017-12-27T16:19:08.290+0000","up_votes":1,"down_votes":0,"body":"{{champion:56}} {{champion:266}}  Y {{champion:77}} También puede, sin backear, aunque **creo** que udyr necesita 2 puntos en la tortuga.","replies":[]}]}