{"poster":"LuckySunday","date":"2017-04-12T02:49:56.271+0000","title":"Randomly Permabanned for 3rd party software?? Very confused????","subforum":"Player Behavior","up_votes":2,"down_votes":1,"body":"So today I got an email out of the blue saying I received a perma ban for 3rd party hacks to the client and I&#039;m extremely confused and frustrated as someone who&#039;s just started playing in the last year and been slumming it in low bronze. I filed a ticket and was told my account was basically gone forever and that I had been gaining a competitive advantage in my games. I recently started hosting a minecraft server for friends but doubt that had any impact on anything idk???","replies":[{"poster":"LuckySunday","date":"2017-04-12T02:55:34.324+0000","up_votes":1,"down_votes":0,"body":"Thank you for the response so I assume the first response you receive is an automated one and you have to pursue the matter further to get a human one?","replies":[{"poster":"aZ3R0n","date":"2017-04-12T03:01:26.680+0000","up_votes":2,"down_votes":0,"body":"Pretty much. Riot has to deal with a steady stream of support tickets, and many of them can be answered with pre-written templates. Just keep stressing your point as politely as you can and reiterate that you want to dispute the actions taken against your account and request a manual review.\n\nDon't give up just yet, someone earlier today had their account ban removed:\nhttps://boards.na.leagueoflegends.com/en/c/player-behavior-moderation/m1eouZas-i-was-banned-for-using-a-3rd-party-application?comment=00030000000000010000","replies":[]},{"poster":"Magical Player","date":"2017-04-12T05:19:24.931+0000","up_votes":1,"down_votes":0,"body":"To be clear, riot does have a human review each case\nSo nothing is automated :D\nA preset of standard response is built and used as they resolve 99% of issues :D\nthe remaining 1% is  the super human human human :D","replies":[]}]},{"poster":"Troll Armada","date":"2017-04-12T05:26:53.734+0000","up_votes":1,"down_votes":3,"body":"There has never been a mistake made by Riot in terms of 3rd party software, if you were banned, you deserve it.","replies":[{"poster":"LuckySunday","date":"2017-04-12T06:11:30.985+0000","up_votes":1,"down_votes":0,"body":"I have no idea how to use 3rd party software or where to even find it so if it was used it wasn't to my knowledge.","replies":[]},{"poster":"Zezockary","date":"2017-04-12T07:38:53.717+0000","up_votes":2,"down_votes":0,"body":"Actually, there have been cases where people had 3rd party application bans overturned, however it is very, very rare.\n\nIf you made a support ticket and they replied that you were not banned in error, then you were doing it.","replies":[]}]},{"poster":"aZ3R0n","date":"2017-04-12T02:52:19.453+0000","up_votes":1,"down_votes":0,"body":"A lot of players seem to be experiencing the same issue, and you'll need to send in a support ticket and talk to the Riot staff:\nhttps://support.riotgames.com/hc/requests/new\n\nThey do bans for using third party software in waves, and sometimes mistakes are made. Politely explain your situation and be patient, it will take up to a day for you to get your first reply. Continue to explain your situation and mention that there have been many players speaking up on the forum about being banned by mistake during this wave and ask for a manual review of your account. If Riot conducts the review and finds that you indeed did nothing wrong then your account will have the ban removed.\n\nThe key here is patience as you go through the motions.\nGood luck!\n{{sticker:slayer-jinx-catface}}","replies":[]}]}