{"poster":"Perfect Rachel","date":"2018-12-10T06:44:08.398+0000","title":"¿Por qué no soy capaz de cambiar?","subforum":"Comportamiento del jugador","up_votes":3,"down_votes":2,"body":"Escribo esto y me llena de tristeza honestamente, casi 9 a&ntilde;os en esto, y no he cambiado, me sigo llenando de odio, sigo estando y sintiendome sola desde el primer d&iacute;a, no logro cambiar, no logro cambiar el hecho de que pese a mis intentos, mi lado t&oacute;xico  sale de igual forma, no me basta con ser cari&ntilde;osa, intentar ser amable, ayudar de la forma que sea o pueda, en una partida me siento rechazada, y estoy completamente a la defensiva, justifico que otro toxiquea, siendo que al mismo tiempo, yo tambi&eacute;n lo hago, No es soluci&oacute;n mutear  y seguir jugando, porque, o se empe&ntilde;an en arruinar la partida, o yo misma me desmorono\r\n&iquest;Por qu&eacute; tiene que ser as&iacute;?\r\n&iquest;Por qu&eacute; no puedo simplemente disfrutar y no sentirme presionada todo el tiempo?\r\nCada paso, un error, todo el tiempo, durante casi 10 a&ntilde;os de mi vida, cometiendo los mismos fallos, intentando corregirlos, con el m&iacute;nimo detonante, me lleno de odio y contamino lo que este cerca, y la &uacute;nica que termina afectada, soy yo.\r\nNo logro dar con el &quot;paso&quot; a dar, no logro dar con poder disfrutar una partida, No me divierte perder, y tampoco me divierte ganar, me frustra constantemente no poder jugar una partida y que esto no repercuta en mi, sentirme abrumada o triste, sentirme insignificante, y que a nadie le va a importar como me vaya a sentar o no el resultado de algo, que deberia divertirme.\r\nlas cuentas no son el problema, cada medio a&ntilde;o puedo crear una e instant&aacute;neamente 150k y a seguir.\r\n36 cuentas baneadas, y no es el problema las cuentas, el problema, es no lograr cambiar\r\nUn ejemplo\r\n\r\nPartida 1\r\nAntes de la partida\r\nSierva de Elune: bardo, mi corazon adorado\r\nSierva de Elune: solo evita ultear cuando combinemos combo xD\r\nSierva de Elune: Cosecha nerfeada, recuerden eso\r\nSierva de Elune: 3 ignites?\r\nEn partida\r\nSierva de Elune: Galio, abisal primer item\r\nSierva de Elune: so be it\r\nSierva de Elune: que tiene?\r\nSierva de Elune: respawnea rio\r\nSierva de Elune: hola?\r\nSierva de Elune: Atentos corazon\r\nSierva de Elune: voy\r\nSierva de Elune: venite\r\nSierva de Elune: :I\r\nSierva de Elune: presta m&aacute;s atenci&oacute;n a que voy, no era necesario el flash, renekton moria si focuseabamos primero\r\nSierva de Elune: no importa, ahora voy\r\nSierva de Elune: No tiene shield saco red y voy corazon\r\nSierva de Elune: bot van bien?\r\nSierva de Elune: avisen si precisan gank\r\nSierva de Elune: galio vos? venis bien?\r\nSierva de Elune: report rumble toxico gracias =)\r\nSierva de Elune: que culpa tengo de que pusheen sin wardear? .-.\r\nSierva de Elune: Porque rinde, yo no estoy hablando basicamente\r\nSierva de Elune: tiene mejor limpieza que wukong xD\r\nSierva de Elune: te firmo el pad o algo?\r\nSierva de Elune: Jajaja, disfruta el match\r\nSierva de Elune: si llego a engagear en las tf tenes free damage\r\nSierva de Elune: el tema es wukong, me va a focusear asi venga 0/10 en lugar de a vos\r\nSierva de Elune: aprovecha eso\r\nSierva de Elune: Lo pueden reportar? toxiqueando toda la partida\r\nSierva de Elune: lo habran dejado hace poco, y esta resentido\r\nSierva de Elune: correcci&oacute;n, ganaste los trades hasta que pusheaste y peleaste sin un misero ward c:\r\nSierva de Elune: OH UNA  MUJER VOLVE A LA COCINA HPTA &Ntilde;I&Ntilde;I\r\nSierva de Elune: Asi desde champion select xD\r\nSierva de Elune: Yo no troleo el game, empec&eacute; mal y sigo con 200 ms fijos, otp zyra, bad game, nada de otro mundo\r\nSierva de Elune: Otp Zyra mid y jg\r\nSierva de Elune: besos\r\nSierva de Elune: &iquest;No puedo tener una mala partida?\r\nSierva de Elune: report botlane y rumble toxico gracias =) bg\r\nDespu&eacute;s de la partida\r\nSierva de Elune: report rumble toxico gracias\r\nSierva de Elune: todito el game toxiqueando\r\nSierva de Elune: No me molesta el reporte por un mal game\r\nSierva de Elune: besotes\r\nPartida 2\r\nAntes de la partida\r\nSierva de Elune: por cualquier mogolico que la pickee en ranked\r\nSierva de Elune: y precisamente mucha gente sale 0/5 al minuto 5 con ella\r\nEn partida\r\nSierva de Elune: cuando no backees  y no pushees como nazi\r\nSierva de Elune: fui a gankearte y backeaste teniendo mana\r\nSierva de Elune: Subida de ms\r\nSierva de Elune: se aviso, y no wardeas\r\nSierva de Elune: Sos vos el que viene 0/5 no yo, vos estas troleando y toxiqueando basicamente\r\nSierva de Elune: No me culpes de tu mediocridad y de que no sepas wardear\r\nSierva de Elune: &iquest;Sabes cual es la diferencia entre vos y yo? que yo puedo un 1v3 sin quejarme\r\nSierva de Elune: wtf fue re falso ese gancho\r\nSierva de Elune: report mid toxico y troll =)\r\nDespu&eacute;s de la partida\r\nSierva de Elune: lo pueden reportar? gracias!\r\n\r\nEn el segundo game, se nota perfectamente a lo que me refiero con detonante","replies":[{"poster":"El Impostor","date":"2018-12-10T13:39:32.609+0000","up_votes":3,"down_votes":0,"body":"Te molestan los picks, runas, hechizos y jugadas de tu team, yo diría que es hora de que busques un juego single player y un buen psicologo.","replies":[]},{"poster":"gtx134","date":"2018-12-10T13:01:21.349+0000","up_votes":2,"down_votes":0,"body":"Proba jugando solo sigle-payers games ya que claramente en un online no toleras a nadie.","replies":[]},{"poster":"Defg45333","date":"2018-12-10T13:00:21.341+0000","up_votes":2,"down_votes":0,"body":"Dudo mucho que algo que pueda escribirse acá te ayude si venís arrastrando el problema desde hace tanto tiempo, pero no perdés nada por intentar.\n\nCuándo alguien sea tóxico en la partida, pensá que no se merece una respuesta ni reacción de tu parte, no se la des, la está buscando y si la encuentra se va a poner peor.\n\nSi alguien está jugando mal, probablemente lo sabe, no quiere ni necesita que se lo menciones ni que lo \"aconsejes\". Si le hablas mucho a alguien que no quiere hablar con vos, estás siendo pesada.\n\nDe todas formas, la solución resumida sería, si no sos capaz de usar bien el chat, no lo uses.\n-------------------------------------------------------------\nPor otra parte sobre lo poco que parece que te divierte el juego, no te voy a decir que simplemente lo dejes, porque creo que los 2 sabemos que eso nunca funciona. Pero sí hacé un intento de dedicarle menos tiempo, jugá y cuándo te tiltees hacé algo más, imagino que habrá alguna otra cosa en la vida que te guste hacer además de jugar al lol, si no se te ocurre nada, no sé... andá a dar vueltas a la manzana hasta destiltearte (?\n\nY como última opción, si además de necesitar ayuda, realmente querés recibirla, podés buscar ayuda profesional (un psicólogo).\nClaro que no tiene sentido que gastes tiempo y plata en uno, si no ponés de tu parte para mejorar, es decir que realmente lo quieras, y no es lo mismo decirlo que actuar en consecuencia.\n\nEspero por lo menos que lo pienses, que tantas ganas tenés de mejorar esa actitud y que estarías dispuesta a hacer para lograrlo.\nUn saludo.","replies":[]},{"poster":"Lord Maxlum","date":"2018-12-10T11:20:53.673+0000","up_votes":2,"down_votes":1,"body":"https://i1.wp.com/loquesigue.info/wp-content/uploads/2018/10/si-bueno-quien-tiene-hambre-meme-jurassic-park.jpg","replies":[]},{"poster":"Rox Tronco","date":"2018-12-11T22:08:38.869+0000","up_votes":1,"down_votes":0,"body":"Yo creo que si el sistema de emparejamiento funcionara mejor y no habia mancos, afk y troll la toxicidad bajaria facil un 90% en toda la comunidad.\n\nA la gente no le molesta perder si fue una buena partida, le molesta que le avises 40 veces que se corran que les va a caer el jg enemigo xq se ve en el mapa que baja, y se quedan igual y mueren.","replies":[]},{"poster":"GR33NGOBLIN","date":"2018-12-11T01:41:21.007+0000","up_votes":1,"down_votes":0,"body":"no lei mucho, pero si ya antes de la partida estas dando ordenes, no esperes que no te manden a cagar, ademas que jugas tilt desde el vamos","replies":[]},{"poster":"WhiteMax","date":"2018-12-10T20:14:02.447+0000","up_votes":1,"down_votes":0,"body":"Cambiar es facil, lo dificil es no volver a hacer lo mismo. Si eres una persona que solo sabe defenderse insultando y eso te hace sentir mal te recomiendo ir a un psicologo.\n\n> Sierva de Elune: OH UNA MUJER VOLVE A LA COCINA HPTA ÑIÑI\n\n{{champion:32}} ","replies":[{"poster":"Perfect Rachel","date":"2018-12-10T20:58:48.764+0000","up_votes":1,"down_votes":0,"body":"cité lo que él dijo, no me absuelvo de culpa","replies":[]}]},{"poster":"BiIIy the Kid","date":"2018-12-10T18:59:35.663+0000","up_votes":1,"down_votes":0,"body":"la culpa es de la gente que es mala","replies":[]},{"poster":"Little T","date":"2018-12-10T16:53:23.113+0000","up_votes":1,"down_votes":0,"body":"amiga, quizá ya estas podrida del juego, te recomiendo dejar un poco el juego.\nyo también era re toxico, pero la cuestión esta en canalizar esa energía en otras cosas... por ahí el juego ya te calcino la cabeza y solo lo haces por costumbre y no por gusto\nes solo una recomendación","replies":[]},{"poster":"Salvor","date":"2018-12-10T14:06:54.554+0000","up_votes":1,"down_votes":0,"body":"> ¿Por qué no soy capaz de cambiar?\n\nMadura, no sirve de nada que insultar al otro, ni siquiera quejarse por el chat, ayer me toco un Twisted Fate que toda la partida sacaba mal las cartas, Azules y Rojas, lo vas a gankear y usa la Roja..... \n¿Sabes que le dije? \nLe dije que ojala toda su familia, su perro y su futura descendencia se recontr...... ah no xD\nNo le dije nada. FIN, se perdió y paso a la que sigue.\n\nHace lo mismo, si no podes mutea el chat, y si tampoco podes andate a otro juego.","replies":[]},{"poster":"Esulc","date":"2018-12-10T12:50:58.759+0000","up_votes":1,"down_votes":0,"body":"¿No te cansas de escribir tanto?, que pesada gzuz.","replies":[]},{"poster":"fenixerege","date":"2018-12-10T11:08:36.925+0000","up_votes":1,"down_votes":0,"body":"por recomendacion del medico solo puedo leer hasta 20 palabras seguidas.......... lo demas hace mal a mi salud......","replies":[]},{"poster":"Wyman","date":"2018-12-10T07:05:48.864+0000","up_votes":1,"down_votes":0,"body":"Such a patronising girl.","replies":[]}]}