{"poster":"reginalt","date":"2017-04-18T20:41:57.664+0000","title":"Yasuo der noobchamp","subforum":"Champions & Gameplay","up_votes":5,"down_votes":15,"body":"Riot bitte entfernt Yasuo aus LOL niemand brauch diesen kak noobchamp er ist viel zu stark und wird nie genervt ich sehe jede runde einen scheiss yasuo im gegnerteam und bisher habe ich fast jede runde verloren weil dieser scheiss champ einfach nur hard unfair ist. macht lol wieder zu einem besseren spiel in dem ihr bzw Garen, Teemo Yasuo und noch ein paar andere champs einfach entfernt. Es ist einfach nur hammer scheisse gegen Yasuo zu spielen da er einfach fast alle anderen champs countert der einzige der ihn vl besiegen tut ist eine 5 man army oder ein kak teemo also entfernt diese mist champs und lol macht wieder spa&szlig;...","replies":[{"poster":"charmelikeahri","date":"2017-04-18T20:56:53.923+0000","up_votes":5,"down_votes":3,"body":"Hey. Woher weiß ich aus 3 Zeilen deines Textes, dass\n-> du Lol nicht verstanden hast\n-> grundlegende Spielprinzipen noch nicht gecheckt hast und\n-> das geistige Alter eines 12 jährigen noch nicht überschritten hast\n\nÜberleg mal wieso ich das weiß...","replies":[{"poster":"Fresh Dumbeldore","date":"2017-04-19T09:57:27.055+0000","up_votes":3,"down_votes":0,"body":"Aus irgendeinem Grund wusste ich das auch ;O\n\n{{sticker:slayer-pantheon-rainbows}}","replies":[{"poster":"charmelikeahri","date":"2017-04-19T19:13:53.474+0000","up_votes":1,"down_votes":0,"body":"Aus irgendeinem Grund werde uch downgevotet ;)","replies":[]}]}]},{"poster":"Fresh Dumbeldore","date":"2017-04-19T09:25:00.017+0000","up_votes":1,"down_votes":0,"body":"Point and click cc ist sehr hilfreich","replies":[{"poster":"5weeds","date":"2017-04-19T09:37:24.868+0000","up_votes":1,"down_votes":0,"body":"So wie der alte Taric :D?\n\n\nFlash + Ult =  http://vignette2.wikia.nocookie.net/theamazingworldofgumball/images/0/05/Nailed-it-o.gif/revision/latest?cb=20130622222446","replies":[{"poster":"Fresh Dumbeldore","date":"2017-04-19T09:55:47.009+0000","up_votes":3,"down_votes":0,"body":"<3 old taric\n\nDamals, als Taric noch nicht aus Demacia kam, sondern aus einer anderen Welt, in der Kristalle heilende Kräfte haben und er sich (glaube ich) gegen den Willen seines Vaters nach Valoran ging, um dort mit seinen Kristallen zu helfen\n\nAber muss sagen, optisch ist der neue schon besser \n{{sticker:slayer-jinx-wink}}","replies":[{"poster":"5weeds","date":"2017-04-19T09:58:28.335+0000","up_votes":1,"down_votes":0,"body":"http://2.bp.blogspot.com/-jOjUL9XwBRA/VO4z7c2-HuI/AAAAAAAABuE/EwAMHaGBEj4/s1600/tariccompare.jpg\n\nAuf jeden Fall xD\nBtw, trägt er da Sneakers?","replies":[{"poster":"Fresh Dumbeldore","date":"2017-04-19T09:59:56.737+0000","up_votes":1,"down_votes":0,"body":"sellout","replies":[]}]}]}]}]},{"poster":"5weeds","date":"2017-04-19T06:36:26.976+0000","up_votes":3,"down_votes":0,"body":"Hab mich schon gewundert wann der nächste Yasuo Flame im Forum erscheint :P\n\nSchon mal mit bannen versucht?","replies":[]},{"poster":"Alânte","date":"2017-04-18T21:04:19.133+0000","up_votes":4,"down_votes":1,"body":"{{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}}","replies":[]},{"poster":"Alekra","date":"2017-04-18T22:18:52.278+0000","up_votes":2,"down_votes":0,"body":"Lol der will Garen entfernen xD","replies":[]},{"poster":"Devestator99","date":"2017-04-18T20:48:05.192+0000","up_votes":2,"down_votes":0,"body":"Spiel mal Rammus dagegen.","replies":[]},{"poster":"Sylvánas","date":"2017-04-18T21:12:22.090+0000","up_votes":3,"down_votes":1,"body":"*generft\n\nYasuo hat sehrwohl Counter.. einige sogar. Vorallem beliebte Toplaner wie Irelia, Darius und Jax countern Yasuo ziemlich hart. \nYasuo ist ein Champ, der viel Mobility hat. Und so einen Champ bekämpft man am besten mit einem Champ, der ebenfalls viel Mobility hat - wer hat viel Mobility? Assassins. LB, Fizz, Zed oder Akali können Yasuo locker in der Lane schlagen und ihn alt aussehen lassen. Du musst nur wissen, wie du gegen Yasuo spielst. Hilft übrigens auch, wenn du viel Rüstung kaufst und einfach den Tank vorschickst (Poppy und Nauti eignen sich da besonders). Ich finde es ist schwer, Yasuo zu meistern. Und richtig stark ist er eigentlich nur, wenn er gemeistert ist.","replies":[{"poster":"TerrorRaven","date":"2017-04-19T00:14:02.447+0000","up_votes":2,"down_votes":1,"body":"Naja, bei Darius ist es eher ein Skill-Matchup. Yasuo ist wesentlich mobiler und hat keine Ressourcen. Zudem hat Darius relativ langsame Animationen. Ein Yasuo mit einigermaßen guten Reaktionen kann mit guten Wave-Management einen Darius runter poken, ohne das dieser sich dagegen wehren kann.","replies":[{"poster":"charmelikeahri","date":"2017-04-19T19:13:18.309+0000","up_votes":1,"down_votes":0,"body":"Nein ist es nicht. \nEin Darius der 0/4 steht mit 30 Farm weniger 1vs1 einen Yasou nur mit Autoattacks und Ult, ohne seine Q. Und ja seine Q kann Yasou dogen, aber die AAs nicht, genauso wenig wie sie Ult. Glaub mir Darius gegen Yasou ist spätestens ab Lvl 6 ABSOLUT ABSOLUT ungewinnbar für Yasou","replies":[{"poster":"TerrorRaven","date":"2017-04-19T19:36:10.552+0000","up_votes":1,"down_votes":0,"body":"Es ist für Darius aber nicht einfach, in Autoattack-Reichweite zu kommen, erst recht nicht bei Yasuo, sobald er den Frosthammer hat (welcher bei Top Lane Yasuo gar nicht mal selten ist).","replies":[{"poster":"charmelikeahri","date":"2017-04-19T19:49:06.910+0000","up_votes":1,"down_votes":0,"body":"Wir reden über die selben Champs oder?\n\nYasou ist ein Autoattack Champion, er bewegt sich notgedrungen in Autoattackrange! Wenn er Darius mit der Q poked kann Darius das selbe effektiver mit seiner Q machen. \n\nAußerdem hat er eine E (den Hook) der Yasou ranzieht. Und einen Slow auf der W. \n\nAlso was du da schreibst ist bestenfalls unbedacht o-O","replies":[{"poster":"TerrorRaven","date":"2017-04-19T20:32:32.629+0000","up_votes":1,"down_votes":0,"body":"Ich habe schon Fälle gesehen (und auch selber erlebt von beiden Seiten) das Yasuo einen Darius durchaus zerstören kann. Daher schreibe ich eher aus eigener Erfahrung.\n\nYasuo hat von Kit her einfach mehr Möglichkeiten als Darius, welcher halt sehr einfach und stumpf ist. Es hängt zum großen teil davon ab, wer von beiden den ersten Fehler begeht.","replies":[{"poster":"charmelikeahri","date":"2017-04-19T20:42:43.902+0000","up_votes":1,"down_votes":0,"body":"Ich habe Yasou auf 90k :^) \n\nIch kann mir nicht vorstellen das ein Yasou gegen einen Darius gewinnt solange dieser nicht mindestens 2000 Gold behind ist oder keine Ult hat oder AFK ist oder geganked wird.\n\nGlaub mir. Yasou kann dieses Matchup nicht alleine gewinnen, egal wieviel er doged oder wie sehr er outplayed ^^\nProbier es mit einem Freund aus!","replies":[{"poster":"Fresh Dumbeldore","date":"2017-04-20T06:14:11.264+0000","up_votes":1,"down_votes":0,"body":"Als Darius Main kann ich bestätigen, dass man mit Darius die Lane gegen einen Yasuo gewinnen sollte!","replies":[{"poster":"xXSchätzchenXx","date":"2017-04-22T09:42:39.742+0000","up_votes":1,"down_votes":0,"body":"Anders sieht es aus, wenn yasuo nur seine q nutzt zum poken, dann ist er ausserhalb aller aa reichweite, oder aber aa + e dann ist er ausserhalb der von Darius aa Reichweite. Nach schlimmer ist es aber wenn man z.B. einen Nasus spielt, da ist die AA animation so langsam, das yasup e/q, aa, e ausführen kann, sobald er Eifer gekauft hat, und Nasus nicht einmal den ersten Shlag ausgeführt hat. \nZur Zeit ist es sogar so weit, das ein Yasuo auf lvl 1 einen Nasus 3 hitten kann, oder ab lvl 6 einen vollen dive ausführen kann, ohne das der Tower ihn einmal hittet, da der Tower ihn während der Ult nicht Fokussiert und er seine Ult so beenden kann, das er direkt wieder aus der Range raus ist. Seine Q ist fast die halbe Tower range, und Schadenswerte von 1,5 k in 1,2 s pre lvl 10 sind einfach nur noch unbalanciert. Das Problem mit ihm ist, einfach das er einen unglaublichen Schaden raushauen kann, ohne Angst vor treffern durch mele champs zu haben. Gegen die wird er im late zwar um einiges schwächer, dafür kann er aber im late alllen schaden von ranged champs abfangen, das seine w mitlerweile so groß ost das er bequem drinne stehen kann. Mit 4 sekunden Standzeit ist seine w auch nicht wirklich ein skill sondern einfach zu dominant. Es würde völlig ausreichen wenn sie eine Standzeit von 0,5 s auf alle leveln hätte, dann wäre sie wirklich ein skillvoll einzusetzendes mittel. Insgesammt hat er einfach ein setup welches ihm erlaubt sowohl Mele, Range und dank seine e auch CC komplett aus dem weg zu gehen. Einzig gegen stuns ist er recht empfindlich, allerdings mit flash und e auch meist wieder weg. Dazu noch ein alles anderes als schwacher Schild und fast die gesamte Zeit 100% crit schaden.","replies":[]}]}]}]}]}]}]}]},{"poster":"SST Višap","date":"2017-04-19T00:10:31.181+0000","up_votes":1,"down_votes":0,"body":"Gegen Yasuo spiele ich auf toplane gerne einen Tahm kench mit Trinity Force.\nMit guten Tanks und Supportern lässt sich Yasuo, wie du beriets sagtest, sehr schnell rauspicken und ist zu dem auch ein recht weiches ziel.\nTeam Koordination in den Fights ist wichtig. Deswegen ist er vermutlich auch im SoloQ oft so dominant.","replies":[]}]},{"poster":"SchmatziKatzi","date":"2018-02-21T17:43:33.990+0000","up_votes":1,"down_votes":0,"body":"Du hast Recht yasuo ist einfach nur scheiße momentan ist es so,dass welches team ihn pickt gewinnt und wenn man ihn nicht bannt kommen blitzcrank etc. durch und werden gepickt es hat einfach nichts mehr mit skill zu tun einfach traurig lol war mal ein so nices spiel und jetzt nur noch leute die denken das sie gut auf yasuo sind aber eigentlich nur Rechtsklick und Q drücken pls delete GAYSUO\n{{item:3695}}","replies":[]},{"poster":"MrWoscht","date":"2017-05-18T17:31:55.419+0000","up_votes":1,"down_votes":0,"body":"Lol Yasuo ist halt nur einer der schwersten champs aber warscheinlich bist du einfach nur bronze :D\nVerkackst warscheinlich nur gegen ihn und hast keinen plan wie man ihn countert und er zerstört dich immer deswegen sagst du das denke ich mal xD","replies":[]},{"poster":"Nuix","date":"2017-04-22T18:41:50.601+0000","up_votes":1,"down_votes":0,"body":"Waiting for Mr. Right...click?^^","replies":[]},{"poster":"Snorlax irl Slav","date":"2017-04-19T19:17:01.719+0000","up_votes":1,"down_votes":0,"body":"Ich dachte der 1. April wäre vorbei","replies":[]}]}