{"poster":"Sauvagess","date":"2017-09-18T21:58:22.259+0000","title":"Honor not updating","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"Countless other topics about this, I've seen, but I honestly feel like a fringe case.\r\n\r\nI've been honor 2 since the change happened. I've previously held all 3 ribbons at one point for same-team honors (I don't use all-chat, so I practically never got honorable opponent) and yet, as I play quite frequently, I've noticed that the new system is rather biased. Back before in the old system, it was pretty frequently used that people would honor multiple others. I'd throw out a few as well, since I could do so.\r\n\r\nHowever, when the system changed to only allow one honor per person, I've come to see that...people really only honor their friends, and even if not the solo players will honor any role that isn't ADC. I'll play in many games, and at the results screen, I see that even if everyone on my team does honor someone else, my honor box will be completely empty while jungle Gragas who literally called me r%%%%%ed and told me to kill myself gets honorable mention just because he out-smited baron from the enemy jungler. Regardless of whether or not I'm supporting my team or I just so happen to catch out the enemy team and mow them down 1v5 with Twitch's ult before any of them can react which resulted in an immediate surrender from the enemy team in that very same game. Which, about 10 minutes after said game where I reported him, I received a pop-up stating that \"someone\" I reported had been struck with a penalty. ~~Gee, I wonder who that could be.~~\r\n\r\nBeyond that, your staff claims that even if you don't get honored, you'll still progress and level up as long as you're not punished...yet at the same time, I see all my friends taking their screenshots of them leveling up to Honors 3, 4, and 5 at lightning speed, and even hear of Mr. Tyler1 himself having honor 4 while I stare at nothing to show for any of it.\r\n\r\nWhat am I missing out on here, Riot? What information is being withheld that makes my situation make any sense? Is it related to the literal tens of thousands of games I've played since season 1? Is it because my account's ID number is messing with the client? Come to speak of it, I'm still having glitches from time to time where Aurelion Sol's stars don't match up with their animation all of the time, and Ekko's Q is **ALWAYS INVISIBLE** 100% OF THE TIME so I can never tell where an Ekko player is throwing their Q unless it hits me directly, in which I can then deduce from where he was and where I got hit as to the trajectory of his skillshot.\r\n\r\nThis honestly impacts my League experience in a negative manner, much to the point where I'm actually considering quitting the game, despite having spent over a thousand dollars and countless hours invested into this game and my account.","replies":[{"poster":"Broporo","date":"2017-09-19T00:45:51.250+0000","up_votes":1,"down_votes":0,"body":"It's hard to know what you might be doing differently than others and why your account is ranking up slower. You mentioned that you don't see yourself getting honored too often; there's a pretty decent chance your friends ranked up quicker by getting a lot of honors. There's also the chance that they're just simply playing more games to get more honor exp than you have been. It looks like this account only has about 3k games on it, and you're only playing one or two a day on most days. There's definitely nothing wrong with that, but people who hit the higher ranks quicker were playing a heck of a lot more daily games than the rest of us. Putting in more games is definitely going to make you rank up faster.","replies":[{"poster":"WaWor NA","date":"2017-09-19T14:51:38.994+0000","up_votes":2,"down_votes":0,"body":"I doubt the total amount of games has anything to do with it.\n\nI've been playing my smurf, that has barely 350 games on it, and I got Honour Level 5 after playing about 100 games. Besides, on my main I'm only 4, but I have not been actively playing on the account since Honour 3 was enabled, and got Honour 4 after 3-4 games only.\n\nSauvagess I've been playing with quite a bit, and I also wonder how he has not earned a higher ranking, his gameplay is fine, he does not grieff his fellow teammates, but I also rarely see him carry the games we've played. Could it be something about your KDA linked with the Honours you get after a game? I really do not see any other reason than your performance stats having a play in this matter.","replies":[]},{"poster":"Sauvagess","date":"2017-09-23T13:16:45.426+0000","up_votes":1,"down_votes":0,"body":"Pretty much what WaWor said there, having more games played since the honor rollout compared to others that play less than me and are much higher honor than I am already. Like, you say that there's a hidden value, how close even am I to moving up to 3? Are the values even same for everybody? Because it doesn't look like it.\n\nAlso, you never acknowledged the Sol and Ekko bugs, or should I make a new topic for that?","replies":[{"poster":"Broporo","date":"2017-09-25T00:58:25.443+0000","up_votes":1,"down_votes":0,"body":"Honor works like this: Each game played gets you a small amount of Honor. Being Honored by someone gets you a bit more. If everyone on your team honors someone, then everyone gets an additional boost. Also, everyone's rates are the same. It may not feel like it, since people will be gaining honor at different rates and amounts. On a side note: your progress can be delayed by getting punished or penalties on your account.\n\nThe system wasn't designed to compare yourself to others on how quickly you rank up, which is part of the reason why you can't see your current progress. Keep playing games and getting honored, while avoiding penalties, and you'll rank up with enough time. \n\n\nHelp & Support can't fix bugs, we aren't devs or coders. This is precisely why we have a section specifically for [**Reporting Bugs**](http://boards.na.leagueoflegends.com/en/c/bug-report)!","replies":[{"poster":"Sauvagess","date":"2017-09-27T20:40:44.845+0000","up_votes":1,"down_votes":0,"body":"I've asked others about this, and I'm having others tell me that \"Reports undo a lot of honor progress\" since \"Getting reported can keep someone out of honor 3\" with \"proof: I'm honor 5 and you are honor 2\" since \"[They've] been reported a total of 4 times, thus it only took 2 weeks.\"\n\nAdditionally, stating that \"there is likely some decay. Pretend it's a rage bar, getting honors quickly gets you more honor than getting one and waiting for a few games.\"\n\nIn spite of showing them this topic and the Honor FAQ.","replies":[]}]}]}]},{"poster":"Sauvagess","date":"2017-10-10T15:16:01.209+0000","up_votes":1,"down_votes":0,"body":"bump, especially now that ranked rewards are including honor which ends in exactly 1 month from now.","replies":[]}]}