{"poster":"TeCoolMage","date":"2015-07-10T05:55:03.930+0000","title":"Curious about the morality of Tahm Kench's deals.","subforum":"Miscellaneous","up_votes":1,"down_votes":0,"body":"What I&#039;m getting from the cinematic is a gambler who gambled everything to Tahm Kench, and he ended with something along the lines of &quot;Instead you were the fool! The fool that let me in!&quot; or something.\r\n\r\nI think Tahm Kench ate the gambler&#039;s wife, did the gambler even own his wife in the first place? Why didn&#039;t she get a say on whether she&#039;d die or not?\r\n\r\nIs this a sign of the lore-writer potentially making Runeterra a dark world, or am I overthinking this?","replies":[{"poster":"Jink","date":"2015-07-10T11:25:28.525+0000","up_votes":2,"down_votes":0,"body":"The Gambler was in debt and came to a Sunken Town, heard Tahm Kench's Siren song and came to him; Tahm Kench offered him a bargain, which ended with him being transported to gambling central (away from the heat) and accepted the deal that he would allow Tahm Kench in his house if he ever got one (Demons/Satan require permission to enter your house so it's a slant on this) [Also a bit of a slant on sleeping beauty and the deal/curse] and it ended in Tahm Kench - a Demon; in their house.\n\nHe didn't and didn't need to own his wife for her to get eaten, once the demon's in your house you're basically screwed and I don't think it really mattered if she told him not to eat her as he probably didn't care much for idle chatter before his meal.\n\nThere's always been darkness in the lore (Riven's lore for instance and Irelia's) Irelia died and was revived by Soraka, Riven lost her sh-t and broke her sword and exiled herself from Noxian society because of Singed's carelessness of collateral damage as he killed friend and foe alike during warfare and the whole of Noxian Society is honed on skull-daggery and cutthroatery with ideals about survival of the fittest and quick wits and a fast blade being supreme so I don't really think the lore or game has taken a darker path, I mean Katarina says \"If you run, you wont see me stab you\" which is pretty evil - I think it is probably more impactful because it's a video rather than just written lore and Riot haven't released a lot of Video's like Tahm's and Ekko's so we're bound to see some dark elements arise among the plethora of Ideologies and Characteristics already instilled in League such as more examples of or likenesses to Noxian Cruelty, Demacian Valor and Ionian Pride as well as lone-rangers and outliers to these societies, dominions and empires with their own good or bad ideals and attitudes.","replies":[{"poster":"TeCoolMage","date":"2015-07-11T03:19:40.504+0000","up_votes":1,"down_votes":0,"body":"Yes yes, there's violence and stuff, but the general concept of demons and deals with the devil is \"You deal with me, I take your stuff\", the problem is, the gambler never really had the right to own a person, if there's some sort of magic stopping Tahm Kench from entering homes without being allowed, there should be one that stops him from murdering people who aren't foolish enough to allow them to enter homes. This isn't dark in the way Katarina and Singed is, emphasizing the foolishness of people in Runeterra, but the power entities have over people and how they can bypass rules with loopholes to get an extra person to eat.","replies":[]}]},{"poster":"Kajata","date":"2015-07-10T11:21:37.163+0000","up_votes":1,"down_votes":0,"body":"pretty sure runeterra has been a dark world for a long time. they have an actual facility to settle wars. Demacia fought Noxus. war is pretty dark.  Tahm preys on the vulnerable just as bard saves only \"what is important\" the fact is humans have no idea what a world without darkness would be, it is a fallacy, there is always a malcontent.","replies":[]}]}