{"poster":"Penteano","date":"2017-11-07T14:52:55.632+0000","title":"What makes the game stop taking commands from you?","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"People around me moves, ping remain the same all match, yet from time to time for about 2 seconds my champion wont take any command from me. What is causing this?","replies":[{"poster":"Broporo","date":"2017-11-08T03:37:41.469+0000","up_votes":1,"down_votes":0,"body":"From the way you described it, this really sounds like packet loss to me. Luckily we can check for that really quickly using our [**log reader**](https://support.riotgames.com/hc/en-us/articles/209765743) to scan the network logs from that game. Take a quick screenshot of what it shows and post it here in a reply so I can take a look.","replies":[{"poster":"Penteano","date":"2017-11-08T13:21:12.567+0000","up_votes":1,"down_votes":0,"body":"Thanks, I'll try to upload one when I have this issue, right now I think Discord is causing it but need more matches to be sure","replies":[]}]},{"poster":"Slink","date":"2017-11-07T18:14:26.567+0000","up_votes":1,"down_votes":1,"body":"Sounds like it could be that another program or background process on your system is stealing application focus for a few seconds. As far as troubleshooting this type of problem goes it could take 10 hours or more and dozens of back and forth comments to figure out what it is and fix or remote desktop with someone you trust.\n\nOne thing I'd check is to see if the client isn't accepting **any** input or just your champion. Try opening the game menu (esc) and/or opening the scoreboard  (Tab) the next time it happens. If those two menus don't work then it's really likely that the client is in fact loosing focus, if they **do** work then I'd guess it's an upload problem on your internet connection. A short internet upload disruption of a second or two may not necessarily cause the client ping display to change much, if at all depending on the way they're calculating that number.\n\nAfter that the first place I'd look to find out what might be stealing focus though would be to close/remove as many programs as possible from your system tray and see if that fixes it. If it does then you can systematically go through all those programs to see when the problem returns, then you've found your culprit.","replies":[{"poster":"Penteano","date":"2017-11-07T19:01:20.479+0000","up_votes":1,"down_votes":0,"body":"hmm I never tried hitting esc, but it does show the green arrows when I try to move (that's the only thing I try to do desperately since most times the enemy is right in front of me xD) \nMust be an upload issue then, sucks man :(","replies":[{"poster":"Slink","date":"2017-11-08T02:06:27.057+0000","up_votes":1,"down_votes":0,"body":"I didn't think about the green movement arrows, I guess my subconscious just ignores them now. But yeah if you still see the green arrows from spamming right click to move and you're still not moving then yeah it's likely an upload issue and you're commands are not being sent to the server.\n\nMaybe contact your ISP and see if they can look into it, by the sounds of it this problem wouldn't be unique to LoL. Just be sure to be specific with them otherwise they'll probably just say \"it looks fine on our end\"","replies":[{"poster":"Penteano","date":"2017-11-08T13:19:24.205+0000","up_votes":1,"down_votes":0,"body":"It is only in LoL, I'm a simracer and every simulator in the market is pretty sensitive to these cuts, all cars either disappear or you lose connection quickly, and this is not happening on them =/ \nTho I think Discord is causing it, played with it off yesterday and didn't have the issue. Need more to confirm since I cant be 100% sure when it happened Discord was running","replies":[]}]}]}]}]}