{"poster":"AIessa Gillespie","date":"2019-10-14T20:19:44.172+0000","title":"Un MOBA de telefonos tiene menos nenazos en ranked","subforum":"Charlas Generales","up_votes":2,"down_votes":2,"body":"Antes que nada: \r\n_Si, perdí 7 rankeds seguidas.\r\nNo, no soy malo jugando. Hace 5 años que estoy en este antro y es imposible ser lo suficientemente malo con los años de experiencia como para merecer perder 7 veces._\r\n\r\nPero bueno dejando eso de lado quiero hablar de Mobile Legends:\r\n\r\nSi, es un juego de telefonos donde yo tenia la percepción de que iba a estar lleno de nenazos y es así, esta realmente lleno de nenes el ámbito de mobile gaming.\r\n\r\nPero Mobile Legends sabiendo esto creo un sistema de sanciones/reportes/IA increiblemente avanzado si lo comparamos con riot games\r\n\r\n\r\n* En Riot siempre con la escusa de \"no hacer cacería de brujas\" defienden al troll, ocultan al feeder y las sanciones son mínimas para el 0/8/4 que te hace perder una partida de +40 minutos\r\n\r\n**\r\nPero los de Mobile Legends son todo lo contrario, aunque si bien no te banean por \"días\" te restringen el juego cada vez mas.**\r\n\r\nDe entrada lo increíblemente diferente de Mobile Legends es que EN MEDIO de la partida te sale en el chat un anuncio global avisando que el troll ya va a ser baneado haga lo que haga, osea durante la partida podes sentir y disfrutar tanto para aliados como enemigos que un nenazo fue penalizado.\r\n\r\nY no solo eso, después de las partidas si reportaste a alguien enseguida te llega un MP diciendo cuales son sus puntos de vista sobre los trolls y avisando que x jugador se comió un \"escarmiento\" si es que no trolleo tanto pero en caso de que haya trolleado al 100% te llega al mail AVISANDO que fue penalizado y MOSTRANDO todos los puntos que perdió y las sanciones de las cosas que no va a poder ganar/hacer\r\n\r\n\r\nDesde entrada pierde por un tiempo la posibilidad de rankear y con eso ya libera de una manera extraordinaria la cantidad de nenazos que te toca en ranked, para poder rankear va a tener que jugar unas cuantas normales (sin ser un nenazo para recuperar puntos) y recién ahí va a poder volver a rankear.\r\n\r\nSe aseguran que el jugador no pueda \"salir del ban y volver a rankear\" como si nada, se aseguran que los que estan rankeando tranquilamente no se coman un nenazo y si es que se lo comen (esto es muy importante) **EL SISTEMA EVITA EL CASTIGO INJUSTO DE PERDER POR UN AFK/TROLL Y TE DA UNA POSIBILIDAD DE NO PERDER PUNTOS EN RANKED** (no es infinito pero sirve mucho) \r\n\r\nEs impresionante como un juego con MUCHOS MENOS RECURSOS/PERSONAL/JUGADORES sea capaz de idear un sistema mucho mas justo para todos porque no puede ser que una empresa tenga la mentalidad de \"ay no vamos a cuidar a nuestros nenazos que \"tuvieron una mala partida\" \" mientras que en mobile legends te diga \"vamos a castigar a todos y cada uno de los que trollean para exponerlos frente a sus victimas y que ellas no se vean tan afectadas por este comportamiento\" \r\n\r\n\r\n\r\nPor ultimo quiero decir que si, mobile legends tiene dos tipos de reporte poco usuales\r\nUna es reportar por baja habilidad (feeder pero no intencional)\r\nOtra es reportar por fedeado (un abusador smurf que termina 20/0) \r\n\r\nLas cuales tienen el objetivo de emparejar con gente mas mala/buena a esa gente así estan con jugadores con su habilidad. Mientras que acá te empareja el teemo 0/10/4 solo porque está en tu misma liga","replies":[{"poster":"ZyXEL 001","date":"2019-10-14T21:35:15.095+0000","up_votes":2,"down_votes":1,"body":"Sin ánimos de ofender ni desacreditar tu posteo. Hace 5 años estás en bronce con alguna que otra subida a plata en el medio.","replies":[{"poster":"diabetín","date":"2019-10-14T21:41:42.908+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=ZyXEL 001,realm=LAS,application-id=v7qsfXsE,discussion-id=AZJLjvAA,comment-id=0000,timestamp=2019-10-14T21:35:15.095+0000)\n>\n> Sin ánimos de ofender ni desacreditar tu posteo. Hace 5 años estás en bronce con alguna que otra subida a plata en el medio.\n\ny ademas que perdió las 7 con un score HORRIBLE","replies":[]}]},{"poster":"Cuchufleitor","date":"2019-10-14T23:22:52.535+0000","up_votes":1,"down_votes":1,"body":"Mira, puede ser que tengan un sistema en el que penalicen por salir 0/8. Pero tener ese score no implica que estes troleando!! esmuy dificil saber si alguien esta troleando con una IA! ese sistema no puede ser acertado en todos los casos! muchos se van a comer bans injustos!\nPor el lado de que no mereces perder 7 veces...en probabilidad es realmente muy raro que te pase algo asi, ademas vi que usaste un personaje diferente en casa una de esas partidas, no hay manera de que sepas usar bien a todos, si queres subir mas o menos rapido no usaria mas de 3 en tu linea main, un par en la secundaria y algun supp por las dudas. No se cuanto tiempo tenes para practicar pero no vale la pena malgastarlo aprendiendo todos los champs (salvo que estes en un equipo profesional)","replies":[]}]}