{"poster":"Regina George","date":"2015-01-29T18:11:31.370+0000","title":"Is now the worst time for game balance?","subforum":"Gameplay","up_votes":123,"down_votes":29,"body":"I know there have been times or patches that was crazy. Release Xin, release Leblanc, League of Cleavers, League of Warmogs, the time when Bruisers were dominating everything, heal/poke meta etc to name a few, but I feel like at least, during these past instances, it was only 1-2 things that was blatantly unbalanced.\r\n\r\nNow it feels like, the jungle is super unfair cause only a handful of champs can excel in it, mages have been getting pushed aside because of the mana regen nerfs PLUS the athenes/morello's nerf PLUS the removal of DFG, while resourceless champs still have no issues. Squishy supports are getting nerfed while their tankier counterparts are still amazing. Jungle and Support gold income are still unimpressive. Jungle XP is ridiculously low. Champs who has so many free stats or multiple effects on a single skill and so many more issues that are so blatant right now.\r\n\r\nIt feels like the balance team is playing a different game than us. They even admitted that Lee and Zed are really strong, and yet they nerf Sona again. Their goal was to have a more diverse jungle, but they increase the cost of the jungling item, punishing the squishy/tanky junglers who cleared a lot slower than the AD/bruiser or junglers with sustain.\r\n\r\nWHAT IS HAPPENING \r\n\r\n{{item:3070}} {{item:3070}} {{item:3070}} {{item:3070}} {{item:3070}} {{item:3070}}","replies":[{"poster":"Direwolfiez","date":"2015-01-29T19:51:03.210+0000","up_votes":22,"down_votes":36,"body":">Now it feels like, the jungle is super unfair cause only a handful of champs can excel in it, \n\nThank Fearless for the jungle changes, *and* the Sona rework to boot.  The guy admitted that he ignored community feedback because he wanted a bug-free kit rework.  Look where that put Sona.\n\nhttp://boards.na.leagueoflegends.com/en/player/NA/Fearless\nhttp://boards.na.leagueoflegends.com/en/c/gameplay-balance/c99MUnvw-an-open-letter-to-fearless-regarding-the-sona-changes?comment=000600000001\nhttp://boards.na.leagueoflegends.com/en/c/gameplay-balance/c99MUnvw-an-open-letter-to-fearless-regarding-the-sona-changes?comment=00020000","replies":[{"poster":"Fearless","date":"2015-01-29T21:24:35.512+0000","up_votes":92,"down_votes":27,"body":"That's a pretty terrible misrepresentation of what I've said. I admitted I didn't spend enough time responding to the feedback, but that's not the same as ignoring it. I didn't stop reading the feedback, but I didn't do well enough explaining what we were seeing internally, and how that was different from what PBE was seeing. \n\nI get that my projects haven't been popular on boards, and I have a lot of room to grow on how I communicate to this group specifically. That being said, knowing that anything I post will actively be misrepresented like this does really make me hesitant to do this with many posters.","replies":[{"poster":"Done25","date":"2015-01-29T21:36:46.331+0000","up_votes":36,"down_votes":3,"body":"> [{quoted}](name=Fearless,realm=NA,application-id=3ErqAdtq,discussion-id=UU6eBAmE,comment-id=00060000,timestamp=2015-01-29T21:24:35.512+0000)\n>\n> That's a pretty terrible misrepresentation of what I've said. I admitted I didn't spend enough time responding to the feedback, but that's not the same as ignoring it. I didn't stop reading the feedback, but I didn't do well enough explaining what we were seeing internally, and how that was different from what PBE was seeing. \n> \n> I get that my projects haven't been popular on boards, and I have a lot of room to grow on how I communicate to this group specifically. That being said, knowing that anything I post will actively be misrepresented like this does really make me hesitant to do this with many posters.\n\nDon't be afraid, we don't **ALL** act raging 14 year olds who just hit puberty. :D","replies":[]},{"poster":"tofutime","date":"2015-01-29T21:47:33.761+0000","up_votes":18,"down_votes":0,"body":"> [{quoted}](name=Fearless,realm=NA,application-id=3ErqAdtq,discussion-id=UU6eBAmE,comment-id=00060000,timestamp=2015-01-29T21:24:35.512+0000)\n>\n> That's a pretty terrible misrepresentation of what I've said. I admitted I didn't spend enough time responding to the feedback, but that's not the same as ignoring it. I didn't stop reading the feedback, but I didn't do well enough explaining what we were seeing internally, and how that was different from what PBE was seeing. \n> \n> I get that my projects haven't been popular on boards, and I have a lot of room to grow on how I communicate to this group specifically. That being said, knowing that anything I post will actively be misrepresented like this does really make me hesitant to do this with many posters.\n\nCan there be a way to talk to the design team more? It only seems like really negative posts get the attention of rioters while threads asking what's going on in earnest are all ignored.\n\nMore specifically I'm concerned about all these mana nerfs to make mana a resource in lane instead of just spamming spells when they have blue. Fair enough and yet there are older champs that have been completely forgotten that have had that mana gate in out dated mana costs for years such as Anivia and Swain that have been hit hardest of all. There hasn't been a rioter that has talked about these types of champions and it worries me. I really wish there was a way to get a response even if it's \"oh we should check that out.\" I mean it's just assurance that yeah they're looking into those old champs that no one plays anymore.","replies":[{"poster":"Fearless","date":"2015-01-29T22:22:49.697+0000","up_votes":25,"down_votes":6,"body":"That is a really fair desire, and is exactly the sort of dialog I'd like to have more. One issue is that those problems span multiple teams, and my ability to talk about champion updates is pretty limited. I'm not an expert on most of their projects, and a lot of stuff is always in flight, and talking about any project before it's ready can be really dangerous and disappointing if the project hits problems late in the process. \n\nThat being said, there are posts I could hop into more often. Life at Riot is a pretty big adjustment, even for someone who has been making games for a long time. Communication, as I've already admitted to, is a spot where I have a tremendous amount of room to grow. \n\nTiny Caveat, we do still look at those champions more than people realize. We recently shipped the small update to Anivia's Q visuals to help her have some better feedback on her threat range. Not a huge change, but want to point out that we are constantly thinking about ways to make those champs a little kinder to the players that love them, even when there are bigger changes needed for them down the line.","replies":[]}]},{"poster":"WooBeeWoo","date":"2015-01-29T22:06:06.990+0000","up_votes":18,"down_votes":23,"body":"Love how the only thing I've seen you respond to is someone potentially misquoting you. Why do you guys never get on a board about the jungle and talk? seriously once in a thousand posts does any rioter ever get on a board that is really talking about balance. This is the kind of shit that makes me think you guys are scared or something. Get on a jungle board and talk about the jungle to us. Whining that someone misquoted you rather than ever show up on a board with real discussion is ridiculous.","replies":[{"poster":"Fearless","date":"2015-01-29T22:13:40.448+0000","up_votes":38,"down_votes":19,"body":"The main reason I even saw this post was because I'm on the boards talking to everyone about jungle balance...\n\nhttp://boards.na.leagueoflegends.com/en/c/gameplay-balance/hqw6bEoR-context-for-the-recent-jungle-item-adjustments\n\nThe main reason I don't do this more is because it is extremely time consuming, and generally creates as much misinformation as it does clarity. I'd much rather focus my time on the game's problems and making the game better for every player.","replies":[{"poster":"TheGrandAlliance","date":"2015-01-29T22:23:34.231+0000","up_votes":3,"down_votes":25,"body":"> [{quoted}](name=Fearless,realm=NA,application-id=3ErqAdtq,discussion-id=UU6eBAmE,comment-id=00060000000d0000,timestamp=2015-01-29T22:13:40.448+0000)\n>\n> The main reason I even saw this post was because I'm on the boards talking to everyone about jungle balance...\n> \n> http://boards.na.leagueoflegends.com/en/c/gameplay-balance/hqw6bEoR-context-for-the-recent-jungle-item-adjustments\n> \n> The main reason I don't do this more is because it is extremely time consuming, and generally creates as much misinformation as it does clarity. I'd much rather focus my time on the game's problems and making the game better for every player.\n\n... then get one of your minion friends to troll forms for you... In either situation:  It is difficult to \"make the game better\" if (RIOT) has incomplete understanding of player values.","replies":[{"poster":"Fearless","date":"2015-01-29T22:25:41.436+0000","up_votes":34,"down_votes":13,"body":"That would be true if the only way to understand player values was to read the forums. That's not the reality though. We do have entire teams of people that help people like myself understand how changes impact our players globally, and we are constantly reacting and updating our understanding.","replies":[{"poster":"Sneak Dog","date":"2015-01-30T01:28:04.783+0000","up_votes":13,"down_votes":0,"body":"People like to know that they're giving feedback and that they're being listened to though. The forum is one of the main ways to actively try to give feedback to Riot and as such, we get sad when we don't even know if we're being heard.","replies":[]},{"poster":"Subject 5","date":"2015-01-29T22:50:26.863+0000","up_votes":15,"down_votes":5,"body":"When will you think League of Legends will have a champion pool larger than 20 champions? I realize this is not the topic, but i would honestly like an answer. It is getting really hard to play the same stuff over and over again, Vi, Jar and Lee in the jungle while thresh is bot lane with another champion deemed OP for attempting at being at a similar level of thresh and top being the only lane that has diversity. Mid is a copy and paste of five champs and for some reason the balance team thinks adding mobility will help diversity. (RIP Ahri)\n\nThis season is honestly the absolute worst i've ever seen the game in, it actually does not require a brain to itemize an AD champion the only thing note worthy is if you are ranged or melee. Mid laners have to brain storm an hour and a half to think about what is the most productive way to use two spells before running oom for items or having no damage for buying a tear. The mana updates and items themselves don't even promote diversity, matter of fact you nerfed the items that promoted diversity and left the items without the use of a brain alone.","replies":[{"poster":"Cuix","date":"2015-01-29T23:42:58.645+0000","up_votes":5,"down_votes":12,"body":"Top: Gnar, Liss, Sion, Irelia, Renekton, Azir\nJungle: Lee, Rengar, J4, Rek'Sai\nMid: LB, Lulu, Ahri, Liss, Azir, Cassi (rip), Xer, Zed, Kass\nADC: Siv, Corki, Trist, Jinx\nSupp: Thresh, Leo, Annie, Janna, Lulu\n\nEven taking out the repeats (flex picks), that's more than 20. Seriously, this is *so not the time* to be complaining about overall game balance.\n\nI agree that itemization is brainless and that mana's in a weird place, but more champions are viable than people are realizing. It's fun to shit on the balance team, I guess, but the actual problems are elsewhere.","replies":[{"poster":"Alpharite","date":"2015-01-30T02:16:02.489+0000","up_votes":7,"down_votes":1,"body":"Around 26? (Ignoring repeats and stuff like Tristana and Renekton)\n\n26/123=20%\n\n4 out of 5 champions are not playable in a scenario representing competition, and you say game balance is good?","replies":[]}]}]},{"poster":"HowPlayGAEM","date":"2015-01-30T01:34:10.719+0000","up_votes":14,"down_votes":8,"body":"Your Sona changes made me quit the game.\n\nI really dislike you.\n\nKnow that if we happened to be together in a disaster setting, I would not back you up in a knife fight or help you fight zombies.","replies":[]}]},{"poster":"BADxW0LF","date":"2015-01-29T22:29:08.829+0000","up_votes":4,"down_votes":11,"body":"But it is also RIOT's game.  Not yours.  You play it, yes, but they know what they are doing.  They research everything that goes into every champ whereas a majority of this community continually bitches about either Sona or Lee Sin.  Maybe get over yourselves and play some different champs or find something on your own end to counter the effects of each champ?","replies":[{"poster":"TheGrandAlliance","date":"2015-01-29T22:48:43.344+0000","up_votes":10,"down_votes":1,"body":"> [{quoted}](name=BADxW0LF,realm=NA,application-id=3ErqAdtq,discussion-id=UU6eBAmE,comment-id=00060000000d000000000001,timestamp=2015-01-29T22:29:08.829+0000)\n>\n> But it is also RIOT's game.  Not yours.  You play it, yes, but they know what they are doing.  They research everything that goes into every champ whereas a majority of this community continually bitches about either Sona or Lee Sin.  Maybe get over yourselves and play some different champs or find something on your own end to counter the effects of each champ?\n\nWell... if they are not wrong, what is the problem?  DO you want the current meta LCS or otherwise to only \"accept\" 10-20% of the champions?  WHy not just delete the rest?  They don't matter of course.\n\n\nPlease... Does Riot \"research\"?  Perhaps... Do their conclusions meet up with reality?  Not if LCS teams have anything to say about it.","replies":[{"poster":"BADxW0LF","date":"2015-01-30T01:55:00.787+0000","up_votes":2,"down_votes":3,"body":"Um...they are a company.  Of course they do research.  Most of the champs that you are referring to were designed before the meta was created.  Metas can change.  People like you are doing that all the time, I am sure.  There are many things that work, so of course they are going to design around a meta.  If a new meta were to come out, say a duo jung to control the entire jungle, there would be more champs around now that would be more viable and Riot would create more champs to make this work.  \n\nWhat would you do to change up the meta?  To change up the game?  If you were in Riot's position, what would you suggest that they do to change something that isn't in their control?  The players control the meta and a huge majority of the player base plays the meta.  I'm sure Riot tries to think of ways to change the meta, but how much more can you really do with a game that has lanes and whatnot?  Here's what they HAVE done...created more game types for you to play.  Maybe they could expand on that and give us a whole new map.  That could be the next thing coming from them after they are done babysitting the new Rift.  They are nice enough to bring new game modes every few months that are exciting, so it's not like they don't try to bring something new to the game.  It's just that a meta has been set by most players and if something is going to change, it is up to us to help that along by discovering these new ways to play and posting about them here.  \n\nSide note:  I like how whenever someone stands by Riot and defends their actions as a business, that person get's downvoted.  Come on people.  Try to see some things from a business perspective before you get downvote happy.","replies":[{"poster":"TheGrandAlliance","date":"2015-01-30T09:06:00.680+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=BADxW0LF,realm=NA,application-id=3ErqAdtq,discussion-id=UU6eBAmE,comment-id=00060000000d00000000000100000000,timestamp=2015-01-30T01:55:00.787+0000)\n>\n> Um...they are a company.  Of course they do research.  Most of the champs that you are referring to were designed before the meta was created.  Metas can change.  People like you are doing that all the time, I am sure.  There are many things that work, so of course they are going to design around a meta.  If a new meta were to come out, say a duo jung to control the entire jungle, there would be more champs around now that would be more viable and Riot would create more champs to make this work.  \n> \n> What would you do to change up the meta?  To change up the game?  If you were in Riot's position, what would you suggest that they do to change something that isn't in their control?  The players control the meta and a huge majority of the player base plays the meta.  I'm sure Riot tries to think of ways to change the meta, but how much more can you really do with a game that has lanes and whatnot?  Here's what they HAVE done...created more game types for you to play.  Maybe they could expand on that and give us a whole new map.  That could be the next thing coming from them after they are done babysitting the new Rift.  They are nice enough to bring new game modes every few months that are exciting, so it's not like they don't try to bring something new to the game.  It's just that a meta has been set by most players and if something is going to change, it is up to us to help that along by discovering these new ways to play and posting about them here.  \n> \n> Side note:  I like how whenever someone stands by Riot and defends their actions as a business, that person get's downvoted.  Come on people.  Try to see some things from a business perspective before you get downvote happy.\n\n\n\n1.  Companies do \"research\".   That doesn't mean they are good at it.  Otherwise Elder Scrolls Online would still have 1+million plus subs and not be going F2P as all predicted.\n2.  \"Meta\" is relative, and more of an illusionary concept then reality.  The \"meta\" exists because others think it does.  Kinda like money.  Or Government.\n3.  A \"business perspective\" is about making customers happy.  We are the customers.  IF we are not happy we are far likely to spend time in LoL, buy micro-transacions, and new players will \"stay away from evil MOBAs\".  So yes our opinions, whether justified or not, do matter, and must be addressed AND resolved.\n\nWhat \"would I do to fix the game?\" you ask?  Not including champion-specific issues:\n\n1.  Remove concept of \"last hits\"... make gold locally shared or otherwise (few ways to go about it) but don't allow minions to \"last hit\" or otherwise KS laning phase.  Game needs to be more about trading between champions and not just AFK farming for 10 min.  This concept is especially true in LCS whereas both sides basically agree to not attack each other without a gank and just farm the whole time.\n2.  Jungle needs to be far easier.  Jungler needs to be more fed then rest of team at early game and thus a bigger threat because the jungler has no purpose late game... and with current jungle he probably isn't even a threat to your lane (if you either ward/guess correctly) of course unless he is {{champion:64}} .  Otherwise Top lane is usually most fed first, then mid, then bot, then jungler.\n3.  Boost gold for kills/assists; lower gold for minions.  This can be time adjusted as to not affect late game farming (if losing team is pushed and farming only way to survive).  You shouldn't be able to \"outfarm your way\" out of a good kill as is commonly done if you watch gold scores in LCS.  The effort it takes to make a kill is far greater then effort to AFK farm.\n4.  Get rid of {{item:3026}} \n5.  Make {{summoner:1}} remove EVERYTHING like {{item:3140}} .  Right now the \"current meta\" only includes a few of the total number of summoner's skills.  The others need to be buffed.\n6.  Boost defence of inhibiter/nexus turrets.  Right now they are far to easy to seige down in even 5v4 situations if you take out the right target.  This game allows a slightly ahead team to push too aggresively especially late game at full build.  The turrets don't even cause damage.  Counterplay to this is items such as {{item:3056}} \n7.  Create new item slot used only for potions.\n8.  Buff {{item:3340}} and its upgrades so it can be a viable (if not entirely) replacement to {{item:2049}} .  Warding shouldn't take up a viable slot, nor should it be relagated to only supports.  If \"too many wards\" are on the map then items can be adjusted thereof.\n\n\nThere are problably some others I have to try to remember everything but yes.. there is like 139471043 7 things that can be done to change nature of game.  Point is RIOT just goes about it the wrong way every time.\n\n\nIndeed it is so...","replies":[{"poster":"BADxW0LF","date":"2015-01-30T15:26:33.201+0000","up_votes":1,"down_votes":2,"body":"> Companies do \"research\". That doesn't mean they are good at it. Otherwise Elder Scrolls Online would still have 1+million plus subs and not be going F2P as all predicted.\n\nElder Scrolls Online is a completely different game and was doomed to fail from the beginning because it was up against an already extremely popular game (WOW).  They couldn't even come close to the amount of success that WOW has and it flopped.  It was a great idea, but it was already too late to implement.\n\nCompanies do research, but it's not always going to be about what you want specifically.  How many people do you think play this game?  Just the amount of people in the boards?  \n\n> \"Meta\" is relative, and more of an illusionary concept then reality. The \"meta\" exists because others think it does. Kinda like money. Or Government.\n\nAh.  You're one of those people.  The meta may be relative, but it is the best representation of the game.  There are multiple ways to play the game, but this way seems to work out the best and people like it.  You can play the game however you want (duo top w/ no jungler, duo jungle, duo mid, whatever you want), but you can't deny that the majority of the community plays this way on this map because it is the best and most strategic way to play that specific map.  Again, the only way you can change up the \"meta\" is to play a different game style or play with your friends in a custom game or have a 5 man team ready to all play the way you would like to play.\n\nMoney and government are not relative.  It needs to exist.\n\n> A \"business perspective\" is about making customers happy. We are the customers. IF we are not happy we are far likely to spend time in LoL, buy micro-transacions, and new players will \"stay away from evil MOBAs\". So yes our opinions, whether justified or not, do matter, and must be addressed AND resolved.\n\n\nA business perspective is partially about making customers happy.  It is also about testing out different things (PBE) and getting feedback.  The PBE is where they test out all of their ideas with a limited scope of players.  The one's who provide a rational opinion rather than bring in the pitchforks and torches.  A lot of the opinions on here are definitely not justified.  They are the product of angry whiny teenage angst and very few give opinions in a calm fashion.  Too many in this community are toxic when they complain.  Y'all remind me of Dudley from Harry Potter.\n\n\n\n\n\nI never said \"fix the game\"  I said \"change the game\", like change the way it is played.  Way to go off topic, but here you go:\n\n\n> Remove concept of \"last hits\"... make gold locally shared or otherwise (few ways to go about it) but don't allow minions to \"last hit\" or otherwise KS laning phase. Game needs to be more about trading between champions and not just AFK farming for 10 min. This concept is especially true in LCS whereas both sides basically agree to not attack each other without a gank and just farm the whole time.\n\nThis takes strategy out of the game.  Why bother having minions in the game, then?  Just have a continuous gold income.  It just sounds like you are wanting to not think about decisions and tactics.  \n\n> Jungle needs to be far easier. Jungler needs to be more fed then rest of team at early game and thus a bigger threat because the jungler has no purpose late game... and with current jungle he probably isn't even a threat to your lane (if you either ward/guess correctly) of course unless he is  . Otherwise Top lane is usually most fed first, then mid, then bot, then jungler.\n\nI don't see why everyone thinks the jungle is so hard?  Is it because everyone was so used to having it easy with more pots and being able to stay in longer for your first run through?  I am not a jung main, but played it last night and had no issues with my clear.  I made it from toad over to wolves, recall, then other side and gank.  What is so difficult about it?  Is it just that some are having a harder time (Eve)?  I played with amumu and I kept up pretty well.  Sure I was more behind, but I also get the buffs from the jung to help me out when I come in for a gank.  If you were to say anything, I would say make it so they are more on par with lanes by giving a bit more xp/gold, but they should definitely NOT be the most fed early game.  \n\nThey are also not useless late game.  Have you not seen the most recent changes they did to Jungler items?  You can now smite enemy champs for damage and other debuffs.  They are most certainly not useless.\n\n> Boost gold for kills/assists; lower gold for minions. This can be time adjusted as to not affect late game farming (if losing team is pushed and farming only way to survive). You shouldn't be able to \"outfarm your way\" out of a good kill as is commonly done if you watch gold scores in LCS. The effort it takes to make a kill is far greater then effort to AFK farm.\n\nIf someone is AFK, then that is not the problem of the player that IS there farming.  Again, yo uare taking strategy out of the game by making it \"fair for everyone\".  You are doing what Mario Kart mothers did to the new MK.  Everyone has to finish the race before it ends instead of just ending even if 12th place is a lap behind PLUS giving 12th place a point because \"oh my son didn't get a point and he should to make him feel better\".  You are babying the players because some people are AFK.  You should be able to outfarm someone and have the gold to show it because you were better at CSing than your opponent.  It helps show who is the better player.  \n\n\n> Get rid of {{item:3026}} \n\nI could see this one.  A lot of people buy it for their main source of defense, though.  I could see maybe nerfing either the passive or the stats a bit, too, so as to keep it in the game instead of getting rid of it completely.  No explanation from you as to why getting rid of it so can't really counter why you think this.\n\n> Make {{summoner:1}}  remove EVERYTHING like  {{item:3140}}. Right now the \"current meta\" only includes a few of the total number of summoner's skills. The others need to be buffed.\n\nThere have been...talks...about reworking summoner spells.  Nothing is set in stone.  I don't think removing them is the answer.  Maybe increase the CD for them so they can't be used basically every team fight.  \n\n> Boost defence of inhibiter/nexus turrets. Right now they are far to easy to seige down in even 5v4 situations if you take out the right target. This game allows a slightly ahead team to push too aggresively especially late game at full build. The turrets don't even cause damage. Counterplay to this is items such as {{item:3056}} \n\nAgain, you are babying the losing team.  You are making me think that you lose a lot with all of these benefits for a losing team.  They are losing.  They are not the better of the teams.  They CAN come back and win by farming, but it's a battle.  In a real war, do you think the little guy can come up with money or get better defenses?  Not likely.  It takes strategy and teamwork.  \n\n> Create new item slot used only for potions.\n\n........no\n\n> Buff {{item:3340}} and its upgrades so it can be a viable (if not entirely) replacement to {{item:2049}} . Warding shouldn't take up a viable slot, nor should it be relagated to only supports. If \"too many wards\" are on the map then items can be adjusted thereof.\n\nAgain, no.  It should take a viable slot.  It is a strategic item in the game that should take up a slot.  I could see buffing sightstone, but not the trinkets.  They are supposed to be slightly weaker.  If everyone were to upgrade their trinket in game like they are supposed to, you could have the entire map lit up.  But it should not replace sightstone.\n\n\nFrom my perspective of what you have describe, you are all about babying the losing team.  You are the mother who complains that their child didn't get anything.  You are the reason for the participation award. :P","replies":[{"poster":"Biffolo","date":"2015-01-31T23:51:41.303+0000","up_votes":2,"down_votes":0,"body":">  You are the reason for the participation award. :P\n\nThis^. People need to understand, if you get outfarmed by your opponent because they were better at it and you couldnt engage on them because they were smart? News flash people, that means you arent as good and DESERVE TO LOSE. I dont know why people come into a competitive game expecting it to give them whatever crutches they need. It has what it has for a reason. If you feed them, or they massively outfarm, you DESERVE to get sieged out and lose. Why? Because you arent as good, and at the end of the day, if you are not as good, you SHOULD LOSE.","replies":[]}]},{"poster":"The Epicer ONe","date":"2015-01-30T15:38:18.567+0000","up_votes":2,"down_votes":0,"body":"can u not say the meta is fake, everything is perception. im getting tired of ppl who say that. everything is fake and is what we percieve and the meta is what works the best. meta is more of what works the best. being \"good\" requires perception that winning is good which ahs been around for millions of years. in ur logic winning is relative.","replies":[]}]}]}]}]}]},{"poster":"Lao Fu the Tiger","date":"2015-01-29T23:23:45.862+0000","up_votes":8,"down_votes":1,"body":"> [{quoted}](name=Fearless,realm=NA,application-id=3ErqAdtq,discussion-id=UU6eBAmE,comment-id=00060000000d0000,timestamp=2015-01-29T22:13:40.448+0000)\n>\n> The main reason I even saw this post was because I'm on the boards talking to everyone about jungle balance...\n> \n> http://boards.na.leagueoflegends.com/en/c/gameplay-balance/hqw6bEoR-context-for-the-recent-jungle-item-adjustments\n> \n> The main reason I don't do this more is because it is extremely time consuming, and generally creates as much misinformation as it does clarity. I'd much rather focus my time on the game's problems and making the game better for every player.\n\nFearless, I appreciate your boldness walking into a firestorm like this. And I know you're under tons of pressure from all directions with regards to design. And I realise you've got a huge load of work on your plate, and that the community feedback is just as often uselessly unhelpful as it is helpful.\n\nYou are a leader. You are a Rioter that people look up to. People will make degrading comments, people will misinterpret information, people will  question your motives. And as both an Eagle Scout and as the \"leader\" so to speak of a nationally recognized ethics debate team (since everyone else graduated, I'm now in position to help get everybody on the team currently up to speed), I can understand how bad it feels when a statement made is derogatory towards you, whether it be from simple miscommunication, or opposition to a stance, or simply nothing aside from unpopularity with the crowd. Granted, none of these are on the same scale as a multi-million dollar company, but I can sympathise with how it feels to a certain extent.\n\nHowever, these are the burdens of being a leader. And a leader's job, as you've said so many times, isn't necessarily to be popular, or to be perfect, or to even make 100% certain that he's interpreted correctly by the people he leads. Granted, these are all goals and pluses, but they aren't the core purpose of leaders. However, one of the core aspects of being a leader is being able to communicate with those that follow you. Yes, it means there will be criticism. It means there will be opposition. \n\nWhat's important to understand from a leader's perspective, though, isn't that people hate you making posts and hate that you're posting to us. People may dislike the content you post, but despite the downvotes on posts, and despite the criticism, I guarantee that you will never encounter a post that reads, \"Fearless, stop posting on the forums.\" Criticism of content is inevitable, but communication between a leader and his followers is necessary and of utmost importance, despite being very time consuming. Giving an unpopular opinion is one thing; these opinions may indeed be for the better of the whole despite the cries of the few.  However, leaving a group of followers in the dark, wondering, is an entirely different beast.\n\nAs leaders, we are responsible for maintaining the integrity of the whole mechanism. As leaders, this means making sometimes incredibly controversial decisions. There will never be unanimity with regards to anything that requires a decision to be made. But as leaders, it is our job to inform those we lead about the decisions we've made and why we've chosen to make those decisions, regardless of the recoil we may receive.\n\nIn the end, the entire community is aware that you are acting in the community's best interest, even if it doesn't appear to be so from the initial feedback. Most of the crew here understands not all changes can happen immediately, but people are impatient. It's part of the human problem. Just be patient with the community, be a leader, and realise that even if we \"boo\" your content as it stands when it first is released, we truly appreciate the fact you cared to post and give us context about changes.\n\nWe are on your side.","replies":[]},{"poster":"Hellioning","date":"2015-01-29T23:39:38.718+0000","up_votes":6,"down_votes":0,"body":"Right, Fearless, this is mostly just pedantic, but when I hear that a rioter is 'talking to everyone' I assume they're replying back, and your last post in that thread was 15 hours ago. I certainly believe that you're reading the thread (and hopefully not feeling too lambasted) but that might be the sort of wording that people can get annoyed with really easily.","replies":[]}]}]},{"poster":"GnomeDigest","date":"2015-01-29T21:45:37.487+0000","up_votes":12,"down_votes":2,"body":"> [{quoted}](name=Fearless,realm=NA,application-id=3ErqAdtq,discussion-id=UU6eBAmE,comment-id=00060000,timestamp=2015-01-29T21:24:35.512+0000)\n>\n> I get that my projects haven't been popular on boards, and I have a lot of room to grow on how I communicate to this group specifically. \n\nI think the first thing Riot teaches employees when talking to the community is that as a Riot employee never tell the community you made a mistake, just tell them you communicated poorly.\n\nI agree with the OP though. With the recent changes (or lack there of) it often feels like the balance team doesnt play or watch this game.\n\nThat the jungle is a complete mess and the season has already started is really bad. But then, if what Riot wants is Lee, J4, and Reksai every game then kudos! Another job well done. The level of jungle champion diversity they have achieved is fantastic, if you completely reverse the definition of \"diversity\".","replies":[{"poster":"Alpharite","date":"2015-01-30T02:20:56.230+0000","up_votes":8,"down_votes":0,"body":"I personally love the strategic diversity this season. It's so interesting trying to decide wheather to press right click or left click to buy stalker's blade when I'm playing one of the 3-5 viable junglers atm.","replies":[]}]},{"poster":"Drunk Rummate","date":"2015-01-29T21:34:52.955+0000","up_votes":12,"down_votes":2,"body":"> [{quoted}](name=Fearless,realm=NA,application-id=3ErqAdtq,discussion-id=UU6eBAmE,comment-id=00060000,timestamp=2015-01-29T21:24:35.512+0000)\n>\n> That's a pretty terrible misrepresentation of what I've said. I admitted I didn't spend enough time responding to the feedback, but that's not the same as ignoring it. I didn't stop reading the feedback, but I didn't do well enough explaining what we were seeing internally, and how that was different from what PBE was seeing. \n> \n> I get that my projects haven't been popular on boards, and I have a lot of room to grow on how I communicate to this group specifically. That being said, knowing that anything I post will actively be misrepresented like this does really make me hesitant to do this with many posters.\n\nI can't blame you for being hesitant, but I think it's still ya'lls duty to at least comment reasoning behind changes to us.  Being misrepresented can be annoying, but if you present yourself logically and people take the time to read your posts, there will emerge useful discussion on the topic and maybe even support for your changes.\n\nI don't know who was behind the changes to Ahri, for example, but I think they also did a poor job in explaining any reasoning to us.  It seems Ahri was changed from an assassin into a mage because \"Thats how we want her to be\" and I saw nothing mentioning her on these forums aside from the small quip in the DFG removal post.  It made me angry to see her archetype change for seemingly no reason, and while her new version is quite fun and powerful, I still have a hard time enjoying her because of how little whomever was in charge seemed to care about her as an assassin and that huge aspect of her identity.  It left me bitter.  And while I may have disagreed if someone came on here and posted logically why they changed her into a mage, at least I would feel better about the end result if they had.","replies":[]},{"poster":"ImHerVoice","date":"2015-01-29T21:44:09.313+0000","up_votes":8,"down_votes":0,"body":"Honestly that 100g change was unneeded.\nthe chilling smite and sabre nerfs were needed (and imo chilling smite should be weaker like 15-10% MS steal instead of 20% but thats another conversation)\n\nI think the new jungle is an interesting start.\nBut I also think its far too taxing on the weaker clearing junglers.\nI have alot of issues clearing as eve in particular for example.\nMost the champions with a shield or percentage damage are perfectly fine.\nthe hp on these monsters is high so its very useful for someone like j4 or shyvana.\n\nI'm not saying buff eve I'm saying you need to consider alot of champions that don't have percentage damage and have poor sustain already.\nYes obviously buffs mean the stronger ones get stronger.\nBut thats fine.\nThe more picks you can have the better.\nyou guys want diversity? \n\nwell here you go.\n\nyou guys need to really jack up the exp+ gold gained.\nyou take so much damage and gain very little.\n\nI honestly went from 100% to 40% fighting the second spawn of wraiths one game as eve despite having armor boots and the tier 2 purple smite \n\nIts redickulous the amopunt of damage you take.\nI think alot of the attack speeds on the camps should be lowered if they're going to hit hard make them hit less often.\nYou'll still take damage but it will be slower.\nI think that would help even out the champions with a weaker clear time then others.\nLike rammus right now is really hurting same with alot of the tanks tbh.\n\nthe mana issues are a thing but I think if you guys added a bit more gain per camp on mana refunding on killing camps that could help as well.\n\nYou guys did alot of interesting things.\nthe issue is you're not fixing it up you're leaving it for months on end.\ngotta be quicker and more decisive.\nNot everyone loves the changes.\nBut something is better than nothing.","replies":[{"poster":"IronChefBoyardee","date":"2015-01-29T21:47:25.741+0000","up_votes":3,"down_votes":0,"body":"Did you kill the small wraiths (er razorbeaks w/e) first? that's the trick to that camp, they do just as much as the big guy almost. kill them first and you'll be alright.","replies":[{"poster":"ImHerVoice","date":"2015-01-29T21:50:01.342+0000","up_votes":3,"down_votes":0,"body":"the problem is eve's Q honestly it has the Ai of a gragas IRL.\n\nIt will target 1 minion in the middle of nowhere isntead of what you're auto attacking.\nIt should prioritize the enemy being auto attacked always this allows you to position the camp better next time.\nThere are work arounds to this like kiting the camp a little to line up the smaller ones better.\nBut it shouldn't be a hastle to make it work and regardless the amount of damage per camp does not equal out when you're gaining little to no exp and hardly any gold for the damage taken.\n\nThis applies to every champion.\nIf I lose 300~ hp a camp I should be gaining 70-200 gold(obviously this would scale)","replies":[]}]}]},{"poster":"Direwolfiez","date":"2015-01-29T23:13:13.041+0000","up_votes":8,"down_votes":1,"body":"The links are from what you said.  I also posted a direct link to all of your posts via your Boards profile, in case someone felt like getting better context.  Granted, you didn't directly say \"ignore\" in your post, but from the context, that what it sounded like to me.  \n\nI'm not saying that you're inherently a terrible person and game designer.  Kudos on responding to a semi-hostile post, by the way; I admit I'm bitter about the Sona rework in general, and that has affected my perception of you.\n\nThat said, when you make really unpopular changes, like the Tier 2 jungle item cost increase and the Sona rework, you've *got* to keep communication open and update people on what you're doing to fix the perceived problems, or at least try and convince people that your view of the situation is correct.  I can't really blame Sona players for being pissed at you, simply because you've said that she'll get some more work, yet all she's been getting is nerfs with very, very minor buffs in ways that don't really help her out that much.  A lot of junglers are also really irritated, simply because the cost increase, at least to them, only seems to punish junglers with poor clear times (a lot of tanks) or no sustain, while buffing the ones that already have those qualities.  I know that a lot of people, including myself, feel that our feedback doesn't matter to you anymore, since changes that (seemingly) a lot of people vocally oppose are still pushed through the PBE anyway, even though we basically throw our thoughts and opinions about them at you (Rioters in general), and you (again, Rioters in general) just seem to brush them off and say, \"Our view of the game is correct; deal with it or stop playing\".\n\nI apologize if I sounded hostile, but I find it hard to think positively about your projects.  Again, I don't dislike you personally, it's just I *really* dislike how your changes have affected the game.","replies":[]},{"poster":"Baron Von Bangin","date":"2015-01-29T21:47:43.523+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=Fearless,realm=NA,application-id=3ErqAdtq,discussion-id=UU6eBAmE,comment-id=00060000,timestamp=2015-01-29T21:24:35.512+0000)\n\n> \n> I get that my projects haven't been popular on boards, and I have a lot of room to grow on how I communicate to this group specifically. That being said, knowing that anything I post will actively be misrepresented like this does really make me hesitant to do this with many posters.\n\nI sincerely hope that really isn't the case.  Why would you let one Negative Nancy ruin it for the rest (and much larger) Boards users just because one guy says some rude stuff?\n\nSome criticism is to be expected, that goes for anyone here on the Boards.  But as a Rioter you're seen as an authority on matters concerning everyone's favorite game so you're bound to get much more attention.  Don't let that deter you from coming here to engage the playerbase :/","replies":[]},{"poster":"iamthegoatofwar","date":"2015-01-29T22:05:33.267+0000","up_votes":8,"down_votes":3,"body":"Perhaps if you and the guys at riot started listening to the community as a whole and not just your LCS players we wouldn't have this issue. Sona mains lashed out at the kit rework, and now all you're doing is nerfing her while leaving say...leona untouched. God I hate leona.\n\nYou ignore the fact that lee sin is one of the best junglers and the only one who can even think of challenging him now is J4 at all points in the game. When warwick was able to challenge lee you guys nerfed him for it.\n\nAlso lets talk about the fact Zed has almost no counter play.\n\nStop ignoring the regulars and listen to what the community as a whole wants.","replies":[{"poster":"Handin Out Naps","date":"2015-01-30T00:39:33.352+0000","up_votes":8,"down_votes":4,"body":"By challenge {{champion:64}}  you mean 1 shot everything with a suppress, while healing back to full health, and being super tanky?  Im sorry that isn't challenging {{champion:64}} that was 10x worse than {{champion:64}}.  The guys ban rate was so high it was stupid.  {{champion:238}}  has no counter play...  Im sorry you mean the ult reliant assassin that gets crushed by {{champion:10}}, {{item:3157}}, {{item:3140}}, and {{champion:127}} ?  And can we speak honestly here, Im actually so sick and tired of seeing people qq about {{champion:238}}.  Oh the guy can 1 shot tanks, he can tower dive u at 6 and 100-0 u and get out safely, oh the guy has no counters... bullshiiiiiiit.  {{champion:238}} has one problem and one problem only, his ability to clear waves.  That is litterally the only problem.  Dont tell me he will tower dive u at lvl 6 no matter what.  You have to be at atleast 40ish% and at that point honestly any assassin is going to tower dive you and get out easily.  And lets speak about {{champion:37}}  for a second.  Do you realise how utterly annoying it is to lane against her.  She litterally just runs at you pokes you with a targeted ability and walks away free.  And she keeps fucking doing it.  Atleast {{champion:89}}  and {{champion:412}}  have to land some skill shots, they dont just sit there and poke you to death while keeping their adc at full health 24/7.","replies":[]}]},{"poster":"Pika310","date":"2015-01-30T07:53:44.088+0000","up_votes":4,"down_votes":0,"body":"Wasn't it you yourself who claimed you have \"thick skin?\"  How about using some of that to man up and explain why Sona has had:\n\n* 21 direct nerfs(17 of which all occurred simultaneously on July 30th)\n* 2 secret nerfs\n* and 9 indirect nerfs in the timespan of only 6 months?\n\nNot to mention she has 2 more direct nerfs and some more indirect already scheduled for patch 5.3?\n\nIf you set your arrogance aside for 1 second and actually think about this impartially, you'll understand why the community has these negative feelings towards you.","replies":[]},{"poster":"Stephenizgod","date":"2015-01-29T21:56:29.673+0000","up_votes":3,"down_votes":0,"body":"There are a lot of people who appreciate you guys communicating with us. There are times where we wish for a bit more information and details, but honestly anything we get is nice. Of course there will always be people who disagree or twist your words, but just ignore them. I know you guys are busy so getting information out there can be tough, but i think we would all appreciate a bit more information on the Boards instead of Reddit exclusively.  \n\nI will admit that there is a lot of balance problems i have issues with, but i dont hate Riot or any employees. You have your reasons for what you do and say, but i hope you dont let people discourage you from communicating with us.","replies":[]}]}]},{"poster":"ImHerVoice","date":"2015-01-29T19:29:50.370+0000","up_votes":20,"down_votes":1,"body":"welcome to league of Esports\nwhere a company that wants to control whats played in high elo/Pro scene does it.\nAnd this is what you get.\nIts like sc2 all over again.\nExcept less korean teams.","replies":[]},{"poster":"Miku Lv99","date":"2015-01-29T20:18:42.518+0000","up_votes":16,"down_votes":0,"body":"Right now is probably the worst the game has ever been balanced.  There are a lot of champions that are significantly OP and a lot of champions that are just almost completely unusable.  The difference between the good and bad champions is way too big.\n\nAlthough, in an attempt to be fair, this is the hardest the game has ever been to balance.","replies":[]},{"poster":"WooBeeWoo","date":"2015-01-29T20:27:43.906+0000","up_votes":15,"down_votes":0,"body":"This is hands down the worst this game as been since I started playing. Balance blows","replies":[]},{"poster":"Rynth","date":"2015-01-29T21:47:01.880+0000","up_votes":11,"down_votes":0,"body":"It's been worse, but only a few times before the meta was even established.  60 second invis twitch with tiamat on his ult would proc ~15 autoattacks worth of damage per enemy per shot when hitting all 5 enemy champions.  Jax could stack 6 ninja tabis to get his stun reset anytime someone autoattacked him without sword of the divine active.  Release xin.  \n\nIf you want to succeed now, you have to play the fotm champions.  A couple years back, fotm champs were considered slightly stronger.  Now the game mechanics (such as the jungle changes) have been made in a way such that you have to play them.\n\nThe problem with the state of the game right now is less that some champions are overpowered, that would be easy enough to fix in a patch or two, but riot has shifted from developing a game for the players to developing a game meant to be spectated.  Don't get me wrong, some rioters are still clearly making an attempt to please the player-base and we all appreciate their efforts, but issues such as zed's dominance of the midlane and cass' rework stripping the character of her identity just wouldn't have happened a couple years ago and I can't help but miss the company that riot used to be.","replies":[]},{"poster":"Kalarepa","date":"2015-01-29T20:43:45.046+0000","up_votes":10,"down_votes":0,"body":"I just opened LCS. GMB vs SK. 9/10 champions with gap closers, the only one without is support Lulu. Great balance, Riot.","replies":[]},{"poster":"Skias","date":"2015-01-29T23:25:44.575+0000","up_votes":7,"down_votes":0,"body":"I love Riot and League. Even though I get frustrated with balance team's choices concerning marksmen, the jungle and free stats, im still invested in the game. Ive been playing since season 1, and this is the first season I dont really even want to touch ranked. \n\nThe new jungle seems to be so steep for players to learn, they can hardly even manage it most games. Factor in the crazy dragon buffs and now you have a situation where the game quickly snowballs out of control.\n\nI enjoy the game a lot less with the high mobility, crazy damage and ineffective resistances. It feels less like a strategy game and more of a twitch reflex game. \n\nI always hope that Riot will reevaluate they power they give high mobility, high sustain champions but patches go by and it doesn't happen. \n\nI might not be the most qualified player to make these judgements, but I am a long time customer and fan.","replies":[]},{"poster":"lojician","date":"2015-01-29T21:54:26.423+0000","up_votes":7,"down_votes":0,"body":"As a top lane main absolutely hell yes. The lane was transformed from 1v1 melee (so there's more pressure and denial opportunity) deathmatch into being dominated by champions you have to play defensively against on almost the entire class of champions that I enjoy and basically just being a farm lane until you teleport into teamfights if you really want to play optimally.\n\nIt's not so much that new top lane sucks as that they had a great thing that a lot of people liked and they decided to replace it with something else entirely. And when what they've replaced it with is ranged harass spam and lcs teleport plays it's pretty easy to believe it's the intentional decision of the balance team to tell everyone that enjoyed old top lane to screw off because they like the new thing.","replies":[]},{"poster":"Akesgeroth","date":"2015-01-30T04:30:15.279+0000","up_votes":1,"down_votes":3,"body":"The game has seen far, far worse when it comes to balance.","replies":[{"poster":"chumbler","date":"2015-01-30T04:55:25.669+0000","up_votes":7,"down_votes":0,"body":"> [{quoted}](name=Akesgeroth,realm=NA,application-id=3ErqAdtq,discussion-id=UU6eBAmE,comment-id=0023,timestamp=2015-01-30T04:30:15.279+0000)\n>\n> The game has seen far, far worse when it comes to balance.\n\nNo, it really hasn't.","replies":[]}]},{"poster":"Seor Karthus","date":"2015-01-30T06:57:12.426+0000","up_votes":6,"down_votes":0,"body":"Obviously Riot had to reply to an empty whiny thread and not to the thoughtful and detailed ones that have been going on all this week.\nTalking about cherry picking to justify their lack of communication...","replies":[{"poster":"chumbler","date":"2015-01-30T07:06:57.166+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=OkamotoSenpai,realm=NA,application-id=3ErqAdtq,discussion-id=UU6eBAmE,comment-id=0029,timestamp=2015-01-30T06:57:12.426+0000)\n>\n> Obviously Riot had to reply to an empty whiny thread and not to the thoughtful and detailed ones that have been going on all this week.\n> Talking about cherry picking to justify their lack of communication...\n\nNo but you see all of the feedback they get is histrionics and bile and not accurate criticism!","replies":[{"poster":"Direwolfiez","date":"2015-01-30T07:19:30.113+0000","up_votes":3,"down_votes":0,"body":"Actually, if you look past my original, and admittedly pissy and childish post, I point out why I was so frustrated with the effects of his projects and why a lot of other people feel the same way.  Sometimes people just need to vent; I get really frustrated whenever I see a new round of Sona nerfs on the PBE without any real compensation or explanation, and this new round was no different from the last.\n\nIf you actually read my second post, I also apologized twice for what I said.  Doubt you could call that bile.","replies":[]}]}]},{"poster":"Solidair3","date":"2015-01-30T05:42:23.304+0000","up_votes":1,"down_votes":2,"body":"As if.\n\nLeague of Black Cleavers was the real nightmare. This shit is ezpz.","replies":[{"poster":"chumbler","date":"2015-01-30T05:45:57.571+0000","up_votes":6,"down_votes":0,"body":"> [{quoted}](name=Solidair3,realm=NA,application-id=3ErqAdtq,discussion-id=UU6eBAmE,comment-id=0026,timestamp=2015-01-30T05:42:23.304+0000)\n>\n> As if.\n> \n> League of Black Cleavers was the real nightmare. This shit is ezpz.\n\nBlack cleaver was a single easily fixed problem. The game's current state is rotting piles of band-aid fixes and bad design decisions that are started to fall apart.","replies":[]}]},{"poster":"Fuaztin","date":"2015-01-30T07:52:06.475+0000","up_votes":2,"down_votes":3,"body":"Voyboy said it was one of the best times to play with so much variety.  Watch the 5.2 update.  He knows what he's talking about.","replies":[]}]}