{"poster":"Syverin","date":"2014-05-12T10:40:41.236+0000","title":"LoL gépigény, avagy segítsetek!","subforum":"Általános beszélgetés","up_votes":1,"down_votes":0,"body":"Sziasztok!\r\n\r\nNem találtam ehhez hasonló témát,és nem is tudom hol lehetne máshol segítséget kérni ilyen ügyben, így emellett döntöttem.\r\nSzeretnék vásárolni egy új laptopot ( ugyanis a jelenlegin leggyengébb video beállításokkal is szaggat a lol, ami tarthatatlan,ugye :D), de mivel finoman szóval is analfabéta vagyok a hardveres dolgokhoz, szeretném a segítségeteket kérni. \r\n\r\nA fő kédés: milyen tulajdonságokkal (proci, vidikártya, stb) megáldott laptopot vegyek, hogy ha nem is full grafikán, de azt megközelítő beállításokkal ez a drága játék úgy hasítson, hogy azonnal challengerbe repítsen engem (nyilván csak vicc :P).\r\nRemélem akadnak itt gépzsenik, igazán hálás lennék pár hasznos tanácsért!","replies":[{"poster":"Solviana","date":"2014-05-12T15:36:50.622+0000","up_votes":2,"down_votes":1,"body":"Hali! Jópár peccsel (~1 éve) ezelőtt Riotnál mókoltak valamit ami után rendesen megugrott az integrált videókaris gépeken az fps. Én processzornak az asztalimban egy 3ghz p4-et használok és azzal is simán fut a játék, szóval egy i3 is bőven el fogja vinni a 60 fps-t. Én azt mondom hogy ha csak lolozni akarsz rajta akkor semmi szükség egy gamer laptopra elég egy 100e ft körüli valami.","replies":[]},{"poster":"Syverin","date":"2014-05-12T11:06:58.254+0000","up_votes":1,"down_votes":0,"body":"Köszönöm a linket, ez már segített. A videókártya rész viszont nem sokat mond nekem. Ahhoz valakinek javaslata?","replies":[{"poster":"STYXII1337ER","date":"2014-05-13T21:46:22.906+0000","up_votes":1,"down_votes":0,"body":"nekem egy msi gforce 8600 GT-m van azzal simán fut fullon a lol.\nplusz még társul hozzá egy IntelDualCore proci és 2x2gb Corsair ram.\nez mind felfektetve egy gigabyte ep43-ds3l anyucira.\nez a konfig lassan 6 éves.\na felsorolt cuccok 74ezer forintban álltak meg anno 2009ben.\nEhhez az összeghez próbálj valamit kalkulálni.\nTippeket sajnos nem tudok adni csak viszonyítást.\n\nÜdv, Styxii!","replies":[]}]},{"poster":"Code name Bullet","date":"2014-05-12T13:07:41.900+0000","up_votes":1,"down_votes":0,"body":"Ha kizárólag otthoni használatra vásárolsz gépet, akkor ne laptopot vegyél.(szerény véleményem szerint)\nSokkal jobban megéri az asztali pc. Olcsóbb fejleszteni. Ha valami tönkremegy benne, megint csak olcsóbb a csere.  \nÉn elhiszem, hogy a mai fiatalok (tizenévesek) körében most a laptop a \"yolo sweg\", de hidd el nem annyira éri meg. Nekem bedöglik a grafikusom kb 150e-200e az új és kész. Tesómnak besült a laptopján a grafikus 500e volt csak a javítás. szóval nem is újat kapott bele. És most akkor számolj.","replies":[{"poster":"STYXII1337ER","date":"2014-05-13T10:51:22.352+0000","up_votes":1,"down_votes":0,"body":"fél millió forint egy javítás... mi a tököm volt az egy nasa által fejlesztett startrek kópia v1.456.4.3.2 xyz parancsnoki híd gamer lap#yolo#swagtop?\n\n$$$$$$$$$$$$$$$","replies":[{"poster":"Code name Bullet","date":"2014-05-13T12:41:01.377+0000","up_votes":1,"down_votes":0,"body":"Valami chip ment el benne. Az volt nagyon drága. Meg gondolom a mesterek is rátették a részüket.","replies":[]}]}]},{"poster":"NesThaesis","date":"2014-05-12T12:25:14.570+0000","up_votes":1,"down_votes":0,"body":"A lol alacsony beállításokon egy i5 ös procis laptopon dedikált videókártya nélkül is megy.\n\nszóval bármit veszel amibe van videókártya ( persze nem netbook )azzal már menni fog. innentől kezdve csak arról szól a dolog hogy mennyit vagy hajlandó költeni rá.","replies":[]},{"poster":"benstone326","date":"2014-05-12T12:05:09.587+0000","up_votes":1,"down_votes":0,"body":"http://gepigeny.hu/games.php?id=1844","replies":[]},{"poster":"iSPZ","date":"2014-05-12T10:44:08.809+0000","up_votes":1,"down_votes":0,"body":"Részletesen én nem mennék bele, főleg laptop terén, de egy alap kiinduló pontot adok, a hivatalos [Minimális és ajánlott rendszerkövetelményekről](https://support.leagueoflegends.com/entries/32353500-Minim%C3%A1lis-%C3%A9s-aj%C3%A1nlott-rendszerk%C3%B6vetelm%C3%A9nyek) itt olvashatsz!","replies":[]}]}