{"poster":"DarianEX","date":"2017-09-24T20:52:21.608+0000","title":"This game is a joke","subforum":"Gameplay","up_votes":1,"down_votes":6,"body":"First day back after not playing for months. This game is a joke. Everyone has bad days and I understand that. Hear me out though.\n\n1. Pay to win or grind till you achieve the \"meta\" champions.  Just to rank up with. C'mon seriously?\n\n2. Toxic players. Out of the 3 games I've played \"to get back into things\" Toxic players everywhere on both teams.\n\n3. Imbalance of champions. In most games I've played like Overwatch or CS-GO its based on skill level on the free to play characters or weapons. In this game, the simplest of champions can be played with the \"correct\" items, and if you go something non meta for fun, well its not fun getting dominated and seeing a grey screen most of the game. \n\n4. Just isn't fun anymore playing this. I've came back to play to assist my brother with climbing and seriously it feels like I'm playing in a landfill of garbage. Just doesn't have the feel or the rush that I've experienced in other games. \n\n5. This is related to the imbalance game-play but should tanks destroy adc's super easily? Should say Heimerdinger that builds ZZ Rot + Rylais  + liandries survive through my lethality an take several hits just for him to die when hes an AP Caster not a tank. Doing as much dmg as a AP caster but as tanky as Gnar lets say. \n\n6. Waste of time, this game is mostly now, dying and looking at a grey screen for max of a 1 min? Wut? Seriously. Sure its 10 seconds at first an builds up but still. When I can pretty much \"toss it on the ole winnie\" and can come back before Im back into the game. That's sad, People with ADHD or mental impairment that that effects their focusing ability. 30 Seconds can feel like decades. Icould be doing something else with my time rather than sitting in a waiting to respond just to die again to imbalance \"meta\" champions.\n\n7. Talking about \"meta\" its a guideline for champions of what is better right? Like in Overwatch there's a meta (Like junkrat, soldier, symmatra and doomfist )but at least I can play my favorite hero like (hanzo, tracer, and reaper) and still do good if I have enough skill with him/her. In this game there's none of that. \n\nLast and finally, I had a blast playing this game and could't believe I wasted so many hours on this game an paid money just to quit. Lesson learned.\n\nThanks for sharing your games and time with me and take care! Thanks for reading!\n\nHope to see some of you in the future! :D\n\n **I QUIT** \n\nCya &lt;3\n\n\n\n{{sticker:slayer-jinx-catface}} ","replies":[{"poster":"MagicFlyingLlama","date":"2017-09-24T21:02:41.573+0000","up_votes":5,"down_votes":6,"body":"**1 - Pay-to-Win:** Lol, no. Not even remotely\n\n**2- Toxic Players:** Queue problems, they vanish if you stop playing kiddiequeue, same as all pvp games.\n\n**3- Balance:** Not really a big deal below very high levels of play, player skill means way more than tiny balance differences. Things that crush you because you are bad are not inherently broken.\n\n**4 - oh.. i see..** Dont play ranked if you want to enjoy any pvp game, ranked is a trash fire of screaming brats and godawful garbage players feeding their asses off.","replies":[{"poster":"Shiznyte","date":"2017-09-24T21:22:45.774+0000","up_votes":4,"down_votes":0,"body":"> **3- Balance:** Not really a big deal below very high levels of play, player skill means way more than tiny balance differences. Things that crush you because you are bad are not inherently broken. \n\nTell this too {{champion:96}} , {{champion:29}} , and {{champion:18}} LOL","replies":[{"poster":"MagicFlyingLlama","date":"2017-09-25T01:46:40.035+0000","up_votes":1,"down_votes":1,"body":"Slightly broken, still not that hard to beat, nerfed into ground in preseason.","replies":[]}]},{"poster":"DarianEX","date":"2017-09-24T21:10:53.388+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=MagicFlyingLlama,realm=NA,application-id=3ErqAdtq,discussion-id=P1IJE3se,comment-id=0000,timestamp=2017-09-24T21:02:41.573+0000)\n>\n> **1 - Pay-to-Win:** Lol, no. Not even remotely\n> \n> **2- Toxic Players:** Queue problems, they vanish if you stop playing kiddiequeue, same as all pvp games.\n> \n> **3- Balance:** Not really a big deal below very high levels of play, player skill means way more than tiny balance differences. Things that crush you because you are bad are not inherently broken.\n> \n> **4 - oh.. i see..** Dont play ranked if you want to enjoy any pvp game, ranked is a trash fire of screaming brats and godawful garbage players feeding their asses off.\n\nI used to think like you. For my skill? I was doing the best on my team? Haha nice try. Also, Im competitive I love feeling the rush of things. I love competing. League is the competitive but not a rush.  It is pay to win unless you want to waste time grinding. Read fully before commenting.","replies":[{"poster":"MagicFlyingLlama","date":"2017-09-25T01:45:54.971+0000","up_votes":2,"down_votes":0,"body":"People too new to have a good selection of champs are too new to be playing ranked anyway, and just freefall to bronze 5 where they belong.","replies":[]}]}]},{"poster":"Kaeblen","date":"2017-09-25T02:44:03.605+0000","up_votes":3,"down_votes":0,"body":"Have fun on Overwatch.","replies":[]},{"poster":"gabetheguy","date":"2017-09-25T02:07:22.948+0000","up_votes":2,"down_votes":0,"body":"you make a horrid pick and you do bad!?!?! WOW! who would've thought?!?!?","replies":[]},{"poster":"Fütanari","date":"2017-09-24T22:06:34.001+0000","up_votes":2,"down_votes":0,"body":"I am disappointed. I was 100% sure you were wood.","replies":[]},{"poster":"rework trundle","date":"2017-09-24T22:19:04.546+0000","up_votes":2,"down_votes":1,"body":">Pay to win\n\nPlease elaborate. Aside from very small advantages some skins give you (and increase your winrate by what, 0.1%?), money doesn't give you even the smallest edge possible over your opponents.\n\n-You can't buy runes with RP (and everyone can grind IP by playing the game)\n\n-You can't buy XP with RP (yes you do, but you have to play, and everyone can play)\n\n-You can't buy gold with RP\n\n>Waste of time\n\n>Just isn't fun anymore\n\nThat's not objective.\n\n>looking at a grey screen for max of a 1 min\n\nYou reach 1 minute death timer at around 40 minutes. Oh and 90% of games end before 30 minutes.\n\n>should tanks destroy adc's super easily\n\nIt's the other way around.\n\nAre we playing the same game?","replies":[]}]}