{"poster":"DarianEX","date":"2016-10-31T19:16:40.685+0000","title":"Why Riot","subforum":"Gameplay","up_votes":1,"down_votes":4,"body":"Why keep changing the game constantly instead of fixing whats already in the game. Am I the only one whose getting annoyed at all the new champions that keeps coming out and instead of fixing whats already in the game. With new jungle plants and control wards and everything. Maybe its just me. But I like the game right now and if they just fix some of the champions (and bugs right now in the game) It will be better instead of changing so many things. \n\nDiscuss?\n\n{{sticker:zombie-brand-mindblown}}","replies":[{"poster":"TheEvilQueen135","date":"2016-10-31T19:41:49.227+0000","up_votes":1,"down_votes":0,"body":"they are still fixing champions. the assassins update is supposed to make them healthier to play.\ncontrol wards are replacing pinks and working with the new stealth and camo changes. \n\nthe plants are supposed to add more interest in the jungle and that and new champs are to keep interest in the game and allow it to grow","replies":[{"poster":"DarianEX","date":"2016-10-31T19:43:09.359+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=TheEvilQueen135,realm=NA,application-id=3ErqAdtq,discussion-id=HNf6lOim,comment-id=0000,timestamp=2016-10-31T19:41:49.227+0000)\n>\n> they are still fixing champions. the assassins update is supposed to make them healthier to play.\n> control wards are replacing pinks and working with the new stealth and camo changes. \n> \n> the plants are supposed to add more interest in the jungle and that and new champs are to keep interest in the game and allow it to grow\n\nso many changes though. Still new champions like ivern and sol and more. ._. Maybe i can accept jg changes. But assassin changes are going to be hell for adcs xD","replies":[{"poster":"Limmie","date":"2016-10-31T21:19:21.876+0000","up_votes":1,"down_votes":0,"body":"I'm more worried about the tanks than the assassins tbh. Because when assassins rise, tanks rise along to counter assassins. And while assassins can be dealt with as an ADC, tanks are a whole different matter.\n\nIn theory there should be a rock-paper-scissors situation in that assasins win against adcs but lose to tanks, tanks win against assassins but lose to adcs, and adcs win against tanks but lose to assassins. But adcs (except Kogmaw and Vayne) don't win against tanks so they just lose against both.","replies":[]}]}]}]}