{"poster":"El Patta de Lana","date":"2015-03-06T04:36:11.609+0000","title":"Xenofobia por parte DEL SERVIDOR","subforum":"Problemas Técnicos","up_votes":2,"down_votes":6,"body":"Buenas, quería poner en tema de discusión como el soporte técnico de chile no tiene la capacidad (o no quiere) de arreglar los problemas de conexión del servidor. En Uruguay pasa lo mismo si se quiere jugar LAS. Me gustaría saber si es por que no somos chilenos Riot LAS no arregla las conexiones , ya que en muchos juegos como por ejemplo el Lineaje 2 juego servidores RUSOS SIN LAG. Recién jugué una ranked con 200 de ping constante, todos los Argentinos teníamos ping, estaria bueno por parte de riot que deje la xenofobia y deje de tirar siempre para el lado de Chile.\r\n\r\nMuchas gracias.","replies":[{"poster":"KaynTheRogu3","date":"2015-03-06T04:41:00.899+0000","up_votes":3,"down_votes":1,"body":"Jajajajja No tiene nada que ver, en Chile mantener un servidor es más barato y la calidad obvio es pésima. Rito hace lo que le conviene, lo arreglan con cinta adhesiva y cuando se rompa en 1 semana después improvisan. a la grande le puso Cuca.","replies":[{"poster":"Showcase","date":"2015-03-06T21:58:15.988+0000","up_votes":1,"down_votes":0,"body":"No viste a Señor Condor haciendo un asado con el server???","replies":[]},{"poster":"Ancient Gromp","date":"2015-03-06T17:43:56.379+0000","up_votes":1,"down_votes":0,"body":"a la grande le puso Cuca.\n\nJajaja que hdp!!","replies":[]}]},{"poster":"Showcase","date":"2015-03-06T21:58:53.174+0000","up_votes":1,"down_votes":0,"body":"Si el server no se arregla, lo hacemos Asado\n\n-Rito Cóndor {{summoner:13}}","replies":[]},{"poster":"RacuTheWolf","date":"2015-03-06T11:44:01.871+0000","up_votes":1,"down_votes":1,"body":"Ayer lei un comentario de un chileno quejándose también, aunque realmente no tiene culpa el servidor chileno, riot explico:\n\n\"En los últimos pasos del mantenimiento, al reactivar los últimos equipos de red (una actividad que se preparó para ser totalmente transparente), un error de configuración en las políticas de ruteo en uno de nuestros enrutadores provocó que dejáramos de recibir tráfico poco a poco y de manera intermitente.\"\n\nLa cagaron ellos, yo no soy tecnico, pero puede que ellos hayan hecho bien el ruteo para chile ya que fue el primero por que su servidor esta en ese pais, y se equivocaron con nosotros, mas que riot, fueron los tecnicos que son bastante inutiles, pero en todo  caso, riot no se hace cargo, segun el post que armo para esto, ya se resolvio y lo marco como cerrado, parece que no van a hacer nada.","replies":[]},{"poster":"San Tuka","date":"2015-03-06T04:40:04.968+0000","up_votes":1,"down_votes":1,"body":"Amigo el servidor se puso en chile, porque los primeros contrados latinos en Riot fueron de chile. Esta gente les dijo que en chile esta la mejor infraestructura para hostear un servidor de LOL. Y bueno hay tenes las mejor infraestructura de LAS.\nAl pedo hablar del team, el servidor no se cambiara por nada, eso conlleva a un gran costo, que riot no piensa hacer. Sera mejor que te resignes y espere a que se solucione solo. A y no espres una respuesta de riot esplicanco que sucedio porque no se hara y menos un recompensa. Saludos.","replies":[]}]}