{"poster":"Guy Fox Teemo","date":"2016-08-06T15:56:32.976+0000","title":"Any planned Ashe nerfs in the future? @Meddler","subforum":"Gameplay","up_votes":11,"down_votes":12,"body":"She seems a bit to strong, not anything major. Some minor nerfs?","replies":[{"poster":"Meddler","date":"2016-08-06T21:11:52.568+0000","up_votes":8,"down_votes":4,"body":"Yeah, some stuff coming in 6.17. Still figuring out exactly what. Likely candidates include a W mana cost increase and a reduction in early Q damage. Needs more testing though.","replies":[{"poster":"DCYOUNG888","date":"2016-08-06T21:28:50.750+0000","up_votes":5,"down_votes":4,"body":"How about Jhin, are you planning to punish him if he builds youmuu's, duskblade, and/or maw or change his base ad ratio on his passive?","replies":[{"poster":"Meddler","date":"2016-08-06T21:36:15.333+0000","up_votes":10,"down_votes":3,"body":"Yep, Jhin nerfs planned as well. We're currently testing a lower AD ratio on W and less base/more AS scaling on the MS post critical strike. \n\nWe'll also do some work on Ghostblade and probably Duskblade at some point, that might be a pre-season thing though, still determining that.","replies":[{"poster":"DCYOUNG888","date":"2016-08-07T00:45:19.343+0000","up_votes":3,"down_votes":0,"body":"How much are you planning to lower the W AD Ratio by? I'd assume they are nerfing it by roughly 5-15% AD. I personally jhin's base damage on his W is already mediocre at best and may not be necessary to lower it too much.\n\nAlso a little off topic but are there any plans for Kindred and Kalista after Worlds? They are not performing as well as they used to since their last changes.","replies":[{"poster":"Zero Skill Tank","date":"2016-08-07T08:51:40.911+0000","up_votes":10,"down_votes":1,"body":"> They are not performing as well as they used to since their last changes.\n\nThat's the whole point of nurfs, ain't it?","replies":[{"poster":"Ensatzuken","date":"2016-08-07T20:22:37.827+0000","up_votes":2,"down_votes":0,"body":"In case of {{champion:429}} they killed her completely out of competitive (and even in competitive she appears rarely now). The last nerf made her bad.","replies":[{"poster":"Volcanuz","date":"2016-08-08T04:09:06.523+0000","up_votes":1,"down_votes":0,"body":"Yep this so much.\n\nI played her again recently and she just has no impact anymore in fights. I was loading people with spears and set off E and nothing.. just a scratch to everyone. She only feels strong against skill shot based champions now and when ever i see her in lane i feel a lot of relief as i know i already won my lane.. real sad man.","replies":[]}]},{"poster":"DCYOUNG888","date":"2016-08-08T00:11:31.842+0000","up_votes":1,"down_votes":0,"body":"While I agree about the point of nerfs, I think both Kindred and Kalista (and Azir) got gutted rather than just simply becoming slightly weaker than before because of said recent nerf(s).","replies":[]}]}]},{"poster":"TRL Flawed","date":"2016-08-06T21:42:26.851+0000","up_votes":1,"down_votes":0,"body":"when you are talking about changes to duskblade, are you talking about nerfs? because for me the item doesnt feel strong enough for nerfs, or are you talking more about changes that are making the item do more where it is made for instead of just raw stats?","replies":[{"poster":"DunkinNoobs","date":"2016-08-06T23:00:07.216+0000","up_votes":2,"down_votes":1,"body":"Strengthening the passive and reducing the raw stats of the item is the most likely. The raw stats on the item are so good that people who don't even care for the passive are buying it, and that's a problem.","replies":[{"poster":"Meddler","date":"2016-08-06T23:27:30.003+0000","up_votes":8,"down_votes":7,"body":"Possibly. Melee only's also on the table though.","replies":[{"poster":"Simply Nora","date":"2016-08-07T20:45:28.368+0000","up_votes":5,"down_votes":1,"body":"What about AD casters? Varus, Jayce, and Quinn all use GB/Dusk. This would completely destroy them.","replies":[{"poster":"EyesOfTheFox","date":"2016-08-08T00:03:24.819+0000","up_votes":1,"down_votes":0,"body":"And {{champion:21}}. Her double up wrecks with the Duskblade passive combined with Black Cleaver, she actually does damage and feel's useful. I still build Maw if I'm facing an aggressive mage bot lane. I still get Dominik's if the enemies are building health. But Duskblade has proven more valuable to me (as an MF player) than any other item. I don't build it on Jinx or Ashe or Siver because their kits don't really support an item like that. ","replies":[]}]},{"poster":"EyesOfTheFox","date":"2016-08-07T02:44:14.722+0000","up_votes":6,"down_votes":19,"body":"I hope not, that item is one of the main reasons marksmen aren't garbage and can actually do damage. Burst damage is so high in the game, especially from some rather tanky targets, that marksmen can't afford to build as/dps builds. That's a product of the game at the moment. We don't need more hydra esque exclusive items that just make a marksman's job harder. Marksmen need AD and armor pen too.","replies":[{"poster":"Averia","date":"2016-08-07T10:00:56.891+0000","up_votes":10,"down_votes":1,"body":"EDIT: If anyone else reads this and decides to comment, remember the initial argument is about {{item:3147}} Duskblade not Ghostblade, and none of your \"my favorite champion's\" build duskblade aside from Graves (which I've never seen but is shown on champion.gg) and Jhin, who actually doesn't even want the damn item.\n\n\nI would have to heavily disagree with this statement.\n\nThe passive is almost entirely useless on ADC, and the only real reason it's bought on jhin is because it follows up on his bursty long c/d damage. Duskblade is actually on the super low end of what ADC needs to be relevant. 10 flat armor penetration isn't going to help an ADC kill an actual tank faster, all it does is make them stupider against themselves, making Lucian/Jhin stronger against other ADC's is why they were/are so strong in the first place. This is the whole reason why Last Whisper was initially nerfed in the first place, all around damage increase through the form of armor pen is not what Riot wants for the ADC role.\n\nI have never once seen it built on an ADC that wasn't Jhin, and on the very off chance that you mistook {{item:3147}} Duskblade for {{item:3142}} Youmuu's Ghostblade I would still have to disagree. It was only ever picked up on Lucian/Jhin because of their high burst damage and almost never used for the design path that ADC's are intended. Twitch is the only other Ghostblade user and he's played almost solely as an assassin from bottom lane with a pretty unhealthy play pattern when he's viable/meta.\n\nIf anything ADC needs to be given more options to help themselves through item choices. Survivability in the form of items that don't directly compensate by cutting your damage. This is where Bloodthirster kind of lacks, because it's stats are actually underwhelming compared to even another item like Mercurial, it simply just can't stand up with only 8% more lifesteal and 10 more AD, for the cost of 35 MR not even including the insane active movespeed/cleanse.\n\nRemember when Maw of Malmortius and Sterak's Gage were popular on ADC? It was because they didn't directly inhibit the damage of the ADC while giving them a viable option for getting tank stats. If GA didn't almost guarantee death on respawn for ADC's they would probably also buy that, but currently CDR is so abundant and AP damage is so high that spawning out of GA means you'll get butt-smashed by the enemy mid the second you revive.\n\nThe real question is when ADC is going to be given a viable defensive item that isn't immediately abused by the Yasuo's, Irelia's, Jax's, Illaoi's of league, which is nigh impossible. The closest Riot got was Rapidfire Cannon but it doesn't actually follow the play pattern that ADC really wants which is consistent high damage. It just gives them one auto attack of increased range which is all but useless.\n\n","replies":[{"poster":"Spyglass","date":"2016-08-07T21:09:11.982+0000","up_votes":1,"down_votes":0,"body":"I'm pretty sure the only reason Ghostblade isn't core on more ADCs is because Cait, Sivir, and Ashe have built-in synergy with crit, and need to build crit in order to use a piece of their kit. Ghostblade totally core on Draven and Varus in addition to the more meta carries, it works well on MF, and even Tristana and Ezreal (who are quite a bit of magic damage) can get away with building it early if for some reason Ez doesn't feel like going gauntlet. Every off-lane marksman at least considers getting it (Quinn, Kindred, Graves) In fact, the only people who don't build ghostblade are the ones who have special synergy with attackspeed (Vayne/Kog) or Crit (Cait/Sivir/Ashe), or someone who straight up doesn't have physical damage abilities or is Jinx (and even here, Mathcraft says it would be good - just no one's doing it). \n\nGhostblade is strong. Like ... Really Really Maybe Too Strong. On the other hand, it's also the only reason ADCs are bearable to play right now. Armor/CDR is everywhere.","replies":[{"poster":"Averia","date":"2016-08-08T08:55:06.784+0000","up_votes":1,"down_votes":1,"body":"Working well on a large group of AD/AS champions doesn't make it a core item. About the only ADC that I forgot that still buys ghostblade and is actually a relevant discussion topic is Draven.\n\nQuinn and Graves will easily survive without it, Kindred hasn't build the item since she got nerfed into a more Bloodrazer role but rather buys Maw, of which both Quinn and Graves can still buy.\n\nI also touched on elsewhere how Varus seriously just needs to be revisited by Riot and given a more cohesive kit and that right now the only reason he buys ghostblade is because it's the only item that really gives him the proper mix of stats.\n\nAny real ADC main will tell you that crit is a much better core stat on almost all of the ADC's listed:\n\n* Ashe\n\n* Caitlyn\n\n* Sivir\n\n* Tristana\n\n* Vayne (actually just wants attack speed mostly but BotRK is bad)\n\n* Jhin\n\n* Jinx\n\n* Twitch\n\nAnd that Champions like Ezreal, have a very static core path of Muramana>Triforce/Gauntlet.\n\nEven champions like Twitch, only really buy the item for the ability to all-in at 6 with the extra assassination potential and immediately swap into an AS/Crit oriented build. Ezreal should never ever buy Ghostblade, it doesn't match his play pattern no matter how much \"theoretical\" damage it provides, the same also goes for Ashe, Jinx, and every other ADC. Your DPS is directly linked to your auto attacks on almost ever ADC that isn't Jhin/Lucian.\n\nHowever remember that the initial discussion was for {{item:3147}}  Duskblade, an item of which I think only Graves and Jhin actually buy and on both of them it's more a cheese factor than an actually good item on either of them.","replies":[{"poster":"Oopsie Bear","date":"2016-08-08T17:32:31.651+0000","up_votes":2,"down_votes":0,"body":"Wait what? Twitch most definitely loves ghostblade. So does Jhin.  Twitch does go crit afterwards but ghostblade fits his assassin playstyle and is in a better spot thank bork.  Do you play Twitch?  Ghostblade is used to amplify the AS bonus he gets after breaking stealth for a ridiculous amount of all-in burst.  This isn't just locked down to 6 when he can ult.\n\nJhin (as far as raw damage is concerned) benefits more from armor pen than crit because his spells do a significant amount of damage, and his 4th shot is always a crit, meaning you're wasting some of your stats by buying more crit.  He get's movespeed procs, sure but playing him proactively armor pen feels much nicer. Honestly Jhin is one of the only champions in the game that I really like taking duskblade on. ( I don't play most of the others but i don't even love it on Zix) But the biggest reason I take duskblade on Jhin is because once he's committed to armor pen, stacking more of it really helps round out his power curve.  If Ghostblade wasn't so ridiculous I would probably stick with crit and AD stacking instead.\n\nI agree with your thoughts on duskblade for the most part that it is only ever really seen on Jhin and Graves, and in general doesn't have a lot of synergy for ADCs, but its noteable that it does give 5% movement speed as well.  The thing with duskblade is that it's viable on any ability focused AD champion.  I don't see why an item like duskblade needs to be changed if its only utilized on two ranged champs and one of them isn't even seen anywhere but jungle these days (and to top it off i rarely see graves taking it anyway).\n\nThe problem with ghostblade right now is that its so expensive.  This may sound counter intuitive at first, but remember this is now a top tier item (3200g cost).  Without its active its 98.96% gold efficient, but with it its a whopping 154.9%! For a single slot while it's active is up its worth 4956.8g! Because of the nature of fights in the current meta (most have been decided before 6 seconds) and the CD being only 45 seconds its kinda dumb not to take ghostblade.  When it was about the same gold efficiency, but only cost 2400g it didn't feel so overwhelmingly powerful coming int at 3717.6g during the active use.","replies":[{"poster":"Averia","date":"2016-08-08T20:45:15.852+0000","up_votes":1,"down_votes":0,"body":"1) Twitch is unhealthy. Ghostblade on twitch is unhealthy. Removing Ghostblade from Twitch's arsenal will nerf him, but will not make him unplayable. His build is centered around buying Ghostblade early for the cheese, and then spam buying critical chance/AD: http://champion.gg/champion/Twitch\n\nIn the case that Twitch loses ghostblade (again the original argument was never even about ghostblade) he will just build the normal ADC build BF+Pickaxe>Attack speed item>Infinity Edge unless some Twitch main comes up with a different build that is more effective. Would he lose early power? Yes. He would however gain it back later in the game by being able to buy more crit oriented items quicker.\n\n2) You should really try to play a crit oriented build with Jhin. You lose a very minor amount of early power for a much stronger mid-late (3-4 item) game spike. Jhin simply doesn't spike with Ghostblade like Lucian, Draven, or even Twitch do because he's not really a duelist (i'm stealing that line from the presentation linked below).\n\nI personally think this presentation on Jhin is really good, especially slides 13-21: https://docs.google.com/presentation/d/1CEf5MGKtrMkiBaomu6QxLK7F2Tc_J_jllTZk0iw7d9I/edit#slide=id.g15f8a642cc_3_1 \n\nYou will note in the graphs in the presentation, that by 3 items, {{item:3508}} + {{item:3087}} + {{item:3031}} does ~60 more damage than a {{item:3142}} + {{item:3147}}  + {{item:3094}} and that even if you do buy {{item:3142}}, {{item:3031}} + {{item:3094}} still provides much more damage than the \"standard\" GB+DB+RC build on both his 1st-3rd auto's and his 4th auto.\n\nOne of the things not mentioned in the graphs but mentioned elsewhere in the analysis is the amount of utility and zone power Jhin gets from CDR and infinite mana pool, which the ghostblade build does not provide.\n\nEven in the scenario where you buy youmuu's, Infinity Edge second gives you more damage on your ultimate and 4th auto, and is not reliant on a passive effect. Jhin is also incapable of applying enough damage within the short window that Duskblade allots unless you are fed enough that it doesn't matter what you buy anyway, or the enemy lets you choreograph a bunch of free damage through your Q bouncing and 4th auto.","replies":[]}]}]},{"poster":"xXSWAGxMaSteRxX","date":"2016-08-08T02:51:59.654+0000","up_votes":1,"down_votes":0,"body":"Vayne actually can build ghostblade and be pretty effective. I do it often on her","replies":[]}]},{"poster":"DaybreakingNight","date":"2016-08-09T00:50:31.008+0000","up_votes":1,"down_votes":0,"body":"duskblade is only good on champs that have high amounts of burst, which when jhin gets get, he can kill someone in 3-4 aa and duskblade can help finish them off, i use ghostblade on adcs because of the armor pen and flat ad yes but also because of the movement speed it provides, gives a ton of mobility, especially on jhin who has nothing unless he crits.  the point of adc is to do damage to everyone, getting pen allows you to do lots of damage to squishier targets early and if their team is stacking armor then you get a last whisper. Armor pen isnt made to kill heavy tanks, but squishy carries.\n\nAt least thats my opinion of pen and the meta for adcs, i think that if riot decides to make duskblade and/or ghost blade melee only then they need to add another way for adcs to shread through the squishies the way ghost blade allows jhin, luc, mf, twitch, etc to do\n\nI think that adcs like jhin and ashe are a little too strong and should come down a little bit, but i think riot should try to bump up all adcs.","replies":[{"poster":"Averia","date":"2016-08-09T13:37:46.880+0000","up_votes":1,"down_votes":0,"body":"This is again only if Jhin is ahead. https://docs.google.com/presentation/d/1CEf5MGKtrMkiBaomu6QxLK7F2Tc_J_jllTZk0iw7d9I/edit#slide=id.g15f8a642cc_3_1 Reading this google presentation should help explain why GB+DB is actually a much weaker buy post 3 items than any other combination.\n\nDuskblade does not proc at the end of Jhin's combo, it is nearly impossible unless you've already used 2 of your auto's elsewhere. It will proc after 2 auto's and Q>W combo at best and it is on a cooldown. \n\nYour ideal ADC is an ADC that deals damage to every target, but then buy items that have cooldowns and are not consistent at dealing damage? That is what Ghostblade and Duskblade are. \n\nIf you want movement speed you should buy an Attack Speed item. As long as you are critting, minions or monsters or champions, it will provide you much more movement speed than Ghostblade's active and will be much more consistent ~50%+ critical chance because of your 4th shots guaranteed crit. Plus it will proc on your W's snare.\n\nYou are specifically buying items like GB+DB solely to out-stat your lane opponent for the next ~5 minutes at which point when they have more crit items will deal much more damage than you overall. It is a build that works because solo queue is cheesy, not because GB+DB is a good item choice on Jhin.","replies":[{"poster":"DaybreakingNight","date":"2016-08-13T23:39:54.872+0000","up_votes":1,"down_votes":0,"body":"The armor pen build on jhin is the best build 90% of the time because of how much snowball you can get from it, it only isnt a good build if the other team has 2-3 super tanks that start building tank right away (like malphite) in which cause youll need a lw item sooner, otherwise the pen build is better, if you dont believe me thats ok, you can go into a normal game and try it, take pen reds, armor yellows, 4 magic resist blues 5 mana regen blues and armor pen quints, then go the pen build, you will be surprised at how much damage you do early if you dont already know and how easy it is to snowball the game, the main reason people build DB is because of the stats it gives, a lot of ad and some pen, where GB provides a good amount of ad and pen but a lot of people also get it for the movement speed.","replies":[{"poster":"Averia","date":"2016-08-22T14:59:18.143+0000","up_votes":1,"down_votes":0,"body":"I've played both builds (Jhin is my most played ADC this season, I'm a d5 ADC main, highest was d1 in season 4) and while the consistent damage of GB+DB was nice, I've never found it to be better than the ER build.\n\nJhin's snowball comes from his already dominant laning phase. Most of the time he can get kills even before first back. Buying more armpen makes him snowball more maybe but it's not a necessity, while crit is a core component to his damage and CDR is a core component to his utility, both of which you get less of with the arm-pen build.\n\nYou should try to crit build sometime, and I mean really try it. Not just play 1 game and say \"wow this isn't as strong/consistent at 10 minutes\" and give it up.\n\nI feel like you didn't really read the ending statement of my last comment, which literally counteracts most of your comment: \"You are specifically buying items like GB+DB solely to out-stat your lane opponent for the next ~5 minutes at which point when they have more crit items will deal much more damage than you overall. It is a build that works because solo queue is cheesy, not because GB+DB is a good item choice on Jhin.\"\n\nSpecifically; you are cheesing the enemy team by buying snowbally items, not items that heavily synergize with the champion you are playing. GB+DB have almost 0 synergy with Jhin's kit aside from the AD they provide. But because Jhin makes good use of that AD he can use them to snowball an advantage because flat AD tends to be stronger early on in the game.","replies":[]}]}]}]}]}]},{"poster":"i am the hamham","date":"2016-08-08T00:11:44.848+0000","up_votes":2,"down_votes":0,"body":"This concerns me as a Quinn main.  This would be a very significant nerf for Quinn, whose state is very healthy in the current meta.","replies":[]},{"poster":"Yulyana","date":"2016-08-07T18:12:11.652+0000","up_votes":2,"down_votes":0,"body":"Would there be any compensation buffs for Varus? His winrate is in the gutter already as it is, and this is one of his best items.","replies":[]},{"poster":"HaloDragonX","date":"2016-08-07T17:41:28.516+0000","up_votes":2,"down_votes":1,"body":"Keep Ghostblade allowed for Twitch, Quinn, Draven, ect.\n\nDuskblade can go melee only and be buffed, because let's be honest, melee champions don't really build it.\n\nThen make Black Cleaver melee only, killing of Armor Pen Lucian and MF for good.\n\nJhin's armor pen build can be killed off with changes to his passive.","replies":[{"poster":"ÂzaIea","date":"2016-08-08T04:41:17.877+0000","up_votes":1,"down_votes":0,"body":"AD Assassuns such as Talon, Zed, Rengar, Kha, sometimes Shaco, Riven use the item, and probably many more. It was meant for them.","replies":[{"poster":"HaloDragonX","date":"2016-08-08T04:47:14.060+0000","up_votes":1,"down_votes":0,"body":"And? Changing these to melee don't effect them.","replies":[]}]}]},{"poster":"BaloSaar","date":"2016-08-07T22:52:12.830+0000","up_votes":1,"down_votes":1,"body":"I thought Duskblade was added as an Item for assassins.\n\nIf you make it melee only, how will Jhin (who is a Marksman/Assassin) use this assassin item?\n\nThere is also Twitch, Vayne, and Teemo.","replies":[{"poster":"Gwenavere","date":"2016-08-08T18:45:55.152+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=BaloSaar,realm=NA,application-id=3ErqAdtq,discussion-id=TTaYMEU6,comment-id=0002000000000000000000000011,timestamp=2016-08-07T22:52:12.830+0000)\n>\n> I thought Duskblade was added as an Item for assassins.\n> \n> If you make it melee only, how will Jhin (who is a Marksman/Assassin) use this assassin item?\n> \n> There is also Twitch, Vayne, and Teemo.\n\nIt was added as an assassin item, but others found that it synergized with their kits as well. The biggest problem with this approach is for champions like Twitch (who you mention) and Quinn (who you don't), the marksmen who are basically played as assassins. DB would be less of a loss than YGB, but this still eats into their niche and would hamper their effectiveness at being played in the optimal way. The loss of both items combined without compensatory buffs would probably push both champs pretty much out of play.","replies":[]}]},{"poster":"Jus de Castagne","date":"2016-08-08T16:46:20.962+0000","up_votes":1,"down_votes":0,"body":"I think that only allow melee champion to use duskblade is not a good thing : many ranged champion played like assassin need it like quinn, jayce, or others and they will be hard nerf if this become real.\n\nMany ADC or AD range depend of the Youmuu and will be hard nerf with a nerf of the object like Twitch, Draven, Quinn, Miss Fortune, more glabally all the AD casters.\n\nIt seems to be better to hard nerf Jhin, and slightly nerf Ashe, Youmuu and Duskblade because hard nerf Youmuu and Duskblade will destroy accidentaly many AD casters and assassin.","replies":[]},{"poster":"Peptox","date":"2016-08-07T22:08:43.078+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=TTaYMEU6,comment-id=000200000000000000000000,timestamp=2016-08-06T23:27:30.003+0000)\n>\n> Possibly. Melee only&#x27;s also on the table though.\n\nGod, please no. This would screw Lucian, Twitch, Draven, and more. I don't know why Riot doesn't like Ghostblade on ADC's.","replies":[{"poster":"NineTailedMystic","date":"2016-08-08T10:32:56.704+0000","up_votes":1,"down_votes":0,"body":"Flat Pen isn't fun for squishies.","replies":[]}]},{"poster":"LoL Ergo Urgot","date":"2016-08-08T10:10:35.567+0000","up_votes":1,"down_votes":0,"body":"That would shrink an already small item pool {{champion:6}} .","replies":[]}]}]}]},{"poster":"lucidzenith","date":"2016-08-07T22:44:23.104+0000","up_votes":2,"down_votes":0,"body":"Please don't nerf jhin to the point where he is unplayable. Yeah the ms from his passive is great but overall, landing his w isn't the easiest. Since he's really immobile and has no escape, i think his high damage is the only way you could sort of balance him because of his numerous downsides. I hope he remains one of the most high damage adcs because it makes him unique and it fits his character well. As for the items,  i think its a bad idea to make them melee only despite part of them being useless towards them. \nnerfing jhin is understandable but it shouldn't be as large as what you guys did to kindred/kalista. No one plays them anymore in normal games or if they do they end up having a hard time.\n\nin addition, keep him high damage because its annoying when u have to reload and u couldnt kill your target and they run away. The reloading setback should be taken into consideration with his nerfs. Don't nerf him too harsh riot. ","replies":[]},{"poster":"Ensatzuken","date":"2016-08-07T20:26:39.049+0000","up_votes":2,"down_votes":0,"body":"Please if you nerf the items could you wait and see how it impact {{champion:202}} before nerfing him too? I don't want {{champion:202}} to become unplayable.","replies":[]},{"poster":"Shockforce","date":"2016-08-07T04:19:48.282+0000","up_votes":2,"down_votes":1,"body":"Would you consider removing the slow off of Jhin's ult?\n\nI never completely understood why the slow is needed when he already has pick-off potential in his kit.","replies":[{"poster":"Real Jano","date":"2016-08-07T17:46:55.503+0000","up_votes":2,"down_votes":0,"body":"If it didn't slow then landing multiple shots becomes impossibly hard","replies":[]},{"poster":"Astôlfo","date":"2016-08-07T15:57:38.234+0000","up_votes":2,"down_votes":2,"body":"Because he's a utility ADC/AD caster? And it'd be even more incredibly easy to dodge than it already is without a slow? It's the reward for landing his shots.","replies":[{"poster":"Shockforce","date":"2016-08-07T19:40:42.020+0000","up_votes":2,"down_votes":1,"body":"What I note about his ultimate is that it is too rewarding. It can waveclear, it can zone, it can engage and disengage, provide vision, and even execute opponents from a low risk position. I might also note that when opponents are already in combat or running away or running towards you they already have a predictable location even without the slow.\n\nThe skill does not need an additional incremental reward when it already zones everyone in the area initially and blasts someone at the end for a significant chunk of their health.\n\nSomething in the skill has to give. Removing the slow would lower Jhin's engage potential. Lowering the damage could allow him to maintain the skill as a hard engage tool. Removing the cdr from unused shots may make it a more critical decision.","replies":[]}]},{"poster":"dragonboytsubasa","date":"2016-08-08T11:43:32.514+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Shockforce,realm=NA,application-id=3ErqAdtq,discussion-id=TTaYMEU6,comment-id=0002000000000004,timestamp=2016-08-07T04:19:48.282+0000)\n>\n> Would you consider removing the slow off of Jhin&#x27;s ult?\n> \n> I never completely understood why the slow is needed when he already has pick-off potential in his kit.\n\nUm he needs the slow so he can land subsequent shots if he needs to. You can't use any of his other skills mid ult.\n\n> [{quoted}](name=Averia,realm=NA,application-id=3ErqAdtq,discussion-id=TTaYMEU6,comment-id=0002000000000000000000000001000000020002,timestamp=2016-08-08T08:55:06.784+0000)\n>\n> Working well on a large group of AD/AS champions doesn&#x27;t make it a core item. About the only ADC that I forgot that still buys ghostblade and is actually a relevant discussion topic is Draven.\n> \n> Quinn and Graves will easily survive without it, Kindred hasn&#x27;t build the item since she got nerfed into a more Bloodrazer role but rather buys Maw, of which both Quinn and Graves can still buy.\n> \n\nidk about Graves but Quinn definitely won't. All the stats GB provides benefit Quinn - Armour Pen, CDR and damage are all stats she needs to do well, and the active helps her a lot too. She's not even a proper marksman (In higher elo matches she's rarely played bot if ever. Even Riot Repertoir when he was reworking her said she's been optimised for solo laning, and acknowledged that she was primarily played in top before the rework) and has been building GB as a core pretty much since her release. You say she can build Maw, but that's only useful if she's against an AP laner or comp, otherwise you'll never see her building it. If she loses GB not only are there not a lot of item options she can fall back on, because without GB she has to sacrifice stats she needs to do her job let alone do her best. BC is useful for high armour champs and Olaf, Sterak's is for survive AD burst, MS for the damage, Quicksilver and MR, Maw as I mentioned before is only useful against an AP laner or comp (Even against someone like Teemo she can survive without it)...and that's about it (And all those items are situational on her, not core). As far as Crit items go IE and Shiv/RFC/PD are the only items that help her. She can't grab all 3 of those Zeal items because she's not an attack speed based champion. ER has fallen out of use except in bot lane because she's not as mana dependent as people thought she was. Even in bot you'll see her building GB to round out the 40% CDR with an ER and 2 crit items. You can't say she'll survive easily without GB when she has been building the item ever since she was released. That says a lot about how much the item helps her and how much she needs it.","replies":[]}]},{"poster":"HaloDragonX","date":"2016-08-06T22:50:57.758+0000","up_votes":3,"down_votes":2,"body":"Jhin gains too little AD from AS, how about improving that?","replies":[]}]}]},{"poster":"bunies","date":"2016-08-10T02:02:30.184+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=TTaYMEU6,comment-id=0002,timestamp=2016-08-06T21:11:52.568+0000)\n>\n> Yeah, some stuff coming in 6.17. Still figuring out exactly what. Likely candidates include a W mana cost increase and a reduction in early Q damage. Needs more testing though.\n\nYes god forbid you actualy nerf op champions like {{champion:238}} {{champion:105}} {{champion:104}} , but no lets kick ashe in the teeth again for no reason","replies":[]},{"poster":"Jaeryn ","date":"2016-08-07T23:22:57.120+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=TTaYMEU6,comment-id=0002,timestamp=2016-08-06T21:11:52.568+0000)\n>\n> Yeah, some stuff coming in 6.17. Still figuring out exactly what. Likely candidates include a W mana cost increase and a reduction in early Q damage. Needs more testing though.\n\nMeanwhile I do like the W mana cost increase to balance out her early game damage input, I feel like she needs her Q damage in order to trade. Her Q's are not 100% proc anyways, meanwhile W is too spammable. Please just increase her W mana cost ;D","replies":[]},{"poster":"Åshe","date":"2016-08-11T10:24:41.108+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=TTaYMEU6,comment-id=0002,timestamp=2016-08-06T21:11:52.568+0000)\n\n> W mana cost increase and a reduction in early Q damage. \nWhy? just because shes winning?\nthat doesnt make much sense","replies":[]},{"poster":"LoopKat","date":"2016-08-08T16:55:10.225+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=TTaYMEU6,comment-id=0002,timestamp=2016-08-06T21:11:52.568+0000)\n>\n> Yeah, some stuff coming in 6.17. Still figuring out exactly what. Likely candidates include a W mana cost increase and a reduction in early Q damage. Needs more testing though.\n\nHow about reducing W's range? It may not be the highest damage ability, but Volley has always felt like one of the cheapest in terms of avoiding it, especially since side-stepping is rarely an option. Even if you're at completely max range and you think you're going to be safe, those damn arrows still find a way hit you (even when the visual effect disappears, near the tail end). Maybe it was the killing blow, maybe Ashe just needed the initial slow to catch up and perma-slow you to death. Regardless of the scenario, it just doesn't feel fair when you're on the receiving end.","replies":[]},{"poster":"Earl Eulrich","date":"2016-08-08T10:35:07.067+0000","up_votes":1,"down_votes":0,"body":"her early dmg? she currently is among the top dps of all adcs while having very high range and the most utility of all adcs....if anything her lategame dps should be significantly lowered. you can´t just combine that amount of dmg and utility in one Champion and be ok with it.","replies":[]}]},{"poster":"Astôlfo","date":"2016-08-06T15:57:45.811+0000","up_votes":3,"down_votes":0,"body":"If you'd do a quick search, you'd see nerfs are slated for her and Jhin in 6.17","replies":[]}]}