{"poster":"el dumbnut","date":"2015-11-02T23:20:08.370+0000","title":"To all the people who told me \"Go ahead, report me.  It won't do anything.\"","subforum":"Player Behavior","embed":{"description":null,"url":"http://imgur.com/INUGZCU","image":"http://imgur.com/INUGZCUs.jpg"},"up_votes":93,"down_votes":12,"body":"This makes me feel good.  Glad to know the system is working.\n\nEDIT: Also thank you Riot.  Even a tiny feedback gives me hope.","replies":[{"poster":"elduris","date":"2015-11-03T01:01:52.031+0000","up_votes":27,"down_votes":1,"body":"For those that have questions regarding the frequency this appears:\n\nYou will only get the notification if your report was the one responsible for triggering the punishment. I'd imagine that getting notifications for every single punishment you took part in would get overwhelming at a point.","replies":[{"poster":"el dumbnut","date":"2015-11-03T01:26:08.886+0000","up_votes":87,"down_votes":3,"body":"I wouldn't mind it.  I would rub each of those notifications all over my body.  Specially on my nipples.","replies":[{"poster":"SmokedAlmonds","date":"2015-11-03T01:29:11.122+0000","up_votes":36,"down_votes":0,"body":"> [{quoted}](name=el dumbnut,realm=NA,application-id=ZGEFLEUQ,discussion-id=hWWPdg9G,comment-id=00040000,timestamp=2015-11-03T01:26:08.886+0000)\n>\n> I wouldn't mind it.  I would rub each of those notifications all over my body.  Specially on my nipples.\n\nLol, I donno about all of that, but I definitely wouldn't mind getting those notifications every time. What I would like even more than that is a page in the client that showed you some simple stats about your reporting. Like you have reported X number of people, Y were considered valid, Z were punished.","replies":[{"poster":"pinkyblossom","date":"2015-11-03T15:03:00.127+0000","up_votes":7,"down_votes":0,"body":"Like in the old tribunal;\n\n\nhttp://i.imgur.com/P3DcLTT.png","replies":[{"poster":"Drugoth","date":"2015-11-03T15:40:53.236+0000","up_votes":1,"down_votes":0,"body":"Holy cow, you're like the fist of judgement.  You must have spent a long time reading chat logs...","replies":[{"poster":"pinkyblossom","date":"2015-11-03T17:31:57.408+0000","up_votes":2,"down_votes":0,"body":"That is not me...\n\nIt says Meruns...\n\nGoogle gave me that image...\n\nThe guy is kinda scary, he has helped 126 players to get permabaned. 4300 cases reviewed, I think he judges more than he plays.","replies":[]}]}]},{"poster":"PDE5 Inhibitors","date":"2015-11-03T01:45:47.784+0000","up_votes":7,"down_votes":1,"body":"That is a good idea, sir!\n\nAlmonds, however, suck.","replies":[{"poster":"Downfall","date":"2015-11-03T02:08:31.191+0000","up_votes":2,"down_votes":0,"body":"I really like this idea as well","replies":[]}]}]},{"poster":"elduris","date":"2015-11-03T01:29:19.790+0000","up_votes":20,"down_votes":0,"body":"Careful, those things can cause some nasty chafing! ;)","replies":[{"poster":"BetaDude40","date":"2015-11-03T02:36:57.395+0000","up_votes":7,"down_votes":0,"body":"Yeah, they're laced with the salt of toxic players' tears. I'd be careful putting them around the nip area.","replies":[]}]},{"poster":"PDE5 Inhibitors","date":"2015-11-03T01:31:15.857+0000","up_votes":3,"down_votes":9,"body":"You seem to be on an extreme end. There's the extreme flamers, and then the extreme people that cry over things like, \"rekt\". Both are equally as bad for the community.","replies":[{"poster":"Photos of Ghosts","date":"2015-11-03T09:18:12.711+0000","up_votes":3,"down_votes":3,"body":"It's not crying for rekt. It's crying with joy every time we see a person dedicated to evil get their retribution.\nIt doesn't matter how hard you failed at hurting people. As long as you tried, you deserve to lose your teeth.","replies":[{"poster":"PDE5 Inhibitors","date":"2015-11-03T15:20:13.545+0000","up_votes":5,"down_votes":0,"body":"That's cool, but I wasn't even talking about you? I said it seems like he would be that kind of player, not you. and if you think \"rekt\" is \"hurting people\", then you are in for some hard reality lmfao.","replies":[{"poster":"Photos of Ghosts","date":"2015-11-03T16:01:13.278+0000","up_votes":2,"down_votes":3,"body":"How could you be talking to me? I hadn't written anything, and didn't receive a notification from you. How do you think I coud be led to believe you were talking to me?\nI know perfectly that you were talking to someone **like** me. Someone who hates attempts at abuse of power with all their being, no matter how hard failed they are.","replies":[{"poster":"PDE5 Inhibitors","date":"2015-11-03T17:19:03.867+0000","up_votes":3,"down_votes":2,"body":"Lmfao, killing someone when their jungler ganks you and saying \"rekt\" is tooootally \"abuse of power\" lolol. You have some issues, bud.","replies":[{"poster":"Photos of Ghosts","date":"2015-11-03T17:42:07.228+0000","up_votes":2,"down_votes":3,"body":"Hard failed. But still an attempt.","replies":[{"poster":"PDE5 Inhibitors","date":"2015-11-04T12:57:14.353+0000","up_votes":2,"down_votes":0,"body":"No. You calling \"rekt\" an \"abuse of power\" is what is a fail lmfao. I am literally laughing at you right now.","replies":[]}]}]}]}]}]}]}]},{"poster":"Randomonium","date":"2015-11-03T03:55:53.813+0000","up_votes":7,"down_votes":0,"body":"No, it really wouldn't.  I've only gotten this notification once and the only way to describe it was \"pure joy.\"  If you get the chance please pass on to Riot to send out these messages more frequently.  The joy they bring completely cancels out any rage from trollers.","replies":[{"poster":"Sinlaire","date":"2015-11-03T09:27:23.758+0000","up_votes":2,"down_votes":0,"body":"i've seen it twice. one time i reported a guy and then he was in my champ select for my next game. half way through we get kicked out because of a dodge, but then i see a notification on my right.\n\nthe guy i reported got banned and i was sent back to queue. best part, i was playing with my brother and we both reported and were totally pissed we saw him again in select, and then laughed our asses off when we saw him get banned. dude was so toxic. made our day.","replies":[]}]},{"poster":"PDE5 Inhibitors","date":"2015-11-03T01:30:37.796+0000","up_votes":5,"down_votes":0,"body":"I would actually like that a lot. In the current system, your reports get \"devalued\" if not viewed good by the system. As it stands, I have literally no way of knowing if this is happening, since I don't get any feedback on reports. I, along with many others, probably didn't know that you only got this message if your report was the last straw. Since I didn't know this, it makes it seem like my last 5,000 (probably a bit exaggerated) reports have not lead to punishment, making me think my reports aren't good reports and thus devaluing my reports. It's like, well if my reports are devalued, I mind as well not even bother reporting for it to get ignored.\n\nOn a side note, how do you get your name to have the really cool blue font to it? I want that font.","replies":[{"poster":"elduris","date":"2015-11-03T01:37:41.793+0000","up_votes":2,"down_votes":0,"body":"Yeah, you don't really get any feedback unless your report was the one that banned them. Personally I think that's a flaw with the system since a large portion of it involves faith. Having faith is good but with no factual information to back up your faith you can start to doubt and that's where a lot of people get frustrated. I think you'll feel a lot better once the new Tribunal is released though. \n\nYou can read about me and the rest of the new \"Blue Man Group\" [here](http://boards.na.leagueoflegends.com/en/c/player-behavior-moderation/opVBd7rZ-introducing-the-arbiters)!","replies":[{"poster":"PDE5 Inhibitors","date":"2015-11-03T01:45:10.936+0000","up_votes":2,"down_votes":0,"body":"But that doesn't tell me how I can get the cool blue font lol...","replies":[{"poster":"elduris","date":"2015-11-03T01:51:01.631+0000","up_votes":1,"down_votes":0,"body":"If you want to join the Arbiters, stay positive and contribute a lot! We'll be on the lookout for passionate Summoners that share our mindset to add to the program in the future.","replies":[{"poster":"PDE5 Inhibitors","date":"2015-11-03T01:59:48.470+0000","up_votes":1,"down_votes":1,"body":"Say I wanted cool blue color without joining the program....possible? Not that the program is _bad or uninteresting_, but I am only level 12 and have no idea about the punishment system (which seems to be a pretty big requirement lol). I also tend to call people a dumb dumb when they are being a dumb dumb.","replies":[{"poster":"elduris","date":"2015-11-03T02:32:36.595+0000","up_votes":1,"down_votes":0,"body":"Sadly, the blue color and icon are only available to the volunteers of the Arbiter program.","replies":[{"poster":"Photos of Ghosts","date":"2015-11-03T09:23:56.641+0000","up_votes":1,"down_votes":2,"body":"We had a player initiative like that on EUW a while ago, we were supposed to be friendly on the Boards and ingame as well as being an example of good behaviour, explaining the rules, etc.\nThen Riot didn't acknowledge our existence and it kind of died off... And I quickly realised my justice boners were too stronk to be respectful to flamers.","replies":[{"poster":"Daen","date":"2015-11-03T23:04:07.228+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Photos of Ghosts,realm=EUW,application-id=ZGEFLEUQ,discussion-id=hWWPdg9G,comment-id=00040001000000000000000000000001,timestamp=2015-11-03T09:23:56.641+0000)\n>\n> We had a player initiative like that on EUW a while ago, we were supposed to be friendly on the Boards and ingame as well as being an example of good behaviour, explaining the rules, etc.\n> Then Riot didn't acknowledge our existence and it kind of died off... And I quickly realised my justice boners were too stronk to be respectful to flamers.\n\nWas that the Emissaries, by any chance?  I've spoken with some of the EUW volunteers and apparently Germany in particular has an *amazing* volunteer program.  I'm super jelly, and it's the kind of mentality I hope we can start to foster in NA as well.","replies":[{"poster":"Photos of Ghosts","date":"2015-11-03T23:54:13.193+0000","up_votes":1,"down_votes":0,"body":"The Emissaries just started existing again a week ago! Yes they had survived in Germany, but it was originally an idea by Riot.\nI'm talking about this. http://boards.euw.leagueoflegends.com/en/c/player-behaviour-en/Y5tYJMx9-spiritguard-player-behavior-initiativewip#","replies":[{"poster":"Daen","date":"2015-11-04T00:27:52.594+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Photos of Ghosts,realm=EUW,application-id=ZGEFLEUQ,discussion-id=hWWPdg9G,comment-id=0004000100000000000000000000000100010000,timestamp=2015-11-03T23:54:13.193+0000)\n>\n> The Emissaries just started existing again a week ago! Yes they had survived in Germany, but it was originally an idea by Riot.\n> I'm talking about this. http://boards.euw.leagueoflegends.com/en/c/player-behaviour-en/Y5tYJMx9-spiritguard-player-behavior-initiativewip#\n\nInteresting...it looks like this Spiritguard thing is more along the lines of a suggestion rather than something Riot set out to sponsor, but I definitely like where people's heads are at.","replies":[]}]}]}]}]}]}]}]}]}]},{"poster":"iamthegoatofwar","date":"2015-11-03T03:29:14.559+0000","up_votes":3,"down_votes":0,"body":"you know elduris...maybe not. generally if we report someone we WANT to know they got punished.","replies":[]},{"poster":"SoMNia","date":"2015-11-03T03:11:17.008+0000","up_votes":3,"down_votes":0,"body":"Maybe a checkbox would help? \"I would like to be notified if...\"","replies":[]}]},{"poster":"SpartenA7991","date":"2015-11-02T23:23:19.973+0000","up_votes":18,"down_votes":2,"body":"1/1,000,000 chance. Never seemed to happen to my reports. :/","replies":[{"poster":"el dumbnut","date":"2015-11-02T23:29:21.008+0000","up_votes":9,"down_votes":1,"body":"Don't lose faith.  Keep fighting the good fight.  This is the second time I have seen this screen.  Also right after reporting the two most toxic people I have ever come across.  And both said the line in the title.  Crazy enough one of them wasn't even on my team.  Just went full toxic in post game chat.  I don't put up with toxic from anybody.","replies":[]},{"poster":"Provengreil","date":"2015-11-03T00:42:14.008+0000","up_votes":2,"down_votes":1,"body":"Really? I've gotten like 7 of these.","replies":[]}]},{"poster":"AraMoOse","date":"2015-11-03T00:11:30.108+0000","up_votes":6,"down_votes":0,"body":"I've never gotten that message. I demand to receive it. \n\nI want to be thanked.","replies":[]},{"poster":"CampusWifi","date":"2015-11-04T00:04:01.616+0000","up_votes":3,"down_votes":0,"body":"This makes me so happy. To finally feel like reporting people makes a difference{{champion:10}}","replies":[]},{"poster":"lakeyja900","date":"2015-11-03T22:23:33.405+0000","up_votes":3,"down_votes":0,"body":"That is my favorite thing to see when I log onto League!","replies":[]},{"poster":"Rikari","date":"2015-11-03T18:25:34.775+0000","up_votes":3,"down_votes":0,"body":"I saw this thrice upon its release. I feel safer.\nyes im in low elo silver.","replies":[]},{"poster":"AJStarhiker","date":"2015-11-03T15:28:59.351+0000","up_votes":3,"down_votes":0,"body":"I'm not sure if it would immediate enough, but I'd thought of a system that would periodically update with \"Your reports have resulted in X punishiments\".  You could still do the last hit notifications, but knowing about the assists would be helpful to people who start to think their reports are doing nothing.","replies":[]},{"poster":"sealust","date":"2015-11-02T23:45:43.545+0000","up_votes":3,"down_votes":0,"body":"mmmm yes, I had this happen for a few days in a row once. feels good man. ","replies":[]},{"poster":"Albedo Tabula","date":"2015-11-02T23:40:19.540+0000","up_votes":3,"down_votes":0,"body":"Actually just had that happen the other day after a game I had with a couple of extremely toxic people.  Claiming reporting never does anything and for us to go right ahead and report them after the game.  about 10 minutes later got that message soooo yeah may or may not have been them, but if it was seems like almost instant karma lol.","replies":[]},{"poster":"Weathered","date":"2015-11-04T01:13:00.346+0000","up_votes":2,"down_votes":0,"body":"Similar thing happened to me. This Thresh was being a total asshole the the team, actually the most toxic player ive seen this season. I was getting so mad at him, because not only did he feed, flame the team, and tried to get us repped in all chat, he was being smart about it and using sarcasm. Everyone reported him, and i got the notification that he was punished WHEN I WAS TALKING TO HIM in the after game chat.\n\nAs soon as I saw it I was like\nhttp://imgur.com/AZTMfn7","replies":[]},{"poster":"Arcade Andrew","date":"2015-11-03T16:02:07.778+0000","up_votes":2,"down_votes":0,"body":"With this newest update and look at punishment systems I've also seen a decrease in the amount of \"false punishments\" with myself included! Before I'd get chat and ranked restricted non stop for being reported for going 0/10 when on tilt and the logs I got I hadn't even used one curse word north of damn. Now? Everything is smooth and I haven't even gotten warning from all those jerks who report me for doing badly","replies":[{"poster":"EvilDustMan","date":"2015-11-03T17:21:27.558+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Arcade Andrew,realm=NA,application-id=ZGEFLEUQ,discussion-id=hWWPdg9G,comment-id=000b,timestamp=2015-11-03T16:02:07.778+0000)\n>\n> With this newest update and look at punishment systems I've also seen a decrease in the amount of \"false punishments\" with myself included! Before I'd get chat and ranked restricted non stop for being reported for going 0/10 when on tilt and the logs I got I hadn't even used one curse word north of damn. Now? Everything is smooth and I haven't even gotten warning from all those jerks who report me for doing badly\n\nYOu don't have to cuss and swear to be inflammatory.","replies":[{"poster":"Arcade Andrew","date":"2015-11-05T03:57:43.338+0000","up_votes":1,"down_votes":0,"body":"The point of my post was to show how I would get reported falsely a lot (and still do) but thanks to the new system I'm not being punished left and right without clarity. I haven't even been warned! The new system is preventing false reports aswell and it's great knowing I don't have to worry about them anymore","replies":[]}]}]},{"poster":"Linthe","date":"2015-11-03T16:00:39.192+0000","up_votes":2,"down_votes":0,"body":"Thanks for posting. I was not aware this feature was in game. Good to know.","replies":[]},{"poster":"MrryZ","date":"2015-11-03T15:57:33.517+0000","up_votes":2,"down_votes":0,"body":"I've never received this notification and nor did I really care about receiving one until yesterday when I encountered the most absolutely disgusting person I have ever met in my entire life on the EUW server. constantly insulting me personally and even referring to what I perceived as death threats to me and my family kinda started to rile me up after a bit and resulted in me requesting to be informed through email about the action riot would take on this. So anyways I was wondering if I could get your guys opinion on whether you would appreciate a better communication between riot and players concerning punishment and suggest ideas as to how they could go about improving the system.","replies":[]},{"poster":"Bay0n","date":"2015-11-03T01:35:54.596+0000","up_votes":2,"down_votes":0,"body":"Me being  scrub and not knowing much, can someone explain to me did you receive this via taking part in the tribunal or did this happen via the post game reporting system? Please and thank you.","replies":[]}]}