{"poster":"SickAnto","date":"2015-08-11T12:25:02.275+0000","title":"Un viaggio nel Freljord - Parte 3: Le Sorelle del Gelo.","subforum":"Creazioni della community","up_votes":5,"down_votes":5,"body":"Sono passati cinque giorni da quando mi ritrovo in questa citt&agrave; e ho conosciuto gente molto strana, un ragazzino che cavalca uno yeti, un grassone che non si ubriaca mai, una crio-fenice e..... quell&#039;odioso di un cervello di gallina di Tryndamere.\nE&#039; mattina e mi sono appena svegliata, la mia armatura l&#039;ho mandata a lavare, quindi prendo dei vestiti che mi ha prestato Ashe, ne troppo leggeri ne troppo pesanti, mi dirigo nella stanza di Ashe.\nBusso alla sua porta.\nD:\"Ashe sono Diana ci sei?\"\nNon risponde, forse sta ancora dormendo.\nDecido di entrare.\nD:\"E&#039; ancora sul letto, dorme come un&#039;angioletto.\"\nTento di svegliarla.\nD:\"Dai Ashe svegliati, &egrave; mattina.\"\nA:\"Ancora cinque minuti mamma.\"\nDecido di aprire le serrande per far entrare il sole.\nD:\"Ashe svegliati non costringermi a farti alzare con la forza.\"\nA:\"Non voglio alzarmi mamma.\"\nD:\"Ok, non ti vuoi alzare? L&#039;ha voluto tu.\"\nLa prendo dal petto e gli carico una raffica di schiaffi in faccia.\nD:\"Svegliati, svegliati, svegliati.\"\nA:\"AHIA!!! S&igrave;, s&igrave; mi sveglio uffa.\"\nD:\"Finalmente, Tryndamere mi ha mandato a svegliarti ed a informarti che ti devi preparare per la caccia.\"\nA:\"Ok grazie, mi preparo subito, tu dirigiti nella sala per fare colazione non ci metter&ograve; molto.\"\nD:\"Va bene ti aspetter&ograve; li.\"\n\nArrivata alla sala trovo Gragas, Braum e Anivia.\nA:\"Come fai a bere tutto questo alcol la mattina?\"\nG:\"Per me &egrave; sempre tempo di bere un po di rum.\"\nDice questo bevendosi un intero barile.\nB:\"Buongiorno Diana, vuoi un po di latte di capra?\"\nA:\"Oh ciao non ti avevo visto.\"\nG:\"Glu, glu, glu.\"\nD:\"Giorno, s&igrave; grazie Braum, un bel latte di capra mi farebbe piacere.\"\nB:\"Allora, Ashe scende?\"\nD:\"S&igrave;, ha detto che non ci metter&agrave; molto.\"\n\nMentre bevo il latte di capra, mi leggo il libro che avevo preso prima alla biblioteca.\nB:\"Cosa stai leggendo?\"\nD:\"La storia delle tre Figlie del Gelo.\"\nB:\"Ah ottima scelta, &egrave; una bella storia.\"\nD:\"La conosci?\"\nAn:\"Tutti qui conoscono la storia delle tre sorelle e il nome della nostra fazione deriva proprio da una di esse, Avarosa.\"\nD:\"Come mai?\"\nAn:\"Ashe ha una specie di infatuazione per lei, &egrave; il suo idolo insomma, dice pure che nel tentativo di assassinio, lei l&#039;abbia salvata, in forma di un acquila di ghiaccio, portandola dall&#039;arco che ha adesso.\"\nD:\"Capito, ehi Anivia, visto che tu esisti da quando il Frejlord &egrave; nato, le hai mai conosciute?\"\nAn:\"Beh s&igrave;, le ho conosciute tutte e tre da quando erano delle bambine, fino a che non lottarono fra di loro.\"\nD:\"E come erano?\"\nAn:\"Se te lo dicessi non mi crederai, Avarosa era identica a Ashe e Serylda a Sejuani, forse loro due sono le discendenti di Avarosa e Serylda, hanno le lorro armi pure.\"\nD:\"E la terza sorella, Lissandra?\"\nAn:\"Lei era alquanto misteriosa come ragazza e fisicamente debole, faticava a camminare ed era ceca, ma quando conobbe il potere del vero ghiaccio...\"\nD:\"Il vero ghiaccio?\"\nAn:\"E&#039; il potere che uso io e gli altri come Braum e Ashe, tramite armi fatte di un ghiaccio che non si sciolgono mai.\"\nD:\"Capito e allora cosa succedette dopo?\"\nAn:\"Lei, scoprendo che poteva diventare immortale, si sottomise al volere delle Sentinelle del Gelo e trad&igrave; le sue sorelle, ma alla fine durante la guerra contro le Sentinelle, non si seppe pi&ugrave; nulla di lei, sembrava scomparsa.\"\nD:\"Possibile che sia ancora viva?\"\nAn:\"Ne dubito, sconfitte le Sentinelle perse i suoi poteri e quindi anche la sua immortalit&agrave;.\"\nD:\"Capito.\"\n\n\nDopo un po di tempo arriva Ashe, con una strana armatura.\nD:\"Finalmente, ce ne hai messo di tempo e...... che cavolo ti sei messa?\"\nAs:\"Non ti piace? E&#039; il mio vestito da caccia, l&#039;ho chiamato Ashe Predona!!\"\nD:\"-.-  perch&eacute; hai messo il tuo nome? E pi&ugrave; importante perch&eacute; proprio predona?!\"\nAs:\"A me suona bene come nome.\"\nAn:\"Lasciamo perdere, Ashe vai dai cacciatori che ti stanno aspettando.\"\nAs:\"S&igrave;, s&igrave; vado subito, tu vieni con me Diana?\"\nD:\"La caccia non fa per me resto qui\"\nAs:\"Ah ok a dopo allora, dovremmo tornare verso pomeriggio.\"\n\n\nPassano le ore, mentre io mi abbandono alla lettura dei libri, la storia delle Sorelle del Gelo mi ha incuriosito di pi&ugrave; questa terra. Leggo una fiaba che racconta una storia sulla Strega dei Ghiacci.\nD:\"Strega dei Ghiacci, dove ho gi&agrave; sentito questo nome?Ah s&igrave; era quella volta nella landa, contro una che si credeva chiss&agrave; chi e si faceva chiamare Strega dei Ghiacci, beh da come la definiscono qui sembrerebbe proprio lei.\"\nSuccessivamente arrivano Braum e Tryndamere.\nT:\"Ehi perch&eacute; non vieni ad allenarti con noi, smettila di perdere tempo in stupidi libri.\"\nD:\"Preferisco allenare la mente, che ritrovarmi tutto muscoli senza cervello come te.\"\nT:\"Mi stai forse dando dell&#039;idiota?\"\nD:\"No cervello di gallina, quello lo sei gi&agrave;.\"\nT:\"Sei vuoi risolviamo le faccende fuori.\"\nD:\"Oh con molto piacere, barbaro da strapazzo che non sei altro.\"\nBraum si mette immezzo a noi due dividendoci.\nB:\"Su su smettetela voi due, non c&#039;&egrave; bisogno di litigare.\"\nD:\"Tsk va bene.\"\nPoi improvvisamente sentiamo urlare qualcuno.\nCacciatore:\"AIUTO AIUTO, LA REGINA ASHE E&#039; IN PERICOLO!!\"\nD:\"Mh? Che sta succedendo?\"\nB:\"Non lo so ma andiamo a vedere.\"\n\nCi dirigiamo da dove provenivano le urla.\nC:\"Signor Braum anf anf re Tryndamere anf anf la regina Ashe anf anf\"\nT:\"Calmati e cerca di prendere fiato, dicci cosa &egrave; successo.\"\nC:\"Beh ecco.... avevamo finito di cacciare e ci stavamo dirigendo in citt&agrave;, finch&eacute; all&#039;improvviso non comparvero dei troll che ci assalirono.\"\nB:\"Che fine hanno fatto gli altri e la regina?\"\nC:\"Molti di noi morirono dall&#039;imboscata, ma non miravano ai cacciatori ma ben s&igrave; alla regina, io scappai grazie a lei che mi copriva per venire ad informarvi, non so che gli abbiano fatto, ma dubito che la uccideranno, almeno lei mi disse cos&igrave; per rassicurarmi.\"\nT:\"Sciocca di una ragazzina, sempre a dare la vita per gli altri, dove sono ora?\"\nC:\"A Nord-Est della citt&agrave;, non credo che si siano allontanati di molto.\"\nB:\"Mmmm, bene prepariamoci dobbiamo andare a salvare Ashe. Diana tu.....ehi dove &egrave; andata a finire?\"\n\nD:\"Dannazione mi devo sbrigare.\"\nPenso fra me e me, mentre vado pi&ugrave; veloce che posso usando lo scatto lunare.\nD:\"Mia Dea fa si che sia ancora viva, non voglio perdere qualcun&#039;altro a me caro.\"\n\n\nOk &egrave; terminata anche la terza parte, spero vi piaccia e lasciate qualche commento su come vi sta andando la storia, se potevo fare almeno un manga su di essa mi sarebbe molto pi&ugrave; facile farvi capire la situazione e anche pi&ugrave; divertente, ma il bello delle storie &egrave; che ogniuno se la immagina a modo suo.\n\nLink alla biblioteca:  http://boards.euw.leagueoflegends.com/it/c/creazioni-della-community-it/dvvixXez-piccola-biblioteca-alessandrina\n\nE la parte 2:  http://boards.euw.leagueoflegends.com/it/c/creazioni-della-community-it/n5npMATf-un-viaggio-nel-freljord-parte-2-vite-diverse\n\nPraise the Moon!!!!","replies":[{"poster":"Kavendisch ","date":"2015-08-14T14:54:08.921+0000","up_votes":1,"down_votes":0,"body":"Veramente una storia ben scritta ma l'uso dei tempi verbali da parte del cacciatore non è esattamente il massimo.","replies":[{"poster":"SickAnto","date":"2015-08-14T18:43:16.244+0000","up_votes":1,"down_votes":0,"body":"Grazie del complimento, diciamo che i tempi dei verbi sono il mio tallone d'achille, ho sempre il dubbio se è quello giusto, comunque se t'interessa c'è la quarta parte, ti lascio il link:  http://boards.euw.leagueoflegends.com/it/c/creazioni-della-community-it/TZWGzdtM-un-viaggio-nel-freljord-parte-4guai-in-vista","replies":[]}]},{"poster":"UnluckyShraZ","date":"2015-08-12T00:11:23.725+0000","up_votes":1,"down_votes":0,"body":"Ho letto tutte le parti che hai scritto fino ad ora,\n\nHai ragione, probabilmente se fossero \"disegnate\" come una sorta di manga, sarebbero di maggiore effetto, perché l'andamento e anche i picchi di umorismo mi ricordano molto il manga e forse si adattano poco ai racconti :)\n\nComunque la fantasia non ti manca, i racconti sono scorrevoli, fai solo attenzione a dei piccoli errori di ortografia che possono far inceppare la narrazione :)\n\nContinuerò a seguire la storia :)","replies":[{"poster":"SickAnto","date":"2015-08-12T11:21:32.518+0000","up_votes":1,"down_votes":0,"body":"Grazie. : )","replies":[]}]}]}