{"poster":"SickAnto","date":"2019-01-25T16:51:27.873+0000","title":"Aggiornamento Lore: Demacia sta per passare guai molto grossi.","subforum":"Discussioni generali","up_votes":2,"down_votes":0,"body":"&Egrave; uscito Sylas in live, &egrave; uscita pure Lore nuova! Che fa andare avanti la storia di Demacia! Cio&egrave;, ci sono dei progressi, *tecnicamente*.\r\nBando alle ciancie, passiamo a cosa hanno aggiunto e chi hanno aggiornato.\r\n\r\n[Disordine](https://universe.leagueoflegends.com/it_IT/story/turmoil/) e [La Recluta](https://universe.leagueoflegends.com/it_IT/story/sylas-color-story/)\r\n\r\n[Garen](https://universe.leagueoflegends.com/it_IT/story/champion/garen/)\r\n\r\n[Lux](https://universe.leagueoflegends.com/it_IT/story/champion/lux/)\r\n\r\n&Egrave; tutto qui! *Per ora*.\r\n\r\nDitemi il vostro parere su come sta procedendo la Riot a riguardo!","replies":[{"poster":"Tsuki99","date":"2019-01-26T07:54:03.576+0000","up_votes":1,"down_votes":0,"body":"A me sinceramente questo cambio di immagine di Demacia cosi brusco non piace... Che il loro pensiero sulla magia fosse sbagliato gia lo sapevamo tutti ma avrei mantenuto quell immagine di società utopistica di giustizia... E avrei introdotto sylas come colui che poteva far cambiare opignone sulla magia senza scatenare una guerra ma iniziando a convincere prima lux poi garen e cosi via tutti che la magia non è sbagliata ma è l utilizzo che se ne fa.... In modo da avere una nuova generazione di demacia più aperta","replies":[{"poster":"Pulastér","date":"2019-01-26T18:32:16.234+0000","up_votes":1,"down_votes":0,"body":"Ho sempre visto la cosa della giustizia come semplicemente una facciata e non la vera Demacia che ora sta emergendo alla luce di tutti. Un po' come Noxus che porta l'immagine di una nazione crudele, sanguinaria che mira all'espansione, ma in realtà non è tutta questa città-stato demonizzata che appare. Sì, ha comunque i suoi lati bui ma indubbiamente è molto più aperta e libera dai pregiudizi rispetto alla sua controparte che vuole apparire perfetta e immacolata, risultando solo ipocrita e falsa difronte a parecchie evidenze.","replies":[]}]},{"poster":"Otivnaig","date":"2019-01-25T18:24:50.357+0000","up_votes":1,"down_votes":0,"body":"Mi interessa solo Garen. Mi dai una mano su alcune cose? Non sono molto ferrato sulla lore, dato che la gran parte dei cambiamenti e novità che stanno ponendo non mi piacciono e, spesso, non li leggo.\n\n> sette della Foresta silente e lottando tra i valorosi difensori di Pietrabianca.\n\nChi/cosa/dove sono?","replies":[]}]}