{"poster":"SickAnto","date":"2017-12-10T12:38:11.859+0000","title":"Il Ghiaccio e la Luna: Capitolo 16 - Il Regno della Giustizia","subforum":"Creazioni della community","up_votes":2,"down_votes":1,"body":"E&#039; passato quasi un mese da quando il gruppo &egrave; partito per il viaggio e finalmente, a tardo pomeriggio di quel giorno, possono intravedere da lontano la capitale del Regno: Demacia.\r\n\r\n&quot;Eccola l&igrave;.&quot; Esordisce Ashe, con tono soddisfatto e pone una mano sulla fronte per coprirsi dal sole. &quot;Sembra bella da questa distanza.&quot; Commenta in seguito. &quot;Non fidiamoci delle apparenze.&quot; Esclama Diana. &quot;Oh, ma quanto siamo sospettose.&quot; Dice la Regina in maniera scherzosa e poco dopo avvisare. &quot;Non diamo giudizi affrettati e chiedo a tutti quanti di evitare problemi inutili. Ora andiamo.&quot;\r\n\r\nIl gruppo dunque si muove, passa per le campagne e i piccoli villaggi demaciani, attraverso la strada principale fatta con lastre di pietra, per infine arrivare davanti alle enormi mura che circondano la citt&agrave; principale del Regno. Appena si avvicinarono ad esse, Diana sente uno strana strana presenza attorno a quelle strutture di pietra e sente persino un po&#039; di stanchezza, ma per questo pensa che sia pi&ugrave; per il viaggio. Anche Ashe avverte qualcosa di strano nell&#039;aria e nota che il suo arco sia diventato meno brillante del suo solito. Comunque sia, entrambe ci fanno poco caso e proseguono.\r\n\r\nIl gruppo viene fermato dalle alabarde incrociate delle guardie che stanno davanti all&#039;entrata: li hanno presi di mira con sospetto. &quot;Identificatevi.&quot; A quel ordine, la Regina pone una mano chiusa sul petto e china leggermente il capo. &quot;Io sono Ashe, Matriarca della trib&ugrave; degli Avarosani e ufficialmente la Regina riconosciuta del Freljord.&quot; Si presenta e allarga il braccio sinistro per indicare il resto. &quot;Loro sono le mie guardie del corpo.&quot; I soldati demaciani annuiscono e li lasciano passare. &quot;Vi stavamo aspettando.&quot; Commentano soltanto.\r\n\r\nDunque avanzano all&#039;interno della citt&agrave;, attraverso la strada centrale e la gente del luogo si affaccia per osservare gli stranieri: c&#039;&egrave; chi con sorpresa, chi con disgusto e addirittura con paura. Si sentono persino dei pettegolezzi tra il popolo e alcuni di questi arrivano all&#039;orecchio di Diana, non trovandoli molto piacevoli. Lei si gira intorno e non fa altro che notare tutti quelli sguardi pieni di odio nei loro confronti; si domanda che cosa sia successo in origine per avere questa aria ostile. Controlla poi Ashe e non sembra che a lei dia troppa importanza per quella ostilit&agrave;, pi&ugrave; impegnata a proseguire verso la finale destinazione.\r\n\r\nUna bambola di pezza cade distrattamente per la strada, davanti al gruppo, dove Ashe decide di scendere dal cavallo e si inginocchia per prendere il giocattolo. Dopodich&eacute; si alza in piedi e va verso la bambina che intanto si &egrave; messa dietro la propria madre, spaventata. La Regina si inginocchia di nuovo e allunga il braccio con la bambola in mano e sorride. La bambina, per un primo momento non ha il coraggio di andare a riprendersela ma nel vedere quel sorriso tanto pacifico, va e afferra velocemente il proprio oggetto caro, stringendolo a se e se lo coccola come se fosse una bambina vera. &quot;Grazie...&quot; Dice infine, con un tono timido verso l&#039;arciera che ricambia con una piccola carezza sulla testa e poi ritorna verso il proprio cavallo.\r\n\r\nQuel gesto ha lasciato un po&#039; di stucco le persone li vicine e i pettegolezzi vanno da chi pensa sia un gesto totalmente benevolo a chi sospetta sia un inganno per un piano pi&ugrave; grande contro di loro. Ma nonostante tutto ci&ograve;, alla freljordiana non interessa affatto, pi&ugrave; desiderosa di arrivare al palazzo di Demacia dove vivono il Re, il Principe e le pi&ugrave; alte cariche.\r\n\r\nArrivano prima alla Piazza grande e ne ammirano la enorme struttura, sebbene Diana sente con pi&ugrave; forza quel estraneo mancamento di forze. Alla fine giungono davanti alla Cittadella dell&#039;Alba, il cuore del Regno e una delle massime esposizioni architettoniche di Demacia.\r\n\r\nAnche qui vengono fermati, stavolta da un quartetto di guardie che richiedono di nuovo le presentazioni, inoltre, il motivo dell&#039;arrivo. Ashe le esegue come prima e aggiunge. &quot;Sono qui per invito del Principe di Demacia, Jarvan IV Lightshield.&quot; Fuoriesce dunque la lettera come prova e lo consegna ad uno dei soldati, che ne controlla la veridicit&agrave; e poco dopo esclama. &quot;Potete andare. Lasciate qui i cavalli, verranno scortati alle stalle, vi scorter&ograve; dentro al palazzo e inoltre.&quot; Si sofferma. &quot;Dovrete consegnare ogni oggetto magico a vostra disposizione, per questione di sicurezza.&quot; Ashe aggrotta la fronte, un po&#039; sospetta, per poi domandare. &quot;Verranno distrutti?&quot; Il soldato prontamente risponde. &quot;No, se non ce ne sar&agrave; bisogno.&quot; La Regina fa un sospiro di rammarico e dopodich&eacute; va per consegnare il proprio Acro di Avarosa. &quot;Fate attenzione, &egrave; un oggetto molto importante per me.&quot; Avverte al demaciano, che guarda con stupore per il materiale fatto e lo prende delicatamente, con la paura che possa rompersi. &quot;State tranquilla, lo conserveremo per bene e ve lo ritorneremo non appena finirete la vostra visita.&quot; Conclude il soldato, per poi consegnare delicatamente l&#039;arco ad un altro suo compagno.\r\n\r\n&quot;Seguitemi.&quot; Esclama, mentre gi&agrave; si incammina. &quot;Vi porter&ograve; dal principe.&quot; Il gruppo va per seguire il demaciano, attraversano l&#039;entrata del palazzo e rimangono ancora stupiti per la grandezza della struttura; nessuno di loro ha visto architetture simili, escludendo il palazzo della Cittadella e di Rakelstake, che a malapena possono pareggiare la magnificenza.\r\n\r\nPoco dopo passano nella Sala del Valore, una zona dove si commemora i caduti in battaglia: delle immense statue bianche di soldati sono posti al centro della stanza, sopra una scalinata, con delle ali a lato e in mezzo alle possenti statue c&#039;&egrave; un trono, dove vi &egrave; seduto il Principe di Demacia, Jarvan IV che sta discutendo con uno dei pi&ugrave; importanti guerrieri del Regno, Rodian.\r\n\r\nIl soldato si ferma davanti alle scalinate e china il busto verso il Principe, per salutarlo onorevolmente. &quot;Mio signore, vi annuncio l&#039;arrivo della Regina Ashe del Freljord assieme al suo seguito.&quot; Jarvan si alza dal trono e interrompe il discorso con l&#039;uomo, per poi scendere dalle scale e accoglie la giovane donna con le braccia allargate. &quot;Benvenuti a Demacia.&quot; Esordisce calorosamente, si avvicina alla donna e si china per poi allungare la mano, aspetta che la Regina conceda la mano e appena lo fa, le regala un bacio su di essa.\r\n\r\n&quot;E&#039; un piacere che abbiate accolto la mia richiesta.&quot; Dice con tono pacato, mentre rialza il busto e guarda con un largo sorriso la donna. &quot;Spero che il viaggio sia stato gradevole.&quot; Continua. &quot;Abbiamo avuto qualche problema ma niente di che.&quot; Commenta la Regina e in seguito si avvicina pure il guerriero con cui stava parlando il Principe, che gli appoggia una mano sulla spalla. &quot;Lasciate che vi presenti uno dei pi&ugrave; valorosi soldati di tutta Demacia, facente parte della gloriosa Indomita Avanguardia, Rodian.&quot; Il demaciano si inchina davanti a lei. &quot;E&#039; un piacere conoscerla.&quot; Dice, con tono un po&#039; freddo. &quot;Anche il mio.&quot; Esclama Ashe, anche lei poco calorosa.\r\n\r\nI due si osservano per pochi secondi, silenti, poco dopo &egrave; il Principe a prendere parola. &quot;Proseguiamo comunque. I vostri soldati possono soggiornare nella caserma della nostra citt&agrave;: Rodian potrebbe benissimo accompagnarli. Voi invece, vivrete dentro al palazzo, in una stanza degli ospiti, gi&agrave; pronta.&quot; Ashe non sembra molto compiaciuta e alza un sopracciglio. &quot;Desidererei stare pi&ugrave; con la mia gente.&quot; Dice. &quot;Capisco, ma non &egrave; mia intenzioni tenervi come una prigioniera e vi prego di avere fiducia in Demacia.&quot; Aggiunge il Principe.\r\n\r\nDunque la giovane Regina fa cenno a Diana di avanzare per starle accanto e poi esclamare. &quot;Allora vi chiedo soltanto di ospitare al palazzo una dei miei generali. Per favore.&quot; Jarvan aggrotta la fronte e chiede. &quot;Posso domandare il perch&eacute;?&quot; Ashe sorride. &quot;E&#039; la Valchiria del Nord.&quot;\r\n\r\nIl Principe a questa affermazione rimane sorpreso ma poco dopo sorride, soddisfatto. &quot;Quale onore vedere una cos&igrave; valida guerriera a Demacia.&quot; Si rivolge verso Ashe e annuisce. &quot;La vostra richiesta verr&agrave; esaudita, mia Regina. Ora...&quot; Allunga il braccio destro per indicare il corridoio. &quot;Perch&eacute; non facciamo una piccola passeggiata? Vi accompagner&ograve; alla vostra stanza, se siete d&#039;accordo.&quot; La Regina con un cenno del capo acconsente. &quot;Bene, proseguiamo.&quot;\r\n\r\nLe dieci guardie freljordiane vengono scortate verso le camere della caserma e intanto, le due donne seguono il Principe nel corridoio che le porta nella zona degli ospiti ed &egrave; sempre il principe a iniziare un discorso. &quot;Dal rapporto della Ranger che vi avevo inviato, sapevo che non eravate in ottime condizioni, Valchiria.&quot; &quot;Guarisco in fretta.&quot; Esclama Diana, forse un po&#039; ironica. &quot;Decisamente. Scusate ma posso sapere il vostro vero nome?&quot; Chiede il Principe. &quot;E&#039; Diana.&quot; Fa la Regina per poi proseguire. &quot;Comunque, siete stato un po&#039; vago nella lettera. Qual&#039;&egrave; il reale motivo per cui mi avete invitata?&quot; Chiede e le viene data risposta con una leggera risata. &quot;Questo, ne parleremo a tempo debito. Per ora godetevi la giornata e riposatevi, dopo il lungo viaggio. Inoltre, ne approfitto per invitarvi a un ballo che si terr&agrave; tra qualche giorno.&quot;\r\n\r\n&quot;Un ballo?&quot; Domanda la donna freljordiana. Sorpresa. &quot;S&igrave;, vi consiglio di prepararvi e in caso, chiamer&ograve; un insegnante per mostravi com&#039;&egrave; qua da noi.&quot; La donna sorride e si tocca una guancia. &quot;Oh, beh, non so come ringraziarvi. Allora accetto l&#039;invito.&quot; \r\n\r\nIl Principe annuisce soddisfatto e aggiunge. &quot;Ne sono entusiasta. Comunque, ve la cavate bene col demaciano. Davvero.&quot;Ashe pone una mano dietro la testa e se la gratta. Quasi imbarazzata. &quot;Grazie anche se credo di essere un po&#039; arrugginita, ma perch&eacute; questa affermazione?&quot; Chiede gentilmente. &quot;Beh, la nostra gente, specialmente i nobili, sono orgogliosi e vi giudicheranno in base alla vostra parlata. Spero che li stupirete.&quot; Ashe, sorridente, annuisce con la testa. &quot;Non vi deluder&ograve;, statene certo.&quot; Anche l&#039;uomo sorride. &quot;Ne sono sicuro.&quot;\r\n\r\nDopo qualche passo, i tre arrivano davanti alla porta della camera e il Principe si occupa per aprirla. &quot;Eccovi qui, nella vostra stanza. Spero che sia di vostro gradimento. Ora, penso di ritirarmi e ordinare alle serve la vostra camera, signorina Diana. E&#039; proprio quella accanto. Quando sar&agrave; pronta, verranno a chiamarvi.&quot; La Lunari accenna un semplice movimento con la testa per ringraziare. &quot;Dunque, con permesso, mi dileguo. Buona giornata.&quot;\r\n\r\nLe due donna, sole, iniziano a entrare nella stanza, che si dimostra immensamente lussuosa, adatta proprio per una Regina. Diana si guardo intorno e tutto quello sfarzo la lascia decisamente stupita, anche se non approva quel bianco che domina la stanza, contornato di blu.\r\n\r\nNon si pu&ograve; dire lo stesso di Ashe, che ne ignora l&#039;aspetto e va invece ad affacciarsi alla finestra e fa un lungo sospiro. Diana distoglie lo sguardo dalla stanza e si concentra nell&#039;amica. Poggia una mano sulla sua spalla, tanto per ottenere le sue attenzioni. &quot;Va tutto bene?&quot; Le chiede preoccupata e l&#039;arciera si gira, con un piccolo sorriso. &quot;Certo &egrave; solo...quel uomo...&quot; Gli occhi azzurri si rivolgono verso il basso e morde il labbro inferiore.\r\n\r\nDiana aggrotta la fronte. &quot;Chi? Il Principe? Non vi fidate di lui?&quot; Domanda in successiva. Ashe scuote la testa e sorride divertita. &quot;No no, mi sembra una brava persona e poi Quinn me ne ha parlato bene di lui.&quot; Si gira con il volto e torna ad osservare la finestra. Ne accarezza il vetro. &quot;E&#039; Rodian che mi preoccupa. Al solo guardarlo mi mette paura e anche rabbia.&quot; Il tono &egrave; triste e Diana inizia a preoccuparsi. &quot;Non &egrave; che l&#039;hai gi&agrave; incontrato? Oppure ti ricordi con qualcun&#039;altro?&quot; L&#039;arciera scuote di nuovo la testa, confusa. &quot;Non so che dirti. Ho la mente offuscata in questo momento, non riesco a riordinare alcuni miei ricordi.&quot;\r\n\r\nL&#039;arciera si distanzia dalla finestra e fa qualche passo verso destra, dove c&#039;&egrave; l&#039;enorme armadio. Ne appoggia una mano a pugno. &quot;Devo chiarirne il perch&eacute;.&quot; Diana si avvicina di nuovo a lei e commenta. &quot;Ora &egrave; comprensibile gli sguardi che vi stavate regalando: nemmeno lui era contento di vedervi.&quot; Ashe torna a guardarla. &quot;Beh, &egrave; normale. Ormai dovresti sapere com&#039;&egrave; tra freljordiani e demaciani. Anche se...&quot; Incrocia le braccia e ci riflette sopra, con gli occhi chiusi. &quot;Lui era diverso...non era il semplice disprezzo, era come-&quot;\r\n\r\n&quot;Gaek?&quot;\r\n\r\nAnticipa l&#039;amica, che la lascia sorpresa. &quot;Te l&#039;ha detto...?&quot; Diana annuisce con la testa. &quot;E&#039; il motivo per cui non ho voluto che venisse.&quot; Ashe sorride. &quot;Hai fatto bene. Comunque, parlando d&#039;altro, come te la cavi col demaciano?&quot; Diana alza le spalle. &quot;Me lo sto studiando. Non &egrave; cos&igrave; difficile, penso che tra qualche giorno posso parlarlo perfettamente.&quot; L&#039;amica rimane ancora una volta sorpresa. &quot;Qualche...giorno?&quot; L&#039;Aspetto ride lievemente nel vederla con quel espressione. &quot;S&igrave;, sapevo alcune parole prima di venire nel Freljord e durante il tragitto lo stavo apprendendo.&quot; Ashe ancora rimane perplessa dalla velocit&agrave; di apprendimento della targoniana. Tanto per dire. &quot;Ma &egrave; un altro potere di voi Incarnazioni?&quot; Diana scuote la testa e sorride. &quot;Ho sempre avuto questa capacit&agrave;.&quot;\r\n\r\nPoi la donna appoggia una mano sotto al mento della Regina e le avvicina il volto, con il suo sguardo che si fa serio. &quot;Ashe, riguardo a Rodian. Ti aiuter&ograve; in tutto e per tutto a capire il collegamento che ha con te.&quot; Con l&#039;altra mano, afferra quella dell&#039;amica, stringendogliela e la guarda dritta negli occhi.\r\n\r\n&quot;Ashe, sappi che...&quot;\r\n\r\n&quot;Signorina Diana, la vostra camera &egrave; pronta.&quot; Esclama una serva, che &egrave; appena arrivata e si trova davanti alla porta aperta. Diana molla la mano e si allontana di un passo da Ashe, per poi dire alla ragazza. &quot;Capito, ora arrivo.&quot; Torna a guardare l&#039;amica. &quot;Beh, io vado a vedere com&#039;&egrave;. Tu riposati invece, &egrave; pur sempre stato un viaggio pesante.&quot; Detto questo la donna da le spalle e inizia a camminare verso l&#039;uscita. &quot;Diana.&quot; Viene chiamata. &quot;Che cosa stavi per dirmi?&quot;\r\n\r\nL&#039;Aspetto si ferma, volta il suo sguardo sorridente verso di lei e le dice.\r\n\r\n*&quot;Sappi che, io ti protegger&ograve;. Sempre.&quot;*\r\n**FINE SEDICESIMA PARTE**\r\n___\r\n\r\nSono riuscito anche a finire questa ennesima parte. Finalmente si &egrave; a Demacia e di certo non sar&agrave; una passeggiata per le due vivere in terra straniera, dove neanche sono viste bene.\r\n\r\nSpero che vi sia piaciuta e ringrazio a tutti quelli che sono arrivati fin qui. Ora non so se riuscir&ograve; a pubblicarne un&#039;altra entro fine anno(visto che ho altri progetti in mente) ma intanto vi lascio link a [Il Ghiaccio e la Luna su Wattpad](https://www.wattpad.com/story/101971954-il-ghiaccio-e-la-luna) e vi saluto!.","replies":[]}