{"poster":"SickAnto","date":"2017-04-25T19:50:58.442+0000","title":"Aggiornamento Lore: quattro Vastaya determinati e Riot mezza perdonata.","subforum":"Discussioni generali","embed":{"description":"Benvenuti in Universo, la fonte di informazioni definitiva per il mondo di League of Legends.Qui troverete una vasta collezione di opere e manufatti, come storie che raccontano le origine dei vostri campioni preferiti e panorami che ritraggono le regioni storiche dalle quali provengono.","url":"http://universe.leagueoflegends.com/it_IT/","image":"http://universe.leagueoflegends.com/images/shareImage.jpg"},"up_votes":4,"down_votes":1,"body":"Allora allora allora allora...uhm, diciamo che in un certo momento non me li aspettavo gli aggiornamenti, forse deluso dai due piccioni piccioncini.\r\nComunque, stavolta si parla degli altri Vastaya e devo dire che la Riot dopo la &quot;stronzata&quot; dell&#039;ultima volta la posso perdonare, non completamente ma per ora le voglio bene.\r\nA mio parere sono tutte e quattro Lore ben fatte, e solo una(Nami) non ha subito tanti cambiamenti ma solo pi&ugrave; informazioni.\r\nFinito il discorso, ecco a voi in ordine:\r\n[Ahri](http://universe.leagueoflegends.com/it_IT/story/champion/ahri/) pi&ugrave; [Il giardino dell&#039;oblio](http://universe.leagueoflegends.com/it_IT/story/ahri-garden-forgetting/) e [Uno scambio equo](http://universe.leagueoflegends.com/it_IT/story/ahri-color/)\r\n[Nami](http://universe.leagueoflegends.com/it_IT/story/champion/nami) pi&ugrave; [Primi passi](http://universe.leagueoflegends.com/it_IT/story/nami-first-steps/)\r\n[Rengar](http://universe.leagueoflegends.com/it_IT/story/champion/rengar) pi&ugrave; [Preda](http://universe.leagueoflegends.com/it_IT/story/rengar-prey/)\r\n[Wukong](http://universe.leagueoflegends.com/it_IT/story/champion/monkeyking) pi&ugrave; [Veloce e stupido](http://universe.leagueoflegends.com/it_IT/story/monkeyking-color/)\r\n\r\nIn fondo al sito principale potete pure trovare una albero genealogico fatto dal avventuriero piltoveriano del altro racconto sui Vastaya in generale.\r\nBeh, tocca a voi commentare con i vostri pensieri, come al solito. :P\r\nP. S. Ci sono piccole informazioni su altri campioni ohohohoh\r\nP. P. S. Create un luogo dove si possa parlare di Lore, dannazione, &quot;Discussioni generali&quot; &egrave; brutto &egrave;_&eacute;","replies":[{"poster":"DonCavallo","date":"2017-04-25T21:30:27.720+0000","up_votes":1,"down_votes":1,"body":"perchè ahri due storie e gli altri una sola?","replies":[{"poster":"HaIIeIujah","date":"2017-04-25T21:34:56.724+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=DonCavallo,realm=EUW,application-id=MJVj50Jw,discussion-id=h1oj0jWM,comment-id=0002,timestamp=2017-04-25T21:30:27.720+0000)\n>\n> perchè ahri due storie e gli altri una sola?\n\nTre, con Stray Fox. Le risposte al momento sono due:\n\n* E' un personaggio complesso malrappresentato nel gioco, quindi hanno deciso di darle un po' di spazio al di fuori di esso, dove le sttigliezze del suo carattere possono essere ben discusse.\n* Qualcuno alla Riot ha deciso di trollare Lo Sgherro.","replies":[{"poster":"DonCavallo","date":"2017-04-25T21:46:50.525+0000","up_votes":1,"down_votes":0,"body":"Sono rimasto piacevolmente colpito da Wukong, l'ho sempre trovato un idiota messo li a far felici i cinesi. E invece...\nGli altri son rimasti meh","replies":[]}]}]},{"poster":"JoyBoy39","date":"2017-04-25T20:10:27.433+0000","up_votes":4,"down_votes":3,"body":"a me viene il voltastomaco soltanto a vederli quei due campioni","replies":[{"poster":"SickAnto","date":"2017-04-25T20:15:43.827+0000","up_votes":1,"down_votes":0,"body":"Chi?","replies":[{"poster":"JoyBoy39","date":"2017-04-25T20:18:22.545+0000","up_votes":3,"down_votes":2,"body":"> [{quoted}](name=SickAnto,realm=EUW,application-id=MJVj50Jw,discussion-id=h1oj0jWM,comment-id=00000000,timestamp=2017-04-25T20:15:43.827+0000)\n>\n> Chi?\n\nxayah e rakan,mi chiedo per quale motivo la Riot alzi il livello dei nuovi personaggi per poi ricadere come foglie sotto il vento d'autunno,questi due \"campioni\" sono palesemente fatti per attirare una certa fascia d'utenza,niente di più,niente di meno,poi è vero,non è possibile rilasciare sempre campioni del calibro di {{champion:136}} o di {{champion:202}} o di {{champion:201}}  ma,almeno, se ci provassero sarebbe un gran passo avanti,come nel caso di {{champion:223}} ","replies":[{"poster":"Pulastér","date":"2017-04-25T23:47:59.039+0000","up_votes":3,"down_votes":1,"body":"\"sono palesemente fatti per attirare una certa fascia d'utenza\" Questa dinamica è applicata su tutti i campioni finora scritti, creare personaggi accattivanti e studiati a tavolino è il lavoro di chiunque voglia creare personaggi che il pubblico possa apprezzare e con cui empatizzare. Tutti lo fanno, altrimenti le storie e i film non reggerebbero nemmeno la prima pagina/prima scena.\n\nJhin è un serial killer con una personalità complessa, chiaramente Shakespeariana. Nella sua ottica egli si considera un'artista e suoi assassinii opere d'arte. (piace alla fascia d'utenza che apprezza personaggi complessi e per nulla banali nelle loro azioni, per quanto terribili) Come non innamorarsene?\n\nBraum è l'ideale vivente dell'eroe popolare, un uomo semplice e umile, sempre positivo, che aiuta e protegge le persone in difficoltà. (piace alla fascia d'utenza che apprezza personaggi semplici e positivi, il tipico eroe senza macchia che salva il giorno e le cui gesta sono narrate nelle favole) Come non innamorarsi di tanta positività e bontà del personaggio?\n\nXayah e Rakan sono due personaggi che in un tempo indefinito hanno sviluppato un rapporto empatico e indivisibile durante le loro avventure, che poi si è evoluto in un reciproco amore sincero, facendoli capire che hanno bisogno l'uno dell'altro per poter superare gli ostacoli imposti dalla loro causa (rivoluzione vastayana su larga scala, guerra contro le ombre di Zed, ecc.).\n\nPoi questa cosa mi ha ricordato un sacco il rapporto tra Elika e il protagonista del reboot di Prince of Persia. Inutile dire che mi hanno conquistato. Quindi come non innamorarsi di un simile rapporto che hanno instaurato?\n\nQuindi che senso ha lamentarsi del fatto che la Riot abbia avuto successo e colpito nel segno con l'ennesimo personaggio ben studiato e con una fascia predeterminata? Davvero, perché Jhin e Braum vanno bene e la coppia no? (è una domanda retorica, non mi interessa alla fine)","replies":[{"poster":"JoyBoy39","date":"2017-04-26T16:15:48.762+0000","up_votes":1,"down_votes":1,"body":"> Quindi che senso ha lamentarsi del fatto che la Riot abbia avuto successo e colpito nel segno con l&#x27;ennesimo personaggio ben studiato e con una fascia predeterminata? Davvero, perché Jhin e Braum vanno bene e la coppia no? (è una domanda retorica, non mi interessa alla fine)\n\nJhin e Braum vanno bene sopratutto perchè appunto jhin e braum e taanti altri se li fai vedere ad una persona che non gioca a LoL dirà(ho fatto vedere aurelion e braum a 16 persone diverse in posti diversi,mi annoiavo):wow figo,oppure bello ci sta,ho fatto vedere xayah e rakan ed erano tutti un pò meh.Sai perchè?Perchè i primi hanno una loro personalità e caratteristiche peculiari,cosa che la coppia non ha,tantochè al loro rilascio furono scambiati per delle SKIN,cazzo wow,la coppietta di volatili che se non sono in duo bot diventano off meta","replies":[{"poster":"Pulastér","date":"2017-04-26T17:14:43.074+0000","up_votes":1,"down_votes":0,"body":"Io ogni personaggio l'ho apprezzato a pieno giocandoci. Semplicemente mostrarli non funziona sempre per forza, la personalità e il bel aspetto c'entrano poco. \n\nJhin magari aveva un bel design ed era piacciuto, idem Braum. Io per esempio ho \"compreso\" Jhin solo quando decisi di provarlo dopo averlo trovato nel forziere (e anche per capire perché piaceva tanto). Prima non mi diceva nulla, per quanto mi riguardava poteva essere un fenomeno da baraccone uscito dal carnevale invece che un genio incompreso, poi l'ho rivalutato, ma un sacco rivalutato. \n\nBraum ha fatto la sua figura nel teaser e mi ispirò a farmi i famosi 6300 ip per sbloccarlo (essendo un main support), e capii di averci azzeccato. La coppia non mi disse nulla nemmeno a me all'inizio, poi però li ho apprezzati giocando Rakan e conoscendoli nel gioco (mi interessava lo stile di gioco del maschio, il primo support mobile, non potevo non averlo). Le battute che si scambiano tra di loro sono divertenti e mai forzati, sembravano davvero una coppia e per nulla uno stereotipo. \n\nLa loro personalità sta nell'intesa e nei scambi di dialoghi che tengono e le loro peculiarità sono anche palesi. Anche presi singolarmente non sono niente male, i due champ sono indipendenti tra loro. Non so come tu faccia a dire che non ce l'abbiano una peculiarità, devi averli proprio evitati del tutto o ignorati fino adesso. E Aurelion non mi piace, il suo kit non è nemmeno originale (chi gioca a DotA sa di cosa parlo).","replies":[{"poster":"Vileblood Pyke","date":"2017-04-26T17:26:01.360+0000","up_votes":2,"down_votes":0,"body":"Stava andando tutto bene, poi...\n> [{quoted}](name=IllidanS1,realm=EUW,application-id=MJVj50Jw,discussion-id=h1oj0jWM,comment-id=000000000000000100010000,timestamp=2017-04-26T17:14:43.074+0000)\n>\n>E Aurelion non mi piace, il suo kit non è nemmeno originale (chi gioca a DotA sa di cosa parlo).\n\nhttps://i.giphy.com/2WxWfiavndgcM.gif","replies":[{"poster":"Pulastér","date":"2017-04-26T17:32:05.466+0000","up_votes":1,"down_votes":0,"body":"Non ci posso far nulla, ammetto che il drago cosmico ha il suo fascino e che abbia una skin col richiamo più figo dell'universo, ma non mi attira nel volerlo giocare. D:","replies":[]}]},{"poster":"JoyBoy39","date":"2017-04-26T17:52:38.557+0000","up_votes":1,"down_votes":0,"body":"E Aurelion non mi piace\n\nMALE","replies":[{"poster":"Pulastér","date":"2017-04-26T18:35:17.673+0000","up_votes":1,"down_votes":0,"body":":c","replies":[]}]}]}]},{"poster":"DonCavallo","date":"2017-04-26T15:14:32.012+0000","up_votes":1,"down_votes":2,"body":"Ottima analisi. Solo che, se noti, a parte Jhin e Braum e altri da te citati, spesso i champion nuovi sono bei flop.\nPensa ad Aurelion, Camille, Kled. Non li vedo quasi mai in giro.\nI personaggi \"cacati bene\", invece rimangono li dove stanno. Yasuo è amato almeno quanto odiato (e funziona uguale), Zed lo ritengo il champion uscito meglio del gioco e così via.\nForse stanno solo trovandosi una nicchia","replies":[{"poster":"HaIIeIujah","date":"2017-04-26T15:42:09.358+0000","up_votes":2,"down_votes":0,"body":"> Pensa ad Aurelion, Camille, Kled. Non li vedo quasi mai in giro.\n\nSol e Camille sono stati spammati violentemente fino ai nerf. Kled è perfettamente giocabile anche a livello competitivo ed è stato pickato ripetutamente nei vari formati competitivi.","replies":[{"poster":"DonCavallo","date":"2017-04-26T16:34:40.274+0000","up_votes":1,"down_votes":3,"body":"Camille non la vedo in game da un mese, Sol da quando è uscito l'avrò visto forse 20 volte (contando gli aram). Kled lo maina un mio amico, ma a parte lui solo aram.\nL'ambiente competitivo non conta, perchè sono due gatti","replies":[]}]}]}]},{"poster":"DonCavallo","date":"2017-04-25T21:31:45.521+0000","up_votes":2,"down_votes":3,"body":"Hanno visto che gli ultimi champ venivano giocati solo la prima settimana e hanno dovuto buttare fanservice in faccia. Un pò li capisco.","replies":[]}]}]}]},{"poster":"ChaosJuda","date":"2017-04-26T21:23:42.918+0000","up_votes":1,"down_votes":1,"body":"Aurelion a me piace molto, peccato che non gli abbiano dato un kit all'altezza, come concept potevano fare mille cose, insomma, è un drago che forgia delle stelle, ci potresti sviluppare chissà quante cose, non una lucertola con tre palle che gli girano intorno.","replies":[{"poster":"DANJERpuntoEXE","date":"2017-04-27T07:58:53.318+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lines Seta Ultra,realm=EUW,application-id=MJVj50Jw,discussion-id=h1oj0jWM,comment-id=0005,timestamp=2017-04-26T21:23:42.918+0000)\n>\n> Aurelion a me piace molto, peccato che non gli abbiano dato un kit all&#x27;altezza, come concept potevano fare mille cose, insomma, è un drago che forgia delle stelle, ci potresti sviluppare chissà quante cose, non una lucertola con tre palle che gli girano intorno.\n\nEcco perché Aurelion è perennemente nervoso. Gli girano sempre.","replies":[]}]},{"poster":"Giorgio di villa","date":"2017-04-25T21:52:30.590+0000","up_votes":1,"down_votes":0,"body":"A mio parere se avessero approfondito in maniera decente le lore su xayah e rakan non sarebbero stati poi così male loro due\n\nIn quanto alle altre lore devo dire che sembrano tutte ben fatte\nNami si collega a Diana\nE mi piace che abbiano approfondito meglio l'amicizia di master yi e wukong \nSi è vero che rappresentano lo stereotipato duo _amico serio e responsabile e amico impulsivo e scherzoso_ ma è una scelta che funziona sempre","replies":[]},{"poster":"edoxbox1","date":"2017-04-25T21:50:29.766+0000","up_votes":1,"down_votes":0,"body":"Concordo sul creare una sezione per le Lore :V\nRITO PLZ","replies":[]},{"poster":"Vileblood Pyke","date":"2017-04-25T20:22:08.591+0000","up_votes":1,"down_votes":0,"body":"Mi diletto veemente con l'ausilio di entrambe le mani alla vista di quella specie di albero genealogico.","replies":[]}]}