{"poster":"SickAnto","date":"2019-09-03T07:44:17.312+0000","title":"Pantheon mi piace.","subforum":"Campioni e gameplay","up_votes":2,"down_votes":1,"body":"Nulla, a me sta piacendo questo rework, lo considero free elo onestamente dato che la gente non sa schivare. Peccato per il doppiaggio, quella italiana non è granché e mi pare forzata.\r\n\r\nComunque sia se avete pareri riguardo al campione, build, rune ecc. potete benissimo esprimervi.\r\n\r\n(Sì, sono \"tornato\" in un momento dove il forum ha passato brutti tempi e che sembra non riuscire a superare ma non è l'obiettivo di questo post farne polemica.)","replies":[{"poster":"Mystogan92","date":"2019-09-03T08:43:23.773+0000","up_votes":2,"down_votes":0,"body":"https://www.youtube.com/watch?v=BcJ_Dedma00&amp;t=","replies":[{"poster":"SickAnto","date":"2019-09-03T09:20:46.566+0000","up_votes":1,"down_votes":0,"body":"L'ho visto, bellissimo.","replies":[]}]},{"poster":"Skaarlet Kled","date":"2019-09-03T08:20:17.154+0000","up_votes":2,"down_votes":1,"body":"Fammi capire una cosa, la tua valutazione sulla riuscita (o sul fallimento) di un lavoro di rework si basa sul fatto che sia free elo oppure no?","replies":[{"poster":"SickAnto","date":"2019-09-03T09:16:57.897+0000","up_votes":1,"down_votes":0,"body":"Ovvio che no, è un mio parere a riguardo il suo potenziale. Sono di elo basso e non credo di essere in grado di giudicare un campione in base alla meccanica o altro in termini di gameplay. Lo reputo divertente, posso dire questo.\n\nInvece per estetica, Lore, caratterizzazione e altre cose simili penso sia molto interessante e mi piace molto rispetto al *defunto* Pantheon.","replies":[]}]},{"poster":"C0RTES","date":"2019-09-04T00:30:49.149+0000","up_votes":1,"down_votes":0,"body":"A basso elo worka tutto e sembra forte perché I nemici perlopiù non sanno schivare, ma a livello competitivo è diventato molto debole, anche molti main pantheon hanno abbandonato il champ o addirittura il gioco, anche il miglior giocatore di panth lo gioca solo support più che mid o top, perché scala malissimo in late e non avrebbe danni, mentre andando supp buildando un po’ di tank ha ancora i danni necessari per uccidere l’adc, che è potenzialmente l’unico nemico che può riuscire a portare al di sotto del 25% di vita per crittarlo di Q in un trade solo","replies":[{"poster":"Skaarlet Kled","date":"2019-09-04T08:44:22.295+0000","up_votes":1,"down_votes":0,"body":"Abbandonare un gioco perchè il rework del tuo campione preferito non ti piace (che poi raga qua si sta parlando di Pantheon, solo io mi chiedo come si potesse essere OTP di un campione così noioso come quello pre-rework?) mi sembra una cosa poco sensata.\n\nSoprattutto per un gioco come lol, in cui il solo decidere di cambiare ruolo significa giocare ad un gioco completamente diverso (campioni diversi, warding diverso, meccaniche diverse).. Quindi, peggio per loro","replies":[]}]},{"poster":"vondarck","date":"2019-09-03T16:42:32.597+0000","up_votes":1,"down_votes":0,"body":"gameplay: un ottimo rework non troppo invasivo che aggiorna il kit del guerriero spartano, facendolo giocare un po più alla pari con tutti i ninjia/trottole/yassouspammomastery7mentretrololsuiminion che ci sono attualmente nella mappa (la E era piantato a terra LOLOLOL)\na differenza di BBtrox penso che a chi piaceva prima difficilmente possa non piacere ora (magari ci sarà qualche correzione in futura)\n\nstile: la riot ha usato i canoni di bellezza dei socialmedia 2k19 come istagram e FB venendo fuori un guerriero \"moikano\" tipico delle MMA (vitor belfort o Chuck Liddell tra tutti) o per chi non fosse ferrato della UFC un \"Yuri Boyka\" nel film UNDESPUTED.\nha aggiunto un altro particolare che non mi entusiasma, la barba da hypster/modello fashion tipica dei \"vichinghi di istagram\" e leonida di 300 con l'orecchino e i tatuaggi WTF\n\n\"spezzo una lancia\" (scusate il gioco di parole) nel confronto della sua armatura e del suo nuovo elmo\n\nmi sarei aspettato un corpo muscoloso \"definito e martoriato\" dalle cicatrici dei combattimenti, insanguinato e \"vuoto emotivamente\" con un anima consumata dalle infinite carneficine che ha compiuto nella sua vita\nVolevo vedere \"gli occhi della tigre\" e invece vedo un influencer che quando fa il recall è in posa per un selfi con la ferragni sulla rupe dei re (esce in concomitanza con il re leone)\n\nconcettualmente mi avvicinerei di più a questa splash art trovata su internet:\n\nhttp://lol.fureur.org/sites/default/files/media/image/tumblr_vicelishigh.jpg\n\npersonalmente a livello estetico sono \"deluso\", lo metto però tra parentesi perchè sono un adulatore dell'estetica malata di bloodborne che non è per tutti, quindi come dice il mio concittadino stefano benni \"siate maggioranza\"\n\naudio e doppiaggio:\n\"hanno il privilegio di morire ad i miei piedi!\" dio quanto mi manca..\nle nuovi frasi non mi piacciono in generale e il vecchio doppiaggio personalmente aveva una voce più azzeccata per il mio ideale di pant..\n\nmy 2 cent","replies":[]},{"poster":"TheViceroys","date":"2019-09-03T08:58:38.265+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SickAnto,realm=EUW,application-id=cAOZwaUi,discussion-id=ewXh3ges,comment-id=,timestamp=2019-09-03T07:44:17.312+0000)\n>\n> Comunque sia se avete pareri riguardo al campione, build, rune ecc. potete benissimo esprimervi.\n\nIn URF è abbastanza debole purtroppo, ma meglio così, più facile shottarlo suon di W di kai'sa full AP\nComunque pure io apprezzo abbastanza il rework che hanno fatto :3\n{{sticker:slayer-pantheon-popcorn}}","replies":[{"poster":"SickAnto","date":"2019-09-03T09:20:21.157+0000","up_votes":1,"down_votes":0,"body":"Dicono sia debole anche normalmente, a me non pare. Cioè, è sempre stato un champ da early e adesso la gente si lamenta se dopo fa schifo. Secondo me adesso è migliorato rispetto al vecchio anche se devi avere un po' di skill per giocarlo bene.","replies":[{"poster":"Dr LouD","date":"2019-09-03T14:24:02.288+0000","up_votes":1,"down_votes":0,"body":"L'execute della Q è forte in qualsiasi momento del game, oltre al fatto che può stunnare a target e tankare diversi secondi con la E, cosa non da poco per un champ che builda esclusivamente danni.\n\nCala di molto in late game, ma non così tragicamente se si sa sfruttare i suoi punti di forza","replies":[]}]},{"poster":"Killer SurpRyze","date":"2019-09-03T10:58:56.883+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=TheViceroys,realm=EUW,application-id=cAOZwaUi,discussion-id=ewXh3ges,comment-id=0002,timestamp=2019-09-03T08:58:38.265+0000)\n>\n> In URF è abbastanza debole purtroppo, ma meglio così, più facile shottarlo suon di W di kai'sa full AP\n> Comunque pure io apprezzo abbastanza il rework che hanno fatto :3\n> {{sticker:slayer-pantheon-popcorn}}\n\nIn URF? Perché, la ritirano fuori?","replies":[{"poster":"TheViceroys","date":"2019-09-03T11:02:29.302+0000","up_votes":1,"down_votes":0,"body":"E' nel PBE, pensavo aveste letto le patch notes su surrenderat20\n{{sticker:slayer-jinx-catface}} ","replies":[{"poster":"Killer SurpRyze","date":"2019-09-03T12:15:30.067+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=TheViceroys,realm=EUW,application-id=cAOZwaUi,discussion-id=ewXh3ges,comment-id=000200010000,timestamp=2019-09-03T11:02:29.302+0000)\n>\n> E' nel PBE, pensavo aveste letto le patch notes su surrenderat20\n> {{sticker:slayer-jinx-catface}}\n\nno, non mi tengo molto informato. Se è sul PBE, immagino arriverà tra una o due patch.","replies":[]}]}]}]},{"poster":"AebelothAngel","date":"2019-09-03T15:01:51.972+0000","up_votes":1,"down_votes":1,"body":"E allora sposatelo.","replies":[]}]}