{"poster":"Rena","date":"2017-05-22T20:34:50.109+0000","title":"♦ Aus Bronze, Silber und Gold rauskommen 10 Tipps ♦","subforum":"Allgemeiner Chat","up_votes":46,"down_votes":3,"body":"Ich sehe hier auf den Foren oft Spieler, die fragen, wie man aus Bronze, Silber oder Gold rauskommt. Viele glauben, dass es nur Glückssache ist. Laut OP.GG sind 92% aller Ranked-Spieler Bronze, Silber oder Gold. Darum gehe ich davon aus, dass die meisten, die diesen Post lesen, ebenfalls in diesem Bereich spielen. \nDa Season 7 nun zur Hälfte vorbei ist und viele Spieler ein Ziel  haben, welches sie bis Ende der Season erreichen wollen, dachte ich mir, ich mache einen Post, in dem ich euch Tipps zum Aufsteigen gebe. Diese Tipps sind sehr simpel. Dennoch stelle ich oft fest, dass Bronze-, Silber- oder Gold-Spieler diese gar nicht beachten. Ich hoffe, diese Tipps werden euch helfen, euer Ziel \"besser\" zu erreichen :D\n\n**Gute Runenseiten, Meisterschaftsseiten und Itembuilds**\nWenn ihr auf Blitzcrank Fervor of Battle mitnehmt, tut ihr euch und eurem Team keinen Gefallen. Seid euch bewusst, dass eure Itembuilds viellecht nicht die besten sind und es deutlich bessere gibt. Schaut euch an, was bessere Spieler auf die Champions nehmen. OP.GG ist eine sehr anfängerfreundliche Seite, auf der ihr beliebte Builds etc. auf einzelnen Champions, Matchups, Statistiken und mehr seht.\n\n**Eure Lanes**\nSeit Season 6 ist es möglich, zwei Positionen auszuwählen, welche man zu 90% kriegt (abgesehen von Autofill). Viele Spieler, die ich kenne, spielen nur eine Position, wie z.B. Top, und haben dort eine Winrate von 70%. Wenn ihr aber auf eurer zweiten Position eine allzu tiefe Winrate von beispielsweise nur 10% habt, werdet ihr nicht aufsteigen. Darum gebe ich euch den Rat: Wenn ihr nur eine Position spielt, lernt entweder eine Nebenrolle oder dodged, wenn ihr eure zweite Position kriegt. Ihr verliert nur 3LP aber eure MMR bleibt die gleiche. Ebenfalls ist es keine gute Idee, eure Positionen ständig zu wechseln, da ihr so nur mehr Positionen lernen müsst (in Rankeds wohlgemerkt, in Normals ist das natürlich egal). Ich persönlich habe Jungle/Top als Rollen (in Soloqueue), wobei ich meistens Jungle spiele.\n\n**Einen Guten Championpool haben**\nDer wohl beste Tipp zum Aufsteigen ist, nur noch eure besten Champions zu spielen, also die, die ihr richtig gut könnt. Ein Freund von mir hat in dieser Season etwa 400 Ranglisten-Spiele gespielt mit etwa 100 verschiedenen Champions in Silber. Ihr könnt euch ja selber denken, was besser ist: Eure Zeit darin zu inverstieren, wenige Champions richtig gut zu lernen oder 100 Champions zu spielen, die ihr in 400 Games niemals auch nur halbwegs lernen könnt. Ich empfehle euch, auf eurer Mainrolle 1-5 Champions zu spielen und auf eurer Nebenrolle 1-3. Mindestens einen Support spielen zu können ist auch gut (wegen Autofill), ausser ihr seid sowieso Support main. Ich persönlich spiele auf meiner Mainrolle (Jungle) Shaco, Lee Sin und auf meiner Nebenrolle (Toplane) Riven, Yasuo und mein Support (wenn ich autofilled werde oder ich hohen Ping habe) ist Janna.\n\n**Als Supporter bzw passiver Champion aufsteigen**\nIch kenne eine Janna main, die mir oft sagt, als Support bzw. als Janna sei es unmöglich, aus Silber rauszukommen, weil man keinen grossen Einfluss hat. Ihr könnt viellecht als Janna nicht 1v9 carrien (im Gegensatz zu Riven oder Yasuo), andererseits könnt ihr als Janna ein Spiel auch nicht alleine verlieren, was als Riven oder Yasuo durchaus möglich ist. Schliesslich gleicht es sich aus und jeder landet dort wo er hingehört. Ein Janna-Spieler braucht dafür einfach etwas mehr Zeit, da er nicht von 60 Spielen 50 gewinnen kann wie ein Rivenmain Smurf.\n\n**Feststecken bzw. nicht rauskommen**\nWenn man nach 200 Spielen noch in derselben Elo ist wie davor, ist man halt in der Elo, in die man gehört. Viele werden demotiviert weil sie sehen, dass sie nicht aus Silber rauskommen. 92% der Spieler sind nicht höher als Gold, also seid ihr nicht schlecht. **Silber ist keine schlechte Elo**. Auch wenn viele Streamer sagen, dass z.B. Diamant 5 sogar low Elo ist. Wenn ihr Bronze-Gold seid, seid ihr einfach **durchschnittlich**. Nichts wofür man sich schämen muss. Die Durchschnittlichen sind oft Spieler, die nicht soviel Zeit und Effort ins Spiel investieren. Schon klar ist jemand, der berufstätig ist und nur eine Stunde pro Tag spielt, kein Challenger-Spieler, er ist durchschnittlich. Wenn ihr also besser werden wollt, müsst ihr das aktiv angehen. Wenn ihr euch nicht aktiv verbessern wollt oder nicht einseht, dass ihr der Grund seid, könnt ihr 2000 Ranked-Spiele spielen und immer noch in Silber feststecken. Wer denkt, er ist wegen seiner Teammates Silber, bleibt auch nach 2000 Spielen Silber. \n\n**Sich verbessern**\nEs gibt viele Wege sich zu verbessern und ich kann diese unmöglich alle aufzählen; hier einige der besten:\n\n* Schaut High Elo Streams und achtet darauf, was der Streamer anders macht als ihr. Schaut nicht nur die ersten 10 Minuten der Laningphase, schaut das ganze Spiel, denn mid-late game Rotationen sind auch wichtig.\n* Lernt aus euren Fehlern. Jeder eurer Tode ist ein Fehler, den ihr verbessern könnt.\n* Lest Championguides. Viele Championguides im Internet sind sehr gut geschrieben und sagen euch, wie ihr euren Champion gut spielen könnt. Kopiert nicht nur das Build etc. sondern lest alles durch.\n* Trainiert im Sandboxmode.\n\n**Quality over Quantity**\nDie meisten von euch werden täglich Ranked-Spiele spielen und nicht viel über jedes Spiel nachdenken bzw. die einzelnen Spiele nicht sehr ernst nehmen. Nur durch häufiges Spielen allein werdet ihr nicht besser. Ihr müsst euch (wie im Punkt oben beschrieben) aktiv verbessern. Wenn ihr 1000 Games in einer Season spielt und immer noch die gleiche Elo seid,  habt ihr euch nicht verbessert. Spielt weniger Rankeds und versucht stattdessen, aus jedem einzelnen Spiel etwas zu lernen. So spart ihr Zeit und Frust. Ihr könnt mit 60W und 40L in 100 Spielen mehr Fortschritte machen, als mit 500W und 500L in 1000 Spielen. Ihr solltet auch nicht spielen wenn ihr müde, hungrig, abgelenkt oder getiltet seid. Macht eine Pause. Spielt wenn ihr Zeit und Energie habt.\n\n**Elo Hell und Teammates**\nViele beschweren sich, sie könnten wegen ihrer Teammates nicht aufsteigen. Ich habe vorhin schon erklärt, warum man in einer Elo stuck sein kann, aber viele begründen dies halt  damit, dass ihre Teammates so schlecht seien und sie nicht carrien könnten.\nIn League of Legends regt sich jeder hin und wieder über seine Teammates auf. Auch Challenger Streamer können davon berichten, wie geboosted ihre Teammates doch sind. Wenn man also Teammates als Grund für die Elo Hell nimmt, dann existiert diese auf jeder Elo bis Challenger. Jeder hat mal schlechte Teammates genau so wie jeder mal ein schlechtes Spiel hat. Merkt euch einfach: Egal wie sehr ihr eure Teammates hasst, **ihr könnt eure Teammates nicht verändern ihr könnt euch nur selbst ändern** und selbst verbessern. Schliesslich landet jeder da, wo er hingehört.\n\n**Frust**\nFrust ist ein guter letzer Punkt. League of Legends ist ein sehr frustrierendes Spiel, da man in einem Teamspiel nicht immer genug Einfluss hat um zu gewinnen. Verlieren gehört auch dazu und man sollte sich davon nicht zu sehr runterziehen lassen. Als ich Platin 3 war, habe ich meine Platin 2 Promo 12 einmal veloren. Sowas frustriert natürlich jeden. Wichtig ist aber daraus zu Lernen und zu versuchen besser zu werden. Als ich dann endlich Platin 2 erreicht hatte, ging es nicht einmal eine Woche und ich hatte Diamant erreicht. \n\nVergesst nicht den wichtigsten Tipp: **Habt Spass! :D**\n\nIch hoffe, ich konnte euch helfen :D - hat echt lange gedauert, all das zu schreiben ^^'\nWenn ihr Fragen oder Anmerkungen habt, könnt ihr mir gerne hier schreiben oder mich auf EUW unter dem Namen \"Rena\" adden.\nUnd wenn ihr wieder irgendjemanden seht, der sich über Ranked beschwert, dann schickt ihm einfach diesen Thread ^^.","replies":[{"poster":"Homunculi","date":"2017-05-23T07:00:53.346+0000","up_votes":5,"down_votes":0,"body":"schön geschrieben, danke für die Mühe :).","replies":[{"poster":"Rena","date":"2017-05-23T10:20:15.797+0000","up_votes":1,"down_votes":0,"body":"Danke fürs lesen :D","replies":[{"poster":"Sky4Riven","date":"2017-05-23T12:27:23.485+0000","up_votes":1,"down_votes":0,"body":"Ich vertrete deine Thread vollkommen, nice one :P","replies":[]}]}]},{"poster":"sN00Bdogg","date":"2017-05-23T10:15:41.244+0000","up_votes":3,"down_votes":1,"body":">Schaut High Elo Streams und achtet darauf, was der Streamer anders macht als ihr. Schaut nicht nur die ersten 10 Minuten der Laningphase, schaut das >ganze Spiel, denn mid-late game Rotationen sind auch wichtig.\n>\n\nDer Tipp ist zwar gut gemeint, führt aber in der Bronx nur dazu, daß Spieler Champs picken, die sie nicht handeln können oder nen Build bauen, der eben nur funzt, wenn man nach 20 Min 200 Farm hat. Sind es dann aber nur 70 CS hat man einen \"schwierigen\" Champion am Start, mit dem man dauernd die Skillshots vermasselt und falls man trotzdem mal trifft, dann macht man keinen Schaden.\nAuch was die Laufwege und Rotationen betrifft ist der Tipp (zumindest für \"meine\" Bronze-Elo) ein zweischneidiges Schwert. Denn wenn man weiss wie es richtig sein sollte, dann holt man sich nur nen Frust, wenn die anderen nicht mit-rotieren oder eben jeden Drake-Call etc einfach ignorieren. \n\nFür Bronze Spieler hab ich noch drei Tipps, die auf deiner Liste stehen sollten:\n\n**1) Spiele Rankeds nur im Duo und mit Teamspeak. **\nDas verhindert das tilten und AFK gehen, weil da einer ist, dem man das nicht antun will bzw. der einen wieder aufbauen kann. \n\n**2) Spiele keine Off-Meta-Picks**\nEs gibt Gründe, warum Champions wie z.B. Nasus oder Dr. Mundo  nicht als Supporter geführt werden. \nIch erlebe es leider zu oft, daß wegen LCS Vorbildern \"falsche\" Champions gepickt werden.\nVor allem die vielen Autofill-Supporter, die dann mit Sion oder Jhin supporten. Und das mit Random Partnern und ohne TS-Absprache. Ist doch klar, daß das schief geht. Im Mid/Lategame ist man mangels Farm dann ein Tank ohne Rüstungsitems oder ein ADC ohne Waffen. Das macht erstens kein Spass und zweitens besteht die Gefahr, daß die Mitspieler tilten sobald es anfängt schlecht zu laufen.\n\n**3) Wenn Du getilted bist, dann spiel ne Runde Teemo**\nTeemo ist chillig und bringt die gute Laune zurück. Teemo kann auf allen Lanes gespielt werden und wenn dich deine Mates mal böse anschauen, dann werde einfach unsichtbar ^^","replies":[{"poster":"Rena","date":"2017-05-23T10:31:22.673+0000","up_votes":4,"down_votes":0,"body":"Ich versuche dich mit meiner Antwort nicht zu triggern ok? ;-;\nIn Bronze 5 kannst du so ziemlich jedes Spiel 1v9 gewinnen, da Leute dort das Spiel noch nicht verstehen (nicht böse gemeint, ich war in Season 3 auch Bronze 5)\nIch bin gerade in dieser Elo sehr davon überzeugt, dass Streams schauen der beste weg zur Besserung ist, da die Spieler dort oft ein komplett anderes Spiel spielen als der Rest der Community. \nIch mache ein kleines Beispiel: Ein Bronze Riven-Spieler gewinnt die Lane mit einem 3-0 Lead und hat 50 CS mehr. Wenn man erfahren genug ist, wird man ein Spiel in diesem Bereich mit so einem Lead **niemals** verlieren. Lanen kann Jeder einigermassen, aber wie in meinem Tipp erwähnt, sind mid-late game Rotationen auch wichtig wenn nicht sogar viel wichtiger. Durch das schauen von Streams lernt man all dies und natürlich auch wie erfahrene Spieler eine Lane spielen.\n\nIch meine nichts davon irgendwie \"Herabwertend\" oder so. Ich war in Season 3 auch Bronze 5 und damals dachte ich, ich gehöre mindistens Silber. Als ich dann aber Silber war habe ich gemerkt, dass ich viel besser geworden bin und nicht mehr die selben Fehler mache wie damals :x\n\nPS: Bitte keinen Hate wegen meiner Grammatik (gerade erst aufgestanden ^^)","replies":[]},{"poster":"Valinn Laurent","date":"2017-05-23T16:12:58.789+0000","up_votes":2,"down_votes":0,"body":"Punkt 2 würde ich auch nicht zustimmen, weil in Bronze kann man alles spielen und kommst damit raus und es bringt dir auch nix Meta Champs zu spielen die du nicht kannst.","replies":[]}]},{"poster":"Ihiro ","date":"2017-08-02T19:17:01.272+0000","up_votes":3,"down_votes":0,"body":"Ich selbst stecke in Bronze fest. Durch deine Beschreibung kann ich viel rausnehmen.Ich selbst habe 6 Promos in Folge verloren und habe mir überlegt mit LoL aufzuhören bis ich angefangen habe Guides zu schauen und nach Tipps gesucht habe aus Bronze rauszukommen und konnte aus diesem Beitrag viel mitnehmen.\n\nAn dieser Stelle ein Dankeschön aus meiner Sicht .","replies":[]},{"poster":"Eibert Rümmel","date":"2017-05-23T15:13:36.304+0000","up_votes":3,"down_votes":0,"body":"und für alle denen der Text zu lang war hier die Kurzfassung: Spielt Teemo! Teemo gewinnt immer. Der TE hat Recht, denn Teemo ist OP","replies":[{"poster":"Maexle","date":"2017-05-23T15:31:06.589+0000","up_votes":3,"down_votes":0,"body":"Teemo kann nämlich Spiele alleine gewinnen und sie nicht alleine verlieren :P\n{{champion:17}}","replies":[]}]},{"poster":"S10 Master ADC","date":"2018-05-16T21:19:35.479+0000","up_votes":2,"down_votes":0,"body":"Kommst echt sympathisch rüber\nhoffe es gibt bald mehr leute als dich, die ganz entspannt spielen und durch eigene fehler aktiv lernen","replies":[]},{"poster":"Optik","date":"2017-05-23T13:02:56.524+0000","up_votes":2,"down_votes":0,"body":"Servus,\n\nhier auch meine 50cents zu dem Thema: Ich finder der Threadersteller trifft das ganze schon gut auf den Punkt. Ich ertappe mich auch selber ab und zu dass ich mal im Chat rage was zur folge hat, dass der Feeder dann noch afk geht und das Game entgültig vorbei ist. --> doofe Attitüde an der ich also noch mehr arbeiten muss um es nicht mehr zu machen.\n\nZu meiner persönlichen Season: ich habe nach ner langen Pause wieder LoL angefangen und die 10 Qualispiele komplett in den Sand gesetzt. --->Bronze 5  oder 4  gelandet.  Mittlerweile habe ich mich nach ca 110 Wins nach Silber 2 vorgearbeitet.  \n\nIch spiele Jungle als Main und habe dort einfach aufgehört irgendwelche \"superduperhardcorecarry\" Champs zu spielen sondern langweilige Support/Tanks  wie Amumu oder Sejuani. \n\nDamit fahr ich mittlerweile recht gut und denke auch dass ich noch bis in Gold kommen kann bis Ende der Season.\n\nAlso mein Tipp neben den ganzen guten :  Schaut was das Team braucht! Fehlt ein Tank weil Top lane mal wieder Riven spielt und Midlane unbedingt den Zed haben muss ---> nehmt nen Tank  das Team wirds euch danken!\n\nlg Optik","replies":[]},{"poster":"Oriius","date":"2017-05-23T08:39:14.349+0000","up_votes":2,"down_votes":4,"body":"Hab bisher die Erfahrung gemacht das man nur mit Duo einigermaßen weiterkommt xd SoloQ ist die hölle entweder jede 2. Runde nen afk oder 200+ Ping player :/ \n\nGrundsätzlich würde ich gerne glauben und zwar wirklich sehr gerne das Teammates nicht schuld sein können das man irgendwo feststeckt und prinzipiell ist es auch so ... aber ich weiß nicht was man für ein gutes gegenargument bringen kann das man wirklich alle 2-3 Runden nen afk im team hat ... einige gehen bewusst sogar erst ne runde feeden bevor sie afk gehen damit das /remake nicht greift ......\n\n\nDa das report system leider fürn mülleimer ist werde ich bis sich da was getan hat auch keine rankeds mehr spielen xd","replies":[{"poster":"Rena","date":"2017-05-23T10:10:23.221+0000","up_votes":2,"down_votes":0,"body":"Wenn jede 2. Runde Jemand afk ist, ist das ja ein Vorteil für dich.\nIn deinem team können 4 Leute afk gehen und im Gegnerischen 5. Genau das Gleiche mit Trolls, Feedern etc. Der Zufallsfaktor ist immer auf deiner Seite :D","replies":[]},{"poster":"Valinn Laurent","date":"2017-05-23T16:19:17.667+0000","up_votes":2,"down_votes":0,"body":"Jede 2. Runde glaube ich dir auch nun wirklich nicht. Und nein Teammates sind niemals Schuld. Gewöhn dir ab dies zu sagen und fang an die Fehler bei dir selber zu suchen. Dann wirst du auch climben. Ich spreche aus Erfahrung. Und auch wenn jemand Afk ist kannst du gewinnen. Ich persönlich gewinne die Games wo jemand Afk geht sogar sehr oft und auch ich bin nur Silber bzw letzte Season Gold aber Gold ist nix besseres.","replies":[]}]},{"poster":"Mett Meex","date":"2020-02-28T18:25:09.739+0000","up_votes":1,"down_votes":0,"body":"\"Wenn man nach 200 Spielen noch in derselben Elo ist wie davor, ist man halt in der Elo, in die man gehört.\"\n\nGrandioser Bullshit. Wer erstmal durch Umstände in Eisen IV gelandet ist, hat Mates voll von Trolls, Smurfs, Idioten und schlechten Spielern. Jedes gefühlte 10. Spiel ist mal etwas besser, aber Aufsteigen/Climben unmöglich. \n\nHÖRT nicht darauf was Player erzählen die easy wins holen, denn sie wissen nichts Besseres zu sagen. Selbst wenn Ihr Eisen4 seid und bis zum Ende der Saison, merkt Euch was Ihr gut gemacht habt und reflektiert Eure Fehler. Dann ist die nächste Saison Elo Climb fähig.\n\nPs.: Für 99% der Guten Spieler in Eisen, die schlichtweg keine eigenen Mates haben zu climben, sei gesagt, das liegt nicht (nur) an Euch!\n\nBleibt dran! Schaut Euch Eure Spiele an und verbessert Euch.","replies":[{"poster":"Rena","date":"2020-02-28T21:20:23.089+0000","up_votes":1,"down_votes":0,"body":"\"Bleibt dran! Schaut Euch Eure Spiele an und verbessert Euch.\"\n\nIch sag doch genau das gleiche unter dem Punkt: *Sich verbessern!*?\n\nJa ich denke diese Coinflip Mentality bringt niemandem was.\nDa stehe ich heute noch dazu.","replies":[]}]},{"poster":"Kanecht","date":"2018-03-20T18:23:31.456+0000","up_votes":1,"down_votes":0,"body":"Moin \neine ganz dämliche Frage :D\n\nIch habe lol nach 4 Jahren Abstinentz entstaubt und versuche mich gerade im Ranked hochzuarbeiten.\nhabe vorher noch nie ranked gespielt und wundere mich jetzt wieso ich in Silber 1 gegen/mit Spieler aus Gold 3 oder Gold 4 spiele ?\n\nWozu hat man den die LIgen wenn ich eh gegen alles andere als meine Liga spiele ?\n\nthx für die antwort \n\ngg wp\n\nps. : Main Rolle Shaco ?? Wieso tust du dir das an haha \n        Jeder hassst Shaco ","replies":[{"poster":"Rena","date":"2018-03-20T18:31:07.921+0000","up_votes":1,"down_votes":0,"body":"Das bedeutet, dass deine MMR höher ist als dein jetziger rang. Wenn deine MMR höher ist bekommst du mehr Punkte wenn du gewinnst und verlierst weniger bei einer Niederlage. Macht ja auch sinn wenn du gegen höhere Gegner gewinnst.\nSowas ist nach der einstufung normal. Riot will nachdem du eingeteilt wirst, dass du erst mal viele Punkte kriegst bzw. aufsteigst.","replies":[{"poster":"HyperionCH","date":"2018-03-22T07:56:58.014+0000","up_votes":1,"down_votes":0,"body":"Nur etwas OT:\n\nKann es sein, dass du Schweizer bist und im Client in 3 Clubs bist? 🤔","replies":[{"poster":"Rena","date":"2018-03-23T17:47:59.632+0000","up_votes":1,"down_votes":0,"body":"ja lol woher weisst du das?","replies":[]},{"poster":"Kind Prow","date":"2018-03-23T13:43:34.027+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=HyperionCH,realm=EUW,application-id=YnZkMR0R,discussion-id=jYiHfvda,comment-id=001200000000,timestamp=2018-03-22T07:56:58.014+0000)\n>\n> Nur etwas OT:\n> \n> Kann es sein, dass du Schweizer bist und im Client in 3 Clubs bist? 🤔\n\nMeinst du mich?","replies":[]}]}]},{"poster":"Kind Prow","date":"2018-03-20T18:54:59.220+0000","up_votes":1,"down_votes":0,"body":"Die Ligen haben denn Sinn, deine Spielstärke vor anderen zu zeigen. Zumindest deine ungefähre. Spielst du gegen Gold, wirst du wahrscheinlich aufsteigen. Wenn du dann weder weiter aufsteigst, noch absteigst, wirst du vermutlich in genau deiner Elo angekommen sein.\n\nFöhnen Tag noch.","replies":[]}]},{"poster":"Uranbrennstab","date":"2017-05-23T05:40:12.121+0000","up_votes":1,"down_votes":3,"body":"Ich dachte Elo bzw die Divisionen sid dazu da zu ermitteln, wer der bessere Menschen ist. Warum sollte ich ein ranked starten mit dem Ziel Spaß zu haben?  Nur der Sieg am Ende zählt, alles andere ist verschwendete Lebenszeit.","replies":[{"poster":"Rena","date":"2017-05-23T10:07:54.723+0000","up_votes":1,"down_votes":0,"body":"Naja wofür will man in einem Spiel aufsteigen bzw gut werden wenn man keinen Spass daran hat?","replies":[{"poster":"Uranbrennstab","date":"2017-05-23T12:12:16.017+0000","up_votes":1,"down_votes":0,"body":"Gewinnen macht doch Spaß.","replies":[{"poster":"Allerbester Biss","date":"2017-05-24T10:28:34.031+0000","up_votes":1,"down_votes":0,"body":"Ich denk mir immer so\n\nImproven braucht ich nicht und mach ich auch nicht \n\nTrotzdem bin ich von Silber über Plat nach Dia gekommen\n\nHow is it possible?","replies":[{"poster":"Uranbrennstab","date":"2017-05-24T10:38:34.145+0000","up_votes":1,"down_votes":0,"body":"Improven kann man auch beim Gewinnen. Weiß nur wieder keiner.","replies":[{"poster":"Valinn Laurent","date":"2017-05-24T16:13:28.951+0000","up_votes":1,"down_votes":0,"body":"Improven kann man auch beim verlieren wenn man darüber nachdenkt was man für fehler gemacht hat.","replies":[{"poster":"Uranbrennstab","date":"2017-05-24T18:42:32.512+0000","up_votes":1,"down_votes":0,"body":"Hab ich nie bestritten, aber verlieren macht keinen Spaß.","replies":[]}]}]}]}]}]}]},{"poster":"three stodges","date":"2017-05-23T09:07:45.986+0000","up_votes":1,"down_votes":7,"body":"Vor 1 oder 2 Jahren hätte Ich gesagt deine Tips sind hilfreich, aber seit dieser Season sind Sie eher für die Tonne \nman versuche sich mal aus Bronze oder Silber zu spielen wenn man Permanent  gegen Spieler aus höheren Elos antreten zu muss.\n\nDas ganze \" Ranking \"ist wertlos geworden und hat mittlerweile für mich keine Aussagekraft mehr da haufenweise Spiele stattfinden\ndie mit fair Play nichts mehr zu tun haben.\n\nEs scheint wohl eine Menge Spieler zu geben die in ihrer Elo nicht mehr weiter kommen :D","replies":[{"poster":"Rena","date":"2017-05-23T10:17:06.892+0000","up_votes":3,"down_votes":1,"body":"Letzte Season war etwas speziell wegen dieser ganzen Dynamicqueue Geschichte. Ich hatte in Solo Queue (abgesehen von Flex Queue) noch nie unfaires Matchmaking. Wenn du permanent gegen höhere Elos antritts, wo ist dann der Unterschied? Diese Tipps funktionieren ja nicht nur wenn dein Gegner genau so gut ist wie du, versuch aus jedem Spiel zu lernen und schau was die Gegner besser machen als du bzw deine Mitspieler.\n \nIch finde das \"Ranking\" sehr aussagekräftig, sonst würden ja die ganzen Dia+ Spieler auch nicht weiterkommen in Silber oder?\nEs gibt sogar Eloboosting-Seiten die es Gold-spielern  erlaubt, Accounts von Bronze auf Silber zu boosten und das sagt viel aus.","replies":[{"poster":"three stodges","date":"2017-05-23T13:56:01.574+0000","up_votes":1,"down_votes":1,"body":"Wie willst du unfaires Matchmaking beurteilen ?\nDi weißt doch nicht ob im anderen Team ein high Elo Spieler auf ein Bronze oder Silber Acc spielt das merkst du dann frühstens im Spiel.\n\nWäre ja auch zum lachen wenn ein Diaspieler nicht aus Silber kommt selbst wenn er auf Gegner mit gleichen Skill trifft ist das ausgeglichen \nanders wenn Silber gegen Dia spielen muss.\n\nWenn Gold Spielern erlaubt ist Acc  von Bronze nach Silber zu boosten bestätigst du damit meine Aussage das das Ranking für die Tonne ist,\nvielleicht nicht für den der geboostet wird aber für den der sich nicht boosten lässt.\n\nSpieler mit Bronze oder Low Silber Skill VS Gold fair Play sieht anders aus.","replies":[{"poster":"Rena","date":"2017-05-23T23:17:47.422+0000","up_votes":1,"down_votes":0,"body":"Wenn in Silber wo 40% aller Ranked-Spieler sind, dass Matchmaking unfair ist, müsste dann nicht genau in Diamant wo es weniger Leute ha, das Matchmaking noch unfairer sein? Vorallem in Diamant 5 Wimmelt es von Smurfs.\n\nSmurfs sind so eine Sache. Manchmal kriegst du einen und manchmal der Gegner. Wenn ich z.B. gegen einen Challenger-Smurf spiele, schau ich immer genau was er macht um zu carrien. Also seh es als eine \"gute Übung\". Ich habe zwar keine Statistik dafür, aber ich bin mir sicher, dass in Bronze-Silber vergleichsweise weniger Smurfs sind, als in Diamant 5. Die meisten Smurfs haben nach ihren Placement-Spielen eine Gold-Platin MMR und soviele Booster in Bronze-Silber gibt es auch wieder nicht, sonst wären ja nicht 92% dort.\n\nInwiefern bestätige ich damit deine Aussage? Genau wenn es Gold-Spieler nicht schaffen könnten einen Account auf Silber zu spielen, wäre das Ranking für die Tonne. Da es aber möglich ist, sagt es viel über den Skillunterschied aus.\n\n\"Low Silber gegen Gold\" sowas ist nicht möglich jedes Spiel. Manchmal wird man vielleicht gegen Gold-Spieler gematch, genau so ist es aber auch andersrum. Manchmal spielt man gegen einen Smurf und manchmal mit einem.","replies":[{"poster":"three stodges","date":"2017-05-24T07:02:42.717+0000","up_votes":1,"down_votes":0,"body":"Ich sage nicht das das Matchmaking unfair ist, sondern das es ein Unterschied ist ob ein Gold Spieler auf ein Bronze acc spielt oder auf seinen main acc spielt.\n\nEs gibt ja nicht nur Smurfs auch Booster und acc Shearing.\n\nDen Unterschied der Spielstärke kann Ich nicht richtig beurteilen von Platin zu Diamant sind es vielleicht Nuancen \nwährend es von Bronze zu Gold wohl mehr sein wird.\n\nDu hast geschrieben :Es gibt sogar Eloboosting-Seiten die es Gold-spielern erlaubt, Accounts von Bronze auf Silber zu boosten und das sagt viel aus. Insofern bestätigst du das das Ranking in gewisser Art und Weise für die Tonne ist. ( Zumindest in Low Elo)\n\nMann stelle sich jetzt vor es würden plötzlich mehrere Tausend geboostete Acc von Bronze auf Platin auftauchen und dort spielen\ndas würde dich bestimmt auch ärgern weil einfach das Spielverständnis fehlt sowie Skill und Reaktion.\nDieses wird aber zu deinem Glück nie passieren auf ein Low acc hat man eben einfacher Zugriff.Auch das Ranking würde dann \nfür die Tonne sein auf einen längeren Zeitraum gesehen wenn gleichzeitig immer wieder neue geboostete acc auftauchen da sich die geboosteten nicht lange da halten werden können.\n\nIch habe prinzipiell nichts gegen deine Tips empfinde Sie halt nur nicht mehr als sonderlich hilfreich dennoch kann der eine oder andere sich daran orientieren.","replies":[{"poster":"Pure Cynicism","date":"2017-05-24T16:54:36.461+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=three stodges,realm=EUW,application-id=YnZkMR0R,discussion-id=jYiHfvda,comment-id=00060001000000010000,timestamp=2017-05-24T07:02:42.717+0000)\n>\n> Ich sage nicht das das Matchmaking unfair ist, sondern das es ein Unterschied ist ob ein Gold Spieler auf ein Bronze acc spielt oder auf seinen main acc spielt.\n> \n> Den Unterschied der Spielstärke kann Ich nicht richtig beurteilen von Platin zu Diamant sind es vielleicht Nuancen \n> während es von Bronze zu Gold wohl mehr sein wird.\n\nIch glaube, du überschätzt den Skill des durchschnittlichen Goldspielern massiv.","replies":[]},{"poster":"Valinn Laurent","date":"2017-05-24T16:18:31.377+0000","up_votes":1,"down_votes":0,"body":"Ich weiß ja nicht was du hast aber ich habe als Silber Spieler oft genug gegn Platin oder Diamond Spieler gewonnen und das weil ich das Game gecarried habe und kein anderer in meinem Team^^","replies":[]}]}]},{"poster":"Revilous","date":"2017-05-23T20:03:49.285+0000","up_votes":1,"down_votes":1,"body":"Es gibt in Bronze keine Smurfs! Jemand, der sich ein Smurfaccount erstellt, fängt mindestens in Silber an wobei die meisten in Gold1/Platin5 anfangen. Eventuell lässt sich jemand raus boosten aber ich glaube kaum, dass soviele Bronzespieler Geld für einen höheren Rang ausgeben.\n\nIn Bronze ist das aber so, dass die Spieler halt extrem schlecht sind. Und da kann es schonmal passieren, dass jemand 0/15 geht ohne es zu wollen. Dementsprechend ist dann auch ein Gegenspieler 15/0. Das ist dann aber kein Smurf, sondern nur jemand der extrem gefeedet wurde und dementsprechend jeden oneshottet aber das ist kein Zeugnis von Skill oder Mechanics sondern einfach nur von feeding.\n\nIch habe btw dein Profil ein bisschen gestalkt und in deinen letzten Spielen war niemand mit einer ansatzweise positiven Winrate oder guten KDAs, zudem waren alle Spieler maximal eine Divison unter oder über dir also redest du stuss und suchst nur nach einer Ausrede, warum du nach 500 Games in Bronze mit 48% winrate bist.!!!","replies":[{"poster":"three stodges","date":"2017-05-24T07:04:04.689+0000","up_votes":1,"down_votes":1,"body":"Nach dem Ich lass In Bronze gibt es keine Smurfs musste Ich aufhören zu lesen da kann der Rest nur Stuss sein.","replies":[]}]}]}]},{"poster":"Shadowscreen","date":"2017-05-23T09:17:58.009+0000","up_votes":1,"down_votes":0,"body":"Kann ich leider nicht bestätigen.\n\nAuch wenn ich auf meinem Main derzeit hardstuck Gold 2 bin, konnte ich auf meinem Smurf immernoch relativ leicht aufsteigen.\nAus Bronze 2-3 bis mittleres Silber bisher....mehr kann ich dazu noch nicht sagen.","replies":[{"poster":"Trıxıe","date":"2017-05-23T13:51:51.409+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=IES Shadowscreen,realm=EUW,application-id=YnZkMR0R,discussion-id=jYiHfvda,comment-id=00060000,timestamp=2017-05-23T09:17:58.009+0000)\n>\n> Kann ich leider nicht bestätigen.\n> \n> Auch wenn ich auf meinem Main derzeit hardstuck Gold 2 bin, konnte ich auf meinem Smurf immernoch relativ leicht aufsteigen.\n> Aus Bronze 2-3 bis mittleres Silber bisher....mehr kann ich dazu noch nicht sagen.\n\nUnd genau das ist das Problem das es smufs gibt wie solle die Jungs aus bronze raus kommen wenn sie da schon gegen Gold platin dia+ smufs antreten und von Scripten brauchen wir garnicht anfangen. Es gibt. Nur ein Weg findet einen guten premade der deutlich höher gerankt ist wie ihr, so geht die durchnitts mmr hoch und ihr bekommt auch eigentlich stärkere mattes aber auch Gegner aber sie können dann auch mehr gegen die smufs machen weil sie das spiel besser verstehen. Sprech aus eigener Erfahrung.","replies":[{"poster":"Valinn Laurent","date":"2017-05-24T16:20:05.115+0000","up_votes":1,"down_votes":0,"body":"Ich habe mich als gewöhnlicher Silber Spieler drei Seasons komplett alleine aus Bronze gespielt. Premades suchen bringt nix wenn der eigene Skill schlecht ist. Man muss manchmal einfach mal nur die Fehler bei sich selbst suchen und nicht dauernd bei anderen.","replies":[]}]},{"poster":"three stodges","date":"2017-05-23T13:29:26.215+0000","up_votes":1,"down_votes":1,"body":"Wenn du mit Gold 2 da unten nicht rauskommen würdest wärst du ja kein gold.\n\nSchon ein unterschied wenn man mit low silber skill gegen Spieler wie dich mit Gold skill antreten muss.\n\nWenn nur noch entscheidend ist welches Team die meisten smurfs im Team hat mit dem höchsten skill ist das auch für die Tonne.","replies":[]}]}]},{"poster":"Abasin","date":"2017-05-23T07:48:36.409+0000","up_votes":1,"down_votes":1,"body":"Das Problem an sich ist ja, dass jeder, der hochsteigt, alle anderen, an denen er vorbeizieht eine Stufe nach unten drückt. Und \"oben\" ist nun mal nicht ewig viel Platz.","replies":[{"poster":"Rena","date":"2017-05-23T23:21:00.571+0000","up_votes":1,"down_votes":0,"body":"Das Elo bzw Ligasystem ist nicht \"Ladder\" abhängig. Auch wenn es eine Ladder gibt, hat das Elosystem nicht viel damit zu tun. Theoretisch wäre es möglich, dass 20% in Bronze, 20% in Silber, 20% in Gold, 20% in Platin und 20% in Dia+ sind.","replies":[{"poster":"Abasin","date":"2017-05-24T08:37:37.387+0000","up_votes":1,"down_votes":0,"body":"Dem widerspreche ich ja nicht. Aber es kann nun mal nicht jeder Platin oder höher sein. Und wenn Du aus \"Wohlfühlgründen\" Bronze entfernen würdest, hättest Du einen Haufen mehr Silberspieler.\n\nAber das geht auch an der eigentlichen Frage vorbei. Wenn es jeder Bronzespieler mit diesen Tipps nach Gold schafft, kann man dann Bronze abschalten? Wohl nicht. Es gibt auch wieder genug Verlierer, es wird neu gemischt und es läuft letztlich darauf hinaus, dass auf elementarster Basis doch \"geladdert\" wird.","replies":[]}]}]},{"poster":"LOLpRoXis","date":"2017-05-23T12:39:01.138+0000","up_votes":1,"down_votes":0,"body":"Ich find du solltest auch sowas rein packen das der Dschungler ein guter Carry ist.\nWeil die meissten Lee sin in Bronze,Silber,Gold Schlecht sind und noch Lee sin einen nerf bekommen hat den ich gar nicht verstehen konnte.\nIch bin selber kein Lee Sin Main aber ihn zu nerfen fand ich nicht ganz so gut.","replies":[{"poster":"Rena","date":"2017-05-23T22:59:00.716+0000","up_votes":1,"down_votes":0,"body":"Lee sin war lange einer der stärksten Jungler neben Ivern. Persöhnlich bin ich froh, dass er generft wurde da ich Shaco maine ^^'","replies":[]}]},{"poster":"00 M4ddin 00","date":"2017-05-23T15:01:36.117+0000","up_votes":1,"down_votes":0,"body":"Hallo \n\nIch will mich jetzt auch mal zu wort melden :) \nHab heute auf arbeit den post hier gelesen und muss gleich mal sagen ich finde die tipps echt super. \nUnd ich halt mich auch schon seit längerer zeit an die meisten mir schon bekannten oben genannten tipps :)\n\nUnd ja ich muss sagen es hilft :) \nDie letzte jahre hab ich es gerade so bis Silber 5 geschafft. Damals auch noch mehr mid lane gespielt ;)\n\nUnd seid dem ich mich mehr darauf konzentriere mich zu verbessern und weniger auf andere achte geht es wirklich spürbar berg auf. Bin zurzeit Silber 1 mit einer ganz Ok ? win rate ?^^ War auch bis vor ein paar tagen knap vor der Gold promo :)\n\n**Allerdings** Zwei tipps würde ich noch dazu geben die mir sehr geholfen haben.\n\n**-   Als erstes Duo Spielen**. \nIch spiel seit einer ganzen weile zusammen mit einen kumpel und seitdem macht das Ranked spielen auch viel mehr spaß und ist auch mit erfolg gekrönt ^^ \nWir sprechen uns ab was auf der Map gerade passiert und was in welcher situation gerade die beste idee wäre :) und wenn man mal stirbt kann man gleich darüber sprechen was man gerade falsch gemacht hat und was man hätte besser machen können.\n\nUnd ganz wichtig wenn das game mal wirklich schlecht läuft und das passiert nunmal ab und zu ^^ kann man sich direkt gegenseitig aufbauen und das Hilft extrem ! wie ich finde :)\nAlso mir macht das spiel zurzeit sehr viel spaß selbt nach nen Losing streak am wochenende ^^ \n\n\n\n\n**-   Zweitens Freundlich sein :)**\n\nKlingt irgenwie einfacher als getan ^^ \nAber ich mach das so in der Champ select schreib ich erstmal ein nettes \"hi\" und im game wenn jemand was gutes macht zb. aus meiner sicht Firstblood, den ersten tower, drake ect. schreib ich kurz in chat (wenn es gerade nicht stört) \"gj\" \"gj team\" und solche sachen auch wenn mal was schlechtes passiert jemand kommt ganken und stirbt oder so versuch ich meisten \"np\" oder sowas zu schreiben \n\nHab teilweise echt das gefühl das hilft und Motiviert das team :) Also ich muss auch zugeben ich glaub auch daran das das hilt ;)\n\nUnd natürlich flame ich nicht und antworte auch nicht auf flame bzw. Mute ich wenn nötig sofort die entsprechende person.\nAls beweis ich spiel seit fast 3 jahre ohne auch nur eine strafe ;) \nHatte sogar vor kurze noch einen Grünes bändchen am Rahmen im Lade screen ^^\n\n\n\n\n\n\n\n\nUnd die ganzen leute die hier jammer das so viele Smurfs und Afk`ler/Trolle/inter in jeden zweiten game unterwegs sind. \n\n**Spielt ihr ein anderes spiel als ich ?**\n\nIch hab dieses jahr im ranked nur EINMAL jemandem gesehen bei dem ich 100% sicher war das er smurft ( paraktischer weise sogar im mein team ^^) der hat mit cassiopaia die top lane und anschliesend das komplette gegner team alleine rassiert :o     \n\nDas wars aber dann auch schon ;) bei ca. so 150 games +/- \n\n\nUnd Afk`ler sind auch relativ selten muss ich sagen ab und zu hat mal einer ein Dc aber kommt dann auch meisten gleich wieder.\n\nInter seh ich eigentlich garnicht oder vilt versteh ich darunter was anderes. Jeder verliert mal seine lane manchmal verliert man seine lane auch Hart. Das passiert aber jeden mal. Mir passiert das auch hin und wieder. Entweder weil der gegner eben besser ist als ich oder ich den ein oder anderen fehler mache ;)\nAber das seh ich nicht als absichliches feeden. \nWenn jemande immer auf die lane in den tower rennt und das 10 mal wiederholt dann ist das was anderes aber das wie gesagt passiert eigentlich nie ...\n\nAlso ich kann das jammern nicht verstehen ^^ \n\n\nMfg Maddin :) \n\n\nps. sorry falls der ein oder andere fehler zu finden ist ;)","replies":[{"poster":"Rena","date":"2017-05-23T22:55:32.122+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=00 M4ddin 00,realm=EUW,application-id=YnZkMR0R,discussion-id=jYiHfvda,comment-id=000d,timestamp=2017-05-23T15:01:36.117+0000)\n>\n> **-   Zweitens Freundlich sein :)**\n> \n> Klingt irgenwie einfacher als getan ^^ \n> Aber ich mach das so in der Champ select schreib ich erstmal ein nettes &quot;hi&quot; und im game wenn jemand was gutes macht zb. aus meiner sicht Firstblood, den ersten tower, drake ect. schreib ich kurz in chat (wenn es gerade nicht stört) &quot;gj&quot; &quot;gj team&quot; und solche sachen auch wenn mal was schlechtes passiert jemand kommt ganken und stirbt oder so versuch ich meisten &quot;np&quot; oder sowas zu schreiben \n> \n> Hab teilweise echt das gefühl das hilft und Motiviert das team :) Also ich muss auch zugeben ich glaub auch daran das das hilt ;)\n> \n> Und natürlich flame ich nicht und antworte auch nicht auf flame bzw. Mute ich wenn nötig sofort die entsprechende person.\n> Als beweis ich spiel seit fast 3 jahre ohne auch nur eine strafe ;) \n> Hatte sogar vor kurze noch einen Grünes bändchen am Rahmen im Lade screen ^^\n\nIch stimme dir da voll und ganz zu :D","replies":[]}]},{"poster":"Valinn Laurent","date":"2017-05-23T16:25:21.489+0000","up_votes":1,"down_votes":0,"body":"Ich stimme dir ja zu in vielen Punkten und vieles davon ist mir bekannt.\nAber ich möchte nur dazu loswerden das auch mit einem einzigen Champion der Climb möglich ist, MEINER Meinung nach bzw aus Erfahrung sogar besser als mit mehreren. Ich betone das dies meine Meinung ist!\nSicher braucht man nen Pick wenn der Main Champion mal gebannt wurde oder man dodged....\n\nTrotzdem guter Post und vielen Dank!","replies":[]}]}