{"poster":"Rena","date":"2015-06-18T17:30:25.606+0000","title":"Sorry","subforum":"Spielerverhalten & Moderation","up_votes":37,"down_votes":8,"body":"Hallo\n\nEs gibt Leute die diesen Post wahrscheinlich sehr un&ouml;tig finden.\nTrotzdem m&ouml;chte ich mich bei allen LOL Spielern entschuldigen f&uuml;r mein Spielverhalten.\n\nIn der 5. Season war mein Ziel Diamant zu erreichten. Da ich dies so sehr wollte, fing ich an ein richtiges \"Arschloch\" zu werden in dem Spiel. Ich flamte so ziemlich jedes Spiel im Chat oder auch vor meinem Computer... Vor ein paar Tagen war ich dann ganz nahe an Platin und wollte so schnell wiem&ouml;glich Platin werden. Jedoch hatte ich dann ein Spiel in dem mich eine Cassiopeia extrem aufgeregt hat (intentional feeding, trolling). Da habe ich wieder angefangen zu flamen.\n\nAls das spiel dan vorbei war, erhielt ich einen 14 Tage ban. Zuerst habe ich mich sehr dar&uuml;ber aufgeregt, da ich nicht mehr spielen konnte und ich in genau den 14 Tagen auch noch anschliessend 2 Wochen weg bin...\n\nDies klingt jetzt vielleicht etwas seltsam, aber ich m&ouml;chte mich f&uuml;r diesen 14 Tage ban bedanken. In diesen 5 Tagen w&auml;hrend meiner Banphase habe ich eingesehen wie schlimm es eigentlich war mit mir zu Spielen und DANKE dass ich keinen Permaban gekriegt habe, sondern noch eine 2. Chance :D.\n\nDarum will ich mich bei der ganzen Community entschuldigen f&uuml;r mein grauenhaftes Spielverhalten...\n\nDanke f&uuml;r die 2. Chance :D","replies":[{"poster":"erzi222","date":"2015-06-21T22:05:38.989+0000","up_votes":1,"down_votes":5,"body":"boaaah dieses neue forum kotzt echt, so unübersichtlich.\n\nund falls ich hier angesprochen wurde richtet das auch bitte an mich oder nennt meinen namen xD !\n\naber was ich sagte meine ich ernst und war schon sehr lange geplant ^^ !\n\ndas spiel gibt mir nichts mehr auser frust durch die mitspieler die nicth spielen können geschweige denn etwas logisch nachdenken können.","replies":[{"poster":"Usâgi","date":"2015-06-22T10:51:38.093+0000","up_votes":6,"down_votes":0,"body":"Lieber Erzengel, (Name wurde gesagt!)\n\nich wünsche dir hiermit viel Spaß in HOTS. Nach deinem 2 Wochen ban (jedenfalls gehe ich davon aus wenn man die Match History ansieht und das beschimpfen gleich danach gegenüber dem Ban System) scheinst du ja weiterhin der Meinung zu sein das man sich nach dir und deiner Art zu richten hat und nicht andersherum.\n\n Ich kenne mich kein bisschen aus mit HOTS, sollte Blizzard aber noch nicht dafür gesorgt haben Leute mit deinem Verhalten, wie es nun Riot tut, auch zu Maßregeln wirst du sicherlich weit aus mehr Spaß mit HOTS haben.\n\nWas ich mich nur frage ist, wie man nach deiner Erfahrung immer noch allen anderen die Schuld gibt und nicht endlich anfängt Fehler bei sich selbst zu suchen, den immerhin bist und warst du in allem der entscheidende Faktor der sich nie verändert hat gegenüber den vielen Randoms, geschweige den die Überheblichkeit der reinen Perfektion von dir aus. (Und ja, die lässt du dauernd raus, du kannst vorher noch so oft schreiben das du kein \"Pro\" bist, im nächsten Satz bist du trotzdem wieder überheblich als wärst du einer)\n\nVielleicht siehst du das ja in HOTS irgendwann, aber wie du schon selbst sagst, in LoL hast du \"zurzeit\" mit deinem Verhalten wirklich nichts mehr zu suchen. Vielleicht kommst du ja mit einer besseren Einstellung irgendwann wieder.\n\nGruß und Kuss\n\nUsagi aus dem MMX","replies":[{"poster":"Rena","date":"2015-06-22T10:54:06.949+0000","up_votes":1,"down_votes":0,"body":"Meinst du mich ? :O","replies":[{"poster":"eingew","date":"2015-06-22T12:05:23.897+0000","up_votes":1,"down_votes":0,"body":"Unwahrscheinlich, schalte mal auf Diskussionsansicht um, dann siehst du sowas besser ;)","replies":[{"poster":"Rena","date":"2015-06-22T12:11:20.748+0000","up_votes":3,"down_votes":0,"body":"Danke :D bin neu in dem Forum sorry ^^","replies":[]}]}]}]},{"poster":"eingew","date":"2015-06-22T00:23:44.621+0000","up_votes":1,"down_votes":0,"body":"Du kriegst direkte Antworten auf dich doch sowieso oben rechts angezeigt? Naja und ansonsten hilft es dir vielleicht auf die Diskussionsansicht zu stellen, dann sind Antworten direkt unter den Posts auf die sie sich beziehen ;)","replies":[]}]},{"poster":"Infury","date":"2015-06-18T23:11:31.023+0000","up_votes":3,"down_votes":0,"body":"Ja Hut ab erstmal, nicht jeder entschuldigt sich für Fehlverhalten!\nGrundsätzlich würde ich dir jedoch vom Flamen abraten. Vor deinem PC kannst du schreien so viel du willst - im Chat ist das ein absolutes NO-GO!\n\nWarum ist Flamen nicht hilfreich?\nGanz simpel - wenn dein Team nichts taugt und du sie dann noch flamest wie sau werden die Leute sicher nicht wie durch Magie zum Pro!\nIm Gegenteil.. i.d.R. fühlen sich die Leute dann (zu Recht) auf den Schlipps getreten und spielen extra scheiße!\nWenn du also Dia als Ziel hast trittst du dir nur selbst in die ... indem du deine Mitspieler flamest.\n\nVersuch doch lieber das Ruder in die Hand zu nehmen, koordiniere, leite dein Team an, gib Ratschläge (aber nicht von oben herab).\n\n\nGrüße Infury","replies":[{"poster":"eingew","date":"2015-06-19T09:37:15.116+0000","up_votes":3,"down_votes":0,"body":"> Im Gegenteil.. i.d.R. fühlen sich die Leute dann (zu Recht) auf den Schlipps getreten und spielen extra scheiße!\n\nDas würde ich so nicht sagen. Also ja, es passiert oft, dass die dann absichtlich schlechter spielen. Aus Trotz. Aber deutlich öfter passiert es, dass sie schlechter spielen, weil sie deutlich weniger motiviert sind. Und dann spielen sie unabsichtlich schlechter. Die Konzentration geht dann flöten.","replies":[{"poster":"Rena","date":"2015-06-21T18:33:37.494+0000","up_votes":1,"down_votes":0,"body":"Mal kurz als Frage:\n\nIch habe als ich den Ban gekriegt habe ein Ticket an Riot support geschrieben indem ich \"wütend\" war.\nIch habe gehört das Leute deswegen einen Permaban anstatt 2Wochen gekriegt haben. (ich habe für 2 Wochen)\nIch habe am ticket Ende geschrieben, ob wir dieses Ticket vergessen können?\n\nKann ich wegen Sowas gebannt werden ?","replies":[{"poster":"eingew","date":"2015-06-21T19:44:57.071+0000","up_votes":2,"down_votes":0,"body":"Wenn du im Ticket flamest? Nicht, dass ich wüsste ehrlich gesagt. Also wenn du noch keine Konsequenzen hast werden auch keine kommen, das zumindest ist relativ sicher.","replies":[{"poster":"Rena","date":"2015-06-21T19:54:41.286+0000","up_votes":1,"down_votes":0,"body":"Ich habe einfach angst da mein \"flame chat-Log\" dort drin steht....","replies":[{"poster":"eingew","date":"2015-06-21T21:04:46.269+0000","up_votes":2,"down_votes":0,"body":"Zugegeben: Es gibt durchaus Fälle, die zu einem Perma verlängert wurden... aber sowas vergibt Riot nicht einfach so, und ich denke nicht, dass das bei dir eine sinnvolle Entscheidung wäre, vor allem, wenn du ehrliche Reue zeigst.","replies":[{"poster":"Rena","date":"2015-07-05T17:29:46.106+0000","up_votes":2,"down_votes":1,"body":"ehh sorry dass ich frage ^^. Mein ban ist weg und ich habe mich sehr gebessert :D. Wollte nur mal fragen ob ich noch die season 2015 Belohnungen kriege, da ein kumpel von mir in der season 2014 keine bekommen hat.\nAlso ob ich wegen den 14 tagen ban doch noch rewards kriege oder nicht.","replies":[{"poster":"eingew","date":"2015-07-06T12:13:03.566+0000","up_votes":1,"down_votes":3,"body":"Riot steht auf Besserung. Wenn sich jemand bessert ist alles wieder gut. Und wenn du bis zu den Seasonbelohnungen positiv bleibst, kriegst du auch die Rewards. Warum sollte dich Riot ein weiteres Mal für bereits bestraftes und verbessertes negatives Verhalten nochmal bestrafen? Das ist Riots Sichtweise. Die Möglichkeit, dass du wegen dieser Sperre keine Belohnungen kriegst ist quasi nicht existent.","replies":[{"poster":"Rena","date":"2015-08-25T19:01:45.846+0000","up_votes":2,"down_votes":1,"body":"@EINGEW: Da dein Name grün ist kennst du dich da irgendwie aus oder ? :D\nDas ich keine Rewads kriege ist zwar etwas frustrierent aber ich kann dies verstehen da ich in der season 5 toxic war und darum auch keine rewards erhalte, Ich werde den rest der season nutzen mich zu einem freundlichen spieler zu \"entwickeln\".\nIn diesem Post habe ich ja geschrieben das es mir Leid tut das ich geflamet habe. Aber einsehen ist nur der erste Schritt, verbessern ist das schwerste. Dennoch WILL ich mich ändern. \n\nHIer ist mir deine Meinung sehr wichtig.\n\n1. Leuten die 5000 Chat restrictions gekriegt haben, wurden die vergessen ? Das sind auch nur Menschen die sich ändern können. MIt dem was Lyte gesagt hat würden spieler wie diese ca 3 seasons keine rewards bekommen.\nAlso egal ob sie sich ändern oder nicht.\n\n2. Kannst du mir irgendwelche tips geben um nicht zu flamen. Ich habe mich in diesem Post entschuldigt darum will ich es auch nicht mehr machen. Ich will mein Versprechen das ich in dem Post gegeben habe halten.\nDas geht aber nicht so einfach. Ich brauche zeit um mich zu ändern. Ich will gar nicht toxic sein ich habe aber seit meinem ban gemerkt das ich es immer noch bin.\n\n\"Einsicht ist der erste Weg zur Besserung. Ich bin stolz auf dich das du deinen Fehler eingesehen hast, man darf ruhig mal applaudieren\"\n\nNun muss ich den Zweiten weg bestreiten.","replies":[{"poster":"eingew","date":"2015-08-25T20:36:37.890+0000","up_votes":1,"down_votes":0,"body":"Wir \"Grünen\" sind Emissarys, das heißt nicht zwingend, dass wir uns auf Player Behaviour konzentrieren, in meinem Falle aber durchaus, ja.\nWir wurden von Riot... oder in meinen Falle von einigen anderen Emissarys, ausgewählt um für Riot einen besseren Draht zu Community zu binden und quasi Meinungen in der Community festzustellen, damit Riot sich besser daran anpassen kann.\n\nIch glaube nicht, dass Spieler mit 5k CR zwingend am Ende der Season keine Rewards bekommen. Wenn die Sperre in dieser Season vergeben wurde kann das sein, wenn die Sperre aber während der letzten Season vergeben wurde, kann es durchaus sein, dass ein solcher Spieler diese Season gar nicht bestraft wurde und damit nicht in den Algorithmus von Riot fällt. Ein Spieler den ich kenne, der letzte Season zum Zeitpunkt der Verteilung der Seasonbelohnungen eine 2k Sperre hatte, hat zum Beispiel da schon die Belohungen bekommen und konnte seitdem keine neue Sperre bekommen, einfach weil die alte noch lange nicht abgebaut ist.\n\nWas die Besserung angeht, so solltest du verschiedene Dinge beachten um dein Mindset zu ändern.\n\nWie du hier im Forum bist ist zum Beispiel schon sehr gut. Du bist ruhig, freundlich und zuvorkommend. Und das beste, wie du gesagt hast, du siehst deine Fehler ein. Das heißt ich würde dir vorschlagen, ingame alles mit derselben Art zu betrachten wie hier im Forum.\n\nAlles, was ingame passiert, was jemand schreibt oder sagt, oder was du tust, ist morgen früh, wenn du aufstehst sowieso nicht mehr wichtig. Und noch weniger in einem Jahr. Wenn es dich also weder morgen früh, noch in einem Jahr aufregen kann, wieso solltest du dich jetzt darüber aufregen?\nWarum ist es überhaupt wichtig für dich, was irgendwelche für dich völlig irrelevanten Menschen tun? Du spielst dieses Spiel schließlich um Spaß zu haben. Wenn ein Mitspieler diesen hemmt, dann solltest du ihm nicht helfen, sondern nur die 2 Sekunden verschwenden, um ihn zu muten, um deinen Spaß am Spiel zu maximieren.\nVielleicht reicht das als kleiner Anstoß. Ich hab eigentlich keine besonders große Ahnung von sowas, vielleicht hilft es dir ja, wenn du dir verschiedene Vorgehensweisen bei Antiaggresionstherapien ansiehst, vermutlich lässt sich das ein oder andere davon auch bei dir anwenden.","replies":[{"poster":"Rena","date":"2015-08-25T20:49:19.963+0000","up_votes":2,"down_votes":1,"body":"danke dir vielmals für deine Antwort :D ich schätze das sehr. Ich werde sehr über das nachdenken was du gesagt hast :)\n\nIch bin eigentlcih auch freundlich.. ich flame auch niemanden der schlecht spielt auch wenn er 0/10 ist.\nIch flame meistens wenn mich leute hart beleidigen und da ich denn schon rage kann ich sie auch nicht muten (ich weiss auch nicht warum). Deshalb frage ich sie warum sie mich beleidigen, die meisten schreiben dann sowas wie \"xD cry more\". Dann werde ich toxic.\n\nIch will dies ändern, für mich, für meinen account und für die ganze Community.. denn jeder ist nur ein Mensch und macht fehler, was mir manchmal in game bewusst werden soll...","replies":[{"poster":"Der Großmugister","date":"2015-08-26T06:28:30.930+0000","up_votes":3,"down_votes":0,"body":"Bei mir war es ganz genau so, dann, nach meiner Strafe ist mir aber nicht nur klar geworden, dass ich mich schlecht verhalten habe, sondern auch, dass Riot auf dem Auge tatsächlich nicht blind ist, sondern man auch in LoL das erntet was man säht.\nMache dir einfach bewusst, dass wenn du bestraft wurdest, Andere auch für ihr Verhalten die Rechnung zahlen müssen. Wenn du dich durch Flame, zu Reaktionen im Chat hinreißen lässt, tust du ihnen nur den Gefallen, dass ihr beide bestraft werdet, wenn du nichts sagst und einfach reportest, kannst du dir sicher sein, dass den Flamer seine Strafe mehr stören wird, als es deine Widerworte jemlas könnten.\n\nGanz im Gegenteil, den meisten Spielern ist es pupsegal, wenn sie beleidigt werden oder Ähnliches, ich hab sogar eher die Erfahrung gemacht, dass sich manche damit gerne die Zeit vertreiben, wenn ein Spiel verloren ist.\n\nMach dir also einfach bewusst, dass es dir mehr bringt und ihnen Weniger, wenn du Nichts sagst.","replies":[{"poster":"Rena","date":"2015-08-26T17:38:37.814+0000","up_votes":4,"down_votes":0,"body":"Danke :D ich denke ich lese deinen Kommentar vor jedem Ranked game, um mir dem immer Bewuust zu bleiben","replies":[]}]}]}]}]}]},{"poster":"Temudschinn","date":"2015-07-05T17:33:59.221+0000","up_votes":2,"down_votes":0,"body":"In der Vergangeheit wurde das afaik so gehandelt dass Leute die sich nach der Strafe verbessert haben die Seasonbelohnungen erhalten haben. Sollte also klappen für dich.","replies":[]}]},{"poster":"Rena","date":"2015-06-22T08:06:35.165+0000","up_votes":1,"down_votes":0,"body":"ah okey Danke ^^","replies":[]}]}]},{"poster":"Rena","date":"2015-06-21T19:51:44.124+0000","up_votes":1,"down_votes":0,"body":"Vor 30 Minuten habe ich NOchmals ein Ticket geschrieben um dies nachzufragen :P","replies":[]},{"poster":"Rena","date":"2015-06-21T19:50:10.285+0000","up_votes":1,"down_votes":0,"body":"Geflamet habe ich nicht.  Ich habe mich dort über den Ban aufgeregt. und die E-Mail reingeschrieben (ban e-mail)","replies":[]}]}]},{"poster":"Feuerstern97","date":"2015-06-20T18:35:08.365+0000","up_votes":3,"down_votes":0,"body":"Vor allem auch, weil man sich nur noch auf den CHat konzentriert. Das merk ich ja schon, wenn ich nicht einmal Beteiligter des Streits bin, es mich aber trotzdem ablenkt. Flame schadet also nicht nur den 2,3 Beteiligten, sondern sofort dem ganzen Team.","replies":[]},{"poster":"Temudschinn","date":"2015-06-19T10:06:20.490+0000","up_votes":3,"down_votes":0,"body":"Oder zu aggresiv, weil sie beweisen wollen dass sie solokills holen können :)","replies":[]}]}]},{"poster":"crit in ur anus","date":"2015-06-18T18:03:21.912+0000","up_votes":5,"down_votes":1,"body":"wow hut ab^^ die meisten kommen und sagen ich habe nichts getan etc. im alten forum gab es sogar leute die haben sogar mit nem riotler diskutiert das sie unschuldig sind....\n\n\n\n\n\n\n... bis der Riotler(Riot Lyte) einfach mal den Chatlog veröffentlicht hat^^ dan war schnell still :P\n\nWenn du das wirklich ernst meinst das wird es dich bessern^^ habe früher auch richtig hart geflamed und habe mich ohne bann gebessert ab und zu passierts dennoch wobei ich eher meinen laptop anbrülle statt es zu schreiben ;)","replies":[{"poster":"Rena","date":"2015-06-18T18:06:22.853+0000","up_votes":2,"down_votes":1,"body":"Danke für den kommentar :D\n\nIch habe auch ein paar von Lyte Posts gesehen Im Alten forum.\nDadurch wurde ich ziemlich \"abgeschreckt\".\n\nhttp://forums.na.leagueoflegends.com/board/showthread.php?t=4785899&page=1#post49324224 \n\nAls ich das lesen musste, schrieb ich dieses Ticket","replies":[{"poster":"hshtagniemehrcdu","date":"2015-06-18T18:20:40.806+0000","up_votes":3,"down_votes":0,"body":"Das sind die besten.....\n\"Ja, wir haben einen Fehler gemacht.\nWir haben diesen Fehler nun manuell behoben, hier ist dein Perma\"\n\n\nWeiß jemand ob solche Fälle bei der Fehlerquote mitberechnet werden?","replies":[{"poster":"Rena","date":"2015-06-18T18:36:11.602+0000","up_votes":1,"down_votes":1,"body":"***","replies":[{"poster":"BusyBeaver","date":"2015-06-18T18:46:56.652+0000","up_votes":2,"down_votes":0,"body":"Ich glaube Eleandor317 meinte mit seiner Aussage, ob der \"Fehler\"  in dem von dir geposteten Link mit in die Fehlerquote miteingerechnet wird.","replies":[{"poster":"Rena","date":"2015-06-18T18:55:08.538+0000","up_votes":2,"down_votes":0,"body":"ha ? :D\n\nIch komme nicht ganz draus sorry ^^\n\n1. Der im Link (flamer) bin nicht ich lol\n2. Der Link ist öffentlich also falls man solche Links nicht posten darf wusste ich das nicht.\n3. Ich habe den Link  nur als Beispel genommen was hätte passieren können","replies":[{"poster":"BusyBeaver","date":"2015-06-18T19:05:35.101+0000","up_votes":3,"down_votes":0,"body":"Keine Angst. :D Der Link ist kein problem. Eleandor317s Aussage war auch gar nicht auf dich bezogen.\nIch gehe auch nicht davon aus, dass du die Person in dem Beispiel bist.\nVersuch Nr. 2 der Erklärung:\nIn dem Beispiel wurde aus dem 2 Wochenban  nach einem Review von Riot Lyte ein perma Ban. -> Die ursprüngliche Strafe war nicht die richtige Strafe für diesen Fall (also ein \"Fehler\" des Systems).  Und Eleandor317 hat gefragt, ob auch solche Fehler (also Strafe zu niedrig) mit in die Fehlerquote mit einberechnet werden.","replies":[{"poster":"Rena","date":"2015-06-18T19:10:19.089+0000","up_votes":3,"down_votes":0,"body":"Ah Ich dachte sein Kommentar bezieht sich auf Mich ^^\nDanke für die Erkärung","replies":[{"poster":"hshtagniemehrcdu","date":"2015-06-18T19:13:25.590+0000","up_votes":4,"down_votes":0,"body":"Ne, bezog sich nicht auf dich.\nGibt einige solcher Fälle, wo sich ein  Spieler beschwert hat dass er zu unrecht gebannt wurde, der Fall von Riot Lyte kontrolliert wurde, und er dann einen Perma draus gemacht hat.","replies":[{"poster":"Rena","date":"2015-06-18T19:15:08.530+0000","up_votes":2,"down_votes":0,"body":"Ja, so wie im Link oben","replies":[]}]}]}]}]}]}]}]}]}]},{"poster":"VigorousMarten","date":"2015-06-19T18:09:37.201+0000","up_votes":3,"down_votes":0,"body":"Einsicht ist der erste Weg zur Besserung. Ich bin stolz auf dich das du deinen Fehler eingesehen hast, man darf ruhig mal applaudieren{{champion:17}}","replies":[{"poster":"Feuerstern97","date":"2015-06-20T18:32:40.138+0000","up_votes":2,"down_votes":0,"body":"Schenkt ihm zur Belognung einen Keks :D {{item:2010}}","replies":[{"poster":"Rena","date":"2015-06-21T16:48:02.127+0000","up_votes":2,"down_votes":0,"body":"hehe :D","replies":[]}]}]},{"poster":"erzi222","date":"2015-06-23T08:33:34.759+0000","up_votes":0,"down_votes":6,"body":"lol soviel aufmerksamkeit xD ! ihr müsst euch echt keine gedanken machen um mich ^^ \"!\n\nich geb zu ich hatte den 2 wochen bann, aber ich konnte schon längst wieder spielen. und in der zeit wo riot die banns rausgehauen hat kam halt zufällig ein anderes moba raus, was ich halt selbstverständlich ausprobiert habe weil ich von der marke viel halte. doch selbst jetzt hab ich die tage nichts gezockt, weil ich beruflich eingespannt bin (studium) und auch die nächsten tage noch damit viel beschäftigt sein werde.\n\nbzw. man muss sich nicht nach mir richten, wenn man bevorzugt zu verlieren :P ! ich sag den spielern sachen vorraus und sie passieren weil sie nicht reagieren oder nicht dementsprechend handeln, z.B. \"stop push lane, jungler always botlane\" .... bei solchen leuten hilft es netmal wenn ich 4 wards gesetzt habe, 3 beim fluss und unten eben (pinky op). bestes beispiel sind dragons und barons, wo es 100% offensichtlich ist das man den nicht machen darf weil alle gegner leben und in der nähe sind ... also teamorientierter support ist man natürlich bereitwillig dennoch zu helfen, aber selbst das hat sich irgendwann erledigt in dne meisten games .... dann geh ich eben weg und lass die noobs sterben. sie wollten es ja o_O !\n\nund ja ich kenne meine schwächen sehr gut, wie gesgat bin nicht pro. ich kann midlane nicht spielen,seltenst gewinne ich dort, aber ich kann die lane halten und feede dabei nicht ins unermessliche also höchstens 1-2 feeds. zum toplaner bin ich auch nicht geboren, wobei ich dort definitiv besser spiele als midlane. daneben noch evebntuell das missen mancher skillshoots .... bin halt nicht perfekt xD ! muss ich auch net sein ^^ !\n\nund wieso soll ich mir die schuld an nem lose geben wenn ich mit sona 1 0 27 habe ? und ich habe oft sehr gute games als support, adc oder jungler und wenn teammates nicht schalten kann ich auch nichts machen. die leute kaufen ja netmal wards geschweige denn nen pinky ward um unseren jungel zu sichern. dank riot kann man ja als support nicht mehr endlos warden ....\n\nwie gesagt, war letzte season nur gold 4, auch selsbtverschuldet durchs afk gehen im ranked etc (sry aber mit 4 idioten im team spiel ich kein ranked, dass sind 40 minuten waste für einen lose) ...\n\nein nein ich komme nicht mehr wieder, hab ich auch irgendwo schon geschrieben. \nlol ist für mich einfach ausgelaugt, es gibt nichts mehr für mich, versteht es doch xD !\n\nhatte dennoch viel spaß gehabt als teamplay orientierter main support der stets seine lane easy gewonnen hat gegen die no teamplayers wie annie support etc ^^ ! aber schreiben in foren macht mir einfach spaß xD !","replies":[{"poster":"Temudschinn","date":"2015-06-23T08:39:19.342+0000","up_votes":4,"down_votes":0,"body":"Da freuen wir uns aber. Ein AFK gehender flamer weniger, partytime ;)","replies":[]}]},{"poster":"erzi222","date":"2015-06-20T11:02:03.143+0000","up_votes":1,"down_votes":6,"body":"was hat arroganz damit zu tun wenn man seine lane gewinnt und nicht sinnlos und bekloppt feeded wie andere?\nich sga ja nicht das ich pro bin, aber manche random spieler kann und will ich nicht verstehen was in deren köppen losgeht.","replies":[{"poster":"Temudschinn","date":"2015-06-20T12:06:36.503+0000","up_votes":4,"down_votes":0,"body":"Letztes Match ansehen - du gibst FB bei minute 2.30 und stirbst 3mal vor der 12. Minute. Aber ja, du bist ein wirklich guter laner...\n\nEventuell bist du ja mit anderen Champs besser...also das letzte Soraka-Match angesehen. FB bei 1.11...","replies":[]}]},{"poster":"DAGO iM BARRiO","date":"2015-06-19T13:26:58.687+0000","up_votes":2,"down_votes":0,"body":"Entschuldigung angenommen.","replies":[{"poster":"Rena","date":"2015-06-19T14:48:28.870+0000","up_votes":1,"down_votes":0,"body":"Danke :D","replies":[]}]},{"poster":"CrackerOfDoom","date":"2015-06-19T09:11:06.855+0000","up_votes":2,"down_votes":0,"body":"Wir vergeben dir :)","replies":[{"poster":"Rena","date":"2015-06-19T14:48:54.113+0000","up_votes":1,"down_votes":0,"body":":D","replies":[]}]}]}