{"poster":"Agustin DGN","date":"2016-05-08T06:47:45.734+0000","title":"GG LAS","subforum":"Comportamiento del jugador","up_votes":3,"down_votes":2,"body":"Gente hace tiempo que vengo jugando partidas normales y clasificatorias, la verdad es que ya estoy cansado de perder por culpa de los team que tocan sean premades o soloQ, me viene pasando lo mismo siempre,no puede ser que yo salga con scores como 10/4/8 y mi team solo fedea, lo peor es que no podes decirles que jueguen bien porque siempre te reportan y yo suelo reportar a la gente que no saben jugar, entra a las rankeds a perder puntos, estoy cansado de ver lo mismo en todas las partidas, yo se que es un juego solamente y es para divertirse, pero no puede ser que yo hago lo posible para ganar y siempre pase lo mismo afk trolls gente sin jugabilidad, y otra cosa... yo cuando estuve en bronce me sol&iacute;a tocar con gente de mi misma liga osea un buen emparejamiento, hoy en dia me vienen tocando teams bronces o platas, cuando yo soy oro IV ayer baje a oro V porque este mismo tema, juegan muchos premades siempre veo que en mi team toca gente bronce y plata 1 que otro oro, no tengo nada contra la gente bronce o plata pero es que no tienen la jugabilidad de un invocador oro lo digo por experiencia por algo estoy en oro, yo fui bronce y admito que no sabia jugar por eso lo digo, yo nose porque no hay un emparejamiento soloQ, porque a pesar de ser preamdes siempre te reportan y el que encerio juega bien termina reportado por culpa de ellos. ojala puedan sacar un emparejamiento para soloQ o mejorarlo sacando servers para distintas ligas para poder jugar con gente de tu nivel, repito no tengo nada contra los bronces y plata porque yo mismo estuve ah&iacute;. Riot espero que mejoren algo en las partidas como el emparejamiento. y para esa gente que va a comentar cosas como &quot;no ganas las partidas porque sos un manco flamer&quot; ahorren se el comentario y vallan a otro post, que comente gente que le venga pasando lo mismo para poder hacernos escuchar. muchas gracias por su tiempo... buena suerte.","replies":[{"poster":"Infini7yNahu","date":"2016-05-08T07:43:02.973+0000","up_votes":1,"down_votes":0,"body":"Creo que tienes un serio problema con las premades, pero no puedes hacer nada. Los AFKs, trolls y flammers son típicos en juegos competitivos en donde Riot no puede hacer nada para corregirlos, no es un dios omnipresente que puede evitar que las cosas pasen.\n>no puede ser que yo salga con scores como 10/4/8 y mi team solo fedea, lo peor es que no podes decirles que jueguen bien porque siempre te reportan y yo suelo reportar a la gente que no saben jugar, entra a las rankeds a perder puntos, estoy cansado de ver lo mismo en todas las partidas, yo se que es un juego solamente y es para divertirse, pero no puede ser que yo hago lo posible para ganar y siempre pase lo mismo afk trolls gente sin jugabilidad, y otra cosa...\n\nPuede que termines con un KDA perfecto (es una pésima forma de medir el desempeño) pero al final lo único que importa es el resultado (victoria, derrota). Es un juego en equipo y no puedes atribuirle toda las razones a tus partidas perdidas solo porque \"me toco un team malo con premades\", o \"porque un jugador feedeo\".\n\n>yo cuando estuve en bronce me solía tocar con gente de mi misma liga osea un buen emparejamiento, hoy en dia me vienen tocando teams bronces o platas, cuando yo soy oro IV ayer baje a oro V porque este mismo tema, juegan muchos premades siempre veo que en mi team toca gente bronce y plata 1 que otro oro, no tengo nada contra la gente bronce o plata pero es que no tienen la jugabilidad de un invocador oro lo digo por experiencia por algo estoy en oro\n\nEl emparejamiento esta _bien_ balanceado a mi parecer, con esto de las DynamicQ puede que te toque jugar con bronces o unrankeds porque estan en premade con alguien de tu mismo MMR, la única _solución_ a esto es la implementación de SoloQ donde no se puede jugar con premades (Rito pls, todos lo pedimos).\nNo exageres tanto la situación, un jugador en Plata I, no juega MUY distinto a un oro bajo, el año pasado termine en Plata III donde me emparejaban regularmente con gente en Oro.\nVas a subir y bajar divisiones, no es muy importante, si eres bueno subirás, si eres malo bajaras, y si es tu nivel te quedaras estancado hasta mejorar.\n\n>\"no ganas las partidas porque sos un manco flamer\" ahorren se el comentario y vallan a otro post, que comente gente que le venga pasando lo mismo para poder hacernos escuchar. muchas gracias por su tiempo... buena suerte.\n\nEspero haberte ayudado en algo, espero que tengas un lindo día\n{{sticker:slayer-jinx-catface}}","replies":[{"poster":"Agustin DGN","date":"2016-05-08T08:19:14.150+0000","up_votes":2,"down_votes":0,"body":"Recién termino de jugar una ranked y en el emparejamiento toco un atroxx unranked, por suerte gane pero el mismo dijo \"porque siempre me tocan contra oros\" es obvio que el emparejamiento no es del todo bien, el tema de que me toquen platas y bronces no es un problema siempre y cuando intenten jugar bien osea saber lo básico (farmear, wardear, mirar el mapa, saber focusear y sobre todo posicionarse) ya hable con gente y le comente lo mismo y me dicen que tengo razón pero que también no me gusta perder y es verdad sea un juego o no a nadie le gusta perder cuando uno juega bien. Sobre todo pienso que no hay gente \"manca\" sino que les hace falta practica antes de jugar clasificatoria, y lo que no me entra en la cabeza es porque no practican antes de jugar, yo estuve en bronce 2 estancado practique mucho y en 2 meses recién pude salir pero valió la pena de no haber practicado recién seria plata 5 como mínimo, yo mismo me daba cuenta que jugaba mal cuando en bronce terminaba partidas con scores 2/9 por ejemplo, si vei que perdia rankeds asi no seguía rankeando al contrario buscaba mas información sobre el personaje que usaba por ejemplo los counters, builds etc. hoy en día ves gente con cualquier build y los entiendo porque me paso pero bueno nada que la practica no mejore, gracias por tu comentario me cambio la forma de ver un poco la gente de hoy, que tengas un buen día :)","replies":[]}]},{"poster":"TheSystruction","date":"2016-05-08T22:12:35.572+0000","up_votes":1,"down_votes":1,"body":"otro que se queja por su score , dios mio que no entienden que asi no se sale de bronce y plata? si seguís pensando a si mas vale que no subas de liga porque no ves ni el mapa, 0 entendimiento del juego, sin ofender.","replies":[{"poster":"Agustin DGN","date":"2016-05-08T23:22:35.293+0000","up_votes":1,"down_votes":0,"body":"Como dije en el post guardense sus respuestas de mal gusto, no vine al foro para tratar con gente que nisiquiera lee bien el post, primero no soy bronce ni plata, y no me estoy quejando por mi score, espero que algun dia puedas entender el mensaje... a parte nunca me viste jugar como para decir que no veo el mapa o \"entendimiento\" como bien dijiste. Aca la gente viene a dar su opinion o su punto de vista al juego, y si tu pensamiento es que  asi no se sale de bronce y de plata primero te recomiendo leer todo el post para poder entenderlo bien, ni pienso contestarte \"mas vale que no subas de liga\" por el simple hecho de que no estoy aca para pelear con nadie y repito vengo a dar mi opinion, sin ofender","replies":[{"poster":"TheSystruction","date":"2016-05-09T00:04:16.340+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Agustin DGN,realm=LAS,application-id=PJAKt7ph,discussion-id=RNY1V0Fy,comment-id=00010000,timestamp=2016-05-08T23:22:35.293+0000)\n>\n> Como dije en el post guardense sus respuestas de mal gusto, no vine al foro para tratar con gente que nisiquiera lee bien el post, primero no soy bronce ni plata, y no me estoy quejando por mi score, espero que algun dia puedas entender el mensaje... a parte nunca me viste jugar como para decir que no veo el mapa o &quot;entendimiento&quot; como bien dijiste. Aca la gente viene a dar su opinion o su punto de vista al juego, y si tu pensamiento es que  asi no se sale de bronce y de plata primero te recomiendo leer todo el post para poder entenderlo bien, ni pienso contestarte &quot;mas vale que no subas de liga&quot; por el simple hecho de que no estoy aca para pelear con nadie y repito vengo a dar mi opinion, sin ofender\n\nSin ofender, No se haga el respetuoso aquí, lei muy bien todo el mensaje y puedo asegurar que usted es un flamer toxico en partidas clasificatorias :/ . Estas de hecho menospreciando a la gente bronce y silver, cuando siendo bronce I(s6) he ganado partidas contra gente oro(y no de la manera de 1vs 1 , como la clásica excusa de todo el mundo bronce) , los oro IV y V no se diferencian mucho de los silver I silver II y III, lo se porque jugué en esas ligas en la anterior temporada y era así, calcado, me tocaba contra gente como tu, y partidas que no tenia trolls o afk en mi equipo, las ganaba y asi estuve 2 veces en promo a silver II cuando había descendido, ganándole partidas a oros sin siquiera haber jugado 3 meses league of legends, si vos pensas que se llega siendo bueno a oro te equivocas, se llega JUGANDO MUCHAS rankeds, o jugando las 10 primeras y ganándolas a las 10 o 9/10 siendo unranked sin el elo ya estropeado por la temporada anterior. Y aprendes poco llegando a oro, por eso pienso que para ser bueno ni siquiera platino es tu liga, si realmente sos bueno recién lo vas a ver cuando llegues a diamante V o IV, ahí recién hay diferencias notorias entre un Platino I y II y un diamante IV/V y podrás quejarte de los emparejamientos, y ni hablar de los challengers que se quejan de los jugadores de diamante I y II o hasta inclusive III y IV que les tocan, entonces, que haces tú quejándote de los silver I y ii cuando no hay diferencias notorias en juego?. Por algo te los ponen contigo, debes de cometer los  mismos errores estratégicos que esa gente.","replies":[{"poster":"Agustin DGN","date":"2016-05-12T21:55:24.834+0000","up_votes":1,"down_votes":0,"body":"ya me suponía que ibas a decir eso \" flamer toxico\" mejor ni vale la pena hablarte solo contesto el comentario... se ve que no leíste bien el post, no vale la pena responder a alguien que juzga sin conocer al otro.","replies":[{"poster":"TheSystruction","date":"2016-05-14T03:39:31.624+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Agustin DGN,realm=LAS,application-id=PJAKt7ph,discussion-id=RNY1V0Fy,comment-id=0001000000000000,timestamp=2016-05-12T21:55:24.834+0000)\n>\n> ya me suponía que ibas a decir eso &quot; flamer toxico&quot; mejor ni vale la pena hablarte solo contesto el comentario... se ve que no leíste bien el post, no vale la pena responder a alguien que juzga sin conocer al otro.\n\nsin ofenderte, no necesito saber mas nada que lo que acabas de poner en el post, tu mismo dices que no juegan a tu nivel, y yo te digo que hasta inclusive pueden jugar mejor que tu dependiendo el jugador que te topes. Aprende de tus errores, que muchos oros se quedan estancados y no suben justamente por haber llegado allí spameando un champ fácil como por ejemplo garen o katarina, o yi(a quien no le ha pasado en temporadas anteriores? ) y luego entran y al jugar partidas clasificatorias a oro, se dan cuenta de que no juegan lo suficientemente bien como para sobrevivir en esa liga. Aun asi, conozco algunos que se han superado y hoy por hoy no tienen problemas en subir de ligas , por que tu no? Por que insistes en que no juegan a tu altura? el sistema te pone normalmente con 2 divisiones abajo o 3, y 3 arriba , dependiendo de si eres un jugador con un buen win ratio o no, si eres de mal winratio o estas en racha de derrotas, te emparejarán para abajo y es normal, ahora en vez de quejarte en este foro  por algo tan ridículo por que no te propones mejorar? A mi me encantaría estar en tu lugar, aprovecharía para mejorar mucho, ya que ahí toca muy buena gente que al menos te lee bien las Teamfights y las luchas por objetivos, a veces me enfrasco con eso y digo también que los bronce II y 3 no juegan a mi nivel(soy b1), pero a diferencia de ti,  NO  me tocan, eso es simple: tengo un buen winratio y entonces siempre me matchmakean con gente silver IV para arriba, que no es mucho, aun asi me cuesta ganar porque justamente, caigo en esos errores durante algunas partidas de creerme mucho, y esta mal porque te vuelve algo toxico, pero te repito: donde está la gracia de que lo sigas haciendo a estas alturas? No vas a subir de oro iv si seguís asi amigo, yo hace muy poco que empece, desde octubre del año pasado, y pase por las ligas de la gente que según vos, no juega a tu nivel(silver II , I y III), y no jugaba nada mal, solo me costaba horrores la fase de líneas pero que por lo demás, ni un reproche, lo hacia bien el resto de  la partida, las rotaciones, las tf, los objetivos, el farm, todo bárbaro y ni una queja tengo de esa gente de silver III, fueron las mejores y mas técnicas rankeds que he jugado en league of legends hasta ahora, eran feeders algunos, pero super buena onda en clasificatorias, había algún que otro toxico, pero no siempre, a veces también el toxico era yo, eso es otro tema\n{{sticker:slayer-jinx-wink}}","replies":[{"poster":"Agustin DGN","date":"2016-05-14T23:50:46.792+0000","up_votes":1,"down_votes":0,"body":"Haber como te vuelvo a explicar y espero no lo tomes a mal, el tema del emparejamiento, ya se que si estoy oroV la gente silver I,II,III no hay mucha diferencia de jugabilidad al igual que oro IV,III,II, juego hace 1 año y medio al lol no soy como esos que vos decis que usan champs faciles como kata y garen (mira el perfil si no me crees) no hace falta que le expliques nada no es por creerme bueno en el juego sino que ya lo se son cosas que se aprenden con el tiempo, perdiendo y ganando. Siempre quieren explicar y recalcar lo mismo es lo mismo que vos un post y te digan wardea farmea hace objetivos etc, deja de lado el tema de estrategia... si sos b1 todavia tenes muchas partidas por delante, nose como hartelo entender, no me quejo de que me toquen bronces o silvers en mi team me quejo de su jugabilidad.espero que nunca te pase en tus partidas que al minuto 5 ya  allan perdienso por 3 kills abajo y eso es el comienzo al trascurso de la partida sigen dando kills sin parar, simpre dicen lo mismo(en late ganamos) y eso es lo que no entienden que no todas las partidas se llegan a late, se pierde en early y aunque llegemos a late y estemos todos full build son las mismas peraonas con full build que sigen jugando como cuando empezo la partida se pierde igual porque no saben lo que es jugar en equipo ni hace falta que te lo explique.Pensalo un poco, ponete en mi lugar 7 de cada 10 partidas con este tipo de gente. Y no es por hacer el bueno pero yo siempre suelo ganar la libea que juego Y NO ES POR HACERME O CREERME EL MEJOR, entende eso, las partidas que gano linea suelo perder porque toca gente afk trolls etc. No te digo que siempre gano linea obvio que pierdo partidassino no estaria aca escribiendo estaria en platino diamante por ejemplo.pensa que si yo gana4a todas las veces que ganara linea no estaria aca, y no miento digo la verdad agregame y jugamos no tengo problema de mostrarte no pierdo nada. (Te resumo un poco todo, gano linea osea juego bien en mi linea, pierdo porque uno que otro jugador hace algo mal, entonces juego bien en mi linea para despues perder la partida, entendes o no?) Espero puedas entender de una vez porque ya no se como explicartelo, pensalo.","replies":[{"poster":"TheSystruction","date":"2016-05-27T14:08:29.542+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Agustin DGN,realm=LAS,application-id=PJAKt7ph,discussion-id=RNY1V0Fy,comment-id=000100000000000000000000,timestamp=2016-05-14T23:50:46.792+0000)\n>\n> Haber como te vuelvo a explicar y espero no lo tomes a mal, el tema del emparejamiento, ya se que si estoy oroV la gente silver I,II,III no hay mucha diferencia de jugabilidad al igual que oro IV,III,II, juego hace 1 año y medio al lol no soy como esos que vos decis que usan champs faciles como kata y garen (mira el perfil si no me crees) no hace falta que le expliques nada no es por creerme bueno en el juego sino que ya lo se son cosas que se aprenden con el tiempo, perdiendo y ganando. Siempre quieren explicar y recalcar lo mismo es lo mismo que vos un post y te digan wardea farmea hace objetivos etc, deja de lado el tema de estrategia... si sos b1 todavia tenes muchas partidas por delante, nose como hartelo entender, no me quejo de que me toquen bronces o silvers en mi team me quejo de su jugabilidad.espero que nunca te pase en tus partidas que al minuto 5 ya  allan perdienso por 3 kills abajo y eso es el comienzo al trascurso de la partida sigen dando kills sin parar, simpre dicen lo mismo(en late ganamos) y eso es lo que no entienden que no todas las partidas se llegan a late, se pierde en early y aunque llegemos a late y estemos todos full build son las mismas peraonas con full build que sigen jugando como cuando empezo la partida se pierde igual porque no saben lo que es jugar en equipo ni hace falta que te lo explique.Pensalo un poco, ponete en mi lugar 7 de cada 10 partidas con este tipo de gente. Y no es por hacer el bueno pero yo siempre suelo ganar la libea que juego Y NO ES POR HACERME O CREERME EL MEJOR, entende eso, las partidas que gano linea suelo perder porque toca gente afk trolls etc. No te digo que siempre gano linea obvio que pierdo partidassino no estaria aca escribiendo estaria en platino diamante por ejemplo.pensa que si yo gana4a todas las veces que ganara linea no estaria aca, y no miento digo la verdad agregame y jugamos no tengo problema de mostrarte no pierdo nada. (Te resumo un poco todo, gano linea osea juego bien en mi linea, pierdo porque uno que otro jugador hace algo mal, entonces juego bien en mi linea para despues perder la partida, entendes o no?) Espero puedas entender de una vez porque ya no se como explicartelo, pensalo.\n\neste b1 por lo que veo tiene mas paciencia y usa campeones mas difíciles que tu xD No tenes que ganar línea Orito, no entendes? son ligas bajas, si no sabes jugar el mid ni el late game, te van a romper el tuje, tengas o no tengas team, yo no hace mucho que juego, pero te vuelvo a recalcar que por algo me los banque el año pasado a  ustedes los oritos en las rankeds cuando era silver, por que se centran muchísimo en la fase de líneas y lloran como nenas durante el lategame, si algo sale mal en la fase de líneas, en vez de suicidarte farmea, intenta atrasar la partida, roba dragones, baron, juga un poco a lo Cholo Simeone campeón, garcalos si no podes contra ellos, no tires surrender a lo pendejo para intentar jugar otra partida a ver si la ganas fácil y rápido, se garka, hijo de puta tenes que ser, que eso te va a venir bien, teniendo en cuenta que los personajes mas rotos son OFF TANK, en el meta en el que estamos lamentablemente el late sigue siendo un asco como la S5, aprovecha eso. Tal vez un poco duro, me disculpo, pero esa es la razón por la que pierdes tus partidas, no siempre que se fedea  a un enemigo o 2, se pierde, es un tema de composición + tiempo y recursos empleados y de que forma han sido empleados , asigna bien tus recursos, estate al tanto de cuando es oportuno comprar visión y cuando no lo es, estate alerta a los ítems de tus aliados y compara daño y habilidades del enemigo y de tu team, mira el botoncito verde que te indica cuando tienen la ulti disponible tu team, fíjate y timea el tiempo del destello entre tus aliados y enemigos, no te adelantes demasiado al pushear, investiga bien a los campeones enemigos, los cd. Todo esto aplicarlo en partida es un engorro, pero si lo consigues ganaras mas que seguro, por que esta gente de estas ligas bajas no acostumbra pensar demasiado, ya si con esto aun así no subes tienes unas manos de madera con alguna dilexia como es mi caso, tengo un dedo meñique que dios mío, se me mueve solo  esta muy chueco pero bueno, aun así se puede subir un poco mas, confío en mi capacidad para resolver estas situaciones, tente mas fe, se mas optimista, y no flamees y desmoralices a todos, y sacáte el orgullo , que ese es un defecto grandísimo que tienen los oros que no los deja subir. \nSube mi friend , sube, no te atasques en ese pensamiento como todo el mundo","replies":[]}]}]}]}]}]}]}]}