{"poster":"Lord Kampfzwerg","date":"2017-01-22T12:10:32.139+0000","title":"Suche Senior Clan/Team/Club","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hi,\r\nsuche ein netten Clan, bzw einfach nette Mitspieler, mit gehobenen ALter. Bin selbst 30+ und w&uuml;rde mich freuen Gelegenheitsspieler in &auml;hnlichem Alter zu finden.\r\n\r\nAm besten einfach in-game Anfrage schicken.\r\n\r\nGr&uuml;&szlig;e","replies":[{"poster":"NGC Polyxena","date":"2017-01-22T12:51:54.857+0000","up_votes":1,"down_votes":0,"body":"Hallöchen Kampfzwerg,\n\ndie ü18 Community \"Nerds Go Casual\" setzt sich aus Spieler/innen zwischen 18 und ü40 zusammen. Neben League of Legends werden bei uns außerdem Spiele wie **Overwatch**, **Minecraft**, **Trouble in Terrorist Town** und **Pen & Paper** gespielt. \n\nKosten werden bei uns keine erhoben und die einzige \"Verpflichtung\", die wir von unseren Mitgliedern erwarten ist das aktive Interesse an der Community. Mit Motivation und Ehrgeiz leiten wir diese Community, sodass Copy/Paste Texte und ähnliches bei uns nicht anzutreffen sind. Jedes einzelne Mitglied wird bei uns respektiert und herzlich aufgenommen, solange es sich zu benehmen weiß und der Community nicht schadet.\n\nDoch genug vorgeplänkel, ich lasse dir unsere Vorstellung da und du kannst dir überlegen ob du den Nerds eine Chance gibst ;) --> \n[♠ Nerds Go Casual ♠ ü18 Multigaming Community lädt zum Zocken ein ♠](http://boards.euw.leagueoflegends.com/de/c/clans-teams-de/LXq4AGV4-oa-nerds-go-casual-oa-a18-multigaming-community-laadt-zum-zocken-ein-oa) \n\nLiebe Grüße,\nP0lyxena | Julia","replies":[]},{"poster":"fess123","date":"2017-01-22T12:27:28.193+0000","up_votes":1,"down_votes":0,"body":"Hi Lord Kampfzwerg,\n\ndu hast es satt alleine in der Flex Queue zu spielen und suchst nun ein Team oder benötigst einfach nur Gleichgesinnte? Aequilibritas eSports hilft dir bei der Erstellung eines Teams und bei der Suche nach Mitspielern, sodass du hoffentlich schnell in einem Team unter gebracht wirst, aber dir sind natürlich auch spaßige Abende garantiert!\n\nHier gehts zu unserem Vorstellungsthread: [Aequilibritas eSports sucht Mitglieder | Community und eSports | LoL, CS:GO, Overwatch etc.](http://boards.euw.leagueoflegends.com/de/c/clans-teams-de/EB1PsvTk-aequilibritas-esports-sucht-rekruten-community-esports-organisation)\n\nÜber diesen Link kannst du natürlich auch direkt zur Aufnahme gelangen: [Bewerbungsformular](http://aequilibritas-esports.de/index.php/Application/)\n\nUnsere Community existiert bereits seit 2009. Wir würden uns natürlich über dein Interesse freuen und eventuell sogar über die Teilnahme an unserer Gemeinschaft. :)","replies":[]}]}