{"poster":"Bradilz","date":"2016-08-08T22:29:22.935+0000","title":"Malzahar Good jungle build?","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":0,"body":"So I&#039;ve been playing the new rework malzahar{{champion:90}}  in the jungle thanks to his great kit using his W and his Ult for good ganks and I&#039;ve got him to level 5 using the recommended items but I was wondering if anyone has some good Malzahar{{champion:90}}  jg builds I could try for example what smite{{summoner:11}}  \n\nThese are my runes that I am currently using \nMagic Pen\n+6.12\nArmor\n+4.68\nMagic Resist\n+1.73\nAbility Power\n+17.99\nCooldown\n-1.33%\n\nand i am currently using the \nStormriders surge \nkeystone \n\n(First post so not to sure how to add pictures)\n\nThanks","replies":[{"poster":"Nightjar","date":"2016-08-09T01:19:30.873+0000","up_votes":1,"down_votes":0,"body":"Unfortunately they nerfed the hell out of jungle malzahar so his clear speed is too slow now and so he doesn't hit specific levels as fast as most meta junglers, and he really needed that early lvl6 for his devastating ganks since he doesn't really have a gapcloser or hard cc. They've murdered jg malazahr because tbh taking drake at lvl3 solo was ridiculous; so he's not really good atm. If you really want to go spaceaids jungle though you'll probably want to go with more ad runes going:\n\nFor an AP build, take a 3flat ad marks, 6 magic pen marks, 9 scaling hp seals, 3 magic resist glyphs, 6 scaling cdr glyphs, 2 flat ap quints and 1 movespeed quint.\n{{item:3706}} and then buying {{item:3144}} and {{item:1001}} \nThen finish your jungle item and finish the build.\n{{item:1402}} {{item:3146}} {{item:3116}} {{item:3152}} {{item:3165}} {{item:3020}} \nThis build is for teamfights, scales really well and has some strong pick potential in fights. Go 12-18-0 taking typical lategame mage masteries taking thunderlords for early gank potential or maybe stormraiders for lategame.\n\nFor an AD build it's a little simper, taking typical ad assassin runes with armour pen marks, flat armour seals, flat mr quints, 3 flat ad quints, rushing your warrior ect...\n{{item:1400}}{{item:3142}} {{item:3071}} {{item:3060}} {{item:3512}} {{item:3158}}  \nThis build pushes like an udyr on steriods and has alot of early jungle and objective control. Go 18-12-0 taking fervour of battle and maxing damage in the fury tree.\n\nAnyways that's my best attempt at a build what do you think? The early Cutlass on the ap build helps alot with ganking and sustaining through the jungle imo.","replies":[{"poster":"Bradilz","date":"2016-08-09T02:51:03.632+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nightjar,realm=OCE,application-id=FjGAIbRv,discussion-id=ovO6A3vi,comment-id=0000,timestamp=2016-08-09T01:19:30.873+0000)\n>\n> Unfortunately they nerfed the hell out of jungle malzahar so his clear speed is too slow now and so he doesn&#x27;t hit specific levels as fast as most meta junglers, and he really needed that early lvl6 for his devastating ganks since he doesn&#x27;t really have a gapcloser or hard cc. They&#x27;ve murdered jg malazahr because tbh taking drake at lvl3 solo was ridiculous; so he&#x27;s not really good atm. If you really want to go spaceaids jungle though you&#x27;ll probably want to go with more ad runes going:\n> \n> For an AP build, take a 3flat ad marks, 6 magic pen marks, 9 scaling hp seals, 3 magic resist glyphs, 6 scaling cdr glyphs, 2 flat ap quints and 1 movespeed quint.\n> {{item:3706}} and then buying {{item:3144}} and {{item:1001}} \n> Then finish your jungle item and finish the build.\n> {{item:1402}} {{item:3146}} {{item:3116}} {{item:3152}} {{item:3165}} {{item:3020}} \n> This build is for teamfights, scales really well and has some strong pick potential in fights. Go 12-18-0 taking typical lategame mage masteries taking thunderlords for early gank potential or maybe stormraiders for lategame.\n> \n> For an AD build it&#x27;s a little simper, taking typical ad assassin runes with armour pen marks, flat armour seals, flat mr quints, 3 flat ad quints, rushing your warrior ect...\n> {{item:1400}}{{item:3142}} {{item:3071}} {{item:3060}} {{item:3512}} {{item:3158}}  \n> This build pushes like an udyr on steriods and has alot of early jungle and objective control. Go 18-12-0 taking fervour of battle and maxing damage in the fury tree.\n> \n> Anyways that&#x27;s my best attempt at a build what do you think? The early Cutlass on the ap build helps alot with ganking and sustaining through the jungle imo.\n\nOk thanks I will try both","replies":[{"poster":"Nightjar","date":"2016-08-09T09:47:22.924+0000","up_votes":1,"down_votes":0,"body":"feel free to mess around I just put what made sense with his abilities and what I've seen other malzahar's build and do well with. I don't actually have much experience with malzahar so thiese builds can probably be improved but personally I think he feels better going mostly ap or ad, each playing a bit differently. I don't know how hybrid would play or if it's actually any good, personally I feel it's not as good as committing to maximising one of his damage types. Also I haven't seen protobelt malzahar but I'd imagine it would be pretty interesting, so get back to me on how that goes.","replies":[]}]}]},{"poster":"BrotherHood3192","date":"2016-08-09T04:18:11.915+0000","up_votes":1,"down_votes":0,"body":"I woke up.\nOnly to see this.\nMalzahar is one of my favorite champions.\nSo I took the chance.\nGod praise Mount Olympus.\n\nNo. I didn't go to church today.\n\nBut I am really hungry, so I'll just tell you what I would build on Malzahar.\n\n\nIf you like your tea with milk and 2 sugars, freshly brewed from London, then build this.\n\n{{item:1402}} {{item:3020}} {{item:3165}} {{item:3151}} {{item:3046}} {{item:3022}} {{item:3071}} \n\nOk. Let me explain.\n\nBasically, Malzahar isn't a very mobile champion. His passive makes up for that, but in the early game, it is on such a high cooldown, that you have to be careful with how you use it. Master the art of side-stepping.\n\nContrary to popular belief, malzahar is a pretty hard champion(no pun intended). He comes under the category of knowledge based champions, champions that are more based on knowing their cooldowns, when to use his abilities etc.\n\nPractice that, on your on your way to being a very good malzahar.\n\n\nNow to the build.\n\nMy ancestors over Facebook always said I knew what other people were thinking, so you probabaly think this build is stupid and that i'm another professor milk wanna be.\n\nTruth is\n\nI am.\n\nRunic echoes is a must. moving on.\n\n{{item:3165}}  Is another must on him. If your opponent dies from your e, malefic visions or what ever, you get 2 percent of your mana back. With this item, it is added up to 20 percent, allowing you to stay in fights a lot longer than usual, since malzahar's mana costs are quite high.\n\n20 cdr is always good, too. \n\n{{item:3151}}  Now, this is where things start to get tricky. Liandrys does damage over time when you use an ability but that increases if the target has impaired movement. That's where the frozen mallet comes in. You'll be slowing your enemy with the mallet, liandrys will proc doing a bit more damage, and done. You will be recruited by your grandmother's LCS team in no time. You can thank me in advance.\n\n\nOk. \nGive your eyes and mouse a rest, and refrain from scrolling down. \nno i'm kidding.\n\nPhantom dancer is another great item. If you think I am wrong, and you don't want a chance for you to crit, then grab a youmuus idc.\n\nPhantoms passive will let him move through units, as well as take 12 percent less damage from the last hit on the enemy champion(10 sec cooldown).\n\nSo his passive is off, you take less dmg etc. yeah yeah gg gj u won kk moving on.\n\nLast but not least, is black cleaver. If you have read this far, then...thanks. This ain't the Ellen show, I ain't givin' you guys any money.\nBlack cleaver. When you attack, bonus movement speed, which allows u to kite from a safe distance, reduces armour so voidlings can do more dmg and there you go. \n\nAll these items work well together, but at a first glimpse you won't see it.\n\n\n\nP.S\n\n\nGo blue or red smite.","replies":[]}]}