{"poster":"PSOTG VuZko","date":"2017-06-24T01:41:27.180+0000","title":"Falsa publicidad en los \"Orbes del Caos\"!!!!!","subforum":"Off-topic y temas personales","up_votes":2,"down_votes":14,"body":"En el sistema de misiones con las que ganas piezas del caos. La podes gastar en un orbe que supuestamente te da skins de legado mas piezas de caos adicionales, dos gemas o vayne roba almas. Cuestion que me siento re contra afanado porque no me toco nada de eso y encima me dieron una skin tristisimas Horriiiiiibleeeeeeeee del un personaje que ya es un asco que mas la skin te da un sida {{champion:80}}","replies":[{"poster":"Ingratitud","date":"2017-06-24T01:55:20.606+0000","up_votes":2,"down_votes":0,"body":"Hola xXShasinXx, como estas? Vayamos por parte:\n\n1.  **¿Qué es un orbe del Caos?**\n_\"El orbe del Caos es exclusivo del evento y contiene un fragmento de aspecto de legado y un **50% de probabilidad** de obtener botín adicional. Si tu orbe activa un botín adicional, tendrás una posibilidad de obtener una cantidad aleatoria de piezas del Caos, dos gemas o el fragmento de aspecto exclusivo de Hextech, Vayne Robaalmas.\"_ \nOsea puede que te toque algo más que una skin, puede...\n1. Escibir un titulo todo en mayúscula va contra las normas del foro, te pueden sancionar por eso, te sugiero xXShasinXx que cambies el titulo a minúscula y te evites problemas.\n\nFuentes: [Evento VS](http://las.leagueoflegends.com/es/featured/events/vs-2017)","replies":[{"poster":"AlienSkc","date":"2017-06-24T06:34:32.266+0000","up_votes":1,"down_votes":1,"body":"Vayamos*, realmente es tan facil tener admin? XD","replies":[]}]},{"poster":"Excorpion","date":"2017-06-24T01:55:03.329+0000","up_votes":2,"down_votes":0,"body":"> **Q: ¿Qué es un orbe del Orden y del Caos?**\nR: **El orbe del Caos** es exclusivo del evento y contiene un fragmento de aspecto de legado y un 50% de probabilidad de obtener botín adicional. Si tu orbe activa un botín adicional, tendrás una posibilidad de obtener una cantidad aleatoria de piezas del Caos, dos gemas o el fragmento de aspecto exclusivo de Hextech, Vayne Robaalmas.\n\n> **R: El orbe del Orden** es exclusivo del evento y contiene un fragmento de aspecto de legado y un 50% de probabilidad de obtener botín adicional. Si tu orbe activa un botín adicional, tendrás una posibilidad de obtener una cantidad aleatoria de piezas del Orden, dos gemas o el fragmento de aspecto exclusivo de Hextech, Annie Hextech.\n\nhttp://las.leagueoflegends.com/es/featured/events/vs-2017#what-is-an-orb","replies":[]},{"poster":"Shilindio Yanqui","date":"2017-06-24T02:01:45.595+0000","up_votes":2,"down_votes":1,"body":"Estafa como el 76% de los eventos que hace riot games... que más esperas, si dice claramente en la descripción **Fragmento de legado**","replies":[]},{"poster":"Yellow Sphere","date":"2017-06-24T18:09:06.877+0000","up_votes":1,"down_votes":0,"body":"¡Jajaja! Este chabón es un genio.","replies":[]},{"poster":"Kyousuke","date":"2017-06-24T02:11:22.577+0000","up_votes":1,"down_votes":0,"body":"es la POSIBILIDAD de que te toque no es que te toca si o si ._.","replies":[]},{"poster":"Necrosis","date":"2017-06-24T02:02:25.912+0000","up_votes":1,"down_votes":0,"body":"Compra otro más a ver qué te sale y contanos.","replies":[]}]}