{"poster":"Crystalizee","date":"2016-12-07T06:18:32.439+0000","title":"Beta Client Do not Download (Upgrade)","subforum":"[ARCHIVED] Help & Support","up_votes":2,"down_votes":0,"body":"I recently reinstalled league onto my computer and pressed that upgrade to beta button on the prompt but nothing happens. \r\n\r\nAnd when I press the play button, a message pops up saying \"please reinstall league alpha client to start again.\"\r\n\r\nI tried restarting my client and now the prompt doesn't even show. I have to reinstall league to have the upgrade prompt to show again.\r\n\r\nHow can I upgrade to beta client.","replies":[{"poster":"Targons Blade","date":"2016-12-08T05:41:21.888+0000","up_votes":1,"down_votes":0,"body":"This specific error crops up when something went wrong during the patching process. You'll have to complete a clean reinstallation of League by specifically following [**this guide**](https://support.riotgames.com/hc/en-us/articles/202539040-Reinstalling-League-of-Legends) in order to resolve this.\n\nLet me know if you have any questions.","replies":[{"poster":"Crystalizee","date":"2016-12-09T10:10:53.065+0000","up_votes":1,"down_votes":0,"body":"Ok so i followed the guide and used hextech repair to re-install league of legends. The beta client download and update started fine but the number is stuck on 87% for like 4 hours and when I hover my mouse on it, it says \"Applying Patches ETA 5 min\". \n\nAnd when I close my client, im bk to ground zero.\n\nAny solutions?","replies":[{"poster":"Targons Blade","date":"2016-12-12T00:15:07.409+0000","up_votes":1,"down_votes":0,"body":"Issues at this point in patching usually point towards an *unstable connection* to our patching servers. Working through our [**connection guide**](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues) typically resolves these issues, so I recommend working through those steps.\n\nI hope this fixed the problem!","replies":[]}]}]},{"poster":"Da Mad Hatter","date":"2016-12-07T20:35:23.596+0000","up_votes":1,"down_votes":0,"body":"Same problem here, have tried it 4 times now this week. please fix this problem.","replies":[]}]}