{"poster":"Catekit","date":"2019-12-23T22:56:21.473+0000","title":"Pareri su Yumi e adc","subforum":"Campioni e gameplay","up_votes":1,"down_votes":0,"body":"Ciao! Premetto che non gioco da molto, ma sto cercando di diventare una main adc e come secondario support. Vorrei un parere da gente più esperta su yumi e gli adc adatti a lei. Ci ho giocato contro 2 volte con vittoria e una insieme con sconfitta. In quest'ultima ero contro jhin e il supp sinceramente non ricordo ma era di tipo offensivo. Io usavo caytlin e sembrava di essere 1 contro 2... Ho passato tutta la partita ad essere criticata e flammata dal mio supp quando tutto ciò che faceva era legarsi a me, dando il 25% di attacco in più. Ok io so di non essere il massimo ma sono agli inizi e ci sta, ma davvero era una situazione ingestibile tanto che mi ha mollata ad una certa, nonostante fosse stata uccisa parecchie volte. Quindi la mia domanda alla fine é se é un buon support e in caso  con chi é forte o contro chi é debole, anche in modo da evitare altre situazioni in futuro che ti fan passare la voglia di giocare.... Grazie :)","replies":[{"poster":"jirogua","date":"2019-12-24T13:05:04.445+0000","up_votes":1,"down_votes":0,"body":"io personalmente come support  ti consiglio di puntare su champ con molti cc e tank leona nauti swain( se serve dmg ) e janna nami soraka quando hai un team comp  decente che possa darti copertura in prima linea !{{sticker:slayer-jinx-wink}}  per yumi non è consigliata per i vari nerf ma se hai un jungler buono con ottimo dmg che ganka  bot puoi fare engage di ulti e Q sopratutto in early per dare feed al tuo adc !{{champion:119}}  poi ci sono altre cose da tenere conto ma questo è più o meno su come la penso in bot al momento ! XD ps.se non ci credi guarda la mia crono di partite !{{sticker:slayer-pantheon-thumbs}} ","replies":[{"poster":"Catekit","date":"2019-12-25T22:45:24.747+0000","up_votes":1,"down_votes":0,"body":"Ecco devo fare pratica con tank e assassini. Per ora uso soprattutto maghi o tiratori. Proverò. Grazie!","replies":[]}]},{"poster":"V3LK0ZMAST3R","date":"2019-12-24T22:52:57.027+0000","up_votes":1,"down_votes":0,"body":"Yumii ha un early game davvero tanto debole, quindi idealmente va giocata con una bot premade dove vi accordate sullo stile di gioco da tenere. Arrivata in late poi però diventa indecente,specialmente abbinata a un hypercarry (se ad esempio c'é un master yi ti Piazzi su di lui quando ha il 3 item e vince il game da solo).  Da evitare assolutamente quando il supporto avversario ha hard engagé (blitz,Leona e simili) e con adc che soffrono molto early game. ","replies":[{"poster":"Catekit","date":"2019-12-25T22:44:26.010+0000","up_votes":1,"down_votes":0,"body":"Grazie mille!","replies":[]}]},{"poster":"Crαzy Diαmond","date":"2019-12-23T23:19:19.721+0000","up_votes":1,"down_votes":0,"body":"Ciao! Anche io ammetto di avere tutt'ora problemi quando gioco con Yuumi, matchups o meno... diciamo che è un champ che sembra relativamente semplice, ma la gente il 70% delle volte si lega a te e da 0 pressure, portandoti poi a morte e perdita della lane certa. Posso dirti che Yuumi soffre molto contro champ che conferiscono più heal (Soraka, Sona,Taric &amp; co), soffre contro Nautilus che può bloccarle la w (same Thresh, Lux con la Q, Zyra, Morgana, Alistar che la ingaggia etc) e diciamo che dunque richiede un minimo di esperienza, non aspettarti di poter contare su ogni giocatore occasionale che trovi.\nOltre ciò, tornando ai matchup, Yuumi va molto bene con gli ADC indipendenti, ossia Vayne, Kai'sa, Ezreal, Twitch, MF (combate di ult) etc..\nDiciamo che -a mio avviso- Cait/Yuumi è una bot orribile, considerando che Cait vuole pushare per prendere la torre bot, e con 0 pressure non può farlo. Dovresti giocare safe under tower e farmare e basta, pokkando di tanto in tanto e aspettando il JNG.... e se non arriva ciaone.\nSe ti piace giocare Veigar, anche Veigar/Yuumi è una bot considerabile. :) se hai altre domande chiedi pure, ti aiuto volentieri","replies":[{"poster":"Catekit","date":"2019-12-23T23:33:07.440+0000","up_votes":1,"down_votes":0,"body":"Grazie mille! Va beh mi sono accorta ora che non ho azzeccato un nome ahah. Allora ne approfitto. Mi trovo molto bene con janna e so che se si é bravi si riesce pure a essere parecchio aggressivi. Anche questo dipende dall'adc o hai consigli su come migliorarla in modo indipendente? Ho guardato anche alcuni gameplay e varie guide. Per ora la uso soprattutto come supp curatrice e per pushare; solo a volte mi capita qualche kill.","replies":[{"poster":"Crαzy Diαmond","date":"2019-12-25T14:46:16.905+0000","up_votes":1,"down_votes":0,"body":"Mhh.. per giocarla in modo aggressivo dipende molto dal matchup, diciamo che se sei per esempio in un matchup contro champ che attaccano da vicino (Leona, Braum etc) puoi metterti delle rune aggressive apposta per abusarli (Comet, manaflow, absolute focus(consiglio sempre il celerity per la passiva tbh anziché questo), e scorch. ramo secondario domination, taste of blood e relentless hunter, due adaptive force + health/armor in base sempre al matchup), puoi pokkare di auto e w, se ti provano ad ingaggiare fai una Q e ti salvi. Un trick molto carino che puoi fare per forzare engage poi ora è passare da dietro i nuovi muretti della bot quando il jng ti ganka, ed ultare per rimandare verso i tuoi compagni i nemici.\nSe vuoi dare fastidio contro melee, ti consiglio di pokkare mentre cercano al lvl1 di proccare il relic/last hittano minions. se mandi un alistar con meno di metà hp, è probabile che al 2 non possano ingaggiarvi facilmente.\nL'adc è relativo, può voler giocare passivo e last hittare e basta, ma ciò non vieta a te di tirare un auto sull'adc nemico quando last hitta. Ovviamente devi sempre prestare attenzione al positioning, se sei contro un Blitz e ti prende durante è un trade è morte sicura, specialmente se hai un ADC da late che pur traddando non può fare miracoli (vayne che senza i primi oggetti non fa nulla, per esempio).\nDipende molto dall'esperienza che hai col role in generale comunque, più giochi supp più migliori.. non è sempre  necessario essere aggressivi comunque, eh! In alcuni matchup ti conviene stare molto indietro, ma ricorda che l'importante è dare abbastanza pressure per far farmare il tuo ADC in modo tranquillo, nothing more nothing less.\nPuoi essere stressante per i nemici anche giocando Sona (per dire eh), traddi da un positioning safe e non rischi nulla.\nNon so se hai mai visto qualche gameplay di Janna di \"Paolocannone\", ma imparai da lui ai tempi, ti consiglio di guardare un po' come gioca, anche guardando streamers puoi migliorare. Se vuoi mettere più pressure in lane ti consiglio di cercare di stare nei bush non wardati, al limite puoi pure comprare una pink e metterla dentro per fargli venire l'ansia sul dove stai!\nSe posso darti un consiglio, ti consiglierei di imparare a giocare anche Karma, pick assolutamente valido col quale hai pure più potenziale a livello di engage ed un poke super fastidioso.","replies":[{"poster":"Catekit","date":"2019-12-25T22:43:55.699+0000","up_votes":1,"down_votes":0,"body":"Ok proverò grazie ancora!","replies":[]}]}]}]}]}