{"poster":"XxRhmnxX","date":"2019-07-05T00:26:40.078+0000","title":"2 wochen gebannt nur wegen 1 spiel ?","subforum":"Spielerverhalten & Moderation","up_votes":3,"down_votes":8,"body":"Moin Freunde der Sonne,\r\ndas hier soll kein mimimi sein oder so, ich will nur eure Meinung dazu hören, undzwar spiele ich seit tft live server release, nur noch tft, davor  (seit nem Monat, hatte 1 Jahr lol Pause) SoloQ ranked gedaddelt, in einem davon war ich bisschen toxisch drauf und hab was unschönes (2 Beleidungen), die natürlich nicht angebracht waren, rausgehauen. Eigentlich benutze ich den chat nie, aber da hab ich halt Fehler gemacht und bin auf die Beleidungen eingegangen und hab zurück beleidigt. Grade eben nach einer entspannten Tft runde kam halt die schlechte Nachricht, dass ich gebannt wurde, ganze 14 Tage, keine rankeds, kein tft, ehre stufe 2 weg usw. und als info stand halt, dass ich in dem oben genannten Spiel die 2 Beleidigungen in einem Spiel geäußert habe. Da frage ich mich, könnte man es nicht mit nem Chat bann bzw. einer Verwarnung lösen, man sollte auch bedenken, dass ich 1 Jahr lang kein LoL gespielt habe und davor auch keine Bans oder so hatte. Jetzt seid ihr gefragt, wie würdet ihr es lösen ? Findet ihr es gerecht ?","replies":[{"poster":"SuicidePlank","date":"2019-07-05T02:18:56.155+0000","up_votes":9,"down_votes":1,"body":"Jup, hast ,,Faggot\" geschrieben, das reicht aus weil man das einfach nicht schreiben sollte.\nWenn du selber weißt das es unangebracht war, aktzeptier  auch die Quittung die du dafür bekommst.","replies":[]},{"poster":"XxRhmnxX","date":"2019-07-05T02:02:32.241+0000","up_votes":2,"down_votes":1,"body":"hier der chatlog:\n\nhttps://ibb.co/C7sLFY9","replies":[{"poster":"RM Heartmeander","date":"2019-07-05T03:47:00.534+0000","up_votes":5,"down_votes":0,"body":"Strafe absitzen, mehr kannst du nicht machen da die Strafe gerechtfertigt war.\nRiot fährt 0 Toleranz gegenüber Rassismus, Sexismus, Schwulenfeindlichkeit und Todesdrohungen. (vielleicht habe ich noch was vergessen)\n\nDaher Strafe gerechtfertigt, ergo bleibt sie.\nIch kann nur empfehlen dass du wie bisher nicht's im Chat schreibst, denn nachher kann schon ein report xyz zum Perma führen.\nUnd die Zeit wann die Strafstufe runtergeht (falls sie runtergeht) wird in Ingamezeit gemessen, 1 Jahr nicht spielen heisst nächstes Spiel wird genau gleich gewertet wie wenn du nie ne Pause gemacht hättest.\nAm besten nur gg wp, wp, gj, nice nutzen, also positive Sachen.\nWas nicht positiv ist, nicht schreiben.\n\nPS: Das war wohl der kürzeste Chatlog, den ich je gesehen habe^^","replies":[{"poster":"XxRhmnxX","date":"2019-07-05T09:04:27.885+0000","up_votes":4,"down_votes":0,"body":"ja du hast recht. Der Acc ist mittlerweile mehr als 5 Jahre alt und ich will es ungern verlieren, daher werde ich kaum bis garnicht mehr chatten. Schade ist nur, dass ich die Ehrenstufen verliere und somit auch die Chance ein PBE-Acc zu bekommen, aber da steckt man halt nicht drin. Danke trotzdem für deine ausführliche Antwort.","replies":[{"poster":"Veezey","date":"2019-07-06T12:19:29.685+0000","up_votes":2,"down_votes":0,"body":"Du darfst schon chatten, nur solltest du jetzt auf jeden Fall alles vermeiden was negativ ist. Mach auf jeden Fall vom Mute Button gebrauch, wenn einer meint dich oder andere zu Flamen.","replies":[]},{"poster":"e621 Rengar","date":"2019-07-05T11:11:49.544+0000","up_votes":1,"down_votes":1,"body":"Vertrau das was Raystin gesagt hat nicht wort für wort.\n\nNiemand weiss genau wie lange man aktiv spielen muss damit die Strafe verringert wird. \nEs gibt die möglichkeit aber wie bereits gesagt weiss keiner wie lange","replies":[{"poster":"Raystlin82","date":"2019-07-06T01:38:26.582+0000","up_votes":2,"down_votes":0,"body":"ich habe nicht behauptet, dass ich genau weiss wie lange es dauert. ich habe geschrieben, es dauert ca. (ungefaehr, so in etwa, wenn du noch mehr synonyme brauchst, sag bescheit) ein halbes jahr dauert bei aktivem spielen. und ich hab diese angabe nicht einfach so aus der luft gegrifen. es gibt hier im forum mindestens einen fall, wo jemand nach einem 14 tage bann, ein halbes jahr spaeter erneut einen 14 tage bann bekommen hat.\n\nvielleicht sollte man eher nicht dem vertrauen, was du von dir gibst? du scheinst doch hier eher derjenige zu sein, der keine ahnung hat.","replies":[]}]}]}]}]},{"poster":"Raystlin82","date":"2019-07-05T10:11:28.366+0000","up_votes":4,"down_votes":0,"body":"nach so ca. halben jahr bei aktivem spielen wird die strafe zurueckgesetzt. waerend dessen darfst du dir absolut nichts leisten, nicht mal kleinigkeiten. schreib nichts was auch nur im entferntesten negativ ausgelegt werden kann. besser noch, schreib einfach garnichts mehr. private dialoge mit leuten aus deiner fl zaehlen nicht dazu - da darfst du schreiben was du willst.\n\nich find's zwar einbischen uebertrieben, dass du gleich einen 14 tage bann dafuer bekommst, aber so sind nun mal die regeln. \"faggot\", \"kys\" und jegliche abwandlungen dergleichen fuehren direkt zu einem 14 tage bann bzw. zu einem perma bann, wenn es bereit einen 14 tage bann gab.\n\nohne das \"faggot\" und \"fag\" in deinem chatlog gaebe es wahrscheinlich noch nichtmal eine cr. auch wenn du zb. \"motherfucker\", oder \"retard\", o. ae. statt faggot geschrieben haettest.","replies":[]},{"poster":"e621 Rengar","date":"2019-07-05T00:38:24.807+0000","up_votes":2,"down_votes":1,"body":"Chatlogs sonst keine besprechung","replies":[{"poster":"XxRhmnxX","date":"2019-07-05T00:55:20.466+0000","up_votes":3,"down_votes":2,"body":"darf ich das einfach so posten, hab angst, dass ich auch hier im Forum gebannt werde","replies":[{"poster":"RM Heartmeander","date":"2019-07-05T01:36:33.595+0000","up_votes":3,"down_votes":0,"body":"Ja darfst du.\nMach screenshots von der Nachricht und poste die Links dazu.","replies":[]},{"poster":"eingew","date":"2019-07-08T07:49:48.120+0000","up_votes":1,"down_votes":0,"body":"Du darfst nicht nur, es ist sogar ausdrücklich erwünscht ^^.\n\nhttps://boards.euw.leagueoflegends.com/de/c/spielerverhalten-de/MaP0LRjY-chatlogs-or-it-didnt-happen-eine-neue-regel-in-den-spielerverhalten-boards","replies":[]}]}]},{"poster":"Abasin","date":"2019-07-05T05:42:31.475+0000","up_votes":3,"down_votes":1,"body":"> Da frage ich mich, könnte man es nicht mit nem Chat bann bzw. einer Verwarnung lösen,\n\nIch frag mich immer öfter, wieso Leute wie Du sich diese Fragen nicht selbst beantworten können. #Suchfunktion.{{sticker:zombie-brand-facepalm}}","replies":[{"poster":"HyperionCH","date":"2019-07-05T07:30:01.556+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Abasin,realm=EUW,application-id=KYnfKGf0,discussion-id=8EYGXGUc,comment-id=0004,timestamp=2019-07-05T05:42:31.475+0000)\n>\n> Ich frag mich immer öfter, wieso Leute wie Du sich diese Fragen nicht selbst beantworten können. #Suchfunktion.{{sticker:zombie-brand-facepalm}}\n\nIst auch logisch.\nDiejenigen, welche die Suchfunktion nutzen, eröffnen dann keinen Thread.","replies":[{"poster":"Abasin","date":"2019-07-05T08:02:13.136+0000","up_votes":2,"down_votes":1,"body":"Stimmt auch wieder.","replies":[]}]}]},{"poster":"Vinmie007","date":"2019-07-05T05:02:59.571+0000","up_votes":2,"down_votes":1,"body":"Das Problem ist halt wenn man sich dazu verleiten lässt, da auch im Internet Emotionen eine wichtige Rolle spielen und man schnell was macht, was eigentlich nicht seinem Wesen entspricht. Wenn ihr dann auch noch verliert und dich genug Reportern und Riot es für gerechtfertigt hält, hast du leider schneller als dir lieb ist einen 14Tage Ban.\nEinfach warten und nicht noch einmal machen.","replies":[]}]}