{"poster":"CôwbôY","date":"2017-03-25T13:43:21.076+0000","title":"S-Wertung blanker Hohn?","subforum":"Champions & Gameplay","up_votes":1,"down_votes":3,"body":"Tach zusammen,\r\n\r\nvlt kann mir mal jemand das Bewertungssystem erkl&auml;ren. \r\nIch spiele Main ADC Caitlyn gelegentlich Ashe und bekomme auf Biegen und Brechen keine S-Wertung.\r\n\r\nIn meinem letzten Spiel hatte ich: Caitlyn 18/4/23, 54k dmg an Champions (Platz 1), 20,5k bei erhaltenem Gold (Platz 2) = A-Wertung.\r\nEin 17/10/14 Talon (Mid) hat dann aber ein S bekommen obwohl er weniger dmg, weniger kills, weniger assists und mehr tode hatte und obendrein noch mit dem Gold unter mir lag.\r\n\r\nDavor: Ashe 14/2/20; 40k dmg an Champions (Platz 1), Platz 1 bei erhaltenem Gold = A+.\r\n\r\nSo und nun zu meiner Frage:\r\nWas zum Teufel muss ich tun um das S zu kriegen?\r\n25/0/40? 100k dmg? Das ist frustrierend wirklich. Mit Bard als Support und Jungle Nautilus war es wesentlich einfacher das S zu kriegen, und ich meine WESENTLICH.\r\n\r\nDanke im Vorraus f&uuml;r Antworten.","replies":[{"poster":"Nycaria","date":"2017-03-25T14:00:20.242+0000","up_votes":2,"down_votes":0,"body":"Zuerst einmal: Du wirst nur mit Leuten in deiner Elo verglichen, welche den **gleichen** Champion wie du spielen.\n\nRelevant für ein S auf einem Carry wird wohl hauptsächlich\n\n* KDA\n* CS\n* verursachter Schaden\n \nsein. Allerdings spielen bei anderen Lanes eben anscheinend auch noch andere Faktoren eine Rolle (gestellte Wards, erlittener Schaden, etc.). Das wird wohl beim ADC spielen auch zu gewissen Teilen mit einfließen. Da Riot allerdings nicht bekannt gegeben hat, was genau notwendig ist um ein S zu erhalten, muss man wohl einfach ein paar gute Games haben,dann klappt das auch.","replies":[]},{"poster":"Call of Cthulhu","date":"2017-03-25T13:53:51.373+0000","up_votes":2,"down_votes":0,"body":"Als adc brauch man irsinnig viel Farm. Kenne ich als Main Adc auch. Nervt tierisch, aber fließt viel in die Bewertung ein.","replies":[]},{"poster":"CôwbôY","date":"2017-03-27T13:46:20.932+0000","up_votes":1,"down_votes":0,"body":"Im letzten Spiel mit Ashe hatte ich eine peinliche 2/2/7 stat.\nNur 178 CS unter 10k dmg und lausige 11k gold....\nund hab dafür ein S- bekommen!!!!\n\nIch trau mich kaum es auszusprechen aber es sieht so aus als wäre es reine Glückssache mit der S-Wertung...\nVlt hatte Riot auch einfach Mitleid mit mir weil ich so dermaßen schlecht war xD","replies":[]},{"poster":"Doo ","date":"2017-03-25T18:53:51.322+0000","up_votes":1,"down_votes":0,"body":"Beide genannten Spiele gingen über 40 Minuten, du hast mit Cait nur 265 CS nach 45min gehabt und das Ashe game nach 43min nur 238 CS. Reicht einfach nicht für S.","replies":[]},{"poster":"Zanlan","date":"2017-03-25T14:48:54.894+0000","up_votes":1,"down_votes":0,"body":"Es gibt halt einfach mehr Spieler die besser auf dem Champion sind und deshalb bekommst du kein S.\nProbier Azir, da sucken die Leute mit und es reichen schon positive Stats aus xD","replies":[]},{"poster":"MeMyselfandBaal","date":"2017-03-25T14:30:27.890+0000","up_votes":2,"down_votes":2,"body":"hmm... blöder Gedanke: Kaufe dir, wenn das Spiel entschieden ist, einen Sightstone und spamme Wards in der Fountain... klingt blöd... könnte aber funktionieren:\n\nNur um dir zu beweisen, das ich meine, hier [mein 1-0-20 - 5K mehr Schaden als der Jungler trotz W-E Max - 51 Wards - 11 Pinks in 42 Minuten Spiel](http://matchhistory.euw.leagueoflegends.com/de/#match-details/EUW1/3105488767/21830463?tab=overview)... oh und ja, das Spiel war 30 Minuten lang ziemlich eng, dann hab ich Teamfights gecarried... Ergebnis: A+. Da geht definitiv mehr...\n\nDarauf hin dachte ich mir: Fuck it, du probierst das einfach: Du spammst nach dem kaufen des Sightstones und am Ende des Spiels einfach mal nen paar Wards in der Base. Wo dein Sightstone permanet refilled wird... Das Ergebnis: [Ein schlechteres Spiel](http://matchhistory.euw.leagueoflegends.com/de/#match-details/EUW1/3106263705/21830463?tab=overview) (4 Tode in nem 28 Minuten Stomp?), aber 53 Wards in 28 Minuten haben das System anscheinend schon beeindruckt und mir mein erstes S+ ever auf Sona gegeben... \n\nAlso ja, ich gehe da mit dir mit: Die S Verteilungen sind ab und zu absoluter Bullshit. Ich habe ab und zu spiele, bei denen ich einfach nicht besser spielen kann, das System aber anderer Meinung ist. Und dann gibt es Spiele, bei denen ich mir denke \"WTF, darauf gebt ihr mir nen S? Da habe ich so viel verkackt\"...\n\nAber hey, nen Teil von mir findet das sogar gut... denn wenn ich ein für mich persönlich perfektes Spiel hinlege, kriege ich halt mit ziemlicher Sicherheit den Sieg. Und das ist immer noch wichtiger als die S Bewertung und die Kiste... für mich zumindest... \n\nUnd in dem Moment, wo die Bewertungskriterien wirklich öffentlich nachvollziehbar werden (Keine Ahnung... Perfekte KDA plus X Farm pro Minute gleich S), werden halt einige Spieler nur auf die S Wertung gehen und hinterher auf ihre Teammitglieder fluchen... obwohl sie es das gesamte Spiel (Als Splitpushing Tryndamere Top) über vermieden haben denen zu helfen. Denn meiner Erfahrung (natürlich nur als Sup Main) ist das System grundlegend nicht hilfreich. Weil es Schaden viel zu hoch einschätzt (was natürlich auch daran liegt, dass es keine \"Damage Denied by Shields\" und \"Teammates Saved\" Statistiken gibt...) Dass heißt: Ich kriege als Sona oder Karma wesentlich einfacher ein S, wenn ich auf den Sightstone scheiße, pure AP baue und nur darauf achte, mein (Mantra)-Q zu landen. Auch wenn das mit ziemlicher Sicherheit nicht die beste Variante für dein Team ist. Da wäre ein Heal/Shield Max wesentlich sinnvoller... Und den E Powerakkord für den Slow anstelle von dem Q Powerakkord für den KS...\n\nDeswegen achte ich auch nicht übermäßig auf die Bewertungen. Wenn ich mit nem B+ gewinne, meinen Job fürs Team aber trotzdem ordentlich gemacht habe... reicht mir das. Ich werde meine Spielweise nicht umstellen, nur um mehr S Bewertungen zu bekommen...","replies":[]}]}