{"poster":"Walmart Porn","date":"2017-05-31T18:41:50.823+0000","title":"TL;DR with voice chat incoming","subforum":"Gameplay","up_votes":2,"down_votes":2,"body":"Okay lets break this down. we have alot of people both for and aginst voice chat so lets simplify things. the voice chat system is by no means going to be forced on people, and in any case that would be impossible because you could simply unplug your mic. that aside, the reason voice chat is going to be fine is simple, 1) most likely it will not be forced. It will be optional, just like dj sona&#039;s music you can likely join or leave the call at any time by holding tab and joining or leaving so you dont have to put up with peoples annoying music or toxic behavior. For another just like on xbox live or almost any other game you can most likely just mute the mic of any individual player that is spamming/annoying. So just to be clear, no one is forcing you to use it. It&#039;s a tool that is there for people who want it and if you dont want it you dont have to use it. Just like {{champion:6}}","replies":[{"poster":"Crede777","date":"2017-05-31T18:55:17.560+0000","up_votes":3,"down_votes":2,"body":"Communication is an extremely important part of this game.  Currently, pings are more than adequate:\nCaution - Exclamation Mark\nOn my way - Arrow\nRequire assistance - Flag\nWhat the hell was that you stupid monkey - Question mark 5x\n\nBelieve me, I don't want to hear anything my random teammates have to say.  I don't want them talking to me.  So I will turn off voice chat.  But they won't know (just like with muting pings).  So maybe they will call MIA or ask for assistance over voice chat and I will miss it.\n\nI don't want to be faced with having to potentially choose between missing out on information vs. listening to some 12 year old scream.\n\nPlease do not implement voice chat.","replies":[{"poster":"Walmart Porn","date":"2017-05-31T19:14:36.614+0000","up_votes":2,"down_votes":1,"body":"and once again no ones forcing you to use it. just because its there dosnt mean youre forced to use it. People aready do use it like discord and such. All this does is make it easier to use strait through the client instead of using a 3rd party software. It isnt going to really change much. people who already used such things as discord and skype will continue to use voice chat. the only diffrence is now you dont have to scramble  over the champ select trying to get everyone in when you should be focusing on picks and bans. It literally changes nothing for people who don't want it because no ones forcing them to use it. No different than quing up and getting other people in your lobby on discord together while you sit out which already happens","replies":[{"poster":"Crede777","date":"2017-05-31T20:33:14.380+0000","up_votes":2,"down_votes":0,"body":"Let me rephrase:  I don't want to hear other players voices and shouldn't be at a disadvantage for not doing so.","replies":[{"poster":"Walmart Porn","date":"2017-06-01T05:58:39.868+0000","up_votes":1,"down_votes":0,"body":"1: its going to be optional so no one is forcing you to do so 2: people ALREADY use third party voice chat softwares, all this does is make it easier. No more scrambleing to add randoms to your calls in pregame pick and bans. The people who will be using this ALREADY use ventrillo/teamspeak/discord/skype ect. All this does is do it directly through the client instead of through a 3rd party software reducing the amount of lag from having multiple programs open for people with toasters. This literally changes nothing about the game itself its ALREADY a thing. theyre just trying to make it easier. Not having a built in VS damn sure dosnt stop me and my friends from just using discord and skype, all this does is make it easier to add people from our groups. It's like being old enough to buy cigs or something. just because you can dosnt mean you have to, and just because one store dosnt sell it dosnt mean people who do wont get it elsewhere. People have been using vc sense league was released and long before then and will continue to do so. all this does is give you another tool to make it easier","replies":[]}]},{"poster":"Limmie","date":"2017-05-31T19:38:41.441+0000","up_votes":2,"down_votes":0,"body":">It isnt going to really change much.\n\nIt definitely will change a lot. Anyone who has played with a premade using voice chat knows that they almost never ping or try to communicate with the rest of the team. Right now we can rely on pings to communicate, but if voice becomes the default then non-voice (both text and pings) will no longer be as realiable as they are now and those who opt out of it will be opting out of communicating althogether. It would effectively be like playing with chat and pings muted.\n\nIf those issues don't personally matter to you because you plan to embrace voice chat, great. But don't pass off other people's problems as non issues just because you won't be personally affected by it.","replies":[{"poster":"Walmart Porn","date":"2017-05-31T20:10:48.322+0000","up_votes":1,"down_votes":0,"body":"Not really. Just because you are not in the call dosnt mean you cant ping. just them being in a call wont suddenly mean they cant hear your pings. Almost every other game has some sort of voice com system that in most cases actually helps. No matter what league does salty players will stay salty and thats not going to change anytime soon. Players who actually play to win are going to use what ever communications they have avalible. I play almost exclusively with a a small group of friends and always with VC, but the random is never really a problem because if they want something all they have to do is ping or type it. sure they cant hear us talking about what we had for lunch yesterday but in the end thats down to personal preferances. all it does is give another option. Even if you don't like it well tough titty because people ALREADY use voice coms. Literally all this does is make it work through the client instead of a 3rd party software so its easier to access. Those who plan on using this voice com are pretty much already using skype/discord/ventrillo/teamspeak and so on. All this does is make it an ingame feature so you dont have to tab out to adjust things. Even if this was somehow cancled people would still continue to use discord and so on and you would be left out either way","replies":[{"poster":"Limmie","date":"2017-05-31T20:21:46.526+0000","up_votes":1,"down_votes":0,"body":"You can ping, but they won't. Why would they when they are already speaking what they want to convey out loud?That's why I said it's like if you played with pings muted from the get go. You can still send out pings but you won't get any yourself.\n\nRight now very few people use it, and it's usually only with their premades, so it's not too bad. But if it became built in and the default mode of communication, then the situation of people who don't want use voice chat (or can't, because some of us are actually deaf) will be drastically worsened. That's my whole point, you are making it as if it were a non-issue while for the people who will actually be affected it will be huge. ","replies":[]}]}]}]}]},{"poster":"Variks the Loyal","date":"2017-05-31T20:22:56.560+0000","up_votes":3,"down_votes":1,"body":"I recognize that Riot would not force people to use voice chat.\n\nThat doesn't change the fact that people would be forced to use voice chat.","replies":[]}]}