{"poster":"Like a Sir","date":"2016-06-20T10:01:26.346+0000","title":"Kleiner noob frägt wegen Tipps :)","subforum":"Level Up: Guides & Tipps","up_votes":1,"down_votes":4,"body":"Hallo liebe Chef Community :)\r\nWie der Titel schon sagt ich bin alles andere als ein guter Spieler, ich habe das ranked spielen f&uuml;r mich entdeckt was ja gut und sch&ouml;n ist aber da ist auch schon das problem :/\r\nMal  abgesehen von den vielen &quot;Trollen&quot; liegt mein Problem daran das ich teilweise einfach nicht mehr weis was ich tun soll ._. das Spiel startet ich fang in meinem Jungle an noch bevor ich lvl 3 erreiche stirbt bsp. die botlane komplett. Sobald ich mit Elise lvl 3 bin versuche ich zu ganken was dann auch meist funktioniert ich geh wieder in den Jungle um vom lvl her nicht zur&uuml;ckzufallen. Kaum bin ich wieder im Jungle stirbt die n&auml;chste lane nicht weil sie Geganked wurde sondern weil der Typ auf der lane ein 1vs1 macht. Steht er wieder Versuch ich zu ganken. Klappt teilweise oft Gehn die Leute wenn du pingst einfach nicht mit. So jetzt wird der andere junger aktiv, meine lanes sterben nur noch ich kann warmes stellen und Pingen wie ich will aber vergeblich sie sterben der Reihe nach und auch unsere T&uuml;rme werden immer weniger. Ich hab jetzt zwar 3-4 Kills gemacht mein Jungle item die Boots und Railys Zepter und fang dan an Tanky mit Elise zu bauen. In Teamfights nehm ich adc und den gegnerischen midlaner raus. Soweit glaub ich ist das ja nicht schlecht oder doch? Trotzdem verlieren wir jeden teamfight._. Und am Ende verlieren wir das Spiel -.-\r\nK&ouml;nnt ihr mir sagen was ich besser machen kann oder Tipps wie ich mein Team besser unterst&uuml;tzen kann? Ich komm einfach nicht mehr weiter :(\r\nW&auml;re vielleicht einer von euch bereit ein normal mit mir zu spielen und k&ouml;nnte mir dann vielleicht sagen was ich falsch mache ?:/","replies":[{"poster":"AmazingMaze","date":"2016-06-20T10:23:22.860+0000","up_votes":2,"down_votes":0,"body":"Zunächst einmal aufhören die Fehler bei anderen zu suchen. Klar macht dein Team Fehler und klar ist auch, dass man nicht jedes Spiel gewinnen kann.\nAber an den Fehlern deines Teams kannst du NICHTS ändern! Wenn du ihnen schreibst sie sollen \"safe\" spielen und die 100mal zurück pingst bewirkt das nur Frustration und Trotz, also höchstens ein bis zwei mal Pingen. \n\nDu musst versuchen jeden deiner eigenen Fehler zu bemerken und es bei nächsten mal besser machen.","replies":[{"poster":"Like a Sir","date":"2016-06-20T14:06:11.825+0000","up_votes":1,"down_votes":0,"body":"Ich versuch die Fehler nicht bei anderen zu suchen auch wenn das vielleicht so rübergekommen ist bin selbst noch ein totaler noob^^ Ich wollte einfach eine Spielsituation beschreiben und da mehr oder weniger um Rat bitten wie man als jungler in so ein spiel aktiv eingreifen kann um seinem Team doch noch zum Sieg zu verhelfen wenn das denn überhaupt möglich ist.","replies":[]}]},{"poster":"Brother Xivx","date":"2016-06-20T10:17:47.542+0000","up_votes":2,"down_votes":2,"body":"Such dir ein Team und spielt zu 5 ranked ist viel angenehmer!","replies":[{"poster":"Minimuecke","date":"2016-06-22T02:28:04.765+0000","up_votes":1,"down_votes":0,"body":"damit verbessert man sich selber aber nicht.\nmerkwürdigerweise gewinne ich rankeds inzwichend häufiger wenn ich solo in die dynq gehe.\neine weiteere sache, blöd wie sie klingt, spielt botgames mit champs gegen die ihr nicht zurecht kommt\nundzwar so lange bis ihr diesen champ einigermaßen könnt.\nso wisst ihr in etwa wie der andere mit dem ebend umgehen wird und habt ein gefühl wie in etwa die cooldowns sind.\nIhr wisst dann auch welcher skill auf cooldown dem champ am meisten zusetzt.\nDazu kommt noch ist der champ eher gut im early, mid oder late. (darüber hatte rito soweit ich weiß auch mal geschrieben)\npowerspikes und und und\nes gehört halt einiges dazu...\n\nMit freundlichem Gruß\nMinimuecke","replies":[{"poster":"Brother Xivx","date":"2016-06-22T03:55:55.439+0000","up_votes":1,"down_votes":0,"body":"Bots kannst du aber sehr schwer mit echten Menschen vergleichen weil Menschen können denken  bots ist alles einprogrammiert","replies":[{"poster":"Minimuecke","date":"2016-06-22T13:40:14.729+0000","up_votes":1,"down_votes":0,"body":"es hilft dennoch den champ zu verstehen...","replies":[{"poster":"Avor Ashkeno","date":"2016-06-22T14:48:08.687+0000","up_votes":1,"down_votes":0,"body":"Es gab doch viele Beschwerden weil wegen den Programm einige eine Permabann bekommen haben. Außerdem enthält es doch den Jungler Timer, also klar Spielvorteil, darum verboten.","replies":[]}]}]}]}]},{"poster":"Awsane","date":"2016-06-20T13:26:20.859+0000","up_votes":1,"down_votes":0,"body":"Für das was du da beschreibst hat ein Pro mal auf die Frage geantwortet\n\"Hey alle meine lanes verlieren? wie kann ich das spiel gewinnen?\"\n\nSeine Antwort war: \"Gar nicht, du verlierst\"\n\n\nDu must dir immer bewusst sein, wenn du nicht gerade am smurfen bist, oder du einen Leistungssprung hast, wirst du immer um die 50% winrate rumgurken (mit nen leichten Plus)\n\nes wird also nen haufen games geben, die du gar nicht gewinnen kannst, aus deiner Position (vllt könnte ein Pro/high-Elo-Spieler ein solches Spiel gewinnen, aber seine Position ist auch eine ganz andere als deine)\n, das must du dir immer bewusst machen, und damit leben können, wenn dich solche Spiele zur sehr Tilten MUST! du dir eine Methode suchen darmit klar zu kommen (Mindset ist hier das Stichwort)\n\nsonst, wie kann man sich verbessern\n\nso ganz klassisch\n1Fehleranalyse (Replays sehen)\n2Fehlerverbesserung (gezielt daran arbeiten eigene Fehler zu sehen, z.B. alle 3 cs auf die karte sehen oder im custom csen üben)\n3adaptieren (warum ist was passiert wie hätte man es anders machen können, war es zufall/glück oder geplant, hierbei kann man auch aktiv streamern zusehen, wobei man dabei immer mitdenken muss unter der premisse warum macht er es und würde ich es auch so machen?)\n4das ganze oft wiederholen","replies":[{"poster":"Like a Sir","date":"2016-06-20T14:00:29.292+0000","up_votes":1,"down_votes":0,"body":"Danke für die Antwort :)\nDarf ich noch fragen wo es die Möglichkeit gibt sich replays anzusehen? Ich hör davon gerade das erste mal.","replies":[{"poster":"Time2Whine","date":"2016-06-20T14:25:33.907+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lugni,realm=EUW,application-id=vatevpvi,discussion-id=ogRpUn8Q,comment-id=00060000,timestamp=2016-06-20T14:00:29.292+0000)\n>\n> Danke für die Antwort :)\n> Darf ich noch fragen wo es die Möglichkeit gibt sich replays anzusehen? Ich hör davon gerade das erste mal.\n\nhttp://www.leaguelsi.com/","replies":[{"poster":"Avor Ashkeno","date":"2016-06-21T15:07:27.747+0000","up_votes":1,"down_votes":0,"body":"Ist dieses Program nicht letztens verboten worden?","replies":[{"poster":"Time2Whine","date":"2016-06-21T20:13:43.692+0000","up_votes":1,"down_votes":0,"body":"Woher weißt du das bzw. wer hat das gesagt ? Wenn es ein offizielles Statement von Riot schreibe mir bitt eden Link","replies":[]}]}]},{"poster":"Nivoras","date":"2016-06-20T15:50:37.288+0000","up_votes":1,"down_votes":0,"body":"replay.gg ist ganz praktisch, die Spiele werden automatisch aufgenommen, wenn du eines angucken willst gehst du auf die Seite lädst die .bat Datei runter und es wird im Spectators Mode geöffnet. Heißt aber auch das du Spiele eben nicht aus deiner Perspektive (Wo war meine Kamera etc) sehen kannst","replies":[{"poster":"Like a Sir","date":"2016-06-21T09:38:48.387+0000","up_votes":1,"down_votes":0,"body":"Ich hab mir das gestern noch heruntergeladen und werd's heute gleich mal ausprobieren :D","replies":[]}]}]}]},{"poster":"FriendlyShaco","date":"2016-06-21T11:17:10.942+0000","up_votes":1,"down_votes":0,"body":"Ich würde gerne mal ein Normal mit dir spielen, oder vlt. ein Spiel spectaten :) Aber du solltest nicht erwarten, dass du nachher gleich viel besser bist sondern musst dich selbst verbessern.\n\nSchreib mir hier falls du Interesse hast.\n\nAuf jeden Fall viel Glück\n\nLG Troublemaker11\n\nPS: eine kleine Skin-Gegenleistung habe ich dann natürlich schon gerne... ;)","replies":[{"poster":"Like a Sir","date":"2016-06-21T12:43:48.551+0000","up_votes":1,"down_votes":0,"body":"Würde mich freuen :D\nDas mit dem Skin ist auch kein Problem :)\nDarf ich dich ingame adden? :D","replies":[{"poster":"FriendlyShaco","date":"2016-06-21T15:16:10.936+0000","up_votes":1,"down_votes":0,"body":"Klar gerne, musst vlt. Noch schreiben wann\n\nBin allerdings kein LCS coach also erwarte nicht 300 Seiten Tabellen :)","replies":[{"poster":"Like a Sir","date":"2016-06-21T15:35:58.990+0000","up_votes":1,"down_votes":0,"body":"Ich hab dich schonmal geaddet :p wann wäre es dir denn gelegen das zu machen? (sorry das ich so blöd frage ich hab keine Ahnung wie sowas abläuft) XD","replies":[]}]}]}]},{"poster":"Killerkante","date":"2016-06-20T12:56:05.053+0000","up_votes":1,"down_votes":1,"body":"1 \"frägt\"\n\n2 Deine Überschrift \n\n+\n\n3 \n>das Spiel startet ich fang in meinem Jungle an noch bevor ich lvl 3 erreiche stirbt bsp. die botlane komplett. Sobald ich mit Elise lvl 3 bin versuche ich zu ganken was dann auch meist funktioniert ich geh wieder in den Jungle um vom lvl her nicht zurückzufallen. Kaum bin ich wieder im Jungle stirbt die nächste lane nicht weil sie Geganked wurde sondern weil der Typ auf der lane ein 1vs1 macht\n\nDu \"frägst\" nach Tipps und zählst erstmal Fehler von deinen Teammates auf \n{{sticker:zombie-brand-mindblown}} \n\nKein wunder dass du nicht besser wirst wenn du eh nur sagst \"ich machs gut und die anderen schlecht\"","replies":[{"poster":"Markathus","date":"2016-06-21T10:33:12.526+0000","up_votes":1,"down_votes":0,"body":"Übrigens wenn du meinst \"frägt\" nicht korrekt ist, dann möchte ich dich darauf hinweisen das man \"frägt\" im südlichen Akzenten Deutschlands verwendet  und dann öfter auch in Texten benutzt wird. [#NoHate,#Klugscheißermodus]","replies":[{"poster":"Killerkante","date":"2016-06-21T13:13:40.854+0000","up_votes":1,"down_votes":1,"body":"Wenn es nach Akzenten geht, kannst du sowohl die Rechtschreibung als auch die Grammatik in die Tonne kloppen, dann schreib ich nämlich nur noch auf kölsch","replies":[]}]},{"poster":"Like a Sir","date":"2016-06-20T13:57:32.186+0000","up_votes":1,"down_votes":0,"body":"Das war nicht so gemeint sorry wenn das falsch rübergekommen ist ._. war eher in die Richtung gemeint was kann ich besser machen bei sowas ich weis es ist ziemlich doof solche Situationen zu beschreiben, meine Frage war eher wie kann ich als Jungler meinem Team bestmöglich neben diversen Ganks helfen zu gewinnen?","replies":[{"poster":"Time2Whine","date":"2016-06-20T14:29:34.976+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lugni,realm=EUW,application-id=vatevpvi,discussion-id=ogRpUn8Q,comment-id=00040000,timestamp=2016-06-20T13:57:32.186+0000)\n>\n> Das war nicht so gemeint sorry wenn das falsch rübergekommen ist ._. war eher in die Richtung gemeint was kann ich besser machen bei sowas ich weis es ist ziemlich doof solche Situationen zu beschreiben, meine Frage war eher wie kann ich als Jungler meinem Team bestmöglich neben diversen Ganks helfen zu gewinnen?\n\nAls Jungler hast du beim Farmen im Jungle den entspanntesten Job und kannst dich auf die Informationen auf der Karte konzentrieren. Bei entsprechender Vision auf der Map kannst du so deine Mates auf den Lanes frühzeitig warnen, wenn der gegnerische Jungler irgendwo ganken will. \nDesweiteren bist du derjenige, der die Objectives kontrollieren sollte bzw. der die Ansagen macht, wann der Drache, Baron, Herald etc. gemacht werden soll, da du mit dem Smite ausgestattet bist. Sieht man bspw. den gegnerischen Jungler + 2 Gegner auf der Top Lane, dann ab zum Dragon, da der Gegner so wohl keine Chance den zu verteidigen. Oder du nutzt die Chance und farmst den gegnerischen Jungler leer, sodass der Gegner Farm und Exp verliert.\nAls Jungler hast du viele Möglichkeiten und das waren nur ein kleiner Teil ;)","replies":[]}]}]},{"poster":"Aaxsus","date":"2016-06-20T10:42:58.283+0000","up_votes":1,"down_votes":0,"body":"Ich selbst spiele eigentlich so gut wie nie Jungle und würde meine Jungle Künste auf Gold bzw. sehr niedriges Platin einschätzen.\nTrotzdem hier mal ein paar Dinge die ich für wichtig halte:\nWenn deine Lanes feeden, sei es durch Rotationen des Midlaners oder einfach durch ganks vom Jungler, wäre es hilfreich wenn du als Jungler auf das Wardjungle Item gehen würdest, um für mehr Sicht auf der Karte zu sorgen. Sollten deine Teamkollegen das nicht beachten ist es nicht deine Schuld.\nDesweiteren helfen dir die Wards dabei zu sehen, wo ein Gegner sich als nächstes hinbewegt und du kannst ihn möglicherweise Abschrecken, Abfangen oder einen Counterfank starten.\nEin anderer wichtige Punkt der mit den Wards zusammenhängt ist das Counterjungeln: Durch Wards im gegnerischen Jungle kannst du sehen wo sich der gegnerische Jungler befindet und versuchen sicher auf der anderen Seite der Karte seine Camps zu machen.\nEiner der wohl wichtigsten Dinge ist jedoch Momentan der Drache: Je mehr Drachen ihr bekommen könnt, desto besser für dein gesamtes Team. Viele lassen Drachen unbeachtet, besonders dann, wenn es ein Wind Drache ist. Aber ihn so früh wie möglich zu holen, sorgt dafür das du mehrere Drachen holen kannst. Sollte der erste Drache in der 20. Minute fallen, bleiben nur noch 15 Minuten bis zum Elderdrake. Das heißt nur noch 2 Drachen können erscheinen also gibt es nur 3 insgesamt. Sollte jedoch der erste schon in Minute 7 fallen, hast du noch 28 Minuten in denen bis zu 4 weiter auftauchen können, also 5 insgesamt.\nHier noch kurz was die Drachen können und wie sie dir und deinem Team helfen:\nInfernaler Drache (Infernal Drake): Verstärkt die AP und AD des Teams um einen bestimmten Prozentsatz - Ihr bekommt eine generelle Schadensverstärkung\nBerg Drache (Mountain Drake): Schaden an Objekten und Epischen Monstern wird verstärkt - Ihr könnt besser pushen und den Drachen bzw. Baron schneller erlegen.\nWasser Drache (Ocean Drake): Du erhälst einen bestimmten Prozentsatz deines Lebens/Mana zurück wenn du dich außerhalb des Kampfes befindest - mehr Durchhaltevermögen auf deinen Lanes und ihr müsst weniger oft zurück (ihr habt mehr Kontrolle auf der Karte)\nWind Drache (Cloud Drake): Ihr bekommt einen Bewegungsbuff außerhalb von Kämpfen - ihr seid schneller auf der Lane und bei Rotation seid ihr schneller. Als Jungler kannst durch den Speed den du erhälst auch sehr viel schneller von A nach B und so oben genannte Aktion durchführen.\n\n\n\nSoviel erstmal von mir. Natürlich musst du immer bedenken das die Leute mit denen du im Ranked spielst ein ähnliches Niveau wie du haben sollen. Das heißt ihr Spielverständnis und ihre Fähigkeiten in ihrer jeweiligen Rolle sollen ungefähr auf deinem Niveau sein. Durch viel Spielen und beobachten von deinen Teamkollegen bzw. Gegnern, fällt dir vllt ein bestimmtes Muster auf und du kannst dieses gegen sie verwenden, bzw sie dabei unterstüzen, wie z.B. deine Gegner versuchen regelmäßig ihren Lanegegner zu töten wenn er wenig HP hat und sie nehmen dafür sogar einen Towerdive auf sich. Dies kannst du für dich nutzen, vor allem mit Jungler die einen harten cc haben wie Elise's E oder Rek'Sai's Knock-up auf dem w, um deine Kollegen zu retten und den Gegner unter dem Tower zu töten. Auf die selbe Art und Weise lernen zum Beispiel Thresh Spieler wie sie ihren hook benutzen müssen. Am Anfang einfach ein bisschen probieren, Muster erkennen, dieses für dich und dein Team profitabel ausnutzen!","replies":[{"poster":"Like a Sir","date":"2016-06-20T14:01:52.076+0000","up_votes":1,"down_votes":0,"body":"Danke für den Tipp :D Ich wird das mit den Mustern gleich mal ausprobieren :)","replies":[]}]},{"poster":"Revilous","date":"2016-06-20T13:01:17.396+0000","up_votes":1,"down_votes":0,"body":"Du stirbst überdurchschnittlich Oft, als Jungler solltest du genauso wie der Support fast gar nicht sterben.","replies":[{"poster":"Like a Sir","date":"2016-06-20T13:58:49.783+0000","up_votes":1,"down_votes":0,"body":"ok danke das wusst ich beispielsweise nicht :)","replies":[]}]},{"poster":"H0tten T0tten","date":"2016-06-20T10:16:14.557+0000","up_votes":1,"down_votes":0,"body":"Für die Fehler deiner Mitspieler kannst du recht wenig.\nDu kannst auch deinem Spieler auf der TOP helfen richtig gefeedet zu werden.\nWenn er danach AMOK läuft und ständig alleine in 5 Leute rennt ist es ja nicht deine Schuld.\nIch verstehe sehr gut was du meinst, bin selbst jungler und verzweifle oft selbst wenn du allen Lanes zu kills verhilfst, aber sie alleine nichts gebacken bekommen.\nSpiele abhaken, teste einfach selbst deinen Champ in Situatioen die du sonst nicht gemacht hättest. Probier aggressives Counterjunglen und übe einfach für dich selbst wenn du merkst das Spiel mit diesen Leuten wird eh nix. ^^","replies":[]}]}