{"poster":"breakordoom444","date":"2017-03-30T04:35:49.839+0000","title":"Is swearing to address the importantness of a (object,situation or anything) good?","subforum":"Player Behavior","up_votes":1,"down_votes":0,"body":"title ^","replies":[{"poster":"Aptest","date":"2017-03-30T13:08:42.699+0000","up_votes":2,"down_votes":0,"body":"i'll spell it out for you:\n\n\"you fucking moron stop feed\" is not a good idea.\n\n\"you you get some fucking armor so you can survive their initial, we can fucking crap on those morons\", or \"these stupid idiots bunch up like a bunch of grapes in a barrel, we just gotta crap malaphite on them like a pile of monkey turd\" , is. ","replies":[]},{"poster":"The Djinn","date":"2017-03-30T13:06:12.562+0000","up_votes":2,"down_votes":0,"body":"I'm of the opinion that cursing is totally fine as long as it's used to bolster rather than denigrate. \"That was fucking INSANE. How on earth did he do so much damage?!\" or \"That was a bloody amazing play, Lee Sin. Thanks for saving me. I fucking love you, man.\" are fine, but I'd say something like \"For fuck's sake! Kill the fucking Fizz already!\", while fine, skirts a little too much to emphasizing a negative. I'd be wary of a log with none of the former but much of the latter.\n\nUsing curses against a player to denigrate them or using curses an insulting fashion is definitely not cool.","replies":[]},{"poster":"Umbral Regent","date":"2017-03-30T05:38:33.892+0000","up_votes":3,"down_votes":1,"body":"That sort of depends, both on the swearing used and the way it's used to emphasize things. As an example, saying something like \"I keep getting outplayed by this damn Fizz\" is good, but saying \"why isn't anyone focusing the fucking Fizz\" is a bit on the bad side.\n\nGenerally, it's hard to even mix low-severity swearing with emphasis, such as \"let's take the damn Dragon\", etc- but I'm willing to wager there are some cases where it can be done, even with high-severity swears.\n\nFor the most part, it's up to personal jurisdiction if it's acceptable or not, so you mostly have to hope that your tone isn't wrong when you're trying to emphasize like that.","replies":[{"poster":"Chønklord","date":"2017-03-31T00:06:19.018+0000","up_votes":1,"down_votes":0,"body":"#Upvoted; this is the most logically correct 'best answer'.","replies":[]}]},{"poster":"Chønklord","date":"2017-03-31T00:08:44.315+0000","up_votes":1,"down_votes":0,"body":"Honestly I can't really contribute much more than what was already said by other posters' comments here; but I will add my 2 cents and say that **@Umbral Regent's comment** is definitely -- to my understanding of the report system and what makes the most logical sense -- the closest to a 'best answer' as you can get.","replies":[]},{"poster":"Dolasaur","date":"2017-03-31T00:00:39.743+0000","up_votes":1,"down_votes":0,"body":"In my personal experience, most of the time when I see people swearing in that sort of situation, it's because they are becoming angry, aggressive, and/or bossy. The first two states of mind aren't reliable for decision making, and the third is neutral (if distasteful). I might still follow that person's orders if I judge the chance of instigating a full-on rage session to be more dangerous than doing what I believe to be the otherwise-optimal path.\n\nOf course, there's lots of other reasons to swear. It has some other situational benefits. Taboo breaking is common bonding for subcultures, so swearing with other hardcore gamers can make you feel like you fit in, and you might enjoy it more than doing it alone (like when you stub your toe). Sort of like how teenagers are much more likely to pressure each other to smoke and drink; the physical experience might be pleasurable in solitude, but the knowledge of \"we're being bad *together*\" is also pleasurable. Humans are social beings.\n\nThat said, if you're talking about \"likelihood to make me win the game\", then the best way would be to test it out. Do 30 games where you don't swear at all followed by 30 games that you do, and measure how much people listened to you. It's not incredibly scientific, but it would be a good place to start, at least.","replies":[]},{"poster":"This Is Your Dad","date":"2017-03-30T06:57:10.951+0000","up_votes":1,"down_votes":0,"body":"You can curse, so long as it doesn't degrade a person. Saying get that fucking tower is not as bad as saying you fucking piece of trash adc get that tower. It only matters when it's applied to a person, or when it targets a group of people like racial or homophobic slurs.","replies":[]}]}