{"poster":"breakordoom444","date":"2018-12-23T09:15:03.961+0000","title":"I Demand seperate rules for PB","subforum":"Discuss the Boards","up_votes":2,"down_votes":1,"body":"no not peanut butter.\r\nI feel PB is special enough to get its own rules.","replies":[{"poster":"Ulanopo","date":"2018-12-23T13:12:13.911+0000","up_votes":2,"down_votes":0,"body":"If you remember the work we did on the separate guidelines for GD, we're looking at something similar for PB. I got the ball rolling on that initiative (moderating dismissive and low-effort responses on PB more harshly has been something I've wanted for a long time) and will probably be leading the process. Work has been busy lately, though, and there's always the holidays. We're also in the middle of recruiting and onboarding new mods, which will also take time.\n\nIn the meantime, please feel free to suggest how those board-specific rules should work.","replies":[{"poster":"Jo0o","date":"2018-12-23T15:44:53.653+0000","up_votes":1,"down_votes":0,"body":"What about low-effort posts? Low-effort responses are often directly the result of low-effort posts. Both aren't great, and I'm aware of the fact that I've probably made quite a few low-effort responses over the years, but _so many_ threads on PB are pointless.","replies":[{"poster":"Ulanopo","date":"2018-12-23T17:57:32.220+0000","up_votes":2,"down_votes":0,"body":"That's an area we will be reviewing, but you should keep in mind that we prefer to let people vent where we can. This means we tend to moderate the responses - both from the OP and others - more strictly than the original post. We're aware that allowing lower-effort rants as the original post has the effect of junking up the board, but there aren't clean guidelines for what should stay and what should go.","replies":[]}]}]},{"poster":"AeroWaffle","date":"2018-12-23T11:10:20.391+0000","up_votes":1,"down_votes":0,"body":"What rules do you want applied & not applied?\n\nThere's a fair amount of leeway given as it is in the Player Behavior boards since one of the major topics is discussing individual's behavior. It's a conversational tightrope to make sure to only criticize their behavior/argument while avoiding criticism of the person themselves, and I think the mods understand this.","replies":[{"poster":"DrCyanide","date":"2018-12-23T12:16:05.849+0000","up_votes":2,"down_votes":0,"body":"At minimum, they need to remove %%%%%%/%%%%%%ed from the filter for Player Behavior. Everything else on the filter is a zero tolerance word on game, but those aren't. It makes it tougher to judge what's said when we have to guess the severity.\n\nI've seen others suggest that down votes should be disabled. Personally, I think disabling down votes makes sense for people asking \"why'd I get banned?\" But it doesn't make sense for discussions/suggestions about player behavior in general.","replies":[]}]}]}