{"poster":"riok89","date":"2017-09-18T19:26:18.659+0000","title":"Brand is a support now?","subforum":"Gameplay","up_votes":5,"down_votes":6,"body":"So since when did this happen? I feel like brand mid is the best","replies":[{"poster":"PopcornBunni","date":"2017-09-18T19:28:49.797+0000","up_votes":3,"down_votes":0,"body":"Brand has changes on the PBE that exclusively help him solo lane: Units killed by his eruption restore mana.\n\nHe's always been both a mid and a kill-lane support because of his pressure and early damage","replies":[{"poster":"Meddler","date":"2017-09-18T23:00:23.468+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=PopcornBunni,realm=NA,application-id=3ErqAdtq,discussion-id=U3hMhHTX,comment-id=0000,timestamp=2017-09-18T19:28:49.797+0000)\n>\n> Brand has changes on the PBE that exclusively help him solo lane: Units killed by his eruption restore mana.\n> \n> He&#x27;s always been both a mid and a kill-lane support because of his pressure and early damage\n\nBrief bit of passing context on those changes - expect them to vanish from the PBE this week (probably tomorrow) and then return in a modified form the patch after. We're at the point where we need to lock down the patch and that Brand stuff needs a bit more work.","replies":[{"poster":"Off ßrand","date":"2017-09-19T18:45:49.475+0000","up_votes":6,"down_votes":0,"body":"As a Midlane Brand main, I believe the simple change is to put his mana restore on his E and give his E bonus damage to minions and monsters. That boosts his waveclear substantially and provides Mana sustain in accordance with his current W into E waveclear pattern, all without making him do too much damage as a support in the laning phase. Waveclear and Mana sustain around CSing is the only way to bolster his midlane presence into being functional without being overpowered as a support, his kit is otherwise enjoyable and great to play besides his E being lackluster in it's range and functionality\n\nP.S: His base AD is a little lower than most mages and makes CSing with autos extremely frustrating, a few small points of base AD early could go a long way","replies":[]},{"poster":"patmax17","date":"2017-09-19T07:21:18.946+0000","up_votes":4,"down_votes":0,"body":"Are the changes looking good so far, i.e. is that probably the way you'll go (after maybe some tuning), or will you try out other paths?","replies":[]},{"poster":"CLG Doublerift","date":"2017-09-19T18:37:31.158+0000","up_votes":3,"down_votes":0,"body":"Could you experiment with changing his E to *always* spread his burn passive (regardless of whether the target is burning or not) and then give it a different effect if the target is already burning? \n\nI realize that'd be a straight buff to his power level, but it'd make his waveclear much more satisfactory and comparable to other AoE mages in the midlane. It'd allow you to E + W a wave (instead of W + E) to get the bonus damage from W, which would also work with you adding mana refunds to his W on minion kill. \n\nPersonally, I think his current E (low-damage, single-target, point & click ability) is really bland if the target isn't already burning - it only serves to enable his Q stun or stack his passive. If it spread his burn passive to all enemies near your target as a baseline, it'd be much more interesting and cohesive with his kit.","replies":[]},{"poster":"Bahmpocalypse","date":"2017-09-19T12:52:54.566+0000","up_votes":3,"down_votes":0,"body":"Meddler, Have you guys considered moving this restore mana to his E instead of his W? His waveclear pattern is almost always to W then E, so putting the mana restore on the W doesn't help very much.","replies":[{"poster":"HalcyonDweller","date":"2017-09-19T19:01:33.529+0000","up_votes":1,"down_votes":0,"body":"This! I think it would open up much more for his playstyle if the E did it instead.\n\nThat said it might require maxing E so that it wouldn't be unbearably difficult to pull off.","replies":[{"poster":"baconnice","date":"2017-09-27T18:49:39.243+0000","up_votes":1,"down_votes":0,"body":"http://www.surrenderat20.net/2017/09/926-pbe-update.html the brand mana refund is now on the passive so once it's already ablaze, he gains more mana depending on the level, at level 9, brand uses 170 mana  with w-e, if he kills the 3 caster minions, that's 36 mana, making it 134 killing the casters,  seems pretty good, anyone else's thoughts?","replies":[]}]}]},{"poster":"NineTailedMystic","date":"2017-09-20T03:50:24.678+0000","up_votes":1,"down_votes":2,"body":"Can you slightly reduce his damage or change his r targeting priority to compensate. His R shouldn't bounce to a solo champion more than once if they're in a minion wave. It makes it far too easy to just R someone for half their health in lane and the built in slow makes landing his other abilities far too easy.","replies":[{"poster":"TomiMan7","date":"2017-09-20T12:13:32.999+0000","up_votes":2,"down_votes":1,"body":"dude his R has a 100dmg base with 20% ap ratio. if there is no minions thats the whole dmg it will deal. dont QQ pls. Learn to play against him. If you cant beat a mid lane brand who sucks at mid at the moment i have some bad news for you","replies":[{"poster":"NineTailedMystic","date":"2017-09-20T20:17:45.566+0000","up_votes":1,"down_votes":0,"body":"With 3 bounces that's 300 + 60% AP. Plus his passive which I believe is 12% max HP magic damage at minimum?\n\nAnd in laning phase there are minions 95% of the time.\n\nI just find the changes he got to his R in the MYMU absurd and unneeded.","replies":[{"poster":"TomiMan7","date":"2017-09-21T14:58:56.460+0000","up_votes":1,"down_votes":0,"body":"yes minions that also deals dmg to brand. and they can do quite the dmg.\nAlso you can shove brand under tower quite easily. If brand uses his abilities to poke you, he wont farm sh*t, cos of his high CD's . If he farms the only two abilites he can hit you with is his R and Q. Thats not enough dmg even with his passive to kill you.\nEnd of story. Learn to play against him.","replies":[{"poster":"NineTailedMystic","date":"2017-09-21T21:40:14.672+0000","up_votes":1,"down_votes":0,"body":"It's not a matter of winning or losing to him. Its his R changes being absurd.","replies":[{"poster":"TomiMan7","date":"2017-09-22T13:50:26.538+0000","up_votes":1,"down_votes":0,"body":"absurd? The only thing was absurd that it COULD bounce to 4 minions after you hit the enemy. \nThe one and ONLY buff to his R was a new targeting system so it now prioritizes champs.\nOther than this it was a full on nerf to its base dmg and AP ratio. Which was cut more than in half, so quit bitching about it.","replies":[{"poster":"NineTailedMystic","date":"2017-09-23T05:54:09.335+0000","up_votes":1,"down_votes":0,"body":"On top of gaining an _innate_ slow when it bounces to someone for no apparent reason, and not a direct R change it can proc his new passive by itself for absurd burst. \n\nYou either fight him in minions to block his Q but get ulted and die, or you fight out of minions and have to dodge his Q/W but not got ulted more than once and still probably die.\n\nIt should honestly prioritize un-ablaze _units_ first, but target un-ablaze champions before minions. That way he doesn't lose teamfight strength which is his niche, while weakening his lane phase post-6 since he isn't a duelist.","replies":[{"poster":"TomiMan7","date":"2017-09-23T11:00:53.488+0000","up_votes":1,"down_votes":0,"body":"The slow is only gained if R casted on an already ablaze target.\n\nIm not gonna argue with you, just try to play brand in mid lane and you will realise that what you stated is on PAPER sounds op as hell but in reality its not. If it would be that easy to ult someone in a minion wave and they die just from that + passive ppl would spam brand mid all time. And obviously thats not the case. Since this is NOT how it works at all.","replies":[{"poster":"NineTailedMystic","date":"2017-09-23T11:39:05.469+0000","up_votes":1,"down_votes":0,"body":"No, it's just a 50% hp chunk from one ability + passive.\n\nI've had it happen to me. Disengage from him since he ulted me. Minion wave came. It proceeded to bounce up the entire wave between me and the minions killing me from 50% hp.\n\nBrand mid isn't played because of his bot lane prowess and his mana issues mid. Guess what, they're trying to alleviate his mana issues. Something's gotta go before he ends up demolishing every teamfight when he's backed by a solo laner's exp and income more often than not.","replies":[{"poster":"TomiMan7","date":"2017-09-23T12:14:07.013+0000","up_votes":1,"down_votes":0,"body":"If you have 1500hp(Which you WONT have but lets say you do to make brands passive deal even more dmg) and brand has like 1 item around 100ap his passive deals around  17,5% of you max hp. That is 255dmg. His ulti can deal a maximum of 300+60dmg. That is if it hits you 3 times. A total of 615dmg . BUT lets say you have like 50mr which is normal at that stage of the game, if you take ap vs ap runes. Calculate with a 42%dmg reduction that is a net 504,6dmg.\nPls dont write these stupid comments. With just an ult and passive he wont kill you. Not even close to kill you. End of story\n\nOH but wait his passive burn. The 2% of max hp too i tottaly forgot that one. \nLets see. 1500   *  0.06(it stackes 3 times cos of ulti)   *   0.58(reduced by mr) =52,2 dmg. That I guess changes the situation. oh...its not.","replies":[{"poster":"NineTailedMystic","date":"2017-09-23T18:58:50.472+0000","up_votes":1,"down_votes":0,"body":"Using a squishy mids base stats, like Ahri's, she should have a little over 900 Hp and 45 MR assuming mr blues. Reducing the max hp damage to make up for being squishier the total damage should come down to just about half her HP","replies":[{"poster":"TomiMan7","date":"2017-09-23T19:41:09.063+0000","up_votes":1,"down_votes":0,"body":"900 x 0,175 = 157,5 passive\n900 x 0,06 = 54 passive dot\nR = 300 + 60 ulti\ntottal dmg:571,5\nmr reduction about 40%\nTottal dmg dealt:342,9\nThat is a 38.9% of ahris total hp. Nowhere near to be 50%\n\njust cut this chat here. I main brand so i know what im talking about lol. You cant prove me wrong","replies":[]}]}]}]}]}]}]}]}]}]}]}]},{"poster":"Fütanari","date":"2017-09-19T18:54:56.445+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=U3hMhHTX,comment-id=00000001,timestamp=2017-09-18T23:00:23.468+0000)\n>\n> Brief bit of passing context on those changes - expect them to vanish from the PBE this week (probably tomorrow) and then return in a modified form the patch after. We&#x27;re at the point where we need to lock down the patch and that Brand stuff needs a bit more work.\n\nWhen you reverting the vayne q changes?","replies":[{"poster":"NineTailedMystic","date":"2017-09-20T03:47:23.490+0000","up_votes":1,"down_votes":0,"body":"Hopefully never. Fuck burst vayne.","replies":[]}]}]},{"poster":"din1812","date":"2017-09-18T19:41:57.084+0000","up_votes":1,"down_votes":0,"body":"yep","replies":[]}]},{"poster":"Douglas Funnie","date":"2017-09-18T23:33:45.944+0000","up_votes":3,"down_votes":0,"body":"Brand has been a viable support pick for a long damn time.....","replies":[]},{"poster":"TyrekGoldenspear","date":"2017-09-19T18:59:01.135+0000","up_votes":2,"down_votes":0,"body":"Brand's kit works better against two people, especially his ult. Hence he has been seeing more play botlane than mid.","replies":[]},{"poster":"Catastrop","date":"2017-09-19T12:58:24.780+0000","up_votes":2,"down_votes":0,"body":"Brand has been a Support for the past 3 seasons.","replies":[]},{"poster":"TheGoomyGamer","date":"2017-09-23T19:43:16.428+0000","up_votes":1,"down_votes":0,"body":"80% of the time brand is played support.\nhttp://www.op.gg/champion/brand/statistics/support","replies":[]},{"poster":"Khristophoros","date":"2017-09-20T12:37:49.795+0000","up_votes":1,"down_votes":0,"body":"I play him mid because I hate myself & want to die","replies":[]},{"poster":"x Wyvern x","date":"2017-09-20T12:35:24.245+0000","up_votes":1,"down_votes":0,"body":"High base damage and CC, he is supposed to work for kill lanes and also he puts a lot of damage on the table.\n\nThis happened a while ago, and expect more mages to come botlane, as malzahar did too for a short time.","replies":[]},{"poster":"riok89","date":"2017-09-19T21:25:48.373+0000","up_votes":1,"down_votes":0,"body":"Welllll.....Ive been out of the game for a bit and im getting back into I like brand mid. Always a strong pick for me.","replies":[]},{"poster":"Cronovey","date":"2017-09-19T07:24:53.340+0000","up_votes":1,"down_votes":0,"body":"He's been played as a support in solo queue for a long time now, and was also played at Worlds 2016 as a support champion by Albus Nox Luna's (now M19) support Likkrit as his pocket pick which was banned in almost every single game against him because of its strength and the inability of other teams to find a counter to it at the time.\n\nWith the update he received a while back making his passive stack and do an explosion for a large percentage of max HP, he saw a rise in popularity as a support pick as well as the fact that one spell landing guarantees your entire 3 stacks of procs from Spellthief's line is used immediately.","replies":[]},{"poster":"Calabok","date":"2017-09-18T19:44:50.256+0000","up_votes":1,"down_votes":0,"body":"Since the patch, the suggested items have reverted to the FIRST suggestions (support Brand) as default. To change this see below:\n\nWhile in the game - change the suggested items by clicking on SUGGESTED word (top left) and drop down the other list to get back his original suggestion list.","replies":[]}]}