{"poster":"Meddler","date":"2015-01-20T01:04:57.560+0000","title":"Meddler, Lead Champion Designer Q&A","subforum":"Miscellaneous","up_votes":16,"down_votes":3,"body":"Hey all!\n\nAnyone want to talk about LoL, game design, how we make champions etc? Going to be around for a couple of hours and looking forward to chatting with some of you folks. \n\nTo give you a quick bit of background I've been at Riot for about three years now. I've previously worked on Ziggs, Varus, Syndra, Lissandra, Elise and Gnar. A lot of my time these days is spent looking at the year ahead, working with other Rioters to figure out what sort of champions we want to make, what our goals are etc.\n\nEdit: Xypherous, from the Systems Team that handles stuff like the Preseason changes, is also going to drop by to chat. If you've got questions about that sort of stuff should definitely throw them in too! He also worked on Nautilus, Lulu, Orianna, Fizz and Renekton before that as well, so if you've got questions about them he's the guy to hit up. \n\nEdit 2: Thanks for the chat all, I need to head off and grab food. Will drop back later tonight though and add in a few more replies.","replies":[{"poster":"PurpleNinja63","date":"2015-01-20T01:14:30.479+0000","up_votes":5,"down_votes":1,"body":"Hi Meddler! I wanted to ask you two questions if that's alright, there only short.\nA. What change coming into this season is your favorite?\nB. Are there any champions that looking back you wish you never let them get released... Maybe a certain glorified boy scout?\n:D\nKeep up the good work because all the new champions have been really interesting and fun additions to the game.\nI can't wait for a new support.\nSupp4Lyf","replies":[{"poster":"Meddler","date":"2015-01-20T01:47:47.814+0000","up_votes":17,"down_votes":1,"body":"I really like how dragon's now an objective that matters throughout the game, that teams plan around and fight over, rather than something that, late game, someone just does on the way past at times. \n\nThere aren't any champions I don't think should be in the game at all, I think they've all got a solid core to them. In some cases though that's not very well executed on though. Urgot and Yorick for example have cool underlying ideas (undead cyborg war machine and gravedigger with pet ghouls) that aren't well realized.\n\nOh, yeah, then there's Teemo. Teemo should burn.","replies":[{"poster":"Xypherous","date":"2015-01-20T01:50:44.301+0000","up_votes":6,"down_votes":1,"body":"> Teemo should burn.\n\n:O\n\nYou'd waste all the really good mushroom flavors if you burn him.","replies":[{"poster":"Meddler","date":"2015-01-20T01:57:12.949+0000","up_votes":40,"down_votes":1,"body":"Worth.","replies":[{"poster":"AussieOwned","date":"2015-01-20T02:52:16.459+0000","up_votes":2,"down_votes":0,"body":"Does this mean a possible teemo removal? :D\n\nAt least remove his damned taunt/laugh. Please.","replies":[]}]}]}]}]},{"poster":"Explorer Ezreal","date":"2015-01-20T01:59:27.716+0000","up_votes":1,"down_votes":0,"body":"What do you think of ADC's itemization at the current moment? What do you think needs to be changed?","replies":[{"poster":"Xypherous","date":"2015-01-20T02:08:06.163+0000","up_votes":2,"down_votes":0,"body":"For the short term, there's a wide range of ADC itemization paths depending on the ADC.  However, there is little variation on the items that an individual ADC buys.\n\nThere isn't a whole lot of range on a specific ADC for the items they can buy - but at least they're buying different things (I see 3 or 4 main builds that vary across type - and then there's Hurricane on Kalista - so there's variance across ADCs but not in an ADC.)\n\nThat's in an okay spot for now - but in an ideal world lots of things would be different in terms of reactive purchases and such but I think the other classes' itemization deserve a touch up before we delve back into ADCs.\n\nFor an example of more long term stuff - critical strike is eventually going to have to be looked at to prevent AA based carries from forever being the norm, for example - but that exploration will take a while.","replies":[{"poster":"Explorer Ezreal","date":"2015-01-20T02:16:38.623+0000","up_votes":1,"down_votes":0,"body":"I see, I was thinking of an idea for IE to lose some of the crit damage % on the passive, but the same passive goes on PD. This way autoattackers can invest into PD instead of needing to buy IE which doesn't give them what they want mainly.","replies":[{"poster":"Xypherous","date":"2015-01-20T02:23:27.797+0000","up_votes":10,"down_votes":0,"body":"(Warning - the following comment is entirely Pie in the Sky and not going to happen in the near future.)\n\nI'd kind of like to envision a world where every ADC has a special 'Crit Damage' skill like:\n\nVayne - Silver Bolts (Every 3 hits, deal X + Y% of the target's maximum Health as true damage.  Every critical strike does Z% of the target's maximum Health)\n\n-or-\n\nVarus - Blighted Quiver (Critical Strikes automatically apply full Blight stacks to the target). \n\nThat way, every carry would look at crit a little differently - based on their pattern and what they think they could accomplish etc.","replies":[]}]},{"poster":"Umi","date":"2015-01-20T02:46:47.335+0000","up_votes":1,"down_votes":0,"body":"What are your thoughts on Essence Reaver at the moment? The item is currently purchased only on Ezreal, and it's debatable whether or not the item is even good on him (it's probably not). Are you okay with the position of this item currently? Is there a reason why you haven't considered creating another build path for Brutaliser catered towards ADC? Brutaliser also happens to give 10% cdr and AD, why not create something based off that? That type of item would still be good on Ezreal, but also other caster ADCs. You could possibly even keep the Lifesteal and Mana Regen aspect, depending on what you were going for, right?","replies":[{"poster":"Xypherous","date":"2015-01-20T02:53:06.041+0000","up_votes":2,"down_votes":0,"body":"We could fork Essence Reaver off Brutalizer - and the item would be immensely more popular and bought more - you're absolutely right on that.\n\nUnfortunately, making Essence Reaver's build path and build up good is something that would most likely send a certain class of AD assassins (whose gates are early/mid-game Mana) into somewhat crazy levels.  Pantheon/Talon, etc - would get the lion's share of benefit until ER was nerfed to be suitable for them.\n\nUltimately, ER will always kind of be bad until Assassin's have their own itemization and have their inherent power reduced.\n\nThe weird part about items is always that we can always make an item good or powerful - but making that item good and powerful *on the people we want it on* and not cause side effects elsewhere is the tricky bit.","replies":[]}]}]}]},{"poster":"SpellThief","date":"2015-01-20T02:26:05.967+0000","up_votes":1,"down_votes":0,"body":"Hey Xypherous, What were the trails in making Nautilus. \nBeing a champ with a crazy amount of cc must have gone through a lot of buffs and nerfs during creation. \nAny moves that were scrapped?","replies":[{"poster":"Xypherous","date":"2015-01-20T02:38:35.099+0000","up_votes":3,"down_votes":0,"body":"A ton of moves were scrapped in the making of him - he started out as being very light in CC because he had the hook but... yeah.\n\nOff the top of my head, here's the things I remember trying:\n\nA punch which knocked back anyone but the primary target (Xin Zhao's current ult).\nPassive X-Ray eyes that could see through walls in a cone.\nCage of Pain, which brought up a giant circular shock/slow 'fence' - like a super big wall of pain.\nBullrush, where you got MS and flung anyone you moved through (multiple times, charging bull kind of deal)\nThrow - where you impaled someone on the anchor and then flung them and the anchor to a point of your choice\n'Enrage' when a nearby ally got attacked (yeah...)\n\nI tend to cycle through skills a lot - I'm sure there was more that I can't remember.  I just remember a long phase of Nautilus being 'A bull who sets up cages that he then chases people in.'","replies":[{"poster":"Meddler","date":"2015-01-20T02:46:17.002+0000","up_votes":7,"down_votes":0,"body":"\"Bullrush, where you got MS and flung anyone you moved through (multiple times, charging bull kind of deal)\"\n\nMan, that was a memorable playtest. I  recall one team fight near dragon, where Naut ulted and ran back and forth, juggling 3-4 of us in the air for about 5 seconds until we all died. I still wake up screaming occasionally...","replies":[{"poster":"Xypherous","date":"2015-01-20T02:47:54.510+0000","up_votes":4,"down_votes":0,"body":"Hey, don't blame Nautilus for your Teemo Nightmares.","replies":[]}]}]}]},{"poster":"Xypherous","date":"2015-01-20T01:30:18.203+0000","up_votes":7,"down_votes":0,"body":"Hey guys, you might notice me popping in random comments as well. I'm Xypherous and I used to be a champion designer, having designed Nautilus, Lulu, Orianna, Fizz, Riven and Renekton. I'll be helping Meddler out fielding some questions that he might miss.\n\nMost recently, I helped out with a large part of the Seasonal work for Season 2015.\n\nAsk away. :3","replies":[{"poster":"REK SAl","date":"2015-01-20T01:37:21.855+0000","up_votes":1,"down_votes":0,"body":"Hi Xyph, i was wondering whose idea giving Fizz his bull%%%% E was. can you please give that person a stern telling off and ask them to never do something that dumb ever again? \n\nin other news, what was actually the idea behind fizz's E, was it intended as a way to slightly lower the insane poke he receives in lane, or was it intended as a way to safely enter Q range so he can all in?","replies":[{"poster":"Xypherous","date":"2015-01-20T01:40:35.839+0000","up_votes":6,"down_votes":0,"body":"I'm totally responsible for Fizz's 'E' - and the intent was to make a frustrating skill that conveyed that aspect of Fizz's personality.  I think my goal was something like 'Let's aim for something that feels like Shaco in terms of trickery/frustration without going too far.'  In retrospect - it's probably worked *too* well in a lot of regards with that.\n\nThe idea for Fizz's 'E' was primarily to allow him to evade opposing damage without actually being durable - so that every now and then his opponents can choke Fizz and obliterate him and feel good about that.  \n\nFizz was really meant to be a character that felt slippery enough so that you experience a moment of catharsis when you finally catch the jerk and annihilate him.\n\nAs to lane functionality, it was meant much more for the 'lower the poke he takes' rather than the 'instantly annihilate you with Q' that it's become.   In hindsight, I wish there was way more incentive to stay on the pole rather than instantly double-tap to move faster.","replies":[{"poster":"REK SAl","date":"2015-01-20T01:47:07.659+0000","up_votes":1,"down_votes":1,"body":"Thanks for the reply Xyph, u da best. Except for making Fizz E, which makes u da worst.\n\nAre there any plans to nerf Fizz's 'E' to make it more of a \"lower the poke he takes\" skill, something like lowering the damage, or increasing the CD so fizz has to use it more sparingly and cant just spam it like every 4 seconds? (goddamn 40% CDR) \nobviously not a champ designer or anything (lel i wish tho) but what about making his E like twitches old Q, where the damage would increase the longer he stays on pole (how twitches Q raised AS the longer he stayed stealthed). that would give more incentive to staying on the pole to maximize damage, and less of a \"lol i have a bull%%%% flash + zhonyas + damage combo in my kit\"","replies":[{"poster":"Xypherous","date":"2015-01-20T01:54:26.472+0000","up_votes":2,"down_votes":1,"body":"I don't work on live balance directly these days, but the incentives to staying on the pole (and perhaps less damage on the double jump part of it) are generally good directions I think. I'd also love to trim Mana costs from his other abilities and shove it even more into the 'E' to punish spamming it recklessly like you've pointed out.\n\nHowever, again, don't work on balancing directly.  There's a bunch of super smart live designers whose job it is to make sure things look okay from a competitive angle.","replies":[{"poster":"REK SAl","date":"2015-01-20T02:01:13.081+0000","up_votes":1,"down_votes":0,"body":"thank you very much for the answers so far, just one more question before i leave you (soz about all these ahaha) \n\ni know you dont work on balancing anymore but RiotJag mentioned in the 5.2 forecast about DFG removal that {{champion:1}}  is up for some changes. if you know what these are are you able to say how large of a scope this is (ie. is it just damage changes or full blown rework scale?) \n\nOnly asking because I'm an Annie main and im super worried my main champ might get absolutely gutted and left to die completely unviable. I know you cant give specifics but an indication of how large the changes are would be nice if you are able to give those. \n\nthank you for your time c:","replies":[{"poster":"Meddler","date":"2015-01-20T02:08:32.160+0000","up_votes":4,"down_votes":0,"body":"What we're currently looking at (note this is experimental, so could well change tomorrow) is slightly lower resistances on Molten Shield, with Tibbers also getting the resistance bonuses as well plus a brief movement speed boost. One of the big goals there, in addition to balance changes, is to make casting Molten Shield a bit more interesting and add a bit of extra depth to how you micro Tibbers.","replies":[{"poster":"Mansana","date":"2015-01-20T02:42:10.078+0000","up_votes":8,"down_votes":2,"body":"Why not take influence from the cinematic?\n\nMake her throw her teddy bear as an animation for her ult so it could have missile speed similar to how the balance team did with Corki's Q. That way there is at least a time gap for players to dodge Tibbers. However, it kinda makes flash Tibber plays less impactful.\n\nAlso you could give an Orianna passive to Tibbers so actually macro-ing Tibber's auto attacks make an actual influence, and since he's a melee character with such a slow movement speed make it so he can gain movement speed per auto which give him the fierce aspect from the cinematic. Just make it so he's actually dynamically interactive during a team fight and actually a threat from beginning of cast to the end of his life cycle.","replies":[]},{"poster":"Beats29","date":"2015-01-20T05:24:14.272+0000","up_votes":1,"down_votes":0,"body":"Hi Meddler sorry for intruding on your AMA but I needed to respond this comment.\n\n1st of all, many greets for creating Lissandra and Elise (please buff Elise to a lane mage again T.T). Their themes and playstyles are surely on my favorites. I simply love them, so fun champions to play along with great concepts. I'm hoping you to see more awesome concepts made by you, as well damn fun to play (Avé Ziggs!). 2nd, I already thanked you before, but on behalf EuW community, thank you so much for listening the feedback when doing some changes like you did about Urgot. We were feeling a bit step aside on that time, and that surely put smile on us, thank you so much. And no Xelnath, you weren't forgotten :P\n\nNow onto the question I was talking about, I've read you're testing changes for Annie since DFG was removed. Surely she probably will need some help, but aren't you concerned that she will return to the problem she was on S4 start as support? Specially after the nerfs to traditional supps like Sona? I think this is a very delicate issue.\n\nCheers, and hope you're having fun with your AMA!","replies":[{"poster":"Meddler","date":"2015-01-21T04:06:25.468+0000","up_votes":2,"down_votes":0,"body":"Seeing Annie support some of the time's not personally a concern - I think it adds some interesting variety to laning, team comps and champ select. If Annie's only played as a support though that would be a problem we'd want to adjust for, ensure she still feels useable as a solo mage as well. Not currently concerned about that, given the changes add power to Tibbers rewarding Annie's with solo lane XP to get ult ranks quicker, will definitely keep an eye on her post patch though.","replies":[]}]}]}]}]},{"poster":"PhRoXz0n","date":"2015-01-20T03:28:26.421+0000","up_votes":2,"down_votes":0,"body":"Hey Cytus, \n\nI work on Live Gameplay at the moment, so I might be able to shed some light on this. \n\nLike Xyph said, Fizz's E is a core part of his personality that we like to keep and we don't think that it actually creates some unhealthy gameplay. \n\nI like your approach and your solution is good if we felt that Fizz's E made it so there are no actual windows to attack him\". (Which I personally don't think is the case, given that his primary build path does not contain CDR). Instead we like to think about other aspects of Fizz like whether his Q does too much damage or he does too much damage when he completely misses his fish.","replies":[{"poster":"REK SAl","date":"2015-01-20T04:34:43.754+0000","up_votes":1,"down_votes":0,"body":"Oh hey, thanks for coming down and shedding some more light on the Fizz situation. \n\nAre there any plans to balance fizz out a little bit since hes currently quite a high priority pick/ban champion with little - no counterplay once he gets going (which doesn't reeeeally take too much besides either hitting 6 and just bursting, or roaming and picking up a bunch of kills.) \n\nI'm glad you liked my ideas (future live gameplay team member Kappa (i can dream)), and its nice to have an insight into the kinds of things you guys look at when it comes to balancing champions. Just wondering, do you guys ever look at the 'non-meta' build paths when looking at champions, such as AP tristana, CDR fizz, AD twisted fate, or is it primarily the champ as they were 'intended' so to speak? \n\nAlsoo last request, pls keep annie viable as a midlaner, i would cry if she becomes bad ;~;","replies":[{"poster":"PhRoXz0n","date":"2015-01-20T07:15:23.330+0000","up_votes":2,"down_votes":0,"body":"There will be some tentative changes on the PBE for Fizz within a few days looking to alleviate some of the concerns, especially the up front burst from his Q and giving him more gameplay in general while still keeping the trickster element to him. \n\nWe definitely look at off builds. Take the Tristana rework for example, where we wanted to keep the AP off-build AND also give it more gameplay (tension between jumping in first, or stacking up the bomb and then jumping). We also look at and test off builds than can potentially arise as a result of the changes (where an off-build previously didn't exist).","replies":[]}]}]}]}]}]},{"poster":"PhRoXz0n","date":"2015-01-20T01:38:59.454+0000","up_votes":2,"down_votes":0,"body":"What about the Riven! :)","replies":[{"poster":"Blood Harvest","date":"2015-01-20T02:30:30.952+0000","up_votes":1,"down_votes":0,"body":"https://www.youtube.com/user/unswlolsoc\nIs that you\nCongratz, Your videos helped so much in understanding alot of things\n\n:)","replies":[{"poster":"PhRoXz0n","date":"2015-01-20T07:23:18.641+0000","up_votes":2,"down_votes":0,"body":"Yup! I'm glad they helped :)","replies":[]}]}]},{"poster":"Umi","date":"2015-01-20T02:35:42.197+0000","up_votes":2,"down_votes":0,"body":"o r i b o y s","replies":[]}]},{"poster":"Martikle","date":"2015-01-20T02:00:48.040+0000","up_votes":4,"down_votes":0,"body":"Hey Meddler, I was looking for feedback on this champ concept I made but it got no exposure, could you take a look at the kit?\n\npassive: Blinding Beam: Flik’s auto attacks charge up, slowing enemies by 10%, scaling up to 30% the longer he waits between attacks. This effect cannot occur on the same target within 6 seconds.\n\nQ: Flux/Zip: Shoots a ball of energy latching onto first ally in its path, tethering the ally and giving a short move speed buff. If cast again within the duration, it pulls Flik to his ally.\n\nW: Radiating Pulse: Emits energy at a target location, shielding allies for x amount split evenly among targets within area, dealing a small amount of damage and healing (50/75/100/100/100%) of damage dealt to marked targets\n\nE: Radiating Pulse: Emits energy at a target location, shielding allies for x amount split evenly among targets within area, dealing a small amount of damage and healing (50/75/100/100/100%) of damage dealt to marked targets\n\nR: Hextech Sanctuary: for .5 seconds then creates an energy bubble, knocking back all enemies within the bubble. The shield dissipates all incoming auto-attacks, abilities, and projectiles that hit the bubble. (the entire duration is channeled by Flik)\n\n[http://imgur.com/jmlsUXo](http://imgur.com/jmlsUXo)","replies":[{"poster":"Meddler","date":"2015-01-20T02:20:03.745+0000","up_votes":5,"down_votes":0,"body":"Few quick thoughts:\n\nIs the goal with the passive that Flik will sometimes avoid attacking to charge up the slow? Could see that creating some interesting gameplay in lane,   might just become a weak slow all the time in full on fights if he's just auto attacking constantly. Did you have a particular role in mind for Flik?\n\nThe Q (as per image - you've double copied the E description in your post there) looks like a pretty solid general skill. Tagging an enemy for your team to focus down, with an extra reward for doing so, rewards and encourages good teamplay so that's a definite plus.\n\nThe W might end up being a bit unreliable relative to its power (move to ally's a useful effect, but doesn't need to be limited as much move to enemy). Assuming you like the skillshot aspect could be a good spot to add something really cool and signature as an extra reward for comboing with an ally. \n\nI'd expect the E to run into problems because of the way it spreads the shield out between multiple people, which means that placing it so all the shield goes on a single person's almost always the best play (a 600 point shield spread between 5 people's 120 each, which a single weak AOE removes, on one person though it's 600 points of shield, which is really powerful). \n\nThe ult would feel awesome to use, probably going to feel pretty tough to play against though. Something to think about there's what the action, as the enemy, that I should take to play against this ability? Knocking back enemies and then blocking spells and auto attacks from all directions is really powerful, so giving the enemy team a way to try and play around it (in addition to the initial delay) would make for an easier to balance and more enjoyable to play against skill.","replies":[]}]},{"poster":"Pastel","date":"2015-01-20T02:17:03.561+0000","up_votes":5,"down_votes":0,"body":"How has the way you've approached female champions changed since the game's initial release? I know a lot of earlier female champions were more sexualized during their conception than their current appearance due to various updates to that character. They also greatly differ from female champions released more recently, such as Kalista or Vi. I'd be really interested in hearing about the responses within Riot that may have pushed League into this direction.","replies":[{"poster":"Meddler","date":"2015-01-20T02:33:39.393+0000","up_votes":4,"down_votes":0,"body":"Something we've been aiming for is to get a greater variety of appearances/tones for champions of both genders. There were a couple of years there where many of our female champions especially ended up looking pretty similar and we've been making an effort to try and avoid that. That's not to say we won't continue to make attractive champions, male and female, where appropriate for their character, but that we also want a wide range that includes champs like Kalista and Rek'Sai as well. \n\nI can't speak with personal experience about the intent around the game's initial release, that was well before my time at Riot. Certainly there seems to be a lot of support internally for the greater variety we've been exploring recently though.","replies":[{"poster":"Destínum","date":"2015-01-20T13:06:31.961+0000","up_votes":2,"down_votes":0,"body":"What about skins? As far as I've seen, the improvment of your approach to skins has been going much slower than with champions. An example is how lightly dressed male characters (like Yasuo and Varus) always has at least one skins where their outfit is completely body covering (or even wearing a full set of armor!), but for female champions (like Nidalee and Katarina), the low amount of clothes seem to be seen as part of their identity. \n\nAnother example is masked/helmeted champions, where male ones (like Zed, She, Pantheon or even Singed) are always wearing something to cover their face, where females (like Kayle and Akali) have pretty much lost this as part of their identity due to having too many unmasked skins.","replies":[]}]}]},{"poster":"Aver","date":"2015-01-20T04:58:10.669+0000","up_votes":4,"down_votes":0,"body":"Hi Meddler & Xypherous, I've herd alot about you on surrender@20 XD .\n\nAnyways I just wanted to ask  (i know your not in the lore department) what is the relationship between {{champion:267}}  and {{champion:131}} . Seeing as Nami is looking for her ancient 'moon stone' and Diana is the 'human form' of the 'vengeful moon'! is Riot aware of this or not?. \n\nAlso i just wanted to say Thank you  for the new Q on {{champion:103}} because being one of my favorite champions, it interested me the changes that were made, A lot of people think shes going to still be useless after {{item:3128}}  removal. I sort of agree but then i think about {{champion:103}}  and she was designed to be a super mobile mage but her only mobility spell is her ult \"But its like 3 flashes\" yea i'm not complaining but i think this new move speed on  Q is going to make her so much more fun to play! XD. \n\nAnd just one last thing {{champion:55}}  is Sooo much fun and shes the best champion i ever bought and please tell Riot Ezreal or the champion rework team that they couldn't have done a better job :D. so Thanks again and thanks for talking to us on Oceania!!!\n\nAnd Syndra (since you made her) has an awesome theme and playstyle!","replies":[]},{"poster":"Glow","date":"2015-01-20T01:34:51.800+0000","up_votes":3,"down_votes":0,"body":"Hey Meddler! I chatted to you briefly at PAX Aus, and was too shy to ask a pressing question which I hope you don't mind me asking now. I'm really curious as to how you came to work at Riot - I share your country of origin and would love to work for Riot one day but it's terrifying considering how far (figuratively and literally) I've got to go to get there! Do you have any advice for an aspiring Concept Artist?\n\nSounds like you've been a part of some fantastic designs, really cohesive champions all round. Thanks for doing this Q&A! :)","replies":[{"poster":"Meddler","date":"2015-01-20T01:56:31.969+0000","up_votes":4,"down_votes":0,"body":"Doh, you should have asked, always happy to chat! Do hit me up with if at a show again that I'm at. Few details on how I got into Riot in another reply here:\n\nhttp://boards.oce.leagueoflegends.com/en/c/miscellaneous/bRM5LnY0-meddler-lead-champion-designer-qa?comment=000d0000\n\nI'm not the best one to offer advice on concept art alas, not an area I've got any real expertise in. As with most disciplines though being able to demonstrate what you've worked on, talk about the process you follow and the constraints you had (whether self imposed or external) is extremely valuable when trying to sell yourself. Doing that from overseas (given the limited number of game dev opportunities in NZ) does make things a bit tougher, some companies are open to overseas applicants though and will help with the visa process for people they feel are a good fit.","replies":[]}]},{"poster":"xenbay","date":"2015-01-20T01:11:12.342+0000","up_votes":2,"down_votes":0,"body":"Hey Meddler! I really love playing Syndra and have a lot of fun with her, my questions: 1. How difficult was it designing a champion who relied on her q ability for every other spell. 2. How did you guys come up with the idea of her incredibly bursty ult?","replies":[{"poster":"Meddler","date":"2015-01-20T01:17:57.485+0000","up_votes":4,"down_votes":0,"body":"Took a little while to hit upon the Q as the foundation of the kit, though then felt obvious in retrospect since her original concept art featured her spheres so prominently. Once the basic idea of 'Q generates objects, other spells manipulate them' came together things were relatively smooth. \n\nThe intent with her ult was to give her a reliable tool (given her other abilities were all skillshots) and allow her to punish someone caught out of position or diving into her team (theory being that as a non mobile mage she'd have limited target selection). Ended up being a bit more of a 'burst down a key target after stunning them' ability than originally intended. It's counterplay's a bit lower than I'd like in that regard, though having said that champs do often need tools like that if they're to compete with other highly mobile options.","replies":[]}]},{"poster":"Zero Sight","date":"2015-01-20T01:11:35.301+0000","up_votes":2,"down_votes":1,"body":"just wanted to say heya as ziggs might be my fav champ ever ","replies":[{"poster":"Meddler","date":"2015-01-20T01:12:31.957+0000","up_votes":4,"down_votes":0,"body":"Thanks! He was the first champ I got to work on properly so I've still got a real soft spot for him myself (and still really happy with how he turned out, voice, animations and visual effects especially). ","replies":[]}]},{"poster":"XeRo Yuki","date":"2015-01-20T01:07:30.909+0000","up_votes":3,"down_votes":0,"body":"Hey Meddler When you made varus did you have intentions of making a ADC without a reliable escape *besides his ult* to try step up to top tier adcs? or just more as a poke you down and shred with peel sort of champs?","replies":[{"poster":"Meddler","date":"2015-01-20T01:11:44.182+0000","up_votes":4,"down_votes":0,"body":"The intent with Varus was to make a champion with strong poke, a lot of utility by ADC standards and reasonable auto attack damage, in exchange for low burst and mobility. Fitting into the gap between Ashe at one end of the immobile spectrum (heaps of utility, lowest ADC damage) and Kog'maw at the other end (heaps of damage and poke). \n\nBeen thinking recently we might want to strengthen his poke a bit (possibly by tying his passive into more than just his auto attacks). Haven't had a chance to bounce any thoughts about that off the live balance team yet though, see what their current thinking is.","replies":[]}]},{"poster":"ClickToMiniMise","date":"2015-01-20T04:00:37.680+0000","up_votes":1,"down_votes":0,"body":"Why do you end up discontinuing champions such as; Blind Monk, Omen, Sand mage. and end up releasing them again with different names. Lee sin, Rek sai, and Azir are all very fun champions why where they stoped in development long ago and then re released?","replies":[{"poster":"Xypherous","date":"2015-01-20T04:24:53.491+0000","up_votes":3,"down_votes":0,"body":"For Omen and Sand Mage at least, a large part of this was that we didn't really have the tech infrastructure to really bring their fantasies to life.  There's a lot of under the hood work that both those champions needed that wasn't exactly available at the time.\n\nAt some point, Orianna was 'cutting-edge' tech wise for us.  The things that these guys required make her look primitive in comparison.","replies":[]},{"poster":"Meddler","date":"2015-01-20T04:26:16.724+0000","up_votes":1,"down_votes":0,"body":"Sometimes champions don't work out and we'll cancel them. That was the case with Blind Monk, Omen and Sand mage. In the case of Blind Monk and Sand Mage we decided the core idea was worth trying again, and went back to them and gave it another shot. The versions of those champions that got released are really different to the originals that were stopped at the time though.","replies":[{"poster":"ClickToMiniMise","date":"2015-01-20T04:43:36.093+0000","up_votes":2,"down_votes":0,"body":"oh ok thats cool. :D its nice to hear that u didnt just give up on the champions. Could u give a hint or anything on the new champion/s that you are working on currently if your are working on any champions. i myself like monster champions like kha and rengar best. what about you.","replies":[]}]}]}]}