{"poster":"Poison Evy","date":"2017-10-12T09:35:23.918+0000","title":"Bug Aram?","subforum":"Aiuto e supporto","up_votes":1,"down_votes":0,"body":"Oggi verso le 11:00 ho deciso di fare un Aram, tutto normale sin qui. Entra nella  schermata , mi esce Quinn, seleziono rune e maestria. Alla fine del Cd non mi si apre la schermata caricamento dei Pg, anzi ho schermata base con scritto &quot;Riconnettiti&quot;. Ho provato di tutto , ho riavviato pc, gioco, chiuso e riaperto. La connessione mi andava a meraviglia. ho scritto pure al supporto ma la domanda che mi preoccupa &egrave;: I report dei miei compagni conteranno cmq? Cio&egrave; non sono andato afk, non mi &egrave; stato proprio permesso dal gioco di entrare in partita. Vi &egrave; successo? Consigli?","replies":[{"poster":"Chroniicles","date":"2017-10-13T08:47:12.513+0000","up_votes":1,"down_votes":0,"body":"Ciao! Purtroppo anche se i tuoi compagni non ti avessero reportato, per questo genere di cose scatta in automatico il controllo del Leaverbuster... però se è la prima volta che ti succede un episodio del genere, non c'è nulla di cui preoccuparsi perchè il primo \"sgarro\" viene perdonato, in caso contrario potrebbero esserti assegnate delle code a bassa priorità. Purtroppo non c'è distinzione tra un leaver intenzionale e chi, come te, ha avuto un problema tecnico prima dell'inizio del game, neanche il supporto giocatori potrà aiutarti in tal senso.\nL'unica cosa che si può fare, è evitare ricapiti in futuro: può essersi trattato di un problema isolato del tuo gestore (navigare verso altre \"destinazioni\" non garantisce che il server di Lol possa essere raggiunto in quel momento), controlla comunque che siano impostate le eccezioni per il client su firewall e antivirus, e controlla anche se i permessi sono impostati correttamente aiutandoti con [questa guida](https://support.riotgames.com/hc/it/articles/204134104-Impostare-le-autorizzazioni).","replies":[]},{"poster":"Sexy Win","date":"2017-10-12T09:40:44.845+0000","up_votes":1,"down_votes":0,"body":"> I report dei miei compagni conteranno cmq? \n\nSi.\n\n>  Cioè non sono andato afk, non mi è stato proprio permesso dal gioco di entrare in partita. Vi è successo?\n\nMai.\n\n> Consigli?\n\nDi solito ciò che da più fastidioè un processo del client che ogni tanto scazza e non fa riaprire il client, se no non saprei così a caldo.\n\n\nElena?","replies":[]}]}