{"poster":"Casel2","date":"2018-02-26T04:58:49.722+0000","title":"La dificultad absurda de algunas \"S\"","subforum":"Problemas Técnicos","up_votes":5,"down_votes":3,"body":"Hola, no soy de quejarme por esto pero actualmente soy m6 Ahri con una pieza de m7, acabo de jugar y sali 13/2/11 con 12k de oro y mas de 125 minions, y solo recibi una A...osea, ayude en objetivos, rote, mori poco, farmie bien, tire varias torres y aun asi solo una A? aclaro que la partida duro 32 min por si tiene algo que ver...no entiendo como con jinx en una partida de 45 min sali 2/0/3 y me saque una S+ teniendo casi el mismo farm que recien y ahora no me saque una S, que alguien me explique esto porque se me esta haciendo imposible subirla a m7 {{sticker:sg-ahri-3}}","replies":[{"poster":"PWG Raeghast","date":"2018-02-26T06:09:15.890+0000","up_votes":2,"down_votes":0,"body":"Si terminabas la partida al minuto 15 con ese cs ibas tranqui, pero al min 32... te quedaste corto amigo.","replies":[{"poster":"Casel2","date":"2018-02-26T15:19:56.997+0000","up_votes":1,"down_votes":0,"body":"como ya dije, me fue dificil tener mas farmeo con tanta tf, rotacion y objetivos...si se hubiera alargado mas la partida quiza si hubiera podido pero ni siquiera llegamos al late donde es puro pushear que ahi hubiera aprovechado","replies":[]}]},{"poster":"FELIX BIZZLE","date":"2018-02-27T07:40:09.241+0000","up_votes":1,"down_votes":0,"body":"Si aún no es tarde para comentar, yo igual coincido con los demás: el farmeo. La verdad, yo en una partida termine 17/7/11 con más de 200 farm y  pues, tuve mi S. \n\nIntenta farmear más y si vas a ayudar a otra línea, aprovecha a farmear en ese momento después de que asesinaran al enemigo o derribo de  torre.","replies":[]},{"poster":"La Q de Irelia","date":"2018-02-26T16:37:52.703+0000","up_votes":1,"down_votes":0,"body":"EL FARM ES LO Primordial","replies":[]},{"poster":"TürÅmßäR","date":"2018-02-26T10:43:04.676+0000","up_votes":1,"down_votes":0,"body":"fameeeeeeeeeeeeeeo, un mid debe farmear mas, con 32min de partida creo q minimo para S deberías haber hecho 200cs","replies":[{"poster":"Casel2","date":"2018-02-26T15:17:47.349+0000","up_votes":1,"down_votes":0,"body":"No pude farmear mucho por andar rotando, haciendo torres, objetivos y ya sabes, eran puras tf o todos estabamos en la misma lane peleando y claro, no es tan simple tener 200 de farm en una partida asi, menos si terminas con mi KDA final","replies":[]}]},{"poster":"The Upside Down","date":"2018-02-26T13:59:52.440+0000","up_votes":1,"down_votes":0,"body":"125 de farm es poco para 32 minutos. Mínimo 200.","replies":[]},{"poster":"Top Lucian","date":"2018-02-26T11:57:29.229+0000","up_votes":1,"down_votes":0,"body":"La S depende de Muuuuchas cosas. No solo del score (KDA, Farm y Oro) si no también de visión, centinelas puestos, etc.","replies":[]},{"poster":"Zelos From Jonia","date":"2018-02-26T10:53:26.792+0000","up_votes":1,"down_votes":0,"body":"104 al minuto 15, al minuto 32 125 es bastante poco, no digo que sea ese el factor de la s. En realidad el juego no se basa en perseguir s, si maineas un champ deberia llegar eventualmente, el problema es que todo se tergiversa.\n\nSaludos, Zelos!","replies":[]},{"poster":"BatBoy","date":"2018-02-26T07:38:50.590+0000","up_votes":1,"down_votes":0,"body":"Farmea mas y has mas daño, acuerdate que una S es usar el champ a un alto nivel, almenos mas que la media(en la mayoria de los casos, ej, una m7 con riven no significa nada, es muy facil conseguirla en comparacion a la dificultad real del campeon), o sino prueba ahri en otros roles que lo juege menos gente","replies":[]},{"poster":"Tortuguita","date":"2018-02-26T05:16:42.509+0000","up_votes":1,"down_votes":0,"body":"No mueras , farmea mas que 132 minions y participa en casi todos los objetivos. No es tan difícil xD\n\nYo tengo maestría con Kha'zix yendo full ad top , con Olaf full ad top y Nasus full ad top así que lo que se dice difícil no es en absoluto , eso si son muy caras las Maestrías 7","replies":[{"poster":"Casel2","date":"2018-02-26T05:19:56.557+0000","up_votes":1,"down_votes":0,"body":"A ver...dificil, dificil no es pero tu crees que merecia una A? yo opino que no la verdad. y lo de las Maestrias dijeron que lo iban a bajar a 2400 ea en el parche 8.5 o 8.6","replies":[{"poster":"Tortuguita","date":"2018-02-26T05:22:17.367+0000","up_votes":1,"down_votes":0,"body":"Nope , con ahri es muy fácil superar ese resultado la verdad. Hago mucho hincapié en el farmeo :P\n\nSep , sera cosa de esperar.","replies":[]}]}]},{"poster":"AdriAuditore","date":"2018-02-26T05:09:25.072+0000","up_votes":1,"down_votes":0,"body":"Coincido con vos. No entiendo como funciona eso, he dado partidas flojas, y he sacado S y en partidas en las que me lucí, me ponía re contento pensando \"Chau, tengo S, vamo noma\" y al final \"A-\" o \"A\" y me quedo de cara jaja. Me gustaría entender como funciona esto, si alguien sabe, que nos lo explique c:","replies":[{"poster":"Casel2","date":"2018-02-26T05:15:58.329+0000","up_votes":1,"down_votes":0,"body":"Opino que Riot deberia de dejar ese misterio de como sacar S y poner lo que se necesite, tantas kills, tantas muertes, tantas asist, tanto oro, tantos minions dependiendo cada posicion, porque es medio absurdo esforzarse por hacer una buena partida sin saber cual sera el resultado que tendras, para el \"misterio y sorpresa\" estan las cajas","replies":[]}]}]}