{"poster":"UltraZ","date":"2020-02-05T22:42:24.580+0000","title":"Ich habe mich verschlechtert und weiß nicht warum...","subforum":"Champions & Gameplay","up_votes":2,"down_votes":0,"body":"Hallo liebe LoL Community,\nich habe ein in letzter zeit das Problem, dass ich einfach schlecht bin.\nIch habe vor einem Jahr LoL angefangen und wurde G1 eingerankt.\nDiese Saison geht noch nicht so lange, aber ich bin stuck Silber 1!\nHabe auch damals auch nicht direkt sowas mit Malz angefangen, sondern habe direkt sowas wie Akali,Irelia,lb gespielt, wo Qiyana raus kam hab ich sie auch geontrickt und **HATTE** viel spaß an an ihr.\nIch habe dann eine woche lang ADC gespielt, da ich ADC main werden wollte.\nHab mich dann doch nicht dazu entschieden, weil es mir zu wenig auswahl war.\nSpiele auf der Midlane auch nicht wirklich was anderes ausser Qiyana, aber Qiyana hat auch einfach Fun gemacht.\njetzt habe ich Qiyana 30 games wieder gespielt, hatte auch eine 8er Winning streak im Ranked aber am nächsten Tag hatte ich nicht das gefühl, dass ich nicht mehr weiß, wie ich Qiyana.\nDann habe ich 4 Games nur noch durch geintet und war auch 3 mal afk (ich weiß, ist nicht okay...). &lt;-- War alles im Normal\nJetzt trau ich mich nicht mehr Qiyana zu spielen, da ich nur inte und wenn ich inte, macht es mir nicht spaß und ich zerstöre den anderen das Spiel.\nLiegt das daran, weil ich ne woche ADC gespielt habe oder warum ist das jetzt so komisch?\nLG\nUltraZ","replies":[{"poster":"aIoneintokyo","date":"2020-02-06T07:39:33.186+0000","up_votes":3,"down_votes":0,"body":"Hey,\n\neventuell liegt es daran, dass du im letzten Spiel z.b. gegen eine Camille die Platin war antreten musstest. Letzte Season war der Platin 1, siehe link -> https://www.leagueofgraphs.com/de/summoner/euw/epic+adc+main\n\nDas passiert dir im Ranked seltener aber die Gameknowledge von der Camille, ist halt doch etwas besser.","replies":[{"poster":"UltraZ","date":"2020-02-06T15:18:46.537+0000","up_votes":1,"down_votes":0,"body":"Das ding ist, es ist mir egal welche elo die sind, ich mein es gibt einen Grund warum die mit mir in einer Runde sind.\nHeißt entweder haben die eine kack mmr oder ich halt eine gute.\nIch habe auch vorher Plat - Dia spieler easy gemacht, aber jetzt krieg ich es nicht mehr gegen gold spieler hin...","replies":[]}]},{"poster":"Cenâreth","date":"2020-02-06T08:51:11.156+0000","up_votes":1,"down_votes":1,"body":"Du rankest praktisch 1 - 1/2 Elo vor deiner letzten Elo ein, ergo in deinem Fall Silber 1. Bedenke dass die gegen die du letzte Saison spielen musstest ebenfalls in dem Bereich sind. Da Riots Bann Politik im Vergleich zu Blizzards (da werden eben nun mal direkt IP Banns ausgesprochen) sehr utopisch ist. Musst du halt damit klar kommen, dass du also die gleichen Spieler haben wirst die auf dem Elo Bereich mit dir spielen werden.\nEntweder du spielst DuoQ oder quälst dich halt damit ab.","replies":[]}]}