{"poster":"RivenSmurfs","date":"2015-05-11T00:05:23.007+0000","title":"20 things to do before you die","subforum":"Miscellaneous","up_votes":6,"down_votes":0,"body":"\n1) Look at see through glass and when someone is on the other side shout \"OH MY GOD, IM HIDEOUS!\"\n2) Bring a big chair into the elevator facing away from the door and when someone walks in, dramatically turn and say &#039;we&#039;ve been expecting you.&#039;\n3) Walk up to someone, hand them a potato, look them in the eyes and deadpan &#039;with great power, comes great responsibility.&#039; Walk away.\n4) Call someone to tell them you can&#039;t talk right now.\n5) Point at someone and shout \"You&#039;re one of them!\" Run and pretend to trip. Crawl away slowly.\n6) Buy a donut and complain that there&#039;s a hole in it.\n7) Put Mayonnaise in a bowl, freeze it, and tell your friend it&#039;s ice cream.\n8) Put up a \"Lost Dog\" poster with a picture of a cat on it.\n9) In a public toilet, pass a note under the door next to you saying, \"They&#039;re onto us. We need to go.\"\n10) Walk up to a random person and say, \"Wow! You&#039;ve changed, I still have your picture from five years ago.\" And hold up a picture of potato.\n11) Call McDonalds asking for directions to Burger King.\n12) Order a pizza 5 minutes before New Years, and when it comes, yell, \"I ORDERED THIS THING A YEAR AGO!\n13) Bring a desk on an elevator. When people try to get on ask if they have an appointment.\n14) Go to an electronic store with a banana and say that you want to upgrade to an apple.\n15) Call Pizza Hut and ask for the phone number to Domino&#039;s.\n16) Hide a walk talkie in a bush and scare people that walk by.\n17) Get on a crowded elevator with a bag in your hands, sigh and say \"darn my snake got loose again\".\n18) When someone asks you if you know what time it is, say yes and walk away.\n19) Dress up as a duck and throw bread at people and say,\"HOW DO YOU LIKE IT?!! HUH?!!!!\n20) Go to a pet shop, point at an employee, and shout \"I WANT THAT ONE MOMMY!!!\"","replies":[{"poster":"Sora NGNL","date":"2015-05-11T00:08:32.976+0000","up_votes":3,"down_votes":0,"body":"This is the best thing i have ever read{{item:3073}}","replies":[]},{"poster":"2Kills1Cat","date":"2015-05-13T11:33:56.235+0000","up_votes":2,"down_votes":0,"body":"you made my month so hilarious wanted to do stuff like this but never thought of something funny that i can get away with without people raging too much. I've always wanted to go to the middle of the city stand still and randomly slide under as many people as possible to trip them and see if i get a strike like im playing bowling but police would get me before i manage to get out of the people mess","replies":[]},{"poster":"Urgot Bot","date":"2015-05-12T06:59:48.884+0000","up_votes":1,"down_votes":0,"body":"https://www.youtube.com/watch?v=qZ7kcjCpxSw","replies":[]},{"poster":"Lost In Time","date":"2015-05-12T06:46:22.997+0000","up_votes":1,"down_votes":0,"body":"Fukken saved.","replies":[]},{"poster":"Riven Carrys U","date":"2015-05-11T22:11:44.500+0000","up_votes":1,"down_votes":0,"body":"Wow lol.","replies":[]},{"poster":"MAMASWAN","date":"2015-05-11T11:25:17.127+0000","up_votes":1,"down_votes":0,"body":"Drink cyanide or inhale doritos powder{{champion:19}}","replies":[]},{"poster":"SEKAI","date":"2015-05-11T05:01:18.992+0000","up_votes":2,"down_votes":2,"body":"> 1) Look at see through glass and when someone is on the other side shout \"OH MY GOD, IM HIDEOUS!\"\n\nAnd the glass breaks on your face..... lele\n\n> 3) Walk up to someone, hand them a potato, look them in the eyes and deadpan 'with great power, comes great responsibility.' Walk away.\n\nAnd he just throw it at you with a smirk and walk away lele.\n\n> 4) Call someone to tell them you can't talk right now.\n\nAnd you just did! _pa da chin _ (drum sound) lele\n\n> 11) Call McDonalds asking for directions to Burger King.\n\nAnd the teeny employee in Maccas points you to airport lele.\n\n> 14) Go to an electronic store with a banana and say that you want to upgrade to an apple.\n\nAnd they ask you \"have you tried turning it on and off again?\" lele.\n\n> 15) Call Pizza Hut and ask for the phone number to Domino's.\n\nAnd the guy says \"What a coincidence, this is the correct place you're looking for. What would you like sir?\" lele\n\n> 20) Go to a pet shop, point at an employee, and shout \"I WANT THAT ONE MOMMY!!!\"\n\nAnd they say \"Just go home champ.\" lele\n\n____\n\nBut yer you can totally start a TV show featuring you doing all that to random people and film their reactions, pretty sure this type of thing was still going a little while ago maybe no so much now.\n\nSo it's time for you to shine OP!","replies":[{"poster":"RivenSmurfs","date":"2015-05-11T07:15:58.516+0000","up_votes":1,"down_votes":0,"body":"xD","replies":[]}]},{"poster":"Bipolar","date":"2015-05-11T04:48:41.131+0000","up_votes":1,"down_votes":0,"body":"number 4 I have done already.\n\nI'm absent minded.","replies":[]},{"poster":"Talon12","date":"2015-05-11T03:02:25.880+0000","up_votes":1,"down_votes":0,"body":"> Will you do one of these things?\n\nCrazy if you wouldn't\n\nI got 15-20 to go 1-14 complete","replies":[]}]}