{"poster":"Katrakit","date":"2016-11-29T23:52:16.215+0000","title":"Just had a massive FPS drop as Elementalist Lux that cost me a game.","subforum":"[ARCHIVED] Help & Support","up_votes":3,"down_votes":0,"body":"GeForce GTX 1070\nIntel Core i5 3570K\n16 GB RAM\nGame installed on Samsung SSD\nWindows 10\n\nI don't know if this is a bug or my own error, but I'd love to get some help either way.\n\nI was playing Elementalist Lux in a multiplayer game today and at about 10 minutes my FPS went from a consistent 60 down to between 2-14. This did not stop throughout the game, and when I tried to get out of the Defeat screen, the game crashed. I know these FPS's because I had the GeForce recorder showing it to me. Otherwise, I tried to close every background app that was taking any sort of memory whatsoever. Nothing changed. I switched to very low graphics settings. This too, did not help. This has never happened to me before. \n\nPlease help me. I would like to be able to play League, but I can't help my team if I'm playing at 2 FPS. Please help me fix this.\n\nEdit:\n\nTo offer some context about my computer right now, I am currently running Dishonored 2 on Ultra settings at 60 FPS with multiple apps in the background. For this reason, I don't think a background app is limiting my performance.","replies":[{"poster":"Targons Blade","date":"2016-11-30T03:44:32.177+0000","up_votes":1,"down_votes":0,"body":"Is this FPS issue only happening when playing Elementalist Lux?","replies":[{"poster":"Mimyru","date":"2016-12-01T22:16:41.920+0000","up_votes":1,"down_votes":0,"body":"I've noticed this problem as well, and yes it appears to only happen when playing Elementalist Lux. I've played other champions with FPS fluctuating between 110-170, but with Elementalist Lux it will drop to between 30-70 and it gets kind of choppy.","replies":[{"poster":"Mimyru","date":"2016-12-01T22:55:02.688+0000","up_votes":1,"down_votes":0,"body":"Side note, it happens in any game with elementalist lux whether i'm playing her or not. Also had a few other people i've played with have the same issue.","replies":[{"poster":"Targons Blade","date":"2016-12-02T01:00:14.312+0000","up_votes":1,"down_votes":0,"body":"Hmmm. It's possible there's an issue with the skin's assets inside your game folder. [Running a repair](https://support.riotgames.com/hc/en-us/articles/201752684-Low-Frame-Rate-FPS-Troubleshooting#wq5) should resolve this if this is the case.\n\nLet me know if that helped.","replies":[{"poster":"Typhlosion2550","date":"2016-12-02T19:49:47.022+0000","up_votes":1,"down_votes":0,"body":"For me i was in the loading screen and crashed. Then they had to remake and i got a leaverbuster and it said an error has occured. Is that similar?","replies":[]}]}]}]},{"poster":"dunkeroni","date":"2016-12-02T16:34:21.604+0000","up_votes":1,"down_votes":0,"body":"I used to have this problem for the better part of Season 4 against Syndra wave ability graphics before upgrading my computer. It might be an issue with glow effects on certain processors. I never found a real fix for it, but a few updates and a new computer later, it was gone.","replies":[]}]},{"poster":"flirty","date":"2016-11-30T04:40:08.847+0000","up_votes":1,"down_votes":0,"body":"I've been having minor FPS drops with the new Elementalist skin as well. It seems to only be noticeable when I have my camera locked onto Lux, though. Then my frames drop. I've never had this issue before.","replies":[]}]}