{"poster":"radonek","date":"2015-08-05T07:26:13.273+0000","title":"cada vez que se caiga el server en latino america que regalen 570 de rp","subforum":"Charlas Generales","up_votes":3,"down_votes":15,"body":"yo ya me canse de que a cada rato se caiga el server y ahora me gustar&iacute;a que cada vez que se caiga den rp por lo menos que nos den algo por cometer un error aparte no gastan nada y nos recompensaran por un error que cometen ellos no es mala idea","replies":[{"poster":"Rayxah","date":"2015-08-05T07:28:00.123+0000","up_votes":11,"down_votes":0,"body":"Y cada vez que hagas un post diciendo que se cayó el servidor, cuando en realidad está en mantenimiento, nos das la misma cantidad por no leer, ¿te parece? :P.","replies":[]},{"poster":"GødLîkë","date":"2015-08-05T07:38:08.075+0000","up_votes":2,"down_votes":0,"body":"Hay que leer un poquito antes de entrar al foro y quejarse.\n\n> Debido al mantenimiento de las 04:00 AR, las colas para partidas clasificatorias serán desactivadas a partir de las 2:30 AR.\n\n> El 08/05/15 por la madrugada se estará implementando la versión 5.15 de League of Legends. A partir de las 04:00 (MX/CO/PE), 04:30 (VE) comenzarán las tareas por parte del equipo de implementación. Se calcula que el despliegue de esta actualización demorará aproximadamente unas 6 horas. En caso de extenderse, les mantendremos al tanto sobre el estado de la actualización en esta misma conversación.\n\nEste mensaje esta hace 2 dias mas o menos en la pagina de Estado\nhttp://status.leagueoflegends.com/?es_MX#las\n\nY el mismo mensaje estaba en la parte superior del cliente desde hace unas cuantas horas.","replies":[{"poster":"JACKY FANBOY","date":"2015-08-05T13:24:42.774+0000","up_votes":1,"down_votes":0,"body":"no tiene mas de 10, esta aprendiendo a leer","replies":[]}]},{"poster":"kique1","date":"2015-08-05T07:36:58.302+0000","up_votes":2,"down_votes":0,"body":"No se cayó, está en mantenimiento como en todos los parches normales.","replies":[]},{"poster":"wintermoon","date":"2015-08-05T14:52:34.823+0000","up_votes":1,"down_votes":0,"body":"Nunca pasará","replies":[]},{"poster":"SenpaiDeathx","date":"2015-08-05T09:49:19.309+0000","up_votes":1,"down_votes":0,"body":"En este caso de publicaciones....debería estar permitido el trolleo xDD","replies":[]},{"poster":"Shappaw","date":"2015-08-05T08:16:15.021+0000","up_votes":1,"down_votes":0,"body":"Encima algunos votaron por \"que regalen rp\" Jajajajaja. Increíble.","replies":[]}]}