{"poster":"Acaî","date":"2016-09-17T15:30:57.621+0000","title":"cant find out what skin i got","subforum":"[ARCHIVED] Help & Support","up_votes":2,"down_votes":0,"body":"I got a mystery skin from Riot's 10th year anniversary but I don't remember what it is since i closed it. \r\n   Help?","replies":[{"poster":"Master of Frost","date":"2016-09-18T00:50:25.110+0000","up_votes":1,"down_votes":0,"body":"i had this problem too. Only the icon showed up in the gift and the purchase history....","replies":[]},{"poster":"Porocles","date":"2016-09-17T16:25:51.754+0000","up_votes":1,"down_votes":0,"body":"The pop up notification you received was for the anniversary icon, and you may not receive the same pop up for the mystery gift.  It may show up on your purchase history, but keep in mind that a lot of players have not received them yet.  There are a lot of eligible accounts to gift, so it's going to take some time to get all of that sorted out.  Stay updated on our [support banner](https://support.riotgames.com/hc/en-us/articles/227317608--Sept-14-Anniversary-gifts-are-currently-being-distributed-You-may-not-receive-them-right-away-so-please-be-patient-) until this is complete.  Hang tight!","replies":[]},{"poster":"Angel Phoenix","date":"2016-09-17T16:00:27.556+0000","up_votes":1,"down_votes":0,"body":"the gifts are still being distributed, with the 23rd being the final day. If you're absolutely sure you haven't received a mystery gift by then, I'd suggest making a support ticket. #totallydidntcopypaste","replies":[{"poster":"afroninjadafuq","date":"2016-09-17T16:09:49.965+0000","up_votes":1,"down_votes":0,"body":"It said I got a mystery gift, It didn't say what it was. That's the whole point of this thread.","replies":[]}]},{"poster":"Dehitay","date":"2016-09-17T15:41:18.042+0000","up_votes":1,"down_votes":0,"body":"I think I'm having the same problem. But I didn't close it without remembering; it just never told me what I got. It said I was getting a celebration reward, but said nothing about the mystery gift I was supposed to get because I already owned Riot Kayle. I checked my purchase history and the icon was in there, but nothing about a new skin.","replies":[{"poster":"afroninjadafuq","date":"2016-09-17T15:59:50.833+0000","up_votes":1,"down_votes":0,"body":"Same problem.\nHow can I find out what I got?","replies":[]}]}]}