{"poster":"Ionic","date":"2017-02-15T15:46:34.090+0000","title":"LP Verlust nach Double DC","subforum":"Allgemeiner Chat","up_votes":1,"down_votes":2,"body":"Hey Leute,\r\n\r\nich hatte grad ein Spiel bei dem zwei Leute gequitted haben oder aus dem Spiel geflogen sind und ich frage mich, warum ich trotzdem die vollen LP verlieren muss. Weiss jemand warum Riot hier keine Funktion einbaut, bei der man nach DC oder Leaven eines Teammates einfach weniger LP verliert? Ob die gebanned werden oder nicht ist mir relativ egal, ich bin der Depp der wegen denen das Spiel verloren hat. \r\n\r\nW&auml;re auch cool, wenn sich hier ein Riot Mensch dazu &auml;u&szlig;ern k&ouml;nnte, da ich die Logik dahinter wirklich nicht verstehe.","replies":[{"poster":"Homunculi","date":"2017-02-15T15:59:55.376+0000","up_votes":1,"down_votes":0,"body":"Weil so eine Funktion schnell und stark ausgenutzt werden könnte.","replies":[{"poster":"Ionic","date":"2017-02-15T16:11:19.208+0000","up_votes":1,"down_votes":0,"body":"Derjenige der DC'ed verliert mehr LP, falls ein Duo Pärchen dabei ist verlieren beide mehr LP. Ich glaub nicht das leaven wirklich jemanden etwas brignt, dass man von \"ausnutzen\" sprechen kann","replies":[{"poster":"Homunculi","date":"2017-02-15T16:51:24.114+0000","up_votes":1,"down_votes":0,"body":"Was unfair gegenüber dem Partner wäre, er kann nichts für den DC seines Kumpels/Partners, sollte dieser DC nicht inzeniert sein.\n\nWas das ausnutzen angeht, wurde ja schon oben erklärt^^.","replies":[]}]}]},{"poster":"Ireliα","date":"2017-02-15T16:10:54.675+0000","up_votes":1,"down_votes":0,"body":"Dein Freund spielt auf seinem Smurf mit dir. Sobald eine Niederlage droht geht er AFK und rettet dir deine Punkte.\n\nEs müsste nicht mal der Smurf sein, es könnte auch zwei Freunde sein die sich abwechseln und so mit insgesamt weniger LP verlieren. Wäre zum Beispiel sinnvoll wenn einer gerade in Silber 1 steckt und den Sprung nach Gold schaffen möchte.\n\n\nInsgesamt musst du dich auf die Statistik verlassen. Vorausgesetzt du gehst nie AFK gibt es im Gegnerteam 5 potentielle AFK'ler, in deinem nur 4. Langfristig gewinnst du dadurch also mehr als du verlierst. Auch wenn ich es natürlich kenne und weiß wie frustrierend sowas ist ... Es gibt aber leider kein sinnvolles System dagegen.","replies":[{"poster":"Ionic","date":"2017-02-15T16:14:57.098+0000","up_votes":1,"down_votes":0,"body":"Da kommt auch noch eine alte Frage ins Spiel: Kann Riot erkennen ob jemand das Spiel verlassen hat, oder einen DC hat ? Ich hoff mal schon.","replies":[{"poster":"Ireliα","date":"2017-02-15T16:23:10.584+0000","up_votes":1,"down_votes":0,"body":"Nein, können sie nicht. Im Zweifel kannst du immer den LAN Stecker ziehen/Router ausschalten und der Computer meldet: \n\n\"Keine Verbindung zum Internet. Im Internet nach Hilfe suchen? (Werde bei dieser Frage jedes Mal sauer, tut aber nichts zur Sache)\n\nUnd sogar wenn der Computer solche Infos weitergibt könnte man nie mit Sicherheit sagen ob jemand böswillig das Kabel gezogen hat oder ob es sich gelöst hat.","replies":[{"poster":"Ionic","date":"2017-02-15T16:25:04.586+0000","up_votes":1,"down_votes":0,"body":"Wo ist dann der Unterschied in der Ingame Meldung:\n\nEin Beschwörer hat das Spiel verlassen\n\nund\n\nEin Beschwörer hat das Spiel beendet ?","replies":[{"poster":"MeMyselfandBaal","date":"2017-02-15T16:51:07.723+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ionic,realm=EUW,application-id=YnZkMR0R,discussion-id=dTfEPUyO,comment-id=0001000000000000,timestamp=2017-02-15T16:25:04.586+0000)\n>\n> Wo ist dann der Unterschied in der Ingame Meldung:\n> \n> Ein Beschwörer hat das Spiel verlassen\n> \n> und\n> \n> Ein Beschwörer hat das Spiel beendet ?\n\nNaja... also ja... Riot kann wahrscheinlich feststellen, wie du das Spiel \"verlassen\" hast... ob du die 5 Sekunden \"Willst du deine Teammitglieder wirklich im Stich lassen\" Nachricht eiskalt abgewartet und auf \"Bestätigen\" geklickt hast... (Ich habe dieses Feature Mal genutzt, weil ich auf Grund eines Bugs neustarten musste...)\nAber: Wenn das wirklich einen Einfluss aufs Strafmaß hätte... dann ziehe ich doch einfach das W-Lan Kabel und beende danach dann das Spiel. \n\nAn sonsten... gibt es bei dem \"geringeren LP Verlust, bei 4vs5 Spielen\" ein ganz großes Problem: Da profitieren hauptsächlich toxische Spieler von, während die vorbildlichen bestraft werden.\nWas meine ich damit? Nun ja... Jeder kennt das Phänomen: Dein Toplaner steht vor Minute 10 bei 0-5, weil er auf einen Smurf trifft. Du hast jetzt 3 Varianten zu reagieren: 1.) Du versuchst um den Toplaner herum zu arbeiten und sorgst dafür, dass andere Lanes so stark werden, dass dessen Rückstand egal ist. \n2.) Du hilfst deinen Toplaner mit Ganks und Roams, damit er wieder ins Spiel kommt.\n3.) Du flamest ihn, damit er einen Ragequit hinlegt.\n\nVerlieren wirst das Spiel wahrscheinlich eh... also ist, wenn dein Vorschlag umgesetzt wird, die dritte Option für dich als Spieler die Beste. Und ja, der Chat wird dann mit \"At least go AFK\" voll gespammt werden. Ich bin ja eher ein Freund von den ersten beiden Varianten.\n\nUnd ja, meistens geht dem \"Ragequit\" eine Beleidigung voraus. Ich sage bewusst meistens und nicht immer. Bei meinem letzten 4vs5 ist genau das passiert: Der Toplaner hat gefeedet, der Rest hat den beleidigt, er ist gegangen. Ich habe dann alle reported (außer meinen ADC, der sich, wie ich, von der Diskussion fern gehalten hat)... Aber laut deiner Theorie hätte ich den Flamern dankbar sein müssen, weil sie verhindert haben, dass ich die vollen LP verliere. \nDa nehme ich den vollen LP Verlust lieber in Kauf. Weil ich halt über das eine frustrierende Spiel hinaus denken kann.","replies":[]},{"poster":"Ireliα","date":"2017-02-15T16:28:08.309+0000","up_votes":1,"down_votes":0,"body":"Ich spiele auf Englisch und da gibt es nur eine Meldung: \"A Summoner has disconnected\".\n\nBist du dir mit zwei unterschiedlichen Meldungen zu 100% sicher? Noch nie davon gehört.","replies":[{"poster":"DontKillMySoraka","date":"2017-02-15T16:34:38.491+0000","up_votes":1,"down_votes":0,"body":"es ist so, die Ansagerin sagt \"ein Beschwörer hat das Spiel verlassen.\"\nIm Chat steht dann: (Beschwörername) hat das Spiel beendet.","replies":[{"poster":"Ireliα","date":"2017-02-15T16:36:04.671+0000","up_votes":1,"down_votes":0,"body":"Also gibt es auf dieselbe Aktion nur zwei unterschiedliche Nachrichten? Das Spiel unterscheidet nicht wie man AFK geht?","replies":[{"poster":"DontKillMySoraka","date":"2017-02-15T16:41:16.352+0000","up_votes":1,"down_votes":0,"body":"richtig","replies":[]}]}]}]}]}]}]}]}]}