{"poster":"IPC5 Pain","date":"2015-02-28T16:59:50.872+0000","title":"Kassadin 5.4 eure Meinung ist gefragt","subforum":"Champions & Gameplay","up_votes":2,"down_votes":1,"body":"Gerne könnt ihr ein paar Kommentare zu eurer Meinung über Kassadin schreiben.\r\n\r\nGruß\r\nIIllI","replies":[{"poster":"Legend Hypaaahh","date":"2015-02-28T19:09:54.801+0000","up_votes":2,"down_votes":0,"body":"#Riftstep","replies":[]},{"poster":"Yáku","date":"2015-02-28T17:26:40.198+0000","up_votes":2,"down_votes":0,"body":"Schwach. Manakosten zu hoch für diese niedrige Range.","replies":[]},{"poster":"Dermel","date":"2015-03-01T21:00:21.205+0000","up_votes":2,"down_votes":1,"body":"Ich sags mal so: Meine Midlane ist kaputt... Veigar und Kassadin. Die jeweils beste Fähigkeit hat man ihnen quasi entzogen. Veigar ohne stun Daumen runter, Kassadin mit 4 1/2 Teemo ult range Daumen zu kurz für genug runter. So ziemlich jeder Gegner mit irgendeiner Lauftempoerhöhung holt beide jetzt direkt ein. Kassadin muss eh so nah an den Gegner, dass er auch gleich laufen kann und für Veigar sollte man lieber mal exhaust einstecken ... Im Großen und Ganzen kann man sagen, dass Riot genug von den alten Champions hat und lieber komplett neue Sachen z.B. Kalista, Rek'Sai oder Bard die damals undenkbar gewesen wären einsetzten will. Damit dies leichter geht nerft man die alten Knacker bis zur Unattraktivität. Finde ich sehr schade :'(  irgendwie fehlen sie mir jetzt schon alle werden nach und nach zu Gurken bis sie komplett raus kommen #Wiederbelebung oder wie war das ?","replies":[]},{"poster":"Kendrickx","date":"2015-03-02T15:10:36.201+0000","up_votes":1,"down_votes":0,"body":"Unnötig jetzt sind Leblanc und Zed am wüten und Kassadin sieht useless im Vergleich aus.\nHoffe da kommt noch was in den nächsten patchnotes...\nKopf Hoch Kassadin!","replies":[{"poster":"Phobos Selini","date":"2015-03-03T18:03:01.706+0000","up_votes":1,"down_votes":0,"body":"Wo du sie gerade erwähnst: Die zwei Champs können ruhig auch einen Nerf in dieser Größenordnung vertragen, speziell auch auf deren Mobility, denn deren Schadenspotential ist viel größer als das von Kass.","replies":[]}]},{"poster":"Nerkahl","date":"2015-03-03T15:46:33.650+0000","up_votes":1,"down_votes":0,"body":"ok vlt ist die range kaputt (ich bin kein kassa spieler) gut 450 range ist in mid aber immer noch ziemlich stark überlegt mal, er ist immer noch mobiler als cassi,veigar und und und da gibts genug wo ihr diese champs noch outplayen könnt.\n\n und denkt mal nach riot will nur das ihr die ult klüger einsetzt sein schadensoutput ist auch, deshalb nicht angerührt worden da er auch sein status als assinen nicht verlieren sollte. so denkt nach kurze range der skill ist aber dennoch ein spontanzauber das heißt ihr geht nahe ran und sofort wieder raus. \n\nlasst euch neue spielweisen einfallen, dan macht er für euch auch wieder spaß vorfür zur hölle gibt es sonst die normal mods? zum trainiren und testen, werdet mit ihm schneller und wie man mana probleme umgehen kann. \n\nernsthaft die antwort zu dieser frage ist schon lange bekannt {{item:3174}} - {{item:3040}} auserdem es kann auch durchaus sein das diese änderung nur vorüber gehend ist als übergang. gebt nicht so schnell auf die season hat gerade erst begonnen das jahr ist lang. seit ihr **KINDER** oder seit ihr **CHAMPIONS**? überlegt euch das mal selbst.","replies":[]},{"poster":"Widder88","date":"2015-03-03T06:40:08.607+0000","up_votes":1,"down_votes":0,"body":"Die hätten lieber seinen Schadensoutput verringern sollen. Der ist immernoch zu hoch. Dafür wurde sein spielerisch interessantester Aspekt - die Mobilität - beschnitten.","replies":[]},{"poster":"Señor Sucellus","date":"2015-03-01T00:34:41.814+0000","up_votes":1,"down_votes":0,"body":"So wie die Ult jetzt ist kann man ihn vergessen. Es war immerhin das was ihn ausgemacht hat, ansonsten war nichts an ihm wirklich so gut, das es sich lohnen würde ihn zu picken. Ein guter Vergleich wäre jetzt Nidalee meiner Meinung nach. Ihr W in Katzenform kommt jetzt, ohne das die passive auf dem Ziel ist fast schon von der Reichweite an die Kassa Ult ran. Trifft sie nen Speer oder der Gegner läuft in eine Falle ist der Jump sogar weiter als die Ultimate von Kassa, dass aber nur manchmal. Ich schätze mal das eine Full AP Nida mit ihrem Sprung sogar noch deutlich mehr Schaden macht und dafür nicht mal Manakosten besitzt auf der Fähigkeit, wobei Kassa fast ausschließlich für seine Ultimate viel Mana stackt. Man könnte jetzt sicherlich sagen im Jungle ist Kassa noch mobiler, da er über Wände kommt wo Nidalee es nicht schafft aber trotzdem ist sie auf freier Fläche deutlich schneller als er, da ja zudem auch noch die Manakosten der Ult in enorme höhen gehen, wo  er sie dann einfach nicht mehr nutzen kann.\nAlles in allen ist der Nerf aus meiner Sicht viel zu Stark gewesen und für den enormen Verlust an Reichweite sind die Manakosten kaum gesunken.","replies":[]},{"poster":"SuperplexP","date":"2015-02-28T17:51:48.340+0000","up_votes":1,"down_votes":0,"body":"Vor dem Patch war er echt fine. Der Patch hat ihn nun endgültig zerstört.\n\nWenn dann hätten sie den Cooldwon der Ult etwas senken müssen, aber so kann man ihn jetzt komplett vergessen.\n\nmfG Plexi","replies":[]},{"poster":"Awecoolsome","date":"2015-03-01T00:13:53.834+0000","up_votes":1,"down_votes":4,"body":"Das ist die schlechteste Umfrage die ich je gesehen habe.","replies":[]}]}