{"poster":"LaurenzovonMatte","date":"2016-09-06T08:23:20.793+0000","title":"Zusätzlicher \"Mute-Button\" bezüglich Pings","subforum":"Champions & Gameplay","up_votes":2,"down_votes":2,"body":"Sehr geehrte League Community, sehr geehrtes Riot Team,\r\n\r\nIch besuche jetzt schon seit einiger Zeit in regelm&auml;&szlig;igen Abst&auml;nden die Kluft der Beschw&ouml;rer. Normalerweise ist dies auch sehr befriedigend, leider zieht dieser Besuch &ouml;fters auch Nachteile mit sich. Meist bedeutet das erh&ouml;hter Salzgehalt und gelegentlich auch psychische Frustration. Zur&uuml;ckzuf&uuml;hren ist das auf das Verhalten der Mitspieler, welche aus verschiedensten Gr&uuml;nden keine Vasallen &quot;lasthiten&quot; k&ouml;nnen, anscheinend die Minimap ausgeblendet haben oder das gute, alte &quot;Run-it-down-mid-Spiel&quot; spielen. \r\nWir kennen doch alle diesen einen Mitspieler, der Inhaber der gr&ouml;&szlig;ten Salzfabrik der jeweiligen Region ist und daher die Tilt-Latte relativ niedrig anlegt. Wie sehr genie&szlig;e ich dieses &quot;Fehlender Gegner&quot;-Signal von dieser Person, nachdem man auf der Botlane 5-Man getowerdived wird und ungl&uuml;cklicherweise stirbt. Nach so einer Aktion bekomme ich &ouml;fters den Drang, nach dem vermutlich verlorenen Spiel, diesen Inhaber der gr&ouml;&szlig;ten Salzfabrik der jeweiligen Region zu reporten und in die Beschreibung des Reports einfach nur &quot;Boosted Monkey&quot; zu schreiben.\r\nDamit sich dieser Drang zumindest etwas vermindern l&auml;sst, h&auml;tte ich die Idee. Entweder bei Aktivierung des gut-bekannte Mutebutton wird sowohl das von der jeweiligen Person Geschriebene, als auch dessen Pings nicht mehr angezeigt, oder man f&uuml;hrt einen zus&auml;tzlichen Button ein, der bewirkt, dass nur die Pings der jeweiligen Person nicht mehr angezeigt werden.\r\nIch hoffe, dass sie diese Idee in die Realit&auml;t umsetzten k&ouml;nnen. \r\nHochachtungsvoll,\r\nein Gold-{{champion:62}}","replies":[{"poster":"Grona1992","date":"2016-09-06T10:33:12.059+0000","up_votes":1,"down_votes":0,"body":"Du hättest wohl besser mit ein Gold-Salzbergwerk Besitzer beendet den mehr salty und getiltet geht nicht mehr. Man kann folgende Dinge pingen: Need help, Need help at, omw, danger, enemy loss, attack, attack xy, go Back. All diese pings machen Sinn und auch wenn jmd salty ist sind diese Informationen ALLE Sinnvoll. Wenn dein Adc dir pingt das du weg gehen sollst will er dir vielleicht damit sagen \"ich bin im Moment behind bitte lass mir den Farm\" oder \"du wirst eher im teamfigth gebraucht als ich\". Und je öfter er das pingt umso mehr Gedanken solltest du dir darüber machen. Kurz Tab Taste gucken wie es um sein build steht Situation einschätzen fertig.\n\n>Wie sehr genieße ich dieses \"Fehlender Gegner\"-Signal von dieser Person, nachdem man auf der Botlane 5-Man getowerdived wird und unglücklicherweise stirbt. \n\nIch bin Bronze Spieler und Frage dich wie dir nicht auffallen kann das Top mid und jungler NIRGENDS Sichtbar sind? Schon mal dran gedacht das du vor jedem vorwärts Befehl entweder auf die minimap oder per Tab guckst ob jmd nicht sichtbar ist? Wenn Top und mid und jungler nicht sichtbar sind gibts 3 Optionen. Option 1 Herold Option 2 Drake Option 3 cya botlane. Als botlane blinkt man in dieser Situation dem Top laner zu Pushen und der midlane auch. Währenddessen wardet man den Bush zwischen den ersten zwei Tower und sollte man kein Flash up haben stellt man sich so weit hinter den Tower das man nicht von einem stun am Rande der Tower Range getroffen werden kann und läßt im Zweifelsfall den Tower fallen und hofft das das eigene Team in selber Zeit 2 Tower nimmt.","replies":[]},{"poster":"wolf454","date":"2016-09-06T09:41:36.834+0000","up_votes":1,"down_votes":0,"body":"Was ist wenn jemand in Dia ist und 25 Chat Band hat? Soll er die nächsten 25 spiele spielen immer mit der Gefahr das er gar keinen Einfluss mehr auf das Spiel hat?","replies":[]},{"poster":"Megamaexx","date":"2016-09-06T08:31:37.983+0000","up_votes":1,"down_votes":0,"body":"Ich würde davon abraten. Allerdings kann man sehr viele Signale von sich geben, bevor die Spam-Sperre einsetzt, deswegen würde ich dort eine Änderung Willkommen heißen.\nMan braucht maximal 2-3 Pings in Folge (meist nur zur Korrektur von fehlerhaften Pings wie zB unterwegs statt Gegner fehlt), also einfach den Spamschutz früher greifen lassen.","replies":[]}]}