{"poster":"kegiv","date":"2019-12-02T15:47:47.997+0000","title":"Nerfate gli oggetti da critico, non se ne può più degli adc.","subforum":"Discussioni generali","up_votes":3,"down_votes":13,"body":"Non bastava uno scudo sul phantom dancer, nuovi buff per gli oggetti da critico  fervore che da 25% di critico e ha reso gli adc forti anche in early game, già non bastava che in late ti uccidono con 2-3 AA ,stormrazor che dà critico , ma basta lol è diventato uno sparatutto ormai , ma che schifo è ingiocabile, ormai mid ti ritrovi a giocare fisso contro un adc (lucian - tristana - caytlin  - draven) top quinn e vayne onnipresenti . Ogni partita ci sono fisso 2-3 adc.\nE se non ti ritrovi un adc , ti ritrovi contro yasuo e tryndamere rotti più che mai perchè sfruttano il critico. Come se non bastasse ciliegina sulla torta la riot sforna nuovi adc sempre più rotti ,senna con danni puri e range da ulti di lux e  aphelios mio dio che lo commento a fare, e in più si curano  hanno stun, ma che è una barzeletta!!!\nOrmai certi campioni non li puoi giocare più e league of legends è diventato una brutta copia di uno sparatutto ed è molto più noioso di prima.\nE  in più cosa fa la rito , nerfa ancora la lethality , nerfando l'edge of night e rendendo sterili gli assassin che con 3 oggetti ora hanno meno lethality di prima, i tank non servono a un cavolo solita favola tanto basta una botkr e sono belli che morti.\nSe devo giocare a uno sparatutto tanto vale giocare ad altro e non a lol.\nComplimenti riot !!!","replies":[{"poster":"Luckynanix","date":"2019-12-02T18:31:59.196+0000","up_votes":3,"down_votes":1,"body":"Bello come la gente si lamenti di cose a caso... Ultimi 15/20 game 2 ADC fuori posizione ed eri tu che stavi giocando MF con dark harvest e lethality build...\nComplimenti!!!","replies":[{"poster":"kegiv","date":"2019-12-02T19:57:02.503+0000","up_votes":1,"down_votes":1,"body":"E come puoi vedere anche non giocando mai adc perché io non sono un adc , prendendo una m.f mid vinco e ho score positivi 6/2  5/3 first time adc in silver 2,  a dimostrazione che l'adc è il ruolo piu semplice e idiota del gioco basandosi sugli autoattacchi e chiunque lo può fare  non si capisce perché debbano essere aiutati in early e mid game.","replies":[{"poster":"Luckynanix","date":"2019-12-03T06:02:21.564+0000","up_votes":1,"down_votes":0,"body":"Fai la stessa cosa a plat vediamo quanto l'ADC è facile {{sticker:slayer-jinx-wink}}","replies":[{"poster":"kegiv","date":"2019-12-03T09:41:23.761+0000","up_votes":1,"down_votes":1,"body":"Gioca tu un'assassin o un fighter in  plat e dimmi se è facile !\nLa tua è una frase senza senso.\nL'adc usa autoattacchi, ha un SUPP che lo protegge e sta back line , vuoi paragonare questo con un fighter che deve buttarsi nella mischia superare la front line e sopravvivere e fare unacombo perfetta mentre te da dietro protetto dai compagni gli tiri aa e altra %%%%% addosso.\nVuoi paragonare l'adc che ha il babysitter SUPP (soraka,taric quelli che odio di più) a un assassin che deve girare da solo al buio nella mappa e fare facecheck nei cespugli.\nMa per favore","replies":[{"poster":"Luckynanix","date":"2019-12-03T13:33:27.449+0000","up_votes":1,"down_votes":0,"body":"ADC a plat:\n- troppo vicino agli avversari? Ti targettano e ti shottano\n- troppo lontano? Non fai DPS\n- ti ingaggiano? Non hai Racale e sei morto prima di tirare 1 AA\n- farmi male? Rimani indietro\n- hai 1/2 oggetti? Perfetto anche il supporto fa più danni di te (apparte casi particolari come ez e vayne)\n- overestendi in lane? Vieni costantemente punito\n- stai fermo e autoattacchi? Ottima tattica se sei in bronzo ma un qualsiasi platino non è così stupido da lasciarti fare DPS\n- sei lontano da un fight in lategame? Perdi fight, obbiettivo e buona parte della base.\nRenekton in plat:\nQuando sei avanti:\nR + E in + spam di Q e W\nQuando rimani indietro:\nSplitpush duty o rispondono a te o al resto del team (inevitabilmente prenderai risorse dagli avversari, che siano torri o una persona in meno in teamfight poco importa.\nQuindi quando parli di qualcosa almeno non buttarla sul \"eh ma basta autoattaccare\" perché sono emerite %%%%%%%%%. Se non sai giocare contro una classe di campioni non è che quella classe è sbilanciata","replies":[{"poster":"kegiv","date":"2019-12-03T15:25:33.648+0000","up_votes":1,"down_votes":2,"body":"\"- hai 1/2 oggetti? Perfetto anche il supporto fa più danni di te (apparte casi particolari come ez e vayne)\"\n\nMi sono fermato a questa affermazione  \nahuahuauhauhauhauhahuauhahuauhauhauhuhauhauhauhahuauhahuauhauhauhhuahuahuauhauhahuauhauhauhauhahuhuahuauhahuahuauhauhauhahuauhhuahuauhahuauhauhahuauhahuahuauhahuahuhuahuahuahuauhahuahuahuauhhuahuahuahuauhauhauhhuahuahua\n\nSi guarda un Draven  con infinity e bramasangue - o una  tristanella  una kai'sa  o una cait  con stormrazor e infinity fanno meno danni di soraka , lux , taric e fiddlestick support\n\nMa altre panzanate da sparare!!!\n\nGuarda la riot ti ha risoltoil problema con Aphelios e Senna  con i loro 700 di range e stun rubavita a gratis e ulti che si fanno tutta la mappa ,puoi uccidere comodamente da sotto torre o dalla base  senza avvicinarti al fight  . Contento ?\nCosi il ruolo dell'adc sarà ancora più deficiente di prima.\n\nMa invece di dire cose a caso , perché non ti fai un bel paio di partite mid con una katarina , un talon e vediamo cosa riesci a fare , se riesci a shottare e uccidere l'adc cosi facilmente. Gioca un assassin e poi capisci. Mica un midlaner può stare a farmare 20 minuti come un adc , se non hai kill non servi a un cavolo da midlaner se non ti feeddi, e in più devi farti le passeggiate bot e top , aiutare il jungler quando lo invadono o a gankare , saper freezare la linea o creare uno slow push per non far muovere l'altro midlaner dalla lane , camminare all'oscuro nella mappa, e nella midlane ti possono gankare da due lati con ben 6 uscite , non solo da uno come bot o top\n\nAltro che stare fermo 20 minuti in linea a non fare un %%%%% come fa un adc con la balia affianco di mamma support che gli compra le ward pure.  Vai prova a giocare mid con un carry che si deve feedare.\n\n\nVisto che lamia parola non ti convince ascoltati quello che dice PERKZ adc dei g2, semplicemente dice che fare l'adc è molto  + semplice che fare il midlaner\n\n\nhttps://www.youtube.com/watch?v=thMpYcnthco&amp;t=84s","replies":[{"poster":"Luckynanix","date":"2019-12-03T16:14:56.759+0000","up_votes":1,"down_votes":0,"body":"Draven con infinity e bramasangue ha già speso 6900 gold (per due oggetti sono giusto un po'), kai'sa da muramana con due oggetti non fa nulla (e lo dicono tutti i caster non persone a caso), cait è odiosa in early ma viene outscalata, Tristana è l'unica su cui ti do ragione. (Che poi è ovvio che non fanno meno danni di un support era un \"modo di dire\", ciò non toglie che non facciano i danni che sostieni tu)\nSei il classico tipo che si lamenta perché deve lamentarsi perché ogni ruolo ha le sue difficoltà e non puoi oggettivamente provare che uno è più difficile rispetto ad un altro perché appunto non hanno le stesse meccaniche (un'assassin deve saper eseguire la sua combo e riuscire ad isolare il suo bersaglio, un adc deve saper kitare, un tank deve fare peeling, un jungler saper smitare in smite fight,...).\nSpoiler: gli assassini non sono gli unici champ giocabili mid! Esistono maghi da scaling che (pensa un po'!) Sono contentissimi di farmare 20 minuti e distruggere l'ADC di turno!\nQuindi secondo te solo la mid può rommare (o applicare tecniche di controllo wave)? Tu sì che hai capito tutto del gioco!","replies":[{"poster":"KÐβ Śarah Iημ","date":"2019-12-03T16:25:53.077+0000","up_votes":3,"down_votes":0,"body":"Hey Lucky, lascia perdere, è come parlare ad un muro.\n\nHo letto qualche commento sopra e pretende di avere ragione anche quando viene smentito punto per punto. \n\nDavvero, è un classico, quando queste persone iniziano ad annusare il gold pensano di aver capito tutto del gioco, quando in realtà ne conoscono giusto un 20/30%. \n\nDopo tutto sto tempo sul forum ci ho perso le speranze con sti individui","replies":[{"poster":"Luckynanix","date":"2019-12-03T17:23:17.665+0000","up_votes":3,"down_votes":0,"body":"Già me ne ero accorto","replies":[{"poster":"kegiv","date":"2019-12-03T19:33:26.678+0000","up_votes":1,"down_votes":1,"body":"Si si hai ragione tu e i tuoi amichetti adc che hai chiamato .\nCaro te ne puoi anche andare  chi cavolo ti ha chiamato.\nTra l'altro chi mi smentisce è un bronzo 2.\nMa chi se ne fotte del gold , e chi se ne fotte di lol, dico che questo è un gioco non bilanciato, punto.\n\nAnche Perkz è un coglione e nn sa niente del gioco che dice che il ruolo dell'adc è facile.\n\nAUHAUHAHUAUH la verità non la volete sentire vi brucia!!!\n\nE lo dice uno che ha fatto la finale dei mondiali.\n\nL'adc è il ruolo più facile di lol , punto e basta la cosa non è opinabile!!!\n\nRipeto\n\nL'ADC è IL RUOLO Più SEMPLICE E PIù FAVORITO DALLA RIOT","replies":[{"poster":"Luckynanix","date":"2019-12-04T05:58:17.484+0000","up_votes":2,"down_votes":0,"body":"Se ti informi perkz è un midlaner che quest'anno è finito bot perché hanno preso caps infatti come gli togli xayah e Kai sa deve per forza giocare un mago o yasuo, altrimenti non ha impatto nei game (basta vedere quando ha pickato varus in finale, ha preso una bella ripassata a da lwx) ergo è normale che dica che il ruolo che lo ha portato dove è ora sia il più difficile...\nIl resto non rispondo sembra che tu sia un bambino di 5 anni che piange perché al posto di prendergli la macchinina blu gliel'hanno presa rossa...","replies":[{"poster":"kegiv","date":"2019-12-04T11:33:09.991+0000","up_votes":1,"down_votes":0,"body":"sei diventato noioso, guarda se nn me lo dicevi tu nn lo sapevo che perkz era un midlaner, mammamia che profonde conoscenze hai, infatti dp aver fatto due ruoli ha detto che l'adc è +facile.\nsi senza xayah sei + forte tu di perkz ma che analisi dabambino di3 anni, quello che dicono i caster o pensa la massa quello avete nel cervello, uno perde la finale del mondiale è per voi è scarso hauuhahuahuahua","replies":[]}]}]}]}]}]}]}]}]}]}]}]},{"poster":"DomeKappa","date":"2019-12-02T16:15:54.951+0000","up_votes":3,"down_votes":0,"body":"Ho giocato un bel po questa preseason e sinceramente (da jungler) non ho notato tutto questo cambiamento negli adc, forse snowballano più rapidamente se feedati come è giusto che sia ma rimangono comunque gestibili se non si esagera","replies":[{"poster":"kegiv","date":"2019-12-02T16:48:34.228+0000","up_votes":1,"down_votes":3,"body":"Caro tu giochi jungler , vai mid con kayn o un altro champ contro una tristana e dopo capirai.","replies":[{"poster":"Ω Hallelujah Ω","date":"2019-12-02T18:55:50.316+0000","up_votes":3,"down_votes":0,"body":"Per quale disgraziato motivo dovresti mai andare *Mid* con Kayn?","replies":[{"poster":"kegiv","date":"2019-12-02T19:52:07.088+0000","up_votes":1,"down_votes":1,"body":"Perché anche se soffre a inizio partita dopo è un champ col kit che ha capace di fare il sedere a 3 adc insieme  in 0.2 secondi infatti da 0/8 ho terminato la partita 21/15 carriandola","replies":[{"poster":"Ω Hallelujah Ω","date":"2019-12-02T20:34:23.522+0000","up_votes":1,"down_votes":0,"body":"Ha 42% di winrate come midlaner in Platino+.","replies":[{"poster":"kegiv","date":"2019-12-02T21:13:29.264+0000","up_votes":1,"down_votes":1,"body":"E a diamante come midlaner ha il 49% , quindi?\n\nE un pick non usuale, xkè è deole ed è difficile non feedare in linea con kayn, come lo è Kled o Nautilus mid ma li abbiamo visti ai mondiali,  quindi il winrate è relativo.\n\nA parte che io stò in silver e le partite durano di più, e kayn assassin dopo 25-30 minuti è una bestia forse il miglior assassin di Lol  insieme a katarina in mid-late, poi c'è la mia partita da 0/9 a  hardcarry 21/15 con kayn mid chelo testimonia , guardala.","replies":[{"poster":"Ω Hallelujah Ω","date":"2019-12-02T22:03:50.827+0000","up_votes":1,"down_votes":0,"body":"> E a diamante come midlaner ha il 49% , quindi?\n\nAppunto, persino in quell'elo, persino con un pickrate bassissimo (quindi usato solo da gente che lo sa giocare), non supera il 50%. Di solito gli off-meta pick hanno un winrate inflazionato, non abbassato.\n\n> E un pick non usuale, xkè è deole ed è difficile non feedare in linea con kayn, come lo è Kled \n\nNessuno sano di mente può dire che Kled sia debole in lane.\n\n> poi c'è la mia partita da 0/9 a hardcarry 21/15 con kayn mid chelo testimonia , guardala.\n\nAppunto perché è _una_ partita in silver, non vuol dire che sia un buon pick. Ho da qualche parte uno screenshot di una mia vittoria in Silver Ranked Season 3 con Smite Revive Jungle Heimer. Non significa che sia viabile.","replies":[{"poster":"kegiv","date":"2019-12-03T00:38:19.286+0000","up_votes":1,"down_votes":1,"body":"Ma scusa perchè stravolgi le mie parole. Il testo è chiaro kled lo considero non usuale in mid,  del debole in lane l'ho dato a Kayn come vedi il testo è racchiuso tra virgole per non confondere le due parti. Mah\n\n\"E un pick non usuale, xkè è deole ed è difficile non feedare in linea con kayn, come lo è Kled \"\n\nVedi che ci sono le virgole!!!\n\n\n\n\n\n\nTu hai esordito dicendo che in platino ha il 42 % di winrate e io ho detto che in diamante ha il 49%.\nSpiegazioni alla variazione di 7 % di winrate nn ne hai date.\nAnzi quel 7% di variazione dimostra che se uno è bravo può giocare campioni diversi in una lane e carriare.\n\n\nKled in ogni elo ha il winrate superiore da midlaner rispetto a toplaner , allora seguendo il tuo ragionamento la gente è idiota che lo gioca top.\n\nLa verità qua è solo una che da diamante in giù capiamo ben poco del gioco  e  altro non facciamo che adeguarci e seguire il meta e tutti spariamo %%%%%%%, e altro che off-meta pick  i mondiali hanno dimostrato che siamo limitati , ora tutti giocano tristana mid perché hanno visto faker , tutti a giocare kled e Nautilus.  \n\nQuella non è stata solo \"una buona partita\" . Ti ripeto che da uno 0/8  mio iniziale contro nemici feedati a schifo  da me in primis, con kayn ho carryato la partita chiudendo 21/15 . \n","replies":[{"poster":"Ω Hallelujah Ω","date":"2019-12-03T03:03:52.647+0000","up_votes":2,"down_votes":0,"body":"> Tu hai esordito dicendo che in platino ha il 42 % di winrate e io ho detto che in diamante ha il 49%.\nSpiegazioni alla variazione di 7 % di winrate nn ne hai date.\nAnzi quel 7% di variazione dimostra che se uno è bravo può giocare campioni diversi in una lane e carriare.\n\n\"e carriare\" sarebbe avere un winrate minore del 50% per te?\n\n> Kled in ogni elo ha il winrate superiore da midlaner rispetto a toplaner , allora seguendo il tuo ragionamento la gente è idiota che lo gioca top.\n\nKled ha un winrate più alto in mid che in top perché è un pick situazionale in mid, utilizzato nello specifico per counterare certi campioni che sono vulnerabili a certe classi di campioni non tipicamente usate in mid.\nInfatit ha un pickate più basso  (situazionale) con matchup molto più favorevoli.\n\nIdem per qualcosa come Renekton mid. O come Rammus usato nello specifico contro team full AD, o altre cose simili. \nKayn **non ha un winrate migliore, né un winrate positivo, se usato in mid.** Kayn non ha matchup iperfavorevoli in mid, non ha qull'1% di motivo per essere pickato.\n\nKled sì. Quella è la differenza.\n\nQuanto alla partita che dici di \"aver carryato\", ho controllato. Quello che è successo è che se stato stompato estremamente male in early game, e poi hai \"recuperato\" sul dorso della tua botlane. Nonostante il danno alto, la tua KP è comunque la più bassa del gioco, a pari merito con il tuo Gragas 2/11/24. \n\nMorire **15 Volte **in una partita non è carryare, specie quando sei l'unico Silver 2 nel game - due divisioni sopra ogni altro giocatore in quel match.  Non puoi sperare che entrare dentro e suicidarti sia una tattica valida ogni game - se non hai una Jinx in grado di cleanuppare la fight dopo che tu sei stato scoppiato.","replies":[{"poster":"KÐβ Śarah Iημ","date":"2019-12-03T16:21:29.096+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ω Hallelujah Ω,realm=EUW,application-id=MJVj50Jw,discussion-id=NI65tYbV,comment-id=000000010000000000000000000000000000,timestamp=2019-12-03T03:03:52.647+0000)\n>\n> Spiegazioni alla variazione di 7 % di winrate nn ne hai date.\n> Anzi quel 7% di variazione dimostra che se uno è bravo può giocare campioni diversi in una lane e carriare.\n> \n> \"e carriare\" sarebbe avere un winrate minore del 50% per te?\n> \n> Kled ha un winrate più alto in mid che in top perché è un pick situazionale in mid, utilizzato nello specifico per counterare certi campioni che sono vulnerabili a certe classi di campioni non tipicamente usate in mid.\n> Infatit ha un pickate più basso  (situazionale) con matchup molto più favorevoli.\n> \n> Idem per qualcosa come Renekton mid. O come Rammus usato nello specifico contro team full AD, o altre cose simili. \n> Kayn **non ha un winrate migliore, né un winrate positivo, se usato in mid.** Kayn non ha matchup iperfavorevoli in mid, non ha qull'1% di motivo per essere pickato.\n> \n> Kled sì. Quella è la differenza.\n> \n> Quanto alla partita che dici di \"aver carryato\", ho controllato. Quello che è successo è che se stato stompato estremamente male in early game, e poi hai \"recuperato\" sul dorso della tua botlane. Nonostante il danno alto, la tua KP è comunque la più bassa del gioco, a pari merito con il tuo Gragas 2/11/24. \n> \n> Morire **15 Volte **in una partita non è carryare, specie quando sei l'unico Silver 2 nel game - due divisioni sopra ogni altro giocatore in quel match.  Non puoi sperare che entrare dentro e suicidarti sia una tattica valida ogni game - se non hai una Jinx in grado di cleanuppare la fight dopo che tu sei stato scoppiato.\n\nSei il mio eroe.\nQuesto significa roastare un silver con classe e nel modo giusto, senza flame.","replies":[{"poster":"kegiv","date":"2019-12-04T01:12:30.647+0000","up_votes":1,"down_votes":2,"body":"Il mio eroe, ahuauhauh sempre piu ridicoli, ma vi appoggiate e vi venite in soccorso l'uno con l'altro in ogni forum, non si può scrivere un messaggio su questo sito che siete sempre i soliti 4-5 a correre pronti a criticare ma da anni, non avete null'altro da fare. Sembrate delle femminucce delle commarelle.\nSpero che oltre ad appoggiarvi nelle idee non vi appoggiate altro a vicenda.\n\n\nTiè commarella leggitelo il tuo eroe già nel 2017 sparava critiche anche alla fantasia , anche sulle cose impossibili deve contraddire la gente, anche su un idea di senna support come champ aveva da ridere , \"no deve stare nella lanterna\" , e infatti la riot ha fatto uscire senna e pure support 2 anni dopo, belli espertoni del %%%%% che siete huauhahuahuauhahuahuahu , figurati se si fa scappare occasione su questo forum di comparire come superman e criticare qualche cosa. Stai sicuro cheal 100% se il tuo eroee la pensa al contrario di me tra massimo 6 mesi- ma facciamo 8 mesi massimo giocheranno tutti kayn mid.\nMa prendetevi sotto braccio e andate in Cina và.\n\nhttps://boards.euw.leagueoflegends.com/it/c/campioni-e-gameplay-it/pfRyMHQn-idea-nuovo-champ-senna\n","replies":[{"poster":"Ω Hallelujah Ω","date":"2019-12-04T13:49:30.801+0000","up_votes":1,"down_votes":0,"body":"Stai allucinando o cosa? \nIl mio intero problema con Senna era il fatto che sarebbe dovuta uscire come solo spettro. La Riot ha risolto fottendosene, dandole un corpo ed un cannone evocati dal nulla - senza alcuna spiegazione su come abbia entrambi. Amen. Scelta loro.\n\nSe tra otto mesi \"kayn mid\" sarà popolare sarà stato per un cambiamento di meta, o di oggetti, o di rune, o buff suoi nel ruolo da lane. Come era popolare all'uscita, perché poteva utilizzare la corrupting potion per triggerare la trasformazione e saltare la debole fase di lane. \nSe otto mesi e passa fa qualcuno avesse giocato Conqueror Ezreal non sarebbe stato un visionario in grado di predire il meta attuale. Sarebbe stata una pessima scelta, perché al tempo non solo Conqueror Ezreal non funzionava, ma era anche completamente outperformato da Kleptomancy. Adesso Conq è stato cambiato, e fino alla prossima patch - nel quale potrebbe tornare in disuso - Conqueror Ezreal è uno, se non *il*, setup migliore per lui.\n\nTL;DR al momento Mid Kayn è spazzatura. Sei libero di giocare quel che vuoi -alla fine quando ti trovi con un campioni ti ci trovi anche se è pessimo, io ho giocato Maokai fuori meta per anni - ma c'è una differenza enorme tra il dire \"voglio giocarlo\" e \"è un pick viabile\", specie quando non sei nemmeno in grado di spiegare la tua opinione e sei costretto ad attaccare direttamente la gente.\n\nBonus round: due _mesi_ fa tu pensavi che questa: \n> Vista la situazione sarebbe un bene premiare almeno gli assassini che hanno un buon early aggiungendo delle stack agli oggetti da letalità, esempio draktharr 21 di letalità + 2 punti di letalità per ogni uccisione con limite a 3-5 stack massime per oggetto stessa cosa per youmuu edge of night, almeno un assassino che conclude un buon early mid game con 6 kills avrebbe un bonus in + 18-30 letalità , avendo cosi almeno un decente mid-late game e venire efettivamente premiato se riesce a inserirsi tra le linee nemiche.\n\nFosse una buona idea. Ricordiamocelo.\n","replies":[{"poster":"kegiv","date":"2019-12-04T14:56:19.980+0000","up_votes":1,"down_votes":2,"body":"E infatti è una buona idea perché il rework alla lethality fa cagare e il winrate di talon qiyana e zed si è abbassato.\n\nAltro bonus round , io pochi mesi fà dissi che ekko e fizz siccome avevano il mana cosa per me sbagliata  andavano almeno buffati e tu giù a dire no ma che ighiozzia , e che fa la riot pochi mesi dopo buffa ekko e gli riduce i costi di mana e reworka la passiva di fizz.\n\nhttps://boards.euw.leagueoflegends.com/it/c/discussioni-generali-it/Weklie9Z-perchao-ekko-ha-il-mana-e-altri-midlaner-come-yasuo-e-zed-lenergia\n\nTu quando la gente scrive , compari solo per criticare e sia su senna che su ekko avevi torto marcio e sei stato sbugiardato direttamente dalla riot e  chissà quante altre skronzate spari giusto per criticare chi scrive.\n\nSicuramente sarai il classico player che crede di sapere tutto e in chat in game halleluja chissà quanto rompi e secondo me sewi stato pure iperbannato più volte visto il carattere acido e da prima donna che hai .\n\nCmq pfffff addio, ma chi ti risponde più , la ragione si sa a chi si dà come dice il proverbio.\nE non girare la frittata tu da mattina a sera da anni entri e attacchi le idee della gente anche se hai torto marcio come i due casi che ti ho portato. Ma piantala su. ","replies":[{"poster":"MustDodgeCorona","date":"2019-12-04T16:15:15.803+0000","up_votes":2,"down_votes":0,"body":"> Fermo, tu sei quello di Ekko?\n> Quello della 1v1 di Ekko?\n> _Quel_ tipo? \n> \n> Dei quanta roba spiega tutto questo, otto mesi fa abbiamo fatto una 1v1 con il tuo profilo \"aakegiv\" nella quale ti ho stompato con Ekko usando il lane management che tu ritenevi impossibile a causa del fatto che \"avesse il mana\". Quello del \"Vieni su lol 1 vs 1 e dimostramelo , \" per poi finire con \"anche se mi hai battuto non cambio idea\" come un bambino di cinque anni.\n> \n> Tu sei QUESTO tipo:\n> \n> https://imgur.com/a/GRtgZMn\n> \n> Quello di \"farò una petizione alla Riot per dare l'energia ad Ekko\". Come è andata, a proposito?\n\n\nAHAHAHAHAHAHAHAHAHAHA","replies":[]},{"poster":"Ω Hallelujah Ω","date":"2019-12-04T15:44:27.638+0000","up_votes":1,"down_votes":0,"body":"> Io nn cambio quasi mai idea carissimo.\n\nEd il fatto che tu lo dica come se fosse un marchio d'orgoglio sintetizza tutto ciò che c'è di sbagliato con te.","replies":[]},{"poster":"Ω Hallelujah Ω","date":"2019-12-04T15:18:01.285+0000","up_votes":1,"down_votes":0,"body":"> io pochi mesi fà dissi che ekko e fizz siccome avevano il mana cosa per me sbagliata andavano almeno buffati e tu giù a dire no ma che ighiozzia , e che fa la riot pochi mesi dopo buffa ekko e gli riduce i costi di mana e reworka la passiva di fizz.\n\nFermo, tu sei quello di Ekko?\nQuello della 1v1 di Ekko?\n_Quel_ tipo? \n\nDei quanta roba spiega tutto questo, otto mesi fa abbiamo fatto una 1v1 con il tuo profilo \"aakegiv\" nella quale ti ho stompato con Ekko usando il lane management che tu ritenevi impossibile a causa del fatto che \"avesse il mana\". Quello del \"Vieni su lol 1 vs 1 e dimostramelo , \" per poi finire con \"anche se mi hai battuto non cambio idea\" come un bambino di cinque anni.\n\nTu sei QUESTO tipo:\n\nhttps://imgur.com/a/GRtgZMn\n\nQuello di \"farò una petizione alla Riot per dare l'energia ad Ekko\". Come è andata, a proposito?","replies":[]}]}]}]}]}]}]}]}]}]}]}]}]}]},{"poster":"Khail the Crow","date":"2019-12-05T20:42:34.095+0000","up_votes":1,"down_votes":0,"body":"Ahaha ti upvoto perché mi fai ridere.","replies":[]},{"poster":"vondarck","date":"2019-12-04T15:13:26.166+0000","up_votes":1,"down_votes":0,"body":"Ciao, cercherò di rispondere un po oveall e al volo\n\nI.t. gli oggetti da critico ora hanno finalmente delle diversificazioni\n\nOra c'è crit burst, crit AS e crit AD\nPersonalmente questo da un po di varietà al meta e ad i pick\n\nL'unico caso di abuso è la famosa cappa che da diretto 25% crit ma lo fa sui champ che han crit innato come trinda e yas al massimo \nSui carry normali è un problema abbastanza contenuto data la necessità di scalare e l'exp bassa che riceve la bot\nOvvio che se la bot avversaria viene feddata è un problema legittimo.\n\nKayn mid non è un gran che, non ha metch up favorevoli e ha una linea molto week.\nQuesti \"pick esotici\" di solito han senso come conter meta, ma la bassa Wrate lo rende \"più che la fatica che il gusto\"\nTempo fa provai kayn top con la corruptuon rush, sia prima che dopo il nerf delle stack.. Abbandonai il progetto..\nCi sono altri unusual pick come voli top/supp noct/mid heca/top ecc..\nMundo jung è stato un unusual pick fino a che non han visto che worka davvero (e ora è un meta pick)\nCome lo è ekko e kartus pirma di lui\n\n\nL'adc non è un ruolo semplice (è l'unico ruolo in cui se vengo fillato sono in braghe di tela)\nIl positioning che richiedono è molto particolare e ad alto elo il kiting è l'unico modo per portare a casa la buccia (forse).","replies":[{"poster":"kegiv","date":"2019-12-04T15:26:01.905+0000","up_votes":1,"down_votes":1,"body":"Si ma il critico lo hanno migliorato cmq , la lethality l'hanno nerfata ora con tre oggetti completi abbiamo meno lethality  che già la lethality fa schifo di suo  perché se compro un'oggetto che mi  dà tot di lethality scala con i livelli e nn mi dà subito quella lethality e poi chi se li builda 4-5 oggetti lethality poi nn hai sustain e nient'altro ,quella sanguine blade non serve a nulla.  e il winrate degli assassin mid ad è crollato , l'unico che ne trae giovamento è pyke che ha le abilità che scalano lethality e non si può buildare hp.\nIn più ciliegina sulla torta hanno tolto anche lo scudo a comando sull'edge of night che era ottimo x evitare stun negli agguati, ora per un assassin quell'oggetto non serve piu a un %%%%% peggio di quella sanguine cesso blade, se voglio splittare gioco fiora tryndamere no un'assassin.\nA me di kayn mid non mi interessa più di tanto è solo per rispondere sopra.\nQuesto più il buff al critico ha messo gli adc in una posizione troppo comoda.\nLa riot ha chiaramente indirizzato i giochi.","replies":[{"poster":"vondarck","date":"2019-12-04T16:23:13.531+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=kegiv,realm=EUW,application-id=MJVj50Jw,discussion-id=NI65tYbV,comment-id=00040000,timestamp=2019-12-04T15:26:01.905+0000)\n>\n> Si ma il critico lo hanno migliorato cmq , la lethality l'hanno nerfata ora con tre oggetti completi abbiamo meno lethality  che già la lethality fa schifo di suo  perché se compro un'oggetto che mi  dà tot di lethality scala con i livelli e nn mi dà subito quella lethality e poi chi se li builda 4-5 oggetti lethality poi nn hai sustain e nient'altro ,quella sanguine blade non serve a nulla.  e il winrate degli assassin mid ad è crollato , l'unico che ne trae giovamento è pyke che ha le abilità che scalano lethality e non si può buildare hp.\n> In più ciliegina sulla torta hanno tolto anche lo scudo a comando sull'edge of night che era ottimo x evitare stun negli agguati, ora per un assassin quell'oggetto non serve piu a un %%%%% peggio di quella sanguine cesso blade, se voglio splittare gioco fiora tryndamere no un'assassin.\n> A me di kayn mid non mi interessa più di tanto è solo per rispondere sopra.\n> Questo più il buff al critico ha messo gli adc in una posizione troppo comoda.\n> La riot ha chiaramente indirizzato i giochi.\n\nLa letality la han cambiata\nIl nerf al EoN è abbastanza sconveniente, di contro le statistiche aggiuntive che da lo rendono un oggetto molto ibrido (come la sanguin blade).\nL'umbrella è molto forte invece, costa poco e da una giusta quantità di statistiche (e tanta utility)\nLa sanguin è già \"rientrato\" il problema dopo l'hotfix\nLa EoN è ancora un oggetto di dubbia natura potrebbe essere preso da ogni champ che scala AD e vuole proteggersi dalla magia (data la combinazione di AD e HP buona)\n\nLa tattica dello split da la possibilità dopo aver bullato una linea e rommato di poter anche dare il senso ad una build da push, non la schifare!","replies":[{"poster":"kegiv","date":"2019-12-04T16:41:22.290+0000","up_votes":1,"down_votes":0,"body":"Ma invece di integrare il tiamat in un'oggetto da lethality che me ne faccio del rubavita , cosi da non avere quel mezzo oggetto purtroppo necessario che rallenta la build , allora avrebbe avuto un senso la sanguigne blade, la Eon hanno messo quegli hp in + a scapito di 7 punti di letalità e lo scudo nn + a comando è un furto.\n\nGuarda questa classifica del winrate e la morte che hanno fatto gli assassini ad dopo il rework alla lethality  \n\nhttps://www.leagueofgraphs.com/champions/builds/by-winrate\n\nTalon 90 posto \nzed 110\nqiyana 138\n\nE invece guarda gli assassini ap \n\nkassadin 3 posto\nfizz 11\nekko 17\nahri 19\n\nUn'abisso.","replies":[{"poster":"vondarck","date":"2019-12-04T16:51:50.723+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=kegiv,realm=EUW,application-id=MJVj50Jw,discussion-id=NI65tYbV,comment-id=0004000000000000,timestamp=2019-12-04T16:41:22.290+0000)\n>\n> Ma invece di integrare il tiamat in un'oggetto da lethality che me ne faccio del rubavita , cosi da non avere quel mezzo oggetto purtroppo necessario che rallenta la build , allora avrebbe avuto un senso la sanguigne blade, la Eon hanno messo quegli hp in + a scapito di 7 punti di letalità e lo scudo nn + a comando è un furto.\n> \n> Guarda questa classifica del winrate e la morte che hanno fatto gli assassini ad dopo il rework alla lethality  \n> \n> https://www.leagueofgraphs.com/champions/builds/by-winrate\n> \n> Talon 90 posto \n> zed 110\n> qiyana 138\n> \n> E invece guarda gli assassini ap \n> \n> kassadin 3 posto\n> fizz 11\n> ekko 17\n> ahri 19\n> \n> Un'abisso.\n\nIo non considero integrato il tiamat\nIo considero supplementare al tiamat (prenderei l'idra E la sanguin lategame)\n\nCosì puoi forzare situazioni 4v5 in lategame e onesottare il carry avversario\n\nKassa sarà nerfato\n\nP.s. in preseason nel bene o nel.male.xi sta che \"scappi\" qualcosa","replies":[{"poster":"kegiv","date":"2019-12-04T18:05:40.349+0000","up_votes":1,"down_votes":0,"body":"Quello che dici è vero per altri champ ma non per talon zed e qiyana, per quello che non ti do pienamente ragione.\n\nPiù di 3 oggetti lethality su un champ non si possono fare non possono abbassare la lethality su un oggetto a meno di 18 punti se no è un nerf, black Cleaver +  memento mori o lord dominik o angelo custode  sono essenziali, indispensabili in quasi ogni game.\nPurtroppo questa nuova sanguigne blade serve più a gente come quinn,ad altri o alcuni jungler non certo ai 3 assassin ad da lane di lol , talon qiyana e zed il cui winrate è crollato di 1 - 2 punti %.\n\nIo con talon splitto lo stesso bene in 2 secondi con tiamat e la mia W quell'oggetto nn mi serve a nulla , mi ritrovo solo con 8 di letalithy in meno dopo questo rework della lethality, il che è devastante ed  è un pesante nerf xkè fa la differenza tra uccidere un'adc e non riuscire ad ucciderlo.","replies":[{"poster":"vondarck","date":"2019-12-05T08:53:13.479+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=kegiv,realm=EUW,application-id=MJVj50Jw,discussion-id=NI65tYbV,comment-id=000400000000000000000000,timestamp=2019-12-04T18:05:40.349+0000)\n>\n> Quello che dici è vero per altri champ ma non per talon zed e qiyana, per quello che non ti do pienamente ragione.\n> \n> Più di 3 oggetti lethality su un champ non si possono fare non possono abbassare la lethality su un oggetto a meno di 18 punti se no è un nerf, black Cleaver +  memento mori o lord dominik o angelo custode  sono essenziali, indispensabili in quasi ogni game.\n> Purtroppo questa nuova sanguigne blade serve più a gente come quinn,ad altri o alcuni jungler non certo ai 3 assassin ad da lane di lol , talon qiyana e zed il cui winrate è crollato di 1 - 2 punti %.\n> \n> Io con talon splitto lo stesso bene in 2 secondi con tiamat e la mia W quell'oggetto nn mi serve a nulla , mi ritrovo solo con 8 di letalithy in meno dopo questo rework della lethality, il che è devastante ed  è un pesante nerf xkè fa la differenza tra uccidere un'adc e non riuscire ad ucciderlo.\n\nPerché no scusa?\n\n{{item:3074}} {{item:3181}} {{item:3071}} {{item:3814}} {{item:3033}} \n\nSei un duellante micidiale con questa build! Ovviamente l'edge of night è sostituibile con {{item:3147}} {{item:3179}} \n\nAnche la mannaia di suo è un oggetto situazuonale, è un item anti tank (molto forte)","replies":[{"poster":"Ringiel","date":"2019-12-05T11:33:39.756+0000","up_votes":1,"down_votes":0,"body":"la tua build non ha senso,perchè come ha detto kegiv sacrifichi un botto di danni per della sustain che su un assassin non serve a nulla,visto che una volta usata la combo il suo dps scende vertiginosamente ... la build più giusta in questo meta è questa {{item:3074}} {{item:3117}}  {{item:3147}} {{item:3142}}{{item:3181}} {{item:3071}}/{{item:3026}} ,con la {{item:3181}} che può essere sostituita per la {{item:3814}} se hanno cc pesanti che ti possono colpire.","replies":[{"poster":"vondarck","date":"2019-12-05T14:29:51.311+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ringiel,realm=EUW,application-id=MJVj50Jw,discussion-id=NI65tYbV,comment-id=00040000000000000000000000000001,timestamp=2019-12-05T11:33:39.756+0000)\n>\n> la tua build non ha senso,perchè come ha detto kegiv sacrifichi un botto di danni per della sustain che su un assassin non serve a nulla,visto che una volta usata la combo il suo dps scende vertiginosamente ... la build più giusta in questo meta è questa {{item:3074}} {{item:3117}}  {{item:3147}} {{item:3142}}{{item:3181}} {{item:3071}}/{{item:3026}} ,con la {{item:3181}} che può essere sostituita per la {{item:3814}} se hanno cc pesanti che ti possono colpire.\n\nSi, in effetti è la build che farei su wuko o pant come ho scritto nel altro replay che sono champ a cavallo tra l'assassin e il fighter.\n\nNe aproffitto per chiederti dato che giocavi {{champion:246}}  cosa builderesti su un assassino jung come {{champion:107}}  o su assassin come {{champion:121}}  e SA {{champion:141}}","replies":[{"poster":"Ringiel","date":"2019-12-05T16:00:10.740+0000","up_votes":1,"down_votes":0,"body":"rengar va giocato come shaco,cioè non bisogna evolvere il machete e va rushata subito la {{item:3077}},mentre kha fa il {{item:1400}} normalmente,poi i due champ si buildano la {{item:3147}}; dopo la draktar la build varia a seconda di come si è messo il game,tipo un nemico è feedato o non sei particolarmente avanti,allora opti per un item che non ti faccia esplodere,quindi la {{item:3071}},altrimenti se stai snowbollando vai di build full lethality,cioè {{item:3179}},che da jungler è buona perchè costa poco e aiuta a dewardare,e {{item:3814}},per poi chiudere con {{item:3026}} e la {{item:3071}}; il nuovo item {{item:3181}} l'ho provato su tutti e due e sinceramente l'ho trovato forte solo su rengar,perchè andava a interagire con la sua q,mentre a kha non serve più di tanto,perchè ti esplode di q+passiva e quindi l'as non è poi tanto forte con il suo kit,quindi puoi anche farti il nuovo item con o al posto della {{item:3814}} su rengar.\nkayn blu lo buildi praticamente come un kha,con la differenza che buildi sempre la {{item:3142}} su di lui per la ms fuori dal combat come terzo item dopo la draktar e sacrifichi la {{item:3071}} come quinto/sesto oggetto,tanto ti basta un ga come item difensivo,visto che hai l'ulti che ti rende intarghettabile. kayn rosso invece ha mantenuto la stessa build {{item:1400}} {{item:3071}} {{item:3812}} {{item:3026}} ","replies":[{"poster":"vondarck","date":"2019-12-05T18:21:35.664+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ringiel,realm=EUW,application-id=MJVj50Jw,discussion-id=NI65tYbV,comment-id=0004000000000000000000000000000100010000,timestamp=2019-12-05T16:00:10.740+0000)\n>\n> rengar va giocato come shaco,cioè non bisogna evolvere il machete e va rushata subito la {{item:3077}},mentre kha fa il {{item:1400}} normalmente,poi i due champ si buildano la {{item:3147}}; dopo la draktar la build varia a seconda di come si è messo il game,tipo un nemico è feedato o non sei particolarmente avanti,allora opti per un item che non ti faccia esplodere,quindi la {{item:3071}},altrimenti se stai snowbollando vai di build full lethality,cioè {{item:3179}},che da jungler è buona perchè costa poco e aiuta a dewardare,e {{item:3814}},per poi chiudere con {{item:3026}} e la {{item:3071}}; il nuovo item {{item:3181}} l'ho provato su tutti e due e sinceramente l'ho trovato forte solo su rengar,perchè andava a interagire con la sua q,mentre a kha non serve più di tanto,perchè ti esplode di q+passiva e quindi l'as non è poi tanto forte con il suo kit,quindi puoi anche farti il nuovo item con o al posto della {{item:3814}} su rengar.\n> kayn blu lo buildi praticamente come un kha,con la differenza che buildi sempre la {{item:3142}} su di lui per la ms fuori dal combat come terzo item dopo la draktar e sacrifichi la {{item:3071}} come quinto/sesto oggetto,tanto ti basta un ga come item difensivo,visto che hai l'ulti che ti rende intarghettabile. kayn rosso invece ha mantenuto la stessa build {{item:1400}} {{item:3071}} {{item:3812}} {{item:3026}}\n\nRaast non avevo dubbio sulla build, mentre SA lo uso talmente poco che volevo sapere cosa conveniva ATM\n\nRengo con electro o con piede lesto?\n\nThx","replies":[{"poster":"Ringiel","date":"2019-12-05T19:41:14.314+0000","up_votes":1,"down_votes":0,"body":">Rengo con electro o con piede lesto?\n\nelectro","replies":[]}]}]}]},{"poster":"kegiv","date":"2019-12-05T12:10:29.173+0000","up_votes":1,"down_votes":0,"body":"Guarda questo profilo SmokingBoy69  è lo streamer talonlonfarm  stà smurfando e con talon ho 80% win in diamond lui se la fà sempre la black Cleaver+ youmuu + draktharr, poi non sò se è ancora legato alla vecchia build e non è ancora aperto alla novità, e magari è  meglio  come dici tu.","replies":[{"poster":"Ringiel","date":"2019-12-05T12:35:10.370+0000","up_votes":1,"down_votes":0,"body":"io non voglio mettere in dubbio le capacità dell'otp talon,però i pro player non la montano più come quarto oggetto\n\nhttps://www.probuilds.net/champions/details/Talon\n\nlui è otp con quel champ,quindi la maggior parte dei game snowbolla e se in questo meta snowbolli mid o top quasi sempre vinci il game perchè diventi ingestibile ; io sinceramente a livello di stats preferisco più lethality per snowbollare a una bc che la vedo più come un oggetto difensivo per ottere hp extra,tanto se sei troppo avanti in livelli difficilmente riescono a ucciderti.","replies":[{"poster":"kegiv","date":"2019-12-05T12:57:17.382+0000","up_votes":1,"down_votes":0,"body":"Io seguivo solo lui e yamikaze quindi seguivo quello che facevano loro, sicuramente questi sono + bravi :)\n\nMa secondo te mi conviene giocare talon in silver ? Essendo silver non è che ho sta capacità di stompare il game in 20 min.\nO visto che i game durano di +  tipo 30-40 minuti in silver meglio usare mid un fighter buildato un po' assassin tipo wukong - vi, o qualcosa cmq di resistente tipo diana , o direttamente giocare top con un juggernaut ?","replies":[]}]}]}]},{"poster":"kegiv","date":"2019-12-05T11:08:32.185+0000","up_votes":1,"down_votes":0,"body":"Ho provato la build che hai detto con Talon sul manichino con 100 di armor ,\nLa combo completa con attiva del tiamat senza elettrocute fa circa 1800 danni\nLa build standard invece youmuu+draktharr.mementomori+black Cleaver+idra  con attiva del tiamat senza elettrocute fa 2300 danni.  Questa build variava con l'edge of night a seconda delle situazioni.\n\nLa tua build ha il 20 % di cdr e 20 di letalità che diventano 28 su avversario singolo , un po' di rubavita e velocità d'attacco sempre su bersaglio singolo , nei tf no.\n\nLa build standard ha velocità di movimento essenziale x roammare data dalla youmuu che se attivata aumenta ancora, ha 41 di letalità anche nei tf e 40% di cdr indispensabili x un assassin.\n\n\nLa tua build è ottima su un fighter tipo wukong , ma un'assassino con quella build ci perde un botto, circa 20% cdr ,20 di letalithy, moviment speed e 500  danni in una combo.","replies":[{"poster":"vondarck","date":"2019-12-05T14:24:28.438+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=kegiv,realm=EUW,application-id=MJVj50Jw,discussion-id=NI65tYbV,comment-id=00040000000000000000000000000000,timestamp=2019-12-05T11:08:32.185+0000)\n>\n> Ho provato la build che hai detto con Talon sul manichino con 100 di armor ,\n> La combo completa con attiva del tiamat senza elettrocute fa circa 1800 danni\n> La build standard invece youmuu+draktharr.mementomori+black Cleaver+idra  con attiva del tiamat senza elettrocute fa 2300 danni.  Questa build variava con l'edge of night a seconda delle situazioni.\n> \n> La tua build ha il 20 % di cdr e 20 di letalità che diventano 28 su avversario singolo , un po' di rubavita e velocità d'attacco sempre su bersaglio singolo , nei tf no.\n> \n> La build standard ha velocità di movimento essenziale x roammare data dalla youmuu che se attivata aumenta ancora, ha 41 di letalità anche nei tf e 40% di cdr indispensabili x un assassin.\n> \n> \n> La tua build è ottima su un fighter tipo wukong , ma un'assassino con quella build ci perde un botto, circa 20% cdr ,20 di letalithy, moviment speed e 500  danni in una combo.\n\nEh si, gli \"assassini\" che gioco più di frequente sono {{champion:107}}  {{champion:80}}  e {{champion:62}} che hanno questa natura ibrida assassin/fighter\n\nProbabilmente su un assassino \"standard\" non conviene..\n\nMB","replies":[]},{"poster":"Ringiel","date":"2019-12-05T11:28:14.614+0000","up_votes":1,"down_votes":0,"body":">La build standard invece youmuu+draktharr.mementomori+black Cleaver+idra con attiva del tiamat senza elettrocute fa 2300 danni.\n\nla bc è situazionale,se sei feedato conviene molto di più optare per un terzo oggetto lethality tipo {{item:3181}} o {{item:3814}} se hanno dei cc che possono colpirti,tanto il tuo obbiettivo non è focussare i tank,e poi buildarla dopo al posto della {{item:3033}}.","replies":[{"poster":"kegiv","date":"2019-12-05T11:49:10.501+0000","up_votes":1,"down_votes":0,"body":"Boh non lo sò, ormai quello scudo non lo puoi più avere quando vuoi, e ai 10 di letalithy di quei due oggetti meglio un 25% 35 %  si mori o dominik , tanto pure un adc a fine game ha minimo 90 di armor con 25% 35% di penetrazione faccio + danno che con 10 di letalità al posto dei vecchi 18 che dava l'edge ,10 di letalità sono pochi a sto punto meglio un angelo custode a fine game cmq penso chela black Cleaver faccia  più danno di un 10 di letalità tanto 4-5  attacchi in una combo con tiamat li fai e leva sempre armor a ogni colpo, o a sto punto compro qualcosa che dà 80 di ad.","replies":[{"poster":"Ringiel","date":"2019-12-05T12:12:53.780+0000","up_votes":1,"down_votes":0,"body":"ma appunto,a fine game conviene farsi la bc,per cappare il cdr e ottenere l'arp,il mio discorso era se sei feedato(cosa che deve avvenire altrimenti hai 0 impatto nel game) non ti conviene farti la bc come quarto oggetto,tanto nessun champ squishy che devi focussare builda amor in quel periodo del game,inoltre con i nuovi cambiamenti l'adc, il jungler e il support stanno sempre indietro 2-3 livelli (se non di più) dal mid laner quindi sono anche più facili da esplodere per te se buildi più lethality;\nil dominik non conviene proprio per niente,se proprio ti vuoi fare un oggetto arp% vai per il memento così ottieni la ferita grave,ma come ti ho detto prima i tuoi target non sono i tank e anche se in late game scala meglio della lethality,non conviene su champ tipo talon,perchè tu in late scali male a prescindere dalla build che monti visto che il tuo power spike sta nel early-mid game,quindi buildare un oggetto arp % come quarto oggetto ti stronca il tuo power spyke nel mid game perchè vai a spendere male i soldi che potevi investire in oggetto che ti aiutava a snowbollare ancora di più.","replies":[]}]}]}]}]}]}]}]}]}]}]}]}