{"poster":"NATDABEST","date":"2017-09-19T02:19:43.978+0000","title":"My Shop","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"Hey, i got project zed and project yasuo in my shop but then the shop was not there due to the bugs or whatever, so i didnt have the time to buy the skins. \r\n I dont know if ill still have the same skins when they put the shop back. Will i have the same skins or am i out of luck ? PLZ HELP :(","replies":[{"poster":"Broporo","date":"2017-09-19T02:47:12.946+0000","up_votes":2,"down_votes":0,"body":"No worries bud! If you still want one of those offers, just hit us up in a [**ticket**](https://support.riotgames.com/hc/en-us/requests/new). We can still see the ones you had first so we can make this happen for ya ^_^!","replies":[{"poster":"BB ACC KEKW Zane","date":"2017-09-19T17:03:03.232+0000","up_votes":1,"down_votes":0,"body":"Can i open the new your shop to see which skins i got this time or do i HAVE TO send a support ticket with a request for the old skins, which i got when i opened the shop for the first time, if i want skins from the first time?\nAlso: are there options for the discounts? i mean, can i take both discount rolls? or can i open the new and decide then? OR do i have to decide which i take before opening the new? \n\nthx for an answer  :)","replies":[{"poster":"Broporo","date":"2017-09-19T20:03:22.092+0000","up_votes":1,"down_votes":0,"body":"So there was an issue with the shop the first time which required us to take it offline. When it comes back up the offers will most likely be different. If you want one of those feel free to go ahead and buy it, but if you did want one of the old ones you will need to hit us up in a ticket ^_^!","replies":[{"poster":"BB ACC KEKW Zane","date":"2017-09-19T20:42:31.816+0000","up_votes":1,"down_votes":0,"body":"Could u do that too? For me, i got worse offers than the first time (1 was better). Already sent an ticket to the Support, but i got no answer still.","replies":[{"poster":"Broporo","date":"2017-09-19T21:04:33.869+0000","up_votes":1,"down_votes":0,"body":"Sadly not since I operate on NA. I did verifiy that they have your ticket in the queue, and you should be getting an answer soon. There was an influx of tickets from this shop issue, so that might be slowing them down a little.","replies":[]}]}]}]}]}]}