{"poster":"soy tu putitá ","date":"2017-07-10T03:14:27.163+0000","title":"por que lo que hice esta mal?","subforum":"Off-topic y temas personales","up_votes":4,"down_votes":6,"body":"no entiendo por que me banearon de verdad ni fui toxica ni troll nunca flame ni me iba afk es por que no les compre rp? y obtenia todo gratis gracias a enviar fotos y videos de mi cuerpo desnudo a cambio de rp? eso es malo para ustedes? yo no se por que se meten en mi vida pribada si no son mis padres ademas aqui en venezuela es imposible comprar rp por que no dejan pagar con nuestra moneda y ademas lo dan carisimo asi que por que no puedo conseguirlo por mis medios gracias a mi cuerpo? eeeeh??? por que? acaso les molesta que no les de dinero riot me las vas a pagar tenia mas de 100 skins conseguidas gracias a mi cuerpo bien lindo y ustedes de un dia para otro deciden bannear mi cuenta permanentemente DEBERIA DARLES BERGUENZA {{sticker:slayer-jinx-unamused}}","replies":[{"poster":"Silenciosito","date":"2017-07-10T03:17:06.883+0000","up_votes":2,"down_votes":1,"body":"Baneenle la cuenta en el foro y amiga comprate un diccionario en ves de gastarte en skins  de un juego q no valen de nada...","replies":[{"poster":"Vaendrys","date":"2017-07-10T03:18:56.777+0000","up_votes":2,"down_votes":1,"body":"No podes mandar a comprar un diccionario y mandarte un \"ves\" xD","replies":[]},{"poster":"soy tu putitá ","date":"2017-07-10T03:18:46.648+0000","up_votes":1,"down_votes":0,"body":"no gaste en el juego parece que eso es lo k les molesto a riot no tengo dinero crees que lo gastaria aqui? {{sticker:zombie-brand-facepalm}}","replies":[]}]},{"poster":"Vaendrys","date":"2017-07-10T03:17:02.880+0000","up_votes":2,"down_votes":1,"body":"***","replies":[{"poster":"soy tu putitá ","date":"2017-07-10T03:20:11.552+0000","up_votes":1,"down_votes":0,"body":"y a mi que me inporta eso? yo quiero mi cuenta de nuevo","replies":[{"poster":"Vaendrys","date":"2017-07-10T03:21:28.793+0000","up_votes":1,"down_votes":0,"body":"Por lo menos intenta recuperarla dignamente, no haciendote pasar por mina.","replies":[{"poster":"Silenciosito","date":"2017-07-10T03:22:35.403+0000","up_votes":1,"down_votes":0,"body":"Jaja igual no la recupera","replies":[{"poster":"soy tu putitá ","date":"2017-07-10T03:24:38.718+0000","up_votes":1,"down_votes":0,"body":"tiene que regresarmela por que es mia yo gaste mucho tiempo en ella y tambien esfuerzo","replies":[{"poster":"Silenciosito","date":"2017-07-10T03:38:11.908+0000","up_votes":1,"down_votes":0,"body":"No man la perdiste y no la recuperas","replies":[{"poster":"soy tu putitá ","date":"2017-07-10T18:52:28.089+0000","up_votes":1,"down_votes":0,"body":"amiga ayudame entre chicas debemos apoyarnos no entiendo de verdad por que riot dice que hice mal en recibir skins de ese modo en que parte dice que no puedo?? por fis amiga","replies":[]}]}]}]},{"poster":"soy tu putitá ","date":"2017-07-10T03:22:33.065+0000","up_votes":1,"down_votes":0,"body":"si me la banearon por ser mujer y usar mi cuerpo se ve que eres machista igual que riot las mujeres tambien tenemos derecho asi que quiero que se cumplan","replies":[{"poster":"Vaendrys","date":"2017-07-10T03:25:15.106+0000","up_votes":1,"down_votes":0,"body":"¿No tenes tarea para despues de vacaciones? ¿U otra cosa para entretenerte?","replies":[{"poster":"soy tu putitá ","date":"2017-07-10T03:26:19.875+0000","up_votes":1,"down_votes":0,"body":"NO","replies":[]}]}]}]}]}]},{"poster":"Fleurche","date":"2017-07-12T17:49:31.656+0000","up_votes":1,"down_votes":0,"body":"Mira la tontería que decís. No podés hacer eso sencillamente porque HAY NIÑOS JUGANDO, no es un juego para adultos. Si juegan... allá ellos (soy una), pero es un juego para menores más que nada y el público no puede recibir ese tipo de fotos.\n\nAndá a desnudarte a otra parte, ojalá no te desbaneen {{champion:103}} !!!","replies":[]},{"poster":"iEban","date":"2017-07-10T03:40:19.614+0000","up_votes":1,"down_votes":0,"body":"Si esto es verdad, lo cual estimo en un 2% de posibilidades, tranquila roberto. Podes conseguir todas las skins de nuevo en dos días.\nO hace un stream y que te donen, no viste la cantidad de chicas gamers que muestran las tetas que viven de eso por stream?","replies":[{"poster":"soy tu putitá ","date":"2017-07-10T18:55:14.463+0000","up_votes":1,"down_votes":0,"body":"hola roberto gracias por contestar \nyo no puedo hacer stream mi lap apenas puede con lol a 30 fps y con lag y menos con el internet de venezuela y que se va al luz si no ya lo habria hecho y ya paso 1 semana desde que me bannearon y nada riot dice que no debi mandar fotos de mi a cambio de skins y solo dicen lo mismo y lo mismo estoy desesperda saludos¡¡ <3 claudia","replies":[]}]}]}