{"poster":"Mazy","date":"2017-03-09T02:22:47.689+0000","title":"Nerf Le Blanc: humilde opinion","subforum":"Charlas Generales","up_votes":1,"down_votes":3,"body":"No se en que foro va este post. Lo pondr&eacute; en Charlas Generales.\r\n\r\nCreo que {{champion:7}} estaba DESBALANCEADA, y MERECIA NERF, ya que en ELO alto era &quot;pick or ban&quot;. Comprendo que es un nerf necesario el de reducir el da&ntilde;o de alguna forma, pero no es mucho?. Hay dos cosas que todos los asesinos de mid intentan hacer(en algunos casos no se pueden realizar las dos cosas): \r\n  1 &quot;Solo lasthitear&quot; o mas bien conocido como &quot;Freezear&quot;. Es importante ya que como los asesinos son poderosos en el 1v1, a la hora de hacer un trade suelen ganar f&aacute;cilmente.\r\n  2 Otra mec&aacute;nica de los asesinos muy com&uacute;n, es pushear la linea r&aacute;pidamente y luego de esa acci&oacute;n, rotar. Rotar a la toplane, botlane, drag&oacute;n, heraldo, jungla aliada o enemiga.\r\n\r\nAn&aacute;lisis:\r\n  Bufearon la limpieza de wave de le blanc con el buff a la Q(que ayuda a la mecanica n&deg;2) pero el da&ntilde;o de la W fue disminuido demasiado(significa que la limpieza de waves, no esta ni nerfeada ni buffeada). Entonces, la idea de pushear r&aacute;pidamente, lleva mas tiempo, y ademas a la hora de rotar la W pega exageradamente menos. Por lo tanto LA MEC&Aacute;NICA N&deg;2 esta NERFEADA.\r\n  Nerfearon much&iacute;simo el da&ntilde;o de la W de Le Blanc entonces en los enfrentamientos, en todas las facetas del juego, ser&aacute;n mucho mas dif&iacute;ciles de ganar. Por lo tanto LA MEC&Aacute;NICA N&deg;1 est&aacute; NERFEADA.\r\n\r\nConclusi&oacute;n:\r\n  Teniamos un asesino con muchisimo da&ntilde;o. Tenia da&ntilde;o y lo nerferaron. Pero le nerfearon dos estrategias claves para un asesino!! Tal vez sea mucho, e incluso lo vuelva in&uacute;til.\r\n  Quiero aclarar que con esto no estoy pidiendo un buff ni mucho menos, eso lo decide Riot Games por que es SU JUEGO y hace LO QUE QUIERE con el balance del mismo. Solo quiero dar mi humilde opini&oacute;n al respecto y si alguien esta de acuerdo, deje su comentario debajo :)\r\n  Se que tendr&eacute; much&iacute;simo &quot;hate&quot; en los comentarios ya que hay gente que esta frustrada de la Broken Le Blanc(INCLUSIVE YO) Pero seamos realistas, era necesario el incre&iacute;ble nerf? Yo creo que no. \r\n  No pas&oacute; ni una semana con el nerf a le blanc, as&iacute; que no tengo certeza de si su efectividad o win rate va a bajar mucho, pero yo creo que lo har&aacute; ya que su funci&oacute;n como asesina fue disminuida bastante. \r\n\r\n  Saludos!","replies":[{"poster":"Runth","date":"2017-03-09T03:39:13.827+0000","up_votes":2,"down_votes":0,"body":"silencio y farmea con tu Q","replies":[]},{"poster":"cristiankator","date":"2017-12-20T12:28:14.420+0000","up_votes":1,"down_votes":0,"body":"La leblanc anterior aplicaba el daño al instante , era muy eficaz para matar el adc, después del rework a largo plazo tenía prácticamente el mismo daño a un solo objetivo, el cambio para limpiar oleadas con el rebote de la q cuando estaban marcados nose si era mayor a lo que era antes meter una w,r, ya que la w tenía más daño antes, más que todas las otras habilidades, antes del mundial sufrió un nerf, le bajaron mucho daño a cadenas etéreas de la r y al sello de maldad en los primeros niveles, sigue siendo buena en linea, tiene la misma movilidad, pero pienso que tarda mucho en aplicar daño, eso la complica si fedean  a algún adc o se hace late game , es muy frágil y te puden matar antes de que explote el sello de maldad que es una de las mayores fuentes de daño de lb.","replies":[]},{"poster":"Blackhawk6","date":"2017-03-09T03:51:27.341+0000","up_votes":1,"down_votes":0,"body":"Leblanc siempre hacia un daño absurdo aunque fallara alguna de sus habilidades, creo que el mayor daño hacia campeones reside en la pasiva y la Q. Al menos asi estara un poco (un poco nada mas) obligada a acertar mas, y no simplemente tirar el salto y luego la Q y hacer un daño absurdo aunque haya fallado una habilidad. La segunda mecanica de la que hablas no esta nerf debido al buff (yo ni siquiera se por que a un asesino como lb le dieron las marcas esas en plan ryze) y la primera apenas lo esta, y  es justo, incluso no se si sigue siendo demasiado alto.","replies":[{"poster":"Mazy","date":"2017-03-12T16:59:10.355+0000","up_votes":1,"down_votes":0,"body":"Aun que no estemos de acuerdo, me parece perfecto que puedas dar tu opinión sin desmerecer la del otro como hizo \"CallejeroKiller\" con su comentario.\nPor qué \"la segunda mecánica\" esta bufeada? La Q sube el daño a los minions pero la w baja entonces se equilibra, pero en cuanto a la R(w) y W a la hora de matar al enemigo o quitarle summoners en otra linea baja su daño, lo que implica que el enemigo será mas difícil de matar.","replies":[]}]},{"poster":"A Noxian Beauty","date":"2017-03-09T04:23:02.674+0000","up_votes":1,"down_votes":0,"body":"fue demasiado,juego mucho a leblanc y la dejaron muy mal con respecto a otros campeones de su mismo rol,quedo mas debil que un fizz,un kassadin o azir,ahora habra muchos mas picks con un daño mucho mas fuerte que ella a level 6 como katarina por ejemplo. Y ni si quiera me ha tocado jugar ultimamente contra los yasuos y zeds despues del nerf,no tengo idea que diablos vaya a pasar pero sospecho que me voy a quedar sin mana tratando de hacerles daño ya que tendre que gastar el doble para lograr lo que antes hacia en 1 solo combo bien tirado.","replies":[]},{"poster":"Fransoi ","date":"2017-03-09T03:24:40.249+0000","up_votes":1,"down_votes":0,"body":"Y a yasuo no lo tocan -_-","replies":[]},{"poster":"Maanuh","date":"2017-03-09T02:47:52.799+0000","up_votes":1,"down_votes":0,"body":"Yo creo que esta 10/10 el nerf porque jugaras lo que jugaras te ganaba en linea y se cojia a las demas, yo creo que esta perfecto ya que juego Ekko y es el counter principal :v {{champion:245}}","replies":[]},{"poster":"FF 15 Pls","date":"2017-03-09T02:43:40.209+0000","up_votes":1,"down_votes":0,"body":"Elo alto plata 2? omg","replies":[]}]}