{"poster":"full boomer","date":"2015-09-11T08:33:26.533+0000","title":"Platin 5  Adc sucht Support für DuoQ und mehr","subforum":"Clans & Teams","embed":{"description":"Check your Summoner statistics, MMR, realtime spectate and using powerful global LoL Charts!","url":"http://euw.op.gg/summoner/userName=CV+Nandonis","image":"http://attach.s.op.gg/logo/20150820115257.c33e16d4d4ea9617c904ea54d29a015a.png"},"up_votes":1,"down_votes":0,"body":"Hey Leute! \r\n\r\nIch suche nach einem Support der Lust, Zeit und Energie hat mit mir eine Botlane zu formen :) \r\n\r\nAnfangs geht es um kennenlernen zusammen spielen, sich verbessern und miteinander aufzusteigen. (Ich m&ouml;chte in dieser Season mein Ziel Diamond auf jeden Fall erreichen)\r\nMittelfristig m&ouml;chte ich dann ein Ranked Team aufbauen, mit unserer Botlane als Herzst&uuml;ck!\r\n\r\nIch bin Mitte 20 und bringe Witz, K&ouml;nnen und alle g&auml;ngigen Kommunikationswege mit. \r\nVon euch erwarte ich mir Lockerheit, Spielverm&ouml;gen und den Willen auch mal an etwas zu arbeiten, wenn es nicht nach 2 Minuten funktioniert! :)\r\n\r\nAdded mich gern einfach Ingame oder antwortet hier, dann k&ouml;nnen wir uns auch &uuml;ber Championpool etc unterhalten. {{champion:67}}","replies":[{"poster":"MelonTea","date":"2015-09-12T16:27:53.837+0000","up_votes":1,"down_votes":0,"body":"Support spiele ich seit Anfang Season 2. Derzeitig bin ich in Solo/Duo Platin und in 5vs5  Platin. \n\n**Stärken: **\n- Geduldig\n- Experementierfreudig (Strategien etc.)\n- Kritikfähig \n- setzt hohen Wert auf Vision (JEDER HAT ZU WARDEN)\n\n**Schwächen: **\n- zurückhaltend (Kommunikation, Kritik an Mates, Calls etc)\n- ohne Synergie mit dem ADC, schlecht funktionierende Bottom (ADC nutzt das Janna Shield nicht, kein Vertauen in Support/ADC etc)\n- stirbt gerne mal beim warden :'D \n\n**Main Supporter: **\nJanna - Thresh - Morgana - Soraka \n(Konzentriere mich auf einen kleinen Pool um somit den Umgang mit meinen Mains besser auszuprägen. Am meisten spiele ich aber Janna, da ich ihr Engage/Disengage/Sustain Kit mag.)\n\nIn großen und ganzen ist erst einmal alles gesagt. Ich stehe hier sowie Ingame für Fragen zur Verfügung. \n\nMFG\nMelonTea","replies":[]},{"poster":"Afix","date":"2015-09-11T08:54:36.337+0000","up_votes":1,"down_votes":0,"body":"Also bin Main Supporter und würde dich auch auf der Botlane supporten, aber weiß nicht ob ich schon bereit für \"mehr\" bin :P","replies":[{"poster":"full boomer","date":"2015-09-11T12:37:45.715+0000","up_votes":1,"down_votes":0,"body":"Hab dich geadded ;)","replies":[]}]},{"poster":"UndeadMelon","date":"2015-09-11T12:37:20.604+0000","up_votes":1,"down_votes":0,"body":"Heyoo, ich heiße Jan und bin 18 Jahre alt. Ich bin zwar erst gold 5, aber dafür sehr gerne bereit noch viel zu lernen und ich hatte auch schon adc´s aus diamond, die gesagt haben, dass ich auf sehr hohem niveau supporte :), hab dich mal geaddet ^^","replies":[]}]}