{"poster":"Shaco rekt u ez","date":"2015-10-03T22:16:34.388+0000","title":"E BASTA CON STO SERVER !","subforum":"Discussioni generali","up_votes":21,"down_votes":8,"body":"E mo  basta ! sto server ha veramente stancato ! si disconnette col ping a 60, poi se riavvio il gioco mi dice che non riceve risposta dal server! ma scherziamo ?? Qualcuno ne sa qualcosa perch&egrave; non so che fare !","replies":[{"poster":"Dreadful Force","date":"2015-10-03T22:20:42.109+0000","up_votes":5,"down_votes":4,"body":"scrivi al supporto riot, ti diranno le solite due minchiate che è il tuo fire wall, tanto da pararsi il culo e non fare un cazzo, anche a me è crashato il server ma i miei amici sono in game e li sto sentendo in ts, quindi non è il server, ma è un prblema che boh non si sa da cosa venga fuori.\ncmq sia a prescindere potrebbero fare qualcosa per rendere piu compatibile lol per tutti i pc e per evitare queste minchiate, che fanno solo incazzare la gente, ma troppo sbatti, visto che guadagnano milioniè meglio spenderli per creare nuove skin costosissime invece che rendere questo gioco migliore e piu meritocratico in elo medio basso","replies":[{"poster":"Bronze II","date":"2015-10-04T06:37:20.009+0000","up_votes":12,"down_votes":1,"body":"> [{quoted}](name=Dreadful Force,realm=EUW,application-id=MJVj50Jw,discussion-id=gUzl5OqZ,comment-id=0002,timestamp=2015-10-03T22:20:42.109+0000)\n>\n> scrivi al supporto riot, ti diranno le solite due minchiate che è il tuo fire wall, tanto da pararsi il culo e non fare un cazzo, anche a me è crashato il server ma i miei amici sono in game e li sto sentendo in ts, quindi non è il server, ma è un prblema che boh non si sa da cosa venga fuori.\n> cmq sia a prescindere potrebbero fare qualcosa per rendere piu compatibile lol per tutti i pc e per evitare queste minchiate, che fanno solo incazzare la gente, ma troppo sbatti, visto che guadagnano milioniè meglio spenderli per creare nuove skin costosissime invece che rendere questo gioco migliore e piu meritocratico in elo medio basso\n\nGiuro che la gente maleducata come te, che spara stronzate, appena succede qualcosa, mi fa incazzare. Il solito bambino che gioca 24su7, e appena non puo' per una volta si mette a piangere. Ma poi che cazzo ne sai te della Riot? Non vi hanno già spiegato che alla riot chi si occupa delle skin è diversa da quelli che lavorano sui server, che cazzo offendi se non sai?? Poi vieni qua sul forum a parlare male della Riot quando non fai un cazzo dalla mattina alla sera della tua inutile vita per migliorare la comunity, facile parlare ne quando un gioco è COMPLETAMENTE GRATIS. E' la gente come te che rovina questo gioco, che flamma nei game, che spinge la gente a pensar male.\n\np.s. UNISTALL PLS, MALEDUCATO.","replies":[{"poster":"Dreadful Force","date":"2015-10-04T12:49:12.732+0000","up_votes":3,"down_votes":3,"body":"> [{quoted}](name=kvmist,realm=EUW,application-id=MJVj50Jw,discussion-id=gUzl5OqZ,comment-id=00020001,timestamp=2015-10-04T06:37:20.009+0000)\n>\n> Giuro che la gente maleducata come te, che spara stronzate, appena succede qualcosa, mi fa incazzare. Il solito bambino che gioca 24su7, e appena non puo' per una volta si mette a piangere. Ma poi che cazzo ne sai te della Riot? Non vi hanno già spiegato che alla riot chi si occupa delle skin è diversa da quelli che lavorano sui server, che cazzo offendi se non sai?? Poi vieni qua sul forum a parlare male della Riot quando non fai un cazzo dalla mattina alla sera della tua inutile vita per migliorare la comunity, facile parlare ne quando un gioco è COMPLETAMENTE GRATIS. E' la gente come te che rovina questo gioco, che flamma nei game, che spinge la gente a pensar male.\n> \n> p.s. UNISTALL PLS, MALEDUCATO.\n\nguarda che io lavoro come tutti gli altri e se sono cosi rompicoglioni e parlo cosi è solo perche gioco dal quadruplo del tuo tempo, povero pivellino, se dico che la riot non fa un cazzo è perche è cosi, loro sono attaccati solo a i soldi e le uniche cose che fanno sono skin super costose per i champ, poi mi dici che devo starmene zitto perche sono maleducato, che ho due anni, beh mi sembra che anche tu stia sparando cazzate che non sai, pero tu sei il paladino della giustizia, povero tardello, non sai e parli. \nio gioco a sto gioco da season 1 e ho visto cosa ha fatto la riot per migliorarlo, niente, assolutamente niente, il server ci sono voluti anni perche lo migliorassero e ok è gia un miglioramento, per igliorare la comunity, niente, il server dicono tanto, ma ancora va male, per migliorare la ladder , hanno messo un sistema per aiutare i tardoni in bronzo che si lamentavano che erano scarsi al culo e allora adesso per assicurarsi i soldi di quei tardic'è una ladder che li sbatte automaticamente in silver gold invece che in bronzo XXXXXV, se ti si pianta continuamente il sevrer e non riesci piu a connetterti, ti dicono bellamente che è il tuo firewall, fare un gioco piu compatiile con i firewall di ogni pc, invece che far andare male tutti, sono tante piccole cose che ci sono da anni e anche risoìoluzioni neasuna, i problemi ci sono da sempre e la riot, anche se la gente si lamenta, lei non fa niente, sta li bellamente a prendere i soldi delle nuove skin, poi ci dice che se è un problema è il nostro pc, per ridurre i tardi, mettono ban che non servono quasi a niente, per i forum, non fanno niente, se non dire i flamer verranno puniti, non flammate, chi rispetta il codice dell'evocatore vince il 27% dei game in piu rispetto chi non lo fa, guardaci, ci sono una decina di report a fine game e quelli che contano, sono addirittura due sul flame adesso gli afk, perche prima se ne sbattevano e innovazione adesso anche se trolli, la gente se ne lamentava solo da season 1, ci soo volute soltanto 4 season, per fare un passettino in avanti.\nquelli che lavorano sulle skin saranno anche altre persone rispettoa i programmatori, ma presumo che siano sempre pagati dalla riot, quindi sono loro afiiliati, quindi la casa riot, dice fanculo il gameplay, fanculo il lag, fanculo la ladder, vogliamo piu soldi fate skin cosotose e basta, dei problemi ce ne sbattiamo, lo fanno tutti, non solo quelli che fanno skin e quelli che fanno i server li lasciano a casa, quindi, se mi dici che non so niente e non dovrei parlare, sicuramente tu non sai tanto piu di me e parli per sentito dire.\npoi cosi tanto pr puntualizzare, io dovrei disinstallare perche sono maleducato, vedi c'è un errore di fondo, uno puo essere maleducato quanto vuole, pero non conta niente a i fini del gioco, quindi il fatto che io debba disinstallare perche sono maleducato è solo un flame gratuito da un bambinetto che non sa neanche da che parte è girato e non sapendo su cosa attaccarsi per dire alla gente che sono tardi gli da del maleducato, qua c'è gente che parla maggiorenne e vaccinata, se tu hai dieci anni, povero mio, non venirci nemmeno sul forum, che meno ce ne sono di bambinetti meglio è e meglio andra il forum","replies":[{"poster":"MidNightFox6","date":"2015-10-05T01:45:23.078+0000","up_votes":1,"down_votes":0,"body":"Sai cosa fa più ridere?\nTe lo elenco in ordine:\n1) gioco gratuito\n2) nessuno ti obbliga a giocare, se sei così scontento, vai nel pannello di controllo e disinstalla, così non avrai più a che fare con queste problematiche che tanto ti impensieriscono\n3) la riot può investire tutti i soldi che vuole nella sezione dedicata alle skin o qualsivoglia sezione, comunque sia non sei obbligato a pagare per giocare un champ. Vuoi una skin?paghi . Pensi che siano un furto queste \"costosissime skin\" non paghi e continui la tua esistenza.\n4) hai scritto un papiro, ripetendoti, inciampando più volte nell'italiano, e il tutto condito da una sterile e alquanto inutile polemica.\n\nInfine mi sento di affermare che:\nSarebbe una conquista se il dono del dibattito fosse negato a persone come te.","replies":[{"poster":"Dreadful Force","date":"2015-10-05T03:05:36.215+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=bamboocha6,realm=EUW,application-id=MJVj50Jw,discussion-id=gUzl5OqZ,comment-id=0002000100010000,timestamp=2015-10-05T01:45:23.078+0000)\n>\n> Sai cosa fa più ridere?\n> Te lo elenco in ordine:\n> 1) gioco gratuito\n> 2) nessuno ti obbliga a giocare, se sei così scontento, vai nel pannello di controllo e disinstalla, così non avrai più a che fare con queste problematiche che tanto ti impensieriscono\n> 3) la riot può investire tutti i soldi che vuole nella sezione dedicata alle skin o qualsivoglia sezione, comunque sia non sei obbligato a pagare per giocare un champ. Vuoi una skin?paghi . Pensi che siano un furto queste \"costosissime skin\" non paghi e continui la tua esistenza.\n> 4) hai scritto un papiro, ripetendoti, inciampando più volte nell'italiano, e il tutto condito da una sterile e alquanto inutile polemica.\n> \n> Infine mi sento di affermare che:\n> Sarebbe una conquista se il dono del dibattito fosse negato a persone come te.\n\nsi si è gratuito\nnessuno mi obbliga a giocare, del resto è un gioco sta a me decidere se giocare o meno o se devo disinstallare o meno, di certo non sta a te dirmi che dovrei farlo semplicemente perche magari sono uno stronzo, per quello ci pensa la riot se vuole o meno bannarmi o limitarmi la chat, di certo il gioco è un servizio che io ho accettato di avere a patto di rispettare le regole e visto che non sono ancora stato perma bannato, vuol dire che le rispetto, ma d'altro canto loro hanno accettato di fornirmi un servizio a loro volta e non solo a me, il contratto è una forma di accordo vincolante, loro accettano di fornirci uno spazio funzionale in cui svagarci e noi rispettiamo le regole che ci sono state dette, se la riot non fornisce il servizio da  lei promesso, non siamo legittimati tranquillamente al farle causa, se questo a te non sta bene, ok sono contento per te, ma le parti di un contratto sono sempre due, in questo caso i giocatori e la casa videoludica, se una viene meno l'altra o le altre posso fare ricorso, adesso visto che non ho ancora fatto cause ma invece sono qua a tirare bestemmie, vuol dire che loro non hanno fornito il servizio come doveva essere, quindi non siamo noi stronzi a dire che la riot non fa niente per i problemi che ha questo gioco, ma siamo semplicemente incazzati ma speranzosi che faccia qualcosa.\nla riot li investira lo stesso un mucchio di soldi su skin che molto probabilmente costano di piu del dovuto, ma non sono nessuno per giudicarlo, pero so quanto costano e continuo ad essere sul mio parere che costino troppo, contando che qui in euw hanno anche diminuito il valore del'euro in rp, quindi in parole povere non sono adesso praticamente escono solo skin da 975 in su, ma comprare rp costa di piu, come dici tu potrei tranquillamente non comprare e se le compro nonostante siano costose è una mia scelta, come è una scelta della riot, investire in quello per avere un ritorno maggiore, invece che investire di piu per migliorare compatibilita, giocabilita e la miglioria del server, che da anni ha fatto un po acqua, ma che ha detta loro è stato migliorato, infatti vorrei far notare il titolo di questo post sul forum.\nsi mi piace scrivere papiri, perche io penso che non bastino mai due righe per esprimere un pensiero, ne per spiegareuna situazione in modo corretto, si fa schifo il mio italiano, perche sono un ignorante dimerda, lo so e mi dispiace se ho ferito la tua vena di scrittore plurilaureato, con i miei papiri sgrammaticati, con le mie ripetizioni e le mie polemiche inutili, allostesso modo di come mi hai risposto tu nei primi due punti, un forum libero, puoi non leggere tutto quello che ci viene scritto e puoi evitare di fare polemiche inutili, io scrivo perche non sono contento di questo gioco e di alcuni aspetti in particolare a volte arrabbiandomi parecchio, pero almeno parlo del gioco, visto che questo è il forum di un gioco e non sulla grammatica o sulla prolassita di chi ci scrive su, ne sto a dare contro ad una persona solo perche la pensa diversa da me, tu puoi esprimerti, se ti esprimi solo per dare dei coglioni agli altri, non dovrebbe essere vietato a me di scriverci, ma a te, io non sto dando del coglione a nessuno, io parlo dei problemi che ha questo gioco e la sua comunity, per quello che vedo io.\n\ninfine mi sento di dire, che io sono il primo che pensa che in questo gioco dovrebbero rimuovere ogni forma di chat, e di comunicazione, se non come su hearthstone, messaggi preimpostati, in modo da togliere completamente il flame, cmq sia il dibattito non si puo negare a nessuno semplicemente perche non ti piace come parla.\ndetto questo, arrangiati, se vuoi continuare a darmi del coglione, addami su lol e scrivimi li, mi ci troverai sicuramente piu spesso che qua, sempre che tu voglia leggere le minchiate sgrammaticate che ho da dirti.\nse non ti sta bene quello che scrivo o come lo scrivo, per qualsivoglia motivo, se secondo te sono maleducato, come ha gia scritto qualcuno, se secondo te sono uno stronzo senza alcuna idea di quello che sto dicendo e dico solo stronzate semplicemente perche ho la bocca per dirle, puoi tranquillamente segnalarmi e un rioter togliera i miei posto, magari mi bannera, siccome non sei un rioter e qui in questo forum, conti come tutti gli altri e anche se hai un qi di 300/300 non ti da il diritto di dire a chi debba essere negato un diritto di tutti come quello di scrivere, quanto e come mi pare in forum, sempre nel rispetto delle regole, non ti va bene che mi incazzo, ok, ma finche non insulto nessuno, puoi startene tranquillamente zitto, se ti sembrano troppo lunghi i miei posto, come questo, non leggerli e vai a farti un game su lol, sono un ignorantone sgrammaticato, ok vienimi a dare lezioni di italiano, ma non ti azzardare mai piu a venirmi a dire che mi dovrebbe essere tolto il diritto di scrivere qui, ne che devo disinstallare, semplicemente perche tu ti ritieni migliore.\nspero che questo papiro interminabile, ti vada bene e spero che la mia grammatica sia di tuo gusto, stavolta e spero sopratutto di essermi ripetuto abbastanza, in modo da sentirti ancora.\n\ncordiali saluti da dreadful","replies":[{"poster":"Lightning ff","date":"2015-10-05T08:15:39.102+0000","up_votes":1,"down_votes":0,"body":"Ahahahahahahah mai vista tale maleducazione, sto morendo \nP.s. I diritti vanno a tutti :P\nP.p.s. Se tenti di intavolare una discussione, ma lo fai urlando/incazzandoti, essa perde di significato. Un po' come le manifestazioni, appena qualcuno fa casino, i giornali e politici parlano solo della violenza di queste, nascondendo quindi il significato delle manifestazioni (da brava classe dirigente), le quali appunto perdono significato. Come il tuo discorso (in parte giusto in parte sbagliato, poi ognuno ha le proprie opinioni :P). Consiglio per il futuro :)\nBuona giornata","replies":[{"poster":"Dreadful Force","date":"2015-10-05T12:35:59.021+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Lightning ff,realm=EUW,application-id=MJVj50Jw,discussion-id=gUzl5OqZ,comment-id=000200010001000000000000,timestamp=2015-10-05T08:15:39.102+0000)\n>\n> Ahahahahahahah mai vista tale maleducazione, sto morendo \n> P.s. I diritti vanno a tutti :P\n> P.p.s. Se tenti di intavolare una discussione, ma lo fai urlando/incazzandoti, essa perde di significato. Un po' come le manifestazioni, appena qualcuno fa casino, i giornali e politici parlano solo della violenza di queste, nascondendo quindi il significato delle manifestazioni (da brava classe dirigente), le quali appunto perdono significato. Come il tuo discorso (in parte giusto in parte sbagliato, poi ognuno ha le proprie opinioni :P). Consiglio per il futuro :)\n> Buona giornata\n\nè molto difficile sentire urlare uno sul forum, dimmi come fai pls, perche altrimenti hai scritto tanto sul niente\npoi boh sono maleducato, usi la parola maleducato a casa, non mi sembra che insulto nessuno, che di essere sgarbato, tu mi hai dato del maleducato a caso gia da prima e boh, non so, dai del maleducato ad uno perche vuoi dirgli del flamer ma lui non ha flammato, cioè non capisco, che sei qua a fare.\nio sto scrivendo che quelli che gstiscono il gioco, se ne stanno sbattendo i coglioni dei servizi che ci hanno promesso di fornirci e tu mi dai del maleducato, perche ogni tanto dico cazzo, scusa se ho offesso la tu delicatezza e il tuo bon ton, non sia mai che poi piangi, ti sembro maleducato, segnalami alla riot, se non dicono un cazzo, poi tranquillamente stringerti in un angolino della tua stanza a piangere dicendo quel maleducato mi ha offeso e la riot non fa niente.\nquindi non dire stupidaggini e segnalami, io cmq ti consiglio di andare in un angolino a piangere, ma se tu preferisci stare qua come le persone normali, non come i bambini, parli del gioco e se uno ti risponde in modo duro o sgarbato gli tieni testa oppure ci passi su.\npoi vorrei sapere come fai a dire che sono incazzato, ero bello tranquillo quando ho scritto, semplicemente difendevo le regole del forum e quello che mi garantiscono, al contrario di quello che state facendo voi, io sto parlando del gioco, non di quanto sia maleducato qualcuno o di quanti problemi mentali abbia, sarei io che vi dovrei segnalare, non il contrario, ma non lo faccio perche sono un bravo bimbo e se cancellassi quello a cui io sto rispondendo non avrebbe senso scrivere un papiro di risposta, non trovate","replies":[{"poster":"Lightning ff","date":"2015-10-05T15:59:14.812+0000","up_votes":3,"down_votes":0,"body":"è proprio questo quello a cui mi riferisco, cos'è tutto questo odio?\nrilassati per favore, le cose dette con calma hanno maggior efficacia\n''io sto scrivendo che quelli che gstiscono il gioco, se ne stanno sbattendo i coglioni dei servizi che ci hanno promesso di fornirci e tu mi dai del maleducato, perche ogni tanto dico cazzo, scusa se ho offesso la tu delicatezza e il tuo bon ton, non sia mai che poi piangi, ti sembro maleducato, segnalami alla riot, se non dicono un cazzo, poi tranquillamente stringerti in un angolino della tua stanza a piangere dicendo quel maleducato mi ha offeso e la riot non fa niente.'' a casa mia questo si chiama maleducazione.\ndovresti avere sui ...31 anni circa, o almeno sopra ai 20 (perdonami se sbaglio, sto tirando ad indovinare)?, mi dispiace, ma non li stai dimostrando al momento. Sono sicuro che sei migliore di così. in piu, essendo piu grande, non dovresti dare l'esempio di come si intavola una discussione, a tutti i bimbi (dio quanti ce ne sono...) di lol?\npacati e poi possiamo discutere quello che vuoi :)\np.s.''è molto difficile sentire urlare uno sul forum, dimmi come fai pls, perche altrimenti hai scritto tanto sul niente'' è abbastanza evidente che sei arrabiato...","replies":[]}]}]},{"poster":"MidNightFox6","date":"2015-10-05T19:38:33.030+0000","up_votes":1,"down_votes":0,"body":"La cosa che più mi preme è che non penso tu sia un \"coglione\", non mi permetterei mai a dirlo, anche in caso di evidente flagranza. \nTornado a ciò per cui stiamo dibattendo, credo che il gioco abbia delle pecche, e che come tutte le cose necessiti di migliorie, nonostante ciò non giustifico il tuo modo di argomentare e di pretendere. Questo è quello che mi ha colpito maggiormente.\nComunque sia la mia battuta sulla prolissità e il tuo modo irruento di esprimerti è stata una caduta di stile, per questo mi scuso","replies":[]}]}]}]},{"poster":"Latak1a","date":"2015-10-16T09:08:07.175+0000","up_votes":1,"down_votes":0,"body":"UN +1 GROSSO COME UNA CASA!!!!!","replies":[]},{"poster":"BosTiK JuNi0R","date":"2015-10-04T17:50:36.249+0000","up_votes":1,"down_votes":0,"body":"Honorate a questo evocatore!","replies":[{"poster":"Bestla","date":"2015-10-04T21:20:16.215+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=BosTiK JuNi0R,realm=EUW,application-id=MJVj50Jw,discussion-id=gUzl5OqZ,comment-id=000200010003,timestamp=2015-10-04T17:50:36.249+0000)\n>\n> Honorate a questo evocatore!\n\nchi?","replies":[]}]},{"poster":"Pls Buff Shen","date":"2015-10-04T07:08:25.019+0000","up_votes":1,"down_votes":0,"body":"date un +1 a quest'uomo","replies":[]}]},{"poster":"REDekar","date":"2015-10-03T22:26:28.716+0000","up_votes":1,"down_votes":0,"body":"credo che ci sia un problema con il login. chi è dentro è dentro chi è fuori è fuori ma se ti cade la linea mentre sei in game fai la mia fine","replies":[{"poster":"yuk 2","date":"2015-10-03T22:27:32.298+0000","up_votes":2,"down_votes":0,"body":"nn è questo.  Mi ha proprio cacciato dal gioco a me","replies":[]}]}]},{"poster":"IWantToWinPls","date":"2015-10-03T22:54:08.668+0000","up_votes":8,"down_votes":0,"body":"ALLORA NON SONO L UNICO CHE STA BESTEMMIANDO IN ARAMICO CHE HA RIAVVIATO MODEM PC E QUALSIASI COSA POSSIBILE ED IMMAGINABILE","replies":[]},{"poster":"PugJob","date":"2015-10-03T22:32:49.101+0000","up_votes":6,"down_votes":0,"body":"https://www.youtube.com/watch?v=BFaT_3yrIR4\n\ni think the server must be down !!","replies":[]},{"poster":"Noreo","date":"2015-10-03T22:28:36.264+0000","up_votes":6,"down_votes":0,"body":"Noto con piacere di non essere l'unico allora, qualcuno di voi si ricorda che è gia successo qualcosa di simile quest'anno? \n\nNon capisco, pensavo che fosse tutto chiaro\n\nbtw, ero in game, brutalmente cacciato fuori e non posso riloggare, nessun responso dal server\n\n*Edit, fortunatamente i miei compagni hanno vinto, ma suppongo che molti di noi saranno frustrati per via di questa roba","replies":[]},{"poster":"REDekar","date":"2015-10-03T22:25:18.096+0000","up_votes":3,"down_votes":0,"body":"anche a me stessa cosa stavo facendo 5 0 6 con lee sin al 7 minuto... PERCHèèèè {{champion:64}}  cieco dalla rabbia xD","replies":[]},{"poster":"Sborotalco","date":"2015-10-03T22:32:55.489+0000","up_votes":4,"down_votes":1,"body":"anche a me stesso problema, proprio mentre ero in ranked....che merda mi fanno imbestialire ste cose....che gestore avete voi? di solito quando succedono ste cose ai server succedono con lo stesso gestore.....io ho vodafone","replies":[{"poster":"Giovarco","date":"2015-10-04T09:47:39.107+0000","up_votes":2,"down_votes":0,"body":"Telecom","replies":[]},{"poster":"Noreo","date":"2015-10-03T22:34:38.434+0000","up_votes":1,"down_votes":0,"body":"Pure io, vodafone mate","replies":[{"poster":"Sborotalco","date":"2015-10-03T22:36:56.597+0000","up_votes":3,"down_votes":1,"body":"il server EUW è il piu lardoso di tutti","replies":[]}]},{"poster":"lil final","date":"2015-10-03T23:30:32.838+0000","up_votes":1,"down_votes":0,"body":"Anche io ho vodafone {{item:3151}}","replies":[]}]},{"poster":"ShowterX","date":"2015-10-04T12:03:59.871+0000","up_votes":1,"down_votes":0,"body":"a me  da colpi di lag con 40 di ping anche con 50 bha... non so se è per via del torneo ma fanno veramente schifo.-. non se ne può più","replies":[{"poster":"Dreadful Force","date":"2015-10-04T12:51:23.367+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=ShowterX,realm=EUW,application-id=MJVj50Jw,discussion-id=gUzl5OqZ,comment-id=003d,timestamp=2015-10-04T12:03:59.871+0000)\n>\n> a me  da colpi di lag con 40 di ping anche con 50 bha... non so se è per via del torneo ma fanno veramente schifo.-. non se ne può più\n\nse hai 40 di ping è ottimo, il torneo, non so quale intendi, ma se intendi i mondiali, sono su un server a parte, non giocano nei nostri server","replies":[{"poster":"ShowterX","date":"2015-10-04T15:51:32.375+0000","up_votes":1,"down_votes":0,"body":"capito ma comunque sia le botte di lag le da los tesso xD","replies":[]}]}]},{"poster":"Bremie","date":"2015-10-03T23:09:08.997+0000","up_votes":2,"down_votes":0,"body":"aaahhh allora non sono la sola che stava bestemmiando in Gnarrese! perfect! {{item:3151}}","replies":[]},{"poster":"I2OADHOUSE","date":"2015-10-03T23:00:13.010+0000","up_votes":2,"down_votes":0,"body":"Ragazzi è inutile lamentarsi... aspettiamo una risposta dallo staff.","replies":[]},{"poster":"Khuzare","date":"2015-10-03T22:48:47.130+0000","up_votes":2,"down_votes":0,"body":"non va niente, per sta sera non si gioca","replies":[]},{"poster":"Fragmentarius","date":"2015-10-03T22:48:30.324+0000","up_votes":2,"down_votes":0,"body":"Menomale che è un problema del server poichè pensavo fosse un mio problema :( Comunque spero si risolva presto...","replies":[]},{"poster":"Mauroid97","date":"2015-10-03T22:46:37.312+0000","up_votes":2,"down_votes":0,"body":"Dx ero in partita e nn sono riuscito piu a riconnettermi dio{{champion:45}}","replies":[]},{"poster":"Khiwon","date":"2015-10-03T22:33:41.804+0000","up_votes":2,"down_votes":0,"body":"Non posso ancora rientrare il server è completamente morto...","replies":[]},{"poster":"SpartanV00","date":"2015-10-03T22:31:20.099+0000","up_votes":2,"down_votes":0,"body":"Non ho mai avuto problemi, oggi però neanche a me si collega.\nPoi boh, vai sul server status e dicono che è tutto ok {{champion:32}}","replies":[]},{"poster":"Argnar","date":"2015-10-03T22:21:31.578+0000","up_votes":2,"down_votes":0,"body":"DDOS di sicuro.","replies":[]},{"poster":"Skeltur","date":"2015-10-03T22:20:30.368+0000","up_votes":2,"down_votes":0,"body":"secondo me è un ddos","replies":[]},{"poster":"Swamttert","date":"2015-10-03T22:29:28.360+0000","up_votes":1,"down_votes":3,"body":"Ero 4-1-6 con Yi.... Per favore non mi va di perdere partite per sti server che possono anche migliorare. Invece di spendere soldi a fare inutilissime skin, usate qualche dindino per migliorare i server.","replies":[{"poster":"Neon Flamingo","date":"2015-10-04T10:45:56.382+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Swamttert,realm=EUW,application-id=MJVj50Jw,discussion-id=gUzl5OqZ,comment-id=000d,timestamp=2015-10-03T22:29:28.360+0000)\n>\n> Ero 4-1-6 con Yi.... Per favore non mi va di perdere partite per sti server che possono anche migliorare. Invece di spendere soldi a fare inutilissime skin, usate qualche dindino per migliorare i server.\n\nCosa ti gasi? stavi usando yi...","replies":[]}]},{"poster":"9Mooxi0","date":"2015-10-05T23:21:44.884+0000","up_votes":2,"down_votes":1,"body":"Ma si continuiamo a far uscire skin e nuovi champ che ci freg ase il server crasha ogni 2 game e fa schifo il nostro obbiettivo non è far giocare il meglio possibile le persone è guadagnarci con le skin\nGG riot continua così","replies":[]},{"poster":"Spritz Aperol","date":"2015-10-04T21:47:20.924+0000","up_votes":1,"down_votes":1,"body":"Beh non so a voi ma da oggi a me va tutto a scatti.\nPing buono\nDownload buono\nUpload buono\n\nE va a scatti. E' ingiocabile così.\nSistemate sto server è diventato cancerogeno giocare oramai","replies":[{"poster":"Thorfinn1","date":"2015-10-04T21:49:40.721+0000","up_votes":2,"down_votes":1,"body":"Manca solo ricevere un ban per AFK, quando hai continuato a provare a rientrare in game e poi di nuovo stesso problema. Non oso immaginare poi per il team la noia ed il disagio.","replies":[]}]},{"poster":"Bestla","date":"2015-10-04T16:19:46.973+0000","up_votes":2,"down_votes":1,"body":"io mi sono preso na coda da 20 min solo perchè il gioco mi sconnette per tutta la partita quindi di tu","replies":[]},{"poster":"Tanko7","date":"2015-10-04T10:42:27.474+0000","up_votes":1,"down_votes":0,"body":"State tranquilli, se siamo davvero fortunati riceveremo un favoloso e utile boost Ip da 10 vittorie per aver perso un promotion game o 20 Lp, guadagneremo addirittura 1000Ip in più su 10 partite","replies":[{"poster":"Dreadful Force","date":"2015-10-04T12:50:24.660+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Tanko7,realm=EUW,application-id=MJVj50Jw,discussion-id=gUzl5OqZ,comment-id=003c,timestamp=2015-10-04T10:42:27.474+0000)\n>\n> State tranquilli, se siamo davvero fortunati riceveremo un favoloso e utile boost Ip da 10 vittorie per aver perso un promotion game o 20 Lp, guadagneremo addirittura 1000Ip in più su 10 partite\n\nnon ci sperare, l'unica volta che ho vistto un regalo dalla riot era in season 2 tipo e hanno dato un boost di vittorie, poi piu niente, perche gli costa troppo","replies":[]}]},{"poster":"Pls Buff Shen","date":"2015-10-04T07:05:10.129+0000","up_votes":2,"down_votes":1,"body":"wow, c'è molta altra gente allora? xD io ho perso Ranked e preso coda da 20 minuti per questo \"GGwp\"","replies":[]},{"poster":"yuk 2","date":"2015-10-03T23:13:32.665+0000","up_votes":2,"down_votes":1,"body":"Mi sto inca***** di brutto. Come ho scritto stavo a fare la mia promo e ovviamente me l ha data persa !!! Sto a 60 punti ora crist*!!!!  Poi la gente si lamenta della riot? FA BENE A LAMENTARSII","replies":[]},{"poster":"JoshuaWh","date":"2015-10-05T11:29:48.184+0000","up_votes":1,"down_votes":0,"body":"La cosa interessante e divertente è che tutti state sparando contro Riot per i server merdosi ma i problemi ci sono dalle ultime due patch perché il problema è lato client e non affligge tutti i pc.. Io ad esempio gioco a LoL da 3 pc completamente diversi fra loro ed ho questo tipo di problemi soltanto su uno.\n\nAnziché lamentarvi delle skin costose che non centrano nulla con i problemi di connessione o lamentarvi perché il supporto vi risponde sempre con le solite cose provate a ragionare e fate commenti più costruttivi.\nIl support vi risponde così perché sono persone istruite per rispondere così, non sono i programmatori o i server manager a leggere le segnalazioni ed a rispondere....\n\nQuindi anziché attaccarvi a sto forum a darvi del bambino a vicenda, dimostrando così di essere tutti bambini, fate una segnalazione sensata ed attendete risposta dallo staff, che ovviamente vi dirà che è stata inoltrata la segnalazione alla sede centrale, come è giusto che sia.\n\nOra attendete la prossima patch del client e non rosicate che ci sono già abbastanza rompi scatole in game...\n\nBuon LoL a tutti {{summoner:13}}","replies":[{"poster":"Dreadful Force","date":"2015-10-05T12:38:25.262+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=JoshuaWh,realm=EUW,application-id=MJVj50Jw,discussion-id=gUzl5OqZ,comment-id=0043,timestamp=2015-10-05T11:29:48.184+0000)\n>\n> La cosa interessante e divertente è che tutti state sparando contro Riot per i server merdosi ma i problemi ci sono dalle ultime due patch perché il problema è lato client e non affligge tutti i pc.. Io ad esempio gioco a LoL da 3 pc completamente diversi fra loro ed ho questo tipo di problemi soltanto su uno.\n> \n> Anziché lamentarvi delle skin costose che non centrano nulla con i problemi di connessione o lamentarvi perché il supporto vi risponde sempre con le solite cose provate a ragionare e fate commenti più costruttivi.\n> Il support vi risponde così perché sono persone istruite per rispondere così, non sono i programmatori o i server manager a leggere le segnalazioni ed a rispondere....\n> \n> Quindi anziché attaccarvi a sto forum a darvi del bambino a vicenda, dimostrando così di essere tutti bambini, fate una segnalazione sensata ed attendete risposta dallo staff, che ovviamente vi dirà che è stata inoltrata la segnalazione alla sede centrale, come è giusto che sia.\n> \n> Ora attendete la prossima patch del client e non rosicate che ci sono già abbastanza rompi scatole in game...\n> \n> Buon LoL a tutti {{summoner:13}}\n\nnon so che dirti, anche a me e ad alcuni miei amici non faceva piu loggare dopo che ci aveva sbattutto fuori da un game, ma gli altri riuscivano a giocare, poi scusa tu hai tre pc e giochi contemporaneamente con tutti e tre? allora come cappero fai a dire che i problemi li hai solo con uno, magari semplicemente quando ti è capitato di giocare su uno è andato male il server o se no va malela tua linea in quel pc, non si sa il perche o magari ancora hai un antivirus o un firewall diverso, e la riot non rende il gioco piu compatibile su antivirus e firewall e questo causa non pochi problemi.\npoi secondo te i problemi sono da le tre ultime patch, scusa ma sei un lvl 20, ma ti è permesso scrivere sui forum?\nno perche giochi da si e no un mesetto e mezzo forse e mi vieni a dire a me che gioco da season 1 che il server va male solo adesso, per tua informazione il server è gia stato cambiato nell' euw uno o due anni fa, perche andava veramente da schifo, lo hanno cambiato  e va ancora abbastanza malino, sopratutto in certi periodi, quindi tu che giochi da un mese, come cappero fai a parlare, boh non so parli come un esperto navigato su questo gioco, come se sapessi tanto e poi guardo sei lvl 20, come un bronzo 5 che dice a i plat come salire a diamond, il nonsense\n\nscusa piccola precisazione, ma come si fa a segnalare qualcosa con la certezza che venga letta?\nnon si puo, la riot ha pieno di rioter che sono li apposta per non dirti niente, o meglio per dirti le due fesserie che dicono sempre ogni volta che si ha un problema, se non ci credi prova, manda un ticket, che verra forse letto da una persona che ti silurera con le solite due boiate e ti diranno per darti il contentino ohhh grazie il tuo aiutoè molto importante abbiamo mandato una segnalazione a chi di dovere, si te lo dicono, tra il dire e il fare c'è dimezzo il mare.\ncaso strano tutto quello di cui si lamenta la gente da anni c'è ancora e tutti i ticket mandati? ma dai la secondo te, la riot ha i soldi che gli escono dalle orecchie tanto paghiamo per le skin e tutto il resto, una spesina per dare un controllino a i server e a i problemi che ha lol potrebbe anche farla e non lo fa, perche se ne sbatte della giocabilita, fa come fanno molti, pensano, perche devo offrire un servizio gratuito eccellente quando posso ofrirne uno mediocre e mettere dei dlc a pagamento, costosi, per tirare di piu a casa.\nnon gli servirebbe neanche tanto secondo me, rispetto quello che guadagna, per fare due ritocchi, il fatto che non si sa neanche se fanno quei due ritocchi, pero puntualmente ogni patch escono skin o croma pack, che vorrei sottolineare, che i croma pack sarebbero dovuti essere gratis e sbloccabili con la maestria su un champ","replies":[{"poster":"JoshuaWh","date":"2015-10-05T15:15:24.275+0000","up_votes":1,"down_votes":0,"body":"Ma rispondi così a tutti i commenti?\nSarò anche al livello 20 ma per tua informazione mi sono iscritto un paio di anni fa ed ho smesso di giocare per motivi miei ed ho ripreso da circa 15 giorni.\n\nVisto che sai così tante cose sai cosa vuol dire mantenere un gioco del genere? Sai cosa vuol dire gestire dei server?\nHo già avuto a che fare con il supporto Riot e con i ticket e mi hanno risposto gentilmente e con le informazioni che mi servivano.\n\nFra le tante cose che sai su di me non sai che sono un programmatore, che so quel che dico e che ho l'idea di come si sviluppa un software di gioco sia lato server che lato client e che le supposizioni che faccio sono basate sulla mia esperienza di programmazione che al contrario della tua è più valida visto che \"sei un player dalla season 1\" e da allora a quanto pare non hai saputo imparare altro che come lamentarti.\n\nNon ti va bene che a me al livello 20 mi è permesso scrivere in forum? A me non va bene che al mondo esista gente ignorante, pretenziosa ed ottusa come te.\n\nTi lamenti dei soldi che guadagna la Riot ma sai a cosa serve un'azienda? A generare profitto. Nessuno apre un'azienda per regalare cose, altrimenti tutti aprirebbero le no-profit e tutti lavorerebbero per la gloria.\n\nLa gestione e lo sviluppo delle skin non c'entra un emerito niente con la gestione e lo sviluppo del server e del client.\n\nE no, non gioco con tutti e 3 i pc contemporaneamente ma come hai capito che uso 3 connessioni differenti? Hai la palla di vetro?\nPer darti tutte le informazioni: no, non gioco sempre da connessioni differenti e so che il problema è del client perché ho analizzato il comportamento del client anche su altri due miei compagni di gioco, uno su Windows ed uno su Mac.\nA quest'ultimo da più problemi rispetto a me e questo mi fa capire, in quanto in grado di analizzare la questione, che il problema è più evidente su client Mac che su Windows.\n\nAncora dubbi che sia colpa del server?\n\nPerché allora non crasha a tutti? Se il server non è in grado di reggere le richieste butta fuori tutti e non solo uno  o due player alla volta perché va in tilt l'intera partita ed in base a come sono gestite le partite potrebbero saltare più partite contemporaneamente.\n\nOggi tra l'altro ho fatto qualche ricerca su bot e programmi simili per LoL ed ho trovato un programma molto interessante che permette al giocatore che lo utilizza di far saltare l'intera partita così da farla annullare e non contarla come persa. Non ho provato se funziona o no perché non è nel mio interesse sporcare il mio account con questi programmi stupidi ma se funzionasse davvero vuol dire che la partita può saltare anche per colpa di uno specifico player non per colpa della Riot (questo programma è scaricabile gratuitamente ed utilizzabile da tutti)\n\nVuoi altre delucidazioni? Basta chiedere.","replies":[]}]}]}]}