{"poster":"Maxosaurio","date":"2016-04-04T03:08:43.121+0000","title":"Qué pasó con Jhin??","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"Hola :) Hace mucho no escrib&iacute;a en el foro. De hecho, no hab&iacute;a entrado a la p&aacute;gina de LoL. Resulta que estrena la secci&oacute;n de campeones y vi que a&uacute;n sigue las animaciones del icono y los v&iacute;deos de Vi, Garen, Zed y Sona. \r\n\r\nHe escuchado dos cosas pero muy peque&ntilde;as, una era que Jhin ten&iacute;a una mala relaci&oacute;n con Zed (No s&eacute; cu&aacute;l es) y que tambi&eacute;n, al hacer re&iacute;r o bailar a Jhin, dispara de casualidad 4 tiros, ya sea Top, Jg, Mid y Bot...\r\n\r\nEstar&iacute;a agradecido si me pueden aclarar este tema, de cu&aacute;l es la relaci&oacute;n de Jhin con estos cuatro campeones &lt;3","replies":[{"poster":"skysoul fenrir","date":"2016-04-04T06:09:30.259+0000","up_votes":1,"down_votes":0,"body":"simple, jhin mato a estos campeones, pero ojo, en la historia nada mas, en el juego estos siempre seguiran igual","replies":[]},{"poster":"Kyousuke","date":"2016-04-04T05:52:48.295+0000","up_votes":1,"down_votes":0,"body":"usa el 4 por que es su numero favorito y en japones (guiño al estreno del servidor japones) el 4 tiene la misma pronunciación que muerte \"shi\" \nsobre vi sona y garen no tiene nada \"personal\" como para matarlos, con el único que tiene un \"rencor\" es con {{champion:238}}  por haber arruinado su venganza, jhin quería matar al padre de shen por que lo mando a la cárcel y jhin quería salir para vengarse de el pero se encontró con que zed lo mato y por eso lo tiene en el punto de mira","replies":[]},{"poster":"Pablove90","date":"2016-04-04T03:19:38.587+0000","up_votes":1,"down_votes":0,"body":"es la logica de riot mai frien","replies":[]},{"poster":"Vi Sexual","date":"2016-04-04T03:14:12.450+0000","up_votes":1,"down_votes":0,"body":"Nada, simplemente usaron a los 4 campeones para mostrar sus habilidades en la presentacion de campeones, y segun Riot, por el momento, se eligieron esos 4 campeones nada mas porque son \"a los que Jhin les gustaria matar\". Yo lo unico que no entiendo, es porque Jhin tiene interacciones con Sona , Garen y Zed (siendo este ultimo logico porque comparten lore) pero no menciona en ningun lugar a mi  {{champion:254}} . \nHay rumores de que va a haber un evento/actualizacon de Piltover, donde se veran algunas interacciones de Jhin con los personajes de esta ciudad, pero nada demasiado confirmado por ahora. Asi que a esperar.","replies":[]}]}