{"poster":"G4T0","date":"2017-07-02T22:51:34.785+0000","title":"Al sistema de honor le falta algo importantísimo.","subforum":"Charlas Generales","up_votes":61,"down_votes":5,"body":"No creen que deber&iacute;a de haber una barra progresiva para saber cuanto nos falta para subir al siguiente nivel de honor? ya he visto a muchos perdidos porque aun no se sabe siquiera si alguien a subido de nivel en este sistema...","replies":[{"poster":"Lucrexio","date":"2017-07-03T06:44:06.699+0000","up_votes":8,"down_votes":7,"body":"Yo lo que creo es que tendrían que sacar ese botón de \"no votar\", osea, te carreas al equipo entero y nadie te da honor porque se la sudan, #FeelsBadMan, con lo mal agradecida que es la gente.","replies":[{"poster":"Nuke","date":"2017-07-03T17:38:14.195+0000","up_votes":7,"down_votes":1,"body":"Bueno, jamas vi alguien quejarse porque no le dan honores, porque cada uno tiene su opinion. Por ejemplo yo, me da igual si carrea o no, que sea buen compañero y planifique en equipo si es algo que honorar: Cada uno gasta los honores como quiere. Pienso que es algo patetico, ademas de tener que esperar 1 minuto para saltear en una partida donde todo tu team era flammer es algo estresante. \n\nPor ejemplo, la otra vez un Yasuo increiblemente toxico se llevo 3 honores de su team por el simple hecho de carrear. ¿Nada raro?","replies":[{"poster":"Awau","date":"2017-07-04T03:19:15.121+0000","up_votes":1,"down_votes":0,"body":"Yo en una partida en Aram con Fiora, un Blitzcrank se enojó conmigo y me flammeo por /all toda la partida por el simple hecho de que le cancelaba las Q con mi W, y al final de la partida recibió 4 honores de su Equipo... triste.","replies":[{"poster":"Nuke","date":"2017-07-04T18:07:17.265+0000","up_votes":2,"down_votes":0,"body":"Me duele con tan solo leerlo.","replies":[]}]},{"poster":"Lucrexio","date":"2017-07-03T23:45:50.875+0000","up_votes":2,"down_votes":0,"body":"Claramente lo de los honores es un tema, porque ahora te dan beneficios que valen la pena (llaves, marco, etc.), antes yo me acuerdo que tenía ese listón verde a comienzos de mis niveles 20 por ahi, y luego desapareció de la nada, una porquería. Sacaron eso de las maestrías, también, lo único que favorecía era el tilteo cuando jugabas contra un OTP despreciable. \nQue ahora comiencen con esto de los honores me parece bien, pero ya que tranquilamente te la sude ganar una partida, y que NADIE reciba honores, es de g4rca, y por algo pusieron 3 honores distintos, buen comportamiento y buen liderazgo/estrategia, un jugador que carrea y se pone al hombro al equipo es para darle honor, eso si, si putea obviamente le mando report XD.\n\nComo dije en otro comentario, quizá podrían dejar esa opción cuando el equipo pierde, y que puedas omitirlo, pero si el equipo gana, alguien tiene que llevarse el MVP, es como el fútbol, es decir, si el equipo gana, alguien metió el gol, no se ganó de casualidad.","replies":[]},{"poster":"Nísta","date":"2017-07-03T23:07:34.647+0000","up_votes":2,"down_votes":0,"body":"Lo reportas y baja de nivel :v","replies":[{"poster":"Nuke","date":"2017-07-04T18:08:27.006+0000","up_votes":1,"down_votes":0,"body":"https://k61.kn3.net/taringa/9/A/3/8/9/4/Moodcool/817.gif\n\n###### PEEERO creo que para que baje necesita una sancion, un castigo... No solo un Report.\n\n¡Un saludo!","replies":[]}]},{"poster":"Krámatos","date":"2017-07-04T14:55:39.106+0000","up_votes":1,"down_votes":0,"body":"No deberia ser que \"cada uno gaste los honores como quiere\" si hubiese un minimo de criterio. Hay match en donde realmente dejo una increíble dedicación para ayudar a ganar, sin usar el chat, y no recibo ni un \"ty\". Y","replies":[{"poster":"Nuke","date":"2017-07-04T18:06:27.006+0000","up_votes":1,"down_votes":0,"body":"Bueno, la gente con sus honores. A mi tambien me ha pasado, pero no les puedo decir nada, asi como a mi no me pueden decir nada tampoco si no doy honores a una persona X a la cual vos no estarias deacuerdo que lo meresca.\n\n¡Un saludo!","replies":[]}]}]},{"poster":"Yunox","date":"2017-07-03T18:48:02.843+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=ikkOma,realm=LAS,application-id=v7qsfXsE,discussion-id=pLR6QEtj,comment-id=0005,timestamp=2017-07-03T06:44:06.699+0000)\n>\n> Yo lo que creo es que tendrían que sacar ese botón de &quot;no votar&quot;, osea, te carreas al equipo entero y nadie te da honor porque se la sudan, #FeelsBadMan, con lo mal agradecida que es la gente.\n\nEn realidad está bien el botón de \"No votar\". Imaginate estás en una partida donde jugás solo y te toca con 4 premades más que te flamean durante todo el juego y te lo arruinan, es injusto tener que darle honor a alguno siendo que los 4 te flamearon, o los 4 trolearon y/o arruinaron la partida.","replies":[{"poster":"Lucrexio","date":"2017-07-03T23:39:07.106+0000","up_votes":1,"down_votes":0,"body":"En todo caso, podrían restringirlo a que si el equipo pierde que no sea necesario votar honores, pero si el equipo gana es por alguien, osea, si encima yo o alguien se pone el equipo al hombro y lleva a los 4 a ganar la partida, que no le den siquiera un gracias me parece de mal agradecido (incluso con el viejo sistema de honores al que veia carreando le daba honor), ni hablar las personas que son carreadas y ponen \"izi\", ya a esos los reporto por  tarados, incluso si están en mi equipo.","replies":[]}]},{"poster":"Akari Kuro","date":"2017-07-04T03:28:56.995+0000","up_votes":1,"down_votes":0,"body":"si hay un boton de no votar; abajo de reloj, es una fecha negra\n\nla tocas y no votas, asi de simple","replies":[]},{"poster":"El Nabu","date":"2017-07-04T03:04:23.456+0000","up_votes":1,"down_votes":0,"body":"A veces pasa que hay uno que  termina carreando nomás por existir. Es tanta la ventaja de objetos y los enemigos estan tan tilteados que termina peleando cualquier pelea aunque este solo o no sea buena idea y se lleva a dos consigo. Por más que digas que hace la diferencia y esta carreando solo busca ver cuantas kills se lleva sin hacer jugadas productivas. Termina siendo más merito del otro equipo que suyo. En ese caso no doy honor aunque haya salido 20/5/10 y haya hecho diferencia (a menos que sea muy simpático, ahí le doy amigable).","replies":[]},{"poster":"Mascheranox","date":"2017-07-03T18:19:30.370+0000","up_votes":1,"down_votes":0,"body":"a menos que esa partida aya sido muy mala y nadie lo meresca","replies":[]},{"poster":"LucasG92","date":"2017-07-03T14:28:27.602+0000","up_votes":1,"down_votes":0,"body":"Rt","replies":[]},{"poster":"Rengor","date":"2017-07-03T17:32:48.445+0000","up_votes":1,"down_votes":3,"body":"no solamente eso, la gente no vota y no quiere votar, no se dan cuenta que se perjudican ellos y a todo el team","replies":[]}]},{"poster":"JuanJT","date":"2017-07-03T03:52:24.732+0000","up_votes":1,"down_votes":3,"body":"***","replies":[{"poster":"Zxd","date":"2017-07-03T04:12:03.365+0000","up_votes":2,"down_votes":0,"body":"denuncia2","replies":[{"poster":"prokillqueso","date":"2017-07-03T23:32:29.770+0000","up_votes":1,"down_votes":0,"body":"Que decía?, x2","replies":[{"poster":"Zxd","date":"2017-07-07T20:03:16.475+0000","up_votes":1,"down_votes":0,"body":"era un link falso","replies":[]}]},{"poster":"RodrigoG","date":"2017-07-03T13:45:37.729+0000","up_votes":1,"down_votes":0,"body":"que decia?","replies":[]},{"poster":"Trisepsual","date":"2017-07-03T04:15:18.030+0000","up_votes":1,"down_votes":0,"body":"por haber abierto el link ya cagué? D:...no me fije y llegue y lo abri -.-","replies":[]}]}]},{"poster":"Im a BanditØ","date":"2017-07-03T03:16:46.677+0000","up_votes":2,"down_votes":0,"body":"En realidad explicaron esto, lo hicieron asi para que no sea una \"competencia\" por ver quien tiene mas honor que el otro","replies":[]},{"poster":"LalaPopo","date":"2017-07-02T23:21:10.882+0000","up_votes":2,"down_votes":6,"body":"creo que esta bien asi eso mejora la comunidad \n\nte pongo como ejemplo llevo 98% de honores , me toca alguien lo flameo , me reportan pierdo honor total faltando tan poco me daria lo mismo (pensamiento de \"gente\") lo recupero la proxima partida y asi puede llevar una eteridad hasta que antes del fin de temporada donde se dan los premios la gente saca el promedio de cuantos honores puede ganar y asi sacar los premios , se prestaria para mal entendidos a mi parecer\n\nPD: entienda xd","replies":[{"poster":"Sherpard","date":"2017-07-03T02:46:13.966+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=LalaPopo,realm=LAS,application-id=v7qsfXsE,discussion-id=pLR6QEtj,comment-id=0001,timestamp=2017-07-02T23:21:10.882+0000)\n>\n> creo que esta bien asi eso mejora la comunidad \n> \n> te pongo como ejemplo llevo 98% de honores , me toca alguien lo flameo , me reportan pierdo honor total faltando tan poco me daria lo mismo (pensamiento de &quot;gente&quot;) lo recupero la proxima partida y asi puede llevar una eteridad hasta que antes del fin de temporada donde se dan los premios la gente saca el promedio de cuantos honores puede ganar y asi sacar los premios , se prestaria para mal entendidos a mi parecer\n> \n> PD: entienda xd\n\nNo tiene sentido lo que planteas. Es mas, si la gente supiera cuanto le falta para subir de nivel, con mas buena onda estaria. Lo mismo se aplica para el otro extremo, cuando estas por bajar se supondria (aunque sabiendo que bajando su nivel del sistema de honor dudo que cambie) que entraria con buena onda para recibir honor y no bajar.\n\nLo de sacar el promedio para saber si llega a fin de season para sacar un premio no tiene logica, para que el nivel de honor aumente alguien te tiene que dar ese punto, no se farmea como el pi ni nada de eso, alguien tuvo que decidir si darte el punto a vos o por ejemplo a alguien que carreo la partida.","replies":[{"poster":"prokillqueso","date":"2017-07-03T23:37:44.360+0000","up_votes":1,"down_votes":0,"body":"Bajar tu \"honor\" no es algo gradual, se te bajaría el honor de tiro con una penalización de Riot por si acaso.","replies":[{"poster":"Sherpard","date":"2017-07-04T20:33:48.225+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=prokillqueso,realm=LAS,application-id=v7qsfXsE,discussion-id=pLR6QEtj,comment-id=000100000000,timestamp=2017-07-03T23:37:44.360+0000)\n>\n> Bajar tu &quot;honor&quot; no es algo gradual, se te bajaría el honor de tiro con una penalización de Riot por si acaso.\n\nSi, pero eso no esta contemplado en lo que estabamos hablando anteriormente.\n\nAdemas depende del ban, no es lo mismo un ban en la cola de baja prioridad que un ban por 7 dias, quiero presuponer que cada sistema baja de distinta manera el elo.\n\nTambien hay que contemplar que capaz con un reporte ya baje y de ahi se decida (si es verdadero el reporte y justificado) descenderle un nivel o X cantidad de honor.","replies":[]}]}]}]},{"poster":"serfar","date":"2017-07-03T23:45:29.994+0000","up_votes":1,"down_votes":0,"body":"a mi este sistema me gusta pero hay q pulirlo bastante como toda cosa nueva.. ejemplo me da q se le da mucho honor a los carreadores y poco a un buen supp (sacar honor con supps es casi imposible en estas epocas)  o gente q hizo objetivos o ayudo mucho o puso buena onda!\n\nsegundo se deberia dar honor a 1 o 2 personas... y en premades es un simple codigo q todos los premades solo puedan dar 1 honor y listo nada de 5 premades y todos honor con todos...\n\ntercerdo deberia ir mas de la mano con los reportes q se note mas.... si reportas le baja honor etc pero q se vea en la pantalla de finalizacion de la partida los jugadores con honor y deshonor(reprtados)","replies":[{"poster":"Kyo Hatori","date":"2017-07-04T17:52:08.016+0000","up_votes":1,"down_votes":0,"body":"Es cierto, los supps y los jg son los roles más castigados, siempre lo supimos. Los que mainean esos roles deben hacerse a la idea de no recibir honor jaja.\n\nFelices Pesadillas ≧◠ᴥ◠≦","replies":[]}]},{"poster":"SJ Angelo","date":"2017-07-03T23:59:57.823+0000","up_votes":1,"down_votes":0,"body":"Hijacking the top comment (but will probably get buried anyway). There are a few reasons why we intentionally did not include any sort of progress indicators:\n1.) As to your point, we didn't want to focus the system on the \"grind\". We want your honor level to improve over the course of the season as you play sportsmanlike games. Giving you a number to anchor on would shift the focus away from just playing good games.\n2.) We holistically evaluate behavior over time behind the scenes using some pretty crazy algorithms to determine when a player levels up. It doesn't work super well as a progress indicator that we show to a player, and if we did, it would probably be more confusing than helpful.\n3.) We wanted a few discrete levels that have enough space to be meaningful, but over the course of a season, if you had a progress indicator, you might feel that you were making so little progress per game that seeing the progress could actually feel bad. We could inflate the number of levels to counteract this, but that felt really unnecessary.\nHopefully that clarifies it a bit!\n\n\n\n\nHijacking el comentario superior (pero probablemente se enterrará de todos modos). Hay algunas razones por las que intencionalmente no incluimos ningún tipo de indicadores de progreso:\n1.) En cuanto a su punto, no queríamos enfocar el sistema en el \"grind\". Queremos que su nivel de honor mejore en el transcurso de la temporada al jugar juegos deportivos. Darle un número para anclar encendido cambiaría el foco lejos apenas de jugar buenos juegos.\n2.) Evaluamos de forma holística el comportamiento en el tiempo detrás de las escenas usando algunos algoritmos bastante locos para determinar cuándo un jugador sube. No funciona muy bien como un indicador de progreso que mostramos a un jugador, y si lo hicimos, probablemente sería más confuso que útil.\n3.) Queríamos unos niveles discretos que tienen suficiente espacio para ser significativo, pero en el transcurso de una temporada, si tuviera un indicador de progreso, podría sentir que estaba haciendo tan poco progreso por juego que ver el progreso podría en realidad sentirse mal. Podríamos inflar el número de niveles para contrarrestar esto, pero eso se sentía realmente innecesario.\nEspero que eso lo aclare un poco!","replies":[]},{"poster":"SJ Angelo","date":"2017-07-03T17:07:56.126+0000","up_votes":1,"down_votes":0,"body":"en rediit puso un rioter por que no lo van a poner. Ni hoy, ni jamas.","replies":[{"poster":"prokillqueso","date":"2017-07-03T23:33:03.596+0000","up_votes":1,"down_votes":0,"body":"HABLA MEN  xd","replies":[]}]},{"poster":"SJ Angelo","date":"2017-07-03T17:01:58.839+0000","up_votes":1,"down_votes":0,"body":"en rediit puso un rioter por que no lo van a poner. Ni hoy, ni jamas.","replies":[]},{"poster":"Dooby Dooby","date":"2017-07-03T14:16:12.119+0000","up_votes":1,"down_votes":0,"body":"No es algo importantisimo y ya lo explicaron antes. No le agregaron una barra de nivel para que no se convierta como en una competencia de jugar solo para subir honor","replies":[]},{"poster":"davichost","date":"2017-07-03T00:52:02.638+0000","up_votes":1,"down_votes":0,"body":"sip","replies":[]},{"poster":"Ks Erwyn","date":"2017-07-02T22:56:17.444+0000","up_votes":2,"down_votes":16,"body":"Si pero, pero por que razón? o propósito? ahora hay mucho hype pero el honor o ser honorable debe nacer de uno mismo no por intereses, dar una barra de progresión seria mas perjudicial que bueno, pero conociendo a RITO y lo mal que hace las cosas, sobretodo cuando escucha a sus palurdos, probablemente lo implementen...","replies":[{"poster":"HipoMania ","date":"2017-07-03T01:54:54.346+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Ks Erwyn,realm=LAS,application-id=v7qsfXsE,discussion-id=pLR6QEtj,comment-id=0000,timestamp=2017-07-02T22:56:17.444+0000)\n>\n> Si pero, pero por que razón? o propósito? ahora hay mucho hype pero el honor o ser honorable debe nacer de uno mismo no por intereses, dar una barra de progresión seria mas perjudicial que bueno, pero conociendo a RITO y lo mal que hace las cosas, sobretodo cuando escucha a sus palurdos, probablemente lo implementen...\n\nCreo que para eso cambiaron el sistema xd, Para los intereses, Recompensas a la gente si se porta bien, Se portan bien consiguen su premio, No lo hacen y pierden sus premios, \"Castigo y recompensa\" xd, ¿No es algo logico?","replies":[]}]}]}