{"poster":"Sion Greyjoy","date":"2018-10-27T08:28:16.951+0000","title":"Zurück nach langer langer inaktiver Zeit, nach Login erscheint \"Permanently Banned\"","subforum":"Spielerverhalten & Moderation","up_votes":7,"down_votes":7,"body":"Hallo liebe Community / Moderatoren,\r\n\r\nnach einer gef&uuml;hlten Ewigkeit (gef&uuml;hlt ca. 2-3 Jahre) habe ich mal wieder das Spiel geladen und musste erstmal ein neues Passwort anfordern.\r\nNach dem Login musste ich dann leider feststellen, dass ein Perma-Ban auf mich wartet... Die Chatlogs zeigen einen englischsprachigen Verlauf mit vielen rassistischen Kommentaren.\r\nVermutlich hatte jemand irgendwann meinen Account &uuml;bernommen und das Passwort ge&auml;ndert.\r\n\r\nWie l&auml;uft das in so einem Fall, ich w&uuml;rde gerne wieder meinen alten Account nutzen ?\r\n\r\n\r\nVielen Dank vorab den Mods !","replies":[{"poster":"Rena","date":"2018-10-27T09:10:24.569+0000","up_votes":6,"down_votes":1,"body":"Schreib den Riot Support an\n\nhttps://support.riotgames.com/hc/de\n\nbin mir 99% sicher wenn du die Wahrheit sagst, dass du entbannt wirst.","replies":[{"poster":"Sion Greyjoy","date":"2018-10-27T09:27:18.931+0000","up_votes":3,"down_votes":2,"body":"Danke, habe ich gemacht :-)","replies":[{"poster":"Izaya Kumiho","date":"2018-10-27T16:45:38.871+0000","up_votes":4,"down_votes":4,"body":"> [{quoted}](name=Ructo der Blaue,realm=EUW,application-id=KYnfKGf0,discussion-id=r9HMqaAB,comment-id=00010000,timestamp=2018-10-27T09:27:18.931+0000)\n>\n> Danke, habe ich gemacht :-)\n\nDas was dir Rena sagte, stimmt leider nicht. Wenn du wirklich deinen Account verloren haben solltest, dann wird dir trotzdem die Schuld angerechnet.\n\n>**Ich war’s nicht! Könnt ihr nicht etwas dagegen unternehmen?**\nDenk daran, dass du für alle Aktivitäten auf deinem Konto die volle Verantwortung trägst, und sollten Sperren und Banne erfolgt sein, können wir diese nicht abändern. \n\nhttps://support.riotgames.com/hc/de/articles/201898070-Mein-Konto-wurde-gesperrt","replies":[{"poster":"EasternMountain","date":"2018-10-27T18:08:31.230+0000","up_votes":4,"down_votes":1,"body":"***","replies":[{"poster":"Wernicke","date":"2018-10-29T12:09:54.095+0000","up_votes":2,"down_votes":0,"body":"Nur das 99% die Bezeichnung hack falsch verwenden.\nIn den meisten Fällen sind die Opfer einfach auf phishing mails usw reingefallen und haben damit selber Schuld und das ganze hat rein gar nichts mit nem klassischen hack zu tun. \n\n> wenn mein Account ohne mein Verschulden gehackt wird.\n\nGenau das stimmt damit eben meistens nicht.","replies":[]}]},{"poster":"Lotuskobra","date":"2018-10-27T16:51:27.977+0000","up_votes":3,"down_votes":1,"body":"Die Regeln sind an dieser Stelle das eine, die Realität eine andere. Riot ist, wenn es eindeutige Indizien gibt, dass der Account wirklich fremd genutzt wurde (IP, etc.) ziemlich kulant. Schlussendlich sind sie ein Dienstleister und haben ein großes Interesse daran, die Spielerschaft, die sich an für sich korrekt verhält nicht zu verprellen.\n\nEs gab auch etliche prominente Fälle (NoWay4u zB.), die gehackt wurden und innerhalb kürzester Zeit Hilfe vom Support bekommen haben. Klar sollte man anhand der Regeln nicht unbedingt erwarten, dass man alles wieder bekommt und das sollte unser TE auch nicht, aber er sollte es auf jeden Fall versuchen, gerade weil die Erfahrung zeigt, dass der Support wirklich freundlich und hilfsbereit reagiert, wenn man einfach nett fragt und sich nichts hat zu Schulden kommen lassen.\n\nAber das man nicht von 99% ausgehen sollte, da stimme ich vollkommen mit dir überein!","replies":[]}]}]}]},{"poster":"Sion Greyjoy","date":"2018-11-02T16:20:52.592+0000","up_votes":3,"down_votes":0,"body":"Update: Habe dank der freundlichen Support Mitarbeiter meinen Account wieder zurückbekommen :-)","replies":[{"poster":"Angel Ayume","date":"2018-11-08T21:04:30.003+0000","up_votes":4,"down_votes":0,"body":"Das freut mich sehr. :) \nSchön, dass ich unrecht hatte. {{sticker:slayer-jinx-catface}}","replies":[]},{"poster":"Sirrkas","date":"2018-11-08T20:25:34.911+0000","up_votes":3,"down_votes":0,"body":"Dann dir viel Vergnügen mit deinem Account.","replies":[]},{"poster":"Lotuskobra","date":"2018-11-21T11:01:08.572+0000","up_votes":2,"down_votes":0,"body":"Schön zu lesen, dass es geklappt hat, viel Spaß :)","replies":[]}]},{"poster":"Angel Ayume","date":"2018-10-27T08:50:24.218+0000","up_votes":5,"down_votes":9,"body":"Zurecht gebannte Accounts werden nicht entbannt.\nTut mir leid, dass ich dir keine besseren Nachrichten geben kann. :(","replies":[{"poster":"VentusKing","date":"2018-10-27T13:18:24.618+0000","up_votes":3,"down_votes":9,"body":"> [{quoted}](name=Angel Ayume,realm=EUW,application-id=KYnfKGf0,discussion-id=r9HMqaAB,comment-id=0000,timestamp=2018-10-27T08:50:24.218+0000)\n>\n> Zurecht gebannte Accounts werden nicht entbannt.\n> Tut mir leid, dass ich dir keine besseren Nachrichten geben kann. :(\n\nDas ist mit Abstand das dümmste was ich heute jemals gelesen hab. Wie kann ein Account zurecht gebannt sein wenn er gehackt wurde nachdem man 2/3 Jahre nicht drauf gespielt hat? Zu tracken ob die Games auf seiner oder ner anderen IP waren ist mit abstand noch das leichteste für den Support also kannst du hier von nichts reden das es auf irgendeine Art und Weise zu recht geschehen ist. Wenn jemand deinen Acc hackt und du ne Perm ban nachricht bekommst, dann wurdest du deiner Meinung nach also zurecht gebannt?","replies":[{"poster":"Angel Ayume","date":"2018-10-27T13:34:27.045+0000","up_votes":4,"down_votes":3,"body":"Es wird der Account gebannt und nicht ich. Der Account gehört mir nicht. Ich habe von Riot nur die Erlaubnis diesen Account zu nutzen, aber auch nur ich darf ihn nutzen, niemand sonst. \nWurde also Schund auf diesem Account betrieben und er wird dafür gebannt, wurde der Account gebannt und nicht ich. Dass man das kacke findet werd ich nicht bestreiten, wäre ich betroffen würde ich mich auch drüber aufregen. \nAber dem TE hier falsche Hoffnungen zu machen wäre nicht fair.\n\nEr kann natürlich gerne versuchen den Supp anzuschreiben und darauf hoffen, dass sie Nachsicht haben und den Account entbannen. Aber da zweifel ich sehr stark dran. \nEs ist nun mal an dem Ersteller des Accounts, das er auf seine Login-Daten aufpasst und kein anderer Zugriff darauf erlangt.","replies":[{"poster":"VentusKing","date":"2018-10-27T13:39:36.432+0000","up_votes":2,"down_votes":3,"body":"> [{quoted}](name=Angel Ayume,realm=EUW,application-id=KYnfKGf0,discussion-id=r9HMqaAB,comment-id=000000010000,timestamp=2018-10-27T13:34:27.045+0000)\n\n> Es ist nun mal an dem Ersteller des Accounts, das er auf seine Login-Daten aufpasst und kein anderer Zugriff darauf erlangt.\n\nAlso war es die Schuld jeglicher Sony Playstation Besitzer als eine Hacker Gruppe sich die Daten von fast 400000 PSN Benutzern geholt hat, weil sie nicht richtig auf ihre Login Daten aufgepasst haben? Da muss ich einfach straight mal bs callen es gibt genug Leute die wenn sie an deinen LoL Account wollen, auch ran kommen ohne sich wirklich n Finger dafür krumm zu machen, Wenn du deine Daten an ne Riot FREE RP Seite gibst hast du eigenschuld aber du kannst nicht sagen das du Schuld hast wenn jetzt ein sehr fortgeschrittener Hacker kommt und sich Zugriff auf deinen Account verschafft.","replies":[{"poster":"Angel Ayume","date":"2018-10-27T13:46:11.106+0000","up_votes":3,"down_votes":1,"body":"Ziemlich unwahrscheinlich, dass der TE Opfer einer Hackergruppe geworden ist, dann haben sie n paar Games gemacht und darin so schlimm geflamed, dass der Acc gebannt wurde. Japp, sehr logisch. Das haben Hackergruppen auch vor. Erst die Mühe machen die Accs zu hacken und dann die Accs bannen lassen... ^^\n\nABER, mit dir diskutiere ich nicht weiter. In deinen Augen erzähle ich eh nur Quatsch und alles was du sagst ist mehr als logisch. Also lassen wir das doch einfach und du hörst auf auf meine Kommentare zu antworten, okay?","replies":[{"poster":"VentusKing","date":"2018-10-27T14:19:31.749+0000","up_votes":2,"down_votes":4,"body":"Es muss keine Hacker Gruppe sein, es gibt genug einzelne Hacker die dieses tun, entweder um accounts zu verkaufen oder um sich einen spaß daraus zu machen anderen Leuten das Spiel zu ruinieren zu sagen das es unwahrscheinlich ist stimmt zwar aber es kann sein das er zu den wenigen Leuten gehört denen das passiert ist das darf man nicht ausschließen. Ich habe mich auch schonmal per YouTube mit dem Prozess dahinter befasst und das ist nichtmal wirklich ein aufwand die haben ein Programm das innerhalb kurzer Zeit jegliche Passwort Möglichkeiten und Kombinationen durchgeht. Und manchmal können Menschen auch nicht selbst dafür das ihre Passwörter in andere Hände gerät, Ich wähle jetzt Bewusst ein eher unwarscheinliches Fallbeispiel aber naja. Angenommen jemand hat eine Krankheit die verhindert das er sich Dinge leicht merken kann wie z.B. Demenz, ich weiß es ist unwarscheinlich aber es ist ihnen nicht verboten League zu spielen da dies diskriminierung wäre, angenommen dieser ist auf eine Pflegeperson angewiesen die sich für ihn das Passwort und den Nutzernamen merken muss weil er dieses nicht kann und es kommt zu einem Fall wo die Pflegeperson sich zugriff auf den Account verschaft und er dadurch gesperrt wird, wer ist schuld? Er kann ja nichts dafür das er es sich nicht merken kann und musste deshalb seiner Pflegeperson vertrauen und die hat misst gebaut kann man immernoch davon reden das er selbst schuld ist? Und wäre ihn den Account nicht zurückzugeben und ihm zu sagen er hat Pech wenn seine Pflege sowas macht, nicht auch diskriminierung gegenüber seiner Krankheit? Kann man deshalb wirklich davon reden das jeder selbst auch sein Passwort zu achten hat? Liegt es nicht eher an Riot uns mehrere Möglichkeiten zu geben unseren Account zu schützen? (Kp ob es 2 Faktor authentifizierung schon gibt)","replies":[{"poster":"Bettnachleger","date":"2018-10-29T13:22:31.812+0000","up_votes":2,"down_votes":0,"body":"> Er kann ja nichts dafür das er es sich nicht merken kann und musste deshalb seiner Pflegeperson vertrauen und die hat misst gebaut kann man immernoch davon reden das er selbst schuld ist? \n\nUnd wenn ich als blinder Auto fahre und dabei jemanden umfahre, ist das dann wirklich meine Schuld? \nIch meine, ich habe eine Behinderung und weiss das ich so nicht autofahren sollte, ich tue es aber trotzdem und es passiert das, was nicht passieren sollte, und was auch der Grund dafuer ist, das ich kein Auto fahren soll.\nhmmmm.\n\nP.s.:\nEr kann sich das Passwort auch aufschreiben?!\nUnd es gibt halt nur ein paar wenige Regeln, denen du folgen musst, um das Spiel spielen zu duerfen.\nWenn du dazu nicht in der Lage bist (Gesundheitsbedingt oder warum auch immer), dann ist das Spiel eben nichts fuer dich.","replies":[{"poster":"VentusKing","date":"2018-10-29T14:05:51.632+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Bettnachleger,realm=EUW,application-id=KYnfKGf0,discussion-id=r9HMqaAB,comment-id=0000000100000000000000000001,timestamp=2018-10-29T13:22:31.812+0000)\n\n> P.s.:\n> Er kann sich das Passwort auch aufschreiben?!\n> Und es gibt halt nur ein paar wenige Regeln, denen du folgen musst, um das Spiel spielen zu duerfen.\n> Wenn du dazu nicht in der Lage bist (Gesundheitsbedingt oder warum auch immer), dann ist das Spiel eben nichts fuer dich.\n\nDu merkst schon wie diskriminierend diese Aussage grade war oder? Jemand mit starkem Gedächtnisverlust der schon eine Pflegeperson braucht kann sich nicht mal eben was aufschreiben der wird das warscheinlich nach 5 Minuten vergessen haben das er sich überhaupt etwas aufgeschrieben hat nur um diese Aussage mal zu entkräften. Dazu kannst du nicht sagen das jemand nur weil er es Gesundheitlich nicht schafft sich an etwas zu halten ein absolutes Spielverbot für League besitzt. Riot kann niemanden verbieten dieses Spiel zu spielen nur weil eine Geistige Einschränkung besteht ansonnsten würden sie sich strafbar machen. Angenommen es würde nen Tourret Kranken geben der sich durch seine Krankheit dazu beeinflusst fühlt im Spielchat schreiben zu müssen, und er fragt den Riot Support ob sie für seinen Account den Chat deaktiviert haben kann weil er diese Krankheit besitzt und Riot würde sagen: Ne geh mal weg mit deiner Gesundheitlichen störung machen wir nicht, dann könnte der die auf sehr hohe Summen verklagen weil genau das diskriminierendes Verhalten ist.","replies":[{"poster":"Angel Ayume","date":"2018-10-29T14:21:05.323+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=VentusKing,realm=EUW,application-id=KYnfKGf0,discussion-id=r9HMqaAB,comment-id=00000001000000000000000000010000,timestamp=2018-10-29T14:05:51.632+0000)\n>\n> Du merkst schon wie diskriminierend diese Aussage grade war oder? Jemand mit starkem Gedächtnisverlust der schon eine Pflegeperson braucht kann sich nicht mal eben was aufschreiben der wird das warscheinlich nach 5 Minuten vergessen haben das er sich überhaupt etwas aufgeschrieben hat nur um diese Aussage mal zu entkräften. Dazu kannst du nicht sagen das jemand nur weil er es Gesundheitlich nicht schafft sich an etwas zu halten ein absolutes Spielverbot für League besitzt. \n\nEr hat nie gesagt, dass diese Person ein absolutes Spielverbot besitzt. Er hat nur gesagt, dass er dieses Spiel einfach nichts für ihn ist. \n\nUnd mal ganz ehrlich, wer wirklich dement ist und bereits nach 5 Minuten nicht mehr weiß, das er sich ein Passwort aufgeschrieben hat, der wird Ingame auch absolut nicht wissen, was er da überhaupt zutun hat. \n\nDementkranke haben eine ganz andere Sichtweise auf die Welt um sie herum, sie leben in einer völlig anderen Welt. Gut möglich, dass sie nichtmal \"erkennen\" was da überhaupt vor ihnen ist, geschweige denn, dass sie wissen, was man von ihnen in dem Spiel verlangt. \n\nUnd wenn es so schlimm ist wie du darstellst, dann werden sie nichtmal wissen, dass sie dieses Spiel überhaupt jemals gespielt haben. Warum sie also vor eine unmögliche Aufgabe setzen die sie nicht bewältigen können? \n\nIch habe das Gefühl, du hast absolut keinerlei Erfahrung mit Dementkranken gemacht, deren Krankheit in diesem Ausmaß fortgeschritten ist. \n\n>Riot kann niemanden verbieten dieses Spiel zu spielen nur weil eine Geistige Einschränkung besteht ansonnsten würden sie sich strafbar machen.\n\nNiemand hat gesagt, dass sie das nicht dürfen. Aber man muss auch realistisch bleiben. Wer aufgrund einer Krankheit so sehr eingeschränkt ist, dass es für ihn unmöglich ist, dieses Spiel zu spielen, für den ist dieses Spiel einfach nichts. \nDa ist nichts diskriminierend dran, aber man muss auch mal die Kirche im Dorf lassen und realistisch sein. \n\n> Angenommen es würde nen Tourret Kranken geben der sich durch seine Krankheit dazu beeinflusst fühlt im Spielchat schreiben zu müssen, und er fragt den Riot Support ob sie für seinen Account den Chat deaktiviert haben kann weil er diese Krankheit besitzt und Riot würde sagen: Ne geh mal weg mit deiner Gesundheitlichen störung machen wir nicht, dann könnte der die auf sehr hohe Summen verklagen weil genau das diskriminierendes Verhalten ist.\n\nWieso stellst du es eigentlich die ganze Zeit so dar, als hätte Bettnachleger gesagt, dass es den Spielern verboten ist zu spielen nur weil sie eine Einschränkung haben? \nEr hat niemals was von einem Verbot gesagt und auch von Riots Seite aus wurde nie so ein Verbot ausgesprochen! \n\nUnd woher willst du wissen, ob Riot bei so einem Ausnahmefall den Chat nicht deaktivieren würde? Es wäre eben ein Extremfall. \nIch kenne mich mit der Krankheit Turret nicht gut aus, aber ich glaube, es beschränkt sich einzig und alleine nur auf die Aussprache. Bedeutet also, dass ein Turretkranker also nicht einfach ein Schimpfwort in den Chat schreiben würde. Man muss sich ja bewusst dafür entscheiden die Tasten zu nutzen und Wörter einzutippen, das würde dann auch für so eine Person der Fall sein.  \nAber wie gesagt, ich habe mich mit der Krankheit nicht eingehend beschäftigt, deswegen beruht alles nur auf einer Vermutung meinerseits.","replies":[]}]}]},{"poster":"Angel Ayume","date":"2018-10-27T14:31:42.596+0000","up_votes":1,"down_votes":0,"body":"Das sind so extrem unwahrscheinliche Fälle, dass sie auf den TE ganz sicher nicht zutreffen. Und ich hab keine Ahnung ob bei diesen extrem seltenen Fällen Ausnahmen gemacht werden. \n\nIn der Regel werden zurecht gebannte Accounts nicht entsperrt. Und der Account wurde zurecht gebannt, wenn auch nicht der Accersteller dafür verantwortlich war. \n\nNur wie will er das beweisen, dass er es nicht gewesen ist? Selbst wenn der Supp sehen kann, dass der Acc auf einem anderen PC, in einer anderen Stadt bespielt wurde, wie will er beweisen, das er das nicht war? \n\nEr wird den Account wahrscheinlich nicht wiederbekommen. Er kann es gerne beim Support versuchen, aber er sollte sich nicht allzu viele Hoffnungen machen. \nWarum also sollte ich ihm Hoffnungen machen, wenn ich mir sicher bin, dass der Acc nicht entbannt wird? Das wäre nicht fair.","replies":[{"poster":"DrakoniaDRK","date":"2018-10-27T14:38:59.429+0000","up_votes":1,"down_votes":0,"body":"Mein zweit Account wurde auch gehackt. Die beiden (sehr wahrscheinlich der ein und der selbe Spieler) hatte dann all meine RP und Essenzen verballert die ich hatte um dich Skins zu kaufen und seinen Accs zu schenken. Ich habe das dem Support gemeldet und mein PW geändert. Wie die hacker an mein PW kamen ist mir noch immer ein Rätsel. Da ich nie jemandem mein PW weiter gegeben hatte und ein sehr sicheres PW habe. \nDer Support hat dann alles wieder hergestellt und der Haken wurde demnach dann Bestraft.","replies":[{"poster":"VentusKing","date":"2018-10-27T14:59:35.262+0000","up_votes":1,"down_votes":6,"body":"Ich kanns dir kurz und knapp erklären aber im vorweg nein dies ist kein tutorial oder sonnstiges wie man an account daten anderer kommt ich werde auch nicht nennen wie gegebene Programme heißen oder wie man daran kommt da ich auf keine Weise solche Illegalen Aktivitäten unterstütze und dient halt nur zur Aufklärung außerdem hat man wenn man sowas tut mehr als nur den Riot support am hals weil das gegen das Datenschutz Gesetz verstößt. Aufjedenfall von der gängigsten Methode in der ich in vielen Youtube videos gehört habe geht es um ein gewisses Programm das du auf verschiedene Dienste anwenden kannst dieses probiert sich an dem gewissen Clienten dann so lange, erst mit gängigen Nutzernamen und pws danach mit kniffligeren (mehr zahlen sonderzeichen etc) und zum schluss denkt es sich selbst sogar neue kombinationen aus die nicht so gängig sind, bis es etwas findet. Diesen Prozess kannste natürlich so oft durchführen lassen wie du willst und dadurch kann es halt dazu kommen das selbst wenn du absolut niemanden irgendwas verraten hast diese Leute trotzdem in deinen Account kommen. Richtig geschützt bist du halt nur wenn du mehrere Authentifizierungsmöglichkeiten verwendest um deinen Account sicherer zu halten, und je länger und nicht merkbarer dein passwort umso geschützter bist du vor solchen angriffen.","replies":[{"poster":"Bettnachleger","date":"2018-10-29T13:14:14.594+0000","up_votes":2,"down_votes":0,"body":"Ein halbwegs sicheres Passwort besteht aus kleinen / grossen Buchstabebn, Zahlen und Sonderzeichen.\nDazu hast du noch nicht einmal den Nutzernamen.\n\nViel spass beim nutzen von brutforce verfahren lol.\n\nDu kannst dir ja mal selbst ausrechnen wieviele moeglichkeiten es gibt, wenn du nur einen 4 stelligen Nutzername + Passwort verwendest.\n\nUnd klar, da macht sich extra jemand die Muehe sowas rauszubekommen, nur um dann auf dem Account zu flamen.\nKlaaaaaaaaaaaaaaaaaaaaaaaaaaaaar.","replies":[{"poster":"VentusKing","date":"2018-10-29T13:17:26.216+0000","up_votes":1,"down_votes":2,"body":"Es gibt viele Menschen mit fragwürdigen Hobbys ob dus glaubst oder nicht darunter sind bestimmt auch welche die sich n Spaß daraus machen Leute das Leben zur Hölle zu machen indem sie verschiedene Dinge sperren lassen.","replies":[{"poster":"Bettnachleger","date":"2018-10-29T13:28:01.539+0000","up_votes":2,"down_votes":0,"body":"Und die machen das dann gezielt oder was? ;D\n\nP.s.:\nNur um dir eine kleine Idee dafuer zu geben wir aufwendig es waere an so einen Account zu kommen.\nBei einem vierstellen UTF-8 Passwort hast du 128^4 moeglichkeiten.\nDas sind 268435456 moegliche Kombinationen.\n\nUnd jetzt bedenke das du den Nutzernamen nicht hast.\nErgo musst du ALLE moeglichen Passwoerter fuer jeden Moeglichen Nutzernamen beginngend von einem kleinen a an durchgehen ;D\n\nViel spass!\n\nAchja, wenn du Pro Versuch dich einzuloggen 0,5 Sekunden brauchst, und den Nutzernamen bereits hast, und dennoch alle Moeglichkeiten durchgehen musst bei einem 4 stelligen Passwort, wuerdest du ~ 1553 Tage brauchen.","replies":[]}]}]}]},{"poster":"Angel Ayume","date":"2018-10-27T14:42:02.100+0000","up_votes":1,"down_votes":0,"body":"Du hast es aber auch sofort gemeldet. Dem TE ist es erst nach ca. 2 oder 2 Jahren aufgefallen :( \nDeswegen glaub ich irgendwie nicht daran, dass er entbannt wird.","replies":[]}]}]}]}]},{"poster":"RM Heartmeander","date":"2018-10-27T13:55:20.606+0000","up_votes":2,"down_votes":1,"body":"Und wäre durch einen Bug oder durch einen massiven Hackerangriff Daten gestohlen worden und dadurch Leute gebannt, würde Riot diese auch wieder entbannen.\nDa aber (zumindest mir) kein solcher Fall bekannt ist, dass bei Riot Daten gestolen wurden halte ich die Wahrscheinlichkeit eher für sehr gering dass der TE deswegen gebannt wurde.","replies":[]}]}]}]},{"poster":"Sion Greyjoy","date":"2018-10-27T08:56:55.539+0000","up_votes":5,"down_votes":1,"body":"Ok, das heißt wenn jemand den Account hackt/sich Zugang verschafft und einen Ban herbeiführt, hat man Pech ?","replies":[{"poster":"MeMyselfandBaal","date":"2018-10-27T10:03:12.658+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Ructo der Blaue,realm=EUW,application-id=KYnfKGf0,discussion-id=r9HMqaAB,comment-id=00000000,timestamp=2018-10-27T08:56:55.539+0000)\n>\n> Ok, das heißt wenn jemand den Account hackt/sich Zugang verschafft und einen Ban herbeiführt, hat man Pech ?\n\nNaja... es ist irgendwie schon deine Verantwortung, was auf deinem Account passiert. Wenn es dir gleich aufgefallen ist, hätte der Riot Support bestimmt mit sich reden lassen, aber nachdem der Account dir Jahrelang egal war, wir es schwierig werden da nochmal etwas dran zu ändern.\n\nVor allem müsstest du jetzt ja einwandfrei nachweisen, dass du selbst damals nicht gespielt hast, was unmöglich werden dürfte. \n\nSicherlich, du kannst ein Ticket beim Support aufmachen und ich wünsche dir da auch viel Glück und Erfolg. Aber es ist ziemlich unwahrscheinlich, dass du deinen Account zurück bekommst. Da will ich dir einfach keine falschen Hoffnungen machen.","replies":[{"poster":"VentusKing","date":"2018-10-27T13:16:14.956+0000","up_votes":2,"down_votes":9,"body":"Also ist ein Bann gerechtfertigt weil man sich entschieden hat das Spiel hinter sich zu lassen? Wie zur hölle kann es seine Verantwortung sein wenn er seit 2/3 Jahren kein League mehr gespielt hat? Wenn jemand seinen Acc gehackt und dort haufenweise rassistische Äußerungen von sich gegeben hat dann ist es bei weitem nicht seine schuld?! Gott mich regen solche Menschen wie dich auf, zu tracken ob diese Games von seiner oder ner anderen IP gespielt wurden ist noch das leichteste für den Riot Support also könnt ihr von garnichts behaupten das es gerechtfertigt sei.","replies":[{"poster":"MeMyselfandBaal","date":"2018-10-27T23:18:17.538+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=VentusKing,realm=EUW,application-id=KYnfKGf0,discussion-id=r9HMqaAB,comment-id=0000000000010000,timestamp=2018-10-27T13:16:14.956+0000)\n>\n> Also ist ein Bann gerechtfertigt weil man sich entschieden hat das Spiel hinter sich zu lassen? Wie zur hölle kann es seine Verantwortung sein wenn er seit 2/3 Jahren kein League mehr gespielt hat? Wenn jemand seinen Acc gehackt und dort haufenweise rassistische Äußerungen von sich gegeben hat dann ist es bei weitem nicht seine schuld?! Gott mich regen solche Menschen wie dich auf, zu tracken ob diese Games von seiner oder ner anderen IP gespielt wurden ist noch das leichteste für den Riot Support also könnt ihr von garnichts behaupten das es gerechtfertigt sei.\n\nNaja... also dass der Account gehackt worden ist, ist halt relativ unwahrscheinlich. Aber selbst wenn. Also wenn mein Account morgen gehackt werden würde, wäre es halt schon irgendwie in meinem Verantwortungsbereich das Riot zu melden. Zumindest, wenn ich den Account behalten will. \nWenn es mich aber einfach jahrelang nicht interessiert, was auf meinem Konto passiert.\n\nUnd da musst du auch nicht mit gehackten Sony Accounts kommen. Oder Steam Accounts. Oder Bankkontos. Wenn ich x Euro auf meinem Konto habe, die plötzlich weg sind, ich das aber erst nach 3 Jahren merke, weil ich mich so gar nicht für das Geld auf meinem Konto interessiere, dann werde ich nach 3 Jahren keinen Schadensersatz einfordern können. Wenn ich mich dagegen gleich drum kümmere, dass das zurück gebucht wird...\nWenn es dich aber jahrelang nicht interessiert, wirst du Probleme haben, dass den entsprechenden Dienstanbietern im Nachhinein zu vermitteln.\n\nUnd wo du schon dabei bist: Auch das Durchgehen aller möglichen Passwörter durch ein Programm ist bei LoL relativ sinnfrei. Denn der Account ist ja 2fach gesichert. Denn du hast ja keinerlei Möglichkeiten an meinen Benutzernamen zu kommen. Und ja, wenn man sich nicht ganz dumm anstellt, ist der Benutzername ein anderer als der Beschwörername, den jeder sieht. Die Hacker müssten also ein Programm nutzen, dass bei beiden Feldern alle möglichen Optionen durchgeht... Da ist es wahrscheinlich effektiver sich einen Bot zu programmieren, der sich Level 30 erspielt... Oder man kauft sich einfach einen für 5 Euro. \n\nUnd dann bleibt natürlich noch die Frage, wie viele Versuche der programmierte Bot hat, bis Riot eine menschlich zu beantwortende Abfrage generiert. Hab jetzt persönlich keinen Bock drauf, dass auszuprobieren, aber du kannst ja mal ständig ein falsches Passwort eingeben und dann gucken, wie lange es dauert, bis du vom Client eine Reaktion bekommst... Bei EMail Adressen passiert so was gerne mal nach dem 4. oder 5. Versuch...\n\nAuch das IP Tracking... ich bin mir gar nicht mal sicher, ob Riot meine IP Daten überhaupt jahrelang speichern darf. Da gibt es bestimmt irgendwelche Bestimmungen zu, auch wenn sich an die bestimmt keiner hält... Abgesehen davon wäre es ein ziemlich hoher Aufwand, der für Riot einen relativ geringen Nutzen hat. Vielleicht bin ich auch naiv, aber ich gehe nicht davon aus, dass Riot sich detailierte (also über \"Kommt aus Deutschland) IP Daten von 100 Millionen Accounts jahrelang aufbewahrt. Auch hier gilt: Wenn der TE das gleich bei Riot meldet, ist es wahrscheinlich nachvollziehbar, aber Jahre später halt nicht mehr.","replies":[]}]}]},{"poster":"Marksmansitter","date":"2018-10-27T09:01:18.982+0000","up_votes":2,"down_votes":1,"body":"Schwer nachzuweisen das du nicht einfach den acc weitergegeben hast aber du kannst es ja versuchen","replies":[{"poster":"VentusKing","date":"2018-10-27T13:42:41.073+0000","up_votes":1,"down_votes":6,"body":"Also wenn er denn Acc weiter gegeben oder verkauft hätte wäre ich mir absolut sicher das der neu Besitzer das Passwort schon lange geändert hätte, dann wäre er auch nicht mehr in diesen Account reingekommen ohne ne recovery zu machen. Also ist das nachzuweisen eigentlich schon ziemlich leicht, was es sogar ist wenn man bedenkt das Riot alle daten eines Einloggens speichert und dazu auf welcher IP Adresse es geschieht.","replies":[{"poster":"RM Heartmeander","date":"2018-10-27T13:57:31.537+0000","up_votes":1,"down_votes":0,"body":"Der TE musste ja ein neues Passwort anfordern, weil es geändert wurde...\nUnd wenn das PW geändert wird, muss man wie auch auf den meisten Seiten einfach Passwort vergessen anklicken, sich in die E-Mail einloggen und dann hat man da ein neues Passwort mit dem man sich einloggen kann.","replies":[]}]}]}]}]},{"poster":"G2 Squirrel","date":"2018-10-27T14:48:17.725+0000","up_votes":2,"down_votes":1,"body":"Hallöchen.\n\nDas was bis jetzt geschrieben wurde, lasse ich einfach mal unkommentiert. Ich berichte mal von meinen Erfahrungen.\n\nIch habe auch eine Zeit lang nicht gespielt und hatte dann das gleiche Problem wie du - mein Account war gesperrt bzw. Permanently Banned. Aus welchen Gründen genau, weiß ich nicht mehr. Ob es nun wegen dem Chat war oder aus anderen Gründen, kann ich dir also nicht mehr sagen.\n\nJedenfalls habe ich dann direkt den Support angeschrieben und geschildert was passiert ist. Ich habe geschrieben, dass ich eine Zeit lang (war sicher ein halbes Jahr) nicht gespielt habe und ich mir jetzt nicht erklären kann, wieso mein Account gesperrt sei. Antwort vom Support kam innerhalb von 24h und es stellte sich raus, dass jemand meinen Account gehackt hat. Der Support hat den Account dann wieder entsperrt, ich habe mein Passwort und das Passwort meiner Mail geändert und seitdem (ca. 2 Jahre) keine Probleme.\n\nIch hoffe in deinem Fall wird es auch so laufen. Ich drücke dir die Daumen\nGrüße","replies":[{"poster":"Angel Ayume","date":"2018-10-27T15:24:52.303+0000","up_votes":2,"down_votes":0,"body":"Das freut mich für dich. :) \nDann hoffe ich, dass im Fall des TE auch so entschieden wird und ich unrecht haben werde.","replies":[]},{"poster":"Bettnachleger","date":"2018-10-29T13:26:26.498+0000","up_votes":1,"down_votes":0,"body":"Irgendwie witzig, das immer genau die Leute gehacked werden, die keine Lust mehr aufs Spiel haben und eine lange Pause einlegen, nur um am Ende dann wiederzukommen ;^)","replies":[{"poster":"G2 Squirrel","date":"2018-11-08T18:36:06.999+0000","up_votes":1,"down_votes":0,"body":"Kann dir gar nicht sagen wieso ich aufgehört hatte zu spielen. Auf jeden Fall hatte ich nie den Plan nie wieder LoL zu zocken :D\n\nAber ist doch im Prinzip ganz simpel. Wieso sollte jemand einen aktiven, bespielten Account hacken? Davon hat er doch nichts. Wäre ich Hacker, würde ich mir auch inaktive Accounts raussuchen. Da ist doch die Wahrscheinlichkeit am höchsten, dass der \"Besitzer\" den Hack nicht melden wird und man den Account für seine Zwecke nutzen kann","replies":[{"poster":"Bettnachleger","date":"2018-11-09T01:15:47.653+0000","up_votes":1,"down_votes":0,"body":">  Wieso sollte jemand einen aktiven, bespielten Account hacken?\n\nDie Frage ist eher WIE sollte jemand einen bespielten /nicht bespielten Account hacken?\nUnd warum? KA, ergibt null Sinn wenn der Spieler nicht gerade hohes Chalenger Tier ist.\n\n>  Davon hat er doch nichts. \n\n Daher: Wieso sollte man sich die Muehe machen?\n\n> Wäre ich Hacker, würde ich mir auch inaktive Accounts raussuchen.\n\nWie? Du brauchst schon einen gescheiten Allgorithmus dafuer, um das auch nur ansatzweise profitabel zu machen.\nDu musst erstmal die Accounts finden, die auf dein Schema zutreffen, dann brauchst du deren Nutzernamen und das Passwort.\nIch sags dir so wie es ist ... es ist unmoeglich geziehlt einen Account rauszupicken. \nEs ist NICHT moeglich beides zu erahnen, Passwort UND Benutzername. 0,00000xxxx % Chance.\n \n>  Da ist doch die Wahrscheinlichkeit am höchsten, dass der \"Besitzer\" den Hack nicht melden wird und man den Account für seine Zwecke nutzen kann\n\nOhja, und der Hacker, der ja den Account gestohlen hat, faengt einfach an zu flamen auf dem Account?! Weil ... ja .. warum?\nErgibt halt null Sinn.","replies":[{"poster":"G2 Squirrel","date":"2018-11-09T16:52:12.414+0000","up_votes":1,"down_votes":0,"body":"Wie mein Account gehackt wurde, kann ich dir nicht sagen. Ich hatte weder verdächtige Programme auf meinem Rechner, noch habe ich meinen Account geteilt oder meine Daten auf riotfremden Seiten eingegeben. \n\nWarum mein Account gehackt wurde, kann ich dir auch nicht sagen. Ich kann nur so viel sagen: er wurde gehackt.\n\nIn meinem Fall hat derjenige auch nicht wild rumgeflamed und es darauf angelegt dem Account einen Ban zu verpassen. Derjenige hat tatsächlich mit meinem Account gespielt - und das nicht mal schlecht","replies":[]}]}]},{"poster":"Abasin","date":"2018-11-09T10:50:16.833+0000","up_votes":1,"down_votes":0,"body":"Ich bin derzeit auch nicht in LoL aktiv, nur im Forum. Das ist mittlerweile auch schon 3 Monate her, wahrscheinlich werde ich sogar aus diversen Clubs rausgeworfen. {{sticker:cass-cry}} \n\nImmerhin scheint sich noch keiner des Accounts bemächtigt zu haben, op.gg zeigt keine gespielten Matches an.\n\nAber... es könnte passieren, dass jemand irgendwie an mein Passwort rankommt. Geklaute Passwortdateien gibt es genug, manche Leute schmücken sich auch mit fremden Federn wie im Fall vom MrMaikAP. Möglichkeiten, an Accountinfos ranzukommen gibt es sehr viele. Diejenigen, die hier schreiben, sind auch nur die Spitze des Eisberges.\n\nP.S.: Ich komme auch bald wieder ins Spiel. Wenn ich von D3 und No man's sky die Schnauze voll habe.","replies":[]}]}]},{"poster":"SecretofBigMac","date":"2018-10-29T06:01:45.223+0000","up_votes":1,"down_votes":0,"body":"Nein wenn du nicht lügst wäre es möglich ... Vor 2 Jahren als der Acc noch unbanned war aber da du dich dafür nie interessiert hast der Acc eig Riot gehört und eben etwas falsches darauf passiert ist kam eine Strafe du musst das gegenteil beweißen ansonsten wirst du nicht weit kommen.","replies":[]}]}