{"poster":"YellowMark","date":"2017-08-08T23:38:53.111+0000","title":"Donde poner wards? (Despues de la fase de carriles)","subforum":"Guias y consejos","up_votes":4,"down_votes":0,"body":"Siempre que juego en cualquier puesto generalmente ponemos wards en los bushes para evitar algun gank/campeo o como lo digan, pero despues de la fase de carriles no se me ocurre otros lugares para ponerlos, generalmente pongo wards en zonas de buffos y en zonas donde generalmente se empieza alguna teamfight, que creo que generalmente es en mid.\r\nSiempre me pregunte eso cuando veia mi puntuacion de wards, entonces... En cuales lugares puedo Poner wards?, dependiendo de la ocasion claro.","replies":[{"poster":"Ks Erwyn","date":"2017-08-08T23:56:36.145+0000","up_votes":2,"down_votes":0,"body":"[img]http://i.imgur.com/3qvfTy9.jpg[/img]\n\nNo hay mucha ciencia(oh si mas bien) pero te daré algo sencillo y practico:\n\n* Puntos rojos, en desventaja en posicion defensiva para proteger la entrada de tu Jg y hacer la tortuga en base mientras remontan\n\n* Puntos verdes, partida iguala y estancada en un punto medio cuyo propósito en controlar la vision de los objetivos grandes  \n\n* Puntos Violetas, con clara ventaja controla la jg rival, los objetivos y rotaciones rivales...\n\n* IMPORTANTISIMO, si se ponen wards en medio del carril, cumplen varias funciones pero dos destacan por sobre otras, primero controlas la rotacion desde el carril del team rival hacia una linea u otra y segundo para un posible Tp a espalda rival para colapsarlos por ambos frentes...\n\nhay guias mas profundas y detalladas en YT,reddit, aca mismo en el foro si busca en guias y consejos, de como hacerlo eficientemente, cuando y por que por sobre todo, ya que importa mas saber cuando y donde poner el ward que el solo hacerlo...","replies":[]},{"poster":"iTzRevenant16","date":"2017-08-08T23:54:37.373+0000","up_votes":2,"down_votes":0,"body":"Sinceramente, siempre seguí esta imagen y la use como referencia para wardear: http://imgur.com/a/J5s2O","replies":[]},{"poster":"martincarp","date":"2017-08-09T00:03:09.457+0000","up_votes":3,"down_votes":1,"body":"A nivel competitivo los centinelas se utilizan para marcar el territorio \"perteneciente\" a cada equipo, y dejar bien en claro en qué parte del mapa pueden darse las siguientes peleas. \n\nLos centinelas de control son utilizados en el \"territorio aliado\", ya que es la zona donde se supone que el rival no tiene información y te permite moverte libremente, preparar emboscadas, o hacer rotaciones sorpresivas sin que sepan cuándo reaccionar o qué está sucediendo.\n\nY los centinelas comunes y corrientes se usan en las zonas adyacentes al objetivo, o los objetivos, que el equipo quiere disputar. Obviamente la idea de estos es poder ver al rival respondiendo a tu call lo más rápido posible, y así reaccionar con la mayor cantidad de información que se pueda tener en esa fracción de segundo donde tenés que decidir si asegurar el dragón o dejarlo para pelear (o irse si está complicada la pelea).\n\nPor ejemplo que la imagen que estoy a punto de poner se puede ver un posible escenario de setup para un dragón por parte del equipo Azul. Fijate como con 3 pinks se puede dominar tranquilamente 2 objetivos (camino hacia la torreta de mid y todo el río), y si a eso le sumamos lo que se podría limpiar con 2 trinkets rojos sin mejorar (lo normal en una preparación de minuto 10 al 15), el rival no tendría idea de que pasa en el río durante una ventana de unos 10 segundos, tiempo que a veces es más que suficiente para rushear un dragón y rotar hacia la torreta.\n\nhttps://i.gyazo.com/6e3e83b269158633868e6c5ef613fdf5.png\n\nLo mismo puede aplicarse cuando tu equipo está dominando el mapa y empiezas a presionar torretas de segundo grado, con un buen control de visión (siempre teniendo en cuenta para qué sirve cada tipo de ward) puedes dejar al enemigo a ciegas, y obligarlos a rotar por rutas más largas, o directamente meterse en el medio de tu equipo, donde podrás conseguir uno o dos asesinatos y obtener más fácil el siguiente objetivo, ya sea un baron o un par de torretas.\n\nhttps://i.gyazo.com/f9d9457f05b381cef353c284cef11c4e.jpg\n\nY se que ahora me vas a decir \"¿Y cómo logro aplicar todo esto cuando no tengo comunicación ni coordinación con mis aliados\", y pues lamentablemente la respuesta es \"casi nunca lo vas a lograr\". Peeeero el simple hecho de tener este conocimiento, y un poco de práctica de cómo usar el chat de manera adecuada con quienes están dispuestos a usarlo, créeme que te permitirá tener la ventaja y el control de la partida en la mayoría de las ocasiones donde tu equipo sale con ventaja, o al menos no perdió, en la fase de líneas. En mi caso como main soporte me es fácil aplicarlo, ya que tengo la posibilidad de comprar 3 pinks e ir reemplazándolos en vivo para asegurarme de que todos los puntos importantes estén 100% limpios, y la posibilidad de poner 3 wards comunes en los lugares que más me importan para controlar el siguiente objetivo, fijate que en estos ejemplos, y en cualquier otro ejemplo que te hubiera dado, no se necesitarían más de 3 o 4 wards comunes para tener 100% controlado un objetivo.\n\nAsí que eso, pinks en la zona de dominio del objetivo que más me importa (ya sea Baron, Dragón o una jungla), wards en donde sé que me puedo topar con un rival, y tratar de comunicarme con mi equipo para jugar 100% alrededor de esa visión, que pongan pinks en las zonas que se están disputando, e ir rotando la visión constantemente para que esté SIEMPRE alrededor del objetivo que el team quiere pelear","replies":[]},{"poster":"Muñekko","date":"2017-08-11T17:33:46.889+0000","up_votes":1,"down_votes":0,"body":"Mas alla de que quizás haya lugares especificos que al wardearlos ayuden mucho, pienso que lo mejor es wardear acorde a lo que va pasar o queres hacer.\n\nEs decir:\n\"Estoy jugando agresivo en linea? Parandome lejos de mi torre?\" - Wardea los posibles accesos del jungla rival.\n\"El dragon sale en x segundos? - Wardealo, e intenta wardear los accesos a rio del enemigo.\n\"La torre tier 1 de top y mid cayeron?\" - Wardea la jungla enemiga del lado de bot, si luego rotas hacia alla, tendras gran ventaja.\n\nTodo es muy situacional, habria que intentar predecir que quiere hacer el rival y wardear acorde.\nAsi como tambien preparar la vision alrededor de un objetivo si vamos a intentar sacarlo.","replies":[]},{"poster":"YellowMark","date":"2017-08-09T03:13:51.758+0000","up_votes":1,"down_votes":0,"body":"Bueno la verdad se nota mucho que es un tema, digamos que es un tema profundo(?) , les agradezco los consejos, especialmente los mapas, digamos que lo voy a tratar de recordar la mayor parte.","replies":[]}]}