{"poster":"YellowMark","date":"2017-07-23T00:50:51.561+0000","title":"Hagan algo con el rammus (¿y que hacer con el en plena tf?)","subforum":"Guias y consejos","up_votes":4,"down_votes":5,"body":"La verdad tienen que hacer algo con el rammus... especialmente cuando TODOS le arman con 4 o 3 items armor... (de los que mas dan esa bonificacion), un item de resistencia magica.. botas de las mas rapidas, y el item jungla... eso sin contar de que a pesar de que su Q es canalizada ahora, la velocidad que tiene es IMPRESIONANTE, le metes una stun cuando llegas, pero si tiene ulti y no tenes alguna forma de salvarte te jodes, que en mi caso el modo en el q mas veo que nos joden(jg) , y literalmente en late digamos que en mi elo(elo bronze, plata..., tema aparte), nos caga tremendamente a palos tener una tortuga que solo se queda parada.. nos ralentiza UN MONTON... que con hechizos tipo Q de {{champion:254}} o similares, de esa forma te salvas, counterea a cualquier tanque que tenga, hasta ahora solo he visto que si tenes algun campeon con {{item:3153}} o un {{item:3036}} , {{item:3033}} le das batalla, en mi opinion pienso que tiene muy pocas debilidades para un campeon que de por si es lento cuando entra... porq tiene que aguantar con su habilidad correspondiente, que haces cuando tiene ultimate?, que haces cuando NO tenes flash o forma para salvarte? y especialmente esta pregunta me gustaria que respondan, que puedo hacer yo, para cubrir a mi adc, o a mi fuente de da&ntilde;o, evitar que el rammus nos rompa, y empezar tf matando a su fuente de da&ntilde;o?, bueh en mi caso generalmente yo juego algun tanque como top, o como jungla un tanque o como ahora que ando variando entre {{champion:254}} y {{champion:102}} \n\n~~Si puse este post en un mal lugar perdonen xd~~","replies":[{"poster":"NiraxBlaster","date":"2017-07-23T05:09:05.114+0000","up_votes":1,"down_votes":0,"body":"Es asi el pj, es la idea principal,WW puede hacer lo mismo y peor tiene 55% reduccion de daño aumento de velocidad de ataque y velocidad de movimiento cuando un enemigo tiene poca hp\nRammus tiene una jg dificil y hay muchas formas de joderle la vida Stuns ,o simplemente te le paras adelante y que se choque con vos Rammus le tiene que pegar al primero que choca porque su W le baja mucha velocidad de movimiento tenes el Fajin para armarte si sos adc","replies":[]},{"poster":"ANYASZOMORÍTÓK","date":"2017-07-23T01:35:31.531+0000","up_votes":1,"down_votes":0,"body":"Rammus es muy fácil de counterear. Todo su daño es mágico (por ende es razonable buildear aunque sea un item de magic resist y {{item:3111}} ). Tu ADC contra un Rammus debería buildear {{item:3140}}  para su taunt y {{item:3035}} para contrarrestar su armadura. Esos items después que los termine en {{item:3139}}  y {{item:3036}}, pero que no los rushee porque se va a quedar sin daño en early/mid game. Como support buildeate {{item:3222}}  y {{item:3190}}, ambos buenos items para inutilizar su taunt y parte de su daño mágico respectivamente.\n\nEn plena TF, una vez que entra y gasta sus fuentes de daño principales (el taunt y la ult), simplemente hay que ignorarlo. Su escudo lo vuelve más lento y se le va a hacer difícil acercarse a alguien. Es el tipo de campeón que si gasta todo en una TF y no logra nada queda inútil y es mejor ignorarlo que hacerle frente, ya que su daño es inconsistente.","replies":[{"poster":"YellowMark","date":"2017-07-23T01:57:13.944+0000","up_votes":1,"down_votes":0,"body":"la verdad si soy sincero para mi elo, nos jode mucho, porq honestamente como te dije se mete todo armor.. no he visto un rammus q se meta armadura/vida/rm de forma equilibrada o \"normal\", siempre trato de comerme su taunt.. pero me es imposible evitar su ultimate, ralentiza un monton... y peor cuando agarra de lleno a mi carry, y entonces que hago cuando soy un carrilero superior.. en mi caso un coloso o tanque?","replies":[{"poster":"ANYASZOMORÍTÓK","date":"2017-07-23T02:17:03.163+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=YellowMark,realm=LAS,application-id=8sKIclmi,discussion-id=gl0RjRlz,comment-id=00000000,timestamp=2017-07-23T01:57:13.944+0000)\n>\n> la verdad si soy sincero para mi elo, nos jode mucho, porq honestamente como te dije se mete todo armor.. no he visto un rammus q se meta armadura/vida/rm de forma equilibrada o &quot;normal&quot;, siempre trato de comerme su taunt.. pero me es imposible evitar su ultimate, ralentiza un monton... y peor cuando agarra de lleno a mi carry, y entonces que hago cuando soy un carrilero superior.. en mi caso un coloso o tanque?\n\nYa te respondí. Hay que buildear magic resist ya que el daño de Rammus es todo mágico.","replies":[]}]}]}]}