{"poster":"macromite","date":"2017-06-19T02:52:32.245+0000","title":"Something to consider.","subforum":"Gameplay","up_votes":2,"down_votes":3,"body":"League of legends has been in existence for a long time, nearly ten years. In that time 136 different characters came into existance, items have been deleted and created, and runes and masteries have also recieved changes.\r\n\r\nMetas have come and gone, changes that needed to be made at the time were made, buffs were made to champions when they were weak, and nerfs were given when they were strong.\r\n\r\nAnd in that time riot has still never managed to create a fairly accepted balanced meta.\r\n\r\nSo perhaps there are things within this game system are inherently flawed, and can&#039;t be fixed at all. \r\n\r\nMaybe the game itself is bad inherently, and instead of thinking that riot is bad for making a great game bad, perhaps riot has been taking a shit concept and making it great.","replies":[{"poster":"SnakDatSmilesBak","date":"2017-06-19T04:15:43.182+0000","up_votes":1,"down_votes":0,"body":"Farming is a flaw or a measure of skill depending on who you ask.","replies":[]},{"poster":"Phyuq Yiu","date":"2017-06-19T03:24:06.882+0000","up_votes":1,"down_votes":0,"body":"People want to find OP builds and OP strats, and use them to have an advantage.\nThe best part of big changes is finding out what is op and abusing that. My only issue is when the same annoying champ is always op.","replies":[{"poster":"macromite","date":"2017-06-19T03:35:05.886+0000","up_votes":1,"down_votes":0,"body":"i'm saying its like that because the game itself, the system that the game functions on, fails when a certain type of champion does not exist in high prevalence. a certain type of aggression has always been highly incentivized, so perhaps the game actually needs such a thing to exist at all, perhaps without the heavy aggression and constant forced fights the games core, a game about farming creeps and cleaing objectives, isn't compelling enough to have existed this long.","replies":[]}]}]}