{"poster":"macromite","date":"2017-07-03T13:17:17.069+0000","title":"People don't like getting bursted.","subforum":"Gameplay","up_votes":5,"down_votes":5,"body":"I don&#039;t think anyone really has any issue with any of the classes in the game. \r\n\r\nIt just that when the champion they face is going to kill them in 2 seconds or less it turns what could be a fun and interesting game into a game where every single mistake can be a huge problem.\r\n\r\nSo why does riot keep making everything so bursty.\r\n\r\nHeck mand I think a good deal of the toxicity in the game stems from this. Your team mate makes what could be considered a minor mistake, but because he is up against something that can kill him in a second and his play directly affects you, you get mad at him and verbally tell that person off.","replies":[{"poster":"420 grams","date":"2017-07-03T15:09:10.474+0000","up_votes":2,"down_votes":0,"body":"Keeps it interesting and interactive knowing of you step out of position as a squishy you can die right away. It rewards map awareness and punishes carelessness.","replies":[{"poster":"macromite","date":"2017-07-03T15:21:36.118+0000","up_votes":3,"down_votes":0,"body":"the same intrigue can be casted with chunking.","replies":[{"poster":"420 grams","date":"2017-07-03T16:00:32.234+0000","up_votes":1,"down_votes":0,"body":"That's how it is now. You get hit by one ability, you won't die. You get hit by four, you're going down.","replies":[{"poster":"macromite","date":"2017-07-03T16:09:32.388+0000","up_votes":1,"down_votes":0,"body":"That's a problem. full combo's shouldn't be lethal from zero even on the least defensive of classes. this game punishes deaths a lot, so not allowing counterplay either is also bad.","replies":[]}]}]}]},{"poster":"Darkdemon653","date":"2017-07-03T16:20:02.289+0000","up_votes":2,"down_votes":0,"body":"And instead of doing things to prevent themselves from being bursted, they cry on the forums. THAT is the issue. People forgot that offensively-focused champions/roles can buy defensive items and be just fine.","replies":[{"poster":"macromite","date":"2017-07-03T16:58:33.879+0000","up_votes":2,"down_votes":1,"body":"honestly I started thinking about this after playing full tank voli and dying through my passive without gw.","replies":[]}]},{"poster":"TimX24968B","date":"2017-07-03T17:53:55.569+0000","up_votes":1,"down_votes":0,"body":"because burst is a design choice?\nelse why not give everyone death dance's passive on top of their current passive, and eliminate a whole entire class from the game (burst mages).\n\nNot to mention, technically at the smallest level, any amount of DOT is just constant bursts of a very small amount of damage.","replies":[]},{"poster":"Warning Shot","date":"2017-07-03T16:15:46.142+0000","up_votes":1,"down_votes":0,"body":"You're not wrong about why people claim \" op\" it is all based around burst. \nfed darius ults you for half your health? \"op\" , fed yasuo crits you 3 times in a row \" op\" adc who has 300 cs crits youf or 800 \" op\" . etc etc etc\n\nThe issue is that if riot removed burst then they would remove most of the fun of the game. Knowing you played well to the point that you can burst is one of the better feelings in the game.","replies":[{"poster":"macromite","date":"2017-07-03T17:02:06.768+0000","up_votes":1,"down_votes":0,"body":"You are wrong in thinking that bursting people is the important part.","replies":[{"poster":"Warning Shot","date":"2017-07-03T17:08:58.312+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=macromite,realm=NA,application-id=3ErqAdtq,discussion-id=4NQfYevE,comment-id=00010000,timestamp=2017-07-03T17:02:06.768+0000)\n>\n> You are wrong in thinking that bursting people is the important part.\n\nnoone said important, I said fun. if it takes 10+ seconds to kill every champion in the game it would get very dull very fast.","replies":[{"poster":"macromite","date":"2017-07-03T17:50:36.647+0000","up_votes":1,"down_votes":0,"body":"So its less dull to need to wait for 30-odd seconds after essentially every encounter? because for every game you go and instaburst all of your enemies that's the game they're playing.","replies":[]}]}]}]}]}