{"poster":"LegendJurai","date":"2018-01-24T14:05:38.858+0000","title":"Elemental Lux","subforum":"Skin- & Champion-Konzepte","up_votes":1,"down_votes":0,"body":"Hallo!\r\n\r\nIch mag Lux sehr gerne und m&ouml;chte mir gerne ihren teuren Skin kaufen. Ich finde die Idee mit den Elementen ziemlich cool ^^\r\nAber eine Frage habe ihr bei ihr:\r\nNormalerweise sind Skins nicht st&auml;rker oder schw&auml;cher als ihre normalen Champions. Aber ist Elemental Lux trotzdem vllt st&auml;rker, weil der ja sehr teuer ist? (Genauso wie bei Sona, Udyr und Ezrael?)\r\n\r\nW&uuml;rdet ihr Elemental Lux kaufen f&uuml;r den teuren Preis?\r\nUnd habt ihr vllt irgendwelche Tipps f&uuml;r Elemental Lux?\r\n\r\nLG, LegendJurai","replies":[{"poster":"Im a Papaya","date":"2018-01-24T14:26:47.747+0000","up_votes":1,"down_votes":0,"body":"Nein, lol ist zum Glück nicht Pay to win und die Skins haben keinen Vorteil gegenüber dem original Skin. Einige Skins haben leichte Vor und Nachteile z.B. Asylum Shacos Q Rauch ist dunkel und nicht rot also weniger leicht zu bemerken und solche Dinge.\nUnd ja ich hab den Elemental Lux Skin gekauft weil es mir gefallen hat verschiedene Farben auszuwählen und zu kombinieren und ich den Skin wirklich gut gemacht finde.\nDer einzige Tipp den ich hätte wäre das man wenn man wirklich cheese unterwegs sein will auf der Aram Map helle Verwandlungen auswählen sollte weil dann die Hitboxen von den Zaubern nicht so klar sind aber das sollte man eigentlich nicht nötig haben, sonst gibts soweit ich weiß keine Tipps.","replies":[]},{"poster":"Dermel","date":"2018-01-24T14:24:55.984+0000","up_votes":1,"down_votes":0,"body":"Bei den blauen Formen vom Lux-Skin sieht man die Q viel schlechter, das ist ein kleiner Vorteil aber dafür würde ich nicht so viel Geld ausgeben.","replies":[]},{"poster":"Homunculi","date":"2018-01-24T14:22:15.357+0000","up_votes":1,"down_votes":0,"body":"Der Preis der Skins bezieht sich meistens darauf wie viel verändert wurde und wird deswegen in verschiedene Stufen kategorisiert.\n\nKein Skin macht einen Champ stärker oder Schwächer sondern sind rein kosmetisch, es gibt bei ein paar Skins \"Vorteile\" aufgrund der Animationen die nicht 100% ausgemacht werden können, als Beispiel Apple Blitzcrank, da sieht man die Q sehr schlecht/spät.\n\nGlaub mir wenn LoL p2w wäre, wäre es nicht so groß.","replies":[]}]}