{"poster":"Eirei","date":"2018-03-09T13:18:37.909+0000","title":"Runeterra Region Icons","subforum":"Story, Art, & Sound","up_votes":4,"down_votes":0,"body":"From December 2016 we started getting summoner icons with a symbol of a region in Runeterra, as a little celebration of a champion getting released or reworked (and some lore being added or updated :D ) and I&#039;d like to talk about that a little bit more. This is what we got so far:\n\n* **December 2016  - Camille release**  - Piltover icon\n* **January 2017 - Warwick VGU**  - Zaun icon\n* **March 2017 - Galio VGU**  - Demacia icon\n* **February 2018 - Swain VGU** - Noxus icon\n* **March 2018 - Kai&#039;Sa release** - Void icon\n\nWhich leaves Ionia, Shurima, Freljord, Mt. Targon, Bilgewater, Bandle City, and Shadow Isles to go.\n\nNow, some regions like Shurima, Bilgewater and Freljord had past events tied to them and with them also a couple of icons with their respective crest - does that count towards this, or can we expect new ones to go with this &#039;more official&#039; cycle? Freljord event icons didn&#039;t include the official crest, but crests of the three tribes. Shurima, Bligewater and Shadow Isles got their crest icons available in store which doesn&#039;t really add up with this cycle being &quot;event only&quot;\n\nIt&#039;s also interesting that in 2017, we had _three_ Ionian champions released (Kayn, Xayah, and Rakan) yet no Ionian icon. I think it&#039;s safe to say we should expect it with Irelia&#039;s VGU coming up soon.\n\nZoe came out in November 2017 with no icon related to her which I know some people were kind of upset about since recently we&#039;ve seen the trend of champions and skins being released with related icons, but I got more &quot;upset&quot; that there wasn&#039;t a Mt. Targon icon - we&#039;ll have to wait until a brand new Targon champion is released when we _just_ got one? Or is this a potential clue Leona or Pantheon might get VGUs relatively soon?\n\nIf any Rioters are lurking, give us answers please? :D \n{{sticker:sg-zephyr}}","replies":[{"poster":"Riot TahmHiddle","date":"2018-03-10T02:40:33.981+0000","up_votes":7,"down_votes":0,"body":"Hi there! I'm both a Rioter and a lurker....? Actually a fellow Rioter pointed me to your post :P. I'm on the team that is working on these icons/lore updates. Your assessment is accurate. Shurima, Bilge, and Freljord were icons specific to an event. We have separate icons for those and the others you mentioned. I can't speak for how we rolled them out in the past, but I can tell you that it is our goal to keep shipping them out until you have one for each :D. We're looking for the right moments, so I don't know when they will all be out, but I will say that you'll be seeing them more consistently.","replies":[{"poster":"Emo Twink","date":"2018-03-10T06:44:48.483+0000","up_votes":1,"down_votes":0,"body":"But will we ever see a Zoe icon though? She didnt even get a Targon icon, let alone one of her.","replies":[{"poster":"Riot TahmHiddle","date":"2018-03-10T07:18:35.590+0000","up_votes":2,"down_votes":0,"body":"Don't know about a Zoe icon, but I do have faith that we will see a Targon one","replies":[{"poster":"VelvetCrotch","date":"2018-03-11T20:39:49.799+0000","up_votes":2,"down_votes":0,"body":"and i have the faith that we get a second change to collect all missing lore-icons. {{sticker:katarina-love}}","replies":[{"poster":"Riot TahmHiddle","date":"2018-03-13T00:43:09.547+0000","up_votes":4,"down_votes":0,"body":";)","replies":[]}]},{"poster":"Emo Twink","date":"2018-03-10T09:37:35.184+0000","up_votes":1,"down_votes":0,"body":"ahh thats too bad.. im glad i got a definite answer though so thank you! its better than keeping hopes up aha ^^","replies":[]}]}]},{"poster":"The Iceborn","date":"2018-03-10T15:22:05.501+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Tahm Hiddleston,realm=NA,application-id=6kFXY1kR,discussion-id=G76yhAE7,comment-id=0004,timestamp=2018-03-10T02:40:33.981+0000)\n>\n> Hi there! I&#x27;m both a Rioter and a lurker....? Actually a fellow Rioter pointed me to your post :P. I&#x27;m on the team that is working on these icons/lore updates. Your assessment is accurate. Shurima, Bilge, and Freljord were icons specific to an event. We have separate icons for those and the others you mentioned. I can&#x27;t speak for how we rolled them out in the past, but I can tell you that it is our goal to keep shipping them out until you have one for each :D. We&#x27;re looking for the right moments, so I don&#x27;t know when they will all be out, but I will say that you&#x27;ll be seeing them more consistently.\n\nI missed the freljord icon.. will I ever be able to obtain it ??","replies":[{"poster":"Riot TahmHiddle","date":"2018-03-13T00:45:24.868+0000","up_votes":2,"down_votes":0,"body":"The previous Freljord icons weren't the region icons that I'm mentioning. I can't speak to those, but I imagine the Freljord region icon will show up eventually :D","replies":[]},{"poster":"Eirei","date":"2018-03-11T08:29:04.550+0000","up_votes":1,"down_votes":0,"body":"Think you misread, the Freljord event had three icons issued, one for each Freljord tribe (Ashe's, Sejuani's, and Lissandra's). Some other regions also had events with icons for them, some of which are available in the store for purchase - however, what Riot Tahm confirmed here is that all those regions are getting new icons in the future to complete the lore/icon cycle that started with Piltover :D So if you're looking for those tribe icons, best bet would be to send a support ticket although I doubt that'd be successful. But, for the official Freljord crest icon, we just have to wait until it comes out, so you didn't miss it :D","replies":[{"poster":"The Iceborn","date":"2018-03-11T12:00:38.614+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Häte,realm=EUW,application-id=6kFXY1kR,discussion-id=G76yhAE7,comment-id=000400030000,timestamp=2018-03-11T08:29:04.550+0000)\n>\n> Think you misread, the Freljord event had three icons issued, one for each Freljord tribe (Ashe&#x27;s, Sejuani&#x27;s, and Lissandra&#x27;s). Some other regions also had events with icons for them, some of which are available in the store for purchase - however, what Riot Tahm confirmed here is that all those regions are getting new icons in the future to complete the lore/icon cycle that started with Piltover :D So if you&#x27;re looking for those tribe icons, best bet would be to send a support ticket although I doubt that&#x27;d be successful. But, for the official Freljord crest icon, we just have to wait until it comes out, so you didn&#x27;t miss it :D\n\nty :)","replies":[]}]}]},{"poster":"Eirei","date":"2018-03-11T13:55:31.683+0000","up_votes":1,"down_votes":0,"body":"Thanks to the Rioter that pointed this out to you, and thank you for providing some clarity! :D\n\nAs someone who's really interested in the league lore and is also an avid icon collector, this makes me happy ^^","replies":[]},{"poster":"Tesla Effect","date":"2018-03-10T09:41:16.826+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Tahm Hiddleston,realm=NA,application-id=6kFXY1kR,discussion-id=G76yhAE7,comment-id=0004,timestamp=2018-03-10T02:40:33.981+0000)\n>\n> Hi there! I&#x27;m both a Rioter and a lurker....? Actually a fellow Rioter pointed me to your post :P. I&#x27;m on the team that is working on these icons/lore updates. Your assessment is accurate. Shurima, Bilge, and Freljord were icons specific to an event. We have separate icons for those and the others you mentioned. I can&#x27;t speak for how we rolled them out in the past, but I can tell you that it is our goal to keep shipping them out until you have one for each :D. We&#x27;re looking for the right moments, so I don&#x27;t know when they will all be out, but I will say that you&#x27;ll be seeing them more consistently.\n\nGlad to hear that my faction icon collection wont be left incomplete.","replies":[]},{"poster":"Killaburn","date":"2018-03-10T06:08:05.285+0000","up_votes":1,"down_votes":1,"body":"nice!","replies":[]}]},{"poster":"Tesla Effect","date":"2018-03-09T18:30:01.567+0000","up_votes":3,"down_votes":0,"body":"That leaves Shadow Isles, Mount Targon, and Shurima icons to be yet released. Two of them could be attached to Visual Updates such as Mordekaiser and Pantheon, while Shurima one maybe tied in to a Champion release ...or Zileans Visual Update.","replies":[]},{"poster":"GreenLore","date":"2018-03-09T13:25:17.509+0000","up_votes":2,"down_votes":0,"body":"Well like you said,Ionia will likely get an icon once the Irelia VGU comes out.\n\nAnd it was said that after the Irelia VGU we'll revisit Bilgewater(probably with a new champ),so if we'll get another Bilgewater icon,then thats the perfect opportunity(maybe we'll get a different one or they just hand out the previous one for the event and give RP to whoever had it already before?)\n\nLater on we'll get the Akali VGU,which will likely not come with any icon(though I wonder if Riot plans to let these icons return,so maybe the Akali update offers a second chance for an ionia icon?) and after that we'll most certainly get the Nunu VGU,which would probably come with a Freljord icon.\n\nHonestly,the only faction after that without a lore update would be Bandle city,so I think that we could see some Bandle content towards the end of the year.","replies":[]},{"poster":"KestrelGirl","date":"2018-03-09T20:21:01.636+0000","up_votes":1,"down_votes":0,"body":"We had Shurima icons (sun disc?) from the Shurima event, right?","replies":[]},{"poster":"Camille Ferrøs","date":"2018-03-09T13:54:32.361+0000","up_votes":1,"down_votes":0,"body":"Bilgewater is next after ionia  on the lore updates sooo we might see an icon","replies":[]},{"poster":"Digielf","date":"2018-03-11T09:30:35.803+0000","up_votes":1,"down_votes":1,"body":"The only regions that were untouched event-wise are Ionia and Bandle City","replies":[]}]}