{"poster":"TheRiverMonster","date":"2019-08-02T00:32:05.879+0000","title":"What is this job called","subforum":"Story, Art, & Sound","up_votes":2,"down_votes":1,"body":"With the new pantheon rework, he had a new story added on to his past story. Many new/reworked character often get narrative overhauls. What is the actual title of this job. I have no idea and have been trying to figure out for some time now. College is in a year for me and I really enjoy stories like that of these characters, so a career in this field could be an option for me.","replies":[{"poster":"Interlocutioner","date":"2019-08-02T01:28:10.522+0000","up_votes":14,"down_votes":1,"body":"Short answer, the job is called \"narrative writer\" here at Riot. (I was the narrative writer on Pantheon.)\n\nLonger answer. To write for games, my typical recommendation is for people to study screenwriting. It's the form of writing that's closest to a craft (like making a table), and not just art. It requires collaboration, clarity, and planning. It's repeatable and standardized. These are the kind of qualities that can help companies not waste millions of dollars. And if you have screenwriting (TV, movie, comic etc) credits, that helps on the job market too. It's a sign you have more than just ideas. You've built words and stories in the trenches.\n\nNo degree is required, though... it's about passion and luck, and talent, but talent only after the others. Passion and luck can carry you past the limitations of  talent, if you're willing to bleed into your keyboard. (Does it sound like I'm typing from experience? Because I'm typing from experience.)\n\nAnyway, one final bit of advice. If you want to write games... you should write games. It's easier than ever to build your own projects from the ground up. Easier than ever still means it's _really, really, really hard_. But getting past how hard it is is the first step. No one will hire you to write if you haven't already written. Put in work at the keyboard, chase every opportunity you can. Then wait for luck.","replies":[{"poster":"CaptainAntiHeroz","date":"2019-08-02T08:41:45.663+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Interlocutioner,realm=NA,application-id=6kFXY1kR,discussion-id=rIoMBG0E,comment-id=0001,timestamp=2019-08-02T01:28:10.522+0000)\n>\n> Short answer, the job is called \"narrative writer\" here at Riot. (I was the narrative writer on Pantheon.)\n> \n> Longer answer. To write for games, my typical recommendation is for people to study screenwriting. It's the form of writing that's closest to a craft (like making a table), and not just art. It requires collaboration, clarity, and planning. It's repeatable and standardized. These are the kind of qualities that can help companies not waste millions of dollars. And if you have screenwriting (TV, movie, comic etc) credits, that helps on the job market too. It's a sign you have more than just ideas. You've built words and stories in the trenches.\n> \n> No degree is required, though... it's about passion and luck, and talent, but talent only after the others. Passion and luck can carry you past the limitations of  talent, if you're willing to bleed into your keyboard. (Does it sound like I'm typing from experience? Because I'm typing from experience.)\n> \n> Anyway, one final bit of advice. If you want to write games... you should write games. It's easier than ever to build your own projects from the ground up. Easier than ever still means it's _really, really, really hard_. But getting past how hard it is is the first step. No one will hire you to write if you haven't already written. Put in work at the keyboard, chase every opportunity you can. Then wait for luck.\n\nYou were the narrative writer for Pantheon? Say no more, take this upvote","replies":[]},{"poster":"MalignMetal","date":"2019-08-02T01:47:02.219+0000","up_votes":1,"down_votes":0,"body":"That a RED i don't know.\n\nWelcome to the boards!\n\nIt's not all doom and  gloom down here.\n\nTell you friends.\n\nYour always welcome.","replies":[{"poster":"LordRedStone Nr1","date":"2019-08-02T02:12:56.111+0000","up_votes":2,"down_votes":0,"body":"He also did Nunu's updated stories (_Frozen Hearts_ and _Stone Cold_) iirc.\nBoth of these updates were very well done. [Edit:] Swain too? Wow.\nShame he doesn't have Twitter like most of the other writers.","replies":[{"poster":"MalignMetal","date":"2019-08-02T02:21:41.922+0000","up_votes":1,"down_votes":0,"body":"Twitter is overrated","replies":[{"poster":"LordRedStone Nr1","date":"2019-08-02T02:56:15.195+0000","up_votes":1,"down_votes":0,"body":"Not if you want to bother the writers for anything lore-related.","replies":[]}]}]},{"poster":"4 Step Cadence","date":"2019-08-02T01:55:50.839+0000","up_votes":2,"down_votes":0,"body":"I know, right? I had the same reaction when I saw him too.","replies":[]}]},{"poster":"xDogMeatx","date":"2019-08-07T04:47:15.633+0000","up_votes":1,"down_votes":0,"body":"does that mean basically old pantheon was a god then his celestial power faded then he turned mortal therefore reborn because his aspect form was killed (or was it?)? why does he have a celestial power/aura if hes a man?","replies":[]},{"poster":"DARCKD00M","date":"2019-08-07T04:42:53.953+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"4 Step Cadence","date":"2019-08-07T04:44:27.722+0000","up_votes":1,"down_votes":0,"body":"He's a writer. He can't do anything. Seriously, stop. You're just going to get your account banned for spamming.","replies":[]}]},{"poster":"4 Step Cadence","date":"2019-08-02T02:19:05.244+0000","up_votes":1,"down_votes":0,"body":"> No degree is required.\n\nI'd say that's a relief to hear that but then I remembered I don't really have a degree in anything. I'm sure you must need some sort of degree to get into the industry in general. I also have no job experience at all, so there's also that.\n\nThat being said, I really do appreciate you guys answering questions like this. Being someone who has wanted to get into game design/development since they were a really little kid, posts like this really help. So, thank you.\n\nAlso, I have to give credit to you guys for being the ones to get me back into wanting to work in this field. In the 2 years since I started playing this game, I've written and drawn more than I have in the past 10 years. Champion concepts, short stories, skin concepts/skin bios... A lot, really. So, thanks for that too.","replies":[]}]},{"poster":"KestrelGirl","date":"2019-08-02T00:45:30.350+0000","up_votes":3,"down_votes":0,"body":"Well, the first place to start is probably an English degree, 'cause that's typically what it takes to write champions' stories. But if you're more into the worldbuilding part, like me... Well, I'm majoring in history, but the worldbuilding folks have a wider variety of backgrounds. Geography and anthropology are fields worth checking out for sure, though the idea of majoring in them may be a little weirder. (*makes summoning circle for Bioluminescence, Riot's resident geography and cartography nerd*)","replies":[{"poster":"Bioluminescence","date":"2019-08-02T14:52:52.181+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=KestrelGirl,realm=NA,application-id=6kFXY1kR,discussion-id=rIoMBG0E,comment-id=0000,timestamp=2019-08-02T00:45:30.350+0000)\n>\n> Well, the first place to start is probably an English degree, 'cause that's typically what it takes to write champions' stories. But if you're more into the worldbuilding part, like me... Well, I'm majoring in history, but the worldbuilding folks have a wider variety of backgrounds. Geography and anthropology are fields worth checking out for sure, though the idea of majoring in them may be a little weirder. (*makes summoning circle for Bioluminescence, Riot's resident geography and cartography nerd*)\n\n\\* *It begins to glow* \\*\n\nI am a poor example to follow, unfortunately - my route to where I am now isn't a helpful template.\n\nI have no degree (I dropped out of two different courses - not something to be replicated!), worked in a shop for years, did some minor solo modding work, and due to one of the courses I was on, did a work placement in a real game studio (which opened my eyes to a lot of things).  Then I just applied cold to entry level, level designer positions.\n\nWhat I do, however, is learn.  worldbuilding, design, writing - it all thrives and lives through learning both deeply and broadly, and practice, practice, practice.  Practice with goals, deadlines, critical feedback (your own or other people's) and learning from it.  From deeply understanding that in any discipline there is more to learn than any one human can possibly achieve, so you better learn as much as you can, and ideally, move the state of the art forward for everyone else.  That's why it's scary, and that's why it's exciting!\n\nYou need to love learning, be willing to fall down a rabbit hole of research and experimentation, but remember to re-emerge in time for your deadlines.  You need to find connections between the most wildly unrelated topics and remix them in a way that will surprise and delight.  You need to be in a constant, info-sponge state, learning from the media you consume, the hobbies you enjoy, the places you visit (or live or lived), the people you meet - even the unexpected ones like your grandmother's stories or your train-seat buddy or the kid who just asked what you're playing on your phone/Switch.\n\nOther Rioters have the most _delightfully_ varied backgrounds - some with degrees in historical philosophy, in self driving AI, in marine biology, and all sorts - others who have worked as Alaskan crab fishermen!  Sometimes I wish we could run a regular lunchtime talk where Rioters with unexpected experience could share some of their knowledge and stories on those topics.  But again - that's because I really do believe that any of those subjects, and a billion others, have things to teach us that are relevant to design, worldbuilding, writing, and making interesting games in general.","replies":[]}]}]}