{"poster":"DerrickRose 1","date":"2017-05-22T17:06:01.869+0000","title":"ayuda por favor","subforum":"Charlas Generales","up_votes":2,"down_votes":1,"body":"Hola queria saber si puedo recuperar mi cuenta que mi hermano hizo banear permanentemente.... es muy flamer y jugo en mi cuenta por que la de el la banearon, y me terminaron baneando a mi, por favor inverti mucha plata y tiempo en esa cuenta, y me la uso sin mi permiso, hagan algo por favor yo no tengo la culpa o por lo menos devuelvanme la plata que inverti, si me la pueden dar en skins en esta cuenta o algo por favor, se los ruego","replies":[{"poster":"Ingratitud","date":"2017-05-22T17:12:51.280+0000","up_votes":2,"down_votes":0,"body":"Hola DerrickRose.\n\n1. Publicar de vuelta tu duda (~~respondida~~) por los foros se considera spamear, no te busques también un ban del foro =(\n\n1. Con respecto a tu duda, si no te gusta la respuesta de otros invocadores sobre que no te van a desbanear, contacta con soporte, planteles lo que comentas en los foros.\n\n Puedes mandar tu solicitud por aquí:\nhttps://support.riotgames.com/hc/es-419/requests/new\n\n___\n\nP.D.: No creo que te la devuelvan DerrickRose pero no pierdes nada intentando.","replies":[{"poster":"DerrickRose 1","date":"2017-05-22T17:30:35.519+0000","up_votes":1,"down_votes":0,"body":"no lo sabia, muchas gracias por la consideracion","replies":[]}]},{"poster":"TresBans","date":"2017-05-22T18:01:13.024+0000","up_votes":1,"down_votes":0,"body":"dale las gracias a #MiHermanoHizoQueBaneenMiCuentaRiotQQ\n\nexitos la cuenta es personal, una lastima que no cuides tu cuenta, no pases la cuenta y listo, el dinero de tus skins se fue, exitos empeza en una nivel 1 y no vuelvas a dejar jugar a tu hermano, o si eres tu, pasara lo mismo seras baneado :)","replies":[]},{"poster":"Sonya Kyron","date":"2017-05-22T17:56:30.048+0000","up_votes":1,"down_votes":0,"body":"Mira lo que podes hacer es pedir que la eliminen y crearte una nueva con el mismo correo electrónico y mismo nombre de invocador, creo que seria mas viable porque asi prácticamente recuperarías tu cuenta, solo que LVL 1 y sin nada adentro pero al menos tus amigos te volverían a agregar.","replies":[]},{"poster":"SeeYouLaterMorde","date":"2017-05-22T17:49:42.056+0000","up_votes":1,"down_votes":0,"body":"Enviale un ticket a Riot y muestra tu caso , no pierdes nada broo, suerte","replies":[]},{"poster":"SeeYouLaterMorde","date":"2017-05-22T17:35:55.952+0000","up_votes":1,"down_votes":0,"body":"Es clara tu historia y creible , pero Riot es implacable en estas normas ,  ya quee si te desbanean posiblemente tu hermano la seguira usando y seguira flameando (y te a baneen nuevamente), y sera un ciclo sin fin jajaja \nLo mejor es hacerte una de 0 y amarrar a tu hermano , para que no ocupe nunca mas un pc jajaj\nOjala tengas suerte broo saludos","replies":[{"poster":"DerrickRose 1","date":"2017-05-22T17:46:19.002+0000","up_votes":1,"down_votes":0,"body":"JAJAJAJA, sisi ya me cree una cuenta nueva la tengo en oro 4 en promo a oro 3, pero me da bronca, por que yo no hice nada, bueno dejo de molestar por el foto si esta perma ban ya esta, pero no costaba intentarlo","replies":[]}]},{"poster":"stos mens xdxd","date":"2017-05-22T17:36:26.533+0000","up_votes":1,"down_votes":0,"body":"ajajajaja","replies":[]},{"poster":"SeeYouLaterMorde","date":"2017-05-22T17:29:09.300+0000","up_votes":1,"down_votes":0,"body":"es obvio que no te la devolverán , aparte estas admitiendo que la uso tu hermano , eo esta contra la leyes de riot ya que la cuentas son personales , ojala te ayuden , pero lo dudo \n\npd: tu hermano definitivamente no le des mas tus claves o cuentas. Ya que el es el pto flamer y culpable","replies":[{"poster":"DerrickRose 1","date":"2017-05-22T17:31:31.445+0000","up_votes":1,"down_votes":0,"body":"yo jamas le di mi clave a mi hermano pero de pequeños siempre ponemos las mismas contraseñas nunca habia pasado, perocomo lo banearon a el, se ve que empezo a usar mi cuenta y como estudio y trabajo, casi ni juego un dia entre para tirar unas partidas y decia que estaba permabaneada y aparecian un monton de chats super flamers que era mi hermano","replies":[]}]},{"poster":"Axlbg","date":"2017-05-22T17:09:34.137+0000","up_votes":1,"down_votes":0,"body":"Entregaste los datos de la cuenta pero no el permiso para usarla? Por qué harías algo así?\nEstá prohibido compartir cuentas.","replies":[{"poster":"DerrickRose 1","date":"2017-05-22T17:30:09.484+0000","up_votes":1,"down_votes":0,"body":"no entregue nada, mi hermano y yo desde chicos usamos la misma contraseña nunca paso esto... lo banearon a el y bueno uso mi cuenta y como yo no juego mucho, por la facultad y el trabajo, un dia entre y estaba permabaneada...","replies":[{"poster":"Axlbg","date":"2017-05-22T17:31:14.584+0000","up_votes":1,"down_votes":0,"body":"Eso es entregar los datos por si no lo notaste.","replies":[]}]}]},{"poster":"Gexz Arg","date":"2017-05-22T17:31:03.834+0000","up_votes":1,"down_votes":0,"body":"Y como sabia tu hermano los datos para entrar a tu cuenta? es claramente culpa tuya y tu responsabilidad, Lo siento pero ya no podras recuperar la cuenta ni tampoco recuperar el dinero","replies":[]}]}