{"poster":"Krumble","date":"2019-03-11T03:56:32.183+0000","title":"Abysmal Banning System (OCE)","subforum":"Player Behaviour","up_votes":1,"down_votes":1,"body":"Isn't it cool how you can't name and shame people here, but they can call you the N-word, intentionally feed 0/10 before 15 minutes and harrass the rest of your team without getting suspended?\r\n\r\nIt feels like Riot is trying to keep as many customers playing to pay for skins and rune pages despite the blatantly unnacceptable toxicity. What has gaming come to.\r\n\r\n-Rep, I'd rather give Activision-Blizzard my bank account.","replies":[{"poster":"Ninox","date":"2019-03-11T05:53:19.802+0000","up_votes":4,"down_votes":0,"body":"Hate speech like racism is pretty much the fastest ways to see punishment. Rare is it that such offences don't result in a speedy 14-day ban, and even in those cases, more often than not there is a chat restriction involved.\n\nGameplay punishments are a bit tricker, and therefore slower. It's much more difficult for the system to distinguish \"bad game\" vs \"intent feeder\" than it is to distinguish \"said nothing\" vs \"used the n-word\". The unfortunate consequence is that gameplay offences are slow to be punished, as the system has to be confident it isn't punishing people just for being on a loss streak.\n\nIt's worth noting that just because someone is still playing and/or you didn't get any form of notification, doesn't mean they weren't punished. The first two tiers of punishment which most negative players will see are chat restrictions. Given that Riot doesn't share punishment history with any but the individual involved for a slew of reasons, there is no way for you to know if someone has received such a punishment. Bans are a bit more transparent since match history is public.\n\nIt's also worth noting that there is, in fact, a financial incentive for Riot to curb toxicity. Unhappy customers are not paying customers, and a single toxic player affects *many* others. Unfortunately, it also remains true that for the game to remain so accessible, accounts are easy to create. Given that it's a FTP game, even more so. The result is that those whoa re determined enough will find ways. \n\nThere will always be toxic players in online communities, because there will always be assholes who don't care about anyone but themselves, and the internet offers anonymity. FTP games, unfortunately, attract this sort of person. It's impossible to remove toxicity entirely, and you also have to consider how much you are willing to sacrifice to hinder it. \n\nYou could ban anyone who gets under a certain KDA in a game and would catch or curb pretty much all the intent feeders, but you'd also hit a lot of innocent players with such a measure. You could ban anyone who uses a non-meta build for trolling, but you'd stifle creativity in builds, basically freeze the player created meta, and again, hit a lot of innocent players who have worked hard to make their niche picks work. You get the idea.","replies":[]}]}