{"poster":"St0Rm3X","date":"2015-03-01T19:16:42.575+0000","title":"2 Spieler (Silber IV / Bronze I) suchen Ranked Team","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Wir zwei sind relativ erfahrene Spieler, wir suchen ein Team das nicht nur fixiert auf ein Hohes Rating ist, sondern auch Spaß versteht und nicht nach den Ranking Games sich auflöst. Gerne auch mit festen Trainingszeiten und regelmäßigen Spielen (Ranked, so wie Normals). Es sollte ein netter Umgang vorhanden sein und auch Fehler verziehen werden. Auch für DuoQ und ARAM oder andere Dummheiten sind wir zu haben. Ich denke eine gewisse Reife darf man voraussetzen. \r\n\r\n--------------------------------------------------------------------------------------------------------------------------------------------------\r\n\r\n1. St0Rm3X (0=null) (m/21) selber noch in der Ausbildung und interessiert an einem Hohen Rankedteamziel. Main Lane ist ADC, kann aber auch Supporten oder den Jungle unsicher machen. Meine Mains als ADC: {{champion:51}} , {{champion:18}}  // Support: {{champion:267}} , {{champion:89}}  // Jungle: {{champion:113}} , {{champion:111}} , {{champion:154}} . Division: Silber 4\r\n---------------------------------------\r\n2. GbsSkyyy (m/21) ebenfalls in der Ausbildung. Main Lane ist Mid, kann ebenfalls Supporten und auch als ADC steht er zur Verfügung. Seine Mains in der Mid: {{champion:90}} , {{champion:1}} , {{champion:25}}  // Support: {{champion:37}} , {{champion:89}} , {{champion:1}}  // ADC: {{champion:21}} ,   {{champion:22}} , {{champion:236}} \r\n\r\n--------------------------------------------------------------------------\r\n\r\nÜber möglich Veränderungen der Lanes oder Mains, kann man natürlich Situationsbedingt reden und auch fürs Team arbeiten. Über ein Persönliches Gespräch würden wir uns freuen und Hoffen das wir uns bald auf den Richtfeldern der League wieder sehen.\r\n\r\nTS3 und Skype natürlich vorhanden:)\r\n\r\nBis Bald euer St0Rm3X und GbsSkyyy","replies":[]}