{"poster":"GTHell","date":"2016-05-24T16:08:01.859+0000","title":"Is Lyte ruining this game's community?","subforum":"Player Behavior","up_votes":5,"down_votes":43,"body":"It&#039;s ok to intentionally feed, but it&#039;s not ok to blame the troll or to tell your team mate to team up.\n\nPlayer1: &quot;Teemo wtf are you doing, stop feeding&quot; = BAN\nPLayer2: Say nothing, troll all game, feed all game = FREE\n\n[](https://www.youtube.com/watch?v=1eWWtcYelw4)\n\nWhy Lyte treating us like we are a in the kindergarten atmosphere!!!!","replies":[{"poster":"The Deckowner","date":"2016-05-24T16:13:37.060+0000","up_votes":13,"down_votes":1,"body":"You know Lyte no longer work for Rito anymore.","replies":[]},{"poster":"Randomonium","date":"2016-05-24T16:13:31.656+0000","up_votes":12,"down_votes":3,"body":"Please show me where a Rioter has ever said it's OK to intentionally feed.","replies":[{"poster":"GTHell","date":"2016-05-24T16:21:36.663+0000","up_votes":2,"down_votes":20,"body":"They didn't say but usually they have no system to detect that or they will assume that the player is newbie.","replies":[{"poster":"Randomonium","date":"2016-05-24T16:30:09.951+0000","up_votes":9,"down_votes":1,"body":"Yet again, show me where they say they don't have a system to detect this. You are making strawman arguments with no evidence. That is why you are getting downvoted.","replies":[{"poster":"GTHell","date":"2016-05-24T16:36:44.061+0000","up_votes":2,"down_votes":17,"body":"I'm making a conclusion. If they actually has that system, there might be no bronze or people wouldn't waste time download this game. Riot said they won't punish player for their skill which mean that feeder are going to feed. Use your instinct. What is your IQ of Abstract/logic reasoning?","replies":[{"poster":"Randomonium","date":"2016-05-24T16:56:05.100+0000","up_votes":11,"down_votes":1,"body":"You are making a conclusion without any evidence whatsoever. I've seen fundamental Christians which more logical arguments than this.\n\nWhy would Riot Institute a system that would encourage people to not download the game? They are a business, if they aren't profitable then the company goes out of business and the game shuts down.\n\nYour definition of bad and your definition of feeding are subjective. If I put you with challenger players you would feed your ass off. Does that mean you should be banned? Of course not because you're not doing it intentionally, you are just playing against people much better than you.\n\nAll games struggle with this issue, matching people of comparable ability levels up against each other. Considering all the variables in a 5v5 game I think Riot does a pretty good job with their ranked matchmaking. Yeah some games are a stomp but most games seem fairly competative.\n\nI have a Masters degree in mechanical engineering and I'm certified by the US government to run a nuclear reactor. I can pretty much max out any IQ test I'm given simply because of the amount of knowledge/training I have.  IQ tests are really kind of pointless if you aren't near the center of the bell curve. Personally, I've always found comparing IQ numbers pointless since IQ score is only one of many ways to determine intelligence but since you asked as a child I scored in the 150s. Does that answer your question?","replies":[{"poster":"Rand0mH3r0X","date":"2016-05-26T11:18:12.800+0000","up_votes":1,"down_votes":0,"body":"Does everybody with Rand0m in their name have to be a Mechanical Engineer.","replies":[{"poster":"Randomonium","date":"2016-05-26T13:11:44.118+0000","up_votes":1,"down_votes":0,"body":"Yep, pretty sure it's a federal law.","replies":[]}]}]},{"poster":"Verxint","date":"2016-05-24T16:44:40.461+0000","up_votes":9,"down_votes":2,"body":"This post is an impressive trainwreck","replies":[]},{"poster":"BeatzBoyFTW","date":"2016-05-24T16:42:46.831+0000","up_votes":9,"down_votes":2,"body":"> Riot said they won't punish player for their skill which mean that feeder are going to feed.\n\nThere's a difference between Intentional Feeding & feeding due to being inexperienced. Get it in your head.","replies":[{"poster":"GTHell","date":"2016-05-24T16:49:11.086+0000","up_votes":2,"down_votes":12,"body":"Which algorithm did they use to differentiate between Intentional Feeding & feeding due to being inexperienced? If the player not going to chat then there is no way they can detect that. Don't make yourself look like a fool.","replies":[{"poster":"Wulf Helhammer","date":"2016-05-24T17:20:08.863+0000","up_votes":6,"down_votes":1,"body":"It's called making a habit out of it.\n\nIntentional feeders are quite evident when they do it repeatedly. People who are just out skilled get better over time","replies":[]}]}]}]}]},{"poster":"Prandine","date":"2016-05-24T16:25:23.328+0000","up_votes":6,"down_votes":3,"body":"> [{quoted}](name=GTHell,realm=NA,application-id=ZGEFLEUQ,discussion-id=VhqWFiiq,comment-id=00030000,timestamp=2016-05-24T16:21:36.663+0000)\n>\n> They didn&#x27;t say but usually they have no system to detect that or they will assume that the player is newbie.\n\nWhere's your proof? They do have systems to detect them but they have to make sure that the person in question is actually intentionally trolling/feeding and not just having a bad game.","replies":[{"poster":"GTHell","date":"2016-05-24T16:31:09.763+0000","up_votes":2,"down_votes":9,"body":"Just keep tracking the feeder and go on LoLking. If he active then you know that he wont get ban. I wish I could post his name. My friend got his name. That dude might having a mental problem because he keep feeding every single games.","replies":[]}]}]},{"poster":"TSwift Is Sexy","date":"2016-05-25T14:26:49.716+0000","up_votes":1,"down_votes":0,"body":"I saw a guy that literally had over 150 games with an average KDA of 0/30/1.5. His match history showed that 100% of his deaths were directly down the mid lane, typically under towers.","replies":[{"poster":"Randomonium","date":"2016-05-25T15:02:57.197+0000","up_votes":2,"down_votes":1,"body":"I don't really see your point. Every system has exceptions. People get off on technicalities for rape and murder all the time. Does that mean we should abolish the legal system?\n\nEven a broken clock is right twice a day. Just because you can show me one guy who fed and didn't get punished doesn't mean the system is broken or that Riot condones feeding.","replies":[{"poster":"TSwift Is Sexy","date":"2016-05-25T20:55:47.190+0000","up_votes":1,"down_votes":0,"body":"So you're saying that we should ignore the legal system and ignore people that \"get off\" easily for rape and murder because the system does a decent job most of the time?\n\nThere are a lot more than this one case. You can troll as long as you aren't typing mean things into chat. That's simply the rules. My point is that going 0-60-1 shouldn't be allowed.","replies":[{"poster":"Randomonium","date":"2016-05-25T21:54:04.141+0000","up_votes":2,"down_votes":0,"body":"No, I'm saying don't throw the baby out with the bath water.  The system is pretty dang good right now but there's always room for improvement.\n\nWhen people bring up these cases where someone goes 0-60-1 I often ask them \"did you report the guy?\"  The answer is usually no because people feel like there's no point in reporting the person because they don't think anything will come of it.  That's a self fulfilling prophecy.  It would be like witnessing a crime, not calling 911, and then complaining about how the cops never do anything about all the crime in your neighborhood.  All systems are dependent upon everyday people to report infractions.  League is no different.  If you want people to get banned for that kind of stuff then you have to report.  If you don't report then you can't really fault Riot when they don't get banned.\n\nIntentionally feeding isn't allowed.  The fact that you would even suggests that it is shows that you haven't bothered to even read Riot's terms of use or their summoner's code.  Hell one of the report options is specifically lists \"intentionally feeding\" in it.","replies":[{"poster":"TSwift Is Sexy","date":"2016-05-25T21:57:41.160+0000","up_votes":1,"down_votes":1,"body":"Cool, running into tower is 'sometimes' punishable. You know what isn't? Going and sitting in the jungle while the enemy team pushes inhibs. Is this intentionally losing? Yes. Is it punishable? No.","replies":[{"poster":"Randomonium","date":"2016-05-26T01:01:53.523+0000","up_votes":1,"down_votes":0,"body":"It is punishable if the person is trying to intentionally lose.  Proving that they were trying to intentionally lose is the hard part.    You can't ban people unless you are sure that they were intentionally trying to lose.  You wouldn't want Riot to ban you just because you had some bad games right?","replies":[{"poster":"TSwift Is Sexy","date":"2016-05-26T08:24:29.567+0000","up_votes":1,"down_votes":0,"body":"It would honestly take a human 30 seconds to watch a game and determine it. But they're too wrapped in punishing the players that say, \"wtf are you doing dude\" to worry about that. So, you will continue to have a \"toxic\" community until the issues resulting in \"toxicity\" are addressed. No way around it. Lyte can ban all the accounts he wants. Obviously doesn't work though.","replies":[{"poster":"Randomonium","date":"2016-05-26T09:43:09.226+0000","up_votes":1,"down_votes":1,"body":"You really want the fate of your account determined by a 30 second review?  There are millions of people who play this game every day.  Even a 30 second review of every person reported would take thousands or tens of thousands of man hours a day.  An automated system is a far better solution.  And no, people aren't just punished for saying \"wtf are you doing dude.\"\n\nThere will always be a toxic community because this is a free to play game.  It has nothing to do with the banning system.  Riot's system is one of the most advanced of any game.  However, the free-to-play model allows the small percentage of the toxic player base to keep coming back over and over.  There's no real way to stop it.  Riot is literally playing \"wack-a-mole\" and as long as there are toxic losers who are willing to waste their time to level up a new account we will continue to have toxic people in the game.\n\nWe could eliminate toxicity if we could actually find a way to permanently ban toxic people, not just their accounts, but I don't know of any way to reliably do that and obviously Riot doesn't either.  I'm certainly open to suggestions though.","replies":[{"poster":"TSwift Is Sexy","date":"2016-05-26T09:54:51.013+0000","up_votes":1,"down_votes":0,"body":">You really want the fate of your account determined by a 30 second review?\n\nI never limited it to that. I simply said that's all it would take. It actually could take a lot less. If I looked at a report for intentionally feeding and the player was 0-60-1, banned. I would LOVE to get the statistics on how many normally neutral/positive players were report for \"toxicity\" as a result of being on this guy's team that averaged going 0-30-1 over the course of at least 150 games. I think the stats on that would be very favorable to my argument. But, it wouldn't favor rito, so they would never release something like that.\n\n>Even a 30 second review of every person reported would take thousands or tens of thousands of man hours a day. An automated system is a far better solution.\n\nThey claim that chat bans aren't 100% automated, and that a person review the case (except in extreme cases). So if they have the time for that, why don't they have the time for this? Obviously they could use an automated system to at least flag accounts that have multiple complaints of throwing games, not every single account that is report for intentionally feeding. Progress.\n\n>There will always be a toxic community because this is a free to play game.\n\nAgree to a point. But if this is an argument against implementing an improved system for trolling, then shouldn't it be an argument for not wasting time on chat related toxicity?\n\n>And no, people aren't just punished for saying \"wtf are you doing dude.\"\n\nI've seen less lol.\n\n>However, the free-to-play model allows the small percentage of the toxic player base to keep coming back over and over. There's no real way to stop it. Riot is literally playing \"wack-a-mole\" and as long as there are toxic losers who are willing to waste their time to level up a new account we will continue to have toxic people in the game.\n\nWell, rito did basically HALF the time it took to reach level 30. So, I would say they are encouraging it. Why? They hope those players buy more skins.\n\n>We could eliminate toxicity if we could actually find a way to permanently ban toxic people, not just their accounts, but I don't know of any way to reliably do that and obviously Riot doesn't either. I'm certainly open to suggestions though.\n\nThere really isn't....because IP bans simply won't work. People share computers all the time to play the game. It would help, however, by simply becoming more strict. You spam n**ger in chat? Automatic permaban. You go 0-60-1 in a match? Automatic permaban. Kids will eventually get tired of creating accounts. You remove the XP decrease required to reach level 30. That discourages players from doing this. It also gives new players more games to learn to play before jumping into ranked. Honestly this was one of the dumbest changes rito made. It has so many negative consequence with only 1 benefit....and that's assisting smurfs. Which is bullshit.","replies":[{"poster":"Randomonium","date":"2016-05-26T11:15:58.689+0000","up_votes":1,"down_votes":0,"body":"Pretty much everything you are talking about they are already working on.  Its definitely not a perfect system (nor will it ever be) but its a whole hell of a lot better than any other game I've seen.  Constructive criticism is fine but all these people talking about how the system is \"broken\" or \"crap\" are  just salty because they got their accounts punished/banned for acting like asses.  People do get banned for trolling.  People do get banned for intentionally feeding.  Does it happen more than people who get banned for toxicity?  No.  The reason for that is its much harder to detect and prove.  Riot isn't going to ban someone unless they can prove without a shadow of a doubt that the person deserved their permaban.  I've seen people who go 0/60 who get banned pretty damn fast.  But what about the guy who goes 3/11?  Is he intentionally feeding or just having a bad game?  You're making it out to be a black and white issue when most of these cases are very, very gray.","replies":[{"poster":"TSwift Is Sexy","date":"2016-05-26T11:34:42.296+0000","up_votes":1,"down_votes":1,"body":"Halo is pretty good about banning players that troll. What's the result? I rarely see people trolling in it. \n\n>The reason for that is its much harder to detect and prove. Riot isn't going to ban someone unless they can prove without a shadow of a doubt that the person deserved their permaban. I've seen people who go 0/60 who get banned pretty damn fast.\n\n0-30-1 is without a doubt trolling. Automated system can instantly ban players that do it. \"oh but ive seen some players get punished for it.\" Well, it should be 100%. Instantly. Not \"eventually\". Not after ruining 1000 players' games, probably leading them to be 'toxic' and punished. This community is so damn worried about hurting people's feelings that they don't want to take action against anything that isn't \"omg he said mean word\". I mean ffs, I've literally saw chat logs that they dude said 3 things: gl hf, gg, and \"please report X for calling me the n-word. thanks\". If you're so sensitive that you consider that \"toxic\", you honestly need to seek medical help. Because that is no way to live life. It's embarrassing. \n\n>But what about the guy who goes 3/11? Is he intentionally feeding or just having a bad game? You're making it out to be a black and white issue when most of these cases are very, very gray.\n\nEasily determinable by a logical person.","replies":[]}]}]}]}]}]}]}]}]}]}]}]},{"poster":"IronwallJackson","date":"2016-05-24T16:13:03.562+0000","up_votes":12,"down_votes":3,"body":"First of all, Lyte already left Riot Games. Second, intentional feeding isn't allowed. And finally, is English not your mother tongue? Because your post is a disaster zone.","replies":[{"poster":"GTHell","date":"2016-05-24T16:24:02.755+0000","up_votes":2,"down_votes":15,"body":"You're smart to figure out that English is not my mother tongue. Your IQ might be below average.","replies":[{"poster":"Vistha Kai","date":"2016-05-24T18:17:58.915+0000","up_votes":7,"down_votes":0,"body":"I wonder, were you by any chance banned?","replies":[{"poster":"GTHell","date":"2016-05-25T05:23:14.587+0000","up_votes":1,"down_votes":7,"body":"My Other account account get ban. Thank it has no skins at all.","replies":[{"poster":"Vistha Kai","date":"2016-05-25T13:38:55.423+0000","up_votes":3,"down_votes":0,"body":">My Other account account get ban.\n\nFigured out this much. Just wanted to make sure.","replies":[]}]}]}]}]},{"poster":"Prandine","date":"2016-05-24T16:12:43.054+0000","up_votes":7,"down_votes":2,"body":"Okay, a couple of things.\n\n1. Lyte no longer works for Riot-he left to pursue other challenges of his own free will.\n2. Trolls and feeders do get banned just like verbally abusive jerks do. You just don't see many people complaining about those kinds of bans as not only does it takes longer to track than chat-related issues, but usually more often than not the person in question was also being a verbally abusive jerk in the chat as well.\n3. We're not in a kindergarten atmosphere, so we should stop acting like we are. This means not yelling and screaming and intentionally trying to screw other people over when we don't get our ways.","replies":[{"poster":"GTHell","date":"2016-05-24T16:28:59.875+0000","up_votes":2,"down_votes":10,"body":"Troll and Feeder usually never get ban because riot has no system to detect that. They only ban toxic player. Here I will give a good example of that:\n\n1. There was a troll in one of my game and he instalock the lane that other summoner called already he said that I don't care and then start to swearing F*** YOU.\n2. In the game, where chat log can be collectable, the instalock dude say nothing and just playing his game. And the summoner who actually called that lane was so mad that he went on feeding spree and become so toxic toward that instalock troll. \n3. I report them both and keep their name list for a future research.\n4. After sometime, The summoner who toxic got ban while the troller instalock enjoying trolling and feeding other game.\n\nI use various website to check those player data. It's sad but true.","replies":[{"poster":"Prandine","date":"2016-05-24T16:35:19.075+0000","up_votes":5,"down_votes":2,"body":"> [{quoted}](name=GTHell,realm=NA,application-id=ZGEFLEUQ,discussion-id=VhqWFiiq,comment-id=00010000,timestamp=2016-05-24T16:28:59.875+0000)\n>\n> Troll and Feeder usually never get ban because riot has no system to detect that. They only ban toxic player. Here I will give a good example of that:\n> \n> 1. There was a troll in one of my game and he instalock the lane that other summoner called already he said that I don&#x27;t care and then start to swearing F*** YOU.\n> 2. In the game, where chat log can be collectable, the instalock dude say nothing and just playing his game. And the summoner who actually called that lane was so mad that he went on feeding spree and become so toxic toward that instalock troll. \n> 3. I report them both and keep their name list for a future research.\n> 4. After sometime, The summoner who toxic got ban while the troller instalock enjoying trolling and feeding other game.\n> \n> I use various website to check those player data. It&#x27;s sad but true.\n\nSo you intentionally hound them just so you can see if they're still playing or not? Why?  I fail to see how that is in any way productive. Also, just because they weren't punished in the game that you were with them in doesn't mean that they'll never be punished. Some people just take longer to track than others do (that, and/or they have already received their punishments and worked them off already). Those are only two players out of millions though. If you have proof that trolls and feeders never get punished then please feel free to post a link to it here.","replies":[{"poster":"GTHell","date":"2016-05-24T16:41:05.021+0000","up_votes":2,"down_votes":9,"body":"Stop being a hypocrite. One time you will get ban and you'll learn that. Stop protecting thing that is worst. I'm not here to blame, I'm here to improve the system.","replies":[{"poster":"Prandine","date":"2016-05-24T17:03:05.444+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=GTHell,realm=NA,application-id=ZGEFLEUQ,discussion-id=VhqWFiiq,comment-id=0001000000000000,timestamp=2016-05-24T16:41:05.021+0000)\n>\n> Stop being a hypocrite. One time you will get ban and you&#x27;ll learn that. Stop protecting thing that is worst. I&#x27;m not here to blame, I&#x27;m here to improve the system.\n\nI've been playing since the Season 2 Snowdown Showdown and though I sometimes talk quite a bit in some games I have never been warned nor banned. Reason being is that I don't intentionally try to say or do anything that I know will get me punished. Also, I'm not protecting anyone, I'm simply stating the facts provided by Riot. You're the one who is yelling at and arguing with people who don't agree with you and ask you for proof to back up your claims. If you don't want to listen to them that's fine, but don't go yelling at people who won't give you the Yesman answers that you appear to want.","replies":[]}]}]}]}]},{"poster":"Thanetiore","date":"2016-05-24T18:15:42.875+0000","up_votes":2,"down_votes":0,"body":"\"WTF, stop feeding\" is btw not a very productive way to communicate with your teammates. Obviously 99.27% of the players don't really want to feed like all hells, so this citation of yours is in my eyes in fact exactly raging / unsportsmanlike conduct.\n\nWhile just seeing this line would not necessarily result in a report from my side, considering you already made multiple discrediting remarks about peoples IQ, et cetera, this goes a long way in showing your biased opinion on what should be considered a punishable offense and what not.\n\nNow I - like everyone - obviously don't want to have a troll / intentional feeder in my team, but as was said earlier, it is hard to tell for what reason someone is underperforming. Matchmaking is not perfect either and I can't count how often I had people telling me I should report this and that person for being a bad player, which makes me question their understanding of the game or the social world we live in in general.","replies":[]},{"poster":"Awkward Couch","date":"2016-05-24T16:16:12.281+0000","up_votes":4,"down_votes":2,"body":"https://www.reddit.com/r/LeagueOfMeta/comments/49k7t1/dotot_banned_until_march_21st/\n\nhttps://www.reddit.com/r/leagueoflegends/comments/4j8oq5/therainman_banned_25_minutes_after_the_reddit_post/\n\nTotally Intentional feeding and trolling is never punished.  /s","replies":[{"poster":"GTHell","date":"2016-05-24T16:34:30.667+0000","up_votes":2,"down_votes":9,"body":"You don't get ban for 1 game. It's has its step.","replies":[{"poster":"Awkward Couch","date":"2016-05-24T17:49:33.696+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=GTHell,realm=NA,application-id=ZGEFLEUQ,discussion-id=VhqWFiiq,comment-id=00060000,timestamp=2016-05-24T16:34:30.667+0000)\n>\n> You don&#x27;t get ban for 1 game. It&#x27;s has its step.\n\nYou say in your original post that feeders don't get punished, these two links I provided show that you are incorrect.","replies":[]},{"poster":"Prandine","date":"2016-05-24T17:27:55.244+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=GTHell,realm=NA,application-id=ZGEFLEUQ,discussion-id=VhqWFiiq,comment-id=00060000,timestamp=2016-05-24T16:34:30.667+0000)\n>\n> You don&#x27;t get ban for 1 game. It&#x27;s has its step.\n\nYou're right, normally you don't get punished for just one game alone. If it's severe enough though then yes you can be punished for just one game alone.","replies":[]}]}]},{"poster":"GTHell","date":"2016-05-24T16:52:06.474+0000","up_votes":2,"down_votes":13,"body":"All these people are going to down vote because they are so dumb to accept the true. You think you're helping this community? No. I'm here not to blame but to improve the system. Lyte gone and who else next and what is his strategy? Maybe being a coward for the rest of your life.","replies":[{"poster":"Kei143","date":"2016-05-24T18:02:10.490+0000","up_votes":6,"down_votes":0,"body":"no .. the truth is that the intentional feeding teemo gets banned as well.","replies":[]}]},{"poster":"Sarutobi","date":"2016-05-24T16:11:56.987+0000","up_votes":4,"down_votes":3,"body":"First off I guess you didn't read that Lyte step down (or quit I'm not too sure) so he no longer works for League/Riot. Let alone I don't get why people solely blamed him when he was just one person working at the company. Yes he probably played a big role, but the company is a community they usually all have to agree for something to get implemented there usually isn't one sole person that gives the orders.\nSecond, who said feeding was ok? As far as I know it's a reportable offense, and people do get ban. I've seen a couple post on here of people complaining about their \"feeding\" ban saying it was just one bad game. But people do get ban for it, not sure where your evidence is that it's ok, and not banable.","replies":[{"poster":"GTHell","date":"2016-05-24T16:23:17.489+0000","up_votes":2,"down_votes":7,"body":"In management class I learn that people never blame the employee if the product of their company made mistake but they blame the manager. So the one who play a big role is the one who take all the blame.","replies":[]}]},{"poster":"Lost R","date":"2016-05-24T17:24:02.105+0000","up_votes":2,"down_votes":1,"body":"No, the community is ruining the community through rampant stupidity and a complete lack of perception, basic cognition, defeatism and paranoia. The people who get themselves banned, I see the kind of shit they write, and it's nowhere near as innocent as what you're implying. And people consider playing Ziggs or not banning Zed trolling these days, so the word has basically no meaning anymore. Not here, anyways.\n\nBesides, Lyte left Riot a few weeks ago.","replies":[]},{"poster":"proud and bronze","date":"2016-05-25T05:38:53.305+0000","up_votes":1,"down_votes":5,"body":"lyte got fired dude.  he is gone","replies":[{"poster":"Firu","date":"2016-05-25T13:48:32.350+0000","up_votes":2,"down_votes":1,"body":"No one has ever commented officially that Riot left because he was fired.  Most seem to think (based on his comments and those from other Rioters) is that it was for personal reasons.","replies":[{"poster":"proud and bronze","date":"2016-05-25T14:06:03.708+0000","up_votes":1,"down_votes":4,"body":"companies like riot do not fire people publicly unless they have done somethign criminally wrong.","replies":[{"poster":"Firu","date":"2016-05-25T14:25:06.566+0000","up_votes":1,"down_votes":0,"body":"Yes. But why assume he was fired without any evidence of it? Isn't the other option just as likely? Also, statistically, people are far more likely to turnover for voluntary reasons than involuntary ones.  And either way, regardless of why he left, does it matter to the Player Behavior System? Riot was one employee among many.  While he did have a big say in the direction of things, I doubt he was given unilateral approval to do whatever he wanted.  He had to get permission or get agreement on major things.  Thus, there are probably many employees still at Riot who agree with his general philosophy.","replies":[{"poster":"proud and bronze","date":"2016-05-25T15:23:33.649+0000","up_votes":1,"down_votes":0,"body":"just read his goodbye letter if you care.  its pretty clear it wasnt his choice from that alone.","replies":[]}]}]}]}]}]}