{"poster":"WECRY That Noob","date":"2015-12-09T19:26:11.767+0000","title":"Team WCE cerca ADC PlatV+","subforum":"Reclutamento","up_votes":2,"down_votes":0,"body":"Ciao\n\nMi chiamo Carlo e faccio parte del Team WCE creatosi qualche mese fa e composto da una decina di persone di elo Plat/Dia.\nSiamo molto attivi in orari serali (dalle 19.00 in poi).\nCi divertiamo a giocare insieme e apprezziamo l&rsquo;aspetto competitivo infatti, oltre ad allenare strategie e fare ranked, partecipiamo a molti tornei, praticamente ogni settimana, che si tratti di ESL, Faceit, Eventi organizzati da community o altro.\nAbbiamo un buon affiatamento e, anche se non siamo Diamonds alti, riusciamo spesso ad ottenere buoni risultati in competitivo. Siamo arrivati, ad esempio, fino agli ottavi del torneo italiano di Battlegrounds, top 16 su 253 teams.\nAbbiamo un server TS privato e un paio di persone esterne che ci fanno di tanto in tanto da coach e ci analizzano i games.\nAbbiamo un&rsquo;et&agrave; che va dai 22 anni in su.\n\nMa veniamo al dunque.\n\nDall&rsquo;esigenza di giocare tutti con costanza e continuit&agrave;, abbiamo deciso di formare un ulteriore team composto da alcuni di noi e da chi, di voi, avr&agrave; il desiderio e le qualit&agrave; per unirsi a questo progetto.\nIl team cos&igrave; creato, godr&agrave; di tutti i benefici di cui gode quello gi&agrave; esistente quindi, a parte il TS, un paio di canali per streammare (eventualmente) e un embrione di promozione qu&agrave; e l&agrave; sui socials , tutta la parte organizzativa (iscrizione a tornei, reminder e schedulazioni varie) e la parte di pensiero, sia legata al coach/analyst, che legata a quello che produciamo al nostro interno, oltre che, ovviamente, l&rsquo;essere parte di un bel gruppo di persone che condividono la stessa passione e gli stessi valori nel giocare e nello stare insieme con gli altri.\n\nApriamo quindi una Call finalizzata alla ricerca di un ADC di elo (preferibilmente) Plat V+ e di et&agrave; (preferibilmente) simile alla nostra (22-28), che sia disponibile, con buona costanza, in orari serali e che, ovviamente, abbia voglia di crescere insieme al progetto, di competere e di condividere.\n\n\nSe avete qualche dubbio o domanda mi potete aggiungere in game (IGN: WECRY That Noob) .\n\nP.S.\n\nSe non rientrate nei requisiti (ma vi avvicinate) e vi interesserebbe partecipare aggiungetemi in game,vi ricontatteremo.","replies":[{"poster":"imPeeck","date":"2015-12-09T19:46:17.201+0000","up_votes":1,"down_votes":0,"body":"Ti ho aggiunto, più o meno i requisiti ci sono, aspetto notizie.","replies":[]}]}