{"poster":"SLF BloodMoon","date":"2016-10-21T11:06:42.061+0000","title":"Having 500ms-700ms for alomst 2 months every singel game","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"i've played league for like 3 years and its always have been fine with my ms but since 2 months i started to have 500-700ms every singel game where i could not enjoy the game at all i've tried everything to fix my internet connection but nothing seems to work now i've made this test and this is the result but i dont know what to do because i have no idea what it all means please help \r\n\r\n    Certain UDP protocols are blocked in outbound traffic\r\n    Network packet buffering may be excessive\r\n    We detected an HTTP proxy due to flow content changes\r\n    Unable to fetch DNSSEC information from the roots \r\n\r\nAddress-based Tests + –\r\nNAT detection (?): NAT Detected\r\n+\r\nLocal Network Interfaces (?): OK\r\n+\r\nDNS-based host information (?): OK\r\n+\r\nNAT support for Universal Plug and Play (UPnP) (?): Not found\r\n+\r\nReachability Tests + –\r\nTCP connectivity (?): OK\r\n+\r\nUDP connectivity (?): Note\r\n–\r\nBasic UDP access is available.\r\n\r\nThe client was able to send fragmented UDP traffic.\r\n\r\nThe client was able to receive fragmented UDP traffic.\r\n\r\nUDP access to remote DNS servers (port 53) appears to pass through a firewall or proxy. The client was unable to transmit a non-DNS traffic on this UDP port, but was able to transmit a legitimate DNS request, suggesting that a proxy, NAT, or firewall intercepted and blocked the deliberately invalid request.\r\n\r\nA DNS proxy or firewall caused the client's direct DNS request to arrive from another IP address. Instead of your IP address, the request came from 176.95.17.36.\r\n\r\nA DNS proxy or firewall generated a new request rather than passing the client's request unmodified.\r\nDirect UDP access to remote NTP servers (port 123) is allowed.\r\nDirect UDP access to remote NetBIOS NS servers (port 137) is allowed.\r\nDirect UDP access to remote NetBIOS DGM servers (port 138) is allowed.\r\nDirect UDP access to remote IKE key exchange servers (port 500) is allowed.\r\nDirect UDP access to remote OpenVPN servers (port 1194) is allowed.\r\nDirect UDP access to remote Slammer servers (port 1434) is allowed.\r\nDirect UDP access to remote L2 tunneling servers (port 1701) is allowed.\r\nDirect UDP access to remote IPSec NAT servers (port 4500) is allowed.\r\nDirect UDP access to remote RTP servers (port 5004) is allowed.\r\nDirect UDP access to remote RTCP servers (port 5005) is allowed.\r\nDirect UDP access to remote SIP servers (port 5060) is allowed.\r\nDirect UDP access to remote VoIP servers (port 7078) is allowed.\r\nDirect UDP access to remote VoIP servers (port 7082) is allowed.\r\nDirect UDP access to remote SCTP servers (port 9899) is allowed.\r\nDirect UDP access to remote Steam gaming servers (port 27005) is allowed.\r\nDirect UDP access to remote Steam gaming servers (port 27015) is allowed.\r\nTraceroute (?): OK\r\n+\r\nPath MTU (?): OK\r\n+\r\nHidden Proxy Detection (?): OK\r\n+\r\nNetwork Access Link Properties + –\r\nNetwork performance (?): Latency: 150 ms, Loss: 0.0%\r\n+\r\nTCP connection setup latency (?): 120ms\r\n+\r\nBackground measurement of network health (?): no transient outages\r\n+\r\nNetwork bandwidth (?): Upload 870 Kbit/s, Download 4.6 Mbit/s\r\n+\r\nNetwork buffer measurements (?): Uplink 900 ms, Downlink 140 ms\r\n–\r\nWe estimate your uplink as having 900 ms of buffering. This level can in some situations prove somewhat high, and you may experience degraded performance when performing interactive tasks such as web-surfing while simultaneously conducting large uploads. Real-time applications, such as games or audio chat, may also work poorly when conducting large uploads at the same time.\r\nWe estimate your downlink as having 140 ms of buffering. This level may serve well for maximizing speed while minimizing the impact of large transfers on other traffic.\r\nHTTP Tests + –\r\nAddress-based HTTP proxy detection (?): OK\r\n+\r\nContent-based HTTP proxy detection (?): Warning\r\n–\r\n\r\nChanges to headers or contents sent between the client and our HTTP server show the presence of an otherwise unadvertised HTTP proxy.\r\n\r\nThe following headers had their capitalization modified by the proxy:\r\n\r\n    Content-Length: 968\r\n\r\nThe detected proxy reordered the headers sent from the server.\r\n\r\nThe detected HTTP proxy changed either the headers the client sent or the HTTP response from the server. We have captured the changes for further analysis.\r\nHTTP proxy detection via malformed requests (?): OK\r\n+\r\nFiletype-based filtering (?): OK\r\n+\r\nHTTP caching behavior (?): OK\r\n+\r\nJavaScript-based tests (?): OK\r\n+\r\nSensitive proxy-introduced HTTP headers (?): OK\r\n+\r\nDNS Tests + –\r\nRestricted domain DNS lookup (?): OK\r\n+\r\nUnrestricted domain DNS lookup (?): OK\r\n+\r\nDNS resolver address (?): OK\r\n+\r\nDNS resolver properties (?): Lookup latency 200 ms\r\n+\r\nDirect probing of DNS resolvers (?):\r\n+\r\nDNS glue policy (?): OK\r\n+\r\nDNS resolver port randomization (?): OK\r\n+\r\nDNS lookups of popular domains (?): OK\r\n+\r\nDNS external proxy (?): OK\r\n+\r\nDNS results wildcarding (?): OK\r\n+\r\nDNS-level redirection of specific sites (?): OK\r\n+\r\nDirect probing of DNS roots (?): OK\r\n+\r\nIPv6 Tests + –\r\nDNS support for IPv6 (?): OK\r\n+\r\nIPv4, IPv6, and your web browser (?): No IPv6 support\r\n+\r\nIPv6 connectivity (?): No IPv6 support\r\n+\r\nNetwork Security Protocols + –\r\nDNSSEC Support from the DNS Roots (?): Warning\r\n–\r\nNo DNS root server instance would provide DNSSEC information. Because of this, your system cannot validate signatures for DNS replies, meaning you can't benefit from DNSSEC's protections.\r\nHost Properties + –\r\nSystem clock accuracy (?): OK\r\n+\r\nBrowser properties (?): OK\r\n+\r\nUploaded data (?): OK","replies":[{"poster":"Porocles","date":"2016-10-21T23:48:45.535+0000","up_votes":1,"down_votes":0,"body":"It looks like you're having a network problem maintaining a strong connection, and could even be a result of how your ISP is getting to the game servers.  Give our [connection issues](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues) guide a go to troubleshoot this towards a fix.  Let me know how the results work out for you!","replies":[]}]}