{"poster":"Soy Alto Govir","date":"2017-02-23T20:10:05.560+0000","title":"2 sem jugando cada dia 5 partis y en ninguna un fragmento de llave","subforum":"Problemas Técnicos","up_votes":3,"down_votes":0,"body":"bueno llevo desde hace 2 semanas que no me a tocado ni una llave de las cuales en cada dia siempre jugaba 5 o mas partidas y y solo me tocan solamente cajas cuando saco S y bueno me gustaria que me respondieran haber como saco mas fragmentos de llaves","replies":[{"poster":"L3BrOnJ34NS","date":"2017-02-24T00:18:03.718+0000","up_votes":1,"down_votes":0,"body":"¿Qué debo hacer exactamente para ganar fragmentos de llave? No he recibido uno en semanas.\nCuando nos sentamos a crear Hextech originalmente, probamos varios sistemas de botín de otros juegos para darnos una idea de qué pasaba allí. Notamos un patrón de bloqueos basados en dinero. En muchos casos, el juego otorgaba un cofre, pero había que pagar para poder abrirlo. Como jugadores, eso se sentía terrible, así que desde el principio supimos que queríamos que los jugadores pudieran obtener contenido Hextech sin tener que pagar.\nPor el otro lado, regalar millones de aspectos cada mes limitaría rápidamente nuestra capacidad de seguir invirtiendo en mejores servidores, balancear el juego y desarrollar otras características que ayudan a todos los jugadores en general (dejando de lado los costos). A partir de eso, creamos los fragmentos de llave como manera de hacer un balance entre regalar contenido gratuito, pero a ciertos intervalos que tenía sentido para todos los jugadores y se sentía como una recompensa sin importar si jugaban poco o mucho.\nAhora que el sistema ha estado en manos de los jugadores por la mayor parte del año, un problema que hemos notado es que, sin importar cuántos fragmentos y cofres tenga un jugador, ellos dicen ''no estoy recibiendo lo suficiente''. Parte de esto tal vez pueda resolverse con un mejor sistema de retroalimentación, pero hay aspectos que siguen siendo inevitables. ¿Quién no quiere más cosas gratis?\nLas reglas básicas para obtener fragmentos de llaves son:\nLos fragmentos solo aparecen por victorias.\nLa tasa de aparición de fragmentos funciona según un temporizador cíclico para cada jugador, similar a los cofres. Hay un poco más probabilidades al inicio y comienzan a reducirse lentamente hasta que se llegue a un número determinado de fragmentos recibidos en un ciclo hasta que se restablece.\nEs posible obtener 4 llaves (12 fragmentos) en un periodo de 4 semanas. Esto está a la par de los cofres que los jugadores pueden recibir.\nHay una regla de protección contra mala suerte que permite un número máximo de victorias entre apariciones de fragmentos de llave.\nLos jugadores obtienen una pequeña bonificación si juegan en partidas prediseñadas.\nAunque este conjunto de reglas funciona, hay mucho que podemos mejorar. Estamos estudiando posibilidades de hacia dónde podemos llevar este sistema, pero todavía no estamos listos para compartirles los detalles.\nSiempre agradecemos todos los comentarios que nos dan acerca de esto y esperamos que hayan recibido un montón de botín durante el año pasado.\n\nLo que riot dijo en un post, no es muy dificil leer o buscar info, pero bueno, ahi lo dejo {{sticker:slayer-jinx-wink}}","replies":[]},{"poster":"Gankeame po wn","date":"2017-02-23T20:19:34.758+0000","up_votes":1,"down_votes":0,"body":"un consejo, juega en grupos de 5 jugadores, ya que así aumenta la probabilidad de obtener llaves, yo no conseguía ninguna llave hace más o menos un mes, pero siempre jugaba solo, el otro dia jugamos unos amigos unas partidas y conseguí fragmentos de llave.","replies":[]},{"poster":"9081913DEL1","date":"2017-02-23T20:13:23.758+0000","up_votes":1,"down_votes":0,"body":"Si, 10 dias seguidos probando lo mismo. Y si probas al revez? deja de jugar dos o tres dias y sacas 2 llaves en un dia.\n\nSaludos.","replies":[]}]}