{"poster":"Canto Cara Cruz","date":"2016-11-12T12:21:19.189+0000","title":"Razones por las que DynamicQ no es un reemplazo de Draft Pick, y por qué éste debería volver","subforum":"Charlas Generales","up_votes":63,"down_votes":2,"body":"Leyendo todos los posts acerca del tema, saqu&eacute; algunas conclusiones:\r\n(Antes que nada, le voy a decir DynamicQ porque decir &quot;cola flexible&quot; suena raro).\r\n\r\n1)_ Riot nos dice que, a los que nos gustaba draft pick, tenemos que jugar la nueva &quot;cola flexible&quot; (s&iacute;, ese DynamicQ que tanto repudiamos la season pasada). So, &iquest;qu&eacute; problemas tiene esto?\r\n\r\na)_ No puedo jugar con todos mis amigos. Si a m&iacute; no me gusta blind pick, ni ARAM, y no tengo ganas de jugar SoloQ porque no me siento al 100%, &iquest;qu&eacute; me queda entonces? Antes ten&iacute;a el draft pick, ah&iacute; pod&iacute;a practicar a mis campeones, builds y dem&aacute;s, y despu&eacute;s meterme a ranked. Ahora no, ahora tengo esa copia de DynamicQ. Ahora bien, supongamos que la termino jugando mucho, y subo mucho de elo (por ejemplo: platino). Si yo tengo un amigo en bronce en este modo de juego, porque &eacute;l prefiere jugar m&aacute;s soloQ, entonces no puedo jugar con &eacute;l en DynamicQ. Ah&iacute; ya tenemos una limitaci&oacute;n y una condici&oacute;n que va m&aacute;s all&aacute; de tu habilidad: qu&eacute; tanto juegues DynamicQ, o qu&eacute; tanto te guste. &iquest;Es eso igual que draft pick? No.\r\n\r\nb)_ Emparejamientos. Esto es simple: en DynamicQ hay mucha m&aacute;s probabilidad de que te empareje con 3 o 4 premades, porque si dejan el modo, eventualmente se va a transformar en &quot;ranked con amigos&quot;, y que eso conlleve con las desventajas que todos conocemos (flameos en grupo, que te reporten todos al final de la partida solo por ser premades, etc.). &iquest;Es esto igual que draft pick? No, ah&iacute; ten&iacute;as premades en 1/10 partidas. La DynamicQ est&aacute; hecha para jugar en grupos, as&iacute; que, &iquest;es igual que draft pick? No.\r\n\r\nc)_ Es una ranked. Esto es a&uacute;n m&aacute;s simple: draft pick era una normal, DynamicQ es una ranked. Solo por ser una ranked es diferente. No se ve igual, no se toma igual, no se juega igual. &iquest;Es igual a draft pick? No.\r\n\r\n2)_ Riot nos dice muchas cosas acerca del draft pick, y de las razones por las que lo sacaron, que no era popular, y que A o B, pero lo &uacute;nico que dicen sobre blind pick es que &quot;lo juega m&aacute;s gente&quot;. Nada m&aacute;s.\r\n&iquest;Por qu&eacute; m&aacute;s gente lo juega? Solo por el tiempo de espera, esa es la &uacute;nica raz&oacute;n, es lo &uacute;nico en lo que tiene ventaja con el draft pick. Ahora todas las desventajas que todos conocemos: flameos, trolleos, instapick, &quot;mid or afk&quot;, toxicidad, la imposibilidad de counterpick, la imposibilidad de saber contra lo que vas a jugar y preparar tus runas y maestr&iacute;as para eso, la posibilidad del aburrido mirror pick, los mismos campeones de siempre (riven, zed, yasuo, vayne) en todas las partidas, y creo que me olvido de alguna. B&aacute;sicamente: es un caos. Ahora bien, hay gente a&uacute;n que lo defiende, y Riot tambi&eacute;n forma parte de ellos. Entonces, &iquest;no dar&iacute;a igual que lo convirtieran en &quot;partida r&aacute;pida&quot;? Eleg&iacute;s un campe&oacute;n, runas, maestr&iacute;as, mand&aacute;s la partida, y cuando te encuentre a los otros 9 jugadores te manda a la grieta, as&iacute; sin m&aacute;s. Es la misma cosa y m&aacute;s r&aacute;pida, y tiene todos los problemas que tiene el blind pick, solo que a nadie le interesa, y no hay argumento de &quot;no puedo elegir mi l&iacute;nea&quot;, porque de por s&iacute; es un modo que no tiene esa opci&oacute;n, solo es un acuerdo el cual casi nunca se cumple.\r\n\r\n3)_ Ahora, &iquest;por qu&eacute; deber&iacute;a volver draft pick? Creo que no es necesario que ampl&iacute;e mucho ac&aacute;, todos sabemos por qu&eacute;: eleg&iacute;s la posici&oacute;n en la que quer&eacute;s jugar, pod&eacute;s banear a ese campe&oacute;n molesto que te counterea, pod&eacute;s hacer counterpick, pod&eacute;s adaptar tus runas y maestr&iacute;as al matchup, nadie se pelea por las l&iacute;neas, hay menos toxicidad, menos trolleos, etc. No hay mucho que explicar, es un modo de juego mucho mejor que el blind pick, solo que el tiempo de espera en cola es m&aacute;s largo (aunque tampoco tanto, como mucho te puede tardar 10 minutos, pero es muy raro, a m&iacute; normalmente me tardaba entre 3 y 5). Si solo pudiesen solucionar ese problema (la soluci&oacute;n todos la conocemos, que es sacar el blind pick) entonces quiz&aacute; tengan el mejor cambio que habr&aacute;n hecho (aunque todav&iacute;a les queda sacar a LeBlanc del juego). Ni siquiera tienen que sacar para siempre el blind pick. Pueden probarlo incluso durante una semana, tres d&iacute;as o incluso un d&iacute;a, y meter el draft pick y ver qu&eacute; pasa.\r\n\r\nProbablemente me faltaron decir cosas, porque es un tema muy extenso, pero esto es todo lo que puedo pensar por ahora.\r\n\r\nDeshonor para sus vacas.","replies":[{"poster":"LGBT Valentina","date":"2016-11-12T17:40:59.941+0000","up_votes":4,"down_votes":3,"body":"1:A True\n\n1:B Nope in all\n\n1:C Son rankeds en joda, son diferentes y toma el mmr de las normals. Por al menos los hight elo (d1+) estamos jugando estas ranked en joda, por que tienen menos tiempo de cola que las partidas normal\n\n\n2: Es verdad? Si, pero exageran muchisimo con el tema de instant lock, flammer, etc. Es verdad? Si\nPero soy una persona con una tremenda suerte o ni idea, por que me pasa en 2 partidas de 100 en blind pick\n\nTodo del 2, es verdad, en especial lo del mirror, aveces runas que te pueden joder un poquitito. Pero lo demas es verdad, pero personalmente lo exageraron todos\n\n3: en general me da =, pero es la opinion de cada uno y parece que a muchos les gustaba. Asi que se apoya guste o no\nAhora me preocupa por la gente bronze-silver y low gold, que les van a caer unrankeds que no tienen ni la menor idea de como se juega el draft pick\n\n\n=, Si siguen insistiendo unos meses TODAS las regiones (en general, todas estan \"enojadas\" y supieron calmar dejandolo open en las regiones con mas gente), a la larga personalmente las van a meter","replies":[]},{"poster":"Shikuh","date":"2016-11-12T23:02:00.968+0000","up_votes":2,"down_votes":1,"body":"Lo que yo digo, si hay tanta mas gente que juega blick pick en lugar de draft pick solo por el tiempo de espera, siempre pueden poner \"comodín\" en draft pick y no tienen que esperar tanto tiempo para jugar. Si todos ocupan draft pick el tiempo de espera deberia reducirse para todos, ¿no?\nPersonalmente, con mis amigos jugamos blind pick cuando somos 5, pues si ya tenemos definidos los roles que todos vamos a ir, no nos vamos a andar peleando. pero cuando juego solo es un poco molesto en este modo.\nEn blind pick la toxicidad empieza antes que el juego, ya en seleccion de campeones ves a gente peleando e insultandose.\n\nMi humilde opinion en que deberian regresar draft por el bien de esta comunidad. Es una muy ingeniosa medida para reducir peleas y toxicidad en el servidor.","replies":[{"poster":"TeamSayori","date":"2016-11-13T05:18:59.000+0000","up_votes":1,"down_votes":0,"body":"Yo al contrario, si jugaba con 5 iba a draft, solo al blind (despues de todo casi nunca me pelee por linea y si pasara report y listo xd)","replies":[]}]},{"poster":"GameMode","date":"2016-11-13T08:56:14.023+0000","up_votes":1,"down_votes":0,"body":"Yo viví jugando Blind Pick y recién me vengo a enterar que en el modo reclutamiento no había trolles ni afks o 4 tipos flameando.","replies":[]},{"poster":"Sr Joe","date":"2016-11-12T14:49:43.073+0000","up_votes":1,"down_votes":0,"body":"Ayer con el post de Condor que hablaba sobre el tema ya nos dimos cuenta que por el momento es inútil dar mas argumentos por mas validos que sean.\nLa respuesta a todo siempre va a ser \"Pues te recomendamos probar la nueva cola flexible, que es igual a Draf pick :D\"\nEsta va a ser una temporada literalmente de jugar ARAM y si quieres jugar a tu campeón o campeona favorita sin arriesgar puntos, sin tener que tragarte a campeones como Yasuo, Zed, LeBlanc, o Vayne, ni presionado por ser una ranked, vas a tener que meterte a una partida contra bots... Al parecer eso es lo que Riot define como una \"Buena experiencia de juego\"","replies":[{"poster":"WolfRawrrr","date":"2016-11-12T23:10:43.680+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Crosti Sinson,realm=LAS,application-id=v7qsfXsE,discussion-id=I0xot1P5,comment-id=0000,timestamp=2016-11-12T14:49:43.073+0000)\n>\n> Ayer con el post de Condor que hablaba sobre el tema ya nos dimos cuenta que por el momento es inútil dar mas argumentos por mas validos que sean.\n> La respuesta a todo siempre va a ser &quot;Pues te recomendamos probar la nueva cola flexible, que es igual a Draf pick :D&quot;\n> Esta va a ser una temporada literalmente de jugar ARAM y si quieres jugar a tu campeón o campeona favorita sin arriesgar puntos, sin tener que tragarte a campeones como Yasuo, Zed, LeBlanc, o Vayne, ni presionado por ser una ranked, vas a tener que meterte a una partida contra bots... Al parecer eso es lo que Riot define como una &quot;Buena experiencia de juego&quot;\n\nTe falto que nos tenemos que aguantar a Rengar en todas las partidas de blind pick ahora :)","replies":[{"poster":"Sr Joe","date":"2016-11-13T01:25:14.269+0000","up_votes":1,"down_votes":0,"body":"Tranqui, Riot odia a Rengar, independiente de que este \"roto\" ahora, después le nerfearan hasta el rango del auto ataque","replies":[{"poster":"WolfRawrrr","date":"2016-11-13T02:53:37.820+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Crosti Sinson,realm=LAS,application-id=v7qsfXsE,discussion-id=I0xot1P5,comment-id=000000010000,timestamp=2016-11-13T01:25:14.269+0000)\n>\n> Tranqui, Riot odia a Rengar, independiente de que este &quot;roto&quot; ahora, después le nerfearan hasta el rango del auto ataque\n\nEs cierto !! Jajajajaja","replies":[]}]}]},{"poster":"Canto Cara Cruz","date":"2016-11-12T16:37:54.335+0000","up_votes":1,"down_votes":0,"body":"Eso también es otra cosa. Riot responde siempre con las mismas frases circulares y repetitivo, no te dan una idea clara de lo que realmente piensan o quieren hacer. Te esquivan la respuesta.","replies":[]}]},{"poster":"BestAhriCuba","date":"2016-11-12T14:54:41.549+0000","up_votes":1,"down_votes":1,"body":"Es que si sacan el blind pick tendrian que eliminar a zed, yasuo y vayne del juego que serian campeones injugables (o solo se podrian jugar en un elo lo suficientemente alto donde no los banean), para mi las cosas estan bien como estan (mientras vuelvan a poner soloq :p), nunca le encontre ninguna utilidad a las normales y si quieres practicar riot supuestamente dijo que esta season iba a traer las repeticiones y el modo sandbox. Aun asi si a tantas personas les gustan las normales deberian sacar las casificatorias flex ya que un modo en donde puedes jugar ranked con toda la gente que quieras contra soloplayers desbalancea completamente el juego y nunca sera competitivo.","replies":[]}]}