{"poster":"Southern Wild","date":"2018-05-23T02:34:04.743+0000","title":"Idea de campeon: Orseas, el Filo del Espejo.","subforum":"Creaciones de la comunidad","up_votes":6,"down_votes":0,"body":"Orseas, hijo primog&eacute;nito de una de las casa m&aacute;s poderosas de Demacia, fue traicionado por su hermano gemelo Alfos durante una expedici&oacute;n en lo m&aacute;s profundo de los glaciares del Freljord, quedando encerrado en un extra&ntilde;o espejo encontrado en un antiguo templo escarbado en el hielo. \r\nAll&iacute; Alfos apu&ntilde;al&oacute; a Orseas con su estoque y lo arrojo dentro del espejo, sin saber que aquello era un portal a un mundo alterno al suyo. \r\nDel otro lado, Orseas fue pose&iacute;do por &#039;El Guardi&aacute;n del Espejo&#039;, un antiguo esp&iacute;ritu que acecha desde el otro mundo resguardando el orden del mundo de los hombres, el cual le dio la oportunidad de vengar su muerte a cambio de ofrecer su vida como mercenario. Orseas acept&oacute; y fue premiado con grandes habilidades y funcionado completamente con el poder del Espejo.  \r\nHabiendo cobrado su venganza, Orseas se mueve entre el mundo del espejo y el de los hombres, cumpliendo las misiones que el Guardi&aacute;n le encomienda, cuidando el orden y haci&eacute;ndose de la vida de aquellos que intenten corromperlo, empu&ntilde;ando el mismo estoque con el que alguna vez lo asesinaron. \r\n\r\nNombre: Orseas \r\nApariencia: Alto y delgado, &aacute;gil y atl&eacute;tico. Cabello largo grisaseo, casi plateado. Ojos grises. Piel p&aacute;lida. Viste armadura sencilla, una capa corta. \r\nPersonalidad: Serio, enfocado. Fr&iacute;o, calculador. Nost&aacute;lgico en momentos, recordando su antigua vida. Resentido, vengativo. \r\nArma: Estoque de cristal. \r\nClase: Asesino, Duelista, Escaramuzador.\r\nTipo de da&ntilde;o: H&iacute;brido, melee.\r\n\r\n**P: Reflejo**: Todas las habilidades del Orseas generan un reflejo suyo. El reflejo desaparece tras finalizar la habilidad, o si Orseas reactiva la misma. El da&ntilde;o del reflejo escala en base al Poder de Habilidad de Orseas. \r\n\r\n**Q: Asalto Especular:** Orseas env&iacute;a su Reflejo en una direcci&oacute;n, apu&ntilde;alando a todas las unidades en su paso, causando da&ntilde;o m&aacute;gico. Si Orseas da&ntilde;a a un enemigo, puede reactivar la habilidad para reaparecer detr&aacute;s del enemigo y apu&ntilde;alandolo, causando da&ntilde;o fisico. \r\n\r\n**W: Espejismo:**Al activarla, Orseas salta r&aacute;pidamente hacia atr&aacute;s, volvi&eacute;ndose moment&aacute;neamente invulnerable, y  dejando a su reflejo en su posici&oacute;n anterior. Tras un instante su reflejo ataca al objetivo m&aacute;s cercano, causando da&ntilde;o m&aacute;gico.\r\n\r\n**E: Ataque Cristalino** Orseas selecciona una &aacute;rea en forma de rombo delante de &eacute;l. Tras activar, de a uno,  un reflejo de Orseas se coloca en cada punta del rombo. Cuando se encuentran los cuatro sobre el rombo, atacan da&ntilde;ando a todos los enemigos en el centro del rombo. \r\nOrseas puede reactivar esta habilidad, para colocarse en el lugar del ultimo reflejo aparecido, los dem&aacute;s reflejos desaparecer&aacute;n, cancelando el ataque. Orseas gana velocidad de movimiento tras cambiar de lugar con reflejo. \r\n\r\n**R: A trav&eacute;s del Espejo** Al activar, Orseas dibuja un portal delante de &eacute;l con su estoque, y luego se desliza hacia delante atraves&aacute;ndolo, entrando en el mundo del espejo y volvi&eacute;ndose invisible por un corto periodo. All&iacute;, Orseas se mueve r&aacute;pidamente pero permanece silenciado. Es totalmente indetectable. Si Orseas reactiva la habilidad, crea un portal de salida y la habilidad entra en un largo enfriamiento. \r\n\r\nSi Orseas apu&ntilde;ala a un enemigo mientras entra en el portal, lo trasporta con &eacute;l y lo reta a un duelo. All&iacute; Orseas y su enemigo pelean sin ser vistos, y tienen acceso a todas sus habilidades, pero no hechizos de invocador. Solo podr&aacute;n salir si uno de los dos muere, o se termina el efecto de la habilidad.  Si Orseas gana el duelo, recobra parte del enfriamiento. \r\n\r\nBueno espero les guste el concepto, puede llegar a ser un poco OP, con mucha movilidad y escalado de da&ntilde;o. Pero bueno, es solo un concepto XD{{sticker:katarina-love}}","replies":[{"poster":"Nisinunglacert","date":"2018-05-24T05:04:59.983+0000","up_votes":3,"down_votes":0,"body":"Interesante, pero de me hace muy rara su jugabilidad. Con la temática me imagino a un Shaco o una LeBlanc, que te hace confundir con sus habilidades y aprovechan eso para provocar mucho daño. Pensando en eso hablaré de las habilidades:\n\n**Pasiva:** No termino de entender como funcionaría, ¿Es como un recasteo con más daño(onda Rengar) o algo más similar a la Q de Shen? Hablando de Shen, tal vez podrías profundizar lo de los reflejos para que sean parte del combo. Una marca que genera un reflejo del enemigo y al explotarla hace daño según la distancia entre ellos. \n**Q:** Esta perfecto, tal vez en vez de un reflejo yo diría que tira su puñal pero es de quisquilloso nomás.\n**W:** ¿A que te refieres con hacía atrás? Con esa idea me hiciste acordar a la W de LeBlanc. Por ahí podes ver de hacer algo similar al item para asesinos que van a meter al muelle del carnicero, que se trata de dejar una marca en el suelo y volver a ella dentro de unos segundos.\n**E:** Se me hace una habilidad muy extraña, por el espectáculo visual parece una ulti pero su lentitud la hace que difícilmente alguien caiga en la trampa. Ya teniendo una habilidad de daño y dos de movilidad quizás no le vendría mal una habilidad defensiva/ofensiva. Me explico: algo tipo de escudo o muro que refleje una habilidad del enemigo al 70% del daño o algo así. Sería muy interesante como duelista, la única que puede hacer algo del estilo es Fiora.\n**R:** Es lo que más me gusta, tal vez yo haría que solo fuese la invisibilidad+invulnerabilidad pero que funcionara como la E de Rek'sai y vaya dejando espejos por los muros del mapa. Lo del 1v1 me gusta pero debería ser algo más situacional, con marcas tipo Kindred/Evelyn o que sea a través de un combo(ejemplo: si le pegas Q+Q al activar R el último objetivo dañado me mete al mundo espejo contigo).\n\nBueno en resumen, me gusta. Tal vez le falte habilidades de daño por skillshot pero su movilidad compensa. Sé que es difícil lograr un campeón balanceado, raras veces son las que me acerco a lograrlo, pero realmente este es un muy buen primer concepto.","replies":[]},{"poster":"FallenDemonX","date":"2018-05-23T14:58:56.761+0000","up_votes":3,"down_votes":0,"body":"Fue poseido por Giratina? Ok no.\n\nLa verdad es que me parece genial. El lore esta bueno y en general parece un champ interesante. El kit esta bueno pero quizá algunos detalles podrian ser mejores y no aprovecha el concepto del todo.\n\n\n**Pasiva:** Considerando que las habilidades ya dicen como funciona cada \"espectro\", esta un poco demás decirlo en la pasiva. Todos los espectros infligen la misma cantidad de daño? Quiza algún efecto adicional o que funcione de forma mas homogénea en todo el kit, comparándolo con Zed que tiene un pasiva como tal y luego todo un kit basado en las sombras. Seria divertido que efectivamente tire las skills 2 veces o hubiera como efectos reflejo sobre otros objetivos como el efecto del Aghanim con Skywrath.\n\n\n**Q:** Esta bien. Un gap closer condicional bien pensado. Simple y funcional.\n\n**W:** Quiza si el espectro tuviera CC como un slow o algo para asegurar el escape y darle utilidad.\n\n**E:** Muy original, aunque no estoy muy seguro como alguien se va a quedar parado para comérselo. Como follow up en TFs es interesante y esta bueno como te da opciones, aunque quiza tiene demasiado movilidad sin contar la ult.\n\n**R:** Si bien es muy original, prácticamente no tiene counter play, pero irónicamente también depende mucho de tus stats y que tan bien te va. Divertida pero podría ser mas funcional. No estoy del todo seguro como cambiarla manteniendo la idea.\n\n\nEn general esta muy bueno pero falta algo de, no se, \"temeridad\" supongo. Conceptualmente es algo \"directo\", o sea: \"Quiero un champ con reflejos, hare su lore relacionado con espejos. Y de paso una historia de venganza porque why not.\" Lo siento si sueno arrogante pero es de lo que se mas cuando comento en conceptos de champ. Obviamente no tenes porque hacerme caso.\n\n\nEspero ver mas de vos en el futuro! {{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"Sharp My Blade","date":"2018-05-23T13:14:44.387+0000","up_votes":2,"down_votes":0,"body":"Quizas modificaria alguna que otra cosa, pero mas que nada la E y la R me parecieron super originales. Me gusta tu idea","replies":[]},{"poster":"AxElL93","date":"2018-05-23T02:40:13.806+0000","up_votes":2,"down_votes":0,"body":"{{sticker:slayer-pantheon-thumbs}}","replies":[]}]}