{"poster":"Southern Wild","date":"2018-12-12T16:38:17.233+0000","title":"Idea de Campeon, tirador de Targón: Argus, el aspecto de las estrellas","subforum":"Creaciones de la comunidad","embed":{"description":"Post with 1 votes and 1 views. Shared by escorplibra. Argus","url":"https://imgur.com/a/jnR9zS4","image":"https://i.imgur.com/iaQaRtE.jpg?fb"},"up_votes":14,"down_votes":0,"body":"LORE:\r\n\r\nUna vez un soldado Rakkor experto en el arco y flecha, Argus era conocido como &quot;el vidente&quot;, ya que pod&iacute;a predecir los movimientos del enemigo con un talento innato, del cual &eacute;l mismo no se jactaba. Sin embargo, no fue as&iacute; el d&iacute;a que los b&aacute;rbaros atacaron la aldea Rakkor de Argus. Siendo conocida su fama de vidente en todo Targ&oacute;n, al notar su presencia, los b&aacute;rbaros enfocaron su ataque sobre &eacute;l, arrinconandolo e hiri&eacute;ndolo gravemente. \r\nLuego de que los b&aacute;rbaros arrasaran con toda la aldea, solo quedaban cuerpos en el suelo. Argus agonizaba, pero a&uacute;n no estaba muerto. Intento tomar su arco, pero estaba ciego. Comenz&oacute; a gritar espantado por la oscuridad, y la agudeza con la que todo sonaba: el viento entre el valle, los arroyos fluyendo, los pasos de unos extra&ntilde;os, su cuerpo cayendo en los brazos de alguien.\r\nDespert&oacute; en un templo Lunari , sanado pero a&uacute;n ciego. Los Lunari, quienes viv&iacute;an con los ojos vendados durante el d&iacute;a, supieron ense&ntilde;arle a lidiar con su ceguera. Durante el d&iacute;a, o&iacute;a relatos de los sabios y los traduc&iacute;a en un idioma t&aacute;ctil. En la noche, salia hacia la ladera de la monta&ntilde;a, descansaba su cabeza sobre una roca y apuntaba su mirada al firmamento, pudiendo o&iacute;r hasta el movimiento de los astros.\r\nFue durante la noche, cuando escuch&oacute; a la distancia que un grupo de b&aacute;rbaros se acercaba. Los solari eran un pueblo pasivo, si no lograban esconderse de los b&aacute;rbaros, les dar&iacute;an todo lo que quisieran. Argus no pod&iacute;a tolerar esa injusticia nuevamente. A&uacute;n as&iacute;, no hab&iacute;a nada que pudiera hacer, sus habilidades como tirador se hab&iacute;an ido para siempre con su visi&oacute;n. Decidi&oacute; enfrentarlos igualmente. Permitirles acabar con lo que hab&iacute;an empezado. Emprendi&oacute; rumbo hacia el sonido. Camino sobre piedras, escal&oacute; laderas pronunciadas, sinti&oacute; la nieve en sus pies, las manos congeladas en la roca helada. El sonido se hizo cada vez m&aacute;s n&iacute;tido,  y justo cuando sent&iacute;a claras voces, sonidos de animales y hierro, un fuerte resplandor ilumino su cara. Era tan fuerte que sus ojos emblanquecieron, emanaba un fr&iacute;o especial, un fr&iacute;o amigable. Sinti&oacute; como algo tomaba su brazo y lo jalaba adentro de un espacio liviano. Flotaba. Sonaban cuerdas y viento, sonidos cristalinos. Algo tomo la venda de sus ojos, la quit&oacute; y se introdujo en &eacute;l. Argus pod&iacute;a ver las auroras de la cima de Targ&oacute;n, las estrellas, la nebulosa. En sus manos, sinti&oacute; un picor, como si una chispa caliente rebotara entre sus dedos. Un brazo se extendi&oacute; de su espalda y abri&oacute; un libro transparente delante de su pecho. Otro brazo corri&oacute; la p&aacute;gina y le mostr&oacute; a los Lunari siendo sometidos. Su brazo izquierdo se extendi&oacute; hasta la nebulosa, tom&oacute; una estrella y la moldeo en forma de flecha.\r\nLos Lunari vieron descender un cuerpo celeste desde la cima de Targ&oacute;n. Su brillo era cegador, sus brazos m&uacute;ltiples, y delante de su cara flotaban ojos resplandecientes como estrellas del cielo. Una lluvia de proyectiles arras&oacute; con los b&aacute;rbaros. No hab&iacute;a lugar donde esconderse, las flechas los encontraban y daban en el lugar certero. Argus hab&iacute;a vuelto.\r\n\r\nHABILIDADES:\r\n\r\nP: Clarividencia: El primer ataque b&aacute;sico de Argus contra un campe&oacute;n le rebela su destino, dejandole una marca que expone un lado d&eacute;bil. La marca rotar&aacute; a pesar de que el objetivo se mueva. Si Argus ataca al objetivo desde su lado d&eacute;bil, causara da&ntilde;o extra y reducir&aacute; su armadura. La marca se puede volver a aplicar despu&eacute;s de unos segundos, y su enfriamiento es levemente reducido con los ataques b&aacute;sicos.\r\n\r\nQ: Proyectil Estelar: Argus almacena 3 astros fugaces en su libro, puede invocar uno por uno en linea recta, a menor rango, o recargar para invocar a los tres a mayor rango, causando m&aacute;s da&ntilde;o. \r\n\r\nW:     P: Visi&oacute;n Suprema: entrar en un arbusto y permanecer fuera de combate, brinda a Argus un estado de trascendencia, desplegando sus ojos y abriendo su visi&oacute;n en un rango circular mayor. El rango crece seg&uacute;n el nivel de la habilidad. Argus puede ver dentro de la niebla de guerra y sobre el terreno. El efecto se disipa si Argus, se mueve, sale del arbusto o entra en combate.\r\n          A: Firmamento Nocturnos: Argus invoca la luz del firmamento nocturno en un &aacute;rea seleccionada. Los enemigos en el area son levemente ralentizados y tienen su visi&oacute;n afectada (solo pueden ver dentro del &aacute;rea)  Argus causa m&aacute;s da&ntilde;o a los enemigos dentro del firmamento. El efecto de Visi&oacute;n Suprema desaparece al activar Firmamento Nocturno, y no puede utilizarse hasta que la habilidad salga de enfriamiento. \r\n\r\nE: Mano Astral: Argus invoca una mano astral para atacar a su objetivo, ganando un peque&ntilde;o buff de velocidad de ataque. La mano ataca al ritmo que Argus ataque con b&aacute;sicos, pero con mayor rango. Si la mano ataca un Lado D&eacute;bil revelado por Clarividencia, causa el doble de da&ntilde;o. La mano dura un breve periodo, pero pude renovarse su enfriamiento si Argus mata o asiste a un campe&oacute;n, pudiendo invocar una segunda mano que dura mucho menos. Con dos manos invocadas, el buff de velocidad de ataque es mayor.\r\n\r\nR: Castigo C&oacute;smico: Argus selecciona un objetivo del cual tenga visi&oacute;n, y luego se inmobiliza en su lugar para canalizar todo su poder astral. Una vez canalizado, Argus libera una lluvia de proyectiles que viajan hasta su objetivo sin importar el rango ( mientras Argus haya tenido visi&oacute;n del objetivo al seleccionarlo, los proyectiles lo seguir&aacute;n/ sinergia con la W). Una vez alcanzado el objetivo, los proyectiles impactan al objetivo aplicando Castigo C&oacute;smico, causando da&ntilde;o seg&uacute;n la vida faltante del objetivo. Si el objetivo muere, los proyectiles se disipan en el &aacute;rea al rededor al objetivo, causando un peque&ntilde;o da&ntilde;o a los enemigos cercanos.  \r\n\r\n Espero les guste {{sticker:sg-soraka}}","replies":[{"poster":"ParedSinRevoque","date":"2018-12-12T17:13:07.282+0000","up_votes":7,"down_votes":0,"body":"Ahuevo a {{champion:64}} le salio un ojo...\n\n{{sticker:slayer-pantheon-popcorn}}","replies":[]},{"poster":"LePointZ","date":"2018-12-12T16:40:38.857+0000","up_votes":5,"down_votes":0,"body":"es re illuminati ese bicho","replies":[]},{"poster":"SpectreChazer","date":"2018-12-12T19:06:52.206+0000","up_votes":5,"down_votes":1,"body":"si no tiene tetas no lo compro (?","replies":[]},{"poster":"MasterKilled59","date":"2018-12-13T02:24:55.752+0000","up_votes":3,"down_votes":0,"body":"me encanto la idea de este campeon , ya que de ser un experto con el arco perdio la habilidad de poder ver por las heridas graves que ah sufrido , y que poco a poco fue agudizando sus sentidos , hasta ser elegido para ser un celestial de las estrellas , yo lo llamaria por asi decirlo por ahora un \"Argus el celestial Estratega\" o \"Argus el estratega vidente\" , lo que no me gusto fue el boceto , ya que no parece un soldado de Rakkor. ya que los arqueros de Rakkor se ven mas imponentes , pero en el boceto opta mas por un estilo de monje , por ejemplo se ve como un lee sin puño de dios , hay que cambiarle el especto , ya que no parecera tan soldado de Rakkor .\nen total de todo esto me encanto tu idea del personaje tanto que ya que hasta me estoy dando una idea de como puede lucir \n{{sticker:vlad-salute}}","replies":[{"poster":"ShikuTemorin","date":"2018-12-18T18:04:03.366+0000","up_votes":1,"down_votes":0,"body":"Concuerdo, me encanta el campeon, pero el boceto es algo que no me gusto mucho, el lore es bastante bueno (Aunque no entendi el final) pero estoy seguro de que seria un campeon buenisimo para los que les gusta Targon\n\nNew Meta 2019 Argus+Taric Bot Lane jajaja","replies":[]}]},{"poster":"LyghtSh","date":"2018-12-13T00:41:44.246+0000","up_votes":4,"down_votes":1,"body":"Cual es la diferencia con {{champion:89}}  siendo que el Sol es una estrella?\n\nY mas importante\n\nComo afecta esto a {{champion:136}} ?","replies":[{"poster":"Nisinunglacert","date":"2018-12-13T14:32:32.971+0000","up_votes":2,"down_votes":0,"body":"No sería el aspecto de LA ESTRELLA, sino del firmamento o alguna constelación específica(cosa que permitiría que haya muchisimos aspectos a futuro).\n\nA Aurelion no le afecta, solo tendría más dueños.","replies":[]}]},{"poster":"Avant Garde","date":"2018-12-13T13:45:30.057+0000","up_votes":1,"down_votes":0,"body":"pero ya hay un tirador de targon.","replies":[{"poster":"Nisinunglacert","date":"2018-12-13T14:36:32.277+0000","up_votes":2,"down_votes":0,"body":"No, me acabo de volver a fijar por las dudas y no, no hay ninguno. Además creo que esa regla se rompe en varias regiones (Targon tiene 3 supports y 2 magos por ejemplo).","replies":[{"poster":"Avant Garde","date":"2018-12-15T18:12:58.433+0000","up_votes":2,"down_votes":0,"body":"como que no , y taric que es . un tirador de goma :p","replies":[{"poster":"Nisinunglacert","date":"2018-12-15T20:51:04.767+0000","up_votes":1,"down_votes":0,"body":"JAJAJAJA\nAún siendo main Taric ese chiste se me hizo muy bueno.","replies":[]}]},{"poster":"tobiasvg","date":"2018-12-13T16:20:45.679+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nisinunglacert,realm=LAS,application-id=J0mxKtkB,discussion-id=98FGmA06,comment-id=00060000,timestamp=2018-12-13T14:36:32.277+0000)\n>\n> No, me acabo de volver a fijar por las dudas y no, no hay ninguno. Además creo que esa regla se rompe en varias regiones (Targon tiene 3 supports y 2 magos por ejemplo).\n\nTargon en realidad sólo tiene tres/cuatro champs (pantheon, leona, zoe (soraka???? )) ya que taric es de demacia, y Diana es hija de exploradores que murieron en targon y a aurelion no lo cuento ya que es un dragón cósmico, no nació directamente en targon","replies":[{"poster":"Nisinunglacert","date":"2018-12-13T16:27:06.260+0000","up_votes":1,"down_votes":0,"body":"A ver... yo me guio por lo que dice en Universo. En Universo Aurelion, Diana, Leona, Pantheon, Soraka, Taric y Zoe. Y sí, me confundí, serían 3 supports y 3 magos. El origen del personaje no sé qué tanto importa si hablamos de las facciones del juego. Entonces Kayn y Karthus son noxianos.","replies":[{"poster":"tobiasvg","date":"2018-12-13T17:30:33.135+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nisinunglacert,realm=LAS,application-id=J0mxKtkB,discussion-id=98FGmA06,comment-id=0006000000000000,timestamp=2018-12-13T16:27:06.260+0000)\n>\n> A ver... yo me guio por lo que dice en Universo. En Universo Aurelion, Diana, Leona, Pantheon, Soraka, Taric y Zoe. Y sí, me confundí, serían 3 supports y 3 magos. El origen del personaje no sé qué tanto importa si hablamos de las facciones del juego. Entonces Kayn y Karthus son noxianos.\n\nSi no mal recuerdo karthus en vida era de aguas turbias","replies":[{"poster":"Nisinunglacert","date":"2018-12-13T19:28:39.443+0000","up_votes":1,"down_votes":0,"body":"Nació en Noxus:\nhttps://imgur.com/73YdqB5\nLuego fue a Aguasturbias para ver la niebla negra y embarcarse hacia la Isla de las Sombras:\nhttps://imgur.com/lP3MYlw","replies":[]}]}]}]}]}]},{"poster":"Nisinunglacert","date":"2018-12-13T16:10:01.595+0000","up_votes":2,"down_votes":0,"body":"Hola, ayer leí tu concepto y me gusto mucho pero no tuve timepo de comentar como me gusta a mí. Creo que la historia es bastante acertada, tal vez me hace ruido la participación de los Lunari pero no me conozco la historia completa y su cronología como refutarlo. Me gustaría darte una devolución habilidad por habilidad de su kit:\n\n* **P:** Me gusta. Entiendo que es como una pasiva de Fiora al segundo básico, el tema que dice _\"La marca rotará a pesar de que el objetivo se mueva.\"_ pero supongo que es _\"La marca **no** rotará\"_ porque sino sería imposible activarla, lo digo bien, yo tengo muchísimos errores de tipeo.\n* **Q:** ¿Libro o carcaj? XD me gusta el doble uso, espero que se puede mover mientras tira las flechas.\n* **W:** La pasiva está interesante, la activa también está buena. A pesar que es muy parecido a la W de Swain, creo que ambas cosas era muy necesarias para la temática.\n* **E:** Está es mi habilidad favorita, pero creo que le sobra la velocidad de ataque, porque yo entiendo que ya tener una pasiva de Lucian con rango extra permanente por 3/4/5 segundos ya es suficiente, más aún si lográs matar a alguien y usar su segundo casteo. Podría ser hasta la ulti con un par de retoques.\n* **R:** Creo que es demasiado parecido a Caitlyn, me gustaría que tuviese más presencia su faceta de vidente. Podría revelar a todos los enemigos y luego elegir uno para hacerle el daño. O poner la **E** de **R** tal cual vos la hiciste y hacer una nueva **E**.\n\nEn sí lo que más me gusto fue la temática y su E, luego entiendo que tenga un kit de ADC promedio pero me gustaría más componentes de vidente. Podrías repensar la activa de la W con componentes de Quinn o Warwick y lo de seleccionar a un enemigo tipo Kindred. Me explico: Elijo a un enemigo, cuando activo la habilidad veo su ubicación y puede hacerle más velocidad de ataque si lo ataca.","replies":[]},{"poster":"James335","date":"2018-12-13T02:31:40.097+0000","up_votes":1,"down_votes":0,"body":"se ve que seria el counter de {{champion:64}}","replies":[]}]}