{"poster":"Runic Angel","date":"2015-12-30T11:48:27.067+0000","title":"Champion Concept! Currently havn't come up with a name, feel free to give me suggestions","subforum":"Player Creations","up_votes":1,"down_votes":1,"body":"I&#039;m aiming for --- to be an ap assassin simmilar to {{champion:245}} and {{champion:105}} \n\nPrimary Role: Assassin\nSecondary Role: Mage\n\nBase Health - 500\nHealth Regen - 7.3\nMana - 320\nMana Regen - 7.0\nMelee - 125\nAttack Damage - 60\nAttack Speed - .78\nArmor - 20.1\nMagic Resist - 30.1\nMovement Speed - 340\n\nLore: A young boy who lived peacefully in Piltover was a very curious one, he seeked adventure. Piltover was pretty boring apart from the sudden and quickly ending criminal rampages. His father was a technological genius and the bored him even more. One day when he was feeling very adventurous. He snuck out of his house and took a bunch of food and a tent and was going to go camping far away and come back home later. \n\nAfter a day or two he was quite far away and was regretting the journey he had set out on. Often hearing screams and cries of animals and unkown noises, he was scared and wanted to return home.\n\nQuite a few weeks had passed and he was alot less scared. He felt like it had taken more then just a few weeks to get to where he was now. Later torwards the week he had stumbled across a strange chasm, with rocks leading down to it like stairs. Him being as curious of a boy as he was he went down without a thought.\n\nHe had strangely awoken not knowing how long it had been since he was last conscious. He appeared  to be holding a big runic sword and he felt as like he was in a different body. And felt endless pain since he had awoken. He also appeared to be wearing a big purple gauntlet and he felt more mature, like he had grown. Not remembering anything past him going down to the chasm he roams Runeterra searching for answers.\n\nPassive - Mobility Gauntlet\n--- Passively gains movement speed per level\n\nQ: Warpal Blade\n---- Swipes his blade forward dealing magic damage and slowing the enemy by 25%\nIf the blade hits the enemy --- gains attack range and will teleport to the next enemy hit (Both Casts proc on hit effects) (Simmilar to Ekko&#039;s e but with more range and is almost instant)\n\nW: Endless Pain\n Active: --- Does magic damage around him and gains a small shield \nPassive: Losing 25% of ---&#039;s max health over 3 seconds grants him 10 armor, 13 magic resist and 25 ability power for 5 seconds (30 second cooldown)\n\nE: Monstrous Crunch\n--- Summons a portal behind him that summons a monster the extends forward dealing magic damage, the monster then bites all enemies infront of it dealing percent health damage\n\nR: Void Summon\n---&#039;s summons 4 humanoid figures around an enemy champion after 3 seconds these figures will all cast a small ray dealing more damage the more damage you do to the target during this time (simmilar to zed ultimate) During this time you can use Monstrous Crunch and the figures will cast a smaller version that only does magic damage, not the prrcent health damage\nVoid Summon can only be dodged by untargetables\n\nThoughts on the Champion\n**Items**\n{{item:3100}} Lich bane would be a good item for --- because it would proc casts of his q. This would be the same for {{item:3116}} Rylais Crystal Scepter\n{{item:3157}} Zhonya's hourglass would be great for diving the enemy and not doing as much damage as you intended\n**Combos**\nR ignite q q w e\nR e w q q\netc. \n**General Thoughts**\nI believe that --- would be a great edition to the champion roster. I believe he would be a nice assassin for mid and could possibly even jungle\n\nGive me some thoughts on what you think I could change to be mode balanced and such. I appreciate your cooperation if you could do so!\n{{sticker:zombie-nunu-hearts}}","replies":[{"poster":"DigitX2","date":"2016-03-24T01:25:05.529+0000","up_votes":1,"down_votes":0,"body":"Kristap, the Void Stumbler.  what do you think?\n{{sticker:slayer-pantheon-rainbows}}","replies":[{"poster":"Runic Angel","date":"2016-04-01T10:07:32.912+0000","up_votes":1,"down_votes":0,"body":"I've gotta admit, I love the 'void stumbler' idea, but kristap maybe not so much, lemme know if you find another name :3","replies":[]}]},{"poster":"Horris","date":"2015-12-31T04:20:27.772+0000","up_votes":0,"down_votes":0,"body":"1- Is the champion's Q a swipe horizontally like a Darius E or is it a vertical one like a Sion Q?\n\n2- W's Passive should be in the Active paragraph, unless you have that passive forever, which is stupid.\n\n3- Maybe specify how much % health damage E does?\n\n4- Do the R humanoids follow the target? Do they suppress the target? Do they just stand in one place for the whole duration?\n\nThat's about it from me ;)","replies":[{"poster":"Runic Angel","date":"2015-12-31T04:43:25.581+0000","up_votes":1,"down_votes":0,"body":"Swipes like this / starting from the top.\n\nW: Endless Pain\nActive: --- Does magic damage around him and gains a small shield\nPassive: Losing 25% of ---'s max health over 3 seconds grants him 10 armor, 8 magic resist and 25 ability power for 5 seconds (30 second cooldown)\n\nIf this is looked at by riot I'll let them deal with the amounts and percentages of max health damage huehuhuehue\n\nI'm thinking the figures will follow the target and maybe the figures wont cast his e because that might be a little on the bs side but they **will not collide with units**","replies":[{"poster":"Horris","date":"2015-12-31T06:03:56.139+0000","up_votes":1,"down_votes":0,"body":"Hmm, maybe make it's shadows able to cast E, but the E doesn't stay with the humanoids while they move? Like, they're casted, but stay where they were casted.","replies":[{"poster":"DigitX2","date":"2016-01-11T01:33:02.726+0000","up_votes":1,"down_votes":0,"body":"would he synergise well with syndra, like can she pick them up?\n\nCause a good combo be syndra picks up one of the humanoids, throws them at target, q,e then secure the kill","replies":[{"poster":"Runic Angel","date":"2016-02-25T22:58:17.764+0000","up_votes":1,"down_votes":0,"body":"I wasn't thinking them to be a unit I was thinking to be more if like zed shadow where you cant target them but they can do damage, besides, its only a short quick ability so there would be no time to catch them anyway, sorry for the late reply I've been away a little bit","replies":[{"poster":"DigitX2","date":"2016-03-24T01:24:23.193+0000","up_votes":1,"down_votes":0,"body":"there are already to many no targetable ais such as azirs soilders and like you said, zeds shadows, maybe it would be better for them to get targetable, as it would be to broken","replies":[]}]}]}]}]}]},{"poster":"DigitX2","date":"2016-01-10T13:13:12.005+0000","up_votes":1,"down_votes":0,"body":"Kristap, the Void Stumbler. {{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"Talon12","date":"2015-12-30T12:42:19.913+0000","up_votes":1,"down_votes":0,"body":">(If you catch any spelling or grammar mistakes or something doesnt make sense to you feel free to let me know)\n\nabout 30% of the lore, and that sentence.","replies":[{"poster":"Runic Angel","date":"2015-12-30T13:04:58.507+0000","up_votes":1,"down_votes":0,"body":"Thank you friend :^)","replies":[]}]}]}