{"poster":"Cosmic Hope","date":"2016-02-26T19:26:23.366+0000","title":"Champion Kombienationen","subforum":"Champions & Gameplay","up_votes":1,"down_votes":1,"body":"Hey Leute, was w&auml;re wenn man mit denn Champions eine Art Kombination machen kann. Also wenn zum Beispiel Yasuo seinen Stahlsturm aktiviert ,dass der Autoattack von Caitlyn eine gr&ouml;&szlig;ere Reichweite bekommt oder einfach einen Kritischen Treffer macht ? Dies w&uuml;rde mit zumindest Sinnvoll erscheinen ^^.","replies":[{"poster":"Balmung","date":"2016-02-27T06:28:16.313+0000","up_votes":1,"down_votes":0,"body":"Logik in ein Moba (oder generell die meisten Spiele...) zu bringen würde das Spiel viel zu kompliziert machen. Autoattacks mit \"höherer Range\" durch den Q machen auch keinen Sinn, da die Autoattack bereits fliegen müsste (und daher schon ein Ziel in Reichweite hatte), bevor der Buff drauf kommt.\nWoher er durch \"mehr Wind\" einen garantieren Crit erzielen soll - Range okay, aber Crit?\n\nAußerdem frage ich mich weshalb ausgerechnet Yasuo, welcher schon seine Windwall besitzt, noch mehr Möglichkeiten zur Geschossabwehr benötigt - aus allen möglichen Beispielen exakt das dieses zu wählen ist schon ein wenig skuril.\nAlles in allem wären das aber A: viel zu viele spezifische Interaktionen, B: Extrem viele Möglichkeiten für Bugs und C: Logiklöcher wären noch immer nicht stopfbar, ohne einige Champs völlig aus dem Ruder laufen zu lassen.","replies":[]},{"poster":"Cosmic Hope","date":"2016-02-26T20:28:24.514+0000","up_votes":1,"down_votes":0,"body":"naja mit Sinnvoll meine ich, dass der Autoaattack stark Beschleunigt wird und somit teoretisch weiter fliegen müsste. Oder wenn Caitlyn gegen Yasuo kämpfen muss und Yasuo seinen Stahlsturm auf Caitlyn einsetzt müsste der Autoaatack von Caitlyn eigentlich zur Seite fliegen ( wegen des Orkans ^^ ) und Yasuo nicht treffen.","replies":[]},{"poster":"Sakunosuke Oda","date":"2016-02-26T19:49:06.210+0000","up_votes":1,"down_votes":0,"body":"Müsste dann die Q von Cait theoretisch nicht weggeschleudert werden?","replies":[]},{"poster":"Zero000","date":"2016-02-26T19:40:11.444+0000","up_votes":1,"down_votes":0,"body":"Warum wäre das Sinnvoll?","replies":[]}]}