{"poster":"Hammermancer","date":"2017-09-20T17:47:05.540+0000","title":"Steraks on melee only is unfairly nerfing proper itemization on three specific cases","subforum":"Gameplay","up_votes":9,"down_votes":9,"body":"Hey guys, while I understand that on certain adcs steraks is being abused I would like to state that there are three champions in the fighter category who are negatively impacted by this change\r\n\r\nthe first champion that comes to mind is of course urgot, of which this is considered a core build item, while the champion could be effective without it He would lose a slot of AD+HP itemization which would force him into a much squishier role or would cut his damage, steraks is a very central part of the general urgot build\r\n\r\n\r\nThe second would be gnar, who also finds this item to be core on many builds, it is important for his mega form but making it useless on his ranged form would be quite frankly very negative on a champion who isn&#039;t overpowered. \r\n\r\nFinally, we have a bit more of an outlying case, the case for intended jayce. Jayce was orginally intended to be a bruiser champion, more of a triforce user, and someone who uses more of his melee kit than he currently does. While it is more common to see a jayce who plays the game running double or triple lethality, this build is actually a non-intended build that works as a side effect of Lethality itemization. While it is powerful on him I am generally convinced that riot will eventually target lethality on jayce for its fairly negative impact on gameplay, at which point he will naturally fall back on his bruiser gameplay style IF it still exists. Bruiser jayce is a significantly more balanced and well rounded approach to the champion but items like steraks would be core on him in that regard\r\n\r\n\r\n\r\nWhile the item needs to be hit from the perspective of certain marksmen I don&#039;t see the restrictions needing to hit these three champions, as they all benefit from the item in a healthy way and use it as intended","replies":[{"poster":"Critmaster Garen","date":"2017-09-20T20:30:43.807+0000","up_votes":9,"down_votes":1,"body":"actually, why does it even matter.\n\nnone of the champions even buy the item. jayce definitely doesnt, gnar doesnt even buy it as a situational item apparantly, and urgot has other options.\n\nwhats the point in catering to champions with an item that they dont even want?","replies":[]},{"poster":"WoonStruck","date":"2017-09-20T20:33:43.497+0000","up_votes":8,"down_votes":1,"body":"OP clearly has not made a good analysis of the current gamestate, proven by what he's said.","replies":[]},{"poster":"Critmaster Garen","date":"2017-09-20T20:13:47.363+0000","up_votes":5,"down_votes":3,"body":"steraks isnt intended as a safety net for ranged champions who failed at kiting. that includes mini gnar and cannon jayce.\n\nthese forms are supposed to be more vulnerable in exchange for the extended range (and mobility in gnars case). especially gnars vulnerability in ranged form is supposed to counter balance the massive power boost he receives in mega form, and is supposed to create a window of weakness.\n\n\nsteraks is an item that was specifically made for melee champions to survive burst damage in the thick of battle. when gnar and jayce are in ranged form, they dont need the extra protection, since they shouldnt be in the middle of a fight unless they made a mistake got caught out of position.\n\ntransformation champions should still be able to benefit from steraks passive in their melee forms, which means making steraks melee only is entirely fair. mega gnar and hammer jayce would still benefit from the item as any other melee champion.\n\nand even in ranged form, gnar and jayce get the extra ad and health. its only the passive that wouldnt trigger.","replies":[{"poster":"Hammermancer","date":"2017-09-20T20:47:57.718+0000","up_votes":2,"down_votes":2,"body":"Gnar, jayce and urgot should be building this item, along with a phage item\n\nthey should all be building hp+damage which would lower jayce's damage anyways due to the itemization that allows this\n\nThe issue is that there isn't much stick, while im not against having reduced effects while ranged, the item should not simply be disabled\n\ngnar: his hp is lower in mini form and therefore he has reduced effect on the shield proc\n\nJayce:  His ranged form has reduced armor and magic resist, and in bruiser build where he would actually be building this,, the damage on his ranged form is actually already significantly lower anyways, so there is literally zero issue with the item on him\n\nurgot: this item was made for shit like urgot, who is classified roughly as a juggernaut.\n\nThe item on jayce and gnar is generally more for their melee forms anyways because of its value, however an actually good jayce (Not just a good player who happens to be rolling jayce at the moment) will not generally be in only once stance the entire time because a good jayce knows all of his combos and that requires weaving in and out of a fight so the item is fine","replies":[{"poster":"Critmaster Garen","date":"2017-09-20T21:08:24.285+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=T3H UB3RN07,realm=NA,application-id=3ErqAdtq,discussion-id=vxaqoVu1,comment-id=00020000,timestamp=2017-09-20T20:47:57.718+0000)\n>\n> Gnar, jayce and urgot should be building this item, along with a phage item\n> \n> they should all be building hp+damage which would lower jayce&#x27;s damage anyways due to the itemization that allows this\n> \n> The issue is that there isn&#x27;t much stick, while im not against having reduced effects while ranged, the item should not simply be disabled\n> \n> gnar: his hp is lower in mini form and therefore he has reduced effect on the shield proc\n> \n> Jayce:  His ranged form has reduced armor and magic resist, and in bruiser build where he would actually be building this,, the damage on his ranged form is actually already significantly lower anyways, so there is literally zero issue with the item on him\n> \n> urgot: this item was made for shit like urgot, who is classified roughly as a juggernaut.\n> \n> The item on jayce and gnar is generally more for their melee forms anyways because of its value, however an actually good jayce (Not just a good player who happens to be rolling jayce at the moment) will not generally be in only once stance the entire time because a good jayce knows all of his combos and that requires weaving in and out of a fight so the item is fine\n\nthe only one this item makes somewhat sense on is urgot.\n\nand making steraks lifeline passive melee only doesnt prevent gnar and jayce from buying it. the passive would only not trigger in their ranged forms when they shouldnt have access to it anyways.","replies":[]}]}]},{"poster":"KuroCaliber","date":"2017-09-20T17:57:59.640+0000","up_votes":4,"down_votes":0,"body":"Jayce can buy Steraks even if its melee only.  Just press R, go hammer and you can buy it.","replies":[{"poster":"Hammermancer","date":"2017-09-20T18:52:32.110+0000","up_votes":3,"down_votes":3,"body":"But it will have effects disabled see tiamat on jayce","replies":[{"poster":"MuffledGarbage","date":"2017-09-20T20:47:52.542+0000","up_votes":1,"down_votes":0,"body":"only in ranged form","replies":[{"poster":"Hammermancer","date":"2017-09-20T21:33:54.803+0000","up_votes":1,"down_votes":2,"body":"yeah thats an issue when half of the time an item is literally deactivated\n\nI already know every single jayce item interaction","replies":[{"poster":"Critmaster Garen","date":"2017-09-20T22:01:27.556+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=T3H UB3RN07,realm=NA,application-id=3ErqAdtq,discussion-id=vxaqoVu1,comment-id=0000000000000000,timestamp=2017-09-20T21:33:54.803+0000)\n>\n> yeah thats an issue when half of the time an item is literally deactivated\n> \n> I already know every single jayce item interaction\n\nso what? the same mechanic exists for items like {{item:3085}} \n\nkayle doesnt get the passive in melee form either and just has to deal with it.","replies":[]},{"poster":"MuffledGarbage","date":"2017-09-20T21:52:39.155+0000","up_votes":1,"down_votes":0,"body":"you still get the AD from tiamat on jayce in ranged form, as such the health and AD from Sterak's would apply in ranged form while the passive would only activate in melee. \n\nLook at that, some more skill expression with a combo of items and mechanical skill.\n\nI'll admit, {{champion:126}}  is already quite mechanically intensive, but at the same time {{champion:64}} {{champion:268}}  and {{champion:92}} are all balanced around being mechanically-skill intensive WHILE still maintaining a fairly balanced state.\n\nIf Riot can balance those three champs around being mechanically intensive, they can let a {{champion:126}}  press R to get the{{item:3053}} shield when he's about to die and give him 1% more to do than simply out-poking any melee toplaners and proceeding to crap on any squishies later in the game with {{item:3142}} and the like.","replies":[]}]}]},{"poster":"Sire Hippington","date":"2017-09-20T23:26:57.138+0000","up_votes":1,"down_votes":0,"body":"The intendet usecase of steraks is to give him that winsow of suriviabillity when he jumps in for the burst in hammer stance duering a teamfight, and that would worke. If he gets catched in his ranged form, he deserves to be squishy(most of the time you'd switch to hammer when beeing jumped on anyway for the extra defstats and the knockback)\nAlso, it doesn't matter what the intentions for jayce once were, he isn't a bruiser by a long shot for serveral seasons, and unless riot changes alot about game and jayce, he will stay a glasscannon that dominates 1v1 situations.(though i do agree that bruiser jayce would be a healthier desing IF riot actually actively pushed himm towards that)\nAs for Gnar, i haven't seen any gnar going for it, not even as situational, so why would one call it even core on him?\n\nThe only case that in the current state of the game really would loose it as an intendet core item would be urgot, but he has other options and might actually have interesting designspace if you say he has (short)ranged AAs but still counts as melee and balance him around that feature.\n\nSo overall, if it proofs to challengeing to balance with rangeds in the mix, it's the better call to make it melee only and fix it for them.","replies":[]}]}]},{"poster":"Critmaster Garen","date":"2017-09-20T20:18:33.613+0000","up_votes":4,"down_votes":1,"body":"as far as ugot goes, its not a big deal. steraks isnt a core item on him anyway. if he wants burst resistance, deaths dance and g.a. are better options.","replies":[]},{"poster":"Tychusfindlay918","date":"2017-09-21T02:42:59.010+0000","up_votes":1,"down_votes":0,"body":"When has gnar ever bought steraks gage without trolling.\n\nGnar, since the dawn of mankind, has always gone cleaver mallet tank.","replies":[]},{"poster":"Spoofghoul","date":"2017-09-20T22:17:49.837+0000","up_votes":1,"down_votes":0,"body":"couldn't care less about gayce and gnor\n\nThey are aids af anyway \n\nAnd while i have built it on urgot\n\nIt's not at all core\n\nhell people still build {{item:3022}} on him. . . \n\nlike why? same with steraks, why? they aren't bad items, but there are much much much much much better options then these\n\nThey could also make urgot ''melee'' problem fixed","replies":[{"poster":"DragonShea","date":"2017-09-20T22:21:52.403+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Spoofghoul,realm=EUW,application-id=3ErqAdtq,discussion-id=vxaqoVu1,comment-id=0007,timestamp=2017-09-20T22:17:49.837+0000)\n>\n> couldn&#x27;t care less about gayce and gnor\n> \n> They are aids af anyway \n> \n> And while i have built it on urgot\n> \n> It&#x27;s not at all core\n> \n> hell people still build {{item:3022}} on him. . . \n> \n> like why? same with steraks, why? they aren&#x27;t bad items, but there are much much much much much better options then these\n> \n> They could also make urgot &#x27;&#x27;melee&#x27;&#x27; problem fixed\n\nWhat Riot need to go is to quit being lazy and make certain champions semi melee. Urgot, Thresh and rakan need to become such champs if they are gonna be able to proc and use Relic shield.","replies":[]}]},{"poster":"I am Pacman","date":"2017-09-20T21:00:45.437+0000","up_votes":1,"down_votes":0,"body":"Wut, people still buy steraks?  Havn't seen that item in ages.\n\nIts at best situational and pretty much only bought on melee champs anyways.  All ranged champs have better options for defense now.","replies":[]},{"poster":"FireDrizzle","date":"2017-09-20T20:08:53.398+0000","up_votes":3,"down_votes":3,"body":"Why even list Gnar? That pos needs a big rework, flash twice on basic ability then chain cc better than Nuatilus for his jungler. Your not safe vs that on xp range if your not playing someone mobile.","replies":[]}]}