{"poster":"Hextech OwI","date":"2018-04-12T12:28:00.589+0000","title":"Reminder that Swain's theme still doesn't play occasionally at the start of the game...","subforum":"Report a Bug","up_votes":2,"down_votes":0,"body":"Please, fix this next patch.\r\nZoe still have hers.\r\nSwain is literally unplayable.","replies":[{"poster":"moonstones","date":"2018-04-12T15:07:44.807+0000","up_votes":3,"down_votes":2,"body":"Hihi! \nIt's actually intended that this music doesn't play 100% of the time.","replies":[{"poster":"Ultîma","date":"2018-04-12T15:22:59.245+0000","up_votes":5,"down_votes":0,"body":"To OP's point, why does Zoe always get to hear her theme, but not Swain? Why shouldn't we hear the Noxian anthem when playing as its political leader? I feel like this is a _big_ missed opportunity to make the lore stand out in-game.\n\nEdit: Can your team please, _please_ look into adding a part of Irelia's theme at the start of the game when playing her? That song is way too good to be forgotten after her login screen is replaced by another.","replies":[{"poster":"Hextech OwI","date":"2018-04-12T16:16:06.171+0000","up_votes":4,"down_votes":0,"body":"Actually, I'm complaining about Swain's theme not playing because of a bug that hasn't been fixed.","replies":[{"poster":"Interlocutioner","date":"2018-04-13T06:37:13.139+0000","up_votes":2,"down_votes":0,"body":"Hey Santo, the fix is coming! I spoke to QA today. Sorry for the wait!","replies":[]}]}]},{"poster":"Hextech OwI","date":"2018-04-12T16:11:26.372+0000","up_votes":2,"down_votes":0,"body":"Hi!\nI am aware of Swain's theme not playing all the time. I had a discussion with Riot Scathlocke who told me that the theme plays roughly 30% of the time (out of RNG), followed by Riot Interlocutionner who told me there was effectively a bug preventing the theme to play.\nI expected it to be fixed this patch but in around 10 games of Swain I haven't heard it once (in this patch).\nUnless I am extremely unlucky, I should have heard the theme at least once so I concluded that the bug hasn't been fixed :/","replies":[]},{"poster":"AmWhaleIRL","date":"2018-04-12T17:23:44.595+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Riot KateyKhaos,realm=NA,application-id=LqLKtMpN,discussion-id=vJ1dzjj1,comment-id=0001,timestamp=2018-04-12T15:07:44.807+0000)\n>\n> Hihi! \n> It&#x27;s actually intended that this music doesn&#x27;t play 100% of the time.\n\nWhy is it intended this way? I haven't heard anybody complain about it. It feels and sounds awesome to have the theme play when I walk on up in my lane. It fills me with a sense of power, which is how players should feel when playing The Grand General of Noxus. \nI also feel like it's a missed opportunity. Maybe add an option for players to check off whether they want it to play or not when they enter game as Swain? Kinda like how Dj Sona has her own thing in the tab menu. \nThis way if anybody dislikes it, they won't have to listen to it ever again, rather than just sometimes. And the people who do love it get to hear it 😊.\nAlso I have also not heard Swain's theme play for probably over a week now. Although that would total to only maybe 10 - 20 games 🤔.","replies":[]}]}]}