{"poster":"Hextech OwI","date":"2018-03-20T07:34:15.126+0000","title":"Sandstorm Katarina's Taunt plays with a lower framerate in Aram.","subforum":"Report a Bug","embed":{"description":"League of Legends Visual bug Patch 8.5","url":"https://www.youtube.com/watch?v=l9Qk1QuQn-c&feature=youtu.be","image":"https://i.ytimg.com/vi/l9Qk1QuQn-c/hqdefault.jpg"},"up_votes":1,"down_votes":0,"body":"Not sure it is visible enough on the video since it has been recorded with the incorporated Highlight tool.\r\nThe game is at a fix 60 FPS and Katarina&#039;s animation is more at 15-20 FPS.","replies":[{"poster":"Melledoneus","date":"2018-03-20T16:43:43.337+0000","up_votes":2,"down_votes":0,"body":"Actually, this happens in Summoner's Rift as well.","replies":[]},{"poster":"moonstones","date":"2018-03-22T21:42:32.050+0000","up_votes":1,"down_votes":0,"body":"Hey Santozed - \n\nMyself and the animator who actually worked on this lady opened up her animation files and took a look. Most of our animations are set to 30/30 FPS. Her taunt is set to 60, which is intended! Back, way long ago when this skin was made, the only way to eliminate jitter of the model and her weapons was to set it up this way. Looking at the video, I'm not totally getting what you're meaning - do you mean that the flip just appears slower than you think it should?","replies":[{"poster":"Hextech OwI","date":"2018-03-23T01:04:49.794+0000","up_votes":1,"down_votes":0,"body":"Hello, the issue I experienced was that Sandstorm Katarina's taunt animation was a lot less fluid than the rest of the game. It looked like it was missing some in-between animation frames making the animation seem like it played at 15 frames per seconds, while the rest of the game was as fluid as usual (at 60 FPS). \n\nhttps://www.geeksaresexy.net/wp-content/uploads/2015/06/fpsdemo1.gif\n\nAs I thought, it is not visible at all in the video since I recorded with the in-game recorder, which doesn't reach 60 fps.\n\nWhen it happened, the game was in version 8.5, maybe it somehow fixed itself since...","replies":[{"poster":"moonstones","date":"2018-03-26T16:22:48.590+0000","up_votes":1,"down_votes":0,"body":"I don't think we've touched her in quite some time, but I loaded her up in essentially practice tool, and nothing seems horribly out of place. ;-;","replies":[{"poster":"Hextech OwI","date":"2018-03-26T20:15:35.365+0000","up_votes":1,"down_votes":0,"body":"I'll try to record with another software when I have the time so I can show you at 60 FPS.","replies":[]}]}]}]}]}