{"poster":"epickill3r","date":"2015-11-28T14:14:00.908+0000","title":"Bots sind irgendwie zu schwach :0","subforum":"Champions & Gameplay","up_votes":11,"down_votes":1,"body":"Also, ich habe ja fr&uuml;her gerne mal gegen Bots gespielt, aber mir ist aufgefallen, das die lieben Bots irgendwie ziemlich &quot;dumm&quot; sind.\nIch t&ouml;te einen Bot fast, er l&auml;uft ein paar Schritte, stellt sich dort hin wo man ihn t&ouml;ten kann, und bewegt sich auch nicht so schnell da weg.\nIch w&uuml;rde mir gerne mal w&uuml;nschen, Bots zu buffen oder vielleicht &quot;hard&quot; Bots einzuf&uuml;hren ._. ich finde die momentanen Bots zu schwach.\nIch denke, da geht es einigen genau wie mir weil ich find es echt schade, wenn man neu beim Spiel ist wenn man etwas besser ist das man gegen solche\nSchw&auml;chlinge k&auml;mpfen muss =) .Ich w&uuml;rde mich freuen wenn es mal ein Bot Rework geben w&uuml;rde, das f&auml;nde ich echt toll {{champion:32}} und auch mal neue\nChamps als Bots.\n\nWenn das umgesetzt werden k&ouml;nnte, w&uuml;rde ich mich echt freuen!\n\n\nepickill3r \n{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"KeylanX","date":"2015-11-28T16:12:23.314+0000","up_votes":2,"down_votes":0,"body":"Ich habe vor Kurzem (wieder) angefangen LoL zu spielen und bin in wahrsten Sinne des Wortes ein Noob. Ich spiele zu 100% Bot-Games, da ich mich noch lange nicht bereit fühle mich ins \"Haifischbecken\" der normalen Spiele zu begeben. Mittlerweile klappt die Laning-Phase recht ordentlich mit einigen Chars und ich habe den Supporter für mich entdeckt bzw. habe viel Spass an der Spielart. \n\nDas Problem ist allerdings, man bleibt irgendwann in der Entwicklung einfach stehen. Als Beispiel das Warden... durchaus eine Aufgabe die dem Supporter zukommt. Man kann sich Guides durchlesen, und nach 10 Spielen hat man alles wieder vergessen, da man Wards bei Bots einfach nicht braucht. Bots verstecken sich nicht in Büschen, machen (wenn überhaupt) selten den Drachen oder Baron, und meist ganken sie ziemlich offensichtlich.\n\nMan \"versteht\" als Anfänger das Warden einfach nicht wirklich, da der Nutzen sich in Bot-Games nicht zeigt. Klar stellt man hier und da mal son Ding auf, aber der \"Aha-Effekt\" will einfach nicht kommen. Nun kann ich mir (selbst oder grade) als Anfänger sehr gut vorstellen, das ein Supporter ohne Ahnung vom Warden, nicht wirklich liebevoll in den normalen Games wilkommen geheissen wird.\n\nKlar sollen Bot-Games dazu da sein, herumzuspielen, zu lernen und zu experimentieren. Mal mit seinem Lieblings-Champ gucken, wie es in anderen Lanes so läuft, aber dafür sind die aktuellen Schwierigkeitsgrade gar nicht so schlecht. Kein Anfänger will Bots die einen sinnlos umhauen weil sie gebufft wurden bis unter die Hutkrempe, aber ein Bot-Game in \"hard\", wo die Bots einfach mal pfiffiger sind, bessere Strategien fahren und etwas mehr \"killer-Instinkt\" haben, würde ich sehr begrüßen.\n\nBisher habe ich das Gefühl, das der Sprung in die normalen Games wie ein Sprung in eine andere Welt sein wird... leider auch in eine, die Fehler nicht verzeiht. Vielleicht sollte ich mit lvl 20 schon längst in normalen Games herumturnen, keine Ahnung, aber ich habe einfach das Gefühl, dass die Bots mir nicht genug beibringen um den Sprung wirklich zu wagen.","replies":[{"poster":"Taloz","date":"2015-11-28T20:03:27.143+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=KeylanX,realm=EUW,application-id=Wj1wcocU,discussion-id=1NciyAxn,comment-id=0001,timestamp=2015-11-28T16:12:23.314+0000)\n>\n> Ich habe vor Kurzem (wieder) angefangen LoL zu spielen und bin in wahrsten Sinne des Wortes ein Noob. Ich spiele zu 100% Bot-Games, da ich mich noch lange nicht bereit fühle mich ins \"Haifischbecken\" der normalen Spiele zu begeben. Mittlerweile klappt die Laning-Phase recht ordentlich mit einigen Chars und ich habe den Supporter für mich entdeckt bzw. habe viel Spass an der Spielart. \n> \n> Das Problem ist allerdings, man bleibt irgendwann in der Entwicklung einfach stehen. Als Beispiel das Warden... durchaus eine Aufgabe die dem Supporter zukommt. Man kann sich Guides durchlesen, und nach 10 Spielen hat man alles wieder vergessen, da man Wards bei Bots einfach nicht braucht. Bots verstecken sich nicht in Büschen, machen (wenn überhaupt) selten den Drachen oder Baron, und meist ganken sie ziemlich offensichtlich.\n> \n> Man \"versteht\" als Anfänger das Warden einfach nicht wirklich, da der Nutzen sich in Bot-Games nicht zeigt. Klar stellt man hier und da mal son Ding auf, aber der \"Aha-Effekt\" will einfach nicht kommen. Nun kann ich mir (selbst oder grade) als Anfänger sehr gut vorstellen, das ein Supporter ohne Ahnung vom Warden, nicht wirklich liebevoll in den normalen Games wilkommen geheissen wird.\n> \n> Klar sollen Bot-Games dazu da sein, herumzuspielen, zu lernen und zu experimentieren. Mal mit seinem Lieblings-Champ gucken, wie es in anderen Lanes so läuft, aber dafür sind die aktuellen Schwierigkeitsgrade gar nicht so schlecht. Kein Anfänger will Bots die einen sinnlos umhauen weil sie gebufft wurden bis unter die Hutkrempe, aber ein Bot-Game in \"hard\", wo die Bots einfach mal pfiffiger sind, bessere Strategien fahren und etwas mehr \"killer-Instinkt\" haben, würde ich sehr begrüßen.\n> \n> Bisher habe ich das Gefühl, das der Sprung in die normalen Games wie ein Sprung in eine andere Welt sein wird... leider auch in eine, die Fehler nicht verzeiht. Vielleicht sollte ich mit lvl 20 schon längst in normalen Games herumturnen, keine Ahnung, aber ich habe einfach das Gefühl, dass die Bots mir nicht genug beibringen um den Sprung wirklich zu wagen.\n\nDas ist das schlimmste was du machen kannst. Je länger du wartest, umso härter wirst du später aufs Maul bekommen.\nIch bin damals mit Lvl 1 ins Normal (damals ging das noch) und bin froh diesen Weg gegangen zu sein.\nSpieler die Angst vor Normals haben erfüllen in meinem \"Gaming Bekanntenkreis\" sogar ein gewisses Klischee und sind dann meist, wenn sie mal von Freunden oder Ähnliches zu einem Normal überredet werden, ein gefundenes Fressen.","replies":[]},{"poster":"Kvothe100","date":"2015-11-28T21:59:26.208+0000","up_votes":2,"down_votes":0,"body":"Such dir am besten ein paar leute, die dich nicht flamen und probiers aus, denn wie du schon selbst sagtest durch bot-games kommst du irgendwann einfach nicht weiter","replies":[]},{"poster":"Stealth Cat","date":"2015-11-28T16:20:47.794+0000","up_votes":2,"down_votes":0,"body":"Hey,\nich habe auch erst mit ~Level 19 angefangen Normal Games zu spielen, die ersten 1-10 Spiele dürften etwas-sehr unausgeglichen sein, allerdings pendelt sich das System dann ein, da es dich dann einfach mit anderen Spielern deines Könnens zusammensteckt (das könnten auch Level 10 Spieler sein, wenn ihr \"Skillmäßig\" gleich drauf seid).\nAlso keine Angst vor normalen Spielen, die anderen sind auch nur Menschen.\nMFG E5 Rekhyten","replies":[{"poster":"KeylanX","date":"2015-11-29T07:29:41.210+0000","up_votes":1,"down_votes":0,"body":"Danke fürs Mutmachen. Habe mal 5 Spiele auf normal gemacht und wurde sowas von haushoch und geradezu vernichtend geschlagen... kann den Frust nicht mal beschreiben. Habe mir meine Gegner mal angeschaut, und festgestellt das ich zum Teil gegen Gold V gespielt habe. Ich denke ich werde weiterhin Bot-Games machen bis ich (gefühlt 2017) zumindest mal meine Runenseiten voll habe. Das Spiel zu deinstallieren ist ebenfalls eine Möglichkeit die ich nicht mehr ausschliesse. Habe vielleicht einfach nicht das dicke Fell mich als Solokämpfer hier durchzusterben.","replies":[{"poster":"CooL Ice Tea","date":"2015-11-30T07:06:53.706+0000","up_votes":1,"down_votes":0,"body":"Bringt in der tat garnichts. Mit solch einer Einstellung lernt man kein Fahrrad fahren, Schwimmen, Fußball spielen oder lesen, schreiben, arbeiten.\n\nMan muss mir Rückschlägen in allem klar kommen. Meine Freundin hat nach Monaten ohne LoL einfach angefangen wieder Arams zu spielen. Da macht dich keiner dumm an und du kannst skillshots üben da der Gegner diesen ausweicht bzw. selber üben auszuweichen.","replies":[]},{"poster":"A Dragons Heart","date":"2015-11-29T07:43:58.128+0000","up_votes":1,"down_votes":0,"body":"Das war bei keinem anders. Jeder wurde in seinen ersten Normal-Games total platt gemacht, das ist normal. Allerdings bringt es da nichts weiterhin Bot-Games zu spielen. Hier muss man einfach ins kalte Wasser springen, denn besser wird man nur durch Übung.\nMfG","replies":[]}]}]}]},{"poster":"Sihari","date":"2015-11-28T16:18:33.833+0000","up_votes":3,"down_votes":0,"body":"Einen Hard-Mode für Bots fände ich auch gut~\nWie oft man einfach zu hören bekommt, dass man einen neuen Champion lieber erstmal gegen Bots üben sollte, bevor man damit in ein Normal geht ist echt unsinnig, wenn man bedenkt, dass die Bots so viel schlechter als die Spieler aus dem Normal sind.\nGegen die aktuellen Bots kann ich noch so hart rocken, aber gegen echte Spieler ist das einfach eine ganz andere Ebene. \nEine Zwischenstufe wäre da also echt nett ^-^","replies":[{"poster":"A Dragons Heart","date":"2015-11-29T07:40:20.680+0000","up_votes":2,"down_votes":0,"body":"Dass man erst gegen Bots üben sollte, bezieht sich meiner Meinung nach darauf, überhaupt erstmal ein Gespür für diesen Champion zu bekommen bzw. seine Mechaniken unter die Lupe zu nehmen, was sich im direkten Duell gegen Spieler oft als schwer erweist.","replies":[]}]},{"poster":"GoW Linc","date":"2015-11-28T14:23:43.119+0000","up_votes":3,"down_votes":0,"body":"u know the doom bots ^^ du willst es nicht :D\naber hard wäre schön gut, zumindest wo die bots nicht immer in ihren tod laufen","replies":[{"poster":"epickill3r","date":"2015-11-28T14:25:24.801+0000","up_votes":2,"down_votes":0,"body":"Neee die Doom Bots bloß nicht als neuen Spielmodus für Bots ._.\nAber würde es echt feiern eine neue Schwierigkeits-Stufe einzuführen :O","replies":[]}]},{"poster":"epickill3r","date":"2015-11-28T17:17:00.606+0000","up_votes":2,"down_votes":0,"body":"Es scheint so, der LoL Community würde mein Vorschlag gefallen.\nFinde ich echt nett von euch auch an der Umfrage teilzunehmen und Kommentare zu schreiben <3\n\nRiot bitte setzt es um für uns =)","replies":[]},{"poster":"PenobertLP3","date":"2015-12-02T15:05:52.919+0000","up_votes":1,"down_votes":0,"body":"Ich finde Riot könnte ja auch mal wieder das Event mit den Horror bots machen und ich bin ebenfalls dafür, dass mal \"Hard Bots\" hinzugefügt werden!","replies":[]},{"poster":"Dr Cappuccino","date":"2015-11-29T15:23:49.963+0000","up_votes":1,"down_votes":0,"body":"Ich hab ma ne Frage die auch Bots betrifft, und zwar ob es geplant ist von Riot neue Bots dem Spiel hinzuzufügen. Es gibt ja immer mehr Champs, aber nur ein Bruchteil existiert auch als Bots.","replies":[{"poster":"epickill3r","date":"2015-11-30T13:12:21.616+0000","up_votes":1,"down_votes":0,"body":"Ich wüsste das jetzt nicht xd aber ich denke, die werden in naher Zukunft hoffentlich mal ein paar neue Bots hinzufügen :)","replies":[]}]},{"poster":"Samuraisub","date":"2015-11-28T22:52:21.437+0000","up_votes":1,"down_votes":0,"body":"Doom bots of doom wäre auch cool. Also wenn sie es neben den leichten mittleren und den harten göbe und nicht als special","replies":[]},{"poster":"Kvothe100","date":"2015-11-28T22:03:32.018+0000","up_votes":1,"down_votes":0,"body":"Ich glaube, dass das nicht so ganz einfach ist, schließlich hängt bei lol alles von Entscheidungen ab die man in quasi jedem game anders treffen muss und das einer KI gut bei zu bringen ist nicht so einfach. Natürlich könnte man die Reaktionszeit der bots so hoch schrauben das sie jedem skillshot dogen aber das wäre ja auch irgendwie doof.","replies":[]},{"poster":"GoW Linc","date":"2015-11-28T17:34:24.250+0000","up_votes":1,"down_votes":0,"body":"das problem ist nur es ist schwer, sehr schwer stärkere bots zu programmieren, weshalb es nicht umgesetzt wird. selbst die doom bots waren nicht gut, hatten nur bessere Fähigkeiten","replies":[]}]}