{"poster":"K1NG MAMBERROI","date":"2015-04-23T15:23:07.618+0000","title":"como es eso de que zed es nocturne?","subforum":"Charlas Generales","up_votes":1,"down_votes":4,"body":"he visto varios videos donde dice que zed posiblemente sea nocturne alguien sabe algo?","replies":[{"poster":"Delt Dragon","date":"2015-04-23T21:37:36.210+0000","up_votes":2,"down_votes":0,"body":"La \"teoria\" de Zed y Nocturne es solo una ridicules sin fundamentos, debido a un par de casualidades (El splash art de la skin electrica de Zed aparece en una pose similar a la de Nocturne, y ambos son personajes relacionados con sombras)\n\nhttp://i.imgur.com/5kpPp0V.png\n\n--------------------------------------------------------------------------------------------------\n\nSin embargo, la teoria de Jarvan y Leblanc, esta basada en la antigua historia de League of Legends, el Journal of Justice y una imagen de este mismo, donde se muestra que la reflexion de Jarvan, es Leblanc.\n\nPD: El JoJ era un diario ficticio de Valoran donde se mostraban diferentes noticias relacionadas con la Liga de Leyendas y sus campeones. Para mas informacion puedes leerlos en ingles en el siguiente enlace:\n\nhttp://leagueoflegends.wikia.com/wiki/Category:The_Journal_of_Justice_Issues\n\nLa foto de Leblanc y Jarvan es esta:\n\nhttp://leagueoflegends.wikia.com/wiki/The_Journal_of_Justice:_Volume_1,_Issue_25\nhttp://riot-web-\n\nhttp://img3.wikia.nocookie.net/__cb20110723024824/leagueoflegends/images/e/ee/JoJ_War_in_Kalamanda.JPG\n\nSi leias los JoJ despues de esa imagen, en comparacion a los anteriores, se notaba un cambio en la actitud de Jarvan.","replies":[]},{"poster":"Mohno","date":"2015-04-23T15:31:33.510+0000","up_votes":1,"down_votes":0,"body":"Son teorias que crea la gente... es como cuando dicen que LB es Jarvan... Algo asi pasa con Zed y Nocturne, tienen un gran parecido y dicen que Nocturne es Zed consumido totalmente por las sombras.","replies":[{"poster":"Mat Voyny","date":"2015-04-23T21:33:41.899+0000","up_votes":2,"down_votes":0,"body":"creo que la teoria de J4 y LB era que, cuando J4 era \"atrapado\" por Urgot, en esa emboscada que sufrió, Urgot en verdad lo mató antes de volver a noxus (o creo que Sion, no me acuerdo :p), la cosa es que todo esto fue un plan para inmiscuir a noxus secretamente en los planes de demacia, haciendo a LeBlanc la Máxima espía al suplantar a Jarvan IV en medio de la corte real, a esto se refiere por diferentes frases o muy parecidas o que responden a frases de su \"contraparte\" bueno, eso me acuerdo xD","replies":[]},{"poster":"Neoburstx","date":"2015-04-23T16:05:51.202+0000","up_votes":1,"down_votes":0,"body":"que genial suena eso, sabes algo mas???","replies":[{"poster":"Mohno","date":"2015-04-23T16:07:41.236+0000","up_votes":1,"down_votes":0,"body":"Busca en yutub... ahi vi todo esto xD","replies":[]}]}]},{"poster":"Lucrexio","date":"2015-04-23T19:19:36.406+0000","up_votes":2,"down_votes":0,"body":"{{champion:11}}  es {{champion:24}}  cuando se mandó la {{item:3211}}","replies":[]},{"poster":"Ryoga","date":"2015-04-23T18:06:30.079+0000","up_votes":1,"down_votes":0,"body":"le blanc jarvan?\n\nok, suficiente internet x hoy ._.","replies":[]},{"poster":"AporroGrantz","date":"2015-04-23T15:39:22.730+0000","up_votes":1,"down_votes":0,"body":"ves muchas peliculas","replies":[]}]}