{"poster":"Chilavert82IT","date":"2019-02-25T19:08:07.050+0000","title":"Impossibile accedere al Login","subforum":"Aiuto e supporto","up_votes":1,"down_votes":0,"body":"Salve a tutti,\r\nun piccolo aiuto tecnico per la dolce metà, con la premessa che:\r\n\r\nA) E' già stato mandato un ticket alla Riot, è in attesa di risposta\r\nB) E' stata provata ogni opzione possibile, disinstallazione e reinstallazione compresa, con l'Hextech Repair Tool\r\nC) Alla Riot è stato allegato il log dell'Hextech Repair Tool visto che sicuramente lo chiederanno\r\nD) Non è stato installato/disinstallato nulla dal PC, il problema non c'era, si è presentato e non accenna a sparire\r\nE) Firewall disattivati, nessun antivirus attivo\r\n\r\nLa scorsa patch ha riscontrato un problema in fase d'installazione: è rimasta bloccata ed è stata costretta a chiudere il client.\r\nOra ogni volta che lo avvia appare il logo di League of Legends, come di consueto, ma non si apre la schermata di login: semplicemente l'applicazione si chiude da sola senza neppure rimanere aperta in background nei processi.\r\nAbbiamo provato, oltre l'Hextech Repair Tool, tutta una serie di soluzioni alternative, tra cui l'avvio come amministratrice e la cancellazione delle cartelle della patch... ma niente: doppio click, appare il logo, rimane per un minuto abbondante, sparisce, niente... impossibilità ad arrivare alla schermata di Login.\r\nHo provato a cercare le peggio soluzioni su Internet, non è l'unica che ha incontrato questo problema, ma tutte sono senza risposta.\r\nSe avete voi la soluzioni o idee e consigli su prove da fare, scrivetele pure nei commenti.\r\nGrazie anticipatamente per le risposte.","replies":[{"poster":"Vendonsi Bibite","date":"2019-02-25T21:44:52.928+0000","up_votes":1,"down_votes":0,"body":"Vai nella cartella di installazione di lol, taglia tutto ciò che sta in config e incollalo in una cartella da parte per tenerne una copia di sicurezza, riavvia il pc e prova così ad avviare il client...","replies":[]}]}