{"poster":"Kind Prow","date":"2018-01-13T00:54:46.029+0000","title":"Eine verbliebene Antrittsrede von KP","subforum":"Allgemeiner Chat","up_votes":10,"down_votes":4,"body":"#Meine lieben Hinterhergebliebenen,#\r\n\r\nviel will ich nicht verlieren, aber einige wenige schw&uuml;lstige Worte werden dem geneigten Leser zu Gem&uuml;te f&uuml;hren doch gezwungen werden. Daher nun zuvorderst die Danksagungen. Den Part, den ihr gern &uuml;berspringen k&ouml;nnt.\r\n\r\n*R&auml;usper*  Ich danke: Dem Menschen, der wie kein anderer daran schuld ist, dass ich dem Offtopic nachlief wie ein streunender Hund: Pingu. Ein wirklich bemerkenswerter Bahnfahrer, der. Als n&auml;chstes bedanke ich mich bei all jenen, denen mein Gelaber nicht auf den Sack ging, und derentwegen ich es immer wieder genossen habe, ins Offtopic zur&uuml;ckzukommen. Weiterhin, denn es muss ja sein, bedanke ich mich nat&uuml;rlich bei den verzweifelten Leuten, die keine andere M&ouml;glichkeit sahen, als ihre Stimme mir zu geben. Danke daf&uuml;r. Zuallerletzt, dann habt ihrs auch schon geschafft, bedanke ich mich bei all meinen Vorg&auml;ngern in diesem Amt, dass sie ihr bestes gegeben haben, dieser Gruppe Leben einzuhauchen, so wie ich auch mein Bestes geben werde. Aber da von nix bekanntlich nix kommt, muss et von mir mehr geben.\r\n\r\nFangen wir mit der Erf&uuml;llung meiner Wahlversprecher an. Ich **kr&ouml;ne** El Pingu, den S&auml;ufer, zum **K&ouml;nig** und rufe damit das zweite Duomvirat in der Geschichte des Offtopics aus. Kraft meines Amtes verbanne ich ihn aus dem OT, auf die andere Seite des Flusses.\r\n\r\nWeiterhin hebe ich alle Minister&auml;mter auf. Davon unber&uuml;hrt bleibt der Status des Wahlleiters und verschiedener anderer Positionen, die nicht unter die Minister z&auml;hlen. Weiterhin bleibt Zamonianer Infrastrukturminister und Markishi R&uuml;mmelbierminister.\r\nNeu besetzen werde ich den Posten des Ministers f&uuml;r innere Angelegenheiten und Dolmetscherei: Based Bird Jesus\r\nSeine Aufgabenbereiche werden in der Aufzucht und Pflege der Trolle im K&ouml;nigreich, sowie die die Versorgung des OTs mit aus irgendeiner Ecke hervorgekramten Witzigkeiten sein.\r\nDer Minister f&uuml;r Zeugs das ver&auml;ndert werden muss, wird Yjuq sein. Man k&ouml;nnte auch Minister f&uuml;r Ver&auml;nderungen oder Vorsitzender des Progressionsministeriums sein. Er wird eine wertvolle Hilfe im Kampf gegen die Langeweile und Ver&ouml;dung darstellen.\r\n\r\nUm meine ersten Amtshandlungen vorerst abzuschlie&szlig;en, gebe ich hiermit Pudding den Status eines vollwertigen Mittagessens und ernenne Kartoffelsuppe zum Nationalgericht. Denn die ist saulecker.\r\n\r\n\r\nF&uuml;r alle Nebenbeileser: hier die Punkte, die meine Regenschaft mit sich bringen wird:\r\n- kein gutes Wetter. Haupts&auml;chlich Regen. Eklig\r\n- ich kr&ouml;ne El Pingu zum K&ouml;nig und verbanne ihn aus dem K&ouml;nigreich\r\n- ich setze alle Minster ab und ernenne neue(und alte) \r\n                      - Markishi bleibt Wahlleiter und R&uuml;mmelbierminister\r\n                      - Zamonianer bleibt INfrastrukturminister\r\n                      - Based Bird jesus wird Minister f&uuml;r innere Angelegenheiten und Organe\r\n                      - Yjuq wird Minister f&uuml;r Neues Ged&ouml;ns und Ver&auml;nderungen\r\n- Pudding ist nun ein vollwertiges Mittagessen\r\n- Kartoffelsuppe ist nun das Nationalgericht des OTs\r\n\r\nDie schwierigste alle Fragen habe ich mir zum Schluss aufgehoben. Die Frage nach der Schreibweise meines royalen Namens samt Titel. Meineserachtens klingt die Version mit dem zweiten Part oder den Initialen am besten. Daher werde ich K&ouml;nig Prow oder K&ouml;nig KP der Elfte sein.\r\nIch w&uuml;nsche euch ein wundervolles Wochenende, genie&szlig;t eure Kartoffelsuppe. Fragen d&uuml;rfen gerne gestellt werden.","replies":[{"poster":"Eibert Rümmel","date":"2018-01-13T11:52:55.117+0000","up_votes":2,"down_votes":0,"body":"krieg der kartofelsuppe ich verlange Fleich","replies":[{"poster":"Maexle","date":"2018-01-13T14:37:00.847+0000","up_votes":1,"down_votes":0,"body":"Ich schließe mich an! \n{{champion:17}}","replies":[{"poster":"Purifying Angel","date":"2018-01-14T02:18:27.606+0000","up_votes":1,"down_votes":0,"body":"Ich ebenfalls, kartoffeln mögen gesund sein aber ein echter Krieger braucht fleisch zwischen seinen Zähnen.","replies":[]}]}]},{"poster":"Megamaexx","date":"2018-01-13T09:10:24.328+0000","up_votes":2,"down_votes":0,"body":"Möge das Ende der Anfang sein. Amen.","replies":[]},{"poster":"The mute Swan","date":"2018-01-13T07:36:59.875+0000","up_votes":2,"down_votes":0,"body":"Umh... als nicht-OTler bin ich nicht dein Untertan, du heuchlerischer König!!!!\n\nDu hast keine Macht über mich!\n\nHoch lebe die Piraterie!\n\nArrrrrrrrr!!!\n\nDich werd ich Moses Gesetz spüren lassen, du Landlubber!","replies":[]},{"poster":"potato draven","date":"2018-01-13T00:56:29.970+0000","up_votes":2,"down_votes":0,"body":"tldr","replies":[]},{"poster":"Kind Prow","date":"2018-01-14T12:10:47.039+0000","up_votes":1,"down_votes":0,"body":"Der Herr König braucht eine Leibgarde. Wenn ihr euch dieser Aufgabe gewachsen fühlt, so seid willkommen.\n\nGelstelzte Ausdrucksweise: Check!","replies":[]},{"poster":"Kind Prow","date":"2018-01-13T00:58:35.264+0000","up_votes":1,"down_votes":0,"body":"Kurz zusammengefasst: das Forum muss sich auf einiges gefasst machen.","replies":[{"poster":"Purifying Angel","date":"2018-01-14T02:21:31.751+0000","up_votes":1,"down_votes":0,"body":"Hmm, ist ein Ritter in Rüstung nun ein Pirat oder ein Kämpfer für sein Königreich... ? Braucht der werte König überhaupt eine treue Leibgarde? Wenn nicht so haben doch sicher Piraten einen nutzen für einen Ritter der dunklen Seite ;). Nun ja","replies":[]}]},{"poster":"Kind Prow","date":"2018-01-13T21:16:24.737+0000","up_votes":1,"down_votes":0,"body":"Ja, maexle, vorerst bleibt dir das Amt des Weddingplanners erhalten.\n\nRätsel und Forenspiele werden geduldet. Das ist meine Einstellung.\n\nIn kartoffelsuppe sind Würste drin. Wat willste denn noch?","replies":[]},{"poster":"Dr Madscientist","date":"2018-01-13T16:58:34.732+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Dr. Mundo)\n>\n>„Handle nur nach derjenigen Maxime, durch die du zugleich wollen kannst, dass sie ein allgemeines Gesetz werde.“","replies":[]},{"poster":"Maexle","date":"2018-01-13T14:38:26.175+0000","up_votes":1,"down_votes":0,"body":"Also wenn ich das richtig verstanden habe, bleibe ich weiter Weddingplaner, weil das ja kein Ministeramt war?\n{{champion:17}}","replies":[]},{"poster":"Azradan","date":"2018-01-13T10:59:12.349+0000","up_votes":1,"down_votes":0,"body":"Guten Tag werter König KP. der Elfte,\n\nich habe folgende Frage:\nWie ist ihre Einstellung zu Rätseln und Forenspielen?","replies":[]},{"poster":"El Pingu","date":"2018-01-13T08:25:40.389+0000","up_votes":1,"down_votes":0,"body":"Hallo, ersteinmal danke für das Danke.\n\nUnd danke für die Gleichstellung mit anschließender Verbannung. <3\n\nIch werde deinen Regeln nicht folgen und dir ewig im Wege stehen. Versprochen.\n\nWegen dem Problem deines Namens, wieso nennen wir dich nicht \"The König King Prow\" dann wär's in kurz \"TKKP\" das könnte auch ein modernes \"TKKG\" sein. \"Tim, Karl, Klöschen und Petro\"\n\nLg","replies":[]},{"poster":"Azima","date":"2018-01-13T01:47:29.233+0000","up_votes":1,"down_votes":0,"body":"> genießt eure Kartoffelsuppe\n\nBei mir wird es tatsächlich Suppe geben :o Hab gedacht es wäre Kartoffelsuppe - es wird aber eine Gemüsesuppe. Mit Kartoffeln drin! Und mega vielen Würstchen :]","replies":[]},{"poster":"Markishi","date":"2018-01-13T01:28:01.360+0000","up_votes":1,"down_votes":0,"body":"Ha, ich bleibe bei K. Prow, vielleicht setze ich aber manchmal ein König davor :>","replies":[]}]}