{"poster":"Kind Prow","date":"2017-08-08T07:55:59.273+0000","title":"Das Drölfte - Nachrichten","subforum":"Allgemeiner Chat","up_votes":6,"down_votes":2,"body":"Es ist 2 minuten nach halb 3. Mein Name ist Hieronymus Dokten und dies sind die tagesaktuellen Nachrichten.\n\n-_-\n\nSchwaben: der zwanzigjährige Philip Schrader starb bei einem Auffahrunfall, als er gerade mit seinem Fahrrad von der bestandenen Theoriefahrprüfung nach Hause fahren wollte. Im Anschluss an die Verurteilung der neunundsechzig Autofahrer ist eine Trauerzeremonie geplant.\n\nOberpfalzing: Die Verhandlungen der Gewerkschaft der Mastgänse mit dem Großbetrieb Fett & Huhn laufen schlecht. Der Konzern weigert sich weiterhin den Mastgänsen gesünderes Futter zur Verfügung zu stellen. Die Streiks dauern an, es ist weiterhin mit Lieferengpässen zu rechnen, besonders im Bereich um Nürnberg und den Bodensee.\n\nRotterdamm: Der Ozeankreuzer Maria Magdalena Annalena Margaret Schippden sorgte heute für Schlagzeilen. Die Mannschafte meuterte, um die Reederei zu einer Namensänderung des Schiffes zu bewegen. Unglücklicherweise befand sich das Containerschiff zu diesem Zeitpunkt genau in der Hafeneinfahrt, was zu einem halbtägigen Stopp aller Im- und Exporte sowie zu dutzenden Schadenersatzklagen in Millionenhöhe führte. Das Schiff heißt nun Bob.\n\n-_-\n\nHieronymus Dokten mit dem Sport:\n\nDer FC Wildhütten überzeugte heute in der Partie gegen den 2.FC Wildhütten. Auch wenn kein Tor gefallen ist, so wurde der Ball doch immerhin, nach bestätigten Augenzeugenberichten, 5 mal zufällig berührt und einmal vorsätzlich getreten. Trotz Dauerregen war es ein spannendes Match und wir freuen uns schon auf nächste Woche und ein weiteres spannendes Spiel in der Pferdefußballliga.\n\nArmando Amadeo wechselte heute für 4 Millionen Euro vom HSV Oberpfalzingen zur Münchner Philharmonie, wo er zunächst als Auswechsler für den Musikprofessor Dr. Gerald Ödem vorgesehen ist.\n\n-_-\n\nNun das Wetter. Aufgrund der hohen Schulden des Senders ebenfalls präsentiert von Hieronymus Dokten.\n\nAuf Beteigeuze-alpha können sich die Betas auf ein wunderschönes Wochenende freuen, ständiger Regen und gelegentlich auftretende Blitzstürme runden das Gesamtbild durch und durch stürmischer Tage ab.\n\nKältewarnung für Jupiter: stellenweise wird es zu Blitzeis und Froststürmen kommen. Der rote Wirbelsturm geht dieses Wochenende im Südwesten auf und wird dank dräuend dunkler Wolken besonders behaglich bedrohlich aussehen. Das perfekte Wetter für einen Ausflug.\n\nZuletzt noch eine Warnung an die Bewohner von Hasselfluff 6: für Samsluff und Flofftag sind Steinregen und Granithagel angesagt. Bitte bleiben sie im Haus.\n\n-_-\n\nMeine Herren und Damen, mein Name ist Hieronymus Dokten und dies waren die Nachrichten um eine ungenaue und unbeständige Uhrzeit.\nSchalten sie auch das nächste Mal wieder ein. Guten Morgen.\n\n-_-","replies":[{"poster":"Kind Prow","date":"2017-08-08T08:13:52.161+0000","up_votes":2,"down_votes":1,"body":"Bitte? Ich verbitte mir solcherlei Anschuldigungen. Wir sind ein äußerst seriöser Sender mit dem Anspruch tagesaktuelle Themen professionell zu präsentieren.","replies":[{"poster":"Allerbester Biss","date":"2017-08-08T08:39:37.198+0000","up_votes":1,"down_votes":0,"body":"Blub","replies":[]}]},{"poster":"Maexle","date":"2017-08-08T22:52:30.378+0000","up_votes":1,"down_votes":0,"body":"Ein letzter Funke Hoffnung, dass es noch Qualitätsjournalismus in diesem Land gibt!\n{{champion:17}}","replies":[]},{"poster":"Armìnìus","date":"2017-08-08T16:09:39.063+0000","up_votes":1,"down_votes":0,"body":"Nein, ich bin nicht überzeugt..","replies":[]},{"poster":"Fresh Dumbeldore","date":"2017-08-08T08:08:03.989+0000","up_votes":1,"down_votes":0,"body":"me :{{sticker:zombie-brand-mindblown}} \n\n\naber hat mich zum lachen gebracht\n\n{{sticker:slayer-pantheon-thumbs}}","replies":[]}]}