{"poster":"GranpaOCE","date":"2015-03-06T04:10:47.581+0000","title":"So many immature people on league","subforum":"Miscellaneous","up_votes":3,"down_votes":0,"body":"why is there so many immature people on league they rage get toxic and so forth, i am 40 year old man medically retired, i play to win but am chill and depending on the day i can play well others if hands are to sore i play bad, but i always play to win, some kids seem to have issues with me never raging and being older guy lol it is just a game i dont add people to my friends list they add me. strange people need to calm down a bit, am i over looking something or are you meant to rage all the time in league ?","replies":[{"poster":"BarryButcher","date":"2015-03-06T05:07:25.117+0000","up_votes":2,"down_votes":1,"body":"Because your a 40 tear old and everyone else is 14-20. Younger people are emotionally unstable LOL\n\nEspecially in ranked, when they are trying their hardest and really their best is still not good enough to win. They don't realise they are bad, but rather blame others. Like my last game, enemy jungle Diana said \"gg bot fed\" when she had the most deaths on her team and her bot lane actually started the game with a double kill.\n\nPeople rather blame others than themselves. simple.","replies":[]},{"poster":"Garens Harem","date":"2015-03-06T23:42:05.924+0000","up_votes":1,"down_votes":0,"body":">So many immature people on league\n\nmore news at 10","replies":[]},{"poster":"Cakemeisting","date":"2015-03-06T23:07:40.846+0000","up_votes":1,"down_votes":0,"body":"Some people are immature because its a computer game on the internet. Real social interactions are not required. Plus there are many players that are a quarter of your age :) Also because the internet uses American culture (e.g. putting others down, blaming others instead of admitting to their own faults) and linguistics.","replies":[]},{"poster":"Best Talon OCE","date":"2015-03-06T09:01:52.337+0000","up_votes":1,"down_votes":0,"body":"I don't rage and I'm a 16 yr old I despise ragers they try and take all the fun out of the game and make people feel bad about themselves I do swear on occasions after a bull**** nid spear half healths me at close range","replies":[]},{"poster":"Blackavar","date":"2015-03-06T07:50:23.368+0000","up_votes":1,"down_votes":0,"body":"i feel ya bro, i hate it when everyone rages at me if i make like one mistake, i'm not that good at the game but i have never raged. just mute players if you really can't put up with it. just focus on the game","replies":[]},{"poster":"GranpaOCE","date":"2015-03-06T05:44:26.546+0000","up_votes":1,"down_votes":0,"body":"my son plays cod lol im not playing that they rage just as hard","replies":[]},{"poster":"Dwaboutit","date":"2015-03-06T05:29:23.352+0000","up_votes":1,"down_votes":0,"body":"lol play COD and come back, you will think League players are all in their 50's compared to the COD crowd","replies":[]},{"poster":"KidneyxThief","date":"2015-03-06T04:53:18.026+0000","up_votes":1,"down_votes":0,"body":"Raging, trolling, feeding on purpose, blaming others for their own %%%%ty mistakes... all hallmarks of the current OCE community\n\nI hate to say it but you may just have to use the mute function. It's getting to the point with me where i'm muting anyone that i'm not premade with because I can no longer tolerate the %%%%ty people that play this game.","replies":[]},{"poster":"GranpaOCE","date":"2015-03-06T04:38:32.773+0000","up_votes":1,"down_votes":0,"body":"yea i have a few like that it is good","replies":[]},{"poster":"Fog","date":"2015-03-06T04:19:35.985+0000","up_votes":1,"down_votes":0,"body":"It's an attitude problem which seems to stick with a large proportion of the player base of League of Legends. It's an unavoidable thing that we just have to live with. But this is why it's always nice to play with some people you do know. Even just one. I always like having one person in my game on Skype so that I can simply talk to them and ignore everything else in the game.","replies":[]}]}