{"poster":"ßenja","date":"2017-01-19T02:32:10.019+0000","title":"hay alguna forma de que no te quiten puntos por dodgear?","subforum":"Charlas Generales","up_votes":1,"down_votes":4,"body":"Estaba tranquilito y me met&iacute; a ranked y de repente un bebe le toco soporte y empez&oacute; a decir que no jugar&iacute;a y que le cambiaran linea, despu&eacute;s de que nadie escribiera nada dijo &quot;voy troll gg izi mancos&quot; as&iacute; tal cual y bueno, perdi los 3 puntos y una cola de 20 mins ricos.\r\nTambi&eacute;n quer&iacute;a saber cuando dan derrota evitada para  no estar dodgeando todo el tiempo y esperar 20mins+.\r\nhay alguna forma de que te devuelvan puntos si es que  te trolean las partidas  (Tipo que feedean por nada)\r\n\r\n\r\nEspero la respuesta de alguien. {{champion:32}}","replies":[{"poster":"Josu","date":"2017-01-19T02:48:55.576+0000","up_votes":2,"down_votes":0,"body":"De hecho, lamentablemente la manera de evitar esos -3pl y 20 min es exactamente lo que hizo el troll soporte, hacer que otro del team se salga.","replies":[]},{"poster":"Mioen","date":"2017-01-19T02:39:38.539+0000","up_votes":2,"down_votes":0,"body":"Que otro dodgee. No hay otra, es preferible -3 de pl y 20 min, a perder 12 por perder una partida de mal gusto.\nAprobecha son 20 min jugate otro juego, estudia, termina algun jobby. Estas de mejor humor para la match.\nSaludos.","replies":[]},{"poster":"iMonsterQ8","date":"2017-01-19T02:59:37.465+0000","up_votes":1,"down_votes":0,"body":"Mejor perder 3 y tener una cola de 20 minutos antes que 40 minutos en una partida en la que un tipo se suicida bajo torre contra tu laner y te flamean.","replies":[]},{"poster":"ALEXKOND","date":"2017-01-19T02:48:01.855+0000","up_votes":1,"down_votes":0,"body":"1. No hay forma alguna de que no te descuenten puntos de liga al hacer dodge. \n2. Derrota Evita se activa cuando el servidor experimenta problemas de conexión a gran escala (un gran porcentaje de los jugadores, no una partida en particular)\n3. Actualmente no hay ningún tipo de sistema que devuelva puntos si es que te trolean las partidas.","replies":[]},{"poster":"Maycoltf2","date":"2017-01-19T02:37:31.331+0000","up_votes":1,"down_votes":0,"body":"No te lo devuelven , y la derrota evitada solo lo dan cuando ocurre algún problema grave con el servidor.","replies":[]}]}