{"poster":"phongphu","date":"2019-04-09T03:50:08.025+0000","title":"RITO Please read this","subforum":"General Discussion","up_votes":51,"down_votes":2,"body":"Hi everyone, I'm Vietnamese and I play in Vietnam server, a server managed by Garena. In this server, Garena do not allow players to acquire Prestige Edition Skins in Hextech Crafting. When Garena announced, I'm shocked when I heard this. From then, if players want to own them, they have to take part in some in-game events developed by Garena to own them, and the money they have to spend to own the Prestige skins isn't small. This is a very bad news. Riot has developed the Hextech Crafting system so as to allow poor player to have little chances to own skins which they could not afford to buy before such as Pulsefire Ezreal, Elementalist Lux, and other expensive skins, too. So, Garena don't want poor players to have any chances to own those Prestige skins, do they? Are they crazy? Are they discriminating between riches and poverties? Some players in this server have been strongly objecting to this action, but Garena do pretend not to care, just keeping making those 'trash' events. For example, with the same money 125$, in NA, you can easily receive 100 prestige points by purchasing event capsules in the store, but in Vietnam server, many people said that they couldn't even receive 70 points from the event they participated (me too!). Vietnam's economy is much poorer than America, why is it with the same item, the US 'sells' for cheaper prices, while Vietnam is more expensive?\n\nGarena had announced and done it when the prestige Blood Moon Aatrox skin was released. I asked them why did they make events instead of allowing players to acquire prestige skins in hextech crafting, and prestige points by purchasing loots in the store, they said: 'These upcoming events we make will allow players to own not only Prestige skins but also many other stuffs with a lower amount of RP than their value' (Their value is their prices if they were sold in the store). But the fact isn't like so. In this server, all prestige skins is 2500 RP worth (equal to about 49$), but most players claimed that to own a prestige skin, they have to spend more than twice that amount, while the value of other stuffs (Champions, skins other than prestige, icons, wards, chromas, emotes, hextech crafting materials such as chests, keys, gemstones,...) they receive isn't equal to the difference from 2500 RP. For example, you spend 6300 RP to own the prestige skin, the difference is 6300 - 2500 = 3800 RP, but other stuffs you receive is much less than 3800 RP worth. I also posted an article about this on LOL Vietnam's Fanpage, but most people don't agree with my opinion. They said: 'If you feel unfair like that, you only have not to pay your money on this game anymore. Garena don't force you to pay, do they?', whereas people agreeing with me don't dare to speak because the number of those is quite small. Although Garena don't force players to pay money, it is unfair to players who pay money on this server with those on Riot servers. So the problem is this, no people do understand what I really indicate. Do you agree with me? If you play in this server, do you also feel like that? \n\nYesterday morning Garena has also released 2 bundles named 'Kitty Bosses' and 'Doggie Bosses' in the store. Each bundle contains: a summoner icon, 5 Furry Capsules and only 3 prestige points. While in NA server if you purchase 5 Furry capsules you'll also receive 4 x 5 = 20 prestige points. This is unacceptable.\n\nAnd, if you convert the price of these items: prestige points, furry capsules to real money, you'll see a shuddering truth. \nCurrently, the exchange rate is 1 USD = 23,256 VND. \nIn NA: you receive 7,500 RP when you redeem a 50 USD prepaid card, and with that amount of RP, you can purchase 10 Furry capsules come with 40 prestige points. So, a Furry capsule comes with 4 prestige points costs 5 USD, equal to 116,280 VND. \n\nIn Vietnam: you receive 1070 RP when you redeem a 500,000 VND prepaid card. In this server, a Furry capsule comes with no prestige points, and  it costs 135 RP, so in real money, a Furry capsule (comes with no prestige points) costs 135 / 1070 * 500,000 = 63,084 VND. \n\nAssuming that the price of this capsule in NA and Vietnam is the same, and there is such a difference because in NA the capsule isn't retailed, it comes with 4 prestige points, the difference will be equivalent to the price of 4 prestige points (in NA). The difference is 116,280 - 63,084 = 53,196, so in NA, a prestige point costs 53,196 / 4 = 13,299 VND. \n\nHow about in Vietnam? The 2 bundles I mentioned above both cost 1,275 RP. The icon contained in each bundle costs 10 RP, is negligible. The 5 capsules contained cost 135*5 = 675 RP, so a prestige point in Vietnam costs (1275 - 675) / 3 = 200 RP, equal to 93,458 VND. The price ratio of a prestige point in Vietnam and NA is 93,458 / 13,299 = 7.02. So a prestige point in Vietnam is 7 times more expensive than the price of that in North America, or in other word, 1 prestige point in Vietnam is equivalent to about 7 prestige points in NA. \n\n1,275 RP is the original price of the bundles. Garena has 53% discounted for these bundles, leaving only 600 RP, cheaper than 5 Furry capsules (675 RP). But many people don't see this shuddering truth because most of them don't pay attention to the original price when purchase these bundles, only see the discounted price, thus think that buying these bundles will be much more beneficial than buying 5 Furry Capsules. Even though the price of the prestige points was also discounted by 53% due to the 53% discount of the 2 bundles, the above price ratio is still approximately 3.5, means that 1 prestige point in Vietnam is still equivalent to 3 prestige points in NA. \n\nThese 2 pictures are about the 2 bundles I mentioned above: \nBundle 1 (Doggie Bosses): \nhttps://i.imgur.com/VWqcrKI.jpg?2\n\nBundle 2 (Kitty Bosses): \nhttps://i.imgur.com/ZCJYf0N.jpg?1\n\nStill like NA, prestige skins can be forged by 100 prestige points. However, these 3 skins must be forged by 150 points instead of 100: Firecracker Vayne, K/DA Akali, K/DA Kai'Sa. You can see this in the picture below: \nhttps://i.imgur.com/Vh9wqxb.jpg?3","replies":[]}