{"poster":"Kahlkopf Adler","date":"2016-10-15T19:11:39.159+0000","title":"Suche Duo Partner/in zum gemeinsamen klettern der Leiter (Ranked) Gold+","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hallo Community, \r\n\r\nich (Marvin, 20 Jahre) suche jemanden der/die mit mir zusammen die Ladder hinauf steigen w&uuml;rde. Ich selbst spiele gerne ADC, kann aber auch in den Jungle ausweichen. Befinde mich gerade in Gold 1 und w&uuml;rde diese Season noch Platin erreichen wollen. Nat&uuml;rlich kann man immer noch nach erreichen des Meilensteines  weiter spielen und in der n&auml;chsten Season die Duo Ladder unsicher machen. Deine Position ist relativ egal solange man gemeinsam carrien kann. Am besten w&auml;re nat&uuml;rlich Support damit du mich durch die laning Phase carrien kannst und mir sp&auml;ter in den fights sch&ouml;n den A**** freihalten kannst, aber wie bereits erw&auml;hnt ist es egal welche Rolle du spielst. Solange du deine Rolle beherrschst und wei&szlig;t was du tust, ist das schon die halbe Miete. Gold+ w&auml;re gut. Meine MMR ist nicht schlecht. Generell kannst du dich auch melden wenn du Silber bist, solange du wei&szlig;t was du tust. Bitte sei nicht so eine Person welche nach 1,2,3 loses wieder verschwindet mit den Worten (das mit uns wird nichts.) Ist es normal das man evtl. anfangs nicht ganz so toll zsm spielt. Das wird aber alles nach der Zeit kommen. Schlechte Spieltage hat auch jeder mal. Davon abgesehen sollte man aus den Niederlagen lernen und es nicht bei den anderen suchen (ich wei&szlig; das ist schwer f&uuml;r manche, aber man muss seine Fehler selbst einsehen. Nur so kann man dran arbeiten und sich verbessern!) Zudem solltest du nicht scheu sein. Ich habe einen Ts3 Server, welcher auch benutzt werden sollte. Dein Mikrofon sollte nicht aus dem Jahre 1867 sein und kratzen. Ich rede sehr viel, wenn mein Partner genauso viel redet. Es gibt aber auch Zeiten wo ich schweigsam bin. Das liegt daran das ich mich konzentriere. Ich bin an sich sehr lustig drauf. F&uuml;r jegliche Witze offen (auch schwarzer Humor). Wenn du bis her gelesen hast und ich deine Interesse an gemeinsames zocken geweckt habe, dann scheu dich nicht mich ING unter Alolan N&iacute;netales anzufragen oder etwas unter diesen Post zu schreiben, Ich w&uuml;rde mich freuen wenn wir schon bald die Kluft unsicher machen. \r\n\r\nMfG Marvin\r\n\r\nP.S. flamen solltest du evtl unterlassen. Das schw&auml;cht die Moral nur noch mehr. :)","replies":[{"poster":"Faker Smurf","date":"2016-10-15T19:34:00.696+0000","up_votes":1,"down_votes":1,"body":"Das klingt wie eine Personenbeschreibung für Parship :D","replies":[]}]}