{"poster":"Phyllus","date":"2019-10-13T17:37:31.522+0000","title":"Anzeigefehler mit anschließendem Clientbug bei 2 geklonten Monitoren","subforum":"Melde einen Bug","up_votes":1,"down_votes":0,"body":"Hallo,\r\nich habe heute eine ganze Weile getüftelt und finde keine Lösung um diesen Fehler zu umgehen:\r\nIch habe an meinem Schreibtisch einen Hauptbildschirm (1440p + G-sync) und einen Nebenbildschirm (1080p) zusätzlich wollte ich nun meinen TV (Samsung 4k) als Bildschirm anschließen wobei ich das Bild meines Hauptbildschirms klone. Die Skalierung ist jeweils auf 100%. Die eingestellte Auflösung für den Hauptbildschirm und den TV ist 1440p. Am TV wird also nicht 4k angezeigt. \r\n\r\n\r\nIm Desktop funktioniert alles Prima und so hätte ich auch gerne meine Einstellung, wenn ich aber LOL starte beginnt das Chaos: \r\nIm Client passt noch alles, aber sobald ein Spiel startet sieht man, dass sich die Auflösung kurz stark verringert (Der Windows Ladering ist sehr Groß) und sobald der Ladebildschirm da ist sieht alles wieder regulär aus. Tab ich nun aus dem Spiel ist der Desktop kurzzeitig in einer enorm niedrigen Auflösung, passt sich dann aber wieder an. Tab ich ins Spiel zurück merkt man wieder eine Änderung der Auflösung und es sieht wieder ok aus.\r\n\r\nIst das Spiel nun beendet sieht man wieder kurzzeitig einen niedrig aufgelösten Desktop der sich dann aber wieder anpasst. Der Client hat aber nun einen fatalen Anzeigefehler: nur ein sehr kleines Eck von oben links ist zu sehen. 99% des Clients sind aber nicht sichtbar. Da hilft nur über die Taskleiste das Programm zu beenden. \r\n\r\nBein erneuten öffnen hat sich nun der Client erholt, aber das Fenster hat sich verkleinert und wird so klein wie in den Einstellungen möglich angezeigt.\r\n\r\nDas ist eine unschöne Sache. Ich Weiß nicht in wie weit da auch Windows reinspuckt, aber LOL schein seinen Teil beizutragen.\r\n\r\nDer PC ist frisch eingerichtet. Weiteren Einflüsse würde ich ausschließen.","replies":[{"poster":"MyJungleSkill","date":"2019-10-17T07:37:43.997+0000","up_votes":1,"down_votes":0,"body":"pc komponente / genaue Monitor - Tv beschreibung wäre hilfreich, Lol hat eh probleme mit zweit bildschirmen, bei mir friert ab und zu ein monitor wo der launcher und das spiel drauf laufen komplet ein wenn lol offen ist. Ergo spiel friert in der ladezeit ein.\nDazu kommt das der launcher stark Laggt wenn er zu lange offen ist und dabei hat man schon 16gb ram :(\nTechnisch ist League of Legends ein chaos Dx9 sage ich nur ... 2019 ... danke Riot für die viele arbeit (Nicht).\nSelbst eure Stream und interview's sind qualitativ naja nicht so gut.\n\nAber hey :) ihr seid ja ein reiches unternehmen, wird schon seine gründe haben.","replies":[{"poster":"Phyllus","date":"2019-10-17T16:22:35.446+0000","up_votes":1,"down_votes":0,"body":"Aber gerne doch:\nPC:\nI7 7700k @4,2GHz\n16GB Ram\nGeforce GTX 1070\n\nreicht das? beim Rest muss ich nochmal nachschauen.\n\nHauptmonitor: Acer XB271HU\nTV auf dem dupliziert wird: GQ55Q70R\nNebenmonitor der als Erweiterung dient: SMBX2450 (sollte eigentlich keinen Einfluss aufs Problem haben... theoretisch!)","replies":[]}]},{"poster":"astrofan","date":"2019-10-13T17:46:15.596+0000","up_votes":1,"down_votes":0,"body":"Bin mir nicht sicher, aber ich denke das ist eine Kombi aus dem Klonen und LoL. Würde mich nicht wundern wenn LoL da weil nicht drauf ausgelegt seine normale Auflösung auf den großen Bilschirm projezieren will, dann runterscaliert auf den kleinen Schirm (daher wird das ganze so riesig), und dann feststellt dass es das umgekehrt machen soll und dabei einfach scheitert. Der Client wird dabei natürlich im Hintergrund anhand der alten Position auf die neue Niedrigpixelauflösung verschoben und daher weit nach unten rechts geschoben (PCs zählen die Pixel von oben links nach unten rechts).\nDenke dass das primär an LoL liegt, mir fällt da leider keine Lösung ein, mal gucken ob hier eine kommt, falls nicht kann man evtl. mal den Support fragen, vielleicht haben die eine Idee oder das passiert nur bei 4k-Kopien und ist ein Fehler in LoL der dann gefixt werden kann.","replies":[]}]}