{"poster":"Luigi Main","date":"2016-03-05T21:40:36.761+0000","title":"Top, Jungle & Support für Ranked Team Gesucht (Gold/Platin Elo)","subforum":"Clans & Teams","up_votes":1,"down_votes":1,"body":"Moin\r\n\r\nIch suche derzeit einige andere Spieler um ein Ranked Team aufzubauen. Der Fokus vom Team soll darauf liegen gemeinsam besser zu werden, in der Elo zu steigen und irgendwann auch an Turnieren teilzunehmen.\r\n\r\nEs gibt einige grobe Regeln/vorraussetzungen:\r\n\r\nKein Flame.\r\nJeder hat mal ein schlechtes Game, jeder tiltet mal, es an den Teammitgliedern auszulassen ist immer die schlechteste L&ouml;sung.\r\nKritikf&auml;hig sein.\r\nIhr m&uuml;sst Fehler einsehen, um sich konstant zu steigern muss das jeder.\r\nNur auf eure main Lane bewerben.\r\nEs bringt recht wenig wenn ihr beispielsweise Mid main seid, aber gerne in einem Team spielen w&uuml;rdet und daher nur f&uuml;r das Team auf eine andere Lane geht. Eure Lane im Team sollte auch die Lane sein die ihr im Solo spielen anstrebt. Auch solltet ihr &uuml;ber eure eigene Lane am meisten Wissen haben.\r\nDer Wille sich zu verbessern\r\nDarauf liegt der Fokus des Teams.\r\nGeistige Reife\r\nIch habe mit Leuten gespielt die waren 14 und die erwachsensten im Team, ich habe mit Leuten gespielt die waren Mitte 20 und haben sich wie Kleinkinder verhalten. Es gibt kein Mindestalter, doch solltet ihr eine gewisse geistige Reife mitbringen.\r\nTeamspeak\r\n&Uuml;ber Teamspeak wird die ganze Kommunikation statt finden, w&auml;re gut das zu haben :)\r\nEinmal zu euch:\r\n\r\nMain lane: Gesucht wird derzeit Top, Jungle sowie Support\r\nMain Champions:\r\nMein Spielstil: Aggressiv, Passiv, seid ihr aufs farmen aus oder auf die Kills, roamed ihr viel oder bleibt ihr auf eurer Lane. Einfach eine grobe Einsch&auml;tzung zu eurem Spielstil.\r\nMeine St&auml;rken/Meine Schw&auml;chen: Worin seid ihr besonders gut, was sind eure Probleme im Spiel.\r\nElo (S5&amp;S6): Vorraussetzung ist das ihr Season 5 Platin wart.\r\nTeamerfahrung/Turniererfahrung: \r\nTage an denen ich Zeit habe: Am besten sollte mindestens 2-3 Tage f&uuml;r einige Stunden Zeit da sein. Auch nicht vergessen das viele Turnieren an Wochenenden stattfinden, bewerbt euch nicht wenn ihr Wochenends nie zeit habt.\r\n\r\nDamit ihr aber auch wisst zu wem ihr da ins Team kommt, ein paar Infos zu mir.\r\n\r\nSooo, so viel dann einmal zu dem Team und mir. Wenn du Interesse hast, melde dich ruhig. Ich freu mich drauf :)","replies":[{"poster":"Luigi Main","date":"2016-03-05T22:46:55.727+0000","up_votes":1,"down_votes":0,"body":"Push.\nVorallem ein Jungler wird gesucht :)","replies":[]}]}