{"poster":"MorgManBasher","date":"2018-11-02T10:13:38.294+0000","title":"Not a Viktor player but please nerf the right thing","subforum":"Gameplay","up_votes":51,"down_votes":13,"body":"His base damage and AP scaling are fine, that&#039;s not what is causing the problem. The problem is infact his mana scaling on his shield that needs looked at for the build he&#039;s going. It&#039;s just making him way too tanky with {{item:3025}} {{item:3001}} \r\n\r\nI use to love playing Viktor but it&#039;s been ages since I played him because I personally prefered him pre-rework, but I still don&#039;t want to see him destroyed because of top Viktor being overbearing. Just nerf the correct thing and leave AP Viktor alone.","replies":[{"poster":"Moody P","date":"2018-11-02T12:43:11.750+0000","up_votes":37,"down_votes":7,"body":"no, the base damage is definitely part of the issue, lol. The fact that he can run two tank items alongside his Perfect Core and maintain 100-0 pressure on squishies is absurd.","replies":[{"poster":"SweedishGunner","date":"2018-11-02T15:31:06.194+0000","up_votes":5,"down_votes":9,"body":"So why is he not crowding out mid lane with his base damages? The issue is far more complicated than 'he does too much damage'. ","replies":[{"poster":"Reformedfindlay","date":"2018-11-02T16:36:37.161+0000","up_votes":15,"down_votes":3,"body":"> [{quoted}](name=SweedishGunner,realm=EUW,application-id=3ErqAdtq,discussion-id=tNkBiJFd,comment-id=00010001,timestamp=2018-11-02T15:31:06.194+0000)\n>\n> So why is he not crowding out mid lane with his base damages? The issue is far more complicated than &#x27;he does too much damage&#x27;.\n\nHere's a wild thought, the mid lane meta consists of a far different roster from the top lane meta.\n\nApples and oranges.","replies":[{"poster":"SweedishGunner","date":"2018-11-02T19:24:03.140+0000","up_votes":3,"down_votes":3,"body":"Yeah which is what causes the build to work top and not be that great mid, it's not just 'too much damage' there's a whole host of reasons the build works.\n\nBtw yes I'm a Viktor main and I even hate the build, I don't play it either and I do want it nerfed.","replies":[{"poster":"Zero Skill Tank","date":"2018-11-02T19:30:44.574+0000","up_votes":2,"down_votes":1,"body":"> Yeah which is what causes the build to work top and not be that great mid, it's not just 'too much damage' \n\nIt's exactly that, though. You can sit on his face with a bruiser/tank, and he out-point-and-clicks you.\n\nOn mid it's different because mid champions either have huge range, or huge burst and mobility, so they have no reason to eat this AA-spam.\n\nBut the core issue is retarded damage.","replies":[]}]},{"poster":"WrÆth","date":"2018-11-02T20:02:25.504+0000","up_votes":2,"down_votes":3,"body":"Yeah, so buff up the other toplaners and he won't be such a menace and at the same time we've preserved a playstyle that some players find fun?\n\nI've said this time and time again, he's only good because he counters {{champion:266}} and {{champion:6}} who have literally seen near 100% pick ban rate.","replies":[]}]},{"poster":"Mogarl","date":"2018-11-02T16:51:55.758+0000","up_votes":2,"down_votes":1,"body":"Because the base damages on his Q doesn't really impact midlanes primarily ranged roster, and midlane Viktor doesn't max cdr nearly as quickly. So midlane Viktor loses 0-20 damage on his empowered auto starting at level 9; while toplane viktor loses 5-20 damage starting at level 4 when those small numbers are much more relevant.\n\nI think the Q nerfs are pretty good. \n\nUlt nerfs are a bit heavy though. I understand why they are there since divers are going to have a much harder time escaping it early, so level 6 is actually a power spike for top Vik. However it's also going to hurt midlane Viktor when divers go mid.","replies":[]},{"poster":"iDarkWind","date":"2018-11-02T16:39:20.065+0000","up_votes":2,"down_votes":1,"body":"Who told you he wasn't been doing it? In certain matchups, monstly against assassins he would pick Grasp and build one tank item ({{item:3025}} vs AD and {{item:3001}} vs AP) and legit have a very safe and powerfull lane while outscale the enemy opponent. Where was the counterplay? He also perma shoved the lane with his superior waveclear and denies any roam from the enemy.\nGood thing he started being popular to people start to notice this crap.","replies":[]}]},{"poster":"Alzon","date":"2018-11-02T13:07:09.472+0000","up_votes":2,"down_votes":1,"body":"Ranged, Mach 3 100-0 pressure*\n\nWith that Summoner icon, you should know the difference 🙃\n\n_(Mach 4 is Jhin)_","replies":[{"poster":"Tin of sardines","date":"2018-11-03T05:07:57.960+0000","up_votes":2,"down_votes":0,"body":"ok, let me see, base on the tech:\n\n{{champion:266}}  Mach .6 ICE diesel with NOS system.\n{{champion:84}}  Mach 1 to 3 RCS hypergolic system.\n{{champion:164}} Mach 1 to 2  Electric motors type: step motor.\n{{champion:31}}  Mach 0.2 ICE diesel.\n{{champion:122}} Mach .4 ICE gasoline.\n{{champion:36}}  Mach .5 ICE diesel engine with supercharger and energy recovery system.\n{{champion:114}}  Mach 1 to 2 ICE competition gasoline with NOS system.\n{{champion:86}}  Mach .6 ICE Gasoline Carburettor system.\n{{champion:150}} Mach 1 to 2.8 ICE Gasoline with EFI, Turbocharged and SMT, also includes  ATTESA E-TS.\n{{champion:79}}  Mach 1.4 to 1.8 ICE alcohol.\n{{champion:74}} Mach .4 to .7 ICE same tech used in a Toyota Prius.\n{{champion:420}} Mach .6 ICE biodiesel with NOS system.\n{{champion:39}} Mach 3 to 5 Hybrid of ICE and electric, same stuff used on LaFerrari, Porsche 918 Spyder e McLaren P1.\n{{champion:24}} Mach 2 to 3.5 ICE High RdON design, NA V8 with double clutch transmission.\n{{champion:126}} Mach 1.5 to 3 ICE Bi-fuel, with off-road mode, a bit old but still relevant.\n\nnow, let's look at the real mean stuff:\n{{champion:202}} Mach 1 to 26.3654 Rocket engines\n\njust kind, unless somebody has video proof, the fastest champion in league is Irelia.\nyou just can't run away from her, jhin is more of a mach 5.8 guy with a full crazy speed build, but almost no one uses it.\nand a nerf of just 0.8333333333333333 in Irelia speed is nothing.\n\nalso, viktor isn't that fast, Gnar can go faster, but since viktor has better defensive stats and a Q with lower cool down level one (serious it's lower) that also deal more damage level one and give him a shield while giving him the same speed of the hyper without having to close at 400 units and atack 3 times...\nman....\n\nthis is work of the Illumignarti:\n\ngentleman Gnar walking into a alley enter a warehouse using a key for his pocket, inside a makeshift lab barely lit, the alley lights shines to the door, putting a a fearsome shadow of the small gentleman in the floor. \n{{champion:150}} Viktor! I need you to work in a project.\n{{champion:112}} What? I kind busy here - a somewhat muffled robotic voice reverbs and echoes for inside, is possible to hear the metallic sound of tools\n{{champion:112}} and have you already someone else to work for you? why would you seek me?! I still recovering for the last changes on the...\n{{champion:150}} they have cut down my main supply and also put a restraining order. but I heard you still have something that may do.\n- the metallic sounds continues, but it sudden stops\n{{champion:112}} serious? that source isn't good as you thought.\n- then it resumes\n{{champion:150}} ohh... please.. stop the cheap talk, we all know how vulnerable I am to attack, sure in some stances I can handle more that one can throw at me, but is not everyday I can afford to do that. I also know very well that you can do some of my tricks, and considering my situation and yours, you could do it better.\n{{champion:112}} what in for me???\n{{champion:150}} being relevant again in the global scene.\n{{champion:112}} nope, I don't need that heat on me again.\n- as he continue he work without stopping.\n{{champion:150}} they take a long time to do that, also, you just gonna show at the international exposition, so is the close to the fiscal year end, and they usually take some months for they to fill the proper paper work. \n- Viktor stop his work, then put the tool in his hand nearby, Gentleman Gnar holds his walking stick in front of him.\nalso they don't do the paper work after the fiscal year is closed and the new one is beginning. so it's safe.\n{{champion:112}} you know a loot, don't you.\n{{champion:150}} In my line of work knowledge is of extreme importance, so you are in?\n{{champion:112}} ok, it seems you got you self a favour.","replies":[{"poster":"Alzon","date":"2018-11-03T18:06:06.142+0000","up_votes":1,"down_votes":0,"body":"this is my new favorite show","replies":[]}]}]},{"poster":"lolipopevelynn","date":"2018-11-02T17:00:26.079+0000","up_votes":2,"down_votes":3,"body":"> [{quoted}](name=Moody P,realm=NA,application-id=3ErqAdtq,discussion-id=tNkBiJFd,comment-id=0001,timestamp=2018-11-02T12:43:11.750+0000)\n>\n> no, the base damage is definitely part of the issue, lol. The fact that he can run two tank items alongside his Perfect Core and maintain 100-0 pressure on squishies is absurd.\n\nYa but they are hurting mid victor who go full ap aswell, who is already in a bad spot","replies":[{"poster":"ZephyrDrake","date":"2018-11-02T19:31:07.617+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=ChristmasEvelynn,realm=NA,application-id=3ErqAdtq,discussion-id=tNkBiJFd,comment-id=00010002,timestamp=2018-11-02T17:00:26.079+0000)\n>\n> Ya but they are hurting mid victor who go full ap aswell, who is already in a bad spot\n\nhe is getting a buff to his ratios... sorry but what are you even talking about? full AP viktor is barely going to feel the nerfs, if at all. He will be weaker early on yes but mid to late game? he will be just as strong as he currently is, if not stronger","replies":[]}]}]},{"poster":"CaptainMårvelous","date":"2018-11-02T15:02:30.275+0000","up_votes":11,"down_votes":2,"body":"Naw, the damage is a very real component. \n\nWith decent bases, Viktor can still be relevant damage-wise even if he goes for a heavy kiting build. Nerfing Vik damage you're making him have to choose between a top lane heavy kite build or an AP build for damage.","replies":[{"poster":"Power Cosmic","date":"2018-11-02T16:03:36.664+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=CaptainMårvelous,realm=NA,application-id=3ErqAdtq,discussion-id=tNkBiJFd,comment-id=0005,timestamp=2018-11-02T15:02:30.275+0000)\n>\n> Naw, the damage is a very real component. \n> \n> With decent bases, Viktor can still be relevant damage-wise even if he goes for a heavy kiting build. Nerfing Vik damage you&#x27;re making him have to choose between a top lane heavy kite build or an AP build for damage.\n\nBut he was tough to play into long-range or mobile champs mid before any nerf.","replies":[{"poster":"Mogarl","date":"2018-11-02T16:37:22.968+0000","up_votes":4,"down_votes":1,"body":"And a nerf to ranks 2-5 of his empowered auto attack that  he won't even notice until level 10 isn't going to change that. The base damage on his empowered Q is going to only really hurt Q max and midgame cdr rushing.","replies":[{"poster":"Power Cosmic","date":"2018-11-02T17:06:15.691+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Mogarl,realm=NA,application-id=3ErqAdtq,discussion-id=tNkBiJFd,comment-id=000500000000,timestamp=2018-11-02T16:37:22.968+0000)\n>\n> And a nerf to ranks 2-5 of his empowered auto attack that  he won&#x27;t even notice until level 10 isn&#x27;t going to change that. The base damage on his empowered Q is going to only really hurt Q max and midgame cdr rushing.\n\nSo it seems like his best option will still be top bc of the matchups since not any better mid.  Even if not with top-tier viability.","replies":[{"poster":"Slythion","date":"2018-11-03T04:50:01.650+0000","up_votes":1,"down_votes":1,"body":"> So it seems like his best option will still be top bc of the matchups since not any better mid. Even if not with top-tier viability.\n\nconsidering how the changes aren't meant to change his best lane but more to make him not an S+ \"top tier\" viable pick, you basically just said the changes did exactly what they were meant to do","replies":[]}]}]}]}]},{"poster":"Minecraft","date":"2018-11-02T14:31:14.728+0000","up_votes":2,"down_votes":9,"body":"I think making his second instance of Q not count as an Auto would fix it. You might not be able to buy lich bane on him again but I don't think being able to instagib someone with Q auto is healthy as well.","replies":[{"poster":"SociopathFriend","date":"2018-11-02T15:01:28.567+0000","up_votes":9,"down_votes":2,"body":"So lower the already pathetically small pool of effective lich bane users? \n\nA superior solution is to actually work at his synergy with the ONE item that makes top Vik work.\n{{item:3025}} \nGive it a similar ranged/melee split like Frozen Mallet. I can't think of any other ranged champion barring Ezreal who uses it so it would appropriately hit Viktor while leaving his kit intact.\n\nAnd nobody is going to complain about Ezreal losing IG effectivenesd.","replies":[{"poster":"KmSneaky","date":"2018-11-02T15:15:46.315+0000","up_votes":1,"down_votes":2,"body":"I definetly doubt that, on the other hand, I'd be glad to have IBG become AD somehow, maybe adding {{item:1036}}  in the buildpath for it, and then have an equivalent alternative item with {{item:1052}} with some AP giving maybe less mana, but with a spellsword passive dealing damage depending on an other stat like mana regen or movespeed for example, it sounds silly I get that, but there has to be something to be done for AP bruisers, they need it, the successive nerfs on {{item:3116}} {{item:3151}} {{item:3102}}{{item:3157}}   for bruisers just ruined most of the possibilities for characters like {{champion:68}}{{champion:8}} {{champion:82}} {{champion:57}} {{champion:54}} {{champion:111}} {{champion:3}}  to exist outside of full ap/full tank versions.","replies":[{"poster":"Death Rex","date":"2018-11-02T15:39:00.644+0000","up_votes":5,"down_votes":1,"body":"Giving CC with an item to champions who have little to no CC is a big problem. Rylais got nerfed very often, same with Frozen Mallet (which is completely toxic in my eyes). It becomes mandatory on certain champs and everyone else can buy it as well if the stats are good, which was the case for Rylais for a long time.","replies":[{"poster":"Tin of sardines","date":"2018-11-03T05:17:24.855+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Death Rex,realm=EUW,application-id=3ErqAdtq,discussion-id=tNkBiJFd,comment-id=0004000000000000,timestamp=2018-11-02T15:39:00.644+0000)\n>\n> Giving CC with an item to champions who have little to no CC is a big problem. Rylais got nerfed very often, same with Frozen Mallet (which is completely toxic in my eyes). It becomes mandatory on certain champs and everyone else can buy it as well if the stats are good, which was the case for Rylais for a long time.\n\nfrozen mallet isn't suppose to be mandatory, but riot decide to make it so... in my opinion, those items are part of a bad design.\nI mean, I could keep up with people using only CDR, now things are difficult, also the damage/resistance ratio is all mess up.","replies":[]}]},{"poster":"Tin of sardines","date":"2018-11-03T05:14:08.080+0000","up_votes":1,"down_votes":0,"body":"I have a better solution: remove those apply slow items from the game.\nbut since some my ideas make Thanos ideas sound reasonable...\nfrom what I know, there's only one champion that really, really need a slow item:\n{{champion:136}}\n\nthe rest buy it for convenience. like Gnar... is the made Mallet a melee only and didn't nerf his Q cooldown refunds...\nstill, i hate when a melee champion buy FM and stick to me like a tongue in a frozen piece of metal.\n\nwhy do we have this league of slows???","replies":[]}]},{"poster":"Zero Skill Tank","date":"2018-11-02T19:59:14.400+0000","up_votes":1,"down_votes":0,"body":"Hurting the slow on range attacks won't fix Viktor.\n\nHe will no longer be hotfix-worthy, but he will still shit on most toplaners.","replies":[]}]}]},{"poster":"Sire Hippington","date":"2018-11-02T19:04:27.899+0000","up_votes":3,"down_votes":1,"body":"Actually, for once they do nerf the right thing.\nThe issue is not that he gets tanky from building tanky, that's totally fine.\nThe issue is that he can do so and still stay a major damagethreat with decent waveclear and CC.\n\nNerfing base damage and buffing ratio is the best way at dealing with him without hurting AP-Vik to much.\nThe tuneing might need a bit work, Q nerf seems spot on but ult might hit ap-vic to heavily aswell, but the general direction of forceing him into building damage if he wants to do high damage is fine.\nMaybe his core could use some change, less AP, more utillity, like 10-20%cdr which would help AP vic by freeing up his builtpath and tank vic would overcap cdr with his usuall built while getting less AP.\nAnother issue is Iceborn on ranged, Ez players might hate me, but it's about time to make it melee only or atleast change some values for rangeds.","replies":[{"poster":"ProfDrDeath","date":"2018-11-03T10:01:31.365+0000","up_votes":1,"down_votes":0,"body":"You could have Iceborn only apply a slow to the primary target for ranged champs, for instance.\n\nAlso, Iceborn on Ezreal is actually a trap item for most of the players: \nhttps://lolalytics.com/ranked/worldwide/platinum/plus/champion/Ezreal/ADC/\nIBG has an overall winrate of 48.36% on him.","replies":[]}]},{"poster":"Ärchaon","date":"2018-11-03T22:07:28.408+0000","up_votes":1,"down_votes":0,"body":"They've made the mana scaling on Q to the point where he's practically a battle mage with little interactivity if you build him in this way.\n\nThe scaling should be based on AP, not mana.  Even if he has battle mage elements now, he's supposed to circumvent around champions, not run at people without any thought processing because he abused some tank mana item","replies":[]},{"poster":"Eunson","date":"2018-11-03T21:09:50.331+0000","up_votes":1,"down_votes":0,"body":"The problem is Klepto... the rune system is shit lol","replies":[]},{"poster":"Aatrox Eichmann","date":"2018-11-03T16:49:15.146+0000","up_votes":1,"down_votes":0,"body":"To be honest i think any substantial nerf that comes over to viktor is going to end up fucking him in the ass(since riot is doing it, its either gonna be band-aid or meta breaking, theres no in between). Viktor wasnt even viable before this bully build came out, but then it singlehandedly put him back into the meta to top 10.\nI know some players are really desperate to see viktor in meta again, and i do realise this is an unfun thing to go up against, but viktor is far from without counters, when an urgot/akali/irelia/talon top can easily demolish him before he gets an item.(you can argue people dont play safe enough, but i have never lost lane against a top viktor when playing urgot top. I only lost a game once because 2 teammates ragequit even after i got two solo kills onto the viktor being behind initially by an early lee sin double gank at level 2)","replies":[]},{"poster":"oortoomeebreesuu","date":"2018-11-03T04:55:42.672+0000","up_votes":1,"down_votes":0,"body":"Viktor Q 280 base + 90% ap  every 4 seconds\n\nyeah that might be too much for a shielded movement steroid","replies":[]},{"poster":"0 Hogapu","date":"2018-11-02T20:42:57.414+0000","up_votes":1,"down_votes":0,"body":"lower is shield duration could be great also","replies":[]},{"poster":"Oakleaf Ranger","date":"2018-11-02T20:23:38.048+0000","up_votes":1,"down_votes":0,"body":"The only thing I consider to be wrong with Top lane Viktor is Kleptomancy. Depending on how its changed in the preseason will have a huge impact on top lane Victor.","replies":[]},{"poster":"WrÆth","date":"2018-11-02T20:00:31.267+0000","up_votes":1,"down_votes":0,"body":"No, he's not even the problem himself. Even some of the really good viktor players have said that he could even use a little more damage, considering how much he lost on his E from nerfs. It's too unreliable to hit his E second cast anymore.\nIf we are talking about tank viktor, in a vacuum it isn't even that great of a build. Viktor wants to q e auto basically every champ on the map, that's why he's historically been broken when he can go ap. The only reason he is seeing play right now is because he absolutely shits on most of the really good, highly contested abominations of champions like {{champion:266}} {{champion:6}} and sometimes {{champion:84}} . Buff up the other toplaners that are not seeing play and this pick will fade. If we nerf viktor now, he will just be completely garbage and forgotten about.","replies":[]},{"poster":"Śhunpo","date":"2018-11-02T19:24:40.155+0000","up_votes":2,"down_votes":2,"body":"Just revert the buffs on Q and revert the nerfs done to Hexcore and his Death Ray. There, he now goes mid lane again.","replies":[]},{"poster":"Tusutaki","date":"2018-11-02T19:02:13.755+0000","up_votes":1,"down_votes":1,"body":"Lol you actually expect them to hit something thats actually the problem? Nah just hit his Q base by 20 at max rank. Yeah like that was the main problem. Not the 150-200 shield on a 3.2 CD w/ everything Iceborn provides at lvl9. His offensive capabilities is fine but its the fact how well he can synergies with tank items.\n\nWhats happening is the same thing thats going on with balancing Gnar. Instead of taking away and replacing his %max HP dmg passive, they hit everything else around it to the point where its a lot easier and favorable to deal with his Mega form than his Mini form. Im willing to bet if you just take away his Mega form entirely then he would be a top tier adc.","replies":[]},{"poster":"Velasan","date":"2018-11-02T18:28:57.911+0000","up_votes":1,"down_votes":1,"body":"Or you know... put less emphasis on Q, and put it back on his laser.  One of the original focal points of the character.\n\nThey did the same thing to Sejuani when they reworked her.  Take their least used ability and put a bunch of their kit power into it.","replies":[]},{"poster":"Ceazaru","date":"2018-11-02T18:20:24.657+0000","up_votes":1,"down_votes":1,"body":"Just from seeing it at worlds Viktor has destroyed top lane","replies":[]},{"poster":"IOffMeta GtOvrIt","date":"2018-11-02T15:28:10.222+0000","up_votes":1,"down_votes":1,"body":"on the pbe they are lowering his base damage and putting more investment into his ap percentages so this should do it hopefully, he is basically getting the ekko, fizz, nidalee, etc treatment, all mid laners who went to top for a while due to their high base damages.","replies":[]},{"poster":"lilpokfluf","date":"2018-11-02T12:53:38.039+0000","up_votes":1,"down_votes":1,"body":"They need to make the shield and movement speed scale with ap imo.  dropping a couple base damage and increasing scaling isn't going to fix it","replies":[]},{"poster":"DragonShea","date":"2018-11-02T21:16:46.224+0000","up_votes":1,"down_votes":2,"body":"Remove the MS bonus and reduce his Q damage and shield by a small amount.","replies":[]},{"poster":"Rıots Bad Client","date":"2018-11-02T12:38:28.408+0000","up_votes":2,"down_votes":4,"body":"If anything maybe they can nerf the movementspeed from the Q and or the manacost.","replies":[]},{"poster":"l Ryden l","date":"2018-11-02T15:53:34.904+0000","up_votes":1,"down_votes":4,"body":"Nerf attack range!\n\nIf Vlad and Morg can be stable picks in whatever roles they're in, despite their basic attack range, then so can Viktor!\n\nThe problem is that he can safely and consistently proc Kleptomancy with 550 attack range. Which is the same range that many mages and marksman have. But because of the slow from Iceborn Gauntlet and the speed boost from his Q make it impossible to catch up and trade blows with him.\n\nWith a lowered attack range, Viktor can be more prone to harass and gap closers, meaning CC and burst can be more punish if he decides to proc Klepto, and melee champions have a bigger window of opportunity to strike back.","replies":[]},{"poster":"nm1010","date":"2018-11-02T15:41:52.417+0000","up_votes":1,"down_votes":4,"body":"Ranged champions shouldn't have full auto attack resets because they heavily skew early fights, Viktor can use his q to do this. If anything should be changed then it should be his aa reset.","replies":[]},{"poster":"Joseraph","date":"2018-11-02T13:07:32.957+0000","up_votes":1,"down_votes":6,"body":"https://matchhistory.na.leagueoflegends.com/en/#match-details/NA1/2892307615/376629\n\nVictor top so busted xdddddd","replies":[]}]}