{"poster":"Mist3rFl4sh","date":"2017-02-09T01:16:19.859+0000","title":"Altro post su Shen L'occhio del crepuscolo...","subforum":"Discussioni generali","up_votes":6,"down_votes":4,"body":"Questo campione mi sta dando davvero MOLTE soddisfazioni, &egrave; MOOOLTO utile... vi chiederete il perch&eacute; io stia facendo questo post ebbene, vi voglio riassumere il mia ultima partita con Shen buona lettura:\nComposizione della squadra alleata: \n{{champion:98}} vs {{champion:48}} TOP\n{{champion:107}} vs {{champion:104}} GIUNGLA\n{{champion:55}} vs {{champion:163}} MID \n{{champion:432}} vs {{champion:22}} ADC\n{{champion:117}} vs {{champion:12}} SUPPORTO \n\nLa partita era inizia con il piede giusto, eravamo in vantaggio grazie alla mie ENORME presenza sulla mappa una volta che avevo raggiunto il 6. La mia linea/lane, mettevo cosi tanta pressione che se Trundle si avvicinava gli facevo danni e non lo facevo farmare... Poi una volta raggiunto il 6 (come gi&agrave; detto prima) ho iniziato ad aiutare la mia bot perch&eacute; vedevo che erano un po&#039; in difficolt&agrave; dopo 3 gank di cui 2 miei e uno di Rengar, l&#039;ha bot ha iniziato a prendere un vantaggio non poco importante ma io avevo perso la mia prima torre top perch&eacute; c&#039;erano Trundle e Graves. Dopo poco aver perso la mia torre, la partita si era trasformata radicalmente, i nostri nemici avevano iniziato a recuperare prendendo draghi su draghi e anche un baron. Dopo che avevano preso questi 2-3 draghi il mio team si era un po&#039; demoralizzato ma dopo i 25-30 minuti (dopo che loro avevano fatto il primo baron) il morale della squadra era  veramente a terra... Ho cercato di aiutarli ed a stimolargli e grazie a me, avevamo iniziato a recuperare anche se a fatica... Ogni errore poteva essere fatale quindi gli dicevo che cosa fare e cosa non dovevano fare (gli davo dei consigli per non fargli andare allo sbaraglio..). L&#039;oro avevano ancora il buff del baron combattiamo al drago maggiore ma perdiamo il fight, erano tutti morti solo io ero rimasto vivo, volevo aiutare il mio team ma non potevo perch&eacute; se io fossi morto la partita sarebbe finita all&#039;istante. Cerco di difendere l&#039;inibitore top, cerco di fargli delle finte (di betargli in pratica...) nasce katarina cerco di prendergli tutti e 2 con la mia E pi&ugrave; lo slow dell&#039;{{item:3143}} e avevamo ucciso Graves e Alistar dopo che avevano preso l&#039;inibitore mid. Dopo aver ucciso Graves e Alistar, ripuliamo le lane mid e top, io gli rassicuro con la mia ulti... Mal che vada se scatta un fight avevo la mia ulti a proteggergli, infatti dopo che io gli avevo detto di non avere paura scatta un fight nei d&#039;intorni del blu avversario e gli inibitori si erano rigenerati per fortuna... Dopo di che io uso la mia suprema uccidiamo Trundle e Taliyah passiamo a distruggere la loro torre bot... Uccidiamo Ashe dopo poco anche Graves e dopo poco ancora Rengar uccidere Alistar e facciamo un bel ACE mentre gli avversari che avevamo ucciso prima ( Trundle e Taliyah) prendiamo l&#039;inibitore bot nasce Trundle ma lo uccidiamo subito,distruggiamo le torri del nexus nasce Taliyah usa la {{item:3157}} cerco di prenderla ma usa il flash un&#039;instante dopo che io avevo cercato di prenderla con la E riesce a salvarsi ma alla fine distruggiamo il nexus e vinciamo. \n\nQuesto campione mi sta dando davvero MOLTE soddisfazioni... Non me l&#039;ho sarei mai aspettato di poter carriare una 2&deg; partita con Shen... Spero di avervi intrattenuti quei 5-7 minuti, sei sei arrivato fin qui ti ringrazio per la lettura  \n\nBuon game a tutti!","replies":[{"poster":"GragasTheCatfish","date":"2017-02-10T21:42:02.605+0000","up_votes":2,"down_votes":0,"body":"scusate ma chi era nella mid avversaria?\nchi è questa cosa?\n{{champion:163}} {{champion:163}} {{champion:163}} \nesiste? si vede nei game?","replies":[{"poster":"FuryTheFenix ITA","date":"2017-02-10T21:54:44.441+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=GragasTheCatfish,realm=EUW,application-id=MJVj50Jw,discussion-id=UHpyPT4K,comment-id=0005,timestamp=2017-02-10T21:42:02.605+0000)\n>\n> scusate ma chi era nella mid avversaria?\n> chi è questa cosa?\n> {{champion:163}} {{champion:163}} {{champion:163}} \n> esiste? si vede nei game?\n\nCos'è? un nuovo oggetto iniziale per i jungler?","replies":[]},{"poster":"Mist3rFl4sh","date":"2017-02-11T00:23:27.272+0000","up_votes":1,"down_votes":0,"body":"io l'ho incontrata si e no 5 volte da quando ho iniziato a giocare a League of Legend","replies":[]}]},{"poster":"monto78","date":"2017-02-12T05:01:34.002+0000","up_votes":1,"down_votes":0,"body":"io shen lo suo quasi esclusimamente supporto, ho un buon 60% di vittoire.. e 90% vittoria lane..anche se l'adc avversario è piu forte del mio","replies":[]},{"poster":"vondarck","date":"2017-02-09T09:12:20.274+0000","up_votes":1,"down_votes":0,"body":"occhio però, {{champion:98}} è molto forte ma ci sono alcuni champ che non ti consentono di \"mollare la torre\"\n\n{{champion:83}} {{champion:75}} {{champion:157}} {{champion:23}} {{champion:240}} {{champion:27}} \n\no champ che in early ti schiacciano \n\n{{champion:80}} {{champion:58}} {{champion:150}} {{champion:126}} {{champion:17}} {{champion:62}} \n\ncontro i primi prima di rommare devi assicurarti che la tua linea sia pushata (e tu abbia il tp), contro i secondi devi gestirti MOOOLTO bene gli scudi","replies":[{"poster":"Mist3rFl4sh","date":"2017-02-11T00:24:34.476+0000","up_votes":1,"down_votes":0,"body":"Non ti preoccupare, con shen so cavarmela e so quando è il momento di usare la passiva","replies":[]}]},{"poster":"Khail the Crow","date":"2017-02-10T02:23:45.179+0000","up_votes":1,"down_votes":0,"body":"Shh non parlarne troppo in giro, che poi lo giocano in tanti e ce lo nerfano.","replies":[]},{"poster":"FuryTheFenix ITA","date":"2017-02-09T14:05:16.934+0000","up_votes":1,"down_votes":0,"body":"NO.....DEVO....COmprare...un mid...tu mi vuoi vendere shen....manco fosse un'aspirapolvere....ugh...........\nAdesso voglio comprarlo, spero che tu sia contento adesso......\nIn ogni caso, buona fortuna nella landa!\n(Non contro di me).","replies":[]},{"poster":"wattbatt","date":"2017-02-09T09:15:34.631+0000","up_votes":1,"down_votes":0,"body":"qual è stato il primo item?","replies":[{"poster":"Mist3rFl4sh","date":"2017-02-09T13:47:36.297+0000","up_votes":1,"down_votes":0,"body":"Come primo item ho fatto il mantello del sole","replies":[]}]},{"poster":"markmask","date":"2017-02-09T08:32:56.009+0000","up_votes":1,"down_votes":0,"body":"Una delle poche soddisfazioni di lol è quella di riuscire a tirare su il morale al tuo team e poi riuscire a vincere una partita. Secondo me Shen è una delle forme più iconiche di difesa per i propri alleati, perché in pratica rischia (a volte) di sacrificare se stesso pur di proteggere gli altri con la propria ulti. Io è da 2 anni che gioco a lol e ho visto questi comportamenti SOLO 2 volte. Il fatto che Shen possa proteggere qualcuno dandogli un ottimo scudo, lo rende un champion (a mio parere) di cui fidarsi ciecamente se c'è qualcosa che non va.","replies":[]}]}