{"poster":"Mist3rFl4sh","date":"2016-11-27T08:46:12.339+0000","title":"Torri del nexus uguale a quelle normali,perché?","subforum":"Discussioni generali","up_votes":1,"down_votes":1,"body":"Vorrei sapere perch&eacute; ora le torri sia del nexus e quelle oer l&#039;inibitore sono uguali?cosa ha spinto la riot a mettere le torri normali anche nel base? Secondo me erano meglio prima perch&eacute; ora un colpo ogni 1s circa (o almeno penso) fa si che i tank possano fate dove molto molto molto di pi&ugrave; rispetto a prima,mi sono trovato parecchie volte che un singed corra sotto torre senza timore con tutta la squadra dietro,perch&eacute; la riot ha fatto questo?  Qualcuno sarebbe  cosi gentile da spiegarmi questa cambiamento delle torri per la base?","replies":[{"poster":"Dragonfield123","date":"2016-11-27T09:29:59.008+0000","up_votes":1,"down_votes":1,"body":"Io con nasus con la bramasangue mi tanko easy la torre dell'inibitore, in un game sarò stato lì 5 minuti a fightare contro il team nemico prima di muorirci xd","replies":[{"poster":"TSM Helios","date":"2016-11-27T10:18:56.632+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Dragonfield123,realm=EUW,application-id=MJVj50Jw,discussion-id=1cHFw487,comment-id=0001,timestamp=2016-11-27T09:29:59.008+0000)\n>\n> Io con nasus con la bramasangue mi tanko easy la torre dell&#x27;inibitore, in un game sarò stato lì 5 minuti a fightare contro il team nemico prima di muorirci xd\n\nPiù lungo di una punizione di holly e benji.","replies":[{"poster":"Kim114","date":"2016-11-27T10:38:50.358+0000","up_votes":1,"down_votes":0,"body":"più lungo dei 5 minuti prima di far esplodere il pianeta che Freezer aveva attaccato\nPASSARONO 5 PUNTANTE DA 12 MINUTI","replies":[]}]}]},{"poster":"SerSlayer","date":"2016-11-27T09:26:51.578+0000","up_votes":1,"down_votes":0,"body":"Bhe credo che avrai già notato che siamo nella stagione dei tank, o meglio saremo. Nessuno lo sa, credo, sono loro idee che decidono di attuare, come l'inizio della season 6 era la season degli adc e dopo la metà della season 6 era la patch dei maghi, che aveva fatto un pò scomparire i tank, ora nella season 7, più andremo avanti e più le partite saranno formate solo da tank. Con tutti i nuovi item per tank e support, la maestria del colosso che rende i tank immortali (ma allo stesso tempo uccidono con un colpo), le torri che non riescono più a resistere, senza applicare penetrazione armatura e con un inibitore giu praticamente la partita è finita. Purtroppo sono loro scelte, devi adattarti, siamo nelle patch dei tank, almeno fino a marzo, aprile, sarà cosi. Chi non si adatta non ottiene i \"bonus\" che la stagione offre.\n\nNon bannavo un malphite dalla stagione 5, ora dovrò ricominciare a bannare tutta la lista dei tank con hard CC.","replies":[{"poster":"The Fluffy Lamb","date":"2016-11-27T15:49:29.109+0000","up_votes":1,"down_votes":0,"body":"Gnar è troppo puccioso.  Non puoi bannare gnar. NON PUOIIIIIIIIIIIII","replies":[]}]},{"poster":"UltraLion","date":"2016-11-27T15:25:12.359+0000","up_votes":1,"down_votes":0,"body":"A me piacevano i laser, non ho idea della differenza di impatto sulla partita, ma facevano figo i laser, li rivoglio","replies":[]},{"poster":"Vileblood Pyke","date":"2016-11-27T11:18:18.903+0000","up_votes":1,"down_votes":0,"body":"[\"[...] per uniformare la modalità di attacco generale delle torri.\"](http://euw.leagueoflegends.com/it/news/game-updates/patch/note-sulla-patch-622#patch-turrets)","replies":[]},{"poster":"fedy99","date":"2016-11-27T09:57:44.286+0000","up_votes":1,"down_votes":0,"body":"Io prenderei esempio da dota,le torri del \"nexus\" sono molto più forti e un tank non riesce a tankarle a lungo","replies":[{"poster":"Kim114","date":"2016-11-27T10:37:37.703+0000","up_votes":1,"down_votes":0,"body":"è giusto\nperchè i tank possono mettersi afk sotto le 2 torri e uscire dopo 10 minuti con mezza vita?","replies":[]}]},{"poster":"Snable Brace","date":"2016-11-27T10:57:55.178+0000","up_votes":1,"down_votes":1,"body":"pure io la penso come tutti voi. #RIVOGLIAMOLEVECCHIETORRI","replies":[]}]}