{"poster":"Mist3rFl4sh","date":"2017-02-07T22:40:36.388+0000","title":"Shen","subforum":"Discussioni generali","up_votes":2,"down_votes":1,"body":"Beh... Mi devo ricredere su questo campione... Molto forte, stra utile e con dei  danni non troppo male per tutte le fasi del game. Vi racconto cosa mi &egrave; accaduto:\r\n\r\nHo visto che avevano preso jax nella squadra nemica, il mio team era composto da io top con shen Vs jax, diana giungla Vs warwirk, fizz mid Vs zed, caitylin adc con miss fortune supporto Vs Lucian e thresh. Decido cos&igrave; di prendere shen per non giocare sempre gli stessi campioni, avevano 3 campioni che si basavano sul fare AA jax, ww e Lucian. La lane in phase me l&#039;ha gestisco piuttosto bene... Eravamo arrivati ad un punto (preciso che loro erano tutti full ad)  che ci stavano aprendo in 2 letteralmente \r\n\r\nP. S. la build che ho usato &egrave; questa: idra titanica, mantello del sole, orgoglio di randuin, corazza spinata, calzari del ninja e la corazza dell&#039;uomo morto. \r\n\r\nPoi avevamo iniziato a recuperare grazie a me  ed mf, iniziando a fare combo tra la mia &Egrave; attiva del randuin ulti e la E di mf. Mentre tutti attaccavano me perch&eacute; erano provocati dalla mia E, mf arrivava attivava la E e la sua ulti e scioglieva la squadra nemica... Maa cosa pi&ugrave; bella che &egrave; successa &egrave; che jax e ww non mi facevano niente avevo 400 di armatura ma facevo degli ottimi danni.... Alla fine abbiamo fatto un ultimo fight e abbiamo vinto! Volevo solo condividere la mia gioia nel dire HO POTUTO CARRIARE CON SHEN IN NORMAL!!! E di questo ne posso essere solo felice :) non potete capire la mia soddisfazione...","replies":[{"poster":"FuryTheFenix ITA","date":"2017-02-07T23:54:36.064+0000","up_votes":2,"down_votes":0,"body":"Non...farmi comprare...shen...devo arrivare a .....6300 punti.....la tentazione...è troppa.....\n\nAnyway gg wp! Ci vediamo nella landa!(preferibilmente non contro!)","replies":[{"poster":"Mist3rFl4sh","date":"2017-02-08T01:28:48.094+0000","up_votes":1,"down_votes":0,"body":"xD","replies":[]}]},{"poster":"Dodop","date":"2017-02-08T13:21:14.570+0000","up_votes":1,"down_votes":0,"body":"Anche secondo me è un pick molto forte in toplane grazie alla tankiness, ai danni abbastanza elevati che può infliggere in ogni momento del game, alla ottima capacità di splitpush e supporto al resto del team (grazie alla ulti). Pensavo che al momento (dopo il sostanzioso nerf alla patch pre-mondiali dello scorso anno) non fosse così forte, soprattutto in low elo (in competitive è ancora più forte secondo me) e invece ho vinto un sacco di ranked con lui, mi ha stupito anche a me ultimamente. La build che uso solitamente io (e che ti consiglio) è questa: {{item:3068}} {{item:3111}}O{{item:3047}} {{item:3065}} {{item:3748}} {{item:3026}} {{item:3143}}O{{item:3102}} (poi vedi te in base al tipo di danno dei nemici)","replies":[{"poster":"Mist3rFl4sh","date":"2017-02-08T18:16:55.133+0000","up_votes":1,"down_votes":0,"body":"Shen è veramente bello/forte/utile alla propria squadra... Però c'è da dire che Shen è più un counter pick, di certo non puoi usarlo contro ogni campione presente nel gioco, specialmente contro campioni che si basano sul fare danni con le abilità  l'esempio più rampante è {{champion:86}}. Shen va preso contro certi campioni proprio perché il suo kit offre tante possibilità alla propria squadra ed è il campione che può aiutare un suo alleato e ritornare top come se non fosse successo niente; in questo modo fa prendere vantaggi alla propria squadra e allo stesso tempo non perde troppi minion. La cosa più bella si Shen che countera quei meravigliosi campioni che si basano sul fare auto attacchi, e sono: {{champion:157}} {{champion:11}} {{champion:266}} {{champion:10}} {{champion:19}} {{champion:240}} {{champion:114}} ecc... Però l'unica cosa che non i piace e che si basa troppo sule sue abilità, se non prendi il tuo avversario con la Q o con una E rischi di mandare a monte un team fight o uno scontro 1v1.","replies":[{"poster":"Sigmamoner","date":"2017-02-09T09:05:58.246+0000","up_votes":1,"down_votes":0,"body":"Secondo me contro Kayle vieni sbranato...\nSì, hai difesa verso gli AA e la cosa diventa ottima nei team fight, ma in corsia IMHO Shen perde senza speranze, almeno a parità di interventi dei jungler.\n\nShen, Nasus e (dipendentemente da come giocata) Illaoi sono melee troppo immobili per contrastare Kayle.","replies":[]}]}]},{"poster":"vondarck","date":"2017-02-08T10:35:40.886+0000","up_votes":1,"down_votes":0,"body":"{{champion:98}} è viabile anche come support e junger in ogni caso\n\nbel champ e bel tank","replies":[{"poster":"Dodop","date":"2017-02-08T13:15:39.098+0000","up_votes":1,"down_votes":0,"body":"Giusto, però non è in meta in entrambi i casi, in top è molto più forte atm.","replies":[{"poster":"vondarck","date":"2017-02-08T13:25:28.352+0000","up_votes":1,"down_votes":0,"body":"ya, confermo, specie dopo che hanno nerfato il colosso","replies":[]}]}]}]}