{"poster":"Mist3rFl4sh","date":"2017-10-02T21:34:57.528+0000","title":"Ci saranno buff futuri sulle statistiche dei campioni per l'arrivo del nuovo sistema?","subforum":"Discussioni generali","up_votes":2,"down_votes":0,"body":"Salve, &egrave; da un po&#039; di giorni che &egrave; uscito un post sul sito Surrender at 20, dove dice che vari campioni (maggior parte adc e assassini), venivano buffati di 5 o 10 danni su una abilit&agrave;. Ora, io mio ricordo che, prima di tutto sto abaratram, la RIOT ha detto che a causa di questo aggiornamento in arrivo, potenziavano le statistiche ai campioni per far s&igrave; che funzionino, perch&eacute; ci sono alcuni campioni che necessitano di una qualche statistica principale, come i fighter come tryndamere che hanno bisogno di attack speed per fare un banale esempio. Ora, da quelle famosi frasi, io questi buff alle statistiche, non li vedo ancora. Forse &egrave; troppo presto per tirare in ballo questo argomento? Per&ograve; io non vorrei ritrovarmi a giocare campioni come Nasus che necessitano un minimo di attack speed, per prendere i minion caster sotto torre, perch&eacute; altrimenti non muoiono, ci ho provato ma &egrave; praticamente impossibile. Forse con un po&#039; di tecnica, uno ci pu&ograve; anche riuscire, ma ci&ograve; non toglie il che &egrave; stato detto una cosa ma ancora non si &egrave; visto l&#039;ombra, quindi due potrebbero essere le cose:\r\n1) Sto fosse parlando troppo presto, e magari questi &quot;buff&quot; usciranno poco prima alla giunta del nuovo sistema di rune/maestrie. \r\n2) Stanno ancora testando questo sistema, e quindi non hanno ancora le idee chiare. Quale campione ha bisogno di un particolare buff alle statistiche, perch&eacute; altrimenti non funzionerebbe oppure, faranno solo degli aggiustamenti per far s&igrave; che, un determinato campione funzioni come dovrebbe. \r\nQueste sono le mie... &quot;Idee&quot; chiamiamole cos&igrave;, voi cosa ne sapete al riguardo? Questa cosa che loro hanno detto, la faranno oppure no? Perch&eacute; io non vorrei ritrovarmi uno dei miei copioni (sopratutto Nasus, ma cmq anche chi uso con molta voglia), distrutti con questo aggiornamento. E non penso di essere l&#039;unico ad avere questo dubbio, quindi spero che qualcuno mi possa sollevare, perch&eacute; &egrave; da un po&#039; di giorni che ho questo... &quot;Chiodo&quot; fisso nella testa, quindi chiedo gentilmente a qualcuno se mi pu&ograve; dare qualche informazione e delle prove concrete per far s&igrave; che io finisca fi farmi le seghe mentali. Grazie per l&#039;attenzione.","replies":[{"poster":"HaIIeIujah","date":"2017-10-02T21:58:55.379+0000","up_votes":3,"down_votes":0,"body":"SI, già ci sono, insieme a buff ai danni basi di molte spell.","replies":[{"poster":"Mist3rFl4sh","date":"2017-10-02T22:23:15.340+0000","up_votes":1,"down_votes":0,"body":"Va bene! Aspetto di vederli il prima possibile di persona.","replies":[{"poster":"mangialavandini","date":"2017-10-03T07:39:49.989+0000","up_votes":1,"down_votes":0,"body":"http://www.surrenderat20.net/search/label/PBE/\n\nA te","replies":[]}]}]},{"poster":"superkey97","date":"2017-10-02T21:53:44.885+0000","up_votes":2,"down_votes":0,"body":"Si! Stanno arrivando questi famigerati buff di massa, non ti preoccupare, se guardi attentamente su surrender at 20,li stanno spoilerando settimana dopo settimana, piano piano, però da quel che ho capito, saranno TUTTI applicati una volta che la pre-season arriverà. Spero di esserti stato utile, ciao :)","replies":[{"poster":"Mist3rFl4sh","date":"2017-10-02T22:23:54.920+0000","up_votes":1,"down_votes":0,"body":"Si si, ho visto... Infatti controllo ogni giorno, dopo tot ore per controllare se è uscito qualcosa di nuovo riguardo a ciò.","replies":[]}]},{"poster":"Jon Moxley","date":"2017-10-02T22:11:17.201+0000","up_votes":2,"down_votes":3,"body":"Rip {{champion:102}} \nè stato bello finchè è durato.\n8 mesi ad aspettare la championship skin buttati nel water..","replies":[{"poster":"Mist3rFl4sh","date":"2017-10-02T22:30:42.232+0000","up_votes":2,"down_votes":0,"body":"Dai, le conclusioni si potranno fare quando arriverà l'aggiornamento. Ho visto vari post sul forum riguardo al tuo main champ (shyv), se anche dopo l'aggiornamento, avrà bisogno di qualche aggiustatina, non penso che la lasceranno in stallo, o no? Si positivo, magari con il nuovo sistema, qualcosa potrebbe anche migliorare, che ne sai in fondo. Non essere pessimista al riguardo :)","replies":[]}]}]}