{"poster":"Mist3rFl4sh","date":"2017-04-21T06:52:19.553+0000","title":"Steven universe... Il cartone più discusso di sempre...","subforum":"Off-topic","up_votes":2,"down_votes":1,"body":"Inizio con il presupposto che magari, qualcuno trover&agrave; un po&#039; &quot;stupido&quot; ma... Non posso vedere queste cose e starmene zitto... Perch&eacute; non &egrave; giusto! \r\n\r\nCome fan di steven universe, ho deciso di aprire questo post perch&eacute;... Insomma... Come fan sfegatato vedere certe censure che potrebbero essere: frame tagliati perch&eacute; contengono parole &quot;inappropriate&quot;, battute censurate sempre per lo stesso motivo di prima o addirittura riferimenti nell&#039;omosessualit&agrave; ecc.. . E poi la cosa che mi da pi&ugrave; fastidio di questo cartone e che... Lo prendono troppo sul &quot;personale&quot; riguardo al genere/sesso delle gemme, i loro corpi sono uno spettro di luce solida (il loro corpo &egrave; una illusione) ma quindi... Perch&eacute; fare censure che riguardo l&#039;omosessualit&agrave;? Steven universe &egrave; un cartone che dovrebbe insegnare/trasmettere che anche i bambini possono cambiare il mondo &egrave; seguire la loro natura. .. &Egrave; in fondo... Il messaggio in s&eacute; &egrave; anche BELLO da concepire... Perch&eacute; vedere cartoni al mondo d&#039;oggi che ti insegno qualcosa &egrave; raro... Ma allora perch&eacute; fare tutto questo riferimento su  l&#039;omosessualit&agrave;? Censure riguardante proprio questo! In un cartone che dovrebbe trasmettere: amicizia, non giudicare/criticare il prossimo, l&#039;amore &egrave; la famiglia ecc... Anche paesi prima degli USA (riguardante che gli le coppie omosessuali potevano sposarsi e adottare bambini) ma, come detto prima, in alcuni paesi (gi&agrave; sviluppati sotto questo punto di vista con delle leggi) censurare parti della storia (balli/baci) perch&eacute;... Ritenuto inappropiato per il pubblico... Ma allora perch&eacute; negli USA la serie sta proseguendo senza alcuna inconvenienza? Mentre in altri paesi (chi &egrave; abbonato a Sky sopratutto in Italia) deve pagare guardando episodi censurati? TUTTO CI&Ograve; NON HA SENSO! Non parlo dell&#039;Italia (anche se alcune censure non riguardante l&#039;omosessualit&agrave; ci sono e come,  alcune sono per di pi&ugrave; SCIOCCHE! Altre sono censure di adattamento... Ma... Al diavolo...  ) ma parlo di CN (cartoon network) UK e francese non solo... In Russia tagliare una parte \r\n\r\n(SPOILER ALLERT!!! Per chi non ha visto l&#039;episodio, non leggesse questa parte) sar&agrave; anche vecchio, ma &egrave; giusto per fare un esempio &egrave; di quando un singolo episodio sia stato preso di mira cosi &quot;violentemente&quot; \r\n\r\nnell&#039;episodio &quot;dobbiamo parlare&quot;/&quot; we need to talk&quot;, in Russia viene censurata la parte in cui... Perla e Rose decidono di fondersi per rendere il video di Greg (futuro padre di steven) pi&ugrave; interessante ebbene... Il ballo viene totalmente censurato... Sempre per via della storia dell&#039;omosessualit&agrave;\r\n\r\n(ANCHE QUI SPOILER ALLERT), \r\nNell&#039;episodio finale della prima stagione \r\nquando Garnet si riunisce grazie all&#039;unione e l&#039;amore di rubino e zaffiro, in Russia questa scena rubino ha dei baffi... Si... Avete capito bene! DEI BAFFI! Perch&eacute; la scena era ritenuta inappropiata, sempre riguardante il discorso dell&#039;omosessualit&agrave;. In Italia invece hanno avuto la brillante idea di mettere dei flash bianchi quando Garnet e Jasper (Diaspro) si combattono ritenute le scene troppo &quot;violenti&quot;... &Egrave; in Francia la stessa canzone che dice Garnet, che lei &egrave; un sentimento che non finisce mai ovvero che lei &egrave; il frutto dell&#039;amore tra rubino e zaffiro e non pu&ograve; perdere da una single perch&eacute; l&#039;amore batte qualunque cosa! Ma, in Francia viene inteso come...&quot;amicizia&quot;. Io... Dopo aver saputo tutto ci&ograve;... Cosa ha la CN (in generale) contro l&#039;omosessualit&agrave;? Ognuno pu&ograve; essere quello che si sente di essere... Ma allora... PERCH&Eacute;! FARE... TUTTO QUESTO?!? Io lo dico sempre che l&#039;essere umano o l&#039;umanit&agrave; &egrave; &quot;PRIMITIVA&quot; e &quot;IGNORANTE&quot; sotto questo punto di vista... Sempre a giudicare, giudicare, giudicare e giudicare il prossimo... &Egrave; vero che sto parlando di un cartone... Ma non &egrave; giusto che in un cartone cos&igrave; innocente fatto per bambini!  censurare scene perch&eacute; rese inappropiate sempre per il discorso dell&#039;omosessualit&agrave;,  &egrave; TOTALMENTE sbagliato! Un cartone come steven universe... Affascinante, intrigante e RICOLMO di trame... Venir preso come una &quot;barzelletta&quot;. Censure su censure... Preso sempre di mira da qualunque cosa! Volete degli esempi? Alcune censure sono censure di adattamento, quindi eviter&ograve; di scriverle. (per censura di adattamento si intende, una parola che viene sostituita con un&#039;altra rendendola pi&ugrave; orrcchiabbile e meno pesante&quot;\r\n\r\nCensura dell&#039;episodio 5 &quot;ti piacciono le patatine?&quot; in inglese &quot;Frybo&quot; viene censurata una battuta di Steven quando combatte contro Frybo e dice &quot;your move, frybo&quot; che tradotto sarebbe &quot;la tua mossa, Frybo&quot; \r\n\r\nEpisodio 10 il Leona rosa/steven&#039;s Lion \r\n Qua vengono censurate battute sia di steven e di Ronaldo, quando steven entra per chiedere una pizza ebbene, viene censurata la parte in cui steven dice &quot;ordino per due o sto ordinando per due&quot; e Ronaldo si alza, sputa la bibita e grida/esclama  &quot;steven e incinta?!&quot; e anche (quando Ronaldo entra di nuovo nella pizzeria) Ronaldo dice &quot;scommetto che non sei nemmeno incinta&quot; il senso qual&#039;&egrave;? \r\n\r\nForse la censura pi&ugrave; stupida che ci sia, episodio 11 mania sala giochi/arcade mania \r\n\r\nSemplicemente hanno tagliato un frame in cui steven dice &quot;meat beat mania&quot; la censura pi&ugrave; stupida\r\n\r\nEpisodio 16 olo lama/steven the sward fighter anche qui una censura inutile... \r\n\r\nTagliano un frame quando perla viene ferita lasciando cadere la spada a terra e steven esclama &quot;Pearl?!&quot; \r\n\r\nPotrei continuare all&#039;infinito... &Egrave; questo erano solo degli esempi banali, in alcuni episodi vengono tagliati dialoghi della storia e anche frame come nel capito finale quando jasper afferra il &quot;disintegratore di gemme&quot;, colpisce Garnet, nella versione italiana viene mostrata solo l&#039;esplosione di Garnet ma, nella versione inglese, fa vedere che Garnet viene &quot;smolecolata&quot; guarda steven e poi esplode. \r\n\r\n\r\nP. S ognuno &egrave; libero di sentirsi come vuole... Ma siccome l&#039;umanit&agrave; fa schifo e continuer&agrave; ad esserlo... Dovremmo vedere censure riguardante l&#039;omosessualit&agrave; in un cartone che dovrebbe insegnare a non giudicare il prossimo... Sembra quasi una barzelletta... \r\n\r\nE per chi se lo stesse domandando... Si... Lo so che le censure vengono fatte in Inghilterra in base al pubblico e alla cultura ecc... QUESTE COSE... Come definire l&#039;essere umano in una parola &quot;SPREGGIEVOLE&quot; perch&eacute; qui si parla di un cartone che deve trasmettere sentimenti positivi e non negativi... \r\n\r\nDitemi voi come la pensate... Non trovo giusto che in un mondo cos&igrave; ci sia ancora il pensiero di giudicare qualcuno che &egrave; diverso... Noi siamo sempre esseri umani in fondo... Ma &egrave; meglio giudicare piuttosto che caprende...","replies":[{"poster":"SickAnto","date":"2017-04-21T08:45:29.184+0000","up_votes":1,"down_votes":0,"body":"Togliendo la grammatica e la stupida frase \"l'umanità fa schifo e continuerà ad esserlo\" non farei un dramma per le censure attuate, sopratutto quelle in Russia, dove si sa già da tempo la loro grande omofobia. Stessa cosa CN che ha sempre dato dei limiti ai cartoni.\n\nLe censure ci sono sempre state e c'è chi ne ha subite di peggio rispetto a SU.\n\nOnestamente non darei una grande colpa ai censuratori, lo fanno in base al pensiero che c'è nella nazione e alla fascia media di età che vede il cartone; se per loro una X cosa potrebbe scandalizzare il pubblico, la tolgono, fine.\nPuò essere anche sbagliato o stupido farlo ma io accetto le loro decisioni, sebbene mi possa dare fastidio, sopratutto se mi togli qualcosa importante per la trama principale.\n\nGli adattamenti sono più che giusti invece; una frase può avere senso in una lingua, in un'altra un po' meno.","replies":[{"poster":"HaIIeIujah","date":"2017-04-21T08:58:39.251+0000","up_votes":4,"down_votes":0,"body":"> Può essere anche sbagliato o stupido farlo ma io accetto le loro decisioni, sebbene mi possa dare fastidio, sopratutto se mi togli qualcosa importante per la trama principale.\n\nIl problema qui è che SU non è un cartone che \"contiene\" sessualità, è un cartone _sulla_ sessualità. Tre quarti degli elementi di trama non funzionano se certi concetti vengono censurati.\n\nE' uno di quei casi in cui è stato maledetto dal suo stile grafico: la scelta \"corretta\" sarebbe lasciarlo non-censurato ma limitarlo ad una fascia oraria e di pubblico maggiore (tranne il caso Russo, perché... Russia). Invece per la sua presentazione è stato tagliato fino a raggiungere il modello di cartone per bambini che ci si aspetta dal media.","replies":[{"poster":"Mist3rFl4sh","date":"2017-04-22T03:40:10.561+0000","up_votes":1,"down_votes":0,"body":"\"Il problema qui è che SU non è un cartone che \"contiene\" sessualità, è un cartone sulla sessualità\" \nSpiegati meglio...","replies":[{"poster":"HaIIeIujah","date":"2017-04-22T08:26:20.340+0000","up_votes":1,"down_votes":0,"body":"Leva le scene in cui Goku è nudo da dragonball e tutto ciò che perdi sono un paio di battute.\n\nLeva il concetto di sessualità dal personaggio di Garnet e hai perso il personaggio di Garnet. \n\nCi sono parecchi episodi che se censurati fino ad essere \"accettabili\" perdono di significato. Come diamine fai a rendere \"Stevonnie\" (per chi interessa, una fusione tra un ragazzo ed una ragazza che finisce per essere un qualcosa di androgino) \"socialmente accettabile\" senza mutilare il suo episodio? O l'intero arco narrativo di Pearl senza eliminare la sua relazione (omosessuale, che sia ricambiata o meno) con Rose? Qualunque cosa contenga Lapis e Jasper senza rappresentare la relazione abusiva in cui sono?\n\nSarebbe più facile censurare Berserk che Steven Universe, almeno in quanto a mantenere il signfiicato orginale.","replies":[]}]}]},{"poster":"Mist3rFl4sh","date":"2017-04-22T03:41:46.813+0000","up_votes":1,"down_votes":0,"body":"La grammatica non è un'opinione... O forse riguardava la matematica? Adesso non ricordo. Quindi fammi capire, se tagliano parti della storia compresi dialoghi e filmati... Tu saresti d'accordo? La maggior parte delle censure di SU sono per lo più SCIOCCHEZZE... Frasi, dialoghi e filmati censurati totalmente a CASO! ","replies":[{"poster":"SickAnto","date":"2017-04-22T06:09:29.739+0000","up_votes":1,"down_votes":0,"body":"> sebbene mi possa dare fastidio, sopratutto se mi togli qualcosa importante per la trama principale.\n\nRipropongo.","replies":[]}]}]}]}