{"poster":"Shetler","date":"2015-02-03T20:32:29.003+0000","title":"What's your biggest Noob Moment?","subforum":"[ARCHIVED] Miscellaneous","up_votes":56,"down_votes":7,"body":"Sup doods! I was going through last week’s [origin story thread](http://riot.com/1z0bgzg) and loved reading how everyone found their way into League. As I was reading, I also noticed tons of you had some pretty hilarious noob moves to share, so I figured this week we could share our fondest memories of being pretty terrible at the game! So to get things rolling, I figured I’d treat all of you with my most noobtastic move.\r\n\r\nI got pretty deep into League shortly after launch. I had been playing WoW for a few years but as a college student the time commitment to raids and recurring cost was, much to my dismay, a bit too much for me at the time. That's where League came in. It was a great way for me to keep in touch with friends at far away schools, and games were short enough that I could play around my ever-expanding course schedule. As with most games, I let it absorb me. I farmed up a pretty decent line up of champions, spent tons of IP figuring out the rune combiner, and generally just threw myself into the experience head first. \r\n\r\nAfter a few months of this, I considered myself to be a pretty decent player and was the go-to-guy in my group of friends for tips on improving. One day, a friend of mine decided he was going to begin learning support and was curious about my setup for Taric. I ran him through my runes, helped him understand how his abilities worked and explained to him the viability of armor crafted in or around the 5th age. I even likened the importance of dazzle’s range and positioning to playing a holy paladin in arenas (his main at the time). Everything was going great until he asked me about how you develop your Taric \"mastery\"... \r\n\r\nMe: “Well, you’ll build mastery over time, but it will take a bit to get used to everything…”\r\n\r\nHim: “Huh, no not like 'mastery', like the talent tree stuff.”\r\n\r\nMe: “What talent tree?”\r\n\r\nHim: “You know, the talents, called masteries...”\r\n\r\nMe: “How long have those been there?!” *facepalm*\r\n\r\n**Now I want to hear about your noob moments!**","replies":[{"poster":"727PP","date":"2015-02-03T20:48:34.163+0000","up_votes":52,"down_votes":0,"body":"how many times I screamed at sorokas for not healing minions....","replies":[{"poster":"Aerothal","date":"2015-02-03T22:21:45.185+0000","up_votes":30,"down_votes":1,"body":"> [{quoted}](name=ant1nam3,realm=NA,application-id=cIfEodbz,discussion-id=ayKZl6wo,comment-id=0004,timestamp=2015-02-03T20:48:34.163+0000)\n>\n> how many times I screamed at sorokas for not healing minions....\n\ni got mad at a soraka after rework because she wouldnt give me mana...LOL","replies":[{"poster":"Shetler","date":"2015-02-03T22:50:15.870+0000","up_votes":104,"down_votes":0,"body":"I still get mad at Soraka for not giving me mana.","replies":[]}]}]},{"poster":"Jakojo","date":"2015-02-03T22:32:30.965+0000","up_votes":94,"down_votes":1,"body":"When I first started playing I thought {{champion:21}}  bot was the most OP thing ever, so when she was free I got really excited. I only build {{item:3145}}  on her because she used guns. I remember someone saying \"No build items like {{item:3072}} {{item:3031}} & {{item:3035}}.\" I'm like \"uh no, she doesn't use swords or bows you idiot.\"\n\nI was so good.","replies":[]},{"poster":"Yash Gautam","date":"2015-02-03T21:02:07.950+0000","up_votes":27,"down_votes":2,"body":"Not knowing that you can surrender by /ff instead of /surrender","replies":[{"poster":"GundayMonday","date":"2015-02-03T22:24:14.733+0000","up_votes":22,"down_votes":0,"body":"What's a surrender?","replies":[{"poster":"DrCyanide","date":"2015-02-03T22:28:49.123+0000","up_votes":78,"down_votes":0,"body":"Something you say \"No\" to, just like drugs.","replies":[]}]},{"poster":"Shetler","date":"2015-02-03T22:49:27.758+0000","up_votes":34,"down_votes":0,"body":"...\n..\n.\nWHAT...?","replies":[{"poster":"Kao Atlantis","date":"2015-02-03T23:49:15.277+0000","up_votes":32,"down_votes":0,"body":"For anyone who is interested or just had a wow moment like above, here is a list of all the chat commands, and their alternate commands...\n(Particularly useful is the /mute and /ignore @champion, as it makes it easy to mute players with special characters in their name)\n\n**EDIT**: Removed /buddylist, it appears not to work anymore.\n\n> * /allcommands, /allcmds\n * Lists some (not all) of the commands.\n* /help CommandName, /? CommandName\n * Lists the chat commands.\n* /all, SHIFT+Enter, /allchat\n * Sends a message to all players in the game.\n* /chatfilter\n * Toggles the profanity ON and OFF.\n* /whisper PlayerName, /msg PlayerName, /w PlayerName\n * Sends a private message to a player.\n* /reply, /r\n * Respond to the last person of whom whispered you.\n* /mute PlayerName, /mute all\n * Block communication for a player for the current match only. \"/mute all\" mutes everyone.\n * This also mutes the player's taunt, laugh, and joke.\n* /mute @champion\n * Block communication for the player playing the champion you enter after the @ symbol. (Example: /mute @Teemo)\n * This also mutes the player's taunt, laugh, and joke.\n* /ignore PlayerName, /squelch PlayerName\n * Mute player and add them to your ignore list so they are muted forever.\n * This also mutes the player's taunt, laugh, and joke.\n* /ignore @champion, /squelch @champion \n * Mute player playing the champion you enter after the @ symbol and add them to your ignore list so they are muted forever. (Example: /ignore @Teemo)\n * This also mutes the player's taunt, laugh, and joke.\n* /surrender, /ff, /concede, /forfeit\n * Start a surrender vote, or vote yes on a current surrender vote.\n* /nosurrender, /noff\n * Vote no on a surrender vote.\n* /joke, CTRL+1, /j\n * Plays champion's joke track.\n* /taunt, CTRL+2, /t\n * Plays champion's taunt track and animation.\n* /dance, CTRL+3, /d\n * Starts champion's dance sequence.\n* /laugh, CTRL+4, /l\n * Plays champion's laugh track and animation.\n* /toggle, CTRL+5\n * DJ Sona - Toggle through her tracks/transformations in the following order: Kinetic -> Concussive -> Ethereal  -> Kinetic\n \n---\n\nHope that helps some people. :D","replies":[]}]},{"poster":"Edbwn","date":"2015-02-03T21:18:48.766+0000","up_votes":23,"down_votes":0,"body":"WHAT? YOU CAN DO THAT?","replies":[]}]},{"poster":"disregardable","date":"2015-02-03T22:08:14.038+0000","up_votes":66,"down_votes":1,"body":"For my first like 8 levels, I had no idea that the items built into other items. So I'd either buy a ton of dorans blades or save up 3,000 gold for one of Ashe's recommended items. I always looked at the other players like, how do they do so much damage?!","replies":[{"poster":"Arie","date":"2015-02-03T23:12:16.024+0000","up_votes":47,"down_votes":0,"body":"I DID THAT. I thought I was the only one! I was like, \"I can't afford to buy anything. I guess I'll just BUY MORE POTS.\"","replies":[]},{"poster":"Shetler","date":"2015-02-03T22:50:46.779+0000","up_votes":30,"down_votes":0,"body":"THIS\n\nso.\n\nmuch.\n\ngold.","replies":[]}]},{"poster":"Dead Echo","date":"2015-02-03T22:41:14.475+0000","up_votes":29,"down_votes":0,"body":"{{champion:3}}  flashing into a team and not making sure my Ult was up, it wasn't.","replies":[{"poster":"Shetler","date":"2015-02-03T22:53:55.482+0000","up_votes":57,"down_votes":0,"body":"best part was how confident you felt going into it. \n\nhttp://i.imgur.com/468GrJQ","replies":[]}]},{"poster":"Fizz is not Fish","date":"2015-02-03T20:48:58.958+0000","up_votes":25,"down_votes":2,"body":"200 ping and pick {{champion:4}}","replies":[{"poster":"TimTheEnchanter7","date":"2015-02-03T22:30:13.077+0000","up_votes":56,"down_votes":0,"body":"Where picking a card is really the luck of the draw.","replies":[]}]},{"poster":"Zelnorack","date":"2015-02-03T23:55:10.221+0000","up_votes":50,"down_votes":0,"body":"When I first started playing I ended up seeing the Trinity Force and saw the cost was up at 4700.\n\nI figured \"Oh hey, it costs the most so it must be the best item in the game for everyone.\" Needless to say when I played Vayne I tried to buy 6 Triforce and I thought I dealt tons of damage.\n\nThen I learned of the wonder of Bloodthirster and Infinity edge. So I built 6 of them.\n\n\"Vayne, get boots!\" \"Okay!\" I bought 6 boots. I wanted to go fast.","replies":[]},{"poster":"GundayMonday","date":"2015-02-03T21:10:27.817+0000","up_votes":39,"down_votes":0,"body":"My first pvp game and first time seeing a {{champion:9}} .\nHe looked so squishy, I didn't understand why I couldn't control my champion and why he was healing, and OH GOD CAWCAWCAWCAWCAWCAWCAWCAW.\nWe didn't win that game.","replies":[]},{"poster":"Arie","date":"2015-02-03T23:10:12.443+0000","up_votes":37,"down_votes":0,"body":"My first game ever, I got lost in the jungle (I didn't even know that's what it was called). This is basically how it happened:\n\nTeammate: go back bot garen.\nMe: What? Yes, I know this *is* a bot game...\nTeammate: lol go back to the bottom lane and stop dying in the jungle\nMe: I.. I don't know which one is bottom. /dies of embarrassment\n\nAnd let's not forget how it took me three games to figure out I could level up my abilities past the first point, or the fact that I bought several pairs of boots, or that I couldn't understand why I was dying to turrets (I was terrified of them after my first couple of deaths because I thought they *always *meant death if you were near them!).","replies":[]},{"poster":"Syn Zykan","date":"2015-02-03T21:13:03.641+0000","up_votes":35,"down_votes":0,"body":"{{champion:53}} pulling an Amumu into my team leading to us getting aced...I swear I was aiming for Cait >.>","replies":[]},{"poster":"Duke Anax","date":"2015-02-03T21:02:06.996+0000","up_votes":31,"down_votes":0,"body":"First couple of my games there were a lot of Akali and Katharina. When they got strong I always build armor, because obvious. They were stabbing me with blades...\n\nSo after I finally figured that one out I made sure to always use MR against Master Yi, because Assassins do magic damage...\n\nI still made the same mistake very recently against Fizz, I was sure he did physical until he killed me for the first time.","replies":[]},{"poster":"Riot Neon","date":"2015-02-04T15:15:01.934+0000","up_votes":27,"down_votes":0,"body":"I played bot games until about level 15 or so because I was terrified of playing against real people. My boyfriend finally forced me to play a normal game, and I decided to play Lulu bot with him, because she is sooo cute :) I skip off to bot lane, only to be immediately grabbed by the enemy Blitz, then killed. WTF YOU CAN HIDE IN THE BUSHES? Bots don't do that!! I return to lane, and it happens again. Then a third time... My teammates ask if I am trolling, and try to give me advice. I interpret as them yelling at me. I start crying, and say SEE, THAT IS WHY I DON'T WANNA PLAY AGAINST REAL PEOPLE.\n\nI got over it pretty quickly, though. The next game, I learned to ward, and \"STAND BEHIND YOUR MINIONS.\"\n\nMy boyfriend still does not let me support him with Lulu. I really am terrible with her.","replies":[]},{"poster":"Phrixscreoth","date":"2015-02-04T03:08:53.826+0000","up_votes":27,"down_votes":0,"body":"I missread Chalice's mana regen component.  I thought that \"% based on your missing mana\" meant that your mana regen was increased when no one on the enemy team could see you- ie you were \"missing\".  So when I wanted my mana to regen faster I'd go hide in a bush in my jungle.","replies":[]},{"poster":"Doom Brownies","date":"2015-02-03T22:43:56.684+0000","up_votes":25,"down_votes":0,"body":"I had no idea what the rune combiner was until it was removed.","replies":[]},{"poster":"IGotScuttleCrabs","date":"2015-02-03T22:29:18.163+0000","up_votes":25,"down_votes":0,"body":"Constantly rebought items because i was confused as to why i lost one item after buying another.\n\nBuys Zeal\n\"wtf where did that dagger thing go!?\"\nBuys another dagger\n\nAlso Using Flash/Ghost to get to lane faster\n\nAlso rushing hurricane for the triple shot\n\nAlso only buying attack speed items because i wanted to be like a machine gun.\n   Ended up being and automatic pellet gun\n\nI have plenty more too. \n\nI was and am still such a noob at this game.","replies":[]},{"poster":"Wullf","date":"2015-02-04T05:27:40.215+0000","up_votes":24,"down_votes":0,"body":"Once I joined club: \"press D to dance.\"\nI typed it a few times at the start of a game until this happend.\n\nMe: \"Press D to dance\"\nMe in my head \"well, what does D do anaway\"\nMe: *press D*\nMe: *flashed*\nMe: ...","replies":[]},{"poster":"FantasticAznDude","date":"2015-02-04T00:40:48.005+0000","up_votes":24,"down_votes":0,"body":"I don't have \"noob\" moments. When i go noob,i stay that way for the whole game {{item:3070}}","replies":[]},{"poster":"Sir ArmaMalum","date":"2015-02-04T14:51:21.420+0000","up_votes":23,"down_votes":0,"body":"Me (at level 25): \"How the hell does he have a Black Cleaver already?!?\"\n\nFriend: \"Well, he must have farmed well, how much creep do you have?\"\n\nMe: \" What the hell do minion kills have to do with how much gold you have?\"\n\nFriend: -walks over from across the dorm hallway, grabs my mouse and keyboard, last hits a minion, points at the gold count. \"Multiply that by 100 and that's how much gold you should have by now.\"\n\nMe: https://i.imgflip.com/ckt.jpg\n\ntl;dr didn't know you could additional gold outside of time spent in game and champion kills.","replies":[]},{"poster":"The Mormonator","date":"2015-02-03T23:45:50.450+0000","up_votes":23,"down_votes":0,"body":"Using the initial free RP to buy 450ip champions.","replies":[]},{"poster":"Pythagorean Thm","date":"2015-02-03T21:20:09.342+0000","up_votes":22,"down_votes":1,"body":"Hmmm where do i start.\n\nI built two pairs of boots.\n\nI started hunting machete as a laner. \n\nI played against katarina and expected to win. :^)","replies":[]},{"poster":"SNSD Tiffanyx","date":"2015-02-03T20:38:56.608+0000","up_votes":22,"down_votes":1,"body":"When I popped my ult as reneketon to fight super minions","replies":[]},{"poster":"Silven","date":"2015-02-04T08:27:16.178+0000","up_votes":20,"down_votes":0,"body":"That time I failed the flash over the wall.\nAnd the other one,\nand the one after,\nand after,\nand after...","replies":[]},{"poster":"Zirzon","date":"2015-02-03T22:51:48.524+0000","up_votes":20,"down_votes":0,"body":"Early on, I think I was playing {{champion:51}} and I was dying quite a bit... So I bought {{item:3145}} of course! Thought process: First off, she uses guns! A sword wouldn't help her at all... Secondly, the safest way to play her is to stay far back and use only q, so I want that to heal her... Right? In fact, why not build her full AP! Because all abilities scale off AP right? And her q is an ability!","replies":[]},{"poster":"RiotAntares","date":"2015-02-04T19:19:21.130+0000","up_votes":19,"down_votes":0,"body":"I would buy items based on what type of weapon that champ had.  For example when playing Ashe I would only buy items that looked like a bow and arrow.  Somebody recommended that I buy a BF sword and that made NO sense.  When I finally bought it I was even more confused because Ashe wasn't suddenly running around with a sword.  DIS MAKES NO SENSE EVEN TODAY! How does a sword help you if you aren't hitting someone with it?! ;)","replies":[]},{"poster":"Drakzul","date":"2015-02-04T00:27:36.599+0000","up_votes":19,"down_votes":0,"body":"My first game was very noob. I played Talon, I didn't know minions gave gold. So I just kept trying to kill my opponent. To my surprise I killed him once. Then he came back stronger and kept beating me. I had no idea why, because I didn't even know items existed >.> then after he killed me 3 times I decided to wander the map. I ended as a level 9 talon 50 minutes into the game with no items.","replies":[]},{"poster":"Vauren","date":"2015-02-03T21:16:53.322+0000","up_votes":8,"down_votes":0,"body":"Probably walking into of lane with two {{item:1001}} without realizing it. I wasn't even a \"noob\" when I did it. It was within the past couple months....","replies":[{"poster":"Arie","date":"2015-02-04T18:33:47.149+0000","up_votes":18,"down_votes":0,"body":"You have two feet! You need two boots for them both, right? *Right?!*","replies":[]}]},{"poster":"Toa of Death","date":"2015-02-03T20:58:31.264+0000","up_votes":19,"down_votes":1,"body":"biggest noob moment? I play Cho'Gath a lot and one time I kept trying to ult a turret when I knew full well that I couldn't do that. I just sat there for 30 sec pressing R over and over again before the turret went down. I was like \"WTF WHY DIDN'T MY ULT GO OFF? I COULD HAVE GOTTEN A STACK! oh wait that was a turret...\"","replies":[]},{"poster":"Basukaviru","date":"2015-02-04T10:42:30.608+0000","up_votes":17,"down_votes":0,"body":"Back before I knew there was a teleport back to base spell (recall), I constantly used to run back to base in order to buy items. Even if it meant making a journey across the map.","replies":[]},{"poster":"DrCyanide","date":"2015-02-03T20:49:54.034+0000","up_votes":10,"down_votes":0,"body":"{{champion:17}} . Always maxed my E first, since I thought it made the poison on my mushrooms stronger.\n\nI also had no idea what AP was, and didn't feel like following the recommended build, so I built a stat that made sense to me, Attack Speed.\n\nFortunately, those two mistakes almost canceled each other out. It wasn't until much later that someone pointed me to the Wiki so I could understand why Teemo should build AP.","replies":[{"poster":"Syn Zykan","date":"2015-02-03T21:11:26.515+0000","up_votes":12,"down_votes":1,"body":"but I play on-hit teemo...so I actually build AS items and always max E first XD\n{{item:3153}} {{item:3085}} {{item:3071}} {{item:3091}} {{item:3022}} {{item:3252}} \nShred resistances, % hp damage, near AS cap (it does cap with passive after stealth), slows, and does it to 3 targets at a time...and the poison DoT to boot. Mallet and Wits are semi-defensive choices and the lifesteal from BotRK means I can survive fights while making teamfights fun...and splitpush OP.  I love playing Teemo and don't understand why people hate him so much.","replies":[{"poster":"Eleshakai","date":"2015-02-03T21:20:37.951+0000","up_votes":12,"down_votes":4,"body":"> [{quoted}](name=Syn Zykan,realm=NA,application-id=cIfEodbz,discussion-id=ayKZl6wo,comment-id=00060000,timestamp=2015-02-03T21:11:26.515+0000)\n>\n> but I play on-hit teemo...so I actually build AS items and always max E first XD\n> {{item:3153}} {{item:3085}} {{item:3071}} {{item:3091}} {{item:3022}} {{item:3252}} \n> Shred resistances, % hp damage, near AS cap (it does cap with passive after stealth), slows, and does it to 3 targets at a time...and the poison DoT to boot. Mallet and Wits are semi-defensive choices and the lifesteal from BotRK means I can survive fights while making teamfights fun...and splitpush OP.  I love playing Teemo and don't understand why people hate him so much.\n\nPeople hate teemo because when a teemo is in the game, the only one of the ten players who has any fun is the teemo player. All 9 other players have a boring game.","replies":[{"poster":"Sneak Dog","date":"2015-02-03T23:24:47.810+0000","up_votes":18,"down_votes":1,"body":"What? No! Killing the Teemo is the best feeling ever. Better if you're Teemos ally.","replies":[]}]}]}]},{"poster":"Riot Catzpaw","date":"2015-02-05T00:29:22.041+0000","up_votes":16,"down_votes":0,"body":"The first (and second...and third... probably fourth) time I played Pantheon {{champion:80}}, I had no idea his ult had a range beyond 'self.' I would literally only cast it on top of myself every single time. Oddly enough, I had the same issue with Leona {{champion:89}} and her ult as well. Maybe it was a Mount Targon thing. -_-","replies":[]},{"poster":"Randomnewguy","date":"2015-02-03T23:42:50.501+0000","up_votes":15,"down_votes":0,"body":"I think I was level 15 before I realized I wasn't playing \"bots\" in bot lane. *shakes head*","replies":[]},{"poster":"Cure Dreamless","date":"2015-02-03T23:37:21.899+0000","up_votes":13,"down_votes":0,"body":"When I first started playing, I played the tutorial and didn't read it properly and I thought the game was BS for not letting me move. Then I realized that you needed to right-click to move ._.\n\nI also used to think that Deathcaps stacked so I built 6 of them on Ashe because...damage...lol","replies":[]},{"poster":"Chaotic Reks","date":"2015-02-04T17:58:28.438+0000","up_votes":12,"down_votes":0,"body":"{{champion:53}}--------C{{champion:9}}\n\n{{champion:9}} *PENTAKILL*","replies":[]},{"poster":"Orbv","date":"2015-02-03T20:58:09.069+0000","up_votes":11,"down_votes":0,"body":"I thought the difference between passives and actives was that you needed to be in a fight actively trading to use it. I used to run back and auto with mages just to activate Zhonya's.","replies":[]},{"poster":"The Whamboozler","date":"2015-02-05T16:26:26.151+0000","up_votes":12,"down_votes":1,"body":"Everyone... EVERYONE... at some point when they were new.... tried to smite an enemy champion.\n\n\"Why would I EVER take ignite? This does so much more damage and it's instant!\"","replies":[]}]}