{"poster":"Hamrio","date":"2015-07-15T18:47:57.638+0000","title":"wie man flame in spielen  verringert","subforum":"Allgemeiner Chat","up_votes":1,"down_votes":3,"body":"vorwort:das ist zwar etwas lang aber bitte  lest es euch durch und gebt feedback)\r\nHeya, In diesem Post werde ich euch einige tips geben wie man den flame in  league spielen einfach reduzieren kann,Nat&uuml;rlich sind manche Menschen versteift ,ersnst und wollen einfach nur gewinnen, bei der kategorie kann man meist nichts machen aber hier mal ein paar tips:\r\n\r\nSchriebe nicht in die champ select sowas wie&quot;let me mid and i carry&quot; sowas haben alle schonmal geh&ouml;rt und das war dann das gegenteil. sagt die wahrheit ,ihr versucht euer bestes aber k&ouml;nnt nichts garantieren.\r\nWenn ihr ingame seit fangt das spiel mit einen witz and , am besten flach und &uuml;ber LoL in etwa:\r\nbest league joke? Lets play Zed/ ryze is balanced\r\n\r\nWenn euch jemand flamt wie &quot;noob feeder die by cancer&quot; sagt einfach ok. meist h&ouml;ren sie auf weil sie euch eigentlich nur provozieren wollen damit ihr sie beleidigt und sie auch eine report reason haben.\r\nfalls ihr kurzzeitig oder &uuml;ber l&auml;ngere zeit afk gehen m&uuml;sst sagt nicht einfach &quot;afk&quot; sagt ,dass es euch leid tut und wenn irh auf klo m&uuml;sst schreibt sowas wie &quot;toilet needs me&quot;. Auch gut ist es sich mit den gegner zu unterhalten solange es dich oder dein team nicht am normal spielen behindert schreibt dann jedes mal wenn ihr sterbt durch einen gegner etwas wie &quot;100% balanced xD&quot; glaubt mir,wenn ihr jemanden dann killt werden sie das auch schreiben und mit humor nehmen\r\np.s: bitte lasst feedback da und sagt ob es bei euch geklappt hat","replies":[{"poster":"LightsEUW","date":"2015-07-17T12:14:10.076+0000","up_votes":1,"down_votes":0,"body":"**Dein Bester Freund... DER MUTE-KNOPF** :D","replies":[]},{"poster":"LuckingFegendary","date":"2015-07-16T22:06:58.372+0000","up_votes":1,"down_votes":0,"body":"Ich persönlcih reagiere extremst darauf wenn mich jemand flamt, weshalb ich mir den Ingame-Chat mehr oder weniger deaktiviert habe, ich kann zwar nióch schreiben, sehe aber gar nichts mehr.  So kann ich meinem Team immer noch Dinge wie \"vlad tp 17:20 my tp 16:40\" oder so mitteilen.\nUnd dadurch bin ich auch gezwungen mehr auf die Map zu achten, was sicher nicht schadet.\n\nAn alle, die wissen wollen wie man den Chat deaktiviert:\n\nC:\\Riot Games\\League of Legends\\Config\nNun die Datei \"Game\" mittels Editor öffnen und über Strg+F chat suchen, dann bei ChatScale=0 das 0 durch  -100, obwohl auch anderer Datenmüll, also alles außerhalb von 0-100, funktionieren müsste, ersetzen.\n\nIngame könnt ihr den Chat nun jederzeit wieder normal skalieren, doch um ihn zu \"entfernen\", müsst ihr wieder die entsprechende Datei öffnen und ändern.","replies":[]},{"poster":"Infinity7","date":"2015-07-16T17:03:08.216+0000","up_votes":1,"down_votes":0,"body":"alle, die anfangen zu flamen, muten und fertig is","replies":[]},{"poster":"Madchickendinner","date":"2015-07-15T21:13:19.123+0000","up_votes":1,"down_votes":0,"body":"Also ich schreib meist garnix dann kann man niemals bestraft werden.","replies":[]},{"poster":"BetterNerfMyMain","date":"2015-07-15T18:51:42.274+0000","up_votes":1,"down_votes":0,"body":"Mach ich auch so, aber eigentlich hast du zum Grossteil nur Tipps gegeben, wie man sich mit Non-Flamern unterhält und DIESE dann motiviert / mit denen Spass hat.","replies":[{"poster":"Hamrio","date":"2015-07-15T19:00:54.044+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=BetterNerfMyMain,realm=EUW,application-id=YnZkMR0R,discussion-id=2qvRqaqm,comment-id=0000,timestamp=2015-07-15T18:51:42.274+0000)\n>\n> Mach ich auch so, aber eigentlich hast du zum Grossteil nur Tipps gegeben, wie man sich mit Non-Flamern unterhält und DIESE dann motiviert / mit denen Spass hat.\n\nes gibt ja viele die einfach nur flamer in bestimmten games sind wenn grad im Rl nichts is wie es soll oder so  die auf dem grad zwischen flamer und freundlicher spieler stehen und diese kann man dann eben von der dunkelen seite der macht wegholen","replies":[{"poster":"BetterNerfMyMain","date":"2015-07-15T19:07:44.861+0000","up_votes":1,"down_votes":0,"body":"Eben gesehn, dass du das auch mit rein geschrieben hast ^^","replies":[]}]}]},{"poster":"Madchickendinner","date":"2015-07-15T18:55:11.437+0000","up_votes":1,"down_votes":1,"body":"Einfach garnix schreiben. Wenn ich mal kurz afk gehen muss schreib ich einfach \" sry 1 min afk\".\n\nAnsonsten find ich sowas wie\n\n> 100% balanced xD\n\neinfach nur unnötig. schlimmstenfalls fängt jemand an zu flamen. Unbewusst provozierst man somit nur die Leute.","replies":[{"poster":"Bluefersan","date":"2015-07-15T20:15:53.285+0000","up_votes":1,"down_votes":1,"body":"100% balanced find ich auch unnötig. mehrer werden dich dann ansprechen und dir sagen das dein champ auch nicht balanced ist und danach kann es sein das du bei jedem kill was hörst , oder bei jedem death. schlimmsten fall werden deine team mates dir sagen das es nicht am champ liegt , sondern an dir.","replies":[]}]},{"poster":"Kaito","date":"2015-07-15T20:07:06.362+0000","up_votes":1,"down_votes":1,"body":"Ich kann noch bessere Tipps geben:\n\n- Wenn du nichts Gutes zu sagen hast, sag am besten garnichts\n- Wenn wer anfängt zu flamen, mutest du ihn","replies":[]}]}