{"poster":"Hamrio","date":"2015-09-30T19:00:29.411+0000","title":"Die gerechtigkeit ist zurück!","subforum":"Spielerverhalten & Moderation","up_votes":16,"down_votes":7,"body":"Ich bedanke mich hiermit herzlich bei riot ,dass sie einen scripter gebannt haben den ich vor einigen wochen meldete. \r\nEin ehemaliger freund von mir hat vor ein paar wochen angefangen zu scripten Ich habe ihm gesagt  ,dass es mich nichts angeht aber wenn er anf&auml;ngt in unserem anked team zu scripten dann werde ich ihn irgendwann melden. als er dann immer &uuml;berheblich wurde und als er anfing einen gott komplex zu entwickel drohte ich ihm ein letztes mal an mit den scripts aufzuh&ouml;ren . alsd er mich daraufhin beleidigt and sagte ich sei doch einfach nur kot in diesem spiel schrieb  ich den riot support an mit einer Ts aufnahmen und meldete ihn. ich bin so dankbar dass ihr ihn endlich gebannt habt &lt;3","replies":[{"poster":"Fávorité","date":"2015-10-01T11:30:49.233+0000","up_votes":4,"down_votes":35,"body":"Was du für ein Geier bist, dass du deine eigene Freunde reportest du spielst auf Bronze Elo, wen juckts ob da jemand scripte benutzt oder nicht, \n\nmeine güte fahr in Harz alter","replies":[{"poster":"Der Großmugister","date":"2015-10-01T12:50:04.333+0000","up_votes":17,"down_votes":0,"body":"Worte eines Perma-gebannten.","replies":[{"poster":"i3IackCat","date":"2015-10-17T02:01:21.825+0000","up_votes":1,"down_votes":1,"body":"Woher weißt du,das er der Permgebannte ist?","replies":[{"poster":"Sirrkas","date":"2015-10-17T08:32:35.152+0000","up_votes":1,"down_votes":0,"body":"Liegt an dem Thread, den Favorite erstellt hat.","replies":[]}]}]},{"poster":"PwnedAkkon ","date":"2015-10-01T19:01:24.885+0000","up_votes":1,"down_votes":16,"body":"> [{quoted}](name=Fávorité,realm=EUW,application-id=KYnfKGf0,discussion-id=pxEBLyTu,comment-id=0004,timestamp=2015-10-01T11:30:49.233+0000)\n>\n> Was du für ein Geier bist, dass du deine eigene Freunde reportest du spielst auf Bronze Elo, wen juckts ob da jemand scripte benutzt oder nicht, \n> \n> meine güte fahr in Harz alter\n\nwaited for this ... nicht demotivieren lassen wenn den ganzen dislikes endlich mal einer der die Warheit ausspricht.","replies":[{"poster":"Der Großmugister","date":"2015-10-01T19:11:37.972+0000","up_votes":5,"down_votes":2,"body":"Das ist jetzt nur meine persönliche Meinung, aber ich habe nur Freunde, die meine moralische Einstellung teilen.\nWenn Jemand, den ich einen Freund nenen würde, moralisch verwerflich (in meinen Augen) handeln würde und auch noch stolz darauf wäre, würde ich, zumindest in der Theorie, da Dergleichen bisher Gott sei Dank nie passiert ist, danach nichtmehr als Freund ansehen.\n\nJeder macht mal Fehler und ich hab auch schon Dinge gemacht, für die ich mich im Nachhinein geschämt habe, aber wenn eben dieser Schritt ausbleibt und sich Jemand sogar mit etwas brüstet was gegen meine moralischen Grundsätze verstößt, glaube ich nicht, dass ich mit diesem Jemand befreundet sein kann.\n\nDie Schachtelsätze tuen mir sehr Leid, aber irgendwie hat es sich so ergeben und auf die schnelle konnte ich sie nicht entwirren, ohne es noch unansehnlicher zu gestalten.","replies":[{"poster":"PwnedAkkon ","date":"2015-10-01T19:54:27.788+0000","up_votes":1,"down_votes":8,"body":"> [{quoted}](name=Mugiwara n Luffy,realm=EUW,application-id=KYnfKGf0,discussion-id=pxEBLyTu,comment-id=000400010000,timestamp=2015-10-01T19:11:37.972+0000)\n>\n> Das ist jetzt nur meine persönliche Meinung, aber ich habe nur Freunde, die meine moralische Einstellung teilen.\n> Wenn Jemand, den ich einen Freund nenen würde, moralisch verwerflich (in meinen Augen) handeln würde und auch noch stolz darauf wäre, würde ich, zumindest in der Theorie, da Dergleichen bisher Gott sei Dank nie passiert ist, danach nichtmehr als Freund ansehen.\n> \n> Jeder macht mal Fehler und ich hab auch schon Dinge gemacht, für die ich mich im Nachhinein geschämt habe, aber wenn eben dieser Schritt ausbleibt und sich Jemand sogar mit etwas brüstet was gegen meine moralischen Grundsätze verstößt, glaube ich nicht, dass ich mit diesem Jemand befreundet sein kann.\n> \n> Die Schachtelsätze tuen mir sehr Leid, aber irgendwie hat es sich so ergeben und auf die schnelle konnte ich sie nicht entwirren, ohne es noch unansehnlicher zu gestalten.\n\nDu redest von moralischen Grundsätzen. Wenn du davon eine Ahnung hast weißt du doch sicher, dass diese moralischen Grundsätze von Erziehung, Religion, Umfeld, Erlebnissen usw abhängen. Daraus und das du nur \"Freunde\" hast, die deine moralischen Grundsätze teilen schließe ich, dass du nur sehr wenig Toleranz in diesem Bereich zeigst. Das Bedeutet, du verurteilst Menschen aufgrund Ihrer Erziehung oder ihres Umfeldes. Naja den Rest kann sich ja jeder selbst Denken.\nMfG\nDago","replies":[{"poster":"Der Großmugister","date":"2015-10-01T20:01:02.700+0000","up_votes":7,"down_votes":1,"body":"Netter Versuch, aber erkläre mir mal bitte an was man einen Menschen messen kann, wenn nicht an seinen moralischen Grundsätzen?\nNatürlich resultieren diese Grundsätze, unter Anderem aus einem Zusammenspiel aus Umfeld und Erziehung, dein Umkehrschluss ist aber schlicht plump...\nIch veranschauliche das mit einem Beispiel, nach deiner Logik wäre Folgendes der Fall:\n\nPerson X sagt, dass sie Zwangsbeschneidung von Mädchen verurteilt, die Zwangsbeschneidung ist ein Teil der Kultur mancher afrikanischer Stämme, Person X verurteilt also alle Afrikaner auf Grund ihrer Herkunft.\n\nFalls du dieses Beispiel zutreffend findest, und nur dann, kann deine Aussage valide sein.","replies":[]}]}]}]}]},{"poster":"SwissKeks","date":"2015-09-30T21:05:13.606+0000","up_votes":3,"down_votes":2,"body":"Ts aufnahmen werden nicht gewertet","replies":[{"poster":"FailerOfWorld","date":"2015-09-30T21:12:13.014+0000","up_votes":2,"down_votes":2,"body":"Theoretisch nicht. Aber wenn ein TS-Gespräch irgendwelche Indizien bestätigt wird das wahrscheinlich durchaus zur entscheidungsfindung dezugezählt.","replies":[{"poster":"SwissKeks","date":"2015-09-30T21:12:57.079+0000","up_votes":5,"down_votes":1,"body":"> [{quoted}](name=FailerOfWorld,realm=EUW,application-id=KYnfKGf0,discussion-id=pxEBLyTu,comment-id=00010000,timestamp=2015-09-30T21:12:13.014+0000)\n>\n> Theoretisch nicht. Aber wenn ein TS-Gespräch irgendwelche Indizien bestätigt wird das wahrscheinlich durchaus zur entscheidungsfindung dezugezählt.\n\nNein, sowas kann man extrem einfach faken.","replies":[{"poster":"eingew","date":"2015-10-01T09:49:29.715+0000","up_votes":3,"down_votes":0,"body":"Aber eine TS Aufnahme kann durchaus ausschlaggebend sein, um einen Account zu überprüfen. Davon würde ich zumindest ausgehen.","replies":[{"poster":"SwissKeks","date":"2015-10-01T12:42:47.873+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=eingew,realm=EUW,application-id=KYnfKGf0,discussion-id=pxEBLyTu,comment-id=0001000000000001,timestamp=2015-10-01T09:49:29.715+0000)\n>\n> Aber eine TS Aufnahme kann durchaus ausschlaggebend sein, um einen Account zu überprüfen. Davon würde ich zumindest ausgehen.\n\nEine Ts-Aufnahme kann ich innert 2 Minuten erstellen mit einem Kollegen. Das ist nun wirklich nicht schwer.","replies":[{"poster":"eingew","date":"2015-10-01T12:44:35.344+0000","up_votes":2,"down_votes":0,"body":"Ja, und dann setzt Riot den gemeldeten Spieler auf die Liste, er wird überprüft und dann wird entschieden, ob er etwas falsch gemacht hat.","replies":[]}]}]},{"poster":"Masterba1t","date":"2015-09-30T22:32:42.308+0000","up_votes":1,"down_votes":0,"body":"sehe ich genauso. es ist sehr sehr schwer zu beweisen, dass im TS person X der LoL-acc Y überhaupt gehört. deshalb \"dürfen\" solche vermentlichen beweise nicht berücksichtigt werden. würde riot das doch machen, wäre das mega unprofessionell","replies":[{"poster":"Jack Doomsday","date":"2015-10-02T10:28:55.381+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Masterba1t,realm=EUW,application-id=KYnfKGf0,discussion-id=pxEBLyTu,comment-id=0001000000000000,timestamp=2015-09-30T22:32:42.308+0000)\n>\n> sehe ich genauso. es ist sehr sehr schwer zu beweisen, dass im TS person X der LoL-acc Y überhaupt gehört. deshalb \"dürfen\" solche vermentlichen beweise nicht berücksichtigt werden. würde riot das doch machen, wäre das mega unprofessionell\n\nWarum denn? Der Spieler wird wie gesagt doch nur auf 'die Liste' gesetzt. Wenn es gefälscht ist, wird er nach dem Prüfen in Ruhe gelassen. Wenn er doch entlarvt wird, dann wird er eben gebannt. Win-Win Situation. Wenn jemand nichts zu verbergen hat, dann sollte ihm die Überprüfung auch nicht weh tun.","replies":[]}]}]}]}]},{"poster":"Only a Kat","date":"2015-10-03T15:49:37.208+0000","up_votes":1,"down_votes":1,"body":"Ich frage mich ein wenig, in welchem Film einige Leben, aber Teamspeak-Aufnahmen hätten nichtmal vor Gericht eine Beweiskraft, selbst wenn ein professioneller Geheimdienst eine Stimmübereinstimmung bestätigen würde, da rechtlich Telefongespräche usw nicht als Beweis gelten, wegen der Manipulierbarkeit usw. Ich kann mit einem simplen Progamm ohne Probleme aussagen so zusammen schneiden, dass aus einem \"ich scripte bestimmt nicht\" ein \"ich scripte\" wird und auch sonst kann man Aussagen beliebig zusammenschneiden... dies geht bereits mit kostenloser Software ohne Probleme.\n\nDa ich aber nicht glaube, dass Riot über Original-Stimmproben der Accountbesitzer verfügt, noch über allzu umfangreiche Kontakte zur NSA... außer es geht um die Terrorismusbekämpfung... und ich wage zu bezweifeln, dass die NSA an der Aufdeckung von Gold-5-Scriptern die sich via Teamspeak verraten interessiert ist... hoffe ich, dass wir dieses Thema nun endgültig geklärt haben und die fantasiereichen Erfinder der \"Riot prüft Teamspeak\"-Theorie es nun selbst merken... :)\n\nKommen wir zum Thema \"Denuntziant\":\n\nFür meine Begriffe ist das denuntzieren eines Freundes in aller Regel ein \"no go\". Es gibt aber Ausnahmen: wird er beleidigend, wie anscheinend in diesem Fall, würde ich den Status \"Freund\" auch überdenken und diesen vermutlich auf \"Feind\" ändern. Von daher kann ich den TE durchaus verstehen.\n\nEine weitere Ausnahme stellt eine schwere Straftat dar oder eine Handlung, bei der andere zu erheblichen Schaden kommen (können). Wobei ich es immer erst noch einmal im \"guten\" probieren würde. Ausserdem ist gehört es sich nicht, hinterrücks jemanden anzuschwärzen. Dies kündigt man bei einem \"Freund\" schon an, sonst ist es ein assoziales Verhalten, aus meiner Sicht. Sprich, nehmen wir an ein Freund von uns ist Alkoholiker und wir bekommen mit, dass er  besoffen auf der Arbeit rumläuft und seinen Job nicht richtig macht. Es wäre ziemlich asozial, diesen einfach anzuschwärzen (immerhin reden wir von einem Freund, richtig?) ohne ihn vorher persönlich angemahnt zu haben. Wenn man ihn vorher drauf anspricht und sagt: \"unterlass das und wenn du das nochmal machst und ich bekomme das mit, sehe ich keine Möglichkeit als dich zu melden\", wäre die Sache schon wesentlich ehrlicher und anschließend auch kein hinterhältiges Verhalten mehr, denn man hat ihn entsprechend vorgewarnt. Sollte derjenige andere in Gefahr bringen, z. B. weil er ein Fahrer ist, muss man es wohl oder übel sofort unterbinden... So sehe ich das jedenfalls.","replies":[{"poster":"Der Großmugister","date":"2015-10-03T16:12:16.745+0000","up_votes":1,"down_votes":0,"body":"Du lässt hierbei die wichtige Tatsache außer Acht, dass das TS-Gespräch und die anderen Verweise des TEs nicht die Beweismittel, sondern die Anzeige waren, um im Strafrechtlichen Bereich zu bleiben.\n\nRiot hat die Möglichkeit, die Existenz fremder Identitäten in der LoL-Software auf deinem PC fest zu stellen (dem muss man in den AGBs zustimmen).\nWenn also ernst zu nehmende Hinweise eingehen, wird Riot diese Überprüfung starten und dann auf Grundlage der Ergebnisse, dieser Untersuchung, weitere Schritte einleiten.\nEs ist also Wurst ob die Aufnahme am Ende gefälscht war und die NSA wird nicht benötigt. ;)","replies":[{"poster":"Only a Kat","date":"2015-10-03T16:18:19.490+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Mugiwara n Luffy,realm=EUW,application-id=KYnfKGf0,discussion-id=pxEBLyTu,comment-id=000d0000,timestamp=2015-10-03T16:12:16.745+0000)\n>\n> Du lässt hierbei die wichtige Tatsache außer Acht, dass das TS-Gespräch und die anderen Verweise des TEs nicht die Beweismittel, sondern die Anzeige waren, um im Strafrechtlichen Bereich zu bleiben.\n> \n> Riot hat die Möglichkeit, die Existenz fremder Identitäten in der LoL-Software auf deinem PC fest zu stellen (dem muss man in den AGBs zustimmen).\n> Wenn also ernst zu nehmende Hinweise eingehen, wird Riot diese Überprüfung starten und dann auf Grundlage der Ergebnisse, dieser Untersuchung, weitere Schritte einleiten.\n> Es ist also Wurst ob die Aufnahme am Ende gefälscht war und die NSA wird nicht benötigt. ;)\n\nUnd du glaubst allen Ernstes, dass Riot sich ein TS Gespräch anhört? Klar, die haben nichts anderes zu tun bei 75 Millionen Spielern. ^^\n\nIch merke schon, viele hier haben noch nie bei einer größeren Firma gearbeitet....\n\nKleiner Hinweis: Mitarbeiter verursachen Lohnkosten und Lohnnebenkosten. Alles in allem sind innerhalb der EU Lohnkosten von 25-30 Euro der Standard pro Stunde. Hierbei ist zu beachten, dass die Kosten wesentlich höher sind, als der Bruttolohn. Ich habe schon für diverse bekannte Großkonzerne gearbeitet und bin mir sicher, dass kein Konzern sich die Mühe machen würde, einen Sachbearbeiter für einen TS Mitschnitt abzustellen. Dazu würde man gegen Datenschutz verstoßen und gegen die Persönlichkeitsrechte, da vor einem Mitschnitt die Person um \nErlaubnis gefragt werden muss, sonst hat die Firma ein ganz anderes Problem!!! So inkorrekt arbeitet keine auch nur halbwegs seriöse Firma!","replies":[{"poster":"Der Großmugister","date":"2015-10-03T16:26:54.074+0000","up_votes":1,"down_votes":0,"body":"Genau das meine ich doch, es ist vollkommen Wurst ob sie es sich angehört haben oder nicht! Versteh Das doch bitte :D\n\nWenn der Support-Mitarbeiter, aus welchem Grund auch immer denkt, dass der Verdacht berechtigt ist, wird kurzerhand die, höchst wahrscheinlich voll automatische Überprüfung eingeleitet.\nUnd da Supportmitarbeiter nunmal auch nur Menschen sind, werden sie, je mehr Mühe sich der Jenige gibt, der sie anschreibt, eher geneigt sein, ihm zu glauben.\nVielleicht hat er sich den Mitschnitt angehört, vielleicht hat aber die Tatsache gereicht, dass eine Datei mitgeschickt wurde.\n\nUnd das wäre vollkommen okay, weil der BEWEIS dann eben durch die ÜBERPRÜFUNG erfolgen würde, es wäre also auch egal, ob der TS-Mitschnitt nur 2min Rauschen gewesen wäre.\n\nUm das zu verstehen braucht man nicht in einer großen Firma gearbeitet haben, da reicht gesunder Menschenverstand. ;)","replies":[{"poster":"Only a Kat","date":"2015-10-03T16:35:48.461+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Mugiwara n Luffy,realm=EUW,application-id=KYnfKGf0,discussion-id=pxEBLyTu,comment-id=000d000000000000,timestamp=2015-10-03T16:26:54.074+0000)\n>\n> Genau das meine ich doch, es ist vollkommen Wurst ob sie es sich angehört haben oder nicht! Versteh Das doch bitte :D\n> \n\nHaben sie sicher auch nicht, weil wenn sie es täten und jemand würde sich verplappern, würde die Firma eine Klage riskieren und vermutlich keine Sonne mehr sehen. :)\n\n\n> Wenn der Support-Mitarbeiter, aus welchem Grund auch immer denkt, dass der Verdacht berechtigt ist, wird kurzerhand die, höchst wahrscheinlich voll automatische Überprüfung eingeleitet.\n> Und da Supportmitarbeiter nunmal auch nur Menschen sind, werden sie, je mehr Mühe sich der Jenige gibt, der sie anschreibt, eher geneigt sein, ihm zu glauben.\n> Vielleicht hat er sich den Mitschnitt angehört, vielleicht hat aber die Tatsache gereicht, dass eine Datei mitgeschickt wurde.\n> \n> Und das wäre vollkommen okay, weil der BEWEIS dann eben durch die ÜBERPRÜFUNG erfolgen würde, es wäre also auch egal, ob der TS-Mitschnitt nur 2min Rauschen gewesen wäre.\n> \n> Um das zu verstehen braucht man nicht in einer großen Firma gearbeitet haben, da reicht gesunder Menschenverstand. ;)\n\nNochmal: WENN sie sich das anhören, riskieren sie nicht nur eine Anzeige wenn es auffliegt, sondern auch noch, sich einen Virus einzufangen?! \n\nHast DU schon einmal in einer Firma gearbeitet, die allen ernstes irgendwelche mp3 Dateien öffnet mit Gesprächsinhalten irgendwelcher Personen?? \n\nIn jeder Firma wird man normalerweise auf Datenschutz und Internetsicherheit geschult, bevor man überhaupt an die Tastatur gelassen wird... \n\nVon daher bleibt nichts übrig, als dass irgendjemand (nicht überprüfbar) irgend etwas (ebenfalls nicht überprüfbar) BEHAUPTET. Und behauptet wird vieles. Die Geschichte ist für Riot somit genausowenig aussagekräftig wie die Geschichten über die \"Illuminati\"...\n\nDas - und nichts anderes - kommt bei Riot an. Das EINZIGE was Riot prüfen kann, sind die Chatlogs. Darauf haben sie berechtigterweise Zugriff, da es die EIGENEN Informationsplattformen sind. Klingt einleuchtend, oder? Gesunder Menschenverstand und so. :)\n\n> [{quoted}](name=Mugiwara n Luffy,realm=EUW,application-id=KYnfKGf0,discussion-id=pxEBLyTu,comment-id=000d0000000000000000,timestamp=2015-10-03T16:34:22.155+0000)\n>\n> Ich hab beim erneuten Lesen gemerkt, dass mein Beitrag doch recht passiv-aggressiv rüberkommt, das war nicht meine Intention und ich möchte mich dafür entschuldigen.\n\nNee, passt schon. Du hast deinen Standpunkt - ist ja bei freier Meinungsäußerung legitim. \n\n","replies":[{"poster":"Der Großmugister","date":"2015-10-03T16:42:25.500+0000","up_votes":1,"down_votes":0,"body":"Tut mir Leid, ich sehe in keinster Weise, wie das Dem was ich dir erklärt habe widersprechen soll.\n\nRiot bekommt einen Verdacht geliefert und überprüft Diesen dann, ich habe jetzt oft genug versucht dir zu erklären, dass die Mp3-Datei, dabei überhaupt keinen Einfluss hat, sondern nur die Tatsache, dass der Verfasser der Beschwerde, anscheinend sehr überzeugt ist von dem was er behauptet.\n\nDass du den TE so durch den Kakao gezogen hast, war also schlicht unnötig und unberechtigt.\n\nMich beschleicht der Verdacht, dass du meine Beiträgte nur überfliegst und ihren Inhalt nicht wahrnimmst.\n","replies":[{"poster":"Only a Kat","date":"2015-10-03T16:48:19.733+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Mugiwara n Luffy,realm=EUW,application-id=KYnfKGf0,discussion-id=pxEBLyTu,comment-id=000d00000000000000010000,timestamp=2015-10-03T16:42:25.500+0000)\n>\n> Tut mir Leid, ich sehe in keinster Weise, wie das Dem was ich dir erklärt habe widersprechen soll.\n> \n> Riot bekommt einen Verdacht geliefert und überprüft Diesen dann, ich habe jetzt oft genug versucht dir zu erklären, dass die Mp3-Datei, dabei überhaupt keinen Einfluss hat, sondern nur die Tatsache, dass der Verfasser der Beschwerde, anscheinend sehr überzeugt ist von dem was er behauptet.\n\nUnd ich habe oft genug versucht zu erklären, dass irgend ein wilder Verdacht, den irgend ein \"Heiopei\" verschickt keinerlei Aussagekraft hat! \n\nIch kann Riot auch anschreiben und behaupten, DU würdest scripten und ich hätte einen TS Mitschnitt (ein Gespräch, welches ich mit mir selbst geführt habe und dabei meine Stimme verstellt habe)! \n\nWas meinst du, wie viele Spinner jeden Tag irgendwas wildes behaupten? Bei 75 Millionen Accounts? Da gibt es geschätzt mindestens eine millionen, die irgendwelche Halluzinantionen haben.... Schau dir alleine an, wie viele bei irgendwelchen Pegida mitrennen! Was meinst du was passiert, wenn SO einer bei Riot anruft? Da kommt dann sowas bei raus: \"Ich kenne einen der scriptet, der ist nebenher auch noch ein Flüchtling!\" \n\nDer nächste, der irgendwas behauptet erfindet auch regelmäßig Geschichten über die Illuminati. Sicher geht Riot da jedem Hinweis nach... (Ironie)\n\n Wie kam es wohl zu Hexenverbrennungen? \"Die Nachbarin ist eine Hexe, sie fliegt mit einem Besen durch die Nacht! Ich habe einen TS Mitschnitt wo sie das zugibt!!!\"\n\nHat sicher eine große Aussagekraft, wenn IRGENDEINER auf diesem Planeten IRGENDWAS WILDES behauptet! Die Aussagekraft beträgt genau null-komma-null und die folgende \"Überprüfung\" ist dementsprechend ebensowenig vorhanden... \n\nAnders verhält es sich sicherlich, wenn ein Spieler in einem offiziellen Riot Chat so etwas verlauten lässt. Dann hat Riot berechtigterweise etwas in der Hand, aber das steht auf einem anderen Blatt. Und vermutlich sind nur wenige so unvorsichtig. \n\n","replies":[{"poster":"Der Großmugister","date":"2015-10-03T16:56:06.475+0000","up_votes":1,"down_votes":0,"body":"Weil diese, wahrscheinlich voll automatische Überprüfung so viel Zeit/Geld kosten würde meinst du?\nDie Software dazu ist bereits auf jedem System parat, es kostet also nur ein lächerlich geringes Maß an Rechenleistung, es zu nutzen.\n\nRiot hat also, ganz im Gegensatz zu dem was du behauptest, keinen Grund dem Verdacht NICHT nachzugehen.\nIch gehe davon aus, dass eine Überprüfung stattfinden würde, solltest du mich so wie du es beschrieben hast anschwärzen, sie würde nur eben Ergebnisslos bleiben.\n\nBedenke bitte, dass wir alle die nötige Software schon runterladen mussten, wir haben sie schon auf dem Rechner und Ihrer Benutzung haben wir schon zugestimmt.\nVielleicht sammelt Riot die Daten sogar standartmäßig und sie werden nur auf Verdacht eingesehen.\n\nErkläre mir jetzt bitte, wieso es sich für Riot nicht lohnen sollte, einer Meldung nach zu gehen!","replies":[{"poster":"Only a Kat","date":"2015-10-03T17:05:03.416+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Mugiwara n Luffy,realm=EUW,application-id=KYnfKGf0,discussion-id=pxEBLyTu,comment-id=000d0000000000000001000000000000,timestamp=2015-10-03T16:56:06.475+0000)\n>\n> Weil diese, wahrscheinlich voll automatische Überprüfung so viel Zeit/Geld kosten würde meinst du?\n> Die Software dazu ist bereits auf jedem System parat, es kostet also nur ein lächerlich geringes Maß an Rechenleistung, es zu nutzen.\n> \n> Riot hat also, ganz im Gegensatz zu dem was du behauptest, keinen Grund dem Verdacht NICHT nachzugehen.\n> Ich gehe davon aus, dass eine Überprüfung stattfinden würde, solltest du mich so wie du es beschrieben hast anschwärzen, sie würde nur eben Ergebnisslos bleiben.\n> \n> Bedenke bitte, dass wir alle die nötige Software schon runterladen mussten, wir haben sie schon auf dem Rechner und Ihrer Benutzung haben wir schon zugestimmt.\n> Vielleicht sammelt Riot die Daten sogar standartmäßig und sie werden nur auf Verdacht eingesehen.\n> \n> Erkläre mir jetzt bitte, wieso es sich für Riot nicht lohnen sollte, einer Meldung nach zu gehen!\n\nHi! \n\nDiese \"voll automatische Überprüfung\" findet bei jedem Spiel statt, von JEDEM Spieler. Die muss keiner extra anschmeißen. :) \n\nOb also jemand etwas bei Riot meldet oder nicht (Aliens, Scripter, Illuminati und Drophacker), spielt hierbei KEINE Rolle. :)\n\nDummerweise findet dieses System nicht jeden Cheat, offensichtlich sogar nur sehr selten, denn das bekannte Scripter-Forum ist immer noch mit 100.000+ Mitgliedern vertreten, die sich rege über ihre Scripts unterhalten und selten darüber, dass mal einer gebannt wurde. \n\nIch werde dir jetzt nicht den Link zu der berühmt berüchtigten Seite nennen, aber wenn du nach lol scripts googelst, findest du diese in voraussichtlich weniger als einer halben Sekunde, wenn du ein geübter Internetuser bist. Natürlich ist es schade, dass es so ist.... Aber ich bin lieber Realist als mein Wissen auf Wunschgebilden aufzubauen...\n\nEdit: ich muss mich korrigieren - bin wohl nicht auf dem neuesten Stand. Habe mit erschrecken festgestellt: \"427163 Total Members\".... also... die Gerechtigkeit ist noch weit entfernt davon, zurück zu sein (falls es sie je gab)..","replies":[{"poster":"Der Großmugister","date":"2015-10-03T17:17:23.706+0000","up_votes":2,"down_votes":0,"body":"Ohne den Thread hier, hätte ich dir das ungesehen geglaubt, aber die Tatsache, dass genau der vom TE gemeldete Spieler, kurze Zeit nach dem Report, aufgeflogen ist, wäre doch ein lächerlich unwahrscheinlicher Zufall oder?\n\nHätte der Report des TE keinerlei Effekt gehabt, hätte das automatische System ja rein zufällig genau diesen einen Spieler unter den 100.000+ die du erwähnst, genau zu dieser Zeit finden müssen.\nDas klingt sehr unwahrscheinlich für mich.\n\nIch gehe davon aus, dass die automatische Auswertung, in festgelegten Intervallen, die seit den letzten Banns gesammelten Daten nutzt um in Wellen zu bestrafen. Das macht es den Script-Erstellern nicht so einfach das System zu umgehen.\nGeht nun aber eine Meldung ein, werden die schon erhobenen Daten, von genau diesem Spieler, außerhalb der Wellen bestraft. Einzelne Fälle werden von der Scripter Community nicht so wahrgenommen werden, Riot gibt aber seinem Kunden (dem Spieler der meldete), das berechtigte Gefühl, dass man ihn ernst nimmt und Spieler bestraft die sich nicht an die Regeln halten. Im besten Fall, propagiert dieser Spieler das dann noch, wie in diesem Post geschehen.\nDer Gewinn an positivem image, dürfte Das durchaus wert sein.\nDas muss jetzt nicht zwingend genau so laufen, aber irgendwas muss es ja geben, wenn man nicht an den von mir beschriebenen, gewaltigen Zufall glaubt.","replies":[{"poster":"Only a Kat","date":"2015-10-03T17:32:38.227+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Mugiwara n Luffy,realm=EUW,application-id=KYnfKGf0,discussion-id=pxEBLyTu,comment-id=000d000000000000000100000000000000000000,timestamp=2015-10-03T17:17:23.706+0000)\n>\n> Ohne den Thread hier, hätte ich dir das ungesehen geglaubt, aber die Tatsache, dass genau der vom TE gemeldete Spieler, kurze Zeit nach dem Report, aufgeflogen ist, wäre doch ein lächerlich unwahrscheinlicher Zufall oder?\n> \n> Hätte der Report des TE keinerlei Effekt gehabt, hätte das automatische System ja rein zufällig genau diesen einen Spieler unter den 100.000+ die du erwähnst, genau zu dieser Zeit finden müssen.\n> Das klingt sehr unwahrscheinlich für mich.\n\nEs sind ja leider mehr als 100k. Habe es eben spaßeshalber überprüft und es waren dann \"427163 Total Members\". In der kurzen Diskussionszeit hier, hat sich die Zahl sogar nochmal erhöht... und es sind schon wieder ein paar mehr. Kannst ja nachschauen, wenn du es nicht glaubst. *g*\n\nIch gehe davon aus, dass der gebannte Spieler so unvorsichtig war, in dem LoL internen Chat bei seinem \"Freund\" das Cheaten zuzugeben. Das ist der einzige Fall den ich sehe, wo Riot tatsächlich durch die Meldung profitiert und auch ohne großen Aufwand den Chat prüfen kann, da es der eigene Chatverlauf ist. Hier geht Riot also kein Datenschutzrisiko oder sonstwas ein. \n\nSonst wäre es ein großer Zufall, aber auch diese gibt es manchmal. Es gab auch schon Leute, die mehrmals vom Blitz getroffen wurden. Aber ich gehe davon aus, dass es eine unfreiwillige \"selbstanzeige\" des Cheaters war. \n\n> \n> Ich gehe davon aus, dass die automatische Auswertung, in festgelegten Intervallen, die seit den letzten Banns gesammelten Daten nutzt um in Wellen zu bestrafen. Das macht es den Script-Erstellern nicht so einfach das System zu umgehen.\n\nNaja, ich schaue spaßeshalber immer mal wieder ins Cheaterforum und fand vor einiger Zeit die Frage eines Spielers an einen der \"Moderatoren\" dort ziemlich witzig: er fragte, ob man nicht auch für Dota-2 Scripte anbieten würde. Der \"Moderator\" meldete sich daraufhin sinngemäß in etwa  mit einem \"das geht nicht, weil die dort eine funktionierende Scripterkennung haben\".\n\nIch dachte mir dann meinen Teil und an dieser Stelle gibt es ein Augenzwinkern in Richtung Riot. *zwink* ;)","replies":[{"poster":"Der Großmugister","date":"2015-10-03T17:47:33.333+0000","up_votes":1,"down_votes":0,"body":"Ich sehe keinen Grund aus dem die Chatanalyse wahrscheinlicher sein sollte als die von mir beschriebene Variante.\nRiot geht keinerlei, Datenschutz-technische Risiken ein, wenn sie Daten lediglich zu einem früheren als dem eigentlich vorgesehenem Zeitpunkt, erheben.\nWenn du deine Aussage allerdings auf dem vermeindlich schlechten System Riots begründest, fehlt mir da die Grundlage für eine Diskussion, als Riot-\"Fanboy\" gehe ich einfach spontan davon aus, dass Riot da schon gute Arbeit leistet, beweisen kann ich es aber natürich nicht, genau so wenig, wie du wohl das Gegenteil beweisen kannst.\nFalls du da allerdings Zugang zu Insiderwissen hast, nehme ich das gern zurück, die Aussage des Scripter-Foren-Mods, würde ich allerdings nicht als Solches akzeptieren, da ich behaupte, dass solche Menschen einen unnatürlich stark ausgeprägten Geltungsdrag haben müssen und daher wohl eher eine solche Aussage tätigen würden, selbst wenn der eigentliche Grund wäre, dass es zu wenig Kunden für Dota gäbe oder sie schlicht kein persönliches Interesse an dem Markt hätten.\n\nIch möchte mich übrigens hier, zumindest für heute, aus dem Gespräch zurückziehen, da ich nun Etwas trinken werde und dann erfahrungsgemäß nichtmehr der Diskussionspartner sein kann, den Jemand den ich in diesem Bereich zu schätzen gelernt habe, verdient.\n\nIch wünsche einen wunderschönen Rest-Samstag.","replies":[]}]}]}]}]}]}]}]},{"poster":"Der Großmugister","date":"2015-10-03T16:34:22.155+0000","up_votes":1,"down_votes":0,"body":"Ich hab beim erneuten Lesen gemerkt, dass mein Beitrag doch recht passiv-aggressiv rüberkommt, das war nicht meine Intention und ich möchte mich dafür entschuldigen.","replies":[]}]}]}]}]},{"poster":"PwnedAkkon ","date":"2015-10-01T20:21:26.473+0000","up_votes":3,"down_votes":2,"body":"Es geht nicht darum, woran man einen Menschen messen kann. Sondern, dass du mit Menschen die deine Wertvorstellungen nicht teilen nichts zu tun haben willst. Naja ich denke wir kommen hier zu keiner Einigung mehr :). War schön mit dir zu diskutieren, und falls ich deine Gefühle verletzt haben sollte Entschuldige Ich mich hiermit dafür, denn es war keinenfalls meine Absicht.","replies":[{"poster":"Der Großmugister","date":"2015-10-01T20:31:54.069+0000","up_votes":2,"down_votes":0,"body":"Diese Aussage finde ich sehr erwachsen von dir und sie ändert mein Bild von dir erheblich, meinen Respekt dafür.\nIch denke ich habe das hauptsächliche Missverständnis entdeckt.\n\nIch wollte keineswegs sagen und habe es auch meiner Meinung nach nicht, aber darauf will ich nicht bestehen, dass ich mit Menschen, die anderen moralischen Grundsätzen folgen, nichts zu tuen haben will. Das ist nur in extremen Fällen der Fall, wenn mir beispielsweise Jemand sagt, er folgt den moralischen Grundsätzen des alten Griechenlands und praktiziert daher die Knabenliebe (hierbei würde mich nicht die eventuelle homosexualität sondern die pedophilie stören), würde ich durchaus sagen, dass ich mit diesem Jemand Nichts zu tun haben will.\nWas ich eigentlich sagen wollte war, dass ich mit Menschen, die grundsätzlich andere Moralvorstellungen haben, nicht befreundet sein kann. Freundschaft ist für mich ein sehr eng gefasster Begriff und ich würde nur Menschen als Freunde bezeichnen, denen ich bedingungslos vertrauen kann (Ich würde nur etwa 8 Leute in meinem Leben als Freunde bezeichnen).\nHat Jemand andere moralische Grundsätze als ich, kann ein solches Vertrauen nicht bestehen.","replies":[{"poster":"PwnedAkkon ","date":"2015-10-01T20:34:18.077+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Mugiwara n Luffy,realm=EUW,application-id=KYnfKGf0,discussion-id=pxEBLyTu,comment-id=000b0000,timestamp=2015-10-01T20:31:54.069+0000)\n>\n> Diese Aussage finde ich sehr erwachsen von dir und sie ändert mein Bild von dir erheblich, meinen Respekt dafür.\n> Ich denke ich habe das hauptsächliche Missverständnis entdeckt.\n> \n> Ich wollte keineswegs sagen und habe es auch meiner Meinung nach nicht, aber darauf will ich nicht bestehen, dass ich mit Menschen, die anderen moralischen Grundsätzen folgen, nichts zu tuen haben will. Das ist nur in extremen Fällen der Fall, wenn mir beispielsweise Jemand sagt, er folgt den moralischen Grundsätzen des alten Griechenlands und praktiziert daher die Knabenliebe (hierbei würde mich nicht die eventuelle homosexualität sondern die pedophilie stören), würde ich durchaus sagen, dass ich mit diesem Jemand Nichts zu tun haben will.\n> Was ich eigentlich sagen wollte war, dass ich mit Menschen, die grundsätzlich andere Moralvorstellungen haben, nicht befreundet sein kann. Freundschaft ist für mich ein sehr eng gefasster Begriff und ich würde nur Menschen als Freunde bezeichnen, denen ich bedingungslos vertrauen kann (Ich würde nur etwa 8 Leute in meinem Leben als Freunde bezeichnen).\n> Hat Jemand andere moralische Grundsätze als ich, kann ein solches Vertrauen nicht bestehen.\n\nDann gehen unsere moralischen Grundsätze wohl im Thema Definierung von Freundschaft auseinander xD","replies":[]}]}]},{"poster":"PwnedAkkon ","date":"2015-10-01T20:04:16.503+0000","up_votes":1,"down_votes":1,"body":"damit verurteilt die person x das handeln dieser kultur (der Menschen), jedoch keinesfalls die Menschen an sich.","replies":[{"poster":"Der Großmugister","date":"2015-10-01T20:08:55.304+0000","up_votes":1,"down_votes":0,"body":"Genau Das, genauer ausgedrückt, Person X verurteilt einen Teilaspekt einer Kultur und evtl. die Menschen, die nach diesem Teilaspekt handeln.\nDa du das einsiehst, kannst du unmöglich an deiner vorherigen Behauptung, die dieser Logik in allen Punkten widerspricht, festhalten.\n\nEs freut mich, dass du es einsiehst und ich nehme deine Entschuldigung dafür, dass du mich direkt als intolerant und indirekt als fremdenfeindlich bezeichnet hast an!","replies":[{"poster":"PwnedAkkon ","date":"2015-10-01T20:12:30.408+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Mugiwara n Luffy,realm=EUW,application-id=KYnfKGf0,discussion-id=pxEBLyTu,comment-id=00090000,timestamp=2015-10-01T20:08:55.304+0000)\n>\n> Genau Das, genauer ausgedrückt, Person X verurteilt einen Teilaspekt einer Kultur und evtl. die Menschen, die nach diesem Teilaspekt handeln.\n> Da du das einsiehst, kannst du unmöglich an deiner vorherigen Behauptung, die dieser Logik in allen Punkten widerspricht, festhalten.\n> \n> Es freut mich, dass du es einsiehst und ich nehme deine Entschuldigung dafür, dass du mich direkt als intolerant und indirekt als fremdenfeindlich bezeichnet hast an!\n\nIch habe keinenfalls eingesehen, dass ich irgendetwas falsch verstanden habe,   Ich habe nur eingesehen, dass ich ein Wort falsch in Erinnerung habe. Zudem verbitte ich mir, dass ich dich als fremdenfeindlich denuziert haben soll, ich habe nur behauptet, dass deine Toleranz gegenüber Menschen mit anderen Wertvorstellungen(WELCHE NICHT DEN MENSCHEN AN SICH AUSMACHEN) sehr gering ist und ich das falsch finde.","replies":[{"poster":"Der Großmugister","date":"2015-10-01T20:18:08.827+0000","up_votes":2,"down_votes":0,"body":"Zitat: \"Daraus und das du nur \"Freunde\" hast, die deine moralischen Grundsätze teilen schließe ich, dass du nur sehr wenig Toleranz in diesem Bereich zeigst. Das Bedeutet, du verurteilst Menschen aufgrund Ihrer Erziehung oder ihres Umfeldes. Naja den Rest kann sich ja jeder selbst Denken\"\n\nWie gesagt, indirekt... so Viel dazu.\n\nDann erkläre mir doch jetzt bitte mal, an was man einen Menschen messen kann, wenn nicht an seinen moralischen Grundsätzen und was den Menschen denn sonst ausmacht.\nDie moralischen Grundsätze bestimmend as gesamte Handeln und bestimmen, was ein Mensch als \"richtig und falsch\" ansieht.\nMir fällt wirklich nichts ein, was besser geeignet wäre, sich ein Urteil über einen Menschen zu bilden.","replies":[]}]}]}]},{"poster":"Wuhlesyndikat","date":"2015-10-01T16:21:05.100+0000","up_votes":1,"down_votes":5,"body":"toller freund","replies":[{"poster":"Hamrio","date":"2015-10-01T17:56:32.260+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Wuhlesyndikat,realm=EUW,application-id=KYnfKGf0,discussion-id=pxEBLyTu,comment-id=0008,timestamp=2015-10-01T16:21:05.100+0000)\n>\n> toller freund\n\ndanke. ich bin mir aber nicht sicher ob du gerne einen freund hättest der dich permanent beleidigt und einen ziemlich starken gott komlex hat","replies":[{"poster":"Der Großmugister","date":"2015-10-01T17:57:49.237+0000","up_votes":2,"down_votes":0,"body":"Vielleicht meinte er ja deinen Scripter \"Freund\" so habe ich es zumindest verstanden.^^","replies":[]}]}]},{"poster":"SkalaZion","date":"2015-10-01T12:07:31.455+0000","up_votes":2,"down_votes":1,"body":"Finde das was du getan hast sehr gut du hast ihn schließlich mehrmals gesagt er soll es sein lassen und wenn er meint dann einen Gott Komplex aufgrund scripts zu bekommen ( was im am lächerlichsten finde ) dann sry hat er es einfach nicht anders verdient und ein guter Freund scheint das ja nicht géwesen zu sein wenn er dich auch noch übelst beschimpft und beleidigt ... Daumen hoch ... \n\nhab auch einen Freund der sich derzeit Boosten lässt aber ich werde ihn nicht Reporten da wir echt Dicke sind... habe ihm gesagt was ich davon halte (  und zwar absolut garnix ) aber ich meine wem schadet er damit eigentlich niemanden ausser sich selbst wenn er dann mal wieder spielt im Diamond Bereich obwohl er silber ist ... Denke er wir im Ranked keinen Spass mehr haben ... In dem Sinne :D","replies":[{"poster":"M4ster Yi","date":"2015-10-01T13:17:32.695+0000","up_votes":2,"down_votes":0,"body":"Naja nur das gesammte Gegner Team des boosters schadet er .","replies":[]}]},{"poster":"Protective Puppy","date":"2015-10-01T02:59:45.792+0000","up_votes":2,"down_votes":0,"body":"Ein Scripter der jemand anderen sagt dass er das Spiel nicht kann.\n\nWunderschön. :^)","replies":[]},{"poster":"Masterba1t","date":"2015-09-30T21:04:03.225+0000","up_votes":2,"down_votes":1,"body":"hast du ihn jetzt gemeldet weil er gescripted hat oder weil er dich kot genannt hat und du beleidigt warst?","replies":[{"poster":"Hamrio","date":"2015-09-30T21:10:48.818+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Masterba1t,realm=EUW,application-id=KYnfKGf0,discussion-id=pxEBLyTu,comment-id=0000,timestamp=2015-09-30T21:04:03.225+0000)\n>\n> hast du ihn jetzt gemeldet weil er gescripted hat oder weil er dich kot genannt hat und du beleidigt warst?\n\nErstmal kot war eine umformung kannst dir wohl denken wofür :*) . und gemeldetet haben ich ihm im allgemeinen nicht nur weil er der schlimmere teil der comunity war sonder auch wegen seiner großkotzigkeit","replies":[{"poster":"PwnedAkkon ","date":"2015-10-01T19:00:28.207+0000","up_votes":1,"down_votes":9,"body":"> [{quoted}](name=Hamrio,realm=EUW,application-id=KYnfKGf0,discussion-id=pxEBLyTu,comment-id=00000000,timestamp=2015-09-30T21:10:48.818+0000)\n>\n> Erstmal kot war eine umformung kannst dir wohl denken wofür :*) . und gemeldetet haben ich ihm im allgemeinen nicht nur weil er der schlimmere teil der comunity war sonder auch wegen seiner großkotzigkeit\n\nwer freunde wie dich hat braucht keine feinde","replies":[{"poster":"eingew","date":"2015-10-01T19:54:24.879+0000","up_votes":2,"down_votes":0,"body":"Freund? Glaubst du deine Freunde denken noch als solche über eure Beziehung, wenn du sie beleidigst und auslachst? Glaubst du es sieht sich noch jemand als dein Freund, wenn du auf ihm rumhackst und herabsiehst?\nWas hat dieses Verhalten mit Freundschaft zu tun?! 0.o\n\nDu hast offensichtlich eine sehr eigenartige Vorstellung von positiven Beziehungen.","replies":[{"poster":"i3IackCat","date":"2015-10-17T01:31:40.321+0000","up_votes":1,"down_votes":1,"body":"> Glaubst du es sieht sich noch jemand als dein Freund, wenn du auf ihm rumhackst und herabsiehst?\n\nSado-Maso-Beziehungen?","replies":[]}]}]}]}]},{"poster":"El Jonas","date":"2015-10-02T11:47:09.904+0000","up_votes":1,"down_votes":1,"body":"Was genau bedeutet scripten in League?","replies":[{"poster":"Sirrkas","date":"2015-10-02T12:41:19.060+0000","up_votes":2,"down_votes":1,"body":"Scripts sind Programme die Aktionen automatisch ausführen. Das kann alles mögliche sein. Vom automatischen Lasthitten, bis zum Anzeigen, wann ein Gegner durch eine Kombo sterben kann und noch der Ausführung derselbigen. Für Cassi gab es mal ein Script, bei dem ihr E so schnell ausgeführt und danach ein Bewegungsbefehl ausgeführt wurde, dass die Fangzähne scheinbar aus ihrem Rücken kamen.","replies":[]}]}]}