{"poster":"Hamrio","date":"2015-05-04T15:14:04.427+0000","title":"League of Legends Turnier an meiner schule? (Brauche hilfe)","subforum":"Turniere & Veranstaltungen","up_votes":1,"down_votes":0,"body":"Hallo, Ich bin momentan in der achten Klasse eines Gymnasiums in NRW und w&uuml;rde gerne mit einige schulen in der gegend ein LoL turnier machen. Ich hatte die Idee vorgestern und bekomme sie nicht mehr aus dem Kopf.\nAlso mein Plan w&auml;re es ,dass dann alle aus stufe  8 von den teilnehmenden schulen gegeneinander antreten . klassisches Turnier 5v5 system (bsp Bild mit 8 teams)  (sorry dass das so dumm aussieht ist mit paint gemacht).\n\nDie ersten Spiele (unten werden mit einem Spiel entschieden)\nDie Halbfinals mit eine Best of 3\nUnd das finale mti einme best of 5\n\nmeine frage ist jetzt: WIe genau soll ich das organisieren ? soll ich das mal kurz dem Klassenlehrer sagen und dann weiter oder wie richte ich das an?\nBitte gebt mir ein paar tipps wenn ihr etwas in der art schon mal was  an der Schule gemacht habe. Und vllt. k&ouml;nnte das ja auch an euren schulen gemacht werden . lasst bitte einen Hilfreiche kommentar da oder einen Upvote damit mehr leute das sehen k&ouml;nnen =)\n\nBei fragen melden\nLG Hamrio","replies":[{"poster":"pulledchicken","date":"2015-05-04T15:28:22.185+0000","up_votes":1,"down_votes":0,"body":"4 Gruppen sind besser als nur 3 dann kannst du das Viertel Finale gestalten und um den 3 Platz Kämpfen lassen ;)\n\nalso am besten musst du die verlierer noch eine 2 Chance geben und später um den 3 Plaz Kämpfen lassen ;) ","replies":[{"poster":"Hamrio","date":"2015-05-04T15:32:07.544+0000","up_votes":1,"down_votes":0,"body":"ich hab doch 4 gruppen :o gruppe A ,b,c und D","replies":[{"poster":"pulledchicken","date":"2015-05-04T15:36:24.506+0000","up_votes":1,"down_votes":0,"body":"die verlierer dieser gruppe müssen aber noch einmal miteinander kämpfen \n\nhast du denn überhaupt soviele Schulen die das mitmachen würden ... hast du mal gefragt ob das überhaupt sinn macht ... nicht das deine schule sagt sowas wollen die hier nicht ;) und du dir die ganze arbeit umsonst gemacht hast ..","replies":[]}]}]}]}