{"poster":"NoxusWillPrevail","date":"2017-10-25T03:28:23.407+0000","title":"4 man going around trying to get people banned","subforum":"Player Behaviour","up_votes":6,"down_votes":0,"body":"i had a game with these people and in the champ select the adc said &quot;Hello my name is &quot;Retard&quot;. I will feed your lane, until you say my name 4 times in game &quot;Retard&quot;. Then ill stop and try to win.&quot; then locked in sion with windspeakers so i promptly said it 4 times and he went to lane. while i know that banning their accounts wont stop this, i just thought that i would share this so that other people know that people are doing this and to not fall for their tricks.\nThe picture is of their discord where they do this with multiple people generally in 4 mans to easily tilt the one random person and get them banned.\n\nsummoner names in case you want them: _Names Removed_\n\nthanks for reading\n\npic of discord: \nhttps://i.imgur.com/a2qJty9.png","replies":[{"poster":"Fitzky","date":"2017-10-25T07:10:26.709+0000","up_votes":2,"down_votes":0,"body":"Ok right I see Riot and these people DONT deserve to be witch hunted? What a horrible thing to do, makes me wonder if there are multiple groups or \"cults\" of people going around and doing this. Indefinite ban them.","replies":[]},{"poster":"koreoes","date":"2017-10-25T06:13:02.493+0000","up_votes":2,"down_votes":0,"body":"That is honestly messed up, I hope you don't get banned. What fun even is that?","replies":[]},{"poster":"Bronze 6 Yasuo","date":"2017-10-28T08:25:13.633+0000","up_votes":2,"down_votes":1,"body":"Thing is people who have above 1 iq will not fall for this because they know about the consequences about saying the word 'retard' in game. Smart players will not say anything in game, screenshot what they are doing, and send it to riot support and 99% of the time it results in the player getting banned. Hope this helped (;","replies":[]},{"poster":"A1Time","date":"2018-05-24T01:26:30.396+0000","up_votes":1,"down_votes":0,"body":"From unranked to bronze to Silver I have found players like this its a new form of trolling Am surpised they told you out right Most of the time they do it in secret getting poor players banned there are dozens of them Because ppl like to hurt others for pleasrure","replies":[]},{"poster":"Akkordian Zoeve","date":"2017-10-25T04:17:36.792+0000","up_votes":1,"down_votes":0,"body":"It would be much better to post it here: https://boards.na.leagueoflegends.com/en/\n\nXD","replies":[]},{"poster":"JasonWazza","date":"2017-10-25T06:41:25.282+0000","up_votes":1,"down_votes":2,"body":"And this is the issue with an automated banning system.\n\nContext is key.","replies":[]}]}