{"poster":"ITK kITKanan","date":"2015-05-14T12:05:02.150+0000","title":"Italian Killers Team reclutamenti aperti! (solo adc, supp, mid)","subforum":"Discussioni generali","up_votes":3,"down_votes":2,"body":"Salve a tutti, sono Erik il capitano della Italian Killers. Fra poco festeggeremo il nostro ottavo mese di attivit&agrave; e siamo da tre mesi approdati in gold con il team 3v3.\r\nOra il nostro obiettivo &egrave; arrivare in gold con il Team 5v5!\r\nIl nostro team &egrave; composto da 12 membri.\r\n\r\nCosa cerchiamo?\r\n\r\n1 - Utilizzo di Team Speak (ts3)\r\n2 - Avere esperienza come Main Supp o ADC o Mid, abbiamo anche un coach interno, per cui con noi si migliora non abbiate paura!\r\n3 - Orari e giorni in cui cerchiamo di ritrovarci dal Lun-Ven o primo pomeriggio o in serata, ovviamente sono indicativi non ci siamo sempre ma a rotazione si becca sempre qualcuno, cerchiamo comunque di preferire il serale per essere tutti presenti.\r\n4 - Rispetto per tutti, quindi niente offese o bestemmie (anche se si sbaglia)\r\n5 - Si chiede un po di impegno quindi riunione settimanale obbligatoria e almeno 5 partite ranked in team a settimana pena espulsione automatica.\r\n6 - Elo Silver alto - Gold, diamo precendenza a chi ha lo spirito giusto, cio&egrave; impegnarsi, essere costruttivi in team, non essere individualisti, essere disposti a tanti allenamenti.\r\n7 - Ripeto cerchiamo Main Adc, e Main Supp e Main Mid (verranno valutati con preferenza chi ha gia esperienza di team 5v5), disposti anche a condividere consigli e critiche costruttive. \r\n\r\nOrmai abbiamo un nostro zoccolo duro di amici che si &egrave; conosciuto proprio tramite questo gioco nel team stesso!\r\nAbbiamo fanculizzato allegramente anche diversi diamond che erano entrati in squadra solo per fare i mercenari, quello che cerchiamo noi &egrave; gente PRESENTE con voglia di divertirsi e poi i risultati arriveranno.\r\nAbbiamo un et&agrave; compresa fra i 20 e i 30.... Cerchiamo gente che abbia almeno 20 anni ^_^\r\n\r\nSiamo stanchi di proplayer che bestemmiano al primo minimo errore o chiamano il ks anche se sei in base.\r\n\r\nSe vuoi candidarti lascia il tuo nick qui sotto, ti contatter&ograve; io, non addatemi senza lasciare il nick perch&eacute; visti i milioni di bot che cercano di addarmi ogni giorno, vi cestinerei senza pensarci.","replies":[{"poster":"ITK kITKanan","date":"2015-05-14T16:23:31.684+0000","up_votes":2,"down_votes":1,"body":"Bene ragazzi grazie delle adesioni, siamo arrivati a circa 30 persone da provinare, per ora chiudo i reclutamenti, se dovesse servire li riaprirò di nuovo!","replies":[{"poster":"Kr3on","date":"2015-05-16T23:41:29.462+0000","up_votes":1,"down_votes":0,"body":"se vi interesso sono a disposizione contattatemi gold 5","replies":[]}]},{"poster":"Sanji il cuoco","date":"2015-05-14T12:23:56.392+0000","up_votes":1,"down_votes":1,"body":"Mi piacerebbe provare (sopratutto per provare a cooperare come un vero team) anche se non sono esattamente un fenomeno e soprattutto non sempre posso usare TS.\n\nSe può interessare posso giocare support e all' occorrenza jungler.\n\nQualora vi andasse di provarmi il mio nick e scritto nell' autore del post xD \n\nSaluti","replies":[{"poster":"ITK kITKanan","date":"2015-05-14T13:47:27.917+0000","up_votes":2,"down_votes":1,"body":"Purtroppo il ts è l'anima pulsante del team e non poterlo usare sempre, pregiudica la candidatura.","replies":[]}]},{"poster":"I DarkFury I","date":"2015-05-20T16:30:50.055+0000","up_votes":1,"down_votes":0,"body":"Io sono interessato sono s4 gioco adc principalmente e secondo ruolo mid... ho voglia di imparare e cerco un team molto attivo con cui giocare insieme, fin ora non ne ho trovati ne attivi ne seri ma da come hai fatto l'annuncio già partite bene ^^ vi addo in game anche sono D3V1L 666 ITA","replies":[{"poster":"I DarkFury I","date":"2015-05-20T16:32:43.338+0000","up_votes":1,"down_votes":0,"body":"so che avete chiuso i reclutamenti ma se c'è un piccolissimo posto sarei davvero interessato :) in caso contrario aspetterò e buon game a tutti ;)","replies":[]}]},{"poster":"KhalonTheMonster","date":"2015-05-15T13:13:12.833+0000","up_votes":1,"down_votes":0,"body":"Team OP Guys","replies":[]},{"poster":"ImOnFire3","date":"2015-05-15T08:43:32.943+0000","up_votes":1,"down_votes":1,"body":"Sono main adc attualmente platino 5, ma dall'inizio di questa season ho toccato anche il plat 2 quasi 1, nick in game: ImOnFire3\n\n(scusate ho letto dopo dei reclutamenti chiusi) ","replies":[]},{"poster":"Nabbomaster","date":"2015-05-14T18:29:38.238+0000","up_votes":1,"down_votes":1,"body":"io maino garen mid lo usato per passare dal silver 3 al gold 3","replies":[]},{"poster":"Sanji il cuoco","date":"2015-05-14T15:54:12.843+0000","up_votes":1,"down_votes":1,"body":"Vabbuò ci avevo sperato :|","replies":[]}]}