{"poster":"Hell88","date":"2016-03-26T18:11:18.747+0000","title":"Punizioni più sever per afk","subforum":"Discussioni generali","up_votes":3,"down_votes":6,"body":"&egrave; solo una mia idea o ultimamente la piaga degli afk &egrave; sempre pi&ugrave; devastante?forse dopo il secondo afk in poco tempo bisognerebbe gi&agrave; bannare per 14 giorni non solo far aspettare 20 minuti perch&egrave; a quanto pare &egrave; inutile.\r\nche ne pensate?\r\nPs.inutile dire che ci sono le connessioni scadenti in italia,se sapete gi&agrave; in partenza di essere messi male non giocate proprio.","replies":[{"poster":"TORREro064","date":"2016-03-26T18:23:19.144+0000","up_votes":4,"down_votes":1,"body":"non ti preoccupare \nla riot ha messo a punto un sistema ottimale per punire gli afk\nhanno fatto una squadriglia di commando armata che localizza il soggetto che va afk tramite l' indirizzo IP e gli taglia la gola","replies":[{"poster":"Hell88","date":"2016-03-26T18:30:52.414+0000","up_votes":3,"down_votes":1,"body":"niente detonazione della casa?mi pare troppo soft!","replies":[{"poster":"TORREro064","date":"2016-03-26T19:40:22.386+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Hell88,realm=EUW,application-id=MJVj50Jw,discussion-id=qXNYEgew,comment-id=00000000,timestamp=2016-03-26T18:30:52.414+0000)\n>\n> niente detonazione della casa?mi pare troppo soft!\n\npffff\nsicuramente chi va in afk non possiede neanche una casa\ngioca con il pc della biblioteca","replies":[]}]}]},{"poster":"BrattishSolid6","date":"2016-03-26T18:38:47.902+0000","up_votes":2,"down_votes":1,"body":"Quindi se la corrente salta due volte in due giorni io dovrei ricevere un ban da 14gg (a cui, logicamente, seguirebbe il permaban)? Davvero? Le punizioni previste ora mi paiono giuste e corrette.\n\nConsidera che sei in un elo basso al momento, purtroppo non è raro trovare persone con una mentalità sbagliata **soprattutto **in queste leghe. Non preoccuparti che chi è recidivo viene punito comunque ^^ il sistema funziona.","replies":[{"poster":"Hell88","date":"2016-03-26T20:20:43.751+0000","up_votes":1,"down_votes":1,"body":"a quindi se sei elo basso ti devi sorbire tutta la fogna che gira su LoL? capisco.","replies":[{"poster":"BrattishSolid6","date":"2016-03-26T20:45:23.197+0000","up_votes":2,"down_votes":0,"body":"Il player che va afk te lo ritrovi dal Bronzo fino al Diamond, tranquillo. Ad elo basso semplicemente c'è più questa tendenza, per una serie di motivi che portano quelle persone ad essere ad un elo basso (non solo l'abilità in game) ^^","replies":[]},{"poster":"Severus Piton 19","date":"2016-03-27T15:29:20.548+0000","up_votes":1,"down_votes":1,"body":"Povera vittima :) Allora dev'essere proprio impossibile salire!","replies":[]}]},{"poster":"B3L14R","date":"2016-03-28T00:26:04.126+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=BrattishSolid6,realm=EUW,application-id=MJVj50Jw,discussion-id=qXNYEgew,comment-id=0001,timestamp=2016-03-26T18:38:47.902+0000)\n>\n> Quindi se la corrente salta due volte in due giorni io dovrei ricevere un ban da 14gg (a cui, logicamente, seguirebbe il permaban)? Davvero? Le punizioni previste ora mi paiono giuste e corrette.\n> \n> Considera che sei in un elo basso al momento, purtroppo non è raro trovare persone con una mentalità sbagliata **soprattutto **in queste leghe. Non preoccuparti che chi è recidivo viene punito comunque ^^ il sistema funziona.\n\ni challenger non crashano mai...l'enel lo sa e toglie la corrente solo ai vicini?\nE poi su, se salta la corrente, 5 minuti e sei di nuovo dentro, se non torni sei un bbk e meriti la punizione.","replies":[]}]},{"poster":"Demigod Summoner","date":"2016-03-27T14:49:33.682+0000","up_votes":1,"down_votes":1,"body":"Che poi uno si fa la domanda, il ban se lo merita più l'afk che non feeda o quello che non va afk ma lagga a 400 e feeda come un porchetto? A questo punto meglio un afk.","replies":[{"poster":"Hell88","date":"2016-03-28T02:07:35.847+0000","up_votes":1,"down_votes":0,"body":"ban entrambi zio.Ban hammer everywhere!","replies":[{"poster":"Demigod Summoner","date":"2016-03-28T11:39:25.013+0000","up_votes":1,"down_votes":0,"body":"Vero però ora come ora si più reportare solo gli afk, però aggiungere un sistema di controllo latenza potrebbe davvero risolvere ogni cosa","replies":[{"poster":"Hell88","date":"2016-03-28T20:40:55.628+0000","up_votes":1,"down_votes":1,"body":"sai da quanto lo dico? su counter strike se non hai un certo ping sul server non entri .se è impostato a 100 ms come ping limite se hai 101 non entri.Sai che mi han risposto?\"e se io durante l'attesa mi guardo un video su YB o faccio altro? e per quelli da''estero che giocano in euw e non hanno altri server vicini?\"...con ragionamenti del genere cosa vuoi che ti dica?","replies":[]}]}]}]},{"poster":"Boldstriker","date":"2016-03-26T19:19:48.089+0000","up_votes":1,"down_votes":0,"body":"Di conseguenza al secondo/terzo crash del proprio pc/blackout della linea un giocatore si ritrova bandito per 14 giorni?\n\nLo sappiamo tutti che bisogna essere responsabili ed evitare di giocare in momenti in cui non si può stare al pc, però mamma Riot non è così dura, altrimenti dove li trova i ~~clienti~~ giocatori?","replies":[{"poster":"kharonte90","date":"2016-03-26T20:15:36.823+0000","up_votes":1,"down_votes":0,"body":"non è così dura però se scrivi \"learn to play\" o \"omg stop idiot\" al giocatore 0 5 al minuto 6 del game  ti bannano al volo, quando tutti i giochi sono pieni di parolacce, mafia, prostituzione, droga, omicidi, squartamenti, stupri, inferni, diavoli, scene di sesso etc.\n\ndiciamo che proprio equilibrata la cara riot non è, anzi, comunque l'importante è comprare skin.","replies":[{"poster":"BrattishSolid6","date":"2016-03-26T20:47:18.499+0000","up_votes":1,"down_votes":0,"body":"...il mondo fa schifo, quindi non evitiamo che faccia sempre più schifo.\n\nBella filosofia. Non lo puoi sapere, ma sto applaudendo.\n\n______________________________________\n\nP.S. Non mi è chiara la collocazione di \"scene di sesso\" appena dopo \"diavoli\", \"omicidi\" e \"mafia\". Ma ok :)","replies":[{"poster":"kharonte90","date":"2016-03-26T21:09:36.275+0000","up_votes":1,"down_votes":0,"body":"il tuo esempio è fuori luogo, non ho detto quello, piuttosto intendevo dire che è inutile fingere di voler proteggere i bambini, quando poi giocano a GTA.\nnon cè bisogno che ogni volta per rispondere a un post citate grandi poeti o fate gli intellettuali... per favore, basta.\n\nè casuale, se preferisci cambio l'ordine, ma cè qualcosa che sei riuscito a capire di quelle mie 4 righe?","replies":[{"poster":"BrattishSolid6","date":"2016-03-26T21:48:39.932+0000","up_votes":1,"down_votes":0,"body":"Intendo che insultare non c'entra assolutamente nulla col \"proteggere i bambini\". Se anche a LoL non giocassero bambini, allora insultarsi gratuitamente dovrebbero essere lecito? Si tratta di educazione, di civiltà, cose che a mio parere prescindono dall'età. Dare dell'idiota a una persona che non hai mai visto, che non conosci, solo perché ha sbagliato a cliccare due pulsanti su una tastiera, mi pare davvero stupido. Pensala come vuoi poi, di' pure \"tanto siamo grandi, non ci scandalizziamo per una parola\": resto dell'idea che se si può evitare, si evita, **proprio perché **non sai chi c'è dietro l'altro schermo.\n\nNon è fare grandi citazioni o fare gli intellettuali. Noi che rispondiamo non siamo nulla più di voi, assolutamente nulla. Non siamo quelli bravi e voi quelli cattivi. Ho espresso la mia opinione, come tu hai espresso la tua.\n\n___________________________________________\n\nIntendevo dire che \"scene di sesso\" c'entra poco e nulla col resto. Come c'entra poco tutto il discorso che stiamo facendo, a dire il vero. Siamo abbastanza off-topic.","replies":[{"poster":"kharonte90","date":"2016-03-26T22:00:14.487+0000","up_votes":1,"down_votes":0,"body":"come è stupido continuare a morire ogni 40 secondi, come è stupido prendersela per un \"idiot xD\" e andare afk.\nio non ci vedo nulla di sbagliato nel sentirmi dire da chi gioca meglio un \"pirla\" qua e la, mentre mi insegna.","replies":[{"poster":"BrattishSolid6","date":"2016-03-26T22:13:21.969+0000","up_votes":1,"down_votes":1,"body":"Tu non ci vedi nulla di sbagliato, perché tu lo accetti. E lo capisco, e va benissimo così. \nMa sai anche tu che ci sono persone più sensibili, persone più piccole, persone di cui non sai nulla, a cui un insulto o un semplice \"idiot\" può fare molto peggio che a te. \n\n> mentre mi insegna.\n\nQuesta è tutt'altra cosa. Ma siamo seri, quante volte un flamer \"insegna\"?","replies":[{"poster":"Hell88","date":"2016-03-28T02:06:51.669+0000","up_votes":1,"down_votes":2,"body":"se ci sono persone tanto deboli nell'universo meglio che si estinguano.","replies":[]}]}]}]},{"poster":"Floppyz","date":"2016-03-26T21:32:36.473+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=kharonte90,realm=EUW,application-id=MJVj50Jw,discussion-id=qXNYEgew,comment-id=0002000000010000,timestamp=2016-03-26T21:09:36.275+0000)\n>\n è inutile fingere di voler proteggere i bambini, quando poi giocano a GTA.\n\nGiusto per precisarlo, visto che tendono quasi tutti a dimenticarlo, i bambini non dovrebbero giocare a GTA. Nel senso che quel gioco non è fatto per loro, fermo restando la libertà dei genitori di farli giocare con quel che gli pare.","replies":[]}]}]},{"poster":"Hell88","date":"2016-03-26T20:20:00.986+0000","up_votes":1,"down_votes":1,"body":"basterebbe che avessero il 50% in meno di guadagni per 2-3 mesi poi vedi come bannano a raffica!","replies":[]}]},{"poster":"Hell88","date":"2016-03-26T20:29:33.123+0000","up_votes":1,"down_votes":1,"body":"sei hai il pc del 2000 e vivi in uguando mica è un problema degli altri ma tuo! sta a te risolvere o non giocare proprio.","replies":[]}]}]}