{"poster":"SeeRoybär","date":"2016-02-10T16:14:33.075+0000","title":"Ich wurde zu Unrecht permanent gebannt.","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":12,"body":"Hallo Zussammen, {{champion:17}} \r\n\r\nda ich Heute frei habe und mich f&uuml;r ein paar Runden League of Legends entschieden habe kam ich in eine Lobby welche aus 4 Premades bestand (heil der dynamic quee). Als ich ihnen also Udyr in der pick und ban Phase gezeigt habe (als m&ouml;glicher Pick) wollten sie erst einmal meinen Udyr bannen was ich schon mega asi fand aber ich habe halt nichts geschrieben da es 4 Premades waren und ich keine dicke Lippe riskieren wollte. Also haben sie in der Ban phase die ganze zeit Udyr gezeigt welchen das gegnerische Team dann auch schlie&szlig;endlich gebannt haben. Nat&uuml;rlich war ich in dem Augenblick schon sauer aber da ich schon mehrmals (3 mal) den 2 Wochen Ban wohl verdient bekommen hatte wollte ich diesmal nicht &uuml;bertreiben bzw. beleidigend werden. Ich habe ihnen auch gesagt das ich nur Udyr gut spielen kann. Als wir dann ingame waren und ich Xin spielen wollte habe ich mich zun&auml;chst aufs farmen konzentriert da ich jetzt nicht umbedingt der beste Xin spieler bin. Ich habe mehrmals versucht zu ganken woran ich auch gescheitert bin. Dann fing das permanente flamen von den 4 Premades an welche mir den ganzen jungle farm gestohlen haben, mich zu gepingt haben und mir sogar gedroht haben was das ich &quot;9 x reportertet&quot; werde da ich ja nicht ganke und es ja anscheinend verdient habe. Allgemein habe ich mich zu letzt dann doch wieder zu viel im Chat beschwert das ich von 4 man im Chat bel&auml;stigt werde und das sie mich halt daf&uuml;r blamen wollen das wir verlieren. Ich habe weder eine Nachricht bekommen das sich mein Verhalten verschlechtert noch einen Chatban oder Rankedban ich wurde von jetzt auf die n&auml;chste Sekunde vom System (permanent) gebannt. Wurde oft genug als Troll bezeichnet und das ich doch &quot;%%%%%%&quot; bekommen sollte. Anfangs bin ich nicht drauf eingegangen aber ja Riot kann mir ja wohl schwer erz&auml;hlen das ich 2 Games davor ne Meldung bekomme das sich mein Verhalt verbessert hat (da ich nur noch mit Freunden gespielt habe) und dann aus dem nichts ohne Vorwarnung einfach permagebannt werde. Hier ist mein &quot;so &uuml;bler&quot; Chat log wozu ich noch Randinfos schrieben werde :\r\nGame 1\r\nSeeRoyb&auml;r: tnx for banning udyr tho (all chat an die gegner nicht an mein Team ! )\r\nSeeRoyb&auml;r: now i hv to play the general (general nickname f&uuml;r xin)\r\nSeeRoyb&auml;r: im no wanna be ( hier sagte der gegnerische TF das ich ein wanna be Trick sei wodrauf ich mit Spa&szlig; geantwortet habe)\r\nSeeRoyb&auml;r: trick is a wanna be of me\r\nSeeRoyb&auml;r: the xin buff is delicios ( patchnotes 6.3 xin)\r\nSeeRoyb&auml;r: they want my red\r\nSeeRoyb&auml;r: blue card lol ( da hatte mich der gegnerische TF mit ner blue anstatts ner yellow beschmissen was mir das leben rette und das war im teamchat)\r\nSeeRoyb&auml;r: mad emy day\r\nSeeRoyb&auml;r: ward the river\r\nSeeRoyb&auml;r: as i said\r\nSeeRoyb&auml;r: i am (wiederholt das ich nur Udyr gut spielen kann da sie da angefangen haben mich zu 4. zu flamen)\r\nSeeRoyb&auml;r: a\r\nSeeRoyb&auml;r: one\r\nSeeRoyb&auml;r: trick\r\nSeeRoyb&auml;r: pony\r\nSeeRoyb&auml;r: dont bait a udyr ban nxt time\r\nSeeRoyb&auml;r: its ur bad not mine\r\nSeeRoyb&auml;r: i ( hier drohen sie mir den 9 mal Report da ich nicht in meiner Bestform gespielt habe)\r\nSeeRoyb&auml;r: dont\r\nSeeRoyb&auml;r: care\r\nSeeRoyb&auml;r: xD\r\nSeeRoyb&auml;r: u baited the ban\r\nSeeRoyb&auml;r: reporine (hier meine ich das ich thresh reporte da er mich flamet wie sonst was im all chat sowie im Teamchat)\r\nSeeRoyb&auml;r: o\r\nSeeRoyb&auml;r: lol\r\nSeeRoyb&auml;r: pres\r\nSeeRoyb&auml;r: amde my dame\r\nSeeRoyb&auml;r: well riot wont do shit ( hier meinte ich das Riot mich ja nicht bannt da ich ja nicht gemacht habe)\r\nSeeRoyb&auml;r: but they ll prolly ban u for this blaimng buddy go on &lt;3 ( hier wollte ich ihn den Tipp geben aufzuh&ouml;ren zu flamen da es nix bringt)\r\nSeeRoyb&auml;r: u re ruining ur own game ( da er in den Promos war und nur schreibt,schreibt,schreibt)\r\nSeeRoyb&auml;r: epic follow up\r\nSeeRoyb&auml;r: lol ( hier bin ich helfen gekommen und sie lassen mich einfach sterben und pingen auf mich )\r\nSeeRoyb&auml;r: report\r\nSeeRoyb&auml;r: np\r\nSeeRoyb&auml;r: get banned (hier sage ich nur das er gebannt werden kann da er selber sehr viel schreibt bzw. einfach spammt)\r\nSeeRoyb&auml;r: no wards\r\nSeeRoyb&auml;r: and flaming\r\nSeeRoyb&auml;r: lal (no wards + flaming meinte ich weil er mich blamet nicht den Drachen bekommen zu haben obwohl ich keine Vision auf den Drake hatte)\r\nSeeRoyb&auml;r: much fun in bronze (sorry das ich hier mal selber w&uuml;tend wurde aber much fun in bronze kann ja wohl echt nicht als Beleidigung angesehen werden da es sich nur um eine weitere elo handlet)\r\nSeeRoyb&auml;r: u baited my udyr ban ^^\r\nSeeRoyb&auml;r: u did\r\nSeeRoyb&auml;r: why u even talk with me ( hier wollte ich sie dazu bringen aufzuh&ouml;ren zu schrieben da sie auch nicht viel besser waren)\r\nSeeRoyb&auml;r: if u aitn paly any better\r\nSeeRoyb&auml;r: yap\r\nSeeRoyb&auml;r: idc\r\nSeeRoyb&auml;r: xD\r\nSeeRoyb&auml;r: steal my jngf\r\nSeeRoyb&auml;r: go on\r\nSeeRoyb&auml;r: i dont troll (all chat)\r\nSeeRoyb&auml;r: but these premades want to take my whole jng (all chat da tf fragt warum sie mich Troll nennen)\r\nSeeRoyb&auml;r: so they should go on\r\nSeeRoyb&auml;r: they wanna lose\r\nSeeRoyb&auml;r: sure\r\nSeeRoyb&auml;r: 4 deaths jesus christ ( da ich 4 mal gestorben war und sie mega &uuml;bertrieben haben deswegen)\r\nSeeRoyb&auml;r: 4 premades\r\nSeeRoyb&auml;r: hahaha\r\nSeeRoyb&auml;r: sweet kids\r\nSeeRoyb&auml;r: cant play on their own\r\nSeeRoyb&auml;r: and cant even speak any english ( hier war ich einfach sauer da sie mich auf spanisch beleidigt haben und ich spreche zuf&auml;llig auch spanisch)\r\nSeeRoyb&auml;r: i do i do ( es geht um wards usen)\r\nSeeRoyb&auml;r: ppl which wanna steal my jng creeps\r\nSeeRoyb&auml;r: are pathetic ( hier stelle ich im all chat nur nochmal heraus das ich nix damit am Hut habe das ich keine stacks auf dem Devoure habe)\r\nSeeRoyb&auml;r: report everybody hahaha ( weil sie sich anfingen gegenseitig zu flamen und ich das einfach nur l&auml;cherlich fand)\r\nSeeRoyb&auml;r: omfg\r\nSeeRoyb&auml;r: pathetic\r\nSeeRoyb&auml;r: liss\r\nSeeRoyb&auml;r: dont act liek this\r\nSeeRoyb&auml;r: u re one of dem\r\nSeeRoyb&auml;r: u re one of this flamers ( weil Liss im all chat so getan hatte als ob sie mich nicht beleidigt h&auml;tte (sie ist eine verb&uuml;ndete))\r\nSeeRoyb&auml;r: and i ll threat u as one of dem ( da ich sie daf&uuml;r dann auch reporten werde)\r\nSeeRoyb&auml;r: well not much than flaming me for sure ( hier stellen sie sich wieder als Helden als/White Knights im all chat da und sagen das sie ja auch schlecht seien bla bla bla und ich mich einfach nru damit rechtfertige das sie mich nur flamen)\r\nSeeRoyb&auml;r: just coz im playing a scaling jng doesnt mean i troll (ich habe halt xin gespielt und brauchte meine stacks deswegen scaling)\r\nSeeRoyb&auml;r: thats pathetic\r\nSeeRoyb&auml;r: and low elo thougths ( da sie denken das ich gebannt werde nur weil ich schei&szlig;e spiele ... naja so unrecht hatten sie ja nicht)\r\nSeeRoyb&auml;r: scalin !!!!!\r\nSeeRoyb&auml;r: it aint as this hard to understand\r\nSeeRoyb&auml;r: its like vayne\r\nSeeRoyb&auml;r: farming untiil she got her stuff ( die erkl&auml;rung was ich eigentlich meine mit scaling da sie so tuen als ob sie es nicht raffen)\r\nSeeRoyb&auml;r: but ya\r\nSeeRoyb&auml;r: gg (naja)\r\n\r\nAllgemein ist es ne Schweinerei das ich wegen 4 Vollpfosten gebannt werde und das permanent und ohne Vorwarnung. Ich habe mich echt angestrengt mein Verhalten gerecht des Beschw&ouml;rerpfades anzupassen werde aber trotzdem gebannt obwohl ich davor noch gelobt werde das sich mein Verhalten gebessert hatte! Jetzt habe ich mich ehrlich gesagt gefreut das ich ein Neustart diese Season machen kann {{item:3070}}  werde aber einfach weggebannt von irgend einem Computersystem das sich nicht mal anschaut was ich sage oder warum sondern nur sieht oh 4 Reports das bedeutet nen Bann. Habe jetzt echt viel Geld und Liebe in diesen Account gepackt und habe nach dem mehrmaligen gerechten gebannt werden auch echt versucht mich zu bessern  aber anscheinend sieht das ja das Computerprogramm anders. Ich hoffe, dass sich das hier vielleicht irgendjemand vom Support durchliest und was machen kann wenn nicht ist es ja sch&ouml;n das man bei dem Support anrufen kann ... oder warte mal... stimmt das geht ja gar nicht ! Ich verlier einfach meine ganzen Skins und das Geld was ich investiere ohne ne Chance zu bekommen das zu kl&auml;ren. Was mich au&szlig;erdem st&ouml;rt ist das ich durch eine Runde &quot;flamen&quot; gebannt werde. Bei den letzten bans habe ich echt 4,5 Runden geflamet und ich meine wirklich geflamet und wurde daraufhin mit Vorwarnung gebannt.\r\n\r\nPs: Riot hatte mich schon mal eine Woche fr&uuml;her von einem Ban wegen sowas befreit da ich auch damals zu unrecht gebannt wurde und habe ohne jegliche Meldung nach einer Woche in einem 2 Wochenban wieder spielen d&uuml;rfen.\r\n\r\n(bin um jede vern&uuml;nftige Antwort dankbar und vielleicht habt ihr ja Tipps wie ich mich beim Riot Support melden kann ohne Monate auf eine Antwort zu warten in dem ich ein Ticket ziehen muss)\r\n\r\nM.f.G. Roy Omoregie {{champion:77}}","replies":[{"poster":"Waldschrat86","date":"2016-02-10T16:33:56.124+0000","up_votes":6,"down_votes":0,"body":"Wie kommst du auf zu Unrecht? Lies dir mal die gute-Nacht-Lektüre durch die du fabriziert hast.\nDann sagst du noch du hättest schon 3-Mal 2 Wochnbanne insgesamt erhalten.\nWow einfach nur wow.\n\n>da sie denken das ich gebannt werde nur weil ich scheiße spiele ... naja so unrecht hatten sie ja nicht\n\nJa genau war wegen schlechter Perfomance, das glaubst du wirklich oder?\n\nDu blamest die ganze Zeit und gehst auf deren BS ein. Sorry 0 Mitleid mit deiner Vorgeschichte.\nDer Mutebutton ist dir auch unbekannt? Naja wolltest du sicher nicht, immerhin hättest du dann ja etwas flame verpassen können.\n\nAchja und warum genau, lässt du dich auf solche Diskussionen ein, wenn du selber glaubst Premades hätten besondere Macht und jeder Furz führt zu Banns?\nGlaubtest du selbst daran, hättest du gemutet/ignoriert und reportet. Fertig.\n\nSo machen das übrigens fast alle Leute ohne Bann und das mit ziemlichem Erfolg.\n\nNaja vlt. hast du Glück und es greift zeitlich, dass du deinen 4. (!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!-2 Wochen-Bann stattdessen bekommst.\nAber ich geh mal davon aus , dass ab dem auf eine Woche verkürtem gezählt wird das war dein letzter Warnschuss, auch noch mit ner Woche Kulanz obendrauf. Denn unberechtigt war der auch nicht, sönst wär er aufgehoben und nicht nur verkürzt worden.\n\nNutz die Chance, falls sie sie dir tatsächlich geben, falls nicht, hör bitte ganz mit LoL auf. Danke.","replies":[]},{"poster":"p0hil","date":"2016-02-10T16:42:20.940+0000","up_votes":5,"down_votes":0,"body":"SeeRoybär: tnx for banning udyr tho (all chat an die gegner nicht an mein Team ! )\nSeeRoybär: now i hv to play the general (general nickname für xin)\nSeeRoybär: im no wanna be ( hier sagte der gegnerische TF das ich ein wanna be Trick sei wodrauf ich mit Spaß geantwortet habe)\nSeeRoybär: trick is a wanna be of me\nSeeRoybär: the xin buff is delicios ( patchnotes 6.3 xin)\nSeeRoybär: they want my red\nSeeRoybär: blue card lol ( da hatte mich der gegnerische TF mit ner blue anstatts ner yellow beschmissen was mir das leben rette und das war im teamchat)\nSeeRoybär: mad emy day\nSeeRoybär: ward the river\nSeeRoybär: as i said\nSeeRoybär: i am (wiederholt das ich nur Udyr gut spielen kann da sie da angefangen haben mich zu 4. zu flamen)\nSeeRoybär: a\nSeeRoybär: one\nSeeRoybär: trick\nSeeRoybär: pony\nSeeRoybär: dont bait a udyr ban nxt time\nSeeRoybär: its ur bad not mine {{summoner:14}} \nSeeRoybär: i ( hier drohen sie mir den 9 mal Report da ich nicht in meiner Bestform gespielt habe)\nSeeRoybär: dont\nSeeRoybär: care\nSeeRoybär: xD\nSeeRoybär: u baited the ban\nSeeRoybär: reporine (hier meine ich das ich thresh reporte da er mich flamet wie sonst was im all chat sowie im Teamchat)\nSeeRoybär: o\nSeeRoybär: lol\nSeeRoybär: pres\nSeeRoybär: amde my dame\nSeeRoybär: well riot wont do shit ( hier meinte ich das Riot mich ja nicht bannt da ich ja nicht gemacht habe)\nSeeRoybär: but they ll prolly ban u for this blaimng buddy go on <3 {{summoner:14}}  ( hier wollte ich ihn den Tipp geben aufzuhören zu flamen da es nix bringt)\nSeeRoybär: u re ruining ur own game ( da er in den Promos war und nur schreibt,schreibt,schreibt)\nSeeRoybär: epic follow up {{summoner:14}} \nSeeRoybär: lol ( hier bin ich helfen gekommen und sie lassen mich einfach sterben und pingen auf mich )\nSeeRoybär: report {{summoner:14}} \nSeeRoybär: np\nSeeRoybär: get banned (hier sage ich nur das er gebannt werden kann da er selber sehr viel schreibt bzw. einfach spammt)\nSeeRoybär: no wards\nSeeRoybär: and flaming\nSeeRoybär: lal (no wards + flaming meinte ich weil er mich blamet nicht den Drachen bekommen zu haben obwohl ich keine Vision auf den Drake hatte)\nSeeRoybär: much fun in bronze (sorry das ich hier mal selber wütend wurde aber much fun in bronze kann ja wohl echt nicht als Beleidigung angesehen werden da es sich nur um eine weitere elo handlet) {{summoner:14}} \nSeeRoybär: u baited my udyr ban ^^\nSeeRoybär: u did\nSeeRoybär: why u even talk with me ( hier wollte ich sie dazu bringen aufzuhören zu schrieben da sie auch nicht viel besser waren)\nSeeRoybär: if u aitn paly any better\nSeeRoybär: yap\nSeeRoybär: idc\nSeeRoybär: xD\nSeeRoybär: steal my jngf {{summoner:14}} \nSeeRoybär: go on\nSeeRoybär: i dont troll (all chat)\nSeeRoybär: but these premades want to take my whole jng (all chat da tf fragt warum sie mich Troll nennen)\nSeeRoybär: so they should go on\nSeeRoybär: they wanna lose\nSeeRoybär: sure\nSeeRoybär: 4 deaths jesus christ ( da ich 4 mal gestorben war und sie mega übertrieben haben deswegen)\nSeeRoybär: 4 premades\nSeeRoybär: hahaha\nSeeRoybär: sweet kids {{summoner:14}} \nSeeRoybär: cant play on their own {{summoner:14}} \nSeeRoybär: and cant even speak any english {{summoner:14}}  ( hier war ich einfach sauer da sie mich auf spanisch beleidigt haben und ich spreche zufällig auch spanisch)\nSeeRoybär: i do i do ( es geht um wards usen)\nSeeRoybär: ppl which wanna steal my jng creeps\nSeeRoybär: are pathetic ( hier stelle ich im all chat nur nochmal heraus das ich nix damit am Hut habe das ich keine stacks auf dem Devoure habe)\nSeeRoybär: report everybody hahaha {{summoner:14}}  ( weil sie sich anfingen gegenseitig zu flamen und ich das einfach nur lächerlich fand)\nSeeRoybär: omfg {{summoner:14}} \nSeeRoybär: pathetic\nSeeRoybär: liss\nSeeRoybär: dont act liek this\nSeeRoybär: u re one of dem\nSeeRoybär: u re one of this flamers ( weil Liss im all chat so getan hatte als ob sie mich nicht beleidigt hätte (sie ist eine verbündete))\nSeeRoybär: and i ll threat u as one of dem ( da ich sie dafür dann auch reporten werde)\nSeeRoybär: well not much than flaming me for sure ( hier stellen sie sich wieder als Helden als/White Knights im all chat da und sagen das sie ja auch schlecht seien bla bla bla und ich mich einfach nru damit rechtfertige das sie mich nur flamen)\nSeeRoybär: just coz im playing a scaling jng doesnt mean i troll (ich habe halt xin gespielt und brauchte meine stacks deswegen scaling)\nSeeRoybär: thats pathetic\nSeeRoybär: and low elo thougths {{summoner:14}}  ( da sie denken das ich gebannt werde nur weil ich scheiße spiele ... naja so unrecht hatten sie ja nicht)\nSeeRoybär: scalin !!!!!\nSeeRoybär: it aint as this hard to understand \nSeeRoybär: its like vayne\nSeeRoybär: farming untiil she got her stuff ( die erklärung was ich eigentlich meine mit scaling da sie so tuen als ob sie es nicht raffen)\nSeeRoybär: but ya\nSeeRoybär: gg (naja)\n\nJedes {{summoner:14}} steht für, meiner Meinung, nach für toxisches, provokatives oder unnötiges Verhalten.\nDazu, zu einem Report aufzurufen, ist auch strafbar.\n\nDazu, deine angesprochenen vorherigen Banns waren die Vorwarnung ! Du hast aber anscheinend auch nicht daraus gelernt.\nPermabanns werden nicht einfach von einem System reingeknallt, sondern bei jedem Permabann schaut sich das ein RIOT Mitarbeiter an. Sollte er dann irgendwas auffälliges sehen, ist die Sache für ihn abgehakt.\n\nNiemand hat dich gezwungen Geld zu investieren. Es ist ein F2P Titel. Niemand zwingt dich dazu. \nDazu, ein Supportticket dauert nur lange, wenn du andauernd neue Kommentare dazu schreibst, ohne das du vorher eine Antwort auf deine allgemeine Frage bekommen hast.\nEin Supporter schreibt innerhalb von 24 Stunden zurück, das sind meine Erfahrungen und noch nie wurde ich enttäuscht.\n\nmfg\n\n{{sticker:slayer-jinx-wink}}","replies":[{"poster":"Parunpata","date":"2016-02-10T23:48:49.931+0000","up_votes":1,"down_votes":0,"body":"> Permabanns werden nicht einfach von einem System reingeknallt, sondern bei jedem Permabann schaut sich das ein RIOT Mitarbeiter an.\n\nHey, ist das wirklich so oder ist das nur ein Gerücht das irgendwo rumschwirrt? Sprich gibt es einen Kommentar von Riot dazu? Ernstgemeinte Frage, no flame {{summoner:13}}","replies":[{"poster":"p0hil","date":"2016-02-10T23:59:40.068+0000","up_votes":1,"down_votes":0,"body":"Die Daten hab ich von einem Mod aus dem Forum. Wäre seltsam wenn er lügen würde.\nAusserdem gilt es bei einem Permabann eben um eine permante Sperrung eines Spielers. Da gehört mehr Kontrolle dazu als nur ein Computer.\n\nmfg\n\n{{sticker:slayer-jinx-wink}}","replies":[{"poster":"Rainbow Dashie","date":"2016-02-11T00:52:05.819+0000","up_votes":2,"down_votes":0,"body":"soweit ich das mitbekommen habe macht Riot das wohl bei jedem Ban also auch dem 14 Tage. So wie sie es damals schon zu Tribunal Zeiten noch gemacht haben.","replies":[]}]}]}]},{"poster":"Freiherr Alex","date":"2016-02-24T07:45:36.799+0000","up_votes":1,"down_votes":3,"body":"Am meisten mag ich ja die Antworten in denen die leute Wahllos mit {{summoner:14}} Markieren was ein Flame sein soll...\nDa muss man dann schon manchmal schmunzeln :)","replies":[{"poster":"clair de lune289","date":"2016-02-24T07:52:02.263+0000","up_votes":5,"down_votes":1,"body":"die Makierungen sind nicht wahllos,sie sind im Normalfall sogar recht genau was Flame/negatives Verhalten angeht.\nWenn du das nicht erkennst und davon überzeugt bist das es wahllos wäre,bist du vielleicht unser nächster perma Kandidat.","replies":[{"poster":"Freiherr Alex","date":"2016-02-24T08:11:15.519+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=clair de lune289,realm=EUW,application-id=KYnfKGf0,discussion-id=pX3YpsnE,comment-id=000b0000,timestamp=2016-02-24T07:52:02.263+0000)\n>\n> die Makierungen sind nicht wahllos,sie sind im Normalfall sogar recht genau was Flame/negatives Verhalten angeht.\n> Wenn du das nicht erkennst und davon überzeugt bist das es wahllos wäre,bist du vielleicht unser nächster perma Kandidat.\n\nNett dass du dir Gedanken um mich machst, aber **so viel Zeit **würde ich NIE mit Sinnlosem getippsel in nem Game verbringen :D\nAuch wenn es mir nicht nur in diesem Thread um das muntere Markieren geht, willst du mir ernsthaft weis machen dass ein bezugloses \"epic follow up\" z.B. unbedingt ein Flame sein muss? Ergo wahllos... Es gab schon mehrere solcher Dinger in denen die Leute Sachen wie \"GG -Champ X-\" als Flame markiert haben...Wenn du jetzt sagst das das Toxisch ist, OK...dann wäre es also in Ordnung nach jedem Spiel 90% der Spieler zu Reporten weil man GG zum Schluss schreibt?\n\nedit: Ich sage nicht dass das alles Falsch ist, ich sage lediglich dass die Leute dazu neigen mehr einzubauen als da ist...worüber ich mich gut Amüsieren kann...","replies":[{"poster":"Waldschrat86","date":"2016-02-24T12:28:27.016+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=seipelsche,realm=EUW,application-id=KYnfKGf0,discussion-id=pX3YpsnE,comment-id=000b00000000,timestamp=2016-02-24T08:11:15.519+0000)\n>\n> Nett dass du dir Gedanken um mich machst, aber **so viel Zeit **würde ich NIE mit Sinnlosem getippsel in nem Game verbringen :D\n> Auch wenn es mir nicht nur in diesem Thread um das muntere Markieren geht, willst du mir ernsthaft weis machen dass ein bezugloses \"epic follow up\" z.B. unbedingt ein Flame sein muss? Ergo wahllos... Es gab schon mehrere solcher Dinger in denen die Leute Sachen wie \"GG -Champ X-\" als Flame markiert haben...Wenn du jetzt sagst das das Toxisch ist, OK...dann wäre es also in Ordnung nach jedem Spiel 90% der Spieler zu Reporten weil man GG zum Schluss schreibt?\n> \n> edit: Ich sage nicht dass das alles Falsch ist, ich sage lediglich dass die Leute dazu neigen mehr einzubauen als da ist...worüber ich mich gut Amüsieren kann...\n\nNaja dene 2 \"wahllosen Markierungen lassen sich sarakstisch deuten oder wörtlich, wörtlich hast du sicherlich recht, aber sarkastisch entspricht beides der negativen Einstellung bzw. Blame.\nDie Sache ist nur, wörtlich gemeint, triggern solche Kommentare keine Reports.\nAußerdem ist mir hier noch kein Chatlog untergekommen in dem soetwas als einzig negatives Verhalten vorhanden gewesen wäre.","replies":[]},{"poster":"Rainbow Dashie","date":"2016-02-24T10:35:13.431+0000","up_votes":2,"down_votes":1,"body":"es ist ja auch so super positiv nach nem fehlgeschlagenem Gank gg oder gj zu dem Jungler zu schreiben.\n\nOder wenn wer first blood aus deinem Team abgegeben hat gg zu schreiben. Das ist auch negatives Verhalten.\n\nIch bin auch jemand der Texte markiert. Dank einem starken Missverständnis habe ich aber auch schon gemerkt das man durchaus Flame und Negatives Verhalten auch beim markieren trennen muss, damit die Leute das verstehen.","replies":[]},{"poster":"clair de lune289","date":"2016-02-24T08:43:15.155+0000","up_votes":2,"down_votes":1,"body":"Du Unterschätzt das Chatanalysetool\nEs erkennt Sarkasmus am Kontext und dem Spielgeschehen\nz.B. ein \"gj champ xxx\" weil er grade gestorben ist wird als negatiives Verhalten erkannt\n\nIm Allchat kann \"GG Champ XXX\" ebenfalls als negatives Verhalten gewertet werden.Der Spieler wirft den Gegner vor \"unfähig\" zu sein und es sei allein der Champ der ihn gewinnen lässt.\nIch streite nicht ab das es champs gibt die zu stark sind (mMn),dennoch ist eine solche Mitteilung in keinster weise für das Spiel förderlich.\n\nDein Beispiel mit dem \"epic follow up\" ist eben **_nicht_** bezuglose. Es ist etwas im spiel passiert und wenn der entsprechende Spieler bereits Sachen wie \" you are so bad\" etc geschrieben hat,kannst du davon ausgehen das wieder etwas Fehlgeschlagen ist.","replies":[]}]}]}]},{"poster":"Z3ndom","date":"2016-02-12T09:42:48.707+0000","up_votes":3,"down_votes":0,"body":"Irgendwie ist jeder Ban berechtigt.\nOb man es nicht schlimm findet, was man sagt ist nicht wichtig.Was andere darüber denken,ist was den Ban rechtfertigt.\nIch habe bspw. auch nach meinem Perma rumgemeckert(bin nicht sicher,aber ich denke jeder der in dieser Position ist,wird natürlicherweise alles versuchen,sich zu rechtfertigen) und gesagt,dass nur weil ich 2 Stufen geskipped habe nach einem einzigem Game,dass ich keinen 2-Wochen-Ban,der um eine Woche reduziert wurde,verdient habe und im Endeffekt auch den Perma erst später bekommen hätte müssen.\nAm Ende ist es egal.Solange kein technischer Fehler vorliegt,brauchst du nichts zu versuchen.Der Perma ist berechtigt,wenn man flamed.\nMein Tipp:Lebe damit.Mach einfach weiter und lerne aus dem Verlust.Du hast die Regeln akzeptiert und man hat dir ganz klar weisgemacht,was passiert,wenn du dich nicht dran hälst.\nAlso akzeptiere einfach die Strafe.Ist weitaus einfacher.","replies":[]},{"poster":"Der Großmugister","date":"2016-02-10T17:06:55.006+0000","up_votes":3,"down_votes":0,"body":"Erstmal Das was mir besonders unter den Nägeln brennt: Die, anscheinend ja, diversen 14-Tage-Banns waren deine Vorwarnung, normalerweise bekommt man so einen nur ein einziges Mal und dann ist der Perma fällig, du hattest also eher noch Glück!\nZu sagen du wärst nicht vorgewarnt worden, ist einfach nur Quark!\nSoviel dazu...\n\nSollte der Chatlog vollständig sein, ist das der erste Fall bei dem ich sagen würde, dass eine Strafe übertrieben ist.\nIm Teamchat zu sagen, dass Gegner schlecht sind, sollte erlaubt sein, ich mache das auch gerne mal um die Moral zu stärken, wenn mal wieder einer meint, es wäre schon Alles verloren weil sein Lanegegner einen Kill gemacht hat. Ich sage dann Dinge wie \"Your Opponent plays well, but the rest of their team is rly bad, we can win this just keep playing save\", vielleicht hilft es, vielleicht auch nicht, aber es sollte definitiv nicht strafbar sein, wenn ich es nicht im Allchat schreibe und wenn das System das nicht erkennen sollte, ist das ein gewaltiges Problem.\n\nFür meinen Geschmack schreibst du eindeutig zu Viel und solltest dich lieber auf deine Leistung konzentrieren statt dich in sinnlose Diskussionen verstricken zu lassen, aber eine Labertasche sein ist, meines Wissens nach, erlaubt.\nVielleicht bin ich ja nur durch die anderen Chatlogs abgestumpft, aber obwohl ich dich nervig finde, würde ich sagen: Nicht Schuldig","replies":[{"poster":"Der Großmugister","date":"2016-02-10T17:12:55.707+0000","up_votes":1,"down_votes":0,"body":"Was den Support angeht, du wirst dich gedulden müssen.\nZuerst wirst du vorgefertigte Antworten bekommen, da musst du dann weiter nachfragen bis du an einen Mitarbeiter des PH´s weitergeleitet wirst.\n\nAntworte aber erst wieder, wenn Etwas vom Support kam, sonst gilt es wohl als neues Ticket und du musst länger warten, hab ich mal gehört.","replies":[]}]},{"poster":"Alustus","date":"2016-02-10T16:41:21.509+0000","up_votes":3,"down_votes":0,"body":"Ich sehe hier keinen Unrechtmäßigen Bann tut mir Leid.\n\nAuch wenn deine Mitspieler assi waren gibt es dir kein Recht, zu beleidigen usw.\n\n\n\n>  Bei den letzten bans habe ich echt 4,5 Runden geflamet und ich meine wirklich geflamet und wurde daraufhin mit Vorwarnung gebannt.\n\nDann kommt der Permabann ja nicht aus dem nichts.\n\nWesshalb ich folgendes :\n\n> \n> 4 Vollpfosten gebannt werde und das permanent und ohne Vorwarnung. \n\nnicht verstehen kann.\nAußerdem wurdest du nicht wegen den 4 Leuten gebannt sondern wegen deines Verhaltens.\n\nDummes aber meiner Meinung nach treffendes Beispiel:\n\nFrau betrügt Ehemann, Ehemann erschießt Ehefrau.\nEhemann  regt sich drüber auf dass er wegen seiner Frau bestraft wird.\n\nso in etwa liest sich dein Text für mich\n\n> \n> Ps: Riot hatte mich schon mal eine Woche früher von einem Ban wegen sowas befreit da ich auch damals zu unrecht gebannt wurde und habe ohne jegliche Meldung nach einer Woche in einem 2 Wochenban wieder spielen dürfen.\n\nDieser bann ist damals wegen eines Fehlers im System aufgetreten und hat toxische Spieler härter als gewollt bestraft (aber nicht zu unrecht)\nNachem Riot das erkannt hat wurden die Strafen aufgehoben.\n\nDa momentan aber kein Fehler bekannt ist, und dein Chatverauf mMn Bannwürdig ist, denke ich nicht das du darauf hoffen kannst.","replies":[]},{"poster":"SeeRoybär","date":"2016-02-10T17:09:47.224+0000","up_votes":1,"down_votes":3,"body":"Hallo nochmal,\nerstmal danke das ihr alle so (halbwegs) nett geantwortet habt aber was ihr mir erzählt ist mir nicht ganz klar geworden. Ihr sagt mir also das es das Rechte ist wenn man so lange seinen Mund hält bis man einfach die Runde durch den ganzen Flame verliert und die typen dann ungestraft davon kommen und dann zu viert im nächsten Game den nächsten fertig machen? Früher konnte ich ja echt nicht nachvollziehen warum meine Freunde mit League aufhören aber langsam wird es mir einfach echt zu kindisch mit dem Spiel.\ntrotzdem Danke Leute","replies":[{"poster":"p0hil","date":"2016-02-10T17:13:40.903+0000","up_votes":3,"down_votes":0,"body":"Nein, du hälst dich in der Runde einfach zurück, und reportest die Spieler einfach wo du denkst das sie sich falsch verhalten haben. Am besten schreibst du aber auch was in die Reportbeschreibung rein, anstatt einfach nur ein leeres Feld dort stehen zu lassen.\n\nmfg\n\n{{sticker:slayer-jinx-wink}}","replies":[{"poster":"SeeRoybär","date":"2016-02-11T09:09:32.340+0000","up_votes":1,"down_votes":6,"body":"Also ist kritisieren schon zu viel des Guten ? mhhh","replies":[{"poster":"SorisDynasty","date":"2016-02-11T09:55:30.588+0000","up_votes":3,"down_votes":0,"body":"Ungefragtes Kritisieren, ja.\nSich mit schlechter Wortwahl zu wehren ebenfalls.","replies":[{"poster":"SeeRoybär","date":"2016-02-11T10:13:40.889+0000","up_votes":1,"down_votes":4,"body":"Also muss ich erst den jenigen fragen ob ich ihn kritisieren darf der mir den Tod durch Krebs wünscht ? Und wenn er noch einverstanden ist ? Ich verstehe den Sinn des Terms \"ungefragtes kritisieren\" nicht ... Kritik sollte an keine Regelung gebunden sein solange  sie konstruktiv ist. Trotzdem danke ","replies":[{"poster":"SorisDynasty","date":"2016-02-11T10:17:06.859+0000","up_votes":3,"down_votes":0,"body":"Nein, den Spieler reportest du einfach nur. Ich habe Kritik als \"You play so bad omg\" jetzt wahrgenommen gehabt und ähnliches. Das ist nicht erwünscht.\nGanz ehrlich, was hilft es dir, wenn du andere Menschen im Spiel kritisieren willst? Es lenkt dich vom Spiel ab. Der Typ, der dich sowieso schon beleidigt, wird sich die Kritik sowieso nicht zu Herzen nehmen, sie im besten Fall lediglich ignorieren. Im schlimmsten Fall beleidigt er dich aufgrund dessen weiter. Damit hast du ihm mehr Öl ins Feuer gegossen, sodass er euch beide weiterhin mit dem Chat ablenken kann.\n\nIch sehe einfach nicht, wie es dir hilft, den Flamer zu \"kritisieren\".","replies":[]}]}]},{"poster":"Sirrkas","date":"2016-02-11T09:51:15.787+0000","up_votes":3,"down_votes":0,"body":"Um ehrlich zu sein, habe ich noch keinen Chatlog gesehen, in dem jemand bloß wegen Kritik bestraft wurde. Hängt aber auch von der Definition von Kritik ab. Konstantes Blaming, vorhalten von Fehlern, Beleidigungen (etwas anderes war das hier nicht: \"sweet kids\") und dergleichen führen aber unweigerlich irgendwann zu einer Strafe.","replies":[{"poster":"SeeRoybär","date":"2016-02-11T10:17:30.436+0000","up_votes":1,"down_votes":4,"body":"Manche Worte sind wie gesagt nicht perfekt gewählt ... Trotzdem sehe ich meine Aussagen nicht als Grund zum ban.","replies":[{"poster":"p0hil","date":"2016-02-11T12:13:33.792+0000","up_votes":2,"down_votes":0,"body":"Klar, eben weil sie nicht perfekt gewählt sind wurdest du gebannt. Und anscheinend hattest du ja auch schon einen 14 Tage Bann. Und in dieser 14 Tage-Bann-EMail stand mit drin das dies eine Vorwarnung ist, da die nächste Strafe die permanente Sperrung bedeutet.\n\nmfg\n\n{{sticker:slayer-jinx-wink}}","replies":[]},{"poster":"HyperionCH","date":"2016-02-11T11:11:05.982+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=SeeRoybär,realm=EUW,application-id=KYnfKGf0,discussion-id=pX3YpsnE,comment-id=00070000000000000000,timestamp=2016-02-11T10:17:30.436+0000)\n>\n> Manche Worte sind wie gesagt nicht perfekt gewählt ... Trotzdem sehe ich meine Aussagen nicht als Grund zum ban.\n\nIst auch völlig egal, ob du dies nicht als Grund zum ban siehst.\n\nOffensichtlich ist es einer der Gründe, die zum ban führten.\nDie grosse Mehrheit hier im Forum ist auch dieser Meinung; also nicht nur das Chatanalyse-System.\n\nDie Mehrheit findest dies toxisch und dies solltest du akzeptieren.\nDu kannst sich natürlich weiterhin so verhalten, kriegst aber dann weiterhin bans für dieses Verhalten.","replies":[]}]}]}]}]},{"poster":"D4RKEVA","date":"2016-02-10T19:18:42.858+0000","up_votes":2,"down_votes":0,"body":"zu kindisch weil du nicht ruhig bleiben kannst und dann report willst?\n\nachja 4/9 reports sind genauso schlimm wie 1 NÄMLICH GAR NICHT solange du nichts böses schreibst (wie report xx)","replies":[]},{"poster":"HyperionCH","date":"2016-02-10T17:17:52.708+0000","up_votes":2,"down_votes":0,"body":"Warum kommst du darauf, dass die 4 Mates unbestraft davon kommen, wenn sie dich flamen?\n\nGerade du mit mehrmaligen 2-Wochen-bans und nun einem perma solltest wissen, dass das Reportsystem nicht nur Deko ist, sondern Flamer wirklich bestraft werden.\n\nZurückflamen bedeutet jedoch: Unrecht mit Unrecht verteidigen.\nDies kann nicht die Lösung sein.\n\nStört dich der Flame deiner Mates? Dann mute sie einfach, wenn du deren Verhalten nicht anders ignorieren kannst. Ein \"Re-Flaming\" ist keine Rechtfertigung.","replies":[{"poster":"SeeRoybär","date":"2016-02-11T09:07:45.974+0000","up_votes":1,"down_votes":5,"body":"Dann müsste ich jede Runde mindesten 2-4 Leute in meinen Team muten was für ein TEAM-SPIEL ja mega kontraproduktiv und paradox ist ... man muss also gegen das Team-spiel bzw. dein eigenes Team vorgehen um in einem Team-spiel Spaß zu haben alles klar ... und sag mir bitte wo du dich persönlich angegriffen gefühlt hättest wenn du dir meinen Chat durchliest ich kritisiere mehr als das ich irgendjemanden beleidige bzw rechtfertige ich mich eher und dafür bestraft zu werden ist aus meiner Sicht einfach nur  ... Naja was heute schon alles als flamen angesehen wird ... so gut wie alles was nicht positiv ist","replies":[{"poster":"HyperionCH","date":"2016-02-11T10:59:25.247+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=SeeRoybär,realm=EUW,application-id=KYnfKGf0,discussion-id=pX3YpsnE,comment-id=000700020000,timestamp=2016-02-11T09:07:45.974+0000)\n>\n> Dann müsste ich jede Runde mindesten 2-4 Leute in meinen Team muten was für ein TEAM-SPIEL ja mega kontraproduktiv und paradox ist ...\n\nSeltsam. Ich habe wirklich sehr, sehr selten Flamer im Team.\nVielleicht solltest du dein Verhalten überdenken. Denn dass du so viel mehr Flamer hast als ich, muss mit deinem Verhalten zusammenhängen. Denn dies ist die einzige Variable.\n\n> man muss also gegen das Team-spiel bzw. dein eigenes Team vorgehen um in einem Team-spiel Spaß zu haben alles klar ... \n\nDeine Einstellung ist offensichtlich falsch. Dies erklärt vielleicht auch, warum du offenbar mehr Flamer im Spiel hast als ich.\n\n> und sag mir bitte wo du dich persönlich angegriffen gefühlt hättest wenn du dir meinen Chat durchliest ich kritisiere mehr\n\nDestruktive Kritik fördert negative Teamstimmung; somit verboten.\n\n> als das ich irgendjemanden beleidige\n\nNur weil du etwas anderes Verbotenes mehr mache, rechtfertigt dies keine Beleidigungen. Da besteht eine Null-Toleranz.\n\n> bzw rechtfertige ich mich eher \n\nIch frage es immer - also nicht nur dich -, da es mich sehr interessiert:\n\nWarum rechtfertigst du dich gegenüber einem Flamer? Was erwartest du dir davon?\n\nEin Flamer wird gerade ingame kaum einsichtig sein. Man wird ihn somit nur noch wütender machen, was dem Spiel nicht gut tut. \n\n> und dafür bestraft zu werden ist aus meiner Sicht einfach nur  ... Naja was heute schon alles als flamen angesehen wird ... so gut wie alles was nicht positiv ist\n\nNein, alles was negativ ist, gilt als Flaming/Blaming/negatives Verhalten.\nDavon hattest du genug (\"omfg\", \"pathetic\", etc.).\n\nDu wurdest mehrmals bestraft. Damit hättest du lange vorher erkennen können, dass ein solches Verhalten nicht in Ordnung ist. Leider hast du nichts getan, um dies zu ändern.","replies":[]}]}]},{"poster":"Der Großmugister","date":"2016-02-10T17:16:59.031+0000","up_votes":2,"down_votes":0,"body":"Kindisch ist es auf den Mumpitz einzugehen.\nDu kannst sie nach dem Spiel reporten und gut ist, alles Andere bringt Nichts, außer dass du dich dadurch vielleicht etwas stärker fühlst, aber das ist ein Trugschluss.\nSelbstbeherrschung ist wahre Stärke, auf Kindereien eingehen zu müssen, eine Schwäche.","replies":[]}]},{"poster":"SeeRoybär","date":"2016-02-10T17:40:05.794+0000","up_votes":1,"down_votes":8,"body":"also ob ich nun entbant werde oder nicht interessiert mich dann doch nicht so ich denke das ich mich dann hiermit von League verabschiede. Ich habe echt keine Lust auf dieses System in dem ich als einzelner behandelt werde obwohl meine Aussagen ja nicht aus dem nichts kommen das es sich hierbei immer noch um ein Team-spiel handelt. Ihr habt mir zwar gezeigt das manche Aussagen nicht so knorke waren aber das ich für sowas meinen ganzen Account verlieren kann ist mir dann doch schon zu lächerlich... ganz besonders wenn man vergleich durch welche Tortur man manchmal durch Runden geht und im nächsten Game direkt wieder den gleich \"Kollegen\" im Team habt unbestraft und wohl erhalten... die meisten  werden mich wahrscheinlich einfach als Idioten bezeichnen aber ich sehe darin keinen Sinn sich jetzt mal metaphorisch  gesehen erst verprügeln zu lassen bevor man sich melden darf... Na klar kann ich die Leute muten aber im Endeffekt müsste ich dann ja jede Runde jeden muten was für mich in einem Team-spiel sowas von Kontraproduktiv und paradox finde das mir das einfach zu lächerlich ist. \nDanke Leute für die halbwegs gescheite Hilfe","replies":[{"poster":"Streifi","date":"2016-02-11T05:41:53.935+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=SeeRoybär,realm=EUW,application-id=KYnfKGf0,discussion-id=pX3YpsnE,comment-id=0008,timestamp=2016-02-10T17:40:05.794+0000)\n>\n> also ob ich nun entbant werde oder nicht interessiert mich dann doch nicht so ich denke das ich mich dann hiermit von League verabschiede. Ich habe echt keine Lust auf dieses System in dem ich als einzelner behandelt werde obwohl meine Aussagen ja nicht aus dem nichts kommen das es sich hierbei immer noch um ein Team-spiel handelt. Ihr habt mir zwar gezeigt das manche Aussagen nicht so knorke waren aber das ich für sowas meinen ganzen Account verlieren kann ist mir dann doch schon zu lächerlich... ganz besonders wenn man vergleich durch welche Tortur man manchmal durch Runden geht und im nächsten Game direkt wieder den gleich \"Kollegen\" im Team habt unbestraft und wohl erhalten... die meisten  werden mich wahrscheinlich einfach als Idioten bezeichnen aber ich sehe darin keinen Sinn sich jetzt mal metaphorisch  gesehen erst verprügeln zu lassen bevor man sich melden darf... Na klar kann ich die Leute muten aber im Endeffekt müsste ich dann ja jede Runde jeden muten was für mich in einem Team-spiel sowas von Kontraproduktiv und paradox finde das mir das einfach zu lächerlich ist. \n> Danke Leute für die halbwegs gescheite Hilfe\n\ndu bist echt nen clown, hat schon 3x!!! 2 wochen banns bekommen und fühlt sich ungerecht behandelt nun nen perma bekommen zu haben -.- just wow.... normale menschen bekommen nichtmal einen 2 wochen bann in lol... und mal ehrlich, selbst wenn du bei dem hier beschriebenen fall nochmal gradeso mit durchgekommen wärst - hätte es dich halt beim nächstenmal erwischt!\nEigl. kann man Riot hier nur ´zum funktionierenden System gratulieren und sich freuen das eine gestörte persöhnlichkeit weniger auf dem realm unterwegs ist.","replies":[{"poster":"SeeRoybär","date":"2016-02-11T09:11:20.157+0000","up_votes":1,"down_votes":4,"body":"Nach dieser Nachricht würde ich dich gerne mal in dieser Runde gesehen haben und deine Reaktion gesehen... Bitte antworte jetzt nicht auf diesen Kommentar wie heldenhaft du dich verhalten hättest :)","replies":[{"poster":"SorisDynasty","date":"2016-02-11T09:58:54.496+0000","up_votes":3,"down_votes":0,"body":"Wozu heldenhaft? Mute & Report. Easy. Man muss nicht heldenhaft reagieren. Nur mit Köpfchen.","replies":[{"poster":"SeeRoybär","date":"2016-02-11T10:05:36.756+0000","up_votes":1,"down_votes":4,"body":"Heldenhaft im Sinne der Besonnenheit","replies":[{"poster":"SorisDynasty","date":"2016-02-11T10:07:43.353+0000","up_votes":2,"down_votes":0,"body":"Wie gesagt, Mute & Report ist alles, was man braucht. Das ist auch kein besonderes Verhalten. Es ist das einfachste, das man machen kann.","replies":[{"poster":"SeeRoybär","date":"2016-02-11T10:22:39.106+0000","up_votes":1,"down_votes":3,"body":"Ich verstehe deinen Punkt aber jedoch will ich nicht jede Runde jeden muten und reporten müssen um spaß an einem teamspiel zu haben ... Paradox und kontraproduktiv","replies":[{"poster":"SorisDynasty","date":"2016-02-11T10:24:14.016+0000","up_votes":2,"down_votes":0,"body":"Jeden muss man auch nicht muten. Nur die, die dir auf die Nerven gehen. So halte ich es persönlich, da ich selten im Chat interagiere. Und wenn man realistisch ist, so häufig wird man dann auch nicht belästigt.\nAndernfalls kann ich dir nur empfehlen, falls du nochmal spielen solltest, dir Premades zu suchen. Dort sollte es ja angenehm werden.","replies":[]}]}]}]}]},{"poster":"Streifi","date":"2016-02-11T10:21:18.468+0000","up_votes":2,"down_votes":0,"body":"was die leute in lol so von sich absondern ist mir komplett egal... für mich ist das nen spiel, zwar ein spiel welches ich mehr spiele als ich sollte und mit mehr hingabe spiele als ich sollte... trotzdem ist es ein game und solange riot mich nicht bezahlt es zu spielen bleibt es das für mich auch.\nWer sich von anderen FREMDEN in einem SPIEL flamen lässt und das dann persöhnlich nimmt und durchdreht (und das regelmäßig) was letztendlich zu einem permabann führt und sich dann noch beschwert das er gebannt wurde hat mmn. ganz andere probleme in seinem leben als dem gebannten account.\n\nps: alleine an deiner antwort erkennt man schon das es dir schonwieder unter den fingernägeln brennt. Aber so ist das bei allen betroffenen, das gewisse maß selbstreflexion fehlt einfach und wenn das noch mit kritikunfähigkeit gepaart wird ist die katastrophe komplett. Google mal dunning kruger effekt, das beschreibt dein leiden (Ist btw. grade in der deutschen bevölkerung sehr weit verbreitet).","replies":[]}]}]},{"poster":"Sirrkas","date":"2016-02-10T19:13:21.638+0000","up_votes":2,"down_votes":0,"body":">das manche Aussagen nicht so knorke waren aber das ich für sowas meinen ganzen Account verlieren kann ist mir dann doch schon zu lächerlich.\n\nDu wurdest für den Chatlog nicht direkt permanent gebannt. Der Chatlog hat nur die nächste Eskalationsstufe der Strafen aktiviert. In deinem Fall ein Permabann. Das kannst du natürlich lächerlich finden. Andere werden es eher lächerlich finden, dass manche erst beim fünften Bann permanent gesperrt werden. Ist alles Ansichtssache.\n\n>ganz besonders wenn man vergleich durch welche Tortur man manchmal durch Runden geht und im nächsten Game direkt wieder den gleich \"Kollegen\" im Team habt unbestraft und wohl erhalten.\n\nWenn du nach einem Spiel nicht sofort auf Nochmal spielen drückst, erhöht sich die Wahrscheinlichkeit gewaltig, nicht nochmal die selben Spieler im Team zu haben. Zudem kann in dem Moment die Chatanalyse noch nicht gegriffen haben. Vielleicht kriegen die \"Kollegen\" für das erste Spiel bereits eine Strafe, die greift dann aber erst nach dem zweiten Spiel, weil es eine Viertelstunde dauern kann, bis die Überprüfung abgeschlossen ist.","replies":[{"poster":"SeeRoybär","date":"2016-02-11T09:00:57.719+0000","up_votes":1,"down_votes":4,"body":"Ich wurde unmittelbar nach der Runde gebannt konnte nicht einmal mehr Reporten ... also daher kann das anscheinend nicht immer der Fall sein das es einfach ne Zeit dauert","replies":[{"poster":"Sirrkas","date":"2016-02-11T09:47:34.368+0000","up_votes":3,"down_votes":0,"body":"Es kann bis zu einer Viertelstunde dauern. Wenn man sich beeilt schaffen es manche noch in ein neues Spiel. Es haben aber schon Spieler berichtet, dass sie in der Championselect gebannt und aus der CS geworfen wurden.","replies":[]}]},{"poster":"Sirius00","date":"2016-02-10T23:02:39.607+0000","up_votes":2,"down_votes":0,"body":"Ich mache jetzt mal ein Beispiel aus dem praktischen leben:\nA wird von B beleidigt.\nSirius schlägt B.\nLehrer sieht, wie A B schlägt.\nWenn bestraft der Lehrer? A, da in diesem Moment nur As Reaktion wichtig ist. Zwar setzt eine köprerliche Attacke eine geistige Attacke voraus, aber wenn man auf die geistige Attacke WIEDERHOLT falsch reagiert, wird man gebannt. So funktionieren bestrafungssysteme nunmal (ausser jemand will dich ermorden, aber dass ist dann doch etwas ausserhalb unserer Liga).\n\nMfG Sirius00{{champion:15}}","replies":[{"poster":"SeeRoybär","date":"2016-02-11T08:59:35.664+0000","up_votes":1,"down_votes":3,"body":"Kann dein Beispiel leider nicht ganz verstehen da Riot bzw. das Tribunal ja auch sieht was meine Teamkameraden tuen bzw schreiben... Und warum ist dem Lehrer nur As Reaktion wichtig ? Ich meine sollte der Lehrer nicht schon da eingreifen wo B anfängt zu beleidigen ? Um logische Folgen/Konsequenzen zu vermeiden ? Ich denke schon ...\nTrotzdem danke","replies":[{"poster":"Sirius00","date":"2016-02-11T12:19:40.062+0000","up_votes":2,"down_votes":0,"body":"A hat sich falsch verhalten, er hätte sich nicht auf dieses Niveau hinabbegeben sollen, sondern dies der Respektperson melden. Genauso wie du. Du hättest keinen Perma bekommen, wenn du dich richtig verhalten hättest. Du hast schon zuvor Sperren erhalten, die sagen:\" Hey, das ist echt mies, was du da machts. Wir geben dir mal ein paar Wochen Bedenkzeit, ebvor du wieder spielen kannst,ok?\" Zwar ist es immer unschön, sich beleidigen zu lassen, aber ich stelle mir immer vor, was für Menschen hinter diesem Nickname stehen, und meist sind es sehr traurige Menschen. Aber hey, vielleicht kommst du mal wieder und kannst soetwas hinnehmen, ohne das es dir gleich \"den Nucki uusejagt\" wie wir in der Schweiz sagen.\n\nMfG Sirius00{{champion:15}}","replies":[]}]},{"poster":"Zulwar","date":"2016-02-11T12:34:33.580+0000","up_votes":1,"down_votes":0,"body":"Sry aber das muss ich berichtigen, wenn du das machen möchtest, musst du das so sehen.\n\nA wird von B beleidigt.\nA schlägt B.\nKamera zeichnet Sound sowie Bild auf.\nA und B zeigen sich gegenseitig an.\nA und B werden beide bestraft.\n\nSo ist das System. A wird bestraft, da er zugeschlagen hat und B weil er beleidigt hat.\nWenn A nicht zugeschlagen hätte, wäre A auch nicht bestraft worden. So einfach ist das.","replies":[]}]}]},{"poster":"HyperionCH","date":"2016-02-10T18:06:51.350+0000","up_votes":2,"down_votes":0,"body":"Hätte mich jedoch trotzdem sehr interessiert, warum du der festen Überzeugung bist, dass deine Mitspieler wegen Flaming nicht bestraft werden, während du mehrmals wegen Flaming bans gekriegt hast.","replies":[{"poster":"SeeRoybär","date":"2016-02-11T08:54:19.164+0000","up_votes":0,"down_votes":5,"body":"Ganz einfach weil ich schon mit Leuten gespielt habe die mich \"nig ger\" geschimpft haben und sie in der nächsten runde wieder gesehen habe ... und das ist mir nicht nur einmal passiert aber ich dafür bestraft werde das ich beispielsweise mich darüber beschwere das 4 man in meinen jng marschieren und den leer räumen damit ich keine stacks bekomme mich darauf hin dafür im all chat fertig machen wollen das ich keinen farm habe und mich am ende dann zu viert reporten ... anscheinend sehen das hier manche ja auch als toxisches verhalten wenn man sich darüber beschwert das der jng leer gemacht wird ... mein Fazit von all euren Kommentaren ist einfach das ich mich weder beschweren darf noch kritisieren darf da das schon als toxisches Verhalten gilt und naja wenn dass so ist dann bin ich wohl ein toxischer Mensch im echten Leben sowie ingame .... Nochmal zu deinen Punkt ich habe Freunde die flamen non-stop und haben noch nie mehr als eine chatrestriction bekommen obwohl sie anscheinend mehrmals reportet werden ... Hoffe ich konnte dir ein wenig erklären was ich damit meine","replies":[{"poster":"Zulwar","date":"2016-02-11T12:23:13.877+0000","up_votes":2,"down_votes":0,"body":"Ok also wie ich bis hierhin sehe, hast du schon Tipps und so bekommen.\njedoch möchte ich noch auf was hinweisen.\n\nDu selber sagst, das du deine Mitspieler nicht mutest, da dir das Kontraproduktiv ist. Hast du sicherlich mit recht. Jedoch habe ich in deinem Haupttext gelesen, das du schon mehr mal den 14 Tages Bann hattest. Also bist du scheinbar recht anfällig dafür, wenn andere schlecht über dich sprechen.\nSich Abhilfe dadurch zu schaffen, das man dann nur die Leute Mutet, die einen nerven, scheint für dich nicht in frage zu kommen, was mich jedoch wundert ist, warum, hast du angst die Kontrolle zu verlieren, wenn du weißt das niemand dir was schreiben kann?\n\nIch habe selber schon viel darüber nachgedacht, ob ich den Mut-Knopf drücken soll oder nicht. Habe dies bis jetzt auch nur ein paar mal in der Anfangszeit gemacht. Somit ich kann immer sehen, wenn jemand was schreibt. Jedoch interessiert mich der Chat auch nicht. In den meisten Fällen, sehe ich erst Minuten später, das jemand dort was reingeschrieben hat, da er für mich überflüssig ist. Ich verwende ihn lediglich um \"gj\", \"thx\", \"u2\", \"np\" oder \"gg\" zu schreiben. wobei auch Abwandelungen vorkommen können, z.b. \"thx u2\".\nWas ich damit sagen möchte, ist das ich es immer vermeide jemanden Zündstoff für eine Äußerung zu gegeben, die ihn dazu veranlassen zu schreiben. Das heißt, das wenn ich mal in ein Game nicht reinfinde und somit meine Lane verliere, bzw. manchmal auch nur zu häufig sterbe, schreiben genug Leute schlecht über einen. Dennoch schreibe ich nie etwas dazu, da ich ja weiß, was mein Fehler war. Somit ist eine Diskussion mit ihm für mich nicht von Interesse.\n\nDas Exremste Beispiel, was ich je erlebt habe in meinen letzten 6 Jahren LOL Zeit, war gar nicht mal so lange her. Ich selber war in einem Ranked game. Wir als Team schlugen uns ganz gut und war einigermaßen zufrieden mit meinen Mitspielern.\nAls dann die Gegner anfingen zu Gruppieren, taten wir das selbe, da es unsere Champion Auswahl auch super zu ließ, wie ich selber fand. Jedoch verloren wir jeden Teamkampf. Nach und nach holten sie somit auf, ich selber ADC war somit nur noch am Rumlaufen und Verteidigen und versuchte irgendwie an Farm zu kommen, um dem Gegner die Stirn bieten zu können. Mein Team war natürlich hauptsächlich mit Gruppieren und schreiben beschäftigt. Der Flame richtete sich natürlich auch an mich. Als dann nach einer gewissen Zeit einer meinte, er würde mich reporten, da ich nur noch am farmen bin und nicht Gruppieren würde. Das wir in der Zwischenzeit 2-3 Teamkämpfe verloren haben und keinen Gewonnen, ließ in scheinbar immer noch bei der Meinung, das wir weiter Teamkämpfe bestreiten müssen. Achja und weil ich nicht kommuniziere, wollten Sie mich auch melden.\nKurz danach kam der Gegner wieder um die bis zum Inhibitor auf unserer Seite verlorene Lane zu bearbeiten.\nUnsere Toplane, war zu diesem Zeitpunkt ganz gut gepusht und wurde vom Gegner nicht beachtet. Also lief ich mit meiner MF los um dort den Tower zu holen und zu hoffen, das mein Team nicht jetzt noch versuchen würde zu kämpfen, sondern sich defensiv halten und den Gegner zu bremsen, in der Hoffnung, das sie sich so von mir ablenken lassen. jedoch war dann deren T2 Tower kaputt und die Gegner immer noch in unserer Basis. Bis jetzt war von uns und denen auch noch keiner gestorben.\nAm Inhibitor Tower traf ich dann Morgana an, die ich aber mit einer Combi eliminierte, leider schien die aber einen DC gehabt zu haben, da sie sich nicht bewegt hatte. Als dann der Inhibitor Tower fiel, Teleportierte sich der Gegnerische Toplaner zu mir und kurz darauf der von uns auch. Gemeinsam besiegten wir ihn und machten uns an die Türme, wobei wir den Gegner in 1 vs 2 bzw. 2 vs 2 bekämpfen mussten, jedoch besiegten wir sie so alle und Gewann das Spiel.\nJedoch was war das besondere daran?\nGanz einfach. nach dem wir gewonnen haben, haben kamen von meinen Mitspieler aussagen, wie \"wp MF\", \"gj MF\" und \"Hornor MF\". Aber freuen darüber kann ich mich nicht. Sicher bin ich zufrieden mit meiner Leistung in dem Spiel, aber das meine Mitspieler erst meinten, sie wollen mich reporten, weil ich in ihren Augen das Spiel ruiniere und am ende Loben sie mich jubel hoch jauchzend??? Sry aber darüber kann ich mich nicht freuen.\n\nSry übrigens, das ich so ausschweifend wurde, aber ich fand das dieses Extrembeispiel mal nieder geschrieben werden musste, um zu zeigen, was für extreme in einem einzigen Spiel auftreten können. Von extrem flame zu extrem lob. Ich kann immer noch nur den Kopf darüber schütteln.\n\nOb dir das hilft, weiß ich nicht. Aber allein durch diese Erfahrung, lehrt es mich nie irgendwelche schreibereien in Game zu tätigen, da man am ende nur sich selber schwächt, obwohl man selber doch noch den Sieg hätte holen können.","replies":[]}]}]}]}]}