{"poster":"Savaritia","date":"2015-11-05T19:15:51.936+0000","title":"Esports-lol.de Deutsche LeagueofLegends Community","subforum":"Clans & Teams","embed":{"description":"The background images used on this page are not royalty-free . Please use images from your own collection. - The page SAMPLE is a \"hidden\" page that contains sets of elements grouped into \" sections\": Title + photo, Icons + text, text + icons + video, etc...","url":"http://esports-lol.de","image":null},"up_votes":1,"down_votes":0,"body":"Guten Tag Liebe LeagueofLegends Spieler. Ich bin InfinityFrog und der Gr&uuml;nder des esports-lol.de Clanes bzw. der Gemeinschaft.\r\nIn diesem Thread m&ouml;chte ich euch unserem Clan bekannt machen und versuchen neue nette Mitglieder f&uuml;r den Clan zu finden.\r\n\r\n**So sind wir entstanden**\r\n\r\nAm Anfang besa&szlig; ich nur einen kleinen Youtube Community ts3 Server. Auf diesem traf ich ein paar Leute die so ein Spiel namens LeagueofLegends spielten. Ich hatte zwar kein Plan was diese Leute da redeten h&ouml;rte aber immer gespannt zu. Einer fragte mich ob ich LeagueofLegends Spiele und ich antwortete &quot;bitte was soll ich spielen?&quot; dann schaute ich mir einen Trailer and und fasste einen entschluss &quot;ich werde nie in meinem Leben LOL Spielen&quot; (sieht man ja ;P) so ging das eine ganze weile sie spielten ich h&ouml;rte zu. \r\nDoch nach ca. 3 Monaten war ich so fr&uuml;h auf dem ts3 server das ich der einziegste war. Ich hatte mit heimlich LOL runtergeladen und den ts3 server umgestalten und zwar zu einem LOL Clan ts3 server. Als nun die anderen auf den ts3 Server kamen fragten sie mich &quot;warum sind hier nur noch LeagueofLegends Channel?&quot; und so erz&auml;hlte ich das wir absofort ein Clan sind und ich auch angefangen habe LOL zu Spielen.\r\nSo entstand der esports-lol.de Clan.\r\n\r\n**Was bieten wir euch**\r\n\r\n* Wir bieten euch einen Gro&szlig;en Clan ts3 Server\r\n* Wir bieten euch ein Forum ( deutsche Sprache)\r\n* Wir bieten euch Clan vs Clan Tuniere\r\nund vieles mehr\r\n\r\nDank unserer Team Kollegen ist unser Clan innerhalb von ein par Monaten sehr gro&szlig; geworden. Und der gro&szlig;teil kennt sich schon seid ca. 3 Jahren. Also worauf wartest werde euch ein Teil der esports-lol.de Gemeinschaft.\r\n\r\nDu m&ouml;chtest uns kennenlernen?\r\n\r\nDann schau auf unserem ts3 Server vorbei.** esports-lol.de**\r\n\r\n**Bewerbungs Vorraussetzungen**\r\n\r\n* Aktiver LeagueofLegends Account\r\n* Vern&uuml;nftiger Umgangston\r\n* Spa&szlig; am Spielen mit anderen zusammen\r\n* Aktiv auf dem ts3 Server sein\r\n\r\nNun aber schnell, {{summoner:4}} einfach in unseren ts3 server rein und unterhalte dich mit ein paar Mitgliedern.\r\n\r\nMfg,\r\nInfinityFrog","replies":[]}