{"poster":"Requiemsfire","date":"2016-08-29T08:25:31.210+0000","title":"Soraka rant","subforum":"Gameplay & Strategy","up_votes":3,"down_votes":1,"body":"I despise her very existence in this game. I wholeheartedly believe she can never truly be balanced regardless of what kind of nerfs or QOL you offer her. \n\nEarlier I played a lovely game of Thresh with lucian botlane by my side, at level 6 I push for an all in, circle around, Ezreal blinks into my hook aimed at Soraka probably by accident but what happened really infuriated me on the inside. I flay Ezreal towards lucian , I box ezreal, both mine and lucian&#039;s combined damage focused on Ezreal, In most situations this is a dead Ezreal, this ezreal messed up majorly and deserved to lose for it. Yet he somehow escapes due to Soraka&#039;s heals outperforming our damage to such an extent he was full health only moments later. This was an even lane in terms at 0/0/0 with lucian ahead slight ahead in CS. It still baffles me. No, Ezreal didn&#039;t flash to escape because he burned that prior to that fight.  \n\nLook I understand that the most major form of counter against any Soraka botlane is to target Soraka but I can&#039;t feel that &#039;counterplay&#039; is still utterly ridiculous.\n\nI know that some people will probably call out {{item:3123}} but I for one certainly won't have this item that early on and truthfully that doesn't remove the frustration nor does it truly counter Soraka. I understand that other champions who have healing in their kit like Sona do exist but I have never really felt their presence to be utterly overbearing to such a point that Soraka is. ","replies":[{"poster":"Nightjar","date":"2016-08-30T06:59:31.848+0000","up_votes":1,"down_votes":0,"body":"if you were facing an enemy soraka please tell me you had and used ignite from the start of the fight. And yes I am saying take ignite on support if the enemy has a healer like sona, soraka or in kills lanes since the extra damage will be worth more pre-lvl8 than exhaust at least in bursting someone down (thresh+lucian is a kill lane as is leona+ezreal, ect...). If you also have a pokey sustainy support or basically any ranged mage support buy an early morellonomicon, it gives you alot of damage, mana, cdr and grevious wounds which will prevent the enemy adc from using the heal spell in a clutch situation or a soraka from mashing w and r and restoring their adc to full hp. Also keep in mind that soraka doesn't offer much offensive value and her heal is one of her cheaper overall abilties so try to bait out her silence and starcall alot and pay attention to when soraka uses wish since it's her only self heal.","replies":[{"poster":"Nightjar","date":"2016-08-30T07:01:56.639+0000","up_votes":1,"down_votes":0,"body":"people who don't take ignite against soraka are playing support wrong. Also remember that nobody is a stronger lvl1 lane bully than soraka so don't trade hard with her early since the q base damage is amost average for a mage but the mana cost is low and the hp regen will outperform any damage done with one enemy ability.","replies":[{"poster":"Sloth Almighty","date":"2016-08-30T08:47:22.640+0000","up_votes":1,"down_votes":0,"body":"I for one will take your advice against Soraka, thanks. Kinda hard to decide on which summoners to take in norms though given the unknown, would there be any items to help against her that the support can take should they not have bought ignite into the rift?","replies":[{"poster":"Nightjar","date":"2016-08-30T12:51:41.764+0000","up_votes":1,"down_votes":0,"body":"on ap supports morellonomicon gives alot of ap, cdr and mana and inflicts grevious wounds. It's a very efficient item that is often built on ap supports since the components are useful and the item has good gold value and really shines against heal sustain lanes. Other than that you're kinda stuck especially for tank supports but you can get your adc to buy an executioners calling and that'll work too. \n\nAs I said if you have a kill bot lane comp, take ignite it's generally the better option since it does more damage early even though it doesn't scale as well into lategame, it prevents clutch heals and escapes from the enemy. Also your adc should generally get an executioners calling as soon as possible against heal lanes since morellonomicon is expensive.","replies":[]}]}]}]},{"poster":"Chalze","date":"2016-08-30T06:43:32.673+0000","up_votes":1,"down_votes":0,"body":"I don't end up playing against many Sorakas but just within a few games with her recently....\n\n.....I wholeheartedly support your campaign to end her very existence","replies":[]},{"poster":"Qoki","date":"2016-08-30T05:01:20.504+0000","up_votes":1,"down_votes":0,"body":"That bullshit is why she's my go-to support as a support main, she excels at recovering her ADC's mistakes and has the best heals in the game with global presence at the cost of having weak CC and little to no engaging power (other than a silence/root or Q slow). But yeah, to counter her it really comes down to who you have on your team, whether or not your ADC runs EC and how good the soraka is at positioning. That being said you're right to say focusing the healer is the right way to really counter her.","replies":[{"poster":"Requiemsfire","date":"2016-08-30T05:46:31.616+0000","up_votes":1,"down_votes":0,"body":"Just want to say that silence is a lot stronger than what people give it credit for. Like I've played Soraka from time to time, and to be frank it's very good at shutting down assassins like Zed, Leblanc and Fizz despite what people think. ","replies":[]}]},{"poster":"bgentle2myashe","date":"2016-08-29T22:55:06.616+0000","up_votes":1,"down_votes":0,"body":"Assassin > burst damage > smart strategic play > Soraka","replies":[]},{"poster":"xDarkRavenx","date":"2016-08-29T08:44:49.985+0000","up_votes":1,"down_votes":0,"body":"I just lost a game with Soraka? lol","replies":[{"poster":"Requiemsfire","date":"2016-08-29T08:47:54.463+0000","up_votes":1,"down_votes":0,"body":"Well I think the main reason we lost that game was mainly because veigar and Diana managed to get really big which Soraka only facilitated that but for it's not about the loss so much as it is how forgiving Soraka is in lane to her allies through merely existing. She is quite literally my least favourite support to lane against and one of the few that I truly despise. ","replies":[]}]}]}