{"poster":"Im inside you","date":"2019-02-23T20:16:17.023+0000","title":"My account has been accessed by somebody else who has caused me to gain a ban and Im panicking","subforum":"Player Behavior","up_votes":4,"down_votes":2,"body":"I have recieved 2 emails from: Riot Games  to my account email\r\nIn both emails it states that a request to change my login was made with confirmation codes to change it, these emails are both in polish, I only speak and read english so I had to use the google translate integrated in gmail. I logged into my account out of panic, and my usual login worked - but now I have a 14 day suspension with a chat log loaded up full of racial slurs and spammed text inputs that I never typed myself meaning my account has been accessed by somebody else, Im scared, I dont know what to do please help me. I dont care if I have to keep the ban, please help me save my account the right way.\r\n\r\nGame 1\r\nPre-Game\r\nIm inside you: kys\r\nIm inside you: fckng cancer\r\nIm inside you: myger\r\nIm inside you: nyger\\\r\nIm inside you: %%%%%%s\r\nIm inside you: kys fckng %%%%%%s\r\nIm inside you: kill ur fckng self\r\nIm inside you: bitch\r\nIm inside you: delete ur life\r\nIm inside you: %%%%%%s\r\nIm inside you: suck\r\nIm inside you: my\r\nIm inside you: dfick\r\nIm inside you: %%%%%%s\r\nIn-Game\r\nIm inside you: rep fckng nigers on my team kys\r\nIm inside you: kys\r\nIm inside you: kys\r\nIm inside you: kill ur fckng self\r\nIm inside you: kysssss\r\nIm inside you: pls kys\r\nIm inside you: kys\r\nIm inside you: kyus\r\nIm inside you: Tre\r\nIm inside you: h\r\nIm inside you: Sth\r\nIm inside you: HS\r\nIm inside you: tf\r\nIm inside you: fck ur self\r\nIm inside you: fkcng irh\r\nIm inside you: ky]\\p ty\r\nIm inside you: eg\r\nIm inside you: dfsg\r\nIm inside you: DGZDFg\r\nIm inside you: gzdf\r\nIm inside you: fg\r\nIm inside you: G\r\nIm inside you: ZDf\r\nIm inside you: F\r\nIm inside you: >.?\r\nIm inside you: .\r\nIm inside you: .\r\nIm inside you: .\r\nIm inside you: .\r\n\r\nThe last match that I played was as Lucian in ARAM, 2 matches were played after - neither of which by me.\r\nI don't share my account, I have never shared my password with anybody and Im panicking because my password is something I use for multiple other websites and social media, I tried writing a ticket but every time I went to submit it said CAPTCHA failed, I think maybe because my account is banned. Atm its a 14 day ban and I havent changed the password myself because I dont know if that could make solving the issue harder for RIOT or anybody else Please I beg help me.\r\n\r\nI have screenshots of both emails and off the card as well as my match history, Im unwilling to share it with any non-employee however.\r\nIncase anybody is wondering, I mained Kayn for a long time, hence my user name.","replies":[{"poster":"Jo0o","date":"2019-02-23T20:19:30.682+0000","up_votes":5,"down_votes":0,"body":"Get a support ticket in right away. Submit copies of the emails you've received, and be patient and respectful. This can take some time to resolve, but you should be able to demonstrate that your account was compromised outside of your control and that you weren't responsible for this behavior.\n\nEdit: League's ticket page is weird sometimes. Try accessing it in Incognito mode, or in a different browser. There should be no reason why being banned would prevent you from submitting a ticket, so that's certainly not the problem.","replies":[{"poster":"Im inside you","date":"2019-02-23T20:35:51.924+0000","up_votes":1,"down_votes":0,"body":"My friend irl is submitting a ticket for me, I tried a different browser and it still failed to work, its just I know Im not some pro player being bronze 1 with an all time high of silver 1 but I enjoy the game and it helps me fight off my depression and anxiety. I've spent a lot of money on my account, I dont want to lose that to somebody else and Im freaking out because of my anxiety. Im just trying to stay calm until I know exactly what to do","replies":[{"poster":"Jo0o","date":"2019-02-23T20:42:09.969+0000","up_votes":3,"down_votes":0,"body":"You really need to figure out how to submit a ticket yourself. Your friend's ticket won't help you, especially since this is a matter of account theft. They're not going to give him personal information on you.","replies":[{"poster":"Im inside you","date":"2019-02-23T20:46:46.147+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Jo0o,realm=NA,application-id=ZGEFLEUQ,discussion-id=z5lQtxO0,comment-id=000100000000,timestamp=2019-02-23T20:42:09.969+0000)\n>\n> You really need to figure out how to submit a ticket yourself. Your friend's ticket won't help you, especially since this is a matter of account theft. They're not going to give him personal information on you.\n\nBut I cant get a ticket to send, I tried multiple times on different browsers....\nIm slowly putting things together, if you check the two games on OP.GG they were played about 5 hours apart. The first game was played normally, then they tried to change my login causing the two emails to come through. failing to do so they inted as rek'sai during the final game which I assume is when they spouted all that text. So now I atleast know the events that took place\n\nIm going to keep trying tickets","replies":[{"poster":"Kei143","date":"2019-02-23T21:39:45.936+0000","up_votes":2,"down_votes":0,"body":"Don't keep trying tickets. One is enough. If you spam your tickets, it will get bumped to the back of the queue. \n\nFor now change your LOL password and then run a virus and malware check to see if there was anything bad on your computer.","replies":[{"poster":"Im inside you","date":"2019-02-24T06:14:51.457+0000","up_votes":1,"down_votes":0,"body":"I never got one through originally, thats why I said I was going to keep trying tickets. In the original post I described how they were failing to send.","replies":[]}]}]},{"poster":"Im inside you","date":"2019-02-23T20:52:19.631+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Jo0o,realm=NA,application-id=ZGEFLEUQ,discussion-id=z5lQtxO0,comment-id=000100000000,timestamp=2019-02-23T20:42:09.969+0000)\n>\n> You really need to figure out how to submit a ticket yourself. Your friend's ticket won't help you, especially since this is a matter of account theft. They're not going to give him personal information on you.\n\nOK! I managed to get a ticket through from a different computer! so thats progress, I hope it helps I really do","replies":[]}]}]}]},{"poster":"Im inside you","date":"2019-02-23T20:17:20.295+0000","up_votes":1,"down_votes":0,"body":"The Percentage marks is from the boards automatic censorship - they are in reality the racial slur for blacks, beginning with N","replies":[{"poster":"Voldymort","date":"2019-02-23T20:41:33.051+0000","up_votes":4,"down_votes":1,"body":"https://media.tenor.com/images/755955f366a1d9a82edae28a107457b3/tenor.png","replies":[]},{"poster":"xDogMeatx","date":"2019-02-26T13:29:00.316+0000","up_votes":1,"down_votes":0,"body":"Natural nugget foods no censorship?","replies":[]},{"poster":"Galaxyburstz","date":"2019-02-23T20:20:49.083+0000","up_votes":1,"down_votes":1,"body":"https://m.youtube.com/watch?v=Ap4nvdEotqw","replies":[]}]},{"poster":"ISitting DuckI","date":"2019-05-26T04:42:14.374+0000","up_votes":1,"down_votes":0,"body":"Nice troll dude.  Just make another account.","replies":[]},{"poster":"GlancingChaos","date":"2019-03-01T16:12:36.544+0000","up_votes":1,"down_votes":0,"body":"Wow first time I felt bad for someone on these boards... make sure you change all your passwords and run a malware checks then save your games and info on a hsrd drive and do wipe everything that you dont need, good luck.\n{{sticker:sg-janna}}","replies":[]},{"poster":"xDogMeatx","date":"2019-02-25T16:23:59.533+0000","up_votes":1,"down_votes":0,"body":"your name is toxic in itself lel  XD besides that.....\n\n (aimed at hackers)  to those who hack others to screw over them or steal their money instead of actually want to play the game do us all a favor and just leave this world i mean that is pure evil what you hackers are doing.  i dont care if saying kys is \"bad\".  if someone wants to damage others reputation/ban them or steal someones info for personal gain you dont deserve any kind of human rights.  its pretty scummy to just hurt others than laugh about the gains you got or the jerk offs you basically got off to doing this.  please dont exist anymore or reproduce to those who make others miserable by hacking financially or otherwise. P.S: i had my brother who was hacked (yes riot cleared it thankfully) it effects me so much that SCUM who dont deserve to be called human got into his account and got him banned. its the ultimate violation to me if when i play league then i see that ban message it feels like a form of rape/humiliation. sorry if im rude but dang i HATE hackers they shouldnt exist in this world if they like hurting others i mean it seems like they purposely want you banned and dont give a \"F\" about you. thats the worst kind of human the ones that sneak into your life and blow it up because they want too.","replies":[]},{"poster":"Apool125","date":"2019-02-25T07:08:23.934+0000","up_votes":1,"down_votes":0,"body":"calm down, relax,inhale,exhale. make a fake smile, you are all good, I know what you are going through","replies":[]},{"poster":"Vaelkyrie","date":"2019-02-24T00:13:59.032+0000","up_votes":1,"down_votes":0,"body":"1.  run an antivirus program - if you can't afford a paid one (do not use the free AVAST) Panda anti-virus is good, reliable and free.\n2. change your password. If you can, do it from your friend's machine by logging into your account instead of theirs. That will sidestep any malware or keyloggers that may be on your machine\n3. Get your IP address and have it ready to submit with the ticket\n4. when replying to support stay respectful, do not flame them at all.\n\nDo steps 1 and 2 immediately\n\nAlso, and I don't mean to add to the finger wagging you are likely feeling like you are getting but I can't stress enough how important it is that your email password is totally unique. Think of your email address and associated password as the master key to your digital house.  Being able to log into your email with a compromised password will allow bad actors to change passwords to many other things - including your email account itself.\n\nA good way to generate a password is to take the first letters of a quote that you can easily remember and then add the numbers and punctuation marks at the ends to bring it to 8-10 characters.\n\nFor example: With great power comes great responsibility. Uncle Ben.\nBecomes something like:        7WgPcGr!UB \nEasy for you to remember.\n\nGood luck","replies":[{"poster":"Im inside you","date":"2019-02-24T06:13:42.668+0000","up_votes":1,"down_votes":0,"body":"As I said before, my original login details worked. The attempted to change my login but were not able to do so thanks to the need for a confirmation email. my email password is unique from my league log in. But thank you, Im not flaming support either, I just have my fingers crossed that they respond soonish.","replies":[]}]},{"poster":"Im inside you","date":"2019-02-23T20:23:13.351+0000","up_votes":1,"down_votes":0,"body":"i've just found out my lunar revel shards Ive been saving up have all been converted into skin shards for champions, I was saving up from Prestige vayne and now I have under 50 tokens and a load of skin shards I dont want","replies":[{"poster":"Im inside you","date":"2019-02-23T20:23:42.714+0000","up_votes":1,"down_votes":0,"body":"Im actually so...so...I dont even know how to say it","replies":[]}]},{"poster":"DerMangoJoghurt","date":"2019-02-23T20:20:38.549+0000","up_votes":1,"down_votes":0,"body":"Just write a ticket to the [support](https://support.riotgames.com/hc/en-us/requests/new). They'll be able to help you out.\n\nEdit: I didn't read that sending a ticket failed. Sorry","replies":[]}]}