{"poster":"Ishek","date":"2015-08-02T03:59:58.279+0000","title":"¿Tan difícil es jugar para divertirse?","subforum":"Charlas Generales","up_votes":5,"down_votes":0,"body":"Hola a todos, es la primera vez que creo un tema en el foro, as&iacute; que si cometo alg&uacute;n error hac&eacute;rmelo saber :)\n\nVi la necesidad de dar mi opini&oacute;n sobre cosas que me pasaron los &uacute;ltimos d&iacute;as/semanas en cuanto al juego.\nJuego desde diciembre del 2014 (unos d&iacute;as despu&eacute;s de que saliera Rek&#039;Sai si no me equivoco), los primeros lvls, aprendiendo las mec&aacute;nicas del juego, diferentes estrategias, etc, me divert&iacute;a much&iacute;simo aprendiendo cosas del juego, de diferentes campeones, de cada posici&oacute;n en el mapa, etc. Al llegar a nivel 30 empec&eacute; a cruzarme cada vez m&aacute;s y m&aacute;s con gente muy mala, pero no mala en el sentido que \"jugaba mal\", mala en actitud:\n\nComet&iacute;a un error, insultaban.\nLo mataban, insultaban.\nMe mataban, insultaban.\nLo gankeaban, insultaban.\nLe sal&iacute;a mal una jugada, insultaban.\nY m&aacute;s me vale no intentar decirle que se calme, porque insultan 3 veces m&aacute;s.\n\nS&eacute; que hay decenas de post con quejas sobre los jugadores t&oacute;xicos o flammers, pero mi queja es, &iquest;hay alguien que siga jugando por diversi&oacute;n? League of Legends es un juego, la idea es divertirse, intentar cosas, practicar jugadas, JUGAR. Las &uacute;ltimas semanas siento que toda la partida tiene que ser tan estructurada que nadie se divierte, si no se gana no sirve (no estoy diciendo que me guste perder), pero por ejemplo si en una partida pierdo, pero a mi en lo personal me fue medianamente bien, o pude dar utilidad al equipo, me divierto, pero todo se va al diablo porque siempre (y ac&aacute; soy literal, SIEMPRE) est&aacute; el del \"izi\", el que insulta por perder, el que nos insulta porque nos gan&oacute;, nunca falta uno de esos. Y cada vez son peores los insultos, pasaron de ser un \"sos una m* jugando\" a \"ojal&aacute; que te mueras no sabes hacer nada\". Se alteran en ARAM, en PvP normal, y hasta en modos de juego temporal (con Mercado Negro, aunque sea una partida temporal, por pura diversi&oacute;n, insultan, se quejan y se alteran por todo).\n\nJuego con el chat /all desactivado, pero a&uacute;n as&iacute; no se pueden evitar los comentarios en la pantalla de resultados, y no quiero llegar al punto de tener que silenciar a mi propio equipo durante toda la partida o cerrar el juego en cada pantalla de resultados para no tener que leer las cosas que dicen.\n\nY yo mismo s&eacute; que es un juego, fuera de &eacute;l no me quedo mal/deprimido o como quieran decirle por algo que haya dicho un desconocido, pero entro a pasar un buen rato jugando y partida a la que entro, insulto que leo, y realmente cansa la misma clase de gente TAN seguido.\n\nGracias por leer (si lo hicieron xD) y me gustar&iacute;a saber su opinion :)\nSuerte en los Campos!","replies":[{"poster":"RNGesus","date":"2015-08-02T05:19:40.342+0000","up_votes":1,"down_votes":14,"body":"Mira yo te digo algo , por darte un ej , va top, tenes una eve jg, le pedis un gankeo, viene(hay una diana en frente),ambos le pegan, vos le dejas ignite pero eve se va a buscarla bajo torre , muere y diana no por que uso la W y se salvo , eve no vuelve a tocar top en toda la partida , entonces que tiene que hacer uno? aplaudir? decir \"buen trabajo\"? , o preguntarle por que car... hiso eso","replies":[{"poster":"kique1","date":"2015-08-02T05:30:05.373+0000","up_votes":11,"down_votes":0,"body":"Osea das a entender que eres un flammer.","replies":[]},{"poster":"MegaManaos","date":"2015-08-02T16:37:26.541+0000","up_votes":2,"down_votes":0,"body":"lo que en realidad debe uno hace es darle animo al otro jugador =) preguntarle por que c* lo hizo es lo peor que podes hacer\nes mas deberías agradecerle muchísimo que intento ayudarte, eso si es una buena opción y también es útil intentar carrear y tener actitud positiva\nno como vos, sos un jugador que la comunidad lolera no quiere, y eso es algo que deberías cambiar","replies":[{"poster":"Kendomovie","date":"2015-08-02T23:42:45.336+0000","up_votes":1,"down_votes":1,"body":"En realidad, la Eve es el tipo de persona la cual la gente no quiere ver...","replies":[]}]}]},{"poster":"TeslaRojo78","date":"2015-08-02T13:53:24.416+0000","up_votes":3,"down_votes":0,"body":"en ranked es donde mas me divierto porque me gusta ver como se flamean o me flamean ami por una jugada mala que hice,ami en lo personal cuando te dice \"ehh reql adsfasdfasfavvabmdsmba\" se que es flameo directo ami agarro y le constesto \"yo tambien te quiero :3\" ami siempre me facilita que un flamer se calle","replies":[]},{"poster":"Hexplosivo","date":"2015-08-02T18:25:08.395+0000","up_votes":2,"down_votes":0,"body":"Yo juego por divertirme, me río de mis errores, de los errores de mis compañeros y de mis enemigos, siempre cuidando de no insultar o burlarme, solamente reírme. También me río de las buenas jugadas, felicito al que haya que felicitar por los dedos, pero cualquier actitud negativa, mute. Cualquier comportamiento tóxico, report.\nHay gente que eso le revienta, los agrego a mi lista de ignorados, con la esperanza de que el sistema de emparejamientos no los vuelva a poner conmigo, y cuando puedo juego con mi hermano, primo o amigos, para tener alguien que me apoye si las cosas se me ponen difíciles.","replies":[]},{"poster":"Nira","date":"2015-08-03T00:47:23.488+0000","up_votes":1,"down_votes":0,"body":"Hola !  yo juego desde que salio `Pantheon Metalisado y por diciembre recien fui 30 , aprendi antes de rankear pero quede b3 :`v luego subi a plata 1 en la pre s5 y actualmente plata 3 , quiero opinar que como explicas \"MUCHAS VECES\" sucede esto de \n+Me gankeas porfa , no puedo farmear ni tradearle .\n-GGTop no sabe jugar defensivo \n+Pero men , me estan campeando y encima me baitean de a dos (iba0/1/0)\n-No , no tengo por què gankear a un manco \n+Pero men , soy tu top , si me ayudas a poder mantener la linea puedo controlar la bola de nieve del otro top y en tf tener mas presencia para no quedar 4 x 5 \n-A mi que mierda me importa si tienes presencia o no , si yo me fedeo la gano solo .\n\nAhi me di cuenta que o no se si se alterò o es un niño 13- pero tengo entendido que el no pudo \"AYUDAR\" a una linea que iba mal .Yo jugaba defensivo contra el jungla campeando y el top dentro de mi torre , me mantenia en farmeo pero no pude contener la torre y tuube que jugar hasta min 15 aprox bajo mi segunda torre , el chico termino fedeando y dandole bola de nieve a la Jinx enemiga y lo peor es que decia \"GG REPORT TEAM SIN MANOS ASCOS\" y todos les deciamos : Men pero si tu no gankeas ninguna linea y cuando vienes solo quieres llevarte las kils y no dejarlas como quieres que agamos daño ? y el responde: Es que entiendan niños ratas de mierdas ascos SI YO ME FEDEO LA CARREO y ese fue el momento en el que le dije al equuipo que lo mutearamos , el se fue afk y sin el terminamos ganando .Aun no entiendo por què gente asi juega o sea SE SUPONE QUE SE JUEGA PARA DIVERTIRSE Y NO PARA PELEAR Y INSULTAR A TU EQUIPO . Una ves ivamos perdiendo por stompeada con 2 inividores abajo pero no se si fue por suerte de dios pero el equipo era callado , hablaban para marcar objetivos y focus y nuca hubo un \"report\"  \"manco\" ETC.... mas bien daban animos en momentos que uno es asesinado por 2 v 1 y la verdad fue una actitud tan alta y alentadora que terminamos remontando y no sè si les a pasado pero en ese momento uno siente algo como \"El equipo confia en mi y no puedo fallarles \" y ese pensamiento te da animo para ganar y tratar de lograrlo , pero si tu team dice \"Rpoert asco vete , desisntala\" Sientes un   \"NO CONFIAN EN MI , QUE AGO EN ESTA LIGA? SERÈ MALO ? , SIEMPRE LA CAGO :C\" o sea todo depende de la actitud que te de tu equipo por eso existe el COMPAÑERISMO OP \n\n\nTrue Story  :v","replies":[]},{"poster":"Trollpick Master","date":"2015-08-02T06:09:49.851+0000","up_votes":1,"down_votes":0,"body":"No es tu culpa, me pasa exactamente lo mismo. Se toman el juego demasiado en serio, se la pasan insultando por todo, y lo más triste es que es porque gran parte de la base del juego son nenes de menos de 15 años que se piensan que el talento a la hora de jugar al LoL te da autoridad para insultar a cualquiera que no sea igual de bueno (incluso aunque ellos mismos tampoco sean igual de buenos que los verdaderos profesionales). Vos silenciá a todos los que te insulten y divertite, como bien dijiste, League es un juego.\n\nSi tenés ganas, pasate por mi publicación sobre el rework de Garen y si tenés alguna idea no dudes en comentar ¿Si? Te dejo el enlace:\n\n[¿Tenés alguna idea para el rework de Garen? Entrá y compartila, o mirá las de otros :D](http://boards.las.leagueoflegends.com/es/c/charlas-generales/P3k8ldy6-tenaos-alguna-idea-para-el-rework-de-garen-entraa-y-compartila-o-miraa-las-de-otros-d)\n\n¡Saludos!","replies":[{"poster":"MegaManaos","date":"2015-08-02T16:57:50.660+0000","up_votes":1,"down_votes":0,"body":"hola, te vi en la publicación del rework, muy interesante.\nYo soy un lolero de menos de 15 años, y creo que es cierto eso de que soy niño rata.\nA lo que voy es que, cuando flammeo en general, creo que al igual que la mayoría, es porque estamos frustrados y no nos damos cuenta que deberíamos tomarlo con calma.\nEl problema no es que no nos demos cuenta, sino que solo algunos pocos sabemos como mejorar la actitud.\nFácilmente, y como hago yo, muteamos a todos y listo, solo tratamos de divertirnos o ayudar con buena onda.\nPero es ese el problema, algunos nos centramos mas en que nos vaya bien y muy pocos nos damos cuenta de la situación.","replies":[]}]},{"poster":"Nyán","date":"2015-08-02T12:50:48.209+0000","up_votes":1,"down_votes":0,"body":"Yo aún me divierto. Porque no me meto en la mierda que ponen. Yo he construido esta barrera anti-flame con confianza. Tengo la suficiente confianza para saber que si me empiezan a insultar, no es porque jugué tan mal para merecerlo, sino que ellos están descargando su frustración en mí. Después de eso, muteo a la persona. Aunque tampoco me llevo muchos insultos, porque mi estilo de juego no lo amerita.\n\nTengo activado el /all. No sé por qué, pero lo tengo activado.\n\nOjo, que no soy la mejor jugadora y cometo errores de Cartón 5, pero tener la suficiente confianza para que un insulto de alguien frustrado no te afecte, ayuda.\n\nLas veces en donde realmente me divierto, son cuando juego con picks antimeta. Leona jg, Sona mid,  todos smite, Quinn mid, etc. Creo que es porque no esperas ganar.","replies":[]},{"poster":"Runth","date":"2015-08-02T06:08:43.133+0000","up_votes":1,"down_votes":0,"body":"si no quitan los W/L, seguiran sacando malas constumbres","replies":[]},{"poster":"kique1","date":"2015-08-02T05:33:57.793+0000","up_votes":1,"down_votes":0,"body":"Sí, es una pena, la gente flammea por todo, hasta porque los carrileas y no estoy bromeando, gente de tu propio equipo insultándote siendo que eres el que mejor va en la partida... también mucha gente insultando en ARAM, como si tuviera importancia el ganar en ese modo xD","replies":[]}]}