{"poster":"JusTKyureM8","date":"2019-04-22T06:17:45.736+0000","title":"Come scelgo il mio ruolo?","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Beh, gioco a league da quasi un anno ormai e vorrei sapere come scegliere il mio ruolo. Ho giocato per i primi mesi adcarry giocando jhin e xayah, poi mi sono spostato in giungla giocando Lee Sin e Kayn, poi mid con Kat ed Annie e adesso mi ritrovo a giocare Jax, Kled e Riven toplane. Ora sono abbastanza confuso e non vorrei più cambiare ruolo così da poter migliorare e scalare in soloq, voi come avete scelto il vostro ruolo?","replies":[{"poster":"iTzGabbo99","date":"2019-04-23T08:18:22.936+0000","up_votes":1,"down_votes":0,"body":"Dipende tutto da te...\nIo per esempio decisi di diventare main Midlane perché guardavo sempre il \"Professor Akali\" su YouTube, non so se lo conoscete. Questo youtube mi fece appassionare tantissimo ad Akali, tanto da farmi diventare main Akali. Giocando sempre Midlane capii che era il ruolo che mi piaceva, una lane aggressiva e difficoltosa e presto cominciai a imparare altri champion come Zed, Talon...\n\nDipende da te... Magari vedi un champion che ti piace tanto, che ti diverte e che ti soddisfa e vedrai che non avrai problemi.","replies":[]},{"poster":"Retardo DiCaprio","date":"2019-04-22T08:51:55.728+0000","up_votes":1,"down_votes":0,"body":"Dipende molto da te... Cerca di capire quale ruolo ti prende di più, dove ti senti più bravo o dove ti diverti, oppure un champ che ti piace tanto e con il quale ti senti bravo e gioca principalmente quello nel suo ruolo finchè non migliori. Io ho scelto jungle per due motivi principali: \n\nPrima giocavo mid, ma non mi trovavo bene in lane e andavo sempre male, escluso fizz non mi piaceva giocare quasi nessun mage o altri champ.\n\nMi piacevano molto i bruiser/tank, mi divertivo un sacco (era anche tank meta quindi ehehe xd) e mi divertivo a giocare in jungle dove andavo quasi sempre bene, quindi ho cominciato a giocare sej/zac e altri.","replies":[]},{"poster":"BluCobalto92","date":"2019-04-22T06:28:37.035+0000","up_votes":1,"down_votes":0,"body":"Io in base al mio stile di gioco.... Mi piace essere tankoso buttarmi in mezzo ai fight quindi giocavo top.... Ma top dipendeva troppo dal jng specialmente in un meta dove i tank nn valgono nulla ecco perché in ranked son diventato main {{champion:89}}","replies":[]}]}