{"poster":"JusTKyureM8","date":"2018-09-25T09:40:30.328+0000","title":"Ranked come funzionano e come startare al meglio","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Salve, sono un player &quot;nuovo&quot; (gioco a League Of Legends da Maggio 2018) e sono quasi livello 75, un paio di mesi fa startai la mia prima ranked e penso di aver fatto un errore, da quello che ho capito adesso il mio MMR (attualmente bronzo 2, appena perso la promo per bronzo 1 con l&#039;MMR di bronzo 3) andr&agrave; ad influire sulle mie placements della prossima season, vorrei sapere come poter risolvere il problema (magari se &egrave; meglio iniziare ad alzare il proprio MMR ora o aspettare la nuova season) e se potete darmi dei consigli per scalare il bronzo e arrivare al silver (so giocare tutti i ruoli tranne adc/sup)","replies":[{"poster":"l EternaL SouL l","date":"2018-09-26T20:07:14.320+0000","up_votes":1,"down_votes":0,"body":"Ad ogni inizio season, c'è un soft reset dell'mmr, ed il massimo delle placement sarà platino 1, challenger master diamond, possono piazzarsi massimo platino1, quindi tutti gli altri scendono di qualche divisione, di solito se sei silver 1 sei pazziato silver 3 o 4. Se proprio le vinci tutte sarai piazzato silver 1.\n\nPer cui non conviene fare le placement a fine season (cioè ora), perchè tra 1 mese sarai buttato indietro di 3-4 divisioni. Tipicamente con 3 win e 7 lose si viene piazzati silver 4, ma se poi inizia un'altra season verrai messo (dopo le \"nuove\" placement) bronzo 2-3.\n\nNel tuo caso, tu hai già fatto le placement, quindi a questo punto non ha più senso aspettare, e cerca di salire più che puoi lo stesso.\n\nPer arrivare al silver ti basta saper farmare, 80 cs in 10 minuti quando in bronzo la media è 50-60, significa partire sempre con una kill in più e con quella puoi già snowbollare, cioè continuare ad umentare sempre di più il tuo vantaggio.","replies":[]},{"poster":"uFere","date":"2018-09-25T09:52:14.452+0000","up_votes":1,"down_votes":0,"body":"Parti quando ti senti pronto, stai calmo, concentrato e dai del tuo meglio, che si vinca o si perda poi dipende da numerosi fattori, io gioco da fine s6 e quest'anno ho rankato per la prima volta, le altre season ho fatto solo placement. Ti consiglierei prima di tutto di crearti una champion pool prima di tutto e di informarti su: rune, matchup, counters e builds. Per il resto buona fortuna ;)\nE comunque si, l'mmr influirà sull'mmr futuro della s9.","replies":[{"poster":"JusTKyureM8","date":"2018-09-26T10:56:39.508+0000","up_votes":1,"down_votes":0,"body":"ah, capisco, quindi forse è meglio lasciare il mio rank così com'è (bronzo 2 66 lp) e provare a rankare più in là? Non so se le mie skill sono pari a quelle di un bronzo, silver o quant'altro e non so ancora fino a dove posso spingermi (il mio massimo è stato bronzo 1 25 lp)\nAh, poi, essendo nuovo dovrei trovare un ruolo dove mi trovo meglio e dove mi piaccia giocare, ho giocato per un po di tempo solo adc (sivir, tristana, jhin) poi ho cambiato giungla (Yi, Jax, Kayn,Kindred, Vi) poi in midlane (la vecchia akali, katarina, zed, yasuo) e adesso sto provando a giocare toplane (Kled, Jax, Teemo, Yasuo) vorrei ampliare la mia champion pool ma non so come visto che, non avendo tutti i champ e non avendoli provati, non so mai quali prendere (adesso o 7k EB ma non so chi comprare tra Darius, Riven, Gnar o Aatrox)","replies":[{"poster":"uFere","date":"2018-09-26T19:57:49.502+0000","up_votes":1,"down_votes":0,"body":"Questo devi deciderlo tu mate, sei libero anche di non rankare, è sbagliato pensare che lol sia fatto solo di ranked ;)\n>  Non so se le mie skill sono pari a quelle di un bronzo, silver o quant'altro e non so ancora fino a dove posso spingermi (il mio massimo è stato bronzo 1 25 lp)\n\nQuesto lo scoprirai solo rankando .\n\n> Ah, poi, essendo nuovo dovrei trovare un ruolo dove mi trovo meglio e dove mi piaccia giocare, ho giocato per un po di tempo solo adc (sivir, tristana, jhin) poi ho cambiato giungla (Yi, Jax, Kayn,Kindred, Vi) poi in midlane (la vecchia akali, katarina, zed, yasuo) e adesso sto provando a giocare toplane (Kled, Jax, Teemo, Yasuo)\n\nDunque concentrati sul trovare un ruolo che ti piaccia con i relativi champ, cerca di avere almeno 3 champ a lane (15 in tutto) e imparali bene, potresti diventare otp se vuoi concentrarti solo ed esclusivamente su un champ.\n\n>  vorrei ampliare la mia champion pool ma non so come visto che, non avendo tutti i champ e non avendoli provati, non so mai quali prendere (adesso o 7k EB ma non so chi comprare tra Darius, Riven, Gnar o Aatrox)\n\n\nTi consiglio Darius tra quelli che hai consigliato, è il più facile ed è bello tosto da tirare giù se lo sai giocare.","replies":[]}]}]},{"poster":"Sılver","date":"2018-09-25T13:49:23.793+0000","up_votes":1,"down_votes":0,"body":"Il trucco è non fare le ranked, perché poi capita spesso di giocare bene e perdere per colpa di gente che trolla o va afk o ancora feeda e niente la gente che non lo fa di proposito lo fa comunque perché sono delle scimmie quindi a sto punto tanto vale giocare a Monkey Island.\nScherzo, se sei un minimo bravo a basso elo incontrerai spesso della gente senza mani che sentirai chiaramente inferiore a te e ti chiederai cosa ci fa nel tuo stesso elo. Però hey grazie a dio 1 partita su 10 la riesci anche a vincere o comunque non la perderai per colpa degli altri!","replies":[]},{"poster":"Pellah","date":"2018-09-25T11:36:02.070+0000","up_votes":1,"down_votes":0,"body":"Ti addo :)","replies":[]}]}