{"poster":"Shiro Bot","date":"2017-02-28T08:19:29.269+0000","title":"More Refund Tokens","subforum":"Miscellaneous","up_votes":2,"down_votes":1,"body":"I think we should get more refunds token because sometimes u can buy the skin that u want that is on half this week or u just accidentally thought bought a skin without checking(tell your friends to help u press it) it happened to me and it sucks.I think we should get a few refund token like every RP purchase or every new season or just a gift from riot when they need to do a maintenance.","replies":[{"poster":"Nightjar","date":"2018-01-17T03:05:09.462+0000","up_votes":1,"down_votes":0,"body":"one refund token a year upto a cap of 3 would go a long way for some people, for others like myself, we probably wouldn't even notice, I am yet to use a refund token.","replies":[]},{"poster":"Tsuki Susanoo","date":"2018-01-15T20:28:21.245+0000","up_votes":1,"down_votes":0,"body":"I don't think we should be given infinite refund tokens but I think that we should at least be given 1-3 tokens per season considering how much money some individuals spend in the game. Although I do want this, we as players have to take it into consideration how much trouble this could cause riot so maybe its for the best that the system is currently.","replies":[]},{"poster":"QAPLA","date":"2017-03-02T03:31:58.354+0000","up_votes":1,"down_votes":0,"body":"Just think before you buy.\nI've had this account since season 2, and still have 2 refund tokens remaining.\n\nThinking is tech.","replies":[]},{"poster":"Ingénue","date":"2017-02-28T08:40:48.376+0000","up_votes":1,"down_votes":0,"body":"> League of Legends content is intended to be permanent. However we want players to feel good about the content they purchase, so we developed the refund feature to give every player a solution for those rare situations where they purchase content and quickly regret it, and are sure that they will never want to use that content in the future. Many players have never used their refunds, while others have used one, two, or three of them over time.\n>\n>We established a limit of three refunds and still believe that is the right number (this gives players leeway to refund purchases but also protects the overall system from abuse). We’ve explored granting more refunds at times, but discovered that the majority of players would prefer free content instead, so each year we have steadily increased the amount of content players receive just for playing the game. [Refunds and free content both come at considerable cost to Riot, so we have to carefully focus on which to prioritize to deliver value to players and protect our ability to operate as a business.](http://nexus.leagueoflegends.com/2017/01/ask-riot-three-refunds-10-bans/)\n>\n>That said, while we have no current plans to issue more refund tokens in 2017, it is something we will continue to explore in the future as more players hit the three refund cap.","replies":[{"poster":"Kakoda","date":"2017-02-28T22:42:21.126+0000","up_votes":1,"down_votes":0,"body":"I think 3 refund tokens are good when you first create an account. I mean I used mine. I think the reason was I bought a skin and I wanted more camps coz I had an extremely small pool at the time.\n\nI personally think that after you use your 3 tokens 1 refund token wouldn't be bad per season. (Non stacking of course) and maybe like a 1 week limit to refund that item or something.\n\nSometimes you buy a skin or something and are really like well dam this is so not what I thought I hate it! Ether way that will turn into something else but yeah.\n\nThen again in aus I'm pretty sure if we wanted a refund we just message riot and they have to refund our real money. Aus law makes it that they have to for any reason. Can be good and bad.","replies":[{"poster":"Seconds","date":"2017-03-01T20:46:04.059+0000","up_votes":1,"down_votes":0,"body":"I like your Idea tbh after each season get 1 token which ofc (not stacking) refunded i dont think thats too bad.","replies":[]},{"poster":"Ninox","date":"2017-03-01T05:49:02.656+0000","up_votes":1,"down_votes":0,"body":"ACL doesn't cover \"I changed my mind\". It covers things like product defects and the like, but Riot has no obligation to provide a refund for \"I bought this thing and now don't like it\" just as no physical stores do (though quite a few offer anyway).","replies":[]}]}]},{"poster":"JesusForgotHisGA","date":"2017-02-28T09:42:56.381+0000","up_votes":1,"down_votes":0,"body":"Why not simply reset the limit a year after the third refund was processed?\n\nFrom what I understand it's 3 and that's it forever.\n\nThen again it's all about the dollars hey? Can't have people refunding cash once it's in Riots pocket lol.","replies":[]}]}