{"poster":"Vérontó","date":"2017-02-19T00:28:33.407+0000","title":"Régi Fiora :,-(","subforum":"Általános beszélgetés","up_votes":1,"down_votes":9,"body":"Ajh ez cry poszt. Csak annyira hi&aacute;nyzik. Nem tudok elszakadni tőle. Mi&eacute;rt pont őt? Mindenki k&ouml;ny&ouml;rg&ouml;tt WW, Yorick, Poppy rework&eacute;rt de az &ouml;v&eacute; k&eacute;retlen&uuml;l j&ouml;tt. Tudok vele j&aacute;tszani csak mi&eacute;rt kellett nehez&iacute;teni a j&aacute;t&eacute;k&aacute;n. Illetve a legjobb ultija neki volt a vil&aacute;gon &eacute;s helyette kapott egy {{champion:40}} ultit. &Eacute;rtem &eacute;n, hogy erős p&aacute;rbajos de ezt nagyon nem tudja kihaszn&aacute;lni. J&aacute;t&eacute;k elej&eacute;n gyenge, amikort&oacute;l erős lesz akkor meg ritk&aacute;n vannak olyan elvetem&uuml;ltek akik 1v1-be mennek r&aacute;. Csapatharcba meg ha leultizol valakit az elflashel, vagy elugrik vagy valami &eacute;s vele egy&uuml;tt a te ultid is elment. Ut&aacute;na meg t&uacute;l pap&iacute;r maradsz, hogy &eacute;letben maradj. Bocs&aacute;nat csak mindig eszembe jut &eacute;s megn&eacute;zek r&oacute;la egy r&eacute;gi gameplay vide&oacute;t. H&aacute;t ritka meghat&oacute; pillanatokat &eacute;lek &aacute;t. Kb mint a l&aacute;nyok amikor valami nagyon szomor&uacute; romantikus filmet n&eacute;znek. Ah&aacute;nyszor j&aacute;tszom {{champion:114}} annyiszor megerős&iacute;tem magamban, hogy {{champion:164}} hozz&aacute;m illőbb. Kb olyan mint Ő csak sokkal erősebb. Jobban a c&eacute;lpontodon tudsz maradni, jobban menek&uuml;lhetsz, nagyobb sustain. Lehet nem tud olyan gyorsan sebezni de k&ouml;nnyebben lehet v&eacute;grehajtani &eacute;s csapatharcokban is sokkal hasznosabb tudsz lenni mint a kardv&iacute;v&oacute;. B&aacute;rcsak tudn&eacute;k vele &uacute;jra j&aacute;tszani..... \r\n\r\nTess&eacute;k itt egy vide&oacute; amit most n&eacute;ztem meg. Mindenki aki ismerte &eacute;s j&aacute;tszott a r&eacute;givel: k&eacute;sz&iacute;tsetek egy zsepit, meghat&oacute; pillanatok k&ouml;vetkeznek:  https://www.youtube.com/watch?v=sBTHD7vBnf4","replies":[{"poster":"Afelers","date":"2017-02-19T11:56:34.809+0000","up_votes":2,"down_votes":1,"body":"Olyan jó volt az ultija ahogy lenyomtál egy gombot és mindent megcsinált helyetted, te szegény, most csinálnod is kell valamit. Egyébként nem tudom, mit akarsz, két item és 2 sec cd van a Q-ján.","replies":[{"poster":"Vérontó","date":"2017-02-19T11:58:42.808+0000","up_votes":1,"down_votes":4,"body":"Jó de annak nincs olyan sok sebzése meg 2 sec egy fightban sok idő. Meg ha olyan helyre megy a gyenge pont akkor meg fújhatod az egészet. Ja sokkal jobb volt. :D De hát {{champion:11}} Q is ezt csinálja. Meg nem annyira strapabíró már a harcokban mint amilyen a régi volt.","replies":[{"poster":"Nemin","date":"2017-02-19T12:12:57.861+0000","up_votes":2,"down_votes":1,"body":"Fú, tényleg fene a Ritoba, hogy most már kell egy kis skill is a karakterhez, nem a régi R to win sémára épül. \n\nA két másodpercenkénti Q pedig hihetetlen gusztustalan. A legtöbb karakter, aki ugrani képes valahova minimum 5 másodperces, de inkább 8-9-es CD-vel rendelkezik, ennek meg kemény kettő.\n\nA Yinél, meg ha rosszkor nyomod a Q-t, ráfújnak a karakterre és elrepül. Kap egy ignitetot és viszlát.\n---\n[[Technikai/Fiókproblémák megoldása]](https://support.riotgames.com/hc/hu) [[Szabályzat és GYIK]](http://boards.eune.leagueoflegends.com/hu/c/altalanos-beszelgetes/0krXUB6R-a-farumok-szabaalyzata-aos-gyik)","replies":[{"poster":"Vérontó","date":"2017-02-19T13:24:35.682+0000","up_votes":1,"down_votes":5,"body":"Meg kicsi skill. :D Nagyon sok skill kell hozzá. Nézd meg a profilom ingame tudom miről beszélek. Én season eleje óta játszom. Lehet te régebb óta, de eddigi tapasztalataim szerint a nem túl skilles hősök sikeresebbek mint a tényleges skillt igénylők. Nézd meg lolkingen te is. Szerintem tudom igazolni az állításom.","replies":[{"poster":"Mind The Gap","date":"2017-02-19T14:01:58.830+0000","up_votes":2,"down_votes":1,"body":"Szerintem nem. Szerintem a skillesebb champek ugyanannyira erősek tudnak lenni, mint a nem olyan sok/kevés/no skill-t igénylőek, csupán több energia kell a sikerességéhez.","replies":[{"poster":"Vérontó","date":"2017-02-19T16:44:56.575+0000","up_votes":1,"down_votes":6,"body":"Na igen. Több energia kell. És mi van ha azt a több energiát másra használod fel. Pld továbbgondolod a következő stratégiai lépést, a másik ellenfélre is fordítasz időt stb stb. Igazából {{champion:114}} -val az a baj, hogy teamfightokban nem érsz sokat. Hiába vagy a legjobb párbajos ha 2v1-ben jönnek rád. Ha nem vagy elfeedelve ugyan úgy meghalsz. A meccsek csapatharcokban dőlnek el. Most ha leultizol valakit és az {{summoner:4}} vagy valami nagyobb ugrást használ ({{champion:18}} {{champion:121}} {{champion:103}} akkor nem érsz semmit. Ugyan úgy glasscannon vagy ami besült és már csak glass. Nagyon hamar elolvadsz stb. Felhozhatom példának {{champion:80}} aki ugyan úgy szenved lategameben de egyszerűbb vele játszani, snowballpotenciál is nagyobb benne. Illetve late-ben simán oneshotol még mindig egy carry-t anélkül, hogy az tudna reagálni igaz utána nagy valószínűséggel meghal de még ott van a csapata 4 ember a maradék 3 ellen (az ellenfél toplanerét annyira elsnowballozhatta, hogy még valszeg akkor se ér sokat) Illetve lehet fontos cc-ket is benyelt ami szintén panth csapatát erősíti.\n\nDe akkor most jön egy riotos bizonyíték. Nemrég írták az összefoglalást a kiadott hősökről. {{champion:163}} -nál megjegyezték, hogy túl nehéz lett játszani ezért még a profiknál is egy eléggé ritkán játszott hős lett. Nagy valószínűséggel nem akarnak majd ezentúl túl nehéz hősöket kiadni a sziklaszövő példájából okulva.\n\nEz is egy érv ami mellettem szól. De a lényeg. Én nagyon szerettem a régi Fiorát és sajnálom, hogy elvették tőlem ezt a hőst. A régi kitje szerintem még mindig megállná a helyét. Csinálhattak volna egy teljesen másmilyen hőst de ehelyett elvettek egyet. És nekem ez a legnagyobb bajom. Egy jól működő koncepciót vettek el.","replies":[{"poster":"Mind The Gap","date":"2017-02-19T17:14:55.939+0000","up_votes":1,"down_votes":0,"body":"Öhm. Taliyahnak mi köze van a Fiora reworkhöz? A Fiora reworköt előbb adták ki, mint Taliyaht, ergo a bizonyíték is csak később született meg.\n\n>Ha nem vagy elfeedelve ugyan úgy meghalsz.\n\nMint minden champnél.","replies":[{"poster":"Vérontó","date":"2017-02-19T17:26:56.481+0000","up_votes":1,"down_votes":2,"body":"Szerintem erre a riot is rájött, csak taliyah-hoz írták be. De am mindenki panaszkodott először, hogy túl skilles lett.\n\n{{champion:114}} -nak elvileg az a lényege, hogy neki kéne a legjobb párbajosnak lennie. Teát elvileg a 2v1-nek is simán kéne mennie neki. De nem. Hogy mondjam. A játékban többnyire 10 percig van csak 1v1 de akkor mindenki kicsi szintű és farmol. Nem tud ott kibontakozni. És mivel fiora szegény a csapaharcokban nem tud sokat csinálni így ott max golyófogónak lehet használni. Akkor marad a splitpush. De oda meg min 2 de általában 3-an mennek rád. Nincs menekülőspelled semmi véged van. Vagy egyszerűen csak megülik a csapatod 4v5 aztán később visszajönnek érted. Ajh már kezdek belebonyolódni te hidd el így van. Túl nagy árat kérnek a sebzésért és sokkal könnyebb counterelni.","replies":[{"poster":"M4dr4c","date":"2017-02-19T17:34:23.675+0000","up_votes":2,"down_votes":0,"body":"A párbaj 1v1, nem 2v1. És ott jó is. Per pill 50%-os winrate-je van, így azt kell gondolnom nem lett túl bonyolult se. Splitpushnál meg wardolni kell és figyelni a minimapot. Nem pusholunk, ha nem látunk senkit.","replies":[{"poster":"Vérontó","date":"2017-02-19T18:40:35.500+0000","up_votes":1,"down_votes":0,"body":"Jó csak a vision system is elég hát na m1 fejezd ki szépen magad! El lett rontva. Ha nincs sárga trinketed akkor csak azt a piros izét tudod lerakni amiből csak 1 van. Tehát általában csak 2 felől tudsz rálátást biztosítani. Ez így kicsit kevésnek tűnik splitpushoz. Na m1 kezdek megint kibékülni az új fiorával is elvégre ő a mainem és a kedvenc champem meg a legtöbb tapasztalatom is vele van. Csak néha annyira uselessnek tudom érezni magam vele. :/","replies":[]}]}]}]},{"poster":"M4dr4c","date":"2017-02-19T17:02:22.527+0000","up_votes":2,"down_votes":1,"body":"Ez mire bizonyíték? Arra, hogy egy teljesen másik champ, ami semmiben sem hasonlít Fiorára nehezen játszható lett, mert összetett? LOL Egy counter play nélküli, alacsony skillcapre való champből csináltak egy érdekes hőst, amivel és ellen is jó játszani. Szörnyű tett tényleg.","replies":[{"poster":"Vérontó","date":"2017-02-19T17:29:22.501+0000","up_votes":1,"down_votes":1,"body":"Hát a csapatharc Fioraként egy kínszenvedés. De akkor ennyi erőből reworkölhetnék Teemo-t is mert ellene játszani minden csak nem fun. Ugyan úgy Yi-t is, Tryndát is.","replies":[]}]}]}]}]},{"poster":"Vérontó","date":"2017-02-19T13:04:36.138+0000","up_votes":1,"down_votes":5,"body":"{{champion:114}} és egy {{champion:164}} vagy {{champion:24}} ugrást azért ne hasonlítsunk össze. Lehet ritkábban tudják nyomogatni de jobban és biztonságosabban be lehet repülni az ellenfél soraiba mint a 2 másodperces Q-kal. :D","replies":[]}]}]}]},{"poster":"AsD The Dreamer","date":"2017-02-19T08:19:55.987+0000","up_votes":1,"down_votes":1,"body":"Igen kajak rohadt jó volt, amikor benyomta az ultiját és ha nem Jax voltál akkor folyamatosan ment le a hpd magatehetetlenül és még a lifesteallel a hpját is visszatöltötte az ulti közbe.\n\n\n---\nHow can mirrors be real if our eyes aren't real?","replies":[{"poster":"Vérontó","date":"2017-02-19T12:03:40.614+0000","up_votes":1,"down_votes":3,"body":"{{champion:58}} {{champion:75}} {{champion:102}} ezek is jók voltak ellene. Lényegében amikor leultizott felerősítetted magad aztán utána meg backeltél, visszajöttél és simán lecsaptad. Vagy az ulti után tetted meg ezt mert minden mannáját elhasználta. De {{champion:39}} meg egyfolytában spameli az ultiját és meg fel a hp-ja kb ez is ugyan olyan. Ő miért nem kap reworköt ami megnehezíteni a játékát?","replies":[{"poster":"Mind The Gap","date":"2017-02-19T14:04:33.219+0000","up_votes":2,"down_votes":1,"body":"Miért reworköljenek egy champet a Q-ja miatt? Irelia tipikusan nem abba a csoportba tartozik, akik level 2-n megöl csupán azzal, hogy ráül a billentyűzetre.","replies":[{"poster":"Nemin","date":"2017-02-19T14:32:39.853+0000","up_votes":2,"down_votes":0,"body":"Na igen, ahhoz hármas szint kell.\n\n\n---\n[[Technikai/Fiókproblémák megoldása]](https://support.riotgames.com/hc/hu) [[Szabályzat és GYIK]](http://boards.eune.leagueoflegends.com/hu/c/altalanos-beszelgetes/0krXUB6R-a-farumok-szabaalyzata-aos-gyik)","replies":[]},{"poster":"Vérontó","date":"2017-02-19T16:47:42.145+0000","up_votes":1,"down_votes":4,"body":"Hát megtapsolnám ha meg tudott volna ölni lvl 2-n. Ezt most csak 1 hős tudja ez egész játékban: {{champion:92}} . De már ők se nagyon csinálják mert túl rizikós. Vagy csak akkor ha az ellenféllel tudnak egy jót cserélni lvl 1-en. De akkor is fel kell áldozni egy {{summoner:4}} {{summoner:14}} -t minimum. Régi fiora senkit nem ölt meg lvl 2-n max azt aki beszaladt a tornya alá.","replies":[]}]}]}]},{"poster":"Temp65432","date":"2017-02-19T08:46:00.763+0000","up_votes":2,"down_votes":0,"body":"Bárcsak janna kapna 4 auto attacknyi true damaget...szép is lenne\n\n\n---\nNobody is nobody and everybody is weird like you and me.","replies":[{"poster":"Vérontó","date":"2017-02-19T11:59:31.818+0000","up_votes":1,"down_votes":2,"body":"{{summoner:4}} vagy elugrik az ellenfél akkor már semmit nem ér az az ulti. Ez a baj.","replies":[]}]}]}