{"poster":"Nack321","date":"2015-07-07T18:24:41.976+0000","title":"Wieso schafft es Riot nicht mal einen alten nicht so oft gepickten champ zu buffen oder reworken?","subforum":"Allgemeiner Chat","up_votes":2,"down_votes":6,"body":"Ich finde es erlich gesagt schlimm langsam das riot es nicht schafft das sie die alten nicht oft gepickten champs zu reworken oder wenigstens mal nen buff zu geben. Aber jeder andere Champ zb zed oder ash oder wer auch immer wird reworkt oder bekommt schon wieder nen skin bekommt nen buff oder wird gepatch aber andere champs die eigentlich stark und cool sind (zb yorick, urgot , galio,kennen,poppy und zac sind die besten beispiele alle irgendwie stark aber anderer seits br&auml;uchten sie nen buff aber nein sie schaffen es nicht das sie sie mal reworken oder buffen aber daf&uuml;r reworken sie nen champ der e schon super ist zb ash und andere champs die es brauchen w&uuml;rden bekommen keinen) Ich frage mich wieso man k&ouml;nnte das Spiel viel interresanter machen indem man eben nicht nur neue Champs siet sondern auch alte und damit auch ein breiteren Specktrum an Gegner nicht immer nur die gleichen zb Zed mid , caitlin mit blitz bot, shaco jungle , und darius oder Trynda top das wir doch mal fad wenn das so weiter geht. Es w&uuml;rde ja alleine von der Community schon so viele ideen oder Vorschl&auml;ge geben.\nIch hoffe das sieht mal einer von Riot weil in dem bereich sind sie entschuldige wenn ich das sage aber scheise da schaffen nichts. Bitte commentieren warum ihr so abgestimmt habt!!!!\n\nLg Nack321","replies":[{"poster":"Rkoturdo Ndo","date":"2015-07-07T19:21:27.264+0000","up_votes":2,"down_votes":0,"body":"Heya\nMachen sie doch, ich sach nur Sion. Punkt ist, man muss das sorgfältig machen und es kostet viel Zeit.\n\nMfG Rkoturdo","replies":[{"poster":"Nack321","date":"2015-07-07T19:28:04.869+0000","up_votes":1,"down_votes":0,"body":"was kostet so viel zeit das man zb den slow von yorick w erhöht oder den schaden von urgot erhöht bei einem skinn bin ich schon dabei aber lese mal es würde ja auf dem forum und im internet so viele ideen der costum skins die sie einfach nur ein bisschen ändern müssten und schon hätten sie mehr es muss ja kein rework sein und sion ist vorher auch viel gespielt geworden ned nur danach sieh dir mal die stats aus da scheinen diese champs wirklich hervor http://www.lolking.net/charts?region=all&type=champion-unpopularity&range=daily&map=sr&queue=normal\nhttp://www.lolking.net/charts?region=all&type=champion-loserate&range=daily&map=sr&queue=normal\n","replies":[{"poster":"Sree","date":"2015-07-07T19:45:50.311+0000","up_votes":2,"down_votes":0,"body":"Urgot und Yorick sind perfekte Beispiele fuer Champions, die einen Riesen Frust verursachen wuerden, wenn sie mit ihrem derzeitigem Kit wirklich viable waeren. Sie haben das Potential die gegnerische Lane einfach komplett zu dominieren und am farmen zu hindern, sodass man im Prinzip kaum etwas dagegen machen kann. Nur weil sie beide so unbeliebt sind, werden sie von Riot ueberhaupt geduldet, sonst wuerde Riot sie nerfen, bis sie kaum jemand spielt.\nDiese Champions brauchen nicht einfach einen etwas erhoehten Schaden oder etwas mehr Slow, sie brauchen ein komplett neues Kit, damit das Spiel nicht nur dem Urgot/Yorick-Spieler Spass macht, sondern seinem Gegner auch Raum fuer Counterplay bietet. Aus diesem Grund stehen beide auch bereits auf der Liste der Champions, die ueberarbeitet werden.\nEine Ueberarbeitung des kompletten Kits kostet letzendlich sogar mehr Zeit als ein neuer Champion, weil man nicht einfach ein komplett neues Kit nehmen kann. Viele Spieler verbinden mit diesen Champions bereits eine gewisse Spielweise und darauf muss geachtet werden. Man muss also ein neues Kit entwerfen, welches aber gleichzeitig dem Spielgefuehl des alten Kits aehnelt ohne die gleichen Probleme zu verursachen.","replies":[{"poster":"Alustus","date":"2015-07-08T15:39:41.115+0000","up_votes":1,"down_votes":0,"body":"Urgot ist doch im moment viable zumindest im 5 vs 5 Teamrank.","replies":[]},{"poster":"Nack321","date":"2015-07-08T13:05:06.025+0000","up_votes":1,"down_votes":0,"body":"Eine leblance oder zed machen auch ordentlich frust oder ein heimer wenn du ned an champ hast der sehr gut gegen sie ist","replies":[]},{"poster":"Nack321","date":"2015-07-07T20:40:51.051+0000","up_votes":1,"down_votes":2,"body":"stimmt nicht ganz in einem Comment oder war es ein Tweet von Riot stand klipp und klar Yorick sei ein Massiv misslungener champ der aufgegeben ist und nicht reworkt wird \nund was ist mit eeiner kata und yi wenn die als gegner sind hast du das gleiche wie bei yorick nur das man schaun muss das man nicht gegankt wird da man mit yorick schwach ist wenn man nicht gefeedet ist oder es wäre gut wenigstens erklärungs videos heraus zubringen die die champs erklären und in ein besseres licht bringen da sie ja nicht schlecht sind und oft bessere win rates haben als champs die jeder spielt. Auserdem gibt es Champs die in der hinsicht von Lane domination viel schlimmer sind zb {{champion:103}} {{champion:268}} {{champion:81}} {{champion:69}} {{champion:122}} {{champion:105}} {{champion:114}} {{champion:74}} {{champion:85}} {{champion:7}} {{champion:64}} {{champion:90}} {{champion:82}} {{champion:75}} {{champion:133}} {{champion:92}} {{champion:13}} {{champion:91}} {{champion:17}} {{champion:101}} {{champion:106}} {{champion:254}} {{champion:5}} {{champion:157}} {{champion:238}} alles üble gegner vom farmen her weil sie alle was gegen dich gleich killen können wenn du ned aufpasst (wir reden hier von dem wenn der Spieler es kann gibts viel schlimmeres und wenn man yorick oder urgott nicht spielen kann oder ned weis wie man es soll dann hat man e keine chance gegen riven oder darius weil man einfach zu langsam ist oft mals sogar lagsamer mit boots als champs ohne boots die einen immer wegläuft oder nachläuft einholt und killt!  ","replies":[{"poster":"drexxsack","date":"2015-07-07T20:48:30.998+0000","up_votes":1,"down_votes":0,"body":"Kannst du dazu eine Quelle suchen? Derzeit glaube ich dir eher nicht.\nDas aktuellste Statement, das ich gefunden habe, ist, dass das Projekt auf Pause steht, weil andere Dinge gerade Priorität haben\n\nhttp://www.reddit.com/r/leagueoflegends/comments/2spx1r/riot_is_there_any_news_on_the_yorick_rework/","replies":[{"poster":"Nack321","date":"2015-07-07T21:01:17.178+0000","up_votes":1,"down_votes":1,"body":"es hies auch schon mal das sie am rework arbeiten aber  haben es dan verworfen aber ich denke sie reden sich da raus","replies":[]}]},{"poster":"Alustus","date":"2015-07-08T15:37:44.682+0000","up_votes":1,"down_votes":0,"body":"Von all deinen Champs kannich vllt 1-2 nachvollziehen.\n\nLeblanc wurde wegen ihres kits nunja Totgenerft.\n\nheimer kannst du auch ohne counterpick besiegen.\nWie auch der Rest der Champs.","replies":[]},{"poster":"4 R4nd0m N008","date":"2015-07-08T13:14:03.738+0000","up_votes":1,"down_votes":0,"body":"Gegen keinen dieser Champs hättest du eine so schlimme Laningphase wie gegen Yorick, wenn man ihn buffen sollte. Was willst du gegen Yorick noch machen? Er kann sich healen, dich slowen, auf Range lasthitten und dir ordentlich DMG drücken, solltest du zu nah an ihn rankommen. Da sind einfach so gut wie keine Schwachstellen vorhanden die man ausnutzen kann. Es ist einfach so wie Sree bereits beschrieben hat.\n\nGleiches Beispiel bei Poppy, die Aussage von Riot nachdem sie einmal in der LCS gepickt wurde war, sollte sie jemals populär werden, wird sie so hart generft, dass sie niemand mehr Spielen kann. Ohne ein neues Kit lassen sich die Stats nicht besser anpassen.","replies":[]}]}]}]}]},{"poster":"Bergelmir32","date":"2015-07-07T21:24:12.785+0000","up_votes":1,"down_votes":0,"body":"Ich hab mir alles durchgelesen aber nach \"alte nicht oft gespielte Champs werden nicht gereworkt / gebufft aber Ashe schon\" dachte ich mir: \"Was soll da schon noch kommen?\" Und ich hatte Recht! Du weist schon was Ashe vor ihrem Rework war? Alt und nicht oft gespielt!\nPoppy auf der Rework Liste, Yorik auf der Rework Liste, Urgot auf der Rework Liste und keiner davon ist schwach, ganz im Gegenteil (zugegen bei Yorik hab ich keine Ahnung). Zac braucht keinen Buff, Kennen ganz sicher nicht.\n\nGankplank ist in jedem 32. Spiel vorhanden und das bezeichnest du als öfter? Sicher gibt es nicht wenige die noch seltener gepickt werden aber sehr viele die sehr viel öter gepickt werden. Einer der Hauptfehler den du machst ist anzunehmen das Champs einen Buff brauchen nur weil die nicht oft gespielt werden was einfach nur falsch ist und zu noch mehr 100% Pick or Bann Champs in ihren jeweiligen Patches führen würde als wir das eh schon haben.","replies":[{"poster":"Nack321","date":"2015-07-08T12:58:56.463+0000","up_votes":1,"down_votes":0,"body":"Ja aber ich rede ja ned nur von reworks sondern auch von skinns ash war vorher auch schon stark ich hab erst 3 mal yorick als gegner gesehn und hab schon mehr als 700  spiele gespielt yorick ist ned amoi mehr in dem rotaten kreis dabei ash war vorher auch schon stark und hatte eine picktate von 10","replies":[{"poster":"Bergelmir32","date":"2015-07-08T13:18:27.498+0000","up_votes":1,"down_votes":0,"body":"Yorik Poppy und Urgot bekommen keine Skins weil sie signifikante Reworks erwarten und damit auch große visuelle Veränderung. Wenn jetzt Skins raus kommen wäre später das Geschrei nach Refunds umso größer.\n\n> yorick ist ned amoi mehr in dem rotaten kreis\n\nWas?","replies":[{"poster":"Nack321","date":"2015-07-08T14:36:12.626+0000","up_votes":1,"down_votes":0,"body":"Sie sagen schon seit mehr als 3 jahren das yorick ein rework bekommt da er vom entwickler ein fataler fail sei","replies":[{"poster":"Evenrider","date":"2015-07-08T14:45:04.555+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nack321,realm=EUW,application-id=YnZkMR0R,discussion-id=ImRa1qPE,comment-id=0004000000010000,timestamp=2015-07-08T14:36:12.626+0000)\n>\n> Sie sagen schon seit mehr als 3 jahren das yorick ein rework bekommt da er vom entwickler ein fataler fail sei\n\nProblem:\nFür ein Rework sollte man auch sein Feeling einfangen. z.B. bei Sion sein HP Farming und das Schild.\nDenn wenn man nichs übernimmt und ihn komplett neu macht, nun dann kann auch auch einen neuen Champion machen.\nAlso muss man nun erstmal Yoricks und Poppys Feeling herausfinden, also ihr Markenzeichen. Und dann darum einen Champion konzipieren, der immer noch Yorick und Poppy ist das Markenzeichen besitzt und akzeptabel ist (also nicht Broken Kit).\n\nSowas ist scheiße. Wenn du etwas entwickelst und man den Gedanken freien lauf lassen kann geht meist besser, als wenn man das Design, die Art des Champions (Yorick als Ghoulbeschwörer) vorgekaut bekommt und dort nun den Rest drum basteln soll.\nNebenbei:\nZu Poppy hat sich Zenon im Deutschen Forum mal gemeldet. Sie erhält ein Sion Like Rework, d.h. nur 1/1,5 Fähigkeiten werden übernommen und bei ihr soll es ihr E sein, was erhalten bleibt.","replies":[]},{"poster":"HyperionCH","date":"2015-07-08T14:43:56.210+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nack321,realm=EUW,application-id=YnZkMR0R,discussion-id=ImRa1qPE,comment-id=0004000000010000,timestamp=2015-07-08T14:36:12.626+0000)\n>\n> Sie sagen schon seit mehr als 3 jahren das yorick ein rework bekommt da er vom entwickler ein fataler fail sei\n\nIch vermute, so extrem war die Aussage auch wieder nicht.\n\nDas Problem bei einem Rework ist stets: es ist schwieriger als ein neuer Champ zu releasen.\n\nDenn Folgendes muss berücksichtigt werden:\n\n- Er sollte balanced sein (OK, in etwa sollte dies auch ein neuer Champ)\n- Er sollte ins Spiel (im weiten Sinn \"meta\") passen (sonst wäre das Rework umsonst)\n- Das Rework sollte den Charakter des Champs nicht verändern.\n\nDie letzten beiden Punkte sind bei neuen Champs nicht so wichtig; bei einem Rework schon.\nDenn Punkt 2 soll ja dafür sorgen, dass der Champ auch wieder öfter gespielt wird. Dies beisst sich oft mit Punkt 3, da eine zu starke Veränderung den bereits vorgegebenen Charakter zu stark verändert.","replies":[]}]}]},{"poster":"4 R4nd0m N008","date":"2015-07-08T13:15:48.084+0000","up_votes":1,"down_votes":0,"body":"Yorick wird auch nicht mehr in die Rota kommen, genauso wenig wie Poppy. Riot möchte einfach nicht, dass die Champs mit ihrem jetzigen Kit gespielt werden.","replies":[]}]}]},{"poster":"DaKuZá","date":"2015-07-10T02:05:54.362+0000","up_votes":1,"down_votes":0,"body":"TRYNDAMERE TOP.... alter Verfalter, den hab ich ja ewigkeiten nemmer gesehen, lebt der überhaupt noch?\n\n-{{champion:17}}","replies":[{"poster":"Nack321","date":"2015-08-05T06:33:00.713+0000","up_votes":1,"down_votes":0,"body":"ich habe den alle paar spiele top oder jungle das ist so nerfig","replies":[]}]},{"poster":"Stealth Cat","date":"2015-07-07T19:35:54.441+0000","up_votes":1,"down_votes":0,"body":"Urgot war mehrere Monate Meta in der LCS vor kurzem, wieso einen balanced Champion buffen? Galio hat gerade eben einen sehr guten Buff erhalten, seine Ult wurde um einiges stärker.","replies":[{"poster":"Nack321","date":"2015-07-07T19:38:15.790+0000","up_votes":1,"down_votes":0,"body":"Ja ok aber sie sollten mehr machen als nur 1 2 champs in 2-4 Monaten","replies":[{"poster":"itzAce v2","date":"2015-08-04T22:10:10.395+0000","up_votes":1,"down_votes":0,"body":"die haben bei riot auch noch andere aufgaben ^^","replies":[]}]}]},{"poster":"Alustus","date":"2015-07-08T15:42:21.811+0000","up_votes":1,"down_votes":0,"body":"Ashe haben sie ja schon gereworkt.\n\n\nMF und Gangplank kommen jetzt dann.\n\n\npoppy und Yorick, Urgot wurde schon vor einiger Zeit angekündigt dass sie diese Reworken wollen.\nHab ein bisschen geduld.","replies":[]},{"poster":"Nack321","date":"2015-07-07T19:43:53.857+0000","up_votes":1,"down_votes":0,"body":"Da sieht man es wieder ein Champ der öfter gepickt wird Gankplank is überarbeited worden aber grad er würde es ned brauchen","replies":[]}]}