{"poster":"Nack321","date":"2016-09-03T17:14:40.108+0000","title":"Delet Kled oder nerft ihn zu tode","subforum":"Champions & Gameplay","up_votes":2,"down_votes":2,"body":"Es macht einfach keinen Spa&szlig; geegen einen Champ der keinen wirklichen Nachteil hat. Er hat Damage Mobilit&auml;t viel Leben und wenn er farmen kann was man sowieso k&ouml;nnen sollte nach 10 sekunden e wieder sein vieh","replies":[{"poster":"ELOW Cronos","date":"2016-09-04T18:01:12.873+0000","up_votes":4,"down_votes":0,"body":"Also ich würde mich jetzt nicht als Kled-Experten bezeichnen aber die paar mal die ich gegen ihn spielen durfte hatte ich zu keinem Zeitpunkt das Gefühl das er OP ist. Ich finde er ist sogar eher etwas Schwach auf der Brust ^^.","replies":[{"poster":"Merriz","date":"2016-09-06T18:35:27.456+0000","up_votes":1,"down_votes":0,"body":"{{champion:67}} Bin der selben meinung, er ist nicht wirklich stark aber auch nicht extrem schwach ... ich finde solche beiträge sind das selbe wie 'noob champ* oder *op champ* wenn er doch sooo op ist spiele ihn immer gewinne jedes game und werde challenger. @ Nack321","replies":[]}]},{"poster":"Zetryder","date":"2016-09-03T19:36:20.190+0000","up_votes":2,"down_votes":0,"body":"> Es macht einfach keinen Spa&amp;szlig; geegen einen Champ der keinen wirklichen Nachteil hat.\n\n\nHast du mal gesehen wie schnell Kled ohne sein \"reittier\" ist?","replies":[]},{"poster":"BigSnipe","date":"2016-09-03T17:42:48.719+0000","up_votes":2,"down_votes":0,"body":"Weiß gar nicht was du hast...?\nIch hab gestern mit Nasus gegen Kled gespielt. Dürch sein Kit sollte er Nasus ja recht ordentlich einheizen können. Das konnte er auch bis lvl 5, denn sobald ich meine ult, ein paar Stacks und Rüstung hatte war es für ihn gelaufen. \n\nEr kann viel Schaden drücken, muss dafür dann aber auch voll reingehen, jedoch fehlt der richtige disengage. Im Endeffekt ist er reingegangen, wir haben uns dann gegenseitig auf halflife gekloppt. Nachdem er Skarrl verloren hat hat war er komplett useless und musste laufen.\n\nEr sollte mehr machen können wenn Skarrl nicht da ist.","replies":[{"poster":"Taloz","date":"2016-09-03T20:34:59.945+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=BigSnipe,realm=EUW,application-id=Wj1wcocU,discussion-id=FHuxGnTE,comment-id=0003,timestamp=2016-09-03T17:42:48.719+0000)\n>\n> Weiß gar nicht was du hast...?\n> Ich hab gestern mit Nasus gegen Kled gespielt. Dürch sein Kit sollte er Nasus ja recht ordentlich einheizen können. Das konnte er auch bis lvl 5, denn sobald ich meine ult, ein paar Stacks und Rüstung hatte war es für ihn gelaufen. \n> \n> Er kann viel Schaden drücken, muss dafür dann aber auch voll reingehen, jedoch fehlt der richtige disengage. Im Endeffekt ist er reingegangen, wir haben uns dann gegenseitig auf halflife gekloppt. Nachdem er Skarrl verloren hat hat war er komplett useless und musste laufen.\n> \n> Er sollte mehr machen können wenn Skarrl nicht da ist.\n\nZiemlich schlechtes Beispiel. Das kannste bei Nasus auf fast alle (erst recht alle auf attackspeed basierenden) AdToplaner anwenden.\nNasus hat andere Schwächen. Wie z.B dass er erst nach 20 Minuten irgendeinen Nutzen hat. Oder dass er das Kiteopfer nr. 1 ist.","replies":[]}]},{"poster":"UmbraArma","date":"2016-09-03T17:31:10.556+0000","up_votes":2,"down_votes":0,"body":"Wenn man das arme kerlchen nervt kann man ihn auch gleich deleten der ist eh schon so schwach das er eig noch gebufft werden müsste um nützlich zu sein xd","replies":[]},{"poster":"TerrorRaven","date":"2016-09-03T17:17:24.939+0000","up_votes":2,"down_votes":0,"body":"Ich finde ihn eher zu schwach. Sobald er Skaarl verliert, ist er nahezu nutzlos und so gut wie tot.","replies":[{"poster":"BMG Seddy","date":"2016-09-04T17:21:01.380+0000","up_votes":1,"down_votes":0,"body":"Der Sinn dabei ist es denke ich auch mit ihm safe zu spielen, so dass er Skaarl eben nicht verliert oder das \"Vieh\" wie ihn manche so schön nennen ^^","replies":[{"poster":"TerrorRaven","date":"2016-09-04T17:22:22.303+0000","up_votes":1,"down_votes":0,"body":"Nur ist sein Kit darauf ausgelegt, sich mit seinen Kontrahenten konstant zu prügeln.","replies":[{"poster":"Chembaron Yamada","date":"2016-09-07T08:50:49.180+0000","up_votes":1,"down_votes":0,"body":"Richtig. Die ganze Idee hinter Kled ist doch, dass man die ganze Zeit all in geht und sich prügelt bis du oder der Gegner tot ist.\nDafür ist Skaarl doch da. Um dir dein Comeback in schweren Situationen zu sichern.","replies":[]}]}]}]},{"poster":"ThomasLicht","date":"2016-09-07T13:19:06.605+0000","up_votes":1,"down_votes":0,"body":"Wenn du Ranks spielst bann ihn einfach ? oder frag ganz nett ob man ihn bannen kann ? ich glaube dafür ist das system da{{champion:74}}","replies":[]},{"poster":"BMG Seddy","date":"2016-09-04T17:18:28.746+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nack321,realm=EUW,application-id=Wj1wcocU,discussion-id=FHuxGnTE,comment-id=,timestamp=2016-09-03T17:14:40.108+0000)\n>\n> Es macht einfach keinen Spa&amp;szlig; geegen einen Champ der keinen wirklichen Nachteil hat. Er hat Damage Mobilit&amp;auml;t viel Leben und wenn er farmen kann was man sowieso k&amp;ouml;nnen sollte nach 10 sekunden e wieder sein vieh\n\nEs gibt so etwas wie Counterpicks. Champions die andere Champions locker besiegen, aufgrund ihrer Grundfähigkeiten oder ihrer Passives. Ich habe vorhin mal Singed gegen Kled gespielt und der Kled hatte 0 Chancen und musste ständig den Jungler zu Hilfe holen.\nEs kommt drauf an mit welchem Champion du spielst gegen Kled wie bei allen anderen auch ^^","replies":[{"poster":"Chembaron Yamada","date":"2016-09-05T19:05:51.658+0000","up_votes":1,"down_votes":0,"body":"Absolut korrekt, Kled hat counter und das einige.\nMeiner Erfahrung nach bis jetzt ist beispielsweise Tahm Kench ein starker counter für ihn.\nUnd so gut wie jeder Champ, welcher viel CC oder andere Möglichkeiten besitzt, Kled AA's zu verweigern ist sehr stark.\n\nSobald Kled dismounted ist und er Jewalttätige Neigungen aktiv hat, einen CC drauf werfen und er ist hinüber.","replies":[{"poster":"ELOW Cronos","date":"2016-09-07T06:13:10.804+0000","up_votes":1,"down_votes":0,"body":"Könntest du mir mal genauer erläutern warum genau Tahm gut gegen Kled sein soll? =)\n\nIch spiele viel Tahm Kench aber mir fällt gerade nicht auf warum er ein Hardcounter sein soll (ich mein wenn ich Kled fresse sollte dieser dank der Passiv eigentlich immer überleben oder?) ?","replies":[{"poster":"Chembaron Yamada","date":"2016-09-07T07:11:42.133+0000","up_votes":1,"down_votes":0,"body":"Du haust ihm seinen Skaarl runter, während du seinen Damage mit dem Schild tankst. \nSobald er dann absattelt hat er locker schon die 3 Stacks drauf.\nWenn du ihn dann frisst verliert er einen enormen Teil seines Restlebens, ohne dass er in der Lage war Mut für Skaarl aufzubauen. Am besten vorher noch mit der Zunge stunnen.\n\nKled sollte das eig auf keinen Fall überleben. ^^ \nJedenfalls hab ichs so öfter geschafft.","replies":[]}]}]}]},{"poster":"Merriz","date":"2016-09-06T18:34:00.543+0000","up_votes":1,"down_votes":0,"body":"in lol ist kein champion op ... kled schon garnicht ... hättest du das am anfang zu yasuo gesagt .. ok .. aber kled? er ist stark mehr aber auch nicht{{champion:67}}","replies":[]},{"poster":"Nack321","date":"2016-09-03T17:52:39.002+0000","up_votes":1,"down_votes":2,"body":"reden wir vom gleichen champ?","replies":[{"poster":"TerrorRaven","date":"2016-09-03T18:38:42.778+0000","up_votes":1,"down_votes":0,"body":"Ja. Er hat zwar viel Leben, aber wenig Resistanzen. Baue {{item:3153}} und er wird gewaltige Probleme haben. Auch Teemo kommt gut gegen ihn klar, da er mit seinen Q den prozentualen Schaden vom W verhindern kann.","replies":[]}]},{"poster":"thefire7","date":"2016-09-03T17:37:49.490+0000","up_votes":1,"down_votes":0,"body":"er ist schwach, nur tilted er mich skaarl hart","replies":[]}]}