{"poster":"head4honor","date":"2019-06-29T19:51:58.237+0000","title":"Banned after having a flame discussion with a toxic riot employee","subforum":"Player Behavior","up_votes":4,"down_votes":39,"body":"so i wanted to share a story which happened to me a few days ago and i do have some questions for you in terms of legality and the behavoíour of riot employees. \r\n\r\ni am currently plat 1 and i am, i gotta admit, a pretty toxic player. Though i only flame (for my point of view) for reasons, like for people running it down, not listening to pings and therefore feeding... and i also do give negative comments on obviously dumb moves since i expect some kind of game knowledge from hight plat players. This probably also has to do with me beeing very competetive in those kinds of games and also not having too much time to play since i gotta study for university. So each and every game is a lot of invested time and i tryhard every game. So a few days ago i was playing late at night ( about 2 am and i know this was not a good idea) , and i was loosing 3 matches in a row. Therefore i was very frustrated already and there was a bit of flaming done in the previous 2 games ( not too rough though). In the third game i then got put together with my previous support ( i played middle) and a previous toplane, who both were toxic before and with whom i had toxic discussions during the game. Even though the top player was pretty calm, the support was not having it, criticising me for my previous game and soft-flaming me in champ select already. I did not write anything yet and i wanted to focus on the game. After a few minutes into the game both bot and top lost their lane hard and the game was over already since i wasn´t doing great either. somewhere there i snapped and started typing. Even though the toplaner didn´t flame the support was flaming me back. he then continued to grief the game, only pushing botlane while we all tried to defend the base and go for objectives etc. while he typed in all chat to the enemys to end the game, telling me that i don´t deserve to win this. Of course i asked in all chat to report the support for grieving and giving up. after the game he added me, not writing anything. after we both waited i just went for it and told him in private chat to killl himself. he then continued to spam Xd´s and after a while he told me that he was working for riot, and that i can say goodbye to my account. A few moments later I hot a 14 day suspension. \r\n\r\nMy questions are now:\r\n\r\nis he allowed to ban me like that, even though i did flame a bit ingame? \r\ncan i get my ban removed if it was an illegal act from his side ? \r\nhow can a riot employee troll ingame with no punishment ? can i report such an act ? \r\n\r\nthank you for your help and listening to my story","replies":[{"poster":"WoollyWitch","date":"2019-06-29T19:58:15.971+0000","up_votes":16,"down_votes":3,"body":"If you told someone to end their life then of course you deserve punishment. That's not okay no matter how badly they played.\n{{sticker:sg-ahri-3}}","replies":[{"poster":"Big Boss Paludan","date":"2019-08-19T21:21:31.775+0000","up_votes":1,"down_votes":0,"body":"I disagree. \n\nLet's say this is real life. \nIf someone keeps on bullying you and they keep being toxic towards you in real life everyday. \nat some time you just snap and go crazy. its not something you can controll\n\nIm 100% sure that you would tell a bully to kill himself if he was talking down to you all day in REAL LIFE. I know this is just computer game. But i believe that riot employees dosent  care about the REAL victim and they dont think into the context \n\nPlease STEP UP RIOT AND DONT BAN PEOPLE WHO ARE BEING HARASED","replies":[]}]},{"poster":"RallerenP","date":"2019-06-29T20:03:37.543+0000","up_votes":17,"down_votes":4,"body":"You shouldn't believe that they actually work at Riot, that's a super common lie to come up with while being toxic.\n\nIt's MUCH more likely that you actually just got banned by the system for being toxic.","replies":[{"poster":"head4honor","date":"2019-06-29T20:07:23.052+0000","up_votes":3,"down_votes":3,"body":"this appears like a super impossible coincidence, where he tells me that and i get banned 5 minutes later. \n\nso is the behaviour, if he really is a riot employee, reportable ?","replies":[{"poster":"RallerenP","date":"2019-06-29T20:20:49.287+0000","up_votes":8,"down_votes":1,"body":"It's a really plausible coincidence lol\n\nYou were toxic, which gets people banned.\n\nThe automated system reacts quickly to ban people after games.\n\nIt's really not unlikely at all.\n\nAnd even if he *is* a Riot employee, there's no rules against banning toxic players you've encountered personally.\n\nIt is of course not allowed for Riot employees to be toxic. If they are discovered to have been so, their jobs are at stake. But unless the player in question had 'Riot' in their name, then it's probably not a Rioter. \n\nAlso, post your chatlogs. Just your chatlogs, full, unedited. (I have to clarify, because most people try to inject their whole life story between lines, to justify them)","replies":[{"poster":"head4honor","date":"2019-06-29T20:40:08.155+0000","up_votes":2,"down_votes":3,"body":"those are the chatlogs, game one is was the last game, with the brand support being the \"riot employee\":\n\nGame 1\nPre-Game\nhead4honor: lmao\nIn-Game\nhead4honor: ?\nhead4honor: why would u do that yi ?\nhead4honor: ff\nhead4honor: braindead\nhead4honor: i am not as dumb as u i see that\nhead4honor: and i listen to pings\nhead4honor: another fed cait\nhead4honor: thanks botlane\nhead4honor: tf afk\nhead4honor: not worth\nhead4honor: whyyyyy\nhead4honor: go innnn\nhead4honor: i am so done with u braindead animals\nhead4honor: u already lost the game on cho gath u tard\nhead4honor: and no wu go in on that\nhead4honor: #you  braindead retarrd\nhead4honor: yeah fight them again\nhead4honor: this time it will work for sure\nhead4honor: and i am the coinflip huh\nhead4honor: you guys are not human\nhead4honor: 0 ga ks r%%%%%\nhead4honor: lmao\nhead4honor: should have dodged u monkeys\nhead4honor: yes\nhead4honor: not my fault\nhead4honor: none of these deaths\nhead4honor: another fed rek sai\nhead4honor: good job man\nhead4honor: ur a expert in that\nhead4honor: smart\nhead4honor: 0 ganks ma dude\nhead4honor: u complain on not moving ?\nhead4honor: moving for a inter ? no thanks\nhead4honor: wtfff\nhead4honor: having fun botlane\nhead4honor: terrible call\nhead4honor: brand reported\nhead4honor: report brand\nhead4honor: REPORT HIM\nhead4honor: and ur trashhh\nhead4honor: imagine wanting to loose a game\nhead4honor: sad\nhead4honor: fix ur life\nhead4honor: report brand pls\nhead4honor: not really brand XD\nhead4honor: sad mentality\nhead4honor: i flame but i play\nhead4honor: report brand giving up\nPost-Game\nhead4honor: report brand giving up pls\nhead4honor: sad coinflip\nhead4honor: cut ur veins brandd\nGame 2\nIn-Game\nhead4honor: nice int reatard gokysaaatrox\nhead4honor: feed the kata yes\nhead4honor: yes\nhead4honor: smaaart\nhead4honor: free feed for kata\nhead4honor: kata was weak she was behind and u just\nhead4honor: gave it to her\nhead4honor: for free\nhead4honor: u tilt me\nhead4honor: report aatrox intentional feeding\nhead4honor: you one garbbage boy\nhead4honor: don t come inter\nhead4honor: imagine beeing this bad at kata but my team wants to int anyways#\nhead4honor: free kata feed for nothing\nhead4honor: u lost lane\nhead4honor: aatroy inz\nhead4honor: sure kid\nhead4honor: me ???\nhead4honor: sorry for forcing\nhead4honor: Xd\nhead4honor: imagine beeing cokcy playing vs this aatrox XD\nPost-Game\nhead4honor: well look at u aatroy\nhead4honor: uncarriable animal\nGame 3\nIn-Game\nhead4honor: are u dumb\nhead4honor: ok yi and tham\nhead4honor: that was a massive throw\nhead4honor: i am done with ur int yi\nhead4honor: i am done\nhead4honor: stop engagin the fed kayn wtff\nhead4honor: braindamaged\nhead4honor: lmao u mean the tf ult =\nhead4honor: stop invading and get carried u boosted animal\nhead4honor: gokysmasteryi\nhead4honor: it was free\nhead4honor: u know\nhead4honor: and u just int\nhead4honor: i get people like u in my team yi u know\nhead4honor: yi ur so boosted\nhead4honor: report yi intentional feeding\nPost-Game\nhead4honor: report yi running it down\nhead4honor: funny how this yi tried to loose so hard","replies":[{"poster":"head4honor","date":"2019-06-29T20:45:26.680+0000","up_votes":1,"down_votes":4,"body":"the other 2 games are a lot longer ago","replies":[{"poster":"RallerenP","date":"2019-06-29T21:26:57.980+0000","up_votes":9,"down_votes":0,"body":"Yup, you actively encouraged others to commit suicide.\n\nRiot heavily cracks down on that, and the automated system definently catches it most of the time.\n\nThe likelyhood of that guy being a Rioter is extremely low, but even if we ignore that game, the other also would be enough to warrant this punishment. After Game 2 and 3, you'd have been *right* on the edge of getting a 14 day ban. Game 1 was just the last push to actually trigger the automated system.","replies":[]}]},{"poster":"Periscope","date":"2019-06-29T22:59:42.198+0000","up_votes":6,"down_votes":0,"body":"If you're telling others to \"kys\" it wouldn't matter who you're talking to in private messages, as these logs are enough to get you banned.","replies":[]},{"poster":"Prestige Emma","date":"2019-06-30T17:08:45.836+0000","up_votes":3,"down_votes":0,"body":"Honestly speaking, if i would have played with you, be it enemy team or my own, i would have reported you. Calling people names, acting entitled as frick while flaming and telling people to go kill themselves is a sure way to lose a game because it doesnt encourage anyone to play better. All it does is make you look horrendous and the person you flame feels attacked and sad. What you said was wrong and i recommend you to go mute all and not use the chat anymore. Wether or not the dude worked for riot doesnt matter because you deserved a ban in my opinion either way. You are diamond or plat, i forgot, and you should know better. Anyhow, most likely the system picked up the 3 letters before aatrox and banned you. Please work on the way you speak to people that are supposed to be your teammates instead of blaming others.","replies":[]},{"poster":"Best Jinx Iron V","date":"2019-06-30T13:17:34.628+0000","up_votes":3,"down_votes":0,"body":"Fucking hell, I'm surprised if wasn't a perma tbh. You straight up told someone to kill themself","replies":[]},{"poster":"Youtube Buddy","date":"2019-06-30T13:31:21.564+0000","up_votes":2,"down_votes":0,"body":"You flamed the crap out of your team.. While they mightv'e annoyed you, you cant just say that you dont deserve the suspension...\n\nYou spammed people to report that brand. Even if he inted spamming to report him all game wont help and itll just get you banned cause spamming to report someone is considered a negative behavior (i once got chat restricted for spamming to report someone)\n\nYou flamed a lot of times and if the games were close to eachother then people from your other games reported you as well.\n\nI dont want to be rude or an ass or something but from the game chats you sent i think you deserve this 2 week suspension. Maybe there was more but solely from all the things you typed I think that you weny overboard.\n\nRead the logs of the chats you had in game and then tell me if you think that riot shouldnt have banned you for 2 weeks","replies":[]},{"poster":"Zemasu","date":"2019-06-30T13:48:29.652+0000","up_votes":3,"down_votes":1,"body":"You deserve it, stop crying. The game is better without players like you","replies":[]},{"poster":"Big Boss Paludan","date":"2019-08-19T21:23:12.004+0000","up_votes":1,"down_votes":0,"body":"You dont deserve ban\nthey seem like monkeys","replies":[]}]}]},{"poster":"CharDeeMcDenniz","date":"2019-06-29T20:10:36.600+0000","up_votes":5,"down_votes":0,"body":"negative behavior, by anyone, is reportable","replies":[]}]}]},{"poster":"CharDeeMcDenniz","date":"2019-06-29T20:00:16.529+0000","up_votes":14,"down_votes":3,"body":"> [{quoted}](name=head4honor,realm=EUW,application-id=ZGEFLEUQ,discussion-id=EWsQqZRe,comment-id=,timestamp=2019-06-29T19:51:58.237+0000)\n> i just went for it and told him in private chat to killl himself. \n\nnot gonna find much sympathy here","replies":[{"poster":"head4honor","date":"2019-06-29T20:03:28.028+0000","up_votes":4,"down_votes":13,"body":"i do know that and of course i didn´t mean it. i wrote it in a moment of rage. and after the troll and flame i recieved in two games in a row from the same person i couldn´t hold it. it also was a private chat, where your chatlogs shouldn´t be reportable. i actually have had the thought that he tricked me into writing something, so he gets something to ban me.","replies":[{"poster":"CharDeeMcDenniz","date":"2019-06-29T20:06:09.043+0000","up_votes":8,"down_votes":0,"body":"you probably got suspended due to your PATTERN of toxic behavior (by your own admission)\n\nand if for some strange reason this random guy IS is RIOT employee this seems like a just punishment, does that mean he should get off scot free? no but you _really_ dont have a leg to stand on, he didnt \"trick you\" into shit...\n\n...you have bad self control, you said it yourself. end of story.","replies":[{"poster":"head4honor","date":"2019-06-29T20:15:39.939+0000","up_votes":1,"down_votes":7,"body":"first of all i do not try to defend myself man, i do know about my toxic behaviour as mentioned but this is not the topic i am trying to discuss. \n\nI just don´t think that the toxic comments i wrote the previous games are so hrash that they deserve a 14 day suspension. they are toxic, yes, but as far as i know this is very mild flame from my point of view. it almost appears like he picked games which had any kind of toxicity, which i think are necessary, since u get 3 chat logs for proof. \n\ndo you think calling somebody a monkey , or telling them \"i am done with your int\" is a reason to ban somebody ?","replies":[{"poster":"CharDeeMcDenniz","date":"2019-06-29T20:20:41.484+0000","up_votes":10,"down_votes":1,"body":"im not going to go back and forth with you about which is worse flame\n\nyou are toxic, you can try to justify it, you can try to dress it up, you can try to blame it on phantom RIOT employees out to get you but the fact remains. you. are. toxic.\n\nyou told someone **to kill themself!!!** over a goddam video game and now I'm supposed to just take your word for it that you dont talk like that previously? get real man\n\nthis is not RIOT targeting you, this is your own behavior catching up to you (finally)","replies":[{"poster":"head4honor","date":"2019-06-29T20:28:40.842+0000","up_votes":1,"down_votes":5,"body":"if you want me to tell me with this that, yes, these comments are bannable then thank you. \ni don´t really understand the dynamic ur creating though i am not trying to justify myself i am trying to find answers. jesus","replies":[{"poster":"CharDeeMcDenniz","date":"2019-06-29T20:34:29.442+0000","up_votes":4,"down_votes":0,"body":"what answer?\n\nif someone flamed you in game, no matter who they are, you can report it. This was said already\n\nno one in your last game has a username that even comes close to what typical RIOT usernames are so that excuse is looking worse and worse\n\nwant me to go 1 by 1 off your op? NP\n\n1. is he allowed to ban me like that, even though i did flame a bit ingame? **Yes, you are toxic**\n2. can i get my ban removed if it was an illegal act from his side ? **No, you are toxic**\n3. how can a riot employee troll ingame with no punishment, can i report such an act? **Yes you can.**","replies":[]}]},{"poster":"The Rapture","date":"2019-06-30T10:15:03.237+0000","up_votes":2,"down_votes":2,"body":"I mean some genetics shouldn’t be passed on. Not hinting at anything just making a statement","replies":[]}]},{"poster":"Ganburedo","date":"2019-06-30T15:59:28.674+0000","up_votes":3,"down_votes":0,"body":"You don't think that telling some1 to cut their veins is harsh? That's post Game 1, if you ask me you should get a for life ban. People like you are what is wrong with this game.","replies":[]}]}]}]}]},{"poster":"MïlkTea","date":"2019-06-30T02:10:58.874+0000","up_votes":7,"down_votes":0,"body":"Calling people braindead, telling them to cut their veins, constantly being negative and extremely toxic (yes, you saying \"a little toxic\" isn't saving anything.) and as you admit, telling them to kill themselves in any possible way. \nYou flaming people won't make them play better. \nEven if that was an actual riot employee or not, if i was the one in charge, i would have perma banned you, 14 days seems too soft.\nStop trying to show what you did \"a little\".","replies":[]},{"poster":"Robert999220","date":"2019-06-30T01:52:28.935+0000","up_votes":6,"down_votes":0,"body":"I signed in just to say good riddance. You told the dude to kill himself for what you deem 'trolling', that alone deserves a ban. End of discussion.\n\nDoesnt even count the chatlog lmao.","replies":[]},{"poster":"Pùls","date":"2019-06-30T00:44:08.617+0000","up_votes":6,"down_votes":0,"body":"You literally told this dude to kill himself. And you wonder why you got banned? Think about what you said. And then get back to me.","replies":[]},{"poster":"Imperial Pandaa","date":"2019-06-29T20:02:16.894+0000","up_votes":8,"down_votes":2,"body":"I really doubt they were a Riot Employee. You can submit a support ticket, but they may still keep the punishment for flaming in game, which is probably the chat logs provided; or for telling someone to \"kys\" in private comms.","replies":[]},{"poster":"Origami Anivia","date":"2019-06-30T02:55:54.989+0000","up_votes":6,"down_votes":1,"body":"Sorry you told someone to kill themselves over a videogame. You don't deserve to play the game and I don't understand how you even got plat with that mentality.\nStop looking at what other people are doing and focus on yourself, if someone's negative to you then mute them.\nThere's also never a reason to flame anyone ever. They make a shit okay deal with it, they run it down, report them after the game. \nIt's so f.ing simple how can you not get that? \nLike I just don't understand how people can flame people knowing full well it won't help anyone. \nGive me a reason (1 actual reason) that it's okay to flame or be toxic.\n\nBottom line, tell someone to kys and you deserve banning.","replies":[{"poster":"Origami Anivia","date":"2019-06-30T02:59:49.117+0000","up_votes":5,"down_votes":0,"body":"You know it's actually laughable that you don't get why you were banned. You told someone to cut themselves and kill themselves, you're actually a garbage person. You can't control yourself or be a decent human being saying shit like that. You fully deserve what you get.","replies":[]},{"poster":"The Rapture","date":"2019-06-30T10:22:22.421+0000","up_votes":1,"down_votes":6,"body":"Ummm I mean..... with all do respect people are soft as fuck these days if you let a little flame get to you maybe you don’t need to be having online interactions. If the words of a stranger gets to you that much then read a book. Just saying if someone telling you to kys online impacts you that much you should solve your real life issues cause growing up in Long Beach and watching 2 of my friends die in front of me I can tell you that someone saying kys is the least of my worries maybe I’m just built differently idk. #NorfNorf #FreelilRobbie","replies":[{"poster":"Krimko","date":"2019-06-30T13:44:56.892+0000","up_votes":3,"down_votes":0,"body":"Such a weak stance, no body cares about your lack of decency or made up past.\n\n\"I mean, if people are offended by racism then that's on them, they're not as strong as me. I grew up in the racism and saw blah blah blah, they should just be stronger\"","replies":[{"poster":"Imperial Pandaa","date":"2019-06-30T18:48:07.637+0000","up_votes":1,"down_votes":0,"body":"You shoulda used this instead of the racism quote.\n\n\"Oh, you think the darkness is your ally, you merely adopted the dark. I was born in it, molded by it. I didn't see the light until I was already a man; by then, it was nothing to me but blinding! The shadows betray you, because they belong to me.\"","replies":[]}]}]}]},{"poster":"rinnychuu","date":"2019-06-30T02:02:47.633+0000","up_votes":5,"down_votes":0,"body":"i believe your punishment was just. you were toxic and your ban/suspension is likely cause you're repeatedly toxic. also you told someone to end their life, and i believe even if its in private message it should be reportable. \n\nriot employee or not, you were toxic and that's on you. also dont forget YOU CAN REPORT HIM TO! also you can email riot straight away for that person being toxic and, if they were lying, can get banned for impersonating a riot employee.","replies":[]},{"poster":"ToxicAngel47","date":"2019-06-30T16:43:50.970+0000","up_votes":3,"down_votes":0,"body":"OP you deserve the ban. You are toxic. I have been chat restricted a couple of times but I am not even in the same league as you regarding toxicity. \n\nOne tip though: I realized I play much better personally if I mute a player on the first indication of flaming. Concentrating more on the game and not typing helps to win. Try it, it will help.","replies":[]},{"poster":"Ltdash","date":"2019-06-30T11:13:49.557+0000","up_votes":3,"down_votes":0,"body":"If I was the riot employee I would of permabanned you. You go around flaming EVERY SINGLE GAME and tell people to kill themselves? And you have the nerve to ask for a ban appeal? When you eventually fail uni just a heads up you can't \"appeal your grade because of a toxic tutor\" after revealing you done none of the work. Your actions have consequences buddy, welcome to the real world. \n\nAlso I don't know why you think admitting your toxic makes it ok to be toxic? Maybe you've watched too much BoJack horseman? \n\nEither way you got off lightly but I'm sure you've got another pre-purchases level 30 waiting for you in prep for your 5th perma ban.","replies":[]},{"poster":"KFCeytron","date":"2019-06-29T21:23:11.584+0000","up_votes":3,"down_votes":0,"body":"Post hoc, ergo propter hoc.","replies":[]},{"poster":"Dromar421","date":"2019-06-29T20:08:45.880+0000","up_votes":1,"down_votes":14,"body":"I had a Riot employee in a game 2 nights ago about 2 am ETZ that trolled up a game for me also. But I think the only thing that saved me was I did not flame. I simply asked why would you troll like this? He just spammed a Garen Cheese emote over and over.. I asked if we could surrender and of course being bronze no one would. Though I have to give it to him he did not feed or anything like that, but he really made a disaster of the game which my team lost. I lost LP of course and have been on a pretty bad lose streak since then. Sadly that is what they were in your game for. That is part of their investigation for a player that has been reported for toxic behavior. They go in and do everything but feed to set the said player off to have proof that the ban is warranted. Sadly they can do what they want with out any repercussions. Yes they do play in games with out a Riot Tag so if you are toxic and it is a behavior that has caught their attention you will see one and never know it is them.","replies":[{"poster":"CharDeeMcDenniz","date":"2019-06-29T20:10:04.387+0000","up_votes":2,"down_votes":0,"body":"what exactly makes you think it was a RIOT employee?","replies":[{"poster":"Dromar421","date":"2019-06-29T20:35:19.778+0000","up_votes":1,"down_votes":8,"body":"> [{quoted}](name=CharDeeMcDenniz,realm=NA,application-id=ZGEFLEUQ,discussion-id=EWsQqZRe,comment-id=00040000,timestamp=2019-06-29T20:10:04.387+0000)\n>\n> what exactly makes you think it was a RIOT employee?\n\nI had met this same player back in season 7, and they played the same champ. Any ways I sent a in game report about said player. Because well they were trolling the shit out of my game. Well the funny thing was the person I sent the report on sent me a friend invite. So I accepted and we had a nice little talk about how I was very close to the line at the time of having my account banned do to my toxic attitude. He/She told me that I had not quite went over the line but I was close enough that he/she thought that he/she should take the time to talk to me.. He told me that he/she seen the report that I had sent and he/she would take care of it. I never once during any of our conversation say that I had sent the report but he/she was able to give me word for word what was in it..","replies":[{"poster":"head4honor","date":"2019-06-29T20:42:34.790+0000","up_votes":1,"down_votes":4,"body":"sounds very similar to the friend invite he sent me, though he never started a conversation","replies":[{"poster":"Dromar421","date":"2019-06-29T20:57:35.119+0000","up_votes":1,"down_votes":4,"body":"> [{quoted}](name=head4honor,realm=EUW,application-id=ZGEFLEUQ,discussion-id=EWsQqZRe,comment-id=0004000000000000,timestamp=2019-06-29T20:42:34.790+0000)\n>\n> sounds very similar to the friend invite he sent me, though he never started a conversation\n\nYeah this one did not just strike up a conversation either. I of course started the dialog with him. Then the conversation followed.. Mine went more along the line of umm hello.. They just replied Hi. I asked calmly and nicely, why would you come into a game and mess it up for 9 people, his reply was I don't know.. I was still steaming but kept my cool. He then asked me, it was fun though right? {{sticker:zombie-brand-mindblown}} I just wanted to blow a fuse at that point.","replies":[{"poster":"head4honor","date":"2019-06-29T21:15:26.607+0000","up_votes":1,"down_votes":5,"body":"should have done the same. yikes","replies":[{"poster":"Añïvïa","date":"2019-06-30T09:04:11.610+0000","up_votes":4,"down_votes":0,"body":"You are both either sociopaths or imbeciles. What is more likely here - a Rioter is consistently toxic in game, which is likely to cost them their job before long, or you're both paranoid idiots, and believe people when they tell you they work for Riot even though you have no reason to.","replies":[{"poster":"CharDeeMcDenniz","date":"2019-06-30T10:23:11.345+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Añïvïa,realm=EUW,application-id=ZGEFLEUQ,discussion-id=EWsQqZRe,comment-id=0004000000000000000000000000,timestamp=2019-06-30T09:04:11.610+0000)\n>\n> You are both either sociopaths or imbeciles. What is more likely here - a Rioter is consistently toxic in game, which is likely to cost them their job before long, or you're both paranoid idiots, and believe people when they tell you they work for Riot even though you have no reason to.\n\nthis this SOOOOOOOO much this","replies":[]}]}]}]}]}]}]}]},{"poster":"guyonabuff4lo","date":"2019-06-30T20:17:46.947+0000","up_votes":2,"down_votes":0,"body":"Not gonna lie, talk like that serves you right to get a two week ban. It's a game, dude. I think, in my short time of playing League, the community is even more toxic than Overwatch. That is saying A LOT. I think in your two weeks off, you should figure out how to chill the f*@! out. \n\nEncouraging suicide is absolutely ridiculous. Glad you got what you deserved.","replies":[]},{"poster":"Legendary Anubis","date":"2019-06-30T17:55:39.601+0000","up_votes":2,"down_votes":0,"body":"Jesus you’re entitled OP. You admitted at the very beginning and several times throughout your post that you were being toxic. Whether or not the guy was an employee, you deserved the ban.","replies":[]},{"poster":"Hunnibelle","date":"2019-06-30T15:20:19.626+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=head4honor,realm=EUW,application-id=ZGEFLEUQ,discussion-id=EWsQqZRe,comment-id=,timestamp=2019-06-29T19:51:58.237+0000)\n>\n> so i wanted to share a story which happened to me a few days ago and i do have some questions for you in terms of legality and the behavoíour of riot employees. \n> \n> i am currently plat 1 and i am, i gotta admit, a pretty toxic player...\n\nThat's how far I got before I stopped reading. Nice to know Rito is still doing something right.\n\nThanks Rito! 👍","replies":[]},{"poster":"Déjà Wu","date":"2019-06-30T15:12:56.154+0000","up_votes":2,"down_votes":0,"body":"To put it simply. I lost my 9 year old account due to toxicity and you seem a lot worse than I was no where as toxic as you. I suggest you change your attitude or say goodbye to your account. Regardless of if he was a riot employee or not your attitude is really bad","replies":[]},{"poster":"AimeeXO","date":"2019-06-30T14:47:50.648+0000","up_votes":2,"down_votes":0,"body":"You told multiple people to kill themselves and you're arguing about a ban?! Your parents would be so ashamed of you kiddo. Go and tell then what you've been saying to people online, because your dad needs to beat the hell out of you. Grow up, because you speak like that in the real world and the only body around will be yours.","replies":[]}]}