{"poster":"Bl4ckTruffle","date":"2015-05-22T13:03:38.205+0000","title":"Disconnessione","subforum":"Discussioni generali","up_votes":1,"down_votes":3,"body":"Ma sono l&#039;unico che si becca la coda a bassa priorit&agrave; perch&eacute; il client mi da problemi, adesso stavo facendo una partita e mi si &egrave; disconnesso anche se ho internet che mi va a meraviglia, va benissimo, ma mi si &egrave; disconnesso lo stesso allora sono dovuto uscire e adesso non mi si riconnette pi&ugrave; ho cliccato pi&ugrave; e pi&ugrave; volte su riconnetti, riprova ma niente, sono anche riuscito e rientrato due volte ma niente, se mi becco queste code non &egrave; colpa mia ma de sto coso, io non ho nessun problema &egrave; lol che ha problemi con me....\r\nInsomma non riesco ad entrare pi&ugrave; in partita e quindi cosa mi succede se ho gi&agrave; da affrontare 5  partite a bassa priorit&agrave; ( sempre per colpa de sto client o roba cos&igrave; e non per internet) e sicuro mi dar&agrave; anche questa, che non sono riuscito a recuperare fin ora,come disertore?","replies":[{"poster":"Bl4ckTruffle","date":"2015-11-03T11:39:47.486+0000","up_votes":1,"down_votes":0,"body":"io il post l'ho fatto 5 mesi fa, ora non ne ho di questi problemi ma ti posso dire ( anche se non ti consolerà molto) che il problema mi si è risolto grazie alla riot e agli aggiustamenti che ha fatto dopo la patch di 5 mesi fa... mi spiace non esserti più utile...","replies":[]},{"poster":"VLNC Cyanide","date":"2015-11-01T21:37:14.790+0000","up_votes":1,"down_votes":0,"body":"Mi trovo nella medesima situazione. Stavo facendo qualche ranked oggi e nell'ultima mi ha dato \"tentativo di riconnessione...\" a pochi minuti dall'inizio della partita... che di conseguenza ho perso... e così mi sono rovinato la winning streak di 4 o 5 partite, sono stato considerato Disertore, ho perso 21 PL e mi sono beccato 5 partite in coda a bassa priorità dal Leaverbuster. Sono molto alterato. Anche perchè di Rp ne compro ogni tanto e non sono uno che va AFK di proposito.{{champion:63}} {{champion:63}} {{champion:63}} {{champion:63}} {{champion:63}} {{champion:63}} {{champion:63}} {{champion:63}}","replies":[]},{"poster":"Mastro Olio","date":"2015-05-22T15:58:52.581+0000","up_votes":1,"down_votes":0,"body":"Hai problemi con la connessione. Complimenti per il nickname originalissimo comunque. {{champion:115}}","replies":[{"poster":"Bl4ckTruffle","date":"2015-06-27T00:42:38.864+0000","up_votes":1,"down_votes":0,"body":"sto in ritardo per rispondere, ma senza che ci dilunghiamo in chiacchiere ti rispondo solo dicendoti solamente \"grazie!!!\" per la risposta.... ahahh si ho un bel nick name","replies":[]}]}]}