{"poster":"cyanior","date":"2015-03-28T22:47:32.527+0000","title":"DDOS Attacke im Ranked? Hilfe :(","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":1,"body":"Hallo,\r\nIch war heute mit zwei Mitspielern im 3er Ranked unterwegs, als wir pl&ouml;tzlich von heftigen Lags geplagt wurden. Die Lags erzeugten stets einen Disconnect und einen Ping von 500ms. Laut Riot gab es jedochkeinerlei Probleme heute. Das Spiel wird nicht in der Matchhistory angezeigt und auch in der Freundesliste unter &quot;recently played with&quot; tauchen die Spieler nicht auf. Die Lags waren stets zu Gunsten der Gegner und wir haben verloren. \r\nDoch damit nicht genug. Unsere Clients stecken regelrecht in dem Spiel fest. Einer von uns kann zu dem Spiel stets &quot;reconnecten&quot; und sieht keinen Startbildschrim. Jedoch l&auml;dt das Spiel nat&uuml;rlich nicht. Die andern beiden sehen beim reloggen zwar einen Startbildschirm, k&ouml;nnen jedoch keine Spiele starten oder andere Spieler einladen, da wir ja noch &quot;ingame&quot; sein. Zudem k&ouml;nnen Unbeteiligte noch immer das Spiel &quot;spectaten&quot;. \r\nIch bitte um Mithilfe, bin sehr ratlos. Ich w&uuml;rde zudem gerne die Spieler melden. Wo genau kann ich das tun? Der Bildschirm nach Ende des Spieles kam leider auch nicht um die Gegner reporten zu k&ouml;nnen :(\r\nDanke f&uuml;r jede Hilfe!","replies":[{"poster":"cremnik","date":"2015-03-28T23:10:22.454+0000","up_votes":3,"down_votes":0,"body":"Wenn du Probleme hast kannst du dich immer an den [Support](https://support.riotgames.com/hc/de) wenden, aber da das Spiel nicht einsehbar ist, weißt du wahrscheinlich die Namen deiner Gegner nicht mehr. Ansonsten wäre ich immer vorsichtig mit solchen Anschuldigungen. Das kann vielfältige Gründe haben....","replies":[]},{"poster":"Crowned Clown Ex","date":"2015-03-28T22:50:48.170+0000","up_votes":1,"down_votes":0,"body":"Das war kein Hacker, die Server haben gerade Probleme. Ist nicht nur dir passiert, Amigo. Mein Kumpel und ich haben genau das gleiche Problem und können nicht spielen (trotz Sieg).","replies":[]}]}