{"poster":"Common Satyr","date":"2017-05-30T15:50:19.646+0000","title":"Cost analysis of college tuition over the years in relation to minimum wage.","subforum":"[ARCHIVED] General Discussion","embed":{"description":"Let's turn that frown upside down ! Visit WannaLOL for the best funny images from around the internet","url":"http://www.wannalol.com/p/764249","image":"http://www.wannalol.com/PostImages/thumb/764249.jpg"},"up_votes":4,"down_votes":1,"body":"So just a few things I&#039;d like to add to the link that lays out the argument (which I find no flaw in their logic, until they assign blame.)\r\n\r\nThey made this post which is a good post, to tell the right wing that they are not lazy college is just really expensive now. And They are right college is really expensive and should be cheaper. The problem I have is that most people on the right I know at least don&#039;t claim that our generation is lazy. In fact they agree that college should be cheaper. Where we differ is in our solution to the problem and more importantly our understanding of how the problem came to be. \r\n\r\nThe solution to making collage cheaper oddly enough is less government intervention not more. It is in fact having the government no longer tell collages that the government will foot the bill for students that cant afford collage. This means less grants, less student loan forgiveness, less footing the bill. \r\n\r\nLook I know that sounds backwards but bare with me: Take a moment and pretend you were a business owner and you sold a product for $5.00, we will call this product Good A. Now Good A is very popular and is in high demand, in fact the government thinks everyone should have Good A so they tell you that everyone who can&#039;t afford Good A can still buy it, the government will just foot the bill for the difference. \r\n\r\nFor sake of argument lets say the population of the populace is 1000 people. So now 1000 people get Good A assuming everyone buys it that can. Meaning you take in revenue of $5000. Now what happens if you happen to decide to make the price of Good A $10.00? Well the government still wants to foot the bill, after all they promised the population that they would make sure everyone gets Good  A and no politician wants to come out and say they can no longer afford it. So now all 1000 people get Good A and you now take in Revenue of $10,000. Congrats you just doubled your profits. \r\n\r\nLook I want people to go to collage, I want them to make good decisions and get good degrees as much as you. But the solution is not to get rid of the free Market and have the government intervene. Government is the problem even if they are trying to help and mean well. Life makes so much more sense when you understand that the government sucks at everything. \r\n\r\nWell sorry for the little rant, I don&#039;t mean this in any offensive way, I just like politics :) Feel free to comment and have a good discussion about all this. Maybe I am wrong and I am missing something. Let me know below, Ill try to check back through out the day. But a better place to reach me is in my stream chat. Ill be streaming most the day, feel free to come hang out and chat, debate, say hi, or w/e. \r\n\r\nhttps://www.twitch.tv/commonsatyr\r\n\r\nSong request is on, so feel free to request music!\r\n\r\nPS: remember the GD rules state political discussion is okay as long as we keep it civil, so please keep it civil!","replies":[]}