{"poster":"Wild Nida","date":"2016-03-19T19:26:09.486+0000","title":"Problema Latencia ( MS ) Altos","subforum":"Problemas Técnicos","up_votes":2,"down_votes":0,"body":"Hola ! Quisiera saber si soy el unico que tiene ms altos, por lo general juego con 34 ms y desde hace 2 dias tengo MS altos, alrededor de los 100ms, ayer a la noche jugue lo mas bien, pero hoy vuelve al mismo problema. Por ende queria saber si es problema de los servidores de riot, porque de hecho cambie la placa de red, el cable y hasta me compre un router. Ademas de haber formateado etc ( Igual esto hace rato que lo tenia que hacer ), desde ya muchas gracias por su atencion\r\n\r\n\r\nShiina-{{champion:76}}","replies":[{"poster":"789456123","date":"2016-03-19T21:36:06.705+0000","up_votes":1,"down_votes":0,"body":"Tengo mas de 1000 ms. Me sale reanudando conexión cada 5 segundos (No exagero) La verdad nose que pasa. Algunos dicen que les pasa lo mismo y a otros no{{item:3151}}","replies":[]},{"poster":"Sonya Kyron","date":"2016-03-19T19:30:53.961+0000","up_votes":1,"down_votes":1,"body":"Debe ser una falla en tu configuración, porque si son cables o router directamente te da perdida de paquetes.\nEl server anda genial solo fallo 2 veces una el 29 de diciembre y la otra fue los primeros dias de febrero.\n\nTambien se saturo SPEEDY un dia despues de la Fiesta de Las Mascaras pero eso hacia que le falle solo a los de Speedy.\n\nAhora si tenes las herramientas para configurarlo como estaba vas a volver a tener el mismo ping cuando lo termines de configurar correctamente.\nUsa el ping tool para hacer pruebas etc.","replies":[{"poster":"XxXTheIanXxX","date":"2016-03-19T19:47:49.887+0000","up_votes":1,"down_votes":0,"body":"Yo estoy igual desde la actualización de los clubes, +100 ms, ni con el wtfast puedo llegar a mantenerlo en menos de 100","replies":[{"poster":"Sonya Kyron","date":"2016-03-19T20:25:26.858+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=XxXTheIanXxX,realm=LAS,application-id=X54mVVp0,discussion-id=kwKYnN64,comment-id=00000000,timestamp=2016-03-19T19:47:49.887+0000)\n>\n> Yo estoy igual desde la actualización de los clubes, +100 ms, ni con el wtfast puedo llegar a mantenerlo en menos de 100\n\nPero vos donde jugas? el WTFast solo sirve en europa aca te aumenta 100ms, usarlo es como perder a propósito. Te dibuja los ms, y tenes un delay que te queres matar, a todos los que se lo desinstale les anda mejor el LOL.\n\nYo jugué con conexión \"filtrada\" en EUW 179ms y andaba perfecto sin nada de lag, y con conexiones \"no filtradas\" de 14ms, superlagueadas.\nEl tema es cuando a una conexión de esas de 14ms-15ms la filtre vi la realidad era 355ms-385ms REALES. Después configure todo y se lo pude dejar en 55ms fijos.\n\nActualmente es muy difícil que alguien sepa realmente cuando esta simulada o es real la conexión.","replies":[{"poster":"Emma Mirra","date":"2016-03-19T20:35:17.370+0000","up_votes":1,"down_votes":0,"body":"Noto que sabes mucho del tema y agradecería si me podes dar una mano.","replies":[{"poster":"Sonya Kyron","date":"2016-03-19T20:44:07.061+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Emma Mirra,realm=LAS,application-id=X54mVVp0,discussion-id=kwKYnN64,comment-id=0000000000000000,timestamp=2016-03-19T20:35:17.370+0000)\n>\n> Noto que sabes mucho del tema y agradecería si me podes dar una mano.\n\nPuedo pero me tenes que agregar de amigo, porque en este momento estoy en partida, así que vas a tener que esperar a que salga.","replies":[]}]}]}]}]},{"poster":"Wild Nida","date":"2016-03-19T19:51:54.470+0000","up_votes":1,"down_votes":0,"body":"He probado todo y parece todo normal. No tengo perdidas ni nada por el estilo, el tema es que algunos usarios andan con este problema y otros no. Es algo que no entiendo la verdad.","replies":[]}]}