{"poster":"Drius of Heart","date":"2016-06-15T10:10:34.832+0000","title":"are you guys f*king serius?","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":6,"body":"hey im playing leagues to finish my ban you guys give me 20 min,i waited until finish then it lagges out then i restart n it tells me the server us is unnavailable? r u guys fucking serius? reply me what the hell is wrong ure wasting my time","replies":[{"poster":"Son Golin","date":"2016-06-15T18:02:23.958+0000","up_votes":4,"down_votes":0,"body":"Hey Drius of Heart,\n\nThat sucks to hear; it sounds like you were possibly waiting for a queue dodging cool down, but it expired when we started deploying the patch to the server. We should have a ticker and an update to the [Server Status Page](http://status.leagueoflegends.com/?en_US#na) to tell you it is going on. We shut off game creations at a certain point so players do not get kicked out while the patching is taking place.\n\nAs for your FPS dropping slowly to 0, that's not common either. I just tried a Custom Game and it's not exhibiting the same behavior. Usually dropping to 0 FPS mean your game client has frozen, but when the game client crashes or freezes; it doesn't normally go down 1-by-1 it's usually more catastrophic. If it's only happening after the patch, you might need to re-download the patch, if it's happened to some degree before, you might want to [update your video drivers](https://support.riotgames.com/hc/en-us/articles/201761974-Bug-Splat-and-Game-Crashes#wq2) or [drop the graphical settings in-game](https://support.riotgames.com/hc/en-us/articles/201761974-Bug-Splat-and-Game-Crashes#wq9).\n\nIf you continue to have difficulties with your FPS, please reach out to my colleagues through the Support Site and we'll take a further look into what may be causing your in-game performance woes: https://support.riotgames.com/hc/requests/new","replies":[]},{"poster":"Masalar","date":"2016-06-15T20:01:08.619+0000","up_votes":1,"down_votes":0,"body":"Just as a heads up...if the way you're behaving in this thread is indicative of how you behave in game...you'll likely receive another punishment.","replies":[{"poster":"iisabrina","date":"2016-06-30T21:07:44.616+0000","up_votes":1,"down_votes":1,"body":"Just a heads up, if the way youre behaving in this thread is indicative of how you behave in real life, youre going to get your ass kicked.","replies":[{"poster":"Masalar","date":"2016-07-01T00:35:50.867+0000","up_votes":1,"down_votes":0,"body":"Yes, polite disagreement is the sign of weakness. Quick, I must flee, he's figured me out!","replies":[]}]}]},{"poster":"Drius of Heart","date":"2016-06-18T09:31:29.996+0000","up_votes":1,"down_votes":0,"body":"ill wait for your reply =3","replies":[]},{"poster":"Drius of Heart","date":"2016-06-18T09:28:41.197+0000","up_votes":1,"down_votes":0,"body":"soooo i have a nother issue! i was in character select for rank game before i can lock in the client crash tell me if is it my problem or your before i have nerd rage again.. =) you banned me 5 min again wow really riot i wish you event the setting for knows whos fault n not fault here thanks breh =3","replies":[]},{"poster":"Drius of Heart","date":"2016-06-17T10:03:13.378+0000","up_votes":1,"down_votes":0,"body":"finally you guys reply ok2 let me answer this \n1.Tq riot <3\n2.im behaving like this because of that lag makes me have a banned time but ilittelary didnt do it on purpose how you feel if you in the promo game n its your final game in promo suddenly lag you try your best to fix the internet restart the client and at the end it gives you the leaver buster...\n3. same answer at no.2 start with how you feel..~","replies":[]},{"poster":"Drius of Heart","date":"2016-06-15T10:11:17.620+0000","up_votes":1,"down_votes":4,"body":"what the use of the board if you guys aint replying","replies":[{"poster":"Ashen Rider","date":"2016-06-20T03:59:29.358+0000","up_votes":1,"down_votes":0,"body":"It's a little easier to reply if the post has proper grammar and spelling.","replies":[]}]},{"poster":"Drius of Heart","date":"2016-06-15T14:35:37.940+0000","up_votes":1,"down_votes":4,"body":"im sorry for the rude text but really riot thanks for this game and all the leagues player here loves this game but how can we play if the game have problem n seriusly long que for ban? we want to play not to wait again riot sorry","replies":[{"poster":"Epic rekit","date":"2016-06-15T20:02:19.884+0000","up_votes":1,"down_votes":0,"body":"dude chill you have to face consequences for you actions deal with it, that's life.","replies":[]}]},{"poster":"Drius of Heart","date":"2016-06-15T10:16:50.126+0000","up_votes":1,"down_votes":4,"body":"another thing is why my fps is like when im in the game  the fps dropped like 1 by 1 like eg. 60 57 52 until 0 wth was that is it my laptop or my patch have a bug?","replies":[]}]}