{"poster":"Sethcoropan","date":"2016-07-19T10:53:45.302+0000","title":"5on5 Team sucht MID Laner (Gold III - Platin II)","subforum":"Clans & Teams","up_votes":2,"down_votes":0,"body":"Hallo League Community,\n\nWir vom Team Keep Calm Carry On sind derzeit auf der Suche nach einem Midlaner.\n\nWir haben nat&uuml;rlich einige Vorstellungen wie ein guter Bewerber aussehen sollte und dies sind die Kriterien daf&uuml;r:\n\nPrinzipiell haben wir keine Anspr&uuml;che bez&uuml;glich des Mindestalters, soweit die Einstellung und die geistige Reife stimmen werden hier keine Probleme auftreten. (Wir selbst sind im Alter von 18 - 28 Jahre)\n\nMindest elo von Gold III  bis Platin II\n\nAuf dem Profil sollte sichtbar sein, dass ihr ein **Main Midlaner** seit.\nBedeutet hier sollten &uuml;berwiegend Midlane Champs unter den Most played dabei sein.\n\nDer Wille sich zu verbessern, sowie Kritik einstecken zu k&ouml;nnen und\nKritik richtig &auml;u&szlig;ern zu k&ouml;nnen.\nMehrmals die Woche Zeit um je nach Absprache mind. 3 mal die Woche spielen zu k&ouml;nnen.\nWhatsapp o.&auml;. um Absprachen treffen zu k&ouml;nnen.\nEine Gute Einstellung. Leute mit Negativer Einstellung, die blamen und flamen kommen nicht in die Probezeit.\n\n**Wir brauchen in der Midlane jemanden Der Calls f&uuml;r das Team macht**. Alle Bewerber sollten in der Lage sein dies zu k&ouml;nnen.\nWir verstehen wenn jemand in den Tryouts nerv&ouml;s ist, jedoch wird dies ein Punkt sein worauf wir sehr achten und Wert legen.\n\nNun noch ein Paar Informationen zum Team und zum Ablauf des Bewerbungs- und Tryoutverfahrens:\n\n**um euch zu bewerben m&uuml;sst ihr folgendes als Kommentar unter diesen Forumpost beantworten:**\n\nIGN:\nAlter:\nDerzeitige Elo:\nSpielt seit:\n\nWhatsapp:\nMain Champions:\nWarum ihr mich nehmen solltet:\n\n\n\n\nZum Team:\n\nToplane: Endless Sorrow ( Platin 5)\nJungle: TheChrash (Platin 5)\nMidlane: Tryout\nADC: SHikazui ( Platin 3)\nSupport: Sethcoropan (Gold 3) [ Teamleader]\n\nIch danke euch f&uuml;r eure Zeit.\n\nSethcoropan","replies":[{"poster":"Sethcoropan","date":"2016-07-27T19:36:15.851+0000","up_votes":1,"down_votes":0,"body":"Push!","replies":[]},{"poster":"Ascanur","date":"2016-07-23T15:41:52.057+0000","up_votes":1,"down_votes":0,"body":"IGN: Royaldor Faker \n\nAlter: 17\n\nElo: Plat 3\n\n\nAktiv seit s6\n\n\nWhatsapp: Vorhanden\n\n\nMainchamps: Zed/Fizz/(Teamranked  auch Azir)","replies":[]},{"poster":"Sethcoropan","date":"2016-07-20T19:30:25.059+0000","up_votes":1,"down_votes":0,"body":"Danke für eure Bewerbungen, wir suchen derzeit noch einem Midlaner! Wir arbeiten  alle Bewerbungen nach und nach ab.\n\nZusatz: Leute die sich hier bewerben und mich nicht einfach nur im Game adden, werden zuerst getestet. Wenn ihr euch hier die Zeit nimmt, eine Bewerbung zu schreiben. Sollte dies auch belohnt werden.\n\nMfg \n\nSethcoropan","replies":[]},{"poster":"Litzz","date":"2016-07-20T12:49:35.182+0000","up_votes":1,"down_votes":0,"body":"Tag erstmal,\nhoffe ich habe hier überhaupt eine Chance! Naja hier erstmal die Daten\n\nIGN: Litzz\n\nAlter: 20\n\nDerzeitige Elo: Platin 5\n\nSpielt seit: ca. 1 Monat\n\nWhatsapp: Habe ich :)\n\nMain Champions: LUXXXXXX <3 \n\nWarum ihr mich nehmen solltet: Um Ehrlich zu sein weiß ich das selbst nicht sooooo genau!\n                                                         Falls ihr mir die Chance geben würdet um euch zu überzeugen wäre ich euch sehr Dankbar!\n                                                        Ich selbst spiele ja noch nicht lange und das wäre mein erstes Rankedteam überhaupt.\n                                                         Möchte einfach etwas mehr Teamfeeling haben und nicht immer nur Solo/duoQ spielen.\n                                                         Teamranked stelle ich mir einfach viel schöner und angenehmer vor und zudem lernt man bestimmt auch\n                                                         mehr dabei!\n                                                         Vor allem wenn man dann mit Leuten wie euch spielt die schon länger als man selbst dabei sind.\n\nWürde mich sehr freuen mal mit euch zu reden und zu zocken ;) \n\nWenn nicht wäre es auch OK {{champion:32}} \n\nHoffentlich sieht man sich,\n\nLitzz {{champion:99}}","replies":[]},{"poster":"IÐukiI","date":"2016-07-20T00:54:10.987+0000","up_votes":1,"down_votes":0,"body":"IGN: I3lackDuki\nAlter: 22\nDerzeitige Elo: Gold I\nSpielt seit: Season 2\n\nWhatsapp: Vorhanden\nMain Champions: Ryze, Viktor, Ahri, Anivia, Orianna, Yasuo, Gangplank\n\nWarum Ihr mich nehmen solltet:\nViel Teamranked Erfahrung durch die letzte Season, vorheriges Teamranked Season 5 5o5 Dia IV, noch guten Kontakt zum Coach\n\nZusatz: Mein PC ist Anfang des Jahres funktionierte er nicht mehr richtig, hatte also für gut 5 Monate Pause dazwischen, war Anfang der Season Plat I.\n\nMfG I3lackDuki","replies":[]},{"poster":"wSPantherra","date":"2016-07-19T16:49:03.885+0000","up_votes":1,"down_votes":0,"body":"IGN: wsPantherra\nAlter:18\nDerzeitige Elo: Platin 3\nSpielt seit: Season 3\n\nWhatsapp: Vorhanden\nMain Champions: Ahri,LeBlanc,Xerath,Syndra\nWarum ihr mich nehmen solltet: Ich habe viel Potenzial.","replies":[]},{"poster":"Condi","date":"2016-07-19T11:43:04.859+0000","up_votes":1,"down_votes":0,"body":"IGN: Condi\nAlter: 17\nDerzeitige Elo: Platin 4\nSpielt seit: Season 4\n\nWhatsapp: Gebe ich weiter, falls ich genommen werde\nMain Champions: Gangplank, Zed, Viktor, Kassadin, Azir (am besten auf Gangplank)\nWarum ihr mich nehmen solltet: Habe durch früheres Team schon Erfahrung im Shotcallen\n\nZusatz: Auf meinem Profil sehe ich etwas inaktiv vor was an vielen Arbeiten lag. Ich werde jetzt wieder deutlich mehr spielen.","replies":[]},{"poster":"anikman","date":"2016-07-19T11:28:53.934+0000","up_votes":1,"down_votes":0,"body":"IGN: anikman\nAlter: 23\nDerzeitige Elo: silber 1 bzw gold5 in einem game, letze season plat (ing: Toledo Salamanca)\nSpielt seit: Februar 2012, Season 2 \n\nWhatsapp: vorhanden\nMain Champions: Viktor, Lissandra, Lux, \nWarum ihr mich nehmen solltet: Ich denk ich bin ganz brauchbar und im Team sollte man gemeinsam auch eine gescheite elo erreichen können. Ich denke mein decision making ist ganz io :-)","replies":[]},{"poster":"sens1","date":"2016-07-19T11:25:46.672+0000","up_votes":1,"down_votes":0,"body":"IGN: sens1\nAlter: 23\nDerzeitige Elo: G1\nSpielt seit: S1 lvl 30 S2\n\nWhatsapp: Vorhanden\nMain Champions: Ahri, Leblanc, Lux, Xerath, Lulu, Orianna, Ekko, Swain, Kassadin\nWarum ihr mich nehmen solltet: Bin angenehmer Zeitgenosse, der spielt um Spaß zu haben und um Spaß zu haben will ich immer gewinnen. Ich tilte nicht während der Spiele und bin kritikfähig. Erfahrung im Shotcallen sind wie gewünscht vorhanden. Alles andere würde ich gerne im TS besprechen.\n\nGruß sens1","replies":[]},{"poster":"ΞZy","date":"2016-07-20T12:43:36.155+0000","up_votes":1,"down_votes":1,"body":"IGN: llllIIIIIllll und Lets go B0ys und Beyondthewins\nAlter: 24\nDerzeitige Elo: Plat 4, Plat5, und Gold1\nSpielt seit: Ende Season 3\n\nWhatsapp: Vorhanden\nMain Champions: Lulu, Ahri, Azir, Quinn, Syndra, Karma\nWarum ihr mich nehmen solltet: Ich habe viel 5er-Ranked´s Erfahrung - habe in fast allen Teams die Calls gemacht.\nMein Spielknowledge ist meiner Meinung sehr gut. Bin ein sehr aktiver Midlaner der Hardcarrys spielen aber auch den ADC supporten kann. Ich gehe gerne Roamen und versuche die anderen Lanes zu unterstützen.","replies":[]}]}