{"poster":"BurstFire304","date":"2020-01-02T22:59:35.631+0000","title":"how to improve reports / ban system in lol","subforum":"Player Behaviour","up_votes":2,"down_votes":1,"body":"riot player behavior division is terrible. they use bots to trigger keyword bans and actual toxic people know how to avoid the bots. the people who actually get banned are the good players who never type but then the one game they get mad and spam chat they get banned. it punishes real players who want to win and work with their team and rewards trolls/smurfs who enjoy dancing around the rules. \n\nthe system should literally be this: \n1) bot detects in game crap (racial slurs/spam etc) +1\n2) each report from a player (u can only report one category) gets +1\n3) honor from a teammate -1\n4) enemies can honor -1\n5) this score lasts for 10 games\n6) if you accumulate +20 points (this is an example, idc what the number is as long as its fair) in 10 games you get sent to a HUMAN BEING at riot who reviews it\n7) the riot HUMAN BEING decides what punishment to award (EDIT: OR NOT AWARD) based on guidelines from riot (EDIT: REGARDING THE SITUATION AND ALL RELEVANT INFORMATION)\n\nnote: if riot actually invested time and money into making a solid AI or just a really good bot, i wouldnt care if it was a human or not. but the current riot player behavior automation is dog shit","replies":[{"poster":"Project Xayah","date":"2020-01-03T00:57:18.256+0000","up_votes":3,"down_votes":1,"body":"To be clear, Riot's systems work with a system that uses machine learning, rather than \"trigger words\" as many players often believe. You can refer to [this post on the NA boards](https://boards.na.leagueoflegends.com/en/c/player-behavior-moderation/Ifb0rpEJ-riot-should-just-make-a-list-of-banned-words-and-how-not-to-be-condescending) that gives a simplified explanation of the difference, and how it works: https://boards.na.leagueoflegends.com/en/c/player-behavior-moderation/Ifb0rpEJ-riot-should-just-make-a-list-of-banned-words-and-how-not-to-be-condescending\n\nThat doesn't mean it's going to be a perfect system, though (no system is perfect, mind you). Any time a player figures out how to circumvent the current detection methods, the system has to learn how that's happening and how to detect it (that's why it's called \"machine *learning*\"), which is obviously going to mean that some players may fly under the radar until the system learns.\n\nThat's why reports are so important, because they provide important information to the system on how players might be circumventing detection, and it's important to note that you're not limited to the post-game report function; if there is ever a case you think won't be handled properly by the automated system, you can feel free to submit a ticket directly to [Support](https://support-leagueoflegends.riotgames.com/hc/en-us/requests/new) who should take the appropriate steps to address the situation.","replies":[{"poster":"BurstFire304","date":"2020-01-03T02:25:59.063+0000","up_votes":2,"down_votes":1,"body":"so when i say \"AI\" im including the term \"machine learning\". so all \"machine learning\" comments you made as resolved in the original post. i think the riot \"machine learning\" is garbage and they need to use humans because of this. \n\nits a really bad system. literally every game i play has toxic players in it (gold solo q oce). and i report them constantly and maybe 1/100 reports ill get some kind of message \"your report blah blah blah penalized\" but i find these coincide with the \"machine learning\". for example if someone afks and i report them i get this \"penalized\" message. this leads me to believe that my reports have nothing to do with the ban. \n\nmy issue is not that im LIMITED to post game, its that i MUST go the route of a ticket. i shouldnt have to send 4 tickets every game to riot support just to get replies back like \"hey sometimes they are just having a bad game. try going for a walk\"\n\nmy points based system is much better than they current one","replies":[{"poster":"Project Xayah","date":"2020-01-03T04:43:58.615+0000","up_votes":3,"down_votes":1,"body":"Riot's automated systems are actually remarkably \"solid\", though, with gameplay offences really being the only thing it struggles with, and that's likely more a result of the nature of such offences and how difficult they are to accurately determine. The machine learning in place functions remarkably well with things like chat, 3rd party software, account sharing, and the like, with only rare edge cases acting as outliers (which you would realistically expect with any system).\n\nSo far as the IFS notifications go, you can't rely on them to tell you *every* time a player is punished with the help of one of your reports. The system was originally designed to inform *only* the final report that triggers the punishment itself, not everyone who actually contributed to the punishment, and there is reason to believe that notification doesn't always trigger when it should. A lack of notification does *not* mean the player wasn't punished.\n\nUltimately, there should be no need to submit 4 tickets for every game, and while I understand that's likely an exaggeration, it sound like the reality is that you're actually looking for issues where none (or, rather, significantly fewer) exist, rather than there actually being excessive issues in-game. With that kind of \"all these people are doing the wrong thing\" mentality, it's likely that you're simply perceiving certain situations as being more negative than they actually are (a concept known as \"negativity bias\"), which happens to everyone. In that respect, the Support agents are right; some people are just having a bad game(s), not everyone is trying to ruin your time.\n\n____\n\nSo far as the system you've suggested, I was reluctant to address specific points about it because I didn't want to stymie the discussion of it, but it seems to me there are multiple major flaws with the idea itself.\n\nFor one thing, a system that relies so heavily on manual reviews is entirely impracticable. The amount of manpower that would be required to properly address every case (or even most cases) would be far more than Riot (or most companies) would be capable of employing, which is actually one of the major reasons why the automated systems are put in place for most/all online services. There's also the fact that a purely (or almost purely) manual system would result in significantly longer times to actually address clear-cut cases; cases which the current system can address in under 15 minutes.\n\nThe suggestion also acts on the fallacy that every report submitted is going to hold valid weight, when there are many players who use reports in a misguided attempt to trigger false punishments; an effort that would effectively be validated with such a system. It would also act on the same fallacy that the current honour system employs, that honours represent only positive behaviour, when the reality is that many players honour others who perform well, rather than those that behave well.\n\nSuch a system would also eliminate the possibility of considering context *before* deciding if a punishment is due, since it is no longer based on an actual review of the situation to determine if a player was acting in a way that should be punished, but rather deciding that based solely on the account's \"point standing\", and then allowing a decision to be made only on which punishment to issue.\n\nWhile such problems exist, a system such as this would not be a practical consideration for any company looking to employ a superior behaviour system.","replies":[{"poster":"BurstFire304","date":"2020-01-03T06:03:23.137+0000","up_votes":1,"down_votes":0,"body":"you really need to provide data about your first point because its an empirical claim. i believe that millions of riots punishments are either absent or wrongly directed. \n\ni didnt know that the notifications worked like that. but now i do, they shouldnt. they should tell you every time a player you reported is punished as a result of ur report. for example in my system if you report someone and they get banned in that 10 game window before their points are reset, you would be notified. \n\nin terms of sensitivity or whatever its brought about by the games terrible \"summoners code\" it has rules that it enforces sometimes when it wants to. for example racism is bad. if you type certain slurs you get banned. if you literally describe the color of someones skin and then compare them to bodily waste you dont get banned. in game reporting needs to be weighted heavier. also i would say most games of the 10 ranked solo q players, at least 2 break the rules in some way. afk, inting, verbal, giving up etc etc. \n-------------------------------------------------\nso my system uses manpower in terms of players after game and riot people to review. this can be outsourced to some kind of call centre or maybe an overwatch system (like in csgo) where players rated plat+ can review a ticket from time to time of a player who has exceeded the points threshold set by riot. also as i mentioned in the event where the machine learning was actually good it would take the place of people. but you have millions of players ready to help with a ticket from time to time, especially if it gave blue essence or something.\n\nthis system does require each report to be the same quality/accuracy. its letting the wider community decide what it wants. so for example if 100 people in gold dont like the playstyle of a certain player in gold, he will get flagged. and if 1 guy reports for no reason, as long as others dont too (which is very unlikely statistically) he wont get flagged.\n\n\"Such a system would also eliminate the possibility of considering context before deciding if a punishment is due, since it is no longer based on an actual review of the situation to determine if a player was acting in a way that should be punished, but rather deciding that based solely on the account's \"point standing\", and then allowing a decision to be made only on which punishment to issue.\" this whole section is just wrong. \n1) at the moment punishments are automatic and non-contextual\n2) in my system, each players ticket is reviewed either by a VERY good AI or a human being (for the entire purpose of context)\n\nthe entire point of this system is to combine automation with context. you get flagged by the point system, but you only get punished after manual review (either with a better AI or a riot employee or a random solo q player plat+)\n\ni think youve failed to understand what ive said either through poor communication from me or you just not reading it carefully enough. ive added a bunch of edits give it another skim and if you still disagree we can just agree to do so.","replies":[]}]}]}]}]}