{"poster":"LS BjerGsen","date":"2016-02-02T22:49:34.727+0000","title":"Perma Ban","subforum":"Charlas Generales","up_votes":2,"down_votes":20,"body":"Buenas , acabo de jugar una partida con mi cuenta principal, y como el server  anda para el orto con ping se ponia dificil jugar y lo intente , mori 2 veces y mate 1, cuando mi top va 0-4 (tip&iacute;co ni&ntilde;o rata ) me empieza a flamear porque no lo gankeo siendo que le dije que tenia lag y me empieza a insultar y el server me boto por el lag y no pude volver a entrar , y ahora me meto y me sale que mi cuenta esta perma ban siendo que los que deberian banear son los ratas,trolls,y afk","replies":[{"poster":"Nehalem","date":"2016-02-02T22:58:44.081+0000","up_votes":2,"down_votes":0,"body":"Hasta llegar al PERMABAN hay un largo camino que recorrer, no creo que todo eso pasara en un mes.","replies":[{"poster":"LS BjerGsen","date":"2016-02-02T23:00:48.903+0000","up_votes":1,"down_votes":2,"body":"era una de mis primeras rankeds (10) ya que usaba mi cuenta secundaria para jugar con amigos de ligas bajas","replies":[{"poster":"Nehalem","date":"2016-02-02T23:08:11.094+0000","up_votes":2,"down_votes":0,"body":"No importa si no jugaste hace mucho o lo que sea, pudiste abusar durante mucho tiempo luego no jugar por un a침o y apenas volves la terminas de joder.\nPara llegar al PERMAban hay muchos peque침os ban en medio.","replies":[{"poster":"LS BjerGsen","date":"2016-02-02T23:18:21.272+0000","up_votes":1,"down_votes":0,"body":"no soy de hablar mucho en partida , nunca me voy afk , las veces que me fui afk fue por el sv que andaba lag y estaba injugable","replies":[{"poster":"Zevko","date":"2016-02-03T01:38:30.687+0000","up_votes":1,"down_votes":0,"body":"No entendiste lo que te dijo el de arriba amigo, PARA LLEGAR AL PERMABAN HAY MUCHOS PEQUE칌OS BAN EN MEDIO.\nY si se supone que decis que no hablas mucho y nunca te vas afk entonces nunca te banearon. lo cual no tiene sentido.","replies":[{"poster":"LS BjerGsen","date":"2016-02-03T02:31:48.921+0000","up_votes":1,"down_votes":0,"body":"Aveces toca que te reportan de ganas nomas riot no ve si el report es falso o no , a cuantos les ah pasado que le banean el chat y nunca flamean","replies":[]}]}]}]}]}]},{"poster":"Exit","date":"2016-02-03T00:31:18.436+0000","up_votes":2,"down_votes":1,"body":"ya entras insultando bien baneado :D","replies":[{"poster":"LS BjerGsen","date":"2016-02-03T01:26:31.363+0000","up_votes":1,"down_votes":0,"body":"Porque? Mas de una vez nos a tocado alguien que flamea y reporta por joder","replies":[]}]},{"poster":"Maldichion","date":"2016-02-03T01:12:07.448+0000","up_votes":1,"down_votes":0,"body":"Los casos son muy particulares... Y Riot se caracteriza bastante por ser autoritario con algunas decisiones, por lo menos para mi...\n\nSi alguien es tan amable, sabr칤a donde se encuentra el \"contrato\" que tenemos con Riot cuando nos creamos la cuenta...\nPorque lo busque por toda la pagina y no lo encontr칠...\n\nSaludos!","replies":[{"poster":"hombrequeara침a","date":"2016-02-03T01:25:48.555+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Maldichion,realm=LAS,application-id=v7qsfXsE,discussion-id=FJQ79AQ5,comment-id=0007,timestamp=2016-02-03T01:12:07.448+0000)\n>\n> Los casos son muy particulares... Y Riot se caracteriza bastante por ser autoritario con algunas decisiones, por lo menos para mi...\n> \n> Si alguien es tan amable, sabr칤a donde se encuentra el \"contrato\" que tenemos con Riot cuando nos creamos la cuenta...\n> Porque lo busque por toda la pagina y no lo encontr칠...\n> \n> Saludos!\n\nhttp://euw.leagueoflegends.com/es/legal/termsofuse\n\nDeberia servir ese","replies":[{"poster":"Maldichion","date":"2016-02-03T01:44:19.072+0000","up_votes":1,"down_votes":0,"body":"Gracias loco, ahi lo estoy leyendo... (Y hasta ahora, no me gusta nada jajaja)","replies":[{"poster":"hombrequeara침a","date":"2016-02-03T05:02:40.976+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Maldichion,realm=LAS,application-id=v7qsfXsE,discussion-id=FJQ79AQ5,comment-id=000700000000,timestamp=2016-02-03T01:44:19.072+0000)\n>\n> Gracias loco, ahi lo estoy leyendo... (Y hasta ahora, no me gusta nada jajaja)\n\nBasicamente es el terminos de uso de cualquier juego online, donde todo lo que usas es de ellos y tienen el poder sobre todo las cosas pudiendo sancionarte o terminar el servicio sin previo aviso (lol,wow,dota,sc2, etc)","replies":[{"poster":"Maldichion","date":"2016-02-03T21:13:57.185+0000","up_votes":1,"down_votes":0,"body":"Igual realmente no es TAN asi, tenes cuestiones legales que te pueden favorecer, no voy a ondar en el tema porque es largo, pero en realidad no son ellos tan due침os de todo como la gente cree...\nPor mas que el juego sea \"FreeToPlay\" y no haga falta gastar dinero para jugarlo, desde el momento que te dejan \"aportar\" o comprar skins, de alguna forma te volves financiador del juego, ya que sin los aportes (de los que quieren gastar) el juego no se podria mantener en pie... Por ende tenes ciertos derechos como propietario \"virtual\" de la cuenta y todo lo que tengas en ella...\nMas haya del contrato que firmes, porque todos los contratos de empresas internacionales no se pueden interponer sobre las leyes de los paises... Y por ejemplo en Argentina (Y se que en Chile tambien) hay una defensa o departamento del consumidor que te ampara en ciertas cuestiones...\nEl gran problema que se presenta para gente como el amigo que quiera reclamar el \"Perma Ban\" es que llevar acciones legales lleva MUCHO tiempo y MUCHO dinero, entonces nadie lo hace.... Para un particular es imposible, para la Empresa en cuesti칩n son limosnas, ahi radica el problema que ninguna de estas empresas tenga juicios... No son porque no se pueda, son porque nadie puede aguantar los costos...\n\nPERO... Si la denuncia es colectiva, todo se vuelve mas facil... Pero como lo vas a hacer? Si aca en LAS se putean en una partida, imaginate tratar de hacer una denuncia... Jajaja...\n\nBueno, muy largo :D\n\nSaludos y gracias por responderme!","replies":[{"poster":"Anikilaador","date":"2016-04-14T20:36:45.071+0000","up_votes":1,"down_votes":0,"body":"A mi tambien me banearon la cuenta por flameo, pero que pasa con los que fedean o arruinan los juegos? los sigo viendo jugando libres por ahi arruinando juegos, y tambien recibi pocos  reportes, no te dan ningun resplado de cifras, te mandan una estadistica que estas en el 0,0000001 de jugadores que flamean y no te mandan el respaldo en cantidad de juegos para sacar esa tendencia, por 10 reportes estoy en ese porcentaje?, creo que hay razones arbitrarias que se toman. En cuanto a una demanda obviamente es comlejo pero si creo que se puede presionar de alguna manera, mas alla de que algunos no gastemos dinero en este juego si lo jugamos y por ende en algun grado somos consumidores, se tiene que poder expresar algun punto que sea escuchado por ellos. Saludos","replies":[]}]}]},{"poster":"LS BjerGsen","date":"2016-02-03T02:34:01.427+0000","up_votes":1,"down_votes":0,"body":"Se contradice en muchas partes","replies":[]}]}]},{"poster":"LS BjerGsen","date":"2016-02-03T01:28:18.683+0000","up_votes":1,"down_votes":0,"body":"Esque ahi gente que por joder te reporta , no usaba mi cuenta como hace 1 mes y al usarla pasa esto riot no ve los verdaderos problemas","replies":[{"poster":"Maldichion","date":"2016-02-03T01:47:45.380+0000","up_votes":1,"down_votes":0,"body":"\"Te칩ricamente\" Riot revisa los reportes para que no sean falsos, PERO a su ves, te dice que el sistema es autom치tico... (WTF?)\nOsea, como que una parte se contradice no?\n\nCual es el tema en cuesti칩n? NO LE IMPORTAMOS!\nPorque? Simple...\nHoy vos no tenes mas tu cuenta, ma침ana para esta misma hora habr치 unos miles de usuarios nuevos jugando, pasibles de gastar dinero en el juego...\nEllos siguen ganando, esa es la 칰nica ecuaci칩n que le interesa a Riot...\nEl que no lo quiere ver es porque es ciego...\nServer, comunidad, soporte, todos p칠simos... Creo que son ejemplos mas que claros...\n\nSaludos!","replies":[{"poster":"LS BjerGsen","date":"2016-02-03T02:27:10.194+0000","up_votes":1,"down_votes":0,"body":"Esque solo le importa el dinero  0 consideracion con sus jugadores","replies":[]}]},{"poster":"Zevko","date":"2016-02-03T01:39:35.279+0000","up_votes":1,"down_votes":0,"body":"sino haces nada el report no te hace nada, es basico.","replies":[{"poster":"LS BjerGsen","date":"2016-02-03T01:42:45.946+0000","up_votes":1,"down_votes":0,"body":"No es asi, varias veces te reportan por nada y te toman por abuso verbal","replies":[]}]}]}]},{"poster":"Krimmer","date":"2016-02-03T03:37:39.856+0000","up_votes":1,"down_votes":0,"body":"Es imposible que te baneen de una por una sola partida.","replies":[{"poster":"LS BjerGsen","date":"2016-02-03T03:56:16.563+0000","up_votes":1,"down_votes":0,"body":"asi fue amigo nada que hacer","replies":[]}]},{"poster":"Nehalem","date":"2016-02-02T23:55:39.448+0000","up_votes":1,"down_votes":0,"body":"Man es un permaban, es obvio que algo haces para que te banearan tantas veces hasta llegar a esto, y claramente por el problema del server que venimos viviendo no es porque vos mismo dijiste que no usabas la cuenta hasta ahora las 10 rankeds. En un ban puede haber un m칤nimo error, o algo que a lo mejor no sabias, quiz치s algunas \"flameaditas\", pero un permaban no tiene errores de este tipo.","replies":[{"poster":"LS BjerGsen","date":"2016-02-02T23:59:53.593+0000","up_votes":1,"down_votes":0,"body":"Nunca me an baneado y las \"flameaditas \" las evito y los muteo y las unicas veces afk es porque estaba lag reitero aparte que no faltan los que reportan por reportar y riot no las revisa, solo 1 vez me banearon el chat por 5 partidas siendo que el otro tipo me flameo toda la partida y yo solo respondi y no de mala manera","replies":[{"poster":"Nehalem","date":"2016-02-03T00:46:57.348+0000","up_votes":1,"down_votes":0,"body":"Entonces cual es el motivo? tiene que estar en tu mail, en el caso de flameos tiene que haber un chat ahi.","replies":[{"poster":"LS BjerGsen","date":"2016-02-03T01:41:57.778+0000","up_votes":1,"down_votes":0,"body":"Ese es el problema la cuenta la tengo hace rato que ya ni me acuerdo del correo","replies":[{"poster":"Nehalem","date":"2016-02-03T01:49:57.619+0000","up_votes":1,"down_votes":0,"body":"no creo que tengas taaantos mails como para no recordar uno.","replies":[{"poster":"LS BjerGsen","date":"2016-02-03T02:28:30.174+0000","up_votes":1,"down_votes":0,"body":"Es una cuenta antigua si jugaba desde la s1 obvio que no voy a recordar","replies":[{"poster":"Nehalem","date":"2016-02-03T02:46:56.053+0000","up_votes":1,"down_votes":0,"body":"Pero es un mail tuyo, posiblemente uno de tus primeros mails, a menos que te la creara un amigo claro.","replies":[{"poster":"LS BjerGsen","date":"2016-02-03T03:33:23.889+0000","up_votes":1,"down_votes":0,"body":"Por eso digo que no recuerdo 游땩","replies":[]}]}]}]}]}]},{"poster":"Zevko","date":"2016-02-03T01:40:10.583+0000","up_votes":1,"down_votes":0,"body":"no banean x afk.","replies":[{"poster":"LS BjerGsen","date":"2016-02-03T03:33:00.636+0000","up_votes":1,"down_votes":0,"body":"Y si banean por afk amigo 游땕","replies":[]}]}]}]},{"poster":"PaawN ","date":"2016-02-02T23:29:14.230+0000","up_votes":1,"down_votes":0,"body":"jajajjaja y vos crees que el prema ban fue solo por esa partida? seguramente sos un tipico flamer merecido lo tenes \n\nPD: que les sirva de ejemplo a los demas, riot por fin esta haciendo algo con esta gente","replies":[{"poster":"Zevko","date":"2016-02-03T01:40:59.127+0000","up_votes":1,"down_votes":0,"body":"Tipico feeder xd","replies":[]},{"poster":"LS BjerGsen","date":"2016-02-02T23:33:45.284+0000","up_votes":1,"down_votes":0,"body":"Bueno si tu tienes esa opinion me ah tocado mil tipos que me flamean y putean porque les da la gana y joden partidas y riot no hace nada \ndonde esta el ejemplo","replies":[]}]},{"poster":"Immeryse","date":"2016-02-03T00:52:06.168+0000","up_votes":1,"down_votes":0,"body":"Por que te reporten una partida no suceder치 nada grave, te llegar치 el aviso de que te relajes, los castigos se aplican cuando hay constancia en recibir reportes. De todas formas deber칤as leerte a ti mismo, primero dices que nunca te has ido afk pero luego dices \"Las unicas veces que...\" y lo mismo respecto a que nunca te banearon, luego dices que si sucedi칩 xd","replies":[{"poster":"LS BjerGsen","date":"2016-02-03T01:24:21.524+0000","up_votes":1,"down_votes":0,"body":"Como a todosos paso cuando el sv estaba lag y los que no estaban reportaban a la gente que si tenia ese problema y jo era su culpa","replies":[]}]},{"poster":"hombrequeara침a","date":"2016-02-03T01:24:21.464+0000","up_votes":1,"down_votes":0,"body":"Es cosa de ver como te expresas en un tema del foro para saber que no eres una santa paloma XD.\n\nSi llegas hasta permaban es que ya tienes un pasado que no quieres hablar por que no te combiene o pagaste riot points con un metodo donde le debes dinero a rito.\n\nTodos son inocentes al momento de la sancion, que oportuno :)","replies":[]},{"poster":"Fahrenwolf","date":"2016-02-02T23:52:18.927+0000","up_votes":1,"down_votes":0,"body":"para empezar cambia de actitud, si a un jugador le va  mal en una partida no quiere decir nada\nademas el score tiene asistencias\nindependiente del caso, no te van a permabanear por una partida\n\nen el email deberian decirte el motivo del ban, a mi me banearon por usar un programa que cambaiaba la resolucion, nunca me avisaron nada asi que me entere la razon semanas despues via ticket\n\nlos unicos motivos de permaban directo son scripts, el uso de programas externos de modificaciones\n\nde otra manera seria si eres un jugador que oconstantemente insulta o abandona partidas, pero tendria que llegar a un extremo","replies":[{"poster":"LS BjerGsen","date":"2016-02-03T00:05:12.380+0000","up_votes":1,"down_votes":0,"body":"No uso programas usaba mk pero desde que dijeron que era ilegal no lo uso , no abandono partidas por muy mal que valla en game casi ni hablo y casi siempre flamean e intento evitarlos , 1 vez me banearon el chat por 5 games siendo que el otro tipo flameo toda la partida y uno le responde de buena manera y lo banean a 1 o algunos te reportan porque quieren y eso riot no lo ve","replies":[]}]},{"poster":"flor porsiempre","date":"2016-02-02T22:54:01.144+0000","up_votes":1,"down_votes":0,"body":"pero si\" te boto\" osea te fuiste afk;y tal vez te baneo permanente por que habias abandonado muchas partidas,por que por una sola no te la banean.te dan avisos,estabas en ranked o era normal?","replies":[{"poster":"LS BjerGsen","date":"2016-02-02T22:54:44.230+0000","up_votes":1,"down_votes":0,"body":"era la primera que jugaba despues de un tiempo era ranked","replies":[]}]},{"poster":"Lord Luzbelito","date":"2016-02-03T01:15:05.578+0000","up_votes":2,"down_votes":2,"body":"Yo lo apoyo,  rito banea a la gente incorrecta y los flamers siguen quedando, ap칩yenlo.","replies":[{"poster":"LS BjerGsen","date":"2016-02-03T01:23:09.459+0000","up_votes":1,"down_votes":4,"body":"Si riot banea injustamente a los buenos players","replies":[]}]}]}