{"poster":"xGede","date":"2017-11-13T19:49:17.513+0000","title":"El mismo marco de diamante","subforum":"Charlas Generales","up_votes":4,"down_votes":9,"body":"Parece mentira, que el juego mas  popular del mundo, use el mismo marco que el a&ntilde;o pasado, es un detalle no menor, que paso, porque usan lo mismo que el a&ntilde;o pasado, un juego de este porte, deberia actualizar hasta las letras del launcher para que el juego no muera, la verdad no me importan las nuevas runas, ni todos los cambios y mejorias que hicieron, les pongo un 1/10 a los desarrolladores por usar lo mismo que el a&ntilde;o pasado, impresentable.","replies":[{"poster":"Ąbusive","date":"2017-11-13T19:52:02.988+0000","up_votes":3,"down_votes":0,"body":"La diversidad de los marcos entre season y season siempre fue algo a remarcar , este año dejaron mucho que desear al dar el mismo marco de la season anterior.","replies":[{"poster":"xGede","date":"2017-11-13T19:54:56.548+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Lothric,realm=LAS,application-id=v7qsfXsE,discussion-id=M9BFXMYt,comment-id=0000,timestamp=2017-11-13T19:52:02.988+0000)\n>\n> La diversidad de los marcos entre season y season siempre fue algo a remarcar , este año dejaron mucho que desear al dar el mismo marco de la season anterior.\n\nconfio que fue un error, que se durmieron en el parche, y que ya tienen un modelo innovador diseñado para cargarlo en el proximo parche, de lo contrario, una muestra de como el juego va en decadencia.","replies":[{"poster":"Shirotani","date":"2017-11-13T20:09:04.094+0000","up_votes":1,"down_votes":0,"body":"No fue un error, los rioters dijeron que éstos iban a ser los marcos estandar. Por lo tanto en la S8 también deberian dar los mismos, a menos que cambien de opinión, claro.\n\nY no creo que querer estandarizar algo estético sea una muestra de que el juego vaya en decadencia.","replies":[]}]}]},{"poster":"McLennon","date":"2017-11-13T20:13:07.861+0000","up_votes":2,"down_votes":0,"body":"Coincido, no creo q tampoco sea un gran trabajo de diseño y reemplazarlo por el archivo que te sale como marco en la carga de las partidas, mal ahí rito","replies":[]},{"poster":"Kaziklí Bey","date":"2017-11-13T20:19:30.666+0000","up_votes":1,"down_votes":4,"body":"juego mas popular del mundo jajajjajajajjajajajajjajajajajj\n\npubg y wow se rien de este comentario","replies":[]}]}