{"poster":"Gevurahh","date":"2016-10-08T08:25:26.257+0000","title":"Gold/Platin Teamaufbau","subforum":"Clans & Teams","up_votes":1,"down_votes":1,"body":"Hey,\n\nein Kumpel und ich w&uuml;rden gerne ein Team aufbauen, um die ward Skins dieser Season sicherzustellen. Wir schlie&szlig;en nat&uuml;rlich nicht aus, dass das Team wunderbar harmoniert; wir w&uuml;rden uns dann h&ouml;here Ziele setzen und das Team in die n&auml;chste Season weiter f&uuml;hren. Trainingszeiten werden wir nicht festlegen, wir hoffen dass die Leute aktiv genug sind, dass man sich abends zu f&uuml;nft zusammen findet. Wie gesagt, wenn alles wunderbar l&auml;uft und man sich untereinander gut versteht, kann man mit der Setzung h&ouml;herer Ziele auch Trainingszeiten festlegen.\n\nUns ist wichtig, dass wir sympathische und erwachsene Leute finden, weil wir keine Lust haben uns von geistig Unreifen stressen zu lassen. Wir sind beide 24 Jahre alt und deswegen solltet ihr mindestens 18 sein, um eine gute Grundlage f&uuml;r ein sympathisches Miteinander zu legen. \n\nMein Kumpel ist aktuell Platin II (war vorletzte Season Diamant) und ich befinde mich auf bestem Wege zu Platin, aktuell bin ich in Gold I. Daher suchen wir Leute die sich mindestens in Gold III befinden. Wir belegen die Positionen Top und Mitte, deswegen suchen wir noch eine Botlane und einen Jungler um unser Team zu vervollst&auml;ndigen. Wir befinden uns in keinem Clan oder &Auml;hnlichem, wir wollen einfach zu f&uuml;nft in angenehmer Atmosph&auml;re Team ranked spielen.\n\nMeldet euch bei mir ingame oder hier direkt im Thread,\nGevurahh","replies":[{"poster":"Gevurahh","date":"2016-10-13T11:40:44.868+0000","up_votes":1,"down_votes":0,"body":"ADCs melden!","replies":[]},{"poster":"Zanlan","date":"2016-10-12T10:09:28.063+0000","up_votes":1,"down_votes":0,"body":"> Es wurde eine Anfrage an den Beschwörer gesendet. Wenn er deine Anfrage annimmt, wirst du ihn online sehen.","replies":[]},{"poster":"Gevurahh","date":"2016-10-12T09:24:53.951+0000","up_votes":1,"down_votes":0,"body":"fehlt immernoch nur ein ADC,\nmeldet euch hier oder ingame.\n\nGevurahh","replies":[]},{"poster":"Gevurahh","date":"2016-10-11T06:25:00.369+0000","up_votes":1,"down_votes":0,"body":"Uns würde nur noch ein ADC fehlen,\nmeldet euch bei mir.\n\nGevurahh","replies":[]},{"poster":"Worbid","date":"2016-10-08T15:00:01.679+0000","up_votes":1,"down_votes":0,"body":"Hallo^^\n\nmein Name ist Worbid und ich wäre äußerst interessiert eurem Team als Support beizutreten,\nfinde euren Post nämlich sehr ansprechend.\nIch bin 21 Jahre alt PlatV und alles weitere lässt sich bestimmt bei einer gemütlichen Runde klären ;)\nMfg Worbid","replies":[]}]}