{"poster":"fernaso89","date":"2015-09-15T12:50:36.031+0000","title":"Schermata Nera","subforum":"Aiuto e supporto","up_votes":1,"down_votes":1,"body":"Dopo la selezione del campione la schermata di caricamento diventa tutta nera. Ho provato di tutto, DNS, Firewall, NVRAM, ho riparato i file dal launcher ma niente. Consigli? Premetto che ho un mac.\r\n\r\nGrazie mille","replies":[{"poster":"Danioku","date":"2015-09-15T12:52:06.579+0000","up_votes":1,"down_votes":0,"body":"ah ecco, anche io sto avendo dei problemi ed ho un mac ovviamente.\n\nSto provando a resettare la NVRAM","replies":[{"poster":"fernaso89","date":"2015-09-15T13:05:04.114+0000","up_votes":1,"down_votes":0,"body":"Ho provato anche io a resettarla ma niente.","replies":[{"poster":"Danioku","date":"2015-09-15T13:23:21.282+0000","up_votes":1,"down_votes":0,"body":"niente...., ho anche aggiornato tutto quello che c'era da aggiornare (a parete Yosemite, ho Maverick 10.9.5) ma niente....\n\nPasso alla reinstallazione completa D:","replies":[{"poster":"fernaso89","date":"2015-09-15T13:28:43.570+0000","up_votes":1,"down_votes":0,"body":"Ho fatto l'ultima cosa che potevo fare, contattare il support Riot, Anche io l'ho reinstallato ma niente, perderesti solo un po di tempo. Se ho buone nuove avviso","replies":[{"poster":"Danioku","date":"2015-09-15T17:32:51.764+0000","up_votes":1,"down_votes":0,"body":"Ho fixato.... reinstallato tutto e adesso carica. Non ho idea del perché si è risolto ma sono lo stesso felice :D:D:D\n\nGL","replies":[{"poster":"Danioku","date":"2015-09-15T17:55:44.880+0000","up_votes":1,"down_votes":0,"body":"E invece no. Ha funzionato un game in custom, faccio una normal e siamo daccapo, non carica e continua a crashare. Sto sclerando e spaccherei tutto........................................ \n\nUltima chance, ticket ....","replies":[{"poster":"fernaso89","date":"2015-09-15T22:47:54.237+0000","up_votes":1,"down_votes":0,"body":"Ho contattato il supporto e dicono che dovrebbe essere un problema di trasmissione tra provider e server. Ma sono troppo dispersivi. A me comunque non fa partire nemmeno le custom :S","replies":[{"poster":"Danioku","date":"2015-09-16T13:25:10.440+0000","up_votes":1,"down_votes":0,"body":"Senti io ho fixato. Ho aggiornato OSX a Yosemite e per adesso (incrocio le dita) ha ripreso a funzionare tutto. \n\nIl support mi ha risposto (devo dire molto velocemente) con i consigli per fixare che però non ho usato perché si è risolto.  Per onor di cronaca mi hanno detto che poteva essere un problema di configurazione dei privilegi per le cartelle e i file e che qui avrei trovato la soluzione : https://support.riotgames.com/hc/it/articles/202969434#mq3 \n\nNiente, in bocca al lupo e spero possa risolvere anche tu .","replies":[{"poster":"Danioku","date":"2015-09-16T15:33:45.415+0000","up_votes":1,"down_votes":0,"body":"Sembra una barzelletta ma crasha ancora XDXDXDXDXD ma ho scoperto perché .\n\nil problema si chiama Razer Kraken USB, le mie cuffie. Sono loro la causa. \n\nDopo l'ultimo update, se le abilito crasha se le disabilito funziona tutto.\n\nE' il momento del Razer Support now \n\nQui si parla di questo problema con le cuffie Razer a chi interessa:\n\nhttp://boards.eune.leagueoflegends.com/en/c/suggestions-bug-reports-en/u0igenmz-lol-crash-using-razer-kraken-71-chroma\n\nhttps://www.reddit.com/r/razer/comments/3dui6i/anyone_experiencing_difficulties_using_a_razer/","replies":[{"poster":"fernaso89","date":"2015-09-16T21:37:32.358+0000","up_votes":1,"down_votes":0,"body":"A me niente da fare, sto parlando con il supporto di continuo. Adesso mi hanno chiesto TUTTI i file dei registri, ripeto TUTTI. Ne ho abbastanza sinceramente. Un altro giorno e abbandono le speranze.\n\nAggiornamento: Ho risolto DA SOLO. Ho creato un altro profilo amministratore sul PC, preinstallato Lol e il gioco è partito.","replies":[]}]}]}]}]}]}]}]}]}]}]}