{"poster":"L5 Yeezy","date":"2015-10-22T03:02:57.263+0000","title":"[SILBER 5vs5 TEAM] Suche Member für die L0C0S CiNC0S!!!","subforum":"Clans & Teams","up_votes":1,"down_votes":2,"body":"Seit dem die **Worlds** wieder in vollem Gange sind, steigt nat&uuml;rlich auch das Interesse an dem Competitivgedanken hinter LoL. SoloQ ist l&auml;ngst nicht mit der Synergie und den Erfahrungen, welche man in einem Team erlebt, zu vergleichen. Jedoch wird man nicht einfach mal schnell zu irgendwelchen Scrims gegen H2k oder Fnatic eingeladen. Erst recht nicht, wenn man, wie ich, einfach noch nicht erfahren und gut genug daf&uuml;r ist. Aus jenem Grund kam mir die Idee ein eigenes Team zu erstellen. F&uuml;r Leute, wie mich. Leute, die noch nicht solange in der LoL-Szene sind, oder Leute, die einfach noch nicht im Diamant-,Master- oder Challenger-Niveau spielen. \n\nIch m&ouml;chte gern ein Team gr&uuml;nden, welches zusammen w&auml;chst, welches zusammen Taktiken ausfeilt, eigene Spiele analysiert, in dem auch mal der ein oder andere Fehler kritisiert wird, in dem zusammen ge&uuml;bt wird, in dem man **ZUSAMMEN** Spa&szlig; hat.\nEin Rankedteam, in dem sich jeder wohlf&uuml;hlt und in dem man zusammen besser wird und man sich zusammen entwickelt.\n\n_**Zu Mir:**_\nIch spiele LoL seit Saison 4, war in dieser Gold, allerdings ein ziemlicher Flamer, weswegen ich auf die Season Belohnungen verzichten durfte {{item:3151}} . \nDementsprechen kein Goldrahmen, kein Victorious-Skin, kein Garnix. Jedoch ist auf meinem LoLKing-Profil noch vermerkt, welche Elo ich S4 war (http://www.lolking.net/summoner/euw/132146) . Nach diesem Arschtritt riss ich mich diese Season nun endlich zusammen. Jedoch hatte ich aufgrund der Schule wenig Zeit und meine Leistungen in der Kluft wurden schlechter und nun darf ich mich derzeit in Silver 4 rumschlagen. \nIch bin 17 Jahre alt, werde in 4 Monaten 18.\n\n_**Was ich suche:**_\nIch suche f&uuml;r das Team L0C0S CiNC0S derzeit einen Toplaner, einen Midlaner, einen Jungler und einen Supporter. Die Rolle des AD-Carry&#039;s &uuml;bernehme ich selbst, da dies meine sicherlich beste und wahrscheinlich einzige Rolle ist, welche ich gut und sicher beherrsche. Ein Mindestalter von 16 Jahren und geistige Reife setzte ich vorraus, da ich das Ganze tats&auml;chlich ernst meine. Ab Silber ist alles gern gesehen. \n\n_Wer Interesse an einem Team hat, der added mich einfach mal :)_\n\nIch w&uuml;nsche euch einen sch&ouml;nen Tag :D","replies":[{"poster":"Cat me if U can","date":"2015-10-22T03:40:58.490+0000","up_votes":3,"down_votes":1,"body":"man hat letzte season die belohnungen nicht aberkannt bekommen weil man toxic war sondern nur für eloboosting...","replies":[{"poster":"penta zwiebel","date":"2015-10-22T04:12:44.398+0000","up_votes":2,"down_votes":1,"body":"Erwischt !!!","replies":[]}]},{"poster":"Vuun","date":"2015-10-22T10:23:41.999+0000","up_votes":1,"down_votes":0,"body":"Hey :) \nIch bin Midlaner 21 Jahre alt Spiele lol seit Season 3 und bin ein Platin 3 smurf. Aber spiele so gut wie nur noch auf dem Silber Account. \n\nIch hab großes Interesse an Team Ranked Spiele jeden Tag zwischen 15:30- 20uhr.\nIch bringe viel Team-Ranked Erfahrung aus dem Platin Bereich mit und bin bereit alles für das Team zu geben :) \n\nMeldet euch einfach ingame.\nPS mein Bruder wäre toplaner und auch am Start (18 Jahre)\n\nVuun","replies":[{"poster":"L5 Yeezy","date":"2015-10-22T12:58:40.114+0000","up_votes":1,"down_votes":0,"body":"hab dich mal geaddet","replies":[]}]},{"poster":"Furbynat0r","date":"2015-10-22T07:17:56.629+0000","up_votes":1,"down_votes":0,"body":"Aloah,\n\nich selber hätte auch interesse an einem 5v5 Team, da mich das Teamplay mehr reizt als das die YoloQ. Für mich selber steht der Spaß im Vordergrund, allerdings habe ich einen Ehrgeiz das ich trotzdem immer gewinnen will :){{item:3112}} \n\nZu mir:\n\nIch bin 25 Jahre alt - Spiele LoL seit S4 - Rankeds erst seit S5 und bin momenan S3 (98LP). \nZeit zum zocken habe ich unter  der Woche von 19 - 23 Uhr und am Sonntag meistens ab 16 - 23 Uhr.\n\nGerne würde ich die MidLane spielen :)\n\nFalls du Bock hast, add mich Ingame \n\n\nGruß,","replies":[{"poster":"L5 Yeezy","date":"2015-10-22T12:55:32.259+0000","up_votes":1,"down_votes":0,"body":"hab dich geaddet","replies":[]}]}]}