{"poster":"Collassina","date":"2015-05-05T14:45:47.346+0000","title":"Le ward.","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Ho un dubbio che mi affligge.{{item:3340}}\r\nUltimamente sto capendo l&#039;importanza delle ward, cerco di evolvere il trinket al 9 e di farmi avanzare 75/100 gold per un ward (a volte mi scordo D:), che io sio adc, jungle, mid o top (per il support vabbbbbe mi compro la sightstone direttamente).\r\nEppure oggi ho guardato due partite tra quelle consigliate nel client, in una c&#039;erano dei challenger, mentre nell&#039;altra dei diamond, e ho notato che le ward erano quelle tre del supp e che gli altri nemmeno evolvevano il trinket al 9. Il top wardava il cespuglio della sua lane e basta.\r\n\r\nQuindi mi chiedo, &egrave; sbagliato quello che faccio?","replies":[{"poster":"Frattaglia","date":"2015-05-05T15:13:36.436+0000","up_votes":3,"down_votes":0,"body":"Considera anche che loro giocano sempre come se nel cespuglio in cui non hanno visione ci sia tutta la squadra nemica, a meno che ovviamente non la vedano altrove sulla mappa.\nSe tu sei top e vedi il jungler nemico bot e il mid e la botlane al loro posto sai che in quel momento è inutile wardare, se non li vedi giochi un po' più safe.","replies":[{"poster":"Lord Valotz","date":"2015-05-05T16:14:18.337+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Frattaglia,realm=EUW,application-id=MJVj50Jw,discussion-id=iQuoITNe,comment-id=0002,timestamp=2015-05-05T15:13:36.436+0000)\n>\n> Considera anche che loro giocano sempre come se nel cespuglio in cui non hanno visione ci sia tutta la squadra nemica, a meno che ovviamente non la vedano altrove sulla mappa.\n\n\nAnche i comuni mortali giocano così, finché non vanno a facecheckarlo e se la trovano veramente....\nComunque se vedi in quelle partite l'unico che tiene il trinket giallo di solito è il top, mid, jungler e support fanno il rosso e l'adc il blu, inoltre se noti hanno spesso nell'inventario una ward che tengono solo in caso di reale necessità, tra i giocatori comuni ci sono quelli che spammano ward ovunque a caso oppure quelli che non wardano direttamente, sapendo dove piazzarle correttamente nelle varie fasi della partita ti permette di avere la giusta visione, inoltre sapendo che il team nemico come il tuo si muovono con cognizione di causa si può anche pensare e cercare di prevedere dove si possano trovare.","replies":[]},{"poster":"Collassina","date":"2015-05-05T16:13:28.263+0000","up_votes":1,"down_votes":0,"body":"Capito grazie mille :D","replies":[]}]},{"poster":"taylorume","date":"2015-05-05T15:05:58.924+0000","up_votes":2,"down_votes":0,"body":"Bè in che fase del gioco erano? Non è che wardi tutta la mappa tutto il game eh xD\nSpesso si passa ad altri trinket comunque, per cui non necessariamente si uppa il giallo.\nPenso che i challenger sappiano cosa fanno...","replies":[{"poster":"Collassina","date":"2015-05-05T15:08:02.296+0000","up_votes":1,"down_votes":0,"body":"No infatti no che non si uppa sempre il giallo. Parlo di mid game comunque.\nAnche io credo sappiano quel che fanno ecco perché mi era sorto il dubbio ^^","replies":[]}]},{"poster":"Ste the ripper","date":"2015-05-05T14:53:19.333+0000","up_votes":2,"down_votes":0,"body":"è che spesso loro non ne hanno bisogno, sanno già dove sono i nemici in parte grazie ai ping e in parte grazie all'esperienza\nPoi dipende dalle fasi di gioco, ci sono momenti dove tutta la mappa è wardata e momenti dove non lo è affatto, dipende anche dai campioni, se giocano contro evelyn o shaco oppure no, dipende da tanti fattori.\nIn generale fai benissimo a comprare le ward e a potenziare il trinket, vai tranquillo\n\nIo credo che la lega in cui mediamente si warda di più sia il gold/platino la gente non ha ancora esperienza a sufficienza per capire cosa faranno i nemici in un dato momento ( se non quelle chiamate ovvie al drake o al baron) e non sono compatti quanto servirebbe, allora per rimediare comprano più ward","replies":[]}]}