{"poster":"NoSightstone4u","date":"2019-11-02T09:14:53.857+0000","title":"Honor Level","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":0,"body":"Hey Leute,\r\n\r\nich habe vor ziemlich genau einem Jahr eine Chat restriction bekommen. Mein Fehlverhalten war offensichtlich, das soll gar nicht der Punkt sein. (Nur um die Dimension meines Vergehens aufzuzeigen, es ging um die mehrfache Benutzung des Wortes \"retard\".) Jedenfalls wurde mein Honor level in Folge dessen, wie bei jedem anderen auch, zurück gesetzt. So weit so gut. \r\n\r\nNun steht das Season Ende vor der Tür und ich bin bei Honor lvl 1 mit 2 von 3 checkpoints, d.h. ich werde wohl keine Rewards für diese Season erhalten.\r\n(Auch der Vollständigkeit halber, ich habe in dieser Season 138 Solo/Duo games gespielt, 85 Flex games und noch in etwas mehr als die selbe Anzahl an Normal games.)\r\n\r\nDenkt ihr, das sei Gerechtfertigt, oder glaubt ihr nach dieser Anzahl an games (ohne erneutes Vergehen) sollte man wieder bei Honor lvl 2 angekommen sein?\r\n\r\nEs geht mir einzig und allein um eure Meinung, ich möchte mich ausdrücklich nicht beschweren. Weder bei Riot noch bei sonst irgendjemandem. Strafe muss sein, und im letzten Jahr hatte ich die Season rewards erhalten, da ich erst eine Woche nach season Ende restricted wurde.\r\n\r\nIn diesem Sinne. Danke für's lesen. :)","replies":[{"poster":"Amycos Cyrus","date":"2019-11-02T09:55:07.154+0000","up_votes":3,"down_votes":1,"body":"Ich habe vor kurzem folgenden Post gelesen: [Erfahrungen mit dem Honorsystem (Ehre)](https://boards.euw.leagueoflegends.com/de/c/spielerverhalten-de/fqFQA8el-erfahrungen-mit-dem-honorsystem-ehre)\nDer wesentliche Anteil ist, dass es schaffbar ist, dass man alle 2 Wochen eine Zwischenstufe erreicht. (Also von Honor 0 bis 2 sind das glaube ich 8 Zwischenstufen, also 16 Wochen => 4 Monate)\n\nWeiterhin habe ich aufschnappen dürfen, dass auch Reports (auch wenn sie keine Strafen zur folge haben, wenn sie berechtigt sind) den Aufstieg im Honor verzögern. Dadurch kann ich mir vorstellen, dass es sehr unterschiedlich ist, wie schnell man tatsächlich aufsteigt.","replies":[{"poster":"NoSightstone4u","date":"2019-11-04T09:59:13.446+0000","up_votes":1,"down_votes":0,"body":"Aber meine zentrale Frage war ja nicht, ob das System so ausgelegt ist, oder nicht; sondern, ob es fair ist, dass man zusätzlich zu gutem Verhalten auch noch 1000 Games in einer Season spielen muss, damit man wieder in der Ehrungsstufe aufsteigt. \n\nSicher, es ist schon möglich, innerhalb von vier Monaten von 0 auf 2 zu kommen, aber wie realistisch, bzw. fair ist das? \n\nIch denke, dass man, wenn man ca. 1 mal pro Spiel geehrt wird nach so einem Zeitraum wieder auf lvl 2 sein sollte. Es ist doch unrealistisch, dass man jedes Spiel zwei Ehrungen erhält. \n\nMeiner Meinung nach sollte Riot Spieler belohnen, die sich nach einer Strafe bessern, und wieder gutes Verhalten an den Tag legen. Und ihnen nicht auch noch Steine in den Weg legen.","replies":[{"poster":"HyperionCH","date":"2019-11-04T14:57:29.075+0000","up_votes":1,"down_votes":0,"body":"Also so ganz genau wissen wir nicht, wie die Honorstufe sich verändert.\nRiot Games hat glaube ich jedoch gesagt, dass auch Wenigspieler die Honorstufe 5 erreichen können (ab welchem Level der Start war, stand glaube ich nicht). Entsprechend klingt es so, dass nicht die absolute Zahl an Honors gezählt wird.\n\nIch vermute eher, dass alle paar Wochen das System prüft, wie die relative Zahl ist (also z.B. 20% aller Games gab es einen Honor). Und wenn dieser Wert hoch genug ist, steigt man auf.\nIch vermute, dass viele Reports (ohne dass man eine CR kriegte) dies wieder negativ beeinflussen könnte. Aber wie gesagt: so genau sagte Riot nicht, wie es funktioniert.\n\nIch spiele auch nicht allzu viel (letztens wieder mehr) und ich bin seit einigen Wochen bereits auf Honorstufe 5. Der Reset (war letzte Season auch Stufe 5) war jedoch Anfang der Season. Ich habe also innerhalb ca. 9 Monaten die Stufe 5 erneut erreicht.\n\nDie Stufenaufstiege sind angeblich immer gleich hoch. Es sollte deshalb möglich sein, dass du - bei gutem Verhalten - auf von Stufe 0 auf 2 kommst; gerade weil du gem. deiner Aussage bereits 12 Monate daran bist, dies zu erreichen.\n\nWoran es liegt, dass es bei dir nicht klappt, können wir dir nicht genau sagen.\nDenn Riot gibt keine genauen Details bekannt, wie man die Honorstufe aufsteigt (damit es nicht ausgenutzt wird).","replies":[]}]}]},{"poster":"need elo police","date":"2019-11-02T09:42:14.831+0000","up_votes":1,"down_votes":1,"body":"Am Ende ist es gerecht, weil Strafe Strafe ist. Wenn man eine Strafe bekommt, darf man sich danach nicht beschweren wenn man manche Belohnungen dann nicht erhält. Es geht auch darum, wie du dich in den Spielen seit der CR benommen hast. Denke es kommt auch schon darauf an, wie oft du dann gehonort wirst ... bei schlechter Stimmung verbreiten zum Beispiel bekommt man selten ein Honor, aber das ist auch nicht strafbar soweit ich weiß.\n\nWenn du jedes Spiel mindestens zwei Honor bekommst (ohne premades), dann dürfte es bei der Anzahl von Spielen schon geklappt haben mit Honor Level 2.","replies":[{"poster":"NoSightstone4u","date":"2019-11-04T09:52:30.956+0000","up_votes":1,"down_votes":1,"body":"Was mich stört ist, dass man selbst ja keinen Einfluss darauf hat, ob man geehrt wird, oder nicht. Bei mindestens zwei Ehrungen pro Spiel hätte es schon geklappt, ok, aber wie realistisch ist das? Im Schnitt kriegt man weniger als eine Ehrung pro Spiel und ich hänge nach einem Jahr (!) mit doch regelmäßigem spielen immer noch auf Stufe 1... Ist das fair?","replies":[{"poster":"need elo police","date":"2019-11-05T16:44:22.226+0000","up_votes":1,"down_votes":0,"body":"Ich bekomme regelmäßig Ehrungen ... und wenn man sich korrekt verhält, ist das auch kein Thema.","replies":[]}]}]},{"poster":"Yuiwara","date":"2019-11-02T10:31:39.248+0000","up_votes":1,"down_votes":1,"body":"Meinung: Ja, toxisches Verhalten gehört bestraft. umso härter, desto besser. Aber bist dir sicher, dass du nicht zwischendurch doch reported wurdest und es deinem honorfortschritt vllt dadurch geschadet hat? musst ja nicht zwingend ne strafe erhalten haben, reicht ja schon nen unbestrafter aber gerechtfertigter report.","replies":[]},{"poster":"10Kilo Eiersalat","date":"2019-11-02T10:03:27.495+0000","up_votes":2,"down_votes":3,"body":"es ist ein bisschen doof ja. aber wenn du halt ein guter spieler bist ist honor lv halt in den nächsten jahren kein problem mehr. bist ja fast wieder unter den lieben spielern :D","replies":[]}]}