{"poster":"Biergesicht","date":"2016-02-08T22:43:11.291+0000","title":"Spiel startet nicht mehr","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Tag zusammen, \r\n\r\nhabe seit ein paar Tagen das Problem, dass der Launcher nicht mehr starten will. Wenn ich die Verkn&uuml;pfung ausf&uuml;hre, kommt kurz das Zeichen vom Launcher, der Prozess erscheint auch, allerdings startet der Launcher nicht. Mir ist dabei aufgefallen, dass der Prozess mit sehr wenig Auslastung startet und es immer mehr wird, bis dann irgendwann nach einigen Minuten eine &quot;Fehlermeldung&quot; erscheint, welche eigentlich gar keine ist, da nichts drin steht. Weder eine headline noch Text im Feld, kann nur OK dr&uuml;cken und dann wars das auch und es kommt die Meldung, dass der Launcher abgest&uuml;rzt ist (dieses WIndows typische &quot;blabla.exe ist abgest&uuml;rzt&quot;)\r\n\r\nHabe schon ein paar mal neu installiert/runtergeladen, hab diverse Ordner gel&ouml;scht welche auch nach Deinstallation noch auf dem PC waren, habe runtergeladen, installiert und repariert, nichts hat bisher geholfen. Irgendwie total komisch.\r\nAn Firewalls o.&Auml;. kann es auch nicht liegen, habe ich schon alles Typische getestet.\r\n\r\nHat irgendjemand ne Ahnung was da los sein k&ouml;nnte? Oder was ich vielleicht &uuml;bersehen habe/anders machen kann?","replies":[{"poster":"Biergesicht","date":"2016-02-09T14:20:16.506+0000","up_votes":1,"down_votes":0,"body":"Mir ist noch eingefallen, dass ich einige Ports für Rainbow 6 Siege freigegeben/weitergeleitet habe, kann es daran liegen?","replies":[]},{"poster":"XxX Nomad","date":"2016-02-09T00:16:39.383+0000","up_votes":1,"down_votes":0,"body":"Mal Doof gefragt... wo installierst du das hin? Und startest du als Admin?","replies":[{"poster":"Biergesicht","date":"2016-02-09T00:30:04.046+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Raider86,realm=EUW,application-id=7hciEY9w,discussion-id=sKPf4bhE,comment-id=0000,timestamp=2016-02-09T00:16:39.383+0000)\n>\n> Mal Doof gefragt... wo installierst du das hin? Und startest du als Admin?\n\nHabs an verschiedenen Stellen versucht. Da wo es vorher war und auch normal lief und außerdem auf meinen 2 weiteren Festplatten. Hat nichts geändert. Als Admin läuft es sowieso :)","replies":[]}]}]}