{"poster":"Lord Dolan","date":"2017-11-01T02:34:18.299+0000","title":"New Runes For ALL CHAMPIONS","subforum":"Gameplay","embed":{"description":"PRESEASON RUNES FOR ALL CHAMPIONS (Subject to Change) (CTRL F the champ name to find it) Who am I?: My league username is Lord Dolan on Na, I'm D5 in solo and flex queue, and have been playing the game since beta.","url":"https://docs.google.com/document/d/1olPLIbqq1WA_HxoDFXr-lJaW-P-zrW5peZNEcZ8B-m8/edit?usp=sharing","image":"https://lh3.googleusercontent.com/rqI9-WBIh14qh8W5SqLMApORZyHJtU77_Vs3o7GSpFwQyDu3yyLNC9FGeSZFH62yqlhRMw=w1200-h630-p"},"up_votes":112,"down_votes":10,"body":"I made pages for all champs, you don&#039;t have to agree with all of them, but this should be for the most part what you see when general rune pages are established. Some of the **images** (NOT the actual pages) aren&#039;t relevant due to balance changes but the pages are still the same since those balance changes did not influence my opinion.\n\nSorry the layout isn't very professional. I'll work with you guys to fix the document if you give viable enough pointers. A\nlot of you guys MAIN specific champs and probably have more insight which has already been demonstrated in the\ncomments. By all means, tell me I'm wrong so we have more accurate information. Thank you.\n\nEdit: So far you guys are giving for the most part good feedback, keep it up especially those that main specific\nchampions. Again, doing all champs is a challenge because I do not main all champions lol, I just use my knowledge of\nthe game.\n\n**I'll check back every once in a while to see suggestions**","replies":[{"poster":"Tenth Leper","date":"2017-11-01T02:37:08.763+0000","up_votes":36,"down_votes":0,"body":"You work hard","replies":[{"poster":"Lord Dolan","date":"2017-11-01T02:40:10.961+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Tenth Leper,realm=NA,application-id=3ErqAdtq,discussion-id=A9WjLdAo,comment-id=0000,timestamp=2017-11-01T02:37:08.763+0000)\n>\n> You work hard\n\nthanks, though the descriptions got pretty lazy as I went on (I.E. hecarim's)","replies":[]}]},{"poster":"Sparkle","date":"2017-11-01T18:04:19.703+0000","up_votes":25,"down_votes":2,"body":"Aw, this is SO cool! I really like that you took a crack at theorycrafting one for every single champion - gave 'em a once over and they all seem like legit options. I love that you included alternatives for champs like AP Ezreal too.\n\nEven though there are some here or there I would personally switch out (which really comes down to playstyle a lot of the time) these are a really solid baseline (and it's cool to have tangible examples to discuss). :D","replies":[{"poster":"Lord Dolan","date":"2017-11-01T23:04:14.680+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Riot Sparkle,realm=NA,application-id=3ErqAdtq,discussion-id=A9WjLdAo,comment-id=0016,timestamp=2017-11-01T18:04:19.703+0000)\n>\n> Aw, this is SO cool! I really like that you took a crack at theorycrafting one for every single champion - gave &#x27;em a once over and they all seem like legit options. I love that you included alternatives for champs like AP Ezreal too.\n> \n> Even though there are some here or there I would personally switch out (which really comes down to playstyle a lot of the time) these are a really solid baseline (and it&#x27;s cool to have tangible examples to discuss). :D\n\nThanks. Yeah the pages definitely can be changed based on play style, these are more like templates for players to find their preference from.","replies":[{"poster":"Sparkle","date":"2017-11-02T00:12:48.599+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=Lord Dolan,realm=NA,application-id=3ErqAdtq,discussion-id=A9WjLdAo,comment-id=00160000,timestamp=2017-11-01T23:04:14.680+0000)\n>\n> Thanks. Yeah the pages definitely can be changed based on play style, these are more like templates for players to find their preference from.\n\nYeah thanks for putting this together, I'm sure it was a ton of work!","replies":[]}]}]},{"poster":"Rins Thigh Socks","date":"2017-11-01T15:59:50.318+0000","up_votes":7,"down_votes":0,"body":"So I looked at only 6 champions, ones that I play, and here's the issue (keep in mind small sample size).\n\nYou're focusing too much on small parts of a champions kit, rather than their overall function. For Vladimir, you focus on the sustain rather than his normal play pattern. With Vlad you have to drop aggro, run in, hope you burst them enough to get a good MS bonus out of there. You've focused specifically on his sustain and passive, which are nice parts of his kit but not things you want to focus your runes around.\n\nI'll give you TF's look good, considering you did note that his style of play is dependent entirely on roams and MS and built an entire page around that. I'm quite interested in that permanent MS bonus on takedowns.\n\nSyndra's are questionable. Lane dominant champions actively trade so I don't imagine she'll be above 70% HP as much as you think.\n\nViktor's are not good. He'll want mana band far more than R since he is very strong even without his ultimate, and he runs out of mana very quickly.\n\nAhri's are bad. Ultimate hat gives her almost infinite pressure. You focused a lot on the Q MS but honestly Ahri doesn't 100-0 super combo you unless ahead. Until then she tends to space out her combo and force you to back off over a 5-6 second window while she whittles you down.\n\nLux - That mana regen one doesn't synergize with the bonus damage when low on mana. I wouldn't suggest ultimate hat since I don't honestly think she needs it. She needs synergy and more solid Q/W/E than a buffed up ulti.\n\nLeBlanc's look solid. I'm interested in more MS heavy builds for roaming.\n\nAlso you take Waterwalking a lot. Is it that good or are the other masteries in that tree hot garbage?","replies":[]},{"poster":"Jaspers","date":"2017-11-02T16:51:18.353+0000","up_votes":2,"down_votes":0,"body":"This is great, good work. But you didn't take demolish on Nasus or Yorick?","replies":[{"poster":"Lord Dolan","date":"2017-11-02T19:51:19.671+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=Antergaton,realm=EUW,application-id=3ErqAdtq,discussion-id=A9WjLdAo,comment-id=0039,timestamp=2017-11-02T16:51:18.353+0000)\n>\n> This is great, good work. But you didn&#x27;t take demolish on Nasus or Yorick?\n\nThanks. I mentioned in yoricks description you can take demolish.  Nasus CAN take it but he actually destroys towers with aa q's faster then demolish does which does have a decent channel. Its fairly debatable if he should take it. Demolish is more for champs with little damage to towers like say nautilus with a lot of health.","replies":[{"poster":"Jaspers","date":"2017-11-03T09:48:30.740+0000","up_votes":2,"down_votes":0,"body":"Good points. I guess, with Yorick at least, even if it's not much extra damage as say 4000 hp Nautilus, if you are taking first top turret when you have 4000hp then something's gone wrong. If a Yorick is at your inhib turret, you've probably already lost. In the case of Nasus, if he's there he's 2 shotting that thing anyway.\n\nGood thinking, my Lord.","replies":[]}]}]},{"poster":"Deressi","date":"2017-11-01T23:54:04.480+0000","up_votes":4,"down_votes":0,"body":"Great moves, Dolan. Keep it up!","replies":[]},{"poster":"PaffWasTaken","date":"2017-11-01T17:17:11.679+0000","up_votes":4,"down_votes":0,"body":"I don't even care if you would just put some random thingies in those pages; making personalised pages for each and every champions is a lot of work that you should be proud of. For an ARAM main player such as myself, this data is a gold mine, so I sincerely thank you for what you've done, this will save me a lot of effort and will truly help me a lot in the upcoming season","replies":[]},{"poster":"Critmaster Garen","date":"2017-11-01T11:26:41.622+0000","up_votes":1,"down_votes":5,"body":"this is pointless, no offense. i can see  a lot of efford went into this.\n\nbut for each individual champion there are multiple runepage combinations for different situations. there isnt a generic runepage youd use in any situation, and even with the same choices of primary and secondary path, some of the runes could switch around depending on your matchups.\n\nfor example grasp is trash in about 80% of garens matchups, when he  has to play passive, cant nonstop trade, or trades are too short for grasp to even get ready to benefit from the proc. these cases would lock him out of the resolve tree as primary choice as there isnt another viable keystone option for him. and you should generally use your main path for the keystone first. unless you want to play him without a keystone effectively.\n\nso youd probably make due with sorcery (phase rush) or domination (thunderlord, dark harvest) as your primary path in most cases.\n\neven if youd go resolve on garen as your first choice, in the few matchups where you can rely on stacking grasp, any of the other pathes have viable options for your two other runes from the secondary path. in most cases id rather expect people to pick the other two runes from sorcery (celerity, scorch, gathering storm, the ultimate hat, or the one that empowers you in the river).\n\n\nthis is just one champion. you could make cases like this for pretty much any champion.","replies":[{"poster":"Lord Dolan","date":"2017-11-01T15:31:39.118+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Critmaster Garen,realm=NA,application-id=3ErqAdtq,discussion-id=A9WjLdAo,comment-id=0009,timestamp=2017-11-01T11:26:41.622+0000)\n>\n> this is pointless, no offense. i can see  a lot of efford went into this.\n> \n> but for each individual champion there are multiple runepage combinations for different situations. there isnt a generic runepage youd use in any situation, and even with the same choices of primary and secondary path, some of the runes could switch around depending on your matchups.\n> \n> for example grasp is trash in about 80% of garens matchups, when he  has to play passive, cant nonstop trade, or trades are too short for grasp to even get ready to benefit from the proc. these cases would lock him out of the resolve tree as primary choice as there isnt another viable keystone option for him. and you should generally use your main path for the keystone first. unless you want to play him without a keystone effectively.\n> \n> so youd probably make due with sorcery (phase rush) or domination (thunderlord, dark harvest) as your primary path in most cases.\n> \n> even if youd go resolve on garen as your first choice, in the few matchups where you can rely on stacking grasp, any of the other pathes have viable options for your two other runes from the secondary path. in most cases id rather expect people to pick the other two runes from sorcery (celerity, scorch, gathering storm, the ultimate hat, or the one that empowers you in the river).\n> \n> \n> this is just one champion. you could make cases like this for pretty much any champion.\n\nIts not really pointless. There are a ton of people that are going to be lost with new runes, and this is a place to start for those people. I already made note in the beginning of this document these are generalized rune pages that can be changed. Also, there are actually some champions that don't have much else then specific pages or at the very least specific trees or tree combinations they must go into.\n\nAlso, I agree phase rush is generally a good idea too for garen. Its just that grasp is not exactly unreliable, garen is pretty good at extended trades so it procs fairly often. Health works well with garens free stats from w as well. Sorcery is fine though for more damage and kill potential, so I'll note that in. Electrocute is probably not very good on garen compared to other runes and dark harvest could be good but I don't think garen is much of a spliter as much as he is a team fighter. Ofcourse these runes are also based on your play style.\n\nUnderstand that this was made to give people a head start, I believe it will help people for that reason.","replies":[]}]},{"poster":"CannabisOverlord","date":"2017-11-01T03:32:18.546+0000","up_votes":2,"down_votes":0,"body":"Like the Mordekaiser one, how do i save this post?","replies":[{"poster":"Lord Dolan","date":"2017-11-01T03:35:13.898+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Master0fMetal,realm=NA,application-id=3ErqAdtq,discussion-id=A9WjLdAo,comment-id=0004,timestamp=2017-11-01T03:32:18.546+0000)\n>\n> Like the Mordekaiser one, how do i save this post?\n\nIf you want to save the doc I believe it should show up in your google drive. If you don't have one of those you could bookmark it. I can get you a specific picture for morde though through this link https://gyazo.com/0a4c49a95c76d59f733f06a5bca75ae6 (gyazo is a screenshoting program)","replies":[]}]},{"poster":"Oakleaf Ranger","date":"2017-11-01T16:44:20.663+0000","up_votes":1,"down_votes":4,"body":"Swain does not get GLP, I'm not really happy or satisfied with your list. I would check out the sub reddits to see what those people are building since they seem more accurate.\n\nSwain does not build GLP. Gross","replies":[{"poster":"Lord Dolan","date":"2017-11-01T16:48:07.980+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=MistakenKing,realm=NA,application-id=3ErqAdtq,discussion-id=A9WjLdAo,comment-id=0011,timestamp=2017-11-01T16:44:20.663+0000)\n>\n> Swain does not get GLP, I&#x27;m not really happy or satisfied with your list. I would check out the sub reddits to see what those people are building since they seem more accurate.\n> \n> Swain does not build GLP. Gross\n\nActually, he does take glp. In fact, the subreddits and high elo players alike take it in many match ups. It makes landing w REALLY easy and is not very different from ROA. You can take roa in games where the slow won't help, but the champ definitly takes this item and I myself have HIGH success with the item. \n\nIf you want to disprove me you'll have to give me a basis of why its not as good as___ and if you arent happy with the list then tell me why, not just that you aren't happy with it.","replies":[]}]},{"poster":"deadlychuck","date":"2017-11-03T01:20:03.410+0000","up_votes":3,"down_votes":0,"body":"And this is why people need to stop acting like \"cookie cutter\" systems are a problem to be fixed.\nThere will always be someone who creates the \"optimal\" choices or a high tier player which people just mimic. \n\nNot to say there's anything wrong with you doing this OP. I'm just looking through the comments and there's already so many people who are happy that they can just copy paste someone else's choices as a solution to the questions posed to them.\n\nSo sick of changing systems, in a way that negatively impacts the game, as a means to fix something that's not actually in need of fixing. Yes, the old rune/mastery system was boring, but it was also didn't herd players into choices as much. ","replies":[]},{"poster":"TheEvilQueen135","date":"2017-11-02T22:58:12.351+0000","up_votes":3,"down_votes":0,"body":"I love this so much <3 you are an amazing human being for doing this","replies":[{"poster":"Lord Dolan","date":"2017-11-02T23:37:08.669+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=TheEvilQueen135,realm=NA,application-id=3ErqAdtq,discussion-id=A9WjLdAo,comment-id=003c,timestamp=2017-11-02T22:58:12.351+0000)\n>\n> I love this so much &lt;3 you are an amazing human being for doing this\n\nThanks","replies":[]}]},{"poster":"OyddAWqJ5r","date":"2017-11-02T04:18:37.606+0000","up_votes":3,"down_votes":0,"body":"Not every champ has Dark Harvest 2/10\n\n/s Nice stuff dude!","replies":[{"poster":"Lord Dolan","date":"2017-11-02T05:20:40.707+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Sleeper Cell,realm=NA,application-id=3ErqAdtq,discussion-id=A9WjLdAo,comment-id=0031,timestamp=2017-11-02T04:18:37.606+0000)\n>\n> Not every champ has Dark Harvest 2/10\n> \n> /s Nice stuff dude!\n\nthanks lol, sorry I'm not vandril","replies":[]}]},{"poster":"Best Boi Eugeo","date":"2017-11-02T02:42:01.993+0000","up_votes":3,"down_votes":0,"body":"That singed page is disgusting LOL","replies":[]},{"poster":"Unvictus","date":"2017-11-01T23:49:07.612+0000","up_votes":3,"down_votes":0,"body":"Big thumbs up for all your hard work! I main {{champion:55}} and I was quite delighted to see that you built the exact same rune page that i've been using on the PBE.","replies":[]},{"poster":"DorkunedAuras","date":"2017-11-01T22:28:30.659+0000","up_votes":3,"down_votes":0,"body":"Tossing in my Rek'Sai main hat in here (and tossing the ultimate hat out).\n\nI like the Primary tree, but you're wrong about something. No damage amps will increase the E damage, as it's true damage. It does its listed damage, no amps or reductions. Still the right path I'd say.\n\nFor the secondary, I prefer Domination with Sudden Impact and Relentless Hunter, though I'm the type of person who invades, heavy ganks, and goes for as much blood as possible early. My style is to absolutely take over the game and win before I fall off, so this better suits me. I don't like the situationalness of Waterwalking. I do most of my fighting in lanes or in the enemy jungle, and I don't get much as a result of this. As for the hat I think it takes too long to scale up. By the time you're getting good value from it, the game should be over. Besides, I rarely have the issue of waiting on my ult CD anyway. Warrior > Cleaver gets me 30% CDR and that covers it just fine.","replies":[{"poster":"Lord Dolan","date":"2017-11-02T20:22:02.392+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=DarkenedAuras,realm=NA,application-id=3ErqAdtq,discussion-id=A9WjLdAo,comment-id=0026,timestamp=2017-11-01T22:28:30.659+0000)\n>\n> Tossing in my Rek&#x27;Sai main hat in here (and tossing the ultimate hat out).\n> \n> I like the Primary tree, but you&#x27;re wrong about something. No damage amps will increase the E damage, as it&#x27;s true damage. It does its listed damage, no amps or reductions. Still the right path I&#x27;d say.\n> \n> For the secondary, I prefer Domination with Sudden Impact and Relentless Hunter, though I&#x27;m the type of person who invades, heavy ganks, and goes for as much blood as possible early. My style is to absolutely take over the game and win before I fall off, so this better suits me. I don&#x27;t like the situationalness of Waterwalking. I do most of my fighting in lanes or in the enemy jungle, and I don&#x27;t get much as a result of this. As for the hat I think it takes too long to scale up. By the time you&#x27;re getting good value from it, the game should be over. Besides, I rarely have the issue of waiting on my ult CD anyway. Warrior &gt; Cleaver gets me 30% CDR and that covers it just fine.\n\nDon't know how I missed this yesterday, may bad. I'll make it better clarification in the description.  I'll definitly include secondary trees could be different depending on what you need. Yeah domination does look better here though I think ravenous hunter could also work too.  I agree with hat probably taking too long, as time as gone on more and more people are saying how ultimate hat is very specific to champs that don't build much cdr. Will note that in. Thanks for your input.","replies":[{"poster":"DorkunedAuras","date":"2017-11-02T22:49:59.207+0000","up_votes":2,"down_votes":0,"body":"I can absolute agree with Ravenous hunter also being reasonable. That might be better for a more generic page, I was just saying what I specifically use, but as I said before, I know I'm more aggressive than most players.","replies":[]}]}]},{"poster":"EkyonKun","date":"2017-11-02T02:08:18.503+0000","up_votes":1,"down_votes":0,"body":"I like how you thought outside the box for Annie! Glacial + Protobelt is honestly something I've never thought of before. I assumed you'd just stick Arcane Comet on her and call it a day, but you actually put a bit of thought behind her rune build.\n\nI can't speak for the entire list (Who could?) but for Annie, I still believe Unsealed Spellbook is ideal for her. Having more flash engages + the ability to swap ignite for ghost or TP is extremely good for her. Considering how much she can dish out from a flash engage, just the 25% Summoner CDR alone is perfectly suited toward her. Fantastic list by the way.","replies":[{"poster":"Lord Dolan","date":"2017-11-02T05:22:57.191+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=EkyonKun,realm=NA,application-id=3ErqAdtq,discussion-id=A9WjLdAo,comment-id=002f,timestamp=2017-11-02T02:08:18.503+0000)\n>\n> I like how you thought outside the box for Annie! Glacial + Protobelt is honestly something I&#x27;ve never thought of before. I assumed you&#x27;d just stick Arcane Comet on her and call it a day, but you actually put a bit of thought behind her rune build.\n> \n> I can&#x27;t speak for the entire list (Who could?) but for Annie, I still believe Unsealed Spellbook is ideal for her. Having more flash engages + the ability to swap ignite for ghost or TP is extremely good for her. Considering how much she can dish out from a flash engage, just the 25% Summoner CDR alone is perfectly suited toward her. Fantastic list by the way.\n\nFor some games I agree annie could take summoner specialist especially if not building protobelt. I'll edit this in, thanks. I don't WANT to take arcane comet on a lot of these champs, but there's limited opportunities unfortunately. Annie has a better time using inspiration for so many reasons so that feels pretty nice.","replies":[]}]},{"poster":"GhaelWinds","date":"2017-11-01T16:25:25.810+0000","up_votes":1,"down_votes":0,"body":"For fiora press the attack is still best for her since most of her damage is physical. She is my main and the Fiora Mains discord have pretty said that that's the best one generally. Also one could make the argument for Legend: Bloodline instead since that's her main way of staying alive, she's so squishy the minor tenacity won't do much. \n\nI think you're very wrong with Camille. She's my secondary main and I've been testing her on PBE, the best I've found is Press the Attack-triumph- Alacrity (or the tenacity one) - coup de grace with domination secondary- sudden impact- eyeball/ghost poro. This gives her the damage she needs to actually be able to dive and her constant aa resets help proc that press the attack very efficiently.","replies":[{"poster":"Lord Dolan","date":"2017-11-01T16:27:59.216+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=GedweyStenr,realm=NA,application-id=3ErqAdtq,discussion-id=A9WjLdAo,comment-id=0010,timestamp=2017-11-01T16:25:25.810+0000)\n>\n> I think you&#x27;re very wrong with Camille. She&#x27;s my secondary main and I&#x27;ve been testing her on PBE, the best I&#x27;ve found is Press the Attack-triumph- Alacrity (or the tenacity one) - coup de grace with domination secondary- sudden impact- eyeball/ghost poro. This gives her the damage she needs to actually be able to dive and her constant aa resets help proc that press the attack very efficiently.\n\nNoted, I'll fix this right away.","replies":[{"poster":"GhaelWinds","date":"2017-11-01T16:42:00.802+0000","up_votes":1,"down_votes":0,"body":"I edited my original for some Fiora stuff as well. You were a lot quicker on the draw than expected. Haha...","replies":[{"poster":"Lord Dolan","date":"2017-11-01T16:44:36.479+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=GedweyStenr,realm=NA,application-id=3ErqAdtq,discussion-id=A9WjLdAo,comment-id=001000000000,timestamp=2017-11-01T16:42:00.802+0000)\n>\n> I edited my original for some Fiora stuff as well. You were a lot quicker on the draw than expected. Haha...\n\nI check pretty often when I'm here, especially since I know some of these pages may be really iffy compared to others. Especially when the players that main these champs come in and tell me why my page is bad, so I want to fix it as soon as possible. Don't worry I got the fiora page too. Both of them bothered me due to true damage but its still better to take press huh.","replies":[{"poster":"GhaelWinds","date":"2017-11-01T16:49:48.400+0000","up_votes":2,"down_votes":0,"body":"Hmhmm especially for fiora, it's less effective for Camille but all the other choices to increase her damage are very bad for her even the ones in domination dont work as well as press the attack. And yea she needs damage so a damage keystone is a must she gets enough speed from her abilities. And ult can be used to dodge cc if you're good.","replies":[]}]}]}]}]},{"poster":"The Ghøst King","date":"2017-11-01T15:10:51.972+0000","up_votes":1,"down_votes":0,"body":"i think grasp would also be good for  gangplank because his passive keeps him in combat","replies":[{"poster":"Lord Dolan","date":"2017-11-01T15:23:50.669+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Mrs Yuno Gasaii,realm=NA,application-id=3ErqAdtq,discussion-id=A9WjLdAo,comment-id=000c,timestamp=2017-11-01T15:10:51.972+0000)\n>\n> i think grasp would also be good for  gangplank because his passive keeps him in combat\n\nIf you get the melee aa off yeah, but I believe kleptomancy out values it here due to the sheer amount of times you'll proc kleptomancy in game.","replies":[{"poster":"The Ghøst King","date":"2017-11-01T15:29:15.906+0000","up_votes":2,"down_votes":0,"body":"yeah to correct myself grasp would be better for top lane gp, he is a kind awkward champion for runes reforged\n\nedit: kleptomacy is still the better choice tho","replies":[]}]}]},{"poster":"Ok sure but why","date":"2017-11-01T03:13:34.589+0000","up_votes":1,"down_votes":0,"body":"http://na.leagueoflegends.com/en/featured/preseason-update/8000-8008?build=01201184\n\nI think this one would work nicely on a Jhin who consistently uses his auto attacks\n\nHis crits give him extra ms, which translates to AD \n\nHe gets a bunch of attack speed steroids to multiply his AD\n\nAnd he gets a bunch of AD from Gathering Storm \n\nMmmmmmmmm","replies":[{"poster":"Lord Dolan","date":"2017-11-01T03:26:56.335+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=JZ Jora,realm=NA,application-id=3ErqAdtq,discussion-id=A9WjLdAo,comment-id=0003,timestamp=2017-11-01T03:13:34.589+0000)\n>\n> http://na.leagueoflegends.com/en/featured/preseason-update/8000-8008?build=01201184\n> \n> I think this one would work nicely on a Jhin who consistently uses his auto attacks\n> \n> His crits give him extra ms, which translates to AD \n> \n> He gets a bunch of attack speed steroids to multiply his AD\n> \n> And he gets a bunch of AD from Gathering Storm \n> \n> Mmmmmmmmm\n\nI tested the ad increase and you are right about it being better then electrocute. Early game it increases his ad by 8 at level 1 and more as he levels and gets ad. I don't know why I didn't take gathering storm tbh so Ill change that too soon.\n\nWill fix in a sec.","replies":[]}]},{"poster":"Kynin","date":"2017-11-01T02:47:23.431+0000","up_votes":2,"down_votes":0,"body":"I thought Arcane Comet would be best on Zillean as well but after testing Aery feels much better. Generally Zillean has few itemization choices in the support role but with Aery he can run a normal enchanter build. WIth Athenes he will do considerable damage while having more utiltiy than the normal full ap build. \n\nTLDR: Zillean E is now better Karma E.","replies":[{"poster":"Lord Dolan","date":"2017-11-01T02:49:32.875+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Kynin,realm=NA,application-id=3ErqAdtq,discussion-id=A9WjLdAo,comment-id=0001,timestamp=2017-11-01T02:47:23.431+0000)\n>\n> I thought Arcane Comet would be best on Zillean as well but after testing Aery feels much better. Generally Zillean has few itemization choices in the support role but with Aery he can run a normal enchanter build. WIth Athenes he will do considerable damage while having more utiltiy than the normal full ap build. \n> \n> TLDR: Zillean E is now better Karma E.\n\nYou're right tbh, well for support zilean anyway. I'll fix that.","replies":[]}]},{"poster":"GhaelWinds","date":"2017-11-02T13:32:40.872+0000","up_votes":2,"down_votes":1,"body":"Looked at your olaf one, I play Olaf a decent bit and lethal tempo is probably the best keystone with overheal bloodline and last stand. Probably secondary would be sorcery with manaflow and whatever you want last. Depends on a lot of things I personally would probably go celerity. \n\nIf you need an explanation feel free to ask.","replies":[]},{"poster":"9tt2","date":"2018-03-18T05:50:21.403+0000","up_votes":1,"down_votes":0,"body":"Are you planning on keeping this updated at all? Just curious.","replies":[]},{"poster":"daviiiiid97","date":"2017-12-04T20:06:16.053+0000","up_votes":1,"down_votes":0,"body":"hello. can someone tell me best runes for ZOE?","replies":[]},{"poster":"AonDor","date":"2017-11-22T00:32:33.369+0000","up_votes":1,"down_votes":0,"body":"What are your thoughts on fleet footwork and grasp Wukong?\nThey give him incredibly helpful sustain.\n\nEspecially grasp, because it gives him tankier stats, so he can focus on a damage build to make up for electrocute -  this makes it the sam =e but he has lane sustain.","replies":[]},{"poster":"TroyiZhere","date":"2017-11-18T23:57:50.320+0000","up_votes":1,"down_votes":0,"body":"First off, I'd like to just say this is incredible how much time and effort you have put into this, and many of these are spot on. I just wanted to make a suggestion on Annie specifically, as someone who plays her frequently. I do see where you are coming from with Glacial Augment. However, there are many many many ways to play Annie, and while I do agree that glacial augment can work really well on one of her playstyles, I would argue that it's not her ideal. Annie benefits greatly from movement speed and slows, which glacial augment gives her. However, I think predator is a more well rounded keystone for her. Though, you made a great point with electicute that she doesn't synergize too well with the domination lesser runes, I think she can still use them decently. Also, I think celerity might be better than waterwalker (at least if you take predator because it increased the boost even more).\n\nEDIT:\nAlso protobelt doesn’t have a slow, which you mention it does in the doc. It doesn’t proc glacial augment even if you have built rylai’s (instead only applying rylais slow).\n\nThere are 5 items that apply glacial augment: Randuins omen, Righteous glory, Hextech GLP, Hextech Gunblade, and Blade of the ruined king. I’m not sure if glacial augment is worth it for any champ that doesn’t buy one of these items. ","replies":[]},{"poster":"See u Weekend","date":"2017-11-12T20:14:42.084+0000","up_votes":1,"down_votes":0,"body":"A big thankful for providing this awesome information. You did a really hard work. It's so perfect on the top karma and trundle. It helps me to win games.","replies":[]},{"poster":"Waitapy","date":"2017-11-10T20:33:38.602+0000","up_votes":1,"down_votes":0,"body":"Thank you , but is there any way i can downoload that on my PC in pdf or txt ... ?","replies":[{"poster":"Lord Dolan","date":"2017-11-10T21:21:29.378+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Waitapy,realm=EUNE,application-id=3ErqAdtq,discussion-id=A9WjLdAo,comment-id=004d,timestamp=2017-11-10T20:33:38.602+0000)\n>\n> Thank you , but is there any way i can downoload that on my PC in pdf or txt ... ?\n\nIf you go to the document and press file in the top left you can download it and convert into pdf, ect.","replies":[{"poster":"Waitapy","date":"2017-11-10T21:29:38.099+0000","up_votes":1,"down_votes":0,"body":"I dont have any options available only i can read it and thats all ...","replies":[]}]}]}]}