{"poster":"Rick Silence","date":"2016-10-03T02:36:11.735+0000","title":"Runas previas al nivel 20... Por qué no se usan?","subforum":"Guias y consejos","up_votes":4,"down_votes":1,"body":"Las runas que se pueden comprar antes del nivel 20 son muy baratas (1 PI cada una) y no tienen tanta diferencia de poder con respecto a las que se desbloquean despu&eacute;s: si se fijan, por ejemplo, en el grifo de resistencia m&aacute;gica, compar&aacute;ndolo con el gran glifo de resistencia m&aacute;gica, ver&aacute;n que su diferencia es menor a 0,25 de rm entre uno y el otro.\r\nComprobando que no tienen tanta diferencia.... Por qu&eacute; no las usan los niveles bajos?\r\nRecomiendo que las prueben, hacen mucha diferencia, aunque no lo crean","replies":[{"poster":"Copia original","date":"2016-10-03T04:30:45.072+0000","up_votes":1,"down_votes":0,"body":"porque todos estamos en nivel 30 cual es tu logica","replies":[{"poster":"Rick Silence","date":"2016-10-03T14:12:35.406+0000","up_votes":5,"down_votes":0,"body":"Que hablo para los que están por debajo del nivel 20?","replies":[]}]},{"poster":"9081913DEL1","date":"2016-10-03T10:12:09.869+0000","up_votes":1,"down_votes":0,"body":"A niveles bajos en gral, se desbloquean a tier 2, asique de arranque es muy corto el periodo entre una y otra como para que sirva. \nEn una smurf si las uso, pero en una cuenta official son muchas runas al pp. Comprar las lvl 3 es mucho mas rentable que comprar cualquier otra cosa. \nEsta bueno que las usen, pero que vayan a rankear sin tener las tier 3, es simplemente no entender que es rankear.\n\nLol te permite probar maestrias en su pagina, las runas creo que hay un builder si no las tienes todas. \n\nEn gral hay poca info real. Muchas guias pero pocos fundamentos. \n\nLo mas importante es comprarte al principio la pagina de runas extra, Con tres paginas genericas ya tenes algo decente para no estar corriendo en cada partida.\n\nLuego ni bien puedas las tier 3 y ya esta. Solo falta mejorar mecanicas y modo de juego.\n\nSaludos.","replies":[{"poster":"Rick Silence","date":"2016-10-03T14:12:09.163+0000","up_votes":4,"down_votes":0,"body":"Este.... estoy hablando de jugadores por debajo del nivel veinte... nos falta nivel para rankear","replies":[{"poster":"9081913DEL1","date":"2016-10-03T14:18:46.042+0000","up_votes":1,"down_votes":0,"body":"Justamente debajo de nivel 20 y hasta nivel 30 es muy orto el tiempo entre tiers.\nLas lvl 1 las pasas en dias jugando lo mismo las lvls 2, por mas baratas que sean no dura mucho hasta que desbloqueas las nivel 3.\n\nHay bastante diferencia, solo que no lo sabes hasta que aprendes a usar bien a los campeones. Pero tener todas runas tier 3 a tener todas runas tier 2 cambia mucho.\n\nSaludos.","replies":[{"poster":"Rick Silence","date":"2016-10-03T14:25:34.572+0000","up_votes":4,"down_votes":0,"body":"Pero del nivel 1 al 20, cuando se desbloquean las runas grado 3 (o así tengo entendido), sí hay bastante tiempo y es ahí cuando hay que usar las runas baratas..... Desde el nivel 20 sí hay que usar las de grado 3.\nQué significa tiers?\nPerdón, no entiendo mucho lo que decís..... :/\n{{sticker:zombie-nunu-tears}}","replies":[{"poster":"9081913DEL1","date":"2016-10-03T14:54:54.980+0000","up_votes":2,"down_votes":1,"body":"Al llegar a lvl 10, desbloqueas las runas de nivel 2 - Tier 2.\nComprarlas esta bien puesto que solo cuestan 1 de pi, creo que las pusieron a ese precio justamente para que las usen al menos. y son cercanas en funcionalidad a las siguientes para que si alguien lvl 30 no tiene runas y quiere rankear al menos tenga estas.\n\nLo que digo es que ni bien llegas a 20 ya puedes usar las de grado 3. Las de grado 3 Son el tope de rendimiento de las runas, osea que ya no hay alguien que te pueda ganar un duelo por ventajas en este sentido.\n\nDel mismo modo, el problema de uso es que la cuenta luego de lvl 30 ya arranca su vida, en comparacion el tramo de nivel 1-20 es muy corto como para prestarle atencion a esas runas. Usarlas si. Aprovechar a probar runas y combinaciones, pues son baratas. Pero ya cuando le estas tomando apenas l gusto estas en 20 y te conviene ir encarando las caras.\n\nDesde mi punto de vista, bien puedes comprar TODAS las lvl2 desde que llegas a lvl 10. y justamente aprenderte esas pequeñas diferencias que da ponerse cdr, penetracion hibrida y demas. \n\nSaludos.","replies":[{"poster":"Rick Silence","date":"2016-10-03T15:53:19.601+0000","up_votes":4,"down_votes":0,"body":"Ahora sí entendí :D :D :D\nBueno, eso decía yo. He escuchado que algunos piensan que hasta el nivel 30 no sirve de nada usar runas.... Solo espero que en PvP me toque esa gente en el equipo contrario :v\nPor mi parte, ya llevo ahorrando 6000 PI para poder comprarme, cuando llegue el nivel 20, runas grado 3.... :p\nSaludos!\n{{sticker:slayer-jinx-catface}}","replies":[]}]}]}]}]}]},{"poster":"martincarp","date":"2016-10-03T02:40:01.589+0000","up_votes":2,"down_votes":0,"body":"Supongo que no las usan porque no tienen nadie que les enseñe, son jugadores nuevos que no entienden como funcionan las runas y maestrías, y no se dan cuenta de la diferencia que puede llegar a marcar tener esos 3 o 4 de resistencias extra en los primeros niveles.","replies":[{"poster":"Rick Silence","date":"2016-10-03T03:10:27.926+0000","up_votes":4,"down_votes":0,"body":"Así se habla!  aunque yo he intentado explicarle a un par de jugadores y no me hicieron caso :/\n{{sticker:slayer-jinx-wink}}","replies":[{"poster":"martincarp","date":"2016-10-03T03:14:35.208+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Viuda Negra 13,realm=LAS,application-id=8sKIclmi,discussion-id=upaAPZlq,comment-id=00000000,timestamp=2016-10-03T03:10:27.926+0000)\n>\n> Así se habla!  aunque yo he intentado explicarle a un par de jugadores y no me hicieron caso :/\n> {{sticker:slayer-jinx-wink}}\n\nLo más práctico si quieres enseñar o aconsejar a jugadores nuevos es actuar de manera positiva durante la partida, bromear y a la vez señalar pequeñas cosas que se pueden hacer durante la partida, y luego de que termine agregarlos, chatear un rato y ahí darles los consejos más importantes. Siempre que subí una cuenta hacía eso, actuaba como shotcaller durante la partida y al final a los que veía que realmente eran nuevos y tenían ganas de aprender aprovechaba para aconsejarlos con de todo.","replies":[{"poster":"Rick Silence","date":"2016-10-03T14:10:03.695+0000","up_votes":4,"down_votes":0,"body":"Claro! Así lo hice.... yo no soy flamer!","replies":[]}]}]},{"poster":"FedecarboneroUY","date":"2016-10-03T03:14:02.693+0000","up_votes":1,"down_votes":0,"body":"tampoco hay un tutorial bien hecho que les enseñe, no crees? tengo amigos en Plata/Oro especialmente uno en Oro 1 que jugó hasta hace poco con un poco de poder de habilidad, daño de ataque, pen. armadura, 20 y algo de vida en lvl 18 ... viste esas ensaladas de runas? bueno, jugaba con eso, ahora subió a Oro 1 y tiene las runas un poco mejor pero ni eso ..  -.-","replies":[{"poster":"martincarp","date":"2016-10-03T03:26:50.022+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FedecarboneroUY,realm=LAS,application-id=8sKIclmi,discussion-id=upaAPZlq,comment-id=00000001,timestamp=2016-10-03T03:14:02.693+0000)\n>\n> tampoco hay un tutorial bien hecho que les enseñe, no crees? tengo amigos en Plata/Oro especialmente uno en Oro 1 que jugó hasta hace poco con un poco de poder de habilidad, daño de ataque, pen. armadura, 20 y algo de vida en lvl 18 ... viste esas ensaladas de runas? bueno, jugaba con eso, ahora subió a Oro 1 y tiene las runas un poco mejor pero ni eso ..  -.-\n\nPARA MÍ está perfecto que sea así, ya que en League los pequeños detalles son los que diferencian a los buenos jugadores de los mejores. Y que un jugador no quiera tomarse la delicadeza de buscar información sobre como progresar por al menos un ratito (más sobre algo tan básico como las runas y maestrías) y por eso tenga peor rendimiento que alguien que si se esfuerza en aprovechar al máximo cada detalle, es lo que hace la competitividad de LoL más entretenida.","replies":[{"poster":"FedecarboneroUY","date":"2016-10-03T05:21:21.099+0000","up_votes":1,"down_votes":0,"body":"y si .. supongamos que, no existiese info alguna? de RIOT directo no viene casi nada ..","replies":[{"poster":"martincarp","date":"2016-10-03T05:33:04.332+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FedecarboneroUY,realm=LAS,application-id=8sKIclmi,discussion-id=upaAPZlq,comment-id=0000000100000000,timestamp=2016-10-03T05:21:21.099+0000)\n>\n> y si .. supongamos que, no existiese info alguna? de RIOT directo no viene casi nada ..\n\nSi no existiera nada quiere decir que ningún jugador en todo el mundo se dio cuenta de la ventaja de unas buenas runas y maestrías, por lo que todos seríamos unos ignorantes con ensaladas de runas, haciendo que el juego siga siendo parejo. Y en el caso de que algunos gatos sueltos sepan armar runas pero no lo compartan con nadie, entonces bien por ese pequeño puñado de challengers (?","replies":[{"poster":"FedecarboneroUY","date":"2016-10-03T05:38:44.334+0000","up_votes":1,"down_votes":0,"body":"me sigue pareciendo injusto, igual es algo \"personal\", no me gustan muchos las cosas \"al azar\" :l","replies":[]}]}]}]}]}]},{"poster":"support girl uwu","date":"2016-10-03T17:44:39.564+0000","up_votes":2,"down_votes":0,"body":"Se me ocurren varias razones, \n\n1) De por si subir de nivel 1 a 20 requiere muy pocas partidas, en 2-3 dias jugando mucho se hace.\n2) Las runas son algo que notas cuando conoces bastante del juego, de 8 de ad son insignificantes para alguien nuevo, y no se va a ''apurar'' en tenerlas.\n3) Las runas afectan el early más que nada, y casi nadie hasta elo alto juega agresivo en early, casi todos intentan farmear sin pegarse.\n4) Justamente los smurfs si usan esas runas generalmente, vi varios pro players en diamante alto con runas tier 2 en otros servers. ósea, que la gente nueva no las usa por no saber que tan útiles pueden ser las runas supongo.\n5) Es algo bastante menor, pero en mi caso, MOLESTAN xD, de por si en mi cuenta principal  tengo muchas runas y si quiero armar una página rápido para una custom o un 1v1 tardo en encontrarlas, si tuviera encima  las de rango bajo (tengo 3 o 4) sería peor, y creo que no hay forma de borrar runas o hacerlas invisibles.","replies":[]},{"poster":"Sir Crucifix ","date":"2016-10-03T04:14:04.711+0000","up_votes":1,"down_votes":0,"body":"FIACA","replies":[]}]}