{"poster":"PG Dackuar ","date":"2017-01-06T13:47:47.530+0000","title":"Argentinos Y Chilenos Amiguis <3","subforum":"Off-topic y temas personales","up_votes":18,"down_votes":6,"body":"Hoy en dia el odio que se genera por ser chileno o argentino en este juego llega a tal punto de desearle la muerte a todos (literal) la xenofobia es incre&iacute;ble les cuento una an&eacute;cdota... \r\n\r\nEstaba jugando una partida tranquilamente con mi premade argentino (yo soy chileno) y mi duo estaba 1-3 en linea el jugaba top yo como estaba de adc no podia ayudarlo mucho ,entonces nuestro mid laner  se puso a flamear a mi duo insultandolo por ser argentino...\r\n\r\nEntonces en vez de responderle a su comentarios xenofobos nos pusimos a decirle cosas muy hermosas como...\r\n-Yo tambien te amo \r\n-Eres una muy buena persona\r\n-Lindo gracias por tus palabras de animo \r\n-Eres el mejor deberias jugar profesionalmente \r\n\r\nDespues de eso e fue afk (no entendi la razon) \r\n\r\nPienso que el trato que le dimos fue muy bueno sinceramente ademas ganamos la partida y el se fue baneado \r\n\r\nAmigo argentino,chileno,uruguayo te invito si llegas a recibir insultos xenofobos no mutees, solo contestale cosas lindas es lo mejor que puedes hacer contra alguien que quizas tenga 11 o 12 a&ntilde;os eso les molesta mas \r\n\r\n\r\nPOR UNA COMUNIDAD LLENA DE AMOR &lt;3","replies":[{"poster":"Cool As Me","date":"2017-01-06T15:47:57.004+0000","up_votes":6,"down_votes":0,"body":"para que? para que la persona se enoje mas? no, lo mejor es decir cosas como: no me insultes por favor, yo no te estoy insultando, en vez de flamearme ayúdame, estoy tratando de ganar, o simplemente mutear. responder con sarcasmo a una persona llena de ira solo va a provocarlo mas","replies":[{"poster":"PacificSoul","date":"2017-01-06T16:16:28.496+0000","up_votes":3,"down_votes":0,"body":"Opino exactamente igual, responder sarcasticamente solo hara que la persona estresada por la partida flamee mas, aunque haya flameado tanto a los Argentinos como a los Chilenos etc etc, se va a enojar mas ¿Y Eso que va a provocar? Va a provocar que juegue mal, que se centre en otras personas, que no se centre en la partida sino que en el chat.\n\n¡Saludos!","replies":[]},{"poster":"Benja God","date":"2017-01-06T18:23:53.459+0000","up_votes":1,"down_votes":1,"body":"No creo que pedírselo amablemente sirva más","replies":[{"poster":"Cool As Me","date":"2017-01-06T18:28:31.414+0000","up_votes":2,"down_votes":0,"body":"creeme que lo he intentado y funciona en un 60% de los casos. por ejemplo, una vez no tuve una de mis mejores partidas, pero mi team tampoco. en fin yo iba top y me estaba insultando con el mid (los dos ibamos mal), hasta que bueno, empezamos a farmear bien, sacamos un par de kills, y en una de esas lo ayudo a no morir y damos vuelta una tf 2v3. despues de eso le pongo, disculpame por insultarte, tenias razon pasa que me calente, vamos a carrear esto (o algo asi, no recuerdo bien), cosa que el chavon me pone esta bien pasa que vengo perdiendo muchas partidas, yo tambien me calente, y la dimos vuelta y ganamos increíblemente, como 1 hora de partida. yo creo que si se puede de esa manera.","replies":[{"poster":"Benja God","date":"2017-01-06T18:53:08.230+0000","up_votes":1,"down_votes":0,"body":"Pero hay se calmó porque lo ayudaste, algunos flamers ni se esfuerzan en jugar","replies":[]}]}]},{"poster":"Sutairu","date":"2017-01-07T02:03:36.829+0000","up_votes":1,"down_votes":0,"body":"+1 Por buena gente","replies":[]}]},{"poster":"DevilNeverCry","date":"2017-01-07T08:00:49.014+0000","up_votes":4,"down_votes":0,"body":"Argentinos y Chilenos amigos?\n\nSabes lo loco que suena eso?","replies":[]},{"poster":"davichost","date":"2017-01-07T00:32:15.355+0000","up_votes":3,"down_votes":0,"body":"como cuando se te escapa un po y te sacan hasta la bisabuela {{item:3151}}","replies":[{"poster":"WatonPlagio007","date":"2017-01-07T02:13:50.058+0000","up_votes":1,"down_votes":0,"body":"Inicie sesión solo para decirte que me cague de risa con tu comentario.","replies":[]}]},{"poster":"Betrayed Ahri","date":"2017-01-06T23:40:50.458+0000","up_votes":3,"down_votes":0,"body":"No se preocupen, yo los discrimino a todos por igual <3","replies":[]},{"poster":"Hell Darking","date":"2017-01-06T14:52:56.049+0000","up_votes":3,"down_votes":0,"body":"responder con sarcasmo e ironia, tambien es considerado como actitud antideportiva\nlo mejor es mutear, no te ganes unos reportes de vuelta solo por hacer la gracia de \"todos somos amiguis y nos respondemos con amor\"","replies":[]},{"poster":"Annie Botz","date":"2017-01-06T14:18:03.611+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=Choppita,realm=LAS,application-id=J8qpiO2I,discussion-id=BEpGM8eM,comment-id=,timestamp=2017-01-06T13:47:47.530+0000)\n>\n\n> -Eres el mejor deberias jugar profesionalmente \n \nSi me pusieras eso directamente te muteo, lo tomaría como sarcasmo y no te daría bola en lo que queda de partida\n\nPd: No todos las personas son tan pacientes, acabo de tener una rank después de no jugarlas por un tiempo y este fue el resultado: http://matchhistory.las.leagueoflegends.com/es/#match-details/LA2/410580609/201269384?tab=overview\nSi me preguntas no fue nada agradable, mutee a todos desde el inicio porque a mi los comentarios me dan igual después de jugar tanto lol.\n\nEse Zac no hizo nada en toda la partida y actuaba como bronce, no le puso empeño y si hubiéramos ganado no se lo hubiera merecido.","replies":[]},{"poster":"Murci3lagO","date":"2017-01-07T03:20:08.091+0000","up_votes":1,"down_votes":0,"body":"Yo no le deseo la muerte al chileno ni mucho menos , simplemente me desagrada , causa rechazó , etc.. Quizá por la historia argentina .. Obvio que no se lo hago saber apenas leo una palabra que lo identifique lo muteo y listo.. Pero son muy agresivos en el juego , hay pocos que transmitan buena onda","replies":[{"poster":"sonof666","date":"2017-01-07T13:04:14.314+0000","up_votes":2,"down_votes":0,"body":"A mi no me interesa la nacionalidad ni la historia. Ni siquiera me desagrada el hecho de que me toque con un argentino, chileno, paraguayo o con un pingüino de la Antártida. \n\nLo que sí me interesa es que RITO arregle las pu''tas redes y conexiones de internet, que da asco el lag y la pérdida de paquetes.","replies":[]}]},{"poster":"Shenyoquen","date":"2017-01-07T03:36:56.828+0000","up_votes":2,"down_votes":0,"body":"A mi los chilenos siempre me insultar por ser mujer no se que onda en chile me suena que las mujeres no pueden ni votar. Sin entrar en detalles siempre que saben que soy mujer me dicen \" a la cocina \" \" a lavar los platos \" \" ctm \" o cosas asi","replies":[{"poster":"PG Dackuar ","date":"2017-01-07T04:02:18.768+0000","up_votes":1,"down_votes":0,"body":"Ami eso me parece muy raro ya que todos mis amigos cuando se encuentran una mujer en el juego la tratan muy bien sobre todo por que es una femina xD tengo amigos que regalan skins y todo xD LOL","replies":[{"poster":"sonof666","date":"2017-01-07T13:02:20.918+0000","up_votes":1,"down_votes":0,"body":"¿Le regalan skins por el hecho de ser mujer?  Eso también podría considerarse discriminación... o unas ganas tremendas e (in)conscientes de _conquistarla_ y hacerla su novia (sin siquiera haber comprobado si de verdad es mujer).","replies":[{"poster":"Shenyoquen","date":"2017-01-07T18:03:55.831+0000","up_votes":1,"down_votes":0,"body":"La realidad es que sobra el buitreo {{champion:9}}  en este juego pero tmb los malos tratos, esta el que se piensa que te va a conquistar tirando el \" tranquila linda yo carreo \" y el que de una te dice \" uy que haces acá ? anda a la cocina \"\nPero bueno supongo que debe tener relacion con la edad de los jugadores y las necesidades humanas de cada uno XD","replies":[]}]}]}]},{"poster":"Kanan","date":"2017-01-07T02:00:17.419+0000","up_votes":2,"down_votes":0,"body":"Nose facu :v \nhttps://www.youtube.com/watch?v=LfmzBdFxg7A","replies":[{"poster":"sonof666","date":"2017-01-07T13:07:22.967+0000","up_votes":1,"down_votes":0,"body":"Cómico....","replies":[]}]},{"poster":"Ellora","date":"2017-01-07T01:14:52.024+0000","up_votes":2,"down_votes":0,"body":"Los 3 se van reportados, ni se discute. El xenofogo, y el duo toxico, lo que hacian con tu duo era provocacion.","replies":[]},{"poster":"Russells Viper","date":"2017-01-06T18:55:11.699+0000","up_votes":2,"down_votes":0,"body":"soy uruguayo y vemos todo como espectador xD","replies":[]},{"poster":"NachTderBlooD","date":"2017-01-06T16:54:05.146+0000","up_votes":2,"down_votes":0,"body":"Eso se llama ser  carbonero o cizañero, porque lo que haces es molestar de manera sarcástica instando a que el jugador se enfurezca más.\nLo mejor es no prestar atención a jugadores que flamean y dar mute, porque una cosa que he aprendido a lo largo del tiempo es que la gente encolerizada no entra en razón. \n\n{{summoner:13}}  \"A palabras necias, oídos sordos\"","replies":[]},{"poster":"Rekno","date":"2017-01-07T21:54:42.111+0000","up_votes":1,"down_votes":0,"body":"Pero en todo caso, si responderles de esa manera los hace enojar, ¿Los que les decimos cosas lindas no nos convertiríamos en flammers? Ya que eso le molesta a alguien y por ende, se va afk o trollea. No se si entienden mi postura :/\n \n{{champion:238}}","replies":[]},{"poster":"Insane Sir","date":"2017-01-07T07:14:44.784+0000","up_votes":1,"down_votes":0,"body":"ami hace banda no me insultan o no insultaron a alguien por la nacionalidad, debo ser inmune","replies":[]},{"poster":"Shiroi Tsuki","date":"2017-01-06T23:58:07.220+0000","up_votes":1,"down_votes":0,"body":"no era necesario lo de la edad yo tengo 12 ._. y si yo tmb tengo amigos chilenos y soy argentina, eso de el flameo x ser argentino,chileno y uruguayo\nsiempre me parecio una tonteria. Tambien lo q decian de q los argentinos son narigones eso es pura mentira siempre fue una forma de insultar x ser de esa nacionalidad. Para mi lo del odio es cosas de aquellas personas q insultan x ser de otra nacionalidad son cosas q ellos mismo deben cambiar.\nSolo hay q darle un empujon para q se de cuenta {{sticker:slayer-jinx-catface}} posdata: no me molesten x ser media infantil :3","replies":[{"poster":"PG Dackuar ","date":"2017-01-07T03:57:24.620+0000","up_votes":1,"down_votes":0,"body":"Lo de la edad era para dar el ejemplo solamente ;)","replies":[]}]},{"poster":"Eón Grandioz","date":"2017-01-06T21:52:42.271+0000","up_votes":1,"down_votes":0,"body":"jhbasjhsajhsahjsahjsajhas XDDD\nque grandes son¡\n{{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"Sunday Holiday","date":"2017-01-06T19:06:35.883+0000","up_votes":1,"down_votes":0,"body":"Aquí en **LAS** es tanta la xenofobia que a un amigo por ser chileno lo insulto su adc, el por /all pidio report (No pidan report por /all) a tal jugador por toxico y una jinx enemiga dijo que lo iba a reportar solo si era chileno xD.\n\nLa otra ves agregue a un chileno buena gente pero era anti-argentino lo veía y solo le tiraba mier** así que lo reporte y borre xD. \n\nEn este server cuando insultas a alguien por su nacionalidad creas 5 xenofobos **Más** listos para tirar mas mier**.","replies":[]},{"poster":"Thails SirYordle","date":"2017-01-06T18:21:32.881+0000","up_votes":1,"down_votes":0,"body":"Aj, ojala todo fuera amor y paz en el server","replies":[]},{"poster":"Kyousuke","date":"2017-01-06T17:03:02.896+0000","up_votes":1,"down_votes":0,"body":"anoche me toco una partida TOTALMENTE xenofobica, empezó por un veigar 0/3 diciendo gg a cada rato, después el blitz por all quejándose del veigar, después lo del otro team metiéndose en la conversación e insultando, después insultando a los argentinos por que dijo \"alguien tiene un diccionario chileno español?\" (perdón si a alguien le molesta o se ofende pero últimamente veo que agregaron mas modismos al repertorio y ya se hace difícil entender muchas cosas) y parecía una jodida guerra de insultos continuamente, era una partida 8 vs 2 por que el team se preocupaba mas por insultar y responder insultos que por ganar la partida, ya hartan las continuas peleas por pendejadas. si algún rioter pasa por acá me encantaría que pusieran la conversación de lo que fue esa partida para ver la razón por la cual reporte a casi todos y el nivel de xenofobia que había, incluso hablaron mal del avión que se estrello y causo la muerte de casi todo un equipo de fútbol. esta exageradamente descontrolado ya el juego con los insultos y racismo ","replies":[]},{"poster":"Mascheranox","date":"2017-01-06T16:04:48.166+0000","up_votes":1,"down_votes":0,"body":"Niños","replies":[]},{"poster":"KennyZambada","date":"2017-01-06T13:52:08.192+0000","up_votes":1,"down_votes":0,"body":"xD","replies":[{"poster":"Anivia420","date":"2017-01-06T15:03:42.644+0000","up_votes":1,"down_votes":0,"body":"tu no te mereces amor por mainear jinx <3","replies":[{"poster":"KennyZambada","date":"2017-01-06T16:01:56.418+0000","up_votes":1,"down_votes":0,"body":":'c","replies":[]}]}]},{"poster":"LyghtSh","date":"2017-01-06T15:49:03.587+0000","up_votes":1,"down_votes":0,"body":"Acabo de venir de una partida asi, habia 2 {{champion:92}} un {{champion:238}}  un {{champion:157}}  y un {{champion:64}} , curiosamente todos flemearon, a algunos les entendi, a otros no, y bueno, flam flam flam, rage rage rage, supp afk y surrender :/","replies":[]},{"poster":"Kyo Hatori","date":"2017-01-06T14:21:20.969+0000","up_votes":1,"down_votes":1,"body":"Puede ser considerado una provocación jaja. Igual mutear es muy bueno, porque cuando te insultan suele bajar mucho tu rendimiento de juego. Y lo de la xenofobia es normal, la otra vez (soy argentino) decía un compa a un pibe chileno que lo mataron una vez, \"anda pedile ayuda a los ingleses *******\" y una sarta de insultos. Me hizo gracia que estuviera resentido aún por las malvinas, cosa ridícula por varias razones la verdad.\n\nPero si, hay xenofobia, hay gente trastornada. Lo importante es ser buena onda y meterle ánimo al equipo y a los flammers ni darles bolilla.\n\nFelices Pesadillas {{sticker:slayer-jinx-catface}}","replies":[]}]}