{"poster":"TEGUSTAELPELAOL","date":"2017-08-18T00:39:37.452+0000","title":"como es posible que talon pueda saltar 2 veces en menos de 1 segundo?","subforum":"Charlas Generales","up_votes":2,"down_votes":6,"body":"la cuestion es que un talon con esta build {{item:3147}}{{item:3156}} {{item:3134}} {{item:3044}} {{item:3111}} taon tiene un enfriamiento exagerado, como es posible que talon pueda saltar 2 veces en menos de 2 o 3 segundos  y salir de cualquier batalla como si nada y lo mas raro es que no se le ve items como estos {{item:3158}} {{item:3071}} , este item {{item:3147}}  le da 10% nada mas, asi que como es posible que talon pueda saltar cada 2 o 3 segundos 2 veces? riot sigue sacando personajes tan rotos que ya llega a ser molesto jugar lol y tratar de matar a un solo personaje es casi imposible o cuesta muchisimo ya matar a 1 solo personaje pr el exceso de movilidad que les estan dando a los personajes, ya esta aburriendo tratar de matar a personajes tan moviles que avaden casi cualquier skillshot o habilidad de nivel 6{{sticker:zombie-brand-facepalm}}  da ascoo estos personajes rotos y su movilidad exagerada.","replies":[{"poster":"OnLy Yohhh","date":"2017-08-18T01:43:34.485+0000","up_votes":2,"down_votes":0,"body":"porque tiene que practicar para saltar el muro de trump","replies":[]},{"poster":"PBE","date":"2017-08-18T00:42:41.509+0000","up_votes":2,"down_votes":0,"body":"si pero no puede saltar el mismo muro.","replies":[]},{"poster":"Kyousuke","date":"2017-08-18T01:55:33.659+0000","up_votes":1,"down_votes":0,"body":"jugalo y fíjate la desventaja que tiene eso :D los muros tienen un LAAAARGOOO enfriamiento asi que si lo salta una vez tiene que esperar mucho tiempo para volver a saltar el mismo muro, en si la habilidad creo que tiene 2 segundos el tema es que posee enfriamiento interno y no tiene movilidad libre :P necesita si o si de un muro o de un objetivo para usar la Q, movilidad son los dash LIBRES para donde se quiera ejemplo {{champion:245}} {{champion:104}} {{champion:79}} {{champion:121}}","replies":[]},{"poster":"Turing Test","date":"2017-08-18T00:43:07.238+0000","up_votes":1,"down_votes":1,"body":"Bueno, no soy de opinar que estas cosas están muy desbalanceadas ni nada por el estilo pero, Riot tiene una predilección por Talon que no entiendo. A lo mejor Tryndamere lo usa mucho","replies":[]}]}