{"poster":"Pyro","date":"2016-10-17T02:04:05.473+0000","title":"Seriously, can we stop pretending Marksmen NEED Hurricane?","subforum":"Gameplay","up_votes":79,"down_votes":37,"body":"I see so many people say that Hurricane is 100% necessary for their beloved ADCs to succeed.\r\n\r\nNewsflash!:\r\nTheir kits were designed to work on their own.\r\n\r\nCaitlyn&#039;s job is NOT to waveclear from afar like a boss and charge Headshots like crazy.\r\nShe&#039;s supposed to be the long-range single target sniper.\r\nThat&#039;s what she&#039;s supposed to be, no Hurricane needed, just enough damage to do so!\r\n\r\nJinx&#039;s job is to just reign supreme in Teamfights with strong AoE attacks\r\nShe has a huge AoE damage from her rockets alone, she doesn&#039;t need Hurricane for that.\r\n\r\nAshe&#039;s job is NOT to slow you with repeated autoattack spams that hit both her main targets and you.\r\nShe&#039;s about sniping you from afar, stunning you and killing you with the help of her team\r\n\r\nTwitch&#039;s job is NOT to attack everyone adjacent to his target, just behind them.\r\n\r\nThe pattern is clear;\r\nHurricane provides an ADDED bonus to these champion&#039;s kit, not something that&#039;s 100% necessary.\r\nIn fact I&#039;d argue that the extra attacks is excessive power and being abused just because the item offers a ton of AS and crit:\r\n\r\nSeriously, anyone who thinks it should be a core part of a Marksman&#039;s build is either:\r\nA) High\r\nB) Dumb as heck\r\nC) A masochist\r\nor, most likely\r\nD) An ADC Main\r\n\r\n----\r\n\r\nYes, Rylai&#039;s needs a nerf. Yes, it&#039;s being used on too many mages (Syndra is definitely an abuse case, Viktor might be as well).\r\n\r\nBut Brand has always been balanced around using that item and it&#039;s silly to pretend otherwise.","replies":[{"poster":"The Deckowner","date":"2016-10-17T02:09:07.047+0000","up_votes":38,"down_votes":4,"body":"I honestly think hurricane and caitlyn headshot interaction is really toxic and should be changed.","replies":[{"poster":"Pyro","date":"2016-10-17T02:13:27.397+0000","up_votes":32,"down_votes":7,"body":"This is mostly a shitpost meant to combat the anti-Rylai's circlejerk, but it doesn't mean there isn't a grain of truth in it ;)","replies":[{"poster":"PermabannedGaren","date":"2016-10-17T04:17:15.273+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Pyro,realm=EUNE,application-id=3ErqAdtq,discussion-id=zgfG0uMt,comment-id=00000000,timestamp=2016-10-17T02:13:27.397+0000)\n>\n> This is mostly a shitpost meant to combat the anti-Rylai&#x27;s circlejerk, but it doesn&#x27;t mean there isn&#x27;t a grain of truth in it ;)\n\nWhy direct it at ADCs then?\n\nADC players don't give a shit about Rylai's. They're ranged.","replies":[{"poster":"AnCa","date":"2016-10-17T07:21:16.786+0000","up_votes":7,"down_votes":0,"body":"Well I think the point the guy is trying to make is, even if an item is used by majority of the champion from the same class, it doesn't mean everyone has to circlejerk/QQ about it. And in some case it is nessasary and the result of how players learn to max and min to the meta.\n\nAnd drawing the comparision between Rylai-Mage and Hurricane-ADC is pretty logical in this case. I don't think he/she is trying to direct it to any specific role/class of champions.","replies":[]},{"poster":"ReZisT Lust","date":"2016-10-17T05:40:44.507+0000","up_votes":5,"down_votes":1,"body":"ii always use rylais on my adcs so theyre spells can slow too as well as a ludens echo for the added aoe dmg {{sticker:slayer-pantheon-popcorn}}","replies":[]}]}]}]},{"poster":"Marshbouy","date":"2016-10-17T02:18:55.649+0000","up_votes":4,"down_votes":5,"body":">Yes, Rylai's needs a nerf. Yes, it's being used on too many mages (Syndra is definitely an abuse case, Viktor might be as well).\n\nBut Brand has always been balanced around using that item and it's silly to pretend otherwise.\n\n?","replies":[{"poster":"Meep Man","date":"2016-10-17T02:19:55.724+0000","up_votes":19,"down_votes":0,"body":"This is a parody of another thread","replies":[{"poster":"Marshbouy","date":"2016-10-17T02:25:17.119+0000","up_votes":3,"down_votes":3,"body":"oh it's a parody? i thought it was the OP doing a shitty copy paste xD","replies":[{"poster":"YCitizenSnipsY","date":"2016-10-17T04:27:35.929+0000","up_votes":7,"down_votes":2,"body":"It is also a shitty copy pasta.","replies":[{"poster":"Pyro","date":"2016-10-17T09:38:51.230+0000","up_votes":5,"down_votes":1,"body":"It's a shitpost through and through.","replies":[]},{"poster":"Killstrado","date":"2016-10-17T19:57:48.465+0000","up_votes":1,"down_votes":0,"body":"Man I hate copy pasta, just give me the original spaghetti","replies":[]}]}]}]}]},{"poster":"The Whamboozler","date":"2016-10-17T05:52:09.027+0000","up_votes":13,"down_votes":0,"body":"Do you remember when Hurricane was a god-awful noob trap?\n\nPepperidge farm remembers.","replies":[{"poster":"MunchCrunchLunch","date":"2016-10-17T08:37:20.085+0000","up_votes":8,"down_votes":5,"body":"no i remember when it was meant for on hit champions and not adcs.","replies":[{"poster":"The Whamboozler","date":"2016-10-17T09:18:08.396+0000","up_votes":6,"down_votes":0,"body":"It wasn't even great on most of them back when it first was added, to be fair.","replies":[]}]},{"poster":"Ariel the Cruel","date":"2016-10-17T07:28:27.041+0000","up_votes":1,"down_votes":0,"body":"{{champion:17}} {{champion:110}} {{champion:429}}","replies":[{"poster":"The Whamboozler","date":"2016-10-17T09:17:45.749+0000","up_votes":3,"down_votes":0,"body":"I've heard there was a time BEFORE Kalista... back in the ancient days of yore.... and back then in the far, far past... Hurricane was kinda shit on everyone.  It was a noob trap picked up by bronzies who didn't know any better.  It didn't used to have on-hit damage attached to it OR crit.  It was just.. garbage.\n\nThose were strange times.","replies":[{"poster":"Ariel the Cruel","date":"2016-10-17T22:14:48.472+0000","up_votes":1,"down_votes":0,"body":"Hurricane has always applied on-hit effects and used to have a higher AD ratio. It was considered a noob trap because it didn't provide any damage - effectivly making is useless before 5th/6th item. And by then, most champions had enough AS that Runaan's 70% would be partially wasted making the item very stat inefficient.\n\nThe exception being champions that apply on-hit effects (Varus blight, Teemo poison, Kayle defense shred, Kalista Rend stacks, Twitch toxin). Even then, it was never a rush item.","replies":[{"poster":"Venedictos","date":"2016-10-18T08:39:58.691+0000","up_votes":1,"down_votes":0,"body":"Runaan's bolts also didn't crit at the time and their range didn't work with the user's range. See how it works with Twitch R now. Splendid!","replies":[]}]}]},{"poster":"AirKingNeo","date":"2016-10-17T21:48:10.489+0000","up_votes":1,"down_votes":0,"body":"{{champion:10}}","replies":[]}]},{"poster":"AirKingNeo","date":"2016-10-17T21:47:42.458+0000","up_votes":1,"down_votes":0,"body":"{{champion:10}} \n\n70% AS back in the days of ol' Sated Kayle was the dream.","replies":[]},{"poster":"Vistha Kai","date":"2016-10-17T19:37:47.548+0000","up_votes":1,"down_votes":0,"body":"It was actually a decent item for Jinx.","replies":[{"poster":"The Whamboozler","date":"2016-10-17T19:44:11.162+0000","up_votes":1,"down_votes":0,"body":"It was okay... but it wasn't a rush item like it is now on some adcs.","replies":[]}]}]},{"poster":"Jad","date":"2016-10-17T05:15:41.992+0000","up_votes":10,"down_votes":1,"body":"As an ADC Main I can confirm, its pretty stupid.","replies":[]},{"poster":"DrCyanide","date":"2016-10-17T02:23:00.560+0000","up_votes":12,"down_votes":3,"body":"I love how some people are pretending that the Mage Update didn't specifically change some abilities (like {{champion:112}} 's E and Ult, {{champion:101}} 's Ult) in a way that made them far more inclined to want Rylai's to land their damage.","replies":[{"poster":"Venedictos","date":"2016-10-18T08:41:53.568+0000","up_votes":1,"down_votes":0,"body":"Even if Rylai's didn't exist before, Viktor would have received those changes anyway. It wasn't fair for a Battle Mage to be able to insta-burst you like that.","replies":[]}]},{"poster":"KoKoboto","date":"2016-10-17T04:40:47.905+0000","up_votes":6,"down_votes":9,"body":"Hurricane isn't as overbearing as Rylai's. On paper is sounds god damn OP, but in game not so much.\nIf the enemy gets Hurricane I'm usually like \"well guess they have more waveclear\"\nIf the enemy gets Rylai's I'm usually like \"damn I gotta account for all the extra slow I'm gonna be having to deal with, also that bonus health and more damage\"\nIf Frozen Mallet was a more viable item for marksmen I'd be a bit upset about it as well but Frozen Mallet is to some extent balanced.","replies":[{"poster":"THE RlVER KlNG","date":"2016-10-17T11:20:29.324+0000","up_votes":7,"down_votes":0,"body":"If Rylais has a slow with health and AP, then Hurricane has AoE autos with attack speed, crit, and movement speed. You make it sound as if Hurricane gives zero stats","replies":[]}]},{"poster":"junglerboy16","date":"2016-10-17T04:40:17.931+0000","up_votes":6,"down_votes":0,"body":"I preferred when Runaan's was a niche item for wave clear and on-hit champs, not a go-to crit item","replies":[]},{"poster":"Steelflame","date":"2016-10-17T06:40:32.499+0000","up_votes":4,"down_votes":0,"body":"I much prefer the version of Hurricane that had 0 crit, but 70% AS.  Far less effective on ADCs who want later crit, as rushing it means they can't follow up with IE effectively, and it means if they want Frevor + Hurricane + Crit they have to give SOMETHING up, most likely their mid game as they get a second AS item in Zeal before being able to get IE (And it be gold effective, as IE is not gold effective without at least one other crit item).\n\nIt also is better for actual on hit champs, who want more frequent attacks without caring about the crit anyway usually.\n\n\nBoom, Hurricane is back to being what it SHOULD be, a Niche item to give you a ton of AoE power as an ADC.\n\n\n\n\n\nAlso yes, this is a shitpost thread about Rylias, but it's a valid case to for Hurricane which is it's own problem (Cait, looking at you with Hurricane traps).  Def one of my less liked parts of the rework for ADC items.","replies":[]},{"poster":"CrazedPorcupine","date":"2016-10-17T06:21:33.590+0000","up_votes":1,"down_votes":0,"body":"Before Hurricane got it's stats reworked to include crit and MS, not a SINGLE ADC bought it outside of \"LOL\" joke builds because all it offered was the AoE.\n\nEveryone Knew it enhanced Cait's headshot stacks, Jinx's AoE rockets, and Ashe's Q, but no one bought it because it didn't offer stats that were desirable since it only offered AS.","replies":[{"poster":"Lohenngramm","date":"2016-10-17T06:30:23.174+0000","up_votes":4,"down_votes":0,"body":"Before the rework it was a core item on AS reliant ADCs like Kalista and Twitch who were less focused on critical strike chance.","replies":[{"poster":"CrazedPorcupine","date":"2016-10-17T07:21:51.447+0000","up_votes":1,"down_votes":4,"body":"Even then they generally bought Shiv or Phantom Dancer because it was better for them.","replies":[{"poster":"Sidestep","date":"2016-10-17T12:03:43.728+0000","up_votes":3,"down_votes":0,"body":"No they didn't? What part of \"core\" item did you not get. Runaans was/still is a core item for twitch and Kalista. \nThe only time kalista didn't go runaans is for the Korean crit build.","replies":[{"poster":"Droogzy","date":"2016-10-17T13:03:47.044+0000","up_votes":2,"down_votes":0,"body":"For Kalista, it used to be core, for Twitch, it was really down to the player. I've seen everything from Ghostblade to Bork and Runaan's as being twitch's core item in the past couple season.","replies":[]}]}]}]}]},{"poster":"Kog And Balls","date":"2016-10-17T03:15:38.808+0000","up_votes":4,"down_votes":0,"body":"Of the zeal items Hurricane is definitely in a class of its own. It boasts high Attack speed and move speed as well as a unique passive with some extreme interactions Headshot being one of them. I hope the item can be brought into line with the other zeal options or have RFC and Shiv become more lucrative to carries who frequently opt for Hurricane.","replies":[]},{"poster":"Spoofghoul","date":"2016-10-17T10:14:55.592+0000","up_votes":5,"down_votes":1,"body":"Hurricane should have remained a pure attack speed item.\n\nThe crit and movement boost suck, now its almost mandatory on every adc.\n\nIt amplifies everything from inherent kit things like aoe rockets and headshots toblack cleaver shredding and lifesteal.\nThats a big enough feature as it is, adding crit to the item was a huge mistake, as is adding mobility to all these marksmen items","replies":[]},{"poster":"Irelia Bot","date":"2016-10-17T04:21:53.674+0000","up_votes":5,"down_votes":1,"body":"Delete Hurricane and Rylai's\n\nI am fine with this idea.","replies":[]},{"poster":"Finn Teh Human","date":"2016-10-17T04:15:51.122+0000","up_votes":3,"down_votes":0,"body":"As an ADC main I think it's a really good item considering what it offers. But no, you don't need it. Although it brings to the table many different things depending on the ADC (like some have mentioned Caitlyn).","replies":[]},{"poster":"Best Darius KR","date":"2016-10-17T19:53:41.653+0000","up_votes":2,"down_votes":0,"body":"Quality copy-paste.","replies":[]},{"poster":"Nyanza","date":"2016-10-17T05:51:48.229+0000","up_votes":2,"down_votes":0,"body":"To be fair, {{champion:29}} used to build {{item:3077}}  and then he would attack everyone adjacent to his target.","replies":[]},{"poster":"higura","date":"2016-10-17T08:28:46.595+0000","up_votes":2,"down_votes":1,"body":"Seriously, can we stop pretending players NEED champions?\n\nlets just delete everything and turn league into the worlds biggest online 10 man pong game!.\n\n---------------------------------------------------------------------------------\n\nno more balance issues!\n\nbuy new skins to customize your very own  _ !\n\npotato computer and toaster router? no problem!, can run it at a perfect 60 fps! \n\ntired of trolls ruining your game/Promo so you cant climb ladder or give it your all?, poof problem sovled! \n\nno more flamers/toxic behaviors because theres no chat!\n\nno more {{champion:17}}!\n\nrated 20/10 \"best gayme evar!\" by IGN!\n\n----------------------------------------------------------------------------------\n\nnow, i know what your anal devastated self is thinking:\n\n\"but it cant solve all the problems!\" and sadly, your right.\n\ntheres no colorblind option because that would ruin the skins...","replies":[]},{"poster":"Poske","date":"2016-10-17T12:31:20.009+0000","up_votes":1,"down_votes":6,"body":"So would you rather have hurricane as trash tier item which it was for 5 OTHER FKing seasons\n\nAnd I always felt crippled as a {{champion:29}}  back when hurricane was trash tier item \n\nHurricane is at FKING great spot atm no reason to change that \n\n\n\nRylai is OP. The fact that the item is viable on syndra just means its OP\nHaving said that I never buy it on her because whats the point of your abilities slowing when 1 already does and the other stunns -.- \n\nPeople buy rylai on her mostly for 100 ap and 400 hp","replies":[{"poster":"KING 5HARK","date":"2016-10-17T15:30:02.138+0000","up_votes":2,"down_votes":1,"body":"> 5 OTHER FKing \n\nIt was introduced around season 3-4\n\n> Hurricane is at FKING great spot atm no reason to change that\n\nExcept that Shiv is a shit item because Hurrican does everything better\n\nAlso the interaction with Jinx Rockets, Headshots and Twitch ult is just stupid\n\n> People buy rylai on her mostly for 100 ap and 400 hp\n\nNo, they would buy RoA for that\n\n> The fact that the item is viable on syndra just means its OP\n\nGuess Dcap, Void Staff and Morellos are OP aswell","replies":[{"poster":"Poske","date":"2016-10-17T15:54:35.117+0000","up_votes":1,"down_votes":0,"body":"Hurricane became viable in Marksman UPDATE. and When was the marksman update? \n\n\nExcept that shiv is not a shit item. For example Vayne always goes shiv  because she needs waveclear\nShiv is definetly core on her.. \n\nNo they wouldnt buy roa because of that Because roa is delayed item (Take this in whatever way you want because its delayed in every way xd). People only buy that on ryze/anivia/swain/xerath\n\n\nVoidstaff Is the strongest Ap item in the game curently. Dcap is OP but nowhere near as Op as it used to be bassicly its buld path is a bit wierd. Just the fact that you see this at every champ means alot\n\n\nMorello is fine we just need alternative. We lost athene (Unless you are ori I guess and not even all Ori players buy that)\n\n\nI AM glad i can finally build hurricane on twitch cait etc\n\nWtf mate do you want the item removed?\n\nThere are like 6 champions which use it sounds balanced to me","replies":[{"poster":"KING 5HARK","date":"2016-10-24T20:05:34.644+0000","up_votes":1,"down_votes":0,"body":"Okay:\na) DCAP is not OP, seriously stop throwing around buzzwords...\nb) Vayne is literally the ONLY champ that would build Shiv over RFC or Hurricane\nc) No champ buys Rylais for the 100 AP and HP, thats bullshit and if you don't know that, well, whatever. Rylais is built for the slow.\nd) Voidstaff isnt OP either\ne) Hurricane being introduced in season 3 and reworked in season 6 doesnt make it trash for 5 seasons. Learn either fucking basic math or don't say stuff like that at all\nf) DCap isnt built on every Champ, not even on every AP champ, not even on every Mage(By that I mean games that dont go to 6 items, there are a ton of champs that dont want a Dcap before lategame","replies":[]}]}]}]},{"poster":"Arthimetes","date":"2016-10-18T05:45:25.911+0000","up_votes":1,"down_votes":0,"body":"Alot of mages have been balanced around rylais being a core/rush item now, but if rylais gets nerfed and isnt built every single game by every single mage, it will finally open the mages up to some buffs or changes\n\nMaybe Brand can get his Q stun back to 2 seconds, or maybe Cassio can have her passive movespeed buffed.\n\nA class being balanced AROUND an item proves that that item needs changed.","replies":[]},{"poster":"DREADN0UGHT","date":"2016-10-18T05:37:06.907+0000","up_votes":1,"down_votes":0,"body":"Its not that they NEED it, its just that its so fucking broken right now it would be dumb not to build it.","replies":[]},{"poster":"underscores222","date":"2016-10-18T05:34:42.887+0000","up_votes":1,"down_votes":0,"body":"The issue with the item is that it works too well with what ADCs want to do.  Back when it just gave attack speed and no crit, it was only built on about three ADCs - twitch, varus and kalista.  Each of these wants to stack stuff on as many people as possible, which requires attacking as fast as possible.\n\nNow it has attack speed (which everyone loves), crit (which fits into 90% of ADC builds) and lets them deal damage to multiple targets (bonus) \n\nAttack speed alone (old version) made it inefficient compared to the attack speed/crit items like Phantom dancer or attack speed/damage items (blade of the ruined king). \n\nA \"traditional\" ADC build of IE, lifesteal, and a zeal item benefits less from more attack speed than more crit (assuming you aren't already at 100% crit).  However, the ability to get both, and a snazzy passive that lets you deal even more damage (and also crits) is the reason hurricane has become so popular.","replies":[]},{"poster":"LuunaLily","date":"2016-10-18T02:14:01.217+0000","up_votes":1,"down_votes":0,"body":"People complain about the tiniest bits of synergy with champion's kits. It gets a little out of hand sometimes... \n{{champion:22}}'s synergy with it is great and makes her actually useful for once. \nIt helps {{champion:29}} apply his passive in teamfights. \nIt helps {{champion:222}} the aoe monster she's supposed to be late game. I think people forget that there aare adc's that don't like hurricane, their just not as meta right now... \nThough... Regarding {{champion:51}}, I think we can admit that her passive is kind of a toxic play pattern in the first place.\nAlso {{champion:203}} loves hurricane because it applies their passive a lot. So please don't shoot an already crippled jungler in the kneecaps.\n{{sticker:slayer-jinx-unamused}}","replies":[]},{"poster":"bill84","date":"2016-10-18T02:01:02.230+0000","up_votes":1,"down_votes":0,"body":"It's actually kind of funny to go {{champion:15}} {{item:3085}} because it just makes it so that there are blades everywhere.","replies":[]}]}