{"poster":"Pyro","date":"2015-05-03T12:17:30.833+0000","title":"\"Strategic Diversity\" items like Ohmwrecker are still just as useless as expected","subforum":"Gameplay","up_votes":108,"down_votes":12,"body":"Here are all the least used items that appear in less than 1% of games. Source: datamining sites such as LoLKing and LoLDB; percentage according to ranked soloq on Apr 30th. Items added or reworked in season 5 are in bold.\n\n1. {{item:3124}} Guinsoo&#039;s Rageblade (0.05%)\n1. {{item:3056}} **Ohmwrecker** (0.08%)\n1. {{item:3050}} Zeke&#039;s Herald (0.17%)\n1. {{item:3141}} **Sword of the Occult** (0.19%)\n1. {{item:3060}} **Banner of Command** (0.20%)\n1. {{item:3711}} **Poacher&#039;s Knife** (counting enchantments) (0.33%)\n1. {{item:3512}} **Zz&#039;Rot Portal** (0.48%)\n1. {{item:3023}} Twin Shadows (0.44%)\n1. {{item:3504}} Ardent Censer (0.55%)\n1. {{item:3091}} Wit&#039;s End (0.58%)\n1. {{item:3172}} Zephyr (0.61%)\n1. {{item:3508}} Essence Reaver (0.79%)\n\nThat&#039;s right. Ohmwrecker is the second least popular item in the game, and Zz&#039;Rot Portal is behind the godawful Poacher&#039;s Knife. Why is that?\n\nWell, I think it&#039;s a sum of defects of particular items themselves, and the fact that **their existence changes nothing about how the game is played** or what champions are picked. Nobody is going to pick their champion with Ohmwrecker or Zz&#039;Rot Portal in mind. These items, even if not meant to be rushed, are simply underwhelming and unimpactful.\n\n#I. Raptor's Cloak is a bad laning item\n\n{{item:2053}} Raptor&#039;s Cloak costs **1000 gold** and grants **40 armor** and **+100% base health regeneration**. These stats are worth 1160 gold. However, at level 6, most toplane champions have 10-12 base health regeneration, so it takes 2 minutes for the +% regen to equate a single health potion. If you want to understand how bad health regen currently is, ask yourself a question: **when was the last time you saw a pro player have a Rejuvenation Bead in their inventory?** Food for thought.\n\nThis, of course, is not taking into account the unique passive, which builds up movement speed under turrets, but even disregarding what this item builds into, it&#039;s just bad when compared to other armor/regen items in this price range. Ninja Tabi, Glacial Shroud, Warden&#039;s Mail, Catalyst the Protector - they all do something tangible and useful, and the items they build into are worth rushing.\n\nPast laning phase the passive becomes even less useful, as many fights occur around Dragon and Baron. Therefore, I believe the following needs to happen:\n\n* Raptor Cloak needs a discount to 900 gold, and/or\n* Its upgrades need to be attractive enough to be worth rushing.\n\nhttp://i.imgur.com/gt7w5f9.png\n\nBasically the problem here lies with the whole Point Runner family - it&#039;s not good in lane, it&#039;s not even that good later on.\n\n#II. Ohmwrecker is inferior to similar items\n| Item | Armor | Health | CDR | Passive | Active | Cost | Raw Stat Value\n|-|-|-|-|-|-|-\n| {{item:3056}} Ohmwrecker | 50 | 300 | 10% | Point Runner | Turret disable | 2600g | 2117g (81%)\n| {{item:3068}} Sunfire Cape | 45 | 450 | - | Immolate | - | 2600g | 2100 (80%)\n| {{item:3143}} Randuin&#039;s Omen | 70 | 500 | - | Cold Steel | AoE Slow | 2850g | 2730g (96%)\n\nFor an item that *might* be useful in one specific situation, the unique effect of Ohmwrecker is too expensive. Alternative armor+health items not only have a higher health threshhold, but their unique effects are way more powerful not only in open fights. And frankly, under towers as well. In the current state, Ohmwrecker could even disable base gates and it would still be useless.\n\nWhat could possibly fix Ohmwrecker is:\n\n* Stat efficiency (lower price, more health or more CDR)\n* Active lasting longer (4-5 seconds?)\n* Active stealing armor from tower and granting it to the user, and/or\n* Active making an allied tower immune to damage (like the good old Fortify summoner spell).\n\nBefore any of these changes happen, the item will remain as useless as it is now - the current state is \"why invest into this item, when you can just armor up and tank the damn turret\". I don&#039;t even think any stat buff could make it worthwhile - it&#039;s the active that needs to change for the item to be worth its slot.\n\n#III. Zz&#039;Rot Portal lacks purpose\nZz&#039;Rot Portal is set at the very same price as Guardian Angel (2800g) with the same batch of stats (10 more armor, 10 more MR), while granting a much less powerful effect than the extra life. I would attribute its low popularity to another problem - it&#039;s supposed to help tanks push lanes, but full tanks are not supposed to splitpush, and this item changes nothing about that. The usual splitpushers are capable of dueling any enemy coming their way. Tanks can survive a 1v1 assault - but they can&#039;t kill the assailant and stop him from clearing the waves.\n\nThe idea that tanks could get an option of setting up a remote push is neat, but in practise it&#039;s a \"win more\" item. You can&#039;t get a tower with it unless you were already in a situation where regular siegeing mechanism would work.\n\nThere are two simple solutions that I would consider here:\n\n* Lower the price to 2500-2600g, or\n* Remove the health loss after 4 seconds on Voidspawn, and make it a damage loss instead. This would allow to use this item to splitpush more reliably, similar to Banner of Command, without making it too abusive.\n* Alternatively: Make Voidspawn immune to towers. In that case, the Void Gate would always be pushing, and require immediate attention from the enemy team, regardless of the lane state. This would make Zz&#039;Rot Portal a unique tool allowing to turn enemy attention towards their tower.\n\n#IV. Banner of Command is actually okay\n\nIt&#039;s not perfect, but it&#039;s in an acceptable spot. It has a very clearly defined niche and helps in a very commonly found situation in competitive play, which is siegeing inhibitor turrets, especially with baron buff. The low popularity of this item is caused by Locket of the Iron Solari being that much better and versatile. Generally if you get to the siegeing situation, you&#039;re in a better spot already, and Locket gives you an edge in even fights.\n\nIf any changes were to happen to this item, I&#039;d consider:\n\n* Bringing back the pet buff (Zyra, Elise, Heimerdinger), and/or\n* Allowing the item to be used on pets (Annie, Malzahar)\n\nThe current purpose - protecting the siege minions with Baron buff - is working well. Expanding the item&#039;s scope might be a good idea, though.\n\n#V. Sword of the Occult is unfixable\n\nStacking items aren&#039;t as much about getting kills as about not dieing (this is why Leviathan was skewed). Top users of Mejai&#039;s Soulstealer are Janna and Lux, who can play very safely and get out alive from fights while racking up tons of assists from their utility spells.\n\nSword of the Occult is one of the least used items for a few reasons: its users are the AD assassins/casters (Rengar, Talon and Riven) who can be focused and shut down in teamfights, and the buff on 20 stacks is a bit underwhelming (+20% attack speed, compared to +15% CDR on Soulstealer). Gold value of both effects is comparable, but AS is not a stat that bursty AD casters are looking for.\n\nShould anything be done about this item? I don&#039;t think so. At least it shouldn&#039;t have any sort of priority.\n\n#VI. Poacher&#039;s Knife (lol)\n\nClearly neither Riot nor the playerbase have any idea what to do with the item. At this point, the question would be *why* shall we try to make it work instead of outright removing it, and only then can we think of any possible solutions.\n\n#VII. Other underused items\n\nNotes on what sort of category are the anti-tower items in. Delving too much into these would derail the thread.\n\n{{item:3124}} **Guinsoo&#039;s Rageblade** is garbage and could be straight out deleted or remade from scratch. It could work if all abilities in LoL scaled with ability power. AD scalings on fighters is what made this item obsolete.\nOne niche that would work currently, instead of AD+AP, would be hybrid armor/magic penetration for champions like Ezreal, Jax and Shyvana.\n\n{{item:3050}} **Zeke&#039;s Herald** is very gold efficient on AD-heavy teams, but feels very unrewarding for supports. You&#039;re essentially wasting gold on stats you don&#039;t want in order to grant them to your teammates. And given the CDR overload (you&#039;re not getting full value off 20% CDR from that item), the amount of gold \"wasted\" is nearing 2000.\nPerhaps this item could function with an Aegis-like 1800g component without CDR, building out of Vampiric Scepter + Crystalline Bracer. Component would have only lifesteal in aura, finished Zeke&#039;s could be an activable item, granting AD in a more conditional situation. Overall if the item could become attractive for AD bruisers, it could actually become satisfying. Until then, it's a decent piece of martyrdom: sacrifice 2500 of your gold to give 900 of it to the carry.\n\n{{item:3504}} **Ardent Censer** is overshadowed by Mikael&#039;s Crucible. Mikaels is the best support item, and after you get it, CDR and mana regen from Censer feel superfluous, and you have better items to aim for.\nThe only solution here is either an AP buff to 60, or a nerf to Mikael&#039;s Crucible. Otherwise these two items are competeing in a very similar niche.\n\n{{item:3023}} **Twin Shadows** are inferior to Morellonomicon in the middle lane and a very luxury item for supports.\nPerhaps giving it 20% CDR, or more MS, or making the ghosts reveal stealthed champions would put it in a right place. Until then, Twins will remain unsatisfying and inferior to the usual CDR items.\n\n{{item:3172}} **Zephyr** is alright as a boots replacement for AD champions, but its components do not grant the stats that people buy it for (MS and Tenacity).\nTweaking Stinger or replacing it with Zeal could be one way to go.\n\n{{item:3091}} **Wit&#039;s End** is overshadowed by other, similar items: Devourer and BotRK are better as one-item wonders, and Hexdrinker/Malmortius feel like a better DPS-MR item.\nAs a \"rushable\" item, it deserves a mid-tier MR component. Building from Hexdrinker or QSS (or a new Dagger + Null-Magic Mantle item with MR shred or MR buildup) would make it quite strong and perhaps open up some new interesting builds.\n\n{{item:3508}} **Essence Reaver** is just \"meh\". By the time it&#039;s assembled, you have mana from Triforce, Tear or Muramana.\nBuilding from The Brutalizer would make it better, but potentially abusive on Pantheon, so it&#039;s probably doomed to be bad. One way to balance it could be changing the mana restoration passive to work on kills/assists (like Athene&#039;s).\n\n#VIII. The One Item That Could\n\n{{item:3800}} Righteous Glory sits at a decent pick rate and is even seen in competitve games. Against preseason predictions, though, which prophesized the return of toplane Olaf, it&#039;s mostly a support/tank item, temporarily overshadowed by the Cinderhulk builds.\n\n#|X. What Has Changed\n\nThis is the second time I post this. After the first thread back in February, Riot has buffed Raptor's Cloak (40 armor, up from 30) and Zz'Rot Portal (60 armor and MR, up from 50). This, however, changed nothing about the least used item in the game, Ohmwrecker, and even with the stat buff Zz'Rot Portal is not a viable item. I believe this proves it's the active effects that need attention.\n\n---\n\n#X. Summary\n\nIn the world of skillshots and mobility, strategy becomes a secondary subject in general, and forget about having a diversity in strategical approaches to the game. Season 5 was meant to provide tools to execute various strategies, but these tools are so rarely used it&#039;s hard to say if they&#039;re fullfilling their purpose at all.\n\nPersonally my biggest problem with lack of strategical diversity is how every single team has to have a ranged AD Carry, and it&#039;s impossible to have a melee one instead. Every other class - mage, assassin, tank, fighter, support - can be left out, but ranged ADCs are irreplaceable. To a lesser extent, similar problems emerge in competitve play in all roles, which leads to every lane having a very limited set of \"top picks\" since it&#039;s much more about individual champion performance than their interactions with teammates. Even when a crazy \"meta shift\" appears - such as the current Smite Teleport toplane - it only changes the top performers in a predefined role, instead of presenting an alternative metagame.\n\nBack to the track, though - Ohmwrecker and Zz&#039;Rot Portal are extremely underused and that might be a call to shake things up.","replies":[{"poster":"Buttigieg 2020","date":"2015-05-03T12:51:19.084+0000","up_votes":19,"down_votes":0,"body":"{{item:3800}} is fine. It was just nerfed and it is still a top tier item. Wits end and banner of command are also pretty good. Guinsoos is close to being good but it needs to have a niche that is not \"to buy this item x champ needs to utilize ap, ad, lifesteal, spellvamp, attack speed, and also have high sustained damage to utilize the stacks.\"","replies":[{"poster":"Champion Skin","date":"2015-05-03T21:08:18.278+0000","up_votes":4,"down_votes":0,"body":"I think what Guinsoo might need is some sort of MS.. or sticking power which {{item:3078}} and {{item:3153}}  and even {{item:3146}}  gives\nIt gives good DPS/combat stats but no real way to stick to your target\n\nAnd well if you build it later on after items who help you stick to targets... well it is too late as it is an item which is pretty good when it comes to being gold efficient but it isn't that great when it comes to being slot efficient","replies":[]},{"poster":"planters","date":"2015-05-04T01:03:34.276+0000","up_votes":2,"down_votes":0,"body":"Honestly the fastest way to fix rageblade is just to turn its secondary active into an activatable like ghostblade.  If that happened, even if the duration was only for 6 seconds, it would have a lot of value in purchase as a mid-game spike item similar to ghostblade.","replies":[]},{"poster":"Pyro","date":"2015-05-03T13:38:20.590+0000","up_votes":2,"down_votes":1,"body":"That's what I'm saying. RG is fine and I've argued about the need for it over a year ago when Shurelya's Reverie was remade into Talisman and limited for supports (Shurelya was occasionally used by toplaners and junglers in S3). As for Rageblade, it theoretically should be useful on the likes of Jax, but it's just too unreliable.\n\nThis thread is about Ohmwrecker and Zz'Rot Portal. They just got introduced this season and they don't change the game in any way. \"Strategical Diversity\" was not achieved.","replies":[]},{"poster":"NazZomLord","date":"2015-05-05T03:17:27.656+0000","up_votes":1,"down_votes":0,"body":"Rageblade and hybrid TF works wonders for me","replies":[]}]},{"poster":"Critmaster Garen","date":"2015-05-03T13:15:49.764+0000","up_votes":6,"down_votes":2,"body":"im actually surprised about banner of command.\n\nwhile the active is pretty much useless, the stat combination makes it pretty good as a 5th or 6th defensive item for mages. or even ap bruisers like rumble.\n\ni wouldnt say the item itself is useless, it might just be very nieche. they need to improve the active though.\n\nthey probably should have combined the portal with banner of command instead. basically giving it the active from the portal and the base stats from banner of command.\n\n\n\ntwin shadows is just incredibly underrated. is really nice on low mobility, long range mages like lux for extra movement speed and kiting potential. the vision and slow on the active can be used to set up snipes.\n\n\nohmwrecker is another one of those nieche items, that i only get on garen, if im up against a full ad team and need some armor, health and cdr. its again, one of those weird items with a useless active. i would never buy it in place of a randuins, which gives me the same survivability against turrets and more against champions.","replies":[{"poster":"BranchofSin5580","date":"2015-05-03T13:21:42.434+0000","up_votes":8,"down_votes":0,"body":"> [{quoted}](name=Critmaster Garen,realm=NA,application-id=3ErqAdtq,discussion-id=9NVunabB,comment-id=0004,timestamp=2015-05-03T13:15:49.764+0000)\n>\n> im actually surprised about banner of command.\n> \n> while the active is pretty much useless, the stat combination makes it pretty good as a 5th or 6th defensive item for mages. or even ap bruisers like rumble.\n> \n> i wouldnt say the item itself is useless, it might just be very nieche. they need to improve the active though.\n> \n> they probably should have combined the portal with banner of command instead. basically giving it the active from the portal and the base stats from banner of command.\n> \n> \n> \n> twin shadows is just incredibly underrated. is really nice on low mobility, long range mages like lux for extra movement speed and kiting potential. the vision and slow on the active can be used to set up snipes.\n\ndude.\n\nput it on a Cannon minion with Baron buff.\n\nso fucking strong, you have no idea.","replies":[{"poster":"SelflessTeammate","date":"2015-05-03T20:10:08.047+0000","up_votes":4,"down_votes":0,"body":"I have an idea. Oh, dear, this, so much. Seriously, I absolutely adore {{item:3060}}, and with or without the Baron buff it can be dreamy (if only it worked on super minions...oh well). People don't realize how astonishingly tough those minions get, even more so if you snag a {{item:2137}}. The two buffs combined really live up to their names.\n\nAnd unlike {{item:3512}} , you don't need more than one person to get it for it to be really useful. The {{item:3512}} , if more than one player gets it, is downright funny. But just one on the tank, not so much, those voidlings are a little too easy to take down, and the portal itself is difficult to place, since you kinda have to camp it, you can't just leave it.","replies":[{"poster":"Salzigorimando","date":"2015-05-04T01:30:24.891+0000","up_votes":2,"down_votes":0,"body":"Heh, I like Zz's Because I see it as a combination lure/turret sapper. Tip toe behind an enemy tower around mid game and drop it in a bush. It distracts minions, which slows that lane noticeably in your favor, and the buffed bug is almost guaranteed to hit the tower if you can get the timing right. Since minions cant deal with it an enemy has to come get it, or let the tower weaken. Helps set up 4v5 fights I find. Its certainly neat, anyway.","replies":[]}]}]}]},{"poster":"Mandang0","date":"2015-05-03T15:01:32.696+0000","up_votes":4,"down_votes":0,"body":"Wasn't this posted months ago?","replies":[{"poster":"Pyro","date":"2015-05-03T15:11:01.665+0000","up_votes":5,"down_votes":0,"body":"Yes, glad you remembered. I've mentioned it in the section IX. The last post was visited by Riot Reinboom, who explained they've put these items on hold and they'll be buffing them soon (Which they did, just not how they should IMO).","replies":[]}]},{"poster":"aperson1","date":"2015-05-03T18:43:47.680+0000","up_votes":4,"down_votes":0,"body":"Zz'Rot is great when on a manaless tank character like Shyvana, Shen or Garen as a second item. It's also a pretty good rush against single-target focused toplaners not named Nasus (like Quinn or Shaco, although they're pretty rare these days) since you can plop it under your tower, go roam, and TP back when they push too close to your tower.\n\nI think a lot of people are just misusing the item. Instead of saving it to help kill towers or pushing with it, you should put it at or a bit behind the mid-way point of the lane and go join your team. This ensures that, for 120 seconds, your lane will be constantly pushing out even when you're not there. Once your minion waves get big, you can force a fight or get an objective 5v4 while someone comes top to clear it out. The only person who really needs to use Zz'Rot to push is Shen, and that's only if he had to forgo Sunfire in laning; and Shen has his ult to join fights with anyways, so it's not a big deal.","replies":[]},{"poster":"AtheosisX","date":"2015-05-03T16:20:21.067+0000","up_votes":4,"down_votes":0,"body":"Rageblade is quite good on hybrid champs, but there aren't very many hybrid champs.","replies":[{"poster":"junglerboy16","date":"2015-05-03T16:57:24.032+0000","up_votes":4,"down_votes":0,"body":"That's the main problem it has. It is actually insanely good (most cost efficient, non-aura item in the game at +200% efficient when stacked), but it is only good like that to make up for the fact that very few champs can utilize more than half the stats it gives well, mainly being Jax and Kayle.\n\nIt used to be better, but since they've started phasing out true hybrid champions, it has become more and more useless. I love it as an item, but it is in desperate need of a rework (It just need to keep some sort of stacking passive and some sort of surge passive and I'd be happy).","replies":[]}]},{"poster":"Transgressor","date":"2015-05-03T16:50:48.238+0000","up_votes":5,"down_votes":6,"body":"{{item:3124}} great on hybrid champions like {{champion:10}} {{champion:24}} and gives a really amazing burst of sustain .\n{{item:3172}} BROKEN on {{champion:266}} ,{{champion:106}} ,{{champion:41}} \n{{item:3050}} ALWAYS a good choice for a support that has a full AD comp to back up.\n{{item:3504}} RIDICULUSLY good on supports that spam abilities like {{champion:37}} and {{champion:267}} \n{{item:3091}} VERY VERY good iteam for when the enemy team starts rushing AD, really good on dps tanks and/or junglers that benefit from alot of AAs like {{champion:72}}  and {{champion:111}} \n{{item:3141}} seriously? Come on... SERIOUSLY?!\n{{item:3512}} I couldn't care less, it's a dumb item in my honest opinion.\n{{item:3060}} Very situational item.\n{{item:3508}} There's no problem with it, it just needs it's strenghts highlighted throughout the game isntead of just early, in order to compete with {{item:3031}} and {{item:3072}} .\n\nNote no1: what makes you think comparing completely different items with eachother helps you prove your point at all?\nExample: {{item:3068}} with{{item:3056}} ? One gives health+armor+magic damage AoE that autopushes the lanes and will always draw aggro under turrets, the other gives health+armor+cdr and lets you deactivate a turret for a set amount of time. Because they give armor and HP you think they are similar? If you look at how they function and the circumstances under which they are needed you will see they are not.\nNote no2: do you even use those items? If you do, you'll see yourself they are really good under specific circumstances. That's good, they don't have to be picked EVERY SINGLE DAMN TIME just because you feel they are ignored as items. Perhaps YOU and everyone else that feels the same way should start deviating from their comfortable norm and try something new.\n\nDon't spew that BS on us, because that's really B-freakin-S. Ranged ADCs provide a clear advantage over melee ADCs(if there's even such a think). Meta-shifts and very limited set of top picks?! LOL WHAT?! Don't confuse LCS with solo-Q. They can play the same 3 champions untill hell freezes over, the millions of players that play all day define the freaking meta, not 10 dudes on their mid-season invitational, wether you like it or not. Deviate from your self conformist state of mind. Stratigical diversity doesn't come from what the roles are, but from what the players pick. Ranged ADCs provide clear differences: Pick {{champion:81}}  for a safe poke and farming lane, great mix of magic+physical damage with good waveclear, turn the game into a poke comp. DIVERSITY. Take {{champion:15}}  for the safe laning and use her full her great engage/disengage, assist your siege comp. DIVERSITY. IT EXISTS BECAUSE DIFFERENT ADCs DO DIFFERENT THINGS, NOT BECAUSE THEY FULLFILL THE SAME ROLE: RANGED PHYSICAL DAMAGE.\n\nThis is just yet another circlejerk thread made to take advantage of players with genuine concernes for free upvotes. Stereotypically stated with stale logic and expected arguments, without citations to prove your statements and arbitary metrics on top, with a sprinkle of biased opinion to boot.","replies":[{"poster":"Myozthirirn","date":"2015-05-03T17:31:42.899+0000","up_votes":6,"down_votes":3,"body":"\"They don't have to be picked EVERY SINGLE DAMN TIME just because you feel they are ignored as items\"\nThey are ignored as items. \n0.05% pick rate means 5 out of 10000 games.\nThis items are bad, it doesnt matter if you say \"this rageblade is awesome on jax\" because no one will buy it, not even you. Dont lie.\nThe truth is you see the item once a month and you crush the poor dreamer who bought it.","replies":[{"poster":"Transgressor","date":"2015-05-03T18:21:07.176+0000","up_votes":3,"down_votes":5,"body":"> [{quoted}](name=Myozthirirn,realm=EUW,application-id=3ErqAdtq,discussion-id=9NVunabB,comment-id=00140000,timestamp=2015-05-03T17:31:42.899+0000)\n>\n> \"They don't have to be picked EVERY SINGLE DAMN TIME just because you feel they are ignored as items\"\n> They are ignored as items. \n> 0.05% pick rate means 5 out of 10000 games.\n> This items are bad, it doesnt matter if you say \"this rageblade is awesome on jax\" because no one will buy it, not even you. Dont lie.\n> The truth is you see the item once a month and you crush the poor dreamer who bought it.\n\nYou sure seem to know a lot about me don't you? Good thing you know what items I buy better than me! By the way, do you know the ratio of a 0.05%? Take that percentage, then crank it up for 15 million live players. Ignored huh?","replies":[{"poster":"Pyro","date":"2015-05-03T18:53:08.521+0000","up_votes":3,"down_votes":0,"body":"You two need to calm down, really.\n\nAnyway, at percentages that low you've gotta consider that many times the items will be built in a \"I can win even with this item\" situation.","replies":[]},{"poster":"Abyssphere","date":"2015-05-03T21:16:25.979+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Ironhold,realm=EUNE,application-id=3ErqAdtq,discussion-id=9NVunabB,comment-id=001400000000,timestamp=2015-05-03T18:21:07.176+0000)\n>\n> You sure seem to know a lot about me don't you? Good thing you know what items I buy better than me! By the way, do you know the ratio of a 0.05%? Take that percentage, then crank it up for 15 million live players. Ignored huh?\n\n0.05% of games for 15 million players is horrendously ignored. There are 10 players in each game so if you assume on average every player plays one game a day, that's 1.5 million games per day. 0.05% of 1.5 million is 750. 750 games out of 1.5 million is the definition of ignored. Like, I find it insane that an item could be built so rarely.","replies":[{"poster":"Earl Eulrich","date":"2015-05-03T21:54:03.053+0000","up_votes":3,"down_votes":1,"body":"though keep in mind that this item has a very specific niche: hybrid-champions. And there aren´t many of them anymore, unfortunatelly. So it mostly gets built on Kayle and Jax - 2 not overly popular Champs atm. If you´d filter all those 1,5million games for instances when the item would make actual sense than you´d get a way higher percentage.\n\nI personally would vouche for more hybrid-champs instead of killing all hybrid-itemization. It´s just more interessting to have more options most of the times.","replies":[]}]}]}]}]},{"poster":"Kapppaccino","date":"2015-05-03T17:03:48.428+0000","up_votes":2,"down_votes":1,"body":"I was liking the post until the first item where you said \" when was the last time you saw a pro player with raptor cloak in their inventory\" or something along those lines. Then it just lost me .","replies":[{"poster":"Pyro","date":"2015-05-03T18:50:54.952+0000","up_votes":3,"down_votes":0,"body":"Laning relies on efficient items, wards and potions. Passive regeneration doesn't cut it, and the changes in 4.20 didn't make Rejuvenation Bead any better. It's a garbage item. You're always better off grabbing a ward and two health potions.\n\nYeah, bringing up \"pros never build this\" isn't the best rhetoric. PLAYERS almost never build this. And even then, I just wanted to point out that Raptor Cloak is a poor choice for an item to rush.","replies":[]}]},{"poster":"Auz the Ripper","date":"2015-05-03T19:29:30.253+0000","up_votes":1,"down_votes":0,"body":"Dude, ZZ'rot's portal is a completely underrated item\nIt grants more MR than any other item in the game with a healthly hunk of armor and a great conditional speed boost from the passive.\n\nIt's Force of Nature 2.0: Splitpushing edition\n\nThe only problem is that the meta isn't based around splitpushing","replies":[{"poster":"Champion Skin","date":"2015-05-03T23:04:31.977+0000","up_votes":1,"down_votes":0,"body":"Actually Locket gives as much MR if another teammate buys it as well (it also gives HP and CDR and a good activate for teamfights)","replies":[{"poster":"Auz the Ripper","date":"2015-05-04T04:08:50.668+0000","up_votes":2,"down_votes":0,"body":"That requires another teammate buys locket or banner which reduces the gold effiecency plus that teammate need to stay in range.\n\nPortal is best on people who splitpush anyway, like Tryndamere, Nasus and Aatrox. \nThe Resists increases the value of their innate sustain, point runner helps them escape if things go sour, and the active greatly helps taking objectives\nIt's actually amazing as a single defensive item because it give a hunk of both resists.","replies":[]}]}]},{"poster":"sp441","date":"2015-05-04T01:13:38.458+0000","up_votes":2,"down_votes":0,"body":"I dunno, I think Wit's End is at a good place. The problem is that there aren't a lot of champions that can make full use of it, there aren't a lot of tanks who use a lot of AAs. Off the top of my head, the only champions who'd make good use of this Item are Shen, Shyvana, and Udyr *maybe*.\n\nEssence Reaver is crap by virtue of having a shit build path. It really needs to build out of a new item made out of Forbidden Idol + Vampiric Scepter or something. Maybe making it build out of Pickaxe instead of BF, lower the base AD given, and increase your AD as you run out of Mana?\n\nZephyr's problem is that not only there aren't a lot of champions who make good use out of it, but they also have more important things to build as well.\n\nI think Ardent Cleanser is mostly fine. It's a solid niche item strong on certain champions and within certain comps, I don't think it should be a \"pick every game\" item.\n\nZeke's Herald is garbage, plain and simple, supports need to be building other shit, and it's not good enough for bruisers to buy it. Maybe if it built out of Legion + Vampiric Scepter?","replies":[]},{"poster":"SelflessTeammate","date":"2015-05-03T20:16:23.012+0000","up_votes":1,"down_votes":0,"body":"Ohmwrecker's active is just not good enough for the mediocre stat boosts. It doesn't really seem to have a place in any core build, for any role. For the high price and that all-important late-game slot, it just doesn't do enough. Much like the issue with Essence Reaver, by the time you get it, its effect no longer really matters enough to justify filling a slot.\n\n{{item:3124}}  is...OK on {{champion:10}}. I play Kayle jungle fairly often, and I still don't get it, but...I dunno, it doesn't have a great feel to it. It's not a bad item, but it's not exactly a power-spiking item, either. On Kayle, I just prefer Spellblade.\n\n{{item:3060}}  is an amazing and underused item, though. Seriously, it's incredible, just not picked a lot.\n\nBut then again, so is {{item:2044}}.","replies":[{"poster":"WolfBV","date":"2015-05-03T20:23:38.450+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Oyster Fight,realm=NA,application-id=3ErqAdtq,discussion-id=9NVunabB,comment-id=0023,timestamp=2015-05-03T20:16:23.012+0000)\n>\n> Ohmwrecker's active is just not good enough for the mediocre stat boosts. It doesn't really seem to have a place in any core build, for any role. For the high price and that all-important late-game slot, it just doesn't do enough. Much like the issue with Essence Reaver, by the time you get it, its effect no longer really matters enough to justify filling a slot.\n> \n> {{item:3124}}  is...OK on {{champion:10}}. I play Kayle jungle fairly often, and I still don't get it, but...I dunno, it doesn't have a great feel to it. It's not a bad item, but it's not exactly a power-spiking item, either. On Kayle, I just prefer Spellblade.\n> \n> {{item:3060}}  is an amazing and underused item, though. Seriously, it's incredible, just not picked a lot.\n> \n> But then again, so is {{item:2044}}.\n\nYou got any tips on how to play Kayle? I don't really know who to play her effectively and I suavely become a useless squishy that's only good for ulting.","replies":[{"poster":"SelflessTeammate","date":"2015-05-03T20:55:25.931+0000","up_votes":1,"down_votes":0,"body":"I can try. I think Kayle jungle is super-fun (she's really not that squishy, though, and gets a good amount of health per level), though it's admittedly because her ult is absolutely key in teamfights.\n\nWithout going into an essay, I'm a fan of {{item:3724}} and {{item:3025}} (or {{item:3078}}, either's fine) as her core items (though any Spellblade of choice is workable, with her E active, that Gauntlet's effect is very nice to have when you join any lane). She needs mana, she needs CDR. Her W helps her and her allies stay alive and get around very well, so the AP is also good to have. She has fairly high base AD, so Trinity Force works well on her, too.\n\nThe oddball nature of her E makes {{item:3085}} very viable, especially with its recent change to make it more worthwhile. Attack speed helps proc her passive faster, and Runaan's applies it to everything it hits. {{item:3115}} is always a good choice to put somewhere in there, though a little extra mana really helps her stay in the jungle and in fights longer. She can become a clearing beast, and can tear through teams on her own if given enough time to build the items that hurt.\n\nHer biggest problem is her vulnerability to crowd control. Tenacity certainly helps with that, so if crowd control looks like it could be a problem, anything with tenacity helps a lot. And the {{item:2138}} makes Aether Wing Kayle look incredible. DJ Sona wasn't the first one to wear a skin-tight suit with a dance to show off her features.\n\nBut she's pretty flexible, really, and is open for imagination. She can match almost any playstyle (and is really the only champ viable for any role on the map). You could go with *both* {{item:3135}} and {{item:3035}} , as she benefits well from AD and AP, one more than the other depending on if you max W or Q second. AP works best if you want to use her W for a pretty good speed boost and a decent heal, which I do.","replies":[{"poster":"WolfBV","date":"2015-05-04T00:40:38.411+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Oyster Fight,realm=NA,application-id=3ErqAdtq,discussion-id=9NVunabB,comment-id=002300000000,timestamp=2015-05-03T20:55:25.931+0000)\n>\n> I can try. I think Kayle jungle is super-fun (she's really not that squishy, though, and gets a good amount of health per level), though it's admittedly because her ult is absolutely key in teamfights.\n> \n> Without going into an essay, I'm a fan of {{item:3724}} and {{item:3025}} (or {{item:3078}}, either's fine) as her core items (though any Spellblade of choice is workable, with her E active, that Gauntlet's effect is very nice to have when you join any lane). She needs mana, she needs CDR. Her W helps her and her allies stay alive and get around very well, so the AP is also good to have. She has fairly high base AD, so Trinity Force works well on her, too.\n> \n> The oddball nature of her E makes {{item:3085}} very viable, especially with its recent change to make it more worthwhile. Attack speed helps proc her passive faster, and Runaan's applies it to everything it hits. {{item:3115}} is always a good choice to put somewhere in there, though a little extra mana really helps her stay in the jungle and in fights longer. She can become a clearing beast, and can tear through teams on her own if given enough time to build the items that hurt.\n> \n> Her biggest problem is her vulnerability to crowd control. Tenacity certainly helps with that, so if crowd control looks like it could be a problem, anything with tenacity helps a lot. And the {{item:2138}} makes Aether Wing Kayle look incredible. DJ Sona wasn't the first one to wear a skin-tight suit with a dance to show off her features.\n> \n> But she's pretty flexible, really, and is open for imagination. She can match almost any playstyle (and is really the only champ viable for any role on the map). You could go with *both* {{item:3135}} and {{item:3035}} , as she benefits well from AD and AP, one more than the other depending on if you max W or Q second. AP works best if you want to use her W for a pretty good speed boost and a decent heal, which I do.\n\nAhh, that's why I was so bad before, I build {{item:3124}}  thinking it was a core item immediately after finishing my jungle item, fell behind hard, and decided becoming a tank wouldn't be a bad idea.\nWould a {{item:3091}} be a good final item on her?","replies":[]}]}]}]},{"poster":"willwsg22","date":"2015-05-04T00:36:46.721+0000","up_votes":1,"down_votes":0,"body":"Ummm, isn't this just a copy and paste of a thread from a while back? Or am I just dumb, and its just similar?","replies":[{"poster":"Pyro","date":"2015-05-04T00:39:32.802+0000","up_votes":2,"down_votes":0,"body":"Read the section IX. Yes, it's mostly a copy, adjusted for what has changed (fresh numbers and stat changes Riot made).\n\nThe problem remains the same.","replies":[]}]},{"poster":"FancyKiwi","date":"2015-05-03T20:33:30.682+0000","up_votes":2,"down_votes":0,"body":"I feel that isn't that these items are all that bad rather that there is simply no room for them on really anyone but a support or jungler if they are playing a supportive style champ. Supports have at least 3 item slots filled before the game even starts with boots, sightstone and their support item. So that only leaves three for other things.","replies":[]},{"poster":"WolfBV","date":"2015-05-03T20:22:35.949+0000","up_votes":2,"down_votes":0,"body":"Hey hey hey, I used {{item:3056}} on support {{champion:8}}  once. That's good, right?","replies":[]},{"poster":"Drukyul","date":"2015-05-03T19:34:10.687+0000","up_votes":2,"down_votes":0,"body":"Give Ohmwrecker another charge so you can use it twice in the same fight. Nerf the duration if you have to, I don't care, but resetting the turret a couple times when it's trying to target your squishies would be very situationally handy.\n\nTrade 10% CDR from Zeke's for more HP so tanky champs will actually grab it sometimes.\n\nGive Rageblade a small amount of stacking life-on-hit before the activation so you don't have to run around nearly-dead to get all its benefits.\n\nEssence Reaver is easily fixed by the often-suggested build path fix of Forbidden Idol.\n\nTwin Shadows needs an active buff to keep up with the ward trinket buffs. Don't really care how.","replies":[]},{"poster":"ajwf","date":"2015-05-03T15:51:18.397+0000","up_votes":2,"down_votes":0,"body":"The issue with a bunch of these items (Zeke's Herald, Banner of Command, Ohmwrecker, Ardent Censer, Twin Shadows and ZZrot) is that they're all SUPER luxury items for supports. All accept banner of command, I guess. They're very expensive items in general and aren't going to benefit the kill power of anyone (but zeke's herald). Therefore, it is often the support's choice on which of these they want, and as you can guess, it takes a long time for them to be able to afford one. \n\nPersonally, Ohmwrecker needs a slight buff to both active and stats, but it is an incredibly cool item in concept. Being able to do really consistent and heavy damage to an inhib turret without a wave is incredibly useful for backdooring. However, I've only seen it recommended by trick2g for his udyr when talking outside of supports... And obviously, a support isn't doing heavy damage to your turret even with it off.\n\nBanner of Command is a wonderful item. If you reduced the active cooldown a bit, it would probably see more use than Iron Locket of the Solari. \n\nArden Censer is a niche item, but at least it has a good niche. I agree with an AP buff, but Soraka, Sona, Janna and some others all make great use of this item. \n\nTwin Shadows is a bit underwhelming for a support in the sense that a support can just ward. If you keep up the coverage, the active is very rarely needed. Again, decreasing cooldown on active would make it viable to help warding (you don't have to face check a bush that hard) or maybe even help chase down others in a teamfight. \n\nOverall, these items wouldn't be so underused if supports had the income to buy them before the game ended :/","replies":[]},{"poster":"ZzEslIolZQ","date":"2015-05-03T12:40:50.367+0000","up_votes":2,"down_votes":0,"body":"Better give Ahri 300 ms after she R's.","replies":[{"poster":"TeemoLikeCookies","date":"2015-05-03T17:23:55.286+0000","up_votes":2,"down_votes":1,"body":"Ya the move speed buff on her q makes it nearly impossible to trade skillshots with her.","replies":[]}]},{"poster":"Gym Leader Yaki","date":"2015-05-03T12:34:43.949+0000","up_votes":2,"down_votes":0,"body":"It's just that a few of those items works well on specific champions. For example, I like {{item:3508}} on {{champion:81}} , because it procs his Q and autos. So I don't have to purchase tear and I never run out of mana.\n\n{{item:3023}} is a great item on certain supports, but again it's specific to supports. Maybe that's why the stats say it's rarely purchased.","replies":[]},{"poster":"Jungle Lux God","date":"2015-05-03T18:02:58.593+0000","up_votes":3,"down_votes":1,"body":"Ohmwrecker needs different stats.\n\nIt having armor and the tower-disabling active is super redundant because the armor already reduces the damage you take from towers.\n\nChanging it to having MR instead gives it a better purpose. You get armor against heavy AD compositions, and that helps you dive towers. You buy MR against a heavy AP composition, and this item would be better purposed to dive against these heavy AP compositions, where you don't have the armor to dive.\n\nThis also doesn't include the fact that there is more competition between the armor items than the magic resistance items by virtue of most of the Magic Resistance items being super niche/champion dependent.\n\nRaptor Cloak would probably need to be changed to have MR instead, but that is a pretty easy fix because it only builds into two items, one of which already has magic resistance and would otherwise just need a recipe change and the other of which is Ohmwrecker.","replies":[]},{"poster":"junglerboy16","date":"2015-05-03T17:37:49.149+0000","up_votes":3,"down_votes":1,"body":"The thing about Zeke's (aside from it not being worthwhile on an AD bruiser, but being too expensive on a support) is that it is very hard to notice its effect. It is the single strongest aura item in the game under most circumstances, but its effect is basically invisible power for your team. I love the idea of making it build out of a component item and then having an active of a sort, that could be just what it needs.\n\nMaybe something like this:\n\n* Component item, Sanguine Standard: Vampiric Scepter+Ruby crystal+600 gold=1800 gold. Stats: 15 AD, 200 health. Unique aura, Vampirism: all nearby allies gain 10% lifesteal.\n\n* New Zeke's Herald: Sanguine Standard+long sword+Kindlegem+X gold=3200 gold. Stats: 30 AD, 400 health, 10% CDR. Unique aura, Vampirism: All nearby allies gain 10% lifesteal. Unique Active: for the next 4 seconds, grants all allies within aura range 14+(2xlevel) AD and AS\n\nThis item is better than the old Zeke's in that its component could be priced better for a solo laner or jungler, since it only gives a lifesteal aura, instead of a lifesteal+AD aura (meaning you only pay for the AD *you* gain). The new Zeke's itself has much better use in terms of visible power (Having an active like you suggested, this gives a burst of team-wide DPS that could be used to kill a tower, or win a team fight) and in terms of viability as a slot efficient item on a solo laner, while not being as difficult to attain for a support (it is very expensive, but a support can get use out of it much earlier in its build path, which makes it more useful overall).","replies":[]},{"poster":"Terchio","date":"2015-05-04T01:36:11.137+0000","up_votes":2,"down_votes":1,"body":"All these \"strategic diversity\" items are obsolete because they aren't actually strategic diversity to the point that critical chance is \"burst fishing\". Riot claims that's a thing (that they call crit fishing), but really they made the 3 primary popularity items (Statikk Shiv, Infinity Edge, Trinity Force) quite powerful without the crit, and if you do crit, it's just that much better. Likewise, Ohmwrecker, Sword of the Occult, and Zeke's Herald all have potential to be quite effective... But none of them have that \"base value\" to bank off of when things aren't optimal, unlike these crit values. There should be a decision made for item effectiveness, but that doesn't happen with those three items because there is no downside to buying them; They are all quite powerful regardless of if you do land crits. \"Strategic diversity\" items can only be powerful if you do \"land a crit\", so to speak.","replies":[]},{"poster":"Baron of Bread","date":"2015-05-03T22:34:41.786+0000","up_votes":2,"down_votes":1,"body":"An idea for Zeke's Herald:\n\nYou know what item recently started to have only one build path?  {{item:3134}}\n\nYou know what item doesn't really have an AD equivalent?  {{item:3001}}\n\nWhat do you folks think about giving Zeke's an Abyssal Scepter-like offensive aura and having it build out of Brutalizer?","replies":[]},{"poster":"2pudge1cup","date":"2015-05-03T21:54:06.548+0000","up_votes":2,"down_votes":1,"body":"There's too many items in this game with similar niches.\n\nIt's not shocking in the least that some are stupidly unpopular.\n\nIf a number of these get buffed, another set of items will take their place.\n\nRiot needs to greatly reduce the number of items and give each its own direction. There's really no point for {{item:3172}} {{item:3046}} {{item:3087}} to all exist at once when they give such similar stats and similar costs.  The suggestion of tacking MS on {{item:3124}} would further add to an already crowded niche.\n\nRiot's going to need a complete item overhaul to fix this bottleneck issue.","replies":[]},{"poster":"Earl Eulrich","date":"2015-05-03T20:12:29.777+0000","up_votes":2,"down_votes":1,"body":"Just some addition to VII:\n\n{{item:3124}} is a brilliant, aggressive item for hybrids that grants you a very strong powerspike for the money. I personally think it´s in a good spot actually...though there really should be more hybrid champs.\n{{item:3050}} Zeke´s is an actually very underrated item, though I agree - it should only have 10%CDR and a little more health instead\n{{item:3504}} really strong item, nothing wrong with it - rather just delete crucible from the game \n{{item:3023}}  Yea, it is almost there...but still not quite. It needs a little sth. Maybe casting spells/AAing should reduce the CD on the active.\n{{item:3172}}  Kinda too many mixed stats on it to really be usefull - for the rare cases you direly want tenacity mercs just beat it most of the time and in terms of slot efficiency there´s kinda no reason to ever get it (apart from 6th item on adcs, and even then it´s a tough choice). I guess it could work out as a brutalizer-upgrade for bruisers.\n{{item:3091}}  really underrated item atm, it´s incredible strong on tanky-frontliners to deal dmg and support their mages or some more AS-reliant bruisers. Could need a lategame-upgrade maybe, or just some more magic-on-hit-items to combine with (r.i.p. madreds :( )\n{{item:3508}}  i tend to agree...apart from the buildpath it could be a really good itemchoice, but as it is - Champs that need mana will go muramana to have a decent laning-phase - and everyone else won´t care anyway later on in the game.","replies":[]},{"poster":"largefish","date":"2015-05-03T15:16:25.756+0000","up_votes":2,"down_votes":1,"body":"Oh god please don't delete rageblade, it's such a powerful item when used properly but so underrated.  It gives an insane early game power spike to any champion that can utilize hybrid itemization, its really cheap and has absolutely amazing stats for early game dueling, I love it and think that people just dont understand how strong it is yet","replies":[]},{"poster":"NeoScout","date":"2015-05-05T03:48:12.777+0000","up_votes":1,"down_votes":0,"body":"remove crit and most of those items will be used","replies":[]},{"poster":"EchoZeero","date":"2015-05-04T21:42:01.951+0000","up_votes":1,"down_votes":0,"body":"The problem with {{item:3508}} is as follow. It builds from a {{item:1038}} , and so does {{item:3031}} . If you have the money to build a {{item:1038}} , you're going to make it into an {{item:3031}} . Why? Because {{item:3031}} is simply the better choice, it will kill your enemies faster so you won't need to spend as much mana, thus negating completely the usefulness of {{item:3508}} . {{item:3508}} either needs to be cheaper with lower stats and not built from a {{item:1038}}  or it needs an incentive to build it, something unique that will make you think twice between {{item:3508}}  and {{item:3031}} .","replies":[]},{"poster":"The Loveless","date":"2015-05-04T21:24:10.451+0000","up_votes":1,"down_votes":0,"body":"zeke's is cool. I don't think many see what it really brings and how it could work.\n\ngotta think about it, it gives your team a combined 100 AD for autoattacks and any spells that scale off AD. Early game, that's tremendous for teamfighting. What makes it horrible is that grouping+teamfighting doesn't actually begin with everyone's first items.  :-\\","replies":[]},{"poster":"Partholonian","date":"2015-05-04T20:53:16.644+0000","up_votes":1,"down_votes":0,"body":"{{item:3124}} Guinsoo's Rageblade (0.05%)\n\nA good item for champions that don't exist, or have been nerfed to not use it anymore.  Pretty much all hybrid builds except Jax have been nerfed into the ground (and even he is usually building BOTRK now over Gunblade, which manages to stay off this list but still isn't really in a good place).  AP fighter builds would theoretically be able to use this but they want Nashor's more, and are overshadowed by the stupidly overpowered current state of crit anyway.\n\nThe fact that it doesn't work on AD casters is not necessarily terrible -- not *everyone* is an AD caster -- rather, it's the systemic weakness of AP onhits (for either fighters or marksmen) compared to crit/arpen that leaves rageblade in the dirt.  Mixed damage that's hard to itemize against isn't as strong as focused damage that you can itemize *for*.\n\n  {{item:3056}}   Ohmwrecker (0.08%)\n\nI think the main problem here is that people just don't think in terms of what they could do with it that they can't do with a similar item.  The stats aren't as good for something like a dragon fight; who *plans* to be fighting under enemy turrets?\n\n{{item:3050}}     Zeke's Herald (0.17%)\n\nToo expensive for supports, not enough personal stats for most other people.  Some junglers might be OK with it, after the point where they're not spending all their time alone anymore.  But in general people tend to avoid team comps where this would be really good, because they would get hurt worse by FH than they get helped by Zeke's.\n\n{{item:3141}}     Sword of the Occult (0.19%)\n\nYour analysis of this one is pretty much spot on, but unlike the rest of the list, I don't think it's bad for this item to be terrible.  Honestly I'd prefer if it and Mejai's were removed entirely; even though there are a few champions who *can* non-trollishly build Mejai's, it's mainly a noob trap when it is built at all, and that goes double for SotO.  The game would not really lose anything by removing these items, IMO.\n\n{{item:3060}}     Banner of Command (0.20%)\n\nKinda surprised this is so rare actually; I would have expected at least 1%.  Unless it's counting per champion instead of per game (a good way to check would be to see if something like Deathcap is above 100%, since I bet the average game has more than one completed Deathcap in it).  It has its uses, but like Ohmwrecker, I feel like people generally overvalue their on paper ability to fight someone in an idealized featureless plane, simply because it's a situation that is easier to understand and simulate, at the expense of items whose power comes in terms of specific plays.  On the other hand, fights in the middle of nowhere happen a lot, and the play that might justify your Ohmwrecker may never happen all game.\n\n {{item:3711}}    Poacher's Knife (counting enchantments) (0.33%)\n\nI feel like counterjungling should be good, ideally, but right now it isn't, so neither is an item (or champion) intended for it.  The item is probably not a good place to focus changes though -- it's the jungle itself that still needs work to make it worth the risk to invade it.  The Jinx passive seems like it should already be pretty good at helping you avoid collapses while also helping you farm both sides at once with the extra Smite charges.\n\nSome people have expressed concern about the idea of an item that basically *announces* \"I'm going to invade you\", although you may not need to show until after you've stolen at least a couple of camps.\n\n{{item:3512}}     Zz'Rot Portal (0.48%)\n\nI think the main opportunity for improvement is the timeout on the spawns.  In order for it to threaten turrets they need to be able to walk more than the length of a Rumble ult before despawning.  (Of course if they're actually walking ON a Rumble ult it should kill them, but you know what I mean.)\n\n {{item:3023}}    Twin Shadows (0.44%)\n\nActually a decent item on paper, but the role that might want to build it can't afford it in practice.  Also, see previous remarks on valuing stats over playmaking abilities.  Who knows how to use the active effectively?  Maybe people who build it regularly, but there aren't many of those.\n\n{{item:3504}}     Ardent Censer (0.55%)\n\nIt's very expensive and provides very little survivability, when the champions who most want it for their kits are already horribly squishy even *before* you take into account how underleveled and unfarmed they are.  {{champion:37}} {{item:3504}} is a free kill even for champions that are normally thought of as non bursty.\n\n{{item:3091}}     Wit's End (0.58%)\n\nRecurve changes might help some here, or they might not.  Probably goes back to the weak state of AP fighters compared with crit, like Rageblade.\n\n{{item:3172}}     Zephyr (0.61%)\n\nSuffers by comparison with BOTRK, which has everything Zephyr has except tenacity, but trades it for lifesteal, a powerful passive and an even more powerful active.  Zeal would make it yet another crit item though, which I don't think is needed/wanted.\n\n{{item:3508}}     Essence Reaver (0.79%)\n\nAwful buildpath that doesn't provide the things that you actually want ER for, and overall is usually just a worse BT.\n\nBeing at low mana *can* influence what fights you want to take (or even whether or not you win them), but people don't think of it that way compared to DPS stats.\n\nModerate buffs might at least make it appealing to Corki and Lucian -- if they don't want it, what chance is there that anyone else will?\n\nOne item that I'm surprised *not* to see here is {{item:3022}}, which has a pretty bad buildpath and awkward mix of stats nobody really loves.","replies":[]}]}