{"poster":"DJ S0NA","date":"2016-05-31T21:20:08.270+0000","title":"\"... we've made the decision to not bring back solo queue\"","subforum":"Gameplay","up_votes":204,"down_votes":26,"body":"http://na.leagueoflegends.com/en/news/game-updates/features/dynamic-queue-and-future-league\r\n\r\nYour thoughts?","replies":[{"poster":"Decrit","date":"2016-05-31T21:43:18.014+0000","up_votes":64,"down_votes":32,"body":"About time.\n\nProbably is not very functional right now since it has issues at higher elo, but better this than the old joke of the solo Q. That, in truth, it was not a SoloQ as many want to claim since you could queque as a duo and you could easily end up in teams with duos ignoring each other. \n\nBut hey, i am just a silver. Probably my opinion means nothing to the goldplatlords here that want to shout and scream claiming to be the majority and to have only right ideas here","replies":[{"poster":"Kirbanator","date":"2016-05-31T22:25:24.836+0000","up_votes":38,"down_votes":39,"body":"i for one have zero problems with dynamic que, i hated solo que for many reasons. I had to fight the role i was good at. A lot more toxicity. Nobody worked together in game, they all went rambo and died 1v5. It was horrible, i didn't get anywhere.\n\nI do understand alot of people's compliants, but i NEVER get assigned with premades, my team knows how to play there role, and most importantly, WE ARE WORKING AS A TEAM IN A TEAM BASED GAME.\n\nBottomline, solo queue may be gone, but dynamic queue as a whole makes the experience so much better.","replies":[{"poster":"Voluug13","date":"2016-05-31T23:50:15.274+0000","up_votes":36,"down_votes":6,"body":"You are confusing ''new champ select and role queue'ing'' with DQ. They are not the same.\n\nDQ is the ability to queue with 2-5 people in ranked.\n\n>I do understand alot of people's compliants, but i NEVER get assigned with premades, my team knows how to play there role, and most importantly, WE ARE WORKING AS A TEAM IN A TEAM BASED GAME.\n\nYes, but when you get the bad premade while the enemy premade dives your tower at level 4 with 3 people... while yours is composed of a bronze-level guy, his GF and their Plat best friend. While you play in high gold.\n\nEDIT: People apparently dont get hyperbole.","replies":[{"poster":"Hammerpriest","date":"2016-06-01T01:57:53.114+0000","up_votes":3,"down_votes":10,"body":"Except that'll never happen except if the plat player is smurfing and managed to get placed in silver. Smurfing + feeder has always been a problem even back during Solo Q so there's a zero sum gain there. If only we could remove 4 man premades doe. 3 is manageable, 4 is absolute hell.","replies":[{"poster":"Voluug13","date":"2016-06-01T02:00:18.064+0000","up_votes":10,"down_votes":1,"body":"> Smurfing + feeder has always been a problem\n\nAnd it was it was an issue that was ALWAYS complained about.","replies":[]}]}]}]},{"poster":"Keti","date":"2016-05-31T22:23:15.658+0000","up_votes":8,"down_votes":3,"body":"In previous solo/duo it was limited to 1 duo per team, typically an adc/support.","replies":[{"poster":"Decrit","date":"2016-05-31T22:45:47.624+0000","up_votes":6,"down_votes":5,"body":"Are you sure? many times i checked out my own account at op.gg and i noticed double duos. I might remember wrong, but that struck me hard enough. If you have any evidence, could you please link them?","replies":[{"poster":"Blue Ogre Dorry","date":"2016-06-01T03:43:23.190+0000","up_votes":7,"down_votes":1,"body":"No, Double Duo was Extremely common for me in season 3 and a nice chunk of season 5.","replies":[]}]}]},{"poster":"iamthegoatofwar","date":"2016-05-31T22:15:14.386+0000","up_votes":7,"down_votes":1,"body":"I'm not going to pull rank on you here at all, but I promise you one thing it is extremely annoying to see a person in my elo feeding, but his 2 plat friends are able to carry him easy.","replies":[]},{"poster":"BakedLotion","date":"2016-06-01T03:05:50.123+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Decrit,realm=EUW,application-id=3ErqAdtq,discussion-id=Bjx0zuVc,comment-id=0004,timestamp=2016-05-31T21:43:18.014+0000)\n>\n> About time.\n> \n> Probably is not very functional right now since it has issues at higher elo, but better this than the old joke of the solo Q. That, in truth, it was not a SoloQ as many want to claim since you could queque as a duo and you could easily end up in teams with double duos ignoring each other.\n> \n> But hey, i am just a silver. Probably my opinion means nothing to the goldplatlords here that want to shout and scream claiming to be the majority and to have only right ideas here.\n\n\n\"We agree dynamic queue standings don't reflect pure individual skill as well as a solo ladder\" \n\"We agree dynamic queue standings don't reflect pure individual skill as well as a solo ladder\" \n\"We agree dynamic queue standings don't reflect pure individual skill as well as a solo ladder\" \n\"We agree dynamic queue standings don't reflect pure individual skill as well as a solo ladder\"","replies":[]},{"poster":"Blue Moon Wolf","date":"2016-05-31T23:15:42.127+0000","up_votes":5,"down_votes":3,"body":"I feel like the problems that DynamicQ has now will mostly be fixed after they have some more time to work on the issues and they did make a fair point on premades vs a team of all solo players (though they really dodged the communication issue). \n\nTo me, I feel like the simplest way to fix the issues is to split the Q into solos and premades. A Split Q would mean less issues with finding a group that will give you the role you want and in turn, end up with shorter wait times across the board. Then Riot could focus on how to get people the role they want in solo Q in a way not available when dealing with premade teams.\n\nBut that's just my take on the problem, I'm not the one looking at the numbers and running tests to see what works and what doesn't. They mentioned the goal is to get matches together quickly, give you your preferred role 99% of the time and have teams be as evenly matched as possible, so as long as they're not bull shiting about those goals, I'm happy.","replies":[{"poster":"SuperSourCat","date":"2016-06-01T01:21:54.306+0000","up_votes":6,"down_votes":3,"body":"People are too impatient for riot to work on the system so they are going to flip shit right now and complain because they like to pull rank and say the lower rank players wouldn't understand because they are all trash.","replies":[]}]},{"poster":"Thumpin","date":"2016-05-31T23:35:42.395+0000","up_votes":6,"down_votes":3,"body":"No team has had a double duo since season 2 under the old system. They specifically removed that possibility due to the exact same complaints that people have about the current dynamic queue.","replies":[]},{"poster":"Biggg O","date":"2016-06-01T01:39:47.173+0000","up_votes":2,"down_votes":0,"body":"Old solo queue could have 1 duo queue on each team, you couldn't have multiple duo queues on each team.","replies":[]}]},{"poster":"NotSpecialDude","date":"2016-05-31T21:47:11.781+0000","up_votes":24,"down_votes":5,"body":"Eh, I'll manage.\n\nHonestly from what I've seen, most want everything DQ gives EXCEPT the premades thing. I hear minor complaints about fill being support, but its only the Premade thing that is out of the players control that we have to deal with. \n\nI figure that they are going to axe 4 premades and separate 5 man ranked in S7 but otherwise the queue will not change. \n\nIf people leave the game for this I doubt it will stick. I could bet that most will come back at season's end with the rest in the beginning of S7.\n\nSo I'm just gonna sit back and calmly watch the insanity as it proceeds.\n\n{{sticker:slayer-pantheon-popcorn}}","replies":[{"poster":"GayFluffyUnicorn","date":"2016-06-01T11:31:15.907+0000","up_votes":5,"down_votes":0,"body":"Role selection has nothing to do with DQ.\nIf you talk about DQ, talk about: Q up with any number of premades in ranked.\nIf you talk about role selection/pick/bans talk about NCS=new champion select.","replies":[]}]},{"poster":"PrometheS","date":"2016-05-31T22:08:34.428+0000","up_votes":14,"down_votes":0,"body":"It's nonsense. Clumping every queue configuration together makes no sense for ranked ladder since solo to 5-man are different skills and experiences (plus possible voice chat/pre-game advantages). No matter how hard you try to adjust it, it's inherently a broken system if you take competitive play seriously. There is simply no other way around it. That's the problem for me. It's not just unfair matchmaking, it's that it lacks validity as a ranking system since it doesn't force consistency in the experience despite putting everything on a single ladder.\n\nThey could at least show a solo ranking separately though even if it's all DQ still.","replies":[]},{"poster":"RoodToob","date":"2016-05-31T23:23:43.971+0000","up_votes":23,"down_votes":8,"body":"People will freak out, which is to be expected. However many people stop reading at that sentence, or don't even click on the article, just your post. This is an issue, because as much as Solo Queue is gone, Riot does NOT want to get rid of solo players. They say that DQ is no where near perfect, and they want to adjust it so Solos have a better experience. \n\nSo please, quit league temporarily if you must, but come back once adjustments to the queue have been made for solo players, and try 10 or so games then. If its not for you, thats okay, normals or other games might be better for you, but just saying I'm quitting because Riot does not care about Solo players is ridiculous. Solo players are needed to make DQ successful, they want you as much as a premade for this queue","replies":[{"poster":"VladimirSnakeyes","date":"2016-06-01T01:42:34.909+0000","up_votes":7,"down_votes":1,"body":"***","replies":[{"poster":"RoodToob","date":"2016-06-01T11:30:13.414+0000","up_votes":1,"down_votes":1,"body":"They say they are trying to make things better for solo players. Wether you believe them or not, thats up to you. I haven't seen them lie enough to believe they are just saying stuff. The solo queue is coming back fiasco feels like a lie to everyone who really wants it of course, but if they made a rash statement at the beginning of the year, then soon(Ish) they correct themselves saying it was rash and they are not sure yet. Ill still believe then until they straight up spit in the community's face in general (If anyone has played WoW recently, you know what i mean)","replies":[]}]}]},{"poster":"KVbqbFsC8e","date":"2016-05-31T22:11:08.906+0000","up_votes":14,"down_votes":2,"body":"Well, at least they finally admitted it. Still doesn't absolve them from being lying scumbags though.","replies":[{"poster":"Burnt Light","date":"2016-06-01T09:10:48.866+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=The Big Piece,realm=NA,application-id=3ErqAdtq,discussion-id=Bjx0zuVc,comment-id=000b,timestamp=2016-05-31T22:11:08.906+0000)\n>\n> Well, at least they finally admitted it. Still doesn&#x27;t absolve them from being lying scumbags though.\n\nWhich I me and many others made apparently clear and everybody was like \"NU, RIOT NEVER LIES\"","replies":[]}]},{"poster":"Jofeyy","date":"2016-05-31T22:09:06.567+0000","up_votes":10,"down_votes":0,"body":"https://media.giphy.com/media/3o85xJZCsqcmmCxve8/giphy.gif","replies":[]},{"poster":"Yordlelayhehoo","date":"2016-05-31T22:57:00.490+0000","up_votes":17,"down_votes":7,"body":"those of us who said the casual infestation will ruin this game, were proven right when they announced this. Just a matter of time now before this games playerbase drives out the competitive players and a new company will come along with a modern moba and replace the micro-transaction scam this game has become.","replies":[{"poster":"Kirbanator","date":"2016-05-31T23:43:53.703+0000","up_votes":18,"down_votes":7,"body":"People have lives you know, that's the majority of casual players. It's fact that as you grow up, your time is valuable. So saying that there is a \"casual infestation\" is stupid. You are basically saying \"Eat, Sleep, Breathe LoL, or don't ever play\". I thought the point of video games was to have fun, no matter who the person is. You can't stop time dude, you aren't ekko or zilean.\n\nLet the downvotes commence.","replies":[{"poster":"Voluug13","date":"2016-06-01T00:00:12.126+0000","up_votes":10,"down_votes":3,"body":"Dude, I barely play 1 hour at half a day but I dont go around trying to carry my GF/BF or AFK'ing to fuck up my team or trolling other players around with my premades because majority gave me ownership of a game or picing Disco Nunu because lulz.\n\nWhen people mean ''casual'' they mean people who are often inconsiderate of anyone taking the game seriously in any moment.\n\nMost premades I have to play with act like idiots on top of feeding and trolling. \n\nRiot is trying to force people into gathering in premades for playing, and only because of some shoddy study that says that people that play with friends have a 0.0005% more chances of buying things with cash. Not the ''less toxiciness'' they parade around.","replies":[{"poster":"DeynaTaggerung","date":"2016-06-01T00:19:58.267+0000","up_votes":10,"down_votes":5,"body":"No, those are the premades you notice, they stick out because you don't like their attitude. There's actually a lot of premades that are pretty low key about it and you just don't notice they're in your game. Also a lot of solo players feed and troll because they're angry at everyone else. Pre-mades are probably less likely to because it means that everyone in the group has to be ok with it or else the others will tell him to calm down or drop him/her from the group.","replies":[{"poster":"Wheatloaf","date":"2016-06-01T00:35:17.167+0000","up_votes":9,"down_votes":4,"body":"People complain now about premades trolling. Used to be a never-ending torrent of complaints about random solo/duos trolling. Trolls will be trolls, that's not DQ's fault, and there are systems in place to weed them out of the game.","replies":[]}]}]}]},{"poster":"CaptainMårvelous","date":"2016-06-01T01:06:27.471+0000","up_votes":2,"down_votes":0,"body":"Naw, I'm pretty sure the MOBA market has stagnated and people aren't interested anymore.\n\nWhile League won't reveal player statistics, DoTA2's kinda plateau'd at around 13 million players and common logins slowly going down.  SMITE and HotS probably experience the same thing. A new moba coming out would be like an MMO coming out in 2009/2010.\n\nIf Overwatch/Battleborn are as successful as we assume they might be, those games will take over. As it is now, the general interest in mobas has stagnated and I highly doubt anyone is interested in making or picking up a new one. Maybe in a few years but none of them are gonna last. It's the MMO bubble all over again.","replies":[]}]},{"poster":"Crowe Stalker","date":"2016-05-31T21:53:51.554+0000","up_votes":12,"down_votes":2,"body":"It's nice of them to finally say, definitively, that SoloQue is not coming back. Honestly it's probably better this way, but obviously one has to wonder if Riot will ever find a way to make SoloQueuers happy, like some method to affect LP based on you queueing by yourself (maybe reduction of lost LP as a way to say 'Sorry your team was shit.' ? )","replies":[]},{"poster":"Antonok","date":"2016-05-31T22:57:58.590+0000","up_votes":9,"down_votes":1,"body":"My thoughts are: What in the...?\n\nYou say you want to promote partying/queing with friends, but only in low level play. ...okay...\n\nAnd then you say you want to prioritize champion selection... except you then go to say you're looking at implementing a 'forced selection' where you can get any role.\n\nOkay, so you want to force the new system until it doesn't work then implement the old system BECAUSE it worked while the new system doesn't...?\n\nI repeat: What in the fu....?","replies":[]},{"poster":"Ahristocats","date":"2016-05-31T21:41:01.094+0000","up_votes":7,"down_votes":0,"body":"yea i'm wondering if i should keep playing after coming back or not, probably came in the wrong season","replies":[]},{"poster":"Miraweave","date":"2016-06-01T00:04:13.283+0000","up_votes":9,"down_votes":2,"body":"I've made the decision to probably not play League anymore.","replies":[]},{"poster":"Aqamdax","date":"2016-05-31T22:11:27.604+0000","up_votes":9,"down_votes":2,"body":"I might be the only one, but I like playing solo...","replies":[{"poster":"DJ S0NA","date":"2016-05-31T22:49:50.753+0000","up_votes":3,"down_votes":1,"body":"You are not the only one.","replies":[]}]},{"poster":"Academy Kayn","date":"2016-06-01T03:57:06.386+0000","up_votes":5,"down_votes":0,"body":"A lot of comments in this post give me hope back for the sensible part of the community T~T.","replies":[]},{"poster":"Praetor Don","date":"2016-05-31T23:16:35.142+0000","up_votes":5,"down_votes":0,"body":"Sadness","replies":[]},{"poster":"Snow Tea","date":"2016-05-31T23:08:52.230+0000","up_votes":9,"down_votes":4,"body":"we don't care... cuz we got overwatch now","replies":[]},{"poster":"Packun Flower","date":"2016-05-31T22:07:58.336+0000","up_votes":9,"down_votes":4,"body":"I have already uninstalled.\n\nLater folks.","replies":[]},{"poster":"Phoenix Kotori ","date":"2016-05-31T21:44:02.900+0000","up_votes":9,"down_votes":4,"body":"If you want solo queue just git gud & get diamond xD! {{sticker:slayer-jinx-wink}}","replies":[]},{"poster":"PixTron","date":"2016-06-02T05:42:17.726+0000","up_votes":3,"down_votes":0,"body":"\"We-we 'screwed' up, w-well we didn't ac-actually... bu-but it's YOUR fault, stupid fanbase! Fuck off! We got your money now, whatcha gonna do it?\"\n\n-Riot 2016","replies":[]},{"poster":"Glîtchy","date":"2016-06-01T14:08:32.489+0000","up_votes":3,"down_votes":0,"body":"My thoughts.....\n\nScrew that bullshit.","replies":[]},{"poster":"Kudrov","date":"2016-06-01T18:09:43.895+0000","up_votes":4,"down_votes":1,"body":"In the Video, Lobbster, the main dev for DynamicQ said : \"we never had that much peoples playing ranked right now\" to trying to tell us there never been that much players playing since DynamicQ come out like it was a great thing. \n\n well no shit sherlock whats left? \n\nSoloQ GONE, Ranked's 5 GONE, TwistedTreeline ranked GONE, TeamBuilder GONE, Dominon GONE. \n\nis it me or the next STEP is League of Legend GONE.","replies":[{"poster":"The Illithid","date":"2016-06-01T20:50:35.319+0000","up_votes":2,"down_votes":2,"body":"Going to every single DQ thread and copy-pasting the same thing is ridiculous. Have my downvote, sir.","replies":[{"poster":"Kudrov","date":"2016-06-01T20:59:43.208+0000","up_votes":2,"down_votes":0,"body":"so its mean you gone urself in every single DQ thread, i am glad you did, get my upvote sir.","replies":[]}]}]},{"poster":"Large Minivan","date":"2016-05-31T22:54:34.896+0000","up_votes":4,"down_votes":1,"body":"rip solo q","replies":[]},{"poster":"Dominick Destine","date":"2016-06-01T02:44:07.896+0000","up_votes":7,"down_votes":4,"body":"Leaving the game after 6 years .\n\nThis is not arbitrary, check my post history and I was one of the many that was very stoked about them announcing True Solo Queue after Dynamic Queue. They betrayed us .... I never liked Forced Team Queue (aka Dynamic Queue) , it ruined the game for me. It's over, I'm moving to another game and it makes me sad, but Riot made it clear they do not care about solo players, so fuck 'em.","replies":[]},{"poster":"ExcitableOyster","date":"2016-06-01T04:38:53.124+0000","up_votes":2,"down_votes":0,"body":"I get exponentially more toxic when I'm a solo guy playing with other 3/4 mans. Trying to control that anger but it just doesn't help. Its not really a fun game anymore if I'm only abusing my sanity by playing it alone. Gotta wait for friends to get online or I just can't seem to find an enjoyable match.","replies":[]}]}