{"poster":"IPMasters gUG","date":"2018-04-10T11:08:24.144+0000","title":"Divison 2 Team II Sucht Dia 4+ Mid laner und Top lane Bewerbungen","subforum":"Clans & Teams","embed":{"description":"Bewerbungen","url":"https://docs.google.com/forms/d/e/1FAIpQLSfTnDFrZ6rr99pVLuj2Fhb0P0WgAeWOujD7xWEMhMZQlDJZtw/viewform","image":"https://lh4.googleusercontent.com/t8F1GmgrOt7IAHoeRNdA0sefa4Do9_LKw8r5Hdz9J73dzUjaU1m8bv7kvyxW9NVgGZ4=w1200-h630-p"},"up_votes":1,"down_votes":0,"body":"UM SICH ZU BEWERBEN EINFACH DAS FORMULAR AUSF&Uuml;LLEN LEUTE AN DEN INTERESSE BESTEHT WERDEN GEADDET(von IPM Faker)\r\nAlle Bewerbungen werden sich am 10.04 angeguckt und sich auch am selben Tag noch gemeldet\r\n\r\nGuten Tag,\r\n\r\n(es folgt eine kurz Fassung und am ende noch infos)\r\nWir suchen noch &quot;High Elo&quot;-spieler und Coaches / Analysten f&uuml;r unser Team und Projekt.\r\nDas Ziel ist Division 2 zu erreichen in 7 Wochen (wer es nicht wei&szlig; wird noch erkl&auml;rt).\r\nDazu haben wir einen Sponsor, einen LCS Analysten, ein professionelles Logo, einen Bootcamp Partner wo wir kostenlose Bootcamps machen k&ouml;nnen und einen Trikot Sponsor.\r\n\r\nDas Team an sich besteht schon seit &uuml;ber 9 Monaten.\r\nAber da wir seit letzter Woche einen Sponsoren haben und Spieler gegangen sind (weil sie unzuverl&auml;ssig waren oder private Gr&uuml;nde)\r\nwollen wir ab der n&auml;chsten Woche mit einem neuen Roster durchstarten und die Divison 2 erreichen.\r\n\r\nAktuell fest im Team sind:\r\nEin D3 Jungler, D3 Top laner, D2 Adc und ein supporter.\r\nCoach ist ein Ex Analyst von Schalke 04 und ein Analyst von ESG. Beide werden bezahlt und sind f&uuml;rs team angestellt.\r\n\r\nBewerbungen werden gesucht f&uuml;r Mid lane.\r\nEbendso Coaches und Analysten (dabei auch Coaches f&uuml;r die Spieler an sich und f&uuml;rs Team)\r\n(Da wir einen Sponsoren haben besteht die M&ouml;glichkeit Gehalt zu zahlen\r\noder einen Bonus wenn wir das Ziel erreichen an die Analysten und Coaches).\r\n\r\nWeitere Infos und was wir erwarten von dir:\r\n\r\nDie Division 2 ist eine Esports Liga die eine unter der Division 1 liegt und so mit die erste ESL Liga ist wo\r\nTeams wie ESG und NOWAY4u spielen und wo am 07.04 live das Finale statt findet. Die Qualifizierung da zu ist in ca. 8-10 Wochen.\r\nDarauf soll auch hin trainiert werden.\r\nDie Trainingseinheiten bestehen aus 2 Scrims die Woche, 1 Tunier, eine Theorieeinheit und eine Flex q einheit.\r\n(eine Einheit geht ca. 3h).\r\nDie Elo der aktuellen Spieler in der zweiten Divison geht zwischen Platin 5 und Master wobei der durchschnitt bei Dia 4 liegt.\r\nBewerber &uuml;ber dem durchschnitt sind gerne gesehen.\r\nDu solltest im alter von 17-22 Jahren sein, Ts besitzen, ein Team Spieler sein und das selbe Ziel verfolgen\r\nund gen&uuml;gend Zeit mit bringen.\r\n\r\nBei weiteren Fragen mich gerne adden.","replies":[]}