{"poster":"NoElo4Cello","date":"2018-03-02T19:25:37.538+0000","title":"Team \"Blue Marlin\" sucht neuen Top/Mid/Supp","subforum":"Clans & Teams","embed":{"description":"Real-time LoL Stats! Check your Summoner, MMR, Live Spectate and using powerful global League of Legends Statistics!","url":"http://euw.op.gg/multi/query=justintlme%2Cr%C3%B8swell","image":"http://opgg-static.akamaized.net/images/logo/2015/reverse.rectangle.png"},"up_votes":1,"down_votes":0,"body":"Halle Leute,\r\n\r\nwir sind der Cello (ADC) und der Tobi (Jungle) und gr&uuml;nden aktuell unser neues Team.\r\n\r\nCello wird der Leiter des Teams sein und besitzt bereits Erfahrung als Manager in einem E-Sport Verein, als Coach f&uuml;r unter anderem Diamond Teams und auch als Leiter diverser eigener Teams.\r\n\r\nUnser Hauptziel wird es sein als Team gemeinsam im Macro Play zu improven sodass wir auch m&ouml;glichst erfolgreich an Turnieren teilnehmen k&ouml;nnen.\r\nWir wollen unterschiedliche trainingsarten durchf&uuml;hren damit sich jeder einzelne im Team soweit wie m&ouml;glich weiterentwickeln kann.\r\nDesweiteren wird nat&uuml;rlich auch die Solo/Flex Q nicht vernachl&auml;ssigt werden!\r\nInsgesamt wird es keine konkreten Ziele geben sondern eher auf der Basis kurzfristig erreichbarer Ziele gearbeitet um die Langzeit Motivation am Laufen zu halten.\r\nTrainingszeiten/ Trainingspl&auml;ne etc werden w&ouml;chentlich mit Hilfe einer Doc Datei geplant und an jeden weitergegeben.\r\nZiel wird es mind. 2-3 die Woche zu trainieren!\r\n\r\nUnsere Anforderungen an euch:\r\n\r\ndas Alter ist grunds&auml;tzlich egal solange die Zuverl&auml;ssigkeit, Kritikf&auml;higkeit und Kmmunikation stimmt\r\nElotechnisch solltet ihr in der Solo Q mind. Gold 2 sein und maximal Plat 3 damit das Gef&auml;lle nicht zu gro&szlig; wird\r\nman sollte an eurem OP.GG Link erkennen das ihr auch die entsprechende Rolle maint f&uuml;r die ihr euch bewerbt\r\nChampion Pool sollte soweit erstmal Teamranked f&auml;hig sein mit vorhandenen Pocketpicks und grunds&auml;tzlich sollte ihr bereit sein euch entsprechend anzupassen\r\nWhats App, Teamspeak und ein funktionierendes Headset muss vorhanden sein\r\ndie Support Bewerber m&uuml;ssen Shotcall Erfahrung besitzen\r\n\r\nTryoutablauf:\r\nPhase 1: aus allen Berwerbern werden pro Rolle 3 Spieler ausgew&auml;hlt mit denen wir Tryoutgames durchf&uuml;hren nach deren dann 2 Spieler eine Runde weiter kommen\r\nPhase 2: weitere Tryoutgames diesmal aber mit den entsprechend ausgew&auml;hlten Spielern auf den jeweiligen Rollen nach denen wir uns dann schlussendlich f&uuml;r die neuen Teammember entscheiden\r\n\r\nSollten wir euer Interesse geweckt haben bzw sollten fragen aufgetreten sein f&uuml;hlt euch so frei und addet den Cello unter folgendem Account: R&oslash;swell\r\nAufgrund von entsprechender Arbeit kann nicht jede Anfrage sofort beantwortet werden! Wir geben uns M&uuml;he es schnellstm&ouml;glich zu tun.\r\nWer gerne mit uns in Zukunft im Team &quot;Blue Marlin&quot; zusammen spielen m&ouml;chte schickt in seiner ersten Nachricht bitte seine rolle und seinen OP.GG Link!\r\n\r\nGru&szlig; Marcel und Tobi","replies":[]}