{"poster":"CyperLina","date":"2015-11-08T22:14:26.677+0000","title":"A ki leavelt vagy afk-os emberek elleni probléma megoldása!?","subforum":"Általános beszélgetés","up_votes":4,"down_votes":3,"body":"Sziasztok! \r\nVan egy &ouml;tletem, amit szeretn&eacute;k megosztani veletek. B&aacute;r nem tudom mennyire megval&oacute;s&iacute;that&oacute;, ha esetleg tetszik az &ouml;tlet szavazzatok a topic-ra , hogy t&ouml;bb ember is l&aacute;thassa! Rem&eacute;lem egy magyar Riotoshoz is eljut ez az &ouml;tlet. ( pl  RIOT DAEDALUS-hoz.)\r\nSz&oacute;val: Biztos veletek is előfordult m&aacute;r, hogy j&aacute;t&eacute;k k&ouml;zben kil&eacute;pett  egy j&aacute;t&eacute;kos &eacute;s ott hagyta a csapatot,  pl a 19.  percn&eacute;l, vagy a j&aacute;t&eacute;k kezdete &oacute;ta &quot;nincs g&eacute;pn&eacute;l&quot;  &iacute;gy adott esetben nehezebb j&aacute;tszani az ellenfeleink ellen + egy eg&eacute;sz lane kiesik. Persze ilyenkor nem tudunk mit tenni, max a j&aacute;t&eacute;k v&eacute;g&eacute;n jelenthetj&uuml;k Afk miatt. De att&oacute;l m&eacute;g  az a 4 ember j&aacute;t&eacute;k &eacute;lm&eacute;nye rossz maradt.\r\nMi lenne, ha  ilyenkor (a meccs k&ouml;zben) ann&aacute;l a csapatn&aacute;l, akik ember h&aacute;tr&aacute;nyban szenvednek,  az adott ember  hely&eacute;re lehessen egy &uacute;j j&aacute;t&eacute;kost keresni, aki majd becsatlakozik a  m&aacute;r megl&eacute;vő j&aacute;t&eacute;kba?!  \r\nAmit m&eacute;g &aacute;t kell gondolni ebben az eg&eacute;szben az az , hogy  az &uacute;j j&aacute;t&eacute;kos mondjuk sikeresen becsatlakozik &quot;Top lane-re&quot; az x . percben a csapatnak megfelelő szinttel &eacute;s golddal rendelkezzen , hogy fel tudja venni a harcot.\r\nMi a v&eacute;lem&eacute;nyetek erről az &ouml;tletről ?","replies":[{"poster":"Nerdcore HuN","date":"2015-11-08T22:36:27.667+0000","up_votes":5,"down_votes":0,"body":"Ezzel van pár igen komoly probléma, megpróbálom összeszedni\n1. Megtörténhet , hogy az akit behív , épp nem tud az adott championnal játszani....\n2. Mi van , hogyha épp azért lépett ki az illető, mert előtte szétfeedelte az agyát. Gondolom te sem örülné neki hogyha a laneden egy 10:0 zed mosolyogna rád hogy \"mivan haver , jöttél? \"\n3. Mi van, hogyha egy vesztes menetbe csatlakozik be az illető a 19. percben és a 20.ban már surrendelnek? Gondolom te sem tartod fairnek , hogy 1 perc miatt kapjon mondjuk -20lp-t, csak azért mert nem jó a rendszer.\n\nErre a problémára már kitaláltak egy jó megoldást, csak a riot nem hajlandó betenni...úgy hívják Game abandon","replies":[]},{"poster":"Looter","date":"2015-11-09T08:31:57.825+0000","up_votes":6,"down_votes":1,"body":"> [{quoted}](name=Looter,realm=EUNE,application-id=YzZuykbk,discussion-id=Itk4rZzt,comment-id=0004,timestamp=2014-05-17T11:07:20.563+0000)\n>\n> Mielőtt kiragel a játékos, eladja mindenét, vesz 6000 potiont, eladja azokat is . lenullázza a goldját. Ha meg ugyannyi goldot kap az új játékos, mint amennyit összefarmolt volna, akkor\n> \n> a. nem farmol aki nem jött be a játékba nincs pénz\n> \n> b. több goldot kap, akkor egyenlőtlen a játék\n> \n> c. megkapja azt a goldot amit összefarmolt, teljesen mást épít, megborul a játék folyamata, mert addig mondjuk tankot épített, az ellenfél ehhez megfelelően épített. bejön az új játékos és full ad t vagy full ap t épít, vagy fordítva.\n> \n> d. bot jönne be az meg szénné feedeli az enemy t.\n> \n> Totálisan semmi értelme az egésznek, csak többet rontana a meccseken mint most.\n> Kilépett. Ennyi.\n> \n> Ha bejön más helyette, akkor meg azt kifogásolják majd az emberek, hogy.\n> \n> a. sokkal jobb játékost dobott be az előzőnél, fos a matchmaking.\n> \n> b. jaj azér kaptunk ki mer ígyis nem volt 2 percig 5. emberünk ezért kaptunk ki.\n> \n> c. ugyanolyan gyökeret dobott be mint az előző mér ilyen szar a matchmaking :'(\n> \n> d. szar masteryje volt annak aki helyére bedobott, szar rúnái voltak aki helyére bedobott. így nemlehet játszani\n> \n> e. az új játékos akit bedobott tök más masteryvel meg rúnával van ez így nemér.\n> \n> Remélem kicsit most már jobban átlátjátok a problémát ezzel a pótoljuk a kilépett embereket dologgal.\n> \n> Inkább taktikákat kéne tanulni, hogy mit kell csinálni ilyen helyzetekbe, ugyanis megoldhatóak.","replies":[]},{"poster":"Shikaichi","date":"2015-11-08T22:49:58.964+0000","up_votes":3,"down_votes":0,"body":"Tudtam, hogy megint ezt az ötletet fogják fölhozni, amit már megbeszéltünk, hogy nem működne. Most gondolj bele, hogy hirtelen belekerülsz egy vadidegen játékban. Dunsztod sincs, hogy eddig mi történt és mit kellene tenned, lehet kapsz aranyat, hogy tudj vásárolni, de azt sem tudod milyenek valójában az ellenfeleid, így nem is tudsz ellenük védekezni. Persze lehet mondjuk a látatlanban is tárgyakat venni és mondjuk adott hősök ellen építeni, de én általában az ellen szoktam, aki elég OP. És nem mindig az az OP, aki sokat ölt meg alig halt.","replies":[]},{"poster":"M4dr4c","date":"2015-11-08T22:28:24.055+0000","up_votes":3,"down_votes":0,"body":"Már volt róla szó többször és akkor részletesen ki is elemeztük, hogy miért nem megvalósítható és mik a fő gondok vele.","replies":[]},{"poster":"ApeandEssence","date":"2015-11-08T23:25:47.778+0000","up_votes":2,"down_votes":0,"body":"Sziasztok!\nSzerintem nem rossz az ötlet. \nHa jelezné a játék milyen champet kéne irányítanod, mi a meccs statisztikája, belenézhetnél a specbe előtte akkor vállalható. \nA meccsek kimenetele pedig nem vonatkozna a \"tartalékos\" játékosra, csak valamilyen jutalmat kapna meg gondolom egy rakat honort a többiektől.","replies":[{"poster":"Kyat Pawston","date":"2015-11-09T06:29:15.435+0000","up_votes":1,"down_votes":0,"body":"Nem akarok vitát indítani, de ennek is egy pár óriási hibája lenne, megpróbálom összefoglalni:\n1. a jutalmak még mindig nincsenek így tisztázva... hiába a \"-lp\" nem vonatkozna rá, de 1 percért kap 40-50 IP-t? kicsit unfair-nek érezném.. ha pedig ezt se kapna, itt jön a 2. probléma ->\n2. miért akarna az illető nyerni? amúgy is vannak úgymond \"trollkodó\" / unatkozó emberek, akik már csak azért is bejönnek feedelni, nem? ez szerintem teljesen reális lenne, na és akkor a 3.\n3. az, hogy akárhogy számolunk, nem lehetne annyi aranyat adni az embernek, amennyit ő érne el alapból... lehet hogy egy teljesen farmra képtelen ember csatlakozik be, így hát ha többet adnának, és átlaggal számolnának, akkor erősebb lenne, a kelleténél.. viszont ha valaki a 20. percre 200 farmmal rendelkezik (lehetséges :D) akkor annak az átlag miatt kevesebb aranyat kapna :/\nAkárhogy nézzük, szerintem ez egy nem kivitelezhető rendszer lenne, talán az alattam írt \"Game Abandon\" rendszer lenne erre a megoldás, de az se biztos... afk mindig is volt, most is van, és lesz is... ezzel sajnos nincs mit csinálni! ^^","replies":[{"poster":"ApeandEssence","date":"2015-11-10T14:23:32.724+0000","up_votes":1,"down_votes":0,"body":"- Az átlagon van a hangsúly. Kapna egy perchez illő átlag goldot (ha többet farmolt a leavelő annyit, ha kevesebbet az átlagot).\n- Nem RP-re gondoltam hanem +IP-t, vagy ip boosot pár meccsre, hasonlót (Szezon végén keretet, vagy kitűzőt vagy mi az istennek hívják ami régen volt honorból).\n- A mást épít mint aki leavelt dolgot alapból nem értem, nyilván azt építene ami szükséges, ha meg nem akkor is jobb mint egy 4v5. \n- A trollkodókat megint nem értem, ha már valaki leavelt, nem mind1, hogy jön még egy helyette a teamszempontjából?  \n- Valamint lehetne egy kick rendszert beépíteni, ha tényleg csak ront a helyzeten a beugró, valamint van mikor 4v5-ben is le lehet hozni egy gyengébb csapat ellen a szint előny miatt, akkor is meg lehet ezt tenni.\n- Valamint kiegészíteném egy meghívásos dologgal, hogy barátlistáról lehessen hívni valakit segíteni. \n\nSzerintem életképes lehet a dolog, ha végig gondolják az opciókat.","replies":[]},{"poster":"M4dr4c","date":"2015-11-09T10:05:37.960+0000","up_votes":1,"down_votes":0,"body":"Game Abandon NEM megoldás. Akkor lenne megvalósítható, ha mondjuk legalább nyolc ember elfogadná, igen, az ellenfél is szavazna. Na most komolyan úgy gondolod, hogy egy átlagos meccsben lenne három olyan ellen, aki eldobná az ingyen LP-t a fairplay érdekében? Mert én nem.","replies":[{"poster":"Kyat Pawston","date":"2015-11-09T14:36:41.159+0000","up_votes":1,"down_votes":0,"body":"Háát, ezért se mondanám, hogy az egy tuti biztos módszer lenne, bevallom, én nem gondoltam ebbe bele, de most hogy mondod, igaz :) ezért is, erre nincs megoldás.. el kell fogadni, ennyi :D ^^","replies":[]}]}]},{"poster":"CyperLina","date":"2015-11-08T23:33:15.701+0000","up_votes":1,"down_votes":0,"body":"Na ez tök jó Tovább vezetted a gondolat menetemet ! .{{sticker:slayer-pantheon-thumbs}}","replies":[]}]},{"poster":"Asztirész","date":"2015-11-15T12:44:47.908+0000","up_votes":1,"down_votes":0,"body":"Nos, én is akartam kommentet írni de aztán láttam hogy igazából már mindent leírtak. Úgyhogy inkább csak összeszedek egy Pro/Kontrát az itt elhangzottakból: Pro: Az alapötlet jó, jól is hangzik, és mondhatni megoldaná a problémát. Kontra: A gold illetve IP probléma, ill. ha valaki belép egy meccsbe azt ő választja ki hogy milyen legyen? Melyik stat milyen champ? Mert egy 0/5 ös AP Dariust senki nem vállalna be. Ill. kinek lenne kedve belépni egy 40 p-nél tartó meccsbe ahol még csak lvl 1-es? Hapedig nem tudja hogy milyen champ-el fog az Igazság mezőire lépni, akkor simán lehet hogy kikap egy olyat akivel az életben nem játszott (és lehet hogy még a rúnái és m. se stimmelnek). És az utolsó ok ami miatt ez a rendszer nem műkődne: Ha te mondjuk vagy egy 10/0-as Vayne és 2 percre elmegy a net akkor már nem tudsz visszalépni? És csak mellékesen 4v5-ben simán lehet nyerni ;)","replies":[]},{"poster":"BlackH4wkDown","date":"2015-11-09T16:37:55.623+0000","up_votes":1,"down_votes":1,"body":"Ezzel rengeteg hiba van de az alap ötlet nem is lenne rossz, mármint hogy azt a csapatot segítsük, aki \"szarban van\"... Inkább arra gondoltam hogy aki valamilyen oknál fogva kilép a játékból 10 percnél tovább, az ne is tudjon vissza lépni, mivel nem is egyszer találkoztam olyannal, aki \"rendes\" volt mert visszajött.. 20 perc után..és nem tudott mit kezdeni 4 szinten a 30. percben, szinte 0 arannyal (mivel kimaradt neki a farmja). ezért kéne ilyenkor csapat bennmaradt maradék tagjai előnyöket kapjanak:\n1, kapjanak több aranyat 10 másodperc alatt az átlagnál, hogy a kiesett embert kárpótolni lehessen.\n2, plusz tapasztalatpontot farmért, toronyért, és amiért lehet alapból tapasztalatot kapni.\nEzzel a kis változtatással azt mondom hogy lenne értelme, mivel a csapat pont annyi előnyhöz jutna mint hátrányhoz.\n{{sticker:slayer-jinx-catface}}","replies":[{"poster":"ApeandEssence","date":"2015-11-10T14:35:48.255+0000","up_votes":1,"down_votes":0,"body":"- A bent maradt játékosakat a játék ne segítse! \n- A fent írt  kommentemet idézve, gyengébb csapat ellen le lehet hozni 4v5-t a szint előny miatt.\n- Megfordítva is meg lehet közelíteni, ha pont te játszol 4 ellen, de egyszerűen ügyesebbek, a te teamed pedig gyengélkedik akkor jogtalan + aranyt kap ezt tetőzve a papíron gyengébb csapat.... \n(Pont tegnap jártam úgy,hogy 4 ellen nyomtam, de a teamem nagyon nem hozta a kötelezőt, sőt -> Az enemy support tankként 2x többet sebzett mint a mi adc-nk a meccs folyamán).","replies":[]}]},{"poster":"UOL Wolfie","date":"2015-11-09T17:27:58.441+0000","up_votes":1,"down_votes":0,"body":"Valamit kéne velük mostmár kezdeni, elegem van a trollokból, csak a hülyeséget csinálják, elvileg elég sok bannolva lett, ehhez képest napi 8 meccsből 5 mecsen legalább van 1 db.\n\n(Pár percel ezelőtti ranked game: [](http://kepfeltoltes.hu/151109/330883830N_vtelen_www.kepfeltoltes.hu_.png)","replies":[{"poster":"lucky hunter2014","date":"2015-11-09T18:36:22.975+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=UOL Wolfie,realm=EUNE,application-id=VFnq5EbB,discussion-id=ARfGMl0W,comment-id=000b,timestamp=2015-11-09T17:27:58.441+0000)\n>\n> Valamit kéne velük mostmár kezdeni, elegem van a trollokból, csak a hülyeséget csinálják, elvileg elég sok bannolva lett, ehhez képest napi 8 meccsből 5 mecsen legalább van 1 db.\n> \n> (Pár percel ezelőtti ranked game: [](http://kepfeltoltes.hu/151109/330883830N_vtelen_www.kepfeltoltes.hu_.png)\n\nKinek van ideje napi 8 meccsre?","replies":[]}]},{"poster":"DanielCz","date":"2015-11-09T17:49:10.025+0000","up_votes":1,"down_votes":0,"body":"{{sticker:zombie-brand-mindblown}} \nMinek? Ezt már kifejtettem miért nem érdemes az AFK-ok miatt sírni. Mert ez az. A recept 4v5 van mégis carry-zni kell. Egyáltalán nem lesz rosszabb a a játékélmény emiatt, sőt ha megnyeritek akkor még jobban fog esni a győzelem. Ha meg vesztettetek akkor meg hát...van ilyen....\nAnnyi a negatív embert, hogy az már fáj","replies":[]},{"poster":"Orbán the Viktor","date":"2015-11-09T16:49:10.959+0000","up_votes":1,"down_votes":0,"body":"Már nemazért de ez hülyeség. Van olyan, hogy kilépnek emberek, de erről nem ők tehetnek (pl gyenge net stb).\nVannak olyanok akik kiragelnek, velük ne is foglalkozz muteold le őket és játsz tovább ezt meg kell szokni.\nAz, hogy játék közben becsatlakozzon egy másik játékos az egy nagy baromság szerintem és nem fair a játékosnak sem aki becsatlakozik, boccs ha durva voltam.","replies":[]},{"poster":"Robag21HUN","date":"2015-11-09T15:21:21.760+0000","up_votes":1,"down_votes":0,"body":"Mi is ezt találtuk ki az osztálytársaimmal, de rájöttünk, hogy nem működne túl jól. Sokan trollkodnának.","replies":[]},{"poster":"mmateexd","date":"2015-11-09T15:09:49.910+0000","up_votes":1,"down_votes":0,"body":"És ezt te hogy oldanád meg??? Lenne egy külön funkció amivel lehetne csatlakozni a ranked meccshez vagy mi??? Szóval érted mire gondolok...ha valaki pl.rankedezni akar akkor amíg vár hogy meglegyen a 10 ember akkor addig random behívhatja a várakozó embert rankedra vagy mi???\n\nMásik gond ezzel, és szerintem nem csak én vagyok így hogy nem szívesen játszanék már alapból hátrányban lévő csapattal. Mert most tegyük fel hogy valaki elfeedeli a midest/topost és utána lelép. Jövők én a helyére de kb semmit sem tudnék vele kezdeni mert hatalmas item előnye van hozzám képest, és nem hiszem hogy a csapatom is olyan pozitívan állna hozzá a dologhoz.","replies":[]},{"poster":"Shiroe","date":"2015-11-09T10:26:43.949+0000","up_votes":1,"down_votes":0,"body":"Az ilyenek 50%a már a játék első másodpercétől kezdve nincs és nem is lesz, itt ilyenkor semmi gond nem lenne azzal ha a játék állna 2percet mig be joinol az új ember kezdés előtt.","replies":[]},{"poster":"SupraKid13","date":"2015-11-09T06:24:04.542+0000","up_votes":1,"down_votes":5,"body":"Vagy valami Intermediate botot beraknak, mint CS:GO-ba ha kilépnek.","replies":[{"poster":"M4dr4c","date":"2015-11-09T10:04:03.963+0000","up_votes":1,"down_votes":0,"body":"Ja és CSGO-ban is csak azért működik, és elég rosszul akkor is, mert meg lehet neki mondani, hogy maradjon a kezdőn és át lehet venni felette az irányítást, ha meghalsz.\nA botnál még az is jobb, ha az illető a kezdőn áll...","replies":[]},{"poster":"lucky hunter2014","date":"2015-11-09T18:31:38.044+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SupraKid13,realm=EUNE,application-id=VFnq5EbB,discussion-id=ARfGMl0W,comment-id=0004,timestamp=2015-11-09T06:24:04.542+0000)\n>\n> Vagy valami Intermediate botot beraknak, mint CS:GO-ba ha kilépnek.\n\nBronz 4 fölött egy intermedite botot röhögve elvernek ap rivennel is","replies":[]}]}]}