{"poster":"RainDropsDown","date":"2018-05-12T22:03:29.880+0000","title":"Bye League :(","subforum":"Allgemeiner Chat","up_votes":1,"down_votes":10,"body":"Hi Leute,\r\nh&auml;tte mir vor einem Monat jemand gesagt das ich League bald quitten werde, h&auml;tte ich ihn f&uuml;r ver&uuml;ckt gehalten. Doch nach langem Frust und mangeldem Spa&szlig; habe ich beschlossen das League f&uuml;r mich nun vorzeitig beendet ist. Ich wei&szlig; nicht ob ich wieder zum Spiel zur&uuml;ck finde doch im Moment l&auml;uft es auf ein dauerhaften Quit raus, leider. Ich bin auf meinem Weg durch diverse Videospiele immer auf negative Auff&auml;lligkeiten gesto&szlig;en, nur bei League toppt das nochmal alles. Anstatt so 1-2 kleine Makel gibt es aus meiner Sicht in League zu viele negative Aspekte. Ich werde versuchen hier ein paar meiner Hauptbeweggr&uuml;nde nennen, weswegen ich von League die Nase voll habe. Diese Punkte sind nat&uuml;rlich sehr subjektiv lastent, also kann das jeder selbstverst&auml;ndlich anders sehen.\r\n\r\nRanked:\r\nJo also ich w&uuml;rde sagen das Ranked der Hauptgrund ist warum ich League quitte. Ich bin S5 Hardstuck, habe &uuml;ber 200 Ranked Games (98 Siege/116 Niederlagen) und eine 46% Winrate.  Ich frage mich immer, warum versuche ich &uuml;berhaupt Ranked zu spielen?? Jedes Game ist gleich was die Teammates angeht. Jeder der schon mal in der gleichen Elo ist/wahr kennt diese H&ouml;lle hier. Keiner aus dem Team wei&szlig;t irgendeine Kompetenz vor, alle sind nur am Inten, Flamen, Feeden oder gehen AFK. IN JEDEM SPIEL. Selten habe ich Ranked Runden wo ich danach sage :,, Boah die Runde war echt geil&quot;. Jedes Game ist Stress pur. Man sieht nur wie das Team wieder das First Blood abgibt und die ersten schon sowas wie &quot; I go AFK&quot; oder &quot;Camp Bot or i troll&quot; schreiben.\r\nDer eigene Supporter ist nat&uuml;rlich autofilled und zeigt ein Spielstil von einem Bonobo. Der ADC ist behind, kann kaum farmen und ist in jedem Fight Useless. Der Jungler blendet jedes Objective aus und stirbt dumm beim Counterjungeln. Der Mid Laner spielt sowas wie Yasuo und Intet zweimal um die Erde. Dann kommt der Toplaner, der dann durch seinen dummen AFK Farmen und AFK Splitpushen das Team null unterst&uuml;tzen kann. Die besten Mates sind aber die, die sogar mal ihre Lane gewinnen und hohes Carry Potenzial aufweisen. Doch es endet damit das sie dumm greeden und nicht einmal in 100 Jahren den Namen Carry verdient haben. Das betrifft vorallem den ADC und Midlaner. \r\n\r\nAllgemein die Spielweise der Mates ist meistens sehr schlimm, da werden Spielz&uuml;ge ausgef&uuml;hrt, die schon beim einmaligen &Uuml;berdenken komplett dumm sind. Baron ohne Smite starten wenn der Gegner Jungler noch lebt, mit Low Level Gegner diven, ADC versuchen Assasinen zu 1v1 und keiner kennt den Begriff &quot; Save Spielen&quot;.  Hier mal meine Highlight Spieler aus meinen Letzten Games:\r\n\r\n\r\n(Zed Game)\r\nCamille: 6/9/5\r\nFiddlesticks: 3/8/13\r\n\r\n(Kha&#039;Zix Game)\r\nKatarina : 3/6/8\r\n\r\n(Tham Kench Game)\r\nTeemo: 2/11/12\r\nJhin: 6/9/10\r\nYorick: 6/9/8\r\n\r\nIch wei&szlig; das die Personen nen schlechten Tage gehabt haben k&ouml;nnen, trotzdem frustrierend solche Mates zu bekommen. Und wie gesagt es ist jedes Game so.\r\n\r\nMal allgemein zu mir, ich wei&szlig; ich habe auch oft schlechte Games. Nur der Unterschied zwischen mir und den oben genannten Beispielen ist, das ich versuche trotzdem in irgendeiner Art und Weise noch zur&uuml;ck ins Game zu finden. Ich geb mir weiter M&uuml;he um eventuell nachher im Late Game sogar noch usefull zu sein. Die Kollegen dort oben haben sich nichtmal bevor sie angefangen haben zu inten, M&uuml;he gegeben.\r\n\r\n\r\n\r\nEin n&auml;chster Punkt w&auml;re die MMR von League of Legends, hierzu gibt es ein sehr sch&ouml;nes Beispiel mit einem Riot Mitarbeiter.\r\nIch war in S5 und hatte eine S5 MMR (durchschnittlich) habe aber trotzdem +18 LP und -20 LP bekommen. Ich habe mich dann direkt an Riot gewendet wo mir dann gesagt wurde das die OP.GG MMR sehr ungenau sei und sie ihr MMR System aus diversen Gr&uuml;nden nicht ver&ouml;ffentlichen wollen. Also ernsthaft, das kann man doch nicht Ernst meinen. Naja was will man machen ?\r\n\r\nUnd zum Solo Carryn...\r\nMan als ADC zum Beispiel mindestens ein Top Laner und ein Supporter die einen hart protecten. Und das gibt es nunmal auf meiner Elo nicht, 1v9 findet gef&uuml;hlt nie statt. Man kann keine 4 Idioten gegen ein gutes stabiles Gegner Team Carryn. Kommt aus eurer Scheinwelt raus. Spielt alleine auf der Elo und bildet euch ein anderes Bild.\r\n\r\n\r\nOb ich in meine Elo geh&ouml;re ist Subjektiv, mir ist die Elo auch relativ egal geworden. Die Entt&auml;uschung war einfach zu gro&szlig;. Mir ist egal wie mich jemand Elotechnisch einsch&auml;tzt, hab von B5 bis P4 alles geh&ouml;rt, und es interessiert mich auch nicht viel. Ich w&uuml;rde mich auf S1- G3 sch&auml;tzen. Aber wie gesagt, das ist meine Meinung. Zumindestens vom Spielstil her denke ich, geh&ouml;re ich zu 0% in S5.\r\n\r\n\r\n\r\n\r\nPatch Notes:\r\nHach ja die Patch Notes. Der Grund warum ich jedes League Update hasse :) Viele Ver&auml;nderungen sind so un&ouml;tig. Mal ein paar Beispiele (Patch 8.9):\r\n\r\nRammus Buff ???\r\nSona Buff ???\r\nDr. Mundo Buff??\r\nGaren Buff???\r\n\r\nAlso man will das Rammus noch mehr zum &Uuml;bertank wird??\r\nMan will das Sona jetzt ein noch h&auml;rter von der Lane poked??\r\nMan will Mundo also echt jetzt zum Sustain Monster machen???\r\nUnd Garen, der einfachste und nervigste Top Laner braucht mit 50% Winrate ein Buff??\r\n\r\nSorry das ich das hier so dumm darstelle, aber diese Patch Notes verstehe ich nicht.\r\nUnd dann im vorherigen Patch Taliyah nerfen, GG.\r\nUnd Champions wie Miss Fortune, Illaoi, Nasus, Janna, Soraka und Nocturne dominieren in den Ranked Spielen jedes mal  O_O\r\n\r\n\r\n\r\n\r\nBelohnungen:\r\nIch finde es schade das ich im direkten Spiel nicht belohnt werde, ich krieg lediglich nach jedem Spiel +/- LP und XP f&uuml;r mein Champion und mein Spieler Level. Irgendwie w&auml;re wenigstens eine Season Belohnung angebracht, von mir aus sowas wie 10 Kisten am Ende der Season, oder einen Skin (max 1350 RP) den man sich aussuchen darf. Und au&szlig;er ein paar Blauen Essenzen und eventuell ein neuer Rahmen, krieg ich bei einem Level UP auch nicht. \r\n\r\n\r\n\r\nCommunity:\r\n\r\nDas Thema will ich nur kurz anschneiden, da die Ranked Spezialisten oben ja schon bisschen erkl&auml;rt wurden. Ich will hier sogar mal auf dieses Forum eingehen. Eine Sache die mich grundlegend st&ouml;rt ist, das hier jeder die Stats mit einbindet. Auf jede Frage oder auf jede Beschwerde wird mit den eigenen Stats geantwortet, ihr seht nicht wie die Einzelperson spielt oder weshalb er schlechte Stats hat. \r\nBeispiel:\r\n&lt;Nasus ist viel zu OP&gt;      --&gt; &quot; Du hast ingame einfach nur schlecht gespielt, du standest 6/8 das geht einfach gar nicht klar&quot;\r\n&lt;Ranked in Low Elo ist die H&ouml;lle&gt;  ---&gt; &quot;guck mal deine Stats an und dann reden wir weiter&quot;.\r\n\r\nUnd ja das sind echte Beispiele, aber hier kommen mal meine Lieblings Beispiele :\r\n\r\n\r\nNerf Inori pls : ja leider kann man aus einer Division 5 nicht so leicht gedownranked werden ansonsten w&auml;rst du bronze und jep deine aktuellen stat sind schlecht und nein nur weil man verloren hat hei&szlig;t es nicht das man schlechte stats hat klar kommt das vor aber es muss nicht sein.\r\n\r\n\r\nDirty Rat Abuser: Es hat nichts mit Pech oder &quot;Trolls&quot; zu tun. Du bist einfach schlecht auf ADC. H&ouml;r auf andere f&uuml;r deine Inkompetenz zu blamen.\r\n\r\nSuch die Fehler mal bei dir, anstatt bei anderen.\r\n\r\n\r\nSolche Typen ey. Anstatt einem mal wirklich zu helfen , beleidigen sie hart. \r\nAber sich dann selber &uuml;ber Flamer aufregen. Nice\r\n\r\nZuk&uuml;nftige Updates:\r\n\r\n\r\nJa also hier f&auml;llt mir grad die Idee mit dem neuen Elo System ein. Ein Elo f&uuml;r jede Lane. Really ???\r\nSowas dummes hab ich selten geh&ouml;rt. Meine G&uuml;te, also ein Platin 1 Mid Laner kommt in S4 auf der Top Lane. Man kann sich ja ungef&auml;hr vorstellen wo das hinf&uuml;hren w&uuml;rde... Selbst wenn das nicht durchgesetzt wird ( Was ich schwer hoffe), ist allein der Gedanke Cancer.\r\n\r\nOder die neuen ADC Items, habt ihr mal Jax oder Master Yi mit dem neuen Essence Reaver gesehen XD Totale Reset Zerst&ouml;rung.\r\nUnd warum nimmt man den Krit vom Infinity Edge runter? Wieso kommen so viele Ver&auml;nderungen? Ich kann Riot nicht verstehen, ich habe das Gef&uuml;hl das Riot diese Ver&auml;nderungen nur macht, um angeblich sich um ihre Community zu k&uuml;mmern. Wahrscheinlich... Kein Mensch will Beemo oder Pulsfire TF. Nehmt doch bitte passende Skins f&uuml;r Shen und TF und nicht sowas komplett unpassendes. Oder bringt mal Skins f&uuml;r andere Champions raus (Ivern, Camille, Lissandra, Taliyah, Aurelion Sol, Vladimir oder Heimerdinger). Es ist zwar in Planung, trotzdem versteh ich nicht wieso dann jetzt Pulsfire Riven und TF kommen. Pulsfire Camille w&auml;re so krass, oder Pulsfire Heimerdinger. Mir fallen gerade sehr viele Ideen dazu ein und ich versteh nicht wie Riot da so stur sein kann. Okay es geht ums Marketing, trotzdem w&auml;re es doch mal sch&ouml;n auf die Community einzugehen.\r\n\r\n\r\n\r\n\r\n\r\nSo dann will ich mal zum Ende kommen, ich wollte einfach nur mal kurz wiederspiegeln weshalb League f&uuml;r mich gestorben ist. Ich kann es selber kaum glauben aber es ist soweit. Ist mir eigentlich egal wie viel ihr hiervon lest.Viele Freunde von mir quiten auch gerade (ca. 4-5 St&uuml;ck) und so &auml;hnlich sieht es auch bei den Streamern und Youtuber aus. Mal sehen wann Riot aufwacht. Das waren meine Abschlussworte. Vielleicht finde ich irgendwann wieder ins Game zur&uuml;ck. Nur im Moment will ich mit dem ganzen nichts mehr zu tun haben. Jo ich verabschiede mich von euch.\r\nIch werde trotzdem auf eure Kommentare antworten, so lange sie respektvoll und fair sind. Und nein ich quitte League nicht f&uuml;r Fortnite XD\r\nMachts Gut :D\r\n\r\n\r\n\r\n{{champion:238}}","replies":[{"poster":"Izaya Kumiho","date":"2018-05-13T00:02:43.597+0000","up_votes":3,"down_votes":0,"body":">Hier mal meine Highlight Spieler aus meinen Letzten Games:\n(Zed Game)\nCamille: 6/9/5\nFiddlesticks: 3/8/13\n(Kha'Zix Game)\nKatarina : 3/6/8\n(Tham Kench Game)\nTeemo: 2/11/12\nJhin: 6/9/10\nYorick: 6/9/8\n\n\nSieht nach normalen KDA's aus. Der Fiddle hat deinem Teammates die Kills gegeben, bzw versucht sich an Kills zu beteiligen. Teemo ist..naja...Teemo.. happens ;P Der Rest hat nicht wirklich reingefeeded.\n\n\n> Die Kollegen dort oben haben sich nichtmal bevor sie angefangen haben zu inten, Mühe gegeben.\n\nVersuche es doch mal mit einem Premate oder Flex mit einer festen Gruppe. Wenn du dich in erster Linie mehr wegen den Randoms aufregst, solltest du dort etwas verändern.\n\n>Ein nächster Punkt wäre die MMR von League of Legends, hierzu gibt es ein sehr schönes Beispiel mit einem Riot Mitarbeiter.\nIch war in S5 und hatte eine S5 MMR (durchschnittlich) habe aber trotzdem +18 LP und -20 LP bekommen. Ich habe mich dann direkt an Riot gewendet wo mir dann gesagt wurde das die OP.GG MMR sehr ungenau sei und sie ihr MMR System aus diversen Gründen nicht veröffentlichen wollen. Also ernsthaft, das kann man doch nicht Ernst meinen. Naja was will man machen ?\n\nKönntest du uns den Redpost bitte zeigen?\n\nWenn dein Win/Lose-score ungefähr gleich ist, bist du laut MMR-rechnung auf dem richtigen Fleck. Dazu kommt noch, wie stark deine Gegner sind.\nGewinnst du gegen ein Team, welches schlechter als dein eigenes Team ist? Dann bekommst du weniger Punkte, als bei einem Sieg über einem stärkeren Enemyteam.\n\nVerlierst du gegen ein Team, welches schwächer sein sollte, so wirst du slightly mehr Punkte verlieren.\n\nOP.GG ist extrem ungenau, weil die Seite geschätzte MMR's anhand vieler Games und unbestätigten MMR-lines (z.B. Gold5=1600 mmr) errechnet.\n\nAußerdem verstehe ich deine Reaktion nicht ganz... \nDu gehst zu Riot, weil ein Drittanbieter dir erlogene Zahlen rausgibt? \nWarum hast du mit der Logik nicht zuerst Google gefragt? \nDa gibt es Tausende, die nicht den Unterschied zwischen **Riot Games** und **Drittanbietern wie OP.GG etc** kennen. \nDas hätte sowohl dir, als auch dem Riotmitarbeiter Zeit gespart. =^._.^=\n\n\n>Man als ADC zum Beispiel mindestens ein Top Laner und ein Supporter die einen hart protecten. Und das gibt es nunmal auf meiner Elo nicht, 1v9 findet gefühlt nie statt.\n\nLeague of Legends ist ein Teamspiel. Wenn niemand aus deinem Team den Solocarry spielen kann, muss halt ein 5on5 gewonnen werden. \n¯\\_(ツ)_/¯\n\n> Ich würde mich auf S1- G3 schätzen. Aber wie gesagt, das ist meine Meinung. Zumindestens vom Spielstil her denke ich, gehöre ich zu 0% in S5.\n\nówó\n./inhales\n...\noh boi..\n\nIch denke mir einfach meinen Teil dazu.\n\n\n>Irgendwie wäre wenigstens eine Season Belohnung angebracht, von mir aus sowas wie 10 Kisten am Ende der Season, oder einen Skin (max 1350 RP) den man sich aussuchen darf. Und außer ein paar Blauen Essenzen und eventuell ein neuer Rahmen, krieg ich bei einem Level UP auch nicht. \n\n...\nᶰᵃʲᵃ, ʷᵉᶰᶰ ᵈᵘ ᵈᶦᶜʰ ᵃᵘᶠ ᴳᵒᶫᵈ⁻ᶫᵉᵛᵉᶫ ˢᶦᵉʰˢᵗ, ˢᵒᶫᶫᵗᵉˢᵗ ᵈᵘ ᵉᶦᶰᵉᶰ ᴳᵒᶫᵈˢᵏᶦᶰ ᵇᵉᵏᵒᵐᵐᵉᶰ⋅⋅\n\nDu kannst dir die Kisten via Champion-noten erarbeiten. Das BE-system ist im Vergleich zum IP-System wirklich nicht toll und gibt mir persönlich auch kein Gefühl der \"Belohnung\" für einen Sieg. \n\n\n>Community:\nDas Thema will ich nur kurz anschneiden, da die Ranked Spezialisten oben ja schon bisschen erklärt wurden. Ich will hier sogar mal auf dieses Forum eingehen\n\nOhje...\nLass das Forum laufen! Es hat dir nichts getan! QwQ\n\n>Eine Sache die mich grundlegend stört ist, das hier jeder die Stats mit einbindet. Auf jede Frage oder auf jede Beschwerde wird mit den eigenen Stats geantwortet, ihr seht nicht wie die Einzelperson spielt oder weshalb er schlechte Stats hat.\n\n...aber...\n...eeh.\n**Der Anfang von deinem Thread zeigt die Scores deiner Teammates.**\n\n>Ranked in Low Elo ist die Hölle> ---> \"guck mal deine Stats an und dann reden wir weiter\".\n>Jeder der schon mal in der gleichen Elo ist/wahr kennt diese Hölle hier.\n\nWelch Ironie.\n\n\n>Und ja das sind echte Beispiele, aber hier kommen mal meine Lieblings Beispiele :\n\n**oho..\nGREENS! :O\nNamecalling und so...**\n\n>Such die Fehler mal bei dir, anstatt bei anderen.\n\nDann solltest du damit mal anfangen. So fies es auch klingt, nach deiner Wall of Text kann ich dir deine eigenen Sätze zurück werfen.\nDu scheinst viele Dinge im Spielverlauf noch nicht zu kennen, bzw. noch nicht verstanden zu haben. Das kann dir keiner verübeln, jedoch würde ich an deiner Stelle lieber weiter am Ball bleiben und wirklich versuchen deinem Team zu helfen indem du z.B. mehr auf das Verhalten deiner Gegner achtest, welche das Spiel gewinnen.\n\nWissen ist Macht.\n\n>Ja also hier fällt mir grad die Idee mit dem neuen Elo System ein. Ein Elo für jede Lane. Really ???\nSowas dummes hab ich selten gehört. Meine Güte, also ein Platin 1 Mid Laner kommt in S4 auf der Top Lane. Man kann sich ja ungefähr vorstellen wo das hinführen würde... Selbst wenn das nicht durchgesetzt wird ( Was ich schwer hoffe), ist allein der Gedanke Cancer.\nOder die neuen ADC Items, habt ihr mal Jax oder Master Yi mit dem neuen Essence Reaver gesehen XD Totale Reset Zerstörung.\nUnd warum nimmt man den Krit vom Infinity Edge runter? Wieso kommen so viele Veränderungen? Ich kann Riot nicht verstehen, ich habe das Gefühl das Riot diese Veränderungen nur macht, um angeblich sich um ihre Community zu kümmern. \n\n\nWenn du dich garnicht mehr mit League beschäftigen möchtest, warum machst du dir darüber dann noch Gedanken?D:\n\n>Kein Mensch will Beemo oder Pulsfire TF. Nehmt doch bitte passende Skins für Shen und TF und nicht sowas komplett unpassendes. Oder bringt mal Skins für andere Champions raus (Ivern, Camille, Lissandra, Taliyah, Aurelion Sol, Vladimir oder Heimerdinger). Es ist zwar in Planung, trotzdem versteh ich nicht wieso dann jetzt Pulsfire Riven und TF kommen. Pulsfire Camille wäre so krass, oder Pulsfire Heimerdinger. Mir fallen gerade sehr viele Ideen dazu ein und ich versteh nicht wie Riot da so stur sein kann. Okay es geht ums Marketing, trotzdem wäre es doch mal schön auf die Community einzugehen.\n\n\nEy! Nichts gegen Beemo. Der war vor 4-5 Jahren mal angekündigt worden. (i-wo in den deeps von reddit..)\nUnd ja, es geht viel um das Marketing. Shen hat jedoch vor gefühlt einer halben Ewigkeit keinen Skin mehr bekommen. TF hat nahe zu nur ähnliche Skins, da tut ihm dieser englische Style ganz gut. Riven ist halt sehr beliebt und gehört zu den älteren Champions. Die haben nunmal ein paar Skins.\n\nWenn du Muffins und Kuchen verkaufen würdest... und die Muffins werden am besten verkauft..würdest du dann eher sagen:\" ach joar ich verkauf nur noch Kuchen\" oder \"Ich könnte auch einfach noch mehr Muffinsorten in meinen Laden stellen\"?\n\n>So dann will ich mal zum Ende kommen, ich wollte einfach nur mal kurz wiederspiegeln weshalb League für mich gestorben ist. Ich kann es selber kaum glauben aber es ist soweit. Ist mir eigentlich egal wie viel ihr hiervon lest.Viele Freunde von mir quiten auch gerade (ca. 4-5 Stück) und so ähnlich sieht es auch bei den Streamern und Youtuber aus.\n\nDie ganzen Streamer hören eher wegen der aktuellen Season auf, oder weil sie einfach nach Jahren keine Lust mehr haben. Der \"Gruppenzwang\" erwischt die Meisten :P Dafür kommen durchgehend neue Spieler dazu.\n\n>Ich werde trotzdem auf eure Kommentare antworten, so lange sie respektvoll und fair sind. \n\n...\nwhelp.\nDann gibt es wohl keine Antwort für mich xP\n\nedited: Kleinschreibung bei 'nem Wort.\nedited again: Nochmal Kleinschreibung ffs.","replies":[]},{"poster":"Grántelbart","date":"2018-05-12T23:04:49.345+0000","up_votes":4,"down_votes":1,"body":"Puh, ich stelle mir wirklich die Frage, für wen sich manche Menschen hier im Forum halten. Vielleicht bin ich hier auch einfach zu selten unterwegs, um Deinen Bekannthetsgrad einschätzen zu können, aber, wie Du es ja so schön beschrieben hast, meiner Meinung nach interessiert es hier keine Sau, wer wann und warum League quittet. Ich weiß auch ehrlich gesagt nicht, warum man daraus immer so ein Drama draus machen muss.. als würde sich genau mit diesem einen Post irgendwas an den scheinbar so nervigen Problemen ändern. Ich habe mir die Mühe gemacht, Deinen kompletten Post durch zu lesen und kann mir nur mit überhöhter Geschwindigkeit an die Stirn fassen.\nEs ist, als erlebe ich ein Deja vu, wenn ich mir die Gründe durchlesen, warum Du angeblich Hardstuck S5 bist. Sorry, aber die \"Mein Team ist so scheisse\" - Karte zieht einfach nicht. Auch wenn du es nicht hören willst, aber die Leute, die ständig mit Stats um sich schmeißen haben in vielen Fällen gar nicht mal so unrecht. Selbstreflektion ist der Schlüssel zum Erfolg. Klar, ich möchte nicht abstreiten, dass man in Rankeds ab und an echt mal grottige Mitspieler bekommt, aber man kann nicht jedes verlorene Game mit irgendeinem Inter, Flamer oder AFKler abtun. Wenn man etwas erreichen möchte, dann sollte man dafür was tun. Es gibt genug Guides zu allen Lanes und wie man evtl am besten was aus einer blöden Situation machen kann. Das ist der Tipp, den ich dir ans Herz legen möchte. Dass du jedes Game gewinnst ist sowieso unmöglich, aber Du kannst aus verlorenen Spielen immer noch etwas mitnehmen. \n\nSo, mache ich doch mal weiter. Wo ich oben noch recht freundlich war, muss ich Dich nun echt fragen, ob Dir der Kittel brennt..? Zehn Kisten oder nen Skin den man sich aussuchen kann... und bald kannst Du Skins ausschließlich für Blue Essenze erwerben... XD\nIch weiß ja nicht, ob Dir bewusst ist, dass die Firma Riot Games auch noch ein bisschen Kohle verdienen will und schon eines der wenigen Spiele ist, die meiner Meinung nach wirklich komplett frei von Pay to Win ist... aaaaber, Du scheinst Dir ja die kommenden Patchnotes durchgelesen zu haben.. scheinbar ist Dir dabei der Absatz bezüglich kommender Belohnungen bzw Rewards entgangen. Ich verweise einfach noch mal freundlich darauf, da mal reinzuschnuppern, bevor mir der Kragen von so viel Gier platzt.\n\nBezüglich der Patchnotes (Buffs, Nerfs etc) möchte ich mich an der Stelle gar nicht äußern. Wer sich wegen so minimalen Änderungen ins Hösschen macht, dem kann man so oder so nicht mehr helfen. Das bezieht sich im übrigen auch auf die Skins. Mein Gott, es wird für jeden Champ früher oder später noch mal einen anständigen Skin geben. Vielleicht nicht heute und auch nicht morgen, aber mein Gott. Es gibt wesentlich größere Probleme für MICH, als wie zur Hölle mein verdammter Champ aussieht. XD Sag mal, wenn Du sonst keine Probleme hast, würde ich Deine aktuellen Sorgen wirklich gerne mit meinen tauschen..\n\nSo, nun möchte ich auch mal zum Ende kommen. Ich kann abschließend nur sagen, dass es mich nach wie vor nicht juckt, ob jemand, der scheinbar absolut kein Spielverständnis oder Fokus für das Wesentliche mitbringt League quittet. Entweder, du zeigst irgendwann mal Willen, aus gut gemeinten Ratschlägen Resultate zu ziehen oder aber Du bist in einem anderen Spiel besser aufgehoben. Das bleibt ganz alleine Dir überlassen. \n\nCheers{{sticker:vlad-salute}}","replies":[]},{"poster":"INoKami","date":"2018-05-13T08:07:55.749+0000","up_votes":1,"down_votes":0,"body":"> Such die Fehler mal bei dir, anstatt bei anderen.\n\nIst das herrlich, wenn der sinnvollste Ratschlag des gesamten Beitrags mit den nächsten zwei Sätzen wieder mit Schwung in die Tonne geworfen wird :D\nDas du der Beste bist, sowieso eine ganze Liga nach oben versetzt werden solltest und dein Team dich zurückhält, weil sie wie die Trottel vor dem Herrn spielen (und wir wissen ja eh, das sich das Matchmaking grundsätzlich gegen uns verschworen hat!), ist von vornherein klar, wieso müssen wir überhaupt noch darüber reden?\n\nIn diesem Sinne: Genieß deine Auszeit und Danke, dass ich nicht mehr Gefahr laufen muss, jemanden wie dir in meinen Games zu begegnen!\n\n_\nJa, ich weiß, das kann man auch netter formulieren... aber das ist meine Art, Danke zu sagen für die 5 Minuten Lebenszeit, die mir mit Lesen dieses.... Textes gestohlen wurden :)_","replies":[{"poster":"Kind Prow","date":"2018-05-13T08:12:38.036+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Incaedeus,realm=EUW,application-id=YnZkMR0R,discussion-id=l6mUZfAg,comment-id=0008,timestamp=2018-05-13T08:07:55.749+0000)\n>\n> Ja, ich weiß, das kann man auch netter formulieren... aber das ist meine Art, Danke zu sagen für die 5 Minuten Lebenszeit, die mir mit Lesen dieses.... Textes gestohlen wurden :)_\n\nSei doch froh, dass du was zu tun hast. Ich muss hier der Langeweile fröhnen.","replies":[{"poster":"INoKami","date":"2018-05-13T08:45:39.575+0000","up_votes":1,"down_votes":0,"body":"Hui, ist das Problem mit der Langeweile mittlerweile so schlimm geworden?\n\nMal sehen, was kann man da so machen... hmmmm... du könntest mal in unserer kleinen Enklave namens \"Skin&Champion-Konzepte\" vorbeischauen, unsere noch junge Best-Of-Liste begutachten oder sogar selber mal einen Beitrag einreichen, das sollte für ein paar Stunden genügen... sonst... was haben wir noch... wie wäre es mit ein paar Runden Full-AD-Pantheon-Mid? Soll der neue Geheimtipp sein... andernfalls könnte ich dir einen Sprachkurs für Russisch ans Herz legen, damit du im DotA-Forum mitreden kannst, gibt dort immer wieder... interessante Beiträge... was ich sonst noch empfehlen kann, eine Runde eines RTS deiner Wahl zu spielen, aber du darfst nur einen Arbeiter gleichzeitig haben...\nPuh, da wäre mal das beste, dass ich aus meinem Portfolio rausfischen konnte. Sonderprogramme gibt es gegen Anfrage, der Preis wird individuell ausgehandelt.\n\nMfG\n\nIncaedeus\n{{sticker:galio-happy}} \n_Leidenschaftlicher (und momentan definitiv nicht gelangweilter) Galio-Main_","replies":[{"poster":"Kind Prow","date":"2018-05-13T09:01:24.659+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Incaedeus,realm=EUW,application-id=YnZkMR0R,discussion-id=l6mUZfAg,comment-id=000800000000,timestamp=2018-05-13T08:45:39.575+0000)\n>\n> Hui, ist das Problem mit der Langeweile mittlerweile so schlimm geworden?\n\nJa. RTS klingt net schlecht. Haste da Empfehlungen? Vielleicht auch was Multiplayermäßiges? Dann können wir uns die Langeweile gegenseitig vertreiben :>","replies":[{"poster":"INoKami","date":"2018-05-13T09:12:19.332+0000","up_votes":1,"down_votes":0,"body":"Hmmm... ich hätte nur WC3 anzubieten (multiplayermäßig). Und selbst wenn, ich hab´s mir nur geholt, um die Story durchzuspielen (wo ich auch gerade mittendrin bin) und um mich wieder daran zu erinnern, was für eine Niete ich in RTS bin. Kein Scherz.\nAnsonsten, sofern du es hast, AoE2 geht immer. Notfalls ignoriere meinen Arbeiter-Vorschlag und spiel eine Runde \"[xyz] Nothing\", soll recht hohen Unterhaltungswert haben...","replies":[{"poster":"Kind Prow","date":"2018-05-13T09:35:22.574+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Incaedeus,realm=EUW,application-id=YnZkMR0R,discussion-id=l6mUZfAg,comment-id=00080000000000000000,timestamp=2018-05-13T09:12:19.332+0000)\n>\n> Hmmm... ich hätte nur WC3 anzubieten (multiplayermäßig).\n\nKenn ick nich. Was ist das?","replies":[{"poster":"INoKami","date":"2018-05-13T09:38:15.559+0000","up_votes":1,"down_votes":0,"body":"Solltest du aber. Warcraft 3. Das Spiel, dem wir zum einen WoW und zum anderen einen Modder (icefrog) verdanken, der das Konzept von WC3 weiterentwickelt hat und am Ende DotA erschaffen hat, was am Ende wiederum für die Erschaffung von LoL verantwortlich war.","replies":[{"poster":"Neamhoilte","date":"2018-05-13T10:46:01.365+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Incaedeus,realm=EUW,application-id=YnZkMR0R,discussion-id=l6mUZfAg,comment-id=0008000000000000000000000000,timestamp=2018-05-13T09:38:15.559+0000)\n>\n> Solltest du aber. Warcraft 3. Das Spiel, dem wir zum einen WoW und zum anderen einen Modder (icefrog) verdanken, der das Konzept von WC3 weiterentwickelt hat und am Ende DotA erschaffen hat, was am Ende wiederum für die Erschaffung von LoL verantwortlich war.\n\nDa hast du aber ein paar andere bedeutende Namen dazu, gepflegt unter den Tisch fallen lassen...\n\nGruß ich","replies":[{"poster":"INoKami","date":"2018-05-13T11:24:09.768+0000","up_votes":1,"down_votes":0,"body":"War jetzt auch nicht wirklich mein Ziel, alle bedeutenden Namen aufzulisten, war mehr so... \"Klugsch**ßer-Modus\"?","replies":[{"poster":"Neamhoilte","date":"2018-05-13T11:51:21.703+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Incaedeus,realm=EUW,application-id=YnZkMR0R,discussion-id=l6mUZfAg,comment-id=000800000000000000000000000000010000,timestamp=2018-05-13T11:24:09.768+0000)\n>\n> War jetzt auch nicht wirklich mein Ziel, alle bedeutenden Namen aufzulisten, war mehr so... &quot;Klugsch**ßer-Modus&quot;?\n\nOk. Deswegen habe ich es auch gerochen. \n\n{{sticker:slayer-pantheon-thumbs}}","replies":[]}]}]},{"poster":"Kind Prow","date":"2018-05-13T10:02:30.473+0000","up_votes":1,"down_votes":0,"body":"Entschuldige v.v Das wusste ich wirklich nicht. Es tut mir Leid, dass ich unsere Wurzeln nicht ehre.","replies":[{"poster":"INoKami","date":"2018-05-13T10:06:18.375+0000","up_votes":1,"down_votes":0,"body":"Wird schon. Ich hatte aber auch etwas Glück, war ein 3 Euro-Fund beim Flohmarkt um die Ecke... wer würde da nicht zuschlagen? Anscheinend sogar mit beiden Erweiterungen...\nWenn dich die (World of) Warcraft-Lore auch nur ansatzweise interessiert, ist das Spiel auf jeden Fall einen Versuch wert!","replies":[{"poster":"Kind Prow","date":"2018-05-13T10:40:23.464+0000","up_votes":1,"down_votes":0,"body":"Nein, ich komm schon mit der League Lore kaum hinterher q_q Und auch das wird noch abnehmen.\n\nGlückwunsch dazu. Ich hab letztens ein Jules Verne buch für 50 Cent bekommen :D","replies":[]}]}]}]}]}]}]}]}]}]},{"poster":"Zhianlian","date":"2018-05-13T07:51:52.954+0000","up_votes":2,"down_votes":0,"body":"http://www.gbsun.de/gb-pics/Abschied/bis_bald_gaestebuchbild_3.gif","replies":[]},{"poster":"Sirrkas","date":"2018-05-12T23:44:31.901+0000","up_votes":3,"down_votes":1,"body":">Jo also ich würde sagen das Ranked der Hauptgrund ist warum ich League quitte. Ich bin S5 Hardstuck, habe über 200 Ranked Games (98 Siege/116 Niederlagen) und eine 46% Winrate. \n\nEs ist verständlich, dass dich das aufregt. Aber zugleich liegt es in deiner Hand, daran etwas zu ändern.\n\n> Jeder der schon mal in der gleichen Elo ist/wahr kennt diese Hölle hier. \n\nIch weiß, wie Spiele in Bronze und Silber ablaufen. Habe oft genug zugesehen und war da selber auch mal. Klar, es ist frustrierend Leute zu sehen, die sogar geschenkte Drachen ignorieren. Aber das Problem haben beide Teams gleich oft. Deswegen steigt man ja auch auf, wenn man selber besser ist. Die Gegner sind nämlich nicht besser als die Leute im eigenen Team. Wenn man da selber raus sticht, schafft man es die Leiter hoch.\n\n> Keiner aus dem Team weißt irgendeine Kompetenz vor, alle sind nur am Inten, Flamen, Feeden oder gehen AFK. IN JEDEM SPIEL. Selten habe ich Ranked Runden wo ich danach sage :,, Boah die Runde war echt geil\". Jedes Game ist Stress pur. Man sieht nur wie das Team wieder das First Blood abgibt und die ersten schon sowas wie \" I go AFK\" oder \"Camp Bot or i troll\" schreiben.\n\nAlso Inter (ich gehe mal von int Feeding aus, was du damit wohl meinst) AFKler und Feeder, habe ich in deinen letzten beiden Rankeds nicht auf Anhieb erkennen können. Flamer kann man aus den Stats nicht ablesen, da kann das eher zutreffen. \n\n>Der eigene Supporter ist natürlich autofilled und zeigt ein Spielstil von einem Bonobo. Der ADC ist behind, kann kaum farmen und ist in jedem Fight Useless. Der Jungler blendet jedes Objective aus und stirbt dumm beim Counterjungeln. Der Mid Laner spielt sowas wie Yasuo und Intet zweimal um die Erde. Dann kommt der Toplaner, der dann durch seinen dummen AFK Farmen und AFK Splitpushen das Team null unterstützen kann. Die besten Mates sind aber die, die sogar mal ihre Lane gewinnen und hohes Carry Potenzial aufweisen. Doch es endet damit das sie dumm greeden und nicht einmal in 100 Jahren den Namen Carry verdient haben. Das betrifft vorallem den ADC und Midlaner.\n\nHier sollte man aber auch so fair sein und deine Fehler ankreiden. Auf op.gg zeigt mir das nur ein Ranked mit Kha und eines als Tham an. Du hast etwa kein einziges Kontrollauge erworben und genutzt und dein Trinket als Support nicht getauscht, obwohl du dein Warditem ausgebaut hast. Dazu hast du scheinbar noch kaum Wards platziert. Da das einige Gegner ähnlich viele platziert haben wie du und Teemo aus deinem Team sogar eines mehr. \nSogar dein gegnerischer Support aus dem nachfolgenden Spiel hatte mehr Wards platziert als du und das Spiel ging 17 Minuten kürzer.\n\nKlar glaube ich dir, dass du in deinen Rankeds schlechte Mitspieler hast, aber der erste Schritt da raus, ist es, die eigenen zu erkennen, damit man besser als die anderen werden kann. Deswegen bringt es einem nichts, immer nur auf die Fehler der anderen zu sehen. Die eigenen sind das, was dich am Aufstieg hindert und in S5 hält.\n\n\n>Ich weiß das die Personen nen schlechten Tage gehabt haben können, trotzdem frustrierend solche Mates zu bekommen. Und wie gesagt es ist jedes Game so.\n\n\nVergiss dich nicht.\n\nDu hast dich auch einige male nicht gerade mit Ruhm bekleckert. Vor allem, ein paar der Spieler über die du dich hier gerade beschwert hast, hatten doch gar nicht so schlechte KDAs. Ein paar davon waren fast 2 Killbeteiligungen je Tod. Das klingt nach einer Durchschnittsleistung.\n\n>Mal allgemein zu mir, ich weiß ich habe auch oft schlechte Games. Nur der Unterschied zwischen mir und den oben genannten Beispielen ist, das ich versuche trotzdem in irgendeiner Art und Weise noch zurück ins Game zu finden. Ich geb mir weiter Mühe um eventuell nachher im Late Game sogar noch usefull zu sein. Die Kollegen dort oben haben sich nichtmal bevor sie angefangen haben zu inten, Mühe gegeben.\n\nDer Teemo hat etwa so viel Schaden gemacht wie der Rest des Teams. Nur Malzahar hat da herausgestochen. Das sieht mir so aus, als ob er sich keine Mühe mehr gegeben hätte. Auch wenn das nicht heißt, dass ich Teemo Jungle für eine gute Idee halte.\n\n>Ich war in S5 und hatte eine S5 MMR (durchschnittlich) habe aber trotzdem +18 LP und -20 LP bekommen. Ich habe mich dann direkt an Riot gewendet wo mir dann gesagt wurde das die OP.GG MMR sehr ungenau sei und sie ihr MMR System aus diversen Gründen nicht veröffentlichen wollen. Also ernsthaft, das kann man doch nicht Ernst meinen. Naja was will man machen ?\n\nDeine MMR ist eben wegen einen vielen Niederlagen im Keller. Da erhält man eben weniger LP als man gewinnt. Beweise, dass du besser als Bronze bist, dann gleicht sich das wieder aus.\n\n>Ich würde mich auf S1- G3 schätzen. Aber wie gesagt, das ist meine Meinung. Zumindestens vom Spielstil her denke ich, gehöre ich zu 0% in S5.\n\nIch persönlich erwarte von Goldspielern, dass die sich wenigstens mal ein Kontrollauge je Spiel kaufen. Wenn du willst kannst du an dir arbeiten und dich verbessern. Aber die Schuld anderen in die Schuhe schieben wird dir nicht dabei helfen, Gold zu erreichen.\n\n","replies":[{"poster":"4 Ever TaIone","date":"2018-05-13T01:48:00.649+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Sirrkas,realm=EUW,application-id=YnZkMR0R,discussion-id=l6mUZfAg,comment-id=0004,timestamp=2018-05-12T23:44:31.901+0000)\n>\n> Hier sollte man aber auch so fair sein und deine Fehler ankreiden. Auf op.gg zeigt mir das nur ein Ranked mit Kha und eines als Tham an. Du hast etwa kein einziges Kontrollauge erworben und genutzt und dein Trinket als Support nicht getauscht, obwohl du dein Warditem ausgebaut hast. Dazu hast du scheinbar noch kaum Wards platziert. Da das einige Gegner ähnlich viele platziert haben wie du und Teemo aus deinem Team sogar eines mehr. \n> Sogar dein gegnerischer Support aus dem nachfolgenden Spiel hatte mehr Wards platziert als du und das Spiel ging 17 Minuten kürzer.\n> \n> Du hast dich auch einige male nicht gerade mit Ruhm bekleckert. Vor allem, ein paar der Spieler über die du dich hier gerade beschwert hast, hatten doch gar nicht so schlechte KDAs. Ein paar davon waren fast 2 Killbeteiligungen je Tod. Das klingt nach einer Durchschnittsleistung.\n> \n> Ich persönlich erwarte von Goldspielern, dass die sich wenigstens mal ein Kontrollauge je Spiel kaufen. Wenn du willst kannst du an dir arbeiten und dich verbessern. Aber die Schuld anderen in die Schuhe schieben wird dir nicht dabei helfen, Gold zu erreichen.\n\n\n\nIch nenne das mal argumentativ zerfickt (salopp gesagt).","replies":[{"poster":"Izaya Kumiho","date":"2018-05-13T10:20:38.831+0000","up_votes":1,"down_votes":0,"body":"this ^","replies":[]}]}]},{"poster":"Angel Ayume","date":"2018-05-12T22:40:22.694+0000","up_votes":2,"down_votes":1,"body":"Also vorerst sag ich mal: Ich habe deinen Text nicht gelesen. Habe nur den ersten Satz gelesen und mich direkt eines gefragt.\n\n> hätte mir vor einem Monat jemand gesagt das ich League bald quitten werde, hätte ich ihn für verückt gehalten\n\nVor einem Monat? Du hast also durch ein paar unglücklichen Momenten innerhalb kürzester Zeit keinen Bock mehr, so das du das Spiel komplett aufgeben möchtest obwohl du vor einem Monat noch das genaue Gegenteil gesagt hast? \n\nKlingt für mich eher danach, als hättest du einfach ein wenig zu empfindlich reagiert. Und seist einfach nur von diesen Situationen angepisst. \nEinfach mal ne Pause einlegen hilft da. ^^ Man muss nicht sofort quitten.","replies":[{"poster":"RainDropsDown","date":"2018-05-13T10:19:39.276+0000","up_votes":1,"down_votes":0,"body":"Ne ich habe schon sehr lange alle negativen Erlebnisse mit League gesammelt, nur in letzter Zeit wurde nochmla alles getoppt","replies":[{"poster":"Angel Ayume","date":"2018-05-13T10:39:08.756+0000","up_votes":1,"down_votes":0,"body":"Ach so. Das hörte sich anders an.\n\nAber ich habe mir mittlerweile die Mühe gemacht und deinen Text gelesen. So wie viele andere auch, kann ich dir nur sagen, dass es keinen Sinn macht alles auf die Teammates zu schieben. Du machst sicher auch genug Fehler und wenn du mit besseren Leuten spielen willst, dann musst du anfangen dich selbst zu verbessern. Wer nach so vielen Spielen eine 48% Winrate hat ist da klar selbst für verantwortlich. \nSpreche da aus Erfahrung. Meine Winrate ist aktuell auch nicht besser und ich weiß, dass es an mir liegt. \n\nIch bezweifle nicht, dass du mal schlechte Mates hast. Aber die Mates die du bekommst stammen alle aus dem selben Spielerpool. Die Spieler die du im Team hast bekommst du auch im Gegnerteam. Willst du also gewinnen, dann musst du der auslösende Faktor sein indem du konstant besser spielst als die Gegner. \nSind im Gegnerteam 5 Spieler die mittelmäßig spielen und in deinem Team 4 Leute die mittelmäßig spielen und du gut spielst, dann ist die Siegchance automatisch erhöht. \n\nZudem kann ich dir nur ans Herz legen: Sei toleranter. Dann nimmst du es mit Feedern und Flamern auch nicht so schlimm auf, auch wenn es nervt, was ich auch verstehen kann.\n\nZudem spiele Ranked nicht um zwingend zu gewinnen (das soll natürlich das Ziel des Spiels bleiben) sondern um dich zu verbessern. Wenn du danach spielst, dann nimmt man eine Niederlage auch nicht so schwer auf, weil man dich auch bei Niederlagen verbessern kann.","replies":[]}]}]},{"poster":"Náza","date":"2018-05-13T13:25:35.636+0000","up_votes":1,"down_votes":0,"body":"Bye bye{{sticker:cass-cry}}","replies":[]},{"poster":"Hardstuck ADC","date":"2018-05-12T22:18:18.266+0000","up_votes":1,"down_votes":2,"body":"Schön das die silber spieler immer ihr team fürs versagen schuldig machen :D denke es ist kein verlust wenn du gehst wenn du behuptest dein team sei bad und man könne es net carryn","replies":[{"poster":"RainDropsDown","date":"2018-05-13T10:18:46.441+0000","up_votes":1,"down_votes":0,"body":"Du kennst dich ja da bestimmt perfekt aus","replies":[]}]},{"poster":"MeMyselfandBaal","date":"2018-05-13T03:10:26.730+0000","up_votes":1,"down_votes":0,"body":"Mein Persönliches Highlight ist ja das \n\"Ich finde es schade das ich im direkten Spiel nicht belohnt werde, ich krieg lediglich nach jedem Spiel +/- LP und XP für mein Champion und mein Spieler Level. Irgendwie wäre wenigstens eine Season Belohnung angebracht, von mir aus sowas wie 10 Kisten am Ende der Season, oder einen Skin \"\n\nÄhm... Es gibt doch mehr Belohnungen als +/- LP... du kriegst auf das erste S, welches du mit einem Champion in einer Saison erspielst, eine Kiste. Und wenn du der Gold III Spieler wärst, der du zu glauben scheinst, sollte es doch super einfach sein diese S Bewertungen zu bekommen...\nIch meine, ich bin ein mechanisch mega unfähiger High Gold Spieler, der immer wieder seine eigenen Statistiken fürs Team ruiniert um zu gewinnen, und ich komme trotzdem schon auf 12 Kisten in dieser Saison. Und bevor die durch ist dürften es noch nen paar mehr werden... Es gibt die Belohnungen, nach denen du schreist, also schon...\nGenau so, wie ich definitiv den Gratisskin bekommen werde... wie knapp die Hälfte aller Spieler... \n\nRiot gibt dir also bereits das, was du verlangst, und du heulst trotzdem rum... Weil dir die gratis Belohnungen, die Riot raushaut, nicht reichen... ja GG...","replies":[]},{"poster":"Sakuritou","date":"2018-05-12T22:21:50.005+0000","up_votes":1,"down_votes":1,"body":"Regst du dich wirklich über einen Garen Buff auf? Mädel, Garen ist so ungefähr der schlechteste Champ in League wenn man wenigstens ein/zwei Gehirnzellen besitzt. Hör auf deine Teammates zu flamen.. Es ist allein DEINE Schuld dass du hardstuck S5 bist.","replies":[]}]}