{"poster":"x Fvck Luv x","date":"2017-06-17T00:40:47.726+0000","title":"alguno sabe con cuantas piesas de caos o orden vamos a terminar a final del evento?","subforum":"Problemas Técnicos","up_votes":10,"down_votes":1,"body":"osea si  jugando el evento sin comprar nada vamos a poder llegar a tener una de las pantallas de carga de yasuo o riven","replies":[{"poster":"DanielGarrita","date":"2017-06-17T01:41:55.537+0000","up_votes":5,"down_votes":0,"body":"No se cuantas monedas seran, pero yo solo quiero comprar un orbe del caos a ver si me sale la skin de vayne.","replies":[{"poster":"FNC Imke","date":"2017-06-17T03:13:57.335+0000","up_votes":2,"down_votes":0,"body":"Ya abri dos, uno normal (solo skin) y en otro skin mas dos gemas.","replies":[]}]},{"poster":"Dog Bulling","date":"2017-06-17T02:16:36.646+0000","up_votes":3,"down_votes":1,"body":"Solo se que va a ganar el orden, porque los jugadores en general le tienen mas tirria a Yasuo que a Riven.\n\nPD: odio el auto-corrector.","replies":[]},{"poster":"CordobezEverdeen","date":"2017-06-17T02:20:05.957+0000","up_votes":2,"down_votes":2,"body":"Como dijo Bertox son 14 dias y conseguis unos 20 tokens por dia.\nOJO AL PIOJO.\nSi elegis cambiar de facción 1 dia tendras que jugar esa facción otros 6 dias para recibir recompensas porque:\n1 dia de cambio: 20 tokens de orden/caos distintos a la facción con la que comenzaste.\nCon 20 tokens no compras nada pero con 140 (7 dias de seguir una facción) te compras un orbe que son la cremita del evento.\nYo ire los 14 dias a por la facción de Riven y sacare mis 280 tokens de orden.\nDesde ya te digo que pagar por este evento es MUY poco provechoso (al igual que el anterior con la basura de Warring Kingdoms).\nLos tokens estan insanamente caros para la cantidad que te puedes comprar.\nEl pase de misiones caducara al final del evento haciendo que si no jugaste lo suficiente para completar las 6 misiones comprables las pierdas.\nRealmente este evento es más agradable para los que no pagan 1 centavo.\nYo iba a cargar RP ni bien comenzara el evento pero cuando dijeron que las misiones expiran me guarde la billetera, no pienso pagar 1300 RP en un ward.","replies":[{"poster":"x Fvck Luv x","date":"2017-06-18T06:42:52.535+0000","up_votes":1,"down_votes":0,"body":"muchas gracias","replies":[]}]},{"poster":"bertox","date":"2017-06-17T01:07:03.345+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"ImNw","date":"2017-06-17T04:51:37.417+0000","up_votes":1,"down_votes":0,"body":"La pregunta es para que quieren el icono? si no tienen el skin creo que es mejor comprar el orbe y te salga alguna buena skin(poray)","replies":[]},{"poster":"kiuhm","date":"2017-06-17T01:18:53.369+0000","up_votes":1,"down_votes":0,"body":"> Q: ¿Por cuánto tiempo tengo que hacer las misiones diarias?\n> R: Las misiones diarias se restablecerán cada 24 horas a las 14:00 (BO/CI) / 15:00 (AR/UY). **La última misión diaria terminará a la medianoche del 29/06.**\n\nhttp://las.leagueoflegends.com/es/featured/events/vs-2017#faq","replies":[]},{"poster":"Dodge With Alpha","date":"2017-06-17T01:42:07.646+0000","up_votes":1,"down_votes":1,"body":"ami una misión me dio 60 e.e","replies":[]}]}]}