{"poster":"crush1x","date":"2015-02-26T00:34:42.227+0000","title":"\"We nerfed Lucian's range to 500 from 550 because we gave him insane mobility\"","subforum":"Gameplay","up_votes":131,"down_votes":13,"body":"{{champion:429}}","replies":[{"poster":"BluePolarizer","date":"2015-02-26T00:38:09.652+0000","up_votes":52,"down_votes":4,"body":"I was thinking - yeah, Lucian should be *the* iconic mobile ADC, with a kiting/chasing playstyle with all his dashes and MS boosts, but pays for it with low range and low burst damage ultimate.\n\nThen lol, Kalista comes along and is essentially a better Lucian + Ashe all in one.","replies":[{"poster":"Straley","date":"2015-02-26T03:40:39.344+0000","up_votes":22,"down_votes":1,"body":"Forgot to add {{champion:29}} in there too.","replies":[{"poster":"Rinky Dinky","date":"2015-02-26T16:44:40.015+0000","up_votes":7,"down_votes":0,"body":"Dont forget {{champion:110}}","replies":[{"poster":"Jamnon","date":"2015-02-27T04:54:07.273+0000","up_votes":2,"down_votes":0,"body":"Used to play {{champion:134}}  mid. Then I tried {{champion:110}}  who actually scales well...\nI thought Syndra was immobile, HA. {{item:3070}}","replies":[]}]}]}]},{"poster":"JustMyBassCannon","date":"2015-02-26T00:54:29.047+0000","up_votes":36,"down_votes":53,"body":"\"We took what Riot said out of context, then posted the picture of a different champion ***who just got nerfed in the new patch*** because it's easier to bitch about shit than it is to think for one tenth of a second and realize how fucking stupid this sounds.\"","replies":[{"poster":"Remlap1223","date":"2015-02-26T04:57:31.619+0000","up_votes":56,"down_votes":11,"body":"Oh yes, that nerf sure killed Kalista.  Just like Zed is complete shit now that his attack speed got nerfed.  Oh wait.","replies":[{"poster":"Centuros","date":"2015-02-26T05:00:42.670+0000","up_votes":12,"down_votes":2,"body":"It was at least a step in the right direction, unlike the Zed nerfs.\n\nThough it probably isn't enough.","replies":[{"poster":"Shinjusuke","date":"2015-02-26T14:13:11.762+0000","up_votes":15,"down_votes":1,"body":"Zed nerfs were a step in the right direction too, the thing that made him OP wasn't the assassinating, it was the ability to assassinate, duel, AND splitpush, all very effectively. \n\nWhile I don't think the nerf was quite *enough*, I do think it was what needed nerfed. It's fine if he's a reliable assassin, the thing that was making him win games was the fact that you *HAD* to send 2 people to stop his splitpush and even then you probably weren't going to kill him for it. \nThe attackspeed nerf was a hit on *that*, which is where he needed hit.","replies":[{"poster":"Deathtenfold","date":"2015-02-26T16:41:19.176+0000","up_votes":6,"down_votes":1,"body":"> [{quoted}](name=Shinjusuke,realm=NA,application-id=3ErqAdtq,discussion-id=u47I2enm,comment-id=0003000000000000,timestamp=2015-02-26T14:13:11.762+0000)\n>\n> Zed nerfs were a step in the right direction too, the thing that made him OP wasn't the assassinating, it was the ability to assassinate, duel, AND splitpush, all very effectively. \n> \n> While I don't think the nerf was quite *enough*, I do think it was what needed nerfed. It's fine if he's a reliable assassin, the thing that was making him win games was the fact that you *HAD* to send 2 people to stop his splitpush and even then you probably weren't going to kill him for it. \n> The attackspeed nerf was a hit on *that*, which is where he needed hit.\n\nWhen do you see a zed aa waves of minions when splitpushing? Everyone knows he can clear an entire wave with two skills by the time hes able to split push. How hes able to you ask? Well, he can farm without missing a single cs in lane and farm safely under his own turret due to his passive. Lets compare his as to riven's, while she shouldn't have much if any attack speed items, she can still do insane damage to turrets because of how much AD she has. \n\nAnother example is Nasus. He doesn't just right click towers for 1/3 of their hp, he uses his Q with his stacks to take it down. \n\nLets not forget about dragon buffs and elixirs, which can increase damage to towers, but not increase attack speed.\n\nAll in all, hes still going to build {{item:3153}}  and {{item:3142}} which will give him well over enough attack speed to make his nerfs not even matter.","replies":[]},{"poster":"Silven","date":"2015-02-26T16:30:15.886+0000","up_votes":5,"down_votes":1,"body":"I'd let Zed splitpush gladly if he wasn't 100-0ing me under my turret and then out in a jiffy.\n\nIf the AS nerfs on Zed were a step in the right direction, they weren't adressing the real problem this champion has. Basically, they nerfed one of the three things that made him obnoxious and left out the much more important other things.","replies":[{"poster":"Mikal Pikal","date":"2015-02-26T20:14:20.705+0000","up_votes":2,"down_votes":0,"body":"In fairness, Zed can really only 50-0 under turret but your point stands.","replies":[{"poster":"Auz the Ripper","date":"2015-02-26T20:54:02.865+0000","up_votes":4,"down_votes":0,"body":"Depends on the champion\nThere are several he can easily 100-0 under tower and get out scot free","replies":[{"poster":"Mikal Pikal","date":"2015-02-26T21:48:04.484+0000","up_votes":1,"down_votes":0,"body":"Assuming hes not super fed, I disagree. But it doesn't even matter since being able to 50-0 someone under a tower without any items and without taking more than a turret shot is pretty bad anyways.","replies":[]}]}]},{"poster":"ChrisB5","date":"2015-02-26T23:57:02.859+0000","up_votes":1,"down_votes":0,"body":"Who do you play as?  Do you consider Zhonas, Barrier, Heal, or Exhaust?","replies":[{"poster":"Silven","date":"2015-02-27T08:29:54.829+0000","up_votes":1,"down_votes":0,"body":"I tend to play a mid with Ignite, anyway, because I play normals and have no idea who I'm up against.\n\nI once played a game as Karthus, with Exhaust, mind you, versus a Zed. This is then how it went:\n\nKarthus: -farming under tower because I've been pushed out of lane, hit 6 sure enough.-\n\nZed: -hits 6 aswell, instantly all-ins me under the tower.-\n\nNeither of us had backed by that point, so we had our starting items, at most.\n\nKarthus: -exhausts Zed the second he pops out of his ult. He does mediocre damage with his combo, then dashes back out of my range before I can get more than a single Q between minions (50 magic damage at best) upon him.-\n\nZed: -backs, buys items, comes back.-\n\nKarthus: -ditto, still farming under tower because I'm trying to be careful.-\n\nZed: -Ult is up, comes at me with a Brutalizer and a Long sword, instagibs me because my Catalyst decided not to give a damn.-\n\nKarthus: -has no Exhaust, instantly goes into his passive, tries to get a W and Q onto Zed but oh wait he just jumped back out again because he saw the risk involved in towerdiving me a second time in 3 minutes and just went 'lol no'.-\n\nFrom that point on, it's all been downhill.\n\nI'm not trying to say Karthus is a legit lane against Zed but in normals you just don't have choice to chose who you're up against and the same problem can apply to a lot of other, sometimes very effective mids when they see a Zed on their lane.\nIf I'd rushed a Seeker's Armguard, I would have been out of mana very quickly or simply not gotten any farm at all, at which point I could've just stood in base and pressed R everytime it came off cooldown to make myself useful. I NEEDED that mana, which, despite the Catalyst giving me some sort of Health, amounted to nothing compared to Zed. And even with an Armguard, that Brutalizer would have went through my armor as if it was butter.\n\nMy point is: There's something extremely toxic about Zed's ability to lock down a target, mark them for certain death and BE OUT OF ANY CONSEQUENT DANGER before he even gets the kill with somewhat of a CERTAINTY that he is going to get it lest they have QSS or Zhonya's.\n\nWhen playing Diana, you can have the same amount of burst as a Zed with Q R R, but then you're locked into the enemy team and even if you get to kill an enemy carry, you will likely end up dying due to the fact that you took a risk going in there, you got your reward and now you have to make it out alive. Zed can not only get a kill insanely quickly, sometimes even before his ult pops, and be gone, but then he can also go back out of a fight should it go sour and he knows he cannot secure the kill. Wait 60s for your ult to be up again and nobody to have exhaust/Zhonyas and your bloodbath is guaranteed.","replies":[]}]}]},{"poster":"ChrisB5","date":"2015-02-26T23:50:44.463+0000","up_votes":1,"down_votes":0,"body":"And let's not forget there are so many ways to counter it!\n\n1. Zhona for mages is a good way to counter an assassination attempt.\n2. Exhaust (40% damage reduction, slow, and armor/mr reduction) is a great way to reduce his overall burst and assassination attempt, plus a way to get the hell outta there!\n3. Stun stun stun.  Zed is an assassin, not a tank.  Stun him and cover his bases so he doesn't get away like the mobile little bugger he tries so hard to be.\n4. Learning to play against Zed is another good way to counter him.  People are so busy complaining, they dedicate NO time to learning Zed's strengths and weaknesses, and instead claim everything can be countered by being a Zed.  Because Zed is OP.  And Zed is Zed.  Because Zed.\n\n{{champion:238}}","replies":[{"poster":"Jamnon","date":"2015-02-27T05:12:52.436+0000","up_votes":3,"down_votes":0,"body":"{{item:3139}}  What stuns?","replies":[{"poster":"ChrisB5","date":"2015-02-28T08:14:57.873+0000","up_votes":1,"down_votes":0,"body":"Fair enough, but that then nulls the forced into Zhona's argument lol.","replies":[]}]}]}]},{"poster":"ChrisB5","date":"2015-02-26T23:46:26.483+0000","up_votes":2,"down_votes":3,"body":"And how is Zed OP right now?\n\nDoes he /assassinate/?  He's an assassin.\n\nBut he does it too well!  He can one shot mages.\nOr any mage could buy Zhonas and counter.\n\nOh but he shouldn't be able to wave clear so fast.\nLike Yi, Kat, Akali?\n\nWell, he forces mages into buying a Zhonas.\nSo?  First off, mage diversity is laughable since the removal of DFG and Athenes nerf.  However, Zhonas is an item counter to survive Zed's burst.  It's an essential against many plays, and this argument is horrendous!  There's still five other item slots.\n\nZed is so easy to counter though!  Especially if defending, zhonas is incredible.  He's a highly mobile assassin, I get that.  He's very strong and if played right, very very powerful.  Yet... why aren't you whining about Leblanc?  This mage assassin has twice the mobility with half the risk and quite a fair amount of burst.  Zed is higher risk higher reward.\n\nI used to bitch about Zed until I realized all I had to do was study him and learn how to play against him.  Don't bitch about the current bandwagon champions.  Instead, learn to play against them and you will thrive!  Consider it a blessing that Zed is so commonly picked after learning his weaknesses, rather than bitch and cry about them.\n\nOR you can play Zed if he's so OP.  Problem solved.","replies":[{"poster":"LostMarble","date":"2015-02-27T05:11:03.299+0000","up_votes":2,"down_votes":1,"body":"First of all, the item is Zhonya's. And not every midlaner is an ap champ. \n\n\"The ADs should buy qss\" which is a magic resist item, so half it's usefulness is gone when playing against Zed.\n\nBesides that, the biggest issue with Zed is not his wave clear or his ability to destroy squishies, it's the fact that he never puts himself at risk to do these things. If he ults an AP in the middle of their team and they Zhonya's he can just port back to his shadow and try again later. If he's split pushing and the whole enemy team come to stop him, he can just shadow away and come back later, meanwhile the other 4 people on his team are doing whatever they want uncontested. If they send one, that person is most likely dead because he can just tower dive. If they send two, then the other three team members are outnumbered.\n\nZed has so many strengths, and riot chose to address something that wasn't one of them.","replies":[]}]}]},{"poster":"Junkο","date":"2015-02-26T09:10:39.262+0000","up_votes":11,"down_votes":5,"body":"They took away 34% of her passive speed, that's pretty fucking huge especially early game.","replies":[{"poster":"Remlap1223","date":"2015-02-26T18:59:08.852+0000","up_votes":6,"down_votes":2,"body":"No, they didn't, they just lowered the AA framerate.  She doesn't Aa any slower, she just finished it slower.  Basically the time she derps around after an AA was increased, which is irrelevant because she gets a free dash after each AA.","replies":[]}]},{"poster":"Kuroi86","date":"2015-02-26T09:40:19.041+0000","up_votes":6,"down_votes":5,"body":"You make it sound like you don't want these champs balanced, you want them gutted.\nWhy should anyone take what you have to say seriously if that is your opinion?","replies":[{"poster":"Remlap1223","date":"2015-02-26T18:55:24.576+0000","up_votes":5,"down_votes":2,"body":"What?  I don't want Zed gutted.  Back when everyone was whining about Yasuo being OP, I LOVED playing against Zed.  He was actually fun to play against because you actually had a chance to outplay him, and when you lost, you didn't feel like you got cheesed by an OP champion, you felt like that guy was good at zed.  And then preseason came, Riot killed off all of the mana mid laners who's names weren't Ahri and LeBlanc, and now Zed is OP because none can stand against him.\n\nAs for Kalista, yes I want her gutted.  She should have NEVER been released with that kit.  The only way that Kalista is going to be balanced with her current kit is:\n\n* She gets Ashe's level 1 attack speed and scaling.\n* She loses 25 mana each time she hops, and takes equal health damage if she runs oom.\n* The oathsworn damage is converted to physical damage, the proc time is increased back to 8 seconds, and does PHYSICAL damage.\n* She loses the slow on rend, and has it replaced with a 1% missing health execute per spear (on champions alone, flat damage stays and is heavily nerfed on minions and monsters), with grievous wounds.  Severely increase the cool down time, and either increase the mana cost, or remove the reset on minions and monsters.\n* She is unable to use her ultimate if her oathsworn is rooted, stunned, or silenced.  Give her a SLIGHT CD reduction compensation buff.\n\nLiterally all that is what will make her balanced.  That's a problem.  That's a problem of Lee Sin proportions.","replies":[{"poster":"AsianBear615","date":"2015-02-27T05:01:45.597+0000","up_votes":2,"down_votes":0,"body":"Just sitting here with my mid lane {{champion:1}} ... (Pretty sure her name isn't Ahri or Leblanc either.)","replies":[]},{"poster":"OyddAWqJ5r","date":"2015-02-26T23:24:57.924+0000","up_votes":2,"down_votes":1,"body":"> * She gets Ashe's level 1 attack speed and scaling.\n> * She loses 25 mana each time she hops, and takes equal health damage if she runs oom.\n> * The oathsworn damage is converted to physical damage, the proc time is increased back to 8 seconds, and does PHYSICAL damage.\n> * She loses the slow on rend, and has it replaced with a 1% missing health execute per spear (on champions alone, flat damage stays and is heavily nerfed on minions and monsters), with grievous wounds. Severely increase the cool down time, and either increase the mana cost, or remove the reset on minions and monsters.\n> * She is unable to use her ultimate if her oathsworn is rooted, stunned, or silenced. Give her a SLIGHT CD reduction compensation buff.\n\nYou do realize Ashe has one of the godliest base attack speeds and scalings of marksmen in the game right?\n\nhttp://media-titanium.cursecdn.com/attachments/49/229/base2.png\n\nMana on hop is a silly concept since she can't exactly choose not to hop. Same goes for a health cost.\n\nOathsworn damage being physical is meh. Doesn't mean too much either way. That's something that should be left alone in my opinion because it's one of her healthier mechanics. The damage being lowered for ranged Oathsworns makes sense though since it is far easier to proc.\n\nRend is perfectly fine as well. What isn't fine is how it isn't compensation for her passive but rather tossed on top of it.\n\nI feel the same way about her ult as I do Rend. But the 2 second knockup is pretty dumb on a mobile marksman. 1 second is much more appropriate as it definitely does not take 2 seconds for a CC based Oathsworn to followup with his/her combo.\n\nIt's the passive that is flawed. But not the passive itself, but the exploitation of it through attack speed. They need to keep her base attack speed the same but remove her attack speed scaling and replace it with BONUS attack speed per level on her passive. That way building attack speed is still viable but not kangaroo on crack viable. It would also barely hurt attack damage Kalista at all. Heck, it should be enough bonus attack speed to where it's worth more than her previous scalings so attack damage Kalista benefits from it. There should be a tradeoff for her deciding not to spec into insane mobility and go for damage instead.","replies":[{"poster":"Remlap1223","date":"2015-02-27T03:16:43.380+0000","up_votes":2,"down_votes":1,"body":"> You do realize Ashe has one of the godliest base attack speeds and scalings of marksmen in the game right?\n\nMeant to say Caitlyn, forgot Ashe got her attack speed buffed early game.  Also want to mention that graph is innacurate.  There's no way that Ashe and Tristana have the same attack speed scalings because Ashe has the highest in the game alongside Caitlyn, and the only ones that I can think of that are lower than Tristana's are Annie, Nautilus, Jinx, and Singed.  By level 18, Ashe gets a bonus 68% of her attack speed, while Tristy only gets 25%.  Miss Fortune should be much higher than she is, second if I'm not mistaken, but I've already made my point that the graph is wrong.\n\n> Mana on hop is a silly concept since she can't exactly choose not to hop. Same goes for a health cost.\n\nUh yeah she can, you just don't click after you AA.  Not that hard.  It's to give her an actual cost for her ridiculous mobility and kiting ability.\n\n> Oathsworn damage being physical is meh. Doesn't mean too much either way.\n\nIt means the world.  One of the chief complaints of Lee Sin is that his E is magic damage.  It makes itemizing against him insanely difficult.  Zed has the same problem with his passive.  So does Kog'Maw and Miss Fortune, albeit to a much lower extend since their damage values are actually balanced for the mobility they lack.\n\n> That's something that should be left alone in my opinion because it's one of her healthier mechanics.\n\nHow the hell is a free % max health magic damage nuke on an ADC healthy?  Not only does is it a mindless ability that pretty much allows Kalista to insta-gib an enemy every six seconds with a fucking Annie autoattack, but even if she attacks first and her support procs the passive, she still gets the kill.  That's not balanced in any way, shape or form.  It not only rewards bad teamplay, but it has no counterplay.\n\n> Rend is perfectly fine as well. What isn't fine is how it isn't compensation for her passive but rather tossed on top of it.\n\nA champion that has a free dash on every fucking auto attack should not be given a slow.  One of my biggest bugbears with Yasuo is his dash, but that pales in comparison to Kalista because he's melee, and he has to charge up his knockup.  Kalista just has to Q you, rend, and then she'll kite you to death.  Again, rewards bad teamplay, has no counterplay.\n\n> I feel the same way about her ult as I do Rend. But the 2 second knockup is pretty dumb on a mobile marksman. 1 second is much more appropriate as it definitely does not take 2 seconds for a CC based Oathsworn to followup with his/her combo.\n\nWhen did Kalista steal GP's oranges?  Did his dad have some spares on his soul after GP shanked him?  Did Kalista learn Olaf's secret to Ragnarok, and gave the secret to her Oathsworn?  Why does she get to give her support, a get out of jail free pass, when that's the support's job?  Again, this ability rewards bad teamplay, and because it's immune to disables, has no counterplay.  I will agree that a two second knockup is ridiculous, because it's bloated and an indirect nerf to Olaf and Gangplank.\n\n> It's the passive that is flawed. But not the passive itself, but the exploitation of it through attack speed. They need to keep her base attack speed the same but remove her attack speed scaling and replace it with BONUS attack speed per level on her passive. That way building attack speed is still viable but not kangaroo on crack viable. It would also barely hurt attack damage Kalista at all. Heck, it should be enough bonus attack speed to where it's worth more than her previous scalings so attack damage Kalista benefits from it. There should be a tradeoff for her deciding not to spec into insane mobility and go for damage instead.\n\nI disagree for two reasons.  One, that'd be a nightmare to code for, second, it'd be a nightmare to the Kalista player trying to figure out when she can jump.  I think that her hop and spear flinging is a huge part of her identity, and I wouldn't give that up, but it also doesn't have any tradeoffs.  She gets Ashe's utility while being more mobile than Lucian and Vayne combined, and having more burst than Kog'Maw.  Honestly, the damage can stay because she doesn't have any steroids, so I'm ok with Oathsworn's passive as long as the support can steal a kill, the cooldown is increased to it's original, and she loses the slow on her E, and the reset for jungle monsters.  I like my idea of giving her grievous wounds an an execute to compensate, because it fits with her kiting ability without being oppressive.  \n\nI'm also ok with her real passive if it gets a real, tangible cost to it, not the bullshit \"herp derp can't cancell AAs.\"  You know who benefits the most from that?  Noobs.  Noobs get to not only re-position themselves retardedly easily, they still get the damage of the auto attack, and all the benefits that come with it (Oathsworn and Rend).\n\nTR;DL Kalista needs a rework, whether it be on a Miss Fortune small scale, or a Sion large one, she needs a real identity other than the \"Free Win {{champion:64}}\" ADC.  It's actually not fair for me to compare her to Lee Sin, because while Lee Sin is bloated, he requires *some* semblance of skill and knowledge of his kit to play.  I mean FFS, Keyori got a pentakill on his first game with Kalista, and that was BEFORE Riot buffed her.","replies":[]}]}]}]}]},{"poster":"grLKQ9ma0o","date":"2015-02-26T05:15:51.805+0000","up_votes":6,"down_votes":3,"body":"The Kalista nerf hit her about as hard as actual Nerf darts hurt anyone they hit. They said \"more to come...\" with it, so she's still as OP as ever.","replies":[]}]},{"poster":"Unironic SJW","date":"2015-02-26T02:18:16.218+0000","up_votes":23,"down_votes":3,"body":"kalista is more like vayne on crack\n\nvayne's Q is her passive, except vayne's Q has a 6 sec cooldown at rank 1 if you autoattack something, and a 12 second cooldown if you use it as an escape, which goes down to 2 when autoing and 8 when not autoing\nrend is a better version of silver bolts that interacts with runnans, something that silver bolts is specifically coded NOT to do\nvayne's utility E is a high CD high mana cost pushback that does little damage and might as well be a skillshot that can seriously screw you over if you use it incorrectly, kalista's utility W is free vision and 12% max health damage every 12 seconds\nvayne's ultimate gives her a brief stealth on tumble, extra AD and chasing power, kalista's ultimate is almost a reverse thresh lantern that turns the support into malphite\n\nAlso where's the skillcap? \n\nVayne is a high skillcap champion where playing her without a full understanding of what you can do both in lane and in fights likely means you will feed with her looking like an idiot because you tumbled into the enemy team while trying to be like Doublelift.\nKalista may be hard to play at her full potential, but you're probably not feeding with her because her passive simplifies the most fundamental mechanics of the position.","replies":[{"poster":"VardenSalad","date":"2015-02-26T16:09:47.030+0000","up_votes":3,"down_votes":0,"body":"Good post and I think you're right.","replies":[]},{"poster":"Minrog","date":"2015-02-26T23:44:44.571+0000","up_votes":1,"down_votes":0,"body":"I think Kalista is one of the lower skill cap champions tbh.  I look at somebody like Ezreal or Azir and it really matters how you micro your character.\n\nKalista you figure out how to bind attack move and make sure you are bouncing a lot, you learn to pull your support back when their health is lowish and you wait while your Rend stacks up for a while and pop it.  Positioning is the most important aspect of micro in LoL and Kalista doesn't have to think about it, which makes me ashamed for the Riot developers.","replies":[]},{"poster":"IceKingChernobog","date":"2015-02-26T22:01:31.287+0000","up_votes":1,"down_votes":0,"body":"you forgot to throw in better ultility than {{champion:22}}  and {{champion:110}}  while hyper mobile and has a superior version of {{champion:29}}'s  E","replies":[]}]},{"poster":"Slushi Simcambi","date":"2015-02-26T00:36:09.360+0000","up_votes":13,"down_votes":3,"body":"I remember when he came out I was like OMG what mobility what a unique idea for an ADC.\n\nThen this monstrosity comes out and I'm like...\n{{champion:32}}  \"meh\"","replies":[]},{"poster":"Mephistophilis","date":"2015-02-26T11:58:40.982+0000","up_votes":8,"down_votes":1,"body":"Sometimes i think Riot balance team lives in another world. Sometimes i feel {{champion:64}} {{champion:429}} {{champion:238}} {{champion:254}} are mafia bosses that cannot be touched.","replies":[]},{"poster":"BeatzBoyFTW","date":"2015-02-26T09:47:01.761+0000","up_votes":8,"down_votes":2,"body":"\"We had to nerf {{champion:13}} {{champion:76}} because they were quite oppressive at top lane, and pretty much conquered it with all the free range attacks & aa they give\"\n\n{{champion:150}}","replies":[{"poster":"Rinky Dinky","date":"2015-02-26T16:42:22.811+0000","up_votes":2,"down_votes":0,"body":"Gnar has been nerfed muiltiple times -_-","replies":[{"poster":"Regina George","date":"2015-02-26T18:44:10.618+0000","up_votes":6,"down_votes":0,"body":"and yet he's still amazing! \n\nGnar's build full tank and still kills you with no effort.","replies":[]},{"poster":"BeatzBoyFTW","date":"2015-02-26T23:10:53.857+0000","up_votes":1,"down_votes":0,"body":"Everyone said the same thing about Kassadin & Lee Sin....","replies":[]}]}]},{"poster":"2pudge1cup","date":"2015-02-26T16:01:56.977+0000","up_votes":3,"down_votes":0,"body":"Remember when she first came out and people thought she was weak?\n\nGood times.\n\nIn all seriousness there needs to be significantly better quality control before some of these champs make it to live.  With that passive alone, kalista shouldn't have even gotten off the drawing board unless the rest of her kit sucked completely.  Anyone with eyes and half a brain could see that.\n\nAnd this isn't a new thing at all.  It's getting to the point where it's kind Groundhog Day where we see the same balance arcs for new champs time and again.","replies":[{"poster":"Rinky Dinky","date":"2015-02-26T16:42:00.944+0000","up_votes":3,"down_votes":0,"body":"The CertainlyT effect","replies":[]}]},{"poster":"Blastermine","date":"2015-02-26T05:31:08.456+0000","up_votes":3,"down_votes":0,"body":"Kalista is the stupidest champion to play with. Picked {{champion:89}} ? now you have to babysit the adc all game long no matter what. It's doubly as bad if you don't play Summoner's Rift.","replies":[]},{"poster":"I Main Swain","date":"2015-02-26T21:44:42.576+0000","up_votes":2,"down_votes":0,"body":"kalista should either have her leaping passive removed or she should have the shortest range of every range champ in the game.","replies":[]},{"poster":"Leti the Yeti","date":"2015-02-26T09:43:01.870+0000","up_votes":2,"down_votes":0,"body":"Pretty certain Riot is known for being inconsistent","replies":[]},{"poster":"Narog","date":"2015-02-26T01:56:11.448+0000","up_votes":3,"down_votes":1,"body":"Riot balancing is like a Solo queue game were everyone has different play styles","replies":[]},{"poster":"Albireo","date":"2015-02-26T09:04:57.746+0000","up_votes":2,"down_votes":1,"body":"Well, this wasn't fun either.\nhttps://www.youtube.com/watch?v=FAg4y2co01M","replies":[]},{"poster":"2000boxes","date":"2015-02-26T21:27:34.639+0000","up_votes":1,"down_votes":0,"body":"But Lucian has 450 range","replies":[{"poster":"X Frady","date":"2015-02-26T22:26:20.428+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=2000boxes,realm=NA,application-id=3ErqAdtq,discussion-id=u47I2enm,comment-id=000e,timestamp=2015-02-26T21:27:34.639+0000)\n>\n> But Lucian has 450 range\n\nNot sure if it's legitimate, but allow me to correct you: http://leagueoflegends.wikia.com/wiki/Lucian","replies":[{"poster":"2000boxes","date":"2015-03-25T04:26:54.738+0000","up_votes":1,"down_votes":0,"body":"i literally got the number 450 by clicking lucian's portrait while i was in game and when i looked at range the number was 450\nthen again that was like november 2014 so it might have changed even though lucian's range wasn't buffed in the patch notes","replies":[]}]}]},{"poster":"Pretty Dhizi","date":"2015-02-28T01:56:59.736+0000","up_votes":1,"down_votes":0,"body":"Something's wrong with a champion when your passive lets you kite **TOWARDS** the enemy and even pass them up. Especially when the passive is supposed to allow you to **ESCAPE** from brawlers, not circlejerk around them like it's a comedy reel.","replies":[]},{"poster":"WolfBV","date":"2015-02-27T05:51:08.709+0000","up_votes":1,"down_votes":0,"body":"\"Ooo whatcha' say?\"","replies":[]}]}