{"poster":"xxHunter2000xx","date":"2015-11-16T20:08:51.863+0000","title":"Zed *-*","subforum":"Campioni e gameplay","up_votes":1,"down_votes":0,"body":"Ho provato zed tipo un mese fa quando era gratis e lo adoro, ora ho deciso di comprarlo, i risultati per&ograve; erano stati un po deludenti..\r\nmi servirebbe qualche consiglio su come giocare e quali mosse maxare","replies":[{"poster":"Get Shinva","date":"2015-11-21T19:40:33.130+0000","up_votes":3,"down_votes":0,"body":"Adesso con la preseason e un pò cambiato il sistema. Sicuramente devono ancora sistemare il discorso assassini della mid perché dalla Juggernaut patch è tutto peggiorato per loro. Tank che fanno più danni in meno tempo di loro (ved. {{champion:31}} ) e ADC che con una semplice pressione del tasto E non ti permettono di eseguire una combo completa, risultando quindi il tuo ruolo principale una cosa inutile (ved. {{champion:15}} ).\nComunque non è del tutto pessimo.\nPer prima cosa impara a farmare e con Zed non hai problemi dal punto di vista dei danni base iniziali a contrario di Talon che invece ne soffre un pò di più early ma si sviluppa meglio in mid game mentre Zed ha bisogno di molta farm per cominciare a muoversi in maniera letale per la mappa.\n\nDunque.. partiamo con una semplice build per cominciare a far danno.\nInizi comprando {{item:1036}} {{item:2003}} {{item:2003}} {{item:2003}} {{item:3340}} \nTi rechi a mid e cominci a valutare se il tuo avversario tende di più a darti fastidio o farmare, quanto danno ti fa in base alle skill e agli autoattack e a quanto ti puoi avvicinare. Non farti vedere timoroso e nemmeno troppo sciocco da avvicinarti, devi essere sicuro di te, spavaldo.. ma in che senso?\n\nVedi un minion vicino a lui che sta per morire e ti avvicini per lanciargli una Q o picchiarlo di Autoattack.\nNon ti fai vedere lontano come per dire.. \"omg ho paura, questo mi sfonda..\" e nemmeno \"Ora mi avvicino e trollo, massimo crepo e rido..\".\nNo.. usa la testa.\nTi consiglio di andare su youtube e vedere le giocate di Pobelter con Zed, ti insegna molto a capire non tanto la meccanica ma il sistema che usa lui per farmare  e quanto ti puoi sbilanciare.\nCome prossimo oggetto, una volta raggiunti i 1300 gold, prendi questo {{item:1038}} .\nPoi cerca di seguire di base questa build: {{item:3153}} {{item:3142}} {{item:3033}} {{item:3031}} {{item:3071}} {{item:3158}}.\n\nUna volta presa l'MC, dedicati alla prima parte della Lama del Re in Rovina, ovvero fai subito la Sciabola di Bilg. e poi completi la Youmuu.\nUna volta finita la Youmuu finisci la Sciabola con la Lama del Re in Rovina e ti dedichi al resto.\nPoi ovviamente devi valutare tu le cose.\nHai contro un Malzhar che ti rompe le scatole con la R?\nOk.. dopo l'MC e gli stivali normali, prenditi questi {{item:3140}}, così quando lui cerca di andare all in, utilizzi questo per interrompere i suoi stun e questo ti permette o di contrattaccare di ultimate o scappare.\n\nIl resto lo fai giocando e guardando molto giocatori come Pobelter e Faker su youtube.\nE' importante farmare, dare presenza e soprattutto essere sicuro di quello che fai.\nConoscere cosa puoi fare e cosa no.. cerca di non divare mai, almeno che veramente tu non sei sicuro di farlo per ucciderlo velocemente.\n\nPer il resto divertiti, questo è quello importante :D","replies":[]},{"poster":"ubercodlegend200","date":"2015-11-16T21:07:56.823+0000","up_votes":1,"down_votes":0,"body":"impara a beccare la q, allenati ad evitare gli skillshot mentre farmi, stai sempre attento ad usare l' ombra perchè è il tuo escape, ma anche un ottima fonte di danno, usala con saggezza, cerca sempre di scalare a bassa vita il nemico almeno la metà ma anche 1/3 o meno per sicurezza soprattutto all'inizio, tieni a mente che la zhonya ti è nemica, e di usare sia skill che oggetti mentre ulti, oltre a tirare un aa che fa molto danno di passiva . starta come ti trovi più comodo, io faccio long sword+pozze per abitudine ma non so quanto sia worth ad ora. al primo recall faccio il martello, il brutalizzatore non c'è più  (RIP).\ndopodichè faccio la botrk, di scarpette ognuno fà le sue preferite, poi finisco la yomuu, last wisper, questo è ciò che buildo sempre il resto vai a situazione in sto periodo ad esempio mi piace la danza della morte, quindi la buildo.","replies":[{"poster":"xxHunter2000xx","date":"2015-11-20T19:00:10.108+0000","up_votes":1,"down_votes":0,"body":"Grazie mille! come ultima cosa puoi dirmi in che ordine maxare le mosse?","replies":[{"poster":"ubercodlegend200","date":"2015-11-20T19:19:53.016+0000","up_votes":1,"down_votes":0,"body":"starti di q, poi w, poi e , maxi la q poi la e poi la w","replies":[]}]}]},{"poster":"MaVkS","date":"2015-11-16T20:41:32.940+0000","up_votes":1,"down_votes":0,"body":"no lascia stare,aspetta la fine della preseason perche ora come ora non e buono contro gli ap mid.\nio lo maino lo giocavo praticamente quasi sempre adesso non piu...perche le mastery vecchie ti davano molto danno, rigenerazione hp e anche molti hp quindi avevi un early buono,facevi male avevi un buon sustain e quindi potevi farti una buona partita.\ncon le nuove mastery, che non ti danno tanto danno come prima zed in early fa 1 po cagare proprio come talon,mentre i mid ap non ne risentono molto del calo di danno e continuano a farti 1 male cane,l'ad assassin ne ha risentito parecchio.\nproprio ieri io ho fatto 5 tante partite con zed, provando nuove mastery, facendo 1 sacco di prove ma l'early che ha ora non si puo risolvere quindi ti sconsiglio di comprarlo proprio adesso,inoltre ti dico che i pro non ci fanno piu i score di 1 volta quindi qualcosa significa noo?\npoi posso provare quello che dico dicendoti che 5 mesi fa ho giocato con zed, usando 1 smurfetto nabbo al lvl 5 quindi senza mastery rune ecc... e quindi senza danno com'è ora con le nuove mastery,un suo shuriken levava cosi () senza toccare minion (e quindi senza riduzione danni) invece con il main lvl 30 zed levava cosi (  ) perche c'era un grande danno grazie soprattutto alle mastery che adesso fanno cagare...credimi so quel che dico, perche prima di dirlo ho fatto un sacco di prove e posso confermarlo.\npoi se invece vuoi prendere 1 palo in faccia, e comprarlo perche sei troppo curioso vai tranquillo non ti fermero, ma io ti ho avvertito non ti aspettare il zed che usavano i pro 2 settimane fa sui video.\nbuona serata hunter","replies":[]},{"poster":"XxShido91xX","date":"2015-11-16T20:33:23.764+0000","up_votes":1,"down_votes":0,"body":"allora, inizialmente sarà difficile combinare gli attacchi con la tua ombra! ma è normale....la forza di Zed sta nel suo immenso burst della R!!! io personalmente con lui inizio sempre d'idra famelica per avere rubavita e un ulteriore danno da associare alla mia cara ulti.........prima del 6 pensa a farmare, inizialmente se non sai coordinare i tuoi pokke con l'ombra non killerai a meno che non sa nabbissimo l'altro mid laner! dal 6 in poi iltuo compito sarà arrivare ultare e ritirarti da dove sei partito ed eclissarti nel nulla.......x iniziare la combo DEVI avere l'energia al massimo poichè la tua R fa una % di danni in base a quanto gliene fai nei 3 secondi del marchio....il tuo compito sarà ultare, lanciare la tua ombra e fare W-Q più ignite idra etc e, successivamente ripremi R per tornare indietro ed evitare cosi possibili fight successivi","replies":[]},{"poster":"02ANDRY","date":"2015-11-16T20:10:32.735+0000","up_votes":1,"down_votes":0,"body":"allenati tanto...inizialmente è abbastanza difficile giocarlo","replies":[]}]}