{"poster":"Psytex420","date":"2020-02-28T12:40:54.484+0000","title":"Wer ist der Uhrheber von Fan-Art ?","subforum":"Champions & Gameplay","embed":{"description":"Dragon Master Swain Wallpaper by Ocelot54 League of Legends champion wallpaper. Find more HD LoL desktop backgrounds in our wallpapers gallery.","url":"http://lolwp.com/swain/dragon-master-swain-wallpaper-by-ocelot54/","image":"http://lolwp.com/wp-content/uploads/2014/10/Lee-Sin-Classic.jpg"},"up_votes":1,"down_votes":0,"body":"Wer ist der Uhrheber von Fan-Art, Riot oder der Creator ?  \r\nUnd was gebe ich als Credits an, wenn ich Fan-Art weiter verwende ?\r\n\r\nHier ein Ausschnitt vom \"Legal Jibber Jabber\"  ( https://www.riotgames.com/de/rechtliches )\r\n\r\nUnter der Voraussetzung, dass du alle in dieser Richtlinie dargelegten Regeln (die „Regeln“) sowie die Nutzungsbedingungen befolgst, erteilt Riot Games („Riot“ bzw. „Wir“) dir eine persönliche, nicht exklusive, nicht unterlizenzierbare, unübertragbare, widerrufbare und limitierte Lizenz, um abgeleitete Werke, welche auf Riots IP basieren, zu nutzen, vorzuzeigen und zu erschaffen, und alleinig zur nichtkommerziellen Verwendung in der Community (Ausnahmen weiter unten).\r\n\r\nich werd da nicht so ganz schlau draus, aber heißt \"eine persönliche, nicht exklusive, NICHT UNTERLINZENZIEBARE, unübertragbare widerrufbare und limitierte Lizenz\" nicht quasi, dass Riot jegliche Rechte an Fan-Art hat ?\r\n\r\n\r\nDer oben angegebene link soll nur ein Beispiel sein, die Frage beziht sich auf's Allgemeine.\r\n\r\nMfg Psytex420","replies":[{"poster":"Izaya Kumiho","date":"2020-02-28T12:51:52.017+0000","up_votes":1,"down_votes":0,"body":">Wer ist der Uhrheber von Fan-Art, Riot oder der Creator ?\nUnd was gebe ich als Credits an, wenn ich Fan-Art weiter verwende ?\n\nIst es wirklich \"fanart\", wird der creator als artist erwähnt und das copyright von dem charakter (z.B. Lee) von Riot Games dazu geschrieben.\n\n>Artist: XY\n>All characters are under copyright and owned by Riot Games\n\n\nOptional auch:\n>Game: League of Legends (C)\n\nSind es offizielle Artworks, so solltest du den Krams nicht für Geschäfte nutzen. Du darfst kein Geld und keine Werbung mit solchen Bildern machen. Nutzt du die Bilder einfach nur so, musst du auch nur das copyright erwähnen, wenn ich mich richtig erinnere.","replies":[]}]}