{"poster":"HeWill Killsteal","date":"2018-08-11T15:51:59.940+0000","title":"Permanent Banned","subforum":"Spielerverhalten & Moderation","up_votes":3,"down_votes":10,"body":"Hi ich wurde heute den 11.08 permant auf meinem Acc gebannt ich hatte davor einen 14 Tage Bann bis zum 10.07 21:50 und habe seid da nicht mehr so stark geflamed wie bis zu meinem Heutigen match mit Gangplank ich wurde andauernt getower dived hab mein Team um Hilfe gebeten jedoch waren wir stark am verlieren und keiner konnte wirklich helfen. Um ehrlich zu sein hab ich mit einem Bann gerechnet nach dem was ich geschrieben hatte jedoch hatte ich nicht mit einem Perma bann gerechnet . Ich finde es einfach &uuml;bertrieben sehe es jedoch ein das was ich getan habe kein LoL Spieler tun sollte und es unfair meinem Team gegen&uuml;ber war jedoch finde ich das ein Perma Ban sehr unfair ist da es 1 Game war seit meinem letzten Bann. Ich sehe das Heutige Game als ausnahme da in meinen anderen games ich immer postiv bin jedoch hat sich mein Adc so stark &uuml;ber mich lustig gemacht und witze gerissen das ich in beleidigt habe ich finde mein Verhalten zwar extrem peinlich und sch&auml;me mich f&uuml;r meine Chatlogs aber ich finde es einfach Unfair das man nur sieht was ich gesagt habe und nicht in betracht zieht wie ich mich in anderen games verhalte und meine Teammates ermutige.","replies":[{"poster":"BoostedBonob0 x2","date":"2018-08-11T15:57:56.808+0000","up_votes":6,"down_votes":0,"body":"Da hatte ja jemand richtig gut aus seinen ersten bann gelernt, leider macht rito keine ip bans","replies":[{"poster":"HeWill Killsteal","date":"2018-08-11T16:02:31.820+0000","up_votes":1,"down_votes":7,"body":"> [{quoted}](name=BoostedBonob0 x2,realm=EUW,application-id=KYnfKGf0,discussion-id=jJ0HTeFl,comment-id=0003,timestamp=2018-08-11T15:57:56.808+0000)\n>\n> Da hatte ja jemand richtig gut aus seinen ersten bann gelernt, leider macht rito keine ip bans\n\ney Ganz ehrlich ich habe 1 Monat nicht geflamed durch den 14 tage bann ich find es einfach dumm meinen 7 jahre langen acc zu bannen wegen sowas \nTyler 1 hatte sogar eine Chance","replies":[{"poster":"Zyzyx","date":"2018-08-11T16:08:55.199+0000","up_votes":11,"down_votes":2,"body":"Boah wie mir dieser Käse mit Tyler1 auf den Zeiger geht.\n\nNein, Tyler1 hat NICHT die Chance bekommen die du gerne hättest. Du hättest gerne deinen Account wieder, richtig? Das wird nicht passieren und das ist bei Tyler1 auch nicht passiert. Tyler1 hatte über 20 Accountbans und diese sind alle noch aktiv und werden es auch für immer bleiben. \nTyler1 hatte ZUSÄTZLICH zu seinen Accountbans noch einen ID-Ban, das heißt er war als Person gebannt und durfte keine Accounts erstellen und auf keinem Account spielen. DIESER Ban wurde aufgehoben und die selbe Chance hättest auch du, wenn du so einen Ban hättest. Hast du aber nicht. Du hast einen Account-Ban und die sind permanent. Sowohl bei dir als auch bei Tyler1 als auch bei jedem anderen. \n\n> Ganz ehrlich ich habe 1 Monat nicht geflamed\n\nJa das reicht aber nicht. Du darfs GAR NICHT flamen. Nicht nur \"selten\" oder \"nicht so arg\", nein, gar nicht. Und das wurde dir wirklich überdeutlich mitgeteilt. Sorry, aber das hast du einzig und allein dir selbst zuzuschreiben. Du hattest eine faire Chance und hast sie verkackt. Das liegt an dir, nicht an Riot oder sonst wem.","replies":[{"poster":"HeWill Killsteal","date":"2018-08-11T16:13:53.476+0000","up_votes":2,"down_votes":10,"body":"> [{quoted}](name=Zyzyx,realm=EUW,application-id=KYnfKGf0,discussion-id=jJ0HTeFl,comment-id=000300000001,timestamp=2018-08-11T16:08:55.199+0000)\n>\n> Boah wie mir dieser Käse mit Tyler1 auf den Zeiger geht.\n> \n> Nein, Tyler1 hat NICHT die Chance bekommen die du gerne hättest. Du hättest gerne deinen Account wieder, richtig? Das wird nicht passieren und das ist bei Tyler1 auch nicht passiert. Tyler1 hatte über 20 Accountbans und diese sind alle noch aktiv und werden es auch für immer bleiben. \n> Tyler1 hatte ZUSÄTZLICHE zu seinen Accountbans noch einen ID-Ban, das heißt er war als Person gebannt und durfte keine Accounts erstellen und auf keinem Account spielen. DIESER Ban wurde aufgehoben und die selbe Chance hättest auch du, wenn du so einen Ban hättest. Hast du aber nicht. Du hast einen Account-Ban und die sind permanent. Sowohl bei dir als auch bei Tyler1 als auch bei jedem anderen. \n> \n> Ja das reicht aber nicht. Du darfs GAR NICHT flamen. Nicht nur &quot;selten&quot; oder &quot;nicht so arg&quot;, nein, gar nicht. Und das wurde dir wirklich überdeutlich mitgeteilt. Sorry, aber das hast du einzig und allein dir selbst zuzuschreiben. Du hattest eine faire Chance und hast sie verkackt. Das liegt an dir, nicht an Riot oder sonst wem.\n\nEr Hatte seinen Lv 30 Account wieder du hast keine Ahnung du spielst hier Moral Apostel dabei geht es nicht um deinen Account ich verstehe es einfach nicht ich habe meinen Account seit 7 Jahren seid Draven Rauskam und nichts ist passiert die Regeln waren nie so Streng wie 2018 ich flame 1 MOnat nicht mache nichts in anderen Games bin ich eine Starke hilfe ich main SUpport versuche zu grinden das Ego der Adc bringt mich nicht down gewinne games finde neue Freunde und bin sehr Positiv das game mit GP war eine Ausnahme ich wurde von meinem Eigenen Team gereizt da ich schlecht bin ich würde dich gerne in so einer situation sehen wenn Riot von mir erwartet das ich jedes game /muteall mache ist das für mich keine Option ich finde es unfair es gibt soviele die Inten und lachen und witzige darüber machen während ich versuche zu Gold zu grinden und die werden nicht gebannt da sie ja nur schlecht spielen aber wenn ich mich über sowas aufrege werde ich gebannt einfach Dumm","replies":[{"poster":"Zyzyx","date":"2018-08-11T16:26:42.964+0000","up_votes":7,"down_votes":0,"body":"> Er Hatte seinen Lv 30 Account wieder du hast keine Ahnung\n\nHat er nicht. Alle Accounts die gebannt waren, sind nach wie vor gebannt. Und doch, ich fürchte ich hab Ahnung. Ich bin seit 7 Jahren in den Spielerverhalten-Foren aktiv, ich hab über 20.000 Beiträge in diesem Bereich geschrieben, ich habe mit Riot an Spielerverhalten-bezogenen Projekten gearbeitet, ich habe meine Bachelor-Arbeit über das Thema geschrieben, bin Mitglieder der Fairplay-Alliance und lese allgemein so ziemlich alles was es zu dem Thema zu lesen gibt. \nDas alles konntest du natürlich nicht wissen, aber long story short: Doch, ich hab Ahnung. Und ich kann bei aller Bescheidenheit durchaus auch hinzufügen: Ziemlich viel Ahnung sogar. \n\n> die Regeln waren nie so Streng wie 2018\n\nAn den Regeln hat sich 2018 nichts geändert. Und ganz spezifisch an der Tatsache dass nach dem 14-Tage-Ban der Perma auch bei kleineres Vergehen sofort kommt hat sich seit mindestens 4 Jahren nichts geändert. \n\n> wenn Riot von mir erwartet das ich jedes game /muteall mache ist das für mich keine Option\n\nRiot erwartet von dir, dass du dich an die Regeln hältst. Wenn das auch keine Option für dich ist, kannst du kein League spielen.","replies":[{"poster":"Premade Noob","date":"2018-08-12T15:56:46.320+0000","up_votes":1,"down_votes":6,"body":"Dann solltest du auch wissen das dieses Bann-System für´n Arsch ist.\n\n> Riot erwartet von dir, dass du dich an die Regeln hältst. Wenn das auch keine Option für dich ist, kannst du kein League spielen.\n\nDas da ist gelogen. Kann dir aus Erfahrung sagen das Soft-inting gegen die Regel ist aber dagegen wird nichts gemacht.\nDu glaubst mir  nicht? Mach dir einen lvl 30 und verliere jedes game mit Absicht bis du gebannt wirst glaub mir ein freund ist zurzeit bei 50+lose und hat noch keinen bann fürs softinten.\n\nRiot Bannt nur Leute die Negativ im Chat auffallen oder die Mitte runterlaufen.Und ja mann wird auch schon für sachen wie \"Can you pls stop inting\" gebannt werden-------- {{sticker:sg-miss-fortune}}","replies":[{"poster":"Tempname2919","date":"2018-08-12T17:05:03.814+0000","up_votes":4,"down_votes":1,"body":"An der Aussage ist nichts gelogen. Selbst wenn du recht haben solltest und Riot absolut gar nichts machen würde, ist es dennoch verboten und somit \"erwarten sie von dir, dass du dich an die Regeln hälst\".\n\nSomit ist die Aussage an sich vollkommen korrekt^^\nWie Vergehen geahndet bzw. erkannt werden, hat nichts mit den Erwartungen Riots zu tun.\n\nNun aber zu dem Punkt das gar nichts gemacht wird, hier kann man tatsächlich diskutieren.\nIch stimme zu, dass das System gegen Feeder/Inter/Trolls etc. nicht optimal läuft, aber es ist nun mal schwieriger so etwas zu entdecken als jemand der im Chat toxic ist.\nIch meine ich kann nur Argumente aus dem Forum wiederholen: Wie unterscheidet man einen Inter (oder Softinter....was auch immer das nun ist :P) von jemanden der einfach nur schlecht spielt? Viele sagen immer, es ist einfach zu erkennen und bei Leuten die wirklich stumpf die Mitte runterlaufen stimme ich auch zu, aber es gibt nun mal Inter die schwer zu erkennen sind.\nZu mal auch Inter bestraft werden, sogar härter als der durchschnittliche Flamer, da die Inter direkt den 14 Tage-Bann erhalten.\nNur ist das leider noch nicht so zuverlässig.\n\nEgal, ist an der Stelle nur meine Meinung, in meinen Augen ist das System gegen Inter noch nicht optimal, aber es ist keine leichte Aufgabe dass System zu verbessern ohne unschuldige Spieler zu bannen. Ich glaube Riot wird da schon irgendwann eine Lösung finden.\n\nDies alles ändert aber nichts daran, dass die von dir zitierte Aussage nicht gelogen ist. Denn was Riot erwartet hat nichts mit dem ganzen System dahinter zu tun wie die Leute bestraft werden, dass sind zwei unterschiedliche Dinge.\nIch erwarte nämlich auch von jedem Spieler das diese sich an die Regeln halten...und mal so unter uns, außer die Spieler zu reporten die sich daneben benehmen, mache ich absolut gar nichts damit die Spieler ihre Strafe bekommen.\nTrotzdem ist es nicht gelogen das ich diese Erwartungen habe, dass kannst du mir glauben ;D\n\n> Und ja mann wird auch schon für sachen wie \"Can you pls stop inting\" gebannt werden\n\nHalte ich für ein Gerücht :P \nWenn jemand ne Strafe bekam wo dieser Satz vorkam, dann stand da garantiert noch mehr im Chatlog :)","replies":[{"poster":"Premade Noob","date":"2018-08-13T19:54:28.865+0000","up_votes":1,"down_votes":3,"body":"Es gibt eine sehr einfache Lösung um solche softinter zu Bannen, da man schon jedes game in der Matchhistory sehen kann und auch noch als replay sollte es auch einen Knopf geben wo man diesen direkt an einen AntiSoftInting Support sendet und es dort bearbeitet wird.\n\nRiot ist groß genug um sich so einen Support leisten zu können.\n\nHatte gerade eben ein Game wo ein Spieler meinte afk im Jungle rumzulaufen (Hat nicht mal Mobs dort gekillt) und nichts zu machen bis wir surrendern oder Open mid machen... Und rate was er geschrieben hat \"I wont get banned for stuff like this\". Sag mir was ich gegen solche Leute tun soll? Wenn ich ihm sage das er weiter spielen soll und damit aufhören soll bekomme ich einen report und werde dafür gebannt und er nicht ....\n\nGenau deswegen hören doch zurzeit die meisten Leute auf zu spielen, man wird gebannt weil man auf solche Leute wütend wird.\n\nDu kannst jetzt sagen \"Schreib halt dann gar nichts\", glaub mir solche Spieler gibt es in letzter zeit sehr viele und ab einem bestimmten punkt ist man mehr als genervt {{sticker:sg-soraka}}","replies":[{"poster":"Tempname2919","date":"2018-08-13T22:40:51.385+0000","up_votes":3,"down_votes":0,"body":"> Es gibt eine sehr einfache Lösung um solche softinter zu Bannen, da man schon jedes game in der Matchhistory sehen kann und auch noch als replay sollte es auch einen Knopf geben wo man diesen direkt an einen AntiSoftInting Support sendet und es dort bearbeitet wird.\n\n> Riot ist groß genug um sich so einen Support leisten zu können.\n\nAntiSoftInting Support? Wie stellst du dir das denn vor? Wie viele Leute sollen da denn beschäftigt sein?\nDafür wäre eine unglaubliche Menge an Mitarbeitern nötig. \nIch kenne die Zahlen nicht, aber wie viele Games werden pro Tag gespielt? Das muss eine riesige Zahl sein, wenn jedes Game ca. 30 Minuten geht, muss man für jedes Game ca. 10-15 Minuten aufwenden, ich gehe davon aus das man nicht jedes Game vollständig anschauen muss um ein Fehlverhalten festzustellen.\nAber folgende Dinge müssen halt wahrscheinlich gemacht werden: Game anschauen, bewerten, bestrafen und evtl. dokumentieren.\nRiot hat ca. 2500 Mitarbeiter laut Wikipedia, wie würde die Mitarbeiteranzahl aussehen mit diesem Support um all diese Spiele zu überwachen die gemeldet werden?\nUnd ich bin mir sehr sehr sicher das extrem viele falsche Reports aus Madness getätigt werden, da gabs vor einigen Wochen einen Fall wo sich hier im Forum jemand extrem über einen Inter aufgeregt hat.\nEin Blick auf die History hat gezeigt das der Inter gar nicht so geintet hatte, sondern einfach nur ein schlechtes Game hatte. Klar, dass war nur eine Sache von 3-4 Minuten, aber hier ist einfach die Menge ein großes Problem.\n\nAlso...du sagst Riot Games ist groß genug sich so einen Support zu leisten? Nein, sind sie nicht.\nDie Anzahl der Mitarbeiter würde in die Höhe schießen, ich glaube in diesem Support alleine wären mehr Mitarbeiter als Riot Games aktuell insgesamt besitzt. \nDas macht weder wirtschaftlich, noch logisch irgendeinen Sinn.\n\n> Hatte gerade eben ein Game wo ein Spieler meinte afk im Jungle rumzulaufen (Hat nicht mal Mobs dort gekillt) und nichts zu machen bis wir surrendern oder Open mid machen... Und rate was er geschrieben hat \"I wont get banned for stuff like this\". Sag mir was ich gegen solche Leute tun soll? Wenn ich ihm sage das er weiter spielen soll und damit aufhören soll bekomme ich einen report und werde dafür gebannt und er nicht ....\n\nJo, Pech gehabt würde ich sagen. Aber ich habe auch solche Leute mal in meinen Games, dann ist das eben so. Ich schreibe dann auch das ich das nicht okay finde und er doch bitte weiterspielen soll.\nOb ich reported werde dafür? Keine Ahnung, aber ich wurde in meinen 8 Jahren die ich nun schon spiele noch nie in irgendeiner Art bestraft. Einfach weil ich freundlich oder zumindest neutral bin.\nAus deiner Aussage kann ich mir gerade nur 2 Dinge vorstellen:\n\n1. Du **denkst** das du für eine einfache Aufforderung nen Report bekommst und gebannt wirst und versuchst es deswegen erst gar nicht.\n2. Du hast schon mal etwas geschrieben, aber in einer \"menschenunwürdigen\" Formulierung und hast damit dann eine Strafe kassiert. Diesen Bann beziehst du dann nicht auf die Formulierung, sondern auf die Aufforderung selbst.\n\nVielleicht ist es auch was anderes, aber die beiden Dinge sind mir nun aufgefallen.\nMan kann jemandem auch sagen er soll doch bitte weiterspielen und sein Verhalten unterlassen ohne einen Bann zu bekommen. Ich habe keine \"Gefängnis frei\"-Karte aus Monopoly, dass ist keine Zauberkunst die ich da beherrsche.\nWie gesagt, dass der Spieler bestraft werden sollte sehe ich genau so und evtl. kommt er durch, evtl. aber auch nicht. Es gab schon viele die dachten sie kommen mit ihrem Verhalten durch, wurden dann aber doch bestraft. Manchmal dauert es eben, ist doof, aber eine bessere Lösung wird es wohl momentan nicht geben (und nein, deine Idee ist eben nicht so gut und einfach)\n\n> Genau deswegen hören doch zurzeit die meisten Leute auf zu spielen, man wird gebannt weil man auf solche Leute wütend wird.\n\nSicher das Leute deswegen aufhören? Hast du dafür irgendwelche Quellen? Mag ein abgedroschener Spruch sein, aber ich finde solche Aussagen immer sehr schwach, wenn diese sich auf ein reines Bauchgefühl berufen.\nUnd man wird nicht gebannt weil man auf solche Leute wütend wird, sondern wie man sich im Spiel verhält.\nDurch flamen wird der Spieler auch nicht auf einmal aufhören. Im Gegenteil, damit erreicht er wohl möglich das was er möchte. Er triggert die Leute und kann diese dann auch noch einfach reporten.\nAber das Fehlverhalten dieser Person rechtfertigt nicht einfach beleidigend zu werden, afk zu gehen oder selbst zu inten. \n\n> Du kannst jetzt sagen \"Schreib halt dann gar nichts\", glaub mir solche Spieler gibt es in letzter zeit sehr viele und ab einem bestimmten punkt ist man mehr als genervt \n\n\"Schreib halt dann gar nicht\"\nWas erwartest du denn? Mag sein das es solche Leute gibt und das du genervt bist, kann ich verstehen. Aber wie schon aufgeführt bringt flamen doch eh nichts. Also warum dennoch in den Chat schreiben?\n\nWas bringt flamen eigentlich? Der Jungler wird sehr wahrscheinlich nicht auf einmal anfangen normal weiter zu spielen. Somit macht flamen noch mehr kaputt, denn ich als Unschuldiger in dem Game denke mir dann einfach nur: \"Na toll, jetzt auch noch ein Flamer.\" Mich zieht so etwas nur noch mehr runter.\n\nSorry für den langen Text.\nAch ja, ich will dir übrigens nicht vorwerfen zu flamen, dass geht so aus deinem Text hervor, daher habe ich meine Antwort nun so verfasst. Falls du kein Flamer bist, dann tut mir das natürlich Leid.","replies":[]}]}]}]}]},{"poster":"Sirrkas","date":"2018-08-12T08:25:40.156+0000","up_votes":3,"down_votes":0,"body":"Bitte, wenn du nicht weißt, was es mit den Banns von Tyler1 auf sich hat, hör einfach auf darüber zu reden. Du zeigst aktuell nur, dass du dich nicht mit dem Thema beschäftigt hast. \n\n>ich habe meinen Account seit 7 Jahren seid Draven Rauskam und nichts ist passiert die Regeln waren nie so Streng wie 2018 \n\nDas IFS gibt es schon etwa 3 oder 4 Jahren, spätestens seit dem sind die Regeln so streng. Wenn man im Tribunal einen Permabann erhalten hatte, blieb auch der für immer. \n\n> ich würde dich gerne in so einer situation sehen wenn Riot von mir erwartet das ich jedes game /muteall mache ist das für mich keine Option ich finde es unfair \n\nDu wurdest nicht bestraft, weil du einmal kein /muteall gemacht hast, du wurdest bestraft, weil du es zum 2 Wochenbann geschafft hast und dann wieder toxisch wurdest. Selbst wenn jemand anderes in so einer Situation sich mal im Ton vergreift, ist das nicht so wild. Klar, es geht besser, aber der Account kriegt wohl erstmal nur eine 10er CR. Du hattest die aber vermutlich schon, zumindest warst du schon deutlich weiter bei den Strafen. 2 Wochenbann + weiteres toxisches Chatverhalten = Permabann.","replies":[]}]},{"poster":"2uncreative4name","date":"2018-08-12T14:31:56.821+0000","up_votes":2,"down_votes":3,"body":"> [{quoted}](name=Zyzyx,realm=EUW,application-id=KYnfKGf0,discussion-id=jJ0HTeFl,comment-id=000300000001,timestamp=2018-08-11T16:08:55.199+0000)\n>\n> Boah wie mir dieser Käse mit Tyler1 auf den Zeiger geht.\n> ...\n\nSolange er als Einflussreicher Streamer keinen neuen ID-Ban erhält wird sich eh nix ändern.\nDer Typ is nach wie vor alles andere als Reformed und gibt das (egal ob beabsichtigt oder nicht) über seine Viewercommunity weiter\n\nSpieler wie T1 fördern toxicity in großem Stil dazukommt das dass System selbst ned gebalanced ist.\n\nEntweder zu hart ( Fall vom Threadstarter sofern alles was er berichtet hat wahr ist)\nOder zu lasch ( T1 Kategorie)\n\nFakt ist in beiden Fällen geht die Spirale von neuem los und \n\n> Boah wie mir dieser Käse mit Tyler1 auf den Zeiger geht.\n\nder von dir genannte \"Käse\" wird immer wieder neu reifen und vergammeln weil man ihn \"zu lange\" reifen lässt.\n\ndas einzige was ich dem Threadstarter vorwerfen kann ist nicht /mute all benutzt zu haben direkt zu beginn der Runden denn oftmals staut sich so eine negativität schon in Champselect an.","replies":[{"poster":"Darkr3sQ","date":"2018-08-12T18:17:18.149+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=McTeemo,realm=EUW,application-id=KYnfKGf0,discussion-id=jJ0HTeFl,comment-id=0003000000010001,timestamp=2018-08-12T14:31:56.821+0000)\n>\n> ...\n> \n> Entweder zu hart ( Fall vom Threadstarter sofern alles was er berichtet hat wahr ist)\n> Oder zu lasch ( T1 Kategorie)\n\nAuch wenn die Situation so ist, wie er berichtet hat, ist der Bann nicht zu hart.. Darüber hinaus wurde ihm in der Nachricht zum 14 Tagesbann angedroht, dass der nächste Bann permanent ist, wenn der TE nicht sofort sein toxisches Verhalten einstellt. Es ist schlicht und ergreifend die logische Konsequenz zu dem angedrohten Perma. Nicht mehr und nicht weniger.\n\n>  ...\n> das einzige was ich dem Threadstarter vorwerfen kann ist nicht /mute all benutzt zu haben direkt zu beginn der Runden denn oftmals staut sich so eine negativität schon in Champselect an.\n\nWas dem TE vorgeworfen werden kann ist, dass er sich trotz drohendem Perma nicht zusammenreißen konnte, und weiterhin toxisch war. Wenn sich so etwas anstaut, kann er in Wut seinen Monitor anpflaumen oder mit Freunden im TS oder Discord lästern. Er muss es aber nicht im Chat kund tun, schon gar nicht wenn der Perma droht. Darüber hinaus kann er zwischen zwei Spielen was anderes machen, damit sich der Frust erst gar nicht aufstauen kann.","replies":[]}]}]},{"poster":"ImTheFox115","date":"2018-08-11T16:06:02.010+0000","up_votes":2,"down_votes":0,"body":"Vl hat dich Riot auch wegen Do**fhe*t gebannt \n\nTyler 1 hat keine 2. Chamce bekommen.\n\nUnd BTW du hattest 3 Chancen!!","replies":[{"poster":"HeWill Killsteal","date":"2018-08-11T16:08:55.594+0000","up_votes":1,"down_votes":4,"body":"> [{quoted}](name=ImTheFox115,realm=EUW,application-id=KYnfKGf0,discussion-id=jJ0HTeFl,comment-id=000300000000,timestamp=2018-08-11T16:06:02.010+0000)\n>\n> Vl hat dich Riot auch wegen Do**fhe*t gebannt \n> \n> Tyler 1 hat keine 2. Chamce bekommen.\n> \n> Und BTW du hattest 3 Chancen!!\n\nWow das ihr das alle so ernst meint es sind 7 Jahre LoL in diesem Account in denen ich einen 2 wochen Bann bekommen habe dann 1 monat nicht flame und durch 1 Game Perma gebannt werde das ist einfach scheiße wie du heir kommentierst es geht einfach darum das ich versuche den acc zurück zu kriegen 1 Jahres bann monats bann völlig egal hauptsache der Acc bleibt bestehen","replies":[{"poster":"ImTheFox115","date":"2018-08-11T16:20:41.097+0000","up_votes":6,"down_votes":0,"body":"Hallo??\n3 Chancen!! 10 Chatban, 25 Chatban, 14 Tage Ban!!\n\nDu bist leider nicht belehrbar. Irgendwas muss man gegen dich unternehmen.","replies":[{"poster":"Zyzyx","date":"2018-08-11T16:30:09.595+0000","up_votes":3,"down_votes":0,"body":"NIcht zwingend. Bei extremen vergehen werden die Chatsperren übersprungen. Es kann durchaus stimmen, dass er nur diese eine Warnung/Chance bekommen hat. Ändert natürlich nicht wirklich was, auch eine einzelne letzte Chance ist nach wie vor eine zweite Chance.","replies":[]}]}]}]}]}]},{"poster":"Zyzyx","date":"2018-08-11T15:57:42.827+0000","up_votes":6,"down_votes":1,"body":"> habe seid da nicht mehr so stark geflamed\n\nDie Richtlinie wäre gewesen GAR NICHT mehr zu flamen und das stand in der Warnung auch recht deutlich drin. \n\n> jedoch hatte ich nicht mit einem Perma bann gerechnet\n\nDann hast du die Warnung entweder nicht gelesen, ignoriert oder sie nicht ernst genommen. Das steht da nämlich recht deutlich drin und sollte nicht überraschend sein. \n\n> da es 1 Game war seit meinem letzten Bann.\n\nDer zwei-Wochen-Ban ist deine letzte Chance gewesen. Du hast diese nicht genutzt sondern einfach wieder geflamed. Ob nun ein Game oder mehr, du hast deine letzte Chance verschwendet indem du die Warnung ignoriert und erneut die Regeln gebrochen hast. \n\n> aber ich finde es einfach Unfair das man nur sieht was ich gesagt habe und nicht in betracht zieht wie ich mich in anderen games verhalte und meine Teammates ermutige.\n\nWas andere sagen ist irrelevant, da es um DEIN Verhalten geht. Nichts was die anderen sagen gibt dir das Recht die Regeln zu ignorieren, daher ist es völlig egal was die gesagt haben und aus diesem Grund eben auch nicht in den Chatlogs enthalten. Die Regeln gelten IMMER, völlig egal warum du meinst schreiben zu müssen was du eben geschrieben hast. \nUnd zu deinem Verhalten in anderen Matches: Ist ein Bankräuber plötzlich unschuldig, nur weil täglich alten Frauen über die Straße hilft? Dein gutes Verhalten ist kein Ausgleich für dein unsoziales Verhalten. Weder in League noch sonst irgendwo.","replies":[{"poster":"HeWill Killsteal","date":"2018-08-11T16:06:55.080+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=Zyzyx,realm=EUW,application-id=KYnfKGf0,discussion-id=jJ0HTeFl,comment-id=0002,timestamp=2018-08-11T15:57:42.827+0000)\n>\n> Die Richtlinie wäre gewesen GAR NICHT mehr zu flamen und das stand in der Warnung auch recht deutlich drin. \n> \n> Dann hast du die Warnung entweder nicht gelesen, ignoriert oder sie nicht ernst genommen. Das steht da nämlich recht deutlich drin und sollte nicht überraschend sein. \n> \n> Der zwei-Wochen-Ban ist deine letzte Chance gewesen. Du hast diese nicht genutzt sondern einfach wieder geflamed. Ob nun ein Game oder mehr, du hast deine letzte Chance verschwendet indem du die Warnung ignoriert und erneut die Regeln gebrochen hast. \n> \n> Was andere sagen ist irrelevant, da es um DEIN Verhalten geht. Nichts was die anderen sagen gibt dir das Recht die Regeln zu ignorieren, daher ist es völlig egal was die gesagt haben und aus diesem Grund eben auch nicht in den Chatlogs enthalten. Die Regeln gelten IMMER, völlig egal warum du meinst schreiben zu müssen was du eben geschrieben hast. \n> Und zu deinem Verhalten in anderen Matches: Ist ein Bankräuber plötzlich unschuldig, nur weil täglich alten Frauen über die Straße hilft? Dein gutes Verhalten ist kein Ausgleich für dein unsoziales Verhalten. Weder in League noch sonst irgendwo.\n\nIch verstehe was du meinst jedoch finde ich es trotzdem unfair ich kann es einfach nciht glauben das du nie flamest oder jemanden beleidigst und die letze Warnung hab ich nicht ignoriert ich habe gesehen gebannt bis zum 10.07 dann war für mich vorbei habe dann 1 neune account gemacht und weiter gespielt weil das spiel mir sehr spaß macht es sind nur leute die nicht tryharden die mich nerven es gibt einen normal mode um sachen zu lernen aber im Comp schlecht spielen weil man einen Jungler pickt den man nicht spielen kann ist einfach Unbegreiflich für mich","replies":[{"poster":"OT Riku","date":"2018-08-11T16:15:20.572+0000","up_votes":1,"down_votes":0,"body":"Nenn mir einen Grund warum man flamen sollte.","replies":[{"poster":"HeWill Killsteal","date":"2018-08-11T16:18:30.663+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=OT Riku,realm=EUW,application-id=KYnfKGf0,discussion-id=jJ0HTeFl,comment-id=000200000000,timestamp=2018-08-11T16:15:20.572+0000)\n>\n> Nenn mir einen Grund warum man flamen sollten.\n\nganz einfach jemand läuft rein intet du verlierst und sitz da und kannst nichts machen da du 40minuten in einem Spiel bist mit jemanden dem Silver 1 Scheiß egal ist da er main account hat die plat sind oder gold und sich über Silver spieler Lustig macht (hatte sowas schon in meinen games ) und du sitz da als SUpport und denkst dir warum passiert mir sowas und dann denkst okay ist verloren und du schreibst mit dem Troller warum er das macht und er sagt es ist witzig zu sehen wie leute sich aufregen über ein Spiel ...","replies":[{"poster":"Zyzyx","date":"2018-08-11T16:30:47.663+0000","up_votes":4,"down_votes":0,"body":"Und flamen hilft da wie genau...?","replies":[{"poster":"CYPHΕR","date":"2018-08-13T06:23:49.043+0000","up_votes":1,"down_votes":0,"body":"Der Inter merkt dadurch, dass er etwas falsches tut, entschuldigt sich höflich dafür und spielt normal weiter, ist doch klar.\n\n{{sticker:slayer-jinx-wink}}","replies":[]}]},{"poster":"Waldschrat86","date":"2018-08-12T03:36:10.007+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=HeWill Killsteal,realm=EUW,application-id=KYnfKGf0,discussion-id=jJ0HTeFl,comment-id=0002000000000000,timestamp=2018-08-11T16:18:30.663+0000)\n>\n> ganz einfach jemand läuft rein intet du verlierst und sitz da und kannst nichts machen da du 40minuten in einem Spiel bist mit jemanden dem Silver 1 Scheiß egal ist da er main account hat die plat sind oder gold und sich über Silver spieler Lustig macht (hatte sowas schon in meinen games ) und du sitz da als SUpport und denkst dir warum passiert mir sowas und dann denkst okay ist verloren und du schreibst mit dem Troller warum er das macht und er sagt es ist witzig zu sehen wie leute sich aufregen über ein Spiel ...\n\nGanz ehrlich, rat mal, wann ich die 1-3 Spiele hatte, wo einer angefangen hat zu inten. Ich verrat es dir, immer dann, wenn ein anderer Random meinte den zuflamen zu müssen, weil er in Silber nicht wie Dia gespielt hat. Zweite Option des zugeflameten: Ragequit.\nIst wirklich immer wieder schön.\nRichtig toll wird das ganze noch, wenn sich in das Gejammer QQ einstreut, dass man ja nicht farmen könne, weil die sooo fed sind (obwohl es meist nur 1 aus 5 tatsächlich ist), während er sich zum schreiben aus xp Range entfernt und die Minions der Turm holt.","replies":[]},{"poster":"clair de lune289","date":"2018-08-12T15:01:46.047+0000","up_votes":2,"down_votes":0,"body":"evt mal aufhören jedesmal int zu schreien wenn ein Spieler nur ein schlechtes Spiel hat.\nes ist nicht ratsam den Blödsinn einiger Streamer zu Thema int Feeding all zu viel glauben zu schenken,es gibt gewisse Streamer die einfach alles was nicht hart gewinnt oder einen dummen Fehler macht als int Feeding bezeichen. \ndas ist und bleibt ausgemacht Blödsinn.\nübrigens entschuldigen diese Streamer ihre Fehler fast immer lassen aber für andere keine Entschuldigungen gelten.\ndiese Streamer sind das Hauptursache warum so viele Spieler glauben ständig int. Feeder im Team zu haben.","replies":[]},{"poster":"OT Riku","date":"2018-08-11T18:03:43.816+0000","up_votes":1,"down_votes":0,"body":"Wie ZYZYX schon sagte was bringt es dir mit ihm zu diskutieren besonders weil dich das chatten nur ablenkt.\nKonzentrier dich aufs spiel.","replies":[{"poster":"HeWill Killsteal","date":"2018-08-11T19:54:07.791+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=OT Riku,realm=EUW,application-id=KYnfKGf0,discussion-id=jJ0HTeFl,comment-id=00020000000000000001,timestamp=2018-08-11T18:03:43.816+0000)\n>\n> Wie ZYZYX schon sagte was bringt es dir mit ihm zu diskutieren besonders weil dich das chatten nur ablenkt.\n> Konzentrier dich aufs spiel.\n\nDas ist glaube der erste Kommentar der mir gefällt danke für dein Feedback ich verstehe es ja passiert mir immer wieder versuche es in den Griff zu kriegen danke^^","replies":[]}]}]}]},{"poster":"Zyzyx","date":"2018-08-11T16:15:39.084+0000","up_votes":2,"down_votes":0,"body":">  ich kann es einfach nciht glauben das du nie flamest oder jemanden beleidigst\n\nDann glaubst du es halt nicht und die meisten Flamer haben Schwierigkeiten zu glauben dass andere nicht genauso wie sie sind, aber es ist halt so. Die Mehrheit der League Community flamet nie und die absolut überwältigende Mehrheit der Community ignoriert wenigstens die Warnungen nicht, wenn sie doch mal flamen. \n\n> die letze Warnung hab ich nicht ignoriert ich habe gesehen gebannt bis zum 10.07 dann war für mich vorbei \n\nBedeutet: Du hast den Rest der Nachricht nicht gelesen und somit ignoriert. \n\n> es sind nur leute die nicht tryharden die mich nerven es gibt einen normal mode um sachen zu lernen aber im Comp schlecht spielen weil man einen Jungler pickt den man nicht spielen kann ist einfach Unbegreiflich für mich\n\nDas mag ja alles sein, aber:\na) Andere sind nicht für dein Verhalten verantwortlich, sondern du selbst\nb) Wir alle sind exakt den selben Umständen ausgesetzt und sind trotzdem nicht permagebannt. So schwer ist es nicht, damit ordentlich umzugehen.","replies":[]}]}]},{"poster":"Veezey","date":"2018-08-11T15:54:18.971+0000","up_votes":4,"down_votes":0,"body":">Hi ich wurde heute den 11.08 permant auf meinem Acc gebannt ich hatte davor einen 14 Tage Bann bis zum 10.07 21:50 und habe seid da nicht mehr so stark geflamed wie bis zu meinem Heutigen match \n\nNicht mehr so stark geflamed? Du hättest gar nicht flamen sollen lol","replies":[{"poster":"HeWill Killsteal","date":"2018-08-11T16:01:35.722+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Veezey,realm=EUW,application-id=KYnfKGf0,discussion-id=jJ0HTeFl,comment-id=0001,timestamp=2018-08-11T15:54:18.971+0000)\n>\n> Nicht mehr so stark geflamed? Du hättest gar nicht flamen sollen lol\n\nTeilweise hab ich das auch nicht außer mein adc hat mich geflamed da hab ich ihm halt gesagt das es nicht meine schuld ist wenn ich warde und er Stirbt 2vs1 weil er rein geht","replies":[{"poster":"Zyzyx","date":"2018-08-11T16:11:51.957+0000","up_votes":4,"down_votes":0,"body":"\"Teilweise nicht\" ist aber halt nicht \"nicht\". Sorry dass ich das selbe dumme Beispiel wieder bringe, aber ein Bankräuber der \"teilweise keine Banken ausraubt\" oder \"nur eine Bank im Monat ausraubt\" oder \"nur eine Bank ausraubt weil er Geld braucht und grad keinen Bock zu arbeiten hat\" ist auch schuldig. Genauso wie du. \n\nEs ist egal warum du geflamed hast, es ist egal wie oft du nicht geflamed hast, es ist egal wie genau du geflamed hast. Du hättest GAR NICHT flamen dürfen. Punkt. Daran hast du dich nicht gehalten, daher die Strafe die dir vorher dafür angekündigt wurde.","replies":[{"poster":"HeWill Killsteal","date":"2018-08-11T16:15:03.142+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Zyzyx,realm=EUW,application-id=KYnfKGf0,discussion-id=jJ0HTeFl,comment-id=000100000000,timestamp=2018-08-11T16:11:51.957+0000)\n>\n> &quot;Teilweise nicht&quot; ist aber halt nicht &quot;nicht&quot;. Sorry dass ich das selbe dumme Beispiel wieder bringe, aber ein Bankräuber der &quot;teilweise keine Banken ausraubt&quot; oder &quot;nur eine Bank im Monat ausraubt&quot; oder &quot;nur eine Bank ausraubt weil er Geld braucht und grad keinen Bock zu arbeiten hat&quot; ist auch schuldig. Genauso wie du. \n> \n> Es ist egal warum du geflamed hast, es ist egal wie oft du nicht geflamed hast, es ist egal wie genau du geflamed hast. Du hättest GAR NICHT flamen dürfen. Punkt. Daran hast du dich nicht gehalten, daher die Strafe die dir vorher dafür angekündigt wurde.\n\nJa ich verstehe es ja aber 1 Monat müsste genung sein Um das aufzuheben oder ??? wenn du einen Wahrnung bekommen hast wie lange soll ich warten ???","replies":[{"poster":"Zyzyx","date":"2018-08-11T16:20:32.528+0000","up_votes":5,"down_votes":0,"body":"> wie lange soll ich warten ???\n\nFür immer. \n\nFlaming ist in League verboten. Das bedeutet es ist IMMER verboten. Warum sollten die Regeln einfach so über Zeit aufweichen? Regeln werden doch nicht einfach ungültig, nur weil es schon eine Weile her ist dass du das letzte mal dafür bestraft wurdest. Ich bring noch mal den Bankräuber: Der kann doch auch nicht sagen \"Eyyy, wie lange muss ich denn warten zwischen meinen Bankrauben damit ich nicht ins Gefängnis komme?\". Er kommt immer ins Gefängnis, weil die Gültigkeit dieses Gesetzes absolut NICHTS damit zu tun hat, wie lange das letzte Vergehen her ist. Das gilt im verstärkten Maße, wenn man eine letzte Chance bekommt, wo das Wort \"letzte\" ja schon sehr klar macht, dass es .... nunja...eben die letzte Chance ist. Nicht die \"vorerst letzte\" oder die \"letzte diesen Monat\".","replies":[{"poster":"CYPHΕR","date":"2018-08-13T06:21:19.397+0000","up_votes":2,"down_votes":0,"body":"Ich finde es immer wieder erstaunlich wie unvorstellbar es für Spieler mit Temp- oder Permaban ist auch nur mal ein paar Wochen am Stück rein gar nicht zu flamen. Ebenso die Vorstellung, dass es Spieler gibt die gar nicht flamen (was der großen Mehrheit entspricht) scheint für sie schlicht erlogen zu sein.\n\nIch meine ok, man sieht ja dass es damit genau die richtigen erwischt, aber ich frage mich immer wie diese Personen im richtigen Leben sind? Wird auch jeder auf der Straße der die falschen Schuhe trägt direkt dumm von der Seite angemacht? Der Postbote der den Brief etwas zu hastig in den Briefkasten wirft muss sich auch direkt Suizidaufforderungen anhören?","replies":[]}]},{"poster":"Veezey","date":"2018-08-11T16:19:55.497+0000","up_votes":1,"down_votes":0,"body":"Das dauert lange. Je mehr du spielst desto schneller geht es und noch schneller, wenn du dich positiv verhältst. **Ich weiß da nichts genaues**, aber es dauert wohl mindestens 3 - 4 Monate, wenn du viel spielst und dich positiv bist. Zumindest was ich im Forum so gesehen hab. Dann solltest du eine Nachricht bekommen, dass deine Strafstufe gesunken ist. Für diesen Account ist es aber nun zu spät.","replies":[{"poster":"Zyzyx","date":"2018-08-11T16:28:28.951+0000","up_votes":2,"down_votes":0,"body":"Mit solchen Aussagen wäre ich vorsichtig, denn es gab schon genug Leute die nach weit über einem Jahr und (angeblich) cleanem Verhalten trotzdem noch sofort beim ersten Vergehen permagebannt wurden. Ja, es verjährt irgendwann, aber der Zeitraum ist offenbar in vielen Fällen so lang, dass man das schon als \"quasi für immer\" bezeichnen kann.","replies":[{"poster":"clair de lune289","date":"2018-08-12T14:57:42.236+0000","up_votes":2,"down_votes":0,"body":"soweit mir bekannt ist,spielen da eben viele Faktoren eine Rolle.\ndas Gleiche gilt übrigens auch für das Ehrenlevel. positives Verhalten verkürzt diese Zeit anscheinend schneller als neutrales Verhalten.\n\nwahrscheinlich wird auch zwischen Flame und negative Einstellung unterschieden je nachdem wie stark diese auftritt.\nmir ist z.B. ein Spieler bekannt der nach nur 1 Monat eben \"nur\" den erneuten 14 Tagebann erhalten hat (hat den ACC am Ende dennoch verloren)\n\nin diesem Monat hat er aber extrem viel gespielt d.h. in der Regel sogar mehr als 10h am Tag (er war gesundheitlich extrem eingeschränkt in dem  Zeitraum was auch hauptsächlich zur seinem toxischen Verhalten geführt hat)\nwie er sich in dem Monat verhalten hat,kann ich leider nicht sagen mir war das Verhalten in einem Spiel zu anstrengend allerdings war ich der Person nicht \"böse\" für sein Verhalten.\n\nFlamer müssen ja keine \"schlechten\" Menschen (das sind die meisten wohl auch nicht) sein denn es gibt immer Gründe für ihr Verhalten (manche sind besser als andere) d.h. aber noch lange nicht das ihr Verhalten akzeptable oder nicht bestraft gehört.","replies":[]},{"poster":"Veezey","date":"2018-08-11T17:46:50.260+0000","up_votes":1,"down_votes":0,"body":"Hab ich bis jetzt zumindest im Forum nicht gesehen oder bewusst ignoriert oder vergessen. \nAber na gut ich ändere das dann mal.","replies":[]}]},{"poster":"Alpacana","date":"2018-08-11T16:31:54.530+0000","up_votes":1,"down_votes":0,"body":"Stimmt soweit, außer die 3-6 Monate. Je nachdem wie häufig du spielst. Gab schon Fälle da wurde die Strafstufe nach 2 Jahren noch nicht aufgehoben. Gibt also keinen genauen Zeitpunkt wo man sagen kann \"jetzt bin ich mit Sicherheit in der Strafstufe gesunken\".","replies":[{"poster":"Veezey","date":"2018-08-11T17:43:02.299+0000","up_votes":2,"down_votes":0,"body":"Ja ich hätte noch Angaben ohne Gewähr hinzufügen sollen.^^","replies":[]}]}]},{"poster":"Time2Whine","date":"2018-08-14T07:49:35.498+0000","up_votes":1,"down_votes":0,"body":"Als kleine Randinformation für dich, da du dich so oft darüber beschwerst und es unfair findest, dass du dich 1 Monat vernünftig verhalten hast und trotzdem gebannt wurdest.\n[Hier](https://boards.euw.leagueoflegends.com/de/c/spielerverhalten-de/L0zEtuB7-14-tage-zurecht?comment=0009) hat jemand in seinem Thread geschrieben, dass 7!! Monate bzw. fast 600! Games gebraucht hat um von seinem 14 Tage herunterzukommen bzw. wieder Honorstufen aufzusteigen.\nDa liegst du mit deiner Meinung, dass ein Monat straffreies Verhalten reicht um reformiert zu werden komplett daneben.","replies":[]}]}]}]}]},{"poster":"Juley","date":"2018-08-11T16:22:02.425+0000","up_votes":3,"down_votes":0,"body":">Um ehrlich zu sein hab ich mit einem Bann gerechnet nach dem was ich geschrieben hatte jedoch hatte ich nicht mit einem Perma bann gerechnet .\n\nDie 4 Stufen zum Permabann (Bezogen auf Flaming):\n\n1. 10 Spiele Chat-Restriction\n\n2. 25 Spiele Chat-Restriction\n\n3. 14 Tage Bann\n\n4. Perma-Bann\n\nMan kann auf den Stufen wieder absteigen *Aber nicht, wenn man einfach lange nicht Spielt*.\n\n>aber ich finde es einfach Unfair das man nur sieht was ich gesagt habe und nicht in betracht zieht wie ich mich in anderen games verhalte und meine Teammates ermutige.\n\nKenn ich. Find ich Doof. Kann man nichts machen. Wenn man freundlich ist und andere Ermutigt juckt das als keinen *vielleicht wird man dann mal gehonnored aber das wars*... \n\n> immer postiv \n\nHört sich jetzt zwar Hart an. Aber eigentlich will Riot, dass die Spieler immer positiv sind und das mehr oder weniger selbstverständlich ist\n\n\nBTW.... League ist nur ein Spiel. Nicht dein Leben.\n\n/mute all ist dein Freund.\n\nMfg Juley","replies":[]},{"poster":"HeWill Killsteal","date":"2018-08-13T15:55:10.252+0000","up_votes":1,"down_votes":1,"body":"Hi ich bins der perma gebannte xD lul finde es cool das sich soviele zu meinem Beitrag äußern finde es jedoch echt unglaublich das jeder gegen flamer hab auch mehrere Accounts in LoL doch habe seit dem Perma ban das game gequited da ich es sad fand das mein Account weg ist finde es einfach zu lästig jetzt wieder Ip zu husseln wollte einfach nur mal fragen glaubt ihr Riot kann die 11.000 Ip die ich auf dem Account der Perma gebannt ist auf meinen anderen Account übertragen ? Theoretisch ist mir ja das Spielen auf dem Account untersagt aber es gab doch mal sowas wie Geschenke durch BE/ IP für Freunde sowas wie Icons glaubt ihr Riot würde sowas machen xD klingt zwar unwahrscheinlich aber wäre doch mal ne Idee mein BE auf den anderen Account zu kriegen das wären schonmal wenigstens die ganzen 450 Champs und einpaar 1350 xD{{sticker:sg-zephyr}}","replies":[{"poster":"Sirrkas","date":"2018-08-13T16:55:27.799+0000","up_votes":2,"down_votes":0,"body":"Nein, Riot wird dir nichts von deinem alten Account auf den anderen übertragen. Weder Rp, noch IP, keine Skins und Champions, nicht mal den Namen oder die Icons. Es ist Teil der Strafe, dass du alles verlierst, was sich auf dem Account befunden hat.","replies":[]},{"poster":"clair de lune289","date":"2018-08-13T16:10:16.424+0000","up_votes":1,"down_votes":0,"body":"BE wid wohl absolut unmöglich sein solltest du aber von RP sprechen die noch nicht für Skins genutzt wurde ist es zwar auch unwahrscheinlich,dennoch würde ich mich dafür **freundlich** an den Support wenden.\nmach dir aber bitte keine zu großen Hoffnungen,die Antwort lautet wahrscheinlich \"nein\".","replies":[]}]},{"poster":"Alpacana","date":"2018-08-11T15:54:03.001+0000","up_votes":2,"down_votes":0,"body":"In dem 14 Tage Ban wird dir ausdrücklich gesagt, dass es deine letzte Chance vor dem Perma ist. Auch wenn du nur 1 Game flamest, ist der Perma dann gerechtfertigt.","replies":[]},{"poster":"CheIsea","date":"2018-08-11T18:30:07.438+0000","up_votes":2,"down_votes":1,"body":"Find ich richtig gut. :) endlich permabannt Riot mal die kleinen Flamer weg. \nbtw wenn du schon 14 Tage hattest is doch klar, dass der Nächste perma is :D \n \nnja mach dir n neuen Acc, nenn dich reformed, flame weiter und sei wieder Silverhartstuck :)","replies":[{"poster":"HeWill Killsteal","date":"2018-08-11T19:52:54.169+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=AeQ Chelsea,realm=EUW,application-id=KYnfKGf0,discussion-id=jJ0HTeFl,comment-id=0006,timestamp=2018-08-11T18:30:07.438+0000)\n>\n> Find ich richtig gut. :) endlich permabannt Riot mal die kleinen Flamer weg. \n> btw wenn du schon 14 Tage hattest is doch klar, dass der Nächste perma is :D \n>  \n> nja mach dir n neuen Acc, nenn dich reformed, flame weiter und sei wieder Silverhartstuck :)\n\nHahaha was für Reformed xD Rücken Tatto kommt 11.08.2018 He Will Killsteal Fuck Riotgames hahahahaha\njk","replies":[]}]},{"poster":"FallsPvP","date":"2018-08-12T18:26:49.623+0000","up_votes":1,"down_votes":3,"body":"Da hast du wohl deine Chance verpasst. Mein Account wurde sofort und ohne eine Chance, wegen Nutzung von Drittanbieter-Programmen, permanent gebannt. Du hattest deine Chance und wurdest nach nicht mal einem Tag gebannt, weil du wieder ein Fehlverhalten an den Tag gelegt hast. Zudem ist es irrelevant was du in deinen anderen Spielen getrieben hast, es kommt immer nur auf das jeweilige Spiel an.\n\n\nAbgesehen davon ist dein Beitrag Sinnlos, schreib lieber ein Ticket, wenn du eine Beschwerde einreichen möchtest. Ich kann dir aber versichern das du dort auch nicht weiterkommst. Bei meinem Ban gab es nicht einmal Beweise, nur die Spieler-Reports, aber bei dir gibt es offensichtlich Chatlogs und der Fall ist damit eindeutig.\n\n\n~FallsPvP","replies":[]}]}