{"poster":"iDexterity","date":"2015-08-26T19:04:49.164+0000","title":"Verbesserungsvorschlag bei Einkäufen (Sorry, konnte kein besseres Topic finden)","subforum":"Skin- & Champion-Konzepte","up_votes":1,"down_votes":3,"body":"**Verbesserungsvorschlag bei Eink&auml;ufen**\r\n\r\nMein Gedanke liegt hierbei bei der R&uuml;ckgabem&ouml;glichkeit nach dem Einkauf von Champions/Skins.\r\nWie jeder wei&szlig;, ist dies 3 mal nach Accountkreation m&ouml;glich. Jedoch h&auml;tte ich dazu einen Vorschlag, den man gut einbringen k&ouml;nnte, denn...\r\n\r\n3 R&uuml;ckgaben von Eink&auml;ufen sind nicht gerade viel.. Aus diesem Grund w&uuml;rde ich es in den Raum werfen, bei jedem Season-Ende diese 3 R&uuml;ckgaben zu erneuern, und nicht auf ewig auf 3 zu begrenzen. Ich habe oft das Problem, dass ich mir einen Champion in den Kopf setzte, den ich mir dann kaufe und auch spiele, jedoch nach nur weniger Zeit bemerke ich oftmals, dass ich &uuml;berhaupt keinen Spa&szlig; an diesem Champion empfinde, was jedoch schade um die EP ist.\r\n\r\nIch f&auml;nde diese &Auml;nderung sehr vorteilhaft im Sinne f&uuml;r die gesamten League of Legends community. Mich pers&ouml;nlich w&uuml;rde sogar nur eine weitere R&uuml;ckgabe pro Season gl&uuml;cklich machen.\r\n\r\n\r\nLasst mich eure Meinungen zu diesem Thema wissen, und schreibt doch, wie ihr diesen Einfall so findet,\r\n\r\nL.G.\r\n_iDexterity_","replies":[{"poster":"Zero000","date":"2015-08-26T20:03:46.617+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=iDexterity,realm=EUW,application-id=L7E6lhzo,discussion-id=4JURPloE,comment-id=,timestamp=2015-08-26T19:04:49.164+0000)\n\n> 3 R&uuml;ckgaben von Eink&auml;ufen sind nicht gerade viel..\n\nIch spiele seit über fünf Jahren und habe noch nicht eine Rückgabe verbraucht.\n\n>Aus diesem Grund w&uuml;rde ich es in den Raum werfen, bei jedem Season-Ende diese 3 R&uuml;ckgaben zu erneuern, und nicht auf ewig auf 3 zu begrenzen. \n\nUnd wer kauft sich dann noch neue Champion oder Skins? Dan geben die Leute einmal Geld für etwas RP aus holen sich für X Spiele Skin XY, geben ihn später zurück und holen sich für eben einen anderen Skin. Das ist ein herber Verlust für Riot, die übrigens keine Wohltätigkeitsorganisation ist sondern eine Firma die Geld verdienen will und Server Angestellte und vieles mehr bezahlen muss.\n\n>Ich habe oft das Problem, dass ich mir einen Champion in den Kopf setzte, den ich mir dann kaufe und auch spiele, jedoch nach nur weniger Zeit bemerke ich oftmals, dass ich &uuml;berhaupt keinen Spa&szlig; an diesem Champion empfinde, was jedoch schade um die EP ist.\n\nDan überlege dir vor dem Kauf was du wirklich haben willst. Oder bist du ein kleines Kind das immer alles haben will? Ist es wirklich so schwer sich vor dem Kauf Gedanken darüber zu machen ob man besagtes Objekt wirklich braucht?\n\n> Ich f&auml;nde diese &Auml;nderung sehr vorteilhaft im Sinne f&uuml;r die gesamten League of Legends community. Mich pers&ouml;nlich w&uuml;rde sogar nur eine weitere R&uuml;ckgabe pro Season gl&uuml;cklich machen.\n\nUnd wer zahlt dafür?\n\n\nIn meinen Augen eine sehr schlechte und nicht sehr weit gedachte Idee.\nIch bitte dich übrigens bei deiner nächsten Idee erst mal Google und die Forums interne Suchmaschine zu benutzen. Dan hättest du bemerkt das die Idee alles andere als neu ist und du hättest dir diesen langen Text sparen können oder zumindest auf die entsprechenden Nachteile eingehen können.","replies":[]}]}