{"poster":"OP Garen Support","date":"2017-06-01T15:46:51.023+0000","title":"Riot Listens to the community","subforum":"Gameplay","up_votes":2,"down_votes":0,"body":"My main for 2 years {{champion:90}} is finally back from the dead. After all those posts asking Riot to revert him.He once again back to mid, He still lacks base damage in his E compared to his old self, but he is at least playable now. No longer he is the useless minionmancer that is only good as support. Thank you Riot for bringing him back.","replies":[{"poster":"Slythion","date":"2017-06-01T16:03:45.434+0000","up_votes":1,"down_votes":0,"body":"wait (I have been absent for a couple days), can I get a link to this change? Did they really fix the dude?","replies":[{"poster":"OP Garen Support","date":"2017-06-01T16:23:03.006+0000","up_votes":1,"down_votes":0,"body":"All his abilities got buffed other then the W. The ult finally does fixed damage at full build it deals 1000 damage. His E sucks though because it does not have better base damage. (I would personally double the base damage, but it may make him OP again) Too many champs can outheal his E","replies":[{"poster":"Slythion","date":"2017-06-01T16:34:56.201+0000","up_votes":1,"down_votes":0,"body":"I think something to be careful for is accidentally returning the whole \"E a minion and watch it automatically cs the whole wave for you\" situation that Malzahar became known to do","replies":[{"poster":"OP Garen Support","date":"2017-06-01T16:44:56.912+0000","up_votes":1,"down_votes":0,"body":"His core damage ability was always his E. Champions that build lifesteal can outdamage the E meaning he is bad vs AD carries. He was always anti glass cannon(full damage adc, assassins, squishy mages, squishy supports)","replies":[{"poster":"Erockandroll","date":"2017-06-01T17:05:45.262+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=MrBreaktime,realm=EUNE,application-id=3ErqAdtq,discussion-id=mjVJGuwn,comment-id=0000000100000000,timestamp=2017-06-01T16:44:56.912+0000)\n>\n> His core damage ability was always his E. Champions that build lifesteal can outdamage the E meaning he is bad vs AD carries. He was always anti glass cannon(full damage adc, assassins, squishy mages, squishy supports)\n\nBut that doesn't change the AFK wave clear scenario that Riot was trying to address in the update. He simply needed to be more dependent on his other abilities. And while Riot tried to do that with his void swarm, they pretty much tried too hard, and ended up with an ability that was a monster in of itself. And the Irony in that is that is that he become too dependent on a single ability again, and dumpstered because that ability was problematic.","replies":[{"poster":"OP Garen Support","date":"2017-06-01T17:41:11.555+0000","up_votes":1,"down_votes":0,"body":"Most mages farm with abilities. He still needs to last hit properly. His E lowers minion hp but does not guarantee the kill. When he pushes automatically he opens up himself for 1 vs 2. His biggest weakness is constantly getting ganked. Most mages out ranged him. Only people who had problem against old Malzahar were the 1s he countered the melee assassins. He had clear weakness and clear advantage. Even if he pushes way too hard the E damage can be increased to champions and lowered to minions. (everyone is happy except the full glass cannon assassins who deserve to die for not building any tanky items and walking into your face)","replies":[]}]}]}]}]},{"poster":"EndlessSorcerer","date":"2017-06-01T16:04:13.143+0000","up_votes":1,"down_votes":0,"body":"Check the Patch Notes for 7.11","replies":[{"poster":"Slythion","date":"2017-06-01T16:31:20.849+0000","up_votes":1,"down_votes":0,"body":"ay that's pretty cool, hooray for malzahar ^-^","replies":[]}]}]},{"poster":"Limmie","date":"2017-06-01T16:05:55.651+0000","up_votes":1,"down_votes":0,"body":"Can they go ahead and bring {{champion:143}} back mid then?","replies":[]}]}