{"poster":"ßobbý","date":"2015-02-27T21:40:20.067+0000","title":"The State of Twisted Treeline","subforum":"Maps & Modes","up_votes":8,"down_votes":0,"body":"My friends and I enjoy playing on League's 3v3 map. We often like to sit and think of some ideas and strategies that we can try to get the best out of our experience on the map. But lately, its been a bit frustrating seeing some of the newer champions reign supreme with their ability to go from the jungle right to the nexus, or escape from you without any trouble with their insane mobility. Champions like Rek Sai', Azir, and Lissandra can appear out of no where and just destroy you with the follow up from opponent, leaving you at a significant disadvantage.\r\n\r\n\r\n\r\n   The changes to the SR jungle also gave the smite items to TT. This is all fine considering that the old spirit stone has been out of the question for a very long time. However, one item was actually left that can actually **stack** with those items, the Grez's Spectral Lantern. It actually allows for the jungler to stay in the jungle and keep farming. If your team manages to gain some map pressure, then your jungler can go into the enemy side and take their camp(s), setting them a little bit behind. This allows your jungler to just scale up in items since all they will be doing is getting bonus gold from all of their monsters instead from just the big one, and they'll even get more from clearing camps with the tier 2 SR item.\r\n\r\n   And to add on to the items on TT, some of the sister items on here (such as Sanguine Blade, Van Damm's Pillager) might need to be looked at as well. Considering they removed DFG on SR, they also removed BFT (Blackfire Torch), which is fine. But if they are doing changes like that, then why did they not change Van Damm's Pillager to match the IE nerf recently? What about the differences between Sanguine Blade and Bloodthirster? Bloodthirster gives 80 AD, 20% Lifesteal, and a passive shield if you \"over life steal\". The Sanguine Blade offers significantly lower AD (45), lower lifesteal (10%), and if you keep auto-attacking, you can get up to 75 AD, and 15% lifesteal (assuming you can stay in combat for 8 seconds). Who could forget the Wooglet Witchcap, which is literally the combination of Rabadon's and Zhonya's.\r\n\r\n   Also, Vilemaw is not an objective that should be as hotly contested unless you can clear it fast. Vilemaw does literally what old Baron did, giving you some undesirable stats if you aren't a champion that can gain the benefit from them. It gives 20% CDR, Mana and Health regeneration, and an attack speed buff. It doesn't give you any type of strategical advantage like Baron on the SR map does.\r\n\r\n   Altars are probably overrated to be completely honest. You get +3 gold on minion/monster kill which one altar locked (basically Avarice Blade passive), and 10% Bonus AD and AP with both unlocked. The two altar buff is a stronger version of the 1st Dragon buff on SR, since that buff only gives you 6% bonus AP/AD.\r\n\r\n   These are some reasons that I feel the Twisted Treeline map might need to be redesigned in some form or fashion to help make a healthier 3v3 map. If a riot member does see this, hopefully they can answer some of these questions I have as well:\r\n\r\n\r\n*Is Twisted Treeline going to receive an update or changes?\r\nAre some of the champions going to be changed for this map slightly to make a less frustrating experience?\r\nWill items be changed to help revamp the map?\r\nAre objectives on the map be looked at?*\r\n\r\nAnyway, thank you for reading this if you did and feel free to give any comments or opinions about Twisted Treeline.","replies":[{"poster":"YOU BEEN WARNED","date":"2015-02-28T05:02:25.365+0000","up_votes":4,"down_votes":0,"body":"At higher elo, 3v3 is duo lane dominant because jungling is extremely difficult.\n\nJungle items need map specific buffs in 3v3. Especially hunter's machete.","replies":[]},{"poster":"Dr Easter","date":"2015-02-27T23:36:29.137+0000","up_votes":2,"down_votes":0,"body":"\"Dear summoner... no, wait! I thought it was a Summoner's Rift discussion. Alt modes will get nothing and you are going to like it\"\n\n                                                              Riot Games","replies":[]}]}