{"poster":"lil ak47 vert","date":"2017-05-28T22:01:21.549+0000","title":"Minor bug that I can't understand","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"Hi there,\r\n\r\nMost of the time when there is a problem with league of legends I can get rid of it easily, or with the help of the community. But this time, I can't really find what's wrong. Sometimes when i'm in a game, LoL is just closing and i'm being redirected to my desktop. I can just click on LoL on the taskbar since it doesn't quit the app but I'm still missing some part of the action at random times. While this happens, I can see a little window opening for like 0,5 seconds but then it instantly close. I could find what the problem is if I knew what is this window and what it is telling but it seems to be a blank page. I'm basically just using q,w,e,r,d,f,2,3,4, space bar, tab and enter. None of these touchs combined together can open a window or anything so I was wondering if someone had any ideas of what this could be. This problem started like 2 weeks ago. Thank you for reading this.","replies":[{"poster":"Broporo","date":"2017-05-28T23:49:29.982+0000","up_votes":2,"down_votes":0,"body":"Hmmmm I'm starting to see this strange minimizing thing pop up more and more. Typically I would think that you might have hit your windows key on accident, but since you mentioned that pop-up window flashing I'm curious if that is some kind of Windows error. Let's try running a [**clean boot**](https://support.riotgames.com/hc/en-us/articles/201761974) to make sure another program in the background isn't shooting you that error, but let me know if it keeps happening!","replies":[{"poster":"Notîce","date":"2017-05-29T12:09:03.741+0000","up_votes":1,"down_votes":0,"body":"I've been getting the random split second pop-up issue as well and I've just tried this, seems to have worked so far :)","replies":[]},{"poster":"lil ak47 vert","date":"2017-05-29T02:31:11.278+0000","up_votes":1,"down_votes":0,"body":"Will do, thank you!","replies":[]}]}]}