{"poster":"SuperNova1","date":"2016-01-27T18:45:42.289+0000","title":"IMPARARE NOCTURNE COME JNG!!!","subforum":"Campioni e gameplay","up_votes":1,"down_votes":1,"body":"Salve ragazzi!!! Mi piacerebbe imparare NOCTURNE in giungla!!! Ho gia fatto qualche ricerca e ho visto qualche combo da fare!!! Pero vorrei il vostro parere!!! Qual&#039;&egrave; a parere vostro la miglior BUILD?? E come devo usare, ovvero fare combo, con questo champ?? GRAZIE MILLE XD","replies":[{"poster":"Domanda","date":"2016-01-27T19:04:04.136+0000","up_votes":2,"down_votes":0,"body":"Buon ciao ^^\nIntanto vorrei premettere che le build dei game sono occasionali: capitano game dove tu e il tuo team siete feeddati e ti puoi permettere di andare con oggetti AD; capitano game dove magari non state vincendo e tu cerchi di dare utilità alla squadra andando con un po' di oggetti tank. Questa abilità si acquisisce con l'esperienza in gioco quindi un pochino di pazienza e capirai cosa buildare.\nComunque io solitamente uso due siti internet:\n1. LolKing = Sito dove ci sono diverse guide, con maestrie, rune di determinato champion\n2. Probuild = Sito dove si vedono le ultimissime  build dei proplayer di lol. Si vede il loro team, il team contro e anche qui maestrie e rune utilizzate.\n\nSpero di esserti stata di aiuto, in caso chiedi pure :)","replies":[{"poster":"SuperNova1","date":"2016-01-27T19:30:39.002+0000","up_votes":1,"down_votes":0,"body":"GRAZIE XD","replies":[]}]},{"poster":"Perseus8","date":"2016-01-30T14:55:30.147+0000","up_votes":1,"down_votes":0,"body":"Come set finale io uso:\n{{item:3932}} {{item:3142}}  {{item:3074}} {{item:3075}} oppure {{item:3143}} e {{item:3020}} \nqualche volta uso anche {{item:3022}} per rallentare i nemici o {{item:3046}}.\nAll'inizio della partita, essendo un jungler ti consiglio di compare {{item:3097}} per poi trasformarlo in {{item:2303}} per mettere i trinket nel fiume.\nPer quanto riguarda le combo, le uniche  che uso sono Q+E+attacchi base a raffica. Per scappare mentre ti inseguono     E mentre stai correndo e Q per andare più veloce.\nComunque ti consiglio di vedere l'altro forum che ho scritto giorni fa.","replies":[]},{"poster":"Tankerous","date":"2016-01-27T19:48:33.502+0000","up_votes":1,"down_votes":0,"body":"Personalmente sconsiglio la BotRK come item, ci metti una eternità a farla e il punto forte di Nocturne è l'early game. Conta che ogni tua ulti nell'early deve portare vantaggio al team, che sia sottoforma di kill, assist o obiettivi, perché più passa il tempo e più Nocturne ha difficoltà ad assassinare i carry. Vai di {{item:1400}} {{item:3142}} e il danno midgame è a posto. Dopo vai tank. Hexdrinker extra contro comp con tanta AP.","replies":[]},{"poster":"Pls Buff Shen","date":"2016-01-27T19:24:10.129+0000","up_votes":1,"down_votes":0,"body":"buon salve, nocturne è il terzo champ da me più giocato (60K di maestria). Per la build è situazionale per ti prego non andare MAI full danno..... negli ultimi tempi mi sono chiesto se fosse meglio {{item:1403}} o{{item:1400}}  e alla fine ho scelto Gemma del guerriero perchè nocturne non è un champ che deve stare a farmare per poi diventare un Dio, lui deve GANKARE. quindi come build finale ti consiglio {{item:1400}} {{item:3153}} {{item:3142}} {{item:3111}} {{item:3742}}  come ultimo item da danno io ti consiglierei una tra {{item:3074}} {{item:3156}} {{item:3033}} , in una partita troll ho provato anche {{item:3046}}  e devo dire che ha funzionato bene, ero un master yi che poteva andare ovunque. Per il gameplay ti consiglio di startare sempre di Q perchè se sei nella scia ti aumenta L'AD per i campi, poi al livello 2 prendi la W perchè la passiva ti da 20% atk speed, poi la E. Maxa prima la Q, poi la E e infine la W. Per le gank ti consiglio di tirare prima la Q he ti farà aumentare l'AD e velocità di movimento, Poi usi la E in modo da metergli il fear e poi finite i lavoro, la W usala se ganki champ come {{champion:58}} {{champion:127}} {{champion:80}}  in modo da bloccare il loro stun.","replies":[{"poster":"SuperNova1","date":"2016-01-27T19:30:13.249+0000","up_votes":1,"down_votes":0,"body":"GRAZIE MILLE!!","replies":[]}]}]}