{"poster":"Otivnaig","date":"2015-05-03T13:58:16.597+0000","title":"Considerazioni sul Lore","subforum":"Discussioni generali","up_votes":3,"down_votes":0,"body":"Il Lore sappiamo tutti cos&#039;&egrave;. Per quelli che non lo sanno consiglio il canale Youtube di Nerowolf e dico che per Lore si intende tutto ci&ograve; che in LoL (o un altro videogioco) non &egrave; gameplay (o qualunque cosa relativa all&#039;essere un videogioco). Perci&ograve; affrontate la discussione come fosse un film o un romanzo.\r\nMi sono sempre fatto una domanda (stupida a dire la verit&agrave;, ma il forum &egrave; pieno di cagate, quindi ci metto il mio), la trovate a fine papiro.\r\nIl LoL siamo dei Summoner, ovvero Evocatori, qualcosa di molto simile a dei politici (come ho scritto nella mia ultima fic; che ho fatto di male perch&egrave; mi dessero del politico? mannaggia): individui dotati di grandi poteri magici e molto potenti e rinomati nella societ&agrave; di Runeterra. Gli Evocatori, da bravi politici che non sono mai d&#039;accordo su un cazzo, dopo la terza guerra mondiale, hanno deciso (finalmente) di risolvere le controversie usando l&#039;unico sistema veramente accettato dall&#039;umanit&agrave; (in LoL non ci sono solo umani, perci&ograve; pensiamo a chiunque abbia il raziocinio): la legge del pi&ugrave; forte. Ma sono politici, quindi non si sporcano le mani e, con le loro risorse (punti influenza, togliamo pure punti e abbiamo la risposta), si comprano i favori dei Campioni: sociopatici che hanno accettato il fatto di dover passare il resto della loro vita a menare altri disadattato come loro. L&#039;evocatore, vincendo &quot;partite&quot; (leggi dispute), acquisisce sempre pi&ugrave; Influenza e cos&igrave; riesce a far entrare nella propria scuderia sempre pi&ugrave; campioni (o campioni che richiedono pi&ugrave; influenza di altri).\r\nL&#039;evocatore Otivnaig ha appena acquisito un p&ograve; di Influenza riuscedo ad avere ragione su una questione, perci&ograve; manda una lettera a quello che diventer&agrave; il suo nuovo pupillo e aspetta nella sua dimora. Giorni dopo arriva un tizio vestito di blu, con una lunga spada, coi piedi sporchi e che puzza di alcol.\r\n&quot;Salve Reiet... ehm Yasuo, ti ho convocato perch&egrave; vorrei che prendessi le mie parti, quando ti verr&agrave; richiesto, nelle prossime partit... ehm dispute nella Landa degli Evocatori. E perch&egrave; no, nelle altre arene. So che hai avuto delle rogne con gente delle tue parti, perci&ograve; ti offro immunit&agrave; diplomatica. Poi, se vuoi, una doccia, un paio di scarpe e, dato che vai sempre in giro ubriaco, non sarai mai a corto di drink. Magari, pi&ugrave; in l&agrave;, anche visite per il fegato. Che ne pensi?&quot;\r\nL&#039;altro si gratta il fianco destro, rutta e risponde: &quot;Ok, perch&egrave; no... Alla prossima. Ma non voglio scarpe.&quot;\r\nFine siparietto. Arriviamo alla mia domanda. Gli evocatori &quot;prendono possesso&quot; dei campioni, ma cosa vuol dire prendere possesso? Nemmeno sua eminenza Nerowolf ha saputo dare una risposta precisa.\r\nCi sono due scuole di pensiero:\r\n- Chi pensa che l&#039;evocatore prenda possesso TOTALE del campione: il campione cade in una sorta di trance e l&#039;evocatore lo controlla come una marionetta. Io penso sia cos&igrave;, anche se toglie epicit&agrave; e profondit&agrave; ai campioni. In fondo le summoner spell, come dice la parola stessa, le fa l&#039;evocatore (anche se per mano del campione). E noi, videogiocatori, prendiamo possesso totale del champ: infatti possiamo fare solo quello che lui sa DAVVERO fare (Q,W,E,R e relative passive).\r\n- Chi pensa che l&#039;evocatore dia consigli in testa al champ, che quindi accetta il controllo pur mantenendo la propria lucidit&agrave; e raziocinio (potrebbe quindi un campione ribellarsi?). In fondo i champ dicono sempre qualcosa quando si muovono o combattono. Sona parla nella mente dell&#039;evocatore anche se muta, quindi potremmo pensare che le frasi dei champ siano solo nella nostra testa. Insomma non ne usciamo.\r\nVolevo solo sapere le opinioni del forum (o di chi, semplicemente, passa di qu&agrave;). Se magari uno ha una terza ipotesi benvenga.","replies":[{"poster":"UnluckyShraZ","date":"2015-05-03T14:47:50.206+0000","up_votes":5,"down_votes":0,"body":"Questa è più o meno la mia visione dei fatti, che può anche sembrare molto idiota (non lo metto in dubbio):\n\nNon dimentichiamoci che Runeterra è permeata da diverse forme potenti di magia. Io credo che sia più o meno così: i \"campioni\" altro non sono che individui diventati leggendari, che per i più disparati motivi si mettono al servizio della lega/ istituto della guerra.\n\nIn generale, ogni campione è \"animato\" o comunque spinto da motivazioni o cause così forti da non poter essere spente né distrutte. \nI campioni possono essere chiamati/evocati in rappresentanza delle fazioni politiche/poleis di runeterra. A questo punto credo ci siano delle distinzioni da fare a livello di \"consapevolezza\" .\n\n- Campioni che si trovano nell'arena come ambasciatori, per motivi politici o per fini su grande scala ( vecchio lore di {{champion:72}} , {{champion:22}} , {{champion:113}} ) - consapevolezza massima.\nQuesti campioni si mettono a combattere per inseguire uno scopo altamente calcolato, nelle arene della giustizia. Il che significa che vengono evocate senza perdere la propria identità individuale, libere di agire e semplicemente collegate in maniera blanda con l'evocatore.\n\n\n- Campioni che si trovano nell'arena in virtù delle proprie idee politiche o patriottiche, fortemente legati alle città stato che rappresentano ({{champion:86}} ,{{champion:42}} ,{{champion:55}} ) - consapevolezza medio-alta\nCredo sia la categoria più ampia.\nEcco, secondo me qui già cambiano le cose, bene o male i campioni di questo stampo combattono per l'onore e per la propria città, ma non necessariamente per uno scopo \"personale\", e quindi sono più facili da piegare o \"Indirizzare\" in qualche modo verso gli obiettivi.\n\n\n- Campioni senza fazione, finiti a Runeterra cercando ricchezze, avventure, o a causa di incantesimi. Consapevolezza medio-bassa.\nEcco, questo genere di campioni, ad esempio i piccioncini {{champion:81}}  e {{champion:44}}  possono essere chiamati a piacere da qualsiasi evocatore che si alza la mattina, suppongo ci sia un legame molto più stretto con \"l'evocatore\". Alla fine sono campioni che si trovano lì o in cambio di qualcosa, o perché \"ci devono stare\" o perché tutto sommato non si trovano poi tanto male.\n\n\n- Campioni impazziti, divorati, disorientati, perduti; Entità magiche di diverso tipo che hanno perso qualcosa. -Consapevolezza bassa. ({{champion:111}} {{champion:26}} {{champion:150}} )\nEcco, arriviamo ai campioni che hanno in qualche modo già in partenza perso il proprio \"Io\" e che quindi si trovano a combattere nella landa solo poiché hanno grandi poteri, forse senza nemmeno rendersi conto o sapersi spiegare poiché si trovano lì. Suppongo che in questo caso ci sia un controllo quasi \"totale\" del campione da parte dell'evocatore.\n\n\n- Entità assetate di sangue, malvagie, che perseguono il male o riti arcani. Consapevolezza assente.\n(Es. {{champion:56}} {{champion:120}} {{champion:30}} )\nEcco, queste sono entità che credo siano semplicemente \"Liberate\" nelle arene dall'evocatore di turno (che evidentemente deve avere un potere magico adeguato a chiamare o far andare via tali campioni) e lasciate libere (anche perché qualsiasi forma di contatto mentale/magico sarebbe altamente deleteria) di sfogare la propria sete di sangue ed uccidere a più non posso.\n\n\nNon dobbiamo comunque scordarci che, a prescindere dalla consapevolezza di un campione, alcuni sono di base più difficili da \"controllare\" e in qualche modo più consapevoli, poiché consumati da una grave colpa, o poiché in cerca di redenzione o di giustizia. ({{champion:157}} {{champion:110}} )","replies":[]},{"poster":"MrPinguino","date":"2015-05-03T15:55:12.109+0000","up_votes":3,"down_votes":0,"body":"Se non ricordo male tutto il discorso riguardante gli evocatori è venuto a decadere con il reboot del lore.. Quindi in questo momento siamo in una specie di \"limbo\", in cui si stanno riscrivendo tutti i vari lore e si sta pensando a come rimettere a posto tutto. A quanto pare sarà una cosa lunga, ma non credo che ci stiano neanche spingendo troppo, pare piuttosto che stiano riscrivendo i lore a forza di rework :D","replies":[{"poster":"Vileblood Pyke","date":"2015-05-03T21:24:04.770+0000","up_votes":1,"down_votes":0,"body":"I blame Runaan.","replies":[]}]},{"poster":"NiraBlade","date":"2015-05-03T22:08:46.150+0000","up_votes":1,"down_votes":0,"body":"Secondo me noi prendiamo momentaneamente possesso del corpo del champion, perchè possiamo muoverlo a nostro piacimento ed usarne le abilità (però visto che non è il nostro corpo non possiamo inserire nuove abilità in quel champion, perchè il suo fisico non è fatto per esse/non le riconosce) però la sua anima è ancora lì (vedi infatti le frasi che dicono quando li muoviamo eccetera) quindi in un certo senso sono vigili e svegli durante il game.\nPer\"noi\" intendo gli evocatori, visto che ne facciamo le veci :)","replies":[{"poster":"UnluckyShraZ","date":"2015-05-05T10:04:54.907+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=NiraBlade,realm=EUW,application-id=MJVj50Jw,discussion-id=K32jjnTX,comment-id=0005,timestamp=2015-05-03T22:08:46.150+0000)\n>\n> Secondo me noi prendiamo momentaneamente possesso del corpo del champion, perchè possiamo muoverlo a nostro piacimento ed usarne le abilità (però visto che non è il nostro corpo non possiamo inserire nuove abilità in quel champion, perchè il suo fisico non è fatto per esse/non le riconosce) però la sua anima è ancora lì (vedi infatti le frasi che dicono quando li muoviamo eccetera) quindi in un certo senso sono vigili e svegli durante il game.\n> Per\"noi\" intendo gli evocatori, visto che ne facciamo le veci :)\n\nIn realtà possiamo inserire nuove \"abilità\" nel campione. Giusto per ricordare xD {{summoner:21}} {{summoner:2}} {{summoner:13}} {{summoner:1}} {{summoner:3}} {{summoner:4}} {{summoner:17}} {{summoner:6}} {{summoner:7}} {{summoner:14}} {{summoner:32}} {{summoner:31}} {{summoner:11}} {{summoner:12}} {{summoner:30}}","replies":[{"poster":"NiraBlade","date":"2015-05-05T15:22:02.435+0000","up_votes":1,"down_votes":0,"body":"eh si hai ragione, me ne ero dimenticata xD probabilmente fanno parte delle abilità che l'evocatore può decidere di \"portarsi dietro\" quando \"entra\" in un champion :)","replies":[]}]}]},{"poster":"Otivnaig","date":"2015-05-03T17:32:26.338+0000","up_votes":1,"down_votes":0,"body":"Beh suppongo che, finchè siamo evocatori, il \"problema\" rimarrà. Anche se han tolto l'istituto della guerra dalle lore singole.","replies":[]},{"poster":"Lord Valotz","date":"2015-05-03T14:26:35.042+0000","up_votes":1,"down_votes":0,"body":"Secondo me potrebbero essere delle proiezioni dei campioni quelle che comandano, altrimenti dovrebbero morire a tutti gli effetti, mentre così si può spiegare il tornare a combattere dopo essere morti. Magari controllano lo \"spirito\" del campione che però assume un aspetto materiale nell'arena. Magari i campioni sono in una stanza dove cadono in trance sotto il controllo dell'evocatore che ne porta una parte di loro nell'arena, un po' come funziona in Matrix.","replies":[{"poster":"UnluckyShraZ","date":"2015-05-03T14:57:21.539+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lord Valotz,realm=EUW,application-id=MJVj50Jw,discussion-id=K32jjnTX,comment-id=0000,timestamp=2015-05-03T14:26:35.042+0000)\n>\n> Secondo me potrebbero essere delle proiezioni dei campioni quelle che comandano, altrimenti dovrebbero morire a tutti gli effetti, mentre così si può spiegare il tornare a combattere dopo essere morti. Magari controllano lo \"spirito\" del campione che però assume un aspetto materiale nell'arena. Magari i campioni sono in una stanza dove cadono in trance sotto il controllo dell'evocatore che ne porta una parte di loro nell'arena, un po' come funziona in Matrix.\n\nE con loro (ad esempio)\n{{champion:34}} {{champion:30}} {{champion:56}} {{champion:120}} ) ?","replies":[{"poster":"Lord Valotz","date":"2015-05-03T15:32:46.004+0000","up_votes":1,"down_votes":0,"body":"Mi pare che nella Lore di Choghat e Fiddlestick fosse scritto che vengono tenuti sottochiave e poi evocati nelle arene, magari fanno lo stesso con questi. SonO solo supposizioni dato che non c'è nessuna spiegazione ufficiale, anzi alcune Lore sono molto scarne.","replies":[]}]}]},{"poster":"Otivnaig","date":"2015-05-03T14:44:35.013+0000","up_votes":1,"down_votes":0,"body":"A questo non avevo pensato, quadra. Grazie dell'idea.","replies":[]}]}