{"poster":"Otivnaig","date":"2015-11-24T16:34:11.953+0000","title":"Possibile soluzione all'AFK, parliamone","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"L&#039;afk &egrave; una gran rottura di palle. Scervellandomi sul come arginare il problema sono giunto a diverse soluzioni, ma tutte inattuabili perch&egrave; sono dei &quot;buff&quot; alla squadra che ha l&#039;afk. Risultato? Si pu&ograve; andare afk volontariamente per far vincere o dar un certo tipo di vantaggio al team.\r\nPer&ograve; una mi &egrave; rimasta: se il cooldown della morte dei champ diminuisse in base a quanti afk ci sono in squadra? Non scombinerebbe troppo il gameplay, non &egrave; un vantaggio eccelso ma ovvia al solito problema: che fare ace &egrave; pi&ugrave; facile. Quindi &egrave; pi&ugrave; facile difendere un&#039;ipotetica base al minuto 80 se 4 persone sono morte... Non so, qualcosa come 10 secondi in meno dopo il minuto 30 e 5 secondi per ogni afk dopo il primo, una cosa del genere.","replies":[{"poster":"FuocoVaaS","date":"2015-11-24T22:01:00.351+0000","up_votes":2,"down_votes":0,"body":"È difficile bilanciare la partita con un afk.\nFar rinascere prima può significare anche gold per l altra squadra prima .......\n\nSecondo me l operazione inversa è meglio......\nSe l altra squadra avesse un tempo di rinascita maggiore?\nVincere un fight 4 vs 5 non è semplice....ma se dopo averlo vinto avessi più tempo per guadagnare obbiettivi?","replies":[]},{"poster":"Chroniicles","date":"2015-11-24T20:47:02.550+0000","up_votes":1,"down_votes":0,"body":"Il problema è che quando c è un afk in team spesso si surrenda appena possibile (specialmente quando lo è dall inizio) perché gli avversari riescono a prendere subito troppo vantaggio e, a parte casi sporadici, in 4 è veramente difficile reggere.\nSi potrebbe anche lavorare sull oro di team, sempre che poi avere un afk non sia più vantaggioso di essere in 5","replies":[]},{"poster":"Promo Hunter","date":"2015-11-24T16:56:21.761+0000","up_votes":1,"down_votes":0,"body":"Sono d'accordo.(piccola aggiunta stravagante: se dopo 10 min di afk il giocatore vennisse letteralmente bannato dalla partita e il suo \"oro passivo\" venisse ridistribuito tra i restanti giocatori online?)\nPs: i tuoi tempi sarebbero un pò da modificare visto che al lv1 se schianti ti ci vuole 1 sec neanche per rinascere col tuo metodo.","replies":[{"poster":"Otivnaig","date":"2015-11-24T16:59:22.592+0000","up_votes":1,"down_votes":0,"body":"Erano cifre a caso ma ho scritto dopo il minuto 30. Magari famo pure 35","replies":[]}]},{"poster":"Giacux","date":"2015-11-24T16:47:29.758+0000","up_votes":1,"down_votes":0,"body":"Se una partita durasse 80 minuti tutti e 10 giocatori andrebbero afk volontariamente","replies":[{"poster":"Otivnaig","date":"2015-11-24T16:48:57.023+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Giacux,realm=EUW,application-id=MJVj50Jw,discussion-id=vLEGHqE5,comment-id=0000,timestamp=2015-11-24T16:47:29.758+0000)\n>\n> Se una partita durasse 80 minuti tutti e 10 giocatori andrebbero afk volontariamente\n\nEra un'iperbole.","replies":[]}]}]}