{"poster":"Meantime","date":"2015-11-12T20:50:13.929+0000","title":"Support gesucht für Langfristiges 5vs5 Ranked Team","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hey,\r\n\r\nwir haben uns entschlossen ein langfristiges Ranked Team auf die Beine zu stellen, und hierf&uuml;r suchen wir einen Support. Erst ein paar Infos zu uns, wir sind alle 22 Jahre alt, Elo Gold, und Dia (Plat smurf) und haben auch alle sehr viel Zeit und Lust ein Ranked Team aufzustellen. Teamm&auml;&szlig;ig haben wir gr&ouml;&szlig;enteils Erfahrung, und bieten deshalb auch erfahrenes Training f&uuml;r die Positionen an.\r\n\r\nzu dir:\r\nWir suchen einen Support, wie oben schon erw&auml;hnt\r\nAlter spielt keine Rolle, jedoch die Reife! ;) (Kritikf&auml;higkeit ist notwendig!!)\r\nDu solltest dich stetig verbessern wollen!!!\r\nTeamspeak + Funktionierendes Headset sollten vorhanden sein\r\n\r\nElo: ab Gold V\r\nDesweiteren solltest du auch viel Zeit!!! &amp; Lust haben :)\r\n\r\nFalls ihr Interesse habt, meldet euch bei mir, wir werden dann im Laufe der n&auml;chsten Tage Tryouts machen um zu schauen wie es menschlich &amp; spielerisch zueinander passt :)\r\n\r\nMeantime","replies":[{"poster":"Hi im Baìthoven","date":"2015-11-14T12:19:56.484+0000","up_votes":1,"down_votes":0,"body":"Hey schaut mal hier rein.\nich denke ich könnte zu euch passen.\nhttp://boards.euw.leagueoflegends.com/de/c/clans-teams-de/ajZ3AeLm-gold-support-sucht-ranked-team-gold","replies":[]},{"poster":"Stylè","date":"2015-11-12T22:00:23.153+0000","up_votes":1,"down_votes":0,"body":"Main Support (andere Rolle Toplane)\n\n17 Jahre alt\n\nSeit Season 2 Ende am LoL spielen und seit Season 3 in einem Plat-Dia Team, ich selber nahm immer die rolle als Supporter ein, da mein ganzes Team high Plat+ war und ich mit meinem Real-Life Kollegen (Dia 3-4) auf der Botlane war. Diese Season erreichten wir im Teamranked nach 2 Jahren Teamranked Platin und dann war es so weit, wir lösten uns auf. Ich selber war all die Jahre Teamleiter und ich weiß selber, dass ein Teamzusammen zuhalten sehr schwierig ist, also könnt ihr bei mir wenn es mir gefällt rechnen, dass ich im Team bin bis ich mit Lol aufhöre. \nZudem kann ich nur sagen bei Teaminternen Problemen, REDEN HILFT!\n\nMap Awareness vorhanden\n\nKein Geflame, gerage usw.\n\nMotivation vorhanden\n\nAlle Champs vorhanden\n\nTs, Skype usw. kein Ding\n\nKönnte als Organisator im Team fungieren, Turniere, Splits, Trainingszeiten, usw. , da ich seit Jahren guten Kontakt zu Turniergastgebern habe.\n\n\n\nLG Eximation","replies":[]},{"poster":"N3sos","date":"2015-11-12T21:24:38.278+0000","up_votes":1,"down_votes":0,"body":"AD ist Raus :)","replies":[]}]}