{"poster":"Fenix Star","date":"2016-04-05T18:02:45.738+0000","title":"Recién subidito a lvl 30. ¿Y ahora?","subforum":"Guias y consejos","up_votes":2,"down_votes":0,"body":"Buenas tardes a todos los jugadores y amigos del League of Legends!\r\n\r\nHoy traigo una increible duda que tengo:\r\n\r\nReci&eacute;n subo a nivel 30, juego bastante poco para lo que es la media de horas diarias que se juega al LoL.\r\n\r\nMi duda es &iquest;Qu&eacute; debo hacer ahora? No tengo todos los campeones, solo tengo los que valen 300 pi, y algunos que me he comprado porque me gusta jugarlos, como Shyvana{{champion:102}} , Fiora {{champion:114}} o Shaco{{champion:35}} .\r\n\r\nTengo runas tier 3 para Shaco, pero no m&aacute;s que eso y a todos los champs se las meto, aunque sea para tener algo.\r\n\r\nC&oacute;mo debo invertir los PI que tengo (Aproximadamente 11000)?\r\n\r\nDebo comprar campeones? debo comprar runas? debo dedicarme a jugar otro juego =P? Qu&eacute; estilo de juego tengo que jugar para juntar m&aacute;s y m&aacute;s PI? Debo jugar Aram? o Normales? \r\n\r\nTenia pensado ir comprando los campeones desde los mas baratos a los mas caros, obviamente que con puntos de influencia, ya que no pienso poner ni $1 en un video juego supuestamente f2p.\r\n\r\nPero esto significaria retrasar la entrada en clasificatorias. \r\n\r\nNECESITO SU AYUDA AMIGOS!!!\r\n\r\nMuchas gracias!","replies":[{"poster":"Casandra Lange","date":"2016-04-05T18:25:52.304+0000","up_votes":4,"down_votes":0,"body":"El lvl 30 es como cuando cumples 18 años, puedes hacer muchas cosas y crees que has vivido y visto un montón de cosas pero con el paso de los días te das cuenta que apenas saliste del cascarón. Si quieres seguir jugando, adelante, cada vez que puedas comprate una página de runas y enfócate en llenarla. Prueba los campeones de rotación semanal gratuita y si te gusta uno pues vas ahorrando pi para comprarlo. Lleva mucho tiempo tener un pool de champs grande, así que no te preocupes. Si puedes juega en premade, suele ser más divertido y las derrotas menos amargas. :)","replies":[]},{"poster":"Zercurgar","date":"2016-04-06T01:17:51.924+0000","up_votes":2,"down_votes":0,"body":"Ya en 30:\nDebes tener páginas de runas que se adapten al menos a tus dos roles más utilizados.\nDebes empezar a juntar campeones que te permitan cierta flexibilidad para tus roles.\nDebes tener un conocimiento del juego que te permita organizar el equipo.\n- Wardear con estrategia y actuar en consecuencia.\n- Moverte por el mapa en forma eficiente.\n- Hacer un balance apropiado de la situación de tu equipo y aprovecharla.\n+ Si estás perdiendo evaluar split-push o defensa.\n+ Si estás ganando tomar objetivos o forzar team fight.\n- Armar los items en forma consecuente con tu rival de línea.\n- No perseguir la kill más allá de lo razonable, no regalar kills.\n- Tener la templanza de carácter para no sucumbir ante los trolls y los flamers.","replies":[]},{"poster":"SnowHorse","date":"2016-04-05T22:36:37.527+0000","up_votes":2,"down_votes":0,"body":"bueno, ahora el tema de comprar campeones con lo de las cajas se facilita mucho, anda pensando bien que te gusta y no compres por comprar\n\nbueno, sos lvl 30, como dijo uno aca abajo es como cumplir 18 jaja\n\n\napunta a ir entendiendo las mecánicas mas en profundidad, te recomiendo al menos 200 o 300 partidas de normal en grieta antes de aspirar a una ranked - no te va a servir de nada si sos un dios en la linea y despues cuando salis de fase de lineas y despues no sabes que hacer\n\nempeza a ESTUDIAR campeones que te gustan, las guias de mobafire si bien son bastante criticables son buenas para largar (metete en las que estan en ingles)\n\nlas runas con super básicas, deberías armarte al menos 3 o 4 paginas con lo básico, de ad, de ap y algo de tank, alguna de jg quizás...\npensa que por ejemplo entrar con 15 ad mas a la linea es una grosería... lo básico en defensa suele ser armadura chata y resistencia mágica progresiva.... después cuando estes mas adentrado en las mecánicas finas, si alguno de tus campeones lo demanda, vas a tener una pagina de runas exclusiva para el\n\njugar juga el modo de juego que te guste... aram para pavear y practicar con campeones un poco esta bueno, te da flexibilidad de dedos y te interioriza en los items y roles, así como practica de team fights\n\nno se si estas usando el smartcast o no, si no lo usas es hora que empieces, es como las rueditas de apoyo de la bici\n\ny por sobre todo, acordate que el lol es un juego, y su objetivo principal es divertirse, si no te divertis, no sirve","replies":[]},{"poster":"Hell Darking","date":"2016-04-05T18:17:32.725+0000","up_votes":2,"down_votes":0,"body":"Si eres lvl 30, sigue jugando nomas.. a lo largo del juego veras campeones que te gustan/gustaran y querras comprartelos, verle maestrias y runas.\nno rankees hasta que estes 110% seguro de que quieres, y si no quieres.. pues bien, nadie te obliga a rankear\nfelicidades por ser lvl 30 :D\n\n~~si quieres sigue jugando, yo me estoy planteando en dejar de jugar, muchos toxicos y trolls~~","replies":[{"poster":"Fenix Star","date":"2016-04-05T18:23:48.270+0000","up_votes":1,"down_votes":0,"body":"Antes que nada muchas gracias por responder! :D \n\nTe hago una nueva pregunta: ¿Cual es la mejor forma de conseguir PI?\n\n~~no te vayas. sino los que quedamos nos vamos a ir tambien~~","replies":[{"poster":"lordeman10","date":"2016-04-05T19:26:07.528+0000","up_votes":2,"down_votes":0,"body":"ojo, el kda y los objetivos no influyen en absoluto la cantidad de pi que te dan.. los unicos factores serían el tiempo de la partida y si es victoria o derrota lo demás no tiene nada que ver podés haberte quedado en base poniendo wards que si no te saco el leaver buster te va a dar lo mismo que a tus compañeros\n\ndicen que es más efectivo aram para ganar pi pero es casi lo mismo jugá lo que más te divierta y salis ganando \n\nempezá por completar las dos primeras páginas de runas, tenés suerte a nosotros nos tocó comprarlas por el doble de precio ahora las más utiles están muy baratas, cuando cumplas los requisitos usa las ranked solo cuando querés ponerte a prueba, por mucho que juegues no vas a subir nada si no las tomás seriamente para eso es mejor jugar normales mientras desarrollas tus mecánicas y conocimiento del juego \n\nsobre que campeones comprar me parece buena idea empezar por los más baratos y cuando los vayas completando te vas por el siguiente precio, sin embargo te podés dar el gusto de vez en cuando si se te antoja un campeón en especial, tené en cuenta que algunos reducen su precio cada vez que se lanza un campeón nuevo.. no vayas a comprar los que bajen este año que son Draven, Zyra, Diana y rengar","replies":[]},{"poster":"Hell Darking","date":"2016-04-05T18:37:38.036+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Fenix Star,realm=LAS,application-id=8sKIclmi,discussion-id=abd1po5m,comment-id=00000000,timestamp=2016-04-05T18:23:48.270+0000)\n>\n> Antes que nada muchas gracias por responder! :D \n> \n> Te hago una nueva pregunta: ¿Cual es la mejor forma de conseguir PI?\n> \n> ~~no te vayas. sino los que quedamos nos vamos a ir tambien~~\n\njugando normales y haciendo \"objetivos\" si bien mas kills = mas PI al final de la partida, las torres, dragones, barones, dan una buena cantidad al final.. asi que trata de hacer todo eso (en lo posible tirar todas las torres y hacer 2/3 dragons) con eso te aseguras buen pi al final de las partidas","replies":[{"poster":"Lautysan","date":"2016-04-06T02:40:43.961+0000","up_votes":1,"down_votes":0,"body":"Nada que ver, eso no influye en la cantidad de PI.\nEl PI depende de cuanto duro la partida y si fue victoria o derrota. ( y si tenes un bonus de pi o 1 victoria del dia)","replies":[]}]}]}]},{"poster":"Kukaplanero","date":"2016-04-05T18:38:17.153+0000","up_votes":2,"down_votes":0,"body":"Runas deberías de tener las estándar ad y ap, hay varios blogs y videos donde puedes encontrar cómo armarlas, esto te será suficiente hasta que puedas juntar PI para diversificarte un poco más (he gastado 150mil PI para hacerme las runas, y juntar eso lleva un buen tiempo). Sí deberías de tener las maestrías bien armadas, esto es gratis por lo cual podrás hacer cuantas quieras.\nTe recomiendo probar los campeones de la rotación semanal, te da una idea de si vale comprarlos o no.\nEn cuanto a qué modo jugar, elige el que más te divierta, después de todo para eso jugamos\nSaludos","replies":[]},{"poster":"DreamTales","date":"2016-04-05T18:27:16.147+0000","up_votes":2,"down_votes":0,"body":"llegar al nivel 30 es apenas el comienzo amigo\n{{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"Fenix Star","date":"2016-04-05T19:06:29.688+0000","up_votes":1,"down_votes":0,"body":"Muchas gracias a todos!\nLa misma duda que le pregunté a Nanahara: en qué modo se obtienen más PI? existe alguna ecuación que describa cuanto te dan por partida? Y por tiempo? porque los distintos modos de juego duran sustancialmente distintos.\n\nGracias otra vez!","replies":[]},{"poster":"Sonya Kyron","date":"2016-04-05T23:00:55.290+0000","up_votes":2,"down_votes":2,"body":"Tenes 3 opciones:\n1- entrar a rankear ahora y quedar bronce 5 elo hell por 2 temporadas seguidas tal vez 3.\n2- jugar todo lo que puedas y en noviembre empezar a rankear y quedar en plata.\n3- rankear 1 vez por mes para ver como cambia tu nivel y permanecer unranked para la proxima temporada.\n\nNo vas a ser un verdadero Plata hasta que:\nTengas al menos 15 champs main 3 por linea, unas 10 paginas de runas y 5 de maestrias.\nA demas de que conozcas al menos como usar estas 3 tecnicas:\n1- Backdoor\n2- Split Push\n3- Invade.","replies":[]}]}