{"poster":"HUN2","date":"2018-02-25T22:02:41.235+0000","title":"EZ","up_votes":2,"down_votes":1,"body":"Kedves Adminok! Mi&eacute;rt van az ha engem reportolnak az&eacute;rt mert egy kicsit durv&aacute;n visszasz&oacute;lok &eacute;s kapom a ban-t, akkor ha valamelyik (idi&oacute;ta) beirja a v&eacute;g&eacute;n, hogy &rdquo;ez&rdquo; amivel nagyon fel lehet ideges&iacute;teni a j&aacute;t&eacute;kosokat (tapasztalat) akkor azt nem bannolj&aacute;k?","replies":[{"poster":"Jack Eron","date":"2018-02-26T13:53:45.187+0000","title":null,"up_votes":1,"down_votes":0,"body":"Az EZ szerintem ritka nagy pofátlanság. Tegnap rankeden kaptam ezt meg tristana adctől, 41 perces meccs után. Hát nem volt elég, hogy buktam a rankedet, de még ezt is be kell írni? (főleg hogy nem rajta múlott a winjük). Én csak akkor írom be, amikor végig izi-zik az enemy, majd végül mégis mi nyerünk. Akkor előjön az ősember énem, de muszáj.\nEgyébként nem hiszem hogy egy szimpla EZ miatt (ha csak nem spammelte) büntetést kaphatna bárki.","replies":[{"poster":"Gregori","date":"2018-03-01T10:57:32.548+0000","title":null,"up_votes":1,"down_votes":0,"body":"Szerintem sem kapnak, viszont kaphatnának. Elég lenne egy olyan rendszer, hogy a következő 1-2 meccsre lekorlátozza a chatedet a játék, majd ugye a leteltével feloldódik. Viszont nem skálázódna a dolog, nem növelődne az idő vagy a korlátolt meccs szám, szóval nem lenne olyan veszély, hogy mindenkit bannolunk, viszont még is rendbe szedné kicsit a community-t.","replies":[]}]},{"poster":"nr1Red","date":"2018-02-26T05:03:16.501+0000","title":null,"up_votes":3,"down_votes":7,"body":"Az már régen rossz hogyha egy \"ez\" téged felbasz.","replies":[{"poster":"CreudeFerro","date":"2018-02-26T14:26:46.914+0000","title":null,"up_votes":1,"down_votes":0,"body":"Engem kevés dolog idegesít fel. Felőlem feedelhet az összes társam se érdekel, de ha meglátok egy \"ez\"-t akkor már a játék törlésén gondolkozom. Ritka gusztustalan dolog beírni.","replies":[{"poster":"nr1Red","date":"2018-02-26T15:29:25.489+0000","title":null,"up_votes":1,"down_votes":0,"body":"Fogd fel úgy, hogy \"ez\" a szegény ember ggwp-je. A legtöbb meccs végén ezt látod mindegy hogy épp a nyertes vagy a vesztes oldalon állsz. EZ csak egy kis meccs végi ércelődés általában nyertesek részéről és semmilyen mértékben nem befolyásolta az eredményt. Az sokkal dühítőbb szerintem ha valaki végig flameli a meccset megváltoztatva közvetve ezzel akár az eredményt is.","replies":[]}]},{"poster":"HUN2","date":"2018-03-05T22:49:47.882+0000","title":null,"up_votes":1,"down_votes":0,"body":"Igazából figyelmen kívül szoktam hagyni az ilyeneket, de amikor a gyerek leírja, hogy ”kys” meg mindenféle ótvar trágár szöveget és kap egy reportot, akkor nem jön a visszajelzés,de ha egy kicsit finoman leállítod, és reportol a végén téged meg kivágnak 14 napra, na az szomorú. És személy szerint be lehetne venni az ”EZ”-t is elvégre nem tudni minek a rövidítése. A ”kys” is lehetne akár (kind your sister) aminek semmi értelme tudom, de nem feltétlenűl jelenti azt amire használni szokták.","replies":[]}]},{"poster":"Nines Hutz","date":"2018-02-26T15:06:04.893+0000","title":null,"up_votes":1,"down_votes":0,"body":"Ha kapnának bann-t \"EZ\" miatt akkor kb. a játékosok 80%-a bannolva lenne...\nS4-ben kezdtem a játékot, de csak S8 preseason óta kapcsoltam be az all chat-et, mit ne mondjak ritka, ha valaki nem írja be a végén, hogy \"EZ\" ha nyertek, néha a vesztesek is mind beírják. Én nem használom, engem is zavar, de annyira nem vészes, a meccs alatti gúnyolódás rosszabb.","replies":[]},{"poster":"Zooty","date":"2018-02-25T23:27:17.553+0000","title":null,"up_votes":1,"down_votes":0,"body":"Honnan tudod hogy ők nem kapnak bant?","replies":[]},{"poster":"Gregori","date":"2018-02-25T22:04:40.721+0000","title":null,"up_votes":1,"down_votes":0,"body":"Lehet azok a játékosok is megkapják azt ami jár nekik, csak te erről nem feltétlenül kapsz tájékoztatást.","replies":[]}]}