{"poster":"xIVeenox","date":"2015-02-27T16:47:51.708+0000","title":"Ahri, Syndra oder Cassiopeia","subforum":"Champions & Gameplay","up_votes":1,"down_votes":1,"body":"Hey, ich wollte mir einen neuen Midlaner kaufen.\r\nIch hatte mir  Ahri, Cassiopeia und Syndra vorgestellt aber nun weiß ich nicht wer von denen besser ist oder für wen es sich lohnt das Geld/EP rein zu stecken.\r\nAlso halt wer besser und oder oder leichte zu spielen ist.\r\nWürde mich freuen wen ihr mir meine Entscheidung erleichtern könntet.\r\nPs: Ich könnt mir natürlich auch andere Vorschläge für die Midlane geben.\r\n\r\nDanke schon mal ich vorraus.\r\nMfg Veenox.","replies":[{"poster":"Gragion","date":"2015-02-27T17:10:05.517+0000","up_votes":2,"down_votes":0,"body":"Hi!\n\nIch sehe du spielst gerne mobile Champs, wie Kassa oder LB. Also würde ich die Ahri empfehlen, da Sie durch die Ult sehr mobil wird, dennoch ist Sie auch sehr Skillabhängig. \n\nDa du noch nicht lvl 30 bist, ist es schwer zu sagen, welchen Champ zu dir am besten passt, denn alles was du unter lvl 30 erlebst ist eine Art Vorbereitung  für die richtigen Fights mit vollen Runen und Masteries.\n\n\nGrüße! Gragion {{summoner:31}}","replies":[{"poster":"xIVeenox","date":"2015-02-27T17:29:29.686+0000","up_votes":1,"down_votes":0,"body":"Ich bin auch schon die ganze Zeit mehr auf der Seite mir Ahri zu holen.\nAber als Syndra Free to Play war hat sie es mir auch ganz schön angetan.\nUnd Cassiopeia habe ich in der LCS gesehen als TSM Bjergsen mit ihr gespielt hatte der Schaden war einfach so genial.\nAber was Cassiopeia angeht glaube ich das die ein wenig zu Skill lasstig  für mich im Moment ist.","replies":[{"poster":"Gragion","date":"2015-02-27T17:39:53.556+0000","up_votes":2,"down_votes":0,"body":"Ja, das Gefühl kenne ich. Bei den Pros sieht das so einfach aus und, wenn man es selbst macht, merkt man, wie schwer das ganze ist. :| \n\nAhri ist ein, momentan, sehr starker Champion.\n\n\nGrüße! {{summoner:31}}","replies":[]}]}]},{"poster":"Hüsman","date":"2015-03-01T14:58:14.244+0000","up_votes":1,"down_votes":0,"body":"Also ich mag Syndra am meisten. es macht spaß die ganzen superminions in die base zu werfenXD","replies":[]},{"poster":"Dream Goddess","date":"2015-02-27T17:03:24.389+0000","up_votes":1,"down_votes":0,"body":"Urgot\n\nNe ernsthaft solche fragen wie welcher Champs ist besser kann man nicht sinnvoll beantworten. Jeder Champ ist auf ihre Weise gut. Von den drei oben genannten ist Ahri am einfachsten zu spielen.","replies":[{"poster":"Gragion","date":"2015-02-27T17:10:25.044+0000","up_votes":1,"down_votes":0,"body":"Urgot FTW {{summoner:31}}","replies":[]},{"poster":"xIVeenox","date":"2015-02-27T17:07:15.608+0000","up_votes":1,"down_votes":0,"body":"Hmm hast recht das was die Champs betrifft.","replies":[]}]}]}