{"poster":"Hòpe","date":"2017-08-09T15:30:53.812+0000","title":"Ich brauche ambitionierte photoshop Künstler!","subforum":"Community-Kunstwerke","up_votes":1,"down_votes":0,"body":"Hall&ouml;chen,\r\n\r\nwie oben erw&auml;hnt brauche ich jemanden der sich mit Photoshop auskennt.\r\nIch habe vor mir &uuml;bers Internet eine Handyh&uuml;lle zu erstellen und wollte das LCS-Team Cloud9 bzw das logo mit Kirschbl&uuml;ten( nur Kirschbl&uuml;ten ohne Baumstamm) im Hintergrund zu haben.\r\nDas Internet habe ich danach durchfrostet aber leider nichts gefunden daher bitte ich die Leaguecommunity mir vielleicht damit zu helfen.\r\nDas Bild h&auml;tte ich gerne in einer gr&ouml;&szlig;eren Aufl&ouml;sung (sprich 1920x1080).\r\nF&uuml;r jede Hilfe w&auml;re ich unglaublich dankbar.\r\n\r\n\r\nMfg.\r\n\r\nxOdinsama","replies":[{"poster":"Qybe","date":"2017-11-12T19:02:46.317+0000","up_votes":1,"down_votes":0,"body":"Sollte das noch aktuell sein melde Dich mal :) :\n\nTwitter: @qxbe_\nSkype: qube.xd\nE-Mail: qxbe.mc@gmail.com","replies":[]},{"poster":"Sihari","date":"2017-08-09T16:15:36.261+0000","up_votes":1,"down_votes":0,"body":"Ich hab zwar nicht direkt Photoshop, aber ich würde mich einfach mal daran probieren, wenn du mir ein paar Fragen beantwortest. ^-^\nZählen Äste und Zweige auch zum Baumstamm?\nUnd möchtest du ganze Blüten oder gehen auch Blütenblätter?\nZum Cloud9-Logo: Mit Schriftzug oder ohne? Und ist es ok für dich, wenn das Logo bearbeitet wird (zB etwas heller, mit Blüten überlappt), oder soll es genau so sein, wie es im Original ist?","replies":[{"poster":"Hòpe","date":"2017-08-18T15:07:43.782+0000","up_votes":1,"down_votes":1,"body":"ahhhhhh sry wenns so spät kommt war in letzter Zeit viel los xD. also wenn du dich immer noch bereit stellst beantworte ich dir gerne die Fragen.\nAlso Äste und kleinere Zweige sind vollkommen in Ordnung. Wegen dem Schriftzug kannsu es so machen wie es am besten aussieht da könnte ich mir beides vorstellen. Und das Logo darf auch bearbeitet werden das ist auch nicht schlimm.\nWenn du es machen würdest wäre ich dir noch unglaublich dankbar :D.","replies":[]}]}]}