{"poster":"Sugâ","date":"2016-07-28T00:42:53.069+0000","title":"Ahri Arcadia??","subforum":"Charlas Generales","embed":{"description":"Ahri, la kumiho ancestral, aparentemente sería el siguiente campeón en recibir una skin de Arcadia. Así especulan los usuarios de Reddit luego que se difundiera la siguiente foto en la red: La imagen corresponde a un Q&A de un evento en China donde se informa que, probando su participación en dicho evento, el jugador podrá retirar lo que múltiples cibernautas traducen como una \"Arcade Ahri\".","url":"http://www.copagamer.com/index.php?option=com_pagina&id=6951","image":"http://s3-us-west-2.amazonaws.com/gcifs/images/news_35893/portada/m/portada.jpg?1469637417"},"up_votes":2,"down_votes":1,"body":"estaba buscando skins en internet creadas por fans de LoL y encontre una noticia sobre que ahri podria ser la proxima skin de arcadia, sera verdad?? como main ahri que soy seria instabuy{{champion:103}} \r\n\r\n ahora aparece un rioter y dice que esa noticia es falsa y nos tira las iluciones abajo :( jajajjajajaj\r\n{{champion:103}} {{champion:103}} {{champion:103}} {{champion:103}} {{champion:103}} {{champion:103}} {{champion:103}}","replies":[{"poster":"FurchiDC","date":"2016-07-28T07:19:32.355+0000","up_votes":1,"down_votes":0,"body":"Es un rumor probablemente cierto, el post original es este de Reddit:\n\nhttps://www.reddit.com/r/leagueoflegends/comments/4uqfme/arcade_ahri_leak/\n\nBásicamente dice que en un evento en China se va a entregar a Ahri de Arcadia a los que compren los boletos. Como todavía no salió, parece que va a salir. Probablemente en el próximo parche del PBE.\n\n--\n>Saludos. {{champion:134}} {{item:3211}} {{champion:84}}","replies":[]},{"poster":"Misery Business","date":"2016-07-28T01:07:27.907+0000","up_votes":1,"down_votes":0,"body":"Esa Ahri Arcade es una custom skin, de esas que se usan con esos programas raros asi que tranquilos que si llega a confirmarse asi no va a ser porque parece mas una Ahri de Vancouver que Arcadia.\n\nPor otro lado me cuesta imaginarme a Ahri con tematica Arcadia, hay otros campeones que le quedaria mejor, por ejemplo Orianna.","replies":[]},{"poster":"Suní","date":"2016-07-28T00:59:31.575+0000","up_votes":1,"down_votes":0,"body":"Soy main ahri y digo sin ofender \n\nQue esa skin es horrible el vestuario no es para ahri \n\nTendria que ser mas colorido ademas \n\nEse vestuario seria como para janna o mf \n\nPero no se lo veo como para ahri xD","replies":[]},{"poster":"efukt","date":"2016-07-28T00:49:28.844+0000","up_votes":1,"down_votes":0,"body":"mmm no me convence","replies":[]},{"poster":"Quo","date":"2016-07-28T00:49:11.673+0000","up_votes":1,"down_votes":0,"body":"Si es como la de la foto daria un poco de sidita el vestuario, pero why not, estaria buena","replies":[]},{"poster":"Felipe","date":"2016-07-28T00:54:41.704+0000","up_votes":1,"down_votes":1,"body":"feisima skin  :S{{sticker:zombie-brand-facepalm}}","replies":[]}]}