{"poster":"Shox D Tjark","date":"2015-10-12T14:28:04.090+0000","title":"In Game Dc Nach Kauf im Shop","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hallo Liebes RiotGame&#039;s Team,\nVorwort: Ich Habe Eine Umfrage dazu gemacht w&auml;re nett wenn Ihr (Die Beschw&ouml;re) diese beantworten w&uuml;rded zur Hilfe mir und des RiotGames Team das ich wei&szlig; obs an mir liegt oder es Ein Fehler ist. &amp; Leider Wuste ich nicht in welchem Forum ich es posten sollte, daher ich nich wei&szlig; ob es ein bug ist oder es an meinem Pc liegt, Kommen wir zum Bug/Fehler:\n\nIch Habe ingame Probleme immer nach dem ich mir einen Champ kaufe oder etwas geschenkt bekomme aus der gensckeecke: in einem game wars der Fall mit Lee sin da bekamm ich K.O-Lee sin {{champion:64}}  aus einer Mysterie und spielte nat&uuml;rlich den champ mit dem skin und hatte nur Probleme im early min 1-3 hatte ich mit einem normalen ping eine Spellver&ouml;gerung von 1-3sec mit der q in min 3 od 5 bekamm ich dann einen Dc &quot;Attemting To Reconnect&quot; und musste das spiel dann Beenden nach dem reconnecten ging ich in den ingame shop um mir Items zu kaufen diese waren dann im inventar als ichausm shop gging warten sie jedoch weg und ich bekamm erneut ein dc dies ging bis zur 20min daher wir dann surrendert haben, Leider passierte dies auch im ranked... und daher war mein early f&uuml;rn A*** und wir haben auch das spiel verloren leider....\nals ich mir dan Vor paar tagen Viktor{{champion:112}}  kaufte passierte genau das selbe ( zum gl&uuml;ck ging ich erst in ein Bot game) jedoch war es da nur f&uuml;r 1 Spiel und nich wie bei {{champion:64}}  2-3 games\n\nEdit:\n\n\nScreenshots die vll helfen:\n\nDie Screens sollten zeigen das ich auf einen punkt geklickt habe, aber es sich nix tat und mein ping auch normal war wie man sieht.\n\nhttp://www.pic-upload.de/view-28558538/Screen30.png.html\n\nhttp://www.pic-upload.de/view-28558555/Screen29.png.html\n","replies":[{"poster":"Rito Thx And Bye","date":"2015-10-12T20:10:35.399+0000","up_votes":1,"down_votes":0,"body":"Grüße!\n\nDas klingt nach einem großen Problem. Am besten du wendest dich dafür mal an den Support, wenn sich hier niemand mehr melden sollte.\n\n\"Möge das Glück immer mit dir sein!\"","replies":[{"poster":"Shox D Tjark","date":"2015-10-13T14:51:09.929+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SK Gluecks,realm=EUW,application-id=7hciEY9w,discussion-id=EcezpuoY,comment-id=0000,timestamp=2015-10-12T20:10:35.399+0000)\n>\n> Grüße!\n> \n> Das klingt nach einem großen Problem. Am besten du wendest dich dafür mal an den Support, wenn sich hier niemand mehr melden sollte.\n> \n> \"Möge das Glück immer mit dir sein!\"\n\nhab ja den Support angeschrieben der sagte ich sollte es in der Bug meldung schreiben \nich hab mir vorher durchgelesen was ein \"bug\" im sinne von RiotGames ist und wusste jz noch ob ichs da rein schreiben soll....","replies":[]}]}]}