{"poster":"Revelations 13","date":"2015-07-26T02:44:58.413+0000","title":"Hello the God Only Corki here, so just got out of my chat restict on my main account.","subforum":"Miscellaneous","up_votes":1,"down_votes":0,"body":"Intentionally never said anything even slightly reportable to anyone, I didn&#039;t even suggest anything to anyone e.g like maybe \"build some armour if you&#039;re struggling\", as saying innocent stuff like this in the hopes of heightening our chance of winning has got me reported, so yea, I said nothing, to anyone, that could be taken even slightly offensive, I didn&#039;t get one report square saying you have been negative, and then I log on today and BOOM I&#039;m chat restricted another 20 games.\n\nThis system is clearly broken and my account is clearly marked in some way to just keep giving me chat restricts for no apparent reason, how does chat restricting someone who is doing everything in their power to not get chat restricted help stop them being toxic? I&#039;m going to submit a ticket asking why I am chat restricted, I haven&#039;t been toxic, I haven&#039;t argued with anyone, I haven&#039;t been told by anyone that they are going to report me, I haven&#039;t seen one of those squares after game that tell you someone reported you, and then boom chat restricted.","replies":[{"poster":"Garens Harem","date":"2015-07-26T06:32:27.756+0000","up_votes":2,"down_votes":0,"body":">I haven't been toxic\n\nlol\n\ndeserved ","replies":[{"poster":"Revelations 13","date":"2015-07-26T07:54:49.595+0000","up_votes":1,"down_votes":0,"body":"?","replies":[]}]},{"poster":"SEKAI","date":"2015-07-28T02:29:45.430+0000","up_votes":1,"down_votes":0,"body":"If you have been toxic too many times to the point the system no longer trusts you at all, well, I guess you could only have yourself to blame for today's situation.","replies":[]},{"poster":"Talon12","date":"2015-07-26T06:07:43.749+0000","up_votes":1,"down_votes":0,"body":"I got that stuff 2. no idea why, but I actually like it, except no all chat.\n\ncuts back on unneeded banter while playing, and tbh it would reduce fights in the game by a very big ammount","replies":[]},{"poster":"Bipolar","date":"2015-07-26T03:54:58.583+0000","up_votes":1,"down_votes":2,"body":"The reason is you're tryharding to get unbanned. Just don't give a shit, use every message you have to abuse the bronzers, who gives a fuck. They ain't gonna improve if you sweet talk them.","replies":[{"poster":"Revelations 13","date":"2015-07-26T05:47:15.475+0000","up_votes":1,"down_votes":0,"body":"I got un chat resticted, I said nothing reportable in about 10 games, and then I get another chat restrict.","replies":[]}]},{"poster":"Revelations 13","date":"2015-07-26T02:53:13.015+0000","up_votes":1,"down_votes":2,"body":"Nevermind I can't even be fk'd making a ticket, as soon as new GPU comes I'm uninstalling this sht heap.","replies":[{"poster":"Zorphiax","date":"2015-07-27T11:59:36.895+0000","up_votes":1,"down_votes":0,"body":"Make a new account slowly let this account decay and come back to it once your smurf reaches level 20 leave busters think your a good player on this account and then come back to this account with like no loss of anything cause unless your plat+ nothing will decay.","replies":[]}]}]}