{"poster":"Faker on Buffalo","date":"2016-12-12T08:48:42.365+0000","title":"RiOT hat einen Fehler gemacht","subforum":"Melde einen Bug","up_votes":2,"down_votes":5,"body":"Ich wollte ganz normal ein game spielen doch ich konnte mich nicht zu dem championscreen verbinden ich dachte zuerst ich h&auml;tte Probleme mit dem Internet aber das hatte ich nicht. Das Problem war der Client also startete ich den Client neu...\r\nJedoch konnte ich wieder nicht den championscreen sehen. Ich hab mich ungef&auml;hr 10 mal versucht wieder zu verbinden doch es ging nicht . \r\nAls ich micht wieder einlogge so wie heute habe ich einen leaverbuster bekommen \r\nDa sag ich nur das Riot das nicht gut gemacht hat mit dem Leaverbuster ich finde sie sollten es so wie in CSGO machen :D Da gibst dann nicht so viele Probleme \r\nUnd danke Riot das ihr mir mal wieder den Tag versaut ;D","replies":[{"poster":"Megamaexx","date":"2016-12-12T09:30:15.896+0000","up_votes":3,"down_votes":0,"body":"Dass es vielleicht einen Fehler auf deiner Festplatte gibt, lässt sich auch ausschließen? Nutze mal die Repair-Funktion des Clients. Das hilft in der Regel.","replies":[]},{"poster":"Leylania","date":"2016-12-12T14:34:05.375+0000","up_votes":2,"down_votes":0,"body":"Ich hatte sehr lange das selbe Problem und dachte auch es würde nicht an meinem Internet liegen weil das meistens sehr gut war. Als wir dann nen neuen Router bekamen war es plötzlich und für immer weg. Es liegt also sehr wahrscheinlich eben doch an dir auch wenn du es nicht glaubst.","replies":[]},{"poster":"Homunculi","date":"2016-12-12T13:04:54.330+0000","up_votes":2,"down_votes":0,"body":"Hast du nur den \"Reconnect\" Knopf gedrückt oder auch mal das Spiel neugestartet? Bei mir hat das \"reconnecten\" selten geholfen, meistens musste das Spiel neu gestartet werden.","replies":[{"poster":"Faker on Buffalo","date":"2016-12-12T13:32:56.101+0000","up_votes":1,"down_votes":0,"body":"ja hab ich :D","replies":[{"poster":"Homunculi","date":"2016-12-12T13:45:02.764+0000","up_votes":2,"down_votes":0,"body":"Dann versuche mal, wie Megamaexx sagte, einen Client Repair durchzuführen. \nEvtl. schau mal das du in deinem Antivirusprogramm/Firewall den Ordner von LoL frei gibst(NICHT AUSSCHALTEN!!). Wenn du nur exen freigeben kannst, pass bitte auf, die Client exe ist nicht die gleiche wie in die des gestarteten Spiels. \nDies kannst du im Taskmanager herausfinden, während eines Botgames mal in den Taskmanager gehen und da nach League of Legends suchen, mit Rechtsklick kannst du dann den Ordner Pfad öffnen.","replies":[]}]}]},{"poster":"eingew","date":"2016-12-12T09:18:41.733+0000","up_votes":1,"down_votes":0,"body":"Der Leaverbuster wird ja nicht ohne Grund getriggert, dafür musst du schon öfter geleavt haben. Fakt ist, dass du damit Spiele versaust, dabei musst du nicht mutwillig Ragequitten, auch technische Fehler versauen deinen Mitspielern das Match. Der Leaverbuster hat dabei übrigens eine recht hohe Toleranzgrenze. Du bist also nun wirklich nicht unschuldig.\n\nIch empfehle dir also dringend, dich um das Problem zu kümmern, andernfalls wird deine Strafe nur erhöht. Dafür kannst du entweder ein [Ticket beim Support](https://support.riotgames.com/hc/de/requests/new) erstellen, oder dein Problem hier im Forum unter \"[Hilfe und Support](http://boards.euw.leagueoflegends.com/de/c/hilfe-support-de)\" schildern, in der Hoffnung, dass dort jemand eine Lösung dafür hat. Alternativ kann dir vermutlich auch der Techniker deines Vertrauens helfen.","replies":[{"poster":"Faker on Buffalo","date":"2016-12-12T13:34:03.134+0000","up_votes":1,"down_votes":0,"body":"das passiert halt leider öfter also habe ich halt einen leaverbuster bekommen ich würd ja nicht absichtlich ein game abbrechen","replies":[{"poster":"eingew","date":"2016-12-12T16:01:02.273+0000","up_votes":1,"down_votes":0,"body":"Naja, aber wenn du so oft leavst, dass du eine Strafe dafür bekommst, dann müssen dir die Probleme ja eigentlich bekannt sein. Trotzdem hast du gespielt. Da kann man zumindest von Fahrlässigkeit sprechen...","replies":[]}]}]}]}