{"poster":"JollyJack360","date":"2015-07-01T15:11:07.539+0000","title":"Chroma Pack!!!!!!!!!!! X(","subforum":"Discussioni generali","up_votes":3,"down_votes":1,"body":"avevo gi&agrave; scritto due righe ma nel scriverlo in quel modo forse non sono stato preso inconsiderazione, sul serio. Ecco cosa ho scritto poi alla riot in una richiesta.\n Io non capisco il senso dei chroma pack. Non vorrei sembrare irrispettoso, ma dopo aver visto il chroma pack su bard non ci ho visto pi&ugrave;. Mandai all&#039;ora quando uscirono le prime chroma, un email di chiarimento sul forum americano, cui purtroppo il commento fu cancellato. Pertanto lo chiedo a voi in quanto portare le veci di questo gioco qui in questo paese. il commento si intitola Chroma Pack perch&eacute;? Lo so forse ho un p&ograve; esagerato, ma l&#039;ho fatto perch&eacute; non volevo essere ignorato. se la cosa vi aggrada, va bene anche una risposta in privato su quest&#039;email. per me non fa differenza, ma voglio capire. Perch&eacute; per come si &egrave; dimostrata la cosa, mi sembra solo una trovata per spremere i giocatori, niente di pi&ugrave;, niente di meno. e la cosa non mi ha dato poco dispiacere, anzi l&#039;ho visto come un insulto. specie per quei tecnici che passano ore ad inventare nuovi modelli grafici, originali e tutto, mi riferisco alle skin. Infatti io quando le compro, quando posso, le compro non solo perch&eacute; mi piacciono, ma mi piace anche il lavoro che c&#039;&egrave; stato dietro, e l&#039;ho apprezzo. vedere una cosa come le chroma e metterle allo stesso prezzo di una skin, anzi superiore, in quanto 520 su 590.....mi sembra un insulto verso i vostri stessi collabortori. Questo &egrave; un mio pensiero, Non giudico, ma vorrei sentire anche la vostra opinione. Inoltre le chroma non richiedono molte ore per essere fatte, quanto richiedono 2 minuti? Non &egrave; una critica, ma mettere un lavoro di pochi secondi a confronto di uno che richiede mesi, oppure settimane.........Io onestamente avrei dato le dimissioni. Aiutatemi a capire che mi sbaglio e ho dato un giudizio afrettato, Altrimenti vedetevi di regolare. inoltre trovo ridicolo di comprare tre tipi di colori, quando sarei interessato ad uno solo. Se i chroma pack avessero avuto anche un prezzo in ip insieme a quelli in rp, non avrei detto nulla, visto che anche i champ hanno questa cosa. Grazie di tutto.","replies":[{"poster":"Ucr0niA","date":"2015-07-01T15:26:04.568+0000","up_votes":5,"down_votes":0,"body":"La risposta alla questione potrebbe essere sempre la stessa:\n\"In fin dei conti è semplicemente qualcosa in più, chi la desidera può acquistarla, chi non la condivide può farne a meno\"\n\nObiettivamente non vedo perchè polemizzarci tanto; inoltre posso portarti casi in cui a mio avviso il chroma è stato una gran cosa, e per me tra questi rientra lo stesso Bard.\n\nPrendi ad esempio un Darius, a mio avviso nessuna skin rispecchia la sua personalità quanto il suo aspetto base, la skin \"Lord Darius\" per quanto forse al top (anche bioforgia per me è di alto livello, ma si cambia stile, idem dicasi poi per Dunkmaster) va contro il suo lore e concept;\nQuindi, per me, avere un Chroma del suo aspetto base, in caso dovessi affezionarmi a questo champ (a mio avviso carismatico) sarebbe una gran cosa, visto che tendo a skinnare i miei main.\n\nPer quanto avrei desiderato una skin diversa per Zac, che non fosse neppure la Poolparty, so per certo che in molti non condividono la sua skin \"arma speciale\" e forse a quella preferiranno il color rework della skin iniziale, giocandolo quale \"bubblegum zac\" o simili.\n\nBard, a me l'alternativa al suo aspetto base non piace, quindi onestamente, anche io sarei più incline a un CR che a comparmi la skin.\n\nAltro esempio ancora, non mi piacciono le skin di Braum (per quanto El tigre sia un bel concept) perchè ritengo che il suo aspetto originale sia il migliore, e comprerei volentieri un Braum con i marchi rossi anzichè blu sul torace o simili.\n\n\nOvviamente questo è solo il mio pensiero, ma in tanti potrebbero avere un motivo per prendere il chroma, e non vedo questo come possa ledere in fin dei conti chi è contrario.","replies":[{"poster":"Nibbio Bianco","date":"2015-07-02T07:06:08.096+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Ucr0niA,realm=EUW,application-id=MJVj50Jw,discussion-id=W8ssdi0f,comment-id=0001,timestamp=2015-07-01T15:26:04.568+0000)\n>\n> La risposta alla questione potrebbe essere sempre la stessa:\n> \"In fin dei conti è semplicemente qualcosa in più, chi la desidera può acquistarla, chi non la condivide può farne a meno\"\n> \n> Obiettivamente non vedo perchè polemizzarci tanto; inoltre posso portarti casi in cui a mio avviso il chroma è stato una gran cosa, e per me tra questi rientra lo stesso Bard.\n> \n> Prendi ad esempio un Darius, a mio avviso nessuna skin rispecchia la sua personalità quanto il suo aspetto base, la skin \"Lord Darius\" per quanto forse al top (anche bioforgia per me è di alto livello, ma si cambia stile, idem dicasi poi per Dunkmaster) va contro il suo lore e concept;\n> Quindi, per me, avere un Chroma del suo aspetto base, in caso dovessi affezionarmi a questo champ (a mio avviso carismatico) sarebbe una gran cosa, visto che tendo a skinnare i miei main.\n> \n> Per quanto avrei desiderato una skin diversa per Zac, che non fosse neppure la Poolparty, so per certo che in molti non condividono la sua skin \"arma speciale\" e forse a quella preferiranno il color rework della skin iniziale, giocandolo quale \"bubblegum zac\" o simili.\n> \n> Bard, a me l'alternativa al suo aspetto base non piace, quindi onestamente, anche io sarei più incline a un CR che a comparmi la skin.\n> \n> Altro esempio ancora, non mi piacciono le skin di Braum (per quanto El tigre sia un bel concept) perchè ritengo che il suo aspetto originale sia il migliore, e comprerei volentieri un Braum con i marchi rossi anzichè blu sul torace o simili.\n> \n> \n> Ovviamente questo è solo il mio pensiero, ma in tanti potrebbero avere un motivo per prendere il chroma, e non vedo questo come possa ledere in fin dei conti chi è contrario.\n\nFarebbe figo un Braum con capelli e baffi arancioni, segni verdi e pelle bianca, farebbe molto Irlanda.","replies":[{"poster":"JollyJack360","date":"2015-07-04T10:07:51.179+0000","up_votes":1,"down_votes":0,"body":"Oppure molto Joker X)","replies":[]}]},{"poster":"JollyJack360","date":"2015-07-01T21:35:50.546+0000","up_votes":1,"down_votes":0,"body":"Ti ringrazio per il tuo commento. Se posso essere onesto sei il primo in assoluto che ha espresso un suo parere personale in merito alle chroma. Si infatti questa è la loro funzione, tuttavia io non capisco due cose:\n-il costo eccessivo, in quanto costa più delle skin (590 vs 520 rp)\n- compro tre colori, invece del colore che più mi piace. se per esempio mi piace lucian blue, e schifo quello rosso e giallo, sta tranquillo che non lo compro.\n- terzo, lo so ma mò mi è venuto in mente, per le skin, perché pagare le chroma di quella skin, quando già hai pagato per quella skin???\nQuesti sono i dilemmi, che chiedo.","replies":[]}]},{"poster":"Firenheit","date":"2015-07-01T16:18:25.153+0000","up_votes":4,"down_votes":0,"body":"Io ciò che mi chiedo, è perché diavolo alcune chroma sono fatte sulle skin.\nChroma di Zac, che belle, volendo le compro.\nChroma di Zed, dovrei comprarmi la skin prima.\nWhy?","replies":[{"poster":"JollyJack360","date":"2015-07-01T21:24:21.152+0000","up_votes":1,"down_votes":0,"body":"Le chroma hanno quella funzione ad invogliare il giocatore a comprare, per esempio.... la skin di Veigar boss Finale, ad esempio, è una bella skin, ma il blue non è il tuo colore preferito, in quato il tuo è il rosso. pertanto tu satesti incline a comprare skin inerenti a quel colore. con le chroma pack nessun problema devi solo sborsare e hai il colore che vuoi XD. \nHo risposto alla tua domanda??","replies":[{"poster":"Firenheit","date":"2015-07-01T21:35:03.965+0000","up_votes":1,"down_votes":0,"body":"Ma si, però questo ragionamento dovrebbe essere fatto per ogni skin.\n\"Le stanno facendo\" Ok, quindi vedremo poi... Ma secondo me le skin sono quelle, mentre i recol sono delle \"mini\" skin, 3, a relativamente basso costo che vanno semplicemente a colorare in modo diverso un campione... E' un ragionamento che fila, secondo me, benissimo sulle skin base, appunto per creare un'alternativa a un costo non altissimo!","replies":[{"poster":"JollyJack360","date":"2015-07-01T21:40:27.370+0000","up_votes":1,"down_votes":0,"body":"Filerebbe anche a me, ma per essere delle mini skin, perché costano più delle skin di 520 rp?? se il prezzo delle chroma fosse un tantino più basso ok, se avessero un metodo di pagamento con ip anche.... malenon sarebbe.","replies":[]}]}]}]},{"poster":"Polarize","date":"2015-07-01T15:26:55.555+0000","up_votes":4,"down_votes":0,"body":"Non capisco perchè dovrebbero essere gratuite, sul serio.\n\n_free is good, i guess_","replies":[{"poster":"JollyJack360","date":"2015-07-01T21:29:18.039+0000","up_votes":1,"down_votes":0,"body":"Il fatto è che non stò pretendendo che debbano essere gratuite, dopotutto anche gli ip sono una forma di moneta all'interno del gioco, altrimenti non avrebbe senso spaccarsi di ore e ore per completare una pagina di rune.\nTuttavia come prezzo govrebbe essere anche giusto, cosa che le chroma non sono. valgono più le chroma che i chap da 1350ip in giù. Inoltre quando compro un colore, perché mi tocca prendere anche gli alti?? per tenere il prezzo alto??. non é equo. Mentre vi sono collaboratori che lavorano e perdono molto tempo dietro alla realizzazione dei champ e delle skin. Sai quanto tempo serve per realizzare un chroma?? meno di 5 minuti. due clik paghi 5 euro......Scherziamo?? Almeno questa è una mia opinione","replies":[]}]},{"poster":"Canister16501","date":"2015-07-02T07:01:24.342+0000","up_votes":2,"down_votes":1,"body":"Ragazzi la cosa divertente è che la riot in pratica non fa altro che fare una cosa facilissima che potremmo fare anche noi utenti: cambiare il colore delle skin, scaricabili da internet, con programmi di grafica come photoshop o altro, cambiando il pattern.\nRito pls, insegna agli angeli a trollare. Per maggiori informazioni rispondete su questo commento e probabilmente lacsierò il link di un video\nPeace","replies":[{"poster":"JollyJack360","date":"2015-07-03T08:23:08.350+0000","up_votes":1,"down_votes":0,"body":"Non mettere link.. tanto lo sanno gia tutti.","replies":[]}]},{"poster":"Azharidan","date":"2015-07-01T15:23:18.501+0000","up_votes":2,"down_votes":1,"body":"I chroma pack hanno motivo di esistere come skin di colore differente da quella basic, ma dovrebbero essere gratuite , purtroppo la Riot ha ben pensato di specularci sopra quindi nulla da fare .\n\n","replies":[{"poster":"JollyJack360","date":"2015-07-01T21:30:04.105+0000","up_votes":1,"down_votes":0,"body":"Non è detto.","replies":[]}]}]}