{"poster":"JollyJack360","date":"2015-05-30T21:32:16.424+0000","title":"Ho un problema (nulla di grave per fortuna)","subforum":"Discussioni generali","up_votes":3,"down_votes":2,"body":"Ciao a tutti ho scritto dal titolo che ho un problema, di per se abbastanza stupido, ma purtroppo non riesco ad arrivare ad una soluzione.\r\nVoglio acquistare un nuovo champ. Sono indeciso sui adc, in particolare tra miss fortune e vayne. lo so che vince vayne, ma perch&eacute;?\r\nesattamente che vantaggi mi da Miss fortune, e quali invece Vayne?sono due champ praticamente opposti, in quanto spesso vayne viene definita come un assasin ?!\r\ncome terza opzione ci sarebbe Corki, oppure urgot, ma quest ultimo nella bot &egrave; un pick estinto. pertanto se avete pick migliori da suggerire, vorrei capire il perch&eacute;.\r\nGrazie.","replies":[{"poster":"Nibbio Bianco","date":"2015-05-30T21:38:37.305+0000","up_votes":5,"down_votes":0,"body":"Attualmente Urgot è top pick in elo alto come adc, secondo pick in mid, in elo più basso lo trovi sopratutto in top. \n\nMiss fortune fa semplicemente schifo. La riot ha creato un adc senza un reale scaling nel late game, o comunque inferiore agli altri adc, e gli adc servono sopratutto in late, ergo miss fortune non è quasi mai un buon pick. è vero che è forte in early game, ma ci sono pick migliori per l'early game, come caitlyn, che è più semplice da usare ad ha anche un escape. \n\nVayne attualmente è uno degli adc più forti perché attualmente si giocano molti tank, delle volte si arriva anche a 4 tank, e vayne è molto efficace contro questo tipo di campioni, ma è un campione molto difficile da usare.\n\nCorki fa danni misti, attualmente nel meta dei tank non è un grandissimo pick perché non riesce a fare gli stessi danni che farebbe un altro adc su questa categoria di campioni. \n\nNon so le tue abilità e come te la cavi con gli adc, se non credi di essere abbastanza bravo da giocare vayne, è meglio non comprarla, aspetta che vada in prova, provala per una decina di games di fila e vedi come la senti, altrimenti con Urgot fai un pick sicuro ora come ora, è molto forte ma in elo più basso non se ne sono ancora accorti e questo ti dà una grande opportunità per giocare un campione veramente forte ma che passa inosservato.","replies":[{"poster":"JollyJack360","date":"2015-05-30T21:41:13.792+0000","up_votes":1,"down_votes":0,"body":"Grazie mille, mi sa che prenderò urgottino per il momento, poi male che vafa lo uso top. XD\nsolo una cosa.... ma quella caspita di ulty come la devo farla funzionare?","replies":[{"poster":"Nibbio Bianco","date":"2015-05-30T21:55:51.615+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=JollyJack360,realm=EUW,application-id=MJVj50Jw,discussion-id=ERhmFb9z,comment-id=00000000,timestamp=2015-05-30T21:41:13.792+0000)\n>\n> Grazie mille, mi sa che prenderò urgottino per il momento, poi male che vafa lo uso top. XD\n> solo una cosa.... ma quella caspita di ulty come la devo farla funzionare?\n\nNella lane puoi cercare di ultare il support per arrivare abbastanza vicino da attaccare il carry, altrimenti ultare direttamente il carry, è buono farlo anche quando qualcuno sta scappando con pochi hp. \n\nSe il jungler ti viene da dietro puoi ultarlo per scappare. \n\nNei teamfight se l'assassino ti salta addosso lo ulti nel momento più opportuno ( ad esempio con katarina durante la sua ultimate per bloccarla, contro zed prima gli fai la e, perché sai dove apparirà, dopodiché lo ulti ). \n\nPuoi utilizzarla anche come ingaggio, se magari l'adc o l'apc sono malposizionati, tanto subito dopo la ultimate ottieni 120 armor e magic resist, ergo non ti fanno molto danno. \n\nCerca di NON utilizzarla su campioni dove la ultimate potrebbe non funzionare ( shaco che diventa invisibile, vladimir che diventa pozza di sangue, kassawin ). \n\nNel teamfight puoi anche conservare la ultimate per cercare di beccare successivamente l'adc o l'apc. \n\nCome incantesimi dell'evocatore puoi usare {{summoner:4}} {{summoner:6}} ( le mie preferite ), ti permettono di avere più possibilità di fare plays interessanti, potresti ultare l'adc andando a finire in mezzo al team avversario, ma subito dopo attivando queste due abilità ne usciresti indenne, oppure se qualcuno cerca di scappare puoi utilizzarle e inseguire chi cerca di scappare e ultarlo, molto forte se ti fai {{item:3268}} \n\n{{summoner:4}} {{summoner:7}} Classiche per la botlane, possono darti un grande aiuto in early game, ma già dal midgame inizi ad accorgerti che è abbastanza inutile in quanto Urgot è abbastanza tank e la cura fa poco e niente, ma visto che nel mid game probabilmente cercherai di lane bullare e giocartela di poke, trovo l'heal abbastanza inutile.\n\n{{summoner:4}} {{summoner:12}} Il teleport è strano per la botlane? Non per Urgot. Ha seri problemi a rimanere nella lane in quanto già dopo pochi minuti finisce tutto il mana. Finché avrai il mana i tuoi nemici temeranno seriamente il tuo danno, non appena l'avrai finito, però, inizieranno a dartela di santa ragione. Con il teleport puoi recallare non appena hai 720 gold, prenderti la tear of goddes e tornare nella lane. Può sembrare una cavolata, ma una cosa del genere può realmente cambiarti la vita, in quanto la muramana l'avrai ottenuta intorno al 20° minuto, e non intorno al 30°. Avere la muramana al 20° significa poter fare danni veramente seri, avere il late game fin dal midgame. Oltre al fatto che il teleport ti permette di avere in botlane un vantaggio di exp, e possibile anche utilizzo per aiutare lane svantaggiate ( tanto c'è sempre il tuo support a difendere ).","replies":[]}]}]}]}