{"poster":"PrometheusLD","date":"2016-11-09T11:11:03.876+0000","title":"An open letter to Riot","subforum":"Player Behaviour","up_votes":2,"down_votes":3,"body":"Your server is toxic, this is simple reality. Leaving aside the general inability/unwillingness of Riot as an organisation to deal with this it is exacerbated in OCE by the lack of a normal draft queue. If we want to play rift we&#039;re left with ranked (toxic because people care far too much about the results) or blind pick (toxic because people spend all of champ select fighting over what role they&#039;re going to play). Also neither mode is suitable for playing anything you haven&#039;t played before (in ranked it&#039;s inconsiderate and blind normals are unplayable period).\r\n\r\nI have tolerated this for as long as I have because I believed things might get better. Having now seen you close the door on draft normals (a decision you deliberately declined to mention on the OCE page) the time has come for my own decision to be made.\r\n\r\nStaying means not only accepting the status quo but the inevitable result that I will become as toxic as the others who populate this place. I won&#039;t pay to get my account back on NA because that would reward you for fooling me into leaving it in the first place and from the way I read your comments it&#039;s only a matter of time until it&#039;s gone from there too.\r\n\r\nTherefore I am leaving. The environment you clearly want, I cannot accept. This is not negotiation or ultimatum. Leaving simply has no consequence if you don&#039;t know why.\r\n\r\nGoodbye.","replies":[{"poster":"Roguestoney","date":"2016-11-09T11:25:43.586+0000","up_votes":6,"down_votes":0,"body":"Cya next week ( ͡° ͜ʖ ͡°)","replies":[]},{"poster":"LUPIN lll","date":"2016-11-10T11:59:52.068+0000","up_votes":2,"down_votes":0,"body":"hlep my fniger stuck in a cang and I can't et it out waht do I DO!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!??????????????????","replies":[]},{"poster":"nochillgamer","date":"2016-11-22T12:18:43.041+0000","up_votes":1,"down_votes":0,"body":"Or you could've just muted...","replies":[]},{"poster":"Tomo7182","date":"2016-11-10T10:29:26.541+0000","up_votes":1,"down_votes":0,"body":"This is exactly why i'm moving to the Japanese server, I get decent ping and I don't have to worry about toxicity because I wouldn't understand anything said in chat","replies":[]},{"poster":"Soulless Reaper","date":"2016-11-09T22:18:39.819+0000","up_votes":1,"down_votes":0,"body":"Riot does somewhat leave us in the dark on most things, I agree on that statement by Evirtua. But they do care about us. The Riot staff that are on the boards are quite busy. They try their best to make OCE as fun as they can. They can't do anything about the toxicity on the servers, it's not an easy switch of the button cause it's not a couple players, it's majority.","replies":[]},{"poster":"Chalze","date":"2016-11-09T21:16:28.414+0000","up_votes":1,"down_votes":0,"body":"It's funny cuz, the simple truth is, is that no one (not even Riot) actually takes the Oceanic server seriously. If you take us too seriously then you're gonna kick yourself out eventually, but as Roguestoney said.........cya nxt week bruh","replies":[]}]}