{"poster":"saltyforyou","date":"2017-08-03T17:42:12.513+0000","title":"Rito","subforum":"Allgemeiner Chat","up_votes":1,"down_votes":2,"body":"gut gemacht Riot \r\nwie war das wir wollen keine Leute in dem spiel die leaven oder trollen.\r\nUnd ich habe einfach in jedem Game leaver oder Leute die meinen zu Trollen echt gut gemacht macht das spiel noch kaputter als es eh schon ist so langsam macht es einfach keinen Spa&szlig; mehr zu spielen wegen solchen Leuten","replies":[{"poster":"Kartoffelking983","date":"2017-08-03T17:54:58.928+0000","up_votes":1,"down_votes":0,"body":"und ich habe keinen bock mit toxic playern wie dir zu spielen :D","replies":[{"poster":"saltyforyou","date":"2017-08-03T19:13:00.100+0000","up_votes":2,"down_votes":1,"body":"vilt sind die meisten auch so toxic weil man immer wieder troller und so dabei hat da mal drüber nachgedacht ?","replies":[{"poster":"sN00Bdogg","date":"2017-08-04T12:32:20.796+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=saltyforyou,realm=EUW,application-id=YnZkMR0R,discussion-id=Gn5mHqcu,comment-id=00000000,timestamp=2017-08-03T19:13:00.100+0000)\n>\n> vilt sind die meisten auch so toxic weil man immer wieder troller und so dabei hat da mal drüber nachgedacht ?\n\nJa. Hab das auch so empfunden/erlebt. Mittlerweile gehe ich fast nur mit premades in Spiele, aber falls ich doch mal solo zocke, dann mute ich meist alle. Vor allem dann, wenn das SPiel vorher kacke war. DANN ERST RECHT!  Denn dann reicht oft ein kleiner Anlass, um gleich wieder zu tilten.\n\nAlso ... Kurzfassung:   /mute all","replies":[]},{"poster":"Homunculi","date":"2017-08-04T06:32:16.359+0000","up_votes":1,"down_votes":0,"body":"Was war zuerst da? Flamer oder Trolle?\n\nEs kommt auch auf die Definition von Troll an, für die einen ist es da iwas für den anderen etwas mehr davon und für den nächsten zählt was komplett anderes als trolling. \n\nEin Rat von mir, werde bei echten Trollen nicht ausfällig, sowas freut die dann nur noch mehr.\n\nEs ist auch weniger RIOTs Schuld, es sind die Spieler die es kaputt machen.","replies":[]},{"poster":"Kartoffelking983","date":"2017-08-03T19:14:48.275+0000","up_votes":1,"down_votes":5,"body":"vllt sind die meisten ja troller wegen flamern?\nschau mein letztes veigar game hab da absichtig getrollt weil der jungler und toplaner von minute eins an nur geflamet haben ^^","replies":[{"poster":"GOTV2","date":"2017-08-03T23:35:09.503+0000","up_votes":1,"down_votes":0,"body":"erbärmlich","replies":[]}]}]}]},{"poster":"Kind Prow","date":"2017-08-04T14:39:31.261+0000","up_votes":1,"down_votes":0,"body":"Trolls... man zählt ja schon als Troll, wenn man dem suicide Bomber namens Nasus nicht ins Verderben hinterherrennt. Also bitte, versuch nachzudenken ^^\n\nEin troll macht absichtlich Dinge anders oder falsch, um andern dadurch ne reaktion abzuringen, im häufigsten Falle Wut. Dies hier sind keine Trolle: nicht gankender Jungler, Gecampter Midlaner, versagende Botlane oder Toplaner, der sein tp nicht für das Team nutzt. :>","replies":[]},{"poster":"Maexle","date":"2017-08-03T22:49:18.329+0000","up_votes":1,"down_votes":0,"body":"Dann lass es doch einfach... Niemand zwingt dich.\nWenn du Hilfe brauchst von LoL loszukommen, dann hilft dir vielleicht eine Suchtberatung.","replies":[]},{"poster":"CptPICHU","date":"2017-08-03T18:06:48.925+0000","up_votes":1,"down_votes":0,"body":"Wenn du eine angenehme Spielatmosphäre aufbaust, wirst du mehr Erfolg haben. Ziehe Teammates nicht runter, hilf ihnen und\nhaltet als Team zusammen. Stärke den Teamgeist, dann wird sowas nicht vorkommen. Wenn jemand trollt, ist das echt nicht schön das ist klar.\nVersuche bei sowas einfach die Championauswahl zu verlassen. Sowas kommt leider vor, das muss jeder mal ertragen.\nGehe mit mehr motivation und vielleicht mit Premades ins Spiel. Dann macht es viel mehr Spaß glaub mir.\n\nHoffe ich konnte helfen, immer gerne.\n-MfG SRB Toad {{champion:117}}","replies":[]}]}