{"poster":"Oriius","date":"2017-11-02T21:31:57.240+0000","title":"DoomBots, der wahre Ort für Trolls?","subforum":"Karten & Spielmodi","up_votes":1,"down_votes":1,"body":"Jetzt wo ich wieder mehrere Runden Doom Bots gespielt habe muss ich einfach meinen Salz ablassen bevor ichs im Game tue .\r\n\r\nIch bekomme mehr und mehr das Gef&uuml;hl das DoomBots wirklich nur ein Spielmodi ist der die Troller von den Normals/rankeds weglocken soll und in die SMR holt. Man kann von 20 Runden mit etwas viel Gl&uuml;ck (vergleichbar mit 4 richtige im Lotto h&ouml;h&ouml; weil 4 und man selber = 5 und 5 = Team usw kapisch?!)  1 oder vllt ganz ganz ganz ganz selten mal 2 Runden wirklich diesen Spielmodus angenehm spielen. Ansonsten besteht dieser Spielmode aus durchschnittlich 2 afks mal 2 mal einer mal trollen 2-3 Leute und dann noch die ganzen first time&acute;s dazwischen (das ist ja noch ok) . wieso ist Doom bots (lvl 100) ohne 5er premades einfach nahezu unm&ouml;glich spielbar. Da hat man sich beim Star Guardian mode echt wohlgef&uuml;hlt trotz der mageren Abwechslung was Champs angeht.\r\n\r\n Vielleicht sollte man die PvE Modis echt mehr ausarbeiten also nicht falsch verstehen beide Modis waren unglaublich beliebt bei der Community und ich glaube darauf sollte man weiterhin aufbauen. Der Star Guardian Modus mit weiteren schwierigkeitsgraden  und mehr Champm&ouml;glichkeiten w&auml;re echt wahnsinn oder Doom Bots spielen mit einem gr&ouml;&szlig;erem M&ouml;glichen Championpool (was aufgrund der Doom bots nunmal nicht geht da man selbst auf Fulltank oneshot ist) so das man vielleicht Kayn beispielsweise spielen k&ouml;nnte etc. Also vorallem mehr liebe f&uuml;r Nahk&auml;mpfer.\r\n\r\nWenigstens gehen Doom bot Runden maximal 15 Minuten sonst w&auml;re dieses ewige Afk ne Qual :3","replies":[{"poster":"Kiimahrii","date":"2017-11-03T00:54:43.103+0000","up_votes":1,"down_votes":0,"body":"Naja, ich verstehe zwar was du auf eine komplizierte Art und Weise uns mitteilen willst, aber ich kann dir nicht ganz zustimmen.\n\nBeim einfachen Modus funktionieren deutlich mehr Spielmöglichkeiten als beim schweren Modus. Ich denke die Community versteht nicht das obwohl man die AI der Bots ziemlich austricksen kann viele Strategien einfach aufgrund der hohen gepushten Werte wie die HP beim schweren Modus nicht funktionieren. Des Weiteren sehen sie einfach schöne Sachen auf Youtube Videos und Tipps, die sie dann versuchen ohne genügende Information im schweren Modus umzusetzen. Für Stufe 100 muss jeder Spieler haargenau wissen welche Champions man nehmen **muss**, wann man rotieren **muss**, wann ein Tradekill es tatsächlich Wert ist. Die meisten legen sich mit der AI im 100r Modus einfach nicht genug auseinander, als das man eine Chance hätte. Mit Randoms ist es deshalb tatsächlich unwahrscheinlich, aber nicht unmöglich. Ich persönlich habe mehrere Siege über Lv100 **ohne **Premates.","replies":[{"poster":"FABOBABO","date":"2017-11-03T21:15:02.218+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Kiimahrii,realm=EUW,application-id=cGRapXds,discussion-id=HqyAB5OX,comment-id=0000,timestamp=2017-11-03T00:54:43.103+0000)\n>\n> Naja, ich verstehe zwar was du auf eine komplizierte Art und Weise uns mitteilen willst, aber ich kann dir nicht ganz zustimmen.\n> \n> Beim einfachen Modus funktionieren deutlich mehr Spielmöglichkeiten als beim schweren Modus. Ich denke die Community versteht nicht das obwohl man die AI der Bots ziemlich austricksen kann viele Strategien einfach aufgrund der hohen gepushten Werte wie die HP beim schweren Modus nicht funktionieren. Des Weiteren sehen sie einfach schöne Sachen auf Youtube Videos und Tipps, die sie dann versuchen ohne genügende Information im schweren Modus umzusetzen. Für Stufe 100 muss jeder Spieler haargenau wissen welche Champions man nehmen **muss**, wann man rotieren **muss**, wann ein Tradekill es tatsächlich Wert ist. Die meisten legen sich mit der AI im 100r Modus einfach nicht genug auseinander, als das man eine Chance hätte. Mit Randoms ist es deshalb tatsächlich unwahrscheinlich, aber nicht unmöglich. Ich persönlich habe mehrere Siege über Lv100 **ohne **Premates.\n\nEs ist zwar möglich, aber es langt schon wenn einer keine Ahnung hat was er macht und man somit keine Chance hat. Das ist sehr frustrierend...","replies":[]}]},{"poster":"Abasin","date":"2017-11-03T07:26:00.300+0000","up_votes":1,"down_votes":0,"body":"Der Modus, die Modi. {{sticker:slayer-jinx-wink}} \n\nAnsonsten, Doom Bots sind nicht mein Fall. Dann lieber Aufstieg, ARURF, Poroking oder Bloodmoon.","replies":[]}]}