{"poster":"Oriius","date":"2017-08-24T03:57:49.415+0000","title":"Honorkapseln","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":9,"body":"Immernoch ein bestehendes Thema.\r\n\r\nW&auml;hrend andere bereits 5 Kapseln oder wat wei&szlig; ich bekommen haben f&uuml;hlen sich nat&uuml;rlich immer h&auml;ufiger die Leute die noch keine hatten ein wenig frustriert.\r\n\r\nIch pers&ouml;nlich w&uuml;rde mich schon gelegentlich &uuml;ber nen gratis Skin freuen weil es f&uuml;r mich ne Besonderheit ist da ich nicht so viel Geld zum investieren hab und muss mich ziemlich &auml;rgern das ich trotz Honorlvl 4 immernoch nichts bekommen hab au&szlig;er ein paar magere Schl&uuml;sselfragmente^^\r\n\r\nUnd ich denke einigen anderen geht es genauso . Nat&uuml;rlich ist es geschenkt und nem geschenkten Gaul schaut man nicht ins Maul aber ich finde diese Art &quot;Ungerechtigkeit&quot; sollte vielleicht mal ausgeglichen werden damit vielleicht jeder mal n K&auml;pselchen &ouml;ffnen darf. Vor einer Stunde erstwieder Belohnung gekriegt und wieder nur n Schl&uuml;sselfragment :3\r\n\r\nFrage mich ob dieses Ehrungslvl ged&ouml;ns auf diese Art &uuml;berhaupt irgendwie ansporn haben soll aufzusteigen wenn man eh nichts bekommt daher mal vielleicht versuchen damit was zu erreichen","replies":[{"poster":"Azima","date":"2017-08-24T07:34:48.922+0000","up_votes":3,"down_votes":0,"body":"Hab mich letzte Woche auch minimal etwas geärgert, dass ich noch keine Kapseln bekommen habe.\nDann hab ich mehr oder weniger damit abgeschlossen - es vergessen. Naja, komm halt in der Woche auch nicht mehr zum LoL spielen und es lief dann nach dem Prinzip \"Aus den Augen, aus dem Sinn\". Kurz vor dem schlafen gehen logge ich immer nochmal für 10 Minütchen ein oder so \\ö/ und was soll ich sagen - ich hätte auch nicht damit gerechnet zwei Kapseln zu bekommen, obwohl ich seit fünf Tagen nichts mehr sinnvolles getan habe.\n\nPassiert halt. Irgendwann. Vielleicht - vielleicht auch nicht :')\n\nWas den gratis Skin angeht, kannst du doch auch Kisten farmen? Wenn du \"so viele\" Schlüsselfragmente bekommst.\n\nDie Kapseln, Fragmente usw. machen mich auch eher weniger an D: aber die Flairs! Diese verdammten Flairs! Das ist das beste an der ganzen Sache ^^","replies":[{"poster":"Fresh Dumbeldore","date":"2017-08-24T09:25:06.348+0000","up_votes":2,"down_votes":0,"body":"> aber die Flairs! Diese verdammten Flairs!\n\nTeam Flair wird aus der ganzen Welt einen schöneren Ort für Mensch wie auch Pokèmon machen.\n\nedit: und sie sehen auch verdammt gut aus :P","replies":[{"poster":"Azima","date":"2017-08-24T09:40:47.310+0000","up_votes":1,"down_votes":0,"body":"ABER auf Pokemon bezogen war das doch \"Team Flare\" - nicht \"Team Flair\"\n\nFür einen kurzen Moment hast du mich aus der Bahn geworfen! Ich sehe das als eine Art Test an. Einen \"WieLeichtLässtSichJemandVerwirren\"-Test. Du Schurke :o","replies":[{"poster":"Fresh Dumbeldore","date":"2017-08-24T09:43:42.832+0000","up_votes":1,"down_votes":0,"body":"Da hat wohl einer Edition Y gespielt ;)\n\nIch habe absichtlich Flair geschrieben, da du es so geschrieben hast, es aber genau gleich ausgesprochen wird wie Flare","replies":[{"poster":"Azima","date":"2017-08-24T09:52:53.230+0000","up_votes":1,"down_votes":0,"body":"Von Pokemon Blau bis zur aktuellen Version, aber fast keine \"Special Edition\" oder doppelte Ausführungen, ja. Pokemon begleitet mich seit einer Ewigkeit ^^\n\nUnd... ich glaube dir kein Wort D: Ich bin äußerst misstrauisch","replies":[{"poster":"Fresh Dumbeldore","date":"2017-08-24T11:28:56.756+0000","up_votes":1,"down_votes":0,"body":"Was habe ich denn jemals gemacht dass du mir so misstraust? \n\n{{sticker:slayer-jinx-wink}}","replies":[{"poster":"Azima","date":"2017-08-24T12:28:59.171+0000","up_votes":1,"down_votes":0,"body":"._. Ich weiß nicht. Weibliche Eichhörnchen Intuition? >.<","replies":[{"poster":"Fresh Dumbeldore","date":"2017-08-24T12:50:08.094+0000","up_votes":1,"down_votes":0,"body":"Gut zu wissen, dass sich weibliche Eichhörnchen auf dem Forum rumtreiben\n\n{{sticker:slayer-jinx-wink}}","replies":[{"poster":"Azima","date":"2017-08-24T12:57:05.765+0000","up_votes":1,"down_votes":0,"body":"._. Wenn du wüsstest, was sich hier so alles in den Ecken finden lässt ... faszinierend.","replies":[]}]}]}]}]}]}]}]}]},{"poster":"Humpelstilzche","date":"2017-08-24T05:31:36.950+0000","up_votes":3,"down_votes":0,"body":"> Während andere bereits 5 Kapseln oder wat weiß ich bekommen haben\n\nDie absolute Mehrheit der Spieler hat bisher irgendwas zwischen 0 und 2 Kapseln bekommen. \n\n> Ich persönlich würde mich schon gelegentlich über nen gratis Skin freuen \n\nDann sind die Kapseln nichts für dich, denn da sind Champion Shards drin, keine Skin Shards. Lediglich der Twitch Skin und Warwick Skin können in Kapseln drin sein, allerding auch nur mit extrem geringer Wahrscheinlichkeit.","replies":[{"poster":"dugg","date":"2017-08-24T05:41:28.642+0000","up_votes":3,"down_votes":0,"body":"Ist halt ein reines System, was auf dem Zufall basiert. Der eine bekommt mehr, der andere weniger.\n\nIch habe bisher drei Kapseln bekommen und gestern:\n\n>Lediglich der Twitch Skin und Warwick Skin können in Kapseln drin sein, allerding auch nur mit extrem geringer Wahrscheinlichkeit.\n\nWar sogar der Twitch Skin drin. Fortuna war mir einfach hold.\n\nIch sage das nicht um anzugeben, sondern um dir zu zeigen, dass es absoluter Zufall ist. Ich empfinde diese ganzen Honor Sachen eh als Nice-to-have. Wenn man etwas bekommt, dann freue ich mich und wenn ich nichts bekomme, ist mir das egal. Es ist schlichtweg ein Bonus.","replies":[{"poster":"CYPHΕR","date":"2017-08-25T06:53:51.705+0000","up_votes":1,"down_votes":0,"body":"Es ist halt wie mit dem Loot-System. Es wird viel zu schnell als Selbstverständlichkeit hingenommen, dass man permanent RP-Content geschenkt bekommt...","replies":[]}]}]},{"poster":"Abasin","date":"2017-08-24T06:00:42.027+0000","up_votes":2,"down_votes":0,"body":"Dann hast Du halt keine. Ich übrigens auch nicht, obwohl HL4. Wenn ich eine kriege, freue ich mich. Wenn nicht, geht die Welt auch nicht unter. Ich hab auch noch nie eine Meldung bekommen, dass einer meiner Reports zu einem Bann geführt hat. Ich fühle mich trotzdem nicht schlechter.\n\nEdit 25.8.2017: Erste Kapsel eingetroffen, 2 Schlüsselfragmente und eine Championshard Nunu drin gewesen. Nunu gleich geschreddert, jetzt fehlen noch 10 blaue Fragmente für Velkoz. :)","replies":[]}]}