{"poster":"Thunder Tóxico","date":"2017-09-03T04:14:04.007+0000","title":"No me gusto para nada.","subforum":"Charlas Generales","up_votes":2,"down_votes":1,"body":"Nivel 1-100\r\nLo unico que me gusto fue la parte en las maestrias / runas claro, no me molesto en absoluto pero el cambio de niveles?\r\nSinceramente esto ya no es league of legends, losiento a los que les gusto la idea de los mismos, aun asi solo queria contar mi peque&ntilde;a opinion &#039;&#039;en un mar de peque&ntilde;as opiniones como la mia&#039;&#039;","replies":[{"poster":"Mergueler","date":"2017-09-03T15:07:22.300+0000","up_votes":1,"down_votes":0,"body":"Es como si empezáramos con: \"Loco, paren de agregar campeones.... Cambian las cosas y esto ya no es lo que era antes\"","replies":[{"poster":"Thunder Tóxico","date":"2017-09-03T16:02:02.955+0000","up_votes":1,"down_votes":0,"body":"Ese no es el problema el problema es que estan rompiendo el juego, nadie esta pidiendo que no saquen campeones solo que no suban el limite de nivel.","replies":[{"poster":"Hayato","date":"2017-09-04T21:51:19.693+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Wizard King,realm=LAS,application-id=v7qsfXsE,discussion-id=k5Wmkk2e,comment-id=00010000,timestamp=2017-09-03T16:02:02.955+0000)\n>\n> Ese no es el problema el problema es que estan rompiendo el juego, nadie esta pidiendo que no saquen campeones solo que no suban el limite de nivel.\n\nPero como subir niveles rompe el juego? en que te afecta? Sinceramente no entiendo porque tanta mariconeada con estos cambios, que el PI, que los niveles, que las runas...","replies":[]},{"poster":"Mergueler","date":"2017-09-04T20:45:47.876+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Wizard King,realm=LAS,application-id=v7qsfXsE,discussion-id=k5Wmkk2e,comment-id=00010000,timestamp=2017-09-03T16:02:02.955+0000)\n>\n> Ese no es el problema el problema es que estan rompiendo el juego, nadie esta pidiendo que no saquen campeones solo que no suban el limite de nivel.\n\nObviamente que no se está pidiendo que dejen de sacar campeones Wizard King ... Era un ejemplo llevado al extremo .... \n\nEs como que cualquier cambio fuera a \"romper el juego\" cuando en realidad puede ampliarlo y convertirlo en otra cosa, mucho mejor de lo que hoy es. Si llevás al extremo la necesidad de que el juego no cambie para que quede como lo conociste terminás viendo cualquier cambio como una amenaza... incluida la inclusión de nuevos campeones ... \n\nTe comento que vengo jugando desde la S01 y el juego es muuuuuuy diferente a lo que era en ese entonces... Pero siempre se las han arreglado para mantener el corazón del mismo (eso que lo hace único entre los demás juegos del mismo tipo) y agregarle variantes que lo mantienen en el tope.\n\nSi fuera por como ves las cosas, creo que no se hubiera cambiado nada desde la S03 y no estaríamos disfrutando de cosas que hoy defendés como imprescindibles ...","replies":[]}]}]},{"poster":"Rengor","date":"2017-09-04T21:09:27.007+0000","up_votes":1,"down_votes":0,"body":"no entiendo porque lloran tanto, si lo unico que importa son las rankeds, los bronces van a seguir siendo bronce y los pro van a seguir siendo toxicos, el ciclo de la vida y la muerte continua...","replies":[]},{"poster":"Mergueler","date":"2017-09-03T04:26:08.231+0000","up_votes":1,"down_votes":0,"body":"¿Y cuál sería el problema de 100 niveles en relación con sólo 30?","replies":[{"poster":"Thunder Tóxico","date":"2017-09-03T04:56:16.065+0000","up_votes":1,"down_votes":0,"body":"Que es una paja, estar tanto tiempo jugando lol para que cambien los niveles y todo lo que conociamos como ''LoL'' y todo esto solo por intentar cambiar recompensas que posiblemente a nadie le gusten.","replies":[{"poster":"GT es canon","date":"2017-09-03T05:48:46.308+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Wizard King,realm=LAS,application-id=v7qsfXsE,discussion-id=k5Wmkk2e,comment-id=00000000,timestamp=2017-09-03T04:56:16.065+0000)\n>\n> Que es una paja, estar tanto tiempo jugando lol para que cambien los niveles y todo lo que conociamos como &#x27;&#x27;LoL&#x27;&#x27; y todo esto solo por intentar cambiar recompensas que posiblemente a nadie le gusten.\n\nJugaste todo este tiempo para ser nive 30?\nNo cambian los requisitos para ranked ni nada, solo buscaron una manera de dar recompensas por jugar sin agregar mas cosas al perfil, no entiendo porque reclaman con el \"ya no LoL\", si es por eso, cada pretemporada tenemos juego nuevo ya que cambian lo que si es relevante al LoL","replies":[]},{"poster":"FenRoss","date":"2017-09-03T05:23:12.246+0000","up_votes":1,"down_votes":0,"body":"Los niveles por lo que tengo entendido y se mostro van a ser infinitos (seguramente tipo 200 o 300 frene) por que la imagen muestra lv 100 pero acumulando xp para mas lv","replies":[]}]}]}]}