{"poster":"high quality elo","date":"2017-01-15T13:01:32.876+0000","title":"Ilyenekkel mit lehet kezdeni...?","up_votes":4,"down_votes":1,"body":"A nevet nem sz&iacute;vesen takarom ki, h&aacute;tha p&aacute;r ember hozz&aacute;adn&aacute; a letiltottakhoz, de most itt x-el jel&ouml;l&ouml;m.\r\nBel&eacute;pt&uuml;nk a lobbyba &eacute;s ez fogadott:\r\nx: hey everyone. this game is full of %%%%%%ed junglers who never gank or take drake, noob top laners who are always solo or feed so im gonna troll this game and make u all suffer\r\nx : have fun stupid %%%%%%ed useless cancer kids\r\nx : :*\r\nx : ez u gonna suffer im letting u know\r\nx : u will miss cs cuz of me and im never gonna help u\r\nx : suffer trash kids\r\n\r\nŐszint&eacute;n, ilyenkor mi j&aacute;tsz&oacute;dik le az emberek fej&eacute;ben, mit kellett volna nek&uuml;nk csin&aacute;lni hogy az alany lenyugodjon? Semmit nem sz&oacute;ltunk hozz&aacute; egyk&eacute;bk&eacute;nt a lobbyba.","replies":[{"poster":"ptlg225","date":"2017-01-15T16:47:54.207+0000","title":null,"up_votes":4,"down_votes":0,"body":"Hát nem írhatok nevet, de lehet az én elöző ranked meccsemből volt az a tírpák bot duo. Megyek supportnak erre a toppos kér, hogy cseréljünk mert promozik az adcvel jó fej vagyok és engedek neki, de előre beírom hogy support main vagyok. Már reflexből is bannolom yasuot ezután beírja, hogy ők yasou+malphite-t nyomnak mert az elöző 6 ranedot nyerték vele erre aztán elkezd flamelni. Oké választjuk a hősöket én előre beírom, hogy Heimerdingerrel megyek erre írkálják chatbe a GAREN-t. Beírom nekik hogy nem játszottam Garent még 2 meccsen se, erre elkezdik tele spammalni 100-szor a chatet a GARENnel, milyen bronz noob vagyok meg instant veszteni fogunk hála nekem és stb hülyeségek. De most komolyan sokkal jobban jártak volna ha most viszem a hőst először, az ő topposuk utánam válsztott és persze egy jó counter champet Shent. A legjobb csak ez után jön, a paraszt meg a haverja gold+silver volt, én meg mint mindenki más nem születtem 1 meccs utáni Challengernek (bronz2), persze még felse értem topra már flamert noob bronz idiot heimer ....stbstb. Azt elismerem jól játszott, lehozta nekünk a meccset, de azért mégse kellett volna egész idő alatt a support main toppost baszogatni az első halálért, főleg ha már át is adtam a helyem a boton haverjának.","replies":[{"poster":"high quality elo","date":"2017-01-15T18:49:12.596+0000","title":null,"up_votes":2,"down_votes":0,"body":"Én az ilyeneket reflexből muteolom, elég sok gyerkőc játssza ezt a játékot akiket nem tanítottak normális beszédre és tiszteletre, és sajnos az ilyenekből rengeteg van...","replies":[]}]},{"poster":"Open Gold chest","date":"2017-01-15T13:05:20.805+0000","title":null,"up_votes":2,"down_votes":0,"body":"Kilépsz .. max kapsz 5 percet és vesztesz 3-4lp-t , vagy végig szenveded vele lehet az 50 percet és vesztesz 20-30lpt :D  ennyit tudok tanácsolni!","replies":[]},{"poster":"Vérontó","date":"2017-01-15T20:12:35.021+0000","title":null,"up_votes":1,"down_votes":0,"body":"Előző meccsben ez történt vele, tilted lett és ezt rajtatok akarta levezetni. Sok a hülye ember. Annyit lehet tenni, hogy javasold neki ha tilted akkor játsszon más játékkal ne lolozzon. Ha meg tényleg trollkodik akkor report.","replies":[]},{"poster":"Nemin","date":"2017-01-15T18:45:57.510+0000","title":null,"up_votes":1,"down_votes":0,"body":"Helyesen tetted, hogy nem írtad ki a nevét, különben ki kellett volna törölnünk a témát.\nA szabályzat (link lent) tiltja mások megnevezését.\n\n---\n\"A szakmám?\" \"Most hogy belegondolok, igazából mindig is Ezermester akartam lenni.\" \"Igen, Ezermester.\"\n\nLinkek amik segíthetnek eligazodni:\n[[GYIK és Szabályzat]](http://boards.eune.leagueoflegends.com/hu/c/altalanos-beszelgetes/0krXUB6R-a-farumok-szabaalyzata-aos-gyik) [[Technikai segítség]](https://support.riotgames.com/hc/hu) [[Fórumos Addonok]](http://boards.eune.leagueoflegends.com/hu/c/minden-egyeb/AehaAUjI-nemin-addonjainak-listaaja) [[Fórumos Discord Szerver]](https://discord.gg/M28bRuX)","replies":[]},{"poster":"Sylasi Elvtárs","date":"2017-01-15T17:30:30.342+0000","title":null,"up_votes":1,"down_votes":0,"body":"Dodge.","replies":[]}]}