{"poster":"Fortín de Villal","date":"2017-10-03T03:11:55.918+0000","title":"Consulta: Dota 2, ¿sus requerimientos técnicos son similares al Lol?","subforum":"Off-topic y temas personales","up_votes":4,"down_votes":4,"body":"Para hacerlo más simple: \r\n1. es free como el lol?\r\n2. Si mi pc corre el Lol, correrá Dota 2?\r\ny\r\n3. ¿qué tal es este moba? si tuviéramos q compararlo c Lol, por ejemplo","replies":[{"poster":"Mioen","date":"2017-10-03T03:37:12.238+0000","up_votes":1,"down_votes":0,"body":"Juego a 120 el lol. 30 FPS al DOTA 2 en low, igual no es un queja gráficamente está más pulido.\n\nRespecto al DOTA2 como Moba, te exije mucho más como jugador. Por lo general los errores suelen ser más impactantes en la partida. Juego que castiga duro a los novatos. (Yo)\n\nPero es divertido y tenés mecánicas que en el lol no Existen.\n\nEl vuelo del Phoenix.\nLos Meepos.\nRubik. Copiando habilidades de otros.\nIntolerancia con su kit de múltiples spells.\n\nDivertido. Mucha variedad y entretenimiento.","replies":[{"poster":"ZanahoriaAsesina","date":"2017-10-03T04:11:41.486+0000","up_votes":1,"down_votes":0,"body":"Es mucho más complejo que el lol, verdad?","replies":[{"poster":"Mioen","date":"2017-10-03T13:39:17.342+0000","up_votes":1,"down_votes":0,"body":"Algunos heroes.\n\nEn si la mayoria tienen mecanicas muy distintas a la del lol, aun asi existen heroes que son bastante faciles de aprender para empezar.\nAlgo hermoso es que tienen una categoria de Support carry y son lo mas.\n\n>Axe.(Tank)\nLina.(Support Carry)\nTrent Protector.(Tank/Support)\nDrow ranger.(Range Fisico)\nSniper(Range Fisico)\nPhoenix.(Support/Tank/Carry)\nZeus.(Mage support)\nSven.(Melle/Carry)\nPA.\nRazor.\nCrystal Maiden(Support/Mage/Jungle)\n\nEn si hay muchos mas que tienen una mecanica sencilla y con la cual no te sentis muy distanciado del lol. Personalmente no juego mucho Dota2, cada vez que juego alli es para practicar Last Hit o para pasar el rato.\n\nEl tema de exijir al jugador va mas por el lado de la itemizacion,composicion y ubicaciones en el mapa. Los items son otro factor, en el lol por lo general los item son pasivos (Te dan los stats o beneficios de manera inmediata), en el dota la mayoria de los items son activos y se tiene que elegir el momento adecuado.\n\n>Sumandole a todo esto tenemos los hermosos item que son dropeables. (Divine 330 DE DAMAGE XD, pero si moris existe el riesgo de que el enemigo lo tome y GG.)\n\nOtro cosa que quizas interese es el como funciona la visión en este juego. La cosa va asi, solo se puede comprar una cantidad determinada de centinelas al igual que el lol, pero la tienda no vende centinela al resto del equipo una vez agotado el stock de la misma.\nO sea que si un loco se planta a poner wards por una sola parte del mapa y agota todos los de la tienda, otros no podran comprar wards, así que uno tiene que ser cuidadoso.\n\nSin contar la altura en la que se ubica el Ward o la posicion, puede dar menos o mas visión para el equipo.\n\n>Personamente algunos que me parecen divertidos son...\nCrystal Maiden\nhttps://www.youtube.com/watch?v=kdeeB3vJcDY\nLina(Battle Lina papa, que support)\nhttps://www.youtube.com/watch?v=4T1xGekt7_g\nWindranger\nhttps://www.youtube.com/watch?v=YNPW1jAp5V8\nPhoenix\nhttps://www.youtube.com/watch?v=EdWDlSkbh7M\n\n\nY si hablamos de Lore, el de DotA 2 ha estado mas trabajado desde hace mucho. Y muchas de las historias son excelentes, sin contar que los aspectos de cada heroes son parte del Lore del mismo o por lo menos representan algo del Lore.\nNo sigo mucho el Lore de Dota2 pero tenes canales que cuenta el lore de cada heroe.\n\nPersonaje preferido, de una Crystal Maiden(Rylai)\nhttp://1.bp.blogspot.com/-5aIv-kczRn8/VNsC55eXoqI/AAAAAAAAClo/wPEb1xWdvJs/s1600/2093%2Ba.png","replies":[{"poster":"ZanahoriaAsesina","date":"2017-10-04T15:32:04.097+0000","up_votes":1,"down_votes":0,"body":"Sos tremendo, muchísimas gracias.\n\nMe gusta eso de la visión limitada y la variedad de roles y posiciones.","replies":[{"poster":"Mioen","date":"2017-10-04T16:28:59.591+0000","up_votes":1,"down_votes":0,"body":"Si lo soy, se que soy tremendo.\n\nAH RE.\n\nDe nada viejo, del Dota por lo general me gustan las cosas que hacen su comunidad.(Videos/FanArts/Sketchs/cortos/animaciones)","replies":[]}]}]}]}]},{"poster":"Grosero","date":"2017-10-03T03:21:54.470+0000","up_votes":1,"down_votes":0,"body":"No, el dota2 pide un poco más. Si el lol te corre a 100 fps con todo al máximo el dota2 te va a funcionar fluido en bajo/medio\n\nA mí no me gusta el dota, encuentro toscas las animaciones de los personajes, desde los básicos hasta el movimiento","replies":[{"poster":"Fortín de Villal","date":"2017-10-03T03:27:47.498+0000","up_votes":1,"down_votes":0,"body":"uff, con mis bajadas naturales de fps de 30 pa abajo se me hace que el dota literalmente se haria injugable, jaja, gracias por el dato","replies":[]}]},{"poster":"Hell Darking","date":"2017-10-03T03:23:46.873+0000","up_votes":1,"down_votes":0,"body":"1.- si es free como lol\n2.- no, pide mas recursos para funcionar bien (una tf de dota es mucho mas \"movida\" que una de lol, por eso mas recursos, ademas de las animaciones y cosas)\n3.-  dota es mucho mas complicado que lol, tiene mas ciclos, rutas, campeones con skills (si hay similitudes, pero eso dejo de ser asi hace tiempo)\n\nsi quieres ir a dota, busca a alguien que te enseñe (que sepa arto)","replies":[]}]}