{"poster":"do not ping me","date":"2017-11-14T00:39:56.363+0000","title":"De 140 FPS constantes en alto a 30fps con todo en bajo","subforum":"Problemas Técnicos","up_votes":25,"down_votes":0,"body":"La verdad es que ya varios postearon esto, pero vine a dejar constancia tambien de forma un poco mas detallada de lo que al menos a mi me sucede.\r\nAl inicio de la partida empiezo con 80FPS.\r\nMin 5 de la partida ya tengo 60FPS.\r\nMin 15 de la partida tengo 50 FPS.(A&uacute;n no empiezan las TFs)\r\nMin 15~20 cuando ya hay  TFS 5 vs 5 me da 30 FPS.\r\nMin 25 sin que haya TFS tengo 30 FPS.\r\nMin 30+ 30 FPS siempre, cuando hay TF bajan a 12FPS y si le a&ntilde;adimos baron, no se reproduce ni el sonido de la TF.\r\nEso, ojal&aacute; puedan solucionar lo antes posible, ya converse por correo con Oogman y se sabe que est&aacute;n trabajando en ello. \r\nSuerte!!!{{champion:77}} {{sticker:sg-zephyr}}","replies":[{"poster":"Oyarzún","date":"2017-11-14T01:14:09.566+0000","up_votes":1,"down_votes":0,"body":"No he leído ninguna aclaración de riot sobre le problema y tengo el mismo error, he mandado tickets, y me dicen que ya conocen el problema y que estarían trabajando en ello, que les costará un tiempo. Pero bueno ojalá así sea, y no lo dejen así, porque es desagradable jugar a 15FPS en tf \npor ahora, solo queda esperar...\n\n{{item:3151}} \n\nsaludos","replies":[{"poster":"ElectricViolet","date":"2017-11-14T06:39:33.985+0000","up_votes":2,"down_votes":0,"body":"¿15?\nTenés suerte, yo juego a 04 fps en las tf y no por tener una tostadora, sino porque el juego está pésimamente optimizado.","replies":[{"poster":"IiI peep","date":"2017-11-14T07:09:36.736+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=ElectricViolet,realm=LAS,application-id=X54mVVp0,discussion-id=QK3BFlMY,comment-id=00030000,timestamp=2017-11-14T06:39:33.985+0000)\n>\n> ¿15?\n> Tenés suerte, yo juego a 04 fps en las tf y no por tener una tostadora, sino porque el juego está pésimamente optimizado.\n\nClaro campeón, anda a darle de comer al hamster.","replies":[{"poster":"ElectricViolet","date":"2018-08-03T16:14:47.861+0000","up_votes":1,"down_votes":0,"body":"JAJAJAJAJAJAAJA, he leído a gente que juega al Battlefield 4 a 1080p quejarse porque el LOL le anda a 15-20 fps.\nJuegos muy superiores gráficamente me andan a muchos más fps ESTABLES que este coso.","replies":[]}]}]}]},{"poster":"Kłaytøn","date":"2017-11-14T05:53:03.962+0000","up_votes":2,"down_votes":0,"body":"Mal loco, esta re feo ultimamente para los que ya jugabamos con fps medios bajos imaginense ahora, ojala hagan algo porque la verdad saca las ganas de jugar","replies":[]},{"poster":"PepitoLosPalotes","date":"2017-11-14T01:36:59.603+0000","up_votes":2,"down_votes":0,"body":"**Sí, ni idea qué onda, pero tengo un tema parecido. Parto el juego con casi 300 FPS, y ya en los 30 minutos me fijo y rodea los 80-100. No es algo grave para mí, pero parece ser un problema terrible para la mayoría.**","replies":[]},{"poster":"Hwaxinghz","date":"2017-11-14T00:59:11.352+0000","up_votes":2,"down_votes":0,"body":"Yo tengo un problema similar con mi cuenta principal que me da esos mismos bajones de FPS. Pero en la cuenta smurf (con las mismas configuraciones y clubs) me tira 225 fps estables sin bajones.\n\nNo se que será y, encima, desconozco si lo están solucionando.","replies":[{"poster":"Oyarzún","date":"2017-11-14T01:12:10.232+0000","up_votes":1,"down_votes":1,"body":"El problema podría ser en las cuentas dices tú?","replies":[]}]},{"poster":"BETTER ADC WINS","date":"2017-11-16T15:21:17.203+0000","up_votes":1,"down_votes":0,"body":"Yo volvi hace poco a el juego; ahora tngo un pc gamer de gama media y no creo que debería tener problemas (rx580 de 8gb, ryzen 5 1600x, corsair lpx 3200mhz, placa x370 gaming plus). \nAyer jugando me di cuenta que cuando se arman tf los fps bajan considerablemente y fue como wtffff!!, hace años cuando jugaba con una tostadora lo entendía, pero ahora D: ?. Con las spec de mi pc debería andar sobrado de recursos para que eso no pase o no?. Mi pregunta es, antes esto de bajones de fps no pasaba ? (pregunto esto ya que no juego hace como 2 años y ni idea de la optimización y estabilidad de league of legends) o es de algo que me debería de preocupar y tratar de solucionar desde mi pc ?","replies":[]},{"poster":"xM4XIx","date":"2017-11-15T00:12:46.886+0000","up_votes":1,"down_votes":0,"body":"Mi tostadora con gráficos full bajos tuvieron en muy pocas ocasiones esas subidas de fps de la nada. Lo noto más en mi equipo y del enemigo, teniendo mejor pc que la mía por lo que comentan en el chat del juego. Muy raro","replies":[]},{"poster":"Around the world","date":"2017-11-14T15:57:14.963+0000","up_votes":1,"down_votes":0,"body":"De 200 fps me baja a 80 cuando estan los 10 campeones en la pantalla, cuando empiezan a tirar todos sus habilidades me baja a 30 fps...\n\nLos efectos de particula son parte del problema, no se si se pueden desactivar, meter muchos objetos y textura de alta resolucion al juego lo hace lento... antes no me bajaba de 150fps, no se que metieron, pero desde hace unos parches que me anda terriblemente mal :(","replies":[{"poster":"Identi","date":"2017-11-14T18:11:27.516+0000","up_votes":1,"down_votes":0,"body":"si es desde hace unos parches tenes un problema vs porque mi problema se presento en este ultimo no en antiguos parches !","replies":[]}]},{"poster":"Feedeo con Salsa","date":"2017-11-14T10:00:04.073+0000","up_votes":1,"down_votes":0,"body":"Me estoy por comprar la gtx 1050 por su exclusiba \"no optimizacion\" :v","replies":[{"poster":"Identi","date":"2017-11-14T14:40:09.211+0000","up_votes":1,"down_votes":0,"body":"tengo la gtx 1060 y me genera bajones es error de optimizacion 1","replies":[]}]},{"poster":"Identi","date":"2017-11-14T14:39:19.686+0000","up_votes":1,"down_votes":0,"body":"Asado con la optimizacion de mierda desde la actualización !","replies":[]},{"poster":"wattefak","date":"2017-11-14T11:50:49.748+0000","up_votes":1,"down_votes":0,"body":"A mi me marca +100fps cuando en realidad parecen 30 o menos, y en una tf ni me doy cuenta de que sucede x'D","replies":[]},{"poster":"Mioen","date":"2017-11-14T11:46:30.314+0000","up_votes":1,"down_votes":0,"body":"Podra ser un problema de temperaturas? Te fijaste.","replies":[]},{"poster":"Noxus Spinner","date":"2017-11-14T10:35:13.317+0000","up_votes":1,"down_votes":0,"body":"Me pasa lo mismo, jugaba con 80-100 fps y desde el parche que me anda a 12 o 5fps incluso, y sin tf.","replies":[]},{"poster":"ElectricViolet","date":"2017-11-14T06:38:12.860+0000","up_votes":1,"down_votes":0,"body":"Siempre pasa en las pretemporadas, le agregan mil cosas y no se preocupan en optimizar el juego. Lo cargan de datos y no limpian las bases. Es como encerar un piso lleno de arena.\nA mí me pasó exactamente lo mismo en la preseason 4 y nunca pude volver a jugar en Very High.","replies":[]},{"poster":"AndrePower","date":"2017-11-14T00:59:34.664+0000","up_votes":1,"down_votes":0,"body":"A mi me pasa lo mismo y a todos mis amigos, me pasa que de repente se me bajan los fps de 140 a 70 y se me queda quieto el pj y sale todo rápido que pasa? vi varios temas y se molestan en responder otras cosas y esto que es importante?, esta tilteando a mucha gente esto y ninguna respuesta.","replies":[]},{"poster":"Hnk Kenshiro","date":"2017-11-14T00:42:08.594+0000","up_votes":1,"down_votes":0,"body":"Es dificil reproducir el fallo, les tomara un pelin más de tiempo.","replies":[]},{"poster":"MILFortune","date":"2017-11-14T01:42:39.040+0000","up_votes":2,"down_votes":3,"body":"Desactivá el modo Pantalla Completa y de forma temporal, jugá con modo ventana o sin bordes","replies":[]}]}