{"poster":"F4CE jK","date":"2015-07-24T12:18:41.780+0000","title":"Schwarzes Loch - Es existiert! oder doch nicht? (Ranked System)","subforum":"Hilfe & Support","up_votes":2,"down_votes":0,"body":"Hey League Community,\n\nnach was wei&szlig; ich wie viel Jahren League of Legends, mein erster Beitrag. :) \nThema steht im Titel und mal schauen was ihr davon haltet.\n\n\nKapitel I - Kurzer Besuch in der Vergangenheit:\n\nIch befand mich vor ein paar Tagen noch in Platin 5, war zu der Zeit schon 2 mal in der Promotion - leider gescheitert. \nSchlie&szlig;lich landete ich auf 0 P.. Es l&auml;sst sich nat&uuml;rlich dar&uuml;ber schreiten an was es lag, dies ist aber nicht Zweck dieses Thread&#039;s.\nMeine MMR schlug auf dem Boden auf und ZACK, (Special Effects, yeah!) Silber Mates. Ich befand mich in der Gefahrenzone und landete schlussendlich\nwieder in Gold I. \n\nSo nat&uuml;rlich bildet sich jetzt schon jeder seine eigene Meinung, doch wartet....es gibt noch ein zweites Kapitel. (http://m.memegen.com/62cbz0.jpg)\n\nKapitel II - Zeit f&uuml;r Sherlock, Conan etc.\nIch m&ouml;chte wieder aufsteigen - Fakt -, doch kriege ich aktuell nur 10 P. f&uuml;r einen Win und verliere circa 24 P. durch einen Lose.\nJetzt wird bestimmt jeder festgestellt haben, dass ich 3 Wins brauchen um 1 Lose zu \"eliminieren\". &Uuml;brig bleiben mir l&auml;ppische 6 P. (10 x 3 = 30 - 24 = 6!)\nUm nun auf 100 P. zu kommen, ben&ouml;tige ich - wenn man davon ausgeht das ich jedes Mal 3 gewinne und wieder 1 verliere - circa 64 Spiele(http://vignette1.wikia.nocookie.net/starpolar/images/6/6b/Notime.jpg/revision/latest?cb=20150225125846) . Nat&uuml;rlich kann man schlecht sagen, wie hoch die Wahrscheinlichkeit ist zu gewinnen und da ist doch noch der individuelle Skillfaktor etc. Aber Fakt ist, ich befinde mich in einem \"schwarzen Loch\". Und ich komme langsam an meine Grenzen {{summoner:3}} . \n\n\n                                                                                                                         - The End -\n\nW&auml;re echt super mit ein paar Dude&#039;s oder Dudet&#039;s zu diskutieren. Haut ruhig eure Meinungen, konstruktive Kritik und \"schwarze L&ouml;cher Erfahrungen\" (seriously, ihr wisst was ich meine!) hier rein.\n\nGaius Northside","replies":[{"poster":"Traxter","date":"2015-07-24T18:29:42.307+0000","up_votes":1,"down_votes":0,"body":"Es existiert ein schwarzes Loch, bestes Beispiel  ->\n\n-Steigt man eine Division auf dann startet man bei 0 Punkten obwohl man bei 100 Punkten 2 Spiele gewonnen hat,eventuell 1 verloren (wo sind die überschüssigen Punkte hin ? )\n\n-Steigt man eine Division ab dann startet man irgendwo zwischen 55-90 Punkten. (die minuspunkte resultieren wohl aus den vorangegangenen loses)","replies":[{"poster":"F4CE jK","date":"2015-07-24T19:16:11.768+0000","up_votes":1,"down_votes":0,"body":"So true :D Viele hier glaube ich verwechseln das Ganze mit dem Begriff \"Elo Hell\", aber du hast es erfasst.","replies":[]}]},{"poster":"Cænatyx","date":"2015-07-24T15:52:32.713+0000","up_votes":1,"down_votes":0,"body":"Genau deswegen traue ich mich atm nicht ranked zu spielen(G5 0LP) :S","replies":[{"poster":"BloodyVampir","date":"2015-07-24T17:14:18.782+0000","up_votes":1,"down_votes":0,"body":"Brauchst eigentlich keine Angst zu haben. Aus Gold abzusteigen ist um einiges härter als aus Platin. Und denk immer dran, wenn du absteigst, wirst du auch wieder hoch kommen, denn du hast es ja schließlich schonmal höher geschafft ;)","replies":[{"poster":"F4CE jK","date":"2015-07-24T19:15:08.091+0000","up_votes":1,"down_votes":0,"body":"Danke Dude :) Hab schon wieder 92 P 6 Streak ^^","replies":[]}]},{"poster":"F4CE jK","date":"2015-07-24T16:17:33.525+0000","up_votes":1,"down_votes":0,"body":"Haha :D Bei mir scheint es sich langsam einzupendeln, 3 Wins in a Row und mittlerweile 16 P pro Spiel. Mal schauen wann der erste Lose kommt. ^^","replies":[]}]},{"poster":"Avorox","date":"2015-07-24T13:07:57.952+0000","up_votes":1,"down_votes":0,"body":"Natürlich nimmt es viel Zeit in Anspruch. Du bist derzeit nur optisch, also durch das Ligasystem in Gold 1. Deine MMR ist aber in Gold 5 oder sogar Silber 1. Wieso sollte das System einen Silber 1 denn in die Promo zu Platin schicken? Deswegen musst du erst sehr viele in Folge gewinnen um das System zu überzeugen. Soetwas wie ein \"schwarzes Loch\" gibt es nicht. Es gibt nur eine Grenze und diese erreicht man, sobald man nicht mehr besser spielt, als es die Mitspieler tun.","replies":[{"poster":"F4CE jK","date":"2015-07-24T14:30:54.361+0000","up_votes":1,"down_votes":0,"body":"Danke für deine Antwort :) Aber das mit dem schwarzen Loch verstehen viele falsch es soll eig. nur eine Metapher darstellen. ^^","replies":[{"poster":"Avorox","date":"2015-07-24T17:09:44.749+0000","up_votes":1,"down_votes":0,"body":"Diese Metapher sagt aber eher aus dass du einfach nach unten gezogen wirst. Das ist im Normalfall nicht so außer du warst viel zu hoch geranked.","replies":[]}]}]},{"poster":"Chirited","date":"2015-07-24T12:57:38.811+0000","up_votes":1,"down_votes":0,"body":"Interessante und auch nachvollziehbare These. \nIch muss ehrlich sagen, ich kann es in dieser Season nicht aus erster Hand beurteilen, da ich noch nicht abgestiegen bin.\n\nDa sich die Abstiegsbedingungen verändert haben, werden meine Erfahrungen nicht 1:1 passen.\n\nIch hatte letzte Seasond as Glück, von Dia abzusteigen.\nIch hab auf Dia 5 zu dem Zeitpunkt so etwa 15LP pro Win bekommen. Nach Abstieg in Platin 1 nurnoch 11. \nIch war erstmal geschockt und es gibt eigentlich auch keine logische Erklärung dafür. \nAber wenn mans einmal geschafft hat, schafft mans auch nochmal!\n\nBin dann erstmal auf Platin 2 abgestiegen (The tilt is real!), nur um dann ein Wochenende zu tryharden und mit etwas Warwick Spam wieder hochzukommen.","replies":[{"poster":"F4CE jK","date":"2015-07-24T13:32:51.135+0000","up_votes":1,"down_votes":0,"body":"Good Luck!","replies":[]}]},{"poster":"Ashuna","date":"2015-07-24T12:24:07.853+0000","up_votes":1,"down_votes":0,"body":"Falsches Forum. :)\n\nErstens es gibt kein \"Schwarzes Loch\"  was du gerade lediglich merkst ist das deine MMR wesendlich geringer ist als die die du haben solltest! Darum dieser krasse Unterschied zwischen gewonnen und verlorenen LP.\nZweitens; du hast mehr Looses als Wins das ist nicht normal. Um deine MMR höher zu bekommen musst du schlichtweg viele Spiele gewinnen!\nUnd letztens wenn du direkt aus Platin 5 wieder runter Droppst, heisst das das du noch nicht bereit bist (es ist echt schwer aus einer neuen Liga zu droppen) du musst dich noch verbessern!\n\nmfg Ashuna {{champion:1}}","replies":[{"poster":"F4CE jK","date":"2015-07-24T12:27:45.050+0000","up_votes":1,"down_votes":0,"body":"Danke für deine Meinung :) ich hoffe du hast auch den unteren Part gelesen. Und ich weiß natürlich muss ich mich verbessern, ich hatte davor aber ca. 25 Wins im Plus. Und habe mich ja auch von Gold 5 auf Platin gespielt. \n\nPS: Das mit dem schwarzen Loch soll nur eine Metapher dafür sein ;).","replies":[{"poster":"Avorox","date":"2015-07-24T13:09:58.859+0000","up_votes":1,"down_votes":0,"body":"Diese Winrate ist in Platin aber irrelevant, da du sie gegen Goldspieler erspielt hast. Als Beispiel: Jemand der mit 60% Winrate von Bronze nach Gold gekommen ist muss trotzdem keine bessere MMR haben als jemand der mit 50% Winrate in Gold ist aber diese Winrate genau dort erspielt hat. Die Winrate ist also nur bedingt aussagekräftig, da sie immer in Verbindung mit der Liga betrachtet werden muss, in der sie erspielt wurde.","replies":[]},{"poster":"Ashuna","date":"2015-07-24T12:31:50.248+0000","up_votes":1,"down_votes":0,"body":"Ja, ich habe den gesamten Post gelesen. \nIst halt die frage was du von mir hören möchtest.\n\ndas Forum \"Hilfe & Support\" bezieht sich auf Probleme mit Software -> Probleme mit LoL client zum Beispiel.\nDein Post gehört eher zur Kategorie \"Allgemeiner chat\"\n\nmfg Ashuna {{champion:1}}","replies":[{"poster":"F4CE jK","date":"2015-07-24T12:36:27.053+0000","up_votes":1,"down_votes":0,"body":"Kann ich den Post verschieben?","replies":[{"poster":"Ashuna","date":"2015-07-24T12:37:45.265+0000","up_votes":1,"down_votes":0,"body":"Kp :) Admins, Volus können das.\nEinfach den Text kopieren. Diesen Post hier löschen und im richtigen Forum neu posten!\n\nmfg Ashuna {{champion:1}}","replies":[]}]}]}]}]},{"poster":"MeMyselfandBaal","date":"2015-07-24T12:47:00.460+0000","up_votes":1,"down_votes":0,"body":"Ich kann dir genau erklären, woran das liegt: Riot hat es so lange, wie es irgendwie zu rechtfertigen war, verhindert, dass du absteigst. Weil sie dir deine Platin Belohnungen nicht nehmen wollten. \n\nJetzt werden quasi all die Niederlagen, bei denen du offiziell 0 LP verloren hast, ausgeglichen. Jetzt frage dich, ob du es besser gefunden hättest, nach 5 Niederlagen in Gold I zu landen. Das wäre die andere Option gewesen...","replies":[{"poster":"F4CE jK","date":"2015-07-24T12:56:08.011+0000","up_votes":1,"down_votes":0,"body":"Danke für deine Erklärung :D. Und ja 5 wären mir lieber, aber mal schauen wie lange es dauert bis sich das Ganze wieder einpendelt.","replies":[]}]}]}