{"poster":"LordDillPickle","date":"2016-07-18T02:54:11.886+0000","title":"League of Legends making MAC OS X El Capitan freeze, user kernel not responding, and more","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"So I am currently running OS X El Capitan 10.11.5. I was able to run league and play for a while. But after that my computer would start to freeze up and crash. I tried uninstalling it then reinstalling it and it still would make my computer freeze and crash, even without the client (less likely). After a while of not playing on my computer I went back and tried installing it again. It got to the point where I had to reinstall the OS. After that the freezing has stopped most of the time but when I launch league, things get weird. Sometimes it when I would download it and launch it there would be another instance error. Also when downloading the client after launching it, it would crash around 33% - 50%. This is probably due to the User Kernal not responding. Ive tried reinstalling a new User Kernal and every thing out there and it still won't work. It would be great for some feedback and updates on this \"bug\"\r\n\r\nThanks, Dill Pickle","replies":[{"poster":"Kürama","date":"2016-07-18T12:31:19.925+0000","up_votes":2,"down_votes":0,"body":"[Grant League permission to run on your computer!](https://support.riotgames.com/hc/en-us/articles/204134104-Setting-up-your-Permissions) Let us know if this works or not. \n\nhttp://ddragon.leagueoflegends.com/cdn/img/champion/splash/Annie_3.jpg","replies":[{"poster":"LordDillPickle","date":"2016-07-18T17:13:36.846+0000","up_votes":1,"down_votes":0,"body":"The instructions you linked me are for Windows. Also it could be League is allowed to run on my computer because I am able to launch it. I belive the big problem is User Kernal not responding even when I try to fix it. If you could link a MAC version of your instructions that would be grand :)\n\nThanks, Dill Pickle","replies":[]}]},{"poster":"Porocles","date":"2016-07-19T20:42:11.212+0000","up_votes":1,"down_votes":0,"body":"It looks like the patcher is unable to properly scan and download files to your computer.  Crashing at 33%-50% may also indicate an issue with your network connection.  To rule out some of these possible conditions, please go over the steps in our[ Patching Issues](https://support.riotgames.com/hc/en-us/articles/202969434-Patching-Issues#section-mac) guide to see if that will resolve the crashing.  Be sure to select the red box labeled as MAC for instructions specific to your OS.  Please let me know how this works out for you!","replies":[]},{"poster":"LordDillPickle","date":"2016-07-18T20:35:25.901+0000","up_votes":1,"down_votes":0,"body":"Here is a video of my Mac glitching. This might not be league but whenever I launch it, it's more likely to happen. https://youtu.be/4ahTPrtJkp0","replies":[{"poster":"Kürama","date":"2016-07-18T21:20:37.646+0000","up_votes":1,"down_votes":0,"body":"Drop a line with Riot’s [Technical Support Centre](https://support.riotgames.com/hc/en-us/requests/new?ticket_form_id=34190)\n\n\n* The primary category has already been chosen. \n\n\n* For the secondary category, select **My game crashed out / bug splat**\n\nInclude this video in the article. \n\n\nhttps://3.bp.blogspot.com/-HCCc9VGLMBs/VvGim_HT2MI/AAAAAAAA5EU/CQi6aIgFrm0rtxw5hZl4Al3mMP3k3JAyg/s1600/Lissandra_Splash_3.jpg\n\n\n\n[Need help obtaining logs? Soraka will be your aide! ](https://support.riotgames.com/hc/en-us/articles/201752674-Network-System-and-League-of-Legends-Logs)\n\n\nhttps://static2.lolwallpapers.net/2016/04/57010692ced3c.jpg","replies":[]}]}]}