{"poster":"Frôm the deep","date":"2019-10-28T23:01:14.431+0000","title":"Crypost urf + recomendación de juego.","subforum":"Off-topic y temas personales","up_votes":6,"down_votes":4,"body":"Como todos estaba esperando con ansias el urf, no veo necesidad en ahondar mucho en eso, divertido, adictivo blah blah blah.\r\nEs el clasico urf, sin all random... Primera partida, malph aliado con liandry y con morello, iba full ap con cometa arcano... bueno, una no es ninguna pensé, sigo jugando y me sale un vladimir 1/15 que solo le dio para comprar un item... protocintu.\r\nEntiendo que no todos tienen que ser conocedores y/o hábiles, no me ensaño con los jugadores mediocres, me emperra que ni en normal, ni en rankeds ni en urf exista el más mínimo emparejamiento. urf es para divertirse, pasarlo bien, da lo mismo perder... pero si me ponen de aliado a un vladimir 1/15 la derrota se siente ultra amarga, ya de por si estaba aburrido de que me obligaran a hacer hardcarry en ranked, porque si no carreaba yo se perdía (9/10 casos, en el otro me carreaba un aliado) y que ahora vaya a ser lo mismo en urf?\r\nNo pido un team coreano a lo faker, pero que al menos me toque con alguien que conozca lo básico del juego... malph ap con liandry, por gente así el shampoo tiene instrucciones.{{sticker:slayer-jinx-unamused}} \r\n\r\nResumen: El juego es para divertirse, pero con gente tan brainless no se puede. El nivel de los jugadores de las es tan, pero tan bajo, que bien merecido se tiene que le digan LAStima.\r\n\r\nAntes de entrar al urf estaba jugando \"Let it die\", cuando supe que ya estaba disponible el modo de juego me picaban las manos por guardar en el que estaba y cambiarme al lol, con la primera partida ya había quedado con ganas de cambiarme al let it die de vuelta.\r\nEs un juego hack and slash, estilo dark souls pero ambientado estilo cyber punk, por lo que tiene armas de fuego tipo subfusiles, escopetas y demas. Se puede descargar por steam gratis, tiene microtransacciones  de dos objetos, el pase vip y death medal, el pase vip te da beneficios muy sutiles, que perfectamente se puede jugar sin ellos y no te dan la gran ventaja... las death medals sirven para revivir al jugador, ya que si mueres... pierdes todo, a lo roguelike. Lo lindo de todo esto, es que tanto como pases y DM se pueden conseguir gratis y si quieres comprar, son bienes virtuales muy, pero muy baratos.\r\n\r\nResumen: Hack and slahs/roguelike/free2play/cyberpunk/free2win {{sticker:slayer-jinx-catface}}","replies":[{"poster":"Priestess Winda","date":"2019-10-28T23:14:03.187+0000","up_votes":4,"down_votes":2,"body":"URF fue un modo de juego de aprils fools, jamas fue hecho para tomarse en serio las partidas. TODOS LOS IMBECILES QUE TRYHARDEAN URF son los culpables que saliera el AR-URF.\n\nFue gracioso por 2 partidas, en 2014 pero el modo de juego es una basura y jamas entendere por que la gente le gusta tanto","replies":[{"poster":"Frôm the deep","date":"2019-10-29T00:00:07.922+0000","up_votes":4,"down_votes":2,"body":"Estoy de acuerdo con tu comentario, y agradezco el tiempo que tomaste en escribirlo, pero... en que momento me queje del modo de juego en si? {{sticker:sg-lux-2}} \n\nHay que leerlo maximo dos veces si es que tienes mala comprension lectora, para entender que la queja es hacia la comunidad de jugadores en menor parte y en muy gran medida hacia el sistema de emparejamiento.{{sticker:sg-ahri-2}}","replies":[{"poster":"Gine4YourLIVE","date":"2019-10-29T00:32:09.035+0000","up_votes":1,"down_votes":1,"body":"a lo mejor es una persona que sabe jugar bien pero no sabe usar al campeón\ny aprende a divertirte y juega malpfite ap","replies":[{"poster":"Frôm the deep","date":"2019-10-29T02:10:35.176+0000","up_votes":4,"down_votes":1,"body":"Yo no me creo faker, pero cualquier simio con dos dedos de frente puede usar bien a un campeón que jamas ha usado antes siendo nivel 300 o más, yo que soy nivel 60 puedo decir que he salido con un desempeño decente la primera vez que he usado a a,b o c campeón.","replies":[{"poster":"Gine4YourLIVE","date":"2019-10-29T02:35:45.693+0000","up_votes":1,"down_votes":0,"body":"En realidad no. No es así hay gente con ese nivel que nunca ha tocado algunos campeones y menos si es de un roll que jamas jugaste. No encasilles a todos hay gente que ni siquiera sabe como armar a vladimir o conoce sus habilidades pero ne les sale jugarlo. Pero aun asi  merecen respeto y no estamos a un nivel para ponernos como superior a otros","replies":[]}]}]}]},{"poster":"Lord Khada","date":"2019-10-28T23:39:12.535+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=FrostBird,realm=LAS,application-id=J8qpiO2I,discussion-id=NIBM3uN7,comment-id=0001,timestamp=2019-10-28T23:14:03.187+0000)\n>\n> URF fue un modo de juego de aprils fools, jamas fue hecho para tomarse en serio las partidas. TODOS LOS IMBECILES QUE TRYHARDEAN URF son los culpables que saliera el AR-URF.\n> \n\nAmen","replies":[]},{"poster":"The Fall of Troy","date":"2019-10-29T06:11:22.075+0000","up_votes":1,"down_votes":0,"body":"URF esta lleno de esos nenes que no ganan ni en bots y ya se sienten pros por salir 20/5 y dicen \"gg izi p3t3s muah &lt;3\" con sus cd's reducidos al 80% en el modo de juego, la realidad les pega como un tren cuando vuelven a rankear/jugar normals","replies":[]},{"poster":"Gine4YourLIVE","date":"2019-10-29T00:31:04.288+0000","up_votes":2,"down_votes":2,"body":"porque juegan sus mains y  se hacen 3 pentakills","replies":[]}]},{"poster":"MARlHUANERO","date":"2019-10-29T01:08:34.524+0000","up_votes":2,"down_votes":5,"body":"***","replies":[{"poster":"Frôm the deep","date":"2019-10-29T02:09:04.307+0000","up_votes":4,"down_votes":0,"body":"Mira tu nickname, mira como escribes, mira tu icono. Tu crees que mereces pizca de respeto? Cual de todas tus neuronas te dijo que alguien como tu merece el mismo trato de una persona normal?\n\nFijo que pidieron report en mi contra, no te lo voy a negar, nunca me aguanto el puterío para un enfermito que se tiene como nickname \"marihuanero\", que hace 0 aporte al equipo, y no conforme con eso ayuda al equipo contrario. Yo entro a league of legends para jugar en equipo, cooperar y compartir, no para tener que andar soportando a un retrasado que se queda afk farm, que muere una y otra vez porque esta re tilteado, que se pone a flamear porque mataron al minion cañon de su linea, que no esta en ninguna tf para cuidar su kda.\n\nNo te hagas el santo, porque lo que tu eres... es un parásito, te cuelgas de los demás para sacar provecho propio. Y si me dices malo por no poder carrear a una plasta como tu, entonce si... soy malo. No pienso hacerme otp de X campeón o jugar el que esta mas fuerte en el parche actual solo para carrear a basuras como tu, yo juego lo que me gusta más y lo que me parece más divertido, porque el verdadero meta de lol, es el trabajo en equipo. {{sticker:sg-ahri-2}}","replies":[]}]},{"poster":"Mazoku","date":"2019-10-28T23:04:05.847+0000","up_votes":2,"down_votes":4,"body":"> o pido un team coreano a lo faker, pero que al menos me toque con alguien que conozca lo básico del juego... malph ap con liandry, por gente así el shampoo tiene instrucciones.\n\nEstas en el inframundo del elo, es mas que logico que te toquen aliados asi cuando vos no tenes una nocion minima del juego.","replies":[{"poster":"Frôm the deep","date":"2019-10-28T23:57:35.278+0000","up_votes":3,"down_votes":4,"body":"1) Si vas a citar, hazlo bien.\n\n2) Latinoamerica sur... todo elo es elohell, en la cuenta chall en 2016 me toco ver a pelmazos 0/10... en chall. En esta cuenta he tenido que hacerle hardcarry a platinos 1 o diamantes 4, porque si me han tocado en esta que la voy dejando en gold, porque si te fijas, apenas y tengo 40 partidas en toda la temporada... dah. {{sticker:slayer-jinx-unamused}}","replies":[{"poster":"Mazoku","date":"2019-10-29T05:19:12.029+0000","up_votes":1,"down_votes":1,"body":"1) Me falto una N al principio de la cita, el resto esta bien.\n\n2) Tenes 59 RANKEDS en esta temporada, quien sabe cuantos games. Te recuerdo que los de Isurus en 110 games llegaron a challenger en korea y vos estas muy lejitos de eso.","replies":[{"poster":"Frôm the deep","date":"2019-10-29T09:22:01.808+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Mazoku","date":"2019-10-29T15:54:12.783+0000","up_votes":2,"down_votes":0,"body":"> 1) Si te equivocaste en algo, no puedes apelar a que esta bien  Aunque bueno, bien a lo lejos se nota que te gustan las cosas a medias y solo aspiras a la mediocridad\n\nRespondo citandome:\n\n> el resto esta bien.\n\n----\n\n>comentario borrado\n\nNo te entendi muy bien. Podes reformular tu respuesta? Por que estas en el inframundo del elo?\n\nBorraste tu comentario porque te diste cuenta que era un delirio?","replies":[]}]}]}]}]}]}