{"poster":"Flying Eagle","date":"2015-08-19T09:46:24.336+0000","title":"MMR","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":0,"body":"Hallo,\r\nich habe eine Frage bezogen auf die MMR, und zwar, wollte ich fragen, ob die MMR-Rechnung jede Season von Null beginnt oder, ob die MMR auch season&uuml;bergreifend ist? \r\nDenn ich hatte in der S4 ne WinRate von nur um die 32 % und in S5 bin ich im Moment bei einer WinRate um 52%. Und wenn ich n&auml;chste Season eine WinRate von ca. 65% haben sollte, wird dann die WinRate aus S4 auch noch in die MMR miteinberechnet oder nicht?\r\n\r\nmfg\r\nFlying","replies":[{"poster":"HyperionCH","date":"2015-08-19T09:54:11.064+0000","up_votes":2,"down_votes":0,"body":"Die MMR von der letzten Season (bzw. Vorseason der nächsten Season) wird teilweise übernommen.\n\nSie gilt als Grundlage für den Start. Von dieser MMR aus spielst du erneut 10 Einstufungsspiele.\n\nAls Beispiel:\n\nDu startest mit einer Silber 5-MMR und spielt die Einstufung 6:4. Dann wirst du in der neuen Season so um Silber 3-4 eingestuft.\n\nWichtig ist aber:\nMit \"MMR\" ist immer die \"Hidden Elo\" gemeint (bzw. das Niveau der Hidden Elo). Wenn man Silber 5 ist, heisst dies nicht, dass man eine Silber 5-MMR besitzt. Die MMR kann auch etwas höher oder tiefer sein (teils mehrere Divisionen).\n\nZudem ist hier die Annahme, dass Riot dies genauso (oder sehr ähnlich) macht wie in den letzten 2 Seasons.","replies":[{"poster":"Stealth Cat","date":"2015-08-19T10:19:33.165+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=HyperionCH,realm=EUW,application-id=ip27PlEH,discussion-id=y5TEl3Zx,comment-id=0001,timestamp=2015-08-19T09:54:11.064+0000)\n>\n> Die MMR von der letzten Season (bzw. Vorseason der nächsten Season) wird teilweise übernommen.\n> \n> Sie gilt als Grundlage für den Start. Von dieser MMR aus spielst du erneut 10 Einstufungsspiele.\n> \n> Als Beispiel:\n> \n> Du startest mit einer Silber 5-MMR und spielt die Einstufung 6:4. Dann wirst du in der neuen Season so um Silber 3-4 eingestuft.\n> \n> Wichtig ist aber:\n> Mit \"MMR\" ist immer die \"Hidden Elo\" gemeint (bzw. das Niveau der Hidden Elo). Wenn man Silber 5 ist, heisst dies nicht, dass man eine Silber 5-MMR besitzt. Die MMR kann auch etwas höher oder tiefer sein (teils mehrere Divisionen).\n> \n> Zudem ist hier die Annahme, dass Riot dies genauso (oder sehr ähnlich) macht wie in den letzten 2 Seasons.\n\nAnnähernd richtig, es gibt ein sogenanntes \"softreset\", dabei wird deine mmr z.B. Silber 5 mit der durchschnitts mmr aller spieler (so um silber 2 rum) addiert und dann durch 2 gerechnet (also der durchschnitt von dir und dem durchschnittsspieler). Das ist deine neue startmmr in der nächsten season, von hier weg spielst du deine einstufungsspiele.\n","replies":[{"poster":"HyperionCH","date":"2015-08-19T11:52:09.770+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=E5 Rekhyten,realm=EUW,application-id=ip27PlEH,discussion-id=y5TEl3Zx,comment-id=00010000,timestamp=2015-08-19T10:19:33.165+0000)\n>\n> Annähernd richtig, es gibt ein sogenanntes \"softreset\", dabei wird deine mmr z.B. Silber 5 mit der durchschnitts mmr aller spieler (so um silber 2 rum) addiert und dann durch 2 gerechnet (also der durchschnitt von dir und dem durchschnittsspieler). Das ist deine neue startmmr in der nächsten season, von hier weg spielst du deine einstufungsspiele.\n\nJa, es gibt gem. Riot einen softreset, aber Riot hat nie genau geschrieben, wie genau der Reset aussieht (und schon gar nicht, wie die Formel ist).\nEs ist auch möglich, dass der softreset nur die Elo-Inflationen (z.B. durch vergebene Niederlagen) eliminiert.\n\nRiot hat nur gesagt, dass der softreset auf diese Season geringer ist als ein Jahr vorher. Weshalb und was genau resetet wird (und wie stark) sagte Riot nicht.","replies":[{"poster":"Flying Eagle","date":"2015-08-19T12:12:41.216+0000","up_votes":1,"down_votes":0,"body":"Also auf deutsch gesagt, weis keiner, ob die WinRate (Niederlagen bzw. Wins) von der alten  in die neue Season übernommen werden, mal abgesehen von den  Einstufungsspielen. Hab ich recht?","replies":[{"poster":"HyperionCH","date":"2015-08-19T12:31:04.726+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Flying Eagle 98,realm=EUW,application-id=ip27PlEH,discussion-id=y5TEl3Zx,comment-id=0001000000000000,timestamp=2015-08-19T12:12:41.216+0000)\n>\n> Also auf deutsch gesagt, weis keiner, ob die WinRate (Niederlagen bzw. Wins) von der alten  in die neue Season übernommen werden, mal abgesehen von den  Einstufungsspielen. Hab ich recht?\n\nDie Winrate wird nie übernommen, sondern die MMR (Hidden Elo).\nDenn die Winrate zu übernehmen macht ja auch keinen Sinn fürs neue Ranking der Folge-Season. Ein Bronze 3-Spieler kann ja 60% winrate besitzen ist aber trotzdem schlechter als ein Gold 1-Spieler mit 40% winrate. ;)\n\nAber dass die Hidden Elo (MMR) übernommen wird, steht fest (man kann davon ausgehen, dass Riot dies wie in den letzten 2 Seasons wieder umsetzt).\nWir wissen nur nicht (weiss nur Riot), wie stark die Elo der letzten Season Einfluss auf das neue Ranking (inkl. den 10 neuen Einstufungs-Rankeds) besitzt.\n\nFolgendes war aber in den letzten Seasons klar:\n\n- Nach den 10 erneuten Einstufungs-Games wird man maximal Platin 1 eingestuft (auch alle, die letzte Season Challenger waren und 10:0 die Einstufung gewannen).\n- Das neue Ranking wird grundstätzlich (bis Platin 1) durch die Elo/MMR der letzten Season (bzw. der Vorseason) und den 10 Einstufungs-Rankeds ermittelt. Wie beides genau gewichtet wird, sagte Riot nicht.\n- Es gibt ein softreset, wobei Riot nicht sagte, welche Funktion genau der softreset hat. Tendenziell soll aber der softreset dazu führen, dass man etwas tiefer eingestuft wird (Aussage Riot).\n\nIn dieser Season sah etwa so aus, dass man grob sagen konnte, dass man bei den 10 Games die Siege minus die Niederlagen rechnete und dann durch 2 rechnete. In etwa so veränderte sich dann das Ranking.\nAber dies ist sehr grob geschätzt, weil man nicht weiss, wie stark der softreset ist (bzw. was er bezwecken soll) und wie hoch die Hidden Elo ist (man kann z.B. Gold 5 sein, aber eine Silber 3 Hidden Elo haben -> fürs neue Ranking ist die Hidden Elo ausschlaggebend).","replies":[{"poster":"Flying Eagle","date":"2015-08-19T13:32:22.351+0000","up_votes":1,"down_votes":0,"body":"also hab ich ausge.. \naber danke für die Antworten","replies":[]}]}]}]}]}]}]}