{"poster":"Gh0sty","date":"2015-09-04T08:41:19.048+0000","title":"Reporting players for swearing?","subforum":"Help & Support (OCE)","up_votes":1,"down_votes":0,"body":"What are the rules around \"Offensive language\" and how can you determine what&#039;s offensive for one (which may not be offensive for another)?\nI use cuss words when I game all the time.  Not in my day to day life unless I&#039;m just with my mates, so what constitutes as \"Offensive Language\"?\n\nIf I say \"What the F\\*\\*\\*\" clearly not offensive in the same way \"what the hell\" isn&#039;t.\nSo if I ask \"What were you thinking\", \"What the hell were you thinking\" and \"What the f\\*\\*\\* were you thinking\" how can any of them be considered offensive when I am trying to show levels of frustration.\n\nNow remember it&#039;s not abusive it&#039;s not name calling and it&#039;s not being racist or discriminatory which I would consider offensive.  Just as if some one said, \"I main yas top I always win\", my response would be \"That&#039;s f\\*\\*\\*ing bs, you&#039;re stats are 9/13/6\" how is that offensive.  The way I see it, if you don&#039;t like cuss words, that&#039;s what the filter is for. If you disable it, you clearly cuss.\n\nSome one tell me where this is in the rules that one cannot cuss in a sentence directed at another.  Cuz even when I&#039;m on curse with my mates and gaming and they stuff up I&#039;d have the same sentence format.\n\nAnd please no \"Salt\" comments seriously I&#039;m bronze I&#039;ll stay bronze and stay salty.","replies":[{"poster":"XxSonOfMercyxX","date":"2015-09-05T06:20:21.619+0000","up_votes":2,"down_votes":0,"body":"Haha I get your point.  I swear all the time in chat but not to be offensive. When people report for swearing it's probably a young kid. Like for example when i get outplayed i just write \"What the f@!#\" but not being abusive to a player. Cussing in chat is normal, but being abusive is just wrong :)","replies":[]},{"poster":"Gh0sty","date":"2015-09-05T07:53:56.365+0000","up_votes":1,"down_votes":0,"body":"Yeah well that's my thing. Like why do I get reported simply for saying \"why the f#@% did you dive\" or \"what the f&*# was that?\"\nAnd if I stuff up I say. \"Well I just f&*#ed up\".","replies":[]}]}