{"poster":"Turbo Autist","date":"2018-07-17T11:25:47.200+0000","title":"Yikes","subforum":"Player Behaviour","up_votes":2,"down_votes":2,"body":"This board is all about fostering a healthy community in which discussions can revolve around player behavior systems or in-game suspensions. This includes topics on how the systems work, insight into why players were punished, and advice to help players improve moving forward.\r\n\r\nShame people who literally intentionally feed don&#039;t get the same punishment. Words hurt though :(. you guys put more time and effort into making sure no one has hurt feelings than you do making sure the game doesn&#039;t operate with 300 bugs. You guys put more time and effort into making sure no one has hurt feelings than you do making sure the game is balanced and that shows like fuc king crazy with the fact you guys have a gold 3 on the balancing team. &quot;I almost had to buy ninja tabis as an adc to beat shaco&quot; ecks. fucking. dee. dude. Gw on that one btw, shaco is still a half champion until he ults. \r\n\r\nTell me why I should care about being less toxic if you don&#039;t care about your own game.","replies":[{"poster":"Turbo Autist","date":"2018-07-17T11:49:04.861+0000","up_votes":2,"down_votes":1,"body":"what a surprise, a downvote, but no comment? Why? Because they can't disagree, but they don't like the message. Just like every other reddit league player that doesn't want to admit league has a massive problem. Here's a hint the game has a massive fucking flaw, when 4 players (L9) can go 10+ games hard inting and not get banned, but the second they type the letter \"K Y S\" they get insta 14 dayed. Not for inting, but for hate speech. Good. One. Riot. Games. You will lose your ability to compete if you keep this shit up.","replies":[]},{"poster":"Excited","date":"2018-07-18T13:59:58.193+0000","up_votes":1,"down_votes":1,"body":"the reason why nobody has commented is because of the following:\n\n1. You have made up your mind about riot and the game as a whole, you've got mixed information from different streamers, pros and Reddit. think you have come to an informed opinion and try to regurgitate that dribble here. **It's utter nonsense and false data, Show proof of your claims then we can talk.**\n\n2. You cannot control your emotions, I'm willing to bet if i could look at your chat logs i would see some toxic spew in over 50% of your games. you blame others instead of looking at your own misdeeds\n\n3. You talk shit about a gold 3 designer. but you are silver 1 on a low pop server. \n\nGET OVER YOURSELF!","replies":[]}]}