{"poster":"Replayz","date":"2016-10-30T07:38:29.283+0000","title":"Es Veigar el\"AP\" mas poderoso del juego?","subforum":"Charlas Generales","up_votes":6,"down_votes":2,"body":"Hola venia a hablar de veigar porque no eh econtrado campeon que tenga un da&ntilde;o o burst mas fuerte que el de veigar , bueno soy main veigar y varios magos mas como syndra entre otros y la verdad es que cuando me voy con veigar en una partida siempre reviento pero no es normal el da&ntilde;o que tiene como es posible que con unos 1000-1100 de ap el adc o ap enemigo desaparezca con tan solo la Q + W y a medida que va avanzando la partida el adc muere con tan solo la W , encuentro que con syndra no hace taanto da&ntilde;o comp veigar o kataria ella igual deletea de una pero esque veigar aunque tengan resistencia magica sigue pegando de una manera tan imposible , habra alguien que le haga el peso en da&ntilde;o de AP?","replies":[{"poster":"Lunari Red Mask","date":"2016-10-30T07:44:01.633+0000","up_votes":6,"down_votes":2,"body":"Nadie, pero tenes que tener en cuenta que también lo deletean facil. Y que es mejor para el late game. Por lo que una composisión para el early le gana sin que él pueda hacer mucho...\nSaludos!","replies":[{"poster":"LeonardoSB","date":"2016-10-30T07:51:03.794+0000","up_votes":2,"down_votes":1,"body":"Anexando a lo que dice el compañero:\n\ntambien tenes que pensar que durante gran parte del juego te la pasas farmeando pasivo, hasta que logras stackear un par de items que faiclita tu farmeo de pasiva, un lane bully de mid (osea mid de early) facilmente te ganan la linea sin que puedas hacer mucho para controlarlo.\n\ntambien está la opcion de zonyas, velo de banshee y otras cosas, como por ejemplo la prision, si bien stunean es para los taradometros que siempre buscan moverse fuera de la prision y no dentro, tambien está el que si no embocas la prision a donde apuntas la W y si es que le pega al enemigo.\n\n\nmuchos dicen que veigar está roto, y no lo está, sencillamente hay que parar su stackeo y ganarle lo antes posible, otro champ que aplica este concepto es Nasus, si nasus llega al minuto 40 con 2000 stacks sucede lo mismo, te flashea en la cara y pentakill de 1 Q (un poco exagerado si, pero se entiende a lo que voy xD).\n\nel tema es que todavia no encontras rivales que te cobren cada minion con daño recibido xD","replies":[{"poster":"BiXe","date":"2016-10-30T12:36:06.064+0000","up_votes":2,"down_votes":1,"body":"Es el que más escala en daño, pero la w tarda 5 años en caer la últi pega más estando bajo de hp, es muy countereable, si lo dejan tranquilo y farmeando sube el daño, y si pones la cara a las skills te deleteara a mi me parece que está bien.","replies":[]}]}]},{"poster":"Hwaxinghz","date":"2016-10-30T13:27:54.380+0000","up_votes":2,"down_votes":0,"body":"Cuidado con lo que dices respecto a Katarina y Syndra.\n\nTe explico, Syndra es más asesina que Maga, a tal punto que con un solo ítem con la Q y la E puede deletear al ADC (con el Eco de Luden y las botas de penetración, aunque no son tan necesarias). Katarina puede deletear de igual manera que Syndra con solo tener un solo ítem. El problema es que Veigar escala en AP dependiendo del tiempo de la partida y de su farm (vienen de la mano claramente).\n\nSyndra tiene buen juego temprano y muy buen juego medio. Katarina tiene mal juego temprano, buen juego medio y excelente juego tardío (aunque un CC a alguno de estos 2 campeones es mortal). No puedes dejar de ver que son distintas mecánicas, Con Syndra es apuntar el stun y spamear bolitas para sacudirle un ulti potenciado al adc o al Mid enemigo, lo que hace más de 1000 de daño, pero esto en el juego tardío se perjudica bastante, si la partida no se alarga con Syndra la ganas fácilmente. Con Katarina tienes que esperar a que el enemigo gaste todo el CC para lanzarte, clarísimo está que ella deletea a todos si empezó a matar a uno, debido a su reset de habilidades con cada kill o asist. Lo que es Syndra y Katarina, son \"mortales\" mientras ellas sigan escalando con objetos, cuando lleguen al punto de estar FULL builds, ya su escalado se frena, lo que significa que no podrás hacer más desastres de los que ya ocasionaban. En cambio Veigar requiere un farmeo muy alto con la Q para que haga un daño considerable con sus habilidades.\n\nYo logré llegar a 2000 de AP con veigar al minuto 80 de la partida (una ranked, me acuerdo), pero todos estaban recontra tanques y no deleteaba tan fácil al ADC con un Braum y un Yasuo enemigo (que creeme, te la complican bastante) (Yasuo con 4000 de vida, con Muro y daño obseno, Braum con 5000 de vida con 300 de mr y el muro, un Zac con 6000 de vida con 400 de mr aproximadamente, un Maokai con 6000 de vida también con 50% del daño reducido con la R y una Vayne que era farmeable pero con 500000 escudos y muros a su favor). Así lograba quitarle el 50% de la vida al menos tanque (sin contar al adc) debido a lo tanque que estaban.\n\nVeigar requiere Farmeo, Syndra y Katarina requieren una Kill para hacer Snowball y así ganar rápido. Si con veigar Alargas, entonces Ganas. Si con Syndra y Katarina Alargas, entonces tienes cada vez menos posibilidades de ganar. Además también está de más que no debes pickear cualquier campeón en cualquier momento, debes ser cuidadoso para pickear. Katarina escala muy bien en Late, sí, y deletea a todo el mundo, sí, pero en Late los enemigos si son inteligentes se arman tanques y chau katarina. Siempre hay alguien que tiene CC, SI del lado enemigo hay un Zac, Leona, Nautilus, Ashe y Viktor, no vas a pickear a Katarina porque es imposible que hagas algo si los enemigos tienen algo de idea. Tampoco vayas a pickear a veigar si tienen ellos asesinos que se hacen invisibles como Shaco, Rengar, Evelyn, etc porque no te van a dejar escalar en early y la mayor cantidad de partidas se están ganando en Early actualmente, con lo que el pick de Veigar o Nasus (que escalan hasta el infinito) no son tan viables hoy en día porque el Meta no lo permite. No quiere decir que no sean buenos campeones, solo que hay mejores opciones, como las ya mencionadas Syndra y Katarina (y en top Maokai y Poppy) que hacen mejor el trabajo de deletear al adc en los primeros minutos de la partida.","replies":[{"poster":"Zinc","date":"2016-10-30T19:37:59.021+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Conqueror Syndra,realm=LAS,application-id=v7qsfXsE,discussion-id=JiQaUveP,comment-id=0008,timestamp=2016-10-30T13:27:54.380+0000)\n>\n> Cuidado con lo que dices respecto a Katarina y Syndra.\n> \n> Te explico, Syndra es más asesina que Maga, a tal punto que con un solo ítem con la Q y la E puede deletear al ADC (con el Eco de Luden y las botas de penetración, aunque no son tan necesarias). Katarina puede deletear de igual manera que Syndra con solo tener un solo ítem. El problema es que Veigar escala en AP dependiendo del tiempo de la partida y de su farm (vienen de la mano claramente).\n> \n> Syndra tiene buen juego temprano y muy buen juego medio. Katarina tiene mal juego temprano, buen juego medio y excelente juego tardío (aunque un CC a alguno de estos 2 campeones es mortal). No puedes dejar de ver que son distintas mecánicas, Con Syndra es apuntar el stun y spamear bolitas para sacudirle un ulti potenciado al adc o al Mid enemigo, lo que hace más de 1000 de daño, pero esto en el juego tardío se perjudica bastante, si la partida no se alarga con Syndra la ganas fácilmente. Con Katarina tienes que esperar a que el enemigo gaste todo el CC para lanzarte, clarísimo está que ella deletea a todos si empezó a matar a uno, debido a su reset de habilidades con cada kill o asist. Lo que es Syndra y Katarina, son &quot;mortales&quot; mientras ellas sigan escalando con objetos, cuando lleguen al punto de estar FULL builds, ya su escalado se frena, lo que significa que no podrás hacer más desastres de los que ya ocasionaban. En cambio Veigar requiere un farmeo muy alto con la Q para que haga un daño considerable con sus habilidades.\n> \n> Yo logré llegar a 2000 de AP con veigar al minuto 80 de la partida (una ranked, me acuerdo), pero todos estaban recontra tanques y no deleteaba tan fácil al ADC con un Braum y un Yasuo enemigo (que creeme, te la complican bastante) (Yasuo con 4000 de vida, con Muro y daño obseno, Braum con 5000 de vida con 300 de mr y el muro, un Zac con 6000 de vida con 400 de mr aproximadamente, un Maokai con 6000 de vida también con 50% del daño reducido con la R y una Vayne que era farmeable pero con 500000 escudos y muros a su favor). Así lograba quitarle el 50% de la vida al menos tanque (sin contar al adc) debido a lo tanque que estaban.\n> \n> Veigar requiere Farmeo, Syndra y Katarina requieren una Kill para hacer Snowball y así ganar rápido. Si con veigar Alargas, entonces Ganas. Si con Syndra y Katarina Alargas, entonces tienes cada vez menos posibilidades de ganar. Además también está de más que no debes pickear cualquier campeón en cualquier momento, debes ser cuidadoso para pickear. Katarina escala muy bien en Late, sí, y deletea a todo el mundo, sí, pero en Late los enemigos si son inteligentes se arman tanques y chau katarina. Siempre hay alguien que tiene CC, SI del lado enemigo hay un Zac, Leona, Nautilus, Ashe y Viktor, no vas a pickear a Katarina porque es imposible que hagas algo si los enemigos tienen algo de idea. Tampoco vayas a pickear a veigar si tienen ellos asesinos que se hacen invisibles como Shaco, Rengar, Evelyn, etc porque no te van a dejar escalar en early y la mayor cantidad de partidas se están ganando en Early actualmente, con lo que el pick de Veigar o Nasus (que escalan hasta el infinito) no son tan viables hoy en día porque el Meta no lo permite. No quiere decir que no sean buenos campeones, solo que hay mejores opciones, como las ya mencionadas Syndra y Katarina (y en top Maokai y Poppy) que hacen mejor el trabajo de deletear al adc en los primeros minutos de la partida.\n\nChe se ve que vs tenes idea y nesecito sacarme una duda. \nJugue una partida en la cual llegado el late (te hablo de mas de 50 min) una Syndra seguia partiendo colas. Yo tenia apariencia espiritual como unico item de def magica sobre el final, y la tipa, literalmente, me borraba de un combo. (Yo nocturne).\nPero no era solo a mi, incluso a un Galio, a todos, era tipo te entraba el stun y fuiste.\n\nSea como fuere, la duda es: Si la comparas, que se yo, con una Ahri en late, cual es la relacion del daño?\n\nPD: Se que pude armarme la espada esa q da def magica, pero esa es otra historia :V","replies":[{"poster":"Hwaxinghz","date":"2016-10-30T19:53:15.439+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Zinc,realm=LAS,application-id=v7qsfXsE,discussion-id=JiQaUveP,comment-id=00080000,timestamp=2016-10-30T19:37:59.021+0000)\n>\n> Che se ve que vs tenes idea y nesecito sacarme una duda. \n> Jugue una partida en la cual llegado el late (te hablo de mas de 50 min) una Syndra seguia partiendo colas. Yo tenia apariencia espiritual como unico item de def magica sobre el final, y la tipa, literalmente, me borraba de un combo. (Yo nocturne).\n> Pero no era solo a mi, incluso a un Galio, a todos, era tipo te entraba el stun y fuiste.\n> \n> Sea como fuere, la duda es: Si la comparas, que se yo, con una Ahri en late, cual es la relacion del daño?\n> \n> PD: Se que pude armarme la espada esa q da def magica, pero esa es otra historia :V\n\nAcuérdate que si Syndra spamea bolitas (4) puede lanzarte una ulti de 1500+ de daño. Con Liandry, Báculo del vacío, eco de luden, botas de penetración, rabaddon y rylai puede deletear a absolutamente a todo el mundo, siempre y cuando no tenga más de 300 de resistencia mágica.\n\n Contra Syndra es mejor sacarse Velo no Apariencia.\n\nProbablemente el Galio haya sido muy malo y no se ha comprado mr, porque por lo menos, todos los Galios con los que me he cruzado, siempre tenían fijo 400 de resistencia mágica y 4000 de vida, y te aseguro que de un combo no le bajas ni 1/4 de vida por más que estés full build.\n\nRecuerda lo siguiente: Syndra si te acierta 1 Q (500+ de daño fijo), E (500+ de daño extra además de la Q, sin contrar tu MR), la W con 3 bolitas (es decír, fuleada la W y levantando 3 bolitas, son otros 300+ de daño) + la ulti con 4 bolitas (son 1500+ de daño), pero hablando en LATE GAME, si te conecta todo te borra, es obvio ya, vos lo que tienes que hacer es bloquearle la primer Q (que es la que te quita media vida) o esquivarla, si esquivas eso ya tiene casi la mitad del daño menos. En cuanto a la ulti, en Late al tanque no lo borra salvo que él sea muy malo o que sea 3 niveles menos.\n\nAhri en Late no rinde mucho, como todo asesino de Early-Mid game, en Late deleteas a uno y ya no tienes más recursos.\n\nTanto Ahri como Syndra, en Late pueden deletear a uno, pero sin sus recursos (Flash, E, W y R) no sirven para nada y son muy vulnerables, es el momento para atacarlas. Cuando gastan sus habilidades de CC y de escape ya no tienen como defenderse, es el momento de deletearlas. Con Nocturne es fácil, vos esperas que Syndra gaste la E (y si es posible la ulti) y te le tiras con todo, la tienes que matar, no tienen más de 2000 de vida, y normalmente nada de armadura/mr, son puro daño, con un Nocturne con una buena build (además de sacar el Malmortius que es VITAL para mitigar daño, no lo hiciste pero BUENO) puede deletearlas sin ningún problema.\n\nTe cuento mi caso, cuando juego con Syndra, odio los Nocturnes porque siempre aparecen en level 6, y yo level 6-7-8 no puedo defenderme de ellos, si llegan a campear a Syndra los primeros 10-15 minutos, ya esta no hará nada, los mismo con cualquier otro asesino. Es la mejor forma de evitar ese champ.\n\nNo debes permitir el roaming a bot, wardea detrás de la torre (normalmente se aparecen pro ahí) y manten un camino wardeado para evitar su llegada sorpresa, si tiene TP manten deswardeado todos los arbustos de BOT para evitar su llegada, normalmente Syndra se sale de control (lo mismo con Ahri o cualquier otro asesino) cuando roamea y lleva kills.","replies":[{"poster":"Zinc","date":"2016-10-30T20:42:36.166+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Conqueror Syndra,realm=LAS,application-id=v7qsfXsE,discussion-id=JiQaUveP,comment-id=000800000000,timestamp=2016-10-30T19:53:15.439+0000)\n>\n> Acuérdate que si Syndra spamea bolitas (4) puede lanzarte una ulti de 1500+ de daño. Con Liandry, Báculo del vacío, eco de luden, botas de penetración, rabaddon y rylai puede deletear a absolutamente a todo el mundo, siempre y cuando no tenga más de 300 de resistencia mágica.\n> \n>  Contra Syndra es mejor sacarse Velo no Apariencia.\n> \n> Probablemente el Galio haya sido muy malo y no se ha comprado mr, porque por lo menos, todos los Galios con los que me he cruzado, siempre tenían fijo 400 de resistencia mágica y 4000 de vida, y te aseguro que de un combo no le bajas ni 1/4 de vida por más que estés full build.\n> \n> Recuerda lo siguiente: Syndra si te acierta 1 Q (500+ de daño fijo), E (500+ de daño extra además de la Q, sin contrar tu MR), la W con 3 bolitas (es decír, fuleada la W y levantando 3 bolitas, son otros 300+ de daño) + la ulti con 4 bolitas (son 1500+ de daño), pero hablando en LATE GAME, si te conecta todo te borra, es obvio ya, vos lo que tienes que hacer es bloquearle la primer Q (que es la que te quita media vida) o esquivarla, si esquivas eso ya tiene casi la mitad del daño menos. En cuanto a la ulti, en Late al tanque no lo borra salvo que él sea muy malo o que sea 3 niveles menos.\n> \n> Ahri en Late no rinde mucho, como todo asesino de Early-Mid game, en Late deleteas a uno y ya no tienes más recursos.\n> \n> Tanto Ahri como Syndra, en Late pueden deletear a uno, pero sin sus recursos (Flash, E, W y R) no sirven para nada y son muy vulnerables, es el momento para atacarlas. Cuando gastan sus habilidades de CC y de escape ya no tienen como defenderse, es el momento de deletearlas. Con Nocturne es fácil, vos esperas que Syndra gaste la E (y si es posible la ulti) y te le tiras con todo, la tienes que matar, no tienen más de 2000 de vida, y normalmente nada de armadura/mr, son puro daño, con un Nocturne con una buena build (además de sacar el Malmortius que es VITAL para mitigar daño, no lo hiciste pero BUENO) puede deletearlas sin ningún problema.\n> \n> Te cuento mi caso, cuando juego con Syndra, odio los Nocturnes porque siempre aparecen en level 6, y yo level 6-7-8 no puedo defenderme de ellos, si llegan a campear a Syndra los primeros 10-15 minutos, ya esta no hará nada, los mismo con cualquier otro asesino. Es la mejor forma de evitar ese champ.\n> \n> No debes permitir el roaming a bot, wardea detrás de la torre (normalmente se aparecen pro ahí) y manten un camino wardeado para evitar su llegada sorpresa, si tiene TP manten deswardeado todos los arbustos de BOT para evitar su llegada, normalmente Syndra se sale de control (lo mismo con Ahri o cualquier otro asesino) cuando roamea y lleva kills.\n\nTe pasaste genio, muy buena info y bien explicado, gracias por tomarte el tiempo.\n\nX cierto, con la espada que da def magica me referia justo al Malmortius.\nEn fin +1 y gracias!","replies":[{"poster":"Hwaxinghz","date":"2016-10-30T21:10:56.584+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Zinc,realm=LAS,application-id=v7qsfXsE,discussion-id=JiQaUveP,comment-id=0008000000000000,timestamp=2016-10-30T20:42:36.166+0000)\n>\n> Te pasaste genio, muy buena info y bien explicado, gracias por tomarte el tiempo.\n> \n> X cierto, con la espada que da def magica me referia justo al Malmortius.\n> En fin +1 y gracias!\n\nJusto hablaba del Malmortius porque mencionaste esa espada xD.","replies":[]}]}]}]}]},{"poster":"Storm2400","date":"2016-10-30T12:51:58.297+0000","up_votes":4,"down_votes":1,"body":"Esto depende por que con ese \"más Poderoso\" te quedas corto, si tiene un escalado infinito y tal pero no implica que sea invensible pues despues de quemar un {{summoner:4}} y su stun o {{item:3157}} no tiene mucho más escape que meterte todo daño posible asi que si eres algo imparable como {{champion:2}} o similar y te tankeas bien podras matarlo, si no lo defiende su team\n Existen otros AP mejores en otros campos,\nAsesino {{champion:84}}  (si amantes de leblanc, akali es estadisticamente mejor\nA distancia {{champion:161}} (Daño verdadero ftw)\ntanke {{champion:245}} (ni tan efectivo mas pero bueno sigue con un buen dps)\nasedio {{champion:115}} (prro  lanzale mi note 7 a esa torre)\nDps {{champion:69}} (bien armada te baja la vida agónicamente mientras te lanza sus tacones)\nBurst {{champion:45}} (No importa cuan tanke sea si tengo penetracion, 1000 de AP y el esta debajo de 40% de vida no vive ni si su angel guardian es kayle fusionada con el papa )\n\nPrro no todo es burst, en general a veces el ap o el mid en general debe ser mas utilidad que burst, Daño no siempre es igual a victoria, a veces se necesita una {{champion:61}} o similar para controlar al team enemigo por ejemplo \nPD: Llamarte main veigar es vergonsozo por favoor no lo hagas ","replies":[]},{"poster":"IGNORE ALL","date":"2016-10-30T15:21:37.808+0000","up_votes":2,"down_votes":0,"body":"Disfrutemos ahora que no se juegan asesinos. Luego veremos .. xD {{champion:91}} {{champion:7}} {{champion:55}} {{champion:107}}","replies":[]},{"poster":"KzG Arconte","date":"2016-11-01T00:06:04.657+0000","up_votes":1,"down_votes":0,"body":"{{champion:85}}","replies":[]},{"poster":"Sir Crucifix ","date":"2016-10-30T07:55:18.850+0000","up_votes":1,"down_votes":8,"body":"yo creo que ese pj es el favorito del dueño de esta empresa , porque lo bufeo tanto que es ridiculo \n\nmientras todos se esfuerzan para llegar a los 500 de ap , el tipo anda tranqui 1200","replies":[{"poster":"Lucio22","date":"2016-10-30T08:56:50.589+0000","up_votes":1,"down_votes":0,"body":"...\nseeee... porque es mas dificil matar a un veigar que a un zed, que no tiene nada de movilidad, ni una pasiva que hace mas daño cuando el enemigo tiene media vida, ni metodos de escape ni ulti que aumenta el daño que se recibe (y, dentro de poco, roba ad)...\n\nsep, definitivamente debe ser como decis...","replies":[{"poster":"Sir Crucifix ","date":"2016-10-30T16:49:22.673+0000","up_votes":1,"down_votes":3,"body":"Te querés hacer el listo conmigo te duermo al toque . Para que querés movilidad ? De quien querés escapar si con Q R ya mataste","replies":[{"poster":"Lucio22","date":"2016-10-30T18:41:53.203+0000","up_votes":1,"down_votes":0,"body":"...\nPorque como vos dijiste, necesitas la q para matarme, cosa que se puede esquivar. Ademas, Zed (junto con otros champ, como vladi) pueden cagarte la ulti de veigar con su ulti (si la tira en el momento justo). Ademas, para que movilidad? Mmmm... déjame pensar... tal vez porque veigar es sumamente flan, tiene cd base relativamente elevados (sacando la q) y que todas sus habilidades (salvo la r) pueden ser esquivables? Jeez, i Wonder why...","replies":[{"poster":"Flánn","date":"2016-10-31T04:52:39.648+0000","up_votes":1,"down_votes":0,"body":"Muy linda la manera en como le cerraste la boca por esa razon te voy a decir que Zed roba AD PERO ahora depende 100% de los asesinatos ya que la q tiene menos rango la pasiva de la w se la sacaron y tiene CDs mas altos ahora no recuerdo cuales ahora si que Zed estara balanceado :V","replies":[{"poster":"Lucio22","date":"2016-10-31T06:47:51.612+0000","up_votes":1,"down_votes":0,"body":"Mira vos, la parte del \"nerfeo\" del cambio no la conocía, solo lo de la ulti (va a robar si mata con la ulti, pero no sé si es permanente o temporal, como espero)","replies":[{"poster":"Flánn","date":"2016-10-31T23:22:26.971+0000","up_votes":1,"down_votes":0,"body":"Permanente","replies":[{"poster":"Flánn","date":"2016-10-31T23:23:49.741+0000","up_votes":1,"down_votes":0,"body":"Si era temporal Zed seria el nuevo Urgod","replies":[]}]}]}]}]}]}]},{"poster":"LastHope17","date":"2016-10-30T08:55:10.197+0000","up_votes":1,"down_votes":0,"body":"En urf se juega el veigar tanque :v como tenes habilidades cada 2x3 no necesitas ap","replies":[]}]},{"poster":"kipkeior","date":"2016-10-30T08:19:46.032+0000","up_votes":1,"down_votes":1,"body":"1000 AP  en el minuto 35 si se fedea un poquito , te lanza su W siendo tanke con resistencias con 3000 de vida , resultado te quita 3/4 de vida . NAH not even broken babyyyyyyyyyyyyy (kappa)","replies":[{"poster":"Akalimaster","date":"2016-10-30T19:33:48.708+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=kipkeior,realm=LAS,application-id=v7qsfXsE,discussion-id=JiQaUveP,comment-id=0003,timestamp=2016-10-30T08:19:46.032+0000)\n>\n> 1000 AP  en el minuto 35 si se fedea un poquito , te lanza su W siendo tanke con resistencias con 3000 de vida , resultado te quita 3/4 de vida . NAH not even broken babyyyyyyyyyyyyy (kappa)\n\nmin 35? si farmea bien llega a 1000 en 20 o 25 mins {{sticker:slayer-jinx-wink}}","replies":[{"poster":"Flánn","date":"2016-10-31T04:48:08.980+0000","up_votes":1,"down_votes":0,"body":"No es farmear bien es farmear perfecto sin error alguno","replies":[]}]}]},{"poster":"Flánn","date":"2016-10-31T04:37:08.980+0000","up_votes":1,"down_votes":0,"body":"Bueno tecnicamente es el campeon que mas daño puede inlingir YA QUE ES INFINITO AHAJAJAJAJAJAJAJAJAJAJAJAJAJA sin contar a nasus claro","replies":[]},{"poster":"alop55555","date":"2016-10-30T22:08:02.055+0000","up_votes":1,"down_votes":0,"body":"veo más peligros a un {{champion:4}} bien usado que a un veigar \nsi el {{champion:4}} gankea bien puede snowbollear la linea que quiera","replies":[]},{"poster":"Blue Striker","date":"2016-10-30T10:52:32.293+0000","up_votes":1,"down_votes":0,"body":"Veigar es un Nasus AP, si lo dejas farmear, con el paso del tiempo te borrará mas rápido.\n\nImaginate si fuese tank, seria el personaje mas temido de todos los tiempos...","replies":[{"poster":"iLegault","date":"2016-10-30T15:06:15.080+0000","up_votes":1,"down_votes":0,"body":"De hecho si se puede armar tank.","replies":[]}]},{"poster":"DanielGarrita","date":"2016-10-30T11:02:27.973+0000","up_votes":1,"down_votes":0,"body":"veigar tiene ap inlimitado, si farmeas la Q y te armas penetracion magica nadie te detiene.","replies":[]},{"poster":"Ks Erwyn","date":"2016-10-30T08:59:48.219+0000","up_votes":1,"down_votes":0,"body":"Por potencial si...","replies":[]},{"poster":"Summer Nights","date":"2016-10-30T07:53:48.446+0000","up_votes":1,"down_votes":0,"body":"Lo stompeas en lane en early y no puede hacer absolutamente nada, en elos bajos funciona porque la gente o es muy pasiva o no sabe como forzar spells/trades, a un veigar lo viven diveando y outplayeando en elos más altos por ende no rinde taaaaaaanto. Obvio que varía segun el game y el matchup, pero por lo general si lo blind pickeas te sacan facil una lb que te va vivir soleando si la sabe usar bien","replies":[]},{"poster":"FurchiDC","date":"2016-10-30T21:56:48.729+0000","up_votes":1,"down_votes":1,"body":"Veigar está sumamente roto en low-elo, literalmente puede ganar una partida él solo. \n\nNo usé tanto a Veigar como para decir si es el más roto AP actualmente, pero me ha tocado jugar contra varios, y cuando lo usan bien es un verdadero dolor de cabeza.\n\n[](http://.)\n[](http://.)\n_________________________________\n>Saludos. {{champion:134}}{{item:3211}}{{champion:84}}","replies":[]}]}