{"poster":"Ardak Solinar","date":"2016-08-12T20:30:49.901+0000","title":"Il risentimento antifrancese","subforum":"Discussioni generali","up_votes":10,"down_votes":2,"body":"Allora, voglio solo fare chiarezza su una questione, poi se volete bannarmi fate come volete. Io voglio solo specificare e chiarire il punto per una questione di onest&agrave; intellettuale, e se si vuole, prendendola con spirito goliardico italiano, se volete dopo aver compreso il messaggio ci si pu&ograve; anche fare una risata sopra tutti assieme. Ma &egrave; per mettere i puntini sulle &quot;i&quot; che scrivo quanto segue \r\n\r\nIl popolo francese viene da secoli generalmente considerato dal punto di vista morale e da quello educativo come i maiali d&#039;Europa.\r\nAllora, semplicemente, se &egrave; un popolo che viene odiato e stigmatizzato come il peggiore all&#039;interno della comunit&agrave; europea, sia per il loro atteggiamento che per le loro capacit&agrave; tecniche e le loro abilit&agrave; di gioco (soprattutto online), non &egrave; per motivi di odio razziale. Ogni cittadino, italiano, tedesco, spagnolo o comunque qualunque cittadino europeo e non che visiti la Francia avr&agrave; le seguenti impressioni:\r\n\r\nI francesi sono persone arroganti, e si ritengono generalmente pi&ugrave; intelligenti e furbi della media dei popoli europei.\r\nI francesi sono sporchi, non avendo strumenti igienici come il bidet.\r\nI francesi cucinano male e sono orgogliosi di una cucina povera e sovrastimata (soprattutto dal punto di vista italiano).\r\nI francesi sono un popolo debole, con scarsa spina dorsale che preferisce evitare i problemi ed arrendersi alle prime difficolt&agrave;.\r\n\r\nQuesti pensieri fanno parte del patrimonio culturale europeo e sono noti da secoli (basti pensare al pensiero di Schopenhauer e di altri illustri filosofi europei. \r\n\r\n_Le altre parti del mondo hanno le scimmie; l&#039;Europa ha i francesi. La cosa si compensa._ \r\n\r\n_Arthur Schopenhauer, l&#039;Arte di insultare_\r\n\r\n\r\nE tra tutti i popoli, in questo esempio, ha scelto di insultare i francesi. Sar&agrave; una coincidenza? (Adam Kadmon docet).\r\n\r\nQuesto solo per dire che il flame indiscriminato verso i francesi non &egrave; qualcosa di nuovo, di anticulturale o razzista ma ci stiamo inserendo in un filone di cultura popolare fondata su centinaia di anni di tradizione.\r\n\r\nA parte questo cappello introduttivo ironico per&ograve;, vorrei ricordare la definizione di &quot;razzismo&quot; secondo il Sabatini Colletti:\r\n\r\n_Ideologia che, fondata su un&#039;arbitraria distinzione dell&#039;uomo in razze, giustifica la supremazia di un&#039;etnia sulle altre e intende realizzarla attraverso politiche discriminatorie e persecutorie._\r\n\r\nQuando qualcuno insulta un francese, in quanto francese, giustifica la supremazia della propria razza in confronto alle altre? Non credo proprio. Si limita a constatare quanto faccia schifo il giocatore francese in questione senza per nulla affermare la supremazia della propria razza (francese, inglese, norvegese, olandese, spagnola, italiana) sulle altre.\r\n\r\nQuando flammiamo i francesi, &egrave; solo perch&eacute; essi tendono ad insultare gli altri giocatori, ritenendosi invece essi stessi superiori a tutti gli altri, utilizzando soprattutto la loro fastidisiosissima lingua madre senza nemmeno scomodarsi ad utilizzare la pi&ugrave; frequentemente e comunitariamente utilizzata lingua inglese. Oltretutto, oltre al loro atteggiamento altezzoso e sprezzante, uniscono tendenzialmente un gioco tremendo ed un atteggiamento che rovina in maniera oggettiva il gioco degli altri giocatori. Voi direte beh, questo atteggiamento si pu&ograve; ravvisare in ogni giocatore di qualunque nazionalit&agrave;. Ragionamento legittimo, ma qui entra in gioco la statistica e vorrei soffermarmi su due punti fondamentali:\r\n1) Ogni giocatore, di qualunque nazionalit&agrave;, all&#039;interno del server EUW, se non &egrave; francese, i francesi li disprezza in quanto giocatori estremamente scarsi o tossici (e questo &egrave; un dato di fatto).\r\n2) Se gi&agrave; non ha autonomamente sviluppato il pensiero di cui al punto 1, se glielo si fa notare, effettivamente nota che i francesi fanno cagare.\r\n\r\nE purtroppo questi due punti sono universalmente vero, e se chi sta leggendo pensa il contrario sta semplicemente mentendo a se stesso sapendo di mentire. \r\n\r\nQuindi signori miei, la questione &egrave; puramente statistica, ed essendo la statistica una scienza che universalizza la tendenza espressa dai dati possiamo fare questo ragionamento:\r\n\r\nLa statistica dice, lo sappiamo tutti, e ci sono fior fiore di articoli scientifici che lo dimostrano, che il fumo causa il tumore ai polmoni. Questa conclusione &egrave; nata da tutta una serie di studi caso-controllo o di coorte che hanno studiato l&#039;esposizione al fumo di tabacco e l&#039;insorgenza di carcinomi polmonari e la frase che sintetizza il fenomeno l&#039;abbiamo gi&agrave; detta &quot;il fumo di sigaretta causa il tumore ai polmoni&quot;. E&#039; una verit&agrave; statistica. Ci&ograve; vuol forse dire che ogni sigaretta fumata causa nel fumatore un tumore ai polmoni? No, o la popolazione mondiale sarebbe interamente, o quasi, affetta da carcinoma ai polmoni.\r\nAnalogamente, e con rigore scientifico, per statistica possiamo dire che:\r\n\r\nse su 100 giocatori francesi 80 fanno cagare, possiamo generalizzare la questione e dire, con pieno rigore scientifico e pieno diritto, che i francesi, dal punto di vista di giocatori di LoL, fanno cagare. \r\nAllo stesso tempo, come ho precedentemente argomentato, non si pu&ograve; dire che un atteggiamento del genere sia razzista perch&eacute;, con tale enunciato, ci limitiamo a constatare una verit&agrave; statistica, e quindi oggettiva, senza per nulla sottolineare la superiorit&agrave; delle altre razze su quella franca.\r\n\r\nTutto qua.","replies":[{"poster":"BIuePaw","date":"2016-08-13T13:58:58.787+0000","up_votes":2,"down_votes":0,"body":"Concordo con l'intero post, molto elaborato, e i commenti, posso aggiungere che per 3 anni scolastici, ho partecipato per mesi e mesi a PON, Erasmus e robe varie fatte in Francia, ed ho avuto a che fare con molti ragazzi francesi, visto che la maggior parte dei giocatori sono ragazzi\nLe opinioni di tutti (me e di alcuni compagni di classi e partecipanti) risultano le stesse, arroganti, puzzolenti e nazionalisti\nIn gioco lo stesso, oltre ad essere molto, molto probabilmente la community più tossica d'Europa (evitare i classici \"dove sono le statistiche?\" perché è ciò che sono e ciò rimarranno, o vogliono far sembrare agli altri\nGioco dalla Season 1, e mi è capitato molto raramente che ci sia un francese \"simpatico\", e quella volta che c'era, era solo perché il team aveva giocato bene, ogni parola ti rispondono in modo arrogante nella loro lingua ovviamente (definirli ignoranti è dire poco), insultando o semplicemente spammando il classico \"tg\" ovvero lo \"stfu\" in inglese\nRazzista? Beh, come ha detto anche chi ha scritto il post, NO. Verità statistiche, oggettive. \nMa se molti non condividono questa cosa del razzista, che dire, felicemente razzista, di certo non mi nascondo su una falsa personalità che molti assumono per sembrare più intelligenti dicendo che il razzismo è sbagliato, ci dobbiamo volere tutti bene, siamo tutti fratelli e cazzate che non avranno mai importanza.\nIl giocatore francese, o addirittura la persona stessa, è considerata così da pressoché tutti, non solo dagli italiani\nCapita quasi sempre che ci si trovi un francese nel team che flamma (si, ci sono anche italiani, e altri che flammano, ma sicuramente in quantità ampiamente inferiore) e ci sia un altro membro del team che dice \"he is french\", proprio appunto per far capire a tutti che tipo di persona è.\n\n> 1) Ogni giocatore, di qualunque nazionalità, all'interno del server EUW, se non è francese, i francesi li disprezza in quanto giocatori estremamente scarsi o tossici (e questo è un dato di fatto).\n2) Se già non ha autonomamente sviluppato il pensiero di cui al punto 1, se glielo si fa notare, effettivamente nota che i francesi fanno cagare.\nE purtroppo questi due punti sono universalmente vero, e se chi sta leggendo pensa il contrario sta semplicemente mentendo a se stesso sapendo di mentire.","replies":[]},{"poster":"Re Tarik ","date":"2016-08-13T07:13:37.370+0000","up_votes":1,"down_votes":0,"body":"Che tu sia una persona intelligente lo si evince dal modo in cui hai trattato l'argomento, sviluppandone ogni punto in maniera esaustiva e dandone una visione oggettiva sul tema dei francesi. Vogliamo parlare, mantenendoci sul profilo storico, di quando si diedero alla fuga dopo l'invasione nazista? Fuggendo in Gran Bretagna lasciando il loro paese alla deriva, o di come ai giorni nostri siano remissivi e sottomessi ai musulmani? Ritornando su LoL, la maggior parte dei report li ho beccati da 3/4 premade francesi, sarà un caso? Per non parlare del fatto che se gli scrivi magari \"builda armor per favore il loro team non ha ap\" ti rispondono con un bellissimo \"tg nique ta mere\". Io spero che la Riot un giorno possa fare un server francese, dedicato unicamente a questi abomini del mondo del web.","replies":[{"poster":"Ardak Solinar","date":"2016-08-13T10:59:25.036+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Re Tarik ,realm=EUW,application-id=MJVj50Jw,discussion-id=lWfYsifn,comment-id=0006,timestamp=2016-08-13T07:13:37.370+0000)\n>\n> Che tu sia una persona intelligente lo si evince dal modo in cui hai trattato l&#x27;argomento, sviluppandone ogni punto in maniera esaustiva e dandone una visione oggettiva sul tema dei francesi. Vogliamo parlare, mantenendoci sul profilo storico, di quando si diedero alla fuga dopo l&#x27;invasione nazista? Fuggendo in Gran Bretagna lasciando il loro paese alla deriva, o di come ai giorni nostri siano remissivi e sottomessi ai musulmani? Ritornando su LoL, la maggior parte dei report li ho beccati da 3/4 premade francesi, sarà un caso? Per non parlare del fatto che se gli scrivi magari &quot;builda armor per favore il loro team non ha ap&quot; ti rispondono con un bellissimo &quot;tg nique ta mere&quot;. Io spero che la Riot un giorno possa fare un server francese, dedicato unicamente a questi abomini del mondo del web.\n\nSe riusciremo a raccogliere abbastanza consensi, si potrebbe pensare di chiedere un referendum alla riot per splittare il server EUW, in uno EUW e in uno a parte Francese, non è la prima volta che ho sentito proporre questa idea.","replies":[{"poster":"Ziovi","date":"2016-08-13T17:42:31.526+0000","up_votes":1,"down_votes":0,"body":"Questa, amico mio, è l'idea più bella che io abbia sentito da molto tempo a questa parte.","replies":[]},{"poster":"Re Tarik ","date":"2016-08-13T11:34:52.074+0000","up_votes":1,"down_votes":0,"body":"Io sono pronto a firmare e sono sicuro che come me tanti altri. Purtroppo la riot non lo farà mai, motivo per cui penso di trasferirmi con l'account in turchia o brasile. (sono esenti da francesi)","replies":[]}]}]},{"poster":"vlakius","date":"2016-08-12T22:52:43.185+0000","up_votes":2,"down_votes":0,"body":"Trovo la tua opinione decisamente interessante, molto elaborata e decisamente ben argomentata ma tuttavia in quanto amante della logica ci sono alcuni passaggi che non condivido.\nPartiamo dal presupposto che sono una persona che non ha una grande simpatia nei confronti del popolo francese (per usare un eufemismo). Abito in Piemonte e molto spesso ho a che fare con clienti francesi per lavoro e posso confermarti che la GRAN PARTE rispecchia esattamente quello che ci si aspetterebbe da un francese:\narroganza sopra ogni limite, nazionalismo estremizzato all'inverosimile soprattutto quando si parla della lingua. Faccio il sistemista/programmatore e un cliente ha avuto il coraggio di chiamarmi e protestare perchè il nostro gestionale aveva la scritta \"password\" come usa tutto il mondo anziché \"mot de passe\". Ti do ragione quindi quando dici che la mentalità comune della gente è quella che i francesi sono un popolo a dir poco antipatico. \nLa mentalità però spesso non si basa su dati oggettivi ma su esperienze personali o di altre persone, educazione , mass media e storia. \nLa statistica, che invece è un dato oggettivo in quanto matematico, non può essere utilizzata nel sostenimento della tesi dal momento che non esiste nessuna analisi statistica che determini che i francesi giocano peggio di chiunque altro. L'unico dato certo è il pensiero che accomuna i giocatori.. però proviamo a riflettere in maniera logica:\nDiciamo che su 100 giocatori non francesi 80 provano antipatia verso di loro. Dunque avremo l'80 % della popolazione che è particolarmente sensibile alla presenza di un francese nel team. Ciò significa che nel momento in cui ci si troverà un francese flammone e feeder in team l'80% delle persone a cui è capitato ricorderà con particolare disprezzo quel giocatore non perché fosse peggio di altri ma perché era francese. Aggiungiamo inoltre il fatto che la popolazione che odia i francesi rappresenta la maggioranza e a che a tutti capita prima o poi di trovarne uno e lamentarsi o sentire altri lamentarsi della loro esperienza ed ecco che l'idea che la maggior parte dei francesi è scarsa e flammona è pronta.\n\nLa conclusione di questo mio ragionamento è la seguente : I francesi non sono più scarsi degli altri.. sono solo più odiati dalla maggior parte delle persone e per questo ne sentiamo parlare di più rispetto a inglesi, tedeschi, rumeni, russi, e italiani generando di conseguenza l'idea che la maggior parte di loro non sappia giocare","replies":[{"poster":"Ardak Solinar","date":"2016-08-13T06:42:55.240+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=vlakius,realm=EUW,application-id=MJVj50Jw,discussion-id=lWfYsifn,comment-id=0003,timestamp=2016-08-12T22:52:43.185+0000)\n>\n> Trovo la tua opinione decisamente interessante, molto elaborata e decisamente ben argomentata ma tuttavia in quanto amante della logica ci sono alcuni passaggi che non condivido.\n> Partiamo dal presupposto che sono una persona che non ha una grande simpatia nei confronti del popolo francese (per usare un eufemismo). Abito in Piemonte e molto spesso ho a che fare con clienti francesi per lavoro e posso confermarti che la GRAN PARTE rispecchia esattamente quello che ci si aspetterebbe da un francese:\n> arroganza sopra ogni limite, nazionalismo estremizzato all&#x27;inverosimile soprattutto quando si parla della lingua. Faccio il sistemista/programmatore e un cliente ha avuto il coraggio di chiamarmi e protestare perchè il nostro gestionale aveva la scritta &quot;password&quot; come usa tutto il mondo anziché &quot;mot de passe&quot;. Ti do ragione quindi quando dici che la mentalità comune della gente è quella che i francesi sono un popolo a dir poco antipatico. \n> La mentalità però spesso non si basa su dati oggettivi ma su esperienze personali o di altre persone, educazione , mass media e storia. \n> La statistica, che invece è un dato oggettivo in quanto matematico, non può essere utilizzata nel sostenimento della tesi dal momento che non esiste nessuna analisi statistica che determini che i francesi giocano peggio di chiunque altro. L&#x27;unico dato certo è il pensiero che accomuna i giocatori.. però proviamo a riflettere in maniera logica:\n> Diciamo che su 100 giocatori non francesi 80 provano antipatia verso di loro. Dunque avremo l&#x27;80 % della popolazione che è particolarmente sensibile alla presenza di un francese nel team. Ciò significa che nel momento in cui ci si troverà un francese flammone e feeder in team l&#x27;80% delle persone a cui è capitato ricorderà con particolare disprezzo quel giocatore non perché fosse peggio di altri ma perché era francese. Aggiungiamo inoltre il fatto che la popolazione che odia i francesi rappresenta la maggioranza e a che a tutti capita prima o poi di trovarne uno e lamentarsi o sentire altri lamentarsi della loro esperienza ed ecco che l&#x27;idea che la maggior parte dei francesi è scarsa e flammona è pronta.\n> \n> La conclusione di questo mio ragionamento è la seguente : I francesi non sono più scarsi degli altri.. sono solo più odiati dalla maggior parte delle persone e per questo ne sentiamo parlare di più rispetto a inglesi, tedeschi, rumeni, russi, e italiani generando di conseguenza l&#x27;idea che la maggior parte di loro non sappia giocare\n\nla tua analisi è giusta e a dir la verità avevo rifletutto anche sul punto che sostieni tu (cioé che la gente parta pervenuta e già odia i francesi quindi si ricorda maggiormente il giocatore scarso).\n\nHo però testimonianza diretta, e non mi sto inventando il dato, di persone amiche mie (fidanzata di mio fratello nello specifico) che hanno avuto una particolare esperienza. \nLa ragazza in questione ovviamente ha iniziato a giocare perché vedeva giocare noi, anche se seguiva il gioco abbastanza distrattamente (e non amava certamente i nostri discorsi in materia del game quindi non sapeva certamente il risentimento che dilaga nella community per il popolo gallico).\nFatto sta che un giorno dice \"vabbè provo a giocare\" e inizia a farsi un account. Si fa qualche game da sola e inizia a passare di livello. Dopo 3 giorni, senza essere influenzata da bias esterni, arriva e ci dice che odia il modo in cui i francesi giocano a LoL. \nCioé non è che uno parta prevenuto, perché come vedi, autonomamente anche senza leggere sui forum o chiaccherando con altre persone (lei giocava da sola) una persona prova sulla sua pelle qual è il tipo di gioco dei francesi e sviluppa in maniera indipendente le proprie idee","replies":[]}]},{"poster":"SickAnto","date":"2016-08-12T21:38:04.951+0000","up_votes":2,"down_votes":0,"body":"> I francesi cucinano male e sono orgogliosi di una cucina povera e sovrastimata (soprattutto dal punto di vista italiano).\n\nIn realtà non è del tutto vero, la cucina francese è molto ricca e varia di piatti di ottima qualità, che poi sia stata un po' sopravalutata è un altro conto, ma nella storia europea in nessun paese c'era una tradizione culinaria, con grandi e famosi chef, come è nata in Francia, per questo veniva considerata la migliore. Quella italiana invece (che ironia della sorte ha fatto nascere proprio quella francese), ha avuto un ritardo per essere conosciuta ed apprezzata in tutto il mondo, per svariati motivi, ma alla fine nei nostri giorni è stata riconosciuta come la migliore cucina in assoluto numerose volte.","replies":[{"poster":"Ardak Solinar","date":"2016-08-12T21:50:46.402+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SickAnto,realm=EUW,application-id=MJVj50Jw,discussion-id=lWfYsifn,comment-id=0002,timestamp=2016-08-12T21:38:04.951+0000)\n>\n> In realtà non è del tutto vero, la cucina francese è molto ricca e varia di piatti di ottima qualità, che poi sia stata un po&#x27; sopravalutata è un altro conto, ma nella storia europea in nessun paese c&#x27;era una tradizione culinaria, con grandi e famosi chef, come è nata in Francia, per questo veniva considerata la migliore. Quella italiana invece (che ironia della sorte ha fatto nascere proprio quella francese), ha avuto un ritardo per essere conosciuta ed apprezzata in tutto il mondo, per svariati motivi, ma alla fine nei nostri giorni è stata riconosciuta come la migliore cucina in assoluto numerose volte.\n\n\nsi si, non dico che abbiano una cucina che fa schifo, anzi, hanno una cucina molto migliore rispetto a molti altri Stati, ma il bello è che loro sono convinti di avercela migliore anche di quella italiana quando invece, come hai giustamente sottolineato, è stata più volte giudicata come la migliore al mondo.","replies":[{"poster":"SickAnto","date":"2016-08-13T11:00:35.126+0000","up_votes":1,"down_votes":0,"body":"Beh. hai affermato questo \n\n>I francesi cucinano male e sono orgogliosi di una -->**cucina povera**<--- e sovrastimata.\n\nE' più o meno sinonimo che faccia schifo, ma ti sarai espresso male credo. Comunque, sono convinti che sia la migliore, perché per cinquecento anni circa (prima che arrivasse Caterina De Medici alla corte, faceva letteralmente schifo) è stata considerata così (come già detto prima). Un po' come gli inglesi che erano convinti di essere i migliori nel calcio ma che a malapena hanno vinto un mondiale (e non in maniera pulita).","replies":[]}]}]},{"poster":"Best Chair Euw","date":"2016-08-12T21:20:50.810+0000","up_votes":2,"down_votes":0,"body":"Anche quei pochi personaggi di rilievo che hanno avuto (che si sono elevati rispetto alla massa di babbuini) sono luigi xiv  (nonna italiana e istruito da il cardinale Mazzarino ...palesemente italiano) e napoleone (nato da genitori italiani e nato un paio di mesi dopo che la Corsica divenisse francese. È francese solo a livello giuridico ma di fatto è tutta farina del nostro sacco). Sono generalmente scarsi, ma in singolo tendono a comportarsi cercando di dare il loro meglio...se ci sono due francesi gg wp. Lefta in champ Select. Uomo avvisato mezzo salvato. \nJajajajajajajajajajaja \nDio vi scampi da questi esemplari","replies":[]},{"poster":"ilsimptico","date":"2016-08-14T12:46:32.479+0000","up_votes":1,"down_votes":0,"body":"Giocheranno pure peggio ma hanno più challenger, mi dispiace ammetterlo","replies":[{"poster":"Keìron","date":"2016-08-14T20:35:18.481+0000","up_votes":1,"down_votes":0,"body":"i francesi su lol sono più degli italiani=più challenger degli italiani.","replies":[]},{"poster":"Ardak Solinar","date":"2016-08-14T13:00:24.742+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ilsimptico,realm=EUW,application-id=MJVj50Jw,discussion-id=lWfYsifn,comment-id=000b,timestamp=2016-08-14T12:46:32.479+0000)\n>\n> Giocheranno pure peggio ma hanno più challenger, mi dispiace ammetterlo\n\nVuol dire che quel 20% che gioca bene, effettivamente gioca molto bene. Ma il discorso statistico di fondo non cambia.","replies":[]}]},{"poster":"Asdarath","date":"2016-08-14T18:13:24.726+0000","up_votes":1,"down_votes":0,"body":"Un mendicante vestito color porpora che si fa scambiare per un re.","replies":[]},{"poster":"JLuke","date":"2016-08-14T11:49:52.442+0000","up_votes":1,"down_votes":0,"body":"Voglio il server di lol FR. XD","replies":[{"poster":"Ardak Solinar","date":"2016-08-14T12:59:57.072+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Drop The Resets,realm=EUW,application-id=MJVj50Jw,discussion-id=lWfYsifn,comment-id=000a,timestamp=2016-08-14T11:49:52.442+0000)\n>\n> Voglio il server di lol FR. XD\n\nConcordo","replies":[]}]},{"poster":"uFere","date":"2016-08-14T10:20:15.715+0000","up_votes":1,"down_votes":0,"body":"Concordo appieno, i francesi sono i primi a flammare, anche per il first blood, non ne nego l'importanza, ma non credo che uno si faccia molti amici se flamma nei primi 3 minuti. Certo, mi è capitato di trovare francesi che hanno carryato intere partite perse, alcuni erano simpatici, altri piuttosto che flammare facevano del proprio meglio per risollevare la partita, li ho sempre onorati a fine partita perché se lo meritavano, ma ultimamente becco solo flamers incalliti e feeders di ogni tipo, quasi sempre francesi, non voglio dare contro a una intera nazione solo perché la maggior parte non sa' giocare, ma dai, se stanno feedando, abbiano almeno la decenza di non flammare","replies":[]},{"poster":"Subundu","date":"2016-08-13T14:18:57.245+0000","up_votes":1,"down_votes":0,"body":"Anni fa sono stato per qualche tempo in Francia, ospite di una famiglia.\n\nAl posto del formaggio davano il burro.\n\nAl posto della frutta lo yogurt.\n\nPer non parlare del souffle.\n\nIn strada, ad un mio amico hanno scippato la sigaretta.\n\nTrovo quindi i vostri commenti perbenisti e benpensanti.","replies":[]},{"poster":"GreenInch","date":"2016-08-13T07:03:11.043+0000","up_votes":1,"down_votes":0,"body":"Guarda....hai vinto solo per come l hai esposto...per il resto...bhe so statistiche u.u","replies":[]},{"poster":"oroora6","date":"2016-08-12T23:42:32.234+0000","up_votes":1,"down_votes":1,"body":".\n.\n.\n.\ni\navevi detto di non mettere i puntini sulle i, io l ho fatto perchè sono trasgry\nscherzi a parte, voto a favore del server unicamente francese ed il distacco fisico del loro territorio dal continente eurasiatico\n##FateDellaFranciaUnIsola","replies":[]},{"poster":"ZZALA","date":"2016-08-12T21:28:00.136+0000","up_votes":1,"down_votes":1,"body":"Mi trovo in accordo su tutto +1\nA me hanno cancellato un commento gli admin / mods perché ho scritto zecche francesi , io ho il mio odio verso i francesi non solo perché un avversario in una partita di basket mi ha volutamente , sottolineo volutamente , rotto il piede perché li stavamo rektando ed era francese e anche per altri motivi , ma per i motivi da te elencati .","replies":[]}]}