{"poster":"TSM Superman","date":"2017-10-02T09:33:04.407+0000","title":"False Banned : No Reform Card/No Email","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"So, I was playing a game and came into a troll pre-made. They'd constantly bait me and let me die and say I was int'ing and constantly spam that I was AFK in /All chat when I wasn't. It got to the point they were telling the enemy team I was calling them the N-Word and asking them to report me. At the time I wasn't too worried because not once in the game I was toxic/racist/intentional feeding or afk. I never said anything but a few fair criticisms like \"You're not mid you're adc\" \"you can tell you were adc because you're lined up with jhin\" (he was ADC Azir) I know it seems sketchy because there's 2 sides to every argument and i have been toxic before and was given fair chat restrictions but I honestly believe nothing I did in this game warranted this ban. Now when I log in it tells me I'm banned and to re log to see reform card. I've re logged several times and am unable to see reform card and I haven't received any email about my ban.","replies":[{"poster":"Broporo","date":"2017-10-02T21:09:28.742+0000","up_votes":2,"down_votes":0,"body":"The chat you're referring to may not have been extremely toxic or over the top, it wasn't just that one chat that equaled this ban. There were other chats that were worse than this one, and if you didn't get the chance or didn't read the reform card you can hit us up in a [**ticket**](https://support.riotgames.com/hc/en-us/requests/new) to get the full details.","replies":[{"poster":"TSM Superman","date":"2017-10-03T02:16:30.266+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Broporo,realm=NA,application-id=osqw6G4M,discussion-id=AXGwMzac,comment-id=0000,timestamp=2017-10-02T21:09:28.742+0000)\n>\n> The chat you&#x27;re referring to may not have been extremely toxic or over the top, it wasn&#x27;t just that one chat that equaled this ban. There were other chats that were worse than this one, and if you didn&#x27;t get the chance or didn&#x27;t read the reform card you can hit us up in a [**ticket**](https://support.riotgames.com/hc/en-us/requests/new) to get the full details.\n\nI don't believe that's fair because I honestly don't believe I did ANYTHING in the game I got banned for that could even warrant a report. When you read the chat log you can see they bait the enemy team into reporting me lying and saying I was calling them the N-Word and throughout the entire game harassing me. I was not toxic in anyway shape or form and it is true that I have been toxic in previous games but I got my chat restriction and played through it. I honestly felt like the chat restrictions worked and I tried to be as upbeat and positive toward my team as I could. I strongly encourage you to read the entire chat and see that nothing I said or did warranted a ban. I understand having a bad track record doesn't help my case but this would fall under double jeopardy if I didn't do anything that's reportable.","replies":[]}]}]}