{"poster":"Kreizz","date":"2016-11-05T20:58:50.321+0000","title":"A lo que llega la toxicidad","subforum":"Comportamiento del jugador","up_votes":17,"down_votes":4,"body":"me paso recien y es cada vez mas frecuenta que llega a ser un chiste, jugue una ranked y fui jg con amumu y me salio una cassio mid aliada entonces le puse carpa para que se fedeara y todo bien nos garchamos a todo el team ibamos muy bien pero no podiamos cerrar la partida entonces recurri a hacer baron todos ayudando menos la cassiopeia que se iba sola 1 vs 5 a conseguir kills no podiamos sacar baron por mas que tratabamos porque siempre se moria tirandose sola entonces yo le digo con las mismas palabras &#039;&#039;cassio deja de tirarte sola y ayudanos pls&#039;&#039; en ese momento se vuelve loco y se pone a flamear y tira surrender obviamente todos pusimos que no y al final hize que nos pegaramos los 5 a la cassio para obligarla a ir acompa&ntilde;ada y al final ganamos y luego tiene el descar de decir &#039;&#039;report amumu flamer&#039;&#039; spameandolo como loco . O sea a que nivel de da&ntilde;o neuronal llegan? como se calientan porque les piden una cosa de buena manera , tirar surrender flamear solo porque les dicen eso? no creen que ya es mucho ya? te creo haberle insultado o algo pero no puede ser que ahora aca se calientan solo porque les pides un favor ya es mucho ya","replies":[{"poster":"OG uwusaurio","date":"2016-11-05T22:08:42.632+0000","up_votes":12,"down_votes":1,"body":"Es algo normal de una persona asquerosamente orgullosa, y se vive hasta en el día a día cuando no puede aceptar que cometió un error.\nReportala al final de la partida y ya recibirá su sanción.\nPD: Guarda su nombre para venir a reírte de él cuando ponga su crypost en el foro! (Si lo he hecho) El que ríe último ríe mejor!","replies":[{"poster":"FliZzeRr","date":"2016-11-07T03:55:43.433+0000","up_votes":1,"down_votes":0,"body":"¿Tú crees? Me reportaron unos pre-mades flammers y termine baneado 2 días antes de terminar la season...","replies":[{"poster":"OG uwusaurio","date":"2016-11-07T12:21:04.274+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FliZzeRr,realm=LAS,application-id=PJAKt7ph,discussion-id=nJdyMLJJ,comment-id=00030000,timestamp=2016-11-07T03:55:43.433+0000)\n>\n> ¿Tú crees? Me reportaron unos pre-mades flammers y termine baneado 2 días antes de terminar la season...\n\nNo pudiste contenerte y te volviste como ellos... le devolviste insultos y demás.\n¿Ya sabes el motivo de tu baneo?","replies":[]}]}]},{"poster":"Zero Fox","date":"2016-11-06T01:12:29.661+0000","up_votes":4,"down_votes":0,"body":"Al terminar la partida lo reportas y listo, otra cosa no podes hacer, hay muchos niños rata que no entienden de buena manera cuando intentas ayudarlos.","replies":[{"poster":"Skgwet","date":"2016-11-06T05:16:03.274+0000","up_votes":2,"down_votes":0,"body":"igual nadie reporta...decis Reporten X y nadie hace nada...con un reporte no lo suspenden...","replies":[{"poster":"Zero Fox","date":"2016-11-06T05:48:36.097+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Marty Friiedman,realm=LAS,application-id=PJAKt7ph,discussion-id=nJdyMLJJ,comment-id=00060000,timestamp=2016-11-06T05:16:03.274+0000)\n>\n> igual nadie reporta...decis Reporten X y nadie hace nada...con un reporte no lo suspenden...\n\nCon un solo reporte no, pero con la acumulación de estos,  tarde o temprano el ban le llega, la herramienta para defenderte esta, hay que usarla, el problema que todos quieren soluciones y sanciones instantáneas y no se puede así. Hay que reportar y tener paciencia.","replies":[]}]}]},{"poster":"Takkar07","date":"2016-11-05T21:03:04.364+0000","up_votes":4,"down_votes":1,"body":"**Como este tipo de gente te vas a cruzar en todos lados, debe haber peores, no le hagas mas carpa a nadie por que siempre que fedean a uno la quieren manejar por su cuenta a la partida y ellos quieren dar las reglas, una pena.\nAl menos ganaste {{sticker:slayer-pantheon-thumbs}} **","replies":[]},{"poster":"BiXe","date":"2016-11-05T21:16:03.493+0000","up_votes":2,"down_votes":0,"body":"A mi me toco un alistar con complejo de soraka, que estaba atras del ADC y un Viktor con ignite en contra de Orianna que no subio el nucleo hasta que le tiraron la segunda torre ... En toda la partida no hizo caso a las señales y tampoco respondia a nada de lo que le pedia. \n\nEn mi cabeza tenia ganas de entrar con un colectivo lleno de helados a su casa, pero bueno no dije nada y me resigne sabiendo que es sábado y hay más gente que entra a rankeds sin saber lo que está haciendo ... Prefiero tirar otra partida más e intentar ganar con gente más o menos, antes que gente que no sabe lo que está haciendo","replies":[]},{"poster":"ZanahoriaAsesina","date":"2016-11-05T21:06:01.209+0000","up_votes":2,"down_votes":0,"body":"> Pregunta: ¿La insultaste durante la partida?\n\n---------------------------------------------------\n\n> \"no , de hecho todo lo que dije en ese game fue varios ''gj'' y lo unico que le dije a cassio fue que se dejara de tirar sola y que ayudara como sale ahi\"\n\nY bueno, entonces ignórala y fin de la historia, no gastes tu tiempo en ese tipo de personas y no dejes que te afecten, además no las vas a encontrar solo en el LoL, te vas a encontrar con este tipo de personas en el colegio, en trabajo, en la calle, etc, por eso mismo recorda lo siguiente  \"a palabras necias, oídos sordos\" \n\nSuerte (:","replies":[]},{"poster":"Exit","date":"2016-11-06T14:44:30.166+0000","up_votes":1,"down_votes":0,"body":"es asi la mentalidad de acá papu","replies":[]},{"poster":"empa","date":"2016-11-05T23:19:52.673+0000","up_votes":1,"down_votes":0,"body":"Me gustó mucho tu post. Te dejo 100 ms de arnet y las \"mejoras\" de riot.","replies":[]},{"poster":"Uli con azúcar","date":"2016-11-05T23:34:27.986+0000","up_votes":1,"down_votes":6,"body":"Y más bien que se va a madear. Cómo le vas a escribir \"pls\"? Si se lo decías sin esas tres letras que delatan un retraso importante, te aseguro que esa Cassio te respondía \"yes, my lord\" y hacía lo que sea que le pidieras","replies":[]}]}