{"poster":"ZNShadovv","date":"2016-04-05T07:02:27.200+0000","title":"wieder mal ein Beispiel für RIOT's ausgewogenes Gameplay","subforum":"Ligen & gewertete Spiele","embed":{"description":"Einfach Bilder oder Fotos kostenlos hochladen bei Pic-Upload. Leicht und bequem Bild oder Foto hochladen.","url":"http://www.pic-upload.de/view-30260771/game.jpg.html","image":"http://www2.pic-upload.de/img/30260771/game.jpg"},"up_votes":1,"down_votes":15,"body":"Es nervt mich tierisch wenn ich solche Team Zusammenstellung bekomme!\r\n\r\nToll das es nach MMR geht. Und wie man sieht hat die MMR **eines **Platin Gamers das ganze Spiel bestimmt.\r\n\r\n21/3/6 und seine eigene Aussage das er letzte Season Platin 1 war!\r\n{{sticker:zombie-brand-facepalm}} {{sticker:zombie-brand-facepalm}} {{sticker:zombie-brand-facepalm}} \r\n\r\nJa RIOT gut gemacht das macht echt Spa&szlig;\r\n\r\nZN","replies":[{"poster":"HyperionCH","date":"2016-04-05T08:02:54.727+0000","up_votes":2,"down_votes":2,"body":"Man muss aber auch sagen, dass der Gegner 2 Bronze-Spieler hatten, die gegen Silber-Gegner ihre Lane klar gewannen. \nDass du als Vel-\"Sup\" (falls man dies Support nennen kann) doch recht viel Farm hattest, half deinem ADC jetzt auch nicht wirklich, denke ich.\nEuch fehlte es reichlich an CC und der fehlende Tank spürte man sicherlich auch. Da kann eine Eve auch einfach durchrennen und DMG draufhauen.\n\nIch habe öfters in Normals gegen Platin gespielt und auch nicht selten gewann unster Team.\nWarum? Weil ich vor dem Spielstart nicht schaue, welche Rankings die Gegner haben. Was soll dies denn bringen?\n\nGab auch schon ein Normal, in dem ich meinem Jgl-Premade sagte, dass mein Gegner auf der Midlaner nichts drauf hatte und easy Kill wäre (obwohl es LB war und somit sehr mobil). Der Gegner war jedoch Platin. OK, er spielte jetzt nicht mit seinem Main-Champ. Ich denke jedoch, hätte ich gewusst, dass der Gegner mehr als eine ganze Liga über mir spielt, hätte ich wohl falsche Entscheidungen getroffen.","replies":[{"poster":"ZNShadovv","date":"2016-04-05T08:16:14.164+0000","up_votes":2,"down_votes":4,"body":">  2 Bronze-Spieler hatten, die gegen Silber-Gegner\n\nBeweis: Matchmaking ist fehlerhaft","replies":[{"poster":"Sirrkas","date":"2016-04-05T08:19:34.707+0000","up_votes":1,"down_votes":1,"body":"Wenn dann beweist es, dass das Matchmaking nicht auf die Rankedplatzierung achten sollte. Schließlich hat Bronze gegen Silber gewonnen, obwohl eigentlich das Gegenteil zu erwarten wäre.","replies":[{"poster":"ZNShadovv","date":"2016-04-05T08:30:41.433+0000","up_votes":2,"down_votes":8,"body":"Ich weiß,\nda du ja als EMISSARY tätig bist musst du bei Kritik immer Pro RIOT schreiben.\n\nAlles klar!\n\nDer Hund beißt halt nicht seinen Herren","replies":[{"poster":"HyperionCH","date":"2016-04-05T08:49:34.598+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=ZNShadovv,realm=EUW,application-id=ip27PlEH,discussion-id=h3lV0X53,comment-id=0002000000000000,timestamp=2016-04-05T08:30:41.433+0000)\n>\n> Ich weiß,\n> da du ja als EMISSARY tätig bist musst du bei Kritik immer Pro RIOT schreiben.\n> \n> Alles klar!\n\nEmissaries üben auch Kritik an Riot; und dies sogar öfter als du denkst.\n\n> \n> Der Hund beißt halt nicht seinen Herren\n\nWas würde denn passieren im Falle eines Emissary?\nEin Emissary würde erst einmal einige Pflichten verlieren (Aufgaben, die sie erfüllen) und die grüne Schrift. Das war es aber auch schon.\n\nIch denke, Riot würde wesentlich mehr verlieren, wenn sie Volonteers wegen sachlicher Kritik rausschmeissen. ;)","replies":[{"poster":"drexxsack","date":"2016-04-05T08:58:17.384+0000","up_votes":4,"down_votes":0,"body":"Funfact: Humpel, einer der bekanntesten Emissaries, hat diesen Titel bekommen, **weil** er Kritik an Riot geübt hat.","replies":[]}]}]}]},{"poster":"SorisDynasty","date":"2016-04-05T08:19:57.006+0000","up_votes":1,"down_votes":0,"body":"Falsch.","replies":[]}]}]},{"poster":"ZNShadovv","date":"2016-04-05T16:37:31.232+0000","up_votes":2,"down_votes":0,"body":"Und die Bestrafung geht weiter\n\nhttp://www.pic-upload.de/view-30265787/NeueBitmap.jpg.html\n\nja sooo Fair","replies":[{"poster":"HyperionCH","date":"2016-04-06T07:59:25.260+0000","up_votes":1,"down_votes":0,"body":"Öhm.... was denn genau? oO","replies":[{"poster":"SorisDynasty","date":"2016-04-06T09:25:31.958+0000","up_votes":1,"down_votes":1,"body":"Das es balanced ist natürlich!","replies":[]}]}]},{"poster":"Chri","date":"2016-04-05T08:15:26.597+0000","up_votes":1,"down_votes":2,"body":"juckt doch kein das warn normal xD","replies":[{"poster":"ZNShadovv","date":"2016-04-05T08:21:55.878+0000","up_votes":2,"down_votes":7,"body":"echt,\n\nna dann in Zukunft Karthus als Support in Normalgames!\n\nUnd feeden was das Zeug hergibt\n\nJuckt doch keinen\n\nDu füge mich als Freund hinzu dann machen wir mal 20 Spiele und dann schreibst du öffendlich wie du das findest wenn ich dann 40x gestorben bin!\nIch glaube das dir das bestimmt mit mir viel spaß machen wird","replies":[{"poster":"Sirrkas","date":"2016-04-05T08:28:10.517+0000","up_votes":3,"down_votes":0,"body":"Also 40 Tode in 20 Spielen sind doch eine gute Leistung.","replies":[]},{"poster":"Chri","date":"2016-04-05T08:52:32.690+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ZNShadovv,realm=EUW,application-id=ip27PlEH,discussion-id=h3lV0X53,comment-id=00030000,timestamp=2016-04-05T08:21:55.878+0000)\n>\n> echt,\n> \n> na dann in Zukunft Karthus als Support in Normalgames!\n> \n> Und feeden was das Zeug hergibt\n> \n> Juckt doch keinen\n> \n> Du füge mich als Freund hinzu dann machen wir mal 20 Spiele und dann schreibst du öffendlich wie du das findest wenn ich dann 40x gestorben bin!\n> Ich glaube das dir das bestimmt mit mir viel spaß machen wird\n\nIch spiel keine normal games weils komplett useless sind xD und wenn juckts mich auch nd wenn ich gewinn will tryhard ich = rankeds","replies":[]},{"poster":"Maíko","date":"2016-04-05T12:55:37.266+0000","up_votes":1,"down_votes":0,"body":"Ich würd's machen....einfach mal um zu gucken wann der Feedbuster einsetzt^^\n\nHätte heute ab 4 Uhr Zeit ;)","replies":[]}]}]},{"poster":"Alustus","date":"2016-04-05T07:52:14.360+0000","up_votes":1,"down_votes":1,"body":"Und wieder einer der nicht versteht:\n\nNormal MMR =/= Rank MMR\n\n{{sticker:zombie-brand-facepalm}} \n\n\nIch kann in der Theorie im Normal eine Bronze MMR haben und im Rank eine Platin/Dia.\n\nBeispiel ich tryharde im Rank immer und in Normalgames spiele ich nur Non Meta probiere neue Strategien/Champs usw.\nWäre das Matchmaking dann fair wenn ich gegen und mit Tryhard Platin/Dia Spielern spielen müsste?, wohl kaum.\n\nOder wie bei diesem Beispiel, dass man Jahre keine Normals gespielt hat, dass da gewisse differenzen entstehen sollte klar sein.\n\n\n\nBtw. ich spiele auch oft gegen Platin/Dia Spieler und bin ein Silber Noob.\nUnd gewinne recht häufig","replies":[{"poster":"ZNShadovv","date":"2016-04-05T08:18:19.236+0000","up_votes":2,"down_votes":2,"body":"> Normal MMR =/= Rank MMR\nBeweis :  Matchmaking ist fehlerhaft\n\n---\n\n\n>Und gewinne recht häufig\nNa dann freue dich \n\nAber ich bin nicht so gut!","replies":[{"poster":"Zulwar","date":"2016-04-05T09:07:55.278+0000","up_votes":1,"down_votes":2,"body":"> Aber ich bin nicht so gut!\n\nDas ist doch auch nicht so schlimm. Denn wenn du verlierst, verlierst du MMR, was wiederum dafür sorgt, das du leichtere Mitspieler und Gegner bekommst.\n\nDeswegen, wenn es zu schwer für dich ist, musst du nur verlieren, dann wird es wieder einfacher und Ausnahmen hat man manchmal.","replies":[{"poster":"Shiggyvara","date":"2016-04-05T10:02:44.160+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Zulwar,realm=EUW,application-id=ip27PlEH,discussion-id=h3lV0X53,comment-id=000100000000,timestamp=2016-04-05T09:07:55.278+0000)\n>\n> Das ist doch auch nicht so schlimm. Denn wenn du verlierst, verlierst du MMR, was wiederum dafür sorgt, das du leichtere Mitspieler und Gegner bekommst.\n> \n> Deswegen, wenn es zu schwer für dich ist, musst du nur verlieren, dann wird es wieder einfacher und Ausnahmen hat man manchmal.\n\nIch dachte wir hätten grade festgestellt, dass ihm der MMR-Verlust nichts bringt, wenn der Platinspieler seit seiner Bronze 3 Normal MMR kein Normal mehr gespielt hat?\nWo hilft es ihm dann MMR zu verlieren, wenn er gegen normale Leute auf seiner MMR eine normale Winrate hat?","replies":[{"poster":"Zulwar","date":"2016-04-05T10:30:49.907+0000","up_votes":2,"down_votes":1,"body":"Er hat sich doch beklagt, das das Matchmaking unfair ist. Wie wir derzeit wissen, hat er ein Problem damit, gegen Leute zu spielen die stärker sind als er oder zumindest eine höhere Platzierung haben, was er begründet hat mit \"Botlane verloren, Spiel gewonnen\".\n\nWenn er das somit nicht möchte, muss er verlieren, damit er in einen Bereich kommt, den er für angemessen hält. Da ist die Winrate egal, denn er soll ja Spaß am Spiel haben.\n\nDas das mit dem Platinspieler eine Ausnahme ist, habe ich ihm ja auch mitgeteilt, was er mit einem scheinbaren gleichgültigem \"Mag sein.\" kommentiert hat.\n\nOb der MMR-Verlust nun was bringt, muss jeder für sich wissen. Wichtig ist halt, das man sich Wohl fühlt. \nWo ich auch selber darüber nachdenke, ob ich mich in meinem Ranking nicht etwas runterplatzieren lasse, damit ich leichtere Mit- und Gegenspieler habe.","replies":[]}]},{"poster":"ZNShadovv","date":"2016-04-05T09:41:47.032+0000","up_votes":1,"down_votes":3,"body":"Mag sein !\nHaben wir gewonnen aber die Botlane haben wir vermasselt!\n\nhttp://matchhistory.euw.leagueoflegends.com/de/#match-details/EUW1/2599877550/205547601?tab=overview\n\nUnd warum : Vayne war Gold 5 wir nur max Silber 5!\n\nUnd dann noch unsere Teammates:  **see: bot feed**\n\nResumee:\n\nDas Team wird unausgewogen zusammengestellt. Dann kommt es auf einer Lane zu häufigen Toden.\nDann wird geflamt ! Dann evtl. wird verbal gegengesprochen bis einem die Linse durchbrennt.\nAnschließend gibt es Report's! Der eine reportet wegen feeden der andere wegen flamen!\n\n**Was ist das für ein S....ß!**\n\nIch glaube das wenn es nur zum größten Teil nach Divisionen gehen würde wären das Matchmaking gerechter. Aber es geht RIOT nicht darum das es ein Ausgewogenes Gamplay gibt sonder nur darum das schnellstmöglich Games zusammengestellt werden. Die über dem Daumen gesehen ausgewogen sind.\n\nWenn einer mal nen guten Tag hat kann er davon nicht profitieren denn er bekommt gleich stärkere Gegner. Wenn es aber nach Divisionen gehen würde dann hätte er längerfristig seinen Erfolg.\n\nEs sollte eine Reportfunktion geben **\"Bad Match making\"**\n\nWer denkt eigentlich an die schwächeren Spieler das diese auch Ihren Erfolg und Spielspaß beibehalten.\nUnd vor allem nicht dauernd angemacht werde wie \"feeder\" oder ähnliches\n\nZN","replies":[{"poster":"Zulwar","date":"2016-04-05T09:53:01.298+0000","up_votes":1,"down_votes":1,"body":"Ok, was stört dich denn jetzt, das ihr die Botlane verloren habt oder das der Gegner Gold war?","replies":[{"poster":"ZNShadovv","date":"2016-04-05T15:31:34.481+0000","up_votes":2,"down_votes":1,"body":"Das der Gegner Gold war \n\nnoch so ein Beispiel ....\n\nhttp://matchhistory.euw.leagueoflegends.com/de/#match-details/EUW1/2600221648/205547601/eog\n\nhttp://www.pic-upload.de/view-30264820/NeueBitmap.jpg.html\n\nJa ich weiß voll Fair und vor allem voll ausgewogen \n\nUnd ZN rege dich nicht auf du darfst deinen Unmut äußern aber nicht öffentlich.\nGeh doch aufs Klo und schrei in die Keramik\n\nIch denke:\nViele von den Durchschnitt Gamer möchten im Gegnerteam voll die Noobs haben.\nDenn wenn sie Ihresgleichen hätten dann würden sie nie über Ihre 50% Winrate kommen.\n\nEs kotzt mich an der madboy","replies":[]}]},{"poster":"HyperionCH","date":"2016-04-05T10:21:44.328+0000","up_votes":1,"down_votes":0,"body":"Abgesehen davon, dass ich persönlich nicht viel von Vel-Koz-Sup halte:\n\n- Hast du dir Gedanken zu deinem Item-Build gemacht?\n\nOK, eure Team-Combo war bereits nicht wirklich toll (zu viel AD).\nDie Gegnerische war jedoch nicht wirklich besser.\n\nWenn eine Vayne so viel Feed hat, dann muss gefälligst ein Frozen Heart gekauft werden. Der Kommandobanner, den du bauen wolltest, bringt rein gar nichts. Da die Gegner viel AD-DMG machen, wird der gebuffte Minion nicht lange überleben.\nMit FH hätte jedoch Vayne 15% weniger Schaden gemacht in TFs. ;)\n\nÜberlege also eher, was du gegen starke Gegner ingame machen kannst.\nDer Vayne-Spieler war stark, das stimmt. Er konnte es aber auch (fast) ausnutzen, dass u.a. du bezüglich Itembuild falsche Entscheidungen getroffen hast.","replies":[]}]}]},{"poster":"Alustus","date":"2016-04-05T10:11:51.208+0000","up_votes":1,"down_votes":1,"body":"Fehlerhaft würde ich nicht unbedingt sagen.\nEher \"fehleranfällig\" wobei es ja rein objektiv gesehen kein Fehler ist sondern eine Schwachstelle die man lieber in kauf nimmt als die Schwachstelle die man öffnen würde wenn Rank und Normal MMR identisch wären.\n\nWie schon gesagt gibt es eben Spieler die in Normalgames stark unter ihren Möglichkeiten spielen, da sie dort nur neue Champs usw. testen.\nWenn man diese jetzt nach Rank MMR spielen lassen würde, wäre das ganze unausgeglichener als wenn man den Normal MMR wert verwendet.\n\n\nIch kann deinen Frust verstehen dennoch würde ich das System ausgewogen nennen.\nWenn du wirklich zu ausgeglichen spielen möchtest musst du Rank spielen, in normal Games gibt es viel mehr dinge welche das Matchmaking unausgewogen machen können.\nAlleine schon die ganzen Premades von unterschiedlichste MMR kann man nicht zu 100% fair machen.\n\nDas geht zwar auch im Rank nicht, aber da ist es leichter möglich weil die Spieler dort auch mit einer anderen Einstellung spielen und es auch keine Premades aus Bronze/Diamant zusammensetzungen gibt.\n\nKlar könnte man das im Normal auch machen nur ich denke nicht das die Community glücklich drüber wäre, wenn sie nicht mehr mit RL freunden spielen können weil sie elo technisch zu unterschiedlich sind.\nImmerhin sollte man nicht vergessen das Normal Games der Fun Modus ist und nicht der Tunier/Rank Modus wo die Leistungen im Vordergrund stehen.","replies":[]}]}]},{"poster":"Sirrkas","date":"2016-04-05T07:22:11.648+0000","up_votes":2,"down_votes":1,"body":"Und ich armer, aktuell Silber 2 platzierter Spieler, hatte 3 Platin 2er als Gegner. Wir haben aber in knapp 21 Minuten gewonnen. \n\nhttp://www2.pic-upload.de/img/30260957/WenjucktdieWertung.png\n\nWie wäre es, wenn du weniger auf die Platzierung achtest und einfach versuchst dein Bestes zu geben? Vor allem bei einem Normal verstehe ich nicht, was man sich so darüber aufregt.\n\nEinmal abgesehen davon, erklärt dir doch sogar schon dein Gegner, warum du gegen Platin antreten darfst. Wenn der Spieler über Jahre hinweg nur Rankeds spielt und damals auf Silberniveau in Normal und Ranked war und sich zu Platin gemausert hat, steigt seine Normalwertung nicht einfach ohne weiterzuspielen.","replies":[{"poster":"ZNShadovv","date":"2016-04-05T08:13:13.893+0000","up_votes":2,"down_votes":4,"body":"> und einfach versuchst dein Bestes \n\nDu bist also der Meinung das ich nicht mein Bestes gebe?\n\nSorry, ich bin nicht so GUT wie du der 2 Platin als Silberling carrid!\n\nWenn ich also Bronze 5 bin dann möchte ich auch gegen die Spielen.\nIch möchte nicht in meinem Gegnerteam ehemals Platin 1 haben.\n\nDer Grund ist einfach! Der ist so stark und ich so schwach \nHast du das Verstanden. Ich kann mit meinem Können nicht mithalten!\nIst das jetzt eindeutig klar angekommen!\n\nUnd aus diesem Grund finde ich das Matchmaking \n\nUnfair, Fehlerhaft, Schlecht usw. \n\nZN","replies":[{"poster":"SorisDynasty","date":"2016-04-05T08:19:08.122+0000","up_votes":2,"down_votes":1,"body":"Es gibt aber wirklich einen Tipp, den man beherzigen soll: Wenn es dich stört, gegen stärkere Spieler zu spielen, schau vorher **nicht** nach, was für Rankings deine Gegner haben. Das wird dein Spiel unweigerlich beeinflussen und du spielst vielleicht verängstigter als du es sonst getan hättest.\nDein Spiel war ein Normal. Deine Gegner müssen also nicht mal zwangsweise ihre Mainlane spielen. Damit sind sie offener für Fehler als normal.","replies":[{"poster":"ZNShadovv","date":"2016-04-05T08:32:41.949+0000","up_votes":2,"down_votes":1,"body":"ich habe im Nachhinein Nachgeschaut!\n\nWeil ich unvoreingenommen ins Game gehe","replies":[{"poster":"SorisDynasty","date":"2016-04-05T08:36:30.766+0000","up_votes":1,"down_votes":1,"body":"Na und? Dann ist es doch egal, was er war. Das Spiel ist vorbei. Es hat gar keine Relevanz mehr für dich, außer das es dich potentiell nervt. Solche Stats hätte auch ein snowballender Silber-Spieler haben können.","replies":[]}]}]},{"poster":"HyperionCH","date":"2016-04-05T09:02:28.437+0000","up_votes":1,"down_votes":0,"body":"Die Frage hast du jedoch nicht beantwortet.\n\nJa, der Spieler ist stärker.\nAber seine Mates sind - zumindest nach dem Ranking - schwächer.\n\nEin Jungler kann nicht überall auf den Lanes ganken (auch keine Rek'Sai). Trotzdem habt ihr alle 3 Lanes sehr klar verloren. Es lag also keineswegs nur am gegnerischen Jungler.","replies":[]}]}]},{"poster":"Skrillerman","date":"2016-04-07T22:57:41.408+0000","up_votes":1,"down_votes":0,"body":"Kenne ich.\n\nMusste mit nem Full SIlber/Gold Team gegen eine Master Jinx spielen","replies":[]},{"poster":"Deadly Evil","date":"2016-04-05T13:28:00.490+0000","up_votes":1,"down_votes":0,"body":"Vielleicht wurden auch einfach nur zu wenig Pink Wards gesetzt. Gerade gegen Eve ist es enorm wichtig, viel und richtig zu warden.","replies":[]},{"poster":"Pure Cynicism","date":"2016-04-05T10:48:10.615+0000","up_votes":1,"down_votes":0,"body":"Riot könnte sicherlich das Matchmaking so anpassen, dass sich 10 Spieler mit exakt derselben MMR zusammenfinden. Aber will man für ein Normal wirklich so lange warten, bis man so ein Team hat?\nAber selbst dann ist es nur oberfächlich betrachtet ausgewogen. Wenn meine MMR zB bei X liegt, dann liegt allenfalls meine Supp-Rolle auf dieser MMR. Wenn ich Top und Adc spiele, bin ich deutlich stärker, würde also vermutlich meine Lane stompen, falls der Gegner nicht auch zufällig Main Top oder Adc ist. In Normals spielt man aber doch eher mal andere Positionen als im Ranked. Wenn ich dagegen Jungle oder Mid spiele, wäre es /ff 20. Siehst du das Problem? Es bringt schon nichts, an stumpfen Zahlen festzuhalten, wenn man auf völlig unterschiedlichen Positionen eingesetzt wird.\n\nNa klar könnte das System auch noch die Rolle miteinfließen lassen - aber dann kann man wohl am Tag 1 Match machen, die restliche Zeit hockt man in der Queue. Und ab Dia+ bräuchte man sich gar nicht mehr für ein Normal anmelden.","replies":[{"poster":"Zulwar","date":"2016-04-05T10:52:20.563+0000","up_votes":1,"down_votes":0,"body":"> Und ab Dia+ bräuchte man sich gar nicht mehr für ein Normal anmelden.\n\n:D. Den finde ich gut.","replies":[]}]},{"poster":"Laufea","date":"2016-04-05T09:52:57.936+0000","up_votes":1,"down_votes":1,"body":"Hab als bronzie regelmäßig Gold oder Silber in normals als gegner oder mates. \n\nZeigt das ich in normals halt infach bessere teams habe oder einfach besser spiele als in ranked.\n\nJuckt mich aber auch wenig, es ist ein normal :)","replies":[{"poster":"Alustus","date":"2016-04-05T12:15:13.069+0000","up_votes":1,"down_votes":1,"body":"Oder das die Gold Silber spieler in normals schlechter gespielt haben","replies":[{"poster":"Laufea","date":"2016-04-06T06:55:38.665+0000","up_votes":1,"down_votes":1,"body":"Oder so :)","replies":[]}]}]},{"poster":"Good Guy Putin","date":"2016-04-05T12:24:27.938+0000","up_votes":1,"down_votes":1,"body":"Ja sowas kann passieren. Unabhängig davon, dass die Gegner einen Platinspieler hatten, hätte es aber auch genauso in einer reinen Silber gegen Silber Spiel aussehen können. Hack das Spiel ab und mach einfach weiter.\nEdit: Das ist ja sogar ein Normal. Dann kann ich die Aufregung nicht verstehen.","replies":[]},{"poster":"SenseIessDreamx","date":"2016-04-05T11:22:30.528+0000","up_votes":1,"down_votes":1,"body":"Sieh es so wenn du gegen bessere Spieler spielst wirst du auch besser.","replies":[]}]}