{"poster":"ZNShadovv","date":"2019-10-19T18:28:43.340+0000","title":"Wie viel Hohn darf ein Spieler sich gefallen lassen?","subforum":"Spielerverhalten & Moderation","embed":{"description":null,"url":"https://up.picr.de/37031128pf.jpg","image":null},"up_votes":3,"down_votes":10,"body":"Hallo werte Spielgemeinschaft!\r\n\r\nich kann gar nicht erklären wie unfassbar sauer, wütend und toxisch ich gerade bin.\r\n\r\nIch habe gerade bei RIOT ein Ticket aufgemacht um 2 Gegner zu Melden wegen Unsportlichkeit!\r\nEZ, izi oder ähnliches zu schreiben gehört wohl zu den Gewollten Attitüden die RIOT ungestraft seinen Nutzern erlaubt.\r\nDabei ist das doch schon ein hohes Maß an Unsportlichkeit.\r\n\r\nAber es gibt immer noch Gegner die solchem die Krone aufsetzen.\r\n\r\nWas meint Ihr, wie viel Hohn und Spott soll man ertragen in solch einem Spiel?\r\n\r\nGrüß\r\nZN","replies":[{"poster":"SayaShire","date":"2019-10-19T19:34:09.629+0000","up_votes":4,"down_votes":1,"body":"Also ich finde, zu deinem eigenen Besten solltest du lernen, Spott VOLLKOMMEN zu ertragen - denn wenn nicht und du nimmst dir deine Rache, die theoretisch vielleicht sogar angemessen wäre (In Form von schreiben z.B.), wird das dazu führen, dass du evtl eine verbraten bekommst. \nDas sieht dann unfair aus, aber es ist nunmal nicht dein Job, dich für diese Aktion zu rächen, sondern dieses Benehmen jemandem zu melden, der dafür eingestellt wurde, dieses Verhalten zu bestrafen. \n\nIch weiß genau, wie du dich da fühlst. Ich hab es auch nicht leicht, wenn ich gegen wen spiele, der nonstop teabaggt, emotes spammt oder Animationen abbricht. Mich triggert das auch total. Statt aber was Blödes zu schreiben, was mir evtl selbst das Genick brechen wird, ziehe ich einfach ins Lächerliche, was der Gegner tut. Sofern es das Spiel gerade erlaubt (also keine Lasthits verpassen oder so), habe ich ja selbst ein zwei Emotes auf 1 und 2. Ich versuche dem Gegner einfach damit zu signalisieren, dass ich nicht tilte, sondern es lustig finde. \nUnd das auch nicht das gesamte Spiel hindurch, denn ich versuche dann auch besser zu spielen als er. Das ist einmalig zu Anfang des Games, wenn er versucht, mich damit zu provozieren. Da mach ich mein Emote und danach wird dieser Gegner komplett stumm geschaltet. Sticker aus, Chat aus usw. \nAlles, womit er mich ablenken oder triggern könnte. \n\nPer se finde ich diese Sticker eigentlich scheiße, weil sie teilweise geradezu dafür gemacht sind, Leute zu verspotten. Das mochte ich damals schon nicht in Overwatch, wenn die Leute ihr Spray gesetzt haben, nach nem tripple Kill, statt z.B. auch noch den 4. platt zu machen, der sich derweil am Rest des Teams vergeht. Aber ja, so ein Highlight ist ja nicht ewig lang, da muss man schon Prioritäten setzen, ob es jetzt wichtiger ist, in einem Teamgame dem Team zu helfen, oder sich dafür zu feiern, bzw. den Gegner zu verspotten, nur weil man z.B. Q gedrückt hat. \n\nNach wie vor rate ich dir dazu, mit allen Mitteln versuchen cool zu bleiben, denn wenn nicht, wirst du das am Ende nur bereuen. \nVertrau drauf, dass jemand, der dafür eingestellt wurde, sich um diesen Zampano kümmert. Mehr als einen Report solltest du dir nicht rausleiern lassen. \nWenns nach mir ginge, wären keine verhöhnenden Sticker im Game zu finden - aber vermutlich würden dann Spielegesellschaften mit \"psychologischer Kriegsführung\" argumentieren.  Ich mag diesen Hohn nicht, sowas gab es in keinem meiner Sportvereine. Wer sich da aufs Maul gelegt hat, wurde genau so wenig ausgelacht, wie jemand der sich auf nen Fight eingelassen udn verloren hat. (Ex-Kampfsoprtler) \nVielleicht komm ich daher mit dem Spott nicht gut zurecht, den man im Internet so findet. Es ist so vollkommen entgegen dem, was ich so lange täglich erlebt hab und ich mag mich nicht wirklich dran gewöhnen, dass es jetzt anders ist. \n\nIn diesem Sinne - Lass es dir gefallen, bleib cool und schmetter deinen Report danach raus, aber werde nicht beleidigend oder lass es dir irgendwie anders anmerken, dass man dich genau da gepackt hat, wo man es wollte.","replies":[{"poster":"need elo police","date":"2019-10-19T21:20:54.734+0000","up_votes":1,"down_votes":1,"body":"i mog di!","replies":[{"poster":"SayaShire","date":"2019-10-19T21:27:09.075+0000","up_votes":1,"down_votes":1,"body":"{{sticker:sg-jinx}}","replies":[]}]}]},{"poster":"Pure Cynicism","date":"2019-10-25T09:00:01.951+0000","up_votes":1,"down_votes":3,"body":"Riot unterstützt dieses Verhalten ja direkt, indem sie diesen dümmlichen Emote anbieten (gegen RP versteht sich) und indem sie sich von dem erbärmlichen Tyler1 bis zum gehtnichtmehr promoten lassen. Fressen kommt vor der Moral.\n\nInsofern - das was der TE anprangert, ist von Riot völlig gewünschtes oder jedenfalls toleriertes Verhalten. Traurig, aber Realität. Muss man halt akzeptieren.","replies":[{"poster":"Angel Ayume","date":"2019-10-25T11:03:09.694+0000","up_votes":2,"down_votes":1,"body":"Das du Schwachsinn redest weißt du selbst oder?","replies":[{"poster":"Pure Cynicism","date":"2019-10-25T21:37:48.509+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Angel Ayume,realm=EUW,application-id=KYnfKGf0,discussion-id=E7JtbJ1Z,comment-id=000a0000,timestamp=2019-10-25T11:03:09.694+0000)\n>\n> Das du Schwachsinn redest weißt du selbst oder?\n\nWas ist Schwachsinn? \n\nDass Riot ein EZ-Emote anbietet?\nDass Tyler1 immer wieder auf Riot-Veranstaltungen auftritt?\nDass \"ez\" ingame nicht geahndet wird?","replies":[{"poster":"Angel Ayume","date":"2019-10-25T22:05:23.957+0000","up_votes":2,"down_votes":0,"body":"Das Riot solcherlei Verhalten unterstützt oder es gar gewollt ist.\n\nJa es gibt ein Emote das sich \"zu einfach\" nennt, allerdings ist in dem Emote selbst nichts davon zu sehen. Weder steht \"ez\" in dem Emote drin, noch drückt dieses Emote \"ez\" aus. Würde es anders heißen, würde es NIEMAND mit \"easy\" in Zusammenhang bringen. Und ja, Riot hat Tyler1 in der Vergangenheit zu Veranstaltungen eingeladen. Das bedeutet aber nicht, dass sie Verhöhnung im allgemeinen völlig unterstützen oder es gar wollen.\nWäre dem so, würde es keine Strafen für unter anderem solches Verhalten geben...","replies":[{"poster":"Pure Cynicism","date":"2019-10-26T11:13:05.280+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Angel Ayume,realm=EUW,application-id=KYnfKGf0,discussion-id=E7JtbJ1Z,comment-id=000a000000000000,timestamp=2019-10-25T22:05:23.957+0000)\n>\n> Wäre dem so, würde es keine Strafen für unter anderem solches Verhalten geben...\n\nUnd es gibt Strafen für das Schreiben von \"ez\" und ähnlichem? Hast du dafür irgendeinen Chatlog, aus dem das hervorgeht? Oder eine Aussage von einem Riot-Mitarbeiter diesbezüglich?\n\nFakt ist, dass Tyler1 eine Vielzahl gebannter Accounts besitzt - 22? Folglich ist das einer der toxischsten Spieler überhaupt. Wenn eine Firma einerseits toxisches Verhalten bestrafen, mithin ächten will, und gleichzeitig einen Spieler zu Veranstaltungen einlädt, der die personifizierte Toxicity ist, dann ist das widersprüchlich und man muss davon ausgehen, dass toxisches Verhalten offensichtlich nicht unerwünscht ist.","replies":[{"poster":"Angel Ayume","date":"2019-10-26T13:33:03.302+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FaIsusProcurator,realm=EUW,application-id=KYnfKGf0,discussion-id=E7JtbJ1Z,comment-id=000a0000000000000000,timestamp=2019-10-26T11:13:05.280+0000)\n>\n> Und es gibt Strafen für das Schreiben von \"ez\" und ähnlichem? Hast du dafür irgendeinen Chatlog, aus dem das hervorgeht? Oder eine Aussage von einem Riot-Mitarbeiter diesbezüglich?\n\nIch meine allgemeine Verhöhnung. Nicht nur easy. Ich glaube aber easy allein reicht für eine Strafe nicht. \n\n> \n> Fakt ist, dass Tyler1 eine Vielzahl gebannter Accounts besitzt - 22? Folglich ist das einer der toxischsten Spieler überhaupt. Wenn eine Firma einerseits toxisches Verhalten bestrafen, mithin ächten will, und gleichzeitig einen Spieler zu Veranstaltungen einlädt, der die personifizierte Toxicity ist, dann ist das widersprüchlich und man muss davon ausgehen, dass toxisches Verhalten offensichtlich nicht unerwünscht ist.\n\nIch bin auch kein Fan davon dass er dazu eingeladen wird. \nWenn sein Verhalten aber in Ordnung wäre bzw von Riot akzeptiert, dann hätte er wohl kaum +22 gebannte Accounts und hätte wohl kaum einen ID Bann bekommen, meinst nicht? ^^","replies":[]}]}]}]}]}]},{"poster":"Abasin","date":"2019-10-25T12:58:32.562+0000","up_votes":2,"down_votes":0,"body":"Hallo ZN, wir kennen uns ja aus einigen Sessions im TS. Dort warst Du eigentlich immer locker drauf, selbst wenn der Chat mal eskalierte. Tu einfach, was ich Dir damals geraten habe: lächle und reporte. RIOT macht den Rest.","replies":[]},{"poster":"SeaHorseCalamity","date":"2019-10-19T21:57:47.707+0000","up_votes":3,"down_votes":3,"body":"In dem Moment, in dem ich als Support einen Adc im 1v1 zerhackstückle, werde ich ein izi in den Allchat hauen, vor Allem, wenn es durch Luck passiert ist.","replies":[{"poster":"Abasin","date":"2019-10-25T09:52:31.925+0000","up_votes":2,"down_votes":0,"body":"Du kannst auch einfach nur laut lachen und gar nix schreiben. Hört ausser Dir keiner und reportet wirst Du auch nicht.","replies":[{"poster":"SeaHorseCalamity","date":"2019-10-25T21:49:42.158+0000","up_votes":1,"down_votes":0,"body":"Naja, das ist zwar richtig, allerdings kann ich meine Freude auch im AllChat mit meinen Mitspielern teilen.","replies":[{"poster":"Abasin","date":"2019-10-28T07:46:47.776+0000","up_votes":1,"down_votes":0,"body":"Es ist nun mal ein schmaler Grat zwischen Freude über einen gelungenen Move/Kill und einem disrespecten des Gegners aufgrund desselben. Ich erinnere nur an diesen Moment bei der Fussball-WM, wo einge Jungs sich öffentlich über die Argentinier (\"so gehn die Gauchos\") lustig gemacht haben. Das ist nachvollziehbar, sollte jedoch nicht vor laufender Kamera passieren, da reicht pure Freude.","replies":[{"poster":"SeaHorseCalamity","date":"2019-10-30T07:12:51.532+0000","up_votes":1,"down_votes":0,"body":"Nun, entweder hast du mich falsch verstanden, oder unsere Meinungen gehen gravierend auseinander.\nDas \"izi\" etc. meinerseits kommt hauptsächlich dann, wenn der Gegner sein Play offensichtlich in den Sand gesetzt hat, oder aufgrund eines (unnötigen) Fehlers einen grauen Bildschrim betrachtet.\nIch schrieb das also nur dann, wenn ich selbst unschuldig am Versagen des Gegenübers bin, was allerdings aus meinem Ursprungstext nicht ersichtlich ist (mein Fehler).\nNatürlich nicht ganz die feine Art, allerdings kann es nicht soo schlimm sein, denn ich hatte noch nie eine CR oder ähnliches. Die Gegner fanden das wohl in dem Moment meist ebenfalls witzig.","replies":[]}]}]}]}]},{"poster":"Bettnachleger","date":"2019-10-19T19:18:35.707+0000","up_votes":2,"down_votes":0,"body":"> EZ, izi oder ähnliches zu schreiben gehört wohl zu den Gewollten Attitüden die RIOT ungestraft seinen Nutzern erlaubt.\n\nKlassiker. Genau wie jegliches Land das Moerder nicht zu 100 % findet und bestraft morden tolleriert und deren Staatsbuergern erlaubt ;-)","replies":[{"poster":"Destiny244","date":"2019-10-20T08:33:07.095+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Bettnachleger,realm=EUW,application-id=KYnfKGf0,discussion-id=E7JtbJ1Z,comment-id=0002,timestamp=2019-10-19T19:18:35.707+0000)\n>\n> Klassiker. Genau wie jegliches Land das Moerder nicht zu 100 % findet und bestraft morden tolleriert und deren Staatsbuergern erlaubt ;-)\n\nWeiss jetzt nicht ob ich meinen Kopf voller Wucht auf den Tisch hauen soll oder wegen des Vergleichs genüsslich loslachen soll {{sticker:zombie-brand-mindblown}} \n\nZum Thema: So ist League leider nun mal. Prinzipiell musst du dir das nicht gefallen lassen, mute solche Spieler einfach oder mach es wie ich und schalte den Chat einfach aus. Dann kannst du dich aufs Spiel konzentrieren und alle, die was zu meckern haben, können das gerne zur Unterhaltung der verbliebenen Spieler machen ;)","replies":[]}]},{"poster":"need elo police","date":"2019-10-19T18:38:00.707+0000","up_votes":2,"down_votes":0,"body":"Warum sollte ez schreiben bestraft werden werden aber das ez Emote nicht? Versteh mich nicht falsch, wenn es nach mir geht sollten die Emotes komplett abgeschafft werden, und auch die unsportlichen Spieler härter bestraft werden. Aber man muss sich damit abfinden, dass dies nicht Riots Prio ist. Ich glaube schon, dass unsportliche Spieler irgendwann bestraft werden, aber nicht so schnell.\n\nGrundsätzlich muss man sich Hohn und Spott gefallen lassen solange es nicht beleidigend wird ... das gehört zur Philosophie von Riot. Wenn man damit nicht klar kommt, muss man sich ein anderes Spiel suchen. So schwer es auch ist. Riot würde an Glaubwürdigkeit verlieren, wenn jemand wegen \"ez\" eine Strafe bekommt, aber jemand der die ganze Zeit das \"ez\" Emote spamt nicht. Deswegen muss man sich leider damit abfinden.\n\nIch reporte so etwas trotzdem, in der Hoffnung dass er bestraft wird. Aber die Chance ist leider nicht sehr hoch. Für mich steht die Sportlichkeit an erster Stelle, noch vor dem gewinnen. Deswegen bekommt auch nicht der beste Spieler ein Honor, sondern der, der sich positiv verhalten hat.","replies":[]},{"poster":"ZNShadovv","date":"2019-10-20T19:58:33.036+0000","up_votes":1,"down_votes":2,"body":"Hallo @ all!\n\nDanek der vielen  Tips!\nIch werde auch meinen Chat abschalten.\n\nIch möchte ein endspanntes Game haben und mich nicht ärgern\n\nDanke an alle\n\n\nZN","replies":[]},{"poster":"Amycos Cyrus","date":"2019-10-20T08:21:58.358+0000","up_votes":1,"down_votes":0,"body":"Alles was dir gegen den Strich geht einfach reporten.\n\n> EZ, izi oder ähnliches zu schreiben gehört wohl zu den Gewollten Attitüden die RIOT ungestraft seinen Nutzern erlaubt.\n\nNicht mehr. Allerdings sind im Vergleich zu anderen Äußerungen immer noch sonderlich geringwertig, und machen daher nicht viel aus.\n\n> Was meint Ihr, wie viel Hohn und Spott soll man ertragen in solch einem Spiel?\n\nDas liegt alles an dir (und am Reste der Community). Wenn man das Report-System vernünftig benutzen würde, dass würde es sich auch den Ideen der Spieler anpassen. \n\nHierzu ein Ausschnitt vom Support:\n\n> Das Sofort-Feedback-System wurde von Riot Games entwickelt, damit Spieler in der „League of Legends“-Community bestimmen können, welches Benehmen sie für eine positive Spielerfahrung für unangemessen erachten. Unabhängig von den Umständen (wie etwa Provokation) werden Verhaltensweisen wie Verspotten, Belästigen, Fluchen, beleidigende Bemerkungen, dem Gegner absichtlich zuspielen („intentional feeding“), dem Team absichtlich nicht zu helfen usw. gemeldet und voraussichtlich vom Sofort-Feedback-System bestraft.\nQuelle: https://support.riotgames.com/hc/de/articles/201898070-Mein-Konto-wurde-gesperrt","replies":[]},{"poster":"Veezey","date":"2019-10-20T00:52:31.290+0000","up_votes":1,"down_votes":0,"body":"yes yes ich habe wegen ez und sowas schon den Allchat ausgeschaltet, da mich nichts mehr tilted als so ein Scheiß.","replies":[]},{"poster":"Yuiwara","date":"2019-10-19T19:37:27.607+0000","up_votes":1,"down_votes":0,"body":"\"its more fun to destroy bad players like u\"... i wouldve reported him for bad behaviour.\n\naber wegen sowas wie ez würd ich kein reporten, außer die spammen das wie wild nach dem game. das würde ich dann ebenfalls als schlechtes benehmen empfinden, nicht nur wegen spott, sondern auch wegen unnötigen spam im chat. Aber es nur 1-2 mal zu schreiben würd ich jetzt nicht soo schlimm finden (auch wenn es unschön ist, besser wäre sich stattdessen zum sieg zu beglückwünschen, als so zu tun, als sei das gegnerteam nichts gewesen).","replies":[]},{"poster":"Ma1days","date":"2019-10-19T18:34:23.188+0000","up_votes":1,"down_votes":0,"body":"Du musst überhaupt nichts ertragen wenn du toxic spieler einfach mutest\n\nDie welt ist voller assis und arschlöcher nimm dir nicht alles zu herzen sonst kommst du nicht weit im leben","replies":[]},{"poster":"SheenYou","date":"2019-10-19T22:16:17.437+0000","up_votes":1,"down_votes":13,"body":"> 2 Gegner zu Melden wegen Unsportlichkeit!\nEZ, izi oder ähnliches\n\nBruder mehr Alman geht nicht und wegen ez, izi rum zuheulen ist mal das Dümmste was ich je gehört habe ( obwohl dieser post noch dümmer ist https://boards.euw.leagueoflegends.com/de/c/champions-gameplay-de/49AAOf8w-dead-mans-plate-ist-ein-sexistisches-item ) nehme es mit Humor und nicht wie eine Memme und vielleicht wenn du mal ein Luck, krassen, lustigen oder sonstwas kill machst kannst mal auch du ez, iziz oder so schreiben.\n\nLg SheenYou{{champion:98}}","replies":[{"poster":"Angel Ayume","date":"2019-10-19T22:39:23.122+0000","up_votes":3,"down_votes":0,"body":"Es ist halb ziemlich unsportlich den Gegner auch noch zu verhöhnen. Sowas ist im echten Leben bei den verschiedenen Sportarten genau so ungern gesehen wie hier in LoL.","replies":[]}]}]}