{"poster":"183cm 71Kg 22cm","date":"2018-05-10T21:50:22.890+0000","title":"Silver, divízió leírása, tippek feljebbjutáshoz.","up_votes":3,"down_votes":0,"body":"A helyzet a k&ouml;vetkező: Eddig 20 ranked meccsem volt &ouml;sszesen. 10 solo/duo &eacute;s 10 flex\r\nSolo duo silver II Flex Silver IV\r\nEnnyi volt az &ouml;sszes ranked meccsem eddig. \r\nUgy d&ouml;nt&ouml;ttem itt az ideje elkezdeni rankedezni, viszont j&oacute;l j&ouml;nne egy kis seg&iacute;ts&eacute;g. M&aacute;rmint a div&iacute;zi&oacute; amibe besorolt sz&aacute;momra ismeretlen, nem tudom hol &aacute;llok tud&aacute;s szintj&eacute;n, mennyire sz&aacute;mitok j&oacute;nak/ rossznak. Nem tudom, hogy mik azok a hib&aacute;k, amiket a div&iacute;zi&oacute;mbeliek elk&ouml;vetnek, amiket kik&uuml;sz&ouml;b&ouml;lve fejlődhetn&eacute;k. \r\nValamint tan&aacute;cs is j&oacute;l j&ouml;nne. Lane fase ben nem vagyok a legjobb, az 1v1 ekből az esetek 65-70 % &aacute;ban vesztesen j&ouml;v&ouml;k ki, legink&aacute;bb csak tradelgetek. Viszont ugy gondolom a csapatharcokat el&eacute;g j&oacute;l &aacute;tl&aacute;tom, tudom k&ouml;vetni, hogy melyik ellenf&eacute;ltől milyen k&eacute;pess&eacute;gek v&aacute;rhat&oacute;k, hogyan, hova, a csapatt&aacute;rsaim poz&iacute;ci&oacute;j&aacute;t, stb. A csapatharcok kb 90-95%&aacute;t el&eacute;g j&oacute;l j&aacute;tszom ki, ha nincs jelentős erők&uuml;l&ouml;nbs&eacute;g, akkor jellemzően győztesen ker&uuml;l&uuml;nk ki a harcb&oacute;l (ehhez persze kell, hogy az &ouml;sv&eacute;nyen ne szerepeljek le nagyon) Nyilv&aacute;n ez nem tul k&ouml;nnyű egy elrontott lane fase ut&aacute;n.\r\nEgyik karakterrel sem j&aacute;tszottam kiemelkedően sokat, valamint 4 poz&iacute;ci&oacute;ban j&aacute;tszom meccsenk&eacute;nt v&aacute;ltakozva.\r\nNem tudom eld&ouml;nteni hol lenne a helyem a j&aacute;t&eacute;kban. Legink&aacute;bb a csapatharcokat, valamint a gyors j&aacute;t&eacute;kot kedvelem. Szeretem Zed et, Khazix ot, Fiora-t, de nem szivesen j&aacute;tszom vel&uuml;k. Legjobban szeretem top lane en Sion. JG ben Zac, Gragas. Mid lane en Orianna, Xerath. Supportnak: Thresh, Soraka\r\nM&aacute;r 3 h&oacute;napja pr&oacute;b&aacute;lok d&ouml;nteni de nem megy. A fejlőd&eacute;s 4 pozici&oacute;ban egyszerre meg nem tul gyors &eacute;s k&ouml;nnyű. Adc pozici&oacute;ban szeretem Ezreal-t, Jhin-t, csak nem vagyok tul &uuml;gyes vele. \r\nEsetleg tudtok tippeket adni 1v1 hez? Hogy tudn&aacute;m jobban kij&aacute;tszani lane fase-t, esetleg erősebbnek lenni a csapatharcok kezdet&eacute;n az ellenf&eacute;ln&eacute;l. Jellemzően csak jg gank n&eacute;l szoktam szerezni gyilkoss&aacute;got, assistot. Egyed&uuml;l vagy elmenek&uuml;l low hp-n vagy &eacute;n menek&uuml;l&ouml;k low hp-n. Valamint bannolni kit &eacute;rdemes, az &quot;&uacute;j&quot;(sz&aacute;momra) r&uacute;n&aacute;k előnyeit, gyenges&eacute;geit. Melyik hős ellen &eacute;ri meg &eacute;get&eacute;s/megtisztul&aacute;s/gyorsit&aacute;s/stb. \r\nDraft m&oacute;dban pr&oacute;b&aacute;ltam kb 2 h&oacute;napja komolyan venni a meccset/ olyan hős&ouml;kkel j&aacute;tszani akikkel ugy ahogy tudok. A vesztes meccsek 40-50% &aacute;ban volt minimum 1 olyan csapatt&aacute;rs, aki meghalt 10 szer minimum, mig &eacute;n 3 szor. Kb 10% volt, hogy &ouml;sv&eacute;nyf&aacute;zist t&uacute;l&eacute;ltem, de ut&aacute;na m&aacute;r nem siker&uuml;lt nyerni, az ellenf&eacute;l jobban j&aacute;tszott. A marad&eacute;kn&aacute;l az &ouml;sv&eacute;nyen kikaptam, sokszor el&eacute;g csuny&aacute;n. A győzelmekn&eacute;l is volt kb 5% hogy nem sok k&ouml;z&ouml;m volt a j&aacute;t&eacute;khoz, 15%hogy csak szerencs&eacute;nk volt. \r\nValamint sokszor veszem &aacute;t a csapatvezető szerep&eacute;t, folyton figyelem a t&eacute;rk&eacute;pet, ki milyen erős, hol lehet a dzsungeles, szolok botnak ha az ellenf&eacute;l arrafele lehet, kimozdulok s&aacute;rk&aacute;nyra, segitek m&aacute;s &ouml;sv&eacute;nyeknek. Csapatharcban pingelem kit kell f&oacute;kusz&aacute;lni, valamint megpr&oacute;b&aacute;lom a pingekkel megovni a csapatot a pozicion&aacute;l&aacute;si hib&aacute;ktol, nehogy az adc- t levad&aacute;ssza egy khazix(pl)\r\nKommunik&aacute;lok a csapattal, biztatom őket ha l&aacute;tok es&eacute;lyt a győzelemre, felv&aacute;zolom nekik, hogy ha figyelnek erre meg arra a k&eacute;pess&eacute;gemre megnyerhetj&uuml;k ezt meg azt a harcot. Nyilv&aacute;n &eacute;n is ember vagyok, aki un. toxic azt rosszabb napokon lehordom mindennek. Valamint ha valaki m&aacute;r 10 edszer hal meg 15. perc előtt akkor sem vagyok tul b&eacute;k&eacute;s. \r\nAj&aacute;nlan&aacute;tok esetleg szerintetek nekem val&oacute; hős&ouml;ket? \r\nHa b&aacute;rki elolvassa ezt a hosszu sz&ouml;veget, k&ouml;sz&ouml;n&ouml;m, tal&aacute;n tul hossz&uacute; lett.","replies":[{"poster":"Genkwyll","date":"2018-05-11T13:14:44.255+0000","title":null,"up_votes":3,"down_votes":0,"body":"Szép jó reggelt/napot/estét, segíteni jöttem.\n\n> Valamint tanács is jól jönne. Lane fase ben nem vagyok a legjobb, az 1v1 ekből az esetek 65-70 % ában vesztesen jövök ki, leginkább csak tradelgetek. Viszont ugy gondolom a csapatharcokat elég jól átlátom, tudom követni, hogy melyik ellenféltől milyen képességek várhatók, hogyan, hova, a csapattársaim pozícióját, stb. A csapatharcok kb 90-95%át elég jól játszom ki, ha nincs jelentős erőkülönbség, akkor jellemzően győztesen kerülünk ki a harcból (ehhez persze kell, hogy az ösvényen ne szerepeljek le nagyon) Nyilván ez nem tul könnyű egy elrontott lane fase után.\n\nLane phase:\nFarmolás\nKisebb tradek\nGyilkosságok szerzése\nWardolás\n\nEzeket kell megtanulni, hogy jól tudj lanelni. Segít ha sustaines hőst hozol (pl:Vladimir, Swain), mivel ha hibázol hp-dat visszatudod tölteni, vlad pedig megcélozhatatlanná tud válni, swain tudja magát gyógyítani (Zhonya homokórája aktív közben is). Farmolj sokat, ez számít. Ezenkívülj wardolj. Jó ap-s karakterekkel nehéz lanelni, mivel kicsiket sebez az aa-ja, és nem fog oneshotolni de ezt nem is várhatod el. Thresh-re tudok csak tippeket adni, ő a mainem pár \nelég jó tanáccsal is tudok hozzá szolgálni.\n\n\nThresh MiniGuide \n\nThresh melyik adc-hoz lehet jó?\nLucian (bár nála az adc darius is jobb mostanság)\nMiss Fortune\nAshe\nCaitlyn\nVarus\n\nIdézői képességnek Ignite flash, vagy ha AS champ van (pl:yi, yasuo) akkor exhaust.\nBuild:{{item:3301}}  és fejlesztései\n{{item:3800}} \n{{item:3190}} \n{{item:3107}} \n{{item:3050}} \n{{item:3117}} \nPersze mindig ha van pénz akkor vegyél control wardot. Magyarázat:\nSupport item azért sárga, mert thresh nem meele ezért a tankos supp item nem jó neki. Ap se jó thresh-nek.\nIgaz dicsőség:tankosságot ad és kezdeményezni is könyebb vele. \nMegváltás:+pajzserő, +gyógyítás. Az aktívja is nagyon jó.\nZeke:tankosságot ad, és az aktívja is jó, teamfightokban elég jó a bónusz sebzése.\nCipő:ez a legjobb cipő. Ha sok az ad/ap lehet ninja tabi/ap védő cipő.\n\nRúnák:Laning phase-ben guardian jobb, teamfightokban Aftershock.\nAmit ki kell rakni még:Font of life, conditioning revitalize.\nValamint ihlet ágon ingyen süti+ingyen cipő.\n\nElőnyei threshnek:\nnagyon sok CC\nSupp itemmel+cipővel nem lassú\nHa a QER kombó kiment, akkor az enemy nagy eséllyel halott\nNagyon tankos\nLaning phaseban erős, lámpással bárkit meg tud menteni, akár falakon át.\n\n\nHátrányai:nem képes nagyobb pajzsokat, gyógyításokat adni megváltás+solari előtt\nCounterpick morgana, ami ha enemybe benne van nagyon kicsire csökken a hatékonysága.\nJáték elején papír, nem fejlődik szintenként a páncél\nLegtöbb képessége dodgeolható\n\nSpeckó trükkök:Q-val falakon áttud menni, és igazlátást ad. Ha dobjuk a q-t a és a lámpást akkor átmehetünk a falakon.\nHa lerakod a lámpást, és bántják a csapattársadat akkor aktiválódik a guardian (pajzsot ad)\nHa mozgás közben sütöd el az e-t, mozog a hitbox is. Ezt valahogy így lehet kivitelezni:\nQ, Q közben villámgyorsan E\n\nHa kell valami, vegyél fel. Megköszönöm ha valaki kiegészíti/felszavazza a kommentemet.\n---\nPeacelove\n---\n","replies":[{"poster":"derX","date":"2018-05-12T14:31:33.232+0000","title":null,"up_votes":4,"down_votes":0,"body":"***","replies":[{"poster":"183cm 71Kg 22cm","date":"2018-05-13T09:33:00.806+0000","title":null,"up_votes":1,"down_votes":0,"body":"És most jön a kérdés, most hogy egy válaszolónak segitettél, jöhetek én? QwQ\nAmugy ment a plusz1","replies":[]}]},{"poster":"183cm 71Kg 22cm","date":"2018-05-11T15:35:34.353+0000","title":null,"up_votes":1,"down_votes":0,"body":"Köszönöm, én próbálgattam, és igazábol lassitást hoztam neki, cipővel, valamint minion denatralizálót, a tankos suppitem miatt. Ezenkivül e vel kezdek, a plusz dmg miatt, plussz mellé a lassítás. Máshogy még nem próbáltam. Ha meg kezdeményezek szivesebben flash e, basic, és a lassítás miatt egy tiszta könnyen bevihető q. Lehet hogy ez a taktika vak vágány, megprobálom akkor amit mutattál azt is. Q közben gyorsan E megy, szktam is használni, de e vel kezdeményezni jobban szeretek, biztosabb a siker ügyetlen kézben. Köszönöm.","replies":[{"poster":"Genkwyll","date":"2018-05-11T15:44:37.315+0000","title":null,"up_votes":2,"down_votes":0,"body":"Én is e-t maxolok, utána Q és w. Kezdeményezés:azért jobb az igaz dicsőség aktívjával kezdeni, mivel rárohanhatsz az enemy adc-jére/carry-jére és utána EQR/QER/REQ, és addig a csapat rárohan és meghalt, és addig rádmegy a focus és hiába haltál meg, az enemy carry meghalt ami nektek jó csere. Supp/Top/Jg main vagyok ebben a sorrendben, ha tanács kéne szólj.\n---","replies":[]}]}]},{"poster":"Vemhes Szurikáta","date":"2018-05-16T01:41:38.048+0000","title":null,"up_votes":2,"down_votes":0,"body":"Nézd végig ezt: \n\nhttps://www.youtube.com/watch?v=iko2tqmDpJQ&list=PL9RdXhXESRJzgY_SwHB8T-cZxXljWhQvz\n\nUtána ebből azt, ami kiválaszott ösvényedre vonatkozik:\n\nhttps://www.youtube.com/user/SkillCappedDotNet/playlists\n\nHa feljebb akarsz jutni, akkor egy ösvényt játssz lehetőleg, 2-3 karakterrel. Ha csak szórakozni akarsz, vagy jobb lenni a játékban, akkor nyugodtan játszhatsz akármit, de a feljebbjutás a célod, akkor jobban jársz a kevés hőssel.\n\n**CS>Objectives>Not dying>kills**\n\nearly game pedig Exp > minden. \n\nA csapattársaidat nem tudod befolyásolni, ne foglalkozz velük. /mute all minden meccs elején, sokat segít.\n\nHa elegendő számú meccset játszol, akkor a zavaróhatások (feeder, troll, afk, szerencse, balszerencse stb.) kiegyenlítődnek, és eljutsz a \"valós\" rangodhoz.\n\nNe feledd, ez nem egy sprint, hanem egy maraton.\n\n\nSok sikert.","replies":[{"poster":"183cm 71Kg 22cm","date":"2018-05-17T21:21:40.570+0000","title":null,"up_votes":1,"down_votes":0,"body":"Köszönöm, sokat segitett.\nAnnyi a kérdésem csak, hogy jobb lenni a játékban nem egyenlő a feljebbjutással?","replies":[{"poster":"Vemhes Szurikáta","date":"2018-05-18T07:45:43.512+0000","title":null,"up_votes":1,"down_votes":0,"body":"Összefügg a kettő mindenképpen, de nem ugyanaz.\nPéldául valaki elkezdhet Jannázni egy vadállat adcarry duo mellett, és bejuthat úgy dia 5-be, hogy vajmi kevés fogalma van a játékról. Ez egy sarkos példa, de érted, mire gondolok.\n\nVagy csomót látom azt, főleg itt silverben, hogy egy-egy embernek van vagy 80 játszott hőse már a szezonban. Lehet, hogy az általános gamesense meg mittudomén javulni fog attól, hogy az összes létező pozit játssza, de nem fog tudni olyan konzisztensen eredményt produkálni (vö. nyerni), mint aki one trickel.","replies":[]}]}]},{"poster":"IwillHUNTudown","date":"2018-05-11T17:22:03.787+0000","title":null,"up_votes":2,"down_votes":0,"body":"Silverből pikk-pakk ki kell jutni, nem egy vészed liga, sajnos elég sok a troll és amit sajnos észrevettem, hogy sokan nem értik a ranked lényegét azon a szinten, sajnos. Ha megtanulod, hogy mit szabad azon a lanen csinálni, amit választottál \"fő\"-nek, akkor elég simán ki fogod tudni magadat carryzni. \n\nPár tanács:\n1. Válassz ki KÉT (maximum ennyit, nem kell mindenhol profin játszani) rolet, játssz fixen 8-10 championnel, ennyi bőven elég. A lényeg, hogy legyen több stílus köztük, hogy tudd counterpickelni az ellenfeled, akárki is legyen az. Ha már counterpick, akkor igen, szerintem Silverben akárki akármit mond, nagyon jól működik, főleg 1v1 ösvényeken, de a bot lanet is uralhatod vele. Fontos, hogy ne ijedj meg az Autofilltől, igen, lesz mikor Supportolnod kellesz, ha tetszik, ha nem. Support main vagyok, Silverből Platig jutottam vele, működik, lehet carryzni, nem ajánlom viszont a tankokat, ugyanis Silverben jó ADC-t kifogni olyan, mint megnyerni a lottó 5öst.  Zyraval gyakorlatilag solo carryztem nem egy meccset, bot lanere és mid lanere is nagyon ajánlom!\n\n2. Őszinte leszek... én azt tapasztaltam, hogy nem igazán tudsz a saját csapatodra sem számítani. Teljesen kiszámíthatatlan move-ok, fun, chase, értelmetlen roam, minden hülyeséget el tudnak követni annak érdekében, hogy elveszítsék az ösvényt. Ne légy ilyen! Mivel azt mondtad, hogy ne erősséged a laning phase, ezért ajánlom, hogy olyan championoket válassz, akik nem is ebben a szakaszban igazán erősek, hanem a játék későbbi szakaszában tudnak játékot döntően befolyásoló dmg-et kiosztani. \nKonkrét championoket nem ajánlok minden lanere, mert nem tudom mit szeretsz. Próbálj ki minél többet NORMAL játékok keretében, teszteld a mozgását, nézz \"tips and tricks\" videókat, stb. Lesz olyan champ, ami nagyon be fog jönni, lesz olyan, ami nagyon nem, hiába erős. Te érzed. :)\n\n3. Én azt mondom, hogy low elora a legjobb summoner spell az Ignite. Könnyű vele játszani, ad bónusz dmget, igazából minden jó megvan benne. Topra sem mindig érdemes Teleportot vinni! Nem előírás! Természetesen ekkor bevállalod, hogy ha nem nyered meg a lanet, akkor szintelőnybe kerülhet az ellenfél, viszont kérdés nélkül több dmg-ed lesz fightokban.  Supportnak szintén Ignite, a többi viszont egyértelmű, hogy ADCnek Heal és jnglbe Smite. :)\n\n4. Premade!!! Nagyon sokat segít, ha nem egyedül játszol. Ha van egy olyan társ, akire számíthatsz, aki nem fog flamelni, aki nem fogja azt mondani, hogy \"neked nem segítek\", aki nem fog szanaszét feedelni mindenkit, hanem segít, kommunikál veled. Sokkal egyszerűbb ketten kezdeményezni egy harcot, mint egyedül, sokkal egyszerűbb uralni egy lanet, ha tudod, hogy lesz egy csapattárs, akit, ha kérsz roamol és kisegít.\n\n5. Vision\nÉppen tegnap tettem fel egy kérdést evvel kapcsolatban (amire köszönöm szépen a választ Genkwyllnek). Extrém kevés wardot használnak a játékosok silverben és még Goldban is. Az 1 ward place per minute sem szokott meglenni még support lanen sem. Érdemes 2 látó őrszemet már a korai szakaszban beszerezni, egyet elhelyezni, így a mögüled, mellőled érkező gankek nem fognak könnyen érkezni a sötétből. :)\n\n6. Early game: Farm, farm, farm. Ez a legfontosabb. Ha ezt a mutatót kiemelkedően vezeted olyan, mintha killeket szednél. Természetesen, ha meg tudod ölni az ellenfeledet, akkor tedd meg, de ne ezen legyen a hangsúly, mert könnyen belefut az ember egy-egy hibába, jön a gank, megölnek, stb. Minionoknak is durva dmgük van 1-6 szinten, nem érdeme velük tradelni, le kell szedni és utána fightolni. Ha az enemy agresszív, haszáld ki, hibázni fog!\n\n6. Itemek szintén champion és stílusfüggőek, olvass utána, gondold át, próbáld ki normal játékban a buildeket! Ui: NE higgy el mindent, amit a Probuildsen látsz! Itt nem mindig működik. :)\n\n7. Ne flamelj! Saját tapasztalatból mondom, 1 accomat kibannolták miatta, ez is 0 honor szintű! :D Nem túl jó. Sajnos én nem tudok veszíteni, de nem is szeretnék megtanulni, mert aki megtanul veszíteni, az nem fog tudni eléggé küzdeni a győzelemért. Sajnos a Riot ezt jobban bünteti, míg azt, aki 15 percnél 0-7ben áll megvédi azzal, hogy \"Jaj, hát neki is lehet rossz napja\", pedig az nem az a kategória, aki komolyan veszi, az ennyire nem tud feedelni, de ebbe most ne menjünk bele. Mute all - carry on, majd Gold közepétől On-olhatod a chatet. Sokat nem érsz vele, de ott már van pár játékos, aki konyít a dolgokhoz. :)\n\nSok sikert kívánok a játékhoz! :)","replies":[{"poster":"183cm 71Kg 22cm","date":"2018-05-11T20:32:20.921+0000","title":null,"up_votes":1,"down_votes":0,"body":"Köszönöm a sok tanácsot. \nNem számithatok rájuk, de ha elkapok egy jó helyzetet, pl orianna 4 et ultizok egymáshoz, nem sokat számit, az esetek többségében észreveszik és jönnek. Tárgyösszeállításokat nem néztem még talán soha, magamtol csináltam mindig, mostanában viszont az uj tárgyak, átalakitások bekavartak, nem tudom az összeset letesztelni az összes sorrendben hogy melyik a leghatékonyabb nekem. Inkább csak az ajánlott tárgyakat veszem. Summonernek én barriert hozok, vagy exhaustot, ignite ot csak ritkán amikor assasin hoz van kedvem, de jo, majd megpróbálom. Premade nem megoldható, akiket ismerek azok vagy nem játszanak már, vagy olyanok, hogy flame/ ignore még engem is. Wardokkal jól állok, szeretem ha van rálátásom az ösvényemre, az egyetlen gondom talán az volt, hogy a pinkward ot sosem tudtam jol elhelyezni, sokszor el is felejtettem venni. A farmolást csak gyakorolnom kell még.","replies":[{"poster":"IwillHUNTudown","date":"2018-05-11T21:07:00.674+0000","title":null,"up_votes":2,"down_votes":0,"body":"Akkor viszont ajánlom azért, hogy meccs előtt rúnákra és buildekre nézz rá a probuilds-en, nagyon sokat tud segíteni, arra utaltam, hogy ott van, mikor ap varust buildelnek, holott egy on-hit ad varussal sokkal egyszerűbb játszani, meg ilyenek... :) \n\nItt minden le van írva, melyik spellt fejlesztik először, melyik itemet veszik először, stb. Sokat segít. :) \n\nPremade nem kell, hogy ismerős legyen. Néha még az sem, hogy magyar. :) Mondjuk az nem hátrány. Rengeteg magyarral találkozhatsz játék közben. Ne félj rájuk írni, ha látod, hogy full magyar neve van. Volt olyan, akivel meccs közben beszélgettem, a végén addoltam, mentünk is pár meccset gyorsba... :)  Nem kell örökbarátságot kötni, mész vele pár meccset, van premade, segítitek egymást, beszélgettek a játékról, stb, aztán ennyi. Ott a beépített chat, pont erre van kitalálva. :) Persze ezt akkor érdemes csinálni, ha az előző meccsben jól játszottatok együtt, és látod, hogy ügyes. :D","replies":[]}]},{"poster":"Genkwyll","date":"2018-05-12T07:19:30.495+0000","title":null,"up_votes":1,"down_votes":0,"body":"> (amire köszönöm szépen a választ Genkwyllnek\n\nKöszönöm a megemlítést, egyébként az amit mondasz az igaz, ment az upvote ^^\n---","replies":[]}]},{"poster":"183cm 71Kg 22cm","date":"2018-05-10T21:56:33.837+0000","title":null,"up_votes":1,"down_votes":0,"body":"Valamint azt kihagytam, hogy mi a teendő, ha ugy kezdődnek a harcok, hogy mindenkinek az ellenfélnél van átlagosan 8-9ölése, ugyanannyi halála, én meg ott vagyok az én kis 2ölés 0 halálommal. Az ellenfél az ölések miatt erősebb mint én, a csapattársak is az övék miatt, én meg ott vagyok a kis gyenge, aki nem volt annyira agressziv, hogy ha meghal is flashel és elviszi.","replies":[{"poster":"IwillHUNTudown","date":"2018-05-11T17:29:40.259+0000","title":null,"up_votes":2,"down_votes":0,"body":"Nos, ez az a szitu, amikor több kérdés is felmerül, hiszen ennyiből elég nehéz megmondani. Champion függő, játékszakasz függő és team comp függő. Ha van egy egyértelműen late game championod, akkor teljesen fölösleges idióta módon belemenni a harcokba. Farmolj ameddig lehet a lanen, próbáld beütni a tornyot, splitpusholj amennyit csak tudsz és szerezz szintet. HA odavissza 1-1 tradek mennek a többi lanen, az azt jelenti, hogy ott nem lesz annyi farm, sokszor vannak spawnon, ezért szintben is könnyen lemaradhatnak, stb. 15 minion kb. 1 killel egyezik meg. Hiába áll valaki 10-0ba, ha 20 cs-je van, míg te 0-0-0ban állsz, de van 20 percnél 160 cs-ed. Pénzben nem sokkal vezet, és itt ez a fontos. Minden a pénzért és a visionért megy, akinek több iteme van, az az erősebb - általában. \nHa viszont van egy early championod, akkor sajnos ennél rosszabb forgatókönyv nincs. Akkor muszáj menned és neked is a lehető legtöbb killt felszedned, idejében, hiszen el fogsz gyengülni a játék későbbi szakaszára.\n\nSajnos tapasztalat, hogy bronze, silver, gold ligákban nem értik a játékosok meg, hogy high-eloban miért nincsenek killek, miért mindenki csak farmol. Pont ezért, amit leírtam. Egy kill lanen fifty-fifty, jngler is beleszólhat, nem biztos, hogy sikerül az engage, stb. Egyszerűen érdemesebb farmolni. Persze teszem hozzá ismét, nem korai szakaszban erős championnel... azzal menni kell, és agyon kell verni az ellenfelet már lvl 6 előtt akár.","replies":[]}]},{"poster":"Nemin","date":"2018-05-11T13:35:09.652+0000","title":null,"up_votes":2,"down_votes":0,"body":"Tundra posztjai remekek, én csak annyit fűznék hozzá, hogy az ne aggasszon, hogy sok hős között \"csapongsz\". Erősen ajánlott minden lanere 3 hőssel legalább megtanulni játszani.","replies":[]},{"poster":"kalamona90","date":"2018-05-10T21:57:31.647+0000","title":null,"up_votes":2,"down_votes":0,"body":"Én inkább más nálam jobb játékos postjait linkelem be. Sok mindenről ír témákra szétbontva. ---->[Ide katt](https://boards.eune.leagueoflegends.com/hu/player/EUNE/Tundra?content_type=discussion)<--- Válogass, olvas, van mit.","replies":[{"poster":"183cm 71Kg 22cm","date":"2018-05-10T22:07:34.714+0000","title":null,"up_votes":1,"down_votes":0,"body":"Örök hála, van egy kis olvasnivaló.","replies":[]}]}]}