{"poster":"SubStinger","date":"2015-04-30T22:09:24.887+0000","title":"TEAM CERCA MAIN TOP","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Team composto principalmente da platino e diamante cerca main TOP per sostituire un nostro ragazzo che attualmente ha problemi lavorativi.\r\nSiamo un team molto competitivo cercando di partecipare a tornei, eventi, ecc.\r\nRequisiti OBBLIGATORI:\r\n- Et&agrave; maggiore di 18 anni\r\n- Esperienze passate in team\r\n- Voglia di migliorare / ascolto delle critiche\r\n- Minimo Platino\r\n- Capacit&agrave; di guidare il team nelle ranked, uso dei call (IMPORTANTE)\r\n- Parecchia attivit&agrave; sulla piattaforma (pomeriggio e sera, soprattutto venerdi, sabato, e domenica)\r\n- No flame (abbiamo cacciato 4 persone, siamo molto severi su questo)\r\n- Whatsapp, per comunicazione orari\r\nPer chi fosse interessato aggiungete S&ugrave;b. Dopo avermi aggiunto testeremo le vostre competenze e selezioneremo una persona (dato che ci rimane solo un posto libero)","replies":[{"poster":"MaisitalianPros","date":"2015-05-01T02:26:53.074+0000","up_votes":1,"down_votes":0,"body":"siete peggio di quelli che ti offrono un lavoro devo avere anche la patente e qualche titolo di studio ho basta essere chalenger per poter giocare con voi??\nDitemi quando e dove e con il mio team di nabbi vi sverghiamo il culo a stelle e strisce guarda io gioco da 2 anni ma nn significa che se non sei platino ho diamante nn sai giocare lel XD hahahahahahahaha ^_^","replies":[{"poster":"TerrorVodka","date":"2015-05-01T10:32:23.480+0000","up_votes":1,"down_votes":0,"body":"giocherai a lol da 2 anni, il tuo team sarà il più pro del mondo,\nma almeno impara a mettere \"L'acca\" dove va messa che mi è partito un'embolo a leggere","replies":[]}]},{"poster":"MaisitalianPros","date":"2015-05-01T02:29:58.884+0000","up_votes":1,"down_votes":0,"body":"Devo avere Whatsapp per comunicare con lei ser?!? Mi scusi non basta la chat di lol se vuoi ci twittiamo XD","replies":[{"poster":"Bl4cKLuTh0r","date":"2015-05-03T20:13:52.920+0000","up_votes":1,"down_votes":1,"body":"Senti se devi flammare levati dal cazzo... ok ?  :)  Anche perché a prescindere ti chiedono se hai qualche mezzo di trasporto per venire a lavoro... e titolo di studio...  Mica i datori di lavoro...  vuole assumere gente Ignorante come  te ;)","replies":[]}]}]}