{"poster":"Stè94an","date":"2018-02-05T17:15:17.854+0000","title":"Tastenkürzel für Zauber Aufwertung","subforum":"Champions & Gameplay","up_votes":2,"down_votes":1,"body":"Yo wo habt ihr das Tastenk&uuml;rzel f&uuml;r das Aufwerten der Zauber? \r\nStandardm&auml;&szlig;ig ist es ja auf Strg + q / w / e / r , aber die Strg Taste liegt ja nicht gerade angenehm \r\nlg","replies":[{"poster":"Nycaria","date":"2018-02-05T17:35:11.661+0000","up_votes":2,"down_votes":0,"body":"Ich hab an den Hotkeys nie was geändert, war irgendwie immer zu faul mir da ein eigenes System für auszudenken >.< \nUnd inzwischen hab ich mich da so dran gewöhnt, dass ich daran nichts mehr ändern möchte.","replies":[{"poster":"Enderized","date":"2018-02-05T17:45:29.242+0000","up_votes":2,"down_votes":0,"body":"Die meisten ändern auch die Hotkeys nicht, da sie meist schon einen gewissen Sinn haben und entsprechend der Grundsteuerung ausgerichtet sind.\nGeändert werden Hotkeys nur dann, wenn sie unpraktisch sind. zB wirst du selten jemanden haben, der in WoW wirklich die vorgegebenen Tastenkürzel:\n1 2 3 4 5 6 7 8 9 0 ß ´ benutzt, da diese mit der Charaktersteuerung W A S D interferieren wenn man die Maus für die Kamerasicht verwendet.\nAlternativ ändert man Tastenkürzel auch nur, wenn ähnliche Funktionen in anderen Spielen auf anderen Tasten gelegt sind und man deswegen an diese gewöhnt ist. Dies tritt meistens bei Shootern auf, da manche Shooter über Shift zB Sprinten haben und STRG Ducken - andere umgekehrt etc.","replies":[]}]},{"poster":"lolibus","date":"2018-02-06T22:17:57.291+0000","up_votes":1,"down_votes":0,"body":"Hab F1 - F4 belegt.","replies":[]},{"poster":"INoKami","date":"2018-02-05T19:37:32.242+0000","up_votes":1,"down_votes":0,"body":"Ich habs mir auf Shift +Q/W/E/R gelegt, weil... keine Ahnung. Habs gemacht und komme klar damit^^\n\n_\nAber das schlimme ist, in DotA ist ein Tastenkombination mit Shift anscheinend nicht möglich, also musste ich das ändern... auf ^ +Q/W/E/R. Wieso auch immer. Und ich verwechsle es immer noch manchmal xD_","replies":[]},{"poster":"Enderized","date":"2018-02-05T17:24:40.614+0000","up_votes":1,"down_votes":0,"body":"Kommt darauf an, was du für eine Tastatur hast und ob du 3 oder 4 Finger auf Q W E R spielst.\nIch für meinen Teil spiele mit nur 3 Fingern auf Q W E R und habe den kleinen entsprechend immer frei um STRG zu drücken.\n\nBenutzt du die ALT Taste für den automatischen Selfcast (bzw Selfcast im allgemeinen)? Wenn nicht, könntest du gg. diese Taste dafür belegen.","replies":[{"poster":"Stè94an","date":"2018-02-05T17:28:10.409+0000","up_votes":1,"down_votes":0,"body":"Jo die Alt Taste benutz ich für Spells auf mich selber","replies":[{"poster":"Enderized","date":"2018-02-05T17:34:30.574+0000","up_votes":1,"down_votes":0,"body":"Mhh- dann wird's natürlich schwierig. (gibt halt viele die die Alt+Spell Combo nicht kennen oder nutzen, deshalb dachte ich wäre 'ne Idee wert)\nSry, aber mir fällt dazu absolut nichts ein-\nIn wie weit ist die STRG Taste eigl unangenehm? Hast du große/kleine Hände? Was für eine Tastatur hast du?","replies":[{"poster":"Stè94an","date":"2018-02-05T18:39:11.886+0000","up_votes":1,"down_votes":0,"body":"Naja ne normale Laptop Tastatur halt. Meine Hände würd ich als klein bzw normal einstufen ^^, ich komm wenn ich die anderen Finger auf qwer hab da nicht dran jedenfalls, da sie zu weit unten ist.","replies":[{"poster":"Enderized","date":"2018-02-05T18:52:44.045+0000","up_votes":1,"down_votes":0,"body":"Mh ._.\n\nAlso ich komme halt Problemlos wenn ich meine Finger auf Q, W und E/R habe eigl Wunderbar mit dem kleinen Finger an die Tasten STRG, Shift und Caps. ._.","replies":[]}]}]}]}]},{"poster":"Stè94an","date":"2018-02-05T18:41:06.836+0000","up_votes":1,"down_votes":0,"body":"Joa, wie kommt ihr da dran an die Strg Taste, wenn ich versuch da dranzukommen brech ich mir den kleinen Finger :D","replies":[]},{"poster":"Reliable Support","date":"2018-02-05T17:20:29.091+0000","up_votes":1,"down_votes":0,"body":"> Strg Taste liegt ja nicht gerade angenehm\n\nUnd deswegen spiele ich auf ASDF und nicht QWER","replies":[{"poster":"Stè94an","date":"2018-02-05T17:24:47.181+0000","up_votes":1,"down_votes":0,"body":"Selbst dann liegt sie immer noch nicht angenehm","replies":[]}]}]}