{"poster":"Cobr4N","date":"2015-11-08T15:55:00.461+0000","title":"Krabbe 2.0","subforum":"Melde einen Bug","up_votes":1,"down_votes":3,"body":"http://www.bilder-upload.eu/show.php?file=efd92e-1446927458.png\r\nhttp://www.bilder-upload.eu/show.php?file=957536-1446941348.png\r\n\r\n\r\nkann sich bitte jemand beide links angucken und mir sagen warum die krabbe verschiedenes leben hat?\r\n\r\nwenn jetzt jemand ankommt und sagt, dass die krabbe schonmal get&ouml;tet wurde...\r\nich sag wie es ist:\r\n\r\ndie Krabbe spawnt bei 2:30\r\ndie krabbe gibt 75 sekunden vision.\r\ndie krabbe m&uuml;sste bei 1:24 get&ouml;tet worden sein.\r\n\r\nich will einfach nur aufgekl&auml;rt werden, woran das liegt, dass die Krabbe 1060 anstatt &quot;normale&quot; 800 leben hat.\r\n\r\nMein letzter Beitrag wurde gel&ouml;scht und eindeutig gesagt, dass es v&ouml;llig normal ist, dass die Krabbe 1060 leben hat und es wurde irgendwie begr&uuml;ndet, dass wenn man cc auf die krabbe anwendet, das ssich danns hcaden erh&ouml;ht blabla... interessiert mich alles garnicht.\r\n\r\nich will wissen, warum die krabbe nicht bei 800 leben spawnt und bitte eine m&ouml;glichst korrekte antwort erhalten.\r\n\r\n\r\n{{champion:32}}","replies":[{"poster":"Humpelstilzche","date":"2015-11-08T16:28:37.920+0000","up_votes":2,"down_votes":0,"body":"> Mein letzter Beitrag wurde gelöscht\n\nIch gehe mal davon aus dass du von einem anderen Account sprichst, denn auf diesem hier wurde noch nie irgendwas gelöscht, außer du warst das selbst (denn das wird dann im Moderatoren-Tool nicht angezeigt).\n\nedit: Nevermind. Dein Beitrag wurde schlicht und einfach nie gelöscht, er befindet sich nach wie vor genau da wo er vorher war: \nhttp://boards.euw.leagueoflegends.com/de/c/melde-einen-bug/n0t5BgsF","replies":[{"poster":"Cobr4N","date":"2015-11-08T18:39:34.973+0000","up_votes":1,"down_votes":1,"body":"ok, hab das irgendwie falsch gesucht. danke","replies":[]}]},{"poster":"Undread Sazuna","date":"2015-11-09T09:41:29.537+0000","up_votes":1,"down_votes":0,"body":"Häufig von den anderen geschrieben sie kriegt auch lvl ups selbst wenn sie nicht getötet wird! Frag mal Drake und Baron. Das Leben reseted nach einer bestimmten Zeit so wie die anderen Monster auch.","replies":[{"poster":"Cobr4N","date":"2015-11-09T15:37:29.482+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Sazuna,realm=EUW,application-id=ImBE6GqA,discussion-id=jI221dZR,comment-id=0003,timestamp=2015-11-09T09:41:29.537+0000)\n>\n> [...] Das Leben reseted nach einer bestimmten Zeit [..]\n\n\nnach 9 sekunden?\nich habe teilweise spiele wo die krabbe nach 11 minuten immernoch bei 800 leben ist.","replies":[{"poster":"Undread Sazuna","date":"2015-11-10T08:03:03.582+0000","up_votes":1,"down_votes":0,"body":"Ehm tja... das ist was anderes denke ich. Ich meinte der Reset wenn man ihn in Ruhe lässt nicht die Lebenserhöhung. Ich denke das wird nach dem töten \"neu berechnet\" wenn er wieder zurückkommt. Durchschnittlvl aller Spieler pipapo quasi. Folglich wird er immer noch den Anfangswert haben wenn er nie gekillt wurde. Guten Appetit {{champion:31}} ^^ Krabbler mit 800 Leben bei lvl 6+ XD","replies":[]}]},{"poster":"Undread Sazuna","date":"2015-11-09T09:42:21.969+0000","up_votes":1,"down_votes":0,"body":"P.S. Ich denke der Herold wird genauso sein.","replies":[]}]},{"poster":"Schesam","date":"2015-11-09T16:16:36.357+0000","up_votes":1,"down_votes":0,"body":"Gleich als erstes: jungle creeps lvl NICHT mit, wenn mans ie nciht tötet, außer Baron und der Drache. Kann man gut im Custom nachverfolgen, wenn man nach 16min zum ersten mal in den Gegnerjungel geht und die Creeps immer noch lvl 2 und fast instant tot sind. Das Die Krabbe aber mehr leben aht, owohl beide lvl 2 sind ist schon komisch :) UNd es spawnen alle Camps mit lvl 2","replies":[]},{"poster":"Crounty","date":"2015-11-08T16:50:13.338+0000","up_votes":1,"down_votes":0,"body":"Die war da auf level 2, anscheinend waren die meisten champs auch auf lvl 2 oder höher und wie wir ja alle wissen, mehr lvl = mehr leben","replies":[{"poster":"Cobr4N","date":"2015-11-08T18:40:45.444+0000","up_votes":1,"down_votes":1,"body":"war nicht der fall. das kann ich mti gewissheit sagen.\n\nsollte die krabbe automatisch mitleveln auch wenns ie nicht getötet wird, dann wo steht das?","replies":[{"poster":"Crounty","date":"2015-11-09T06:18:47.193+0000","up_votes":1,"down_votes":0,"body":"Jungle monster leveln generell mit uns","replies":[]}]},{"poster":"Cobr4N","date":"2015-11-08T18:36:48.950+0000","up_votes":1,"down_votes":1,"body":"levelt die krabbe automatisch mit, auch wenn sie nicht getötet wird?","replies":[]}]},{"poster":"SorisDynasty","date":"2015-11-08T16:02:58.818+0000","up_votes":1,"down_votes":0,"body":"Ich habe im letzten Beitrag nicht begründet, dass es so normal wäre. Ich kannte die genauen Werte tbh nicht und du hast die 800 HP erst später erwähnt. Also bin ich von ausgegangen, die 1k wären bereits normal.\nDas ist wieder eine Sache von: Nicht genug Infos zur Verfügung gestellt. Wäre das direkt im Post gewesen, hätte ich genauer Nachschauen können. \n\nAnders gesagt: Hilf den Leuten dir zu helfen mit sovielen Infos, die dir zur Verfügung stehen, wie möglich.\n\nB2T: Mit der nun gegebenen Info - keine Ahnung, wie der Bug auftaucht. Im Wiki stand auch nichts dazu. Kann dir nur den Tipp geben, mal die Champs zu beobachten, die in den Spielen sind, wo es rumbuggt und wenn nicht. Wenn ein Champion wiederholend auftaucht, kann er vll irgendeine Ursache sein.","replies":[{"poster":"Cobr4N","date":"2015-11-08T18:32:48.596+0000","up_votes":1,"down_votes":1,"body":"ich bin davon ausgegangen, dass jeder weis was sache ist, denn in der regel heißt es, mach die erste krabbe bringt 50 gold und hat nur 800 leben^^\nsorry then.","replies":[]}]}]}