{"poster":"Zerint","date":"2015-09-03T22:00:43.521+0000","title":"Cantidad de gente \"Toxica\" aumento ultimamente?","subforum":"Comportamiento del jugador","up_votes":1,"down_votes":0,"body":"Me esta pasando estos &uacute;ltimos d&iacute;as algo que no me pasaba antes. Antes me cruzaba de vez en cuando con gente que flameaba, y rara vez con trolls y afks. Pero, &uacute;ltimamente en normales me estoy encontrando muchisima gente que se va afk, y muchisima gente que se enoja y empieza a trollear, tanto aliados como enemigos. Quiero preguntar, &iquest;es posible que haya aumentado esta clase de gente o puede que sea casualidad que a mi me empiecen a aparecer ahora? Porque la verdad me enoja muchisimo, por ejemplo recien apuntando normales, estuve media hora facil tratando de unirme a una partida pero alguien se salia, o por autolock o porque ya empezo a flamear porque la linea que queria la perdio o por gente que decia que iba a trollear. Ya no puedo ni jugar una partida, estuve asi facil 5 veces hasta que me canse y cancele la cola. A ustedes les pasa lo mismo?","replies":[{"poster":"POD L33t","date":"2015-09-03T22:37:55.623+0000","up_votes":1,"down_votes":3,"body":"EN normales es peor todavia.... en ranked gracias a dios cuando veo que van antimeta o gente que prueba champs sin antecedentes como la gente, enseguida voy troll y si ninguno dodgea, quiteo yo.  Pero toxica hay en todos lados a cualquier hora, los 365 dias del año.","replies":[{"poster":"Waninoko Main","date":"2015-09-04T20:03:11.063+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=POD L33t,realm=LAS,application-id=PJAKt7ph,discussion-id=ajndE6EF,comment-id=0000,timestamp=2015-09-03T22:37:55.623+0000)\n>\n> EN normales es peor todavia.... en ranked gracias a dios cuando veo que van antimeta o gente que prueba champs sin antecedentes como la gente, enseguida voy troll y si ninguno dodgea, quiteo yo.  Pero toxica hay en todos lados a cualquier hora, los 365 dias del año.\n\n\"enseguida voy troll\" no se si sabes pero el contrato de Riot dice que tienes que jugar tan bien como tu habilidad te lo permita porque trollear es un comportamiento reprochable eso de si van con Anivia soporte y por eso vas a trollear es inmadures capaz la Anivia soporte termina la partida 6-0-21 y tu trolleando y arruinando el juego","replies":[{"poster":"Thecloyster","date":"2015-09-06T13:07:40.700+0000","up_votes":2,"down_votes":0,"body":"Parece que no le entendiste :P\n\nEl habla de ir en una linea ya pickeada (troll pick) para que alguien del equipo se vaya de la seleccion de campeones y que el no tenga que esperar 5 o 10 minutos.No está hablando de jugar la partida y trollearla\n\nPd:Dodgear significa salirse de la seleccion de campeones o esquivarla","replies":[{"poster":"Waninoko Main","date":"2015-09-06T14:40:29.600+0000","up_votes":1,"down_votes":0,"body":"ahora si entendí jeje gracias por la aclaración :) y no se no tomo tan en serio las normales por ahora XD si las juego juego bien mi parte y con eso me conformo y no juego clasificatorias por el momento xd","replies":[{"poster":"POD L33t","date":"2015-09-15T20:05:18.076+0000","up_votes":1,"down_votes":0,"body":"Nunca cague una partida ranked haciendome el troll. He tenido malas partidas pero siempre tratando de dar lo mejor. \nComo dijo THECLOYSTER es exactamente a lo que me referia. Por si no sabias, si te quitas en la seleccion de campeon (excepto que estes en promocion cuenta como derrota), solo pierdes 2 o 3 LP, pero no pierdes ELO. \nPor ejemplo si una shyvana va AP MID, sabiendo que le va a ir mal, tenes dos opciones. O haces troll pick con la intencion que alguien se salga, o si sabes que vas a carrear y le miras el historial con shyvana AP MID juega bien (98% de las veces nunca pasa esto), entonces la jugas, pero podes perder de 14 a 22 LP, perder ELO y perder 35/40 minutos de tu tiempo tratando de carrear lo incarreable.\nEntonces dodgear no es tan mala idea como parece.","replies":[]}]}]}]},{"poster":"WenaMapache","date":"2015-09-04T00:07:50.628+0000","up_votes":1,"down_votes":1,"body":"Osea si voy con un campeon que a ti no te gusta y que se usar, vas a quitear?","replies":[{"poster":"POD L33t","date":"2015-09-15T20:07:01.668+0000","up_votes":1,"down_votes":0,"body":"Exacto, si va una Lux supp o Tf top me voy a quitear.","replies":[{"poster":"Waninoko Main","date":"2015-09-16T00:48:01.352+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=POD L33t,realm=LAS,application-id=PJAKt7ph,discussion-id=ajndE6EF,comment-id=000000000000,timestamp=2015-09-15T20:07:01.668+0000)\n>\n> Exacto, si va una Lux supp o Tf top me voy a quitear.\n\nPues tu puedes evadir la lux supp y yo carrilear usandola jeje :) es un buen pick igual ademas no hace falta elegir lo roto para ganar","replies":[]}]}]},{"poster":"DieOrSovngarde","date":"2015-09-04T23:40:23.490+0000","up_votes":1,"down_votes":3,"body":"Cuando tu madre te dio a luz, el partero le dijo a tu viejo que eras el antimeta","replies":[]}]},{"poster":"Krilin Noda Oro","date":"2015-09-03T23:03:32.379+0000","up_votes":1,"down_votes":0,"body":"A mi parecer siempre estan ahi, pero si te sirve como una excusa estamos a mitad de año por lo cual el estres  hace explotar mas facil a la mayoria de malhumorados.","replies":[]},{"poster":"The PeluuKa ","date":"2015-09-03T22:59:15.779+0000","up_votes":1,"down_votes":0,"body":"nosotros tenemos que reclamar po wn para q coloquen un sistema decente para los flamer asi de una vez por todas cambien su actitud .","replies":[]}]}