{"poster":"Stahlvater","date":"2015-11-13T13:27:44.776+0000","title":"Tank Jungle sind zerstört dank des neuen Patchs","subforum":"Champions & Gameplay","up_votes":1,"down_votes":3,"body":"Hab gerade mit Sejuani (mein Main Tank Jungle) gespielt und ich hatte keine chance mehr.\r\nSeit der wegbereiter weg ist kann ich es vergessen.\r\nUnd dann 10% Lebensraub gegen monster bei JEDEM jungle item das is so eine schei&szlig;e\r\nDas hei&szlig;t nun der jungle wird von k&auml;mpfern regiert und tank jungler sind nun im eimer\r\nDanke Riot! Die ganzen neuen items sind einfach nur schei&szlig;e und dann erst die masteries\r\nnach dem prinzip nimm das oder das andere so ein bullshit","replies":[{"poster":"Kartoffelking983","date":"2015-11-13T13:58:33.543+0000","up_votes":1,"down_votes":0,"body":"Du hast full ap runen keine penetration keine rüstung oder sonst was das selbe bei ad und keine tank runen und mal jungler item zu kaufen wäre auch sinnvoll...","replies":[{"poster":"Stahlvater","date":"2015-11-14T09:20:53.801+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Kartoffelking983,realm=EUW,application-id=Wj1wcocU,discussion-id=bzm6FI8z,comment-id=0002,timestamp=2015-11-13T13:58:33.543+0000)\n>\n> Du hast full ap runen keine penetration keine rüstung oder sonst was das selbe bei ad und keine tank runen und mal jungler item zu kaufen wäre auch sinnvoll...\n\nDas is doch wurscht mit meinen Runen früher hat das auch mit denen geklappt und jetzt bekomm ich mit sejuani gerade noch so nach dem gromp den blue hin und das nur mit glück!\nUnd außerdem: Hast du tomaten auf den augen??? ich hab mir das behinderte jungleitem gekauft und die angeblichen 150% Manareg im jungle bekomme mal zumindest ich nicht hab standardmäßig OHNE das teil auch ne manareg von 3.0 mit sejuani sobald ich im jungle bin wird das 3.4!!!\nalso wenn 150% von 3.4 sind dann erschieß mich doch. Davor hatte ich mit dem Wegbereiter ne manareg von 11 im kampf und jetzt gerade mal 3.4\nDer Jungle is jetz im eimer ein grund für mich mal ne weile kein lol zu spielen","replies":[{"poster":"Kartoffelking983","date":"2015-11-14T21:31:15.151+0000","up_votes":1,"down_votes":1,"body":"...ich kann sogar ohne runen weiter kommen und du brauchst sachen wie penetration und rüstung einfach im jungle!","replies":[]}]}]},{"poster":"Nezraddin","date":"2015-11-13T14:21:00.714+0000","up_votes":1,"down_votes":0,"body":"Um fair zu sein, muss ich aber sagen, dass ich auch nicht wirklich verstehe wieso sie das \"Bekommt x Leben pro sekunde wenn von einem Junglemonster getroffen\" in Lebensraub geändert haben. Weil Lebensraub eben doch sehr wenige Champions dann bevorzugt.\n\nDas andere Item mit Mana-Regeneration andererseits ist natürlich ziemlich schlecht für nicht-mana-champions (Rengar, Lee Sin). Aber wiederrum gut für viele Champions die auch vom Lebensraub profitieren (Jarvan, Xin Zhao).\nSomit ziehen im Moment einige Champions Vorteile aus beiden Jungleitems während andere Champions im Grunde nur wirklich aus einem Item etwas für ihren Jungle bekommen und das andere kaufen \"Weil es sein muss\". \nAlso durch die Änderung zu den zwei Jungleitems und hin zum Lebensraub statt Leben-pro-sekunde ist durchaus eine kleine Ungleichheit der Junglechampions entstanden, wo manche eben deutlich mehr durch die Änderungen profitieren als andere.\n\n[edit]\nIch nehme an, es wurde zu Lebensraub damit der Stat auch in Teamfights seine Berechtigung hat und hilft, aber rein auf den Jungle gesehen ist es eine seltsame Änderung.","replies":[{"poster":"Bergelmir32","date":"2015-11-13T14:51:24.062+0000","up_votes":1,"down_votes":0,"body":"Da steht nicht umsonst \"Lebensraub gegen Monster\". Das hilft im Teamfight 0.\nIch hoffe die passen das wieder an, denn grade das es eben nicht mehr Lebensraub oder On-hit Heilung war waren alle Junger relativ gleichberechtigt. Jetzt sind die die vorallem auf AAs setzten wieder im Vorteil.","replies":[{"poster":"Nezraddin","date":"2015-11-13T15:01:25.152+0000","up_votes":1,"down_votes":0,"body":"Ah entschuldige bitte. Bei so vielen neuen Daten (zuviel geändert! ^^) hatte ich den Zusatz für den Lebensraub nicht mehr im Kopf.\n\nAber ja, es wäre schön, wenn die das wieder zurückändern würden. Die Änderung sind doch sehr einseitig bevorzugend im Moment. Vorher war es viel besser \"für alle die junglen wollen bringt es etwas\"-Gleichberechtigt.","replies":[]}]}]},{"poster":"Drunkendonger","date":"2015-11-13T14:55:49.499+0000","up_votes":1,"down_votes":0,"body":"Und ich spiele Lux Jungle und gewinne noch  xDD trololol","replies":[]},{"poster":"SKT T1 Réngar","date":"2015-11-13T13:50:21.788+0000","up_votes":1,"down_votes":0,"body":"Bei deinen Runen kein wunder xD","replies":[]},{"poster":"Kriegs Schwein","date":"2015-11-13T13:36:21.570+0000","up_votes":1,"down_votes":0,"body":"Komm drauf klar","replies":[]}]}