{"poster":"SugarCloud","date":"2016-09-08T11:36:04.547+0000","title":"The new Yorick","subforum":"Miscellaneous","up_votes":2,"down_votes":0,"body":"Hi everyone! I&#039;m just here to say that I&#039;m honestly very proud of riot with the new {{champion:83}}rework. I have to say that I&#039;m having a tremendous amount of fun playing Yorick in the top lane now. I also really admire the fact that he is a much better team fighter than before now, due to his passive and W. I can always feel satisfied with my creep score as well as my damage output even thought i am building more of a tanky playstyle.\r\n\r\nI just wanted to know anyone else&#039;s opinion on the rework, like if anyone can see any negative sides to the rework, or if anyone loves it just like i do, please do let me know :)\r\n\r\npce out,\r\nSugarCloud","replies":[{"poster":"Saris","date":"2016-09-09T05:11:41.403+0000","up_votes":1,"down_votes":0,"body":"Hey there! I'd have to say I feel the exact same. Yorick never really excited me until his current rework. He's a very strong top lane and much better team fighter. This isn't my own complaint but I think some people will feel a bit alienated, since yorick really isnt yorick anymore. I've seen a lot of yorick purist's over forums and ingame complain heavily about the change. \n\nHonestly, I think its one of the best reworks riot has done! He's actually playable now in my eyes, and fits my play style to a T!\nI've been going with a more standard dmg build.  \n I've going with\n{{item:3742}} {{item:3071}} {{item:3065}} {{item:3004}} and {{item:3512}} against a balanced team or either {{item:3075}} - {{item:3156}} depending on whether the team is heavy ad or ap.\nI really like the build so far, since I feel like I have the dmg I want/need and enough sustain. \n\nI'd like to hear about your tank build and how that's been working for you.","replies":[{"poster":"Chalze","date":"2016-09-09T07:00:31.471+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Saris,realm=OCE,application-id=Ntey9fRZ,discussion-id=tbd5orPr,comment-id=0000,timestamp=2016-09-09T05:11:41.403+0000)\n>\n> Hey there! I&#x27;d have to say I feel the exact same. Yorick never really excited me until his current rework. He&#x27;s a very strong top lane and much better team fighter. This isn&#x27;t my own complaint but I think some people will feel a bit alienated, since yorick really isnt yorick anymore. I&#x27;ve seen a lot of yorick purist&#x27;s over forums and ingame complain heavily about the change. \n> \n> Honestly, I think its one of the best reworks riot has done! He&#x27;s actually playable now in my eyes, and fits my play style to a T!\n> I&#x27;ve been going with a more standard dmg build.  \n>  I&#x27;ve going with\n> {{item:3742}} {{item:3071}} {{item:3065}} {{item:3004}} and {{item:3512}} against a balanced team or either {{item:3075}} - {{item:3156}} depending on whether the team is heavy ad or ap.\n> I really like the build so far, since I feel like I have the dmg I want/need and enough sustain. \n> \n> I&#x27;d like to hear about your tank build and how that&#x27;s been working for you.\n\nYo dude get a TriForce early and everyone will be scared of you {{champion:83}} {{item:3078}}","replies":[{"poster":"Damocracy","date":"2016-09-09T08:44:22.071+0000","up_votes":1,"down_votes":0,"body":"Tonnes of damage!","replies":[{"poster":"theminiom","date":"2016-09-11T10:25:42.069+0000","up_votes":2,"down_votes":0,"body":"Well refrenced my friend,well refrenced","replies":[]}]}]}]},{"poster":"QAPLA","date":"2016-09-11T10:50:44.687+0000","up_votes":1,"down_votes":0,"body":"He's a bit OP.\nI have played him twice now (in ARAM). Once, on the day of release, where my team facerolled and I didn't have much time to get used to him.\nAgain today I got him in ARAM, and got an S. You shouldn't really get S grades on champs the second time you play them, because it's not that I'm amazing, it's that he's overtuned. Watch him get nerfed in a week or two, just like every other new (or reworked) champ.","replies":[]},{"poster":"Xenoblade","date":"2016-09-09T22:23:24.342+0000","up_votes":1,"down_votes":0,"body":"Painful to play but hes a tanky pusherdonger. He is alright but I reckon he will either be kept the same or bugged. I haven't played a game where they also didn't have a Yorick though so I wouldn't know.","replies":[]},{"poster":"xDarkRavenx","date":"2016-09-09T19:51:55.143+0000","up_votes":1,"down_votes":0,"body":"I'm surprised he's not broken as. \n\n...But would it be alright if Riot could at least tune down his heal a teeny-tiny bit?","replies":[]},{"poster":"Damocracy","date":"2016-09-09T08:43:26.730+0000","up_votes":1,"down_votes":0,"body":"He is balanced as well. This a great job by Riot for once. He has counter play, he can be strong if picking the right moment and can be punished if he misses a certain combo. His ulty is good as well if done right but also can be weak if done wrong. \nVery balanced  for once.","replies":[]},{"poster":"Nijel","date":"2016-09-09T06:48:27.019+0000","up_votes":1,"down_votes":0,"body":"Haven't had a chance to play him yet but from just looking at his abilities it looks like he's got more variety and depth than he used to. Old Yoz was fun in a face roll kinda way but he never quite got there numbers wise. Now that he has some split pushing and zone control it should be easier to balance him out to a good spot I think. \n\nRegardless, I still don't want to see him in my Ranked games for the next three weeks ; )","replies":[]}]}