{"poster":"Homiee","date":"2015-04-21T13:34:41.497+0000","title":"Alle Champions für Aram freischalten","subforum":"Karten & Spielmodi","up_votes":2,"down_votes":2,"body":"Hi,\r\n\r\naufgrund der vielen Aram Smurfs bin ich der Meinung, dass man im Aram alle Champions f&uuml;r alle freischalten sollte. Es macht einfach keinen Sinn zuf&auml;llige Champions zu haben, aber sie durch Eink&auml;ufe so extrem zu beeinflussen. Inzwischen sind wirklich in jedem Game Aram Smurfs, die sich nur Champions wie Xerath, Nidalee etc. gekauft haben und dadurch den Spielspa&szlig; extrem nach unten hauen f&uuml;r die, die sich nicht extra einen neuen Account f&uuml;r Arams machen wollen. Ich starte noch eine Umfrage, damit man sehen kann wie viel daf&uuml;r sind. Wahrscheinlich stimmen alle Aram Smurfs sowieso f&uuml;r Nein...","replies":[{"poster":"Taihuang","date":"2015-04-21T14:39:30.038+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Homiee,realm=EUW,application-id=cGRapXds,discussion-id=YQilqz7t,comment-id=,timestamp=2015-04-21T13:34:41.497+0000)\nWahrscheinlich stimmen alle Aram Smurfs sowieso f&uuml;r Nein...\n\nBin kein ARAM-Smurf, finde es auch lächerlich solche Accounts zu erstellen, trotzdem\nhabe ich für NEIN gestimmt.\nIst schon ok so, jeder hat seine gekauften Champions zu Auswahl.\nWer meint man kann nur so gewinnen, der hat noch nie gegen kompetente Spieler gespielt.\nSchade das es keine \"Funrangliste\" für ARAM & Dominion gibt.\nWenn mein Gegnerteam nur aus AP-Poke-Champions besteht dann lächel ich,\nspiel das bis Stufe 6-9 safe, stacke dabei MRes (defensive Stats sind auch so ein Kuriosum auf der HA die keiner kennt)\nund mach dann nen Full-Engage --> GG :-)","replies":[{"poster":"Like a Sir","date":"2018-02-05T11:07:14.217+0000","up_votes":1,"down_votes":0,"body":"Hart ist nur wenn du mal nen ADC im Team hast und die Gegner sind sehr Tanky.\nIrgendwie sind fast alle ADC zu dämlich um als 3 item ein Lord Dominik oder Blade of the Ruined King zu bauen.\nNein die bauen alle dumm ihr Infinity Edge Boots 2 Krit item und Bloodthirster, was glaubst du wie oft ich schon verloren hab einfach weil der ADC nutzlos war -.-","replies":[]}]},{"poster":"Evenrider","date":"2015-04-21T13:36:53.395+0000","up_votes":2,"down_votes":0,"body":"Woher weiß du, dass es Aram Accounts sind?\nNir weil sie Xerath, Nidalee,... erhalten?","replies":[]},{"poster":"NandizZ","date":"2018-02-02T22:21:59.433+0000","up_votes":1,"down_votes":0,"body":"Ich kann dem nur zustimmen Homiee.","replies":[]},{"poster":"Homiee","date":"2015-04-21T13:38:59.540+0000","up_votes":1,"down_votes":0,"body":"Selbst wenn es nicht extra Aram Accounts wären würde es trotzdem mehr Spaß machen, wenn man die Champions nicht durch Einkäufe beeinflussen kann. Dadurch wäre es nämlich wirklich Random.","replies":[{"poster":"Evenrider","date":"2015-04-21T14:02:02.957+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Homiee,realm=EUW,application-id=cGRapXds,discussion-id=YQilqz7t,comment-id=0001,timestamp=2015-04-21T13:38:59.540+0000)\n>\n> Selbst wenn es nicht extra Aram Accounts wären würde es trotzdem mehr Spaß machen, wenn man die Champions nicht durch Einkäufe beeinflussen kann. Dadurch wäre es nämlich wirklich Random.\n\nWenn du mir antworten willst, solltest du auch auf meinem Post antworten und nicht ein weiteren Kommentar hinterlassen.\n\nAnsonsten stimme ich dir zu. Ich würde es auch besser finden, wenn alle Champions verfügbar sind, auch wenn es mich selbst treffen würde.\nIch spiele nämlich recht gerne Magier, Support und ADC. Diese haben meist beträchtliche Reichweiten und sind deshalb sehr gefragt in Aram. Da ich die gerne spiele kaufe ich diese auf vorrangig und habe so eine Art Aram-Account. Wenn auch unbeabsichtig :D\n\nTrotzdem kann ich auch Riot verstehen. Riot möchte nicht, dass jedem alle Champions zugänglich sind. Zum testen ist dann die Free Rotation da. Nun gäbe es dann aber Aram, indem ich trotzdem jeden Champion bekomme. Und je weniger Champions ich hätte, desto höher ist die wahrscheinlichkeit, dass ich dort andere Champions testen kann.\nWeiterhin möchte Riot jedem Spieler ein schönes Spielerlebnis geben. Und manche wollen eben bestimmte Champions nicht aufgezwungen werden bekommen. Da ich mir die Champions gekauft habe, kann man davon ausgehen, dass sie mir gefallen. Deshalb kann Riot sie auch in die Zufallswahl mit einbeziehen.\nAber überleg mal was passiert, wenn Zed weder in der Rotation noch von mir gekauft ist und ich ihn erhalte?\nDann verlange ich einen Free Reroll, oder einen Free CS Dodge, da ich diesen Champion nicht spielen will!\nWenn ich das nicht bekomme, würde dies mein Spielerlebnis mindern. Und auf lange Sicht, würde ich Aram nicht mehr spielen oder direkt auf ein Konkurenzprodukt wechseln.","replies":[{"poster":"Homiee","date":"2015-04-21T14:29:43.930+0000","up_votes":1,"down_votes":0,"body":"Ich möchte manche Champions die ich in meinem Account habe auch nicht im Aram spielen^^. Aber deshalb quitte ich ja nicht (was leider auch sehr viele machen). Ich verstehe natürlich deine Begründung, aber es ist nunmal so, dass es ja Random sein SOLL. Wenn man jetzt also wie du einfach nur High-Range Champions gekauft hat man numal einen großen Vorteil gegebnüber anderen Spielern und das verdirbt natürlich denen den Spaß an der Sache. Wirklich testen kann man die Champions in Aram sowieso nicht und man bekommt auch immer mal wieder Champions die man einfach nicht so gut kann wie andere.","replies":[{"poster":"Evenrider","date":"2015-04-21T14:43:35.093+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Homiee,realm=EUW,application-id=cGRapXds,discussion-id=YQilqz7t,comment-id=000100000000,timestamp=2015-04-21T14:29:43.930+0000)\n>\n> Ich möchte manche Champions die ich in meinem Account habe auch nicht im Aram spielen^^. Aber deshalb quitte ich ja nicht (was leider auch sehr viele machen). Ich verstehe natürlich deine Begründung, aber es ist nunmal so, dass es ja Random sein SOLL. Wenn man jetzt also wie du einfach nur High-Range Champions gekauft hat man numal einen großen Vorteil gegebnüber anderen Spielern und das verdirbt natürlich denen den Spaß an der Sache. Wirklich testen kann man die Champions in Aram sowieso nicht und man bekommt auch immer mal wieder Champions die man einfach nicht so gut kann wie andere.\n\nDu hast dir die Champions aber gekauft, weil sie dir gefallen und du sie spielen willst. Das manche Modi bestimmte Champions bevorzugen, weiß auch Riot (z.B. Fighter, Assassins in Dominion, Mages in Aram).\nDeswegen kann Riot auch sagen, wir können diese Champions in die Zufallswahl hineinpacken. Wenn Riot jetzt sagen würde, wir packen alle rein, könnte man auch sagen, dass sie doch alle Champions in JEDEM Spielmodus freischalten sollen, da dies sonst das Spielgefühl mindert. Da in Dominion Assassinen und Bruiser bevorteilt sind, müsste Riot hier ebenfalls jedem Spieler jeden Champion zur verfügung stellen. Nur weil das nicht zufällig ist, heißt das nicht, dass ich als Magier/Support-Spieler in Dominion benachteiligt werden darf, wenn Assassinenspieler in Aram nicht benachteiligt sind.\nDies könnte man auch alle Spielmodi übertragen. Dann müsste Riot jedem Spieler von anfang an alle Champions freischalten.","replies":[{"poster":"Homiee","date":"2015-04-21T14:51:59.654+0000","up_votes":1,"down_votes":0,"body":"Stimmt schon was du sagst, nur in Dominion etc. kann ich auswählen welchen Champion ich haben möchte ich bekomme ja keinen zufälligen, den ich in Dominion gar nicht spielen möchte. Aber im Aram bekomme ich einen zufälligen, nur bei anderen mit nur guten Champions in Aram ist die Chance einfach viel höher, dass sie einen Champion bekommen, den sie auch haben möchten.","replies":[]}]}]}]}]},{"poster":"iScoutx","date":"2015-04-23T16:09:51.075+0000","up_votes":1,"down_votes":1,"body":"Es gibt immernoch die 10 Free2Play Champions also kann man trotzdem nicht immer nur einen Champion spielen.","replies":[]}]}