{"poster":"WSpeechLessC","date":"2019-08-21T21:24:49.520+0000","title":"A Darkin Support?","subforum":"Concepts & Creations","up_votes":1,"down_votes":0,"body":"Ok so hear me out guys, I made a B.S. concept a while ago about this but honestly Idk how to go about with ability dmg, start HP, ect. But I also thought about it another way. You see when I first made the concept the passive was like kayns, like how if he hits a ranged champ he got the shadow and melee got him darkin,  but for the support I figured switch it to attacking or defending as to get the build up of essence and as of gaining enough go from a tank/healer or a frontline tank/dps as for running it top or Jung other then simple support. Alas I figured to take that out and make it's kit simply a mix of both so one can simply build how they want instead of gaining essence or anything.\r\n\r\n\r\nBut the question is, how would people feel of frontline tank, that both damages and heals %health, as in they will run in, deal the damage equal to % health and from that damage can heal allies equal to % damage done and health? See the way I figure it is instead of mana, or anything like that, that's be more like mundo and abilities will take out health to use to balance out early and mid game, but may turn into a late game home wrecker. But what do y'all think of it and what's y'alls thought on making it better??","replies":[{"poster":"Azamandius","date":"2019-08-22T02:01:49.122+0000","up_votes":2,"down_votes":0,"body":"I like the idea of it. maybe the bar  below the health could indicate the amount of health he's stored from damaging enemies. i think the dispersal of the health should be slower output than it would be to store. maybe like a continuous w that heals nearby allies?","replies":[{"poster":"WSpeechLessC","date":"2019-08-22T19:34:47.692+0000","up_votes":1,"down_votes":0,"body":"I like that idea, also with that maybe something like trynd's w in the mix, like the continuous passive is storing the health when attacking and in activation it heals surroundings allies??","replies":[{"poster":"Azamandius","date":"2019-08-26T04:37:06.989+0000","up_votes":2,"down_votes":0,"body":"Exactly, that way he could dive in deal cc or damage then back up and switch to a more support like role","replies":[{"poster":"WSpeechLessC","date":"2019-08-29T17:41:46.040+0000","up_votes":1,"down_votes":0,"body":"Yea I like that, I may try a more in depth concept later today with this","replies":[]}]}]}]},{"poster":"BlackKnightJack","date":"2019-08-22T21:15:32.517+0000","up_votes":2,"down_votes":0,"body":"Whenever I think of a Darkin support I think of a staff that acts like Soraka or Nami only evil.","replies":[]},{"poster":"Sinister Anubis","date":"2019-08-21T21:53:30.457+0000","up_votes":2,"down_votes":0,"body":"We need one yes. didn't bother reading the wall of text but yes. The answer is yes.","replies":[]}]}