{"poster":"ÈvilMorty","date":"2017-07-07T04:11:31.324+0000","title":"Connection issues","subforum":"[ARCHIVED] Help & Support","up_votes":3,"down_votes":0,"body":"Since yesterday i cant get into a normal or custom game. It just either boots me and closes my client or just stays as a black screen. My anti virus software (bit defender) says my labtop is clean, but i was forced to install new windows updates from microsoft against my will and since that update this has happened.","replies":[{"poster":"Broporo","date":"2017-07-08T01:50:18.521+0000","up_votes":1,"down_votes":0,"body":"That latest Windows update might have reset a few internet settings somewhere, so let's make sure to check for that first before we dive too deep into troubleshooting. Check up on your [**network settings**](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues) to ensure everything is still in order there, test it in a practice match and let me know if it helps.","replies":[{"poster":"ÈvilMorty","date":"2017-07-08T04:16:49.032+0000","up_votes":1,"down_votes":0,"body":"I've checked all network settings and even used the hextech repair tool everything seems to be in order, but i still get the same problem. I now have logs though if you want them","replies":[{"poster":"Broporo","date":"2017-07-08T04:35:50.045+0000","up_votes":1,"down_votes":0,"body":"Go ahead and shoot those logs over to our tech guys in a [**ticket**](https://support.riotgames.com/hc/en-us/requests/new). They'll be able to dig through those to see just what exactly is going on that's preventing you from loading into those games.","replies":[]}]}]},{"poster":"Son of Ornn","date":"2017-07-07T21:29:58.708+0000","up_votes":1,"down_votes":0,"body":"A couple of things could be happening here, but let's start with the most likely. From what you're telling me, it sounds like something is interfering with either LoL, it's connection, or both. Normally when I see that it turns out that what's working against you is actually your AV programs or firewalls, thinking that LoL is not safe. Definitely try troubleshooting with [**these steps here**](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues#wq3) to make sure they let LoL through, or just temporarily disable them to see if that was the cause. Let me know if it helps out or you still get the interruptions afterwards, kay? :)","replies":[{"poster":"ÈvilMorty","date":"2017-07-07T21:51:20.212+0000","up_votes":1,"down_votes":0,"body":"When going into a game be it pvp or custom is says my connection is lost or something along those lines and just boots me. My connection is fine since ping/connection testing says im fine.","replies":[]},{"poster":"ÈvilMorty","date":"2017-07-07T21:46:17.349+0000","up_votes":1,"down_votes":0,"body":"My fire wall settings allow league to go through at all times and even after disabling fire wall completely, the same problem happens.","replies":[]}]}]}