{"poster":"Hafud","date":"2019-07-17T11:49:30.080+0000","title":"riot pls fixt die toxicity","subforum":"Allgemeiner Chat","up_votes":1,"down_votes":1,"body":"ich brauche irgendeinen spielmodus ohne teammates ich hatte grade ein game wo mein gegnerischer midlaner afk war ich hatte 25 mejai stacks in minute 15 ich weiß afk abuse undso ne scheiße aber darum gehts nicht obwohl ein gegner afk war und wir einen lächerlichen riesigen vorteil gegenüber den gegner hatten ein q von mir und vayne war fast tod und trz obwohl das alles da war und die gegner komplett auf ganzer linie keine chance hatten wollten meine teammates lieber auf late game spielen afk rumstehen mich flamen weil ich objectives holen wollte und shen hat mich einfach sterben lassen ich meine dass er sich während eines fights neben mich gestellt hat und anstatt den gegner zu cc oder irgendwas lieber mich hat sterben lassen und sich dann erst gekämpft hat damit ich sicher tod war ich könnte weitere sachen aufzählen aber trauriger weise brauch ich das nicht weil jeder league of legends spieler alles kennt was ich jetzt sagen würde \r\nich kann einfach nichtmehr ich will einfach nur upranken \r\naber es ist schwer so schwer weil es einfach nicht ums spiel geht es geht nur darum wollen deine teammates gewinnen oder nicht die meißten leute mit denen ich spiele würden lieber die ganze zeit solo spielen und dann alleine verlieren als mit dem team zu gewinnen ich versteh einfach nicht warum man so unfassbar hasserfüllt ist das man leute die nichts mit einem zu tun haben so unbedingt leiden sehen will und dafür sogar auf sich nehmen zu verlieren nur am den teammate leiden zu sehen wenn es einfach nicht geht diese spieler effizient genug aus dem spiel zu entfernen müsst ihr irgendeine möglichkeit finden das spiel angenehmer für leute zu machen die einfach gewinnen und sich verbessern wollen\r\nich liebe dieses spiel so sehr es ist einfach nur schade dass dessen spieler es unspielbar machen \r\nansonsten seh ich keinen sinn im ranking system wenn es eh nicht ums spiel geht sondern darum ob du deine teammates dazu bewegen kannst das spiel gewinnen zu wollen oder ganz einfach was ich schon immer sage ENTFERNT EINFACH DEN CHAT FÜR ALLE\r\nBITTE ich weiß ab und zu alle 20 spiele trifft man mal eine person die eine nette nachricht im spiel schreibt aber das ist es einfach nicht wert\r\nwenn der chat nicht vorhanden wäre wäre das spiel um ein vielfaches weniger toxic das ist sicher \r\nihr könnt es ja test weise für 1-2 wochen ausprobieren und auf die reaktionen der community achten\r\nes ist einfach so unfassbar deprimierend wenn man alles tut um zu gewinnen alles hat um zu gewinnnen aber man einfach verliert weil dein team dich nicht mag \r\n\r\n\r\nich achte euch mitarbeiter von riot sehr weil ihr immer schnell wart wenn es darum geht probleme im spiel zu beheben aber das allergrößte problem in league undzwar die toxicity lasst ihr unverändert\r\ndas ist ein problem was schon seit anfgang an da war seit so vielen jahren und diesen text und was ich geschrieben habe könnte man 4-5 jahren genauso berechtigt schreiben wie heute \r\nes ist einfach lächerlich und nicht in worte zu fassen wie sehr dieses großartige spiel von diesen widerwertigen ekligen menschen die nichts anderes zu tun haben als leute im internet die sie nicht kennen abzufucken ich will nicht für das traurige leben anderer bestraft werden","replies":[{"poster":"Angel Ayume","date":"2019-07-17T12:33:19.839+0000","up_votes":2,"down_votes":0,"body":"Wenn du möchtest, dass dein Text gelesen wird, solltest du ihn besser gliedern. Vorallem wichtig Groß- und Kleinschreibung, Satzzeichen und mach doch zwischendurch mal einen Absatz.\n\nDein Text liest sie so anstrengend, dass ich nach den ersten 10 Zeilen aufgehört habe...","replies":[{"poster":"faqqet","date":"2019-07-17T14:06:18.297+0000","up_votes":1,"down_votes":0,"body":"Same :D","replies":[]}]},{"poster":"oneshot Vasco","date":"2019-07-18T08:21:36.601+0000","up_votes":1,"down_votes":0,"body":"hab dein text nicht gelesen aber denke mal ist das 0815 anliegen..\n\nTipp von mir: Du kannst jetzt den Team Chat deaktivieren!\n\nIch hoffe ich konnte helfen, einen schönen Tag noch! :)","replies":[]},{"poster":"BlackSugaRose","date":"2019-07-17T12:43:29.927+0000","up_votes":1,"down_votes":0,"body":"Hey flamingislosing,\n\nich verstehe deinen Frust, wir alle kennen diese Spiele.\nVielleicht heitert es dich ja auf, dass Riot tatsächlich eine Möglichkeit eingeführt hat den Chat zu deaktivieren. Wenn dein Client auf Englisch gestellt ist, findest du diese Option unter Interface -> Chat -> \"Show Allied Chat\"\nEs steht dir frei dieses Häkchen rauszunehmen und nun jede Runde ohne den Teamchat zu spielen. Du kannst selbstverständlich weiterhin über Pings kommunizieren.\nEine Sache, die du vermutlich nicht hören willst, die ich dir aber trotzdem nahelegen möchte, ist dass die Wahrscheinlichkeit auf deiner Seite steht.\nMit Sicherheit gibt es Flamer, AFK'ler und Trolle, die manch ein Spiel sabotieren können, aber bitte bedenke, dass auf der gegnerischen Seite fünf zufällige Spieler landen und auf deiner Seite nur vier. Wenn du dich also selbst von deiner besten Seite zeigst, ist die Wahrscheinlichkeit größer, einen der genannten Spieler im Gegnerteam zu haben, auch wenn es einem oft anders vorkommt.\nAbgesehen davon kannst du Spieler, die sich schlecht verhalten Ingame muten und nach dem Spiel reporten, denn nur so können sie ihre Strafe erhalten.\n\nMach vielleicht erstmal eine kleine Pause von dem Spiel, wenn es dich so sehr belastet, TFT hat jetzt schließlich auch einen Ranked Modus. ;)\n\nWir sehen in in der Kluft!\nBlackSugaRose","replies":[]},{"poster":"Hafud","date":"2019-07-17T11:59:09.588+0000","up_votes":1,"down_votes":0,"body":"nvm ich spiel einfach tft \nvlt spiel ich irgendwann nochmal normal lol wenn ich nach nem grund suche mich umzubringen","replies":[]}]}