{"poster":"Hafud","date":"2018-10-08T13:54:41.745+0000","title":"lol is kein chat forum","subforum":"Allgemeiner Chat","up_votes":3,"down_votes":4,"body":"nur kurz als beispiel damit ihr wisst was ich meine in meiner letzten runde lief early game perfekt ich hab als graves gegner jgl udyr lvl 2 gekillt ohne irgendwelche verluste dann hab ich dem zed mid einen kill gegeben und dannach dem top renek auch noch einen early kill gegeben und sogar noch deepe wards im gegner jgl udyr war f&uuml;r 5-10 minuten nicht in der lage irgendwas zu machen also alles in allem so viel wie man ausm early game rausholen kann\r\ndannach haben wir udyr und fizz im botside river gespotted zed hat sogar geschrieben bait them also hab ich das gemacht hab die beide sogar half life gemacht und mid gelockt aber mein zed stand afk rum hat nichts gemacht weil er grade in caps spammen musste das yasuo adc ein troll pick ist yasuo stand &uuml;brigens auch mitte direkt neben mir also haben die gegner mich gekillt (600 gold shutdown) und den drake bekommen dannach ging alles bergab alle standen nurnoch afk rum au&szlig;er die botlane die dann noch 6-7 mal gestorben sind und mich daf&uuml;r verantwortlich gemacht haben.\r\nalso nochmal im klartext wir haben ein spiel mit den so ziemlich besten early game was man haben kann verloren weil meine teammates dachten es ist ein chatforum \r\n\r\nkann bitte riot mal sich ein bisschen dar&uuml;m k&uuml;mmern das chatten zu veringern zb nur 5 nachrichten pro game oder so weil die leute die nicht flamen werden sowieso nicht so viel schreiben zumindest in lowerem elo weil dort ist taktik und strategie sowie kein problem \r\ndenn ganz ehrlich leute kommen mit ganz vielen sachen wie man games gewinnt undso zb: wards, early pressure, gutes late game, etc... aber in 100% der f&auml;llen ist das team das h&auml;rter tilted das team das verliert immer wirklich ausnahmslos jedes mal dann sagen jz bestimmt viele sie tilten weil man das game verliert und nicht anders herum\r\naber nur weil der score 5/6 ist und nicht 20/0 hei&szlig;t es nicht das das game verloren ist \r\n\r\nes ist halt wirklich l&auml;cherlich dass viele leute in low elo sind nicht weil sie schlecht sind sondern weil sie es nicht hinkriegen teammates zu beruhigen \r\nich habe auch festgestellt es ist egal ob ich 10/4 oder 0/6 stehe das entscheidet keine games und objectives auch nicht das ist alles schei&szlig; egal wenn dein team tilted hast du verloren dann fangen sie an afk rumzustehen mit absicht zu inten und teamplay kannst du dann komplett in die tonne werfen dann hassen sich alle und verlieren lieber alleine als zusammen zu gewinnen aber wenn man das team ist das tilt proof ist und das gegner team tilted dann gewinnt man egal ob das scoreboard 3/12 sagt die gegner denken dann nicht nach flamen den einen spieler der einmal einen fehler gemacht hat und werden dann viel zu greedy weil sie nicht nachdenken und towerdiven dann und geben damit dicke shutdowns und verlieren das game\r\n\r\nund der grund warum ich das alles hier schreibe ist damit mitarbeiter von riot mal merken was das f&uuml;r ein riesiges problem ist der chat in league of legends ist kompletter m&uuml;ll die chancen das mal was gutes im chat geschrieben werden sind ungef&auml;hr 1-30 und das ist nicht &uuml;bertrieben in meiner ehrfahrung ist das so und an mir liegt das ganz sicher nicht ich schreibe nie etwas au&szlig;er mal gj, wp, oder worth wenn wir acen jmd einen gegner outplayed oder wir nen shutdown kriegen und alles andere was ich schreibe ist um den bereits vorhanden tilt aufzul&ouml;sen dann schreib ich halt das wir noch gewinnen k&ouml;nnen und erkl&auml;re meinen teammates kurz die gegner auch fehler machen werden und dann ist es halt random was passiert entweder das team h&auml;lt dann die klappe und versucht zu gewinnen oder es kommt &quot;idc i dont wanna win my main is challenger idfc about this game&quot; \r\n\r\nalso bitte riot ich verstehe dass das alles nicht so einfach ist aber bitte versucht eine l&ouml;sung hierf&uuml;r zu finden das ist wichtiger als neue skins oder so lol ist nicht umsonst als einer der most toxic communities bekannt","replies":[{"poster":"Julevi","date":"2018-10-08T19:27:34.295+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=MyR OG,realm=EUW,application-id=YnZkMR0R,discussion-id=UWA0UiOh,comment-id=,timestamp=2018-10-08T13:54:41.745+0000)\n\n> kann bitte riot mal sich ein bisschen dar&amp;uuml;m k&amp;uuml;mmern das chatten zu veringern zb nur 5 nachrichten pro game oder so weil die leute die nicht flamen werden sowieso nicht so viel schreiben zumindest in lowerem elo weil dort ist taktik und strategie sowie kein problem \n\nDie Menge der Nachrichten variiert von Person zu Person - jemanden der andere Mitspieler beleidigen will und wird, nutzt auch die geringe Anzahl von 5 Nachrichten aus. Es auf eine gewisse Anzahl zu reduzieren ist kontraproduktiv - es gibt genug Beschwörer, welche nur über den Chat kommunizieren oder neue Bekanntschaften knüpfen. \n\n> denn ganz ehrlich leute kommen mit ganz vielen sachen wie man games gewinnt undso zb: wards, early pressure, gutes late game, etc... aber in 100% der fällen ist das team das härter tilted das team das verliert immer wirklich ausnahmslos jedes mal dann sagen jz bestimmt viele sie tilten weil man das game verliert und nicht anders herum\n\nNichts gegen dich, aber alle erwähnten Tipps für ein gelungenes Spiel, vielleicht für einen sichereren Win, können sehr wohl stimmen - es kommt eben auf die Situation an. Woher willst du wissen, dass das andere Team nicht genauso hart tilted? Ich hatte auch schon Runden, wo Beleidigungen seit dem Start herumgeflogen sind und wir trotzdem gewonnen haben. \n\n> es ist halt wirklich lächerlich dass viele leute in low elo sind nicht weil sie schlecht sind sondern weil sie es nicht hinkriegen teammates zu beruhigen \n\nAuch hier muss ich sagen: auf was begründest du diese Aussage? Viele Leute im Low-Elo-Bereich gehören sehr wohl dahin, nur wollen sie es nicht einsehen. Sollten sie in jenen Bereich nicht hingehören - was oft aus den Eigenaussagen der Schreiber bemerkbar ist - sollten sie keine Probleme haben zu climben oder es schaffen, das Team zusammenzuhalten. Probleme auf der Botlane? Guten Duopartner suchen und schon einmal eine Gefahr weniger. Dein Team hört nicht auf dich? Mach das beste aus ihren Fehlern - denn auch das ist teils möglich und wird kaum ausgenutzt. \n\n\n\n> und der grund warum ich das alles hier schreibe ist damit mitarbeiter von riot mal merken was das für ein riesiges problem ist der chat in league of legends ist kompletter müll die chancen das mal was gutes im chat geschrieben werden sind ungefähr 1-30 und das ist nicht übertrieben in meiner ehrfahrung ist das so und an mir liegt das ganz sicher nicht\n\nKompletter Müll ist der Chat wirklich nicht - man kann super kommunizieren und bei Bedarf auch Unruhestifter muten. \"Das ist nicht übertrieben, in meiner Erfahrung ist das so\"  ja, in deiner Erfahrung. Nicht jeder Spieler sieht das so, zudem erinnerst du dich an negative Nachrichten eher, als neutrale Texte. Sie bleiben in deiner Erinnerung hängen und verfälschen die Wahrnehmung. \"An mir liegt das ganz sicher nicht\" - woher willst du das wissen? Die Schuld nur beim Team zu suchen verläuft nie gut. \n\n> \n> also bitte riot ich verstehe dass das alles nicht so einfach ist aber bitte versucht eine lösung hierfür zu finden das ist wichtiger als neue skins oder so lol ist nicht umsonst als einer der most toxic communities bekannt\n\nSkins sind ein Teil der Grundes, warum du dieses Spiel gratis nutzen kannst - schon einmal  in den Sinn gekommen, dass sämtliche Ausgaben auch gedeckt werden müssen? Und auch wenn die Community von League of Legends einen schlechten Ruf genießt - von meiner Erfahrung aus kann ich das nicht bestätigen. Ich habe wesentlich schlimmere Erfahrungen in CS:GO machen dürfen - während sich bei meinen Supporttickets hier immer eine tolle Hilfe gefunden hat. Zudem habe ich schon zahlreiche witzige Chats erleben dürfen und tolle Freundschaften über das Spiel knüpfen können. Selbst wenn es einem so vorkommt - die Spieler sind nicht immer so übertrieben toxisch, wie es manche empfinden.","replies":[]},{"poster":"Hafud","date":"2018-10-08T19:04:05.747+0000","up_votes":1,"down_votes":0,"body":"ich hab nie gesagt dass ich ein high elo spieler bin diese high elo spieler carryin einfach 1vs9 in diesen games weil sie viel besser sind als alle anderen in dem game und auch ich aber es geht mir primär darum dass es den spielspaß kaputt macht und nicht darum dass ich deswegen in der \"elo hell\" gefangen bin","replies":[{"poster":"Swiftcast","date":"2018-10-08T19:21:41.046+0000","up_votes":1,"down_votes":0,"body":"hier, ich helfe dir mal, lies meinen nächsten post oder ... watch it?","replies":[]},{"poster":"Swiftcast","date":"2018-10-08T19:09:00.009+0000","up_votes":1,"down_votes":0,"body":"nun ja, wenn du in einem wettkampf orientierten spiel ranked spielst.........  entweder du mutest alle oder suchst dir einen anderen spielmodus ... daran wird sich sobald nichts ändern ... das ist ein **videospiel ohne altersbegrenzung** und du bist nicht grade in einer elo die viel gehirn braucht ... es wäre naiv von deinen mitspielern reife zu erwarten","replies":[]}]},{"poster":"Swiftcast","date":"2018-10-08T19:01:33.779+0000","up_votes":1,"down_votes":0,"body":"wie kommts dass high elo smurfs damit klar kommen und es immer wieder schaffen in ihre elo zu komme? sounds like a \"you-problem\"","replies":[]}]}