{"poster":"TakeAGuessNerd","date":"2017-03-04T00:10:27.203+0000","title":"Hextech Repair Tool Problem In Mac","subforum":"[ARCHIVED] Help & Support","up_votes":3,"down_votes":0,"body":"I downloaded the hextech repair tool, but when I opened it, the windows is too far up and is off screen, so I can't use it. I've tried moving it to no success.\r\n\r\nhttps://gyazo.com/4777936f7080c896f54e80a82a15e6a1","replies":[{"poster":"srirachacha","date":"2017-05-10T01:30:25.976+0000","up_votes":4,"down_votes":1,"body":"Solved this problem by using Apple's \"Script Editor\" which you can find in /Applications/Utilities/.\n\n1. Open the Script Editor.\n2. Create a new script (cmd + N).\n3. Copy/paste this:\n\ntell application \"System Events\"\n\tset position of first window of application process \"HextechRepairTool\" to {100, 100}\nend tell\n\n4. Run the script (cmd + R)\n5. Done!\n\nHope this works for you.","replies":[{"poster":"benliow","date":"2017-12-13T13:23:54.031+0000","up_votes":2,"down_votes":0,"body":"Thanks for your suggestion, just to add to the solution for some people who this might not have worked for:\n\nWhen I first tried it was returning with an error saying: 'System Events got an error: Access for assistive devices is disabled.'\n\nTo resolve this, go to system preferences>accessibility and checl 'Enable assistive devices'","replies":[{"poster":"Game girl 1","date":"2017-12-14T01:38:47.149+0000","up_votes":1,"down_votes":0,"body":"Thank you so much!","replies":[]}]},{"poster":"pixelbread","date":"2017-08-13T08:52:32.483+0000","up_votes":1,"down_votes":0,"body":"Worked","replies":[]},{"poster":"Vulcan123","date":"2017-12-09T15:10:36.473+0000","up_votes":1,"down_votes":1,"body":"What am i copy and pasteing?","replies":[]}]},{"poster":"Hotstuff101","date":"2017-08-23T10:25:41.891+0000","up_votes":2,"down_votes":0,"body":"I have the same exact problem, have got the latest version of the OS on my MacBook pro. I can't even see the window at all, I'm only able to see it if i swipe up with 4 fingers giving me the vision of all apps open and all the desktops. However when i click on the hex tech repair tool window it just goes right up and i can't see it anymore.","replies":[{"poster":"Liseloo","date":"2017-12-02T21:21:01.025+0000","up_votes":1,"down_votes":0,"body":"Same here","replies":[]}]},{"poster":"Porocles","date":"2017-03-04T01:01:10.610+0000","up_votes":1,"down_votes":0,"body":"What happens if arrange it in front?  Is your Mac a laptop?  Do you have it hooked to an external monitor?  If so, what happens if you unplug it and back in?  What is the issue you're experiencing, in case we have to work it manually?  Let me know.","replies":[{"poster":"TakeAGuessNerd","date":"2017-03-04T01:15:49.281+0000","up_votes":1,"down_votes":0,"body":"It's just as you see, I've tried arranging it via F3, adjusting my screen resolution, etc. My Mac is a home computer, and it's not hooked to an external monitor. The issue is that because the repair tool is high off screen, i can't use it, and i can't move it too.\n\nI may or may not have misinterpreted what you say","replies":[{"poster":"Porocles","date":"2017-03-04T16:21:06.393+0000","up_votes":1,"down_votes":0,"body":"These are all great, thanks for the info!  Do you know what OSX version you're using?  What happens if you try reinstalling the HRT?  This may be an issue specifically with your OS.  What were you trying to perform on that tool, so that we can find an alternative n the meantime?","replies":[{"poster":"RøyalZëtsu","date":"2017-08-12T02:39:19.207+0000","up_votes":2,"down_votes":0,"body":"It also shows up at the top of my screen so I can't move it or use it. But what I was gonna use it for was that when I open up league whether I open it using the desktop icon or from the actual folder....It says \"We have restored this installation to an older version of League of Legends. Now we'll try to patch it up to the latest version.\" Then it instantly says \"There was a problem patching League of Legends. We'll restore a back up version and try updating again after you restart the patcher.\" And then it closes league and opens up again but just repeats and continues to show those 2 messages. Please help. (OS X 10.8.5)","replies":[]},{"poster":"TakeAGuessNerd","date":"2017-03-05T01:21:02.235+0000","up_votes":1,"down_votes":0,"body":"My Mac is a OSX 10.8.5 too, what I tried to do is just starting it, but when I tried too, it's what I described above, the window is too high so I can't do anything. But what I noticed is that, when I use F3, it shows that I connected properly as it shows the background of heimer and all the functions it gives.","replies":[{"poster":"Porocles","date":"2017-03-07T16:38:13.233+0000","up_votes":1,"down_votes":0,"body":"Thanks for the follow-up!  What's your resolution at?  Would you be able to temporarily change your resolution, then switch it back?  Additionally, what happens if you select Window then Zoom?  Let me know!","replies":[{"poster":"TakeAGuessNerd","date":"2017-03-07T23:29:00.490+0000","up_votes":1,"down_votes":0,"body":"I've already said the part about switching resolution, and I couldn't zoom in. Admittedly, it may be because my Mac is outdated.","replies":[{"poster":"Nitrate de Sapin","date":"2017-04-22T04:01:56.750+0000","up_votes":2,"down_votes":0,"body":"Hey ! I'm uping this maybe a couple of months too late but I just had the same issue and I found an answer by my own. \nSo, I don't know if it is the same for you but i used to hide the toolbar on my MacBook, so it just appears when I put my mouse on the top of the screen. I finally realized (after some long hours) that I had to open the HTR (it opens too high) then go in system settings > general > then uncheck the set that hide the toolbar, and the HTR automatically comes down !\nHere is my solution, and excuse my english, i'm french :))","replies":[{"poster":"Game girl 1","date":"2017-12-14T02:22:07.325+0000","up_votes":1,"down_votes":0,"body":"It worked for me the first time, but hasn't worked since then.","replies":[]},{"poster":"BestSkarnerEver","date":"2017-10-20T03:40:57.346+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Bigtoady,realm=EUW,application-id=osqw6G4M,discussion-id=23Apm5Ey,comment-id=0000000000000001000000000001,timestamp=2017-04-22T04:01:56.750+0000)\n>\n> Hey ! I&#x27;m uping this maybe a couple of months too late but I just had the same issue and I found an answer by my own. \n> So, I don&#x27;t know if it is the same for you but i used to hide the toolbar on my MacBook, so it just appears when I put my mouse on the top of the screen. I finally realized (after some long hours) that I had to open the HTR (it opens too high) then go in system settings &gt; general &gt; then uncheck the set that hide the toolbar, and the HTR automatically comes down !\n> Here is my solution, and excuse my english, i&#x27;m french :))\n\nTHANK YOU SO MUCH (I'm probably a couple months late too)","replies":[]}]},{"poster":"Porocles","date":"2017-03-07T23:53:49.476+0000","up_votes":1,"down_votes":0,"body":"Sorry about that friend, I misjuggled.  I appreciate all the steps you tried nevertheless.  Hit us up in a [support ticket](https://support.riotgames.com/hc/en-us/requests/new) at this point so our tech team can take a look into this with you.  I can't make any guarantees if it's OS specific, but we'll do our best!  We'll get back to you as soon as we can!","replies":[]}]}]}]},{"poster":"Mabon ap Modron","date":"2017-03-04T17:12:30.745+0000","up_votes":1,"down_votes":0,"body":"For me, OSX 10.8.5. I was trying to fix an issue where I was disconnected from chat permanently, and every time I load up a game (using customs or the practice tool so I don't mess people's games up!) I get a black screen and a message saying that it can't connect. All my non-League internet has been fine though.","replies":[{"poster":"Porocles","date":"2017-03-04T17:20:16.123+0000","up_votes":1,"down_votes":0,"body":"You seem to be having a network problem reaching our game servers, further affirmed by the black screen which results from failing to download assets.  You'll want to go over each step of the [connection issues](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues) guide to fix it up.  I hope that helps!","replies":[{"poster":"Mabon ap Modron","date":"2017-03-07T10:21:50.607+0000","up_votes":1,"down_votes":0,"body":"Updating to OSX 10.12.3 solved the problem with the Hextech Repair Tool, and after a couple of days seemed to also solve the problem with the client. Thanks for your help.","replies":[]}]}]}]}]}]},{"poster":"Dr cannabiz","date":"2017-12-16T16:05:32.832+0000","up_votes":1,"down_votes":0,"body":"sorry for reposting but I also have the same problem hextech is so far up i can open i try to used cause i cant download the patch","replies":[]},{"poster":"benliow","date":"2017-12-13T01:23:04.945+0000","up_votes":1,"down_votes":0,"body":"Hi the Script Editor fix returned an error for me 'System Events got an error: Access for assistive devices is disabled.'? And I don't have the option to hide/reveal the top bar so that didn't work for me either..","replies":[]},{"poster":"Mabon ap Modron","date":"2017-03-04T11:46:57.860+0000","up_votes":1,"down_votes":0,"body":"I have exactly the same problem, I have a Mac laptop, no external monitor. Haven't found a way to move the window down so the repair tool is unusable.","replies":[]}]}