{"poster":"KondraX","date":"2018-01-22T15:57:49.660+0000","title":"baneo de chat y baja de honor","subforum":"Comportamiento del jugador","up_votes":2,"down_votes":3,"body":"Hola gente, escribo para descargar mi ira contra RIOT porque la verdad ya me parece indignante como se pasan por donde no da el sol a los players comunes q incluso les dan guita en rp todos los meses y ni siquiera son capaces de revisar antes de sansionarte\r\nMe paso esto en una partida, entre fui adc ashe mi supp un tresh q lasthiteaba los minions , lo deje ni le dije nada me la fume porque era la novena partida de las 10 a rankear para quedar en bronce obvio y en TODAS TODAS me tocaron trolls, afk, flamers, gente q usaba los champ por primera vez, etc, a todos los reporte y por supuesto RIOT no hizo absolutamente nada, pero a mi que estaba defendiendome me mandan copia de lo que yo escribi y claaaaarooooo los insultos y los troleos de la gente q me toco no los ponen no?\r\nTodo lo q ellos me dijeron, q encima se aliaron trolearon juntos, flamearon juntos todo porque yo me empece a defender porque soy f*cking humana y queria divertirme nada mas no ser basureada por horas y horas!!!!! por haber reaccionado en una partida incluso me bajaron a honor 1!!!!!!!!! me arto de ayudar a todos como una idiota!!!!!!!!! sinceramente ni vale la pena ya querer jugar bien hacer las cosas bien para q porque 3 trolls me reportan porque se aliaron porque sabian q los iba a reportar por flamers y los del tream enemigo me bardeaban tambien para tiltearme, ahora me tengo q bancar una sansion! y ellos felices sigue su trolleo y RIOT nada. Entiendo que le importe un comino a RIOT la comunidad edionda en la que tenemos q jugar, pero minimo que nos de una herramienta para defendernos de los trolls, porque defendiendome hablando me sansiona a mi mientras los afk trolls y flamers siguen arruinando cada partida que intentas jugar!!!\r\n Sinceramente, que les vuelva todo lo que dan.\r\n\r\n\r\nPartida 1\r\nKondraX: no se q ganas pingueando asi te juro\r\nKondraX: no entiendo la gente de esta comunidad\r\nKondraX: q te gastas\r\nKondraX: son todos trolls\r\nKondraX: ves\r\nKondraX: farmea vos\r\nKondraX: q me jodes a mi\r\nKondraX: farmea vos\r\nKondraX: vos estas lasthiteando los minions\r\nKondraX: para q me rompes los huevos q farmee\r\nKondraX: me dice flamer porque le digo q farmee el , me arta con los ping  para q farmee y los lasthitea el a los minions\r\nKondraX: si si siempre es culpa del q es cagado no\r\nKondraX: ya me voy a hacer ver por un doctor no te preocupes\r\nKondraX: es q me dicen q me haga ver por un doctor estaba contestando\r\nKondraX: si si plis reportenme, bardeada desde el minuto cero pero claro, plis report me\r\nKondraX: despues de 8 partidas con trolls y afk me da exactamente lo mismo ya\r\nKondraX: panth 0/2 y me dice report\r\nKondraX: que\r\nKondraX: vos sos el q tiene el oro q me pingueas a mi\r\nKondraX: 0/6 , 9 partidas con trolls\r\nKondraX: q vos digas q soy troll no significa nada, riot es mas inteligente sabes","replies":[{"poster":"ZanahoriaAsesina","date":"2018-01-22T16:02:42.142+0000","up_votes":2,"down_votes":1,"body":"Es difícil que se aplique un castigo por una sola partida, probablemente esa partida fue la que gatillo el castigo pero no se tomo en cuenta esa sola para el mismo, básicamente fue la gota que derramo el vaso.\n\nPero bueno, me parece raro que te hayan sancionado por eso solo, lo mejor sería que hagas el reclamo en Soporte, haya mismo te van a dar una respuesta más adecuada que en el foro.\n\n [ -> Enviar solicitud a Soporte <-](https://support.riotgames.com/hc/es-419/requests/new)","replies":[]},{"poster":"KondraX","date":"2018-01-22T23:07:41.697+0000","up_votes":1,"down_votes":0,"body":"Gracias por sus respuestas, si lo enviare al soporte, pero si creo q me van a decir eso que es para q me tome un tiempo para calmarme.\nEso que copie es lo unico que me pusieron ellos, normalmente yo no insulto, pero si en una partida anterior me agarre con un blitz que caminaba y me pingueaba para q atacara y le dije que la terminara pero no insultos, crei que a lo mejor tambien era por esa el ban pero no adjuntaron otra conversacion, no soy flamer asique otra no van a encontrar igual.\n\nGracias por sus respuestas, saludos","replies":[]},{"poster":"El Impostor","date":"2018-01-22T22:43:33.262+0000","up_votes":1,"down_votes":0,"body":"Tengo sospechas de que hay mas chat que eso.","replies":[]},{"poster":"Baiken","date":"2018-01-22T16:51:11.163+0000","up_votes":1,"down_votes":0,"body":"Por una sola partida?, la gran mayoria de las veces adjuntan el chat de 2 o más partidas.","replies":[]},{"poster":"Sebasaurio REX","date":"2018-01-22T16:51:04.174+0000","up_votes":1,"down_votes":0,"body":"manda solicitud al soporte , ya que no se ven insultos , pero lo mas probable es que te digan que para flamear no simplemente son insultos si no que una actitud negativa , pero de igual forma intenta ya que se ve que te las mordiste arto para no decirles otra cosa , ya que te estaban provocando por lo que se ven en tus respuestas ","replies":[]}]}