{"poster":"Neurotic","date":"2015-01-28T12:45:03.696+0000","title":"Champion Idea: Kharak, The Bonemaw Savage","subforum":"Player Creations","up_votes":1,"down_votes":0,"body":"**Stats**\nHealth: 554 (+94)\nHealth Regen: 6 (+0.6)\nAttack Damage: 65 (+4)\nAttack Speed: 0.625\nMovement Speed: 335\nArmour: 18\nMagic Resist: 18\nRange: 175 \n\n**Roles: ** AD Jungle/Top Bruiser(AD)\n\n**Abilities**\n\n*Passive:* (Bonemaw Scavenger): Whenever Kharak kills a neutral monster or enemy champion, he gains +12/16/20/24 armour and magic resist for 3 seconds. This can only activate once every 18 seconds. He also  gains +1.5/1.7/1.9/2.1 armour and magic resist permanently after the bonus armour and magic resist is removed.  Killing an enemy unit will grant 2/1.9/1.8/1.7/1.6/1.5/1.4/1.3/1.2/1.1/1/0.9/0.8/0.7/0.6/0.5/0.4/0.3/0.2 armour and magic resist permanently.\n\n**Q.: **(Femur Throw): Throws a sharpened bone in a line which deals 30/60/90/120/150 (+35% Bonus AD) physical damage to the first enemy. If a target is hit twice with Femur Throw within 6 seconds, it deals 25% damage. Neutral monsters are instead dealt 75% damage with multiple hits within 6 seconds.\nCD: 6/5/4/3/2\nHealth: 45/55/65/75/85\n\n**W.: **(Bone Plague): \nPassive: Every time Kharak kills an enemy unit or neutral monster, his basic attacks deal 10/20/30/40/50 (+100% Bonus AD) true damage to neutral monsters or 20/35/50/75/90 (+50% Bonus AD) magical damage for the next 3 seconds.\n\nActive: Slow all nearby enemy units near Kharak by 45% for 3 seconds. For the next 5 seconds, all nearby enemy units are slowed by 20% and are dealt 35/45/55/65/75 (+15% AP) magic damage per second. Kharak is healed for the base damage dealt, but this heal is reduced to 25% for minions. These slows do not stack and has a seperate cooldown of 10 seconds.\nCD: 20\nHealth: 10% Current Health\n\n**E.: **(Blood Feast): Kharak gains +20/30/40/50/60% attack speed, 10/13/16/19/22% lifesteal and resistance to crowd control for 4 seconds. The first crowd control ability cast on Kharak will refresh the duration of Blood-Feast but instead grants him 40% tenacity.\nCD: 16/15/14/13/12\nHealth: 45/65/85/105/125\n\n**R.: **(Bonestorm of the Bonemaw): For the next 6 seconds, for 650 units around Kharak, Kharak deals 80/120/160 (+25% AP)(+40% Bonus AD) physical damage per second. After the 6 seconds, for each unit killed with the bonestorm, Kharak gains +2 attack damage for 10 seconds. This bonus is increased to +8 attack damage for each champion killed this way.\nCD: 120/110/100\nMana: 120\n\n**Recommend Build**\n{{item:3111}}  **or**  {{item:3047}} \n{{item:3072}} {{item:3707}} \n\n*Offensive Choices*\n {{item:3022}} {{item:3074}}{{item:3153}} \n\n*Defensive Choices*\n{{item:3065}} {{item:3068}} {{item:3139}}","replies":[{"poster":"Pog","date":"2015-01-28T19:36:03.443+0000","up_votes":2,"down_votes":0,"body":"I really feel like this would be OP. You just build health items and AD, with the free armour and MR you would be really hard to kill while doing high amounts of damage. \n\nEarly game you would just farm similar to Nasus. \"Killing an enemy unit will grant 0.5 armour and magic resist permanently.\" 100 CS by roughly 10 minutes you would have bonus 50 MR and armour (not including killing the enemy laner).\n\n I get you don't have mr/armour per level, but if you just farmed for 20 minutes straight then TP into team fights after going to shop you wouldn't be able to die if you built slightly tanky with damage.\n\nReally cool concept but the stacking mechanic is just too much.","replies":[]},{"poster":"Neurotic","date":"2015-01-29T11:26:26.306+0000","up_votes":1,"down_votes":0,"body":"Wow, thank you for the feedback. I have made the requested changes so this champion becomes a bit more balanced.","replies":[]},{"poster":"SteeI Tempest","date":"2015-01-28T13:25:41.194+0000","up_votes":1,"down_votes":0,"body":"With the Adding Permanent Armor and MR Make it so it gets lower over level up. An example with the 0.5 added on for a champ kill maybe make it 1.8 and lower it .1 for every level And make assists the same so it you are level 18 you will get 0.2 per kill/ assist. Because late game you are reliant on team fights and objectives, and you are not expected to get all the kills and by then you'll have 1-2 tank items. lets say you ganked early in the game around lvl 4 even if you get that assist or kill, you will get 1.5 armor. It will just lower over time and make the passive more viable. As an example, Lets say its midgame and its a 5v5 around the 10-13 level range and you are level 11 and your team wins the 5v5 that 5x0.7= 3.5 armor only if you get an assist on all and or kill a few of them.","replies":[{"poster":"SteeI Tempest","date":"2015-01-28T13:52:02.235+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Wingedkeyboard,realm=OCE,application-id=hIjvqaz6,discussion-id=EvPmABTg,comment-id=0001,timestamp=2015-01-28T13:25:41.194+0000)\n>\n> With the Adding Permanent Armor and MR Make it so it gets lower over level up. An example with the 0.5 added on for a champ kill maybe make it 1.8 and lower it .1 for every level And make assists the same so it you are level 18 you will get 0.2 per kill/ assist.\n\nMaybe make the 0.1 effect happen at level 6 but drop it .5-6","replies":[]}]},{"poster":"SteeI Tempest","date":"2015-01-28T13:29:59.883+0000","up_votes":1,"down_votes":0,"body":"Im just saying that because you will have tank items so you are not so reliant on your passive but it is still there to help MASSIVELY in the early game and i would make it ONLY to champion kills","replies":[]}]}