{"poster":"Amycos Cyrus","date":"2019-04-22T19:54:46.155+0000","title":"Reika – Die Witwe der vergessenen Lieder","subforum":"Skin- & Champion-Konzepte","embed":{"description":null,"url":"https://vignette.wikia.nocookie.net/leagueoflegends/images/0/0c/Shadow_Isles_Widow_Of_Forgotten_Songs.jpg/revision/latest?cb=20190126160443","image":null},"up_votes":5,"down_votes":0,"body":"Nach einer gut zwei monatigen Abstinenz melde ich mich mal wieder mit einem Champion, dessen Inspiration erneut von Seiten Riot Games kam, auch wenn nicht als Teaser für einen neuen Champion.\n\nMir Reika präsentiere ich meinen dritten Supporter und begebe mich mit ihr in die geistigen Tiefen derjenigen, die dem Fluch der Schatteninsel zum Opfer fielen. Wo sind all die Menschen und Tiere, die einst diese Inseln bewohnten, was ist von ihrem Wissen erhalten geblieben? Wie gehen die \"Überlebenden\" mit ihrem Verlust um?\n\nNatürlich hat auch hier meine Sicht auf das nächste weltbewegende Ereignisse in Runeterra Einfluss erhalten, sodass die Arcanen mit Reika ein weiteres Mitglied erhalten.\n\nDamit soll es das von mir gewesen sein, nun sehr selbst die Geschichte einer \"Überlebenden\".\n___\n\nInhaltsverzeichnis:\n\n - Lore:\n - Aussehen:\n - Zitate:\n - Statistiken und Einstufung:\n - Fähigkeiten:\n - Erläuterungen zur Spielweise\n - Synergien mit Verbündeten\n - Problematische Gegner\n - Verweise etc.\n\n___\n\n**Chapter I: Das Geschenk des Überlebens**\n\n_„Schreie … Laute Kinderschreie … Sie hören nicht auf … Schreie … Verzweifelte Schreie“_\n\nLange vor dem traumatischen Ereignis, das alles verändern sollte, gab es diese Schreie nicht. Sie waren nicht immer während, sie waren nicht so tief in ihre Erinnerung eingebrannt.\n\nKeine Gefahr konnte sie erreichen. Der weiße Nebel hatte sie immer geschützt.\nWo auch immer man hin kam: Es gab keine Schreie.\nEgal wo man war: Es gab nur bedachtes Schweigen oder kindliches Lachen.\n\nDoch es sollte sich etwas verändern. Ein tiefschürfender Wandel stand allen bevor. Für viele sollte es das Letzte sein, was sie erlebten. Nur wenige überstanden es:\nDoch welchen Preis mussten sie leisten?\nWollte man es überstehen?\nNoch wussten sie nicht einmal das es bevorstand.\n\nDoch jetzt, wo es passiert ist … jetzt kann man diese Frage stellen:\nWas hat das eigene Überleben gekostet?\nWäre es nicht besser gewesen diesen Preis auf Kosten des eigenen Lebens nicht zu leisten?\n\n_„Ich sehe sie … sie werden verschlungen … Die Finsternis nimmt sie mir“_\n\nFrüher hätte niemand damit gerechnet.\nJeder fühlte sich hier sicher. Der weiße Nebel … Sie sagten, dass er uns schützen würde.\nNiemand von außen kam hier her. Wir lebten allein.\nWir waren überall berühmt für das, was wir konnten. Für das Wissen, das wir besaßen.\nJeder hier wuchs in diesem Wissen auf.\nJeder hier wuchs in diesem Glauben auf.\n\nDoch nicht jeder war wie sie.\nSie waren noch so jung. Sie blickten begierig in die Zukunft. Ihr Herz war noch rein. Sie haben dieses Schicksal nicht verdient. Wenigstens sie hätten verschont werden sollen. Doch sie … sie verloren ihr Leben. Und nur wenigen nicht.\nWarum ist es so?\nWarum haben sie es nicht geschafft?\nHaben sie noch etwas besessen, dass es wert war?\n\n_„Die Kinder … Sie wurden mir anvertraut … Ich habe sie verloren … Sie waren mein … Sie waren alles“_\n\nIhr Überleben kostete sie nichts. Ihr Tod kostete noch weniger.\nEs heißt die Lebenden zahlen den Preis des Todes. Niemand leidet mehr als, diejenigen, die überbleiben. Diejenigen, die sie bewahren. Die sich erinnern … müssen.\n\n_„Sie sahen zu mir auf. … Sie vertrauten mir … Ich habe sie verraten … Schreie“_\n\nIhre leblosen Körper liegen nun hier.\nHier wo sie lebten.\nHier wo sie lernten.\nHier wo sie lachten.\n\n_„Ich sehe noch, wie sie lebten. … Die Bilder, … die sie malten, … die sie hinterließen.“_\n\nDiejenigen die verbleiben. Die das Erbe auf ihren Schultern tragen. Das Erbe des Überlebens. Sie zahlen nichts für ihr Überleben. Das Leben ist dahingehend wie der Tod.\nMan gibt in solchen Situationen nichts auf, um zu leben.\nMan gibt in solchen Situationen nichts auf, um es nicht zu tun.\n\nDer Unterschied: Das was die Lebenden von den Toten unterscheidet ist nicht der Verlust, sondern das was sie erhalten.\n\n_„Nun ist alles verloren. … Niemand ist mehr hier. … Niemand außer mir.“_\n\nHier an diesem Ort ist selbst der Tod kein Weg das Geschenk abzulehnen. Selbst einigen der Verstorbenen kehrten zurück, um es in Empfang zu nehmen. Doch wollten sie es wirklich?\n\n_„Ich höre ihre Stimmen. … Ihre Schreie … laute Kinderschreie … doch ihr Lachen … verstummt.“_\n\nNiemand hatte es überlebt. Niemand den sie kannten. Auch sie selbst nicht.\nDiejenigen die wiederkehrten unterschied nur das eine von denen, die es nicht taten.\nDas Geschenk.\nWas das Geschenk war? … Für jeden der es erhielt, war es etwas anderes. Doch alle Geschenke verbanden drei Dinge:\nZum einen galt es nur denjenigen, die nicht nur im Geiste überlebten. Wesen, die in der Erinnerung der Hinterbliebenen weiterlebten, erhielten es nicht.\nWeiterhin wollte niemand dieses Geschenk haben, da es nur zu Leid und Trauer führte.\nAls letztes kam man nicht drum es zu erhalten. Jeder erhielt es ohne einen Weg es zu verwehren.\n\n_„Ihre Gesichter verbleichen. … Sie, die sie mir so wichtig waren … sie verschwinden.“_\n\nEinige werden das Geschenk schneller wieder los oder lernen früh den Umgang mit ihm. Andere zerbrechen an seinem Inhalt und folgen denen, welchen das Geschenk galt.\n\n_„Sie sind noch nicht gegangen … sie sind gefangen wie ich. … Ich höre sie noch immer … Schreie“_\n\nAn diesem Ort konnte niemand gehen. Nur der Weg ihres Verblebens unterschied sich voneinander. Daher erhielten viele ihr Geschenk, ohne einen Verlust zu erfahren. Sie wussten es nur nicht.\n\n_„Ich höre sie noch … Sind sie wiedergekehrt? … Oder verfolgen sie mich … die Erinnerungen.“_\n\nDie wenigen, die einen Teil ihrer Gestalt erhielten, wanderten verwirrt über die Insel. Sie suchten, ob aus dem Gefühl jemanden zu finden oder der Verzweiflung jemand finden zu müssen\nSie suchten.\n\n_„Warum folgt ihr mir? … Warum erinnert mich euer Zwitschern an sie? … Seit ihr … sie?“_\n\nEinige fanden, wen sie suchten.\nSo auch sie. Diejenige, die wie sie alle, alles verlor. In dieser einen Nacht. Zu diesem einen Zeitpunkt, der den weißen Nebel schwärzte.\n\nVon diesem Tag an war es nicht mehr der weiße Nebel, der sie schützte. Sondern der graue Nebel, der sie heimsuchte.\n\nWer sie waren?\nDiejenigen die verblieben.\nDiejenigen, die überlebten.\n\nWesen wie sie.\n\n**Chapter II: Arc Magna XVI – Der Turm**\n\nAn einem Ort jenseits von Dies- und Jenseits.\nAn einem Ort abseits allen bekannten Welten.\nEine Welt unbekannter als die Welt der Aspekte am Gipfel des Targons.\nZwei Gestalten, die sich durch nicht mehr als ihre bloße Exitenz auszeichneten, verweilten in einer Höhle, deren Gesalt durch Wasser geprägt ist. \n\nTropf ... Tropf ... Tropf ... Tropf ...\n\nDas flüchtige Geräusch von Wasser. ... Es hat dir schon immer gefallen, oder?\n\nTropf ... Tropf ... Tropf ... Tr... \n\nDer gläserne Klang des fallenden Wassers. Er stoppt.\nSeit Jahrhunderten hatte es das nie getan, doch jetzt.\nWas soll das bedeuten? Heißt es etwa, dass ...?\n\nSie scheinen dich zu brauchen Schwester. Sie bedürfen einen Person, die sie führt.\n\nMeinst du wirklich?\nWarum senden sie dann nicht nach dem Herrscherpaar?\nWarum ich, die ich zwar in den Krieg ziehen kann, doch ihn nicht gewinnen werde?\n\nWer weiß? Sie werden einen Grund haben. Die Höheren hatten immer einen Grund. Bevor sie jedoch das Feld betreten können, bedarf es sorgfältigen Vorbereitungen. Vielleicht glauben sie, dass du die von dir geforderten Aufgabe besser bewältigen kannst, als es die Herrscher tun würden.\n\nAber ... ?\n\nMöglicherweise ist die Welt gewachsen und die Herrscher reichen zur Führung nicht mehr aus?\n\nUnsinn! Keine Welt ist so zerstreut ... so gewaltig, wie die unsere. Und unsere Welt wird sogar von ihm allein geführt. Es würde mich sehr wundern, wenn es überhaupt beide Herrscher bräuchte, um Runeterra zu unterwerfen.\n\nEr ist auch besonders. Wenn es ihm möglich wäre, würde er alle Welten beherrschen, jedoch ist er, anders als wir, an diese Welt gebunden. Die Herrscher werden definitiv auch ihren Aufruf erfahren, jedoch scheinst du anders als sie ein Gefäß zu besitzen.\n\nNun. ... Das mag sein. Es sei egal warum, doch wundern tut es mich schon.\nAufmachen werde ich mich eh. ... Man wird sich wiedersehen.\n\nMan wird sich wiedersehen, Schwester.\n\n_In der Welt die wir als Runterra kennen. Zu einem Zeitpunkt nachdem die Karte einen großen Wandel durchlebt hat._\n\nFühlt sich ... seltsam an.\nDas sind also Finger ... Hände ... Glieder.\nEs ist schon so lange her, seit ich das letzte Gefäß besessen habe. Der Krieg hatte mir mein letztes Gefäß genommen. Ich sollte vorsichtiger sein.\nDieses Gefäß trauert um etwas ... Ich verstehe, so fühlt sich also die Dreizehn, wenn sie ein Gefäß erhält. Für mich ist es das erste Tote, doch für sein Nachleben scheine ich nicht verantwortlich.\n\n_Sie blickt sich um._\n\nWas ist hier passiert?\nWarum ist mein Gefäß an einem Ort wie diesem und wo überhaupt bin ich?\nIch sehe nichts.\nDer Nebel ist zu dicht. Er scheint von irgendwo zu kommen.\nEine Art Wind.\nWundervoll alles zu fühlen, aber auch wichtig, jetzt wo ich berührt werden kann.\nIch sollte mich aufmachen. Der Wind und der Nebel ist aktuell mein einziges Indiz zum Fortfahren.\n\n_Sie folgte dem Ursprung des Nebels und des Windes, in der Hoffnung dort auf etwas zu stoßen, was ihr sagen würde, warum sie nach Runterra gesandt wurde._\n\n_Tage der Reise später traf sie an einem Ort an, der wie eine Stadt aussah. Eine Stadt gehüllt in schwarzem Nebel und geformt aus Ruinen. Eine dunkle Substanz strömte durch die Gassen der Stadt und mündete im Meer._\n\nWasser. Es würde ihr gefallen.\nWenn es nicht so schwer wäre sie hier her zu bringen, würde ich mich gleich aufmachen ihre Ankunft vorzubereiten. Doch Ordnung will gewahrt sein.\nEinen wirklichen Grund meiner Anwesenheit habe ich bislang noch nicht gefunden. Ich werde jedoch das Gefühl nicht los, dass ich hier richtig bin.\n\n_Sie machte sich auf durch die Stadt zu streifen und traf nach kurzer Zeit auf \"Wandernde Schatten\"_\n\nWas seit ihr? ...\nEuer Krächzen erinnert mein Gefäß an etwas. ... Ihr seit ihr bekannt.\nVögel? Ich kenne Wesen wie euch. Ihr seit terrestrische Lichs. ... Damals waren sie allerdings größer. ... Ach, damals ritt ich auf einem von ihnen. Verglichen mit ihm seit ihr ... winzig.\n\n_Auf ihrem Weg wurde sie von da an von den \"Schatten\" begleitet.\nAls sie nach einigen Stunden des umherstreifen auf die Ruinen der Bibliotheksfestung stieß, wusste sie, dass dort der Grund für ihre Anwesenheit zu suchen sei._\n\nHier werde ich gebraucht. Wenn ich mich nicht irre, werde ich ihr Eintreffen vorbereiten.\nIch hätte nicht gedacht, dass ich mit einer derartigen Aufgabe beauftragt werde.\nDann wird sie also doch das Wasser sehen. ... Es freut mich für sie\nSo werden wir Schwestern also in Kürze vereint werden.\n\n_Sie betrat die Gemäuer und suchte nach dem, was sie für notwendig erachtete. ... Einem Gefäß, das die Zeit überdauern konnte, die es Bedurfte sie zu rufen.\nDoch nur Enttäuschung konnte auf sie waren, denn der Fluch der Schatteninsel verhinderte die Existenz eines solchen Gefäßes._\n\nHier ist es! ... Das \"Zeitlose\", was laut den Schriften, die ich durch sie lesen durfte, ihrer Beschwörung Bedingung ist. Doch hätte ich nicht erwartet es so vorzufinden.\nDas ist kein Gefäß! Das ist ein ... Stein!? Ich kann sie nicht in einen Stein beschwören.\nWas soll ich jetzt machen? .. Endet meine Aufgabe hier?\nMomentan kann ich jedenfalls nur eins machen. ... Warten.\n\n___\n\nhttps://vignette.wikia.nocookie.net/leagueoflegends/images/0/0c/Shadow_Isles_Widow_Of_Forgotten_Songs.jpg/revision/latest?cb=20190126160443\n\n**Aussehen: (Entspricht dem Bild, welches man auch auf der Karte von Runeterra findet)**\n\n - Reika ist eine sehr aufrecht laufende, ältere Dame mit geschmücktem Blumenhut\n - Sie trägt ein langes schwarzes, Kleide und verschleiertes Gesicht. (Trauergewand)\n - Die wenige sichtbare Haut an ihren Händen und durchscheinend an ihrem Gesicht ist grünlich fahl und glimmt geisterhaft.\n - Die Vögel, die sie umkreisen, sind schwarze Raben, die etwas geisterhaft scheinen.\n\n___\n\n**Zitate:**\n\n- Pick\n - Die Erinnerungen ... Sie sind uns allen inne, doch nur wenige werden von ihr so verfolgt wie ich.\n- Bann\n - Man will mich vor den Erinnerungen bewahren. ... Leider.\n- Taunt\n - Hörst du sie auch? ... Die Kinder deiner Heimat.\n - Ich habe ihn gesehen. ... Den Untergang allem.\n- Joke\n - Sie lachen. ... Wieder.\n - Sie schreien. ... Leider\n- Angriff mit Vogel\n - Verfolgt sie\n - Steht mir bei\n - Es ist nur ein kurzer Abschied\n - Kehre zurück\n- Angriff ohne Vogel\n - Nun allein\n - Allein ...\n - Kommt zurück!\n- Bewegung (kurze Strecke)\n - Folgt mir bei meinem Weg.\n - Früher wäre ich diesen Weg nicht gegangen. Doch nun ... nun gehe ich ihn mit euch.\n - Irgendwie erinnert mich dies an die alten Zeiten. ... Wie friedlich sie waren.\n- Bewegung (lange Strecke)\n - Gesang:\nHört ihr sie, die sie waren\nIhre Stimmen ... und ihr Klagen\nDiese Schreie ... ich hör' sie noch heut'.\nVegessen wurden sie...\n - Gesang:\nSchaut in den Himmel, ihr Kinder\nUnser' aller... Ahnen sind dort.\nSehet die Engel dort oben.\nAuch ihr seit in kürze dort.\n - Gesang:\nWir alle leben in Frieden.\nDas war immer das Ziel\nDoch das alles ward uns genommen\nund nun fehlt uns so viel. \n- Bei der Rückkehr eines Vogels\n - Pavaro ... Es freut mich dich zu sehen\n - Emilia ... Noch immer so verspielt.\n - Lemiha ... Du brauchst dich nicht anzuschleichen.\n - Tiara ... Kehrst du endlich zurück.\n - Carileo ... Dich ohne ein Buch zu sehen ...\n- Gegenüber verbündeten {{champion:82}} \n - Ihr Handeln hat so viel Leid bereitet. ... Möglicherweise erfreut es Sie ja, doch dann sind Sie recht allein.\n - Wenn nur mehr wüssten, dass der Verlust nur eine Illusion ist.\n - Welch' eine Anmaßung das selbe Ziel zu haben.\n- Gegenüber verbündeten {{champion:50}} \n - Sind die Vögel auch die deinen Ehemaligen\n - Meine Kinder scheinen dich zu mögen.\n - Wer ist denn Beatrice? ... Meine Vertrauten nennen mir ihren Namen erst seit dem ich dich kenne.\n - Dir ist ein Dämon einheim.\n- Gegenüber verbündeter {{champion:203}} \n - Ich danke dir.\n- Gegenüber verbündeter {{champion:429}} \n - Ich hörte du übst Rache für diejenigen aus, die es nicht selbst tun können. ... Ich habe da einen Auftrag für dich.\n - Ich verzeih' sehr viel. ... Weit mehr als viele andere, doch dennoch will ich deinen Dienst in Anspruch nehmen.\n- Gegenüber verbündetem {{champion:57}} \n - Ein Wesen meines Gleichen. Sind die Setzlinge auch deine Anvertrauten?\n - Hat der Fluch dich dazu gemacht?\n- Gegenüber feindlichem {{champion:82}} \n - Eine derartig obszöne Gestalt steht Ihnen.\n - Man gut, dass Sie selbst auch nicht verschont wurden.\n - Ich hoffe, dass Sie auch alles verloren haben.\n- Gegenüber feindlichem {{champion:56}} \n - Ein Albtraum? ... Da bin ich schon lange drüber.\n - Etwas wie du macht mir keine Angst mehr.\n - Ich lebe schon seit langem in ewiger Finsternis. ... Die Angst ist schon lange in Vergessenheit geraten.\n- Gegenüber feindlichem {{champion:412}} \n - All' diese Seelen. ... Wenn ich nicht wüsste, dass ihre Zahl nur so ein kleiner Teil des Ganzen ist.\n - Selbst der Tod ändert uns wohl nicht. ... Du warst schon immer ein grausamer Einzelgänger.\n- Beim Nutzen von {{item:3905}} \n - Folgt ihnen meine Kinder\n - Auch ihr seit nur eine Hülle eurer selbst.\n - Ich danke euch für eure Hilfe\n- Beim Kauf von {{item:3109}} \n - Auch wenn ich kein Ritter bin, so schwöre ich auf all diejenigen, die ich glaubte verloren zu haben.\n - Ein Schwur Schutz zu leisten? ... Ich schwöre auch mein eigenes Leben oder als was man es jetzt noch bezeichnen mag.\n - Ich werde verhindern das so etwas noch einmal geschied ... Koste es was es wolle!\n- Beim Kauf von {{item:3050}} \n - Konvergenz. ... Es sollte unser aller Ziel sein.\n - Annäherung von Menschen im Geiste und um Handeln. ... Es sollte nicht nur mein Weg sein, aber dennoch will ich den ersten Schritt machen.\n- Beim Kauf von {{item:3190}} \n - Ein Glücksbringer. ... Auf das wir alle diesen Kampf überstehen.\n - Manchmal bedarf es Verluste, doch ich habe mehr Verluste gehabt als alle Anwesenden leisten müssten.\n- Beim Kauf von {{item:3905}} \n - Schatten? ... Ich seit wie meine Begleiter.\n - Es freut mich euch kennen zu lernen.\n\n___\n\n|Statistiken | Level 1 - | pro Level - | Level 18\n|-\n|Mana\t|\t480\t|+ 30|\t990\n|Mana Reg|\t8,0\t|+ 0,75|\t20,75\n|Leben\t|\t530|\t+ 87\t|2009\n|Leben Reg\t|7,5\t|+ 0,6\t|17,70\n|AD\t|\t44\t|+ 2,7\t|89,9\n|AS\t\t|0,625\t|* 0,03\t|0,944\n|Armor\t|\t30\t|+ 2,8|\t77,6\n|MR\t|\t30\t|+ 0,5\t|38,5\n|MS\t|\t335\n|Range\t|\t550\n\n**Einstufung:**\n\n - Schaden: 5/10\n - Durchhaltevermögen: 3/10\n - Kontrolle: 6/10\n - Mobilität: 1/10\n - Unterstützung: 6/10\n - Schwierigkeit: 5/10\n\n___\n\n**P1 – Mantel der geliebten Geister**\n\n - Reika wird von bis zu 5 Vögeln umkreist. Von denen alle ungeraden Zahlen (Die Vögel 1, 3 und 5) auf einem Radius von 150 Einheiten um sie herum kreisen, während gerade Zahlen bei ihr bleiben (Die Vögel 2 und 4) (Vgl. Syndra)\n - Gegner die maximal 150 Einheiten von Reika weg sind, erhalten sofort und pro Sekunde magischen Schaden in Höhe von 1/2/3/4% AP pro Vogel. (Level 1/6/11/16)\n\n**P2 – Gezielter Angriffsbefehl**\n\n - Reikas Normale Angriffe verbrauchen einen Vogel, um zusätzlich magischen Schaden in Höhe von 2/4/6/8% AP mal N zu zufügen. (Level 1/6/11/16) (N ist die Zahl der Vögel vor dem Angrff => der 5. Vögel fügt somit 10/20/30/40% AP magischen Schaden zu.)\n - Vögel respawnen nach 6/5/4/3 Sekunden. (Level 1/6/11/16)\n\n**Q**\nKosten: 90/100/110/120/130 Mana\nAbklingzeit: 18/16/14/12/10 Sekunden\nReichweite: 600 IGU / Radial: 325 IGU\n\n**Q1 – Ausschwärmen**\n\n - Reika sendet ihre Vögel aus, ein gewähltes Gebiet (Radius 325 IGU) für 4 Sekunden zu bewachen. (Die Vögel kreisen dort)\n - Gegnerische Champions in dem Gebiet werden um 30/35/40/45/50% verlangsamt und erhalten 25/32,5/40/47,5/55 (Rang dieser Fähigkeit) + 5/10/15/20/25% AP (Hälfte von P2 mit N=5) magischen Schaden pro halbe Sekunde. (Maximal: 200/260/320/380/440 + 40/80/120/160/200% AP)\n - Reika verliert über 4 Sekunden den Zugriff auf ihre Passive und ihre Ultimative Fähigkeit.\n - Zum Ende dieser Fähigkeit erhält Reika die maximale Anzahl an Vögeln für ihre Passive zurück.\n\n**W**\nKosten: 50/60/70/80/90 Mana + 10 Mana pro halbe Sekunde \nAbklingzeit: 1 Sekunde (Beginnt nach Abbruch)\nReichweite: 125 – 425 IGU\n\n**W1 – Chorus des Untergangs**\n\n - Reika beginnt zu singen, wobei sich ein Gebiet mit Radius 125 um Reika bildet und sich über 1,5 Sekunden auf Radius 425 ausdehnt.\n - Reika und Verbündete in dem Gebiet erhalten 4/8/12/16/20 Rüstung und Magieresistenz und werden um 0,5/1/1,5/2/2,5% ihres fehlenden Lebens pro Sekunde geheilt.\n - Wenn Reika eine anderen Fähigkeit nutzt, angreift oder sich bewegt, beendet dies diese Fähigkeit.\n - Jeder Hard-CC, außer Stasis aus verbündeten Quellen (e.g. Zhonyas) beenden diese Fähigkeit. (also alles außer Slow, Brittle, Cripple ...)\n\n**E**\nKosten: 80 Mana\nAbklingzeit: 15/14/13/12/11 Sekunden\nReichweite: 500\n\n**E1 – Mark erschütternder Schrei**\n\n - Reika schreit, worauf für 1/1,25/1,5/1,75/2 Sekunden alle Einheiten im Radius 500 IGU 30% Lauftempo erhalten (Gegner und Verbündete) und gegnerische Einheiten gefeared werden.\n\n**R**\nKosten: 100 Mana\nAbklingzeit: 150/135/120 Sekunden\nReichweite: 800\n\n**R1 – Verfluchter Gesang**\n\n - Reika singt und stößt dabei einen linearen Skillshot in Blickrichtung aus, der Kollision ignoriert. Der erste Champon, der von ihm getroffen wird stimmt in das Lied ein und stößt ebenso einen linearen Skillshot in Blickrichtung aus. Dies kann bis zu zweimal geschehen. (Vgl. Taric-E)\n - Gegnerische Einheiten, die von ein oder mehr dieser Skillshots getroffen werden, erhalten 150/250/350 + 100% AP magischen Schaden.\n - Singende Einheiten werden in Folge dessen für 2 Sekunden von einem Vogelschwarm umkreist, der aus N(aktuell) Vöglen besteht. (N(aktuell) = N zum Zeitpunkt der R-Nutzung.)\n  - Verbündete Fernkampf-Champions erhalten durch den Vogelschwarm für 2 Sekunden Reikas P2. (Vögel respawnen nicht)\n  - Verbündete Nahkampf-Champions erhalten durch den Vogelschwarm für 2 Sekunden Reikas P1.\n  - Gegnerische Champions erhalten durch den Vogelschwarm für 2 Sekunden den Schaden von Reikas P1.\n\n___\n\n**Erläuterungen zur Spielweise**\n\n - Reika ist ein recht aggressiver Supporter, der über die geschickte Nutzung ihrer E einen gegnerischen Engage nicht nur ins Leere laufen lässt, sondern auch noch Utility für einen Gegenschlag zur Verfügung stellt.\n - Dadurch dass die Q lediglich die Nutzung der Passiven und Ultimate verhindert, jedoch keine weiteren Bedingungen stellt bietet es sich an sie zu nutzen nachdem man die \"starken Vögel\" der Passiven und die Ultimate verbruacht hat, da sie somit keine releanten Einbußen erfährt.\n - Da die W nicht durch eine aktive Q beendet wird kann Reika eine große Zone startegisch kontrollieren. (Schadenszone durch die Q und Utility über die W)\n - Da die Q nach 4 Sekunden die maximale Anzahl der Vögel generiert, sollte man vor ihrer Nutzung so viele Normale Angriffe wie möglich durchführen.\n - Da die R mit der aktuellen Anzahl an Vöglen bei Reika skaliert, ist die R am stärksten, wenn Reika mit ihr initiert oder sie nach dem Auslaufen der Q nutzt.\n - Eine geeignete Teamfight-Kombination ist hieraus: E > R > Autoattack > Q > Autoattacks > W (so lange wie möglich/nötig) > Autoattacks\n - Für die Nutzung der R gibt es zwei relevante Pattern:\n  - Reika nutzt sie an einem verbündeten Damage-Dealer, sodass die von diesem ausgehende Instanz sein Angriffsziel trifft.\n  - Reika nutzt sie an einem gegnerischen Engage-Champion, sodass die Folgeinstanzen im eigenen Team unterstützen.\n\n___\n\n**Synergien mit Verbündeten**\n\n - Reika synergiert im wesentlichen mit zwei Klassen von Champions.\n  - Schützen, da bei ihnen berechenbar ist, wen sie angucken, sodass die R besser ausgespielt werden kann.\n  - Diver, da sie von den von Reika generierten Stats am stärksten profitieren. (Resistenzen und Lauftempo)\n\n___\n\n**Problematische Gegner**\n\n - Dadurch dass Reika eine sehr stationäre Position im Kampf einnehmen muss (verunden mit der W) und durch ihr squishy auftreten, bekommt sie Probleme mit flankierenden Champions (Divern Attentätern)\n\n___\n\n___\n\n_Stand: 22.04.19_\n\n___\n\n> ## Unser hauseigenes Wikipedia (lt. INoKami) aus meiner Feder\n[[Guide] Die Möglichkeiten des Konzept-Schreibers](https://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/jIFVA5Yo-guide-die-maglichkeiten-des-konzept-schreibers)\nWird regelmäßig aktualisiert.\n\n---\n\n> ## Die Arcana\nHierbei handelt es sich um ein Großprojekt von mir, welches ein Kollektiv von mehreren Konzepten darstellt, die ich im Laufe der Zeit veröffentlichen werden. Die Hintergrundgeschichten dieser Konzepte bilden eine gemeinsame Geschichte mit welcher ich einen besonderen Blick auf das von uns allen so geliebte Runeterra werfen möchte.\n\n>### * ? - Der Narr:  * * - * * I – Der Magier: * * - * * II – Die Hohe Priesterin: * * - * * III – Die Herrscherin: * * - * * IV – Der Herrscher: * * - * * V – Der Hierophant: * * Eigentlich wollte die kleine Ryona mit ihrer Schwester Soraya nicht diesen Weg gehen. Lange Vorbereitungen sollten dazu führen, dass die beiden zum Gefäß eines der mächtigsten Aspekte des Targon werden konnten, doch es sollte anders kommen … ganz anders. * * Hattest du schon immer die Phantasie mal ein Vasallen zu spielen oder den BlueBuff über die Karte zu navigieren? Dann mach dich gefasst auf Ryona, denn mit ihr ist nichts mehr unmöglich. [Ryona - Das arcane Medium](https://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/kpWhm8Pj-ryona-das-arcane-medium) * * - * * VI – Die Liebende: * * - * * VII – Der Wagen: * * - * * VIII – Die Gerechtigkeit: * * - * * IX – Der Erimit: * * - * * X – Das Rad des Schicksals: * * - * * XI – Die Kraft: * * Warum scheiterte Noxus an Ionia? Was hielt sie davon ab zu gewinnen, wo sie alle Mittel nutzten um den Sieg zu garantieren? Was hält ein Reich für das selbst der Tod keine entgültige Größe ist auf ein so zersplittertes Reich wie Ionia zu besiegen? Willhelm sollte mit einer ganzen Armee diese Frage lösen, doch was auch immer er herausfand: Nun ist er einer der beachtbarsten Antagonisten seiner nun ehemaligen Heimat. * * Wolltest du schon immer mal einen Gegner an die Wand donnern und von jedem Schlag wissen, dass er Knochen bricht? Dann ist Willhelm definitiv eine gute Wahl für dich. [Willhelm - Die einschüchternde Gewalt](https://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/iX27J8LR-willhelm-die-einschuchternde-gewalt) * * - * * XII – Der Gehängte: * * Der Tod ist in Runeterra eine Größe, der sehr viel Beachtung geschenkt wird. Ob es die Verkörperung des Todes Kindred ist oder das ganze Reich der Toten, dass sich südöstlich von Ionia befindet. Der Tod ist eine bedeutende Macht und Shikuro scheut sich nicht diese Macht zu nutzen. * * Wolltest du schon immer mal die Kontrolle über Leben und Tot haben? Dann lege dich in die Hände des wohl suizidalsten Champions, den dieses Forum je gesehen hat. [Shikuro - Der Necromantist](https://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/bYnPMNH5-shikuro-der-necromantist) * * - * * XIII – Der Tod: * *  Der Tod ist mächtig. Das weiß auch der Targon, doch wie mächtig der Tod wirklich ist versucht er um alles zu verbergen. Finstere Rituale im Herzen des Targon sollen die Rakkor stärken. Durch das Schicksal von Yamina werfen wir einen Blick auf die finstere Seite des so strahlenden Glaubens der Solari * * Wenn auch du dir denkst, dass der Tod der stärkste CC im Spiel ist, dann wird Yamina dir den Umgang mit ihm lehren. [Yamina - Die Rückkehr der Geopferten](https://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/T8arPwci-yamina-die-ruckkehr-der-geopferten) * * - * * XIV – Die Mäßigkeit: * * - * * XV – Der Teufel * * - * * XVI – Der Turm: * * Wie schön die Gesegnete Insel doch war … bevor sich alles änderte. Reika wird noch immer von den Folgen des abrupten Wandels verfolgt. Die ehemalige Erzieherin hat jedoch etwas, dass ihr neuen Mut gab. * * Hörst du auch ab und zu Stimmen aus dem Jenseits. Hängst du immer noch an denjenigen, die verblichen sind? Dann folge Reika auf ihrem Weg mit dem Geschenk des Todes umzugehen. [Reika - Die Witwe der vergessenen Lieder](https://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/ZjOaWId7-reika-die-witwe-der-vergessenen-lieder) * * - * * XVII – Der Stern: * * - * * XVIII – Der Mond: * * Ionia ist ein unglaublich heterogenes Reich. Gefühlt in jedem Ort gibt es eigene Traditionen, Lehren und Riten. Luna ging in diesem Reich ihren eigenen Weg. Nach ihrer Flucht aus Wuju lernte sie die Lehren des Schattenordens kennen und ist nun die perfekte Untergebene für jenen ganz eigenen Kleingeist. * * Dieser Champion ist nichts für Mondsüchtige, denn sie hüllt die Kluft in den silbrigen Schein des wandelbaren Mondes. [Luna - Die nächtliche Präsenz](https://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/aEYqLE31-luna-die-nachtliche-prasenz) * * - * * XIX – Die Sonne: * * - * * XX – Das Gericht: * * Bevor Jericho Swain die Macht in Noxus ergriff, waren Spiele bis zum Tod im Herzen des Reiches ein beliebtes Mittel zur Unterhaltung der Masse. Verurteilte Kriminelle und Gefangene von den Fronten der noxischen Expansion wurden in gewaltigen Amphitheatern durch blutige Kämpfe hingerichtet. Eine dieser als Gladiatoren bezeichneten Verurteilten ist die aus Shurima stammende Galerya Ianiva Moertis, die die Arena jedoch auf eine Art verlassen sollte, mit der selbst Draven nicht rechnete. [Gaia – Die legendäre Gladiatorin](https://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/pUqXxtbG-gaia-die-legendare-gladiatorin ) * * - * * XXI – Die Welt: * * - * * XXII – Der Android: * * - * * XXIII – Die Gottheit: * * - * * XXIV – Die Zeit: * *  Wenn man in Zhaun lebt, und das „Glück“ hat für einen der Barone zu arbeiten, dann kann man schon recht gut überleben. Doch die Barone sind eingebildete, geldgierige Fanatiker und gieren nur nach allem was ihnen Geld und Macht verleiht. Temarie soll im Auftrag eines dieser Barone der Zeit auf die Spur kommen. * * Hast du Zeit? Und zwar sehr viel davon, denn Zeit ist Geld , oder im Fall von Temarie Mana. [Temarie - Die Kausalität](https://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/laJ45E1x-temarie-die-kausalitat) * * - * * XXV – Die Seele: * * - * * XXVI – Der Körper: * * - * * XXVII – Der Geist: * * Was würdest du machen, wenn du über mehr als ein Jahrzehnt gefesselt und geknebelt in einem Hochsicherheitsgefängnis lebst. Jegliche Kontakte sind die genommen und deine Sinne sind scheinbar kein Teil mehr von dir? Cyrus hatte genau dieses Leben, nachdem er für den Mord an einigen noxischen Soldaten verantwortlich gemacht wurde. Die Zeit hat ihn verändert … sehr verändert, denn aus dem hinterhältigen Kleinkriminellen, der mit mehr Glück als Verstand die noxische Invasion in Ionia überlebte, wurde eine alles verändernde Macht, die das Machtgleichgewicht Runeterras empfindlich stören wird. * * Wenn die Grenzen zwischen Realität und Phantasie verschwinden und unmögliches plötzlich greifbar nah ist, dann ist dieses „Wesen“ nicht mehr weit von dir entfernt. [Cyrus - Das Gefäß des Geistes](https://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/Mfx3YwtE-cyrus-das-gefas-des-geistes) * * - * * XXVIII – Die Aura: * * Was ist wahrlich schön und was lediglich Fassade. Wie kann man die Wirklichkeit von dem Schein unterscheiden. Veronica kennt die Antwort nicht, doch es ist ihr auch bedingt egal, denn sie lebt genau davon, dass die Grenzen der Realität verschwimmen können. Masken sind ihr Geschäft und ihr Leben und inzwischen ihre ganze Existenz.[Veronica – Die Maskenbauerin](https://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/iwBkvbA5-veronica-die-maskenbauerin) * * - * * XXIX – Der Schatten: * * - * * XXX – Die Existenz: * * - * * XXXI – Die Zahl: * * - * * XXXII – Der Name: *\n\n---\n\n> ## Weitere Champions aus meiner Feder:\n\n>### *In League gibt es sehr verschiedene Champions mit verschiedensten Funktionen, doch eine Klasse zeichnet sich durch eine vergleichsweise geringe Variation aus: Die Schützen. Aurora will mit ihrem Bild der Welt ein Zeichen setzen und ihrem Idol einen großen Schritt näher kommen, doch für welchen Preis? * * Behältst du immer einen ruhigen Kopf und verschwendest deine Angriffe nicht als seinen sie kostenfrei, dann öffnet dir mein Erstlingswerk die Augen auf eine neue Perspektive von League. [Aurora, die besessene Seelenschützin](https://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/huAWHvuz-aurora-die-besessene-seelenschatzin) * * - * * Jedes Spiel in League verursacht immensen Schaden. Türme werden zerstört, Vasallen schwer verletzt und auch die Champions erfahren immensen Schaden. Um die Reparatur der Kluft und die Umsetzung von bedingter Vorhersehbarkeit kümmert sich das Personal der Kluft. * * Interessierst du dich für einen Blick hinter die Kulissen der Kluft, dann ist dieser Rentner genau das richtige für dich. [Oblivion - Der Aufseher](https://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/iywAsVUE-oblivion-der-aufseher) * * - * * Manchmal hat man Pech und manchmal kommt es noch schlimmer. Pandora hat in Sachen Pech wohl das große Los gezogen und hat sich neben der Leere auch noch einen Darkin angelacht. * * Wenn dich ihr Pech nicht zu sehr abschreckt, dann ist das Unglückspärchen genau das Richtige für dich. [Pandora &amp; Nava'aiya - Die gefährliche Schönheit](https://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/uQvOtFjO-pandora-navaaiya-die-gefaahrliche-schanheit) * * - * * Was wäre, wenn du von dem einen zum anderen Moment aus dem Gedächtnis der Welt verschwinden würdest. Niemand könnte sich an dich erinnern und niemand wird es jemals wieder tun. Viele Leute würden kriminell werden, doch Loreen wurde ein anderer Weg geöffnet. Der Weg der Regentschaft. * * Was würdest du tun, wenn niemand sich an dich erinnert? [Loreen Organon - Die noxische Intrigantin](https://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/n35is2bO-loreen-organon-die-noxianische-intrigantin) *\n\n---\n\n> ## Champions die in Kooperation entstanden:\n\n>### * Im Laufe der Jahre in denen Riot Games unsere geliebten Champions hegt und pflegt sind leider auch viele kleinere Mechaniken verloren gegangen. Fand ist hierbei ein Konzept dessen zentrale Idee das Wiedereinbetten dieser Mechaniken ist. * * Ich entschuldige mich vielmals für die fehlende Formatierung [Fand - Die helfende Hand](https://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/tpRyyHek-champion-idee-fand-die-helfende-hand) * * - * * Wir alle wissen, dass in Bandle die wohl findigsten Wesen des Universums von League leben. Dexter ist jedoch selbst unter ihnen noch einmal ein ausgezeichnet findiger Yordle, der nicht nur mit den eigenen Waffen kämpfen kann. * * Wenn du Spaß daran hast dich mit den Mitteln anderer zu beweisen, wird dir dieser kleine Kleptomane definitiv gefallen. [Dexter - Der Trickser](https://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/O3spGGmO-dexter-der-trickser) * * - * * Piltover und Zhaun befinden sich in einem äußerst instabilen Gleichgewicht, dass nur so von der gegenseitigen Abhängigkeit durchwoben ist. Was würde wohl passieren, wenn man dieses Gleichgewicht ins wanken bringt? Finde es mit diesem gewaltigen Kollektiv von 5 Champions heraus und bringe mit deinen Freunden auch das Gleichgewicht der Kluft zum wanken. [Zhaun's Unheilverkünder](https://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/EW9zR9QM-champion-konzept-zhauns-unheilverkander-ft-amycos-cyrus-lunaaa)*\n\n___\n\nZu allerletzt wäre ich über Rückmeldungen froh, daher hier eine kleine Umfrage und die Kommentar-Sektion.\n\nMan sieht sich in den Kommentaren dieses und vieler anderer Champions hier im Forum.","replies":[{"poster":"CosmicSphere","date":"2019-04-23T21:15:30.854+0000","up_votes":2,"down_votes":0,"body":"Schön das das Konzepte Forum langsam wieder aufblüht:)\n\n(Ich fand das Bild das du von der LOL Universum Seite benutzt hast schon immer toll und habe mir da auch Ideen im Kopf gemacht weshalb es ich freut das du ein ganzes Konzept daraus gemacht hast.)\n\nDie Passive finde ich schön, passend und vielseitig einsetzbar. \nDie Q auch ziemlich nice.\nDie W, finde ich, harmoniert bestimmt gut mit Healitems die bestimmt generell gut zu ihr passen da sie AP, MP5 und + %Heilung geben.\nAuch E finde ich gut obwohl ein Fear mit zusätzlichen MS für Gegner für 2sec. etwasssss viel ist. So 1,5 wäre da schon wieder gut denk ich.\nDie Ultimate aber finde ich genial. Wie die Passive sehr vielseitig einsetzbar und man muss sich mit seinen Team verständigen wegen den Umlenkung der Strahlen. Die Buffs und DeBuffs sind auch gut die sie bringt. Mit einer guten Ultimate kann man da bestimmt den Teamfight Entscheiden. Aber warum hat die Ultimate 5 DMG Level statt 3?\n\nMeiner Meinung nach ein ziemlich gutes Konzept eines Manalastigen aggressiven Supporters. Von den gibt es nicht so viele (keine?XD) im Spiel.\n\nMfG Cosmic:){{sticker:poppy-wink}}","replies":[{"poster":"Amycos Cyrus","date":"2019-04-24T04:58:40.984+0000","up_votes":2,"down_votes":0,"body":"Danke auch von mir für deinen Kommentar und das grundsätzlich sehr positive Feedback.\n\nBezüglich der Items bin ich aktuell auch dabei alle meine Konzepte um einen Aspekt \"Empfohlene Items\" zu ergänzen, wobei deine Aussage mit den Support-Items ja grundsätzlich korrekt ist (sieht man ja auch an den Zitaten)\nDie Schadens-Ränge der R habe ich korrigiert. (Ist mir und INoKami gar nicht aufgefallen XD)\n\nBezüglich der 2 Sekunden Fear. Das kann man ja recht gut über den Rang der Fähigkeit kontrollieren (Rangiert ja von 1 bis 2 Sekunden), da ich nicht davon ausgehe, dass sie in einem Spiel Level 18 wird. (Dazu hat sie spätestens ab Level 16 dank ihrer R zu großen Einfluss in Teamfights)\nIm Endeffekt ist die E ja ein zweischneidiges Schwert, sie eignet sich daher eher zum disengagen oder um Gegner im Teamfight zu zerstreuen. (Vgl. Gragas-R)\n\nZu dem Bild: Ich finde grundsätzlich sehr witzig, das wir beide in so schneller Folge ein Konzept auf Bildern der Runeterra-Map veröffentlich haben. (Wobei dieses Konzept nun auch schon seit dem über 3 Monaten in Arbeit war. XD)\n\nMfG.\nAmycos Cyrus","replies":[]}]}]}