{"poster":"Amycos Cyrus","date":"2020-02-17T17:21:30.130+0000","title":"Gaia - Die legendäre Gladiatorin","subforum":"Skin- & Champion-Konzepte","up_votes":5,"down_votes":0,"body":"Nun dann will ich mich mal wieder mit dem inzwischen vierzehnten Konzept zurückmelden.\nDiesmal schauen wir uns die von den Darkwills in Noxus etablierten Gladiatorenkämpfe an, die wir ja bereits durch die Cinematic von \"Awaken\" erblicken durften. Was sind diese Spiele für Noxus und warum kämpfen die Gefangenen und Verurteilten eigentlich in diesen damals noch tödlichen Kämpfen?\n\nMit diesen Fragen heften wir uns an die Spuren einer Legende, deren Aufstieg Draven nur sehr ungern erblicken durfte.\n\nhttps://youtu.be/zF5Ddo9JdpY?t=15\n\nDer Ausschnitt der \"Awaken\"-Cinematic in der die Arena präsentiert wird. (Sekunde 15)\n\n___\n\nInhaltsverzeichnis:\n\n - Lore:\n - Aussehen:\n - Zitate:\n - Statistiken und Einstufung:\n - Fähigkeiten:\n - Erläuterungen zur Spielweise\n - Synergien mit Verbündeten\n - Problematische Gegner\n - Empfohlene Items\n - Verweise etc.\n\n___\n\n## Chapter I: Die Gladiatorin Galerya Ianiva Moertis\nMein Name ist Galerya Ianiva Moertis, doch in dem Land, indem ich nun schon seit einigen Jahren hausen muss, kennen mich die Leute nur unter dem mir zugeschriebenen Pseudonym Gaia.\nMeine Geschichte spielt auf einer der bekanntesten Bühnen dieses Landes, dem Amphitheater \"Victoria\".\nEs heißt es gibt nur zwei Weg in diesem Amphitheater zu kämpfen. Der erste ist, dass man sich bewirbt, um sich einen Namen in diesem Land zu machen. Der zweite ist, dass man von dem, was man als noxische Justiz bezeichnen könnte, zum Tode verurteilt und spektakulär zur Schau gestellt werden soll. Menschen, vor allem hier in Noxus, lieben nun einmal das Gefühl von Macht. Wie gierige Vampire ergötzen sie sich am Leid und Tod der Kämpfenden, die egal aus welchem Grund sie an den martialen Spielen teilnehmen, als Gladiatoren bezeichnet werden.\nUrsprünglich komme ich aus einer kleinen shurimischen Siedlung namens Urzeris, wobei sie heute in noxischem Territorium liegt. Als damals die noxischen Truppen in unserer Nähe anlandeten, mobilisierte wir jegliche Kräfte, die wir hatten, doch wir mussten schon sehr schnell unsere Niederlage eingestehen. Hätten wir uns ab da eingegliedert, wäre es wohl nicht so weit gekommen, dass ich nun hier in der Arena um mein Leben kämpfen muss, doch wir waren ein recht stures Fleckchen auf der Karte und sabotierten die Noxier, wann immer es ging. Eines Abends, die Sonne war gerade am Horizont verschollen, setzten mich zwei leicht angetrunkene Soldaten fest, sodass ich alsbald hier in der Hauptstadt des noxischen Großreichs landete. Ausgestellt und angeprangert auf dem Schlachtfeld der Zivilisten, sollte ich zu ihrer Belustigung mein Leben lassen.\n\nWenn man das erste Mal in die Katakomben der Hauptstadt geführt wird, sieht man erst wie finster das wahre Gesicht Noxus' ist. Unmengen an in das Gestein geschlagenen Zellen reihen sich entlang eines schier ewigen Tunnelsystems im Untergrund der Stadt, wie an einer Perlenkette auf. Einige von ihnen triefen nur so vom Blut, der \"Überlebenden\", denn Gefangene, welche die \"Vorführungen\" überlebten, erhielten selbstverständlich keine Form von Versorgung. Nicht wenige waren in diesen Zellen gestorben und ich sollte eine dieser Zellen mit meinem Leben füllen. ... Jedenfalls für kurze Zeit.\nDer Zellwart, der mich führte war ein recht alter Mann, dem Recht und Sitte wohl nicht viel bedeuteten, jedenfalls war die Art und Weise seines Handelns als gewalttätig und unsittlich beschreibbar. Junge Frauen, waren wohl für ihn ein äußerst seltener und mehr als lieber Anblick.\nZwei Tag nachdem ich den ersten Schritt in mein letztes Heim gesetzt hatte, sollte ich das erste Mal die Bühne betreten auf der mein Leben sein Ende finden sollte. Wenige Tausend jubelnde Noxier saßen dicht gedrängt auf der Tribüne, welche sich um die Arena herumwindete. An der südlichen Seite des Amphitheaters waren zudem einzelne Logen in denen zentrale Figuren von Noxus ihren Platz genommen hatten. Allen voran auch der eingebildete Bruder des bis dato noch zukünftigen Regenten Darius, Draven. Er war der Leiter und Champion des Amphitheaters. Die Massen liebten ihn und bejubelten sein auftritt weit mehr als den Einmarsch derer, an deren Leid sie sich ergötzen wollten.\nAls ich nun mit einigen anderen Gladiatoren in der Arena stand und mich umsah, wuchs das Grauen noch um einiges an. Nicht nur, dass einige der anderen Gladiatoren durch tiefe Narben geziert waren, erschütterte mich, sondern auch dass diejenigen, die eben nicht zum Tode verurteilt waren, schwere Waffen und Rüstungen trugen.\nWie sollte man überhaupt eine Chance haben, wenn man in dünnen Leinen gekleidet, gegen voll gerüstete Soldaten kämpfen musste?\nWie konnte etwas so grauenvolles überhaupt erlaubt sein?\nZu unserem \"Glück\" empfand Draven das blanke Abschlachten auch als langweilig und so warf er ein paar Waffen und Rüstungsteile von seiner Loge in die Arena und verkündete: \"So rüstet euch und amüsierte uns!\"\nIch bekam im Chaos derjenigen, die sich rüsten wollten, nur ein großes Schild ab, das durch den  Fall und frühere Verwendungen bereits über tiefe Kerben verfügte. \"Wenigstens etwas\", dachte ich mir und erhob das Schild, von dem mein Leben abhängen sollte.\nIch blickte nach oben in Richtung Draven, der bereits durch das Durcheinander etwas amüsiert war und vermerkte ein leichtes Schmunzeln in seinem Gesicht, als unsere Blicke uns trafen. Ihm war wohl bewusst, dass es für mich gar nicht so schlecht war ein Schild bekommen zu haben oder er dachte sich einfach, dass ich wohl die erste sein würde die ihr Leben lassen würde. Jetzt im Nachhinein weiß ich es nicht, doch in dem Moment fühlte ich mich angestachelt mich zu beweisen.\n\nDas Dorf aus dem ich kam war durch seine Lage an der Mündung eines kleinen Flusses vergleichsweise anfällig gegenüber Bedrohungen gewesen. Wurden wir vom Land aus belagert, so konnten wir schlechter zurückweichen, und Angriffe vom Wasser waren gegen uns durch unserer weite Grenze zum Fluss und zum Meer, vergleichsweise einfach. Darum waren in unseren Reihen Fertigkeiten überliefert, die uns dazu verhalfen eines der solidesten Bollwerke Shurimas zu errichten.\nZwar waren diese Kenntnisse durch den langen Frieden in Shurima über eine ebenso lange Zeit nicht zur Anwendung gekommen, doch sie wurden über die Generationen weiter getragen. \nNun, hier in dieser Arena, wollte ich sie nutzen um zu überleben und zu zeigen, dass der Tod keine Alternative für mich ist.\n\nUmgeben von den anderen Gladiatoren, verbarg ich mich etwas hinter den Schild, das aufgerichtet etwa so groß war wie ich. Nicht das es etwas besonderes war. Es war ein Großschild und ich war, sagen wir für mein Alter deutlich zu klein geraten. Die Blicke der anderen Gladiatoren stielten auf mich genauso wie die Blicke des Publikums. Sie alle erwarteten meinen Fall und als Draven offiziell verkündete, dass die \"Schlacht\" beginnen soll, war ich zu einem der Hauptziele der anderen geworden.\n\nWo wir gerade dabei sind, sollte ich erklären, warum die zum Tode verurteilten überhaupt über einen Kampfwillen verfügten. Es gab in Noxus eine Möglichkeit dem Todesurteil zu entgehen. Dazu musste man nur eine entsprechende Leistung in der Arena zur Schau stellen. In gewisser Weise hieß es also: \"Sterben oder töten\"\n\nIch rannte mit dem Schild, das ich hinter mir herzog an den Rand der Arena und richtete das Schild vor mir auf. Nun war vor mit das Schild und hinter mir die steinerne Wand, die so hoch war, dass sich niemand darum bemühen wollte sie zum eigenen Überleben zu erklimmen. Die ersten Schwerthiebe trafen auf das eiserne Schild und das laute Klingen hallte von diesem wider. In diesem Moment fühlte ich mich, als hörte ich in dem eisernen Klirren die Stimme meiner Eltern. Mir kamen die Tränen, denn einem alten Mythos meines Dorfes zur Folge verabschiedeten sich die Toten bei ihrem Weg ins Jenseits von ihren Hinterbliebenen. Zwar konnte ich nicht sicher sein, doch in dieser scheinbar ausweglosen Situation waren die Worte und Traditionen, die ich über Jahre gelernt hatte mir einfach näher, als meine rationale Auffassung.\n\"Wir sind bei dir\", hörte ich sie sagen: \"Du musst überleben!\"\nAls hätten Worte die Macht Kräfte freizusetzen, von denen man selbst nie wusste, spürte ich wie Wärme meinen linken Arm hinaufstieg. Als würde sich fast kochendes Blut zu meinen Fingern kämpfen, floss die Wärme durch meinen Arm in die Hand mit der ich die Halterung des Schildes umschloss. Doch sie wollte nicht dort verweilen.\nWenige Augenblicke später fühlte ich, dass sich das Schild wie durch eine geisterhafte Kraft veränderte. Für die anderen Gladiatoren schien noch nichts passiert zu sein, doch von innen sah ich, dass das alte, rostige Schild sich scheinbar erneuerte. Nicht nur das, denn vom Griff aus ergoss das Schild etwas, über meinen Arm. Wie die Wärme zu meiner Hand floss, floss nun eine glänzende, metallische Flüssigkeit über meinen Arm.\nIn der nun strahlenden Innenseite des Schildes sah ich die Gesichter meiner Eltern. Ihnen standen, wie auch mit, die Tränen in den Augen und ich erahnte aus der Bewegung ihrer Lippen, dass sie sich dafür entschuldigten, dass sie mich in dieser Welt alleine lassen müssen.\nAls die metallische Flüssigkeit um meinen Arm herum langsam erstarrte, schien die Veränderung des Schildes auch auf die Front hindurch gedrungen zu sein, dann das Klirren der Schwerter verhallte. Das Bild meiner Eltern verwischte sich und ich erhob mich. Ich fühlte mich, als sollte ich mich nicht verstecken, als hätte ich die Kraft zu überleben. So hob ich das Schild, das ich auf dem Boden abgestellt hatte, da es mir zum Halten zu schwer war und bemerkte, dass es nun deutlich leichter war. Erneut blickte ich hinauf zu Draven und sah ihn erneut schmunzeln. Er fühlte ich wohl amüsiert.\nAls der erste derjenigen Gladiatoren, die sich hier einen Namen machen wollten, bemerkte, dass ich neuen Mut und Entschlossenheit gefasst hatte, wendete er sich von seiner aktuellen Handlung ab und fixierte sich darauf mich niederzustrecken. Sein gewaltiges Schwert führte er in einer kraftvollen Bewegung von der rechten Seite an meinen Leib. Er erhoffte sich einen guten Treffer, da ich sicherlich träge und langsam wirkte.\nPlötzlich empfand ich das Gefühl, als würde jemand anderes meine rechte Hand führen, die zielsicher und fast schon reflexartig in die Klinge des herannahenden Schwertes griff. Um den Einschlag des massiven Schwertes ausreichend abzufangen, stütze ich mich gegen das Schild, welches ich etwas Schräg in den Boden drückte. Blut floss über den Daumen meiner rechten Hand, doch verglichen mit dem was ich erwartet hatte, war der Schmerz ertragbar und auch die Verletzung überschaubar. Erneut begann die fast schon lebendige, metallische Substanz zu fließen und so wanderte sie von meinem linken Arm über meine Schultern um meine rechte Hand. Als sie erstarrte hatte sie einen silbrigen Handschuh geformt und der brennende Schmerz des Einschnittes milderte sich.\nDer Gladiator versuchte erneut sein Schwert auszuholen, doch er konnte es nicht mehr von meiner Hand lösen. Der Handschuh hatte sein Schwert an mich gebunden und verweigerte sich das Schwert freizugeben. Währenddessen begann das Klirren der Schwerter wieder zu beginnen. Einige der anderen Gladiatoren versuchten das Schild zu brechen, doch es verweigerte sich ebenso.\n\nDraven erschien etwas irritiert, es verwirrte ihn wohl, dass das Schild so stark war und es langweilte ihn, dass so wenig passierte. Man hörte zwar das kraftvolle Zusammenprallen von Metall auf Metall, doch das war es. Er und auch das Publikum erhofften sich mehr. Die Gladiatoren sollten zeigen was sie konnten und eine derartige Situation wollte vermieden sein. Aus diesem Grund warf er eine seiner Äxte, die bis dato neben ihm abgestellt waren, in meine Richtung. Die Gladiatoren wichen aus, nur ich schaffte es nicht schnell genug, wodurch die Axt auf das Schild traf. Ein lautes Klirren ertönte und zur Verwunderung des Schwertträgers, der bis zu diesem Zeitpunkt sein Schwert nicht von meiner Hand lösen konnte, war es ihm plötzlich möglich. Auf der anderen Seite war Dravens Axt ihrer Neigung von ihren Zielen abzuprallen nicht nachgekommen, sondern steckte in einem geisterhaften, metallischen Körper fest, der sich wie aus dem nichts auf dem Schild erhoben hatte.\nWenige Augenblicke später versuchte der Schwertträger erneut sein Glück und schlug mit voller Kraft sein Schwert gegen meine ungeschützte Seite. Erneut zögerte ich nicht einen Moment in die Klinge zu greifen. Diesmal jedoch umschloss die metallische Substanz meine Hand, bevor das Schwert die Haut durchdrang, wodurch Dravens Axt vom Schild, fast schon erbärmlich zu Boden fiel.\n\nDraven sah in diesem Bild eine Herausforderung. Nicht nur, dass ich seine geliebten Spiele sabotierte, ich stellte auch noch ihn selbst als schwach dar, da die Axt nicht einmal einen Kratzer an dem Schild hinterlassen hatte. Wer auch immer diese Frau war, dachte er sich, irgendetwas ist in der kurzen Zeit ihrer Gefangenschaft mit ihr passiert, denn mit dieser Stärke wäre sie sicherlich nicht in der Arena geendet.\n\nSo sollten die Spiele erst einmal weiter gehen. Draven sah sich erstmalig nicht in der Position eingreifen zu können und begann sogar eine Faszination dafür zu entwickeln, wie ich mit meiner Situation umging. Anders als alle anderen kämpfte ich ja nicht wirklich. Ich verteidigte mich nur, sodass ich einfach gewartet hätte, sofern mich niemand angegriffen hätte, doch dadurch, dass ich selbst seine Axt parieren konnte, wollte fast jeder gegen mich kämpfen. Wer mich tötete, dass glaubten sie, hätte bewiesen, dass er stärker ist als Draven und das wäre ein Zeichen für das es sich zu kämpfen lohnte. \n\nDie Kämpfe endeten nach wenigen Stunden. Viele verzweifelten an mir und einige brachen vor Erschöpfung zusammen. Bis auf mich hatte jeder der Verurteilten in dieser Zeit sein Leben gelassen und nur diejenigen standen noch auf ihren Beinen, die bereits militärische Erfahrungen hatten und diese Spiele nutzen wollten, um sich einen Namen zu machen.\nLangsam verließen die Gladiatoren die Arena, genauso wie das Publikum die Tribünen. Draven sprang heroisch von seiner Loge und trat langsam an mich heran.\n\"Was macht dich so besonders? ... Du bist nur eine Göre aus Shurima, die hier eher als Spielball hineingeworfen wurde. Also warum ausgerechnet du?\", fragte sich Draven etwas angespannt. Er hob seine Axt vom Boden auf und griff danach an das Schild.\n\"Was hast du mit diesem Schild gemacht?\", erkundigte er sich bei mir: \"Noch nie hat es jemand mit einem Schild geschafft diese Spiele zu überleben.\"\nIch versuchte mich langsam auf meinen müden Beinen aufzurichten und gab Draven das Schild in die Hand: \"Ich habe das Schild nur gehalten und mir gewünscht zu überleben. ... Im Endeffekt möchte ich ihnen also, auch wenn es seltsam klingt, danken. ... Danke für das Schild und danke für mein Leben.\"\nIch blickte in den Himmel und fühlte, dass das was ich während des Kampfes gefühlt hatte keine Lüge war. Meine Eltern waren von dieser Welt verschwunden und in die nächste übergetreten. Fast schon verträumt bedankte ich mich auch bei ihnen für den Segen, den sie mir überlassen haben.\n\n##Chapter II: Arc Sententia XX – Das Gericht\nEine junge, fremdländisch wirkende Frau sollte wenige Tage nach dem eindrucksvollen Schauspiel im Amphitheater, dieses für eine kommende Veranstaltung betreten. Während die Blicke der vor allem männlichen Gäste förmlich an ihr klebten, schien ihr schwarzes Kleid zu wehen, als hätte es sich aus düsterem Nebel geschaffen. Ihre Blicke schweiften durch die Leute und auch wenn ihre Augen durch den Schatten ihrer ausschweifenden Kopfbedeckung verborden waren, erschien es, als wäre jeder den sie ansah sich darüber bewusst, dass sie es genau in diesem Moment tue. Trotz der großen Maße an Gästen füllte ihre Präsenz den gesamten Vorraum, indem sie alle nur darauf warteten die Tribünen endlich betreten zu können.\n\nHätte man einen der vielen gefragt, wer diese Frau sei, so wäre die Antwort immer die Gleiche; Die Person wüsste es nicht. In der Gästeliste war sie als Adriana Darkwill geführt, doch wenn nur eine Sache sicher war, so war es die Tatsache, dass sie kein Mitglied der Darkwills war. Die Regentenfamilie war berühmt und bekannt in ganz Noxus. Jedes Mitglied war Teil des öffentlichen Lebens und zu selben Teilen wesentliches Element der noxischen Gesellschaft. Ob es nun der dato amtierende Regent Noxus' Boram Darkwill war oder sein Sohn Keiran Darkwill, der als Generalmarshal den höchsten Rang des noxischen Militärs inne hatte, die Darkwills kontrollierten alleine schon durch die Anwesenheit ihrer Mitglieder in allen relevanten Gremien ganz Noxus.\n\nDie Tore zu den Tribünen eröffneten sich. Heute sollte es erneut einen Kampf der Verurteilten geben und mit Gaia wurde bereits geworben. Die Maßen strömten wie ein Fluss Quellwasser über die Tribünen und benetzten sie durch ihre Präsenz. Dicht gedrängt saßen nun die Leute auf ihren Plätzen, wobei einige diesem Gedränge entfliehen konnten, da sie in den Logen Platz genommen hatten.\nUnüblich für derartige Veranstaltungen eröffnete Draven die Spiele aus der Mitte der Arena, statt von seiner Loge aus.\n\"Sie, die sie sich hier in dieser Arena bereits einen Namen gemacht hat.\", begann Draven impulsiv, wie ihn die Menge kannte und liebte, die Ankündigung derjenigen auf die sie alle warteten: \"Sie überlebte die Spiele und gewann ihr Leben zurück, doch nun ist sie zurückgekehrt. Nicht als Verurteilte im Kampf um ihr Leben, sondern als Teil all' derer, die diese Spiele nutzen wollen, um sich hier vor euer allen Augen einen Namen zu machen. ... Begrüßt mit mir die einzige Person, die diese Spiele jemals nur mit einem Schild gerüstet überlebte: GAIA!\"\nAus dem schmalen Eingang, der gegenüber des Publikumseinlasses in die Arena führte, trat eine junge Frau in die Arena. Sie trug ein Großschild des noxischen Militärs dicht an ihrem in leichte Rüstung gehüllten Körper. Etwas schüchtern, der Blicke wegen, näherte sie sich dem sie anblickenden Draven. Als sie seine Seite erreichte, schweifte Draven seinen Blick durch die jubelnden Massen: \"Sie alle jubeln für dich, meine Süße.\"\n\"Nein, sie hätten für mich gejubelt, wäre ich hier gefallen, so wie sie es wollten. ... Dreckiges Gesindel ergötzt sich nicht am Erfolg eines einzelnen Fremden. Sie sind durch Spiele wie diese darauf trainiert sich am Untergang der Gefangenen zu ergötzen.\", murmelte Gaia, wobei Draven ihre Worte klar vernahm. Er blickte zu ihr und flüsterte: \"Die Masse liebt Helden. ... Ihre Zuneigung so sehr zu missachten gehört sich vor allem für eine solch zierliche Person wie dich nicht. Bedenke, dass ich immer noch der Herr dieser Spiele bin. Wenn ich dich fallen sehen will, wenn sie dich fallen sehen wollen, dann wirst du fallen. ... Haben wir uns da verstanden.\"\n\"Ich werde nicht fallen solange die Götter wollen, dass ich überlebe. ... Es scheint wohl zu lange keinen Gegenwind für diese verdorbene Gesellschaft gegeben zu haben, dass derartige Menschen wie du überhaupt einen Namen haben. ... Wie konnte eine Nation wie diese überhaupt so großen Einfluss auf dieser Welt erhalten, wenn sie, anders als sie es selbst zu glauben scheint, nicht auf Macht baut, sondern auf Ausgrenzung und der Willkür.\", erklärte Gaia selbstsicher. Draven wendete sich von ihr kopfschüttelnd ab: \"Du willst das Ende dieses Tages wohl nicht erleben, meine Kleine.\" \"Wie ich schon sagte: Weder du noch alle diejenigen, deren gierige Blicke diese Arena gefangen genommen haben, haben die Macht über mich oder irgendwen anderes zu entscheiden.\", merkte Gaia an und präsentierte sich selbstbewusst den Blicken der Masse.\nNach und nach traten nun auch die anderen Gladiatoren in die Arena, wobei einige Besondere von ihnen, eine ähnliche Präsentation durch Draven erfuhren, wie Gaia. Nachdem nun alle in der Arena standen, zog sich Draven in seine Loge zurück und verkündete von dort den Beginn der Spiele.\nDie Verurteilten rüsteten sich mit den in der Arena gestellten Waffen und Rüstungsteilen und stellten sich der Situation. Hätte man Angst sehen können, so wäre die Masse der Angst in der Arena so dicht, dass man die eigene Hand vor Augen nicht sehen könnte.\nDie fähigen Gladiatoren stürmten voran. Sie wollten sich aus den \"Kämpfen\" mit den verängstigten Verurteilten einen Spaß machen und zielten ihre Offensive in erster Linie gegen sie. Gaia war dies jedoch ein Dorn im Auge, sodass sie sich aufmachte diese Offensive aufzuhalten. Die Angst der Verurteilten stand ihnen buchstäblich ins Gesicht geschrieben, doch es schien den sie angreifenden egal zu sein. Die Menge jubelte und feuerte die Angreifer an.\nDas, dabei war sich Gaia sicher, das war das wahre Gesicht dieser Nation. Sie nahm sich einen der leichten Ständer auf denen die Waffen in der Arena abgelegt waren und schmiss ihn den angreifenden in den Rücken: \"Wenn ihr euch hier einen Namen machen wollt, dann solltet ihr auch eine Herausforderung bewältigen. Niemand wird euch dafür ehren, dass ihr verängstigten Zivilisten getötet habt, die überhaupt keine Chance hatten euch zu entfliehen.\", erklärte Gaia in stattlicher Lautstärke: \"Seht euch um. Ihr seit diejenigen die kämpfen gelernt haben. Ihr seit diejenigen, die tatsächlich auch ein Risiko darstellen, sich euch gegenüber zu stellen. Warum stützt ihr euch auf die schwachen, verängstigten, wenn ihr euch einen Namen machen wollt?\"\nDie Offensive kam zum erliegen und Gaia fuhr ruhig fort: \"Schaut euch die Massen an. Die zahlreichen Bürger dieser stolzen Nation, die wahre Krieger bewundern wollen. Ihr meint doch nicht wirklich, dass sie euch ehren würden, wenn ihr euch wie wilde Tiere nur auf die Schwachen stützt. ... Ihr wollt euch einen Namen machen, also stellt euch auch der Gefahr zu sterben. Dies ist ein Ort an dem wir dem eigenen Tod so nahe kommen sollen, wie es nur im Krieg der Fall ist. Hier sollen starke, fähige Krieger beweisen, wer es wahrlich wert ist von dieser Gesellschaft anerkannt zu werden.\"\nDie Verurteilten, die sich noch etwas geklumpt in der Arena befanden, blickten Gaia hoffnungsvoll an und lauschten ihren Worten. Sie hatten schließlich nur ein Ziel: Überleben, um zu ihren Familien und Freunden zurückzukehren.\n\"Grundsätzlich sollten die Menschen, die hier auf den Tribünen sitzen über euch lachen.\", erklärte Gaia und zog damit die Wut der Gladiatoren auf sich: \"Ich meine, es sind aktuell keine friedlichen Zeiten. Würdet ihr ernsthaft in der Lage sein zu leisten, was ihr hier beweisen wollt, dann würdet ihr nicht in dieser Arena kämpfen, sondern an den Fronten der noxischen Expansion. ... Ich selbst bin eine Verurteilte, die vor nicht all zu langer Zeit aus Shurima hier her gebracht wurde, um den Massen ein Opfer zu sein. ... Warum kämpft ihr nicht dort und macht euch einen Namen daraus, dass ihr etwas bedeutendes für euer Reich geleistet habt. Erobert und Kämpft und lasst euch nicht missbrauchen für dieses mehr als zynische Blutbad, dass nur der Befriedigung der Masse gilt.\"\nGaia hatte mit ihren Worten nicht nur die Wut der Gladiatoren auf sich gerichtet, sondern auch das Publikum rief nun lautstark aus, dass Gaia fallen soll. Ein flüchtiger Blick Gaias erkannte, dass ein dezentes Lächeln in das Gesicht von Draven geschrieben war.\nSollte dies Gaias Ende sein?\nSollte Draven Recht behalten und sie nun fallen, wie er es wollte?\n\nIn der Loge der Darkwills erhob sich die bis dahin stille Beobachterin Adriana Darkwill von ihrem, einem Thron gleichenden, Platz und trat an den Rand der Loge: \"Ich hätte nicht erwartet, dass ich an einem Ort wie diesem auf jemanden so fähigen treffen würde.\"\nSie wendete sich von der Szene ab und bat einen der Wachmänner eine Person namens Soraya darüber zu informieren, dass sich das jüngste Gericht erhoben habe. Was auch immer sie damit meinte, es schien von einer ausgesprochen großen Bedeutung zu sein, dann der Wachmann war in Windeseile verschwunden. Adriana hingegen blickte erneut in die Arena: \"Meine kleine Galerya ...\"\n\nWährenddessen begannen die ersten Gladiatoren Gaia anzugreifen. Wie schon bei ihrem ersten Kampf schien niemand fähig ihr zu schaden. Ganz im Gegenteil, der fehlenden Erfolg schadete den Gladiatoren, die sich dadurch vor der Masse, gegenüber der sie sich eigentlich beweisen wollten, als schwach darstellten. Einer nach dem anderen scheiterte an Gaia, ob es nun ein geblockter Schlag oder Hieb war oder der Fall, dass die genutzte Waffe sich nicht mehr von Gaia lösen wollte, nach und nach verlor jeder der es versuchte gegen sie.\nDoch Draven war sich der Situation bewusst und nun wusste er auch passende Maßnahmen getroffen zu haben. Die Galdiatoren, die bis dato nur mit physischen Angriffen versuchten Gaia zu überwältigen zeigten, dass es sich nicht um ihr einziges Mittel zum Erfolg handelte. Statt weitere Waffen an Gaia zu opfern, gingen sie dazu über ihr mit Magie entgegen zu treten. Es waren zwar in erster Linie einfache Zauber, wie kleine Feuerbälle oder Schockzauber, doch sie verfehlten ihr Ziel in keiner Hinsicht. Das Abfangen half Gaia nun nicht mehr und ihr Schild entbrannte nach wenigen Treffern.\n\"Wer auch immer du bist? Wo auch immer du bist?\", erbittete Gaia in der sich zu ihrem Nachteil wendenden Situation: \"Hilf mir zu überleben!\"\nIn dem Toben der Menge und dem Lodern des Feuers, vernahm sie nur Augenblicke nach ihrer Bitte einen Widerhall dieses. Drei kraftvolle Schläge ertönten, als sei ein hölzerner Hammer auf sein Ebenbild getroffen. Anscheinend hatte nicht nur Gaia diese gehört, denn plötzlich kehrte Ruhe ein und die Gladiatoren sahen sich, genauso wie Teile des Publikums um.\nWas war das?\nWoher kamen diese Schläge?\nWas sollten sie bedeuten?\nNiemand könnte ihren Ursprung erahnen. Draven gefiel dieser schnelle Wandel scheinbar gar nicht und so verkündete er nur kurz darauf, dass die Kämpfe weitergehen mögen. Gaia blickte in Richtung Draven und sah ihn nur schmunzeln.\nZur selben Zeit kehrte der Wachmann zurück und Adriana Darkwill erklärte wahrlich erfreut: \"Du bist rechtzeitig zurück. Das Spektakel hat gerade erst begonnen. ... Ich hoffe nur, dass wir unser eigenes Urteil überstehen.\"\nAm Himmel über der Arena erschien ein rotierender Siegelkreis, der sich langsam immer weiter aufspannte und immer mehr Fläche abdeckte. Wenig später projizierte es sein Bild auf den Boden und erst jetzt erkannte man seine wahre Größe. Nicht nur die Arena, das gesamte Amphitheater befand sich schon mitten in dem Siegelkreis, während es sich weiter ausdehnte.\n\"Alle Schuldigen werden gerichtet werden.\", ertöte eine geisterhafte Stimme, die aus allen Richtungen zu kommen schien. Wenig später fielen Schwerter aus Licht vom Himmel, die weder Halt vor steinernen Mauern machte noch von den eisernen Panzern.\n\nAdriana Darkwill lachte während ihre Wachen nahe zu zeitgleich durch die fallenden Schwerter hingerichtet wurden, welche ohne Vorwarnung durch die Decke der Loge gefallen waren. Die Gladiatoren fielen nur Sekundenbruchteile später und auch Draven entging nur haarscharf dank seines langjährig trainierten Instinkts seinem eigenen Urteil.\nDie Tribünen, die vor kurzem noch dicht mit Noxiern gefüllt waren, waren zu einem Sammelplatz von noxischen Leichen geworden und in all diesem Chaos stand Gaia.\nIhr Verhalten war unerwartet gefeit. Das brennende Schild erlosch und erneuerte sich wie von Geisterhand.\nDraven verdachte, dass Gaia für dieses Phänomen verantwortlich war und befahl sie mit allen Mitteln niederzuschlagen. Mächtige Magier traten aus den Katakomben in die Arena hinauf, doch die Zauber, die sie vor kurzem noch fast besiegt hatten, prallten nun wirkungslos ab.\nDas Gaia nicht bewaffnet war und die Magier vermuteten, dass dieser Zauber sie stark erschöpft haben muss, fühlten sie sich in der Lage auch mächtigere Zauber zu kanalisieren.\nMit einer flüchtigen Handbewegung verwirbelte Gaia die durch die Kanalisationen kontrollierten Ströme magischer Energie und beendete somit sämtliche Versuche derartige Zauber zu nutzen.\nAdriana Darkwill trat von ihrer Loge herab und betrat die Arena: \"Herzlich Willkommen, Arc Sententia. ... Ich stehe hier im Namen von Arc Sanctus vor dir und heiße dich willkommen in dieser Welt.\" \"Ich danke dir und erbitte eine Audienz bei der deinen Herrin.\", erklärte Gaia, während Darven jegliches Gefühl davon verlor, was sich vor seinen Augen abspielte.\n\"Kein Problem ... Gaia? ... Es ist nur ein recht weiter Weg, denn noch befindet sie sich in der unseren alten Heimat.\", erklärte Adriana und erkündigte sich beiläufig nach dem Pseudonym der neuen Arcane. Gaia griff sich ihr Schild und trat in Richtung Ausgang: \"Der Weg ist es wert. Führe mich, ich habe mit ihr zu sprechen.\"\n\n___\n\n##Aussehen:\n - Gaia trägt ein rechteckiges, leicht zylindrisch gebogenes Großschild in ihrer linken Hand, welches keine Kampfspuren aufzeigt und klassische Symboliken des noxischen Militärs auf sich trägt.\n - Ihr Körper ist bedeckt durch ein Leinengewand über dem sie einen geschlossenen Brust- und Schulterpanzer trägt.\n - Sie trägt zudem einen geschlossenen Helm und metallische Handschuhe und Stiefel.\n\n___\n\n##Zitate:\n- Pick\n - Ich werde diese Schlacht nicht alleine schlagen\n- Bann\n - Es wird eine Zeit kommen in der ich gebraucht werde.\n- Taunt\n - Versuch doch mein Schild zu spalten.\n - An diesen Mauern wirst du fallen.\n - Das Urteil ist gefällt. ... Schuldig!\n- Joke\n - Das Gericht ist frei von Humor.\n - Dürfte ich ihre Aufmerksamkeit erhalten?\n- Bei Untätigkeit:\n - In der Ruhe liegt die Kraft\n - \"Tiefes Durchatmen\"\n - Wenn es doch immer so ruhig sein könnte.\n- Wenn eine Waffe \"stecken bleibt\"\n - Überrascht?\n - Das gehört jetzt mir.\n - Wenn du es nicht verlieren wolltest, warum wirfst du es dann weg?\n- Wenn alle Stacks der \"Adaptiven Defensive\" als Rüstung gelten:\n - Kein Schwert wird mehr dieses Schild spalten können.\n - Keine Pfeil wird mehr dieses Schild durchschlagen können.\n- Wenn alle Stacks der \"Adaptiven Defensive\" als MR gelten:\n - Kein Feuer wird mehr dieses Schild entzünden.\n - Kein Zauber wird mehr dieses Schild passieren.\n- Wenn \"Das jüngste Gericht\" keinen \"Schuldigen\" verurteilt:\n - Seht es als Warnung.\n - Ihr seid vom rechten Weg abgekommen, werdet euch dem bewusst, bevor ihr euch schuldig macht.\n- Wenn \"Das jüngste Gericht\" ein oder mehr \"Schuldige\" verurteilt:\n - Auf dass sie erlöst werden von ihrer Schuld.\n - So sollen sie gerichtet werden.\n- Bewegung (Mit dem Großschild):\n - Jeder Weg ist es wert gegangen zu werden.\n - Langsam aber stetig.\n- Bewegung (Ohne das Großschild):\n - So läuft es sich viel angenehmer.\n - Irgendwie fühle ich mich so schutzlos.\n - Wo habe ich mein Schild hingelegt?\n- Gegenüber {{champion:119}} \n - Für dich ist das Gefühl der Schwäche sicherlich ungewohnt.\n - Überheblichkeit wie deine sollte getilgt werden.\n - Ist stelle mich dir gerne immer und immer wieder in den Weg.\n- Gegenüber Soraya\n - Es ist mir eine Ehre.\n - Ich fühle mich geehrt.\n - Wir müssen sprechen.\n- Gegenüber {{champion:50}} \n - Ich behalte dich im Auge\n - Du trägst das Blut vieler Unschuldigen an deinem Mantel\n - Bedenke jeden Schritt den du tust. Jeder könnte dein Letzter sein und es wäre so schade jemanden so fähigen vor der Schlacht zu verlieren.\n- Beim Kauf von {{item:1054}} \n - Ganz schön zierliches Schild\n - Na für den Anfang muss das reichen.\n- Beim Kauf von {{item:3143}} \n - Das ist ein Schild, richtig?\n - Ist das ein gutes oder schlechtes Omen?\n- Beim Kauf von {{item:3193}} \n - Zwar nicht mein Stil, aber genau das was ich brauche.\n - Das wird mir dabei helfen, zu leisten, was ich leisten muss.\n- Wenn Guardian (als Rune von Gaia) durch Schaden an einem Verbündeten ausgelöst wird:\n - Hast du dich verletzt?\n - Ich hoffe das hat nicht zu sehr weh getan.\n - Mist, das ist durchgeschlagen.\n - Da war ich nicht schnell genug.\n\n___\n\n|Statistiken| Level 1 - | per Level - | Level 18\n|-\n|Mana\t\t|377\t|+ 43\t|1108\n|Mana Reg\t|6,0\t|+ 0,5\t|14,5\n|Leben\t\t|634|\t+ 98|\t2300\n|Leben Reg\t|5,5\t|+ 0,3|\t10,6\n|AD\t\t|63\t|+ 2,5|\t105,5\n|AS\t|\t0,521\t|* 0,03\t|0,787\n|Armor\t|\t32\t|+ 1,5\t|57,5\n|MR\t\t|32,1\t|+ 1,25|\t53,35\n|MS\t\t|300\n|Range\t|\t125\n\n___\n\n##Einstufung:\n - Schaden: 2/10\n - Durchhaltevermögen: 10/10\n - Kontrolle: 5/10\n - Mobilität: 2/10\n - Unterstützung: 5/10\n - Schwierigkeit: 2/10\n\n___\n\n##P1 – Adaptives Großschild\n - Gaias Rüstung und MR kann nicht durch Items, Runen und verbündete Buffs erhöht werden. Stattdessen wird 100/105/110/115% (Level: 1/6/11/16) jeglicher auf diesem Weg erworbenen Resistenzen als \"Adaptive Defensive\" für Gaias Fähigkeiten zugänglich gemacht.\n - Gaia verfügt über 5/4/3/2 Aufladungen von \"Anpassung\", die jeweils einen Gegenwert von 20/25/33,3/50% der \"Adaptiven Defensive\" darstellen. Zusätzlich verfügt jede Aufladung über einen Grundwert von 0,5/1,0/1,5/2,0/2,5/4,0/5,0/6,0/7,0/8,0/12,0/13,5/15,0/16,5/18,0/30,0/32,0/34,0 \"Adaptive Defensive\" (Skaliert mit Gaias Level)\n - Nimmt Gaia Schaden so erhöht sich die bei der Berechnung genutzte Resistenz um 20/25/33,3/50% und der Resistenz wird eine Aufladung \"Anpassung\" zugesprochen. Gleichzeitig wird (sofern bereits alle Aufladungen \"Anpassung\" vergeben waren) eine Aufladung \"Anpassung\" von der anderen Resistenz abgezogen und die Resistenz um ihren Gegenwert verringert. (Somit können nur maximal 5/4/3/2 Aufladungen auf einer Resistenz liegen und es sind zu fast jedem Zeitpunkt 5/4/3/2 Aufladungen von \"Anpassung\" vergeben.)\n\n##P2 – Stecken bleiben\n- Projektile, die nachdem sie Gaia getroffen haben, ihren Weg fortsetzen würden, tun das nicht.\n - Somit kann ein durchdringendes Projektil wie beispielsweise die Varus-Q Gaia nicht durchdringen. (Schaden wird ganz normal angerichtet)\n - Projektile, die zu ihrem Ursprung zurückkehren, tun dies ebenfalls nicht. (e.g. Darven-Äxte oder Gnar-Q)\n\n##Q\nKosten: 40 Mana auf allen Rängen\nAbklingzeit: 6/5/4/3/2 Sekunden (10 Sekunden stationär)\nReichweite: 125 IGU\n\n##Q1 – Schildschlag\n - Gaia führt ihren nächsten Normalen Angriff mit ihrem Schild aus und verursacht mit diesem 60/70/80/90/100% + 1% pro 25 \"Adaptive Defensive\" ihrer AD als physischen Schaden.\n - Der nächste Angriff des Ziels, der innerhalb von 3 Sekunden nach Gaias Schildschlag gegen Gaia gerichtet wird, verfehlt.\n - Diese Fähigkeit resettet Gaias Angriffstimer.\n - Ist das Ziel \"schuldig\", so wird dieser betäubt, sobald sein Angriff verfehlt. (Kann pro Ziel nur einmal alle 10 Sekunden ausgelöst werden.)\n - Wenn diese Fähigkeit maximiert wurde, wird das Verfehlen auch ausgelöst, wenn Gaia nicht das Ziel ist.\n\n##W\nKosten: 60/65/70/75/80 Mana + Das Großschild\nAbklingzeit: 20 Sekunden auf allen Rängen\nReichweite: 125 IGU (Ausrichtung hängt von Blickrichtung bei Nutzung ab.)\n\n##W1 Passive – Entlastung\n - Solange Gaia ihr Großschild nicht bei sich trägt, verringert sich der Wert ihrer \"Adaptiven Defensive\" um 25% und sie bekommt 50 Lauftempo.\n\n##W2 Aktive – Eiserner Widerstand\n - Gaia rammt ihr Großschild vor sich in den Boden und erschafft dabei eine Barriere  der Breite 300/375/450/525/600 IGU (gilt für Interaktionen als Terrain), welche nicht durch Dashes überwunden werden kann.\n - Gegnerische Projektile, deren Ziele sich hinter der Wand befinden, treffen stattdessen die Barriere. (Verursachen dementsprechend an der Barriere ihren Schaden)\n - Das Großschild bleibt solange an Ort und Stelle bis es zerstört wird oder Gaia es durch anklicken wieder einsammelt. (Gaia läuft beim Einsammeln zum Schild und heb es auf, wenn es in ihrer Angriffsreichweite ist)\n - Das Großschild verfügt über Gaias aktuelles Leben und die aktuellen Resistenzen zum Zeitpunkt der Nutzung dieser Fähigkeit. (Vor Eintritt der Passiven W1)\n - Diese Fähigkeit klingt nicht ab solange das Großschild noch platziert ist, wobei sich die Abklingzeit verdoppelt, sofern das Schild zerstört wird.\n  - Kehrt Gaia in die Base zurück, während es zerstört ist, so erhält sie das Großschild zurück und die verbleibende Abklingzeit dieser Fähigkeit wird halbiert.\n\n##E\nKosten: 60/65/70/75/80 Mana\nAbklingzeit: 20/18/16/14/12 Sekunden\nReichweite: 550 IGU Radial\n\n##E1 Passive – Keine Schwäche zeigen\n - Würde Gaia von einem Gegner kritisch getroffen werden (inkl. Fähigkeiten, die kritisch Treffen können), besteht eine 10/20/30/40/50% Chance, dass Gaia nicht kritisch getroffen wird.\n\n##E2 Aktive – Arcane Präsenz\n - Gaia bleibt kurz stehen um inne zu halten. Dabei geht eine Schockwelle von ihr aus, welche gegnerische Kanalisationen unterbricht und Folgeeffekte von gegnerischen Fähigkeiten (e.g. Die Spur des Corki-W) entfernt.\n - Trifft die Schockwelle einen Gegner, der gerade einer Zwangsbewegung untersteht oder dashed, so wird dieser nach Beendigung der Bewegung für 1/1,25/1,5/1,75/2 Sekunden betäubt.\n\n##R\nKosten: 100 Mana\nAbklingzeit: 180/150/120 Sekunden\nReichweite: 550 IGU bzw. 1200 IGU\n\n##R1 – Schuld\n - Jeder gegnerische Champion erhält einen Schadenscounter (Vgl. Steraks-Counter) der bis 1000/1500/2000 verursachten Schaden (vor der Verrechnung mit Resistenzen) abbilden kann.\n - Jeglicher Schaden der durch den jeweiligen Champion an gegnerischen Zielen (Also Verbündeten von Gaia) angerichtet wird, wird zu 50% mitgezählt, wobei der Counter in abfällt, wenn über mehr als 2 Sekunden kein Schaden verursacht wird. (Dies passiert in Schritten von 100/150/200 pro halbe Sekunde)\n - Wenn ein Champion mehr als die Hälfte des maximalen Werts des aktuellen Counters erreicht hat, wird er als \"schuldig\" markiert, wobei ein kleines, leuchtendes Schwert über ihm schwebt.\n\n##R2 – Das jüngste Gericht\n - Gaia errichtet um sich eine Zone mit Radius 500/550/600 IGU, welche durch ihren leuchtenden Rand erkennbar ist.\n - Alle gegnerischen Einheiten in der Zone werden beim Nutzen dieser Fähigkeit einmalig für 2 Sekunden um 70% verlangsamt.\n - \"Schuldige\" werden zudem zum selben Zeitpunkt für2 Sekunden gegrounded.\n - Nach 2 Sekunden erstrahlt der gesamte Zirkel und verursacht magischen Schaden in Höhe von 150/200/250% von Gaias \"Adaptiven Defensive\" an allen gegnerischen Einheiten, die sich in ihm befinden.\n - \"Schuldige\" erhalten stattdessen magischen Schaden in Höhe ihres Schadenscounters und ihr Schadenscounter wird zurück auf 0 gesetzt.\n\n___\n\n##Erläuterungen zur Spielweise\n - Mit Gaia spielen, heißt mit dem Team spielen. Man sollte sich beim Spiel mit Gaia immer darüber bewusst sein, dass es für den gegner nur einen sehr geringen Unterschied macht, ob sie das eigene Team vollständig töten oder ob Gaia überlebt, denn Gaia verfügt über keine relevanten Möglichkeiten Objekte zu contesten.\n - Dadurch, dass Gaia nur über sehr wenig Massenkontrolle und Schaden verfügt (vor allem abseits ihrer Ultimate) ist sie nur sehr eingeschränkt als Support spielbar.\n\n##Synergien mit Verbündeten\n - Gaia profitiert von Teamkompositionen, die neben ihr mindestens einen anderen Frontliner besitzen, welcher über ein hohes Durchhaltevermögen verfügt, denn ihre Ult nutzt angerichteten Schaden, der jedoch auch ein passendes Ziel bedarf.\n - Gaia profitiert durch ihren sehr geringen eigenen Schadens-Output davon, denn sie mit einem sehr effizienten Carry verbunden im Spiel ist.\n\n##Problematische Gegner\n - Gaia ist als einer der extremsten Tanks im Spiel, ein wahres Monster, sofern das gegnerische Team nicht über eine ausgeglichene Schadensverteilung verfügt. Aus diesem Grund bekommt sie mit Champions Probleme, deren Schaden sich an sie anpassen kann. (Kog'Maw, Kai'Sa, ...)\n - Auch wenn Gaia nicht wirklich über einen speziellen Conter verfügt, so sollte bedacht werden, dass eine Lane gegen sie ebenso mit nur sehr geringen Risiken verbunden ist. Skalierende Toplaner haben daher eine sehr angenehme Lane gegen sie, wodurch sie im späten Spiel deutlich gefährlicher sein können.\n\n\n##Empfohlene Items:\n{{item:3109}} {{item:3193}} {{item:3111}} {{item:3083}} {{item:3194}} {{item:3075}} \n___\n\n*Stand: 17.02.2020*\n\n___\n\n> ## Unser hauseigenes Wikipedia (lt. INoKami) aus meiner Feder\n[[Guide] Die Möglichkeiten des Konzept-Schreibers](https://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/jIFVA5Yo-guide-die-maglichkeiten-des-konzept-schreibers)\nWird regelmäßig aktualisiert.\n\n---\n\n> ## Die Arcana\nHierbei handelt es sich um ein Großprojekt von mir, welches ein Kollektiv von mehreren Konzepten darstellt, die ich im Laufe der Zeit veröffentlichen werden. Die Hintergrundgeschichten dieser Konzepte bilden eine gemeinsame Geschichte mit welcher ich einen besonderen Blick auf das von uns allen so geliebte Runeterra werfen möchte.\n\n>### * ? - Der Narr:  * * - * * I – Der Magier: * * - * * II – Die Hohe Priesterin: * * - * * III – Die Herrscherin: * * - * * IV – Der Herrscher: * * - * * V – Der Hierophant: * * Eigentlich wollte die kleine Ryona mit ihrer Schwester Soraya nicht diesen Weg gehen. Lange Vorbereitungen sollten dazu führen, dass die beiden zum Gefäß eines der mächtigsten Aspekte des Targon werden konnten, doch es sollte anders kommen … ganz anders. * * Hattest du schon immer die Phantasie mal ein Vasallen zu spielen oder den BlueBuff über die Karte zu navigieren? Dann mach dich gefasst auf Ryona, denn mit ihr ist nichts mehr unmöglich. [Ryona - Das arcane Medium](https://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/kpWhm8Pj-ryona-das-arcane-medium) * * - * * VI – Die Liebende: * * - * * VII – Der Wagen: * * - * * VIII – Die Gerechtigkeit: * * - * * IX – Der Erimit: * * - * * X – Das Rad des Schicksals: * * - * * XI – Die Kraft: * * Warum scheiterte Noxus an Ionia? Was hielt sie davon ab zu gewinnen, wo sie alle Mittel nutzten um den Sieg zu garantieren? Was hält ein Reich für das selbst der Tod keine entgültige Größe ist auf ein so zersplittertes Reich wie Ionia zu besiegen? Willhelm sollte mit einer ganzen Armee diese Frage lösen, doch was auch immer er herausfand: Nun ist er einer der beachtbarsten Antagonisten seiner nun ehemaligen Heimat. * * Wolltest du schon immer mal einen Gegner an die Wand donnern und von jedem Schlag wissen, dass er Knochen bricht? Dann ist Willhelm definitiv eine gute Wahl für dich. [Willhelm - Die einschüchternde Gewalt](https://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/iX27J8LR-willhelm-die-einschuchternde-gewalt) * * - * * XII – Der Gehängte: * * Der Tod ist in Runeterra eine Größe, der sehr viel Beachtung geschenkt wird. Ob es die Verkörperung des Todes Kindred ist oder das ganze Reich der Toten, dass sich südöstlich von Ionia befindet. Der Tod ist eine bedeutende Macht und Shikuro scheut sich nicht diese Macht zu nutzen. * * Wolltest du schon immer mal die Kontrolle über Leben und Tot haben? Dann lege dich in die Hände des wohl suizidalsten Champions, den dieses Forum je gesehen hat. [Shikuro - Der Necromantist](https://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/bYnPMNH5-shikuro-der-necromantist) * * - * * XIII – Der Tod: * *  Der Tod ist mächtig. Das weiß auch der Targon, doch wie mächtig der Tod wirklich ist versucht er um alles zu verbergen. Finstere Rituale im Herzen des Targon sollen die Rakkor stärken. Durch das Schicksal von Yamina werfen wir einen Blick auf die finstere Seite des so strahlenden Glaubens der Solari * * Wenn auch du dir denkst, dass der Tod der stärkste CC im Spiel ist, dann wird Yamina dir den Umgang mit ihm lehren. [Yamina - Die Rückkehr der Geopferten](https://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/T8arPwci-yamina-die-ruckkehr-der-geopferten) * * - * * XIV – Die Mäßigkeit: * * - * * XV – Der Teufel * * - * * XVI – Der Turm: * * Wie schön die Gesegnete Insel doch war … bevor sich alles änderte. Reika wird noch immer von den Folgen des abrupten Wandels verfolgt. Die ehemalige Erzieherin hat jedoch etwas, dass ihr neuen Mut gab. * * Hörst du auch ab und zu Stimmen aus dem Jenseits. Hängst du immer noch an denjenigen, die verblichen sind? Dann folge Reika auf ihrem Weg mit dem Geschenk des Todes umzugehen. [Reika - Die Witwe der vergessenen Lieder](https://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/ZjOaWId7-reika-die-witwe-der-vergessenen-lieder) * * - * * XVII – Der Stern: * * - * * XVIII – Der Mond: * * Ionia ist ein unglaublich heterogenes Reich. Gefühlt in jedem Ort gibt es eigene Traditionen, Lehren und Riten. Luna ging in diesem Reich ihren eigenen Weg. Nach ihrer Flucht aus Wuju lernte sie die Lehren des Schattenordens kennen und ist nun die perfekte Untergebene für jenen ganz eigenen Kleingeist. * * Dieser Champion ist nichts für Mondsüchtige, denn sie hüllt die Kluft in den silbrigen Schein des wandelbaren Mondes. [Luna - Die nächtliche Präsenz](https://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/aEYqLE31-luna-die-nachtliche-prasenz) * * - * * XIX – Die Sonne: * * - * * XX – Das Gericht: * * Bevor Jericho Swain die Macht in Noxus ergriff, waren Spiele bis zum Tod im Herzen des Reiches ein beliebtes Mittel zur Unterhaltung der Masse. Verurteilte Kriminelle und Gefangene von den Fronten der noxischen Expansion wurden in gewaltigen Amphitheatern durch blutige Kämpfe hingerichtet. Eine dieser als Gladiatoren bezeichneten Verurteilten ist die aus Shurima stammende Galerya Ianiva Moertis, die die Arena jedoch auf eine Art verlassen sollte, mit der selbst Draven nicht rechnete. [Gaia – Die legendäre Gladiatorin](https://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/pUqXxtbG-gaia-die-legendare-gladiatorin) * * - * * XXI – Die Welt: * * - * * XXII – Der Android: * * - * * XXIII – Die Gottheit: * * - * * XXIV – Die Zeit: * *  Wenn man in Zhaun lebt, und das „Glück“ hat für einen der Barone zu arbeiten, dann kann man schon recht gut überleben. Doch die Barone sind eingebildete, geldgierige Fanatiker und gieren nur nach allem was ihnen Geld und Macht verleiht. Temarie soll im Auftrag eines dieser Barone der Zeit auf die Spur kommen. * * Hast du Zeit? Und zwar sehr viel davon, denn Zeit ist Geld , oder im Fall von Temarie Mana. [Temarie - Die Kausalität](https://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/laJ45E1x-temarie-die-kausalitat) * * - * * XXV – Die Seele: * * - * * XXVI – Der Körper: * * - * * XXVII – Der Geist: * * Was würdest du machen, wenn du über mehr als ein Jahrzehnt gefesselt und geknebelt in einem Hochsicherheitsgefängnis lebst. Jegliche Kontakte sind die genommen und deine Sinne sind scheinbar kein Teil mehr von dir? Cyrus hatte genau dieses Leben, nachdem er für den Mord an einigen noxischen Soldaten verantwortlich gemacht wurde. Die Zeit hat ihn verändert … sehr verändert, denn aus dem hinterhältigen Kleinkriminellen, der mit mehr Glück als Verstand die noxische Invasion in Ionia überlebte, wurde eine alles verändernde Macht, die das Machtgleichgewicht Runeterras empfindlich stören wird. * * Wenn die Grenzen zwischen Realität und Phantasie verschwinden und unmögliches plötzlich greifbar nah ist, dann ist dieses „Wesen“ nicht mehr weit von dir entfernt. [Cyrus - Das Gefäß des Geistes](https://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/Mfx3YwtE-cyrus-das-gefas-des-geistes) * * - * * XXVIII – Die Aura: * * Was ist wahrlich schön und was lediglich Fassade. Wie kann man die Wirklichkeit von dem Schein unterscheiden. Veronica kennt die Antwort nicht, doch es ist ihr auch bedingt egal, denn sie lebt genau davon, dass die Grenzen der Realität verschwimmen können. Masken sind ihr Geschäft und ihr Leben und inzwischen ihre ganze Existenz.[Veronica – Die Maskenbauerin](https://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/iwBkvbA5-veronica-die-maskenbauerin) * * - * * XXIX – Der Schatten: * * - * * XXX – Die Existenz: * * - * * XXXI – Die Zahl: * * - * * XXXII – Der Name: *\n\n---\n\n> ## Weitere Champions aus meiner Feder:\n\n>### *In League gibt es sehr verschiedene Champions mit verschiedensten Funktionen, doch eine Klasse zeichnet sich durch eine vergleichsweise geringe Variation aus: Die Schützen. Aurora will mit ihrem Bild der Welt ein Zeichen setzen und ihrem Idol einen großen Schritt näher kommen, doch für welchen Preis? * * Behältst du immer einen ruhigen Kopf und verschwendest deine Angriffe nicht als seinen sie kostenfrei, dann öffnet dir mein Erstlingswerk die Augen auf eine neue Perspektive von League. [Aurora, die besessene Seelenschützin](https://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/huAWHvuz-aurora-die-besessene-seelenschatzin) * * - * * Jedes Spiel in League verursacht immensen Schaden. Türme werden zerstört, Vasallen schwer verletzt und auch die Champions erfahren immensen Schaden. Um die Reparatur der Kluft und die Umsetzung von bedingter Vorhersehbarkeit kümmert sich das Personal der Kluft. * * Interessierst du dich für einen Blick hinter die Kulissen der Kluft, dann ist dieser Rentner genau das richtige für dich. [Oblivion - Der Aufseher](https://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/iywAsVUE-oblivion-der-aufseher) * * - * * Manchmal hat man Pech und manchmal kommt es noch schlimmer. Pandora hat in Sachen Pech wohl das große Los gezogen und hat sich neben der Leere auch noch einen Darkin angelacht. * * Wenn dich ihr Pech nicht zu sehr abschreckt, dann ist das Unglückspärchen genau das Richtige für dich. [Pandora &amp; Nava'aiya - Die gefährliche Schönheit](https://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/uQvOtFjO-pandora-navaaiya-die-gefaahrliche-schanheit) * * - * * Was wäre, wenn du von dem einen zum anderen Moment aus dem Gedächtnis der Welt verschwinden würdest. Niemand könnte sich an dich erinnern und niemand wird es jemals wieder tun. Viele Leute würden kriminell werden, doch Loreen wurde ein anderer Weg geöffnet. Der Weg der Regentschaft. * * Was würdest du tun, wenn niemand sich an dich erinnert? [Loreen Organon - Die noxische Intrigantin](https://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/n35is2bO-loreen-organon-die-noxianische-intrigantin) *\n\n---\n\n> ## Champions die in Kooperation entstanden:\n\n>### * Im Laufe der Jahre in denen Riot Games unsere geliebten Champions hegt und pflegt sind leider auch viele kleinere Mechaniken verloren gegangen. Fand ist hierbei ein Konzept dessen zentrale Idee das Wiedereinbetten dieser Mechaniken ist. * * Ich entschuldige mich vielmals für die fehlende Formatierung [Fand - Die helfende Hand](https://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/tpRyyHek-champion-idee-fand-die-helfende-hand) * * - * * Wir alle wissen, dass in Bandle die wohl findigsten Wesen des Universums von League leben. Dexter ist jedoch selbst unter ihnen noch einmal ein ausgezeichnet findiger Yordle, der nicht nur mit den eigenen Waffen kämpfen kann. * * Wenn du Spaß daran hast dich mit den Mitteln anderer zu beweisen, wird dir dieser kleine Kleptomane definitiv gefallen. [Dexter - Der Trickser](https://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/O3spGGmO-dexter-der-trickser) * * - * * Piltover und Zhaun befinden sich in einem äußerst instabilen Gleichgewicht, dass nur so von der gegenseitigen Abhängigkeit durchwoben ist. Was würde wohl passieren, wenn man dieses Gleichgewicht ins wanken bringt? Finde es mit diesem gewaltigen Kollektiv von 5 Champions heraus und bringe mit deinen Freunden auch das Gleichgewicht der Kluft zum wanken. [Zhaun's Unheilverkünder](https://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/EW9zR9QM-champion-konzept-zhauns-unheilverkander-ft-amycos-cyrus-lunaaa)*\n\nZu allerletzt wäre ich über Rückmeldungen froh, daher hier eine kleine Umfrage und die Kommentar-Sektion.\n\nMan sieht sich in den Kommentaren dieses und vieler anderer Champions hier im Forum.","replies":[{"poster":"Amycos Cyrus","date":"2020-02-27T20:42:28.449+0000","up_votes":1,"down_votes":0,"body":"Schon drei Leute, die zu feige sind zu kommentieren.\n{{sticker:zombie-brand-facepalm}} ","replies":[{"poster":"INoKami","date":"2020-02-28T16:46:19.434+0000","up_votes":1,"down_votes":0,"body":"Willst du mir etwa eine Persönlichkeitsstörung unterstellen?\n{{sticker:poppy-wink}} {{sticker:vlad-salute}} {{sticker:sg-miss-fortune}} \n\nAch, verdammt, jetzt kommt´s raus...","replies":[{"poster":"Amycos Cyrus","date":"2020-02-28T17:07:02.493+0000","up_votes":1,"down_votes":0,"body":"Nein. Ich suche noch die anderen zwei Feiglinge, denn ich selbst war der Erste. XD\n\nAus der Umfrage geht aber eindeutig hervor, dass 3 Leute \"Ja, mit Anpassungen\" gewählt haben und ich bezweifel, dass du einer von ihnen bist, denn du hättest sicherlich auch deine Kritik als Kommentar hinterlassen.","replies":[{"poster":"INoKami","date":"2020-02-28T17:19:47.431+0000","up_votes":1,"down_votes":0,"body":"Umfragen beantworte ich grundsätzlich nie.\n\nUnd mit Bewertungen ist momentan schwierig, weil ich kaum noch Zeit finde (in der ich dann auch Lust habe, weil so eine Bewertung dauert auch eine Weile), meistens will ich mich einfach von der Ausbildung erholen, wenn ich nach Hause komme oder muss halt noch lernen. Und jetzt kommen noch bald Wochenendproben vom Theaterprojekt hinzu, ist echt nicht schön momentan...","replies":[{"poster":"Amycos Cyrus","date":"2020-02-28T18:54:28.768+0000","up_votes":1,"down_votes":0,"body":"Alles gut.\n{{sticker:sg-jinx}}","replies":[]}]}]}]}]}]}