{"poster":"iEnVyGreens","date":"2018-05-03T03:14:40.003+0000","title":"Please tell me your thoughts whether I deserve the permanent ban.","subforum":"Player Behavior","up_votes":1,"down_votes":2,"body":"The following Games are insanely immature, and I'm sorry if you do not understand my english as it is not my first language.\n\nReasons why I dont get the ban:\n\n1. I didn&#039;t talk or relate anything about sucide, or sucidal thoughts\n2. I didn&#039;t discriminate or show signs of racism.\n3. I didn&#039;t relate my allies, and enemies about personal issues, like disease which is something not to joke about.\n4. I didn&#039;t curse, words like &quot;fuck u&quot;.\n5. I didn&#039;t afk, and tried my best in very single match whether the outcome was a victory or a loss.\n\n\nNow, I would be going the 3 Games that made my account a permanent ban. Before that, I&#039;m totally fine and I respect you opinions, if you would think that I was actually toxic during the games, because we all have different opinions\n\nNow, I would like to take sometime discussing about the Games, being honest the games were all played by me and I take full responsibility for what happend..\n\nI&#039;m just copying pasting most of this, from the ticket I have send to Riot.\n\nGame 1\niEnVyGreens: cant seriously belive no one dodged\niEnVyGreens: let them take it\niEnVyGreens: wow\niEnVyGreens: lol\niEnVyGreens: cool tactics yi\niEnVyGreens: no red :=(\niEnVyGreens: wow\niEnVyGreens: wow\niEnVyGreens: wow\niEnVyGreens: this adc\niEnVyGreens: we lose\niEnVyGreens: we try\niEnVyGreens: but idk atm\niEnVyGreens: good joke\niEnVyGreens: wat an ult\niEnVyGreens: this is bronze\niEnVyGreens: anything can happen\niEnVyGreens: like this\niEnVyGreens: idk\niEnVyGreens: wow\niEnVyGreens: wow\niEnVyGreens: WOW\niEnVyGreens: this kat\niEnVyGreens: nope im not\niEnVyGreens: dude\niEnVyGreens: u have the dagge\niEnVyGreens: so u should have e the dagger and come back again while taking some dmg\niEnVyGreens: u guys are good\niEnVyGreens: just need more practice\niEnVyGreens: idc\niEnVyGreens: u will end up losing if u dont listen to ur teammates\niEnVyGreens: wow\niEnVyGreens: seriously\niEnVyGreens: that was a good ult\niEnVyGreens: ?\niEnVyGreens: assisted u :D\niEnVyGreens: did i do anything?\niEnVyGreens: for?\niEnVyGreens: ??\niEnVyGreens: lol\niEnVyGreens: no reason and reporting\niEnVyGreens: cool\niEnVyGreens: help me !! this team thinks im a troll\niEnVyGreens: yi in the bush\niEnVyGreens: why would u trade for a teemo with 121 cs?\niEnVyGreens: u all are trolls\niEnVyGreens: good job trolls\niEnVyGreens: help me this team is trolling\niEnVyGreens: ??\niEnVyGreens: yi troll?\niEnVyGreens: gg yi troll\niEnVyGreens: cant even play the easiest champ in the game ROFL\niEnVyGreens: worst mallphite\niEnVyGreens: ye\niEnVyGreens: easiest champ in the game\niEnVyGreens: do u even get that\niEnVyGreens: yi is like 0 mechanics\niEnVyGreens: just spam q\niEnVyGreens: ok\niEnVyGreens: kat trolling\niEnVyGreens: u guys cant even respect me im doing so good\niEnVyGreens: oops\niEnVyGreens: misclickeed\niEnVyGreens: gg\niEnVyGreens: wow\niEnVyGreens: ..\niEnVyGreens: teemo so fed\niEnVyGreens: gg\niEnVyGreens: free kill\niEnVyGreens: love this yi\niEnVyGreens: this yi is soo good\niEnVyGreens: STAY IN BASE\niEnVyGreens: WOW\niEnVyGreens: STAY IN BAS\niEnVyGreens: ok\niEnVyGreens: im dead\niEnVyGreens: means we lost\niEnVyGreens: cause this team cant do anything without me lol\niEnVyGreens: gg\niEnVyGreens: u guys are rly good\n\nGame 1: Cassiopeia (Support) 4-7-9\n\nThis wasn&#039;t a troll! I wanted to play support morgana, but it got banned, lol ofc it was a bad idea to play support as I could only play morgana and blitzcranck, (in fact both of them got banned) but I was bored playing top, as even if I do my best and have a decent score, my bot lane most likely feeds my other adc, and we lose late game. So, I took this time to see how i feels like to play support. I could have picked Alistar, or Soraka but I wasn&#039;t good with it, so I picked a Cassiopeia as her ult could be useful in teamplays. Now in the start, I said &quot;can&#039;t belive no one dodged&quot;, and I was just joking with this because many people think that Cassiopeia cant support. The first few mins I have bringing a positive environment, showing emojis... but time came when I got annoyed with this adc. He wasnt doing anything I liked, missing lots of cs.. not doing any poke damage and waiting for the jungler to gank for mins. I died once or twice, and I said this adc (I didnt mean anything bad or good), just to show him that I was annoyed. I not I shouldn&#039;t be annoyed, but I&#039;m a human being too, and at times I can&#039;t control my feelings. I was probably very tilted through the whole game, as I played the match after playing with my friends who played so bad and threw the whole game. Moreover, I wasnt toxic, I was just annoyed, then I started showinga little bit of negativity saying stuff like we lose, we try. By saying this, I meant that with the team comp and even if we put effort, its almost impossible to win, by seeing the scorecard. But, then I did a brilliant ult, followed by a double kill. I got my form and mood back, and said &quot;this is bronze, so anything thing can happen&quot;. I say this, because all my coaches and everyone who plays the game knows that beng in bronze is like a hell! and anything could happen.. But then after that brilliant play, our adc said something like &quot;are u trolling, taking kills intentionally&quot;, and I got so pissed. This adc doing nothing, and me doing something do contribute and they not even being thankful for me trying so hard to get back in the game. They tilted me, and then I said &quot;this kat&#039;, which was again doing something stupid and throwing the game. I said &quot;this kat&quot; to our katarina, again not meaning what I said meant anything bad or good, but I was just annoyed, and I dont get it, I&#039;m not toxic, I&#039;m not griefing. And I also spammed wow when I died, for a several times, because the enemy team played good. Let me remind tha the whole text isnt made up, but it might slightly be a bit off as I dont remember everything about the game that happend, but I&#039;m for sure not making things up. You could also check the Chat for this game. Then I gave katarina some tips about the dagger and stuff, and aftr that once again I gave a positive environment saying &quot;You Guys are good, and just need more practice&quot; because that was what I thought. Then the team said that they are going to report me because I&#039;m a troll, and they also said that we shouldn&#039;t say the enemy team we have a troll in here. And, the moment I saw the message I was like wtf. I did a brilliant ult, I&#039;m assisting you guys to help the team. So sure, if you think I&#039;m trolling, why dont I troll. Simple as that. I didnt troll, I just took some jungle camps for my own need, and gold. And if they say I&#039;m trolling, I talk back them saying you guys are trolls too, and thats what happend. I couldn&#039;t keep my calm, I was giving tips, to improve as a team, no one listens, and my team goes split pushing when we dont even have a turret to defend the nexus.\n\nGame 2\niEnVyGreens: lag\niEnVyGreens: cmoon olaf\niEnVyGreens: wow\niEnVyGreens: wow\niEnVyGreens: WOW\niEnVyGreens: HOW CAN U NOT GET THAT?\niEnVyGreens: get out of my lane\niEnVyGreens: this olaf sucks\niEnVyGreens: u have a 0% win rate olaf\niEnVyGreens: 0\niEnVyGreens: wp\niEnVyGreens: no\niEnVyGreens: this jg troll\niEnVyGreens: wow\niEnVyGreens: morgana is rocking\niEnVyGreens: salute u\niEnVyGreens: p\niEnVyGreens: do u know\niEnVyGreens: this olaf has a 0% win rate ?\niEnVyGreens: i dont need ur help\niEnVyGreens: olaf\niEnVyGreens: olaf troll\niEnVyGreens: wait wo\niEnVyGreens: wow\niEnVyGreens: wow\niEnVyGreens: wow\niEnVyGreens: olaf troll\niEnVyGreens: gg olaf troll\niEnVyGreens: lol\niEnVyGreens: i agree\niEnVyGreens: not bad\niEnVyGreens: but u still area abig noob\niEnVyGreens: aaah\niEnVyGreens: wtf\niEnVyGreens: great play\niEnVyGreens: wat a sacrifice\niEnVyGreens: plz\niEnVyGreens: get that\niEnVyGreens: and we win\niEnVyGreens: yes gj\niEnVyGreens: trapped lmao\niEnVyGreens: gg this team cant do nothing without me\niEnVyGreens: BARON?\niEnVyGreens: olaf wtf u doing\niEnVyGreens: hes trolling\niEnVyGreens: olaf trolling\niEnVyGreens: plz report ola\niEnVyGreens: olaf\niEnVyGreens: report olaf\niEnVyGreens: can u all do me a favor?\niEnVyGreens: report olaf\niEnVyGreens: LOL\niEnVyGreens: IM A SAVAGE\niEnVyGreens: good job galio\niEnVyGreens: wow\niEnVyGreens: gg\niEnVyGreens: report jg and ashe\niEnVyGreens: and galio\niEnVyGreens: the whole team except nami\niEnVyGreens: wow wp\niEnVyGreens: nice ult\niEnVyGreens: im literally done with this team\niEnVyGreens: full of trolls\niEnVyGreens: wanna duo cass?\niEnVyGreens: ok\niEnVyGreens: gg\niEnVyGreens: done with this team\n\nGame 2: Yorick (Top) 15-9-7\n\nI got pissed this game, everyone performed terribly, which I do not mind because there are people who are not good at the game, but I got pissed and started saying report olaf for a couple of times, because our jungler Olaf was throwing the game. Early Game, our jungler who was Olaf came to my lane taking a lot of cs, and he only ganked to ks. First I pinged him to fall back, but then he didnt listen so I wrote in CAPS to &quot;get out of my lane&quot;, and I think I deserve to say this after he had been ruining the lane. I dont exactly remember what he said, but he also verbal abused me saying &quot;fk u&quot;, and stuff. Seriously, I didnt even make a single verbal abuse statement and I get banned, while he was saying &quot;fk u&quot; to me and him getting away with it. I kept saying Olaf, I dont need your help, but then he kept doing the same thing again and there was nothing I could do. So, I let my team know that olaf is a troll. I ignored him for sometime and I kept going forward, but then again Olaf started trolling, intentionally not showing up for baron. I just kept spamming with report olaf and ashe, as she was also giving up and giving kills to the opponent team. I said that galio was a troll too, but I take my words back as he tried hes best, and later made no longer negative comments about him. I also cheered nami, as she was playing impressive and trying her best at the curret situtaion. I ended up the game with GG, and &quot;I&#039;m done with this team&quot;, because I really was! You could also check the Chat for this game, as Olaf was verbal abusing but I later forgot to report him.\n\n\nGame 3\niEnVyGreens: it was bad\niEnVyGreens: shyvana go jungle\niEnVyGreens: i said\niEnVyGreens: only come\niEnVyGreens: when i ping u\niEnVyGreens: i dont want u to take my farm\niEnVyGreens: why ks?\niEnVyGreens: ok\niEnVyGreens: dude\niEnVyGreens: u are not funny\niEnVyGreens: i agree\niEnVyGreens: i saved u\niEnVyGreens: so plz shut up\niEnVyGreens: lol\niEnVyGreens: ill go afk when shyv spits one more word\niEnVyGreens: ok\niEnVyGreens: im done\niEnVyGreens: im gonna do nothing\niEnVyGreens: sure\niEnVyGreens: im doing everything i can\niEnVyGreens: dont make me tilt\niEnVyGreens: dude\niEnVyGreens: whats ur problem\niEnVyGreens: wat\niEnVyGreens: who?\niEnVyGreens: wow\niEnVyGreens: now im getting tilted\niEnVyGreens: bec of shvana\niEnVyGreens: and how am i toixc?\niEnVyGreens: toxic?\niEnVyGreens: how ?\niEnVyGreens: how?\niEnVyGreens: tell me\niEnVyGreens: rn\niEnVyGreens: has nothing to say\niEnVyGreens: lol\niEnVyGreens: but how am i toxic?\niEnVyGreens: alistar and mf am i toxic?\niEnVyGreens: and darius?\niEnVyGreens: ur so childish\niEnVyGreens: we tried\niEnVyGreens: shes so childish\niEnVyGreens: or he\niEnVyGreens: how are u even not banned?\niEnVyGreens: im literally good\niEnVyGreens: i said nothing\niEnVyGreens: dude\niEnVyGreens: this shyvana is so toxic\niEnVyGreens: plz report her\niEnVyGreens: yup plz\niEnVyGreens: report her\niEnVyGreens: so immature\niEnVyGreens: tilting me\niEnVyGreens: good ks\niEnVyGreens: oops\niEnVyGreens: lol\niEnVyGreens: gg\niEnVyGreens: obviously\niEnVyGreens: u did no dmg input\niEnVyGreens: no but a jungler role is to assist\niEnVyGreens: yep it is\niEnVyGreens: ur still bronze so i dont except u to know but\niEnVyGreens: yep\niEnVyGreens: im never lol\niEnVyGreens: shyvana tilts me as fuck\niEnVyGreens: nice job killing her\niEnVyGreens: ya ask poo\niEnVyGreens: or anyone\niEnVyGreens: y teleport?\niEnVyGreens: thats after u became toxic\niEnVyGreens: lol\niEnVyGreens: im just tilted\niEnVyGreens: oops\niEnVyGreens: lol\niEnVyGreens: gg\niEnVyGreens: ggwp\niEnVyGreens: thats toxic\n\nGame 3: 4-9-7 (Mid) Lissandra\n\nI honestly have no clue why this is in there. I wasn&#039;t toxic, but instead had a really toxic jungler in our team. Just like Game 2 he kept coming in my lane and took all my cs. I kindly told him to go jungle, and told him to only come when i ping for help, but he didnt listen. I kept my cool for times, even though he started being toxic. I saved him in multiple teamfights, and told him a couple of times he isnt acting funny, instead just griefing and being annoying. You could aslo check the Chat for this game, and I&#039;m sure that he was showing the double of toxicity compared to me. I reported him at the end of the game, but I didnt get a feedback report meaning he wasnt given a warning or ban. I&#039;m so confused as I did nothing wrong in this game. You could even check the chat and tell me what I did wrong. He was acting so immature and childish, so I told him that I&#039;ll leave the game if he doesnt stop the toxicness, because why would I want to play with a person who keeps on annoying me even though I&#039;m helping and contributing the team. She tilted me a lot, so I decided to mute her for sometime, and I decided to be a little bit annoying too. I have emotions too. I get mad. I was mad, so I cheered the enemy team for only once, compared to her saying shit to me ten times! and it was because I simply hated that particular Shyvana!\n\nThanks for taking the time to read every single thing I wrote, as I wrote them with effort. I&#039;m not saying that I&#039;m not guilty for anything, or I am completely right, as there were times I could improve my attitude. If you disagree with me, that is totally acceptable as I&#039;m in no place to decided all about this. If I was toxic, I&#039;m very sorry from the bottom of my heart, that I have been ruining all of these recently games\n\n\nPlease Let Me Know! If i do deserve the perm ban or not. I do accept that my previous suspensions were well deserved, but I&#039;m not sure about this one.","replies":[{"poster":"Scary Door","date":"2018-05-03T19:14:05.991+0000","up_votes":1,"down_votes":0,"body":"Not even a question in anyone's mind, ban 100% deserved\n\n/thread","replies":[{"poster":"iEnVyGreens","date":"2018-05-04T00:03:10.869+0000","up_votes":1,"down_votes":0,"body":"May I please know why I deserve it, instead of saying words like 100%.","replies":[{"poster":"Scary Door","date":"2018-05-04T19:30:28.663+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=iEnVyGreens,realm=NA,application-id=ZGEFLEUQ,discussion-id=gHzsoUP7,comment-id=00050000,timestamp=2018-05-04T00:03:10.869+0000)\n>\n> May I please know why I deserve it, instead of saying words like 100%.\n\n*Sigh* ... Very well, here we go.  \n\nYou have a negative attitude, examples:  \n\n>iEnVyGreens: why ks?\n\nI didn't even know people said \"KS\" anymore, but apparently there's still this idea that kills belong to people despite the fact that this is a team game.  Moving on...\n\n>iEnVyGreens: so plz shut up\n\nAbusing teammates\n\n>iEnVyGreens: ill go afk when shyv spits one more word\n>iEnVyGreens: ok\n>iEnVyGreens: im done\n>iEnVyGreens: im gonna do nothing\n\nHere you're threatening to AFK.\n\n>iEnVyGreens: and how am i toixc?\niEnVyGreens: toxic?\niEnVyGreens: how ?\niEnVyGreens: how?\niEnVyGreens: tell me\niEnVyGreens: rn\niEnVyGreens: has nothing to say\niEnVyGreens: lol\niEnVyGreens: but how am i toxic?\niEnVyGreens: alistar and mf am i toxic?\niEnVyGreens: and darius?\niEnVyGreens: ur so childish\n\nArguing instead of playing... \n\n>iEnVyGreens: plz report her\niEnVyGreens: yup plz\niEnVyGreens: report her\n\nCalling for reports against other players... \n\n- - - - - - \n\nI mean, I could go on but you get the idea.  The number one question anyone should ask themselves when deciding if a punishment was deserved or not is:  *Would I want to play a game with this person?*, In your case the answer is an obvious NO.  \n\nAnother irony (of many) I found in your chat log...\n\n>iEnVyGreens: ur still bronze so i dont except u to know but\n\nThe pot calling the kettle black here.  If you're B5 with a 39% winrate who averages more deaths than kills on carries, less than 4 cs/minute ... I wouldn't criticize anyone else, ever.  Just a bit of wisdom I thought I would offer you there.\n\nIn any event, ban deserved and now, officially...\n\n/thread","replies":[{"poster":"iEnVyGreens","date":"2018-05-05T00:34:48.536+0000","up_votes":1,"down_votes":0,"body":"Dude, we already had a shyvana who was toxic from the beginning, she literally told me to go afk, she told me that I'm an unless person, I should go fuck off, and shit like that. Seriously I can't even handle it anymore.","replies":[{"poster":"Scary Door","date":"2018-05-05T05:28:20.778+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=iEnVyGreens,realm=NA,application-id=ZGEFLEUQ,discussion-id=gHzsoUP7,comment-id=0005000000000000,timestamp=2018-05-05T00:34:48.536+0000)\n>\n> Dude, we already had a shyvana who was toxic from the beginning, she literally told me to go afk, she told me that I&#x27;m an unless person, I should go fuck off, and shit like that. Seriously I can&#x27;t even handle it anymore.\n\nand?  what's your point?  \n\nWhy respond to her, then?  Just because someone is toxic to you in game doesn't mean you need to say anything in return.","replies":[]}]}]}]}]},{"poster":"Arammus","date":"2018-05-03T04:10:54.832+0000","up_votes":3,"down_votes":1,"body":"yes you deserve it. all i read were the chatlogs of game 2.\nconstant harass on olaf. \n\nif you had a 14 day ban before, the game told you every small misbehavior will lead to a permaban.","replies":[{"poster":"iEnVyGreens","date":"2018-05-03T04:14:14.051+0000","up_votes":1,"down_votes":1,"body":"Sure I do, but as mentioned Olaf was verbally abusing me saying words like \"fuck u\".\n \nI mean its my fault for being a bit rude to him, but I'm just talking back to him. Furthermore, what is wrong saying troll to someone who is actually trolling (he took almost all the cs from 0 to 10 mins)","replies":[{"poster":"Arammus","date":"2018-05-03T04:16:49.347+0000","up_votes":3,"down_votes":1,"body":"the behavior of someone else doesnt justify your own.\nmute and report him.\nif you fight fire with fire, that wont work out","replies":[{"poster":"iEnVyGreens","date":"2018-05-03T04:18:48.947+0000","up_votes":1,"down_votes":0,"body":"Well, I completely agree, but I didn't seriously verbal abuse him. I just let my teammates know he's trolling so we do not except an outcome from him. I seriously also said \"report him\" a couple of times.","replies":[{"poster":"Arammus","date":"2018-05-03T05:10:55.513+0000","up_votes":1,"down_votes":0,"body":"i totally understand you. but theres kinda no point besides your own punishement. sry that i cant help you :x","replies":[]},{"poster":"Mafia LeBlanc","date":"2018-05-03T04:27:18.808+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=iEnVyGreens,realm=NA,application-id=ZGEFLEUQ,discussion-id=gHzsoUP7,comment-id=0002000000000000,timestamp=2018-05-03T04:18:48.947+0000)\n>\n> Well, I completely agree, but I didn&#x27;t seriously verbal abuse him. I just let my teammates know he&#x27;s trolling so we do not except an outcome from him. I seriously also said &quot;report him&quot; a couple of times.\n\nThe point is nothing that you did was conducive with winning.  And that is why you got reported.  In fact, it makes winning a lot more difficult when two teammates act like an ass in chat, wasting time typing, tilting their teammates, when one person could just be the bigger man, stfu, and press mute.\n\nBut, you chose to engage people in stupid ridiculous banter with a person that you will never see or speak to ever again, rather than helping your teammates, or CSing, or securing objectives.\n\nWhen a teammate acts and types even half as much as you do, that's pretty much an automatic loss because that person is basically brain-afk and affects others with his crappy attitude.\n\nYou know what you did and your chat logs show it over and over.  If you still fail to see why your behavior was deserving of punishment, after receiveing countless warnings, then nobody can help you.","replies":[{"poster":"iEnVyGreens","date":"2018-05-03T04:31:29.080+0000","up_votes":1,"down_votes":0,"body":"Ok, lol my bad for wasting so much time but everyone already knew we lost the game.","replies":[]}]}]}]}]}]},{"poster":"Accursêd","date":"2018-05-03T06:14:23.986+0000","up_votes":2,"down_votes":1,"body":"If anything a chat ban, personally I wouldn’t punish at all... the worst thing you said was that someone was childish lmao","replies":[{"poster":"iEnVyGreens","date":"2018-05-03T06:28:16.145+0000","up_votes":1,"down_votes":0,"body":"Lmao, I couldn't think of any words to describe her. :-/\n","replies":[]}]},{"poster":"Mafia LeBlanc","date":"2018-05-03T03:38:51.893+0000","up_votes":2,"down_votes":1,"body":"Are you for real?","replies":[{"poster":"iEnVyGreens","date":"2018-05-03T03:59:06.629+0000","up_votes":1,"down_votes":1,"body":"Yes, I'm for real, if you have some clear problems, then please note all of them right here.","replies":[{"poster":"Mafia LeBlanc","date":"2018-05-03T04:05:08.079+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=iEnVyGreens,realm=NA,application-id=ZGEFLEUQ,discussion-id=gHzsoUP7,comment-id=00000000,timestamp=2018-05-03T03:59:06.629+0000)\n>\n> Yes, I&#x27;m for real, if you have some clear problems, then please note all of them right here.\n\nBut you already did such a good job of that.\n\nHave a good evening :)","replies":[]}]}]},{"poster":"WetLettuce69","date":"2018-05-03T03:42:43.935+0000","up_votes":1,"down_votes":5,"body":"dis man is joking rit? Lol look at my post about my permanent ban that is a valid excuse for not having to be permanently banned this is you just blatantly insulting other players.","replies":[{"poster":"iEnVyGreens","date":"2018-05-03T03:57:25.360+0000","up_votes":2,"down_votes":1,"body":"By leaving a response like that, it clearly shows you are a foolish person. As I said, I'm open to any response, but you being injudicious, and only caring about yourself, is clearly immature. If you want to advertise your \"thing\" please do not bother even leaving a response over here. And how am I insulting other players, when they are the ones verbal abusing me.","replies":[{"poster":"breakordoom444","date":"2018-05-05T05:38:52.556+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=iEnVyGreens,realm=NA,application-id=ZGEFLEUQ,discussion-id=gHzsoUP7,comment-id=00010000,timestamp=2018-05-03T03:57:25.360+0000)\n>\n> By leaving a response like that, it clearly shows you are a foolish person. As I said, I&#x27;m open to any response, but you being injudicious, and only caring about yourself, is clearly immature. If you want to advertise your &quot;thing&quot; please do not bother even leaving a response over here. And how am I insulting other players, when they are the ones verbal abusing me.\n\ni understand your situation, but with riots rules, and grade school teaching, nothing justifies you flaming.","replies":[]}]}]},{"poster":"Sir Prepuzius","date":"2018-05-03T06:52:15.797+0000","up_votes":1,"down_votes":0,"body":"dude.. there is really need to ask.. practically 9 lines out of 10 are harassments.. and the remaining line is you being just annoying \nso, yes, you are toxic as shite\ntry to grow up a little?","replies":[{"poster":"iEnVyGreens","date":"2018-05-03T08:06:33.510+0000","up_votes":1,"down_votes":0,"body":"I agree I'm kinda immature and need to grow up a little bit. But yea, there are other people out there who deserve a ban as much as I do.","replies":[{"poster":"Sir Prepuzius","date":"2018-05-03T08:15:16.661+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=iEnVyGreens,realm=NA,application-id=ZGEFLEUQ,discussion-id=gHzsoUP7,comment-id=00040000,timestamp=2018-05-03T08:06:33.510+0000)\n>\n> I agree I&#x27;m kinda immature and need to grow up a little bit. But yea, there are other people out there who deserve a ban as much as I do.\n\n\ni swear, you guys who get banned always say that\n\"other ppl need ban more than me, why they don't get banned etc etc\"\n\nwhat's your point, really?\nit's all conspiracy against you, the system targets only you and avoid punishing other toxic players?\n\nand, how do you know ppl deserving a ban more than you don't get punished?","replies":[{"poster":"iEnVyGreens","date":"2018-05-03T09:04:02.763+0000","up_votes":1,"down_votes":0,"body":"Well, so let's take a situation where we have a stranger and you. \n\nNow if that stranger would verbally abuse you, and you don't like it. The moment he spits a word which gets you extremely pissed, you would obviously take some action whether it is physical or verbal, and wouldn't obviously stand there whining your butts off. And that action I took in Game 2, and 3 made me get reported. Who wouldn't be mad at a person who trolls, ruins your game and says a \"fk u\". \n\nI need to play 3-4 games to have fun in one.\n\nEveryone has emotions \nHave a Good Day Sir.","replies":[]}]}]}]}]}