{"poster":"OzPin0y","date":"2015-01-12T01:00:45.688+0000","title":"Where is Working Download Link?","subforum":"Help & Support (OCE)","up_votes":1,"down_votes":0,"body":"Hi, Guys.\r\n\r\nWhere can I find a working official download link for league? I tried downloading from OCE, NA websites and they are all broken links.\r\n\r\nToday, I wanted to play some league but it kept telling me of RADS error and to check my firewall etc... but the thing is my internet IS WORKING.. I know this because, instead played dota 2. After each dota 2 game,  I would then try to launch, the lol client.. and still gets RADS error..\r\n\r\nSo, I uninstalled the game so I can re-install it. But the problem is none of the 2 sites I went to had a working link.","replies":[{"poster":"rxdicalaliviyaah","date":"2015-01-14T06:43:59.738+0000","up_votes":1,"down_votes":0,"body":"Hi, just yesterday I had this problem too (: \nI work on a Macbook, but short story: I could never get past the LoL Logo into the actual LoL client. \nI also have high-quality internet, but my carrier is TPG and it seems a lot of people using TPG are having problems... \nAt that time, I was unable to redownload the League file too, as seems the case of most people with this bug. \n\nMy solution was changing my DNS, and I'm wondering if you'd like to try this out because after that I'm both playing and I'm able to download. \n\nYOU HAVE A PROBLEM IF:\nYou can't download from this link: https://signup.leagueoflegends.com/en/signup/redownload# \n\nA POSSIBLE SOLUTION THAT FIXED MY PROBLEM: \nhttp://puu.sh/ehAMr/61ce5b47f6.png\n\nAlso, you have a problem because the website you cannot download from IS the official download link  \n\nBest of luck, and tell me if the link I gave you works (:","replies":[]},{"poster":"HORSE OF FORCE","date":"2015-01-12T01:16:20.515+0000","up_votes":1,"down_votes":0,"body":"It seems that the people who are getting this bug are also not able to download the installer, all of them. There's something which is going wrong in the preliminary connections from the computer to Riot's servers.","replies":[{"poster":"deaditemanchild","date":"2015-01-13T13:46:28.542+0000","up_votes":1,"down_votes":0,"body":"Great, I am having this problem as well, and none of my friends are. OzPinoy, are you using TPG internet, perhaps?","replies":[{"poster":"HORSE OF FORCE","date":"2015-01-13T23:57:20.512+0000","up_votes":1,"down_votes":0,"body":"It's not related to ISPs I think. One person was able to download the installer after they switched to TPG. I think it's got something to do with the programs installed on a person's computers, like third-party firewalls/anti-viruses.","replies":[]}]}]},{"poster":"OzPin0y","date":"2015-01-12T02:18:40.453+0000","up_votes":1,"down_votes":0,"body":"oh.... well that was a waste of uninstall then... :(","replies":[]}]}