{"poster":"canchy","date":"2015-07-27T20:19:00.948+0000","title":"Hablemos sobre el nuevo Teemo , que opinan con el supuesto cambio que le piensan a hacer al Tejon?","subforum":"Charlas Generales","up_votes":4,"down_votes":0,"body":"hola gente :D , me eh enterado que le van a hacer unos cambios al peque&ntilde;o y censual tejon {{champion:17}}  , quiero ver que opinan ustedes sobre esto ? , estara mas Op , mas roto , o mas odiable ? xD . Gracias por su atencion :3","replies":[{"poster":"Neo Gaussrik","date":"2015-07-27T21:46:33.211+0000","up_votes":1,"down_votes":0,"body":"Hola!\n\nDe donde salio esta idea? ^^\n\nY, quisiera invitarlos a hacer un analisis quizas mas profundo; que patrones de juego de Teemo son malos para el juego? (De acuerdo a nuestros pilares de diseño)\n\nY, si logran identificar alguno, como lo cambiarian?","replies":[{"poster":"ALEXKOND","date":"2015-07-27T21:54:46.647+0000","up_votes":3,"down_votes":0,"body":"No se si necesariamente es algo malo, pero tiene una similitud con el donger que para peleas de equipo necesita preparar el terreno mucho antes de que esta inicie. Teniendo en cuenta que los rivales por lo general evitan entrar en áreas donde estén sus hongos, se pierde mucho daño y utilidad por ralentización y esto obviamente lo puede llegar a complicar. \nCreo que el que ahora tenga mucha mayor distancia (de 230 a 900 en nivel 3) y que además reboten le permite tener una presencia mucho mayor cuando se arma Bardo (hue) en la partida. \n\nMedio fuera de tema, pero tal vez sepas responderme. Este cambio de que plante los hongos a distancia ¿Esta influenciado de alguna forma por los barriles de la actualización de Gangplank?","replies":[{"poster":"Neo Gaussrik","date":"2015-07-27T21:59:55.106+0000","up_votes":2,"down_votes":0,"body":"Haha, supongo que si salio en SurrenderAt20 tu ya lo sabes. ^^\n\nUno de los objetivos del cambio es lograr que Teemo sea mas util en una pelea de equipos mas tarde en el partido. Que opinas?\n\nC/R a Gangplank... no, la verdad a mi saber son dos equipos distintos que tuvieron ideas similares!","replies":[{"poster":"ALEXKOND","date":"2015-07-27T23:30:36.526+0000","up_votes":1,"down_votes":0,"body":"En realidad apunto a este post http://boards.las.leagueoflegends.com/es/c/charlas-generales/7BQKJcm0-pbe-actualizacian-del-2307 (distinto usuario, misma persona) pero también esta en s@20 como en otras páginas.\n\nDecia lo de GP porque me pareció demasiada coincidencia que salgan tan juntos unos cambios similares.","replies":[{"poster":"Ode to dark","date":"2015-07-28T00:07:06.336+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ALEXKOND,realm=LAS,application-id=v7qsfXsE,discussion-id=mqpZWjFf,comment-id=0007000000000001,timestamp=2015-07-27T23:30:36.526+0000)\n>\n> En realidad apunto a este post http://boards.las.leagueoflegends.com/es/c/charlas-generales/7BQKJcm0-pbe-actualizacian-del-2307 (distinto usuario, misma persona) pero también esta en s@20 como en otras páginas.\n> \n> Decia lo de GP porque me pareció demasiada coincidencia que salgan tan juntos unos cambios similares.\n\n ¿No hay nadad el PBE hoy Alex? :C","replies":[{"poster":"ALEXKOND","date":"2015-07-28T03:24:39.504+0000","up_votes":2,"down_votes":0,"body":"Un retoque al HUD que hace un poco más claro el cuadro celeste que indica que falta maná para usar habilidades, No vale la pena crear un post nuevo simplemente por ese cambio por lo que lo incluyo en el próximo parche que tenga un poco más de contenido.","replies":[{"poster":"Ode to dark","date":"2015-07-28T21:26:17.994+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ALEXKOND,realm=LAS,application-id=v7qsfXsE,discussion-id=mqpZWjFf,comment-id=000700000000000100000000,timestamp=2015-07-28T03:24:39.504+0000)\n>\n> Un retoque al HUD que hace un poco más claro el cuadro celeste que indica que falta maná para usar habilidades, No vale la pena crear un post nuevo simplemente por ese cambio por lo que lo incluyo en el próximo parche que tenga un poco más de contenido.\n\nGracias <3","replies":[]}]}]}]},{"poster":"Kyousuke","date":"2015-07-27T22:55:37.544+0000","up_votes":2,"down_votes":0,"body":"creo que estaria genial que le agreguen que la w active la pasiva por x segundos asi se puede jugar un buen teemo jungla sin flameos XD","replies":[]}]}]},{"poster":"Ode to dark","date":"2015-07-28T00:13:46.140+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Riot Gaussrik,realm=LAS,application-id=v7qsfXsE,discussion-id=mqpZWjFf,comment-id=0007,timestamp=2015-07-27T21:46:33.211+0000)\n>\n> Hola!\n> \n> De donde salio esta idea? ^^\n> \n> Y, quisiera invitarlos a hacer un analisis quizas mas profundo; que patrones de juego de Teemo son malos para el juego? (De acuerdo a nuestros pilares de diseño)\n> \n> Y, si logran identificar alguno, como lo cambiarian?\n\nEl problema que yo pienso que tiene es que en línea es muy molesto, pero no es una amenaza, no te va a matar a menos que juegues mal o seas un campeón sin sustain, que tenga que acercarse a meleé a farmear obligatoriamente y sin gap closer, creo que a menos que el campeón enemigo no cumpla esas condiciones, es muy difícil que Teemo pueda llevarse kills en línea, luego el daño de Teemo no es muy alto, como mago de burst obviamente que está por debajo de los demás magos de burst, como mago de dps mil veces es mejor Cassiopeiao algún otro campeón con cds bajos, si quiero un campeón que dependa de una zona armada para pelear mejor elijo a Heimer que tampoco está bien pero es mejor que el pobre Tejón, no tiene una identidad clara en el juego, es solo molesto, no tiene una fortaleza marcada como campeón, burst: mediocre, dps: bajo, movilidad: no demasiada, lo único que lo hace destacar son sus hongos pero eso tampoco lo hace tan especial, trinket rojo y pinks son suficientes para acabar con su única fortaleza denotada. Además de que su pasiva solo sirve para campear y en este juego hay que estar siempre en movimiento. Ojalá te sirvan de algo mis opiniones sobre {{champion:17}}  :D","replies":[]},{"poster":"Perrito","date":"2015-07-28T15:03:20.197+0000","up_votes":1,"down_votes":0,"body":"No cambien el splash art de Fiora :c!\n\nPd: Me agrada que cambien las mecánicas de timo. :3","replies":[]},{"poster":"Trollpick Master","date":"2015-07-28T02:40:06.321+0000","up_votes":1,"down_votes":0,"body":"Ya que Teemo con la primera mitad de la pasiva (Camuflaje) está orientado a hacer emboscadas, yo agregaría a la otra mitad (Factor sorpresa) una mejora que haga que durante los 3 segundos de duración luego de salir de sigilo, Teemo no pierda la pasiva de la W cuando recibe daño.","replies":[]}]},{"poster":"alop55555","date":"2015-07-28T00:57:10.877+0000","up_votes":2,"down_votes":0,"body":"una de las ventajas que tenían los hongos de teemo es que quedaban 10 minutos en el mapa ahora el tiempo es de 5 minutos lo que reduce demasiado la estrategia de colocar hongos en el mapa y controlar zonas a distancia . Se perdiótodo el uso estratégico de los hongos fuera de las team fights","replies":[]},{"poster":"Darkmastah","date":"2015-07-27T21:03:25.987+0000","up_votes":2,"down_votes":0,"body":"Le pondrán que los hongos se sacudan al detectar la debilidad del enemigo (cuando van bajos de vida) liberen esporas y lo hagan ser visibles ante sus compañeros de equipo y le hagan daño gradual de 5/10/15 etc a cada segundo en un radio de 2 metros a menos que el enemigo se aleje del radio de las zetas. Es una imaginación mía jaja, si hace eso hasta yo me compro esa ~~pequeña rata~~.","replies":[]},{"poster":"Moonfire","date":"2015-07-27T20:56:08.241+0000","up_votes":2,"down_votes":0,"body":"Si lo Cambian  extrañare Como habria sido antes hiendo Top Robando el Red O Blue Enemigo y Ks con Los Hongos Teemo Se puso un Poco Mas roto Cuando Sacaron esa Vision Para ver lo Invisible","replies":[]},{"poster":"ISSISargento","date":"2015-07-28T05:45:34.436+0000","up_votes":1,"down_votes":0,"body":"realmente no poder llenar de hongos tu line para proteger tu torreta es una desgracia, esta buena la opcion de poder lanzarlos pero ya lo no convierte en un seudo ziggs{{champion:115}} ?","replies":[]},{"poster":"Nickdra","date":"2015-07-28T04:27:17.067+0000","up_votes":1,"down_votes":0,"body":"para mi es un nerfeo a la r, la gracia de las callampa era que uraban 10 min y podias  crear una protecion a la torretas  ahora solo durar 5 min podras poner  menos por que se borraran en 5 min para eso mejor cambian su ulti por otra cosa xD, la pasi  servira muxo a los teemo top para arrancar y esconerse de los gank pero mas k eso no ayudara muxo no es algo tan op\ny lo de tirar las callampas  es solo  para  trolear no ayuda muxo en su daño las callampas no explotaran  al instante y creeo k quieren k teemo solo use  setas en tf y no deje  en el mapa, por que si no lleva setas no podra sacarle provecho al lanzamiento xD   creeo que ahora si sera un campeon inutil teemo xD  ahora si dejan k al entrar a la junglita se active pasiva y  dentro de ella  no se salga con anda   seria op de jg teemo xD","replies":[]},{"poster":"Darkchaz","date":"2015-07-28T02:28:30.976+0000","up_votes":1,"down_votes":0,"body":"Como me nerfean a mi buen super timo. Los odio viejo!!\n\natte. un main timo","replies":[]},{"poster":"kriz cold","date":"2015-07-27T23:30:42.094+0000","up_votes":1,"down_votes":0,"body":"Yo creo que es una buenísima idea lo que le están haciendo, ya que {{champion:17}} tiene 2 problemas a la hora de combatir:\n1) Su pasiva difícilmente la utilizará correctamente para un 1v1, ahora el tejón será imposible de atrapar en los bush de top.\n{{summoner:2}} Puedo ver hordas de vídeos de gente trolleando al enemigo con su nueva pasiva\n2) Su ultimate no se puede utilizar en 1v1 sin que te estén persiguiendo o el enemigo se \"accidente\" con una de las setas (Esto ocurre tambien en team fights). Con este cambio {{champion:17}} podrá arrojar un hongo detrás del enemigo mientras lo hostiga para obligarlo a rodear el hongo y así presionar más fácilmente, además al huir {{champion:17}} puede arrojar hongos en su camino para dificultarle la persecución a teemo (Eh! que si teemo de pilla bajo de vida date por muerto que te tirará un hongo por tu vía de escape y BOOM)\n\nPersonalmente le tengo fé a estos cambios en nuestro queridísimo y odiado tejón...","replies":[]},{"poster":"Eurosia","date":"2015-07-27T23:24:07.260+0000","up_votes":1,"down_votes":0,"body":"http://spa.fotolog.com/photo/26/42/98/cuidadoconelrock/1212086493_f.jpg\n\nZatan Zatan!","replies":[]},{"poster":"Ks Erwyn","date":"2015-07-27T22:51:18.520+0000","up_votes":1,"down_votes":0,"body":"Me parece geniales con los cambios, le da mas dinámica y estrategia de juego a su ya estratégico y a veces limitado modo de juego.","replies":[]},{"poster":"OPG Axeso","date":"2015-07-27T21:14:53.926+0000","up_votes":1,"down_votes":0,"body":"Eso de que su rango aumente según el lvl de su ulti me parece bastante OP. \nDeberían dejarlo como esta... Creo que también le bajaron el tiempo que tiene que estar quieto para hacerse invisible. \n\n                                                                           **TEJÓN OP            {{champion:17}} **","replies":[]},{"poster":"Forsaken Me","date":"2015-07-27T20:44:55.508+0000","up_votes":1,"down_votes":0,"body":"Solo se que ahora no podrás poner un {{item:2043}} y llenarlo de hongos con  ebola, y múltiples enfermedades dentro de su veneno y esperar que uno lo vea, intente limpiar y muera mirando la pantalla con cara de ; \"tejón de hijo de....\" \nCosa que a mi me parece perfecto :D","replies":[]},{"poster":"artistafracasado","date":"2015-07-27T20:33:40.197+0000","up_votes":1,"down_votes":0,"body":"no creo que lo deje más op, pero si ayudará a mejorar la defensiva, porque correremos menos riesgo al poner los hongos. Y a todo esto los hongos duran menos.","replies":[]},{"poster":"arondightFTW","date":"2015-07-27T20:25:26.189+0000","up_votes":1,"down_votes":0,"body":"pero cuales son los cambios? asi no vas a tener mis bitcoins","replies":[{"poster":"Moonfire","date":"2015-07-27T20:27:12.100+0000","up_votes":1,"down_votes":0,"body":"Lo que Conosco por Ahora es ese :V","replies":[]}]},{"poster":"Moonfire","date":"2015-07-27T20:24:07.962+0000","up_votes":1,"down_votes":0,"body":"Solo supe por ahy sierto que los hongos estan OP y Rotos del el {{champion:17}}  Las setas Rebotaran ahora :O talves","replies":[]},{"poster":"Perrito","date":"2015-07-28T15:02:42.179+0000","up_votes":1,"down_votes":1,"body":"he*","replies":[]}]}