{"poster":"Spyx","date":"2017-02-26T15:55:28.894+0000","title":"PC freezing and buzzing when playing a game of League","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"Hey everyone,\r\n\r\nrecently I've been having some troubles when playing LoL; my PC freezes for a second and buzzes. it's only like one second, but it happens very often. not every 4 seconds, but more like...every 4-7 minutes. and there are times it doesnt do that for a while.\r\nit happens during lane phase, but also teamfight..basically happens anytime\r\nbut it ONLY happens when playing league of legends...\r\nI'm playing both new and legacy client, so it can't be that I suppose.\r\n\r\nIt only happened recently, like...5-6 days ago maybe. I also had that my screen would entirely go black and game freezes, then it unfreezes after 10 seconds or so, and the game continues normally.\r\n\r\nhere are my PC specs:\r\n\r\nhttps://gyazo.com/5d287aca86d4064cc88f507008e3fd6c\r\nhttps://gyazo.com/8cd6d80b17052da117cea1d8d8cd1b8d\r\n\r\nsorry for the dutch wording behind it, but I'm sure you can understand what exactly what part is.\r\nplease , anyone if there's any thought, let me know...","replies":[{"poster":"Targons Blade","date":"2017-02-27T02:20:59.113+0000","up_votes":1,"down_votes":0,"body":"Freezing or *locking up* during gameplay are issues that are typically caused by problematic system drivers or hardware failure. I strongly recommend working through our [**Bugsplat & Crash Guide**](https://support.riotgames.com/hc/en-us/articles/201761974-Bug-Splat-and-Game-Crashes) to address the most common solutions for this.\n\nPlease let me know if you continue to experience this.","replies":[{"poster":"Spyx","date":"2017-02-27T23:18:26.078+0000","up_votes":1,"down_votes":0,"body":"Hello , thanks for the reply.\nI've been through the entire guide, I've done anything that I thought would take effect, but no difference. I've got my PC updated, League is updated, drivers of my graphics card are updated. Basically everything ... I also don't have any unwanted software running in my background, or software which I don't need. \n\nI even entirely reinstalled league of legends, re-downloading it from the website and patching it, etc.","replies":[{"poster":"Targons Blade","date":"2017-03-01T02:49:57.335+0000","up_votes":1,"down_votes":0,"body":"Since you're still experiencing issues after working through that guide, we'll need to escalate this to our tech team to troubleshoot further. I'd like you to run some system logs using our [**Hextech Tool**](https://support.riotgames.com/hc/en-us/articles/224826367), then attach them to a [**support ticket**](https://support.riotgames.com/hc/en-us/requests/new) so a tech can get back to you.\n\nHit me back if you run into issues with those steps.","replies":[{"poster":"Spyx","date":"2017-03-02T11:01:53.797+0000","up_votes":1,"down_votes":0,"body":"Thanks. I ran the tool, and now I've got folders about different logs (game - r3d logs, league client logs, maestro logs, etc). \nDo I compress those folders in a .RAR  and attach that? because there are a LOT of files in each folder........","replies":[{"poster":"Targons Blade","date":"2017-03-03T00:07:12.382+0000","up_votes":1,"down_votes":0,"body":"The Hextech Repair Tool will create a zipped set of logs called **Lol Logs.zip** on your desktop that you can simply attach to your support ticket.\n\nI hope that cleared up the confusion!","replies":[]}]}]}]}]}]}