{"poster":"dontspinbutwin","date":"2019-03-11T04:18:07.692+0000","title":"Can we have a blatantly \"ugly\" male/female in the game?","subforum":"Memes & Games","up_votes":5,"down_votes":7,"body":"Honestly, I want Riot to create a character that's so grotesque, I have difficulty imagining r34 content for that character. Seriously, some of the character's write themselves in terms of r34, and it doesn't even pertain to their lore.\r\n\r\nSylar is buff and half naked. Half the job is already done for the artists.\r\nZoe is canonically thousands of years old. FBI bullet dodged, artists continue to draw.\r\nDr Mundo is a sadist, who spends his life torturing zaunites while eating toenails....yet he has an 8 pack...?\r\n_New kayle quite literally strips down in game, making me unsure whether this is hentai haven or league of legends._\r\n\r\nGive me something grotesque, something impossible to lewd. Like take reksai, for example. She has excellent lore, no sexuality, and if i look up r34, I have regret, not surprised pleasure ( and it should be noted any \"good\" r34 of her is humanoid).\r\n\r\nGive me warts. Give me flabs. Give me rotted teeth. Give me mismatched arm lengths. Have one of their eyes drip out of their sockets. Give me mixmatched boobs. I really want to see a champion who's design is so grotesque, that I can't help but love.\r\n\r\n....but then again, in the year 2019, I'm sure that creating such a character would trigger someone out there, and cause the community to cry.","replies":[{"poster":"KFCeytron","date":"2019-03-11T05:16:30.672+0000","up_votes":4,"down_votes":0,"body":"Remember Trundle?\n\nhttps://i.ytimg.com/vi/8AspKoPQCgk/hqdefault.jpg\n\nConstantly rotting and regenerating, he used his Curiously Strong™ troll regeneration to contain a plague for his tribe. I identified with his condition.\n\nAnd then we got a \"troll king. KING!\" who is a blue, musclebound hunk from Freljord. Making champs suddenly be from Freljord was all the rage in those days.\n\nhttps://ddragon.leagueoflegends.com/cdn/img/champion/splash/Trundle_0.jpg\n\nAnd Urgot... oh, Urgot.\n\nhttps://gamepedia.cursecdn.com/lolesports_gamepedia_en/d/d4/Urgot_Splash_0_Oldest.jpg\n\nHe had some muscle definition in his arms from carrying those weapons, but the rest of him was a blob, which made sense for someone who's basically sedentary all the time. Even his prosthetic legs were cracked and ugly.\n\nAnd now look what we have.\n\nhttps://uploads.disquscdn.com/images/aa2af2cd73442e7cb333fe9b759971134f23bb667fc56db4aa7803c5cf1699cc.jpg\n\nA musclebound badass with body art and a sweet ride. He even got an upgrade for his prosthetic legs, which are now fancy and in good repair (plus shotgun knees).\n\nThe last holdout is Gragas, who isn't even actually ugly; he could just stand to lose a bunch of weight.\n\nThere is no room for \"ugly\" in League of Legends. It's just too bad for anyone who doesn't like being held to unrealistic standards.","replies":[{"poster":"hotarse","date":"2019-03-11T12:07:39.340+0000","up_votes":1,"down_votes":0,"body":"Zilean is still pretty ugly. As is SINGED.","replies":[]},{"poster":"Academy Kayn","date":"2019-03-11T05:57:43.908+0000","up_votes":1,"down_votes":0,"body":"Ah yes, the unrealistic standards of being a six legged monstrosity of science.","replies":[{"poster":"KFCeytron","date":"2019-03-11T06:11:56.950+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Academy Kayn,realm=NA,application-id=Ir7ZrJjF,discussion-id=vh77mZZv,comment-id=00020000,timestamp=2019-03-11T05:57:43.908+0000)\n>\n> Ah yes, the unrealistic standards of being a six legged monstrosity of science.\n\nNah, he's just got a sweet ride.","replies":[]}]}]},{"poster":"Jimmy Rustles","date":"2019-03-11T04:29:46.497+0000","up_votes":4,"down_votes":0,"body":"Old Yorick and Urgot, the dream team\n\nNow both are hot","replies":[{"poster":"TheUrbanKitsune","date":"2019-03-11T04:35:00.704+0000","up_votes":2,"down_votes":0,"body":"Agree to disagree on Urgot being 'hot' in any way...\nNot a fan of Yorick either but he's not terribly ugly.\n\nAlso; Sion, Mundo, Gragas, Singed\n\nI personally don't think Kalista is ugly but I've seen other people say so.\n(I like the arthritic claw hands that seem to put others off)\n\nI do agree we need more female champs like that.","replies":[{"poster":"Tuition Fee","date":"2019-03-11T10:28:27.668+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=TheUrbanKitsune,realm=NA,application-id=Ir7ZrJjF,discussion-id=vh77mZZv,comment-id=00000000,timestamp=2019-03-11T04:35:00.704+0000)\n>\n> Agree to disagree on Urgot being 'hot' in any way...\n> Not a fan of Yorick either but he's not terribly ugly.\n> \n> Also; Sion, Mundo, Gragas, Singed\n> \n> I personally don't think Kalista is ugly but I've seen other people say so.\n> (I like the arthritic claw hands that seem to put others off)\n> \n> I do agree we need more female champs like that.\n\n~~personally I have a thing for dad bods~~","replies":[]},{"poster":"dontspinbutwin","date":"2019-03-11T05:09:15.344+0000","up_votes":1,"down_votes":0,"body":"Yorick went fromt he hunchback of notre dame to the upcoming bachelor.\nUrgot went from muscle man from the regular show, to having one buff nipple.\n\nBruh.","replies":[]},{"poster":"Jamaree","date":"2019-03-11T04:59:23.236+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=TheUrbanKitsune,realm=NA,application-id=Ir7ZrJjF,discussion-id=vh77mZZv,comment-id=00000000,timestamp=2019-03-11T04:35:00.704+0000)\n>\n> Agree to disagree on Urgot being 'hot' in any way...\n> Not a fan of Yorick either but he's not terribly ugly.\n> \n> Also; Sion, Mundo, Gragas, Singed\n> \n> I personally don't think Kalista is ugly but I've seen other people say so.\n> (I like the arthritic claw hands that seem to put others off)\n> \n> I do agree we need more female champs like that.\n\nIf you don't think there are rule 34 for those guys, you are mistaken as FUCK.","replies":[]}]},{"poster":"The Trent","date":"2019-03-11T07:11:40.934+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Jimmy Rustles,realm=NA,application-id=Ir7ZrJjF,discussion-id=vh77mZZv,comment-id=0000,timestamp=2019-03-11T04:29:46.497+0000)\n>\n> Old Yorick and Urgot, the dream team\n> \n> Now both are hot\n\nwha-????? URGOT IS HOT??","replies":[]}]},{"poster":"UnboundHades","date":"2019-03-11T05:22:46.167+0000","up_votes":5,"down_votes":1,"body":"No one plays champions that look like trash and I guarantee you that if riot did make a champion like that people would be praising it for a week then never touch them again because get this, it's more enjoyable to play a game where you aren't looking at garbage the entire time. \n\nAlso wrong board","replies":[{"poster":"dontspinbutwin","date":"2019-03-11T07:22:28.481+0000","up_votes":1,"down_votes":0,"body":"Just because a champion isn't popular doesn't make them any less of an addition to the game as another champion. I can't recall the last time I saw an Aureleon Sol, but their mains are either really good or really bad, and they can impact the flow of early game by themselves. \n\nSimilarly, mordekaiser mains are really quiet, and just seek improvement. They laugh at how bad their main is, and laugh at all the bugs. Regardless, their community is quite wholesome.\n\nI get what you mean, I really do: I imagine a grotesque champion might make me sickened after a while, and it may be why such a champ doesn't exist. Then again, there are the SAW series which are full of inhumane torture games, yet they're quite infamous for that same reason: a niche that is fufilled. Someone out there might just truly love horrid beasts, and might take up the character, similar to how someone who might like boobs might be more attracted to MF or Evelynn. A smaller audience, yes, but still there.\n\nAlso, I posted this under memes and games because if I put it under serious discussion, someone might think I'm calling them ugly, they might get offended, and if it's official then suddenly the message is misconstrued. Putting the idea here at least puts the thought in the heads of others, and whether they want to take it serious or not is up to them.","replies":[]}]},{"poster":"Jerry SeinfeId","date":"2019-03-11T09:55:27.320+0000","up_votes":3,"down_votes":0,"body":"I genuinly don't get this obsession with ugly characters. Even if you want a somewhat monstrous character they don't have to be ugly, look at urgot who's a complete beast.\nThere's no ugly champs in this game, they al look good. Most ugly champs back in the day were ugly because the art department was garbage compared to now.\n\nnot to mention league is heavily stylized and you'd just end up with another goofy fuck like mundo.\n\nand your example is rek sai, who is ugly? except she isn't, she's just an animal/a monster. If rek sai is ugly then so are cho, koggers and kha. But they aren't. \nRule 34 is just porn not wether some shit looks pretty enough for it. Turns out people would rather smash a human than a sandshark.\ni'm pretty sure the same thing applies to anivia even tho barely anyone considers her ugly.\n\nthe only exception in this game is pug maw. that thing is genuinly hideous.","replies":[]},{"poster":"The Trent","date":"2019-03-11T07:18:08.488+0000","up_votes":3,"down_votes":0,"body":"{{champion:266}} {{champion:12}} {{champion:31}} {{champion:30}} {{champion:90}} {{champion:111}} {{champion:421}} {{champion:56}} {{champion:27}} {{champion:14}} {{champion:72}} {{champion:48}} {{champion:412}} {{champion:223}} {{champion:29}} {{champion:6}} My kings, my queens, my stud muffins, my hot cakes. They make me so crazy when I see them on the rift. {{sticker:sg-lux}}\nYou have to remember there are other regions and kids that aren't attracted to ugly stuff. League started out as a more hardcore heavy metal game which is why champs used to be a lot uglier. ","replies":[]},{"poster":"MF is my Waifu","date":"2019-03-11T06:39:29.056+0000","up_votes":2,"down_votes":1,"body":"Singed, Trundle, Rek'Sai?\n\nCan people stop crying about appearance? Or just, you know, cry without posting?","replies":[{"poster":"dontspinbutwin","date":"2019-03-11T07:27:54.401+0000","up_votes":1,"down_votes":3,"body":"...I literally memed myself because I know I used an absolute. Heck, I used reksai as an example of great champ design.\n\nFurthermore, trundle was actually made to be more attractive. He used to fit the term of grotesque, but got a VGU, then splash updated all the skins to make him more humanoid.\n\nAs for singed, he was one character I admired because his disfigurement. A few exceptions doesn't mean perfection.","replies":[{"poster":"MF is my Waifu","date":"2019-03-11T07:50:08.873+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=dontspinbutwin,realm=NA,application-id=Ir7ZrJjF,discussion-id=vh77mZZv,comment-id=00060000,timestamp=2019-03-11T07:27:54.401+0000)\n>\n> A few exceptions doesn't mean perfection.\n\nUh, what...?","replies":[]}]}]},{"poster":"hotarse","date":"2019-03-11T05:23:01.459+0000","up_votes":2,"down_votes":1,"body":"Right, I'm sure the champ designers and artists are going to make it priority no. 1 now that you've asked for it. They'll make sure the next champ is so ugly, NO ONE will make pr0n featuring that character. It's going to be so ugly, any time anyone plays it, everyone in the game suffers from having to look at the character model. It's going to be so ugly, it'll almost match the ugly coming out of your original post. \nGet a life. Who gives a damn about \"fan art\". \n\nRiot doesn't want to make ugly or monstrous anymore since most of their audience are pixar-weened kiddies who want to see bright and colorful fun stuff. A little edge is ok sometimes, but mostly just disney toons all over the place now.","replies":[{"poster":"dontspinbutwin","date":"2019-03-11T07:25:17.498+0000","up_votes":1,"down_votes":0,"body":"....the last character released was about a man who was shackled for 15 years, and saw to the electrocuting death of his master, a father and a daughter.\n\nThe reworks are about loving sisters who were separated by their role of justice.\n\nRiot has made clear that there are some monsters in league. Many just don't look like it.","replies":[{"poster":"hotarse","date":"2019-03-11T12:05:01.139+0000","up_votes":1,"down_votes":0,"body":"Aaaand he looks just like a Disney villain toon. Aaaaand, another humanoid character. Aaaaand, a dumb ulti that punishes too many champions in champ select, aaaaand bullshit toxic mobility once again.","replies":[]}]}]},{"poster":"Rustypug","date":"2019-03-12T15:33:19.449+0000","up_votes":1,"down_votes":0,"body":"https://thumbs.gfycat.com/ShadyClassicHalicore-max-1mb.gif","replies":[]},{"poster":"nelogis","date":"2019-03-11T09:49:43.344+0000","up_votes":1,"down_votes":0,"body":"If you want something ugly play Mundo and look at his ingame model","replies":[]},{"poster":"Accursêd","date":"2019-03-11T08:30:30.829+0000","up_votes":1,"down_votes":0,"body":"Urgot","replies":[]},{"poster":"Moonshade","date":"2019-03-11T07:46:22.663+0000","up_votes":1,"down_votes":0,"body":"{{champion:6}} says Hi, as does {{champion:223}} (u will find R34 of him but its probably just because of his tongue) and {{champion:31}} is pretty tough to make sexy lol","replies":[]},{"poster":"Baron Barian","date":"2019-03-11T07:41:27.834+0000","up_votes":1,"down_votes":0,"body":"Friend, it doesn't matter if something had intestines for a face and a body  that's half inside-out. R34 artists will always find a way to draw it and get people to whip their Doran Blades out to it.","replies":[]},{"poster":"Academy Kayn","date":"2019-03-11T05:19:46.956+0000","up_votes":1,"down_votes":0,"body":"> Give me something grotesque, something impossible to lewd\n\n> and it should be noted any \"good\" r34 of her is humanoid)\n\nI'm not ashamed to say that these are both false. It may not be your taste, but there are plenty that is 'good'.","replies":[]},{"poster":"Worst Kench NA","date":"2019-03-11T05:13:12.482+0000","up_votes":1,"down_votes":0,"body":"{{champion:79}} \n\nHis base model is so disgusting that it's hard to look at. One of the only champs that I actually had to get a skin to play as.","replies":[]}]}