{"poster":"MSF Keydan","date":"2017-07-27T06:00:28.659+0000","title":"Los e-Sports aparecen por fin en una diario importante, ''Olé'' lo ha hecho","subforum":"Esports","embed":{"description":"DEPORTES ELECTRÓNICOS Los eSports siguen en pleno crecimiento. En Argentina ya hay asociación y buscan ser disciplina olímpica. Publicado el Cada día, las competencias de videojuegos aumentan su popularidad. Este progreso llegó al punto en que, muchos países lo consideran un deporte; un deporte electrónico o eSport.","url":"https://www.ole.com.ar/poli/esports-deportes-electronicos-videojuegos-lol-csgo_0_1839416061.html","image":"https://www.ole.com.ar/poli/Seleccion-Argentina-Counter-Strike-Mundial_OLEIMA20170726_0020_7.jpg"},"up_votes":7,"down_votes":0,"body":"El d&iacute;a de ayer ha sido publicado en uno de los diarios de deportes m&aacute;s importantes y tradicionales de Argentina una peque&ntilde;a nota contando todo sobre los e-Sports, la nota hace un breve resumen de qu&eacute; va todo y c&oacute;mo tanto Argentina como otros pa&iacute;ses latinoamericanos se busca que sea un deporte o hasta ser una disciplina ol&iacute;mpica como lo es en Asia, pueden adquirirlo f&iacute;sicamente como yo lo he hecho ya que es merecido tenerlo. Como dato les pasar&eacute; una foto de c&oacute;mo se ve en diario ya que tiene un par de detalles que digitalmente no tiene.\r\nhttp://imgur.com/a/xVSpA\r\n\r\nPienso que esto es un gran paso para que la gente sepa que esto es lo que mueve bastante cosas y plata a pasos agigantados y no que es solo &#039;&#039;estar todo el d&iacute;a con los jueguitos en la compu&#039;&#039; Quien quiera adquirirlo el d&iacute;a en que sali&oacute; es el 26 de Julio en la pen&uacute;ltima p&aacute;gina. Por &uacute;ltimo podr&iacute;an ir al link de la nota y darle un pulgar arriba para que sigan dando notas as&iacute;, &iexcl;ir a por m&aacute;s!","replies":[{"poster":"Tortuguita","date":"2017-07-27T08:27:03.435+0000","up_votes":2,"down_votes":0,"body":"Están creciendo cada vez mas es realmente increíble , solo no deben cagarla como el dota y seguir \"innovando\" y listo.","replies":[]},{"poster":"Conejito Fufu","date":"2017-07-27T06:54:33.155+0000","up_votes":2,"down_votes":0,"body":"TyC Sports le esta metiendo ya hace un tiempo largo bastante movimiento a los eSports, si no me equivoco hacen stream de CS-GO etc.\n\nOjala los eSports se convierta en algo realmente serio en argentina","replies":[]}]}