{"poster":"ScR33TchBozZ","date":"2016-06-19T18:30:45.080+0000","title":"Low FPS im Spiel","subforum":"Hilfe & Support","up_votes":2,"down_votes":0,"body":"Hi,\r\n\r\nhatte das Problem schon einmal in diesem Jahr f&uuml;r ca 1 Monat: Trotz eines Gamer PC&#039;s l&auml;uft es ab der ca 20. - 25. Minute nur noch mit sehr wenig FPS ( statt 160-200 FPS nur noch 40-60 FPS ). Ich hatte wie gesagt dieses Problem schon einmal in diesem Jahr, jedoch h&ouml;rte es nach einem Monat wieder auf und heute, als ich eine Runde gespielt habe, fing es wieder an und ich verstehe nicht woran das liegt... Btw ich habe mehrere Male nachgeguckt ob meine CPU oder mein Arbeitsspeicher beim Task-Manager ausgelastet sind, aber meine CPU liegt dann immer nur bei ca 15% und mein Arbeitsspeicher bei 5-6GB. Und was auch wichtig ist: selbst wenn ich die Grafik und alles Andere auf gaaaaaaaaaaaaaaanz niedrig stelle, &auml;ndern sich meine FPS 0. Brauche dringend Hilfe!\r\n\r\nMfG ScR33TchBozZ\r\n\r\nzu meinem PC:\r\n\r\n16GB Arbeitsspeicher\r\nAMD FX(tm)-8350 Eight-Core Prozessor 4.00 GHz\r\nAMD Radeon R9 200 Series","replies":[{"poster":"ScR33TchBozZ","date":"2016-06-20T15:00:06.240+0000","up_votes":1,"down_votes":0,"body":"Freut mich zu hören, dass es nicht nur mir so geht und ich hoffe auch, dass wir bald Hilfe mit dem Problem kriegen werden.","replies":[]},{"poster":"Farhud","date":"2016-06-20T00:20:47.859+0000","up_votes":1,"down_votes":0,"body":"geht mir genauso seit kurzem","replies":[]},{"poster":"Jetzt erst recht","date":"2016-06-19T20:23:29.322+0000","up_votes":1,"down_votes":0,"body":"Bis vor einem Monat hatte ich mit meinem MacBook Pro keine Probleme. Konnte normal mit 60 fps spielen. Keine Lags. \nJetzt hab ich dauernd Probleme, oft dropt es auf 40 fps und ich mache absolut keine flüssigen Bewegungen mehr. Der Ping ist dabei ok.","replies":[]},{"poster":"Tumble Into Bush","date":"2016-06-19T18:45:16.242+0000","up_votes":1,"down_votes":0,"body":"Ich habe GENAUUU das gleiche problem als du...\nGamer pc und alles hatte keine probleme und jetzt BUMM 30-50 fps manchmal.... Hoffe einer hilft uns.","replies":[]}]}