{"poster":"Giorgio di villa","date":"2016-06-02T14:55:37.647+0000","title":"nuove informazioni su pokemon sole e luna","subforum":"Off-topic","embed":{"description":"Disponibile il nuovo trailer su Pokémon Sole e Luna riguardante i leggendari, i personaggio e la regione di Alola! Per maggiori informazioni vai su www.pokemonmillennium.net","url":"https://www.youtube.com/watch?v=BRLiPrvVVv4","image":"https://i.ytimg.com/vi/BRLiPrvVVv4/hqdefault.jpg"},"up_votes":6,"down_votes":1,"body":"ecco un nuovo video su alcune novit&agrave; di Pokemon sole e luna come i tipi dei leggendari e una foto della regione di alola........e che il vostro pokedex sar&agrave;.........un rotom!{{sticker:slayer-pantheon-rainbows}}","replies":[{"poster":"call me pawn","date":"2016-06-02T16:01:09.077+0000","up_votes":2,"down_votes":0,"body":"VOGLIO QUEL ROTOM!","replies":[]},{"poster":"ubercodlegend200","date":"2016-06-03T05:28:50.253+0000","up_votes":2,"down_votes":1,"body":"Gli starter sono bruttini ma c'è il rotomdex ed è tutto k","replies":[]},{"poster":"Ringiel","date":"2016-06-03T16:21:46.295+0000","up_votes":1,"down_votes":0,"body":"https://www.youtube.com/watch?v=P4rBNgpq43g","replies":[]},{"poster":"ViaMalinconiaN9","date":"2016-06-02T17:34:21.249+0000","up_votes":1,"down_votes":0,"body":"Mmh.. ma solo io noto una certa mappa molto diversa da tutti gli altri giochi pokemon? non so ma sembra che non ci siano \"mappe divise\" nel senso quando stai al percorso 104 (per esempio) e entri nella città, si fa lo schermo nero e ti fa entrare in un'altra mappa, qui invece sembra che la mappa è l'intera isola! cioè è tutto unito, non so se mi sono spiegato, lo vedo strano, forse è solo una mia impressione.. spero proprio di no.. ma allo stesso tempo di si xD","replies":[{"poster":"Dainsleif09","date":"2016-06-02T18:16:45.340+0000","up_votes":1,"down_votes":0,"body":"no no è vero:è come se fosse tutto unito come hai detto tu e non come entrare in una nuova zona o in una casa.","replies":[{"poster":"ViaMalinconiaN9","date":"2016-06-02T19:31:56.317+0000","up_votes":1,"down_votes":0,"body":"Eh allora non sono stato l'unico a notarlo..","replies":[]}]}]},{"poster":"Dainsleif09","date":"2016-06-02T16:58:32.179+0000","up_votes":1,"down_votes":0,"body":"credo che andrò per la ragazza scuro chiara...giocare il personaggio maschio è davvero troppo cliché per me,ma sono anche felice di vedere che la personalizzazione è tornata ed ho potuto vedere i campi di erba selvatici:all'inizio pensavo avrebbero fatto una roba tipo pokemon ranger(fantasia mia alla fine),ma abbandonare la buona vecchia erba alta sarebbe stato difficile.\nper me luunala merita davvero e sono contento di aver prenotato luna^^.","replies":[]}]}