{"poster":"Giorgio di villa","date":"2018-11-13T21:56:50.208+0000","title":"Mi sembra strano che sul forum nessuno abbia ancora detto nulla sul film dei pokemon della Lidl","subforum":"Off-topic","embed":{"description":"Entra in squadra con una leggenda! POKÉMON #DetectivePikachu arriva al cinema a maggio 2019. Il mondo dei Pokémon prende vita! La prima avventura Pokémon live-action, \"\"POKÉMON Detective Pikachu\"\", nella sua versione originale vede Ryan Reynolds dare la voce a Pikachu, il volto iconico del fenomeno globale Pokémon, uno dei marchi di intrattenimento multigenerazionale più popolari al mondo ed il franchise multimediale di maggior successo di tutti i tempi.","url":"https://youtu.be/XGl9Q61RnAg","image":"https://i.ytimg.com/vi/XGl9Q61RnAg/hqdefault.jpg"},"up_votes":7,"down_votes":6,"body":"perch&egrave; quei Greninja sembrano dei power rangers?\n\na parte ~~la CGI che genera incubi~~ gli scherzi, gi&agrave; solo dal trailer credo proprio che potrebbe uscire qualcosa di veramente buono\nanche nei primi trailer di Venom la CGI era discutibile ma con il tempo sono riusciti a migliorarla molto ... peccato che nonostante questo la Sony sia comunque riuscita a fare una gran cagata\n\novviamente non poteva mancare charizard il pokemon pi&ugrave; ~~sopravvalutato~~ amato fra tutti\n\ne la cosa migliore è che Pikachu verrà doppiato da Deadpool","replies":[{"poster":"FireM1nd","date":"2018-11-14T01:21:32.544+0000","up_votes":7,"down_votes":0,"body":"Ti dirò,  l'ho visto oggi per sbaglio, perché era pubblicità non skippabile del trailer di toy story.. e devo dire che mi sono ricreduto rispetto a quando avevo visto l'annuncio. In inglese l'effetto è decisamente migliore, perché Reynolds ha la voce un po più bassa rispetto al suo doppiatore italiano, e questo aumenta il distacco dal tenero \"pika pika\" a cui siamo tanto abituati. \n\nInoltre, l'ambientazione: CUPA. Ryme city sembra una citta dal doppio volto, proprio come i suoi abitanti, umani e pokemon. E FINALMENTE. I pokemon non sembrano più solo felici e zuccherosi,  ma sono adesso creature realistiche, che magari tu percepisci sempre allegre, come quando saluta la ragazza, mentre in realtà sono tristi, sole o arrabbiate (proprio com'è si presenta pikachu - oh, DIO! Ero così solo!)\n\nRyme city, \"città in armonia coi pokemon\" ospita in quelli che sembrano luoghi underground incontri clandestini con i pokemon chiusi a lottare in una gabbia. APPROVED. Per ultima, la cgi.  È vero, non è perfetta,  ma confesso che pikachu gli è venuto davvero bene, diamine alla fine del trailer ne volevo uno anch'io (soprattutto con la voce di Reynolds, sarebbe troppo esilarante). Inoltre credo che una cgi che te li faccia apparire un po più bruttini ma realistici ci stia. È in linea con l'ambiente. È figo,  ma disturbante, perché imperfetto rispetto a come siamo abituati a vederlo.\n\n\nTi dirò.. promette molto bene, per ora.","replies":[]},{"poster":"wattbatt","date":"2018-11-14T10:36:41.546+0000","up_votes":1,"down_votes":4,"body":"Bravo! effettivamente è una cosa che ha colpito molto in internet e val la pena parlarne.\n\nIo al contrario di molti sono infastidito dal fatto che p. abbia la voce di deadpool, e questo non significa belle cose secondo me.\n\nSe pikachu dice UNA, dico UNA SOLA parolaccia nel film per me perdono tutto il mio rispetto.\n\nah e poi c'è anche quello della pubblicità delle suzuki XD","replies":[{"poster":"BluCobalto92","date":"2018-11-14T12:13:31.481+0000","up_votes":1,"down_votes":0,"body":"non so perchè ma mi aspetto una cosa alla ted...quel film con l orsacchiotto di peluche piu volgare del mondo","replies":[{"poster":"wattbatt","date":"2018-11-14T12:15:08.919+0000","up_votes":1,"down_votes":0,"body":"Esatto io spero proprio che NON sia cosi perché se no non mi piacerebbe per niente","replies":[{"poster":"Isaak001","date":"2018-11-15T18:34:07.304+0000","up_votes":1,"down_votes":0,"body":"per quale motivo?","replies":[{"poster":"wattbatt","date":"2018-11-16T15:40:13.799+0000","up_votes":1,"down_votes":2,"body":"perchè da quando pikachu ha una voce grave e parla?....al massimo una voce acuta...per me","replies":[{"poster":"Isaak001","date":"2018-11-16T23:28:04.478+0000","up_votes":1,"down_votes":0,"body":"ma è ovvio che non è un film \"canonico\" alla storia generale pokémon ma fatto solo per divertire, insomma... sarà Ted in versione pokémon secondo me e per una trovata del genere la voce è perfetta","replies":[]}]}]},{"poster":"BluCobalto92","date":"2018-11-15T11:02:38.586+0000","up_votes":1,"down_votes":1,"body":"Non ho grandi aspettative per questo film... Per me sarà un flop tipo dragonball evolution\n\nPiuttosto sono interessato a spiderman un nuovo universo","replies":[]}]}]}]},{"poster":"SickAnto","date":"2018-11-14T11:08:07.291+0000","up_votes":1,"down_votes":0,"body":"***A R T E***","replies":[]},{"poster":"The Fluffy Lamb","date":"2018-11-14T01:38:08.508+0000","up_votes":1,"down_votes":0,"body":"Voglio vedere quel dannato film","replies":[]}]}