{"poster":"Giorgio di villa","date":"2015-09-17T13:21:33.080+0000","title":"2 domande da una persona stupida","subforum":"Aiuto e supporto","up_votes":2,"down_votes":2,"body":"Ho due domande da fare \r\n1. Cosa significa kappa? Ultimamente lo sento usare parecchio \r\n2. La seconda &egrave; la domanda pi&ugrave; importante: come posso battere quel ratto di gnar, i miei main sono Darius, Jax e cho gath a parte con Jax non sono mai riuscito a battere quel criceto spammatore di boomerang MAI &egrave; l&#039;unico campione con cui ho cos&igrave; tanti problemi quindi chiedevo se esiste una strategia per giocare contro di lui o qualche Champion che lo countera?\r\nAccetto qualsiasi tipo di consiglio che mi consenta di battere quel sorcio","replies":[{"poster":"Stoned Warlock","date":"2015-09-17T15:10:48.184+0000","up_votes":1,"down_votes":0,"body":"boh, io solitamente quando non so giocaer contro un champ, uso quel champ in modo tale da vedere come ci giocano gli altri contro di me e prendere spunto, ovviamente anche guardarsi qualche video di progamer aiuta molto, ma l'esperienza aiuta di più ^^ comunque contro gnar, ekko op, yasuo, tutti champ con forte engage e burst, in modo tale da ingaggiarlo quando è piccolo e squishi, o champ con mobilità come riven aiutano il tuo matchup, comunque prova a giocare gnar e vedi contro chi ti trovi peggio e perchè ^^ così saprai come counterarlo","replies":[{"poster":"Giorgio di villa","date":"2015-09-17T18:00:00.576+0000","up_votes":1,"down_votes":0,"body":"Io non ho gnar e lo odio troppo per comprarlo in oltre sono a corto di ip e i prossimi sulla mia lista sono trundle e irelia\nGrazie del consiglio","replies":[{"poster":"Stoned Warlock","date":"2015-09-18T02:51:51.684+0000","up_votes":1,"down_votes":0,"body":"irelia op C: ho appena carriato con lei *-* troppo amore per quel champ","replies":[]}]}]},{"poster":"A Yordle ln Heat","date":"2015-09-17T16:31:51.658+0000","up_votes":1,"down_votes":1,"body":"kappa.","replies":[{"poster":"Giorgio di villa","date":"2015-09-17T18:10:13.396+0000","up_votes":1,"down_votes":0,"body":"Non dirmi che maini quel ratto saltellante boomerangmaniaco","replies":[]}]},{"poster":"Nibbio Bianco","date":"2015-09-17T13:35:07.610+0000","up_votes":1,"down_votes":0,"body":"Kappa = http://static4.fjcdn.com/comments/Gt+using+kappa+outside+of+twitch+_11edacc56cb159b0f8616adc7524e4f7.png\n\nKappa is a graphic emoticon commonly used by trolls as a postscript to a sentence to convey sarcasm on the live streaming video platform Twitch.\n\nè un emoticon usata su Twitch.tv per fare conversazioni sarcastiche. \n\nGnar è abbastanza forte in lane perché è ranger ed è tank, quindi fa danni dalla distanza e anche se gli fai danno molto probabilmente non gli farai abbastanza danno. Puoi cercare di farmare sotto torre e di schivare i boomerang e non farti harassare con gli attacchi base, e cercare di sfruttare eventuali errori.","replies":[{"poster":"Giorgio di villa","date":"2015-09-17T18:04:58.952+0000","up_votes":1,"down_votes":0,"body":"Grazie per tutti i consigli che mi dai","replies":[]}]},{"poster":"SennaFirstPick","date":"2015-09-17T13:31:19.165+0000","up_votes":1,"down_votes":0,"body":"non so come aiutarti per gnar, ma posso risponderti riguardo al significato dietro il kappa.\nprima di tutto. questa è la faccia di kappa: http://i.imgur.com/6CbxaPc.jpg\nti farò dei piccoli esempi.\nwow, ultimamente in bronzo ci sono delle vayne davvero forti! kappa. in questo caso viene usato in modo sarcastico.\nsei con i tuoi amici,(tra i tuoi amici c'è anche una ragazza)ad un certo punto questa suddetta ragazza si prende un doppio cheeseburger. prova a morderlo ma non ci riesce, e dice esatte parole \"cavolo, è troppo grande\". ad un certo punto nella stanza si crea un'aura piena di doppisensi e fetishismo e iniziate a guardarvi in questo modo. http://i.imgur.com/6CbxaPc.jpg \n\necco che cosè kappa! ALL HAIL LORD KAPPA \nhttp://web.archive.org/web/20150612084019/http://a.pomf.se/yshzde.gif","replies":[{"poster":"Giorgio di villa","date":"2015-09-17T18:04:17.521+0000","up_votes":1,"down_votes":0,"body":"Ok buono a sapersi\n(Quindi ho ricevuto insulti per mesi senza saperlo :D)","replies":[]}]},{"poster":"Best Chair Euw","date":"2015-09-17T14:10:32.174+0000","up_votes":1,"down_votes":0,"body":"Wukong/irelia. \nLui spamma boomerang e rompe i maroni?questi due li rompono di più. \nCon i champion che hai nominato non dovresti avere grosse difficoltà. L'importante secondo me è evitare di prendere danno proprio dal boomerang che è facile da evitare. Tieni d'occhio la sua barra di furia e tieni le dovute distanze in prossimità di megagnar.","replies":[{"poster":"Giorgio di villa","date":"2015-09-17T18:02:33.086+0000","up_votes":1,"down_votes":0,"body":"Ok grazie \nAllora inizierò a provare wukong top","replies":[]}]},{"poster":"Djblando","date":"2015-09-17T14:29:49.690+0000","up_votes":1,"down_votes":0,"body":"Con {{champion:24}}, in realta puoi battere abbastanza facilmente gnar: come prima cosa starta con{{item:1055}} oppure {{item:1036}} e {{item:2003}} e come prima skill da prendi la Q e maxala per prima.\n\nIn linea cerca di killare subito i primi 2/3 minion per caricare la passiva e una volta fatto INGAGGIA gnar. Immagini che giochi le rune AD su jax, quindi stai tranquillo che in questo primo trade gli farai più danno di lui.\n\nI primi 3 livelli sei MOLTO più forte di lui, e ingaggialo non appena puoi, una volta presa la prima kill sara facile snoballarlo.\n\nPS: quando attivi la E ricordati di muoverti sempre in avanti.\n\nQuesto è il video di un D1 mentre spiega come usare {{champion:24}}, in quell'occasione aveva contro proprio uno {{champion:150}}.\n\nhttps://www.youtube.com/watch?v=VyaeAHYjj3Y","replies":[{"poster":"Giorgio di villa","date":"2015-09-17T18:01:13.658+0000","up_votes":1,"down_votes":0,"body":"Il video lo avevo già visto\nÈ stato proprio grazie a terenas se ho iniziato a marinare jax\nGrazie dei consigli","replies":[]}]}]}