{"poster":"Zeraphy","date":"2015-09-26T12:18:07.770+0000","title":"PROJECT FIDDLESTICKS","subforum":"Campioni e gameplay","up_votes":4,"down_votes":1,"body":"Ciao a tutti sono un giocatore italiano di LoL, evocatore Zeraphy al vostro servizio, se a come me tenete a cuore i vostri champs preferiti, oggi vi presento il mio PROJECT FIDDLESTICKS...scusate lo stupido gioco di parole...\nCome ben tutti sapete fiddlesticks &egrave; un campione unico con abilit&agrave; e caratteristiche veramente &quot;terrificanti!!!&quot;...ridete, era un bel gioco di parole ^^.\nA parte gli scherzi a molti piace fiddlesticks e molti lo odiano e lo vogliono nerfare e tutti hanno sempre qualcosa da dire quando giocano con/contro di lui. Nonostante abbia avuto i suoi anni d&#039;oro non &egrave; rimasto sulla scena del gioco a livello professionale e ogni champ viene preso in considerazione ricevendo almeno un paragrafo nelle patch mentre fiddle nessuno se lo cuna nessuno da tempo. \nIo sono un affezionato giocatore dalla stagione 3 e fiddle &egrave; stato il primo champ che ho preso e ho assistito inerme alle varie modifiche che ha subito, quasi costringendomi a smettere di usarlo dato che ormai nella nuova giungla non trae beneficio da nessun oggetto (runeglaive particolarmente ). Dopo di questo ho provato a usarlo support dove non esprime al meglio il suo potenziale dato cha va buildato full ap e sono giunto a una conclusione: fiddlesticks ha bisogno di un rework. E ora vi prover&ograve; a spiegare perch&eacute; la penso cos&igrave;.\nPrima di tutto le sue abilit&agrave; sono quasi tutte a target tranne la ultimate, questo lo rende particolarmente efficace dato che non rischia di mancare qualcuno, cosa che capita spesso con gli skillshot, portando a pensare che l&#039;unica cosa che si potesse fare fosse nerfare le singole abilit&agrave;: silence ridimensionato dal punto di vista dei rimbalzi, terrify ridotto di 0,75 secondi ecc.\nPer non parlare della passiva, spostata da aura a attivazione conseguente a danni magici inflitti, e sempre di 10, solo 10 flat, che early game forse sono qualcosa ma lategame non viene nemmeno compensata dalla magic resistance data dalle rune rendendola sostanzialmente inutile.\nDetto questo mentre mi ingegnavo su come potesse rinascere il mio champ preferito dopo anni nella tomba (giuro che se mi approvano questo rework compro la skin risen fiddle XD ) mi sono venute delle idee, andando in ordine:\n\nPASSIVA &ndash; il prossimo attacco di fiddlesticks silenzia il bersaglio per 1 sec questo effetto non si pu&ograve; applicare sullo stesso bersaglio ogni X sec, aumenta a 1,5/2/2,5 sec ai livelli 6/11/16.\n\nQ &ndash; rimosso target, introdotto skillshot range (550) fiddlesticks scatta nella posizione bersaglio spaventando il primo bersaglio colpito per 0,5/1/1,5/2/2,5 e infliggendo 30/50/70/90/110 + 45%AP danni magici ad area (175) intorno al bersaglio. Cooldown X\n\nW &ndash; nessuna modifica alle sue meccaniche di cura. Cooldown X\n\nE &ndash; rimosso target, introdotto danno ad area con indicatore range (850) larghezza AoE (400) fiddlesticks scatena il vento oscuro sui suoi nemici dopo 0,25-1 sec di ritardo che aumenta con la distanza tra lui e il punto di arrivo e rallentandoli del 20/25/30/35/40% per 1/1,25/1,5/2/2,25 secondi infliggendo 60/80/100/140/160 + 45%AP danni magici nell&#039;area. Cooldown X\n\nR &ndash; passiva: riduce la resistenza magica dei nemici attorno a se (come la vecchia passiva ad aura) del 10% 20% 30% ai livelli 6/11/16 questo effetto si disattiva quando la tempesta di corvi &egrave; in cooldown.\n      attiva: nessuna modifica alla cara vecchia tempesta di corvi!\n\nE ora il gran finale: raggio di attacco ridotto da 480 a 175. OMG FIDDLE MELEE REPROT!!!!!!!!1!1!!UNO!\n\nSpiegazzzzzzzzioni: \ninnanzitutto secondo me con questo kit potrebbe trarre beneficio dal potenziamento runeglaive dell&#039;oggetto giungla, dato che fiddle bene o male da il meglio l&igrave; pi&ugrave; che in corsia,  poi gli darebbe un po&#039; di pi&ugrave; di mobilit&agrave; siccome dovendo stare fermo dei secondi a risucchiare vita almeno avrebbe uno strumento in pi&ugrave; per spostarsi velocemente nella giungla sua o avversaria.\nOra avrebbe una curva di accrescimento pi&ugrave; regolare e meno incentrato sul raggiungimento del livello 6 per delle imboscate dandogli un kit efficace anche a livello 2  rendendolo molto pi&ugrave; pericoloso ai livelli bassi e non solo lategame. Come avrete ben notato non ho messo i cooldown perch&eacute; indicativamente andrebbero tutti aumentati un pochino rispetto a quelli attuali specialmente il drain  e forse certe statistiche andrebbero ridimensionate introducendo cos&igrave; altre varianti di build magari pi&ugrave; sulla utility cdr / tanky se qualcuno lo volesse giocare support per esempio. \nPoi, questo &egrave; solo un bozzetto, siete liberi di prendere spunto e migliorare quest&#039;idea, evolverla e farla spargere nella community affinch&eacute; possa pervenire tra le mani di qualcuno che pu&ograve; fare qualcosa a riguardo dato che sono sicuro non sono l&#039;unico che crede che fiddlesticks richieda un aggiornamento adatto alla stagione 5 o 6 cos&igrave; come sono sicuro  che in molti mi diranno che &egrave; un idea di @#*%&amp; e lui se ne sta bene cos&igrave; e guai a chi lo cambia. \nVi potr&agrave; sembrare strano e decisamente drastico come ridimensionamento ma io oggi sto solo cercando di esprimere la mia opinione e la speranza muore quando muoiono le idee, quindi io intanto metto nero su bianco le mie poi se qualcuno le condivide bene senn&ograve; fa niente. Se state leggendo questo grazie della pazienza vuol dire che un pochino vi ha interessato quello che avete visto, buona giornata e buona fortuna nelle Arene della Giustizia!","replies":[{"poster":"Empty allows","date":"2015-09-27T20:49:32.915+0000","up_votes":2,"down_votes":0,"body":"Mi piace il fatto che Fiddle sia l'unico champ ad avere tutte le spell a target.\nOnestamente non lo farei cambiare, è un po' una Sona nella giungla, dove il kit in sé è molto semplice, ma per usarlo bene ci vuole molto più tempo di quel che si pensa.","replies":[{"poster":"Zeraphy","date":"2015-09-28T16:53:59.195+0000","up_votes":1,"down_votes":0,"body":"Tutto vero. Sono in ogni caso deluso dalla passiva...credi che la mia sia veramente una brutta idea?","replies":[{"poster":"Empty allows","date":"2015-10-01T19:45:22.865+0000","up_votes":1,"down_votes":0,"body":"Che la passiva di fiddlestick al momento sia davvero inutile siamo d'accordo.\nPerò sai... Questa qui non mi convince tanto... Un silence sugli AA avrebbe un minimo di senso se fiddle rimanesse ranged, ma melee... gneh. Praticamente per applicare due secondi di stun dovresti correre troppi rischi, anche per il fatto che fiddle non dovrebbe avere chissà quali resistenze (Chi lo sà, magari si trasforma in un ap-tank).\nA mio parere Fiddle è un ottimo champ, ora come ora, l'unico problema è l'itemizzazione in giungla (Ti ricordo che in pre-season, quando ancora c'era il Magus, Fiddlesticks era god tier)","replies":[]}]}]},{"poster":"BluFoxer","date":"2015-11-29T09:10:59.611+0000","up_votes":1,"down_votes":0,"body":"Scusate per il delay, ogni tanto ricontrollo i topic con il nome del mio cuore presente.\nInnanzitutto su questo forum non potete parlare parlare di Fiddle senza che io ne sappia nulla, come cita il paragrafo 3, sezione 7bis del contratto di licenza Riot (quello su cui premete \"accetta \"dopo ogni patch) \"IL CAMPIONE FIDDLESTICKS È DI ESCLUSIVA PROPRIETÀ DI BLUFOXER E SOLO LUI DETIENE IL DIRITTO A ESSERE CONSIDERATO IL SUO PIÙ AFFEZIONATO EVOCATORE\" \nDetto questo, uso Fiddlesticks mid praticamente da sempre, scasso tutti e nessuno mi batte.\nIl tuo \"rework\" mi sembra un pò troppo stravolgente, abbassare il range di AA è una pazzia, l'unica cosa che mi potrebbe sembrare opportuna è far fare danno al Fear, purchè rimanga sempre a target. Non mi è mai andato giù il fatto che la Riot abbia tolto l'applicazione del silenzio a ogni rimbalzo del corvo della E. Questo penalizzò molto Fiddle. Quello che vorrei per lui sarebbe una passiva diversa tipo che ogni tot di abilitá, il prossimo cc aumenta di durata di qualche secondo; ad esempio dopo aver usato almeno 3 abilità il Fear o Il Silence durano 0,75 secondi in più (non permanente, ogni volta che accumula 3 cariche, tipo come la passiva di Annie) poi sarebbe opportuno ridurre il channel della Ulti, esistono ulti molto più sgrave senza un minimo di channel, e sarebbe opportuno ridurre i costi di mana e la mana reg, adesso che le pozze del mana sono solo un ricordo. La E che hai proposto tu mi sembra davvero strana perchè implicherebbe a Fiddle di Rimanere in zona invece che lanciare il corvo e scappare. \nQuesto è quello che penso. \nNon per essere antipatico ma io ho tutte le skin di Fiddle, giusto per farti capire il mio livello di fanatismo nei suoi confronti.\n{{champion:9}}","replies":[]},{"poster":"iè na vit amàr","date":"2015-09-29T00:35:45.494+0000","up_votes":1,"down_votes":0,"body":"beh devo dire che la fantasia non ti manca, complimenti per il vario assortimento di cambiamenti. sarei molto curioso di provarne una versione del genere. Magari avrei esteso il Fear ad area un po' come la ultimate di kennen e di katarina, che ne sceglie massimo 3. e quel attacco magico della E non mi convince tanto, forse lo slow lo caricherebbe di troppi CC, magari creare appunto un'attiva sull'autoattack che acquisisce danno magico e silenzia come dicevi per la passiva generale. A quel punto bisognerebbe ridistribuire equilibrio sulla passiva e perché no? una sorta di zhonya automatica che ti si attiva quando raggiungi un basso margine di vita. E per la passiva della tempesta di corvi dare un bonus alla velocità di movimento in base al numero di campioni colpiti all'impatto del teletrasporto della stessa. Per quanto riguarda il Drain, aumentare tutte le statistiche di danno e di rigenerazione vita ad ogni mezzo secondo che questa W è attiva sul nemico. Insomma ho recuperato la tua idea e l'ho incasinata del tutto ahahah. anche Fiddlesticks è il mio champ preferito, ho la skin da bandito e quella da capitano barbone ubriaco. utilizzarlo con gli amici mi diverte molto di più, perché è più facile tendere imboscate comunicando su ts. infatti molto spesso tendo a fregarmene dell'adc e carrio a bestia anche da supp buildando full ap e stilando la farm con i corvi, ma queste sono altre storie di alto trollage... xD Per quanto riguarda la giungla c'è stato un periodo che la iniziavo col doran's ring e buildavo come cristo comanda. da adesso mi compro la lama da giungla e poi la lascio stare lì com'è e vado subito di scarpe magiche o bastoni per zhonya. se il team è attento e riesci a pingare un sacco prima di arrivare escono delle bellissime gank, giacché l'alleato diva direttamente su di lui e tu lo puoi zonare finquando non torna alla torre, mentre gli lanci qualche silenziatore per non farlo flashare subito e guadagnare terreno per il terrore, ed iniziare a ciucciare vita. Late game semplicemente ti posizioni dove devi e cambi le sorti di qualsiasi match. l'importante è avere un team solido che gira in 5; (il ramoscello sempre nascosto, di trinket rosso) e niente..\nTuttavia penso che questi cambiamenti per Fiddle siano troppo drastici. nel senso che cambiare tutto il kit delle skill lo renderebbe più sofisticato e raggiungibile da tutti, non so se mi spiego. Con lui mi sono carriato fino al gold giocandolo sia Mid giungla e supporto e devo dire che molte volte puoi davvero cambiar le sorti dei match, giacché con molti support tank una volta che il team avversario è fiddato da schifo non può fare altro che difendere in maniera vana gli alleati, per una morte più lenta e dolorosa, contornata da flame epici. [Da support] Però ricordo che quando vedevo che stavamo iniziando a perdere raccoglievo le redini del match ed iniziavo a farmare per conto mio e buildare danni a palate in modo tale da rendermi incisivo contro team avversario, e mettere a segno danni come un quinto giocatore valido, nel momento giusto in cui il team avversario si raggruppa mid per punzechiare la torre e fare qualche passo sbagliato, pingare sempre come un forsennato per farsi notare e mettere a segno una ultimate risanatoria.\nForse con la nuova modalità di cui parli tu, Melee andrebbe buildato semplicemente Tankosissimo, alla Gragas, e scagliare tutti i CC possibili sugli avversari e infliggere malus spaventosi con la passiva della ultimate, e come se non bastasse attivarla per generare ulteriori danni visibili. \ngiocandolo support (con il tuo kit) uscirebbe così: {{item:3069}} {{item:2045}} {{item:3800}} {{item:1327}} {{item:3742}} . Già così mi spaventa solo a pensarci..! L'ultimo item totalmente a piacere, forse la staffa ghiacciata per rallentarli ulteriormente e sovrabbondare di vita {{item:3116}} oppure applicare un Eco Luden per corere ancor più velocemente e inseminare il cervello avversario di terrore istantaneo; ancora una zhonya per sfrasciare alla grande di armatura, oppure un abyssal per avere un predominio totalmente tank.","replies":[{"poster":"Zeraphy","date":"2015-09-29T16:55:23.447+0000","up_votes":1,"down_votes":0,"body":"Wow! mi è piaciuta molto questa critica costruttiva mi hai fatto ragionare su quanto estremo potesse essere come rework, forse non mi sono reso conto di quanto sbilanciato diventerebbe fiddle dovendo comunque rimanere un champ squishy. mi hai dato molto da pensare e mi piacerebbe molto sentire il parere di altri utenti sempre che qualcuno si decida a commentare come hai fatto tu ^^ in fondo, ho solo buffato un champ forse XD","replies":[]}]},{"poster":"A Yordle ln Heat","date":"2015-09-26T12:28:04.560+0000","up_votes":1,"down_votes":0,"body":"Cioè ... Vuoi trasformare Fiddlesticks da un mago puro in un assassino/bruiser melee ap ibrido?","replies":[{"poster":"Zeraphy","date":"2015-09-26T12:37:28.193+0000","up_votes":1,"down_votes":0,"body":"diciamo che come me l'hai messa giù tu diventa Diana2LaVendemmia (il che non è male) anche se no il mio intento non è quello, tank non tanto cmq ha ancora statistiche da champ deboluccio, resta un mago assassin come prima, cambia molto il gameplay. una build cdr tanky sarebbe più adatta se uno lo prende in corsia superiore o botlane, almeno avrebbe un po' più di varianti. ibrido mi sa non funzionerebbe lo lascerei full ap. ","replies":[]}]}]}