{"poster":"LA FLAKI 4L","date":"2018-05-30T10:46:32.660+0000","title":"POR QUE ESE ODIO MAESTRO YI ?","subforum":"Charlas Generales","up_votes":3,"down_votes":3,"body":"se que suena tonto al decirlo pero ya un se hace un doble kill y ya sale a flamear lo insultarlo y demás cosas y peor si eres M7 sos el peor del mundo por tener a {{champion:11}}  en  la maestría mas alta. al principio me molestaba un poco por uno juega lo que quiere en el juego o lo que le sea mas cómodo a la hora de matar el tiempo. ahora no me molesta tanto por cuando del otro lado a {{champion:11}} y lo juegan bien me da mucha risa y algo de asquisto cuando timen bien las habilidades, pero es un champ como cualquier otro con algo de cc en tu equipo y buena coordinación  lo paras en seco aparte tiene millones de couter osea no entiendo por que ese odio insano y insulto sin sentido cuando se le puede vencer en un {{summoner:4}}.   pd: soy M7 con {{champion:11}} con 400k de maestria {{sticker:slayer-jinx-wink}}, un cuando me hago un penta con el por mas de que diga que es fácil yo me siento  tan{{sticker:sg-jinx}} y me dan mas ganas de jugarlo.","replies":[{"poster":"rokushoger","date":"2018-05-30T11:01:15.547+0000","up_votes":4,"down_votes":1,"body":"La \"lógica\" detrás de eso es que está visto como un campeón sin mecánicas y sienten injusto perder contra él. En realidad lo que sucede es que les frustra que seas mejor que ellos, sea con yi o con otros, y buscan excusas para \"no tener la culpa\" de que los apalees, y encontraron esa excusa cuando es un yi.","replies":[]},{"poster":"Yitán","date":"2018-05-30T11:57:41.874+0000","up_votes":2,"down_votes":0,"body":"supongo que porque con 2 items menos te hace el 2 vs 1 y quizas te gana","replies":[]},{"poster":"Sonne","date":"2018-05-30T15:41:51.394+0000","up_votes":1,"down_votes":0,"body":"Yo también le tengo un poquitito de asco a Yi, el mismo asco que le puedo tener a Trynda y a Vayne. Sin embargo, Yi es incluso más parable que esos dos. La única manera de que ese champ se vuelva invencible que no haya CC. Si no tenés eso... A feedear se ha dicho! :P\n\nA todo esto, cada uno juega a su manera y con lo que más le parece cómodo. Yo considero que Yi no coordina con mi estilo de juego y siquiera lo uso por eso, pero si a vos te encanta entonces no te hagas drama por lo que digan los demás. Ignoralos a todos y seguí feliz! :3","replies":[]},{"poster":"POETA DEL RAYO","date":"2018-05-30T15:40:34.350+0000","up_votes":1,"down_votes":0,"body":"Mmm será por que pikeo maestro yi de doble jg y al min 10 tengo 8 kills. Y me hago una pentakill de la nada....","replies":[]},{"poster":"Patriicio rey","date":"2018-05-30T13:15:24.674+0000","up_votes":1,"down_votes":1,"body":"Lo mas gracioso es que dicen que es fácil y también si apretas q ya te mandas un triple, si fuera asi tuviera mínimo el 95% de winrate, pero no, la mayoria de los yi contra lo que juego pierden","replies":[{"poster":"Phaedra","date":"2018-05-30T15:40:03.319+0000","up_votes":1,"down_votes":0,"body":"Que buenos recuerdos de yi AP...haciendo triples con una sola Q {{sticker:sg-jinx}}","replies":[]}]},{"poster":"Sirek","date":"2018-05-30T13:59:47.699+0000","up_votes":1,"down_votes":1,"body":"Lo odian porque las mecánicas del campeón son faciles (R+ Click derecho +  Q + E), pero eso no quiere decir que va a ser izi el juego, ya que Yi es de papel.","replies":[]},{"poster":"bombastico","date":"2018-05-30T12:58:40.655+0000","up_votes":1,"down_votes":1,"body":"Porque dicen que es un campeon sin manos, cuando son ellos que, siendo mancos, usan campeones complejos xD","replies":[]},{"poster":"KING BRADLEY IRA","date":"2018-05-30T11:46:18.356+0000","up_votes":1,"down_votes":1,"body":"Pasa con yi , zed , darius , etc la gente no sabe jugar a farmear o pelear cuando au campeon tiene ventaja lo que hacen empujar la linea sin vision como enfermos y fedear al equipo enemigo liego llega uno de estos sujetos fedeado y los deletea de una habilidad y es hay donde llegan los lloros de \"esta roto nerfeenlo\" claro si ellos mismos los rompen en sus partidas.","replies":[]},{"poster":"ed9 ","date":"2018-05-30T12:28:10.089+0000","up_votes":1,"down_votes":2,"body":"El problema no es qué campeón usa, sino quién lo usa.\n\nLa gran mayoría de la gente que juega ese tipo de campeones ({{champion:11}} {{champion:238}} {{champion:122}} {{champion:23}} {{champion:92}} {{champion:157}} {{champion:67}}) son bastante tóxicos, por lo cual es lógico que la gente empiece a odiarlos cuando lo ven, ya sea en el equipo aliado o enemigo.","replies":[]}]}