{"poster":"Hell Darking","date":"2017-07-05T21:06:50.117+0000","title":"Cual es la mejor skin de riven?","subforum":"Charlas Generales","up_votes":3,"down_votes":2,"body":"Obviando la que salio para el evento, es que me salio la espada dragon en las cajas hex y queria saber si vale la pena o no\r\nantes decian que era la de campeonato pero como que salio denuevo y ahora todos la tienen","replies":[{"poster":"Roadkill","date":"2017-09-20T01:05:12.066+0000","up_votes":1,"down_votes":0,"body":"yo solo tengo la skin de riven conejita guerrera aunque la verdad todas son geniales menos élite carmesí a mi parecer :)","replies":[]},{"poster":"lllHeisenberglll","date":"2017-07-05T22:39:02.251+0000","up_votes":1,"down_votes":0,"body":"Si tenes dudas en si sacar la skin de Riven espadragon o no. Obviamente hacela, es una muy hermosa skin. Yo diria que junto a la de Arcade son las mejores, obviamente no estoy tomando en cuenta la ultima sacada de ella.","replies":[]},{"poster":"Go to play","date":"2017-07-05T22:34:29.495+0000","up_votes":1,"down_votes":0,"body":"Buenas, yo evidentemente soy main riven. y sinceramente a las skins me inspiran momentos, yo uso mucho a la portadora ahora que esta, me encanta. tambien uso a la conejita, arcadia, redimida y sin skin. depende la spiracion que sienta a cada skin. pero te digo que a mi la skin de riven espada dragon me encanta, pero nose porque me apaga mi juego. tengo todas las skins de riven. y la nueva me encanta. la de arcadia me dio muchas victorias asi de loco q pueda parecerte, las espada dragon me han hecho perder mas de las que gane. y la redimida, y la conejita me han hecho ir normal. la portadora del amanecer me ha dado varias victorias de momento.\n\nSaludos.","replies":[]},{"poster":"Akusai","date":"2017-07-05T21:24:32.157+0000","up_votes":1,"down_votes":0,"body":"me salio riven espadragon en el orbe del evento vs. y la la volvi permanente sin dudarlo porque en mi opinion es de las mejores skins que tiene riven y eso que no soy de jugara de hecho me la tuve que comprar para poder tener el skin xD","replies":[{"poster":"YütaKulia","date":"2017-07-05T22:23:14.735+0000","up_votes":1,"down_votes":0,"body":"jaja xD igualmente me encanta la skin \n\nhttps://i.gyazo.com/c5eeb79d1a046bade68ccb2c2c7e4024.png","replies":[]}]},{"poster":"Jynxwenwencha","date":"2017-07-05T22:22:34.252+0000","up_votes":1,"down_votes":0,"body":"Tengo Riven espada dragón/arcade y portadora del amanecer y cada vez me convenzo más, al skin de conejita no hay con que darle, es de las mejores y mas sencilla, no esta sobrecargada como dawnbringer.","replies":[]},{"poster":"YütaKulia","date":"2017-07-05T22:19:53.010+0000","up_votes":1,"down_votes":0,"body":"Mira soy main riven.\n\nLa mejor skin de riven es la que tu quieras xD pero la skin de Riven portadora del amanecer es como que esta rara como que no se siente igual que las normales me explico? , es decir los Riven player decimos eso por que cuando salio Yasuo proyecto se sentía raro igual y rito luego dijo que si estaba bug , que los básicos eran mas lentos y la Q salia después , por eso no te recomiendo usar la portadora , yo la tengo pero no la uso mucho xD.\n\nEn fin , pues eso decide tu cual quieras que sea la mejor skin de riven c: , en lo personal mi favorita es la de campeonato y la redimida\n\nhttps://33.media.tumblr.com/5342f60763f640041f54c140cb9afb46/tumblr_n2usc22CDz1ssg9yfo1_500.gif\n\nadiós y suerte!","replies":[]},{"poster":"PBE","date":"2017-07-05T21:56:14.466+0000","up_votes":1,"down_votes":0,"body":"tengo arcade riven. pero en mi opinion me gusta mas conejita guerrera.","replies":[]},{"poster":"R1den","date":"2017-07-05T21:35:05.283+0000","up_votes":1,"down_votes":0,"body":"En lo personal me gusta mucho riven redimida","replies":[]},{"poster":"faster51","date":"2017-07-05T21:34:19.704+0000","up_votes":1,"down_votes":0,"body":"fijate en [skin spotlights](https://www.youtube.com/user/SkinSpotlights) y fijate cual te gusta más","replies":[]},{"poster":"Brightram","date":"2017-07-05T21:24:28.529+0000","up_votes":1,"down_votes":0,"body":"Me gusta la de conejita, tiene animaciones doradas, le da un toque más \"brillante\" al personaje.","replies":[]},{"poster":"Suní","date":"2017-07-05T21:24:07.646+0000","up_votes":1,"down_votes":0,"body":"Bueno, en opinion personal la \"Mejor\" es la Riven espada dragón, pero es tu decisión. (?","replies":[]},{"poster":"stonerock","date":"2017-07-05T21:11:31.470+0000","up_votes":1,"down_votes":0,"body":"Las skins tuyas las vas a ver vos, no nosotros, te tienen que gustar a vos!\nEn mi caso la que mas me gusta es la que te toco, arcade, y despues de campeonato (no me gusta mucho el color azul)","replies":[{"poster":"Hell Darking","date":"2017-07-05T21:17:24.220+0000","up_votes":1,"down_votes":0,"body":"si se eso, era una duda.. porque casi siempre veo que preguntan \"cuando sale X skin\" \"X skin de riven es la mejor, cuando estara en la tienda\" y blabla.. queria saber si era esa","replies":[]}]},{"poster":"Its Hero Time","date":"2017-07-05T21:14:43.520+0000","up_votes":1,"down_votes":0,"body":"La de arcade es la mejor :D","replies":[]}]}