{"poster":"sctty","date":"2019-02-10T17:00:48.268+0000","title":"14 Tage bann für Amnahme das mein Support wintraded","subforum":"Spielerverhalten & Moderation","up_votes":4,"down_votes":8,"body":"Hallo, liebe leute nur mal so eine Frage, wird man 14 Tage gebannt wenn man im Chat fragt ob jemand wintraded und 2 mal das Wort idiot reinhaut, also ich hab freunde die schreiben das F und N wort in den chat und bekommen halt keine beachtung, und das auch nur in 1nem game. Falls ihr noch weitere Details braucht Antworte ich euch gerne. Am Ende meinte der Brand das er micht auf jeden fall gebannt gekriegt.\r\n\r\nGame 1\r\nPre-Game\r\nDevilmans Crown: wow\r\nDevilmans Crown: im outpicked\r\nDevilmans Crown: i guess\r\nIn-Game\r\nDevilmans Crown: ty\r\nDevilmans Crown: IVE SEEN THAT\r\nDevilmans Crown: Xd\r\nDevilmans Crown: can u guys stop argueing ?\r\nDevilmans Crown: just mute each other pls\r\nDevilmans Crown: ty\r\nDevilmans Crown: yeah report mf pls ty\r\nDevilmans Crown: afking\r\nDevilmans Crown: u dont need mana for moving\r\nDevilmans Crown: and cait couldnt move bcs she was low\r\nDevilmans Crown: ur 1/4\r\nDevilmans Crown: explain that dumbass\r\nDevilmans Crown: u guys...\r\nDevilmans Crown: atleast the 3 of us have some competence\r\nDevilmans Crown: and knowledge about how to play this game\r\nDevilmans Crown: WHAT\r\nDevilmans Crown: i mean what can i do\r\nDevilmans Crown: she dashed out of my range 3 times\r\nDevilmans Crown: i actually dont know how my r didnt deal any dmg to you thresh\r\nDevilmans Crown: wtf are u bming me for\r\nDevilmans Crown: shes 7/1\r\nDevilmans Crown: with ie already\r\nDevilmans Crown: critting me 3 times\r\nDevilmans Crown: this brand is toxic lol\r\nDevilmans Crown: lol\r\nDevilmans Crown: ok\r\nDevilmans Crown: i dont think we get freelo against a 9/1 caitlyn\r\nDevilmans Crown: gj\r\nDevilmans Crown: 1*\r\nDevilmans Crown: ur actually retarded\r\nDevilmans Crown: he ganked you guys once\r\nDevilmans Crown: wtf are u doing ??\r\nDevilmans Crown: inting and then taking my creeps\r\nDevilmans Crown: ok\r\nDevilmans Crown: 2 shot me cait\r\nDevilmans Crown: ok\r\nDevilmans Crown: ff 20 pls\r\nDevilmans Crown: this botlane solo lost this entire game\r\nDevilmans Crown: holy sht\r\nDevilmans Crown: report brand for intentionally feeding and blaming his teammates\r\nDevilmans Crown: this elo mixup is retarded\r\nDevilmans Crown: only playing with silver-bronze botlanes\r\nDevilmans Crown: thresh\r\nDevilmans Crown: u guys wintrading ?\r\nDevilmans Crown: 2/9 xDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDD\r\nDevilmans Crown: tard\r\nDevilmans Crown: idc ??\r\nDevilmans Crown: probably\r\nDevilmans Crown: but i only flame ppl who deserve\r\nDevilmans Crown: has 25% crit chance\r\nDevilmans Crown: Crits 0 times on 5 autos\r\nDevilmans Crown: yikes\r\nDevilmans Crown: 18/1\r\nDevilmans Crown: oof\r\nDevilmans Crown: ur definately wintrading with thresh lol\r\nDevilmans Crown: 13 deaths in a ranked\r\nDevilmans Crown: how can that not be intentional\r\nDevilmans Crown: just facts\r\nDevilmans Crown: how old are u actually\r\nDevilmans Crown: 12 ?\r\nDevilmans Crown: i didnt say anything insulting\r\nDevilmans Crown: except that u are a tard\r\nDevilmans Crown: taking toplane kurgs while we are losing\r\nDevilmans Crown: oof\r\nDevilmans Crown: ye not gonna play ranked anymore till this bronze support played his placements\r\nDevilmans Crown: and brand\r\nDevilmans Crown: thats not flaming\r\nDevilmans Crown: thats spitting facts\r\nDevilmans Crown: at you\r\nDevilmans Crown: so u start inting as soon as somebody is flaming you ?\r\nDevilmans Crown: ye im definately gonna get perma banned for thbis\r\nDevilmans Crown: for sure\r\nDevilmans Crown: for saying tard and dumbass\r\nDevilmans Crown: how does it work\r\nDevilmans Crown: tell me ?\r\nDevilmans Crown: 8/7 and 4/15 is a big difference\r\nDevilmans Crown: this bot is a huge clown fieste\r\nDevilmans Crown: fiesta\r\nDevilmans Crown: cool\r\nPost-Game\r\nDevilmans Crown: report brand for inting and verbal abuse ty\r\nDevilmans Crown: never said that lol\r\nDevilmans Crown: but he has twice the deaths i do\r\nDevilmans Crown: probably\r\nDevilmans Crown: how am i pathetic\r\nDevilmans Crown: i will get perma\r\nDevilmans Crown: but not from a dumbass liek you\r\nDevilmans Crown: like you\r\n\r\nDas ist der ganze Chatlog\r\nUnd die leute die ich kenne und gebannt worden sind haben wie gesagt öfters das n und f wort benutzt.\r\nUnd nicht 3-4 mal dummkopf/dummarsch.","replies":[{"poster":"Pure Cynicism","date":"2019-02-10T17:17:22.595+0000","up_votes":6,"down_votes":0,"body":"> Devilmans Crown: explain that dumbass\n> Devilmans Crown: ur actually retarded\n> Devilmans Crown: but not from a dumbass liek you\n\nIch vermute mal eher, dass dein Bann daher kommt. Die ganze Zeit über nur weinen und beleidigen. Du bist schon ein echt unangenehmer Mitspieler. Und du glaubst wirklich, dass der Vorwurf des Wintradings der Grund war? Lol.","replies":[{"poster":"naotaa","date":"2019-02-10T17:19:59.787+0000","up_votes":2,"down_votes":1,"body":"Bei dem brand hätte man davon ausgehen können das er am Wintraden war","replies":[{"poster":"MeMyselfandBaal","date":"2019-02-10T18:52:33.175+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=naotaa,realm=EUW,application-id=KYnfKGf0,discussion-id=562mTUUW,comment-id=00030000,timestamp=2019-02-10T17:19:59.787+0000)\n>\n> Bei dem brand hätte man davon ausgehen können das er am Wintraden war\n\nErstens: Warum muss man, selbst wenn man davon ausgeht, einen derart langen Chatlog abliefern? Also wenn dein Kumpel diese Befürchtung ein Mal in den Raum stellt und danach weiterspielt, anstatt seinen Frust freien Lauf zu lassen, passiert ihm auch nichts. Aber er entscheidet sich dafür, seinen Mitspieler konstant zu beleidigen. Das dürfte er nicht mal, wenn er mit dem Wintrading Vorwurf recht hätte.\n\nZum anderen: Weißt du überhaupt, was wintrading ist? Oder hast du das einfach nur so aufgeschnappt? Also nur so als Grundkurs: Wintrading beginnt dann an Sinn zu ergeben, wenn die Spieleranzahl so gering ist, dass die Wahrscheinlichkeit, dass 2 unabhängig voneinander, gleichzeitig queende, befreundete Spieler denselben Spiel zugewiesen worden werden, extrem hoch ist. Das passiert also in Servern mit geringen Spielerzahlen oder in Extremelos, also Diamond Plus. Dann ist es ein brauchbares \"BoostingTool\", sonst ist es eher nutzlos. Denn Wintrading funktioniert ja nur, wenn man regelmäßig auf dieselben Spieler trifft. Also ich verlinke dir mal ein paar Videos von IWillDominate, [damit du mal siehst](https://www.youtube.com/watch?v=4UlcDrhZddU), [wie Wintrader wirklich aussehen und funktionieren](https://www.youtube.com/watch?v=2xDj7OlWJ1g&amp;).\nIhr habt an einem Sonntag auf EUWest in Gold gespielt... das wären quasi die schlechtesten Voraussetzungen zum Win Traden. Anders ausgedrückt: du versuchst den Flame deines Kumpels mit einem Gespenst zu rechtfertigen, dass nur in eurem Kopf existiert. \n\nDer Brand war halt einfach schlecht. Passiert. Vielleicht war es sein Autofill Spiel, dass er ein Mal im Monat machen muss. (op.gg ist down... von daher ist das für mich jetzt schwer nachzuvollziehen). Oder er ist auf nen gengerischen Smurf getroffen, der ihn gestompt hat. Oder er ist einfach getilted, weil in seinem, eh schon schlecht laufenden, Spiel auch noch dumme Kommentare seiner Mitspieler kamen. Alles Theorien, die wahrscheinlicher sind als \"Das war nen Wintrader\"... just saying.\n\nUnd ob der Brand nebenbei auch toxisch war und eine Strafe verdient hat, wird dessen Chatprotokoll klären. Wenn ihr ihn reported habt, wird er ja auch überprüft.","replies":[]},{"poster":"SuicidePlank","date":"2019-02-10T17:23:04.001+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=naotaa,realm=EUW,application-id=KYnfKGf0,discussion-id=562mTUUW,comment-id=00030000,timestamp=2019-02-10T17:19:59.787+0000)\n>\n> Bei dem brand hätte man davon ausgehen können das er am Wintraden war\n\nJa, und? Muss er ihn deswegen Beleidigungen an den Kopf werfen und die ganze Zeit den Chat vollweinen? \nNach dem Spiel reporten, evtl. beim Support nochmal, aber damit hat es sich. \nNur weil jemand eine Regel bricht darfst du auf einmal auch Regeln brechen, oder was? Ihr wollt doch beide das der Brand eine Strafe bekommt, also hier, der andere Regelbrecher bekam seine ja auch.","replies":[{"poster":"naotaa","date":"2019-02-10T17:28:04.999+0000","up_votes":1,"down_votes":0,"body":"stimmt da gebe ich dir vollkommen recht ich fand das mit dem ban aber doch etwas hart","replies":[{"poster":"SuicidePlank","date":"2019-02-10T17:30:45.853+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=naotaa,realm=EUW,application-id=KYnfKGf0,discussion-id=562mTUUW,comment-id=0003000000000000,timestamp=2019-02-10T17:28:04.999+0000)\n>\n> stimmt da gebe ich dir vollkommen recht ich fand das mit dem ban aber doch etwas hart\n\nNö, er hat schon zwei Warnungen bekommen, wenn er sein Verhalten nicht umstellt ist das alleine sein Fehler, nicht der des Systems.","replies":[{"poster":"Flórian","date":"2019-02-10T17:32:25.565+0000","up_votes":1,"down_votes":0,"body":"Geb dir recht, muss ich einfach akzeptieren.","replies":[{"poster":"Flórian","date":"2019-02-10T17:33:56.514+0000","up_votes":1,"down_votes":0,"body":"Gibts irgendeine Funktion den Chat zu deaktivieren, nicht nur den allchat und mute dingsda. Sonder wirklich einfach nachdem ich undbanned bin damit ich nich gleich wieder meine Haare ausreißen muss ?","replies":[{"poster":"ToxicRedPanda","date":"2019-02-10T17:52:31.859+0000","up_votes":2,"down_votes":0,"body":"/all kann man ausstellen, den eigenen Teamchat nicht. Am Anfang einfach ein /mute all in den Chat und jeder andere ist gemuted. lässt sich aktuell nicht anders regeln und wird sich wohl in naher Zukunft nicht ändern. \n\nBeim mute ist zu beachten, dass du von den anderen nichts lesen kannst, sie aber deine Chatbeiträge lesen können. Also sofern sie dich nicht auch gemuted haben.","replies":[{"poster":"eingew","date":"2019-02-11T07:38:02.026+0000","up_votes":1,"down_votes":0,"body":"Wer noch weiter gehen will und auch die Pings nicht sehen will, der kann auch /fullmute all nutzen.","replies":[{"poster":"ToxicRedPanda","date":"2019-02-11T17:44:31.196+0000","up_votes":1,"down_votes":0,"body":"Ja, allerdings kann ich dann immer noch die Emotes sehen. Gibt es dafür auch einen Chatbefehl?","replies":[{"poster":"Sirrkas","date":"2019-02-11T18:13:10.163+0000","up_votes":1,"down_votes":0,"body":"Ich glaube die kann man irgendwo in den Optionen deaktivieren.","replies":[{"poster":"ToxicRedPanda","date":"2019-02-11T18:24:32.905+0000","up_votes":2,"down_votes":0,"body":"Mal schnell nachgeschaut.\n\nMan kann in den Einstellungen die gegnerischen Emotes muten, jedoch nicht die vom eigenen Team. Naja, der Emotespam bleibt mir meist erspart, zum Glück.","replies":[]}]}]}]}]}]}]},{"poster":"naotaa","date":"2019-02-10T17:31:31.153+0000","up_votes":1,"down_votes":0,"body":"stimmt","replies":[]}]}]}]}]},{"poster":"Flórian","date":"2019-02-10T17:28:13.986+0000","up_votes":1,"down_votes":2,"body":"Naja ich finde nicht das dumbass schlimm ist, ja ich habs oft gesagt , und je mehr ich hier lese desto gerechtfertigter kommt er mir auch vor, da fuchst es mich aber auch mehr das viel schlimmere leute nix kriegen, habt ich halt einfach pech gehabt wies aussieht. Und ja ich weiß das ich ein unangenehmer spieler bin. aber 3 mal ein schimpfwort zu benutzen is meiner meinung auch nicht viel, auch wenns nicht in ein Videospiel gehört. Er hat ja auch die ganze Zeit gemeint :\" I know how to get you permad etc. und ich glaube nicht das mich die anderen teammates, enemies reported haben bei dem was der aufgeführt und herumgelügt hat.","replies":[{"poster":"Flórian","date":"2019-02-10T17:29:23.557+0000","up_votes":1,"down_votes":1,"body":"Auf ich bin actually dumm, hab das mit meinem alten account geschrieben. OOF","replies":[{"poster":"Flórian","date":"2019-02-10T17:31:19.422+0000","up_votes":1,"down_votes":0,"body":"Edit : neuem*","replies":[]}]}]}]},{"poster":"PIS INS3RT N4M3","date":"2019-02-10T17:26:08.127+0000","up_votes":5,"down_votes":1,"body":"Schreibst du noch oder spielst Du schon?","replies":[]},{"poster":"SuicidePlank","date":"2019-02-10T17:15:33.589+0000","up_votes":5,"down_votes":1,"body":"Gejammer und geflame den lieben langen Chatlog entlang.\nKlar, es gibt schlimmeres, doofe Dinge passieren, aber das gibt dir keine Entschuldigung a la ,,Der war auch blöd und sogar noch ganz viel blöder als ich!\".\nGerechtfertigter Bann, zumal ich glaube das du auch vorher schon CRs hattest.\nEinfach mal den Chat in Ruhe lassen, niemanden beleidigen wirkt Wunder.","replies":[]},{"poster":"Angel Ayume","date":"2019-02-10T22:09:58.820+0000","up_votes":3,"down_votes":0,"body":"Woow. Du benötigst aber echt viel Text nur um jemanden eine einzige Frage zu stellen.","replies":[{"poster":"Cenâreth","date":"2019-02-10T22:31:24.687+0000","up_votes":1,"down_votes":0,"body":"Frag mal meinen Draven im Gegnerteam von gestern, der war völlig zerstört am Ende des Games. Keine Ahnung was mit den Leuten hier aktuell abgeht.","replies":[]}]},{"poster":"ºDarth Veigarº","date":"2019-02-10T18:24:54.566+0000","up_votes":3,"down_votes":0,"body":"Du kündigst an dass du AFK gehst, nennst jemanden \"dumbass\" bzw. beleidigst sie auch indirekt (\"u guys...\"), unterstellst ihnen Inkompetenz und dass sie das Spiel nicht können, shamest deine Botlane weil sie wohl gestorben sind, drohst mit Reports weil jemand feedet (Ich weiß nicht ob er das wirklich getan hat, kann ich ja nicht sehen - solches Gemecker bezieht sich aber halt oft einfach nur auf schlechte Spieler, bzw. welche die einfach mal Pech haben in dem einen oder anderen Game und tbh 13 Tode sind nun nicht wirklich ein Beweis für bewusstes Feeden), machst dich weiter über deine Botlane lustig, nennst einen von ihnen mehrmals \"(re-)tard\", gibst zu dass du flamest, unterstellst ihnen dass sie 12 Jährige doofe Kinder wären, nennst ihn dumbass ...\n\nDas ist jetzt das, was mir so aufgefallen ist. :x Ich denke mal, dass da auch direkt mehrere Reports kamen?","replies":[]},{"poster":"HookEmUp","date":"2019-02-11T09:29:45.502+0000","up_votes":2,"down_votes":0,"body":"Wintraden in Gold? Zu ganz normaler Uhrzeit? Wie willst du das denn anstellen? :D","replies":[]},{"poster":"ToxicRedPanda","date":"2019-02-10T17:14:32.374+0000","up_votes":3,"down_votes":1,"body":"Sage mal, hattest du schon die 25er CR? Falls ja kann ich mir vorstellen, dass es für einen 2 Wochenbann reicht. \n\n> Devilmans Crown: i will get perma\n\nNach dem 2-Wochenbann stehen die Chancen dafür gut, sofern du dein Verhalten nicht besserst. Andere Leute als Dumbass und Retard zu bezeichnen ist jetzt auch nichts, was ich gerne im Spiel lese, egal von wem es kommt oder an wen es gerichtet ist. \n\nNach der 2-Wochenbann reichen halt schon kleine Fehltritte und der Account ist komplett weg.","replies":[{"poster":"Flórian","date":"2019-02-10T17:16:35.372+0000","up_votes":2,"down_votes":1,"body":"Andere Leute als Dumbass und Retard zu bezeichnen ist jetzt auch nichts, was ich gerne im Spiel lese.\n\nGebe ich dir schon recht, ja hast du auch, aber wenn leute das F und N wort usen und dafür iwie 0 aufmerksamkeit bekommen, und was meinst du mit 25er cr ?","replies":[{"poster":"ToxicRedPanda","date":"2019-02-10T17:22:18.841+0000","up_votes":2,"down_votes":0,"body":"25er CR ist die Chateinschränkung für 25 Spiele. Die nächste Strafe wäre dann der 2-Wochenbann.\n\nF und N reporte ich immer und beachte es nicht weiter. Oder meinst du mit Aufmerksamkeit, dass keine Rückmeldung kommt, dass jemand eine Strafe erhalten hat? Die kommt nur in den seltensten Fällen.","replies":[]},{"poster":"Flórian","date":"2019-02-10T17:18:38.218+0000","up_votes":1,"down_votes":0,"body":"Auf der anderen Seite bin ich auch froh das er permabanned worden ist :D aber meiner Meinung nach hat das System zu schnell reagiert. Denn ich hab mich im Vergleich zu früher wirklich gebessert.","replies":[{"poster":"SuicidePlank","date":"2019-02-10T17:20:11.588+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Flórian,realm=EUW,application-id=KYnfKGf0,discussion-id=562mTUUW,comment-id=000100000000,timestamp=2019-02-10T17:18:38.218+0000)\n>\n> Auf der anderen Seite bin ich auch froh das er permabanned worden ist :D aber meiner Meinung nach hat das System zu schnell reagiert. Denn ich hab mich im Vergleich zu früher wirklich gebessert.\n\nWurde er ja nicht, nur der 14 Tage Bann kam dadurch.","replies":[{"poster":"Flórian","date":"2019-02-10T17:25:02.528+0000","up_votes":1,"down_votes":0,"body":"Vertausch ich immer, tut mir leid..","replies":[{"poster":"SuicidePlank","date":"2019-02-10T17:26:07.963+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Flórian,realm=EUW,application-id=KYnfKGf0,discussion-id=562mTUUW,comment-id=00010000000000000000,timestamp=2019-02-10T17:25:02.528+0000)\n>\n> Vertausch ich immer, tut mir leid..\n\nLel, kein Stress Kamerad.","replies":[]}]}]}]}]}]},{"poster":"Izaya Kumiho","date":"2019-02-10T18:55:45.416+0000","up_votes":3,"down_votes":1,"body":"________________\n\nNB= negatives Verhalten\nUB= unsportliches Verhalten\n________\n\n>Devilmans Crown: yeah report mf pls ty\n\nNB (Reportcall)\n\n>Devilmans Crown: explain that dumbass\n\nFlaming\n\n>Devilmans Crown: this brand is toxic lol\n\n(Flaming)\n\n>Devilmans Crown: ur actually retarded\n\n* Hatespeech / Flaming\n\n>Devilmans Crown: ff 20 pls\nDevilmans Crown: this botlane solo lost this entire game\n\nGriefing, Blaming\n\n>Devilmans Crown: report brand for intentionally feeding and blaming his teammates\nDevilmans Crown: this elo mixup is retarded\n\nNB (reportcall), Blaming, * Hatespeech / Flaming\n\n>Devilmans Crown: 2/9 xDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDD\n\nDein \"D\" klemmt, btw.\n\n>Devilmans Crown: tard\n\n* Hatespeech / Flaming\n\n>Devilmans Crown: but i only flame ppl who deserve\n\nNB\n\n>Devilmans Crown: ye not gonna play ranked anymore till this bronze support played his placements\n\nFlaming /UB\n\n\n>Devilmans Crown: report brand for inting and verbal abuse ty\n\nNb (Reportcall)\n\n>Devilmans Crown: i will get perma\nDevilmans Crown: but not from a dumbass liek you\n\nFlaming\n______________________________\n**Result:**\n**_Flaming,\nNB (Reportaufrufe),\nGriefing/Trauerstimmung/Aufgeben,\nHassrede_**\n\n_________________________________\n\n* \"Retard\" und \"retarded\" fallen unter Hassrede, da diese zwei Begriffe oft gegen Menschen genutzt werden, die eine Behinderung (meist auf einem mentalen Level) mit sich tragen. (Wortwörtlich heißt es jedoch einfach nur \"verzörgert\". In dem Kontext zu eingeschränkten Menschen, soll es so viel bedeuten wie:\"du bist geistlich zurückgeblieben\".)\n\n**Hassrede fällt unter die 0-Toleranzgrenze von Riot und wird mit einem Tempban sofort bestraft.**\n\n>Devilmans Crown: i didnt say anything insulting\n\n\n\nhttps://i.kym-cdn.com/photos/images/masonry/000/259/943/694.png\n\n>Devilmans Crown: except that u are a tard\n\nhttps://i.imgur.com/xHuKOms.gifv\n\n>Devilmans Crown: ye im definately gonna get perma banned for thbis\n\n...\"yes, probably soon.\".\n\nNach einem Tempban folgt der Permaban. Es reicht bereits ein einziges Wort aus, damit die nächste Strafe ausgelöst wird. Pass also bitte auf deine Worte auf.\nEs ist nur ein Spiel und du kannst auch nicht jede Runde gewinnen. \nWenn die Leute offensichtlich feeden gehen, dann reporte sie nach dem Game, aber rufe nicht extra zu einem Report auf. Es ist genug, wenn du alleine diesen Spieler nach dem Game melden gehst, da das System auf jede Meldung reagiert. Sollte sich dieser Spieler dann wirklich gegen die Regeln verhalten haben, wird er auch eine Strafe bekommen.\n\nVon seiner Strafe wirst du aber nichts erfahren - Privatsphäre und so. \n\n(Natürlich kannst du auch eine Rückmeldung bekommen, aber die wird bewusst selten angegeben und muss **NICHT** mit deinem letzten Report verbunden sein.)","replies":[]},{"poster":"naotaa","date":"2019-02-10T17:05:43.316+0000","up_votes":1,"down_votes":2,"body":"ich war der midlaner im dem game und der brand war wirklich nur am feeden und hat sie die ganze zeit über seine mf beschwert","replies":[{"poster":"ToxicRedPanda","date":"2019-02-10T17:16:19.128+0000","up_votes":4,"down_votes":2,"body":"Und der Grund warum jemand den Chat benutzt ist für das System nicht wichtig. Nur was geschreiben wurde zählt und auch nur von der einzelnen Person. Egal ob jemand Intet oder trollt oder beleidigt.","replies":[{"poster":"Flórian","date":"2019-02-10T17:21:29.997+0000","up_votes":1,"down_votes":1,"body":"Sag ich ja, aber ich hatte letztens einen Yasuo im game der die ganze zeit nigger gespammed hat und er gemeint hat es betrifft ihn sowieso nicht weil er eh Afroamerikaner ist. Warum sollte es mich jetzt betreffen wenn ich ihn 3 mal Dummkopf/Dumbass nenne. Wie gesagt, es ist wichtig was geschrieben wurde, und ich finde überhaupt nicht das ich da überreagiert bzw. ne wirklich harte Beleidigung rausgehauen habe.","replies":[{"poster":"Wernicke","date":"2019-02-11T08:30:17.195+0000","up_votes":1,"down_votes":0,"body":"Du  hast retard geschrieben. Das ist quasi keyword Flame und gehört zu hatespeech. Da darfst du dich über einen 14 Tage bann und/oder ggf übersprungenen Strafstufen nicht wundern.\nÜbrigens würde z.b. auch ein dumbass für einen 14 Tage bann genügen wenn du vorher schon chatstrafen hattest, also die vorherigen Strafstufen, da Riot nun mal in festgelegten Strafstufen handelt und es nicht bei jedem Fehlverhalten von Spielern individuell ausgesucht wird welche Strafe nun angemessen wäre.","replies":[]},{"poster":"eingew","date":"2019-02-11T07:43:47.646+0000","up_votes":1,"down_votes":0,"body":"Weil der Yasuo Quatsch geredet hat und dafür natürlich dennoch einen zweiwöchigen Ban erhält, egal wie sehr er sich was anderes einredet.\n\nAuf den Rest gehe ich jetzt nicht ein, du hast ja bereits an anderer Stelle zugegeben, dass du es mittlerweile akzeptierst. Bedenke, dass der nächste kleinste Ausrutscher jetzt zu einem permanenten Ban führen kann, du darfst dir jetzt also nichts negatives mehr erlauben.","replies":[]}]}]}]},{"poster":"Kokainkonsument","date":"2019-02-10T20:37:11.234+0000","up_votes":1,"down_votes":0,"body":"Na ja, dein Verhalten ist halt typisch Kleinkind, dennoch verstehe ich dein \"Problem\".\n\nGerade im lowelo Bereich weiß so gut wie keiner was wintraden ist bzw. wie scripten aussieht.\nVorallem wenn es um dodgescripts geht.\n\nDazu will ich noch sagen, dass du niemals wegen einem Game direkt 14 Tage gebannt wurdest.\n\nDie \"Bans\" sehen naemlich wie folgt aus:\n\n- 10 Spiele Chatsperre\n- 25 Spiele Chatsperre \n- 14 Tage Ban\n- Permasperre\n\nAußerdem wird niemals nur 1 Game im Log angezeigt.\nSondern immer mindestens 2-3.\n\nHeißt du warst in anderen Games schon toxisch und wurdest mehrmals reported.\nWeil du scheinbar viele badwords getriggert hast in jedem Report hat sich das jemand von Riot angesehen und dir halt den Ban gedrueckt.\nEs ist sogar \"toxisch\", wenn du deinen Mitspielern erklaerst was fuer Items sie brauchen oder was sie machen sollen.\nDas hat mir so der Support Mitarbeiter geschrieben.\nErgo ist auch sowas reportable...\n\nDu solltest btw die Hoffnung aufgeben, dass jemals jemand fuer feeden/trollen oder scripte gebannt wird.\nGebannt werden die Scripter immer einige Wochen spaeter, durch zu auffaellige pattern oder durch das lausige Anticheat.\nTroller/Feeder schreiben einfach immer \"bad game\" oder machen es nicht sooo offensichtlich.\nDa wird es schon schwer die zu bannen, vor allem weil sowas nicht automatisch gehen kann.\n\nMeine Vermutung ist aber, dass das Riot gar nicht juckt.\nAlso /fullmute all, das Spiel spielen und wenn es schlecht laeuft: Go next.","replies":[]},{"poster":"Sinister Nero","date":"2019-02-10T18:53:48.100+0000","up_votes":1,"down_votes":1,"body":"Etwas was viele Leute außer acht lassen ist, dass das ,,callen\" von Ranks genauso banbar ist wie leichter Flame ( alles was nicht unter Hate Speach fällt) . Ich finde dieses abwertene reden über den rank allgemein nicht cool, denn jeder fängt mal klein an c;","replies":[]},{"poster":"RHP Shanks","date":"2019-02-10T20:40:43.702+0000","up_votes":1,"down_votes":5,"body":"Roits system ist eh für den *****\n\nFedder können machen was sie wollen und alle die weinen wegen solchen chat verläufen können doch einfach mute all machen.\nAber das man immer wieder afkler oder trolls ertragen muss die einem das spiel kapput machen das ist riot ja egal !!!!!!!!\n\nich finde deswegen soll man nicht bann einfach muten den typ schon hatt man seine ruhe dafür gibt es die option.\n\nund jetzt dürft ihr mich flamen \ndanke","replies":[{"poster":"MeMyselfandBaal","date":"2019-02-10T21:24:42.212+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=RHP Shanks,realm=EUW,application-id=KYnfKGf0,discussion-id=562mTUUW,comment-id=0009,timestamp=2019-02-10T20:40:43.702+0000)\n>\n> Roits system ist eh für den *****\n> \n> Fedder können machen was sie wollen und alle die weinen wegen solchen chat verläufen können doch einfach mute all machen.\n\nDas klingt ja erstmal gar nicht so dumm, aber...\nWeißt du, wieviele Spiele ich im Jahr verliere, weil meine Mitspieler zu dumm sind den Tipp, den du hier ja richtiger Weise gibst, umzusetzen? Die dann stattdessen zurückflamen... und dann habe ich schon 2 Spieler, die mehr mit Chatten als mit Spielen beschäftigt bin und kann dann immer erahnen, was die wohl gerade schreiben, wenn sie sich 4 Sekunden lang nicht bewegen... und gerne auch dabei sterben.\n\nWenn Flame nicht die Angewohnheiten eines Flächenbrandes hätte, sondern sich immer nur auf das eine Individuum reduzieren würde, könnte ich dir zustimmen. Das funktioniert aber viel zu selten.\n\nWas nicht bedeutet, dass Riot nicht auch irgendwas gegen Trolle unternehmen sollte... nur wie findet man eindeutig raus, ob der Spieler wirklich das Spiel mit Absicht sabotiert hat? Das ist halt verdammt schwierig.","replies":[]},{"poster":"Darkr3sQ","date":"2019-02-10T21:15:35.613+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=RHP Shanks,realm=EUW,application-id=KYnfKGf0,discussion-id=562mTUUW,comment-id=0009,timestamp=2019-02-10T20:40:43.702+0000)\n>\n> Roits system ist eh für den *****\n> \n> Fedder können machen was sie wollen und alle die weinen wegen solchen chat verläufen können doch einfach mute all machen.\n> Aber das man immer wieder afkler oder trolls ertragen muss die einem das spiel kapput machen das ist riot ja egal !!!!!!!!\n> \n> ich finde deswegen soll man nicht bann einfach muten den typ schon hatt man seine ruhe dafür gibt es die option.\n> \n> und jetzt dürft ihr mich flamen \n> danke\n\nUnd ich finde, man sollte nicht flamen.\nDie Mute-Option gibt es nicht, damit Flamer ungehindert flamen können.\nDie Mute-Funktion gibt es, um den Schaden, den Flamer anrichten, zu minimieren. Anschließend wird der Flamer reportet und das IFS kümmert sich um den Rest.\nFeeder und Trolle werden auch vom System belangt sofern es vollkommen eindeutig nachgewiesen werden kann. Und zur Info: lediglich vorsätzliches Feeden ist strafbar. Sonst müsstest Du auch fürs Feeden gebannt werden, da Du zum Beispiel ein 3/7 Ezreal Spiel, ein 4/7 Sylas-Spiel, ein 3/8 Sylas-Spiel oder einen 6/10 Kennen hingelegt hattest.\nAFKler werden bereits zuverlässig ohne dass überhaupt Reports notwendig sind, mit einer Low-Prio-Queue bestraft.\nWie Du siehst, tut RIOT etwas dagegen. Von \"es ist RIOT ja egal\" kann man durchaus nicht reden. Aber wenn Du eine effektive Möglichkeit gefunden hast, wie man Intentional Feeder und Trolle absolut zweifelsfrei und effizient nachweisen und bestrafen kann, dann kannst Du Dich ja mal mit RIOT in Verbindung setzen. Ich bin mir sicher, dass die an so etwas brennend interessiert sind.","replies":[]}]}]}