{"poster":"AER0","date":"2017-03-31T23:33:23.777+0000","title":"Intermittent Ping/Lag Spikes Occurring Several Times A Game","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"I typically have a 30ms ping and play at 60fps.  Starting today, my ping in-game has been spiking up to 200ms for 10-20 seconds before returning to normal.  These spikes occur randomly every 5-15 minutes and occur 3-5 times per game.  After the spike, my ping will return to 30ms.  \n\nDuring the spike, I can sometimes still control my champion, albeit at a delayed pace.  Sometimes the spike will disconnect me completely from the game.  Sometimes I will exhibit actual lag, with everything moving slowly and then jumping back into place.  Furthermore, there will occasionally be a secondary spike following my ping returning to normal that will again cause a 200ms spike for 10-20 seconds.  \n\nIt should be noted that I play on a mac on the beta client.  I have repaired my client.  To make sure that it wasn't just something on my network's end, I switched from ethernet to wifi to a phone hotspot.  None of those three options caused the spikes to stop.\n\nIt may be of interest to know that a friend on a different wifi (in another state) who was in game with me also received similar ping spikes at the same times that I did.  We would both spike/disconnect at the same time, despite being on different computers in different locations on different networks.","replies":[{"poster":"Broporo","date":"2017-04-01T01:27:42.491+0000","up_votes":1,"down_votes":0,"body":"Since you mentioned both you and your friend were getting the same ping spikes even though you were on completely different networks, it seems like your network was having a hard time keeping it's connection to the game server for some reason. Sometimes your own internet is in near perfect condition, but it can still have difficulties talking to specific servers. \n\nTry looking over this [**Connection Guide**](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues) for some ways you can get a more stable connection with the game server. Let me know if you have any questions!","replies":[]}]}