{"poster":"Jikker","date":"2015-04-24T05:09:39.572+0000","title":"Can I dear diary a bit?","subforum":"[ARCHIVED] General Discussion","up_votes":1,"down_votes":1,"body":"So yeah tonight had a match 0 communication in champ select.  I grab my freelo explorer and last pick takes Naut support.  We get to lane against Morg and Varus and instantly I know they are super aggressive Varus spending all his mana and Morgana walking right up to us yet missing bindings.  I poke her down to 1/3 and she falls back.  Suddenly Naut dives in and gets uber low yet no kill.  We fall back and he goes in on hook again and this time dies!  He mad pings 1/2 health Varus, but I kill the almost dead Morgana.  Varus kills me back and I realize that was dumb so I start playing more passive.  Naut gets back to lane immediately which is shoved and starts diving through the minions at Morg and Varus.  Dies again.  \r\n\r\nI'm pushed to turret, we know they aren't warding, Varus has 0 mana, and jungle Gragas just farms around top.  Meanwhile Swain is losing to Yasuo and Tryn is losing to Heimer, and everyone is getting caught out in the jungle.  I get abandoned by my support and end up 1v2ing bot lane losing the turret so I fall back.  Suddenly here comes Naut to dive 1v3 since Malph jung is there.  He dies, I limp away, dragon gets taken.  Mid lane tower goes, top tower goes....basically this saga continues.  If I even get close the enemy, my allies dive and die and I get stuck e'ing out to barely live -- the fate of a super safe ADC.  I eventually shut down Yasuo but at the cost of my life because Malph and Varus come round the corner.  Naut is just diving and dying, there is no objective control, and throughout it all the only words said are dragon timers.  Tryn manages to get top tower, but trades mid inner for it and all our lives.  Finally as they shove through to all three inhibs, I shut down Varus 1v1 (yeah I'm uber down but this guy just blows mana for fun so he had nothing) and kill Yasuo for my third shut down, but then Heimer kills me.  Winions take nexus.\r\n\r\nFinally in post chat Tryn says \"Worst Ez ever\" and blames everything on me....\r\n\r\n/Rant  It's a sucky night tonight","replies":[]}