{"poster":"Kryonik","date":"2018-11-23T21:56:53.697+0000","title":"Runes are too restricting, What about choosing a 7th \"Wildcard\" Rune","subforum":"[ARCHIVED] Gameplay+","up_votes":7,"down_votes":0,"body":"After playing with Runes Reforged for a year and trying to theorycraft/playtest new Rune setups and item builds, I can say that the new system feels far too restricting for the amount and diversity of choices given. The old Runes &amp; Masteries had to issue of there almost always being the \"optimal setup\". Since there were only 3 Mastery Trees, you didn't have a lot of choices, and Runes for mostly catered for the early game. This problem plagued almost every champion and was supposed to be mostly corrected in Runes Reforged. Even now, there are still \"optimal builds\" that change when one rune gets nerfed.\r\nThey gave us 5 Paths and way more options than before, but only allow us to pick between 2 of them. While there have been more unique builds that weren't possible in the old system, even those builds seem to follow the exact same setup and only change when something in nerfed.\r\n\r\nRiot made Runes Reforged to make us really think about the choices we made with runes and how they catered to out playstyle. However, with how unbalanced the Runes still are, players are forced to choose between what they WANT and what they NEED, and they don't always overlap. Despite the cool things you can do now, players still end up picking the most optimal build instead of what they want because they Runes themselves are so much stronger than the old system. They almost always go for what it strongest, regardless if that is what they want to build. An example as of patch 8.23 is Dark Harvest. Everyone and their mother is taking this Keystone if possible because it is so GENERICALLY powerful. This makes Rune setups feel very restricted because what you want is often in a different Path than what is the \"best\" and you lose too much by not picking the \"best\" runes.\r\n\r\nThe other issue, which is been somewhat solved, was base stat choices. Having stats tied to Paths hindered a LOT of creative freedom because your early game was decided by what runes you wanted. Even if you wanted to say go Domination/Resolve for some extra late game tankiness, your early game was hindered because you had health instead of the extra AD you would normally get from going Sorcery secondary. Stat shards alleviated this issue a lot, but still needs some tuning and maybe some extra stat choices in each row.\r\n\r\nThese problems, specifically only getting to pick from 2 of 5 paths in a heavily unbalanced system does NOT promote creativity in a healthy way. This current system \"promotes\" creativity by forcing you to pick what is the best with what little choice you are given. You made do with what you get. As you read in the title, I had the idea of adding a 7th \"Wildcard\" or Bonus Rune. I, and I'm sure others too, find myself stuck without the runes I actually want because they are in a disadvantageous Path for the build I want to do. This usually occurs with you only wanting one specific runes and no others in a path, but don't want to go into that path for only one rune.\r\n\r\nAllowing the choice of one Bonus Rune from any of the 3 remaining Paths could allow for far more creativity in Rune setups and allow real creative freedom in your choices. However, other people I've talked to have said that this may make the game too complicated because you have too much to keep track of. I disagree because the old system had to keep track of. While the old system was weaker, it more choices and more complexity to keep track of, from a   larger number of masteries to pick compared to current Runes, and wildly specialized old rune pages. The Bonus Runes would mean the UI would have to be changed again to accommodate another Rune, but, while also now having to keep track of Stat Shards, the extra Rune shouldn't make the System more complex and difficult to keep track of.\r\n\r\nThese are some examples of new builds I would do to fix problems I constantly have with Rune choices:\r\n\r\n**Jax:**\r\n- Jax in toplane typically goes Precision primary and either Resolve or Inspiration secondary, however I also go Domination, and famous streamers like TF Blade goes Sorcery. While having all of these options is great, only choosing one of them isn't. The example is that I WANT to take Transcendence from Sorcery but not take anything else in that Path, while going instead for Resolve or Domination. Right now, unless I go into Sorcery, there is no meaningful way to hit max CDR with current standard Jax builds without building Essence Reaver (which I hate building because it is blatantly broken). Allowing a 7th Rune would allow me to still go Resolve or Domination, or even Inspiration secondary, and get Transcendence as my single tertiary Rune. This one change could allow me to alter all of my builds to NOT have to build Essence Reaver.\r\n- In really hard matchups, I could also go Resolve secondary and take things like Nullifying Orb, Ravenous Hunter, or Time-Warp Tonic in really miserable poke lanes. This in tandem with the new defense Stat Shards could allow you to better survive the longer laning phase.\r\n\r\n**Orianna:**\r\n- On champs like Orianna, you typically go Sorcery/Inspiration or sometimes Sorcery/Domination. This new rune would allow you go, say, Resolve secondary and still get that one important Rune from Inspiration or Domination and then build more defensive.\r\n\r\nThis could allow Supports to go into any 2 Paths besides Domination, but still get one of the vision Runes, which would better cater to their play style.\r\nAssassins could go Domination/Resolve against bully mages and still get something Triumph from Precision, or get Coup de Grace.\r\nSpell-slinging ADC's could still go Precision/Sorcery and also get Ravenous Hunter, or go Precision/Sorcery and still get Manaflow Band to help with sustain. This in particular could help ADC's who no longer have meaningful Mana sustain after the Essence Reaver Rework, while still allowing them to pick a secondary Path that actually caters to their play style.\r\n\r\nThis change could open up a lot more creative and interesting builds, while allowing meaningful choice in the play style you are looking for how to accent it.\r\nThis may also introduce more abuse cases, but also introduce more ways to counteract those abuse cases.\r\n\r\nLet me know what you think, whether it would be beneficial or overall unhealthy, and what kind of new setups you would do if you had that one extra rune.\r\nThanks!","replies":[{"poster":"Ulanopo","date":"2018-11-25T15:35:18.652+0000","up_votes":1,"down_votes":0,"body":"Approved","replies":[]},{"poster":"Hügö","date":"2018-11-25T21:07:10.154+0000","up_votes":8,"down_votes":0,"body":"With the introductuon of runes reforged I reduced my rune pages from 20, of which I used around 15 effectifly, to around 5 which I use. In my oppinion runes reforged failed completly with the intention making diversity.","replies":[{"poster":"Kryonik","date":"2018-11-26T04:48:15.326+0000","up_votes":3,"down_votes":0,"body":"Having more than even 2 Rune pages now is completely pointless because you can make the entire thing in champ select.","replies":[{"poster":"Hügö","date":"2018-11-26T19:03:55.229+0000","up_votes":1,"down_votes":0,"body":"Sure but I still use just around maybe 5 pages.","replies":[]}]}]},{"poster":"TomiMan7","date":"2018-11-27T15:12:36.565+0000","up_votes":3,"down_votes":0,"body":"oooooooooooooor just revert runes reforged and make all the runes free. There you go, problem solved","replies":[{"poster":"Kryonik","date":"2018-11-27T21:07:53.391+0000","up_votes":2,"down_votes":0,"body":"As much as I agree with you and would prefer it that way, this change is proposed on the assumption that that will never happen.","replies":[{"poster":"TomiMan7","date":"2018-11-27T23:32:25.433+0000","up_votes":1,"down_votes":0,"body":"well i keep my fingers crossed one day they will revert it","replies":[]}]}]},{"poster":"oortoomeebreesuu","date":"2018-12-13T10:04:26.180+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Kryonik,realm=NA,application-id=ELUpwER8,discussion-id=J3rwNJYM,comment-id=,timestamp=2018-11-23T21:56:53.697+0000)\n>\n> \nDespite the cool things you can do now, players still end up picking the most optimal build instead of what they want because they Runes themselves are so much stronger than the old system. They almost always go for what it strongest, regardless if that is what they want to build. \n\nParaphrasing, but this was only predicted about FOURTEEN MONTHS AGO by one of the pro players. \"It's not going to be about picking which runes are fun for your champion, it's going to be which champions abuse the runes.\" \n\nPtA {{champion:236}} \nKleptomancy {{champion:41}} \n\nAs an example, Kleptomancy should be a very cool rune that promotes minor, consistent trading, something that almost all melees would want. Except there is no trade, you just die immediately if you fight because you don't have combat runes and they do. I've tried this on Akali. Klepto seemed like a great thing for her, you use multiple spells and autos and are stealthed while doing it. So why didn't it work? Well, it's not exactly that it didn't work... but then I tried electrocute and realized I gibbed somebody from 70% hp with a spell, auto, ignitrocute. Why was I trying to get 5 gold per Q again? \n\nDeathfire Touch and Fervor of Battle should have remained the way they were designed. Windspeaker's Blessing, Phase Rush, Lethal Tempo, Glacial Augment, these are good rune designs, even if Augment is sometimes annoying with certain champ builds. \n\nElectrocute/Aery/Comet, return previously nerfed poke/burst combos to busted states again. You can't give something for nothing to every champion. This isn't about \"the meta\" - it's about some champions earning a statistical edge that can not be outplayed, that they did not previously have. Balance problems are forthcoming.\n\nExample, if Zed does too much damage with Electrocute? Well we have to nerf Zed or Electrocute, but so many champions like Electrocute, we will just nerf Zed. Well, guess I can't play Zed without Electrocute now, so what's the point of having \"choices\" at all??????? Not every champion can use runes the same way, Twisted fate for example has almost no way in his lane pattern to inflict Electrocute, yet it seems perfect for a champion of his strengths, his trades are very deliberate but more rare than his every W cooldown. It's not about me also having the same thing, EQUALITY does not work for champions because champions are not equal. Their base stats, base damages/ratios, cooldowns, move speeds, you start wiggling things that were previously CAREFULLY PLOTTED, and then with runes the whole thing falls apart. The highest extremes become the new baseline, anything else is folly bordering on freelo.","replies":[]},{"poster":"The Bad Touch","date":"2018-11-27T17:20:31.590+0000","up_votes":2,"down_votes":0,"body":"The bonus stats feel entirely pointless imho.\n\nI end up just taking double adaptive + hp, or AS/adaptive + hp on every single champ.\n\nHow this is supposed to be an upgrade that the very deep old rune pages.. I have no idea.","replies":[{"poster":"Kryonik","date":"2018-11-27T21:07:12.353+0000","up_votes":2,"down_votes":0,"body":"The point of the post wasn't to address the stat shards...\nIt was to allow picking a 7th rune...","replies":[]}]},{"poster":"rayzo","date":"2019-01-02T06:51:15.063+0000","up_votes":1,"down_votes":0,"body":"This sounds like so much fun... I want this.\nI want to be able to go Precision+Domination on Udyr and still get Demolish.","replies":[]},{"poster":"JRobin31","date":"2018-12-27T22:11:46.107+0000","up_votes":1,"down_votes":0,"body":"The proposition that the limited number of optimal rune builds in the old rune system was a problem that needed solving turned out to be a red herring.\n\nPlayers will always optimize and popular opinion will always gravitate towards a few selections of optimal builds!\n\nThe attempt to stop this or control this in Rune Reloaded will probably never be successful (or if it is successful, it will be successful for at most a few months).","replies":[]},{"poster":"Leaf on Bush","date":"2018-12-26T21:35:22.157+0000","up_votes":1,"down_votes":0,"body":"Remove runes. The game doesn't need them.","replies":[]},{"poster":"RJay123","date":"2018-12-07T13:39:58.952+0000","up_votes":1,"down_votes":0,"body":"Whether you agree with the OP or not, \"Everyone and their mother,\" is the underrated phrasein existence. Don't know why but that made me laugh","replies":[]},{"poster":"HarbingerGrape","date":"2018-11-30T01:36:16.300+0000","up_votes":1,"down_votes":0,"body":"I Really enjoy this idea but the first thing iw ould do is allow players to see all rune choices not just the keystone in game somehow. also i would prefer stuff like your primary tree dictates wildcard choices, say in resolve,sorcery and precision you get 1 wildcard, domination lets you take none and we can make inspiration give you two. you can even implement a new inspiration keystone that allows not only turns your two secondary path into wildcard slots but also lets you choose multiple from the same row which means you get the normal inspiration choices then any other 4 runes from the other for paths","replies":[{"poster":"Kryonik","date":"2018-11-30T19:28:53.302+0000","up_votes":1,"down_votes":0,"body":"I really like the Inspiration idea to take multiple in a row, but having only Domination not give a Wildcard is unfair to anyone who wants to go into that path.","replies":[{"poster":"HarbingerGrape","date":"2018-12-06T20:12:52.828+0000","up_votes":1,"down_votes":0,"body":"The reason i say that is because domination keystones are so prevalent that being able to fill out all of the weaknesses of the dmg runes sounds unfair and would just result in everyone taking a domination keystone","replies":[]}]}]}]}