{"poster":"Fawgs","date":"2015-06-23T16:02:56.425+0000","title":"Chat-Bann nach DC's","subforum":"Allgemeiner Chat","up_votes":1,"down_votes":2,"body":"Hallo ihr Lieben,\n\nich hatte neulich heftige Lags und auch h&auml;ufige DC&#039;s w&auml;hrend eines Spiels. Das tat mir auch total Leid und ich habe mich h&auml;ufig entschuldigt, obwohl mein Team wirklich total sauer war, was ich verstehen kann. Nun kann ich f&uuml;r ein paar normale Spiele keinem Ranglisten-Spiel beitreten, was ich verstehen kann. Aber zudem habe ich auch einen Chat-Bann bekommen, was ich absolut nicht verstehe. Es ist nicht so schlimm, aber **ich flame wirklich nie** und frage mich nun, wie dieses System funktioniert? Ich habe h&ouml;chstens mal geantwortet, dass ich da nichts f&uuml;r kann und dass sie sich aufs Spielen konzentrieren sollen und wir das Beste draus machen m&uuml;ssen. Aber ich habe niemanden beleidigt und wurde auch nicht unfreundlich. Ich beschwere mich nicht. Ich m&ouml;chte nur wissen, wie ich das in Zukunft vermeiden kann, denn ich m&ouml;chte nur f&uuml;r das bestraft werden, was ich auch wirklich getan hab. \n\nGanz liebe Gr&uuml;&szlig;e\n\nSunnali","replies":[{"poster":"Sirrkas","date":"2015-06-23T16:06:58.368+0000","up_votes":2,"down_votes":0,"body":"Chatbanns und Rankedrestrictions (auch bekannt als CR und RR) werden nur verteilt, wenn die Chatanalyse das für richtig hält. AFK/Leaven hat damit nichts zu tun. Für AFK gibt es zusätzliche Wartezeit in Warteschlangen.\n\nDu kannst gerne schildern, was du in deinen Spielen schreibst. Je wortgetreuer und je mehr Beispiele, desto besser. \n\nJe nach Ausgestaltung, können Sachen wie \"aufs Spiel konzentrieren\" und andere Antworten auch ziemlich aggressiv sein.","replies":[{"poster":"Fawgs","date":"2015-06-23T16:13:51.051+0000","up_votes":1,"down_votes":1,"body":"Dann wurde ich bestimmt falsch verstanden. :( Aber dafür ist die Frage auch für mich beantwortet. Werde in Zukunft vorsichtiger sein!\nDanke für deine Antwort!","replies":[{"poster":"Sirrkas","date":"2015-06-23T16:19:02.900+0000","up_votes":1,"down_votes":0,"body":"Viel Glück. Auch wenn ich dir trotzdem dazu raten würde, andere zu ihrer Meinung zu deinem Chat zu fragen. Aber nicht irgenwelche Freunde die gerne mal über andere schimpfen.","replies":[{"poster":"Fawgs","date":"2015-06-23T16:29:58.106+0000","up_votes":1,"down_votes":1,"body":"Gute Idee. Kannst du mir vielleicht bitte noch erklären, wie ich einen Chat überhaupt sehen kann? Also gibt es irgendeine Möglichkeit, einen Chat von einem beendetem Spiel zu sehen? Mir war bisher gar nicht bewusst, dass das überhaupt geht!","replies":[{"poster":"Sirrkas","date":"2015-06-23T16:48:29.077+0000","up_votes":2,"down_votes":0,"body":"Das geht nicht. Aber wenn du mit jemandem zusammenspielst, sieht er ja was du schreibst. Du kannst auch deine Spiele aufzeichnen und danach nochmals ansehen. Screenshots sollten dazu aber reichen. Wenn du Y drückst, müsste es den Chat besonders groß darstellen. Mit F 12 werden angeblich Screenshots im LoL Ordner abgespeichert, ich habe mir aber noch nicht die Mühe gemacht, das zu überprüfen.","replies":[{"poster":"Fawgs","date":"2015-06-23T18:59:11.597+0000","up_votes":1,"down_votes":1,"body":"Danke! Ich glaube, ich nerve jetzt langsam, aber ich habe dann noch eine Frage. Wie kann ich ein LoL-Spiel aufzeichnen?","replies":[{"poster":"NoWayØut","date":"2015-06-24T05:01:41.097+0000","up_votes":2,"down_votes":0,"body":"lade dir baron runter zeichnet das game auf ^^","replies":[]},{"poster":"Sirrkas","date":"2015-06-23T19:12:42.791+0000","up_votes":1,"down_votes":0,"body":"Dafür musst du ein Programm herunterladen. Ich kenne mich da leider nicht aus. Ich weiß nur, dass es sie gibt und einige Seiten sogar automatisch ein paar Replays aufnehmen können. Da wirst du leider selbst suchen müssen.","replies":[{"poster":"Fawgs","date":"2015-06-23T19:30:44.430+0000","up_votes":1,"down_votes":1,"body":"Danke trotzdem, dass du dir die Zeit genommen hast. Ich mache mich dann mal schlau!","replies":[{"poster":"Sirrkas","date":"2015-06-23T20:11:37.044+0000","up_votes":2,"down_votes":0,"body":"Screenshots wären wohl einfacher und kosten weniger Speicher. Geh mal in ein Custom und drück F 12. Ich werd das auch mal versuchen. Wenn ich den Screen finde, zeige ich dir den Pfad. Allerdings muss man noch aktiv F 12 drücken und man könnte das vergessen. Das Video würde alles alleine machen. Die Aufnahme hat auhc den Vorteil, dass du deinen eigenen Spielstil analysieren und verbessern kannst.\n\nEdit: Screenshotpfad\nC:\\Riot Games\\League of Legends\\Screenshots","replies":[{"poster":"Fawgs","date":"2015-06-23T21:23:34.905+0000","up_votes":1,"down_votes":1,"body":"Vielen lieben Dank. <3","replies":[{"poster":"Sirrkas","date":"2015-06-23T22:31:53.468+0000","up_votes":1,"down_votes":0,"body":"Keine Ursache. Falls du willst, kannst du das Material gerne hier vorzeigen.","replies":[]}]}]}]}]}]}]}]}]}]}]},{"poster":"erzi222","date":"2015-06-23T19:12:44.917+0000","up_votes":1,"down_votes":2,"body":"a normal day in league of legends.","replies":[]}]}