{"poster":"Darkest Laugh","date":"2017-01-19T23:56:54.692+0000","title":"My internet is rejecting all things League?","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"So last night I randomly disconnected from a ranked game (of course when my Cait was 7/0 in a 3s game and we had a great comp) but I was still connected to the internet. I couldn't access the League website but I could access YouTube, I could search and access sites I haven't been too before. Internet definitely connected.\r\n\r\nI could receive messages on the messenger app on my phone but couldn't send any unless I disconnected from my wifi and used data. On data the messenger app works fine and on the wifi at work it works fine same with the website. Just not my home network.\r\n\r\nMy brother in law couldn't sign into the client either (stuck on 'authenticating') and he couldn't even access the LoL subreddit.\r\n\r\nOnly non League thing I found I couldn't connect to was Discord. Any thoughts?","replies":[{"poster":"Darkest Laugh","date":"2017-01-20T06:53:42.738+0000","up_votes":1,"down_votes":0,"body":"And I got hit with a leaverbuster because I've been having weird freezing issues on top of this and crashing hahaha this is great.\n\nFirst time in my near 6 years of playing this game of getting hit with leaverbuster, and it's because the game has been glitchy like no tomorrow and of course this random thing...\n\nSo I tried to sign into the client when I got home and I can sign in now. So the mystery stays alive, but I'm in a low priority queue for 5 games. Whatever that means.","replies":[]},{"poster":"Targons Blade","date":"2017-01-20T01:00:50.943+0000","up_votes":1,"down_votes":0,"body":"It sounds like you may have some ports blocked on your local router or there may be restrictions on your local network. Our [**connection guide**](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues) will walk you through the configurations we recommend to ensure League can operate properly.\n\nIf you continue to experience this after taking those steps, let me know.","replies":[{"poster":"Darkest Laugh","date":"2017-01-20T01:10:08.113+0000","up_votes":1,"down_votes":0,"body":"Okay thanks. I'll be sure to give it a try once I'm home.","replies":[]}]}]}