{"poster":"spharic","date":"2015-03-20T18:17:26.147+0000","title":"Kann mir das jemand erklären?","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"verstehs iwie nicht ganz, haben wir hier nasus 2.0 nur ohne lästiges stacken?","replies":[{"poster":"Futanarî Soraka","date":"2015-03-21T09:22:40.278+0000","up_votes":1,"down_votes":3,"body":"Nein.","replies":[{"poster":"spharic","date":"2015-03-21T11:14:06.069+0000","up_votes":2,"down_votes":0,"body":"zum Glück besteht das Forum nicht nur aus so möchtegern Witzbolden wie du es einer bist. :)","replies":[]}]},{"poster":"XxKampflappenxX","date":"2015-03-22T10:28:15.259+0000","up_votes":1,"down_votes":0,"body":"Es gibt immer wieder einige Champions die aufgrund ihres gesamten Kits einfach super in die Meta passen, hierbei meine ich jetzt nicht unbedingt LCS Picks sondern eher das was man einfach so spielen kann mit viel Erfolg. Ich war schon immer der Meinung dass ein krasser Tank mehr Schaden machen kann als ein Assasine jedoch mehr Zeit dafür benötigt. Sejuani braucht halt etwas länger aber die Zeit die sie im Kampf ist lohnt sich weil ihr Schaden sich einfach erhöht je länger sie Kämpft.\n\nVolibär ist meiner Meinung nach momentan sehr stark da er nach dem Glutkolloss entweder direkt Warmogs bauen kann wenn er dem Gegner vorraus ist oder allgemein nur ne Menge an HP benötigt um stärker zu werden. Allgemein gilt sowieso wenn du dem Gegner vorraus bist solltest du Tanky bauen damit man dich nicht mehr töten kann. Champions die sowieso auf Defensive skalieren haben da einen immensen Vorteil was das Snowballen angeht. \n\nGlutkolloss und Warmogs sind sowieso super goldeffizient auf Voli weil sein Effektives Leben einfach in die höhe schiesst. Ausserdem erhöht sich der Schaden durch seine W durch Maximales Leben. {{champion:106}} {{item:3709}} {{item:3083}} {{item:3009}} {{item:3091}} {{item:3065}} {{item:3143}}","replies":[]},{"poster":"TheDarkChild666","date":"2015-03-22T08:36:32.692+0000","up_votes":1,"down_votes":0,"body":"Seju war vorher schon stark, und durch das neue Jungle item wurden tankjungler enorm gebufft. drum wird Sie jetz auch in fast jeden spiel gespielt oder gebannt.\nSeju is momentan total OP mit 57% winrate.\nWurde auch von so einer als udyr einfach zerlegt war der gleiche build.","replies":[]},{"poster":"HeTossMySalade","date":"2015-03-21T08:52:15.342+0000","up_votes":1,"down_votes":0,"body":"Cinderhulk und Liandris reichen aus als DMG Items. Wie kann es denn sein das ich als Irelia/Sion/ Renekton mit (k)einem DMG Item genau das selbe mache?","replies":[]},{"poster":"HyperionCH","date":"2015-03-20T19:10:52.138+0000","up_votes":1,"down_votes":0,"body":"Ja. Liandrys ist sicherlich ein Grund. Damit wird Seju wohl immer reingerannt sein und hat ordentlich Schaden gemacht. Durch die tankiness dauerte der Schaden natürlich entsprechend lange, weil man Tankchamps nicht so schnell killen kann.\nAnders gesagt: tanks machen zwar wenig DPS, aber durch die hohe \"S-Zahl\" wird der DMG auch hoch. ;)\n\nSeju ist btw. Pla5 geranked (alle anderen so um Silber und Bronze).\nIch denke, als Pla5-Spieler wusste Seju sehr gut, wie lange er tanken kann, welches Schadesnpotential er hat etc. Gerade in TF macht sich dies bezahlt.","replies":[]},{"poster":"MahouShoujoRakka","date":"2015-03-20T18:56:52.783+0000","up_votes":1,"down_votes":0,"body":"Liandrys wird durch den Brenn-Passiv ausgelöst, das heißt, Seju macht permanent Schaden basierend auf dem aktuellen Leben und da sie einige Tools zum slowen hat, wird der Effekt nochmal verdoppelt. Die Range vom Brennen ist wiederum nicht sonderlich klein und euer Team war relativ melee-lastig, so dass sie quasi ständig in Range von mehreren Champions war.\nDamage an Champions sagt nicht unbedingt wirklich was über den Schadenscharakter eines Champions aus, viele Assassinen ohne Poke haben häufig nicht allzu hohen Schaden an Champions und dennoch einen hohen Killcount, da sie den Schaden sehr konzentriert abgeben. Und mit Brennen+Liandrys wird man immer mehr AoE als irgendwelche Mages haben.","replies":[]},{"poster":"Temudschinn","date":"2015-03-20T18:46:50.129+0000","up_votes":1,"down_votes":0,"body":"Naja, wenn du als tank mit %hp dmg (liandrys) in 3gegnern drinstehst während dem kompletten kampf machst du halt mehr schaden als ein adc der ständig wegrennen muss...hatte schon bedeutend höhere dmg werte z.b. Mit tank rene (nur hydra, sonst fulltank), weil man mit etwas feed einfach ohne Rücksicht reinrennen kann und in längeren kämpfen ganz gut schaden macht","replies":[]},{"poster":"HeTossMySalade","date":"2015-03-20T18:19:46.892+0000","up_votes":1,"down_votes":0,"body":"Würde mal behaupten Seju hat gecarried, wo is das Problem?","replies":[{"poster":"spharic","date":"2015-03-20T18:21:00.691+0000","up_votes":1,"down_votes":0,"body":"kein dmg item, aber mehr dmg als jeder carry im team. das versteh ich nicht ganz","replies":[{"poster":"HyperionCH","date":"2015-03-20T18:27:48.882+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=spharic,realm=EUW,application-id=Wj1wcocU,discussion-id=s7OMBtmm,comment-id=00000000,timestamp=2015-03-20T18:21:00.691+0000)\n>\n> kein dmg item, aber mehr dmg als jeder carry im team. das versteh ich nicht ganz\n\nIst die Grafik \"DMG an Champs\" oder \"DMG Total\"?\n\nIch frage nur wegen smite, Machete, Gromb-Buff, etc. ;)","replies":[{"poster":"spharic","date":"2015-03-20T18:31:12.564+0000","up_votes":1,"down_votes":0,"body":"dmg an champs natürlich\n\nLiss & Ziggs waren auch richtig dick, nur Graves war behind, so zum Vergleich ^^","replies":[]}]},{"poster":"wooupz","date":"2015-03-20T18:29:09.084+0000","up_votes":1,"down_votes":1,"body":"tanks wurden gebufft und seju ist zurzeit sehr gut dabei, wenn man sie auch noch beherrscht ist sowas nicht sehr schwer","replies":[]}]}]}]}