{"poster":"HRN Galattico","date":"2019-06-30T22:41:03.672+0000","title":"Opinione Personale Sulla Nuova Modalità","subforum":"Mappe e modalità","up_votes":1,"down_votes":0,"body":"La nuova modalità a parere mio è veramente troppo basata sulla fortuna (oltre ad i bug ma posso capire dato che è in beta) dato che: devi avere fortuna con gli item, con i champion che ti escono nel negozio, con i champion che escono nel draft pick, devi avere fortuna che i tuoi champ prendano giusti target, che procchino le passive, che tirino le abilità nel posto giusto e devi avere fortuna pure contro chi ti trovi. Molti champion tipo tutti gli assassin e kassadin sono totalmente broken dato che basta fare una build full assassin per vincere la partita (e non provate a dirmi che basta fare full tank per counterare gli assassin perchè: 1. non funziona fare i tank dato che tankano pochissimo 2. non hai i danni 3. io voglio essere libero di giocare, non voglio sottostare al fatto che devo fare certe robe perchè se no ho automaticamente perso). secondo me per aggiustare un pò questa modalità dato che ha un buon potenziale basterebbe: nerfare tutti gli assassin(soprattutto kassadin, katarina e zed), mettere che ogni tot ''campo di gungla''/''minion'', tu hai tot numero di item causali per forza, avere una scelta fra tutti i champion (chiaramente quelli che sono presenti sul TDS) e per ogni livello tu sscegli un nuovo champion che con il tempo diventa più forte(così da rispecchiare anche la meccanica nel gioco normale), di conseguenza mettere più livelli; in questo modo il gioco si baserà molto di più su come fai le sinergie ed i posizionamenti delle truppe. così la nuova modalità di gioco, ovvero, Tattiche Di Squadra sarà una modalità che si può chiamare TATTICHE DI SQUADRA e non: speriamo negli assassin o fortuna nei champion. spero vi sembri interessante la mia idea, scrivetemi dove sbaglio.  \r\n\r\n p.s. i campi di giungla vanno benissimo così sono molto divertenti devo dire.","replies":[{"poster":"Lexsus01","date":"2019-07-01T09:04:34.478+0000","up_votes":1,"down_votes":0,"body":"Comprendo la tua idea ed in parte la condivido. Come dici tu è un gioco che si basa molto sulla \"fortuna\" anche se bisogna ammettere che una bella percentuale è comunque data dalla strategia, dalle decisioni, dal posizionamento, dalla scelta di determinati campioni,...\nE' un po' come un gioco di carte... se ti escono le carte giuste nel momento giusto hai maggiori probabilità di vincere ma ciò non toglie che uno possa vincere anche senza questa fortuna.\nE' una modalità che deve piacere. A me non piace proprio per le motivazioni che hai espresso, quindi la giocherò poco. Ma riconosco che è una bella modalità ed a molti può piacere.\nPer rispondere al punto in cui dici che gli assassin sono broken ecc... ricorda che è una modalità in Beta uscita neanche 1 settimana fa nel client ufficiale.\nE' normalissimo che ci siano item e champion sbilanciati, che il drop degli oggetti non sia buono ecc...\nSono sicuro che alla Riot ora interessa sapere l'opinione della community per migliorarlo. Se molti si lamentano degli assassin ed effettivamente le statistiche mostrano che 6 assassin sono imbattibili, beh, verranno nerfati. Basta avere pazienza\n{{sticker:katarina-love}}","replies":[{"poster":"HRN Galattico","date":"2019-07-01T11:56:13.371+0000","up_votes":1,"down_votes":0,"body":"si effettivamente hai ragione, pero l'idea dei campioni a scelta libera e che fanno livelli con il tempo sarebbe una figata, anche per scoprire nuove combo e dare più diversità al gioco","replies":[{"poster":"Lexsus01","date":"2019-07-01T12:46:11.213+0000","up_votes":1,"down_votes":0,"body":"Sono abbastanza sicuro che la riot abbia una sezione in cui legge idee della community, forse pure qui sul forum in modo pubblico. Sei libero di esprimere tutto quello che vuoi\n{{sticker:slayer-pantheon-rainbows}}","replies":[]}]}]},{"poster":"Erax157","date":"2019-07-01T04:51:39.771+0000","up_votes":1,"down_votes":0,"body":"Principalmente si c'è un fattore RNG spropositato, il drop casuale degli oggetti è sbagliato. Però d'altro canto il gioco si basa molto anche sul saper fare economia e anche adattarsi alla situazione, al negozio campioni ci posso anche stare, basta adattarsi a quello che si trova, fare un po' di risparmio ai primi turni arrivare a 50 gold e poi si puo iniziare a fare qualcosa","replies":[]},{"poster":"3883085410CallMe","date":"2019-06-30T23:01:17.153+0000","up_votes":1,"down_votes":0,"body":"è troppo basato sulla fortuna is the new perdo per colpa dei miei compagni\n\nAnche i giochi di carte sono \"basati\" sulla fortuna, eppure i campioni mondiali riescono a riconfermarsi anno dopo anno.\n\nLa bravura sta nel tirare fuori la composizione migliore in base a quello che ti esce. Se parti con il presupposto \"voglio fare i mutaforma\" e i mutaforma non escono, o ti adatti o perdi.","replies":[{"poster":"XPY99","date":"2019-07-01T01:46:33.388+0000","up_votes":1,"down_votes":0,"body":"Fino a un certo punto, ad esempio il drop degli item è totalmente random e questo è sbagliato, il discorso dell'adattarsi va bene in quanto il mazzo è condiviso, però non può essere che al primo turno pvp ci sia gente con 3 oggetti completi e altri che arrivano a fine partita con un oggetto e mezzo o due","replies":[]},{"poster":"HRN Galattico","date":"2019-06-30T23:12:01.873+0000","up_votes":1,"down_votes":0,"body":"si ma nei giochi di carte come yu-gi-oh per esempio per fare un deck competitivo ci vuole tantissimo tempo anche una o due settimane per creare le giuste combo. non puoi assolutamente paragonare la fortuna che devi avere su tds a quella che devi avere in un gioco di carte perchè su tds i fattori di fortuna non sono solo le carte che peschi","replies":[{"poster":"liberodaniele","date":"2019-07-01T00:20:45.045+0000","up_votes":1,"down_votes":0,"body":"Il succo del discorso è che ti devi adattare a quello che esce. Non esistono oggetti/campioni essenziali in ogni caso e in ogni comp, tieni sempre una piano di riserva.","replies":[{"poster":"HRN Galattico","date":"2019-07-01T00:23:59.144+0000","up_votes":1,"down_votes":0,"body":"comunque e veramente troppo basato sulla fortuna. non posso avere un piano di riserva dato che ho poco spazio per i champion e pochi soldi e fortuna per trovarli ed aquistarli","replies":[]}]}]}]}]}