{"poster":"The Djinn","date":"2018-08-11T00:50:57.100+0000","title":"How to Propose Punishment System Changes","subforum":"Player Behavior","up_votes":25,"down_votes":4,"body":"Hey all!\n\nLove it or hate it, the punishment system is one of the most frequent topics here. We have people adamantly defending it, people deriding it at every opportunity, and everything in between. What we *don't* have as much of, though, is good conversations about proposed changes.\n\nAs such, here's a primer on what I think a suggestion needs to do in order to be something that might actually gain traction here or with Riot.\n\n------------------------------------------------------\n\n* It must *not* enable more toxicity against non-toxic players than the current system.\n* It must *not* place the burden of avoidance on the victim of harassment.\n* It must *not* increase the chances of players tilting their teammates.\n* It must *not* create a Prisoner's Island of toxic players in either gameplay or communication.\n* It must *not* forcibly reduce team communication.\n* It must *not* lead to players finding other in-game ways to be toxic.\n* It must *not* be based on anecdotal evidence, such as \"this would clearly work\" or \"it's so obvious\" or \"all punished players return on smurfs\" or \"everyone would behave this way.\"\n* You *must* be willing to accept critique.\n* You *must* be willing to accept the data Riot has told us regarding the system, as otherwise there is no common ground to discuss things from. Any changes would need to be approved by Riot as well as the community, which means that if your system can't stand up to an argument based on Riot's data than it is dead on arrival.\n\n--------------------------------------------------------\n\nIf your proposal can hit these main points, there might be merit to it! Remember to present your ideas on their own merits though -- if your thread reads as an attack on the current system rather than an analysis and suggested improvements, the conversation is unlikely to focus on the improvements but rather on the attack.","replies":[{"poster":"Ulquiorra0123","date":"2018-08-11T14:06:30.309+0000","up_votes":13,"down_votes":1,"body":"So this is speaking from direct experience with being Permad. I had an account about 3 years back that had about 2500$ worth of skins on it. At the time I was what I would call competitively passionate about the game. Rarely, but from time to time I would bash someone for a clearly stupid decision, and I'm not talking \"KYS\" or, \"I hope you get cancer and die\". I'm talking \"That was so incredibly stupid, and you knew that would happen\". Now to me, if you don't want to hear that, the mute button is provided. I actually got done with a 250 game chat restriction, during the whole time I was fairly clean, there was still the odd time where I would use my limited messages to bash an intentional feeder, but overall really clean. And then the game after the 250 game chat ban was up, the account was permabanned after an URF game where the only thing I said, was \"shut up and play\" to 2 incredibly toxic players. It was the only thing to pop up for my reason for being permad.\n\nI don't think the current system should punish someone who only talks gameplay, even if it is trashtalk, if you don't want to hear it, there is a mute button. If the system is literally designed to ban anyone for anything negative they say, why the mute button? Why even have it in the game? I don't think that I should have been permad for trash talking every few games about someone's gameplay, I dont think its a fair punishment to lose 2500$ over. You wouldn't in any other game, and no matter what is done, the game will still be toxic as hell. \n\nMy innate problem with this is that the trolls and intentional feeders don't get punished nearly as often. And I feel like you can't have it both ways. It is literally the main reason I have not spent a single cent more, is because my gameplay is apparently \"toxic\". I mean I would never go in on someone's personal life or anything like that, but apparently giving one comment about how stupid someone's decision was is considered toxic, so I just do my best to never talk, and I'll never spend a cent again until the system is redone so it actually punishes the true toxic people in the game, and stops punishing people for being passionate. \n\nI do not like that anything that can be taken as negative is punishable, it creates this SJW environment that has led to most of my high elo games having nobody talk. People are legitimately scared to talk ingame because anything is report worthy. I mean the thing that started it all was my smurf getting a chat ban for being nice to a toxic player........ Yeah this happens. \n\nIf it were my choice, people wouldn't be punished for trashtalk about gameplay until it crosses the line from trashtalk to berating. And even then it would only be short chat restrictions, never a ban/permaban. I also would have a team that goes out of their way to ban intentional feeders. First time offense is a permaban. When you choose to intentionally feed, you choose to not play the game, that would be the motto I would have. Trolls are a bit different, I would personally just slap a ranked suspension on them and then if they do it in normals you ban them straight up. There needs to be much more leniency in competitive trashtalk, and alot less leniency in trolls and inters. Like I had a Riven literally buy mobis and tears and run it down mid, no punishment at all, not the first time they have done it. \n\nIn final, I don't agree with taking away someone's account unless they seriously ruin games. I don't think there is anything that anyone can say that will affect 80% of the playerbase and how they play, because most people have a spine/know where the mute button is. And for the remaining 20% of players, put a PSA in the load screen as to where the mute button is permanently. Now I will never spend another cent again because of Riot support response to me asking If I can get my account back from 3 years ago: \"you have fixed your ways but we cant give you your account back, we don't have a way to.\" Complete and utter BS, they gave accounts back in the past from permaban status. So they just get to keep my 2500$ in hope I will spend to get it all back, nah, not gonna happen.","replies":[{"poster":"JRobin31","date":"2018-08-12T19:32:59.275+0000","up_votes":1,"down_votes":2,"body":"I agree that players should not be permabanned for talk, because it violates the principle of competition that all major sports ascribe to: that players compete based on their skill (not their opinions).  Other punishments (such as temporary bans) exist.  No legitimate sport permabans trash-talkers; trash-talking is not a measure of skill.\n\nI'm not convinced first time intentional feeders or trolls should be perma-banned either, because I think most of the gaming community doesn't understand what real intentional feeding and trolling is.\n\nTo be clear, the only thing major sports permaban their players for is cheating or fixing games (that sort of thing).  So I think you may have a case for permabans on players for intentional feeding or trolling because they are actively trying to throw games.  But... because most of the community doesn't understand what intentional feeding and trolling really is, I cannot support such a proposal.  It would too easily be misinterpreted.\n\n\"What's that?  You didn't play META?  Permaban!\"\n\"OMG, you died in a place you should not have died?!?  Permaban!\"\n\nIn short, as long as you play fair, you shouldn't be permabanned _for any reason_, IMO.  Plenty of punishments exist for the careless.","replies":[{"poster":"Voldymort","date":"2018-08-13T05:31:22.520+0000","up_votes":3,"down_votes":0,"body":">No legitimate sport permabans trash-talkers; trash-talking is not a measure of skill.\n\nhttp://forums.na.leagueoflegends.com/board/showthread.php?t=4086541&amp;page=5#post43595629\n\n>\"Trash talk is part of all competitive sports. It happens all the time in the pros.\"\n\n>Yes and no. Yes, trash talk occurs, but it has definite limits. Most of the things that are punished in game (racial, ethnic and homophobic slurs, sexism, etc.) would also earn you a hefty fine in professional sports.\n\n>A Tumblr List of NBA Fines (http://nbafines.tumblr.com/)\n(My personal favorite on that site is this indefinite suspension (http://nbafines.tumblr.com/post/1010368028/3-12-96-the-nba-suspended-mahmoud-abdul-rauf-den), simply for refusing to stand during the National Anthem.)\n\n>A List of NFL Fines for Taunting (http://www.spotrac.com/fines-tracker/nfl/all-years/fines/taunting/)\n\n>NBC Article on Fines Agreed to by the NFLPA (http://profootballtalk.nbcsports.com/2012/12/01/bizarrely-specific-nfl-fines-come-from-agreed-league-union-schedule/)\n\"Excessive profanity or other unsportsmanlike conduct triggers a minimum fine of $10,500.\"\n\n>NHL Office of Player Safety (http://www.nhl.com/ice/eventhome.htm?location=/playersafety)\nBrendan Shanahan is the ****ing Bad Santa of the NHL. Did you know that his Office of Player Safety watches every minute of every game, from multiple angles? He sees and hears EVERYTHING, including swearing.\n\n>... and the grand finale!\nMarge Schott (http://en.wikipedia.org/wiki/Marge_Schott), who was forced out of ownership of the Cincinnati Reds for racist comments and pro-Nazi sentiments.\n\n","replies":[{"poster":"Prandine","date":"2018-08-13T06:55:42.600+0000","up_votes":1,"down_votes":0,"body":"To add onto what Voldymort posted pro league players have received suspensions and even bans for poor behavior displayed in-game, such as IWDominate and Jensen. In both cases it was only after they had proven that they had well and truly cleaned up their acts that they were allowed to play again, but their permabanned accounts remain banned to this day, and in the case of IWDominte even cost him his spot on Team Dignitas when he got banned.\n\nYou may like to trash talk with people, and that's fine, but you have to know when to stop and where to draw the line at (easier said than done I know but still though) or face the consequences for crossing that line.\n\nhttps://lol.gamepedia.com/List_of_Competitive_Rulings","replies":[{"poster":"Simfo","date":"2018-09-02T19:02:44.063+0000","up_votes":1,"down_votes":0,"body":"It just feels like stealing almost to not unban a persons account if they've spent a large amount of money and time into it\nIf they've \"truly cleaned up their acts\" they should get their accounts back not start from scratch without any progress","replies":[]}]},{"poster":"JRobin31","date":"2018-08-13T18:05:01.842+0000","up_votes":1,"down_votes":2,"body":"Excellent research... now observe how _**none**_ of those punishments are permabans...  TY for proving my point.","replies":[{"poster":"Voldymort","date":"2018-08-13T20:16:57.120+0000","up_votes":1,"down_votes":0,"body":">**none** of those punishments are permabans\n\n>**none**\n\n>(My personal favorite on that site is this indefinite suspension (http://nbafines.tumblr.com/post/1010368028/3-12-96-the-nba-suspended-mahmoud-abdul-rauf-den), simply for refusing to stand during the National Anthem.)\n\nso by your logic, \"indefinite suspension\" =/= permaban\n\n{{sticker:zombie-brand-facepalm}}","replies":[{"poster":"TrulyBland","date":"2018-08-13T20:31:29.689+0000","up_votes":1,"down_votes":0,"body":"To be fair, strictly speaking they are not. In practice I'm not sure if I ever heard of indefinite suspensions being lifted in sports, so I'm sure your point still stands and this is just nitpicking.\nTheoretically, though, \"indefinite\" merely implies that there is no inherent expiration date while \"permanent\" implies that there is no expiration.","replies":[{"poster":"Voldymort","date":"2018-08-13T20:52:58.047+0000","up_votes":1,"down_votes":0,"body":"Since you're nitpicking...\n\n...the riot version of permanant has a timeline. Even if we will be long dead by the 2nd century it's not so much of a permanant ban if it is conditioned by an \"untill\"\n\n{{sticker:slayer-jinx-wink}}","replies":[{"poster":"JRobin31","date":"2018-08-14T23:08:16.753+0000","up_votes":1,"down_votes":0,"body":"Yup, Mahmoud Abdul-Rauf was not perma-banned.  TY for posting.","replies":[]}]}]}]}]}]}]}]},{"poster":"Naramiel","date":"2018-08-11T01:11:59.974+0000","up_votes":7,"down_votes":0,"body":"> [{quoted}](name=The Djinn,realm=NA,application-id=ZGEFLEUQ,discussion-id=Bz5qQa1I,comment-id=,timestamp=2018-08-11T00:50:57.100+0000)\n>\n> * It must *not* be based on anecdotal evidence, such as &quot;this would clearly work&quot; or &quot;it&#x27;s so obvious&quot; or &quot;all punished players return on smurfs&quot; or &quot;everyone would behave this way.&quot;\n\nGood post, but here I think you're setting an impossible standard. Clearly no one's going to have data that proves their method would work (unless they're discussing a straight return-to-the-Tribunal), so it's not really possible to \"prove\" their method would be better as you're demanding.","replies":[{"poster":"Chermorg","date":"2018-08-11T01:14:10.941+0000","up_votes":7,"down_votes":1,"body":"I think Djinn was making the point that, while evidence isn't required that your system will work, if you *do* provide evidence it should be actual evidence and not simply anecdotal.","replies":[]},{"poster":"The Djinn","date":"2018-08-11T01:30:27.508+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=Naramiel,realm=NA,application-id=ZGEFLEUQ,discussion-id=Bz5qQa1I,comment-id=0002,timestamp=2018-08-11T01:11:59.974+0000)\n>\n> Good post, but here I think you&#x27;re setting an impossible standard. Clearly no one&#x27;s going to have data that proves their method would work (unless they&#x27;re discussing a straight return-to-the-Tribunal), so it&#x27;s not really possible to &quot;prove&quot; their method would be better as you&#x27;re demanding.\n\nChermorg has it exactly right. There's a difference between \"you should not base your system off of assumptions\" and \"you must provide hard evidence for everything.\" These are common assumptions that are almost always incorrect, and usually used in place of actual analysis.","replies":[{"poster":"TrulyBland","date":"2018-08-11T01:46:59.256+0000","up_votes":3,"down_votes":1,"body":"I don't think it's necessarily unreasonable to base an idea on assumptions, as long as those assumptions themselves have some kind of logical or empirical basis. What is entirely unreasonable is insisting those assumptions are true (or pretending they are more than just assumptions) when evidence points precisely in the other direction.\n\nTo illustrate my opinion on this, let's look at a classic example: Replacing permabans with permamutes.\nThe idea is based on the reasonable assumption that taking away the tool people use to harass others will make them stop, since escalating to more extreme versions of harassment (trolling/feeding) would actually start directly affecting themselves.\nIt's reasonable enough, in fact, for Riot to have tried it in the past.\n\nJust because the experiment failed doesn't mean the assumption was unreasonable, and as long as people are unaware of this experiment and its outcome, I don't even consider their suggestion unreasonable, even if it turns out to not be actually viable. All biases hurt discussion, outcome bias included.\nThe real trouble in those threads starts only when people fall prey to confirmation bias and try to dismiss or discredit the experiment solely because it contradicts their original assumptions.","replies":[]}]}]},{"poster":"VexingRaven","date":"2018-08-11T04:04:37.387+0000","up_votes":2,"down_votes":2,"body":">It must not create a Prisoner's Island of toxic players in either gameplay or communication.\n\nWhy not?","replies":[{"poster":"Umbral Regent","date":"2018-08-11T04:47:04.564+0000","up_votes":2,"down_votes":3,"body":"[Because Riot has already decided that it wouldn't work.](https://nexus.leagueoflegends.com/en-us/2017/01/ask-riot-banished-to-prisoners-island/)","replies":[{"poster":"VexingRaven","date":"2018-08-11T05:41:23.680+0000","up_votes":7,"down_votes":3,"body":"> [{quoted}](name=Umbral Regent,realm=NA,application-id=ZGEFLEUQ,discussion-id=Bz5qQa1I,comment-id=00090000,timestamp=2018-08-11T04:47:04.564+0000)\n>\n> [Because Riot has already decided that it wouldn&#x27;t work.](https://nexus.leagueoflegends.com/en-us/2017/01/ask-riot-banished-to-prisoners-island/)\n\n>We believe in a real shot at reform for unsportsmanlike players\n\nThat's cute from the company that will send you to a permaban extremely quickly just for complaining.","replies":[{"poster":"Umbral Regent","date":"2018-08-11T06:05:08.785+0000","up_votes":2,"down_votes":4,"body":"If all you do is complain, it would take you quite a while before you actually get permanently banned. It would take a fair number of games before you reach a 10-game Chat Restriction, then a few more before a 25-game CR, then even less towards a 14-day ban, and then one last \"I didn't pay attention\" to push you into a permanent ban.\n\nThose three punishment tiers (or that one punishment tier, depending on the offense(s)) are the period where Riot still believes the player can reform. If you break the rules still after a 14-day ban, then they don't expect you to start following the rules any time soon.\n\nAnd if you happen to get to a permaban \"quickly\", then clearly, you're not just complaining.","replies":[{"poster":"VexingRaven","date":"2018-08-11T06:10:51.362+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Umbral Regent,realm=NA,application-id=ZGEFLEUQ,discussion-id=Bz5qQa1I,comment-id=0009000000000001,timestamp=2018-08-11T06:05:08.785+0000)\n>\n> If all you do is complain, it would take you quite a while before you actually get permanently banned. It would take a fair number of games before you reach a 10-game Chat Restriction, then a few more before a 25-game CR, then even less towards a 14-day ban, and then one last &quot;I didn&#x27;t pay attention&quot; to push you into a permanent ban.\n> \n> Those three punishment tiers (or that one punishment tier, depending on the offense(s)) are the period where Riot still believes the player can reform. If you break the rules still after a 14-day ban, then they don&#x27;t expect you to start following the rules any time soon.\n> \n> And if you happen to get to a permaban &quot;quickly&quot;, then clearly, you&#x27;re not just complaining.\n\nBehaviors take a *lot* longer to unlearn than the relatively small time between applied bans for serious offenders of the sort you'd want to see on a prison island, and you often skip tiers of punishment. Anyway, length of ban is completely irrelevant, since you can't expect the player's behavior to change when they aren't playing. Consistent, smaller punishments are far more effective if they actually want to see reform. And we know they have the ability to detect minor toxicity, since they use it for their honor system shadow bans.","replies":[{"poster":"Umbral Regent","date":"2018-08-11T06:37:42.501+0000","up_votes":2,"down_votes":1,"body":"> Behaviors take a lot longer to unlearn than the relatively small time between applied bans for serious offenders of the sort you'd want to see on a prison island...\n\nAnd Riot's reason for being _against_ a Prisoner's Island-type deal is that lumping those players into a Prisoner's Island - with those who _also_ are toxic, whether by some short lapse or because they just straight up don't give a shit about the rules, it causes those players to take _even longer_ to unlearn those behaviors.\n\nWhy does it take longer? Well, for one, having it be the \"norm\" for them (due to being paired with similarly toxic players) desensitizes them to it, causing them to think it's fine and normal. On top of that, _negativity feeds negativity._ Having to deal with a bunch of toxic flamers will wear at their ability to hold back, and they'll just be toxic and flame back - ultimately ruining any chance that they might have had to unlearn those exact same behaviors.\n\n> ...and you often skip tiers of punishment.\n\nThe only things I've seen result in skipped punishment tiers are:\n\n- Hate speech (Racism, homophobia, disability-related insults)\n- Breaking the rules _during an active Chat Restriction_ (although those are exceedingly rare, and it may not be the case that they do skip tiers, but it's still worth mentioning as a possibility)\n- Encouraging self-harm\n- Death threats\n- Intentional Feeding/Griefing/Trolling (due to those being gameplay-related behaviors, chat restrictions wouldn't do anything)\n\nI don't imagine that skipping punishment tiers happens as often as you say.\n\n> Anyway, length of ban is completely irrelevant, since you can't expect the player's behavior to change when they aren't playing.\n\nSo, the length of the ban is relevant, but the length of chat restrictions are...? That doesn't make much sense.\n\nThe length of the ban is relevant. When Riot kicks you out of their game for two weeks, it should generally occur to most people that they're trying to get a point across. Two weeks is a pretty fucking long time.\n\n> Consistent, smaller punishments are far more effective if they actually want to see reform. \n\nI'd argue that harsh and firm punishments are a better method of telling people they need to reform. Smaller punishments would just get annoying, but keeping fairly lengthy, fairly impactful punishments (25 games where you can't type much, being banned for a whole fortnight) makes sure that they have some sizeable reinforcement to _not_ break those rules.\n\n> And we know they have the ability to detect minor toxicity, since they use it for their honor system shadow bans.\n\nHonor progression being slowed/halted is hardly worth considering a \"ban\". Even still - the minor toxicity that validates those reports _adds up_ to the actual main punishment tiers. They don't just shrug off those cases of minor toxicity and leave it to the Honor System, y'know.","replies":[{"poster":"VexingRaven","date":"2018-08-11T17:17:47.776+0000","up_votes":8,"down_votes":1,"body":"> [{quoted}](name=Umbral Regent,realm=NA,application-id=ZGEFLEUQ,discussion-id=Bz5qQa1I,comment-id=000900000000000100000000,timestamp=2018-08-11T06:37:42.501+0000)\n>\n> And Riot&#x27;s reason for being _against_ a Prisoner&#x27;s Island-type deal is that lumping those players into a Prisoner&#x27;s Island - with those who _also_ are toxic, whether by some short lapse or because they just straight up don&#x27;t give a shit about the rules, it causes those players to take _even longer_ to unlearn those behaviors.\n\nSo instead we permaban them, where they then create a new account, effectively turning low level games into a prisoner's island anyway? That helps them unlearn the behaviors better?","replies":[{"poster":"Voldymort","date":"2018-08-13T05:33:29.201+0000","up_votes":2,"down_votes":0,"body":"riot can't prevent people from making new accounts","replies":[]},{"poster":"Umbral Regent","date":"2018-08-11T22:32:51.075+0000","up_votes":1,"down_votes":1,"body":"The point of the Permanent ban is to have those players leave League, not come back. That some small handful of players _do_ come back does not magically mean that Riot intended to create a pseudo-Prisoner's Island in low-level games.\n\nIt may be a Prisoner's Island-type deal, but it's not one that Riot wanted or intended to make. The players themselves made it that way.\n\nAnd, again; Permanently banning them is not meant to be some warning to reform. That's what the 10-game CR, 25-game CR, and 14-day ban are for. The permanent ban is there to tell those players to _take their business, **and** their toxicity, elsewhere._","replies":[{"poster":"VexingRaven","date":"2018-08-12T21:35:24.726+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Umbral Regent,realm=NA,application-id=ZGEFLEUQ,discussion-id=Bz5qQa1I,comment-id=00090000000000010000000000000000,timestamp=2018-08-11T22:32:51.075+0000)\n>\n> The point of the Permanent ban is to have those players leave League, not come back. That some small handful of players _do_ come back does not magically mean that Riot intended to create a pseudo-Prisoner&#x27;s Island in low-level games.\n> \n> It may be a Prisoner&#x27;s Island-type deal, but it&#x27;s not one that Riot wanted or intended to make. The players themselves made it that way.\n> \n> And, again; Permanently banning them is not meant to be some warning to reform. That&#x27;s what the 10-game CR, 25-game CR, and 14-day ban are for. The permanent ban is there to tell those players to _take their business, **and** their toxicity, elsewhere._\n\nWell, we can talk all we want about what is intended, but what is intended is not what happens.","replies":[{"poster":"Umbral Regent","date":"2018-08-12T23:13:24.668+0000","up_votes":1,"down_votes":0,"body":"But Riot's intent is the whole point of what you and I are discussing. You asked, at the very beginning, \"why no Prisoner's Island?\", and I told you (with a link to the Ask Riot article explaining it) that Riot doesn't want a Prisoner's Island solution to toxicity.\n\nYou got your answer, and then, for whatever reason, started to argue about the _Player-made Prisoner's Island_ as though that somehow changes the point. Riot doesn't want it, they didn't intend for it to happen, and I'm not sure what your point is about it.\n\nEven looking back to your previous replies, the only point I could really gather is that you seem to think that Riot, by some means, _does_ intend to make a Prisoner's Island, because some handful of permabanned players come back and make one for themselves...But that just makes no sense.\n\nEither way, I see no point in continuing this discussion past this response, so I'll be bowing out.","replies":[]}]}]}]}]}]}]},{"poster":"Voldymort","date":"2018-08-11T05:51:13.017+0000","up_votes":4,"down_votes":0,"body":"You can complain without being toxic tho","replies":[{"poster":"VexingRaven","date":"2018-08-11T06:11:29.001+0000","up_votes":7,"down_votes":2,"body":"> [{quoted}](name=Voldymort,realm=EUNE,application-id=ZGEFLEUQ,discussion-id=Bz5qQa1I,comment-id=0009000000000000,timestamp=2018-08-11T05:51:13.017+0000)\n>\n> You can complain without being toxic tho\n\nCan you? Being negative is explicitly against the rules.","replies":[{"poster":"Voldymort","date":"2018-08-11T07:21:20.422+0000","up_votes":4,"down_votes":3,"body":"complaining =/= being negative","replies":[{"poster":"VexingRaven","date":"2018-08-11T17:16:03.881+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Voldymort,realm=EUNE,application-id=ZGEFLEUQ,discussion-id=Bz5qQa1I,comment-id=000900000000000000000000,timestamp=2018-08-11T07:21:20.422+0000)\n>\n> complaining =/= being negative\n\nTell that to literally everybody up to and including those voting in the old tribunal, where bans for complaining were common because \"it's annoying\".","replies":[{"poster":"Voldymort","date":"2018-08-11T18:32:29.265+0000","up_votes":2,"down_votes":2,"body":"except the old tribunal hasn't been a thing in a few years","replies":[{"poster":"VexingRaven","date":"2018-08-12T21:34:11.467+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Voldymort,realm=EUNE,application-id=ZGEFLEUQ,discussion-id=Bz5qQa1I,comment-id=00090000000000000000000000000000,timestamp=2018-08-11T18:32:29.265+0000)\n>\n> except the old tribunal hasn&#x27;t been a thing in a few years\n\nAnd you think people's attitude has changed because of it? People hate complaining more than anything.","replies":[{"poster":"Voldymort","date":"2018-08-13T05:22:37.358+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=VexingRaven,realm=NA,application-id=ZGEFLEUQ,discussion-id=Bz5qQa1I,comment-id=000900000000000000000000000000000000,timestamp=2018-08-12T21:34:11.467+0000)\n>\n> And you think people&#x27;s attitude has changed because of it? People hate complaining more than anything.\n\nno matter what happens, there will always be complaints","replies":[]}]}]}]}]}]}]}]}]}]},{"poster":"Shädäm","date":"2018-08-11T02:23:10.264+0000","up_votes":6,"down_votes":2,"body":"At the moment, the system's strictness towards toxicity makes it so easy to abuse. Ive met players that provoke you to the point you say the word. Even if you mute them, provoking toxicity is just so easy by griefing ones game. And the fact that you get a 2-week for saying the word, but can get away with a 0/20 5xTear + Moby Boots build at the same time is just ridiculous. And im saying this example because ive made reshearces (yes, you can say, I inted on a test account to see if I get banned)\n\nThere is no risk in griefing. People do it left and right. And just compare the two cases:\n\nBeing in a hard game with not so well performing players, but you know you cant say a word because of the risk of getting chat-resteict. or even 2-week - Actually, the problem is not here. The system works fine if you consider this\n\nBut the other case:\n\nGetting your champ banned so you just say \"fk it\" and decide to prevent the teammate from winning. You dont feel risks, in fact, you feel the power of the system on your side, as they either have to dodge and get penalized, or have to sit through the game with you trolling on intention.\n\nBut at the end of the day, im just another crying player that claims, his team always trolls. I mean, this is what most people would say after reading this","replies":[]},{"poster":"mlm olo mlm","date":"2018-08-11T01:39:50.768+0000","up_votes":8,"down_votes":4,"body":"> It must not enable **more toxicity against non-toxic players** than the current system.\n\nShouldn't we strive to prevent toxicity towards EVERYONE? \n\n> It must not place the burden of avoidance on the victim of harassment.\n\nWell, expecting the one doing the harassing to avoid the harassment is a little not possible. The burden is always going to be on the victim. The good news is Riot has provided easy avoidance methods. \n\n> It must not increase the chances of players tilting their teammates.\n\nI don't even know what that means. Isn't that the same as your first point? Tilting your team mates is not toxic?\n\n> It must not create a Prisoner's Island of toxic players in either gameplay or communication.\n\nAlready is one. I understand why you brought that up though and know your hands are tied.\n\n> It must not forcibly reduce team communication.\n\nWhat if team communication is the problem?\n\n> It must not lead to players finding other in-game ways to be toxic.\n\nTired of this stupid argument. Players look for loop holes in the system. Old news. \n\n> It must not be based on anecdotal evidence\n\nI've never seen Riot. moderators, or public use scientific data in their arguments. Probably because y'all have none. \n\n> You must be willing to accept the data Riot has told us regarding the system\n\nBull shit. All \"data\" Riot has given us is out-dated and incomplete.","replies":[]},{"poster":"Imperial Pandaa","date":"2018-08-11T01:07:36.092+0000","up_votes":3,"down_votes":0,"body":";-; \n\nMade something like this recently. This is much better worded though.","replies":[]},{"poster":"MYSTlCFLOW","date":"2018-08-11T06:09:16.690+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=The Djinn,realm=NA,application-id=ZGEFLEUQ,discussion-id=Bz5qQa1I,comment-id=,timestamp=2018-08-11T00:50:57.100+0000)\n\n> * It must *not* create a Prisoner&#x27;s Island of toxic players in either gameplay or communication.\n\nhuh thats odd, I made a new account and If I didn't know any better it's where all the banned people end up.  my last game had a support who didn't like what the bot laner chose and decided to go smite nunu and follow the nidalee around and steal camps making the nidalee afk..\n\nthere's always someone toxic or afk or inting when leveling up, almost like... the banned players got sent to low level..... huh. \n\nout of curiosity has anyone else recently created a new account and leveled up?  what was your experience like","replies":[]},{"poster":"JRobin31","date":"2018-08-11T17:51:40.228+0000","up_votes":1,"down_votes":2,"body":"My proposal is to improve the punishment system is to remove notifications to players that their actions have resulted in a punishment.\n\nProblems with the notifications:\n1. It rewards negative sentiment towards others.\n2. Players build an expectation to receive a notification that a player was punished that leads to feelings of aggravation when they do not.\n3. Encourages the negative behavior of stalking other players (to see if they are punished or to what degree).\n\nAddendum:\nThe punishment system is not a system of \"justice\".  Its purpose is not for players to get \"revenge\" for being badly treated in games.  The purpose of the punishment system is to promote a better playing environment for everyone.  These notifications of punishment serve as affirmations that the system is supposed to get you personal justice/revenge on those who have wronged you in a game.","replies":[{"poster":"Sgt Sneaky Pants","date":"2018-08-11T19:19:12.470+0000","up_votes":3,"down_votes":0,"body":"But this solution leaves players frustrated with Riot because they feel like the system isn't working or protecting them.  In \"real life\" when you file a complaint, you expect a response/resolution. \n\nLet's build on the idea: take it a step further and REMOVE post-game reports completely.   They report button is so easily accessible that it's almost like they want you to report people.  More often than not, people report players for revenge (as you mentioned) because it's easy.    If it's not as simple/easy to report, maybe the reports that are received will actually be legit. If you really feel that something is worthy of a report, reports can be moved to another area of the client or website.  Increasing the barrier of entry will decrease overall report activity, and increase accuracy of reports. \n\nIn the background, Riot can actively look for toxic behavior like inting/multiple AFks, or severe words (racial slurs, hate speech, or self harm) and have a group of PLAYERS review chat logs ANONYMOUSLY and decide whether to punish or not.  Would need a balanced system in place so SJWs don't punish comments that are maybe mean or negative, but not truly toxic.\n\nThis does a few things:\n1) players get involved in decisions, Riot isn't a police state\n2) reports are moved out of client, so it actually takes effort to report somebody, making reports more viable\n3) truly toxic behavior/speech is punished, but \"you're bad at jinx\" is no longer reported (Yes, I think you should be able to tell somebody they're playing poorly without harassing them.  Sorry, reality isn't always positive - you can't tell coworkers that \"only positive reinforcement is allowed!\")\n4) people learn to actually USE the mute button rather than engage the troll with the hope that a report will end him/her","replies":[{"poster":"JRobin31","date":"2018-08-12T17:55:13.002+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sgt Sneaky Pants,realm=NA,application-id=ZGEFLEUQ,discussion-id=Bz5qQa1I,comment-id=00120000,timestamp=2018-08-11T19:19:12.470+0000)\n>\n> But this solution leaves players frustrated with Riot because they feel like the system isn&#x27;t working or protecting them.  In &quot;real life&quot; when you file a complaint, you expect a response/resolution. \n> \n\nYou say my solution leaves players frustrated with RIOT because they feel the system isn't working or protecting them.\n\nBut I pointed out that players are frustrated, _in the current system_, when they don't receive feedback that a player has been punished as a result of reports.  They expect a response/resolution _when no such response or resolution is called for_!\n\nThe notifications of punishment, in the current system, promote the perception that the system is there for players to get revenge while making it seem as if the system isn't doing a good enough job of it because _many reports don't result in a punishment_.\n\nPlayers will say they like the notifications.  The notifications make them 'feel good'.  And this is exactly why the notifications are bad!  Because they are 'feeling good' about causing other players suffer!  Revenge achieved!  Suck it!\n\nYour proposal to make the reporting process more difficult for players should be made in response to the OP, because it has no relevance to my proposal.\n\nI propose that RIOT should remove messages notifying players that their actions have led to others being punished.","replies":[]}]}]},{"poster":"IdveYsUfSK","date":"2018-08-11T18:01:13.833+0000","up_votes":2,"down_votes":0,"body":"My suggestion is to have a **low priority queue** for leavers and toxicity. Why leavers are added is because games are already super short nowadays. Don't play if you don't have the time. Ruins the game for other 9 people. Once you are flagged you will have to clear for five times, with each toxic game adding one count while clearing.\n\nHow it works:\nFlagged for leaving games/toxicity?, you have to wait for 5 mins, afterwards you have a confirmation popup that you have to accept within a small time frame.\nThen you will be assigned to the normal queue.\nThe 5 mins will be the time for the player to reflect on his/her toxic behavior.\nDuring this 5 mins riot can choose to put brainwashing advertisements on why being non toxic is better for you.\n\"Featuring reformed players. If they can do it, you can do it too.\"\nThe 5 mins can be alternatively be tuned to have random time intervals of multiple confirmation popup, 2 or more. This is needed as the toxic user can simply wait out by doing other things.\nConfirmation popup would have messages like:\nI would turn over a new leaf :OK:\nLet me start anew :OK:\nI promise to change :OK:\netc.\n\nAll these can be built into the client easily.\n\nIts about repetition and conditioning the player to become less toxic. This is all part of psychology.\nThe problem is there are **no consequences** for which what those baddies can do, so they keep on doing it. This has gone for almost a decade without being solved.\n\nI currently play in one of the most toxic servers which is not NA. There's a new form of undetectable toxic behavior which is deliberate INTing with a non ridiculous death count end game and not type anything with a goal to create meaningful leads for enemy. I call it the macro INTing or pretending to play while baiting teammates to die. These players are having fun doing it. They usually press stop/spam laugh after engage or just run into enemy or tower doing nothing(no skill/autoattack).","replies":[]},{"poster":"Log Dog","date":"2018-08-11T12:20:09.191+0000","up_votes":3,"down_votes":1,"body":"Make something like Overwatch in CS:GO, where community (I suggest Platinum+) can review the reports, I suggest this for the inting part, but for the flaming part of the reports as well. Or just fix the damn ban system for trolling. It should automatically detect if someone flashes under enemy turret and stays still or something like that, at least that's super easy to create.","replies":[{"poster":"FurriesAreHot","date":"2018-08-11T22:05:17.134+0000","up_votes":1,"down_votes":0,"body":"Overwatch is used for Cheating bans for a reason.","replies":[{"poster":"Log Dog","date":"2018-08-14T08:39:53.451+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Xäyąh,realm=NA,application-id=ZGEFLEUQ,discussion-id=Bz5qQa1I,comment-id=000d0000,timestamp=2018-08-11T22:05:17.134+0000)\n>\n> Overwatch is used for Cheating bans for a reason.\n\nAnd that reason is?","replies":[{"poster":"FurriesAreHot","date":"2018-08-14T17:47:43.591+0000","up_votes":1,"down_votes":0,"body":"The people who get access to it don't cheat, and probably never will. They're judging something purely off if the player is gaining an upperhand, which is far easier to tell for skilled players than the completely subjective nature of toxicity.","replies":[]}]}]}]},{"poster":"Lux Is Mai Waifu","date":"2018-08-11T03:21:26.122+0000","up_votes":3,"down_votes":1,"body":"what about actually building 2-factor (discord has it, and is worth 10 times less than Riot Games), and using phone numbers to stop people from making a new account for ranked to avoid bans?\nit would put a higher price on ban evasion, and the account security system wouldn't be a relic of the 90s","replies":[]},{"poster":"SorenAlucard","date":"2018-08-11T18:47:25.075+0000","up_votes":2,"down_votes":1,"body":"I think this discourse doesn't go far because there are fundamental value differences.\n\nThe argument usually stops at the definition of \"victim\", or \"harassment\".  Also, there's difference in servers. The PC motives are pretty apparent in NA/EU, whereas competition and using your mute have remained fundamental in the other servers where such views aren't valued.\n\nI've seen a few interviews, including one with aphromoo, mentioning how solo q for NA is a waste of time or not a good place for a player to grow and learn things. One side thinks that we've made progress in terms of behavioral management, the other side feels like we've done the opposite. I don't really know how to reconcile a happy medium between the two?\n\nidk, mainly just an observation :p","replies":[]},{"poster":"The Highest Noon","date":"2018-08-11T14:39:03.395+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=The Djinn,realm=NA,application-id=ZGEFLEUQ,discussion-id=Bz5qQa1I,comment-id=,timestamp=2018-08-11T00:50:57.100+0000)\n>\n> * It must *not* place the burden of avoidance on the victim of harassment.\n\nThe current system already does this, telling people that they should just mute any harassment and if they respond then they're just enabling toxicity. I don't think that last part applies, though. Can you elaborate on this point, because I'm pretty sure that I'm misunderstanding it.\n\n> * It must *not* forcibly reduce team communication.\n\nThis one is weird, because Riot themselves already punish players by reducing team communication. I don't understand why player-created ideas are wrong when even though it's right for official ideas. If Riot has proven anything, it's that reducing communication is the best idea, which makes sense given the belief which is supported by both Riot and players that textual communication is unnecessary--something that was said before pings and emotes became as prevalent as they are today. We have ways of communicating everything necessary without the use of chat so this shouldn't be an issue.\n\n> * It must *not* lead to players finding other in-game ways to be toxic.\n\nSomething else I need explanation on, because the current system already leads players to finding other in-game ways to be toxic. \n\nSomeone's punished for chat? They\n\n*  troll while saying they're trying.\n*  feed while pretending that they're just making silly mistakes.\n*  refuse to assist teammates, blamming ping.\n*  do nothing and blame cooldowns.\n*  do nothing and say something like \"Oh, but you said--\"\n*  etc\n\nThe worst part is that victims of such really don't have a way to prove that it's toxicity, which sucks. I've been both victim and witness to it, and I don't really know what to do besides just reporting it and trusting the system to work.\n\nMost of what you said's spot-on, but some of it makes no sense given the current system. Maybe those're just my misunderstandings, though. CRITICIZE ME, CAP'N!","replies":[]},{"poster":"Huya90666","date":"2018-08-11T07:30:10.264+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=The Djinn,realm=NA,application-id=ZGEFLEUQ,discussion-id=Bz5qQa1I,comment-id=,timestamp=2018-08-11T00:50:57.100+0000)\n>\n> Hey all!\n> \n> Love it or hate it, the punishment system is one of the most frequent topics here. We have people adamantly defending it, people deriding it at every opportunity, and everything in between. What we *don&#x27;t* have as much of, though, is good conversations about proposed changes.\n> \n> As such, here&#x27;s a primer on what I think a suggestion needs to do in order to be something that might actually gain traction here or with Riot.\n> \n> ------------------------------------------------------\n> \n> * It must *not* enable more toxicity against non-toxic players than the current system.\n> * It must *not* place the burden of avoidance on the victim of harassment.\n> * It must *not* increase the chances of players tilting their teammates.\n> * It must *not* create a Prisoner&#x27;s Island of toxic players in either gameplay or communication.\n> * It must *not* forcibly reduce team communication.\n> * It must *not* lead to players finding other in-game ways to be toxic.\n> * It must *not* be based on anecdotal evidence, such as &quot;this would clearly work&quot; or &quot;it&#x27;s so obvious&quot; or &quot;all punished players return on smurfs&quot; or &quot;everyone would behave this way.&quot;\n> * You *must* be willing to accept critique.\n> * You *must* be willing to accept the data Riot has told us regarding the system, as otherwise there is no common ground to discuss things from. Any changes would need to be approved by Riot as well as the community, which means that if your system can&#x27;t stand up to an argument based on Riot&#x27;s data than it is dead on arrival.\n\nfor all of those points, maybe you should think of which would be the better option. what can u sacrifice to gain a better ingame experience. maybe for example a reduced team communication (especially in lol where the not typing does not affect ur win or lose - dopa apdo) will be better thana flamer who flames in 20 ranked games before he get banned and then messes with new players. the problem with all those posts of a new system is, that we experience the current system and see how it works while none of you have ever experienced for example my system.\n\nyou cant see the outcome now just because a similar one didnt work a few years ago (especially if this was obviously not thought thru), the game and the community has changed. \n\nBig wins come from big sacrifices. and maybe we have to sacrifice some of those points above to win the \"fight\" against flamers. but you, djinn, are obviously one of those stubborn defenders and there is no way to change your mind, which is fine, its unlikely anyone here can change mine ... but this is because i play lowlevel accs, this is because i have been everywhere from plat 3 in flex to bronze 1 in 3v3. this is because i see and feel the current system as a flamer and on my current account as someone who is with lvl 21 almost honor lvl 3. so yeah, i am stubborn about it and you are either a riot fanboy (which is nothing bad) who will defend it no matter what or actually believe the current system works. but you know, ask every lvl 20- player in my friendslist why they stopped playing, ask them how the system works. \n> \n> --------------------------------------------------------\n> \n> If your proposal can hit these main points, there might be merit to it! Remember to present your ideas on their own merits though -- if your thread reads as an attack on the current system rather than an analysis and suggested improvements, the conversation is unlikely to focus on the improvements but rather on the attack.","replies":[]},{"poster":"XinZhao2WinNhao","date":"2018-08-12T23:22:22.531+0000","up_votes":1,"down_votes":0,"body":"I propose to bring back tribunal with replays for inters and griefing that cannot be detected easily by a bot. The summoners who judge those cases of course should have a clean record and no bans in their past.","replies":[{"poster":"Voldymort","date":"2018-08-13T05:28:28.549+0000","up_votes":1,"down_votes":0,"body":"> with replays for inters and griefing that cannot be detected easily by a bot. \n\nIf the bot can't detect them then how did they come to be refferenced?\n\n{{sticker:sg-lux-2}} \n\n>The summoners who judge those cases of course should have a clean record and no bans in their past.\n\nBans for toxicity coming from the \"i've been playing for 4+ years and have never been banned\" players happen all the time.","replies":[]}]}]}