{"poster":"Forellenprinz","date":"2019-01-16T22:15:13.741+0000","title":"Auf den Spuren von BurritoOfDoom - Jungler f체r die Summoners Inn League","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Ein herzliches Hallo an alle Beschw&ouml;rer auf der Kluft!\r\n\r\nDie 2. Season der Summoners Inn League geht Ende Januar los und wir w&uuml;rden dort gerne einige Erfolgserlebnisse sammeln.\r\n\r\nWir sind auf der Suche nach einem Jungler f&uuml;r unser Team.\r\n\r\nErstmal stellen wir uns generell einmal vor:\r\n\r\nTop Lane: Unsere Top Lane spielt die Lane gerne aggressiv und spielt am Liebsten Darius, Irelia, Fiora, Heimerdinger und Kayle. Ist ein ehemaliger professioneller Spieler von Vainglory (MOBA f&uuml;r iOS Ger&auml;te). Versteht taktisch vom Spiel  viel und ist jemand, der mit Druck und schwierigen Situationen ausgezeichnet umgehen kann. \r\n\r\nMid Lane: Auf der Mid Lane haben wir zweifelsfrei die st&auml;rkste Besetzung. Spielt seit 3 Jahren schon Konstanz auf Diamond 2 - Master Niveau und ist ein Playmaker. Gerade seine Pressure im Early - Mid Game ist extrem stark. Zu seinen st&auml;rksten Champions geh&ouml;ren Cassiopeia, Kassadin, Katharina und Akali. \r\n\r\nADC: Unser ADC liebt Hypercarrys die ins Late Game skalieren. War in Season 5 Platin 1 und kurz vor Diamond. Spielt am liebsten Tristana, Vayne, Kai&#039;sa und Jinx. Macht sehr gerne gerade im Mid-Game sehr aggressive Calls nach dem Motto &quot;High risk, high reward&quot;. \r\n\r\nSupport: Nun kommen wir zu meiner Wenigkeit: Rein von dieser bunten ELO-Mischung auf jedenfall das schw&auml;chste Glied in der Kette. Ich bevorzuge Shield-Supporter wie Lulu, Nami und Janna, bin aber auch in der Lage, Tank-engage Supporter wie Leona und Alistar zu spielen. Gebe selber nie auf und bin in einem funktionierenden harmonierenden Team definitiv ein solider Gold-Supporter der Calls macht und zumindest das Spiel um die Vision verstanden hat.\r\n\r\nNun kommen wir zu den Erwartungen vom Jungler:\r\n\r\nDu solltest idealerweise sowohl Cinderhulk-Jungler wie Sejuani spielen k&ouml;nnen, als auch Xin Zhao, Elise, Camille, die bekannt daf&uuml;r sind, early sehr viel pressure auf der Lane auszu&uuml;ben um diese zu snowballen. Du solltest tilt-proofed sein, viel Spa&szlig; verstehen und ingame Informationen gut ans Team kommunizieren. Jemand auf Gold/Platin w&auml;re nat&uuml;rlich ein Tr&auml;umchen. Da wir fast alle schon Mitte 20 sind, w&auml;re es cool, wenn du zumindest 20 Jahre alt bist. \r\n\r\nWie ihr seht, sind wir ein bunter Haufen Leute, die neben dem Spa&szlig; am Spiel auch ein ambitioniertes Ziel verfolgen. \r\n\r\nW&uuml;rde mich sehr freuen, wenn ihr mich bei interesse unter meinem Ingame &quot;Forellenprinz&quot; einmal adden k&ouml;nntet. \r\nIch freue mich auf eure R&uuml;ckmeldung.","replies":[{"poster":"ROM DeathLord","date":"2019-01-17T04:19:22.715+0000","up_votes":1,"down_votes":0,"body":"Welche division spielt ihr","replies":[{"poster":"Forellenprinz","date":"2019-01-17T19:25:08.739+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ROM DeathLord,realm=EUW,application-id=ElKI1ocy,discussion-id=xERqdRqg,comment-id=0000,timestamp=2019-01-17T04:19:22.715+0000)\n>\n> Welche division spielt ihr\n\nNaja, wir spielen ja noch in keiner Summoners Inn Division. Wir haben Ende Januar am 26. und 27. Januar die Preseason wo wir eben diese Spiele haben. Erst danach wird sich zeigen, wo wir genau landen. Das kann man aktuell eben noch nicht sagen.. Da ich auch keinerlei Vorerfahrung in diesem Turnier habe, w체rde ich mal Division 4 oder Division 5 als realistisch einstufen.. Wenn man bedenkt, was bei Division 1 und auch 2 schon f체r Namen rumlaufen wird das sicher kein selbstl채ufer.","replies":[]}]}]}