{"poster":"slendytubby12","date":"2016-05-11T10:05:00.161+0000","title":"Shaco Rework Concept","subforum":"Player Creations","up_votes":1,"down_votes":0,"body":"So I&#039;m just gonna start by admitting I&#039;m bronze IV and am fairly trash at the game, so feedback for the concept is greatly appreciated, even if it is a straight up rant about how crap it is, it&#039;ll let me know not to try this again until I have a better understanding of the game.\n\nSo basically I heard rumors of a Shaco rework being planned by Riot, and seeing as the Jester is one of my favorite champs in the game, I figured I wanted the Rework to keep his identity of being an evasive, gank heavy jungler, while removing some of the things about him the make him so frustrating to play against. So here goes...\n\nPassive - Backstab\nI honestly believe that this passive is fine as-is, it has room for counterplay with simply turning and facing the shaco, while still allowing the Jester to get a nice 20% bonus to a stattik shiv empowered crit coming out of invisibility. \n\nQ - Deceive\nNow this is the ability that I feel make a Shaco&#039;s opponent so frustrated playing against him. The fact that it provides invisibility _as well_ as a blink makes it pretty much impossible to chuck a pink down and reveal the Shaco&#039;s location without some god-like predictions.\n\nWhat should be changed: I feel that the invis should be kept, as it is one of the key things that makes Shaco who he is, however the blink should be removed from the ability as it combined with the invisibility is an incredibly hard ability to counter, allowing Shaco almost 100% safety when the spell is up. However I do believe that Shaco needs some form of mobility to maintain his identity as a gank orientated jungler, so the mobility will be moved onto another spell which I will get to shortly. Of course we will leave the crit on his next attack to allow for some nice synergy with my idea for his 'E'.\n\nW - Jack in the Box\nThis was a rather problematic spell back in the early stages of league, where Shaco&#039;s would stack huge amounts of them in one bush to basically insta-gimp whoever happened to walk by. While Riot nerfed this by making the boxes only last one minute, it makes it incredibly difficuilt for the shaco to use the boxes late game, as they are usually instantly killed in teamfights, or expire before they can be used to full effect.\n\nWhat should be changed: Firstly, I believe the boxes health bar needs to be changed so it does not instantly die upon being placed in the late game. I recommend a system similar to wards, in which after the Box is basic attacked twice, it will go down (That is only basic attacks, no spells). Why twice? Because this is generally how long the Box lasts when clearing jungle camps, so it won&#039;t affect his already fast clear speed, while still allowing the Shaco to actually place a box in the late game.\n\nSecondly, I believe causing the boxes to expire after 1 minute kind of defeats the purpose of using them as strategic weapons to play mind games with the enemy jungler, or setting them up for a nice fear from a well-placed box in the middle of a teamfight. However if the time is increased, we may see a return of the box-stacking Shaco&#039;s, which again is not something that Boxes should be used for.\n\nWhat should be changed: The duration of each box before it times out should be increased to 3 minutes, this allows the Shaco to set up Boxes beforehand to potentially block off an escape path during an invade, or to protect his own jungle camps for a short while. However if a Shaco chooses to stack boxes on top of each other to attempt a near-oneshot, each box after the first one to strike an enemy champion should deal 20% damage. This will allow the boxes to be used in a way that fits Shaco&#039;s playstyle without getting this ridiculous box stacking trend.\n\nE - Two Shiv Poison\n\nThis is an ability that I believe is rather balanced, but due to changes made to the other abilities, and the fact that Shaco needs to get mobility from somewhere I have come up with something that I personally believe would be quite cool.\n\nWhat should be changed: The knife should become a straight line skill shot, similar to Fizz&#039;s in that it does not have to travel the max range if the Shaco does not wish it. Now, when the knife strikes an enemy unit or gets to the end of it&#039;s range it would become lodged in the enemy unit or the ground respectively.\n\nWhen a knife becomes lodged in an enemy unit they are slowed by 15/20/25/30/35% for 3 seconds, and if the Shaco lands a crit on the unit the Knife is pulled free, dealing 25/45/65/85/105 + 0.5 bonus a.d. and doubling the slow for 1 second. This is a cool little ability that will synergise with the crit Shaco gets from his q, basically giving him the damage to actually 1v1 people and burst carries without being incredibly fed. But of course, you are probably wondering where the mobility I promised is coming from...\n\nIf the knife is lodged in the ground, Shaco can reactivate the ability to teleport to the knife. There it is, I decided to use this for Shaco&#039;s blink as it stops him from being able to teleport while invisible, something that is very hard to counter. It also forces Shaco to choose between lodging the knife in the enemy champion for damage, or lodging it in the ground for the blink, for me it just adds some more depth to Shaco&#039;s ganking, allowing him to make a decision based on the lane he is ganking. E.g. he might use the E for damage when ganking for a Maokai, as the Maokai will be able to cc the enemy laner long enough for Shaco to get close, while if ganking someone like a zed he might use the e for mobility as the Zed will most likely have the damage to make up for the lack of E from Shaco.\n\nR - Hallucinate\n\nThis is another spell that I feel is very balanced and has plenty of counterplay. An experienced league player will be able to spot out a clone from the real thing, unless the Shaco himself is very good, in which case he deserves the outplay. However if these changes did go through and ended up being a bit on the OP side, I would hit the clone&#039;s explosion base damage.\n\nSo that&#039;s all folks! Tell me what you think, and if you would be happy seeing these changes in game!\n\nSlendy out.","replies":[{"poster":"bloodmoth","date":"2016-05-14T05:50:15.967+0000","up_votes":2,"down_votes":0,"body":"I think to understand the passive, you have to really understand why an opponent would have their backs to you.\n\nThis ability is almost strictly used to finish off fleeing opponents, its useless if the opponent is strong enough to fight back and everything if they are not.\n\nBasically its a win more passive, not too sure if its healthy, but i suppose it functions on an assassin...\n\nhis Q is attrocious! how you get a blink and a stealth on one ability is beyond me, so something has to give, agreed there!\n\nW, jack in the box is a very interesting ability, and very unique, i have my own idea on how to fix it, but it involves changing the ability a fair amount.\nbasically, remove HP from it entirely, if its too high its a pain in the ass and will be ignored, too low and it has no effect. I would remove the HP in favor of a different form of counterplay, which is for the box to have a delayed activation, like Jihns traps!\nSo enemy walks into a bush, he sees an inconspicuous Jack-in-the-box, then hears a little tune play then BAM! motherfucker gets feared and shot at by a frikkin clown head on a spring!\nThematically and for gameplay purposes it would do a hell of alot for the ability, whats more he could use it in team fights for disruption, whats EVEN more is that enemies can disarm the trap by triggering it and stepping off. All around its a much healthier ability while keeping to its true function.\n\nAs for duration, i really wouldnt want to see that increased, teemo is commonly called satan for having a similar ability! long duration traps are more annoying than anything. Preferably, i think he would benefit from a longer cast range.\n\nI like the idea of the teleporting aspect of shacos knife, but rather have it able to teleport if the target is hit as opposed to it not being hit. also make the skillshot very narrow but very fast, like a boot knife.\n\nOver all i think the gameplay would be much more satisfying for shaco players and people playing against him.\n\nShaco would stealth past wards, place a box, then reveal himself to toss a knife at a targed, dashing to it and doing horrible nasty stuff. The fact that he has to reveal himself before closing i think makes a HUGE change!","replies":[]},{"poster":"GRIM Spirit","date":"2016-05-12T09:28:53.019+0000","up_votes":2,"down_votes":0,"body":"These are actually pretty legitimate changes to Shaco.\n\nOne thing you didn't mention was if his Q would maintain the 'next auto attack always crits for % extra damage'. I think that should stay the case, so Shaco players who are good at landing max range E's would get rewarded by going invisible and sneaking their way up to the enemy who is slowed.","replies":[{"poster":"slendytubby12","date":"2016-05-12T10:15:30.272+0000","up_votes":1,"down_votes":0,"body":"Yeah I did intend to leave the crit in with the que, I'll make sure to edit that in. :)","replies":[]}]},{"poster":"RHIN0","date":"2016-05-12T00:46:12.955+0000","up_votes":1,"down_votes":0,"body":"Not much of a shaco player, but I like the sound of these changes. Good Job!","replies":[]}]}