{"poster":"Wolf Commander","date":"2019-01-11T06:59:42.622+0000","title":"Voy ganando teoricas 5 de 10 partidas estando unranked y no me aparecen en ningún lado, que onda?","subforum":"Problemas Técnicos","up_votes":7,"down_votes":1,"body":"Todo genial con las actualizaciones, pero me da la impresión que estoy jugando normales, me figuran las victorias en el historial pero la liga de la S anterior ya fue y tampoco me toma como si estuviese clasificando... \nTraten de ponerle 512Mb mas de ram al Pentium 4 que tienen de servidor asi tal vez se corrija el problema del parche, llegan a arreglarlo y no me aparecen las victorias o llego a ganar las 10 de 10 y no me las toma y les voy a mandar a Sauron con sus secuaces para que les prenda fuego el router Cisco (Broma) de todos modos, siempre problemas, jamas una solución... Fíjense eso... Besos.","replies":[{"poster":"Wolf Commander","date":"2019-01-11T07:12:03.278+0000","up_votes":2,"down_votes":0,"body":"Esa es mi duda, porque Riot es bastante malo arrelgando bugs, onda, mañana dicen se arreglo! Pero arrancas las 10 partidas de cero... Si pasa eso voy a tener que buscar a alguien para partirle la madre...","replies":[{"poster":"Shirotani","date":"2019-01-11T07:27:34.097+0000","up_votes":1,"down_votes":0,"body":"El reinicio de las ligas es el 23 con el parche 9.2, recien ahí vas a poder hacer las 10 partidas de posicionamiento de la temporada 9.","replies":[{"poster":"Q Q WARD W HIKU","date":"2019-01-11T21:57:32.844+0000","up_votes":1,"down_votes":0,"body":"si? yo no jugué en toda la season del 2018, volvi este año y  jugué las 10 partidas y me dejaro en hierro 3 ._________. ni sabía que estaba esa nueva liga... En fin ojalá sea como vos decis asi las vuelvo a jugar.","replies":[]}]}]},{"poster":"SBL Nightel","date":"2019-01-11T11:12:54.490+0000","up_votes":1,"down_votes":0,"body":"Si te fijas en los foros hay 200 posts sobre esto, es un bug.","replies":[]},{"poster":"NøPuedenCønmigø","date":"2019-01-11T08:18:07.859+0000","up_votes":1,"down_votes":0,"body":"deja de jugar bro... a mi me sucedio hace un par de años que gane 40 partidas seguidas, si no es broma, gane 40 seguidas porque justo habia arreglado mi internet y resulta que mi limitante era eso, comence a ganar por mis conocimientos, y justo ahi estaban reparando los pocos lp que le daban a los diamantes (habian metido la liga master y se deshabilito todo el sistema de puntos), los diamantes se quejaban porque ganaban 4-7 puntos cada vez que ganaban y les restaban 22-23 puntos cada vez que perdian. y a mi estando en oro en ese tiempo me quede en 100 puntos de oro 4 y ganaba y ganaba y ganaba y seguia con 100 puntos, envie ticket y me dijeron que una vez lo reparara apareceria en oro 1 -platino5(mas o menos calculando las win y las ganada de promo, etc), luego se desbugeo el sistema y seguia ahi en oro 4 con 100 puntos... ¿what? envie tickets, tickets, ticket y me ignoraron todos los que tenian que ver con ese tema. basicamente hicieron la vista gorda. \n\nen conclusion, jugue por jugar sin ganar y perder puntos. (bueno, no perdi ninguna... ) si incluso le envie 4 screenshot mostrando mi historial de win y demostrando que era veridico lo que decia, con fecha y todo :/.","replies":[]},{"poster":"Shirotani","date":"2019-01-11T07:09:31.344+0000","up_votes":1,"down_votes":0,"body":"Es un bug.\n\n> [Estamos analizando los reportes de clientes que muestran recompensas de fin de temporada correspondientes a una clasificación distinta. Esto no afectará su posicionamiento o emparejamiento actual.](https://i.imgur.com/J2sxfjP.jpg)\n\n---\n\n[[Info] Problemas con Información de Clasificatoria](https://boards.las.leagueoflegends.com/es/c/ayuda-y-soporte/23BkIBEE-info-problemas-con-informacian-de-clasificatoria)","replies":[]}]}