{"poster":"AelieKnox","date":"2016-08-06T19:12:56.388+0000","title":"Hextech Chests nicht bekommen","subforum":"Melde einen Bug","up_votes":1,"down_votes":0,"body":"Hi Community,\r\n\r\nmir ist aufgefallen, dass ich manchmal keine Hextech Chests nach dem Spiel bekomme.\r\nIch versuche diese Chests gezielt zu holen, indem ich Champs spiele, auf die ich noch keine Truhen bekommen hab.\r\nAlso wenn ein Teammate oder ich selbst ein S oder h&ouml;her geholt haben, krieg ich keine Truhe. Ich bekomm sie meistens nur nach dem 2. oder sogar dem 3. Spiel mit dem selben Champ und wenn wieder jemand aus dem Team S oder h&ouml;her kassiert haben.\r\n\r\nPassiert euch das auch manchmal?\r\n\r\nGr&uuml;&szlig;e\r\n\r\nAelieKnox","replies":[{"poster":"Noctibert","date":"2016-08-07T11:18:29.994+0000","up_votes":3,"down_votes":0,"body":"Diese Situation hatte ich vor kurzem auch. Ich hatte einen freien Platz um ne Truhe zu bekommen, ein Champ gespielt mit dem ich noch keine Truhe hatte (mein Premade hatte auch ein Champ gespielt mit dem ich noch keine True hatte.) Ich bekam ein S- mein Premade ein S+, er bekam ne Truhe ich nicht. Danach haben wir ein weiteres Game gemacht, er holte ein S-, ich bekam wieder keine Truhe, erst nach einem weiteren Spiel, indem wieder ein S erreicht wurde, bekam ich dann die Truhe.","replies":[]},{"poster":"AelieKnox","date":"2016-08-08T15:20:52.764+0000","up_votes":1,"down_votes":0,"body":"Premade muss nicht zwingend sein, hab auch schon Truhen bekommen, ohne dass ich premade war.\nAber ja, die champs besitze ich auf die ich truhen gewinnen will.\nund im moment habe ich 3 truhen frei zum gewinnen xD\n","replies":[]},{"poster":"Im a Papaya","date":"2016-08-06T19:16:02.721+0000","up_votes":1,"down_votes":0,"body":"Dabei musst du erstmal folgendes klären:\nDiejenigen die ein S bekommen müssen Premade mit dir sein.\nDer Champ den du spielst musst du auch selbst haben.\nIn deinem Profil muss stehen das du ne Truhe bereit hast da man nur 4 im Monat bzw. 1 die Woche freischaltet.","replies":[]}]}