{"poster":"rae20","date":"2018-12-29T00:25:21.015+0000","title":"\"Kill yourself\"","subforum":"Spielerverhalten & Moderation","up_votes":4,"down_votes":9,"body":"**Nabend, **\r\nnormalerweise gehe ich nach ein paar schlecht laufenden Runden einfach schlafen und spiele am n&auml;chsten Abend einfach weiter.\r\nAber jetzt ist irgendwie ein Zeitpunkt erreicht in dem man das schlecht ignorieren kann.\r\n\r\nDas wendet sich jetzt vor allem an Riot , aber auch an alle Spieler, die in letzter Zeit &auml;hnliches Erleben. \r\n\r\nMeine letzten AUFEINANDERFOLGENDEN Spiele waren:\r\n\r\n Auf meinem Smurf : \r\n\r\n- 1. Feedende Tristana, die kein Bock mehr auf das Game hatte: **Stimmung: alles klar kann vorkommen**\r\n- 2. 1/13 Vi, die Mitte runtergerannt ist, weil sie gestorben ist und ich darauf: wir hatten da Vision, vorsichtiger bitte **Stimmung: nice**\r\n\r\nAuf meinem Hauptaccount:\r\n- 3/12 und 5/10 Kaisa, die sich den Tod gew&uuml;nscht haben, verb&uuml;ndete Lanes runtergerannt sind und mehr mit schreiben als spielen verbracht haben\r\n- 1/5 Ashe, die afk gegangen ist, weil der Bard einen kill genommen hat\r\n\r\nAlso dachte ich mir: Jo, viertes Spiel verloren mit einem Troll nice.\r\nIch geh also noch mal auf meinem main Account ins ranked und tats&auml;chlich noch ein TROLL!\r\nDiesmal ein Kayn, der Jungle pickt, obwohl er support gematcht wurde.\r\n\r\n\r\nSpieler, die trollen haben eine Macht &uuml;ber das Spiel, dass sie nicht haben sollten. Sie k&ouml;nnen 1-9 Spielern den Spa&szlig; komplett versauen und gleichzeit ist es auch noch ein waste of time.\r\n\r\nIch bin auf meinem Main decayed weil ich viel mit dem Studium zu tun habe und wollte jetzt in der Preseason wieder ein bisschen tryharden.\r\n\r\nNat&uuml;rlich gibt es das tolle feature &quot;reporten&quot;.\r\nDas nie etwas bringt, die Anzahl der Trolle wird ja schlie&szlig;lich nicht weniger, sondern tendenziell mehr.\r\n\r\n80% meiner Freunde sind zu anderen Spielen gewechselt, meine Schwester total getilted nach einem game, weil der Adc trollt.\r\n\r\nIch will meine kostbare Zeit nicht mit solchen Leuten verbringen. Also fix your game. \r\n\r\nUnd alle die meinen: Vielleicht bist du zu schlecht.\r\n\r\n\r\n~~&quot;Diese Nachricht wurde zensiert, da Rae20 Honor 4 2/3 ist&quot;~~","replies":[{"poster":"Maexle","date":"2018-12-29T10:39:55.053+0000","up_votes":4,"down_votes":0,"body":"Ich frage mich, wo bei euch die ganzen Trolle herkommen. Ich spiele zwar inzwischen relativ wenig, aber sehe eigentlich nie richtige Trolle. Das war damals, als ich noch deutlich mehr gespielt habe auch nicht anders. \n\nMan könnte jetzt sagen, dass die einzige Konstante in den Spielen man selbst ist, aber das ist wohl hier irrelevant. \n\n[{{champion:17}} ](https://boards.euw.leagueoflegends.com/de/c/allgemeiner-chat-de/GpKMneIA-das-antiflamer-manifest-antifla)","replies":[]},{"poster":"Izaya Kumiho","date":"2018-12-29T01:13:09.375+0000","up_votes":4,"down_votes":2,"body":">~~\"Diese Nachricht wurde zensiert, da Rae20 Honor 4 2/3 ist\"~~\n\nIch musste doch wirklich kurz überlegen, ob das Part von dem \"Witz\" sein sollte oder ob 'n Mod einen brutal schlechten Tag hatte lol.\nˢᵃᵛᵃᵍᵉ ᵃᶠ \n...\nˢᵒʳʳʸ ⋅_⋅\n\n>Ich will meine kostbare Zeit nicht mit solchen Leuten verbringen. Also fix your game.\n\nWieso muss man denn das Spiel fixen, wenn es um die Leute geht, die im Internet rumrennen?\nEs ist nicht die Aufgabe von Riot, die Spieler zu erziehen.\nSo gesehen reinigt sich die Community selber, denn ohne Reports kann das Strafsystem nicht eingreifen.\n\n>Und alle die meinen: Vielleicht bist du zu schlecht.\n\nNaja, Rankeds nehmen teilweise viel Zeit in Anspruch.\nDas du auf Anhieb nicht jedes Game gewinnst, ist relativ normal.\n(Besonders dann, wenn man schon länger keine Runden mehr gespielt hat.)\n\nIm Grunde geht es aber auch nicht um deinen Skill mit Champions und dem Spiel selber, sondern um deine Fähigkeit, mit den von dir beschriebenen Situationen fertig zu werden. Sowas wirst nicht nur du in deinem Team finden, sondern auch bei den Gegnern. Und je länger du spielst + tiltproof bleibst und Spaß hast, umso eher wirst du wieder climben.\n\n>Auf meinem Hauptaccount:\n- 3/12 und 5/10 Kaisa, die sich den Tod gewünscht haben, verbündete Lanes runtergerannt sind und mehr mit schreiben als spielen verbracht haben\n\nHuh.\nMuten ist für dich sicherlich nicht neu, aber..\nauch hier kann man dir nur sagen: es wird auch in deinem Gegnerteam solche Leute geben und dann freust du dich sicher über die free LP.\n\n>Natürlich gibt es das tolle feature \"reporten\".\nDas nie etwas bringt, die Anzahl der Trolle wird ja schließlich nicht weniger, sondern tendenziell mehr.\n\nHmm..\n\n[\"With this 92% of the players reform after being hit for the first time by the instant feedback system while previous systems never reached higher rates than 75%.\"](https://en.volu-eu.org/pbkb_general_user_view.php?art=38)\n\nQuelle: Siehe Eingew's comment :3 \n\n>Spieler, die trollen haben eine Macht über das Spiel, dass sie nicht haben sollten. Sie können 1-9 Spielern den Spaß komplett versauen und gleichzeit ist es auch noch ein waste of time.\n\nUnd was würdest du dagegen tun wollen, bzw. was glaubst du, müsste passieren, damit sich das Problem löst?","replies":[{"poster":"eingew","date":"2018-12-29T09:25:03.956+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Izaya Kumiho,realm=EUW,application-id=KYnfKGf0,discussion-id=EogTpoRE,comment-id=0000,timestamp=2018-12-29T01:13:09.375+0000)\n>\n> Ich würde ja gerne etwas dazu sagen, aber ich habe keine Quelle mehr D:\n> Wenn ich mich nicht vertu, dürften um die 80-87% der bestraften Spieler **nicht** erneut auffällig werden laut einer älteren Statistik.\n> **Ich kann es aber leider nicht mit einem Link bestätigen und ich erinnere mich auch nicht an die genaue Zahl.**\n\nIch glaube du suchst [hier](https://en.volu-eu.org/viewer.php) die Seiten 189, 195 und 324. Oder den entsprechenden Artikel im PBKB [hier](https://en.volu-eu.org/pbkb_general_user_view.php?art=38). ;)","replies":[{"poster":"Izaya Kumiho","date":"2018-12-29T10:34:56.617+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=eingew,realm=EUW,application-id=KYnfKGf0,discussion-id=EogTpoRE,comment-id=00000000,timestamp=2018-12-29T09:25:03.956+0000)\n>\n> Ich glaube du suchst [hier](https://en.volu-eu.org/viewer.php) die Seiten 189, 195 und 324. Oder den entsprechenden Artikel im PBKB [hier](https://en.volu-eu.org/pbkb_general_user_view.php?art=38). ;)\n\nJAAA GENAU! \n...\nwait, das war/ist auf unserer volu-seite zu sehen?\n\n...\n_oh_.\n\nedited: ich kann keine sätze mehr bilden.\n\nedite2: ich habe dem krams bei mir sogar vor x monaten abgespeichert und gestern eiskalt nicht gesehen. what.","replies":[]}]}]},{"poster":"Megamaexx","date":"2018-12-29T15:01:36.932+0000","up_votes":2,"down_votes":0,"body":"Das ist also dein Smurf? Ich habe die 1/13 Vi gefunden, joa sowas ist ärgerlich. Die 0/5 Tristana folgte 2 Spiele später. In einem normal. Der Silber-Spieler musste gegen einen Platin-Spieler lanen, da kann man verstehen, dass das nicht einfach ein easy win wird. Wenn das nicht die genannten Spiele sind, schick doch nen Link. Ich habe das Gefühl, du übertreibst.","replies":[]},{"poster":"Amycos Cyrus","date":"2018-12-29T10:45:28.834+0000","up_votes":2,"down_votes":0,"body":"Das Honor hat nichts mit der Spielqualität zutun, sondern ist ein durch ein subjektives Kollektiv erzeugtes Feedback.","replies":[]},{"poster":"eingew","date":"2018-12-29T09:45:49.454+0000","up_votes":2,"down_votes":0,"body":"Also ehrlich gesagt verstehe ich nicht, wieso man dann noch weiter spielt. Nach zwei Trollen in zwei Spielen mache ich zumindest spätestens etwas anderes. Vor allem weil ich dann selbst anfange so dumme Kommentare abzugeben, wie du es von dir selbst zugibst, also Leuten zu schreiben sie sollen auf die Map gucken und so... bringt halt nichts, provoziert unnötig und wenn du Pech hast reagiert der Spieler halt wie die Vi. Ist scheiße von ihr, klar. Kann man aber eben verhindern.\n\nGerade Spieler die die Mitte herunter rennen werden aber durchaus bestraft, ob du das nun glaubst oder nicht, entsprechende Fälle findest du auch genau hier im Unterforum, in dem du selbst gerade gepostet hast.\n\nAnsonsten sehe ich das wie Izayah Kumiho. Das Problem sind häufig die Spieler. Sicher macht Riot Fehler gerade was das Balancing angeht und auch was das Bestrafungssystem angeht. Damit ein so unterirdisches Verhalten zu rechtfertigen, mit dem man in erster Linie seinen Mitspielern und eben nicht Riot schadet finde ich persönlich aber unter aller Sau. Gerade jetzt in der Preseason mutieren viele Spiele aber bei mir zumindest zu den übelsten Clownfiestas. Und das ist eben definitiv nicht einfach nur Riots Schuld, auch wenn es natürlich stark damit zu tun hat, wie kurz die Spiele mittlerweile geworden sind. Sowas kann man aber eben auch *selbst* verhindern. Statt die sichere Route zu gehen und sich den Baron oder Elder Drake zu holen und sich in der Base zu erfrischen wird lieber mit niedrigen Resourcen die vierte Belagerungsminute angebrochen und sich dann gewundert, wenn man sich einzeln catchen lässt und stirbt. Durch diese permanente Selbstprovokation werden so oft Spiele geschmissen und dann an allem und jedem der Frust ausgelassen, nur nicht am eigentlichen Übeltäter: Man selbst.","replies":[]},{"poster":"Carry This Scrub","date":"2019-01-08T16:38:28.235+0000","up_votes":1,"down_votes":0,"body":"Und wie erklärt sich jetzt der Titel des Threads?","replies":[]},{"poster":"N33KO N33KO","date":"2018-12-29T03:06:40.050+0000","up_votes":2,"down_votes":5,"body":"alltag in LoL eben :/","replies":[]}]}