{"poster":"Niåll","date":"2017-02-10T20:23:40.583+0000","title":"WHY THE FUCK YOUR GAME Laggggggg","subforum":"Gameplay","up_votes":2,"down_votes":11,"body":"I CAnT EVEN CLICK ACCEPT INVITES.....AND ITS NOT MY WIFI","replies":[{"poster":"420 grams","date":"2017-02-10T20:38:38.259+0000","up_votes":4,"down_votes":0,"body":"MAYBE ONLY ABLE TO TYPE IN CAPS IS OVERLOADING YOU COMPUTER. THAT'S WHAT HAPPENED TO ME","replies":[]},{"poster":"wishbone25","date":"2017-02-10T20:37:47.570+0000","up_votes":2,"down_votes":0,"body":"its your pc they say","replies":[]},{"poster":"Zezockary","date":"2017-02-10T20:27:19.310+0000","up_votes":2,"down_votes":0,"body":"It is on your end. If it wasn't then everybody else playing the game, or at least everybody with the same isp, would have the same issue.","replies":[{"poster":"Bishasaurus Flex","date":"2017-02-10T20:41:13.327+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Zezockary,realm=NA,application-id=3ErqAdtq,discussion-id=WH2mN2e4,comment-id=0000,timestamp=2017-02-10T20:27:19.310+0000)\n>\n> It is on your end. If it wasn&#x27;t then everybody else playing the game, or at least everybody with the same isp, would have the same issue.\n\nThere have been multiple posts on the forums about lag and random spikes.  I have the same issue.  I switch between my wifi (300mbps), my mobile hot spot,  and my roomate's hotspot, and I still get random spikes.  I moved from Myrtle Beach SC to Charlotte NC and have had CRAZY spikes over 15000 then back down to normal.  If it wasn't for the many other people I've seen with the same issue, i'm starting to think it's more than my internet.  It could very well be my network adapter, I built my comp in mid 2012 so the parts could be going out on me.","replies":[{"poster":"Niåll","date":"2017-02-10T23:47:47.572+0000","up_votes":1,"down_votes":0,"body":"its not in game the fkin client. not my pc i can run fkin infinite warfare. not my wifi i got 100 mbps ITS LEAGUE . my cousin is getting it too. ITS SO FUCKING ANNOYING","replies":[]}]}]},{"poster":"Bishasaurus Flex","date":"2017-02-11T02:10:48.469+0000","up_votes":1,"down_votes":0,"body":"Yeah Client is laggy for me, too.","replies":[]}]}