{"poster":"effreg","date":"2016-01-01T14:48:35.223+0000","title":"Challanger Bots","subforum":"Karten & Spielmodi","up_votes":2,"down_votes":1,"body":"Riot hat mal gesagt das sie Bots raus bringen wollen welche es mit Dia Spielern aufnahmen k&ouml;nnen. Ich hatte den Gedanken das man Bots erstellen kann, die Scripten.\r\nDu Bots sollten oder k&ouml;nnen dann Auto Hit, Auto Dodge, Perfect Last hit, Animation cancel haben.\r\nZum Beispiel Doom Bots of Doom war egal auf welchen lv trotzdem einfach.","replies":[{"poster":"Zero000","date":"2016-01-01T14:57:59.949+0000","up_votes":1,"down_votes":0,"body":"> Riot hat mal gesagt das sie Bots raus bringen wollen welche es mit Dia Spielern aufnahmen können.\n\nWann haben sie das den gesagt?","replies":[{"poster":"effreg","date":"2016-01-02T01:46:33.812+0000","up_votes":1,"down_votes":0,"body":"Vor etwa eineinhalb Jahren.","replies":[{"poster":"Zero000","date":"2016-01-02T02:05:27.879+0000","up_votes":1,"down_votes":0,"body":"Quelle?","replies":[{"poster":"effreg","date":"2016-01-08T19:58:35.308+0000","up_votes":1,"down_votes":0,"body":"http://euw.leagueoflegends.com/de/news/game-updates/gameplay/dev-blog-menschlichere-bots","replies":[]}]}]},{"poster":"Alustus","date":"2016-01-01T15:10:30.525+0000","up_votes":1,"down_votes":0,"body":"würde ich auch gerne wissen\n\nHabe sogar wenn ich mich recht erinnere da gegenteil gelesen als die Bots verändert wurden.\n","replies":[{"poster":"SorisDynasty","date":"2016-01-01T15:37:12.470+0000","up_votes":1,"down_votes":0,"body":"Vor allem... wie soll das möglich sein? Schlussendlich wären es immer noch Bots. Früher oder später hätte man ihr Verhalten herausgefunden und dann kann man das hardcore ausnutzen, um ein leichtes Spiel drauß zu machen. Dasselbe ist bei den Doombots passiert.","replies":[{"poster":"YouMadBroLTP","date":"2016-01-01T22:19:26.441+0000","up_votes":1,"down_votes":0,"body":"das verhalten der meisten MENSCHLICHEN spieler ist aber auch ziemlich vorhersagbar...","replies":[{"poster":"Alustus","date":"2016-01-02T12:08:34.677+0000","up_votes":1,"down_votes":0,"body":"naja ein Bot braucht eben gewisse Parameter zum auslesen ein mensch reagiert doch jedes mal ein bisschen anders","replies":[{"poster":"YouMadBroLTP","date":"2016-01-02T13:25:18.957+0000","up_votes":1,"down_votes":0,"body":"anders heißt nicht unbedingt besser :D","replies":[{"poster":"Alustus","date":"2016-01-02T17:43:56.329+0000","up_votes":1,"down_votes":0,"body":"Habe ich auch nicht gesagt.\n\nAber einen Bot kann man leichter durchschauen, da er immer nach einem gewissen shema handelt.\nDas kann zwar bei einigen Spielern auch zutreffen, aber diese sieht man nur in 1 Spiel während man in Botgames immer wieder die selben gegner hat.","replies":[]}]}]},{"poster":"SorisDynasty","date":"2016-01-01T22:41:39.278+0000","up_votes":1,"down_votes":0,"body":"Wo habe ich was anderes behauptet?","replies":[{"poster":"YouMadBroLTP","date":"2016-01-02T13:32:28.171+0000","up_votes":1,"down_votes":0,"body":"Dann wolltest du mit deiner Aussage also nicht sagen dass Bots zu leicht sind weil ihr verhalten vorhersagbar ist und darum menschliche spieler besser sind?","replies":[{"poster":"SorisDynasty","date":"2016-01-02T14:18:29.322+0000","up_votes":1,"down_votes":0,"body":"Doch. Aber das sind unterschiedliche Sachen. Bots sind gescripted. Sie folgen den exakten Sachen immer und immer wieder. Finde heraus, was genau, und du kannst in 9 bis 10 von 10 Fällen dein gewünschtes Ergebnis erreichen.\nProbier das mit Menschen. Dort kannst du nicht jedes Mal dieselbe Sache abziehen und das exakt selbe Ergebnis erzielen. Die werden dir nicht einfach bis an deinen Turm folgen, full live und dabei den Farm ignorieren. (Angenommen, es ist ein angemessenes Level und kein Anfänger-Niveau)\nMit genug Erfahrung kann man natürlich auch super menschliche Spieler lesen und Sachen hervorsehen. Aber das ist dann von Spieler zu Spieler doch wieder individualisiert und unterscheidet sich zum vorherigen. Bots haben kaum Individualisierung.","replies":[]}]}]}]}]}]}]},{"poster":"Lagbeard","date":"2016-01-01T15:08:51.145+0000","up_votes":1,"down_votes":0,"body":"Naja, Bots scripten immer. Wie sonst soll denn eine KI ihre Bewegungen bestimmen?","replies":[]}]}