{"poster":"SensualSnivy","date":"2017-03-05T16:37:28.082+0000","title":"Ok, Auto Fill is a bit ridiculous","subforum":"Gameplay","up_votes":63,"down_votes":7,"body":"I am a multi-faceted player, and i don&#039;t mind being auto-filled in the least. However, I find it&#039;s an issue when I have Auto-Fill protection and someone unfortunately dodges multiple times in a row, and I lose this &quot;protection&quot;. How is this fair? I&#039;d much rather wait an additional two or three minutes for my desired role than be auto-filled due to someone else&#039;s impatience or negligence in queue. Your current queuing system just doesn&#039;t work all too well, much like this season as a whole, and it&#039;s absurdly frustrating. I usually look for any excuse to do crazy-outrageous things with my man, Taric, but I should never lose my protection because of someone&#039;s decision to dodge in queue. That&#039;s just imbecilic...","replies":[{"poster":"Awesomedude8888","date":"2017-03-05T18:08:05.482+0000","up_votes":14,"down_votes":1,"body":"Wait... how do you lose autofill protection when you haven't even gone into a game yet?","replies":[{"poster":"Joes","date":"2017-03-05T18:13:34.336+0000","up_votes":14,"down_votes":0,"body":"He has protection, gets into a lobby, someone who did get autofilled dodges, and then he loses his autofill protection","replies":[{"poster":"Awesomedude8888","date":"2017-03-05T18:14:51.562+0000","up_votes":15,"down_votes":0,"body":"But why would he lose his autofill protection when he never even got into a game?","replies":[{"poster":"Exalomaniac","date":"2017-03-05T19:17:02.443+0000","up_votes":15,"down_votes":0,"body":"cause logic","replies":[]},{"poster":"Lexyy","date":"2017-03-07T15:07:29.518+0000","up_votes":1,"down_votes":0,"body":"Well he got into a lobby..... xD\nProtection is for lobby.\n\nJust like when you get mid but switch to support - you dont get protected next game","replies":[]}]}]},{"poster":"SensualSnivy","date":"2017-03-05T19:35:09.835+0000","up_votes":13,"down_votes":0,"body":"This has happened more times than I care to recount. Auto-fill protection lasts about as long as the CD for Edge of Night....So, is it really ever there?","replies":[{"poster":"DaNinad","date":"2017-03-05T23:30:18.280+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=SensualSnivy,realm=NA,application-id=3ErqAdtq,discussion-id=EELgd5oz,comment-id=00000001,timestamp=2017-03-05T19:35:09.835+0000)\n>\n> This has happened more times than I care to recount. Auto-fill protection lasts about as long as the CD for Edge of Night....So, is it really ever there?\n\nNice one","replies":[]}]}]},{"poster":"idontgiveabother","date":"2017-03-05T19:20:27.361+0000","up_votes":10,"down_votes":2,"body":"I just despise autofill in the fact its quantity over quality. Quantity being shorter q times and more games, quality being slightly longer but everyone gets what they want and what they know how to play.","replies":[{"poster":"Awesomedude8888","date":"2017-03-05T19:36:25.244+0000","up_votes":14,"down_votes":1,"body":"I'm not sure about you, but my queue times have not gone down since the implementation of autofill, mainly because of constant dodges.  And my games are a lot worse in quality as well - games are almost always decided by which team has the autofill, both in games that I won and the ones that I lost.","replies":[{"poster":"idontgiveabother","date":"2017-03-05T23:20:24.323+0000","up_votes":4,"down_votes":0,"body":"Mine haven't either. I just waited about 10 minutes to get in a game because of dodges and no one accepting queue. Its honestly longer in some scenarios compared to when autofill wasn't on. Hopefully in season 8 it won't be as toxic of a system but who knows :(","replies":[]},{"poster":"Sammystorm","date":"2017-03-06T04:34:28.071+0000","up_votes":2,"down_votes":2,"body":"my queue times have gone dramatically. from 5 + minutes to find a game to less then 2.","replies":[{"poster":"PhDs Nuts","date":"2017-03-06T06:12:24.137+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Sammystorm,realm=NA,application-id=3ErqAdtq,discussion-id=EELgd5oz,comment-id=000100000001,timestamp=2017-03-06T04:34:28.071+0000)\n>\n> my queue times have gone dramatically. from 5 + minutes to find a game to less then 2.\n\nAnd then after a single dodge it's back to the exact same queue time, but with an autofilled teammate.","replies":[{"poster":"Sammystorm","date":"2017-03-06T08:00:13.097+0000","up_votes":1,"down_votes":1,"body":"No not really. It never takes 3 minutes to find another team mate. Although I do think that queue dodging is bad atm I don't think it is caused by autofill and I do not want to wait again like I did before autofill. Being a game and not playing more then maybe 4 games a week due to limited time. Having a longer queue time dramatically affects my ability to even play the game. I main mid so I usually had a 5+ minute queue time + sometimes 1 or more queues of about 5 minutes each we are looking at average of 10+ minutes to get into a game. A average game is 20 to 40 minutes so we had for me roughly 1/3- 1/5 (20-33.3%) of my time on the league client waiting for a game to start. Now dropping the queue time to 1.5-2 minutes isn't huge by it self but riot lowering pick and ban timers helps as well and shorter time before the game starts is a step in the right direction. Especially since the quality of matchmaking games were worse before autofill. \n\nLet me ask you this. Would you rather have an autofilled teammate of very similar skill (and opponents) or have no autofilled teammates and have a substantial gap between you and teammates (and opponents)?\n\nfull disclaimer: It is hard to judge how much of the crappy games was due to lack of autofill and how much was due to lack of solo queue but I believe it is a substantial number.","replies":[{"poster":"Taliyahc","date":"2017-03-06T20:50:34.004+0000","up_votes":3,"down_votes":1,"body":"Cool you main mid, so do I, first match of the day last week I was autofilled, then a remake and a dodge later I lost my protection and had a second autofill match.\n\nI'm more then willing to play the role I'm given, what I can't tolerate is Riot forcefeeding the role down my throat. Old que times in silver were usually 5-8 minutes if you qued for the most popular role of mid. This autofill makes sense for higher elos with lower playerbases, but the matter of the fact is a large pprtion of the community hates autofill and a large amount of players are in bronze-gold which last I checked makes up 70-80 percent of the playerbase.\n\nWhy are we forced to fill when game que times are already generally short. I honestly find que times the same with the new system due to dodges, but the toxicity has risen substantially from people not getting their desired roles.","replies":[{"poster":"Sammystorm","date":"2017-03-07T09:23:00.115+0000","up_votes":1,"down_votes":1,"body":"First: you are making up numbers. You have no evidence for. I really doubt 70% of this community can agree on anything let alone on something that has such massive flaws as perma autofill protection. Again using your own numbers 5-8 minutes  + queue (5 minutes) we are looking at roughly 20%-33.3% of our time as mid mains waiting for games to start. \n\nSecond: A brief primer on matchmaking. The longer a queue timer the lower the match quality. Matchmaking starts at your rank (mine is currently gold 5). It then expands the search for any one one tier above or below you based on time. So basically the longer the queue time the further a part peoples ranks are and makes games lower quality. \n\nThird: 5-8 minutes is not a short queue time. Especially for the highest population queue of the most popular game in the world in one of the busiest servers. It use to be less then 2 minutes for gold. \n\nWe tried the whole no autofill last season and it made queue times out of control. Now we are in a decent in between place. Dodging needs to be addressed and toxicity needs to be addressed.","replies":[{"poster":"Taliyahc","date":"2017-03-07T14:57:01.016+0000","up_votes":3,"down_votes":0,"body":"We had no autofill last season and the que times were reasonable, it might've been a couple minutes longer but there was less toxicity and dodging.\n\nAlso yes, 70 percent of the community can agree they don't like being forced into a role they aren't comfortable with, honestly you'd have to take a poll in game to get the numbers but the number of players against autofill can easily be seen throughout match lobbies and on the gameplay boards.","replies":[{"poster":"Sammystorm","date":"2017-03-08T04:11:57.664+0000","up_votes":1,"down_votes":1,"body":"Queue times were not fine last season they were excessive for most people. They were literally unplayable for high elo players with queue times of over an hour. My queue time as a gold player dropped by several minutes. Much more for high elo players.","replies":[{"poster":"Taliyahc","date":"2017-03-08T16:45:15.853+0000","up_votes":2,"down_votes":1,"body":"Autofill was already a thing for high elo in season 6, but gold silver and bronze have a large enough playerbase to justify not needing it.","replies":[{"poster":"Sammystorm","date":"2017-03-08T18:36:37.387+0000","up_votes":1,"down_votes":0,"body":"Gold silvrr and bronze had really long queue times for a game of this size. Again we tried this last season and the minimum queue for me a low gold mid main was 5 minutes but often longer. Last season champ select did not work.","replies":[]}]}]},{"poster":"Octavia","date":"2017-03-08T18:11:18.441+0000","up_votes":1,"down_votes":0,"body":"THANK FUCK people like you are finally here speaking about autofill I spent ages saying this months ago and everyone talked shit to me, now suddenly people are realizing how autofill doesn't even do it's intended purpose and is just trash in every possible way.","replies":[]}]},{"poster":"FreeVolibear","date":"2017-03-07T15:38:33.942+0000","up_votes":2,"down_votes":0,"body":"I don't know about the 70%, but I can say that I see complaint after complaint about autofill, but you are definitely an oddity in your defense of it. I personally do not mind being autofilled. I don't queue as support, but on occasion I like to break it up. What I do mind is the circus act that starts like such: \n\n1. Enter matchmaking lobby\n2. Support Role \"WTF?\"\n3. Support Role \"Can I top\"\n4. Support Role \"Can I mid?\"\n5 When denied, proceeds to coerce a dodge because he can't really be bothered to wait 5 min, 15 min or let's be honest, this is probably his last dodge before he has a nice break.\n6 No dodger in the ranks... okay, proceed to troll\n\nDodging can't really be addressed much more than it has. If you draw a harder line, then you would be punishing those who did not dodge intentionally (call it internet, or even worse, bug splats) \nToxicity already has a solution. It's probably as good as it can get, but sometimes you have to recognize when you are in disease treatment, or disease prevention mode. Right now, autofill is like a warm pool of stagnant water to a colony of bacteria that breed toxicity. That's neither preventive nor curative.","replies":[{"poster":"Sammystorm","date":"2017-03-08T04:05:52.181+0000","up_votes":1,"down_votes":0,"body":"Ok. Here is the thing. Champ select was literally unplayable last year for high elo players. Queue times were over an hour long.\n\nHeres the thing. Autofill is bad and frustrating. However no autofill is worse. No autofill makes queue times longer and literally makes the game unplayable. \n\nSo what we need to do is not go back to a failed system but instead call riot to fix the problem and to brain storm solutions.","replies":[]}]}]}]}]}]}]},{"poster":"Octavia","date":"2017-03-08T18:10:03.224+0000","up_votes":1,"down_votes":0,"body":"10000000000000000000000% this. EXACTLY my problem. That's why I quit. Final game I ever played, 0/6 autofilled Taric bot, I was Quinn mid, jungler flaming me.\n\nThought \"hey, these games are LOW QUALITY AS FUCK\", and uninstalled. 99.9% autofill's fault, was already tilted from being autofilled myself and losing my protection without even playing a game and that was just the last straw.","replies":[]},{"poster":"GayFluffyUnicorn","date":"2017-03-07T20:12:30.066+0000","up_votes":1,"down_votes":0,"body":"Well because the playerbase got split up further with flex q. Riot said they'd remove flex q if it becomes a problem instead they turned on autofill even in normals which is ridiculous. \nThey should just push duos into flex and make it a pure soloQ. Solo warriors are tryhards mostly anyways so i think they dont mind a longer q time (i certainly don't) and i dont have to deal with boosted trash or camping premades anymore.","replies":[]}]},{"poster":"Octavia","date":"2017-03-08T18:08:53.025+0000","up_votes":1,"down_votes":0,"body":"100000000000000000%","replies":[]}]},{"poster":"skyskee008","date":"2017-03-05T23:42:44.096+0000","up_votes":6,"down_votes":0,"body":"Ikr? xPeke signed for mid but they put him on support. SMH","replies":[]},{"poster":"Raiyza","date":"2017-03-06T15:31:37.800+0000","up_votes":4,"down_votes":1,"body":"The problem, as said above me, is that people do not play support. People do not like playing support.\n\nI love playing Thresh and Morg. Players like me wont mind at all if we get autofilled, but we are a minority. If people do not like playing a role, they will not learn it properly and they will not be good at it. \n\nBottom line. Get rid of autofill. I will gladly wait 3 more minutes to find a match. This is what YouTube is for.","replies":[]},{"poster":"Torgaz","date":"2017-03-06T08:18:23.117+0000","up_votes":2,"down_votes":0,"body":"Not all dodges are from auto fill. Yes a majority of them are BUT people are also having black screen glitches as they are trying to join the lobby. They just can't see or do anything and they basically have no choice but to dodge. \n\nNot sure if this glitch is new client or old at this point.","replies":[]},{"poster":"Drossvamp","date":"2017-03-06T05:59:46.044+0000","up_votes":2,"down_votes":0,"body":"I have to agree with autofill being not so fun to deal with. I always queued top/jun b4 autofill, and i was fine waiting 5-10 minutes for a game. Recently however, my leisure time while in queue has been replaced with, lobby>dodge>lobby>dodge>lobby>game>repeat. i used to do other small things while waiting but with all the dodges its been pretty hectic for me.","replies":[]},{"poster":"notice me Sin pi","date":"2017-03-06T00:52:28.299+0000","up_votes":2,"down_votes":0,"body":"RitoSphagettiLogic™ Technology","replies":[]},{"poster":"Wráthful","date":"2017-03-06T10:19:50.336+0000","up_votes":2,"down_votes":1,"body":"the whole forced autofill thingy is ridiculous in my opinion forcing ppl to play role that they dont like is completely wrong ... after all i prefer a high quality game than waiting less for a game with autofilled demoralised players that are more likely to troll im sure most ppl dont agree with this permament autofill just like me it makes the game less fun only to make games start faster at least in lower elose autofill is not needed at all if u want faster game u fill if u dont u shoudnt get autofilled.","replies":[{"poster":"Sammystorm","date":"2017-03-07T09:26:59.655+0000","up_votes":1,"down_votes":0,"body":"The whole high quality game thing is a myth. The longer you wait for a game the further apart in rank players will be. I would rather have some one in an off role then have one player be significantly better or worse then everyone else.","replies":[{"poster":"GayFluffyUnicorn","date":"2017-03-07T20:14:46.795+0000","up_votes":1,"down_votes":0,"body":"In low elo maybe. \nBut you certainly don't want a diamond jungle main against an adc main autofilled into jungle","replies":[{"poster":"Sammystorm","date":"2017-03-08T04:28:20.459+0000","up_votes":1,"down_votes":0,"body":"The problem with role select is that. It made queue times so long the game was basically unplayable for high elo people.","replies":[]}]}]}]},{"poster":"Quepha","date":"2017-03-08T18:49:02.031+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SensualSnivy,realm=NA,application-id=3ErqAdtq,discussion-id=EELgd5oz,comment-id=,timestamp=2017-03-05T16:37:28.082+0000)\n>\n> an additional two or three minutes for my desired role\n\nbut it's likely closer to 10x your estimate.","replies":[]},{"poster":"48983507DEL1","date":"2017-03-06T17:07:24.362+0000","up_votes":1,"down_votes":1,"body":"Hey man. \n\nPlease try and space out your posts. \n\nReading a giant block of text can be frustrating. \n\nThat is all.","replies":[{"poster":"mikemcparty","date":"2017-03-06T19:17:50.533+0000","up_votes":1,"down_votes":0,"body":"A \"giant\" block of text. Don't you feel that is a bit of an over-dramatization?","replies":[{"poster":"48983507DEL1","date":"2017-03-06T19:20:22.598+0000","up_votes":1,"down_votes":1,"body":"Not really. When I see text like that, it turns me off.\n\nNot saying the post is bad whatsoever. Just doesn't immediately spark my interest since the brain is lazy and doesn't want to focus on reading everything.","replies":[]}]}]},{"poster":"Granduss","date":"2017-03-06T12:52:47.289+0000","up_votes":1,"down_votes":0,"body":"The real problem lies with the support role. Until Riot adresses that, this will continue to be an issue. Also this is coming from someone whom doesn't mind, and usually ques as, support.","replies":[]},{"poster":"Sammystorm","date":"2017-03-06T04:33:17.389+0000","up_votes":1,"down_votes":3,"body":"Dodging is a problem yes but still start games faster then before auto fill","replies":[{"poster":"SensualSnivy","date":"2017-03-06T16:50:24.702+0000","up_votes":2,"down_votes":0,"body":"Dodging is largely a problem, because of auto fill. Turns out people aren't interested in playing roles for which they are unaccustomed. Like many of us are saying, we'd rather wait the extra time for our desired role, in order to have a more pleasant experience overall, than be auto filled. I don't mind supporting. I find it to be a more engaging and interactive when comparing it to playing Top or ADC, but that doesn't mean I want to be thrown off of other desired roles when I've already paid the toll. Auto-fill \"protection\" should actually protect me for a couple of games, as opposed to placating their system for a queue or two...A couple of dodges later, and it's as though it never existed.","replies":[{"poster":"Sammystorm","date":"2017-03-06T17:31:26.637+0000","up_votes":1,"down_votes":1,"body":"Is it a problem because of auto fill or because of solo queue? I think solo queue makes people less invested in their teams and more likely to dodge. \n\nI do agree that autofill protection should last even if someone dodges.\n\nI think we found out last season for sure that not having autofill breaks matchmaking. We had these massive differences in teams. My games were much worse and took longer to get into last season then any other season since I started in season 2. On top of that our wait to actually play the game is already too long especially at high tiers of play. Not everyone has a lot of time to play this game and the more time riot adds before you can even start the game the less games people are able to play. Last season I had roughly 10 minutes until the start of the game. 5 minutes for champ select 5 minutes for queue. With an average game lasting 20-40 minutes I had roughly 1/3-1/5 (20-33.3%) of my time spent not playing the game. That is too long. I can hop on most other games and have that time be much much less. \n\nLet me ask you this: would you rather have worse matchmaking quality but have you and everyone else be guaranteed your role every time or have autofill and have everyone at about the same skill level? Again we proved that matchmaking breaks and has to look really far in either direction to fill a team full of 5 if there is no autofill.","replies":[]}]}]}]}