{"poster":"Zorobis     ","date":"2017-11-19T02:44:31.748+0000","title":"Runen Bug (Benefee)","subforum":"Melde einen Bug","up_votes":1,"down_votes":0,"body":"Die neuen Runen sind wirklich schick und gut gemacht ,doch ich habe bei einer der Runen , Benefee um genau zu sein, einen Bug entdeckt. Ich habe diesen schon vor gut einer Woche entdeckt ,hab mir aber nichts drau&szlig; gemacht. Doch jetzt wo er mir wieder passiert ist in abwechselnde Wahl ist es schon ziemlich ekelig.\n\nDas ganze passierte ungef&auml;hr so: Ich als Support mit adc standen wirklich gut ich 5/0 und mein adc noch besser. Doch in der 14-15 Min als ich eine fähigkeit einsetzte(Karma Q,W,E,R) haben sich pl&ouml;tzlich die meisten meiner Runen deaktiviert oder waren einfach nicht mehr am wirken, und das war ziemlich schlecht, denn wenn du als Karma auf einmal keine Benefee mehr hast der ultimativ Hut Fl&ouml;ten geht und dein Cooldown sich nochmal durch das verschwinden von &Uuml;berlegenheit verringert hast du denn k&uuml;rzeren gezogen. Da ich selbst nicht mal mehr Hitzewelle f&uuml;r ein bisschen Extra dmg hatte waren die n&auml;chsten 10 MIn echt unangenem. Ich selber kann mir nicht erklären wie es dazu gekommen ist. Ich hab eine Q getroffen und dann war Benefee und alles andere Weg. Selbst nach einem Reconnect nichts.\n\nBis zur 24Min hatte ich keine Runen mehr die dann aber ,wie auch immer, zur&uuml;ck gekommen sind/sich wieder aktiviert haben. War bis dahin auch schon zusp&auml;t weil unsere tower und Inhibs dann schon down waren :p\n\nIch find sowas game-relevant und hoffe das es bald gefixt wird. Und nur um das mal festzuhalten: JA , man hat wirklichen einen großen Nachteil, nicht nut weil du weniger Dmg machst ,auch teammates die ich nicht mehr so gut schilden konnte haben darunter gelitten. Auch das alle Gegner funktionierende Runen haben macht es nicht leichter. \n\n\nAber ich hoffe das passiert in zukunft nicht öfter, denn was k&ouml;nnte ich denn nur ohne meine kleine Katzen Fee?{{sticker:sg-kiko}}\n\n*","replies":[{"poster":"Zyklón B","date":"2017-11-19T06:56:27.626+0000","up_votes":1,"down_votes":0,"body":"Gibt es davon aufnahmen könntest du ein Replay speichern [kurzes Highlight sollte reichen] und es als Ticket an den Support schicken? Ich denke das würde denen ihre Arbeit erleichtern. Danke im Voraus.{{item:3599}}","replies":[]}]}