{"poster":"Staller","date":"2015-10-05T02:06:49.991+0000","title":"Recruiting for ranked 5s team please read the description.","subforum":"Team Recruitment","up_votes":1,"down_votes":1,"body":"Hey all i am a diamond solo q player that is wanting to start up 2 teams. Team 1 would consist on plat+ players as we already have a few diamond and masters and then team 2 would be the lower elo team that i would help to coach and try get them to gold so they can get the victorious skin. if you would like to be in either one of these teams please comment below or message me in game saying what team you would like to be in.\r\nThanks Staller.","replies":[{"poster":"lizade","date":"2015-10-07T05:06:00.101+0000","up_votes":1,"down_votes":0,"body":"Hi im s4. Havent been playing much norm lately mainly bcuz most of my fri quit on me. Would love to have a chance to play wit others and b coached on top!\nIm geberally trying to b all rounder but i usu prefer jg >sup>adc> top/mid","replies":[]},{"poster":"TMT20 Phaunz","date":"2015-10-05T12:31:18.259+0000","up_votes":1,"down_votes":0,"body":"Hey man I'm plat 3 and I'd like to be in your higher elo team, I main ADC. I'll be home tomorrow around 7pm AEST if you want to play or talk. IGN: TMT20 Phaunz","replies":[]},{"poster":"MutantCser","date":"2015-10-05T07:45:10.722+0000","up_votes":1,"down_votes":0,"body":"Mee~!!! pls, give me a Slot pls.... need it since s3.....","replies":[]},{"poster":"Skrab","date":"2015-10-05T05:48:51.443+0000","up_votes":1,"down_votes":0,"body":"Hey, I would like to get a chance playing ranked team (and coached) in your Team 2. I am Bronze 1 steadily climbing to Silver (probably by next few days). I'm still in Uni so i can't play much but i allocate playing time from 9 PM to 2 AM everyday. \n\nUniucky","replies":[]},{"poster":"LusciousSlugTits","date":"2015-10-05T05:29:07.687+0000","up_votes":1,"down_votes":0,"body":"I suggest you don't add someone get them to wait an hour and then while they are away proceed to delete them without a word so that upon their return they come to realise that they had just spent their time waiting for nothing.","replies":[]},{"poster":"jadelink","date":"2015-10-05T04:32:13.128+0000","up_votes":1,"down_votes":0,"body":"I'd love a chance to play some ranked teams again (in your lower bracket team).   Uni and my clinic placements get a little hectic sometimes, but I should be able to make an evening every week at least.\n\nJadelink","replies":[]},{"poster":"Pagoe","date":"2015-10-05T04:30:43.872+0000","up_votes":1,"down_votes":0,"body":"hi, i'm gold 5 soloq and main mid, i'd like to join, feel free to add me - Pagoe","replies":[]}]}