{"poster":"El Machø","date":"2019-04-27T04:30:04.054+0000","title":"Besto experienzo jugando","subforum":"Jugabilidad, balance y narrativa","up_votes":4,"down_votes":0,"body":"Primera ranked de la cuenta, todos mueren 8 - 10 veces(yo 2), hago 10.000 de daño que la mayoría del team, Jarvan soporte ap, Vayne 5 / 10 / 6 farmeando top mientras nos tiran todo, interesting, vamos a por mas :\n\nEDIT: Segunda, partida, Yi jungla afk 20 min, guay vamos por otra\n\nEDIT; Tercera partida, Elise jungla nos consigue la primera sangre, luego no sale de jungla por 15 min o mas, termina 2 / 8 / 5. El Draven enemigo yendo para todos lados con su equipo y sacando barons y todo con ellos, nuestra tristana luego del minuto 20 sale de bot. Estan pusheados Tristana y janna aliadas y se les ocurre ir a pelearles al arbusto al team enemigo, donde estaba esperando el mid enemigo, los matan a los 2 y me culpan a mi porque se murieron por meterse al arbusto, vamos bien xD\n\n* ** ** TRISTANA ALIADA 5400 DE DAÑO, ELISE 8400. DRAVEN ENEMIGO 23.000 VAMOS BIEN","replies":[{"poster":"ProGamer2009","date":"2019-04-27T04:51:02.403+0000","up_votes":2,"down_votes":0,"body":"soy gamer","replies":[]},{"poster":"Priestess Winda","date":"2019-04-27T14:42:07.780+0000","up_votes":1,"down_votes":0,"body":"no es cosa de las primeras, 52 partidas para llegar a oro zzz https://www.leagueofgraphs.com/summoner/las/Totally+Not+Arti#championsData-soloqueue\n\nnose que pasa con la gente pero cada dia peor","replies":[{"poster":"Deigex","date":"2019-04-27T15:14:04.863+0000","up_votes":1,"down_votes":0,"body":"https://www.leagueofgraphs.com/summoner/las/Poshtot\n\nPosicionada desde hierro 4 en la primer placement.... 115 ranked totales desde hierro 4 a diamond.... la gente esta igual que siempre.","replies":[{"poster":"Danimilz","date":"2019-04-27T17:49:08.872+0000","up_votes":1,"down_votes":0,"body":"Que bien! te van a dar skin! Felicitaciones!!","replies":[]}]}]},{"poster":"Diegotg2","date":"2019-04-27T17:18:47.127+0000","up_votes":1,"down_votes":0,"body":"Termine la s8, en platino, habiendo perdido un par de promos a platino 1, en pre season no logre mejorar mi mmr, luego en las 10 placements, me tocaron 10 teams horribles, solo logre ganar 1 de 10, y fue porque hice literal 1v9 con sivir","replies":[]}]}