{"poster":"GODLIKE Kha Zix","date":"2014-09-24T15:56:59.388+0000","title":"Ranked korlátozás vélemény","up_votes":4,"down_votes":0,"body":"Azok akik rendszeresen látogatják a fórumot, tudják hogy már 200 megtekintés is igen szépnek számít. Alig egy nap alatt viszont több ezren nézték meg és háborodtak fel a Riot közleményén, minden jog nélkül. Talán teljesen felesleges erről beszélni, de úgy érzem jár egy dicséret a csapatnak, hogy előállt egy (remélhetőleg a további szankciók bevetője gyanánt szánt) ötlettel.\r\nTeljes mértékben támogatom a rendszert, remélem kiélesített és pontos lesz. Örömmel látnék más csoportokban siránkozó \"gyerekeket\" hogy \"ok nélkül kaptam 10-400 ranked bann-t\".\r\nViszont, ami fontos, hogy nagyon nem lesz az jó, ha a rendszer akarja eldönteni minden emberi kontroll nélkül, kit mi illet meg.  Ez igaz az összes szankcióra amit a rendszer a reportok száma alapján vet ki. Bár még soha nem részesültem figyelmeztetésben sem, szívesebben bíznám magam a régi törvényszék rendszerre mint a mostani automata büntető robotra.\r\nValamint már számos helyen olvastam, hogy nem a negatív hozzáállás büntetésével, hanem a pozitív viselkedés jutalmazásával lehetne tartósabb és stabilabb közösséget kiépíteni. \r\nNagyon jó kezdésnek, érdekel mik fogják még követni. Sok sikert, így tovább.","replies":[{"poster":"Feco","date":"2014-09-24T16:31:59.688+0000","title":null,"up_votes":2,"down_votes":0,"body":"A rendszer valóban nem tűnik rossznak. Én is remélem, hogy sikeres lesz. És abban is igazad van, hogy jó lenne, ha nem csak a gép döntené el, hogy kinek jár ez a büntetés. Talán ha a Törvényszék ismét aktív lesz, akkor jól fog működni a dolog.\n\n> Valamint már számos helyen olvastam, hogy nem a negatív hozzáállás büntetésével, hanem a pozitív viselkedés jutalmazásával lehetne tartósabb és stabilabb közösséget kiépíteni.\n\nHa jól tudom, a Honor pontok is ezért vannak. Megjutalmazzák egymást a játékosok ezzel, hogy másoknak is megmutassák, hogy tényleg jól vele játszani. Az elején ez is jól működött, de már nem nagyon szánnak rá a játékosok 10 másodpercet, hogy megjutalmazzák egymást.","replies":[{"poster":"GODLIKE Kha Zix","date":"2014-09-24T16:40:47.857+0000","title":null,"up_votes":1,"down_votes":0,"body":"Egy Riot munkatárs eszmefuttatását olvastam a témában, minek talán az lett a vége hogy:\n- ha ikonokkal, skinnel igyekeznének rávenni a játékosokat, akkor csak addig viselkednének rendesen amíg meg nem szerzik. \nA végmegalapítás az pedig a Riot Point felhasználása volt. Elképzelhetőnek tartott az író a jövőben egy olyan rendszert ami minimális mértékű Riot pont-ot oszt akkor ha valaki honorál téged. Ezzel egyidejűleg változna az, hogy milyen gyakorisággal tudsz valakit honorálni, és ahhoz hogy te bírj honort adni, ahhoz kapnod is kell. \nTehát egy komplex átdolgozása a mostani rendszernek. Ezt is megnézném hogyan működne, akár 2-5 RP / honorable szinten. És mivel nem lehetne honorálni azt akit reportolsz, illetve fordítva... végül is jó lenne a végeredmény.","replies":[{"poster":"BÜDÓSROMÁNERIK","date":"2014-09-25T13:41:03.822+0000","title":null,"up_votes":1,"down_votes":0,"body":"Ezt hol olvastad? Ez érdekelne engem is (már csak azért is, mert már kitárgyaltuk ezt a kérdést itt a magyar fórumon - csak mi nem vagyunk riot munkatársak)","replies":[]}]}]},{"poster":"zrs1337","date":"2014-09-27T12:21:12.505+0000","title":null,"up_votes":1,"down_votes":0,"body":"Szerintem inkább a boostolt feedereket kéne visszapakolni oda ahová valók, egyből kevesebb lenne a flame... Meg talán szigorúbb feltételek kellenének rankedhez az se lenne rossz, mert most 1 vicc.. Kb. eléred lvl 30-at megveszed a 450es championokat, rúna meg mastery az nem lényeg, aztán mehet a ranked, had legyen a többieknek rossz.\n\nÉn is csak ilyenek miatt szoktam ragelni, mert egyszerűen gold/plat ligák tele vannak olyan emberekkel akiket még szerintem bronzeban is kiröhögnének... Egyszerűen 1 winre voltam most is plat promótól és folyamat agyatlan emberekkel vagyok körülvéve és demotolnak, most megint vissza gold 1... És plat playerekkel rak össze,de fogalmuk sincs a játékról, meg 10 percnél mikor enemy kb 5 killel vetet már sírnak, hogy adjuk fel mrt nincs esély... Aztán mondom nekik, hogy defenzíven játszunk az enemy úgyis sok hülyeséget fog csinálni, mert greedy noobok, de nem hallgatnak rám, mennek az enemy junglebe mégtöbbet feedelni, aztán mikor 10. alkalommal mondom, el hogy hadják abba az értelmetlen fightokat, amivel csak tovább feedelik az enemyt még engem oltanak le, hogy milyen hülye vagyok, mert meg kell ölni az enemyt. Csak egyáltalán nem szereznek 1 killt sem, hanem enemynek adják az értelmetlen free killeket... Aztán meg megy a sírás az elo hellről meg noob teamről... GG. És én pl. ezért vagyok készen a játéktól és folyamodok arra, hogy néha leszóljak másokat... Normal gameben nem érdekel, az funra való, de rankeden ilyenek miatt vergődök 1 helyben az már idegesítő...","replies":[]},{"poster":"BÜDÓSROMÁNERIK","date":"2014-09-25T13:40:17.888+0000","title":null,"up_votes":1,"down_votes":0,"body":"Abban a fórumbejegyezésben amelyikben megtörtént a bejelentés, kellően hosszan boncolgattam a dolgot ahhoz, hogy nyugodt szívvel kijelenthessem, hogy *ilyen inkompetenciáról régen tett tanúbizonyságot egy játék-fejlesztő csapat*. \n\nNo offense","replies":[]}]}