{"poster":"SrHoffmann","date":"2016-12-16T01:26:51.314+0000","title":"No se gasten en publicar \"Sus Opiniones\"","subforum":"Charlas Generales","up_votes":2,"down_votes":27,"body":"( Trolls, Afk, Flamers, &quot;Ni&ntilde;os Ratas&quot;)\r\n&quot;Riot&quot; no tiene ningun plan, ni tampoco herramientas para poder acabar con esto. \r\nYo todavia no puedo creer que en cada partida me topo con cada Estupid* que lo unico que hace en las partida es Insultar al equipo.\r\nYo se que a millones de personas les gusta LoL y quieren mejorar... Algunos tienen suertes otros no, pero asi es la realidad y no podras cambiarla.\r\n{{sticker:zombie-brand-clap}} &quot;Tu solo juega y que no te importe lo que digan los demas... No te lo tomes como si fuera la vida&quot;.","replies":[{"poster":"Hnk Kenshiro","date":"2016-12-16T01:30:20.860+0000","up_votes":10,"down_votes":0,"body":"Tu post es una opinion, colega.","replies":[{"poster":"ref","date":"2016-12-16T01:42:23.990+0000","up_votes":1,"down_votes":2,"body":"escribio mal el titulo, obviamente se referia a las quejas. porque el cuerpo se refiere a las quejas.","replies":[{"poster":"Hnk Kenshiro","date":"2016-12-16T01:45:23.074+0000","up_votes":3,"down_votes":0,"body":"Quejarse es una opinion xd\n\nAunque suelen estar mal expuestas, y ese es el problema.\n\n(Y que pidan cosas que no pueden)","replies":[{"poster":"ref","date":"2016-12-16T01:49:52.701+0000","up_votes":1,"down_votes":4,"body":"no porfavor no me digas eso, no son lo mismo.","replies":[]}]}]}]},{"poster":"Sir Crucifix ","date":"2016-12-16T03:58:07.747+0000","up_votes":1,"down_votes":0,"body":"yo ya lo se , solo posteo por diversion , ya con sacar las pociones de mp te das cuenta que clase de juego es \n\nBerreta","replies":[]},{"poster":"ref","date":"2016-12-16T01:38:21.511+0000","up_votes":1,"down_votes":0,"body":"Es que quejarse no es causa de riot, es una forma de pensamiento que tienen muchos chicos, y algunos adultos, que cuando las cosas van mal, lo primero que tenes que hacer es quejarte hasta que **otro** lo solucione en lugar de uno intentar hacer algo, la mayoria piensa que no puede hacer nada y solo se frustra. Pero es una forma de pensamiento que si no cambias no te espera mucho por delante. por eso si quieres algo tenes que actuar no quejarte, en el caso del lol mi consejo para aquellos que les pasa esto es intentar ganar de todas maneras, son pocas las veces que a uno le toca alguien que desea que pierdas, por lo general a veces nosotros causamos esos afk o esos trolls sin darnos cuenta, (ya se ve mucha gente haciendo posts que los banearon porque flameo pero afirma no lo hace mucho y cuando lo hace, el tiene la  total razon de hacerlo), queremos hacer lo que nos es comodo y puede afectar a los demas, esto obviamente para el lol, no soy tan experto en la vida.","replies":[]}]}