{"poster":"[NEM SIKERÜLT KIOLVASNI]","date":"2016-09-14T22:33:18.935+0000","title":"Pregúntale a Riot: Aatrox y tu confianza","subforum":"Anuncios","up_votes":0,"down_votes":1,"body":"[ÜRES]","replies":[{"poster":"Fredymc","date":"2016-09-15T20:45:36.516+0000","up_votes":77,"down_votes":3,"body":"PRIMER COMENTARIO, BUEN POST (y)\r\njuancito, 9 años, no leyo una mierda del post pero llego primero","replies":[{"poster":"TheFalc","date":"2016-09-15T23:37:03.814+0000","up_votes":4,"down_votes":1,"body":"felicidades juancito de nueve años, ahora toda un porvenir dorado te abre sus puertas :P","replies":[]}]},{"poster":"Lmoythor","date":"2016-09-16T05:37:14.071+0000","up_votes":3,"down_votes":7,"body":"Al fin lo preguntan :D yo creo que atrox en si esta \"bien\" pero no Sirve al comienzo.. tal Ves en teenfight,pero depende mucho de la suerte deberían cambiar no la Q ni la W sino la E que sea un stun en ves de una relentización pero en área eso o que deje sangrado en área o una área de bloqueo de habilidades por que lo único que le falta al champ es una habilidad capaz de hacer un combo con su Q sin necesidad de usar su Q como la mayoría de los new champ \r\n","replies":[{"poster":"SteelKing","date":"2016-09-16T06:38:09.314+0000","up_votes":51,"down_votes":1,"body":"teenfight?, así a lo xvideos?","replies":[{"poster":"F de Flan","date":"2016-09-16T14:31:29.673+0000","up_votes":5,"down_votes":0,"body":"Peleea de teens \r\n\r\n{{sticker:slayer-jinx-wink}} ","replies":[]},{"poster":"KaJhinSa","date":"2016-09-16T13:46:35.510+0000","up_votes":2,"down_votes":0,"body":"tenga su like buen hombre\r\n","replies":[]}]}]},{"poster":"Dayren","date":"2016-09-15T21:44:43.660+0000","up_votes":15,"down_votes":2,"body":"> We’re committed to reading every question but can’t guarantee we’ll answer them all.\r\n\r\nComo que el traductor de google les fallo ahi","replies":[]},{"poster":"Dive And Feed","date":"2016-09-15T23:32:15.612+0000","up_votes":9,"down_votes":0,"body":"Desde la eliminación del Zephiro se fue bastante a la B Aatrox :c","replies":[{"poster":"KerneI panic","date":"2016-09-16T06:19:29.664+0000","up_votes":1,"down_votes":1,"body":"***","replies":[{"poster":"SteelKing","date":"2016-09-16T06:36:36.305+0000","up_votes":1,"down_votes":1,"body":"Era un item que daba attack speed cdr y daño de ataque. Además de un bonus de velocidad de movimiento pasivo.","replies":[{"poster":"JAC5110","date":"2016-09-16T14:09:25.935+0000","up_votes":2,"down_votes":0,"body":"el cefiiro daba 25 de ad, 50% de velocidad de ataque, !0% de velocidad de movimiento y 10% de cdr, y la pasiva daba 35% de tenacidad como las botas de mercurio","replies":[]}]}]}]},{"poster":"Mecha Sétt","date":"2016-09-16T03:49:54.822+0000","up_votes":7,"down_votes":0,"body":"hola, no pud preguhtatr a riot no me djo cargar la pagina:\r\nSoy main atrox, lo juego desde que salio, cuando empezo las. el año 2013, ants que saliera lucian y antes de que pusieran el invitar a un amigo para ganar katarina mercenaria. \r\n\r\nMi duda: porque si bien el lore habla de uno de los señores oscuros, no aparecen mas señores? como algun demonio femenino con lore? no cuento skin de vi porque es solo una piel. Segunda duda: Si bien al salir aatrox estaba muy fuerte, pero su gran nerf lo hizo armarse o tank o daño y eso genero que no fuera bueno frente a otros campeones como olaf,(que era un hibrido que hacia el rol sin problma: mi duda es, han pensado en quizas modificar alguna habilidad en funcion de su lore de demonio?. la R encuentro que no tiene mucho al respecto. a diferencia d las otras 3 habilidades.\r\n\r\nComo otra duda: han pensado el quizas agregar habilidades pasivas ademas a sus habilidades normales las cuales sean condicionanteS? me explico: como urgot gana habilidad la Q, cuando usas la W o tiene un enemigo la E. AatroX QUE Gane algun efecto adicional contra enemigos \"maldecidos\", o iracundos?. \r\n\r\nHan explorado algun campeon que refleje literalmente habilidades? como que regrese la misma habilidad cuando cumple determinadas condicionantes. y no un contra ataque como el de fiora?. quizas puda ir por ahi. \r\n\r\nHan en visto la posibilidad que aatrox pueda poseer algun enemigo? apelando al \" mi obra maestra\". ","replies":[{"poster":"Pandagatosimio","date":"2016-09-16T16:23:42.361+0000","up_votes":2,"down_votes":0,"body":"No se supone que Tryndamere es el enemigo de Aatrox? (aniquiló a todo su clan, blehblehbleh)\r\n","replies":[{"poster":"Burger Queen","date":"2016-09-17T18:37:05.001+0000","up_votes":2,"down_votes":0,"body":"Aatrox aparecio en la batlla donde emboscan a la tribu de Tryndamere, cuando el vio que no iba a poder ganar se lanzo a una muerte segura pero Aatrox lo empuje dejandole una herida mortal, pero el se entrego a su fuiria lo que lo hizo inmortal.\r\nCuando Tryndamere iba a volver a batallar contra Aatrox el le sonrio y desaparecio. Tryndamere nunca mas vio a su nemesis hasta que entro en la grieta  ","replies":[]}]},{"poster":"MArtinXDDDDd","date":"2016-09-19T22:53:10.195+0000","up_votes":1,"down_votes":0,"body":"Me encanta tu idea. Yo tambien soy main {{champion:266}} y tu idea me dejo convencido de que tendria que ser igual que Urgot {{champion:6}}  (owo)b ","replies":[]}]},{"poster":"Una de fugazzeta","date":"2016-09-15T20:57:44.363+0000","up_votes":3,"down_votes":0,"body":"Quiero saber cuando sacan el rework de asesinos, y con lo de la pregunta sobre atrox, creo que es un campeon que necesita una mejora en el early porque solo llega a reventar cuando llega a latr game y si no llega no sirve de mucho, aparte de que se tiene que tirar al medio de todos para hacer dañon y su Q se ve desde la base enemiga mas o menos y es muy facil de esquivar,considero que su ulti esta bien pero que deberia tener una pasiva que le de atack speed o algo no se opino eso","replies":[{"poster":"FayelZ","date":"2016-09-15T23:01:27.834+0000","up_votes":1,"down_votes":1,"body":"La pasiva de Aatrox si le da attack speed :v","replies":[{"poster":"Hak","date":"2016-09-15T23:40:57.492+0000","up_votes":8,"down_votes":1,"body":"Pero pierde el Attack Speed si pierde la pasiva\r\n\r\n {{sticker:slayer-jinx-unamused}} ","replies":[]}]},{"poster":"Dog Bulling","date":"2016-09-15T21:00:32.265+0000","up_votes":4,"down_votes":0,"body":"Yo creo que deberían hacerlo menos item-dependiente, o en su defecto, que adquiera mayor ventaja a la que adquiere ahora cuando llega al late.","replies":[{"poster":"EdxxEdxx","date":"2016-09-15T23:19:11.311+0000","up_votes":3,"down_votes":0,"body":"con que cambien un poco su kit de habilidades, lo ajusten a los campeones de hoy en dia, y le den algo especial esta mas que listo, eso pienso yo xd","replies":[]},{"poster":"Zagan","date":"2016-09-18T03:23:12.689+0000","up_votes":2,"down_votes":0,"body":"Yo pienso que deben quitar lo item dependiente, es algo que a los campeones de este tipo los deja o muy fuertes o muy inutiles y tambien que sus habilidades tengan mas presencia en tf, como las de los nuevos champs, el problema de aatrox es que es un campeon anticuado, fuera del meta es un champ de 1vs1 en un meta de tf {{champion:266}} ","replies":[]}]}]},{"poster":"Nadie más","date":"2016-09-18T01:42:33.729+0000","up_votes":4,"down_votes":0,"body":"ALGUIEN QUIERE PENSAR EN URGOT!!! \r\n{{sticker:zombie-brand-mindblown}} ","replies":[{"poster":"Samurai Hack","date":"2016-09-19T20:11:39.490+0000","up_votes":1,"down_votes":0,"body":"urgot esta roto no se que dices :v solo que es un camepon horrible jajaj por eso nadie lo usa","replies":[{"poster":"Nadie más","date":"2016-09-19T23:05:48.786+0000","up_votes":1,"down_votes":0,"body":"no se, por gane dos ranked con el, este mes.","replies":[]}]}]},{"poster":"Raiserzx","date":"2016-09-16T18:07:43.802+0000","up_votes":4,"down_votes":0,"body":"deberian aumentarle la vida base por nivel, agregarle una pasiva a la E y que la E y la R escalen full AD , porque la r escala full AP y la E Escala mixta y se pierde mucho potencial","replies":[]},{"poster":"acaelpibe","date":"2016-09-15T23:00:35.942+0000","up_votes":4,"down_votes":0,"body":"A quien van a ribuorkiar? A atrox ameo tkm un bs","replies":[]},{"poster":"The Darkin Blade","date":"2016-09-15T21:22:38.830+0000","up_votes":4,"down_votes":0,"body":"Siii soy main {{champion:266}} y esto me hacer feliz  :D\r\n{{sticker:slayer-pantheon-thumbs}} ","replies":[]},{"poster":"Krozier","date":"2016-09-18T09:36:44.425+0000","up_votes":3,"down_votes":0,"body":"Aatrox fue mi primer campeon. Al principio no me interesaba el juego hasta que vi la pantalla de carga de Aatrox y WOW!\r\nDije: Tengo que jugar con ese campeon! Asi que me cree una cuenta y jugue jugue jugue y lo compre y asi es como tambien fue mi primer reembolso. Fue una total decepcion, podria pensarse que fue por que no entendia el juego, pero con la PI del reembolso compre a Hecarim, el cual no me decepciono.\r\nVengo quejandome de Aatrox en todos los parches que sacan sin hacerle nada.\r\nAatrox es un campeon que actualmente esta mal por muchos motivos.\r\nSi armas a Aatrox full AD, sos demasiado blando, exesivamente.\r\nSi lo armas full tanque, seguis siendo blando, parece un chiste, pero no lo es.\r\nSi lo armas offtank, podes optar por que los pocos items que le hagas sean AD o atk speed, siempre te falta algo.\r\nTenemos un campeon que como necesita ATK speed necesita ser algo tanque y por ende aguantar cuerpo a cuerpo cierta cantidad de tiempo para causar el daño que necesitamos al objetivo al cual atacamos. El problema esta en que el campeon es blando lo armes como lo armes y si lo tanqueas no pega nada.\r\nEn mi opinion personal creo que su curacion es algo genial, pero solo en face de lineas. Despues no se cura casi nada, termina siendo necesario comprarle lifesteal para que se pueda curar. No deberia ser suficiente su curacion para que uno pueda elegir otros items? Esto hace que no tenga mucha variedad de compra y el campeon se vuelva aun mas aburrido. Es mas sus habilidades gastan mucha vida, lo cual me parece innecesario. No deberian consumir vida. Pensarian que estaria roto si fuera como digo yo?\r\nPiensen lo siguiente:\r\nVolvamos hasta antes del rework de colosos. Que pasaba si yo les decia que quizas estaria bueno que Darius meta las 5 cargas de hemorragia con 1 solo basico al siguiente campeon que golpee despues de matar a un campeon? Que habrian dicho? Que seria demasiado roto? Aun asi lo hicieron y no quedo mal. Bueno, en este caso podrian hacer cosas similares.\r\nAatrox es facil de quitear. Su E sirve solo en face de lineas ya que escala con AP y fue nerfeada poco tiempo despues de que el campeon salio. Y aunque pegues tu E el enemigo se escapa igual.\r\nSi te quedas atras con Aatrox hay MUY POCAS posibilidades de retomar la partida y ser util para tu equipo.\r\nSu Q es buena pero casi no hace daño.\r\nSu ulti es muy buena pero mas que nada por el daño al activarla, normalmente cuando Aatrox se manda y ultea termina muriendo y su pasiva no sirve de nada.\r\nEntonces en MI OPINION tenemos:\r\nUna Q que es excelente ya que nos brinda movilidad e iniciacion en area pero que no hace daño (no esta mal que no haga casi daño ya que la habilidad es muy util)\r\nUna W que creo que deberia ser mejorada como por ejemplo que la W cure y pegue al mismo tiempo, reduciendo un poco la curacio para que no sea exesiva la capacidad de la habilidad. Supongo que no seria muy descabellada esta idea.\r\nUna E que lamentablemente escala con AP, solo rinde en face de lineas y despues es casi inutil por que casi no ralentiza ni daña.\r\nUna R que tiene un daño lindo pero el resto sigue siendo algo inutil ya que el campeon sigue siendo quiteable.\r\nUna pasiva que te revive, pero a la mayoria de la gente que lo juega que les pasa cuando reviven?\r\n1: Moris de nuevo instantaneamente al momento de revivir.\r\n2: Revivis, seguis peleando con -8 de velocidad de ataque y que pasa despues? Adivinaste, te moris por que CUALQUIER campeon que este en frente, te gana. A su vez la pasiva se carga usando habilidades, las cuales tiene mucho tiempo de recarga, no cargan mucho que digamos la pasiva, la pasiva se descarga rapido, la velocidad de ataque que se gana es casi inperceptible... Muchas contras y pocos pro. \r\nSus habilidades en si gastan vida lo cual me parece la peor parte de todo esto. Creo que es innecesario. Habiendo campeones que lo pueden TODO como Fizz y LeBlanc, por que Aatrox no podria gastar sus habilidades en paz sin tener que pensar que por haber usado su Q para saltar un muro despues tiene que pegar 18 veces el 3er golpe de su W en modo sed de sangre para recuperar su vida perdida lo cual es muy molesto / incomodo.\r\nCreo que deberian hacer que sea un campeon basado en habilidades al igual que Riven, Renekton, Lee Sin etc.\r\nO sino deberia seguir basandose en velocidad de ataque pero con la capacidad de no morir instantaneamente con las habilidades que sin querer lo tocan desde afuera de una TeamFight. Si, aveces podes morir de rebote sin siquiera llegar a entrar en la TeamFight.\r\nHace rato que quiero escribir mucho sobre Aatrox pero habria quedado bastante colgado escribiendo esto en los parches en los que claramente nisiquiera aparece ni para que le suban 1 de daño a su E JAJA.\r\nGRACIAS por acordarse que Aatrox existe. Me muero por saber que le van a hacer.","replies":[{"poster":"vortexVK","date":"2016-09-19T00:34:52.795+0000","up_votes":2,"down_votes":0,"body":"Uff men es EL Post\r\nLo poco k lei tienes razon","replies":[]}]},{"poster":"JotAEMx","date":"2016-09-18T06:20:09.425+0000","up_votes":3,"down_votes":0,"body":"Yo creo que si Aatrox hizo mierd4 a todo el clan de Trynda... Deberia ser un put* dios demonio... La verdad que es un poco raro lo que le pasa a este champ, yo lo uso y veo que no aporta mucho en las tf, es iniciador pero no tiene tanto aguante o una inicicion fuerte. Si lo haces a daño quedas super blandito y no aportas lo necesario en las tf, solo 1v1. Si lo haces tank le falta daño.. Off tank siento que le falta algo, hay muchos campeones off tanks que pegaban muchisimo (Wukong, Renekton, Jax, etc) pero Aatrox necesita muchos items para tener mucho daño y mas que todo a meele. No deberia depender tanto de los items o de mucha cantidad.\r\nSi acabo con un clan, deberia ser bueno en las TF. En late Trynda le gana a Aatrox y supuestamente, Aatrox es mas poderoso que Trynda segun el lore y este es \"su obra maestra\".\r\n\r\nPonganle algo mas para tf como el rework de Vladimir. Y que el robo de vida aumente dependiendo el pozo sangriento ademas de la velocidad de ataque. Que no dependa de hacerse 3 items de robo de vida para que tenga un robo y daño decente.\r\nDeberia aguantar mas, si es un dios como dije antes, tiene que poder aguantar y ser bueno en las tfs.\r\n\r\nEs solo una opinion.\r\n","replies":[{"poster":"Hak","date":"2016-09-20T15:13:30.308+0000","up_votes":1,"down_votes":0,"body":"A mi me gustaría que aumenten su armadura y tenacidad confome vaya perdiendo vida, así como olaf gana Attack speed","replies":[]}]},{"poster":"medinat","date":"2016-09-17T19:22:52.834+0000","up_votes":3,"down_votes":0,"body":"disculpen pero en la portada pusieron Reguntale en ves de preguntale.{{sticker:zombie-brand-clap}} ","replies":[]},{"poster":"MapacheMandioca","date":"2016-09-15T21:59:19.197+0000","up_votes":3,"down_votes":1,"body":"aunque yasuo no este muy en el meta...las veces que me toca con uno me destroza, tendrian que ajustar un poco el tema del lifesteal para mi, solamente eso","replies":[{"poster":"MapacheMandioca","date":"2016-09-16T17:23:07.456+0000","up_votes":3,"down_votes":0,"body":"dije yasuo? me confundi xD queria decir aatrox","replies":[]},{"poster":"Agogo","date":"2016-09-15T22:38:21.509+0000","up_votes":2,"down_votes":0,"body":"Jugar Lissandra, fin del problema.","replies":[]}]},{"poster":"SonaDJ Kawaii","date":"2016-09-18T13:45:04.111+0000","up_votes":2,"down_votes":0,"body":"{{champion:103}} {{champion:84}}{{champion:51}} {{champion:114}} {{champion:69}} {{champion:222}} {{champion:127}} {{champion:203}} {{champion:254}} {{champion:143}}  esos campeones quiero pd:que tiene que ver nada XDDDDDDDDDDDDDDDDD","replies":[{"poster":"vortexVK","date":"2016-09-19T00:32:47.812+0000","up_votes":1,"down_votes":0,"body":"T pones a manquear con kind y te busco,secuestro..... Y nos ponemos a jugar v: kind muy buen champ , divertido,algo roto,bueno tanto en tf o 1 v 1 (cosa imposible perder con el) v:.\r\nAGUANTE KINDRED VIEJA!!!!","replies":[{"poster":"vortexVK","date":"2016-09-19T00:40:47.758+0000","up_votes":1,"down_votes":0,"body":"Te lo dice con amor un main kind V:\r\nSi,sono bastante maraco","replies":[{"poster":"SonaDJ Kawaii","date":"2016-09-29T23:13:20.693+0000","up_votes":1,"down_votes":0,"body":"jajajaja\r\n","replies":[]}]}]}]},{"poster":"Sash903","date":"2016-09-16T17:26:49.647+0000","up_votes":2,"down_votes":0,"body":"En mi opinion la jugabilidad de aatrox no tiene similitud con su lore, es un dios de la guerra y la lucha y no se siente tan poderoso como debería ser creo que su gameplay se tiene que basar mas en teamfights si es un luchador o que se vuelva un asesino.","replies":[]},{"poster":"Taiju","date":"2016-09-15T22:03:31.432+0000","up_votes":2,"down_votes":0,"body":"hace tiempo vengo pensando lo olvidado que está el pobre {{champion:266}} ","replies":[]},{"poster":"Dog Bulling","date":"2016-09-15T20:58:23.256+0000","up_votes":2,"down_votes":0,"body":"Ya era hora de que le hicieran algo a aatrox, que actualmente, aparte de curarse mucho, ni tiene buen harass, ni buena movilidad, ni mucho daño, ni mucho aguante, ni un control de masas fiable.","replies":[]},{"poster":"NahrGaku","date":"2017-03-14T18:57:43.538+0000","up_votes":1,"down_votes":0,"body":"AATROX ANDA MAAAAAL, lo que hacia unico a aatrox o por lo que se lo recuerda es por el hecho de que revive, con la nueva pasiva casi nunca llegas a revivir y cuando jugas con el es muy feo que mueras y no te haya revivido por culpa de que le fataba una habilidad mas para que pueda hacerlo ","replies":[]},{"poster":"Inquisiidor","date":"2017-02-27T10:58:54.382+0000","up_votes":1,"down_votes":0,"body":"Soy Main Aatrox {{champion:266}} M7 300.000 DE Maestrias. y me siento con el derecho de Opinar Sobre el.  El Campeón esta Bien en cuanto a Jugabilidad. Pero a Mi Parecer Hacer Algunas Cosas que le Hacen Falta y otras que le sobran.\r\n\r\n\r\nSin Bien Saben los que Jugan a Aatrox , Pudes llegar a 2,5 de velocidad de ataquee con un solo Items. (Maestrías y ruanas correctas + Definitiva y Pasiva)\r\n\r\nYa dicho esto Que le Falta?  \r\n\r\ntenemos Velocidad, Pero somos muy Blando al Principio de la partida, y lo hace muy items Dependiente. lo cual esta mal. (Necesita Durabilidad en TF, COMO TANQUE LUCHADOR).\r\n\r\nPerdemos Mucha Vida al ejecutar Habilidades, La Habilidad E Tiene un coste muy Alto en comparación a su efecto.\r\n\r\n\r\nluego de resucitar con pasiva La Vida que Recuperamos en muy poca  y es un blanco Fácil. \r\n\r\n\r\nRecomendaciones de Cambios\r\n\r\n-Eliminar el Coste de Vida en todas sus Habilidades. (o que se un coste de vida Fijo)\r\n\r\n-Que sea inmune al menos 0,5 segundos Luego de Revivir con su pasiva o que la Habilidad Q Sea Imparable. (por lo menos 0,5 seg. Luego de revivir con pasiva)\r\n\r\n(Cuando Revive con pasiva , no es nada Pierde Toda su velocidad de Ataque y lo hace muy débil para seguir Luchando).\r\n\r\nSu Definitiva debería destacar mas sus Habilidades. (o Tener mayor Daño en Área)\r\n\r\nQue los escalados sean AD Pero su Daño sea Ap. ( Habilidad E Y R)\r\n\r\nCon eso Se Pondría Volver a Jugar Aatrox o mejor dicho podría volver a ser un champs Viable . \r\n\r\n\r\n\r\n\r\n\r\n","replies":[]},{"poster":"Diodores","date":"2016-12-14T20:24:05.531+0000","up_votes":1,"down_votes":0,"body":"hola vuelvo para escribir para ver si los rioters ven este comentario bueno {{champion:266}} es mi campeon favortio es el primero que jugue y le tengo mucho cariño esto de un posible rediseño me emociona bastante ya que el personaje se lo merece si se dan cuenta no se utiliza tanto y no llama la atencion de los jugadores y si tuviera que cambiarle algo seria la pasiva en cierto modo y la r aunque hay detalles sobre otras habilidades espero que tengan mi opinion en cuenta para el diseño, hacen un buen trabajo y buena suerte!      ","replies":[]},{"poster":"RockAndRoll","date":"2016-12-09T20:43:51.206+0000","up_votes":1,"down_votes":0,"body":"Espero no que no se les haya olvidado xD {{champion:266}} {{item:3070}} ","replies":[]},{"poster":"RockAndRoll","date":"2016-11-11T02:08:11.908+0000","up_votes":1,"down_votes":0,"body":"Aún lo espero :c {{champion:266}} {{item:3070}} ","replies":[]},{"poster":"Trollpick Master","date":"2016-09-20T01:00:49.374+0000","up_votes":1,"down_votes":0,"body":"En mi opinión, y creo que la de muchos, su NOTABLEMENTE mayor defecto es la falta de alternativas para impedir acciones tóxicas por parte de jugadores. Por ejemplo sería excelente un control opresivo sobre los jugadores en caso de acumulación de reportes, para que DURANTE la partida se les solicite que si está siendo agresivo o tóxico cambie ese comportamiento (saben a lo que me refiero, son excelentes dando refuerzo positivo). O por ejemplo la opción de reportar a un jugador durante la partida, y/o marcarlo como pre-reportado para no olvidar reportarlo en la pantalla de estadísticas. También sería excelente poder tener al terminar la partida un registro del chat de equipo y del chat global para poder indicar con mayor precisión por qué se está reportando a un jugador en caso de que sea por insultos.","replies":[{"poster":"Toxic Milei","date":"2016-09-23T03:00:58.229+0000","up_votes":1,"down_votes":0,"body":"sin contar lo del \"pre-reportado\" estan muy buenas las ideas","replies":[]}]}]}