{"poster":"[NEM SIKERÜLT KIOLVASNI]","date":"2019-07-16T18:00:18.844+0000","title":"Notas de la versión 9.14 de Teamfight Tactics","subforum":"Anuncios","up_votes":1,"down_votes":0,"body":"[ÜRES]","replies":[{"poster":"ernesto jesus","date":"2019-07-16T18:52:52.931+0000","up_votes":6,"down_votes":86,"body":"mas fome el tft me gustaba urf pero lo sacaron :(\r\n{{champion:555}} ","replies":[{"poster":"Zardoxd","date":"2019-07-16T19:21:16.428+0000","up_votes":71,"down_votes":1,"body":"Al menos quitaté el icono de TFT para que nos tomemos enserio tu comentario....","replies":[]}]},{"poster":"Asenalim","date":"2019-07-16T18:43:48.561+0000","up_votes":29,"down_votes":45,"body":"Ya que todos estamos con el RNG. Mi humilde opinión, hacer clasificatorias de algo que está tan atado a la suerte, es sumamente estúpido.\r\nEl modo es bueno, es divertido, pero de ahí a incluir lo competitivo en algo tan al azar... no me convence. \r\n\r\nAnyway, Riot hará lo que Riot quiera, los comentarios son useless. \r\n{{sticker:sg-soraka}} \r\n","replies":[{"poster":"MD Abýssou","date":"2019-07-16T19:35:59.768+0000","up_votes":38,"down_votes":6,"body":"cualquier juego de cartas tiene rng y hay muchos que tienen escena competitiva muy importante, ejemplos\r\npoker\r\nhearthstone\r\nmagic\r\nyugioh","replies":[{"poster":"Throner","date":"2019-07-17T13:01:37.543+0000","up_votes":6,"down_votes":0,"body":"concuerdo, lo unico que me parece desbalanceado son los objetos. Hay veces que en toda la partida no te sale ni uno y la verdad que se siente la diferencia cuando un jugador tiene objetos. Con esto no estoy diciendo que esten mal los objetos sino el drop de ellos\r\n","replies":[{"poster":"FullTimeKiller","date":"2019-07-17T14:14:13.019+0000","up_votes":1,"down_votes":1,"body":"si, la cantidad de objetos deberia ser igual para todos los jugadores, espero no conviertan al tft en una porqueria como hearthstone, donde solo ganas por la suerte, y nada de estrategia","replies":[]}]},{"poster":"SShadowj","date":"2019-07-16T20:29:00.844+0000","up_votes":6,"down_votes":30,"body":" Justamente esos juegos son un desastre en ese aspecto si no se balancean bien. Me acuerdo mi amigo en el Yugi hacia unos mazos buenísimos pero siempre perdía contra mi porque no le tocaba nada xD","replies":[{"poster":"Nehalem","date":"2019-07-16T23:08:14.492+0000","up_votes":14,"down_votes":1,"body":"Entonces no era un mazo bueno, un mazo bueno se encarga de buscar las cartas para depender cada vez menos del factor suerte. ","replies":[]},{"poster":"TiToldero","date":"2019-07-18T17:10:59.438+0000","up_votes":1,"down_votes":1,"body":"Decis que juegos como Yugi son un desastre, mas abajo te pusieron que Yugi ya no depende del factor rng  y decis que ahora es una cagada, que es muy facil, bla bla... quien entiende a esta gente, si no les gusta un juego no lo jueguen y listo...","replies":[{"poster":"SShadowj","date":"2019-07-21T16:58:05.641+0000","up_votes":1,"down_votes":0,"body":"Claramente no entendes a que me refiero si decís eso. Juegan con las mismas cartas de siempre porque están en meta, no balancearon bien una chota y ahora lo que antes era un milagro porque te esforzabas mucho se hace de un pedo. Perdió la esencia metiendo cartas como si fuera Pokemon. Ahora en el primer turno ya podes tener monstruos de 6000 en tu deck, sacar el factor RNG quitando la esencia del juego es el movimiento más estúpido que se puede hacer. Ya no se disfruta como se disfrutaba antes el juego inclusive con el RNG.","replies":[]}]}]},{"poster":"Sessh","date":"2019-07-18T02:39:25.685+0000","up_votes":1,"down_votes":4,"body":"Si comparas TFT, que esta en una beta, muy mal hecha por cierto, con juegos como Magic y su versión Online, es que no tienes ni la más puta idea ni de rngs bien hechos y que llevan décadas con competitivo, donde no suceden errores como los que se manda rito y que, además, tienen un alto nivel de complejidad y estrategia. Poker ni siquiera se puede comparar con un rng, Herthstone esta muerto, y yugi oh no existe. Anda a acostarte mejor.","replies":[{"poster":"MD Abýssou","date":"2019-07-23T14:54:42.097+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Sessh,realm=LAS,application-id=9xRiuj3T,discussion-id=fNILxzrh,comment-id=000200030002,timestamp=2019-07-18T02:39:25.685+0000)\n>\n> Si comparas TFT, que esta en una beta, muy mal hecha por cierto, con juegos como Magic y su versión Online, es que no tienes ni la más puta idea ni de rngs bien hechos y que llevan décadas con competitivo, donde no suceden errores como los que se manda rito y que, además, tienen un alto nivel de complejidad y estrategia. Poker ni siquiera se puede comparar con un rng, Herthstone esta muerto, y yugi oh no existe. Anda a acostarte mejor.\n\ncomparo al tft con un juego de cartas porque si lo miras de cierta forma el tft es un juego de cartas.\ny mi punto no era comparar directamente al tft con juegos en especifico, si no dar a entender que es posible tener rng y ser competitivo, muchas gracias por darme la razon en eso.\nHS esta pasando por un mal momento, pero hubo un tiempo que su escena competitiva fue muy importante, de hecho creo que lo sigue siendo.\nYugioh tambien tuvo su momento importante.\nPoker ni siquiera se puede comparar con un rng? pibe fijate que la manera en que se juega al poker es por porcentajes, a que te hace acordar eso? exacto a rng.\nMe parece que sos vos el que se tiene que ir a acostar :)","replies":[]}]}]},{"poster":"Wertress","date":"2019-07-16T18:56:16.395+0000","up_votes":23,"down_votes":6,"body":"Concuerdo un 100% de hecho, si lo hicieran, no tendrían la excusa de no haber Ranked para los amantes del ARAM por sobre la grieta, ya que según tengo entendido, no lo han hecho por el componente azar.\r\n\r\nY si lo hicieran, aun esta muy verde, sobre todo por desbalanceo del RNG, me a tocado estar en ambas partes, donde todos los campamentos dan un objeto o no te dan nada, es muy raro estar en un termino medio, por lo general es \"te dan todo\" o \"Te dan nada\".","replies":[{"poster":"Bran","date":"2019-07-17T05:02:30.285+0000","up_votes":3,"down_votes":0,"body":"Creo que para solucionar el RNG del aram, deberían asignar un rol a cada jugador y dentro de ese rol te toque un campeón que ya haya sido configurado para ese rol por ejemplo:\r\nSoporte: Lulu, Rakan, Yuumi, Morgana.\r\nDe estos cuatro Morgana sirve para el rol \"medio\" aunque no haya una linea entonces, esta podría estar configurada para aparecer en ambos roles, tal cual como pasa con tft, si eres lvl 1 te aparecerán solo campeones de lvl 1, pero si eres lvl 2 te aparecen campeones tanto como de lvl 1 y lvl 2, lo mismo aqui pero preconfigurados para salir en cualquier linea segun como funcionen en la grieta. así siempre saldría un campeón top, adc, soport, mid y jg sin ser tan rng pero si te saldrá cualquier campeón, también la linea tampoco debería poder ser elegida para que sea lo mas rng posible sin que te salga una composición donde vayan a perder tan facil.","replies":[]}]},{"poster":"Franco Rose","date":"2019-07-16T19:25:30.391+0000","up_votes":7,"down_votes":8,"body":"che y no te parece que en la grieta del invocador hay un factor de suerte tambien? que no te toque contra smurf que no te toquen trolls que no te toquen personas que hagan lo que quieran. Yo veo perfecto las rankeds aca porque al menos tu suerte en la partida va de como te adaptes a lo que te dieron y si perdes no lo haces por un team de mierda ","replies":[{"poster":"FullTimeKiller","date":"2019-07-17T15:15:15.409+0000","up_votes":2,"down_votes":1,"body":"eso no seria suerte, seria un pésimo sistema de emparejamiento (si, es malo el del lol)","replies":[{"poster":"TiToldero","date":"2019-07-18T17:15:56.575+0000","up_votes":2,"down_votes":0,"body":"El sistema no es malo, el problema es q hay muchos busteaditos por ahi dando vuelta...","replies":[]}]}]},{"poster":"keve","date":"2019-07-16T22:16:23.378+0000","up_votes":3,"down_votes":1,"body":"según tengo entendido te dan puntos hasta el 4to puesto o 3ro (no recuerdo), y los demás les quitan pl. Viéndolo de ese modo no es tan descabellado unas ranked en tft. ","replies":[]},{"poster":"The UnshackIed","date":"2019-07-16T19:32:58.642+0000","up_votes":17,"down_votes":5,"body":"Aparte de los objetos todo el RNG es manejable, a diferencia de un ARAM en donde si te toca una composicion dominante sobre la otra ya es ff, solo tienen que solucionar el drop de items y ya esta","replies":[]}]},{"poster":"Wertress","date":"2019-07-16T18:50:30.469+0000","up_votes":6,"down_votes":14,"body":"Hay varios cambios de los que están aquí que esperaba, pero, aun hay otros que no llegaron que quería ver.\r\n\r\n1.- Bajar el daño de Draven 1 (Con los objetos pertinentes, un Draven 1 hace lo mismo que un 2 o 3)\r\n2.- Que un campeon no puedan tener dos veces el mismo objeto equipado.\r\n3.-La posibilidad de desequipar un objeto de un aliado sin necesidad de venderlo, aunque sea 1 vez por partida.\r\n4.- Subir el RNG de objetos en los bichos, u obtener un objeto mínimo por campamento, que a veces al final esos campamentos se vuelven rondas muertas porque no sacas nada, y ni contar de las veces que no sale un solo objeto en todos los campamentos y el rival ya tiene 4 objetos completos, mas que RNG esos es desbalanceo.\r\n5.- Esto ya es personal, se trata del cañon de fuego rapido y los Yordles, no puede ser que UN OBJETO niegue toda la habilidad de una raza.","replies":[{"poster":"Kafei","date":"2019-07-16T22:51:35.762+0000","up_votes":1,"down_votes":1,"body":"Que les niega el rapidfire cannon a los Yordles? \r\n{{sticker:sg-lux-2}} ","replies":[{"poster":"Radgost","date":"2019-07-16T22:59:25.943+0000","up_votes":4,"down_votes":0,"body":"Yordle: Los ataques contra los Yordles aliados tienen una probabilidad de fallar.\r\nRFC: Los ataques no pueden fallar, duplica el rango.","replies":[]}]},{"poster":"jokerjoel","date":"2019-07-16T20:06:38.820+0000","up_votes":2,"down_votes":0,"body":"5: ejem... phantom dancer vs asesinos. Acaso esperas a que por que alguien juegue yordles tengas que estar obligado a jugar hechiceros por que los básicos no jalan?","replies":[]},{"poster":"The UnshackIed","date":"2019-07-16T19:36:06.897+0000","up_votes":6,"down_votes":1,"body":"-El numero 3 es absurdo, es una mecanica que debes asumir, es como jugar draven y quejarte de que hay que recoger sus hachas\r\n\r\n-El numero 5 es logico y es lo mejor, hasta considero que deberia haber un antiCC para negar el congelar absurdo de los gelidos, obvio solo sirve con UN CAMPEON","replies":[{"poster":"TrueTony","date":"2019-07-16T21:04:38.337+0000","up_votes":1,"down_votes":1,"body":"La 3 tiene logica en alguna situación. Por ejemplo, cuando vos elegis un personaje con un item que queres y ese mismo personaje completa para subir de nivel. El objeto que tenia se queda en ese, y no lo podes sacar para el personaje que si queria. Ejemplo tenes 2 ww, y queres un arco curvo para completar un item de tu vayne. En la ronda agarras el ww por el item, y al iniciar ya se te fusiona sin podes usar tu item. ","replies":[]}]}]},{"poster":"DoubleDrift","date":"2019-07-16T20:36:49.091+0000","up_votes":3,"down_votes":0,"body":"A ver si entienden esto puede que tenga parte de azar el modo TFT pero no deja de ser mas(reitero: MUCHÍSIMO MAS) Estratégico que el ARAM. Tanto como por la sinergia, la posición, las cualidades de los champs en Team Figth etc.. Cuando ARAM solo cuenta con la composición de Team Figth.","replies":[]},{"poster":"Vlyztering","date":"2019-07-17T16:27:33.445+0000","up_votes":1,"down_votes":0,"body":"me gustaria saber hacia donde orientaran el juego, si quieren que los campeones sean protagonistas o los objetos, el juego es bastante bueno, tengo un amigo que juega yu gi oh pero no le gustaba el juego LoL, le comente sobre el TFT que basicamente era un tablero con cartas y le gusto, pero la verdad siento que el juego no esta sanamente balanceado en cuanto a objetos me refiero, en campeones estan bien llamativos cada uno con sus pro y contras (obviamente hay cosas que corregir, pero que son menores a mi punto de vista), lo que me gustaria saber solo el balance de objetos, o el RNG de objetos ya que de verdad uno arma una composicion en base a las cartas que les toca, pero los objetos no te acompañan con tu composicion, bajo ese punto de vista cambio mi composicion en base a los objetos que me salgan? o cambio mi composicion en base a las cartas que me salgan?, espero recibir respuestas para que se pueda debatir de forma sana este punto de vista, me despido.\r\n\r\n\r\nPD: Me gustaria saber a parte de las paginas de internet que hay, si riotLAS publicara, algun poster o imagen donde se puedan ver las razas y objetos, y sus combinaciones. (Bueno si alguien tiene alguna pagina de internet, que la adjunte, pero me gustaria que Riot hiciera una oficial). Eso gracias","replies":[{"poster":"Van Hoffer","date":"2019-07-17T21:11:41.008+0000","up_votes":2,"down_votes":0,"body":"He jugado bastante tft, así como también me he interiorizado en esta clase de juegos. Comencé viendo streaming apenas salió, de los que ahora son considerados los mejores, ya que ahora el meta lo están construyendo principalmente ellos. En general, como tú dices, pueden haber distintas formas de afrontar el juego, puedes venir con una idea predeterminada de la composición que quieres jugar y forzarla hasta que te salgan todas las piezas, también puedes adaptarte a los campeones que te vayan saliendo, o armarte dependiendo de los item que te aparezcan. En general, diría que no hay una manera predeterminada para ganar, lo que aparentemente predomina para saber si un jugador es bueno o no, es la capacidad para adaptarse a los aspectos de \"suerte\" del juego, es decir, saber conjugar los campeones con los objetos. Lo que he visto mayoritariamente acá, es que en verdad casi nadie entiende mucho, extrapolando de lo que se ve ingame, con los comentarios de este mismo post. Es raro ver gente que haga transiciones, la mayoría hace composiciones basándose en lo que obtienen en early, no hacen buena economía, y suelen quedar pegados en lvl 6 o 7, suelen priorizar campeones sobre item en el carrusel, etc. lo que hace el meta de nuestra región, muy de early donde muchos hacen hyper roll en los krugs, esto conlleva a que es normal ver composiciones sin mucho sentido, pero con mucha fuerza bruta (campeones tier 1 de 3 estrellas), alrededor del power spyke de lvl 6 a 7. \r\nCreo que de la manera en que se está jugando acá, es precisamente la razón del porqué todos se quejan de la suerte. Como se fuerza mucho el early, dependes principalmente de los objetos y campeones que te salgan en las primeras rondas, lo que hace el juego muy volátil. Porque a la larga, llegando a late, que sería rondando la rondas previas al dragón, todos, en general, tienen la misma cantidad de objetos, y las composiciones estabilizadas.\r\nEsa es mi humilde opinión","replies":[]}]},{"poster":"Daisuke Mizugawa","date":"2019-07-17T19:32:38.941+0000","up_votes":2,"down_votes":0,"body":"Una herramienta que me gustaría en un futuro próximo es una que te permita ver las combinaciones de los objetos, es medio engorroso. Por lo demas, veo cambios muy prometedores en éste parche!\r\n\r\n{{sticker:slayer-pantheon-thumbs}} \r\n\r\n**También me gustaría que implementen música de fondo peeeero eso ya es algo personal mío lol","replies":[]},{"poster":"Fedelich","date":"2019-07-16T22:49:15.533+0000","up_votes":2,"down_votes":0,"body":"Bajarle un pelin a los yordles y a los glaciares? un pelin nomas. O agregar un objeto pal CC de los glaciares, un fajín o algo asi para un solo campeón. ","replies":[]},{"poster":"StarPlatinøøb","date":"2019-07-16T18:58:33.187+0000","up_votes":3,"down_votes":8,"body":"el pedazo de nerf le metieron a elise bajando todos sus stats y mas encima bajan la vida del cambia formas ... mejor la sacan del juego y punto","replies":[{"poster":"The UnshackIed","date":"2019-07-16T19:38:37.286+0000","up_votes":5,"down_votes":1,"body":"JAJAJAJAJAJAJ como se nota que no has visto a Elise en el PBE, es totalmente meta, da asco que te toque contra ella ","replies":[{"poster":"SEba huehue","date":"2019-07-16T20:52:06.949+0000","up_votes":2,"down_votes":7,"body":"¿Qué tiene que ver cómo esté en el pbe? En el live es muy mala, y en estas notas parece que el nerf es comparado con la versión live, no pbe. Si es comparado con la versión del pbe es otra cosa, además de no tener ningún sentido.","replies":[{"poster":"Jonii17","date":"2019-07-16T23:14:00.695+0000","up_votes":5,"down_votes":1,"body":"?? Como que tiene que ver?? A lo que vos le llamas \"version PBE\"  es a justamente este parche que desde mañana es live, basicamente, lo que hoy está roto en el PBE mañana va a estar roto en el live ya que se aplican esos cambios\r\nNo tiene sentido lo que decis, el PBE no es un juego diferente","replies":[]}]}]}]},{"poster":"TS13","date":"2019-07-17T01:17:24.022+0000","up_votes":2,"down_votes":1,"body":"Lo peor es que no cambiaron lo que TODA la comunidad pedia.\r\nIgualdad en cantidad de items dropeados. \r\nQue todos reciban la misma cantidad de items por oleadas. Riot hace lo que quieras","replies":[]},{"poster":"Miyeon","date":"2019-07-16T22:17:23.516+0000","up_votes":2,"down_votes":1,"body":"se  deberia implementar el que no haya mas  de una copia de cada campeon dentro del Tft lo haria  bastante mas justo y mas balanceado","replies":[{"poster":"Jonii17","date":"2019-07-16T23:17:29.427+0000","up_votes":1,"down_votes":0,"body":"Mas de un copia?? explicate, si decis que solo 1 de los 8 pueda tener a Garen no tiene gracia y píerde el sentido del juego","replies":[{"poster":"Alto Paty","date":"2019-07-17T01:52:28.539+0000","up_votes":1,"down_votes":0,"body":"Amigo, voy a organizar una rifa y entre todos te vamos a comprar un detector de sarcasmo.","replies":[]}]}]},{"poster":"F4NT4","date":"2019-07-18T15:23:42.653+0000","up_votes":1,"down_votes":1,"body":"LO PEOR que le voy viendo a LEAGUE OF LEGENDs es el TFT deberían de haberlo hecho como un juego A PARTE... es espantoso ni parece LOL... Y A LOS QUE NO NOS INTERESA AHORA NOS VAMOS A COMER UNA ACTUALIZACIÓN A CADA RATO (como si ya no fueran suficientes)!!!!!","replies":[{"poster":"The UnshackIed","date":"2019-07-23T02:25:21.618+0000","up_votes":1,"down_votes":0,"body":"Oh dios mio, que horrible tener miniactualizaciones de menos de un minuto, que sufrimiento, es el fin del mundo","replies":[{"poster":"F4NT4","date":"2019-10-13T13:39:00.465+0000","up_votes":1,"down_votes":0,"body":"la verdad que si ES PAN TO SO!{{sticker:zombie-nunu-tears}}","replies":[]}]}]},{"poster":"Markov Chain","date":"2019-07-17T19:07:14.701+0000","up_votes":1,"down_votes":0,"body":"Grandes cambios. Felicitaciones al equipo de Riot que se encarga de balancear el juego y darle diversidad. Para todos aquellos que dicen que depende puramente del rng el ganar o perder no entienden como se debe jugar este juego.","replies":[]},{"poster":"Alfa Pasta","date":"2019-07-17T17:53:52.345+0000","up_votes":1,"down_votes":0,"body":"se habran dado cuenta de que hay un promedio de 2 a 3 jugadores afk en la primera seleccion por que se queda congelada la pantalla? xd","replies":[]},{"poster":"PsyCongroo","date":"2019-07-17T17:11:50.474+0000","up_votes":1,"down_votes":0,"body":"Cualquiera los cambios, hay pjs OP q los buffearon y pjs debiles q los nerfearon, ademas de que romipieron el juego con los bugs.","replies":[]},{"poster":"Jinxed07","date":"2019-07-17T01:51:44.401+0000","up_votes":1,"down_votes":0,"body":"F por la {{champion:76}} con {{item:3094}}, era genial ver a ese leopardo tirando zarpazos desde la loma del ort0","replies":[{"poster":"elcombre2019","date":"2019-07-17T15:58:43.946+0000","up_votes":1,"down_votes":0,"body":"no es un leopardo es un cougar hembra","replies":[]}]},{"poster":"Maxxie04","date":"2019-07-17T13:56:02.330+0000","up_votes":1,"down_votes":0,"body":"\"Muchísimas correcciones de errores más que no aparecen en las secciones de arriba.\"\r\n{{sticker:sg-lux-2}} ","replies":[]},{"poster":"LemonTea","date":"2019-07-17T00:35:51.979+0000","up_votes":1,"down_votes":0,"body":"¿Alguna explicación lógica del aumento de daño de {{champion:45}} a campeones con nivel de estrella inferior de 9999 ⇒ 19999?\r\n\r\n¿Acaso algún campeón resistía 9999 de daño?","replies":[{"poster":"Shijim4 de Virgo","date":"2019-07-17T04:42:08.846+0000","up_votes":1,"down_votes":0,"body":"Braum con la resistencia magica creo","replies":[]}]}]}