{"poster":"[NEM SIKERÜLT KIOLVASNI]","date":"2016-12-16T17:41:01.135+0000","title":"Desarrollo: La diversidad de campeones","subforum":"Anuncios","up_votes":1,"down_votes":0,"body":"[ÜRES]","replies":[{"poster":"Ode to dark","date":"2016-12-16T19:55:06.204+0000","up_votes":74,"down_votes":2,"body":"133 campeones y solo veo {{champion:157}} ","replies":[{"poster":"Rise1192","date":"2016-12-17T08:45:29.560+0000","up_votes":8,"down_votes":0,"body":"Y cómo no, Rito metiendo a Yasuo en cada uno de sus temas. ","replies":[]}]},{"poster":"Beau Ciel","date":"2016-12-16T21:56:23.342+0000","up_votes":61,"down_votes":1,"body":"**\"Diversidad\"**\r\n{{champion:64}} {{champion:92}} {{champion:157}} {{champion:238}} {{champion:107}} ","replies":[{"poster":"Nebulousscratch","date":"2016-12-16T23:36:22.188+0000","up_votes":24,"down_votes":1,"body":"{{champion:67}} ","replies":[]}]},{"poster":"Senert","date":"2016-12-16T21:12:12.634+0000","up_votes":26,"down_votes":0,"body":"***","replies":[{"poster":"CoronavirusC0V","date":"2016-12-17T04:38:41.049+0000","up_votes":8,"down_votes":4,"body":"te falto {{champion:64}}  y {{champion:412}} que parece como si fuera obligatorio que estubieran almenos 1 por partida","replies":[{"poster":"Hidroz765","date":"2016-12-17T20:48:23.134+0000","up_votes":12,"down_votes":0,"body":"{{champion:67}}  en un 90% de mis partidas hay una y siempre con la misma actitud creida","replies":[]}]}]},{"poster":"Valkyant","date":"2016-12-17T22:31:32.351+0000","up_votes":23,"down_votes":2,"body":"Estamos jugando un juego donde un {{champion:101}}  que tiene en total 8 skillshots a level 18 (si mal no recuerdo, la R en nivel 3 tiene 5 disparos), tiene menos damage que una {{champion:1}}  que solo debe apretar Flash R - W y ya hay 4 muertos y un herido (Según Crónica TV, el 5to también está muerto...) \r\n\r\nEstamos jugando un juego en el cual, un campeón como {{champion:23}} , al cual podrías jugar sin teclado se hace un penta 1 v 5, hace un backdoor, mata a Nashor solo, se reincorpora a su team y se van a la disco a bailar al ritmo de Maluma... \r\n\r\nEstamos jugando a un juego en el cual un {{champion:122}}  te tanquea medio team, le bajaste 1/4 de vida solo para que se lo regenere de inmediato usando la Q, (mientras tanto, la Q te dejó sin piernas) y te borra de una sola tecla, cuyo tooltip (o descripción de la habilidad, como quieran llamarlo) debería decir algo como... \"No importa cómo, dónde y cuándo la aprietes, sea quien sea la víctima; un {{champion:54}}  con 5 {{item:3075}}  y 1 {{item:3083}} , un {{champion:57}}  con 7 {{item:3143}}  (se sacó el trinket para ponerse otro) o una Leona con 15K de armor y 75K de vida... Igual se va a morir\"\r\n\r\nNo importa, voy a seguir jugando. Y no es una queja, es una realidad...  \r\n\r\n","replies":[{"poster":"Astolfo on bush","date":"2016-12-18T22:52:19.789+0000","up_votes":3,"down_votes":0,"body":"Me hiciste el día, simplemente porque es verdad","replies":[]}]},{"poster":"Chubakita","date":"2016-12-16T19:26:28.555+0000","up_votes":1,"down_votes":0,"body":"riot por favor que alguno pase el link para esas imagenes porq estan muy buenas!!!!!!!!!!!!!!!\r\nquiero la primera para fondo de pantalla lml{{sticker:zombie-brand-mindblown}} ","replies":[{"poster":"Riot Cóndor","date":"2016-12-16T19:42:26.000+0000","up_votes":21,"down_votes":2,"body":"Si hacés clic derecho sobre la imagen, guardás la URL y la abrís en otra pestaña del navegador, la vas a poder guardar en tamaño completo.","replies":[{"poster":"cacapolis","date":"2016-12-21T13:03:31.225+0000","up_votes":2,"down_votes":0,"body":"hackerman","replies":[]}]}]},{"poster":"Pupa Marina","date":"2016-12-16T19:26:30.706+0000","up_votes":18,"down_votes":1,"body":"acuérdense de {{champion:74}} {{item:3070}} \r\nno se ve ni en bronce ni en competitivo","replies":[{"poster":"KARISTON","date":"2016-12-17T00:15:47.152+0000","up_votes":8,"down_votes":1,"body":"mejor q no se vea heimer... Prefiero estar contra un yasuo q contra un heimer","replies":[{"poster":"gMartin01","date":"2016-12-17T02:47:48.082+0000","up_votes":4,"down_votes":1,"body":"Es el campeón menos gankeable de la historia!","replies":[]}]},{"poster":"Annie Botz","date":"2016-12-17T00:54:03.801+0000","up_votes":5,"down_votes":1,"body":"Es complicado ganarle, es raro no verlo xD","replies":[]}]},{"poster":"Numerítos","date":"2016-12-16T20:26:06.374+0000","up_votes":16,"down_votes":1,"body":"hablan de diversidad y ponen a yasuo riven y ekko xD","replies":[]},{"poster":"Dragonhex","date":"2016-12-17T05:08:13.798+0000","up_votes":9,"down_votes":0,"body":"hablan de diversidad y nerfean a {{champion:163}} {{champion:240}}  y {{champion:427}} ","replies":[]},{"poster":"Dog Bulling","date":"2016-12-16T22:22:47.495+0000","up_votes":11,"down_votes":2,"body":"A ver todas las contradicciones en el texto aquel\n\n> Para nosotros es más importante que la partida sea divertida y sana, que diversa.\n\nYo juraría que eran prácticamente equivalentes. Una partida poco diversa se vuelve para prácticamente todos los jugadores, como en una partida aburrida y poco saludable. Así mismo, la gran cantidad de los campeones frustrantes se sienten así porque los vemos muy seguido, aparte de que tienden a ganar seguido o que no son fáciles de parar. A nadie le he oido quejarse de un galio que aguanta y pega una barbaridad, o de Aatrox, siendo que puede revivir. Y si existe ese campeon frustrante e impopular ¡¿PORQUE AÚN NO SE HAN DETENIDO A HACERLE UN REWORK PARA QUE DEJE DE SER IMPOPULAR Y FRUSTRANTE?!\n\n> La mayoría de nosotros tenemos que recurrir a campeones que tengan cierto potencial para dominar en solitario, ya que puede que no podamos confiar en la cohesión del equipo en la cola en solitario **(aunque voy a aprovechar para invitarte a probar la nueva cola flexible y ver si ahí puedes disfrutar de una experiencia competitiva que también tenga en cuenta la composición del equipo como estrategia)**\n\nRito, ustedes son unos tercos vendidos. A casi nadie nos gusta ese modo porque es una ranked sin tener la seriedad de una. Aparte, sabemos de sobra que es la cola dinámica de premades carreando, que estuvo presente en la S6, pintada con el nombre de \"cola flexible\".\n\n> **Jinx y Ahri** son campeonas populares entre los jugadores por motivos que tienen que poco que ver con sus índices de victoria.\n\nMENTIRA. Ahri ha estado en un 52-53% de winrate desde hace al menos un año y medio. Y Jinx no es que gane poco en el juego, de hecho estuvo en god tier para los mortales durante media temporada, y sigue ganando bastante fuerte al tirar las torres en nada. No hay muchos campeones populares e ineficaces, y estos, en el caso de volverse fuertes de un día para otro, su popularidad llega hasta las nubes, como pasó o esta pasando con lucian, riven, vayne, lee sin, yasuo, jhin, jinx o lux.","replies":[{"poster":"Samtrok","date":"2016-12-16T23:37:51.781+0000","up_votes":1,"down_votes":0,"body":"lux no se volvio fuerte simplemente volvio a salir por el tema del skin xD siempre a sido igual de fuerte que la gente ~~niños~~ solo saque ahri mid por que -motivos obvios-  es otra cosa","replies":[{"poster":"Dog Bulling","date":"2016-12-17T00:13:04.823+0000","up_votes":3,"down_votes":0,"body":"¿Recuerdas como era lux hace un año? Era lo más fuerte en mid, con winrates bordeando el 55%, aparte de uno de los 5 más usados por esa misma razón. Por eso le mencioné como ejemplo. Son campeones relativamente populares, pero que cuando se ponen por encima (como fue con Lux a inicios de la S6, yasuo con mazo helado, el lee de los últimos dos meses, vayne con statikk y filo infinito, Jinx de la segunda mitad de la S6, Jhin con Yoummu y Draktharr, riven en fechas de campeonato, y la black build de lucian, con el cual llegó por sobre el 50% de popularidad y 54% de winrate) practicamente todos se ponen a jugarlos. Por eso esta lucian allí, con lo mal que esta ahora.","replies":[]}]}]},{"poster":"Hi im Eleven","date":"2016-12-16T22:32:34.256+0000","up_votes":9,"down_votes":1,"body":"Uh si, 133 champs, dejame decirte los unicos que me aparecen a mi, capaz es un bug: {{champion:64}} {{champion:157}} {{champion:238}} {{champion:92}} {{champion:122}} {{champion:245}} ","replies":[{"poster":"Hidroz765","date":"2016-12-17T20:52:15.933+0000","up_votes":5,"down_votes":0,"body":"ese bug se llama un dia normal en lol","replies":[]}]},{"poster":"Pibe Alfajor","date":"2016-12-19T21:04:46.824+0000","up_votes":7,"down_votes":0,"body":"Cosas que no veo:{{champion:266}} {{champion:32}} {{champion:34}} {{champion:136}} {{champion:268}} {{champion:63}} {{champion:201}} {{champion:69}} {{champion:31}} {{champion:42}} {{champion:36}} {{champion:28}} {{champion:9}} {{champion:3}} {{champion:150}} {{champion:79}} {{champion:120}} {{champion:427}} {{champion:40}} {{champion:59}} {{champion:126}} {{champion:429}} {{champion:30}} {{champion:38}} {{champion:10}} {{champion:85}} {{champion:203}} {{champion:240}} {{champion:96}} {{champion:89}} {{champion:127}} {{champion:117}} {{champion:54}} {{champion:57}} {{champion:90}} {{champion:82}} {{champion:75}} {{champion:111}} {{champion:56}} {{champion:20}} {{champion:76}} {{champion:61}} {{champion:80}} {{champion:133}} {{champion:33}} {{champion:78}} {{champion:421}} {{champion:58}} {{champion:68}} {{champion:113}} {{champion:98}} {{champion:102}} {{champion:27}} {{champion:14}} {{champion:15}} {{champion:72}} {{champion:16}} {{champion:50}} {{champion:134}} {{champion:223}} {{champion:163}} {{champion:44}} {{champion:412}} {{champion:48}} {{champion:29}} {{champion:77}} {{champion:6}} {{champion:6}} {{champion:6}} {{champion:6}} {{champion:6}} {{champion:110}} {{champion:112}} {{champion:8}} {{champion:106}} {{champion:19}} {{champion:62}} {{champion:101}} {{champion:83}} {{champion:154}} {{champion:115}} {{champion:26}} \r\n\r\nCosas que veo:{{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:67}} {{champion:67}} {{champion:67}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:64}} {{champion:64}} {{champion:64}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} {{champion:157}} ","replies":[]},{"poster":"vaVav","date":"2016-12-16T19:46:26.071+0000","up_votes":7,"down_votes":0,"body":"Tienen que hacer un campeón que sea un súbdito, pero grande y todo eso, sería como una mutación o algo así, en la ulti se transforma en un Súbdito con Cañon.","replies":[]},{"poster":"XzaicrowX","date":"2016-12-16T23:47:32.717+0000","up_votes":8,"down_votes":1,"body":"porfavor riot equilibren a {{champion:420}} no puede seguir asi , que pueda hacer un 5 contra 1 es demaciado","replies":[{"poster":"Phantom047","date":"2016-12-23T18:51:40.250+0000","up_votes":3,"down_votes":0,"body":"si ultea, salis de su R y ya esta, esa es toda la ciencia ","replies":[]}]},{"poster":"Arkeuz","date":"2016-12-16T22:48:04.245+0000","up_votes":8,"down_votes":1,"body":"Vamos por la maestria 7 con Urgot {{champion:6}} {{sticker:slayer-pantheon-thumbs}} ","replies":[]},{"poster":"xHyurno","date":"2016-12-16T19:50:52.477+0000","up_votes":6,"down_votes":1,"body":"Yo quiero un adc que sea de las profundidades :c (del mar ){{champion:67}} +{{champion:267}} ","replies":[]},{"poster":"Antediluviano","date":"2016-12-20T16:10:01.596+0000","up_votes":4,"down_votes":0,"body":"Deberiamos tener un server los que odiamos a los mismos champs de siempre xD osea todo bien que se usen cada tanto, pero todos los dias uno si o si por partida en serio?... {{champion:157}} {{champion:238}} {{champion:67}} {{champion:122}} {{champion:92}} {{champion:64}} \r\nCreo que soy el unico con {{champion:6}} M5 xD","replies":[{"poster":"SolyDameALaFlaca","date":"2016-12-21T17:01:38.352+0000","up_votes":2,"down_votes":0,"body":"Yo lo tengo en m7{{champion:6}} ","replies":[]}]},{"poster":"xDona","date":"2016-12-17T21:40:24.136+0000","up_votes":4,"down_votes":0,"body":"#Nerfeo para Camille{{champion:164}} ","replies":[]},{"poster":"RustOz ","date":"2016-12-17T14:35:14.612+0000","up_votes":4,"down_votes":0,"body":"Buscan diversidad y hablan mucho sobre Yasuo y lo fruteado que esta. Pero 2 meses después crean a Camille que esta 5 veces mas fruteado que este...\r\n{{champion:164}}","replies":[{"poster":"Dhizarch","date":"2016-12-18T22:59:05.321+0000","up_votes":3,"down_votes":0,"body":"Lo más fruta de {{champion:164}} es la ulti, no puedes salirte con flash. para mi la tendrían que hacer como la de {{champion:412}} o {{champion:59}} ya que muchos champs dependen mucho del {{summoner:4}} para escapar. Solamente le pude ganar con {{champion:114}} ","replies":[]}]},{"poster":"FABRI99","date":"2016-12-16T21:38:58.097+0000","up_votes":5,"down_votes":1,"body":"133 campeones y siempre se ve {{champion:157}} {{item:3072}} {{item:3070}} ","replies":[]},{"poster":"WenaMapache","date":"2016-12-16T21:21:19.761+0000","up_votes":5,"down_votes":1,"body":"Yo esto lo publique en un foro y bueno:\r\n\r\nDisculpen la palabra, pero no pueden ser más descarados y con el que hay diversidad. Siempre veo a los mismos champs en todas las partidas y eso es porque ustedes mismos lo han permitido. \r\n\r\nSi, existen mas de 100 de champs, pero puedo decirles que actualmente se usan solamente 40 de esos. Llevo jugando desde la pretemporada de la S4 y aún sigo viendo los mismos champs como Lee Sin, Yasuo, LeBlanc, Zed, Riven... ahora ultimo con los reworks ha mejorado un poco, pero no ha sido suficiente. \r\n\r\nYo se que no todos los champs pueden ser populares, pero viejo... minimo un poco de cariño con los demás, sobre todo los con mecanicas simples. Warwick sigue teniendo las mismas habilidades y lo unico que han hecho ha sido una retexturiacion, lo mismo Teemo... Galio, desconozco si alguna vez lo tocaron siquiera.","replies":[{"poster":"RaczackII","date":"2016-12-17T00:41:33.366+0000","up_votes":1,"down_votes":0,"body":"yo creo q tanto galio como teemo siguen estando rotos y son competentes, mas aun galio q te puede cambiar totalmente el rumbo de una partida","replies":[{"poster":"Annie Botz","date":"2016-12-17T01:02:00.217+0000","up_votes":2,"down_votes":0,"body":"Igual depende de las circunstancias, yo compré y usé Xera pero solo conseguí derrotas :'v tenía poco daño a diferencia de otros campeones que con el mismo item te reventaban.\r\nLuego están otros como {{champion:266}}  {{champion:427}} {{champion:56}} {{champion:20}} {{champion:82}} {{champion:27}} {{champion:23}} {{champion:6}} {{champion:69}} algunos si tienen un cambio significativo dentro de juego pero otros se quedan atrás","replies":[{"poster":"Lord HiddenRich","date":"2016-12-17T18:17:02.703+0000","up_votes":3,"down_votes":0,"body":"Aatrox el campeon mas inutil del juego si esque no te feedeas.","replies":[]}]}]},{"poster":"Antediluviano","date":"2016-12-23T23:01:04.673+0000","up_votes":2,"down_votes":0,"body":"No se si sabias pero luego de todo el evento de navidad saldrá el rework estilo {{champion:14}} {{champion:44}} {{champion:83}} de {{champion:19}} , luego sacaran un campeón nuevo y luego de ese se viene el rework mas grande que han hecho que sera el de {{champion:3}} ... No han especificado nada de cada uno pero lo que dijeron de Galio es que sera el mas grande de todos los rework...{{sticker:slayer-jinx-catface}}","replies":[{"poster":"WenaMapache","date":"2016-12-23T23:47:23.100+0000","up_votes":2,"down_votes":0,"body":"Sí, bro. El usuario con el que debatí me recordó lo de Warwick y Galio. Gracias igual xD","replies":[]}]},{"poster":"EdxxEdxx","date":"2016-12-16T21:58:27.758+0000","up_votes":2,"down_votes":2,"body":"> minimo un poco de cariño con los demás, sobre todo los con mecanicas simples. Warwick sigue teniendo las mismas habilidades y lo unico que han hecho ha sido una retexturiacion, lo mismo Teemo... Galio\r\n\r\n¿Que no es suficiente cariño un rework completo de warwick y galio?. La diversidad de campeones está, si la gente únicamente usa 4 campeones no es culpa de nadie. Ni tuya, ni mia, ni de rito. Y timin creo que necesita un rework visual.","replies":[{"poster":"WenaMapache","date":"2016-12-19T16:54:44.046+0000","up_votes":2,"down_votes":0,"body":"¿No es de Riot? Viejo, yo tengo muy claro que por temporada existen campeones que son populares por el tema de ser fuerte y todo eso, pero otra cosa es estar consciente de que a pesar que son populares, estan demasiado fuertes y no han tenido un balance adecuado, haciendo que estos sean mucho más usados gracias a eso.\n\nEso si, debo decir que olvidé que a Warwick le iba a llegar un rework junto a Galio... excelente, pero ¿Cual fue el beneficio de retocar 2 veces a Ryze en poco tiempo?\n\nY lo de Teemo, más que un rework visual, me gustaría mas un rework a sus habilidades. Tampoco digo que se convierta en una dificultar máxima, pero que tenga otras utilidades también. Encuentro que son muy básicas y lo digo yo, siendo que lo uso bastante.","replies":[{"poster":"EdxxEdxx","date":"2016-12-19T18:30:52.487+0000","up_votes":2,"down_votes":0,"body":"La culpa no recae sólo sobre rito, y con eso me refiero a que ese tipo de campeones simplemente crean la ilusión de que eres faiquer 3.14 doblado a la quinta si te fedeas de 3 o 4 kills. Hay campeones que están rotos, y eso lo tengo muy claro, y otros que estan en la línea de ban o pick. Pero como dije, hay mas de 130 campeones, y cada 2-3 meses crean uno nuevo. La diversidad no es el problema, campeones hay, y siguen creando, y de eso nadie puede quejarse. El problema es que un campeón esté desbalanceado, ya sea en stats, o por su kit de habilidades (como es yavzurdo). Y eso tampoco te lo voy a negar, porque yo mismo lo sufro muchas veces.\n\nLo de ryze fue un caso especial, fue antes de que rito lanzara esa \"política\" de que únicamente harían reworks completos, o pesados (como lo de talon). Pero lo hicieron porque el pelado estaba realmente roto, y cuando te digo que estaba roto, me refiero a que estaba más roto que un yavzurdo 10/0. Con una ulti a nivel 1 que hacía daño en área, que era una metralleta, y que tenia un cd de mas o menos 40seg.\n\nPor teemo no lo encuentro inútil, no sé si da como para un rework completo, no se me ocurre ahora mismo ninguna idea, pero sí creo que timin necesita algo de cariño, y su kit de habilidades ya empieza a sentir el tiempo :c","replies":[]}]}]}]},{"poster":"Dhizarch","date":"2016-12-18T22:53:12.382+0000","up_votes":3,"down_votes":0,"body":"Ya no existe la diversidad desde hace rato, cuando voy mid y pickeo {{champion:4}} {{champion:127}}{{champion:82}} {{champion:163}}    {{champion:38}}  {{champion:50}} me flamean a más no poder por no usar a {{champion:45}} {{champion:157}} {{champion:238}} {{champion:105}}.\r\n\r\nHasta los items estan desequilibrados, el {{item:3191}} tendría que tener darte la activa del {{item:3157}} como los ad ya tienen la pasiva de{{item:3156}}  con sólo comprar {{item:3155}}.\r\nel {{item:3157}} se esta convirtió en item obligado de comprar  y emcima lo nerfearon.","replies":[]},{"poster":"XxlentaoxX","date":"2016-12-16T20:34:30.820+0000","up_votes":3,"down_votes":0,"body":"¿Y cómo afecta esto a Lee Sin? Lo veo en todas las partidas, y no precisamente ganando, siempre los veo perder, por lo que roto no está. Además tuvo un nerf recientemente, que en lugar de bajar su popularidad solo hizo más inútiles a los main Lee promedios.","replies":[]},{"poster":"Netoltano","date":"2016-12-16T21:02:58.801+0000","up_votes":4,"down_votes":1,"body":"Transformen todas las habilidades en skillshots y van a ver como mejora todo en LOL, hagan q los tanques realmente sean tanques y no q encima q aguantan hostias por horas te exploten de una R... un poco de criterio >Riot nada mas","replies":[{"poster":"KeijaShadoll","date":"2016-12-16T22:00:40.950+0000","up_votes":1,"down_votes":2,"body":"es verdad ademas la cantidad de campeones que su mecanica ronda en el ataque basico es triste {{champion:266}} {{champion:5}} {{champion:19}} {{champion:48}} {{champion:23}} {{champion:77}} {{champion:102}} {{champion:2}} {{champion:11}} {{champion:24}} ","replies":[{"poster":"XxlentaoxX","date":"2016-12-16T22:46:24.386+0000","up_votes":1,"down_votes":3,"body":"Te faltó {{champion:17}} , también los ADCs fáciles y sin mecanicas: {{champion:67}} {{champion:22}} {{champion:51}} {{champion:222}} {{champion:429}} {{champion:96}} {{champion:15}} {{champion:29}}.\r\n{{champion:72}} {{champion:106}} {{champion:157}} (este es básicos y Q, pero la Q se comporta como un básico, es casi lo mismo).","replies":[{"poster":"Alpakista","date":"2016-12-17T00:31:23.788+0000","up_votes":3,"down_votes":0,"body":"Juegas Adc por lo menos para decir \"sin mecanicas\"","replies":[]}]}]}]}]}