{"poster":"[NEM SIKERÜLT KIOLVASNI]","date":"2018-07-13T18:18:53.097+0000","title":"Apoya a beneficencias locales con Cho'Gath","subforum":"Anuncios","up_votes":5,"down_votes":0,"body":"[ÜRES]","replies":[{"poster":"QuantumTraveler","date":"2018-07-13T19:06:33.913+0000","up_votes":10,"down_votes":1,"body":"Solo e jugado cho'gath 1 vez. Pero todo sea por la beneficencia.{{sticker:sg-syndra}} ","replies":[]},{"poster":"LeaXHawX","date":"2018-07-14T01:07:40.234+0000","up_votes":14,"down_votes":8,"body":"nada para argentina??{{sticker:slayer-jinx-unamused}} ","replies":[{"poster":"Katastrofica","date":"2018-07-14T22:03:57.624+0000","up_votes":6,"down_votes":10,"body":"Aparentemente si sos de LAS donas para la educación de chile, mientras tanto en LAN hay un montón de países con su propia beneficencia... ","replies":[{"poster":"Jaggeron","date":"2018-07-14T22:19:55.903+0000","up_votes":16,"down_votes":8,"body":"El alcance de la CDI es internacional en colaboracion con **Argentina** y Peru, no tiene ninguna relacion directa con la educacion en Chile y su funcion es expandir en uso de la informatica a diversas areas sociales. La negativa argentina para crear una CDI y tu propia ignorancia no son culpa ni de Riot LAS, ni de Chile ni de la CDI\r\n\r\n{{sticker:slayer-pantheon-thumbs}} ","replies":[{"poster":"ThKroosvb","date":"2018-07-16T00:57:52.746+0000","up_votes":11,"down_votes":2,"body":"Imagina si tuviera un país de verdad.{{champion:24}} {{item:3151}} ","replies":[]}]}]}]},{"poster":"Baiken","date":"2018-07-13T20:12:01.832+0000","up_votes":2,"down_votes":14,"body":"Es necesario pagar tanto para tener ese borde?, podrían incorporar el borde con alguna misión, independiente de que sea la mejor skin de Cho'Gath","replies":[{"poster":"Defg45333","date":"2018-07-13T23:14:48.308+0000","up_votes":13,"down_votes":1,"body":"Es para beneficiencia y querés una forma de conseguirlo gratis xD","replies":[{"poster":"CryForMee","date":"2018-07-15T12:22:11.738+0000","up_votes":2,"down_votes":7,"body":"Entonces cada uno deberia pagar lo que quiera por esto, si total es beneficencia y yo voy a contribuir  con lo que pueda, no con lo que me obliguen... ","replies":[{"poster":"Desaroll","date":"2018-07-15T23:56:39.803+0000","up_votes":8,"down_votes":1,"body":"Nadie te obliga, ¿No?","replies":[]}]}]}]},{"poster":"Araf","date":"2018-07-15T19:12:10.743+0000","up_votes":7,"down_votes":0,"body":"Como lo mencione hace un rato, los precios  fueron  subidos exageradamente para un tema de donación. si hubieran mantenido el precio base  creo que hubieran tenido mas ingresos. En lo personal decidí colaborar por dos  simples razones.\r\n\r\nLa primera por que soy coleccionista, la segunda porque es un apoyo y así no este mencionada mi país(Perú) en la pagina de la organización chilena, si es por una causa que ayude, pues no importa el país, sino el apoyo como  persona que uno puede brindar.\r\n\r\n{{sticker:vlad-salute}} ","replies":[]},{"poster":"Un Quequito","date":"2018-07-13T19:54:59.912+0000","up_votes":5,"down_votes":0,"body":"estaré orgulloso de regalar ésta skin... incluso más sabiendo que luego se convertirá en aspecto de gema{{sticker:sg-ezreal}} ","replies":[]},{"poster":"sonof666","date":"2018-07-14T16:15:09.971+0000","up_votes":12,"down_votes":7,"body":"Personalmente NO PARTICIPARÉ DE ESTO. Chile no es igual a América Latina. Hubiese sido mejor elegir una organización de beneficencia regional y no una solo para Chile, como si en los demás países no hubiera gente necesitada y en peores condiciones.","replies":[{"poster":"Reiba","date":"2018-07-17T14:22:15.528+0000","up_votes":4,"down_votes":3,"body":"Compañero, lee solo 1 minuto mas entrando al link disponible aquí mismo y entérate que la ONG tiene presencia a nivel latinoamericano (Argentina, Venezuela, Brasil, Colombia...), no solo en Chile.","replies":[{"poster":"sonof666","date":"2018-07-17T18:36:04.481+0000","up_votes":3,"down_votes":0,"body":"Gracias por ilustrarme, compañero.","replies":[]}]}]},{"poster":"Parque Gordasico","date":"2018-07-13T22:35:26.377+0000","up_votes":4,"down_votes":0,"body":"Nuca mas actualizaron los protectores del lol\r\n","replies":[]},{"poster":"Rodeko","date":"2018-07-14T02:39:00.467+0000","up_votes":6,"down_votes":2,"body":"No hay zona de beneficiencia para Perú? {{sticker:sg-ahri-3}}  pensaba volver a recargar rps por esta causa pero creo que seguire sin hacerlas {{sticker:zombie-brand-clap}} ","replies":[{"poster":"ßlu","date":"2018-07-14T13:13:34.713+0000","up_votes":6,"down_votes":2,"body":"Los Americans de riot solo consideran Chile como parte de Las , no existen más paises y ayudar una ONG internacional como medicos sin fronteras era mala idea para ellos.","replies":[]}]},{"poster":"Maineo Late","date":"2018-07-19T03:34:03.612+0000","up_votes":5,"down_votes":2,"body":"Todo para chile,Argentina,Peru,Uruguay,Bolivia y Paraguay no existen para riot.\r\n\r\n\r\nY antes que me digan que es una fundacion para latinoamerica los invito a leer es la donacion para la cede de chile:\r\n\"El Comité para la Democratización de la Informática (CDI), fue fundado en Brasil en 1995 como iniciativa pionera para promover la democratización del acceso a las tecnologías de la información entre habitantes de las comunidades de Río de Janeiro. Con el apoyo y entusiasmo de empresas y voluntarios que abrazaron la causa de la inclusión digital, la organización abrió las primeras Escuelas de Informática y Ciudadanía en diversas comunidades socialmente vulnerables de Río de Janeiro. A lo largo del tiempo, la organización extendió su ámbito de actuación y pasó a llevar el empoderamiento digital a individuos en varios países a través de una red de organizaciones aliadas, llegando así a Chile.\"","replies":[]},{"poster":"3lChiKoAndréS","date":"2018-07-14T13:54:00.930+0000","up_votes":1,"down_votes":2,"body":"y la skin para kindred donde {{champion:203}} ","replies":[{"poster":"lord dhaos","date":"2018-07-15T19:32:21.833+0000","up_votes":3,"down_votes":0,"body":"{{champion:427}} ","replies":[]},{"poster":"InuHs","date":"2018-07-14T23:57:41.437+0000","up_votes":1,"down_votes":0,"body":"{{champion:136}} ","replies":[]}]},{"poster":"Nocturne Beast","date":"2018-07-15T03:37:54.066+0000","up_votes":2,"down_votes":0,"body":"Por que tan caro el Gesto? 600RP ","replies":[]},{"poster":"Nahuelk001","date":"2018-07-14T00:33:20.813+0000","up_votes":2,"down_votes":0,"body":"El valor humano que tiene Riot Games es algo de envidiar {{sticker:slayer-pantheon-thumbs}} ","replies":[]},{"poster":"Khá Zíx","date":"2018-07-13T23:43:42.287+0000","up_votes":2,"down_votes":0,"body":"Como main {{champion:31}}  me lo pienso comprar y ayudar a que Riot haga algo bien no como su juego que tiene tan linda comunidad{{champion:11}} ","replies":[]},{"poster":"PaladinZero","date":"2018-07-15T01:10:48.078+0000","up_votes":4,"down_votes":2,"body":"Si tuviera mucho dinero, compraria esta skin para regalar a varios... solo soy pobre, asi que me la comprare para mi nada mas {{sticker:sg-ahri-2}} \r\n\r\nPor otro lado, aqui hay gente que solo se dedica a hostigar ... me pregunto yo: \"Si tu pais no tiene una de las fundaciones listadas aqui, porque no las indicas como sugerencia?\" y por ultimo \"Porque tu mismo no incitas la creacion de una ONG?\".\r\n\r\nA veces, me sorprende un poco que la gente sea tan negativa... o tal vez es que ya \"los mas viejos\" nos cansamos de las personas mas egoistas y egolatras. {{sticker:sg-soraka}} ","replies":[]},{"poster":"PSR Enyel","date":"2018-07-14T16:05:41.833+0000","up_votes":2,"down_votes":1,"body":"Esto me hizo acordar a la frase de Jaximus \"Va por ti chico\" {{sticker:sg-soraka}} ","replies":[]},{"poster":"Wyman","date":"2018-07-14T16:04:51.602+0000","up_votes":2,"down_votes":1,"body":"Medicos sin fronteras e ingenieros sin fronteras... deberían estar en la lista.\r\n\r\nSoy de Argentina y me parece bien que no haya beneficiencia para mi país, ya que la iglesia católica está metida en todo y se roban la plata.","replies":[{"poster":"Pandidav","date":"2018-08-08T23:37:47.656+0000","up_votes":1,"down_votes":0,"body":"??? que tiene q ver la iglesia ?","replies":[]}]},{"poster":"Totoro Sama","date":"2018-09-04T13:44:21.063+0000","up_votes":1,"down_votes":0,"body":"Yo lo compre, no me quejo pero me hubiese gustado que tengan en cuenta a Argentina. Espero que lo sigan haciendo al fin puedo decir GG Riot!","replies":[]},{"poster":"Shinra 8","date":"2018-09-03T22:37:56.271+0000","up_votes":1,"down_votes":0,"body":"Me alegro, es un dolor a mi billetera pero es una skin de mis tematicas favoritas y es para beneficencia asi que fue dos pajaros {{champion:268}} de un tiro{{sticker:slayer-pantheon-thumbs}} ","replies":[]},{"poster":"Morphin","date":"2018-07-15T02:09:11.149+0000","up_votes":1,"down_votes":0,"body":"En mi caso no me gusta casi ninguna de las skins de Cho, como las de Cog, hay muy pocas que me gusten, ademas de las que tengo me salieron como aspecto permanente, pero al ser una tematica de \"estrella oscura\" me la compre, y probablemente me compre el paquete con el marco, ya que casi todas las skin con marco me las compro solo por el marco, no me importa gastar 1 peso mas por tener el marco xd Aun que cuando salio la skin de Ashe de campeonato, me la iba a comprar y al final me salio en caja y permanente, asi que no tuve que comprarla {{sticker:sg-miss-fortune}} La skin de varus con el con el borde si la compre, pero cuando salio la skin de Lux solo alcance a comprar el icono con el borde pero cuando ya tenia los rp para comprar la skin se termino el tiempo {{sticker:sg-janna}} Mi unica opcion es que me salga en caja o en \"mi tienda\" que a muchois les salio y mi me pusieron la skin de lux guardina de las estrellas que no me gusta >:c ","replies":[{"poster":"Silcardo Jenazad","date":"2018-08-10T12:49:37.874+0000","up_votes":1,"down_votes":0,"body":"mmm amigo...me parece q te equivocaste...se supone que en mi tienda... no pueden salir skins definitivas en oferta","replies":[]}]},{"poster":"Bladezz","date":"2018-08-09T20:27:10.000+0000","up_votes":1,"down_votes":0,"body":"Te juro que a un día de que finalice todo esto, me puse a ver los comentarios... y no entiendo como hay gente que se indigna y dice que por mas que quiere la skin y demás, no aportara nada porque no hay beneficencia para su país... es algo estúpido pensar que por eso dejarían de donar, independiente de donde sea o para que país vaya la beneficencia, sigue siendo para ayudar a personas, la nacionalidad no le quita valor a las personas, si de verdad veías bonita esta causa, y de verdad querías aportar tu granito de arena, no te importaría donar para gente que lo necesita, porque gente necesitada hay en todos los países","replies":[]},{"poster":"Artiel","date":"2018-08-09T05:01:40.396+0000","up_votes":1,"down_votes":0,"body":"Casi me compro el pack con el borde de carga... Despues lei que lo recaudado en Las seria para Chile y se me fueron las ganas. GG RITO","replies":[]},{"poster":"Pandidav","date":"2018-08-08T23:34:19.836+0000","up_votes":1,"down_votes":0,"body":"Comprare Cho Gath para que se coma a todos los beneficiarios. {{sticker:darius-angry}} ","replies":[]},{"poster":"TynArgLOL","date":"2018-08-08T22:25:19.974+0000","up_votes":1,"down_votes":0,"body":"{{champion:2}} {{summoner:30}} ","replies":[]},{"poster":"Exe maicra","date":"2018-07-19T08:37:12.889+0000","up_votes":1,"down_votes":0,"body":"no entiendo la verdad. {{sticker:sg-lux-2}} ","replies":[]},{"poster":"VonCactus","date":"2018-07-16T20:54:12.769+0000","up_votes":1,"down_votes":0,"body":"y la skin de aurelion sol para cuando xd? a todo esto el tema con el CDI, es una organización noble, y tiene la base central en chile si no mal recuerdo y tiene presencia internacional, no solamente chile saludos, informence, si no les gusta no compren :D{{sticker:slayer-jinx-wink}} ","replies":[]},{"poster":"CyberSoul","date":"2018-07-16T14:49:18.872+0000","up_votes":1,"down_votes":0,"body":"No uso a Cho gath, lo use una vez en aram pero porque no tenia mas dados para tirar. Si puedo la compro porque esta buena la skin, pero sino no.\r\nEsto me hace acordar a la skin de Mercy Rosa que saco Overwatch para una organizacion en contra del cancer de mama, esa si estaba buenisima, pero no juego overwatch asi que me la aguante y no la compre, pero esa venia con una remera, asi que valia mucho la pena","replies":[]},{"poster":"Galiers","date":"2018-07-15T21:36:31.477+0000","up_votes":1,"down_votes":0,"body":"va el 100% de lo recaudado o es lo tipico de solo un %???","replies":[{"poster":"Killer Wanted","date":"2018-07-16T01:27:57.736+0000","up_votes":1,"down_votes":0,"body":"100%","replies":[]}]},{"poster":"Dat Butterfly","date":"2018-07-13T23:21:12.940+0000","up_votes":1,"down_votes":0,"body":"Me gustaria ayudar pero no uso a Cho ni lo tengo comprando y no soy muy fan de la estrella oscura. :C\r\n\r\nMe siento igual con las skins de los reyes, pero no suelo usar ninguno. \r\n\r\n{{sticker:sg-soraka}} \r\n\r\nY tampoco me matan. :c\r\n\r\nPuta vida.\r\n","replies":[]},{"poster":"Lautborz","date":"2018-08-09T09:01:48.624+0000","up_votes":0,"down_votes":0,"body":"Estas cosas pintan una sonrisa en mi rostro, por cierto, alguien sabe que enfermedad tiene Bryan?","replies":[]},{"poster":"Psychosphere","date":"2018-07-16T19:15:54.755+0000","up_votes":1,"down_votes":1,"body":"Ya compre el pack de 2500 RP y me parece una maravillosa skin y  excelente forma de ayudar a a la comunidad de cada región, pero como ponen un gesto tan  caro?\r\nSe les pasó la mano nuevamente  Riot. ","replies":[]},{"poster":"Hayato","date":"2018-07-15T21:26:01.439+0000","up_votes":3,"down_votes":3,"body":"Argentina ayuda a todos pero nadie ayuda a Argentina =(","replies":[]},{"poster":"DarkLucio","date":"2018-07-15T20:42:50.092+0000","up_votes":3,"down_votes":3,"body":"y argentina men donde esta?{{champion:78}} \r\n","replies":[]}]}