{"poster":"[NEM SIKERÜLT KIOLVASNI]","date":"2015-09-04T19:22:46.573+0000","title":"Whitelotus: \"Siento que puedo ofrecer más.\"","subforum":"Anuncios","up_votes":5,"down_votes":5,"body":"[ÜRES]","replies":[{"poster":"Stel Rose","date":"2015-09-04T20:48:34.630+0000","up_votes":100,"down_votes":15,"body":"Soy chilena, pero me molesta que digan que KLG es chileno. Tiene dos argentinos, como que chichichi lelele? y que gritan ahí regi y whitelotus? se quedan callados? de que estamos hablando, dejemos las banderas de lado en el lol por favor, ahora tenemos que estar unidos apoyandolos, no peleando por adueñarnos del éxito de un equipo, a quien el estado chileno... nada le ha dado","replies":[{"poster":"envoy dragons","date":"2015-09-04T21:26:47.419+0000","up_votes":32,"down_votes":7,"body":"se equivcan{{summoner:11}} , klg no es un equipo chileno, ellos lo han dicho, klg es un equipo latinoamericano chileno-argentino, no por nada tenen a 2 argentinos{{summoner:2}} ","replies":[]},{"poster":"TBP SoulReaver","date":"2015-09-04T21:41:13.830+0000","up_votes":13,"down_votes":22,"body":"amiga el colo colo es chileno pero juegan argentinos y no por eso es chileno y argentino","replies":[{"poster":"NickoMQN","date":"2015-09-04T22:58:14.416+0000","up_votes":7,"down_votes":6,"body":"***","replies":[{"poster":"darestok","date":"2015-09-04T23:00:18.799+0000","up_votes":18,"down_votes":7,"body":"Te equivocas KLG nacio en Chile y siempre ha estado aqui con jugadores Chilenos, en el ultimo tiempo han llegado extranjeros.","replies":[{"poster":"matiarchie","date":"2015-09-05T01:44:17.144+0000","up_votes":9,"down_votes":1,"body":"Si te fijas en Facebook, la persona creadora es un puertoriqueño, y es Kaos Lating Gamer y alberga distintos equipos buscando a los mejores jugadores de latinoamerica para formar grupos en distintos juegos, antes de hacer pseudo análisis de si tienen 3 chilenos y son 2 argentinos y esas pelotudeces. La final donde se hace? En Chile, por lo tanto el publico que va a presenciarlo de donde es? Donde tiene mas apoyo KLG? Eso hace referencia el CHI CHI CHI LE LE LE, no es por un simple hecho de que se tome como tal, que la persona que realiza la noticia o como quieras llamarle interprete que KLG es chileno es otro tema.","replies":[]},{"poster":"Siotranoqueda","date":"2015-09-05T00:38:37.869+0000","up_votes":11,"down_votes":3,"body":"Y porque el equipo no se llama Kaos Chilean Gamers? Mas allá de que la Gaming House este en Chile y siempre hayan jugado chilenos en el equipo, en el nombre afirman ser Latinos, y si no fuera así, no hubieran permito que jugadores de otra nacionalidad jueguen en él, no te parece? En el lol no se trata de países, se trata de comunidades, y ellos nos representan como latinoamerica, no a su país natal. Sino en cada país habría un servidor y ahí sería otra la historia.","replies":[]},{"poster":"Frank295","date":"2015-09-05T02:42:49.879+0000","up_votes":4,"down_votes":1,"body":"Además, como dijo matiarchie, el fundador es de Puerto Rico, y su Head Coach es alemán.","replies":[]}]}]},{"poster":"EvgeniaMedvedeva","date":"2015-09-04T22:45:36.433+0000","up_votes":7,"down_votes":4,"body":"pero colo colo no gritan Chi chi chi le le le xD\r\n","replies":[{"poster":"Your Waifu","date":"2015-09-04T23:06:05.645+0000","up_votes":12,"down_votes":5,"body":"Gritan: una moneitah pa ver al arbo campion {{champion:62}}  <3 <3","replies":[]}]},{"poster":"Marsohn","date":"2015-09-05T01:15:18.518+0000","up_votes":2,"down_votes":0,"body":"Colo Colo es un equipo chileno porque juega en la liga de fútbol de Chile. Son organizaciones diferentes. En el LoL que yo sepa no hay torneos OFICIALES por país, sino que son regionales. Por eso es que se supone que no son de X país. Hasta la misma organización de KLG dijo que no son un team chileno. Tampoco se lo tendría que llamar \"chileno-argentino\" porque sigue habiendo más personas dentro de KLG que son de otros países","replies":[]}]},{"poster":"Dyaebl","date":"2015-09-04T23:35:30.302+0000","up_votes":17,"down_votes":9,"body":"El equipo es chileno, porque tiene sede en chile\r\n\r\nFijate la mitad de los equipos de NA y EUW estan llenos de coreanos pero los equipos son del pais en el q esta la sede","replies":[{"poster":"martinpalaveci1","date":"2015-09-05T02:13:03.401+0000","up_votes":2,"down_votes":0,"body":"No, ellos mismos dijeron que son un equipo Latinoamericano chilenoargentino","replies":[]}]}]},{"poster":"Nherrera","date":"2015-09-04T20:24:46.238+0000","up_votes":23,"down_votes":7,"body":"Estoy orgulloso de que un equipo latinoamericano este a un paso de estar en el mundial , pero me apena la cantidad de jugadores chilenos que nos insultan a los argentinos por el simple echo de que ellos lograron estar en donde estan y nosotros no , sabiendo que el mejor jugador que tiene KLG es ARGENTINO !!{{champion:58}} ","replies":[{"poster":"Stel Rose","date":"2015-09-04T20:42:24.939+0000","up_votes":29,"down_votes":1,"body":"Ud. no escuche a gente de mierda, como es posible que cruzar una cordillera te de skill especial para el lol? Es gente weona, xenofobica y de mierda, que aprendio que la cancion nacional de chile es la mas bonita, que los peruanos nos quitan el trabajo, que bolivia se joda y que argentina es practicamente un enemigo. A todos esos patriotas de mierda, a los cuales por cierto su lindo pais les mete el pico en el ojo, que les arda el oyo que withelotus esta hechandose el equipo al hombro. Y a la gente normal como nosotros, enorgullescámonos por esos cabros que lo están dejando todo por llevar mas alto el nombre de latinoamerica, para mi klg es chileno-argentino, y la unica camiseta que usaria yo, tendría un rinoceronte ","replies":[{"poster":"Adox008","date":"2015-09-04T23:17:08.702+0000","up_votes":9,"down_votes":1,"body":"Pa mi klg es paraguayo y punto","replies":[]},{"poster":"TuKER0","date":"2015-09-05T10:58:21.113+0000","up_votes":2,"down_votes":0,"body":"LA MEJOR RESPUESTA QE LEI HASTA AHORA !\r\nSoy de argentina y pienso igual que vos, te felicito !\r\n","replies":[]},{"poster":"MadnesStheFalleN","date":"2015-09-04T23:49:21.568+0000","up_votes":2,"down_votes":0,"body":"Viva Chile Mierda !!!\r\n(para los que NO saben el sarcasco, es decir: \"Bien dicho Mierda\")\r\nPD: Si consigues la camiseta, manda el dato para comprarla :3 ","replies":[]},{"poster":"Crussader MLU","date":"2015-09-04T22:07:13.088+0000","up_votes":3,"down_votes":1,"body":"Estoy de acuerdo contigo, lo peor es que el mismo equipo trata de unirnos pero las disputas entre nosotros terminan provocando peleas tan tontas :/","replies":[]}]},{"poster":"darestok","date":"2015-09-04T20:33:48.625+0000","up_votes":6,"down_votes":18,"body":"KLG ya era el mejor equipo latinoamericano sin Whitelothus, Whitelothus antes de KLG solo tenia un buen nivel, KLG tiene los mejores jugadores en cada una de sus lineas y hacen su trabajo para proteger al adc o al mid que juega una composicion como un gragas o janna que lo protegen.","replies":[{"poster":"Stel Rose","date":"2015-09-04T20:45:36.699+0000","up_votes":19,"down_votes":2,"body":"y regi? regi los carreo en la fase de apertura, destacó mas en las  peleas de grupo que seiya en la final de apertura. Cual es el afan de chilenizar todo, KLG es la mejor representacion de que si los latinos dejamos los prejuicios que arrastramos desde décadas, podríamos formar algo grande, y llegar hasta donde queramos","replies":[{"poster":"II Zero II","date":"2015-09-04T21:59:17.444+0000","up_votes":4,"down_votes":5,"body":"KLG es un equipo chileno , es como decir que por tener a Messi Barcelona es español-argentino. Por otro lado no puedes hablar de \"CARREAR\" en un equipo de nivel competitivo. todos juegan como un solo equipo solido. nadie carrea a otro. Esta bien que latinoamerica apoye a KLG pero no deja de ser equipo chileno. Saludos ","replies":[{"poster":"Adox008","date":"2015-09-04T23:16:34.549+0000","up_votes":3,"down_votes":1,"body":"Verdad y a la vez no. Si Whithelotus carrea en KLG (que por lo poco que vi es cierto) es porque el equipo se adapta para que el los \"carree\"","replies":[]}]}]}]}]},{"poster":"LinusHendricus","date":"2015-09-04T20:20:18.655+0000","up_votes":4,"down_votes":57,"body":"A whitelotus lo adoptamos y ya sabe lo q es vivir en un país serio, en su tierra jamás habría desarrollado su potencial como jugador de LoL, lo mismo pasó con Messi, en Argentina ni siquiera habría llegado a ser profesional (se negaron a pagarle el tratamiento, luego el país que le negó ser profesional le exige títulos, lol). En fin, grande whitelotus y mañana la rompes.\r\nPD.: quédate a vivir en Chile, preguntale a Bielsa q se siente q un país te quiera de verdad!!!","replies":[{"poster":"Stel Rose","date":"2015-09-04T20:36:55.649+0000","up_votes":33,"down_votes":0,"body":"xDD pais serio? no jodas, ambos paises estamos cagados hasta el cogote de tanta corrupcion y robo. ","replies":[]},{"poster":"TreeCool","date":"2015-09-04T21:09:05.141+0000","up_votes":8,"down_votes":8,"body":"Chile no es mas ni menos serio que Argentina.\r\nYo noto siempre que escucho hablar a los chilenos, ( en comentarios como estos, por ejemplo) cierto aire de inferioridad, en el que todo el tiempo intentan resaltar o sobresalir de algun modo.\r\nSe piensan que son un pais mejor que cualquier otro de Latinoamerica, y la verdad es que en muchos aspectos, como en el desarrolo humano por ejemplo, estan muy lejos de serlo.\r\nNo sirve de nada tener una economia estable o productiva si la sociedad no avanza en el aspectos social.\r\nTe recomendaria que leas y te informes un poco antes de opinar y comparar Chile con Argentina.\r\nY los ejemplos de Messi Y Bielsa, simplemente me hicieron reir.\r\nEs hasta ironico que para hablar bien de Chile debas nombrar a dos Argentinos.\r\nPreguntale a Bielsa o a Messi que sienten por su pais, y jamas te dirian que Chile es mas serio o mejor que Chile, Basicamente porque los Argentinos amamos nuestro pais, con sus virtudes y defectos.\r\n Fuerza KLG!\r\nWhitelotus esta un paso mas alla! ","replies":[{"poster":"Naranja Azul","date":"2015-09-05T01:00:47.441+0000","up_votes":3,"down_votes":1,"body":"Mira yo te explico, y esto los chilenos no lo van a aceptar pero su cultura tiene un patriotismo muy falso, que les enseñan que son superiores a los demas. te lo digo yo que estudio historia y la cultura mapuche siempre fue asi. ","replies":[{"poster":"Blooxum","date":"2015-09-05T04:17:23.524+0000","up_votes":2,"down_votes":0,"body":"se llama annunakis wn es eso el problema la sociedad esta basada y construida en base a experimentos de adn de razas alienigenas con la nuestra \"animales\" los chilenos son como son y los argentinos son como son , tienen diferencia como todo pais asi que pen tu comentario xd\r\n","replies":[]}]},{"poster":"BoxBoxFanboy","date":"2015-09-04T22:04:35.514+0000","up_votes":3,"down_votes":1,"body":"I love you <3. Por alguien que habla con fundamentos!!! {{item:3434}}","replies":[]}]}]},{"poster":"GalaxyOne","date":"2015-09-04T19:47:07.546+0000","up_votes":39,"down_votes":35,"body":"Pff \"chi chi chi le le le\" pero nadie grita por argentina que bronca vieja..","replies":[{"poster":"Riot Cóndor","date":"2015-09-04T19:54:38.476+0000","up_votes":45,"down_votes":58,"body":"Esto es porque el evento es en Chile y la hinchada será principalmente chilena. Si lees el párrafo, creo que es un buen titular para comenzar el contenido del que habla.\r\n\r\nLo importante es hinchar todos por el equipo que nos representa.\r\n\r\nSaludos.","replies":[{"poster":"The Volts","date":"2015-09-04T20:33:49.163+0000","up_votes":30,"down_votes":4,"body":". NO VEMOS LOS PEQUEÑOS DETALLES que hacen grande las diferencias.\r\n**Muchas personas Viajaran a apoyar al team Latinoamericano. No solo estará la gente de Chile .**","replies":[]},{"poster":"Stel Rose","date":"2015-09-04T20:50:36.865+0000","up_votes":28,"down_votes":8,"body":"lo siento riot condor, pero es desubicado el titulo, sabiendo que hay tantos argentinos que hinchan de la misma manera por el equipo","replies":[{"poster":"Riot Cóndor","date":"2015-09-04T21:39:45.063+0000","up_votes":28,"down_votes":13,"body":"Hola Stel,\r\n\r\nNo me parece que sea desubicado cuando la intención del segmento de información hace referencia a cómo la mayoría del público, que es chileno y que hinchará por KLG, le puede representar una presión al equipo brasileño.\r\n\r\nY, como todos sabemos, el cántico de los chilenos es bastante reconocible, lo cual el autor (brasileño, dicho sea de paso) consideró una buena referencia para usarlo de título.\r\n\r\nDejemos de lado los prejuicios y no leamos cosas donde no existen, por favor.\r\n\r\nAbrazo de un argentino a otro.","replies":[{"poster":"Siotranoqueda","date":"2015-09-05T00:52:57.875+0000","up_votes":3,"down_votes":0,"body":"\"Riot Cóndor: Abrazo de un argentino a otro.\"\r\n\r\nElla reconoció ser Chilena en el primer comentario.. Epic Fail... jaja\r\n\r\nIgual yo pienso lo mismo, mas allá de que la Gaming House este en Chile, de que sus jugadores hayan sido siempre chilenos en el equipo, de que se haya fundado en chile el team, etc. Ellos son Kaos ***LATIN*** Gamers, y representan a Latinoamerica del Sur y también Norte, el lol es duelo de comunidades no de países. Sino habría un servidor en cada país y las reglas serian como en el fútbol.","replies":[]}]},{"poster":"NGreppi","date":"2015-09-04T21:25:05.685+0000","up_votes":12,"down_votes":2,"body":"ademas de jugadores argentinos en el team...","replies":[]}]}]}]},{"poster":"sensual flanders","date":"2015-09-04T20:33:14.478+0000","up_votes":10,"down_votes":2,"body":"solo vengo a  decir \r\n#vamos Mauricio Deportes Electronicos\r\n","replies":[]},{"poster":"I Am Nelson","date":"2015-09-04T19:48:02.934+0000","up_votes":13,"down_votes":6,"body":"\r\n#QUEVUELVAURF","replies":[{"poster":"NelsonTheMatoxD","date":"2015-09-04T19:51:53.123+0000","up_votes":5,"down_votes":1,"body":"Todo iba bien hasta que... {{summoner:3}} ","replies":[]},{"poster":"lordeman10","date":"2015-09-04T22:36:00.882+0000","up_votes":3,"down_votes":0,"body":"DRAAAAVEN","replies":[]},{"poster":"Frank295","date":"2015-09-05T03:11:36.299+0000","up_votes":1,"down_votes":0,"body":"NO POR FAVOR, LAS KATARINAS JODEN MUCHO EN NORMAL, NI ME LAS QUIERO IMAGINAR EN UN URF.","replies":[{"poster":"Zeradrac","date":"2015-09-05T22:09:27.676+0000","up_votes":2,"down_votes":0,"body":"se quedan atras por el cc, np :D","replies":[]}]}]},{"poster":"ScreaaM","date":"2015-09-04T23:47:31.859+0000","up_votes":5,"down_votes":0,"body":"Las mierdas que hay que leer... \"Whitelotus el mejor de KLG de argentina carreando chilenos\" \"Regi carreando chilenos\" Les recuerdo que es un equipo y que el trabajo silencioso de Bear, Julio y Helior es mas importante que simples estadísticas y Kills... y por supuesto que esta de más sacar las nacionalidades de los jugadores, es UN equipo, de latinoamerica sur, eso es lo que importa, que se hable de \"EL JUNGLA DE KLG\", \"EL ADC DE KLG\" no de \"JULIO CHILENO EL MEJOR DE LATAM\" o \"WHITELOTUS ARGENTINO CARREANDO CHILENOS CANCER\"... ","replies":[]},{"poster":"Pennevenoso","date":"2015-09-04T23:47:29.256+0000","up_votes":5,"down_votes":0,"body":"El Equipo es Chileno, osea, la entidad. Porque KLG nació en Chile y su Gaming House está en Chile... Pero lo importante ahora es que representa a toda Latinoamerica y hay que apoyarlo, y ojalá estén en el mundial. Los brasileños ya tuvieron un equipo ahi deberian dejarse perder {{item:3151}} ","replies":[]},{"poster":"xhideki","date":"2015-09-04T20:37:04.058+0000","up_votes":7,"down_votes":2,"body":"#GoKLG aguante lotoblanco vieja ","replies":[{"poster":"lordeman10","date":"2015-09-04T22:32:05.266+0000","up_votes":5,"down_votes":1,"body":"y su soporte OsoJudio","replies":[{"poster":"MurderDecoy","date":"2015-09-05T05:18:24.228+0000","up_votes":2,"down_votes":0,"body":"OsoJudio JAJAJAJJAJAJAJAJAJA {{summoner:3}} ","replies":[]}]},{"poster":"Diejin","date":"2015-09-05T00:22:21.169+0000","up_votes":2,"down_votes":0,"body":"Go loto blanco jugadores electrónicos latinos","replies":[]}]},{"poster":"LEosaurio","date":"2015-09-04T21:22:02.858+0000","up_votes":9,"down_votes":4,"body":"Hablan de dejar de lado la xenofobia y los mismos representantes latinoamericanos de RIOT incitan a la misma, encima con la cobardía de lanzar la piedra y esconder la mano.","replies":[]},{"poster":"Bulisiana","date":"2015-09-04T19:42:16.688+0000","up_votes":7,"down_votes":12,"body":"Bamos KLG se que se puede , Whitelotus ba a brillar y a deslumbrar en esta gran final .. mis mejores deseos.. fuerza Chikos !!!{{summoner:30}} ","replies":[]}]}