{"poster":"[NEM SIKERÜLT KIOLVASNI]","date":"2019-04-12T17:56:55.826+0000","title":"¡Vive la Final de la LLA en los cines!","subforum":"Anuncios","up_votes":3,"down_votes":0,"body":"[ÜRES]","replies":[{"poster":"Bruno Buccıarati","date":"2019-04-12T22:48:44.825+0000","up_votes":6,"down_votes":0,"body":"Saben que hay mas regiones a parte de Santiago cierto? jajajajaja","replies":[{"poster":"Riot Maggical","date":"2019-04-13T03:17:39.487+0000","up_votes":1,"down_votes":0,"body":"Por supuesto, de hecho hemos visitado Frutillar en el pasado con una Final por ejemplo. Lamentablemente nosotros no decidimos la disposición de las salas, pero sí nos sirven mucho estos comentarios para poder seguir haciendo esfuerzos a futuro y poder llevar estos eventos a más lugares en todo Latinoamérica, ¡gracias!","replies":[]}]},{"poster":"greyfox5001","date":"2019-04-13T00:26:28.047+0000","up_votes":4,"down_votes":1,"body":"Que beneficio me otorga ir a verlo en cine si no ofrecen merchandising??  Cuando me puedo quedar viéndolo en casa\r\nespero una respuesta coherente por favor.","replies":[{"poster":"Riot Maggical","date":"2019-04-13T03:18:52.487+0000","up_votes":1,"down_votes":0,"body":"Creemos que hay muchos otros factores más allá de merchandising que hacen que una experiencia en cine sea inolvidable, por ejemplo disfrutar con más fanáticos la partida, pantalla gigante, calidad de sonido y... ¡Palomitas! :)","replies":[{"poster":"Aedahn","date":"2019-04-13T14:01:29.178+0000","up_votes":3,"down_votes":0,"body":"Pero incluso en la LoLDay de Argentina regalan cosas sólo por ir, acá le erraron, porque yo estoy dudando en ir y sí tuviera una recompensa pues no me lo pensaría!","replies":[]},{"poster":"greyfox5001","date":"2019-04-15T21:17:04.067+0000","up_votes":1,"down_votes":0,"body":"si pero por ej de las palomitas las tengo que comprar yo tambien jajajajaja.\r\nosea no digo que este mal pero hubiera estado copado que al comprar esta entrada de cine hubiera alguna tienda con cosas relacionadas al lol para comprar por ejemplo gorros de rammus o teemo ,etc , no pido que regalen algo pero eventos como la lolday por ej te regalan cosas por haber asistido. ","replies":[]}]}]},{"poster":"JMCarrera","date":"2019-04-13T05:57:45.313+0000","up_votes":3,"down_votes":0,"body":"Soy de Valparaíso. Camino por la Avenida P. Montt (la más importante del puerto) y escucho hablar de LoL.  Varios de mis contactos son de acá. Hay cibers completamente dedicados a jugar LoL, en uno de ellos hay \"tarreos\" (toda la noche el primer sábado del mes) para ello, incluso pequeños campeonatos de equipos de fanáticos, varios de ellos diamantes, incluso challengers. Sé que en Viña del Mar también es grande la movida lolera.\r\nCreo que llenaríamos fácilmente una sala del Hoyts que está en P. Montt, porque somos cientos los fanáticos a morir del juego que marcó nuestras vidas.   Digo esto, para que alguien les diga a los de Hoyts que llenarían una sala, si lo anuncian.   Es cosa de comunicarlo por redes sociales, haciendo una preventa.\r\nNO pierden nada con intentarlo y toda la Quinta Región lo sabría y vendría, ya que ir a Stgo es algo que muchos no pueden costear, pero venir al puerto, sí. Lo digo incluso por los que viven en Quilpué y Villa Alemana, y que también gastan su buen dinero por jugarlo en un ciber con buena banda ancha.  Algo similar imagino que sería en Concepción, que también he jugado con algunos de por allá.\r\n¿Quién piensa lo mismo que yo? (Den like si es así)","replies":[{"poster":"Karøl Dance","date":"2019-04-14T17:32:38.807+0000","up_votes":1,"down_votes":0,"body":"RT♥ en p.montt se llenaria de 1 es una buenisima idea ","replies":[]},{"poster":"T1 Laiko","date":"2019-04-13T17:57:50.974+0000","up_votes":1,"down_votes":0,"body":"seria bueno que Hoyts de Valpo transmita la final :c o uno Viña","replies":[]}]},{"poster":"GA TeckLogico","date":"2019-04-12T22:53:09.612+0000","up_votes":3,"down_votes":0,"body":"Que garrón me llevo cada vez que entro ilusionado a estos post, si nunca hay nada \"cerca\" de mi ciudad.","replies":[{"poster":"Riot Maggical","date":"2019-04-13T03:20:09.952+0000","up_votes":1,"down_votes":0,"body":"Nos encantaría llegar a absolutamente todos lados, pero esas decisiones depende mucho de la disponibilidad técnica de las salas, las proyecciones de público y demás, temas que nuestros socios manejan mucho mejor y tenemos que confiar en ellos. Habiendo dicho esto, estos comentarios ayudan mucho a mostrar que hay más interés, ¡no dejen de publicarlos!","replies":[]},{"poster":"Haile Selassie I","date":"2019-04-13T02:23:49.477+0000","up_votes":1,"down_votes":0,"body":"de donde sos ?\r\n","replies":[{"poster":"GA TeckLogico","date":"2019-04-13T02:48:09.565+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Haile Selassie I,realm=LAS,application-id=9xRiuj3T,discussion-id=qVhPkJOY,comment-id=00020000,timestamp=2019-04-13T02:23:49.477+0000)\n>\n> de donde sos ?\n\nCipolletti, Rio Negro - Argentina :c","replies":[]}]}]},{"poster":"Foreveus","date":"2019-04-14T14:03:37.594+0000","up_votes":2,"down_votes":0,"body":"Para Argentina sólo se pudieron conseguir 3? Y 2 son para el mismo lugar?\r\n\r\nLos chilenos se están quejando de que no son sólo Santiago, pero en Argentina le erraron duro poniendo salas que están a más de una hora de la capital, aparte de que Pilar está demasiado lejos de lo que es CABA y GBA. Igual es normal que sea a modo de prueba poner pocas salas, pero hubiera sido más sensato (perdón por los que viven en Avellaneda y Pilar) buscar salas que queden por las zonas antes mencionadas ya que la mayor concentración de jugadores y habitantes está en esos lugares\r\n\r\nEspero para el clausura con los datos que puedan sacar de esto (que espero que sean muchos aunque poca fe le tengo por la lejanía) puedan poner más salas por la zona central de Buenos Aires. Por otra parte para las 22 provincias restantes pueden ofrecer bares para el evento, así como lo hacen de toda la vida con partidos importantes de fútbol, porque poner un cine para cada provincia no creo que los socios lo vean muy rentable tampoco, lo siento provincianos, bienvenidos al SXXI :dodo:","replies":[{"poster":"Foreveus","date":"2019-04-14T14:07:33.144+0000","up_votes":1,"down_votes":0,"body":"Y como extra, no estoy a favor de regalar códigos de skin como lo dijo un sujeto por ahí abajo, si vas a ver o querés ir a ver la final, es porque después de ese Bo5 de AK vs ISG quedaste con todo el hype de ver como se van a cagar a trompadas ahora R7 vs ISG","replies":[]}]},{"poster":"Shiba Inû","date":"2019-04-13T02:54:12.820+0000","up_votes":2,"down_votes":0,"body":"Como siempre los que somos de regiones nos chupamos el loli ","replies":[]},{"poster":"UziDelConurbano","date":"2019-04-12T20:06:24.251+0000","up_votes":1,"down_votes":0,"body":"Dios $310 mangos para ir al cine de pilar, que garron, tenia ganas de ir con mis amigos pero no tantas ganas ahora jaja","replies":[{"poster":"No Ward No Gank","date":"2019-04-13T00:09:05.565+0000","up_votes":2,"down_votes":0,"body":"310 no te alcanza ni para una Club House de McDonalds...","replies":[{"poster":"UziDelConurbano","date":"2019-04-15T18:43:15.735+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=No Ward No Gank,realm=LAS,application-id=9xRiuj3T,discussion-id=qVhPkJOY,comment-id=00000000,timestamp=2019-04-13T00:09:05.565+0000)\n>\n> 310 no te alcanza ni para una Club House de McDonalds...\n\nCon 310 me compro 2 combos grandes en BK. ¿Quien va al MC a gastar de mas? Encima son horribles las hamburguesas de ahi, no se justifica que valgan 2 veces mas. \nYo paso, quedate con tu combo del MC si queres.","replies":[{"poster":"No Ward No Gank","date":"2019-04-17T17:24:17.643+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Gav,realm=LAS,application-id=9xRiuj3T,discussion-id=qVhPkJOY,comment-id=000000000001,timestamp=2019-04-15T18:43:15.735+0000)\n>\n> Con 310 me compro 2 combos grandes en BK. ¿Quien va al MC a gastar de mas? Encima son horribles las hamburguesas de ahi, no se justifica que valgan 2 veces mas. \n> Yo paso, quedate con tu combo del MC si queres.\n\nMí comentario iba a que 300 pesos no son nada, no a que vayan a gastarlos al Mc. Es más, en ese sentido pienso como vos, entre los dos el mejor lejos es el BK. Las hamburguesas y papas del Mc parecen hervidas.","replies":[]}]},{"poster":"Foreveus","date":"2019-04-14T13:49:10.143+0000","up_votes":1,"down_votes":0,"body":"Ir a ver la final presencial de la Liga Master Fibertel cuesta $200","replies":[{"poster":"Padu","date":"2019-04-14T21:54:49.614+0000","up_votes":1,"down_votes":0,"body":"Y te regalan una skin, yo estaba dudando entre ir a la final de la lvp o a esto pero ese detalle, además del precio, me convencieron de ir a ver a la Lvp","replies":[]}]}]}]},{"poster":"1Aegis","date":"2019-04-12T23:07:28.530+0000","up_votes":2,"down_votes":0,"body":"Santiago no es Chile!","replies":[]},{"poster":"Genius982","date":"2019-04-17T00:17:59.602+0000","up_votes":1,"down_votes":0,"body":"entre a village pilar, no habia mas de 15 lugares comprados, cierro la pagina, abro un rato mas tarde para comprar y ya no me aparece la opcion de village pilar, en 2 horas compraron los 50? 60? lugares restantes? paso algo raro o que","replies":[]},{"poster":"  Rhapunzel  ","date":"2019-04-15T14:42:44.359+0000","up_votes":1,"down_votes":0,"body":"¿Se pueden comprar por internet las preventas? porque, no me aparece nada en la página de CineHoyts.","replies":[]},{"poster":"Nikkles","date":"2019-04-15T14:11:25.427+0000","up_votes":1,"down_votes":0,"body":"Como era de esperarse, Uruguay no aparece ni en figuritas.","replies":[]},{"poster":"Padu","date":"2019-04-14T21:51:45.609+0000","up_votes":1,"down_votes":0,"body":"Que paja, asistiría pero me quedan muy lejos esas salas. Ojalá hubieran optado por hoyts en Argentina también.","replies":[]},{"poster":"Lauthkz","date":"2019-04-14T21:16:52.502+0000","up_votes":1,"down_votes":0,"body":"Renta muchísimo más guardarse el valor de la entrada de esto para dentro de dos semanas. 0/10","replies":[]},{"poster":"TPX Jersohn","date":"2019-04-14T18:24:42.351+0000","up_votes":1,"down_votes":0,"body":"que y ahora no entregaran nada por la asistencia ya fue gg, mejor lo veo de mi casa, el año pasado que lo transmitieron en cine si tuvieron la intención de vender objetos referentes a lol pero lo cancelaron y ahora que no habrá nada sera peor la gente no quera ir","replies":[]},{"poster":"Zelos From Jonia","date":"2019-04-14T16:42:05.755+0000","up_votes":1,"down_votes":0,"body":"Dan tarjetas y codigos con la entrada? :D\n\nnice!","replies":[]},{"poster":"Yorsh","date":"2019-04-14T16:00:26.129+0000","up_votes":1,"down_votes":0,"body":"Jajajaja ojala la gente supiera que en Chile hay mas ciudades que Santiago, deberían traer la final al teatro del lago otra vez","replies":[]},{"poster":"bORDERLINNE","date":"2019-04-13T19:17:37.242+0000","up_votes":1,"down_votes":0,"body":"PFFFF, para variar todo en Santiago, uno que es de antofagasta y no llega ni mrd acá","replies":[]},{"poster":"T1 Laiko","date":"2019-04-13T18:01:51.776+0000","up_votes":1,"down_votes":0,"body":"ojala que para el clausura agreguen mas localidades, soy de Valpo y seria bueno ver la final acá en mi ciudad o en una mas cercana como Viña, igual gran idea tuvieron!! no creo que vaya al cine, pero estoy re hypeado con la Final, desde que anunciaron la unión me pareció una buena idea, mi equipo favorito que es AK no estará en la Final, pero ya quiero ver el R7 vs ISG","replies":[]},{"poster":"iNGENiO","date":"2019-04-13T12:42:32.420+0000","up_votes":1,"down_votes":0,"body":"Seria bueno que con la entrada te den alguna skin. Como hacen en los eventos presenciales.","replies":[]}]}