{"poster":"[NEM SIKERÜLT KIOLVASNI]","date":"2016-11-04T00:11:18.348+0000","title":"Orianna: El emblema del rey","subforum":"Anuncios","up_votes":0,"down_votes":0,"body":"[ÜRES]","replies":[{"poster":"Gran Tonina","date":"2016-11-04T18:49:39.890+0000","up_votes":12,"down_votes":12,"body":"Acaso soy el único o alguno más vió como Crown se soleaba a Faker en un versus? 1v1, Crown ganaba siempre, el tema es que Faker era clave para las TF, para mí que Crown, en ésa serie, jugó mejor que Faker, pero cuando era para hacer TF's, Faker se los soleaba.","replies":[{"poster":"Riot Maggical","date":"2016-11-04T21:07:51.909+0000","up_votes":23,"down_votes":3,"body":"Recuerda que este es un juego en equipo, no 1v1. Puede ser que Crown haya ganado varias peleas 1v1, pero el impacto que tuvo Faker para todo su equipo creo yo que fue mucho mayor.","replies":[{"poster":"Gran Tonina","date":"2016-11-06T03:29:24.858+0000","up_votes":3,"down_votes":3,"body":"\"1v1, Crown ganaba siempre, el tema es que Faker era clave para las TF, para mí que Crown, en ésa serie, jugó mejor que Faker, pero cuando era para hacer TF's, Faker se los soleaba.\"\r\nPor si alguno de olvidó de leer ésa parte...","replies":[{"poster":"La corrupción","date":"2016-11-06T22:17:34.160+0000","up_votes":2,"down_votes":1,"body":"Lo que vos no entendés es que si faker se los 'soleó' en las tf, no pudo haber sido crown el que mejor jugó de los dos.","replies":[{"poster":"Gran Tonina","date":"2016-11-07T02:24:31.173+0000","up_votes":2,"down_votes":1,"body":"Es en serio men? En las Tf generalmente es 5v5 (no siempre, obviamente), no era FakerVSamsung. Parece que hay gente que no comprende a que me refiero.","replies":[]}]},{"poster":"NewKoyka","date":"2016-11-06T06:01:06.569+0000","up_votes":2,"down_votes":1,"body":"la kill la kill dices tú? de qué te sirve la kill si en el farmeo te sacan 25 en los primeros 10min? si te tiran torre de mid al min 12 y le da 600 de gold? xD no es solo la tf man, es el metajuego...","replies":[{"poster":"Gran Tonina","date":"2016-11-06T18:23:30.632+0000","up_votes":2,"down_votes":3,"body":"Acaso tu leíste que yo puse que Crown le había ganado la línea? Cuando lo leas, vuelve a escribir tu comentario.","replies":[]}]}]}]},{"poster":"LoLGas5","date":"2016-11-05T02:03:35.222+0000","up_votes":6,"down_votes":0,"body":"Si pensas que el 1v1 es más importante que el juego en equipo, es un pensamiento bronce 5. Es una excusa bronce decir: \"perdimos pero no importa porque le gane a Faker en 1v1\" jaja\r\nEs un juego en equipo y hay que jugarlo como tal.","replies":[{"poster":"Master Chatruc","date":"2016-11-05T18:01:38.638+0000","up_votes":7,"down_votes":0,"body":"Si le llego a ganar a faker 1v1 no me importa nada como salga la partida jajaja","replies":[]}]},{"poster":"TheCrazyOld","date":"2016-11-08T12:31:22.304+0000","up_votes":2,"down_votes":0,"body":"Totalmente de acuerdo, Crown jugo mucho mejor mecánicamente el 1v1 contra Faker. Pero Faker tiene cosas que ganan partidas, como sacar solo un dragón ancestral con Oriana O.o tirar torres y torres, pushear pushear pushear, sin dudas uno de los jugadores mas inteligentes. Me quede con mucha bronca ver a Faker ganar solo la final del mundial y que nadie pueda hacer nada, es un robo. ","replies":[{"poster":"Gran Tonina","date":"2016-11-08T23:36:20.375+0000","up_votes":3,"down_votes":0,"body":"Gracias! Uno que entendió a la perfección a lo que me refería.","replies":[]}]},{"poster":"Lunari Red Mask","date":"2016-11-05T05:40:47.129+0000","up_votes":2,"down_votes":1,"body":"Por un minusculo error de Bengi a comienzos de partida, Crown saco ventaja de experiencia sobre Faker que poco después perdio junto con el partido. No considero que porque maten a Faker una vez, se tenga que coronar a alguién. Faker gana partidas, rompe torres, es una pieza importante de su equipo. Y sí lo matan, muchas veces gana el encuentro igual. No, Crown no es la gran cosa.","replies":[]},{"poster":"Crispontius","date":"2016-11-04T20:54:06.409+0000","up_votes":3,"down_votes":4,"body":"equivoca2","replies":[]}]},{"poster":"Swag sama","date":"2016-11-04T17:28:51.902+0000","up_votes":14,"down_votes":1,"body":"Imagínense a Faker con la nueva LeBlanc. CUIDADO CON EL BAITEOOOOO!","replies":[{"poster":"yo soyyoporqueno","date":"2016-11-08T23:52:34.664+0000","up_votes":2,"down_votes":0,"body":"PLZ de paso que su q mas pasiva hacen daño de rebote... ya veo esos ''2'' ganks al minuto 10 ","replies":[]}]},{"poster":"Enaner","date":"2016-11-04T18:30:23.158+0000","up_votes":11,"down_votes":2,"body":"No, la mejor Orianna que vi fue la de Toyz\r\n","replies":[{"poster":"Nicho","date":"2016-11-04T23:21:26.300+0000","up_votes":1,"down_votes":1,"body":"estamos muy de acuerdo, tambien había estaba ocelote","replies":[{"poster":"Enaner","date":"2016-11-08T18:26:32.221+0000","up_votes":2,"down_votes":0,"body":"Ocelote estaba inflado, el chabon lo unico bien que hacia era vender su imagen.\nNunca estubo dentro de los mejores mid de Europa.\n\nAlex Ich > Froggen > xPeke > Bjergsen (Y en esta epoca era nuevito).","replies":[{"poster":"Nicho","date":"2016-11-08T23:47:23.390+0000","up_votes":1,"down_votes":0,"body":"Froggen otra cosa mariposa.\nhablábamos de la orianna específicamente.","replies":[]}]}]},{"poster":"Virac","date":"2016-11-05T00:51:28.590+0000","up_votes":1,"down_votes":0,"body":"nadie dice que fue la mejor orianna, sino cual seria su \"main\" en los campeonatos.","replies":[{"poster":"Enaner","date":"2016-11-08T18:25:02.301+0000","up_votes":1,"down_votes":0,"body":"En todo caso seria Ryze.\nPero bueno, skin Orianna SKT.","replies":[]}]}]},{"poster":"ponchox123","date":"2016-11-05T16:32:09.160+0000","up_votes":7,"down_votes":0,"body":"Es mejor la Orianna de Toyz, ese man era una bestia. Que vuelvan esas partidas epicas donde no sabias que equipo iba a ganar y no que cuantas partidas le sacaran a SKT\r\n","replies":[{"poster":"Raúl","date":"2016-11-07T03:36:08.546+0000","up_votes":1,"down_votes":0,"body":"+1 a la segunda oración.","replies":[]}]},{"poster":"Lunari Red Mask","date":"2016-11-05T05:43:58.555+0000","up_votes":3,"down_votes":0,"body":"No, de nuevo los analistas estan mal, como cuando dijeron que Faker era numero 2 y luego tuvieron que retactarse. Esta muy claro para los que vemos los mundiales que Faker sobresale más y mejor con Ryze. Pasa que seguro el que escribio este articulo tiene conflicto con los creadores, al ser que Ryze esta representando a uno de los creadores, lo mismo se dirá de Tryndamere, al estar vinculado con uno de los creadores del juego, no lo van a vincular con ningún otro jugador de lol. Una lastima.","replies":[{"poster":"Liliths","date":"2016-11-06T08:19:15.362+0000","up_votes":1,"down_votes":0,"body":"Cuando dijieron que era el numero 2, fue  basado en datos, en numeros, promedios,  porcentajes, etc.  Eran los hechos. era por asi decir  \"el segundo jugador con las mejores estadisticas\"\r\n","replies":[{"poster":"Lunari Red Mask","date":"2016-11-10T23:19:57.314+0000","up_votes":1,"down_votes":0,"body":"error, se debio simplemente a que perdio aproposito el split de lkc","replies":[]}]},{"poster":"La corrupción","date":"2016-11-06T22:19:46.240+0000","up_votes":1,"down_votes":0,"body":"No pueden hablar del ryze de faker porque recibió un rework desde la época de 'baneenme faker o los cojo' y ahora sigue siendo 'baneenme faker o los cojo' pero lo jugó una sola vez, y no porque le haya ido bien es su mejor campeón. O tal vez sí, pero no pueden saberlo, y con  Orianna tienen más 'pruebas'.","replies":[]},{"poster":"RitoGueims","date":"2016-11-05T07:15:25.556+0000","up_votes":1,"down_votes":1,"body":"Considera que Faker a penas ha jugado en el mundial con Ryze 2016 despues del último rework, así como tampoco ha llegado a utilizarlo mucho en los general, a juego profesional prefieren dejarle despejada a Orianna en vez de liberarle a Ryze o Syndra. Esto, obviamente, hace que se le vea con ella una mayor cantidad de veces.\r\n\r\nEso y Orianna es más un espectáculo (Que es lo que finalmente vende), Ryze no es tan vistoso ni tan entretenido de ver como lo es una Orianna xD\r\n\r\nIgualmente, creo que estás tirando muy lejos la piedra al decir que es por conflictos personales con los creadores de los campeones, eso ya es exagerarla demasiado a mi parecer. (Aun así, estoy de acuerdo que uno piensa más en Ryze que en Orianna cuando se habla de Faker)","replies":[]}]},{"poster":"Cayit0","date":"2016-11-06T01:20:32.560+0000","up_votes":2,"down_votes":0,"body":"Resumen taringuero nivel 5 \"Los coreanos son robots\"","replies":[]},{"poster":"Hi Im BubbaKush","date":"2016-11-04T20:41:38.889+0000","up_votes":1,"down_votes":0,"body":"Un resumen nivel 5 pls xd","replies":[{"poster":"Lunari Red Mask","date":"2016-11-05T05:37:30.399+0000","up_votes":2,"down_votes":0,"body":"Se pretende vincular a Orianna con Faker como se vincula a Froggen con Anivia. Y el articulo esta lleno de alardes sobre como Faker es el mejor jugador de league of legends. Sin embargo a mi opinión, Ryze tiene más relación con Faker, todo el mundial pasado y  parte de este mundial me respaldan.","replies":[{"poster":"BiXe","date":"2016-11-05T18:15:30.984+0000","up_votes":2,"down_votes":0,"body":"SSG dijo, \"dejenle Ryze a Faker, que tan malo puede llegar a ser\"","replies":[]},{"poster":"Darksaroth","date":"2016-11-08T04:32:13.768+0000","up_votes":1,"down_votes":0,"body":"La verdad que cuando miras los números de Faker en competitivo es increible ver que hay con campeones que ha jugado 20 games y perdido 3 o 10 y perdido 1.... Habla mucho","replies":[]},{"poster":"Darksaroth","date":"2016-11-08T04:29:17.264+0000","up_votes":1,"down_votes":0,"body":"http://lol.esportswikis.com/wiki/Faker/Statistics Esto habla solo, ori la mas jugada, pero el winratio de ryze, bestial","replies":[]}]}]},{"poster":"Victim","date":"2016-11-04T18:35:36.945+0000","up_votes":2,"down_votes":0,"body":"Muy buen análisis :D","replies":[]},{"poster":"all hate teemo","date":"2016-11-10T14:50:24.249+0000","up_votes":1,"down_votes":0,"body":"pueden decir lo que quieran sobre el campeon mas iconico de faker, pero, al menos para mi, el icono, aquel campeon que se me viene a la mente cuando escucho que hablan del faker, es ryze, un campeon al que siempre uso, aun desde antes de su primer cambio","replies":[]},{"poster":"hShanpu","date":"2016-11-08T19:38:13.280+0000","up_votes":1,"down_votes":0,"body":"tl; dr: La skin no irá para Ahri :´c","replies":[]},{"poster":"Riksen","date":"2016-11-07T19:14:00.608+0000","up_votes":1,"down_votes":0,"body":"Encuentro que es triste que se haya puesto tanto esfuerzo y empeño en crear nuevos campeones, y también en mejorar los ya existentes, para que después cuando venga el mundial Riot haga cambios para que los pro players sigan usando los mismos 20 campeones de siempre. Me gustaría que en los mundiales de verdad se vea eso que predica tanto últimamente Riot de que quieren que todas las partidas se sientan distinto y que las composiciones de campeón sean todas distintas de acuerdo a las distintas situaciones, pero lamentablemente siempre terminan usando a Orianna, Alistar, Sivir, Rumble, etc. (campeones que vemos en todos los mundiales).","replies":[{"poster":"TSP Ano","date":"2016-11-08T19:12:40.345+0000","up_votes":1,"down_votes":0,"body":"Yo dije lo mismo y se me burlaron, el tema es que el juego normal y el competitivo son mundos distintos  quizas por eso solo se usan esos campeones","replies":[]}]},{"poster":"CrisDp ","date":"2016-11-06T22:01:08.023+0000","up_votes":1,"down_votes":0,"body":"Yo identifico mas a Faker con Ryze :D","replies":[]},{"poster":"YoRdix I99 HDD","date":"2016-11-05T15:20:05.070+0000","up_votes":1,"down_votes":0,"body":"me gustaria ver a Faker jugar de nuevo con zed en las profesionales\r\n:3\r\n","replies":[]},{"poster":"HoLyFloow","date":"2016-11-04T17:29:10.501+0000","up_votes":1,"down_votes":0,"body":":v","replies":[]},{"poster":"Reeves","date":"2016-11-08T18:48:53.141+0000","up_votes":1,"down_votes":1,"body":"Faker = LeBlanc. Igual es un lujo verlo jugar con cualquier campeón en las manos hace destrozos.","replies":[]},{"poster":"Chaphe","date":"2016-11-07T02:53:51.154+0000","up_votes":1,"down_votes":1,"body":"A mi cuando me dicen \"Faker\" pienso en Ryze y hay mucha gente que me respalda ","replies":[{"poster":"CA Wolf","date":"2016-11-07T20:25:50.884+0000","up_votes":1,"down_votes":1,"body":"Yo igual bro, te apoyo\r\n","replies":[]}]},{"poster":"Duath","date":"2016-11-07T03:20:46.563+0000","up_votes":1,"down_votes":1,"body":"Yo vi a faker Ganar con Viktor y no con Orianna","replies":[]}]}