{"poster":"[NEM SIKERÜLT KIOLVASNI]","date":"2015-04-10T23:39:28.917+0000","title":"La moral: un arma de doble filo","subforum":"Anuncios","up_votes":1,"down_votes":0,"body":"[ÜRES]","replies":[{"poster":"ELTerr0r","date":"2015-04-11T00:12:40.163+0000","up_votes":22,"down_votes":0,"body":"para subir la moral tienen que jugar a gangplank {{champion:41}} ","replies":[]},{"poster":"axl roses","date":"2015-04-11T00:58:28.284+0000","up_votes":5,"down_votes":3,"body":"***","replies":[{"poster":"kakapon","date":"2015-04-11T01:11:08.067+0000","up_votes":16,"down_votes":3,"body":"Que tiene que ver con ser marica? El inglés es el idioma universal y muy ligado al mundo de los videojuegos. No me parece que para mostrar orgullo de ser latinos se tengan que poner \"Jueguitos La Wea Aweonada\", \"Los Chabones Piola\" o \"Tacos y Enchiladas Superpoderosas\"","replies":[{"poster":"elfo sovietico","date":"2015-04-11T02:15:30.860+0000","up_votes":3,"down_votes":4,"body":"esos son los nombres mas chistosos originales y con orgullo lo llevaría aunque me cagen a puteadas por ser chileno argentino o mexicano peruano boliviano o lo que sea ","replies":[{"poster":"Latharas","date":"2015-04-11T04:39:25.775+0000","up_votes":5,"down_votes":2,"body":"tu razonamiento es realmente estupido, es un juego, es un nombre, nada mas no se trata de represetatividad. Se trata de estilo y marketing, aprende algo en el colegio que para eso vas","replies":[{"poster":"elfo sovietico","date":"2015-04-11T20:16:55.136+0000","up_votes":3,"down_votes":0,"body":"pero la idea es ser original y lo son bastante prefiero originalidad a simple plagio mi nombre de por si es original aunque no sea un elfo y menos soviético a lo que voy es que la mayoría tienen como ya se ha visto entonces si me das a elegir un nombre en ingles o español solo dependerá de la originalidad que este tenga","replies":[]}]}]},{"poster":"axl roses","date":"2015-04-11T01:39:40.268+0000","up_votes":2,"down_votes":2,"body":"Es una expresión, significa que suena como el orto ponerse un nombre en inglés siendo latino. Simplemente no da.\r\n Encima es un nombre, le podés poner lo que quieras que igual a la gente no tiene porque molestarle, es parte de tu identidad, ponerlo en inglés y que la mitad de los nombres terminen con \"gaming\" (que significa jugando, no me preocupes por qué), le quita diversión y originalidad, todos terminan siendo iguales al final, ¿dónde está la identidad?\r\n Es como si fueras a EEUU y te llamás Juán, pero te dijeran John, no mi nombre es Juán, soy bien latino. No te pido que pronuncies mi nombre perfecto, pero pronuncialo como es. \r\nAcá es lo mismo para mi, sólo es un nombre y es mi identidad, cuando yo me lo cambio al inglés pierdo esa identidad y la originalidad. Además, después se comunican entre ellos en español, osea si al espectador le llegase a molestar un nombre en inglés, imaginate que todo el juego hablen en español y tengan que subtitularlo xD.","replies":[{"poster":"Geo Stampede","date":"2015-04-11T12:47:22.764+0000","up_votes":3,"down_votes":2,"body":"Gaming no es jugando. Playing, es jugando (o reproduciendo, en lo que es música) Game no es un verbo. Game significa Juego, no jugar. Y por eso no se puede conjugar. \r\nAntes de hacerte el \"yo me la sé todas\", informate. \r\nEl que todos terminen en gaming, no resta identidad, adhiere identidad. Ya que significa que todos forman parte de la misma \"cultura\". Es como en los equipos de football (ah, perdón. Futbol. O Balonpié, sr. soy latino con orgullo), donde la gran mayoría termina en \"Football Club\" o \"FC\".\r\nAdemás, estás confundiendo \"Llamarme así hace tiempo y que lo traduzcan\" con \"Llamarme así de ahora en más porque así lo quiero\". Tomo como ejemplo cuando PEX fue a la WildCard (RIP Pex). El caster decía \"Mantarraya\", no \"Stingray\". \r\nCierro por acá. ","replies":[{"poster":"Joseelmax","date":"2015-04-11T14:49:29.099+0000","up_votes":3,"down_votes":0,"body":"Pero no te vengas a hacer el que sabes de inglés, que vos vas solo a las clases de inglés y seguro en tu vida viste una peli en ingles, mira, existe un vocabulario perfecto, real, o como le llames, palabras que estan en un diccionario avalado por la RAE, y en ingles por su debida academia, pero hay un diccionario que no esta escrito por una academia u organización, se llama \"Diccionario urbano\", contiene términos que no te enseñarian en una clase, porque son terminos \"\"incorrectos\"\" formalmente, como Gaming, u otros que por ejemplo uno que andaba buscando era que significaba \"berzerk\" o el verbo \"to go berzerk\", significa alocarse de cierto sentido, eso es algo que en ingles se utiliza, y no esta en ningun diccionario, \"gaming\" es una palabra adaptada, una palabra creada por la sociedad, y significa jugando, si, pero tambien significa lo mismo que significa sporting, no tiene traduccion literal, significa a que se dedica el equipo, tu ves sporting club y sabes que es de deportes, tu ves gaming club y sabes que es de videojuegos, y no es playing club, y lo de decir mantarraya y no stingray, eso es desición de quien castee, yo puedo decir \"Falsero\" o \"Farsante\", como puedo decir Faker, y como él es coreano puedo decir 위조자 (pronunc. wijoja -Traductorpls-) que no tiene traducción literal y significa \"Falsificador\", o \"Forger\".. un caster latino diria: -Y el Falsificador ha sido superado en juego por su adversario doble alzo-/////-And the faker was outplayed by his enemy Doublelift-... una cosa es lo correcto y otra es lo que se entiende... esta discusion no me interesa ni me incluye, pero entro porque soy cool.","replies":[]}]},{"poster":"Oldkraken","date":"2015-04-12T21:49:37.894+0000","up_votes":2,"down_votes":1,"body":"osea hipocresia al 100% no? leo la primera oracion de lo que escribiste y despues leo tu nombre \"axl roses\"","replies":[{"poster":"axl roses","date":"2015-04-28T00:26:24.645+0000","up_votes":1,"down_votes":0,"body":"Ya lo aclaré, leé mejor hace bien","replies":[]}]}]},{"poster":"Shijim4 de Virgo","date":"2015-04-11T15:20:23.111+0000","up_votes":1,"down_votes":0,"body":"que escribio? ya lo elimino y no lo puede leer :C","replies":[{"poster":"axl roses","date":"2015-04-28T00:35:31.121+0000","up_votes":1,"down_votes":0,"body":"Se pusieron como locas por un comentario que no le hace daño a nadie y me lo eliminaron. Pero que gente, libertad de expresión cero.","replies":[]}]},{"poster":"Fruta Madre","date":"2015-04-11T10:11:54.035+0000","up_votes":1,"down_votes":0,"body":"Permiso, me robo el de los tacos para mi equipo competitivo.","replies":[]}]},{"poster":"4ptxdPt474","date":"2015-04-11T05:41:05.436+0000","up_votes":2,"down_votes":7,"body":"Lo que pasa, es que nosotros los chilenos sabemos pronunciar bien el ingles e incluso hablar ingles.\r\n\r\nEn cambio los Argentinos No. Te doy un ejemplo: argentina no sabe pronunciar la palabra de la marca de pasta dental Colgate(Colgueit) Ustedes le dice tal y como esta escrito. y en varias cosas mas XD","replies":[{"poster":"Fruta Madre","date":"2015-04-11T11:31:17.943+0000","up_votes":5,"down_votes":0,"body":"Lo de Colgate no es no saber, es costumbre. Así se conoce la marca en Argentina. No tiene nada que ver con saber inglés. Alrededor del mundo las marcas se pronuncian de diferentes modos según cómo le resulta más fácil o atractivo a la gente.","replies":[]},{"poster":"Marshallgenius","date":"2015-04-11T13:11:09.562+0000","up_votes":1,"down_votes":0,"body":"Cualquiera puede pronunciar el ingles, Argentino, Chileno, Uruguayo, Boliviano, Salvadoreño el pais no afecta. Hay chilenos que hablan cerrado y hay argentinos que tambien..\r\n","replies":[]}]},{"poster":"Netoz","date":"2015-04-11T01:47:40.737+0000","up_votes":1,"down_votes":1,"body":"Axl roses ,nick bien latino","replies":[{"poster":"axl roses","date":"2015-04-11T01:52:52.933+0000","up_votes":2,"down_votes":0,"body":"Yo no represento a nadie ni tengo equipo, y es el nombre de un cantante, no de un animal, como \"león\" o un adjetivo como \"furioso\".","replies":[{"poster":"Netoz","date":"2015-04-11T01:56:21.544+0000","up_votes":2,"down_votes":0,"body":"Cada uno tiene su gusto , como a vos te gusta un cantante de EEUU, a ellos le gusta poner un nombre como si fuera de EEUU, asi de facil es ...y te digo GG izi ¿porque? porque nadie dice bien jugado que facil","replies":[{"poster":"ivancrgon","date":"2015-04-11T03:35:49.812+0000","up_votes":2,"down_votes":0,"body":"el gg es buen juego izi es easy mal escrito (facil) odio que digan eso aun si son de mi equipo prefiero el buen juego aun asi digo ty por thank you y np por no problem ","replies":[]},{"poster":"axl roses","date":"2015-04-11T02:40:51.256+0000","up_votes":3,"down_votes":1,"body":"Si algún día represento a Argentina, te juro que ahorro PI y me cambio el nombre a \"Pappo el Carpo\" o algo así, pero hasta entonces no veo razón para hacerlo, además de que cuesta un huevo juntarlo y soy muy rata para pagar por rp.","replies":[]},{"poster":"Netoz","date":"2015-04-11T03:03:29.101+0000","up_votes":1,"down_votes":0,"body":"Con  ese comentario que diste , no me queda nada que decir,para cuando lleges a challenger y representes a argentina nose en que año y si el lol sigue de moda y si sigo jugando quizás vea ese nick y me acuerde de vos. pero te deseo suerte , estas muy cerca.vos sos de los que piensan que van a llegar a ser profesional y vivir de esto.creo que estas mas cerca de challenger que de la realidad capo.","replies":[{"poster":"axl roses","date":"2015-04-28T00:31:06.803+0000","up_votes":1,"down_votes":0,"body":"Ojalá, pero no xD. Ya ni juego seguido y la comunidad me aburre, muchos tóxicos hay, con el poco tiempo con el que cuento últimamente ya no me dan ganas de jugar. Además, que soy bronce 2 xD.","replies":[]}]}]}]}]},{"poster":"TheDarkThunder","date":"2015-04-11T01:12:10.809+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=axl roses,realm=LAS,application-id=9xRiuj3T,discussion-id=jgFtH7TA,comment-id=0006,timestamp=2015-04-11T00:58:28.284+0000)\n>\n> Que nombre maricas que se ponen loco, cero orgullo por ser latinos tienen parece. No le podés poner a un equipo Kaos Latin Gamers y vivir en México y jugar una copa latinoamericana, no tenés cara.\n\nLo Mismo Pasa Con Furious Gaming ?)","replies":[]}]},{"poster":"JxCbn","date":"2015-04-11T00:23:19.832+0000","up_votes":18,"down_votes":9,"body":"***","replies":[{"poster":"AlphaNomas","date":"2015-04-11T00:51:41.631+0000","up_votes":4,"down_votes":6,"body":"Haber si nos preguntan de nuevo cuantas copas tenés (?)","replies":[{"poster":"Mr Blue","date":"2015-04-11T01:12:34.192+0000","up_votes":6,"down_votes":0,"body":"Espero que despues no se quejen de que somos los flammers {{item:3187}} ","replies":[]},{"poster":"rokushoger","date":"2015-04-11T12:46:02.119+0000","up_votes":4,"down_votes":0,"body":"Que ganas de armar bardo al santo botón. Lo único que te preguntaría (y soy Uruguayo no Argentino) es donde te enseñaron a escribir, por \"haber\" es el verbo, y lo que quisiste poner es \"A ver\".","replies":[]},{"poster":"TheDarkThunder","date":"2015-04-11T01:10:58.131+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=AlphaNomas,realm=LAS,application-id=9xRiuj3T,discussion-id=jgFtH7TA,comment-id=00050000,timestamp=2015-04-11T00:51:41.631+0000)\n>\n> Haber si nos preguntan de nuevo cuantas copas tenés (?)\n\nasjdlkasd Denunciado Lince","replies":[]}]},{"poster":"Netoz","date":"2015-04-11T01:11:44.833+0000","up_votes":5,"down_votes":8,"body":"***","replies":[{"poster":"ilnashoxx","date":"2015-04-11T01:21:09.984+0000","up_votes":2,"down_votes":0,"body":"Ojalá fuera cierto para hacerte sentir mejor, pero es eso, sin la ironía.","replies":[{"poster":"ivancrgon","date":"2015-04-11T03:31:36.498+0000","up_votes":3,"down_votes":3,"body":"***","replies":[{"poster":"Ceduu","date":"2015-04-11T05:48:53.756+0000","up_votes":4,"down_votes":0,"body":"\r\nPuff yo soy Argentino. Y en realidad se que toxicos hay en todos lados. Pero me da bronca que porque soy Argentino me insulten. Yo nunca insulte a nadie por ser de otro pais, me parece absurdo.","replies":[]},{"poster":"MendiKrim","date":"2015-04-11T04:53:52.038+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ivancrgon,realm=LAS,application-id=9xRiuj3T,discussion-id=jgFtH7TA,comment-id=0005000100000000,timestamp=2015-04-11T03:31:36.498+0000)\n>\n> el sujeto lo dijo con ironía, pero en realidad nunca he escuchado a un chileno decir seguro eres argentino y los argentinos siempre dicen de seguro eres un chileno, es un hecho ellos las comienzan, de que las seguimos es verdad las seguimos, pero ellos empiezan,\n\nTodos la empiezan, el principal problema es que nadie lo reconoce.","replies":[]}]}]}]}]},{"poster":"SrTryndamerKing","date":"2015-04-11T02:45:01.116+0000","up_votes":1,"down_votes":14,"body":"RITO SI NO QUIERE Q LA GENTE FLAME REGALA CAJAS O REGALA ICONOS COMO LOS 3 ICONOS QUE AMI ME DEBEN . PEOR BUENO EN DIA ASER UN CORCURSO POR TWITWER Y REGALAS 10 CAJAS POR DIA EL Q ESCRIBA MAS COMENTARIOS INPORTANTES SERIA UNA MUY BUENA RASON PARA QUE LA GENTE PARTICIPARA Y QUE SE HAGA JUEGO MÁS FAMOSO. QUISAS LA GENTE ESTE BIEN O QUISAS ASTA NO VEAN MI COMENTARIO PERO NO INPORTA. SOLO LO TENIA QUE DESIR YO QUIERO MIS ICONOS EL DE TEEMO ENMASCARADO  Y LA DE LOS 6 VS 6 PLIS RITO BENGO DISINEDO ESTO COMO ASE 1/2 AÑO = ES AÑO Y MEDIO","replies":[{"poster":"kakapon","date":"2015-04-11T03:55:09.698+0000","up_votes":8,"down_votes":1,"body":"Tu comentario hico que {{champion:86}} se pase a Noxus","replies":[{"poster":"Joseelmax","date":"2015-04-11T14:51:50.200+0000","up_votes":1,"down_votes":0,"body":"Tu hico hizo que {{champion:268}} sea londinense y no shurimano...","replies":[]}]},{"poster":"Nephrolépsis","date":"2015-04-11T03:17:11.359+0000","up_votes":5,"down_votes":0,"body":"Espero que esto sea una joda. {{item:3151}} ","replies":[]}]},{"poster":"D a r k  S e e r","date":"2015-04-11T15:26:57.690+0000","up_votes":2,"down_votes":0,"body":"nada mas inmoral que usar a teemo top {{champion:80}} {{item:3151}} ","replies":[{"poster":"CapitánBistec","date":"2015-04-12T18:25:19.044+0000","up_votes":1,"down_votes":0,"body":"Entonces no sé qué vas a pensar de que Revenant haya jugado Teemo Tiamat jungla...","replies":[]}]},{"poster":"Joseelmax","date":"2015-04-11T14:54:28.812+0000","up_votes":2,"down_votes":0,"body":"**¡KLG IS LOBE KLG IS LAIF!**\r\n\r\n¿Porque son urugayos? no, no lo son, son sudamericanos carajo arriba nuestra region vieja no me importa nada!!","replies":[]},{"poster":"UND Reddington","date":"2015-04-11T13:57:50.129+0000","up_votes":2,"down_votes":0,"body":"soy argentino y la verdad es que me da verguenza como se expresa mi gente un ejemplo es \" hoy juge una ranked y cuando mi jungla empezo a morir demasiadas veces nuestro adc le dijo ( Dios ya empezo a fedear este chileno puto) en verdad no entiendo porque insultan es una pena y nos dejan bastante mal a los que tratamos de tener un comportamiento sencillo y humilde.","replies":[{"poster":"Squealer","date":"2015-04-16T15:03:29.774+0000","up_votes":1,"down_votes":0,"body":"Yo no juego muy seguido, pero no me suelen tocar otros argentinos que insulten a los chilenos, y en general no pasa a mayores, aunque el otro día uno por haber tenido un error le dijo \"chileno puto\" y se la pasaron toda la partida contra bots discutiendo (sí, estaban flameando en una partida contra bots)","replies":[]}]},{"poster":"K4MIK4Z3","date":"2015-04-11T00:14:41.749+0000","up_votes":4,"down_votes":3,"body":"#GoKLG !!!","replies":[{"poster":"4ptxdPt474","date":"2015-04-11T05:42:15.375+0000","up_votes":2,"down_votes":0,"body":"LET`S GO TO THE TEATRO CAUPOLICAN","replies":[]}]},{"poster":"coloso10","date":"2015-04-11T14:45:29.322+0000","up_votes":1,"down_votes":0,"body":"Queridos amigos del lol Soy bronce 1 y estoy resignado ya a jugar este juego no se puede avanzar no se puede ganar soloq todas las partidas me toca una persona que no tiene idea lo que es este juego que feddean a mas no poder y me bajan la moral a 0 no se mas que hacer saludos comunidad! {{champion:122}} ","replies":[{"poster":"Arcadexx","date":"2015-07-31T10:39:17.941+0000","up_votes":1,"down_votes":0,"body":"por algo estas en bronce y por algo ellos tmb lo estan :v","replies":[]}]},{"poster":"Blood Snowy","date":"2015-04-11T18:23:08.585+0000","up_votes":1,"down_votes":0,"body":"{{item:3286}} ","replies":[]}]}