{"poster":"[NEM SIKERÜLT KIOLVASNI]","date":"2017-05-26T16:30:17.963+0000","title":"Cambios a la “residencia” y eligibilidad de peruanos en competitivo","subforum":"Anuncios","up_votes":2,"down_votes":3,"body":"[ÜRES]","replies":[{"poster":"Warwiick","date":"2017-05-28T00:29:19.603+0000","up_votes":1,"down_votes":1,"body":"hay gente en peru que no puede comprar rp ¿no podrían hacerlo gratis o a 1 de  PI?","replies":[{"poster":"Brunestud","date":"2017-05-29T19:26:29.063+0000","up_votes":2,"down_votes":0,"body":"No creo que haya alguna persona que tenga 0 RP...","replies":[{"poster":"TheRafael22","date":"2017-05-29T19:30:50.420+0000","up_votes":2,"down_votes":1,"body":"ahora ya no estan dando Rp como antes, bueno ami no me dieron, tuve que comprar , pero en caso de este, hay algunos menores que no tienen tarjeta y por eso pone eso.\r\n","replies":[{"poster":"Im Zoe Sorry","date":"2017-05-30T05:42:23.030+0000","up_votes":2,"down_votes":0,"body":"Van al soporte y les piden 1 RP, como cuando les faltan un par de RP para algun skin, les mandas un dibujo y listo.","replies":[]}]},{"poster":"PelaP","date":"2017-05-30T02:15:58.047+0000","up_votes":1,"down_votes":0,"body":"Saludos. mi cuenta es DarthTocino y si, yo tengo 0 RP desde que instalé el juego.","replies":[]}]}]},{"poster":"Inca Perú","date":"2017-05-26T19:17:49.567+0000","up_votes":3,"down_votes":1,"body":"Para los que usamos la compañía Claro en Perú en ping sigue siendo de 220 - 250 ms. Por lo tanto no transferimos las cuentas a LAS con la oferta de 1RP. Creo que deberían buscar una solución a ello primero antes de pretender involucrar a los peruanos en los cambios antes señalados, la comunidad en Perú es muy grande y esperamos una pronta solución para que la experiencia de jugar LoL sea cada vez mas divertida y gratificante, un fuerte abrazo y hasta pronto.  ","replies":[{"poster":"Riot Nebo","date":"2017-05-27T00:30:45.667+0000","up_votes":2,"down_votes":0,"body":"Estamos trabajando para que la latencia con Claro mejore. \r\nMuy pronto tendremos noticias al respecto.","replies":[{"poster":"UziDelConurbano","date":"2017-05-30T01:28:57.022+0000","up_votes":2,"down_votes":0,"body":"Tengo una pregunta acerca de Claro. Ya que estaban hablando de que pronto su ISP  se conectara a Riot Directo, me preguntaba si esta mejora también afectaría a los Argentinos que queremos usar Claro para jugar LoL? Mi ping con ellos(Claro) es realmente alto(150-300), y esperaba que haya la posibilidad de que con esto mejore algo. Un abrazo! ","replies":[]},{"poster":"Inca Perú","date":"2017-05-27T01:37:07.372+0000","up_votes":2,"down_votes":0,"body":"Es bueno saber eso, muchas gracias.","replies":[{"poster":"Teckmoh","date":"2017-05-29T01:05:43.349+0000","up_votes":1,"down_votes":0,"body":"Sep, raramente Claro tiene un gran problema con todos los juegos online,  aunq tenga contratado 16 mb  y 40 ms en el juego me bota un ping de 250 y nunca baja. Lo mismo en el Dota.\r\n ","replies":[{"poster":"Lordgiu","date":"2017-05-29T18:23:43.586+0000","up_votes":2,"down_votes":0,"body":"Afortunadamente Claro está tan interesado como nosotros en estar conectados, eso es MUY BUENO y los usuarios de Claro es algo de que estár orgulloso de su ISP, estamos esperando unos detalles y nos conectamos, falta poco :)","replies":[]},{"poster":"Zx Yumi xZ","date":"2017-05-31T17:01:10.484+0000","up_votes":1,"down_votes":0,"body":"ponte movistar xD te da 50ms :v , pero el server de las no agunta si abres youtube o otras paginas se sube el ms a 800\r\n","replies":[]},{"poster":"Awful Koala ","date":"2017-05-29T21:13:39.378+0000","up_votes":1,"down_votes":0,"body":"claro siempre tiene problemas con los ms xD tengo 37mb y juego con 25 ms pero cuando le baja la regla uff hasta con 1500 juego xD ","replies":[]}]}]},{"poster":"WarGun","date":"2017-05-30T16:02:21.878+0000","up_votes":1,"down_votes":0,"body":"Hola Riot Nebo, a lo que se refería mi compañero Inca Perú, es que varios usuarios de Claro no hicieron la transferencia por que el ping seguía alto, por este motivo, muchos de mis compañeros de equipo tampoco se han transferido. La duda es como se va a solucionar esto. Saludos :3","replies":[{"poster":"Zx Yumi xZ","date":"2017-05-31T17:02:56.848+0000","up_votes":1,"down_votes":0,"body":"mi opinión no se pasen lan es mejor que las ","replies":[]}]}]},{"poster":"The Steel Shadow","date":"2017-05-26T19:36:21.021+0000","up_votes":2,"down_votes":3,"body":"Man como te vas a poner ese nombre, soy peruano pero tan nacionalista? Buscas insultos creo","replies":[{"poster":"Neuville","date":"2017-05-26T22:02:12.192+0000","up_votes":1,"down_votes":0,"body":"Jaja me parece que no tenés algo resuelto. No tiene nada raro el nombre.","replies":[]},{"poster":"Inca Perú","date":"2017-05-26T21:43:46.262+0000","up_votes":1,"down_votes":0,"body":"Existe el /mute all mi estimado. ","replies":[]},{"poster":"Antonio","date":"2017-05-29T23:32:28.587+0000","up_votes":1,"down_votes":0,"body":"Me parece un buen nombre, yo soy de Uruguay!\r\nno me gusta nada eso de tratarnos mal entre nosotros en LAS o insultar a cualquier persona por su pais, por suerte hace muchísimo que no veo que se insulten en ese sentido, antes cuando jugaba en NA me pasaban insultando porque hablaba español :c\r\nputeen todo lo que quieran por fails o falta de ganks pero no por su procedencia, eso no tiene nada que ver con el juego.\r\nHonor para todos pero siempre, siempre, reporten a ese Yasuo feeder :@","replies":[]}]}]},{"poster":"PredatorS Gaming","date":"2017-05-26T18:11:56.692+0000","up_votes":3,"down_votes":1,"body":"Saludos , si bien es cierto que Perú es oficialmente LAS creo que deberían de cambiar la figura del mapa de los países en las opciones de transferencia de servidor , esto debido a que cuando llego la migración por 1 de rp, Perú parecía en LAN y a muchos de mi comunidad les trajo recelo o hasta confusión cuando salia la transferencia  LAS, creo que por ahí debemos de ser mas claros, un gusto hasta la proxima ","replies":[{"poster":"Riot Nebo","date":"2017-05-27T00:29:59.544+0000","up_votes":2,"down_votes":0,"body":"Hola PredatorS Ganing\r\n\r\nEsos iconos ya fueron cambiados hace varios días, de hecho te invito a que los revises de nuevo.\r\n\r\nIgualmente gracias por notarlo.\r\n\r\nUn abrazo ","replies":[{"poster":"D353RT0R","date":"2017-05-27T05:18:39.295+0000","up_votes":2,"down_votes":0,"body":"bro, como van con la empresa de claro, ya podremos jugar a 60 ms? los que somos de peru y andamos en LAS? ","replies":[{"poster":"Lordgiu","date":"2017-05-29T18:21:52.785+0000","up_votes":2,"down_votes":0,"body":"Buenass, venimos bien, tanto nosotros como Claro estamos ansiosos por llegar al día \"D\" y conectarnos, actualmente estamos esperando que nos dejen entrar unas cosas a Lima y estamos listos!! falta poco.","replies":[]}]}]}]},{"poster":"alexandercordova","date":"2017-05-28T00:32:44.464+0000","up_votes":2,"down_votes":0,"body":"Saludos, en la transferencia de Lan a Las, para jugadores de Perú a cambio de un RP, me resulta un gran problema, en Lan, el ping era de 180 y ahora me he dado con la sorpresa que esta a 280 de ping.  Tengo el servidor de internet de Claro. Y se me esta haciendo difícil jugar con este ping, porfavor me pueden dar una solución sin salir de Las.","replies":[{"poster":"osukaru sakki","date":"2017-05-29T15:44:29.114+0000","up_votes":1,"down_votes":0,"body":"si lees las publicaciones de hace 3 días atrás, te darás cuenta que dicen que ya están trabajando en ello ...","replies":[]}]},{"poster":"The Steel Shadow","date":"2017-05-26T19:35:04.026+0000","up_votes":2,"down_votes":0,"body":"Tengo que decirles que el ping en movistar està inestable estos dias, no se porque yo siempre tuve 41 ms en LAS y anteayer tenia un lag ENORME, gente arreglen el servidor y las colas FLEX siendo platino V en flex me ponen con PLATAS V en mi equipo, que es esto????","replies":[{"poster":"TheRafael22","date":"2017-05-29T19:31:40.676+0000","up_votes":1,"down_votes":0,"body":"Eso es tu elo.","replies":[]}]},{"poster":"Zx Yumi xZ","date":"2017-06-25T04:28:29.602+0000","up_votes":1,"down_votes":0,"body":"{{champion:266}} ","replies":[]},{"poster":"genisuf","date":"2017-05-31T16:48:51.320+0000","up_votes":1,"down_votes":0,"body":"Es \"ELEGIBILIDAD\", no \"ELIGIBILIDAD\". Media pila con la redacción, entré solo porque me hizo mal leer esa palabra en el cliente del LoL","replies":[]},{"poster":"OERLIKOM","date":"2017-05-31T11:24:13.954+0000","up_votes":1,"down_votes":0,"body":"yo me pase de lan a las y no soy peruano porque me meten en la misma bolsa?","replies":[]},{"poster":"DialFforFun","date":"2017-05-31T06:07:26.767+0000","up_votes":1,"down_votes":0,"body":"Amigos de Riot, será posible que vuelvan a poner la oferta de 1 RP para pasarnos a LAS los peruanos, ya que es increible la latencia que tiene uno en LAN a pesar de que hace mucho tiempo la latencia siempre era de 70 ms o por alli? Que paso? :( Porfavor vuelvan a poner la de 1 RP para pasarnos :)","replies":[]},{"poster":"Tavortex","date":"2017-05-30T22:56:30.717+0000","up_votes":1,"down_votes":0,"body":"dicen que los peruanos son buenos en lol ojala me saquen de b1 :v jaja salu2","replies":[]},{"poster":"Seb3465","date":"2017-05-30T20:35:36.239+0000","up_votes":1,"down_votes":0,"body":"Hola,tengo una duda, para los que no les alcanzó el tiempo de cambiarse a Las o no se cambiaron por la conexión que tenia claro, tendrán una oportunidad?","replies":[]},{"poster":"I Wanna Rock","date":"2017-05-30T01:15:14.594+0000","up_votes":1,"down_votes":0,"body":"\"Chileno Roto\" it's Coming!!! ","replies":[{"poster":"WarGun","date":"2017-05-30T16:07:08.141+0000","up_votes":1,"down_votes":0,"body":"El pisco es nuestro :v (Peruano)","replies":[]}]},{"poster":"Rex Corvus","date":"2017-05-30T13:05:06.406+0000","up_votes":1,"down_votes":0,"body":"y con la gente que trabaja? no soy universitario porque tengo que trabajar, no habra comunidades como la de Ulol para los trabajadores?\r\n","replies":[]},{"poster":"WILLEXTERLOL","date":"2017-05-30T02:38:19.856+0000","up_votes":1,"down_votes":0,"body":"A VER, de primeras \r\nsiempre e jugado en las y soy de Perú pero la semana pasado los ms me subian hasta los 900 hasta incluso 1400 ms eso es algo que nunca me habia pasado y comenzo desde la semana pasada esa sabuda de ms .Asi que eso de que en Perú se juega a 60ms es una mentira porque la semana pasada me dio un subidon de ms lo cual nunca me a pasado en la vida Soy de Perú y siempre jugado en las -.- primera ves que me da subidones asi de fuerte ","replies":[{"poster":"WILLEXTERLOL","date":"2017-05-30T02:55:40.505+0000","up_votes":1,"down_votes":0,"body":"y ademas sigue el problema de subidones de ms","replies":[]}]},{"poster":"Dovakhiin0301","date":"2017-05-30T02:14:53.193+0000","up_votes":1,"down_votes":0,"body":"Riot, ¿no podrían intentar mejorar la conexión en Bolivia? por un tiempo estuvimos con 70 de ms y ahora estamos en 131 de ms ","replies":[]},{"poster":"Benny B0yz","date":"2017-05-30T01:22:42.275+0000","up_votes":1,"down_votes":0,"body":"Soy de Argentina y No tengo nada en contra de nadie, lo que pasa es que desde que se mudaron los peruanos a las he tenido picos de lag mucho mas seguidos que antes. Van a mejorar el servidor para nosotros que ya estábamos en LAS? \r\nSaludos","replies":[]},{"poster":"Friedrinietzsche","date":"2017-05-30T00:40:13.521+0000","up_votes":1,"down_votes":0,"body":"Quiero saber si va haber esa posibilidad de nuevo para trasladarse para LAS  con 1 rp  , no tuve esa suerte de enterarme a tiempo.","replies":[]},{"poster":"KuroiOokami","date":"2017-05-29T23:55:31.808+0000","up_votes":1,"down_votes":0,"body":"SI he visto que el MS en LAS ha bajado desde que hicieron esto hace 1 mes antes de que hicieran esto fui a LAS y tenia 200ms+  con la pasada de Lan a Las mia se noto el bajon de MS pero ojala que pudieran mejorar mas por que aun asi se tiene un ms alto","replies":[]},{"poster":"parrazo","date":"2017-05-29T23:10:35.273+0000","up_votes":1,"down_votes":0,"body":"Dejen de flammear a los amigos de Perú, a uds tampoco les gustaría que los traten asi, de hecho que Perú sea parte de LAS significa que mayor cantidad de jugadores puden hacer mejor el servidor, porfavor sean conscientes, saludos","replies":[]},{"poster":"Zx Yumi xZ","date":"2017-05-29T21:19:32.579+0000","up_votes":1,"down_votes":0,"body":"riot porque movieron el servidor de lan  yo soy peruano y siempre eh jugado lol desde la s1, depues que salio lan me pase antes tenia 65 ms y ahora 130 ms aun sigo jugando en lan ,  me eh creado esta cuenta para jugar en las pero ya con varias partidas eh visto que la gente insulta mucho a los peruanos y a casi todos, en lan me sentia mas comodo pero con el ms un poco algo ya no es lo mismo , volverán el servidor donde estaba ? gracias\r\n ","replies":[]},{"poster":"CatalinaBMTH","date":"2017-05-29T21:16:24.239+0000","up_votes":1,"down_votes":0,"body":"porque no puedo recargarme rp? al pasarme de lan a las me salia un error \r\n\r\n","replies":[]},{"poster":"SaveMeOh","date":"2017-05-29T21:04:02.996+0000","up_votes":1,"down_votes":0,"body":"ojalá se solucionen pronto los problemas a nuestros compañeros Peruanos, Saludos!! ","replies":[]},{"poster":"Armadillow","date":"2017-05-29T20:55:44.737+0000","up_votes":1,"down_votes":0,"body":"Resumen?","replies":[]},{"poster":"DanielxMac","date":"2017-05-26T21:36:11.106+0000","up_votes":1,"down_votes":0,"body":"Que grandes la gente de riot Las que se preocupan por que los jugadores tengan los ms bajos,  vengo de Lan y alla creo que a los de riot Lan les da igual como jueguen las personas.  Ojala se pongan las pilas ya que si bien es cierto el nivel no varia tanto, si lo hace la gente, ademas que alla hice amigos desde que estaba en bronce IV en la s4","replies":[]},{"poster":"EIIa No Te Ama","date":"2017-05-26T19:08:36.008+0000","up_votes":3,"down_votes":5,"body":"5 años en lol y no salgo de bronza 5 , pero juego como challenger ","replies":[]}]}