{"poster":"[NEM SIKERÜLT KIOLVASNI]","date":"2019-08-07T20:00:04.869+0000","title":"Más opciones para obtener RP: Riot Access","subforum":"Anuncios","up_votes":0,"down_votes":1,"body":"[ÜRES]","replies":[{"poster":"Hnk Kenshiro","date":"2019-08-07T20:17:10.278+0000","up_votes":27,"down_votes":1,"body":"Riot tormenta, ¿Es muy difícil que las mismas opciones de compra que ofrecen a terceros las podamos encontrar en el cliente?\n\nSiempre me pareció mala idea que solo nos permitan comprar de entre 6 opciones, montos que si bien se acercan a lo que compraría uno, siempre nos sobra o nos falta.\n\nLo realmente ideal seria poder comprar justo el Rp el que quisiéramos, que nosotros digamos \"Necesito 1007Rp\" y nos valorice eso, que ofrezcan rebajas por montos más grandes o pack promocionarles (Tipo que directamente las recargas tengan gemas u otros) seria la alternativa a ventas más grandes, pero \n¿Se ha discutido alguna vez implentar algo así?\n\nGracias.","replies":[{"poster":"Naranjú","date":"2019-08-07T21:09:45.687+0000","up_votes":6,"down_votes":0,"body":"Es dificil que te permitan hacer eso, es una cuestion de marketing y los precios estan justamente hechos para que siempre te sobre o te falte, el porqué no sabría decirte, tal vez alguien mejor informado que yo o con mejor memoria pueda ampliarte el tema mejor.","replies":[{"poster":"Desaroll","date":"2019-08-07T23:27:48.937+0000","up_votes":7,"down_votes":1,"body":"Si te sobra -> Te falta menos para comprarte otro skin -> Incentivo para la siguiente compra.\r\n\r\nSi te falta con X paquete -> Compras un paquete más grande -> Te sobra -> te falta menos para comprarte otro skin -> Incentivo para la siguiente compra.","replies":[]}]},{"poster":"FaZe ffL","date":"2019-08-07T22:42:11.263+0000","up_votes":2,"down_votes":0,"body":"Hasta ahora el único juego online donde vi que implementen eso es el ARGENMU. Si mal no recuerdo era 1 peso (arg) = 1 argenpoint. Te servía para comprarte sets etc.\r\nLo veo muy utópico implementar eso con Riot.","replies":[{"poster":"Axel VIII","date":"2019-08-07T23:52:47.690+0000","up_votes":1,"down_votes":0,"body":"Argenmu es un servidor creado por argentinos con el juego base de mu, no tiene servidores aparte que en Argentina :s es obvio que pueden hacer eso ya que lo unico que tienen que pagar es una pc para mantener las cuentas y el server vivo","replies":[{"poster":"FaZe ffL","date":"2019-08-08T16:51:25.663+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Axel VIII,realm=LAS,application-id=9xRiuj3T,discussion-id=ft4v9mYd,comment-id=000000020000,timestamp=2019-08-07T23:52:47.690+0000)\n>\n> Argenmu es un servidor creado por argentinos con el juego base de mu, no tiene servidores aparte que en Argentina :s es obvio que pueden hacer eso ya que lo unico que tienen que pagar es una pc para mantener las cuentas y el server vivo\n\npor algo dije que sería utópico. no hay forma de hacer conversión de esa forma y que les deje ganancias a ellos.","replies":[{"poster":"Bare2003","date":"2019-11-06T15:09:34.072+0000","up_votes":1,"down_votes":1,"body":"Seria mas bien Distopico(Un futuro peor al actual)\r\n","replies":[]}]}]}]},{"poster":"US iWhy","date":"2019-08-07T20:35:55.941+0000","up_votes":1,"down_votes":0,"body":"x2","replies":[]}]},{"poster":"I Ceo I","date":"2019-08-07T21:18:32.033+0000","up_votes":10,"down_votes":0,"body":"Lo que cobran eso... casi AR$1000 más de lo que realmente cuesta (pagando el iva). Es un robo lo que hacen algunos... Y Riot no es capaz de controlar ni siquiera eso... patético.","replies":[]},{"poster":"FaZe ffL","date":"2019-08-07T22:40:14.057+0000","up_votes":5,"down_votes":0,"body":"Parece una cargada. Es aún MÁS caro comprarlos por esos puntos... pero bueno alguna ganancia tienen que sacar ¿no?","replies":[]},{"poster":"Mascheranox","date":"2019-08-07T20:22:25.199+0000","up_votes":5,"down_votes":0,"body":"Para cuando ofertas de RP ?","replies":[]},{"poster":"Uzi","date":"2019-08-08T06:42:57.800+0000","up_votes":4,"down_votes":0,"body":"En mercadolibre.ar hay gente de parter oficial re vendiendo códigos oficies de riot . Entre sus aclaraciones *Contamos con stock ilimitado* ustedes estan al tanto de a quienes les dan los rp para ser sorteados y no revendidos! ? ","replies":[]},{"poster":"SłrąłøsPąndą","date":"2019-08-07T21:41:04.220+0000","up_votes":4,"down_votes":0,"body":"osea mas empresas que nos roban? GANO dota2 chicos, suerte la proxima","replies":[]},{"poster":"Pollo al Ornno","date":"2019-08-07T22:23:29.975+0000","up_votes":3,"down_votes":0,"body":"Bueno a ver, revise todas las disponibles en ARG y literalmente son MAS CARAS, o sea, no es rentable comprarlo mediante esas paginas, es mas barato comparlas por el cliente.\r\n\r\nPero la opcion no viene mal, aunque como ya saben, el precio del RP es impagable hoy en dia asi que gg.","replies":[]},{"poster":"talfire","date":"2019-08-08T03:46:55.095+0000","up_votes":2,"down_votes":0,"body":"hasta ahora son mas caros comprarlos a terceros.\r\n\r\nme gustaria comprar algunos RP para revender en mi tienda pero por lo que veo los venden muy caros que no dejan margen de ganancia que no vela la pena.","replies":[{"poster":"VampiroMedicado","date":"2019-11-30T18:17:01.491+0000","up_votes":1,"down_votes":0,"body":"Tarde pero a cuanto te lo venden?","replies":[]}]},{"poster":"Axel VIII","date":"2019-08-07T23:56:05.451+0000","up_votes":2,"down_votes":0,"body":"Ya que todos se quejan de los precios en Argentina, por que no hacen la gran steam que cada país tiene sus precios en juegos (seria en RP para lolcito) cosa que no sean 10 dolares para todos los países cuando el dolar esta mas caro en unos que en otros y que para poder cambiar la moneda tenes que estar en ese país mismo para que los demás jugadores de otros países no se puedan aprovechar cambiando la moneda y pagar menos por el RP?\r\n","replies":[{"poster":"RikiFsn","date":"2019-08-10T03:42:08.394+0000","up_votes":1,"down_votes":0,"body":"En Argentina ya estaba en pesos y según ellos lo pusieron en dólares porque se pasaba gente de otro server a comprar RP , solución? Evitar que se puedan pasar luego de comprar RP, pero no. Prefirieron poner todo en dólares porque es negocio redondo","replies":[]}]},{"poster":"E n b e r  l m l","date":"2019-12-01T01:03:47.210+0000","up_votes":1,"down_votes":0,"body":"deberían agregar la opción de comprar rp mediante saldo de llamada de teléfono, y deberían bajarle al RP, los argentinos boludos fracasados, no pueden comprar RP, no se porque aumentan el rp, si el game esta lleno de bajones de fps, y lagg y otros problemas ademas, deberían estar al tanto, si es que son una gran empresa de juegos. no agregen mas skin, no mas aumento de RP, no mas actualizaciones, no mas campeones, no mas necesidad de comprarse un pc caro para tener ventaja de reacción en el juego, ya basta de esto riot, preocúpense de optimizar el juego... ya lo unico que se juega es TFT, por que no se necesita cargar datos pesados. Se nota mucho que no venden como antes en el game de PC, lo dejaron tirado en sentido de juego, ya ni arreglan, solo agregan mas y mas basura,para ganar algo , les va tan mal que tuvieron que irse a movil, donde es el mercado mas grande de juegos hasta ahora, es tan notorio que no se mantendran las skin para el del celular, tendremos que comprar las mismas skin, en el mismo servidor, en el mismo juego pero diferente plataforma... es tan evidente... que ya solo buscan dinero y ya no piensan en los gamers de verdad, los que llegan del trabajo o del estudio, y los que quieren disfrutar un juego decente sin estrés... ni te digo si uno quiere hacer streamer, debes tener una net sobre 30 mb para andar sin problemas y un pc que aguante... ya ni se menciona el tema de emparejamiento, las flex siempre son asquerosas, siempre hay uno abusando del otro porque el emparejamiento es una mierda total, siempre uno muere como 10 veces antes del 15.... dejen de agregar mas contenido al juego, que al final no es jugable para la mayoria.... todos no tienen una pc gamer ni una pantalla de 144 hz.... entiendan... la mayoria no ganamos dinero jugando.. la unica forma de ganar dinero es el elo boost, cosa que esta penalizado y eso es justificado, porque aparecen en los emparejamientos gran maestros que no cambian la baratija al 9... cosa que en facebook,twitter hay demasiadas paginas de ello, y los que tienen dinero, y ni aman el juego, disfrutan son de liga alta... en resumen básicamente todo se basa en dinero... es el resumen... ganar 10 veces de lo necesario...","replies":[]},{"poster":"Tr0ublemaker","date":"2019-11-30T22:04:50.092+0000","up_votes":1,"down_votes":0,"body":"justo te quitan una opción de pago con débito ademas del alza en el dolar jajaja que conveniente ¬¬\r\n{{sticker:sg-lux-2}} ","replies":[]},{"poster":"Casterki","date":"2019-11-30T18:37:47.653+0000","up_votes":1,"down_votes":0,"body":"Puedo ser revendedor?","replies":[]},{"poster":"Uzi","date":"2019-08-11T01:33:13.000+0000","up_votes":1,"down_votes":0,"body":"No hay una tienda exclusiva para las  para comprar en ARGENTINA?  cyber cafe? Yenny-El Ateneo? vorterix rock? ","replies":[]},{"poster":"DoomBring3r","date":"2019-08-08T02:46:54.751+0000","up_votes":1,"down_votes":0,"body":"Riot Bolivia también existe! estamos en la mitad de Latino América en nada de lo que hacen nosotros estamos incluidos ","replies":[{"poster":"RikiFsn","date":"2019-08-10T03:43:14.737+0000","up_votes":1,"down_votes":0,"body":"Igual que Uruguay, riot descuida mucho ciertos países","replies":[]}]},{"poster":"T1 Frizze ","date":"2019-08-08T18:28:50.402+0000","up_votes":1,"down_votes":0,"body":"y mis BarbaPoints? donde estan?","replies":[]},{"poster":"Sarraurpple","date":"2019-08-08T15:12:21.782+0000","up_votes":1,"down_votes":0,"body":"Para cuando empiezan a aceptar Bitcoin?","replies":[]},{"poster":"AMD Radeon RDNA","date":"2019-08-08T03:58:41.225+0000","up_votes":1,"down_votes":0,"body":"Me gustaria trabajar vendiendo RP jajaja","replies":[]},{"poster":"Martin75","date":"2019-08-08T00:30:44.867+0000","up_votes":1,"down_votes":0,"body":"sigan subiendo el rp, que les voy a comprar, jeje","replies":[]},{"poster":"MILFortune","date":"2019-08-07T20:46:49.403+0000","up_votes":1,"down_votes":0,"body":"> \n> Si ya has redimido el código en uno de los dos servidores, NO podrás volverlo a redimir en el otro servidor.\n> \n\nhttps://i.imgur.com/qZcIzyY.jpg","replies":[]},{"poster":"Blue Points","date":"2019-08-08T04:10:08.409+0000","up_votes":1,"down_votes":3,"body":"awwwww yeah, diamantes (lo siento no pude contenerme{{summoner:31}} )","replies":[]}]}