{"poster":"[NEM SIKERÜLT KIOLVASNI]","date":"2018-02-14T12:53:57.428+0000","title":"Caos: bullying, suplencias y perseverancia","subforum":"Anuncios","up_votes":2,"down_votes":1,"body":"[ÜRES]","replies":[{"poster":"Riot SauruS","date":"2018-02-15T17:54:56.642+0000","up_votes":24,"down_votes":5,"body":"El bullying considera tanto el acoso físico como el psicológico, se da de forma continua y deliberada. Generalmente se da entre compañeros de clase pero puede ir más allá. Lo importante es identificarlo, ya que en ocasiones la persona que lo padece no es capaz de reaccionar ante aquellas situaciones y detenerlas a tiempo. Por ello, también es importante que si presencias una situación de este tipo hacia alguna persona debes actuar para detenerlo. El apoyo de la familia es escencial para estos casos, nunca duden en acercarse a su circulo de confianza para pedir ayuda.\r\n\r\n {{summoner:21}} ","replies":[]},{"poster":"Sona Majestuosa","date":"2018-02-15T17:25:05.257+0000","up_votes":11,"down_votes":3,"body":"Clave el pibee groso total de pasar bullying a jugador profesional un groso total, mis respeto","replies":[]},{"poster":"Jujeño Promedio","date":"2018-02-15T21:19:43.985+0000","up_votes":10,"down_votes":3,"body":"Me parece una bonita y tragica historia la de Caos superando sus miedos antes y ahora triunfando en lo mas alto hermosa historia y fuerza Caos {{sticker:slayer-pantheon-thumbs}} {{summoner:21}} ","replies":[]},{"poster":"munasquechai","date":"2018-02-15T17:28:27.657+0000","up_votes":8,"down_votes":3,"body":"hubo un comentario sobre que el bullying es para maricones, no es asi estimado, abecés el bullying no es solamente físico si no lo contrario, es un acoso temporal y se ve casi infinito por el afectado, llegas a sentir desesperación por no poder hacer nada frente a esopero con el paso del tiempo y cambio de  caminos.. te das cuenta de que hay vida fuera de tu burbuja ","replies":[]},{"poster":"BB RiveNoso","date":"2018-02-15T20:35:39.036+0000","up_votes":1,"down_votes":3,"body":"***","replies":[{"poster":"Franji","date":"2018-02-15T20:51:16.314+0000","up_votes":6,"down_votes":1,"body":"A que hora banean este tipo de comentarios? ","replies":[{"poster":"jotapée","date":"2018-02-15T22:18:23.140+0000","up_votes":1,"down_votes":1,"body":"¿qué decía? kjsdjff","replies":[]}]}]},{"poster":"CoolDevil","date":"2018-02-15T19:12:46.570+0000","up_votes":5,"down_votes":30,"body":"Lo cuentan como si fuera una historia de superación, \"del bullyng a la copa\", como si hubiera pasado de la extrema miseria a descubrir la cura para el cáncer, Y SÓLO SE DEDICA A JUGAR UN JUEGO, por Dios jajaja","replies":[{"poster":"wexwexwex","date":"2018-02-15T19:31:02.798+0000","up_votes":8,"down_votes":3,"body":"El mismo juego que tu le dedicas horas y no ganas nada ,  este tipo  vive de ello y tiene un montón de gente que lo apoya ","replies":[{"poster":"CoolDevil","date":"2018-02-15T21:05:17.315+0000","up_votes":3,"down_votes":14,"body":"Wow, qué admirable, el tipo vive de jugar un juego. ¿Ven? A esto me refiero: para ustedes, el juego lo es todo, es la vida, y toman ser bueno como algo admirable, como si sentarse a jugar un juego de PC hasta convertirte en uno de los mejores, sea una historia de superación.","replies":[{"poster":"wexwexwex","date":"2018-02-15T21:49:39.951+0000","up_votes":5,"down_votes":2,"body":"y quieres que de repente se haga un post de '' una mujer que supero por trabajar incansablemente en una empresa machista '' jaja , amigo creo que te equivocaste de pagina , este es un juego tu mismo lo dices , y no , no me dedico al League of legends , porque nunca se me paso por la cabeza ser jugador profesional ni tampoco quiero , pero no por eso voy a menospreciar el trabajo de otros que si lo hacen , como el tipo de mas arriba lo dijo tu comentario esta de mas  ,  y lo único que querías es generar hate , vuelve a leer tu primer comentario y piensatelo 2 veces y veras quien es el incorrecto \r\nSalu2","replies":[]}]}]},{"poster":"Franji","date":"2018-02-15T19:23:40.849+0000","up_votes":9,"down_votes":4,"body":"Y qué sabes tú lo que significó esto para el? Si no lo conoces de cerca y ni siquiera eres capaz de entender lo que se está hablando aquí no entiendo que haces comentando algo innecesario que no ayuda a nadie.","replies":[{"poster":"CoolDevil","date":"2018-02-15T21:07:29.931+0000","up_votes":4,"down_votes":13,"body":"Yo no dije que el tipo no sufrió ni nada por el estilo, pero en esta nota hablan de llegar a jugar una copa de LoL como si fuera recibir una beca en Harvard y recibirse con honores, y lo tratan como una historia de superación y ejemplo de vida, y no llega a ser más que un juego al cual le dedicó horas de su vida hasta convertirse en uno de los mejores. Dejen de fanatizarse tanto por un juego, el pibe no logró nada ni por su vida ni por el mundo. En cinco años, cuando este juego sea jugado sólamente por oldies, ¿te pensás que va a influir algo que hoy juegue una copa? ¿Dónde va a estar la superación en cinco años?\n\nSi Nico Guzman va a llegar a ser grande en la vida, CREEME, no va a ser por haber jugado una copa de LoL.","replies":[{"poster":"wexwexwex","date":"2018-02-15T21:33:40.919+0000","up_votes":9,"down_votes":2,"body":"es obvio que nadie vivirá por siempre con Lol , y de ningún trabajo o estudio ni futbolistas ni nada , y tampoco lo están sobre valorando en el post , ni dicen que es el mejor en su linea ni nada por el estilo , solo es un tipo que logro superar una etapa difícil y quizá sirva de ejemplo para otros  ","replies":[]}]}]}]},{"poster":"vaVav","date":"2018-02-15T19:58:35.182+0000","up_votes":6,"down_votes":2,"body":"Que bien que escribe el pibe Calihea, por favor...","replies":[]},{"poster":"LaPaja","date":"2018-02-16T19:29:56.520+0000","up_votes":4,"down_votes":1,"body":"Calihea te pasaste al escribirlo, I love it! Encontraste tanto las palabras precisas para describirlo todo y también así inspirar, me haz cargado con un poco mas de entusiasmo para perseguir lo que quiero. Aun que específicamente no se trate de lol pero, es la idea.\r\nComo sin darnos cuenta todos luchamos batallas dignas de ser contadas. Ojala nomas todos tengamos a una Calihea para que lo haga. Saludos con Amor Ron57\r\n{{sticker:sg-soraka}} ","replies":[]},{"poster":"Zacky Veng3ance","date":"2018-02-15T23:07:51.278+0000","up_votes":4,"down_votes":1,"body":"_Solo ten en cuenta que siempre que te hagan bullying sabras bien que ellos  quieren que fracases pero ten en cuenta que tu  triunfaras solo evitalos a toda costa tarde o temprano la moneda se devuelve a su dueño verdadero {{summoner:1}} _","replies":[]},{"poster":"Yusuke27","date":"2018-02-15T22:39:13.635+0000","up_votes":4,"down_votes":1,"body":"mis respetos a este men, además tiene la media wacha de polola xD sin duda un luchador de la vida\r\n","replies":[]},{"poster":"Mikazuki Auguzz","date":"2018-02-15T19:00:02.221+0000","up_votes":4,"down_votes":16,"body":"ser campeon en un juego como este mmmm...  perseverante hubiera sido nose si fuera un profesional a nivel de estudios academicos algo que le sirva en su vida y dia a dia! no en un juego que en cualquier momento dejara de estar de moda  y no tendra de que afirmarse\r\n","replies":[{"poster":"CoolDevil","date":"2018-02-15T22:11:56.690+0000","up_votes":3,"down_votes":10,"body":"Los nenes de acá tienen a lo sumo 16 años, no tienen idea de lo que es superación, y ver a un pibe que se pasa el día en una PC haciendo lo que más les gusta hacer a ellos, para ellos es un ejemplo a seguir. No intentes razonar. Les falta maduración.","replies":[{"poster":"jotapée","date":"2018-02-15T22:22:10.605+0000","up_votes":7,"down_votes":1,"body":"no se trata de ver a un tipo que juega lol y admirarlo por eso. Se trata de que la persona de la que se habla en el texto pasó por algo tan desagradable como el bullying, y después de tiempo y esfuerzo pudo convertirse en lo que le gusta y disfruta. Igual es bonito ver ese tipo de historias.","replies":[]}]}]},{"poster":"Pablove90","date":"2018-02-16T04:45:47.108+0000","up_votes":3,"down_votes":1,"body":"Dos genios ....que quien es el otro? Calihea obviamente","replies":[]},{"poster":"cricro3","date":"2018-02-15T22:46:20.575+0000","up_votes":3,"down_votes":1,"body":"que grande caos \r\n","replies":[]},{"poster":"FENRAKO","date":"2018-02-15T20:08:17.535+0000","up_votes":4,"down_votes":2,"body":"Linda historia, una buena manera de mostrar que los jugadores profesionales de eSports también son personas...","replies":[]},{"poster":"PrinceRipper","date":"2018-02-15T17:48:50.244+0000","up_votes":5,"down_votes":3,"body":"{{sticker:slayer-pantheon-thumbs}}  que inspiración para cualquier persona eres un campeón total :3 ","replies":[]},{"poster":"Niko2003","date":"2018-02-15T17:32:11.066+0000","up_votes":5,"down_votes":5,"body":"a mi también me pasaba lo mismo,gracias a league of legends me distrajo y amo este juego :3 honores para el ","replies":[{"poster":"Riot Maggical","date":"2018-02-16T02:07:48.683+0000","up_votes":3,"down_votes":2,"body":"Estos comentarios me afirman lo que siempre digo: League of Legends es mucho más que un juego :)","replies":[{"poster":"CSHN Sword","date":"2018-02-18T01:36:30.516+0000","up_votes":1,"down_votes":1,"body":"ocupa mucho tiempo del dia a dia obvio que se vuelve mas que un juego hasta para el oro estancado que soy :') nice juego wn","replies":[]}]}]},{"poster":"Rockmail186","date":"2018-02-15T21:34:19.218+0000","up_votes":3,"down_votes":2,"body":"AAAAAAA.... pero KLG de la copa al BULLYING\r\n{{item:3070}} {{sticker:sg-miss-fortune}} ","replies":[]},{"poster":"Blaze Highwind","date":"2018-02-17T00:56:57.337+0000","up_votes":2,"down_votes":1,"body":"por lo que veo es un support pro y me gustaría verlo jugar pero, cambiando de tema creo que el muy valiente de haber pasado por muchos problemas en especial por el bullying igual compartir una historia nos deja mucho que reflexionar yo también he pasado por lo mismo ademas el muy lindo awwww.... no se como le hicieron bullying esos envidiosos el tiene toda mi admiración y me gustaría verlo en los worlds animo chico tu historia me hizo reflexionar bastante y gracias riot games para que las personas vean que todos pasamos por problemas y que debemos ser comprensibles con los demás gracias a este gran juego he conocido muchas personas que me han compartido sus problemas y bueno ayudarlos nos vemos en la grieta seria bueno jugar con caos saludos para todos.\r\n\r\n{{sticker:sg-kiko}}      {{sticker:slayer-jinx-wink}} ","replies":[{"poster":"Riot Maggical","date":"2018-02-18T15:27:49.165+0000","up_votes":1,"down_votes":0,"body":"¡Puedes verlo todos los fines de semana en nuestra CLS! :)","replies":[]}]},{"poster":"SKT T1 Bank","date":"2018-02-18T13:12:07.042+0000","up_votes":1,"down_votes":0,"body":"Vi esto y me aprecio excelente. Los felicito, se que no hace al juego en si, pero de verdad es un buen aporte que hacen con esto.\n\n**BANK.**","replies":[{"poster":"Calihea","date":"2018-02-20T17:07:57.552+0000","up_votes":1,"down_votes":0,"body":"Gracias Bank querido. Nos vemos en el Abismo de los Lamentos.","replies":[]},{"poster":"Riot Maggical","date":"2018-02-18T15:28:15.976+0000","up_votes":1,"down_votes":0,"body":"Es lo lindo del LoL, todo hace al juego, es mucho más que un juego :)","replies":[{"poster":"SKT T1 Bank","date":"2018-02-18T15:35:46.891+0000","up_votes":1,"down_votes":0,"body":"Asi como critico cuando lo creo oportuno, por cosas como esta los aplaudo.","replies":[]}]}]},{"poster":"The Blanc Senna","date":"2018-02-17T02:49:29.670+0000","up_votes":1,"down_votes":1,"body":"no tengo ganas de leer :u pero es que el chico es TAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAN BONITOOO que no puedo evitarlo :u \r\n{{sticker:slayer-jinx-wink}} ","replies":[{"poster":"Keykpo","date":"2018-02-19T00:44:00.161+0000","up_votes":1,"down_votes":0,"body":"Gracias vv :v","replies":[]}]},{"poster":"lPaarThurnaxl","date":"2018-02-18T07:20:56.711+0000","up_votes":1,"down_votes":0,"body":"y como no hacerle bullyng con la cara de pelotudo que tiene","replies":[]},{"poster":"Mefisto616","date":"2018-02-18T05:06:35.143+0000","up_votes":1,"down_votes":0,"body":"Que triste casi llore!!! Que buena historia de progreso y superacion personal ,claro como ahora no sale a la calle porque vive 16 horas en la pc nadie lo molesta mas;  ojala trabaje de lolero ejecutivo en el futuro y pueda darle de comer a su familia farmeando XD ! POR SI NO SE DIERON CUENTA ESTOY SIENDO SARCASTICO!!","replies":[]},{"poster":"best kyne jg","date":"2018-02-17T22:26:07.172+0000","up_votes":1,"down_votes":1,"body":"LA CAGO EL WEON PERKIN POR LA CHUCHA POBRE Y TRISTE WEON {{item:3070}} {{champion:142}} ","replies":[]},{"poster":"TobiasGamer27","date":"2018-02-17T16:50:31.271+0000","up_votes":1,"down_votes":1,"body":"Un ejemplo a seguir completo crackkk\r\n","replies":[]},{"poster":"MAZOMBER","date":"2018-02-17T14:21:19.148+0000","up_votes":1,"down_votes":1,"body":"{{champion:114}} yo realmente como muchos jugadores recibimos  bullyng pero se debe salir adelante no importa lo que cueste pero debemos ser un buen triunfo ","replies":[]},{"poster":"Lvzarus","date":"2018-02-17T03:23:47.391+0000","up_votes":1,"down_votes":1,"body":"con esa cara de virgo se merece el bullying","replies":[]},{"poster":"santy7yf7ok","date":"2018-02-17T03:15:47.429+0000","up_votes":1,"down_votes":1,"body":"{{sticker:slayer-pantheon-rainbows}} ","replies":[]}]}