{"poster":"[NEM SIKERÜLT KIOLVASNI]","date":"2016-06-29T16:06:27.561+0000","title":"Clasificatorias 5v5 regresan en ciertos horarios","subforum":"Anuncios","up_votes":1,"down_votes":1,"body":"[ÜRES]","replies":[{"poster":"Fahrn","date":"2016-06-29T18:29:34.945+0000","up_votes":79,"down_votes":1,"body":"muchachos ahi lo dice: para CL/BO/PY es de 6PM hasta las 10PM y para AR/UY es de 7PM hasta las 11PM de lunes a viernes y los sabados y domingos de 4PM a 10PM para CL/BO/PY y de 5PM a 11PM para AR/UY\r\nes x si se confunden al leerlo. saludos!\r\n","replies":[{"poster":"Black Elitist","date":"2016-06-29T18:57:17.289+0000","up_votes":20,"down_votes":0,"body":"Que agradable sujeto {{champion:12}} ","replies":[]},{"poster":"NIAM EELADIN","date":"2016-06-29T21:15:19.212+0000","up_votes":5,"down_votes":0,"body":"yo ya estaba por poner 1 hora nada más? y un par de insultos, gracias user inteligente","replies":[{"poster":"jmpgta","date":"2016-07-03T04:21:05.270+0000","up_votes":2,"down_votes":0,"body":"Porque por horarios ? y no como antes?","replies":[]},{"poster":"ignacio77","date":"2016-07-28T04:49:27.703+0000","up_votes":1,"down_votes":0,"body":"yo iba a poner lo mismo jajajajajjaja que grande fahrn {{champion:432}} ","replies":[]}]}]},{"poster":"Ashakiel","date":"2016-06-29T19:31:16.063+0000","up_votes":25,"down_votes":3,"body":"Que malos horarios! Pongalas mas tarde!!!\nA esa hsa gente que trabaja o estudia de tarde-noche recien esta volviendo ","replies":[{"poster":"Fyee","date":"2016-06-29T21:28:30.322+0000","up_votes":3,"down_votes":0,"body":"creo que para ellos se penso el horario de fin de semana, aunque no deja de ser una buena sugerencia{{summoner:2}} ","replies":[]},{"poster":"Kr4user","date":"2016-07-01T01:59:48.221+0000","up_votes":2,"down_votes":0,"body":"Son un desastre los horarios.\r\n","replies":[]},{"poster":"Mudfrad","date":"2016-06-30T02:48:31.368+0000","up_votes":1,"down_votes":1,"body":"Tenes que leer la razón del horario, estan esos horarios porque en ellos es cuando hay más gente entonces las colas serian más cortas, claro que si no te jode esperar 20 minutos para vos podrian estar siempre pero rito no busca eso. ","replies":[{"poster":"L0c0Suelt0","date":"2016-06-30T16:33:40.867+0000","up_votes":2,"down_votes":0,"body":"y te parece justo eso?? hay mucha gente que realmente trabaja o tiene otros deberes que hacer en esos horarios y no se puede conectar... y le estas quitando la posibilidad de jugar este modo de clasificatorias en equipos que tanto gusta a todos... no me parece la manera, no estas acortando el tiempo de cola le sacas la posibilidad de jugar a gente que si quiere jugar... cada cual juega en los horarios que puede y siempre te vas a conectar a la misma hora de siempre.. Las colas van a ser las mismas porque la gente conectada va a ser la misma... no vas a disminuir el tiempo de cola porque no hay mas gente conectada para jugar.. cada cual se va a seguir conectando e el horario que puede jugar","replies":[]}]}]},{"poster":"Ceryx","date":"2016-06-29T20:48:27.865+0000","up_votes":14,"down_votes":1,"body":"Muy mal estructurados los horarios.\r\nDeberían ser:\r\nDomingo a Jueves: 6pm/7pm a 12am/1am\r\nViernes y Sábado: 4pm/5pm a 2am/3am","replies":[]},{"poster":"Dark Helel","date":"2016-06-29T20:24:15.991+0000","up_votes":11,"down_votes":1,"body":"Deberian dejarlos al menos hasta las 4.00 AM, porque mucha gente juega a la noche, ademas que juntar al menos 5 personas es bastante complicado...ya que tienen q estar, que no haya lag, q no se caiga alguno, etc...\r\n6.00PM a 4.00AM.","replies":[{"poster":"Irina Funny C","date":"2016-06-30T17:31:16.100+0000","up_votes":3,"down_votes":0,"body":"totalamente la gente de mi equipo juega mas de noche que otra cosa.","replies":[]}]},{"poster":"Rebkans","date":"2016-06-29T20:18:41.149+0000","up_votes":9,"down_votes":2,"body":"No me queda bien claro por que eligieron especificamente esos horarios siendo que hay gente que vuelve tarde a casa de su trabajo o estudios.\nEl anuncio dice que es para ofrecer tiempos de espera razonables, pero no entiendo como afectan (o deberian afectar) esos horarios al tiempo de espera para jugar.","replies":[]},{"poster":"Inube Carrots","date":"2016-06-29T21:39:30.430+0000","up_votes":7,"down_votes":1,"body":"Yo con mi team jugaba de madrugada porque muchos llegan a la casa recién a las 12... ahora no voy a poder jugar, gracias Rito -.- \r\n\r\nNo debemos ser los únicos tampoco. Mucha gente juega de madrugada porque coordinar a 5 personas en horarios de trabajo o estudio es muy difícil...","replies":[{"poster":"One Day Shîøt","date":"2016-07-08T04:03:52.650+0000","up_votes":1,"down_votes":0,"body":"Nos pasa igual.","replies":[]}]},{"poster":"Neros II","date":"2016-06-29T19:51:39.634+0000","up_votes":5,"down_votes":0,"body":"Sólo hasta las 11 viernes y sábados? Yo creo que da para más.","replies":[]},{"poster":"Atun","date":"2016-06-30T00:04:10.030+0000","up_votes":6,"down_votes":1,"body":"Dejenme entender algo: Tan malo fue el tema de la cola dinamica que:\r\n\r\n1) Riot Lyte se fue (o lo fueron en realidad)\r\n2) Entregan emblemas como una forma de decir \"Si, la estamos cagando con SoloQ\"\r\n3) Su video de la mesa redonda es horriblemente unliked\r\n4) Vuelven a poner ranked 5vs5 (que fue reemplazada por DynQ \"para mejor\") a pesar que DynQ vino a mejorar eso\r\n\r\n¿Y aun asi con medias tintas? Flaco, saquen la cagada de cola dinamica, vuelvan a poner como corresponde 5vs5, vuelvan a poner SoloQ y ni siquiera tienen que desangrarse en decir que la cagaron, solo vuelvan todo a como era antes y sigamos adelante. ¿Que idea tan descabellada de jugar por horarios? ¿Acaso todos tenemos los mismos horarios, tiempos libres?\r\n\r\nRito, se HUMILDE y acepta que la cagaste, no andes con cosas a medias!!!!\r\n","replies":[]},{"poster":"L0c0Suelt0","date":"2016-06-30T16:24:42.096+0000","up_votes":3,"down_votes":0,"body":"De todas formas no me parece bien....\r\nen mi caso en ese horario no me puedo conectar... \r\nNo me parece bueno ni justo eso de poner horarios uno juega cuando puede... ahora con solo poner ese horario hay gente que no podra jugar nunca porque no puede en ese horario como yo... asi no mejoran el tiempo de cola sino que eliminan la posibilidad de que todos podamos jugar... no comparto y suerte a los que si pueden jugar.. los envidio","replies":[]},{"poster":"Urellaxu","date":"2016-06-29T20:35:52.567+0000","up_votes":3,"down_votes":0,"body":"Estoy totalmente de acuerdo con que vuelvan pero en horarios tan específicos... no se si es la mejor idea","replies":[]},{"poster":"Jowi","date":"2016-06-29T19:44:35.765+0000","up_votes":4,"down_votes":1,"body":"Muy mal explicado, si no fuera por los usuarios entendía que teníamos 1 hora nada mas. Dios rito.... y no están bien los horarios, mucha gente vuelve del trabajo o del estudio a las 12 de la noche :| ","replies":[]},{"poster":"Diegetha","date":"2016-07-01T02:03:10.754+0000","up_votes":2,"down_votes":0,"body":"wn wtf los horarios, porque no se puede en la noche??\r\nyo creo que la mayoria puede jugar en la tarde-noche, es donde mas tenemos tiempo para jugar.... RITO PLEASE","replies":[]},{"poster":"NEGR00","date":"2016-06-30T21:36:36.038+0000","up_votes":2,"down_votes":0,"body":"la verdad me gustaria q vuelva como antes los team ranked estaba siempre a cualquier horario :p","replies":[]},{"poster":"sápo de la yuta","date":"2016-06-30T21:03:34.739+0000","up_votes":2,"down_votes":0,"body":" q asco  yo no me desvelo y solo los sabados y domingos podremos jugar q asco\r\n","replies":[]},{"poster":"Marsohn","date":"2016-06-30T15:49:15.677+0000","up_votes":2,"down_votes":0,"body":"GG Todos horarios imposibles para mi porq mi flia está despierta y me usa el internet dandome lag... :(","replies":[]},{"poster":"Gékkó ","date":"2016-06-30T06:00:09.522+0000","up_votes":2,"down_votes":0,"body":"los horarios no sirven la gente q no esta en todo el dia que hacen? tendrian que hacerlo pensando en todos los que juegan lol no a los que se rascan los huevos en la casa...","replies":[]},{"poster":"Nathan Kress","date":"2016-06-30T00:19:44.114+0000","up_votes":2,"down_votes":0,"body":"Tengo una duda, y ojalá alguien me responda. Esto afecta en tu en el LP que se gana? Por ejemplo, al jugar SoloQ, si vas en racha de victorias o juegas bien en general podrias ganar de 20 puntos y perder 8. Pero en las rankeds por X motivo puede que no te vaya tan bien y ganen menos que en SoloQ. Ese \"puntaje secreto\" que se obtiene en las colas 5vs5 no afectaria tu forma de ganar puntos en SoloQ?","replies":[]},{"poster":"Dr ChoPPer","date":"2016-06-29T20:40:11.358+0000","up_votes":2,"down_votes":0,"body":"Creo que en fines de semana deberian agragar horarios a la sieta ya que a alguno tenemos obligacione familiares de mañana y en la siesta.. madres padres abuelos niños hijos, etc decasan y nos dan un tiempo libre.. se esxtrañaban. habra recompensas por equipo esta seson(no aparece ne la seccion de ligas)¿?","replies":[]},{"poster":"RagDon","date":"2016-11-07T21:08:17.570+0000","up_votes":1,"down_votes":0,"body":"y gracias a estos horarios quizas no logre sacar el ward {{item:3070}} ","replies":[]},{"poster":"Tetrø ","date":"2016-11-05T15:26:33.624+0000","up_votes":1,"down_votes":0,"body":"{{sticker:slayer-pantheon-thumbs}} ","replies":[]},{"poster":"Tetrø ","date":"2016-11-05T15:25:17.810+0000","up_votes":1,"down_votes":0,"body":"{{summoner:31}} ","replies":[]},{"poster":"Panchyy","date":"2016-10-27T20:30:16.503+0000","up_votes":1,"down_votes":0,"body":"Va a pasar el falcon por las empresas de riot","replies":[]},{"poster":"Panchyy","date":"2016-10-27T20:29:22.110+0000","up_votes":1,"down_votes":0,"body":"Me parece malisimo eso de que sea 1 hora nada mas las ranked team, tendrian que ser como antes","replies":[]},{"poster":"xHache","date":"2016-10-22T16:33:28.038+0000","up_votes":1,"down_votes":0,"body":"PONE TODO EL DIA RIOT!","replies":[]},{"poster":"powerfullady87","date":"2016-10-20T03:58:19.733+0000","up_votes":1,"down_votes":0,"body":"La verdad que estos horario son complicados... juntar 5 personas en ese rango... La verdad que con los que juego es en el horario de madrugada ya que ahi mejora mucho el internet.. \r\nIgualmente quisiera saber porque ponen horarios? De curiosa...\r\nPor favor arreglen eso.. asi puedo tener junto con mi team alguna reconpensa.... \r\nAtte Ceci\r\nP.D: el team esta compuesto de gente que estudia y trabaja tarde.  ","replies":[]},{"poster":"Zed El Ninja","date":"2016-10-19T20:52:28.792+0000","up_votes":1,"down_votes":0,"body":"Mmm... que rico {{summoner:7}}  {{champion:427}} ","replies":[]},{"poster":"Juego con la 10 ","date":"2016-10-19T20:37:50.527+0000","up_votes":1,"down_votes":0,"body":"Estan mal puestos los horarios papá una o dos horas mas temprano o una o dos horas mas tarde, asi te corta al medio todo. Ojala rito leyera los comentarios de la comunidad! :/","replies":[]},{"poster":"nijon","date":"2016-09-21T19:54:15.092+0000","up_votes":1,"down_votes":0,"body":"{{sticker:slayer-jinx-catface}} ","replies":[]},{"poster":"milfens","date":"2016-09-15T21:38:55.050+0000","up_votes":1,"down_votes":0,"body":"{{champion:103}} ","replies":[]},{"poster":"FC GodLike","date":"2016-09-11T00:10:41.864+0000","up_votes":1,"down_votes":0,"body":"No entiendo :v yo y mi team ranked anoche jugamos 1 ranked y después desapareció para volver a jugar de nuevo :v","replies":[]},{"poster":"Reus113","date":"2016-07-02T02:40:35.239+0000","up_votes":1,"down_votes":2,"body":"Que fome que dure tan poco osea de 04:00 a 05:00 es super poco, mi opinion es que dure un mas :/\r\n","replies":[{"poster":"UY DévilG0D","date":"2016-07-02T18:59:12.711+0000","up_votes":1,"down_votes":1,"body":"Me logie solo para responder a tu estúpido comentario, AHI DICE QUE SI SOS DE CHILE (QUE SEGURO LO SOS) DE LUNES A VIERNES TENES 4 HORAS PARA JUGAR (6pm-10pm) Y DE SABADOS A DOMINGOS TENES 6 HORAS PARA JUGAR (4pm-10pm).","replies":[{"poster":"One Day Shîøt","date":"2016-07-08T04:09:03.623+0000","up_votes":1,"down_votes":0,"body":"Entiendo que el amigo no tiene comprención lectora, pero no por eso le vas a responder de esa forma, por eso la comunidad está como está....","replies":[]}]}]},{"poster":"Allsaimer","date":"2016-07-05T02:34:39.028+0000","up_votes":1,"down_votes":0,"body":"Es posible aumentar el rango de horario? termina muy temprano...","replies":[]},{"poster":"P0lT10n","date":"2016-07-03T20:06:21.973+0000","up_votes":1,"down_votes":0,"body":"Rito, que vuelvan las Clasificatorias comunes, maximo duo, basta de esa porqueria de 3 o mas personas, eso ya es Team Ranked.... por favor, son cualquier cosa las ranked dinamicas","replies":[]},{"poster":"SKT REVENGEzXy","date":"2016-07-03T06:29:02.469+0000","up_votes":1,"down_votes":0,"body":"POR QUE NO LO DEJAN COMO ESTABA ANTES??? NO SE PARA QUE PONEN HORARIOS!\r\n","replies":[]},{"poster":"   Fernandez Oro","date":"2016-07-02T19:04:02.658+0000","up_votes":1,"down_votes":0,"body":"porque le ponen horarios hay gente que no tiene tiempo de jugar en esos horarios, porque no las ponen como antes así pueden jugar todos por igual. es el colmo que tengas horarios para jugar a un juego \r\n","replies":[]},{"poster":"God of Kench","date":"2016-07-02T02:19:58.144+0000","up_votes":1,"down_votes":0,"body":"bueno para mi los horarios que están ajustado son pésimos por que la mayoría estaríamos en los estudios etc etc pero por q no pueden ponerlo en los fin de semana cuando uno esta relajado y sin asuntos pendientes a si estarás con tu equipo además estaría siempre faltanto uno (no se sabría la casualidad) pero en los fin de semana podras estar mas tranquilo/a para jugar el equipo completo :3","replies":[]},{"poster":"BeBe","date":"2016-07-02T00:26:28.690+0000","up_votes":1,"down_votes":0,"body":"Mmmmmmm Mal horario si vuelven lo mejor seria que volvieran todo el día como antes ya que la mayoría rankea en la noche los fin de semana y los horarios están re mal:l me alegre al saber que las activaron pero con esos horarios no dan ganas de jugar ojala lo cambien","replies":[]},{"poster":"Siloon Xelot","date":"2016-07-01T23:27:45.482+0000","up_votes":1,"down_votes":0,"body":"COMO HACEN ESTO?!!!! en que momento se drogaron para hacer esto, realmente solo  piensan en una faccion de los jugadores de LOL, como muchos dicen y me uno a sus comentarios, piensen en gente que trabaja y al llegar se animan a jugar una partida en la noche pasado el horario que ustedes dicen... viejo LOL es un juego para divertirse y competir si uno quiere, pero los jugadores no deben adaptarse a su servicio, sino que todo lo contrario... al parecer nunca aprendieron de marketing o empresas... sin duda muchos se les iran de la comunidad a jugar nose.. overwatch... sigan matando su propio juego y por ultimo si van a poner un horario tan mediocre por ultimo mejoren la inspeccion de partidas frente a jugadores toxicos y/o afks y sus derivados, por ultimo digo yo, es lo minimo que se pide.","replies":[]}]}