{"poster":"[NEM SIKERÜLT KIOLVASNI]","date":"2015-09-17T01:50:51.821+0000","title":"Campeón a fondo: Kindred, los Cazadores Eternos","subforum":"Anuncios","up_votes":1,"down_votes":0,"body":"[ÜRES]","replies":[{"poster":"Poppy Noticiera","date":"2015-09-17T18:06:01.664+0000","up_votes":217,"down_votes":14,"body":"No han pensado en sacar un campeon con barra de  \"cordura\" así como la furia pero esta subiendo a medida que recibe daño el personaje hasta cambiar su kit de habilidades y convertirse en asesino y con interacciones totalmente diferentes por ejemplo O: y sobre los kindred 10/10 son hermos@s y se divertido para jugarlo hasta de support ._./","replies":[{"poster":"CJ14","date":"2015-09-17T18:54:23.793+0000","up_votes":67,"down_votes":7,"body":"Esta es la mejor idea que he escuchado aqui. RIOT contraten a este hombre, es mejor que todo su departamento creativo","replies":[{"poster":"Poppy Noticiera","date":"2015-09-17T19:16:58.491+0000","up_votes":35,"down_votes":9,"body":"de hecho tengo mucha imaginacion xD , hasta el lore asi como un campeon de zaun que cuando niño/adolecente que  vivia feliz con sus padres hasta que un dia le entraron a robar y al verlo decidieron eliminar a sus padres , llego a tanto dolor verlos que agarro una espada que era de su padre y elimino a los ladrones como si fuera experto mientras su mirada mostraba felicidad por la zed de sangre  y luego se da cuenta de lo que hizo para quedar con un trauma donde el no queria volver a ese estado y decide viajar por el mundo buscando alguna donde vivir tranquilo y ayudando a la gente mientras su lado asesino solo quiere matar a todo ser vivo ._./","replies":[{"poster":"miss u","date":"2015-09-17T21:14:40.333+0000","up_votes":17,"down_votes":0,"body":"nagato eres tu?","replies":[{"poster":"Nagato","date":"2015-09-18T03:53:17.034+0000","up_votes":55,"down_votes":1,"body":"nop, ese soy yo","replies":[]},{"poster":"TheLaygon","date":"2015-09-18T06:11:35.222+0000","up_votes":8,"down_votes":2,"body":"inicie sesion solo para dar like grande naruto te mereces un champ con rassengan {{champion:126}} ","replies":[]},{"poster":"marcux60","date":"2015-09-19T01:17:06.144+0000","up_votes":5,"down_votes":0,"body":"y que es lo que tiene en la mano {{champion:103}} ","replies":[]}]},{"poster":"StarKnight","date":"2015-09-18T00:59:54.906+0000","up_votes":29,"down_votes":6,"body":"mucha imaginacion?no es por ofender pero gnar es basicamente eso y sobre el lore,bastante genericon y simple","replies":[]},{"poster":"Don Pitu","date":"2015-09-18T05:13:35.152+0000","up_votes":20,"down_votes":1,"body":"{{champion:238}} de sangre?","replies":[{"poster":"DarkLinkomg","date":"2015-09-21T17:39:16.664+0000","up_votes":2,"down_votes":0,"body":"{{champion:238}} Luna sangrienta confirmed","replies":[]}]},{"poster":"juancfa","date":"2015-09-17T22:08:57.175+0000","up_votes":11,"down_votes":1,"body":"no se, pero me parece a mi q esa historia se parece demasiado a la de Cavendish(One piece)\r\n{{champion:64}} {{summoner:4}} {{summoner:4}} ","replies":[]},{"poster":"Fernanda Ailyn","date":"2015-09-17T20:49:51.153+0000","up_votes":7,"down_votes":3,"body":"{{champion:266}} {{champion:150}} {{champion:57}} {{champion:23}}  cof cof cof* XDD\r\n","replies":[{"poster":"sharknyak","date":"2015-09-17T20:55:02.722+0000","up_votes":9,"down_votes":1,"body":"creo que el unico similar con la idea es gnar \r\nXD","replies":[]},{"poster":"Xede","date":"2015-09-19T04:10:49.826+0000","up_votes":4,"down_votes":1,"body":"Ninguno de esos campeones cambia mecánicas y kit de habilidades al llenar la barra, es mas, Maokai ni siquiera tiene barra de furia ._. ","replies":[]}]}]},{"poster":"Cherish","date":"2015-09-17T22:22:26.699+0000","up_votes":18,"down_votes":1,"body":"No es x pincharles el globo chico ni nada pero Gnar tiene exactamente lo que este chico acaba de de decir. No se llama cordura, pero la furia que va tomando Gnar al pasar el tiempo hace que cambia de forma, de habilidades y por si no queda claro tambien su modo de comportarse. Aca no se les ocurrio nada nuevo.","replies":[]}]},{"poster":"XboxRulz","date":"2015-09-17T18:26:01.969+0000","up_votes":4,"down_votes":9,"body":"champ con modo berserker estaría op al mejor estilo de gatsu cuando pierde la razón rompe todo ","replies":[{"poster":"rquelonio","date":"2015-09-17T20:18:43.973+0000","up_votes":28,"down_votes":1,"body":"{{champion:2}} ","replies":[]}]},{"poster":"marcux60","date":"2015-09-17T18:20:29.891+0000","up_votes":5,"down_votes":2,"body":"es buena tu idea pero no crees que seria un {{champion:150}} ? ","replies":[{"poster":"Poppy Noticiera","date":"2015-09-17T18:29:56.879+0000","up_votes":10,"down_votes":2,"body":"es furia , renekton igual es furia y si es como gnar pero mas controlado , ya que tu eliges entrar o salir del daño recibido ._./ ya que  se carga mientras te golpean , yo me refiero a un campeon asi por ejemplo de poca movilidad co atributos algo defensivo pero al momento de recibir cierta cantidad de daño se vuelva un asesino con movilidad suficiente para matar a tu objetivo , en si mismo se convertiria en un campeon complejo ya que debes saber cuando entrar y salir para entrar en el modo \"asesino\" e ir por el carry o apc o tambien... el modo yolo tirarse solo vs los 5 hasta el cambio e ir directo al adc xDD y despues correr como **** XD","replies":[{"poster":"Zetoz","date":"2015-09-17T19:29:58.190+0000","up_votes":9,"down_votes":2,"body":"osea un {{champion:150}} al revés ","replies":[{"poster":"D4ever","date":"2015-09-18T02:40:01.591+0000","up_votes":15,"down_votes":0,"body":"ɹɐuƃ","replies":[]},{"poster":"Supernova Rigel","date":"2015-09-17T19:49:27.843+0000","up_votes":12,"down_votes":1,"body":"rang","replies":[]}]}]}]},{"poster":"Efezto","date":"2015-09-17T19:57:05.841+0000","up_votes":4,"down_votes":14,"body":"La idea esta muy trillada, pero cabe destacar que:\r\n**Un asesino con poca vida es un MAL asesino.**\r\nSino estas buscando a Trynda.","replies":[{"poster":"Poppy Noticiera","date":"2015-09-17T20:13:30.801+0000","up_votes":11,"down_votes":1,"body":"rengar con 100 de vida que te deletea , zed con las sombras te viola a poca vida si tiene ulti , sigo? xD","replies":[{"poster":"Threadripper","date":"2015-09-17T21:56:43.202+0000","up_votes":2,"down_votes":27,"body":"SOY MAIN RENGAR HICE PENTA A 1200 DE VIDA :\r\nY TENIA 2760 DE VIDA MAXIMA{{champion:107}} USANDO SOLO {{summoner:14}} {{summoner:4}} Y TENIA : {{item:1334}} {{item:3031}} {{item:3074}} {{item:3072}} {{item:3142}} )","replies":[{"poster":"Nelson Mauuri","date":"2015-09-17T23:38:37.497+0000","up_votes":18,"down_votes":0,"body":"Uy, si no dices que eres main no te creo que eso es posible...","replies":[]}]}]}]},{"poster":"Crawdon","date":"2015-09-17T18:13:39.115+0000","up_votes":16,"down_votes":6,"body":"Me encanto tu idea de un champ asesino que tenga barra de cordura, ojala tu idea llegué hasta rito\r\n","replies":[]},{"poster":"Squeeze","date":"2015-09-18T18:00:56.789+0000","up_votes":4,"down_votes":0,"body":"Es Gnar, este cuando recibe daño tambien sube su barra transformandolo en algo completamente diferente y llevado por la rabia. No puede ser que suba solo al recibir daño pues seria facil ignorarlo en las TF o dejarlo para el final y no podrias hacer nada para activar tu kit, a menos que pudieras tomar daño de tus aliados como un paladin pero eso dejaria completamente de lado tu \"lore\" orque los paladines estan enfocados en la defenza y dejarse llevar por la rabia no es lógico. Seria mejor un Champ paladín que al tomar suficiente daño \"ascendiera\" a una forma eterea y pudiera sanar más? \r\n\r\nY siguiendo lo que los otros dicen el lore es muy muy básico y poco creíble, un cambio de personaje no surge de la noche a la mañana, un niño que ve como matan a sus padres no llega y toma una espada porque si, los campenoes consumidos por la rabia lo son por algo más grande y se crea a lo largo del tiempo, mira a Zed o a Nocturne por ejemplo.\r\n\r\n","replies":[]},{"poster":"Awqays Waxyay","date":"2015-09-18T16:13:30.628+0000","up_votes":5,"down_votes":1,"body":"apoyo la mocion con toda demencia !!!!","replies":[]},{"poster":"SKåL Til The End","date":"2015-09-19T00:11:29.652+0000","up_votes":3,"down_votes":0,"body":"Me he dibujado muchas veces en la mente el tipo de campeón que decis y entiendo el concepto al que te referis. Mi idea fue un tipo de campeón que aplique daño y reciba y acorde a sus actos tenga un efecto o una consecuencia. Por ejemplo: Furia: perdida de vida, aumento de daño físico; Tranquilidad: aumento de vida, reducción de daño; interactuando entre ellas dependiendo lo que el invocador tome como decisiones. En cuanto a lo de si Gnar es similar o no a este concepto(El tuyo) no, no lo es. Puesto que Gnar reacciona con ira ante el enemigo. Se puede traducir que Gnar al atacar a su enemigo entra en una especie de psicosis genética de si mismo que lo transforma a un Mega Gnar, un Gnar con unos años mas encima o bien un Gnar evolucionado por su propia cadena evolutiva, concepto que lleva Kha Zix pero este evoluciona por crecimiento de extremidades físicas mientras que Gnar evoluciona por metabolismo y reacción genética, para desviarnos un poco.\r\nPor otro lado este concepto reaccionaria RECIBIENDO DAÑO y no APLICANDOLO, son el polo norte y el polo sur.\r\nY otro aspecto de lo hablado si bien los campeones se parecen el juego en si ya tiene una forma y el principal problema de un creador en esto, creo yo, esta en poder incluir su campeón aquí. Es decir, pueden crear un millón de campeones diferentes pero si ninguno sirve para La Grieta del Invocador(que es CASI todo el juego, para seguir contando los otros mapas) quedan descartados por lo que no es tan fácil crear un campeón.","replies":[]},{"poster":"Lefiex","date":"2015-09-18T02:50:36.456+0000","up_votes":3,"down_votes":0,"body":"Hacia un tiempo cuando salio {{champion:432}} tenia la idea de un champ un sobreviviente de las Islas de las sombras, un noxiano cuyo barco habia quedado varado por culpa de harrowing como el vídeo de las marionetas del año pasado, seria un mago tank algo como mi fiel amigo {{champion:8}} y me lo imaginaba con una personalidad bipolar también, que una vez que lograba una kill este iba como evolucionando  por los fantasmas de las islas de la sombras dandole bonificaciones, consumiéndolo hasta cambiar totalmente de forma. Es parecido a esto de la pasiva de kindred y me pareció genial la idea. \r\nPD: El arte de Kindred me encanto unos de los mejores del juego para mi gusto espero con ansias su historia y su video que probablemente tendra, ojala sea una animacion como bardo. ","replies":[]},{"poster":"Akresh","date":"2015-09-18T02:50:16.016+0000","up_votes":3,"down_votes":0,"body":"ya tenemos campeones con Furia {{champion:421}} {{champion:150}} {{champion:58}} {{champion:23}} \r\n\r\nEnergia {{champion:64}} {{champion:238}} {{champion:84}} {{champion:85}} {{champion:98}} \r\n\r\nRecalentamiento{{champion:68}} \r\n\r\ny Otros tipos de barras como {{champion:266}} {{champion:157}} \r\n\r\nAhora deberian sacar un campeon que su fuente de \"poder\" por asi decirlo sea no se... \"fatiga\", seria algo asi como juntar el recalentamiento de Rumble con la falta de energia...\r\n\r\nY que al estar lleno de Fatiga sus habilidades bajen increiblemente el daño cosa de... \"medir\" cuando utilizar o no habilidades\r\n\r\ntambien se podria usar la barra de poder \"ESPIRITU o KI\" para aquellos campeones que no poseen barra de poder....","replies":[]},{"poster":"NskaterHro","date":"2015-09-18T00:38:15.248+0000","up_votes":3,"down_votes":0,"body":"La E de Amumito? {{champion:32}} ","replies":[]}]},{"poster":"Zetoz","date":"2015-09-17T19:27:48.703+0000","up_votes":38,"down_votes":1,"body":"Resumo para el que solo vino a ver los comentarios:\r\n1- Notas sobre el diseño del juego:\r\nQuerían dar a los jugadores un concepto totalmente nuevo, un tirador junglero que no tenga los problemas de los campeones de rango que algunos usan para la jg (ej. {{champion:29}} y {{champion:4}}), lo que aportaría mucho daño a cualquier composición, pero no tanto CC. Básicamente tener 2 tiradores en un equipo para que el resto pueda elegir personajes AP que mantengan a raya a los asesinos y luchadores (como {{champion:32}} y {{champion:54}}) o bien, compren {{item:3071}} para maximizar el daño de ambos tiradores. Su R, Respiro de Cordero, es otra de esas habilidades que pueden seguir siendo efectivas independientemente del grado de éxito que tenga el campeón en la partida, además de promover que el equipo busque crear composiciones que desborden la imaginación.\r\n2- Notas sobre narrativa:\r\nBásicamente estos personajes podrían representar con facilidad la muerte en la mitología de Runaterra, y que sean celebrados, igual que el día de los muertos en México. Otra cosa Básica en Kindred es su \"Efecto Yin-Yang\", para eso las mascaras eran fundamentales y que representan que el Lobo tiene algo de Cordero y que el cordero tiene algo de Lobo.\r\n3-Notas sobre arte:\r\nCrear un personaje doble no es nada fácil, al equipo de creación le tardó 2 de 4 semanas que tenían reservadas para este proceso crear un boceto original de Kindred, pero ese boceto fue muy alabado y criticado a la ves (wow, recién me doy cuenta que hasta en su creación son dos cosas a la vez, amados y odiados). Al final se quedaron con el boceto, mejorandolo hasta ser lo que es ahora Kindred.\r\n\r\nListo, esto es todo (a pequeña escala) de lo que dice arriba, pero recomiendo leer todo lo que escribieron porque seguro que me salté cosas muy interesantes...\r\nPersonalmente estoy muy ansioso por Kindred ya que no me decepcionaron antes con {{champion:421}} \r\nP.D: Gracias por leer! {{item:1052}} \r\nP.P.D: ¿Me dan una poro galleta por este resumen? {{summoner:31}} ","replies":[{"poster":"Efezto","date":"2015-09-17T19:37:22.065+0000","up_votes":19,"down_votes":2,"body":"Si no leyeron arriba, el texto original con imagenes y buen formato, siento decirte que no van a leer tu resumen. {{item:3070}} ","replies":[]}]},{"poster":"Geo Stampede","date":"2015-09-17T19:29:15.986+0000","up_votes":26,"down_votes":2,"body":"**“¿Van a poner un estúpido corderito en el juego?” ** \r\nChicos, tenemos un tejon boy scout en el juego hace tiempo, una rata y un anciano.. que problema habría con un Cordero y un Lobo? .-. ","replies":[{"poster":"VR8 QuickSilver","date":"2015-09-18T02:14:11.495+0000","up_votes":10,"down_votes":0,"body":"y un gordo alcoholico {{champion:79}} y un pescado con tridente {{champion:105}} y una gallina que controla el hielo {{champion:34}} y asi tantos otros más xD","replies":[]},{"poster":"BillibuLegendary","date":"2015-09-18T13:38:22.421+0000","up_votes":9,"down_votes":0,"body":"Y no se olviden de los negros {{champion:245}} {{champion:236}} {{champion:43}} ","replies":[{"poster":"FXT Bengoku","date":"2015-09-18T20:05:19.436+0000","up_votes":5,"down_votes":0,"body":"falto{{champion:76}} {{champion:63}} bueno fuego quemado negro xd a que sí :c","replies":[]}]},{"poster":"Rohaerlynn","date":"2015-09-18T00:58:20.238+0000","up_votes":2,"down_votes":20,"body":"Te informo que ''boy scout'' es una referencia obsoleta.\r\nel movimiento scout dejo de llamarse asi hace mucho tiempo cuando se le permitio a las mujeres entrar al movimiento, por favor te pido que te informes sobre el tema porque al llamarnos asi insultas a nuestra organizacion, gracias.","replies":[{"poster":"Menstrull","date":"2015-09-18T01:46:35.535+0000","up_votes":11,"down_votes":0,"body":"Rohaerlynn, en realidad no esta mal dicho \"Boy Scout\", depende del país, ya que en algunos países, sigue habiendo \"Boys Scouts\" ya que las mujeres en vez de unirse a los Scouts, están en las \"Guias\", lo cual provoca que estén los hombre por un lado y las mujeres por otro.\r\nSi no me equivoco (y corrijan me si lo estoy) en Chile sigue siendo así. En Argentina en cambio, no existen los \"Boys Scouts\" ya que las mujeres pueden ser Scouts aunque también hay Grupos de Guias y grupos que tienen Scouts y GUias.","replies":[{"poster":"SkeletonHS","date":"2015-09-18T20:33:50.396+0000","up_votes":4,"down_votes":0,"body":"y los q son homo o bi :P","replies":[{"poster":"Magmiteh","date":"2015-09-19T14:02:00.954+0000","up_votes":8,"down_votes":0,"body":"HomoScout?\r\n:v","replies":[]}]}]}]}]},{"poster":"nikiitoxx","date":"2015-09-17T20:22:09.096+0000","up_votes":23,"down_votes":0,"body":"seria genial un kindred \"invertido\" asi como la skin de {{champion:1}} ","replies":[]},{"poster":"Laguero1","date":"2015-09-17T23:17:27.207+0000","up_votes":16,"down_votes":0,"body":"{{champion:16}}  + {{champion:19}}  = Kindred","replies":[]},{"poster":"Styxa","date":"2015-09-17T18:41:50.244+0000","up_votes":11,"down_votes":0,"body":"si hay algo que no puedo criticar a riot es lo bonito que se ven visualmente los campeones los ultimos que estan sacando estan muy bueno {{champion:245}}  {{champion:223}} {{champion:268}} {{champion:429}} ","replies":[{"poster":"Supernova Rigel","date":"2015-09-17T19:51:24.829+0000","up_votes":16,"down_votes":2,"body":"Nadie se acuerda del buen Bard :( {{champion:432}} {{item:3151}} ","replies":[{"poster":"El Bardo","date":"2015-09-18T03:49:08.785+0000","up_votes":4,"down_votes":0,"body":"{{champion:432}}  lloro todas las noches :( {{item:3151}} ","replies":[]}]},{"poster":"Yo No Hookeo ","date":"2015-09-17T19:27:35.118+0000","up_votes":6,"down_votes":1,"body":"{{champion:223}} ES HERMOSO :)","replies":[]}]},{"poster":"ramestuck","date":"2015-09-17T20:56:30.692+0000","up_votes":2,"down_votes":2,"body":"Alguien Sabe Kuanto Saldra?","replies":[]}]}