{"poster":"[NEM SIKERÜLT KIOLVASNI]","date":"2016-12-20T20:35:06.400+0000","title":"El lenguaje visual hextech","subforum":"Anuncios","up_votes":0,"down_votes":0,"body":"[ÜRES]","replies":[{"poster":"Dephos","date":"2016-12-30T19:47:37.655+0000","up_votes":177,"down_votes":23,"body":"Este 2016 llegue a escribir un libro entero de cosas que no me importan, esta obviamente también la escribiré. Hagan eventos sobre temáticas hextech y no no quiero eventos de cosplay, no quiero eventos de dibujos quiero un evento que sea IN-GAME algo que te incentive a jugar, un nuevo mapa, recompensas por jugar. Estoy podrido de que no hagan nada para que la comunidad este contenta es tan difícil pensar en algo para que la gente disfrute? el evento de navidad me llego a dar cáncer como es posible ser tan tacaño? (no me vengan con que el juego es f2p y no están obligados a hacer cosas porque estoy cansado de tener que explicar que si no fuera por la gente lol no existiría, justo derecho de criticar y exigir, les recuerdo que el rp se compra con dinero real...). presento mi frustración porque este año a sido horriblemente malo en cuanto a eventos y me desilusiona ver que uno de mis juegos favoritos este tan abandonado.","replies":[{"poster":"gocap2001","date":"2016-12-30T20:45:13.236+0000","up_votes":25,"down_votes":6,"body":"El unico ``EVENTO´´ que hubo este año fue el de los proyecto y tampoco fue la gran cosa,","replies":[]},{"poster":"Dragonhex","date":"2016-12-31T01:37:17.887+0000","up_votes":12,"down_votes":28,"body":"mira tienes que entender que la gente que hace los eventos de arte y cosplay es una y los que hacen los eventos en el juego como ejemplo el mapa de aram de aguasturbias es otra. Y este año esa gente diseño la grieta de invierno y le hizo unas mejoras al rey poro, ademas este año sacaron este no es dominion y asedio y a ti te parece un año de mierda?","replies":[{"poster":"Lil Annie ","date":"2016-12-31T02:26:27.097+0000","up_votes":9,"down_votes":24,"body":"El quiere RP o SKINS por eso le parece una mierda o eso entendi :s   no sabe que el juego no pasa por ahí","replies":[{"poster":"MolotovKiller","date":"2016-12-31T04:44:31.776+0000","up_votes":26,"down_votes":5,"body":"Cuando te llevaste comprensión lectora a marzo. El no pide que den RP o skin. Pide que hagan un evento en condiciones. El ultimo evento en condiciones (y ni tanto) fue el de Aguasturbias, cuando cambiaron el mapa de ARAM con una tematica de la ciudad. Pero llevamos AÑOS estancados en el mismo mapa. Nunca hicieron un evento grande en el mapa principal. Siempre los eventos son de cosplayers, dibujo, escritura, etc, eventos que si, son buenos, pero que siguen estando limitados y donde SIEMPRE ganan los que mejor se las apañan.\r\nY despues, no se equivoca, el evento de navidad es PENOSO. En todo caso ¿que costaba hacerlo como el del año pasado? donde podias regalarle iconos a tus amigos. Este evento en vez de incentivar la Navidad incentiva el ganar billetes. Y el justificativo de \"es un juego gratis\" es cualquiera, ya que HOTS por ejemplo puso un evento para conseguir una montura gratis (aun cuando antes hicieron un mega evento que regalaba como cinco heroes, un buff de 30 dias de oro y exp, una skin para Overwatch y una montura para HOTS). ","replies":[{"poster":"Toramaru1","date":"2017-01-01T03:35:35.201+0000","up_votes":6,"down_votes":1,"body":"concuerdo completamente, este es uno de los juegos mas tacaños y sentrado en que los creadores agan plata, no hay un evento como la gente, hay muchos juegos onlineen los que tienes eventos interesantes todos los meses, te dan la oportunidad de ganar moneda paga del juego, o campeones, heroes, etc, y skins, aca lo mas parecido que hay a eso sn las artesanias hextech, y asta con eso son tacaños, o tienes cajas, o tienes llaves, es como si lo hicieran a proposito,tengo un amigo  que tiene 19 llaves forjadas, y yo e llegado a tener 12 cajas sin abrir, me encantaria poder intercambiar con el, 6 cajas por 6 llaves y ganamos los dos, pero no, porque riot pierde, solo se centran en ganar dinero, como han conceguido que sea un juego con muchos usuarios ya an dejado de lado el buscar formas de hacer interesante el juego, ya solo se centran en el dinero, y un dato curioso es que  este es el unico juego creado por riot, osea que a diferencia de muchos que tienen 2, 4, 5 o 10 juegos que controlar, y para los cuales crear eventos, actualizaciones, y todas las demas cosas que requiere un juego, riot solo se tiene que preocupar por un juego, y aun asi lo hace peor que los que tienen hasta 10 veces mas juegos, no esntiendo una forma logica en la que eso este bien, ralmente tienen mucho por mejorar, aunquepara ser sincero, no creo quue esto  valla a mejorar, es la cruda verdad, es como en todos estos comentarios, o van a ver ni una palabrade alguien de riot, porque todo lo que no les gusta como suena directamente lo esquivan, no tienen lo que se necesita para hacer frente a las criticas y aprender de ellas y mejorar, muy triste, sigan juntand plata, yo por mi parte hasta el dia de hoy no e gastado ni un solo peso en RP y no lo gastare nunca, no pienso darle mi dinero voluntariamente a quien no lo merece.\r\n","replies":[]}]}]}]},{"poster":"Mathryx","date":"2016-12-31T01:24:00.969+0000","up_votes":8,"down_votes":30,"body":"Pensas en lo que decis cuando tenes skins gratis por la artesania hextex? flaco pensa que ya ahi pierden un monton de guita, osea hay que valorar lo que nos dieron.{{sticker:slayer-jinx-wink}} ","replies":[{"poster":"SuperPechuga","date":"2016-12-31T04:25:28.363+0000","up_votes":25,"down_votes":3,"body":"JA! Claro porque ellos no ganan mas dinero con las cajas y llaves que te vende por DINERO REAL, asi que las artesanias Hextech son otro medio para poder ganar dinero y vos pensa en la cantidad de gente que se compra packs de llaves y cajas. {{sticker:slayer-jinx-wink}} ","replies":[]}]},{"poster":"SirRodrigo","date":"2016-12-31T13:21:17.800+0000","up_votes":5,"down_votes":0,"body":"estas en todo lo cierto antes hacian eventos como cuando estaba el skin de katarina si jugabas en equipo de 5 con un lvl bajo 5 seguidas y ganaban tenian un skin de katarina eso era cuando estaba en el sv eu y no existia LAS. El juego ya es famoso, y actua como tal. ya no le interesa hacer esos tipos de eventos porque ya tiene publico. imaginate antes existian 5 sv en todo el mundo, ahora tiene 20 servidores. con toda la plata que recaudo y toda la plata que recauda en eventos no le hace falta ni mover un pelo. por eso te cambian los botoncitos para que pienses que invierten pero sigue siendo lo mismo esto lo hacen para que dibujen que algo hicieron y que no estan embano en riot. ...","replies":[]},{"poster":"rrmijp","date":"2016-12-31T12:05:16.416+0000","up_votes":6,"down_votes":1,"body":"+10 y a favoritos lince, un año de mierda en cuanto a eventos u.u. Onda, la gente que dice que hubo eventos claramente no sabe diferencias un evento de contenido normal, el unico evento REAL que tuvimos fue el de jugar con los clubes que desbloqueaban cosas de forma individual y por equipos, despues las artesanias hextech, el mapa de nieve y demas todo muy lindo pero no es un evento ni un incentivo para jugar, es algo copado pero meh","replies":[]},{"poster":"King Dodo","date":"2017-01-04T15:10:20.066+0000","up_votes":2,"down_votes":0,"body":"Mira, yo no suelo comentar ni participar mucho de lo que es la comunidad \"social\" del juego, pero me pareció importante poder responderte y que quizás puedas tener otro punto de vista. Yo estoy terminando la carrera para ser Diseñador de Videojuegos justamente, y analizo todo lo que pasa con el LoL no solo desde el punto de vista de un jugador sino como un diseñador tambien. El laburo que hay atras de este juego es increible, y hasta el más minimo de los detalles como decidir si cambiar la velocidad de movimiento de un personaje de 1.20 a 1.25 puede llevar incluso horas de debate, armar un evento que se sienta tan parte del juego como el juego mismo pero que ademas te de la experiencia de hacer algo diferente, no me quiero imaginar, y esta gente actualiza y labura dia a dia por este juego. Sin ir más lejos, aunque este año no hubo muchos \"eventos\" trabajaron en hacer que todos los modos de juego temporales se volvieran una rotacion semanal que podes disfrutar día a día. Por lo tanto, entiendo que uno como jugador diga \"la puta, esto ya lo juge, quiero algo nuevo\". Pero si realmente te preocupa tanto el avanze y el camino que toma uno de tus juegos favoritos, deberias de ser paciente y tratar de entender justamente que ese laburo que se toma la gente de Riot día a día es lo que hace que este juego te guste tanto. In-game me la paso quejandome de los champs desbalanceados como todos, pero a la hora de hablar del desarrollo del juego, hay que aplaudir lo que lograron. Este post me encanta como Game Designer porque me permite obtener conocimientos para mis proximos trabajos por lo tanto me entristece un poco ver tantos comentarios negativos. Nada ojala lo puedas tener en cuenta. Saludos!","replies":[]}]},{"poster":"La VaGanZiA","date":"2016-12-30T19:23:50.111+0000","up_votes":54,"down_votes":2,"body":"Muy lindo el cliente, lástima que tiene que tardar tanto cada vez que haces click en cualquier botón.\r\n{{sticker:slayer-jinx-unamused}} ","replies":[{"poster":"lucpro","date":"2016-12-30T21:46:46.964+0000","up_votes":14,"down_votes":4,"body":"Ojala en el futuro no sea obligatorio usar el cliente nuevo :P{{champion:223}} ","replies":[{"poster":"SHX Alfa Y Omega","date":"2016-12-31T02:27:57.798+0000","up_votes":3,"down_votes":0,"body":"Amigo mio, lo siento, pero no por nada lo están haciendo :v","replies":[]}]},{"poster":"Mauri piola","date":"2016-12-31T02:05:16.546+0000","up_votes":6,"down_votes":0,"body":"En la pantalla para inicar sesión, si le das a \"Ejecutar cliente de Legado\" se abre el antiguo...{{sticker:slayer-pantheon-thumbs}} ","replies":[]},{"poster":"iakanoe","date":"2017-01-02T00:35:21.538+0000","up_votes":4,"down_votes":1,"body":"Que bueno que te des cuenta QUE ES UNA BETA! Las betas son para corrección de errores y eso, todavía no está optimizado.\r\n{{sticker:zombie-brand-facepalm}} ","replies":[]}]},{"poster":"FaQuLoL","date":"2016-12-30T19:25:31.160+0000","up_votes":25,"down_votes":2,"body":"A alguien mas no le caen fragmntos de llaves ? estoy hace un mes jugando casi todos los dias y ni 1 fragmento","replies":[{"poster":"Navier","date":"2016-12-30T20:07:22.754+0000","up_votes":12,"down_votes":1,"body":"Más de 15 partidas ganadas en estos últimos días y ni un fragmento {{sticker:slayer-jinx-unamused}} ","replies":[{"poster":"KShyGuy","date":"2016-12-30T22:24:02.945+0000","up_votes":4,"down_votes":1,"body":"15 games no son naaaada.","replies":[]}]},{"poster":"Lee Sin King","date":"2016-12-30T22:14:54.143+0000","up_votes":3,"down_votes":1,"body":"Hace un mes , me saque ya 3 S+ y no me dieron ni 1 Fragmento , \r\n¡NI UNO!","replies":[{"poster":"KShyGuy","date":"2016-12-30T22:25:00.891+0000","up_votes":6,"down_votes":0,"body":"No te dan fragmentos basado en tu rendimiento, solo si ganste o no...","replies":[]}]},{"poster":"G Umbra","date":"2016-12-30T20:33:42.957+0000","up_votes":3,"down_votes":0,"body":"Estan entendiendo mal como funciona el sistema, los fragmentos de llave no van por una curva de \"cuantas mas ganadas mejor o algo similar\" simplemente podes sacarlas al ganar pero cada vez que sacas una se hace mas dificil que salga la siguiente,y se reinicia al pasar un mes (creo que 1 mes desde que te salio el primer fragmento) segun lo que juego, el aproximado de fragmentos (facil, es decir que en menos de 3 victorias es probable que salga) es de 5,de ahi se vuelve muy dificil que salga.","replies":[]},{"poster":"dedoconmayo","date":"2016-12-30T20:49:43.273+0000","up_votes":2,"down_votes":0,"body":"cumpli 3 semanas ayer, jugando todos los dias, NINGUN FRAGMENTO DE LLAVE, aprox gane 50 partidas y no me a salido ninguno :c","replies":[]}]},{"poster":"sonata19","date":"2016-12-30T20:10:06.651+0000","up_votes":18,"down_votes":6,"body":"Wow. Estudio diseño y de verdad se aprecia que como empresa muestren el proceso de trabajo, que sirve no se imaginan cuanto, en la orientación y el manejo de las ideas. Buen Artículo RIOT GAUSSRIK\r\n{{sticker:slayer-pantheon-thumbs}} ","replies":[{"poster":"Tulak Hord","date":"2016-12-30T20:29:03.487+0000","up_votes":21,"down_votes":1,"body":"me das una doble con queso y triple bacon? gracias. :v\r\n","replies":[{"poster":"sonata19","date":"2016-12-30T20:31:47.656+0000","up_votes":6,"down_votes":0,"body":"jajaja","replies":[]}]}]},{"poster":"LuchoLFII","date":"2016-12-30T20:07:05.912+0000","up_votes":19,"down_votes":4,"body":"mucho cliente pero las llaves donde estan ","replies":[{"poster":"CuidadoConElTuco","date":"2016-12-30T22:52:51.461+0000","up_votes":9,"down_votes":0,"body":"en un lugar cerca tuyo en donde nunca da el sol :v","replies":[]},{"poster":"G Umbra","date":"2016-12-30T20:34:09.640+0000","up_votes":8,"down_votes":1,"body":"En tu kokoro","replies":[]}]},{"poster":"Smug Lee Main","date":"2016-12-30T21:23:17.225+0000","up_votes":16,"down_votes":2,"body":"#7Años1Icono\r\ndejense de joder y regalen cajitas, manga de amarretes!{{sticker:zombie-brand-facepalm}} ","replies":[{"poster":"TheWaffleGalaxy1","date":"2017-01-02T15:08:17.321+0000","up_votes":2,"down_votes":0,"body":"Es verdad eso de sacarte una s con un campeón es fácil pero men esperar 6 días para una caja NO SEAN RATAS Y REGALEN AL MENOS 1 POR MES >:v","replies":[]}]},{"poster":"PacificSoul","date":"2016-12-30T22:46:29.022+0000","up_votes":12,"down_votes":0,"body":"Muy lindo todo, pero.... ¿Para cuando Reclutamiento Normal?.","replies":[]},{"poster":"Skrilender16","date":"2016-12-30T19:14:04.990+0000","up_votes":4,"down_votes":20,"body":"Mae mia willy compañero, SIgan asi con este juego, lastima la comunidad de LAS pero bue xD","replies":[{"poster":"CplAmir","date":"2016-12-30T19:17:58.621+0000","up_votes":18,"down_votes":1,"body":"la comunidad de Lol en general ..... no solo LAS...","replies":[{"poster":"Marco","date":"2016-12-31T20:53:45.170+0000","up_votes":2,"down_votes":0,"body":"La comunidad de los juegos online en general xD","replies":[{"poster":"AnarD","date":"2017-01-01T09:09:29.169+0000","up_votes":2,"down_votes":0,"body":"El mundo en general{{sticker:slayer-jinx-wink}} ","replies":[]}]}]}]},{"poster":"ShieldSama","date":"2016-12-30T21:41:56.802+0000","up_votes":10,"down_votes":4,"body":"Hola, esto es un aviso cordial de parte de la comunidad de ARG(principalmente mía).Riot yo les aviso algo, si piensan que los argentinos que tengan un Pc promedio podrán utilizar el nuevo cliente a la perfección están muy equivocados porque yo tengo tengo uno promedio y me anda trabado. Ustds no se de donde les digan que hicieran esto pero, para toda la comunidad argentina( promedio) andará muy mal y dejaran de jugar porque si juegan normal nunca les tocara su linea o en ranked que no podran cambiar las mestrias. Gracias por leer y ¡un saludo!{{champion:245}} {{sticker:slayer-pantheon-thumbs}} ","replies":[{"poster":"KShyGuy","date":"2016-12-30T22:27:09.174+0000","up_votes":9,"down_votes":0,"body":"Primero, LAS no es solo Argentina. Un pc de gamma baja chileno o uno argentino, no hay diferencia. No todos los chilenos tienen buenos pc, asi como no todos los argentinos tienen malos pc's, como no todos los peruanos, y asi.\r\nSegundo, el nuevo launcher todavia no esta terminado, por eso los problemas de rendimiento.","replies":[{"poster":"DelVamoo","date":"2016-12-30T23:17:47.195+0000","up_votes":8,"down_votes":0,"body":"Pero él se refiere a que toda la comunidad de LAS está conformada por países subdesarrollados, con altos indices de pobreza y encima con unas economías mediocres. Especialmente acá en Argentina los productos electrónicos son aún más caros que en, por ejemplo, Chile.\r\n\r\nEl cliente lo hacen en NA, cualquiera en Canadá o Estados Unidos tiene una PC decente, buenos sueldos, además son baratas. Si se basan en la clase media yanki para el cliente nuevo no lo va a poder usar casi nadie acá.\r\n\r\n¿Quién tiene tanta guita como para gastarse $10.000 argentinos en algo tan banal como un PC? y ojo, que con 10k no te armás nada...","replies":[{"poster":"KShyGuy","date":"2016-12-31T00:03:26.331+0000","up_votes":3,"down_votes":0,"body":"Y mi punto es que nadie esta mas consciente de esto que Riot. Ellos saben que gran parte, y digo, GRAN parte de su comunidad no tiene buenos pc's, por que el juego en si es de bajos requisitos, por eso en varios parches hablan del GRAN problema de rendimiento del launcher, y que lo estan arreglando poco a poco cada parche. Tener en cuenta tambien de que no es su version final todavia.","replies":[]}]}]}]},{"poster":"faster51","date":"2016-12-30T20:47:30.695+0000","up_votes":2,"down_votes":1,"body":"54651pi y 99k de rp .__. los hackers dominarán el mundo y los ratas no podrán hacer nada para evitarlo ","replies":[{"poster":"KShyGuy","date":"2016-12-30T22:31:47.205+0000","up_votes":5,"down_votes":0,"body":"Es quizas porque son imagenes del PBE o de una cuenta Rioter?","replies":[]},{"poster":"RA Sámot","date":"2016-12-31T03:36:33.503+0000","up_votes":2,"down_votes":0,"body":"En el PBE puedes tener esas cantidades de PI y RP, además de que en el PBE, TODO vale 1 PI, campeones como skins","replies":[]}]},{"poster":"ChillerPet","date":"2016-12-30T20:51:18.235+0000","up_votes":8,"down_votes":3,"body":"Tengo S y no tengo caja, 14 llaves mugrientas para abrirles el cerebro y que entiendan que nos importa un rabano lo que hagan con el hextech, magia o lo que sea. No hay un evento decente, juego gratis mis polainas, no vamos a comprar una maquina pro para jugar **su** juego, sean realistas. HOLAAAAA TERCER MUNDOOOOO, HOLAAAAAAAAAAA!!!\r\nESTAN ENCENDIDOS UDS?!\r\nya ni importa la interfaz horrenda, tiene tantos errores que cada vez que juego me arrepiento de abrir el server.\r\nSi no es mucha molestia, podrian traspasar mi cuenta a quien la quiera? Tiene skins, iconos y centnelas.\r\n{{sticker:slayer-jinx-unamused}} ","replies":[{"poster":"Toramaru1","date":"2017-01-01T03:39:56.565+0000","up_votes":4,"down_votes":0,"body":"tengo 12 cajas y un fragmento de llave, estaria buenisimo que dejaran intercambiar a un amigo mio le pasa lo mismo, y busques por donde busques no hay ersonas que tengan equilibradas las cajas que ganan con los fragmentos de llave, porque o te llenan de cajas o  te llenan de llaves, esa es la cruda realidad\r\n\r\n","replies":[]}]},{"poster":"vaVav","date":"2016-12-31T00:43:58.176+0000","up_votes":5,"down_votes":1,"body":"Resumen de Novita 10/10:\r\n\r\nEl cliente es más útil y estéticamente mejor.","replies":[]},{"poster":"Qwe8","date":"2016-12-30T19:40:15.149+0000","up_votes":4,"down_votes":1,"body":"Muy lindo cliente pero el rework a Urgot? :v","replies":[{"poster":"RA Sámot","date":"2016-12-31T02:22:54.077+0000","up_votes":2,"down_votes":1,"body":"Está en la lista de Riot, pero ahora importa Warwick, luego un champ nuevo, luego Galio, y así.. Jota informa lo más rápido posible, busca por ahí c:","replies":[{"poster":"DelVamoo","date":"2016-12-31T03:56:49.165+0000","up_votes":3,"down_votes":0,"body":"Te recomiendo consultar la página de Riot: https://support.riotgames.com/hc/en-us/articles/202294884-Champion-Update-Schedule\ny adicionalmente surrenderat20, es mucho mejor, más rápido (leyendo vas a tardar menos que en un video) e informativo que ver a un gallego y encima llenarlo de plata (y se llena de plata con anuncios, por lo que te vas a tener que bancar anuncios para entrarte algo tan simple como los reworks, información que da Riot sin ningún tipo de publicidad molesta...).","replies":[]}]}]},{"poster":"Garjamas","date":"2016-12-31T03:21:16.686+0000","up_votes":3,"down_votes":0,"body":"El cliente esta genial {{champion:119}} \r\n\r\nPero mi potato computer se demora 1 año en cargar partidas {{sticker:zombie-nunu-bummed}} ","replies":[]}]}