{"poster":"[NEM SIKERÜLT KIOLVASNI]","date":"2015-08-06T18:14:50.934+0000","title":"Campeón a fondo: Charla sobre Gangplank","subforum":"Anuncios","up_votes":1,"down_votes":0,"body":"[ÜRES]","replies":[{"poster":"MalanDra","date":"2015-08-06T18:32:31.322+0000","up_votes":17,"down_votes":3,"body":"dentro de todo las heridas físicas de GP fueron leves yo la verdad esperaba que pierda un ojo y una pierna Tambien XD\r\nuna pregunta\r\ncuando GP fue dado por muerto el nivel de sus heridas solo comprometieron su brazo por que no aprovecharon esta oportunidad para incluirle un garfio que va mas acorde a la temática pirata? ","replies":[{"poster":"añlskjdasfhg","date":"2015-08-06T18:36:05.007+0000","up_votes":8,"down_votes":3,"body":"tu idea igual es buena,pero el problema es si le ponen un garfio donde va a estar su espada o su pistola ???{{champion:41}} ","replies":[{"poster":"gabymanya124","date":"2015-08-06T18:44:45.727+0000","up_votes":9,"down_votes":2,"body":"podría ser tipo un garfio pero en ves del garfio tenga la espada(yo me entiendo)\r\n","replies":[{"poster":"Kerokepker","date":"2015-08-07T01:40:20.190+0000","up_votes":10,"down_votes":0,"body":"puedo pedir una pistola lanza garfios?","replies":[{"poster":"Vicky Xipolitaki","date":"2015-08-07T21:05:17.966+0000","up_votes":6,"down_votes":0,"body":"Se imaginan una pistola que lanzara otras ~~pistolas~~ garfios? {{champion:222}} {{champion:41}} ","replies":[]},{"poster":"KingNazgul","date":"2015-08-08T03:55:15.490+0000","up_votes":3,"down_votes":0,"body":"ya hay alguien asi XD{{champion:6}}  {{summoner:2}} ","replies":[]}]},{"poster":"Fiky","date":"2015-08-06T21:48:48.300+0000","up_votes":8,"down_votes":0,"body":"pero estaría más duro que el maestruli con la espada así XD","replies":[]},{"poster":"Icycubes","date":"2015-08-06T22:00:12.697+0000","up_votes":6,"down_votes":0,"body":"Si miran bien como quedo el modelo, el brazo entero es metalico, con la espada en la mano, es decir, no puede soltar la espada, esta a modo de \"garfio\". Ademas que un pirata sin sable no es pirata, los garfios se ponen cuando pierde solo la mano para que pueda seguir \"agarrando\" cosas, moverse por las sogas del barco o agarrar a un contrincante en una pelea como si fuese una mano (esa es la fantasia pirata, pero cuando te ponen el garfio no podes mover casi el brazo con el arnes estirandote). Gangplank no perdio solo la mano, perdio hasta el el codo, asi que tiene un antebrazo metalico prendido del hombro, con el cual puede sacudir su espada, no tiene sentido un garfio chiquito","replies":[]}]},{"poster":"MalanDra","date":"2015-08-06T18:40:11.483+0000","up_votes":2,"down_votes":3,"body":"> [{quoted}](name=xXKinGBloddyS5Xx,realm=LAS,application-id=9xRiuj3T,discussion-id=1y6YAW0i,comment-id=00070000,timestamp=2015-08-06T18:36:05.007+0000)\n>\n> tu idea igual es buena,pero el problema es si le ponen un garfio donde va a estar su espada o su pistola ???{{champion:41}}\n\nno hay nada que lo obligue a segui usando espada almenos en esta Skin su garfio muy bien podria prenderse fuego ademas iria mas de la mano (valga la redundancia) con su nuevo Lore","replies":[{"poster":"ThatHorse","date":"2015-08-06T21:06:22.617+0000","up_votes":3,"down_votes":0,"body":"Los objetos mágicos no crecen en los árboles y está claro que la espada que siempre se mantiene al rojo de la forja no es nada normal. Por eso debe tener algo con que sostener su espada, que ahora se convirtió en un objeto característico de GP.","replies":[]}]}]},{"poster":"Lomba","date":"2015-08-06T19:53:14.543+0000","up_votes":7,"down_votes":2,"body":"Sigo opinando que tendría que haber perdido una pierna y rengear un poco, ademas de tener rastas como jack sparrow","replies":[{"poster":"MalanDra","date":"2015-08-06T19:57:57.366+0000","up_votes":6,"down_votes":1,"body":"lo de las rastas creo que ya es mucho ademas Graves y Tobias tienen rastas en sus nuevas Skins piratas","replies":[{"poster":"Hikariru","date":"2015-08-07T00:34:01.802+0000","up_votes":4,"down_votes":0,"body":"xD tobias... no por favor ni a el le gusta su nombre ahahahaa","replies":[]}]}]},{"poster":"Icesoul","date":"2015-08-07T00:41:33.331+0000","up_votes":4,"down_votes":0,"body":"Si bien podría ir con la temática, ¿no te parece que seria muy típico ponerle un garfio? para mí está bien como quedo, para que no siempre se haga y repita lo mismo en todo, algo diferente y más original.","replies":[]},{"poster":"Xadrax","date":"2015-08-06T22:31:38.027+0000","up_votes":1,"down_votes":0,"body":"perder un brazo no es una herida leve","replies":[{"poster":"MalanDra","date":"2015-08-07T00:14:51.969+0000","up_votes":2,"down_votes":0,"body":"para la era pirata si lo era mas que en muchos casos la medicina era peor por la falta de higiene tanto de los pacientes como de las herramientas quirurgicas de hecho gankplank sufre de escorbuto por eso su dependencia a las naranjas XD","replies":[]}]},{"poster":"soy arawea","date":"2015-08-07T00:02:36.719+0000","up_votes":2,"down_votes":0,"body":"yo pensaba que su skin de fantasma iba a ser su aspecto original :P","replies":[]}]},{"poster":"LXDance","date":"2015-08-06T19:56:38.592+0000","up_votes":10,"down_votes":9,"body":"Solamente pido que ya se termine este maldito evento en el cual todos autolockean gangplank solo por el skin horrible. \r\nY si les ganas la linea porque cantaste antes, trollean otra linea y no ayudan.\r\nOSEA nadie ve ? nos regalan eventos, skines mil modos de juegos distintos y no son capaces de arreglar el comportamiento de los jugadores. Por dios Riot Games la comunidad de LAS pide a GRITOS que vuelva a funcionar el tribunal. Incluso muchísima gente trabajaría gratis como supervisor en ese lugar ( si es que a ustedes les preocupa que se sancione sin intención). Ya no se puede ni disfrutar de un juego tranquilamente sin salir estresados, enojados y sin ninguna pisca de alivio por haber tenido un momento de recreo.\r\nSolo quería decirles eso e informarles que me voy a la MIERDA y no voy a volver nunca mas a este juego irrespetuoso en el cual nadie se preocupa por la comunidad y todos están felices, moviendo la cola y chupándole el pene al staff de riot games por actualizaciónes horribles a campeones que nadie en su vida usó.\r\n Me voy pero volveré cuando por fin hayan solucionado el respeto (osea nunca). Y nó, no es mucho pedir, ni imposible ,porque, no tienen ningún otro juego que estén patrocinando o produciendo que no sea tan grande como este y que no le den tanto artículo como League of legends.\r\nP/D: Ignoren este post porque soy solo otro unranked que no paga sus servicios ni participa en ningún evento que ustedes organizan.","replies":[{"poster":"Suajerox","date":"2015-08-06T20:51:53.868+0000","up_votes":11,"down_votes":0,"body":"esto emmm ....\r\nme das la cuenta ;:v","replies":[]},{"poster":"Superior Critias","date":"2015-08-06T21:00:26.525+0000","up_votes":5,"down_votes":0,"body":"para algo existe el creador de equipos ._.","replies":[{"poster":"Siotranoqueda","date":"2015-08-07T00:45:07.291+0000","up_votes":2,"down_votes":1,"body":"Disculpame, yo he jugado en el creador de equipos, y sí, es cierto, no tenes gente que autolockea o que te trolean en sus roles, pero aun asi, si la primera sangre es para el equipo enemigo, empiezan a decir GG, Report \"X\", me voy afk, etc. Y los resports a fin de partida valen lo mismo que 5 centavos en Argentina, o sea, nada.\r\nYo estoy harto, pero harto de reportar a jugadores con actitud negativa, los que pierden apropósito, los que flamean, o se van afk, y en la siguiente partida me vuelven a tocar en mi equipo. Eso solo, me parece una total falta de respeto. Como también me parece una falta de respeto, que en una ranked, vos decidas salir de la partida en selección de campeones y te descuenten puntos a vos y te penalicen con 5 o 15 minutos de espera, por que en tu equipo tenes a un troll o a un flamer o a alguien que sabes que juega para perder.\r\nY la gente de LAS va a seguir con esta actitud, hasta que Riot no se ponga los pantalones y empiece a sancionar a los jugadores de mala conducta, hay muchas maneras de sancionar a los jugadores y no solo con banear las cuentas. Pero a Riot no le importa los jugadores de LAS, porque no somos sus consumidores potenciales. O al menos de eso me autoconvenzo por la ausencia del tribunal y las falta de sanciones.","replies":[{"poster":"Óðr","date":"2015-08-07T01:18:32.169+0000","up_votes":2,"down_votes":1,"body":"LAS no existe para rito jajajaja no se calienten en pedir cosas imposibles. Aunque sea una mrd, hay que aguantarse las partidas horribles (aunque sean mas de la mitad) y cagarse de risa con las buenas o las remontadas.... asi es mejor y hasta empezas a ganar mas. A mi me paso.","replies":[]}]}]},{"poster":"sahpna","date":"2015-08-06T23:16:30.965+0000","up_votes":2,"down_votes":1,"body":"No puedes responsabilizar a Riot de la estupidez de la gente. Hagan lo que hagan nos vamos a seguir comportando de la misma manera porque está en nuestra naturaleza. \r\n","replies":[{"poster":"Siotranoqueda","date":"2015-08-07T00:59:19.993+0000","up_votes":2,"down_votes":0,"body":"A mi entender, el pibe, no esta haciendo responsable a Riot de la estupidez de los jugadores. Esta pidiendo que haya mas autoridad, y estoy totalmente de acuerdo con él. Los jugadores se comportan así, por la brillante ausencia de sanciones a los jugadores con estas conductas negativas. Yo creo que regalando un skin al que no flamea, no es una medida para incrementar el compañerismo. De hecho mira LAS y te das cuenta de lo que digo. Equipo que pierde, equipo que al terminar la partida dice \"Report a X\" \"perdimos por culpa de...\" siempre estamos buscando a un culpable. Eso es compañerismo? Y yo creo que si empiezan a sancionar a los jugadores de actitud negativa con restricciones de compra de campeones, dejarlos sin campeones semanales gratis para jugar, reducción de PI o anulación de bonificaciones de PI por victoria, deshabilitando las clasificatorias, esperas de 20 minutos antes de cada cola de emparejamiento, anulacion del chat dentro de la partida, y tantas otras penalizaciones que se podrían realizar, muchos, no todos, pero si muchos, dejarían de lado ese comportamiento tan asqueroso que tienen dentro del juego. Pero insisto, como no hay autoridad, no hay sanciones, la gente hace lo que se le canta.","replies":[]}]},{"poster":"Hikariru","date":"2015-08-07T00:40:03.981+0000","up_votes":2,"down_votes":0,"body":"xD ahahaha yo disfrute demasiaaaaaaado de este evento, fue la vida XD pero dios, es cierto lo de los tribunales, este juego esta demasiado lleno de enanos desagradables que autolockean, lo del skin es una pelotudes XD debieron darselo a los que ya tenian el campeon y se acabo xDDD igualnojuegotoplol","replies":[]},{"poster":"Super Speed Disk","date":"2015-08-08T00:34:23.890+0000","up_votes":2,"down_votes":1,"body":"Quien te conoce? jajaja, mas de la mitad de lo que escribiste son huevadas","replies":[{"poster":"LXDance","date":"2015-08-08T03:05:09.761+0000","up_votes":2,"down_votes":1,"body":"Y aquí tenemos el ejemplo perfecto de intolerancia que expresé en mi publicación.","replies":[]}]}]},{"poster":"Gagoca","date":"2015-08-06T22:33:05.679+0000","up_votes":6,"down_votes":0,"body":"Igual me parece extraño que si perdio su barco, la ultimate siga disparando cañonasos desde un barco :O","replies":[]},{"poster":"ElMandy","date":"2015-08-06T23:20:08.660+0000","up_votes":5,"down_votes":0,"body":"**todo muy lindo,pero no explican porque engordo de un dia para el otro :P\r\nse lo creia muerto o se fue a comer?**","replies":[{"poster":"Nakuxx","date":"2015-08-07T01:03:31.161+0000","up_votes":3,"down_votes":0,"body":"Ami me gusta mucho mas Robusto,Muestra esa parte descuidada y la poca importancia sobre lo fisico o poca higiene que tienen los piratas,Sinceramente GP me gusta mucho mas a como era antes.","replies":[]}]},{"poster":"Starman","date":"2015-08-06T18:17:33.170+0000","up_votes":7,"down_votes":5,"body":"{{item:2052}} ","replies":[{"poster":"añlskjdasfhg","date":"2015-08-06T18:22:45.084+0000","up_votes":7,"down_votes":3,"body":"{{item:2054}} ","replies":[{"poster":"feed no jutsu","date":"2015-08-06T18:25:06.656+0000","up_votes":8,"down_votes":3,"body":"{{item:2052}} ","replies":[{"poster":"MegaDelitto","date":"2015-08-06T18:36:14.479+0000","up_votes":6,"down_votes":3,"body":"{{item:2052}} ","replies":[]}]}]}]},{"poster":"B4rbieQ","date":"2015-08-06T18:53:53.692+0000","up_votes":9,"down_votes":4,"body":"**Tahm Kench:** ¿Y tu sombrero?.\r\n**Gangplank:** Eso me importa un carajo. ","replies":[]},{"poster":"pd95","date":"2015-08-06T20:28:16.152+0000","up_votes":6,"down_votes":2,"body":" \"Una de las cosas que adoro de Riot, es la flexibilidad que tenemos. Si algo no funciona y es necesario cambiarlo, siempre hay gente dispuesta a ayudarte.\" Rito please,{{champion:78}} {{champion:83}} {{champion:44}} mueren por una actualizacion hace años y dicen tener flexibilidad ","replies":[{"poster":"nadrome","date":"2015-08-06T22:21:43.175+0000","up_votes":3,"down_votes":0,"body":"creo que yo soy el unico jugador de zilean que se dio cuenta que con el cambio lo mataron , antes no estaba tan vivo que digamos , pero no lo mejoraron como debeeria ... realmente lo unico bueno que tenia era la ulti y ahora no se le puede bajar el cdr con la W... una lastima , ahora esta mas muerto que nunca","replies":[{"poster":"martinpalaveci1","date":"2015-08-07T01:20:54.881+0000","up_votes":1,"down_votes":0,"body":"para empezar...\r\nCDR es CoolDown Reduction... osea \"Reduccion de enfriamiento\" no creo que quieras bajar su cdr porque significaria aumentarle el enfriamiento.\r\nsegundo; para mi lo unico bueno que le sacaron es la q, porque antes te la plantaba, ahora solo la tira y si no la agarra tu enemigo te cabe. sin embargo, es una equilibracion que le hayan puesto que no reduzca el enfriamiento de la ulti, estaba muy roto :V","replies":[{"poster":"nadrome","date":"2015-08-17T02:19:53.697+0000","up_votes":1,"down_votes":0,"body":"SI , era cd , lo siento , siempre lo confundo. ROTO? se nota que no ocupabas el personaje , su finalidad solo era tirar la R , en late no pegaba nada pues su build constituye de cosas caras , su early no es lo suficientemente potente pues no es un soporte muy util que digamos , ademas de ser muy \"squishy\". No sabes del personaje amigo , ademas de la R lo unico bueno que tenia era el lore , pero vamos , que dentro del juego no importa si el tipo era un legendario samurai o si era un lindo y tierno explorador xd","replies":[]}]}]}]},{"poster":"FixedNX","date":"2015-08-06T21:35:41.579+0000","up_votes":1,"down_votes":2,"body":"Tendrian que arreglar que GP Aplica el efecto en area del tiamat con Parrlamentar -.-\r\n","replies":[{"poster":"Icycubes","date":"2015-08-06T22:02:08.802+0000","up_votes":3,"down_votes":0,"body":"Eso se llama \"aplicar efectos de impacto\" lo cual hacen muchas skill como la Q de shyvana, la Q de fizz, la E de evelyn, etc, no es un error {{champion:32}} ","replies":[]},{"poster":"santitupapi","date":"2015-08-07T13:41:10.368+0000","up_votes":3,"down_votes":0,"body":"Tiamat \"(solo melee)\" No te dice nada eso?","replies":[]}]},{"poster":"Livier","date":"2015-08-06T21:55:43.396+0000","up_votes":3,"down_votes":0,"body":"en mi opinión respecto al sombrero, podría haber un comando para que se lo quite, como la capucha de {{champion:107}}  cazador nocturno o los lentes de creo que la skin de oficial {{champion:254}} ","replies":[]},{"poster":"Bot Zilean Supp","date":"2015-08-06T19:33:44.828+0000","up_votes":4,"down_votes":1,"body":"¡Que vuelva el Escorbuto! ¡Que vuelva el Escorbuto!","replies":[]},{"poster":"BastardSinGloria","date":"2015-08-06T19:38:51.330+0000","up_votes":7,"down_votes":5,"body":"yo digo que estaba mejor el GP anterior! lo arruinaron!! la E no tiene mecanica en TF!! Vuelvan al viejo GP!!!{{summoner:1}} {{summoner:7}} {{champion:41}} ","replies":[{"poster":"WyrmBlanco","date":"2015-08-06T21:57:28.425+0000","up_votes":2,"down_votes":0,"body":"Yo veo mas OP al nuevo GP con la pasiva de daño verdadero con barriles para controlar la linea ahora tiene muchas mas mecanicas. Y su R que se puede mejorar y aporta a  la TF. Y no falta el que diga que no se puede farmear 1500 monedas usa la E usa la {{item:3074}}  es mucho mas facil","replies":[]}]},{"poster":"Swirl","date":"2015-08-06T18:40:33.149+0000","up_votes":5,"down_votes":3,"body":"El skin lo dan el 11/8 {{champion:41}} ","replies":[]},{"poster":"Zexceed","date":"2015-08-06T20:03:00.476+0000","up_votes":2,"down_votes":4,"body":"la verdad que a GP lo arruinaron cambiandole su E {{item:3611}} ","replies":[{"poster":"federf","date":"2015-08-06T22:21:13.191+0000","up_votes":3,"down_votes":0,"body":"es mucho mas entretenida la nueva E y ademas el daño es bastante y al no tener costo podes quedarte en linea sin mana, asi que no veo en que la arruinaron jaja","replies":[]}]},{"poster":"Vashiera","date":"2015-08-06T18:40:24.442+0000","up_votes":1,"down_votes":2,"body":"hagan una skin decente de {{champion:18}}  ","replies":[]}]}