{"poster":"[NEM SIKERÜLT KIOLVASNI]","date":"2017-03-29T21:47:11.252+0000","title":"Pregúntale a Riot: ¿Película? ¿Voz? ¿Conjuntos de objetos?","subforum":"Anuncios","up_votes":1,"down_votes":0,"body":"[ÜRES]","replies":[{"poster":"dismond","date":"2017-03-30T20:47:05.820+0000","up_votes":8,"down_votes":207,"body":"estaría bueno una película la verla una y otra ves asta pagare para ir al cine .. si pondrían al maestro yi eso seria lo máximo lloraría de la emoción {{champion:11}} \n{{summoner:14}} {{item:3153}} {{sticker:slayer-pantheon-popcorn}} ","replies":[{"poster":"Lord Torokoko","date":"2017-03-30T21:02:47.832+0000","up_votes":194,"down_votes":3,"body":"No, por favor no vayas al cine, con ese dinero nos pagaras la operación a los ojos{{sticker:slayer-jinx-wink}} ","replies":[{"poster":"Mandioca Cósmica","date":"2017-03-30T22:24:32.407+0000","up_votes":10,"down_votes":3,"body":"Honor Torokoko","replies":[]},{"poster":"KDeus","date":"2017-03-31T08:29:01.897+0000","up_votes":5,"down_votes":2,"body":"Viejo te doy 1000 dolarucos sos un genio{{sticker:slayer-pantheon-thumbs}} ","replies":[]}]},{"poster":"KR Sniper","date":"2017-03-30T21:12:36.493+0000","up_votes":62,"down_votes":1,"body":"paga por un diccionario para el bien de la comunidad :D\r\n","replies":[]},{"poster":"Ulito2","date":"2017-03-31T02:36:42.317+0000","up_votes":7,"down_votes":16,"body":"Denota que solo es un niño, dejen de ser tan duros, inmaduros y ridiculos","replies":[{"poster":"Mazer Rakham","date":"2017-03-31T10:17:22.758+0000","up_votes":23,"down_votes":3,"body":"Emmmmm, no. No es excusa. A los 10 años yo no tenía faltas de ortografía. Mi sobrino tiene 8 y sabe que el verbo VER y sus derivados se escriben con V, no con B. ","replies":[{"poster":"BJThePro","date":"2017-03-31T15:02:54.855+0000","up_votes":4,"down_votes":1,"body":"Denle un premio a ese hombre {{sticker:slayer-pantheon-thumbs}} ","replies":[{"poster":"AltoGuisoDeMono","date":"2017-03-31T17:34:01.116+0000","up_votes":8,"down_votes":1,"body":"Smithers traiga a ese hombre y hagalo vicepresidente ejecutivo{{item:3640}} ","replies":[]}]},{"poster":"Ulito2","date":"2017-04-03T02:16:20.847+0000","up_votes":4,"down_votes":0,"body":"Quien habla de excusas, vos y tu sobrino escriben bien a los 8 y 10, otros a los 6 y 4; otros a los 14, me refiero a que se le hable correctamente, no haciendo mufas y ridiculizaciones, no por tener mejor ortografía les da el derecho a ser así de arrogantes, lo único que tienen bueno es su ortografía (si es que no fingen), porque hablar con respeto 0.","replies":[{"poster":"Mazer Rakham","date":"2017-04-03T02:21:01.659+0000","up_votes":1,"down_votes":0,"body":"Yo le falte el respeto en algún momento? No. Así que no sé de qué hablas.","replies":[{"poster":"Ulito2","date":"2017-04-05T20:45:34.949+0000","up_votes":2,"down_votes":0,"body":"No hablo solo de VOS. Esta conversación no se trata de VOS y tus capacidades.","replies":[]}]}]}]}]}]},{"poster":"Fortdevol","date":"2017-03-30T21:18:09.125+0000","up_votes":73,"down_votes":1,"body":"Como las historias del lol son varias es mejor una SERIE ","replies":[{"poster":"ToraYasashi","date":"2017-03-30T22:21:19.277+0000","up_votes":16,"down_votes":2,"body":"esa es muy buena idea, esas series donde cada capitulo es una historia distinta. algo asi como lalalademacia {{sticker:slayer-jinx-wink}} ","replies":[{"poster":"ÜTA","date":"2017-03-31T19:05:50.459+0000","up_votes":4,"down_votes":0,"body":"Naaaaa de que hablan es mejor que la hagan tipo Juego de Tronos <3  te pago hbo premium por 3 años si sale otra serie asi","replies":[]},{"poster":"Lleyla","date":"2017-03-31T00:25:17.802+0000","up_votes":4,"down_votes":1,"body":"tenes razon lalademacia esta re buena estaria buena una serie como esa{{sticker:slayer-pantheon-thumbs}} ","replies":[]}]}]},{"poster":"Jnaze12","date":"2017-03-30T21:27:12.144+0000","up_votes":19,"down_votes":2,"body":"Si el chat de voz solo se pudiera usar con amigos se solucionarian los problemas de \"comportamiento\" ya que es menos probable que alguien insulte si es tu amigo y riot saldria ganando ya que le haria competencia a otros programas de comunicacion como : Discord, TS3, Curse etc\r\n","replies":[{"poster":"ToraYasashi","date":"2017-03-30T22:22:26.300+0000","up_votes":26,"down_votes":0,"body":"chat de voz con la opcion \"silenciar\" seria gg","replies":[{"poster":"MatiXRay","date":"2017-03-31T00:15:39.974+0000","up_votes":14,"down_votes":0,"body":"{{sticker:slayer-jinx-unamused}} X2, solo agreguen el \"mute\" para chat de voz y ya que tanto problema ... y para un juego tan estratégico y de equipo como este  se necesita un chat de voz, ademas el sistema de chat des concentra mucho y se pierde demasiado tiempo al escribir. ","replies":[]},{"poster":"La corrupción","date":"2017-03-31T01:24:55.855+0000","up_votes":2,"down_votes":2,"body":"Si, a lo counter, y hasta más fácil por como es la interfaz y lo poco que se usa el click izquierdo en el lol ","replies":[{"poster":"NahuelCh","date":"2017-03-31T14:40:51.429+0000","up_votes":5,"down_votes":2,"body":"Emm, el click izquierdo es para lanzar habilidades, ES necesario {{sticker:zombie-brand-facepalm}} ","replies":[{"poster":"Legaia","date":"2017-03-31T16:54:29.172+0000","up_votes":10,"down_votes":2,"body":"Todavia hay gente que usa el click izquierdo? \r\n{{sticker:zombie-brand-clap}} ","replies":[]},{"poster":"MixtxVic","date":"2017-04-01T14:02:57.060+0000","up_votes":2,"down_votes":0,"body":"Y con que click seleccionan objetos en la tienda o los cambian de lugar en el inventario?","replies":[]},{"poster":"XoZonoX","date":"2017-03-31T16:45:01.066+0000","up_votes":3,"down_votes":1,"body":"Para eso existe el smartcast.. XD hay muy poca gente que usa el click izquierdo para eso..","replies":[]}]}]}]},{"poster":"Cuchufleitor","date":"2017-03-31T05:49:55.048+0000","up_votes":1,"down_votes":1,"body":"Si es con tus amigos no hace falta, ya tenes el curse, ts o lo que sea. La idea es para poder hablar con quien normalmente no lo harias","replies":[{"poster":"NahuelCh","date":"2017-03-31T14:41:29.157+0000","up_votes":3,"down_votes":0,"body":"Pero, algunos no tienen mucha memoria en su computadora, y no pueden pagar una mejor, por eso puede venir bien.","replies":[{"poster":"Cuchufleitor","date":"2017-03-31T16:25:39.199+0000","up_votes":4,"down_votes":0,"body":"No se a cuanto te referis de memoria pero con solamente 3 gigas (cifra totalemente normal desde hace mas de 10 años, hoy lo normal es 8) deberias poder usarlo sin problemas. Ademas dudo que agregar algo asi al lol haga que sea mas amable con la memoria de tu pc solamente por que esta integrado.","replies":[]}]}]}]},{"poster":"KhaSim","date":"2017-03-31T03:09:50.389+0000","up_votes":24,"down_votes":2,"body":"y mi RECLUTAMIENTO NORMAL ?????????","replies":[]},{"poster":"19720420308","date":"2017-03-30T20:40:22.301+0000","up_votes":16,"down_votes":0,"body":"me gustaria una pelicula o serie {{sticker:slayer-pantheon-thumbs}} ","replies":[{"poster":"Sunday Holiday","date":"2017-03-30T21:45:46.596+0000","up_votes":3,"down_votes":1,"body":"Una serie estaría buena.","replies":[]}]},{"poster":"Gabriel Cai","date":"2017-03-30T22:48:36.788+0000","up_votes":5,"down_votes":1,"body":"Una Serie Es Mejor Que Una Película ","replies":[{"poster":"Demonyte","date":"2017-03-31T05:51:03.179+0000","up_votes":8,"down_votes":0,"body":"Si Seguramente Lo Sea, Por Que Escribia Asi, No? ","replies":[]}]},{"poster":"javierzuke","date":"2017-03-30T23:58:54.929+0000","up_votes":8,"down_votes":0,"body":"{{champion:17}} algun mmorpg de league of legend creo que tiene bastante material para uno ,mapa, historia, misiones ,objetos, skin ufff eventos pero con la misma grafica de la grieta actual la misma perspectiva creo q gustaria bastante sin tratar de competir con otros ya creados usando la grieta como base  seria genial","replies":[{"poster":"Soporte Técnico","date":"2017-03-31T03:51:05.732+0000","up_votes":4,"down_votes":0,"body":"La idea esta buena, pero es pedir algo ultra pesado, sea crear algo desde cero. Honestamente esta a años luz de que pase, y riot tiene muchas cosas pendientes en el juego actual.","replies":[{"poster":"Trinchante","date":"2017-03-31T16:50:18.036+0000","up_votes":2,"down_votes":0,"body":"Concuerdo, es algo muy pesado y a su vez muy amplio.\r\nPor que supongamos que hace un mmorpg donde puedas usar alguno de los más de 100 personajes de League of Legends ¿te imaginas tener que configurar cada personaje,más los objetos utilizables (Que seguramente todos querríamos que sean visibles)?\r\n\r\nSería genial, si, no lo dudo, pero sería muy pesado con muchísimo trabajo de por medio.\r\n\r\nHipotéticamente, si no usaras uno de los personajes del LoL, no sería tan llamativo, y en caso contrario si solo sacaran algunos personajes, sería algo que muchos no querrían visitar por no poder jugar con sus personajes preferidos...\r\n\r\n\r\nEs un tema amplio, a lo cual dudo mucho que se realice por parte de Riot Games , pero quien sabe, tienen una comunidad muy grande y apta, quizás fanáticos colaborarían... Sería lindo proyecto.","replies":[]}]},{"poster":"Rayitas","date":"2017-03-31T04:40:39.968+0000","up_votes":2,"down_votes":0,"body":"A mi manera de ver, Riot tiene muy poco personal para programar caracteristicas, webs, cosas del juego, etc.\r\n\r\nSiento que siempre se demoran un monton en solucionar bugs, nivelacion de campeones y sacan \"eventos\" super simples de desarrollar (simples a la vista, no dejan de ser \"Simples\")","replies":[]}]},{"poster":"Ivoron","date":"2017-03-30T23:29:53.169+0000","up_votes":6,"down_votes":0,"body":"Creo que el chat de voz bajaría el mal comportamiento, porque flammear en forma escrita es fácil y a nadie le preocupa lo que piense el otro, ya que no se conocen las caras y tal vez jamás se crucen en la vida. Pero cuando se habla con otra persona ya es distinto, se tiene más mesura y un poco más de vergüenza (salvo que seas un cararrota total y flamees a viva voz igual).","replies":[{"poster":"NahuelCh","date":"2017-03-31T14:44:24.278+0000","up_votes":2,"down_votes":0,"body":"Si, el tema es cuando tu Yasuo M7 se la pasa flammeando por el chat y no ayuda al team, y si lo ignoran/silencian, trollea.","replies":[]}]},{"poster":"Valentinelkpo25","date":"2017-03-30T21:25:52.113+0000","up_votes":5,"down_votes":0,"body":"me pareceria muy buena la idea de hacer una serie o una pelicula de LoL seria muy divertida como las mimas animaciones que hacen asi que le daria un 10 si ahcen una pelicula o una serie o yo les daria una idea de hacer varias series una de demacia otra de freljord noxus zaun etc es una buenisima idea me encantaria y hasta pagaria para ver alguna serie de LoL {{sticker:slayer-pantheon-popcorn}} me encantaria la idea seria buenisima igual sus cinematicas son buenisimas y todo su juego tambien te amo RIOT GAMES\r\n","replies":[]},{"poster":"Pedito Kun","date":"2017-03-31T00:23:24.987+0000","up_votes":4,"down_votes":1,"body":"holas yo no estoy de acuerdo con una película, para mi seria una desilusion, ya q cada uno se imagina a los personajes de una manera distinta, por ej yo veo a vi como una chica super seria y muy correcta pero decidida al momento de la pelea, pero imaginen que en la serie la hacen como copada o tierna, seria una desilucion total para mi...","replies":[{"poster":"SpidermanWaifu","date":"2017-03-31T00:50:08.259+0000","up_votes":5,"down_votes":1,"body":"aceptalo, vi es lesviana, y se tijeretean con Cait, ademas no es seria, tiene humor negro y es como un antiheroe, haciendo las cosas que hay que hacer al final de cuentas, pero con una manera distinta al tipico heroe\r\nVi, de violencia!","replies":[]}]},{"poster":"Obi Weón Kenobi","date":"2017-03-31T22:38:23.902+0000","up_votes":2,"down_votes":0,"body":"i have a boner {{sticker:slayer-pantheon-thumbs}} ","replies":[{"poster":"ZFG FAN","date":"2017-03-31T22:40:24.262+0000","up_votes":2,"down_votes":0,"body":"Somebody once told me the world is gonna roll me","replies":[{"poster":"Camila Vallejo","date":"2017-03-31T22:43:25.135+0000","up_votes":3,"down_votes":0,"body":"I ain´t the sharpest tool in the shed","replies":[]}]}]},{"poster":"Aron Shiny","date":"2017-03-31T14:25:36.462+0000","up_votes":3,"down_votes":0,"body":"mas que una pelicula, deberia ser una serie, ya lo dijeron muchos, por el formato de historias que tiene el lore de league of legends, el separarlo por episodios seria solo una adaptacion audiovisual de las historias que publican constantemente","replies":[]},{"poster":"Sebaq14","date":"2017-03-31T08:59:01.059+0000","up_votes":3,"down_votes":0,"body":"Pero si Riot si tiene más juegos, el de Blitzcrank y los poros esta chido {{champion:53}} ","replies":[]},{"poster":"Demonyte","date":"2017-03-31T05:52:58.632+0000","up_votes":3,"down_votes":0,"body":"Cinematicas como \"A New Dawn\" mas seguido serian lo mas genial que pudieran hacer. Espero que leas esto Pepe Riot!!","replies":[]},{"poster":"NHR","date":"2017-03-30T22:42:38.295+0000","up_votes":3,"down_votes":0,"body":"la verdad una película no seria lo mas conveniente, porque las películas cuanto es lo max que puede durar 2hrs o 2 1/2. y base a eso el LoL es para mas de esas horas y si es una serie que por capítulos duran 20 min o 25min hay tendríamos una las historias de cada facciones con mas detalles y cosas por ejem: al momento de un nuevo campeón dar unos pequeño teaser o algo por el estilo y estaría mas tiempo que duraría años ejem: dragón ball, naruto, etc.... {{sticker:slayer-pantheon-thumbs}} ","replies":[]},{"poster":"Ribon","date":"2017-03-30T22:42:07.294+0000","up_votes":3,"down_votes":0,"body":"Buenas, esto mas que una pregunta es mi punto de vista ante la situacion del chat de voz en LoL, comparandolo con CSGO en donde las partidas son igualmente intensas y divertidas, el chat de voz es una herramienta clave ya que te permite directamente relacionarte con personas del resto de la region. Juro, que nunca me divierto mas que cuando me toca con un chileno, un argentino y un brasilero, ustedes se imaginaran \"Caos total, insultos xenofobos, discuciones constantes\" pero lo que en realidad pasa el 90% de las partidas es que todos terminamos charlando y riendonos. Cuando el 10% de esas partidas aparece es cuando 1 de los 5 jugadores tiene una mala actitud, hasta que el resto lo calma sin ningun tipo de insulto.\r\nDe verdad creo que un chat de voz integrado a League of Legends le daria mas vida al juego, seria una experiencia increible y estoy mas que seguro de que afectara positivamente al comportamiento de esta comunidad. \r\nDesde ya gracias por ser una empresa tan unida directamente a la comunidad y no tanto en vaciar los bolsillos de los jugadores (Tengo una skin gratis por mes con el sistema Hextech).","replies":[]},{"poster":"IVO723","date":"2017-03-30T21:26:04.272+0000","up_votes":4,"down_votes":3,"body":"estaria bueno que cada 2 o 3 semanas, puedas regalar una llave o cofre hextech a un amigo y que por regalar algo te den alguna bonificacion o una especie de premio{{champion:412}} ","replies":[]}]}