{"poster":"[NEM SIKERÜLT KIOLVASNI]","date":"2017-01-05T15:58:56.065+0000","title":"Torneo de Apertura: 10 bloqueos en profesional","subforum":"Anuncios","up_votes":0,"down_votes":0,"body":"[ÜRES]","replies":[{"poster":"maxtheripper","date":"2017-01-05T19:15:22.159+0000","up_votes":5,"down_votes":47,"body":"Creo q es de las pocas cosas que me gusta\r\npero ya sabemos lo q se va a banear en bronce\r\nYi, Yasuo, Zed, Vayne, Lee sin (aun q todos lo usan mal engeneral xD) Rengar,  Talon, Leblanc y bue esos champs, si se jugaban poco ya dense idea jaja","replies":[{"poster":"Riot Maggical","date":"2017-01-05T21:05:22.664+0000","up_votes":44,"down_votes":2,"body":"Esto es solamente para los profesionales y semiprofesionales :)","replies":[{"poster":"vaVav","date":"2017-01-06T00:50:39.275+0000","up_votes":66,"down_votes":3,"body":"El chico no se equivocó, en bronce están todos los profesionales que claro, no salen por los trolls y afk.","replies":[{"poster":"Nextilius","date":"2017-01-10T20:12:10.068+0000","up_votes":2,"down_votes":2,"body":"si están ahí es por su culpa, que trolls ni que afks, si uno no se preocupa por mejorar uno mismo, y se la pasa pensando en lo que hacen los demas no va a hacer nada y van a quedar en bronce/plata para siempre","replies":[{"poster":"vaVav","date":"2017-01-10T20:27:43.451+0000","up_votes":3,"down_votes":1,"body":"No entendiste el sarcasmo..","replies":[{"poster":"Nextilius","date":"2017-01-20T01:05:46.710+0000","up_votes":1,"down_votes":0,"body":"en realidad no lo entendí :v, no entiendo el sarcasmo escrito","replies":[]}]}]}]},{"poster":"LTS Du Couteau","date":"2017-01-06T01:55:21.747+0000","up_votes":2,"down_votes":1,"body":"hay algo que no entendi :v, esto va a ser solo para profesional y semiprofesional siempre, o luego si ven que funciona lo van a implementar en todas las ligas?","replies":[{"poster":"Riot Maggical","date":"2017-01-06T03:09:38.935+0000","up_votes":11,"down_votes":0,"body":"La palabra siempre no es de nuestras preferidas. Si a futuro creemos que esto es bueno para las partidas regulares entonces podemos considerarlo, pero de momento creemos que no es adecuado por las razones que explicamos en el artículo.","replies":[{"poster":"Liliths","date":"2017-01-06T07:45:38.834+0000","up_votes":21,"down_votes":3,"body":"Ufff, no tendria que ver Yasuos nunca mas, lastima que tengo que jugar Blindpick si no quiero rankear... y por lo tanto jugar con 40 Yasuos por dia.\r\nGRACIAS por eliminar Reclutamiento Normal","replies":[]},{"poster":"Derillo","date":"2017-01-06T09:48:07.054+0000","up_votes":5,"down_votes":0,"body":"Y que pasa si antes de entrar en la cola de emparejamiento vos ya podrías seleccionar un posible Campeón para cada rol, y además un bloqueo para cada caso, digamos: \r\nPrimario: Orianna - Bloqueo syndra, \r\nSecundaria:  Gnar - Bloqueo Vayne\r\n\r\nObviamente que esto es una idea, hay que ver como se ajusta porque se presentas muchas trabas en el camino para que sea viable esta propuesta.\r\n\r\nSe comprendio?\r\nLo digo en base al Articulo que menciona que el tiempo desde el PLAY hasta jugar es largo. Eliminas la primera parte de espera de selección, alargas 10 segundos a cada jugador para confirmar, pero igualmente restan 90 segundos al sistema anterior.","replies":[]}]}]}]},{"poster":"CuidadoConElTuco","date":"2017-01-05T23:32:40.262+0000","up_votes":1,"down_votes":0,"body":"encerio se banea talon en bronce? yo cuando veo que lo banean me parto de risa por que normalmente no sirve en esa liga :v","replies":[{"poster":"Nubbian","date":"2017-01-06T00:18:59.494+0000","up_votes":2,"down_votes":0,"body":"No saben jugarle el trade en fase de lineas a Talon, en Bronze sale rentable, te lo dice un bronze asjdasjdjas ","replies":[{"poster":"The Deathstroker","date":"2017-01-06T01:16:33.302+0000","up_votes":4,"down_votes":2,"body":"y si sale tan rentable porque aun estas en bronce?","replies":[{"poster":"Zarkoy","date":"2017-01-06T02:12:18.298+0000","up_votes":35,"down_votes":0,"body":"Porque le banean a talon :V","replies":[{"poster":"Nubbian","date":"2017-01-06T13:51:15.357+0000","up_votes":3,"down_votes":0,"body":"Jajajajjaja :V {{item:3070}} {{champion:91}} ","replies":[]}]}]}]}]}]},{"poster":"Lucrexio","date":"2017-01-05T20:29:25.977+0000","up_votes":41,"down_votes":4,"body":"Le banean los 10 campeones q usa Faker y va a terminar jugando con Urgot XD","replies":[{"poster":"vaVav","date":"2017-01-06T00:50:02.746+0000","up_votes":19,"down_votes":0,"body":"Que te pasa con mi Urgot wachin?","replies":[]},{"poster":"Im sørry","date":"2017-01-05T22:39:43.056+0000","up_votes":4,"down_votes":2,"body":"10 campeones que usa faker? El ha llevado campeones que en teoria no son mid, debe ser el jugador con mas champ pool del mundo o no los has visto en korea con yi mid o en la lcs con olaf mid ","replies":[{"poster":"CuidadoConElTuco","date":"2017-01-05T23:36:35.337+0000","up_votes":2,"down_votes":6,"body":"en mid se puede jugar cualquier cosa nomas debes saber hacerlo.hace mas o menos 2 season me toco jax mid en 2 partidas seguidas,me ganaron y cuando fui a probar jax mid me dejaron con kda negativo :v","replies":[{"poster":"KzG Arconte","date":"2017-01-06T05:07:45.325+0000","up_votes":10,"down_votes":0,"body":"No sabia que tu jugabas competitivo profesional. ¿quien eres? ... ","replies":[{"poster":"CuidadoConElTuco","date":"2017-01-06T17:33:55.761+0000","up_votes":2,"down_votes":1,"body":"{{item:3136}}","replies":[]}]}]},{"poster":"KoLAS","date":"2017-01-06T01:01:14.280+0000","up_votes":8,"down_votes":4,"body":"1. faker tiene uno de los mejores champs pool del mundo, pero no es el mejor.\r\n2. faker nunca estuvo en la LCS, lo hiso en el mundial.\r\n3. porque serian 10  bans? no creo que skt bane 5 campoens para su propio mid\r\nlo digo con el mayor respeto. salu3.","replies":[{"poster":"sebajarag","date":"2017-01-06T05:22:21.229+0000","up_votes":4,"down_votes":1,"body":"Amigo, faker puede jugar lo que sea. Ha jugado más de 40 campeones en mid y la mayoría de ellos con win rate sobre 50%. Yo me arriesgaría a decir que tiene la mejor champion pool del mundo jaja. Y yo creo que el amigo de arriba dijo lo de los 10 champs como exageración para dar a entender que aunque puedas banearle 30 champs a faker aún así va a terminar jugando otra cosa, y posiblemente carreando XD. Con el mayor respeto, salu4.","replies":[]},{"poster":"Soyd X","date":"2017-01-06T23:15:56.405+0000","up_votes":3,"down_votes":1,"body":"\"faker nunca ha estado en la LCS\" \r\nHAHAHAHA la LCK es 10 veces mas competitiva que la LCS","replies":[{"poster":"Jotapex101","date":"2017-01-08T23:03:25.830+0000","up_votes":1,"down_votes":0,"body":"Lo dijo por que el tipo este dijo que faker ocupo olaf en la LCS lo cual no es cierto no es que ponga la LCS sobre la LCK.","replies":[]}]}]}]},{"poster":"Loko Aston","date":"2017-01-06T04:46:32.844+0000","up_votes":5,"down_votes":0,"body":"faker ya ha jugado con urgot en competitivo\r\n\r\n","replies":[]},{"poster":"diovii","date":"2017-01-06T04:26:50.606+0000","up_votes":2,"down_votes":0,"body":"igualmente se va a fedear y va a carrear\r\n","replies":[]},{"poster":"rokushoger","date":"2017-01-09T13:46:08.973+0000","up_votes":1,"down_votes":0,"body":"Da igual, ese tipo va vayne ap y les parte la cara igual U.U","replies":[]}]},{"poster":"esparalinaco","date":"2017-01-06T01:05:48.692+0000","up_votes":19,"down_votes":0,"body":"Que hagan un juego  normal en el que eliges tu linea y bloqueas así como en ranked, ah no que exisitía y se llamaba normal reclutamiento y lo borraron :,v","replies":[{"poster":"Soyd X","date":"2017-01-06T23:16:44.303+0000","up_votes":1,"down_votes":3,"body":"juega ranked flex, es exactamente lo mismo","replies":[{"poster":"PetitTournesol","date":"2017-01-08T18:48:58.376+0000","up_votes":2,"down_votes":0,"body":"No es lo mismo u.u\r\n","replies":[]}]}]},{"poster":"Roy318","date":"2017-01-05T20:22:25.058+0000","up_votes":8,"down_votes":1,"body":"Me gusta mucho la idea. Cuando lo leí, me acordé de la partida entre Fnatic y TSM en el All Star en 2015, que se banearon 6 top, Dyrus creo que pickeo un gnar y Huni una Cassio. Todos pensamos que era gg izi. Pero la Cassio de Huni la rompió gracias a la ayuda de Reingover. Esas cosas se van a poder ver mas seguido, gracias a esto. Felicitaciones.","replies":[]},{"poster":"fn chaca","date":"2017-01-05T22:20:16.066+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"xXxproyectoxXx","date":"2017-01-06T00:19:31.667+0000","up_votes":6,"down_votes":0,"body":"hay mas de 135 champ en league of legens y en este ultimo mundial cuantos champs fueron usados.... esos 2 baneos en media selec hace que la cantidad de champs a utilizar sea mas alta pues triplicara el numero de estrategias organizadas por el equipo... la mejor idea que pudo tener rito esto hace mas interesante los proximos torneos ","replies":[]}]},{"poster":"Sobredosis","date":"2017-01-05T22:33:00.616+0000","up_votes":2,"down_votes":1,"body":"semiprofesional se refiere a los torneos que se organizan o a las ligas altas en LoL (Diamante, Maestro, Retador)?","replies":[{"poster":"PanchoSickHD","date":"2017-01-05T23:37:05.364+0000","up_votes":4,"down_votes":3,"body":"Semipofesional creo que es la IWCQ (?) y los torneos que se organzan es el \"juego organizado\" xd","replies":[{"poster":"ScreaaM","date":"2017-01-06T00:00:46.965+0000","up_votes":6,"down_votes":0,"body":"SemiProfesional es Circuito de Leyendas (liga se ascenso a Copa Latinoamerica Sur)","replies":[{"poster":"Riot Maggical","date":"2017-01-06T03:14:31.684+0000","up_votes":3,"down_votes":0,"body":"Exactamente esto.","replies":[]}]}]}]},{"poster":"MID Madness","date":"2017-01-05T21:40:45.603+0000","up_votes":4,"down_votes":1,"body":"Cuando usaran el nuevo cliente los profesionales? no es muy estetico que sigan usando el draft del cliente viejo","replies":[{"poster":"Riot Maggical","date":"2017-01-05T22:01:32.576+0000","up_votes":7,"down_votes":1,"body":"En esta nueva temporada ya usaremos el nuevo cliente :)","replies":[]}]},{"poster":"Annihilate","date":"2017-01-05T22:51:23.483+0000","up_votes":3,"down_votes":1,"body":"No lo pondrán algún día para las rankeds comunes de la gente?  A día de hoy con más de 130 campeones, 6 bans a mi opinión se quedan muy atrás :c ","replies":[{"poster":"Riot Maggical","date":"2017-01-06T03:14:57.111+0000","up_votes":4,"down_votes":0,"body":"El artículo lo explica.","replies":[]}]},{"poster":"Eowolith","date":"2017-01-06T03:08:44.561+0000","up_votes":4,"down_votes":0,"body":"Faker con ww mid new meta , dale que ya quiero ver ese ww mid en bronce ","replies":[]},{"poster":"Alfa Pasta","date":"2017-01-06T02:36:38.797+0000","up_votes":4,"down_votes":0,"body":"a la reducida pool champ de huhi le disgusta este post xd","replies":[]},{"poster":"KSTC Psycho Soul","date":"2017-01-06T01:33:25.744+0000","up_votes":4,"down_votes":2,"body":"esta buenísima la idea, en especial porque permitirá que hayan mas campeones nuevos o nuevas estrategias....Pero seria bueno un sistema (para los torneos) que haga que en una fase, por ejemplo cuartos de final, si un equipo ganó usando tales campeones, en su siguiente partida tengan por defecto 2 baneados( 2 de los 5 que usaron) o 1, impidiendo asi que se repitan una y otra vez los mismos campeones, estamos hablando de jugadores profesionales, incluso los que llegan a nivel mundial, tienen q saber usar mas champs que solo los del meta...se vuelve un circulo vicioso realmente insoportable, este mundial, ver las partidas era aburrido en algunos casos, porque ya sabias que iban a pikear o que estrategia tratarían de usar solo viendo los picks ( que por cierto eran casi el 80% de las veces los mismos 10 champs con algunas variaciones).....\r\nEsta bien que se usen champs meta, todo de acuerdo, pero no TODO EL DICHOSO MUNDIAL...son jugadores espectaculares, con habilidades notorias y verlos jugar es genial, pero que puedan mostrar sus cualidades mas alla de los meta champs, y demostrar si son el tipo de jugadores que tiene una champ pool mas alla de 4 campeones ( de los cuales 3 son meta normalmente) o simplemente son proplayers que si les baneas 3 champs se van al carajo y son peor que un bronce practicando con oros xD\r\n\r\nCreo que seria bueno ver este sistema dentro de un tiempo, haciendo que los blockeos y pikeos a través de un torneo sean mucho mas tácticos y que tengan que tomar decisiones y riesgos a la hora de elegir un campeón o una formación especifica; quizás cuantas sorpresas nos den ( Como el hecarim midlane que saco seiya en la final de la copa latinoamerica en 2014 contra FG, o el olaf de faker en mid contra BKT en 2015 en fase de grupos, momentos que uno realmente aprecia y disfruta )\r\n\r\nun saludo , sigan asi :)","replies":[{"poster":"Riot Maggical","date":"2017-01-06T03:14:04.808+0000","up_votes":5,"down_votes":1,"body":"Yo creo que eso es intentar forzar las cosas y seguramente haría que el espectáculo y calidad del mismo baje. Es imposible pensar que un jugador profesional pueda dominar a alto nivel más de 5-8 campeones, por una cuestión de tiempo, eso pasa en todos lados incluso en Corea. Hacer algo como lo que propones hará que se terminen jugando campeones con los cuales quizás no tengan tanta práctica y la calidad de juego, que se supone que en un Mundial debiera ser la más alta de todo el año, se vería afectada. Eso no es algo que nos podamos permitir.\r\n\r\nNo está mal que los profesionales usen los mejores y más fuertes campeones. En cualquier deporte pasa algo similar. Si de repente por el tiempo de jugadores que tenés en tu equipo de fútbol te da resultado o es mejor 4-4-2, no me parece bien que venga la FIFA y te obligue a jugar 5-3-1-1, eso va a afectar tu juego y la calidad del espectáculo... ¿Te imaginas algo así en el Mundial con la selección de Argentina, Brasil, Alemania o quien sea siendo obligada a jugar de una manera que no le conviene o no explota al máximo la capacidad de sus jugadores?\r\n\r\nSí, esto es un juego, pero cuando pasamos a nivel profesional y al ámbito competitivo más grande e importante del año, creo que realizar cambios u obligar a los equipos a estas cosas solamente perjudicaría la calidad de las partidas y el torneo, algo que nunca vamos a hacer y esta en contra de todo lo que creemos es bueno para el deporte que estamos creando y amamos tanto.\r\n\r\n¡Un abrazo!","replies":[]}]},{"poster":"kriz smile","date":"2017-01-06T02:32:06.454+0000","up_votes":1,"down_votes":0,"body":"yasuo y zed ya no van a existir en las clsaificatorias jajajajja","replies":[{"poster":"RNGesus","date":"2017-01-06T02:55:18.863+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=kriz smile,realm=LAS,application-id=9xRiuj3T,discussion-id=UGzQidHQ,comment-id=001b,timestamp=2017-01-06T02:32:06.454+0000)\n>\n> yasuo y zed ya no van a existir en las clsaificatorias jajajajja\n\nyasuo ya no existe, ahora vamos a pdoer banear a todos los rotos del parche casi, a ver con que juegan .","replies":[{"poster":"kriz smile","date":"2017-01-06T15:32:52.473+0000","up_votes":3,"down_votes":0,"body":"exacto, ahora la mayoria tendra que aprender a usar distintos campeones jajajajja {{sticker:slayer-pantheon-thumbs}}","replies":[]}]}]}]}