{"poster":"[NEM SIKERÜLT KIOLVASNI]","date":"2016-11-09T17:58:56.250+0000","title":"Ganadores cosplay: ¡Alaben al Teemonio!","subforum":"Anuncios","up_votes":1,"down_votes":4,"body":"[ÜRES]","replies":[{"poster":"Duk","date":"2016-11-09T18:58:53.555+0000","up_votes":15,"down_votes":2,"body":"La verdad, cada vez mejor los cosplays que hacen. los felicito","replies":[]},{"poster":"Josep Wardiola","date":"2016-11-09T19:40:57.685+0000","up_votes":15,"down_votes":6,"body":"Premios a los mejores en usar photoshop.\r\n\r\nMalisimo.\r\n\r\nSheinitaQueen  \r\n\r\nx2\r\n\r\nDe todas maneras, bastante mal la selección, el primer puesto de Nadia, exelente cosplayer pero... es la copia del splash art de annie gotica, creo que la idea era otra...\r\n\r\nPor otro lado, para mi el premio iría para Sona, es genial, después, el tercer puesto.. le ponen \"muy bien Viktor que bla bla...\" y el cosplay es de Malzahar, y se parece a más a Thresh. Pónganse de acuerdo, o el jurado no sabía que era de Malzahar? osea, es poco claro, inconcluso.\r\n\r\nEl de karthus, que ni parece Karthus... Al menos no al de la skin.\r\n\r\nEl de veigar, el 5ª puesto.. Veigar? Cosplay? Donde? ni se ve la persona ni el traje, es todo Edición de fotografía y ustedes mencionaron que el traje debería de verse bien en la fotografía y sin retoques raros que no sean brillo/contraste/etc..\r\n\r\nEl teemonio, really? es un imp xD la idea del ritual? en donde?\r\n\r\nEl de Tristana, junto al de Sona, LEJOS, los mejores.\r\n\r\n\r\nPD: Que no se mal entienda, el primer puesto es muy bueno, pero me parece que el podio no está bien representado, y hubieron otros mejores que quedaron afuera...\r\n\r\n\r\n","replies":[{"poster":"Natosa","date":"2016-11-09T19:47:19.771+0000","up_votes":4,"down_votes":0,"body":"Holi habla el \"la\" karthus xD. En la foto puse que era basada en el splash art antiguo de Karthus <3. Besitus","replies":[{"poster":"Josep Wardiola","date":"2016-11-09T19:52:55.934+0000","up_votes":2,"down_votes":5,"body":"Hola \"la karthus\" XD sí, sé de cual splash art esta basado, pero pensé que buscaban más creatividad y adaptación al harrowing, no un skin ya pre-establecido.\r\n\r\nAún así, el color es violeta y usá más tela así te queda como un traje holgado, y no apretado, más suelto, le falta volumen! probá mejorando eso y el color, se va a ver mucho mejor, suerte! ","replies":[{"poster":"fiascolors","date":"2016-11-09T19:59:20.720+0000","up_votes":4,"down_votes":0,"body":"Hola si revisas las bases no era requisito fuera una skin inventada. La elección de los ganadores fue por un conjunto de aptitudes, todas ellas las puedes encontrar en las bases. Y algo sumamente importante al ser un concurso fotográfico, estas tenían mucha importancia ya que valía el 50% de la evaluación, siendo evaluando varios aspectos como: Locación, composición, calidad fotográfica y de edicion.\r\nTe invito a revisar las bases ya que todos los concursantes sabían como serian evaluados.\r\nSaludos.","replies":[]}]},{"poster":"KingsglaiveRagna","date":"2016-11-10T05:43:45.007+0000","up_votes":2,"down_votes":0,"body":"oye pero sera que no conocieron el splash art de esa skin porque casi nadie la tuvo, creo que tambien era una de las pocas skin que casi nadie noto el cambio xd igual buena el cos del huesudo xd","replies":[{"poster":"Natosa","date":"2016-11-11T21:12:02.579+0000","up_votes":3,"down_votes":0,"body":"jaja muuuchas gracias! :D","replies":[]}]}]},{"poster":"Riot Nebo","date":"2016-11-09T19:52:19.544+0000","up_votes":3,"down_votes":1,"body":"Hola ^^\r\n\r\nEl problema fue de edición mía en el texto, ya fue corregido, gracias por notarlo y reportarlo.\r\n\r\nSobre la selección, muchas gracias por tus opiniones.\r\n\r\n\r\n","replies":[{"poster":"Josep Wardiola","date":"2016-11-09T19:54:35.721+0000","up_votes":2,"down_votes":1,"body":"De nada! lo que sí, las próximas veces estaría bueno que fueran más claros con lo que buscan, ya que uno no sabe hasta que punto se busca edición, y hasta que punto la fotografía, y hasta que punto la parte del cosplay / creatividad o idea de lo que se busca expresar, después hay muchos que hacen cualquier cosa y no se entiende bien el criterio de selección por lo mismo.\r\n\r\nSaludos!","replies":[]}]},{"poster":"Sonic Kutter","date":"2016-11-10T00:24:14.715+0000","up_votes":2,"down_votes":1,"body":"podriamos hacer una encuesta sin mostrar el nombre del personaje y sin dudas nadier diria q el malzahar es malzahar ... podria ser cualquier otra cosa ...\r\n","replies":[]},{"poster":"SagittaAurum ","date":"2016-11-09T21:48:31.360+0000","up_votes":2,"down_votes":1,"body":"Yo soy el veigar y te sugiero que leas bien las bases antes de.\r\n<3 saludos ","replies":[]}]},{"poster":"SheinitaQueen","date":"2016-11-09T19:57:58.985+0000","up_votes":3,"down_votes":3,"body":"Dice que la foto de Annie se ve de un angulo como \"si la estuieran espiando\" pero.. habian mejores, en la foto del puente de teemonio tirando a jinx luego de haberla matado, era muchisimo mas escenica. Ganaron los que saben hacer mas photoshop que cosplay, y las fotos tomadas en sus casas. ","replies":[{"poster":"Sushi de merca","date":"2016-11-09T20:55:24.411+0000","up_votes":9,"down_votes":1,"body":"¡Hola! ¿Qué tal? Antes que nada, tu foto fué muy buena. Me agradó mucho tu Teemonio! Pero creo que hubo un error de interpretación de la tarea asignada. Te invito que releas la temática puntual del concurso y su reglamento. \r\nEn el mismo aclara, y cito textual:\"puesta en escena en la que _tu personaje esté trabajando en un rito de invocación_\". Es pretencioso pensar que por meramente elegir un puente para tomar la foto se transmita automáticamente la idea de que allí se esta llevando a cabo un ritual, más inclusive cuando los personajes no tienen una historia junta, ahí yace parte de la consigna para este concurso, crear esa historia. A su vez, la escenografía se compone por muchas más cosas de las que planteas. Que sea un lugar al aire libre no lo hace más o menos escénico. Requiere de otras cosas como: _objetos relacionados al personaje_, luz, etc. \r\nEn cuanto a la edición, me gustaría inculcarte algo de información sobre mi persona, ya que la que tenes es equívoca. Se hacer **más cosplay**, lo cual podes ver [acá](http://las.leagueoflegends.com/es/news/community/community-spotlight/cosplayer-de-leyenda-reznikov), de la vaga idea que tengo de photoshop, por no decir que mi conocimiento es nulo. Por ello a lo que edición respecta todo el crédito se lo lleva pura y exclusivamente la profesionalidad de **mi fotógrafo**. \r\nQuiero de paso aclarar que si observas detenidamente no hay simplemente \"cacharros\". Soy una persona muy detallista (si viste el link que dejé, sabes de lo que hablo) No dejé nada colocado ligeramente, ni al azar. Quería contar una historia puntual, la cual podes leer en el comentario de la foto. \r\n_Dato de color:_ la idea original fue realizar la foto en un bosque, pero a ambos nos pareció que no alcanzaríamos el nivel de detalle que buscábamos. Así que nos embarcamos con este nuevo concepto y tuvimos lo que fué una larga búsqueda de locaciones en Buenos Aires hasta dar con un altillo que estuviera al alcance de las expectativas para nuestro trabajo. Añejo, desgastado y muy empolvado, ideal para nuestro concepto. Hasta cierto punto peligroso dada la antigüedad de las maderas. Estuvimos largas horas limpiando la parte en la que irían los objetos, y colocándolos a base de prueba y error.\r\nNo se si es el primer concurso fotográfico en el que participas, pero en mi primera vez, creía que había planteado una buena idea pero no quedé en ningún lugar D: De todas formas me sirvió, porque aprendí de mis errores y trabajé más arduamente para el siguiente, y rindió sus frutos ¡A no desanimarse!\r\nTe deseo un buen día, y espero que esto haya aclarado un poco el panorama.\r\n¡Saludos!","replies":[{"poster":"SheinitaQueen","date":"2016-11-09T21:08:05.107+0000","up_votes":2,"down_votes":5,"body":"Sabes que? Vos estas entre esos chicos de los cuales le hable al chico de riot, a los cuales llame \"buenos cosplayers con escenarios presentables\" al igual que el otro chico que hizo de teemonio y demas.. nunca dije algo en tu contra. hablaba mas por veigar u otros. Que ni se ven, no entiendo como pueden ver detalles materiale y eso. Y hay chicos que ganaron premios que tenian kilos de photoshop y fotografia no profesional. no te sientas tocada, no hablaba de vos. Y no veo que hayan descalificado a gente por no ponerse a alabar un pentagrama. La foto tenia que ser aterradora y con tematica harrowing. .-.","replies":[{"poster":"Hikaryu","date":"2016-11-10T05:14:36.847+0000","up_votes":4,"down_votes":1,"body":"> Dice que la foto de Annie se ve de un angulo como \"si la estuieran espiando\" pero.. habian mejores\r\n\r\nNo, por supuesto que no hablabas de ella. ¿Cómo pudo sentirse identificada con tu comentario? Lo único que hiciste fue especificarla ._.U\r\n","replies":[]}]}]},{"poster":"fiascolors","date":"2016-11-09T20:07:23.481+0000","up_votes":2,"down_votes":0,"body":"Hola.\r\nSi revisas las bases parte importante del concurso es que es uno fotográfico, por lo tanto la fotografía vale el 50% del puntaje.\r\nPara premiar a los mejores cosplay como tal están los concursos presenciales, de todas formas como cosplayer olvidamos muchas veces que la fotografía es algo muy importante ya que es la única manera de darnos a conocer de manera online, al ser League of Legends una comunidad y juego online es razonable darle importancia a esto.","replies":[{"poster":"SheinitaQueen","date":"2016-11-09T20:10:11.478+0000","up_votes":1,"down_votes":2,"body":"Y entonces por que hacen ganar a Personas con cosplays re simples y con fotos caseras llenas de photoshop y no a los que se esforzaron y tienen fotos mucho mejores sin cosas digitales.","replies":[{"poster":"fiascolors","date":"2016-11-09T20:14:37.752+0000","up_votes":2,"down_votes":0,"body":"La evaluación es 50% y 50%, te invito a que revises las bases donde se nombran todos los criterios a evaluar.\r\nLa suma de todos ellos arrojo este resultado por puntaje.\r\nDe todas formas la edicion fotográfica estaba permitida, así que esta no es un motivo de descalificación.\r\nEspero esto despeje tus dudas c:","replies":[{"poster":"SheinitaQueen","date":"2016-11-09T20:18:32.633+0000","up_votes":4,"down_votes":3,"body":"No estoy hablando de que los descalifiquen, pero si es como decis \"50% del puntaje por la fotografia\", \"concurso de fotografia\", entonces por que premian como mejor fotografia a los que son mas edicion que fotografia profesional. Hay chicos que se molestaron a ir a paisajes lindos con fotografos profesionales  y tomaron buenas fotos y cosplays bastante lindos y van y premian a uno que ni se le ve el cosplay y todo lo demas son cacharros de su casa y photoshop.","replies":[]}]}]}]}]},{"poster":"Hnk Kenshiro","date":"2016-11-09T20:16:43.854+0000","up_votes":5,"down_votes":1,"body":"Veigar parece más un super dibujo que un cosplay.","replies":[{"poster":"Josep Wardiola","date":"2016-11-09T21:02:02.055+0000","up_votes":2,"down_votes":1,"body":"Totalmente\r\n","replies":[{"poster":"SagittaAurum ","date":"2016-11-09T21:46:35.854+0000","up_votes":3,"down_votes":1,"body":"Curiosamente c: la unica edición de la fotografia es la luz y el humo. \r\nsaludos \r\nSagitta8aurum{{sticker:slayer-jinx-catface}} ","replies":[]}]}]},{"poster":"resnov15","date":"2016-11-09T19:27:38.386+0000","up_votes":5,"down_votes":1,"body":"El de Sexy Teemo es el mejor ","replies":[{"poster":"Dora07","date":"2016-11-09T20:39:24.020+0000","up_votes":2,"down_votes":0,"body":"~~Perturbador~~  **Sexy**","replies":[]}]},{"poster":"Kamado Monjiro","date":"2016-11-09T20:30:26.646+0000","up_votes":3,"down_votes":0,"body":"a veces yo no sé porque sigo intentando xD  \r\nFelicidades a los ganadores!! :3 ","replies":[{"poster":"Natosa","date":"2016-11-10T02:52:33.145+0000","up_votes":3,"down_votes":0,"body":"era mi sexta vez intentandolo xD! hasta que lo logré","replies":[{"poster":"Kamado Monjiro","date":"2016-11-11T02:05:54.890+0000","up_votes":3,"down_votes":0,"body":"siii natoo felicidades n-n  ","replies":[]}]},{"poster":"Hormiga","date":"2016-11-10T01:01:33.417+0000","up_votes":2,"down_votes":0,"body":"Esta bien, esa es la actitud! y es lo que hace a una persona fuerte el nunca rendirse y seguir adelante!","replies":[]}]},{"poster":"Xiome","date":"2016-11-09T19:59:44.261+0000","up_votes":3,"down_votes":0,"body":"Oh, me han puesto 'Xioma' en vez de 'Xiome', por favor puede corregir esa pequeña letra? Muchas gracias! XD \r\nQue buenos cosplays! Muy geniales todos y que buen concurso!!! Me encanto haber participado ","replies":[{"poster":"Rayitas","date":"2016-11-09T21:07:06.498+0000","up_votes":1,"down_votes":0,"body":"Tendrias que citar a Riot Nebo en un comentario...\r\n\r\nObviando la belleza... no te dio miedo colgarte de cabeza con esas velas o no eran velas ¿?","replies":[{"poster":"Xiome","date":"2016-11-09T22:49:58.142+0000","up_votes":2,"down_votes":0,"body":"Si eran velas, lo único agregado fue la luna pero el resto era real con muchas luces y todo. Me caí una vez pero fue muy divertido, algo loco había que hacer ya que era Jinx jaja n.n ","replies":[]}]},{"poster":"Naranjú","date":"2016-11-09T20:30:34.926+0000","up_votes":2,"down_votes":1,"body":"Este articulo esta lleno de fallos, se comienza a notar lo rapido que estan escritos, como a las apuradas.","replies":[]}]},{"poster":"Turing Test","date":"2016-11-10T14:44:40.299+0000","up_votes":2,"down_votes":0,"body":"Aprecio el esfuerzo y el arte que han mostrado todos los concursantes!\r\nMe gustaron mucho los Cosplay de Veigar (muy realista y transmitía esa sensación de hostil ) y el de Jinx (a pesar de que no me gusta Jinx, fue representada excelentemente. Una genialidad ) \r\nFelicidades a todos","replies":[{"poster":"Xiome","date":"2016-11-10T22:59:09.976+0000","up_votes":2,"down_votes":0,"body":"Soy la jinx, muchas gracias por reconocerlo :D ","replies":[{"poster":"Turing Test","date":"2016-11-11T00:38:10.430+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Xiome,realm=LAS,application-id=9xRiuj3T,discussion-id=Ua7Mt7cI,comment-id=001b0000,timestamp=2016-11-10T22:59:09.976+0000)\n>\n> Soy la jinx, muchas gracias por reconocerlo :D\n\nFelicidades Jinx, fueron los dos cosplays más creativos que vi, aunque, el jurado es otro.\n\nAbrazo!","replies":[]}]}]},{"poster":"Yuni","date":"2016-11-10T00:37:19.027+0000","up_votes":2,"down_votes":2,"body":"Me gustaron muchos de los participantes, en especial esa Sona que es hermosa, pero no se porque la jinx gano si para concursar pedia explicitamente \"Crear y usar un cosplay con temática “Harrowing” (como referencia, ver aspectos de las Islas de la Sombra) o, simplemente, un cosplay tenebroso relacionado a League of Legends.\" y Jinx usa el traje normal, esta bien, se colgo de un arbol y todo pero si te piden un traje de terror respeten eso ya que varios se crearon sus trajes y es facil usar uno ya reciclado.\r\n{{item:3640}} {{summoner:12}} ","replies":[{"poster":"Xiome","date":"2016-11-10T22:56:21.184+0000","up_votes":2,"down_votes":0,"body":"Se ve que no supiste interpretar bien el concepto de este concurso, la idea principal era hacer un ritual para invocar al teemonio, no era necesario cambiar el traje si o si, y no fue fácil hacer esa foto, se usaron muchas cosas para que saliera, y si estoy entre los finalistas fue porque los jurados supieron reconocer el trabajo y que no lo hice tan mal, no como otros ;)","replies":[]},{"poster":"ToraYasashi","date":"2016-11-10T01:32:06.290+0000","up_votes":2,"down_votes":1,"body":"la de Teemonio tirando a Jinx del puente si que era buena.. esa debía estar en lugar de la del árbol {{sticker:slayer-jinx-wink}} ","replies":[]}]},{"poster":"KingsglaiveRagna","date":"2016-11-10T05:44:34.818+0000","up_votes":2,"down_votes":0,"body":"igual felicidades a los ganadores, no cualquiera le aplica mano a los cosplay :3","replies":[]},{"poster":"Dama de Hielo","date":"2016-11-10T02:04:36.254+0000","up_votes":2,"down_votes":0,"body":"Felicitaciones a todos los concursantes sobre todo a aquellos que no lograron ser expuestos de seguro se tomaron su tiempo y dedicación, a seguir y de seguro  lograrán algo grande ;)\r\nEstimados Riot estoy ententísima y todavía no recibo correo.\r\nSoy \"Lissandra de la Santa muerte\"\r\nSaludos!!!","replies":[]},{"poster":"Bathory","date":"2016-11-10T01:46:52.981+0000","up_votes":2,"down_votes":0,"body":"MIRA ESE TEEMO SEXY PAPÁAAAAA {{champion:44}} {{champion:44}} ","replies":[]},{"poster":"Rotten Prince","date":"2016-11-09T22:13:55.722+0000","up_votes":2,"down_votes":0,"body":"me encantó el de soraka, si me la pillara en la noche, me haría, por lo menos, pararme a cuestionarme si etoy despierto o soñando","replies":[{"poster":"Clavi","date":"2016-11-10T01:12:58.559+0000","up_votes":2,"down_votes":0,"body":"<3 Se logró el propósito entonces. Muchas gracias! *-* ","replies":[]}]},{"poster":"TSM choche777","date":"2016-11-10T00:18:34.019+0000","up_votes":2,"down_votes":0,"body":"naaaa.....igual al algnos wenos{{champion:17}} {{champion:222}} ","replies":[]},{"poster":"Clavi","date":"2016-11-09T22:20:51.204+0000","up_votes":2,"down_votes":0,"body":"Felicidades a los ganadores <3 gracias a riot por poner concursos con esta temática *-*\r\n\r\nP/D mi nomnbre sale mal escrito u.u es Clavi","replies":[]},{"poster":"ChocoMaiden","date":"2016-11-09T20:04:39.917+0000","up_votes":1,"down_votes":1,"body":"es viktor o malzahar? decídanse (?)","replies":[{"poster":"Rotten Prince","date":"2016-11-09T21:36:09.599+0000","up_votes":2,"down_votes":0,"body":"yo pensé que era Nocturne o Thresh, de Malzahar le veo soo la capucha (aunque en sí no está malo el cosplay, sino poco claro)","replies":[]}]},{"poster":"Mike Bronzoide","date":"2016-11-09T19:37:49.751+0000","up_votes":1,"down_votes":3,"body":"3er lugar dice {{champion:90}} , pero en el post explicando las decisiones, dice que es {{champion:112}} ... ahora entiendo porqué algunas de las selecciones que hicieron, estaban festejando el cumple de algún Admin y estaban pasados de copas. {{item:3028}} {{item:3174}} {{champion:79}} ","replies":[{"poster":"Riot Nebo","date":"2016-11-09T19:44:03.709+0000","up_votes":2,"down_votes":1,"body":"Es Malzahar, el error fue mio al escribir el articulo. \r\n¡Gracias por notarlo!\r\n**¡Corregido! **","replies":[{"poster":"Mike Bronzoide","date":"2016-11-09T20:05:04.478+0000","up_votes":2,"down_votes":0,"body":"por nada, qeurido amigo {{champion:427}} {{sticker:slayer-pantheon-thumbs}} ","replies":[]}]}]}]}