{"poster":"[NEM SIKERÜLT KIOLVASNI]","date":"2016-08-12T17:55:41.602+0000","title":"Ethernet vs. Wifi: ping, paquetes y cómo jugar mejor","subforum":"Anuncios","up_votes":5,"down_votes":2,"body":"[ÜRES]","replies":[{"poster":"CeDeeMe","date":"2016-08-12T20:43:15.955+0000","up_votes":152,"down_votes":2,"body":"Interesante, voy a comprar un cable de red de 30 metros y le voy a pedir a mi vecina si lo puede conectar a su modem. (? {{sticker:slayer-pantheon-thumbs}} ","replies":[{"poster":"MEGA3L","date":"2016-08-13T15:42:44.170+0000","up_votes":2,"down_votes":41,"body":"El cable tiene tolerancia de 8mts despues de eso la conexión decae.","replies":[{"poster":"K4nnabico","date":"2016-08-13T16:29:42.497+0000","up_votes":41,"down_votes":0,"body":"El cable ethernet UTP cat 5 e (el mas comun para todo tipo de conexion hogareña) asegura potencia y transmision de datos hasta los 100 mts. No desinformes","replies":[{"poster":"fin","date":"2016-08-17T23:55:55.504+0000","up_votes":2,"down_votes":0,"body":"amigo el rj45 cat 5 es el mas penca de todos los cables de Ethernet los que se usan son los cat 5e y cat 6 esos son los buenos y con respecto a este tema es muy bronce tocarlo, cualquier gamer sabe que un conexión por cable es mejor que por una wifi.","replies":[{"poster":"Thundershock","date":"2016-08-18T04:57:05.038+0000","up_votes":2,"down_votes":0,"body":"yo uso un cable cat6a :D menos mal que trabajo como tecnico en cableado estructurado :D eaea","replies":[]}]}]}]},{"poster":"VersusS","date":"2016-08-13T05:42:05.467+0000","up_votes":1,"down_votes":8,"body":"Esta robando internet eso es ilegal. Por ende no deberias ni jugar.","replies":[{"poster":"Ziggy Stardust I","date":"2016-08-13T05:59:04.510+0000","up_votes":6,"down_votes":0,"body":"No roba internet, en edificios se usa bastante lo de compartir gastos de servicios como internet, por lo que pueden estar pagando mitad y mitad","replies":[]}]},{"poster":"ElCala Urug","date":"2016-08-15T14:09:35.003+0000","up_votes":2,"down_votes":0,"body":"Amigo el objetivo es vender... RIOT abrió una empresa que fabrica cables de red (jajaja... sarcasmo)","replies":[]}]},{"poster":"Eco G oxz","date":"2016-08-12T20:36:12.101+0000","up_votes":4,"down_votes":42,"body":"algun 100tifiko que resuma esto? o al menos que me diga que es lo que realmente debemos hacer para no tener tantos problemas :/","replies":[{"poster":"Project Akali","date":"2016-08-12T20:55:50.394+0000","up_votes":54,"down_votes":1,"body":"ethernet > wi-fi\r\n\r\nbasicamente dijo eso","replies":[{"poster":"buru","date":"2016-08-12T21:20:18.285+0000","up_votes":40,"down_votes":3,"body":"Te corrijo:\r\nEthernet >>>>>>>>>>>>>> Wi-Fi\r\n","replies":[]}]},{"poster":"the Red Devils","date":"2016-08-12T22:32:08.541+0000","up_votes":2,"down_votes":0,"body":"cambiar la velocidad de red yo uso de 1 MEGA no me puedo quejar para colmo \r\nPD NO usen \"AERO Internet q vuela\"???!!!xdddd","replies":[{"poster":"Oblongo Nghé","date":"2016-08-13T13:30:07.799+0000","up_votes":8,"down_votes":0,"body":"Vos porque no tenes una madre que te laguea mirando peliculas en youtube...","replies":[{"poster":"Soulty Reaper","date":"2016-08-13T14:23:16.738+0000","up_votes":13,"down_votes":0,"body":"yo tengo una hermana que prende su pc y mi ping vuela de mi y se va a la puta","replies":[]}]},{"poster":"Zaerysh","date":"2016-08-12T22:56:39.194+0000","up_votes":6,"down_votes":1,"body":"El ping VUELA POR LOS AIRES xDDDDDDDDD","replies":[{"poster":"KineticKiller","date":"2016-08-13T01:38:03.925+0000","up_votes":3,"down_votes":1,"body":"Igual que tu Rabia cuando hay un {{champion:17}} con {{summoner:14}} y {{summoner:11}} ","replies":[]}]}]}]},{"poster":"Necrosis","date":"2016-08-12T18:10:24.900+0000","up_votes":27,"down_votes":6,"body":"Tanto quilombo para decir que el Ethernet es mejor que el Wifi, que por supuesto es algo mas que obvio.","replies":[{"poster":"Gantsz","date":"2016-08-13T00:31:58.050+0000","up_votes":8,"down_votes":1,"body":"Y asi hasta llegar a la fibra optica. {{sticker:slayer-jinx-wink}} ","replies":[{"poster":"KineticKiller","date":"2016-08-13T01:44:21.655+0000","up_votes":6,"down_votes":2,"body":"La semana que viene el Post será \"Parece que usar Wi-Fi trae latencia, así que usa Ethernet y tu vida será mas etzitante\" Riot Vince Offer - 2016","replies":[]}]},{"poster":"Diehanger","date":"2016-08-12T20:48:15.002+0000","up_votes":6,"down_votes":1,"body":"Espera el post de mañana \"aparentemente conectarse a internet por Wi-Fi sería más inseguro que por ethernet\"...","replies":[]}]},{"poster":"The showman","date":"2016-08-12T22:28:31.906+0000","up_votes":39,"down_votes":20,"body":"Dejen de meter excusas.En LAS los servidores son una mierda. Pónganse a laburar manga de vagos, si vos también riot cóndor hablan muchas boludeces pero de invertir en mejorar la conexion ni hablamos no. Alguien lo tiene que decir basta de eventos de mierda y pelotudeces lo que queremos es jugar 2 putas partidas al día y que esas dos partidas de mierda no tengan lag,afks,trolls y las pelotudeces esas del lol. Un abrazo{{champion:6}} ","replies":[{"poster":"Diablitood","date":"2016-08-17T03:31:10.175+0000","up_votes":4,"down_votes":0,"body":"apoyo tu moción pero con menos violencia ","replies":[]},{"poster":"lionzion97","date":"2016-08-12T22:31:31.561+0000","up_votes":5,"down_votes":2,"body":"{{sticker:slayer-pantheon-thumbs}} ","replies":[]}]},{"poster":"Hwaxinghz","date":"2016-08-12T18:14:35.601+0000","up_votes":17,"down_votes":2,"body":"Bueno, está bastante claro y explica el porqué usar una conexión wifi es más propenso a tener lag, desconexiones y pérdida de paquetes, por la misma \"naturaleza\" (o artificialidad?) del tipo de conexión, vía Aire es obvio que puede haber alguna interferencia como radiación (microondas), metales (alguna puerta entremedio con cerradura rara, etc). Todo puede pasar.\n\nEs algo claro, usar Ethernet es mucho mejor, yo mismo lo comprobé, hace tiempo usaba WiFi, notaba y analizaba todo lo que nos muestran acá. Mi ping promedio era de 78, con picos de delay de 90+ de Ping, por segundos, y aveces desconexiones de unas centésimas de segundo. Con el Cable de red, mismo internet, mismo router, misma PC y casi \"misma vez\", comprobé que mi ping era de 55, sin desconexiones y sin pérdida de paquetes (de un 8% con wifi, pasé a un 0,2% aproximadamente). Estando en ambos casos al lado del router obviamente.\n\nAsí que si, si quieren tener mayor estabilidad durante las partida en cuanto a calidad de conexión, lo más básico que hay que tener en cuenta es usar un cable de red, luego se verá si el problema es del internet propio de cada uno, pero por el momento uno puede experimentar o probar con cable. Los resultados son bastante notables. El wifi sirve más para navegar, mirar vídeos, facebook, etc. Y con cable de RED se debería jugar, así evitar interferencias.\n\nSaludos","replies":[{"poster":"Gantsz","date":"2016-08-13T00:29:30.586+0000","up_votes":3,"down_votes":0,"body":"Encerio necesitastes un analisi tan profundo para saber que el wifi es la peor conexion¿? Te evito mas trabajo, la conexion por el cable del videocable (television paga) es mejor que la del telefono y la fibra optica es el tesoro de los dioses.","replies":[]}]},{"poster":"Rìsotto Nero","date":"2016-08-12T18:25:47.058+0000","up_votes":8,"down_votes":1,"body":"Yo esperaba que hagan una guia de \"**como romper el modem**\" y , \"**3 simples pasos para pasarte a ethernet y salir de bronce**\"","replies":[{"poster":"Xylan","date":"2016-08-12T20:47:07.468+0000","up_votes":13,"down_votes":0,"body":"ps te compras un cable Ethernet y ya, te crecen manos como la mala hierba {{sticker:slayer-pantheon-thumbs}} ","replies":[]}]},{"poster":"clan URANUS","date":"2016-08-12T23:02:10.940+0000","up_votes":13,"down_votes":1,"body":"Muy lindo toda la data...pero... estaría genial que pongan un medidor de ping en el lobby del juego para que los usuarios puedan verlo antes de mandarse a jugar...así reducimos considerablemente la cantidad de gente con LAG que entra a las partidas....digo...estaría bueno.\r\natte: clan URANUS{{champion:412}} {{sticker:zombie-brand-clap}} ","replies":[{"poster":"AnGerMaYeR","date":"2016-08-13T01:44:51.146+0000","up_votes":3,"down_votes":1,"body":"de hecho yo antes de entrar al pvp juego contra bots todos los días, así me aseguro que no tengo lag...","replies":[{"poster":"Feibukperro","date":"2016-08-13T02:15:18.755+0000","up_votes":1,"down_votes":5,"body":"es mas facil abrir el cmd y colocar ping www.google.com y ves tus ms izi pizi","replies":[{"poster":"JuanKawaiNieve","date":"2016-08-16T19:16:11.865+0000","up_votes":6,"down_votes":1,"body":"y que tiene que ver google con el servidor de las? Quiero ver mi ping respecto a lol, no respecto a google.","replies":[]}]}]}]},{"poster":"KineticKiller","date":"2016-08-13T01:42:10.803+0000","up_votes":14,"down_votes":2,"body":"¿Cuál es el campeón representativo de un Bronce V con 0 Puntos de Liga?\r\n\r\nEs {{champion:110}} , así que \"Temanle a un hombre que no tiene nada que perder\"\r\n\r\nJAJAJAJAJAJAJAJAJAJAJAJAJAJAJAJAJAJAJAJAJAJA {{champion:99}} ","replies":[]},{"poster":"Flechashe","date":"2016-08-12T21:12:08.793+0000","up_votes":13,"down_votes":3,"body":"Buena excusa para como tiraron el server el otro día {{sticker:slayer-pantheon-thumbs}} como me cagó el Shaco, era chileno y no tenía lag mientras los aliados uruguayos y argentinos rageábamos... Por cierto, dejen de llorar. 10 ms? Si no podés ser bueno con 60 ms entonces nunca vas a salir de bronce, ni con 0 ms. Yo quizá esté acostumbrado, pero cuando camino con 40 ms lo siento instantáneo. No sé como se puede ser TAN exquisito como para quejarse de que tu campeón tarda LITERALMENTE CERO COMA CERO CUARENTA en acatar sus órdenes. Se pueden hacer combos de habilidades sin problemas y los reflejos no se ven afectados. El verdadero lag son los 300+ ms cuando la gente usa tu conexión. De más está decir que uso Wi-Fi y nunca en la vida usé un cable para internet. Salu8 {{champion:223}} ","replies":[{"poster":"Xhamito","date":"2016-08-13T18:45:55.701+0000","up_votes":5,"down_votes":0,"body":"Cuando no habia server latino jubamos en NA con 160 ms, dejen de llorar{{sticker:slayer-jinx-catface}} ","replies":[]},{"poster":"RX10","date":"2016-08-13T14:21:20.954+0000","up_votes":1,"down_votes":0,"body":"Toda la razón, con 50 ya se puede jugar perfectamente, pero creo que 100 ms ya se llega a notar mucha la diferencia, mas todavia si sos adc.{{champion:119}} {{item:3070}} ","replies":[{"poster":"EdxxEdxx","date":"2016-08-13T14:36:38.997+0000","up_votes":2,"down_votes":0,"body":"a partir de 100ms el personaje ya demora como 1 segundo en responder, a partir de los 150 ya ni pienses en arriesgarte para nada ;-;","replies":[]}]}]},{"poster":"ITS CATURDAY UWU","date":"2016-08-12T17:59:14.995+0000","up_votes":2,"down_votes":0,"body":"buena biblia si no le funciona resetea el modem y se arregla si no nos vuelve a llamar y lo vemos","replies":[{"poster":"HyenaLoL","date":"2016-08-12T20:38:47.684+0000","up_votes":7,"down_votes":0,"body":"Arnet pls. La peor atenciom al cliente en todo Haiti","replies":[{"poster":"the Red Devils","date":"2016-08-12T22:44:42.307+0000","up_votes":3,"down_votes":0,"body":"Vos o Ustds. no vieron \" AERO Intermet que vuela \"?!jaja... para un 1 MEGA te sacan 400 mangos ","replies":[{"poster":"That Gay Wendigo","date":"2016-08-13T17:28:26.115+0000","up_votes":2,"down_votes":0,"body":"RLLY?\r\n400 \"MANGOS\" PARA 1 MEGA?\r\ncapo pasate a fibertel que es una cagada pero 6 megas salen 400 ","replies":[]}]}]}]},{"poster":"Ken Bread","date":"2016-08-12T22:44:10.367+0000","up_votes":2,"down_votes":5,"body":"Resumen taringuero nivel 5 pls","replies":[{"poster":"Pyke dé Limon","date":"2016-08-13T02:50:22.902+0000","up_votes":7,"down_votes":0,"body":"si tienes lag es por el wi-fi\nasi que compra over.. digo compra cable para el ethernet","replies":[]}]},{"poster":"Br1bkn","date":"2016-08-12T21:31:16.282+0000","up_votes":5,"down_votes":1,"body":"Es verdad, yo tengo VTR y se nota la diferencia, antes jugaba con cable y el ping no subia de 16, perfecto, ahora que me cambie de casa con la misma conexion como no he podido instalar escritorio en mi pieza aun he tenido que jugar en el living con wifi y anda bien, pero como con 30 de ping y a veces se mandaba unos lagazos feos; es mucha la diferencia en especial si tu router es malo como el ARRIS que da VTR","replies":[{"poster":"RX10","date":"2016-08-13T14:26:49.043+0000","up_votes":2,"down_votes":6,"body":"30 ms te parece mucho?","replies":[{"poster":"Br1bkn","date":"2016-08-16T05:07:08.488+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=RX10,realm=LAS,application-id=9xRiuj3T,discussion-id=5fHAMlKg,comment-id=00190000,timestamp=2016-08-13T14:26:49.043+0000)\n>\n> 30 ms te parece mucho?\n\nes super poco pero lo mencione para hacer notar la diferencia con el wifi xd","replies":[]},{"poster":"That Gay Wendigo","date":"2016-08-13T17:32:20.277+0000","up_votes":1,"down_votes":5,"body":"jajaja :v que gente \"delicada\" para estas cosas. Un verdadero ping es pasando los 100","replies":[{"poster":"JuanKawaiNieve","date":"2016-08-16T19:47:44.839+0000","up_votes":5,"down_votes":1,"body":"Pero te esta diciendo que lo dijo para hacer notar que el WIFI si es mas lento que con cable, si incluso en su comentario dijo que esta bien con sus 30 ms, la comprension lectora en los comentarios de lol es impresionante, parecen niños de octavo basico con retraso mental.","replies":[]}]}]}]},{"poster":"xSanti","date":"2016-08-12T20:48:44.137+0000","up_votes":4,"down_votes":2,"body":"Una buena excusa de Riot para justificar que el server de las es un asco,soy tecnico y miro esto y no puedo creer como usan \"ciertas\" informacion para manipular y justificarse,dejen de mentir y arreglen el servidor de una vez por todas,basta de excusas tan pelotudas.","replies":[{"poster":"Vaendrys","date":"2016-08-13T01:30:28.560+0000","up_votes":2,"down_votes":0,"body":"No necesitas ser técnico para saber que la conexión vía ethernet es mejor que vía Wifi xD","replies":[{"poster":"xSanti","date":"2016-08-13T04:53:18.349+0000","up_votes":1,"down_votes":1,"body":"Eso es obvio,pero no justifica el mal funcionamiento del server.","replies":[]}]}]}]}