{"poster":"[NEM SIKERÜLT KIOLVASNI]","date":"2015-10-06T02:14:02.096+0000","title":"La temporada clasificatoria 2015 llega a su fin","subforum":"Anuncios","up_votes":1,"down_votes":0,"body":"[ÜRES]","replies":[{"poster":"Benito Memo","date":"2015-10-06T19:43:38.034+0000","up_votes":360,"down_votes":12,"body":"***","replies":[{"poster":"Vondross","date":"2015-10-06T20:43:59.488+0000","up_votes":59,"down_votes":17,"body":"***","replies":[{"poster":"Benito Memo","date":"2015-10-06T21:35:14.065+0000","up_votes":7,"down_votes":2,"body":"Pero casi siempre en los finales de temporadas hacen descuentos en las paginas de runas, quizás lo harán esta vez D:","replies":[{"poster":"Styxa","date":"2015-10-06T23:39:46.495+0000","up_votes":6,"down_votes":0,"body":"principio de temporada las ponen ya las pusieron en marzo o abril de este año","replies":[]}]},{"poster":"Juanito Fulanito","date":"2015-10-14T10:44:49.457+0000","up_votes":2,"down_votes":0,"body":"Que Ahora Sean 3x1 :D","replies":[]}]},{"poster":"Benito Memo","date":"2015-10-07T17:15:36.748+0000","up_votes":13,"down_votes":4,"body":"Me siento apoyado {{item:3151}} ","replies":[]}]},{"poster":"Castor Daggett","date":"2015-10-06T19:18:20.925+0000","up_votes":96,"down_votes":3,"body":"\"1 punto por cada victoria clasificatoria en el Bosque Retorcido\"\r\n\r\nRito usted es diabolico","replies":[]},{"poster":"Ordeñador","date":"2015-10-14T17:01:36.363+0000","up_votes":68,"down_votes":8,"body":"Desde pequeño me enseñaron que lo que se da no se quita, me da lo mismo si no me dan la skin de sivir por putear a un par de trolls, es responsabilidad de riot y su personal de trabajo crear buenos filtros para que los que rankeamos no tengamos que vernos obligados a tolerar en silencio lo que en otras comunidades sencillamente no existe..\r\n\r\nLlevo 4 años jugando por diversión y no me molesta perder, lo que me molesta es tener que perder partidas obligatoriamente sin derecho a decir nada y guardarme la frustración para no quedar de flamer para que no me pongan una pistola en la cabeza por decir lo que pienso, una comunidad represiva para los que alzamos la voz solo pidiendo lo que corresponde.\r\nSea donde sea, en la vida real por sobre todo, si alguien afecta mi entorno voy a decir lo que pienso.\r\n\r\nSiendo consecuente con mi pensamiento, no estoy para nada arrepentido de lo que haya dicho para ser castigado, es el principio de la evolución, primero te castigan y te critican, pero en el fondo saben que tenias la razón.\r\n\r\nY como decía, no me molesta perder el premio de esta temporada (La temporada más desagradable de league of legends latinoamerica)\r\n\r\nLo que si me enfurece es la falta de criterio al tomar medidas retrogradas y delictivas, me decepciona profundamente que hayan decidido sustraer de mi cuenta todo lo que gané anteriormente, no solo es un abuso, es una falta de principios fundamentales, eso que me sustrajeron me pertenece, lo gané con mis manos a lo largo del tiempo.\r\n\r\nPero no se molesten, estoy tan decepcionado que he decido desinstalar LOL. Es una lastima porque yo era buen cliente y buen jugador.\r\n\r\nPueden quedarse con sus jugadores estrella que abalan el mal comportamiento en la partida, pero alguien dice algo en el chat y todo el mundo pierde la cabeza, esta comunidad está enferma, en lugar de terminar con el problema de raíz solo están podando lo que se ve por fuera..\r\n\r\nSuerte en su próxima temporada. {{summoner:3}} ","replies":[{"poster":"CapitánBistec","date":"2015-10-14T23:05:06.300+0000","up_votes":13,"down_votes":3,"body":"Estuve leyendo mil comentarios como el tuyo, y la verdad me entristece mucho que pasen estas cosas. Que uno se esfuerce todo un año y que no pueda quejarse (aunque yo no lo haga) de los errores ajenos, que muchas veces son a propósito. Francamente, con solo leer el post me di cuenta de que sos un miembro maduro y muy valioso de la comunidad. Yo también de te deseo suerte en lo que sea que hagas. {{champion:105}} ","replies":[{"poster":"FS Longjian","date":"2015-10-15T00:51:43.153+0000","up_votes":14,"down_votes":2,"body":"Estoy de acuerdo con vos en todo, a mi me banearon la cuenta alegando que me la usaba otra persona, cuando en realidad la cuenta era abierta por mi mismo en otra pc, en la casa de un amigo cuando nos juntabamos a jugar, pero eso riot lo tomo como elobbost y me banearon la cuenta y perdi todo lo ganado hasta ese momento, lo peor de todo es que ni siquiera me dieron el derecho a replica, envie quejas en correos explicando lo sucedido y a nadie le importo si quiera los alegatos; desde ese dia entendi que es una comunidad arbitraria la que maneja este juego y que los que verdaderamente deben ser baneados siguenimpunes por ahi. Comparto el hecho de que cada uno debe poder expresarse dentro del jeugo y no sentirse con paranoia de que te baneen y no poder jugar mas, ya que como vos decis uno posee convicciones y creencias las cual tiene el derecho de defender. Es triste que riot sea tan arbitrario con algunas cosas que hacen tan tristes al game y a la comunidad, tambien soy jugador frecuentey muy buen cliente en cuestiones de rp, ya que cargo seguido y todo lo que habia adquirido me fue quitado. Me sumo completamente a tu comentario con mi experiencia particular{{champion:32}} ","replies":[]}]},{"poster":"FullTimeKiller","date":"2015-11-13T06:52:29.972+0000","up_votes":3,"down_votes":0,"body":"yo cuando entraba a jugar rankeds y no queria escuchar insultos silenciaba a los 2 team y les decia \"no me hablen por que los bloqueo a todos, usen los ping\" y lo primero que decian era \"report\" jajajaja","replies":[]}]},{"poster":"TheBambooLover","date":"2015-10-06T19:30:35.791+0000","up_votes":49,"down_votes":3,"body":"\"+1 punto por cada victoria clasificatoria en el Bosque Retorcido\"...\r\nHay gente que solo quiere ver arder la grieta... {{summoner:14}} {{summoner:14}} {{summoner:14}} {{champion:63}} ","replies":[]},{"poster":"ARTPOP1","date":"2015-10-06T20:37:45.393+0000","up_votes":16,"down_votes":8,"body":"LOL a mi me banearon en junio y me devolvieron la cuenta el 13 de julio {{champion:115}} recibiré las recompensas (?) \r\nPD: ya no flameo aprendí la lección{{champion:32}} {{summoner:3}} ","replies":[{"poster":"Vaxel","date":"2015-10-06T20:42:09.823+0000","up_votes":3,"down_votes":53,"body":"Y a mi m calzaron el ban en esa época x putear a un varus k m kiri el red el tipo q trolea tiene skin y el k no trolea no lo tendra","replies":[]}]},{"poster":"Lacker","date":"2015-10-07T21:55:02.392+0000","up_votes":40,"down_votes":2,"body":"Que lindo seria tener el centinela de recompensa por equipo.....\r\n\r\nSi tuviera un equipo {{champion:32}} ..... o amigos{{champion:32}} {{item:3070}} ","replies":[{"poster":"Roubiron","date":"2015-10-11T04:02:30.048+0000","up_votes":20,"down_votes":3,"body":"si tuvieramos amigos no estariamos jugando al lol {{champion:157}} ","replies":[{"poster":"TaroXD","date":"2015-10-13T20:02:13.986+0000","up_votes":6,"down_votes":0,"body":" jajaja yo si tengo amigos........... en el espejo{{champion:7}} {{champion:32}} {{item:3070}} ","replies":[]}]},{"poster":"Falso Hectør","date":"2015-10-14T14:29:15.339+0000","up_votes":11,"down_votes":0,"body":"mis amigos solo aparecen cuando hay aumento de PI {{champion:32}} ","replies":[]}]},{"poster":"ElPipaBenedetto","date":"2015-10-06T21:14:57.705+0000","up_votes":26,"down_votes":2,"body":"Riot porfavor renueven los reembolsos ! :D todos alguna vez fuimos unos novatos y reembolsamos a un teemo , o a una sivir jajaja","replies":[{"poster":"Zexceed","date":"2015-10-07T00:56:31.315+0000","up_votes":15,"down_votes":0,"body":"y para los que se gastaron los rp en yi asesino xdd","replies":[]}]},{"poster":"SKT T1 FunesMori","date":"2015-10-06T19:33:04.725+0000","up_votes":22,"down_votes":2,"body":"que es el estandarte??????? ","replies":[{"poster":"Vito Corleone","date":"2015-10-06T20:36:55.244+0000","up_votes":16,"down_votes":1,"body":"Es el marco que, según tu división, se ve en el banner de tu perfil (donde salen las imágenes de un invocador, DJ Sona, Ezreal pulso de fuego, etc) {{champion:74}} ","replies":[]}]},{"poster":"grove96","date":"2015-10-06T20:34:10.720+0000","up_votes":20,"down_votes":2,"body":"a que se refiere con Marca de invitación y de solicitud de amigo? o que es? :v\r\n","replies":[{"poster":"Esguein","date":"2015-10-07T11:02:00.643+0000","up_votes":7,"down_votes":1,"body":"Cuando invitas a alguien a una partida, aparece el icono, Por ejemplo si terminaste en Oro, cuando invites a alguien le aparecerá el icono de la season","replies":[]}]},{"poster":"H2P OGkush","date":"2015-10-07T16:47:13.505+0000","up_votes":18,"down_votes":3,"body":"***","replies":[{"poster":"Mad Scientist","date":"2015-10-08T02:17:25.813+0000","up_votes":13,"down_votes":1,"body":"Los trolls son el pan de cada día, me sorprende que no sepas que al flamearlo lo único que hacés es alimentarlo (sin contar el baneo tonto que te comiste). Lo ignorás, al final de la partida lo reportás y listo. Y si estás demasiado estresado al borde del colapso no juegues y listo, ya sabés como son las cosas acá. Flamear es una actitud sancionable al igual que trollear, no existe la excusa de \"pero él me trolleó, por eso me puse a flamearlo\", al hacerlo estás en falta al igual que el otro y lo sabés (ademas que muchas veces eso de \"está trolleando\" ni siquiera es cierto, me cansé de ver casos donde a un tipo lo stompean y ya automáticamente el team pide \"report por troll\" cuando el tipo no es troll, solo es medio manko).\r\nEn fin, a mí me parece justo, sobre todo al ver que aun en el final de tu comentario seguís convencido de que no es tu culpa, sino de los demas que te \"provocan\".","replies":[{"poster":"Akresh","date":"2015-10-16T16:44:32.066+0000","up_votes":4,"down_votes":1,"body":"quizas usted PUEDA ignorar y reportar (de manera bastante inutil por que no existe el tribunal para castigar a este tipo de gente) a un troll\r\n\r\npero la gente que colapsa, que somos LA MAYORIA (incluido yo) de los que jugamos no podemos contenernos y tenemos que buscar LIBERAR esa presion que nos molesta, que nos arde por dentro y queremos apagarla, estoy de acuerdo en que se puede mutear e ignorar, pero eso NO SIRVE SEÑORES!! no sirve, no me sirve de nada mutear a alguien que va 0/15/2 y solo entra por que tiene ganas de entrar y no jugar seriamente","replies":[]}]},{"poster":"Piñeraplz","date":"2015-10-07T17:02:31.915+0000","up_votes":4,"down_votes":1,"body":"estoy en tu misma sutuacion, y la verdad es que es injusto como tomaran las medidas para dar las recompensas ya que los que trollean al fin y al cabo se llevaran las recompensas igual y es inevitable no verse afectado cuando uno trata de jugar bien y te joden las partidas por el simple hecho de que te toca perder porque al otro se le da la gana.","replies":[{"poster":"H2P OGkush","date":"2015-10-07T17:06:47.501+0000","up_votes":1,"down_votes":1,"body":"Es increíble esto , un amigo me dijo lo de no recibir recompensas por el ban y yo no le creía pero me meto hoy a ver si es que es verdad y me encuentro con esta sorpresa dios mio :( ","replies":[{"poster":"H2P OGkush","date":"2015-10-07T18:27:26.135+0000","up_votes":3,"down_votes":0,"body":"dare un ejemplo muy claro y realmente me da pena y rabia , COSCUUU como sigue jugando con el nivel de flamer que es ? osea hay que ser streamer o famoso para que te perdone riot ? o la gente de esta comunidad ? http://www.twitch.tv/coscuuu tratando de inutil y pelotudos a sus compañeros ! ","replies":[{"poster":"Trleeft","date":"2015-10-08T22:52:30.041+0000","up_votes":3,"down_votes":0,"body":"Te presento el capitalismo amigo, Coscu atrae a mucha gente a jugar más. \r\nmás gente entra = entra mucha mas plata. No importa lo bicho feo que seas si generas guita tienes un buen lugar en la sociedad.","replies":[]}]}]}]}]},{"poster":"Meliadoul","date":"2015-10-06T19:23:06.581+0000","up_votes":2,"down_votes":1,"body":"¿cómo es eso que indican la división los marcos?","replies":[{"poster":"Outfit Skinning","date":"2015-10-06T20:21:11.429+0000","up_votes":5,"down_votes":30,"body":"Cada division tiene su marco en la seleccion de campeones, si sos oro te ponen marco de oro, si sos platino marco de platino, y asi en todas las divisiones salvo bronze","replies":[{"poster":"martincarp","date":"2015-10-06T20:29:57.050+0000","up_votes":18,"down_votes":0,"body":"Eso son las ligas, las divisiones son las que están en la misma liga, por ejemplo oro I, II, III, etc...","replies":[{"poster":"Meliadoul","date":"2015-10-07T08:01:21.332+0000","up_votes":1,"down_votes":1,"body":"Sí, a eso me refiero, no entiendo como van a indicar las divisiones :P","replies":[{"poster":"Pabloxd2","date":"2015-10-07T12:01:00.616+0000","up_votes":4,"down_votes":1,"body":"con palitos en el marco jajajja bno ya ok no :'( yo solo queria ser popular jaja","replies":[]}]}]}]}]},{"poster":"Mikee369","date":"2015-10-06T21:23:35.712+0000","up_votes":8,"down_votes":0,"body":"Yo queria a mi taric victorioso {{item:3070}} {{champion:44}}  {{item:3070}} ","replies":[]},{"poster":"OGKxsh","date":"2015-10-06T22:08:01.016+0000","up_votes":4,"down_votes":12,"body":"Me bannearon el 28 de agosto por 2 semanas, segun riot ''acitud negativa'' por una partida con 2 trolls y 1 afk, no recibire ni a sivir victoriosa? ni el marco de oro? ni el ward ( no eh juntado los puntos, aun, al hecho de juntarlos tampoco lo recibiria? ), estoy fuera de recibir la skin victoriosa de la temporada por aquel bann? \r\n\r\nPuede porfavor un Rioter contestar?","replies":[{"poster":"RitoGueims","date":"2015-10-07T02:05:57.507+0000","up_votes":12,"down_votes":1,"body":"Los bans no son por 1 partida, son por comportamiento repetitivo de mala actitud. Deja de flamear para la otra xDD","replies":[{"poster":"OGKxsh","date":"2015-10-07T02:26:55.874+0000","up_votes":1,"down_votes":19,"body":"para la otra season? encuentro una putada no poder tener la sivir victoriosa, apoyen la habilidad como jugador competitivo","replies":[{"poster":"Ronder","date":"2015-10-07T14:04:13.538+0000","up_votes":13,"down_votes":1,"body":"No sos jugador competitivo, sos oro. Y no te banean por 1 partida, si te banearon es por que lo tenias merecido","replies":[{"poster":"Ronder","date":"2015-10-07T17:31:02.161+0000","up_votes":6,"down_votes":1,"body":"Ser flamer es igual de malo que ser troll, que irte afk, es igual de malo, a todos nos toca esa gente, si aprendes como tenes que comportarte y jugar, no vas a tener ningún problema y vas a subir, si vos queres estar dentro del \"circulo competitivo\" seas del elo que seas, vas a tener que aprender eso, mas aun si queres llegar a \"algo\" sino, ahi estan las normals y ahi al costado la puerta de salida. ","replies":[]}]},{"poster":"SeBaxB","date":"2015-10-07T16:54:44.948+0000","up_votes":4,"down_votes":1,"body":"Como se nota que no aprendiste nada con la sancion.\r\nPor suerte el sistema ahora penaliza a la gente que flamea, se va afk o trollea.\r\nEl estar dentro del \"circulo competitivo\" o que alguien haga algo mal en tu equipo no te da derecho a insultarlo... y parece que aun no lo estas entendiendo, a pesar de que la sancion fue por 2 semanas, por lo que no debe haber sido tan simple como insultar a alguien en una sola partida","replies":[{"poster":"DLK Doublelift","date":"2015-10-07T22:14:25.205+0000","up_votes":3,"down_votes":0,"body":"tiene toda la verdad yo tambien soy oro y tengo otra cuenta mas en plata y no por eso podes flamiar a la gente que trollea hoy tuve un adc 0/7 y se fue afk cuando entro le digo mutealos a los que flamean y intenta jugar como podes me termino ayudando a ganar de o/7 y afk termino 12/9/15 \r\n esa es una forma de intentar ayudar a tus mismos compareños a ganar con flamiar o cargar por que es noob o lo que sea no ganas nada bro solo perder tiempo y la partida saludos","replies":[]}]}]}]}]},{"poster":"Furenze","date":"2015-10-07T18:27:48.264+0000","up_votes":8,"down_votes":1,"body":"De Platino 5 a Oro 3, por las dudas no rankeo mas, a principio de año el nivel era bueno y había pocos afk, actualmente cada 5 partidas me tocan 2 o 3 afk o troll. Espero que mejoren el tema de banneos y que vuelva el Tribunal si ayuda para lo anterior. ","replies":[{"poster":"Ari","date":"2015-10-07T18:51:45.397+0000","up_votes":5,"down_votes":0,"body":"eso es porque riot no quiere que el server sea competitivo entonces incita a la gente a que le importen menos las partidas clasificatorias. {{champion:222}} ","replies":[]}]}]}