{"poster":"[NEM SIKERÜLT KIOLVASNI]","date":"2016-04-27T15:10:15.810+0000","title":"¡Entradas en venta para la Gran Final en FestiGame!","subforum":"Anuncios","up_votes":2,"down_votes":5,"body":"[ÜRES]","replies":[{"poster":"DaggerKnife","date":"2016-04-27T16:48:40.408+0000","up_votes":61,"down_votes":1,"body":"No soy de comentar las publicaciones ni nada, pero esta la amerita... \r\n\r\nReferente al Festigame...\r\nUnir el FestiGame con los eventos del LoL , lo encuentro genial, más stands más  comunidad, diversas plataformas, público más diverso buena idea todo bonito si , hasta que nos vamos al problema monetario...\r\n\r\nEn el Movistar 6mil , 9 mil, 12 mil pesos la entrada dependiendo de donde compren obvio... Ahora 20 mil enserio por 1000 asientos ... Cual es la idea dejar a la gente que viene desde el norte, sur , Argentina , etc...fuera del evento dejar botados , siii!!! BOTADOS a esos niños que iban con sus padres porque les daba el monedero , a esa gente que le encanta el LoL , los Esports tirada frente al PC siendo que antes podían verlo en directo ... No piensan en esas personas que tiene que tomar un bus , si del norte sur de donde sea para poder llegar y alentar al equipo ... 20 mil pesos un día un robo , Si UN ROBO y una desconsideración total por todos aquellos que quedamos fuera ... Quien tiene prioridad los faralas , los codplayers (nada en contra de ellos) , los streamers , los charengers , etc... Y la gente del pueblo es aquel juega desde un notebook , pc particular no en esas piezas monstruosas llenas de gamimg donde quedamos ? Un asco\r\nDisminuir 8000 a 12000 espectadores a 1000 por día un completo ASCO !!\r\n\r\n\r\n$$> Riot > Esports > LoL> Comunidad > caca> jugadores \r\n \r\nSe me Calleron , hasta el fondo!!","replies":[{"poster":"Rayitas","date":"2016-04-27T22:50:20.102+0000","up_votes":7,"down_votes":0,"body":"Notable que la caca este antes que los jugadores RIP RITO.","replies":[]},{"poster":"Hijo del Hierro","date":"2016-04-27T21:30:27.413+0000","up_votes":8,"down_votes":1,"body":"Estoy en total de acuerdo contigo, apensa supe que lol se iba a vincular con esos asqueroso de la festigame, porque eso es lo que son, unos asqueroso que suben cada vez mas precio de las entradas y venden mas de lo que el recinto aguanta.","replies":[{"poster":"Binario","date":"2016-04-27T22:26:33.803+0000","up_votes":7,"down_votes":0,"body":"parece que fuiste el año pasado al estacion mapocho igual que yo pensando que seria divertido , Kappa . una mierda, lleno a cagar, carisima la comida, filas eternas, un asco y como si fuera poco , la jessica nigri no quiso mostar nada ","replies":[{"poster":"Gretta","date":"2016-04-27T22:50:39.825+0000","up_votes":5,"down_votes":0,"body":"viaje sólo a esa mugre y terminé decepcionada jurando jamás volver -.- un asco","replies":[]},{"poster":"Rayitas","date":"2016-04-27T22:49:53.056+0000","up_votes":5,"down_votes":0,"body":"Yo no he ido nunca precisamente por lo mismo; \"lleno a cagar, carisima la comida, filas eternas\".","replies":[]}]}]},{"poster":"FairBreak","date":"2016-04-27T22:19:25.607+0000","up_votes":7,"down_votes":0,"body":" estoy de acuerdo..","replies":[]},{"poster":"DarkHunter14","date":"2016-04-27T20:33:45.000+0000","up_votes":6,"down_votes":0,"body":"Toda la razón, hasta que el dinero corrompió a league of legends\r\n{{sticker:zombie-nunu-tears}} ","replies":[{"poster":"SHAKKAswaglife","date":"2016-04-27T22:18:40.467+0000","up_votes":6,"down_votes":0,"body":"el dinero corrompe todo al final era inevitable es la fuerza mas poderosa hoy en dia{{sticker:zombie-nunu-tears}} ","replies":[]}]}]},{"poster":"Nouthex","date":"2016-04-27T19:29:42.692+0000","up_votes":17,"down_votes":0,"body":" Al igual que Dagger tampoco soy de comentar ni nada pero de verdad encuentro que esta vez se pasaron.\r\n\r\nFestigame: No me parece bueno unir el festigame con campeonatos de lol, de partida por que las entradas llegan a estar el doble de precio y hay gente como mi pareja y yo que no nos gusta el festigame pero si el lol, entonces pagar 40.800 por 2 entradas para ver la final lo encuentro muy caro por que la verdad me da igual ver los stands del festigame.\r\n\r\nRiot: Deberían haber separado las entradas al igual que el festigame Ej: entradas solo para los partidos pero no para el evento del festigame 10.000, lo mismo que hizo la otra empresa tiene precios para solo ver los stands y demás evento pero no para los partidos y su precio es de 7.000 a 9.000 por día. por que no hicieron lo mismo? o rea muy difícil? de verdad encuentro que se pasaron mucho al poner las entradas a tal precio (20.400 para los que no saben).\r\n\r\nPersonal: encuentro que fue una muy mala inversión al hacer esto aparte son solo 1.000 entradas siendo que varias veces llenamos el movistar y en su ocasión el caupolican, no me he perdido ni 1 evento que ha echo Riot en Chile pero este me lo perderé por que se les ocurrió poner la final en un evento que no me gusta y no quiero pagar el doble solo para ver los partidos no lo encuentro nada justo. \r\n\r\nPD: Ojalas no se les vuelva a pasar por la cabeza hacerlo otra vez y si lo hacen sacar entradas solo para el evento y hacerlo en un lugar con mas butacas 1.000 no es suficiente para una comunidad de fans tan grande.","replies":[]},{"poster":"SeeleFrozen","date":"2016-04-27T21:53:08.652+0000","up_votes":15,"down_votes":0,"body":"Estudio Marketing y les digo que entiendo los motivos por lo cual creyeron que esta \"desición\" sería muy \"benficiosa\", pero considero que fue una PESIMA IDEA.\r\n\r\n1.- Los eventos de LOL están caracterizados por tener temáticas y actividades dedicada a los jugadores, acá tendrá cientos de actividades más que NO tienen que ver con el ideal del juego y que en ningun caso refuerza la pasión del jugador (no me digan que tendrán regalos, por que eso atrae y no fideliza).\r\n2.- Los precios son EXAGERADOS! a muchas personas el hecho de estar ahí conlleva un gasto muy alto (Pasajes de ida y vuelta + entrada + comida + tiempos de espera)... por lo que me parece un ABUSO de su parte y de los organizadores estos precios (se nota demasiado que lo unico que buscan es llenar aún más los bolsillos).\r\n3.- Cuando se hace un evento de lol facilmente llenan el movistar arena (que tiene una capacidad de 10.000 personas) y ahora serán 1.000 por día?. enserio tanta es la \"exclusividad\" que desean proyectar para dejar de lado a casi 7.000 posibles participantes?.\r\n\r\nNo se quien sea el encargado de tomar estas decisiones pero me temo que no tomaron en cuenta a quienes hacemos más grande este juego... LOS JUGADORES!.\r\n\r\n\r\nRiot, los quiero, pero no era la manera :/ ","replies":[]},{"poster":"ImRemu","date":"2016-04-27T17:09:37.343+0000","up_votes":9,"down_votes":0,"body":"Se me cayeron señores de Riot. Prefiero un evento de 1 dia pero hecho por ustedes. 1000 entradas es poco. Cuantas veces se ha llenado el movistar arena para demostrar que somos muchos los que vamos a sus eventos. Eso no mas, me decepcionaron {{item:3070}} ","replies":[]},{"poster":"gatone","date":"2016-04-27T20:39:17.291+0000","up_votes":8,"down_votes":0,"body":"Considero que es una burla para la comunidad este cambio dado que se ve muy reducido la cantidad de asistentes al evento, además de que existe una inflación desmesurada de las entradas (si comparamos los 5990 de la más barata a los 20400 que costará con este cambio) para poder ver la final. Por otro lado la medida es excluyente para aquellas personas que sólo disfrutan del LoL  y no de demás temas gamer, obligándolos a pagar mucho y disfrutar poco si lo comparamos con el formato de evento que se usaba hasta ahora.\r\nFinalmente considero que esta decisión se tomó de una manera demasiado radical, ya que podrían haber unido la final del circuito de leyendas y la promoción al festigame, ya que estos sucesos no tenían evento presencial hasta ahora y así lo obtendrían, además que un público de 1000 personas es suficiente para empezar con estos 2 sucesos de menor relevancia. Pero en el caso de la final de la CLS deberían haber mantenido el evento del Movistar Arena el cual permitia convocar a un numero mucho mayor de personas y disfrutar de cosas del LoL con mucha más profundidad, dando un mejor servicio a la comunidad.\r\nPD: Espero que este comentario lo llegue a leer un rioter, para que tenga algún peso como opinión.","replies":[]},{"poster":"Sana Saranghae","date":"2016-04-27T20:36:39.487+0000","up_votes":8,"down_votes":0,"body":"Cual es la mejor manera de demostrar el descontento, no ir al evento.","replies":[]},{"poster":"Zamael ","date":"2016-04-27T22:39:48.375+0000","up_votes":7,"down_votes":0,"body":"UN INSULTO A LA COMUNIDAD. No tiene otro nombre. De un evento que albergaba a mas de 10.000 personas, segmentar tanto a la cantidad de asistentes me parece irrisorio.\r\n\r\nLa gente que iba al movistar a ver las finales, no solo iba a verlos xq era un evento en vivo o por la fan bag, sino que iba por euforia y la adrenalina de un evento así, y sobre todo PORQUE LOS BOLSILLOS DABAN.\r\n\r\nSi quieren hacer eventos pequeños y con bajo nivel de costos, comprense un pequeño anfiteatro y transmitan todas las partidas desde allí, no es necesario que se coloquen al alero de un evento, que en mi consideración no le hace ningún favor a RIOT LAS. (he leído en muchos foros y de experiencias cercanas que Festigame es un criadero de olores)\r\n\r\nOtra cosa, he tenido la oportunidad de asistir a los dos evento hechos en el movistar arena y desde lo particular los he encontrado entretenidos por lo espacioso que son, puedes caminar y descansar en las pequeñas áreas verdes que te entrega el lugar. En general han sido bastante bien organizados y entretenidos, por lo cual no entiendo cual es la razón de hacer un evento más pequeño, en un peor lugar y más desfavorable para utds mismos, entiendase un evento SOLO para LOL y un evento donde el LOL es solo un componente más.\r\n\r\nEn síntesis RITO te me caíste feo.\r\n\r\n{{sticker:zombie-nunu-tears}} ","replies":[]},{"poster":"Binario","date":"2016-04-27T22:15:56.973+0000","up_votes":6,"down_votes":0,"body":"tampoco soy de comentar mucho pero si de leer, pero esta vez no me puedo callar , de quien fue la idea de juntarse con los sinverguenzas de festigame? los mismos que revendieron a tal nivel el evento el año pasado en la estacion mapocho, a tal punto que no se podia dar 2 pasos al frente sin chocar con alguien? y como si fuera poco, 1000 asientos? el lol facilmente llena el movistar arena con mas de 12mil espectadores y ahora tienen la genial idea de 1000 asientos apenas? que se fumaron? y como si fuera poco, 20mil pesos la entrada, acaso no piensan en que la comunidad solo de lol son mas de 1000 personas? en que estaban pensando? que pasa con toda esa gente que no le interesa el sobrevendido evento \"festigame\" por que ya sabemos a lo que nos enfrentaremos (colas de 3 horas para probar durante 5 minutos un juego, lo caro que sale comprar comida dentro del evento, por que tampoco te dejan entrar con comida) lo lamento pero creo que esta vez se cayeron mas feo que cuando les dieron cajita 2x1 a LAN como \"premio de consuelo\" \r\n\r\nlamentable, me gustaria que un rioter me diera alguna explicacion si es que llega a leerlo ","replies":[]},{"poster":"PaNaCe4","date":"2016-04-27T21:06:37.284+0000","up_votes":6,"down_votes":0,"body":"Se cayeron feo, pensaba ir con mi novia pero creo que mejor invertiré en una cena. Lo mas gracioso es que le colocan el típico mensaje subliminal: ¡se agotaran muy rápido!. {{sticker:zombie-brand-facepalm}} ","replies":[]},{"poster":"2l2","date":"2016-04-27T17:21:45.664+0000","up_votes":5,"down_votes":0,"body":"Es muy poquito y muy caro... 1000 entradas a 20 mil me parece un desperdicio, es como una fiesta vip. Quizas lo compensen dando regalos únicos.","replies":[]},{"poster":"paxtron67","date":"2016-04-27T16:33:37.795+0000","up_votes":5,"down_votes":0,"body":"Tenían que ser junto a la festigame? {{item:3151}} \r\n{{sticker:zombie-nunu-tears}} ","replies":[]},{"poster":"ElTronador","date":"2016-04-27T22:47:39.842+0000","up_votes":7,"down_votes":2,"body":"Che las, es más que Chile rito. También es Argentina, uruguay, Paraguay y Bolivia. Me parece que además de errar tremendamente en donde hacen la final, también le erran en el país, que nuevamente es Chile, en Buenos Aires el único evento que hubo fue el de aguas turbias. No digo que sea una cagada, pero se juega toooooda la copa en Chile, la final es en Chile, una ves a otro país le toca. Besis","replies":[{"poster":"Rhyden","date":"2016-04-28T01:33:36.639+0000","up_votes":2,"down_votes":1,"body":"la LCK, LCS EUW, LCS NA, LPL se hacen todas siempre en la misma ciudad, no se trata de localismo, es un tema de instalaciones y personal de trabajo, no puedes estar cambiando las instalaciones y el personal todos lo años para llevarte todo a otro pais.","replies":[{"poster":"ElTronador","date":"2016-04-29T00:57:05.733+0000","up_votes":1,"down_votes":0,"body":"Te equivocas. \nPrimero, yo estoy hablando de la final. \nLa final de la na lcs este año se hizo en Las Vegas, el año pasado en New York, mientras que la transmisión general se hace en Los Angeles. La de Eu lcs, se hizo en Suecia (creo), El año pasado en España, mientras que la transmisión general se hace en Berlin. Y puedo seguir así todos los años...\n\nY no estoy pidiendo que se jueguen todas las fechas en otros países, lo que estoy diciendo que se juega tooda la temporada en Chile, se juega la final del apertura en Chile, y la próxima final, también es en Chile! No creo que les cueste tanto moverse por un par de partidos...\nSalu3","replies":[]}]}]},{"poster":"Cadenas","date":"2016-04-27T20:57:11.836+0000","up_votes":4,"down_votes":0,"body":"Buenas estimada comunidad de LoL:\r\n\r\nSoy un jugador de región (La Serena) y he asistido a los últimos 2 eventos con mi hermano ... lo he pasado la raja a excepción del ultimo en donde me \"desquite\" en un post hace poco tiempo por perder harto tiempo en un evento de comunidad. Nunca he asistido al Festigame por que se hace en varios días y yo al ser profesor no puedo llegar y faltar a mi trabajo para asistir...ademas que la fecha es cuando ya se terminan las vacaciones de invierno en los establecimientos educacionales.... Mi molestia no es la cantidad de días, sino la programación que se realizo ya que la paso la raja en las finales. Al final se realizo el evento SOLO para las personas que son de Santiago ya que ellos lo aprovechan mucho mejor que yo, debido a que tienen todo a mano, en cambio yo debo viajar, hospedarme y luego volver a mi hogar (gasto 12 horas aprox de viaje en ida y vuelta para ir y volver de Santiago) me imagino a las demas personas que son del sur o mas del norte.\r\n\r\nLa decision ya fue tomada por ustedes, y en realidad no estoy conforme ... en realidad yo queria volver a ir al proximo evento... canjear mis poro galletas.... y así no voy a poder.\r\n\r\nEspero volver a ir al proximo evento y rezar a que me acepten mis porogalletas en el proximo evento.","replies":[]},{"poster":"Makostrike","date":"2016-04-28T14:48:51.001+0000","up_votes":2,"down_votes":2,"body":"Generalmente no comento porque se tiende a caer en discusiones sin sentido, mis apreciaciones:\n\n1.- En si es \"caro\", el que puede pagar que vaya y el que no, puede verlo vía streaming. Acá y en la China siempre prima el beneficio monetario, Riot es una empresa y como tal necesita ganancias. Los que viven en la utopia del mundo bello donde nada cuesta y pueden disfrutar sin fin, deben hacer un replanteamiento de como ven el mundo, considerando que LOL es un juego gratis y aún peor viven quejándose por todo.\n\n2.- No creo que sea el caso, pero pueden tomarlo como castigo. Leí varios post donde comentan que Riot \"debería preocuparse de hacer eventos mejores y preocuparse por la comunidad\". Me pregunto si los que dicen eso por acá son los mismos que hicieron gala de su gran educación en el evento anterior, al lanzar las famosas \"bolitas\" a la cancha, ensuciando un evento que precisamente esta hecho para que todos ustedes disfruten y lo más lindo fue la imagen que dieron, dando la razón a todos los que dicen que la región es la peor. Bravo.\n\n3.- Chicos, está bien, no es lo que ustedes quieren. Pero piensen bien y reflexionen antes de opinar. lo que diré a continuación por favor con altura de miras (dejando de lado lo de Festigame):\nSé que la mayoría de los que juegan son niños o adolescentes por lo que no se puede pedir un nivel discusión muy elevando sin caer en ofensas (salvo algunos casos), suena feo, pero es la verdad, con el tiempo se darán cuenta. Se quejan del server (Riot no tiene la culpa que muchos de sus planes de internet sean malos), se quejan de las ofertas (cuando son para su beneficio), se quejan de la comunidad (que son ustedes mismos), se quejan de los cambios (que son pensados para mejorar su experiencia de juego), se quejan de los splash art (cuando en foros hay comentarios de RITO PLS actualiza el arte) quejas, quejas, quejas. \nChicos Riot es una empresa, no una fundación, siempre va a cambiar para adaptarse porque eso es lo que hacen las empresas. Estamos en una economía de mercado, si no les gusta se pueden ir, ofertas hay varias. Claro está que a Riot ni a ninguna empresa le importa mucho tener fuga de clientes, porque si se van 2 un día al día siguiente llegan 10 y esos clientes estarán cautivos un buen tiempo. En el caso de LOL la mayor fuga es debido a la comunidad ¿Ustedes creen que es fácil hacer un juego, mantener un servidor, revisar sistemas, analizar datos, infraestructura de red, atender a miles de personas, etc, piensan en el esfuerzo humano que hay detrás? Más aún tratar de mantener contenta a una comunidad en su es mayoría negativa, falta de respeto e insulsa y ante todo lo que se les ofrece solo hay un rotundo NO ME GUSTA ¿Que quieren?.\nCreanme que si ustedes fuesen la empresa y Riot el cliente hace rato se hubiese retirado o exigido la devolución de su dinero porque la calidad que tienen muchos de ustedes es pésima. \nYo soy adulto, trabajo y pago mis cosas y efectivamente si algo no me parece bien dejo de invertir mi dinero y me voy, porque lo que gano trabajando también es tiempo de mi vida invertido y eso tiene un valor incalculable, por ello cuido mucho mis gastos. Hasta el momento tengo cero quejas hacia Riot porque como empresa funciona y bastante bien. Espero que cambien cuando entiendan que detrás de todo siempre hay un esfuerzo, unitario o colectivo. Aún cuando sea gratis.\n\nEstimados el gran problema de LOL no es Riot ni sus cambios, es la comunidad. Analicen bien su forma de comportamiento, si todo se cambiase por un trato más amable y educado, creanme que la realidad sería otra.\n\nSorry la extensión XD, fue un desahogo al leer tanto sin sentido de forma permanente. Los que leyeron todo ,muchas gracias.\n\nSaludos!\n\n","replies":[{"poster":"Agalloch","date":"2016-04-28T17:18:43.663+0000","up_votes":3,"down_votes":0,"body":"Resumen de tu papiro:\r\n\r\nRito te amo, hagas lo que hagas esta bien. El juego es gratis y nadie puede reclamar. Todos ustedes son unos ratas y yo soy muy maduro.\r\n__________________________________________________\r\n\r\nEsta bien que rito sea una empresa y que el juego sea gratis, pero no olvides que se deben 100% a nosotros, la comunidad. Si hacen algo mal (como lo de lan con los premios y ofertas de consuelo) es obvio que la comunidad tiene el derecho a sentirse pasada a llevar como en esta ocasion.\r\n\r\nQuizas tu no sientes la misma pasion por los esports que otra gente que vibra en los eventos MASIVOS, y le chupa un huevo el verlo frente a un pc comiendo papitas. Hay que reconocer que rito la cago.\r\n\r\nCuando el malestar es tan generalizado como lo es ahora, quizas tu deberia replantearte a quien das tu apoyo ciegamente.\r\n\r\nSaludos!\r\n\r\n","replies":[]}]},{"poster":"Ravencloud11","date":"2016-04-27T23:49:13.461+0000","up_votes":3,"down_votes":0,"body":"se llenan la boca hablando de basta a la xenofobia pero en 3 años de servidor solo hicieron 2 eventos fuera de chile. lindo localismo no? ","replies":[]},{"poster":"Matison","date":"2016-04-27T20:38:52.724+0000","up_votes":3,"down_votes":0,"body":"Para ir a la LCS cuesta $15.00 USD (Alrededor de $10.500 si tomamos el valor del dolar en los ultimos 6 meses) y tengo mas comomidad y calidad que pagar casi el doble, me parece una estupidez que alguien vaya a pagar $20.000 (CASI 29 DOLARES), pero bueno, el dinero mueve el juego..","replies":[{"poster":"Ravencloud11","date":"2016-04-27T23:54:33.994+0000","up_votes":1,"down_votes":0,"body":"hasta desde buenos aires es mas barato ir a la final de la lcs.  o sea si nos sale barato a nosotros y  ustedes igual... es un desperdicio. ","replies":[{"poster":"Lysaru","date":"2016-04-29T23:06:10.329+0000","up_votes":1,"down_votes":0,"body":"Como va a hacer mas barato ir a la final de la lcs desde buenos aires, so' loquito bo?","replies":[]}]}]},{"poster":"Kput","date":"2016-04-27T20:21:43.817+0000","up_votes":4,"down_votes":1,"body":"Acá en Chile son muy descarados con los precios de los conciertos eventos en vivo etc, pero eso no cambiará ya que la gente lo paga igual.\r\n\r\nPor mi lado siendo que mi sueldo me permite comprar las entradas sin problemas encuentro que es realmente un robo por un evento de este tipo, así que pasó de comprar entradas para algo asi.","replies":[]},{"poster":"CamiIo","date":"2016-04-27T21:40:07.669+0000","up_votes":2,"down_votes":0,"body":"No entiendo, Las que dice esa dE Abono + Lol solo esa ssirven para ir ah verlos ?, osea que son 45.000? o la de abono solo ya me sirve? el que sepa digamos plox cajita si entiendo.\r\n","replies":[]},{"poster":"DoctorWatson","date":"2016-04-27T16:23:11.207+0000","up_votes":2,"down_votes":0,"body":"Que trae el FanBag? En vola sale mejor comprar los rp para la skin, igual que este año con {{champion:412}} ","replies":[{"poster":"Hell Darking","date":"2016-04-27T16:32:58.168+0000","up_votes":1,"down_votes":1,"body":"eso mismo estoy esperando, a ver que skin trae.. para ver si sale rentable (ahora si es una de edicion limitada como las de la PAX obligado a comprar nomas)","replies":[{"poster":"Matison","date":"2016-04-27T20:42:27.010+0000","up_votes":2,"down_votes":0,"body":"Lo dudo","replies":[]}]}]},{"poster":"JACKY FANBOY","date":"2016-04-27T15:25:30.803+0000","up_votes":2,"down_votes":0,"body":"¿La entrada es a parte de la de festigame ?","replies":[]},{"poster":"Watta","date":"2016-04-27T22:37:42.584+0000","up_votes":5,"down_votes":3,"body":"ni loco pago para ver a virgos jugar a lol para eso me quedo jugando en mi casa  al lol jaja ","replies":[{"poster":"Lysaru","date":"2016-04-29T23:09:23.277+0000","up_votes":1,"down_votes":0,"body":"pues ami me gustaria ser uno de esos virgos, en especial los de europa/usa/china, cobran muchisimo, viven gratis, y tienen novias (interesadas, por supuesto pero para pasar el rato no esta mal :p) y todo por ser buenos en un juego xD\r\n\r\n","replies":[{"poster":"Watta","date":"2016-05-01T19:38:31.431+0000","up_votes":1,"down_votes":0,"body":"digo pagar por verlos los virgos q pagan por verlos , ni loco ahora si yo soy el q juego y me pagan por jugar  juego , no entendiste nada maquina de protones","replies":[{"poster":"Lysaru","date":"2016-05-01T20:49:47.809+0000","up_votes":1,"down_votes":0,"body":"\"ni loco pago PARA VER A VIRGOS jugar a lol\"\n\nTe pasas de lince maquinola.\n\nbua hay gente que le gusta, lo mismo se aplicaria para los que van a la cancha a ver futbol/tenis/basket o cualquier otro deporte xD","replies":[{"poster":"Watta","date":"2016-05-01T23:33:24.756+0000","up_votes":1,"down_votes":0,"body":"pero eso es un deporte de verdad","replies":[{"poster":"Lysaru","date":"2016-05-01T23:47:58.499+0000","up_votes":1,"down_votes":0,"body":"no tiene nada que ver","replies":[{"poster":"Watta","date":"2016-05-02T02:09:46.416+0000","up_votes":1,"down_votes":0,"body":"si","replies":[{"poster":"Lysaru","date":"2016-05-03T14:10:36.794+0000","up_votes":1,"down_votes":0,"body":"nop en absoluto, es mas el mundial 2014 supero en viewers al super bowl.","replies":[{"poster":"Watta","date":"2016-05-03T14:28:04.460+0000","up_votes":1,"down_votes":0,"body":"igual te guste o no no lo es","replies":[{"poster":"Lysaru","date":"2016-05-03T17:45:09.744+0000","up_votes":1,"down_votes":0,"body":"te guste o no es un deporte, que pena que solo conoscas los deportes fisicos","replies":[{"poster":"Watta","date":"2016-05-05T02:18:49.490+0000","up_votes":1,"down_votes":0,"body":"no es un deporte es un jueguito electronico :D","replies":[]}]}]}]}]}]}]}]}]}]}]},{"poster":"tomasrayo2","date":"2016-10-18T19:48:42.125+0000","up_votes":1,"down_votes":0,"body":"cuando es el evento","replies":[]},{"poster":"Ashrea","date":"2016-07-26T19:04:44.681+0000","up_votes":1,"down_votes":0,"body":"estoy de acuerdo con todos los comentarios,   habíamos ido con mi pololo las 2 veces anteriores por que  si tan caro no era gastar  en las 2 entradas considerando que vamos de Valpo, pero tan caro!! un verdadero ROBO {{sticker:zombie-brand-mindblown}} ","replies":[]},{"poster":"ElRulillo","date":"2016-05-02T18:56:39.903+0000","up_votes":1,"down_votes":0,"body":"un asco total, de un evento enfocado a la comunidad, ahora esta enfocado solo a las lucas :P{{sticker:zombie-brand-facepalm}} ","replies":[]},{"poster":"Anøther Gunner","date":"2016-05-01T08:06:51.103+0000","up_votes":1,"down_votes":0,"body":"hola..no es por nada pero supongo q la fanbag y los privilegios seran mejor q en el movistar arena ya q la entrada vale casi el triple..","replies":[]}]}