{"poster":"[NEM SIKER칖LT KIOLVASNI]","date":"2019-05-13T20:00:41.572+0000","title":"Actualizaci칩n de Trials: semana 1","subforum":"Anuncios","up_votes":0,"down_votes":0,"body":"[칖RES]","replies":[{"poster":"Ecnos","date":"2019-05-13T20:55:41.581+0000","up_votes":43,"down_votes":22,"body":"Jajaja que ir칩nica es la vida. Todo el fandom de los youtubers y칠ndose al Consejo como OVEJAS solo porque se lo dec칤an y ahora resulta que quedaron 칰ltimos. xDD\r\n\r\nEso demuestra que hay que elegir tu propio camino y no el que te dicen otros, hay que tener personalidad propia. 춰Que gane la UNI칍N! &lt;3\r\n{{sticker:slayer-pantheon-popcorn}} ","replies":[{"poster":"Matt Walls","date":"2019-05-13T21:48:21.804+0000","up_votes":58,"down_votes":13,"body":"Ir칩nico? Ir칩nico es que gane una escuadra que para nada representa a esta comunidad. Uni칩n? Desde cuando un par de t칩xicos con complejo de superioridad se unen, juegan juntitos para llegar a la victoria y despues se dan unos besitos en la mejilla?{{sticker:sg-miss-fortune}} ","replies":[{"poster":"SliceAndDice","date":"2019-05-13T23:44:29.196+0000","up_votes":19,"down_votes":4,"body":"{{sticker:slayer-pantheon-thumbs}}  100% de acuerdo con vos como se nota que jugas en LAS, el primer comentario coherente que leo","replies":[{"poster":"Linker","date":"2019-05-14T03:01:16.403+0000","up_votes":4,"down_votes":0,"body":"Los resultados son de manera mundial, no solo de Las","replies":[]}]},{"poster":"Ecnos","date":"2019-05-13T23:05:46.530+0000","up_votes":20,"down_votes":9,"body":"쮸caso alguna escuadra representa a la comunidad? Ninguna de las 4 lo hace en su totalidad, ya que la comunidad se conforma de todo tipo de usuarios y cada uno es diferente del otro.\r\n\r\nLa Uni칩n son justamente los que estamos en contra del comportamiento Toxico y los que dejamos el egocentrismo de lado para apoyar al equipo y ganar unidos. Que este ganando esta facci칩n me da aun esperanza en este juego.\r\n\r\nTe vendr칤a bien dejar tu ego de lado porque veo que representas justamente lo que mencionas, un usuario TOXICO del juego. =) &lt;3\r\n{{sticker:sg-ahri-2}} ","replies":[]}]},{"poster":"This is Stan","date":"2019-05-13T23:04:11.741+0000","up_votes":19,"down_votes":0,"body":"Yo eleg칤 el Consejo porque me representaba, era la que m치s iba conmigo, no me gustaba que est칠 representada por Jayce pero a칰n as칤 la eleg칤 porque soy el tipo de jugador estrat칠gico al que apunta esa facci칩n, no ten칤a ni idea de eso que dec칤s de los \"youtubers\". Eleg칤 mi propio camino y no por eso mi facci칩n esta primera, as칤 que tu comentario no tiene sentido xd","replies":[]},{"poster":"Alfa19935","date":"2019-05-13T21:42:12.972+0000","up_votes":8,"down_votes":1,"body":"jajaja es cierto eso cada uno deberia elegir la faccion que prefiera que valla con su personalidad. Por ahora mi faccion va 3era los anonimos pero resien va la primera semana no vamos a decaer y seguiremos luchando. Hasta el final","replies":[]},{"poster":"zZxtuacesinoxZz","date":"2019-05-13T21:39:46.071+0000","up_votes":4,"down_votes":0,"body":"tal cual amigo\r\n","replies":[]},{"poster":"HirotoXx","date":"2019-05-14T00:49:18.002+0000","up_votes":1,"down_votes":0,"body":"personalmente asumo que es por todo ese fandom de youtubers que el consejo est치 tan mal, la mayor칤a no sabe jugar estrategicamente, as칤 como jugar en equipo, por lo cual es feo ver a una facci칩n que representar칤a cosas tan buenas y utiles para los jugadores caer tan bajo {{sticker:zombie-nunu-tears}} ","replies":[{"poster":"EEP99","date":"2019-05-14T02:14:01.815+0000","up_votes":5,"down_votes":1,"body":"De hecho en su mayor칤a ninguna escuadra representa lo que deber칤a, por ejemplo, la mayor칤a de los del consejo que me han tocado son el t칤pico main Vayne o main Sup que no pone wards y solo sigue la kill pero se unieron ah칤 solo por los youtubers, los de la Uni칩n son los primeros en tirar surrender y los mas flamers pero se unieron porque \"nunca me rindo de jugar este juego de mierda aunque me toquen puros bronces, voy a subir a oro aunque todos sean unos mancos\", los de los an칩nimos en su mayor칤a me han tocado los que juegan los champs rotos del parche y nada mas, no tienen nada de esa supuesta innovaci칩n que deber칤an pero est치n en ese grupo solo porque est치n en el mismo que Faker y los de la cuadrilla son los primeros en tiltearse cuando mueren una vez y seguir muriendo debido al enojo que provoco la primera muerte, es decir son los que mas fedean pero se unieron ah칤 solo porque hicieron un pentakill con Yasuo o Darius en una partida que los fedearon... No todos son as칤 pero si lo son un 70% de cada escuadra, al menos yo estaba entre unirme a la Uni칩n o al Consejo pero termine optando por el segundo porque la 칰nica raz칩n por la que juego lol es por la parte estrat칠gica (de mec치nicas pues no mucho XD), despu칠s me arrepent칤 porque gran parte de mi lista de amigos que es de la Uni칩n son gente que yo les ense침e a dejar de flamear y nunca surrendear al minuto 20 pero en fin, el punto es que faltaron o sobraron casas, 4 es el peor numero, son muy pocas para que cada uno se sienta identificado con algo concreto (muchos An칩nimos y de la Uni칩n se unieron a esas solo porque no se sent칤an identificado con ninguna y esas dos eran las que menos los echaban hacia atr치s) y tambi칠n muchas para que puedas identificarte con algo general (por ejemplo yo que me debat칤a entre el Consejo y la Uni칩n)\r\n\r\n{{sticker:zombie-brand-facepalm}} {{sticker:zombie-brand-clap}} ","replies":[]}]},{"poster":"Retlaw","date":"2019-05-13T22:30:23.619+0000","up_votes":3,"down_votes":0,"body":"Que youtubers mandaron a decir que se metan al Consejo?","replies":[]}]},{"poster":"diegoslash","date":"2019-05-13T23:09:56.280+0000","up_votes":9,"down_votes":0,"body":"La Uni칩n va ganando {{sticker:sg-syndra}} \r\nsera la hermandad la que triunfe \r\nnosotros forjaremos nuestra propia leyenda\r\nseremos los que cuenten la historia cuando esta guerra termine \r\n\r\n","replies":[{"poster":"InuHs","date":"2019-05-14T03:11:50.714+0000","up_votes":4,"down_votes":0,"body":"todos saben lo toxico que es la comunidad y dices hermandad lul","replies":[]},{"poster":"Omega Darkon","date":"2019-05-14T01:19:03.700+0000","up_votes":4,"down_votes":0,"body":"Su lema deber칤a ser: Divide y vencer치s, la Uni칩n trae la fuerza","replies":[]}]},{"poster":"BonKarma","date":"2019-05-13T20:32:06.993+0000","up_votes":11,"down_votes":2,"body":"쯘n serio los anonimos le estan ganando al consejo? pero que le pasa al mundo ","replies":[]},{"poster":"Fransoi ","date":"2019-05-13T20:31:18.219+0000","up_votes":14,"down_votes":5,"body":"vamo la union a nunca rendirse !!","replies":[]},{"poster":"Samalia","date":"2019-05-13T22:17:08.087+0000","up_votes":3,"down_votes":0,"body":"estoy leyendo mucho que algunos que pertenecen a cierta facci칩n le est치n tocando personas de su misma facci칩n, cuando juego me han aparecido muchos jugadores de la uni칩n (casa a la cual pertenezco) no ser치 que riot esta juntando a los de las misma facci칩n en cada partida {{sticker:sg-lux-2}} ","replies":[{"poster":"ToraYasashi","date":"2019-05-13T22:47:38.888+0000","up_votes":7,"down_votes":0,"body":"mejor, te emparejan con quienes juegan y piensan como uno mismo, no quiero imaginarme como la estan pasando los anonimos {{sticker:sg-miss-fortune}} ","replies":[]},{"poster":"DestroyAgC","date":"2019-05-13T22:34:17.726+0000","up_votes":5,"down_votes":0,"body":"ultimante mis partidas son agradables Union ","replies":[]}]},{"poster":"SGG Press Start ","date":"2019-05-14T00:49:21.311+0000","up_votes":8,"down_votes":1,"body":"He leido la mayoria de los comentarios, y la verdad todavia no logro entender una cosa, todos hablan de \"gente toxicas\" pero lo qe no entienden es qe ustedes mismos son toxicos, no puedo creer qe se esten peleando o discutiendo por esto, en vez de divertirse y dejar las peleas de lado, muchachos, a fin de mes riot no les paga la comida, dejen de darle importancia a cosas qe no la tienen, es un juego, y como tal la unica meta es qe todos pasemos un buen rato, por eso hacen este tipos de eventos","replies":[]},{"poster":"Kira13","date":"2019-05-13T21:53:11.128+0000","up_votes":8,"down_votes":1,"body":"Vamos LA UNION qe se puede ganar :u {{sticker:slayer-jinx-catface}} ","replies":[]},{"poster":"Neromatsu","date":"2019-05-13T21:32:10.070+0000","up_votes":6,"down_votes":3,"body":"\"Si tienes un problema, llamas a Braum {{champion:201}} \" 쯫 de donde es ese lindo champ? De ****La Uni칩n!!**** Y pensar que nos hac칤an/hacen el re bullying y ah칤 nos tienen &lt;3 춰A aguantar y carrear que llegaremos primeros a la 칰ltima semana! 춰la uni칩n hace la fuerza!","replies":[{"poster":"Omega Darkon","date":"2019-05-14T01:03:43.514+0000","up_votes":6,"down_votes":0,"body":"Nunca le칤ste el cuento de la tortuga y la liebre???","replies":[{"poster":"l Ph4ntom l","date":"2019-05-14T02:07:33.380+0000","up_votes":3,"down_votes":0,"body":"jajaja c mamo ","replies":[]}]}]},{"poster":"GioCero","date":"2019-05-13T23:09:42.269+0000","up_votes":6,"down_votes":0,"body":"ya quiero ver la cara de coolife cuando vea que su facci칩n va ultima, despu칠s de tanto que dec칤a que la mejor era el consejo y que todos se unieran a esa xd\r\n{{sticker:sg-miss-fortune}} ","replies":[{"poster":"Gonk","date":"2019-05-14T05:07:09.144+0000","up_votes":2,"down_votes":0,"body":"Ya no estaba muerto el?(me refiero a su canal sjsj)","replies":[]}]},{"poster":"Nurarihyon13","date":"2019-05-13T22:48:09.921+0000","up_votes":8,"down_votes":2,"body":"Que ir칩nico que vaya ganando la union, siendo que la comunidad justamente es conocida por lo opuesto. \r\nEsto puede dar mucho que pensar, quizas la actitud y las ganas de ser unidos si est치, pero es dificil de ejecutarlo en el juego. Quiz치s si haya una esperanza para que esta comunidad deje de ser tan toxica. Rito tendra mucho para pensar(?","replies":[{"poster":"HazardRoz","date":"2019-05-14T00:10:08.202+0000","up_votes":5,"down_votes":0,"body":"Pasa que los toxicos se reparten entre Guerrilla y Anonimos xD luego lo mas comun a identificarse es con Valor, y pues El Consejo qued칩 칰ltimo, pero no eligiria otra casa si me diesen otra posibilidad de elecci칩n.","replies":[]}]},{"poster":"Vliero Joestar","date":"2019-05-13T20:29:02.645+0000","up_votes":12,"down_votes":6,"body":"aguante la UNION VIEJAS","replies":[]},{"poster":"Fredli","date":"2019-05-13T23:40:28.576+0000","up_votes":3,"down_votes":3,"body":"Yo me met칤 al rojo porque ni sabia donde apretar y pum cuando me di cuenta estaba en los an칩nimos, igual me importa 3 hect치reas de verga.\r\n{{sticker:sg-lulu}} ","replies":[{"poster":"TM Prongs","date":"2019-05-14T01:06:06.993+0000","up_votes":5,"down_votes":0,"body":"son 3000 metros cuadrados de verga. eso es mucha verga.","replies":[]},{"poster":"HazardRoz","date":"2019-05-14T00:21:16.659+0000","up_votes":6,"down_votes":1,"body":"Esas son muchas vergas....\r\n{{sticker:sg-ezreal}} ","replies":[]}]},{"poster":"BETINH0","date":"2019-05-13T22:07:07.200+0000","up_votes":6,"down_votes":1,"body":"Aguante La Uni칩n carajo! yo sab칤a que 칤bamos a liderar {{sticker:slayer-pantheon-thumbs}} somos la ley, demas facciones arrodillense ante su ascendido Dios. saludos! ","replies":[]},{"poster":"The Blood Lord","date":"2019-05-14T01:34:52.762+0000","up_votes":4,"down_votes":0,"body":"Yo elegi el rojo porque me gusto el iconito C:","replies":[]},{"poster":"destrut123","date":"2019-05-14T01:08:29.602+0000","up_votes":4,"down_votes":0,"body":"los an칩nimos wn se suponen que deb칤an destruir a la cuadrilla no ser destruida por ELLA >:v{{sticker:zombie-brand-facepalm}} ","replies":[]},{"poster":"Jaheje","date":"2019-05-14T00:20:57.716+0000","up_votes":4,"down_votes":0,"body":"Vamos la uni칩n csm !","replies":[]},{"poster":"Keramerr","date":"2019-05-14T00:10:41.274+0000","up_votes":4,"down_votes":0,"body":"Jajaja y yo pensando que nadie se iba a unir a La Union y resulta que somos los que estamos ganando hasta ahora,que cosas xD (eleg칤 La Union porque me gusta jugar en equipo y lo doy todo por el team con tal de ganar jaja)\r\n{{sticker:sg-kiko}} ","replies":[]},{"poster":"Refaz911","date":"2019-05-13T23:53:51.625+0000","up_votes":4,"down_votes":0,"body":"weno los anonimos vamos 3 asi que tendremos que trollear, obviamente es la respuesta {{sticker:slayer-pantheon-thumbs}} \r\n","replies":[]},{"poster":"SoulFox21","date":"2019-05-13T23:03:35.864+0000","up_votes":4,"down_votes":0,"body":"VIVAAA LA UNIOOON CARAJOOOO PRIMER PUESTO Y VAMOS A POR LA ULTIMA SEMANA :3","replies":[]},{"poster":"Darkiann","date":"2019-05-14T01:33:02.198+0000","up_votes":5,"down_votes":1,"body":"Ir칩nico que la Uni칩n vaya primera a pesar de estar lleno de gente flamer, que juega sola, que tiene 0 compa침erismo y apoyo por los otros","replies":[]},{"poster":"elcapomanLOL","date":"2019-05-13T22:00:57.655+0000","up_votes":5,"down_votes":1,"body":"Vamos la uni칩n!! Siempre confie en esta casa nunca lo dude {{sticker:slayer-pantheon-thumbs}} ","replies":[]},{"poster":"Buster Bac0n","date":"2019-05-14T02:26:32.539+0000","up_votes":3,"down_votes":0,"body":"El consejo: \r\n- Primera sangre del enemigo.\r\n- Se tiltea y tira surrender todo el game \r\n- \"gg no team, no saben sacar objetivos\"\r\n- REPORT BOT Y JUNGLA (el top es su duo)\r\nD E F E A T \r\n{{sticker:zombie-brand-clap}} \r\n\r\n(tranquilo, es s칩lo una dramatizaci칩n)","replies":[]},{"poster":"Marsohn","date":"2019-05-14T00:18:22.478+0000","up_votes":3,"down_votes":0,"body":"Si hubiera seguido mi instinto de supp(? estaria con La Union, q sad :v","replies":[]},{"poster":"xAlanx","date":"2019-05-13T23:15:08.325+0000","up_votes":3,"down_votes":0,"body":"sii vamos la union\r\n","replies":[]},{"poster":"fashonista","date":"2019-05-13T21:01:53.279+0000","up_votes":5,"down_votes":2,"body":"vamos la uni칩n carajo...!!!","replies":[]},{"poster":"ToxicSh00ter","date":"2019-05-13T21:12:59.108+0000","up_votes":8,"down_votes":5,"body":"Wow, la cuadrilla va 2do pense que estabamos mucho mas atras lol\r\n\r\nLa cuadrilla nos tiramos el team al hombro es solo cuestion de tiempo para que carreemos al 1er puesto!\r\n#TeamCuadrilla","replies":[]},{"poster":"Powernick","date":"2019-05-14T19:21:58.899+0000","up_votes":2,"down_votes":0,"body":"Yo eleg칤 los an칩nimos porque son rojos, c칩mo la Horda, corta la bocha.{{sticker:vlad-salute}} ","replies":[]},{"poster":"Minebra Is Real","date":"2019-05-14T14:46:26.981+0000","up_votes":2,"down_votes":0,"body":"por lo menos va ganando \"la comunidad menos toxica\" (no en su totalidad obvio).","replies":[]},{"poster":"Artifiken Zohir","date":"2019-05-14T14:43:29.187+0000","up_votes":2,"down_votes":0,"body":"Entiendo que ven a la mayoria de los integrantes de la cuadrilla como los Main Yasuo, los t칩xicos y eso. Yo estoy en esa casa y me pone triste que este asociado ser playmaker con ser t칩xico. Lamentablemente, si hay muchos toxicos en mi casa, y me gustaria que no fuera as칤, pero todos estamos agradecidos cuando un asesino o un hypercarry nos carrea por ir fedeado... y esos suelen ser de la cuadrilla. Lo ideal ser칤a si cada casa solo destacara en cosas buenas, pero los t칩xicos est치n en todos lados. Intentemos destacar las cosas buenas de cada casa de cada compa침ero de equipo. La valent칤a de cuadrilla, la inteligencia de consejo, la fortaleza de uni칩n y la creatividad de an칩nimos, quiz치s la manera de eliminar la toxicidad sea esa...  empezar por destacar las cosas buenas en vez de solo pensar en lo malo, no solo en lo propio sino en lo ajeno. A mi por ejemplo, una de las cosas que mas me hace feliz es cuando despu칠s de haber ganado, el equipo se felicita mutuamente. O incluso si perdemos, felicitar al que jug칩 bien y alentarnos a ganar, y dejar claro que tener una mala partida NO TE HACE MALO. Despu칠s de todo si estamos motivados y no caemos en frustraci칩n es m치s f치cil ganar.\r\nAtentamente, miembro orgulloso de cuadrilla 游눞","replies":[]},{"poster":"JiraiyaSensei92","date":"2019-05-14T10:55:03.412+0000","up_votes":2,"down_votes":0,"body":"Viva la Uni칩n!!! es lo 칰nico que te llevara a la Victoria soy Main Jg y me siento super identificado con la uni칩n si no se logra esto en el team no hay armon칤a y sin armon칤a por mas que seas un carreador para mi gusto no ganas, es satisfactorio cargarte un team a tu espalda y ganarlo solo....pero ganar de a 5 es de esto el combate en la grieta sos vos y tus compa침eros es aportar entre todos la misma causa explotar el nexo enemigo. Es ayudar a tu l칤nea complicada es aumentar el potencial de la mejor y as칤 generar una uni칩n donde todos sean participes de la misma victoria. Sigamos asi ganemos el Trials!!\r\n\r\n{{sticker:garen-swing}} \r\n\r\n\"No importa cuantos sean nunca me rendir칠!\"","replies":[]}]}