{"poster":"MrMinecraft","date":"2015-07-05T13:46:10.556+0000","title":"Ständige Reconnects im Main Menu","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Guten Tag liebe Community,\r\nHiermit ersuche ich einmal etwas Hilfe, da ich langsam am Ende mit meinem Latein bin. Es handelt sich hierbei um einen Fehler, welcher nur das Hauptmen&uuml; betrifft bzw. die Spielsuche. Das hei&szlig;t im Konkreten: Ich disconnecte einfach vollkommen wahlos f&uuml;r einige Sekunden, bevor er mich wieder verbindet. Das ist super nervig, wenn ich den Teambuilder benutzen m&ouml;chte (schlie&szlig;lich sucht man manchmal einige Minuten), da er mich dann einfach aus der Lobby &quot;schmei&szlig;t&quot;. Ich selbst sehe mich noch in der Teambuilder Lobby und kann schreiben, aber f&uuml;r Andere bin ich &quot;unsichtbar&quot;, aber sie k&ouml;nnen meine Nachrichten lesen.\r\nDieser Fehler passiert zu v&ouml;llig verschiedenen Zeiten und ich habe ihn seit ein paar Wochen. Eine Neuinstallation von LoL hat nicht geholfen, genauso wie die g&auml;ngigsten Tipps, die man zu dem Thema nachschlagen kann. Ich selbst habe mein Antivir (ESET Smart Security) in Verdacht, aber die Einstellungen sollten das Netzwerk gr&ouml;&szlig;ten Teils in Ruhe lassen.\r\nBitte beachtet das dieser Fehler nur in der Lobby/Hauptmen&uuml; auftritt und nicht im Spiel selbst. Habe ich es dort erst einmal reingeschafft, geht Alles tadellos.\r\n\r\nIch hoffe ihr k&ouml;nnt mir helfen und bedanke mich im Voraus f&uuml;r eure Zeit/Vorschl&auml;ge\r\nmfg _~MrMinecraft_\r\n\r\nPS: Stellenweise bekomme ich auch im Spiel die Nachricht &quot;Lolclient.exe funktioniert nicht mehr bla bla bla&quot;, ich klicke sie dann weg und nach dem Spiel schlie&szlig;t sich der Client sofort. Schade wenn ich mich bei meinen Mates bedanken will :/","replies":[{"poster":"Rkoturdo Ndo","date":"2015-07-05T14:18:03.541+0000","up_votes":1,"down_votes":0,"body":"Heya\nWindowstaste + r > services.msc > IP-Hilfsdienst beenden und deaktivieren.\n\nMfG Rkoturdo","replies":[]}]}