{"poster":"MrWhiteHD","date":"2016-07-29T13:45:03.234+0000","title":"Matchmaking ???","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":7,"body":"Hallo, vor zwei wochen stand ich noch Bronze 1 Promo zu SIlber und ab dann habe ich nur leute im team gehabt die immer wieder afk gegangen sind oder auf alleingang gehen gegen 5 gegner und halt alles was man so nicht machen sollte.\r\n\r\nBin in 2 wochen auf bronze 5 gedroppt. Hatte heute 4 Siege hintereinander und mit dem 5. Sieg w&auml;re ich in der Promo zu Bronze 4, aber ab dann hatte ich wieder spieler die mitten im game das spiel leaven obwohl man besser als der gegner ist.\r\n\r\nSobald ich immer mehr als 4 Siege hintereinander habe, bekomme ich teammates die zum kotzen sind, weil die auf keine pings reagieren.\r\n\r\nGerade eben waren wir kurz davor zu gewinnen weil wir baron Buff haten, aber nein, anstatt die Basis einzurennen gehen die lieber in den jungle farmen oder rennen einem gegner hinter, es fehlen zwar alle 5 gegner auf der map aber egal, blindflug und dann wird man gehatet. \r\n\r\nIch kapiere dieses matchmaking nicht.","replies":[{"poster":"Humpelstilzche","date":"2016-07-29T13:50:46.418+0000","up_votes":3,"down_votes":0,"body":"> Ich kapiere dieses matchmaking nicht.\n\nDiesbezüglich gibts auch nichts zu kapieren. Das Matchmaking hat weder Einfluss darauf wann deine Teammates entscheiden zu leaven (oder unabsichtlich leaven), noch welche Entscheidungen deine Teammates treffen.\n\nDas einzige was das Matchmaking tut, ist, dich mit Teammates und Gegnern zu matchen, die im Schnitt genauso gut sind wie du, das ist alles.","replies":[{"poster":"MrWhiteHD","date":"2016-07-29T13:57:09.073+0000","up_votes":1,"down_votes":2,"body":"Das ergibt aber keinen Sinn.\n\nHabe oft Teammates, die der meinung sind, die können mit 50% leben auf 3 gegner alleine drauf und alle Killen. Oder die rennen einem Gegner hinterher, ohne Vision und Reaktionen auf Pings und lassen sich in Fallen locken.\n\nDie sind das ganz genaue gegenteil von mir.\n\nAber soviel dazu, im Schnitt genauso gut wie Ich :D","replies":[{"poster":"Humpelstilzche","date":"2016-07-29T14:01:12.769+0000","up_votes":2,"down_votes":0,"body":"Zwei Dinge dazu:\n\n1. IM SCHNITT!!!! Das schließt keinesfalls aus, dass sie mal schlechter spielen als du. \n2. Du bist nicht gerade ein objektiver Beobachter. Menschen neigen dazu beim Vergleich mit anderen sich selbst stark zu überbewerten.","replies":[]},{"poster":"Balzifer","date":"2016-07-29T13:59:33.590+0000","up_votes":1,"down_votes":0,"body":"Und genau die gleichen Leute haben auch deine Gegner...nur da fallen sie dir nicht auf, weil es dich nicht stört wenn ein gegnerischer Spieler in 3 Leute von euch rennt.","replies":[{"poster":"CYPHΕR","date":"2016-08-01T13:17:02.701+0000","up_votes":1,"down_votes":0,"body":"Weil sowas meist eher als \"Mega Outplay\" von einem selber wahrgenommen wird\n{{sticker:slayer-jinx-wink}}","replies":[]}]},{"poster":"0815xand0r","date":"2016-07-29T14:00:08.202+0000","up_votes":1,"down_votes":0,"body":"Und wie siehts bei deinen Gegnern aus? Machen die auch sowas?\nWas Humpel sagt, ist nicht, dass deine Mitspieler genauso gut sind wie du, sondern dass im Durchschnitt beide Teams gleich stark sind. Wenn du natürlich eigentlich auf (um es zu übertreiben) Challenger-Niveau spielst, werden deine Teammates anfangs dennoch auf Bronze-Niveau sein; das wird sich dann aber schnell ändern.","replies":[]}]}]}]}