{"poster":"MrWhiteHD","date":"2016-07-30T12:15:20.461+0000","title":"Keine Kiste, trotz einem S und 1 verfügbaren Kiste.","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Ich habe eben eine Runde mit Alistar auf Ranked gespielt und mal wieder ein S bekommen, doch leider keine Kiste.\r\nEs wird aber im Profil 1 Kiste angezeigt die ich kriegen kann, die restlichen sind grau hinterlegt. Normalerwei&szlig;e kriege ich jeden Samstag eine kiste, da heute die Woche vorbei ist und eine neue verf&uuml;gbar ist, sobald ich ein S- oder h&ouml;her bekomme.\r\n\r\nIst das ein Bug oder so?","replies":[{"poster":"DontKillMySoraka","date":"2016-07-30T13:59:10.605+0000","up_votes":2,"down_votes":0,"body":"http://euw.leagueoflegends.com/de/site/2016-season-update/champion-mastery.html\n\n\" Verdiene dir Meisterschaftstruhen, indem du mit mehreren verschiedenen Champions oder als Teil eines Teams gute Leistungen vollbringst. Wenn du oder jemand in deiner arrangierten Gruppe eine S-Bewertung erhaltet, gibt es eine Truhe. Pro Monat kann man bis zu vier Truhen verdienen und jeder gespielte Champion kann pro Saison eine Truhe verdienen. In der Championauswahl und auf der Championseite könnt ihr sehen, für welche Champions die Funktion verfügbar ist.\"","replies":[{"poster":"DontKillMySoraka","date":"2016-07-30T14:00:21.747+0000","up_votes":1,"down_votes":0,"body":"Du hast mehrere Truhen mit Alistar erreicht, da jemand in deinem Team ein S erreicht hat, wenn du allerdings Solo mit Alistar spielst und ein S erhälst, kannst du keine Truhen mehr bekommen.","replies":[]}]},{"poster":"TerrorRaven","date":"2016-07-30T12:16:40.056+0000","up_votes":1,"down_votes":0,"body":"Hast du auf Alistar bereits eine Kiste erhalten?","replies":[{"poster":"MrWhiteHD","date":"2016-07-30T12:17:54.892+0000","up_votes":1,"down_votes":0,"body":"Ich kriege jeden Samstag eine Kiste mit Alistar. Immer sobald eine kiste verfügbar ist und ich ein S- oder höher erreiche bekomme ich eine kiste, die jede Woche neu dazukommt.","replies":[{"poster":"TerrorRaven","date":"2016-07-30T12:19:47.559+0000","up_votes":1,"down_votes":0,"body":"Man kann für jeden Champ nur eine Kiste pro Season freischalten.","replies":[{"poster":"MrWhiteHD","date":"2016-07-30T12:21:53.417+0000","up_votes":1,"down_votes":0,"body":"Ich habe aber jeden Samstag eine Kiste bekommen, wenn ich mit Alistar gespielt habe.","replies":[{"poster":"TerrorRaven","date":"2016-07-30T12:27:34.327+0000","up_votes":1,"down_votes":0,"body":"Du verwechselst hier anscheinend ein paar Dinge. Im Profil wird angezeigt, wie viele Kisten du freischalten kannst. Alle 7 Tage kannst du eine weiter Kiste freischalten, bis zu 4 Stück.\nPro Champ kannst du eine Kiste pro Season freischalten.","replies":[]},{"poster":"SummendeBiene","date":"2016-07-30T12:25:37.093+0000","up_votes":1,"down_votes":0,"body":"Es gibt aber offiziell pro Champ pro Season nur 1 Kiste ! ( Einen Bug oder menschlichen Fehler schließe ich aber mal nicht aus)","replies":[]}]}]},{"poster":"GMMT Leviathan","date":"2016-07-30T12:20:59.323+0000","up_votes":1,"down_votes":0,"body":"Du kannst nur eine Kiste pro Champion in einer Season bekommen warscheinlich vertust du dich da grade das du vorher schon mehrmals ne kiste mit alistar bekommen hast.","replies":[{"poster":"MrWhiteHD","date":"2016-07-30T12:23:52.385+0000","up_votes":1,"down_votes":0,"body":"Ne, den wenn ich eine Kiste will, spiele ich mit alistar da jeden 2. oder 3. game mit S gewertet wird.","replies":[]}]},{"poster":"MrWhiteHD","date":"2016-07-30T12:19:58.010+0000","up_votes":1,"down_votes":0,"body":"Es droppt ja jede Woche eine Kiste.\n\nGestern habe ich mit einem Freund gespielt und er hat 4 Kisten bekommen, da ich gestern 4x S- oder höher hatte mit Alistar. Ich hatte zu dem zeitpunkt keine Wöchentliche Kiste.","replies":[{"poster":"Avorox","date":"2016-07-30T12:22:00.232+0000","up_votes":1,"down_votes":0,"body":"ja, andere Spieler können für dein s auch eine Kiste erhalten. Du selbst kannst pro Champ in jeder Season nur eine Kiste erhalten. Wenn du neue Kisten willst, spiel mehr verschiedene Champions.","replies":[]}]}]}]}]}