{"poster":"MrWhiteHD","date":"2017-02-15T01:06:07.874+0000","title":"Konto dauerhaft deaktiviert ohne Begründung","subforum":"Spielerverhalten & Moderation","up_votes":4,"down_votes":13,"body":"Ich wurde eben dauerhaft gesperrt, ohne Begr&uuml;ndung.\n\nIch hatte nie ein Chatban oder ein 14 Tage ban, K&auml;ufe wurden &uuml;ber Sofort&uuml;berweisung get&auml;tigt also nie eine Rechnung offen gehabt.\n\nHabe nie gro&szlig;artig geflamet, au&szlig;er am anfang, aber seit ca. 3 Monaten sage ich nur das n&ouml;tigste im Chat um dem team hinweise zu geben oder auf sachen hinzuweisen. Also immer freundlich gewesen.\n\nMein Freund mit dem ich &ouml;fter Aram/Normals spiele  flamet (manchmal richtig hart) in jedem spiel und er spielt seit season 1 das Spiel und hat nie eine Strafe bekommen.\n\nIch habe mir dieses Verhalten vor 3 Monaten abgew&ouml;ht, da ich seit 6 Monaten spiele und erst vor 3 Monaten durch diesen Freund erfahren hatte das man wegen sowas gebannt werden kann, also habe ich es nicht mehr gemacht.\n\nNormalerweise bekommt man wegen flamen ja einen Auszug warum man gebannt worden ist, also schlie&szlig;e ich Flamen eigentlich aus, da wie gesagt es schon seit Monaten nicht mehr vorgekommen ist.\n\nPS: gebannt bis Feb 22 22:22:22 UTC 2203\n\nSollte eigentlich laut google wegen boostig/accsharing/3rd Party tools gebannt worden sein, was aber keines von diesen Zutrifft, da ich mein Konto selbst erstellt hatte, nur ich mit diesem Konto gespielt hatte und nie Programme benutzt hatte.","replies":[{"poster":"Spicavius","date":"2017-02-15T03:55:39.223+0000","up_votes":8,"down_votes":0,"body":"> Sollte eigentlich laut google wegen boostig/accsharing/3rd Party tools gebannt worden sein, was aber keines von diesen Zutrifft, da ich mein Konto selbst erstellt hatte, nur ich mit diesem Konto gespielt hatte und nie Programme benutzt hatte.\n> \n\nDeine {{summoner:4}}  Tastenbelegung hat sich seit dem 29.12.16 von **Flash auf der Taste F** auf **Flash auf die Taste D** geändert und allgemein sind die Beschwörerzauberbelegungen bei dir schwammig vor dem 29.12.16.  Erst nach dem 29.12.16 ist es ziemlich regelmäßig aber davor nicht.\n\n Ne. Ich glaube dir nicht, aber netter Versuch.","replies":[{"poster":"MrWhiteHD","date":"2017-02-15T04:39:24.333+0000","up_votes":1,"down_votes":6,"body":"Lol was hat das damit zu tun? Nur weil ein Freund gesagt hat F auf D wäre besser also habe ich es mir so angeeignet. Und bzw wusste ich nicht was das für eine Rolle spielt, zu dem Zeitpunkt hatte ich gerade mal 3-4 Monate Spielerfahrung und da hatte ich es mir immer so eingestellt wie es mir gepasst hat. Ich habe viel mit Dia und Plat Freunden gespielt die mit vieles beigebracht hatten aber nie hat mich jemand geboosted wie man meiner elophant entnehmen kann, bin ich nie über Bronze raus. Aber du musst mir ja nicht glauben.","replies":[{"poster":"Serlaya","date":"2017-02-15T07:23:18.431+0000","up_votes":2,"down_votes":3,"body":"> [{quoted}](name=MrWhiteHD,realm=EUW,application-id=KYnfKGf0,discussion-id=lT9mO00q,comment-id=00010000,timestamp=2017-02-15T04:39:24.333+0000)\n>\n> Lol was hat das damit zu tun? Nur weil ein Freund gesagt hat F auf D wäre besser also habe ich es mir so angeeignet. Und bzw wusste ich nicht was das für eine Rolle spielt, zu dem Zeitpunkt hatte ich gerade mal 3-4 Monate Spielerfahrung und da hatte ich es mir immer so eingestellt wie es mir gepasst hat. Ich habe viel mit Dia und Plat Freunden gespielt die mit vieles beigebracht hatten aber nie hat mich jemand geboosted wie man meiner elophant entnehmen kann, bin ich nie über Bronze raus. Aber du musst mir ja nicht glauben.\n\nRiot schaut vermehrt auf andere Summoner Spell belegung und Smart Cast einstellungen. Ändern die sich innerhalb eines Zeitraums drastisch, ist es wahrscheinlich das ein Booster am werk war.","replies":[{"poster":"Darkr3sQ","date":"2017-02-15T07:51:31.002+0000","up_votes":10,"down_votes":0,"body":"> [{quoted}](name=Serlaya,realm=EUW,application-id=KYnfKGf0,discussion-id=lT9mO00q,comment-id=000100000000,timestamp=2017-02-15T07:23:18.431+0000)\n>\n> Riot schaut vermehrt auf andere Summoner Spell belegung und Smart Cast einstellungen. Ändern die sich innerhalb eines Zeitraums drastisch, ist es wahrscheinlich das ein Booster am werk war.\n\nUnd das weißt Du woher genau? Hast Du dafür eine Quelle?\nIch vermute eher, dass wechselnde Summoner Spells Belegung nur ein kleiner Teil bei der Bewertung ausmacht. RIOT hat auf deutlich mehr Daten Zugriff, aus denen sich so etwas ableiten lassen kann.","replies":[]},{"poster":"MrWhiteHD","date":"2017-02-15T07:30:36.327+0000","up_votes":1,"down_votes":5,"body":"Die Belegung hat sich nur einmalig verändert, ansonsten spiele ich immer seitdem mit der gleichen. Und hatte nie vorher ein ban bekommen umsmehr mache ich mir ein Kopf warum direkt ein permanent wegen boosting. Zudem noch Unberechtigt da kein boosting am Werk war. Einfach nur Evelynn in Bronze gespielt und gemerkt dass die Gegner nicht mit Evelynn klarkommen.","replies":[{"poster":"XenesisCH","date":"2017-02-15T10:56:03.658+0000","up_votes":2,"down_votes":0,"body":"> Die Belegung hat sich nur einmalig verändert\n\nNaja für Flash wird aber fast täglich mal die Tasten gewechselt laut op.gg...","replies":[{"poster":"MrWhiteHD","date":"2017-02-15T11:37:15.702+0000","up_votes":1,"down_votes":3,"body":"Gewechselt wird garnicht. Ist nur auf Aram andersherum.","replies":[{"poster":"XenesisCH","date":"2017-02-15T12:10:59.532+0000","up_votes":3,"down_votes":0,"body":"Vor ca. 6 Tagen nach dem Illaoi Spiel wurden auch zwei Spiele im Normal/Ranked gewechselt. Weisst du das sind lediglich Feststellungen, welche nicht mit deinen Aussagen überein stimmen - \"fishy\". Nochmals mein Rat --> klär das mit dem Support und lass weitere Rechtfertigungsversuche hier sein.","replies":[{"poster":"MrWhiteHD","date":"2017-02-15T12:31:36.531+0000","up_votes":1,"down_votes":4,"body":"Da hatte ich wie man sieht just for Fun illaoi support gespielt gehabt und da habe ich ex haust auf f, habe nicht immer flash auf D","replies":[{"poster":"MrWhiteHD","date":"2017-02-15T12:33:16.957+0000","up_votes":1,"down_votes":5,"body":"Bzw wenn man sieht wenn ich support spiele habe ich Flash auf D, auf der top lange habe ich aber meistens Flash auf f, jenachdem welche spells ich häufiger benutzen werde sind jeweils auf D.","replies":[{"poster":"Waldschrat86","date":"2017-02-15T12:57:27.930+0000","up_votes":8,"down_votes":0,"body":"> [{quoted}](name=MrWhiteHD,realm=EUW,application-id=KYnfKGf0,discussion-id=lT9mO00q,comment-id=000100000000000000000000000000000000,timestamp=2017-02-15T12:33:16.957+0000)\n>\n> Bzw wenn man sieht wenn ich support spiele habe ich Flash auf D, auf der top lange habe ich aber meistens Flash auf f, jenachdem welche spells ich häufiger benutzen werde sind jeweils auf D.\n\nJa komm erzähls dem Osterhasen. Warum tut man das? Sorry, was passiert, wenn jemand, der schon länger an eine Einstellung gewöhnt ist, diese wechselt? Als ich es mal probiert habe, bin ich verdammt oft geflasht, obwohl ich den anderen Spell eigentlich wollte.\nHäufiger benutzen? Meistens? Mal auf die CDs der Spells geschaut? Gerade die ülichen Verdächtigen auf Bot hast du öfters als Flash oder TP, aber da is Flash auf D? Lügengerüste bauen, musst du echt nochmal üben oder lass es besser gleich bleiben.","replies":[]},{"poster":"XenesisCH","date":"2017-02-15T12:44:33.494+0000","up_votes":3,"down_votes":0,"body":"**Nach** *hust* dem Illaoi spiel *hust* mit den Summs *hust* Läuterung und Barriere *hust*","replies":[]}]}]}]}]}]}]},{"poster":"Sirrkas","date":"2017-02-15T09:26:47.346+0000","up_votes":4,"down_votes":0,"body":"Riot bemerkt so etwas sicher, wenn sie nach Accountsharing suchen, allerdings ist es kein Banngrund die Summenerspellbelegung zu ändern. Lediglich für die Forennutzer ist es ein leicht zu bemerkendes Indiz, wenn jemand Accountsharing betreibt. Zum Beispiel wenn jemand im Ranked immer Jungle und Toplane spielt, richtig miese CS hat und dann 2 Wochen lang plötzlich Kalista mit Flash auf der anderen Taste spielt,abnormal hohe CS erhält und einfach mal 20 Spiele in Folge gewinnt.","replies":[]}]}]}]},{"poster":"NoName12221","date":"2017-02-15T02:09:37.146+0000","up_votes":5,"down_votes":0,"body":"Melde dich beim support","replies":[{"poster":"MrWhiteHD","date":"2017-02-15T02:33:35.455+0000","up_votes":1,"down_votes":7,"body":"War das erste was ich gemacht habe, nur habe ich gehört wenn die einen Bannen sind sie sich 100% sicher und entbannen nicht mehr. Laut dem Bann Code ist es boosting/Account ScharIng.  Wenn man meinen spielverlauf ansieht ist es schon merkwürdig das ich einen neuen Champ spiele und sofort damit rasiere aber ich habe definitiv selber gespielt und den Account selber erstellt gehabt.","replies":[{"poster":"XenesisCH","date":"2017-02-15T07:52:45.043+0000","up_votes":1,"down_votes":0,"body":"Es gibt folgende Möglichkeiten für deine Sperre:\n\n1) Drittanbieterprogramme: Du hast welche verwendet ohne es zu wissen oder du hast jemandem deine Accountdaten weitergegeben und dieser jemand hat verbotene Programme verwendet (in beiden Fällen wirst du eher keine Chance haben deinen Account zurückzubekommen.\n\n2) Du wurdest für unangebrachtes Verhalten im Ingamechat bestraft. Die Reformkarte kannst du einsehen, wenn du dich im Client einloggst. Falls diese fehlt, kann dir sicher der Support helfen, diese einzusehen. Auch hier wirst du ziemlich sicher keine Chance haben deinen Account zurückzubekommen (ausser das Chatlog würde dich entlasten).\n\n3) Eine deiner Zahlungen war nicht gedeckt und dein Konto wurde gesperrt. Hier bekommst du dein Konto zurück, sobald die Zahlung erfolgt ist.\n\nSuch dir eine der drei Möglichkeiten aus und klär das mit dem Support direkt, denn mehr als die nötigen Infos können wir dir hier nicht geben ;-).","replies":[{"poster":"MrWhiteHD","date":"2017-02-15T08:05:22.384+0000","up_votes":2,"down_votes":2,"body":"Code ist aber mmr Manipulation bzw boosting. Und diese 3 Möglichkeiten treffen nicht zu. Trotzdem danke","replies":[{"poster":"XenesisCH","date":"2017-02-15T08:38:22.724+0000","up_votes":1,"down_votes":0,"body":"Dann solltest du dein Thema besser gestalten und nicht so vage Infos geben.\n\nNun gut, wenn es um Boosting geht, dann erhältst du normalerweise zuerst einen 14 Tage Bann und im Wiederholungfall einen Perma. Du musst also hier schon einmal bestraft worden sein, sonst hättest du keinen Perma erhalten. \n\nUnter folgendem Link sind eigentlich alle nötigen Infos dazu und was du machen musst falls du wirklich unschuldig bist und niemand anderes mit deinem Account gespielt hat:\n\nhttp://boards.euw.leagueoflegends.com/de/c/spielerverhalten-de/j7dlYn4k-bannwelle-far-mmr-boosting\n\nWichtig ist auch, dass du beim Support anständig und höflich bleibst und soweit ich weiss, musst du halt nachhaken, da zuerst standard Antworten kommen.","replies":[{"poster":"eingew","date":"2017-02-15T09:13:44.499+0000","up_votes":1,"down_votes":0,"body":"> Wichtig ist auch, dass du beim Support anständig und höflich bleibst und soweit ich weiss, musst du halt nachhaken, da zuerst standard Antworten kommen.\n\nNaja, es geht ja erstmal darum, beim Support den Grund bestätigen zu lassen, das wird sicher auch eine Standardantwort regeln können ;).","replies":[]},{"poster":"MrWhiteHD","date":"2017-02-15T08:54:51.711+0000","up_votes":2,"down_votes":3,"body":"Ich bin auch hier anständig und höflich und verstehe nicht warum ich down votes kriege.\n\nNein war nie vorbestraft, höchstens Zeitstrafe wenn mein PC gespannt hat oder das Internet weg war und ich aus dem Spiel geflogen bin.","replies":[{"poster":"XenesisCH","date":"2017-02-15T09:01:45.345+0000","up_votes":1,"down_votes":0,"body":"Wie gesagt, das musst du dem Support erklären nicht mir.","replies":[]}]}]}]}]}]}]},{"poster":"MrWhiteHD","date":"2017-02-16T03:45:11.152+0000","up_votes":2,"down_votes":5,"body":"Der support hat sich bei mir gemeldet:\n\n\"Grüße,\n\nDein Konto wurde aufgrund von verdächtigen Aktivitäten im Zusammenhang mit Kontoverkäufen und der Nutzung von Drittanbieterprogrammen, manchmal als Bots bekannt, gesperrt. Derartige Sperren können nicht aufgehoben werden. Falls du davon ausgehst, dass diese Sperre unrechtmäßig verhängt wurde, so leite ich deine Anfrage gerne an ein Mitglied unserer Teams für Betrugsfälle weiter. Du solltest aber davon ausgehen, dass es unwahrscheinlich ist, dass diese Entscheidung zurückgenommen wird.\"\n\nLeider kann ich mir den ersten Vorwurf nicht erklären, da ich diesen Acc selbst erstellt hatte. Die Mail besteht zudem aus meinem Vor und Nachnamen, und ich habe noch die Begrüßungsmail sollte das nicht Beweis genug sein dass ich diesen Acc nicht gekauft habe?\n\nUnd Programme und Bots kann ich nicht verstehen, wie mir sowas vorgeworfen wird. Ich habe nie etwas Runtergeladen oder installiert was ich nicht kenne, das ich manchmal auf Aram wie ein Bot spiele könnte daran liegen das ich noch nicht jeden Champion spielen kann und es für die Gegner so aussieht wie ein Bot und deswegen Report und ban? Ist sowas möglich?","replies":[{"poster":"Balmung","date":"2017-02-16T04:28:05.689+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=MrWhiteHD,realm=EUW,application-id=KYnfKGf0,discussion-id=lT9mO00q,comment-id=0004,timestamp=2017-02-16T03:45:11.152+0000)\n>\n> Und Programme und Bots kann ich nicht verstehen, wie mir sowas vorgeworfen wird. Ich habe nie etwas Runtergeladen oder installiert was ich nicht kenne, das ich manchmal auf Aram wie ein Bot spiele könnte daran liegen das ich noch nicht jeden Champion spielen kann und es für die Gegner so aussieht wie ein Bot und deswegen Report und ban? Ist sowas möglich?\n\nBots benehmen sich deutlich anders als Spieler, welche (un-)absichtlich schlecht spielen. Sonst würde ja jeder Neuling in League einen Bann kassieren, da er ja \"wie ein Bot spielt, weil er es nicht anders kann\". Oder jeder Spieler im untersten Bronze V usw.\n\nDu kannst es weiterhin versuchen mit dem Support zu klären, allerdings besitzt Riot einen Haufen Daten den wir hier im Forum nicht haben, um sich ihre Entscheidung absichern zu können - die Chance den Account wieder zu bekommen ist entsprechend gering.","replies":[{"poster":"MrWhiteHD","date":"2017-02-16T04:33:33.958+0000","up_votes":2,"down_votes":4,"body":"Ich werde euch auf dem laufenden Halten und ich hoffe auf die geringe Chance ihn zu entbannen, da ich nie Fremdprogramme benutzt habe zum Spielen und mir sowas nicht erklären kann. Ob ihr mir hier glaubt oder nicht ist unwichtig. Wollte jediglich Informationen sammeln wie sowas zustande kommen kann ohne verschulden.","replies":[{"poster":"Balmung","date":"2017-02-16T05:00:33.958+0000","up_votes":5,"down_votes":0,"body":"Das wissen (angeblich) die wenigsten, welche sich hier im Forum wegen eines Bann melden.\n\nDie Sache dabei ist halt: Es meldet sich schon nur ein geringer Teil der \"Verbannten\" hier im Forum. Ein noch geringerer Teil von diesen ist unschuldig und ein noch geringerer Teil von denjenigen hat keine selbst für Forenuser einsehbaren \"Ungereimtheiten\"  wie dauernd wechselnden \"Mains\" über mehrere Rollen hinweg gepaart mit mehrfach wechselnden Summonerspells.","replies":[{"poster":"MrWhiteHD","date":"2017-02-16T05:21:37.469+0000","up_votes":2,"down_votes":4,"body":"Ich spiele nicht recht lange und wusste nicht dass es verboten ist ständig die Mains zu wechseln. Mein championpool ist nicht groß und da freut man sich über jeden neuen Champion mit dem man recht gut spielen kann und Freude daran hat, zudem ändern die Buffs und nerfs die Beeinflussung meiner Auswahl.","replies":[{"poster":"Balmung","date":"2017-02-16T05:33:56.662+0000","up_votes":5,"down_votes":0,"body":"Da du den Kern der Aussage völlig ignorierst spar' ich mir den Spaß ab jetzt eben - viel Spaß beim leveln eines neuen Accounts.","replies":[]},{"poster":"eingew","date":"2017-02-16T16:04:43.533+0000","up_votes":3,"down_votes":0,"body":"Die Wahl des Champions ist in keiner Weise der Grund für einen Ban.","replies":[]}]}]}]}]}]},{"poster":"Abasin","date":"2017-02-15T11:01:30.220+0000","up_votes":1,"down_votes":0,"body":"Nutzung von 3rd party tools ist plausibel, wenn Du mal **nicht** auf Deinem eigenen Rechner gespielt hast und der Fremdrechner (evtl. der Deines Kumpels) den Krempel installiert hat. Also selbst wenn Du für die Sauberkeit Deines Rechners einstehst, für andere kannst Du das nicht.\n\nDie Begründung kriegst Du übrigens per Mail zugeschickt, check auch mal den Spam-Ordner. Und falls dann doch ein Chatlog auftauchen sollte...hmmm.","replies":[{"poster":"MrWhiteHD","date":"2017-02-15T12:40:44.238+0000","up_votes":1,"down_votes":5,"body":"Hab nur eine einzige Mail bekommen ohne Grund. Nur das Datum und habe Google gefragt und in allen Fällen waren diese wegen boosting gesperrt. Habe hier lediglich nach Hilfe gefragt und ob es schon öfters zu ungerechtfertigten Banns gekommen ist. Aber man bekommt hier leider nur Downvotes oder man wird beschuldigt sich rauswerfen zu wollen, Hilfe und erfahren sind hier leider nicht zu erwarten. Salty Community.","replies":[{"poster":"Abasin","date":"2017-02-15T13:22:18.356+0000","up_votes":4,"down_votes":0,"body":"Nicht salty, wir sind hier nur schon allerlei gewohnt in Sachen \"ungerechtfertigter Bann\". Deswegen wird auch so rigoros nachgehakt. Solltest Du aus der Masse herausragen wollen, musst Du schon sehr überzeugend sein und alle Fakten auf den Tisch legen. Unschuldsbeteuerungen und Aussagen, dass Du so etwas noch nie gemacht hast, reichen hier keinem mehr. Hier wollen wir Mailverkehr, Login-Screenshot der Reformkarte, Chatlogs und was immer sonst noch legitim ist sehen, um eine Empfehlung an Dich abzugeben. Das mag Dir so nicht schmecken, aber breite Zustimmung über Dir widerfahrene Ungerechtigkeit musst Du Dir seriös erarbeiten. So hart das auch klingen mag.","replies":[{"poster":"Awsane","date":"2017-02-15T14:01:32.234+0000","up_votes":3,"down_votes":0,"body":"das Problem ist, das wir ihm eigentlich nicht helfen können\n\nzudem können wir unglaublich schlecht feststellen ob er schuldig ist oder nicht, wir versuchen das anhand von Indizien zu analysieren, aber die sind ja nie 100% zuverlässig\n\nbei bans für flame isses einfacher weil es dafür den chatlog gibt, bei Scripting/ 3rd Party Sachen bekommt der gebannte ja auch kaum Informationen\n\ndementsprechend kann er auch kaum was machen um seine Unschuld zu beweisen, also wenn ich zu unrecht für 3rd Party benutzung gebannt werden würde, wüsste ich auch nicht was ich machen soll\n\nwenn er wirklich unschuldig ist hilft wahrscheinlich am besten immer weiter beim Support nachhacken und nicht locker lassen und zu not zum Verbraucherschutz gehen mehr können wir ihm auch nicht helfen","replies":[]}]},{"poster":"eingew","date":"2017-02-15T14:39:00.822+0000","up_votes":1,"down_votes":0,"body":"Welche Hilfe? Du schreibst doch schon mit dem Support, was soll ein Forenuser sonst noch tun können? *Der* hat die Fähigkeit deinen Account zu entbannen. Alles, was du dir *hier* holen kannst, ist eine Einschätzung deiner Glaubwürdigkeit.","replies":[]}]}]},{"poster":"MrWhiteHD","date":"2017-02-15T13:16:08.723+0000","up_votes":2,"down_votes":5,"body":"Ich finde es einfach nur traurig, wie man mir unterstellt ich wolle mich rausreden wollen, obwohl ich nichts gemacht hatte. Ihr müsst mir es ja nich glauben dass ich unschuldig bin, aber mich hier versuchen runterzumachen weil ihr der Meinung seid es wäre was am ban dran bzw er wäre gerechtfertigt ist armselig.  \n\nDas System hat mich automatisch gebannt auf Verdacht. \nUnd ich habe jediglich nach Hilfe gefragt oder Erfahrungen mit ungerechtfertigten Banns. \n\nIch argumentieren hier auch Sachlich, was von einigen nicht der Fall ist. \n\nUnd Boosting an einem Tag? Ich hatte diese Winstreak nur einen Tag gehabt. \nJeder hat vielleicht die Erfahrung gemacht, dass er mit einem bestimmen Champ den er vorher nie gespielt hat richtig gecarried hat.\n\nIch verlange ja nicht dass ihr mir glaubt, ich habe nur höflich nach Hilfe gefragt.","replies":[{"poster":"Waldschrat86","date":"2017-02-15T13:39:32.891+0000","up_votes":4,"down_votes":2,"body":"> [{quoted}](name=MrWhiteHD,realm=EUW,application-id=KYnfKGf0,discussion-id=lT9mO00q,comment-id=0003,timestamp=2017-02-15T13:16:08.723+0000)\n>\n> Ich finde es einfach nur traurig, wie man mir unterstellt ich wolle mich rausreden wollen, obwohl ich nichts gemacht hatte. Ihr müsst mir es ja nich glauben dass ich unschuldig bin, aber mich hier versuchen runterzumachen weil ihr der Meinung seid es wäre was am ban dran bzw er wäre gerechtfertigt ist armselig.  \n\nStufe 2 erreicht, weiterer Aufbau der Opferidentität.\n\n> \n> Das System hat mich automatisch gebannt auf Verdacht. \n> Und ich habe jediglich nach Hilfe gefragt oder Erfahrungen mit ungerechtfertigten Banns. \n\nHast du bekommen, aber nicht so wie es dir gefällt oder du erwartet hattest.\n\n> \n> Ich argumentieren hier auch Sachlich, was von einigen nicht der Fall ist. \n\nMag sein, aber wie der typisch zurecht Gebannte, kommt je länger das ganze hier geht immer mehr dazu, die Ausreden weisen Logiklücken auf, wenn du es weiter machst, werden sie beginnen sich zu widersprechen, wenn sie das in Teilen jetzt nicht schon tun. Sachlich genug?\n> \n> Und Boosting an einem Tag? Ich hatte diese Winstreak nur einen Tag gehabt. \n\nWinstreaks hatte wohl jeder schon, sogar länger als einen Tag und das ganz ohne Bann danach...im Gegensatz zu dir...hm...hm...hm\n\n> Jeder hat vielleicht die Erfahrung gemacht, dass er mit einem bestimmen Champ den er vorher nie gespielt hat richtig gecarried hat.\n\nJop und weiter? Da fällt mir ein, als ich mal die Kombi Flash/Ghost getestet habe, habe ich D und F auch mal gewechselt, aber wie gesagt viel zu oft falsch gedrückt...achja dennoch keinen Bann. Und du willst hier weißmachen, dass du dir unnötig das Spielen erschwerst? Ich mein, was ist das für ne Aussage mit Bezug auf Flash \"den, den ich öfter benutze, habe ich auf D? Hab's schon erwähnt, die Sums haben verschiedene CDs, die Gewöhnungssache zieht ja auch bei den Boostern oder warum übernehmen die nicht immer das Set ihrer Kunden?\n\n> \n> Ich verlange ja nicht dass ihr mir glaubt, ich habe nur höflich nach Hilfe gefragt.\n\nNaja du wünschst aber zumindest, dass man dir glaubt, lieferst aber kaum etwas, dass das stützen würde. Und jetzt ist der Zug abgefahren.\nWurde ja schon gesagt, du hast nur 1 Chance per Support und die ist auf Grund der Fehlerquoten mehr als gering.","replies":[{"poster":"MrWhiteHD","date":"2017-02-21T10:10:52.969+0000","up_votes":3,"down_votes":1,"body":"PS wurde entbannt und habe 3 Kisten und 3 Schlüssel als Entschädigung bekommen.\n\nBitte Danke also kannst du dir deine Kommentare jetzt sparen.","replies":[{"poster":"Abasin","date":"2017-02-21T13:20:10.449+0000","up_votes":2,"down_votes":1,"body":"Dann gz und sorry, dass ich Dich so hart angegangen bin. Wenn Du Dich öfter hier im Forum umschaust, wirst Du die Gründe für das Misstrauen vielleicht besser verstehen.","replies":[{"poster":"MrWhiteHD","date":"2017-02-21T14:46:24.880+0000","up_votes":2,"down_votes":0,"body":"Danke, aber ich bin hier so selten im Forum. Wie gesagt, ich bin relativ neu und war bisher im Forum nur um nach Hilfe zu Champs oder zum Spiel zu suchen. Kann anderen nicht helfen da ich kaum Erfahrungen habe.","replies":[]}]},{"poster":"Lance90","date":"2017-02-21T13:33:51.342+0000","up_votes":2,"down_votes":0,"body":"Na das ist doch SUPER!\nSchön, dass der ganze Aufwand dann doch noch was gebracht hat.\n\nBin mir zwar nicht sicher ob ich jemals wieder einen Thread sehe wo jemand TATSÄCHLICH zu unrecht gebannt wurde, aber ich bin froh, dass ich dir zumindest teilweise geglaubt hab =)\n\nDamit noch ein kurzer Apell an alle anderen Forennutzer: weniger pauschalisieren, mehr auf die einzelnen Fälle eingehen.\n\nSo, ich geh mich dann mal in Selbstlob suhlen ^^","replies":[]}]}]},{"poster":"Eisenhammer","date":"2017-02-19T22:42:46.562+0000","up_votes":1,"down_votes":6,"body":"Da darfst du dich nicht wundern. Viele hier in den Foren (nicht alle) lieben es extra nach bestimmten Leuten zu suchen und diese dann mit vorwürfen und teilweise dummen anmachen zu bearbeiten...die wissen auch IMMER alles besser und sind natürlich die nettesten Menschen überhaupt...auch wenn sie das Gegenteil beweisen.\n\n\nDa kannst du Sachlich bleiben wie du willst.Die Komunity ist leider tatsächlich total übel in League of Legends...nicht nur ingame.\nWenn du Fragen hast,frag lieber Leute im Spiel oder Supporter...hier wirst du meistens nichts sachliches zu hören bekommen,nur Vorwürfe und Anschuldigungen.\n\nSieht man schon daran das du für diese Neutrale aussage Daumen runter bekommst.\nGruß.","replies":[{"poster":"Waldschrat86","date":"2017-02-20T02:51:36.687+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Eisenhammer,realm=EUW,application-id=KYnfKGf0,discussion-id=lT9mO00q,comment-id=00030002,timestamp=2017-02-19T22:42:46.562+0000)\n>\n> Da darfst du dich nicht wundern. Viele hier in den Foren (nicht alle) lieben es extra nach bestimmten Leuten zu suchen und diese dann mit vorwürfen und teilweise dummen anmachen zu bearbeiten...die wissen auch IMMER alles besser und sind natürlich die nettesten Menschen überhaupt...auch wenn sie das Gegenteil beweisen.\n> \n> \n> Da kannst du Sachlich bleiben wie du willst.Die Komunity ist leider tatsächlich total übel in League of Legends...nicht nur ingame.\n> Wenn du Fragen hast,frag lieber Leute im Spiel oder Supporter...hier wirst du meistens nichts sachliches zu hören bekommen,nur Vorwürfe und Anschuldigungen.\n> \n> Sieht man schon daran das du für diese Neutrale aussage Daumen runter bekommst.\n> Gruß.\n\nSo wie du hier in diesem Post? Könntest auch aufhören weiter rumzulügen, dann klappt's vlt. auch wieder mit der Sachlichkeit.","replies":[]}]},{"poster":"Lance90","date":"2017-02-15T13:26:24.917+0000","up_votes":2,"down_votes":1,"body":"Wir können dir hier leider nicht helfen. Das kann nur der Support.\nDaher mein Ratschlag: Wende dich möglichst höflich und sachlich an den Support. Beschreibe die Sache so genau wie möglich. Wenn der Text nach einer Standard-formulierung klingt am Ball bleiben und nochmal nachfragen. \nIm besten fall prüft dann nochmal jemand vom Support deinen speziellen Fall einzeln.\n\nWas dann dabei rauskommt ist aber der tatsächliche Sachverhalt (also eventuell wird dann der Bann auch beibehalten wenn du doch Skripts o.ä. verwendet hast) und das ist dann endgültig.","replies":[]}]},{"poster":"MrWhiteHD","date":"2017-02-16T19:50:48.285+0000","up_votes":1,"down_votes":5,"body":"Eben eine Nachricht vom Support bekommen:\n\n\"Hey,\n\ndanke für deine Geduld. Ich habe mir dein Konto noch einmal genau angesehen und es sieht so aus, als wurde ein Programm genutzt, um Level 30 zu erreichen. Das Konto wurde anschließend verkauft, was im Zusammenhang einen groben Verstoß gegen unsere Nutzungsbedingungen darstellt. Aus diesem Grunde muss das Konto permanent gesperrt bleiben. Wenn du ein eigenes Konto erstellen möchtest, werden wir dich dabei gerne unterstützen!\n\nMit freundlichen Grüssen, Ardeol\nRiot Games\nPlayer Support\"\n\nIch kann das nicht verstehen, ich habe diesen Acc auf meine email Adresse registriert und selbst gespielt. Email wurde nie geändert und Passwort auch nicht. Seit Level 1. Zudem habe ich mir (wenn der Support meine Käufe überprüfen würde) bei Level 25 XP boost gekauft um schneller Level 30 zu erreichen. Ich habe wirklich keine Programme benutzt, und kann es nicht verstehen warum es den anSchein macht. Ich bin echt verzweifel, da ich wirklich unschuldig bin und diese Vorwürfe nicht zutreffen :(","replies":[{"poster":"Lance90","date":"2017-02-17T09:40:29.290+0000","up_votes":1,"down_votes":0,"body":"Tja, also da stehst du dann wohl alleine da.\nWenn ein Support Mitarbeiter da nochmal selbst reinschaut ist das wohl mit Sicherheit auch so gewesen.\nVielleicht verwechselst du diesen Account mit einem früheren Account wenn du davon redest wie du ihn gelevelt hast?\n\nIch kann mir jedenfalls nicht vorstellen, dass hier ein fehler vorliegt und weitere Möglichkeiten hast du auch nicht.\nImmerhin gibts von Riot fast keine Spieler bezogenen Banns, also besteht die Möglichkeit einen neuen Account zu erstellen und mit dem zu spielen...","replies":[{"poster":"MrWhiteHD","date":"2017-02-17T09:52:07.478+0000","up_votes":1,"down_votes":2,"body":"Das ist mein aller erster Acc bei LoL. Davor habe ich nie was mit diesem Spiel Zutun gehabt. Bin erst durch Werbung aufmerksam geworden und habe mir den Acc erstellt. Ich habe ihn nicht gekauft und nur ich habe diesen Acc gespielt und auch nur Zuhause an meinem eigenen PC.  Deswegen verstehe ich das nicht. Versteht mich einfach nur richtig bitte. Mein erster Acc auf meine Mail Adresse und selber gespielt ohne Hilfe. Deswegen kann ich es auch nicht verstehen. Der support schreibt nur es macht den AnSchein er wäre gekauft und gebotet. Er bezieht sich nur auf das System und überprüft es nicht genauer, da man schon als schuldig abgestempelt worden ist.","replies":[{"poster":"Lance90","date":"2017-02-17T09:57:54.583+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=MrWhiteHD,realm=EUW,application-id=KYnfKGf0,discussion-id=lT9mO00q,comment-id=0005,timestamp=2017-02-16T19:50:48.285+0000)\n> &quot;Hey,\n> \n> danke für deine Geduld. Ich habe mir dein Konto noch einmal genau angesehen[...]\"\n\nKlingt für mich als wäre dein Fall sehr genau geprüft worden.","replies":[{"poster":"MrWhiteHD","date":"2017-02-17T10:04:28.748+0000","up_votes":1,"down_votes":2,"body":"Ja es klingt halt nur so.\n\nIch möchte einfach nur verstanden werden und selber verstehen wie so etwas passieren kann. Da ich den Acc eigenständig erstellt hatte und er immer in meinem Besitz war ist es auch nicht gekauft. Am 2 oder 3. Tag habe ich mir Volibär gekauft da er mir gefallen hat. Ich kann mich sogar noch erinnern wie ich ihn full Lifesteal gespielt hatte weil ich keine Ahnung vom Spiel und den Champions hatte. Bei den Bots die mir im Aram begegnet sind da sieht man dass sie die passenden item auf den Champion kaufen und nicht irgendwas was die für richtig halten.\n\nUnd alle Spiele habe ich gespielt, kein Freund, kein Programm oder ähnliches.\n\nDeswegen frage ich mich immer wieder und jede Minute seit dem Bann wie mir sowas vorgeworfen werden kann und wie das System darauf kommt ich hätte ihn gekauft.","replies":[{"poster":"Lance90","date":"2017-02-17T11:55:03.180+0000","up_votes":1,"down_votes":0,"body":"Der Support hat gesagt, dass der Account mit Bots gelevelt wurde.\nRiot denkt sich doch sowas nicht aus.\n\nDas schreit einfach alles danach, dass du den Account gekauft hast und es nur nicht zugeben willst.\n\nAber gut, mal angenommen ich glaube dir:\nIch kann nur deine Ranked-Matchhistorie einsehen.\nPoste doch mal Screenshots von deinen Spielen vor LvL 30.","replies":[{"poster":"MrWhiteHD","date":"2017-02-17T13:16:06.558+0000","up_votes":1,"down_votes":3,"body":"Der Support sagt, \"es macht den Anschein\". Welche fakoren dabei einbezogen werden ist mir rätselhaft.\n\nSo und jetzt nochmal damit es auch der letzte Versteht: Der Acc ist nicht gekauft, ich habe ihn selber erstellt, registriert und gespielt. Seit Level 1 und der Bestätigung meiner Email adresse habe nur ich persönlich mit meinen eigenen Händen damit gespielt.\n\nIch habe keine ahnung wie man hier screenshots hinzufügt. Wenn ich auf mein Profil gehe, kann Ich nur meine Spiele der letzten 30 tage einsehen. Aber wenn Ich im Filter anklicke dass nur volibär angezeigt wird, geht es bis tag 1 seit dem der acc mir gehört.\n\nUnd da Volibär mein allererster RP Kauf war am 2. tag nachdem er acc erstellt worden ist, sieht man wie ich damals gespielt habe, 3x warmog, 2x Blutdürster etc, da ich zu dem zeigtpunkt keine ahnung hatte das items eine passive haben die nicht stackt.\n\nHier der Link aus dem browser, keine ahnung ob der funktioniert: http://matchhistory.euw.leagueoflegends.com/de/#match-history/EUW1/228069283?champion=106","replies":[{"poster":"MrWhiteHD","date":"2017-02-17T13:26:22.417+0000","up_votes":1,"down_votes":2,"body":"http://www.bilderhoster.net/88scp5ra.jpg.html\nhttp://www.bilderhoster.net/35agdn1s.jpg.html\nhttp://www.bilderhoster.net/z764sjs9.jpg.html\n\nSo, das sind die aller ersten Volibär spiele die ich alle selbst gespielt habe, an diese Spiele kann ich mich genau erinnern, da eines tages ein Freund zu besuch war und angefangen hat zu lachen weil er mein Itembuild gesehen hat.","replies":[]}]}]}]}]}]}]}]}]}