{"poster":"C01d Ic3 KomY","date":"2015-10-13T20:12:12.510+0000","title":"Schlechte Pingzahl","subforum":"Hilfe & Support","up_votes":3,"down_votes":1,"body":"Hey ich habe seit l&auml;ngerer Zeit ein Problem. Und zwar spiele ich normalerweise mit einem Ping von 58-60, jedoch erh&ouml;ht sich mein Ping (vorallem Abends) auf 150-1000 ms. Manchmal kommt es nur f&uuml;r 1-2 Minuten so hoch und ist dann wieder normal. Manchmal ist es dann aber dauerhaft so hoch. Laut dem Computerbild Speedtest habe ich ungef&auml;hr 6000 kbit/s und 55 ms. K&ouml;nnte es vielleicht auch an Riot liegen, da ich in letzter Zeit immer wieder mitkriege, dass viel mehr Leute Internetprobleme bei LoL haben. Wisst ihr vielleicht, was ich machen kann, ich bin echt am verzweifeln.","replies":[{"poster":"Suseri","date":"2015-10-13T23:20:39.535+0000","up_votes":1,"down_votes":0,"body":"Hallo zusammen,\n\nes wird höchstwahrscheinlich NICHT am Spiel liegen, da alle Wichtigen Schwierigkeiten, sei es mit den Servern oder mit Champions, im Client mit einer Meldung die mit einem \"!\" gekennzeichnet ist, angezeigt werden. Nun habt ihr, aber immer noch das Problem und dieses kann sehr viele Gründe haben, wozu man sich in anderen Beiträgen, zufriedenstellende Antworten durchlesen kann und sollte, da eine dauerhafte Aufzählung sehr zeitaufwendig ist.\n\nIch hoffe ich konnte etwas weiter helfen, versteht mich bitte nicht falsch. Ich selbst habe auch oft Probleme mit Ping Drops, aber das liegt schlicht und einfach daran, dass ich einen Internet Stick statt einem Kabel benutze bei welchem, wenn man ihn zu lange benutzt die Leistung sinkt, wodurch auch ich eher Abends Probleme damit habe.\n\nMit freundlichen Grüßen \n\nSuseri","replies":[]},{"poster":"C01d Ic3 KomY","date":"2015-10-13T21:00:56.620+0000","up_votes":1,"down_votes":0,"body":"Könnte es nicht auch nur an LoL liegen, wegen den Worlds? Das vielleicht die Server überlastet sind?","replies":[]},{"poster":"Schun179","date":"2015-10-13T20:53:08.022+0000","up_votes":1,"down_votes":0,"body":"Ich hab normal auch nur ein Ping von 24, bei Teamfights springt es dann mal gerne auf 2000. Das Problem ist aber auch nur bei LoL. Liegt eventuell am Spiel, who knows? Vorallem 2000, ne? 100-200 würd ich ja verstehen, bei 2000 muss aber schon jemand dahinter stecken, dass ist nämlch abnormal.\nWürde einfach auf das nächste Update warten, ich spiel solang auch nichtmehr.","replies":[]}]}