{"poster":"Rob Swire","date":"2018-09-27T23:04:53.718+0000","title":"Irelia Tips - Consejos para acertar stuns!","subforum":"Guias y consejos","embed":{"description":"ACLARO esta es MI manera, existen monton de otras formas y hasta quizás mejores, pero estas me fallan poco y me resultan simples, este video esta hecho para ayudar y como una simple recomendación","url":"https://youtu.be/VlZhrNhREWE","image":"https://i.ytimg.com/vi/VlZhrNhREWE/hqdefault.jpg"},"up_votes":27,"down_votes":1,"body":"Che les dejo un video de ayuda que hice para aquellos a los que se les complica tirar los stuns de Irelia\r\nSon tips que aprendí por medio de mis hermosos Irelianos de mi club de main Irelias ♥  y formas que a MI se me hacen más sencillas a la hora de lanzar stuns\r\nEl vídeo lo hice en principio para un amigo, pero ya que tengo un canal en Youtube donde la mitad de mis subs me siguen por Irelia, lo adapte para poder aconsejar a una mayor audiencia(? \r\nSi con este video puedo ayudar a alguien que quiera aprender o acertar mejor sus stuns con mi hermosa bebé {{champion:39}} , mi tarea aquí estará hecha :3","replies":[{"poster":" Virtuous Violet","date":"2018-09-28T02:58:36.134+0000","up_votes":2,"down_votes":0,"body":"El combo explicado al minuto 3.35, muy bueno. No lo hago normalmente ya que reduce la posibilidad de pegar pero si es muchisimo mas sorpresivo para utilizarlo cuando te esta gankeando tu jg y preparar la linea para que sea un gank efectivo. Aunque este combo es mucho mejor usarlo en combo con la R ya que al usar eso y ultear tu objetivo se distrajo con la animacion de tus cuchillas. Mientras tanto el timer de tu E, que vuelve a activarse solo donde estas parada cae y stunea en linea, por lo tanto puedes tirarle Q al objetivo marcado por tu R y ya deberia haber pasado el timer de tu E en ese momento, por lo que asegurarias el stun ya que estas detras de tu objetivo.\nEl combo al minuto 4.38 es mejor hacerlo desde un bush. Primero preparas un minion caster pegandole 2 basicos de ser posible y luego entras a un bush. Tiras la E, prosigue pegar 2 basicos a un minion melee con aggro de tus minions y entonces tirar Q a ese melee, al caster que pegaste y luego castear la E en direccion a tu objetivo. Aqui pasarian dos cosas. Consigues pegar tu E y por lo tanto marcas al  objetivo, cuando llegues a él tenes cargado Conquistador y 4 cargas de pasiva (2 Q a minions, una E y una Q al objetivo.). De no ser posible pegarle al minion caster simplemente usas al melee, caso en el cual obtendrias 3 cargas de pasiva y medio conquistador cargado.\nTodos los combos son mejor aplicados a la toplane que a la midlane ya que la linea es mas cerrada en top y hay menos posibilidad de dodgear y a la vez poder jugar con los bush.\nBuen aporte en general! Gracias por compartir","replies":[]},{"poster":"Kathëtine ","date":"2018-09-27T23:45:53.311+0000","up_votes":2,"down_votes":0,"body":"Muy útil tu vídeo Negri <3{{sticker:slayer-jinx-catface}}","replies":[{"poster":"ILoner","date":"2018-09-28T02:00:13.291+0000","up_votes":2,"down_votes":0,"body":"baia baia","replies":[]}]},{"poster":"VikingoATR","date":"2018-09-29T01:49:23.950+0000","up_votes":1,"down_votes":0,"body":"Un lujo gracias m sirvio\nhay mas tips??","replies":[]},{"poster":"alta abo","date":"2018-09-28T01:42:14.980+0000","up_votes":1,"down_votes":0,"body":"que haces?! no reveles los secretos {{sticker:cass-cry}} \n\nno sabia que habia grupo de irelias","replies":[]},{"poster":"Mascheranox","date":"2018-09-28T05:10:59.083+0000","up_votes":1,"down_votes":2,"body":"Algo de video en tu insulto","replies":[]}]}