{"poster":"Brofessor ThePro","date":"2017-04-02T20:04:21.604+0000","title":"Brofessor ThePro - Summoner search results - League of Legends","subforum":"Hilfe & Support","embed":{"description":"Brofessor ThePro / Gold 4 26LP / 23W 7L Win Ratio 77% / Kayle - 8W 0L Win Ratio 100%, Kog'Maw - 7W 1L Win Ratio 88%, Veigar - 1W 2L Win Ratio 33%, Lulu - 1W 2L Win Ratio 33%, Yasuo - 1W 0L Win Ratio 100%","url":"https://euw.op.gg/summoner/userName=brofessor+thepro","image":"http://opgg-static.akamaized.net/images/logo/2015/reverse.rectangle.png"},"up_votes":1,"down_votes":0,"body":"Liebe Mitspieler,\r\n\r\nich ben&ouml;tige dringend eure Unterst&uuml;tzung und wenn m&ouml;glich auch die eines wirklich hilfsbereiten Riot Games Mitarbeiters.\r\n\r\nIch bin ein ehemaliger Diamond Spieler aus S3 und S4. Season 2 Spielte ich auf Platin. Nach S4 musste ich f&uuml;r mein Abitur lernen und wurde inaktiv. Als ich mich letztens wieder einloggen wollte stimmte mein Passwort nicht mehr, also schrieb ich den Support an und mir wurde auch bestens geholfen wieder Zugriff auch mein Konto zu erlangen &uuml;ber die Orginal E-Mail Adresse. (Dabei f&uuml;llte ich ein Formular auf der Support Seite aus von Riot Games) 2 Wochen sp&auml;ter war mein Account permanent gebannt... Also schrieb ich den Riot Support erneut an. Dieser hatte mich darauf folgend gebeten das selbe Formular erneut aus zu f&uuml;llen! (V&ouml;llig Sinnlos in meinen Augen, da sie auch das alte h&auml;tten an schauen k&ouml;nnen) Bis heute wurde mir kein Grund genannt warum ich gebannt wurde. Also wurde mein Passwort und E-Mail erneut zur&uuml;ck gesetzt und ich bekam wieder Zugriff auf mein Konto.\r\n\r\nZun&auml;chst dachte ich alles w&auml;re wieder gut, jedoch musste ich schnell fest stellen, das meine Ranked Rewards aus Season 2,3,4 Fehlten. (Also die Summonor Icons, Die wards Skins und Victorious Elise, Morgana und Janna). Des weiteren habe ich von Season 5-6 nicht auf dem Account gespielt und somit habe ich auch nicht das Silber erspielt in welches er in Season 6 eingeranked wurde sondern der Hacker! Deshalb habe ich auch den Riot Support gebeten den Silber Rahmen aus Season 6 zu entfernen, als auch alle Ranked Stats. (Da ich will, das auf dem Account nur stats von mir Angezeigt werden!). Dieser Wunsch wurde mir nicht erf&uuml;llt, es wurde sogar komplett &uuml;berlesen in meinem Text an den Riot Support. Nicht zuletzt deshalb bitte ich nun euch verzweifelt um Hilfe!\r\n\r\nDas dritte Problem mit dem Account ist, das auch normale Skins fehlen, unter anderem auch sehr teure. Ich habe viel Zeit und Geld in League of Legends investiert, laut der einnen Lol- Status Seite &uuml;ber 3500 Euro!. Ich bin im besitz enorm vieler Skins unter anderem auch sehr seltene. Z.B Pax Jax, Medival Twitch, Championship Riven, Grey WW usw usw. Alle Pax Skins sind da au&szlig;er der wichtigste der PAX  Twitsted Fate. Ich denke jeder wei&szlig; wie teuer und wertvoll allein dieser Skin ist und somit ist es unverzichtbar das er wiederher gestellt wird.\r\n\r\nIch bitte euch wirklich um Hilfe, da ich selbst nach langem schreiben mit dem Riot Support in allen genannten Punkten zu keinem Ergebnis kommen konnte. Ich verstehe es einfach nicht, eine Firma wie Riot games darf doch keine Datenbank Fehler haben! Hat Riot Games keine Backups? Ich bin verwundert. \r\n\r\nBitte Schaut euch den Link an von op.gg, dort sieht man, das mein Account S3 und S4 Diamond war, von S2 sieht man nichts, ich vermute dort gab es die Seite noch nicht. \r\n\r\nVielen Dank f&uuml;r eure Hilfe, ich hoffe wirklich mir kann irgendwie in zumindest einigen dieser Punkte geholfen werden.","replies":[{"poster":"Brofessor ThePro","date":"2017-04-03T14:26:59.254+0000","up_votes":1,"down_votes":0,"body":"Seit 2 Wochen. Was mich Namen und schau hier im Forum, dort siehst du doch das Diamond. Und der Support sagt ich war nie geranked? Ich habe den eindruck die haben keine Ahnung von ihrer Arbeit.\n\nUnd das mit den Skins muss normal nicht ich denen erklären sondern der Riot support muss mir erklären wie so etwas passieren kann.\n\nDes weiteren hatte ich den Riot support gebeten das Silber von S6 zu entfernen, darauf ist der Support Mitarbeiter nichtmal ein gegangen. Ich habe ja S6 nicht 1 Game auf dem Account gemacht also wieso sollte ich dann dieses Silber Symbol tragen ??? Es ist doch nicht zu viel verlangt S6 Silber zu entfernen.\n\nIch meine das nicht böse will auch keinen hiermit beleidigen, aber ich habe noch nie bei keinem anderen Spiel einen so unfähigen Support erlebt, der nichtmal sieht das man eingeranked war obwohl es sogar hier im Forum die Icons gibt, ich es ihm gesagt hab, und auch auf lolking und op.gg steht, ich ihm Bilder und Links der Seiten gesendet habe und er immernoch abstreitet das ich geranked war. \n\nSelbst wenn mir die rewards aberkannt wurden, aufgrund der Person die den Account geklaut hatte muss der Support doch sehen das der Account geranked war und die Rewards aberkannt wurden?\n\nWie gesagt ich habe so eine Support leistung noch nie erlebt und bin schwer entteucht !\n\nHat von euch denn niemand eine Ahnung was ich tun könnte ?\n\nIch habe jetzt um einen anderen Support bearbeiter gebeten und warte seit dem schon 2 Tage auf Riots antwort !","replies":[]},{"poster":"Time2Whine","date":"2017-04-03T12:44:21.038+0000","up_votes":1,"down_votes":0,"body":"Wir können hier nichts für dich tun, dir bleibt nichts anderes über als mit dem Support zu schreiben.\nIch finde es jedoch merkwürdig, dass deine Skins weg sind, da diese meines Wissens nach nicht transferierbar sind. Deine Rewards könnten weg sein, weil sich der Hacker im Spiel daneben benommen hat und als Strafe die Rewards weg sind. Bei Skins wäre mir das aber neu.\n\nSeit wann hast du deinen Account wieder?","replies":[]},{"poster":"Brofessor ThePro","date":"2017-04-02T20:06:15.839+0000","up_votes":1,"down_votes":1,"body":"LOL, ich habe gerade gesehen hier im Forum wird sogar angezeigt das ich S3 Diamond war und S2 Platin. Komischerweise sieht man hier im Forum nicht das ich S4 auch Diamond war ich bin total verwirrt was mit dem Account los ist.","replies":[]}]}