{"poster":"CosmicSphere","date":"2018-06-02T14:05:11.652+0000","title":"Champion Konzept: Caevul, die Götterfüchsin","subforum":"Skin- & Champion-Konzepte","embed":{"description":"There is no description yet. Add a description. What I'm saying is that the artwork is just too real....it's just like a photo of a fox. and the... Click on a date/time to view the file as it appeared at that time.","url":"https://www.google.com/url?sa=i&source=images&cd=&cad=rja&uact=8&ved=2ahUKEwi0wPLvkrXbAhVCElAKHQBeAq0QjRx6BAgBEAU&url=http%3A%2F%2Fcardfight.wikia.com%2Fwiki%2FFile%3ANine_Tailed_Fox.jpg&psig=AOvVaw3t84plUyalopCv4DiUZScn&ust=1528034669637492","image":"https://vignette.wikia.nocookie.net/cardfight/images/d/d2/Nine_Tailed_Fox.jpg/revision/latest?cb=20130703044524"},"up_votes":2,"down_votes":1,"body":"(Riot darf alles aus diesen Konzept benutzen)\n\n\n****1: Infos u. meine Idee für einen Teaser\n2: Aussehen\n3: Attribute\n4. Geschichte \n5: F&auml;higkeiten\n6: Freunde/ Feinde u. Herkunft\n7: Combos, Runen und Build****\n.\n.\n.\n**1: Infos: **\nCaevul ist ein Midlaner mit viel Beweglichkeit und viel Schadenpotenzial. Sie kann durch Combos viel Schaden auf einmal verursachen h&auml;lt aber selber auch sehr wenig aus= Glaskanone. Zudem k&auml;mpft Caevul lieber alleine gegen Gegner und ist dabei auch sehr erfolgreich. Sie ist recht schwer zu spielen durch ihre vielen Combos. Sie muss durch ihre Passive ihre Gegner schnell t&ouml;ten.\n.\n.\n**Teaser:** Befinden sich Bard und Swain in einen Spiel auf der Kluft der Beschwörer (müssen nicht im selben Team sein) so wird bei etwa min 2 auf der oberen Seite der Karte, da wo der Drache langfliegt, Caevul bei den spitzen Felsen im Hintergrund umherspringen (von den untersten zum Obersten). Dann bleibt sie kurz stehen, schaut zu einen (in die Richtung) und verschwindet in einen Lichtstrahl mit hörbaren Soundeffeckt.\n.\n.\n.\n**2: Aussehen:** https://vignette.wikia.nocookie.net/cardfight/images/d/d2/Nine_Tailed_Fox.jpg/revision/latest?cb=20130703044524\n(NICHT VON MIR!) So in etwa soll sie aussehen blo&szlig; noch etwas kosmischer und mit Schuppen statt Fell welche Perlmutfarben gl&auml;nzen.\n.\n.\n.\n\n**3: Attribute:**\n\n|Leben =430 + 70 pro Level =1620 HP\n|Mana =227 + 51 pro Level =1100 Mana\n|Angriffsschaden =60,75 + 2,25 pro Level = 99 AD\n|Angriffstempo =0,7 + 2,35% pro Level = 39,95%= 1,00 AS\n|Lebensre. =1 + 0,425 pro Level =  8 Lebensreg.\n|Manareg. =2,2 + 0,4 pro Level = 9 Manareg.\n|R&uuml;stung =35,5 + 1,5 pro Level = 61 R&uuml;stung\n|Magieresistenz =35 + 0,6 pro Level = 45 MR\n|Lauftempo =339\n|Reichweite =490\n.\n.\n.\n**4: Geschichte:**\n\nDie G&ouml;tterf&uuml;chsin\n\nW&auml;hrend der Noxischen Invasion in Ionia.\nZwischen den drei Bergen liegt das kleine Dorf. Die Streitkr&auml;fte metzeln dort die Bewohner erbarmungslos nieder. Alles brennt. Das Land und die Geister wehren sich, ein gigantischer Sturm entsteht und im Auge liegt die Armee. Mit einer ganz besonderen Mission. Sie wollen einen der m&auml;chtigsten Geister Ionias t&ouml;ten, welcher in diesen Dorf zuhause sein soll. Eingeschlossen in einen magischen Runenstein. Caevul, die G&ouml;tterf&uuml;chsin. Nur wenige  der Dorfbewohner k&ouml;nnen sich retten, viele k&auml;mpfen tapfer aber erfolglos. Ein Offizier ruft mit m&auml;chtiger Stimme: &bdquo;Findet den Stein!&ldquo;. Dann f&auml;llt ihn etwas auf. Ein &auml;lterer Mann versucht sich auf die Spitze des Berges zu retten an den das Dorf liegt. Er h&auml;lt etwas fest umklammert. &bdquo;Der Stein!&ldquo; Der Offizier bahnt sich seinen Weg, vorbei an den verletzten und toten Bewohner dieses friedlichen Dorfes und rennt den steinernen Pfad des Berges entlang. Er h&ouml;rt ein schwaches St&ouml;hnen und sieht einen der Pfeile im Knie des Mannes stecken. Dieser geht daraufhin zu Boden. Der Offizier geht bedrohlich auf ihn zu. Auf einmal leuchtet der Stein und der Noxianer ist nur noch Staub. Das Artefakt wurde missbraucht f&uuml;r Gewalt und Tod. Der Tr&auml;ger muss also ebenso mit den Leben bezahlen. Der Stein f&auml;llt zu Boden und droht in den Abgrund zu st&uuml;rzen. Doch dann bebt es. Ein fliegendes Wesen, so schnell wie der Blitz, schie&szlig;t den Berg hinauf und nimmt das Relikt mit sich. Der Streittrupp rennt hektisch zur Spitze des Berges wo der Tempel, die Kreatur und das m&auml;chtige Relikt nur noch in bunten Staub und Funken gen Himmel gesaugt werden. Doch sie sehen noch kurz wie der magische Stein aufbricht und Caevul sich in all ihrer Pracht entfaltet und voller Wut auf die Noxianer schaut. Die Mission ist gescheitert. Die Bewohner Ionias werden sicherlich den Geist zur&uuml;ckerlangen und ihn gegen die Noxianer einsetzen. Ihr Anf&uuml;hrer, der der diese Mission &uuml;berhaupt erst ins Leben gerufen hat wird entt&auml;uscht sein. \n\n&bdquo;Ganz recht das w&uuml;rde ich!&ldquo; sagt Swain,  &ouml;ffnet die Augen und tritt aus der Vision heraus. Er wendet sich an den aufmerksam ihn anschauenden Offizier und schmunzelt kaum wahrnehmbar. &bdquo;Schickt den Trupp noch nicht los! Ich werde mir eine bessere Taktik &uuml;berlegen m&uuml;ssen. Wir m&uuml;ssen diesen Geist zerst&ouml;ren! Und au&szlig;erdem, ihr wollt doch nicht drauf los st&uuml;rzen und euren Kopf verlieren oder?&ldquo; Das Schmunzelt wird zu einen Grinsen. Der Offizier nickt und wendet sich schweigend ab. Swain schaut sich im gro&szlig;en Raum um und sieht all die magischen Artefakte und Runensteine welche zerbrochen wurden. Alle diese Geister h&auml;tten Noxus gef&auml;hrlich werden k&ouml;nnen. &quot;Wir werden Ionia seiner  Urahnen berauben!&quot; denkt er entschlossen.\nEr konzentriert sich wieder und schlie&szlig;t die Augen. Seine Hand beginnt zu gl&uuml;hen. &bdquo;Wieder gescheitert, beim n&auml;chsten Versuch wird es klappen!&ldquo;.\n.\n.\n.\n**5: F&auml;higkeiten.**\n\nPassive: **Uralte Pr&auml;zision**\n\nDiese Passive ist nur Aktiv wenn kein Verb&uuml;ndeter Champion in 1500 (-100%AP) (min. 750) Reichweite ist.\n\nIst die Passive nicht Aktiv erhält Caevul 15 + (5 pro Level) Lauftempo außerhalb des Kampfes (nur 2,5sec. keinen DMG erhalten oder gemacht.)\n\nAktiv:\n\nAlle von Caevuls Schadenverursachenden F&auml;higkeiten verursachen an gegnerischen Champions und gro&szlig;en Monstern zu 100% absoluten Schaden. Nach 0,25sec. allerdings gilt dieser erhaltene Schaden wieder als mag/phy Schaden (je nach dem welche Sorte Dmg die F&auml;higkeit verursacht). Den Schaden den die Gegner durch R&uuml;stung und/oder MR verhindert h&auml;tten erhalten sie wieder als festen und nicht erh&ouml;hbaren Heal wieder.  MR Durchdringung von Caevul wird dabei aber auch ber&uuml;cksicht nach den 0,25sec. (alle F&auml;higkeiten verusachen Mag .Dmg)\n\nAnmerkung: \n-Schilde werden ignoriert durch den absoluten DMG aber nicht zerst&ouml;rt \n-Stirbt ein Ziel durch den absoluten DMG erh&auml;lt es auch nicht nach den 0,25sec. den Heal usw.\n.\n.\n.\n_**Alle von Caevuls F&auml;higkeiten k&ouml;nnen w&auml;hrend der Bewegung ausgef&uuml;hrt werden (auch Kanalisierungen wie Q) , auch w&auml;hrend Spr&uuml;ngen und anderen F&auml;hikeiten wie ihrer Ult!**_\n.\n.\n.\nQ: **Glei&szlig;ender Blick**\n\nCaevul kann eine Zielrichtung ausw&auml;hlen in der sie nach 0,5sec. einen glei&szlig;enden Strahl aus ihren Augen und Mund schie&szlig;t welcher an allen Gegnern 30/55/80/105/130 (+60% AP) magischen Schaden verursacht und sie f&uuml;r die 1,25X Dauer die es als absoluter Schaden z&auml;hlt blendet.\nDer Strahl ist zudem so hei&szlig; das er AA´s von Vasallen und Monstern (auch von Champion beschworenen Einheiten), die Caevul treffen sollen und vom Strahl erfasst werden, zerst&ouml;rt. \n\n_Ist die E Sp&auml;hre bereit und Q wird in eine Richtung gewirkt, wird dahin auch E gewirkt wobei E aber schneller ankommt da Q erst noch 0,5sec. kanalisieren muss._\n\nAblinkzeit: 15/13,75/12,5/11,25/10-----Kosten: 45/52/59/66/73-----Reichweite: 500/550/600/650/700\n.\n.\n.\nW: **G&ouml;ttliches Antlitz**\n\nCaevul wird bei Aktivierung f&uuml;r 0,75sec. immun gegen absoluten Schaden und erh&auml;lt 0,25sec mehr (also 1sec) 1/2/3/4/5% (+1% pro 75AP) Magiedurchdringung (=n&uuml;tzlich f&uuml;r Combos nicht unbedingt f&uuml;r W selber.)\nNach den 0,75 erstrahlen Caevuls Schuppen und verursachen an nahen Gegnern 45/72/99/126/153 (+70% AP) magischen Schaden. H&auml;tte sie w&auml;hrend der 0,75sec. absoluten Dmg erlitten so wird der mag. Dmg zu absoluten Schaden welcher dann den 2-Teil der Passiven ignoriert weil es ja schon absoluter Dmg ist.\n\nAblinkzeit: 20/18/16/14/12-----Kosten: 60/60/65/65/70-----Reichweite: Selbst, dann Radius: 300\n.\n.\n.\nE: **Sp&auml;hre der Grazie**\n\nBei Aktivierung erh&auml;lt Caevul f&uuml;r 2sec. +1/2/3/4/5 (+1% pro 75AP) Lauftempo. Sie beschw&ouml;rt eine Fuchsfeuersp&auml;hre welche erst dann aktiviert werden kann wenn sie mit dieser 1000 Einheiten zur&uuml;ckgelegt hat. Dann kann sie diese in eine best. Richtung schie&szlig;en und sie verursacht an allen getroffenen Gegnern 60/95/130/165/200 (+75% AP) magischen Schaden und verlangsamt sie um 60/70/80/90/99% f&uuml;r die Dauer die diese F&auml;higkeit als absoluter Schaden z&auml;hlt.\nSie hat von der Aktivierung dieser F&auml;higkeit an 8sec. um die Sp&auml;hre zu schie&szlig;en sonst bricht sie ab un reduziert den CD um 50%. W&auml;hrend der Bewegung k&ouml;nnen Problemlos AA&acute;s (dann stehenbleiben) , andere F&auml;higkeiten, Items usw. durchgef&uuml;hrt werden.\n\nAblinkzeit: 19/17/15/13/11-----Kosten: 50/55/60/65/70-----Reichweite: 600/650/700/750/800\n.\n.\n.\nUltimative F&auml;higkeit: **Himmelsfuchs**\n\nPassiv: Bei Bewegung werden Stacks aufgebaut. 10/12,5/15 Einheiten sind 1 Stack. Bei 100 Stacks (also 1000/1250/1500 Einheiten zur&uuml;ckgelegt) wird die n&auml;chste F&auml;higkeit gegen einen gegnerischen Champion wie gehabt erst absoluten Schaden verusachen ABER nicht nach 0,25sec. sondern erst nach 0,4/0,6/0,8sec. wieder als magischer Schaden z&auml;hlen. (=ist gut um Gegner schnell zu t&ouml;ten vor Heal von Passive.)\n\nAktiv: _Die Ult kann bis zu 4 Aufladungen haben wobei man min. 2 brauch um sie zu aktivieren._\nMit der Ersten Aktivierung kann Caevul auf nahes Terrain springen und dort f&uuml;r bis zu 2sec. verweilen. Bewegung ist w&auml;hrendessen nicht m&ouml;glich aber F&auml;higkeiten. Mit Der 2 Aktivierung spring sie vom Terrain ab und dash in die gew&auml;hlte Richtung.\n\nHat man 4 Stacks gilt dies. Mit 1,2 und 3 auf Terrain springen also von einen Ort auf Terrian zum Anderen. UND IMMER mit der Letzen verf&uuml;gbaren Auflandung muss man abspringen und wegdashen. Der Dash geht durch terrain. IMMER muss man mit der ERSTEN Aufladung auf Terrain springen.\n\nAuf Terrain, w&auml;hrend der Spr&uuml;nge und Dashes k&ouml;nnen problemlos F&auml;higkeiten aktiviert u. oder kanalisiert werden. Die Spr&uuml;nge und Dashes k&ouml;nnen durch hard CC abgebrochen werden (wird sie auf Terrain gestunnt z.B. dann f&auml;llt sie runter.)\n\nAblinkzeit: 35/32/29sec. pro Aufladung-----Kosten: 40/37/35 pro Aufladung-----\nReichweite: \nSprung: 500/550/600\nDash: 400/450/500\n.\n.\n.\n_**Anmerkung: Caevuls Hitbox ist normal Breit aber l&auml;nger als bei Anderen Champs durch ihre vielen Schw&auml;nze welche Schaden erhalten können (also nicht wie bei Asol).**_\n.\n.\n.\n**6: Freunde/ Feinde u. Herkunft**\n\nHerkunft: Ionia (alter Geist).\n\nFreunde: \n{{champion:432}} = ihr retter\n{{champion:103}} = sie k&ouml;nnten beste Freunde werden:)\n\nFeinde:\nAlle Champions aus Noxus\n.\n.\n.\n**7: Combos, Runen und Build**\n\nCombo:\n\nE aktivieren, auf Terrain mit R1 springen. Auf Terrain mit R2 u R3. Dann E Aktiv. Auf Terrain W und Q aktivieren und in Richtung Gegner dashen mit R4. = W explosion, Q Strahl und E Sp&auml;hre (fast) gleichzeitig auf Gegner f&uuml;r Oneshot bevor Heal durch Passive.\n.\n.\nRunen:\n\nDominanz:\nRäuber\nPerfider Trick\nArgus Vermächtnis\nRaffinierter oder Erbarmungsloser Jäger\n\nZauberei:\n\nFlinkheit\nAufziehen Sturm\n.\n.\nBuild: \n\n{{item:3009}} , {{item:3285}} , {{item:3116}} , {{item:3152}} , {{item:3001}} , {{item:3089}} \n\nBeim Build ist mir nicht allzu viel eingefallen also schreibt Docht Mal was ihr bauen würdet auf ihr:)\n.\n.\n.\nDanke f&uuml;rs Lesen meines Championkonzepts. Hoffe ihr findet auch die Story gut:) Bitte lasst mir Kritik da ob vlt. die Passive zu Op ist (hab aber deshalb extra das mit den Verb&uuml;ndeten in Reichweite Limit gemacht und geringe Lebenswerte). Bitte sagt mir wie ihr das Konzept findet! Bye, und einen sch&ouml;nen Tag/Abend noch;)","replies":[{"poster":"SSF LastAngel","date":"2018-06-02T19:20:17.764+0000","up_votes":2,"down_votes":0,"body":"Hey\nSuper Konzept wie immer auch wenn der Champ an sich sehr kompliziert klingt.\nDer Q spell vor allem die passive hört sich dermaßen OP an aber das kit ist cool\nSuper Story würde ich gern aufnehmen in meine Sammlung wenn das okay ist\n\nViele Grüße \nChris","replies":[{"poster":"CosmicSphere","date":"2018-06-02T19:36:51.048+0000","up_votes":1,"down_votes":0,"body":"Na klar kannst du die Story aufnehmen. Was ist an der Q OP? Das mit den AA's? Könnte ich wegmachen. Danke aber für die Kritik und das dir Geschichte gefällt freut mich am meisten;) Passive ist halt dadurch, meiner Meinung gerechtfertigt durch die geringen Lebenswerte und Resistenzwerte von Caevul und durch den 2-Teil der Passiven. Vor allem aber dadurch dass sie nur Aktiv ist wenn kein Verbündeter in der Nähe ist also bei Ganks z.B. garnicht vorhanden sowie die Effekte wie der Slow und der Blind da diese nur dann auftreten wenn es absoluter DMG ist.\n\nPS: Die Geschichte ist zu großen Teilen ja der Bard Teaser (falls du es nicht gemerkt hast.) Also ist der Bard Teaser (durch diese Geschichte) nur eine Vision und noch nicht passiert.","replies":[{"poster":"SSF LastAngel","date":"2018-06-03T10:18:38.907+0000","up_votes":1,"down_votes":0,"body":"hab ich nicht gemerkt aber danke für den Hinweis\nFind ich super . Ja genau das mit den Autoattacks das wäre was komplett neues aber gegen Ad Carrys viel zu stark","replies":[]}]}]},{"poster":"INoKami","date":"2018-06-03T11:51:58.035+0000","up_votes":2,"down_votes":1,"body":"Na, schau an, wen haben wir denn da? Mal schauen, was so daraus geworden ist:\n\n**Aussehen:** ...Ahri mit etwas mehr Fell und einer Verhaltensstörung?\nDie Schuppen machen das irgendwie auch nicht besser... zumindest sehen die Bilder in meinem Kopf nicht sonderlich gut aus...\n\n**Lore:** Die Götterfüchsin. Also fast wie Ahri.\nKommt aus Ionia. Wie Ahri.\n\nIst irgendwie schon eine... beunruhigende Tendenz.\n\n**Texte:** ...stumme Champions sind seit neuestem im Trend, oder?\n\nNach diesem Anfang schauen wir mal auf die Fähigkeiten:\n\n**\nDie Passive:** Oh Gott. Das fängt ja schon gut an. True Dmg und ein Heal (der genau wie hoch ist?) schon auf der Passiven...\n\n**\nDie Q:** Ok was? Du kannst einfach AAs mit dem Ding zerstören? An alle ADCs hier: ihr dürft anfangen, euch zu beschweren in 3... 2... 1... bitte! _*_ _wegduck_ _*_\nWeiterhin: Ratios haben normalerweise keine Skalierung (und selbst wenn... wieso hat diese nur 3?), die Kosten wirken... zusammengewürfelt, die Reichweitenerhöhung ist sowieso diskussionswürding und das mit dem Blenden... oh nein, ich hör schon wieder die Meute frustrierter ADCs anrücken... verdammt... _*_ _rausflash_ _*_\n\n**\nDie W:** Süße Idee mit True Dmg-Immunität, aber wann braucht man das schon? _*_ _Weiter dein Konzept überflieg_ _*_ Oh, warte...\nUnd schon wieder True Dmg... wenn die Reichweite nicht so klein wäre, dass es fast schon wieder nutzlos wird, würde ich dir jetzt schon was husten wollen.\n\nAber eine Frage: Was ist mit den Kosten für Stufe 2 und 4 passiert? Sind das Platzhalter, weil du dir noch nicht sicher warst?\n\n**\nDie E:** 5% Movespeed? Da bekomm ich sogar mehr, wenn ich mir ein Zeal hole... 5% sind gar nichts.\nWarte... Fuchsfeuer? Woher kenne ich das? War nicht mal irgendwas mit einem neunschwänzigen Fuchs in LoL, der sowas auch konnte.... ich glaube, ihr Name fing mit A an...\nUnd yaaaaaay, ein 99% Slow... mach halt gleich einen Stun daraus...\n\n**\nDie R:** Also der passive Part ist ja mal komplett busted, in Kombination mit den anderen Fähigkeiten.\n\nHmmm... durch die Gegend springen... konnte das nicht auch ein Fuchschampion in LoL, dessen Name mit A anfing?\nWas wirklich stört an der Fähigkeit, ist, dass man erst die Aufladungen für das Terrain abwerfen muss, bevor man wieder runter springen kann. Das macht sie einfach sehr unflexibel. Und andererseits, 3 mal in kürzester Zeit über Terrain hüpfen... Talon darf seine Buffs zu Recht einfordern.\nUnd warum sind Kosten/CD nicht linear abfallend (so wie bei jeder normalen Fähigkeit)?\n\nDas Schlusswort übergebe ich natürlich auch noch an **die wichtigste Frage:**\n\nGab es in LoL nicht einen neunschwänzigen Fuchschampion, dessen Name mit A anfing und verdächtige Ähnlichkeiten mit diesem Konzept hat?\n\n**\nDas Fazit:** Ich hab echt das Gefühl, du hast nicht dazugelernt. Jede Fähigkeit mit (auch nur potentiellem) True Dmg vollklatschen ist **NICHT** gesund für ein Konzept! So wirklich kreativ sind die Fähigkeiten auch nicht und gefährlich ist auch, dass du ein Konzept erschaffen hast, dass zum Solospiel anregt... in einem teambasierten Game. Also ganz ehrlich: die will ich nicht in meinen SoloQ-Games sehen... aber hey, zumindest gibt es jetzt eine Lore und unter dem Aussehen kann man sich tatsächlich etwas vorstellen... wobei... hat das Aussehen nicht eine gewisse Ähnlichkeit mit einem Fuchschampion in LoL, dessen Name...? \nOk, ich hör schon auf. **3/10 Punkte**. Die _Ablinkzeit_-Ultras hatten hier wohl das letzte Wort...\n\nMal ganz unter uns: was ist los mit dir? Ich meine, du hattest mal in der Vergangenheit recht gute Konzepte hervorgebracht und jetzt machst du abermals die selben Fehler wie im letzten Konzept, als wenn dir meine und Sensei Doenerlords Kritik sonst wo vorbeigehen würden...\nMir gehen echt die Erklärungsversuche aus. Na ja. Hoffen wir, dass sich die kleine Schwächephase wieder legt. Ich hoffe es.\n\nMfG\n\nIncaedeus\n{{sticker:galio-happy}} \n_Leidenschaftlicher (und herumdashende Füchse flashtauntender) Galio-Main_","replies":[{"poster":"CosmicSphere","date":"2018-06-03T16:51:43.711+0000","up_votes":1,"down_votes":1,"body":"Aussehen ist meiner Meinung nach speziell und nur die mehreren Schwänze (wer sagt das es 9 sein müssen) erinnern an Ahri.\nLore und Titel haben nun wirklich rein garnichts, also in wirklich keinen Aspekt außer den Wort Fuchs u Ionia, mit Ahri zu tun.\nTexte habe ich net haste Recht.\n\nPassive: hast du vlt. falsch verstanden (obwohl ich es eigentlich verständlich geschrieben habe). NICHT Caevul heilt sich sondern der Gegner. Verursacht die Q z.B. 100 Schaden also erst mal 100 true Dmg am Gegner und der hat so viel MR das er z.B. 50% also 50 davon reduziert HÄTTE, so heilt er sich nach den 0,25sec. (außer R Passive) um 50. Ist meiner Meinung nach daher nicht OP und sie soll halt gut darin sein alleine zu kämpfen und Gegner zu überaschen. Im Teamfight kann sie aber auch gut sein.\n\nQ: Hab das mit den AA´s verrändert jetz.  Und das mit den Scaling war ein Fehler meinerseits hab es auf 60% fest gemacht.\n\nW: Kann man manchmal einsetzen mit den true Dmg (Z.B. outplay gegen Fiora) sonst aber für Dmg doch ganz gut.\n\nE: Es heißt nur Fuchsfeuerspähre und ist gleich Ahri... 99% slow ist für mich mehr als gerechtfertigt für die Vorrausetzung davor mit den Einheiten zurücklegen. (sie hat 0 Stuns in ihren Kit.) Geringer MS Buff ist weil es gut mir der Ult ist.\n\nR: Ist die EINZIGE Fähigkeit die an Ahri erinnert aber viel kreativer eingesetz werden kann und mehr Potenzial hat.\nR Passive finde ich gut für Oneshots aber ist ja useless wenn man im eigenen Team ist.\n\nDas gesamte Konzept ist wie ein Mage Assasin den man sich nicht alleine stellen sollte und man sollte immer auf der Hut sein vor ihr. Im Team soll sie halt nicht zu stark sein also wie viele Assasin (Rengar, Kha...)\n\nUND:\nAnnie und Brand benutzen Feuer.\nAnnie=Brand confirmed?\n\nFinde deine Argumente teilweise (vorallem das mit Ahri hat mich getriggert) etwas mehhhh. Sie hat kaum was mit Ahri zu tun.\n\nNaja, trotzdem danke. Mit (etwas getriggerten) Grüßen, Cosmic.","replies":[{"poster":"INoKami","date":"2018-06-04T17:14:36.633+0000","up_votes":2,"down_votes":1,"body":"Schön, dass wir immer einer Meinung sind :D\n\nOk, ernsthaft:\n\n* Hmmm, ok... Ja, Fuchs und so, die Ähnlichkeit ist ja da... aber neun Schwänze? Muss zugeben, die hat mein Kopf gegen meinen Willen hinzugedichtet. Mein Fehler. Mehr oder weniger. (Das Bild war da jetzt aber auch nicht sonderlich hilfreich xD)\n* Zur Passiven: Ok. Den Satz muss man echt zehn mal lesen, bis man wirklich kapiert, dass der Gegner den Heal bekommt. Aber das führt zu einem anderen Problem: Wenn du es nicht schafft, den Gegner mit deiner Kombo umzuhauen, wirst du nicht nur in dem Sinne bestraft, dass der Gegner noch steht (und dann wahrscheinlich dich umhaut), sondern er bekommt auch noch einen Heal for free. Das wird zu seeeehr viel Frust führen. Wie sagte schon einst ein Riot-Mitarbeiter: \"Es ist besser, Spieler für gutes Gameplay zu belohnen, als sie für schlechtes Gameplay zu bestrafen.\" Oder... war das überhaupt ein Riot-Mitarbeiter? Ach, egal, die Weisheit passt trotzdem.\n* Bei der W bleibt das Problem, dass dann doch nicht so viele Champions in LoL tatsächlich mit True Dmg arbeiten (eigentlich nur Fiora, Camille, Vayne, ein paar andere gelangweilte ADCs, Jax, Yi... verdammt, doch ein paar mehr als gedacht) und selbst wenn, mit einer 300er Range kannst du damit nur effektiv Meeles bedrohen, die wieso auch immer auf dich draufspringen (eventuell weil du ein squishy bist und so... wir kennen es doch alle^^)\n* Name der E... also komm, eine gewisse Ähnlichkeit kann man da einfach nicht leugnen. Ahris W heißt \"Fuchsfeuer\" und in ihrer Ult fällt dieser Begriff auch noch einmal... warte, die Dinger heißen jetzt Essenzbolzen? Wann zum Teufel wurde das geändert? Ich meine, die hießen auch eine lange Zeit Fuchsfeuer... f*ck, werde ich jetzt echt schon Demenzpatient?\n* Und bei der R liegt eben das Problem: es ist zu sehr wie Ahri. Im Grunde sind das irgendwie drei verbuggte Kayn-E´s und ein Dash nochmal zum Abschluss. Irgendwie will mir das einfach nicht gefallen.\n\nZum Schluss nochmal mein Hauptkritikpunkt, etwas veranschaulicht:\n\n**Ahri:** Ein herumdashender, als Assasine konzipierter Fuchsmensch\n**Caevul:** Ein herumdashender, als Assasine konzipierter Fuchs~~mensch~~\n\nDas ist es halt. Wenn sie (Caevul) ein anderes Tier oder komplett ein anderes Wesen wäre, wäre das größte Problem für mich schon beseitigt. Und dann wäre obige Bewertung wahrscheinlich 75% kleiner gewesen ;)\n\nSo viel von meiner Seite. Erst mal. Du kannst das gerne ändern.\n\nMfG\n\nEin Konzepteschreiber, der seinen Namen nicht veröffentlichen will.\n_*_ _hust_ _*_ _Definitv kein Galio-Main!_ _*_ _hust_ _*_","replies":[{"poster":"killer of death","date":"2018-06-07T08:24:04.981+0000","up_votes":1,"down_votes":1,"body":"Als ich das Konzept gelesen habe,\nhab ich bei den Schuppen schon gedacht:\nFuchs und Schuppen?\n\nAls ich bei der Passiv ankam dachte ich: \n{{sticker:slayer-pantheon-rainbows}}  was ist das?\n\nIch freute mich auf die Kommentare und siehe da \n\nEINES VON DIR\n\nich hab es gelesen und der Tag war gerettet\n\nDanke Incaedeus {{sticker:slayer-pantheon-thumbs}} \n\n\nPs: Sry CosmikSphere ich finde das ist nix","replies":[]}]}]}]},{"poster":"ecuto","date":"2018-06-10T15:46:20.660+0000","up_votes":1,"down_votes":1,"body":"True damage verhindern, das wird nie durch kommen...","replies":[{"poster":"CosmicSphere","date":"2018-06-10T18:44:39.631+0000","up_votes":1,"down_votes":0,"body":"Was meinst du jetzt damit? Die Passive? Weil es ist erst true DMG und dann mag DMG. Also kein richtiger true DMG insgesamt. Und außerdem ist es nur ein Konzept und wird zu 99% nicht durch kommen. Ach oder meinst du die W weil die True DMG blockt? Ist nun wirklich nicht OP und nur in ein paar Situation hilfreich. Außerdem muss man es ja auch gut einsetzen können= timing. Dein Kommentar ist etwas Kurz und wenig Argumente oder Kritik steckt drin ^^","replies":[{"poster":"ecuto","date":"2018-06-10T19:17:04.672+0000","up_votes":1,"down_votes":1,"body":"Eine Regel von Riot sagt das true-damage, true-damage ist und nicht verhindert/veringert werden kann, es ist verdammt nochmals True-Damage","replies":[{"poster":"CosmicSphere","date":"2018-06-10T20:34:48.377+0000","up_votes":1,"down_votes":0,"body":"1. Regeln sind dazu da um gebrochen zu werden sonst würde es nie etwas neues geben. Epische Monster u. sogar Türme können auch nicht CC werden AUSSER durch die Bard Ultimate= Regel gebrochen und etwas neues geschaffen.\n\n2. Du liegst falsch. True DMG kann durch z.B. Kayle Ultimate, Kindred R, Trynda R geblockt werden= verhindert werden. Es gibt etwas was aber ALLES ignoriert auch unsterblichkeit. Purer Schaden (steht sogar im LoL Wiki). Das ist der DMG den die Fontäne macht wenn du beim Gegner in den Spawn gehst. \n\n\nAlso ist es nicht komplett neues die W. Wieder was dazu gelernt oder?;)","replies":[]}]}]}]}]}