{"poster":"CosmicSphere","date":"2019-01-28T17:33:53.331+0000","title":"Champion Konzept: Atramen, Maler der Realität","subforum":"Skin- & Champion-Konzepte","up_votes":7,"down_votes":0,"body":"**(Riot darf diese Ideen verwenden)**\n\n**1: Infos\n2: Geschichte\n3: Attribute \n4: Fähigkeiten \n5: Build/ Runen\n6: Combos\n7: Freunde/ Feinde, Herkunft u. Interaktionen\n8: Aussehen\n9: Skins**\n.\n.\n.\n**1:Infos:**\n\nAtramen ist ein besonderer Schütze der sehr viel Übung und Kreativität erfordert um tonnenweise Flächenschaden zu verursachen und den Gegner vor seiner Kunst erzittern zu lassen. Er hat viel Schaden der oft eine Verzögerung beeinhaltet weshalb er von gekonnten Spielern ausgewichen werden kann. Zudem hat er auch Escape Möglichkeiten und viele coole Kombinationen seiner Fähigkeiten und seiner Passiven womit er Gegnern, mit etwas Planung, viel Schaden zufügen kann und dabei auch noch die Karte verschönert.\n.\n.\n_Schaden: 8/10\nDurchhaltevermögen 3/10 \nBewegung: 4/10\nCC: 3/10\nSchwierigkeit: 8/10_\n.\n.\n**Teaser Idee:**\n\nBei 2% aller Spiele wird gleich am Anfang des Spiels es “relativ“ dunkel sein. Dann sieht man wie der Himmel in hellen Tönen, die Berge im Hintergrund mit braun, grau und grün gemalt werden und sogar einige Tiere und Vögel. Das alles passiert relativ schnell (5sec.) und gleichzeitig an mehreren Orten. Am Ende ist noch ein Fleck ohne Farbe übrig hinter den es schwarz ist. Man sieht einen leuchtenden Pinsel hervorhuschen und eine Stimme sagt: „Unnnddd fertig!“ und malt die Stelle noch schnell aus. Diese Stelle variiert immer und kann überall, wenn auch nur 1x, vorkommen.\n.\n.\n.\n**2: Geschichte:**\n\n_„Selbst die harmlosesten und schönsten Talente können ausgenutzt werden, zu Krieg und Tot.“_\n\nAtramen, geborener Vastayashai´rei, war von Geburt an anders als die sonstigen Mitglieder seines Stammes. Er konnte sich nicht verwandeln, hatte keine spezielle Verbindung mit den Geistern oder der Natur um sich und war auch nicht besonders tapfer. Doch eines konnte er. Er konnte malen.\nAus Blütensaft, Erde, Ton und allen möglichen was die Natur sonst noch an Farbe zu bieten hatte, malte er auf Steinwände und später auch auf richtiges Papier welches er selber herstellen konnte. \nSein Stamm belächelte ihn und sie liesen ihn seinen Weg gehen. Ein Weg der ihn nicht auf das reale Leben vorbereitete dachten sie.\nDoch irgendwann erkannten sie das seine Werke eine Wirkung hatten, sie spürten es, selbst beim stärksten Regenfall verschwand sein Kunstwerk nicht, selbst der stärkste Krieger konnte sie nicht vom Felsen abkratzen und der älteste Magier nicht ungeschehen machen.\nBald erkannten sie seine Fähigkeiten und wie man sie nutzen könnte.\n\nEs war zurzeit der Noxianischen Invasion als Atramen schon 15 Jahre alt war und seine Gabe beinahe perfektioniert hatte. Die Ältesten seines Stammes brachten ihn eine Karte welche Ionia darstellte. Sie hatten sie aus einen Tempel der Menschen geraubt und mit Magie getränkt haben um die Wirkung noch zu verstärken.\nDer Anführer des Stammes, Kru´Lur, überreichte ihn einen goldenen, meisterlich gefertigten Pinsel aus den Holze einer Götterweide welche vor langer Zeit zerstört wurde.\nZögern nahm Atramen ihn an und tauchte ihn in rauchende Tinte welche wie der Kosmos glänze und flimmerte. Er hielt ihn über die Karte und wusste wo er den Strich setzen sollte.\nIm Süden Ionias, an der Küste von wo aus der Feind seine Macht stetig ausbreitet. Von Fae`lor, nach Weh´le bis zum Epul. Er zitterte und schaute sein Volk an.\n„Du musst uns retten! Du musst dieses Land vor den schrecklichen Feind beschützen!“ sprach Kru´Lur.\n„Aaaber… die Natur…das Gleichgewicht…wir sollten doch friedlich leben. Es muss einen anderen Weg geben. Der Wiederstand ist auch dort!“ antwortete Atramen ängstlich.\n„Opfer sind der Natur ganz recht. Es sind nur Menschen! Tuhe es!“\nEr schwang den Pinsel in die Luft wo er in allen Farben leuchtete, dann, wie der Schnitt eines Schwertes fuhr er über die Karte und malte die Linie. \nSie hörten ein Grollen, so laut und unnatürlich.\nAtramen wusste was er getan hatte. Sein Volk jubelte und versammelte sich gebannt um die glühende Karte doch er war stumm und wande sich ab.\n„Ich wollte doch einfach nur malen.“ Sagte er noch als er ein letztes Mal zu ihnen sah.\n\nEr verließ seine Heimat aus Wut und Trauer. Nur eine Karte seines Wohnorts nahm er mit um seine Erinnerung an sie zu behalten oder um irgendwann nach vielen Jahren zurück zukehren. Sie nutzen seine Leidenschaft und sein Talent für ihre schrecklichen Zwecke aus. Er konnte keinen von ihnen in die Augen sehen.\n\nEr wanderte Richtung Süden, er wollte sein Werk sehen. Am Plazidium von Navori vorbei und über die Berge laufend kam er seinen Werk näher. Nach 2 Wochen erreichte er sein Ziel und betrachtete es von einen Turm in Weh´le aus. Ein Strich in der Landschaft. Der Boden brannte vor bunten Flammen. Bei genauerem Blick sah er tausende Körper, Ionier und Noxianer, welche steif und stumm von Farbe befleckt da liegen. Die Noxianer zogen sich von den Punkt der Küste zurück aber die nahen Dörfer würden nie wieder von den Menschen bewohnt werden. \nAuch nach Jahren brannte sein Kunstwerk noch. Seine Leidenschaft brannte einen Krater in seine Heimat sowie in seine Psyche. \n„Es ist ihre Schuld!  Mein Stamm war das, nicht ich!!!“ schrie er auf den Turm in Richtung seiner Leinwand aus Tod. Er holte seinen Pinsel raus, ein Tintenfass und die Karte seiner Heimat. Dann zuckte er und lächelte gebrochen. Er setze sich sanft auf den Steinboden und lies seiner Kreativität freien Lauf.\n.\n.\n.\n**3: Attribute**\n\nLeben: 475 + 74 pro Stufe = 1733HP\nMana: 310 + 35 pro Stufe=  905 Mana\nAngriffsschaden: 63 + 3 pro Stufe = 114 AD\nAngriffstempo: 0,6 + 2,3% pro Stufe = 39,1%= 0,834 AS\nLebensregeneration: 2,8 + 0,2 pro Stufe = 6,2 HP reg.\nManaregeneration: 0,32 + 0,5 pro Stufe= 8,82 Mana reg.\nRüstung: 39,2 + 1,4  pro Stufe = 63 Rüstung\nMagieresistenz: 35,1 + 0,7 pro Stufe = 47 MR\nLauftempo: 332\nReichweite: 560\n.\n.\n.\n**4: Fähigkeiten:**\n\n#Passive:  °)Die Welt als Leinwand(°\n\n\n**„Tintenstriche“:** Atramen kann normale AA´s ausführen oder „Tintenstriche“. Diese kann er in seiner AA Range durch halten der L-Maustaste und ziehen in beliebige Richtungen erzeugen. Sie können alle Formen annehmen und sich auch selbst überschneiden. Die Reichweite dieser dünnen (Jinx W) Striche ist 200-300 (1-11) Einheiten. Nachdem man diese Reichweite erreich hört die Linie auf und erleuchtet vom gemalten Anfang bis zum Ende mit 200-300 MS Geschwindigkeit. Nur Gegner die vom aktuellen erleuchteten Teil einmalig getroffen wurden erhalten 1xDMG. Der DMG beträgt 70-85% AD (1-11) und Treffereffeckte werden speziell behandelt. Sie verursachen nur 60-80% DMG und CC sowie andere Effeckte. Bei einmaligen (nur 1 Gegner) wird nur das 1 Ziel genommen und nimmt 110% DMG/CC/Effeckte von diesen Treffereffeckt.\nKrit. Treffer= 150-175% AD an allen auf Linie!\n\nBei einer Person krit: 165-192,5% AD.\n\n**„Farbe in den Adern“:** Neben Mana hat Atramen noch 100 Weltentinte. Tintenstriche\nverbrauchen je 15 und Fähigkeiten können durch Tintenstriche verändert werden was nochmal +25 kostet. \nMan erhält 2 pro sec., 3 pro getroffenen Gegner mit Tintenstrichen, 4 bei Champions,\nund einmalig 5 wenn man einen geg. Champion mit einer Fähigkeit DMG zufügt. \n---\n**Atramen kann nur so oft Tintenstriche ausführen wie viel AS er hat! Hat er z.B. 2.0 AS kann er 2 pro sec. machen!!!**\n**Die bedeutet allerdings, dass er neben den normalen AA´s (in diesen Fall 2 pro sec) auch noch 2 Tintenstriche machen kann und somit ein künstliches AS von 4.0 hätte wenn man die Animation der AA´s und den Delay der Tintenstriche nicht mit einbezieht. Sein höchster AS-Wert ohne Runen und nur mit Items wäre also 2.5 -> 5 \"AA´s\" pro sec.**\n---\n**P AA= Passiver AA**\n---\n**Wenn eine Fähigkeit mit P AA´s verbessert wird so wird der P AA auch wie ganz normal DMG verursachen nach der Verzögerung und noch für den jeweiligen Bonus-Effekt der Fähigkeit bestehend bleiben!!! **\n---\n**P AA`s bei Fähigkeiten sind meistens länger als 200-300 Einheiten  funktionieren dennoch wie die Normalen auch das MS der Striche!**\n.\n.\n.\n#Q:  °)Farbexplosion(°\n\nAtramen wirft ein Tintenfass zum Zielort welches dort zerbricht und Gegner über 2sec. pro 0,4sec. um 15/18/21/24/27% verlangsamt, stackt und bei 100%= Verwurzelung für die restliche Dauer. Nach den 2sec. explodiert die Tinte und verursacht an allen Gegnern in ihr 30/65/100/135/170 (+70% AD) phy. DMG. \n\nWährend der 2sec. kann man aus den Tintenfass Einschlagsort einen P AA ziehen welcher bis zu 300/340/380/420/460 Einheiten lang ist. Gegner auf ihn werden genau so stark u. oft verlangsamt wie im Einschlagsort und auch der Schaden wird auf ihn angerichtet nach den 2sec. zur Explosion. Wo der Strich teilweise im Einschlagsort drinne ist, also 2x Tinte übereinander ist, da ist der Slow pro 0,4sec. sowie der Endschaden 125%.\n\n\nKosten: 50/56/62/68/74-----Reichweite: 650-----Radius: 275-----Abklingzeit: 16/15/14/13/12\n.\n.\n.\n#W: °)Brennende Leidenschaft(°\n\n_Passiv:_ Tintenstriche bleiben, auch nach ihrer Aktivierung, noch 2/2,3/2,6/2,9/3,2sec. bestehend  Sie gelten als 1 Strich wenn mehrere sich überschneiden. Sie können durch diese Aktive Entflammt werden und verursachen auf der ganzen Linie 5/10/15/20/25 (+10%AD) phy. DMG alle 0,5sec. über max. 2sec. an Gegner auf ihnen (hört sofort auf wenn Linie verschwindet). \n\nAktiv: Atramen kann für bis zu 3,5sec. einen max. 500/600/700/800/900 Einheiten langen Strich ziehen welcher schon bei der ersten Berührung mit einen Gegner und nicht erst nach einer gewissen Zeit, 20/40/60/80/100 (+30% AD) phy. DMG an ihn verursacht. Die bereits gezogene Linie bleibt die ganzen 3,5sec. bestehend und verursacht pro 0,5sec. an Gegner auf ihr 10/20/30/40/50 (+10% AD) phy. DMG.                         \n\n_Q: _Die Tinte des Fasses und der eventuelle Tintenstrich können ebenfalls zum brennen gebracht werden für max. 2sec. (selber DMG wie Passive siehe Oben). Dabei kann man durch Tinte des Fasses und den eventuellen Tintenstrich 2x den DMG erhalten wenn man auf 2 Schichten Tinte steht. (Wenn explodiert dann hört brennen auf überall.)\n\n_E:_ Nichts\n\n_R:_ Die teleportierte Leinwand kann, da sie noch 2sec, dasteht, auch entflammt werden. Auch Hier gilt das übereinander liegende Striche als 1 zählen und der DMG ist auch der selbe wie beim Brennenden Tintenstrich. Bevor sie teleportiert wird können KEINE Striche im ganzen Leinwand-Gebiet entflammt werden da sein Kunstwerk nicht zerstört werden darf!!!\n\n_Kann abgebrochen werden. Während der W können keine Fähigkeiten neu aktiviert werden aber bereits benutzte: die Q explodiert immernoch, E man sprintet auch mit der W noch Aktiv und kann so sehr schnell eine Linie  ziehen. R, W zählt auch dafür als Linie und bleibt (wenn auch nach den 3,5sec. Ohne Effekt und kann keine Linie anbrennen) die ganzen 4-5sec. liegen._\n\n\nKosten: 50/59/68/77/86-----Reichweite: 500/600/700/800/900-----Abklingzeit: 20/19/18/17/16\n.\n.\n.\n#E: °)Schneller Pinselstrich(°\n\n_Passive:_ Nachdem man mit einen Passiven Tintenstrich Q oder E verbessert hat, erhält man 20/26/32/38/44% AS für 2/2,2/2,4/2,6/2,8sec.\nsec sowie einen MS Bonus der Tintenstriche (wie schnell sie erleuchten->vom Anfang zum Ende der Linie) um 10/15/20/25/30%. Kann nicht öfter als alle 20/18/16/14/12sec. passieren.\n\nAktiv: Atramen erzeugt am Zielort einen Tintenklecks. Zu diesen sprintet er nach 1,5sec. wenn er noch in Reichweite ist. Dabei verursacht er an Gegnern auf den Weg und nochmal am Zielort 20/39/58/77/96 (+35%AD) phy. DMG.\n\nWährend der 1,5sec. kann Atramen aus den Tintenklecks einen P AA in beliebige\nRichtungen ziehen welcher bis zu 300/320/340/360/380 Einheiten lang ist. Nach den 1,5sec.  dasht er nicht nur zum Klecks sondern dannach auch noch den Tintenstrich entlang und verursacht dort erneut (also max. 3x) denselben DMG an Gegnern. Er kann nicht über Terrain dashen egal bei welchen Dash.\n\n\nKosten: 60/64/68/72/76-----Reichweite: 580-----Radius: 250-----Abklingzeit: 19/18/17/16/15\n.\n.\n.\n#Ultimative Fähigkeit: °)Meisterwerk(°\n\n_Passiv:_ Mann mit P  AA´s Kreise, Quadrate oder Dreiecke malen. Diese haben keine vorgegebene Größe und müssen nicht perfekt aussehen aber erkennbar und in sich geschlossen. Sie halten 1/1,5/2sec. bevor sie verschwinden also am besten direkt um sich o. Verbündete malen. Jede Form kann nur 1 Buff zum ersten geben der in sie rein geht.\n_Kreise:_ +20/25/30% MS für 1/1,5/2sec.\n_Quadrat: _30/60/90 (+30%AD) Heilung.\n_Dreieck:_ +20/27/34% AS für 1,5/2/2,5sec.\nJede Form kann einzeln maximal alle 15/12,5/10sec. benutzt/gemalt werden.\n\n\nAktiv: _(100 Weltentinte zur Aktivierung notwendig + Mana)_\nAtramen erschafft für 4/4,5/5sec. eine Leinwand in Form einen Kreises. In dieser kosten seine Tintenstriche und Verbesserungen der Fähigkeiten durch diese keine Weltentinte. Alle Striche, ob durch die Passive, der Q, W, E Fähigkeiten oder der Ult Passiven Formen, bleiben bis zum Ende der 4-5sec. auf der jeweiligen Stelle der Leinwand ohne Effekt bestehend auch wenn sie schon explodiert oder sonst wie geendet haben. Nach den 4-5sec. kann Atramen die gesamte Leinwand  zu einen anderen Ort teleportieren wo, nach 1,3sec. und Indikator der Striche, allen Gegnern bei ihrer ersten Berührung mit irgendeiner Linie einmalig 150/230/310 (+80%AD) phy. DMG zugeteiltwird. Die Leinwand bleibt dort für weitere 2sec. (Effekt: keine Weltentintekosten ab da weg.)\n\n\nKosten: 100/97/94+100 Weltentinte----Reichweite: 1:Selbst/2:1000-----Radius: 550----Abklingzeit: 108/100/92\n.\n.\n.\n**5: Build/ Runen:**\n\n{{item:3006}} {{item:3149}} {{item:3094}} {{item:3508}} {{item:3087}} {{item:3813}} \n{{summoner:4}} {{summoner:7}} \n.\n.\n**Runen:**\n\n**1: Verrückter Künstler:**\n\nPräzision:\nTödliches Tempo\nGeistesgegenwart\nLegende: Eifer\nGnadenstoß\n\nDominanz:\nGeschmack von Blut\nGefrässiger Jäger\n\n.\n.\n\n**2: Kosmische Farben:**\n\nInspiration:\nEiszeit/ Kleptomanie\nPerfektes Timing\nZukunftsmarkt\nKosmische Einsicht\n\nZauberei:\nÜberlegenheit\nAufziehender Sturm\n.\n.\n.\n**6: Combos:**\n\nEin R Passives: Dreieck zeichnen aber noch nicht reingehen. Dann E in Richtung Gegner und durch das Dreieck und mit einen Tintenstrich einen Pfad davon in die Richtung ziehen in die man denkt wohin der Gegner flüchtet. Nach den 1,5sec. sprintet man zum Gegner durchs Dreieck mit den AS Buff und erhölt von der E Passiven auch noch AS. Selbst wenn man den Gegner keinen DMG zufügt mit der E weil man ihn vielleicht nicht trifft so ist man dann doch nahe an ihn und bombardiert ihn mit AA´s.\n\nQ auf den Gegner und mit einen Tintenstrich aus der Q nochmal über ihn. Er wird viel schneller verlangsamt und mit der W kann man die Q dann noch zum brennen bringen wobei der Gegner auch 2x den Brennschaden wegen den überlappenden Linien + den eigentlichen W Aktiv Schaden erhält. Am Ende folgt dann die Explodion welche auch nochmal viel Schaden an Gegnern verursacht welche auf der Tinte der Q und der Passiven Tintenstriche stehen.\n\n\nEin R Dreieck zeichnen. Ult Aktivieren und ins Dreieck reingehen. Den Gegner mit Tintenstrichen und den durch diese verbesserte Fähigkeiten angreifen. Nach den 4-5sec. die Leinwand zu anderen oder den möglicherweise fliehenden Gegner teleportieren und ihn damit zur Strecke bringen weil es schwer ist auf einer vollgekleisterten Leinwand nichts ab zu bekommen.\n.\n.\n.\n**7: Freunde/ Feinde, Herkunft u. Interaktionen:**\n\n**Herkunft:** Ionia\n.\n**Freunde:** Irelia, Master Yi, Yasuo, Karma, Akali, Shen, Kennen. Also alle die ionia verteidigt haben.\n.\n**Feinde:** Alle Noxianer sowie brutale Vastayas wie Xayah.\n.\n**Sprüche:**\n\n**Pick: **„Eine neue Leinwand. Ein neues Werk!“\n.\n**Bann:** „Anscheinend kann man dieses Kunstwerk nicht verbessern.“\n.\n**Joke:** Atramen malt sich selber auf einen Blatt Papier und bestaunt sein Werk. Dann sagt er: „Du würdest sicherlich gerne so gut aussehen oder?, „Das Bild hänge ich direkt neben deinen leblosen Körper auf.“\n.\n**Taunt:** Atramen malt die Silhouette des nächsten Gegners auf den Boden und tritt dann darauf und verschmiert sie nachdem er darüber lacht.\n.\n**Tanz: **Er steigt auf seinen Pinsel und schlittert über den Boden der dadurch Bunt wird.\n.\n**Bewegung:** „Dieser Ort könnte etwas mehr Farbe gebrauchen.“\n„So Öde, hier ein bisschen mehr Grün, ahh da vielleicht etwas Dunkelblau..ohhh und dort…..“, \n„Eine gigantische Leinwand liegt vor mir. Ich muss nur anfangen zu Malen.“\n„Wer hat den bitte diese farbarme Landschaft erstellt?“\n.\n**Angriff:** „Ein Schnitt mit Farbe!“\n„Mein Pinsel geht durch alles hindurch…und macht es dabei noch schöner.“\n„Du brauchst einen neuen Anstrich“\n„Dein Lack blätterte schon ab!“\n„Ich frische deinen Teint nochmal auf okay?“\n.\n.\n.\n**Champions:**\n\n{{champion:39}} =\"Ich verstehe dich. Du wolltest nur tanzen. Ich wollte nur malen. Diese Welt zwang uns zu Brutalität.“\n{{champion:432}} = “Aus deinen Bart könnte man sicherlich viele Pinsel herstellen..mhhh.“\n{{champion:136}} =“Hübsche Farbkombination, dass muss ich mal sagen!“\n{{champion:202}} = “Kunst? Kunst? Du bist nur ein Verrückter Killer..ohhh warte…das Kunstwerk von dir sieht garnicht mal so schlecht aus.“\n\"Zusammen könnten wir ein Meisterwerk erschaffen..ich mochte schon immer die Farbe Rot!\"\n{{champion:222}} = “Graffiti ist nun wirklich das Letzte!“\n{{champion:203}} = “Ich frage mich, wer hat eue Masken bemalt?“\n{{champion:64}} = “Ein Jammer das du meine Kunst nicht sehen kannst.“\n{{champion:518}} =“Uhhh! Eine lebende Leinwand! Ich denke wir können beste Freunde werden.“\n{{champion:516}} =\"Schmieden ist so grob. Malen ist sanft und kreativ!“\n{{champion:517}} =\"Wehe du klaust mir meine Kunstwerke!“ \n„Kunsträuber!!!“\n{{champion:122}} = \"Hack.hack.hack. Ich zeichne sanft und kann doch eine ganze Armee vernichten!\"\n{{champion:6}} =\"Ihh. Das ist keine Leinwand wert!\" \n\"Daran verschwende ich keine Farbe!\"\n{{champion:119}} =\"Vom deinen Ego will ich kein Bild zeichnen!\"\n.\n.\n**Items:**\n{{item:3149}} = “Kunst kann auch Leben nehmen!“\n{{item:3095}} =\"Ein schneller Strich!“\n{{item:3087}} =“Farbblitze!“\n{{item:3094}} =“Ein langer Tintenstrich kann nicht schaden.“\n{{item:3812}} =\"Ich male Rot......!“\n{{item:3072}} =\"Rot wie die Opfer meiner Werke...\"\n{{item:3508}} =\"Die Tinte ist meine Essenz!\"\n{{item:3085}} =\"Verbreite meine Kunst. Sprüh sie hinaus in die Welt!\"\n.\n.\n.\nBeim drücken von F5 außerhalb des Kampfes ändert sich seine Laufanimation. Er schleift seinen Pinsel am Boden was eine Farbspur hinterlässt (Farben wechseln ständig).\n.\n.\n.\n**8: Aussehen:**\n\nAtramen sieht aus wie ein Mensch mit animalischen Ohren wie bei einen Fuchs, relativ dünnen Augen die bunt leuchten, Pfoten statt Füßen, einen Schwanz und generell etwas haariger als ein normaler Mensch. Er ist mittelgroß und schlank. Er trägt seinen Pinsel zusammen mit Pergamenten und Farbbehältern in einer Art Rucksack/ Tasche auf seinen Rücken.\n.\n.\n.\n**9: Skins:**\n\n**Cosmic Atramen: 1350 RP**\nAlle seine Farben sind kosmisch und dunkelblau, lila, dunkelorange und dunkelgrün. Bei seinen Pinselangriffen leuchten die Striche und in ihnen funkeln Sterne und weit entfernte Galaxien. Er selber ist halb durchsichtig und hat in ihn leuchten Planeten, Sterne und Galaxien in wunderschönen Farben.\n.\n.\n**Projekt-ART: 1350 RP**\nEr sieht futuristisch aus und sein Pinsel ist ein Hologramm welches seine Farben immer ändert und flimmert. All seine Farben flimmern manchmal wie bei einen Hologramm und leuchten intensiver. Im inneren der Farben erscheinen 1 und 0 (Binärcode) welche sich schnell bewegen aber eher durchsichtig sind. Er trägt einen Umhang und ist relativ schwarz und dunkellila und rot gekleidet. Von seinen Gesicht oder Haut ist nichts zu sehen stattdessen nur eine typische Projekt-Maske.\n.\n.\n.\nDanke fürs lesen meines Champion Konzeptes. Etwas kompliziert (nunja wie immer^^) aber möglich und viele wollen ja einen Ink Mage in League of Legends. Hier ist mein Konzept für einen:) Ich hoffe euch hat dieses Kreative, aber hoffentlich nicht zu stake oder zu unverständliche, Konzept gefallen. Bitte schreibt fleißig Kommentare und Bewertet _(MiT KoMmeNtAr aLs GRunD!)_\nMfG Cosmic:)","replies":[{"poster":"astrofan","date":"2019-01-28T18:24:04.521+0000","up_votes":3,"down_votes":0,"body":"Also ich muss jetzt mal sagen, das ist ein extrem gut erdachter Champ, sogar mit in das derzeitige Runeterra passender Geschichte, das haben nur wenige Konzepte. Du hast geschrieben \"etwas kompliziert\", ich bin der Meinung komplizierter als alles, was bisher je auf der botlane gespielt wurde. Wäre aber ein wirklich interessantes Kit, würde ich wirklich gerne in LoL sehen, natürlich mit evtl. etwas anpassten Nummern, je nachdem, was die diversen Teststufen so liefern. Hätte nur wahrescheinlich dsa selbe Problem wie Aurelion, extrem einzigartig und schwierig, daher mit wahrscheinlich geringer Pick- und Winrate, gleichzeitig sehr stark und erstaunlich Meta-unabhängig, wenn man mit dem Champ gut umgehen kann.\nAlles in allem ein sehr interessantes und wirklich gutes Konzept, habe ich gerne gelesen.","replies":[{"poster":"CosmicSphere","date":"2019-01-28T19:30:52.365+0000","up_votes":2,"down_votes":0,"body":"Wow danke. Anhand der Aufrufzahlen der meisten Konzepte seit einer gewissen Weile sehe ich das das Forum gerade wieder am boomen ist:) Das freut mich.\nJa ich habe irgenwie eine Versessenheit auf solche komplizierten Champions welche das Ryze/Azir/Aurelion Sol Problem haben^^.\n\nFreut mich das es dir gefällt:)","replies":[{"poster":"Amycos Cyrus","date":"2019-02-01T15:07:07.570+0000","up_votes":2,"down_votes":0,"body":"Ist doch super.\nChampions, die sehr einzigartig sind, sind doch die besten.\n\nIch finde dieses Konzept extrem genial. Zwar finde ich einige Kombinationen schwer vorstellbar (Da meine Fantasy auch etwas begrenzter ist, als die vieler anderer XD), aber allein die Idee der Passiven und ihre Konzeption über alle Aktiven mitzunehmen ist dir extrem gut gelungen.\n\nPS: Ich bin eh ein Fan von deinen Konzepten (und denen einiger wenigen anderer XD)","replies":[{"poster":"CosmicSphere","date":"2019-02-01T16:02:26.625+0000","up_votes":1,"down_votes":0,"body":"Es freut mich wirklich sehr zu sehen das dieses Konzept so gut ankommt:)\nJa, ich muss sagen auf die Passive und ihren Anwendungsmöglichkeiten bin ich sehr stolz aber es ist natürlich sehr kompliziert  ^^\n\nUnd danke das du meine Konzepte generell gut findest. Es könnte eine Weile dauern bis zum nächsten Konzept...\naber mir gehen die Ideen niemals aus!\n\nSchönen Tag noch,\nMfG Cosmic:)","replies":[{"poster":"Amycos Cyrus","date":"2019-02-01T16:20:16.356+0000","up_votes":1,"down_votes":0,"body":"Die Passive hatte ich auch in einer anderen Umsetzung als Idee. Das kann ich jetzt wohl in die Tonne treten XD Natürlich nicht! Aber die Art und weise, sie überall aktiv einzufügen ist echt einzigartig.\n\nWenn du Spaß an Konzepten hast. Ich habe eben gerade ein kooperatives Konzept eingestellt, vielleicht schaust du dir das mal an.\n\nPS: Gehörst du auch zu denjenigen, die \"InoKami\" angeschrieben hatte? Ich könnte es mir jedenfalls sehr vorstellen XD","replies":[{"poster":"CosmicSphere","date":"2019-02-01T16:41:48.800+0000","up_votes":1,"down_votes":0,"body":"Ja ich gehöre zu den Außerwählten aber nach diesen Konzept habe ich leider für einen geraumen Zeitraum keine Zeit mehr für sowas... Daher musste ich dankend ablehnen leider. Ich hoffe er findet einen ebenbürdigen Konzeptschreiber^^\n\nUnd ja ich habe mega Spaß beim erstellen von Konzepten:)\nLese mir deines jetz erstmal durch. Bis gleich","replies":[{"poster":"INoKami","date":"2019-02-01T17:06:37.862+0000","up_votes":1,"down_votes":0,"body":"_*_ Meow _*_\n\nWir werden uns noch wiedersehen, Gefreiter Ablinkzeit!","replies":[]},{"poster":"Amycos Cyrus","date":"2019-02-01T16:49:18.746+0000","up_votes":1,"down_votes":0,"body":"Schade.\nHätte echt gern mal was mit dir zusammen generiert.\nVielleicht findet man sich ja mal für ein anderes Projekt, denn ich hoffe sehr, dass sich auch kooperative Konzepte ergeben. Bislang fand ich die immer recht genial (auch wenn ich atm. erst bei zwei beteiligt war und aktuell ja eines bevorsteht.)","replies":[]}]}]}]}]}]}]},{"poster":"Chain of Heaven","date":"2020-02-10T20:11:50.673+0000","up_votes":2,"down_votes":0,"body":"Also den Championg würde ich ja nur all zu gerne in meiner kleinen Sammlung wissen. Er ist gut durch dacht und ich finde es schade, das Riot noch nicht darauf aufmerksam geworden ist. {{sticker:sg-lux}}","replies":[]},{"poster":"CosmicSphere","date":"2019-01-30T17:42:07.444+0000","up_votes":1,"down_votes":0,"body":"Die restlichen 2099 Leute können gerne auch kommentieren und bewerten XD","replies":[{"poster":"INoKami","date":"2019-01-30T17:50:19.046+0000","up_votes":1,"down_votes":0,"body":"Freu dich doch mal. Du hast in nur 2 Tagen den View-Rekord von meinem bisher besten Konzept gebrochen, welches schon vor über 2 Jahren releaset wurde...\nIch habe immer noch Konzepte, die seit schon mehr als 3 Jahren draußen sind und teilweise immer noch weniger als 300 Views haben.","replies":[{"poster":"CosmicSphere","date":"2019-01-30T17:53:42.678+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=INoKami,realm=EUW,application-id=L7E6lhzo,discussion-id=d18Ux51z,comment-id=00010000,timestamp=2019-01-30T17:50:19.046+0000)\n>\n> Freu dich doch mal. Du hast in nur 2 Tagen den View-Rekord von meinem bisher besten Konzept gebrochen, welches schon vor über 2 Jahren releaset wurde...\n> Ich habe immer noch Konzepte, die seit schon mehr als 3 Jahren draußen sind und teilweise immer noch weniger als 300 Views haben.\n\nWar ja auch lustig gemeint und ich bin MEGA überrascht über die Aufruferzahlen:)","replies":[]}]}]}]}