{"poster":"llerruB","date":"2015-12-10T21:52:29.538+0000","title":"Pixelated/Blurry Range Indicators","subforum":"Miscellaneous","up_votes":2,"down_votes":0,"body":"Hi there, \r\n\r\nI sent this to support but was told to try my luck here, hopefully someone can help! \r\n\r\nI have wondered ever since I started playing; why are the range indicators so pixelated? \r\nI&#039;ve provided the example of Thresh, where his [Flay&#039;s range indicator](http://imgur.com/vEI3cRS) seems quite pixelated, however his [Death Sentence&#039;s range indicator](http://imgur.com/RMDxMIn) seems quite clear (at least more so than the Flay).\r\nI&#039;m just wondering if this is an issue with my computer/settings or whether it&#039;s just how they are, and if it is just how they are, why are they so pixelated, and why are some more pixelated than others?\r\n\r\nJust for reference my settings are all on very high except for shadows which are on high, and I&#039;ve even tried turning on Anti-Aliasing but it didn&#039;t seem to make a difference.\r\n\r\nI&#039;ve always wondered and would love to know how to fix this!\r\n\r\nThanks a lot. :)","replies":[{"poster":"Zorphiax","date":"2015-12-11T08:26:47.599+0000","up_votes":1,"down_votes":0,"body":"I saw nothing wrong with the pixelations anyway (might be your computer or laptop)","replies":[{"poster":"llerruB","date":"2015-12-11T11:56:54.160+0000","up_votes":1,"down_votes":0,"body":"Yeah, so I guess it must be my computer. But I'm not sure what settings to change... I've tried almost everything.\n\nI do find it weird that the Q looks okay but the E doesn't.","replies":[{"poster":"Talon12","date":"2015-12-11T12:05:08.981+0000","up_votes":1,"down_votes":0,"body":"make sure your computer is on its highest performance and if you have multiple, use the better graphics card","replies":[{"poster":"Zorphiax","date":"2015-12-11T14:12:39.081+0000","up_votes":1,"down_votes":0,"body":"Yeah. But, I play on like Very low on all graphics on a shitty laptop that's doesn't lag but slows down when Ashe autos and thresh flay and death sentence is fine on mine.","replies":[{"poster":"llerruB","date":"2015-12-11T21:04:23.111+0000","up_votes":1,"down_votes":0,"body":"Yeah, that's why I find it weird. My computer is pretty good and my settings are all on very high except for shadows. Even with anti-aliasing on it doesn't seem to make a difference.","replies":[]}]}]}]}]}]}