{"poster":"EUW hwangje","date":"2019-01-10T18:39:09.870+0000","title":"Gamer Sensei eine seriöse Seite?","subforum":"Level Up: Guides & Tipps","up_votes":1,"down_votes":0,"body":"Hallo Leute,\nIch suche eine M&ouml;glichkeit besser im Spiel zu werden und wollte wissen ob jemand von euch Erfahrungen mit der Seite Gamer Sensei gemacht hat/ob diese Seite seri&ouml;s ist. Da auf der Seite mit Namen wie NicoThePico,Coach Nalu als Coach geworben wird, bin ich etwas misstrauisch dem ganzen gegen&uuml;ber.\nAußerdem wirkt es auch komisch,dass in den meisten Beschreibungen der Coaches steht, dass man lieber 2-4 Stunden auf einmal bestellen sollte.(auch wenn es sinnvoll sein mag, finde ich dass es sich nicht wirklich seriös anhört)\n","replies":[{"poster":"Alustus","date":"2019-01-10T20:19:07.177+0000","up_votes":2,"down_votes":0,"body":"Naja es ist wahrscheinlich seriös, dennoch machen solche Coachings in meinen Augen keinen/wenig Sinn.\n\nIn 2-4 Stunden wird ein Coach dich auf Fehler hinweisen und vllt kurz Basics erklären wie du dinge besser machen kannst, diese Basics bekommst du aber mittlerweile zu hauf in sehr guten kostenlosen Guides vermutlich genauer und ausführlicher vermittelt.\n\nWenn das ganze Sinn macht dann vllt wenn man Dia1 ist und eine Profi Karriere anstrebt, dann würde ich aber auch mehr als 2-4 Stunden buchen.","replies":[]},{"poster":"Warum denn nicht","date":"2019-01-10T18:58:40.682+0000","up_votes":2,"down_votes":1,"body":"Ich bin selber als Coach auf dieser Seite aktiv, und so weit ich das sehen konnte, ist diese vollkommen seriös. Du kannst aber auch mehr auf ihrem Discord erfahren: https://discord.gg/HcB8aS","replies":[]},{"poster":"PlsLoLMMO","date":"2019-01-10T19:27:04.060+0000","up_votes":1,"down_votes":0,"body":"Also ich finde die Seite macht nen einigermaßen seriösen eindruck und das esportler dort in Zeiten wo in league eher weniger stattfindet auch dadurch mal hier und da was dazu verdienen wollen kann ich durchaus nachvollziehen. Zudem hilft es den Coaches selber sich weiterhin aktiv mit League zu beschäftigen und sich selber auch aktiv zu verbessern.\n\nwas ist an 2-4 Stunden nicht seriös? Das ist eigentlich noch halbwegs zu wenig um sinnvoll zu coachen aber 2-4 Stunden ist ein Zeitraum mit dem ein Coach einigermaßen Arbeiten kann vor allem wenn es erst einmal um deine Fehleranalyse geht ( die ja schon ne Stunde benötigt mindestens ) und dann aktiv dich während deines Gameplays zu bewerten etc. Das erfordert Zeit und mit ner Stunde ist dir nicht geholfen. \n\nAllerdings bin ich der Meinung das jemand der für Game-Coaching bezahlt schon ziemlich hart in seinem Leben Probleme haben oder versagt haben  muss. Wer für so etwas geld zahlt ist für mich eher jemand der sich ein gutes Zimmer in der nächstbesten Psychiatrie buchen sollte.","replies":[{"poster":"Warum denn nicht","date":"2019-01-21T13:07:37.380+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=PlsLoLMMO,realm=EUW,application-id=vatevpvi,discussion-id=toj59XYF,comment-id=0001,timestamp=2019-01-10T19:27:04.060+0000)\n>\n> Also ich finde die Seite macht nen einigermaßen seriösen eindruck und das esportler dort in Zeiten wo in league eher weniger stattfindet auch dadurch mal hier und da was dazu verdienen wollen kann ich durchaus nachvollziehen. Zudem hilft es den Coaches selber sich weiterhin aktiv mit League zu beschäftigen und sich selber auch aktiv zu verbessern.\n> \n> was ist an 2-4 Stunden nicht seriös? Das ist eigentlich noch halbwegs zu wenig um sinnvoll zu coachen aber 2-4 Stunden ist ein Zeitraum mit dem ein Coach einigermaßen Arbeiten kann vor allem wenn es erst einmal um deine Fehleranalyse geht ( die ja schon ne Stunde benötigt mindestens ) und dann aktiv dich während deines Gameplays zu bewerten etc. Das erfordert Zeit und mit ner Stunde ist dir nicht geholfen. \n> \n> Allerdings bin ich der Meinung das jemand der für Game-Coaching bezahlt schon ziemlich hart in seinem Leben Probleme haben oder versagt haben  muss. Wer für so etwas geld zahlt ist für mich eher jemand der sich ein gutes Zimmer in der nächstbesten Psychiatrie buchen sollte.\n\nDa widerspreche ich dir. Gaming kann man sehr gut als Sport sehen (bzw Esport), auch wenn das (noch) nicht als solcher anerkannt ist. Und Sport ist auch direkt mit dir selber und deinem Alltag verbunden. Wirst du besser in einem Sport, verbesserst du dich meistens auch als Mensch (mehr Muskelmasse, Taktisches Verständnis...). Oder denkst du, die ganzen Profi Fussball/Basketball/NFL Spieler verschwenden ihr Geld für ihre Coaches? Klar kannst du es dir auch selber erarbeiten, dies würde jedoch viel mehr Zeit benötigen, die dir ein Mensch mit mehr Wissen ersparen kann. Ansonsten hätten wir keinen Nutzen an Schulen, Universitäten und jeglichen weiteren Bildungseinrichtungen.","replies":[]},{"poster":"eingew","date":"2019-01-11T08:41:32.900+0000","up_votes":1,"down_votes":0,"body":"Ich würde mich mit solchen haltlosen Diagnosen zurückhalten.","replies":[]}]}]}