{"poster":"Mister Chief","date":"2016-05-04T09:55:10.043+0000","title":"New Swain is amazing and the team who worked on him should feel amazing too!","subforum":"Gameplay & Strategy","up_votes":4,"down_votes":0,"body":"Through a combination of the changes to his kit and the awesome new items, Swain feels more like a real champion than he ever has. The neat buff to his passive mana restore, as well as the one-point wonder of E (which was a huge surprise for me reading over the patch notes) and new ticking mechanic on R and Q are all awesome changes that I feel fix a lot of gripes I had playing him over 4 years, while still keeping him the same champion identity-wise. \r\nNot only that, the new items break up the monotony of the old Swain build (RoA into Zhonyas) with the GLP item, new, mana-giving Morellos, and all the other stuff, really is wonderful. \r\nI just have to say thank you for making him feel fun to play again. I picked Swain up a good 4 or so years ago, and since then he&#039;s felt incredibly static in playstyle. Thanks for changing that, and not screwing it up :)","replies":[{"poster":"Shes my Princess","date":"2016-05-05T07:41:00.172+0000","up_votes":1,"down_votes":0,"body":"Also former swain main here. Why does his ult now have a significant cast time? AFAIK it wasn't mentioned in the rework... am I missing something?","replies":[{"poster":"Shes my Princess","date":"2016-05-05T07:41:22.882+0000","up_votes":1,"down_votes":0,"body":"Feels so damn clunky activating his ultimate","replies":[{"poster":"Talon12","date":"2016-05-05T07:44:36.947+0000","up_votes":2,"down_votes":0,"body":"ikr, and the heal is so small its like its not even there unless like 20+ minions, 4+ champs and you sit there taking no damage for atleast 5 sec","replies":[{"poster":"Shes my Princess","date":"2016-05-06T03:32:07.543+0000","up_votes":1,"down_votes":0,"body":"It's being fixed :)  http://boards.na.leagueoflegends.com/en/c/gameplay-balance/xjvV0YeJ-69-balance-hotfix-going-out-soon","replies":[]}]}]}]},{"poster":"Talon12","date":"2016-05-05T07:45:58.543+0000","up_votes":1,"down_votes":0,"body":"His ult heal is negligible, not even a 1//4 what it used to be unless there are 10+ targets.","replies":[]},{"poster":"SIayton","date":"2016-05-05T02:32:40.581+0000","up_votes":1,"down_votes":0,"body":"And then there's Velkoz.... \n\nRIP buddy T_T","replies":[]},{"poster":"Pararnore","date":"2016-05-04T21:07:45.800+0000","up_votes":1,"down_votes":0,"body":"Feeling the same about Zyra :) I kind of prefer her old q, but the new one allows you to hit more seeds, so its understandable. A good passive, 325 --> 340 movespeed, the plant fury passive... it's all so good :)","replies":[]}]}