{"poster":"Joacgroso","date":"2017-07-09T22:55:31.800+0000","title":"¿Algún consejo para Shaco?","subforum":"Guias y consejos","up_votes":5,"down_votes":0,"body":"Empec&eacute; a jugar lol este a&ntilde;o y como tercer campe&oacute;n me eleg&iacute; a Shaco, ya que me encanta su jugabilidad. No se c&oacute;mo habr&eacute; hecho para llegar a m6, pero actualmente soy p&eacute;simo con &eacute;l. Cualquiera que me busque en op.gg puede ver lo horrible que me va en cada partida (siempre fedeo y no saco m&aacute;s que b+ en el mejor de los casos). Lo uso para ir jg ad. &iquest;Qu&eacute; me recomiendan para no morir tanto y sacar las S necesarias para la m7? Gracias de antemano.","replies":[{"poster":"Zetsubou Jhin","date":"2017-07-10T02:42:32.000+0000","up_votes":3,"down_votes":0,"body":"Jugué mucho con el Shaquete. Y mejore mucho cuando entendí los **limites del personaje**. Me refiero a que es importante que entiendas cuanto daño podes hacer y cuanto podes aguantar. Antes de gankear pregúntate_ ''Puedo matar a ese enemigo?'' ''Me pueden matar a mi?''_ Si te parece que no vas a salir vivo no te mandes. Trata de **evitar la muerte** todo lo posible, porque Shaquete se queda atrás muy fácil con el nivel. Es mejor no desperdiciar el tiempo en un gank fallido y aprovecharlo farmeando. \nEsto es algo que vas a ir aprendiendo a medida que juegues varias partidas y pelees contra diferentes enemigos, pero anda fijándote. \nTenes que ser muy **oportunista**. \nNo dejes que el equipo te presione para  estar en team fight. **Espera tu momento**. En la Tf espera a ver a un enemigo con poca vida para entrar. \nY si no encontras el hueco para la kill...** el Slip Push es la clave**.  \nY los **objetivos**, Shaco se hace los dragones y el heraldo muy rápido con la R. \nTambién tenes que aprender a sobrevivir, **esquivar habilidades activando la ulti** te puede salvar en muchas situaciones. \n\nSuerte! Ojala te sirva de algo esto :D","replies":[{"poster":"Mama Franku","date":"2017-07-10T16:20:38.909+0000","up_votes":2,"down_votes":0,"body":"Nada que ver con el tema, solo vengo a decir que me gusta tu nombre. ^^","replies":[]}]},{"poster":"afelpadito","date":"2017-07-09T23:09:01.179+0000","up_votes":2,"down_votes":0,"body":"soy unranked y juego desde la S3 shaco fue mi primer champ y lo mejor que puedes hacer es ver unos videos el reve solia ver yo otros prefieren a shaclone  es cosa de gustos \npero si no quieres feedear tanto guarda la Q para cuando sea necesario y ten en cuenta la duracion que tiene (antes era mas)","replies":[{"poster":"Mama Franku","date":"2017-07-09T23:15:41.865+0000","up_votes":3,"down_votes":0,"body":"Hasta shaclone está decepcionado con el nerfeo que le dieron al payasito, es re triste D:","replies":[]},{"poster":"Joacgroso","date":"2017-07-09T23:32:11.968+0000","up_votes":1,"down_votes":0,"body":"Sí, he visto algunos videos de Reve, Pink Ward y White Crow, pero sigo siendo horrible. ¿qué ruta, runas, maestrías y build me recomendás?","replies":[]}]},{"poster":"Matador 1913","date":"2017-07-10T14:32:28.075+0000","up_votes":2,"down_votes":0,"body":"Sacale {{item:3077}} de entrada, ponete  a farmear y gankea  apenas saques nv 3 que con ignite te llevas la kill. Acordate  que en el gank debes poner la caja justo atras asi le sacas el escape. Subile la Q 2 o 3 veces al comienzo y dsps la E a full. En late, espera agazapado el momento justo  para saltarle al adc y te lo llevas facil.\n\nAlgo importante en el early es tratar de pegarle por la espalda a los campamentos, tienen un delay en darse la vuelta cuando te pegan.\n\nEn caso de tenerte fe podes invadir la jg enemiga, guardandote la Q para salir, y poniendo cajas para ESCAPAR y no para farmear (bueh, esta bien, si el jg esta en la otra punta del mapa podes usarla para farmear)\n\nShaco ahora se hace full daño{{item:3117}} {{item:1412}} {{item:3074}} {{item:3031}} {{item:3087}} {{item:3026}} Los items pueden variar de acuerdo al team enemigo.\n\nApenas activas la ulti tenes un seg de invulnerabilidad, con practica esquivas muchos skilles y ultis.\n\nHace (con el clon) un excelente splitpush y dragones.\n\nSino mainea rammus con{{item:3800}} y gg .","replies":[]},{"poster":"KataResets","date":"2017-07-09T23:37:33.989+0000","up_votes":2,"down_votes":0,"body":"https://www.youtube.com/watch?v=A1dAUneGPBE intenta esa ruta con shaco :D","replies":[{"poster":"MarKowniKoff","date":"2017-07-10T00:59:16.577+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=KataResets,realm=LAS,application-id=8sKIclmi,discussion-id=wley4A4U,comment-id=0003,timestamp=2017-07-09T23:37:33.989+0000)\n>\n> https://www.youtube.com/watch?v=A1dAUneGPBE intenta esa ruta con shaco :D\n\nque es eso? queremos la droga twitch","replies":[]},{"poster":"Joacgroso","date":"2017-07-10T00:00:12.739+0000","up_votes":1,"down_votes":0,"body":"Muchas gracias, ahora lo estoy viendo. Por cierto, ¿es viable empezar en red y tratar de matar al otro jg cuando está en blue?","replies":[]}]},{"poster":"Mama Franku","date":"2017-07-09T23:13:03.231+0000","up_votes":2,"down_votes":0,"body":"Shaco a mi parecer es un buen campeón, lo he usado por un tiempo, pero lamentablemente creo que está bastante atrás actualmente, más con los últimos cambios que le han hecho... Es una lástima, ya no lo veo como una opción viable para mis partidas...","replies":[]},{"poster":"Zabivaka","date":"2017-07-09T23:22:24.919+0000","up_votes":1,"down_votes":2,"body":"Armalo AP\nfin","replies":[{"poster":"Black Beret","date":"2017-07-10T00:04:41.270+0000","up_votes":2,"down_votes":0,"body":"Alguien no lee los patchnotes :PPPp","replies":[{"poster":"Zabivaka","date":"2017-07-10T12:42:38.050+0000","up_votes":1,"down_votes":2,"body":"El unico rey es shaco ap, los ad no existen, y los tanques ni te cuento.","replies":[{"poster":"Black Beret","date":"2017-07-10T17:04:47.126+0000","up_votes":1,"down_votes":0,"body":"Le sacaron todos los escalados ap compaaaaaa","replies":[{"poster":"Zabivaka","date":"2017-07-11T00:23:25.217+0000","up_votes":1,"down_votes":0,"body":"Bueno le armo diente de nashor que escala con AP y listo, volvio el emperador","replies":[{"poster":"Black Beret","date":"2017-07-11T14:19:00.208+0000","up_votes":1,"down_votes":0,"body":"Tercooooo no le sirve el ap porque la e ya no escala con appppp","replies":[{"poster":"Zabivaka","date":"2017-07-11T17:57:30.963+0000","up_votes":1,"down_votes":0,"body":"Todo escalaba con AP, si solo lo usabas por la E sos un serdo inkulto xdxd","replies":[{"poster":"afelpadito","date":"2017-07-12T22:12:00.329+0000","up_votes":1,"down_votes":0,"body":"viejo yo lo hago ap solamente en los aram pero que onda? me dijeron lo mismo que ya es ad pero solo lei cuando le pusieron escalado de ad no que le hayan eliminado el de ap...\nnose que onda\nigual siempre he creido mejor ad con efectos como statik/draktar ya que el clon los usa igual","replies":[]}]}]}]}]}]}]}]},{"poster":"Ks Erwyn","date":"2017-07-11T22:44:41.703+0000","up_votes":1,"down_votes":0,"body":"No usarlo, esta en la mierd%, este parche lo termino de matar..\n\n\n\n\nRIP  {{champion:35}}","replies":[]}]}