{"poster":"kasub","date":"2017-01-24T16:37:52.655+0000","title":"Blank match history page","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"For at least some days my detailed match history at http://matchhistory.euw.leagueoflegends.com/en/ has been blank. I can't view any matches,  even when I directly link to them from my client. I've cleared my cache, turned off adblocker, made sure cookies are allowed, tried incognito mode and different browsers. Nothing seems to work and when I googled for people with similar problems seen no solutions at all. \r\n\r\nThis is how it looks http://i.imgur.com/ev3tKpE.jpg","replies":[{"poster":"Porocles","date":"2017-01-24T17:14:28.947+0000","up_votes":2,"down_votes":0,"body":"I just looked up [your match history](http://matchhistory.euw.leagueoflegends.com/en/#match-history/EUW1/218727325), and everything looks fine to me.  If this is still an issue, try pressing Ctrl+Shift+R to refresh your browser.  Clearing your [cache and cookies](https://support.riotgames.com/hc/en-us/articles/201752694-Clearing-Browser-History-and-Cookies) may help as well.  Let me know if you have any questions!","replies":[{"poster":"kasub","date":"2017-01-24T17:26:19.743+0000","up_votes":1,"down_votes":0,"body":"I have cleared my cache and cookies multiple times as I said in my opening statement. I tried incognito and different browsers and it doesn't work either. Refreshed my browser and didn't work. I know my friend can see my match history and now you as well so I have no clue what the issue is.","replies":[{"poster":"Porocles","date":"2017-01-24T17:35:39.946+0000","up_votes":2,"down_votes":0,"body":"You did, sorry about that.  Still filling up on my coffee this morning.  :D  We have received a few reports on this, and a force refresh usually fixes it which is the reasoning behind those suggestions.  Since that didn't work, hit us up in a [support ticket](https://support.riotgames.com/hc/en-us/requests/new) so our tech team can gather the reports and investigate further.  We'll get back to you.","replies":[{"poster":"kasub","date":"2017-01-24T17:40:17.557+0000","up_votes":1,"down_votes":0,"body":"Thanks for the reply! Will send a support ticket.\n\nJust to be clear by force refresh you just mean ctrl+ shift+ r over and over again? Tried that 10~ times in a row and nothing changed.","replies":[{"poster":"Porocles","date":"2017-01-24T17:43:21.863+0000","up_votes":2,"down_votes":0,"body":"That's the one.  Usually, just a once force refresh should do the trick.  Thanks for trying, and we'll reply back to your ticket as soon as we can!","replies":[]}]}]}]}]},{"poster":"MegaV78G87","date":"2017-01-24T18:35:43.044+0000","up_votes":1,"down_votes":0,"body":"My friend and I had this issue before, but it seemed to fix itself after a day or two. Not sure what caused ti and we did not really try anything to fix it, so not sure what fixed it.","replies":[]}]}