{"poster":"CristalFenix","date":"2017-03-03T12:21:31.720+0000","title":"Sfruttare il vantaggio","subforum":"Discussioni generali","up_votes":7,"down_votes":1,"body":"Vorrei chiedervi una cosa. Una delle differenze che vedo tra low e high elo &egrave; la capacit&agrave; di sfruttare il vantaggio, seppur minimo o momentaneo, per trasformarlo in un vantaggio duraturo.\r\nPer esempio:\r\nLa botlane fa una double e ha la lane libera.\r\nOra, in bronzo probabilmente non fanno nulla oltre questo e a parte i gold non ci sono altri vantaggi.. In high elo una cosa del genere si trasforma in torre, drago, cristi e madonne.\r\nVorrei sapere tutte queste decisioni (ovviamente non si possono coprire tutti i casi) per sfruttare un vantaggio.\r\nGrazie :)","replies":[{"poster":"Don Draven","date":"2017-03-03T12:49:49.914+0000","up_votes":3,"down_votes":0,"body":"si di regola è così semplicemente non succede perchè tanto (detto da main jungler) i jungler anche in gold plat sono terribilmente passivi proprio come i laner e anche se vedono la bottom morta non fanno il drk perchè hanno paura della lb nemica,se muore un membro del team nemico anche ai 40 non chiamano il baron quantomeno prima che lo facciano gli alleati,questo ovviamente è molto sbagliato,ogni volta che muore un solo membro del team nemico bisogna assolutamente forzare o baron o drk perchè anche in caso di contest ne uscirebbe un 5v4 a vostro vantaggio.\n\nse ganki la bot ed è double,pushate la torre tanto non faranno mai in tempo a difenderla e il jungler non può difendere da solo,l'unica possibilità è che il mid scende e il top tippa ma non lo faranno ^^.","replies":[]},{"poster":"Jeanne dˆArc","date":"2017-03-03T13:04:09.985+0000","up_votes":2,"down_votes":0,"body":"High elo e low elo sono due mondi totalmente differenti. \n\nIn high elo se una lane perde malamente, nella maggior parte dei casi non recupera più. Il laner vincente sfrutta subito il vantaggio per gankare le altre lane e se possibile, prendere anche torri e draghi. Ciò si trasforma in pochissimo tempo in un vantaggio di gold ed obiettivi non indifferente, che a differenza dei bronzi, difficilmente perderanno. Il più delle volte le partite in high elo finiscono prima del 20° perché una volta preso un consistente vantaggio, il team nemico o chiama l'open mid o il surrender, conscio di avere pochissime possibilità per recuperare la partita. \n\nIn low elo tutto ciò non accade. Il più delle volte capita che un laner vince, prende la torre e invece di sfruttare il proprio vantaggio per trasferirlo anche alle altre lane, torna nella propria lane e continua a pushare senza un vero e proprio motivo, rendendosi così facile bersaglio per un gank. Basta morirci 1-2 volte così per perdere ogni sorta di vantaggio sul nemico, e anzi rischiare di ritrovarsi indietro. In generale in low elo si tende a dare troppa poca importanza agli obiettivi e a tirare per le lunghe ogni partita, dando tranquillamente la possibilità al team nemico di recuperare. \n\nAltra cosa che fa un'enorme differenza, è il livello di abilità e padronanza del champ da parte del giocatore. Una Riven Master 3/0/0 al 5° minuto è nettamente più pericolosa di una Riven Gold 6/0/0 allo stesso minuto, tanto per fare un esempio stupido. \n\nAh e per intenderci, per low elo intendo tutto ciò che va dal B5 al P1. Per high elo intendo da D5 in su e c'è da specificare che a sua volta, in diamante, c'è un enorme abisso tra le 5 divisioni.","replies":[{"poster":"Don Draven","date":"2017-03-03T16:04:25.528+0000","up_votes":2,"down_votes":0,"body":"se mi posso permettere facciamo anche dal diamond 3-2,neanche a mia detta,quantopiù di gente anche master che me lo ha spiegato.","replies":[{"poster":"Jeanne dˆArc","date":"2017-03-03T17:09:49.185+0000","up_votes":1,"down_votes":0,"body":"So bene che c'è un abisso di differenza tra ogni divisioni del diamante ed è proprio ciò di cui parlo nell'ultimo pezzetto. Possiamo in generale definire il diamante come \"high elo\", ma a sua volta ogni divisione è come se fosse un altro mondo.","replies":[]}]}]},{"poster":"Manup IV","date":"2017-03-03T12:35:48.672+0000","up_votes":2,"down_votes":0,"body":"Se prendi 2-3 kill nella tua lane sfrutta il vantaggio per gankare altre lane vicine (se giochi top aiuta solo il mid ammeno che la bot non sia un caso disperato).\nSe uccidi il tuo laner, e aiuti il mid dopo il gank se va a buon fine aiutalo a pushare e tirare giu la torre.\nSe prendendo vantaggio ti camperano la lane hai due opzioni, richiami tutto il team in tuo aiuto in modo da essere 5v2-3... e non 1v tanti oppure sfrutta questa cosa per far pushare i tuoi compagni (dipende dalle situazioni ovviamente)\nSe sei in Ranked solo con un amico, aiutatevi a vicenda tantissimo, da solo difficilmente carri 4 persone che non sono capaci in 2 è gia più fattibile.\nSaluti spero di aver dato qualche spunto senza andare OT.","replies":[]},{"poster":"CristalFenix","date":"2017-03-03T19:35:02.570+0000","up_votes":1,"down_votes":0,"body":"grazie a tutti per le risposte! molto utili! qualcosa so già, come lo \"shove\", l'importanza degli objectives eccetra.\nse non vado troppo op, cosa reputate più utile? un drake rispetto a una torre, un counterjungle più deep in 4-5 o un gank con torre, eccetra.\ntipo so che il bonus prima torre batte il drago ma seè infernal ed è safe meglio il drago. per esempio.\nora sto notando come in realtà in soloQ (e soprattuto in low elo, e ragazzi intendo LOW, non plat, non gold.) il coordinarsi è titanico. Cioè c'è molta gente che riesce a cogliere le occasioni e magari sfruttarle, ma non costruirle.\ncioè vedo magari una soloQ diamond o plat alto in cui il jungler o il top vede un ingaggio bot e ganka o tp e in quel modo è double più torre (sempre se il jungler avversario, che ha già visto e subodorato l'ingaggio, non counterganka). è affascinante questo decision making anche a lungo termine ma io pongo sempre che per il momento non posso fare affidamento nei follow corretti. provo a pingare e quando recepiscono è buono ma non sempre accade.","replies":[]},{"poster":"Sorcio84","date":"2017-03-03T15:54:22.290+0000","up_votes":1,"down_votes":0,"body":"un vantaggio di gold ed exp significa più item e più danni.\nin base alla posizione dei nemici, ai timer di morte, al movimento delle wave, si può decidere qual'è il momento giusto per prendere obiettivi.\n\nIl decision making si ottiene con l'esperienza, e si applica in modo diverso ad ogni game, anche se le strategia di base rimane abbastanza statica","replies":[]}]}