{"poster":"Cîroc","date":"2019-11-15T16:05:06.517+0000","title":"Pase de Worlds y las piezas no reclamadas","subforum":"Problemas Técnicos","up_votes":8,"down_votes":0,"body":"Buenos días ante todo,\r\n\r\nMi consulta es la siguiente: no compré el pase de worlds, pero tengo 1806 piezas que si lo hubiese comprado las tendría reclamadas. De comprar el pase ahora, adquiriría esas 1806 piezas? o eso es un baiteo para que compre?\r\n\r\nDesde ya les agradezco.\r\n\r\n\r\n\r\n{{sticker:katarina-love}}","replies":[{"poster":"FNC Juan Perón","date":"2019-11-15T16:54:06.112+0000","up_votes":3,"down_votes":0,"body":"Si, si te dan las piezas","replies":[]},{"poster":"Gregorio Samsa","date":"2019-11-15T20:41:35.373+0000","up_votes":1,"down_votes":0,"body":"Recuerden que el pase también incluye 400 piezas si no me equivoco, si lo quieres para na skin prestigiosa te da sobrado con los 1800 + 400.","replies":[]},{"poster":"Carmat","date":"2019-11-15T17:49:17.765+0000","up_votes":1,"down_votes":0,"body":"Yo me hice en total comprando el pase a dos días de salir ,3020 piezas y era para tener mas si jugaba hardcore, lo ahorre en espera de algo interesante y como ni la skin prestigiosa de qiyana no me llama la atención  los gaste en orbes.\n\nde 1650 que me costo el pase y al convertir en orbes y meter la licuadora tuve una ganancia en skin de 5000 de rp aproximadamente.\n\nConclusión: si sale a cuenta comprar pases del mundial, ojo  solo pase del mundial , porque los demás pases de los eventos a lo largo del año a mi criterio no valen la pena.","replies":[{"poster":"Del0reaN","date":"2019-11-15T20:16:19.538+0000","up_votes":1,"down_votes":0,"body":"Que suerte la tuya. A mi, al poco tiempo de comprar el pase, me empezó a pasar lo de la caída de FPS y, gracias a eso, dejé de jugar activamente. No podía jugar ARAM, ni grieta, ni URF... nada. Así que el pase, para mi, fue una pérdida absoluta de dinero. =(","replies":[]}]},{"poster":"Hell Darking","date":"2019-11-15T20:12:51.418+0000","up_votes":1,"down_votes":0,"body":"Si, te dan esas piezas \npero tendrias que jugar como koreano para sacar las misiones del pase, porque son artas y piden como 600 puntos (5 por ganadas 2 por perdias) asi que imaginate sacar los fragmentos de prestigio","replies":[]},{"poster":"Silver Charïøt ","date":"2019-11-15T19:22:09.417+0000","up_votes":1,"down_votes":0,"body":"uhh sinceramente, no te conviene comprarlo, ya perdiste mucho tiempo","replies":[]},{"poster":"Kyousuke","date":"2019-11-15T17:16:23.237+0000","up_votes":1,"down_votes":0,"body":"te dan las piezas pero ya perdiste mucho tiempo de farmeo y todas las victorias diarias XD \nsi realmente queres la qiyana o riven entonces mándate, sino diría que, aunque este pase sea el mejor por TODO lo que da, es mejor esperar otro así en ese farmeas mas comodo","replies":[]}]}