{"poster":"Hnk Kenshiro","date":"2017-12-19T11:48:47.784+0000","title":"Las skins definitivas podrían venir con algunos gestos","subforum":"Charlas Generales","up_votes":6,"down_votes":2,"body":"Estaría bueno ¿No?\n\n\n-----------\n\nModeración del foro - Particularidades\n\nEn verdad nada en contra, solo opinión,\n\n\n\n\n\nPersonalmente, diría que han habido sanciones desmedidas, el día de ayer [este caso](https://imgur.com/a/YQcaA). \n\nEl usuario dio aviso de una pagina que buscaba robar cuentas, la pagina se publico el 2015, (seguramente este obsoleto), y el método era por ataque diccionario, así que era casi que puramente azar.\n\nComo se ve, se da un ban permenante ¿No es demasiado para alguien en su primer post? \n\nLo mejor habría sido decirle lo correcto, como dijo nova, aunque borrando el post de todas formas, ya que no podemos editar la parte de los links.\n\n\nTomemos el caso del tipo que posteaba imágenes para que los usuarios manden sus datos y le robe las cuentas, ejemplo:\n\n> [{quoted}](name=gona geims,realm=LAS,application-id=X54mVVp0,discussion-id=XuGYoEIk,comment-id=0000,timestamp=2017-09-22T01:36:47.801+0000)\n>\n> https://i.imgur.com/7twyxpd.png\n\n\nAquí ya la intención es hacer daño, y no lo hizo solo con una cuenta, fueron varias, unas 3 o 4 que al menos haya visto yo. Y esa cuenta le dieron suspensión de una semana (Se sancionaron todos los comentarios, unos 6 o 7, con sanciones de una semana que expiraban el mismo día. Lo se porque entre a esa cuenta) \n\nPersonalmente, habría bloqueado la cuenta para que haya que recuperarla mediante un ticket, en este caso si había que tomar una medida mayor porque el usuario quería hacer el mal.\n\n\nhttps://boards.las.leagueoflegends.com/es/c/charlas-generales/MaY5gYaR-cuenta-baneada-injustamente-y-el-soporte-de-riot-no-se-hace-cargo-pruebas\n\n\nEn el caso de aquí, el usuario posteo 10 cuentas robadas, lo que hicimos fue censurar lo que estaba mal y hablar del problema, que fue lo ideal.\n\n\n\n---\n\n\n\n\nPara el [caso de jinx](https://boards.las.leagueoflegends.com/es/c/charlas-generales/GzA7EAbw-ban-7-dias-jinx-encuesta)\n\n\n>¡gracias por hacernos saber que esta es tu cuenta secundaria!\n\n(Que fue borrado, desconozco porque)\n\n> ¿Tú crees? :P acá lo sabemos todo\n\n> En el caso de que llegase a ser la misma persona, ahí la historia sería totalmente diferente.\n\n\nPrimero me da a entender  que recién se enteró de que son la misma persona. Y personalmente solo por compartir la imagen yo no lo asumiría, doy el beneficio de la duda.\n\nEn el segundo se da a entender que se sabia desde antes, lo que hace rara la primera respuesta, si es el caso.\n\nY en la 3° se termina por dudar, haciendo las dos respuestas anteriores confusas. \n\n\nSi jinx es jinxie quedo la respuesta en el aire, y no seria justo que (a futuro) a uno se le sancione por preguntar el castigo del otro, por lo que hay que tener cuidado.\n\nEl ban por el post de hace 10 meses,\n\n\n\n\n\n\n\n\nTomarse un minuto para explicar las sanciones, con un ban automático se aprende mucho menos. ¿Realmente el ban fue por el spam acumulado, o por  el sobre tono del post?\n\nSi fue por el spam, nos habríamos ahorrado todo el jaleo, si se hubiera explicado en la sanción el verdadero motivo.  \n\nSi fue por el sobre tono, parece casi conspiratorio un ban de 7 días, solo por una palabra, en un post de hace 10 meses que nadie iba a ver ¿Un usuario lo denuncio? ¿Un mod se puso a investigar que más podía usar para sancionarlo? \n\n\n> [{quoted}](name=Roseo Shooto,realm=LAS,application-id=v7qsfXsE,discussion-id=GzA7EAbw,comment-id=0001000000000001,timestamp=2017-12-29T21:33:04.085+0000)\n>\n> Más allá de eso, es por la cantidad de sanciones que ya lleva acumuladas el usuario Jinx.\n\n\nNo digo que la sanción este mal puesta, entiendo que sea de 7 días por comportamiento reiterado, pero de nuevo, es de hace 10 meses, cual fue la verdadera razón del ban\n\n\n> [{quoted}](name=Roseo Shooto,realm=LAS,application-id=v7qsfXsE,discussion-id=GzA7EAbw,comment-id=0006,timestamp=2017-12-29T20:03:45.196+0000)\n>\n> \n> Rompiste una regla. Sea hace 1 mes, 10 meses o incluso 2 años; se debe moderar. Para eso estamos en el foro, ¿no?\n\n[](http://.)\n\n> [{quoted}](name=Roseo Shooto,realm=LAS,application-id=v7qsfXsE,discussion-id=6iKA6mN3,comment-id=0008000100020000,timestamp=2017-09-06T01:30:25.105+0000)\n>\n> Primero:\n> \n> Dejas un post de hace 9 meses atrás.\n> \n> Recuerda que las reglas del foro cambiaron y esos post ya no tienen relevancia. si eso pasara ahora, te aseguro que no estaría más de 30 minutos arriba.\n \n\n\n\n\nPrimero decir que los post antiguos ya expiraron, ahora decir que igual se sancionan, se siente opresivo. \n\n\n---\n\n> [{quoted}](name=Avant Garde,realm=LAS,application-id=E47gYOsn,discussion-id=RbRYp1Jq,comment-id=,timestamp=2017-12-28T01:07:06.423+0000)\n>\n> El cocina le pone no. O sea somos 3 vs 5 y el infeliz del cocina le da no.\n\n[](http://.)\n\n\n> [{quoted}](name=Roseo Shooto,realm=LAS,application-id=E47gYOsn,discussion-id=RbRYp1Jq,comment-id=0001,timestamp=2017-12-28T01:41:16.305+0000)\n>\n> Te recomiendo tapar los nombres.\n\nEste post, ademas de estar en memes y juegos, si bien no es una denuncia directa, se ve el nick de la lux y le esta llamando infeliz, siendo tan quisquilloso con los primeros dos, es extraño que este no haya sido borrado.\n\n\n\n\n\n\nAsumir cosas solo con respaldo\n\nDar más transparencia en casos complicados\n\nCensurar contenido, pero baneando considerando la intención. ","replies":[{"poster":"rokushoger","date":"2017-12-19T12:07:25.246+0000","up_votes":1,"down_votes":0,"body":"https://www.youtube.com/watch?v=4RYLSqkMJIA","replies":[]},{"poster":"Salvor","date":"2017-12-19T11:57:58.848+0000","up_votes":1,"down_votes":0,"body":"Las de 1820 también.","replies":[{"poster":"Hnk Kenshiro","date":"2017-12-19T12:01:26.959+0000","up_votes":1,"down_votes":0,"body":"Quizás solo uno :s\n\nAunque los iconos de las skins se venden por separado, seguramente vendan gestos y hagan paquetes de skin + gesto + ward + icono cuando salgan.","replies":[]},{"poster":"Katastrofica","date":"2017-12-19T12:00:43.345+0000","up_votes":1,"down_votes":0,"body":"Me imagino el gesto de Twisted Fate Magnifico, una carta mal dibujada, JAJAJAJAJAJA","replies":[]}]},{"poster":"Katastrofica","date":"2017-12-19T11:55:10.737+0000","up_votes":1,"down_votes":0,"body":"Gestos > Iconos\n\nDefinitivamente, sería una buena idea, además de que todos verían que tienes a cierta skin definitiva, no como el icono, visto por... casi nadie :l","replies":[]}]}