{"poster":"Hnk Kenshiro","date":"2016-08-05T00:44:10.947+0000","title":"¿Se deberían avisar las actualizaciones de voz?","subforum":"Charlas Generales","up_votes":19,"down_votes":0,"body":"Hola, seg&uacute;n he le&iacute;do los parches, nunca avisan cambios en las frases de campeones,\nEj:\n\n{{champion:5}} : _Denme un objeto inm&oacute;vil, **y les contestare su gran pregunta**_\n{{champion:69}} : _Si no controlas a los **d&eacute;biles**, eres uno de ellos_\n\nY tanta otras frases nuevas como las de {{champion:266}}.\n\nSi tuvieran un peque&ntilde;o espacio, como la actualizaci&oacute;n de los splash, seria genial.\n\n----------\nPosdata: se dice \"¿Se deberían avisar...\" o  \"¿Se deberían **de** avisar...\"\n\nLa verdad creo que el \"de\" esta sobrando, pero es lo que me nace.","replies":[{"poster":"rokushoger","date":"2016-08-05T16:56:23.186+0000","up_votes":3,"down_votes":0,"body":"Te comento por la parte ortográfica: \n\nAmbas opciones son correctas.\nEn un español más anticuado (y la forma \"original\") se dice \"se debería de avisar\", haciendo el pronombre \"de\" de puente entre la frase antes dicha y lo que se da sobre aviso. Ejemplo \"se debería de avisar los cambios propuestos\". En cambio está mal usarlo repitiendo la preposición pues se caería en una redundancia (ejemplo \"se deberia de avisar de los cambios\"), debido a que el \"de\" que va entre \"debería\" y \"avisar\" es el que une la frase, siendo lo correcto decir \"se debería de avisar los cambios\".\n\nPor otro lado, dado que por contexto resultaba obvio que luego de la frase \"se debería avisar\" lo siguiente era el sujeto, entonces el español mismo se modernizó y se omite la preposición, quedando como \"se debería avisar los cambios\".\n\nAlgunas personas utilizan la falta de la preposición \"de\" para darle un tono más imperativo a la oración, pero esto es propio de cada región, no una constante del lenguaje.\n\nResumen taringuero lvl 5: Está bien de las dos formas.\n\nPor lo del post en sí, me da igual XD.","replies":[{"poster":"Hnk Kenshiro","date":"2016-08-05T17:40:39.669+0000","up_votes":1,"down_votes":0,"body":"Ah, eso aclara mis dudas, es que suelen nacerme frases que creo incorrectas, ej:\n\n_¿Podriasme pasar eso?_ en vez de_ ¿Me podrias pasar eso?_ o _¿Podrías pasarme eso?_\n\n\nY bueno, no he visto que alguien más use asi el \"me\", y siento dudas sobre si esta correcto.","replies":[{"poster":"rokushoger","date":"2016-08-05T20:47:33.240+0000","up_votes":1,"down_votes":0,"body":"En ese caso no es correcto, porque eso es un pronombre, es decir, una palabra que va adelante de un sustantivo.","replies":[]}]}]},{"poster":"Rolando Magic","date":"2016-08-05T00:49:15.556+0000","up_votes":3,"down_votes":0,"body":"Ni enterado estaba de esos cambios :v","replies":[{"poster":"Hnk Kenshiro","date":"2016-08-05T00:55:22.198+0000","up_votes":1,"down_votes":0,"body":"Cass decía \"peones\", que me gustaba más, Shen también recibió cambios creo.\n\nY las nuevas frases de Aatrox aun las estoy descubriendo, no entiendo bien todo lo que dice.","replies":[{"poster":"HornedBull ","date":"2016-08-05T01:38:54.876+0000","up_votes":1,"down_votes":0,"body":"y cuando le cambiaron a atrox?","replies":[{"poster":"Hnk Kenshiro","date":"2016-08-05T01:49:08.559+0000","up_votes":2,"down_votes":0,"body":"Pues ni idea, estoy diciendo que no avisan :v","replies":[{"poster":"LGBT Valentina","date":"2016-08-05T05:37:36.387+0000","up_votes":1,"down_votes":0,"body":"Nope\n\nNo agregan nuevas frases, lo que hacen es volver a hacer las voces de los personajes para tratar de llegar a un lenguaje mas \"global\" dentro de LA\nPor que basicamente, si fueran de ARG todos los Champs insultarian, si fueran de Chile, seria otro idioma, Mexico wey wey wey wey wey wey,e tc. Buscan palabras \"globales dentro de LA\", salvo aveces cagadas importantes como Kled de recorcholis\n\n\nSolo las cambian y no agregan, hace bastante tiempo escuche que Xin en una de sus Quotes dice Polivalente, eso antes no estaba\n\n\nHacen esto para ser lo mas justos posibles habiendo tantas culturas y sobre todo ahorrar","replies":[{"poster":"Hnk Kenshiro","date":"2016-08-05T14:51:48.552+0000","up_votes":1,"down_votes":0,"body":"Si, son cambios de frases, por eso les digo \"Actualización\".\n\nPero a Aatrox no le cambiaron las que habían, le agregaron nuevas.","replies":[{"poster":"LGBT Valentina","date":"2016-08-06T00:29:47.091+0000","up_votes":1,"down_votes":0,"body":"NOPE...\nSe sabria de antemano por surrendet at 20 eso, ni la wiki de lol \"agrego\" nuevas quotes","replies":[{"poster":"Hnk Kenshiro","date":"2016-08-06T00:37:51.172+0000","up_votes":1,"down_votes":0,"body":"Puedes entrar en cualquier partida con Aatrox y ver que añadieron frases relacionada con su arte y pueblo al darse las condiciones.","replies":[]}]}]}]}]}]},{"poster":"Rolando Magic","date":"2016-08-05T00:58:13.196+0000","up_votes":1,"down_votes":0,"body":"Pero shen recibio con el rework nuevas lineas","replies":[{"poster":"Ionian Blade","date":"2016-08-05T11:35:59.864+0000","up_votes":1,"down_votes":0,"body":"No, el rework de Shen no fue cumpleto, no recibio cambios notorios en el dialogo ni animaciones en su regreso a base o sus Ctrl +1, 2, 3 y 4","replies":[]},{"poster":"Hnk Kenshiro","date":"2016-08-05T01:01:59.207+0000","up_votes":1,"down_votes":0,"body":"Vale, el tuvo rework, aun asi no dijeron que cambiaran un poco las frases.","replies":[{"poster":"Rolando Magic","date":"2016-08-05T01:04:29.581+0000","up_votes":1,"down_votes":0,"body":"Dijeron que no estaban satisfechos con los resultados del doblaje o de las lineas en general. Tendrian que agregar cosas en las notas del parche y no creo que lo hagan ya que son medios pajeros :v","replies":[]}]}]}]}]},{"poster":"Shualaishula","date":"2016-08-05T05:16:56.607+0000","up_votes":1,"down_votes":0,"body":"le sacaron las lineas a El Tigre Braum :(","replies":[{"poster":"Hnk Kenshiro","date":"2016-08-05T14:53:30.639+0000","up_votes":1,"down_votes":0,"body":"Se que tenia nuevas frases, aunque no las llegue a ver.\n\n¿Seguro que riot las saco y no fue un bug que no an arreglado?\n\nLas skins legendarias estuvieron como 2 o 3 parches con el audio del campeon normal (aveces con ambos audios juntos)","replies":[{"poster":"Shualaishula","date":"2016-08-06T03:06:36.648+0000","up_votes":1,"down_votes":0,"body":"Le habían agregado unas lineas mas a la skin como: \"Mi madre siempre decía -Sé como el Santo.\" ó \"Las cabras son valientes, se comen todo, ¡¡SUBEN A LA TERCERA CUERDA Y TE CAEN CON UN TOPE SUICIDA!!\". Ocupo bastante al bigote y hace 4 o 5 parches que no escucho nada de eso :(","replies":[{"poster":"Hnk Kenshiro","date":"2016-08-06T03:11:28.422+0000","up_votes":2,"down_votes":0,"body":"¿Preguntaste en el soporte?","replies":[]}]}]}]},{"poster":"Ozarcus","date":"2016-08-05T03:33:58.564+0000","up_votes":2,"down_votes":0,"body":"Cambiarion varias, las de {{champion:17}}  por ejemplo. Antes decía _\"Eso tiene que picar\"_, luego pasó a _\"Eso debe arder\"_ y por último _\"Eso tiene que arder\"_ jaja","replies":[{"poster":"Hnk Kenshiro","date":"2016-08-05T03:35:17.865+0000","up_votes":2,"down_votes":0,"body":"No tengo comprado a teemo :P pero gracias por añadir otro caso.","replies":[]}]},{"poster":"Bienzahar","date":"2016-08-05T18:48:51.172+0000","up_votes":1,"down_votes":0,"body":"Recorcholis Kenshiro, ni me habia fijado de esos cambios tan obvios.","replies":[]},{"poster":"TecheX","date":"2016-08-05T13:07:06.632+0000","up_votes":1,"down_votes":0,"body":"perdona amigo... pero creo que vos no lees las notas de los parches....lo dice alli cada vez que le hacen o le ponen o mejoras en algun aspecto a cualquier campeon.:\n*la voz de teemo lo cambiaron cuando sacaron su skin legendario. junto con un leve rework de pasiva y mejora visual de los hongos\n*la voz de xin zhao lo cambiaron cuando le hicieron rework completo a shen...y  ya que estaba como xin y shen comparten en mismo doblador de voz, le actualizaron algunas lineas y mejoraron las que ya estan.\n*la de cassio es la mas nueva por su rework de mago hace muy poco.\n*y aatrox creo que no la tienen todavia... o por lo menos no la vi en el parche y cuando lo uso dice lo mismo que cuando jugue por primera vez lol alla por el 2014.","replies":[{"poster":"Hnk Kenshiro","date":"2016-08-05T14:38:06.053+0000","up_votes":1,"down_votes":0,"body":"Oh, ¿me darías un parche para comprobarlo?","replies":[]}]}]}