{"poster":"Hnk Kenshiro","date":"2018-08-28T20:31:01.350+0000","title":"El razonamiento del balance fue estúpido","subforum":"Jugabilidad, balance y narrativa","up_votes":33,"down_votes":3,"body":"> Si bien Meditación es una herramienta defensiva muy útil, muchos jugadores la desaprovechan al usarla solo para curaciones.\n\n\n\n¿Mejorar a Yi solo porque la gente le usa mal?\n\n¿Que acaso uno no debiera enfocarse en aprender a usar su campeon?\n\nEs como si dijeran \"Si bien Disparo místico de Ezreal es una herramienta muy util de pockeo, muchos jugadores la desaprovechan solo para farmear, así que ahora cuesta 5 de mana en todos los niveles\"\n\n(Es una exageración, pero entiéndase la lógica)\n\n\nPor que buffar a un campeón respaldandode en que la gente no lo usa bien, es absurdo.\n\n\n[](http://.)\n[](http://.)\n[](http://.)\nPor contra parte:\n\n\n\n\n> Mientras que los jugadores que entienden el comportamiento de los seres de niebla logran evitar muchísimo daño, los que los subestiman terminan por cavar su propia tumba. Dicho esto, moderamos un poco el daño de los seres de niebla \n\n\n**Así es como se juega el campeón.**\n\n\nObviamente si ignoras una de la fuente de daño vas a perder, mientras que si le juegas bien en contra vas a ganar.\n\n\n¿Si la gente ignora la Q de rumble le bajaran el daño?\n\n¿Si la gente ignora los barriles de GP le bajaran el daño también?\n\n\nOsea, es culpa del rival, si el no hace ni esfuerzo por esquivarme por que yo soy el nerfeado.\n\n\n\n[](http://.)\n[](http://.)\n[](http://.)\n\n\n> Los carrileros superiores no dejan de elegir a Yorick debido a lo peligrosos que son sus seres de niebla.\n\nAdemas de parecer click bait de anuncio de internet al estilo de (Las grandes empresas no quieren que sepas esto), vamos a cualquier pagina de estadisticas y vemos a yorick como 31° en pick rate  en [opgg](http://las.op.gg/champion/statistics) y 32° en [league of graphs](https://www.leagueofgraphs.com/es/champions/stats/top/platinum) .\n\nDe donde sale que yorick esta siendo spameado, de donde.\n\n---------------\n\nIndependiente de si los cambios eran correctos o no, la lógica fue atroz. ","replies":[{"poster":"Dog Bulling","date":"2018-08-28T23:00:07.707+0000","up_votes":1,"down_votes":10,"body":"El problema aquí no es el pickrate, sino el winrate.\n\nYi a pesar de su pickrate y banrate elevado, tiene un desempeño mediocre  en elos bajos (49% de winrate) y malo tirando para horrendo en elos altos. Necesitaba una mejora, pero claramente no a su daño debido a que ya tiene mucho, así que lo único que quedaba era mejorar su W, una mejora que recompensa mejor al main Yi que al Yi promedio.\nAparte debes admitir 2 cosas: \n1°, que 35 segundos de enfriamiento es demasiado para una mera curación;\n2°, que para la comunidad no hay excusa que valga en cuanto a buffar a Yi, incluso si su winrate fuese del 40%.\n\nEn cuanto a Yorick, como he dicho en una guía previamente, Yorick es un campeón poco usado, pero no por ello debil; es mas, por varios parches ha tenido un winrate que rondaba el 55% en bronce y plata, debido a lo abusivo que llega a ser allí entre su E, el desgaste de sus esbirros, su sustento y capacidad de tumbar torres.\n\nPor el amor a los aspectos, esto junto a lo de Garen es justo lo que han estado pidiendo por meses, un balanceo más enfocado al soloQ, y ni eso son capaces de valorar.","replies":[{"poster":"Hnk Kenshiro","date":"2018-08-28T23:03:11.133+0000","up_votes":7,"down_votes":0,"body":"Repito, no me quejo del balance, me quejo se como se fundamentaron :p","replies":[{"poster":"Dog Bulling","date":"2018-08-28T23:41:27.212+0000","up_votes":2,"down_votes":0,"body":"Lo admito, el que escribió las notas del parche claramente no se esforzó en transmitir un mensaje para un parche bastante lógico. Debieron poner en vez de lo que pusieron, algo así:\n\n{{champion:11}} : \"Desde hace algunos parches Yi tiene un desempeño mediocre en elos bajos, que no hace más que empeorar a medida que se sube de división. Dado que ya tiene suficiente daño, la mejora se enfocará en la meditación. Reducir el enfriamiento debería permitir al maestro Wuju contar con su meditación en más batallas, mientras que la mejora a la reducción de daño recompensará mejor a los jugadores que sepan aprovechar al máximo este campeón. **~~Por favor eviten hacer un forobardo por esta mejora~~**\"\n\n{{champion:83}} : \"Yorick es un campeón poco usado, pero los pocos que lo usan abusan demasiado de el, sobretodo en divisiones bajas. Eso es en buena parte debido al enorme daño que hacen sus seres de la niebla en niveles bajos, que le permite obtener ventaja y volverse así un campeón totalmente dominante en el 1v1. Reducir el daño a los súbditos que invoca al inicio debería hacer que los intercambios en general contra yorick sean más justos, así como que castigará menos al jugador menos habilidoso por cometer descuidos ocasionales\"","replies":[]}]},{"poster":"Celebi","date":"2018-08-29T21:54:14.800+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Dog Bulling,realm=LAS,application-id=xQmJPO8F,discussion-id=pBswG6wH,comment-id=0006,timestamp=2018-08-28T23:00:07.707+0000)\n>\n> El problema aquí no es el pickrate, sino el winrate.\n> \n> Yi a pesar de su pickrate y banrate elevado, tiene un desempeño mediocre  en elos bajos (49% de winrate) y malo tirando para horrendo en elos altos. Necesitaba una mejora, pero claramente no a su daño debido a que ya tiene mucho, así que lo único que quedaba era mejorar su W, una mejora que recompensa mejor al main Yi que al Yi promedio.\n> Aparte debes admitir 2 cosas: \n> 1°, que 35 segundos de enfriamiento es demasiado para una mera curación;\n> 2°, que para la comunidad no hay excusa que valga en cuanto a buffar a Yi, incluso si su winrate fuese del 40%.\n> \n> En cuanto a Yorick, como he dicho en una guía previamente, Yorick es un campeón poco usado, pero no por ello debil; es mas, por varios parches ha tenido un winrate que rondaba el 55% en bronce y plata, debido a lo abusivo que llega a ser allí entre su E, el desgaste de sus esbirros, su sustento y capacidad de tumbar torres.\n> \n> Por el amor a los aspectos, esto junto a lo de Garen es justo lo que han estado pidiendo por meses, un balanceo más enfocado al soloQ, y ni eso son capaces de valorar.\n\n\n\n\nBajo este argumento, si Garen pegara 90% true damage al hp maximo de una Q pero aun asi perdiera mas partidas de las que gana habria que buffearlo?\n\n\n\n\nla W de Yi no es solo una curacion, si solo fuera eso 35 segundos seria mucho, pero es una inmunidad total, la reduccion de daño es gigante y tienes que tener en mente que es un asesino, un campeon que entra a la batalla asesina al campeon de daño principal del equipo enemigo y retirarse, no se supone que un asesino elimine a todo el equipo enemigo por si solo incluido tanques Y ENCIMA resistir a ataques que podrian practicamente destruir a cualquier tanque principal.","replies":[]}]},{"poster":"Marx we need you","date":"2018-08-28T21:56:58.059+0000","up_votes":3,"down_votes":0,"body":"Básicamente es Riot haciendo lo que siempre ha hecho: dirigir el estilo de juego de los campeones, es decir, que si no juegas como ellos quieren que juegues, te vas al pozo.","replies":[{"poster":"TABULIN","date":"2018-08-29T00:36:15.192+0000","up_votes":2,"down_votes":0,"body":"Exactamente mis pensamientos. En inglés se llama Micromanagement, en español sería algo así como Microgestiones. Es una actividad que trata \"problemas\" a corto plazo.","replies":[]}]},{"poster":"WhiteMax","date":"2018-08-28T23:05:22.915+0000","up_votes":2,"down_votes":4,"body":"Hicieron lo mismo con {{champion:142}} {{sticker:zombie-brand-clap}}","replies":[{"poster":"Yitán","date":"2018-08-28T23:12:01.294+0000","up_votes":3,"down_votes":1,"body":"mmmm no, no es lo mismo, no es que los rivales \"no sepan\" esquivar la burbuja, sino mas bien que creaba un área de control que les parecía injusta a los desarrolladores","replies":[{"poster":"L9 Letalis Umbra","date":"2018-08-29T11:00:50.706+0000","up_votes":2,"down_votes":0,"body":"A eso sumarle que te mataba sin siquiera atinar una skillshot, 100% fair","replies":[]},{"poster":"ShinyBread","date":"2018-08-29T02:42:59.318+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=Yitán,realm=LAS,application-id=xQmJPO8F,discussion-id=pBswG6wH,comment-id=00070000,timestamp=2018-08-28T23:12:01.294+0000)\n>\n> mmmm no, no es lo mismo, no es que los rivales &quot;no sepan&quot; esquivar la burbuja, sino mas bien que creaba un área de control que les parecía injusta a los desarrolladores\n\nLol XD la gente ya no sabe que es lo mas injusto su kit. Yo prefiero aguantarme cualquier tipo de nerf de escalado a tener que perder un  efecto entero que es parte de la esencia del campeon.","replies":[]},{"poster":"WhiteMax","date":"2018-08-29T00:46:47.325+0000","up_votes":1,"down_votes":3,"body":"https://pbs.twimg.com/media/CTful00VAAAswiA.png","replies":[]}]}]},{"poster":"DragonKI2","date":"2018-08-28T21:48:04.336+0000","up_votes":3,"down_votes":1,"body":"Men yorick y garen en opgg , salian como top 1 o 2 de la ..toplane xD! , te lo digo yo que juego yorick , y un dia dije a vcer su winrate y estaba en elos bajos (bronze a platino) 1 o 2 compitiendo contra garen.\n Por lo del nerfeo, tocaron a los seres de la niebla .. bajandole el earrly (muyy bestia) ahora si va a doler errar la E... no me gusta que se lleve nerf fuertes yorick :c ,pero bueh... que se le va a hacer..","replies":[{"poster":"Hnk Kenshiro","date":"2018-08-28T21:56:37.972+0000","up_votes":2,"down_votes":0,"body":"No me quejo del nerf en si, me quejo que la razón que dan es que la pasiva pega porque el rival la ignora.\n\nAsí cualquier cosa está rota :p","replies":[{"poster":"DragonKI2","date":"2018-08-28T22:11:40.430+0000","up_votes":1,"down_votes":0,"body":"Elos bajos {{sticker:slayer-jinx-unamused}}  , sabiendo que una irelia se come a los 4 bichitos con la q (que encima se le resetea ya cura)","replies":[]}]}]},{"poster":"Salvor","date":"2018-08-28T20:39:31.398+0000","up_votes":4,"down_votes":2,"body":"> Independiente de si los cambios eran correctos o no, la lógica fue atroz.\n\n{{champion:266}}  _-No tan atroz como mi rework Kenshi_","replies":[{"poster":"Killer Bean","date":"2018-08-28T22:20:12.387+0000","up_votes":1,"down_votes":0,"body":"chistako badum tsss","replies":[]}]},{"poster":"TerrSinManos","date":"2018-08-29T19:20:29.983+0000","up_votes":1,"down_votes":0,"body":"Lo que me parece curioso es que, según vi, fueron 2 buff a la w de Yi, en el primero le reducían el enfriamiento y en el segundo le aumentaban la reducción de daño en los primeros niveles. Siguiendo la lógica explicada, el segundo buff me parece perfecto y coherente con lo que quieren hacer, pero ¿Por qué la reducción de enfriamiento? ¿Pensaron \"ya que tiran mal la w, vamos a hacer que puedan tirarla mal sin pagar tan caro\"? No creo ¿No? Rito nunca se pegaría un tiro en el pie de forma tan estúpida ¿No?","replies":[]},{"poster":"Cero404","date":"2018-08-29T16:07:50.703+0000","up_votes":1,"down_votes":0,"body":"Como funciona Riot Actualmente es facil. Tu campeon se juega poco? al pozo. Se juega mucho? es muy OP? tiene mucho Win rate? lo bufeamos para que lo sigas jugando, ignorando por  completo lo conocido como \"counter play\" Mientras mas OP, mas mains, mientras mas mains, mas gente comprando sus skins. Al dia de hoy LoL no balancea el jueo, solo deja contento a los que todava siguen jugando, y con este parche, lo demostraron, bufear a campeones muy fuertes, bufear a la LETALIDAD, y nerfear a un item de los ADC. No se, sinceramente, me da asco.","replies":[]},{"poster":"Bienzahar","date":"2018-08-29T14:31:11.129+0000","up_votes":1,"down_votes":0,"body":"Sospechaba que era un error de traducción y si, lo es. Vi el parche en la pagina de NA y tiene mucho más sentido que la versión de LAS xD\nPor ejemplo dice que la w de yi no es \"apreciada\" como una herramienta de defensa y que Yorick es uno de los picks, considerados por los top laners, más fuerte xD","replies":[]},{"poster":"sentey26","date":"2018-08-29T12:24:50.465+0000","up_votes":1,"down_votes":0,"body":"No me gusta que justo a yi tengan que mejorar, pero el razonamiento me parece bien no porque no lo sepan usar, si no porque a los primeros niveles nadie usa la W para evitar ataques si no para curarse nomas, con esto da mas juego a usarlo en combate ya que la W es lo ulitmo que te subis y tener esa reducción del 70% tiene mas sentido que solo curarse y evitar poco ataque","replies":[]},{"poster":"Visoka","date":"2018-08-29T09:17:22.417+0000","up_votes":1,"down_votes":0,"body":"Leyendo la corrección de errores aún no arreglan que pyke con su r pueda deletear a fiora aunque use su w .-.","replies":[]},{"poster":"Ode to dark","date":"2018-08-29T03:01:01.644+0000","up_votes":1,"down_votes":0,"body":"Hahahah y el de {{champion:86}}  \"Garen se juega mucho así que lo vamos a nerfear\"\n\nAntes daban explicaciones lógicas y daba gusto leer las notas del parche, pero ahora sin cada vez más estúpidos riot.\nSigan así rito, por eso luego tencent no les da apoyo porque son cada vez más basura y están echando a perder su juego.","replies":[]},{"poster":"TABULIN","date":"2018-08-29T00:41:22.714+0000","up_votes":1,"down_votes":0,"body":"De acuerdo con tu post.\nY agrego también que Riot parece ignorar su propio sistema de Maestría de Campeones!!!!!11!!111!! Los Main Yi van a matarte y van a subir por encima de Diamante porque saben exactamente como usar a su campeón! (Véase a Cowsep, por ejemplo)\nYi no necesitaba bufos ni nerfs, está bien y tiene muchos counters. Riot no tiene por qué \"ayudar\" a la inoperancia de sus jugadores.","replies":[]},{"poster":"Kokoro Chacarero","date":"2018-08-28T22:18:39.763+0000","up_votes":1,"down_votes":0,"body":">De donde sale que yorick esta siendo spameado, de donde.\n\nY en Korea esta 107\nW T F ???","replies":[]},{"poster":"Turing Test","date":"2018-08-28T21:53:00.142+0000","up_votes":1,"down_votes":0,"body":"Cuando un campeón popular anda mal, _spread the virus _","replies":[]},{"poster":"Only Clässic VG","date":"2018-08-29T16:20:08.442+0000","up_votes":1,"down_votes":1,"body":"Por fin el nerf a Garen, estaba super roto! espero que con estos buff a Yi, Irelia y Kayn podamos hacerle frente al hipercarry de Demacia!","replies":[]},{"poster":"Yitán","date":"2018-08-28T23:10:50.422+0000","up_votes":1,"down_votes":1,"body":"si bien tenés mucha razón en lo que decís, yo creo que quieren darle otro enfoque y es entendible el cambio, miralo desde el punto de vista de que quien escribe esas cosas no tiene ni idea de por qué se hacen los cambios (porque la mayoria de veces pareciera que no la tiene)","replies":[]},{"poster":"DIOS TUTI","date":"2018-08-29T01:19:23.279+0000","up_votes":1,"down_votes":2,"body":"mierdalance* desde la 8.10 que no hacen nada mas que cagarla.","replies":[]},{"poster":"Falkon","date":"2018-08-28T20:37:49.836+0000","up_votes":3,"down_votes":23,"body":"El balance esta mas que bien.\n\nLo que intentan hacer con Yi, es hacer que puedan usar las curaciones EN combate, no DESPUES del combate.\n\nLo que pasa con Seres de niebla no se que campeon es, por lo que no puedo hablar de el.\n\nLo de Yorick esta mas que bien, es una verguenza decir que es spameado, pero yo por lo general con cada yorick que jugue despues del rework, perdi un 80% excepto en late mientras era Kayle.\n\nEsta mas que bien el nerfeo y los buffeos, asi que NO SE QUEJE ACA, QUE NO ES UN FORO PARA QUEJARSE. punto loco ya me cansan estos post que hacen quejandose de sus mains nerfeados y demas.","replies":[{"poster":"TeQuiLa66","date":"2018-08-28T21:39:10.931+0000","up_votes":3,"down_votes":0,"body":"Bueno, los seres de la niebla son los creeps de la pasiva de yorick jaja.","replies":[{"poster":"Falkon","date":"2018-08-28T21:45:48.309+0000","up_votes":4,"down_votes":7,"body":"Ahhh.... los pibes te pegan mucho a lvls bajos xd","replies":[]}]}]}]}