{"poster":"Hnk Kenshiro","date":"2019-03-05T13:55:56.160+0000","title":"No puedo creer que haya habido hate hacia Achungo cuando siempre fue de los soportes más presentes con la comunidad","subforum":"Off-topic y temas personales","up_votes":19,"down_votes":14,"body":"Por que es imposible que los problemas sean todos causa de alguien dependiente, no entiendo como se llego a esa conclusión.\n[](http://.)\nPersonalmente cada punto que se dio tenia su justificación, se explico que el post de denuncia fue porque los comentarios del post se desviaron, en esos casos siempre cierran o bloquean el hilo (Que dejar una advertencia en post hubiera sido mejor, si, pero no podemos medir la carga de trabajo que da), se dijo que el post del sorteo fue porque pedía X cantidad de comentarios, lo que podía generar spam, así como los sorteos que piden seguir paginas. \n[](http://.)\nSobre la sanción es raro que 4 reportes en 20 partidas gatillen un castigo, ojala el sistema así de sensible cuando corresponda, pero la idea no respetada fue \"No intentes decir la ultima palabra, solo explica tu postura y sal de la conversación\" cosa que no fue respetada en la partida, ademas de no aceptar la postura dada en soporte y efectivamente darle un mal uso al soporte.\n[](http://.)\nAsí como el que ya no se acepten reportes en soporte fue por que X youtuber promovió reportar por ese canal y de paso de los casos los casos graves a que el grueso de personas haga un reporte por cada mala partida que tuvo. Hay un presupuesto en latam, y obviamente no se van a contratar mil personas para revisar partidas, es algo netamente administrativo, que quizás pudo manejarse mejor. \n[](http://.)\nCuando se fueron los moderadores/rioters nuestra única participación de arriba (Ademas del siempre presente maggical) fue por parte del soporte, siendo un 78% de las respuestas de parte suya en cierto punto, antes de que se nos sumaran más nombres como leonkaiser, professor farn o witchagmar.","replies":[{"poster":"AMD Radeon RDNA","date":"2019-03-05T15:22:40.358+0000","up_votes":4,"down_votes":1,"body":"Mira, yo no quiero entrar en debate, ni decir quien esta bien o quien mal. Solo mira esto\n\nhttps://i.imgur.com/EmoE16k.jpg?noredirect\n\nComo respondio el soporte?\nhttps://i.imgur.com/amN09Li.jpg?noredirect\n\nJAJAJAJAJAJA un hermoso y delicioso **COPYPASTE!!! **\n\nHe elaborado el ticket tomandome el tiempo de convertir las fotos a jpg porque png es pesado, escribir el texto, no merezco siquiera 5min como jugador? No se respeta nada aca?\n\n\nDa muchisima rabia que te falten el respeto de esa manera. Yo entiendo todo el mame (por decir asi) pero es como que por ejemplo, cuando tienes un problema con tu ISP y llamas atencion al cliente, no te va a molestar que te este respondiendo una grabacion y todas las opciones que tu elijes, ninguna tiene que ver con tu problema? \n---\n\nCon tu publicacion, gracias a \"witchagmar\" me comi una sancion de 25 partidas de banchat, todo porque? Por reportar con pruebas, verdaderas pruebas de gente ultra mega toxicas que se burlaban de enfermades. Osea, que loco eh.. el sancionado fui yo y esos siguieron jugando como si nada(oh si, me tomo el trabajo de seguirlos por dias si siguen jugando)","replies":[{"poster":"Hnk Kenshiro","date":"2019-03-05T15:28:55.761+0000","up_votes":3,"down_votes":1,"body":"Se que recibir un copypaste es como un golpe en la cara de desmotivacion pero por cada reporte bien hecho deben haber decenas de reportes que no dan para ban o que el sistema actuó solo, como han dicho.\n\nOjala algun dia vuelvan a tener en consideración en eso, aunque no se si sea posible.","replies":[{"poster":"AMD Radeon RDNA","date":"2019-03-05T15:56:02.227+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Hnk Kenshiro,realm=LAS,application-id=J8qpiO2I,discussion-id=QyxBLHgA,comment-id=00020000,timestamp=2019-03-05T15:28:55.761+0000)\n>\n> Se que recibir un copypaste es como un golpe en la cara de desmotivacion pero por cada reporte bien hecho deben haber decenas de reportes que no dan para ban o que el sistema actuó solo, como han dicho.\n> \n> Ojala algun dia vuelvan a tener en consideración en eso, aunque no se si sea posible.\n\nun golpe en la cara? pff es poco, te estan tirando pañales abiertos para que te comas toda la suciedad jajajajajajaja","replies":[]}]},{"poster":"CNdeF21","date":"2019-03-05T18:19:57.176+0000","up_votes":1,"down_votes":0,"body":"Sabes que es lo que creo yo con respecto al bot? Entiendo, que molesta recibir un mensaje de un bot, da la impresión como que no se preocupan por el usuario, o sea, no cales ni 5 minutos y te metemos un bot.\nTambién puede ser que con el.bot soluciones la cosa, cumpliendo los links que te tira y eso. Ahora, me parece, que si no se soluciona por medio del bot, no está mal probar a ver si algún humano te da bola jaja","replies":[]}]},{"poster":"Fízz","date":"2019-03-05T14:01:39.475+0000","up_votes":5,"down_votes":2,"body":"y el hecho de que no fue su culpa que juntaran lan y las , haciendo que haya menos gente para ayudar","replies":[{"poster":"Excorpion","date":"2019-03-05T14:10:33.812+0000","up_votes":5,"down_votes":3,"body":"He explicado cosas como esas por todos lados. Pero nadie quiere entender.\nAcaba de salir un post donde le reclamar la derrota evitada a Achungo y el no tiene que ver con eso.","replies":[{"poster":"Fízz","date":"2019-03-05T14:12:27.342+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Excorpion,realm=LAS,application-id=J8qpiO2I,discussion-id=QyxBLHgA,comment-id=00000000,timestamp=2019-03-05T14:10:33.812+0000)\n>\n> He explicado cosas como esas por todos lados. Pero nadie quiere entender.\n> Acaba de salir un post donde le reclamar la derrota evitada a Achungo y el no tiene que ver con eso.\n\nhttps://i.ibb.co/NpNzLtX/nick-young-confused-face-300x256-nqlyaa.jpg[/img]\n","replies":[{"poster":"Excorpion","date":"2019-03-05T14:13:34.385+0000","up_votes":1,"down_votes":0,"body":"si mira, esta en recientes.","replies":[]}]}]},{"poster":"Hnk Kenshiro","date":"2019-03-05T14:15:00.202+0000","up_votes":1,"down_votes":0,"body":"Por supuesto, todos podemos opinar que juntar latam resulto para peor hasta el día de hoy, pero no nos podemos descargar en los que siguen trabajando si la decisión vino de aun arriba.","replies":[]}]},{"poster":"Shadowlites","date":"2019-03-05T15:36:47.111+0000","up_votes":2,"down_votes":1,"body":"Si vos tenes un encargado. Algo anda mal en la empresa, alguien tiene que se la cara visible de todo. Si achungo esta en el foro dando vueltas para el soporte y ve los post, y no comenta nada al respecto, que esperas? Flores? El es la cara visible al soporte del jugador, el tiene que darnos una respuesta por mas que no venga de el, el problema. Ejemplo, vos tenes un problema con tu compania de internet, que haces? Llamas al servicio al cliente. AUNQUE EL NO TENGA LA CULPA, vos tenes que desatar tu problema y el tiene que hablar con alguien para derivarlo y solucionarlo. Me explico? Entonces, todos sabemos que la culpa no es de achungo, pero si ve que el foro revienta por el lag que hay en partidas, el como cara visible del soporte deberia al menos dar una respuesta e informar a sus superiores sobre el tema POR MAS QUE EL NO SEA EL PROBLEMA. No va a venir una persona que mantiene el servidor para darnos una respuesta, para eso esta el. Se entiende?","replies":[{"poster":"AMD Radeon RDNA","date":"2019-03-05T16:00:42.172+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Shadowlites,realm=LAS,application-id=J8qpiO2I,discussion-id=QyxBLHgA,comment-id=0003,timestamp=2019-03-05T15:36:47.111+0000)\n>\n> Si vos tenes un encargado. Algo anda mal en la empresa, alguien tiene que se la cara visible de todo. Si achungo esta en el foro dando vueltas para el soporte y ve los post, y no comenta nada al respecto, que esperas? Flores? El es la cara visible al soporte del jugador, el tiene que darnos una respuesta por mas que no venga de el, el problema. Ejemplo, vos tenes un problema con tu compania de internet, que haces? Llamas al servicio al cliente. AUNQUE EL NO TENGA LA CULPA, vos tenes que desatar tu problema y el tiene que hablar con alguien para derivarlo y solucionarlo. Me explico? Entonces, todos sabemos que la culpa no es de achungo, pero si ve que el foro revienta por el lag que hay en partidas, el como cara visible del soporte deberia al menos dar una respuesta e informar a sus superiores sobre el tema POR MAS QUE EL NO SEA EL PROBLEMA. No va a venir una persona que mantiene el servidor para darnos una respuesta, para eso esta el. Se entiende?\n\nChe mira, no se quien es el pibe y por que le tiran tanto hate, pero tienes razon, pero no solo el tal Achungo... los demas moderadores y/o agentes de soporte y por que no tambien, los amarillos; solo 1 de ellos, con que se pasen por el foro por 10 min a cada hora, van a saber lo que ocurre mejor que nadie. \n\nCuando yo era moderador (y posteriormente GM) en un servidor MU \"famoso\", yo siempre reportaba las cosas pesadas como fallas del servidor. Apenas aparecia el cartel de messenger de conexion del dueño, le hablaba \"ey mira, pasa esto. Sera que te puedes fijar? Gracias!\" (mas largo y mejor obvio).","replies":[{"poster":"Shadowlites","date":"2019-03-05T16:57:52.535+0000","up_votes":2,"down_votes":0,"body":"Exacto, nadie menciona que es la culpa de X del foro. Pero es la cara visible a los problemas a solucionar de la comunidad. Entonces, si vos estas en el foro y no sos capaz de informar lo que sucede cuando hay errores en el juego. Para que existe la categoria \"Problemas tecnicos\", si al fin y al cabo es un titere que solo ve y contesta al azar. No me parece. Y no es por caerle a achungo, si no tambien a los otros moderadores y ayudantes del foro, si no van a estar al pendiente de lo que pasa, renuncien.","replies":[{"poster":"Gleowyn","date":"2019-03-05T17:28:22.513+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Shadowlites","date":"2019-03-05T17:48:49.428+0000","up_votes":1,"down_votes":0,"body":"Respeto tu comentario y entiendo los temas de horarios laborales. Pero creo que una empresa tan grande deberia tener no te digo que 10 personas, pero 1 que este al tanto en horarios asi, no creo que sea escandaloso. Una empresa como riot tiene que preveer estos problemas y tener alguien, que, en tales casos, este al tanto y monitoree estos errores. YO de todas formas mencione a achungo porque fue la persona que se nombro en el post. Hablo en general, ellos son la cara visible a nuestros problemas. La empresa sea de un juego f2p o no, si te ofrecen un servicio y vos lo consumis por mas que sea gratis tenes todos tus derechos a reclamar algo que esta andando mal. Porque al fin y al cabo a vos cuando alguien te trollea o toxiquea y te arruina la experiencia se sanciona, pero ellos que arruinan nuestra experiencia con servidores que no aguantan un rato tambien arruinan mi experiencia y no recibis ni siquiera una explicacion de lo que paso, entendes ? Entiendo lo que mencionas pero por mas que venga el problema de más arriba y eso se sobreentiende, ellos tristemente tienen que dar la cara por las inoperancias que pasan, porque? Porque estan para eso, son la cara visible del foro (usuario-riot). Y asi en todos lados, imaginate el banco, te sacan plata sin motivo y vos te enojas y te la vas a agarrar con el de atencion al cliente y el la verdad no tiene nada que ver. Y bueno, estan ahi porque se contrato para eso.","replies":[]}]}]}]}]},{"poster":"SpectreChazer","date":"2019-03-05T14:30:13.965+0000","up_votes":1,"down_votes":0,"body":"Yo ni lo conocía {{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"TheSilverCross","date":"2019-03-05T16:03:46.875+0000","up_votes":3,"down_votes":4,"body":"Yo no tuve contacto con el tipo ni nada nunca, mas que nada porque nunca usé mucho el soporte, pero por lo que ví, hay gente que le tiene bastante aprecio, y creo que eso no se lo tiene ganado solo porque sí.","replies":[]}]}