{"poster":"Hnk Kenshiro","date":"2018-01-06T16:43:55.822+0000","title":"¿Twisted Fate se juega con varas de las edades?","subforum":"Guias y consejos","up_votes":5,"down_votes":2,"body":"http://na.op.gg/champion/twistedfate/statistics/mid\n\nLo estoy viendo en OP GG pero, ¿Realmente es lo mejor?\n\nAunque realmente no siento un item que sea genial para partir con el, pero no esperaba la vara xd","replies":[{"poster":"Xan Irelia","date":"2018-01-06T16:53:12.493+0000","up_votes":5,"down_votes":1,"body":"Yo creo que si está mejor según estadísticas, entonces no hay lugar para cuestionarlo xd","replies":[{"poster":"ImNw","date":"2018-01-06T18:41:01.759+0000","up_votes":2,"down_votes":0,"body":"Existen 2 maneras de mentir:\nCon mentiras y con estadisticas.","replies":[{"poster":"Xan Irelia","date":"2018-01-07T13:45:49.192+0000","up_votes":1,"down_votes":0,"body":"son tomadas de miles de partidas, usan datos que rito da, no creo que de datos falsos","replies":[]}]},{"poster":"Hnk Kenshiro","date":"2018-01-06T18:06:36.366+0000","up_votes":1,"down_votes":0,"body":"Lo típico xd","replies":[]}]},{"poster":"FedecarboneroUY","date":"2018-01-06T17:12:23.417+0000","up_votes":2,"down_votes":0,"body":"Preguntale a Dopa no acá en el foro que no lo juega nadie :v\n\npd: si","replies":[]},{"poster":"Zinc","date":"2018-01-06T20:17:19.714+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Hnk Kenshiro,realm=LAS,application-id=8sKIclmi,discussion-id=E4JViG7J,comment-id=,timestamp=2018-01-06T16:43:55.822+0000)\n>\n> http://na.op.gg/champion/twistedfate/statistics/mid\n> \n> Lo estoy viendo en OP GG pero, ¿Realmente es lo mejor?\n> \n> Aunque realmente no siento un item que sea genial para partir con el, pero no esperaba la vara xd\n\nHe maineado a TF durante muuuuuuucho tiempo y te puedo decir que cuando se puso de moda la vara de las edades en TF fue una gran sorpresa (para mi al menos).\n\nSi te soy sincero, yo no la uso, prefiero algo mas clasico (liche, luden, etc). Sin embargo, la vara no es un item situacional como te dijeron, es 100% core y podes verlo en cualquier persona que use a TF en el high elo de corea. La razon? no tengo idea, algun main TF de mayor elo que yo podria aclarar la duda, y de pasa me la saca a mi tambien. \n\nSe que no fue de gran ayuda mi comentario, pero ta, saludos.","replies":[{"poster":"Hnk Kenshiro","date":"2018-01-06T20:25:05.151+0000","up_votes":1,"down_votes":0,"body":"Tengo dudas si partir por liche :s\n\nNo es tan caro, pero escala con ap, asi que suelo pillar otras cositas primero.\n\n¿Has probado un nachor?","replies":[{"poster":"Zinc","date":"2018-01-10T06:01:25.927+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Hnk Kenshiro,realm=LAS,application-id=8sKIclmi,discussion-id=E4JViG7J,comment-id=00070000,timestamp=2018-01-06T20:25:05.151+0000)\n>\n> Tengo dudas si partir por liche :s\n> \n> No es tan caro, pero escala con ap, asi que suelo pillar otras cositas primero.\n> \n> ¿Has probado un nachor?\n\nSi y no m gusta, no me atreveria a decir que no rinde pero no va cn mi estilo de juego. \n\nToma en cuenta que el potencial de TF radica en su one shoot que se va volviendo verdaderamente imponente con el correr de la partida (W+E+ liche+ Cargas luden, etc) y no tanto en su capacidad de generar DPS, que x cierto (desde mi punto de vista) te expone bastante mas que solo tirando la carta y la Q para reposicionarte y esperar los enfriamientos.\n\nMi build core en situaciones \"normales\" es Liche + Luden y las botas amarillas, full velocidad de movimiento, meter el combo y backear, esperar el enfriamiento y volver. Me funciona, pero me funciona a mi.\n\nSaludos.","replies":[]},{"poster":"Champi4UP","date":"2018-01-06T22:33:16.505+0000","up_votes":1,"down_votes":0,"body":"{{item:3115}} deja al campeón muy expuesto ya que queda pegando nada más que básicos. Para lo único que sirve es para acumular más rápido la pasiva de la E, para pushear y romper torres rápido ya que el daño de la pasiva se aplica en las torretas. Pero cuesta mucho oro esa inversión. \n\nQuizá como última opción junto con {{item:3124}} para hacer un Backdoor a lo xPeke.","replies":[]}]}]},{"poster":"Champi4UP","date":"2018-01-06T20:21:18.426+0000","up_votes":1,"down_votes":0,"body":"{{champion:4}} \n\n{{item:3027}} armarse Vara de las edades no es precisamente situacional, sino cuando sabés que cualquier campeón enemigo (o sea siempre) te podría matar fácilmente y TF no tiene ningún escape además de que tiene poco rango en básicos.\nTiene un comienzo más enfocado en el farmeo y en el sustain (ya que tiene esa nueva pasiva que le da Vida por el maná gastado). Además tiene más vida y más maná para spamear en late. Básicamente, para partidas que vayan a durar lo suficiente para que el tanque te mate por más lejos que estés.\nPersonalmente es muy útil, tanto como el GLP pero soy old school y me cuesta no armarme Liche al comienzo.\n\n{{item:3030}} la otra opción es el GLP, da un poquito menos de vida y maná, tiene la misma pasiva que recupera vida al gastar maná pero también tiene una activa que hace daño, convengamos que aporta mucho ese daño extra. Además de una ralentización a cualquiera que toque los proyectiles lanzados que también ayuda a alcanzar al enemigo o incluso rematarlo.\n\n{{item:3100}} armarse Liche como primer ítem es tener mucha confianza en el daño que vas a hacer cuando hagas roaming para así stompear con ese daño explosivo.\n\n{{item:3094}} hace unos meses me di cuenta que el Cañón junto al Liche tiene muchísima sinergía porque el stun que dura 2 segundos (la carta dorada) lo tirás desde la misma distancia que Caitlyn sus básicos y aporta mucha más seguridad para jugar con las cartas desde lejos pero no siempre funciona (costes de oros, build ap, si se alarga la partida perdés daño)\n\nTambién está la build de utilidad con 40% CDR que no tiene mucha diferencia en daño, pero tiene el stun y la Q cada 3.6 segundos.","replies":[]},{"poster":"Psyhard","date":"2018-01-06T19:56:10.182+0000","up_votes":1,"down_votes":0,"body":"Supongo que tiene que ver más con algo situacional. Yo cuando lo utilizo(pocas veces) me armo en base a lo que tenga enfrente y digamos que no me va tan mal excepto porque no controlo bien al campeón. Y un consejo es que no te bases en estadísticas, ya que a fin de cuentas puede que no termine funcionándote. Lo que haría yo es testearlo y sacar mis propias conclusiones. Saludos.","replies":[]},{"poster":"Evanz","date":"2018-01-06T18:14:12.944+0000","up_votes":1,"down_votes":0,"body":"La vara no seria mas bien opcional? lo veo bien cuando tenes una linea bastante difícil. ya que te da aguante en linea.","replies":[]},{"poster":"Moméntum","date":"2018-01-06T17:14:21.641+0000","up_votes":1,"down_votes":0,"body":"**Mas bien crack. **\n\n**\nVara de las edades como primer item, despues tirate por un Liche, si tenes a un Zed o algo que te burstee comprate el cronómetro para ir armando el Reloj, despues un Eco de Ludem , y las botas son muy importantes tenes que fijarte si te estan aplicando daño AP o AD **\n\n> Espero que te sirva y que tengas un excelente fin de semana.","replies":[]},{"poster":"Ks Erwyn","date":"2018-01-06T17:07:22.541+0000","up_votes":3,"down_votes":3,"body":"Si recuerdo que desde la s2 la vara era un item opcional a core en el, le da un poco de supervivencia mientras espera sus cooldown, ten en cuenta que Tf no es un mago clásico basado solo en Habilidades tmb usa sus basicos, sumado al echo de que no tiene una ulti de daño.\n\ncreo que era mas común en otra temporadas, cuando había cierta maestría que transformaba el mana de la vara y el Lich en un % de reg. de vida pasiva, mas la reg. del {{item:3010}} lograbas un sustain mas que decente...","replies":[]}]}