{"poster":"Hnk Kenshiro","date":"2015-12-27T16:07:33.670+0000","title":"Cada segundo cuenta, buff para Tahm","subforum":"Charlas Generales","up_votes":1,"down_votes":4,"body":"&iquest;No les has pasado que estan por hacer una super jugada y son tragados por tahm? &iquest;les parece una eternidad el tiempo que pasan siendo digeridos?\r\nYo no tengo la solucion, pero quisiera hacer una recomendacion.\r\nHace algunos (muchos) parches se implemento que campeones como {{champion:74}} o {{champion:43}}  pudieran activar sus ultis cuando se encontraban suprimidos (no recuerdo si funciona aturdidos)\r\nConsidero que dentro de tahm tambien podamos activarlas, (en caso que no podamos, no he tenido la oportunidad de probarlo)\r\nY quisas potenciadores de basicos, ({{champion:24}} {{champion:91}} {{champion:75}}) en caso que nos trague un tahm aliado. &iexcl;Preparemonos durante el viaje!","replies":[{"poster":"Kyousuke","date":"2015-12-27T16:11:54.910+0000","up_votes":3,"down_votes":0,"body":"no -.- ya esta muy roto el jodido sapo como para buffarlo mas","replies":[]},{"poster":"Ranpage","date":"2015-12-27T21:13:54.907+0000","up_votes":1,"down_votes":0,"body":"en serio quieres buffear al campeón mas tanque de juego pues si eso pasa en cada partida vamos a ver un tham y pronto un tham y un kindred  ya que kindred literalmente da igual que tham tenga 1000 de armadura o 10000 de vida kindred lo destruye igual con sus marcas que quitan vida en porcentaje osea por como 8 marcas quitas el 10% de vida a 16 marcas quitas el 20% de vida sin contar el daño de básicos y el devorador que le puedes colocar y el arco de runan {{sticker:zombie-brand-facepalm}} {{sticker:zombie-brand-mindblown}} {{sticker:zombie-brand-clap}} \nPLIS NO BUFEEN AL THAM KENCH{{sticker:zombie-nunu-tears}}","replies":[]},{"poster":"II Thanatos II","date":"2015-12-27T19:27:41.200+0000","up_votes":1,"down_votes":0,"body":"El sapo esta rotisimo tankea y pega burro","replies":[]},{"poster":"Tamer 01","date":"2015-12-27T16:55:31.201+0000","up_votes":1,"down_votes":0,"body":"otro buff ya lo pondria en el puesto 1 de ban rate","replies":[]}]}