{"poster":"A Small Man","date":"2016-02-02T18:34:55.534+0000","title":"New Champion Q&A: Jhin, the Virtuoso [COMPLETED]","subforum":"[ARCHIVED] Miscellaneous","up_votes":57,"down_votes":11,"body":"[ÜRES]","replies":[{"poster":"taochi","date":"2016-02-02T18:54:41.305+0000","up_votes":16,"down_votes":4,"body":"What is jhins favorite food?","replies":[{"poster":"WAAARGHbobo","date":"2016-02-02T19:56:46.986+0000","up_votes":72,"down_votes":4,"body":"Dumplings.","replies":[{"poster":"Honor is Dead","date":"2016-02-02T22:30:51.727+0000","up_votes":34,"down_votes":0,"body":"jhingerbread","replies":[]}]}]},{"poster":"TerribleTyphon","date":"2016-02-02T19:10:43.303+0000","up_votes":43,"down_votes":0,"body":"Back in the 1920's, a Finnish sniper by the name of Simo Häyhä fought for Finland against the soviet union. During that time we was credited with 505 sniper kills over the course of about 100 days. He was nicknamed \"White Death\" for his white parka that he wore on missions during the snow filled winter. His military carrier was ended when he face tanked an explosive bullet. He face was disfigured until his death in 2002.\n\nLink to Simo Häyhä Wikipedia: https://en.wikipedia.org/wiki/Simo_H%C3%A4yh%C3%A4\n \nWhen making Jhin was any inspiration taken from this real life sniper's history? If not, then could we see a White Death skin in the future for him?","replies":[{"poster":"WAAARGHbobo","date":"2016-02-02T19:55:26.579+0000","up_votes":64,"down_votes":1,"body":"So, we do a tremendous amount of research when working on a new champ.  Yep, this guy showed up on early mood boards-- esp that he refused to use a scope.    Simo would be a good inspiration for a military skin.   +1!","replies":[{"poster":"Dragon Fang Shot","date":"2016-02-02T20:03:06.329+0000","up_votes":10,"down_votes":0,"body":"I'm assuming he would end up getting an Arctic Ops skin since that's already a skin theme then?","replies":[{"poster":"Kindlejack","date":"2016-02-02T22:13:13.033+0000","up_votes":23,"down_votes":0,"body":"Yeah WAAARGHbobo presented this story and we did think about Arctic Ops for his launch skin. I think it'd be a great fit for him.","replies":[]}]}]}]},{"poster":"Sporty Spice","date":"2016-02-02T20:08:30.769+0000","up_votes":25,"down_votes":27,"body":"What's Jhin's sexuality (if he has one)? His VO and animations are on a Taric level of fabulousness.","replies":[{"poster":"WAAARGHbobo","date":"2016-02-02T21:07:23.435+0000","up_votes":59,"down_votes":0,"body":"Gun-sexual?   Kill-sexual?     Jhin doesn't understand sex in the same way you do (regardless of your gender identity).","replies":[]}]},{"poster":"WAAARGHbobo","date":"2016-02-02T20:39:46.423+0000","up_votes":47,"down_votes":3,"body":"This keeps coming up so I'll make a separate post here.\n\nHis arm isn't robotic. \nHe's got a black body sleeve on. Iinna creepy gimp way). \nThe gold armor on his sleeve is to protect him from the weapons magical recoil. \n\n The shoulder is part of his weapon,  It carries huge containers of magical energy shells.","replies":[{"poster":"Artificial Human","date":"2016-02-02T21:56:36.757+0000","up_votes":18,"down_votes":1,"body":"What? How is this even possible? His \"robotic arm\" doesnt look like it has enough room for a biological arm. The same goes for the legs, just look  at the foots. \n\nhttp://i.imgur.com/IJK2WGK.jpg\n\n","replies":[]},{"poster":"mckaøs","date":"2016-02-02T22:04:45.473+0000","up_votes":14,"down_votes":1,"body":"I don't want to say a riot employee is wrong, but from the looks of it, his arm actually has ball joints and sockets where they should be on a human. Especially his elbow and wrist.. I honestly think whoever drew the splash art may have interpreted it as a robotic arm? Take a close look at the splash, it may have to be revised? [https://i.gyazo.com/71381f9388edd6ee1c147e2c35943115.jpg](https://i.gyazo.com/71381f9388edd6ee1c147e2c35943115.jpg)","replies":[]}]},{"poster":"Moral Support","date":"2016-02-02T19:01:17.967+0000","up_votes":6,"down_votes":1,"body":"So, smooth or crunchy peanut butter?","replies":[{"poster":"WAAARGHbobo","date":"2016-02-02T20:35:43.246+0000","up_votes":42,"down_votes":1,"body":"\"A sandwich?  How gauche.\"","replies":[]}]},{"poster":"DamnItChristian","date":"2016-02-02T19:55:00.923+0000","up_votes":3,"down_votes":0,"body":"You've mentioned that Jhin came around because Caitlyn didn't fit the sniper archetype as well as you'd like. Are there other examples where a champion currently fits into a role you think can be done differently or better?","replies":[{"poster":"AD Yuumi","date":"2016-02-02T20:45:59.505+0000","up_votes":40,"down_votes":1,"body":"There's a lot of characters we could improve.  Personal opinions here:\nVlad could be a better \"aristocrat vampire\"\nAatrox could be a better \"demon commander\"\nIrelia could be a better \"psychic blade wielder\"\nCaitlyn could be a better \"sharpshooter/sheriff/Piltovian high society lady/SOMETHING\" - that character is a mess right now, just a sexy lady with a gun and a miniskirt.  She makes me especially sad because she has so much POTENTIAL to be awesome.  Her good cop/bad cop BFF's relationship with Vi works well for example...","replies":[]}]},{"poster":"Alpha Skarner","date":"2016-02-02T18:45:29.632+0000","up_votes":25,"down_votes":4,"body":"First I would like to say I LOVE Jhin! When I saw the promotional video and his kit, I knew he would fit my play style (besides Skarner of course :P). And god that voice is BEAUTIFUL!\n\nBut enough about my blabbering, here are a couple of my questions...\n\n\n\n(1.) Is Jhin possessed by a demon or some unknown entity?\n\n\n\nThe reason I bring this up is because of two interesting things I've noticed about him. The first is that is his death animation; Jhin's mask levitates up the air off his face for a moment before falling back on top his face when he dies. This caught my attention because when I studied his death animation more, I noticed that it looks like he is reaching out in the air towards his floating mask, only for it to ram itself back onto his face (rather violently). Is some correlation between his mask flying and his desperate attempt to reach for it? \n\nThe second thing is his quote,\"You've awoken something deep inside me.\" Now this quote can be interpreted different ways, like he is referring to his obsession, but I suspect there is something darker about our virtuous killer. Is there some unknown force that drives Jhin to this level of insanity, to the point where he views his work as art?\n\n\n(2.) What is his reaction to Kindred? Does he show any appreciation towards them?\n\n\nWe know that before Jhin was caught, he worked as part of a Ionian theater. So, with that in mind, we know that Kindred has had some sort of theatrical representation with their backstory in \"The Good Death\". Is it possible that, because of his theatrical experience, that he has seen/heard of Kindred's myth? If so, does he have any respect for their work now that he gets to go up against the Eternal Hunters since both associate themselves with death; the only difference being that Kindred is the actual personification of death whereas Jhin enjoys inflicting death through his work of art?\n\n\n\n(3.) Why does Jhin despise Illaoi so much?\n\n\nThis baffles me because from Illaoi's perspective, Jhin is \"in motion\". He is doing what he wants, which to her is what Nagakabouras wants. So why is it that our masked assassin hates her so much?\n\n\n\n\n(4.) My final question, what exactly causes Jhin's victims to explode into lotus flowers?","replies":[{"poster":"DSRM Mobius","date":"2016-02-02T19:17:07.886+0000","up_votes":4,"down_votes":1,"body":"In Jhin's laugh animation he takes off his mask to reveal a black head with no face, I am very interested to know if Jhin has a face.","replies":[{"poster":"Squad5","date":"2016-02-02T19:23:38.852+0000","up_votes":31,"down_votes":1,"body":"He has a face! He's wearing a hood/mask underneath his mask. Of course, who knows if that face is just another mask?","replies":[{"poster":"Riot Brightmoon","date":"2016-02-02T19:25:30.404+0000","up_votes":36,"down_votes":0,"body":"The mask is a lie","replies":[]}]},{"poster":"AD Yuumi","date":"2016-02-02T19:32:09.276+0000","up_votes":22,"down_votes":0,"body":"He does have a face! Jhin is very much a human and tends to blend in if he goes out without his \"costume\" (he can take the shoulder cannon off). He's just wearing a leather cover under his mask.  If you look closely you can see a hole torn in it that reveals one of his eyes.","replies":[]}]},{"poster":"AD Yuumi","date":"2016-02-02T19:22:59.329+0000","up_votes":21,"down_votes":1,"body":"1)  Nope no possession.\n2) The thing about Kindred is that they don't have \"work\" that can be shown.  Being the grim reaper, Kindred \"kills\" people who are already dead. As such Jhin's performances effectively cause some of their appearances them rather than competing with them for kills.\n3) WaarghBoBO probably can give a better explanation for this.  All I know is that he wrote both Jhin and Illaoi and likes to poke fun at his past work.\n4) Jhin's bullets are magical and crafted by him to create beautiful effects when they kill people.  The flower is a specific \"good gameplay approved\" version of that for summoner's rift, but Jhin's bullets \"IRL\" likely have a lot of different effects.","replies":[]},{"poster":"WAAARGHbobo","date":"2016-02-02T19:28:53.441+0000","up_votes":12,"down_votes":0,"body":"> [{quoted}](name=Alpha Skarner,realm=NA,application-id=cIfEodbz,discussion-id=WUwqmxEZ,comment-id=0008,timestamp=2016-02-02T18:45:29.632+0000)\n>\n> First I would like to say I LOVE Jhin! When I saw the promotional video and his kit, I knew he would fit my play style (besides Skarner of course :P). And god that voice is BEAUTIFUL!\n> \n> But enough about my blabbering, here are a couple of my questions...\n> \n> \n> \n> (1.) Is Jhin possessed by a demon or some unknown entity?\n> \n> \n> \n> The reason I bring this up is because of two interesting things I've noticed about him. The first is that is his death animation; Jhin's mask levitates up the air off his face for a moment before falling back on top his face when he dies. This caught my attention because when I studied his death animation more, I noticed that it looks like he is reaching out in the air towards his floating mask, only for it to ram itself back onto his face (rather violently). Is some correlation between his mask flying and his desperate attempt to reach for it? \n> \n> The second thing is his quote,\"You've awoken something deep inside me.\" Now this quote can be interpreted different ways, like he is referring to his obsession, but I suspect there is something darker about our virtuous killer. Is there some unknown force that drives Jhin to this level of insanity, to the point where he views his work as art?\n> \n> \n> (2.) What is his reaction to Kindred? Does he show any appreciation towards them?\n> \n> \n> We know that before Jhin was caught, he worked as part of a Ionian theater. So, with that in mind, we know that Kindred has had some sort of theatrical representation with their backstory in \"The Good Death\". Is it possible that, because of his theatrical experience, that he has seen/heard of Kindred's myth? If so, does he have any respect for their work now that he gets to go up against the Eternal Hunters since both associate themselves with death; the only difference being that Kindred is the actual personification of death whereas Jhin enjoys inflicting death through his work of art?\n> \n> \n> \n> (3.) Why does Jhin despise Illaoi so much?\n> \n> \n> This baffles me because from Illaoi's perspective, Jhin is \"in motion\". He is doing what he wants, which to her is what Nagakabouras wants. So why is it that our masked assassin hates her so much?\n> \n> \n> \n> \n> (4.) My final question, what exactly causes Jhin's victims to explode into lotus flowers?\n\n\n\n\n1.  The question of demonhood (Sp?)  Is and interesting philosophical question.   Currently Jhin is a man-- a very driven and magically gifted one-- but only a man.  In a land touched by so much magic... what would happen if he was killed.\n\n2.  Only a passing interest as \"an artistic theme\" he could explore in one of his \"works.\"\n\n3.  Sooo...   'cause I worked on Illaoi just prior to him.   (Also why he's so mean to Tahm Kench)  {{sticker:slayer-jinx-wink}} \n\n4.  The bullets are fueled by magic instead of a chemical reaction.  He makes them himself.","replies":[]}]},{"poster":"Major Stormz","date":"2016-02-02T19:28:43.522+0000","up_votes":2,"down_votes":1,"body":"I have only one question... WHY?! He's a cool champion and all, but WHY KILL {{champion:37}} ? She's so harmless, yet she was killed...","replies":[{"poster":"Riot Jino","date":"2016-02-02T20:30:08.433+0000","up_votes":34,"down_votes":1,"body":"Sona is deadly. Tell me again after AP Sona's Q and power-cord BA hit you ~ :D","replies":[]}]},{"poster":"Solash","date":"2016-02-02T19:39:29.052+0000","up_votes":5,"down_votes":0,"body":"While we know that High Noon Jhin was a homage to his original concept, what other skin ideas were thrown around for him?","replies":[{"poster":"Riot Jino","date":"2016-02-02T20:17:23.431+0000","up_votes":31,"down_votes":2,"body":"There were ideas with Project skin and Arcade skin :) We are saving those idea for future","replies":[{"poster":"N3rdism","date":"2016-02-02T23:02:18.582+0000","up_votes":14,"down_votes":1,"body":"I feel like an Arctic Ops skin would be really really cool on Jhin","replies":[]}]}]},{"poster":"The Ruined King","date":"2016-02-02T19:24:32.003+0000","up_votes":8,"down_votes":0,"body":"Was pretty bummed out he didn't actually have any lines for VI, even though she was in the teaser. Can you at least let us know why he wants/would want to kill her, or what his opinion of her is?","replies":[{"poster":"WAAARGHbobo","date":"2016-02-02T19:59:50.877+0000","up_votes":14,"down_votes":0,"body":"> [{quoted}](name=The Ruined King,realm=NA,application-id=cIfEodbz,discussion-id=WUwqmxEZ,comment-id=004b,timestamp=2016-02-02T19:24:32.003+0000)\n>\n> Was pretty bummed out he didn't actually have any lines for VI, even though she was in the teaser. Can you at least let us know why he wants/would want to kill her, or what his opinion of her is?\n\nSo the promo is not 1-1 with the champ.   For visual interest.\n\nBut Jhin did have some lines making fun of VI...  which were actually thinly veiled pokes at Gypsylord.   They were cut before record.","replies":[{"poster":"ArcticSirius","date":"2016-02-02T20:03:03.998+0000","up_votes":6,"down_votes":0,"body":"Noooooooooooooooooooo, please find a way to add them back in ;-;","replies":[{"poster":"WAAARGHbobo","date":"2016-02-02T20:28:53.228+0000","up_votes":29,"down_votes":1,"body":"They were never recorded.      Too meta.\n\nI think one was    (mocking her voice) \"I like punching people!\"  (then back in his own voice)  \"You don't have any design do you?\n\nmeh.\nIf they had been great they would have made the cut.","replies":[]}]}]}]},{"poster":"7Artemis7","date":"2016-02-02T18:40:38.540+0000","up_votes":28,"down_votes":2,"body":"What's Karma's relationship to Jhin and the faction of the council that freed him?","replies":[{"poster":"WAAARGHbobo","date":"2016-02-02T20:22:36.410+0000","up_votes":14,"down_votes":1,"body":"None.   She grew up in Ionian  though, so she's heard stories of the Golden Demon.  She wouldn't believe you if you told her he was free.","replies":[{"poster":"Chromatic Eagle","date":"2016-02-02T20:48:20.016+0000","up_votes":18,"down_votes":0,"body":"Isn't she an Elder? How wouldn't she know?\n\nHow widespread does info go about in Ionia?","replies":[]}]}]},{"poster":"Oleandervine","date":"2016-02-02T19:04:18.736+0000","up_votes":4,"down_votes":0,"body":"Why was the idea to make him a cyborg cowboy scrapped? Why was there a need to bind him to Ionian lore?\nThat concept would have fit very nicely in Noxus or in an outpost along the Shurima desert. I know you guys wanted to keep him that way, judging by the fact that there are unique voice lines tied to his High Noon skin only. Plus, compared to his current look, I think the green and black cowboy you posted in the making-of article looked very awesome.","replies":[{"poster":"Squad5","date":"2016-02-02T19:20:29.423+0000","up_votes":23,"down_votes":0,"body":"I was always a big fan of the cyborg cowboy from the first piece of concept art that I saw of it. In regard to tying him into Ionia it wasn't really a _need_ but more of an opportunity. Through Jhin we get to see a new side of Ionia. We see not only a darker aspect to their society (with him being released to kill again) but also show the fact that Ionia has different weapons and styles of fighting than things like the ninjas or the more mystical fighters.\n\nJhin's an entirely different side of Ionia, and I think his existence actually gives more depth and insight into that society.","replies":[]},{"poster":"WAAARGHbobo","date":"2016-02-02T19:40:28.899+0000","up_votes":16,"down_votes":1,"body":"Western isn't really in universe.   We are trying to develop the world.\n\nJhin give us a chance to show that Ionia is in transition.   The attack on their nation changed them. They are embracing technology they had previously thought unnecessary, and they are questioning their morale foundations.   Jhin is the true villain of Zed and Shen's story-- and he represents everything that could go wrong for Ionia.  ","replies":[]}]},{"poster":"Sharjo","date":"2016-02-02T19:23:27.642+0000","up_votes":6,"down_votes":1,"body":"Alright time for some narrative focused questions!\n\n1) Jhin got his gear from the Kashuri armories, but how did they get there? Are said armories filled with Ionian made weapons and armour or was Jhin's stuff in particular imported from somewhere like Zaun or Piltover?\n\n2) So I know that of course the only champion from the promos that Jhin has any direct relationship with is Zed, but I'm curious about Sona in particular. While a proper meeting between the two hasn't happened was Sona still in Ionia when Jhin was out and about? Hell would Sona even have been old enough to have access to news of a serial killer at the time?\n\n3) Jhin of course has his opinions of Ionia in general, but does he have any specific opinions about some of the more well known faces of Ionia? Karma, Irelia, Syndra and Lee Sin come to mind personally, but are there any stand out Ionian figures that hold Jhin's interest beyond Shen and Zed?\n\n4) Jhin's mask is clearly magical and there's something very odd about it. While the details probably aren't up for discussion at the moment do you have any hints to drop about it?\n\nJhin's a really interesting character for me and he's a ton of fun to play, so thank you guys for making him as awesome as he is!","replies":[{"poster":"WAAARGHbobo","date":"2016-02-02T20:07:15.440+0000","up_votes":20,"down_votes":0,"body":"> [{quoted}](name=Sharjo,realm=EUW,application-id=cIfEodbz,discussion-id=WUwqmxEZ,comment-id=0047,timestamp=2016-02-02T19:23:27.642+0000)\n>\n> Alright time for some narrative focused questions!\n> \n> 1) Jhin got his gear from the Kashuri armories, but how did they get there? Are said armories filled with Ionian made weapons and armour or was Jhin's stuff in particular imported from somewhere like Zaun or Piltover?\n> \n\nThe Kashuri Armories have been making weapons for a long time--mostly swords and bows.  The war changed that.  They began making poor copies of  hextech weapons during the war. Now they have been \"inspired\" to make new weapons harnessing the abundant magic in Ionia.  Hextech uses a little bit of magic very efficiently.  Jhin's weapons use a lot of magic.\n\n\n> 2) So I know that of course the only champion from the promos that Jhin has any direct relationship with is Zed, but I'm curious about Sona in particular. While a proper meeting between the two hasn't happened was Sona still in Ionia when Jhin was out and about? Hell would Sona even have been old enough to have access to news of a serial killer at the time?\n> \n\nAs hinted in his bio.  Jhin frequently likes killing other famous artists.    Sona is very, very famous. \n\n> 3) Jhin of course has his opinions of Ionia in general, but does he have any specific opinions about some of the more well known faces of Ionia? Karma, Irelia, Syndra and Lee Sin come to mind personally, but are there any stand out Ionian figures that hold Jhin's interest beyond Shen and Zed?\n> \n\nNot particularly.  He has a passing interest in killing Yi.    The Wuju school, dwarfed the success of Jhin's father's martial art school.   ....opps I've said too much.\n\n> 4) Jhin's mask is clearly magical and there's something very odd about it. While the details probably aren't up for discussion at the moment do you have any hints to drop about it?\n> \n\nnope!\n\n> Jhin's a really interesting character for me and he's a ton of fun to play, so thank you guys for making him as awesome as he is!\n\nFrom all of the team.   THANX!","replies":[{"poster":"Alphadef","date":"2016-02-02T22:09:02.389+0000","up_votes":8,"down_votes":0,"body":"> Not particularly. He has a passing interest in killing Yi. The Wuju school, dwarfed the success of Jhin's father's martial art school. ....opps I've said too much.\n\nWhy do you do this to us?","replies":[{"poster":"WAAARGHbobo","date":"2016-02-03T00:54:29.983+0000","up_votes":22,"down_votes":0,"body":"Tahm made me do it.","replies":[]}]}]}]},{"poster":"SG Lan Layer","date":"2016-02-02T18:41:25.259+0000","up_votes":8,"down_votes":2,"body":"What Jhin thinks about other murderers like Shaco, Nocturne or Fiddlesticks?\n\nAnd why looks like everyone knows Garen and Katarina have feelings of each other? :/","replies":[{"poster":"AD Yuumi","date":"2016-02-02T19:09:28.830+0000","up_votes":21,"down_votes":0,"body":"I'd imagine he thinks they're pretty crude.  Jhin believes death should be beautiful and deaths that aren't  a \"performance\" feel like somewhat of a waste to him.","replies":[]}]},{"poster":"Nagoh Shan","date":"2016-02-02T18:44:09.801+0000","up_votes":9,"down_votes":4,"body":"Are you guys going to be comfortable if Jhin finds himself in more than one lane, or will you try to enforce specific positions for him?","replies":[{"poster":"AD Yuumi","date":"2016-02-02T19:00:34.210+0000","up_votes":21,"down_votes":0,"body":"We'd like Jhin to be able to duo lane as a marksman.  If he goes anywhere else that's fine as long as he's not so powerful there that we have to balance his duo lane to be weak.\n\nOne place I have concerns about is jungle because I'm not sure if 2500 range pre-6 ganks are all that okay if he's super strong there.","replies":[{"poster":"Nagoh Shan","date":"2016-02-02T19:51:54.268+0000","up_votes":4,"down_votes":0,"body":"This is one thing that's made me wonder.\n\n\"So powerful\" is not a technical measurement. Does this mean \"If he's equally successful in multiple lanes\" or does it mean \"If his off-role outpaces his designed role\"\n\nBecause Lissandra, Quinn, Graves, Vlad, Teemo, ect have all fit into both of those statements without adjustment. And if he's flexable in all roles except support, lets say, with a roughly equal success rate in each role, would that be allowable?\n\nWhen you're looking at these things what is it that make you say it may be time to adjust, is basically what I'm asking?","replies":[{"poster":"AD Yuumi","date":"2016-02-02T20:05:26.369+0000","up_votes":21,"down_votes":1,"body":"I'll use Vi as an example here since this actually happened to her.\n\nI designed Vi as a top laner.  When she came out she was actually viable up there (heh Vi-able), but was MUCH stronger in the jungle.  So strong in fact that she needed to be nerfed.  Nerfs came in the form of R CD, Q damage/waveclear, and level 1 stats on W, all of which are CRUCIAL to being able to compete against things like Riven up top. So because of Vi's strength in jungle (and our decision to support her jungling) she was nerfed out of top lane.  \n\nWith Jhin, we want to support his duo lane marksman role over anything else which means we'd nerf his mid if we felt it was preventing us from making him strong bot.  This does not mean we'd nerf mid Jhin \"just cause\" (I'd prefer if both could be strong).","replies":[]}]}]}]},{"poster":"Khimera","date":"2016-02-02T19:02:59.895+0000","up_votes":3,"down_votes":0,"body":"Hey there! Really excited for Jhin. Love his overall theme and design. A few questions I have:\n-What is his specific relation to Garen, Zed, Sona, and Vi? \n-Why were these four chosen for the promo videos? \n-What led to the huge *thing* on his shoulder? \nThanks for your time and have a great one!","replies":[{"poster":"WAAARGHbobo","date":"2016-02-02T19:46:26.793+0000","up_votes":9,"down_votes":0,"body":"> [{quoted}](name=FriendlyBoy,realm=NA,application-id=cIfEodbz,discussion-id=WUwqmxEZ,comment-id=0028,timestamp=2016-02-02T19:02:59.895+0000)\n>\n> Hey there! Really excited for Jhin. Love his overall theme and design. A few questions I have:\n> -What is his specific relation to Garen, Zed, Sona, and Vi? \n> -Why were these four chosen for the promo videos? \n> -What led to the huge *thing* on his shoulder? \n> Thanks for your time and have a great one!\n\n\nSo some of this I just answered.\n\n_What led to the huge thing on his shoulder?_\n\nThe cloak hides the final 2 pieces of his rifle.  The gun is attached to his shoulder.  \n\nWe were looking for Jhin to have secrets and be odd looking.  The intention is for people playing against him to go   \"WTF is on his shoulder!? \"  Then his ult happens and you discover-- oh crap he has a huge gun!","replies":[]}]}]}