{"poster":"lostbob117","date":"2015-02-26T20:25:25.508+0000","title":"So I asked another LoL GD what they would like improved here to come here","subforum":"[ARCHIVED] General Discussion","up_votes":26,"down_votes":8,"body":"I've compiled a list of the things they'd like to come here, and that could improve these forums.\n\n* Traditional Forum layout(Like big avatar image and sigs and OP only being on the first page)\n* More Official Color Schemes\n* Personal Avatars\n* Signatures\n* Relaxed rules(Especially on the \"Don't be a jerk\" one)\n* Better load times\n* Ease when browsing mobile\n* Attachments to be how they use to be\n* A profile section on the posts(Avatar, Badges, Title, etc.)\n* Option to hide the sidebar\n* PM system\n* Cannot up/downvote outside of a thread\n\nNow here are some ways you, Riot, could implant these features:\n\n**Traditional Forum Layout**\nMake a button(Like the chronological button) to make it show/hide the OP on all pages of the thread.\n\n**Personal Avatars**\nThe FEK people seem to doing this pretty good; if you make a system where they can look at the avatars and press \"yes\" or \"no\" it'll be a lot easier for them. They also can do it as voluntary work with no pay, and you cannot disregard they are doing so far with that.\n\n**Signatures**\nHave a \"My Settings\" and make it where you have to turn on the Signatures to see them; this makes it where you cannot see anything that might be offensive to you right away and you can keep it off so you don't see any of that. You also can put a report button on the Signatures. Have the reports go to a system like the Avatars have where the moderator just has to press \"yes\" or \"no\".\n\n**Relaxed Rules**\nIn the \"Culture\" you can add: \"This is a board for a more mature audience blah blah blah\". Where you can say mean things, but like the other GD it shouldn't be directed at a certain person.\n\n**PM System**\nYou can PM people, but you can also turn PMs off complete in \"My Settings\". Also, you can just block certain people from PMing you; by pressing the \"Block\" button on the PM. However, you'll still able to see their posts. Could also do where they need a code for the person to PM them; this is a bit more dumb though.","replies":[]}