{"poster":"9081913DEL1","date":"2017-03-24T21:32:48.880+0000","title":"Azir el Ascendido - Guia -","subforum":"Guias y consejos","embed":{"description":"►Music channel : https://goo.gl/XkFcxn ►Best LoL Montages : https://goo.gl/Q4HtFg ________________________________________ Patch 6.24 Subscribe for new videos!","url":"https://www.youtube.com/watch?v=Hmv4oH0i-SE","image":"https://i.ytimg.com/vi/Hmv4oH0i-SE/hqdefault.jpg"},"up_votes":5,"down_votes":1,"body":"Esta es una review, para que esten en conocimiento de nociones generales del campeon. Es cierto que en este meta esta algo atras, pero revisando partidas veo que muchos no lo juegan correctamente.\r\n\r\n1. Azir es un campeon que a pesar de ser escalable en AP, se basa mas en velocidad de ataques y Reducci&oacute;n de enfriamientos, sus habilidades dependen mas de autoataques por consiguiente olvidate de ponerle runas de pen. mag. o llenar la pagina de runas con AP, eso no sirve para el.... su poder se basa en el da&ntilde;o sostenido que hace por sus ataques basicos de sus soldados y el mismo, es por ello que le beneficia mas la velocidad de ataque para tener un mejor sustain de da&ntilde;o en las marcas, y la reducci&oacute;n de enfriamiento le va de maravilla en los glifos, es bueno tener unos cuantos glifos de esto puestos ademas de la resist mag... para los sellos le sale mejor cualquier cosa relacionada con vida... y las quintas se las dejo a su gusto\r\n\r\n\r\n2. Si quieres manejar al Azir tan bien como debe ser y explotando su potencial lo mas que puedas... olvidate de quererlo jugar con camara bloqueada... ya que el rango de movimiento de sus soldados invocados con su Q y su E.. son bastante extensos, y con camara bloqueada no podras explotar bien esas cualidades\r\n\r\n3. Azir como lo escribi en el primer parrafo no necesita de tanto AP para hacer un da&ntilde;o ridiculo... como lo dije y repito, &eacute;l usa un da&ntilde;o sostenido debido a los auto-ataques de sus soldados... por eso buildeate mas con objetos de velocidad de ataque y reduccion de enfriamiento, en esto es bueno el diente nashor y la botas de reducci&oacute;n, ya con eso dos tienes todo el CD posible... y usa objetos de pasivas potentes y colaterales, como tormento de liandri y rilay\r\n\r\n4. Aunque no lo creas Azir puede obtener mucha vida a lo largo de su partida, el tormento de liandri y rilay son objetos que te ayudan, eso mas los sellos de vida (cuales sean) y es posible llevarlo a mas de 2k de vida\r\n\r\n5. Algo que recomiendo asi como a usar la camara desbloqueda es otro punto muy importante... acostumbrate y configura tu modo de juego en: &quot;auto-ataques en movimiento&quot;... yo lo tengo con la tecla &quot;A&quot;... por que? diran ustedes... por la misma razon de su da&ntilde;o sostenido con autoataques... es dificil hacer click en el enemigo dirigiendo el puntero, principalmente si los tienes lejos de tu campeon como usualmente pasa al usar los soldados, y es en esto que repito es importante tener camara desbloqueada para tener mejor visi&oacute;n (casi siempre haras da&ntilde;o sin estar tu campeon presente cuerpo a cuerpo)\r\n\r\n\r\n6. Azir para mi opinion personal es un campeon concebido para:\r\n\r\na. ense&ntilde;arnos a jugar sin camara bloqueada, usar los autoataques en movimiento y hechizos rapidos y configurarlos de esa manera\r\n\r\nb. Pushear lineas y saber jugar con las torres (principalmente por su pasiva)\r\n\r\nc. saber posicionarte en el campo y tener mas visi&oacute;n del mapa (wardeo)\r\n\r\nSi tienes en claro estos tres ultimos tips del punto 6... ten por seguro que seras un maestro con este campeon, y es por ellos que para muchos es extremadamente dificil explotarlo\r\n\r\n-Apenas empiece la partida, conc&eacute;ntrate en farmear, ll&eacute;vate todo el oro que puedas, no vas a tener da&ntilde;o para matar a alguien, ignora al enemigo, a menos que counterpickees muy fuertemente al enemigo, si es as&iacute; podes desgastarlo poco a poco. Pero Azir escala con sus &iacute;tem. Y si no llevas ignite, como la mayor&iacute;a lo juega, menos chances de matar tenes. \r\n\r\n-Tenes mucho rango y da&ntilde;o, es preferible llevar barrier, extenuar o el summoner que quita las debilitaciones si juegas contra un matchup con mucho CC\r\n\r\n-El combo de desplazamiento es W + E + Q. As&iacute; podes desplazarte junto a tu soldado y podes stunear al rival si apuntas bien. Es importante que cuando castees la W te alejes un poco del soldado invocado y reci&eacute;n despu&eacute;s uses tu E y luego la Q\r\n\r\n-La R de Azir sale bien de atr&aacute;s de el, esto es importante porque podes hacer una variante del famoso movimiento &quot;InSec&quot;. A veces pareciera que no vas a llegar a empujar al rival con tu muro del Ult&iacute;mate, por eso es importante que practiques esto y veas como sale de atr&aacute;s.\r\n\r\n-Ahora que sabemos lo de la R. El combo completo para dejar a un rival bajo tu torre o de cara a tu tema es W + E + Q + R. Recordar apuntar la R hacia donde quieras empujar, obviamente.\r\n\r\n- Resistencias, si lo se a nadie le gusta buildearse semitank, la realidad es que cuanto mas dures en batalla mas da&ntilde;o realizaras. Se prudente con tu itemizacion.\r\n\r\n- Tienes muchisima movilidad, puedes realizar gankeos like a boss en lvl 6, si puedes generar una ventana hazlo, recuerda que tu muro no pueden pasarlo, es decir en botlane un gank tuyo es doblekill, solo no tragues da&ntilde;o gratis.\r\n\r\nLas torres pueden darte vision, si juegas cdr como deberias, no esperes un momento que quizas jamas llegue, si no se presenta una oportunidad epica igual deberias de usar tu ultimate.\r\n\r\n\r\nSaludos y espero lo sepan aprovechar.\r\n\r\nSi alguien quiere aportar mas a la guia es libre de hacerlo!","replies":[{"poster":"Kyousuke","date":"2017-03-24T22:06:52.270+0000","up_votes":1,"down_votes":0,"body":"> El combo de desplazamiento es W + E + Q. Así podes desplazarte junto a tu soldado y podes stunear al rival si apuntas bien\n\nesta des-actualizada la guía mepa XD","replies":[{"poster":"FedecarboneroUY","date":"2017-03-24T23:34:41.992+0000","up_votes":1,"down_votes":0,"body":"Si, además de eso dice \"te enseña a jugar con la cámara desbloqueada\", yo en línea juego only cámara bloqueada y juego sin el más mínimo problemas campeones como: {{champion:268}} {{champion:245}} (ult, w){{champion:81}} {{champion:79}} {{champion:104}} (ult){{champion:35}} (ult){{champion:112}} {{champion:238}} , hay una tecla \" Y \" que se usa para desbloquear la cámara, no sé porque tanto el énfasis en ello, si no es algo necesario.","replies":[{"poster":"9081913DEL1","date":"2017-03-25T11:11:10.932+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FedecarboneroUY,realm=LAS,application-id=8sKIclmi,discussion-id=1Rc1328z,comment-id=00000000,timestamp=2017-03-24T23:34:41.992+0000)\n>\n> Si, además de eso dice &quot;te enseña a jugar con la cámara desbloqueada&quot;, yo en línea juego only cámara bloqueada y juego sin el más mínimo problemas campeones como: {{champion:268}} {{champion:245}} (ult, w){{champion:81}} {{champion:79}} {{champion:104}} (ult){{champion:35}} (ult){{champion:112}} {{champion:238}} , hay una tecla &quot; Y &quot; que se usa para desbloquear la cámara, no sé porque tanto el énfasis en ello, si no es algo necesario.\n\nJjugar con camara desbloqueada es lo ideal siempre, el por que es sencillo casi todo va a donde tenes el raton :)\n\nEsa es la idea cuando usas un acceso rapido, si usas acceso rapido y manejas camara block con el boton es como acelerar y hacerte lento a la vez.\nSe puede jugar con camara bloqueada, pero es bueno desbloquearla y abrir la cabeza a lo que pasa en el resto del mapa\n\nSaludos!","replies":[{"poster":"FedecarboneroUY","date":"2017-03-25T14:55:57.210+0000","up_votes":1,"down_votes":0,"body":"Pero, que tengas la cámara bloqueada no significa que no puedas ver el resto del mapa, como mismo dije, con la Y la bloquéas y desbloqueas cuando querés, es cierto que algunas habilidades las tiras \"sin ver\", pero cuando te acostumbrás a jugar así, la estás tirando al mismo lugar donde la tirarías estando con la cámara desbloqueada, osea que no hay ningún cambio.","replies":[{"poster":"9081913DEL1","date":"2017-03-25T17:34:13.021+0000","up_votes":1,"down_votes":0,"body":"esta bien, para vos es igual tener la camara desbloqueada que trabada. Ok si pensas asi no hay mas que discutir.\n\nSuerte!","replies":[{"poster":"FedecarboneroUY","date":"2017-03-25T19:57:17.799+0000","up_votes":1,"down_votes":0,"body":"{{sticker:slayer-pantheon-thumbs}}","replies":[]}]}]}]}]},{"poster":"9081913DEL1","date":"2017-03-25T11:12:05.167+0000","up_votes":1,"down_votes":0,"body":"Si si, la guia no es de mi autoria, por eso acepto aportes.\n\nigual el combo funciona para el desplazamiento, ve el video ;).\n\nSaludos!","replies":[]}]}]}