{"poster":"Quo","date":"2016-08-27T04:45:51.217+0000","title":"¿Cual es la sensación que mas detestan en league of legends?","subforum":"Charlas Generales","up_votes":10,"down_votes":0,"body":"Hay muchas cosas que nos pueden hacer experimentar alegria, risa, emoci&oacute;n, etc. Pero dentro del league of legends hay una categoria de cosas que a mas de un usuario seguro que le ponen de nervios, desde fallar un minion tanque hasta que te diveen y el enemigo se quede a un basico de morir, por eso es que hoy les pregunto, &iquest;Cual es la sensaci&oacute;n que ustedes mas odian?\r\n\r\nEn lo personal si algo me puede dar bajon es jugar una partida de 40-50 minutos e ir bien en ella todo el tiempo y que al final todo se vaya al garete por un error.\r\n\r\nY para ustedes, &iquest;cual seria? espero su respuesta en la secci&oacute;n de comentarios, saludos ^^.-","replies":[{"poster":"Vik1ng","date":"2016-08-27T14:34:10.862+0000","up_votes":11,"down_votes":0,"body":"que el mid enemigo ande por todo el mapa matando\ny aun asi tu mid pierde en farm ._:","replies":[]},{"poster":"I Love KaiSa","date":"2016-08-27T06:09:37.529+0000","up_votes":10,"down_votes":0,"body":"Que te toque contra tu main y el tipo sea horrible usandolo.","replies":[{"poster":"Snooow","date":"2016-08-27T14:57:57.334+0000","up_votes":3,"down_votes":0,"body":"Ahí le tiro todos los consejos que pueda para que me dejen de sangrar los ojos :v","replies":[{"poster":"Ranpage","date":"2016-08-27T22:39:07.726+0000","up_votes":1,"down_votes":0,"body":"yo le tiro todos los consejos y aveces le digo que me mutee para que no lea mis dat y algunas cosas mas censuradas para niños","replies":[]}]}]},{"poster":"TyShaD","date":"2016-08-27T13:15:38.297+0000","up_votes":7,"down_votes":0,"body":"Blitzcrank enemigo que meta todos los ganchos con maestría 5/6/7 que spamea risitas, tilt asegurado","replies":[{"poster":"Orgullo Noob","date":"2016-08-28T00:11:53.629+0000","up_votes":1,"down_votes":0,"body":"Hola , me buscabas ? xdxdxdxd","replies":[]},{"poster":"LemønPykë","date":"2016-08-27T21:42:04.783+0000","up_votes":1,"down_votes":0,"body":"Eso mi amigo es la sensación del Stompeo, la odio D:","replies":[]}]},{"poster":"brushiebrush","date":"2016-08-27T17:43:03.719+0000","up_votes":6,"down_votes":0,"body":"Los 250-500 de ping mientras farmeas en linea y los 90 de ping mientras compras y estas en base.","replies":[{"poster":"Zexceed","date":"2016-08-27T18:17:07.510+0000","up_votes":1,"down_votes":0,"body":"same","replies":[]}]},{"poster":"Kami RZ","date":"2016-08-27T05:20:39.934+0000","up_votes":6,"down_votes":0,"body":"Ver que has dado todo en una partida terminando por ej 6/1/6 y que tengas un team 0/9. 1/8. 4/10 y 2/5\n{{sticker:slayer-jinx-unamused}}","replies":[]},{"poster":"Yoen","date":"2016-08-27T06:18:12.679+0000","up_votes":4,"down_votes":1,"body":"Es molesto, cuando hay \"soportes\" algunos, \nque te quitan los súbditos cuando eres\nADC :d,","replies":[{"poster":"Zetha","date":"2016-08-27T13:06:14.345+0000","up_votes":3,"down_votes":1,"body":"Pensé que era el único ADC al que le molestaba eso, es más, pueden llevarse algunas kills, no me molesta en lo más mínimo con tal de que me dejen algunas.\nPERO CON MIS MINIONS NO SE JODE.\nSaludos! {{champion:51}} {{champion:119}} {{champion:90}} {{champion:106}} {{champion:236}} {{summoner:31}}","replies":[{"poster":"Hnk Kenshiro","date":"2016-08-27T15:13:52.006+0000","up_votes":4,"down_votes":0,"body":"Es simple, me last-hiteas un ward y te prometo que no vuelves a farmear :D\n\n{{sticker:slayer-jinx-catface}}","replies":[{"poster":"Zetha","date":"2016-08-27T15:30:00.659+0000","up_votes":2,"down_votes":1,"body":"¿Que adc puede ser tan malvado como para hacer eso? El ward enemigo es el de supp y el minion enemigo del adc, asi botlane siempre estará en armonía. <3\n*#EstrategiasParaUnaBuenaPartida*\nSaludos!{{champion:51}} {{champion:119}} {{champion:90}} {{champion:106}} {{champion:236}} {{summoner:31}}","replies":[{"poster":"Hnk Kenshiro","date":"2016-08-27T15:43:39.136+0000","up_votes":4,"down_votes":0,"body":"Yo he visto el mal a la cara...\n\nJunglas que esperan para last-hitear pinks.\nAdc que roban wards y gastan todo para robarme los minioms cuando tengo {{item:3302}} \nMids hacen lo mismo cuando voy a ayudarles... es horrible.","replies":[{"poster":"Ks Erwyn","date":"2016-08-27T22:42:21.632+0000","up_votes":1,"down_votes":0,"body":"Yo last-hiteo campeones, torres, dragones, wards, buffos, nexos, por que justo tengo lag y no me anda la tecla s en ese momento....","replies":[]}]}]}]}]}]},{"poster":"zelaya19","date":"2016-08-27T15:14:45.347+0000","up_votes":4,"down_votes":0,"body":"Vayne feed enemiga en early, y no tener un asesino en tu equipo. Sabes que se te viene la noche.","replies":[{"poster":"BestAhriCuba","date":"2016-08-27T21:09:13.639+0000","up_votes":1,"down_votes":0,"body":"Jajaja, que desesperante que tengan una vayne y en tu team tenes una lulu en mid y puros tanques xD","replies":[]}]},{"poster":"tiralisar","date":"2016-08-28T03:54:26.088+0000","up_votes":3,"down_votes":0,"body":"que no acepten surrender cuando la partida esta mas regalada que {{champion:45}}  sin mana contra {{champion:157}}","replies":[]},{"poster":"Thails SirYordle","date":"2016-08-27T22:51:31.676+0000","up_votes":3,"down_votes":0,"body":"Cuando en un momento inicial de la partida la cagaste o hiciste algo mal y te empieza a ir mal, tenes mal farm, fedeaste, estas atras en lvl, no pegas nada y te revientan por mas que hagan una buena jugada, y me hace dar una bronca porque se que lo podria haber hecho mejor","replies":[]},{"poster":"ÍLoveBlitzcrank","date":"2016-08-27T06:05:53.961+0000","up_votes":3,"down_votes":0,"body":"Venir en racha y que justo pèro justo te emparejen con cualquiera , ni yo me lo creo.","replies":[]},{"poster":"Kyousuke","date":"2016-08-27T04:48:44.783+0000","up_votes":3,"down_votes":0,"body":"estar en promo, ganar por paliza min 30-40 y por un afk y unos sub-normales que se ponen a pelear perderla","replies":[]},{"poster":"Capitana Beryl","date":"2016-08-27T06:20:05.232+0000","up_votes":4,"down_votes":1,"body":"Meterle toda la onda del mundo e intentar que sean un poco más alegres en tu equipo pero terminen diciendo que tenés retraso mental, que la partida ya estaba perdida, yendose afk, suicidandose, spammeando FF y sobre todo ver en el chat cómo se siguen puteando entre ellos cuando todos tienen la culpa por seguirla y no directamente callarse, jugar tranquilos y dar lo mejor hasta terminar la partida, porque total, si te ganan cuando das lo mejor de vos, tampoco está tan mal, yo siempre admiro cuando le meto las re ganas al juego y me ganan, les doy rival honorable (Mientras no digan Izi, ahí les doy tremendo reporte apenas termina) porque realmente la habilidad que tiene mucha genten éste juego es increíble y no es razón para enojarse, más bien, aprender de tus errores contra esa gente o qué hizo mejor que vos. ^^\n\nAh, me faltó mencionar esos autolocks en selección oculta, pero ya hay suficientes cryposts sobre eso :).\n\nSaludos{{champion:223}}.","replies":[]},{"poster":"davichost","date":"2016-08-28T00:54:29.259+0000","up_votes":2,"down_votes":0,"body":"tener lag, o peor, tener tanto lag que ves lentamente como el rival te baja la vida sin que puedas hacer nada","replies":[]},{"poster":"lanchi123","date":"2016-08-28T00:18:43.777+0000","up_votes":2,"down_votes":0,"body":"La sensación de los dedos fríos y tener escribir ''tal campeón flash 12.50''","replies":[]},{"poster":"Orgullo Noob","date":"2016-08-28T00:10:56.554+0000","up_votes":2,"down_votes":0,"body":"Jugar contra esta{{champion:86}}  mierda de gaYren.\n \nSer el jg y aunque gankeaste todas las lineas y les diste kills o asistencias igual las pierden.\n\nHacer tf al minuto 40 , con todos los enemigos muertos y que mi equipo quiera hacer baron en vez de ir a romper el nexo- inhibidores de una.Como odio eso.","replies":[]},{"poster":"lPikachu","date":"2016-08-27T19:02:03.972+0000","up_votes":2,"down_votes":0,"body":"Odio cuando la gente de mi team se hecha para abajo y vende la partida por cualquier estupidez...","replies":[{"poster":"BestAhriCuba","date":"2016-08-27T21:11:28.920+0000","up_votes":1,"down_votes":0,"body":"El tipico mid que le sacan primera sangre y ya dice \"gg surrender al 20\"","replies":[]}]},{"poster":"Zexceed","date":"2016-08-27T18:20:59.148+0000","up_votes":2,"down_votes":0,"body":"cuando se juntan los 10 en mid y no te dejan farmear {{champion:32}}","replies":[]},{"poster":"Sherpard","date":"2016-08-27T14:25:47.518+0000","up_votes":2,"down_votes":0,"body":"Jugar una ultima tf, morir y ganarla y que a tu team porque quiso boludear y no tirar el nexo que quedo pelado, hagan una contra ofensiva y termines perdiendo.\n\nAsi me paso varias veces y en una partida paso con el team contrario que 3 veces llegaron con nexo pelado e hicieron ejecucion en base, asi fue como gane esa partida.","replies":[]},{"poster":"Misery Business","date":"2016-08-27T13:22:54.165+0000","up_votes":2,"down_votes":0,"body":"Saber que estas perdiendo, llegar a un punto que no podes dar vuelta la partida hagan lo que hagan y asi y todo que te rechazen el surrender.\nPrefiero temrinar la partida y jugar otra que amargarme unos min mas sin poder hacer nada.","replies":[]},{"poster":"Young Alexis ","date":"2016-08-27T07:49:40.296+0000","up_votes":2,"down_votes":0,"body":"ganar linea , aplastar al otro top , mid , o duo bot y alfinal perder porque todo tu team perdio su linea o el mid con lag .... y despues al que le ganaste te diga izi te gane manco culi@o no teni manos etc eso me saca de casillas y no dan ganas de seguir jugando","replies":[]},{"poster":"ll Leoh ll","date":"2016-08-27T06:34:33.496+0000","up_votes":2,"down_votes":0,"body":"Las cosas que mas odio:\nPerder en top porque el enemigo tiene ignite y mi team nunca wardea para yo aprovechar mi tp.\nQue te hagan counterjg y nadie de tu team se mueva(lo peor es que después lloran porque solo farmeas para recuperarte y no gankeas).","replies":[]},{"poster":"Li Grim","date":"2016-08-27T06:18:29.069+0000","up_votes":2,"down_votes":0,"body":"Perder una partida porque las otras 2 lineas perdieron, básicamente, una linea stompeada hará un daño colateral a otra, pero ya 2 lineas stompeadas te genera una sensación de impotencia al no poder hacer mucho ante enemigos muy aventajados.","replies":[]},{"poster":"Nerwal","date":"2016-08-27T05:51:17.497+0000","up_votes":2,"down_votes":0,"body":"Ganar la linea ultra facil ir ejemplo ir en mid 7.000/0/555 en una partida de 50 min cuando todo tu team va mal, seguir tratando de carrearla, que te ganen, y el de la linea enemiga te dice: gg izi mid. Es algo irritante, algo que te da ganas de molerle el ojo a golpes si tuvieras en frente a ese pendejo que te dice izi cuando va 0/888/1","replies":[]},{"poster":"Cesth","date":"2016-08-27T04:49:24.209+0000","up_votes":3,"down_votes":1,"body":"Estar en una ranked de 50 minutos o mas.","replies":[]},{"poster":"Kishi","date":"2016-08-27T14:32:17.257+0000","up_votes":2,"down_votes":1,"body":"que se hagan los fakers por mostrar maestria 7, o que digan gg izi cuando van 0 10.. no se, tipo que me decepciona de esta comunidad..","replies":[]},{"poster":"alop55555","date":"2016-08-28T06:29:16.929+0000","up_votes":1,"down_votes":0,"body":"emparejamiento con incarreables","replies":[]},{"poster":"Yitán","date":"2016-08-28T05:15:40.949+0000","up_votes":1,"down_votes":0,"body":"que me salga todo mal en el juego","replies":[]},{"poster":"EG Ixam","date":"2016-08-28T04:57:56.188+0000","up_votes":1,"down_votes":0,"body":"No jugar, es lo que mas detesto.","replies":[]},{"poster":"Alba Mortem","date":"2016-08-28T02:48:02.802+0000","up_votes":1,"down_votes":0,"body":"Frustración.","replies":[]},{"poster":"lordeman10","date":"2016-08-27T23:58:30.342+0000","up_votes":1,"down_votes":0,"body":"cuando suporteo, hago de bait y el adc no me tira el heal","replies":[]},{"poster":"Pyke dé Limon","date":"2016-08-27T23:52:06.463+0000","up_votes":1,"down_votes":0,"body":"cuando el jg enemigo gankea y todos estan sin mana y quedaron a baja vida,\nno gankeo en toda la partida pero se llevaba todas las kills","replies":[]},{"poster":"Omba el guerreo ","date":"2016-08-27T23:24:53.028+0000","up_votes":1,"down_votes":0,"body":"1)q te roben linea y siempre tenes q ser vos el q tiene q ser el ejemplo de ir a la otra linea dejando al reverendo ***** ****** ***** con la linea q habías ganado vos limpiamente y no poder ser vos el q se va afk o lo trollea xq le arruina la partida a los demas\n2)cuando hay un troll q quiere cierta linea y después se hace la victima frente al otro equipo diciendo q  los del team somos premade\n3)cuando venís en una mala racha y todos se te quejan y te dan ganas de tirar la pantalla al piso y romperla toda\n4)cuando no te hacen caso(y no me refiero a feedear, osea q x ejemplo q le pidas ayuda con un backdoor en top y ni te responda)\n5)cuando sentís q estas haciendo algo bien y se te quejan, haciéndote quedar como el que tubo la culpa","replies":[]},{"poster":"Ranpage","date":"2016-08-27T22:49:52.167+0000","up_votes":1,"down_votes":0,"body":"em que mi team se flame unos a otros lo que todos dicen que se crea bueno 0 10 spame maestria adc pushea que nunca mi team me escucha que juguemos pasivos porque tenemos {{champion:96}} {{champion:45}} {{champion:14}} {{champion:268}} {{champion:412}} y en erly pusheando y iniciando peleas y dragones que otro amigo se crea mejor por ser mejor division que yo cuando solamente gano de las 10 ranked 2 y en esas 2 le carre y en 1 v 1 le rompo el ojete y despues dice que no le gustan los 1 vs 1 pero al parecer son especificamnte CONTRA mi no le gustan que tu team se la pase discutiendo y tu le dices que se muten todos pero no lo hacen que la gente te mande solicitud cuando carreas una ranked y solamente quieres que los carres y se aprovechan de ti TRUE story y despues se preguntan porque juego ranked solo","replies":[]},{"poster":"Ks Erwyn","date":"2016-08-27T21:48:37.295+0000","up_votes":1,"down_votes":0,"body":"Ser jg  que te hagan  un pull de mier%$ en el primer camp  aun ni termines ni el primer buffo y ya reclamen gank o te maten a pingeos...\n\nMe  ponen de los pelos que mi adc pushee solo por que si, cuando no tenemos ni ward, hechzos de invocador o nos conviene freezear, esto por lo general termina en éll muerto por un gank o iniciación rival....","replies":[]},{"poster":"Dog Bulling","date":"2016-08-27T18:49:48.265+0000","up_votes":1,"down_votes":0,"body":"Que el rival, antes de matarte, te ría de tí y te muestre su \"maestría\".\n\nO bien que tus aliados juegen agresivos contra rivales de buen early.","replies":[]},{"poster":"Rakzen","date":"2016-08-27T17:48:49.571+0000","up_votes":1,"down_votes":0,"body":"Que las {{champion:29}} spameen el ping de '' ? '' y el azul cuando mueres o haces cualquier cosa, en especial cuando los vas a ayudar y no reaccionan al gank","replies":[]},{"poster":"Ryûjin Ronin","date":"2016-08-27T10:33:49.721+0000","up_votes":1,"down_votes":0,"body":"Estar carreando una partida, cagarla y que te digan \"vendiste la partida\"\nO sea, ESTAS ACA GRACIAS A MI (?","replies":[{"poster":"Dr Lukas","date":"2016-08-27T17:42:54.987+0000","up_votes":1,"down_votes":0,"body":"Una cosa no quita la otra. xD!","replies":[]}]}]}