{"poster":"Kseyd Q","date":"2015-02-18T23:23:41.192+0000","title":"Suchen RandomSup für gemeinsame Stunden ! ( Silber )","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hey Randoms, \n\nMein Team & Ich suchen noch unseren persönlichen \"Random\" für Normals & zukünftige Rankedgames.\nIch (weiblich,24 ) & meine 3 Mates (männlich,alle 23 ), und im Elobereich auf Silber zu finden.\n\nMit uns wird es nie langweilig, und sich auchmal gegenseitig (nicht ganz ernstgemeintes )Flamen gehört bei uns einfach dazu. \nJemand dem es nur darum geht schnell in den Highelobereich zu kommen ist definitiv falsch bei uns,\ndenn Spaß steht an höchster Stelle.\nIhr solltet auch mal fuer das ein oder andere Trollgame zu haben sein,\nund nicht gleich bei einem Loss Ragequitten.\n\nVom Setup her sind wir recht flexibel und jeder denkt zumindest, das er mehrere Lanes beherrscht, auch wenn das eigentlich garnicht stimmt :DD\nAllerdings suchen wir fuer unser Mainsetup einen MainSupporter der nicht nur einen Champ beherrscht sondern entweder gewollt ist alles mal auszuprobieren,\noder aber eine große Außwahl an Champions vorzuweisen hat.\n\nIhr solltet mindestens Bronze I vorweisen können, und ebenso ein funktionierendes Headset besitzen.\nDesweiteren spielen wir nur mit Skype, und haben auch nicht vor das zu ändern.\nUnsere Onlinezeiten sind 19 - 24 Uhr unter der Woche.\nAllerdings ist der ein oder andere schon vorher oder länger online.\n\n\nBevorzugt spielen wir momentan Normals, wollen aber wenn alles klappt auf 5v5Ranked umsteigen.\n\n\nAlso wenn du denkst das du der passende Random fuer uns bist, dann meld dich Ingame oder via Skype bei mir.\n\nSkype: Kaya.jk\nIngame: Chief Kaya","replies":[{"poster":"M4ster Yi","date":"2015-02-22T15:59:36.457+0000","up_votes":1,"down_votes":0,"body":"Titten hier^!","replies":[{"poster":"Chief Stef","date":"2015-02-26T19:23:13.912+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Citoso,realm=EUW,application-id=ElKI1ocy,discussion-id=EbRW125g,comment-id=0003,timestamp=2015-02-22T15:59:36.457+0000)\n>\n> Titten hier^!\n\ngenau kaya her damit! wenn du ein nacktfoto reingestellt hättest wie ich es vorgeschlagen habe dann hätten wir schon over 9000 supporter!","replies":[]}]},{"poster":"Chief Stef","date":"2015-02-22T15:45:41.177+0000","up_votes":1,"down_votes":0,"body":"schlitz","replies":[]},{"poster":"RacerBladex","date":"2015-02-20T11:44:57.662+0000","up_votes":1,"down_votes":0,"body":"Hallo zusammen,\n\nich würde mich gerne eurem Team anschließen und  mit euch gemeinsam spielen.\n\nIch bin 23, männlich und spiele in Liga Silber 4 und würde euer Team in Rankeds 5v5 gerne verstärken.\n\nIch spiele hauptsächlich auf der Botlane als Main-Support :) und Main-ADC, Jungle sowie Toplane wäre aber bei Bedarf kein Problem, muss aber nicht sein.\nDie Zeiten fürs Zocken sind ebenso kein Problem.\n\nDas Kommunizieren via Skype ist kein Hindernis für mich und würde mich freuen, bei euch einsteigen zu dürfen.\nHeute Abend könnte ich mein Können schon gerne unter Beweis stellen :)\n\nIch werde euch adden, aber ihr könnt gern auch auf mich zukommen.\n\nSkype: racerbladex\nIngame: RacerBladex","replies":[]},{"poster":"Chief Stef","date":"2015-02-19T15:13:06.224+0000","up_votes":1,"down_votes":0,"body":"sind immernoch auf der suche nach einem echten schlitzer!\nmeldet euch randoms :D","replies":[]}]}