{"poster":"MeFsi KillEr II","date":"2017-08-04T16:57:31.261+0000","title":"Ranked Games","subforum":"Champions & Gameplay","up_votes":1,"down_votes":2,"body":"Warum wird man im Ranked gezwungen mit 4 weiteren Spielern zu spielen um aufzusteigen. Man ist zu sehr abh&auml;ngig von der Leistung seines eigenen Teams. Nat&uuml;rlich ist man selten in der Lage dennoch als einzelne Person ein Sieg f&uuml;r sein Team zu hohlen, obwohl dieses es nicht verdient, weil die anderen Spieler den Gegnern extra kills gegeben haben oder einfach ihnen das Spielverst&auml;ndnis fehlt. Meine Frage lautet nun wieso die Leistung des gesamten Teams bewertet wird und nicht die von einem selbst? Oder warum gibt es kein ranked system f&uuml;r 1vs1,wodurch dann wirklich nur die Leistung eines einzelnen Spielers bewertet wird. Mir ist bewusst, dass League of Legends ein Teamspiel ist und man abh&auml;ngig von seinem Team ist, somit muss man auch zeigen wie gut man mit seinem Team zurecht kommt. Jedoch kann dies vor allem im Ranked zum Problem werden, wo eigentlich seine eigene Leistung bewertet wird und nicht sein Gl&uuml;ck keine Botlane,Toplane etc. zu bekommen, die die Gegner zum Sieg f&uuml;hren in dem sie zu oft sterben, da sie entweder nicht genug Spielverst&auml;ndnis haben oder es mit Absicht machen. Meine Bitte lautet, dass man Ranked unabh&auml;ngiger von seinem Team machen soll, da in meinen Augen das Ranked dazu da ist um zu sehen wie gut man selber ist in Lol und nicht wie viel Gl&uuml;ck du heute hast um ein gutes Team zu bekommen. Es w&uuml;rde viel helfen wenn man zum Beispiel Lp bekommt abh&auml;ngig von seiner Leistung im Spiel und nicht ob man gewinnt oder verliert. Somit werden gute Spieler die ein schlechtes Team abbekommen haben dennoch belohnt obwohl sie verloren haben, da das Team ihn runtergezogen hat.Eine weitere M&ouml;glichkeit w&auml;re es ein 1vs1 Modus einzuf&uuml;hren, der auch wie ein 5vs5 gewertet wird.In diesem Modus k&ouml;nnt man nun sein K&ouml;nnen zeigen und dies w&auml;re auch nun unabh&auml;ngig von anderen Leuten.Hier kommt es allein darauf an wie gut man selber ist.","replies":[{"poster":"Pandeonor","date":"2017-08-05T10:29:49.580+0000","up_votes":1,"down_votes":0,"body":"Ein 1 vs 1 mit Torwart gegen Vorstopper oder Mittelfeldspieler macht auch wenig Sinn beim Fußball. ☺ Janna main gegen Pantheon main oder Zed Main im 1vs1 - ernsthaft jetzt als \"das ist fair\" für die LP-Vergabe?\n\nDas korrekte bewerten der Leistung eines Einzelspielers beim Fussball ist nahezu unmöglich. ☺ Versuche einmal das verhindern eines Tores (Ball wegschiessen oder Mann als Anspielstation gedeckt .... ähnlich warden) o.ä. festzustellen.\n\nDas funktioniert nicht oder nur mit Abstrichen welche zu gleichen oder ähnlichen Verwerfungen und Problemen führt wie bisher auch.\n\n\nDas kann man machen wenn es eine Zed-Rangliste gibt und man Zeds gegen Zeds im 1 vs 1 ins Rennen schickt. Das ist in etwa so interessant wie Elfmeterschiessen zweier Stürmer gegeneinander. \n\n\nWell. ich habe eben auch wieder einmal als Sup verloren weil mich \"das Team heruntergezogen\" hat. Es ist Tank-Meta und Midlaner sowie  ADC war nicht so gut wie die gegnerische Tank-Flotte. Ich stand 1-0-1 und 3-1-3 während Yasuo 0-2-2 hatte und dann ging es so \"all mid\" wieder und wieder. \"Beste\" Gegnerin war Jinx, aber die wurde (das war mein Tod - die 1 bei 3-1-3) gefeeded (mit einem völlig unnötigen triple-kill) durch einen verfehlten Gank weil der Jungler einfach nicht warten wollte bis ich wieder am Turm war. Jinx - ansonsten nicht überragend - letztendlich 20 Kills weil Rest weggetankt und Ende Gelände. Die hätten wir m.E. locker an die Wand spielen müssen wenn es nach mir gegangen wäre.\n\nFaires bewerten geht nicht wirklich. Ich habe 5-8-12 am Ende, müsste aber eigentlich(tm) eine bessere Wertung als die Jinx erhalten. Davon abgesehen gibt es early-game Champions und late-game Champions mit unterschiedlichen Resultaten early/late je nach Spielverlauf.","replies":[]},{"poster":"Humpelstilzche","date":"2017-08-04T17:08:21.012+0000","up_votes":1,"down_votes":0,"body":"> Es würde viel helfen wenn man zum Beispiel Lp bekommt abhängig von seiner Leistung im Spiel und nicht ob man gewinnt oder verliert.\n\nOb du gewinnst oder verlierst IST deine Leistung. \nDein Rang dient dazu, dich in faire Spiele einzuordnen. Fair bedeutet, dass beide Teams die gleiche Chance haben, zu gewinnen. Ergo ist es nur logisch, die Spieler an exakt dieser Fähigkeit zu messen: Die Fähigkeit das Spiel zu gewinnen. \nAlles andere, also mechanics, KDA, CS usw sind lediglich Teil dieser Fähigkeit, aber einzeln nicht viel wert und völlig untauglich um darauf basierend faire Matches zu gestalten. \n\nUnd zu deiner Umfrage: Auf keinen Fall. LoL ist ein Teamspiel, es gibt hier kein \"unabhängig vom Team\". Das Team und die Fähigkeit damit umzugehen ist das, worum sich in LoL alles dreht. Wenn du teamunabhängig spielen willst, hast du dir mir LoL schlicht und einfach das falsche Spiel ausgesucht.","replies":[{"poster":"Pilze","date":"2017-08-05T09:35:32.157+0000","up_votes":1,"down_votes":0,"body":"Jetzt überlege mal selber was du da gerade geschrieben hast!? Erst sagst du das es seine eigene Leistung ist die das Spiel entscheidet und im gleichen Text sagst du das es ein Teamspiel ist. Paradox oder?\nDas ist nämlich das Problem was LoL hat, man muss kein Challenger sein um das Spiel zu verstehen. Was den Challenger vom Bronze unterscheidet ist lediglich die Anpassung an das Team und wie gut er mit den Leuten zusammen spielen kann. Alles andere ist reine Logik die leider komplett auf der Strecke bleibt, alle glauben man muss ein Talent haben oder es gibt ein Geheimnis um es gut spielen zu können. Dem ist nicht so. Ist genauso wie im richtigen Sport ( bin Training ) alle glauben das es immer ein Geheimnis oder etwas besonderes gibt, was totaler Blödsinn ist.","replies":[]}]},{"poster":"Lagging4Freedom","date":"2017-08-04T17:01:47.631+0000","up_votes":1,"down_votes":1,"body":"Du darfst nicht vergessen, dass dieses Spiel nicht nur aus der Laningphase besteht. Auch wenn alle Lanes inten, kann das Spiel durch gute Koordination und Teamplay immer gewonnen werden. Es geht um Teamplay und nicht um 1v1. Es wird praktisch bewertet wie gut du dich ins Team einbringen kannst und wie teamfähig du bist und wie gut du dein Team leiten kannst.","replies":[]}]}