{"poster":"elledian","date":"2019-11-21T21:28:48.021+0000","title":"Welcome to League of Dragons","subforum":"Jugabilidad, balance y narrativa","up_votes":9,"down_votes":3,"body":"El equipo enemigo dos inhi abajo una ventaja de 22 kill para nosotros.. el equipo enemigo nos regalaba torres solo para rushear dragones y defender torres tier 3...solo que ninguno pensaba que los dragones eran tan importantes ahora...se que fue ignorancia nuestra pero como teniamos lineas ganadas y una ventaja importante no pensamos que era tan asi...la cuestion es que el equipo enemigo rusheo el quinto dragon y ancestral mientras nosotros haciamos baron y tirabamos su tercer inhi y muchachos se termino la partida literalmente y nuestra amplia ventaja nos la metimos en el or...moraleja de mi desgracia gente..rusheen dragones como prioridad.. no importa que pierdan linea y que les tiren todo que eso ya no importa en este jueguito..welcome a League of Dragons donde la finalidad del juego no es tirar el nexo enemigo si no que es matar muchos dragones...dejen baron y torres free mientras su unico plan de juego que tenga su equipo sean los dragones que si en una de esas llegan a coleccionar 5 dragones como pokemons evolucionan de mancos a Fakers y sin tirar nunguna habilidad solo con el click derecho onshotean a todos..repito fue ignorancia y asi lo pagamos pero paso de jugar a Farm Dragon simulator que es lo que rito esta haciendo","replies":[{"poster":"Bloshan","date":"2019-11-21T22:51:47.127+0000","up_votes":7,"down_votes":0,"body":"Si tenian ventaja no entiendo como ustedes no rusheaban los dragones XDD. Todo bien con que esten fuerte sy bla bla bla. Pero se mandaron tremenda manqueada, teniendo ventaja en kills y en oro no sacaron dragones? Mmmm","replies":[{"poster":"elledian","date":"2019-11-21T23:39:22.896+0000","up_votes":2,"down_votes":3,"body":"Aclare que fue error nuestro por no prestar atencion que el parche cambiaba el juego a farm dragon simulator....y comente que ellos nos regalaban torres por los dragones mas su jungla y heraldo...lo que ellos si hacian bien era defender las ultimas torres pero cuando salia un dragon nos regalaban denuevo torres y farm...la hicieron bien pensamos que la teniamos ganada facil cosa que no...ellos jugaron como se tiene que jugar este juego de matar dragones y defender porque esto ya no es league of legend..aparte sus campeones ayudaban mucho a su juego..aparte de tener 4 tp en su equipo cosa que lo vimos raros pero bueno jugaron bien y para nada nos tilteamos..si que nos sorprendimos de que completar los dragones te da la victoria asegurada a un nivel que no vi nunca en este juego","replies":[]}]},{"poster":"SeanFelices","date":"2019-11-21T22:42:54.449+0000","up_votes":7,"down_votes":0,"body":"Como es que teniendo tanta ventaja no hacen los dragones ustedes? Osea, en que cabeza cabe dejar los dragones de lado en esta jungla como la anterior.\n\nPerdieron como los peores.\n\nSaludos .","replies":[]},{"poster":"Mazoku","date":"2019-11-21T21:39:19.421+0000","up_votes":5,"down_votes":0,"body":"Si te hacen los dragones en la cara y tenes una ventaja abismal claramente no es que los drags esten fuerte si no que el team enemigo planteo mejor la partida.\n\nSuerte!","replies":[{"poster":"elledian","date":"2019-11-21T23:54:31.982+0000","up_votes":1,"down_votes":1,"body":"Totalmente de acuerdo...pasa que por ignorancia o como quieras llamarlo preferimos objetivos de torres y escalado que ellos dejaban free solo cuando salia un drake...ellos tenian 4 tp listos para apenas salir ya ganarnos terreno pero no nos importo ya que teniamos objetivos gratis como te dije...sus campeones eran buenos para defender en desventaja y limpiar rapido..jugaron como se tiene que jugar ahora este juego y lo acepto...yo para jugar a matar dragones me voy al wow..{{sticker:slayer-pantheon-thumbs}}","replies":[]}]},{"poster":"3rd ban inc","date":"2019-11-22T01:46:06.132+0000","up_votes":2,"down_votes":0,"body":"lo ganaron por el elder, no por hacer dragones. Yo jugue una partida donde hice todos los dragones, saque alma y baron, pero nos robaron el elder y terminamos perdiendo solo x el elder, ridiculo","replies":[]},{"poster":"ShadØwCool","date":"2019-11-21T23:54:39.251+0000","up_votes":2,"down_votes":0,"body":"Eso de ejecutar a los enemigos con menos del 20% me parece demasiado exagerado, ayer estaba jugando ashe y el enemigo tenía un garen re feed pero como yo estaba full build le entré a pegar  cuando le quedó 20% de vida salió el escupitajo del dragón y me tomó como 10 segundos procesar quién me había hecho el ks, por otro lado tendría que ver la replay pero me pareció ver que el golpe ese del dragón ignoró el sterak que tenía el garen ._. pero capaz que me equivoqué yo en eso","replies":[{"poster":"Liche Vam","date":"2019-11-22T00:04:36.857+0000","up_votes":2,"down_votes":0,"body":"si, ignora el sterak y todos los escudos salvo invulnerabilidades como r taric kayle","replies":[]}]},{"poster":"Haxiing","date":"2019-11-21T23:34:41.882+0000","up_votes":2,"down_votes":0,"body":"No es que ahora se base en matar dragones, es que el team enemigo aprovecho que ustedes no sacan los drakes. tanta ventaja para eso?","replies":[]},{"poster":"IvVicious","date":"2019-11-21T22:49:00.331+0000","up_votes":2,"down_votes":1,"body":"No saben balancear el juego sin meterle MÁS presión a la botlane, una cagada este juego.","replies":[]},{"poster":"Kłaytøn","date":"2019-11-21T22:38:29.434+0000","up_votes":2,"down_votes":1,"body":"Es preseason... igualmente si tanta ventaja tenían se supone que los dragones los deberían tener ustedes si son los que tienen el control del mapa, por otra parte el Dragon Anciano si me pareció algo broken viendo algunos clips, tampoco puedo opinar mucho porque no jugue un game aún.","replies":[]},{"poster":"kid shadow","date":"2019-11-21T23:19:12.098+0000","up_votes":1,"down_votes":0,"body":"La verdad estan broken los dragons, pero es el nuevo planteo de rito de cara a la siguiente season. Ahora lo que hicieron fue un error garrafal de noob jajaja","replies":[]},{"poster":"MadnessDay","date":"2019-11-21T21:55:24.165+0000","up_votes":2,"down_votes":2,"body":"Que tilteado quedaste xd","replies":[{"poster":"elledian","date":"2019-11-21T23:46:30.038+0000","up_votes":1,"down_votes":1,"body":"jajaja en ese momento tenias que ver mi cara de WTF el que va 3/11 me mato de un basico...ooook nice game","replies":[]}]}]}