{"poster":"Azima","date":"2017-09-20T12:35:05.271+0000","title":"Das Nest","subforum":"Allgemeiner Chat","up_votes":8,"down_votes":0,"body":"10 KM entfernt von Drispolis. Wildnis.\r\n\r\nEs ist st&uuml;rmisch und verregnet. Mutig und mit dem letzten bisschen Kraft die ihm geblieben ist, k&auml;mpft er sich seinen Weg durch den Sturm und das Dickicht. &bdquo;Aufgeben kommt nicht in Frage! Ich schaffe das&ldquo;!\r\nUmzingelt von dem hohen Gr&uuml;n, war er dem Irrglauben verfallen vor dem Wetter gesch&uuml;tzt zu sein. Er hatte seine Mission um jeden Preis erf&uuml;llen wollen und so st&uuml;rzte er sich voller Adrenalin in ein Abenteuer. Sein volles Haar war durchn&auml;sst und klebte ihm am Kopf. Kleidung trug er keine, dass tat er nie, die behinderte ihn nur in seiner Freiheit. Wozu brauchte er auch schon Kleidung. Regentropfen gelangten hin und wieder in seine Augen und sorgten f&uuml;r etwas Schmerz f&uuml;r den Bruchteil einer Sekunde. Doch er blinzelte den Schmerz und das Regenwasser weg und rannte. Rannte auf sein Ziel zu, wich Hindernissen aus und Sprang &uuml;ber Felsen die ihm den Weg versperren wollten.\r\n**SCHNELLER!** Ein Wesen das er noch nie zuvor gesehen hatte flog auf ihn zu. Gelbe und schwarze Streifen zierten seinen K&ouml;rper. Majest&auml;tische Fl&uuml;gel schlugen so schnell, dass er sie nur schemenhaft wahrnehmen konnte. Gro&szlig;e schwarze Augen nahmen ihn ins Ziel. Facettenaugen wie er bei genauerem hinsehen bemerkte. Er machte ihre Waffe aus. Einen riesigen Stachel am hinteren Teil des K&ouml;rpers, bereit jeden Moment zu zuschlagen. Er rannte auf das Wesen zu f&uuml;r das er sp&auml;ter unbedingt einen Namen finden musste. So erschreckend und gef&auml;hrlich es aussah, so sehr faszinierte es. Im aller letzten Moment, kurz vor einem Zusammenprall warf er sich zu Boden und rutschte unter dem wilden Tier durch. Es war so verwirrt, dass nach einem ungl&auml;ubigen Blick zur Seite nur noch ein Aufprall auf einen Felsen folgte, welcher f&uuml;r den ben&ouml;tigten K.O. Schlag sorgte. Einen kurzen Moment blieb er liegen, doch der Matsch f&uuml;hlte sich bei weitem nicht so gut an wie das, was er von zuhause kannte. Er rappelte sich auf, k&auml;mpfte sich wieder auf alle Viere und sch&uuml;ttelte sich kr&auml;ftig. Umgehend begann er wieder zu rennen, war sich sicher es nicht mehr weit zu haben. Doch tats&auml;chlich absch&auml;tzen konnte er es nicht. Zu versperrt war seine Sicht, all das hohe Gr&uuml;n machte seine Umgebung d&uuml;ster und tr&uuml;bte seine Augen.\r\nAls sich die ersten kleinen Zweifel breit machen wollten, sah er es. Es war nicht viel, doch es war da. Gen Himmel zeichnete sich ein feiner Streifen aus rotem und goldenem Licht ab. Durch den Regen der nun etwas feiner geworden war, sah es aus als w&uuml;rden feine Kirstallst&uuml;cke &uuml;ber die kr&auml;ftigen Farben rieseln. Fasziniert verlangsamte er seine Schritte. Am unteren Ende war es ein tiefes Rot, dass immer um einige Nuancen heller wurde, desto h&ouml;her es in den Himmel aufstieg. In der Mitte endete es in einem kr&auml;ftigen Orange, erhellte sich ebenfalls und endete in einem leuchtendem Gold das den Himmel zum strahlen brachte wie man es nur selten sah. Ihn k&uuml;mmerte nun gar nichts mehr. Nicht seine Schmerzenden F&uuml;&szlig;e, der Regen der ihm in den Augen gebrannt hatte. Das Fell was ihm am gesamten K&ouml;rper klebte. Langsam ging er auf einen Felsen zu und erklomm ihn mit dem Wissen sein Ziel erreicht zu haben. Tiefe Atemz&uuml;ge nehmend, genoss er fast schon das Ziehen in seinen beiden Vorderpf&ouml;tchen. Oben angekommen sch&uuml;ttelte er sich kr&auml;ftig. Frischer Wind wehte ihm ins Gesicht. Er schloss die Augen und nahm einen tiefen Atemzug. **ENDLICH!**\r\n\r\nEr &uuml;berblickte eine kleine Siedlung, die voll war von Wesen wie ihm. Klein, flauschig und einer mutiger als der andere. Hier stand er nun, erf&uuml;llt mit Stolz. Stolz die Strapazen und Gefahren auf sich genommen zu haben. Stolz ein Teil von all dem zu sein was er hier erblickte. Eine Gemeinschaft, eine Familie aus kleinen flauschigen Helden. Voller Stolz und Liebe &uuml;berblickte Knuffel QBert sein Nest und trottete mit vor Stolz geschwollener Brust Richtung Zuhause.","replies":[{"poster":"Qbert","date":"2017-09-20T13:07:59.662+0000","up_votes":2,"down_votes":0,"body":"Das mag ich! :)\n\nFür alle die überlegen was ich bin, hier ein paar Tipps die über das oben geschrieben hinaus gehen.\nIch habe zwei Hörner und einen herzförmigen Bauch. :D","replies":[{"poster":"Azima","date":"2017-09-20T13:15:50.969+0000","up_votes":1,"down_votes":0,"body":"Vielleicht mach ich doch eine eigene Spezies aus \"Knuffel\" .-. und du wirst nicht als Poro enden","replies":[{"poster":"Qbert","date":"2017-09-20T13:19:48.861+0000","up_votes":2,"down_votes":0,"body":"Wieso nicht?\nIch mag Poros, sie sind toll und unkaputtbar. Und mal ehrlich, wer mag Poros nicht?","replies":[{"poster":"Azima","date":"2017-09-20T13:22:59.836+0000","up_votes":1,"down_votes":0,"body":"Hmmm, Recht hast du ja. Aber dann läufst du auch Gefahr gejagt zu werden :o von Groupies und so. Das muss dir dann bewusst sein.\n\nP.S.\n:3 Ganz ohne epische Tippfehler. Yeay!","replies":[{"poster":"Qbert","date":"2017-09-20T13:25:20.440+0000","up_votes":1,"down_votes":0,"body":"Oh nein .... Hilfe .... Frauen rennen mir hinterher .... wie schlimm!\n\n{{sticker:sg-lux-2}}","replies":[{"poster":"Azima","date":"2017-09-20T13:49:22.141+0000","up_votes":1,"down_votes":0,"body":"Groupies sind keine Frauen mehr. Aber okay. Dann lass dich jagen. Ich hab dich gewarnt.","replies":[{"poster":"Qbert","date":"2017-09-20T16:32:02.068+0000","up_votes":1,"down_votes":0,"body":"Die Kerle kann ich ignorieren .... :P","replies":[{"poster":"Azima","date":"2017-09-20T17:12:41.972+0000","up_votes":1,"down_votes":0,"body":"Im Endeffekt gehörst du eh mir, weil ich dich als Stern am Himmel hab aufsteigen lassen :p xD\n\nUnd wenn Mädchen/ Frauen zu Groupies werden, ist das gleich zu stellen mit einer Entwicklung in richtung Höllenwesen. Blutrünstige Monster die dich überall hin verfolgen und dir nachstellen, bis du völlig Wahnsinng geworden bist D:","replies":[{"poster":"Qbert","date":"2017-09-21T05:11:41.730+0000","up_votes":1,"down_votes":0,"body":"Ich gehöre dir? Oha, lass das mal mein Weibchen zu Hause hören o__o\n\nGlaub mir, Groupies sind gar nicht so schlimm, man gewöhnt sich an alles ... und zur Not, zieht man einfach an den Nordpol. :]","replies":[{"poster":"Azima","date":"2017-09-21T06:22:40.201+0000","up_votes":1,"down_votes":0,"body":"Mit der hab ich schon gesprochen :3 und wir haben sogar zusammen Kakao getrunken! Da geht was sag ich dir.\n\nSie mag einen gewissen Anteil des Gewinns haben, aber sonst ist sie einverstanden. Ich soll halt nur aufpassen mit Entführungen und so. Das mit den Groupies fand sie auch nicht so toll, weil sie anscheinend deren dunklen Seite kennt. Sie hatte mal mit welchen in Griechenland zu tun vor ein paar Jahren. Wirklich schlimme Sache.\n\nVIP Bonus wollte sie auch bei Veranstaltungen jeglicher Art. Aber das wird locker geregelt {{sticker:katarina-love}}","replies":[{"poster":"Qbert","date":"2017-09-21T06:23:44.475+0000","up_votes":1,"down_votes":0,"body":"o_o\nNun habe ich etwas Angst.\n\nIch werde hier verscherbelt! D:","replies":[{"poster":"Azima","date":"2017-09-21T06:30:44.234+0000","up_votes":1,"down_votes":0,"body":"Tut mir leid D: Aber wenn man aus etwas (oder jemandem) Geld machen kann ...\n\nIhr Kakao war übrigens ziemlich heiß 8-)","replies":[{"poster":"Qbert","date":"2017-09-21T09:16:32.160+0000","up_votes":1,"down_votes":0,"body":"jaja, so sind die Frauen! .... ja der Kakao ist immer heiß ;P","replies":[{"poster":"Azima","date":"2017-09-21T10:07:33.521+0000","up_votes":1,"down_votes":0,"body":"Da war ein lachender zwinker Smiley hinter!","replies":[]},{"poster":"Qbert","date":"2017-09-21T09:57:13.898+0000","up_votes":1,"down_votes":0,"body":"Bösewicht? Tut mir leid, ich bin weich und flauschig, ich kann nicht böse sein.","replies":[]},{"poster":"Azima","date":"2017-09-21T09:20:55.894+0000","up_votes":1,"down_votes":0,"body":"Meiner war aber extra heiß! NIMM DIES BÖSEWICHT! ;D\n\nIhr Männer habt uns doch auch über Jahrhunderte verkauft und tut es immer noch xD irgendwie muss das ausgeglichen werden :p","replies":[]}]}]}]}]}]},{"poster":"Dr Madscientist","date":"2017-09-20T17:16:07.135+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Azima,realm=EUW,application-id=YnZkMR0R,discussion-id=3a7rYZ9j,comment-id=00010000000000000000000000000000,timestamp=2017-09-20T17:12:41.972+0000)\n>\n> \n> Und wenn Mädchen/ Frauen zu Groupies werden, ist das gleich zu stellen mit einer Entwicklung in richtung Höllenwesen. Blutrünstige Monster die dich überall hin verfolgen und dir nachstellen, bis du völlig Wahnsinng geworden bist D:\n\n\nUnd....was genau unterscheidet weibliche Groupies nun von regulären Blutrünstigen Hollenwesen...ähm....Frauen?","replies":[{"poster":"Azima","date":"2017-09-20T17:36:39.203+0000","up_votes":1,"down_votes":0,"body":":o Wenn sie zu Groupies werden, kann man es nicht mehr rückgängig machen und sie können es selbst nicht mehr kontrollieren. So was wie eine nicht umkehrbare Mutation.\n\n\"Regulär\" können sie je nach Bedarf/ Situation zwischen ihren Formen wechseln und ihr Gegenüber mit ihrem Verhalten manipulieren. Aber man darf nicht vergessen das es auch hier Ausnahmen gibt. Exemplare die nicht von den Mächten der Hölle berührt wurden und ein normales Dasein führen. Reine Exemplare gibt es jedoch tatsächlich seltener als Mischwesen.\n\nSo wurde es zumindest erklärt in dieser Doku die ich vor Jaaaaahren mal gesehen habe. Die musste vernichtet werden, weil sie zu viel Preis gegeben hat. :\\ Das fand man an gewissen Stellen nicht so toll. Ich lebe mit diesem Wissen täglich in großer Angst!","replies":[]}]}]}]}]}]}]}]}]},{"poster":"Eibert Rümmel","date":"2017-09-21T18:57:13.085+0000","up_votes":1,"down_votes":0,"body":"Du bist ein Bert. Und gemeinsam sind wir die Rasse der Berts ;)","replies":[{"poster":"Qbert","date":"2017-09-22T04:54:11.239+0000","up_votes":1,"down_votes":0,"body":"Das stimmt wohl.\nUnd wir Berts sind klein, rund, weich und flauschig. :)","replies":[]}]}]},{"poster":"Eibert Rümmel","date":"2017-09-22T13:12:22.919+0000","up_votes":1,"down_votes":0,"body":"euer Einverständnis ist optional :P Trotzdem freut es mich, dass ihr die idee genauso klasse findet wie ich ;)\n\nIch hätte Azima ja gern selbst geheiratet, aber mein Herz gehört ja schon superkahlan. Dann soll sie wenigstens ein Bert bekommen ;)","replies":[]},{"poster":"Eibert Rümmel","date":"2017-09-21T15:43:09.609+0000","up_votes":1,"down_votes":0,"body":"Macht meines Amtes als temporär lebender geislicher Geist ernenne ich euch zu Knuffel und Frau. Maexle, der Weddingplaner wird ein fest für euch organisieren","replies":[{"poster":"Qbert","date":"2017-09-22T06:03:24.313+0000","up_votes":1,"down_votes":0,"body":"{{sticker:sg-ahri-1}}","replies":[{"poster":"Azima","date":"2017-09-22T06:13:24.084+0000","up_votes":1,"down_votes":0,"body":"ahahahahaha Das dachte ich mir.\n\nAber falls es dich beruhigt, gestern hab ich dem Vorhaben nicht (NIIIIIIIICHT!) zugestimmt, als er damit um die Ecke kam :o","replies":[{"poster":"Qbert","date":"2017-09-22T06:29:05.870+0000","up_votes":1,"down_votes":0,"body":"wieso redet ihr darüber? >.< Ich bin doch kein Markt-Gut!\nIch fühle mich als Mitglieder der Bert-Familie durch Eibert total betrogen :(","replies":[{"poster":"Azima","date":"2017-09-22T06:34:44.705+0000","up_votes":1,"down_votes":0,"body":"\"Darüber reden\" würde ich es nicht nennen. Es klang mehr wie ein Beschluss :< Frag ihn! Ich hab ihm gesagt du würdest es hassen!","replies":[{"poster":"Qbert","date":"2017-09-22T06:36:50.484+0000","up_votes":1,"down_votes":0,"body":"gib's doch zu, du warst federführend!","replies":[{"poster":"Azima","date":"2017-09-22T06:51:38.328+0000","up_votes":1,"down_votes":0,"body":"Diesmal wollte ich dich wirklich nur beschützen\n{{sticker:sg-soraka}}","replies":[{"poster":"Qbert","date":"2017-09-22T07:03:05.615+0000","up_votes":1,"down_votes":0,"body":"Das ist lieb gemeint, aber danke, ich kann mich sehr sehr gut allein beschützen. Sowohl physisch als auch psychisch bin ich dazu hervorragend in der Lage. {{sticker:sg-ahri-2}}","replies":[{"poster":"Azima","date":"2017-09-22T07:08:36.290+0000","up_votes":1,"down_votes":0,"body":"Kann sein :< trotzdem wollte ich meinen kleinen Knuffel vor Eiberts Plan schützen. Aber.. er hat es wohl erst getan und dann gefragt xD\n\nIn was für einen Haufen Mist ich dich geritten habe BibleThump","replies":[{"poster":"Qbert","date":"2017-09-22T07:11:19.498+0000","up_votes":1,"down_votes":0,"body":"Keine Sorge, alles gut :D Qbert lässt sich nicht unterkriegen - NIEMALS!","replies":[{"poster":"Azima","date":"2017-09-22T07:20:41.264+0000","up_votes":1,"down_votes":0,"body":"*Porosnacks zu werf\n\nBraves Kerlchen","replies":[{"poster":"Qbert","date":"2017-09-22T07:22:39.254+0000","up_votes":1,"down_votes":0,"body":"weeeeeeeee *rumtanz*","replies":[{"poster":"Azima","date":"2017-09-22T07:36:26.379+0000","up_votes":1,"down_votes":0,"body":"Ein tanzender Poro hätte mich fast aufgemuntert´\\ö/`","replies":[{"poster":"Azima","date":"2017-09-22T10:26:47.442+0000","up_votes":1,"down_votes":0,"body":"Verständlich .-. wenn man noch eine Win-Möglichkeit sieht obwohl die anderen schon aufgegeben haben, kann das schon mal ausarten. Man spielt ja dann vom Mindset her 1v9. Du musst gegen 5 Leute spielen die sich schon sicher fühlen und hast dann noch vier Leute die nur schwarz sehen.\n\n:D Manche brauchen eben einfach Ruhe um sich nochmal richtig auf das Spiel fokusieren zu können. ^^ War dann halt blöd das die Tristana so was gesagt hat ;D aber wer weiß wie lange du deinem Team damit in den Ohren gelegen hast :DDDD\n\nT-35Minuten! + eine Aushilfe die mir bestimmt in ca. 15Minuten schon auf die Nerven gehen wird xD","replies":[]},{"poster":"Qbert","date":"2017-09-22T10:18:46.152+0000","up_votes":1,"down_votes":0,"body":"ich glaube ich war übermotivierend :(\n\nAber ich wollte nun mal nicht aufgeben >.<\n\nCountdown bis zum Feierabend: T-10min","replies":[]},{"poster":"Azima","date":"2017-09-22T10:07:28.020+0000","up_votes":1,"down_votes":0,"body":"xD haha, ja ... so was kann passieren. Mich nerven so Leute die dann permanent etwas spamen xD die sind fast so schlimm wie flamer :D \"übermotivieren\" kann die Leute auch ganz schön tilten.\n\nAber so zwischendurch ein paar motivierende Sätze oder Ansagen sind eigentlich okay .-.","replies":[]},{"poster":"Qbert","date":"2017-09-22T09:49:04.724+0000","up_votes":1,"down_votes":0,"body":"ÜBRIGENS!\nFällt mir gerade ein...\n\nIch wurde gestern doch tatsächlich in-game geflamet weil (ACHTUNG).... ich zu positiv war!\nMein letztes Spiel gestern, ich als Lulu unterwegs mit einer Tristana bot ... das Early lief extrem schlecht für mein Team :( und ich hab (zugegebenermaßen) sehr viel geschrieben wie \"los kommt, vergesst den fight, weiter geht's\" \"wir schaffen das\" \"passt auf, bleibt zusammen, wir bekommen das hin wenn wir clever spielen\" ... und irgendwann sagte die Tristana wirklich frei übersetzt \"halt's maul, du nervst mit deiner überpositiven Art\" ....\n\nund was ist?\nGewonnen. \n\n{{sticker:sg-lulu}}","replies":[]},{"poster":"Azima","date":"2017-09-22T09:18:06.516+0000","up_votes":1,"down_votes":0,"body":"Die waren mal auf einem Wohnbereich in einem Innenhof. Richtig schöne große Voliere für vier Wellensittiche. Dann haben sich Angehörige beschwert die Vögel müssten rein, dass wäre zu kalt. Also hat man sie rein geholt. Einer ist flöten gegangen und die anderen drei sind jetzt bei mir an der Rezeption xD Und frag mich nicht wieso ... aber sie sind immer noch hier. Fast ein Jahr jetzt. Hab ihnen zwar noch keine Namen gegeben, aber ich kenne mittlerweile ihre Verhaltensmuster in verschiedenen Situationen xD","replies":[]},{"poster":"Qbert","date":"2017-09-22T08:25:12.705+0000","up_votes":1,"down_votes":0,"body":"....was zur Hölle haben Wellensittiche bei euch verloren??","replies":[]},{"poster":"Azima","date":"2017-09-22T08:21:07.723+0000","up_votes":1,"down_votes":0,"body":"So nah und doch so fern xD\n\nVor allem kann ich freitags eigentlich eher entspannen und langsam meine eigenen Sachen erledigen bis der Tag vorbei ist xD Ausgerechnet heute spiel ich aber noch Telefonzentrale für unsere Pflegedienstleitung, weil er erst gegen 12 kommt D:\n\nDie Wellensittiche drehen auch am Rad >.<","replies":[]},{"poster":"Qbert","date":"2017-09-22T08:12:21.451+0000","up_votes":1,"down_votes":0,"body":"na siehst du, Ziel in Sicht!\nIch hab auch noch 2h 18min :D","replies":[]},{"poster":"Azima","date":"2017-09-22T08:02:34.212+0000","up_votes":1,"down_votes":0,"body":"Die Snacks sind für dich! Ich müsste mich nur irgendwo hinlegen können zum schlafen x.x Drei Stunden noch, dann ist es vorbei!","replies":[]},{"poster":"Qbert","date":"2017-09-22T07:58:46.547+0000","up_votes":1,"down_votes":0,"body":"Ohje ohje, dann behalte die Porosnacks lieber für dich, du brauchst sie mehr!","replies":[]},{"poster":"Azima","date":"2017-09-22T07:56:51.220+0000","up_votes":1,"down_votes":0,"body":"Hab auch versucht mich drauf zu freuen. Aber heute bin ich dezent weinerlich D: und dann sagt mir einer vom Pflegepersonal auch noch das ich ihm auf den Keks gehe weil ich so oft anrufe xD auch wenn das Spaß war, ich hätte wirklich fast geweint!\n\nDer Schlafmangel macht sich langsam doch bemerkbar ^^","replies":[]},{"poster":"Qbert","date":"2017-09-22T07:48:43.041+0000","up_votes":1,"down_votes":0,"body":"nanü, nicht gut drauf? es ist doch FrrrRrRrReeitaaaaaaaaaag >:D","replies":[]}]}]}]}]}]}]}]}]}]}]}]}]},{"poster":"Azima","date":"2017-09-22T05:55:50.126+0000","up_votes":1,"down_votes":0,"body":"xD Öhm .. wie sieht es mit dem Einverständnis beider Seiten aus?","replies":[]}]},{"poster":"Kind Prow","date":"2017-09-20T12:53:50.151+0000","up_votes":1,"down_votes":0,"body":"Qbert ist ein Poro?","replies":[{"poster":"Qbert","date":"2017-09-21T06:25:13.098+0000","up_votes":1,"down_votes":0,"body":"Ja, ja vielleicht. ABER NUR VIELLEICHT!","replies":[]},{"poster":"Azima","date":"2017-09-20T12:56:56.157+0000","up_votes":1,"down_votes":0,"body":"Ich bin noch nicht sicher ob ein Poro oder ob \"Knuffel\" eine eigene Spezies ist ._.","replies":[]}]}]}