{"poster":"Istehz","date":"2019-05-22T03:47:13.924+0000","title":"Stuck on \"Authenticating\"","subforum":"Help & Support (OCE)","up_votes":1,"down_votes":0,"body":"Anyone know what I can do to fix it?","replies":[{"poster":"Mindstar","date":"2019-05-22T14:56:28.990+0000","up_votes":1,"down_votes":1,"body":"Hi folks\n\nIt appears there haven't been many more updates tonight from Optus, although there are some reports on social media that internet access is improving in **some areas**.  Check back in the morning, and we'll keep you updated with what we know.\n\nCheers\nMindstar","replies":[{"poster":"Supercrate612","date":"2019-05-24T09:20:24.333+0000","up_votes":1,"down_votes":0,"body":"The audio chat is not working and i purchased rp and all my rp is gone","replies":[]},{"poster":"Mindstar","date":"2019-05-23T12:26:12.118+0000","up_votes":1,"down_votes":1,"body":"Hey folks\n\nIt looks like from most of the reports (or lack thereof) that many League players have things working again.  Let us know if the issues are still happening for you.\n\nCheers\nMindstar","replies":[]}]},{"poster":"Umeshu Soda","date":"2019-05-23T08:45:15.865+0000","up_votes":1,"down_votes":0,"body":"I can get past the champion select screen but I cannot load into the game. Just gives me a black screen with a connection failure error.","replies":[{"poster":"Umeshu Soda","date":"2019-05-23T09:35:38.901+0000","up_votes":1,"down_votes":0,"body":"Nevermind.\n\nWindows Update and had hextech tool repatch the game. Now it works.","replies":[]}]},{"poster":"PierceTheVeil","date":"2019-05-23T01:28:14.815+0000","up_votes":1,"down_votes":0,"body":"Can login have been playing for two hours no interruptions except one where end of game lobby screen couldn't exit or type outside that perfectly fine / friend also has had 0 issues since the last twitter post by optus","replies":[{"poster":"Mindstar","date":"2019-05-23T01:35:42.716+0000","up_votes":1,"down_votes":0,"body":"Thanks for sharing this update!  Glad to hear you &amp; your friend are back online :)","replies":[]}]},{"poster":"KieshwaV","date":"2019-05-22T10:08:38.535+0000","up_votes":1,"down_votes":0,"body":"I am connected, but Chat is disconnected, purchase RP page cant load and after playing 2 games, I can now no longer try to queue for a game, the button goes grey after pressing it, nothing happens and I can't press it again","replies":[]},{"poster":"Mindstar","date":"2019-05-22T05:11:41.126+0000","up_votes":1,"down_votes":0,"body":"Hi folks\n\nThanks for getting in touch.  We're aware of this and investigating now.  I'll keep you updated here.\n\nCheers!\nMindstar","replies":[{"poster":"Mindstar","date":"2019-05-22T05:12:37.799+0000","up_votes":1,"down_votes":0,"body":"To start with - if you are having the issue, can you let us know which ISP you play from, and if possible send in a ticket to Player Support with client logs.\n\nCheers\nMindstar","replies":[{"poster":"Grahemy Labroy","date":"2019-05-22T05:14:46.981+0000","up_votes":1,"down_votes":0,"body":"have already sent through a ticket, no logs though.  Myself and a few friends all on Optus are having this issue.  cheers.","replies":[{"poster":"Mindstar","date":"2019-05-22T05:25:25.915+0000","up_votes":1,"down_votes":0,"body":"Thanks for the info.\n\nOne tool I often use as a quick sanity check is this one - https://downdetector.com.au/ - which seems to indicate similar issues on a few different services, starting a few hrs ago.\n\nIt does look Optus specific at this stage, but we're working to clarify if there is anything we can do from the Riot side to mitigate the issue.","replies":[{"poster":"Mindstar","date":"2019-05-22T06:11:45.135+0000","up_votes":1,"down_votes":0,"body":"Hi folks\n\nUpdate from Riot's end is that there's no update yet.  The best way forward for now will be to contact Optus support and let them know you are experiencing issues, as they will likely have the most up to date information.\n\nOptus do provide a service status page [here](https://www.optus.com.au/about/network/service-status), but I haven't been able to find any information on it at this stage.  It might be worth checking from time to time.\n\nCheers\nMindstar","replies":[{"poster":"Mindstar","date":"2019-05-22T07:02:52.380+0000","up_votes":1,"down_votes":0,"body":"Possible Workaround:  In the past, players have been able to bypass issues like this one by using a local VPN service to connect to League. If you have a VPN account, it might be worth testing with that switched on.","replies":[{"poster":"PierceTheVeil","date":"2019-05-22T07:12:30.629+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Mindstar,realm=OCE,application-id=ElA0rvVL,discussion-id=rc2AuFF1,comment-id=000200000000000000000000,timestamp=2019-05-22T07:02:52.380+0000)\n>\n> Possible Workaround:  In the past, players have been able to bypass issues like this one by using a local VPN service to connect to League. If you have a VPN account, it might be worth testing with that switched on.\n\nSpoke to Optus just then they said their connection is fine and it's on riots server side they did a speed test said everything was fine, I don't like the idea of a vpn that doesn't solve the issue and I don't think many people want to pay for a service for a game that wasn't broken this morning","replies":[{"poster":"Mindstar","date":"2019-05-22T08:19:02.976+0000","up_votes":1,"down_votes":0,"body":"Hi\n\nThanks very much for sharing this and what you heard from the Optus support team.  Sometimes there is a bit of confusion when issues like this occur as to where the problem is, which might be why there is a mixed message coming through.\n\nI've been monitoring this case closely this afternoon, to make sure that Riot is doing what we can to help.  What I've seen is that there are multiple sources indicating that Optus customers are experiencing issues to _many parts_ of the internet, but not everything is down.   This is likely why some things work (eg. speed test) and others don't (eg. LoL &amp; some other games).  In this case, we have to wait for more updates from Optus, who have not yet provided an ETA for fixing their services.  They are providing updates on YesCrowd boards and their Twitter account.\n\nIn regards to the VPN - we're hoping to provide updates and relevant information so that players can make the best decision for themselves.  It is totally OK if you're not comfortable with using one.\n\nCheers\nMindstar","replies":[]}]},{"poster":"Mindstar","date":"2019-05-22T07:16:51.237+0000","up_votes":1,"down_votes":0,"body":"More updates from Optus are on their [YesCrowd boards](https://yescrowd.optus.com.au/t5/Network-Coverage/Slow-browsing-of-international-sites-on-Optus-network/m-p/565210#M11099/)","replies":[{"poster":"Mindstar","date":"2019-05-22T08:10:40.491+0000","up_votes":1,"down_votes":0,"body":"Hi folks - another update from Optus on their Twitter this time:\n https://twitter.com/Optus/status/1131100707535220736\n\nUnfortunately they do not seem to have an ETA yet for a fix.","replies":[]}]}]}]}]}]}]}]},{"poster":"PAULonee","date":"2019-05-22T04:55:29.230+0000","up_votes":1,"down_votes":0,"body":"Mines doing the same thing, tried using the repair tool and flush my dns with nothing happening \n.","replies":[]},{"poster":"Picture perfect","date":"2019-05-22T04:10:38.316+0000","up_votes":1,"down_votes":0,"body":"Same with me seems oce is down for some players need a riot employee to review this","replies":[]}]}