{"poster":"BrioStorm","date":"2016-11-07T22:12:11.726+0000","title":"Congratulazione a Tutti!","subforum":"Discussioni generali","up_votes":27,"down_votes":1,"body":"Congratulazioni a tutti quelli che sono riusciti a saliere a Gold+, la season sta per finire tra pochissimo e complimento con tutti quelli che ce l&#039;hanno fatta a raggiungere almeno Gold, per chi non fosse riuscito a raggiungere Gold auguro buona fortuna per l&#039;anno prossimo.\r\nNon perdete speranza che TUTTI* posso farcela, anche io quest&#039;anno non sono riuscito a raggiungere Gold (sono attualmente Silver I ^^&#039;&#039;) ma sicuramente il prossimo ce la far&ograve;! Se io posso farcela anche voi potete farcela!\r\nSta per arrivare natale, siate felici per questo! :D\r\n\r\nQuindi ringrazio tutti giocatori che mi hanno aiutato e anche solamente incontrato, avete reso questa season una della pi&ugrave; belle, ho potuto vedere soprattutto come la community Italiana sia migliorata, soprattutto sul Forum :D.\r\n\r\nCon tutto il mio amore natalizio,\r\n-BrioStorm &lt;3\r\n\r\n\r\n*Si intende quelli che si comportano bene nei confronti degli altri &lt;3.","replies":[{"poster":"TheKingOfTroll","date":"2016-11-07T23:51:28.214+0000","up_votes":15,"down_votes":0,"body":"Rientrando a casa tutti i giorni\nmi guardo sempre nei dintorni\n\naccendo tutto l'occorrente\nper passare una serata divertente\n\navvio lol pronto per giocare\nma la connessione mi fa già invocare\n\ndopo aver detto svariate smadonne\nè il momento di fare un'altra notte insonne\n\nstarto in game tutto contento\ne tiro giù un sacramento\n\nTroll, afk, Flamer mi fanno già preoccupare\ntanto che inizio subito ad urlare\n\nIniziano i pick e sembra tutto normale\ntocca a me è il momento cruciale\n\nma una voce rimbomba nella mia testa\ne guardando tra i campioni vedo già le mie gesta\n\n\"è il momento di trollare\"\"è il momento di trollare\"\ne allora non so proprio più che fare\n\ndopo un attimo di indecisione\nmi appare chiara la visione\n\npicco {{champion:48}}  per errore\ne vado subito in furore\n\necco la voce da dove veniva\nnon mi resta altro che prendere l'iniziativa\n\nprendo {{champion:48}}  tutto fiero\naffanculo tutti lui è il mio condottiero!!\n\nGrazie Trundle per avermi portato fino in platino.. senza di te non ce l'avrei fatta..Voglio solo fare 1 secondo di silenzio a tutti i poveri adc che mi hanno avuto come support..Comunque vedrai che l'anno prossimo ce la farai!! se ce l'ho fatta io con solo {{champion:48}} support.. giocando con una connessione da schifo e avendo non molto tempo ce la farai di sicuro stay strong stay troll {{champion:48}} \n\n\nhttps://66.media.tumblr.com/6996ea234dfd15f13dfb455a40c8265d/tumblr_mp82kxjWEU1sq8jfuo1_250.gif","replies":[{"poster":"Térence Fill","date":"2016-11-08T09:09:10.961+0000","up_votes":3,"down_votes":0,"body":"\"Prendo {{champion:48}} tutto fiero\nAffanculo tutti, lui è il mio condottiero!\" (Cit.)\n\nIn quel momento ho dovuto darti il +1! :'D","replies":[]}]},{"poster":"Térence Fill","date":"2016-11-08T09:43:27.110+0000","up_votes":4,"down_votes":0,"body":"Torno da lavoro per riposare\nma l'amico mi scrive e mi chiede di rankare.\n\"Dai non dire stronzate, oggi non andrà male!\"\ne poco dopo siamo pronti a pickare.\n\nSono l'ultimo pick, \"non può andare male\"..\nE subito in chat iniziano a flammare!\n\"Perchè {{champion:26}} Mid? Ci trolli compare?\nSappiamo già tutti che finirai per feeddare\"!\n\nSe il mio nick è \"Zileanico\" cosa vi dovreste aspettare?\nChe picki {{champion:6}}  Guardiano Stellare?\nCosì locko il vecchio e subito appare\nun Teemo Support.. E li inizio a smadonnare.\n\nDai primi di Marzo fin oltre al giorno di Natale\ntutti i santi del calendario ho dovuto citare!\nMa il mio mate su teamspeak mi vuole incoraggiare:\n\"Tranquillo, rilassati: il peggio deve ancora arrivare!\"\n\nInizia il game e come da rito\nil comando /mute all digito, a me tanto gradito!\nTutto è tranquillo, tutto va per il meglio\nMa il vero segnale è il mio First Blood su Aurelion!\n\nPer una volta ci credo davvero!\nPoi guardo bot lane e di nuovo mi dispero..\nSo che già lo immaginate, perchè non è certo un mistero..\nPerchè al minuto 10 l'ADC avversario è 6-0?\n\nPing forsennati a chiedere un gank mid\nEd amumu si degna di farsi vedere\nPer sbaglio o per culo prendo la kill\na seguire anche la torre, ed inizio a roamare.\n\nBot lane, bot lane.. Starò qui a camperare!\nE appena facecheckano li faccio scoppiare\nQ-W-Q e CTRL+4 regolare\nE un altra torre vedo cascare!\n\nE forse per sbaglio, o forse per bravura,\nIl nostro Top Laner fa un ACE da paura.\nAspetta, il Top Laner! Me l'ero dimenticato!\nGrazie a Dio il nostro Nasus in questo game ha stackato!\n\nFinalmente Gold giocando solo {{champion:26}} Mid,\ne chi stava a flammare ora scrive \"GG WP\".\nNon è negativo, ma lo devo segnalare:\ndopo 150 game ecco un Team in grado di comunicare!\n\nQuesto ho voluto scriverlo perchè il post di \"TheKingOfTroll\" mi è piaciuto talmente tanto che ho voluto farne uno anche io! :)\nIn bocca al lupo a tutti per la prossima Season, e congratulazioni a chi c'è l'ha fatta ad arrivare alle reward di questa! ^_^","replies":[]},{"poster":"Nocte Perpetua","date":"2016-11-08T09:50:25.558+0000","up_votes":3,"down_votes":0,"body":"Quest'anno senza troppo impegno mi sono classificato Plat V, questa season iniziando presto vedrò di provare a raggiungere il Diamond, anche se non ho mai avuto di questi obiettivi visto che preferisco divertirmi in normal!\nUn augurio a tutti coloro che anche questa season proveranno a raggiungere i loro obiettivi senza flammare e mantenendo sempre i nervi saldi!\nPer coloro che non sono riusciti a raggiungere il Gold, il consiglio migliore che mi sento di dare è di migliorare le proprie meccaniche (Bastano quelle per un veloce GV) ed il proprio carattere, la visione di gioco in Silver è abbastanza secondaria, ma se volete migliorarla vi dovrete impegnare molto!\nDavvero, cercate di migliorare, perché LoL è un bellissimo gioco, e di mandare a cagare i giocatori di Dota perché ci danno della Community \"flamer\" un po' mi spiace, anche perché so che non lo siamo :3","replies":[{"poster":"Térence Fill","date":"2016-11-08T09:58:14.548+0000","up_votes":3,"down_votes":0,"body":"Dire che LOL non è una community di flamer mi sembra un po' azzardato.. \nSenza offesa eh.. Ma escono dalle fo**ute pareti! :'D\n\nPer il resto pienamente d'accordo con te.","replies":[{"poster":"Nocte Perpetua","date":"2016-11-08T11:08:33.749+0000","up_votes":2,"down_votes":0,"body":"Le community di Flamer sono altre, certo non è tutto rosa e fiori ma ti assicuro che sono uscito da giochi con una community peggiore xD\nUn buon 60-70% di noi si salva e nonostante qualche brutta partita ce ne sono tante in cui mi diverto molto/mi impegno molto per vincere perché gli avversari sono validi e simpatici :3","replies":[]}]}]},{"poster":"Frattaglia","date":"2016-11-07T23:08:33.730+0000","up_votes":3,"down_votes":0,"body":"Auguri a te, ricorda che puoi rankare anche in prestagione, il gold potresti raggiungerlo comunque (anche se non avresti diritto ai premi ottenuti in prestagione :( )","replies":[{"poster":"Seamus83","date":"2016-11-08T10:51:56.958+0000","up_votes":1,"down_votes":0,"body":"ma le placement si basano su elo o mmr!?","replies":[{"poster":"Frattaglia","date":"2016-11-08T11:07:09.926+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Seamus83,realm=EUW,application-id=MJVj50Jw,discussion-id=Eb4biAis,comment-id=00060000,timestamp=2016-11-08T10:51:56.958+0000)\n>\n> ma le placement si basano su elo o mmr!?\n\nCredo che si basino sull'mmr, ma considerando che di solito elo e mmr sono molto vicini, non c'è molta differenza.\n\nOvviamente si basano sull'mmr alla fine della preseason, anche se però non dovrebbe esserci più la retrocessione per inattività per la gente sopra il gold 1.","replies":[]}]}]},{"poster":"wellyT93","date":"2016-11-07T22:31:24.672+0000","up_votes":3,"down_votes":0,"body":"Auguro il meglio a tutte le persone che amano questo forum come me, se non fosse stato per i preziosi aiuti che molti mi hanno dato ad inizio season, probabilmente avrei fatto 10 volte più fatica a migliorarmi, inoltre, auguro ai neofiti di avere la mia stessa fortuna nel trovare gente che li possa aiutare. \nInfine, ringrazio anche i MOD di questo forum, che GRATIS lo moderano al meglio delle loro possibilità (e c'è da dire che a volte è veramente difficile da moderare). \nBuona S7 a tutti e, soprattutto, divertitevi, che è quello che conta!","replies":[]},{"poster":"Alefelix93","date":"2016-11-07T22:18:33.941+0000","up_votes":3,"down_votes":0,"body":"\"Congratulazioni a tutti quelli che sono riusciti a saliere a Gold+, la season sta per finire tra pochissimo e complimento con tutti quelli che ce l'hanno fatta a raggiungere almeno Gold, per chi non fosse riuscito a raggiungere Gold auguro buona fortuna per l'anno prossimo.\nNon perdete speranza che TUTTI* posso farcela\"\nsecondo me son parole molto belle.\nGj per il post","replies":[]},{"poster":"SorbettoAlLimone","date":"2016-11-08T10:10:43.574+0000","up_votes":2,"down_votes":0,"body":"Grazie BrioStorm! Ti auguro il meglio del meglio! Buon proseguimento di giornata e, per Natale, c'è ancora tempo! :D Ciaooooooooo","replies":[]},{"poster":"FlyDreams","date":"2016-11-08T06:15:18.197+0000","up_votes":2,"down_votes":0,"body":"Salve \nQuest'anno inizierò anch'io a rankare \nIl mio obbiettivo sarà gold \nPoi se potrò arrivare più in fondo meglio così \n(Anche perché inizierò un po tardi, così vedo se quando faccio le 10 di posizionamento mi mettono un po' più alto xD)\nP.s. Ancora non ho capito una cosa \nQuando si può iniziare a rankare per l'anno che verrà?","replies":[{"poster":"Térence Fill","date":"2016-11-08T09:59:40.883+0000","up_votes":1,"down_votes":0,"body":"SE NON ERRO, intorno al 6 o al 7 Dicembre.","replies":[]}]},{"poster":"Ayuvelon","date":"2016-11-07T22:34:17.621+0000","up_votes":2,"down_votes":0,"body":"Quest'anno ci sono anch'io! ^^\n\nGg.","replies":[]},{"poster":"Law1Rz","date":"2016-11-07T22:30:50.199+0000","up_votes":2,"down_votes":0,"body":"Grazie, buona fortuna per il prossimo anno! GG","replies":[]},{"poster":"Firenheit","date":"2016-11-07T22:22:48.236+0000","up_votes":2,"down_votes":0,"body":"Auguri a te :) ♥\n\nE' come capodanno, mentre scrivo manca 1:36 ore:\nhttps://support.riotgames.com/hc/en-us/articles/230496748]\n","replies":[]},{"poster":"Kim114","date":"2016-11-08T06:44:23.418+0000","up_votes":3,"down_votes":1,"body":"Oggi pomeriggio ci sarà un picco di italiani salito in gold per questo post","replies":[]},{"poster":"99Power","date":"2016-11-09T21:43:23.290+0000","up_votes":1,"down_votes":0,"body":"Ma in tutto questo, perché hanno reworkato e icone delle abilità degli assassini, ma non di tutti?","replies":[]},{"poster":"chatter63","date":"2016-11-09T08:35:44.275+0000","up_votes":1,"down_votes":0,"body":"{{champion:57}} Victorious {{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"JStrong","date":"2016-11-09T00:06:55.000+0000","up_votes":1,"down_votes":0,"body":"Nella prossima Season tutti impegnati a fare ranked\ndiciamo che la s7 la sto aspettando da tempo, è il mio unico modo per riuscire a salire\nCongratulazione a chi è riuscito a salire Gold u.u","replies":[]},{"poster":"Due spade","date":"2016-11-08T17:53:49.842+0000","up_votes":1,"down_votes":0,"body":"Io ho fatto Bronzo V -  Silver I (con mooolti alti e bassi) 16 lp, come record, poi nulla è andato tutto male e continuava anche peggio.\nSilver III, rimane una vittoria... credo. \\O/\n\nComplimenti a tutti quelli che hanno centrato l'obiettivo. \\O/ \n\n\n\n\n\n\n(senza l'aiuto smurf di turno \\O/)","replies":[]},{"poster":"99Power","date":"2016-11-08T11:40:02.718+0000","up_votes":1,"down_votes":0,"body":"Mi sta salendo la voglia di fare duo con te °L°","replies":[]},{"poster":"zYaichi","date":"2016-11-08T11:27:33.302+0000","up_votes":1,"down_votes":0,"body":"Congratz a tutti! {{champion:17}}","replies":[]}]}