{"poster":"M4GICSOUL","date":"2015-04-05T15:49:29.753+0000","title":"Riven/Amumu \"Mentor\"","subforum":"Level Up: Guides & Tipps","up_votes":1,"down_votes":0,"body":"Hi Lol-Community, \r\nIch spiele jetzt seit bald einem Jahr wieder aktiv LoL bin aber leider noch immer Silber V (Promo zu IV *-*). Ich spiele 2 Champions gerne: Riven und Amumu. Jungle sowie auch Top. Jedoch bin ich oft unsicher in gewissen Momenten. Ich wei&szlig;, dass vor allem Amumu kein Skillreicher Champion ist, bin aber trotzdem auf der Suche nach einem Mentor der mir Jungle und Top und insbesondere Amumu und Riven etwas n&auml;her bringt. Ich w&uuml;rde mich echt freuen wenn mir da jemannd helfen w&uuml;rde :) LG M4GICSOUL","replies":[{"poster":"AllMid AllRandom","date":"2015-04-05T21:41:01.897+0000","up_votes":1,"down_votes":1,"body":"Hi Magicsoul, in welchen gewissen Momenten? das einzige, was du mit riven lernen musst, ist zwischen den qs ein auto Attack zu machen und deine R bzw W Castzeit mit deiner E zu überbrücken..... das heißt zb. erst R und dann schnell E und schon spielst du in den oberen Ligen, da Riven für mich kein schwerer Champ ist.\nBei Amumu naaaja.... Q wen und hoffe, soviele wie möglich mit deiner ult zu treffen ;)","replies":[{"poster":"M4GICSOUL","date":"2015-04-06T06:14:47.936+0000","up_votes":1,"down_votes":0,"body":"Ich meine es Bobox ist nicht umsonst so bekannt mit Riven. Es geht nich drum Riven zu mainen sondern eher zu meistern.","replies":[{"poster":"AllMid AllRandom","date":"2015-04-06T16:28:08.861+0000","up_votes":1,"down_votes":0,"body":"BoxBox ist bekannt, weil die NA Szene groß ist und er schon seit Saison 1-2 oben mitspielt....\nWenn du Riven Meistern willst hilft wohl nur JAHRELANGE Übung, da der Champ komplex ist\n\nGrac","replies":[{"poster":"M4GICSOUL","date":"2015-04-06T17:56:50.670+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ImbaMDT,realm=EUW,application-id=vatevpvi,discussion-id=xyXZtjRK,comment-id=000000000000,timestamp=2015-04-06T16:28:08.861+0000)\n>\n> BoxBox ist bekannt, weil die NA Szene groß ist und er schon seit Saison 1-2 oben mitspielt....\n> Wenn du Riven Meistern willst hilft wohl nur JAHRELANGE Übung, da der Champ komplex ist\n> \n> Grac\n\nIch hoffte auf Tipps Tricks und Kniffs die in Youtubeguides nicht zu Wort kommen.","replies":[{"poster":"SwissKeks","date":"2015-04-10T14:46:12.260+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=M4GICSOUL,realm=EUW,application-id=vatevpvi,discussion-id=xyXZtjRK,comment-id=0000000000000000,timestamp=2015-04-06T17:56:50.670+0000)\n>\n> Ich hoffte auf Tipps Tricks und Kniffs die in Youtubeguides nicht zu Wort kommen.\n\nhttp://leagueoflegends.wikia.com/wiki/Riven/Strategy\nDas meiste ist aber generelles Spielwissen was man auf verschiedene Champions übertragen kann. Unabhängig wie der Champion aufgebaut ist, die Mapcontrol, Vision und das Traden ist Championübergreifend. (Zummindest in einem gewissen Teil).\nWenn du schon sein Stream schaust, achte darauf was er macht, warum er es macht und wie du es machen würdest. Nur streams schauen ist wie wenn du einen Guide liest, aber nur die Items und masteries anschaust. Es nützt nichts ohne Hinterfragung.","replies":[]}]}]}]}]},{"poster":"Vanthenos","date":"2015-04-06T10:02:36.180+0000","up_votes":1,"down_votes":0,"body":"Bei der Rolle Jungle könnte ich dir weiterhelfen da ich selbst Main Jungle bin. Wenn du willst kann ich dir gern ein bisschen Helfen dich im Jungle zu verbessern, das betrifft natürlich das Ganken der Lanes sowie auch aufbauen von Vision ( Da man sich nicht immer darauf verlassen kann das die Teammates da tun ) und Counterjunglen. Ich könnte dir wenn du bereit bist neue Champions wie z.B Vi, Rengar oder Sejuani auszuprobieren auch mit diesen weiterhelfen.","replies":[{"poster":"M4GICSOUL","date":"2015-04-06T10:18:03.160+0000","up_votes":1,"down_votes":0,"body":"Die Hilfe würde ich gerne annehmen! Ich selbst habe viel Rengar gespielt aber eher auf Top. Vi Jungle habe ich auch gerne gespielt und Sejuani habe ich mir gekauft bevor Urf rauskam aber noch nie gespielt. Counterjunglen kann ich gar nicht außer mit Shaco den Standardkram mit eigenen Buff ohne Smite dann zum Gegner den Buff wegsmiten und den Gegner versuchen zu killen und dann halt normal weiter junglen. Vision hab ich auch kaum Ahnung ich bin versuche halt immer Drakekontrolle zu haben und warde manchmal mit Pinks in den Riverbusch. Im Endeffekt würde ich mich sehr freuen wenn du mir mal das \"Highelojunglen\" näher bringst. Wenn du willst dann adde mich doch einfach mal :)","replies":[{"poster":"Vanthenos","date":"2015-04-06T11:39:59.497+0000","up_votes":1,"down_votes":0,"body":"Ich selbst würde jetzt auch nicht sagen das ich High Elo bin da ich nicht mal Ranked spielen kann. Aber ich würde so weit gehen zu sagen das ich schon einiges über den Jungle weiß. Ich adde dich mal Ingame dann kann ich gucken wo deine schwächen liegen und kann dir helfen diese zu beseitigen :)     \n\nUPDATE: Habe dich jetzt ingame geaddet gibt es einen Weg wie ich mit dir hier z.B in einem Privaten Chatraum schreiben kann oder geht das nur über den ingame Chat ?","replies":[]}]}]}]}