{"poster":"Tastentourette","date":"2015-03-28T08:09:31.594+0000","title":"Ständige Freundschaftsanfragen mit Werbung","subforum":"Hilfe & Support","up_votes":3,"down_votes":0,"body":"Gr&uuml;&szlig;t euch\r\n\r\nIch hab da ein Problem, ich bekomme st&auml;ndig Freundschaftsanfragen von diversen Spielern die wenn ich sie annehme mir Werbung schicken zb f&uuml;r Eloboosting und Accountverkauf, es sind auch des &ouml;fteren auch immer die selben Typen. Kann ich diese Leute nicht blocken ? Oder gibts eine andere M&ouml;glichkeit dagegen was zu tun ?\r\n\r\nMfG","replies":[{"poster":"Crounty","date":"2015-03-28T09:43:44.031+0000","up_votes":5,"down_votes":1,"body":"Du kannst die blocken, das ist aber das einzige was du tun kannst.\nAußerdem darfst du die nie annehmen und nie in der Freundesliste haben, da Riot plant die zu bannen, die in deren Freundesliste sind.","replies":[{"poster":"xCyburn","date":"2015-03-28T11:09:33.163+0000","up_votes":6,"down_votes":5,"body":"Quelle? Oh warte, gibt es keine.","replies":[{"poster":"Crounty","date":"2015-03-29T12:06:10.754+0000","up_votes":5,"down_votes":0,"body":"Hier deine Quelle, die es deiner Meinung nach nicht gibt.\nich muss zugeben, das mit dem bannen war etwas zu übetrieben (so hab ich das interpretiert) aber Riot wird definitiv was dagegen tun.","replies":[]}]}]},{"poster":"Easline","date":"2015-03-28T12:45:31.057+0000","up_votes":2,"down_votes":0,"body":"Wäre ja ne prima Idee, die ganz bestimmt von Riot kommt, auch die Leute zu bannen, die in deren Freundesliste sind, fragen ja nicht die ganze Zeit etliche Spieler an von denen manche die Freundschaftseinladung auch noch annehmen ^^\n\nProblem wäre ja vorerst behoben wenn man mit lvl 1 nur einen Freund hinzufügen könnte und nach 5 Games diese Blockade dann verschwinden würde.\nWäre aber so langsam mal an der Zeit von Riot wenigstens ein Statement zu veröffentlichen.","replies":[]},{"poster":"Frôzen Throne","date":"2015-04-02T05:36:00.791+0000","up_votes":1,"down_votes":0,"body":"Kann mich diesem Problem nur anschließen. Finde es echt nervig alle 20min eine Anfrage abzulehnen... würde es helfen die Namen zu notieren und dem Support zur Verfügung zu stellen?","replies":[]},{"poster":"Ηastur","date":"2015-03-29T12:31:50.585+0000","up_votes":1,"down_votes":0,"body":"Nervt enorm. Eben eingeloggt und schon wieder zwei Anfragen von Unbekannt..\nDas is mitlerweile jeden Tag das selbe. Wäre schön, wenn da was passieren könnte. :)","replies":[]},{"poster":"iHakku","date":"2015-03-28T17:24:58.097+0000","up_votes":1,"down_votes":0,"body":"Du kannst einfach immer die Bots blocken die dich adden, wird aber leider nicht viel helfen da jeden Tag neue kommen, hab das selbe Problem :/","replies":[]},{"poster":"Vámbrácè0fDèád","date":"2015-03-28T12:51:36.658+0000","up_votes":1,"down_votes":0,"body":"Ich hoffe das es bald mal aufhört. Es ist echt übelst nervig. Am besten direkt löschen die Accounts","replies":[]}]}