{"poster":"King of Mongoose","date":"2015-11-16T18:31:00.425+0000","title":"you kids are so bad thinking that a reasonable yasuo nerf is to make his abilities cost flow","subforum":"Gameplay","up_votes":2,"down_votes":5,"body":"if anything, just increase the damage penalty on crits.","replies":[{"poster":"Lights And Magic","date":"2015-11-16T19:19:29.509+0000","up_votes":3,"down_votes":0,"body":"[Battle Bunny Yasuo](https://41.media.tumblr.com/187cc2b0385d14849eee605d40e3eab6/tumblr_n46nz1nl111qfsezdo1_1280.jpg)","replies":[]},{"poster":"Ralanr","date":"2015-11-16T18:35:06.494+0000","up_votes":1,"down_votes":0,"body":"70% 60%?\n\nHow would that interact with infinity edge?","replies":[{"poster":"IronwallJackson","date":"2015-11-16T19:22:21.730+0000","up_votes":2,"down_votes":0,"body":"The same way it does now. His passive gives .9 crit damage, so when you throw on an IE, that 1.25 crit damage is multiplied by the .9 and you get 1.125, or 112.5% crit damage.\n\nIf you made the multiplier .7, then the math would be 1.25*.7=0.875\n\nLook, Yasuo is balanced around taking two items to hit his crit potential and his total damage output is thus cut accordingly. If they cut back on his crit scaling, they either leave that champion in a nigh-unusable state or they end up having to buff another part of his kit to make up for it. That's the thing, his damage is really easy to balance because you can account for him dealing very consistent damage. If you take away that consistency or simply lower the DPS, there will need to be compensation, probably in his durability since he's got assassin stats that assume he'll burst something down before they can adequately retaliate.","replies":[{"poster":"Ralanr","date":"2015-11-16T19:27:14.935+0000","up_votes":1,"down_votes":0,"body":"He's centered around crits and he's easy to balance for consistent damage?","replies":[{"poster":"IronwallJackson","date":"2015-11-16T20:07:46.546+0000","up_votes":2,"down_votes":0,"body":"**INCOMING LONG POST:**\n\nPretty much. It's simple to balance for crit chance over time. If your chance to crit is 70% and crits do double damage, then your damage output is \"AD x 2 x .7\" for your AAs. Problem is, RNG makes things more inconsistent on a moment to moment basis. No one likes being hit with 3 unlikely crits in a row and losing a fair duel.\n\nI'm fairly certain that that's why Riot increased the available crit chance; so that things become a bit more consistent. RNG over time is easily balanced, but in the moment, it's not.\n\nThat's one of Yasuo's strengths, from both a designer's and a player's perspective. You have a very, very good idea of what his performance will be like, and thus can work with that knowledge accordingly. Guessing whether or not he can survive an engagement is a lot more dangerous than it is for other melee carries, so that's a big part of why he has all of his bits.\n\nYasuo has double crit so that he can build some tank items, and since he has the luxury of building those, they can keep his stats low even though he has to engage at melee range. And because he has to engage so close against ranged enemies, but has stats too low to face tank, he has a passive shield to make harder to burst and dashes that help him close the gap. Because his raw DPS isn't actually all that high when compared to the other melee carries, he's given utility to compensate in the form of his ult procs and W.\n\n**TLDR: Yasuo looks like horseshit, but his kit is like a machine and he kind of needs it all to be viable unless you want to make a lot of changes at once.**","replies":[{"poster":"Ralanr","date":"2015-11-16T20:38:15.204+0000","up_votes":1,"down_votes":0,"body":"Thank you.  That is all I wanted.","replies":[]}]}]}]}]},{"poster":"Spoofghoul","date":"2015-11-16T18:37:38.028+0000","up_votes":2,"down_votes":0,"body":"How about taking away his sword and giving Yasuo a carrot instead","replies":[{"poster":"Ralanr","date":"2015-11-16T18:38:33.218+0000","up_votes":2,"down_votes":0,"body":"We already tried with Riven. Didn't work.","replies":[]},{"poster":"Sasogwa","date":"2015-11-16T18:38:50.951+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Spoofghoul,realm=EUW,application-id=3ErqAdtq,discussion-id=ATKghTaY,comment-id=0002,timestamp=2015-11-16T18:37:38.028+0000)\n>\n> How about taking away his sword and giving Yasuo a carrot instead\n\nBattle bunny yasuo?","replies":[]}]},{"poster":"Penns","date":"2015-11-16T18:34:55.316+0000","up_votes":1,"down_votes":0,"body":"Buff?\nkek","replies":[]}]}