{"poster":"I O III O I","date":"2017-01-01T16:20:07.394+0000","title":"hänge in der matchmaking hölle fest ^^","subforum":"Clans & Teams","up_votes":1,"down_votes":2,"body":"hi,\nda ich in soloq immer mind 1-2 trolle in meinem team habe kommt man einfach nicht weiter.\nwenn du solide spielst, nicht intest und ein wenig verstehst was du machst adde mich. suche spieler f&uuml;r\n\n5vs5 ranked und auch 3vs3 flex.\n\nich spiele mid, top und kann auch sup. \n\nwenn du interesse hast adde mich einfach oder hinterlasse einen kommentar.\nw&auml;re sch&ouml;n, wenn du 16+ w&auml;rst.\n\nlg\nI O III O I","replies":[{"poster":"RealDobber","date":"2017-01-01T18:45:34.298+0000","up_votes":1,"down_votes":0,"body":"Hi I O III O I ,\n\nwir sind gerade dabei eine neue Community aufzubauen, und wir suche in erster linie Bronze leute!!!\n\nNatürlich auch high elo leute, aber das grundgerüst sollte erstmal bei 0 anfangen in diesem sinne würde ich dich herzlich einladen dich mal auf unserem TS blicken zu lassen\n\nTS: highrollerz.eu\n\nHP: www.highrollerz.eu\n\nGruß Dobber","replies":[]},{"poster":"Shaolin Monk 28 ","date":"2017-01-01T16:52:51.220+0000","up_votes":1,"down_votes":0,"body":"Wenn Du bei uns mitspielen möchtest, musst Du dafür kein Mitglied sein. Besucher sind auf unserem TS³ jederzeit herzlich willkommen und werden gerne eingegliedert. Wenn Du nun Mitglied werden möchtest, sprich einen General oder Offizier deswegen an, der Dir dann alles Weitere erklären wird.\n\nZu Beginn absolviert jeder Rekrut eine zwei-wöchige Trial-Zeit, in der sowohl Du, als auch die Division feststellen können, ob wir zueinander passen. Wenn Du in dieser Zeit aus irgendwelchen Gründen inaktiv bist, wird lediglich die Rekrutierungszeit verlängert – Du würdest also nicht prinzipiell abgelehnt werden.\n\nWas wir nicht wollen: Intoleranz, Arroganz, Flaming, Cheaten oder unsoziales Verhalten jeglicher Art.\nWir suchen gerne leute in den Bereich Bronze und Silber,aber auch andere Elos sind bei uns Willkommen.\nBei uns Wird gespielt:\nLeague of Legends\nBattefield\nCounter-strike\nWorld of Tanks\nWorld of Warships\n\nWir sind auch für andere Spiele Offen\n\nWenn Du keine dieser negativen Eigenschaften an den Tag legst und Dich gut in ein Team eingliedern kannst, steht Deiner offiziellen Mitgliedschaft nach zwei Wochen nichts im Wege.\n\nDas Mindestalter bei uns beträgt 16 Jahre. Wir nehmen keine Spieler auf, deren Lebensziel darin besteht, von morgens bis abends vor dem Bildschirm zu sitzen und sich um nichts sonst kümmern zu wollen. All unseren Mitglieder ist ihr Real-Life wichtiger als der Clan und diese Einstellung wird absolut unterstützt! Sollte ein Mitglied also inaktiv werden, verstehen und akzeptieren wir das. Selbst nach mehreren Jahren Inaktivität ist diese Person jedoch herzlich willkommen und wird gerne wieder aufgenommen.\n\nDie Mitgliedschaft bei uns ist kostenlos und wird es auch immer bleiben!\n\nPS:Wir sind auf unseren Teamspeak 62.104.20.254:10008 erreichbar,ihr könnt uns auch gerne ihn Lol anschreiben.xXnoAimNoSkillXx oder PêmâdeStîllAlòne","replies":[]}]}