{"poster":"Covert Ops Gnar","date":"2016-06-15T21:31:49.866+0000","title":"Ping Spikes","subforum":"[ARCHIVED] Help & Support","up_votes":2,"down_votes":0,"body":"http://imgur.com/dcLU5Dr\r\n\r\nHow do I fix this?\r\n\r\n5G wireless internet with router in the same room as the computer. Netgear Nighthawk X6\r\n\r\nThis started in the past few weeks and I thought it was going to go away but it hasn't so it appears I need to find a solution. Please help.","replies":[{"poster":"dArtagnan","date":"2016-06-16T00:26:44.461+0000","up_votes":1,"down_votes":0,"body":"It looks like you got these results from running the test in our [Connection Analyzer Tool](https://support.riotgames.com/hc/en-us/articles/209765743-Connection-Troubleshooting-Log-Reader)! After running the tests, the screen should update with different troubleshooting steps you can take to hopefully resolving this issue.  Were you able to complete them at all?\n\nAdditionally, you may want to try connecting via an ethernet cable directly to your router to rule out your wireless connection as a possible root cause.\n\nLet me know if nothing seems to help!","replies":[{"poster":"Covert Ops Gnar","date":"2016-06-16T11:31:06.259+0000","up_votes":1,"down_votes":0,"body":"None of those steps were even a considerable option for a fix. I have a consistently good ping, then it randomly spikes up in, seems to me like, a pattern. It looks like every x minutes, it spikes. Could I have some further assistance? This has been going on for several weeks and even in different houses on different routers.","replies":[{"poster":"dArtagnan","date":"2016-06-16T20:40:26.544+0000","up_votes":1,"down_votes":0,"body":"What sort of options and steps did it provide you that was not even a \"considerable option\"?  It would be interesting to see what steps aren't worthwhile, and if they aren't, we can probably help to improve them.\n\nOtherwise, if the ping spikes happen fairly consistently, the root cause seems to be an unstable connection to the individual Game Server.  It is hard to know what is causing this specifically, so we will need to start ruling out possible root causes.  To that end, make sure to complete all of the steps in our [Connection Issues Guide](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues)!","replies":[{"poster":"Covert Ops Gnar","date":"2016-06-17T10:44:45.355+0000","up_votes":1,"down_votes":0,"body":"> _**QUICK FIXES**\n>\n*  If you’re playing on a wireless connection, switch to a wired connection or move as close to your router as possible. **Router is in the same room as me on 5G wireless, Netgear Nighthawk new model**\n* > Unplug your router and modem, leave them unplugged for 30 seconds, then plug them back in. This reset can often clear up intermittent network problems. **Tried**\n* > Close other network-heavy programs before playing a game (such as torrents, streaming video services, or other games). **None**\n* > Network firewalls on your router or computer may cause degraded network performance. Check out our guide here for info on how to add exceptions for League of Legends. **Nope**\n* > **IN-DEPTH SOLUTIONS**\n* > Contact your ISP to see if you’re eligible to upgrade your hardware. The latest networking hardware can improve your connection, and older hardware can cause degraded network performance over time. **$400.00 new model router with updated drivers, 430mbps**\n* > Look into transferring your LoL account to another server closer to where you live. Playing on a nearby game server will help alleviate consistently high ping. **Live in AZ, 70ping**\n* > If none of these steps are successful in improving your connection, contact your ISP again to see if there are any known network issues in your area.** I've connected through different locations throughout the state, all the same problem**_","replies":[]}]}]},{"poster":"Covert Ops Gnar","date":"2016-06-16T14:58:48.473+0000","up_votes":1,"down_votes":0,"body":"bump","replies":[]}]},{"poster":"Hige","date":"2016-06-15T23:44:49.633+0000","up_votes":1,"down_votes":0,"body":"I honestly don't know what's going on with the game, I have accepted my ping spikes and I blame my family for overusing the internet but on every game I play there's also someone else lagging, this is far beyond coincidence man even though reds say it's on our end, it's just unbelievable.","replies":[{"poster":"Covert Ops Gnar","date":"2016-06-16T11:28:13.174+0000","up_votes":1,"down_votes":0,"body":"I have a $300 router with 3 broadbands, all running 5G wireless.","replies":[]}]},{"poster":"Covert Ops Gnar","date":"2016-06-15T22:33:30.111+0000","up_votes":1,"down_votes":0,"body":"bump","replies":[]}]}