{"poster":"General Esdeath ","date":"2017-03-23T22:46:01.929+0000","title":"League should do what Overwatch did","subforum":"Gameplay","up_votes":148,"down_votes":17,"body":"A new character was released and isn&#039;t pickable in ranked. Riot should do this with new/reworked champs","replies":[{"poster":"TheHappyReaperz","date":"2017-03-23T22:56:20.934+0000","up_votes":14,"down_votes":30,"body":"Do you know what League has that Overwatch doesn't? Bans. Use them.","replies":[{"poster":"General Esdeath ","date":"2017-03-23T23:33:42.378+0000","up_votes":37,"down_votes":2,"body":"Would love to but I'm first pick and Riot is still waiting to put 10 bans in :)","replies":[{"poster":"FakeGravity","date":"2017-03-24T00:35:14.128+0000","up_votes":5,"down_votes":2,"body":"i just threat to use galio myself if you dont ban him, which work if you are any role that isnt adc","replies":[{"poster":"Kudrov","date":"2017-03-24T12:50:47.603+0000","up_votes":3,"down_votes":0,"body":"false : FTFY any roles period.","replies":[]}]}]},{"poster":"LegendmakerGX","date":"2017-03-24T04:44:35.446+0000","up_votes":18,"down_votes":1,"body":"> [{quoted}](name=TheHappyReaperz,realm=NA,application-id=3ErqAdtq,discussion-id=8X1zE7mc,comment-id=0001,timestamp=2017-03-23T22:56:20.934+0000)\n>\n> Do you know what League has that Overwatch doesn&#x27;t? Bans. Use them.\n\nWell this is a dumb advice, people need to ban real OP champions rather then waste a ban. Galio is a new champion where no one knows how to use him and chances are the team mate who plays Galio will fk your match since he doesn't know how to play him.\n\nBans are for banning champion that is either broken or terrible to deal with late game or early game, they should not be used and wasted on because a idiot wants to first time Galio in a rank match.","replies":[{"poster":"ZephyrDrake","date":"2017-03-24T05:59:49.837+0000","up_votes":3,"down_votes":9,"body":"> [{quoted}](name=LegendmakerGX,realm=NA,application-id=3ErqAdtq,discussion-id=8X1zE7mc,comment-id=00010004,timestamp=2017-03-24T04:44:35.446+0000)\n>\n> Well this is a dumb advice, people need to ban real OP champions rather then waste a ban. Galio is a new champion where no one knows how to use him and chances are the team mate who plays Galio will fk your match since he doesn&#x27;t know how to play him.\n> \n> Bans are for banning champion that is either broken or terrible to deal with late game or early game, they should not be used and wasted on because a idiot wants to first time Galio in a rank match.\n\nand how do you know that it'll be their first time playing that champion? if we go by that logic no champion should be allowed in ranked period since that random player could be playing that random champion for the first time ever even if it's an old ass champion. You have bans, use them. Overwatch doesn't and they don't even need to pay anything to use that hero/champion/whatever whereas here those who actually want to play the champion actually had to spend IP or RP to get the champion","replies":[{"poster":"Cosmic Warper","date":"2017-03-24T07:14:50.724+0000","up_votes":6,"down_votes":0,"body":"> [{quoted}](name=ZephyrDrake,realm=NA,application-id=3ErqAdtq,discussion-id=8X1zE7mc,comment-id=000100040000,timestamp=2017-03-24T05:59:49.837+0000)\n>\n> and how do you know that it&#x27;ll be their first time playing that champion? if we go by that logic no champion should be allowed in ranked period since that random player could be playing that random champion for the first time ever even if it&#x27;s an old ass champion. You have bans, use them. Overwatch doesn&#x27;t and they don&#x27;t even need to pay anything to use that hero/champion/whatever whereas here those who actually want to play the champion actually had to spend IP or RP to get the champion\n\nBecause the champion just got reworked lmao No one has more than 10-15 games on the new galio yet","replies":[{"poster":"Faceroll Tactics","date":"2017-03-24T11:44:06.821+0000","up_votes":3,"down_votes":0,"body":"Haha you underestimate the power of tryhards and Koreans.\n\nSome Koreans play 30 games a day. It's definitely possible, also accounting for the fact that the pbe has had galio for a few weeks as well.","replies":[{"poster":"UkeNeverSeme","date":"2017-03-24T22:41:57.182+0000","up_votes":1,"down_votes":0,"body":"That would take approx. 24 hours to do, so i really doubt that. Also according to korean law you get locked out after a certain anoint of time and you have to use a social security number to play so... No. Noone. Plays 30 games a day.","replies":[{"poster":"greatdeathz","date":"2017-03-25T00:38:09.091+0000","up_votes":1,"down_votes":0,"body":"what about the koreans who arnt in korea?","replies":[{"poster":"Faceroll Tactics","date":"2017-03-27T20:38:07.563+0000","up_votes":1,"down_votes":0,"body":"They have illegal social security numbers, or people move to Korea like LS.","replies":[]}]}]},{"poster":"AMYS GRAVE","date":"2017-03-24T21:01:38.396+0000","up_votes":1,"down_votes":0,"body":"If they've already played 30 games today to get experience on galio then i don't want them in my game because they are exhausted and probably not playing at their best.","replies":[]}]},{"poster":"ZephyrDrake","date":"2017-03-24T13:56:37.167+0000","up_votes":3,"down_votes":2,"body":"> [{quoted}](name=Cosmic Warper,realm=NA,application-id=3ErqAdtq,discussion-id=8X1zE7mc,comment-id=0001000400000001,timestamp=2017-03-24T07:14:50.724+0000)\n>\n> Because the champion just got reworked lmao No one has more than 10-15 games on the new galio yet\n\nyou are avoiding my question. Every single champion that someone picks in champ select can be that persons first time using that champion. Also there are people who used him in the PBE so they have a lot of experience with him. You do not even need that many games in order to know what a champion does. You play one or two games and you have a general idea of what the champion does and how their abilities behave. It doesn't matter if a champion is new or just got reworked. You don't want that champion in ranked? ban him!","replies":[{"poster":"AMYS GRAVE","date":"2017-03-24T21:03:10.507+0000","up_votes":2,"down_votes":1,"body":"The difference is that some people may not have played, lets say alistar, but they have almost certainly played _against_ alistar or _with_ an alistar before and at least know what he does. Meanwhile they haven't played galio, or played against him, or played with him on their team and consequently have much less knowledge of the champion. ","replies":[]}]}]},{"poster":"LegendmakerGX","date":"2017-03-24T06:58:17.843+0000","up_votes":2,"down_votes":0,"body":"Don't they have that new useless champion grade system Riot implemented? Ya maybe Riot can actually put it to good use and make sure people actually get to level 3-5 on the champion to play it in rank.","replies":[{"poster":"DrCyanide","date":"2017-03-24T07:10:44.034+0000","up_votes":4,"down_votes":1,"body":"We've covered this before, having a champion mastery restriction would effectively prevent you from trading with allies, since you wouldn't be able to lock in the champion unless you both had them at the minimum level.","replies":[]}]},{"poster":"Glory ln Death","date":"2017-03-24T17:59:35.825+0000","up_votes":2,"down_votes":0,"body":"Require Mastery 2 to play a champion in ranked. Boom. Problem solved.","replies":[{"poster":"Mig89","date":"2017-03-24T19:48:27.421+0000","up_votes":1,"down_votes":1,"body":"Dumb for two reasons. You would need 16 champs with mastery two just to play ranked. Second reason is mastery 2 is no different than being brand new to a champ","replies":[{"poster":"Glory ln Death","date":"2017-03-24T20:56:33.738+0000","up_votes":2,"down_votes":0,"body":"It takes 5-10 games to hit Mastery 2. It's not difficult to get that on 16 champs. And, yes, you aren't going to be great with them with just Mastery 2, but at least you know the basics of the champion.","replies":[{"poster":"UpDownLeftRightAB","date":"2017-03-25T00:28:49.400+0000","up_votes":1,"down_votes":0,"body":"Not if you S rank :p only takes like 2 games at most (Since S rank is between 1500-2000 points, rank 2 is 1800)","replies":[]}]},{"poster":"AMYS GRAVE","date":"2017-03-24T21:05:41.237+0000","up_votes":1,"down_votes":0,"body":"So you should have some basic game knowledge of some champions to play ranked and that's a problem somehow?","replies":[]}]},{"poster":"ZephyrDrake","date":"2017-03-24T23:29:56.876+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Glory ln Death,realm=NA,application-id=3ErqAdtq,discussion-id=8X1zE7mc,comment-id=0001000400000002,timestamp=2017-03-24T17:59:35.825+0000)\n>\n> Require Mastery 2 to play a champion in ranked. Boom. Problem solved.\n\nwhat problem? you think that would somehow make people not suck at the champion? you will see the exact same people who feed with the champion still feed with the champion. Once again, you can literally reach mastery lvl 5 with any champion by losing every single game. You could even just AFK all games and not even bother playing the champion and you would still be able to reach mastery lvl 5. It'll take forever to get but you can. What mastery lvl you have with a champion means next to nothing","replies":[{"poster":"Glory ln Death","date":"2017-03-25T00:55:28.197+0000","up_votes":1,"down_votes":0,"body":"You may not be great, but at least it shows that you have played the champion a few games before taking it into ranked and are at least somewhat familiar with it.","replies":[]}]}]}]},{"poster":"RainbowIcee","date":"2017-03-24T14:46:38.910+0000","up_votes":1,"down_votes":0,"body":"A game that relys on banning champions sounds like it has balance problems. Maybe we should encourage riot to make the game where we dont need to ban 10 champs. (Currently 6 but people want more)","replies":[{"poster":"AMYS GRAVE","date":"2017-03-24T21:08:17.537+0000","up_votes":1,"down_votes":0,"body":"Well they've had years to solve their balance problems so we aren't getting that. Bans are the best solution we can realistically hope for. I agree in principle but in practice the balance of this game remains mediocre at best.","replies":[{"poster":"RainbowIcee","date":"2017-03-24T22:28:02.837+0000","up_votes":1,"down_votes":0,"body":"mediocre is giving it too much credit. Champions, dragon, baron, minions and towers are unbalanced.","replies":[{"poster":"AMYS GRAVE","date":"2017-03-24T22:37:19.725+0000","up_votes":1,"down_votes":0,"body":"There have been short periods of time in the past where balance has been ok, but its been a while.","replies":[]}]}]}]}]},{"poster":"GULAG 4 U","date":"2017-03-23T23:01:23.206+0000","up_votes":2,"down_votes":0,"body":"Well, till you end up with 4 people wanting to play Galio on your team...","replies":[{"poster":"Wind Whistler","date":"2017-03-25T00:25:04.221+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=XTRMN00B1337,realm=NA,application-id=3ErqAdtq,discussion-id=8X1zE7mc,comment-id=00010000,timestamp=2017-03-23T23:01:23.206+0000)\n>\n> Well, till you end up with 4 people wanting to play Galio on your team...\n\ntmw Old Galio was stronger than New Galio but everyone wants to play New.","replies":[]}]}]},{"poster":"Gelmous","date":"2017-03-24T02:24:55.987+0000","up_votes":7,"down_votes":0,"body":"yeah there's already a thread discussing this exact subject literally sitting on the front page with 150 upvotes made 24 hours ago, why did think there's a need to make a new one?","replies":[{"poster":"DrCyanide","date":"2017-03-24T07:11:53.301+0000","up_votes":7,"down_votes":2,"body":"\"Front page\" is relative - there are 4 front pages, one for each of the four ways to sort the boards.","replies":[{"poster":"mikemcparty","date":"2017-03-24T12:42:01.290+0000","up_votes":1,"down_votes":0,"body":"They are both in gameplay.","replies":[{"poster":"DrCyanide","date":"2017-03-24T13:20:54.585+0000","up_votes":3,"down_votes":1,"body":"But that doesn't answer the question \"which frontpage\", since that leaves 8 possible front pages.\n\n* Boards - New\n* Boards - Recent\n* Boards - Hot\n* Boards - Best\n* Gameplay - New\n* Gameplay - Recent\n* Gameplay - Hot\n* Gameplay - Best","replies":[{"poster":"mikemcparty","date":"2017-03-24T16:42:52.494+0000","up_votes":2,"down_votes":3,"body":"The \"front page\" is the boards page that loads up when you first go to the boards. Don't play dumb.","replies":[{"poster":"DrCyanide","date":"2017-03-24T17:16:35.628+0000","up_votes":3,"down_votes":1,"body":"Understand how the boards work before you accuse me of playing dumb.\n\nEach section remembers the way you sorted it the last time you were there, so when you refresh the page or pull up the boards on another device it's sorted that way. As I recall it defaults to Best the first time you load up, but since those topics rarely change people swap to one of the other 3 depending on their viewing habits. From that point on, that becomes their default. \n\nAll 8 options I listed were valid front pages that people could have selected at some point in the past and be using. It's ignorant to assume others are using the same sorting as you.","replies":[]}]}]}]}]}]},{"poster":"FantasySniper","date":"2017-03-25T05:26:26.435+0000","up_votes":2,"down_votes":0,"body":"*what Smite did.","replies":[{"poster":"General Esdeath ","date":"2017-03-25T22:20:23.457+0000","up_votes":1,"down_votes":0,"body":"Don't play Smite so I didn't know","replies":[]}]},{"poster":"ItsOrval","date":"2017-03-24T20:26:46.135+0000","up_votes":2,"down_votes":0,"body":"Right. I just had a Galio jungle last game in plat rank, he went 2/8 in 15 minutes","replies":[]},{"poster":"DonnieDarkin","date":"2017-03-24T20:30:29.867+0000","up_votes":3,"down_votes":1,"body":"That would require Riot to actually give a shit about their players experience in ranked play.","replies":[]},{"poster":"The Djinn","date":"2017-03-23T22:55:06.224+0000","up_votes":3,"down_votes":1,"body":"Conceptually I rather like this idea, and would be curious to see any arguments for/against it that Riot might have debated. Because I'm CERTAIN they have considered this possibility, and that probably means there are strong arguments against it that I'm not thinking of right now, or it's still a topic in discussion.\n\nThere's also the argument that you have to purchase individual characters in *League* but get them all for free in *Overwatch*, which means denying someone a character in their preferred game mode is a bit more of a blow to the player. That alone is a rather compelling argument to keep them usable, and definitely complicates the discussion.","replies":[{"poster":"LOSINGISMYPRIDE","date":"2017-03-24T01:20:52.755+0000","up_votes":1,"down_votes":0,"body":"the think is you need to not destroy the ecosystem of wht is ranked and player mind . Why do they ban new heroes in ranked in overwatch is because there are alot of bug that sometime ppl use as abuse and actually win game .Overwatch is actually young as a community and game . Wht i also mean by ecosystem and player is you dont want to ruin the mood of 1 million daily player who want to play the new champ in ranked .","replies":[{"poster":"The Djinn","date":"2017-03-24T01:29:10.624+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=NoloveNorust,realm=NA,application-id=3ErqAdtq,discussion-id=8X1zE7mc,comment-id=00000000,timestamp=2017-03-24T01:20:52.755+0000)What i also mean by ecosystem and player is you don't want to ruin the mood of 1 million daily player who want to play the new champ in ranked .\n\nOh, I totally get that. I'm just trying to think like a developer here and weight the pros and cons. A big pro is keeping characters players are new to out of ranked...but a big con is not letting players who prefer ranked play their new modes with their new purchases.\n\nIt's even more complicated by the fact that there's nothing stopping me from buying a champion I've never played who ISN'T new and taking THAT champion into ranked, so I feel that unless we limit the \"new champion purchase\" ranked play as well as the \"new champion released\" ranked play we're being hippocritical.","replies":[{"poster":"LOSINGISMYPRIDE","date":"2017-03-24T01:51:31.156+0000","up_votes":1,"down_votes":0,"body":"I also understand your point and it would solve some problem but cause other one . Why they making OP champ at the release , its because they want them to buy the champion and use it . It also put a idea in the mind of the player that with this you will be succesfull and extremely strong ( in some point yes but a op kit doesnt cover your own mistake in game ) and the last think who come in my mind is that there are alot of variety in the champ select and overwatch dont have that so it make the balancing way harder in some point . They need to make the hero not too op , not too weak , fun to play with and against , not conflicting with the playground , bug , interaction , etc .\nThe game of overwatch is at a young state where they try to slowly make a enjoyable place and entertaining . League already have these aspect and no one cant conflict against the entertainement of your customer or they become angry as fck and break thing or threat from stopping the game . Overwatch actually free game , league of legend grinding game , free but still grinding game .","replies":[{"poster":"The Djinn","date":"2017-03-24T01:56:53.215+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=NoloveNorust,realm=NA,application-id=3ErqAdtq,discussion-id=8X1zE7mc,comment-id=0000000000010000,timestamp=2017-03-24T01:51:31.156+0000)Why they making OP champ at the release , its because they want them to buy the champion and use it .\n\nSo this is entirely untrue, actually. I say this as someone who has talked to Riot designers personally in several contexts. They want new champions to be usable, but they want ALL champions to be somewhat usable. It's just that recently a lot of champions have erred on the stronger side, but there have been a number of releases that were underpowered at first as well.","replies":[]}]}]}]},{"poster":"Swollwonder","date":"2017-03-24T18:48:45.523+0000","up_votes":1,"down_votes":0,"body":"They have. The reason, I believe, they don't do it is because any champion has the potential to be new to the individual player. If I unlock yasuo and decide I'm going to first time him in rank how's that any different from when a new champion releases? I guess you could make it so that new champions both bought and released are locked for a week in ranked but that just feels awful to buy something and then not be able to use it hence why they probably don't do it.","replies":[]}]},{"poster":"Penta Penguin","date":"2017-03-24T19:12:18.145+0000","up_votes":3,"down_votes":2,"body":"1) Galio abilities and gameplay revealed a few weeks ago\n2) Players on PBE have played him for a few weeks\n3) Youtubers play him with higher levels and strategy and post videos for a few weeks\n4) skillshots, magic damage shields, dashes, shen ults revealed 10 years ago\n**\n5) new champs are a very small problem compared to the hordes of idiots playing their 20% win-rate champions in ranked or other gimped shit that doesn't work well for them**\n\nno problem","replies":[{"poster":"General Esdeath ","date":"2017-03-25T22:22:19.130+0000","up_votes":1,"down_votes":0,"body":"1) So was the new OW champ\n2) Not everyone has a PBE account\n3) If people could learn that easily, all RedMercy's fans would be diamond\n4) Shield is nothing like Shen\n\n5) We can't solve 2 problems at once?","replies":[]},{"poster":"TittiesRUs","date":"2017-03-24T19:34:59.251+0000","up_votes":1,"down_votes":0,"body":"Not everyone has access to a PBE account. Actually very few have access to one.","replies":[{"poster":"Penta Penguin","date":"2017-03-24T22:15:41.728+0000","up_votes":1,"down_votes":0,"body":"It's still an organic look at how the champion plays in real games, whether you play there or see it on youtube","replies":[]}]}]},{"poster":"gottrjr","date":"2017-03-24T16:48:18.100+0000","up_votes":2,"down_votes":1,"body":"Riot is too stubborn to do anything they are asked or told to do.","replies":[]}]}