{"poster":"DronDrondrigo","date":"2015-02-15T11:44:41.197+0000","title":"Schermo nero/crash/bug o come volete","subforum":"Aiuto e supporto","up_votes":1,"down_votes":2,"body":"Scusate il disturbo, amici miei, ma avrei un piccolo problema :)\r\nEro in partita e stava andando tutto liscio ma ad un certo punto il gioco si blocca e mi dice \"tentativo di riconnessione\" (con il solito 500 di ping). Esco dalla partita e provo a fare \"riconnetti\" ma non entra. Infatti, mi compare solo una schermata nera con la scritta League Of Legends al centro e nient'altro. Dopo un po' che aspetto mi dice: \"impossibile collegarsi al server\", e continua a dirmi la stessa cosa ogni volta che provo a fare \"riconnetti\".\r\nHo notato che la vittima non sono solo io, ma bensì anche alcuni miei amici che erano nella stessa partita.\r\nDunque, che sta succedendo? E' possibile fare qualcosa?\r\n\r\n\r\n\r\nGrazie per l'attenzione","replies":[{"poster":"Anserot","date":"2015-02-15T17:18:53.948+0000","up_votes":1,"down_votes":0,"body":"è successa la stessa cosa anche a me ma dopo 1 ora non connette ancora xD","replies":[{"poster":"Ah non lo so io","date":"2015-02-15T18:02:20.929+0000","up_votes":1,"down_votes":0,"body":"idem, 1 ora e 20 minuti qua! :)","replies":[]}]},{"poster":"Ah non lo so io","date":"2015-02-15T16:46:05.670+0000","up_votes":1,"down_votes":0,"body":"Appena successo anche a me, inizia la partita faccio un passo, 500 ping, esco cercando di rientrare ma niente da fare.","replies":[]},{"poster":"ViaMalinconiaN9","date":"2015-02-15T13:29:07.117+0000","up_votes":1,"down_votes":0,"body":"si è successo ora a me..\nsolo che il mio ping è 29....","replies":[]},{"poster":"Ghost Stalker","date":"2015-02-15T11:55:15.653+0000","up_votes":1,"down_votes":0,"body":"Meglio inviare al supporto,nel caso prova aspettare che finisca la partita magari è un errore del client (molto probabil).\nPer esperienza personale faccio sempre fatica a rientrare in una partita quando \" cado\" alle volte riavvio il client alle volte devo riavviare il pc perchè non mi fa rientrare.","replies":[]}]}