{"poster":"Just Quinn It","date":"2015-11-25T08:26:02.163+0000","title":"Team sucht Midlaner und Jungler","subforum":"Clans & Teams","up_votes":1,"down_votes":1,"body":"Hall&ouml;chen,\r\n\r\nWir suchen f&uuml;r unser Team noch einen netten Midlaner und einen Jungler.\r\n\r\nDa wir nicht ganz anspruchslos sind und ein wenig was erreichen wollen. Haben wir auch ein paar Anforderungen an euch:\r\n\r\n- Ihr solltet mindestens Silber sein und ein Mindestalter von 16 Jahren aufweisen.\r\n- Auch wenn ihr eure Main Champs habt solltet ihr bereit sein auch neue Champs zu lernen.\r\n- Ihr solltet drei Tage in der Woche ab 19 Uhr Zeit haben zum zusammen spielen.\r\n\r\nSolltet ihr Interesse haben meldet euch bei Creepex oder hi im rav3n.\r\n\r\nPS: Desweiteren sind wir auf der Suche nach einem Auswechselspieler der die oben genannten Anforderungen auch erf&uuml;llen sollte und mindestens 3 Lanes spielen kann.","replies":[{"poster":"Just Quinn It","date":"2015-11-29T18:52:18.745+0000","up_votes":1,"down_votes":0,"body":"#push\n\nJungler wieder gesucht!","replies":[]},{"poster":"Paulxxx30","date":"2015-11-25T11:22:53.772+0000","up_votes":1,"down_votes":0,"body":"Ich würde mich gerne als Wechselspieler bewerben.\n\nIch erfülle nicht alle Anforderungen in benötigten Maße.\nIch bitte darüber hinwegzusehen. Mein main acc Paulv5 befindet sich ebenfalls nur knapp in dem benötigten Gebiet ich kann aber auch gerne mit meinen Smurf (paulxxx30/granowizard) mit euch zusammen spielen solltet ihr das wollen.\nWas die lanes angeht auf denen ich spielen kann sind diese Jungle/supp wobei ich auch Mid/top/adc auf einem hohen Niveau spielen kann(bezogen auf meine elo).\nIch freue mich auf etwaige Rückmeldungen diese bitte per pn an Paulxxx30","replies":[]},{"poster":"CSE Kazak","date":"2015-11-25T09:32:48.858+0000","up_votes":1,"down_votes":0,"body":"Würde mich gerne zur Verfügung stellen bin momentan silber 4 main mid/jungle obwohl ich sagen muss das mein champion pool in der mitte deutlich größer ist als im jungle :D","replies":[]}]}