{"poster":"JewishVortic","date":"2016-07-15T19:45:07.288+0000","title":"Props to ghostcrawler!","subforum":"[ARCHIVED] Miscellaneous","up_votes":55,"down_votes":6,"body":"He's doing what few rioters do, responding to questions honestly and thoughtfully. Hes even responding to all the critical and harsh comments. Thanks dude, I (and probably the rest of the community) appreciate it.\n\n**edit: please take the salt elsewhere. This is a positive thread for the purpose of recognizing something admirable that gc did, so chill pls","replies":[{"poster":"Ghostcrawler","date":"2016-07-15T23:28:13.536+0000","up_votes":56,"down_votes":4,"body":"I appreciate it and I will try not to be such a stranger around here.","replies":[{"poster":"Marshbouy","date":"2016-07-16T02:25:02.131+0000","up_votes":8,"down_votes":1,"body":"Put the martini down!","replies":[]},{"poster":"Alüe","date":"2016-07-16T04:27:08.384+0000","up_votes":4,"down_votes":1,"body":"Don't know if you will read this, so it may be a waste. However as a developer I dislike you. Not because of your record of gaming or for who you are, but because of your vision of what exciting game play is. Face it you have a hard on for burst / snowball metas, you believe they are fast action and fun. It's sort of what made wow un fun (not directing it was solely you as I'm sure others contributed) . I dislike how much you like the assassin concept and how you don't consider slow paced games rewarding. I'm sure you've directed this season to fit more of your vision, along with other developers help. Just my two cents gc! you do you, but league died for me when you took your concept of bursty/crap mechanics (imo) as fun...","replies":[]},{"poster":"Synnx7","date":"2016-07-16T01:35:14.274+0000","up_votes":8,"down_votes":38,"body":"> [{quoted}](name=Ghostcrawler,realm=NA,application-id=cIfEodbz,discussion-id=VTnqa0NM,comment-id=0000,timestamp=2016-07-15T23:28:13.536+0000)\n>\n> I appreciate it and I will try not to be such a stranger around here.\n\nGood job ruining wow.\nGood job ruining this game as well\ndownvotes inc. i don't really care","replies":[{"poster":"TheSingularity","date":"2016-07-16T04:43:44.781+0000","up_votes":5,"down_votes":3,"body":"Ruining wow you say? From what I can see it's still releasing expansions and has a decent player base.\nThis game still has a massive player base and no single rioter can single handedly destroy this game. As for their idea to become a reality, someone else must approve . Ghostcrawler can never ruin this game, dynamic queue does not account for the entire game. Because someone else must ruin it along with him. And I doubt that will happen anytime soon.\n\nGet better logic and use it to go back to school","replies":[{"poster":"Ryzing2Diamond","date":"2016-07-16T05:47:37.634+0000","up_votes":6,"down_votes":3,"body":"> [{quoted}](name=KrakenKnight,realm=OCE,application-id=cIfEodbz,discussion-id=VTnqa0NM,comment-id=000000010002,timestamp=2016-07-16T04:43:44.781+0000)\n>\n> Ruining wow you say? From what I can see it&#x27;s still releasing expansions and has a decent player base.\n> This game still has a massive player base and no single rioter can single handedly destroy this game. As for their idea to become a reality, someone else must approve . Ghostcrawler can never ruin this game, dynamic queue does not account for the entire game. Because someone else must ruin it along with him. And I doubt that will happen anytime soon.\n> \n> Get better logic and use it to go back to school\n\nYup. WoW isn't 'ruined'. All the hard-core players who played for several years got bored of it, and when their gear that only they could get by their elitist raiding clique, became outdated due to expansions and other such stuff, and they could no longer flaunt it to their \"friends\", they got pissy, claimed that WoW was becoming more casual, and quit. Meanwhile, Blizzard is still raking in millions from the people who actually enjoy new content.","replies":[]}]},{"poster":"AMYS GRAVE","date":"2016-07-16T03:21:22.141+0000","up_votes":3,"down_votes":0,"body":"http://boards.na.leagueoflegends.com/en/c/gameplay-balance/ydAqrpb4-ghostcrawler-and-his-failures?comment=0003\n\nhaha, he drinks on the job too apparently.","replies":[{"poster":"Punkkee","date":"2016-07-16T17:39:46.931+0000","up_votes":2,"down_votes":0,"body":"wow that's a pretty seriously toxic thread towards ghostcrawler.. poor guy","replies":[]},{"poster":"Only Play Darius","date":"2016-07-16T16:02:50.883+0000","up_votes":1,"down_votes":0,"body":"A company that allows employees to drink liquor at work? Is that something to be proud of? Oh wait I forgot they're in California","replies":[]}]},{"poster":"Aeszarck","date":"2016-07-16T02:06:45.823+0000","up_votes":9,"down_votes":5,"body":"> [{quoted}](name=Synnx7,realm=EUNE,application-id=cIfEodbz,discussion-id=VTnqa0NM,comment-id=00000001,timestamp=2016-07-16T01:35:14.274+0000)\n>\n> Good job ruining wow.\n> Good job ruining this game as well\n> downvotes inc. i don&#x27;t really care\n\nWhat a jerk. Keep it to yourself.","replies":[]}]},{"poster":"HaloDragonX","date":"2016-07-16T03:05:39.774+0000","up_votes":3,"down_votes":1,"body":"Can I ask a legit question here? Since I have no idea if the OP is refering to some question thing you did, but I'm kinda wondering.\n\nConsidering Tristana is very weak right now, and Kayle and Kog'Maw are very reliant on Rageblade to stay relevant, do you have any future ideas to make the micro class of auto attack champions diverse and strong? The meta and game skewed towards CDR and while some need it (Kayle) while the rest don't, these people aren't casting abilities much. Tristana blurs lanes with Jinx, Kayle is basically a weaker version of Azir (Different abilities, similar effects when you really loook at it.) and Kog'Maw as the identity of a machine gun but needs Rageblade. Any ideas on how to make the attacking hypercarries viable?","replies":[{"poster":"Sweenster","date":"2016-07-16T19:04:24.229+0000","up_votes":2,"down_votes":0,"body":"I will direct you here: http://ask.fm/riotghostcrawler\n\nHe regularly answers questions on that page. Unfortunately it doesn't seem like there's a great way to search past answers, but you could submit it there for a better chance at a response.","replies":[]}]},{"poster":"Kei143","date":"2016-07-16T11:02:34.468+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Ghostcrawler,realm=NA,application-id=cIfEodbz,discussion-id=VTnqa0NM,comment-id=0000,timestamp=2016-07-15T23:28:13.536+0000)\n>\n> I appreciate it and I will try not to be such a stranger around here.\n\nRiot Repitior went through 150 messages or so in his megathread, you can beat his record!!","replies":[]},{"poster":"redfeenix","date":"2016-07-15T23:49:34.314+0000","up_votes":3,"down_votes":2,"body":"Major props bud! I havnt seen you much before but between you and reaver I feel like my voice / concerns are being heard. Thanks to you both! You dont see this level of interaction at any other major studios ...","replies":[{"poster":"JewishVortic","date":"2016-07-17T03:15:39.279+0000","up_votes":1,"down_votes":0,"body":"You actually responded!! :D \nKeep it up dude!","replies":[]}]},{"poster":"Linna Excel","date":"2016-07-16T02:25:39.218+0000","up_votes":2,"down_votes":1,"body":"Thank you for showing up.  One thing I've been hoping for was a rioter who could just come by, explain things, answer a few questions, and the like.","replies":[]},{"poster":"JewishVortic","date":"2016-07-17T03:20:42.231+0000","up_votes":1,"down_votes":0,"body":"You actually responded!! :D\nKeep it up dude!","replies":[]},{"poster":"General Esdeath ","date":"2016-07-16T20:50:38.026+0000","up_votes":1,"down_votes":0,"body":"Boxers or briefs?","replies":[]},{"poster":"  Tyler Fking 22","date":"2016-07-16T02:09:01.143+0000","up_votes":1,"down_votes":0,"body":"> lick my donger, ill 1v1 you and whoop YO ASSSSSSSSSSSSSSSSSS~~~~~~~~~~~~_**{{champion:74}} **_~~~~~~~~~~~~","replies":[]},{"poster":"AMYS GRAVE","date":"2016-07-16T03:18:40.703+0000","up_votes":2,"down_votes":3,"body":"Grab yourself a martini GC, you deserve it. \n\nCheers!\n\nEDIT: you guys missed the joke.... ","replies":[]}]},{"poster":"Only Play Darius","date":"2016-07-16T03:03:32.038+0000","up_votes":9,"down_votes":3,"body":"Isn't he the one everyone says ruined Warcraft and is now ruining League.....","replies":[{"poster":"Xeruon","date":"2016-07-16T06:48:37.459+0000","up_votes":6,"down_votes":1,"body":"He and he alone isn't responsible for the majority of it. It just so happed, and still happens to be the head of the team who made those changes, thus being held responsible for all of it.\n\nYes, he has made quite a few mistakes, but to blame him for everything gone wrong is simply ignorant.","replies":[]}]},{"poster":"DeathBurst","date":"2016-07-16T09:17:08.503+0000","up_votes":2,"down_votes":0,"body":"It's good to thanks Ghostcrawler for his efforts.\n\nIt's not good to casually bash other Rioters at the same time. Especially when Meddler or Katey Khaos or plenty of others also post on the forums almost every day to answer player questions.","replies":[{"poster":"JewishVortic","date":"2016-07-17T03:14:59.602+0000","up_votes":1,"down_votes":0,"body":"I'm not bashing anyone! What those 2 do is also amazing. But the raw amount of hatred he's responding to is just.....admirable","replies":[]}]},{"poster":"The Deckowner","date":"2016-07-16T01:35:42.140+0000","up_votes":2,"down_votes":0,"body":"Where was meddler?","replies":[]},{"poster":"DarkSunSovereign","date":"2016-07-16T13:14:29.240+0000","up_votes":1,"down_votes":2,"body":"Lol, he's only responded to a thread hating on him on his recent history, wtf are you talking about.","replies":[{"poster":"JewishVortic","date":"2016-07-17T03:21:47.077+0000","up_votes":1,"down_votes":0,"body":"Yea, and that's admirable. What other rioter would do that? Take your salt somewhere else.","replies":[{"poster":"DarkSunSovereign","date":"2016-07-17T15:16:31.699+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=makoharu1,realm=NA,application-id=cIfEodbz,discussion-id=VTnqa0NM,comment-id=00050000,timestamp=2016-07-17T03:21:47.077+0000)\n>\n> Yea, and that&#x27;s admirable. What other rioter would do that? Take your salt somewhere else.\n\nIf his responding to a thread hating on him is admirable, then my response to your comment hating on me is admirable too, right? Yay I'm admirable now /s","replies":[{"poster":"JewishVortic","date":"2016-07-17T15:22:34.638+0000","up_votes":1,"down_votes":0,"body":"It's more like he understands how pissed the community is, and is trying his best to communicate despite how rude and harsh the comments/questions are. \nI'm not quite sure what you're trying  to accomplish other than attempting to be a dick. ( it isn't really working, you kinda just look stupid)","replies":[{"poster":"DarkSunSovereign","date":"2016-07-17T17:26:50.700+0000","up_votes":1,"down_votes":0,"body":"What I'm trying to accomplish is to express my opinion, just what you're doing (Does that mean you look stupid t... oh nvm, you do).\nAnd don't you think it's waaaaaay to late for Riot to start communicating? Not to mention he only seems to be answering questions about DQ the answers to which we already know, he only new piece of info I saw was \"Different MMRs for SQ and DQ is on the table\" (which is AWESOME btw). He hasn't answered questions on sandbox mode, for example.","replies":[]}]}]}]}]},{"poster":"Vanjie","date":"2016-07-17T03:24:56.612+0000","up_votes":1,"down_votes":0,"body":"I do appreciate it. I do appreciate him talking to me about the concerns with solo players in dynamic que.\n\nIf we can get more context on Karma and what they want to do with her exactly, I would be at least contempt with that. All we have gotten from the Red Names is we don't plan on working on . . . . . but have no problem nerfing her. I am frustrated with the balance and update team. I find everyone on the update and balance team unresponsive and they just don't care. ","replies":[{"poster":"JewishVortic","date":"2016-07-17T03:30:35.687+0000","up_votes":1,"down_votes":0,"body":"Unfortunately, they are a business and they can't tell the customer everything. You can tell gc is trying rly hard to be a cut above the rest in terms of responsiveness","replies":[]}]},{"poster":"The LDC","date":"2016-07-17T03:17:39.493+0000","up_votes":1,"down_votes":0,"body":"yeah props to ghost crawler a guy who I don't know but all ive got to say to him was \n\n https://tse2.mm.bing.net/th?id=OIP.M8ede9b1c76a35d67ce94742a68a8d34fo0&w=251&h=153&c=7&rs=1&qlt=90&o=4&pid=1.1","replies":[]},{"poster":"LoL is crack yo","date":"2016-07-16T10:42:21.766+0000","up_votes":4,"down_votes":4,"body":"You can also give him props for ruining League with his balance changes, just like he did to WoW. Anyone else noticed that after he joined Riot (around the time juggernaut changes happened) the game started to go downhill? Yeah peple can say it's not 100% his fault, but he IS in charge of the balance team so he has the ultimate say.","replies":[{"poster":"vampirekid13","date":"2016-07-16T10:49:38.036+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=LeonardoMiguzzi,realm=EUW,application-id=cIfEodbz,discussion-id=VTnqa0NM,comment-id=0004,timestamp=2016-07-16T10:42:21.766+0000)\n>\n> You can also give him props for ruining League with his balance changes, just like he did to WoW. Anyone else noticed that after he joined Riot (around the time juggernaut changes happened) the game started to go downhill? Yeah peple can say it&#x27;s not 100% his fault, but he IS in charge of the balance team so he has the ultimate say.\n\nthe first year he was with riot he had no say in anything actually, his first ama said that the changes happening when and after he joined are changes that were in the pipeline for about a year before, so maybe he has some say in stuff now, but the changes from right after he joined, and months after he joined were nothing to do with him.","replies":[{"poster":"JewishVortic","date":"2016-07-17T03:13:59.231+0000","up_votes":1,"down_votes":0,"body":"Read his post dude...there's an entire thread called \"ghostcrawler and his failures\". It's for with plenty of things similar to what you just said, and he answers them honestly","replies":[]}]},{"poster":"Alüe","date":"2016-07-17T01:09:05.693+0000","up_votes":1,"down_votes":0,"body":"i'd say the problems started to begin around the marksmanship update.","replies":[]},{"poster":"Mistress Madoka","date":"2016-07-16T11:39:30.491+0000","up_votes":2,"down_votes":2,"body":"WoW Ruined itself. Ghostcrawler had little to do with that.\n\nNot gonna comment on League atm, but Remember that Balance in an MMORPG is not done the same way it is done in a MOBA.\n\nThere's a lot more Depth to stuff like WoW's balance. You have a million different factors weighing in on it\nClasses, Racial bonuses, Party perks, enchantments, jobs, specializations, mastery trees, pets, auras, Status effects, Weapon stats etc etc\n\nMeanwhile, LoL, while having less technical Depth as a WoW balance system, has its own issues due to inherent differences in the games, the largest being Items\n\nEvery character in LoL has access to every single Item (Give or take a few special exceptions). This presents a few problems. In WoW this is easier to balance because Items can be Class Restricted. You probably wouldn't see a Druid attempting to slash Deathwing apart with an Infinity Edge, for example.\nIn League the only \"Class Restricted\" Items are {{item:3074}} {{item:3748}} {{item:3085}}\n\nI'm probably just repeating myself over and over at this point, but basically, The two games work completely differently. I have no Idea how this actually relates with most anything here.\n\nI am tired.","replies":[]}]}]}