{"poster":"La Teletón","date":"2017-01-08T21:46:23.660+0000","title":"Estado de los adc","subforum":"Charlas Generales","up_votes":15,"down_votes":3,"body":"Hola, quiero saber la opinion de la comunidad y ojala Riot si es que aparece, sobre el actual estado de los adc:\r\n\r\nPara iniciar, comentare que desde que empece a jugar siempre mainee el carril de adc, con campeones como Miss Fortune, Ezreal, Cait, Jinx y Vayne, este carril, supongo que como los otros tambien, ha tenido temporadas donde ha tenido m&aacute;s protagonismo y otras que un poco menos pero casi siempre ha logrado ser un rol fundamental a la hora de tener un equipo balanceado.\r\n\r\nLa caracteristica principal del Adc, se supone que es sacrificar todas sus opciones defensivas, a costas de ganar el mejor Da&ntilde;o por segundo del juego y la mejor opcion a la hora de tirar torres. Pero en este momento los adc no presentan ni una caracteristica de estas, es m&aacute;s, no estan presentando ni una caracteristica que destaque que los campeones de otro nicho no tengan mejor que los adc.\r\n\r\nAl final de cuentas, tomar un adc movil como Vayne, Quinn y quiza Ezreal, es lo mismo que tomar un adc de da&ntilde;o concentrado o movilidad media como Miss fortune, Cait, Ashe o Draven, porque ni la movilidad ni el da&ntilde;o concentrado que tienen los hace destacar del repertorio de campeones que hay en este momento. Los tanks se suponen que son lo contrario de los adc, un nicho de campeones que promete sacrificar su da&ntilde;o a coste de tener una defensa extraordinaria y ser excelentes iniciadores y es lo que hacen muy bien excepto que... Tienen m&aacute;s da&ntilde;o que un Adc. \r\n\r\nCampeones como Poppy, Jarvan, Garen, Darius, Illaoi, Zac, etc, podria seguir dando una gran cantidad de campeones, pero el punto que es todos esos campeones, en reitaradas veces los vi armarse un objeto de da&ntilde;o como la cuchilla oscura o la hidra titanica y seguir armandose tank.\r\n\r\nA lo que voy es que, con las maestrias nuevas en especial el coraje del coloso, campeones como los nombrados anteriormente pueden atravesar todo un equipo, llegar al adc mediante los Gap Closers o alta movilidad, desintegrar al adc y salir vivos del equipo aliado como si nada. Cual es el problema? Los reworks de campeones y campeones nuevos tienen un Kit tan sobrecargado de habilidades y numeros tan altos, que la cantidad de opciones que tiene a la hora de hacer lo que se les ocurra hacer es exagerada, tanto por las habilidades de movilidad, cc fuerte y mucha defensa, forman parte de lo que son los tanques, colosos y luchadores del juego hoy. \r\n\r\nLos magos tienen en general un burst para aplicar grandes cantidades de da&ntilde;o  pero cada cierto rato.\r\nLos asesinos tienen la capacidad de entrar rapidamente y matar a un campeon fragil, a costo de tener que poseer una muy buena capacidad de observacion para ventanas de oportunidades.\r\nLos supports tienen ventajas como salvar aliados y dar ventanas de oportunidad para crear un trade favorable, ademas de que tienen la ventaja de que son casi siempre los ultimos a los que se les hace focus. \r\n\r\nLos adc no tienen ni una ventaja sobre los otros nichos, los tanques y colosos tienen m&aacute;s de las que deberian. \r\nEn este momento ser main adc es horrible, es injugable, la unica manera de tener influencia es tener una etapa de carril en la que te fedees para tener un mid y late game lo suficientemente bueno como para por lo menos causar un buen da&ntilde;o a los campeones fragiles cuando tu equipo te ayuda con el peel, pero es muy dificil lograrlo.\r\n\r\nSienten lo mismo? o creen que los adc estan bien?\r\n\r\nComo ultimo comentario: No creo que deberian buffear a los adc, muy por el contrario creo que deberian nerfear a TODOS los campeones porque estan casi todos rotisimos volviendo al juego en un constante &quot;el primero que ponga la habilidad en el otro gana el carril&quot;","replies":[{"poster":"Charlôtte","date":"2017-01-09T00:12:13.533+0000","up_votes":8,"down_votes":1,"body":"Para qué ser ADC si siendo jungla con Lee sin o Xin sos tanque y tenes buen daño. \nPara qué ser ADC si siendo Top con Darius, Camille o Riven tenés buen daño y sos tanque. \nPara que ser ADC si hasta Morgana deletea con su stun siendo soporte. (Y te llevas report por afk cada vez que te stunea :v)\npara qué ser ADC si los mids terminan tenendo habilidades casi sin CD y meten criticos sin items. \n¿Para qué ser ADC? ¿Para que te digan \"0/10\"? ¿Para tener un soporte que no wardee y te echen la culpa por tu desaparición instantánea cada vez que te meten una Q desde el bush o bajo torre? ¿Para que Lee/Brand Sup y Ziggs/Vayne/Teemo ADC te pusheen la linea hasta el nexo?\nEncima de 150 campeones solo ves 5, porque los mismos de tu team se repiten en el del enemigo.\n\nEstoy intentando retomar con Kindred el puesto en el que alguna vez fui feliz. Y la wea que está rotiiiisimo Kind, nadie los pickea por no ser popus, pero no saben lo que se pierden con esa R más rota que la de Camille.\n_(AVISO, fue un comentario muy genérico y extremista, sepan interpretar a qué me refiero)_","replies":[{"poster":"KerneI panic","date":"2017-01-09T01:23:39.847+0000","up_votes":1,"down_votes":0,"body":"root","replies":[]}]},{"poster":"Chisolin","date":"2017-01-08T22:43:20.177+0000","up_votes":6,"down_votes":1,"body":"Por algo es un juego en equipo y no un 1vs1, obviamente esto no se ve hasta llegar a ligas altas...\nDices que no hay diferencia entre un ADC con gran movilidad como {{champion:67}} o uno sin movilidad como {{champion:202}} o {{champion:21}} y luego te contradices con lo de que los tanks como {{champion:154}} o {{champion:254}} pueden llegar muy fácilmente al ADC y matarlo, cuando campeones con movilidad logran ponerse a salvo con 1 o 2 teclas...\nPues para eso sirve, es difícil entrar y matar a un ADC con mucha movilidad y defensa como {{champion:67}} {{champion:18}} o aunque sea un poco {{champion:81}} {{champion:18}}... \nTambién dices que hay tanques mas fuertes que los ADC ¿Cual es la diferencia? Que ellos son meles y todos los ADC son rangos, para eso sirve kitear, ademas, se supone que la fuerza de los ADC esta en sus ataques básicos, y no creo que haya mas de 5 tanques que en igualdad de condiciones le gane una pelea a golpes básicos a ningún ADC, y solo se me ocurre mencionar a {{champion:122}} {{champion:106}} {{champion:201}} por sus pasivas...\n\nEn definitiva en una pelea de equipos, si ves que ellos tienen una manera rápida de llegar a ti, usas un ADC con movilidad, y pueden pasar 3 cosas (si eres el objetivo principal):\n1_ Kiteas o corres, depende de la movilidad de tu perseguidor, el tiempo suficiente como para que tu equipo te defienda y él cambie de objetivo, se vaya o muera\n2_ Te comes todo lo que te lanzan, o tu team no le da importancia a tu perseguidor/es y terminan alcanzándote y mueres\n3_ Por alguna razón, ajena a las 2 anteriores, la pelea se gana/pierde sin tu participación (un combo, composición muy fuerte, una emboscada...)\nObviamente si ves que el equipo rival tiene mucha movilidad o iniciación y se te ocurre ir con un ADC que su única movilidad es el {{summoner:4}}, te van a borrar tan rápido que no te salva nadie ya que no les vas a dar el tiempo suficiente para hacerlo.\n\nJugar ADC es aceptar que cualquiera puede matarte gracias al mas minimo error que cometas o incluso sin cometer alguno, eres muy débil pero también la principal fuente de daño y asedio que tiene el equipo","replies":[{"poster":"La Teletón","date":"2017-01-09T00:26:34.185+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Chisolin,realm=LAS,application-id=v7qsfXsE,discussion-id=JEgJxzaa,comment-id=0001,timestamp=2017-01-08T22:43:20.177+0000)\n>\n> Por algo es un juego en equipo y no un 1vs1, obviamente esto no se ve hasta llegar a ligas altas...\n> Dices que no hay diferencia entre un ADC con gran movilidad como {{champion:67}} o uno sin movilidad como {{champion:202}} o {{champion:21}} y luego te contradices con lo de que los tanks como {{champion:154}} o {{champion:254}} pueden llegar muy fácilmente al ADC y matarlo, cuando campeones con movilidad logran ponerse a salvo con 1 o 2 teclas...\n> Pues para eso sirve, es difícil entrar y matar a un ADC con mucha movilidad y defensa como {{champion:67}} {{champion:18}} o aunque sea un poco {{champion:81}} {{champion:18}}... \n> También dices que hay tanques mas fuertes que los ADC ¿Cual es la diferencia? Que ellos son meles y todos los ADC son rangos, para eso sirve kitear, ademas, se supone que la fuerza de los ADC esta en sus ataques básicos, y no creo que haya mas de 5 tanques que en igualdad de condiciones le gane una pelea a golpes básicos a ningún ADC, y solo se me ocurre mencionar a {{champion:122}} {{champion:106}} {{champion:201}} por sus pasivas...\n> \n> En definitiva en una pelea de equipos, si ves que ellos tienen una manera rápida de llegar a ti, usas un ADC con movilidad, y pueden pasar 3 cosas (si eres el objetivo principal):\n> 1_ Kiteas o corres, depende de la movilidad de tu perseguidor, el tiempo suficiente como para que tu equipo te defienda y él cambie de objetivo, se vaya o muera\n> 2_ Te comes todo lo que te lanzan, o tu team no le da importancia a tu perseguidor/es y terminan alcanzándote y mueres\n> 3_ Por alguna razón, ajena a las 2 anteriores, la pelea se gana/pierde sin tu participación (un combo, composición muy fuerte, una emboscada...)\n> Obviamente si ves que el equipo rival tiene mucha movilidad o iniciación y se te ocurre ir con un ADC que su única movilidad es el {{summoner:4}}, te van a borrar tan rápido que no te salva nadie ya que no les vas a dar el tiempo suficiente para hacerlo.\n> \n> Jugar ADC es aceptar que cualquiera puede matarte gracias al mas minimo error que cometas o incluso sin cometer alguno, eres muy débil pero también la principal fuente de daño y asedio que tiene el equipo\n\nHola! entiendo perfecto tu punto, pero cuando dije que eran iguales con o sin movilidad, me referia a que el kit que poseen los campeones que salen y reworkean hoy les da tanta oportunidades de alcanzar al adc y atravesar las barreras que incluso kiteando muy bien, siendo movil y teniendo flash es inutil, ya que tienen tantas herramientas para crear un juego versatil que con solo alcanzarte una vez les basta para matar al adc o por lo menos a obligarlo a que se retire de la pelea/carril. Pero de todas formas entiendo a lo que te refieres","replies":[{"poster":"LGBT Valentina","date":"2017-01-10T00:39:25.347+0000","up_votes":1,"down_votes":0,"body":"Es dificil matar a un ADC en este meta bro...\nTenes solari-targon-redemption y la corona de mierda{{item:3109}} y estando janna en el meta\nTenes un adc con 3.5k de vida en total con escudos literalmente\n\n\nEl problema actual es este:\n1:Los ADC necesitan items 3-4+ items (y en vez de ser DPS, se transforman en burts, ya que DPS como tal no existe en este game)\n2: La torre de bot, es la unica que no tiene armadura, entonces es genial hacer un gank bot de 5 personas, sacar 2 kills (600), fb de torre (525) y sacar dg\n3: Malza-Ziggs-Syndra, estan actualmente en bot:\nAhora miremos\nSyndra: No esta balanceada (el parche que viene, probablemente este mas op), por que actualmente es Q-R y muere el adc, en early game, es pegarle 2-3 Q y el combo\nMalza supp: Literalmente se hace 2 vs 1\nZiggs: Tiene un win rate altisimo, en todas las lanes: Pero por que?, por que en early game lo ayudan, tiran torres, sacan objetivos y gold. Que pasa cuando el team obtiene esto? Le deniegan el baron al otro team, el counter absoluto de ziggs, es el baron\n\n\nLos ADC, son los mas mimados. No hay que nerfear a ningun champ de los que hablas\n\n\nEl problema actual del adc, es que necesita items (lo cual, esta perfecto), pero las partidas no duran tanto y con lo que dije anteriormente de la bot lane, es imposible remontar\n\nEn esta season, al min 10/20, practicamente se decide una partida","replies":[{"poster":"La Teletón","date":"2017-01-10T22:01:18.555+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Skaarl And Kled,realm=LAS,application-id=v7qsfXsE,discussion-id=JEgJxzaa,comment-id=000100000000,timestamp=2017-01-10T00:39:25.347+0000)\n>\n> Es dificil matar a un ADC en este meta bro...\n> Tenes solari-targon-redemption y la corona de mierda{{item:3109}} y estando janna en el meta\n> Tenes un adc con 3.5k de vida en total con escudos literalmente\n> \n> \n> El problema actual es este:\n> 1:Los ADC necesitan items 3-4+ items (y en vez de ser DPS, se transforman en burts, ya que DPS como tal no existe en este game)\n> 2: La torre de bot, es la unica que no tiene armadura, entonces es genial hacer un gank bot de 5 personas, sacar 2 kills (600), fb de torre (525) y sacar dg\n> 3: Malza-Ziggs-Syndra, estan actualmente en bot:\n> Ahora miremos\n> Syndra: No esta balanceada (el parche que viene, probablemente este mas op), por que actualmente es Q-R y muere el adc, en early game, es pegarle 2-3 Q y el combo\n> Malza supp: Literalmente se hace 2 vs 1\n> Ziggs: Tiene un win rate altisimo, en todas las lanes: Pero por que?, por que en early game lo ayudan, tiran torres, sacan objetivos y gold. Que pasa cuando el team obtiene esto? Le deniegan el baron al otro team, el counter absoluto de ziggs, es el baron\n> \n> \n> Los ADC, son los mas mimados. No hay que nerfear a ningun champ de los que hablas\n> \n> \n> El problema actual del adc, es que necesita items (lo cual, esta perfecto), pero las partidas no duran tanto y con lo que dije anteriormente de la bot lane, es imposible remontar\n> \n> En esta season, al min 10/20, practicamente se decide una partida\n\nClaramente no juegas mucho adc","replies":[{"poster":"LGBT Valentina","date":"2017-01-10T22:43:58.201+0000","up_votes":1,"down_votes":0,"body":"Claramente, estas jugando otra cosa","replies":[]}]}]}]}]},{"poster":"Doce51","date":"2017-01-09T02:58:23.240+0000","up_votes":2,"down_votes":0,"body":"No creo que el problema de la botlane pase específicamente por las stats de los otros campeones del juego. Me parece que fueron una serie de decisiones que ha tomado rito desde mediados de la Season 06, con respecto al meta, que dejaron a la botlane en mala condición. Iba a escribir un post sobre esto en la tarde, pero pensé que a nadie le interesaba en realidad. Voy a intentar exponer brevemente los hechos que yo pienso que dejaron a los adc en la condición actual en la que se encuentran.\n\n_**1. Fajín.**_\nPrimero, tenemos el hecho del nerfeo que le hicieron al QSS (Fajín) en el parche 6.9. El QSS era hasta entonces, una de las herramientas más efectivas para contrarrestar habilidades específicas que podían borrar a un adc, como la ulti de Zed.\n\n_**2. Primera sangre de torreta.**_\nPosteriormente a esto, Rito implementó la primera sangre de torre en el parche 6.15 para contrarrestar el meta del Lane Swap. Además de la primera sangre de torre, se le quitó la reducción de daño a las torretas exteriores de la botlane para darle un motivo al equipo que fuerza el Lane Swap para que se mantenga en su línea y no rote hacia top.\n\n_**3.  Centinelas de visión.**_\nEn el parche 6.22, el parche de la preseason, recuerden que se removieron los centinelas de visión y se cambió la dinámica de la invisibilidad y el camuflaje. Esto ha vuelto a quitar otra herramienta que ayudaba a los ADC's a cuidarse de los asesinos y los gankeos de algunos junglas.\n\nEn resumen, desde mi punto de vista, no es un asunto de que los otros roles estén especialmente fuertes. Si no que se ha incentivado a los otros roles a que se concentren en la botlane, porque es la línea que ofrece mejores recompensas al menor costo. Piensa que en la botlane ya hay 2 jugadores por lado, si le sumas el jungla, ya son 3 y si el mid se anima son 4. El jungla y el mid, al mismo nivel que el ADC, tienen mejores herramientas para matar al oponente, así que bajar a hacer un gank es casi una kill segura. Además de la kill o la asistencia, está el hecho que boosteas a tu propio ADC y al mismo tiempo dejas atrás al ADC oponente al quitarle la torreta donde poder tradear y farmear a distancia segura. Y 4 champs para una torre con resistencia reducida, es mantequilla.\n\nPor esto mismo que te explicaba de que el jungla y el mid, al mismo nivel, tienen mejores condiciones para mantenerse en la partida es que han ascendido los magos para sustituir a los ADC. Con muchos menos recursos, están mejor preparados ante un escenario adverso, como un gank con +1 o +2 oponentes.\n\nNo es que la situación actual explotó en las narices de todos, de la nada. Pienso que ha sido una sucesión de hechos, especialmente el de la primera sangre de torreta y la reducción de fortificación, los que han dado el escenario que tenemos. Si ha sido premeditado o no, sería otro tema de discusión.","replies":[{"poster":"BestAhriCuba","date":"2017-01-09T06:03:58.830+0000","up_votes":1,"down_votes":0,"body":"No estoy muy de acuerdo, primero lo del fajin nunca lo vi asi, la unica dificultad que puede traer para un adc como dices es que ya no puede quitarse la ulti de zed, pero zed es el peor asesino ahora mismo, despues de sus nerfeos es muy dificil que un zed llegue a matar a un adc con algo de movilidad y menos si tienes al support al lado. Tampoco puedes quitar la ulti de fiora pero ella no suele ultear al adc, es mas yo diria que a excepcion de katarina o shaco los asesinos no estan teniendo mucho exito actualmente.\n Lo de la rimera torre ha incentivado que se hagan mas clown fiestas en bot, eso lo veo negativo para los adc porque no tienen casi ninguna influencia en early game, incluso los adc con mas early como lucian o draven no llegan a ser determinantes en es fase de la partida.\n Esto me lleva a pensar que los adc se han vuelto muy item dependientes, y casualmente sus builds son las mas caras del juego, mientras que la build de un tanque es mucho mas barata eso ocasiona que un tanque tenga los obetos antes y se vuelva muy duro demasiado pronto para un adc. Lo de los wards tambien ha favorecido ha ciertos adc como {{champion:67}}  o {{champion:29}}","replies":[{"poster":"Doce51","date":"2017-01-09T16:57:44.631+0000","up_votes":1,"down_votes":0,"body":"Tienes razón en que el fajín no ha sido tan determinante, pero mi punto no es que lo haya sido en sí mismo, sino que ha sido un factor más que en suma con los otros han producido la situación actual.\n\n- Sobre el ascenso de Vayne y Twitch por el cambio en la invisibilidad y el camuflaje, si, claro, los ha ayudado. Pero son  solo 2 adc's que aprovechan estas dinámicas. Y en mi opinión personal , están evidentemente desbalanceados. En el mal sentido. La consistencia de Twitch en todas las fases de la partida es un despropósito considerando la cantidad de daño y el impacto que alcanza en late, si es que te deja llegar. Y el nerfeo de la Q de Vayne, al menos redujo en algo el poder que tenia en early-mid.\n\n- Sobre Lucian y Draven. El caso de Lucian es especial, a Lucian lo nerfearon directamente (en el rango de su q) e indirectamente con el nerfeo al Fervor y el cambio de la penetración de armadura por la Letalidad,además del nerfeo al Yoummu. En ese sentido, dejó de ser una alternativa viable para dominar en early. Caitlyn está en una posición estratosféricamente mejor y con riesgos super bajos. Sobre Draven, meh... creo que es parte del mismo problema de los Adc en general, no lo veo peor que la media. Un main Draven va a hacer bully en su línea hasta que comiencen los gankeos y ese para mí es el centro del problema.\n\nSegún mi visión de la situación actual, como lo dije anteriormente, lo principal es el asunto de las clown fiesta en bot. Eso es lo predominante. El hecho de que como meta favorecer a que el team se concentre en esta línea, está perjudicando mucho a un rol que necesita tiempo en la partida para comenzar a impactar en ella. Pienso que finalmente, a parte del meta de magos en bot, puede que el Lane Swap termine volviendo a ser la solución para responder al escenario actual. Incluso una rotación del ADC a mid y del APc a bot, no me parecería tan descabellado a estas alturas.","replies":[]}]},{"poster":"Kokoro Chacarero","date":"2017-01-09T04:13:26.978+0000","up_votes":1,"down_votes":0,"body":"> 3. Centinelas de visión.\nEn el parche 6.22, el parche de la preseason, recuerden que se removieron los centinelas de visión y se cambió la dinámica de la invisibilidad y el camuflaje. Esto ha vuelto a quitar otra herramienta que ayudaba a los ADC's a cuidarse de los asesinos y los gankeos de algunos junglas.\n\n{{champion:28}} {{champion:35}}","replies":[]}]},{"poster":"TSW Rorschach","date":"2017-01-08T21:54:49.545+0000","up_votes":2,"down_votes":0,"body":"La otra vez estaba leyendo sobre que el estado actual de los tiradores estaba muy atrás (considerando que una Vi con un item de daño y el resto tank te hace mierda), entonces dije: \"Bueno, quizá puedan acomodarlos un poco o equilibrar\".\n\nY luego me entero que nerfearán la jg para que los junglas gankeen a lvl bajo (normalmente bot, porque entre que sacas doble y torre :v).\n\nFuck logic.\n\nEncima que ahora Riot quiere impulsar a los magos de adc (por lo de Ziggs), como que los quieren tirar a un costado, y mirá que no soy main nadc (soy un asco en realidad), pero como supp sé realmente que los tiradores están en la mierda y no hacen más que seguir tirándolos abajo con esos cambios xd lo único que puedo ver bueno es el buff a Lucian porque su winrate estaba en el suelo (y hasta ahi porque cuando lo juego, débil no lo siento), pero en vez de buffear otros adcs que andan ahi nomas, se ponen a buffear el daño de Draven.\n{{sticker:zombie-brand-clap}}","replies":[{"poster":"La Teletón","date":"2017-01-08T21:59:58.506+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=HMorskoy,realm=LAS,application-id=v7qsfXsE,discussion-id=JEgJxzaa,comment-id=0000,timestamp=2017-01-08T21:54:49.545+0000)\n>\n> La otra vez estaba leyendo sobre que el estado actual de los tiradores estaba muy atrás (considerando que una Vi con un item de daño y el resto tank te hace mierda), entonces dije: &quot;Bueno, quizá puedan acomodarlos un poco o equilibrar&quot;.\n> \n> Y luego me entero que nerfearán la jg para que los junglas gankeen a lvl bajo (normalmente bot, porque entre que sacas doble y torre :v).\n> \n> Fuck logic.\n> \n> Encima que ahora Riot quiere impulsar a los magos de adc (por lo de Ziggs), como que los quieren tirar a un costado, y mirá que no soy main nadc (soy un asco en realidad), pero como supp sé realmente que los tiradores están en la mierda y no hacen más que seguir tirándolos abajo con esos cambios xd lo único que puedo ver bueno es el buff a Lucian porque su winrate estaba en el suelo (y hasta ahi porque cuando lo juego, débil no lo siento), pero en vez de buffear otros adcs que andan ahi nomas, se ponen a buffear el daño de Draven.\n> {{sticker:zombie-brand-clap}}\n\nSi! pero el problema en si no es el daño de los adc, en una partida de personajes fragiles los adc se pueden desenvolver super bien, pero si el otro equipo tiene tanks el adc deja de ser util automaticamente, el tank tiene mucha defensa y es lo que corresponde, pero tiene daño como para deletear a un adc con solo tocarlo y eso creo que no corresponde","replies":[]}]},{"poster":"Nyán","date":"2017-01-09T10:24:56.068+0000","up_votes":2,"down_votes":1,"body":"Los ADC valen callampa, eso es un hecho. Jueguen APC o algo así en bot.","replies":[]},{"poster":"CrYsiX","date":"2017-01-09T19:38:31.996+0000","up_votes":1,"down_votes":0,"body":"los adc no estan bien desde hace mucho tiempo, ahora exploto y alfin en riot reconocen el problema\n\n\"adc is fine\" poppy, syndra, ziggs mians.","replies":[]},{"poster":"TerremotoChileno","date":"2017-01-09T13:06:27.138+0000","up_votes":1,"down_votes":0,"body":"Ultimamente ser Adc da mucho asco...\nY probar cosas que sirven ahora como {{champion:115}}  adc en ligas bajas como la mia te flamean o se salen siendo que luego ganas fácilmente linea...","replies":[]},{"poster":"The Upside Down","date":"2017-01-09T11:43:59.479+0000","up_votes":1,"down_votes":0,"body":"Hoy en dia, al adc lo deletea cualquier linea, el jungler, el mid o el top.","replies":[]},{"poster":"Elyasviel","date":"2017-01-09T03:05:06.736+0000","up_votes":1,"down_votes":0,"body":"http://www.lolking.net/news/the-current-issues-with-the-adc-role\nAcá basicamente explican TODOS los problemas de los adc, les invito a que lean, si entienden inglés :D","replies":[]},{"poster":"Dildo de Moria","date":"2017-01-09T01:30:24.382+0000","up_votes":1,"down_votes":0,"body":"Como diría Ned Flanders \"las zapatillas son zapatillas y las luces son luces\". Un tanque aguanta, no pega, y puede ser que sea hiper aburrido que no pegue, pero dejate de joder, se arman un objeto de daño y el resto tanque y te revientan.","replies":[]},{"poster":"DanielGarrita","date":"2017-01-08T23:14:51.157+0000","up_votes":1,"down_votes":0,"body":"Los ADC estan en el pozo y los que son main de otras lineas no quieren verlo, pero como main adc te digo que muchas veces eh perdido la linea por el campeo de jungla, en especial los lee sin que pueden divearte y escapar, tu unica opcion despues de eso es farmear y llegar al late\nojala este año buffen a todos mis main. {{champion:202}} {{champion:51}} {{champion:22}} {{champion:21}} {{champion:17}}","replies":[{"poster":"Anivia420","date":"2017-01-09T01:20:09.509+0000","up_votes":1,"down_votes":0,"body":"{{champion:202}} {{champion:51}} {{champion:29}}  estan bastante fuertes son los unicos adc que rinden man xD","replies":[]}]},{"poster":"Rick Silence","date":"2017-01-09T00:58:36.945+0000","up_votes":1,"down_votes":0,"body":"Estoy totalmente de acuerdo con vos. Yo he estado intentando mainear adc hace como unos cuatro meses (juego poco) y ahora está imposible. Me he mudado a supp y mid y la diferencia es enorme, según lo siento yo. Están en el pozo ahora.","replies":[]},{"poster":"LePointZ","date":"2017-01-09T00:04:55.043+0000","up_votes":1,"down_votes":0,"body":"mira , realmente me da paja leer todo .Pero creo que los ac estan bien , el tema es que los tanque s estan muy duros desde la seasson pasada pero creo que el problema es el de los mid's , hay muchos magos y/o asesinos que tienen mucho rango y daño explosivo como malzahar ;brand : veigar (con ese stun mentiroso que si le evitas tiene su daño de area que te elimina con 2 botones sin necesidad de manos como tambien es el caso de los dos nombrados anteriormente ) El tema es que si no tenes buen team es dificil de contrarrestar todo eso , pero es como dijieron tambien otros  ; es cuestion de equipo (a veces no estan y tenes que cagarte :P ) pero todavia riot tiene que seguir nivelando los poderes/mecanicas/estadisticas de cada campeon , que es algo dificil ,hay mas de 100 campeones y siguen saliendo mas .Y no tienen mucho margen de error  hoy use a zed y daba lastima cinseramente despues de ganarle a una annie el early ( un enfriamiento de la W por 15 seg es mucho , lo combierte en un pobre tonto con mucho daño que no tiene chance de escapar si en la tf sale algo mal para tu equipo y quedan mal parados) en fin me perdi","replies":[]},{"poster":"Kyousuke","date":"2017-01-08T22:55:36.364+0000","up_votes":1,"down_votes":0,"body":"nerfean coloso un poco mas, nerfean la jungla para que no gankeen rápido bot y buffean algunos adc, no es que los adc's estén en la mierda es que hay cosas que están por encima del resto que hace que los que no son 100% buenos con los adc sufran muchísimo y el nerfeo a {{item:3190}} fue un nerf indirecto a los carrys también ya que no consiguen las resistencias extras al estar con su soporte.\nademas el cambio del fervor es una basura para los carrys (almenos así lo veo yo)","replies":[]}]}