{"poster":"Matteo00","date":"2017-07-14T11:45:43.071+0000","title":"Proposta Campione: Andul","subforum":"Creazioni della community","up_votes":5,"down_votes":3,"body":"Nome: Andul, il mercenario del Vuoto\nRuolo primario: Combattente\n\n\nStoria:\nAndul era appena un ragazzo quando venne rapito dalle forze di Noxus per essere addestrato come chiunque altro nell&#039;arte della guerra. Andul per&ograve; venne messo in un gruppo segreto, i mercenari di Noxus, dove il primo addestramento era combattere contro gli altri membri per definirne il leader. Tra tutte le armi d&#039;acciaio che gli altri compagni avevano scelto, Andul si convinse di poter combattere a mani nude; in molti riderono all&#039;idea di uno scontro senza arma, ma il coordinatore dell&#039;addestramento, Darius, vide negli occhi di quel ragazzino sbruffone qualcosa di unico, una vera potenza omicida. Cos&igrave; fece iniziare lo scontro,e il ragazzo mostr&ograve; la sua potenza; tra tutti i colpi di quelle lame affilate Andul colp&igrave; con cos&igrave; tanta potenza da riuscire a danneggiare quasi ogni arma e rimanerne illeso. Alla fine dello scontro rimase esausto, ma ,incredulo ai suoi e agli occhi di chiunque altro, aveva vinto. Venne nominato leader dei mercenari; da quel giorno vennero addestrati a sopravvivere nel mondo esterno a Noxus, e gli venne fatto giurare di essere sempre sotto il servizio Noxus marchiando sulla schiena di ognuno il simbolo della citt&agrave;. Andul aveva affinato la sua tecnica con i pugni e strinse un profondo legame d&#039;amicizia con gli altri compagni, che lo rispettavano in quanto leader. Per anni il gruppo di mercenari vag&ograve; per Valoran/Runeterra combattendo per fama, gloria e ricchezze, quando un giorno il simbolo sulla schiena bruci&ograve; di un calore  eguale a quello dell&#039; acciaio fuso con cui venivano costruite le armi noxiane; era l&#039;avviso di tornare a casa. A Noxus si stava per svolgere il torneo ad armi bianche dove chi perdeva moriva; Andul, anche se senza armi, partecip&ograve;. Dopo molti scontri era arrivato in finale, contro il suo stesso allenatore Darius. Entrambi si riconobbero subito; iniziato lo scontro Andul and&ograve; alla carica e trascin&ograve; Darius sul muro della Grande Arena, e dopo una serie di colpi ad alta velocit&agrave;, Darius, senza la sua ascia, reag&igrave; e colp&igrave; Andul con tutta la sua potenza in un pugno. Andul indietreggi&ograve;, i suoi occhi diventarono colmi di rabbia. Poi scaten&ograve; la sua potenza nel petto di Darius, distruggendo l&#039;armatura che aveva addosso e sconfiggendolo. Doveva ucciderlo, ma ricordando il suo passato lo risparmi&ograve; perch&eacute; era stato l&#039;unico a credere in lui. Darius per&ograve; era ancora cosciente e non poteva accettare la clemenza di quel ragazzo considerato sempre uno sbruffone, cos&igrave; si rialz&ograve; per l&#039;ultima volta in quel duello, riprese l'ascia da terra e li tagliò le braccia, poi entrambi svennero. Al suo risveglio, Andul era su una carovana trainata dal suo gruppo di mercenari, consci del fatto che rimanendo a Noxus il ragazzo sarebbe morto. Ma Andul oramai non poteva pi&ugrave; essere il loro leader senza i suoi pugni, cos&igrave;, distrutto nell&#039;animo e nella mente decise di farsi lasciare nel Paese pi&ugrave; prossimo per cominciare una nuova vita. I mercenari, con molta tristezza, accettarono l&#039;ultimo desiderio del loro leader e arrivati ad Icathia lo abbandonarono. Andul vag&ograve; per giorni senza sapere cosa fare, quando una voce nella sua testa cominci&ograve; a sussurarl&igrave;. Quella voce and&ograve; avanti per giorni e Andul non ne poteva pi&ugrave;; arrivato in un oasi nel deserto svenne e cadde in un fiume. L&#039;acqua intorno a lui cominci&ograve; a diventare viola, cominciarono a crearsi delle onde mentre il corpo rimaneva fermo a galleggiare; le onde si fecero sempre pi&ugrave; grosse  fino a risucchiare Andul. Dopo molto tempo una grossa sfera salì per diversi metri sopra il fiume, esplose e qualcuno cadde a terra inginocchiato con un pugno nel terreno. Andul era rinato con un corpo nuovo. Le sue braccia erano state ricreate, ma sembravano molto pi&ugrave; forti,con degli grossi spuntoni e di color viola opaco, come i suoi occhi e i suoi capelli. Dietro la schiena c&#039;era un altro marchio. Un viandante che si trovava l&igrave; cap&igrave; subito; quel ragazzo noxiano era stato corrotto dal Vuoto. \nE se il suo corpo era diventato cos&igrave; spaventoso, chiss&agrave; cosa era successo alla sua mente. \n\nAndul ha ancora i suoi ricordi, e lavora ancora come mercenario; ma non avr&agrave; pi&ugrave; clemenza di nessuno, neanche dei suoi amici, ed ora anche Noxus dovr&agrave; avere paura quando il Vuoto lo chiamer&agrave; a s&egrave; per combattere i propri nemici.\n\n\nAspetto:\nPugni del vuoto descritti come nella storia, aspetto di un ragazzo giovane di 20 anni, sbruffone, senza armatura con il simbolo del Vuoto dietro la schiena, occhi viola e capelli viola e &quot;all&#039;in s&ugrave;&quot;. Quando attiva la Passiva scudo simile a quello di malzahar. Quando attiva l ulti il simbolo sulla schiena diventa Viola Opaco\n\n\nStatistiche:\nSalute: 575\nEssenza del Vuoto: si carica con gli attacchi base\nArmatura: 28\nResistenza magica:30\nVelocit&agrave; d&#039; attacco:0.7\nVelocit&agrave; movimento:335\nGittata:125\n\n\nAbilit&agrave;: Le sue abilit&agrave; non hanno costo \nPassiva: Essenza del Vuoto\n\nAndul ottiene attaccando uno scudo fatto di Essenza del Vuoto e marchia i campioni.\nDopo 4 attacchi base contro lo stesso bersaglio nemico(campione, mostro grande o epico), ottiene uno scudo di essenza del Vuoto che blocca 45-65-85-105 (+15% dell&#039; armatura bonus) (+15% della resistenza magica bonus) (+15% attacco fisico bonus) danni crescenti con i livelli 6-11-16  per 2 secondi. Il bersaglio viene marchiato di Essenza del Vuoto per 3.5 secondi e non pu&ograve; essere marchiato nuovamente per 10 secondi.\n (L'abilità Pugno del Vuoto è in grado di marchiare nuovamente anche prima della scadenza dei 10 secondi)\n\nQ: Colpi feroci\n\nAndul colpisce fino a 3 bersagli saltandogli addosso consecutivamente.\nAndul balza su un bersaglio nemico diventando immune a impedimenti e infliggendo 75/100/125/150/175 (+90% attacco fisico bonus) danni fisici, poi balza fino ad altri 2 nemici infliggendo 50/75/100/125/150 (+100% attacco fisico bonus) dando priorit&agrave; ai campioni. Attaccare un bersaglio marchiato fa guadagnare ad Andul 14-15-16-17-18% rubavita per 5 secondi.\n\nGittata: 475\nGittata salti consecutivi:425\nRicarica: 9 secondi\n\n\nW: Aura mercenaria\n\nAndul guadagna velocit&agrave; d&#039;attacco e di movimento attaccando.\nPassiva: Andul ottiene 15-20-25-30-35% velocit&agrave; d&#039;attacco bonus.\nAttiva: Andul ottiene immunità ai rallentamenti e 50% velocit&agrave; di movimento per 4 secondi, che cresce fino al 75% se si muove verso bersagli con meno del 35-40-45-50-55% di Salute. I bersagli marchiati non possono danneggiare Andul con gli attacchi base quando l&#039;abilit&agrave; &egrave; attiva.\n\nGittata: Se stesso\nGittata Velocità movimento del 50%: Se stesso\nGittata Velocità movimento del 75%: 1600\nRicarica: 11-10-9-8-7 secondi\n\n\nE: Trascinatore\n\nAndul colpisce con violenza il bersaglio trascinandolo.\nAndul si trascina il bersaglio infliggendo 75-115-155-195-235 (+35% attacco fisico bonus) danni magici; in base alla distanza percorsa e se collide con un muro viene stordito per 1 secondo o rallentato del 15-20-25-30-35% per 2 secondi. Se il bersaglio &egrave; marchiato viene immobilizzato per 3 secondi indipendentemente dalla distanza percorsa.\n\nGittata: 175\nDistanza per stun: massimo 350 (deve per forza collidere con un muro o la distanza aumenta e il bersaglio viene affetto da rallentamento)\nDistanza per rallentamento: 351  a 600\nRicarica: 15-14-13-12-11 secondi\n\n\nR: Pugno del Vuoto\n\nAndul balza colpendo con violenza il terreno e creando un terreno del Vuoto.\nAndul colpisce il terreno infliggendo 100-150-200 (+125% attacco fisico bonus) danni fisici nella posizione bersaglio, guadagnando 30% penetrazione armatura  e creando una zona del Vuoto per 7 secondi attorno, nella quale chiunque entra viene marchiato nuovamente per 7 secondi e viene rallentato del 30% per il tempo che rimane dentro (la velocit&agrave; viene recuperata velocemente fuori dalla zona). Attivare questa abilit&agrave; riattiva lo scudo della Passiva.\n\nGittata Pugno: 800\nLarghezza Pugno: 450\nLArghezza zona del Vuoto: 560\nRicarica: 100-90-80 secondi\n\nP.S.: https://boards.euw.leagueoflegends.com/it/c/creazioni-della-community-it/WbMLa68T-storia-breve-di-andul-il-leader-corrotto","replies":[{"poster":"XOmega WarriorX","date":"2017-07-14T12:01:54.585+0000","up_votes":2,"down_votes":1,"body":"Interessante,ma invulnerabilità sulla Q e troppo per un top laner","replies":[{"poster":"Matteo00","date":"2017-07-14T12:10:07.755+0000","up_votes":2,"down_votes":1,"body":"Infatti ero indeciso tra invulnerabile e immune agli impedimenti; ho cambiato.","replies":[{"poster":"XOmega WarriorX","date":"2017-07-14T15:11:17.166+0000","up_votes":2,"down_votes":1,"body":"Molto meglio,ma TU,che ruolo pensi che coprirà?diver,juggernaut, che build ecc?","replies":[{"poster":"Matteo00","date":"2017-07-14T16:36:48.173+0000","up_votes":2,"down_votes":0,"body":"Build:\n{{item:3065}}  per salute, resistenza magica,e il rubavita della Q (secondo me l'unico oggetto obbligatorio su questo campione)\n{{item:3153}} Molto importante ma non obbligatorio\n {{item:3083}}  / {{item:3742}}   più sul 2 item\n{{item:3074}} / {{item:3156}}  il 2 item solo in casi di estrema necessità sulla resistenza magica\n {{item:3047}}  / {{item:3117}}  / {{item:3009}}\n {{item:3071}} \n\nIo l'ho pensato come un diver che può andare sia top che in giungla grazie alla passiva e al sustain con la combinazione Q-W\nInoltre i suoi gank in giungla possono essere fatti attivando per prima la W, poi Q per arrivare al bersaglio anche se ci fossero minion in mezzo, ed E per \"trascinare \" il nemico verso l'alleato.\n\nSe dovesse andare in giungla al posto di{{item:3074}}   /  {{item:3156}}  metterei come oggetto {{item:1412}} / {{item:1419}} \nIl 1 se si vuole avere il 40 % riduzione ricarica, il 2 credo sinergia bene con la combo W-Q\n","replies":[{"poster":"Mh012","date":"2017-07-16T20:33:05.247+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Matteo00,realm=EUW,application-id=P9Wi6QlB,discussion-id=F5yd6MKL,comment-id=0000000000000000,timestamp=2017-07-14T16:36:48.173+0000)\n>\n> Build:\n> {{item:3065}}  per salute, resistenza magica,e il rubavita della Q (secondo me l&#x27;unico oggetto obbligatorio su questo campione)\n> {{item:3153}} Molto importante ma non obbligatorio\n>  {{item:3083}}  / {{item:3742}}   più sul 2 item\n> {{item:3074}} / {{item:3156}}  il 2 item solo in casi di estrema necessità sulla resistenza magica\n>  {{item:3047}}  / {{item:3117}}  / {{item:3009}}\n>  {{item:3071}} \n> \n> Io l&#x27;ho pensato come un diver che può andare sia top che in giungla grazie alla passiva e al sustain con la combinazione Q-W\n> Inoltre i suoi gank in giungla possono essere fatti attivando per prima la W, poi Q per arrivare al bersaglio anche se ci fossero minion in mezzo, ed E per &quot;trascinare &quot; il nemico verso l&#x27;alleato.\n> \n> Se dovesse andare in giungla al posto di{{item:3074}}   /  {{item:3156}}  metterei come oggetto {{item:1412}} / {{item:1419}} \n> Il 1 se si vuole avere il 40 % riduzione ricarica, il 2 credo sinergia bene con la combo W-Q\n\nIo direi che può essere buildato con AS + Crit con la Ruined King/Phantom Dancer","replies":[]},{"poster":"Matteo00","date":"2017-07-15T12:29:34.033+0000","up_votes":1,"down_votes":0,"body":"Anzi mi hai fatto pensare che potrebbe essere anche un buon pick mid per contrastare qualche assassin ap, tipo LeBlanc.\nArrivi a lei, lei usa la W, e la trascini di E verso la torre o il jungle alleato","replies":[]}]}]}]}]},{"poster":"Kazushi San","date":"2017-07-14T14:41:14.248+0000","up_votes":2,"down_votes":1,"body":"Abdul usa i pugni e la dinamite","replies":[]},{"poster":"Darkinknight","date":"2017-07-14T12:09:30.877+0000","up_votes":2,"down_votes":1,"body":"Io lo chiamerei abdul l'anti troll,non ha nessuna skill.\nAl minuto 20 esplode e il game finisce in pareggio GG molto piu semplice","replies":[]},{"poster":"SUN Void ","date":"2017-07-15T13:22:04.268+0000","up_votes":1,"down_votes":0,"body":"Mhhh a me sembra come {{champion:19}} , solo molto più broken (Q & W)","replies":[{"poster":"Matteo00","date":"2017-07-15T17:13:17.648+0000","up_votes":1,"down_votes":0,"body":"Ok, della storia cosa ne dici?","replies":[{"poster":"SUN Void ","date":"2017-07-18T15:51:30.585+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Matteo00,realm=EUW,application-id=P9Wi6QlB,discussion-id=F5yd6MKL,comment-id=00060000,timestamp=2017-07-15T17:13:17.648+0000)\n>\n> Ok, della storia cosa ne dici?\n\nNon mi dispiaceva, è interessante come storia, ma sinceramente non riesco ad immaginarmi un darius che addestra qualcuno XD","replies":[]}]}]},{"poster":"ObsidianSin","date":"2017-07-16T16:46:37.371+0000","up_votes":1,"down_votes":0,"body":"Credo sia fatto piuttosto bene, anche se temo che nel meta attuale possa soffrire a causa del fatto che in toplane, contro alcuni champ, 4 aa sono troppi per rigenerare la passiva. sarebbe davvero buono come champ creato, ma credo che soffrirebbe davvero troppo l'early game, rovinando il resto della partita, facendolo rimanere indietro. la q, anche dando quel 15% di rubavita non è sufficente a dargli sustain in early, dato che ai primi minuti il 15% di circa 80 è appena 12. la w gli dà \"solo\" 4 secondi di salvezza in early (e subisce ancora le spell), e solo se il bersaglio è sotto il 35% di salute. credo che questo sia uno dei champ più bilanciati che io abbia mai visto sul forum, ma considerando il meta di lol attuale, sarebbe una open top, molto facilmente. per il resto è buono :D","replies":[{"poster":"Matteo00","date":"2017-07-16T20:03:58.517+0000","up_votes":1,"down_votes":0,"body":"Rivedendo adesso, forse hai ragione però sulla Q non credo modificherò qualcosa. Alla W ho dato un immunità ai rallentamenti, ma niente di più. Ti faccio notare che la passiva della W aumenta la velocità d'attacco, quindi lo scudo della Passiva dovrebbe essere leggermente più facile da ottenere.","replies":[]},{"poster":"Matteo00","date":"2017-07-16T16:54:58.392+0000","up_votes":1,"down_votes":0,"body":"Grazie tante, ci penserò su. Comunque se non l' hai già fatto, ti voglio consigliare di andare a leggere la storia breve, l'ho appena messa in link","replies":[]}]},{"poster":"Patrizio996","date":"2017-07-15T12:57:51.238+0000","up_votes":1,"down_votes":0,"body":"Sicuro che non possa andare su una build da critico? In fondo è un mercenario, ogni colpo può essere critico :)","replies":[{"poster":"Matteo00","date":"2017-07-15T14:10:09.956+0000","up_votes":1,"down_votes":0,"body":"Non credo, ma vedrò prossimamente","replies":[]}]},{"poster":"YourFaceSplatted","date":"2017-07-15T01:03:37.318+0000","up_votes":0,"down_votes":1,"body":"Secondo me andrebbe messo qualche costo alle abilità, se non in mana almeno qualcosa in salute dato che ha il rubavita sulla Q","replies":[{"poster":"Matteo00","date":"2017-07-15T08:14:42.433+0000","up_votes":1,"down_votes":0,"body":"In mana no perché la barra sotto servirebbe per la passiva. Il rubavita sulla Q è solo colpendo i bersagli marchiati, quindi non sempre, e credo che così sia abbastanza buono dato che le ricariche sono abbastanza alte.","replies":[{"poster":"YourFaceSplatted","date":"2017-07-15T12:40:38.672+0000","up_votes":1,"down_votes":0,"body":"ok, beh non la credo come te ma comunque se fai un disegno è meglio farai pubblicità al tuo stesso campione\nti immagini lo creano e te lo regalano gratis con la skin ahahaha che figata","replies":[{"poster":"Matteo00","date":"2017-07-15T14:04:02.304+0000","up_votes":1,"down_votes":0,"body":"Non credo che lo faranno mai e se lo fanno non me lo regalano perché hanno un articolo sulle Idee non Richieste che in qualunque caso non hanno nessun dovere di farlo perché appartengono a loro (sia chiaro che non mi sto lamentando).\n\nPer il disegno forse non lo so vedo quando c ho tempo","replies":[]}]}]}]}]}