{"poster":"Jables161","date":"2017-10-01T14:32:59.078+0000","title":"Disco Viktor Skin","subforum":"Skin- & Champion-Konzepte","up_votes":21,"down_votes":1,"body":"Hall&ouml;chen liebe Community,\r\n\r\nich als stolzer Viktor Main, warte schon seit langem vergebens auf einen neuen Viktor Skin. Ich habe mir schon oft vorgestellt, wie denn so ein neuer Skin aussehen k&ouml;nnte. Schnell ist mir aufgefallen, dass Viktor keinen witzigen Skin besitzt, sondern nur &quot;ernste&quot; Skins, ihr wisst schon. Nach kurzem &uuml;berlegen schoss mir ein Konzept durch den Kopf, und zwar der Disco-Viktor (vielleicht zugeh&ouml;rig zu DJ-Sona).\r\n\r\nUnd zwar habe ich mir Folgendes &uuml;berlegt:\r\n\r\n**Aussehen des Skins:**\r\nEin Viktor mit komplett wei&szlig;er Maske und einem Afro der aus ihr hervorragt. Die Augen leichten in zwei verschiedenen Farben oder wechseln ihre Farbe ab und zu. Als Anzug w&uuml;rde ich ein lila Hemd vorschlagen mit gro&szlig;em Kragen. Es hat einen weiten Ausschnitt und man kann Viktors Brust sehen, die vielleicht halb menschlich halb Roboter ist. Die &Auml;rmel sind hochgekrempelt, auf einer Seite sieht man seinen Unterarm, auf der anderen Seite einen metallenen Handschuh. Das Hemd ist in die strahlend wei&szlig;e Trompetenhose gestopft. Au&szlig;erdem muss man seine makellosen Tanzschuhe sehen. Seinen Laser-Arm w&uuml;rde ich vielleicht golden machen, und er tr&auml;gt einen Michael Jackson Glitzerhandschuh. Sein Zepter sollte auf der Spitze eine Discokugel tragen.\r\n\r\n**F&auml;higkeiten:**\r\n\r\n**Q**\r\n--&gt; Viktor wirft eine Schallplatte oder CD auf den Gegner. Die zweite Aktivierung des Q&#039;s sollte aussehen wie ein Laser aus einer Disco-Lasershow (siehe F&auml;higkeit E)\r\n\r\n**W**\r\n--&gt; Das Gravitationsfeld sollte aussehen wie ein Dancefloor mit bunten Kacheln. Vielleicht k&ouml;nnte man auch eine leichte Techno-Musik dr&uuml;ber legen, solange das W auf dem Feld liegt.\r\n\r\n**E**\r\n--&gt; Die E sollte wie Lichtschranken aus einer Disco-Lasershow aussehen. Vielleicht ein paar verschiedene Farben, so dass sich die Farben pro Aktivierung &auml;ndert. Alternativ k&ouml;nnte die Farbe des Lasers sich w&auml;hrend einer einzigen Benutzung ver&auml;ndern (&auml;hnlich den Schw&auml;nzen von Arcade-Ahri, nur schneller, da dass E nicht lange zu sehen ist.)\r\n\r\n**R**\r\n--&gt; Auf die Ulti kommen die meisten von euch wahrscheinlich mittlerweile selbst. Eine Discokugel, die &uuml;ber Viktor emporsteigt, sich dreht und dabei Lichtstrahlen von sich strahlt (wie eine Discokugel eben). Wenn der W keine Musik bekommt bei Aktivierung, dann vielleicht doch die Ulti.\r\n\r\nStellt euch nur die Kombination aus den F&auml;higkeiten vor. Viktor schmei&szlig;t einen Dancefloor um seine Gegner festzuhalten, bearbeitet sie mit CD&#039;s und Schallplatten, bietet ihnen eine 1A-Lichtershow und &uuml;ber ihnen steigt eine Discokugel empor, all das zu einer fetzigen Techno-DJ-Musik.\r\n\r\n**Aktionen:**\r\n\r\nErh&ouml;htes Lauftempo:\r\n--&gt; Viktor macht eine groovige Dance-Pose und fliegt zu seinem Ziel (Flug sollte ein bisschen dem von Arcade-Brand &auml;hneln). Falls dies zu seltsam wirkt, k&ouml;nnte man auch einfach die normale Laufanimation lassen.\r\n\r\nR&uuml;ckruf:\r\n--&gt; Viktor schmei&szlig;t einen Dancefloor unter sich selbst und beschw&ouml;rt einen Radio samt Discokugel. Sein Laser auf seiner Schulter dr&uuml;ckt auf den Radio und man h&ouml;rt wieder eine Techno-Musik, die Discokugel f&auml;ngt an sich zu drehen und Viktor beginnt ein paar coole Dancemoves hinzulegen. Am Ende des Backports sollte Viktor wieder eine coole Pose einnehmen, vielleicht Elvis Presley m&auml;&szlig;ig, einen Finger in die Luft strecken, ihr wisst was ich meine. Sein Finger sollte dann aufblitzen, weil der die Pose perfekt gemeistert hat (oder so &auml;hnlich).\r\n\r\nSpawnen:\r\n--&gt; Viktor erscheint unter einem Lichtblitz in der Pose in der er sich zur&uuml;ckteleportiert hat und bleibt so noch ein paar Sek&uuml;ndchen stehen.\r\n\r\nSTRG 1:\r\n--&gt; Viktor jongliert mit CD&#039;s oder Schallplatten und sein Laser-Arm f&auml;ngt sie nach kurzer Zeit alle auf. Viktor wundert sich wo sie geblieben sind, blickt nach oben und erschreckt w&uuml;tend als er seinen Arm mit den Dingen in der Hand sieht. Wegen dem Schreck fallen die Platten runter und zerbrechen vielleicht.\r\n\r\nSTRG 2:\r\n--&gt; Viktor versucht seinem Arm die Pose mit dem Finger beizubringen, er macht es 2 mal vor. Der Arm versucht es ihm gleich zu tun doch ihm gelingt es auch nach ein paar Versuchen nicht. Viktor st&ouml;hnt und vergr&auml;bt sein Gesicht in seiner Hand.\r\n\r\nSTRG 3:\r\n--&gt; Den Tanz von Viktor kann man perfekt lassen, immerhin ist ein Shuffle Dance Move und der passt perfekt in das Disco Schema.\r\n\r\nSTRG 4:\r\n--&gt; Den Lacher vielleicht weniger zu einem boshaften und herrschendem Lachen, sondern eher zu einem Auslachen mit Tr&auml;ne wegwischen machen. So als w&uuml;rde ein Profit&auml;nzer einem Anf&auml;nger zusehen wie er das Tanzbein schwingt.\r\n\r\n\r\n\r\nWas sagt ihr? Lasst mich bitte wissen was ihr gut und was ihr nicht so gut findet. Ich finde Viktor hat einen neuen Skin auf jeden Fall verdient, und dieser passt perfekt zu ihm oder? Wenn euch die Idee gef&auml;llt, w&uuml;rde ich mich freuen wenn ihr dem Beitrag einen +1 gebt und wer wei&szlig;, vielleicht schafft es dieser Skin ja in die Kluft und wir werden bald zusammen mit Disco Viktors schnieken Dancemoves das Tanzbein schwingen! :D\r\n\r\n\r\nW&uuml;nsche euch noch einen sch&ouml;nen Tag!\r\nLiebe Gr&uuml;&szlig;e,\r\nJanik","replies":[{"poster":"Lunaá","date":"2017-10-01T19:17:08.298+0000","up_votes":6,"down_votes":0,"body":"Actually wäre es auch lustig, wenn die Champions, die in der W gestunnt werden, stattdessen für die Betäubungsdauer ihren Dance ausführen würden","replies":[]},{"poster":"DieForDarius","date":"2017-10-01T18:22:27.933+0000","up_votes":3,"down_votes":0,"body":"{{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"Morphre","date":"2017-10-01T15:16:23.155+0000","up_votes":3,"down_votes":0,"body":"Lustige Idee, wäre sicherlich cool mal ein paar Bilder in die Richtung zu sehen :)","replies":[]},{"poster":"Icecracker5","date":"2017-10-02T09:21:29.313+0000","up_votes":2,"down_votes":0,"body":"Echt cooles Konzept :D","replies":[]},{"poster":"I love you Malon","date":"2017-10-01T15:15:38.428+0000","up_votes":2,"down_votes":0,"body":"LOL","replies":[]},{"poster":"B0B Smoke Weed","date":"2017-10-01T18:21:34.744+0000","up_votes":4,"down_votes":2,"body":"Upvote von mir mester, Geile idee bitte heirate mich, ich will ein Kind von dir. Nach deiner Erfolgreichen tat, lebe im Himmel als eine Legende weiter digger *Thumbs up* ma nigguh{{item:3416}}","replies":[]},{"poster":"maze709","date":"2017-10-26T19:14:26.382+0000","up_votes":1,"down_votes":0,"body":"{{champion:112}} {{sticker:slayer-pantheon-thumbs}}","replies":[]}]}