{"poster":"Si tepEr d0no1","date":"2015-03-17T13:43:02.744+0000","title":"Enfriamiento en la Q de varus.","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"¡Saludos!\nHe notado que el enfriamiento de su Q NO comienza cuando inicias la habilidad como se había dicho en el parche..... ¿a alguien mas le pasa?\nAparte de eso, tampoco he podido ver las animaciones de victoria y derrota xD Me siento estafado\n\nEdit: Hoy después del escaneo de archivos me aparecieron las animaciones :D  ","replies":[{"poster":"Revolución","date":"2015-03-17T14:46:53.864+0000","up_votes":2,"down_votes":0,"body":"Es un tremendo buff el de Varus para el poke en línea, si uno carga la Q 2 segundos eso significa tener la habilidad de nuevo 2 segundos antes respecto del parche anterior. Ya lo vienen buffeando bastantes veces en poco tiempo, parece que un arquero quiere volver al meta. Todavía nada muy significativo, pero un retoque acá y otro allá, cuando nos queramos acordar Varus va a ser god tier a este paso.","replies":[]},{"poster":"Oldkraken","date":"2015-03-17T16:27:55.275+0000","up_votes":1,"down_votes":0,"body":"comprension lectora a marzo no? el esta preguntando porque dice que la habilidad no  anda como deberia. la verdad yo no lo he probado , no me siento muy comodo con varus asique no lo uso demasiado","replies":[{"poster":"Si tepEr d0no1","date":"2015-03-17T17:04:58.792+0000","up_votes":1,"down_votes":0,"body":"La verdad note que igual lo escribí mal, pero entendiste mi idea al menos jajaja!","replies":[]}]},{"poster":"nightdarkess","date":"2015-03-17T14:05:03.695+0000","up_votes":1,"down_votes":0,"body":"esas animaciones salen en el otro parche y la q mientras estas cargando la habilidad entra en cd  por lo cual es un buff bastante importante aunque no no creas","replies":[{"poster":"Si tepEr d0no1","date":"2015-03-17T14:28:59.896+0000","up_votes":1,"down_votes":0,"body":"A eso me refiero, no entra en CD al usar la habilidad como debería ser, sigue comenzando después de lanzar la flecha.","replies":[]}]}]}