{"poster":"Villdar","date":"2017-08-11T09:23:33.468+0000","title":"League Of Legends Lore - Buchi di trama","subforum":"Discussioni generali","up_votes":1,"down_votes":1,"body":"Con l&#039;annuncio di Ornn e relative storie annesse, si sono creati diversi buchi di trama all&#039;interno della lore di League of Legends (non che prima fossero pochi, ma ora &egrave; simile ad uno scolapasta) alcuni riguardano Braum, in particolar modo.\r\n\r\nDalla lore di Braum noi sappiamo di come &egrave; entrato in possesso del suo scudo e abbiamo scoperto grazie ad Ornn che &egrave; una porta forgiata da lui stesso, indistruttibile. La porta faceva da &quot;guardia&quot; al tesoro di un troll (non quelli delle ranked), inaccessibile perch&egrave; Ornn aveva deciso di ripagare l&#039;inganno del troll con un altro inganno (vi invito a leggervi le storie di Ornn se non l&#039;avete ancora fatto).\r\n\r\nRitornando a Braum, un piccolo troll, girovagando per la montagna, trova la porta aperta e viene attirato all&#039;interno dalla visione del tesoro. Una volta dentro, la porta si richiude alle sue spalle. Ora, sappiamo che i troll non sono riusciti ad aprire questa porta, nessuno poteva aprirla se non forse Ornn stesso, quindi, per quale motivo era aperta? La vecchia che racconta la storia di Braum, accenna ad una trappola di una Strega dei Ghiacci, forse Lissandra? Forse, ma davvero Lissandra ha il potere per fare ci&ograve;? Sempre dalla storia di Ornn, sappiamo che la magia deteriora le cose. Cos&igrave; come successo al ponte sull&#039;abisso ululante, costruito da Ornn e incantato da Lissandra per tenere a bada le creature dentro l&#039;abisso.\r\n\r\nOra il ponte cade a pezzi, lentamente, ma la magia lo corrode. Accadr&agrave; lo stesso allo scudo di Braum? Sempre se Lissandra l&#039;ha veramente aperta grazie alla magia.\r\n\r\nAltra questione irrisolta &egrave; il frammento di Vero Ghiaccio al centro dello scudo. Nelle storie di Ornn non &egrave; menzionato, ma come &egrave; gi&agrave; stato discusso su altri forum, potrebbe essere un monito per l&#039;inganno del Troll, con cui ha convinto Ornn a fare il lavoro. Ed essendo quindi lo scudo privo di magia, i poteri di Braum, deriverebbero da questa scheggia? \r\n\r\nLa lore di LoL ha davvero tanti buchi e il modo per rattopparli &egrave; quello di spacciare tutte queste vicende per Leggende, lasciando quindi margini d&#039;errore giustificabili dal fatto che non sono storie trascritte ma diffuse a voce da una generazione all&#039;altra.\r\n\r\n\r\nAltra questione irrisolta &egrave; ci&ograve; che intendono fare con la nuova League of Legends, visto che la vecchia &egrave; stata abolita, cos&igrave; da permettere a Champion del calibro di Aurelion Son e Ornn di farne parte. Rendendo per&ograve; la lore di champion come Jax del tutto fuori contesto.\r\n\r\nRimane dunque da capire come il tutto sar&agrave; giustificato, chi sono i campioni? cosa fanno gli evocatori? Una risposta che mi viene da pensare &egrave; che ormai la Lega &egrave; un mero strumento di divertimento e non pi&ugrave; un luogo dove i popoli sovrani di Runeterra si scontravano per prendere delle decisioni, senza devastare il mondo. Quindi i campioni che giochiamo non sono i veri campioni, ma dei duplicati, dei fantocci gestiti dagli evocatori, che in pratica saremmo noi giocatori. Cos&igrave; come gli oggetti di gioco sono delle mere copie con un centesimo del potenziale dei veri oggetti.\r\n\r\nMa finch&egrave; tutto ci&ograve; non viene chiarito rimane una mera ipotesi.\r\n\r\nDitemi la vostra e fatemi sapere se vi vengono in mente altri buchi di trama e questioni irrisolte. Io ne avrei ancora un bel po&#039;, ma mi piacerebbe sentire cosa ne pensate.","replies":[{"poster":"HaIIeIujah","date":"2017-08-11T09:29:10.041+0000","up_votes":4,"down_votes":0,"body":"Liss non ha aperto la porta con la magia, Liss ha fatto entrare il Troll con la magia. Sottile differenza.\n\nAttraversare una porta sigillata, un'ambiente chiuso...scivolando sul ghiaccio? Un riferimento alla sua E, la sua capacità di muoversi attraverso il ghiaccio stesso, forse? Inoltre aprirel a porta con la magia ed incantarla sono due cose ben diverse. Se avesse effettivamente usato la sua magia, il frammento sarebbe diventato Dark Ice.\n\nIgnora il True Ice nella porta, sarà probabilmente stato retconnato nel non avere abilità magiche. Il True Ice è una reliquia di vecchi scrittori , tra cui Kitae ~~maledettosiailsuonome~~ così come la Lega.\n\nLa Lore nuova di Jax può essere in parte estrapolata dalla sua Short Story. Era un icathiano, sopravvissuto e reso immortale dal Cataclisma delle guerre runiche.  E' ora in cerca di degni guerrieri per affrontare l'invasione dei Voidborne.\n\nLa lega, fino a prova contraria, non esiste.","replies":[{"poster":"Villdar","date":"2017-08-11T09:36:36.551+0000","up_votes":1,"down_votes":0,"body":"La storia di Braum dice che il piccolo Troll ha aperto la porta e nessuno sa come.\n\nMa comunque, non credo potesse essere attraversata dalla magia, altrimenti tanto vale, qualcuno l'avrebbe già svuotata da tempo, in fondo la magia non è così rara su Runeterra.\n\nPer la lega, purtroppo si. Ora non esiste più. Con la vecchia lore aveva ancora un senso, se pur banale. Ora staremo a vedere se inventano qualcosa, anche un pretesto banale per giustificare come fa uno Yordle armato di cerbottana ad ammazzare un semi-dio.","replies":[{"poster":"HaIIeIujah","date":"2017-08-11T09:41:34.226+0000","up_votes":4,"down_votes":0,"body":"Braum non ha attraversato la porta, ha sfondato la montagna. Quello che sto sostenendo è che Liss non ha aperto la porta con la magia, ma ha attraversato il ghiacciaio stesso intorno alla porta.","replies":[{"poster":"Villdar","date":"2017-08-11T09:45:44.220+0000","up_votes":1,"down_votes":0,"body":"Non ho mai detto che Braum ha attraversato la porta xD, ma che il piccolo Troll l'ha aperta e c'è entrato. Che Lissandra sia in qualche modo passata dall'altra parte della porta non lo sappiamo","replies":[{"poster":"HaIIeIujah","date":"2017-08-11T09:55:23.881+0000","up_votes":3,"down_votes":0,"body":"....Si, lo so che non lo hai detto. Intendo: come Braum è \"entrato\" senza \"aprire\" la porta, Lissandra può aver fatto lo stesso, portando con sè il bambino troll. Sul perché lo abbia fatto, ho un paio di teorie, ma nietne di confermato.","replies":[{"poster":"Villdar","date":"2017-08-11T11:02:24.204+0000","up_votes":1,"down_votes":0,"body":"Ovvero? Che teoria hai? Sono curioso xD ormai visto che la Rito ci da poco, mi piace spaziare con speculazioni.","replies":[{"poster":"HaIIeIujah","date":"2017-08-11T11:09:03.973+0000","up_votes":3,"down_votes":0,"body":"* In un modo simile alla leggenda della lampada magica, una parte del tesoro era maledetta. Lissandra potrebbe avere usato il Troll per \"subire\" la maledizione come Ja'far usa Alladin nel film della Disney.\n* Desiderando il tesoro all'interno, Lissandra potrebbe avere usato il troll come esca per Braum, sapendo che lo avrebbe salvato a qualunque costo e così facendo avrebbe aperto una via per l'interno; permettendole più facilmente di accedere al tesoro.","replies":[{"poster":"Villdar","date":"2017-08-11T11:32:40.217+0000","up_votes":1,"down_votes":0,"body":"Potrebbe ritornare come teoria. L'unica cosa di cui non mi capacito è, perchè tanto sbattimento da parte di Lissandra per un tesoro Troll? Doveva esserci qualcosa per cui ne valesse davvero la pena, oltre che dell'oro.","replies":[]}]}]}]}]}]},{"poster":"Otivnaig","date":"2017-08-11T09:38:53.614+0000","up_votes":1,"down_votes":0,"body":"O come fai ad uccidere l'avatar della morte. Ripetutamente.","replies":[]}]}]},{"poster":"Vileblood Pyke","date":"2017-08-11T09:54:03.977+0000","up_votes":3,"down_votes":0,"body":"L'incantesimo di Lissandra potrebbe essere il motivo per cui uno dei due corni è rotto e l'altro sembra sia stato riparato. \"La magia rende deboli le cose resistenti\".","replies":[{"poster":"HaIIeIujah","date":"2017-08-11T10:01:27.366+0000","up_votes":3,"down_votes":0,"body":"Assumo che Lissandra abbia incantato le mie cuffie allora, dato che continuano a rompersi ;_;","replies":[]}]}]}