{"poster":"AlphaOmegakill","date":"2016-08-27T20:50:09.510+0000","title":"I want my account back RIGHT NOW. I get permenent ban for words that are said in movies.You joking?","subforum":"Player Behavior","up_votes":1,"down_votes":36,"body":"I want my account back RIGHT NOW. Getting a PERMANENT ban because of mundane words, that are used in every movie and TV show is not right.\r\nI spend time to level up my account, to buy champs and rune pages and runes and now it is all gone just because some 14 year old did not like what i said in  a game?\r\nDo you think this is just and fair?\r\n\r\n So let&#039;s look what did i say:\r\n\r\nGame 1\r\nAlphaOmegakill: zed is no ta problem for me\r\nAlphaOmegakill: i mean i maybe i cant kill him but he will not kill me too\r\nAlphaOmegakill: i told you she is op\r\nAlphaOmegakill: just farm safe dont fight her at full hp\r\nAlphaOmegakill: i told you she is op  pls keep that in mind\r\nAlphaOmegakill: wtf   3 vs   omg bot    you are on your own  i will just focus puhsing\r\nAlphaOmegakill: you hguys sleep too much\r\nAlphaOmegakill: noi tim i push\r\nAlphaOmegakill: 1 player pls mid i want top make turrent  and puhs the second enemy mid turrent\r\nAlphaOmegakill: i need to wathc zed\r\nAlphaOmegakill: %%%s zed needs help\r\nAlphaOmegakill: bot pls\r\nAlphaOmegakill: they come\r\nAlphaOmegakill: pls learn tpo watch the map\r\nAlphaOmegakill: omg\r\nAlphaOmegakill: bot sleep more\r\nAlphaOmegakill: omg and you could not destroy it\r\nAlphaOmegakill: i told you all she is op\r\nAlphaOmegakill: lost game noob adc\r\nAlphaOmegakill: yes enemy has still their  turrent you were  at bot with morgana and you could not destroy it\r\nAlphaOmegakill: only noobs play irelia because they know she is op\r\nAlphaOmegakill: sleep more\r\nAlphaOmegakill: noob adc\r\nAlphaOmegakill: really\r\nAlphaOmegakill: who the fuck want to sur a ranked game you insane ?\r\nAlphaOmegakill: NO SUR RANKED\r\nAlphaOmegakill: IDIOTS\r\nAlphaOmegakill: SUR IS 100% LOS\r\nAlphaOmegakill: WE CAN STILL WIN IT\r\nAlphaOmegakill: GET IT TOGHETER \r\nAlphaOmegakill: DAMN MISS CLICK\r\nAlphaOmegakill: we need to get her alone\r\nAlphaOmegakill: in team fights we will die\r\nAlphaOmegakill: ward\r\nAlphaOmegakill: damn\r\nAlphaOmegakill: yeah nice how you all died like noobs\r\nAlphaOmegakill: what a team of losers i said she is OP nobody listen&#039;\r\nAlphaOmegakill: push back\r\nAlphaOmegakill: someone\r\nAlphaOmegakill: get armor items omg\r\nAlphaOmegakill: wards ?\r\nAlphaOmegakill: 0 vsion\r\nAlphaOmegakill: losers\r\nAlphaOmegakill: absulte noobs\r\nAlphaOmegakill: NO SUR RANKED FUCK YOU\r\nAlphaOmegakill: YOU STUPID ? NO WONDER YOU ARE SO LOW RANK\r\nAlphaOmegakill: REPORTED\r\n\r\n\r\nSUMMARY:\r\nSo what now? Words like %%%, LOSERs, STUPID are now forbidden words? This Political Correctness insanity has to end .\r\nYour system is so broken. Any one can go there and find whatever someone said OFFENSIVE.\r\nIT IS SUBJECTIVE.\r\nSo why should my account get a PERMANENT ban because someone found that what i said is offensive?\r\n\r\nTo feeders get banned?\r\nNO.\r\n\r\nBut when you say something that someone else finds OFFENSIVE than you get banned.\r\nFIX YOUR SYSTEM and GIVE ME MY ACCOUNT BACK .\r\n\r\n\r\nOffense is never given only taken.\r\nSo why should i get a PERMANENT BAN, because some fragile teenager cant deal with words, that are said in movies countless times.\r\n\r\n\r\nGame 2\r\nAlphaOmegakill: path you show that you come but you dont come my god\r\nAlphaOmegakill: sleep more\r\nAlphaOmegakill: you noob enemy jungler stop helping this mid\r\nAlphaOmegakill: path you are the worst mid ganker i hav evere seen\r\nAlphaOmegakill: dont claim silly shit i was under my turrent all the time\r\nAlphaOmegakill: so who is puhsing ?\r\nAlphaOmegakill: you show that you come and then you go the other way  silly jungler\r\nAlphaOmegakill: i do omg\r\nAlphaOmegakill: top ss ?\r\nAlphaOmegakill: usless top sleeps\r\nAlphaOmegakill: dude this is ranked not  child play\r\nAlphaOmegakill: i want people who can play and want win\r\nAlphaOmegakill: top did not ss so what is wrong with telling he is usles ?\r\nAlphaOmegakill: stating facts is not flame\r\nAlphaOmegakill: what should i die with you ?\r\nAlphaOmegakill: all mid  who is close next big push\r\nAlphaOmegakill: what you wnat  ?\r\nAlphaOmegakill: my spells have cooldowns i cant spam\r\nAlphaOmegakill: you went in got killed fast by assasin so what you want me to do? save you magcially ?\r\nAlphaOmegakill: sleep more team\r\nAlphaOmegakill: sleep more\r\nAlphaOmegakill: i said all mid for big push\r\nAlphaOmegakill: and nobody comes\r\nAlphaOmegakill: if we lose then go look in the mirror for the reason\r\nAlphaOmegakill: reported for verbal abuse\r\nAlphaOmegakill: you are so beginner goes 2v1 dies blames me lol typical bronze \r\nAlphaOmegakill: omg  why did we not kill garen off and the go dragon omg\r\nAlphaOmegakill: he was close and you all backed off\r\nAlphaOmegakill: path pls stop talking i dont want to hear teenager ego talk\r\nAlphaOmegakill: shh 12 year old\r\nAlphaOmegakill: omg this team\r\nAlphaOmegakill: cait pls come with me next time ignore path he has no idea what to do and when to do it\r\nAlphaOmegakill: next time i go for push come with me or my turrent goes to waste\r\nAlphaOmegakill: yeah path stop flame\r\nAlphaOmegakill: pls be shh noob\r\nAlphaOmegakill: shh noob path\r\nAlphaOmegakill: path XD\r\nAlphaOmegakill: agagagah\r\nAlphaOmegakill: ahahahha kid\r\n\r\n\r\n\r\nSUMMARY:\r\nSo what is offensive here? The word NOOB?\r\nhttps://en.wikipedia.org/wiki/Newbie    Newbie, newb or noob is a slang term for a novice or newcomer, or somebody inexperienced in any profession or activity.  &lt;----------------- how is this OFFENSIVE?\r\n\r\nAre you telling me i have to lie to people ?\r\nSo, when someone plays like a beginner i have to tell them that they are pro level player?\r\nIs RIOT encourage pathological lying?\r\nI don&#039;t understand this.\r\nNOOB is a perfectly acceptable word for describing someone who cant play a game.\r\n\r\n\r\nOffense is never given only taken.\r\nSo why should i get a PERMANENT BAN, because some fragile teenager cant deal with words, that are said in movies countless times.\r\n\r\n\r\nGame 3\r\nAlphaOmegakill: how i play azir? I dont know what to do :(\r\nAlphaOmegakill: lol enemy mid needed jungler help to take me down\r\nAlphaOmegakill: late game will be mine  no matter what you do uhahahahha\r\nAlphaOmegakill: wtf atre you noob ?\r\nAlphaOmegakill: this jungler just walked into enemy attacks&#039;\r\nAlphaOmegakill: omg i have another team of unskilled people\r\nAlphaOmegakill: you all have marks on your champs and you cant play them ?\r\nAlphaOmegakill: last time i come and help\r\nAlphaOmegakill: unskilled bot lost lane\r\nAlphaOmegakill: so ? i have almost destroyed enemy torrent you lost a turrent\r\nAlphaOmegakill: we will see count how many torrents i will destroy compared to you\r\nAlphaOmegakill: noobs\r\nAlphaOmegakill: you all have  marks on your champs and you losto enemy players who have no marks ? wtf\r\nAlphaOmegakill: i see how you carry\r\nAlphaOmegakill: god are you guys noobs\r\nAlphaOmegakill: really\r\nAlphaOmegakill: you lucky enemy that i have noobs who lose every team fight\r\nAlphaOmegakill: support reported afk\r\nAlphaOmegakill: dont sleep adc\r\nAlphaOmegakill: i dont understand how you guys cant play i really dont\r\nAlphaOmegakill: look the map they dominate all sides\r\nAlphaOmegakill: THEN STOP DYING OMG\r\nAlphaOmegakill: lokm g\r\nAlphaOmegakill: wtf no sur ranked game you insnae ?\r\nAlphaOmegakill: usless team\r\nAlphaOmegakill: absulte 0 skill\r\nAlphaOmegakill: delet game\r\n\r\n\r\nSUMMARY:\r\nAgain what is the problem? I have heard worst words in movies and TV shows.\r\n\r\n\r\nPls give me my account back. It is clear that someone just abuses your Tribunal system to BAN people PERMANENTLY for absurd SUBJECTIVE nonsense.","replies":[{"poster":"Kyrrion","date":"2016-08-27T21:06:45.172+0000","up_votes":12,"down_votes":0,"body":"> AlphaOmegakill: reported for verbal abuse\n\nThe irony of this quote is real.\n\n> [{quoted}](name=AlphaOmegakill,realm=EUNE,application-id=ZGEFLEUQ,discussion-id=Z6IudQ5l,comment-id=0002000000010000,timestamp=2016-08-27T21:04:39.184+0000)\n>\n> Offense is never given only taken.\n\nThen you need to learn some etiquette and basic manners.","replies":[{"poster":"AlphaOmegakill","date":"2016-08-27T21:15:03.059+0000","up_votes":1,"down_votes":8,"body":"RIOT laks any definition of what is abusive or insulting or toxic.\nIt is all SUBJECTIVE and therefore, i dont see that i did anything wrong.\n\n\nMoreover they don't punish feeders or people who abuse the report system.\n\n\nSo your claims are refuted.\nRIOT seems not to care, the only thing it seems to care about is that people act like robots.","replies":[{"poster":"Deep Terror Nami","date":"2016-08-27T21:42:28.597+0000","up_votes":6,"down_votes":0,"body":"> RIOT laks any definition of what is abusive or insulting or toxic.\nIt is all SUBJECTIVE and therefore, i dont see that i did anything wrong.\n\nThe standards decided upon are subjective, as what is \"right and wrong\" is decided by the community. The rules to follow those standards are objective; you follow them or you get the boot (though there is subjective leeway to your benefit, not detriment). You don't have to personally agree with what the rest of the community and Riot has decided upon, you merely have to follow suit. You are free to express your opinion on the matter and make a movement to affect change towards your beliefs on the matter, but concerning your positions expressed here the vast majority of other players don't want any part of it.\n\n> Moreover they don't punish feeders or people who abuse the report system.\n\nThey do punish feeders. There is an automated system to detect those too, but it's not perfect; it is much harder to determine someone is committing gameplay offenses intentionally rather than just playing poorly, than it is to parse chat logs for common offensive language and phrases.\n\nAs for abusing the report system, what abuse? The system is designed around tossing out false reports and lowering their report value; all reports do is flag the system to check that player's match when a case review is triggered. Premade reports also do not stack to increase the chance of a case review, and multiple reports in a match can't make the system check it any harder either.\n\n> RIOT seems not to care, the only thing it seems to care about is that people act like robots.\n\nPeople in general are typically not going to be receptive to anything said from a person verbally attacking them. You don't need to give them emotionless responses, you just need to not flame them. If you can't think of a way to write your message in a positive and productive manner, try to remain neutral. If you can't even do that, just don't say anything, because you'll probably just make things worse. I recommend muting players that decide to get toxic back at you if they aren't receptive to your neutral/positive well-meaning chat.","replies":[]}]}]},{"poster":"MagicFlyingLlama","date":"2016-08-27T20:54:47.214+0000","up_votes":10,"down_votes":0,"body":"Nothing of value was lost, another incredibly toxic, arrogant child banned.\n\nThe tribunal system was closed years ago. Bans are handled by automatic detected, confirmed by support staff. \n\nStop blaming the system, blame yourself for your intolerable, uncontrolled behavior. You may get farther in life if you shape up.\n","replies":[{"poster":"AlphaOmegakill","date":"2016-08-27T21:00:25.137+0000","up_votes":1,"down_votes":11,"body":"Why are you Defending RIOTs support staff, who seem to ban people for SUBJECTIVE reasons?\n\nOffense is never given only taken.\nSo why should i get a PERMANENT BAN, because some fragile support staff member cant deal with words, that are said in movies countless times?\nThis goes under the term \" abusing power\"","replies":[{"poster":"SmokedAlmonds","date":"2016-08-27T21:02:19.800+0000","up_votes":9,"down_votes":0,"body":"It's not abusing power. It is enforcing behavioral rules that you clearly broke.","replies":[]},{"poster":"MagicFlyingLlama","date":"2016-08-27T21:25:22.447+0000","up_votes":5,"down_votes":0,"body":"You posted chatlogs of you being incredibly toxic, enough to warrant a permban with no warning, in my opinion, and the opinion of riot, apparently.\n\nIt has nothing to do with \"some fragile support staff\", it has to do with the fact you are out of control and got shut down for your behavior. You give nothing to the community except rage and abuse, and thus you got removed from it.\n\nIt is nothing personal, i understand it may be hard for your extreme arrogance to accept that. Riot bans disruptive, worthless-to-the-community individuals regardless of how important they think they are.\n\nI have no idea what \"said in movies\" has to do with your abusive, out of control behavior. The rules are clearly set, and you knowingly broke them.","replies":[{"poster":"AlphaOmegakill","date":"2016-08-27T21:35:16.196+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=MagicFlyingLlama,realm=NA,application-id=ZGEFLEUQ,discussion-id=Z6IudQ5l,comment-id=000200000003,timestamp=2016-08-27T21:25:22.447+0000)\n>\n> You posted chatlogs of you being incredibly toxic, enough to warrant a permban with no warning, in my opinion, and the opinion of riot, apparently.\n> \n> It has nothing to do with &quot;some fragile support staff&quot;, it has to do with the fact you are out of control and got shut down for your behavior. You give nothing to the community except rage and abuse, and thus you got removed from it.\n> \n> It is nothing personal, i understand it may be hard for your extreme arrogance to accept that. Riot bans disruptive, worthless-to-the-community individuals regardless of how important they think they are.\n> \n> I have no idea what &quot;said in movies&quot; has to do with your abusive, out of control behavior. The rules are clearly set, and you knowingly broke them.\n\n\n\"You posted chatlogs of you being incredibly toxic\" <------------------  Subjective therefore irrelevant.\nRIOT laks any definition of what is abusive or insulting or toxic.\n\nIt is all SUBJECTIVE and therefore, i dont see that i did anything wrong.","replies":[{"poster":"MagicFlyingLlama","date":"2016-08-27T21:46:36.962+0000","up_votes":3,"down_votes":0,"body":"At this point i just think you are a troll. The alternative is that you are insane and completely detached from reality.","replies":[]},{"poster":"BloodyTompon","date":"2016-08-28T01:07:54.654+0000","up_votes":3,"down_votes":0,"body":"Lol. I find it humous that you're pulling out ethics and metaphysics to try and defend your position. \n\nWhether it was subjective or not, guess what? \nIt happened. --> Objective truth. \nRiot has the power to ban your account. --> Objective truth\nRiot did ban your account. --> Objective truth\n\nYou're argument looks pretty similar to somebody being arrested and saying 'but I don't like the law, it don't agree with and I didn't make it up so it shouldn't apply to me.' If you ever get arrested try that and see how well it works. There's a reasons prison is full of people who plead innocent. \n\nFunny thing is though, in this case, you did sign up to it. Every time the game patches you agree with the ToS.  You accept that Riot owns the account, not you, and can do with it whatever they want based on their subjective view. \n--> all objective truths.","replies":[]},{"poster":"theArtifacts","date":"2016-08-27T22:06:01.220+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=AlphaOmegakill,realm=EUNE,application-id=ZGEFLEUQ,discussion-id=Z6IudQ5l,comment-id=0002000000030000,timestamp=2016-08-27T21:35:16.196+0000)\n>\n> &quot;You posted chatlogs of you being incredibly toxic&quot; &lt;------------------  Subjective therefore irrelevant.\n> RIOT laks any definition of what is abusive or insulting or toxic.\n> \n> It is all SUBJECTIVE and therefore, i dont see that i did anything wrong.\n\nActually... it's SUBJECTIVE and therefore 100% relevant.\nSomeone felt (subjective) you were being verbally abusive to them by name calling (which is by definition verbal abuse; objective)\nAs they felt such they reported you (subjective) and the chat logs supported their claims (objective).","replies":[]}]}]},{"poster":"Alpha Samsuni","date":"2016-08-27T21:03:41.858+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=AlphaOmegakill,realm=EUNE,application-id=ZGEFLEUQ,discussion-id=Z6IudQ5l,comment-id=00020000,timestamp=2016-08-27T21:00:25.137+0000)\n>\n> Why are you Defending RIOTs support staff, who seem to ban people for SUBJECTIVE reasons?\n> \n> Offense is never given only taken.\n> So why should i get a PERMANENT BAN, because some fragile support staff member cant deal with words, that are said in movies countless times?\n> This goes under the term &quot; abusing power&quot;\n\nwait so, if I watch a movie with 100 different kinds of insults I can say those to my teammates and not get punished?\nNEW THING LEARNED TODAY!","replies":[]},{"poster":"Torpedosheep","date":"2016-08-27T21:15:17.198+0000","up_votes":2,"down_votes":0,"body":"No Support staff issued this punishment.\n\nIt was an automated system that gave you the permanent ban.\nAnd before you say anything, yes the system works fine, and yes, \nit made a great judgement in your case too.","replies":[]}]}]},{"poster":"EvilDustMan","date":"2016-08-27T22:08:32.784+0000","up_votes":7,"down_votes":0,"body":"Objective truth: You are an ass. You do nothing but berate your team constantly and make demands of them as if they are there on your benefit.\n\nF** is a bad word because the group it refers to collectively said 'hey, could you not say that?' And hey, you want to take the man approach to it? Okay. Grow up. Be a man. Be respectful. When did being a man stop meaning having some discipline and respect?","replies":[]},{"poster":"archerno1","date":"2016-08-27T20:58:56.388+0000","up_votes":7,"down_votes":0,"body":"\"I want my account back RIGHT NOW.\"\n\nNope.","replies":[{"poster":"AlphaOmegakill","date":"2016-08-27T21:01:42.754+0000","up_votes":1,"down_votes":13,"body":"Then this will have consequences.","replies":[{"poster":"archerno1","date":"2016-08-27T21:03:27.798+0000","up_votes":8,"down_votes":0,"body":"> [{quoted}](name=AlphaOmegakill,realm=EUNE,application-id=ZGEFLEUQ,discussion-id=Z6IudQ5l,comment-id=00030000,timestamp=2016-08-27T21:01:42.754+0000)\n>\n> Then this will have consequences.\n\nYou gonna throw tantrum till your parent ground u?","replies":[{"poster":"AlphaOmegakill","date":"2016-08-27T21:09:12.139+0000","up_votes":1,"down_votes":10,"body":"I think you are mistaken me to be some 14 year old.\n\nLet's just say that people have been ( ? ) over less serious things.\n\nI will not just sit and watch how all my work is destroyed because of BIASED and POWER abusing RIOT staff members. \n\n\nSomeone will pay for this, if i don't get my account back.","replies":[{"poster":"archerno1","date":"2016-08-27T21:28:34.526+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=AlphaOmegakill,realm=EUNE,application-id=ZGEFLEUQ,discussion-id=Z6IudQ5l,comment-id=0003000000000000,timestamp=2016-08-27T21:09:12.139+0000)\n>\n> I think you are mistaken me to be some 14 year old.\n> \n> Let&#x27;s just say that people have been ( ? ) over less serious things.\n> \n> I will not just sit and watch how all my work is destroyed because of BIASED and POWER abusing RIOT staff members. \n> \n> \n> Someone will pay for this, if i don&#x27;t get my account back.\n\n14 ? Dont get over yourself. 10 more likely. Your account is gone. Its over. There is nothing u can do about it. U can always play minecraft. It suits your age","replies":[{"poster":"AlphaOmegakill","date":"2016-08-27T21:58:21.595+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=archerno1,realm=EUNE,application-id=ZGEFLEUQ,discussion-id=Z6IudQ5l,comment-id=00030000000000000002,timestamp=2016-08-27T21:28:34.526+0000)\n>\n> 14 ? Dont get over yourself. 10 more likely. Your account is gone. Its over. There is nothing u can do about it. U can always play minecraft. It suits your age\n\nthen someone in RIOT will pay for it one way or the other. \nLike i said i will not just accept it like Dunkey did when his account got banned.\n\nSome RIOT staff member will pay for this injustice. \n\n\nIf they refuse to listen to people and dont fix their broken system that bans people for SUBJECTIVE nonsense, then they will face the consequences.","replies":[{"poster":"archerno1","date":"2016-08-27T22:24:06.168+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=AlphaOmegakill,realm=EUNE,application-id=ZGEFLEUQ,discussion-id=Z6IudQ5l,comment-id=000300000000000000020000,timestamp=2016-08-27T21:58:21.595+0000)\n>\n> then someone in RIOT will pay for it one way or the other. \n> Like i said i will not just accept it like Dunkey did when his account got banned.\n> \n> Some RIOT staff member will pay for this injustice. \n> \n> \n> If they refuse to listen to people and dont fix their broken system that bans people for SUBJECTIVE nonsense, then they will face the consequences.\n\nSon there is nothing u can do. This isnt government, its private company. Brush your teeth, go to bed. When u grow up, make new account and try to behave mature. This game belongs to riot and they can decide who can play and who cant. They can decide what u are allowed to say on their property. You have to obey their rules if u want to play here. ","replies":[]}]}]},{"poster":"Kyrrion","date":"2016-08-27T21:18:48.099+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=AlphaOmegakill,realm=EUNE,application-id=ZGEFLEUQ,discussion-id=Z6IudQ5l,comment-id=0003000000000000,timestamp=2016-08-27T21:09:12.139+0000)\n>\n> I think you are mistaken me to be some 14 year old.\n> \n> Let&#x27;s just say that people have been ( ? ) over less serious things.\n> \n> I will not just sit and watch how all my work is destroyed because of BIASED and POWER abusing RIOT staff members. \n> \n> \n> Someone will pay for this, if i don&#x27;t get my account back.\n\nI have an honest question for you.\n\nWhat was your intent behind saying the following phrases?\n\n> AlphaOmegakill: i told you all she is op\n> AlphaOmegakill: lost game noob adc\n\n> AlphaOmegakill: yeah nice how you all died like noobs\n> AlphaOmegakill: what a team of losers i said she is OP nobody listen'\n\n> AlphaOmegakill: 0 vsion\n> AlphaOmegakill: losers\n> AlphaOmegakill: absulte noobs\n> AlphaOmegakill: NO SUR RANKED FUCK YOU\n> AlphaOmegakill: YOU STUPID ? NO WONDER YOU ARE SO LOW RANK\n\n> AlphaOmegakill: top ss ?\n> AlphaOmegakill: usless top sleeps\n\n> AlphaOmegakill: path pls stop talking i dont want to hear teenager ego talk\n> AlphaOmegakill: shh 12 year old\n> AlphaOmegakill: omg this team\n\n> AlphaOmegakill: omg i have another team of unskilled people\n> AlphaOmegakill: you all have marks on your champs and you cant play them ?\n> AlphaOmegakill: last time i come and help\n> AlphaOmegakill: unskilled bot lost lane\n\n> AlphaOmegakill: usless team\n> AlphaOmegakill: absulte 0 skill\n\nWas it to be funny?  Because those aren't jokes.\nWas it to be inspiring?  Because insults don't motivate.\nWas it to bring up a logical point for an argument?  Because in a debate you attack the idea, not the person.","replies":[{"poster":"AlphaOmegakill","date":"2016-08-27T21:32:35.509+0000","up_votes":1,"down_votes":4,"body":"> [{quoted}](name=Kyrrion,realm=NA,application-id=ZGEFLEUQ,discussion-id=Z6IudQ5l,comment-id=00030000000000000001,timestamp=2016-08-27T21:18:48.099+0000)\n>\n> I have an honest question for you.\n> \n> What was your intent behind saying the following phrases?\n> \n> Was it to be funny?  Because those aren&#x27;t jokes.\n> Was it to be inspiring?  Because insults don&#x27;t motivate.\n> Was it to bring up a logical point for an argument?  Because in a debate you attack the idea, not the person.\n\nPls provide me scientific evidence for those claims.\nI don't mean just one study. I mean provide me with peer reviewed papers that all support your claims .\nIf you can't do that, then plz dont waste my time with your SUBJECTIVE REALITY and come back with some OBJECTIVE TRUTH.\n\nOffense is never given only taken.","replies":[{"poster":"Kyrrion","date":"2016-08-27T21:35:25.487+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=AlphaOmegakill,realm=EUNE,application-id=ZGEFLEUQ,discussion-id=Z6IudQ5l,comment-id=000300000000000000010000,timestamp=2016-08-27T21:32:35.509+0000)\n>\n> Pls provide me scientific evidence for those claims.\n> I don&#x27;t mean just one study. I mean provide me with peer reviewed papers that all support your claims .\n> If you can&#x27;t do that, then plz dont waste my time with your SUBJECTIVE REALITY and come back with some OBJECTIVE TRUTH.\n> \n> Offense is never given only taken.\n\nThen answer my question and provide me the intent of those statements.","replies":[{"poster":"AlphaOmegakill","date":"2016-08-27T21:54:04.384+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=Kyrrion,realm=NA,application-id=ZGEFLEUQ,discussion-id=Z6IudQ5l,comment-id=0003000000000000000100000000,timestamp=2016-08-27T21:35:25.487+0000)\n>\n> Then answer my question and provide me the intent of those statements.\n\nOffense is never given only taken.","replies":[{"poster":"CooL Ice Tea","date":"2016-08-29T06:23:08.978+0000","up_votes":1,"down_votes":0,"body":"Your shitty sentences is so annoying.\n\nAccounts are never given, only taken. And you act like a jerk. The whole community is against you, guess you have not that many friends to talk about this subject, otherwise they would support the community as well. \n\nGet your shit right kiddo and grow damn the hell up.","replies":[]}]}]}]}]},{"poster":"Deep Terror Nami","date":"2016-08-27T21:18:03.383+0000","up_votes":5,"down_votes":0,"body":"There are certain standards you agree to meet when you sign the [Terms of Use](http://na.leagueoflegends.com/en/legal/termsofuse) and play this game (and use the boards). Using offensive speech such as what was censored is not acceptable in this community and may result in an escalated punishment, though simply insulting your team as you were also constantly doing will move you up the escalation path as well if you keep doing it.\n\nMaking threats like here is ill advised; all it will do is cut you off from any sort of assistance you may have otherwise received, and is illegal outside the game as well.","replies":[{"poster":"Alpha Samsuni","date":"2016-08-27T21:20:45.041+0000","up_votes":3,"down_votes":2,"body":"> [{quoted}](name=Deep Terror Nami,realm=NA,application-id=ZGEFLEUQ,discussion-id=Z6IudQ5l,comment-id=00030000000000000000,timestamp=2016-08-27T21:18:03.383+0000)\n>\n> There are certain standards you agree to meet when you sign the [Terms of Use](http://na.leagueoflegends.com/en/legal/termsofuse) and play this game (and use the boards). Using offensive speech such as what was censored is not acceptable in this community and may result in an escalated punishment, though simply insulting your team as you were also constantly doing will move you up the escalation path as well if you keep doing it.\n> \n> Making threats like here is ill advised; all it will do is cut you off from any sort of assistance you may have otherwise received, and is illegal outside the game as well.\n\nOMG I FOUND DEEP TERROR NAMI :D I AM HONORED","replies":[]}]}]}]}]}]},{"poster":"RPK9KM4K4A","date":"2016-08-27T20:52:25.534+0000","up_votes":6,"down_votes":0,"body":"Good riddance, nothing of value is lost. You are far too deluded for any help hence why you are permabanned (justly deserved too).","replies":[]},{"poster":"TheLazySunbro","date":"2016-08-27T21:15:11.669+0000","up_votes":5,"down_votes":0,"body":"GOT MINE BANNED LAST WEEK\n\nSEEING BY YOUR CHAT YOU DESERVED IT IT REKT PLEB \nhttp://i.makeagif.com/media/8-05-2015/zWzwnA.gif","replies":[{"poster":"BloodyTompon","date":"2016-08-28T00:48:50.778+0000","up_votes":1,"down_votes":0,"body":"....Why is that man making love to the barbecue?","replies":[]},{"poster":"AlphaOmegakill","date":"2016-08-27T21:26:06.868+0000","up_votes":1,"down_votes":5,"body":"Stop lying.","replies":[{"poster":"TheLazySunbro","date":"2016-08-27T21:35:24.690+0000","up_votes":2,"down_votes":0,"body":"https://imgur.com/hYbs8Td\n\nhere you go boss https://i.makeagif.com/media/9-06-2015/J-6vSF.gif","replies":[{"poster":"Alpha Samsuni","date":"2016-08-27T21:36:38.757+0000","up_votes":1,"down_votes":0,"body":"lol","replies":[{"poster":"TheLazySunbro","date":"2016-08-27T21:41:31.813+0000","up_votes":1,"down_votes":0,"body":"im not gonna hold the L here fam","replies":[]}]}]}]}]},{"poster":"Prandine","date":"2016-08-27T23:27:25.460+0000","up_votes":4,"down_votes":0,"body":"Punishments are given out on a 4-strike system.\n\nStrike1: 10-game chat restriction.\nStrike2: 25-game chat restriction.\nStrike3: 2-week ban.\nStrike4: Permanent ban.\n\nWhenever you are reported it triggers a review of your account. If it's found that you consistently show negative and poor behavior across multiple games then you receive the next step up the punishment ladder (except in extreme cases where chat restrictions get skipped (i.e. death threats, racist comments, intentional gameplay trolling, etc.)). On the flipside if nothing rule-breaking is found then the report is deemed false and thrown out, and the reporter has their report weight and value lowered. If you show enough of a reformation effort (~3 months time give or take) then you can drop down punishment levels.\n\nAs for your punishment, this was a question of \"is this punishment worthy?\" to which the answer is yes. You constantly verbally abused and harassed your teammates in all three games non-stop. Your teammates didn't like that (and whether they took offense to it or not is something that only they know for sure), hence why they reported you. Those reports triggered a review of your account and found out that you were still acting up and hadn't changed. Because of that, the system determined that you deserved another punishment, which in this case was a permanent ban. From [Ulanopo's Knowledge Base](http://forums.na.leagueoflegends.com/board/showthread.php?t=4086541&page=4#post43467878): \n\n>**Is there any way to remove my permaban?**\n\n>Keep in mind that we dont have the power to remove your ban. Only Riot has that ability.\n\n>BANS THAT CANNOT BE LIFTED\n* Behavioral\n* Tampering with the game client\n* DDOS\n* Real-life harassment, threats or stalking\n* Elo boosting\n\n>BANS THAT MIGHT BE LIFTED\n* Inappropriate name\n* Payment problems\n\nIf you truly valued your account then you should have thought of that before you got permabanned.","replies":[]},{"poster":"Jo0o","date":"2016-08-27T22:54:34.565+0000","up_votes":4,"down_votes":0,"body":"For all your bluster, you failed to follow simple, straightforward rules. Thus, you were punished. That's going to be true in one form or another for most things you do in life, so it's good that you're learning it now.","replies":[]},{"poster":"Reket DeAlk","date":"2016-08-27T21:40:59.435+0000","up_votes":4,"down_votes":0,"body":"I want a million dollars RIGHT NOW!\n\n...Huh. That didn't work. Strange. Try a new approach.","replies":[]},{"poster":"Alpha Samsuni","date":"2016-08-27T21:16:36.649+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=AlphaOmegakill,realm=EUNE,application-id=ZGEFLEUQ,discussion-id=Z6IudQ5l,comment-id=,timestamp=2016-08-27T20:50:09.510+0000)\n>\n> SUMMARY:\n> So what now? Words like %%%, LOSERs, STUPID are now forbidden words? This Political Correctness insanity has to end .\n> Your system is so broken. Any one can go there and find whatever someone said OFFENSIVE.\n> **IT IS SUBJECTIVE**.\n> So why should my account get a PERMANENT ban because someone found that what i said is offensive?\n> \n> **To feeders get banned?**\n> **NO.**\n> \n> But when you say something that someone else finds OFFENSIVE than you get banned.\n> FIX YOUR SYSTEM and GIVE ME MY ACCOUNT BACK .\n> \n> \n> Offense is never given only taken.\n> So why should i get a PERMANENT BAN, because some fragile teenager cant deal with words, that are said in movies countless times.\n> \n> \n> \n> **SUMMARY:\n**> **So what is offensive here? The word NOOB?\n**> **https://en.wikipedia.org/wiki/Newbie    Newbie, newb or noob is a slang term for a novice or newcomer, or somebody inexperienced in any profession or activity.  &amp;lt;----------------- how is this OFFENSIVE?\n**> \n> Are you telling me i have to lie to people ?\n> So, when someone plays like a beginner i have to tell them that they are pro level player?\n> Is RIOT encourage pathological lying?\n> I don&amp;#039;t understand this.\n> NOOB is a perfectly acceptable word for describing someone who cant play a game.\n> \n> \n> Offense is never given only taken.\n> So why should i get a PERMANENT BAN, because some fragile teenager cant deal with words, that are said in movies countless times.\n> \n> \n> \n> \n> **SUMMARY:\n**> **Again what is the problem? I have heard worst words in movies and TV shows.\n**> \n> \n> Pls give me my account back. It is clear that someone just abuses your Tribunal system to BAN people PERMANENTLY for absurd SUBJECTIVE nonsense.\n\n1.What so if I go kill someone it's \"subjective\" if it was justly done so I shouldn't get punished?\n\n2.No feeders don't get banned because everyone has bad days. Should someone get banned for being bad at the game? If you are referring to intentional feeders then yes, they do get banned. There's a report option for them you know\n\n3.Noob is offensive because it is **used** to say \"OMG YOU SUCK AT THIS GAME\" and not \"You're new\"\n\n4.As I said before in my earlier post, if I go and went to watch a movie with 100 insults would I have the right to say that to my teammates in an unrelated game and not get banned for it?","replies":[{"poster":"AlphaOmegakill","date":"2016-08-27T21:24:45.262+0000","up_votes":1,"down_votes":6,"body":"> \n> 1.What so if I go kill someone it&#x27;s &quot;subjective&quot; if it was justly done so I shouldn&#x27;t get punished? \n> \n> 2.No feeders don&#x27;t get banned because everyone has bad days. Should someone get banned for being bad at the game? If you are referring to intentional feeders then yes, they do get banned. There&#x27;s a report option for them you know\n> \n> 3.Noob is offensive because it is **used** to say &quot;OMG YOU SUCK AT THIS GAME&quot; and not &quot;You&#x27;re new&quot;\n> \n> 4.As I said before in my earlier post, if I go and went to watch a movie with 100 insults would I have the right to say that to my teammates in an unrelated game and not get banned for it?\n\n\n1. Killing and saying words are two differnt things. The fact that you even think that killing is the same as saying to someone \" you are stupid \", shows me that people here are really morally insane.\nPls stop posting you need mental help.\n\n2. So feeding enemy champs is just \" having a bad day \" , but this doesn't go for using bad words?\nSo ruining the game with your actions doesn't get punished by RIOT, but using words in a game, gets you a permanent BAN?\nSorry i cant follow this logic at all.\nLogic like that can only come from an insane asylum.\n\n3.  \" Noob is offensive  \"<--------------- no it is not . It means \" Newbie, newb or noob is a slang term for a novice or newcomer, or somebody inexperienced in any profession or activity. \"\nOffense is never given only taken.","replies":[{"poster":"SmokedAlmonds","date":"2016-08-27T21:32:02.623+0000","up_votes":4,"down_votes":0,"body":"How can you call people morally insane when in your own thread title you imply that something being common in a movie makes it acceptable? \n\nFeeding is just a derogatory word for losing. So no people won't get punished for that. Intentional feeding is punishable, but that is something entirely different.\n\nUsing any word to insult or otherwise put down someone is verbal abuse. The word chosen only changes the severity.\n\nThe behavior in your chat logs is completely unacceptable in league. Very little if anything you said was helpful in any way. You were using chat almost exclusively to tear down people.","replies":[]},{"poster":"Alpha Samsuni","date":"2016-08-27T21:29:27.833+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=AlphaOmegakill,realm=EUNE,application-id=ZGEFLEUQ,discussion-id=Z6IudQ5l,comment-id=00070000,timestamp=2016-08-27T21:24:45.262+0000)\n>\n> 1. Killing and saying words are two differnt things. The fact that you even think that killing is the same as saying to someone &quot; you are stupid &quot;, shows me that people here are really morally insane.\n> Pls stop posting you need mental help.\n> \n> 2. So feeding enemy champs is just &quot; having a bad day &quot; , but this doesn&#x27;t go for using bad words?\n> So ruining the game with your actions doesn&#x27;t get punished by RIOT, but using words in a game, gets you a permanent BAN?\n> Sorry i cant follow this logic at all.\n> Logic like that can only come from an insane asylum.\n> \n> 3.  &quot; Noob is offensive  &quot;&lt;--------------- no it is not . It means &quot; Newbie, newb or noob is a slang term for a novice or newcomer, or somebody inexperienced in any profession or activity. &quot;\n> Offense is never given only taken.\n\n1.My point is not about the crime, it is about the whole \"subjective\" argument.\n\n2.Um, what? If you went ahead and fed because you're having a bad day then no, you shouldn't get banned. Feeders usually feed for that one specific day. You on the other hand is flaming on a consistent basis.\n\n3.The official meaning of \"noob\" is newbie. In the gaming community though, it is used to mean \"YOU SUCK\".\n\n4.What about my..4th..argument...why u no answer it","replies":[{"poster":"AlphaOmegakill","date":"2016-08-27T21:50:08.032+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Alpha samsuni,realm=NA,application-id=ZGEFLEUQ,discussion-id=Z6IudQ5l,comment-id=000700000000,timestamp=2016-08-27T21:29:27.833+0000)\n>\n> 1.My point is not about the crime, it is about the whole &quot;subjective&quot; argument.\n> \n> 2.Um, what? If you went ahead and fed because you&#x27;re having a bad day then no, you shouldn&#x27;t get banned. Feeders usually feed for that one specific day. You on the other hand is flaming on a consistent basis.\n> \n> 3.The official meaning of &quot;noob&quot; is newbie. In the gaming community though, it is used to mean &quot;YOU SUCK&quot;.\n> \n> 4.What about my..4th..argument...why u no answer it\n\n1. The point is that you compared the act of killing with the act of insulting. This is absurd. But i know from where this comes from. Today's youth is teached SUBJECTIVE MORALITY, this is why you are all so confused.\nYou think it is all the same no difference.\nKilling is just as bad as insulting someone. ( is what you seem to think )\nWhich of course is Morally bankrupt.\n\n2. Wrong. Riot punishes people for using words, but doesn't punish people for actions.\nThis Is like you would live in a communist state, where when you insult the dictator you get killed, but when you follow the dictators orders and kill others, then you are a GOOD BOY.\nIt is seems RIOt is morally confused.\nMaybe Someone needs to come by and explain to them what is right and what is wrong.\nWhat is just and what is unjust.\nThey really seem to be confused about it.\n\nPeople are angry at RIOt anyway. I think it is time that someone really does something about this.\n\n3 \" The official meaning of \"noob\" is newbie. In the gaming community though, it is used to mean \"YOU SUCK\"\" <-------------------like i said SUBJECTIVE.\nOffense is never given only taken.\n\n4 Offense is never given only taken.\n\n\n\nI think you people really seem not to understand  how big of a problem this \" CONTROLLING WHAT PEOPLE CAN AND CANNOT SAY \" thingsis\n\nDo you know anything about COMMUNISM?\nThis starts to seem like communism.\nSome small group of people dictates what people can and can not say.\n\n\nI think it is time that someone gets punished . People get really sick of this politically correct nonsense everywhere. \nAnd now in video games too.\n\nIf RIOT  doesn't listen, then maybe other measures will make them understand.","replies":[{"poster":"Alpha Samsuni","date":"2016-08-27T22:19:53.206+0000","up_votes":2,"down_votes":0,"body":"1.OMG my point is NOT about the crime. k fine, if I went to call everyone insults in school and it said in the rules that insults are not allowed, would I be not punished because \"ITS SUBJECTIVE!\"\n\n2.A.You seem to not get what I am saying. People do not get banned for sucking at a game. People do get banned for flaming other people consistently. B.Maybe Someone needs to come by and explain to you what is right and what is wrong\n\n3 and 4.Bro..are you gonna just say \"Offense is never given only taken\" to all arguments you can't answer? Wtf does offense have to do with the argument? Are you saying you didn't mean to offend someone? Because your chat logs clearly show you indeed do.","replies":[{"poster":"Alpha Samsuni","date":"2016-08-27T23:02:06.901+0000","up_votes":2,"down_votes":0,"body":"Oh and, you basically said \"I will not break your rules and I will accept a ban if I do so\" when you pressed yes to that terms of service that comes up every update","replies":[{"poster":"Alpha Samsuni","date":"2016-08-27T23:11:21.230+0000","up_votes":1,"down_votes":0,"body":"..Did you give up with the arguments? Fine with me.","replies":[]}]}]}]}]},{"poster":"Bettnachleger","date":"2016-08-27T21:58:52.852+0000","up_votes":1,"down_votes":0,"body":"Newbie means newbie, noob means  --> **n**ewbie **o**ut **o**f **b**rain.\nhttp://de.urbandictionary.com/define.php?term=Noob","replies":[]}]}]},{"poster":"Ulanopo","date":"2016-11-21T03:19:45.678+0000","up_votes":3,"down_votes":0,"body":"> Offense is never given only taken.\n\nThis simply isn't true. The whole purpose of language is to convey meaning. When that meaning is to insult or demean, giving offense is the intent.\n\nWe often talk about The Three Portals:\n\n* Is it _true_?\n* Is it _necessary_?\n* Is it _kind_?\n\nYour use chat fails TWICE. It is never necessary for you to tell people that they are \"noobs\". It is neither helpful nor kind. \n\n> So why should i get a PERMANENT BAN, because some fragile teenager cant deal with words, that are said in movies countless times.\n\nDisabuse yourself of the notion that someone is \"fragile\" because they don't want to put up with your behavior.\n\nIf someone talks in a theater, I can ask for them to be removed.\nIf someone smokes in a restaurant, I can ask for them to be removed.\nIf someone acts like a petulant child in a League match, I can ask for them to be removed.\n\n> Pls give me my account back. It is clear that someone just abuses your Tribunal system to BAN people PERMANENTLY for absurd SUBJECTIVE nonsense.\n\nThe Tribunal has been down for years now. I'm also curious why you think your subjective beliefs about what is and is not acceptable are somehow more valid than what is surely hundreds of people reporting you.","replies":[]}]}