{"poster":"Heavenly Sir","date":"2015-02-04T19:25:26.923+0000","title":"[Championvorschlag]Sebastian Michaelis: ein teuflisch guter Butler (Tank/Supp)","subforum":"Skin- & Champion-Konzepte","up_votes":4,"down_votes":3,"body":"**Der teuflisch gute Butler Sebastian Michaelis**\n\n„ Ich bin ein teuflisch guter Butler“\n\nLeben: 440(+80/pro Stufe)\nLebensregen.: 4,5(+1,0/pro Stufe)\nMana: 235(+45/pro Stufe)\nManaregen.:5,5(+0,8/pro Stufe)\nAngriffsschaden: 55(+2,5/pro Stufe)\nAngriffstempo: 0.630(+2,5%/pro Stufe)\nRüstung: 20(+4,00/pro Stufe)\nMagieresistenz: 25(+1.25/pro Stufe)\nLauftempo: 360\n\n** Fähigkeiten:**\n\n> Passive: Mein Herr ruft mich!\n> Wird sein Herr in einem Umkreis von 1200 angegriffen, so bekommt der Butler 20 Lauftempo und gibt dem Verbündeten 8 Rüstung und 5 Magieresistenz. ( Am Anfang des spiels, kann der Butler einem verbündeten eine Tasse Tee reichen, so schließen beide einen Pakt, nur der Partner bekommt die Bonis von Mein Herr ruft mich.\n> (Diese Werte errechnen sich aus der Rüstung vom Butler, also 10% des Wertes vom Butler)\n> \n> Mein junger Herr! (Q)\n> Kosten: 60/65/70/80/90\n> Reichweite: 650\n> Abklingzeit: 20/19/14/13/12\n> Der Butler sprintet zu dem ausgewählten verbündeten und fängt eine Attacke, Fähigkeit oder Betäubung mit seinem Tablet ab und wirft 3% des Schadens zurück.\n> \n> Teuflisch gut!! (W) \n> Der Butler wirft ein Messer in Richtung des Feindes, je öfters diese Fähigkeit benutzt wird, desto schneller wird der Butler, auch die Projektile gewinnen an Geschwindigkeit. Jedes Messer verlangsamt um 5%,  höchstens kann die Verlangsamung 15% betragen.\n> Innerhalb von 6 Sekunden folgende Schüsse kosten zusätzlich 20 Mana, höchstens aber 180 Mana.\n> Kosten: 45/50/55/60/70\n> Reichweite 1000\n> Abklingzeit: 8/6/4/3\n> Schaden: 50/65/70/90/130\n> \n> Eine Tasse Tee!! (E)\n> Kosten: 70/75/80//90\n> Reichweite: 650\n> Abklingzeit: 23/20/18/16/15\n> Der Butler reicht einem Champion eine Tasse Tee, es gibt 3 verschiedene Tee Sorten.\n>In einem Zeitraum von 8 Sekunden wechselt es von den drei Sorten immer hin und her, in dieser Zeit kann man wählen, welche Sorte man haben möchte.\n> \nFelsentee: Durch diese Sorte bekommen beide 5/12/14/16/20 Rüstung. (Wirkungsdauer beträgt 5 Sekunden) ( 3%/4%/5%/6% der Rüstung des Butlers)\n> \nSpäter Abend: Durch diese Sorte bekommt der Ausgewählte Champion 10/15/16/18/20 Schaden. (Wirkungsdauer beträgt 5 Sekunden) (2%/3%/4%/5% der Rüstung des Butlers)\n> \nRote Rose: Durch diese Sorte wird der Ausgewählte Champion für 80/120/180/220/250 Leben geheilt.\n> \n> \n> Der teuflisch guter Butler (R):\n> Kosten: 100/120/140\n> Reichweite: 1150\n> Abklingzeit: 120/100/80\n> Schaden: 100/140/200\n> Der Butler wirft sein Tablet, das erste Ziel wird betäubt (1,1,5,2), alle anderen Ziele, welche sich in einem Radius um das ausgewählte Ziel befinden, werden verlangsamt (30%) und erleiden Schaden. \n\n**Geschichte:**\n>  Sebastian Michaelis ist der Name des Butlers, er diente früher einer großen und mächtigen Familie, doch nach einer langen Zeit von Intrigen und Streitereien kam das Ende immer näher, denn der Butler war in Wirklichkeit ein Teufel.\n> Nur das Oberhaupt der Familie wusste von seiner waren Gestalt, denn sie alle schlossen mit ihm einen Pakt, in diesem Vertrag versprachen sie alle ihre Seele dem Teufel, doch er dufte sich die Seele nur nehmen, wenn er seinem Herrn denn Wunsch nach Rache erfüllt hatte. An einem Abend war es so weit, der Vertrag wurde wieder einmal erfüllt und die Seele des Oberhaupts der Familie Phantomthive sollte dem Teufel gehören, als er sich die Seele nehmen wollte flog durch das Fenster eine Laterne, welche sich die Seele des Mannes raubte. Die Laterne verschwand so schnell wie sie auch gekommen ist, er hörte nur ein Lachen, welches im sehr bekannt vorkam. Schnell sprang er aus dem Fenster, während die Familie von einem wütenden Mob getötet wurde. Er hörte flehende Rufe, welche vom Sohn des Oberhaupts kamen. „ Sebastian, wo seid ihr, bitte kommt und helft uns!!“ doch er wandte sich ab und zog los um die gestohlene Seele zurück zu bekommen.\n> Seine Suche endete in der Liga der Legenden, er wurde zum Champion und war ein sehr hochangesehener Kämpfer, doch im war alles egal, er wollte nur seine gestohlene Seele zurück, welche er nur bekommen konnte, wenn er in der Liga kämpfte.","replies":[{"poster":"Black Mage","date":"2015-02-06T09:15:30.753+0000","up_votes":1,"down_votes":0,"body":"Die Passive ist zu stark, denn du kannst dir schnell errechnen, das in einem Teamfight alle in irgendeiner weise schaden bekommen werden -> 40% der Defensiven Werte vom Butler werden ins geschehen addiert, was enorm ist!\n\nDas du diese Werte nochmals steigern kannst, mit dem E, ist abnormal...\n\nDie Q, ist einfach so, zu stark. Punkt.\nDu kannst einen Spell blocken, reflektierst 50% des Schadens, kostet kaum Mana UND positionierst dich gleichzeitig zu einem team mate?\nAlter Schwede, das wäre so als ob Braum nutzlos gemacht wurde mit einem Spell... Nicht zu vergessen das \"50% des schadens\" SEHR hoch ist, insbesondere weil du, selbst wenn dein team hinten liegt, nicht nur dem gegner vom Schadensoutput schadest, sondern auch zurückwirfst...\n\nStell dir mal eine annie/kasse/nidalee vor, die mit ihren Q's nicht nur nichts an schaden machen, sondern auch bestraft werden \"stark\" zu sein...\n\nW scheint ein fehler zu haben in der beschreibung, soll das eine CD erhöhung auf stufe 5 sein? also doch eher 2,5 sec, hoffe ich mal?\nRechne dir bitte mal den schaden aus: 200 Schaden (wird wahrscheinlich noch skalieren!), jede  2,5 sekunden, ab einem bestimmten Grad nicht mehr ausweichbar und dann nur maximal 120 mana pro wurf? Zusammen mit der Passiven und dem E, werden rein defensive builds OP as hell sein, stell dir vor er wird sich Frozen Hearth kaufen, vlt noch Glory und noch ein rylais, dann reicht es ihm auch aus top-/midlane solo zu spielen und den E als zweites zu maxen, da der grundschaden abnormal ist und er kostenlos nochmals defensive stats bekommt...\n\nE: wie schon gesagt, sind die buffs zu stark, der heal ist situationsabhängig, jedoch für die kosten ein schnäpchen und nicht zu schlagen!\n\nUlti ist ja nichts anderes als Sejuani's R... Also mit dem Kit davor viel zu stark und würde alle anderen supporter in frage stellen!","replies":[{"poster":"Heavenly Sir","date":"2015-02-06T09:37:49.674+0000","up_votes":1,"down_votes":0,"body":"Huhu, danke für dein Komment ;)\n\nHabe nun einiges geändert, bitte sag mir, ob es nun besser ist ;)","replies":[{"poster":"Black Mage","date":"2015-02-06T09:49:04.288+0000","up_votes":2,"down_votes":0,"body":"Besser schon, jedoch ist der W trotzdem zu günstig, die grundkosten müssen weiter hochgeschraubt werden, denn wenn man sich das anschaut, dann merkt man einfach schnell das viele andere champs kaum an den schaden rankommen werden den der W raushaut.\n(du kannst auch ohne den slow potenziell zu gut \"töten\" können, da er ehh defensive bauen kann mit Omen, etc und somit ehh keiner abhauen wird und er genüßlich ein messer nach dem anderen treffen wird)\n\nich würde auch nicht einen sprung von 100 auf 150 von level 3 auf 4 machen, das ist zu viel des guten, denn 200 schaden auf stufe 5 + skalierungen, zu stark...\n\ndem Q fehlt ein cooldown, so nebenbei.\n\ndem E würde ich vlt leicht abändern, sodass die %ualen bonis je level zunehmen, da ansonsten auf stufe 1 und auf stufe 5 die sleben defense werte erreicht werden.\n\nPassive ist nun interessant/besser, vlt es einrichten das er für 1k gold oder so eine neue tasse kaufen kann, um einen weiteren pakt schließen zu können, da im endgame er eher dem initiator anstelle dem adc die defensiven werte verleihen möchte (und der bonus movespeed es ihm ermöglicht mit seiner ulti mitzumachen)","replies":[{"poster":"Heavenly Sir","date":"2015-02-06T09:57:51.449+0000","up_votes":1,"down_votes":0,"body":"Sehr gut, da werde ich noch dran arbeiten ;)\nSchön das dir die Passive nun besser gefällt :D\n\nOb der wechsel nicht zu stark ist mhmm, da es mei Kalista ja auch nicht geht.\nNur bis Minute x.","replies":[{"poster":"Heavenly Sir","date":"2015-02-06T10:03:55.063+0000","up_votes":1,"down_votes":0,"body":"So, jetzt sollte es besser sein.\n\nDanke für deine Hilfe, wenn du möchtest, kannst du mich in League of Legends adden, aber nur wenn du es möchtest.\nNeue Freunde sind immer gut ;)","replies":[]}]}]}]}]},{"poster":"Novlew ","date":"2015-02-05T19:18:32.663+0000","up_votes":1,"down_votes":0,"body":"ernst haft du gibst den  champ die Fähigkeiten wie der batler im film?","replies":[{"poster":"Heavenly Sir","date":"2015-02-05T19:22:01.294+0000","up_votes":2,"down_votes":0,"body":"Ähm, welcher Film?","replies":[]}]},{"poster":"MyHawtTeets","date":"2015-02-05T10:54:57.675+0000","up_votes":2,"down_votes":0,"body":"der Passive gefällt mir :D","replies":[{"poster":"Heavenly Sir","date":"2015-02-05T12:00:37.460+0000","up_votes":1,"down_votes":0,"body":"Schön das dir sogar etwas an ihm gefällt ;)\nIch warte vergebens auf neue Kommentare :D","replies":[]}]},{"poster":"MyHawtTeets","date":"2015-02-05T10:45:21.859+0000","up_votes":2,"down_votes":0,"body":"*Pakt","replies":[{"poster":"Heavenly Sir","date":"2015-02-05T10:53:15.618+0000","up_votes":1,"down_votes":0,"body":"Thx ;)","replies":[]}]},{"poster":"LetMeSupportThat","date":"2015-02-05T23:12:38.038+0000","up_votes":2,"down_votes":1,"body":"Wow,\nFür mich als main support xD klingt das ... naja wie soll ich warten echt EPISCH!\nwobei ich an der geschichte ändern würde das er für die Königsfamilie von Demacia gedient hat xD\nsein gesammtes Skill-Kit find ich recht aus geglichen wobei ich meine das man die Amor Ratios auf der passive auf 6,7.5,8,10 machen sollte ich denke das wäre sonst zu Op :)\n\ndu kriegst von mir für den champ 9/10{{item:3024}} \n\nIch hoffe du kommst mit nochmehr champs wie diese ","replies":[{"poster":"Heavenly Sir","date":"2015-02-06T08:48:49.496+0000","up_votes":1,"down_votes":1,"body":"Huhu, danke ;)\n\nSchön das dir dieser Champ gefällt, deine Idee mit der Rütsung werde ich mir geleich genauer anschauen.","replies":[]}]},{"poster":"Raubhamster","date":"2015-02-05T18:24:11.615+0000","up_votes":1,"down_votes":0,"body":"Also allein dass es ein Butler ist gefällt mir sehr gut. Ich stelle mir das ziemlich komisch vor. :)\n\nP klingt ziemlich stark, gefällt mir aber.\nQ klingt etwas wie das Braum W mit einem zusätzlichen Effekt. Finde ich auch nicht schlecht.\nW kann ich nicht richtig einschätzen\nE Funktioniert das dann wie bei TF mit seinen 3 Karten? Da 2 der Fähigkeiten auf Teammates angewendet werden können, wie sucht man sich das aus?\n   Und nocheinmal zusätzlich zum Passiv noch mehr Armor?\nR Finde ich irgendwie unspektakulär.","replies":[{"poster":"Heavenly Sir","date":"2015-02-05T18:47:56.698+0000","up_votes":2,"down_votes":1,"body":"Ach, du hast hier her gefunden?\nSehr schön :D\n\nDie E ist wie bei TF, man muss in einem bestimmten Zeitraum auswählen was man nehmen möchte.\nDas die R dir nicht gefällt kann ich gut verstehen, da werde ich noch einmal nachdenken.\n\nDanke für dein Kommentar.","replies":[]}]},{"poster":"CaffeineOverdose","date":"2015-06-02T17:51:40.642+0000","up_votes":1,"down_votes":0,"body":"Ok, erstmal fände ich es ULTRA episch, wenn Sebastian reinkommen würde! Egal wie viel er kostet ,kaufen!!! Dann:\n\nDie Q finde ich persönlich ziemlich gut gelungen und man könnte es gut umsetzen!\n\nDie W ist auch gut gelungen, nur irgendwie würde ich machen, dass man selbst nicht schneller wird und dann vielleicht die Verlangsamung (etwas) hochschraubt\n\nAn der E kann ich persönlich nix ausetzen\n\nR ist gut, nur irgendwie sollte Sebastian noch n Effekt bekommen ka z.B. mehr schaden, schneller\n\nansonsten würde es dann wirklich noch n paar Auseinandersetzungen zwischen Riot und den Typen von Black Butler geben...\n\n\nAber ich wünsche mir insgeheim, dass er in die Liga reinkommt :D","replies":[{"poster":"Heavenly Sir","date":"2015-07-19T08:24:25.720+0000","up_votes":1,"down_votes":0,"body":"Ich entschuldige mich für meine späte Antwort :D\n\nSchön das du Black Butler kennst hähä :)\n\nAlso ich fände es einfach auch so cool, wenn im Spiel ein Butler sein Unwesen treibt.\n\nDanke für dein Kommentar, ich werde mir das ganze noch einmal anschauen ;)","replies":[]}]},{"poster":"Darquesse","date":"2015-04-07T12:10:06.992+0000","up_votes":1,"down_votes":0,"body":"lol das gäbe ziemlich copyright Probleme, ich nehme doch an, dass du die serie black butler alias kuroshitsuji kennst?! aber lustig wäre es.","replies":[]}]}