{"poster":"RyGaRz","date":"2016-06-03T11:46:51.902+0000","title":"Cerco team per pentaq,sono main mid d5(demotato da d3)","subforum":"Reclutamento","up_votes":2,"down_votes":1,"body":"chi fosse interessanto aggiungetemi in game,sono RyGaRz o scrivete qui sotto","replies":[{"poster":"EmptyHole","date":"2016-06-03T12:58:29.061+0000","up_votes":1,"down_votes":2,"body":"beh, direi che quando un diamante 3 ammette di aver bisogno di premade per vincere le partite in questa nuova coda dinamica, la frase se sei forte sali va a farsi benedire, silver 3 per sempre, gg, il fatto che sono stato oro 2 le scorse 2 stagioni non significa un cavolo.","replies":[{"poster":"Dr LouD","date":"2016-06-03T13:41:19.819+0000","up_votes":1,"down_votes":2,"body":"Si può sempre peggiorare, magari stai avendo un brutto periodo e stai giocando peggio di come giocavi prima, non è per forza colpa del sistema","replies":[{"poster":"EmptyHole","date":"2016-06-03T13:55:22.722+0000","up_votes":1,"down_votes":0,"body":"mi è stato detto che il mio modo di giocare non è peggiorato affatto, anzi","replies":[{"poster":"Dr LouD","date":"2016-06-03T14:17:28.741+0000","up_votes":2,"down_votes":1,"body":"Carta canta, se perdi più di quanto vinci costantemente, sei peggiorato, accettare la cosa è il primo passo per ritornare in forma\n\nEsperienza personale, ci sono passato giusto 1 mese e mezzo fa nella tua stessa situazione.","replies":[{"poster":"EmptyHole","date":"2016-06-03T18:15:06.718+0000","up_votes":1,"down_votes":0,"body":"credimi sono uno di quelli che quando sbaglia si tira gli schiaffi da solo, sono il primo ad autocriticarmi, poi ovvio è la mia opinione personale, ma la mia bravura è aumentata, non peggiorata.","replies":[{"poster":"Dr LouD","date":"2016-06-03T18:18:02.917+0000","up_votes":1,"down_votes":1,"body":"beh allora devi iniziare a tirarteli più forte questi schiaffi\n\nQuello che sto cercando di dirti è che se vedi che perdi tanto e non sali, DEVI fare autocritica e devi essere fermamente CONVINTO di essere scarso.\nSolo così puoi tornare ad essere al livello di prima, sia di skill che di elo.","replies":[{"poster":"EmptyHole","date":"2016-06-03T18:22:11.231+0000","up_votes":1,"down_votes":0,"body":"il fatto che ci sia molta, MOLTA gente che prima portava account da bronzo a plat in pochi game, e che adesso non ci riesca più, mi fa rimanere convinto del fatto che ora come ora la dynamic peggiori la situazione, e che poco c'entri la bravura, secondo me, adesso si tratta più di fortuna che di bravura, sempre parlando di persone che non sono SGRAVATAMENTE più forti della divisione in cui si trovano","replies":[{"poster":"Dr LouD","date":"2016-06-03T22:58:45.030+0000","up_votes":1,"down_votes":0,"body":"Bravura > Fortuna, ne ho vinti di game carriando praticamente da solo, non è affatto impossibile","replies":[{"poster":"EmptyHole","date":"2016-06-04T10:59:53.340+0000","up_votes":1,"down_votes":0,"body":"ti darei ragione, ma bravura > fortuna si applica solo dopo un certo elo, e se mi dici che non è vero sei un folle","replies":[{"poster":"Dr LouD","date":"2016-06-04T11:11:26.635+0000","up_votes":1,"down_votes":0,"body":"Perchè mai? Se sei forte sali tranquillamente, e questa cosa aumenta esponenzialmente più l'elo è basso","replies":[{"poster":"EmptyHole","date":"2016-06-04T12:46:30.373+0000","up_votes":1,"down_votes":0,"body":"ok","replies":[]}]}]}]}]}]}]}]}]}]}]}]}