{"poster":"DontFckWithMyAdc","date":"2015-07-31T19:53:36.204+0000","title":"Das Wort \"Carry\" verliert an Bedeutung !!!","subforum":"Champions & Gameplay","up_votes":1,"down_votes":4,"body":"Hallo, \r\n\r\nIch bin derzeitig Gold 4 (von Gold 1 gedroppt auf Grund von schlecht gespielt wie geflamt). Aufjedenfall f&auml;llt mir sehr stark auf sobald ich in einer Promo bin , bekomme ich direkt andere Teammates die nur am flamen sind oder irgendwelche alten picks auspacken ( was ansicht ja nicht schlimm ist, aber wenn sie dann feeden ticken die komplett aus). So jetzt zu meinem Titel Das Wort carry wird haupts&auml;chlich f&uuml;r die midlane (apcarry) und f&uuml;r die Botlane (Adcarry) genutzt. Klar z&auml;hlt man die anderen Positionen als carry position an nur nicht so stark wie die beiden genannten. Naja den jungle z&auml;hlt man zwar jz auch zu aber egal. Ich bin der Meinung das Riot dieses Jungler item (devourer) aus League rausnimmt weil durch dieses Item wurde das Wort carry zerst&ouml;rt mir als Support ist es sehr stark aufgefallen trotz. exhaust kriegt man von dem Jungler sehr hart ins Gesicht. Deswegen m&ouml;chte ich mal eure Meinung zu diesem Item h&ouml;ren.","replies":[{"poster":"Spaxa","date":"2015-07-31T21:27:25.954+0000","up_votes":1,"down_votes":0,"body":"War doch schon immer so? Die Carrys teiln halt normalerweise den Haupschaden im Teamfight aus während die anderen die Carrys beschützen oder Eröffnungen schaffen, gab aber auch schon immer die \"Assassinen\" Jungler und Top Laner wie Kennen, Fiora und Yi.\n\nIch finds eigentlich ganz ok, macht sogar Nocturne und Aatrox wieder ein Stück weit Spielbarer und ist auch nett für Vi. Counterjungle ist halt die Beste Antwort auf das Item und oft sind Jungler nicht in der Lage schnell genug die Stacks zu bekommen. Im Grunde kommt es mir nur bei Yi ein Stück weit zu stark vor. Problematischer find ich da eigentlich Runeglaive Ezreal. Zum Vergleich im letzten Match Ahri 44 000 und Ezreal 75 400 Schaden an Champions (dabei hat das Team mit Ahri gewonnen)^^","replies":[{"poster":"watashiwa chrisi","date":"2015-08-01T00:12:12.317+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Spaxa,realm=EUW,application-id=Wj1wcocU,discussion-id=tnf3EVkb,comment-id=0000,timestamp=2015-07-31T21:27:25.954+0000)\n>\n> War doch schon immer so? Die Carrys teiln halt normalerweise den Haupschaden im Teamfight aus während die anderen die Carrys beschützen oder Eröffnungen schaffen, gab aber auch schon immer die \"Assassinen\" Jungler und Top Laner wie Kennen, Fiora und Yi.\n> \n> Ich finds eigentlich ganz ok, macht sogar Nocturne und Aatrox wieder ein Stück weit Spielbarer und ist auch nett für Vi. Counterjungle ist halt die Beste Antwort auf das Item und oft sind Jungler nicht in der Lage schnell genug die Stacks zu bekommen. Im Grunde kommt es mir nur bei Yi ein Stück weit zu stark vor. Problematischer find ich da eigentlich Runeglaive Ezreal. Zum Vergleich im letzten Match Ahri 44 000 und Ezreal 75 400 Schaden an Champions (dabei hat das Team mit Ahri gewonnen)^^\n\nRunnenglave Ezrael funktioniert doch gar nicht mehr.","replies":[]}]},{"poster":"Avorox","date":"2015-08-01T01:26:43.084+0000","up_votes":3,"down_votes":4,"body":"Carry bedeutet soviel wie tragen, führen oder dabei haben. Beim AD Carry steht das \"Carry\" nur dafür dass er eben AD carried, also er auf ad spielt. Das hat nichts damit zu tun, dass er sein Team carried.","replies":[{"poster":"haha weed lol xd","date":"2015-08-01T11:45:00.369+0000","up_votes":3,"down_votes":1,"body":"falsch","replies":[]},{"poster":"Tokogawaruf","date":"2015-08-01T19:15:03.956+0000","up_votes":1,"down_votes":2,"body":"Also fälscher kann man das net ausdrucken. AD Carry heißt es weil er im Early schwach ist, also im Early gecarried werden muss (darum haben die doch seit Urzeiten Privatsupporter) und im Late Stark ist und dich und dein ganzes Team carried (oder könnte/sollte).\nCarry mich Early ich Carry dich Late\n{{champion:119}} {{summoner:6}}","replies":[{"poster":"OrangeBubble","date":"2015-08-03T08:58:43.524+0000","up_votes":1,"down_votes":0,"body":"http://www.dict.cc/englisch-deutsch/carry.html\n\nNja so ganz falsch kann es nu auch nicht sein :)\n\"Das Spiel carrien\" -> Das Team zum Sieg führen.","replies":[]}]}]},{"poster":"Ηastur","date":"2015-08-03T15:54:28.187+0000","up_votes":1,"down_votes":0,"body":"übersetz adc einfach mit attack damage champ und alles passt wieder. :P","replies":[]},{"poster":"FollowMeDown","date":"2015-08-02T01:19:19.806+0000","up_votes":1,"down_votes":0,"body":"Ich bin voll deiner Meinung zu diesem Item, da hat bestimmt wieder ein {{champion:245}}  seine dreckigen Finger im Spiel gehabt. Ich muss jedoch sagen, dass ich denke das dieses Item nur dazu da ist die Jungler mehr auf den Jungle zu Konzentrieren.. Wobei wenn sie es richtig anstellen nunja op sind .","replies":[]},{"poster":"CCG Juuzou","date":"2015-08-01T13:01:22.275+0000","up_votes":1,"down_votes":0,"body":"ADC's brauchen im Late halt peel wenn du keinen peel bekommst steht es schlecht wenn die Gegner wissen was sie tun :/","replies":[]},{"poster":"Schesam","date":"2015-08-01T02:08:15.879+0000","up_votes":1,"down_votes":0,"body":"Die \"Carrys\" sind im normalfall die backline bzw die. die den DMG raushaun. Der Rest sind die Tanks, die eben diese beschützen sollen, das sie überhaupt DMG machen können. Nur weil es während der Tank-Meta nur 2 Carrys und 3 Tanks gab (Selbst da gabs Bruiser, die man als Carry zählen kann..), muss es nicht heißen das es immer so bleibt. In der Assassinmeta davor wars ja auch nicht anders. Da war meist der ADC, der Midlaner und der Jungle/Toplaner DMG-Dealer.","replies":[]}]}