{"poster":"Play with traps","date":"2017-04-14T22:06:56.970+0000","title":"Ofertas de champs por pi?","subforum":"Charlas Generales","up_votes":2,"down_votes":2,"body":"Osea es una idea un tanto rara, pero algo que me molesta de lol es no poder comprarme champs hasta un buen tiempo. O almenos 1 a la semana {{champion:83}}  digo esto porque no tengo taaaaanto tiempo para jugar y no puedo farmear el pi de forma mas seguida que otros jugadores","replies":[{"poster":"Fortín de Villal","date":"2017-04-14T22:25:45.873+0000","up_votes":3,"down_votes":0,"body":"Sería una merma en el negocio tremenda. Como buena empresa que busca dinero el lema es: \"¿Querés acceder a nuestros productos más rápidamente? pague, estimado y benemérito usuario!","replies":[]},{"poster":"MatiasZERO","date":"2017-04-15T03:31:01.374+0000","up_votes":1,"down_votes":0,"body":"Riot quiere te mantengas pegado jugando. A ellos les viene bien que demores en comprar campeones.-","replies":[]},{"poster":"DESTRUCT0R123","date":"2017-04-14T23:10:48.888+0000","up_votes":1,"down_votes":0,"body":"Seria mucho mas facil comprarlos pero ..... Donde estaria la gracia de jugar para comprarlo ? Muchos juntarian pi y comprarian solo cuando esta en oferta , la gente jugaria menos, compras un campeon que quieres y tendrias poco tiempo de conocerlo por que al poco tiempo comprarias otro que quieres y asi","replies":[]},{"poster":"Yudel","date":"2017-04-14T22:11:00.777+0000","up_votes":1,"down_votes":0,"body":"me gustaria a mi tambien, sobretodo por que este año sera un año ocupado en mi vida pero bueno, no creo que riot este interesado, aunque no sabria el porque~~","replies":[]},{"poster":"Neo der spieler","date":"2017-04-14T22:51:30.506+0000","up_votes":1,"down_votes":2,"body":"yo cuando era estudiante farmeaba mucho pi ahora estoy trabajando y no tengo tanto tiempo libre para jugar pero no tengo problemas con el pi lo considero justo jugando 1 ves al dia son 200 pi a la semana 1400 y al mes 5600 con jugar un mes podes comprar cualquier campeón ;)\ny eso hablando de campeones caros hay baratos q estan rotos como {{champion:1}} {{champion:31}} {{champion:80}} {{champion:45}} {{champion:25}}","replies":[]}]}