{"poster":"REMOVE TENACITY","date":"2020-02-02T00:07:30.111+0000","title":"WHY IS TENACITY A THING?????","subforum":"Gameplay","up_votes":1,"down_votes":17,"body":"Shouldn't players be punished for overstepping??\nShouldn't champions who stun from fog of war or from fancy flash engages be rewarded with a combo followup?\nMany champions, ESPECIALLY control mages RELY on landing their crowd controls. We are in a season where some select champions can go well over 500 movespeed near permanently with one ability. It's already bad enough that it's 100x harder to land skillshots on them when they move that fast but the ONE or TWO times in the game you do finally land the crowd control, they still walk away because of {{item:3111}}  stacked with champion tenacity or rune tenacity.\n\nLike when I play Veigar I have to overstep into the enemies trade range when I catch them with my E wall. I win the trade normally because I can input my Q,W in sync with my stun duration.\n\nWhen people buy {{item:3111}} for a mere 1100g now suddenly when I catch an enemy with my wall, THEY are the ones moving freely when I'm about to followup with my Q,W combo and I get punished for THEM overstepping into my wall. This is not fucking fair. For 1100g you can pretty much delete my E. I basically only have Q,W, and R to land against someone who is already running permanently at 500+ movespeed.\n\nYou want to know what the crowd goes wild over? When someone gets caught and rightfully combo'd for it. {{item:3111}} rewards players WAY too well for only 1100g. It not only makes you 2-3 tiers higher at positioning EVEN THOUGH you get caught the same amount of times, but it also pretty much deletes any control mages ONE reliable crowd control.\n\n\nIs there even any Item I can buy to restore the duration of my Crowd Control? NOPE. I just have to play 2-3 tiers higher and hope my skillshots can 100 to 0 someone with {{item:3111}} . Or at this point can't even focus that player even though they may be an important target to take down in every fight.\n\nThat's the game we play. This is our current status. We have champions who have no escapes and 1 slow ability or 1 stun ability who just become 100% irrelevant the moment someone takes tenacity runes or buys {{item:3111}} . \n\nWhy do you guys bait players into falling in love with a champions lores and skins when that SAME champion becomes irrelevant the moment this item is bought??? There's literally no item that I can build to counter that. All anyone can say is \"well you shouldn't have been interested in that champion, just play someone else. It's too bad you invested months of practice into that one champion that looked really cool but yeah, you don't matter in this current Season and possibly the future seasons.\"\n\n\n\nSincerely, very frustrated and mentally burnt out {{champion:45}}  player from Season 1 who can't keep a single account because he tilts every time someone walks into Veigar Wall and leaves the stunned position BEFORE THE Q W COMBO CAN EVEN DROP...\n\n\n\n\nEdit: I hope CertainlyT ruins the game even more to the point you forum trolls jerking eachother off end up finding another game. ","replies":[{"poster":"Woodakoodashooda","date":"2020-02-02T00:47:54.144+0000","up_votes":6,"down_votes":0,"body":"Alright, I've read through the OP's posts and here is what their complaint boils down to in a nut shell.\n\n\"I one trick Veigar, get rid of tenacity so I can one trick Veigar better\"\n\nEdit: I suggest we stop posting to this topic. THe OP is an attention seeking troll as made apparent by their reply to every post","replies":[{"poster":"Kai Guy","date":"2020-02-02T02:44:26.514+0000","up_votes":2,"down_votes":0,"body":"Damm... You got 4 replys from the op for this.","replies":[{"poster":"Woodakoodashooda","date":"2020-02-02T02:52:23.613+0000","up_votes":3,"down_votes":0,"body":"{{sticker:slayer-pantheon-popcorn}}","replies":[]},{"poster":"REMOVE TENACITY","date":"2020-02-02T04:31:15.560+0000","up_votes":1,"down_votes":3,"body":"I'm glad you encourage him to be the asshole he is today. Good job Kai! Your parents are proud of you :^)","replies":[{"poster":"Kai Guy","date":"2020-02-02T06:50:00.253+0000","up_votes":1,"down_votes":0,"body":"Are you being serious here and desire to be treated in good faith? I can make the attempt for that if you want. \n\nBut take a step back and look at my perspective. Is that what your behavior suggests?\n\nLets make 2 possible options for if you want a conversation on the topic in good faith\nIf yes, Please understand that its required on your end to do the same.\nIf no, then Chills comment is just a statement reflecting truth rather then anything assholish.\n\nYour reply is 100% on you and will reflect your intent.","replies":[]}]},{"poster":"REMOVE TENACITY","date":"2020-02-02T04:24:28.922+0000","up_votes":1,"down_votes":3,"body":"haters gonna hate","replies":[]}]},{"poster":"REMOVE TENACITY","date":"2020-02-02T00:54:12.141+0000","up_votes":1,"down_votes":3,"body":"It would seem that way but think about all the champions into detail who get cucked for catching players out but the skill animations dont hit on time due to tenacity. {{champion:103}} {{champion:34}} {{champion:1}} {{champion:22}} {{champion:136}} {{champion:432}} {{champion:63}} {{champion:69}} {{champion:31}} {{champion:60}} {{champion:28}} {{champion:9}} {{champion:3}} {{champion:74}} {{champion:30}} {{champion:85}} {{champion:7}} {{champion:99}} {{champion:90}} {{champion:25}}  etc.. etc.. it's not a Veigar exclusive thing. Meanwhile you have {{champion:77}}  running laps around the entire map with {{item:3111}} and countless youtube videos of him being memed with Initial D eurobeat.","replies":[]},{"poster":"REMOVE TENACITY","date":"2020-02-02T01:36:09.596+0000","up_votes":1,"down_votes":4,"body":"Even if I replaced Veigar with let's say Annie or Lux or some other champion your response would've likely been \"Alright, I've read through the OP's posts and here is what their complaint boils down to in a nut shell. \"I play a champion, get rid of tenacity so I can play champion better\". Absolutely no feedback, just purely here for comedic appraisal through the misfortunes of others as a common trait found in society today.","replies":[]},{"poster":"REMOVE TENACITY","date":"2020-02-02T01:32:54.277+0000","up_votes":1,"down_votes":4,"body":"Also I really hate how dismissive this response is. You didn't bring any suggestion, you just came with insults like you do to every other post you browse.","replies":[]},{"poster":"REMOVE TENACITY","date":"2020-02-02T01:37:15.206+0000","up_votes":1,"down_votes":5,"body":"https://youtu.be/EnBdGTX3vZc this pretty much sums it up.","replies":[]}]},{"poster":"FeedKaylePlease","date":"2020-02-02T02:53:02.960+0000","up_votes":3,"down_votes":0,"body":"Oh wow. So we are complaining about this now?","replies":[{"poster":"REMOVE TENACITY","date":"2020-02-02T04:33:22.399+0000","up_votes":1,"down_votes":2,"body":"Rather than fixing half their champions they just let the forum trolls be dismissive and say \"just play a different champion\" that doesn't solve the problem it just hides it from view. This is the society we live in. We get shitty devs like CertainlyT making troll champions that end up 100% reworked because he doesn't know how to make shit.","replies":[{"poster":"FeedKaylePlease","date":"2020-02-02T18:50:16.527+0000","up_votes":1,"down_votes":0,"body":"Perhaps you should apply for a job at Riot and show them how it's done. You obviously know how to do a better job so I see no reason why they would not hire you.","replies":[]}]},{"poster":"REMOVE TENACITY","date":"2020-02-02T04:22:42.380+0000","up_votes":1,"down_votes":2,"body":"bro people getting rewarded for getting caught out...and you're ok with that?????","replies":[{"poster":"FeedKaylePlease","date":"2020-02-02T18:49:25.397+0000","up_votes":1,"down_votes":0,"body":"If anything tenacity needs to be buffed.","replies":[]}]}]},{"poster":"Humb1e Rumb1e","date":"2020-02-02T00:10:13.639+0000","up_votes":3,"down_votes":0,"body":"Shouldn't everything have counter option? Especially CC in meta where seconds are difference between life and death.","replies":[{"poster":"REMOVE TENACITY","date":"2020-02-02T00:11:21.016+0000","up_votes":1,"down_votes":2,"body":"What's the counter to tenacity though? Tenacity makes a large pool of champions dysfunctional the moment it's purchased. It's only 1100g.","replies":[{"poster":"Infernape","date":"2020-02-02T00:24:38.177+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=REMOVE TENACITY,realm=NA,application-id=3ErqAdtq,discussion-id=MzxYOATE,comment-id=00000000,timestamp=2020-02-02T00:11:21.016+0000)\n>\n> What's the counter to tenacity though? Tenacity makes a large pool of champions dysfunctional the moment it's purchased. It's only 1100g.\n\nChain CC.\n\nAnyway Tenacity isn't that great with the overabundance of knockups in the game. ","replies":[{"poster":"REMOVE TENACITY","date":"2020-02-02T00:59:49.668+0000","up_votes":1,"down_votes":2,"body":"That indirectly means \"Play another champion, you were wrong for ever being interested in Veigar to begin with\".","replies":[]}]},{"poster":"Woodakoodashooda","date":"2020-02-02T00:20:06.739+0000","up_votes":3,"down_votes":0,"body":"Tenacity does not affect displacement effects.\n\nKnock ups, knock backs, suppression, hooks, etc.\n\nAlso, not all champions benefit from it. Squishy assassins and ADCs generally do not build it because even a single moment of being stunned is a death sentence and they are better off building straight damage and waiting for the opportune moment to strike.","replies":[{"poster":"REMOVE TENACITY","date":"2020-02-02T00:58:06.143+0000","up_votes":1,"down_votes":2,"body":"I've had many games where Yasuo, Zed, or even Fizz will rush {{item:3111}}  because they know it completely removes Veigar's first 3 points of E from the game. Basically as Veigar you only have Q,W, and R at that point.","replies":[]}]},{"poster":"Humb1e Rumb1e","date":"2020-02-02T00:15:52.975+0000","up_votes":1,"down_votes":0,"body":">What's the counter to tenacity though? \n\nChampions that dont rely on hitting cc.","replies":[{"poster":"REMOVE TENACITY","date":"2020-02-02T00:19:13.729+0000","up_votes":1,"down_votes":3,"body":"That's where the problem is though. Everyone who invested time into learning a champion they found interesting gets thrown out the window.","replies":[{"poster":"Freewalker","date":"2020-02-02T00:24:17.015+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=REMOVE TENACITY,realm=NA,application-id=3ErqAdtq,discussion-id=MzxYOATE,comment-id=0000000000000000,timestamp=2020-02-02T00:19:13.729+0000)\n>\n> That's where the problem is though. Everyone who invested time into learning a champion they found interesting gets thrown out the window.\n\nLoL is a team game. If one player counterbuilds your champion, you need to work with a teammate to counter the counterbuild.","replies":[{"poster":"REMOVE TENACITY","date":"2020-02-02T00:56:52.964+0000","up_votes":1,"down_votes":2,"body":"How will my teammate counter tenacity?","replies":[]}]}]}]}]}]},{"poster":"Jbels","date":"2020-02-02T00:28:02.629+0000","up_votes":2,"down_votes":0,"body":"You're complaining that Tenacity shouldn't be a thing when it barely is a thing anymore. Oh hey, good thing tenacity doesn't affect knockups when Riot has added so much knock up to this game it feels like a whore house that doesn't care whether or not you use protection.","replies":[{"poster":"REMOVE TENACITY","date":"2020-02-02T00:56:16.531+0000","up_votes":1,"down_votes":3,"body":"It makes many champions dysfunctional the moment someone buys {{item:3111}}  for a mere 1100g...","replies":[{"poster":"Jbels","date":"2020-02-02T01:22:25.272+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=REMOVE TENACITY,realm=NA,application-id=3ErqAdtq,discussion-id=MzxYOATE,comment-id=00010000,timestamp=2020-02-02T00:56:16.531+0000)\n>\n> It makes many champions dysfunctional the moment someone buys {{item:3111}}  for a mere 1100g...\n\nNo it fucking doesn't. People die so quickly in League now that even tenacity doesn't save you from getting caught by the slightest of CCs. Get better at the game and stop complaining that the stat that is meant to counter CC but is piss poor at doing so is somehow bad for the game.","replies":[{"poster":"REMOVE TENACITY","date":"2020-02-02T01:29:21.270+0000","up_votes":1,"down_votes":3,"body":"There's not much left for me to get better at. I've pretty much soft-capped on Veigar over 10 years. The only thing I can change at this point is just playing a different champion like everyone suggests (which is really disappointing). Also if a basic combo takes 1 second and the stun duration is reduced to less than that then yes it makes the champion dysfunctional, their crowd control doesn't exist for a low low cost of 1100g. There's no item or rune in the game I can take to restore that duration. It's gone the moment that boot is purchased.","replies":[]}]}]}]},{"poster":"KFCeytron","date":"2020-02-02T00:40:30.507+0000","up_votes":2,"down_votes":0,"body":"If Tenacity were to be removed, all stuns/etc. would have their base duration lowered. They're balanced around opponents having some Tenacity in the same way that Mundo is balanced around having GW applied to him at all times.\n\nVeigar E at max rank stuns for 2.5 seconds. W hits after 1.25 seconds. Why are you waiting so long to follow up on your combo?","replies":[{"poster":"REMOVE TENACITY","date":"2020-02-02T00:55:27.040+0000","up_votes":1,"down_votes":2,"body":"Consider the time it takes to walk forward if you catch someone with wall and they're on the further end of it instead of the closer end. Sometimes players play so flawlessly that realistically they ONLY get caught on the further end of it and realistically that's the make or break window for Veigar in a lot of higher end games where those 1 or 2 opportunities don't really come by at any other moment.","replies":[]}]}]}