{"poster":"NnAaCcHhOo","date":"2017-02-17T17:05:17.236+0000","title":"Emparejamiento de LAS","subforum":"Off-topic y temas personales","up_votes":3,"down_votes":2,"body":"Gane 9/10 partidas para que me den una Liga y termine siendo Plata III y la season pasada era Plata II, no me importa mucho solo quiero un buen emparejamiento para poder subir de liga y me tocan con puros trolls o gente que no tendria que estar en la liga que esta porque no le encuentro una explicacion a que la gente de mi liga sea tan mala, arreglen el emparejamiento porfavor porque ya me esta cansando jugar todas las veces con gente asi, dejen de regalar ligas y pongan a la gente donde debe estar, no creo que me merezca ser plata III ganando 9/10","replies":[{"poster":"martincarp","date":"2017-02-17T17:07:36.856+0000","up_votes":1,"down_votes":0,"body":"Voy a tratar de sonar lo menos agresivo y denigrante posible:\n\n¿Eres consciente de que Plata es la segunda liga más baja en un sistema con 7 ligas, no?\n\nSinceramente no esperes nivel en el segundo peldaño más bajo, siento que das por sentado que Plata es una liga para personas con buen nivel, lo cual no es tan así.","replies":[{"poster":"NnAaCcHhOo","date":"2017-02-17T19:47:33.797+0000","up_votes":1,"down_votes":0,"body":"Noonono yo no dije eso, hasta platino hay gente mala, gente eloboosteada, gente q no se merece estar donde esta, solamente me quejo de los afks y trolls, ya se que plata es una liga baja pero con gente asi no podes subir no te dan ganas de jugar directamente, recien me toco uno q se quedo en base y farmeaba la jg afk y terminamos ganando un 4vs5 pero porque las otras personas eran amigos mios y saben jugar","replies":[]}]},{"poster":"FocsTincho","date":"2017-02-17T17:27:35.551+0000","up_votes":1,"down_votes":0,"body":"Si la season pasada terminaste en Plata II, no esperes que por haber ganado 9 partidas de 10 te manden directamente a diamante. Si tenes el nivel para subir de liga lo vas a hacer, los trolls y afk no son excusas, te pueden demorar un par de partidas a lo sumo pero si no subis te recomiendo que te empieces a fijar en lo que haces vos. Una ayuda util es que dsp de las partidas veas las estadisticas, daño que hiciste, etc, y antes de empezar otra partida te tomes unos min para pensar que hiciste mal en el juego y si perdiste, como podrias haber cambiado el rumbo de la partida. Saludos y suerte :)","replies":[]},{"poster":"Virolsky","date":"2017-02-17T17:16:59.756+0000","up_votes":1,"down_votes":0,"body":"tienes que seguir practicando en normales antes de rankear :D!","replies":[]},{"poster":"Americans","date":"2017-02-17T17:42:15.076+0000","up_votes":1,"down_votes":1,"body":"La gente en tu liga es mala porque estas en plata. Si queres mejor gente subi de liga. Alguien que este en silver es porque quiere estarlo. Si ya ganaste 9 de 10, gana otras 90 de 100 y vas a ser oro/platino.","replies":[]}]}