{"poster":"NiceHat","date":"2015-07-23T01:26:56.569+0000","title":"DC vs RQ = Punishment?","subforum":"Help & Support (OCE)","up_votes":1,"down_votes":0,"body":"Supporty people,\r\n\r\nI played an ARAM late last night, half way through the game my net died. It was around midnight, so I took it as a hint to go to bed. When I log in this morning, I get a warning about:\r\n\r\n&quot;Leaving something something, harms other players something, Do you agree?&quot; &quot;Apparently I agree&quot;.\r\n\r\nWhat are the repercussions of this, and why do I feel like I&#039;m being punished for something that is 100% out of my control?\r\n\r\nAs much as I&#039;d appreciate random peoples input (and thank you if you do), I&#039;m really looking for a Riot Mod/Employee something to comment so I understand where I stand with this. If I end up getting banned/suspended over a couple of ISP issues, that&#039;s just retarded.","replies":[{"poster":"NiceHat","date":"2015-07-23T11:36:49.312+0000","up_votes":1,"down_votes":0,"body":"Mindstar,\n\nDropping out isn't a regular issue for me, but having the alert pop up was a bit concerning.\n\nThanks for the timely response.","replies":[]},{"poster":"Mindstar","date":"2015-07-23T01:54:31.905+0000","up_votes":1,"down_votes":0,"body":"Hey NiceHat\n\nTL;DR - if it is just a once-off issue, you shouldn't have too much to worry about.\n\nLeaver detection and punishment has been tuned so that the occasional disconnect will not be a problem for you (but that screen will pop up to let you know anyway).  Everyone has the odd issue with their net connection and even the most solid internet links can go down from time to time.\n\nThat said, where you *would* need to be concerned is if you have consistent disconnects like this, which cause you to leave multiple games.  In that case, you would be picked up by the leaver system and placed into a low priority queue.  The other 9 players in that game would have had a poor experience because you left, and that is what the leaver detection systems are designed to help avoid.\n\nIt is also important to note that while your internet connection dropping out may seem like it is not your fault, it is still your responsibility to make sure you maintain a stable connection to League when you play.  If your net does drop out regularly, then that is something that you should be looking at trying to fix.  The best place to start there would be to go through some [troubleshooting](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues) and also talk to your ISP to see if there are things they can do to help stabilise things.\n\nLet me know if you have any questions!\n\nCheers\nMindstar","replies":[]}]}