{"poster":"Niggihi","date":"2015-09-13T04:01:25.024+0000","title":"Rito cuando el nerf???","subforum":"Charlas Generales","up_votes":15,"down_votes":5,"body":"estaba jugando tranquilo un aram cuando derrepente un {{champion:86}}  salvaje aparece (full tank) y me tira ulti \r\n\r\n\r\ndejo screenshots de la violacion... me pregunto si ya sabra rito sobre estos bukake que hacen estos champs\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nGG gente T.T","replies":[{"poster":"SET0  KAIBA","date":"2015-09-13T07:17:45.426+0000","up_votes":6,"down_votes":0,"body":"{{item:3072}}  con rengar y el {{champion:50}}  al menos que se arme mas ap como el {{item:3116}} tenias 3 ap y nadie se puso {{item:3151}}  contra los tanks","replies":[{"poster":"Il Bardolino","date":"2015-09-13T19:58:11.231+0000","up_votes":1,"down_votes":0,"body":"{{item:3072}} te la creo. {{item:3748}} sin tener items de vida es otra historia.","replies":[{"poster":"Whitesse","date":"2015-09-13T20:35:31.592+0000","up_votes":1,"down_votes":0,"body":"Sanguinaria con Rengar sin velocidad de ataque es pesimo. Hidra titanica aun mas.","replies":[]}]}]},{"poster":"Neoburstx","date":"2015-09-13T04:49:41.826+0000","up_votes":1,"down_votes":2,"body":"a mi una fioga me quito lo mismo xD","replies":[{"poster":"IHEI","date":"2015-09-13T04:57:09.095+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=Neoburstx,realm=LAS,application-id=v7qsfXsE,discussion-id=xtbEs2Yh,comment-id=0004,timestamp=2015-09-13T04:49:41.826+0000)\n>\n> a mi una fioga me quito lo mismo xD\n\npero al menos la fiora debe tener daño \nsi tu vez la build de garen no tiene ni daño","replies":[]},{"poster":"FurchiDC","date":"2015-09-13T11:02:51.972+0000","up_votes":1,"down_votes":0,"body":"Al menos Fiora es un flancito, la matas enseguida.","replies":[{"poster":"Nahejaz","date":"2015-09-13T15:53:32.875+0000","up_votes":1,"down_votes":0,"body":"Si no mata al mid/adc/support de 3 golpes y se cura toda la vida con el ulti entonces si, la matas enseguida.","replies":[{"poster":"Yozora","date":"2015-09-13T20:40:12.681+0000","up_votes":1,"down_votes":0,"body":"Concuerdo contigo T.T {{champion:114}}","replies":[]}]}]}]},{"poster":"LinusHendricus","date":"2015-09-13T12:47:20.829+0000","up_votes":3,"down_votes":0,"body":"A mi una vez un garen jugando ranked me pego 1687 de true damage, sí, es vdd, 1687 de true damage apretando la tecla R. Jugué j4 me metió un silencio de 2 segundos q me no dejó hacer nada, luego apreto R y casi me saca 2k de true damage, no entiendo cómo ese pj según RIOT está balanceado. Es cierto q en divisiones mayores (de platino 3 hacia arriba) garen no rinde mxo pq hay players q saben jugarle, pero me imagino lo q debe estar pasando en plata y oro, debe ser frustrante q un full tanky con 5k de hp se meta en la tf girando, te meta un silencio de 2 segs, luego aprete R y te mande a guardar 2k de true damage.","replies":[{"poster":"SW Qui Gon Jinn","date":"2015-09-14T17:54:46.253+0000","up_votes":1,"down_votes":0,"body":"Tu mentira para aportar algo sin sentido se ve claramente cuando decis que te metio un stun de 2 seg. cuando garen mete un stun de 1.5 en todos los niveles.","replies":[]}]},{"poster":"Rayxah","date":"2015-09-13T04:04:54.701+0000","up_votes":3,"down_votes":0,"body":"Garen en aram es casi imposible de matar. Más cuando estas llegando casi a late, que tiene un regen de más de 100 de HP por segundo xD...","replies":[]},{"poster":"Hexplosivo","date":"2015-09-13T16:15:10.522+0000","up_votes":1,"down_votes":4,"body":"La gente no es muy inteligente parece :/\n**La ulti de Garen no escala con su AD ni su AP, así que la build NO AFECTA EL DAÑO DE ESA HABILIDAD** simplemente es un valor fijo que aumenta con la vida que le falte a su enemigo, así que si te atrapa con poca vida siempre te va a sacar 10000 de daño. No sean atrapados con poca vida cuando son el villano, así de simple.","replies":[{"poster":"potato support","date":"2015-09-13T16:38:39.911+0000","up_votes":3,"down_votes":0,"body":"no hay counterplay, eso es a lo que vamos.  literalmente lo unico que podes hacer para hacer counter a garen siendo el villano es tener 6 warmogs.\n\ntan inteligente sos? ni podes ver eso.","replies":[{"poster":"ll Leoh ll","date":"2015-09-13T20:20:15.709+0000","up_votes":1,"down_votes":0,"body":"es al mas facil de hacerle counter de los  campeones op en estos parches por eso mismo no lo usan mucho en elo alto, pero si usan mucho fiora, darius, skarner,morde y todos los otros.","replies":[{"poster":"potato support","date":"2015-09-13T20:35:32.364+0000","up_votes":1,"down_votes":0,"body":"la mecanica de villano no tiene counterplay, te penaliza por ir bien.\n\n\nno se usa en elo alto porque no es un carry top y no tiene la misma utilidad que tienen los tops meta. *aunque esta este cambiando con nerfs que se le hicieron a algunos tops*, no te trae la utilidad que trae gnar/maokai/malphite, y no es un carry como riven/fizz (rip bruiser fizz)","replies":[]}]},{"poster":"Nozarkanoz","date":"2015-09-13T18:24:41.587+0000","up_votes":1,"down_votes":1,"body":"si,tiene counter te los dire:\nvayne: eres completamente CaC [cuerpo a cuerpo] y si la vayne es buena no te deja acercarte y al final terminara  muriendo por desgaste ya que ella también tiene daño verdadero. [basado en una partida que jugue con garen]\nentre otros como lux, ahiri,jayce ect.\npero tiene pocos counter comparados a otros D:","replies":[{"poster":"potato support","date":"2015-09-13T19:48:04.590+0000","up_votes":1,"down_votes":0,"body":"vayne le entras flash q>e>r y ya murio.\n\nvayne, lux, ahri, jayce son completemaente dependientes de sus habilidades, se comen una q y murieron porque no pueden usar  sus habilidades porque se comieron un silence. (y nisiquiera con 3+ rotaciones de habilidad no matas a un garen en late) eso no es counterplay.\n\nes lo mismo que pensar que morgana hace counter a todo porque tiene black shield que niega todo tipo de cc.","replies":[]},{"poster":"Excandésco","date":"2015-09-13T18:27:48.387+0000","up_votes":1,"down_votes":0,"body":"Gnar tmb es un buen counter.\nBah a mi me joden mucho los gnars en top. Y en late no decae, puede ser un buen tank para su team, diria que es hasta mejor que vayne de alguna forma.","replies":[{"poster":"Nozarkanoz","date":"2015-09-13T18:31:34.010+0000","up_votes":1,"down_votes":0,"body":"Es que en su pasiva tiene la ulti de nasus o renekton  aunque mas debil obviamente o estaría literalmente roto","replies":[{"poster":"Excandésco","date":"2015-09-13T18:38:04.819+0000","up_votes":1,"down_votes":0,"body":"No me refiero a su pasiva, si no al harass a distancia que te puede hacer , mas el facil quiteo que tiene saltando para cualquier lado.\n\nLa unica diferencia es que el late puede ser una buena front lane y stun en masa. Vayne por otro lado en late va a ser otro adc mas, facil de deletear.\n\nSi en una ranked game pickeas vayne top solo para hacerle counter a garen, creeme que vas a perder la partida. A menos que halla un morde en tu linea bot, para balancear un poco.","replies":[{"poster":"Nozarkanoz","date":"2015-09-13T18:44:12.034+0000","up_votes":1,"down_votes":0,"body":"mordekaiser es genial.\n¿cierto?\nyo lo use y en una partida repito por pura suerte me logre hacer 2 pentas en una sola partida aunque fue suerte nada mas.\nes un buen adc.","replies":[]}]}]}]}]}]}]},{"poster":"FurchiDC","date":"2015-09-13T11:05:33.642+0000","up_votes":2,"down_votes":0,"body":"Entre ayer y hoy jugué más de 50 ARAM para el evento de PI. Más de la mitad de las veces me tocó un Garen, y siempre que hubo un Garen en un equipo, ese equipo ganó. ¿Coincidencia?\nLos Garen se hacen 1v5 tranqui y sobreviven por rato largo. Obvio se lleva a 2 o 3 antes de morir.","replies":[]},{"poster":"5474N45","date":"2015-09-13T04:05:23.414+0000","up_votes":3,"down_votes":18,"body":"deja de llorar ya si no lo sabes ocupar eso no pasaria yo e jugado contra garen bastante buenos es un gg pero tambien sales otros q nose como no le dan los dedos y no es la gran cosa","replies":[{"poster":"Rayxah","date":"2015-09-13T05:58:39.688+0000","up_votes":1,"down_votes":0,"body":"¿Existe tal cosa como gente mala con Garen? Dios mio esas personas entonces no deberían ni poder jugar al dominó ._. .","replies":[{"poster":"Revolución","date":"2015-09-13T09:30:00.771+0000","up_votes":2,"down_votes":0,"body":"No, no existe. Recién se me ocurrió comprar y probar a Riven y un Garen unranked con 150 normales ganadas y 70 menos de farm me mató re tranqui como si me sacara 5 niveles. Soy manco con Riven, era mi primera vez, pero igual...","replies":[{"poster":"Ahristócrata","date":"2015-09-14T01:08:29.500+0000","up_votes":1,"down_votes":0,"body":"No te creas que no existen. He visto jugadores de Garen que tiran la ulti a la mitad de vida o incluso al principio de la vida(Este último un amigo mío)!","replies":[]},{"poster":"Rayxah","date":"2015-09-13T09:36:02.295+0000","up_votes":1,"down_votes":0,"body":"Yo también soy bastante manco con Riven, pero igual entiendo lo que decís XD. Hay gayrens que te agarran y te deshuesan solo porque está roto ahora, van full tanque con daño verdadero... GG XD.","replies":[]},{"poster":"FurchiDC","date":"2015-09-13T11:03:44.833+0000","up_votes":1,"down_votes":0,"body":"Soy otro que manquea con Riven y me ha tocado con Garens muy malos a los que le gané la línea xD. Pero en un trade te revienta si no usas ulti.","replies":[]}]}]}]},{"poster":"Samtrok","date":"2015-09-13T04:46:36.699+0000","up_votes":3,"down_votes":1,"body":"y shyvana? es otra mierda rota, no puede deletear sin necesidad de ulti solo con 2 item ofensivos","replies":[{"poster":"Il Bardolino","date":"2015-09-13T19:58:41.775+0000","up_votes":1,"down_votes":0,"body":"Shyvana, rota?\n\nEn que parche estamos?","replies":[]}]},{"poster":"Zexceed","date":"2015-09-13T05:13:19.935+0000","up_votes":3,"down_votes":2,"body":"si riot un nerf pls","replies":[]},{"poster":"BatPac","date":"2015-09-13T19:37:48.841+0000","up_votes":2,"down_votes":1,"body":"¿Conclusión?: Garen free elo, este campeón esta demasiado roto y aguanta mucho","replies":[]},{"poster":"Whitesse","date":"2015-09-13T06:41:12.726+0000","up_votes":4,"down_votes":5,"body":"1) No sabes jugar. Por tu build con Rengar lo digo.\n2) El rework de Garen se hizo para que Garen en late o en Team fight tenga una funcionalidad y no solo girar entre medio de todos. Si la pasiva \"Villano\" de su Ultimate esta sobre ti.. Que haces tradeandole o ignorando a Garen ?\n3) Si no sabes jugar contra otros campeones no pidan Nerf.","replies":[{"poster":"FurchiDC","date":"2015-09-13T11:02:15.105+0000","up_votes":2,"down_votes":0,"body":"Su funcionalidad como tanque debería ser entrar, recibir daño y morir si es necesario MIENTRAS LOS ASESINOS, ADC, MAGOS y FIGHTERS HACEN EL DAÑO. No él, él no debe hacer daño.","replies":[{"poster":"Nozarkanoz","date":"2015-09-13T18:34:08.181+0000","up_votes":0,"down_votes":0,"body":"¿Entonces nasus esta roto igual? :C","replies":[{"poster":"potato support","date":"2015-09-13T20:02:33.294+0000","up_votes":1,"down_votes":0,"body":"nasus tiene que stackear, un nasus que no tiene stacks es igual a un minion.","replies":[{"poster":"Nozarkanoz","date":"2015-09-14T23:49:26.643+0000","up_votes":1,"down_votes":0,"body":"ty","replies":[]}]}]},{"poster":"Whitesse","date":"2015-09-13T20:38:18.842+0000","up_votes":1,"down_votes":0,"body":"Acerca de mi punto 2, el como \"asesino\" porque su build es cualquier cosa, que hace tradeandole al tanque con la pasiva de villano en el ?\nLos objetivos de Rengar en esa partida ya estaban muertos, es decir, seguiste tradeando contra el Garen o lo ignoraste por completo comiendote todo el daño. Eso, es mi punto 1.\n\nPunto 3, eso.","replies":[]}]}]},{"poster":"Hong Meiling","date":"2015-09-14T01:02:27.818+0000","up_votes":1,"down_votes":0,"body":"Yo dejo esto por acá.","replies":[{"poster":"Rez","date":"2015-09-14T14:46:34.506+0000","up_votes":1,"down_votes":0,"body":"Kha :v","replies":[]}]},{"poster":"panther189","date":"2015-09-14T03:18:55.035+0000","up_votes":1,"down_votes":0,"body":"Siempre estuvo roto garen en aram mas ahora, su pasiva mas warmog entra y sale cuando quiere.","replies":[]},{"poster":"josuke","date":"2015-09-14T02:08:39.158+0000","up_votes":1,"down_votes":0,"body":"yo propondría un nerf asi.\n\nE: giros con mas velocidad (eliminados)\npasiva de la ulti: solo aplique a los campeones en racha.\nR: mas enfriamiento.\nW: menos armadura y resistencia magica.","replies":[]},{"poster":"oh95","date":"2015-09-14T02:00:23.775+0000","up_votes":1,"down_votes":0,"body":"Me parece que la gente no sabe que por mas que tengas 30 de vida, el daño que va a aparecer es el total, ya sea 100, 1000, 10000. Estas quejas de Garen me hacen acordar a las quejas sobre Cho Gath, bueno, igual supuestamente le viene un nerf a la mecánica del villano, que si matas a Garen no te cuenta como villano o algo así, en 2 días lo sabremos si viene o no el cambio.","replies":[]},{"poster":"kiuhm","date":"2015-09-14T01:16:45.595+0000","up_votes":1,"down_votes":0,"body":"pero esto va en poringa papu, D:","replies":[]},{"poster":"Nozarkanoz","date":"2015-09-13T18:06:17.472+0000","up_votes":1,"down_votes":1,"body":"Este bronce solo tiene algo que decir {{champion:86}} es un cazador de fedeados acostúmbrate :/\nAunque en aram esta mas roto de costumbre recuerda su pasiva.","replies":[{"poster":"Nozarkanoz","date":"2015-09-13T18:11:29.652+0000","up_votes":2,"down_votes":2,"body":"P.D.T: Solo intenten repartirse las kill así todos estarán fedeados pues el de nada sirve un ejercito de un solo hombre en este caso era katarina.\n[Me da risa leer: pliz nerf garen op y al lado aparece una {{champion:55}} 27/14 ¿que irónico?]","replies":[{"poster":"Rayxah","date":"2015-09-13T22:49:59.414+0000","up_votes":1,"down_votes":0,"body":"{{summoner:3}} y chau Katarina.","replies":[]}]}]},{"poster":"Yozora","date":"2015-09-13T20:49:47.963+0000","up_votes":1,"down_votes":0,"body":"Te digo algo: yo jugué con Garen una baaaanda de tiempo (era medio lento TT), y se que su ulti no se incrementa con el AD ni el AP, (como dijo Hexplosivo) es una cifra de daño que aumenta conforme más vida te falte, o sea, si te queda 20 o 30 % de vida es muy probable que Garen te ultee y mate sin piedad, ya que llega un momento en que él se hace muy dependiente de su R, porque al acercarse a otros era muy vulnerable. Por eso le pusieron el daño adicional al villano y todo eso, para que no muera tanto como antes. :D En fin, que el chico de Demacia nunca te agarre con baja vida, o si no te vas a agarrar unos enojos increibles. Saludos!!!!\n{{champion:86}}","replies":[]},{"poster":"Fruna","date":"2015-09-13T17:02:07.471+0000","up_votes":1,"down_votes":0,"body":"1450 apenas? yo le metí cerca de 2200 de true dmg a un Darius en teamfight xddd","replies":[]}]}