{"poster":"Veltox","date":"2016-07-26T12:41:06.457+0000","title":"We need a  tank item that reduces %damage taken","subforum":"Gameplay","up_votes":109,"down_votes":38,"body":"cuz it&#039;s too damn much in the game already..riot only thinks about avoiding squishy champions to be blown up by instakill kits like {{champion:107}} (or at least he used to)but what counterplay you have as a tank when everyone and their cat can destroy u with just {{item:3036}} {{item:3142}} not counting champions like {{champion:114}}","replies":[{"poster":"Skelenth","date":"2016-07-26T12:46:15.328+0000","up_votes":45,"down_votes":4,"body":"As long as it doesn't have any offensive component, so it doesn't get abused by carries.\n_cough {{item:3053}}{{item:3742}} cough_","replies":[{"poster":"Veltox","date":"2016-07-26T12:50:32.692+0000","up_votes":25,"down_votes":0,"body":"agreed.","replies":[]},{"poster":"elon wątroba","date":"2016-07-26T19:31:58.565+0000","up_votes":6,"down_votes":2,"body":"How dmp was abusied by carries? On hit isn't working on ranged champions.","replies":[]}]},{"poster":"Lugg","date":"2016-07-26T14:22:00.631+0000","up_votes":2,"down_votes":33,"body":"They just need to up the amount of health on items like {{item:3083}} {{item:3143}} {{item:3742}} etc\n\nThis would give tanks the little extra buffer they need against those champs.\n\nEDIT: The amount of stupid in the replies I'm getting is honestly astounding.  They think EVERY attack by Vayne is % health damage. IT ISN\"T. 2/3 of her attacks are normal auto attacks. More health means it takes her longer to kill you. It's not rocket science people. If it takes someone longer to kill you, the better your chance of winning the fight. ","replies":[{"poster":"DarkSunSovereign","date":"2016-07-26T14:28:43.417+0000","up_votes":48,"down_votes":2,"body":"%HP damage is too strong! Let's give people more HP! \n.\n.\n.\n.\n.\nLike, really?","replies":[{"poster":"Lugg","date":"2016-07-26T14:55:05.070+0000","up_votes":2,"down_votes":23,"body":"Yeah, they will be doing more damage, but you will have more health overall and be harder to take down. \n\nLet's say you have 1k extra health with this change and a total health of 3k facing a Vayne. Her max rank bolts do 12% max health true damage. So with each hit she would be doing 60 health This will cause her to do 360 per silver bolt attack. So you would negate almost 3 of those attacks which would keep you alive a couple more seconds. \n\nWhile a couple seconds doesn't sound long, it really is pretty long in a teamfight and could easily swing the fight in your favor. Hopefully I explained it good enough to make sense.","replies":[{"poster":"Ralanr","date":"2016-07-26T14:59:49.635+0000","up_votes":34,"down_votes":3,"body":"I really don't think any amount of health really slows down how quickly Vayne can kill you.","replies":[{"poster":"a friendly man","date":"2016-07-26T15:48:36.902+0000","up_votes":1,"down_votes":0,"body":"Although vayne can get strong as heck late game with items, a little CC can stop her dead in her tracks. And I beleive that is where skill and mechanics come into play. Yeah a vayne vs a team who has no idea how to be sitautional in a team fight is  OP. But a vayne vs equally skilled players can be shut down.","replies":[{"poster":"Spacesuit Spiff","date":"2016-07-26T15:55:01.640+0000","up_votes":17,"down_votes":0,"body":"The counterplay to lategame vayne is basically \"everyone dogpiles on her\". As a nautilus main i cant say i mind","replies":[{"poster":"Ralanr","date":"2016-07-26T16:05:53.703+0000","up_votes":10,"down_votes":0,"body":"Gotta love seeing Naut ult follow her.","replies":[{"poster":"Auz the Ripper","date":"2016-07-26T18:00:55.795+0000","up_votes":8,"down_votes":0,"body":"\"Dodge _This_\"","replies":[]}]}]}]},{"poster":"Spaceman5pff","date":"2016-07-26T22:12:55.585+0000","up_votes":2,"down_votes":1,"body":"Even thought she has %HP true damage, armor and HP can still very much help stop her.\nHer Q Bonus dmg and her auto attacks still do flat physical damage.","replies":[{"poster":"Ralanr","date":"2016-07-26T22:13:38.926+0000","up_votes":5,"down_votes":0,"body":"  9 Procs.","replies":[{"poster":"Spaceman5pff","date":"2016-07-26T22:20:02.193+0000","up_votes":4,"down_votes":0,"body":"Yes, but she will STILL kill a squishy faster than a tank, %HP true damage aside.\n\nCounters to vayne:\n- Attack Speed slows (Frozen Heart, Randuins are great ones) {{summoner:3}} \n- Crowd Control (although this is like a universal counter to damage)\n- Shields (yeah they kinda take some damage for you and don't count as max HP)\n\n\nOn a side note, while this has nothing to do with vayne counters but rather an interesting interaction with vayne: I was once playing {{champion:101}} and a vayne pulled up on me and i went to throw my stun just as she shot her condemn. Fortunately the condemn missed. This, however, fucked vayne over because her condemn increased the travel distance of my mid-cast stun, thus stunning her for much longer than it would have (I had been at 1x-2x melee distance at cast start) and this allowed enough time for me to cast q AND w, resulting in me killing her when i otherwise would have died very quickly (was retreating from a roam with ~1/4 hp). Had she not condemned at all, she would have easily killed me.\nSo I guess we can take away that, at least at shitter ELO i play at, sometimes the biggest vayne counter is the vayne player themselves.","replies":[]}]}]}]},{"poster":"LankPants","date":"2016-07-26T15:03:59.882+0000","up_votes":12,"down_votes":0,"body":">Her max rank bolts do 12% max health true damage.\n\nThis is the important part of this statement. Silver Bolts kills a target with infinite armour in 9 procs, regardless of their HP. HP is the least effective stat you can build into Vayne because it does absolutely nothing VS her Silver Bolts once you get past 1k HP.\n\nRands and Frozen Heart are the most effective anti-Vayne items as they simply increase the time for her to proc Silver Bolts but they generally don't feel like enough.","replies":[{"poster":"Veltox","date":"2016-07-26T15:08:13.585+0000","up_votes":7,"down_votes":0,"body":"+5% on frozen heart can be a welcomed buff imo but it can make kog suffer much more than vayne :/","replies":[]}]}]}]}]},{"poster":"MisterShameless","date":"2016-07-26T15:12:40.892+0000","up_votes":8,"down_votes":3,"body":"If it can counter true damage as well, I'll be pretty happy against Vaynes and Fioras.","replies":[{"poster":"Anidan","date":"2016-07-26T16:23:11.200+0000","up_votes":26,"down_votes":0,"body":"It won't. That would defeat the purpose of true damage.","replies":[{"poster":"Veltox","date":"2016-07-26T18:56:23.441+0000","up_votes":10,"down_votes":4,"body":"then what is the purpose of tanks when they die in like 3 or 2 seconds in a teamfight before being able to do anything.{{sticker:slayer-jinx-unamused}}","replies":[{"poster":"Bladerunner7777","date":"2016-07-26T22:29:12.383+0000","up_votes":2,"down_votes":4,"body":"git gud\n\nLeague of legends isn't just numbers, there's more to the game than itemization: Counterplay, which is something Riot has been basically forcing on every new champion and champion rework.\n\nThat doesn't mean every new champion is balanced (far from it usually), ultimately Riot wants all of their new champs/reworks to be fair, they're not retarded. Players like you are the ones that complain about stat-checks like Pantheon early game or fed Akali, so they're doing what everyone always begs for and releases these \"mini game\" champs. \n\nIf you don't want to play the \"mini game\" and you don't like \"stat checks\" then don't play the game. Most of the recent % max health new champs/reworks are tied to minigames already.\n\nThe only % max health that I think is dumb is Garen's, which literally punishes you for being good","replies":[{"poster":"Veltox","date":"2016-07-27T00:04:19.817+0000","up_votes":1,"down_votes":0,"body":"That is panth niche and i never complained about it specialy with the e nerfs and a feed assassin deserves to blow you up because he earned his right to do so.i also agree with the games but as long is not obnoxious and you can react to it.{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Bladerunner7777","date":"2016-07-27T00:40:33.080+0000","up_votes":1,"down_votes":0,"body":"Pantheon is actually balanced because although he is frustrating early, he does have a noticeable fall-off\n\n(secretly, I hardly notice his drop-off but every says he does so it has to be true. I don't understand how a large AoE 500-1000 magic damage _bomb_ is bad lategame but we'll keep it secret)\n\nI wasn't exempting myself from the \"stat-check\" champions, I still think Akali is painful to play from behind and painful to play against when she's ahead, can't wait for a mini-rework","replies":[{"poster":"Veltox","date":"2016-07-27T01:04:52.700+0000","up_votes":2,"down_votes":0,"body":"to be fair is significantly harder to use late because of how predictable it can be because u mainly use it for roams,enter a fight,flank,get back to lane and a very situational escape.","replies":[]}]}]}]}]}]}]},{"poster":"BloodyTompon","date":"2016-07-26T13:50:42.969+0000","up_votes":16,"down_votes":4,"body":"You do by any other name. MR and Armour do that. Then there are tabi, frozen heart and randuins.","replies":[{"poster":"Sona x Rubick","date":"2016-07-26T14:25:34.891+0000","up_votes":4,"down_votes":5,"body":"mr and armour are countered by penetration tbh.\n\nninja tabi and randuin are too situational.","replies":[{"poster":"flibitydoo","date":"2016-07-26T21:47:16.532+0000","up_votes":7,"down_votes":1,"body":"\"ninja tabi is too situational\"\n\nyeah I'm getting real tired of those carries who 100-0 me as a tank without actually auto attacking","replies":[]}]}]},{"poster":"TotalJerk","date":"2016-07-26T22:03:07.838+0000","up_votes":10,"down_votes":0,"body":">reduces %damage taken\n\nThis is literally exactly how resistances work.","replies":[]},{"poster":"Ulriah","date":"2016-07-26T15:39:14.952+0000","up_votes":10,"down_votes":0,"body":"Since when is Ghostblade an anti-tank item?","replies":[{"poster":"invisiblecat1","date":"2016-07-26T17:57:13.446+0000","up_votes":1,"down_votes":11,"body":"It has armor pen","replies":[{"poster":"Ulriah","date":"2016-07-26T18:42:46.859+0000","up_votes":9,"down_votes":0,"body":"It's **flat** armour pen, which means it's only effective against targets with low armour, aka squishies, not tanks.","replies":[]}]}]},{"poster":"Annoxis","date":"2016-07-26T14:04:12.527+0000","up_votes":2,"down_votes":1,"body":"The problem is that that kind of item will benefit to squishies more than to tanks, because of the way armor works in League of Legends.","replies":[{"poster":"Veltox","date":"2016-07-26T14:57:25.111+0000","up_votes":5,"down_votes":0,"body":"something similar with {{item:3083}} maybe? like being gated to use at an X amount of mr/armor","replies":[{"poster":"Ralanr","date":"2016-07-26T15:10:36.502+0000","up_votes":2,"down_votes":0,"body":"I don't know why they don't just do that for most tank/juggernaut items. Maybe to prevent a mid-late game power spike?","replies":[{"poster":"Veltox","date":"2016-07-26T15:14:33.694+0000","up_votes":7,"down_votes":1,"body":"for the same reason they don't make {{item:3053}} and{{item:3071}}melee only so it stops getting abused by adc's and nerfed..IDK","replies":[{"poster":"Ralanr","date":"2016-07-26T15:16:32.534+0000","up_votes":3,"down_votes":1,"body":"Honestly what is there about Steraks gage that justifies making it melee only beyond is being supposed to be built by juggernauts?","replies":[{"poster":"Veltox","date":"2016-07-26T15:18:58.634+0000","up_votes":7,"down_votes":1,"body":"giving a class that is supposed to be vulnerable bruiser level of tankiness.","replies":[]},{"poster":"Ryzing2Diamond","date":"2016-07-26T23:00:47.252+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ralanr,realm=NA,application-id=3ErqAdtq,discussion-id=XJ6izFhH,comment-id=00080000000000000000,timestamp=2016-07-26T15:16:32.534+0000)\n>\n> Honestly what is there about Steraks gage that justifies making it melee only beyond is being supposed to be built by juggernauts?\n\nThe fact that it makes an ADC able to survive 1000 true damage while on 500 HP?","replies":[{"poster":"Ralanr","date":"2016-07-26T23:02:05.463+0000","up_votes":1,"down_votes":0,"body":"Stat. Wise. \n\nLike how you can code it to be melee only with justification. Like why hydra is melee only and hurricane is ranged only.","replies":[{"poster":"Ryzing2Diamond","date":"2016-07-26T23:04:39.805+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Ralanr,realm=NA,application-id=3ErqAdtq,discussion-id=XJ6izFhH,comment-id=0008000000000000000000010000,timestamp=2016-07-26T23:02:05.463+0000)\n>\n> Stat. Wise. \n> \n> Like how you can code it to be melee only with justification. Like why hydra is melee only and hurricane is ranged only.\n\nSteraks is fine to have on assassins, but at the moment it literally gives ranged champions too much survivability. It's almost so good that AP carries are building it, and then we have a guinsoos rageblade situation again.","replies":[{"poster":"Ralanr","date":"2016-07-26T23:25:22.517+0000","up_votes":3,"down_votes":0,"body":"...that has nothing to do with what I'm saying.","replies":[]}]}]}]}]}]}]}]}]},{"poster":"Mecha Incognito","date":"2016-07-26T16:58:05.233+0000","up_votes":2,"down_votes":0,"body":"The problem with that is % health damage is there to help guarantee that the champion is outputting some reliable damage and not becoming obsolete at a certain point in the game.\n\nI'd like for resistances to mean a bit more personally. But they'd need to change the scaling of it so that it starts slightly weaker than now, but doesn't diminish quite as much, for example:\n\nSay 30 armor currently is 24%, and 200 armor is a 60% damage reduction. (random numbers)\nChange it to (again, random numbers)\n30 armor equalling 22%, and 200 armor equalling 65% damage reduction.\n\nThe point being that champions that do stack armor wouldn't feel as obsolete once there's an LW variant out, whilst making sure that those buying one armor item wouldn't now be tankier than before, so that carries don't run rampant building tankier (lookin at you,{{champion:104}} )\n\nOr Riot could just lower damage across the board slightly and make items not as effective for  damage and tankiness and utility at the same time, So that people might have to actually commit to one or the other.","replies":[{"poster":"ClatoVerataNicto","date":"2016-07-26T17:14:08.462+0000","up_votes":4,"down_votes":0,"body":"Resistances don't actually diminish in the way you probably think. Every 1 point of armor or magic resist increases your effective HP by 1% against it's respective damage source.\n\nExample: Champion with 1000 hp and 0 armor requires 1000 attack damage to kill.\nChampion with 1000 hp and 100 armor requires 2000 attack damage to kill.\nChampion with 1000 hp and 200 armor requires 3000 attack damage to kill.\n\nThis is all assuming no pen or regen.","replies":[]}]},{"poster":"Moesnd","date":"2016-07-26T14:59:31.418+0000","up_votes":1,"down_votes":0,"body":"Alistar\n\nEdit: oh an item","replies":[{"poster":"Veltox","date":"2016-07-26T15:05:14.615+0000","up_votes":4,"down_votes":0,"body":"even alistar can die fairly easy while in ult nowadays .-.","replies":[]}]},{"poster":"LankPants","date":"2016-07-26T13:39:37.105+0000","up_votes":4,"down_votes":4,"body":"The problem with this is that Vayne and Fiora are the two big offenders when it comes to %damage, generally other champs with %damage are good against tanks but lack the insane tank destruction of these two champs as tanks can counterbuild with armour or MR. Because these champs deal true damage any damage reduction is rendered ineffective against them.\n\nWhat is actually needed IMO is a true damage counter outside of just raw HP. Just an item with a passive something like \"converts 10% of physical and magic damage into a shield which blocks incoming true damage\". This would give tanks an item to build into Fiora and Vayne which their kits don't just allow them to ignore.","replies":[{"poster":"Veltox","date":"2016-07-26T14:53:15.458+0000","up_votes":2,"down_votes":1,"body":"i would say 15% considering the amount of %damage they can pull off","replies":[{"poster":"LankPants","date":"2016-07-26T14:57:20.517+0000","up_votes":4,"down_votes":0,"body":"You have to balance around other cases too. If you set values too high then champs like Cho'gath and Olaf who rely on burst true damage would wind up suffering in a lot of cases. I also think the shield cap should be fairly low, probably around 20+10 per level so it would be a strong item vs sustained true damage without shutting out burst true damage.","replies":[]}]},{"poster":"UnboundCreator","date":"2016-07-27T02:22:03.474+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=LankPants,realm=OCE,application-id=3ErqAdtq,discussion-id=XJ6izFhH,comment-id=0005,timestamp=2016-07-26T13:39:37.105+0000)\n>\n> The problem with this is that Vayne and Fiora are the two big offenders when it comes to %damage, generally other champs with %damage are good against tanks but lack the insane tank destruction of these two champs as tanks can counterbuild with armour or MR. Because these champs deal true damage any damage reduction is rendered ineffective against them.\n> \n> What is actually needed IMO is a true damage counter outside of just raw HP. Just an item with a passive something like &quot;converts 10% of physical and magic damage into a shield which blocks incoming true damage&quot;. This would give tanks an item to build into Fiora and Vayne which their kits don&#x27;t just allow them to ignore.\n\nYou do realize it's called true damage because it can't be reduced...","replies":[{"poster":"LankPants","date":"2016-07-27T02:48:10.171+0000","up_votes":1,"down_votes":0,"body":"There's a difference between reducing and absorbing. If you drop a Janna shield on somebody it will absorb true damage, it's different to reducing the damage, it's effectively giving you HP to tank it with.\n\nI'm going to be honest here, I generally don't think true damage is a huge problem, I have no problem with characters like Cho'gath, Irelia, Olaf and Darius dealing true damage, all of these cases are fine because tanks can mitigate their damage by building more HP into them. Fiora and Vayne are the two cases of true damage which I feel need to be dealt with.\n\n%HP true damage is a huge problem because there's absolutely nothing a tank can do against it. You can have invested 12K gold into your defences and they do absolutely nothing. \n\nI'd prefer if Riot just reworked Vayne and Fiora not to have %HP true damage on their kits so tanks could actually cope with them but that seems doubtful, so if they're not going to do that an item like this is the only way to give tanks some ability to be durable VS these champs.","replies":[{"poster":"UnboundCreator","date":"2016-07-27T04:28:03.312+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=LankPants,realm=OCE,application-id=3ErqAdtq,discussion-id=XJ6izFhH,comment-id=000500030000,timestamp=2016-07-27T02:48:10.171+0000)\n>\n> There&#x27;s a difference between reducing and absorbing. If you drop a Janna shield on somebody it will absorb true damage, it&#x27;s different to reducing the damage, it&#x27;s effectively giving you HP to tank it with.\n> \n> I&#x27;m going to be honest here, I generally don&#x27;t think true damage is a huge problem, I have no problem with characters like Cho&#x27;gath, Irelia, Olaf and Darius dealing true damage, all of these cases are fine because tanks can mitigate their damage by building more HP into them. Fiora and Vayne are the two cases of true damage which I feel need to be dealt with.\n> \n> %HP true damage is a huge problem because there&#x27;s absolutely nothing a tank can do against it. You can have invested 12K gold into your defences and they do absolutely nothing. \n> \n> I&#x27;d prefer if Riot just reworked Vayne and Fiora not to have %HP true damage on their kits so tanks could actually cope with them but that seems doubtful, so if they&#x27;re not going to do that an item like this is the only way to give tanks some ability to be durable VS these champs.\n\nAs I said earlier on this post these champs have percent hp true damage because they're meant to counter tanks. This post is like me asking riot to remove assassins from the game because they counter adcs","replies":[]}]}]}]}]}