{"poster":"Eivix02","date":"2019-01-14T21:25:29.208+0000","title":"cerco giocatori per un team di silver in modo da fare flex 5v5 seriamente","subforum":"Reclutamento","up_votes":4,"down_votes":0,"body":"io sono un top laner e ho un amico mid laner, ma non gioca molto. vorrei trovare delle persone che siano almeno un jungler, un support, un adc e magari un mid laner per avere un team disposto a giocare almeno un&#039; ora e mezza o 2 al giorno o ogni 2 giorni, o comunque poi si vedr&agrave;. vorrei solamente fare flex 5v5 in modo serio. per parlare con me, oltre a questa discussione potete chiedermi l&#039;amicizia su lol al nickanme che vedete. ovviamente come requisito è rischiesto anche di avere un microfono, delle cuffie e la disponibilità ad utilizzare discord","replies":[{"poster":"Eivix02","date":"2019-01-16T18:26:12.750+0000","up_votes":1,"down_votes":0,"body":"attualmente il team è al completo, ma comunque se vi interessa chiedetemi l' amicizia su lol e vedrò se potete entrare nel team","replies":[]},{"poster":"OfficierSbarcus","date":"2019-01-16T05:42:09.825+0000","up_votes":1,"down_votes":0,"body":"Aggiungimi con il nickname che vedi sono main support","replies":[]},{"poster":"FenixCloud2","date":"2019-01-15T16:43:26.047+0000","up_votes":1,"down_votes":0,"body":"Se vuoi, il mio nickname è FenixCloud2, sono main adc ma posso addattarmi a tutto (ovviamente con una ristretta cerchia di personaggi che \"so usare\")","replies":[{"poster":"Eivix02","date":"2019-01-15T17:54:08.525+0000","up_votes":1,"down_votes":0,"body":"ok ti invio la rischiesta d' amicizia, tanto devo ancora vedere bene tutti  fare delle partite di prova","replies":[]}]},{"poster":"Eidunn","date":"2019-01-15T14:55:15.226+0000","up_votes":1,"down_votes":0,"body":"Ciao\nsono Silver IV e faccio qualsiasi ruolo tu voglia. Principalmente sono top e supporto, ma mi adatto alla situazione. Gioco solo la sera e nei week end(lavoro e studio), ma quando sono on sono felice di giocare in gruppo.\nIo ho solo un piccolo requisito, vorrei giocare con persone dai 20 anni in su.\nHo microfono,discord ed ecc.\nMandami pure richiesta di amicizia, nickname \" Aeldrein\"","replies":[{"poster":"Eivix02","date":"2019-01-15T15:00:00.499+0000","up_votes":1,"down_votes":0,"body":"mi dispiace ho 16 anni,  ma comunque se vuoi ti invio la richiesta di amicizia e giochiamo accasionalmente nelle flex insieme nel caso manchi un membro del team","replies":[]}]},{"poster":"SpeedyGonzalesz","date":"2019-01-15T03:33:34.147+0000","up_votes":1,"down_votes":0,"body":"Hai già trovato??","replies":[{"poster":"Eivix02","date":"2019-01-15T14:06:11.442+0000","up_votes":1,"down_votes":0,"body":"ti invio la richiesta e magari facciamo qualche game per vedere come va, perchè ne ho già uno ma vorrei darti una possibilità","replies":[]},{"poster":"Eivix02","date":"2019-01-15T06:35:39.580+0000","up_votes":1,"down_votes":0,"body":"Mi manca il jungler e il support devo ancora capire se può essere elizabeth, ma anche se sei un midlaner va bene perchè il mid laner che abbiamo non può giocare molto e magari quando non c'è lui potresti giocare tu se ti sta bene ","replies":[{"poster":"xXAndreas99Xx","date":"2019-01-15T12:40:22.393+0000","up_votes":1,"down_votes":0,"body":"se vuoi come jungler ci sono io","replies":[]}]}]},{"poster":"Elizabeth Lyones","date":"2019-01-14T23:10:33.418+0000","up_votes":1,"down_votes":0,"body":"se volete non ho microfoni io","replies":[{"poster":"Eivix02","date":"2019-01-15T06:34:50.449+0000","up_votes":1,"down_votes":0,"body":"Non potresti nmeno utilizzare il cellulare per parlare su discord? Comunque oggi pomeriggio ti mando l' amicizia su lol e vediamo cosa fare","replies":[{"poster":"Elizabeth Lyones","date":"2019-01-15T10:18:04.629+0000","up_votes":1,"down_votes":0,"body":"no mi vergogno","replies":[{"poster":"Eivix02","date":"2019-01-15T14:02:24.126+0000","up_votes":1,"down_votes":0,"body":"intanto ti ho inviato l'amicizia, facciamo un po' di game insieme quando ci troviamo online magari anche con qualche altro membro. però se vuoi fare flex sarebbe opportuno se magari entro inizio season cominci a \"parlare\" così siamo più sicuri anche perchè il support dovrebbe fornire molte informazioni alla squadra oltre a dover costantemente parlare con il suo adc","replies":[]}]}]}]},{"poster":"elox026ITA","date":"2019-01-14T21:40:24.760+0000","up_votes":1,"down_votes":0,"body":"Ciao, anche io sto cercando di fare un team se ti interessa leggi il mio [Post](https://boards.euw.leagueoflegends.com/it/c/discussioni-generali-it/AmX5UdfG-cerco-giocatori-per-team-flex-bronzoargentogold), se soddisfi gli unici requisiti di Discord con microfono, costanza nel gioco e whatsapp/telegram allora possiamo fare qualche game di prova.","replies":[{"poster":"Eivix02","date":"2019-01-14T21:42:34.804+0000","up_votes":1,"down_votes":0,"body":"se vuoi posso farlo anche ora il game di prova","replies":[]}]}]}