{"poster":"Ananichi","date":"2015-03-07T19:44:58.170+0000","title":"Choices on Cos-play","subforum":"Community Creations","up_votes":2,"down_votes":0,"body":"Hey guys, I'm trying to cos-play and have fun with it. I'm a female with dark skin( brown). I plan on uploading my pictures or videos but I don't want to just cos-play as {{champion:76}}  or {{champion:43}}  any suggestions?","replies":[{"poster":"Rasv","date":"2015-03-07T19:45:48.993+0000","up_votes":3,"down_votes":0,"body":"You can cosplay whoever you want no matter what you look like. The important thing is that you have fun.","replies":[{"poster":"Ananichi","date":"2015-03-08T04:43:42.927+0000","up_votes":1,"down_votes":0,"body":"Thank you :)","replies":[]}]},{"poster":"TerraRising","date":"2015-03-08T02:49:13.868+0000","up_votes":2,"down_votes":0,"body":"Let me give some background before anything else:\n\nI am an old (nearly 40) dark skinned, larger than average cosplayer.  My main League cosplays have been Pentakill Yorick, Debonair Jayce and Gragas Esq.\n\nI have been called, by members of this community, on social media and on Reddit, all sorts of names and given all sorts of insults.  I've received lines like \"way too overfed\" and told I should \"stick to Lucian\" and that I'm \"too dark to play Jayce.\"  You name it, I've been called it.\n\nDoes it bother me?  Sometimes.  But then I remember that most of the people I cosplay League of Legends champs with are perfectly awesome to be around, and the vast, vast majority are really cool with people cosplaying what and who they want, regardless of skin color, size, shape or gender.  (Plenty of awesome genderbend cosplays floating around).  This extends to every person working at Riot Games.  I've never heard one say anything bad to my face about my costumes.\n\nThis is how it should be, but humanity has not learned how to be awesome like that.\n\nNow, as far as who you *should* cosplay as, the better question is who do you ***want*** to cosplay as?  Just remember that ***every*** cosplayer gets hate from complete strangers who don't have the courage to do what you're doing, which is being awesome.\n\nAnd every","replies":[{"poster":"Ananichi","date":"2015-03-08T04:50:49.250+0000","up_votes":2,"down_votes":0,"body":"Yeah you're right, awesomness is something people do hate but the fact that more people would support anyone who cosplays  seems to be a great reason to just jump out into the world with confidence.","replies":[]}]},{"poster":"Ananichi","date":"2015-03-07T20:14:06.253+0000","up_votes":1,"down_votes":0,"body":"I'm just nervous since a lot of people insult me in general for being a girl who likes anime and games. I'd just hate to embarrass myself trying to have fun and stand out.","replies":[{"poster":"Bioluminescence","date":"2015-03-07T21:31:57.567+0000","up_votes":2,"down_votes":0,"body":"I agree with Rasv - cosplay whoever you want to be!  If you fancy being Braum with his magnificient mustache - go for it!  If you think you'd make a brilliant Tristana (no-one I know personally was born with purple skin) then rock it.\n\nCosplay is about being someone else - so don't be 'limited' by who you think you are right now (or who other people tell you, you should be).  That's the fun of it :D\n\nOf course - that leaves you with a bigger problem - if you can be anyone - who do you WANT to be!","replies":[{"poster":"Ananichi","date":"2015-03-08T04:44:55.573+0000","up_votes":1,"down_votes":0,"body":"Lol indeed the biggest problem now is who should i choose and what skins also lol.","replies":[]}]}]},{"poster":"Ananichi","date":"2015-03-08T04:43:13.657+0000","up_votes":1,"down_votes":0,"body":"Well, i guess i should be starting soon and enjoying it !","replies":[]}]}