{"poster":"SeraCue","date":"2017-05-28T12:25:13.328+0000","title":"Gaming Evolution","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hey Leute,\r\nIch geh&ouml;re einer relativ frischen Community an und m&ouml;chte euch hiermit einladen, uns beizutreten und die Vorteile einer Community zu genie&szlig;en! \r\nŰber uns:\r\nWir sind die Gaming Evolution und bestehen momentan aus noch recht wenigen Mitgliedern, welche aber alle einen unglaublich sympatischen Schaden haben.\r\nWir besitzen (2 Teams)  in League of Legends: Silber-Gold &amp; Gold/Platin Bereich, dessen Mitglieder sich aber stetig verbessern und zusammen an regelm&auml;&szlig;igen Training, Scrims und bald auch Turnieren teilnehmen.\r\nUnsere Community hat zum Gr&ouml;&szlig;ten Teil League of Legends Spieler, allerdings sind auch bereits andere Spiele, wie Battlefield 1 und HotS vertreten.\r\nWas f&uuml;r Vorteile hast du, du, du und auch du an unserer Community?\r\nDa wir jeden Menschen genau unter die Lupe nehmen, bevor wir sie der Community joinen lassen, haben wir einen Anteil von toxischen, ragenden und inaktiven Spielern von 0%!\r\nWir legen gro&szlig;en Wert darauf, dass die Community eine Gruppe ist, in und mit der man Spa&szlig; haben, Leute finden und gemeinsame Zock-Sessions finden oder Tipps von besseren Spielern erhalten kann, etc pp...\r\n \r\nWas brauchst du?\r\n- Sei ein aktiver Gamer (nat&uuml;rlich liebend gern League), der Interesse daran hat, neue Leute kennen zu lernen und Interesse daran findet, die Sache zu supporten.\r\n- Sei 16+ Jahre alt\r\n- Sei immer positiv und beleidige niemanden inGame, outGame, und so weiter und sofort. Ich glaube diesen Punkt muss ich nicht weiter ausf&uuml;hren. :D \r\n- du brauchst (z.B. was League of Legends betrifft) keine bestimmte ELO! Jeder, der Spa&szlig; am Spiel hat und eine positive Einstellung gegen&uuml;ber seinen\r\nMitmenschen zeigt, ist willkommen!\r\n\r\nOrganisatoren bei uns im Bereich LoL sind GuardMagician, xXFuuuuuuXx, JayPeace,  Wolfmaschine. Diese kannst du in League einfach adden und man wird sich deiner Fragen und Interessen annehmen! Wenn die Organisatoren nicht da sein sollten, dann sprich einfach ein anderes Mitglied an und man wird Dir gerne weiterhelfen! :-)\r\nWenn du nun Interesse haben solltest, dich mehr &uuml;ber das Konzept der Gaming Evolution zu informieren oder wenn du noch fragen hast, schreib einfach hier drunter!\r\n\r\nOder adde mich direkt Ingame: SeraCue \r\nHier noch kurz unsere TsIP: \r\nGaming-Evolution.net \r\n\r\n Soweit wars das von uns, vielen Dank f&uuml;r durchlesen :D!!!","replies":[]}