{"poster":"ToE Andromeda","date":"2015-06-08T15:49:06.531+0000","title":"Yasuo plötzlich nicht mehr op?","subforum":"Champions & Gameplay","up_votes":2,"down_votes":2,"body":"Hallo leute\r\n\r\nwollte mal fragen wo die ganzen &quot;Yasuo OP&quot; Menschen sind? Oder wurde er von den Patches zerst&ouml;rt? Was denkt ihr &uuml;ber ihn wie er im Mom ist?{{champion:157}}","replies":[{"poster":"AyRe CoNteMpT","date":"2015-06-08T15:51:47.440+0000","up_votes":4,"down_votes":0,"body":"yasuo ist, wie ich hier schon öfter schrieb, aufgrund seines kits nicht zu balancen. er ist entweder deutlich zu stark oder nutzlos. derzeit eher nutzlos.","replies":[{"poster":"pulledchicken","date":"2015-06-08T19:32:36.671+0000","up_votes":1,"down_votes":0,"body":"^GOD Confirmed meine rede guter Mann meine rede ! ...\n\nman muss ihm ein neues Kit geben nur dann ist er Balanced ! ( am besten das Kit eines Assassins ... mit gapclose )","replies":[{"poster":"AyRe CoNteMpT","date":"2015-06-08T21:19:23.021+0000","up_votes":1,"down_votes":0,"body":"klar, alle champions müssen fünf gapcloser haben, vorallem assassins ;D\nausserdem würde ich sagen, yasuo ist mehr ein kämpfer, keine assassine. er ist doch sowas wie ein ehrenhafter samurai. das ganze assassin-theme passt garnicht zu ihm, auch wenn er natürlich einen gewissen damage mit seinem schwert raushauen muss.\n\ndas problem in yasuos fall ist, dass er wirklich ein ganz neues kit braucht, und das lässt sich wirklich nicht so eben aus den fingern saugen. vorallem wenn man davon ausgehen muss, dass die windwall bleibt, weil sie einfach seine ikonischste fähigkeit ist.\n\ntatsächlich ist sein sustained damage durch den cooldownlosen auto attack reset eher sowas wie permanenter burst. in kombination mit seinen fünf passives, dem cc, der mobility und der utility ist dieser damage entweder hoch genug um jemanden innerhalb seiner combo clean zu bursten, oder er ist es nicht. ein zwischending gibt es nicht, und genau da liegt das problem.\n\nentweder yasuo kann einen champion in einer combo killen, dann ist er die stärkste, safeste sustained damage fighter burst assassin mit der meisten und besten utility im game, oder er kann es nicht, dann ist er nur ein squishy möchtegern bruiser assassin mit mittelmäßiger utility.\n\ndas heißt, hier an den zahlen rumzuschrauben bringt rein garnichts. entweder man nimmt ihm die hälfte seiner utility und gibt ihm dafür wieder mehr damage, oder man nimmt ihm die hälfte seines bursts und gibt ihm dafür vernünftigen sustained damage und mehr utility. \n\noder man lässt ihn wie er ist und bringt zwei neue champions raus von denen der eine noch mehr rumspringen kann als yasuo und champions mit 4000+ dmg smitet und der andere einen AoE knockup ohne cooldown, massiven aoe damage, den besten jungle sustain im game und abormale mobility hat, weil wie gesagt, jeder champ braucht fünf gapcloser und escape spells, sonst isses ja \"no fun to play\". wer mag schon garen.","replies":[{"poster":"ToE Andromeda","date":"2015-06-08T22:51:13.640+0000","up_votes":2,"down_votes":0,"body":"Ich habe mir überlegt wie es wäre, wenn man ihm wieder mehr schaden auf die ult gibt, die cast-times auf standard zurücksetzt und er dafür nurnoch ziele ulten kann die er SELBST mit der Q trifft, so würde der champ allgemein stärker, aber um einiges schwerer zu spielen, was ihn anfälliger macht.\nAuch wenn dann sein Skillcap ins unendliche steigt","replies":[{"poster":"AyRe CoNteMpT","date":"2015-06-09T06:32:06.177+0000","up_votes":1,"down_votes":0,"body":"das würde absolut nichts bringen, da yasuos stärke nicht aus der utility resultiert, teamknockups zu verlängern, sondern leute auf eigene faust zu assassinaten und zu duelieren ohne key cooldowns (damage und mobility) zu verbrauchen.\n\nich bin der meinung, dass mehr damage bei yasuo der falsche ansatz wäre und ich ihm lieber ordentlich damage nehmen würde um seine utility zu stärken und ihn in richtung utility-bruiser mit guter dps und mobility zu bringen, allerdings dann komplett ohne hard-cc und burst.","replies":[{"poster":"4 R4nd0m N008","date":"2015-06-09T06:59:01.048+0000","up_votes":1,"down_votes":0,"body":"> ich bin der meinung, dass mehr damage bei yasuo der falsche ansatz wäre und ich ihm lieber ordentlich damage nehmen würde um seine utility zu stärken und ihn in richtung utility-bruiser mit guter dps und mobility zu bringen, allerdings dann komplett ohne hard-cc und burst.\n\nKein Hard-CC, kein Burst, sondern nur ganz guten DPS. Wer soll denn dann noch Yasuo spielen? Der wäre in keinster Weise eine Hilfe für das Team. Und im 1 on 1 könnte der dann auch nichts mehr reißen...","replies":[{"poster":"AyRe CoNteMpT","date":"2015-06-09T07:12:55.698+0000","up_votes":1,"down_votes":0,"body":"kein hard cc, kein burst, dafür ganz guten dps und verdammt viel utility, vorallem gegen ranged champs. damit könnte er zwar nicht mehr alle bruiser duelieren, aber umso besser mages und marksmen, während er dem team verdammt viel utility und defense bringt. eigentlich ganz geil.","replies":[{"poster":"4 R4nd0m N008","date":"2015-06-09T07:26:19.402+0000","up_votes":1,"down_votes":0,"body":"Dann reicht der E aber nicht als Gapcloser (da die Ultimate ja in dem Fall geremaket wurde). Fast jeder ADC kann ihn dann einfach zu Tode Kiten ohne das Yasuo auch nur irgendwas machen könnte. Er kommt nur einmal mit dem E kurz dran und dann kann der ADC einfach weggehen und ihn dabei töten. Auch mit vielen, aber nicht allen Midlanern wäre das dann möglich.","replies":[{"poster":"AyRe CoNteMpT","date":"2015-06-09T09:31:28.743+0000","up_votes":1,"down_votes":0,"body":"seine rolle wird einfach eine andere, er ist keine assassin mehr, er ist ein anti-ranged champ mit team utility und dps. seine fähigkeit, ranged champs zu duelieren, kann aus mehr als nur reiner mobility und dickem damage bestehen.","replies":[]}]}]}]}]}]}]}]}]},{"poster":"Stiv1234","date":"2015-06-08T16:30:53.982+0000","up_votes":3,"down_votes":0,"body":"Eher schwach, aber trotzdem noch unglaublich nervtötend.","replies":[]},{"poster":"Chrizzlybär","date":"2015-06-08T18:12:18.128+0000","up_votes":2,"down_votes":1,"body":"Ich finde das yasou nicht so schwach oder sogar nutzlos ist.\nEr ist immer noch ein starker champ, vllt nicht so wie früher aber im richtigen Team, geht er noch ganz gut ab.\nIn meine letzten Hexakill wat ich mit Yasou immer Feed und weg geschlietzt dir mir zu nahe kam.\nUnd gegen Ekko immer ein Free win auf der lane.","replies":[{"poster":"pulledchicken","date":"2015-06-08T19:29:59.140+0000","up_votes":1,"down_votes":3,"body":"Vollekane Balanced wenn ein Champion nur in einer Combo stark ist GG !","replies":[]}]},{"poster":"ToE Andromeda","date":"2015-06-08T17:25:18.621+0000","up_votes":1,"down_votes":0,"body":"Danke euch für die Antworten","replies":[]},{"poster":"Y4l0","date":"2015-06-08T16:07:01.514+0000","up_votes":1,"down_votes":0,"body":"Ich bin Main Yasou finde aber nicht, dass er op ist. In meinem Berreich spielt eh nur das Skilllevel eine Rolle.","replies":[]}]}