{"poster":"FantasySniper","date":"2016-08-27T23:40:57.735+0000","title":"I think that it's time we realize Yasuo was a huge mistake","subforum":"Gameplay","up_votes":11,"down_votes":10,"body":"Title.","replies":[{"poster":"RcGjWO640w","date":"2016-08-27T23:47:47.916+0000","up_votes":5,"down_votes":5,"body":"Riot:\n\n* A passive shield\n* _Practically_ unlimited dashes\n* Mid-ranged poke\n* One of the longest ranged skillshots in the game that isn't global\n* A teleport\n* Double crit from all sources\n* Resourceless\n* An execute\n* 50% armor shred\n* A knockup\n* Invulnerability from all \"projectiles\"\n* High base damage\n* High damage scalings\n* Assassin levels of burst\n* ADC levels of sustained DPS\n* Two turtle doves and a partridge in a pear tree.\n\nWhat could go wrong?","replies":[{"poster":"MagicFlyingLlama","date":"2016-08-28T00:06:25.153+0000","up_votes":6,"down_votes":5,"body":"A passive shield\n    ~~Practically unlimited dashes~~ : No. Once per target with  a long cooldown.\n    ~~Mid-ranged poke~~ : Short range poke\n    ~~One of the longest ranged skillshots in the game that isn't global~~ :** If you dont count almost every other skillshot, yes**\n    A teleport\n    Double crit from all sources\n    Resourceless : Flow.\n    ~~An execute   : ~~  _Where?_\n    ~~50% armor shred~~ : BONUS armor shred\n    A knockup : Dodge it. Stop standing in the middle of the wave so he can minion-taxi into your face with it.\n    ~~Invulnerability from all \"projectiles\" ~~: Maybe juke around or predict the shield, instead of facerolling at it.\n    High base damage\n    High damage scalings\n    ~~Assassin levels of burst : ~~Not really.\n    ADC levels of sustained DPS\n    Two turtle doves and a partridge in a pear tree. : Possibly.\n\nDisclaimer: i dislike yasuo, but the current salt-bandwagon is pathetic.","replies":[{"poster":"RcGjWO640w","date":"2016-08-28T01:04:31.246+0000","up_votes":2,"down_votes":2,"body":"There's no bandwagon, it's just an observation of mediocre game design at its finest. Yasuo is a champion designed to have a kit full of make-ups and get-out-of-jail free cards. He has a kit designed to invalidate the idea of being set back. Yasuo is a champion who can play from 0-15 and still be a pentakill threat.\n\n_\"Oh, you're taking harass and can't dodge? Here's a free shield so you don't take as much damage, don't worry, you'll dodge it next time!\"_\n\n_\"You have no move speed or slows and can't get in range to do any damage? Here's a dash that you can use as many times as there are targets so you'll always be in range!\"_\n\n_\"Don't have enough gold for your build? Don't worry, here are some free stats for you so you don't have to worry about being behind in gold and items.\"_\n\n_\"Your a melee champion who needs to be able to CC and deal damage from range? Here's two ways to do a knockup and an ultimate that teleports you to their location if you hit it! Also, we made the hit box really wide so it's harder to miss.\"_\n\n_\"You don't want to get hit by all of those skill shots and auto attack damage, but can't be bothered to deal with what all assassins have to? That's fine, we'll give you a wall that blocks all of that from hitting you for several seconds.\"_\n\nDo you see a pattern here? Like it or not, Yasuo is designed to essentially be a spoon-fed champion. When a player can't be bothered to do anything for themselves and can't be bothered to deal with the risk that all assassins have to deal with then fighting other champions, they give him tools that make it all but impossible to lose.\n\nThe problem with Yasuo isn't that his damage is too high or that his shield lasts too long or even that he gets double crit. The problem is that **the only way to fight a Yasuo is to pray that he makes a mistake.** Yasuo is a champion who was designed with the idea that he can outplay anyone. You can't force a Yasuo into an unfavorable situation because Yasuo will always have a response to it. Unlike almost every other champion in the game, Yasuo can only be beaten if the player themselves screws up. On every other champion, it's possible to put them in an unwinnable scenario simply by taking advantage of their weakness'. Yasuo doesn't have this issue. You _can't_ put Yasuo into an unwinnable scenario because the mechanics of Yasuo prevent that. To fight a Yasuo, all you can do is hope that he screws up and _gives_ you the opening you need to deal with him. If he doesn't make those mistakes. If he doesn't give you those openings, you _cannot_ beat him. Period.","replies":[{"poster":"GULAG 4 U","date":"2016-08-28T01:20:27.319+0000","up_votes":2,"down_votes":3,"body":"Get out of jail free card? What?","replies":[{"poster":"RcGjWO640w","date":"2016-08-28T02:14:43.950+0000","up_votes":3,"down_votes":3,"body":"Let me think for just a second here...\n\nYasuo out of position and takes harass? No problem, shield.\n\nFed ADC enters to fight? No biggie, windwall.\n\nSomeone flashed? That's okay, just dash through the creep wave and you're there.","replies":[{"poster":"The Last Ballad","date":"2016-08-28T02:55:27.916+0000","up_votes":1,"down_votes":0,"body":"> Yasuo out of position and takes harass? No problem, shield.\n\nThat can be triggered by anything, even a Xerath aa(which does next to nothing), and the shield is rather weak and requires him to travel the length of a lux ult in order to have it. \n\n> Fed ADC enters to fight? No biggie, windwall.\n\nUnless he is in between them and the rest of his team, that won't help, and if he is it will only help for ~4 seconds... It also protects the adc from him as he has to leave the safety of the wall to attack them.\n\n> Someone flashed? That's okay, just dash through the creep wave and you're there.\n\nYes, so helpful to go to the nearest lane and dash through the minion wave when they flash over dragonpit wall. Or any wall for that matter. Oh, and if they flash under tower with the minion wave behind you, well I'm sure that dashing in the opposite direction of them will help.","replies":[]},{"poster":"GULAG 4 U","date":"2016-08-28T02:31:20.742+0000","up_votes":1,"down_votes":0,"body":"Well pop his shield? It doesn't stop cc, most mages can literally ignore it.\n\nFlashed? Only if there are minions. \n\nWalk around the fucking windwall or bait it.","replies":[]}]}]}]}]},{"poster":"GULAG 4 U","date":"2016-08-28T01:00:27.798+0000","up_votes":2,"down_votes":5,"body":"Half of this list is hyperbolic as fuck. One of the longest skillshots in the game that isn't global? It's a skillshots for 10 seconds after you land a q.\n\nTeleport is global, his ultra range is a evolved khazix jump.\n\nAn execute? What the fuck?\n\nSome projectiles go thru his wall and it lasts for 4 seconds and has a large ass cd.\n\n\nBurst? Look at rengar, Annie, zed, khazix.","replies":[]}]},{"poster":"The Last Ballad","date":"2016-08-28T03:05:14.521+0000","up_votes":1,"down_votes":2,"body":"I think it is time that you realize that this type of post, where all the information is in the title(aka, none), is a huge mistake. Why on earth would any sane person listen to someone that will not even take the time to give their argument? Especially on the topic of a champ that is **both** loved and hated. I wouldn't care if the title was \"The fact that there is still starving children in this age is an atrocity\", I would still expect you to have _something_ to back up your statement and preferably a _ plausible _(I want to stress this part) plan of action to fix it.\n\nAnd no, removing Yasuo would not be a plausible fix. Just look at the outcry when Gangplank was removed for only a few days.","replies":[]},{"poster":"JoshuasDaddy","date":"2016-08-28T00:37:46.226+0000","up_votes":2,"down_votes":5,"body":"just like ur birth","replies":[]}]}