{"poster":"FantasySniper","date":"2015-05-02T03:12:29.903+0000","title":"Shivering Scythe (A Brutalizer Upgrade Idea)","subforum":"Gameplay","up_votes":9,"down_votes":2,"body":"**Shivering Scythe**\n\n_Edit:  Following up on feedback, the price has been increased by 200g, and the Reload passive has been removed._\n\nAn item designed for AD assassins so that they may have less awkward build options.\n\nVisual: A Shivering Isles themed scythe. Something that would be closer to Thresh than it would be Hecarim.\n\nCost: 3400 g\nRecipe: Bilgewater Cutlass + Brutalizer + 663 g\n+50 Attack Damage\n+10% Lifesteal\n+10% CDR\n\nUnique Passive: +25 Armor Penetration\nUnique Active: Strikes target champion, dealing (100% AD) in physical damage that applies on-hit effects and steals 25% of their MS for 3 seconds. (Range: 450) (Cooldown: 45 seconds)\n\nEfficiency: 87.26% before Active.\n\nAn AD assassin&rsquo;s item choices are rather strange. They are supposed to take down a single squishy opponent by bursting them down, yet nothing but The Black Cleaver was really characteristic to this task. With Hydra being a splash-damage item, Last Whisper being better against armor stackers than anyone else, and everything else possessing attack speed and/or criticals, which are irrelevant to the average Assassin&rsquo;s caster-based playstyle.\nWith Black Cleaver reworked, and Brutalizer&#039;s only upgrade left being Youmuu&#039;s, there isn&#039;t a lot of optimization for the role.\nThis item could introduce the opportunity to start your assassination or end it for an escape.\nAlthough its efficiency is low, being able to essentially use an instant auto-attack that steals massive MS makes it very powerful. Compared to Tiamat&#039;s Crescent active, there is no AoE in return for no cast time and it actually has range.\nImagine this on Hecarim.\n\nConcerns:\nBruisers. The bane of AD balance, they might end up exploiting this item more than they do BotRK or Black Cleaver. Not stacking AD hurts the efficiency of the item, (contrasting BotRK if not Black Cleaver as well) however, so it may not come to that.\nAssuming that Youmuu&#039;s ends up getting stacked upon this item, Brutalizer&#039;s passive should become named to as to avoid the Arm.Pen. stacking.\nThe active should not stack with the other upgrades of Cutlass.\n\nIs it too powerful? Is it too weak?\nWhat would you change about it?\nOn what champions would it present balance issues, and why?\n\nThank you for reading!","replies":[{"poster":"BluePolarizer","date":"2015-05-02T03:15:54.922+0000","up_votes":1,"down_votes":2,"body":"Bruisers don't actually build enough AD for this to be good on them.","replies":[{"poster":"FantasySniper","date":"2015-05-02T04:11:56.166+0000","up_votes":5,"down_votes":0,"body":"Done on purpose.","replies":[]},{"poster":"Blitzidious","date":"2015-05-02T04:17:21.451+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=BluePolarizer,realm=NA,application-id=3ErqAdtq,discussion-id=f3ssdXcZ,comment-id=0000,timestamp=2015-05-02T03:15:54.922+0000)\n>\n> Bruisers don't actually build enough AD for this to be good on them.\n\nHe Clearly stated, \"An item designed for AD assassins so that they may have less awkward build options.\" :P","replies":[]}]},{"poster":"junglerboy16","date":"2015-05-02T15:15:57.280+0000","up_votes":3,"down_votes":0,"body":"I like the concept, but it has way too many stats, and most of them are super self synergistic, meaning this item would become pretty much mandatory on every AD assassin out there. If you trimmed the fat from this item, it could be pretty solid, but right now it is overloaded.\n\nFirst: Remove the \"reload\" passive. that is a Gunblade specific passive, not a Bilgewater Cutlass passive, and it doesn't make any thematic sense (\"I'm reloading my sword!\" instead of \"I'm reloading my *gun*!\")\n\nSecond: It is *far* too gold efficient. Most people don't understand this, but when you layer multiple stats into one item that all make the other stats it gives that much better, the gold efficiency actually *increases substantially*. If you nerfed it's gold efficiency from stats to about 80% not counting the active, it would be more balanced, but still incredibly strong, since it gives absolutely everything an AD caster/assassin would ever want in a single item.\n\nThird: Instead of just nerving stats, consider flat out removing some of those stats. Right now, it is so generalized that you could (and often should/would be required to) build it 1st item every single match. It has no niche whatsoever and is good in every situation, even if it had weak stats. It's the same type of thing that made Lee sin and Thresh OP for so long, they could do *anything*, and that meant there was almost no counterplay to them when they were strong.","replies":[{"poster":"FantasySniper","date":"2015-05-02T17:59:27.872+0000","up_votes":1,"down_votes":0,"body":"1. I was looking for a way to get the CD to become low without having to make it statically low. If it were to be renamed, could it still work? Or should it be scrapped?\n\n2. I made it 3200, and didn't increase any stat from the recipe except for the Arm.Pen. That is the only lever I can utilize without having to change its recipe, and that's its major selling point. Should it become 15 or 20, or should the cost be increased (assuming slot efficiency is not the issue)?\n\n3. An item doing everything could be balanced in and of itself. AUG was an anti-mage infinite-mana pickup before they reduced its MR and changed up the regen mechanics, and they still haven't removed any of the stats on it. Hydra grants regen, AoE damage, and lifesteal that benefits from the AoE, making it extremely useful on any melee because it comes with free health return, an active for bonus damage, and wave clear.\nI do not see every assassin having a staple item being a problem. Seeing as how it practically frees up a slot, their itemization would in fact see more variety, and not less.","replies":[{"poster":"junglerboy16","date":"2015-05-02T19:07:41.175+0000","up_votes":1,"down_votes":0,"body":"1. Leaving it at a flat 45-60 second cooldown wouldn't be that bad I don't think, especially considering it is essentially a single target Hydra active with a MS steal attached. \n2. Slot efficiency is definitely not an issue with this item, since it has so many good stats. I'd say just bring up the cost to 3400 and it would be a lot better. I mean, If you bring the cost up high enough (say 3800), you can actually *buff* its stats instead of leaving them just as good as the components, in a similar way to Trinity force.\n3. The reason I would say having a staple item is bad would be to look at ADCs. Almost every ADC has to build IE to scale, and that cripples their item diversity because they have to get things that synergize with that item. That, and it becomes a game of \"who can abuse X core item the most?\" leaving the people that synergize with it best at a clear and unfair advantage. That said, if you implemented the changes in points 1 and 2, then I don't think it would be *quite* as bad as IE is, and having it be a really good, but at least partially situational (as in, more of a luxury item for when you get ahead early) item would leave it in a pretty good spot.","replies":[{"poster":"FantasySniper","date":"2015-05-03T00:49:37.276+0000","up_votes":1,"down_votes":0,"body":"Thank you, I will implement those changes.","replies":[]}]}]},{"poster":"kDrakari","date":"2015-05-02T18:18:24.769+0000","up_votes":1,"down_votes":0,"body":"The problem is, you can't remove stats from it without changing the build path (or violating the \"rule\" that items must have at least the combined raw stats of their components). I mean, even if all the upgrade did was turn the cutlass active into the proposed \"free autoattack\" active, the item would still be 50 AD, 10 CDR, 8 Life Steal (down from 10),  and 10 a.Pen (down from 25). Basically the only place you could even nerf the numbers significantly would be in flat armor pen; while I think the armor pen needs to be nerfed either way (at least down to 20, if not 15) there isn't a way to reduce the number of different stats it provides without changing the build path. \n\nThat said, I propose changing the build path. I recommend building out of B.F. sword, and have the active not slow or steal MS at all. Something like Brutalizer + B.F. Sword + 413g (total 3300g): 80 AD, 20% CDR, 20 a.pen, Active: extra auto attack! Could be more expensive. Basically it's like a Super Brutalizer, which is exactly what AD assassins want to rush for the same reason they currently rush Brutalizer. I considered mixing it with Tiamat, but I think B.F. sword is better, especially since I felt that the new item and Hydra would end up treading on each others' feet and ending up with one just being better for everybody than the other no matter how they try to balance it.\n\nAlternatively, we could just make an item: Two Brutalizers. Build path: Brutalizer + Long Sword + Long Sword + 617g (Total: 2674g): 50 AD, 20% CDR, 20 a.pen. No active, just the stats of building two Brutalizers for the cost of building two Brutalizers, minus the fact that Brutalizers don't stack. Maybe add a bit of premium to the end price to make it a bit less efficient than that (I assume that Brutalizers don't stack for good reason) but I suspect that most champions who build Brutalizer would love building it into something basically the same but better.","replies":[]}]},{"poster":"The Yetii Rider","date":"2015-05-02T17:06:55.202+0000","up_votes":2,"down_votes":0,"body":"Riot has stated in the past that they cannot design items for assassins because when they do (DFG) it promotes an assassin's already unhealthy low counterplay pattern (No one likes playing against assassins) and more importantly assassin items would either become must-buys on assassins (they only like must-buy items on supports and ADCs, everywhere else needs build variety) or be completely worthless.","replies":[{"poster":"FantasySniper","date":"2015-05-02T18:00:01.095+0000","up_votes":1,"down_votes":0,"body":"I do not see every assassin having a staple item being a problem. Seeing as how it practically frees up a slot, their itemization would in fact see more variety, and not less.","replies":[]}]},{"poster":"Divewing","date":"2015-05-02T12:09:51.597+0000","up_votes":2,"down_votes":0,"body":"Question: If they idea is to 100-0 someone...........why should lifesteal and a active-cooldown-shortener functioning via time based AAs be a part of it?\nBoth aspects seem redundant, the assassin doesnt want to be AA champions for days for a cooldown reset, and IF the dude needs lifesteal somethings really wrong.\nTbh I cant see any form of single target active being balanced, the best i can think of is a turns next aa into execute dealing missing % hp that scales with AD\nAnd again.....could it be abused by bruisers (abruisered)?","replies":[{"poster":"FantasySniper","date":"2015-05-02T18:30:33.036+0000","up_votes":1,"down_votes":0,"body":"Reload is a method of getting the CD low without it being statically strong. Most AD casters fit at least 2 AAs into their fights, and single-target abilities would count too, so I left the timeframe large and the proc rewards qualitatively high, yet quantitatively few to prevent exploitation from more long-term damage methods that could proc it across every available timeframe and not just 2 instances of combat.\nBut yeah, it's weird, and I'm looking for feedback on whether or not it should stay.\n\nSingle target actives are available on multiple items - Hydra even has AoE . Missing health % damage is an idea, but I don't see it being balanced without rigging the method of balancing assassins around it.\n\nI don't see any bruiser except all-AD build types abusing this item (Jayce, Vi, J4, etc). Those cases are just glass-cannon enough that they wouldn't be too difficult to deal with, though.","replies":[]}]},{"poster":"Zair Umbras","date":"2015-05-02T07:17:52.000+0000","up_votes":2,"down_votes":0,"body":"If it wasn't for the fact that most AD Assassins, like Zed, didn't need such an item, well, yeah. Pairing this with Hydra would simply be scary. You'd have the ability to pop two items and do 200% of your AD on top of a kit that can usually 100-0 people without either of these items.\n\nAlso, I'll mention how USELESS the passive would actually be for any real AD Assassins. The top bursters are Zed, Zix, Rengar and Talon. Of those four, only Rengar actually has more than one single target ability. Rengar has his E and Q. Zix only has his Q, Zed has absolutely none unless you consider his ult, and Talon has his Q since his E doesn't do damage. \n\nALSO. I don't want ANOTHER Ezreal item. He has enough.","replies":[{"poster":"FantasySniper","date":"2015-05-02T08:24:41.038+0000","up_votes":1,"down_votes":0,"body":"Buying both of them seems unlikely, as it would more likely just end up replacing Hydra/BotRK in builds, leaving another space for an alternate AD item as you already have Arm.Pen. and Lifesteal - IE, Maw, or Tri-Force.\n\nWas it not clear? \"Single-target attacks\" include AAs. Every AD assassin includes AAs and even resets into their rotation. You can halve the cooldown just by doing what you do.\n\nEzreal would have no use for the active, and in fact would benefit more from Ghostblade even if he were to get a Brutalizer. Jayce is a much more likely offender.","replies":[{"poster":"Zair Umbras","date":"2015-05-02T20:22:26.110+0000","up_votes":1,"down_votes":0,"body":"Ezreal would use it since it would let him slow the enemy, give him CDR (Which is one of the best stats Ez can have), large amount of AD, able to have the active up quite often, having ArP to make his Q's hurt that much more, plus it would use his TrinityPhreak. There's nothing really that doesn't scream 'EZREAL ITEM'. We all saw how popular {{item:3508}} got on Ez with it returning mana, having high AD, and it had CDR. \n\nAlso, Jayce doesn't need a new item. >> He's pretty fine where he's at.\n\nThere's also the whole ArP issue to begin with! With ArP Runes, the old Cleaver, and a Ghostblade, you could get 49 base ArP on top of the 25%. With just this item, runes, and a Ghostblade, now you have 64. 20 from Ghost, 25 from this, and 19 from Runes. 64 ArP plus 40% with a last whisper and 25% removed from Cleaver that'll be even more common due to how it works now. That's 25% off the top, 40% of the 75%, which leaves some one with 45% armor. \n\nNow imagine a tank with 300 armor. 45% of that is left. That's 135. Minus 64 from the base ArP. That means the 300 armor tank who rolled a TM, Randuin's, and a FH is now sitting at 71 armor. That's... nothing. Seriously, that's nothing. lol. \n\nNow I'll go with a 200 armor tank who has 5k health as we usually see. 45% of that is 90. Minus 64 is 26. That's barely more than a squishy's level 1 base armor. \n\nThey removed Cleaver's base ArP because 25% was already scary and with it giving 10 more, which was 49, now reduced to 39 with its removal, it can be maintained properly. People always complain about MR never having many itemization choices, but armor has the ability to shred 55% of armor with just 2 items. A BC is hard to stack up sometimes though, which is the point. In a long, drawn out fight though against a tank, which is the intended target to kill with such an item, you can stack it up without a problem at all, plus most Assassins like Zed, Zix, Talon, etc. have multi-hit abilities or incredibly low CD's to stack it up rapidly. \n\nOverall, it's best we leave the base ArP alone or we'll be looking at nerfs to some of the biggest ArP offenders like Wukong, Xin, J4, and Vi who can already reduce your armor to rubble. When you think of them being in a fight and having just a cleaver for themselves, then matching up this item with a Ghostblade and ArP runes on a Zed, Talon, or Riven? I'd rather not see entire teams get demolished because one person with an armor reduc in their kit and a Cleaver initiates and one of those three is capable of doing near true damage to tanks who invested in tons of armor to be able to deal with them or bonus damage to squishies because their armor is in the negative.","replies":[{"poster":"FantasySniper","date":"2015-05-02T21:22:32.463+0000","up_votes":1,"down_votes":0,"body":"ER was screaming Ezreal when it came out. It was _designed_ for people like him, Jayce, and Sivir.\nI don't think Jayce would build both Scythe and BC. That would seem redundant since he could just build IE instead.\n\n57.23% + 49.2 is the max penetration from items/runes/masteries (As of Live). That makes anything under 115 armor 0 (Negative is impossible). I sincerely doubt anyone would legitimately attempt such a thing over more viable glass cannon builds.\n\nThis is also why I mentioned that the Brutalizer passive could become named to prevent stacking.","replies":[{"poster":"Zair Umbras","date":"2015-05-02T23:18:45.366+0000","up_votes":1,"down_votes":0,"body":"57.23 is NOT the max penetration. It might be for the max penetration by themself, but armor reducs do stack and you can get pretty far passed that. \n\nAs for having them named? Then your item would be literally useless in comparison to a BotRK. A good majority of champions who would use this item get a Ghostblade and pair it with an IE, which helps increase burst significantly. If they don't stack, then you'd be essentially getting the Ghostblade for nothing and would end up with either those champions switched their Ghostblades out for a Shiv/PD/TrinityPhreak or completely throwing it out the window in general and switching out the IE for a BT or Hydra.\n\nThere's also just using the Ghostblade as a whole. For some one like Zed, you'd be choosing an active to split push, or just an active to simply explode some one even easier plus being made for tank busting since it has an additional 5 ArP. Essentially, you'd be murdering an item and making the AD Assassins who are in a good spot be nearly unbeatable. With tanks being fine with going Smite and TP top lane, an Assassin jungle could easily go jungle, rush the item, and between a Warrior Enchant and that item, they'd be able to decimate targets far too quickly whether the ArP on both stacked or not.","replies":[{"poster":"FantasySniper","date":"2015-05-03T01:39:42.962+0000","up_votes":1,"down_votes":0,"body":"You'd have to show me why that's not, because that already includes all of the % reductions and penetrations available from everything but champion kits.\n\nBotRK gives 25 less AD, the same amount of lifesteal, no Arm.Pen, and %HP based effects that are much less efficient against champions that don't build health. I don't think that is at all worth it compared to an item that can shut down squishies with pure burst.\n\nGhostblade compared to Scythe gives meaningful DPS boosts with its accessible attack speed and crit chance. It wouldn't ever disappear, as champions like Lucian, Yi, Twitch, Fiora, and Tryndamere would still use it.","replies":[]}]}]}]},{"poster":"MidEvilKnight3k","date":"2015-05-02T11:47:59.109+0000","up_votes":1,"down_votes":0,"body":"I would probably limit it to auto attacks.  Otherwise the effectiveness of the item will be too dependent on the type of abilities the champion has.\n\nAlso, that is a lot of flat armor pen.  It would definitely reinforce the tank meta.","replies":[]}]}]},{"poster":"The5lacker","date":"2015-05-02T14:10:36.500+0000","up_votes":1,"down_votes":0,"body":"Flat Penetration needs to be phased out in its entirety, and just making \"BotRK, but for anti-squishies\" is rather unnecessary when BotRK already kinda wrecks squishies.\n\nAlso, contrary to popular belief, there isn't an AD champion in the game who doesn't benefit from AS in some capacity. Because between basic abilities, every single AD Assassin, Bruiser, and even Tank has a 100% AD scaling ability with a cooldown determined by AS. And they frequently have abilities that in some way, shape, or form interact with their autoattacks. So don't be afraid of getting a little AS with your AD, it makes your Lifesteal that much more valuable.","replies":[{"poster":"FantasySniper","date":"2015-05-02T18:19:57.008+0000","up_votes":1,"down_votes":1,"body":"Flat Pen. is still a needed mechanic in this game. Squishies get just enough armor to make minions, monsters, and turrets more negligible under their already increased health reserves, and Sorc Shoes is a staple on mages because of how necessary it is. To remove flat pen would mean you need to either universally decrease resistances for squishies to compensate for the nerf to casters, leaving them more vulnerable to damage the map gives out and making it in general more difficult to survive against enemies that aren't building damage anyways, or you make another % armor pen item that will make tanks victims more than it would make the squishies victims.\n\nMost AD Casters can use a reset - completely ignoring AS - and they prefer to have straight up damage over AS because it scales their abilities harder. AS is _more efficient_ when you expect to use a DPS method of devastation since your abilities are generally unfit for bursting anyone down or you have one of the extremely rare abilities that scale off of it. Rengar's the only exception since he actually can build a Zeal item, and Ghostblade's active is mostly for utilizing the MS. The timeframe in which an assassin works does not allow AS to be as efficient as it could be.","replies":[{"poster":"The5lacker","date":"2015-05-12T01:33:34.684+0000","up_votes":1,"down_votes":1,"body":"Your logic is \"Champions have base stats so we need items that ignore those and only those because minions.\"\n\nHow do you, like, walk and chew gum at the same time?","replies":[{"poster":"FantasySniper","date":"2015-05-12T02:06:04.555+0000","up_votes":1,"down_votes":0,"body":"Not only minions; turrets, monsters, and enemy champions in general that are all of a sudden dealing more damage than they should.\n\nThen there's the discrepancy left between who's supposed to be tanky and who's not, because several fighters walk that fine line between carry and bruiser, leaving you to wonder whether or not they should become more vulnerable to the general damage given like any other glass cannon or become harder to deal with by glass cannons.","replies":[]}]}]},{"poster":"Z Statistic","date":"2015-05-02T14:56:20.399+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=The5lacker,realm=NA,application-id=3ErqAdtq,discussion-id=f3ssdXcZ,comment-id=0003,timestamp=2015-05-02T14:10:36.500+0000)\n>\n> Flat Penetration needs to be phased out in its entirety, and just making \"BotRK, but for anti-squishies\" is rather unnecessary when BotRK already kinda wrecks squishies.\n> \n> Also, contrary to popular belief, there isn't an AD champion in the game who doesn't benefit from AS in some capacity. Because between basic abilities, every single AD Assassin, Bruiser, and even Tank has a 100% AD scaling ability with a cooldown determined by AS. And they frequently have abilities that in some way, shape, or form interact with their autoattacks. So don't be afraid of getting a little AS with your AD, it makes your Lifesteal that much more valuable.\n\nExcept {{champion:80}} doesn't care about AS. Sure it's nice early game to help with chaining last hits, but that's it. This is how you Pantheon:\nW sucka\nAA\nE\nAA\nQ\nAA if needed\n\nIf enemy doesn't die with that combo, you simply don't engage and keep poking them with Q. You would need to be attacking multiple times in succession to benefit from AS in a fight. The only possible way you can pull this off is if you are a) actively catching people with a glasscannon build (which makes the dps from Youmou's silly) or b) building Youmou's after your second defensive item. That is definitely a possibility because you now have a LOT of offense to make your AA's really hurt without critting AND you have the beef to withstand a lot of punishment despite whacking people in the face like a worse version of Fiora. But now there's a new problem: **it's your sixth item**. Youmou's on Panth as a 6th item? Decent idea. As first item? Fucking horrible idea. You're much better going Hydra.\n\nSo now we're at square one; there should be an item that can be rushed early game for AD casters who want pure offense from Brut.","replies":[]}]},{"poster":"SleepyLionCub","date":"2015-05-02T18:40:47.321+0000","up_votes":1,"down_votes":0,"body":"No item that builds off a brutalizer should have lifesteal.","replies":[]}]}