{"poster":"Force Master 12","date":"2016-01-13T18:38:32.545+0000","title":"Brettspiel League of Legends","subforum":"Allgemeiner Chat","up_votes":2,"down_votes":3,"body":"Ich habe mir ein Brettspiel ausgedacht was haltet ihr davon? Ihr die Anleitung:\r\n\r\nSpielanleitung\r\n\r\nF&auml;higkeiten: Am Anfang hat man einen FP, man kann pro 15 get&ouml;teten Monstern (Vasallen oder Jungle Monstern) oder 3 get&ouml;teten Champions ein FP dazubekommen, maximal 5 Punkte insgesamt( werden von F&auml;higkeiten wieder verbraucht). Ein FA kostet einen FP und f&uuml;gt dem Gegner 2 Schaden zu dies gilt als ein Angriff danach muss er eine Runde lang aufladen. Um den Gegner 2 Runden lang festzuhalten muss man 3 FP ausgeben 3 Runden auflade Zeit dies gilt als ein Angriff. F&uuml;r die Ultie Kann man 5 FP ausgeben um den Gegner 7 Schaden zuzuf&uuml;gen 5 Runden Aufladezeit dies gilt als ein Angriff. Man kann au&szlig;erdem FP kaufen 1 FP kostet 10 G. Man darf aber nicht das Maximum von 5 FP &uuml;berschreiten. \r\nLeben: Man hat am Anfang 10 L kann sich aber welche dazu kaufen, insgesamt d&uuml;rfen sie aber nicht &uuml;ber 20 L sein. \r\nSchaden: Man macht am Anfang 1 S kann sich aber weitere dazukaufen, dieser darf aber nicht &uuml;ber 5 kommen. \r\nSpezial: Es gibt 3 Spezials: Flash, Zerschmettern und Teleportieren. Flash r&uuml;ckt den Benutzer zwei Felder in die er will weiter. Zerschmettern f&uuml;gt Monstern und Vasallen 3 S hinzu und Champions 1 S. Teleportieren kann man sich auf einen Tower oder einen Vasallen. Die Spezials gelten nicht als Zug und haben 5 Runden auflade Zeit. \r\nAllgemein:  In seinem Spielzug darf man 2 Felder weiter R&uuml;cken oder 2 Angriffe durchf&uuml;hren oder beides Gemischt. Um anzugreifen muss man ein Feld weit entfernt vom Gegner sein. Das gilt auch f&uuml;r die Ultie, Fa und f&uuml;r Spezial. F&uuml;r festhalten kann man 3 oder weniger Felder weit entfernt sein. Gespielt wird auf der Minimap von League of Legends. Die Spielfiguren sind T&uuml;rme, Vasallen, Champions, Inhibitoren, Nexus und anderen Jungle Monstern. Die Minimap sowie die Spielfiguren muss man sich selber bauen. Jede zweite Vasallen Welle kommt ein Gesch&uuml;tz Vasall. Sobald die Inhibitoren zerst&ouml;rt sind kommen die Supervasallen. \r\nLeben, Schaden, Respawn Zeit und Gold der anderen Sachen: Tower: 20 L, 5 S und 5 G, Inhibitor: 10 L, 3 R und 5 G , Nexus: 30 L, Vasall: 3 L, 1 S, respawnen sobald alle tot und 1 G , Gesch&uuml;tz Vasall: 5 L, 3 S, respawnen sobald alle tot und 2 G, Super Vasall: 10 L, 5 S, respawnen sobald alle tot und 3 G, Blue: 5 L, 3 S, 2 R und 3 G, Red 4 L, 3 S,2 R und 3 G, Drake: 10 L, 5 S, 3 R und 5 G, Baron Nashor: 20 L, 10 S, 5 R und 10 G, Gromp: 3 L, 1 S, 1 R und 1 G, Wolfs: 3 L, 1 S, 1 R und 1 G, V&ouml;gel: 3 L, 1 S, 1 R und 1 G, Golems: 3 L, 1 S, 1 R und 1 G, Champion: 10 L, 1 S, 3 R und 5 G.\r\nLegende: L: Leben, S: Schaden, R: Respawn Zeit, G: Gold, FP: F&auml;higkeits Punkt, FA: F&auml;higkeits Angriff","replies":[{"poster":"Zulwar","date":"2016-01-15T10:14:33.804+0000","up_votes":2,"down_votes":0,"body":"Ich finde deine Idee nicht schlecht. Aber wenn ich ein Spiel wie LOL als Brettspiel vermarkten möchte, würde ich es so ähnlich aufbauen wie es bei Wahrhammer 40k ist. Dies ist zwar deutlich komplizierter und auch schwer umzusetzen, aber du könntest dadurch die Werte von LOL vielleicht sogar übernehmen. Zum anderen kann man so auch gut die Champions die es in LOL gibt, dort zu implementieren. Denn ich denke, das die Leute die das kaufen würden, ihre Lieblingschampions auch gerne nehmen möchten mit ihren Fähigkeiten und so.\nFalls du Wahrhammer 40k nicht kennst, schau es dir mal an, vielleicht kann dich das inspirieren.","replies":[]},{"poster":"CooL Ice Tea","date":"2016-01-15T07:38:36.995+0000","up_votes":2,"down_votes":0,"body":"Riesiger Wall of text mit vielen Zahlen am Ende und alles ohne eine Art sortierung -> wird nicht gelesen, sorry ;/ auch wenn ich interesse hatte.","replies":[]},{"poster":"Doenerlord","date":"2016-01-15T07:03:21.303+0000","up_votes":2,"down_votes":0,"body":"Ich denke, wenn man sowas wie LoL in ein Brettspiel verwandeln will, dann muss man das irgendwie vereinfachen und vielleicht braucht man ein ganz anderes Spielsystem.\nDeine Idee hört sich für mich ein wenig so an, wie die Autorennen, die man als Kind immer mit Matchbox Autos gemacht hat...\nAlle Autos immer wieder nach und nach ein Stückchen nach vorne schieben xD\nIm Grunde hast du ja keine wirkliche Brettspielidee gepostet, sondern nur eine ungefähre Beschreibung von LoL, nur eben mit anderen Werten und Einheiten.\nAußerdem wird aus der Beschreibung nicht ersichtlich, wie die Kämpfe gehen sollen, um die es doch offenbar geht und ein Spielziel habe ich auch nicht gesehen.\nDa du geschrieben hast\n> Die Minimap sowie die Spielfiguren muss man sich selber bauen\n\ndenke ich nicht, dass es sich um ein wirklich lohnenswertes Spiel handelt.\nVielleicht liegt es nur an deiner etwas wirren Weise es zu erklären, aber ich glaube, wenn du wirklich Spiele entwerfen willst, musst du dir etwas besseres einfallen lassen, als einfach ein Computerspiel zu kopieren und ein paar schwer verständliche Regeln dazuzuschreiben.\nIch hoffe du fasst das als konstruktive Kritik auf und bist nicht beleidigt :D\n\nGruß,\nDoenerlord","replies":[]},{"poster":"CaptAim Hook","date":"2016-01-13T18:41:52.622+0000","up_votes":2,"down_votes":6,"body":"Würde aufpassen, hier deine Idee zu posten kann riskant sein, wenn sie einer gut findet kopiert er die und bringt sie selber raus. :/","replies":[{"poster":"CooL Ice Tea","date":"2016-01-15T07:36:29.238+0000","up_votes":3,"down_votes":0,"body":"Dürfte wohl auser Riot keiner Rechte dran haben. Auser man nennt es DragonArena und baut auf diesr Anleitung heir sein Spiel auf.","replies":[]}]},{"poster":"Force Master 12","date":"2016-01-14T17:32:24.098+0000","up_votes":1,"down_votes":1,"body":"Ja aber als ich sie zu Riot geschickt habe haben die mir gesagt anders geht das nicht.","replies":[]}]}