{"poster":"SpahlReformed","date":"2016-03-03T21:36:15.743+0000","title":"Ungerechtfertigter Permabann (imo)","subforum":"Hilfe & Support","embed":{"description":null,"url":"http://prntscr.com/aauoel","image":null},"up_votes":1,"down_votes":2,"body":"Ich habe vor ein paar tagen einen permanenten bann auf meinem account erhalten. Diesen mit der Begr&uuml;ndung &quot;Toxic Behaviour&quot;. Soweit so gut, ist auch nicht mein erster. Aber ein paar kollegen, die mir auch immer sagten als ich toxic war und ich sind der meinung, dass dies schwachsinn sei. Ich habe mich nach dem letzten permabann wirklich gebessert, und versucht immer freundlich im spiel drinnen zu bleiben. Weil mich der Permabann so hart trifft, mach ich mir die arbeit hier einen text zu schreiben. Ich habe keinen Plan wof&uuml;r ich jetzt noch leben sollte (das klingt verr&uuml;ckt), nachdem ich soviel zeit und herzblut in dieses spiel investiert habe (einen neuen account ohne runen champs etc hochzuspielen, kommt nicht in frage), und finde keine erf&uuml;llung in meinem leben. nicht weil ich asozial bin, oder mich nicht in eine gesellschaft integrieren kann, sondern lediglich dadurch, dass dieses spiel ein gro&szlig;er teil meines lebens war. Ich wette pro tag f&uuml;r ungef&auml;hr 100 euro auf sport (was vielleicht keinen interessieren mag), seit ich gebannt bin, aber nicht weil ich s&uuml;chtig danach bin, sondern weil ich verzweifelt nach etwas suche, was meinen gebannten account ersetzen k&ouml;nnte. Geld oder alles was wertvoll sein mag, hat f&uuml;r mich keinen wert mehr. ich habe keinen an den ich mich wenden k&ouml;nnte, klar k&ouml;nnen mir kollegen zureden, und auch meine eltern w&auml;ren interessiert mir zu helfen. Mit meinem Problem stehe ich aber letztendlich alleine da, weil es sowieso keiner wirklich verstehen w&uuml;rde.\r\nUnd nun frage ich mich wieso das alles, weil ich in einem game 1 EINZIGE BELEIDIGUNG geschrieben habe mit &quot;our jungler sucks&quot; und das nachdem dieser mit 0-9 intentional gefeedet hat, und die nachricht nichtmal gelesen hat, weil er zu diesem zeitpunkt geraquequittet war. Nichtmal strafrechtlich gesehen w&auml;re das eine geistige verletzung eines anderen sondern lediglich das l&auml;stern hinter dem r&uuml;cken des betroffenen. comeon sowas macht jeder. kann sein dass man andere nachrichten auch als toxic interpretiert, allerdings war dies keine einzige davon, geht bitte wen ihr die screens lest mit einer neutralen meinung ran. Und nun verliere ich den sinn in meinem leben wegen eines systems das joket\r\nganz gro&szlig;es tennis freunde :((((((","replies":[{"poster":"Sree","date":"2016-03-04T09:56:25.328+0000","up_votes":1,"down_votes":0,"body":"1 [Thread](http://boards.euw.leagueoflegends.com/de/c/spielerverhalten-de/5yfA8Qsv-ungerechtfertigter-permabann-imo) zu dem Thema reicht. Ich mache hier mal zu.","replies":[]},{"poster":"Untouchable ProX","date":"2016-03-03T21:44:37.444+0000","up_votes":2,"down_votes":0,"body":"Man wird nicht wegen einer Beleidigung perma gebannt.\nZuvor musst du auch schon Chat/14Tage bann durchlebt haben.\nWer nur am Flamen ist hat es auch verdient nicht Teil der Community zu sein.","replies":[]},{"poster":"Rainbow Dashie","date":"2016-03-03T23:49:27.752+0000","up_votes":1,"down_votes":0,"body":"Warum unbedingt 2 [Threads?](http://boards.euw.leagueoflegends.com/de/c/spielerverhalten-de/5yfA8Qsv-ungerechtfertigter-permabann-imo)","replies":[]},{"poster":"SpahlReformed","date":"2016-03-03T21:36:49.815+0000","up_votes":1,"down_votes":1,"body":"http://prntscr.com/aauouw\nhttp://prntscr.com/aaup5d\ndies sind die restlichen screenshots \nsorry is mein erster post","replies":[]}]}