{"poster":"BLACKPINK x BTS","date":"2019-01-27T21:39:10.820+0000","title":"Über negatives Verhalten beschwert und deshalb gebannt?","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":9,"body":"Spiele jetzt seit ca. 7 Jahren League of Legends und habe eben meinen ersten Bann erhalten. Ich unterst&uuml;tze das Sofort-Meldesystem und melde manchmal auch Spieler, aber nur wenn es wirklich notwendig ist. Meiner Meinung nach ist meine 14-Tage Sperre nicht notwendig. Folgende Situation, Ich Spiele mit einem Freund von mir der gerade seine zweite Runde League &uuml;berhaupt spielt und nat&uuml;rlich demnach nicht viel Know-How hat. Premade Botlane mit Darius und ich als Renekton. Unsere Gegner Miss Fortune und Soraka, welche nach dem ersten Kill &quot;ez noobs&quot; in den /all-Chat schreiben. Ich antwortete nat&uuml;rlich mit &quot; MF requires 0 skill&quot; und den Rest k&ouml;nnt ihr euch ja denken. Obwohl ich nie oder nur sehr selten flame wollte ich jetzt meinen Freund verteidigen. Im Laufe des Spiels haben wir beide Nexus-T&uuml;rme zerst&ouml;rt aber mein Team interessiert sich lieber f&uuml;r Kills als f&uuml;r den Nexus. Wir waren sowieso nur 4vs5, weil Warwick dauernd auf der Top-Lane nur gefarmt hat und nichts f&uuml;r das Team beigetragen hat. Als ich ihn mehrmals darauf hingewiesen habe udn er sein Spielstil immer noch nicht ver&auml;nderte wurde ich aggro und verwendete sogar CAPS. Nach dem Game, welches wir nat&uuml;rlich verloren haben, weil mein Team nach 12 Minuten ohne gegnerische Nexus-T&uuml;rme nicht beendet hat, habe ich Warwick gefragt ob es zu schwer ist den Nexus anzugeifen udn einfach das Spiel zu beenden. Wurde daraufhin gebannt und wundere mich wie ich mit Ehrungsstufe 5 in S7 und fast Ehrungsstufe 5 in S8 jetzt wegen so etwas gebannt werde. Es war nicht einmal ein Ranked game. Ich verlange jetzt keine Aufhebung meiner Sperre, es regt mich einfach nur auf, dass solche Leute immer noch frei herumlaufen und jetzt im diesem Moment gerade wieder komplett reintrollen oder die Gegner provozieren. Nat&uuml;rlich war mein Verhalten auch schlecht, aber sofort f&uuml;r 14- Tage gebannt zu werden ist meiner Meinung nach zu hart vorallem wenn es der erste Bann ist und ich sonst immer Ehrenhaft spiele. Hatte &uuml;brigens die 3 Spiele davor zusammen 7 Ehrungen, einen Penta-kill mit Ekko und einmal war ich ehrenhaftester Spieler und danach werde ich einfach so wegen der Verwendung des Satzes &quot;could you pls just attack the fu***** Nexus?&quot; gebannt? W&uuml;rde mich &uuml;ber eure Meinung freuen liebe Community. \n{{sticker:zombie-nunu-bummed}}","replies":[{"poster":"DattAshe","date":"2019-01-27T21:41:44.696+0000","up_votes":6,"down_votes":0,"body":"Absätze.\n\n----\n----\n----\n\nChatlogs or it didn't happen.","replies":[]},{"poster":"eingew","date":"2019-01-28T08:08:39.433+0000","up_votes":2,"down_votes":0,"body":"Was noch nicht erwähnt wurde, aber sehr wichtig für dich werden wird: Jetzt kann das kleinste Fehlverhalten bereits zu einem permanenten Ban führen. Es ist also unbedingt notwendig, dass du in nächster Zeit im Chat ruhig bleibst und dich auch nicht zu der kleinsten Negativität hinreißen lässt.\n\nAm einfachsten geht das natürlich, was ich dir generell empfehlen würde, indem du Spieler, die so unnötige Provokationen von sich geben, wie die MF, einfach stumm schaltest und nach dem Spiel meldest. Die kriegen dann schon ihre gerechte Strafe und du hast alles an Verteidigung vorgewiesen, was notwendig ist, ohne auch nur ein einziges Wort in den Chat zu schreiben - und deine Ruhe kriegst du als Bonus oben drauf. Ich zumindest mache das immer so ^^.","replies":[{"poster":"BLACKPINK x BTS","date":"2019-01-28T13:52:04.868+0000","up_votes":1,"down_votes":0,"body":"Danke für deine Rückmeldung. Nach diesem Bann bin ich Ehrungsstufe 0 und habe irgendwas gelesen mit \"keine Belohnungen\" bekommen. Kann ich trotzdem die Erfahrungspunkte bei meinem täglichen Sieg bekommen?","replies":[{"poster":"Pure Cynicism","date":"2019-01-28T17:30:41.172+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=botboterbot,realm=EUW,application-id=KYnfKGf0,discussion-id=XEyzK8z5,comment-id=00050000,timestamp=2019-01-28T13:52:04.868+0000)\n>\n> Danke für deine Rückmeldung. Nach diesem Bann bin ich Ehrungsstufe 0 und habe irgendwas gelesen mit &quot;keine Belohnungen&quot; bekommen. Kann ich trotzdem die Erfahrungspunkte bei meinem täglichen Sieg bekommen?\n\nDu solltest bis Seasonende im Herbst/Winter 2019 wieder auf Ehrenstufe 2 angekommen sein, wenn du einigermaßen regelmäßig spielst, halbwegs freundlich bist und nicht mehr strafbares Verhalten zeigst. Ab da bekommst du dann wieder Belohnungen.","replies":[]}]}]},{"poster":"Izaya Kumiho","date":"2019-01-27T21:56:30.006+0000","up_votes":6,"down_votes":4,"body":">Über negatives Verhalten beschwert und deshalb gebannt?\n\nBevor ich hier auf deinen Thread eingehe, lass mich dir ebend eines erklären:\nWas andere Leute tun, rechtfertigt niemals dein eigenes Verhalten. Überlasse die Strafe immer dem Strafsystem von League und droppe nicht selber auf das niedrige Level von deinem Gegenüber. \n#**Worte sind wie Papierschnitte, Bans sind Knochenbrüche.**\nKaum eine Person wird ihr Verhalten im Internet nur wegen einem bösen Blick ändern, egal was du tust.\n\nSo..\nNun zu deinem Thread..\n\n>Spiele jetzt seit ca. 7 Jahren League of Legends [...]\nMeiner Meinung nach ist meine 14-Tage Sperre nicht notwendig. Folgende Situation, Ich Spiele mit einem Freund von mir der gerade seine zweite Runde League überhaupt spielt und natürlich demnach nicht viel Know-How. Premade Botlane mit Darius und ich als Renekton. Unsere Gegner Miss Fortune und Soraka, welche nach dem ersten Kill \"ez noobs\" in den /all-Chat schreiben. Ich antwortete natürlich mit \" MF requires 0 skill\" und den Rest könnt ihr euch ja denken.\n\nDu lässt dich nach 7 Jahren durch sowas noch triggern? But why?\n\nDas du vor den Augen deines Neulings so reagierst, lässt dich nicht wie ein gutes Vorbild wirken, u know?\n⁻ᶜᵒᵘᵍʰ ⁻ ᶦᶜʰ ᵐᵉᶦᶰᵉ⋅⋅ᵍᵘᵗ, ᵈᵘ ʰᵃˢᵗ ˢᶜʰᵒᶰ ʳᵉᶜʰᵗ ᵐᶦᵗ ᵈᵉʳ ᴹᶠ ⋅⁻ ᶜᵒᵘᵍʰ ⁻⋅⋅ᵃᵇᵉʳ⋅⋅⋅\n\nWichtig ist eher, tiltproof zu bleiben und das auch deinem Freund sofort bei zu bringen. Er soll gar nicht auf die Gegner hören und es muss ihm klar sein, dass das alles nur wertlose Angeberei ist.\n\n>wurde ich aggro und verwendete sogar CAPS.\n\n\n_Noin >:O_\n\nDOCH!\n\n_Ooooh >:O_\n\n\n>Ich verlange jetzt keine Aufhebung meiner Sperre, es regt mich einfach nur auf, dass solche Leute immer noch frei herumlaufen und jetzt im diesem Moment gerade wieder komplett reintrollen oder die Gegner provozieren.\n\n\nJeder bekommt eine Strafe, wenn er für einen Regelbruch zurecht reported worden ist. Vergiss nie, die Reportfunktion zu nutzen!\nKein Report wird ignoriert! Du bekommst nur sehr selten eine Meldung darüber, um die Privatsphäre des Spielers zu schützen.\n\n\n\nUm einen Tempban zu bekommen, musst du entweder davor 2 Chatsperren gehabt haben(10 Games und 25 Games) oder Hassrede genutzt haben.\n\n~~Es ist eher eine Regel, hier die Chatlogs zu posten..ich denke jedoch, dass das heir nicht nötig sein wird.~~\n~~Im Grund hast du es nicht böse gemeint und einfach nur falsch reagiert- was dir auch sicher bewusst ist.~~\n~~Dementsprechend muss ich dir nicht sagen, was an deinem Chatlog nun toxic war und was nicht. ~~\n\n(Nevermind, hast du bereits getan, ich habe die Seite nicht früh genug refreshed. Du hast dir wegen \"fag\" den Tempban eingefangen.)\n\nJedoch würde ich dich bitten, meine Worte von oben ernst zu nehmen.\nFeuer mit Feuer zu bekämpfen, hat in League wenig Sinn.","replies":[{"poster":"BLACKPINK x BTS","date":"2019-01-27T22:08:33.547+0000","up_votes":1,"down_votes":1,"body":"Fand deine Antwort sehr ausführlich, danke. Ich lasse mich durch sowas normalerweise nicht triggern aber wenn offensichtlich ein erfahrener Spieler gegen einen Neuling einen Kill erzählt und dann ez noobs schreibt ist halt bisschen... nicht nett.(um hier nicht auch einen bann zu bekommen sag ich mal „nicht nett“). Ich habe auch erwähnt, dass ich keine Aufhebung will, weil ich bin mir meinen Fehler bewusst aber 14-tage ist halt ziemlich lang vorallem wenn gerade erst die neue Season gestartet hat. 2 Tage oder so hätten auch gereicht, weil „fag“ ist meiner Meinung nach nicht 14 tage wert. Ist kein schönes Wort aber ich denke mal andere Spieler greifen zu härteren Wörtern.","replies":[{"poster":"Izaya Kumiho","date":"2019-01-27T22:25:07.244+0000","up_votes":5,"down_votes":3,"body":"> [{quoted}](name=botboterbot,realm=EUW,application-id=KYnfKGf0,discussion-id=XEyzK8z5,comment-id=00020000,timestamp=2019-01-27T22:08:33.547+0000)\n>\n> Fand deine Antwort sehr ausführlich, danke. Ich lasse mich durch sowas normalerweise nicht triggern aber wenn offensichtlich ein erfahrener Spieler gegen einen Neuling einen Kill erzählt und dann ez noobs schreibt ist halt bisschen... nicht nett.(um hier nicht auch einen bann zu bekommen sag ich mal „nicht nett“). Ich habe auch erwähnt, dass ich keine Aufhebung will, weil ich bin mir meinen Fehler bewusst aber 14-tage ist halt ziemlich lang vorallem wenn gerade erst die neue Season gestartet hat. 2 Tage oder so hätten auch gereicht, weil „fag“ ist meiner Meinung nach nicht 14 tage wert. Ist kein schönes Wort aber ich denke mal andere Spieler greifen zu härteren Wörtern.\n\nIch kann deinen Frust verstehen, jedoch steht \"Fag\" für \"Faggot\", was übersetzt eine \"Schwuchtel\" sein soll. Das fällt unter Hassrede (Schwulenfeindlichkeit), welche Riot mit 0 Toleranz und dem Tempban bestraft. Deine Wortwahl war ebend...\"unglücklich gewählt\", wenn ich das so sagen darf.\n\nUnd nur weil andere Leute zu härten Wörtern greifen, musst du das doch nicht auch tun. Du kannst die Leute auch ohne Schimpfwörter fertig machen...\n\n...nicht das ich das empfehlen würde...\n....","replies":[{"poster":"BLACKPINK x BTS","date":"2019-01-27T23:06:51.632+0000","up_votes":7,"down_votes":4,"body":"Es ist peinlich das zuzugeben, aber ich dachte „faggot“ bedeutet einfach nur „idiot“ aber etwas negativer ausgedrückt. Man lernt nie aus und jetzt sehe ich meinen bann auch gerechtfertigt.","replies":[{"poster":"Abasin","date":"2019-01-28T09:37:41.805+0000","up_votes":1,"down_votes":6,"body":"> aber ich dachte „faggot“ bedeutet einfach nur „idiot“\n\n{{sticker:zombie-brand-facepalm}}\n\nDafür noch Upvotes zu kriegen ist mir echt unverständlich.","replies":[{"poster":"BLACKPINK x BTS","date":"2019-01-28T13:59:38.752+0000","up_votes":1,"down_votes":1,"body":"Ich wusste es nicht, aber mich für meine Unwissenheit zu kritisieren ist eher unverständlich. Es ist doch besser wenn das Upvotes bekommt, denn vielleicht wissen es andere Leute auch nicht und werden in Zukunft auch dieses Wort vermeiden. :)","replies":[{"poster":"Abasin","date":"2019-01-28T14:44:37.841+0000","up_votes":1,"down_votes":0,"body":"Es wollen sich viel zu viele Leute mit Unwissenheit rausreden. Die Diskussion um das Wort faggot in all seinen Variationen existiert bereits seit mehreren Jahren hier und in anderen Foren. Da glaube ich Dir einfach nicht, dass Du in einer solchen Blase der Unwissenheit durchs Leben ziehst.","replies":[{"poster":"Angel Ayume","date":"2019-01-28T20:13:13.363+0000","up_votes":2,"down_votes":0,"body":"Na ja ich habe erst von der Existenz und gleichfalls der Bedeutung von Faggot erfahren seit ich hier im Forum lese. Und da auch nicht sofort. Und das obwohl ich seit über 10 Jahren online Spiele spiele. \nSo abwegig ist das also gar nicht, dass man die Bedeutung nicht kennt.","replies":[{"poster":"Darkr3sQ","date":"2019-01-29T05:46:45.299+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Angel Ayume,realm=EUW,application-id=KYnfKGf0,discussion-id=XEyzK8z5,comment-id=00020000000000000000000000000000,timestamp=2019-01-28T20:13:13.363+0000)\n>\n> Na ja ich habe erst von der Existenz und gleichfalls der Bedeutung von Faggot erfahren seit ich hier im Forum lese. Und da auch nicht sofort. Und das obwohl ich seit über 10 Jahren online Spiele spiele. \n> So abwegig ist das also gar nicht, dass man die Bedeutung nicht kennt.\n\nDas mag durchaus sein.\nAllerdings - und das verstehe ich nicht - wieso Menschen einfach irgendwelche Worte schreiben deren Bedeutung sie nicht kennen, und sich dann über Konsequenzen wundern. Eine kurze Google-Suche gibt aufschluss darüber, und das sollte eigentlich nicht zu viel verlangt sein, bevor man so eine  Beleidigung - und dass der TE die Intention zum Beleidigen hatte zeigt der Umstand, dass er in Fag Idiot hinein interpretiert hat - schreibt, sollte man zumindest kurz mal nachschauen, was sie bedeuten könnte.","replies":[{"poster":"Angel Ayume","date":"2019-01-29T12:54:40.670+0000","up_votes":2,"down_votes":0,"body":"Ja, einfach ein Wort nachplappern und einfach vermuten, dass es Idiot bedeutet verstehe ich auch nicht. \n\nEs könnte aber auch einfach sein, dass ihm jemand gesagt hat, dass es Idiot bedeutet, weil der das einfach nicht besser weiß. Und wenn du der Aussage vertraust, dann schreibst du sowas natürlich auch in dem Glauben, dass es \"nur\" Idiot bedeutet. \n\nIch will jetzt damit nicht sagen, dass die die hier sagen sie wissen nichts von der Bedeutung auch immer die Wahrheit sagen, sondern will nur sagen, dass es durchaus so sein kann. Man sollte halt nicht immer an den Aussagen von manchen Spielern zweifeln. Und der TE hat jetzt keinen übelst schlimmen toxischen Chatlog, weswegen zumindest ich gewillt bin ihm dahingehend zu glauben, dass er wirklich nicht die wahre Bedeutung von Faggot kannte. \n\nZudem kam es ehrlich rüber, als er meinte, dass er zugeben muss, dass er die falsche Bedeutung kannte UND dann sogar verstanden hat, dass der Bann dann gerechtfertigt ist und das obwohl er es einfach nicht wusste und akzeptiert das hier \"Unwissenheit schützt vor Strafe nicht\" greift.","replies":[]}]}]},{"poster":"eingew","date":"2019-01-29T07:53:46.983+0000","up_votes":1,"down_votes":0,"body":"Seine Strafe akzeptiert er ja trotzdem, ob er sich wirklich rausreden will (auf einer moralischen Ebene also), wissen wir doch gar nicht.","replies":[]}]}]},{"poster":"eingew","date":"2019-01-29T07:52:54.219+0000","up_votes":2,"down_votes":0,"body":"Ich finde es gut, Fehler einzusehen und zuzugeben, nur daraus kann man wachsen und dafür habe ich dem TE auch ein Upvote gegeben.","replies":[]}]}]}]}]},{"poster":"PlsLoLMMO","date":"2019-01-28T00:59:49.251+0000","up_votes":1,"down_votes":1,"body":"> Jeder bekommt eine Strafe, wenn er für einen Regelbruch zurecht reported worden ist. Vergiss nie, die Reportfunktion zu nutzen!\n\nWäre echt schön wenns stimmt :(","replies":[{"poster":"BLACKPINK x BTS","date":"2019-01-28T13:57:48.295+0000","up_votes":2,"down_votes":0,"body":"Stimmt doch, hast du ja bei mir gesehen. Regeln gebrochen und nicht mal eine Stunde später gebannt.","replies":[]}]}]},{"poster":"BLACKPINK x BTS","date":"2019-01-27T21:47:41.565+0000","up_votes":1,"down_votes":1,"body":"Game 1\nPre-Game\nbotboterbot: mid\nbotboterbot: I said mid first but okay i will go bot :)\nbotboterbot: yea\nbotboterbot: adc\nbotboterbot: zerexe bot\nbotboterbot: lukas jungle\n\nIn-Game\nbotboterbot: premade\nbotboterbot: and bc you tryhard and we are trolling\nbotboterbot: renek+darius vs mf and sora is a bit unfair dont you think\nbotboterbot: you are right not unfair cause  we are still winning lol\nbotboterbot: 0 skill required\nbotboterbot: mf\nbotboterbot: after this sentence i can guess your rank and its below iron 1\nbotboterbot: weird felx\nbotboterbot: flex\nbotboterbot: im tryinjg to\nbotboterbot: warwick never follows\nbotboterbot: JUST GO FU* MID\nbotboterbot: YOU FA*\nbotboterbot: i told him to go mid\nbotboterbot: maybe called him fag\n\nPost-Game\nbotboterbot: ....\nbotboterbot: warwick i told u to finish\nbotboterbot: we got both towers at min 29\nbotboterbot: CAN YOU PLS JUST ATTACK THE F* NEXUS","replies":[{"poster":"Abasin","date":"2019-01-28T09:34:44.613+0000","up_votes":1,"down_votes":0,"body":"> botboterbot: YOU FA\nbotboterbot: i told him to go mid\nbotboterbot: maybe called him fag\n\nIn der ersten Zeile angedeutet und dann 2 Zeilen weiter ausgeschrieben. Sehr wahrscheinlich wolltest Du schon oben das Wörtchen fag ausschreiben, aber hast zu früh auf return gedrückt...aber es war ja Zeit zum nachholen.\n\nSo gesehen alles selbst verschuldet. Es geht Dir auch recht gut von der Hand, so dass ich Dir ein \"normal werde ich von sowas nicht getriggert\" einfach nicht glaube. \n\nDein nächster Ausrutscher wird übrigens unweigerlich zum Perma führen, da reicht schon ein kleines \"ez\" oder was ähnliches.","replies":[{"poster":"BLACKPINK x BTS","date":"2019-01-28T13:56:06.960+0000","up_votes":1,"down_votes":0,"body":"Wenn mir so ein Ausrutscher nie mehr passiert, aber einer meiner Teammates mich trotzdem reportet, werde ich dann auch perma gebannt?","replies":[{"poster":"Abasin","date":"2019-01-28T14:40:58.113+0000","up_votes":2,"down_votes":0,"body":"Solange der Report **unbegründet** ist, passiert gar nix.","replies":[]}]}]}]},{"poster":"dugg","date":"2019-01-28T07:57:07.717+0000","up_votes":2,"down_votes":0,"body":"Warum du deinen Ban bekommen hast, wurde bereits erklärt. Dein Chatlog gibt auch bestrafungswürdiges Material preis. Zugegeben nicht wirklich viel, aber bissl ist schon dabei. Allerding ist das auch kein Screenshot, sondern nur eine Kopie und du kannst viel rausstrichen haben.\n\nDer von dir angesprochene Warwick ist LvL 5. D.h. erst ist auch ein Anfänger. Du beschwerst dich, dass deine Gegner \"ez noobs\" schreiben, hast aber im Gegenzug kein Verständnis dafür, dass auch Anfänger in deinem Team ist und gehst ihn an. Zustimmend kann ich sagen, dass \"ez noobs\" nicht nett ist, aber das reported man und muted die Gegner. Bzw. habe ich den All-Chat immer aus. Eben aus diesem Grund. Vorbildlich finde ich dein Verhalten nicht, Beleidigung mit Beleidigungen zu kontern ist auch nicht nett.\n\nIch finde es nur irgendwie komisch, dass du deinen Mate verbal verteidigen möchtest, ihn aber umgekehrt mit einem Meele auf die Botlane schickst, obwohl er blutiger Anfänger ist. Das ist echt nicht so nett.","replies":[]},{"poster":"Raystlin82","date":"2019-01-28T01:19:52.630+0000","up_votes":1,"down_votes":0,"body":"schreib das naechste mal \"gay\" - ich glaub dafuer gibts keine strafe.\n\n/sarkasmus off","replies":[]}]}