{"poster":"the grim reaperr","date":"2019-02-07T12:07:21.159+0000","title":"EL PEOR NERF A AKALI","subforum":"Charlas Generales","up_votes":3,"down_votes":14,"body":"segun mi opinion de jodieron a mi mein que decirles eso de que la w no sirva contra torres es una basura ya el campeon le sacaron lo roto y creo que esta fue la peor actualizacion al campeon y no creo volver a jugarlo","replies":[{"poster":"Salvor","date":"2019-02-07T12:14:40.132+0000","up_votes":9,"down_votes":0,"body":"> jodieron a mi mein\n\nhttps://upload.wikimedia.org/wikipedia/commons/thumb/3/3b/Paris_Tuileries_Garden_Facepalm_statue.jpg/300px-Paris_Tuileries_Garden_Facepalm_statue.jpg\n\n> es una basura ya el campeon **le sacaron lo roto**\n\nhttps://i.imgur.com/9mbuCSo.png?nodirect","replies":[]},{"poster":"StąrDust","date":"2019-02-07T14:47:13.689+0000","up_votes":7,"down_votes":1,"body":"Bien merecido el Nerf.","replies":[]},{"poster":"Jonathan Jöestar","date":"2020-02-08T17:34:39.353+0000","up_votes":1,"down_votes":0,"body":"me encanta como la gente dice que tiene merecido los nerfs, que si esta roto y la cosa y estoy seguro de que si algun random lo usa no va a hacer ni mrd, dicen que merece nerf cuando el champ no pasa ya ni el 40% de winrate ...","replies":[]},{"poster":"YoSoyMclovin","date":"2019-12-04T08:33:16.981+0000","up_votes":1,"down_votes":0,"body":"Me parece personalmente si alguien de riot lee esto .-. le comunico que si el nerf de akali estaria bueno que le bajen el CD\n es demaciado la defi la re jodieron :P ni estunea y ademas 20 seg de espera para la W no puedo creer cada 25 seg  recien puedo tradear onda es como decirte te gankean cada 10 segundos por que sos akali nomas es como le tienen bronca de que uno la juegue bien marcas? denle algo si le van a joder el cd aun q sea denle mas AP en ek basico denle invisibilidad real men si va a tener 120 de cd en la defi","replies":[]},{"poster":"HopelessRomantic","date":"2019-02-08T02:26:58.055+0000","up_votes":1,"down_votes":0,"body":"Riot dijo en uno de sus comentarios que iban a nerfear a Akali hasta el piso a propósito, así pueden analizar bien los cons de Akali y ver qué fortes darle en los próximos parches. Lo mismo que pasó con Zoe.","replies":[{"poster":"Nus","date":"2019-02-25T21:25:13.680+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=PissTailsKDAhri,realm=LAS,application-id=v7qsfXsE,discussion-id=oAwEh1p9,comment-id=0008,timestamp=2019-02-08T02:26:58.055+0000)\n>\n> Riot dijo en uno de sus comentarios que iban a nerfear a Akali hasta el piso a propósito, así pueden analizar bien los cons de Akali y ver qué fortes darle en los próximos parches. Lo mismo que pasó con Zoe.\n\nEnserio?? me estas dando muchas esperanzas si es verdad lo que decis","replies":[]}]},{"poster":"aleex5","date":"2019-02-22T00:06:37.597+0000","up_votes":1,"down_votes":0,"body":"es hora de que usen las manos y la cabeza, con todo los beneficios absurdos que tenia akali, había gente que apenas jugaba el campeón y aun así hacían destrozos","replies":[]},{"poster":"Cr4zyyMix","date":"2019-02-08T01:50:17.358+0000","up_votes":1,"down_votes":0,"body":"totalmente de acuerdo","replies":[]},{"poster":"Font","date":"2019-02-08T01:26:03.011+0000","up_votes":1,"down_votes":0,"body":"See, era uno de mis 3 mains champs mid, LeBlanc, Aatrox y Akali, me mataron a Aatrox y Akali en el mismo patch XD.\n Quiza lo de la W era entendible, aunq realmente me gustaba esa mecanica, pero sacarle la curacion de la q fue demasiado, ahora es un pick extremadamente especifico.  A practicar Syndra y Yasuo en mid ahora u.u","replies":[]},{"poster":"Zindro","date":"2019-02-07T12:34:15.458+0000","up_votes":2,"down_votes":3,"body":"No es el peor nerf. Es solo OTRO nerf del montón.","replies":[{"poster":"Nightmaresparkle","date":"2019-02-07T20:39:13.508+0000","up_votes":1,"down_votes":0,"body":"es uno de los peores desde que le quitaron el silencio a kassadin la W esta bien esa habilidad era estupida pero al curacion en fin los que trabajan en riot no saben nada","replies":[{"poster":"lushoGD","date":"2019-02-07T23:42:47.024+0000","up_votes":1,"down_votes":0,"body":"Los del balance ya dijeron que le van a hacer el tratamiento de zoe.. Nerfearla hasta el piso y despues ir buffandola de a poco, asi que la curacion probablemente vuelva en futuros parches","replies":[]}]}]},{"poster":"Nightmaresparkle","date":"2019-02-07T20:38:10.517+0000","up_votes":1,"down_votes":0,"body":"realmente akali fue cagada desde el rework ya que este tenia el fin solo de llamar la atención de gente nueva y vender skins,  sus nuevas habilidades como la W no van con el juego en si yo soy main de esta campeona desde la  S2 y cuando vi esa  huevada de la W de \"invisibilidad verdadera\" dios que asquerosidad de habilidad  supe que tarde o temprano le harían ese nerf en si  akali la cagaron en el rework ya que esta gente de RIOT lo único que le importa ahora es el dinero  y nada mas.\nAkali lo que necesitaba era simplemente algo como ezreal mejora visual y pulir algo su e  y ya que en la paridad de match estaba bien podía matar pero se la podía parar en seco también, podías matar en torre pero tenias que saber en que momento sino el rival te mataba, podias esconderte en tu W pero también habia campeones que la veía, esa es la paridad  que un camptiene que tener pero los menos que hacen los reworks no saben nada de LOL es mas ni siquiera deben  saber jugar","replies":[]},{"poster":"Patita de Cerdo","date":"2019-02-07T16:58:35.232+0000","up_votes":1,"down_votes":0,"body":"Te haces invisible por mucho tiempo y no te puede detectar ni las torres... \"balanced\"","replies":[]},{"poster":"4avataris","date":"2019-02-07T14:21:31.715+0000","up_votes":2,"down_votes":2,"body":"Personalmente la W me parecía una **dinámica entretenida y diversa**, pero en el fondo encuentro que **esta bien el nerf**, tanto en enfriamiento como para que no se tire a la loca bajo torres en early.\n\nUn cambio que creo podrían hacer:\nQue fuera como la pasiva de {{champion:28}} Evelynn y que se active esa pasiva de la W de Akali después de cierto nivel (o cierta cantidad de kills, que se la gane) para que en late sea divertido, pero no la deje tan fuerte en early.\n-----\nRespecto a la curación de la Q: \nPues, es una lastima, me gustaba (y es que la use hasta de Supp), pero tienen razón, le daba un **sustain infinito** en mid ...lo que si podrían hacer que siguiera **heleando al usarla contra campeones**, para que se arriesgue al intercambio para mantener linea, pero no se cure por golpear minions y monstruos.","replies":[]}]}