{"poster":"341123545652","date":"2018-04-25T00:16:34.058+0000","title":"Live footage of RiotRepertoir openly admitting a serious problem in the game","subforum":"Gameplay","up_votes":45,"down_votes":30,"body":"and proceeding to do absolutely nothing about it for almost 3 months now!\r\n\r\nhttps://imgur.com/a/qVUSY\r\n\r\nits like hey guys you know THAT REALLY SERIOUS PROBLEM PLAGUING OUR GAME RIGHT NOW?\r\n...\r\n....\r\n.....\r\n......\r\nThat game breaking problem that is capable of invalidating certain roles while making certain other roles appear overpowered?\r\n...\r\n....\r\n.....\r\n......\r\nYou know that problem where shields can stack up from like 10 different sources, alot of which are passive and dont even require any player action or involvement but also alot of other sources which are actives, have no cd, are point and click, and can _**instantly**_ shield a champion for over 1k combined shields?\r\n...\r\n....\r\n.....\r\n......\r\nGuys you know that mechanic in our game that lacks any form of counterplay at all but also requires extremely minimal levels of effort to enable?\r\n...\r\n....\r\n.....\r\n......\r\nYou know, that problem which was promised a solution in 8.6, even earlier I believe, and here we are at 8.9 pbe?\r\n...\r\n...\r\n...\r\n...\r\n...\r\n...\r\n...\r\n...\r\nRiotRepertoir: .....\r\nMeddler: .....\r\n\r\nLets nerf mages tho!","replies":[{"poster":"RiotRepertoir","date":"2018-04-25T19:08:49.606+0000","up_votes":40,"down_votes":12,"body":"The game needs a lot of things. Better exploration around shielding, the champions that utilize shields, and the items that empower shields could get us a lot of gains. We unfortunately didn't come to a good solution that was of appropriate scope to get into the game before midseason, at which point it didn't make sense to try to also squeeze that into midseason efforts.\n\nI understand why that explanation will be unpopular. I also would have preferred we came to a proper solution.","replies":[{"poster":"Shåwn","date":"2018-04-25T19:44:59.078+0000","up_votes":8,"down_votes":1,"body":"> [{quoted}](name=RiotRepertoir,realm=NA,application-id=3ErqAdtq,discussion-id=ApEIEAg9,comment-id=0012,timestamp=2018-04-25T19:08:49.606+0000)\n>\n> The game needs a lot of things.  We unfortunately didn&#x27;t come to a good solution \n> \n>I also would have preferred we came to a proper solution.\n\nIs there any future plan on this problem? Is there potentially any plan to hire assets who can fix this problem? To me it seems that this post is a deja vu of your post in the screenshot.\n\nAlthough it is extremely rude when people all over the game/community call the balance team incompetent, it is situations like this that honestly give them some validity.","replies":[{"poster":"AirKingNeo","date":"2018-04-25T22:29:34.968+0000","up_votes":4,"down_votes":2,"body":"> Although it is extremely rude when people all over the game/community call the balance team incompetent, it is situations like this that honestly give them some validity.\n\nIt isn't extremely rude. If you suck at something you should be told you suck. If you continue to act high and mighty, refusing to learn to be better, people will get angry at you.","replies":[]}]},{"poster":"Kobold","date":"2018-04-26T02:46:25.146+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=RiotRepertoir,realm=NA,application-id=3ErqAdtq,discussion-id=ApEIEAg9,comment-id=0012,timestamp=2018-04-25T19:08:49.606+0000)\n\n>** I understand why that explanation will be unpopular. I also would have preferred we came to a proper solution.**\n\nJust want to point out the wording you have here makes it sound like instead of continuing to look at the issue it is dropped until a much much later date if to be revisited at all.","replies":[]},{"poster":"Shadow Hazard","date":"2018-04-25T19:39:05.921+0000","up_votes":4,"down_votes":2,"body":"What about the potential item solution for anti shielding. One for AP champs and one for AD champs. Or it can be on the 2 grievous wounds items for lowering healing by 40% and dealing increased 40% damage against shields. The existing healers take no new hits, the shielders become less oppressive though. The 2 champs that would realistically HAVE to be addressed after that is sona and taric since they have both on their kits basic abilities, and I know sona especially is in need of help at this time.","replies":[{"poster":"remakoro","date":"2018-04-26T00:57:01.424+0000","up_votes":2,"down_votes":1,"body":"Isnt that the whole point about shields? They hardly get any penalties like healing and kinda more effective short term but they are temporary?","replies":[{"poster":"Shadow Hazard","date":"2018-04-26T01:08:28.695+0000","up_votes":2,"down_votes":0,"body":"Quite a few champs have shields on such low cooldowns that they can maintain them permanently with others having an 80% uptime which is still pretty dam high. They need penalties now frankly.","replies":[]}]}]},{"poster":"AirKingNeo","date":"2018-04-25T22:18:54.531+0000","up_votes":3,"down_votes":3,"body":"Almost every player above diamond fucking 4 has come up with the solution, so why can't you?\n\nNerf shields. Not \"add anti-shield effects\" unless you want to repeat the mistake (that you all refuse to fix) with heal reduction.\n\nand if for some reason you guys can't figure it out, hire me for the price $10,000 a year (that's cheap for a Rioter, right?) and I will watch high tier play and actually discuss with people (not just tell them my plans, an actual conversation) about how to better the game. Then you take the changes I give you, let me test them with some people (for game breakingness, it would be hard to gauge precise balance over that small sample), and then put it into the patch.\n\nGames are more fun when they're more balanced. Games are more competitive when they're balanced. I have no clue why you haven't figured this out. I have no clue why balance doesn't follow this fundamental game design.\n\n> I understand why that explanation will be unpopular. I also would have preferred we came to a proper solution.\n\nConqueror wasn't a proper solution to the tank issue top lane. It's just a bandaid fix to let bruisers duel tanks. People still take Grasp in matchups that aren't against tanks because it wins lane and scales better. Conqueror is shit in a teamfight too, so bruisers **still** cannot teamfight.\n\nIsn't wanting a \"proper solution\" yet releasing Conqueror as an anti-tank bandaid completely contradictory?","replies":[{"poster":"SociopathFriend","date":"2018-04-25T22:41:58.545+0000","up_votes":3,"down_votes":1,"body":"> Almost every player above diamond fucking 4 has come up with the solution, so why can't you?\n\nComing up with *a solution* is not the same as *coming up with a good solution*. Also literally **none** of those players can actually playtest these ideas unless Riot invites them in to do so.","replies":[]},{"poster":"MegaHuff","date":"2018-04-26T16:35:33.196+0000","up_votes":1,"down_votes":0,"body":"I haven't tested it myself, but I hear building conquerer on Wukong can apply the extra damage to his ult. IMO a cyclone with true damage, with its already pretty good damage, is an alright teamfighting tool.","replies":[{"poster":"AirKingNeo","date":"2018-04-26T22:43:41.704+0000","up_votes":1,"down_votes":0,"body":"except you have to be in combat for 4 seconds AND THEN auto attack to activate conqueror","replies":[]}]}]},{"poster":"FCJAAAAGOOOO","date":"2018-04-25T19:46:44.713+0000","up_votes":3,"down_votes":1,"body":"When I was seeing (and saying) the \"10% less damage across the board\" memes earlier this season I thought to myself: \"what if shields were an exception to that and damage was increased versus them instead?  LIke what if armor/MR was half as effective towards shields?\"","replies":[]},{"poster":"P4 Silent","date":"2018-04-27T10:44:48.018+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=RiotRepertoir,realm=NA,application-id=3ErqAdtq,discussion-id=ApEIEAg9,comment-id=0012,timestamp=2018-04-25T19:08:49.606+0000)\n>\n> The game needs a lot of things. Better exploration around shielding, the champions that utilize shields, and the items that empower shields could get us a lot of gains. We unfortunately didn&#x27;t come to a good solution that was of appropriate scope to get into the game before midseason, at which point it didn&#x27;t make sense to try to also squeeze that into midseason efforts.\n> \n> I understand why that explanation will be unpopular. I also would have preferred we came to a proper solution.\n\nhttps://imgur.com/NdxiVJh\nI don't understand why this match game will be popular.\nI also would have preferred you came to a proper solution.{{sticker:slayer-pantheon-popcorn}}","replies":[]},{"poster":"VoraciousX","date":"2018-04-27T05:48:13.683+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=RiotRepertoir,realm=NA,application-id=3ErqAdtq,discussion-id=ApEIEAg9,comment-id=0012,timestamp=2018-04-25T19:08:49.606+0000)\n>\n> The game needs a lot of things. Better exploration around shielding, the champions that utilize shields, and the items that empower shields could get us a lot of gains. We unfortunately didn&#x27;t come to a good solution that was of appropriate scope to get into the game before midseason, at which point it didn&#x27;t make sense to try to also squeeze that into midseason efforts.\n> \n> I understand why that explanation will be unpopular. I also would have preferred we came to a proper solution.\n\nJust remove heal and shield power and make enchanters build AP again. The heals and shields weren't a problem until Riot added items that give enchanters tank stats while also making their heals and shields better than if they built straight up AP unless they built straight up AP(even ignoring support item) and also managed to afford a Rabadons and even then there's no telling if it's a better shield or not.\n\nHeal and shield power is the problem. First off, they increase healing and shielding while also giving bruiser stats to enchanters, making them harder to kill. Second, they also amplify their own actives/passives, so each one makes the other items you build stronger. Make supports build items for their actives, instead of having them build everything that just makes itself better by building the next item.","replies":[]},{"poster":"sho ayane","date":"2018-04-27T03:49:39.629+0000","up_votes":1,"down_votes":0,"body":"Many champions depend on their own inate shields in order to survive. Adding an item to help destroy shields to kill the adc would be a good idea, however wouldn't that be bad on champions that have their own shields like Shen, Poppy or Diana to name a few?\n\nIf this happens, wouldn't we end up in a healing meta after that, with Soraka, and Nami healing the adc which then would probably be considered broken at that point and therefore would warrant buffs to anti healing items and favouring laners with inate sustain rather than shielding.\n\nMy point is to tread carefully please :)","replies":[]}]},{"poster":"Alex h8721","date":"2018-04-25T00:24:09.092+0000","up_votes":26,"down_votes":1,"body":"But they reworked {{champion:39}}  around 8.6 lol, she has an anti-shield passive lol.\n\nSo they put a counter to shielding in the game lol.\n\n(kill me)","replies":[{"poster":"LVL99 Helper TK","date":"2018-04-25T02:26:30.184+0000","up_votes":10,"down_votes":1,"body":"> [{quoted}](name=Alex h8721,realm=NA,application-id=3ErqAdtq,discussion-id=ApEIEAg9,comment-id=0001,timestamp=2018-04-25T00:24:09.092+0000)\n>\n> But they reworked {{champion:39}}  around 8.6 lol, she has an anti-shield passive lol.\n> \n> So they put a counter to shielding in the game lol.\n> \n> (kill me)\n\nand then hot-fix-gutted her 12 hours after release","replies":[]},{"poster":"Danjeng","date":"2018-04-25T00:56:03.269+0000","up_votes":1,"down_votes":12,"body":"ADC's are fine lol. Just pick Rammus. A counter to auto attacking the game. Problem solved.","replies":[{"poster":"Neptunia xoxo","date":"2018-04-25T15:01:13.594+0000","up_votes":7,"down_votes":0,"body":"> [{quoted}](name=Danjeng,realm=NA,application-id=3ErqAdtq,discussion-id=ApEIEAg9,comment-id=00010000,timestamp=2018-04-25T00:56:03.269+0000)\n>\n> ADC&#x27;s are fine lol. Just pick Rammus. A counter to auto attacking the game. Problem solved.\n\nRammus is not even doing that good right now because of the nerf to his JG clear and thornmail not being as strong as it used to be back then. If you have IE last whisper and some lifesteal then Rammus becomes useless and ontop of that hes very easy to kite.","replies":[{"poster":"GigglesO","date":"2018-04-25T21:55:26.580+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Fk me Ahri,realm=NA,application-id=3ErqAdtq,discussion-id=ApEIEAg9,comment-id=000100000001,timestamp=2018-04-25T15:01:13.594+0000)\n>\n> Rammus is not even doing that good right now because of the nerf to his JG clear and thornmail not being as strong as it used to be back then. If you have IE last whisper and some lifesteal then Rammus becomes useless and ontop of that hes very easy to kite.\n\nRammus used to hard win against adc's... now he can't even do that... whats the point of playing?","replies":[]}]}]},{"poster":"Ultîma","date":"2018-04-25T17:33:58.115+0000","up_votes":2,"down_votes":0,"body":"I kind of wish they'd give a few champions a pass to give them shield-busting mechanics kind of like how they gave Singed the Grounding effect after Cass' rework. Just spit-balling since I'm not the best positioned person to talk about individual balance of these champions, but I think it'd be neat if Brittle had a similar as Irelia's passive against shields. Or if {{champion:161}}'s passive dealt bonus damage to shielded targets once researched. Or maybe that's something they could look into adding to {{champion:6}} since he's outclassed by other Juggernauts at the moment.","replies":[]}]},{"poster":"ZJD123","date":"2018-04-25T02:41:23.819+0000","up_votes":19,"down_votes":2,"body":"Funny how addressing shields would have been like the best way to buff assassins instead of w/e clown fiesta strategies they have chosen to take instead.","replies":[{"poster":"remakoro","date":"2018-04-25T21:38:49.546+0000","up_votes":6,"down_votes":0,"body":"Even if they remove every character with shields from the game.  Next things you will be crying about tanky supports stunlocking your dumb ass.","replies":[{"poster":"ChaddyFantome","date":"2018-04-25T23:05:01.677+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=remakoro,realm=EUNE,application-id=3ErqAdtq,discussion-id=ApEIEAg9,comment-id=00080000,timestamp=2018-04-25T21:38:49.546+0000)\n>\n> Even if they remove every character with shields from the game.  Next things you will be crying about tanky supports stunlocking your dumb ass.\n\nthis","replies":[]}]}]},{"poster":"k wìx","date":"2018-04-25T02:25:31.087+0000","up_votes":14,"down_votes":0,"body":"Telling y'all right now... The solution to shields is to make them naturally decay over time. Adds a nice skill gate, and doesn't make shields garbage. Worried about stacking? Each shield has it's own decay... So double shielding means it goes down twice as fast.","replies":[{"poster":"Automated Riven","date":"2018-04-25T02:43:59.103+0000","up_votes":5,"down_votes":6,"body":"I disagree. The solution to shields is simply to drastically reduce the duration. From all the durations downtown 1.5 seconds. They should be reactionary and used to block high burst damage. Not block all the fucking damage in the game. Decay wouldn't help enough.","replies":[{"poster":"DestructoDave","date":"2018-04-25T02:59:37.758+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Automated Riven,realm=NA,application-id=3ErqAdtq,discussion-id=ApEIEAg9,comment-id=00050000,timestamp=2018-04-25T02:43:59.103+0000)\n>\n> I disagree. The solution to shields is simply to drastically reduce the duration. From all the durations downtown 1.5 seconds. They should be reactionary and used to block high burst damage. Not block all the fucking damage in the game. Decay wouldn&#x27;t help enough.\n\nOr an item. I personally like the fact people are rewarded for breaking from their cookie cutter builds to get something else. How many games do you have that the ADC never builds an executioner with 3+ healers on the other team? A lot. Counter-buys are good things.","replies":[{"poster":"Automated Riven","date":"2018-04-25T03:07:13.284+0000","up_votes":3,"down_votes":4,"body":"Counterbuys often lead to champions being useless. That's the specific reason why crucible doesn't remove suppressions. Because it would remove malz from the game entirely. 1 person able to remove jannas and Lulu and karma's ability to shield a high priority target in a fight would completely remove them from the support roster. Specifically cause good players would simply pick it up on supports and invalidate the other ones. Considering that supports only need one big ticket item and everything else is situational. (enchanters need either redemption or {heal attackspeed on hit buff item} and tank supports only need locket) and then building an item which invalidates the other support would be perfectly fine. \n\nBalancing shields to require skill would be far better then blatantly busting them.","replies":[{"poster":"Pokemonred200","date":"2018-04-25T03:17:07.048+0000","up_votes":4,"down_votes":0,"body":"'heal attackspeed on hit buff item'\n\nArdent Censer.\n\nI would rather a reduced shield duration item than a shield busting item though, because it'll either work too poorly, or work far too well.","replies":[]}]}]}]},{"poster":"hhaavviikk","date":"2018-04-25T12:34:38.143+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=k wìx,realm=NA,application-id=3ErqAdtq,discussion-id=ApEIEAg9,comment-id=0005,timestamp=2018-04-25T02:25:31.087+0000)\n>\n> Telling y&#x27;all right now... The solution to shields is to make them naturally decay over time. Adds a nice skill gate, and doesn&#x27;t make shields garbage. Worried about stacking? Each shield has it&#x27;s own decay... So double shielding means it goes down twice as fast.\n\nthat sounds like heals but worse, I'd rather them decrease the duration then instead of getting worse heals","replies":[]}]},{"poster":"LVL99 Helper TK","date":"2018-04-25T02:25:57.548+0000","up_votes":10,"down_votes":2,"body":"BETTER NERF MAGES OMEGALUL","replies":[]},{"poster":"Wulf Helhammer","date":"2018-04-25T01:39:03.360+0000","up_votes":17,"down_votes":26,"body":"> Looking into some heal/shield stuff for the 8.6 cycle. Unsure what the outcome will be\n\nThat’s not a guarantee. That’s a hesitant possibility. \n\nIt’s very possible that the things they thought would work ended up completely  invalidating the entire concepts of shields. Maybe not. The point is that no one knows how this stuff went in testing.\n\nPosts like these that twist rioter’s words into outright promises are why they are hesitant to share *anything* with us, because someone will do what you just did with this post.","replies":[{"poster":"341123545652","date":"2018-04-25T02:39:00.696+0000","up_votes":16,"down_votes":8,"body":"> [{quoted}](name= Król Wilk Sam,realm=NA,application-id=3ErqAdtq,discussion-id=ApEIEAg9,comment-id=0003,timestamp=2018-04-25T01:39:03.360+0000)\n>\n> That’s not a guarantee. That’s a hesitant possibility. \n> \n> It’s very possible that the things they thought would work ended up completely  invalidating the entire concepts of shields. Maybe not. The point is that no one knows how this stuff went in testing.\n> \n> Posts like these that twist rioter’s words into outright promises are why they are hesitant to share *anything* with us, because someone will do what you just did with this post.\n\nI did not twist his words, you did not read my post, and you twisted MY words. \n\nFact #1: I said RiotRepertoir admitted to a serious problem in the game. \nHe did. You can clearly see it in the screenshot\n\nFact #2: I did NOT say RiotRepertoir claimed to 100% guarantee a fix to the problem. Please quote me where I said that? You cannot. I stated he promised to look into it for a solution. After he looked into it, there was not a solution provided. This is merely an observation, a factual one.\n\nIronic you twisted words to villainize me while accusing someone of twisting words right?","replies":[{"poster":"Automated Riven","date":"2018-04-25T02:46:29.917+0000","up_votes":10,"down_votes":14,"body":"Your entire post is accusatory and which hunting. You can't claim that you are completely innocent here because your entire post is structured in such a way that it paints riot as liars.","replies":[{"poster":"341123545652","date":"2018-04-25T02:52:37.268+0000","up_votes":11,"down_votes":8,"body":"> [{quoted}](name=Automated Riven,realm=NA,application-id=3ErqAdtq,discussion-id=ApEIEAg9,comment-id=000300000000,timestamp=2018-04-25T02:46:29.917+0000)\n>\n> Your entire post is accusatory and which hunting. You can&#x27;t claim that you are completely innocent here because your entire post is structured in such a way that it paints riot as liars.\n\nPlease quote where I call Riot liars? Oh right you cannot quote it or prove it because that is _**your interpretation**_ not a fact. Just because you interpret the post in your perspective as me accusing them to be liars , does not make it a reality that I am doing so. \n\nExample:\nOthers could interpret the post as a mage circlejerk. \nOthers may interpret it as a assassin main whining for buffs.\nOthers may interpret it as a janna/lulu hate thread\nOthers may interpret it as a ADC hate thread.\n\nJust because you interpret it in such a way, does not make it that way. You have a seriously twisted view on reality friend. \n\nThe aims of my original post are two simple facts. RiotRepertoir admitted to a certain problem. He did not act on the problem. Thats it, thats the goal of my post, thats the intent of my post. What you interpret it as, I dont care.","replies":[{"poster":"Akali is SO HOT","date":"2018-04-25T05:29:08.079+0000","up_votes":12,"down_votes":5,"body":"I think what he's trying to say is that you are coming off as a jackass in your post and it isn't really providing anything of value the way it's structured other than trying to make Rioters feel bad.\n\nWhich is correct.","replies":[{"poster":"341123545652","date":"2018-04-25T17:02:18.261+0000","up_votes":3,"down_votes":4,"body":"> [{quoted}](name=Akali is SO HOT,realm=NA,application-id=3ErqAdtq,discussion-id=ApEIEAg9,comment-id=00030000000000000001,timestamp=2018-04-25T05:29:08.079+0000)\n>\n> I think what he&#x27;s trying to say is that you are coming off as a jackass in your post and it isn&#x27;t really providing anything of value the way it&#x27;s structured other than trying to make Rioters feel bad.\n> \n> Which is correct.\n\nIts not correct just because you think it is. The goal of my post was to remind not only the community but also the stellar live design team that a serious problem in their game still exists. That to me is something of value. Just because it isnt something of value to you, does not make it a factual statement that it isnt something of value to everyone. 24 people upvoted my post and 11 downvoted it. So an example of a factual statement would be: the majority disagree with you and agree with me. There is also another post on the front page of boards where the OP talks about players stating their _**opinions**_ as facts. I highly suggest you check it out, it may be beneficial to you personally.","replies":[{"poster":"Akali is SO HOT","date":"2018-04-25T19:30:23.694+0000","up_votes":4,"down_votes":6,"body":"It doesn't matter what you're talking about.  You can be stating all the facts you want, but that doesn't give you the right to come off as a jackass.  I agree that shields are a problem and Riot said they were looking into a solution.  There is a better way to word your post instead of being a jackass about it.","replies":[{"poster":"341123545652","date":"2018-04-25T19:35:16.219+0000","up_votes":6,"down_votes":3,"body":"> [{quoted}](name=Akali is SO HOT,realm=NA,application-id=3ErqAdtq,discussion-id=ApEIEAg9,comment-id=0003000000000000000100010000,timestamp=2018-04-25T19:30:23.694+0000)\n>\n> It doesn&#x27;t matter what you&#x27;re talking about.  You can be stating all the facts you want, but that doesn&#x27;t give you the right to come off as a jackass.  I agree that shields are a problem and Riot said they were looking into a solution.  There is a better way to word your post instead of being a jackass about it.\n\nI do not believe that I came off as a jackass, I believe I am resurfacing (once again) a serious problem with an aggressive tone in the post. Just because you believe I came off as a jackass, does not mean everybody is going to see it that way. If you do feel offended that I was a \"jackass\" to you then I am sorry about that. But other than that theres nothing else I can do for you in that regard.","replies":[]}]}]},{"poster":"TeCoolMage","date":"2018-04-25T16:24:35.835+0000","up_votes":4,"down_votes":3,"body":"Akali so hot finding the right words where no one else can","replies":[]}]},{"poster":"Automated Riven","date":"2018-04-25T03:08:53.532+0000","up_votes":8,"down_votes":11,"body":"Again. Your claiming that you not seeing results means he hasn't acted on it. Maybe (for all you know) they have tested hundreds of ideas in the past 2 months and they just haven't found anything they are comfortable shipping. You look really rickity on your high horse up there.","replies":[{"poster":"341123545652","date":"2018-04-25T03:13:08.916+0000","up_votes":9,"down_votes":6,"body":"> [{quoted}](name=Automated Riven,realm=NA,application-id=3ErqAdtq,discussion-id=ApEIEAg9,comment-id=00030000000000000000,timestamp=2018-04-25T03:08:53.532+0000)\n>\n> Again. Your claiming that you not seeing results means he hasn&#x27;t acted on it. Maybe (for all you know) they have tested hundreds of ideas in the past 2 months and they just haven&#x27;t found anything they are comfortable shipping. You look really rickity on your high horse up there.\n\nClaiming that they have actually been working on a solution this whole time and just haven't revealed it yet is a totally fair argument. But I did not claim they arent working on a solution, please show me where I said that. I simply stated its 3 months and there has not been a solution provided to us. That is true, a fact, its 3 months in and a solution hasn't been provided. They certainly could have a solution behind the curtains, ready for us BUT it _**hasnt been provided yet**_. But this argument is certainly a much better and more clear/ fair arguement than the cesspool you posted earlier about me \"witch hunting\" or \"painting riot liars\".\n\nEDIT: And I should add that, the proposed problem itself (that riotrep. admits to) has existed in the game for over a year. So while I do not have any proof that they arent working on a solution, even if I were to make an educated assumption that they arent, would not be such a crazy guess as you suggest.","replies":[]}]}]}]}]}]},{"poster":"Scary Door","date":"2018-04-25T05:36:49.947+0000","up_votes":7,"down_votes":8,"body":"Yes, let's nerf shields, sure.  Let's nerf coordination and punish supports or champions that have shields that are doing their job properly!\n\nIn a game where damage is off the charts let's make sure to nerf the one thing that helps to SLIGHTLY mitigate it.  \n\nIf something doesn't blow up in 1 second then it can't quality as an LC$BigPlay!  \n\nThis *ToasterIQ meta* that has hit the Boards for the last few years is something that needs to be nerfed real hard.","replies":[{"poster":"T4underbolt","date":"2018-04-25T08:10:52.728+0000","up_votes":6,"down_votes":4,"body":"The toasteriq lvl is needed to play shielding supports. There is no interaction. They can be behind and still point and click at ADC and stack million hp shield and cockblock a fed 20/0 assassin without doing anything special. There is no coordination. It's just point and click to win.","replies":[{"poster":"Scary Door","date":"2018-04-25T16:41:15.782+0000","up_votes":5,"down_votes":5,"body":"> [{quoted}](name=T4underbolt,realm=EUW,application-id=3ErqAdtq,discussion-id=ApEIEAg9,comment-id=000a0000,timestamp=2018-04-25T08:10:52.728+0000)\n>\n>stack million hp shield\n\nor, you know, 200hp\n\n>and cockblock a fed 20/0 assassin without doing anything special. \n\nIf someone is 20/0, they're going to kill you regardless of whether or not they have a shield on them.  \n\nHonestly, do you guys think about this stuff before you write it?","replies":[{"poster":"T4underbolt","date":"2018-04-25T17:46:33.824+0000","up_votes":3,"down_votes":3,"body":"Ever heard of metaphor? The shields, heals and peel that e.g. janna provides are so strong that are enough to stop fed assassin. And yes I saw sht like when 8/0 zed gets cockblocked by 0/5 janna who saves her 0/3 adc. and it is happening on daily basis. PLay making in this game is discouraged and comes down to be your adc bitch. If your adc does well you win if not you need at least 3 other people on your team being exteremely fed to have any remote chances of winning.","replies":[{"poster":"Scary Door","date":"2018-04-25T21:23:44.136+0000","up_votes":6,"down_votes":0,"body":"> [{quoted}](name=T4underbolt,realm=EUW,application-id=3ErqAdtq,discussion-id=ApEIEAg9,comment-id=000a000000000002,timestamp=2018-04-25T17:46:33.824+0000)\n>\n> Ever heard of metaphor? \n\nSure, but what was used was called hyperbole on the part I responded to.  \n\n>The shields, heals and peel that e.g. janna provides are so strong that are enough to stop fed assassin. And yes I saw sht like when 8/0 zed gets cockblocked by 0/5 janna who saves her 0/3 adc.\n\nYou say this, but then say this.. \n\n>PLay making in this game is discouraged \n\nSo, in your scenario (for which you have no video evidence) the assassin goes in 1v2 and loses because the Janna did what she was supposed to do, but then you complain about there being no ability to make plays.  I don't know, sounds like the Janna made a great play and saved the adcs life as the support is supposed to do.  I mean, it's supposed to be risky to go in 1v2, is it not?  \n\nNaturally, I can already tell you what you would say if Riot dramatically changed things and Zed did go in for the 1v2, here would be your post, \"Playing support sucks, not impactful at all, the 8/0 Zed comes in and I, as the support, use everything I have to stop him but he just swag walks in, kills my adc and kills me with no counterplay\".  <-- that, by the way, is one of the most common complaints I used to see in season 4 during the height of assassin meta.  So don't even pretend like such posts wouldn't happen.  \n\nI think if you go in 1v2, it should be risky, you clearly see it differently.  \n\nA few years have really changed the community.  Remember when most people would respond by saying \"why are you going in 1v2?\" nowdays it's \"I should be able to solo everyone if I'm ahead\".","replies":[{"poster":"T4underbolt","date":"2018-04-26T07:14:30.258+0000","up_votes":1,"down_votes":3,"body":"ROFL. Please don't spread heresy calling Janna rolling face on a keyboard a play. Comparing to what zed has to do to kill someone nowadays, Janna is a champion that sleeps entire game. Playing Janna and making \"plays\" does not require any skills. Null. The shields need counterplay if they want them to be point and click shield nukes.\n\nAnd I wouldn't complain if the situation was reverted. Actually i AM fine as long as assassin has to do something more than e.g. right click q for oneshot just like rengar does. On one hand he is the only one with khazix to be able to somehow burst through shields but the way he does it has little to no counterplay especially when your team doesn't have shields. So it is bad for him to burst people with no counterplay but it is needed currently with how shields are overloaded. But other assassins that are more skill based like zed, talon have no way to reliably and fast kill someone before shields get stacked or burst through all the shields.","replies":[{"poster":"Snowman Arc","date":"2018-04-26T14:23:16.677+0000","up_votes":2,"down_votes":0,"body":"Plat 5 with 46% winrate, and having never played Janna.\nYou should at least know how the champion works and play with it to have an opinion. If you think Janna is auto-win just because you click E, then I understand why you are 46% winrate.","replies":[{"poster":"T4underbolt","date":"2018-04-26T21:44:06.461+0000","up_votes":1,"down_votes":2,"body":"My winrate was sht from beginning of the season because noobs like you can literally pick any of broken champs like Janna and counter any skillful play I do with one button. We are in the same division and you are playing the most broken champ in the game while I try to play mechanically skillled champions that are not freelo meta. Difference in skill. You would.be mid silver at best without spamming Janna. And it's not even my only account. I was in plat 1 mutliple times on different accounts. Like srsly. Watching your previous season champions. You were picking the most broken and meta champs every time and you didn't even leave gold. And now when Janna is the most broken champ in the game you finally managed to somehow reach plat. Tell me more.","replies":[]}]}]}]}]}]}]}]}]}