{"poster":"Senjan007","date":"2015-07-12T11:41:59.964+0000","title":"ELO HELL","subforum":"Spielerverhalten & Moderation","embed":{"description":"Jedes Match erzählt seine eigene Geschichte; schaue in den neuen Matchverlauf von League of Legends, um zu sehen, wie diese ausgeht, und um andere an deinen Geschichten teilhaben zu lassen!","url":"http://matchhistory.euw.leagueoflegends.com/de/#match-details/EUW1/2197264870/25046664","image":"https://cdn.leagueoflegends.com/match-history/opengraph_icon.jpg"},"up_votes":1,"down_votes":3,"body":"still silver :( V anyone have a tipP :D?? {{champion:53}} {{champion:157}}","replies":[{"poster":"CMan","date":"2015-07-12T12:02:26.254+0000","up_votes":3,"down_votes":0,"body":"In deinen letzten 10 Ranked 4x zweistellige Tode. Das ist viel zu viel. Wenn man zweistellig stirbt, war man verdammt schlecht. Erfahrungsgemäß ist mindestens die Hälfte davon unnötig und vermeidbar\n5x unausgebautes gelbes Trinket. Entsprechend auch häufig zu wenig Wards. Das ausgebaute gelbe Trinket ist das goldeffizienteste Item ingame. Es nicht zu bauen, ist Verschwendung von Potential.\n\nSunfire Cape auf Thresh ist extrem ineffizient. Es ist nicht deine Aufgabe Schaden zu machen, Randuins oder Frozen Heart sind die besseren defensiven Items.\nIm selben Thresh Spiel hast du auch wieder das gelbe Trinket behalten. obwohl du nen Sightstone hast. Das ist ineffizient. Gewöhne dir einfach an, im selben Moment, wo du den Sightstone kaufst, auch das Trinket auszutauschen und das rote einzupacken. Und dann solltest du den Sightstone natürlich auch nutzen. Sieh zu, dass du zu jedem Zeitpunkt 3 Wards auf der Karte hast. (+ Pink!) Die halten in Bronze/Silber oft ewig. Aber deine 16 Wards + 1 Pink in knapp 40 Mins sind viel zu wenig. Da kannst du locker die doppelte Anzahl aufstellen.","replies":[{"poster":"Senjan007","date":"2015-07-12T15:05:20.866+0000","up_votes":1,"down_votes":3,"body":"ich habe mein carry gecarryt aber ok \nund ich wollte damage machen weil wir sowieso am nexus waren das war ja egal ob ich noch damage gemacht habe oder nicht\nmit dem sightstone kann ich es verstehen \nund wir haben keine wards mehr gebraucht den wen der jungler kam gab es ein tripple kill so war es egal und wen  WW seine ult auf tris macht mache ich einfach e und ich gewinne die lane gegen platin spieler ein diamond spieler hat zu mir gesagt du hast das potenzial zum guten spieler","replies":[{"poster":"CMan","date":"2015-07-12T15:11:09.789+0000","up_votes":3,"down_votes":0,"body":"\"keine Wards gebraucht\" gibts nicht. Man braucht IMMER Wards.\n\nUnd wenn deine Bekannten noch so viel erzählen, das bringt nichts. Fakt ist, du bist jetzt meilenweit entfernt von diesen Gefilden. Du hockst in Silber 5, d.h. mehr als die Hälfte aller anderen Spieler ist beser als du. Also musst du dich verbessern, um irgendwann mal in einer Elo anzukommen, wo du dich zu Recht als \"guter Spieler\" bezeichnen kannst.\n\nWas du so alles ingame gemacht hast, kann ich natürlich nicht wissen, da ich nicht dabei war. Ich habe nur deine Stats und Itembuilds und die zeigen eben, dass du da an den genannten Punkten sehr ineffizient vorgehst.","replies":[]}]},{"poster":"Senjan007","date":"2015-07-12T15:07:31.372+0000","up_votes":1,"down_votes":3,"body":"ich habe mein carry gecarryt aber ok \nund ich wollte damage machen weil wir sowieso am nexus waren das war ja egal ob ich noch damage gemacht habe oder nicht\nmit dem sightstone kann ich es verstehen \nund wir haben keine wards mehr gebraucht den wen der jungler kam gab es ein tripple kill so war es egal und wen  WW seine ult auf tris macht mache ich einfach e und ich gewinne die lane gegen platin spieler ein diamond spieler hat zu mir gesagt du hast das potenzial zum guten spieler\ndoch danke für die tipps ich werde sie benutzen","replies":[{"poster":"Kaitri","date":"2015-07-12T20:50:26.353+0000","up_votes":2,"down_votes":0,"body":"das copy paste lol.","replies":[{"poster":"Senjan007","date":"2015-07-14T20:12:59.321+0000","up_votes":1,"down_votes":2,"body":"naja ichwar silber 4 jez bin ich silber 5 gewinne immer meine lane doch 4vs5 oder 2vs5 is unschaffbar{{champion:157}} {{champion:84}}","replies":[{"poster":"Kaitri","date":"2015-07-14T20:24:13.937+0000","up_votes":2,"down_votes":0,"body":"also ich hab schonmal ein 3v5 gewonnen. mythos zerstört!","replies":[{"poster":"Senjan007","date":"2015-07-20T13:39:08.485+0000","up_votes":1,"down_votes":6,"body":"***","replies":[{"poster":"eingew","date":"2015-07-20T20:25:33.752+0000","up_votes":1,"down_votes":0,"body":"Wusstest du, dass Flamer öfter verlieren?\n\nNicht, dass ich wüsste ob du ingame flamest. Aber das Forum ist ein eher ruhiger Ort, an dem man nahezu endlos Zeit hat um zu Antworten. Hier finden Gespräche quasi in Zeitlupe statt. Aber nicht einmal hier schaffst du es dich zu beherrschen. Wie willst du das da ingame schaffen?","replies":[{"poster":"Senjan007","date":"2015-07-21T17:14:38.729+0000","up_votes":1,"down_votes":0,"body":"ingame schreibe ich nich viel da ich mit meiner freundin oder so rede","replies":[]}]},{"poster":"Kaitri","date":"2015-07-20T15:07:29.291+0000","up_votes":1,"down_votes":0,"body":"das ist keine lüge lol.\naber deine ausdrucksweise ist sehr schön.","replies":[]}]}]}]}]}]}]},{"poster":"Synatics","date":"2015-07-22T08:36:30.763+0000","up_votes":1,"down_votes":0,"body":"Ich hab sogar ein 2v5 gewonnen! o: ist zwar ewigkeiten her und auch das einzige mal, aberes war cool :D","replies":[]}]}