{"poster":"MarcoJoe","date":"2016-06-19T20:01:16.849+0000","title":"Visuale mobile? Come si usa?","subforum":"Aiuto e supporto","up_votes":1,"down_votes":1,"body":"Ciao a tutti, vorrei domandarvi **come fate ad usare la visuale mobile**; faccio questa domanda non perch&eacute; io non conosco quali vantaggi usufruisce ma vorrei sapere come fate ad utilizzarla spostando la schermata ad ogni passo, non vi &egrave; difficile? Come fate ad inseguire qualcuno, magari lo dovete attaccare ma dovete sfortunatamente, prima di attaccarlo, bisogna per forza spostare la visuale per evitare che ci sia qualcosa pi&ugrave; avanti. Vorrei imparare anche io ad usarla senza finire per suicidarmi  come uno scemo, consigli ne avete?  {{champion:32}}","replies":[{"poster":"Nicola1511","date":"2016-06-19T21:34:35.302+0000","up_votes":2,"down_votes":0,"body":"Ooooook, forse per una volta possa essere d'aiuto sotto una domanda del forum\n\n{{sticker:slayer-pantheon-thumbs}} \n\nUn po' di tempo fa anche io ho deciso di usare la visuale libera dato che porta indubbiamente vantaggi.\nTutt'ora non sono un gran che ma ti dirò quello che sono riuscito a capire.\n\nPer prima cosa devi fare tante partite in visuale libera, e giocare SOLO con quella, non bloccarla mai in partita per nessun motivo, vita o morte  (meglio perdere imparando che vincere e non imparare niente u.u).\n\nSe proprio fai casino fai qualche personalizzata 1 vs 1 contro un bot, 1/2/3 coop e poi normal.\n\nSe ti perdi troppo in giro premi \"space\" (ma non tenerlo premuto è.è)\n\nRegola la sensibilità con la quale si muove la visuale in modo che ti riesca più comodo (io da 50 l'ho portata a 62)\n\nInoltre io ho disattivato lo \"scorrimento fluido\" (mi da l'ipressione di avere \"l'olio sotto il mouse\" O.o  xD )\n\nCosa più importante (e che ho impiegato un po' a capire) è che non devi cercare di tenere la visuale con il tuo champ al centro (come sarebbe con la visuale fissa), infatti uno dei vantaggi che porta la libera è che, se quella bloccata in lane ti fa vedere anche dietro di te dove sai che non c'è niente, in quella mobile puoi tenere il tuo champ più a lato e vedere meglio cosa fanno gli avversari\n\nSpero di essere stato d'aiuto {{sticker:slayer-jinx-wink}} \n\n\n~~E che si sia capito qualcosa~~","replies":[{"poster":"MarcoJoe","date":"2016-06-19T22:09:34.032+0000","up_votes":1,"down_votes":0,"body":"Grazie mille, mi sei stato molto d'aiuto bro! :D","replies":[]}]},{"poster":"l  Ferox  l","date":"2016-06-19T20:23:39.128+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=MarcoJoe,realm=EUW,application-id=98NGV4Al,discussion-id=EbIJgKAA,comment-id=,timestamp=2016-06-19T20:01:16.849+0000)\n>\n consigli ne avete?  {{champion:32}}\n\nGioca con la visuale libera .. ti serviranno 10/50/100 partite ma prima o poi ti abitui ... io non so come fate a giocare con la visuale fissa invece, le poche volte che ho provato mi dava proprio fastidio a livello visivo ... questione di abitudine :)","replies":[]},{"poster":"Alish Onyx","date":"2016-06-19T20:44:44.780+0000","up_votes":1,"down_votes":0,"body":"Io non la so prorio usare, già sono scarso e devo pensare a non morire, se poi devo anche muovere la visuale..., ho provato qualche volta ad usarla e, a volte crepavo perchè dovevo perdere tempo a muovere la visuale invece di scappare, a volte la muovevo troppo e il champ usciva dallo schermo facendomi perdere l'attimo (con ovvie conseguenze...).\nPoi per me e vermanete difficile dover portare il cursore al bordo dello schermo ogni volta, quando magari sei in un tf e per colpire un bersaglio che magari non è bene in vista (a causa visuale) devi spostarla prima di puntare il cursore sull'obbiettivo, facendoti perdere magari l'attimo opportuno, inoltre mi fa perdere la cognizione dello spazio, nel senso, a volte mi è capitato di essere colpito perchè il nemico mi sembrava più distante e  così mi ero avvicinao troppo.\nQuando hai imparato ad usare un tipo di visuale e difficile abituarsi ad un'altra, se vuoi imparare fallo in normal, perchè all'inizio di porterà a fare tante di quelle papere...\nBasta allenarsi, è questione di abitudine.","replies":[{"poster":"call me pawn","date":"2016-06-19T21:03:34.207+0000","up_votes":1,"down_votes":0,"body":"Esiste lo spazio...","replies":[{"poster":"Alish Onyx","date":"2016-06-19T21:31:21.331+0000","up_votes":1,"down_votes":0,"body":"Lo spazio?\nVeramente, non ho capito","replies":[{"poster":"Nicola1511","date":"2016-06-19T21:37:46.724+0000","up_votes":1,"down_votes":0,"body":"Premendo \"spazio\" centri la visuale sul tuo champ mantenendo la visuale mobile (utile se stai guardando da qualche altra parte lontana, devi guardare in fretta la tua situazione, e non vuoi bloccare la visuale)\n{{sticker:slayer-pantheon-thumbs}}","replies":[]}]}]}]}]}