{"poster":"attila2011","date":"2016-12-21T00:34:06.492+0000","title":"trollllllsssssssssss   STOP","subforum":"Discussioni generali","up_votes":2,"down_votes":3,"body":"In ogni ranked almeno un troll ma non si pu&ograve; fare niente?? E&#039; proprio brutto giocare cos&igrave; , in normal si pu&ograve; capire ma non in ranked. Sicuramente &egrave; gente con pi&ugrave; di un account fate qualcosa","replies":[{"poster":"DoubleT","date":"2016-12-21T00:49:23.058+0000","up_votes":2,"down_votes":4,"body":"Fiato sprecato...Io lo dicevo già dalla scorsa season che le cose sarebbero peggiorate, ovviamente mi prendevo il mio bel carico di -1 e tanti commenti ironici.\n\nLa cosa ormai è endemica, io non riesco più a trovare un team decente, il mio mmr è stato rovinato dai troll e dai nabbi che giocano ranked appena arrivano al 30.\nTutti nel mio team, nell'altro team silver e smurf gold, da me unranked ed ex-bronzo 5.\n\nGG Riot Games...Magari si accorgeranno di dover cambiare il sistema degli mmr un giorno.","replies":[{"poster":"Dr LouD","date":"2016-12-21T08:21:55.911+0000","up_votes":2,"down_votes":1,"body":"Eh si, la Riot ce l'ha con te","replies":[{"poster":"DoubleT","date":"2016-12-21T08:27:10.446+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=ILouD,realm=EUW,application-id=MJVj50Jw,discussion-id=EvIOtUjN,comment-id=00000000,timestamp=2016-12-21T08:21:55.911+0000)\n>\n> Eh si, la Riot ce l&#x27;ha con te\n\nNon dico che ce l'ha con me...dico solo che se LoL è un gioco di squadra, allora si dovrebbero considerare le abilità di ognuno pr fare squadre equilibrate...non mettere gente che non sa giocare insieme a gente che sa giocare.","replies":[{"poster":"Dr LouD","date":"2016-12-21T08:58:49.110+0000","up_votes":2,"down_votes":1,"body":"In ogni elo c'è chi è più forte e chi più scarso della media.\n\nMa capisci da solo (spero) che non c'è un omino che guarda ogni singola partita di ogni singolo giocatore per vedere come gioca ed accoppiarlo con gente simile, il sistema accoppia persone con lo stesso mmr.\n\nMagari un tizio che si è allenano, è diventato più forte e quindi è in salita ha lo stesso mmr di chi era già più in alto ma sta giocando male e quindi sta scendendo. \nPer il sistema però i due hanno lo stesso mmr, quindi vengono matchati insieme.\n\nE no, Lol non è assolutamente pieno di troll, siete voi che appena uno va 0/2 in lane iniziate a sbraitare OMG TROLL RITO REPORT PLZ\n\nPS: Nelle tue ultime 10 partite il team nemico ha avuto in media più bronzi 5/4 del tuo.","replies":[{"poster":"DoubleT","date":"2016-12-21T09:21:25.260+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ILouD,realm=EUW,application-id=MJVj50Jw,discussion-id=EvIOtUjN,comment-id=0000000000000000,timestamp=2016-12-21T08:58:49.110+0000)\n>\n> In ogni elo c&#x27;è chi è più forte e chi più scarso della media.\n> \n> Ma capisci da solo (spero) che non c&#x27;è un omino che guarda ogni singola partita di ogni singolo giocatore per vedere come gioca ed accoppiarlo con gente simile, il sistema accoppia persone con lo stesso mmr.\n> \n> Magari un tizio che si è allenano, è diventato più forte e quindi è in salita ha lo stesso mmr di chi era già più in alto ma sta giocando male e quindi sta scendendo. \n> Per il sistema però i due hanno lo stesso mmr, quindi vengono matchati insieme.\n> \n> E no, Lol non è assolutamente pieno di troll, siete voi che appena uno va 0/2 in lane iniziate a sbraitare OMG TROLL RITO REPORT PLZ\n> \n> PS: Nelle tue ultime 10 partite il team nemico ha avuto in media più bronzi 5/4 del tuo.\n\nPersonalmente mi goco la partita fino alla fine, e cerco di aiutare la squadra anche quando diversi stanno sotto...infatti la frustrazione sta proprio in questo, che incontro gente che grida \"troll\" appena uno sta 0/2 e tilta dopo 5 minuti di game, invece che pensare che si potrebbe recuperare.","replies":[{"poster":"Dr LouD","date":"2016-12-21T09:32:47.218+0000","up_votes":2,"down_votes":1,"body":"Questo perchè sei in elo basso, dove oggettivamente, la gente è scarsa.\nMa come è scarsa nel tuo team, è scarsa uguale nel team avversario.\n\nPuoi uscire dall'elo basso tranquillamente da solo, se ti ci metti un po' più di impegno nello 'studiare' il game imparerai che il modo più semplice di vincere è il giocare intorno agli errori che commettono gli avversari.\n\nHo visto che giochi molto Leona Sona e Zyra.\nSono 3 ottimi champ per solo carriare da supp perchè hanno una cosa fondamentale: puniscono tantissimo gli errori di posizionamento avversari.\n\nSfrutta questa caratteristica per vincere ogni fight, perchè ci sarà SEMPRE chi fa due passi di troppo in avanti e può venir deletato con un tuo buon ingaggio.","replies":[]}]}]}]}]}]},{"poster":"KCM Randagio I","date":"2016-12-21T08:16:58.972+0000","up_votes":2,"down_votes":1,"body":"Guarda è matematicamente impossibile che tu abbia più troll degli altri.. loro ne possono avere 5, tu 4.. perché tu non trolli mai, vinci sempre la linea, carri il mid game..( dato che per voi troll vuol dire anche uno che perde 0 3 ).. fatti forza, pensa positivo , migliora= vinci più di quanto perdi = sali.","replies":[]}]}