{"poster":"SparkytheWildcat","date":"2018-04-25T15:40:19.330+0000","title":"ANNDDDD my smurf got permabanned. I'm done with this game until riot fixes their system","subforum":"Player Behavior","up_votes":1,"down_votes":18,"body":"Reposting this with anonymized names and in the correct board so as to comply with the forum&#039;s rules\n\nSo, I made this smurf because of my main getting a 2 week ban. during that I was basically tilted af and toxic for two reasons. 1. I was mad bc of the ban on my main, and 2. I wanted to prove that their system was broken. I was 10x more toxic on this account than I ever was on my main, but it took me about 3 weeks to get a 2 week ban after flaming quite often (still never doing anything crazy like harrassing someone or telling them to kill themselves or anything), but I basically got away for weeks because I was carrying my teams. Being toxic doesn&#039;t get you banned, making people upset does. If you carry every game and also flame, be negative, and harass your teammates, you won&#039;t get banned. You&#039;ll only get banned if you repeatedly get reported which only happens if you go EXTREMELY toxic or if you cost your team a game. If you have a 100% winrate, you&#039;ll have a 0% ban-rate.\n\nEdit: this why I _created_ the account. this isn't what I was doing during this match and I stopped being toxic on this account after my main got banned. I simply was trying to enjoy some games. The paragraph before is talking about roughly a month ago and doesn't apply to how I was acting on this one recently.\n\nAnyway, this is the chat of the game that got me perma banned on my smurf. I got banned bc I was telling our toxic vi and ashe that they shouldn&#039;t flame someone just because they&#039;re trying and they lose lane. They were flaming our ornn because he died to aatrox (who is a lane bully) 3 times and lost t1 in under 15 minutes. He was trying, we were in norms and he just lost. they just started flaming and calling for enemies to report ornn. I just told them to chill and not flame people for just doing worse than the person they&#039;re laning against, because it happens, on average, to at least 4 out of 10 people every game.\n\nGame 1\nKeyboardMasher97: we&#039;ll see how this ashe is\nKeyboardMasher97: gj\nKeyboardMasher97: no don\nKeyboardMasher97: dont\nKeyboardMasher97: vi just being toxic\nKeyboardMasher97: gj ornn\nKeyboardMasher97: we need that dragon\nKeyboardMasher97: shit\nKeyboardMasher97: no\nKeyboardMasher97: but telling people to report just because they are losing lane is toxic\nKeyboardMasher97: he lost 1 tower\nKeyboardMasher97: wtf\nKeyboardMasher97: so what if he&#039;s bad?\nKeyboardMasher97: jesus\nKeyboardMasher97: you realize someone needs to lose lane, right?\nKeyboardMasher97: pretty much every game, minimum of 4 people lose lane\nKeyboardMasher97: doesn&#039;t mean they should be flamed\nKeyboardMasher97: report vi and ashe for toxicity. flaming everyone\nKeyboardMasher97: and no\nKeyboardMasher97: go play ranked\nKeyboardMasher97: people in norms are practicing champs\nKeyboardMasher97: no\nKeyboardMasher97: enjoy your ban, btw. muted and reported. my main got permad for being 1/4 as toxic as you guys\nKeyboardMasher97: and btw, I guarantee you I (having played ornn once) and our ornn, could go play bots and go 10-0\nKeyboardMasher97: bots don&#039;t help if you know what ur qwe all work\nKeyboardMasher97: but yeah, report ashe and vi for tilting our whole team and ruining the game\nKeyboardMasher97: for?\nKeyboardMasher97: how? game&#039;s over\nKeyboardMasher97: no, bc our team flamed and tilted everyone enjoy urs as well. muted.\nKeyboardMasher97: gg\n\nand here&#039;s the post-game chat:\n\nYou must own the champion in order to earn its mastery chest.\nOrnn: b-\nOrnn: better than me?\nOrnn: stupid ashe?\nVi: lo\nVi: orn losing ccount\nVi: fucking scrub id fuck ur face up\nVi: so hard\nVi: you little shit\nOrnn: ?\nVi: fuck you\nMe: lol\nOrnn: most damage\nVi: i seriously hope you die with that attitude\nMe: I&#039;ve never said anything as bad as anything anyone in this game has\nMe: and my account got perma&#039;d\nVi: stfu keyboard no one talking to you\nVi: stfu\nVi: you a twat\nOrnn: thats jg attitude\nVi: literaly\nOrnn: suck\nVi: id fuck u up\nMe: apparently I&#039;m in one of the top .006% most toxic players\nVi: rela bad\nExuberantSoul left the lobby\nMe: I don&#039;t buy it\nOrnn: im bad?\nOrnn: fuking solo with me\nOrnn: and stfu\nVi: 1457 paris street denver\nOrnn: stf u\nVi: come over\nVi: and get fuckking killed\nMe: lol\nVi left the lobby\nMe: big boi\nMe: death threats over league XD\nMe: that&#039;s a fucking perma right there\nOrnn: and\nOrnn: now\nMe: screen shot it\nOrnn: he afriad\nOrnn: to add me\nOrnn: = =\nMe: screen shot it\nMe: and sent to riot\nOrnn: shit talking\nMe: that&#039;s an insta perma\n\nand yet this account is apparently in the top 0.006% most toxic, which are the ones toxic enough to get perma banned. Apparently, I&#039;m only playing with the top 0.001% most toxic because at least 30% of the players I play with flame so much harder and are so much more toxic than anything I&#039;ve ever been on LOL. this shit blows my mind. Fuck rito with their stupid broken system. It&#039;s not working and it would probably just be better if they left it unregulated at this point. The community toxicity is already beyond anything I can comprehend, so what&#039;s there to lose?","replies":[{"poster":"Chermorg","date":"2018-04-25T15:43:22.317+0000","up_votes":8,"down_votes":0,"body":"The 0.006% statistic refers not only to severity but to frequency. You may very well experience toxic players in your games - they may very well be toxic only because you started it, and they may not be toxic in any other games they play. As such, they may not be toxic enough to merit a punishment.\n\nHowever, your continued displays of toxic, harassing behavior over many games is what earned you your permanent suspensions. The system isn't broke - you just refuse to be a decent teammate and play with sportsmanship.","replies":[{"poster":"SparkytheWildcat","date":"2018-04-26T05:22:40.927+0000","up_votes":1,"down_votes":0,"body":"I haven't ever been the first one to be toxic. all cases of me arguing or flaming have been towards people that are flaming. The worst I've ever gotten is essentially \"fuck off, stop flaming, you're being stupid.\" I haven't been toxic in that manner in over a month, however.","replies":[]},{"poster":"breakordoom444","date":"2018-04-26T02:30:30.844+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Chermorg,realm=NA,application-id=ZGEFLEUQ,discussion-id=EJm61Acf,comment-id=0000,timestamp=2018-04-25T15:43:22.317+0000)\n>\n> The 0.006% statistic refers not only to severity but to frequency. You may very well experience toxic players in your games - they may very well be toxic only because you started it, and they may not be toxic in any other games they play. As such, they may not be toxic enough to merit a punishment.\n> \n> However, your continued displays of toxic, harassing behavior over many games is what earned you your permanent suspensions. The system isn&#x27;t broke - you just refuse to be a decent teammate and play with sportsmanship.\n\nare we going to see a \"tyler1\" ban soon?","replies":[]},{"poster":"Shukr4n","date":"2018-04-25T15:54:55.585+0000","up_votes":1,"down_votes":6,"body":"why are u going to stop him rage? he stated he stop playing until riot fixes. one less toxic player. let him alone","replies":[]}]},{"poster":"AeroWaffle","date":"2018-04-25T16:41:11.245+0000","up_votes":5,"down_votes":0,"body":"You claim that you are on this account to \"prove the system is broken\" because your main got 14-day banned, but here\n\nhttps://boards.na.leagueoflegends.com/en/c/ask-the-community/09eH0Ffo-permabanned-for-bsing-with-enemies\n\nYou say that you got perma'ed after receiving several other bans first.","replies":[{"poster":"SparkytheWildcat","date":"2018-04-26T05:04:59.936+0000","up_votes":1,"down_votes":0,"body":"yeah, that was one of the reasons I originally made this account. Then my main got permad. so I played on this one, then I got permad. All of my bans have been from defending people and telling others to stop flaming (either me or a teammate), or, in the case of my main, from BSing with troll enemies.","replies":[]}]},{"poster":"Eedat","date":"2018-04-25T15:55:10.012+0000","up_votes":5,"down_votes":0,"body":"So you went out of your way to get your account banned, then came here complaining about getting banned? Are you trolling us?","replies":[{"poster":"SparkytheWildcat","date":"2018-04-26T05:23:01.890+0000","up_votes":1,"down_votes":0,"body":"Edited my post for clarification and to address this^","replies":[]}]},{"poster":"Baron Barian","date":"2018-04-26T00:11:02.381+0000","up_votes":2,"down_votes":0,"body":"So your main account got a small ban, then your second account got permabanned.\n\n\nDo you understand the definition of insanity?","replies":[]},{"poster":"ChompyWulf","date":"2018-04-25T21:19:42.356+0000","up_votes":2,"down_votes":0,"body":"I think...I'm kinda guessing a bit...but I think the point he wants to make is being missed because he hasn't structured well. \n\nI think what he's trying to say is that Riots punishment system is broken because it took him strategically TRYING to get punished without using DEFCON 5 insults and threats to be punished, and he went for long periods without punishment. Meanwhile in the example given he was at worst \"harassing\" someone simply through arguing with them.  On the other hand that person clearly should be redflagged and hit with an immediate ban for death threats and presumably other extreme toxic phrases...but he has lack of faith it will happen because he got away with flaming for quite a while?\n\nI'm just trying to unravel it, not sure if that was his attempted message or not.","replies":[{"poster":"SparkytheWildcat","date":"2018-04-26T05:10:31.795+0000","up_votes":1,"down_votes":1,"body":"you got the gist of it. However, this ban was not from me trying to be toxic. I was just angered due to the insane amount of toxicity towards our ornn who in no way deserved the flaming he was getting. Sure, I've been mildly toxic on my smurf account in the past, but I definitely wasn't at all toxic this game or recently before it. I was simply telling them that it's norms, so people aren't all the same elo, some are practicing new champs, maybe warming up, or even attempting to play super casually and aren't taking it so seriously. Maybe they're having a bad day/game. They don't deserve to be flamed and that's all I said in this game. And yeah, it resulted in a perma ban, while the rest of these guys continue to play.\n\n Even if players do get a ban, they just return more angry to lower elos making it more toxic for new players and harder, since they're getting bombarded with toxic and higher skill level players. It doesn't matter anyway.","replies":[]}]},{"poster":"Kantala","date":"2018-04-25T15:49:29.039+0000","up_votes":3,"down_votes":1,"body":"I'm looking, and I'm looking.... And I see someone being a jerk. The problem isn't Riot. The problem is you and your refusal to see that.","replies":[{"poster":"SparkytheWildcat","date":"2018-04-26T05:23:26.974+0000","up_votes":1,"down_votes":0,"body":"where was I being a jerk? please point it out.","replies":[]}]},{"poster":"webstar1108","date":"2018-04-25T15:45:22.117+0000","up_votes":2,"down_votes":1,"body":"That's not right.","replies":[]},{"poster":"Gabresol","date":"2018-04-25T17:17:38.720+0000","up_votes":1,"down_votes":0,"body":"\"I tried to get my account banned and it worked, as expected, so the system must be bad!\"","replies":[{"poster":"SparkytheWildcat","date":"2018-04-26T05:13:20.128+0000","up_votes":1,"down_votes":0,"body":"that was previously. I stopped entirely after I got my account permabanned from BSing with the enemies too much, since riot's tips said BSing was ok, but apparently an example of BSing (given to me by a riot employee) is: \"oh man that was a close fight, great skill shot.\" anything more than that is bannable, apparently.","replies":[]}]}]}