{"poster":"OjousamaLey","date":"2014-12-01T00:41:36.382+0000","title":"Nerfing Devourer is NOT the solution, Riot stop................","subforum":"Gameplay","up_votes":9,"down_votes":8,"body":"*PBE* Devourer damage nerfed from 40 to 25.\r\n\r\nNerfing devourer is NOT the solution, the only thing broken is Warwick. (Maybe Yi too).  Devourer is the only thing that's keeping Aatrox and Olaf jungle viable, Nerf the champion not the item please","replies":[{"poster":"Durzaka","date":"2014-12-01T00:44:58.190+0000","up_votes":4,"down_votes":1,"body":"Every on hit jungler is really strong right now (minus Aatrox and Olaf, who were bad before, and are bad after).\n\nXin, Yi, Udyr, all of them are REALLY strong with devourer.\n\nI mean come on, it is Feral Flare, except it takes at 40 stacks, AND is built much earlier than flare ever was.","replies":[{"poster":"IndyBoy","date":"2014-12-26T00:35:59.216+0000","up_votes":1,"down_votes":2,"body":"minus the attack damage or the ward.... yeah so great.... totally the exact same thing as feral flare. It offers basically no combat stats now even on completion. Jungle respawns slower so its harder to stack and the fact that you said Yi is really powerful right now made me laugh a bit.\n\nIf you look at previous devourer its basically wits end but without the magic resist or the magic resist steal on hit that wits end provides and is instead replaced with a stacking mechanic. Totally broken item amiright. *sarcasm*","replies":[]}]},{"poster":"Kowe The Ewok","date":"2014-12-01T00:55:32.882+0000","up_votes":4,"down_votes":2,"body":"I agree.\n\nDevourer is completely fine on basically anychampion - but Warwick.\nThe problem with Warwick is the \"Attackspeed\" he gets with his ultimate. Too many hits in not enought ime.\n\n------------------\n\nI mean seriously, so many junglers fail horribly in the new jungle - and what does Riot do?\nNerf Trailblazer and Devourer and Warwick instead of wondering for what reason these work so well...\n\n1.) Trailblazer -> The new item has horrible mana susatain, monsters have more health, Trailblazer is a MUST on an ability&mana dependant champion or you will have to back after each 2nd camp.\n\n2.) Devourer synergizes well with attackspeed. Normally attackspeed is a lategame stat. That's what Devourer is balanced for this. However Warwick gains MORE attacks per second than a champion would maxed out attackspeed/full build could ever get. Devourer is not the problem here.\nIf his ultimate had the same base damage but 3 hits we wouldn't be talking about wether Devourer is op or not right now.","replies":[]},{"poster":"Randolpht","date":"2014-12-01T00:44:53.819+0000","up_votes":2,"down_votes":1,"body":"the item is extremely cost effective compared to the other ones actually\n\nand the problem with warwick is that smite item thats getting nerfed too for him. warwick wont be as much of a problem after that nerf","replies":[]},{"poster":"eyes wide shut","date":"2014-12-01T00:44:08.796+0000","up_votes":1,"down_votes":2,"body":"stopped reading at olaf viable.","replies":[{"poster":"OjousamaLey","date":"2014-12-01T22:56:41.039+0000","up_votes":1,"down_votes":0,"body":"He is actually not too bad with Devourer, just like Aatrox.  Devourer made both of them actually playble","replies":[]}]}]}