{"poster":"The Deckowner","date":"2017-12-03T04:04:34.044+0000","title":"I'm winning bot lane, until their mid Zoe got 2 redemptions in a row.","subforum":"Gameplay","up_votes":68,"down_votes":7,"body":"I guess my laning phase is dependent on enemy mid laner&#039;s RNG now? And that is fair?","replies":[{"poster":"EkyonKun","date":"2017-12-03T05:05:59.248+0000","up_votes":35,"down_votes":6,"body":"I don't know why Zoe can even pluck random actives/summoners off minions at ALL. I mean, isn't she supposed to be some kind of spell thief? She should only be able to pick up actives/summoners of people who USED them. \n\nI usually don't have an issue with Zoe in lane, but I had an incident where two days ago, she randomly got ignite and immediately used it on me. Then she used a protobelt, into an immediate GLP. And not 30 seconds later, I got redemptioned in lane. Like COME ON. This doesn't feel like a trickster using my own abilities against me. It feels like I'm playing against a hacker who can just spam random abilities at their leisure.\n\nActually I just remembered she had that Cyberpop Zoe skin...hm...","replies":[{"poster":"The Deckowner","date":"2017-12-03T06:29:28.877+0000","up_votes":31,"down_votes":2,"body":"Every time CertainlyT makes a new champion, they are hacking like a motherfuxker. When Yasuo first come out every mage must be like \"WTF that windwall blocked my 1k burst combo he's hacking!\". Same for Kalista, how could Rito's champ design team not realize able to infinitely kite is cancerous for melee champions? Dude can't make something without having everyone be like \"why is this a thing?\".","replies":[{"poster":"Lakega","date":"2017-12-04T17:08:31.973+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=The Deckowner,realm=NA,application-id=3ErqAdtq,discussion-id=AOqoXAab,comment-id=00020000,timestamp=2017-12-03T06:29:28.877+0000)\n>\n> Every time CertainlyT makes a new champion, they are hacking like a motherfuxker. When Yasuo first come out every mage must be like &quot;WTF that windwall blocked my 1k burst combo he&#x27;s hacking!&quot;. Same for Kalista, how could Rito&#x27;s champ design team not realize able to infinitely kite is cancerous for melee champions? Dude can&#x27;t make something without having everyone be like &quot;why is this a thing?&quot;.\n\nMaybe because all of his champions he creates is utterly broken with overloaded kits that makes League a joke in terms of balance? It's ilke Riot actually believes that if all champs are broken and OP then its a balanced game.","replies":[]},{"poster":"superfire444","date":"2017-12-03T23:15:03.998+0000","up_votes":1,"down_votes":0,"body":"Because they only look at what's fun to play rather than also looking at what's fun to play against. Fun to play champions mean people want to play them more = more players playing = more $$$","replies":[]},{"poster":"Teridax68","date":"2017-12-04T13:53:41.225+0000","up_votes":1,"down_votes":1,"body":"This is why I don't really like the whole \"this champion's so cool because they get to break the rules\" spiel. For sure, it's always good to question the rules, understand why they exist, and find exceptional cases where those rules don't apply, or at least not as much, but designs like Yasuo, Kalista, Zoe, etc. don't really do that. They break the rules, but do so in a manner that neither makes any tradeoffs nor gives their opponents any further options, and so predictably cause horrendous interaction problems with other champions. Zoe's randomness isn't there because it's under tight control so that it remains fair, or because it adds fun gameplay for everyone involved, it's there because someone just decided to ignore many years' worth of warnings against RNG-based power and plonk it in. It may make the champion more interesting in the short term, but it's tremendously detrimental to the game overall, and is likely to be yet another constant pain point in League's overall design for months, even years to come.","replies":[]}]},{"poster":"Votable Jester","date":"2017-12-03T22:09:38.630+0000","up_votes":2,"down_votes":1,"body":"I mean if she couldn't get them from minions her W would be borderline useless outside of teamfights.","replies":[{"poster":"EkyonKun","date":"2017-12-03T23:02:11.076+0000","up_votes":2,"down_votes":1,"body":"Outside of stealing a summoner spell, one of the most powerful and potentially game changing actives in the game, on top of being able to steal many active items, she still mostly relies on her EQQ combo. Then the QREQ combo at levels 6+. She doesn't rely at all on her W active, it's just a nice bonus she gets from time to time. A sometimes nice, game changing bonus she gets from cs'ing.","replies":[{"poster":"Weiss Guertena","date":"2017-12-04T16:43:17.358+0000","up_votes":2,"down_votes":0,"body":"I'd disagree that all of summoner spells are that gamechanging. An extra TP can be bonkers, but Flash, Heal or Ignite aren't that different from just having a regular W ability. So I'd agree that she actually getting use of her W outside of teamfights is the way it should be.\n\nHowever, I'd argue that pool of actives she can get needs to be looked at - probably some of most powerful ones being put behind a level lock. If I get lucky with two Gunblades in a row early and win over my opponent, it doesn't feel good for anyone. I won and they lost because RNGesus was on my side, plain and simple. Same the other way round; if I got two Cleanses against a, say, Zed - he won most likely because I was an ability down on him, not because he outplayed me.","replies":[]},{"poster":"Votable Jester","date":"2017-12-04T02:35:00.411+0000","up_votes":2,"down_votes":2,"body":"You sound **_really_** salty.\n\nAnd she does rely on it for defensive capabilities and other utility.  Sure she doesn't need it for damage, but the game isn't all about damage.","replies":[{"poster":"EkyonKun","date":"2017-12-04T03:30:52.522+0000","up_votes":3,"down_votes":1,"body":"I actually like Zoe's design, and I don't even really care how much burst her EQQ combo does. It has counterplay, at least in lane. Maybe it needs toned down late, but in lane it feels fair. When she gets ult, you just have to stay back a bit further so she can't point blank E you. This is all well and good. Even stealing item actives and summoner spells on her W is actually fine. \n\nYou use a flash, now she can use that against you. \nYou use ignite aggressively, now she can do the same. \nUse gunblade, well now she has a gunblade. \n\nThere's play and counterplay at work in all this. You have to think about \"Should I use this now, or would Zoe make better use of it?\" I like Zoe's kit for the most part.\n\nActives from MINIONS however is just a dice toss as to whether or not Zoe can auto win lane with high damaging actives. This is not interactive. This is just (potentially) oppressive. Sometimes it is, sometimes it isn't. It depends how many gunblades, ignites, and redemptions she gets.","replies":[{"poster":"Votable Jester","date":"2017-12-04T04:32:18.610+0000","up_votes":3,"down_votes":1,"body":"I definitely dislike the RNG factor of the minion drops and agree with you there.  Still, I think she needs some way to get them or she's playing with 1 less ability.\n\nMaybe if they made the \"tier\" of the items/summoner spells scale with ranks in the ability?  Like first couple ranks it's just stuff like {{item:3144}} and weakened versions of barrier, ignite, and ghost?\n\nOr they could make the direct strength of dropped item/summoner spells scale with rank in the ability.  So at rank 1 for instance, {{item:3107}} only heals for a fifth its normal value?  This way the randomness would at least be less impactful.","replies":[{"poster":"EkyonKun","date":"2017-12-04T16:21:25.964+0000","up_votes":1,"down_votes":0,"body":"You know what. I'd be okay with that change actually. She shouldn't just be able to ignore leveling her W and get almost full benefit from it.","replies":[]}]}]}]}]}]},{"poster":"Niaphim","date":"2017-12-04T09:48:09.010+0000","up_votes":2,"down_votes":1,"body":"Exactly. Spell thief theme is fine, as it is predictable, and picking Zoe can be a strategic decision, which is always welcome in League. However, RNG doesn't go well in a competitive environment and should be fixed before next season (LCS).","replies":[]},{"poster":"wildfox99","date":"2017-12-03T13:37:32.820+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=EkyonKun,realm=NA,application-id=3ErqAdtq,discussion-id=AOqoXAab,comment-id=0002,timestamp=2017-12-03T05:05:59.248+0000)\n>\n> I don&#x27;t know why Zoe can even pluck random actives/summoners off minions at ALL. I mean, isn&#x27;t she supposed to be some kind of spell thief? She should only be able to pick up actives/summoners of people who USED them. \n> \n> I usually don&#x27;t have an issue with Zoe in lane, but I had an incident where two days ago, she randomly got ignite and immediately used it on me. Then she used a protobelt, into an immediate GLP. And not 30 seconds later, I got redemptioned in lane. Like COME ON. This doesn&#x27;t feel like a trickster using my own abilities against me. It feels like I&#x27;m playing against a hacker who can just spam random abilities at their leisure.\n> \n> Actually I just remembered she had that Cyberpop Zoe skin...hm...\n\nthey should reduce her drop rate from minionsor making her W give an item/summoner spell every X unit killed instead of randomly","replies":[]}]},{"poster":"Unreformed Shaco","date":"2017-12-03T04:14:18.567+0000","up_votes":10,"down_votes":2,"body":"and if Zoe got 2 randuins in a row your midlaner should've decked her.","replies":[]},{"poster":"Gives No Lux","date":"2017-12-03T09:29:19.587+0000","up_votes":6,"down_votes":6,"body":"I was winning my lane until I went to ward dragon and the enemy adc got double crits off of 10‰ chance no  I have to...  Oh wait, you always had rng, nevermind.","replies":[{"poster":"Marik von Bern","date":"2017-12-03T13:53:03.425+0000","up_votes":8,"down_votes":2,"body":"Crits are pseudorandom.","replies":[{"poster":"Myozthirirn","date":"2017-12-03T19:05:44.579+0000","up_votes":4,"down_votes":2,"body":"zoe drops are pseudorandom too","replies":[]}]},{"poster":"Xonra","date":"2017-12-04T11:37:52.005+0000","up_votes":1,"down_votes":0,"body":"There is a difference in statistical chance based on a given circumstance (building items that give Crit chance), compared to just random bs that has no trigger or factor and can be game breaking in the moment.\n\nCrit is good RNG as far as RNG goes. Zoe is complete BS RNG that I can't believe made it into the game and now we are stuck with this garbage.","replies":[{"poster":"Gives No Lux","date":"2017-12-04T20:16:30.126+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Xonra,realm=NA,application-id=3ErqAdtq,discussion-id=AOqoXAab,comment-id=00030001,timestamp=2017-12-04T11:37:52.005+0000)\n>\n> There is a difference in statistical chance based on a given circumstance (building items that give Crit chance), compared to just random bs that has no trigger or factor and can be game breaking in the moment.\n> \n> Crit is good RNG as far as RNG goes. Zoe is complete BS RNG that I can&#x27;t believe made it into the game and now we are stuck with this garbage.\n\nUmm, have you read the ability?  It most certainly has a trigger.  It's triggered on enemy summoner/item usage or minions that are tagged with a balloon.  Not only that you can clearly see the shard and it also has to be picked up before it can be used.\n\nThe only random aspect is the minion that appears on average once every other creep wave if she is in lane and has the ability leveled.  This mechanic has an extremely minimal impact on the game overall.\n\nIf you are good enough to harass/zone/counterplay when your opponent is going for CS then you can EASILY zone her from picking up a shard because she will have to move out of position 95% of the time to obtain it.","replies":[{"poster":"Myozthirirn","date":"2017-12-05T10:42:45.188+0000","up_votes":1,"down_votes":0,"body":"You can even deny the drop to begin with. The bubble minions only drop it if they are killed by zoe.","replies":[]}]}]},{"poster":"Teridax68","date":"2017-12-04T13:43:50.918+0000","up_votes":1,"down_votes":0,"body":"Except crit is a widely criticized mechanic as well, again because of its RNG, and the OP made no attempt to mention crit, let alone justify it. There is a meaningful difference, though, in that crit at least is a coinflip for more damage every couple of seconds at most, often more than once a second, whereas Zoe's RNG bonuses happen at much wider intervals and can have a much larger impact, as shown in the OP's example. Therefore, Zoe's W does tend to generate more unfair scenarios than crit, even if both instances of RNG aren't good and shouldn't be in the game.","replies":[]}]},{"poster":"ZURELL","date":"2017-12-03T04:08:44.299+0000","up_votes":2,"down_votes":19,"body":":/ idk man. rng like this being added to the game is the most fun i've had in league in a while. clepto is fun even if not for my opponent >.> maybe riots running out of ideas. its only preseason tho. its obviously subject to change.","replies":[{"poster":"The Deckowner","date":"2017-12-03T06:24:55.618+0000","up_votes":9,"down_votes":1,"body":"Klepto is only ever fun if you get super good RNG or your opponent get super bad RNG with it, in both cases, it feels very shit to be the receiving end of bad luck.\n","replies":[{"poster":"ZURELL","date":"2017-12-03T08:39:35.191+0000","up_votes":3,"down_votes":1,"body":"its free potions wards and buffs its always fun playing with clepto imo but i understand its probably frustrating playing against it","replies":[]}]}]},{"poster":"LankPants","date":"2017-12-04T10:28:03.649+0000","up_votes":2,"down_votes":1,"body":"Zoe is such a clear example of shit design. I don't understand who at Riot ever thought a champ with this much RNG would ever be OK.","replies":[{"poster":"Xonra","date":"2017-12-04T11:40:24.468+0000","up_votes":2,"down_votes":0,"body":"Stupid sleep mechanic that you can't fully shield or cleanse that gives her dumb levels of burst, AND completely ridiculous levels of RNG because reasons.","replies":[{"poster":"RainXBlade","date":"2017-12-04T16:38:01.865+0000","up_votes":1,"down_votes":0,"body":"Zoe herself is a pain in the ass to face against, unless you're playing an assassin.\n\nThat's the bottomline of it","replies":[]},{"poster":"LankPants","date":"2017-12-04T11:47:20.547+0000","up_votes":1,"down_votes":0,"body":"Completely agree. Her design is basically that of old Nidalee. We got rid of that cancer for a reason.","replies":[]}]}]},{"poster":"Gear5Luffy","date":"2017-12-03T18:47:16.885+0000","up_votes":2,"down_votes":0,"body":"Getting 3 Teleports in a row  is not fun as well","replies":[{"poster":"Xonra","date":"2017-12-04T11:41:42.665+0000","up_votes":1,"down_votes":0,"body":"Nothing like having a Zoe back off to tp bot, then use their own tp to come back to lane, then get another fucking tp to then tp bot again, then get ANOTHER tp when they get back to lane.\n\nThat is some of the most tilting shit, and you just sit there getting salty knowing you can't do anything about it as it has zero counter play and is completely random.","replies":[{"poster":"RainXBlade","date":"2017-12-04T16:38:59.744+0000","up_votes":1,"down_votes":0,"body":"Zoe getting a free exhaust when I'm playing an assassin is a really fun time.","replies":[]},{"poster":"Gear5Luffy","date":"2017-12-04T15:58:28.954+0000","up_votes":1,"down_votes":0,"body":"im sure her W numbers will be looked at soon and making it with limited spells she can get at W levels or game time because the RNG is just not good for the game health","replies":[]}]}]},{"poster":"Fairyfleur","date":"2017-12-03T22:10:13.634+0000","up_votes":3,"down_votes":2,"body":"Redemption hardly heals for anything without any % power though","replies":[{"poster":"Xonra","date":"2017-12-04T11:39:32.058+0000","up_votes":1,"down_votes":0,"body":"It doesn't really matter when it is free though, and coming from a source that a) you can't control in any way and b) you can't predict c) shouldn't have that effect regardless. It is just random redemption TWICE from another lane, so free healing, when it shouldn't even be a thing.","replies":[]}]},{"poster":"LadyRenly","date":"2017-12-04T16:17:35.092+0000","up_votes":1,"down_votes":0,"body":"whats the difference really between a mid laner like veigar coming down and caging you and blasting you guys and a zoe using 2 redemptions?either way you're dead.","replies":[{"poster":"The Deckowner","date":"2017-12-05T06:37:58.553+0000","up_votes":1,"down_votes":0,"body":"Redemption is semi-global?","replies":[{"poster":"LadyRenly","date":"2017-12-05T17:19:39.195+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=The Deckowner,realm=NA,application-id=3ErqAdtq,discussion-id=AOqoXAab,comment-id=000a0000,timestamp=2017-12-05T06:37:58.553+0000)\n>\n> Redemption is semi-global?\n\nXerath ulti is semi global. Redemption is nowhere close","replies":[]}]}]},{"poster":"Xonra","date":"2017-12-04T11:34:32.942+0000","up_votes":1,"down_votes":0,"body":"I legit hate Zoe. She isn't \"op\", but she is flat out broken. I have seen one pick up 2 tps in a row and just run all over the damn map. The amount of RNG she has legit tilts the shit out of me. Old Yorick reworked cause of how unfun he was to play against. This shit is the least fun I've ever played against on about 15 different levels. \n\nI don't feel I was beaten by skill ever against her, just RNG bs. I literally just ping my junglers back sometimes cause she will burn flash, then just magically pick another one up so what does it even matter? It's so stupid.","replies":[]},{"poster":"l Ryden l","date":"2017-12-03T21:06:21.139+0000","up_votes":1,"down_votes":0,"body":"They need to make it so the item actives she can get correspond the cost of the item that ability is tacked on to to the time you'd normally get it. Like normally you wouldn't get {{item:3107}} at level 3 or 4 but you could with {{item:3144}}. But like level 7 or 8 you could have {{item:3107}} but not {{item:3146}}.","replies":[]},{"poster":"FlameHalbrdOkido","date":"2017-12-04T04:11:33.894+0000","up_votes":1,"down_votes":1,"body":"I wonder why they did this minion ENG thing when it should just grant the Auto attacking bonus bubbles and nothing else, they'd better fix this.","replies":[]}]}