{"poster":"Niyorii","date":"2016-01-24T15:40:35.583+0000","title":"Suche einen DuoQ Partner oder ganzes Team!","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Da ich leider in Bronze 3 gekommen bin, suche ich jetzt jemanden mit dem ich aktiv spielen kann.\r\nIch m&ouml;chte schnell aus der Bronze Hell raus kommen und suche jemanden der zwischen Silber und Bronze steht.\r\nDerjenige sollte stehts freundlich sein, Kritikf&auml;hig und auch per WhatsApp erreichbar sein.\r\nAUCH sollte diese Person bitte min. 16 Jahre alt sein und nicht zu arg kindisch. \r\n\r\n\r\nEin paar Informationen zu mir:\r\n\r\n- Ich bin 17 Jahre alt\r\n- Kritikf&auml;hig und sehe auch gerne Kritik und Tipps\r\n- Wirklich sehr freundlich und aufmerksam\r\n- Ts3, Skype und ein Headset ist vorhanden\r\n- Stets &uuml;ber WhatsApp erreichbar \r\n- Habe viel Zeit zum spielen und trainieren\r\n- Wenn was schief l&auml;uft &auml;rgere ich mich laut aber beleidige niemals meine Teammates\r\n- Kann alle Lanes spielen aber als Jungler habe ich noch Probleme\r\n- {{champion:18}} {{champion:78}} {{champion:45}} {{champion:99}} sind meine Mains\r\n\r\nJoah, das sind denke ich die wichtigsten Informationen die man ben&ouml;tigt :D\r\nAlso bei Interesse w&uuml;rde ich mich &uuml;ber eine PN im Game oder als Kommentar RIESIG freuen!","replies":[{"poster":"xAskardiax","date":"2016-01-25T16:43:01.908+0000","up_votes":1,"down_votes":0,"body":"Hey ich hab momentan auch Zeit und brauch einen Grund mal diesen Account auf lvl 30 zu bringen :). Bin 19 und main jungler (plat 4), habe Nachmittags immer Zeit für ein paar lustige Games also falls du mal Normals spielen willst einfach adden :).\n\nLG der Basti","replies":[]},{"poster":"ElBabso34","date":"2016-01-24T22:07:03.024+0000","up_votes":1,"down_votes":0,"body":"wäre es schlimm wenn man 15 ist ? wenn nicht adde Elbabso34 und schreib mich mal an, würde mich freuen ^^","replies":[{"poster":"Niyorii","date":"2016-01-25T08:58:19.668+0000","up_votes":1,"down_votes":0,"body":"Im Grunde wäre es nicht schlimm.\nAber ich bin ein wenig Oberflächlich und das tut mir auch sehr leid, aber im TS mag ich lieber Menschen die halt 16 sind, da man ab dem Alter schon ca weiß das diese Person etwas erfahrener ist und nicht so extrem kindisch ist\nUnd bereits im Stimmbruch ist bzw war\n\nNatürlich ist es nicht immer so aber es ist halt der große Teil :D\nIch werde dich trotzdem mal adden!\nMan kann es ja probieren","replies":[]}]},{"poster":"UmbraArma","date":"2016-01-24T15:52:37.381+0000","up_votes":1,"down_votes":0,"body":"hi,\nmein name ist alexander bin 20 jahre alt^^\nIch bin zwar noch nicht geranked allerding war ich in der letzten season gold 4 somit würde ich in meiner einschätzung zwischen bronze 1 und silber 3 landen\nIch kann so ziemlich jede lane spielen (bis auf jungle das mag ich überhaupt net^^)\n\nFalls du interesse hast kannst du mich gerne ingame adden\nUmbraArma {{champion:122}}","replies":[]},{"poster":"Ím not MaDLìfè","date":"2016-01-24T15:50:55.428+0000","up_votes":1,"down_votes":0,"body":"Jow, könntest du mich mal adden?","replies":[]}]}