{"poster":"LiAMfACE","date":"2015-02-14T12:19:26.273+0000","title":"Regarding Evelynn and her future rework","subforum":"Miscellaneous","up_votes":2,"down_votes":1,"body":"Since her current skins don't do anything besides give her model a different look, when she gets her rework will you consider making her skins do more than they currently do? It would be really cool, even if they were just minor things like slight changes in her voice acting, taunts, etc (considering her skins are cheap).\r\n\r\nEven though she's a bit of a struggle to play compared to some of the easier picks like J4 and Vi, I'm sticking with her until the end... (also I'm never picking her in ranked because that would create unnecessary stress for my team because she just can't carry as well as other champions).\r\n\r\nIs there a date for her rework? Like.. 2015? I feel as if she's the Urgot tier of junglers and mid laners.","replies":[{"poster":"Klavinmour","date":"2015-02-14T13:00:53.170+0000","up_votes":1,"down_votes":0,"body":"If you feel that Evelynn is weak, you're playing her wrong.\n\nIt's unlikely she'll get a rework, there hasn't been any talk of such a thing. A Visual Update however has been. She wasn't meant to get a new skin until she got a VU, but out came the Safecracker skin.\n\nShe doesn't need a rework, some rebalancing on her skills sure.\nHer passive's detection radius needs to be decreased by about 10% ever since her rework I've always felt that it is too large.\nRight now AD Evelynn is her strongest build path. However if you don't get the right items she'll do no damage what so ever.\nI'm sick of seeing people build four tank items on her and expecting her to still be an assassin.\n\n\n\nI'm greatly looking forward to her future visual update. She has barely any voice lines, and her model is rather midget in comparison to other champs of the same style.","replies":[{"poster":"LiAMfACE","date":"2015-02-15T01:09:55.998+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Klavinmour,realm=OCE,application-id=Ntey9fRZ,discussion-id=PFcT94Mb,comment-id=0000,timestamp=2015-02-14T13:00:53.170+0000)\n>\n> If you feel that Evelynn is weak, you're playing her wrong.\n> \n> It's unlikely she'll get a rework, there hasn't been any talk of such a thing. A Visual Update however has been. She wasn't meant to get a new skin until she got a VU, but out came the Safecracker skin.\n> \n> She doesn't need a rework, some rebalancing on her skills sure.\n> Her passive's detection radius needs to be decreased by about 10% ever since her rework I've always felt that it is too large.\n> Right now AD Evelynn is her strongest build path. However if you don't get the right items she'll do no damage what so ever.\n> I'm sick of seeing people build four tank items on her and expecting her to still be an assassin.\n> \n> \n> \n> I'm greatly looking forward to her future visual update. She has barely any voice lines, and her model is rather midget in comparison to other champs of the same style.\n\nThere has been. Ironstylus has mentioned that when she gets a change, it'll be on the same level as Sion's rework (which was a complete overhaul).\n\nhttp://boards.na.leagueoflegends.com/en/c/gameplay-balance/s3Ae7ec8-champion-updateiupdate-13015?comment=00040000000000010000\n\n(The post asks for an update - because there has been word/discussion of an Eve update since 2013)\n\nHere's another post:\n\nhttp://boards.na.leagueoflegends.com/en/c/story-art/3H3Au47M-hey-ironstylus-have-you-guys-settled-on-a-direction-for-eves-vu-yet?comment=0003\n\nIf you're interested in keeping up to date with her: \n\nhttp://www.newsoflegends.com/index.php/tag/evelynn/ \n\nWhen Evelynn received her first visual/kit update, a Riot member mentioned she would be receiving another visual update to fix her rigging (because apparently it's a nightmare). Since then, there have been quite a few posts on various other websites talking about kit reworks since Evelynn is either considered overpowered or really weak depending on the slight adjustments made to her or meta changes (I think it was Phreak who said that it was mostly to do with how her invisibility effects the game).\n\nIn the current meta, she especially gets out done by vastly superior junglers like J4 and Vi. This isn't to say she's completely worthless, but you're just better off picking a different champion in the jungle than Evelynn (I still pick her because she's fun and one of my favourite champions, but she doesn't really compare to other champions).\n\nPopularity: 1.27% (8th most unpopular champion)\nWin Rate: 45.63%\t\nBan Rate: 0.1%\n\n(Source: http://www.lolking.net/champions/)","replies":[]}]},{"poster":"BarryButcher","date":"2015-02-14T15:40:53.117+0000","up_votes":1,"down_votes":1,"body":"changes to the voice are not minor LOL it costs alot of money to change sounds of skins.\n\nI would like a different coloured Q. that would be nice. other than that they cant change much, her kit isnt very visual unlike say Jinx or Ziggs","replies":[]}]}