{"poster":"Anußiss","date":"2018-12-01T12:00:45.952+0000","title":"Segítség!!!","up_votes":1,"down_votes":0,"body":"Elinditottam a meccset erre 5 perc j&aacute;t&eacute;k ut&aacute;n meg&aacute;lt az eg&eacute;sz meccs &eacute;s azt irta ki h visszacsatlakoz&aacute;s folyamatban.... az&oacute;ta nem tudok csin&aacute;lni semmit.. se visszacsatlakozni se kil&eacute;pni mert a hős&ouml;m bentragadt","replies":[{"poster":"Mind The Gap","date":"2018-12-01T12:13:36.350+0000","title":null,"up_votes":1,"down_votes":0,"body":"Nem tudsz kilépni? Pedig ahhoz tudtommal nem kell internet kapcsolat, hogy bezáródjon a program… ALT +  TAB, nyisd meg a Feladatkezelőt, és zárd be onnan a játékot, és indítsd újra a klienst, majd csatlakozz vissza. Ha Wi-Fi-on vagy, akkor javasolnám, hogy használj netkábelt, hogy stabilabb legyen a kapcsolat.","replies":[{"poster":"Anußiss","date":"2018-12-01T12:21:03.127+0000","title":null,"up_votes":1,"down_votes":0,"body":"Megcsináltam de ha bejelentkezek a játékba akkor is azt irja ki hogy játékban vagyok újra elkezdi számolni az időt 0 tól és kidobja a visszacsatlakozás gombot arra ha rányomok nem történik semmi","replies":[{"poster":"Mind The Gap","date":"2018-12-01T12:26:47.642+0000","title":null,"up_votes":1,"down_votes":0,"body":"Na, ilyet se hallottam még. [Küldj egy hibajegyet a supportnak kérlek](https://support.riotgames.com/hc/hu/requests/new). Habár a meccsedet nem kapod vissza, a gondot meg lehetne előzni legközelebb.","replies":[{"poster":"183cm 71Kg 22cm","date":"2018-12-02T22:25:31.179+0000","title":null,"up_votes":1,"down_votes":0,"body":"Megesett már velem is, lényegében ez az, hogy elmegy a net, lecsatlakozik. (vagy csak egyszerűen gondolt egyet a szolgáltató és szervert váltott, itt előszeretettel ugrált budapest és szeged között, nem szereti a játék) Kilép, majd miután rányom a visszacsatlakozásra lessz vége a meccsnek. Kicsit összezavarodik ugy minden. A meccset nem indítja el, mert elvileg vége, de ha bezárja akkor meg írja a visszacsatlakozást, és ugye addig nem sokmindent lehet csinálni. Ilyenkor ajánlott bezárni mindent feladatkezelőben, majd kb 1 perc múlva megnyitni újra.","replies":[]},{"poster":"Knight Thyme","date":"2018-12-01T12:53:26.718+0000","title":null,"up_votes":1,"down_votes":0,"body":"Nyaron csinalt hasonlot, de akkor sokunknak egyszerre, es az akkor valamilyen szerverhiba volt.","replies":[]}]}]}]}]}