{"poster":"Mauldaschasub","date":"2015-07-11T18:41:28.329+0000","title":"Seltsames Problem","subforum":"Hilfe & Support","up_votes":2,"down_votes":0,"body":"Hallo\r\nIch habe mir heute einen neuen Laptop gekauft f&uuml;r knapp 900 &euro; hab mir dann wieder lol installiert und es l&auml;uft auch alles fl&uuml;ssig mit smartcast.\r\naber wenn ich ohne spiele habe ich das problem das ich locker 3-4 mal auf die linke maustaste klicken muss um die spells zu feuern.\r\nhab weder fps einbr&uuml;che oder einen schlechten ping. alles andere l&auml;uft fl&uuml;ssig.\r\nkann mir einer evtl weiterhelfen w&auml;re super","replies":[{"poster":"Synthoras","date":"2015-07-14T17:06:48.125+0000","up_votes":1,"down_votes":0,"body":"zone alarm, hab eben mal deaktiviert., schreibe dann ob es geholfgen hat\n\nedit: \nhat nicht geholfen, die firewall zu deaktivieren","replies":[]},{"poster":"Tiaryn","date":"2015-07-13T18:52:52.905+0000","up_votes":1,"down_votes":0,"body":"Welches Antivirenprogramm benutzt ihr und habt ihr das vor einer Runde LoL schon mal komplett ausgeschaltet?","replies":[]},{"poster":"Synthoras","date":"2015-07-13T18:08:25.848+0000","up_votes":1,"down_votes":0,"body":"ich ahbe EXAKT genau dieses Problem! \n\ndas liegt aber bestimmt nicht am internet oder am laptop, sollte es das gleiche sein wie meins. \n\nspiele seit der beta mit fast dem gelichen rechner, da bezweifle ich es,  das es an diesem problem liegt. das Problem trat bei mir seit letzter Woche auf, Internetprobleme habe ich alelrdings keine, Das spiel läuft auch sonst volkommen flüssig, ohne freezes oder sonstiges, hab auch schon probiert maus und tastatur auszutaucshen, hat aber nicht gewirkt.","replies":[]},{"poster":"Commandant Mewtu","date":"2015-07-11T19:40:40.103+0000","up_votes":1,"down_votes":0,"body":"Ich vermute 2 verschiedene Sachen \n\n1. Dein Internet ist dafür nicht ausgelegt für LoL oder\n2. deine Grafik ist zu hoch eingestellt versuch mal die Grafik zu ändern \n\nich hoffe ich konnte dir weiter helfen \ngruß Commandant Mewtu","replies":[]}]}