{"poster":"kasumi azuki","date":"2018-11-18T00:53:19.173+0000","title":"Banned for dying too much","subforum":"Player Behavior","up_votes":2,"down_votes":16,"body":"riot just because I died more than 10 times in a game does not mean im trolling =.=\r\nthere goes my account I guess thanks a lot","replies":[{"poster":"DuskDaUmbreon","date":"2018-11-18T01:17:20.140+0000","up_votes":13,"down_votes":0,"body":"You had only *900* damage to champions over 25 minutes.\n\nYou had one ward in 25 minutes.\n\nYou went 1/12/2 in a lane you *countered hard*.\n\nYou had less CS than your support, and only 8 more than *their* support.\n\nYou died several times in almost the exact same spot.\n\nYou died a bit before before 2 minutes in, and then again before the third minute, and proceeded to die every couple minutes from that point onward.\n\nYou went afk after your last death, which I can tell based on your gold income being *completely* flat. Seems Olaf might have as well, although that may well have been sheer frustration.\n\nThe only item you actually completed was {{item:3009}}.\n\nEvery last item you had gave you MS in some way. {{item:3096}} {{item:3009}} {{item:3113}} {{item:2053}}. {{item:3070}} is because your W gives MS. Kayle gets zero of these items in any even semi-meta build. The MS was bought only to get to lane faster to *die faster*.\n\nYou didn't even put a single point in E.\n\nYeah. You inted. All of these things together are too suspicious.","replies":[]},{"poster":"The Djinn","date":"2018-11-18T01:05:37.863+0000","up_votes":8,"down_votes":0,"body":"When you have 12 deaths, a completely haphazard build, a support item despite apparently being mid-lane, and less than 1000 damage dealt to champions, it does look *very* suspicious. Especially when your match history includes a 0/20/1 Garen game where you only have Ancient Coin and Aether Wisp, and what looks like 10 deaths in your own jungle to camps.","replies":[]},{"poster":"Infernape","date":"2018-11-18T00:56:27.655+0000","up_votes":6,"down_votes":0,"body":"It's funny how all your deaths were in near enough the exact same location. ","replies":[]},{"poster":"ı Sona ı","date":"2018-11-18T06:09:51.039+0000","up_votes":2,"down_votes":0,"body":"You know I had a scenario like this happen to me once. The whole team getting steamrolled (sept jungle who is fighting the good fight) and I ended up being punished. But I gathered information around the game and sent a ticket to Riot support and they overturned the ban! Have you contacted Riot Support yet? \n\nFor reference: https://boards.na.leagueoflegends.com/en/c/player-behavior-moderation/ZkZWEUYE-banned-for-intentionally-feeding-but-it-was-just-a-hard-game","replies":[]},{"poster":"KVbqbFsC8e","date":"2018-11-18T00:54:55.567+0000","up_votes":4,"down_votes":2,"body":"Try to make it less obvious next time.","replies":[]},{"poster":"Vreivai","date":"2018-11-18T01:06:54.960+0000","up_votes":1,"down_votes":0,"body":"You were just banned for a game that happened nearly a month ago?\n\nI'd watch the replay, but it's expired.","replies":[]},{"poster":"MagicFlyingLlama","date":"2018-11-18T01:31:01.069+0000","up_votes":1,"down_votes":3,"body":"Looks like you AFKed, honestly.\n\n[REMOVED UNNECESSARY INSULT - PRANDINE]","replies":[]}]}