{"poster":"JarvanIVDeHelado","date":"2017-02-25T05:03:17.322+0000","title":"¿El cambio de nombre de invocador si es ofensivo es gratis?","subforum":"Problemas Técnicos","up_votes":4,"down_votes":0,"body":"Eso, hace bastante tiempo me habia creado una cuenta que (no digo el nombre por si me dan ban(?) ) tiene un nombre ofensivo y queria saber si Riot te da un cambio de nombre gratis o tendria que juntar los 13k-14K de PI \r\n \r\nAh, &iquest;y si fueran main Orianna que nombre se pondrian? yo estoy entre Mousse de Orianna y Orianna a la crema por mis helados favoritos xD","replies":[{"poster":"Weon","date":"2017-02-25T05:07:52.386+0000","up_votes":1,"down_votes":0,"body":"cuando te fuerzan a cambiar en nombre es gratis.","replies":[{"poster":"JarvanIVDeHelado","date":"2017-02-25T06:14:50.171+0000","up_votes":1,"down_votes":0,"body":"¿Y me van a forzar cambiarme el nombre cuando reciba muchos reportes por este? es decir, me va a salir un cartelito que me avise? yo ya me lo queria cambiar xD parece que voy a tener que subirla al 30 y comerme muchos reportes","replies":[{"poster":"GatóMonstruo","date":"2017-02-25T08:12:46.539+0000","up_votes":2,"down_votes":0,"body":"¡Jarvan!\n\nSi el nick de tu cuenta smurf es realmente ofensivo, y crees que puede ofender a muchos, deberías abrir un Ticket en el Soporte con dicha cuenta y solicitar que te lo cambien. Supongo que no habría problemas. Voy a preguntar internamente para estar totalmente seguro, pero podrías hacer la prueba mientras tanto.","replies":[{"poster":"JarvanIVDeHelado","date":"2017-02-25T08:14:25.010+0000","up_votes":1,"down_votes":0,"body":"¡Gracias! :)","replies":[{"poster":"GatóMonstruo","date":"2017-02-25T11:44:33.177+0000","up_votes":2,"down_votes":0,"body":"Me han confirmado que, si envías ticket, evaluarán el nick. En el caso de ser ofensivo o que incumpla las normas te ayudarán a cambiarlo :)","replies":[{"poster":"JarvanIVDeHelado","date":"2017-02-25T17:46:26.720+0000","up_votes":1,"down_votes":0,"body":"Gracias!","replies":[]}]},{"poster":"GatóMonstruo","date":"2017-02-25T08:24:21.397+0000","up_votes":1,"down_votes":0,"body":"Agrégame a tu lista de amigos in-game así no me olvido de responderte respecto a la Solicitud.","replies":[{"poster":"JarvanIVDeHelado","date":"2017-02-25T09:00:50.776+0000","up_votes":1,"down_votes":0,"body":"Bueno, con esta o con la smurf? xD.","replies":[]}]}]}]}]},{"poster":"Asefito","date":"2017-02-25T05:16:24.677+0000","up_votes":1,"down_votes":0,"body":"No es gratis, te cobran minutos de tu vida.\nImagínate lo que puedes hacer con esos minutos de vida, como por ejemplo, escribir esta estupida respuesta a un comentario que responde perfectamente al post, que bien que ocupó mi tiempo","replies":[]}]},{"poster":"Asefito","date":"2017-02-25T05:15:04.874+0000","up_votes":1,"down_votes":0,"body":"Yo me pondría \"DiscoBaller\"","replies":[]}]}