{"poster":"XExEcUtOrX04","date":"2015-05-12T17:04:48.870+0000","title":"Itemvorschlag: Ap","subforum":"Champions & Gameplay","up_votes":3,"down_votes":2,"body":"Hey, da es nur drei &quot;gute&quot; AP-Items gibt, dagegen aber 4 &quot;gute&quot; AD-Items habe ich mir mal ein neues Ap-Item ausgedacht und wollte einfach mal eure Kritik dazu h&ouml;ren ( ist es viel zu Op oder ist es Up?). Nun gut ich fang einfach mal an.\r\n\r\nName: ???\r\n\r\nWerte:\r\n\r\n- 120 Ap\r\n- 10% Zaubervampir\r\n\r\nEinmalige Passive: (Name?): +0.01 Ap als Zaubervampir ( also mit 1000 Ap im Endgame nochmal +10% Zaubervampir)\r\nEinmalige Passive: (Name?):  F&auml;higkeiten die _**Magischen**_  Schaden verursachen gew&auml;hren pro getroffenen Ziel 20+(0.05 AP) Leben, dieser Effekt ist gegen&uuml;ber von Vassallen um 50% verringert und ist auf einem Ziel nur alle 5 Sekunden anwendbar. &Uuml;bersch&uuml;ssiges Leben wird als Schild gutgeschrieben der **10% des Maximalen Lebens + 0.25 AP** betr&auml;gt\r\nDer Itemweg:\r\n\r\n{{item:1058}}  + {{item:3145}}  ( Zusammengesetzt aus 2x ) {{item:1052}}  + 400 Gold --&gt; Item\r\n(alles in allen also 3200 Gold)\r\n\r\nNamen d&uuml;rfen gerne Vorgeschlagen werden ( Ich bin ein schlechter Namenfinder) ansonsten: Los Diskutiert, wenn ihr findet das das Item zu stark ist - bitte,bitte sagt es :)","replies":[{"poster":"Schesam","date":"2015-05-12T19:30:11.713+0000","up_votes":2,"down_votes":0,"body":"noch ein 120 AP item? Wird finde ich dann zu viel, zudem man dann meist keinen Platz im Standard-Build hat (Mana-item/Zhonya/Rabadon/Ludens/Voidstaff/schuhe, sind schon 6). Dann hat man noch weniger möglichkeiten mit anderen Items rumzuprobieren etc finde ich","replies":[{"poster":"XExEcUtOrX04","date":"2015-05-13T12:17:10.776+0000","up_votes":1,"down_votes":0,"body":"Naja man hat doch 1 Item mehr, warum geht dann die Auswahl verloren? Und wenns keiner braucht ist es halt so wie der Essenzdieb ( ja der wird auf keinem gebaut auch wenns ihn gibt)","replies":[]}]},{"poster":"XExEcUtOrX04","date":"2015-05-12T18:13:50.782+0000","up_votes":2,"down_votes":0,"body":"Hmm ich werde das Konzept nochmal überdenken..\n\nEdit: Habe ich in der Umfrage wirklich anstatt zu stark zu schwer geschrieben? O.o","replies":[]},{"poster":"EpicFailSuicide","date":"2015-06-22T03:52:27.022+0000","up_votes":1,"down_votes":0,"body":"Also ich finde es Hört sich echt ganz gut an und die eine Diskusion das die APler gebufft werden Dadurch ist so an sich auch nicht war den kein APler wird in einem ernsten game komplett nur auf AP gehn (ach und selbst mit den jetzigen Items kann man gut auf 1200 AP kommen und hatt tzd noch gut leben, CD, Mana etc)\nWas ich bloss glaube ist das es nur sehr wenig kaufen werden weil es nicht ins Meta passt den in der Mid lane werden eher Burst Champs (Annie zbs) gepickt als Champs die Über zeit DMg machen (Fiddlesitcks zbs)\nAber sonst klingts gut.\nund ich finds nicht wirklich zu stark","replies":[]},{"poster":"xDerGeraet","date":"2015-05-12T17:54:35.121+0000","up_votes":1,"down_votes":0,"body":"ich finde dieses item wäre mehr für spell-spam champions wie z.b. cassio - da aber schon ludens echo total gut auf spam champions ist finde ich man sollte, wenn man schon ein neues 120 ap item erfinden würde, ein ap item für caster erfinden deren spell cd hoch ist wie z.b. diana oder swain","replies":[{"poster":"XExEcUtOrX04","date":"2015-05-12T18:29:50.133+0000","up_votes":1,"down_votes":0,"body":"Ich hab jetzt nochmal drüber nachgedacht und komm nicht wirklich auf den Punkt... Ich habs ja so gemacht das ja nur Ziele alle 5 sekunden Leben geben, also das sollte ja reichen um seine Spells wieder zu haben ( oder einen) und mehrere Ziele treffen kann auch jeder Ap'ler. Klar kommt der Zaubervampir + die Heilung grade auf Cassio gut, die anderen Champs sind dadurch aber auch nicht viel schlechter.","replies":[{"poster":"xDerGeraet","date":"2015-05-12T19:07:28.712+0000","up_votes":1,"down_votes":0,"body":"Außerdem wird mit einem weiteren 120Ap Item Ap champions gebufft, da man plötzlich einiges mehr ap haben kann als davor. Man muss bei Nerfs/Buffs/Itemeinführungen extrem vorsichtig sein - ein Beispiel: Mit der Einführung der PreSeason wurde Athenes Holy Grails MR generft... deswegen bekam Dfg unbemerkt einen buff, was auch der grund ist wieso dieses item entfernt wurde... also wenn man schon ein neues ap item einführen sollte, wird es wahrscheinlich kein 120Ap item sein.","replies":[{"poster":"XExEcUtOrX04","date":"2015-05-13T12:21:13.807+0000","up_votes":1,"down_votes":0,"body":"Dann sag mir doch bitte was an diesem Item schlecht ist =)\n\nKlar wird es möglich sein mehr Ap zu besitzen, dies geht dann aber auf Kosten von Mana(regeneration), Leben oder CDr. Generell wird man sich doch nur in wenigen Situationen die 4 120 Ap Items holen, ist ja bei den anderen das gleiche - oder sieht man den Essenzdieb so oft?","replies":[{"poster":"xDerGeraet","date":"2015-05-13T12:52:08.695+0000","up_votes":1,"down_votes":1,"body":"ich sag nicht das es schlecht ist, sondern dass mit einem weiteren 120ap item diese ap assassinen/mages gebufft werden","replies":[{"poster":"XExEcUtOrX04","date":"2015-05-13T13:09:26.098+0000","up_votes":1,"down_votes":0,"body":"Die Frage ist dann doch immer noch wieso es 4 AD item gibt, im Prinzip ( laut deinem Beispiel) haben doch die ADler einen Vorteil dadurch","replies":[{"poster":"Evenrider","date":"2015-05-13T13:18:28.043+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=XExEcUtOrX04,realm=EUW,application-id=Wj1wcocU,discussion-id=LRLxENZw,comment-id=000300000000000000000000,timestamp=2015-05-13T13:09:26.098+0000)\n>\n> Die Frage ist dann doch immer noch wieso es 4 AD item gibt, im Prinzip ( laut deinem Beispiel) haben doch die ADler einen Vorteil dadurch\n\nDa Essence Reaver ein gescheiterter Versuch ist, werden sie den irgendwann umbasteln (z.B. Pickaxe + X und X besteht aus Vamp Zepter und Pick Axe und gibt eben ebenfalls eine Manareg passive). Weiterhin könnten sie, bis sie das machen, das Item auch deaktivieren/löschen. Das würde nur ein ganz paar Leute treffen, die das Item vielleicht mal in Aram gebaut haben.\n\nAlso technsch gesehen haben die ADler auch nur 3 Items. Essence Reaver ist eben noch eine Speicherleiche, die einen interessanten Gedankengang hatte, aber so nicht funktioniert. Gibt noch andere Items, die davon betroffen sind (z.B. Ohmwrecker, Ardent Censer, Banner of Command,...)","replies":[{"poster":"XExEcUtOrX04","date":"2015-05-13T13:23:41.052+0000","up_votes":1,"down_votes":0,"body":"Mann ist ja auch nicht gezwungen die 4 Ap Items zubauen ( ok Veigar evtl.), da es wie gesagt zu Lasten von Leben, Mana usw. geht. Man kann eben leider nicht sagen was jetzt passieren würde wenn man das Item so freischaltet.\n\nKlar werden auch Mages dadurch gebufft trotzdem bleibt das Grundprinzip ja gleich: Auf Entfernung unglaublicher Schaden, sobald einer neben dir steht ist man tot, da bringen die 120 Ap auch nicht viel.","replies":[{"poster":"xDerGeraet","date":"2015-05-13T13:41:25.058+0000","up_votes":1,"down_votes":0,"body":"ad und ap sind was komplett unterschiedliches da mr teuer ist und armour billiger","replies":[]}]}]}]}]}]}]}]}]},{"poster":"ThexXTURBOXx","date":"2015-05-12T18:34:08.013+0000","up_votes":1,"down_votes":0,"body":"Ich finde es komisch, dass der Hextech-Revolver allein 12 % Zaubervampir bringt und dann dieses Item nur noch 10 %.\n{{item:3151}} {{champion:32}}\n;)","replies":[{"poster":"XExEcUtOrX04","date":"2015-05-12T18:38:35.940+0000","up_votes":1,"down_votes":0,"body":"Man bekommt ja durch Ap auch was dazu, man hat ja meistens mit dem Item annähernd 200 Ap was 2% extra Zaubervampir sind, also im Prinzip ändert sich das nicht wirklich ( ok ein Prozent weniger wenn man sonst kein Ap hat)","replies":[]}]},{"poster":"Riesen Schnuller","date":"2015-05-12T17:28:52.084+0000","up_votes":1,"down_votes":0,"body":"an sich cool.\naber zu op :)","replies":[]},{"poster":"LikeLuc","date":"2015-05-12T17:22:33.739+0000","up_votes":1,"down_votes":0,"body":"ich glaube es ist leicht zustark zb auf liss or anni und ahri wäre wenn man das item ruscht unbesiegbar aber ich müsste es ingame sehen um es auf champs zutesten trotzdem echo ist auch stark also ich will es haben und \n> Amulett der Wunder da würde ich nehmen oder -Spiegel der selbst","replies":[]},{"poster":"M4ster Yi","date":"2015-05-12T17:12:24.564+0000","up_votes":1,"down_votes":0,"body":"Amulett der Wunder?:D idee ist ganz nice","replies":[]}]}