{"poster":"FACE THE WlND","date":"2016-04-06T14:21:46.010+0000","title":"Thoughts on Yasuo","subforum":"Gameplay","up_votes":1,"down_votes":5,"body":"Do you guys think he&#039;s balanced, too strong, or weak at the moment?\r\nI think he is balanced, and is currently my favorite champion in the game, due to how unique his kit is, high outplay potential, ability to take him mid or top(I prefer top) and I LOVE Blood Moon Yasuo.\r\nHere is a little guide/build I made.\r\nYasuo\r\nBoots of Swiftness, Trinity Force, Phantom Dancer, Titanic Hydra, Steraks Gage, Sunfire Cape.\r\nKeystones: Grasp of the Undying, Strength of the Ages\r\nAbility Order: R&gt;E&gt;Q&gt;W\r\nRunes: 9x Flat Ad Marks, 9x Flat Armor Seals, 9x Attack Speed Glyphs, 3x Attack Speed Quintessences\r\nGrasp of the Undying if against hard melee matchup.\r\nStrength of the Ages if against ranged champion/easy melee matchup.","replies":[{"poster":"Ralanr","date":"2016-04-06T14:46:25.976+0000","up_votes":2,"down_votes":0,"body":"I personally do not like fighting him in top. Even though I play tanky champions (or maybe it's because Sion is pretty squishy in the early game) he does enough damage to win an early trade that I can find myself bullied. \n\nThough I have beaten him before and I don't think he is unfair to fight against. Annoying?  Sure, especially when he gets a few kills over you or gets his power spike before you. But not really overpowered, especially if you can reliably poke his shield away before bursting him.","replies":[{"poster":"FACE THE WlND","date":"2016-04-06T14:49:20.303+0000","up_votes":1,"down_votes":0,"body":"Yasuo does seem to do very well against Sion in my experience, it is so easy to dodge around with his e to avoid most of Sions damage and win trades.","replies":[{"poster":"Ralanr","date":"2016-04-06T14:55:54.696+0000","up_votes":2,"down_votes":0,"body":"Exactly.  Sion might be one of the few tank/tanky champions that do not really threaten Yasuo in top lane (though strangely I never have a problem against Yasuo if I tank Sion mid.  Must be the space for movement in lane).  This is probably due to the fact that Sion is pretty squishy in comparison to most tanks and tanky fighters in the early game, most likely because he has infinitely scaling health.  \n\nOther tanky top laners like {{champion:2}} {{champion:54}} {{champion:78}} {{champion:420}} {{champion:111}} {{champion:86}} and etc though?  Completely stomp on him up there.","replies":[{"poster":"FACE THE WlND","date":"2016-04-06T15:00:32.217+0000","up_votes":1,"down_votes":0,"body":"Top lane does allow Yasuo with so much more outplay potential, escapes, free farm than mid lane. Olaf is a very hard matchup, Malphite makes you want to bash your head against the keyboard, and destroys you late game. Poppy... Llaoi is very annoying, but manageable, and you out scale late, naut is pretty bad but I think it's an easier matchup than Malphite, Garen is Garen.","replies":[{"poster":"Ralanr","date":"2016-04-06T15:02:49.214+0000","up_votes":1,"down_votes":0,"body":"Though midlane allows him more bully potential and a safer lane in mu opinion.  He's the bane of most mages with his mobility and damage output.  And rarely sees his counters since they are mainly in top.","replies":[{"poster":"FACE THE WlND","date":"2016-04-06T15:07:24.471+0000","up_votes":1,"down_votes":0,"body":"Mid lane definitely has easier match ups, but a safer assassin/utility mage would be better to take mid imo.","replies":[{"poster":"Ralanr","date":"2016-04-06T15:08:46.835+0000","up_votes":1,"down_votes":0,"body":"Maybe. Yasuo has it pretty safe in mid honestly.","replies":[{"poster":"FACE THE WlND","date":"2016-04-06T15:11:40.732+0000","up_votes":1,"down_votes":0,"body":"Yea, one of the reasons I like him top also is because of the armor pen on his ult, and stacking armor is very popular right now so it allows Yasuo to win duels in the toplane.\nPlaying Yasuo top isn't very popular right now, because it's really hard to play/master but imo it pays off, and can be really fun.","replies":[{"poster":"Ralanr","date":"2016-04-06T15:14:02.474+0000","up_votes":1,"down_votes":0,"body":"I wouldn't say it isn't popular. I've been seeing it more now (which I hate since it means I can't play Sion in top as much).","replies":[{"poster":"FACE THE WlND","date":"2016-04-06T15:21:09.041+0000","up_votes":1,"down_votes":0,"body":"Thanks Huni. /sarcasm","replies":[{"poster":"Ralanr","date":"2016-04-06T15:22:46.896+0000","up_votes":1,"down_votes":0,"body":"Was there an LSC game where he went Yasuo top?  I guess that would explain the sudden explosion of them.","replies":[{"poster":"FACE THE WlND","date":"2016-04-06T15:25:05.345+0000","up_votes":1,"down_votes":0,"body":"Yea he did it once against I want to say TSM? He did very well on it.","replies":[]}]}]}]}]}]}]}]},{"poster":"archerno1","date":"2016-04-06T15:12:59.805+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Pablo16,realm=NA,application-id=3ErqAdtq,discussion-id=9y0fOOLj,comment-id=0002000000000000,timestamp=2016-04-06T15:00:32.217+0000)\n>\n> Top lane does allow Yasuo with so much more outplay potential, escapes, free farm than mid lane. Olaf is a very hard matchup, Malphite makes you want to bash your head against the keyboard, and destroys you late game. Poppy... Llaoi is very annoying, but manageable, and you out scale late, naut is pretty bad but I think it's an easier matchup than Malphite, Garen is Garen.\n\nI played against Rammus top recently as Yasuo. I did win game, but team carried me, i literally couldnt do anything.","replies":[{"poster":"FACE THE WlND","date":"2016-04-06T15:19:19.772+0000","up_votes":1,"down_votes":0,"body":"Couldn't do anything against the Yasuo? Rammus is a pretty hard counter.","replies":[]}]}]}]}]}]},{"poster":"archerno1","date":"2016-04-06T14:35:16.281+0000","up_votes":2,"down_votes":0,"body":"He is in a bit of a weak state atm because everyone and their mother play tanks or his counters on mid. His laning phase is very weak, he is squishy as hell and his weak ass shield is popped easily. Only thing that he has that still goes for him is that Windwall of his.\nOf course, very skilled Yasuo mains will still own with him, but thats due to their personal skill and experience. But if they are skilled enoough to play with Yasuo they would do much better with Zed or some other high skill required Assassin or midlaner. There is just no spot for him in this meta. Cause if there is something like Poppy top laner, Gragas jungler and Leona support as frontline and behind them Jhin and Lux terorizing your team, there is nothing you can do about it. Even if u somehow manage to ulti one of backlaners, you will die before u land. \nOverall Yasuo need buffs to his shield and base stats to make him kinda viable again.","replies":[{"poster":"PhantomGG","date":"2016-04-06T14:39:08.720+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=archerno1,realm=EUNE,application-id=3ErqAdtq,discussion-id=9y0fOOLj,comment-id=0001,timestamp=2016-04-06T14:35:16.281+0000)\n>\n> He is in a bit of a weak state atm because everyone and their mother play tanks or his counters on mid. His laning phase is very weak, he is squishy as hell and his weak ass shield is popped easily. Only thing that he has that still goes for him is that Windwall of his.\n> Of course, very skilled Yasuo mains will still own with him, but thats due to their personal skill and experience. But if they are skilled enoough to play with Yasuo they would do much better with Zed or some other high skill required Assassin or midlaner. There is just no spot for him in this meta. Cause if there is something like Poppy top laner, Gragas jungler and Leona support as frontline and behind them Jhin and Lux terorizing your team, there is nothing you can do about it. Even if u somehow manage to ulti one of backlaners, you will die before u land. \n> Overall Yasuo need buffs to his shield and base stats to make him kinda viable again.\n\nhonestly I would prefer buffs on his ultimate, I remember the days when a good yasuo ultimate won you the team fight, I am not saying it should be \"land ult win game\", but as of late I feel even when I land god tier five mand ults that I did absolutely nothing for my team.","replies":[{"poster":"FACE THE WlND","date":"2016-04-06T14:47:23.101+0000","up_votes":1,"down_votes":0,"body":"I think maybe instead of buffing his ultimate, they should revert either the E nerf where the damage can now only stack up to 50% to give him a slightly better early game, or simply allow his E to generate flow again. I think his ultimate is in a good spot right now, the damage may be underwhelming but if used right it can be game changing. Another suggestion could be to just buff his late game q damage, because if I am correct it's possible to get to a point in the game where an auto attack will do more damage than your q granted you may need a decent amount of ad. I think the best buff would be allowing Yasuo's E to generate flow again, it means that his shield will be up more often, and rewards you for maneuvering with your E.","replies":[]}]},{"poster":"FACE THE WlND","date":"2016-04-06T14:40:04.221+0000","up_votes":1,"down_votes":0,"body":"Poppy destroys Yasuo top, oh god I hate that matchup, I take Yasuo top exclusively unless I don't get top, in which case I'll take him mid and go the standard Shiv into IE build and take Warlords Bloodlust. I agree with you that Yasuo mid is easily shut down late game due to the excessive amount of tanks and being so squishy, but as you said an experienced Yasuo will understand how to weave in and out and use windwall at the right moments to team fight efficiently.","replies":[]}]},{"poster":"FACE THE WlND","date":"2016-04-06T15:25:47.477+0000","up_votes":1,"down_votes":0,"body":"Ouch! Downvotes! Why?","replies":[]},{"poster":"Axests","date":"2016-04-06T15:14:35.589+0000","up_votes":1,"down_votes":0,"body":"Strength of the ages is notoriously bad on top laners, because of how slow it stacks, it doesn't benefit you nearly as much in lane as grasp of the undying or warlords bloodlust do. Personally i prefer warlords, it makes him impossible to beat in lane sustain wise, and makes it difficult to trade with him. I'd also take something else other than attack speed glyphs, probably just magic resist, maybe scaling. The reason for that being that attack speed glyphs don't give as much as marks do, because they're the wrong \"rune type\" so you aren't fully benefiting from the rune slot. Also if i was building sunfire cape i'd build it first item, it's very powerful in lane right now. I'd also like my phantom dancer/shiv before triforce or infinity edge. Yasuo has been my favorite champ since release and is my most mastered champion by far, and this is how i've played him.","replies":[{"poster":"FACE THE WlND","date":"2016-04-06T15:18:29.647+0000","up_votes":1,"down_votes":0,"body":"Well, my reasoning is that it's a good option against ranged cancer champions, because it gives you some extra survivability and it's hard to get grasp procs off, if you look at my Yasuo matches I rarely ever take it, I usually take grasp, try it maybe you'll like it. :)","replies":[]}]},{"poster":"Nyhver","date":"2016-04-06T15:06:23.378+0000","up_votes":1,"down_votes":0,"body":"I think he's more balanced than overpowered/broken right now","replies":[{"poster":"FACE THE WlND","date":"2016-04-06T15:09:13.323+0000","up_votes":1,"down_votes":0,"body":"I completely agree, may just be due to this disgusting meta.","replies":[]}]},{"poster":"Salron","date":"2016-04-06T14:26:43.990+0000","up_votes":1,"down_votes":1,"body":"For all things good in this world please never take Strength of the ages on Yasuo","replies":[{"poster":"FACE THE WlND","date":"2016-04-06T14:33:06.023+0000","up_votes":1,"down_votes":0,"body":"Why? Explain your side, and I'll explain why I think it is good.","replies":[{"poster":"IronwallJackson","date":"2016-04-06T15:01:40.370+0000","up_votes":1,"down_votes":0,"body":"I imagine that it's because it gives you little to no advantage in lane, it worth 2 rubies mid game, and them becomes worthless late game. Not only that, but it does nothing that Yasuo wants.","replies":[{"poster":"FACE THE WlND","date":"2016-04-06T15:05:52.801+0000","up_votes":1,"down_votes":0,"body":"Try it, you might like it, it gives you some extra tankiness while you finish your first two items making it hard to duel Yasuo, I'm not saying it's better than Grasp, but it can be nice in some match ups. People are also starting to take strength of the ages mid lane for extra survivability. This is for top Yasuo also, so it gives extra damage on Titanic Hydra, though I can't see it being bad mid lane either, because warlords is good, but I don't seem to notice it much.","replies":[]},{"poster":"FACE THE WlND","date":"2016-04-06T15:04:19.392+0000","up_votes":1,"down_votes":0,"body":"Try it, you might like it, it gives you some extra tankiness while you finish your first two items making it hard to duel Yasuo, I'm not saying it's better than Grasp, but it can be nice in some match ups. People are also starting to take strength of the ages mid lane for extra survivability.","replies":[]}]},{"poster":"FACE THE WlND","date":"2016-04-06T14:55:32.572+0000","up_votes":1,"down_votes":0,"body":"Since you have disappeared, I'll explain. Most of the time you should take grasp of the undying in the top lane, but against ranged champions it is very hard to get those procs off so strength of the ages is better to give you some extra tankiness as you finish your first item or two so that you can survive, and it will increase the damage you do with titanic hydra which is nice. Another case would be against a champ that should be a relatively easy lane like Sion, or any other champ that will not be a threat in lane because you will end up benefiting much more from that extra 300 health than the unnecessary grasp procs.","replies":[]}]}]}]}