{"poster":"OPChampsSucks","date":"2018-06-23T15:43:45.125+0000","title":"Die tägliche Dosis Salz","subforum":"Allgemeiner Chat","up_votes":5,"down_votes":5,"body":"Anzahl der Games: 4\nAnzahl der AFK in meinem Team: 3 (Runde 1 2 AFK Runde 2 1 AFK)\nAnzahl der  Inter in meinem Team :1 (Runde 4)\nAnzahl der Flamer in meinem Team: 3 (Runde 1 1 Flamer, Runde 4 2 Flamer) \nAnzahl der AFK im Gegnerteam: 0\nAnzahl der Inter im Gegnerteam: 0\nAnzahl der Flamer im Gegnerteam: 1 (Dunkelziffer unbekannt) (Runde 4)\nAnzahl der Games ohne AFK/Inter/Flamer: 1 (Runde 3)\n\neine sch&ouml;ne gerechte Verteilung (&quot;Wenn du selber nie afk gehst hat der Gegner im durchschnitt mehr&quot;)  und ja so eine Statistik kriegt man hier auch problemlos &uuml;ber 40 Games hin und nicht nur &uuml;ber 4 :) \nSystem funktioniert perfekt. Macht bock wenn man sich einloggt und direkt solche Runden hat. :)\n\nUnd wie gehts euch so an diesem wunderbaren Tag? :) mein Mimimi bin ich jetzt erst mal f&uuml;r die n&auml;chsten 5 Runden losgeworden.\n\nEdit: danach das Game verlief ohne Probleme \n\ndas Game danach wd nen Afk \nDanach das Game zwar kein Afk aber jemand der seit min 1 pausenlos FF schreibt xd","replies":[{"poster":"Cohiba","date":"2018-06-24T10:39:47.809+0000","up_votes":1,"down_votes":1,"body":"Ich bekam soeben eine 14 Tages Sperre nach einem Game mit 3 Rassisten, wo ich mehrmals darum bat die 3 zu reporten und habe sie auch eine stück Schei*e egnannt, weil die sorgenfrei He*l Hi*ler, 88 etc. geschrieben haben..\nIch würde ja einen Tag Sperre oder 20 Spiele Chatsperre verstehen, weil ich einen Rassisten schei*e genannt habe.. aber 14 Tage..\n\nRiot ist echt unfähig..","replies":[{"poster":"5weeds","date":"2018-06-26T11:59:48.148+0000","up_votes":2,"down_votes":0,"body":"> [...] wo ich mehrmals darum bat die 3 zu reporten [...]\n\nAndere zum Reporten zu fordern, ist selbst Reportbar.\n*Denn* (ganz wichtig zum Verstehen): Es ist egal von wie vielen Spieler Jemand pro Runde reporten. Ein einzelner Report hat die selben Auswirkungen wie 9. Das einzige, dass solche Reportforderungen bewirkt, ist dass sich Jemand angegriffen fühlt. Also ist das stinknormaler flame. Und für Flame wird man bestraft.\n\n> [...] habe sie auch eine stück Scheie egnannt, weil die sorgenfrei Hel Hiler, 88 etc. geschrieben haben.. [...]\n\nUnd in wie fern hat das Jemanden geholfen? \nDas solche Leute absolut bescheuert sind, ist klar. Wobei die drei \"Rassisten\" wahrscheinlich keine Nazis sind, sondern andere damit Ärgern wollten (mit unterirdischem Niveau).\n\nWenn dir so Jemand im Spiel begegnet, reporte ihn und fertig. Abgesehen von muten, **machst du bitte nichts weiteres**.\nDie kassieren dann ihren Bann und fertig. Sie zu beleidigen führt nur dazu, selbst bestraft zu werden (wie du jetzt weißt).\n\n> Ich würde ja einen Tag Sperre oder 20 Spiele Chatsperre verstehen, weil ich einen Rassisten scheie genannt habe.. aber 14 Tage..\n\nDie härte der Bestrafung ist geregelt. Es wird nicht willkürlich entschieden, wie lange Jemand gebannt wird.\n\n> Riot ist echt unfähig..\n\nInwiefern? Sie haben doch Ihren Job gemacht und einen Spieler bestraft, der geflamet hat.\nUnfähig war in diesem Fall deine Selbstbeherrschung. Und um dir das klar zu machen, wurdest du gebannt.\nNutze diese Erfahrung.","replies":[]}]},{"poster":"PEPZI","date":"2018-06-23T15:58:29.175+0000","up_votes":2,"down_votes":0,"body":"naja so halt..\nhttps://www.youtube.com/watch?v=aSJRqCmODZM","replies":[]},{"poster":"Epic Melons","date":"2018-06-24T02:04:08.681+0000","up_votes":2,"down_votes":1,"body":"Was ihr immer für einen Unfug mit AFK Leuten erzählt. Ich hatte in den letzen 200 Spielen max. 1-2 Leute die AFK waren.","replies":[]},{"poster":"GitGudOrDie","date":"2018-06-23T23:51:35.497+0000","up_votes":2,"down_votes":1,"body":"so ich hab mich entschlossen ich mach dazu mal eine statistik jedes spiel was ich mach trage ich AFKLER/FEEDER/CARRYS/FLAMER ein remakes werden auch gezählt sowie die gespielten minuten und die durchschnitts zeit pro game :D https://docs.google.com/spreadsheets/d/13klwYfV6ZHC68So_-3653rSa8Zqs1V-X5X3weQtJkuw/edit?usp=sharing   ist das doc jeder kann lesen^^","replies":[]},{"poster":"Noxempire","date":"2018-06-23T15:48:25.849+0000","up_votes":2,"down_votes":1,"body":">eine schöne gerechte Verteilung (\"Wenn du selber nie afk gehst hat der Gegner im durchschnitt mehr\") \n>\n\nStimmt halt einfach nicht. Die **Wahrscheinlichkeit** ist höher dass der Gegner im Durchschnitt mehr AFKs hat, solange du selber nicht einer bist. Nur weil du 2 AFKs hintereinander hast schützt dich dass nicht davor auch in dem dritten einen zu haben, es ist nur sehr unwahrscheinlich. \n\nStochastik Orius. Stochastik. \nIch bin ehrlich gesagt zu faul nachzuprüfen ob deine ganzen Behauptungen stimmen. \n\nNur Mal so als Anmerkung, welches System kann denn AFKing im Vorhinein verhindern..? \n\nÜbrigens bin ich der Meinung dass Karthago zerstört werden sollte.","replies":[]},{"poster":"Damnimwaytodrunk","date":"2018-06-25T04:17:31.936+0000","up_votes":1,"down_votes":0,"body":"Mimimi Ich habe nur troller in meinem Team und die anderen nie Mimimimi","replies":[]},{"poster":"Mjöllnir1990","date":"2018-06-24T01:11:48.485+0000","up_votes":1,"down_votes":0,"body":"ich weiß nich wer du bist ingame... aber das mag auch nur an mir liegen und eig bist du super bekannt ^^ \naber das ganze kann man halt immer behaupten... solange da nix ersichtliches is macht es doch keinen spaß...","replies":[]},{"poster":"Izaya Kumiho","date":"2018-06-23T15:57:20.894+0000","up_votes":1,"down_votes":0,"body":"Komisch, ich habe sowas eher selten in meinem Team...\nEntweder hast du unglaublich krasses Pech, oder du ärgerst deine Teammates zu sehr :P","replies":[{"poster":"OPChampsSucks","date":"2018-06-23T17:27:47.397+0000","up_votes":1,"down_votes":0,"body":"Das tue ich sogar recht gerne oO","replies":[]}]},{"poster":"Wolf Husky","date":"2018-06-24T08:32:13.079+0000","up_votes":1,"down_votes":1,"body":"haha nur 3 Flamer in 4 games...ich bin neidisch \n\nOb du es glaubst oder nicht, wenn du mehr als 40 Spiele spielst, wird es gerecht, ja sogar perfect für dich sein, weil in dein Team nur 4 potentielle Troller, flamer etc. sein kann(Im Falle, dass DU kein flamer etc. bist...)","replies":[]}]}