{"poster":"XxTheKilaxProxX","date":"2017-02-23T05:27:08.174+0000","title":"Tips para ser mejor JG y salir de B5?","subforum":"Guias y consejos","up_votes":4,"down_votes":0,"body":"Hola, hoy vengo a dar mi opinion sobre lo de last pi... xd no\r\n\r\nHoy vengo a pedir su ayuda, y es que estoy en b5 e.e y quiero salir (por favor, no comente lo tipico de que si flamean muteo y eso xd) uno de mis roles favoritos y es el que juego siempre es jg y quisiera pedir consejos para poder mejorar en lol ya que arranque hace 6 meses, cualquier insulto como: bronce qlia* o eres un m**** no pienso no responderlos...\r\n\r\nSaludos!","replies":[{"poster":"rokushoger","date":"2017-02-23T11:37:26.404+0000","up_votes":2,"down_votes":0,"body":"1- **La jungla no es una isla**, tenés que estar pendiente de que pasa en las lineas. Si ves a algún enemigo que pusheo más de la mitad de su linea, y tu compañero tiene mitad de vida al menos hacete un gank (a menos que vos solo puedas matarlo, porque si tienen poca vida tienden a quedarse atrás y dejarte morir).\n\n2- **Conoce a tu enemigo,** no es lo mismo jugar contra un amumu (que sabés que si o si empieza en blue porque necesita el mana) a jugar contra un lee sin, que generalmente empieza en red. Si es un lee probablemente busque un gank a nivel 2 además, y si empieza por red, adivina que linea va? exacto, o mid o top, así que cuando toques nivel dos atento a esas lineas. Debes conocer que enemigo tienes enfrente y que capacidades tiene tanto él como tú.\nPor ejemplo, si te toca un shaco enfrente, y tu sos un maokai, las vas a pasar negras, porque shaco va a ir con sus malditas cajas a por su blue, y luego directo a tu red, y como tu debes iniciar si o si en blue, más vale que tu team te ayude a proteger el red, o le habrás regalado uno al enemigo.\n\n3- **Tené siempre en cuenta los timer** Esto no es solo porque \"hay que hacer dragon\", no, hablo de todos los timer. Por ejemplo, si pudiste ver cuando murió el blue enemigo, y tenés timer, y del lado de enfrente una sejuani jungla, es probable que quiera hacerse el blue ella o el mid en el momento que salga. Campear tu y tus compañeros esa zona puede redituarles en un lindo gank y algunas muertes fáciles.\n\n4- **Reconoce una linea perdida**, esto suena horrendo, pero no puedes ayudar a todos. Si ves que una linea ya está perdida, concentra tu esfuerzo en hacer que crezcan tus compañeros que tienen chance de ganar. Esto reditua en assist y kills que les daran ventaja, al contrario que el que va perdiendo linea por mucho, que probablemente, y con mucha suerte, solo logres cerrar un poco la brecha de oro (y eso si el enemigo feed no se lleva una doble contigo y tu compañero). Es mejor perder mid pero ganar en top y bot en early, a hacer que el mid pierda por un poco menos y que bot y top queden o iguales o por detrás.\n\n5- **Conoce tu potencial daño y cc**, esto es bastante obvio, tenés que conocer cuanto daño podes hacer, y cuanto podes retener al enemigo. Supongamos que sos una sejuani, bastante CC, y relativamente poco daño explosivo, y tenés en mid a un zed aliado, y en top a un maokai. Por mucho cc que tengan entre tu y el maokai, si en top tenés un vladimir por ejemplo de enemigo es al santo botón gankearlo, puesto que activara su maldito charco y se irá por ustedes no tener suficiente burst. En cambio si vas a mid, y el contrario es digamos un malzahar, tendrás más chances de generar oro, dado que mientras tu tiras cc tu zed se lo come vivo, malzahar tendrá defensas pero tu las romperas antes, y además no tiene movilidad.\nAdemás hay que tener cuidado de no sobreestimar las capacidades de tu campeón, es decir, por mucho que pegue ww, una buena fiora que sepa moverse probablemente te parte al medio, cuidado con esto!\n\n6- **Todo lo anterior es relativo**, esto es lo más difícil de ser jungla, es el rol en el que más te tenés que adaptar la lo que pase! lo anterior son consejos generales, pero la realidad de una partida cambia minuto a minuto, y puede que tengas que ir en contra de alguno de ellos, así que como jungla que sos tenés que adaptarte.\n\nEDIT: Te dejo una guía que acabo de leer que complementa bastante lo que te dije.\nhttp://boards.las.leagueoflegends.com/es/c/guias-y-consejos/tseAdljz-como-ser-un-buen-jungla-guaua-hecha-por-un-main-jungla","replies":[{"poster":"JD20Smurf","date":"2017-02-23T16:07:35.613+0000","up_votes":1,"down_votes":0,"body":"Le recomendaste mi guía <3, ahora que me acabo de dar cuenta, no puse de hacer CounterJungla en mi guía, xd, voy corriendo a ponerlo.","replies":[{"poster":"rokushoger","date":"2017-02-23T16:24:09.214+0000","up_votes":1,"down_votes":0,"body":"Si, me pareció muy buena, y además hablaba justo de las cosas que yo no puse, así que genial.","replies":[]}]},{"poster":"JD20Smurf","date":"2017-02-23T16:01:51.716+0000","up_votes":1,"down_votes":0,"body":"Le recomendaste mi guía <3","replies":[]}]},{"poster":"RodriiB","date":"2017-02-23T06:10:18.044+0000","up_votes":2,"down_votes":0,"body":"Aprende a jugar bien 2 roles, y en cada rol 2 campeones como maximo 3. Juga campeones que sean mecánicamente sencillos, que no requieran mucho skill estilo lee, nidalee, etc. Trata de entender que función cumple tu campeon. \nPor más que todos los campeones tengan una build core de 2 o 3 ítems no todas las partidas debes armarte igual, saber que comprar es lo que puede darte la partida. \nComo todo buen jungla además de ganks lo que debes ayudar a tu equipo es aportando visión, los centinelas son baratos y aportan muchísimo (wardeando lugares claves y haciendo los cangrejos) y tomando objetivos. Una vez que gankes si salio bien trata de tirar alguna torre, ir por dragón, etc. No dejes nunca de farmear, si te paseas por el mapa sin hacer nada estas perdiendo oro y experiencia. \nComo campeones sencillos y efectivos en la jg, tenes a amumu, yi, voli, vi. \n\nEl resto es practica y experiencia. Trata de no forzar demasiado, hacienndo jugadas del tipo me tiro contra 2 y veo que sale, solamente minimizando tus errores veras una gran mejoria. Tene mucho autocritica. Y de cada partida por más que ganes o pierdas, trata de volver a hacer lo que hiciste bien y lo que hiciste corregirlo para la próxima y tratat de no volver a hacerlo.","replies":[{"poster":"JD20Smurf","date":"2017-02-23T15:57:11.777+0000","up_votes":1,"down_votes":0,"body":"Lee no requiere skill ?, Te quiero ver haciendo un insec al ADC para patearlo y que tu equipo lo mate mientras los 4 del otro team te pegan y vos salis vivo ;)","replies":[{"poster":"RodriiB","date":"2017-02-23T20:55:40.600+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=JD20Smurf,realm=LAS,application-id=8sKIclmi,discussion-id=LB8vsarn,comment-id=00020000,timestamp=2017-02-23T15:57:11.777+0000)\n>\n> Lee no requiere skill ?, Te quiero ver haciendo un insec al ADC para patearlo y que tu equipo lo mate mientras los 4 del otro team te pegan y vos salis vivo ;)\n\nMe parece que leíste mal. Relee y fijate lo que puse ;)\n\n\"Juga campeones que sean mecánicamente sencillos, que no requieran mucho skill estilo lee, nidalee, etc. \"\n\n;) ;) ;) ;)","replies":[]}]}]},{"poster":"aliveondarkness","date":"2017-02-23T16:01:00.864+0000","up_votes":1,"down_votes":0,"body":"Para salir de bronze, tienes que carrear todas las partidas, lo mismo en silver.\nRecien en oro y adelante es cuando se juega en equipo.","replies":[]},{"poster":"JD20Smurf","date":"2017-02-23T15:59:08.466+0000","up_votes":1,"down_votes":0,"body":"http://boards.las.leagueoflegends.com/es/c/guias-y-consejos/tseAdljz-como-ser-un-buen-jungla-guaua-hecha-por-un-main-jungla Leete esta guía que la hice ayer, y estuve 1 hora y media, es muy completa y te explico TODO para ser un buen jungla.","replies":[]},{"poster":"Arthur Pendragon","date":"2017-02-23T06:16:27.828+0000","up_votes":1,"down_votes":0,"body":"Si no piensas no responderlos...significa que piensas responderlos? {{sticker:zombie-brand-clap}}","replies":[]},{"poster":"BlRaWeN","date":"2017-02-23T05:41:27.529+0000","up_votes":1,"down_votes":0,"body":"Una recomendación buena seria que si sentis que no sos suficientemente bueno para carrear sola a 4 te busques un duo (principalmente mid o top). Si sentis que si podes carrear, juga con campeones que lo hagan (yi, trynda, kha, rengar, etc...) para asegurarte que si vos trabajas bien, podes mandarte y ganar la partida con la menor ayuda posible.\nOtra recomendación es spammear uno o dos campeones en vez de intentar jugar 25 a la vez, saber jugar muy bien un par y que no te los baneen es mejor que jugar con algo que sabes mas o menos.","replies":[]},{"poster":"Gretta Thunberg","date":"2017-02-23T05:33:56.354+0000","up_votes":1,"down_votes":0,"body":"Buenas mira primero que todo yo no soy bien jungler solo uso a reksai cuando me toca a si que un consejo como tal no te puedo dar en lo que si te puedo ayudar es en lo siguiente.\n\nCada partida tomala como enseñanza no te tiltees solo juega deja que la partida fluya si en la partida cometiste un error que les hizo perder la partida a la proxima no cometas el mismo error.\n\nno flamees y no pesques al flameo solo juega flamear te desconcentra.\n\njuega solamente piensa en esto ya estas en b5 no tienes nada que perder de hecho tienes mas que ganar que perder.\n\nactitud siempre manten una actitud positiva ten en cuenta que tu subes a lo que este tu nivel si no subes no te frustes y aqui viene el primer punto si aprendes al final subiras ten en cuenta que cada division es mas nivel.\n\neso seria salu3","replies":[]}]}