{"poster":"Always bot lane","date":"2017-06-04T00:27:31.684+0000","title":"Remake please?","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"So what am I supposed to do when I get a loss due to an late join, who joins 2 seconds before the game can be remade, and said late join forced someone else to AFK the game because he joined late, so the other guy said \"well if our jungler is afk we can remake, so im leaving now\" and then what you get is a 1v5 4 minutes into the game because the other 2 players in the game decided since it was a remake anyways, we're gonna flash under towers. But going back to the issue, we couldn't remake because that last person joined 2 seconds before remake was allowed, so, what am I supposed to do now?","replies":[{"poster":"Broporo","date":"2017-06-04T01:02:11.799+0000","up_votes":1,"down_votes":0,"body":"Oh wow, that really sucks that some of the other players intentionally left the match to try and force a remake. Even though we introduced the remake feature, it's not really intended for people to throw games just to try and get that game remade. Essentially, you're encouraged to play the game as normal until a remake becomes available. I'm not entirely sure why someone joining the game late would end up kicking another player, but I'm pretty sure those two events aren't related. \n\nTo be able to [**remake a game**](https://support.riotgames.com/hc/en-us/articles/208754686), there are a few different requirements that need to be met. It's hard for me to be sure of what went wrong since I'm not sure which game this was, but I'm willing to guess that either the AFK player had not been AFK for 90 seconds, or someone was able to score First Blood before the remake was available.","replies":[{"poster":"what you deserve","date":"2017-06-04T19:57:27.050+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Broporo,realm=NA,application-id=osqw6G4M,discussion-id=Etvh4fQg,comment-id=0000,timestamp=2017-06-04T01:02:11.799+0000)\n>\n> Oh wow, that really sucks that some of the other players intentionally left the match to try and force a remake. Even though we introduced the remake feature, it&#x27;s not really intended for people to throw games just to try and get that game remade. Essentially, you&#x27;re encouraged to play the game as normal until a remake becomes available. I&#x27;m not entirely sure why someone joining the game late would end up kicking another player, but I&#x27;m pretty sure those two events aren&#x27;t related. \n> \n> To be able to [**remake a game**](https://support.riotgames.com/hc/en-us/articles/208754686), there are a few different requirements that need to be met. It&#x27;s hard for me to be sure of what went wrong since I&#x27;m not sure which game this was, but I&#x27;m willing to guess that either the AFK player had not been AFK for 90 seconds, or someone was able to score First Blood before the remake was available.\n\n\nCan you stop spreading the first blood myth? That was never implemented on Live NA servers.","replies":[{"poster":"Broporo","date":"2017-06-04T23:24:02.107+0000","up_votes":1,"down_votes":0,"body":"I'm not sure where this idea that \"First Blood\" is a myth, but I'd love to discuss this more. If you looked over the remake FAQ I linked you can see the First Blood happening before someone AFK's will, in fact, disable a remake. But again, I'd love to talk about this with you to see where your thoughts are coming from!","replies":[{"poster":"DeathBurst","date":"2017-06-05T18:41:33.431+0000","up_votes":3,"down_votes":0,"body":"> I'm not sure where this idea that \"First Blood\" is a myth\n\nWell, it comes from people experiencing in game that a remake still happens despite kill happenings. Also, the phrasing in your first post is quite ambiguous and can be interpreted as \"if a kill happens before the 3:00 mark when /remake becomes available, you won't be able to remake\" instead of \"if a kill happens before the disconnection, remake won't be available\".\n\nThe first one is false, if someone DC at 1:00, then a First Blood happens at 2:00, /remake WILL be available at 3:00.\n\nAlso note that First Blood only counts if it's against the team trying to remake. If that teams get it, it doesn't prevent them to /remake, which is yet another reason people are real fuzzy on how the system functions and/or think that \"First Blood is a myth\".","replies":[]},{"poster":"what you deserve","date":"2017-06-06T09:02:31.279+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Broporo,realm=NA,application-id=osqw6G4M,discussion-id=Etvh4fQg,comment-id=000000000000,timestamp=2017-06-04T23:24:02.107+0000)\n>\n> I&#x27;m not sure where this idea that &quot;First Blood&quot; is a myth, but I&#x27;d love to discuss this more. If you looked over the remake FAQ I linked you can see the First Blood happening before someone AFK&#x27;s will, in fact, disable a remake. But again, I&#x27;d love to talk about this with you to see where your thoughts are coming from!\n\nWhen /remake went to PBE for testing, anyone scoring first blood would prevent a remake, but on live that was never implemented. further explanation posted by DeathBurs7 so no more detail from me","replies":[]}]}]},{"poster":"Hello I am Bird","date":"2017-06-04T21:40:15.273+0000","up_votes":1,"down_votes":1,"body":"The first blood thing doesn't exist in the NA servers at least","replies":[]}]}]}