{"poster":"DemonicDreamEye","date":"2015-02-16T09:14:31.123+0000","title":"HTTP Server stellt keine Verbindung her","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hey Leute & Riot Mitarbeiter ich hab da mal voll das Problem\r\n\r\nmein LoL öffnet sich nicht mehr , gestern Abend lief noch alles ohne Probleme und nun stellt der Luncher keine Verbindung zum HTTP Server her,  ich habe das Problem schon gegooglet aber nix von alle dem hat geklappt, Habe :\r\n\r\nLoL frei gegeben Bzw in der Firewall hinzugefügt ect und nix ist .. \r\n\r\nich könnte los heulen, da hat man zwei Wochen Urlaub und dann sowas\r\n\r\nBitte um Hilfe\r\n\r\n\r\nMfg. DreamWars21","replies":[{"poster":"DemonicDreamEye","date":"2015-02-16T12:28:22.815+0000","up_votes":1,"down_votes":0,"body":"Mal ganz ehrlich das kann doch echt nur noch an Riot liegen, da ich mir auch die aktuellste install datei runter laden wollt, und der mir jetzt eine Fehler Meldung gibt das die Seite im Moment nicht aufgerufen werden kann .. ach das ist doch schon nicht mehr lustig :/ \n\nWäre echt schön wenn man da schnellst möglich eine Lösung finden würde, bei der Seite der Install datei, und bei dem HTTP Server..","replies":[{"poster":"Vergyl","date":"2015-02-16T12:33:56.622+0000","up_votes":1,"down_votes":0,"body":"Ich bin mir da nicht sicher, habe derzeit allgemein Einwahlschwierigkeiten mit Internetseiten. Ich suche natürlich selbst nach Lösungen. Die ein oder andere Seite lässt sich nicht aufrufen bzw schaffe ich es nicht eine Verbindung herzustellen. Grenzt man es auf den Zufall ein, dass wir hier drei Fälle haben mit Primacom als Anbieter(einer von vielen) so könnte dieses Problem sich auch auf den Anbieter zurück führen lassen. Ist jedoch kein Garant.","replies":[{"poster":"DemonicDreamEye","date":"2015-02-16T12:42:07.556+0000","up_votes":1,"down_votes":0,"body":"Na dann machen wir drei jetzt schere, stein, Papier, und der verlierer muss da anrufen und denn mal denn marsch blasen xD lach\n\nNaja hast wohl recht das es an uns liegt .. aber ich finde es doof :/ ich will zocken xD","replies":[{"poster":"Vergyl","date":"2015-02-16T12:58:19.108+0000","up_votes":2,"down_votes":0,"body":"Laut Primacom existieren diverse Störungen im Bereich Sachsen-Anhalt. Telefonisch schwer zu erreichen, als Grund wird eine Grippewelle genannt. Getreu dem Motto \"Alles kann, nichts muss!\" kann der Fehler natürlich auch wo anders liegen. Ich bin jedenfalls noch immer nicht online gekommen geschweige denn meinen Client zu Starten gebracht.","replies":[{"poster":"n3rds","date":"2015-02-16T13:01:54.831+0000","up_votes":1,"down_votes":0,"body":"dann scheinen die störungen auch in sachsen zu sein.\nich hab das gleiche problem","replies":[{"poster":"Kuu","date":"2015-02-16T17:50:37.927+0000","up_votes":1,"down_votes":0,"body":"Sachsen und Primacom... gleiches Problem.\n\nViele Webseiten und Dienste funktionieren nicht mehr.\n\nBisher festgestellt: \n- Webseiten: amazon, ebay, chip, imdb\n- Dienste: ms essentials, windows updates, hearthstone, lol\n\nIch vermute mal die Liste ließe sich endlos weiterführen.","replies":[{"poster":"Kuu","date":"2015-02-17T10:18:50.055+0000","up_votes":1,"down_votes":0,"body":"Geht seit heute früh wieder bei mir. Ebay, Amazon und Co. sind wieder erreichbar...","replies":[]}]},{"poster":"DemonicDreamEye","date":"2015-02-16T13:05:36.395+0000","up_votes":1,"down_votes":0,"body":"und auch Primacom ? \n\nja dann wird da wider irgendeiner der Mitarbeiter auf irgendwas geklickt haben, und jetzt sitzen alle davor und versuchen es zu losen xD frech lach, und dabei wurde jetzt Sachsen auch getroffen xD","replies":[{"poster":"Pørki","date":"2015-02-16T13:58:55.391+0000","up_votes":1,"down_votes":0,"body":"Ich garantiere euch zu 100% das es an der Primacom liegt. Mit meinen Mobilen Hotspot (Telekom) lies sich das Spiel starten.","replies":[]}]},{"poster":"DerDönergerät","date":"2015-02-16T13:09:06.821+0000","up_votes":1,"down_votes":0,"body":"Nachdem schon vor ein paar Wochen das Internet ganz weg war... Primacom hat es echt drauf :(","replies":[]}]},{"poster":"RR Lowqeh","date":"2015-02-16T14:44:07.934+0000","up_votes":1,"down_votes":0,"body":"Selbes Problem hier in Berlin.\n\nEs ist zum heulen zumal es ja auch nicht das erste mal dieses Jahr ist das Primacom Probleme hat.","replies":[]},{"poster":"DemonicDreamEye","date":"2015-02-16T13:02:22.593+0000","up_votes":1,"down_votes":0,"body":"bei mir das gleiche, so zum kotzen ehy .. aber naja was will man machen wa :/","replies":[]}]}]}]}]},{"poster":"Vergyl","date":"2015-02-16T11:07:33.032+0000","up_votes":2,"down_votes":0,"body":"Mahlzeit zusammen,\n\nhabe das selbe Problem wie bei meinem Vorredner beschrieben. Die beiden angebenen Lösungsvorschläge haben bei mir leider nicht geholfen. Habt ihr noch weitere Ideen? \nLG Vergyl","replies":[{"poster":"MrSnowy","date":"2015-02-16T11:50:31.034+0000","up_votes":2,"down_votes":0,"body":"Ich bin Ebenfalls bei Primacom und habe dieses Problem..\nIch hab das mit Hotspot auch schon ausprobiert und kann darüber auch ohne Probleme spielen...Jedoch sobald ich das Lan wieder reinstecke bekomme ich erneut die Fehler Meldung HTTP Patch Fehler etc...Ich konnte die ganzen Jahre ohne Probleme spielen und auf einmal soll da irgendwas nicht mehr funktionieren? Also Sowohl an der Internetverbindung als auch an mein Sicherheitseinstellungen kann es nicht wirklich liegen..Vermute eher das es ein IP-Adressen Problem ist...Jedoch auch ein Router neustart oder Reset hat hier nicht geholfen..Also ich versuch gern weitere Lösungs Vorschläge. \n\nPs Bin aus Sachsen-Anhalt ;-)","replies":[{"poster":"DemonicDreamEye","date":"2015-02-16T12:15:17.263+0000","up_votes":1,"down_votes":0,"body":"und wo da ? :D und M oder W ? xD","replies":[{"poster":"Vergyl","date":"2015-02-16T12:20:26.211+0000","up_votes":1,"down_votes":0,"body":"Ist auch mein Bundesland, jedoch unserem Problem entgegen nicht zielbringend oder? ","replies":[{"poster":"DemonicDreamEye","date":"2015-02-16T12:24:30.381+0000","up_votes":1,"down_votes":0,"body":"Lach xD jz sind wir auf zock endzug und werden lustig, bin dabei xD \ndas es ein bundesland weiß jeder, naja außer ich da hab ich immer in der schule geschlafen *lach* und nein bringt es uns nicht, habe aber hier mich umgehört und es hat denn anschein als wäre ich der einzigste in Aschersleben der LoL zockt ^.^ deswegen fragte ich schlimm ? und Vergyl ? M oder W ? Lieb frag :D und woher ?:D da wir ja nicht zocken können können wir uns ja unterhalten :D","replies":[{"poster":"Vergyl","date":"2015-02-16T12:35:38.437+0000","up_votes":1,"down_votes":0,"body":"Ich komme aus Magdeburg. Mein Geschlecht dürfte hier eigentlich keine Rolle spielen oder schreibst du in unterschiedlichen Ausdrucksformen bei Mann/Frau?","replies":[{"poster":"DemonicDreamEye","date":"2015-02-16T12:40:23.613+0000","up_votes":1,"down_votes":0,"body":"Nein, ich schreibe mit jedem Gleich, hab nur in all den Jahren wo ich LoL spiele, nicht viele Frauen gesehen, und auch damals als ich noch in einem Clan war hatten wir nie glück mit einer Frau bzw Mädchen zu zocken, klar einige aus mein ehemaligen Clan haben sich angestellt wie ein Mädchen aber sie waren ja keine :D und außerdem bin ich generell Netter zu Frauen wie zu Männern :D da wir Kerle eh  doof sind frech lach xD","replies":[]}]}]}]}]}]}]},{"poster":"Pørki","date":"2015-02-16T11:14:30.521+0000","up_votes":2,"down_votes":0,"body":"Bei welchen Internetanbieter seid ihr denn?","replies":[{"poster":"Vergyl","date":"2015-02-16T11:17:37.955+0000","up_votes":2,"down_votes":0,"body":"Primacom","replies":[{"poster":"DemonicDreamEye","date":"2015-02-16T11:34:59.428+0000","up_votes":1,"down_votes":0,"body":"Lach, darf ich dann mal fragen woher du kommst :D?","replies":[{"poster":"Vergyl","date":"2015-02-16T11:50:27.506+0000","up_votes":1,"down_votes":0,"body":"beantworte ich dir gern ingame, sobald ich es schaffe mich einzuloggen ^^","replies":[{"poster":"DemonicDreamEye","date":"2015-02-16T11:56:41.690+0000","up_votes":1,"down_votes":0,"body":"Lach, ja ich will auch endlich das sich der client öffnet >.< oha ich starte jetzt einfach immer wider neu","replies":[]}]}]}]},{"poster":"AI SpiritRush","date":"2015-02-16T19:18:30.917+0000","up_votes":1,"down_votes":0,"body":"Primacom","replies":[]},{"poster":"DemonicDreamEye","date":"2015-02-16T11:45:44.320+0000","up_votes":1,"down_votes":0,"body":"Uff wenn ich dir das jetzt so auf Anhieb sagen könnte, ganz komischer Name .. Moment..\n\nPrimacom  habe ich und eigentlich habe ich auch eine verdammt gute Leitung mit 25,000 die von denn eigentlichen 50,000 ankommen ..\n\nund das mit dem Mobilen Hotspot (Handy) wird nix, da ich über LAN spiele und in mein Pc keine WLAN karte ist..\n\nich finde das echt komisch, da ich jetzt seit Wochen ohne irgendwelche Probleme spielen konnte, und ich seit der Installation von LoL nix, aber auch gar-nix mehr auf denn Rechner drauf geschmissen habe .. \n\nund jetzt mal eine ganz dumme frage, da ich mich damit nicht so auskenne, bei einer der Lösungsvorschläge heißt es ja LoL in der Firewall frei zu geben und so, habe ich ja auch gemacht, nur da waren noch einige HTTP- Sachen die kein harken hatten, und ich kann da ein mal Privat und einmal für Öffentlich ein Harken setzten .. hatte dann zu Vorsicht bei allen HTTP- Sachen und bei LoL soweit überall an beides ein Harken dran gemacht .. siehe Anhang..\n\nwar das nun richtig ?\n\nMfg. DreamWars21","replies":[{"poster":"Pørki","date":"2015-02-16T15:00:28.770+0000","up_votes":1,"down_votes":0,"body":"Mach am besten alles was du gemacht hast, um das \"Problem\" zu beheben rückgängig. Alles was hilft ist ein Anruf beim Provider... chip.de und ebay.de lassen sich ja auch nicht aufrufen.","replies":[]}]}]},{"poster":"Alustus","date":"2015-02-16T10:24:45.099+0000","up_votes":3,"down_votes":1,"body":"könnte an deinen Internet Optionen liegen.\nHast du den Firewall auch schon einmal ganz ausgeschaltet? \n\nRiot hatte/hat mal lösungsvorschläge für probleme gepostet, werde mal schaun ob ich sie finde.\n\nEdit:\nHabe gerade ein Forum gefunden, wo jemand das gleiche Problem hatte.\nBei ihm hat folgendes funktioniert.\n\n\nÄndere deine DNS zu Googles DNS\n-Öffne das 'Netzwerk und Freigabecenter' in der Systemsteuerung.\n-Klicke auf 'Adaptereinstellungen ändern'\n-Rechtsklicke auf deinen Momentanen Adapter (deine MOMENTANE Verbindung) und klicke auf Einstellungen.\n-Suche 'Internetprotokoll Version 4 (TCP/IPv4)', und mach einen Doppelklick drauf.\n-Wähle unten 'Folgende DNS-Serveradressen verwenden', und gebe folgendes ein:\nBevorzugter DNS server: 8.8.8.8\nAlternativer DNS server: 8.8.4.4\n-Klicke zweimal auf 'OK' und versuche das Spiel neu zu starten.","replies":[{"poster":"Pørki","date":"2015-02-16T11:03:44.291+0000","up_votes":2,"down_votes":0,"body":"Falls das nicht geht, probier das mal:\n- Trenne deinen Internetanschluss\n- Verbinde dich mit einen mobilen Hotspot (Handy)\n- Starte das Spiel und log dich ein\n- bevor du in ein Spiel gehst, verbindest du dich mit deinen alten Internetanschluss\n\nEdit: Teste das lieber in einen Custom Spiel... Ich komme nach der Championselect nicht in ein Spiel.","replies":[{"poster":"MrSnowy","date":"2015-02-16T12:08:11.038+0000","up_votes":1,"down_votes":0,"body":"Funktioniert alles nicht...Wollte es nun neu Runterladen und bei der Download Seite kann ich es nicht mehr Downloaden weil die Webseite angeblich nicht verfügbar sei..Und Internet hab ich überall? Was ist denn das nun für ein Problem..Nun kann ich da nichts machen weil angeblich nichts mehr funktioniert? Gestern Morgen ging es doch noch Alles? Und seit dem hab ich auch nichts geändert oder sonst was...Wäre doch echt gut wenn da mal eine wirkliche Lösung kommt..Nicht das die aktuellen unlogisch waren \"\"Hab sie auch alle Ausprobiert\"\"  aber davon hat nichts geholfen..Nicht mal die Vorinstallierung ist jetzt möglich..","replies":[]}]}]},{"poster":"MrSnowy","date":"2015-02-17T03:45:31.348+0000","up_votes":1,"down_votes":0,"body":"Ich weiß nicht was es ist..:Aber bei mir geht es wieder nicht und langsam pisst es mich auch wirklich an...","replies":[{"poster":"Vergyl","date":"2015-02-17T07:14:27.100+0000","up_votes":1,"down_votes":0,"body":"Ich bin auch wieder erneut in Störung :/...","replies":[]}]},{"poster":"Vergyl","date":"2015-02-16T23:53:46.907+0000","up_votes":1,"down_votes":0,"body":"0 : 5 2 UHR\nPRIMACOM hats geschafft.","replies":[]},{"poster":"WallRider2302","date":"2015-02-16T23:43:03.157+0000","up_votes":1,"down_votes":0,"body":"ES GEHT WIEDER seit 2 minuten kann man sich wieder einloggen :D","replies":[]},{"poster":"MrSnowy","date":"2015-02-16T21:30:19.802+0000","up_votes":1,"down_votes":0,"body":"So ich hab da nochmal angerufen...Nach Ca 35Min Warteschlange und die behinderte Meldung \"\"Die Grippewelle habe auch unsere PrimaCom Mitarbeiter erwünscht daher kann es zu erheblichen warte Zeiten kommen, Wir bitte um ihr Verständnis\"\" Aber Wie soll ich da bitte Mitgefühl haben wenn bei uns einfach nichts läuft und wir die Menschen dafür bezahlen das sie uns die Leistung des Vertrages erfüllen?\n\nRaus gekommen ist Natürlich nicht Viel..:Wir leiten das an den Technischenmitarbeitern weiter und hoffe auf eine Schnelle lösung. Bla bla bla ich weiß ehrlich gesagt nicht was ich davon nun halten soll.","replies":[]},{"poster":"Vergyl","date":"2015-02-16T13:10:02.962+0000","up_votes":1,"down_votes":0,"body":"Mein primacom Medienberater hat auf den Kundendienst in Leipzig  verwiesen. Der soll die ip neu vergeben können und somit das Problem beheben. Ich hänge mich da nun in die Warteschleife, ich gebe Bescheid wenn ich Erfolg zu vermelden habe.","replies":[{"poster":"Vergyl","date":"2015-02-16T13:17:37.604+0000","up_votes":1,"down_votes":0,"body":"Seit 10min in der Wartschleife... langsam weicht der Song meinen Kopf auf O.O\n\nNach wunderbaren 16 min Wartezeit, konnte man meinen Anruf entgegen nehmen. Ein Auftrag wurde geschrieben und an die Technikabteilung weiter geleitet. IP wird im Laufe des Tages erneuert und angeblich der Fehler behoben. Es wurde mehrmals darauf hingewiesen, dass diese Störmeldung mehrmals am Tag einging. \nNunja, ich bin gespannt ab wann es wieder läuft.","replies":[{"poster":"Matzurai","date":"2015-02-16T20:40:49.845+0000","up_votes":1,"down_votes":0,"body":"sag dazu nur das hier: =D\nhttps://www.youtube.com/watch?v=0aV_vHcunSQ","replies":[]},{"poster":"DemonicDreamEye","date":"2015-02-16T13:24:44.783+0000","up_votes":1,"down_votes":0,"body":"sei froh das es nur der Song ist und nicht was anderes ;) frech lach xD","replies":[]}]}]},{"poster":"n3rds","date":"2015-02-16T20:40:20.216+0000","up_votes":1,"down_votes":0,"body":"einzige hilfe so wie ich es rausgefunden hab.... über einen VPN LoL  client starten (nicht einloggen oder starten klicken). dann wieder über normale verbindung verbinden und starten klicken und einloggen.... so hats bei mir nach ganzen tag fehlersuche funktioniert","replies":[]},{"poster":"AI SpiritRush","date":"2015-02-16T19:16:31.926+0000","up_votes":1,"down_votes":0,"body":"Brandenburg ist genauso gef*ckt. Das witzige ist, ich habe 3 Stunden damit verbracht Lösungen zufinden. Habe das Spiel deinstalliert um mir dann sagen zulassen das die website nicht verfügbar ist :) *HASS*","replies":[]},{"poster":"Orrpheus","date":"2015-02-16T17:58:48.947+0000","up_votes":1,"down_votes":0,"body":"Habe das selbe Problem. Bin bei Primacom und aus Magdeburg (Sachsen-Anhalt). Neben LoL funktionieren auch nicht die genannten Seiten wie Ebay,Amazon,Chip.de u.s.w.\n\nHatte in den letzten Tagen schon immer Verbindungsschwierigkeiten aber das ist ja mal wohl mal das letzte.\n\nGibt es mittlerweile schon einen Lösungsansatz oder hat wer mit dem Service Glück gehabt?\n\n\nMfg Orrpheus","replies":[{"poster":"MrSnowy","date":"2015-02-16T18:32:54.501+0000","up_votes":1,"down_votes":0,"body":"Also bin auch etwa 30min von Magdeburg :D\n\nAber ja ich hab immer noch das selbe problem und habe keine möglichkeit nur ansatzweise auf irgendwelche wichtigen seiten zu kommen...Mehr als warten das die evtl die Ip neu verteilen oder uns eine zuweisen können wir glaub ich nicht..","replies":[{"poster":"Kuu","date":"2015-02-16T19:11:09.158+0000","up_votes":1,"down_votes":0,"body":"Meine IP hat sich heute geändert. Das Problem besteht jedoch immer noch...\nAnscheinend herrscht in dem Betrieb grad wieder das totale Chaos. Das LoL nicht läuft stört mich ja nicht mal. Aber aktuell läuft kein Online-Dienst bei mir zuverlässig und viele Alltags-Webseiten (für Mail und Co.) sind ebenfalls nur eingeschränkt oder auch gar nicht erreichbar. Ich finde es schon komisch, dass einige Seiten ohne Probleme aufrufbar sind und andere widerum nicht...","replies":[]}]}]},{"poster":"WallRider2302","date":"2015-02-16T17:37:44.377+0000","up_votes":1,"down_votes":0,"body":"Ich komm auch nicht weiter als RADS fehler hab schon alles mögliche probiert. z.B.: neu installieren, beide exe datein öffnen, übers handy also mein handy als router, die kombilität geänert von Windows 95-8, proxy einstellungen geändert usw.... ich brauch hilfe da mir der IRC auch nicht mehr weiter helfen kann {{item:3070}}","replies":[]},{"poster":"Vergyl","date":"2015-02-16T16:46:01.865+0000","up_votes":1,"down_votes":0,"body":"Hat schon jemand Erfolg gehabt?","replies":[]},{"poster":"n3rds","date":"2015-02-16T13:44:20.978+0000","up_votes":1,"down_votes":0,"body":"So nach nem Gespräch mit nem nutzlosen Primacom mitarbeiter. sagte er wir geben den auftrag  an die Technikabteilung weiter ;D\nsuper. \ndenen ist das problem von einigen schon bekannt das sie auch mehrere internetseiten nicht aufrufen können. zb chip.de oder ebay","replies":[]}]}