{"poster":"Wekra","date":"2015-09-28T16:42:14.289+0000","title":"Climb in der nächsten Season, welche Champs lohnen sich?","subforum":"Champions & Gameplay","up_votes":2,"down_votes":1,"body":"Hallihallo,\r\n\r\nwollte in der n&auml;chsten Saison von aktuell Platin Diamond in Angriff nehmen, aktuell habe ich f&uuml;r Top {{champion:31}}, Mid {{champion:99}}, Jungle {{champion:32}} , Bot {{champion:89}} {{champion:21}} \r\n\r\nDas sind pro Rolle ein Champ den ich relativ gut beherrsche. Ich w&uuml;rde mich gern auf 2-3 Champs ausweiten, damit ich f&uuml;r bessere Matchups gewappnet sein kann. Dachte an {{champion:92}} Top, {{champion:131}} Jungle. An wen denkt ihr wenn es darum geht im Team orientiert Games zu gewinnen und auf lange Sicht aufzusteigen?\r\n\r\n\r\nWerde die Preseason als Training mitnehmen","replies":[{"poster":"Bemte","date":"2015-09-28T20:30:23.584+0000","up_votes":2,"down_votes":0,"body":"Du könntest versuchen die noch fehlenden Rollen abzudecken.\nAls Beispiel hast du einen Caster mit großer Range in der Mitte (Lux). Die Alternative in der Mitte wäre ein Assassin (Diana, LeeBlanc,Zed,...). Im Jungle passt das ganz gut: Ammumu tanky, Diana eher ganklastig.\nSupport Leona ist halbwegs tanky und Nahkämpfer. Alternative hier wäre ein Support mit mehr Reichweite, der eher auf Utility geht (Janna, Sona, Soraka, Lulu,...), wenn dein Team schon genug Tanks hat und dein Team zB einen Yasuo hat (der freut sich immer über einen Support mit KnockUp wie Janna^^).\nAlso: überlege dir, welche Rollen es auf der Lane gibt (aggressiv, deffensiv, farmorientiert, killorientiert, etc.), welche es im Teamfight alles gibt und welche dieser Rollen bei deinem aktuellen Champpool noch nicht ausreichend abgedeckt sind.\nVor allem als Support ist hier schon im Champselect eine gewisse Kommunikation mit deinem ADC wichtig: will er lieber früh Kills machen? Will er bis Lv6 erstmal in aller Ruhe farmen und beschützt/geheilt werden?\nAndere Sachen, auf die du achten kannst, sind beispielsweise der Jungler: ein Warwick (Extrembeispiel^^) zB kann vor Lv6 nicht ganz so gut ganken. Daher sollte man, wenn der gepickt oder angesagt ist, besser keinen Laner nehmen, der gerne sehr früh Ganks haben möchte, um snowballen zu können.\nEbenso wenn du Jungler spielst: frag dein Team, ob sie early Ganks brauchen (oder guck auf die Matchups und schätze es selbst ein) oder ob ein extrem gefarmter Lategamejungler und early Drakes sinnvoller sind.\n\nDas ganze Gelaber nur, um nochmal zu verdeutlichen: es gibt unglaublich viele Rollen, die man einnehmen kann. Ich würde dir empfehlen deine Champs so zu wählen, dass du möglichst viele davon abdeckst.","replies":[{"poster":"LokiOdinson","date":"2015-09-29T08:31:20.398+0000","up_votes":1,"down_votes":0,"body":"Du vergisst noch die Champions die Riot überbufft hat, wie Darius, Garen, Mordekaiser, Fiora, Skarner - niemals vergessen das es Champs gibt die mehr Vorteile bekommen als andere.","replies":[{"poster":"Sophie973","date":"2015-09-29T10:08:04.635+0000","up_votes":1,"down_votes":0,"body":"Die werden aber am meisten Gebannt, also lohnt es sich nicht Garen und Darius oder Darius und Fiora top zu spielen. Skarner ist meiner meinung nach wieder in ordnung, es spielen nicht mehr so viele und er wurde Generft","replies":[{"poster":"LokiOdinson","date":"2015-09-29T10:24:46.620+0000","up_votes":1,"down_votes":0,"body":"Es gibt gewiss noch genug andere Champs die mehr Vorteile besitzen als andere. Riven, zum Beispiel: Shield, Stun, Stun, Dash, nicht-so-squischy... Nicht zu vergessen die Champions die Aufgrund ihrer Abilitys einen schönen Escape haben, wie Zed, und dazu noch schaden machen, wie Zed, und dann noch keine Kosten besitzen, wie Zed. LeBlanc zählt da auch noch rein, und Yasuo ebenfalls. Eine Anivia hat nichts zum Escape als eine Mauer - und ratet mal wer da einfach drüberzappt? Richtig: Zed.","replies":[{"poster":" xX Jinzo Xx","date":"2015-09-29T16:23:44.764+0000","up_votes":1,"down_votes":0,"body":"Kann es sein, dass du Zed ziemlich hasst? :D","replies":[{"poster":"LokiOdinson","date":"2015-09-29T18:25:25.870+0000","up_votes":1,"down_votes":0,"body":"Ich hasse Zed nicht, aber ich kann es nicht leiden wenn der eine Champion deutliche Vorteile gegenüber seinen Mitbewerbern hat, Riot nichts dagegen macht und die Zed-Spieler mich belügen indem sie behaupten würden das seine deutlichen Vorteile gegenüber seinen Mitbewerbern balanced wären.\n\nHassen tu ich eher Yi oder OP-Darius, aber da ist es irgendwie das Gleiche.","replies":[]}]}]}]}]}]},{"poster":"Eibert Rümmel","date":"2015-09-28T20:32:31.769+0000","up_votes":1,"down_votes":0,"body":"Top Mid adc und Sup: {{champion:17}} \nIm chat no jgl schreiben :P","replies":[]},{"poster":"Allmaron","date":"2015-09-28T17:02:02.522+0000","up_votes":1,"down_votes":0,"body":"Das kann man noch noch so genau sagen da der Season 6 Patch die ganze Meta umkrempeln kann.\nversuch dich jedoch auch auf eine Lane zu konzentrieren.","replies":[]}]}