{"poster":"Wekra","date":"2015-11-16T22:10:28.767+0000","title":"Rolle ausfüllen, flexibler sein","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Guten Abend liebe Com.,\r\n\r\nf&uuml;r die neue Saison w&uuml;rde ich meinen Championpool gerne aufgrund von Rollen ausf&uuml;llen...zur zeit sehen meine &quot;Main&quot; Champs auf den Lanes so aus, in Klammern dahinter, welche ich trainieren will, um eben flexibler zu sein und andere, ben&ouml;tigte Rollen auszuf&uuml;llen.\r\n\r\nTop: Cho (Appofftank), Shen(Tank), dann denke ich an ( Riven, Jax, Irelia f&uuml;r AD ode was Bruiserm&auml;&szlig;iges)\r\n\r\nMid: Lux, (Ori, f&uuml;r Combos) und dann fehlt mir evtl noch ein ADler? Oder was fehlt hier?\r\n\r\nADC: Miss Fortune (F&uuml;rCombo, z.b. mit Ori, Malphite etc), dann dachte ich an (Cait oder Jinx als Safelaner, wenn eben keine Combo m&ouml;glich ist?)\r\n\r\nSupport: Leona, Sona (vllt noch Thresh? Um Offensive und Defensive viable zu sein?)\r\n\r\nJungle: Amumu...da dachte ich noch an was DMG m&auml;&szlig;iges, w&uuml;rde gerne (Diana) k&ouml;nnen oder etwas wie (Yi)\r\n\r\n\r\n\r\nWas meint ihr welche Rollen, Champs fehlen, um fast immer gut ger&uuml;stet und ins Team passend zu sein?\r\n\r\nBewege mich auf Gold, war lange Plat...will evtl Richtung High Plat kommen\r\n\r\n\r\nVielen Dank euch :)","replies":[{"poster":"I am Zynex","date":"2015-11-17T14:15:30.041+0000","up_votes":1,"down_votes":0,"body":"Die Frage ist, ob es so viel Sinn macht jetzt noch für alle Positionen Champions zu lernen bzw. den Pool für alle Positionen aus zu bauen. Bald kommt die flexible Q mit der man sich ja für 2 Positionen anmelden kann und wenn man nicht grade \"Fill\" einträgt, kann man sich mit dem Championpool auf seine beiden Main-Rollen konzentrieren.\n\nDas werde zumindest ich in der Off-Season tun, dass ich mich nur noch auf meine geplanten Main-Rollen konzentrieren werde und für diese meinen Pool erweitere.","replies":[]},{"poster":"The mute Swan","date":"2015-11-17T12:46:39.999+0000","up_votes":1,"down_votes":0,"body":"Bei den supports würde ich dir empfehlen: Thresh auf jeden fall, alistar ist für kombos ganz gut (mit kallista oder sivir/ yasuo) und ist (war?) auch im jungle möglich, janna kann man auch noch reinnehmen, ist aber relativ situationsabhängig.\nSollte das mit der meta wirklich so weitergehen (überall adcs, bäh...) würde ich mir überlegen auch noch rammus jungle öfter zu picken\nauf der toplane würde ich jax definitiv empfehlen, mit dem neuen rageblade geht der ab wie schmitz katze :P\nIn der mitte schätze ich, könnte dir vllt TF gefallen wenn du shen magst, wegen global pressure und so.\nansonsten halt vielleicht assasins wie diana/zed/akali. sona mid ist auch immer wieder lustig :3\nschau einfach mal rum. hoffe ich konnte helfen oder so...\n\nMfG,\nStein","replies":[]},{"poster":"Alustus","date":"2015-11-16T23:13:33.432+0000","up_votes":1,"down_votes":0,"body":"Ich würde dir empfehlen champs zu lernen die man auf mehreren Rollen/Positionen spielen kann.\n\nSomit musst du nicht ganz soviel lernen.\nIst aber nur ein Tipp wenn du nict soviel zeit hast um mehrere Champs wirklich auf einem guten niveau zu Spielen.\n\nDiana könntest du zum beispiel mid und jungle spielen.\nAnnie Bot und Mid\nusw.\n\nsomit müsstest du nicht soviele verschiedene mechaniken lernen.","replies":[]}]}