{"poster":"Wekra","date":"2016-05-30T09:33:16.523+0000","title":"Tank Runen Toplane/Nasus","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Hall&ouml;chen,\r\n \r\nich hab das Gef&uuml;hl meine Tankrunen sind sehr veraltet und insgesamt relativ uneffektiv.\r\n\r\nHabe schlicht 26 Armor und 16 MR.\r\n\r\nScaling Runen sind in vielen Bereichen ja besser. Was empfehlt ihr mir f&uuml;r Nasus Toplane?\r\n\r\nBitte nicht nur Gudies posten, sondern m&ouml;glich nach eigener Erfahrung :)","replies":[{"poster":"HoloHoroHolo","date":"2016-05-30T10:35:01.260+0000","up_votes":2,"down_votes":1,"body":"Ich denke \"schnell\" und \"einfach\" lässt sich das nicht beantworten, denn es kommt leider auf das Matchup häufig an.\n\nOft wird flat-Armor und scaling-MR genommen. Der Grund dahinter ist, dass die meisten AP-Champions zumindestens etwas AP benötigen, bis sie \"anständig\" Schaden machen. Bis dahin greifen dann aber meist die scaling-MR Runen. \nFlat-Armor wird mitgenommen, da es einmal gegen AP-Champions ihre AutoAttacken hilft und gegen AD-Champions die bereits mit ihrer Grund AD häufig mehr Schaden in den ersten Leveln machen können.\n\nIm Idealfall hast du (wenn du z.B. Tank-Top main hast) mehrere Rundenseiten. Einige Ideen welche hierbei beachtet werden müssten sind:\nGegner Early Stark/schwach\nGegner Viel Poke, All in oder auch eher AFK-Farmer. Und logischerweise AD oder AP.\nAbhängig von der Betrachtung müsste \"optimalerweise\" die Runenseiten angepasst werden.\n\nBeispiel: Spielst du gegen AD-Top würde ich immer Scaling-MR nehmen (vorausgesetzt gegner hat überhaupt AP-Dmg im Team). \nSpielt der Gegner AP-Top liegt es an der \"Art\" des Champions. Kann er bereits extrem viel Poken in den ersten Leveln (was häufig Toplane-AP-Champs ist) dann eher flat-MR. Sollte er eher weniger POken (oder du der Meinung sein keine Probleme mit ihm zu haben in den ersten Leveln), dann geh scaling-MR.\n\nAllgemein ist Nasus sehr auf seine Last-Hits mit Q bedacht. Ich habe mir keinen Guid angeschaut aber ich habe immer Flat-CDR mitgenommen um bereits früh das Q häufiger nutzen zu können (kenne mich da aber nicht 100% aus wie \"sinnvoll\" das ist.\nGenauso ist zu überlegen, ob man in den Gelben Runen flat-hp oder eher bevorzugt scaling-hp mitnimmt (gerade gegen AP-Champs hilfreich).\nDie CDR sind auch gerade dann Interessant, wenn du gegen AP spielst. Denn ein AP-Champ \"zwingt\" dies zuerst entweder auf Leben bzw. MR zu gehen (häufig die Geisterkutte heißt es glaub). Somit kann man zu Beginn \"weniger\" CDR kaufen, was ein Nasus häufig will (um permanent mit Q lasthitten zu können).\n\nWenn du natürlich nur 1 Runenseite nutzen wilst, gibt es verschiedene Varianten. Klassisch wie du. Oder klassisch in Gelb Leben(oder Scaling Leben). Sonst MR/Armor.\n\n\nMeine Gedanken erstmal dazu\nHoffe kann weiterhelfen.\nBei weiteren Fragen musst du schauen, dass du sie etwas \"konkreter\" stellst oder betrachtest.\n\nLG Spicy","replies":[]},{"poster":"Bodycounter","date":"2016-05-30T11:56:56.170+0000","up_votes":1,"down_votes":0,"body":"Runenseite Tank 1: Quint: Armor; Red: AD; Yellow: Health/lvl; Blue: MR/lvl\n\nRunenseite Tank 2: Quint: Health/reg; Red: Armor; Yellow: Health/lvl; Blue: MR/lvl\n\nAllerdings kann man bei Nasus viele Vorlieben haben. Beispielsweise mögen es einige schon früh Abklingzeitverringerung (10%) in die Runen zu nehmen. Dadurch kann man sein Q effektiver stacken, man büßt aber defensive Werte ein und das Manamanagement ist dann schwerer. Andere nehmen gerne eine normale AD-Seite mit (Quint und Red AD; Yellow Armor; Blue MR/lvl), dadurch ist das Lasthitting einfacher und man kann besser traden. Momentan gibt es eigentlich keine AP-Toplaner, die schon vor Level 6 sehr stark sind, daher tut es MR/lvl eigentlich immer. Ausnahme wäre sowas wie Teemo.","replies":[]},{"poster":"Zynic LFT","date":"2016-05-30T11:51:26.863+0000","up_votes":1,"down_votes":0,"body":"In der Regel versucht man Resistenzen und HP zu bekommen, weil eins alleine sehr viel ineffektiver ist. \n\nBeispiel: Auf Champs wie Renekton und Nasus sind Resistenzen sehr stark, weil diese Champs auf einen sehr hohen HP Wert kommen wenn ihre Ulti aktiv ist.\n\nNasus ist sehr Cooldown abhängig deshalb solltest du bis zu +10% auf lvl 18 spielen sofern du nicht mit deinem Itembuild auf 40 % kommst.\n\nWenn du Ranked spielst hier ein weiterer Tipp: Mach dir 2 Runenseite, die eine sollte viel Armor und die andere viel MR aufweisen. Bevor das Game startet schaust du dir deinen enemy Toplaner und den enemy Jungler an. \n1) Enemy Jungle ad und enemy Top ad => Deine Runen sollte fast nur Armor und wenn überhaupt MR nur skaling Runen beinhalten.\n2) Enemy Jungle ad und enemy Top ap (oder andersrum) => Du kannst hier sehr gut eine gemischte Runenseite benutzen.\n3) Enemy Jungle ap und enemy Top ap => Du solltest überwiegend MR und HP in deine Runen packen.","replies":[]}]}