{"poster":"IOD Kaifa","date":"2017-04-29T23:04:58.547+0000","title":"Warum manche denken, dass Darius OP ist.","subforum":"Champions & Gameplay","up_votes":3,"down_votes":3,"body":"Hey,\nviele (vorallem in Low-Elo) stehen hinter der Aussage, dass Darius {{champion:122}} OP ist. Generell liegt dies nur an nicht ausreichender Knowledge &uuml;ber den Champion. Ich selber finde Darius schon disgusting. Ich habe mal sein Kit analysiert und bin auf folgendes gesto&szlig;en.\n\n\nLane-Phase:\nDarius ist eine sehr starker Lane-Bully der fehler seiner Opponents sehr gut bestrafen kann, weshalb er gegen unerfahrene Spieler sehr effektiv ist. Nicht selten geht ein Gank auch in einem Double-Kill f&uuml;r Darius aus.\n\nTeamfight-Phase(oder wie man sie nennen will):\nDarius geht meist einen Tank lastigen build der ihn zu einem Front-Liner macht. Allerdings besitzt er keine guten Gap-Closer, wodurch er auch nicht unbedingt bedrohlich ist. Seine Passive und Ult machen ihn allerdings, wenn er an seine Gegner kommt, zu einem Snowball-Teamfight Monster. Er kann ganz leicht mit den 5 Stacks und der True-Damage ult aufr&auml;umen.\n\n\nKit:\nPassive: Hemorrhage\nDarius verteilt mit seinen Autoattacks und seinen &quot;schaden machenden&quot; F&auml;higkeiten bis zu 5 Hemorrhage Stacks. Jeder Stack macht 10-27 (abh&auml;ngig vom Level)+(30% bonus AD) Normalen Schaden &uuml;ber 5 Sekunden. Bei 5 Stacks wird Noxian-Might ausgel&ouml;st.\n\nNoxian-Might: Darius erh&auml;lt 30-200 (abh&auml;ngig vom Level) bonus AD und er kann sofort mir einem Autoattack oder einer &quot;schaden machenden&quot; F&auml;higkeit 5 Stacks auf einen Gegner verteilen.\n\nDiese Passive hat eine enorme Gold-Value f&uuml;r Darius. Die bonus AD gehen von 1050 Gold (auf Level 1) bis zu 7000 Gold (auf Level 18)(basierend auf einem long-Sword {{item:1036}} nicht auf dem b.f.-Sword {{item:1038}} ). Er bekommt zu seinem vollem Item-build noch 7000 Gold oben drauf, wenn er Level 18 ist. Und er kann sofort 5 Stacks Hemorrhage auf Gegner verteilen wenn einmal 5 erhalten hat. Hemorrhage synergiert stark mit dem Black-Cleaver {{item:3071}} , da man nur einen Stack braucht um alle Black-Cleaver Stacks auszul&ouml;sen. Diese Passive ist eine der, wenn nicht die, st&auml;rksten und Gold-effizientesten Passives im Spiel. Meiner Meinung nach ist diese Passive viel zu stark. Sie bietet einfach diese hohe Gold-Value die es &auml;tzend macht gegen Darius zu spielen.\n\n\nQ: Decimate\nDarius schwingt seine Axt um sich und macht 40-160 (abh&auml;ngig vom Level)+(100%-140% AD), am Griff macht er 65% weniger Schaden. F&uuml;r jeden getroffenen Champion heilt her sich um 12% seiner fehlenden Leben (bis zu 36%). Mit der Klinge verteilt her Hemorrhage Stacks, jedoch nicht mit dem Griff.\n\nDiese F&auml;higkeit verleit Darius Sustain auf der Lane und kann ein gro&szlig;er Heal in einem Teamfight sein, au&szlig;erdem synergiert sie enorm gut mit Spirit Visage {{item:3065}} . Sie wird meistens als erstes maximiert.\n\n\nW: Crippling Strike\nDarius n&auml;chster Autoattack in 4 Sekunden macht bonus Damage (40% AD) und verlangsamt das ziel um 90% f&uuml;r eine Sekunde. Wenn Darius hiermit ein Ziel t&ouml;tet bekommt er die Mana-Kosten zur&uuml;ckerstattet und der Cooldown wird halbiert. Crippling Strike ist ein Autoattack-reset.\n\nMit Crippling Strike hat Darius eine standart Farm/Trade F&auml;higkeit. Sie verleit einen starken Slow und ist ein solider &quot;Minion-Farmer&quot;. Crippling Strike wird h&auml;ufig auf Level 1 genommen, allerdings danach ignoriert.\n\n\nE: Apprehend\nDarius bekommt Passiv prozentuale Armor-Penetration (5%-25%).\nDarius schwingt nach einer kurzen Verz&ouml;gerung seine Axt nach vorne und zieht alle Gegner zu sich und slowed sie um 40% f&uuml;r eine Sekunde. Nebenbei verbreitet der &quot;geangelte&quot; Bereich Vision.\n\nDurch Apprehend hat Darius einen Gap-Closer und Hard-CC. Zu beginn von Collossus war diese F&auml;higkeit sehr wichtig. Die F&auml;higkeit und seine Passive machen erleichtern ihn Tank-Matchups um einiges. Meiner Meinung nach ist die Armor-Penetration zu viel des Guten, da sie nicht einmal auf bonus-Armor wie der Last-Whisper {{item:3035}} basiert.\n\n\nR: Noxian Guillotine/DUNK ;&#039;D\nDarius springt zu seinem Gegner und gibt ihn einen m&auml;chtigen Schlag mit seiner Axt mit und macht 100-300 (abh&auml;ngig vom Level)+(75% bonus-AD) True-Damage. Mit jedem Hemorrhage Stack wird der Schaden von 20%-100% erh&ouml;ht und jeder Stack macht zus&auml;tzlichen 20-60 (abh&auml;ngig vom Level)+(15% bonus-AD) Schaden. Wenn Noxian Guillotine sein Zeil t&ouml;ten fliehen nahe Einheiten f&uuml;r 3 Sekunden &quot;vom Ort des Geschehens&quot; und der Cooldown setzt f&uuml;r 20 Sekunden nicht ein, wobei auch die Kosten wegfallen. Auf Stufe 3 wird der Cooldown komplett aufgehoben.\n\nBei 5 Hemorrhage Stacks kommen hier Schadens-Werte von bis zu 1000 True-Damage zustande was mich als ADC schon mehrmals ins strugglen gebracht hat. Der True-Damage gibt ihn wieder ein gutes Matchup gegen Tanks und ist meiner Meinung nach wie die Armor-Penetration zu viel des Guten. Dadurch, dass er, wenn er einmal 5 Hemorrhage Stacks erreicht hat, mit einem Autoattack 5 Stackt verteilen kann, kann er direkt das volle Potetial seiner Ult benutzten. Diese F&auml;higkeit macht Darius zu einem &quot;Aufr&auml;umer&quot; Champion der lange in Combat bleiben m&ouml;chte und Teamfights sehr mag.\n\n\nItem-build:\nGenerell wird Black-Cleaver {{item:3071}} als erstes auf Darius gebaut und danach auf Tankyness umgestiegen. Ein Spirit Visage {{item:3065}}  wird in jedem fall Gerne gebaut. Gestartet wird meist mit Dorans-Blade oder Dorans-Shield.\n\n\nMeiner Meinung nach ist Darius ein sehr starker Lane-Bully der an einigen Stellen (Noxian-Might Passive, Armor-Penetration E, True-Damage Ult) &uuml;berdacht werden kann. Ich denke das gegen einen erfahrenen Darius nur Ranged-Champions eine Chance auf der Top-Lane haben, sowas wie onhit Kennen.\n\n\nIch bin gespannt auf andere Meinungen\n\n&quot;Knowledge is a real weapon.&quot;\n\nMfG SK Elephant\n\n\nP.S. Grammar-Nazis k&ouml;nnen sich aus meinem Artikel gerne raushalten, es seindenn ich hab wirklich einen fatalen Fehler gemacht :D.","replies":[{"poster":"Oriius","date":"2017-04-29T23:26:06.645+0000","up_votes":1,"down_votes":0,"body":"Joa darius ist schon n monster aber gegen champs wie jax zb oder teemo  oder nasus ist er recht aufgeschmissen. n nasus haut nen darius mit 2-3 q´s im late kaputt .  vorallem champs die eher rein aufs tanken ausgelegt sind haben eher schlechtere karten. Darius ist jedoch sehr CC-anfällig. Wenn er gestunnt wird hat er meist probleme sowie wenn er geslowt wird. Slow bedeutet meist den Tod von jedem Darius. Zudem ist es effektiver Darius alleine als im Team zu besiegen damit er sich weniger healt. Später hat er noch recht viele Probleme mit seinem manapool und kann der gegner zu seinem vorteil nutzen.\n\n\nFazit: Darius kann op sein wenn man nicht weiß was und wie man gegen ihn spielt. Gegen adc´s kann er meist nicht mithalten (wenn er sein hook nich trifft) und gegen nen gut gespielten Juggernaut ist er den meisten weit unterlegen bsp Poppy. Teamfight sollte man möglichst vermeiden mit nem Darius.","replies":[{"poster":"IOD Kaifa","date":"2017-04-30T09:51:24.105+0000","up_votes":1,"down_votes":0,"body":"Das ist sein \"CC-Problem\", als Tank hat er zu wenig CC um gefährlich zu sein. Viele spielen ihn deshalb mit Ghost und Flash. Allerdings ist es durch seine Slows schwer ihm zu entkommen, wenn er dich einmal erreicht hat.\n\nDarius ist allgemein anfällig gegen kite, weshalb der angesprochene onhit Kennen ein gutes Matchup gegen ihn hat.\n\nIch kann verstehen, dass er kein gutes Matchup gegen Jax (durch e keine Hemorrhage Stacks) und gegen Teemo (Range/kite) hat, allerdings gegen Nasus? Er sollte einen Nasus im early hart bullien können, wodruch dieser an keine Stacks kommt und im Late weniger schaden hat.","replies":[{"poster":"Oriius","date":"2017-04-30T20:03:31.171+0000","up_votes":1,"down_votes":0,"body":"hatte bisher nie Probleme :D vllt weil ich low elo bin :/","replies":[]}]}]},{"poster":"Samus Saran","date":"2017-04-30T18:21:44.177+0000","up_votes":1,"down_votes":1,"body":"Darius ist schon ein Monster daran lässt sich nix rüteln seine Passive ist Design Technsich völliger Fehltritt den diese ist viel zu stark und kaum anfechtbar in sachen Nahkampf.\n\n\nKlar kann er gekited werden oder Outplayed, aber Darius Spieler sind ebenfalls in der Lage zu Outplayen und in dieser Regel gewinnt Darius immer.\n\nEs ist schon zu schade bzw. lächerlich das man nen unehrenhaften Pick nehmen muss gegen Ihn mit Range.","replies":[]}]}