{"poster":"Rhaego98","date":"2018-10-23T23:35:29.166+0000","title":"Mmr da league a op.gg","subforum":"Discussioni generali","up_votes":1,"down_votes":3,"body":"Ciao ragazzi, creo questa discussione solo per avere una delucidazione sul sistema mmr attualmente in uso.\r\nPremetto, ho fatto tantissime partite in solo/duo quest&#039;anno (circa 500) ad intensit&agrave; altalenante. Avendo iniziato a giocare proprio l&#039;anno scorso durante la preseason avevo deciso che quest&#039;anno avrei cercato di imparare tutto quello che c&#039;era da imparare. Prima ho ascoltato il classico consiglio di &quot;mainare&quot; un solo champ per guadagnare dimestichezza con le meccaniche del gioco, e cos&igrave; ho fatto. Grazie a questo consiglio sono riuscito ad arrivare a gold in 2-3 mesi. Poi arrivato l&igrave; ho cercato di prendere confidenza sempre con pi&ugrave; campioni, per&ograve; paradossalmente questo mi ha portato pure a riscendere a silver visto che ancora non ne avevo la padronanza. Adesso dopo circa un anno di ranked credo di aver trovato il mio equilibrio e sono riuscito ad arrivare di nuovo gold cercando sempre di counter-pickare ad ogni occasione possibile con i champ che sapevo giocare. In questo periodo ho fatto molte vittorie ma le sconfitte che ho fatto in precedenza gravano ancora sul mio mmr. Infatti prendo tutt&#039;ora 16 punti a vittoria e ne perdo 22 a sconfitta, ma se vado su op.gg il sito mi dice che il mio mmr si accosta intorno al gold 3. Invece durante quasi ogni ranked mi fillano con silver. Non so pi&ugrave; chi ha ragione XD per vedere se ero io di elo pi&ugrave; basso rispetto alla mia lega ho provato a smurfare con un altri 2 account ma dopo le 10 posizionamento mi davano sempre la lega gold. Di quanto differisce esattamente l&#039;mmr di League con quello di op.gg?","replies":[{"poster":"l EternaL SouL l","date":"2018-10-24T07:59:30.743+0000","up_votes":1,"down_votes":0,"body":"Secondo me il vero mmr lo stabilisci tu facendo la media degli mmr con cui ti matcha il gioco.\nL’mmr di opgg si sballa dopo una serie di molte vittorie o molte sconfitte.\n\nAvevo fatto una serie di vittorie (17win e 3 lose) ed ero plat 4 0 lp, vedevo che mi matchava con tutti p2 anche se opgg diceva che ero p4 come mmr, ma era sbagliato, infatti ho perso 2 partite a p4 0lp e non sono droppato a p5 (cosa mai successa, di solito si droppa subito, ed ovviamente intendo a “protezione” del drop terminata, cioè dopo aver fatto più di 3 partite in quella lega), prendevo pure +25 -16.\n\nAl contrario dopo una serie di sconfitte, mi diceva che l’mmr era normale per la lega, ma mi matchava con gente inferiore e prendevo +18  -22.\nQuindi secondo me il vero mmr te lo costruisci tu facendo una media delle persone che ti ritrovi.\nPoi l’mmr di opgg è palesemente errato, a volte capita che faccio una vittoria, e l’mmr di opgg si abbassi, ed impossibile che non si era aggiornato perchè mi capita con 6-7 partite vinte di fila in giorni diversi. \n\nTutte queste anomalie capitano appunto come ti dicevo prima, serie di vittorie o serie di sconfitte.\n\nPer il resto secondo me è abbastanza affidabile, nel 90% dei casi l’mmr che da il sito coincide con la media degli mmr che ti ritrovi in game, e con l'mmr reale del gioco.\n\nQuesta è la mia esperienza usando quel sito, ma non ne sono certo, nessuno a parte gli sviluppatori puó dirlo con certezza come funzioni e quanto sia simile all'mmr reale del gioco, è tutto segreto.","replies":[]},{"poster":"Orniflex","date":"2018-10-24T06:57:25.754+0000","up_votes":1,"down_votes":0,"body":"MMr di op.gg viene calcolato in base al livello della partita precedenetemente disputata. Mi spiego meglio  se fai una classificata vedi nella schermata su OP.gg che assegna un livello al team rosso e un livello al team blue. Questo sommatoriamente è una media di riferimento con il quale si accosta al livello della gente con cui vieni matchata. \nFaccio un esempio: Sei silver 3, ma giochi con i gold 4, quindi op.gg ti dice che il tuo mmr e più alto rispetto alla divisione in cui ti trovi e viceversa.\n\nPer quanto riguarda il guadagno irrisorio di lp dopo tanti game, c'è poco da fare il gioco è infame.","replies":[]}]}