{"poster":"FermiParadoxx","date":"2017-11-04T01:37:13.877+0000","title":"Necesito ayuda, cambien de pc y mis fps son muy bajos","subforum":"Problemas Técnicos","up_votes":1,"down_votes":0,"body":"Hola, quer&iacute;a pedir ayuda de ustedes, cambie de pc por motivos que muri&oacute; la placa madre el mi notebook anterior :c y ahora tengo un notebook samsung con procesador de 1,8ghz CORE i5 y cpn 8gb de ram y targeta grafica Intel HD 4000, me corre varios juegos a fps decentes, tales como Metal gear phantom pain, mortal Kombat X, Dark Souls 2, etc, el asunto es que no reinstale el lol, lo copie de mi disco de respaldo, y en partidas tengo 15fps, aveces llega a los 120 en la base, pero en tf baja a 01fps, lo cual me parece sumamente extra&ntilde;o por que mi primo tiene un pc inferior, un Hp con procesador Dual-Core de 1,7ghz 6gb de ram y targeta grafica intel Hd 3000, y el usa la misma copia de lol que el mio pero sus fps son estables a graficos medios (entre 60- y 100 fps) y los mios son inestables con graficos bajos (entre 90 y 7 fps), se lo agradeceria con una cajita misteriosa al que me pueda ayudar XD gracias. {{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Modarchive","date":"2017-11-05T19:57:58.302+0000","up_votes":1,"down_votes":0,"body":"Revisa si tienes puesto en modo economizador el pc.","replies":[]},{"poster":"gianluca14","date":"2017-11-04T02:36:42.779+0000","up_votes":1,"down_votes":0,"body":"Desctivale el antisoplamiento :p","replies":[]},{"poster":"0XmiloX0","date":"2017-11-04T01:59:43.452+0000","up_votes":1,"down_votes":0,"body":"actualiza los drivers de la tarjeta grafica (intel). luego configura los graficos de intel.\nconfigura el lol y listo \npd: si","replies":[{"poster":"0XmiloX0","date":"2017-11-04T02:02:36.069+0000","up_votes":1,"down_votes":0,"body":"tambien mira la bateria (por defecto el pc en HP te viene configurado para que tenga la mejor calidad posible, tanto que es innecesaria, en lo que ami respecta claro xd). bajale la calidad a que windows decida o mayor rendimiento \npd: lo de la bateria es por si esta (por defecto) en mayor duracion (eso te consume mucho rendimiento)","replies":[]}]},{"poster":"Ánzu","date":"2017-11-04T01:45:10.904+0000","up_votes":1,"down_votes":0,"body":"configuraste los gráficos?,se que es un pregunta algo tonta pero no esta demás, recuerda que los efectos y sombras es lo que mas consume tarjeta grafica\nsuerte con tu problema bro\n{{sticker:slayer-pantheon-thumbs}}","replies":[]}]}