{"poster":"Nick Dre","date":"2016-06-10T15:44:47.575+0000","title":"Uhrzeitabhängige Verbindungsprobleme","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hallo zusammen,\r\nich habe ein ziemlich seltsames Problem:\r\nWenn ich tags&uuml;ber LoL spiele kommt es &auml;u&szlig;erst h&auml;ufig dazu, dass ich zwischenzeitig einen ziemlich hohen Ping habe und sogar verbindungsabbr&uuml;che.\r\nZuerst dachte ich es liegt nur an der St&auml;rke meiner Wlan Verbindung, da ich n&auml;her am Router keines dieser Probleme erfahren habe. ABER: Wenn ich bei der selben Verbindungsst&auml;rke, also weiter entfernt vom Router, Abends bis Nachts spiele dann treten oben genannte Probleme auch nicht auf. Ich bin mir bewusst dass die einfachste L&ouml;sung des Problems darin liegt einfach n&auml;her am Router oder &uuml;ber Lan zu spielen, allerdings ist dies nicht immer m&ouml;glich, da ich dazu in eines der Zimmer meiner Mitbewohner gehen m&uuml;sste, was ihnen verst&auml;ndlicherweise nicht gef&auml;llt. Daher meine Frage: Wieso passieren diese Verbindungsprobleme Abends nicht und wie bekomme ich es hin dass sie auch tags&uuml;ber nicht auftreten?","replies":[{"poster":"The Stοrms Fury","date":"2016-06-10T16:49:21.258+0000","up_votes":2,"down_votes":0,"body":"Heyho,\nversuch mal deinen Router zu updaten, oder ruf bei deinem Anbieter an.\nAnsonsten habe ich auch keine Ahnung, tut mir leid :(","replies":[]},{"poster":"Aenrikr","date":"2016-06-10T17:34:54.949+0000","up_votes":1,"down_votes":0,"body":"Wenn die Vorschläge von QWER usw nicht helfen, hätt ich auch noch mal n paar Ratschläge:\n\nSteht der Router zufällig an einem sonnigen Plätzchen oder einem zu warmen Zimmer?\nWenn ja, dann könntest du deinen Mitbewohner einmal bitten ihm ein kühleren Standort zu verschaffen.\nÜberhitzung kann einer deiner Gründe sein.\n\nAnsonsten:\n\nWie viele Leute benutzen noch diesen Router?\nScheint sich ja um eine Art WG bei dir zu handeln.\nWenn da zuviele mit ihren PC`s, Laptops, Handys. Tabletts und was weiß ich dran hängen, kann es schon mal zu Latenzen kommen ^^\nBesonders wenn da gedownloaded wird wie verrückt.\n\nIn dem Fall solltest du dir selbst nochmal seperates Internet zulegen.","replies":[]},{"poster":"Nick Dre","date":"2016-06-10T17:24:42.682+0000","up_votes":1,"down_votes":0,"body":"Ok danke erstmal für die schnelle Antwort\nIch werds versuchen.","replies":[]}]}