{"poster":"RollyXP","date":"2015-05-06T10:31:21.814+0000","title":"Großes Siegel der Rüstung vs Großes Siegel der wachsenden Rüstung","subforum":"Level Up: Guides & Tipps","up_votes":3,"down_votes":0,"body":"Ich frage mich schon l&auml;nger warum man 9x **Gro&szlig;es Siegel der R&uuml;stung** (+1 R&uuml;stung)\r\nund nicht 9x **Gro&szlig;es Siegel der wachsenden R&uuml;stung **(+0,16 R&uuml;stung pro Stufe (+3 auf Stufe 18)) holt.\r\n\r\nAb LVL 7 hat man mit der **Gro&szlig;es Siegel der wachsenden R&uuml;stung** (0,16*9= 1,44, 1,44*7=10,08) hat man schon mehr R&uuml;stung als mit der **Gro&szlig;es Siegel der R&uuml;stung**.\r\nMit LVL 18 hat man dann sogar 54 R&uuml;stung (statt 9) und das ist Ordentlich mehr!\r\n\r\nBei einem ADC oder AP Support kann ich es noch etwas verstehen wegen den Poke den man auf der Botlante meist ja viel hat.\r\nAber jeder Jungler, Tank-Sup, Top und Midlane kann ich das nicht ganz verstehen.\r\nLVL hat die Top und Midlane nach nicht mal 6 min erreicht, der Jungler braucht minimal l&auml;nger (ohne Gangs).\r\n\r\nAber vl &uuml;bersehe ich was entscheidendes, wie seht Ihr das?","replies":[{"poster":"Sirin","date":"2015-05-06T10:47:24.342+0000","up_votes":2,"down_votes":0,"body":"Ja, das hast du richtig erkannt - für die Botlane lohnen sich solche Runen definitiv nicht, aber für andere Lanes sind sie eine Überlegung wert.\nSoweit ich weiss, erreichen Scaling Armor-Runen auf Lvl 6 den selben Wert wie Flat Armor. Das heisst, wenn du es schaffst, bis Lvl 6 nicht zu kämpfen und nur zu farmen, hat sich die Runen-Auswahl gelohnt - denn du wirst später mehr Armor aus Runen haben als dein Lanegegner.\n\nEs kommt natürlich auch auf das Matchup an, wenn man Top gegen Riven spielt sind Scaling Armor-Runen vielleicht nicht so toll.\nAber im Prinzip sind diese Runen schon gut. Ich denke, der Grund warum sie wenige benutzen, ist, dass \"normale\" Spieler denken, die Flat Armor Runen reichen und es wäre eine Verschwendung jetzt noch andere Armor-Runen zu kaufen. In höheren Elo-Regionen sieht das vermutlich anders aus.","replies":[{"poster":"Ehren Teemo","date":"2015-05-07T05:38:13.553+0000","up_votes":1,"down_votes":0,"body":"Dem ist wohl nichts mehr hin zu zu fügen","replies":[]}]},{"poster":"Schwertkönig","date":"2015-05-14T16:25:15.932+0000","up_votes":1,"down_votes":0,"body":"Zunächst mal kommt man durch 9x Großes Siegel der wachsenden Rüstung (+0,16 Rüstung pro Stufe (+3 auf Stufe 18))  auf 27 Rüstung auf lvl 18. \n\nWie schon gesagt überholen die skalierenden Runen ab lvl 7 die Runen, die einen festen Wert auf die Rüstung geben. Auf lvl 18 bekommt man mit den skalierenden Runen ganze 18 Punkte mehr auf die Rüstung, was sich zunächst einmal nach recht viel anhört. Doch dadurch, dass man ebenfalls Rüstung pro Level (außer natürlich Thresh) bekommt, und wie sich die Schadensreduktion bei LoL berechnet, machen die 18 Punkte mehr, die man durch die skalierenden Runen auf lvl 18 hat, umso weniger aus, je mehr Rüstung man durch andere Quellen bekommt. \n\nRechnet man nur die Basisrüstung und die Runen, ist die Schadensreduktion um ca. 4-5%, abhängig von den genauen Werten, größer auf Lvl 18, wenn man die skalierenden Runen verwendet. Besitzt man jetzt aber noch Rüstung durch Gegenstände, verringert sich der Unterschied in der Schadensreduktion, wenn man skalierende Runen mit Runen mit einem festen Bonus vergleicht. Bei einem Tank mit 200 Rüstung beträgt der Unterschied hierbei knapp 2%. Je mehr Rüstung man besitzt, umso weniger Bonus bringt ein weiterer Punkt in Rüstung. \n\nAuf Level 1 ist die Schadensreduktion um ca. 4% geringer, wenn man die skalierenden Runen verwendet und nimmt mit dem Level ab, bis es sich bei lvl 6 ausgleicht. \n\nWelche Runen man schlussendlich verwendet hängt eher davon ab, ob ich mit viel normalen Schaden im Early-Game rechnen muss oder nicht. Wenn der Anteil an normalen Schaden bis lvl 6 eher gering ist, sind die skalierenden Runen eine gute Möglichkeit, etwas mehr Schutz im Lategame zu haben. Umgekehrt helfen die Runen mit dem festen Bonus das Early-Game besser zu überstehen. Gegen AD-lastige Champions ist es mit den skalierenden Runen schwieriger auf der Lane und die Wahrscheinlichkeit, dass der Trade eher für den Gegner ausgeht, ist höher. \n\nIm Jungle ist es zudem sinnvoll, die Runen mit dem festen Rüstungsbonus zu nehmen, da hier gerade auf den ersten Stufen der Jungle sehr viel normalen Schaden verursacht. Hier ist ein höherer Rüstungswert von Vorteil, da man weniger Schaden bekommt, was dazu fürht, dass man mehr Camps machen kann bevor man zurück zur Base muss und/oder dass man für Ganks mehr HP zu verfügung hat. \n\nAnsonsten ist es eine Frage der persönlichen Vorlieben, ob man die skalierenden Runen wählt oder nicht.","replies":[{"poster":"Temudschinn","date":"2015-05-14T19:13:55.826+0000","up_votes":1,"down_votes":0,"body":"> Je mehr Rüstung man besitzt, umso weniger Bonus bringt ein weiterer Punkt in Rüstung. \n\nDiese immer wieder geäusserte Behauptung ist nicht wirklich richtig. Jeder Punkt Rüstuing erhöht die effektive HP um 1% der gesamten HP (Magieschaden/truedmg lassen wir mal aussen vor). Zwar nimmt der prozentuale Gewinn an effektivem Leben ab, aber das gilt z.b. auch für AD oder HP.\n\nDer Grund für diesen Denkfehler liegt im oft übersehenen Unterschied zwischen % und Prozentpunkt. Eine Steigerung von 1% auf 2% ist NICHT eine Steigerung im 1%, sondern um einen Prozentpunkt; die prozentuale Steigerung entspricht 100%, also einer Verdoppelung. Auf das Rüstungsproblem bezogen heisst das: Eine Senkung des erlittenen Schadens von 100% auf 50% wirkt zwar nach mehr als die weitere Senkung von 50% auf 25%, aber in beiden Fällen wird der erlittene Schaden um exakt 50% reduziert!\n\nDas Ganze kann man sich auch sehr schön verdeutlichen wenn man sich überlegt, wieviele hits à 100 DMG man bei 2k leben und varierendem Rüstungswert überlebt - der Zusammenhang ist linear.\n\nDein Punkt ist deshalb nicht unbedingt falsch: 20 Rüstung mehr oder weniger sind bei minute 50 nicht mehr sehr relevant. Dies liegt aber nicht an der Art wie der Schaden berechnet wird, sondern ganz einfach an der Tatsache dass dieselbe lineare Erhöhung (der effektiven HP für das beispiel Rüstung) bei höheren Werten zu einer schwächeren prozentualen Erhöhung führt. Dies sieht man auch bei z.b. AD: Einen ADC stört es nicht gross, ob er jetzt im lategame 400 oder 380 AD hat. Ob man im early aber 100 oder 120, ist ein gewaltiger Unterschied.","replies":[]}]},{"poster":"Hângman","date":"2015-05-10T17:24:32.305+0000","up_votes":1,"down_votes":0,"body":"Ich finde eher man sollte sich selbst einschätzen und dem spielstil abhängig machen ob man scaling oder flat benutzt. Wenn ich als Top laner früh versuche zu traden oder zu engagen dann lohnen sich eher die flat. Sollte ich aber eher ein passiver spieler sein der einfach die ersten lvl nur farmt und nicht allzuviel wert darauf legt zu poken bzw. so hart zu pushen das man vom gegnerischen Jungler gegankt wird, dann würde ich eher die scaling empfehlen. Bei mir in der Silber ELO sieht man viel das sich die Spieler keine gedanken machen ich selbst wechsle jetzt von Flat auf Scaling Health um da diese mir wesentlich mehr bonus geben und einfach im Lategame sinnvoller sind. \n\nGrüße {{champion:63}}","replies":[]},{"poster":"CabsIog","date":"2015-05-07T10:56:07.762+0000","up_votes":1,"down_votes":1,"body":"Die rune der wachsenden rüstung ist eher lategame orientiert. Runen haben aber vorallem einen einfluss auf dass earlygame. Im lategame holt man sich die rüstung mit items. Deshalb ist die rune der wachsenden rüstung nicht so effizient.","replies":[{"poster":"Zyten","date":"2015-05-07T11:06:40.345+0000","up_votes":1,"down_votes":0,"body":"Die Scaling Armor Runen sind ab Level 7 stärker. Das ist noch relativ im Early Game, wo man grade als AP Midlaner noch nicht all zu viel Armor hat. Grade dann lohnen sie sich. \n\nDie Effizienz ist meiner Meinung nach sogar höher als die Static Armor, da du eine höhere Menge erreichst und dafür nur das Early ein wenig safer spielen musst.\n\nAls Tipp für dich: EXP Runen lohnen sich wirklich garnicht, da du viel zu wenig Bonus bekommst. Du gibst dafür eine Quintessenz auf, die dir das Early oder auch das Late (je nach dem ob Scaling oder nicht) verbessert.","replies":[]}]}]}