{"poster":"Giannurca","date":"2019-06-30T22:19:10.935+0000","title":"Campione non consegnato dopo l'acquisto","subforum":"Aiuto e supporto","up_votes":2,"down_votes":0,"body":"Ho comprato Qiyana  {{champion:246}}  a 7800 EB ma, andando nella collezione campioni, non la segna come campione acquistato, e inoltre non la posso pickare in partita.\r\n\r\nSe controllo nella cronologia acquisti segna che la ho acquistata.\r\n\r\nCosa posso fare?","replies":[{"poster":"Dodop","date":"2019-07-01T15:25:30.882+0000","up_votes":1,"down_votes":0,"body":"Da quel link devi inviare tu una richiesta al supporto dato che solo loro possono aiutarti in questo caso. Fai il login, compila i campi richiesti, descrivi in modo dettagliato il problema e attendi una loro risposta, prevista solitamente entro 24/48 ore.","replies":[{"poster":"Giannurca","date":"2019-07-01T16:09:18.902+0000","up_votes":1,"down_votes":0,"body":"Lo so, ma io devo scegliere una delle richieste predefinite, e nessuna di queste c'entra con il mio problema.","replies":[{"poster":"Dodop","date":"2019-07-01T22:24:38.146+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Giannurca,realm=EUW,application-id=98NGV4Al,discussion-id=onKXe7oX,comment-id=00020000,timestamp=2019-07-01T16:09:18.902+0000)\n>\n> Lo so, ma io devo scegliere una delle richieste predefinite, e nessuna di queste c'entra con il mio problema.\n\nSì hai ragione, in effetti non c'è nessun campo inerente a problemi con acquisti tramite BE dato che il tipo di richiesta sul negozio riguarda solo transazioni con RP. Ti direi di selezionare \"problemi tecnici\" e descrivere poi precisamente il problema a partire dall'oggetto.","replies":[]}]}]},{"poster":"Sichelgaita","date":"2019-07-01T18:52:51.515+0000","up_votes":1,"down_votes":0,"body":"è successo anche ame mesi fa con le skin di leona e lissandra.. poiche le comprai quando erano nella collezione ma non ancora nello shop , risultato identico pagate rp , rp spesi, inserito l acquisto in cronologia ma ... niente champ.. ricomprai ma non ho mai avuto nessun rimborso.","replies":[]},{"poster":"Dodop","date":"2019-06-30T22:48:29.347+0000","up_votes":1,"down_votes":0,"body":"Prova a riavviare il client e attendi un po' di tempo, in questi giorni l'introduzione del TFT ha sovraccaricato pesantemente i server ed è possibile che ci siano ritardi nelle transazioni o negli acquisti.\nSe anche dopo diverse ore non ti è arrivato il campione, invia un ticket al Supporto Riot [qui](https://support.riotgames.com/hc/it/requests/new).","replies":[{"poster":"Giannurca","date":"2019-07-01T11:58:56.206+0000","up_votes":1,"down_votes":0,"body":"Il campione non è ancora arrivato.\n\nCliccando sul link che mi hai inviato non c'è nessun tipo di richiesta che c'entra con il mio problema.\n\nQualche altra soluzione?","replies":[]}]},{"poster":"ZOMBIE 4 ALEX","date":"2019-06-30T22:45:53.622+0000","up_votes":1,"down_votes":0,"body":"Hai gia provato a ri-lloggare? Certe volte quando vinco premi nn me li danno ma appena ri-loggo li ricevo","replies":[]}]}