{"poster":"e1chQ","date":"2017-01-26T16:04:47.245+0000","title":"Midlaner & Adc suchen Rankedteam.","subforum":"Clans & Teams","up_votes":1,"down_votes":1,"body":"Zwei Mitbewohner aus der Sibler/Gold Elo sucht ein Team f&uuml;r entspanntes Ranken. Sind beide 21 Jahre alt und motiviert sich in LoL zu steigern. Meldet euch einfach bei uns. TS und Headsets sind vorhanden sowie gutes Internet. Was wir von euch erwarten, dass ihr mindestens 18 Jahre alt seit und eine Mainrolle habt die zu uns passt.","replies":[{"poster":"Gravost","date":"2017-01-26T21:58:28.909+0000","up_votes":1,"down_votes":0,"body":"Grüß dich, ich kann dir zwei Sachen anbieten:\n\n1. Führe ich eine Liste mit Spielern, die auch ein Team suchen. Ich kann ich dazuschreiben und gebe dir den Link. Dir steht es dann frei, die Spieler anzuschreiben in der Liste oder abzuwarten, ob sich jemand meldet..\n\n2. Falls du dann noch mit deinem Team oder alleine auf der Suche nach einer Community bist, lade ich ich dich auf unseren TS herzlich ein. Daten kriegst du ebenfalls dann bei Interesse.\nIn unserer Community sind derzeit 12 Teams aktiv, Bronze - Master vertreten, somit kannst du leicht Scrim-Partner finden und Coaching bieten wir ebenfalls an.\n\nDie Liste kriegst du unabhängig davon, ob du in die Community möchtest! :)\n\nWenn du Interesse an dem 1. oder/und 2. hast, adde Gravost\n\nLiebe Grüße","replies":[]},{"poster":"LCG mozuki","date":"2017-01-26T17:27:34.686+0000","up_votes":1,"down_votes":0,"body":"Du hast es satt ständig alleine zu Spielen? Deine Teammates verstehen dich einfach nicht? Du bist schon lange auf der Suche nach einen DuoQ Partner oder festen Team?\nDann schau doch mal bei Rift Guardians vorbei dort wird all die’s Angeboten, mehr dazu in unseren Vorstellungspost, denn ich dir unten vermerken werde!\n\nBis bald...\n\nMit freundlichen Grüßen\n\nVorstellungspost: http://boards.euw.leagueoflegends.com/de/c/clans-teams-de/OcnVX8Qx-a-rift-guardians-sucht-mitglieder-teams-teamerstellung-community-coaching-a","replies":[]}]}