{"poster":"Arconten Tetrico","date":"2018-08-16T21:57:05.107+0000","title":"¿MMORPG de LOL?","subforum":"Charlas Generales","up_votes":23,"down_votes":1,"body":"Tras las salidas del mapa interactivo de rutaterra y la animaci&oacute;n de ryze, se a estado hablando de la probabilidad de un mmorpg de este juego y yo pienso: &iquest;por que no?, este juego pose una historia amplia y un mundo fascinante el cual encajar&iacute;a a la perfecci&oacute;n con la est&eacute;tica de un mmo, tenemos los t&iacute;picos humanos {{champion:86}} , animales antropom&oacute;rficos{{champion:12}} , enanos{{champion:74}} , espectros{{champion:412}} , demonios{{champion:266}} , etc etc etc.\n\n Escuche ase unas semanas que ryze o trindamare (no se cual de los dos) hab&iacute;a puesto en su twitter (tras la salida de la animaci&oacute;n de ryze), que deber&iacute;an empezar a trabajar en el mmorpg de lol (no se si sera cierto) y ahora en el nuevo v&iacute;deo que subi&oacute; riot games en el cual dicen &quot;tambi&eacute;n tenemos un contenido nuevo que es simplemente fuera de este mundo&quot; y &quot;nos vemos en la grieta... &iexcl;y quiz&aacute;s mas all&aacute;!, puede que lo este interpretando mal pero la primera frase yo la interpreto como que se refiere a que el nuevo producto esta fuera del mundo de los mobas y no fuera del mundo del juego, dado a que en la segunda frase dice nos vemos en la grieta y quiz&aacute;s mas all&aacute;, se podr&iacute;a referir al mismo mundo de runaterra, por todo esto yo creo que sera posible que este &quot;nuevo producto&quot; sea el mmo que supongo que muchos han esperado. Ese mmo, yo creo que seria la mejor manera de explorar todo el mundo de runaterra, dado a que actualmente la historia esta siendo desperdiciada confinando a los jugadores a peque&ntilde;os mapas que casi no se mencionan en la historia poniendo a luchar a los campeones sin ning&uacute;n prop&oacute;sito.\n\nQuiero que comentes si estas de acuerdo con migo o no, pero con respeto{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Lyzant","date":"2018-08-17T06:07:17.571+0000","up_votes":7,"down_votes":0,"body":"Van a sacar una linea de muñecas sexuales de las campeonas de League Of Legends. Saquen cap","replies":[]},{"poster":"Juice Wrld","date":"2018-08-17T04:41:50.724+0000","up_votes":5,"down_votes":0,"body":"Al leer el \"ase\" te di otra oportunidad pero deje de leer cuando vi el \"trindamare\".","replies":[{"poster":"DanteMOBALegend","date":"2018-08-17T05:00:09.065+0000","up_votes":6,"down_votes":0,"body":"Lo mismo me pasó cuando ví su ortografía y Vi que le decía a los champions cosas como enanos,demonios y etc.\nAl pedo tanta paga al los escritores y trabajos en el lore si son enanos no más.","replies":[{"poster":"Juice Wrld","date":"2018-08-17T05:11:10.533+0000","up_votes":7,"down_votes":0,"body":"Soy main humano {{champion:64}}","replies":[]}]}]},{"poster":"TheBoss2190","date":"2018-08-17T05:13:03.363+0000","up_votes":6,"down_votes":0,"body":"Ahora nos salen con un candy crush para celulares con los iconos de las runas\n{{sticker:sg-miss-fortune}}","replies":[]},{"poster":"Main Cocina S3","date":"2018-08-16T22:03:01.538+0000","up_votes":5,"down_votes":0,"body":"tendrian que hacer varios mapas gigantescos, reworkear la mitad si no todos los campeones para que tengan un balance, armar zonas exclusivas para pvp y pve, misiones o quests, items y formas de inventario, posibilidad de guardar progreso constantemente\n\npor no mencionar la cantidad de servidores, en latinoamerica directamente no existe ese nivel de tecnologia todavia asi que quedaria relegado a eeuu y europa como la mayoria de los mmo\nla idea en si es buena pero hacerla realidad es una mision titanica","replies":[{"poster":"Arconten Tetrico","date":"2018-08-16T22:21:48.236+0000","up_votes":4,"down_votes":0,"body":"Tienes razón seria una tarea muy grande y difícil pero no imposible. Si me permites voy a aclarar punto por punto: en torno a mapa yo pensaría en algo tipo guild wars 2, un solo mapa grande dividido en partes mas pequeñas las cuales se pueden descargar individualmente, reworkear los campeones no seria necesario dado a que pasarían a ser npc y vos te crearías tu propio personaje en base a la raza de los campeones, en armas podrían tomar las del LOL haciendo pequeños cambios a estas, obviamente también creando otras pero ya tendrían un punto de referencia. estos para mi son los mas importante de aclarar y en torno a los servidores esos si seria un problema dado a lo terribles que ya son en lol en un moba tendría que ser por continente y un server americano unificado seria un caos y con mucho lag ese seria el único inconveniente pero creo que podría ser resuelto, yo juego juegos los cuales tienen sus server en NA y no tengo problemas de lag así que puede ser solucionado.","replies":[]}]},{"poster":"LyghtSh","date":"2018-08-17T01:22:45.992+0000","up_votes":1,"down_votes":0,"body":"{{champion:136}}  y {{champion:31}}  probablemente no entrarian en el mapa xD","replies":[{"poster":"EvilGun","date":"2018-08-17T09:18:44.823+0000","up_votes":4,"down_votes":0,"body":"Pero podrían darle un papel en e que se vea de lejos y tan grande que te haría sorprender, imagina estar jugando y ver a cho gat en el cielo o desde lejos con un tamaño enorme, quedo flipando chaval","replies":[]},{"poster":"jumpalo","date":"2018-08-17T22:50:44.799+0000","up_votes":2,"down_votes":0,"body":"podrían ser eventos, como jefes, etc","replies":[]}]},{"poster":"HOZKAR","date":"2018-08-16T22:31:55.692+0000","up_votes":4,"down_votes":0,"body":"Seria genial {{sticker:sg-ezreal}}","replies":[]},{"poster":"IIIIIIIIIIIIIIII","date":"2018-08-17T00:10:19.001+0000","up_votes":3,"down_votes":0,"body":"Mirá lo que están pensando hacer en algun futuro es un Battleground, no un MMORPG, esté ultimo es mas jodido de mantener o sacar ganancias,  no podes hacer competencias justas en un MMORPG por lo que no habria escena competitiva, se tendría que mantener con una membresía mensual supongo (como el WoW), los MMORPG que no lo hacen terminan siendo P2W","replies":[{"poster":"Warisan","date":"2018-08-17T12:13:33.178+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=NauticaI,realm=LAS,application-id=v7qsfXsE,discussion-id=Gcevj2Ws,comment-id=0004,timestamp=2018-08-17T00:10:19.001+0000)\n>\n> Mirá lo que están pensando hacer en algun futuro es un Battleground, no un MMORPG, esté ultimo es mas jodido de mantener o sacar ganancias,  no podes hacer competencias justas en un MMORPG por lo que no habria escena competitiva, se tendría que mantener con una membresía mensual supongo (como el WoW), los MMORPG que no lo hacen terminan siendo P2W\n\nQué no se pueden hacer competencias justas en un MMORPG? no sé, pero, hay competencias nacionales y (creo) mundiales de Blade and Soul, World of Warcraft (incluso hay de Monster Hunter World, no se si este entra en este tema) donde hay competencias de PvP y PvE, las de PvP van de 5v5, 3v3 o 1v1 con sistema de torneo y en cambio, las de PvE son hacer ciertos objetivos, ya sean mazmorras o matar algún jefe, en un tiempo estimado, siendo el equipo ganador el que completa la tarea en el menor tiempo posible","replies":[]}]},{"poster":"menujunaeb","date":"2018-08-19T00:56:15.808+0000","up_votes":2,"down_votes":0,"body":"una obra maestra si lo emplean bien","replies":[]},{"poster":"Ode to dark","date":"2018-08-17T02:54:24.862+0000","up_votes":2,"down_votes":0,"body":"Sería maravilloso","replies":[]},{"poster":"bombastico","date":"2018-08-16T22:48:28.799+0000","up_votes":2,"down_votes":0,"body":"Porque lamentablemente los mmorpg ya no venden como antes, ademas tendria que entrar a competir con el gigante del wow.\nSeria una inversion gigante con poca posibilidad de recuperarla.","replies":[]},{"poster":"Nabuze","date":"2018-08-17T13:16:30.398+0000","up_votes":1,"down_votes":0,"body":"Por fuera de este mundo yo interpretó que no tiene nada que ver con league ofiñ legends pero cada uno le dan la interpretación de lo que espera.\nSiempre dijeron que quieren trabajar en otro juego pero nunca dijeron que sería un mmo. Hasta ahora no se sabe nada de ese nuevo juego.","replies":[]},{"poster":"NeoGibiky","date":"2018-08-16T23:39:09.437+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Arconten Tetrico,realm=LAS,application-id=v7qsfXsE,discussion-id=Gcevj2Ws,comment-id=,timestamp=2018-08-16T21:57:05.107+0000)\n>\n> Tras las salidas del mapa interactivo de rutaterra y la animación de ryze, se a estado hablando de la probabilidad de un mmorpg de este juego \n\nNo se yo pero no he visto ese tema en ninguna parte .-. ademas ir a competir con wow es un suicidio ahora y menos con la credibilidad de riot vs la de blizzard xD","replies":[]},{"poster":"nazareno 567","date":"2018-08-17T14:06:30.468+0000","up_votes":1,"down_votes":2,"body":"League of Legends Battle Royale {{sticker:slayer-pantheon-thumbs}}","replies":[]}]}