{"poster":"nazuro1","date":"2019-07-21T19:28:56.877+0000","title":"AFK was kann man dagegen machen","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":0,"body":"Mann will ein spiel machen und jemand geht afk nache einer gewissen zeit afk \r\n\r\nWie kann man das umgehen ?{{sticker:zombie-nunu-bummed}} \r\n\r\nDarf man dan auch afk gehen ,wiel es ein 4 gegen 5 ist und mann kein 20 bis 30 min ein sehr frustendes Spiel haben will ?\r\n\r\nUnd bekommt man sein lp woder ?","replies":[{"poster":"Megamaexx","date":"2019-07-21T19:42:02.491+0000","up_votes":4,"down_votes":0,"body":"Um die AFK-Quote in seinen Spielen gering zu halten, sollte man selbst nicht AFK gehen.","replies":[{"poster":"AI Marko","date":"2019-07-21T20:12:23.015+0000","up_votes":2,"down_votes":1,"body":"nicht toxic sein verringert die AFK-Quote auch","replies":[{"poster":"nazuro1","date":"2019-07-21T20:19:29.842+0000","up_votes":1,"down_votes":0,"body":"Das stimmt XD \n\nAber meine wirklich die situation das jemand afk geht, auch wenn das spiel gut leuft \n\nIch weiß es gibt sicher ein Grund, sei es die Telekom oder einfach das was anderes wirklich wichtiges pasiert ist . \n\nTrozdem muss mann doch keine lp falieren?  (Wenn mann wirklich dafür nix kann)","replies":[{"poster":"MeMyselfandBaal","date":"2019-07-22T04:27:20.470+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=nazuro1,realm=EUW,application-id=ip27PlEH,discussion-id=uZbjmmHt,comment-id=000000010000,timestamp=2019-07-21T20:19:29.842+0000)\n> \n> Aber meine wirklich die situation das jemand afk geht, auch wenn das spiel gut leuft \n> \n\nWie oft passiert dir das im Jahr? Also dass du, sagen wir 3K Gold im Vorsprung bist, die Drachen auf deiner Seite hast und dann ein Spieler aus technischen Gründen (oder weil Mutti unbedingt jetzt das Essen fertig hat) dein Spiel verlässt und du verlierst? \nAlso mir passiert das ohne zu übertreiben alle 100 Spiele mal... Wenn ich das mit den Spielen vergleiche, die ich verliere, weil 2 meiner Teammates sich lieber streiten als spielen. Oder weil ich einfach Scheiße baue und sinnlos reinfeede... Oder eines meiner Teammates sinnlos reinfeedet, obwohl ich eigentlich ordentlich spiele.\n\nIch gebe Leuten ja immer den Rat sich von der Bedeutung der einzelnen Niederlage oder des einzelnen Sieges zu lösen. Also ich hatte letztes Jahr nen Spiel mit perfekter Alistar KDA (und auf einigen Kills und Assists, ich hatte die KDA nicht, weil ich in der Base gechillt habe), welches aber einfach nicht zu gewinnen war, weil unser Midlaner frühzeitig (aber genau nach der Remake Schwelle) AFK gegangen war. Auf der ersten Ebene war dieses Spiel frustrierend, aber dann dachte ich mir: Wenn ich unter diesen Umständen einen souveränen Alistar abliefern kann, werde ich mit diesem Champ auf diesem Niveau viele Spiele gewinnen.\nGleichzeitig finde ich jedes Jahr Spiele, bei denen ich mir denke \"Das gewinnst du jetzt nur, weil ein Gegner AFK war...\" Oder weil meine Teammates mich gecarried haben. Nach solchen Spielen denke ich dann immer \"Verdammt, du musst mal deine Spielweise auf diesem Champion ändern.\"\n\nWenn man selber verstanden hat, dass man definitiv aufsteigt, wenn man selber konstant gut spielt, dann verschiebt man auch den Fokus darauf, dass man selber gut spielt. Und dann wird man unabhängig von den AFKlern ein besserer Spieler und alles, was die dann machen (was durchaus nervig ist, ich kann den Frust verstehen) ist ja, dass man 5 Spiele mehr braucht um sein Saisonziel zu erreichen. Aber der einzelne AFKler hat im Endeffekt keinerlei Einfluss auf deine Elo...","replies":[]},{"poster":"AI Marko","date":"2019-07-21T22:32:28.641+0000","up_votes":2,"down_votes":0,"body":"nutze die Gelegenheit [ x) ] und versuch dinge die du nicht testen wollen würdest wenn es ein normales game wäre\nbsp du würdest nie 1 vs 3 versuchen weil du weiß das es dumm wäre und falls du stirbst ist es schlecht für dich und dein team ist\n\njetzt kann du es versuchen und falls es klappt kommt ihr ahead und könnt das game eventuell noch gewinnen und wenn nicht lerst du mehr von dein champ","replies":[]}]}]},{"poster":"Sly Lynx","date":"2019-07-21T19:49:08.986+0000","up_votes":2,"down_votes":0,"body":"Meine Rede!","replies":[]}]},{"poster":"BlackSugaRose","date":"2019-07-21T20:52:22.819+0000","up_votes":2,"down_votes":0,"body":">Wie kann man das umgehen ?\n\nZeig dich von deiner besten Seite und hoffe, dass niemand das Spiel verlässt\n\n> Darf man dan auch afk gehen ,wiel es ein 4 gegen 5 ist und mann kein 20 bis 30 min ein sehr frustendes Spiel haben will ?\n\nNein, du darfst jedoch einen Surrender Vote starten\n\n>Und bekommt man sein lp woder ?\n\nNein, es seie denn es handelt sich um ein Remake, dann geht es nicht in die Wertung ein","replies":[{"poster":"611FVNKBlv","date":"2019-07-21T23:30:15.089+0000","up_votes":2,"down_votes":0,"body":"> Nein, du darfst jedoch einen Surrender Vote starten\n\nFrage mich wieso dann nicht jeder Challenger permabann hat {{sticker:sg-miss-fortune}}","replies":[{"poster":"Megamaexx","date":"2019-07-22T03:58:14.537+0000","up_votes":3,"down_votes":0,"body":"> Frage mich wieso dann nicht jeder Challenger permabann hat \n\nWeil Kühe Milch geben.","replies":[{"poster":"nazuro1","date":"2019-07-24T18:20:59.556+0000","up_votes":1,"down_votes":0,"body":"Das unterstüzue ich {{champion:12}}","replies":[]}]},{"poster":"nazuro1","date":"2019-07-24T18:20:07.551+0000","up_votes":1,"down_votes":0,"body":"Eben nicht, wen der jenige xp bekommen hat geht es nicht meher","replies":[]}]}]},{"poster":"NiicQ","date":"2019-07-21T21:21:19.602+0000","up_votes":2,"down_votes":0,"body":"Ich habe schon oft spiele 4 v 5 gewonnen! Geb nicht direkt auf wenn ihr in Unterzahl seit. Versuche dein Team zu motivieren und fokusiere dich auf das Spiel nicht auf den AFK. Die Chance zu gewinnen ist zwar niedriger aber es ist möglich. Und sei nicht sauer wegen dem AFK er kann auch einfach technische Schwierigkeiten haben oder so, da kann er auch nichts für.","replies":[]}]}