{"poster":"koalaJVR","date":"2017-03-13T00:00:06.065+0000","title":"el lol se me pega en 30 FPS","subforum":"Charlas Generales","up_votes":2,"down_votes":1,"body":"Buenas, mi problema es que al entrar a una partida del lol, independiente de la resoluci&oacute;n de la pantalla, se me clava en 30 fps.\r\nMi Notebook tiene un procesador i7-6700HQ 2,6 GHz hasta 3,5 GHz, una RAM de 12 GB DDR4 y una tarjeta gr&aacute;fica NVIDIA GeForce GTX 960M 4gb\r\n\r\n(Aclaro, mi notebook tiene una pantalla 4k, pero ya lo intent&eacute; baj&aacute;ndole la resoluci&oacute;n) gracias :c","replies":[{"poster":"Devourer","date":"2017-03-13T00:29:54.025+0000","up_votes":1,"down_votes":0,"body":"Y con otros juegos no tenes problemas?, o es solo el lol?\n\nHace lo que te dicen abajo, una posiblidad es que estas usando la tarjeta intel y no la nvidia de alto rendimiento\n\nEDIT: La notebook no es, yo tengo una con un I5, 6 de ram y una nvidia 740m, inferior en todos aspectos a la tuya y me anda a 140 fps","replies":[{"poster":"koalaJVR","date":"2017-03-13T00:32:16.699+0000","up_votes":1,"down_votes":0,"body":"Como es nueva aun no se muy bien como optimizarla para jugar lol al maximo, asi que debe de ser por eso","replies":[{"poster":"Devourer","date":"2017-03-13T00:37:33.447+0000","up_votes":1,"down_votes":0,"body":"Creo que habia una opcion que limitaba los FPS, fijate si no esta activado","replies":[{"poster":"koalaJVR","date":"2017-03-13T00:44:37.745+0000","up_votes":2,"down_votes":1,"body":"Ya pude arreglarlo, el notebook no estaba corriendo con la Nvidia, sino con la integrada, ahora el lol me corre a 216 fps *-*","replies":[{"poster":"wandy maD","date":"2018-02-16T15:14:51.669+0000","up_votes":3,"down_votes":2,"body":"Como hiciste para solucionar el problema, me pasa lo mismo y mi notebook tiene las caracteristicas muy similares a la tuya. Me lo podrias explicar?","replies":[]}]}]}]}]},{"poster":"Hwaxinghz","date":"2017-03-13T00:18:29.964+0000","up_votes":1,"down_votes":0,"body":"con esa NOTEBOOK no se te debería trabar nada.\n\nPrueba lo siguiente:\n\nEn el menú de las opciones de vídeo:\n- Pon gráficas en ALTO.\n- Desactiva las Sombras\n- Desactiva la opción \"Sincronización Vertical\"\n- Desactiva la Opción \"Antisolapamiento\"\n- Pon la resolución de pantalla que te diga recomendada (1280x720, 1366x768 o 1920x1080, alguna de esas es la recomendada, no uses la resolución 4K).\n\nEn el Menú de las opciones de JUEGO:\n- DESTILDAS la opción de \"Predicción de Movimiento\".\n\nSi con eso no te funciona, ve a las opciones de la placa de vídeo (botón derecho en el escritorio, abrir configuración de NVIDIA), dentro del menú, busca un apartado que dice: \nAjustar la configuración de la imágen con vista previa, ahí estableces la opción abajo que dice \"RENDIMIENTO\", de esa forma se quitará la gran mayoría de los efectos de la placa de vídeo, y por ende andará mejor.\n\nCuéntame como te fue","replies":[{"poster":"koalaJVR","date":"2017-03-13T00:31:45.930+0000","up_votes":1,"down_votes":0,"body":"Hice todo lo que sale al comienzo, probaré con lo de la tarjeta gráfica","replies":[{"poster":"koalaJVR","date":"2017-03-13T00:45:19.507+0000","up_votes":1,"down_votes":0,"body":"Gracias bro, lo de la tarjeta gráfica me sirvió, ahora el lol me corre a 216 fps <3","replies":[{"poster":"Hwaxinghz","date":"2017-03-13T01:36:11.381+0000","up_votes":1,"down_votes":0,"body":"ok, suerte e.e. Esa notebook está buenísima.","replies":[]}]}]}]}]}