{"poster":"XJuuzouY","date":"2015-10-11T21:15:47.510+0000","title":"Neue skins für Champs die nicht so viele haben?","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Champs wie {{champion:18}} {{champion:131}} {{champion:157}}  haben im gegensatz zu Champs wie {{champion:105}} {{champion:1}} {{champion:22}}  ziemlich wenige skins, oder?;) \r\nKann man nicht neue skins f&uuml;r die rausbringen?:3  {{champion:223}}  hat ja zB nur einen Skin...nagut der ist ja auch neu, hoffe aber auf weiter skins von ihm. \r\nBei Diana kann man ja vielleicht einen blut**mond** skin machen!","replies":[{"poster":"SenseIessDreamx","date":"2015-10-11T21:48:04.690+0000","up_votes":2,"down_votes":1,"body":"Ich wäre ja für nen neuen Riven Skin. Der letzte ist schon seit 2 Monaten draußen da muss ein neuer kommen!","replies":[]},{"poster":"Sahnepuffelchen","date":"2015-10-11T22:36:47.146+0000","up_votes":1,"down_votes":0,"body":"Tristana hat wenige Skins ? Die hat ( ohne Kostenlosen Skin ) 5 Skins, also genauso viele Fizz.","replies":[{"poster":"XJuuzouY","date":"2015-10-14T18:28:49.385+0000","up_votes":1,"down_votes":0,"body":"sie hat doch nur zwei die man so kaufen kann, oder?..und welcher kostenlose skin?\n","replies":[{"poster":"Sahnepuffelchen","date":"2015-10-14T19:29:42.833+0000","up_votes":1,"down_votes":0,"body":"Riot Girl Tristana - Kostenlos, Earnest Elf Tristana, Firefighter Tristana, Guerilla Tristana, Buccaneer Tristana, Rocket Girl Tristana + Chroma","replies":[]},{"poster":"Zero000","date":"2015-10-14T18:51:54.460+0000","up_votes":1,"down_votes":0,"body":"_Riot Girl Tristana_ kann man über Facebook erhalten.\n\n_Earnest Elf Tristana_ Legacy Skin, erscheint eventuell hin und wieder im Shop, zu speziellen Events zum Bleistift. Letztes mal erhältlich war er vom 11.12.14 bis 06.01.15, ob er dieses Jahr wieder kommt ist nicht bekannt.\n\n_Firefighter Tristana_  Retired Skin/Legacy Skin Wurde wie viele andere aus dem Shop genommen. Kann aber zu speziellen Ereignissen wieder kommen. Ob der Skin seit er aus dem Shop genommen wurde mal wieder verfügbar war weis ich nicht.\n\n_Guerilla Tristana_ ~~975 RP~~ Laut der [Support Seite](https://support.riotgames.com/hc/en-us/articles/201752944-Guide-to-Legacy-and-Limited-Skins) ist auch dieser Skin Legacy s.o.\n\n_Buccaneer Tristana_ 520 RP\n\n_Rocket Girl Tristana_ 975 RP","replies":[]}]}]},{"poster":"Spicavius","date":"2015-10-11T23:08:31.259+0000","up_votes":1,"down_votes":0,"body":"Es kommen Skins wie sie kommen. Jeder Champion kriegt irgendwan seine Palette an Skins.\nBesonders bei alten Champions wie Poppy / Urgot, die sowieso bald ein Rework bekommen bringt es sowieso nur bei dem Release des Reworks neue Skins zu bringen.\nMan muss ja bedenken, dass diverse Spells vllt komplett anders aussehen / rausgenommen werden. Somit hat der/die Designer/in einfach keine gute Grundlage um an einem Skin und an einem Konzept zu arbeiten.\n\n120+ Champion und jeder will Skins für einen bestimmten Champion. Man kann nunmal nur eine gewisse Anzahl an Skins in einem Jahr überhaupt kreieren.\nAußerdem warte ich (meine Meinung!) lieber länger auf einen Skin oder erwarte weniger Skins. Dafür sind diese aber richtig schön und gut gemacht.\n\n\n**Nebenthema:**\nDie Chroma Skins sind wohl ein Flopp gewesen oder?\nDa Ich momentan keine neuen Chroma Skins mehr sehe^^. Vllt kennt ja jemand genauere Infos. :P","replies":[{"poster":"Lyle","date":"2015-10-12T00:10:28.780+0000","up_votes":1,"down_votes":0,"body":"> Nebenthema:\nDie Chroma Skins sind wohl ein Flopp gewesen oder?\nDa Ich momentan keine neuen Chroma Skins mehr sehe^^. Vllt kennt ja jemand genauere Infos. :P\n\nDu hast mich gerade echt zum Schmunzeln gebracht. Während der Worlds hat man nun den ein oder anderen Chroma-Skin gesehen (mir ist zumindest das \"Rocket Girl Tristana Punk Chroma Pack\" öfter aufgefallen), aber seit der Einführung der Bundles habe ich ehrlich gesagt auch nur wenige gesehen. Der Trend ist wohl wirklich einigermaßen gescheitert, aber rekolorierte Partikel standen ja im Notfall auch auf dem Plan, so wie ich das mitbekommen hat. Ich denke, da ist früher oder später noch mit einer zufriedenstellenden Änderung zu rechnen.\n\nZu deiner vorhergegangen Aussage: Das mit den Reworks ist so'n Ding. Riot will es, macht sich dafür stark und verteidigt diesen Standpunkt, geht da aber nicht ganz so konsequent mit um. Dass kein Evelynn-Skin mehr vor ihrem Rework erscheinen sollte, war ja auch für einen längeren Zeitraum eine sehr starke Aussage, Savecracker Evelynn gibt's allerdings trotzdem und von 'nem Rework hab ich noch nichts mitbekommen. Das ist also auch nicht unbedingt etwas, worauf man sich berufen sollte.","replies":[]}]},{"poster":"I love you Malon","date":"2015-10-11T23:04:21.190+0000","up_votes":1,"down_votes":0,"body":"Diana und Yasuo sind im Vergleich zu Annie/Fizz/Ashe/Tristana auch keine alten champs aus der Season 1/2","replies":[]}]}