{"poster":"xWeixin Vinleous","date":"2017-12-28T20:39:31.676+0000","title":"Trolls in normal games","subforum":"Player Behavior","up_votes":1,"down_votes":2,"body":"I&#039;m trying to level up this account, and learn new champions, but I continuously get terrible teammates and trolls/ inters and toxic teammates. Its getting ridiculous to the point where in my past 5 games, 4 of them had trolls, an inter, and a toxic teammate in them. If you don&#039;t believe me, look at my losing streak I have and determine for yourself if there are trolls, or afks. Worst part about it is, I keep getting them and none of them ae banned yet.","replies":[{"poster":"o brigid o","date":"2017-12-28T20:51:03.046+0000","up_votes":3,"down_votes":0,"body":"I think a lot of seasoned players resort to calling people who aren't very good \"trolls\" and \"inters\"\n\nWhen you're leveling up a low level account, you have to keep in mind that a large portion of players don't know the champs, don't know how to build, and don't know the meta... which includes how to last hit minions, what laning phase is, which roles are best in which lanes, etc etc. These players aren't trolls, but will definitely respond negatively to someone who comes off as immediately pissy and negative just bc they aren't playing how you want them to play.\n\nWhen I started playing in season 2, I was determined to play Miss Fortune, and I wanted mid lane. I remember very clearly bc I only gained an understanding much later, in my first several games I had people saying really terrible things to me. Calling me names, accusing me of bombing games on purpose, etc etc. But no one every actually bothered to respectfully tell me why taking a glass cannon adc mid was a bad idea and why it wasn't commonly done. \n\nA new player who goes 1/11 isn't inting. They're learning a game with a pretty steep learning curve. Intentionally dying to the enemy team is rare, in my experience. Unless you see someone who has completely given up and is just running into enemy turrets over and over again... they aren't intentionally feeding the enemy. They are trying to make plays and learn the nuances of the game. Trying and failing does not equal intentionally failing.\n\nDon't be so hasty to cry wolf... or, in this case, troll.","replies":[{"poster":"xWeixin Vinleous","date":"2017-12-28T21:05:58.783+0000","up_votes":1,"down_votes":0,"body":"a ame i had riven sold all her items and straight up ran it down mid.............that's not a new player.","replies":[{"poster":"o brigid o","date":"2017-12-28T21:18:27.729+0000","up_votes":1,"down_votes":0,"body":"Looking on op.gg at your last 20 games, 14 losses, I see **one** player who looks like they afk'd after the remake window, and **one** player who sold their items (it was a leona support and also looks like she didn't do it til the end of the game bc she had 50% kill participation).\n\nWhen players go afk or sell their items, you are correct to consider them trolls. But taking a look at your own history, it doesn't look like it's happening even close to as frequently as you claim. It isn't \"continuously\" happening. It's happening in maybe 1 or 2 out of 20. And in this case, only 1 afk in 20 isn't anything to be up in arms about. Real life happens. Emergencies happen. Unforeseen circumstances happen. And when we sit down to play a cooperative game, we all must accept that it *is* just a game and that the risk exists for outside forces pulling one of our teammates from the game.\n\nI understand it's frustrating when you're on a losing streak. My advice going forward to avoid the \"sell all items run it down mid\" variety... don't provoke someone you think might be a troll. Don't interact with them in any way. Mute them (or everyone), and play as best you can with what you got. Don't flame chat. Don't let them have any idea they bother you. Just report them after the match and move on.","replies":[{"poster":"xWeixin Vinleous","date":"2017-12-28T21:37:48.901+0000","up_votes":1,"down_votes":0,"body":"look at my last 10 games, it wsnt just a Leona, it was a riven, 3 afks in 5 games. you aren't paying attention at all.","replies":[{"poster":"xWeixin Vinleous","date":"2017-12-28T21:38:23.163+0000","up_votes":1,"down_votes":0,"body":"riot can look at the chat, it was literally out of nowhere that riven ran it down. we were stomping the other team.","replies":[{"poster":"xWeixin Vinleous","date":"2017-12-28T21:39:28.237+0000","up_votes":1,"down_votes":0,"body":"look back at my games on lolking to see what happened throughout the game, you are obviously trying to make me look bad.","replies":[]}]}]}]}]}]},{"poster":"General Esdeath ","date":"2017-12-28T21:40:05.130+0000","up_votes":1,"down_votes":0,"body":"What is a \"troll\" in your mind? Someone trying something unusual or non-meta?","replies":[{"poster":"xWeixin Vinleous","date":"2017-12-28T22:59:41.200+0000","up_votes":1,"down_votes":0,"body":"somebody who sells all their items and runs it down mid. or rages, flames, then goes afk.","replies":[{"poster":"General Esdeath ","date":"2017-12-29T07:02:44.521+0000","up_votes":1,"down_votes":0,"body":"I feel like trolling is more killing your team mates, like using an Anivia wall to block their escape, flashing to them with a fizz ult, etc. The rest is inting/afk","replies":[]}]}]},{"poster":"Butt Ρlug","date":"2017-12-28T20:54:49.620+0000","up_votes":1,"down_votes":0,"body":"Yeah just be aware that you'll be playing with people that are new to the game, don't know anything about the champion they play, itemization and so on.\nFor the toxic ones just report them, but if you get someone that for example play his first game as jungler, let say with renekton or something, and you see him getting killed 5 times by the redbuff, it might be because he doesn't know anything about jungling/renekton/the game in general.\n\nAlso keep in mind that we are near christmas and there is a lot of kids in vacation.","replies":[{"poster":"xWeixin Vinleous","date":"2017-12-28T21:06:43.350+0000","up_votes":1,"down_votes":0,"body":"so you are telling me that when players go afk, or sell all their items and run it down mid, that's what new players do? no.","replies":[{"poster":"Butt Ρlug","date":"2017-12-28T22:03:08.882+0000","up_votes":1,"down_votes":0,"body":"Actually if you are able to read what i said you could tell that no, i did not say that :)\nI'm just telling you that some people that you might consider as trolls or something like that might just be peoples that don't know anything at all about the game mechanics/their champions/matchups/.....\nOf course if they run down mid having sold all their items they are not in this case, is that so difficult to understand ?\n\nYou won't be able to do much about it, just report them.","replies":[]}]}]}]}