{"poster":"Pabliten","date":"2019-08-21T02:04:35.242+0000","title":"Emparejamiento","subforum":"Problemas Técnicos","up_votes":4,"down_votes":2,"body":"No les pasa que en todas sus rankeds los emparejan con gente que es increiblemente mala? cada ranked que juego me toca con gente pt y si gano 1 es por que la carreo. Pero siempre con los otros 4 del team fedeando al enemigo\r\nYa estoy cansado de estos emparejamientos, llevo 2 años jugando al LoL y no para de tocarme gente mala y para mas frustracion soy el unico que gana su linea...\r\nsi algun agente de Riot mira esto, dese cuenta que su emparejamiento es una MIERDA.","replies":[{"poster":"VENI FIORA","date":"2019-08-21T02:36:44.190+0000","up_votes":2,"down_votes":0,"body":"esa gente con la que te emparejan es por que otros los carrean y suben por suerte de division","replies":[]},{"poster":"inissh","date":"2019-08-21T03:10:39.819+0000","up_votes":2,"down_votes":1,"body":"A ver. Riot de mierda. Porque esta palabra te define. Son un asco de juego sinceramente. Ahora me banearon la cuenta por 14 días por abuso verbal.... y cuando los demás me insultan? No haces nada.... te mando los reportes y no haces nada... pero a mi si? Cuando llegan jugadores que solo pierden para hacerte perder a ti.... y los reporto no haces nada.... cuando se desconectan y los reporto no haces nada.... ósea que porque yo ya tengo historial de abuso verbal me castigas? Soy competitivo y juego para ganar y es obvio que jugadores juegan para hacerte perder.... pero a esos los premias verdad Riot hijo de puta? A ellos los premias y a nosotros nos castigas.... tú juego y tus reglas son un maldito asco... hasta aquí llegaron mis aportes a tu juego.","replies":[{"poster":"ToraYasashi","date":"2019-08-22T13:30:27.425+0000","up_votes":1,"down_votes":0,"body":"PD: mandele saludos al Sr. Dota","replies":[]}]},{"poster":"Mazoku","date":"2019-08-21T02:29:51.491+0000","up_votes":1,"down_votes":2,"body":"Te emparejan con gente de tu mismo nivel de habilidad. Si son malos entonces...","replies":[{"poster":"Pabliten","date":"2019-08-22T01:59:07.968+0000","up_votes":0,"down_votes":0,"body":"tengo un kda de 2.77 no me tendria que emparejar con gente asi...","replies":[{"poster":"Mazoku","date":"2019-08-22T02:08:10.694+0000","up_votes":1,"down_votes":1,"body":"Es poco KDA.\n\nDe todas formas, lo que importa es si ganas o perdes y no tu KDA.","replies":[]}]}]}]}