{"poster":"nm1010","date":"2018-04-06T13:08:17.947+0000","title":"Now that I've been playing Talon again","subforum":"Gameplay","up_votes":62,"down_votes":4,"body":"Can we fix the stupid wall hopping bug that makes you jump the wrong direction? It legitimately impacts 1/3 games in a major way (either requiring flash to be blown or I die). No my mouse cursor is not in the wrong position.\n\nExamples\n\nhttps://www.youtube.com/watch?v=YXl4iKT00DQ\n\nhttps://i.gyazo.com/3ccef592c20d3bd25c32c2b9a01c49bf.jpg\n\nhttps://i.gyazo.com/c41f32b4a4183786bf1b3a97c382f544.jpg\n\nIt took 2 minutes in practice tool to replicate twice. Arrow is where I came from, X is where I was clicking, O is where I went. Some of the most frequent places this happens are towers, nexus, krug camp wall, dragon pit (not baron, for me at least), raptors wall, and the thick river walls by mid. The likely cause of this issue is the fact that the walls are drawn like spaghetti for some reason. They have sharp angles that don&#039;t follow the wall very well, leading to this bug where I believe you can actually get too close to the hit box which causes you to jump erratically.\n\nhttps://i.gyazo.com/84ae12e172a61642eb8aec629e1b888d.png\n\n######Potential problem areas in dragon pit","replies":[{"poster":"Ultîma","date":"2018-04-06T16:07:36.879+0000","up_votes":23,"down_votes":1,"body":"I don't even play Talon that much and I've experienced this multiple times. I don't know why Talon's jump is locked into going forward once it is initiated. It would be so incredible if we could change directions mid-jump to better follow-up on enemies. Could you imagine if Kayn was stuck moving forward Magical Journey style once he passed through a wall? The parkour could feel a lot more intuitive.","replies":[{"poster":"Votable Jester","date":"2018-04-06T16:58:46.305+0000","up_votes":11,"down_votes":0,"body":"I've literally jumped in place a few times, as in gone through the animation, not moved at all, and put the wall on cooldown.\n\nFelt fantastic dying a second later.","replies":[]},{"poster":"FatedSaviour","date":"2018-04-07T04:32:37.117+0000","up_votes":2,"down_votes":0,"body":"have you ever tried to go through a wall as kayn and your forced into a bard portal for no reason, this is an irrelevant topic, but its annoying af, i want to go through the wall, not through the portal","replies":[]}]},{"poster":"HeazonZ","date":"2018-04-06T15:03:12.428+0000","up_votes":18,"down_votes":0,"body":"rek’sai has a similar bug where she gets stuck on terrain even though she creates a tunnel through it.","replies":[{"poster":"RekSai Main","date":"2018-04-06T20:54:27.165+0000","up_votes":4,"down_votes":0,"body":"Yea and they've yet to fix it. I still have clips of it from over 2 years ago","replies":[]}]},{"poster":"Fegone","date":"2018-04-06T14:39:11.550+0000","up_votes":12,"down_votes":0,"body":"yes. especially on towers. I can reproduce that on towers 100% of the time.... annoying af","replies":[]},{"poster":"Samflash3","date":"2018-04-06T15:45:25.559+0000","up_votes":9,"down_votes":0,"body":"This is unacceptable...\nWhy did you end the video there? I wanted to see the Talon get rekt'd. \n\n\n(Actually, that sucks. Needs to be fixed.)","replies":[]},{"poster":"Terozu","date":"2018-04-06T15:30:31.343+0000","up_votes":1,"down_votes":23,"body":"Is this a joke?  You jumped over the tower and expected to go to the X?","replies":[{"poster":"Pierce The Veal","date":"2018-04-06T16:07:37.271+0000","up_votes":12,"down_votes":0,"body":"> [{quoted}](name=Terozu,realm=NA,application-id=3ErqAdtq,discussion-id=YRvUI30o,comment-id=0003,timestamp=2018-04-06T15:30:31.343+0000)\n>\n> Is this a joke?  You jumped over the tower and expected to go to the X?\n\nNo, the idea is he should have ended up on the side of the turret closest to X, but instead it leaped him perpendicular to the direction he wanted/needed to go.","replies":[{"poster":"Terozu","date":"2018-04-06T17:26:28.118+0000","up_votes":1,"down_votes":14,"body":"But he leaped over the turret.  Its a circle.  You wil always jump over it in a straight line.  I don't think this is even a bug.","replies":[{"poster":"nm1010","date":"2018-04-06T18:47:11.536+0000","up_votes":3,"down_votes":0,"body":">  You wil always jump over it in a straight line\n\nThat is the problem, Talon doesn't jump over it in a straight line. You notice how the arrow points towards the X? Talon doesn't land near the X, Talon lands randomly in a different spot instead of going straight over the tower.","replies":[{"poster":"Eeyore","date":"2018-04-07T13:12:34.316+0000","up_votes":6,"down_votes":0,"body":"I don't think he realizes that the two images are not before and after, but two instances of after.","replies":[]}]}]}]}]},{"poster":"Marothennan","date":"2018-04-06T18:51:01.744+0000","up_votes":5,"down_votes":0,"body":"At first I thought it was just gonna go to the left or something but... that's honestly the stupidest shit I've ever seen. How does such a bug even occur?","replies":[{"poster":"Midlane Kayra","date":"2018-04-07T07:45:59.010+0000","up_votes":3,"down_votes":0,"body":"I played 300 matches last year, and 400 this year as a Talon OTP (Including my smurfs) and this shit happens every single game (3-4 times per game), sometimes it just backflips. Oh dear god if you're going to jump over turrets you're fucked because it'll %75 do a backflip.","replies":[]}]},{"poster":"ChaddyFantome","date":"2018-04-07T17:08:08.122+0000","up_votes":4,"down_votes":0,"body":"Talon main here. Been playing talon since season 3 and i have mastery 7 on him.\n\nThis is a very well known bug that ppl have been telling Riot about for years now.\nWhile we are at it, can we fix ALL of talon's bugs, like the Q range buff and his auto timer glitch bug?\nOr my favourite which is the no stealth on ulti bug.","replies":[]},{"poster":"Midlane Kayra","date":"2018-04-07T07:52:46.964+0000","up_votes":4,"down_votes":0,"body":"I was ranked #3 Talon in the world before switching servers so let me explain how the E bug occurs;\n\nIf your mouse is showing the right direction but its on HUD you're fucked.\nIf you're trying to jump over turrets you're fucked.\nIf your mouse is on right spot but too close to wall you're fucked.\nIf you press E and your character isn't close enough to wall you're fucked.\nIf you dont position your character well enough then you're fucked.\nIf you press E you're fucked.\nIf you play Talon you're fucked.\n\n\nMainly it causes because of terrain hitboxes, they're square-ish, so when you try to jump over edges \"great pathing system\" detects \"A shorter and better way\" and goes there instead of the place you're trying to go.\n\n\nBUT THERE IS ANOTHER BUG WHICH DOESN'T GIVE A SHIT ABOUT TERRAIN HITBOXES, TALON JUST DOES A BACKFLIP AND GOES BACK. Oh god i hate myselft and talon.","replies":[]},{"poster":"Alex h8721","date":"2018-04-06T21:00:13.064+0000","up_votes":4,"down_votes":0,"body":"Im mastery 7 on talon and yeah this shit is brutal, although my absolute favorite is when you just bouce off the wall and are sitting in the exact same spot w/ your dick in your hand like well guess ill just die now.\n\nHis E is highly un-reliable, and on an assassin that can explode in the duration of 1 CC that feels crappy.  Zed's mobility w/ shadows (even though it requires setup) is way more reliable and even though it \"requires more mechanical skill\" it feels a lot better than talon's buggy E.","replies":[]},{"poster":"GhaelWinds","date":"2018-04-06T15:28:54.652+0000","up_votes":2,"down_votes":6,"body":"You can work around it and sometimes it even helps you that it works weird like that. just gotta know how to specifically jump over some of the walls. Adds more skill ceiling to the champ if you ask me.","replies":[{"poster":"nm1010","date":"2018-04-06T17:58:45.269+0000","up_votes":4,"down_votes":0,"body":"? \n\nI can literally stand next to a tower in the same spot and make the jump ten times, yet fail randomly the eleventh time.","replies":[{"poster":"Slythrin Umbreon","date":"2018-04-06T19:59:33.432+0000","up_votes":4,"down_votes":0,"body":"Just count how many times you jump, Kappa.\n{{sticker:katarina-love}}","replies":[]}]},{"poster":"HarrisonOwns","date":"2018-04-06T21:52:57.483+0000","up_votes":5,"down_votes":0,"body":"\"You have to learn how buggy it is to be good, that's healthy and makes it a higher skill ceiling!\" -herpaderp","replies":[{"poster":"GhaelWinds","date":"2018-04-07T00:48:31.900+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=HarrisonOwns,realm=NA,application-id=3ErqAdtq,discussion-id=YRvUI30o,comment-id=00020001,timestamp=2018-04-06T21:52:57.483+0000)\n>\n> &quot;You have to learn how buggy it is to be good, that&#x27;s healthy and makes it a higher skill ceiling!&quot; -herpaderp\n\nAnimation cancelling is exactly that and has become a staple for high skill play. Sometimes bugs can become features if they work well enough. in the case of talon I feel it deserves that title since it can be used in your favour if you know how it works.","replies":[{"poster":"Wimbledofy","date":"2018-04-12T20:55:59.337+0000","up_votes":1,"down_votes":0,"body":"except there's no real way to know how it works.","replies":[]}]}]}]},{"poster":"AmazoX","date":"2018-04-06T15:54:27.184+0000","up_votes":4,"down_votes":0,"body":"This bug's a pain in the ass.","replies":[]},{"poster":"Madsin25","date":"2018-04-06T16:44:06.214+0000","up_votes":7,"down_votes":3,"body":"Or rito can just revert the rework and give us back the fun talon we used to have.","replies":[]},{"poster":"aZ3R0n","date":"2018-04-06T22:59:06.796+0000","up_votes":3,"down_votes":0,"body":"And here I was thinking I was doing something wrong or was just bad with Talon even though I have level 7 mastery. I've literally junped in place or have otherwise landed on the same side of certain terrain which has wasted time, caused my death, or made me miss a kill or team fight.","replies":[]},{"poster":"BroLane","date":"2018-04-06T21:04:37.922+0000","up_votes":3,"down_votes":0,"body":"This. THIS THIS THIS THIS. This shit turns easily winnable games into quick losses because of how easily you can screw it up It's not a \"mechanic\", It's a goddamned bug and needs to be fixed. I play Talon a lot, and I wouldn't mind seeing small nerfs if this bug was fixed.\n\nEDIT: Post this to Report a Bug as well.","replies":[]},{"poster":"Ifneth","date":"2018-04-06T19:45:41.592+0000","up_votes":3,"down_votes":0,"body":"Wow.  That is one nasty bug.","replies":[]},{"poster":"Risen29","date":"2018-04-06T17:07:49.979+0000","up_votes":2,"down_votes":1,"body":"I learned recently that the E depends on where your cursor is pointing. \nSo make sure your cursor is placed over the wall you want to jump when you press E, not on the wall. \n\nI am curious if doing this ensures these issues go away.","replies":[{"poster":"nm1010","date":"2018-04-06T17:56:48.855+0000","up_votes":3,"down_votes":0,"body":"I've heard this plenty of times, that is why I specifically gave the pictures with examples of the mouse being far past the tower and it still happening.","replies":[{"poster":"Automated Riven","date":"2018-04-06T20:08:33.157+0000","up_votes":1,"down_votes":0,"body":"Try actually hovering the far side of the wall. That's what I do and I rarely get this bug. There is a similar one with riven's Q3 where if you hover an enemy you won't go over the wall.","replies":[]}]}]},{"poster":"YoungFarmer","date":"2018-04-06T21:26:37.423+0000","up_votes":4,"down_votes":1,"body":"I mean this in the nicest way possible. But I fucking hate talons new E, as someone who loves talon I'd rather have the old one back. His new E doesn't work half the time, or its super delayed, or you jump the wrong direction. \n\nHis old E did practically the same thing as his new one, without needing a wall. Like I could ward over a wall and hide on the other side of it and cheese an enemy squishy with his old E just as easy as his new E. I wish they would revert it. Would make him a way better champion.","replies":[]},{"poster":"Khristophoros","date":"2018-04-12T19:02:32.292+0000","up_votes":1,"down_votes":0,"body":"Just messing with it in the practice tool. You have to have your mouse in the right spot. It's very easy to control when you don't use quickcast. The thing is Talon will go in the direction towards where you target the ability. If you don't target in the direction you want to go, you won't go in that direction.\n\nMaybe you guys should try turning off quick cast for talon's E.","replies":[{"poster":"nm1010","date":"2018-04-12T19:41:47.789+0000","up_votes":2,"down_votes":0,"body":"I use quick cast with indicators, not that not quickcasting should change it being a bug.\n\n> The thing is Talon will go in the direction towards where you target the ability. If you don't target in the direction you want to go, you won't go in that direction.\n\nThat is the problem, he doesn't. Note the pictures showing where I clicked and where I ended up. Someone else mentioned keeping the mouse cursor close to the wall, another said keep it far away from the wall to not get the bug to happen. I think these are placebo solutions personally as I can replicate it with both methods. Regardless there is definitely a bug here.","replies":[{"poster":"Khristophoros","date":"2018-04-12T19:44:24.001+0000","up_votes":1,"down_votes":0,"body":"When I test it, it's consistent. I have to target in the direction I want to go and it works. You should show some video of you doing it. The screenshots aren't very helpful if somebody wants to try and replicate the bug.","replies":[{"poster":"nm1010","date":"2018-04-13T11:52:00.247+0000","up_votes":1,"down_votes":0,"body":"I mean trying to replicate it off a video isn't really consistent, after I recorded this I tried to replicate that last one 10 times. Didn't matter how close I got it, I made it over that wall 10 times in a row with fairly similar positioning. Same thing for towers, I just jumped 20-30 while recording and made all my jumps. The first (and only one) I tried to jump when I went back in to test that last spot I failed.\n\nhttps://www.youtube.com/watch?v=4uzvtO6O2MA\n\nhttps://i.gyazo.com/340bdec5992da554c78cecfedb96ba46.png","replies":[{"poster":"Khristophoros","date":"2018-04-13T17:56:58.465+0000","up_votes":1,"down_votes":0,"body":"Yeah I see some of those look bogus. I feel like there is a distance limit and it basically works like blinks.","replies":[]}]},{"poster":"nm1010","date":"2018-04-12T19:46:07.291+0000","up_votes":1,"down_votes":0,"body":"Sure, I'm going to dinner now but later I can post a video.","replies":[]}]}]}]},{"poster":"MorganFreemanBot","date":"2018-04-06T20:40:54.878+0000","up_votes":2,"down_votes":0,"body":"I'm not a very good talon.\n\nThere was a time, perhaps 6ish months ago, when I decided to start playing mid and putting effort into becoming a decent one.\n\nThis bug singlehandedly made me stop. It would occur multiple times almost every single game, and I counted myself 'lucky' when it only happened once.\n\nAs OP highlighted, the common problem areas seem to be dragon pit, krug pit, raptor pit, and the thick mid walls.","replies":[]},{"poster":"iPooUnicorns","date":"2018-04-06T16:56:12.502+0000","up_votes":2,"down_votes":0,"body":"I've run into this bug before, it's really infuriating. Honestly Talon should just get a new E, currently it's a bad version of Kayn's E.","replies":[]},{"poster":"Ready 2 B Blamed","date":"2018-04-12T19:54:57.089+0000","up_votes":1,"down_votes":0,"body":"No, it's stupid and unreliable.","replies":[]},{"poster":"Imgartn","date":"2018-04-07T13:08:47.828+0000","up_votes":1,"down_votes":0,"body":"What's the problem?\nLooks like he slipped on the edge and fell down again.","replies":[]},{"poster":"Summonah12369","date":"2018-04-07T09:16:59.876+0000","up_votes":1,"down_votes":0,"body":"Lmao.","replies":[]}]}