{"poster":"DemiGorx","date":"2017-05-22T15:27:03.303+0000","title":"cool 2 week ban","subforum":"Player Behavior","up_votes":1,"down_votes":18,"body":"Cause my renekton talked shit the entire game and i stood up against him,.,. GG rito.. Guess i will be uninstalling your game seeing he prob went unpunished,,,,, w/e i am so done with the way you guys treat players sometimes...","replies":[{"poster":"Deep Terror Nami","date":"2017-05-22T15:32:31.554+0000","up_votes":10,"down_votes":0,"body":"Retaliation is not an acceptable reason to get toxic to other players; all that does is make the problem worse, and the other players now have to deal with another toxic player when they are just trying to play the game.\n\nYou don't need to \"stand up for yourself\", it doesn't improve the situation and they don't really care or they might be *wanting* to get that reaction from you. The only defense against toxic chat is Muting them. You can find the chat and ping mute buttons on the Scoreboard (default Tab) next to the individual's name. Chat muting prevents you from seeing their chat any longer so that you can focus on the game.\n\nAt the end of the match, simply report them for their behavior so that Riot can review their behavior and punish them appropriately.","replies":[]},{"poster":"Riot Tantram","date":"2017-05-22T21:15:32.260+0000","up_votes":9,"down_votes":0,"body":"> Cause my renekton talked shit the entire game and i stood up against him\n\nThe more severe of the games given in your reform card didn't have a Renekton in there at all. You were getting mad at someone for playing an 'ez mode champion'. Your penalty has nothing to do with other people, and is entirely related to your own behavior.\n\n>  w/e i am so done with the way you guys treat players sometimes...\n\nYou were harassing players. If people harassed you, they would be subject to the same treatment.","replies":[]},{"poster":"Starcraft243ver","date":"2017-05-22T15:31:54.689+0000","up_votes":3,"down_votes":0,"body":"> GG rito.. Guess i will be uninstalling your game seeing he prob went unpunished\n\nThat's actually quite surprising you got the message riot tried to send you :\n\n\"GTFO of our game, we dont want people like you\".","replies":[{"poster":"DemiGorx","date":"2017-05-22T15:33:36.846+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=Starcraft243ver,realm=EUW,application-id=ZGEFLEUQ,discussion-id=EoVWmqjo,comment-id=0001,timestamp=2017-05-22T15:31:54.689+0000)\n>\n> That&#x27;s actually quite surprising you got the message riot tried to send you :\n> \n> &quot;GTFO of our game, we dont want people like you&quot;.\n\nbut yet trolls like you get on here and instigate even more.. I have alot of postive feedback from games as well.... Just lost it in one game and BAM!@","replies":[{"poster":"Kei143","date":"2017-05-22T15:40:01.024+0000","up_votes":2,"down_votes":2,"body":"well, if this was your first punishment, then learn that hate speech such as calling people %%gs and n%%%%rs is not acceptable anywhere.","replies":[{"poster":"Deep Terror Nami","date":"2017-05-22T15:53:12.950+0000","up_votes":6,"down_votes":0,"body":"Can't you just say \"homophobic and racial slurs\"?","replies":[]}]}]}]},{"poster":"Scary Door","date":"2017-05-22T15:30:18.390+0000","up_votes":6,"down_votes":1,"body":"Why do people feel like they have to \"stand up for themselves\" on the internet?  Big deal, he called you names or said something about your mother... why does that matter?  He was doing it to get under your skin and it worked!  \n\nSo much so that you obviously retaliated in an extremely negative manner in order to get a two week ban.  Why are people so easily tilted over a game?","replies":[{"poster":"DemiGorx","date":"2017-05-22T15:31:59.290+0000","up_votes":2,"down_votes":2,"body":"i admit i did not react right.. sadly.. but its frustrating when peopel act like that adn get a whole team to report you for something you were not actually doing (feeding)","replies":[{"poster":"Redomic","date":"2017-05-22T15:42:10.581+0000","up_votes":2,"down_votes":2,"body":"Uh, i don't see why the downvotes? He clearly talked shit and never got banned for it, but for some reason DemiGorx did.","replies":[{"poster":"Deep Terror Nami","date":"2017-05-22T15:52:01.034+0000","up_votes":6,"down_votes":0,"body":"Punishments are based on **severity** and **frequency**. If *Player A* and *B* do the same thing and only *Player A* is punished, chances are it's because *Player A* has a long history of negative behavior while *Player B* does not.","replies":[]}]}]}]},{"poster":"Kei143","date":"2017-05-22T15:38:32.849+0000","up_votes":4,"down_votes":0,"body":"* There's no such thing as a 24-hour ban\n* Counter-attack is not defending yourself\n* Multiple reports don't trigger punishments faster. Infact, it is treated the same way as 1 report.\n* If you are toxic enough, Riot does indeed want you out of the game. But hey! At least you have time to reform right now.","replies":[]},{"poster":"This Is Your Dad","date":"2017-05-22T21:06:27.079+0000","up_votes":2,"down_votes":0,"body":"You didn't stand up to him. You played right into his grubby little hands. Doesn't matter if what he said was a croc of bull. Get it? Croc? Haha. \nWhen Renekton goes to the hospital for being too salty, he's called Gator-Aid.","replies":[]},{"poster":"Mizuki Zahra","date":"2017-05-22T16:22:09.618+0000","up_votes":2,"down_votes":0,"body":"soo if your house is on fire your going to throw gasoline on it to put it out? cause that's what responding to ragers does. why not just mute? like how weak must you be to allow mere words affect you enough to have to respond? riot isn't the problem its your self-discipline and lack of control. don't give people the satisfaction of allowing their rage and trolliness affect you and you wont be banned. every game has a report system, so use it and allow the system to take care of it. \n\nthis applies to life in general, if someone pushes you in a mall you have 2 options \n\n1. beat them till you get arrested for assault\n\n2. call security and have them deal with it","replies":[]}]}