{"poster":"Penta Penguin","date":"2015-05-17T06:28:41.989+0000","title":"Victory is Toxic?  Read to find out!","subforum":"Gameplay","up_votes":8,"down_votes":3,"body":"The downfall of competitive gaming on the consumer / casual level is actually, strangely, reward.  Even in high-level play, we have examples of prizes and cash rewards leading to collusion between the top players, throwing grand final matches and agreeing to split the pot.\r\n\r\nBut when it comes to the casual level, or the consumer-ranked level, the problem is exasperated. Not because people are colluding, but because victory rewards create a certain effect on human beings.  The positive reinforcement of &quot;points&quot; at victory, and &quot;less points&quot; or &quot;no points&quot; at loss, lead people to associate more importance on that reward rather than the experience itself, as the greater game beyond the game itself, is filling up your points.\r\n\r\nIn the classic history of competitive gaming, there are games like Super Street Fighter 2, Smash Bros Melee, Quake, Counter-Strike, etc.  Super Street Fighter 2 is relatively ancient in the young history of gaming, especially competitive gaming.  But it&#039;s community is still alive and kicking.  It&#039;s still claiming spots at major gaming tournaments in recent years.  From the greasy arcade machines of decades past, to an online experience on  your PC or console, Street Fighter 2 is thoroughly enjoyed, rich with competitive spirit, and a spicy but healthy dose of trash-talk and attitude among the player-base.\r\n\r\nWhen you kick someone&#039;s ass; knock off someone&#039;s final stock; go on a frag spree; nail that twitch AWP shot; the thrill is in the experience of doing well.  If you do well, but then do poorly in the next match, it&#039;s okay if not a little salty, it&#039;s just an experience to learn from.  But when those point numbers come up in games like League of Legends, it&#039;s either an artbitrary psychological &quot;steroid&quot; that steals from the thrill of the victory itself, or it&#039;s more salt into your wounds.\r\n\r\nSome of these young kids who might have been playing a game like Counter Strike 1.6 10 years ago, now they&#039;re playing League, but where 1.6 was a wonderland of competition and learning, League is sort of a gauntlet of desperate victory and painful failure that obviously is wearing down young gamers who might have flourished if the game was not so &quot;mean&quot;.  The abstract victory rewards create much more value in victory, placing a deterrant on failure and hindering a person - any person&#039;s - ability to learn something from a failure state.\r\n\r\n&quot;gg faggots feeding Fiora akali is 20/0/3 gg surrender at 20&quot;\r\n\r\nWe all put up with this on a daily basis.  Weaker willed people are pushed into toxic behavior patterns because playing out a failure state is a &quot;waste of time&quot; - it can be the painful and slow loss you know is coming, or a chaotically fast turn of events, a baron throw, somebody&#039;s caught out, and suddenly you&#039;re nexus towers are going down.\r\n\r\nI admire Riot&#039;s intention with the Ranked system, but in all honestly it&#039;s not something that was particularly missing from those old games.  The community itself just took care of it, with specialized websites for leagues and tournament standings.  These sites were occupied by dedicated players.\r\n\r\nI feel like ti&#039;s also worth mentioning that League of Legends is pretty much the pioneer of mainstream eSports.  The face of highly-competitive gaming is open to everyone, including a very casual audience, with the unreachable LCS level looming over them in extravagant and well funded, web-streamed events, while they strive to prove they&#039;re not a &quot;bronze baddie&quot;.  But all in all, it&#039;s a trap and unnecessary frills on a game that could have been a truly glorious casual experience, if not for the retarded systems in place that breed toxicity in the target audience - young and casual players.\r\n\r\nThe LCS is not a scene by dedicated competitors, for dedicated competitors.  It&#039;s primarily just a show, backed by a lot of money and sponsors, to promote an image for League of Legends and Riot Games.  This is why League is the pioneer of /mainstream/ eSports.  \r\n\r\nStarcraft II may have stapled down the respect of eSports in general, but I don&#039;t know many 40+ year old women who care about Starcraft.  But you tend to meet a lot of ordinary people who seem out of place in a video game audience on League.  It&#039;s pretty much like American Baseball or Football, and all of the imagery and self-promotion that comes with that, and all of the confused people sitting in front of their TV.  I know people who don&#039;t know the first thing about stuff like Jungling or solo lanes, but they&#039;ll play hours every day as support and watch LCS games, and that&#039;s their entertainment in life.\r\n\r\nIt&#039;s a real shame that Riot had to sell up their game, and destroy any hope it has of being a long-lasting competitive game with a strong and respectable community.  I can&#039;t say for certain that League won&#039;t last a long time, but if it does, I seriously don&#039;t think it&#039;ll be because people enjoy experiencing an average of 1-2 toxic assholes per match.","replies":[{"poster":"Phero","date":"2015-05-17T07:05:17.970+0000","up_votes":6,"down_votes":1,"body":"Riot created the toxic environment, players are just responding to it. \n\nA random AFK can ruin an hour long match for 9 other players with next to no repercussions involved. Premades can troll games 24/7 and not risk a thing as long as they don't say a bad word in chat. If your MMR is \"neutral\" you can have played 3000+ games and still get matched with players who just got to level 30 because Riot doesn't factor in experience at all. You can get chat banned for owning the enemy team without ever using all chat. \n\nThere's no limitation on just creating a new free account if you get banned. \n\nThat's not even mentioning such things as the terrible grind for newcomers, the up and down waves of horribly imbalanced champs and items, the smurfs or the bugs. \n\nOn top of that there are 5 spots on a team and in the current meta you need a jungler and a support, if you've ever played team builder you'll know that NO ONE wants to play those roles and most of those that do, suck at them. \n\nOf the above problems, Riot has taken great strides to fix around 0 of them for about 4 years now.","replies":[{"poster":"macromite","date":"2015-05-17T08:33:48.452+0000","up_votes":2,"down_votes":1,"body":"lets just have hope for that tribunal.","replies":[{"poster":"Phero","date":"2015-05-17T08:37:42.853+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=macromite,realm=NA,application-id=3ErqAdtq,discussion-id=5ZZHv6Zh,comment-id=00000000,timestamp=2015-05-17T08:33:48.452+0000)\n>\n> lets just have hope for that tribunal.\n\nIt won't do shit, it's a bad attempt at solving a problem Riot themselves created. They're not as smart as they think they are, well either that or this is a social experiment that they're selling.","replies":[{"poster":"macromite","date":"2015-05-17T08:45:41.744+0000","up_votes":1,"down_votes":0,"body":"I personally have always thought of this as a social experiment, and they keep adding interesting variables. even just telling us that the tribunal will return one day is a great one, and I for one would be fine with it never returning at this point, it has so much hype it needs to live up to, that no matter how good it is, it will never meet expectation.\n\nRegardless, Have hope for that tribunal, it'll take your mind off the toxicity a little.","replies":[{"poster":"Penta Penguin","date":"2015-05-17T20:00:52.056+0000","up_votes":1,"down_votes":0,"body":"Riot does have psychologists and sociologists on their team, and it's their job to do stuff like this.","replies":[]}]}]}]},{"poster":"The Fat Punisher","date":"2015-05-17T11:52:51.813+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Phero,realm=EUW,application-id=3ErqAdtq,discussion-id=5ZZHv6Zh,comment-id=0000,timestamp=2015-05-17T07:05:17.970+0000)\n>\n> Riot created the toxic environment, players are just responding to it. \n> \n> A random AFK can ruin an hour long match for 9 other players with next to no repercussions involved. Premades can troll games 24/7 and not risk a thing as long as they don't say a bad word in chat. If your MMR is \"neutral\" you can have played 3000+ games and still get matched with players who just got to level 30 because Riot doesn't factor in experience at all. You can get chat banned for owning the enemy team without ever using all chat. \n> \n> There's no limitation on just creating a new free account if you get banned. \n> \n> That's not even mentioning such things as the terrible grind for newcomers, the up and down waves of horribly imbalanced champs and items, the smurfs or the bugs. \n> \n> On top of that there are 5 spots on a team and in the current meta you need a jungler and a support, if you've ever played team builder you'll know that NO ONE wants to play those roles and most of those that do, suck at them. \n> \n> Of the above problems, Riot has taken great strides to fix around 0 of them for about 4 years now.\n\n\"Of the above problems, Riot has taken great strides to fix around 0 of them for about 4 years now.\"\n\nlol","replies":[]}]},{"poster":"Phero","date":"2015-05-17T10:46:53.559+0000","up_votes":4,"down_votes":0,"body":"A TON of these problems would go away if Riot didn't match beginners with people who played for 4 years. They need to take experience into account when matching people. If someone had 300 games with champion X and still suck with him, that's his problem, not Riots. \n\nAlso, build the fucking Teambuilder for ranked, no one want's to call their lane and have that argument with retards.","replies":[]},{"poster":"GamerGoodies","date":"2015-05-17T08:14:46.996+0000","up_votes":2,"down_votes":3,"body":"So are you suggesting that losers should get benefits as well? I don't know man I think that would be a big fat middle finger to me. IT's be like \"hey sorry you lost so many games! Here's something that should help. Sorry that you suck!\" \n\nFrankly people get toxic cause that's just how people are. There is always an asshole in a game community no matter where you go, win or lose. I think a gaming community is best is that if people want to win more games to get more benefits they have to do better. If people are going to be toxic about it they'll sooner or later realize that they won't win much out of it. League already is doing things to help prevent less toxic players with mystery skin rewards by not getting any bad checks from the tribunal\n\nSo I don't think having more defeat benefits is needed.","replies":[{"poster":"Penta Penguin","date":"2015-05-17T09:15:03.995+0000","up_votes":1,"down_votes":4,"body":"No... I say nobody gets anything.  Win or lose it's about the match and not what you're going to get after the match.","replies":[{"poster":"ZephyrDrake","date":"2015-05-17T09:19:06.179+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=aliceandsven,realm=NA,application-id=3ErqAdtq,discussion-id=5ZZHv6Zh,comment-id=00010000,timestamp=2015-05-17T09:15:03.995+0000)\n>\n> No... I say nobody gets anything.  Win or lose it's about the match and not what you're going to get after the match.\n\nok, then watch as the game dies even faster. If players don't feel rewarded they will just move on to the next game since this one doesn't give them anything","replies":[{"poster":"Nilok","date":"2015-05-17T09:37:22.420+0000","up_votes":2,"down_votes":0,"body":"That could also apply to a Skinner Box.\n\nThe OP is trying to make the argument that gaming for the fun of gaming will help players improve more while becoming less toxic, while Skinner Box tricks like limited IP, ranked LP, or the new heavily skewed Mastery Points for winning than losing, even if you performed the exact same, cause people to become more toxic if a game is going poorly.\n\nI don't entirely agree since this kind of toxicity existed in Defense of the Ancients: All Stars back in the days of Warcraft 3 against new players, but could be exasperating the toxicity.\n\nI feel it the core of the problem is more likely due to many people investing themselves into both the character and game, and how much time a match can involve, that when they lose or get crushed by mismatched team composition they become extremely frustrated and lash out at everyone as a defense mechanism, along with the people trying to induce it intentionally for their own enjoyment (trolls).\n\nPerhaps if Riot implemented a singleplayer mode where a player can play at their own pace without any other players on the enemy or their own team, it could give a place where they can unwind and not worry about other players and just enjoy a power fantasy. Even in Co-op vs AI, a player who just wants to win can effectively ruin a game for a person who just wants to putz around with their favorite champion, which is why I don't think Co-op vs AI is enough to address this.\n\nThis would be quite a long shot, but perhaps something like the Warcraft 3: The Frozen Throne's Horde RPG campaign would be a great way to enjoy the game and champions without forcing you into a competitive environment. The problem with this idea is that it would take quite a bit of work from Riot to design the map and quests for the player to do. The up sides for development is that aside from bug testing, there would no need for balance changes for this mode, or item modification and additions, and text/dialog could be generic enough for any champion to be used, which would reduce development overhead.\n\nExplaining about Skinner Boxes:\nhttp://www.gamasutra.com/view/feature/131494/behavioral_game_design.php","replies":[{"poster":"ZephyrDrake","date":"2015-05-17T09:46:43.679+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nilok,realm=NA,application-id=3ErqAdtq,discussion-id=5ZZHv6Zh,comment-id=0001000000000000,timestamp=2015-05-17T09:37:22.420+0000)\n>\n> That could also apply to a Skinner Box.\n> The OP is trying to make the argument that gaming for the fun of gaming will help players improve more while becoming less toxic, while Skinner Box tricks like limited IP, ranked LP, or the new heavily skewed Mastery Points for winning than losing, even if you performed the exact same, cause people to become more toxic if a game is going poorly.\n> \n> I don't entirely agree since this kind of toxicity existed on Defense of the Ancients: All Stars back in the days of Warcraft 3 against new players, but could be exasperating the toxicity.\n> \n> I feel it the core of the problem is more likely due to many people investing themselves into both the character and game that when they lose or get crushed by mismatched team composition, they become extremely frustrated and lash out at everyone as a defense mechanism and people trying to induce it (trolls).\n> \n> Perhaps if Riot implemented a singleplayer mode where a player can play at their own pace without any other players on the enemy or their own team, it could give a place where they can unwind and not worry about other players. Even in Co-op vs AI, a player who just wants to win can effectively ruin a game for a person who just wants to putz around with their favorite champion, which is why I don't think Co-op vs AI is enough to address this.A Custom game may be able to do this, but knowing that this is what you need to do to \n> \n> http://www.gamasutra.com/view/feature/131494/behavioral_game_design.php\n\ni don't care about his argument since it's flawed. Every game even single player games need to reward the player in some way shape or form and he literally wants a game that doesn't reward you at all. That is just going to make the game fail massively, specially an online game. People can always go to custom games if they want to just mess around with whatever champion and adding a single player at this point in time is going to take forever just not be worth at all. People being competitive is something that is not just for video games or sports in general even something as dumb as playing cards with someone else can bring out the competitive side of people since no one likes losing. The core of the problem is people being people and you cannot change that, no one likes to feel that they are wasting their time or losing just like they don't like to feel that it's pointless to do something.","replies":[{"poster":"Nilok","date":"2015-05-17T10:00:32.376+0000","up_votes":3,"down_votes":0,"body":"He isn't saying that the game shouldn't be rewarding, but to redesign the game to be less focused on Skinner Box style rewards.\n\nEvery singleplayer game is rewarding in its own way, but the rewards themselves can be very different. The OP's example of older games that gave no or less numerical rewards, but instead, you created the reward based on your own actions in the game.\n\nConsider this, when you play Skyrim, do you play the game for the reward of points, or for the reward of say, slaying a dragon, or sneaking through a castle undetected?\nThe problem does arise that when someone tries to do these but fails, and is then also coupled with failure granting less numerical reward than victory and the time investment to start again, it exasperates it. Mark of the Ninja is great in how it uses very little time to get back into the game after you die so you can try it again a different way, it helps prevent you from getting frustrated at it.\n\nYes, it is the psychology of people, it is also a game designer's job to try and insure that they _manipulate_ people well. They do this in story, sound, visual, gameplay, and reward. A great game designer can do this to help people be less toxic instead of relying on manipulating them to keep playing the game at the cost of toxicity. This is a prime example why people are so frustrated at Riot for focusing Champion Mastery too much on winning a game.\n\nIt may be that the time investment for a game of League of Legends is simply too long to unwind and relax as some people need.","replies":[]}]}]},{"poster":"Penta Penguin","date":"2015-05-17T19:50:43.525+0000","up_votes":2,"down_votes":1,"body":"Well then unfortunately, that would just be a fact of the game.  There are many games that have no rewards or point systems and as I said, are still actively played even after a decade or even 20 years.  Outside of video games, the most ancient games in the world have no in-built ranks or points unless the communities surrounding them organized to test themselves in a league, Chess, Go, etc.\n\nIf people stop playing League because there are no more imaginary points... Then that's too bad.  But because League is not just a game and part of a huge business model and image, Riot will never let it become \"just a game\" in that sense.","replies":[{"poster":"ZephyrDrake","date":"2015-05-18T06:01:48.093+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=aliceandsven,realm=NA,application-id=3ErqAdtq,discussion-id=5ZZHv6Zh,comment-id=0001000000000001,timestamp=2015-05-17T19:50:43.525+0000)\n>\n> Well then unfortunately, that would just be a fact of the game.  There are many games that have no rewards or point systems and as I said, are still actively played even after a decade or even 20 years.  Outside of video games, the most ancient games in the world have no in-built ranks or points unless the communities surrounding them organized to test themselves in a league, Chess, Go, etc.\n> \n> If people stop playing League because there are no more imaginary points... Then that's too bad.  But because League is not just a game and part of a huge business model and image, Riot will never let it become \"just a game\" in that sense.\n\ncare to give examples of these so called games with no rewards?","replies":[{"poster":"Penta Penguin","date":"2015-05-18T09:20:19.032+0000","up_votes":1,"down_votes":0,"body":"In the OP, several","replies":[{"poster":"ZephyrDrake","date":"2015-05-18T09:50:28.984+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=aliceandsven,realm=NA,application-id=3ErqAdtq,discussion-id=5ZZHv6Zh,comment-id=000100000000000100000000,timestamp=2015-05-18T09:20:19.032+0000)\n>\n> In the OP, several\n\ni don't see any. All i see are games that have their own reward system. Fighting games are about beating your opponent, you can have friendly matches doesn't mean much when you take it to the next step and make it competitive. Same can be said about any of the first person shooters, you can have friendly matches, then you get to a competitive environment and all that goes down the drain. League is exactly the same, you can have your friendly matches with friends or with people that just want to have a fun time but then you have the competitive side. \n\nYou want matches that are going to take 20+ mins of your time each time to be imbalanced? or do you want them to be about even in skill? Please tell me how would you make the thousands of people who play this game at any given time to be matched with people of their respective skill? how would you match thousands of people without making them completely waste their time? until you figure that out, all you are going to accomplish by getting rid of any of the things you are pointing out is either the end of League or a massive increase in people being toxic because now you will have people from all skill ranges playing against each other causing such a massive imbalance that the game will cease to be even remotely fun. None of those games you mention have the player base that League has. Also how many of those games are ONLINE? where you can actually play with whoever you want at any given moment of the day with people who are relatively close to your skill? (there are exceptions obviously)","replies":[]}]}]}]}]},{"poster":"GamerGoodies","date":"2015-05-17T11:26:21.893+0000","up_votes":1,"down_votes":0,"body":"Yah if no one is getting anything out of a game it's going to die. \n\nEvery game has rewards in it by making achievement out of it. Removing that is like removing the sense of taste.","replies":[{"poster":"Penta Penguin","date":"2015-05-17T19:59:28.099+0000","up_votes":2,"down_votes":0,"body":"Except this isn't true.\n\nThe games I listed don't have \"achievements\" or rewards.  At the most they just tell the player \"You win\" or you have a small but flashy ceremony such as in Smash Bros, the character flies off the screen in an explosion and the game freezes to show your character.  There was nothing in-built in the game keeping people from leaving it.","replies":[{"poster":"GamerGoodies","date":"2015-05-18T23:05:07.331+0000","up_votes":1,"down_votes":0,"body":"Yah but. Super smash bro is all about fun and enjoyment with friends and family.\n\nThere's also a serious esports in it just like almost every other game if you paid attention to it, and in that community has quite a few toxic players in it as well.","replies":[]}]}]}]}]},{"poster":"Dreddeth","date":"2015-05-18T10:08:40.965+0000","up_votes":1,"down_votes":0,"body":"So you're saying the issue isn't the sense of achievement or a job well done inherent in the act of victory itself, but the quasi-material numbers and objects that are *grafted onto victory,* and which ultimately serve no purpose other than e-peen? The fact that \"Bronze\" is a slur here seems sufficient evidence to at least warrant investigation, so I'll admit my curiosity is aroused.","replies":[]},{"poster":"Sythriel Draken","date":"2015-05-18T06:55:20.163+0000","up_votes":1,"down_votes":0,"body":"I think the reason that players are so toxic in normals is that they can get away with it. For instance, someone has a bad game, goes off in an already toxic game (enemy team spamming, generally being assholes,etc) and a warning pops up. All those toxic players have to do, is play a couple more games til the warning falls off their account. \n\nConversely, nearly 85% of all the reports are false, yet, their automatic system doesn't register it as a false report( IE Reads the chat of the game, etc) and instead flags your account with the warning. The report system also doesn't check the post game chat where most of the more hideous remarks are said as to avoid the report system. \n\nThere also has been an increase in hacks such as Drophack (still around and still works as I was the victim of it 5 times today) that people are using IN NORMALS that are affecting server stability. Since it's really easy for people with multiple emails to make new accounts after the pitiful 2 week ban (from what I have read) all they have to do is register under a different email, and continue to use the hack and other client hacking software such as those that instantly give you any amount of RP that you ever want for free. \n\nI've also noticed a pattern that can also affect the psychology of games and whether they become toxic or not. If you are in one toxic game, you are bound to get into another one immediately after it unless you decide to sit on your client for 5-10 minutes.\n\nRiot also has an issue of matching 5 random players vs teams of 2-5 players. 5 of my in game friends qued up in a normal blind and we got matched up against 5 random people. I felt sorry for them and gave them all honors, but I have been in that situation. What riot needs to do is prioritize those that are grouped together in games and keep the solo/duo ques random. \n\nAlso, what would improve the toxic environment is if riot actually brought back incentives for positive play. Right now, there is no reason why you should remain a neutral or toxic player when being a good example gets you complete shit. The PBE is suppose to be the reward for being good, yet, that's so much of an elitist market that unless you're a streamer or in upper diamond/challenger, good luck trying to get in. I promote that riot bring back the random skin if you go say a month or two without a real report, and keep that in play as that will turn the toxicity around and probably get more neutral players to go towards the positive more.","replies":[]},{"poster":"LegendaryLemur","date":"2015-05-17T11:43:52.910+0000","up_votes":1,"down_votes":0,"body":"If i understand correctly, you are saying that the reward for playing should be the game itself.  But either that's a real reward, and people will be just as invested (and according to you, just as toxic) as if the reward were more external, or it's not a real reward and people will attach no significance to winning (which would result in toxic apathy).\n\nI don't think being motivated to win promotes toxicity.  I think ambition does.  Its a worldwide culture devoted to outdoing others that's the problem.  If you really want to root out toxicity, you have to root out capitalism.","replies":[{"poster":"Penta Penguin","date":"2015-05-17T19:36:49.666+0000","up_votes":1,"down_votes":0,"body":"The game itself is not a reward, rhetorically you could say that, but a reward (psychologically) is something you get after an activity.  Which reinforces things differently than if you perform well at the activity but are not judged or given something for it.","replies":[]}]}]}