{"poster":"Penta Penguin","date":"2016-02-21T01:30:48.301+0000","title":"Get Used to Imbalance, It's Here Forever","subforum":"Gameplay","up_votes":66,"down_votes":25,"body":"**EDIT: Read the whole post and not just the first sentence, seriously.  **\n\nI have no doubt in my mind that Riot is doing the best they humanly can to &#039;balance the game&#039;, and I hope by the end of this post you&#039;ll understand why, and I might inspire some empathy and appreciation for this endless cycle.\n\nI was a fan of a game called Guild Wars, made by Arena Net, and I followed it&#039;s updates for 10 years up until Arena Net finally left it behind for the sequel. They had actually given up with the core balancing of the game long before that, but a few bits of content trickled in in the later part of it&#039;s decade long run.\n\nThe problem with Guild Wars is that there was too much content to balance. There were 10 classes, each class has an 8-slot ability bar, with around 100~ abilities on every class that you can pick and choose as you please. So the game had just over 1,000 abilities that needed to be balanced. \n\nArenaNet admitted they could not handle this and decided to take what they&#039;d learned and create a more stream-lined sequel. Evidence of their failure still exist in the game, with certain abilities having been massively &quot;Olaf&#039;d&quot; because it was easier to make it terrible than to remove the ability outright, or put effort into finding a balanced state. Imagine if Playful Trickster now cost 300 Mana an dhad a 2 minute cool-down. Entire game-modes were removed - not because of a low play rate, but because Arena Net could not manage to balance them.\n\nNow look at League of Legends. A very rough estimate, 129 champions who each have at least 5 abilities (including their passive). At least 645 abilities in the game, not including items. Consider that the game continuously expands with a dozen new champions every year. Also, older content becomes reworked with more complex mechanics, and more &#039;balance levers&#039; are added. And don&#039;t forget the shifting perspectives and philosophies of Riot as time goes on. Every year Riot reports on the things they got wrong with their approach to the previous season!\n\nEven if new champions and items are halted right now, the game will never become balanced. A game like this is a huge undertaking and is well above the average development burden. Riot will be reworking and rebalancing existing content that is backed up for years to come if they don&#039;t give up like Arena Net.\n\nBut the new content is not going to stop any time soon, so you can forget about the game ever being balanced. Overall balance has improved over the years absolutely, but I&#039;m talking about the day-to-day, week-to-week, patch-to-patch &quot;Gut Fiora&quot;, &quot;Graves in every lane&quot; shit-posting. Those issues will never end, and acting like Riot is doing something wrong because something is busted in a patch is just ungrateful and frankly stupid.\n\nWith more &#039;balancing levers&#039; and shifting design principles, the game will overall improve but there will also be more opportunities for something to go wrong, as they bump a lever here and there accidentally while they were reaching for another one. I don&#039;t care how &quot;broken&quot; you think Yorick will be, as long as he&#039;s a better character than he is now and back on the Free Champ rotation as a legitimate piece of content. Poppy is back too. And people were crying about Fiora even before her rework. Maybe Sion is underpowered right now but do you want to go back to that shit that he used to be?\n\nRiot will never &#039;get it right&#039; unless you decide to set your standards to a more realistic level. The alternative is that Riot gives up and we no longer have LoL.","replies":[{"poster":"Zorasama","date":"2016-02-21T03:29:13.189+0000","up_votes":14,"down_votes":13,"body":"If they're really trying to balance their game, balance shouldn't get worse and worse.\nLook at the game right now.","replies":[{"poster":"Penta Penguin","date":"2016-02-21T04:02:18.924+0000","up_votes":29,"down_votes":4,"body":"The game has actually gotten far better and become more polished. Or do you want the league where Jax could 1v5 you in your Fountain, or where Syndra had 26~% win-rate? There's a closet full of embarrasing things in this game's history","replies":[{"poster":"Spoofghoul","date":"2016-02-21T14:00:18.644+0000","up_votes":2,"down_votes":6,"body":"really a 1v5 jax\n\ni guess not much has chnaged then just replace jax with bruiser fiora/yi and you got the same situation where a champion just 1v5 your team\n\nbalance is as bullshit as it was back in beta","replies":[{"poster":"Faustavian","date":"2016-02-21T15:27:59.809+0000","up_votes":13,"down_votes":1,"body":"In your fountain?","replies":[{"poster":"LankPants","date":"2016-02-21T15:32:25.192+0000","up_votes":5,"down_votes":0,"body":"[That was Sion](https://www.youtube.com/watch?v=NlI5ooG73fE)","replies":[{"poster":"HighH1","date":"2016-02-21T17:27:12.233+0000","up_votes":4,"down_votes":0,"body":"https://www.youtube.com/watch?v=gI1aeS5H1Vs","replies":[]}]}]}]},{"poster":"48983507DEL1","date":"2016-02-21T07:06:09.097+0000","up_votes":5,"down_votes":3,"body":"Okay to be fair, that was still in Beta, so they were still trying to figure out what they wanted the game's balance to be like.","replies":[{"poster":"elon wątroba","date":"2016-02-21T11:00:19.342+0000","up_votes":8,"down_votes":2,"body":"Syndra release was around 2-3 season.","replies":[{"poster":"HighH1","date":"2016-02-21T17:23:55.344+0000","up_votes":5,"down_votes":0,"body":"He was talking about RNGeus dodge chance Jax fountain diver being beta","replies":[]}]},{"poster":"Guy Fox Teemo","date":"2016-02-21T11:04:39.599+0000","up_votes":3,"down_votes":1,"body":"Uh no lol, that went on for awhile after beta.","replies":[]}]},{"poster":"HayRoss","date":"2016-02-21T14:21:34.183+0000","up_votes":1,"down_votes":0,"body":"When was Syndra's win rate at %26?","replies":[{"poster":"LankPants","date":"2016-02-21T15:03:37.182+0000","up_votes":4,"down_votes":0,"body":"On release. She was so bad that you were slightly more likely to win with an AFK than a Syndra.","replies":[{"poster":"Captain Aishi","date":"2016-02-21T15:16:18.470+0000","up_votes":1,"down_votes":0,"body":"PBE complained that Syndra was OP too...","replies":[{"poster":"LankPants","date":"2016-02-21T15:17:58.050+0000","up_votes":3,"down_votes":0,"body":"She was overloaded on the PBE, maybe not overpowered but certainly overloaded. Her W knockup at max rank was way too much to have on her kit.\n\nHer masses of bugs were probably a bigger problem on release than power anyway. I think she was probably the only champ to ever release with a spell that didn't work more often than it did.","replies":[{"poster":"Captain Aishi","date":"2016-02-21T16:08:23.460+0000","up_votes":4,"down_votes":0,"body":"until azir :P","replies":[{"poster":"LankPants","date":"2016-02-22T00:21:40.570+0000","up_votes":1,"down_votes":0,"body":"Syndra on release was legit actually worse than Azir.","replies":[{"poster":"Captain Aishi","date":"2016-02-22T00:36:38.884+0000","up_votes":1,"down_votes":0,"body":"as I recall, at least pressing Q would create a dark sphere where you pointed it to, whereas azir's release, when I pressed Q, the soldiers would dash somewhere else half the time, his E would just not cast half the time, the W would spawn soldiers in the wrong place half the time and his ult would just go through people without doing anything 90% of the time... dark times","replies":[{"poster":"Akali is SO HOT","date":"2016-02-22T04:11:42.055+0000","up_votes":1,"down_votes":0,"body":"Nothing can beat Syndra's 27% winrate on release","replies":[]}]}]}]}]}]}]}]},{"poster":"Vistha Kai","date":"2016-02-22T16:52:38.791+0000","up_votes":1,"down_votes":0,"body":"They indeed got a little bit better than the dark times of League, but it's a roller coaster now.\n\nFirst they buffed ADs, both with raw changes and with items. Then they nerfed AP items when APs were in a bad spot already. Then they gave those poor, underplayed and weak assassins an item with a mini-Zed ult.\n\nCompared to last two seasons, the game **IS** much more unbalanced.","replies":[]}]},{"poster":"48983507DEL1","date":"2016-02-21T03:44:31.316+0000","up_votes":10,"down_votes":1,"body":"It really hasn't been getting worse and worse, it just takes major dips. There are always giant WTF were they thinking??? stages of the meta, and there will continue to be those moments as long as Riot wants to experiment. But, it always comes back to a relatively balanced state. The fact that we got a RETURN of the tank meta proves that. Yes, it is frustrating that they got rid of it again, but it proves it will come around again.","replies":[{"poster":"Akali is SO HOT","date":"2016-02-21T06:59:30.608+0000","up_votes":6,"down_votes":12,"body":"Compared to Season 5 this season's balance has gotten exponentially worse.  Fiora has been broken since the end of Season 5 and Riot still hasn't done anything about it.  Same with GP and a lot of other champions.","replies":[{"poster":"48983507DEL1","date":"2016-02-21T07:08:36.021+0000","up_votes":2,"down_votes":2,"body":"Yea remember last season when Sejuani could 1v2 at level 6? Or Skarner having a 63% winrate at all divisions?","replies":[{"poster":"Akali is SO HOT","date":"2016-02-21T08:00:19.021+0000","up_votes":8,"down_votes":4,"body":"Skarner was gutted immediately and it took Riot a little longer to nerf Sej and all of the overpowered tanks but that doesn't even compare to Fiora, Lux, and Gangplank","replies":[{"poster":"Penta Penguin","date":"2016-02-21T10:16:33.283+0000","up_votes":5,"down_votes":2,"body":"Riot did it to skarner so what makes you think there is a conspiracy about Fiora Lux or GP?  GP is being nerfed non-stopped, Fiora is being nerfed, Lux is rising just recently","replies":[{"poster":"The Bíg Ticket","date":"2016-02-21T13:55:11.503+0000","up_votes":3,"down_votes":0,"body":"Lux is in the top 3 for win and pickrate in midlane since atleast half a year rofl.","replies":[]},{"poster":"Akali is SO HOT","date":"2016-02-21T19:47:33.255+0000","up_votes":2,"down_votes":1,"body":"Lux has had the top winrate in mid for like the last 3 months.  Fiora has love tap nerfs on PBE and is even getting compensation for them lol","replies":[]}]}]}]}]},{"poster":"Crossette","date":"2016-02-21T07:33:17.588+0000","up_votes":2,"down_votes":1,"body":"WTF were they thinking stages?\n\nI think you mean {{champion:104}} {{champion:133}} {{champion:122}} {{champion:86}} {{champion:114}}  since their reworks.","replies":[]}]}]},{"poster":"Dengeden","date":"2016-02-21T09:44:58.064+0000","up_votes":11,"down_votes":1,"body":"PvP games are inherently imbalanced ... it's either up to chance or up to which is the superior strategy. There's no alternative.","replies":[{"poster":"Birefringence","date":"2016-02-21T19:55:15.872+0000","up_votes":1,"down_votes":2,"body":"Replace strategy with champion and I agree.","replies":[{"poster":"Dengeden","date":"2016-02-22T04:10:55.896+0000","up_votes":1,"down_votes":1,"body":"Not doing that, sorry. In pro play MAYBE, during a Morde - GP patch.","replies":[{"poster":"Birefringence","date":"2016-02-22T22:05:47.940+0000","up_votes":1,"down_votes":0,"body":"It more or less happens that way regardless, the higher trending champions are a combination of strategy and numerical superiority. I suppose I would change my statement to replace chance.","replies":[{"poster":"Dengeden","date":"2016-02-23T02:03:40.121+0000","up_votes":1,"down_votes":0,"body":"That is true but plenty of LCS games are lost due to poor positioning. Ergo, they guessed the enemy's position wrong, so chance played its part.","replies":[{"poster":"Birefringence","date":"2016-02-23T03:42:39.467+0000","up_votes":1,"down_votes":0,"body":"Fair enough. My pessimism regarding the way some champions are kept under powered has jaded me somewhat.","replies":[{"poster":"Dengeden","date":"2016-02-23T06:30:52.377+0000","up_votes":1,"down_votes":0,"body":"As am I, although you gotta keep in mind that the slightest buff can turn into an abomination like Kog'maw.","replies":[]}]}]}]}]}]},{"poster":"A Miss Fortune","date":"2016-02-22T12:25:24.852+0000","up_votes":1,"down_votes":0,"body":"Almost all gaming companies basically trade the long-lasting enjoyability of the game for ways to introduce and have new players hooked on the game. Riot usually trades out balance and healthy kits for really fun, crazy kits in their champions for example. These kits not only are more fun to play (and therefore hook new players) but are also a lot more fun to watch.\n\nLee Sin is a good champion to use as an example. We all know he's an issue and even Riot admitted that he needed nerfs but couldn't be nerfed due to his huge fanbase. Imagine being a person who has never played League watching a game on Twitch. Would you be more interested in a game with 10 Amumus or 10 Lee Sins?\n\nThis happens with virtually all gaming companies that center their game around PvP that I know about. There's a lot of things companies in general do with games, like ruin a page layout of an in-game client and purposely making it more inconvenient to use but in trade making it look somewhat advanced and new; to new players it makes the game look advanced and cooler, but to veteran players it makes us angry about how it's extremely inconvenient in comparison to it's previous version.","replies":[]}]},{"poster":"ginkeq666","date":"2016-02-21T08:01:18.313+0000","up_votes":3,"down_votes":9,"body":"there are too many champions\n\nif the # of champions were reduced the game would be possible to balance\n\nthats why SC2 is a balanced game... 3 races\n\n\ni suggest riot reduce the # of champions to 30 or 40... if they want to make more $ just add more skins","replies":[{"poster":"Guy Fox Teemo","date":"2016-02-21T11:07:46.046+0000","up_votes":13,"down_votes":1,"body":"That sounds like a terrible idea, I'd rather have a imbalanced game that keeps evolving and adding new content and characters, and keeps on changing. Then a dull game that stays the same for the rest of its life spam.","replies":[{"poster":"ginkeq666","date":"2016-02-21T19:11:11.632+0000","up_votes":1,"down_votes":3,"body":"yeah\n\nkeep adding champions and not going back to adjust any of the older champions that suck\n\na lot of champions aren't even played anymore... if riot wants to add new champions they should at least fix the old ones","replies":[{"poster":"Guy Fox Teemo","date":"2016-02-21T19:36:54.230+0000","up_votes":5,"down_votes":0,"body":"I guess you haven't noticed all the reworks then?","replies":[]}]}]},{"poster":"Captain Aishi","date":"2016-02-21T15:19:53.970+0000","up_votes":2,"down_votes":1,"body":"starcraft 2 - balanced :pick one lol\ni stopped playing that game long ago but the balance state was so ridiculously bad and blizzard only ever fucked up even worse with every passing patch so i just gave up","replies":[{"poster":"ginkeq666","date":"2016-02-21T19:12:38.804+0000","up_votes":2,"down_votes":0,"body":"starcraft 2 was balanced though\n\nif you watched the pro matches one race wasn't winning all the tournaments\n\nlook at a lol tournament though... no one plays certain champs because riot is too lazy to fix them","replies":[{"poster":"Guy Fox Teemo","date":"2016-02-21T19:37:52.420+0000","up_votes":1,"down_votes":2,"body":"Starcraft was balanced infact it was TOO balanced in a sense that there was ONE strat and whoever could do it the most efficiently and click the fastest. Would win.","replies":[{"poster":"ginkeq666","date":"2016-02-21T19:56:10.001+0000","up_votes":2,"down_votes":1,"body":"not really... there are always things you can do to counter what your opp is doing","replies":[]}]}]}]}]},{"poster":"Jasiwel","date":"2016-02-21T06:30:14.472+0000","up_votes":6,"down_votes":0,"body":"Frankly, if they can push past this snowballing phase they're going through, then the game will be a lot healthier. The problem right now is that snowballing is so easy and the champions that snowball well SNOWBALL REALLY DAMN WELL. And all of those champions are at the top right now as a result. \n\nThe problem I keep seeing lies in those hyper-snowballing champions that need only an item or two to become super lethal before everyone else. Once that snowballing is dealt with appropriately (Riot needs to slow it down a bit) and defensive strategies become more viable for a wider variety of champions, then this game will be feel a lot better than it does at the moment. Being killed by raw power from snowballing champions just doesn't feel good and a lot of players report games feeling dissatisfying to win as a result.","replies":[{"poster":"Auz the Ripper","date":"2016-02-22T17:15:22.296+0000","up_votes":1,"down_votes":0,"body":"Actually, if you'll look at stats, the champions that are doing the best (excluding the outliers like xin) are the ones that can resist being snowballed.\nThe safe champions like Janna, Lux, and Ahri \n\nLiterally any champion Snowballs decently in the current conditions of the game, so if dedicated feast/famine snowballers like akali get behind, they just outright lose.","replies":[]}]},{"poster":"GorillaBearz","date":"2016-02-21T06:19:38.502+0000","up_votes":2,"down_votes":0,"body":"I couldn't have said it better my friend. I understand they are trying their best to balance things. But honestly, why the fuck don't they just hire Kennen and Shen already??\n \"Balance in all things\"{{champion:85}} {{champion:98}}","replies":[{"poster":"Melledoneus","date":"2016-02-21T06:31:05.658+0000","up_votes":1,"down_votes":0,"body":"They can't hire Shen. That would cause their productivity to drop to abysmal levels because they would try to get Shenpai to notice them everyday, foregoing their work.","replies":[{"poster":"macromite","date":"2016-02-21T06:55:01.215+0000","up_votes":1,"down_votes":0,"body":"then they would need to hire me, because shenpai wants me to notice him.","replies":[{"poster":"Melledoneus","date":"2016-02-21T07:28:02.844+0000","up_votes":4,"down_votes":0,"body":"http://i0.kym-cdn.com/photos/images/newsfeed/000/901/163/035.png\nhttps://i.imgflip.com/hfllx.jpg","replies":[]}]},{"poster":"UB3R 1337 H4X","date":"2016-02-21T06:49:13.130+0000","up_votes":2,"down_votes":0,"body":"But Kennen would force them to push everything out at an insane pace therefore making patches become bi-weekly.","replies":[]}]}]}]}