{"poster":"Renek Yourself","date":"2015-07-18T12:09:27.869+0000","title":"League freezing in game/minions health bars disappear,can't see ability animations or","subforum":"Help & Support (OCE)","up_votes":3,"down_votes":0,"body":"Ive been playing league for a while, i&#039;m currently experiencing gameplay issues and its really annoying. Everything seems to be fine (ping/fps) then all of a sudden you will freeze and the minions will lose their health bars but keep attacking (forever)\r\nThe champion can still move but you cant see ability animations from either team. Sometimes you cant see anyone else on the map. When someone kills you your animation can still run around etc. Sometimes ill seem to reconnect in a sudden and every animation that has happened shows up in one quick burst, even if im dead. I have tried disconnecting/restarting the client. I load up to 100% and then my ping spikes to 999 and just freezes. Has anyone else ever had these issues? Thanks","replies":[{"poster":"UnityyBlakey","date":"2018-06-07T13:05:35.181+0000","up_votes":1,"down_votes":0,"body":"Same, submitted a ticket a month ago, told me to download a bunch of shite. None of it worked. Honestly don't know what they're doing.","replies":[{"poster":"Ninox","date":"2018-06-07T14:23:43.983+0000","up_votes":1,"down_votes":0,"body":"Ok so this thread is from 3 years ago and is very unlikely to be relevant now. It sounds like either a GPU issue or a game file issue, or could even be a packet loss (connection) issue, of which there are any number of causes, and any number of fixes that will work for some things and not others. If the common fixes like clean reinstalling your League and updating your Graphics card drivers aren't working you're going to have to dig a little bit deeper.\n\nIt is entirely possible that it is something unique (or mostly so) to your setup that is causing the issue, in which case Support can only be so much help to you as they have no way of knowing the exact cause of your issues, and at which point more information is crucial.\n\nWhat have you already tried?\nWhen did the issue start?\nIs it every game or just some?\nAre you having any other issues with your connection or ISP?\nAre you having any issues with other games?\nHave you installed anything new that coincided with the start of the issue?","replies":[]}]},{"poster":"KeitaVeir","date":"2016-01-27T10:47:36.956+0000","up_votes":1,"down_votes":0,"body":"I have exacly same problem. Seems like Riot still ignores it. New skins are more important for them than bug fix.","replies":[]},{"poster":"ahmedanyy","date":"2016-05-16T23:09:58.457+0000","up_votes":0,"down_votes":0,"body":"me too what is the problem and why no one try to fix it","replies":[]}]}