{"poster":"Unitain","date":"2019-02-25T08:58:55.401+0000","title":"por que el abuso contra los novatos ? consejos de alguien plis ?","subforum":"Comportamiento del jugador","up_votes":3,"down_votes":1,"body":"buena quería crear este foro por que no comprendo por que RIOT permite el acoso y abuso verbal contra los jugadores nuevos (nobs), eh jugado numerosas partidas comunes y me resultaba muy practico entrenar allí así que decidí pasar a las clasificatorias, y ciertamente ... soy malo en ellas y a causa de ello recibo mucho acoso verbal, reconozco tener errores pero muchos de los que están conmigo en partida también fallan cosas (hooks, helings, burst, habilidades en si) y no les reprocho nada y aprendo de ellos. pero sinceramente me entristece el comportamiento abusivo y repetitivo de los jugadores y el hecho de que dudo que reportarlos como jugadores tóxicos (por que lastima en serio el trato) sirva de algo por que veo que esto se repite en cada partida. si vieran mi historial verían que he tratado de mejorar, cambie de posición o carril, probe heroes en entrenamiento o grieta común, revise items y runas, vi tutoriales, pero es un fail. si erro un gancho con thresh de 20 que tire me lo recalcan, si salto con jayce a robar un dragón y me matan me retan (considerando que el burst lo haya usado) pero si lo logro nadie dice nada. quiero mejorar como muchos otros jugadores novatos por eso pido ayuda y consejos. espero que RIOT también haga algo con el acoso que sufrimos, juego para divertirme pero me deprime y preocupa que no se haga nada significativo. agradezco consejos y recomendaciones. mi nombre en el juego es Unitain, juego jayce mid/top- veigar mid/sup- thresh sup ..... gracias por leer este comentario y ayudar.","replies":[{"poster":"Tur1nTur4mb4r ","date":"2019-02-25T12:09:06.454+0000","up_votes":2,"down_votes":0,"body":"Primero,  como todos te dicen, es normal en la vida. Nunca oíste la expresión \"pagar derecho de piso\"? Bueno esto es lo mismo. O similar. Yo de todos modos no lo justifico, o al menos no comparto cuando hay un exceso porque, seamos honestos, todos nos hemos divertido a costa del compañero nuevo. Y se han divertido a la nuestra cuando lo fuimos. Pero algo que no te mencionan, y que también pasa en la vida en gral, es que mucha personas con las que jugas y te insultan son frustrados que se han quedado en algún elo, y como son tan mancos de no poder seguir subiendo se crean cuentas nuevas, smurfs, para empezar de cero. Como si eso fuese a darles nuevas habilidades. Entonces se encuentran con jugadores inexpertos y canalizan contra ellos su propia frustración. Aún así para jugar rankeds hay que tener un cierto nivel y conocimiento del juego y sus campeones. Mi consejo es que practiques mucho y mainees al menos dos o tres campeones en las líneas que te interesa jugar y las primeras rankeds hacerlas con un dúo. Igual siempre va a haber flameo, olvidate","replies":[{"poster":"Unitain","date":"2019-02-26T01:29:54.565+0000","up_votes":2,"down_votes":0,"body":"vale,  gracias. la verdad necesito conocer mas los champs enemigos y sus habilidades por que hay varios que se que tipo son y no sus habilidades, como dices en eso si es error mio, pero gracias probare mas champs por lineas para ser mas ¨flexible¨ en la selección","replies":[{"poster":"Tur1nTur4mb4r ","date":"2019-02-26T02:03:18.064+0000","up_votes":1,"down_votes":0,"body":"Yo aprendi a counterear algunos despues de jugarlos y entender mejor como funcionan. Un buen lugar para probar champs es aram. Sabes que te va a tocar uno al azar y es un modo rapido. Yo para darme una idea de las builds tengo en el celular una app que se llama lol catalyst y tiene el {{item:3010}}  de icono en el play store. Ahi tenes la info que saca de opgg sobre los campeones, como para armarte rapido antes de una partida sin tenes que consumir recursos con el chrome","replies":[{"poster":"Unitain","date":"2019-02-26T03:33:46.696+0000","up_votes":1,"down_votes":0,"body":"yo uso una parecida pero ya le echo un ojo a esa app, y si voy a probar aram ahora, gracias","replies":[{"poster":"Tur1nTur4mb4r ","date":"2019-02-26T10:55:04.580+0000","up_votes":1,"down_votes":0,"body":"Suerte!!\n\n{{sticker:slayer-pantheon-thumbs}}","replies":[]}]}]}]},{"poster":"Nerf Aery","date":"2019-02-25T20:43:55.739+0000","up_votes":2,"down_votes":0,"body":"Y así terminan con veinta cuentas en plata 1 xd.","replies":[{"poster":"Tur1nTur4mb4r ","date":"2019-02-25T22:17:46.359+0000","up_votes":1,"down_votes":0,"body":"Jajajajajaa historia real! Las cuentas deberían vincularse a una tarjeta de crédito, máximo dos cuentas por tarjeta. Ahí se solucionan gran parte de los smurfs","replies":[{"poster":"Nerf Aery","date":"2019-02-25T23:42:26.149+0000","up_votes":2,"down_votes":0,"body":"Antes que eso, me gustaría que arreglen el match making y dejen de poner 3 bronces en flex con un plata y gold vs 5 platinos :D.","replies":[{"poster":"Tur1nTur4mb4r ","date":"2019-02-26T01:41:44.159+0000","up_votes":1,"down_votes":0,"body":"https://memegenerator.net/img/instances/72990628/jamas.jpg","replies":[]}]}]}]}]},{"poster":"SquidCrazy","date":"2019-02-25T15:05:58.750+0000","up_votes":1,"down_votes":0,"body":"Te recomiendo no rankear hasta que seas mayor al lvl 50, por ahora trata de mejorar jugando los campeones que te gusten, veo que te gustan Jayce, Veigar y Thresh, así que te recomiendo que mainees puro mid y supp, sigue jugando en normales, prueba campeones similares, yo antes de sacar algún campeón en rankeds trato de que sea m5 o más, así me siento seguro y creo que así las demás personas también lo sentirían, espero que te ayude, y suerte en tus partidas.\nTambién te recomiendo jugar a Pyke, Blitz en supp (aunque no estén tan meta, ya que si sabés usarlos revientan) y en mid Ahri, Zed o Talon.\nUn saludo Squizy &lt;3\n{{sticker:vlad-salute}}","replies":[{"poster":"Teemo Best JoJo","date":"2019-02-25T17:40:03.898+0000","up_votes":1,"down_votes":0,"body":"Edit: No rankees para que  te vuelvas un gordo que solo le interesa el meta y subir de liga","replies":[{"poster":"LucksAFK","date":"2019-02-25T18:03:29.963+0000","up_votes":2,"down_votes":0,"body":"Y para q rankeas si no es para subir?","replies":[{"poster":"Nerf Aery","date":"2019-02-25T20:42:38.358+0000","up_votes":1,"down_votes":0,"body":"Ayer me crucé a unos conitos en una normal y me dijeron \"vos solo rankeaste para subir de liga\" y si pa, mira si voy a rankear para quedarme en alguna liga.","replies":[]}]}]},{"poster":"Unitain","date":"2019-02-26T01:31:58.493+0000","up_votes":1,"down_votes":0,"body":"gracias tenia ciertas dudas de que champs probar en las lineas, pero pyke lo veo mucho y me intriga probarlo hace tiempo igual que talon. gracias jajaja","replies":[]}]},{"poster":"Powered by CIona","date":"2019-02-25T10:51:55.656+0000","up_votes":1,"down_votes":0,"body":"vi tu historial amigo, te recomiendo practicar en normals porque se nota que eres nuevo, cuando sientas que ya tienes más experiencia juegas ranked","replies":[{"poster":"Unitain","date":"2019-02-26T01:43:30.572+0000","up_votes":1,"down_votes":0,"body":"eso estaba por hacer hoy, ayer me frustre mucho y escribí el post por que me sentía que no era el único y quería desahogarme. en normal, suelo reventar hoy a la mañana jugué para ver que corregir (debo mejorar en decisiones y control bajo presión, como calcular que a dos enemigos puedo reventarlos fácilmente con jayce lvl 12, y ellos lvl 9, pero siento cierta desconfianza a veces) y gane todas las partidas con buenas kills y objetivos (torres, farm, dragón, red y blue) pero necesito mejorar en conocimiento de los champs enemigos aun","replies":[]}]},{"poster":"Dante is asasin","date":"2019-02-25T23:00:32.147+0000","up_votes":1,"down_votes":0,"body":"Te diré la verdad: Esta comunidad nunca cambiara. Siempre te dirán que debes evitar esto, o aquello, pero la mera verdad es que para seguir en este lugar, debes aguantar a los Toxicos, AFK, Etc, etc. \n\nNo es que Riot deje que sean tóxicos, es que no toman medidas sancionarías correspondientes, siempre o castigan al que sufrió el asunto, o simplemente no toman en cuenta los pedidos. Dejo aquí también una foto de como ignoraron todos mis reportes.\n\n[Reporte 1](https://imgur.com/RnFK1qo)\n\n[Reporte 2](https://imgur.com/WiE9mVd)\n\n[Reporte 3](https://imgur.com/sCrJsnL)\n\nPD: En los últimos 2 reportes, ya prácticamente no quería escribir por el asco que tenia contra el servicio a cliente.","replies":[{"poster":"Unitain","date":"2019-02-26T01:38:57.584+0000","up_votes":1,"down_votes":0,"body":"acabo de leer todos, y si es verdad el ks ya no lo veo mal, prefiero eso a que me hagan señas de tirarme al frente y que me dejen solo el jg o el adc, regalando kills al enemigo. a mi de troll y flamer me acusaron varias persona en ranked, y es por lo que dije y veo te paso con una miss, es terrible eso, pero lo que me cabrea es que me culpen a mi después por no tener rango entre todos, como una especie de complot.","replies":[]}]},{"poster":"Teemo Best JoJo","date":"2019-02-25T17:41:28.880+0000","up_votes":1,"down_votes":0,"body":"No los tomes en cuenta , es un jueguito nomas , tu juega como se te de la gana. No le hagas caso a esos gordos challenger que te dicen que juegues X cosa para subir de liga y ser igual de gordos que ellos","replies":[]},{"poster":"Tortuguita","date":"2019-02-25T14:20:27.316+0000","up_votes":1,"down_votes":0,"body":"En todos lados, hasta en la vida, si eres el nuevo siempre seras el objeto de bromas hasta que puedas ganar la suficiente experiencia. Solamente practica en normales hasta que sepas.","replies":[]},{"poster":"Panda Lover","date":"2019-02-25T11:25:07.528+0000","up_votes":1,"down_votes":0,"body":"La vida es asi, no solo en un jueguito virtual como este, en todos lados, si sos el nuevo en lo que sea, te van a querer joder.\n\nYo cuando jugaba a la pelota con mis primos de mi misma edad, contra los vecinos y primos mas grandes, nos hacian \"CULO\" y nos mataban, consistia en que venian fuerte, y nos empujaban con el culo a la mierda y nos tiraban al piso y es \"CULO\" no hay falta, nos cagaban a patadas, a pelotazos todo, teniamos que aguantar.\n\nEn un trabajo es peor, la competitividad es peor.\n\nPero no hay un solo lugar donde no seas nuevo, y tengas que pasar por cosas no muy lindas hasta que te adaptes...","replies":[]},{"poster":"Trucy Wright","date":"2019-02-25T09:05:21.259+0000","up_votes":1,"down_votes":0,"body":"Eso es algo normal de un juego tan competitivo como League of Legends. Lamentablemente, la gente ama recalcar errores y no ver los suyos. Lo que yo te puedo recomendar es que si querés mejorar, sigas viendo tutoriales, probando builds. Enfocate en encontrar tu línea preferida y alguna otra que también juegues bien y de ahí intenta buscar campeones que te gusten. Si te gusta top, busca los campeones más jugados en top, los mejores jugadores de top, etc. En cuanto a la gente, no le prestes atención, la mayoría solo utiliza tus errores para flamear y eso no ayuda ni a ellos ni a vos.\n\nMucha suerte!","replies":[]}]}