{"poster":"Winters Dawn","date":"2017-04-24T17:40:24.737+0000","title":"Improving and the capacity to learn (I'm stuck)","subforum":"Gameplay","up_votes":1,"down_votes":1,"body":"I&#039;ve been playing league for about 2 years now and there are things that I still do not understand. Up until about a month ago I was one of those bronze players who believes my team was the sole cause of me being in bronze. \r\nI decided to start working on small things, last hitting and reactive builds instead of just building the same thing every single game. And with my effort I have finally made it into silver. There are still things that boil my blood. Like how a laner can get only 2 kills over the other guy and yet he already feels 2-3 times more powerful than anyone on the team. How I can be only 5 cs behind someone I recall to buy things, this guy is roaming mid to try to help his midlaner, he then dies in the process goes back to lane and when I show up he&#039;s all of a sudden 25-30 cs ahead of me. He was away from lane just as long as me yet this. \r\nThen I had a game I was auto filled support. An enemy teemo top lane hit lvl 16 when I was barely hitting lvl10. I can not recall any game in two years that I&#039;ve seen such a huge gap in team lvls. \r\nThis is very frustrating as I enjoy league, I want to get better but I feel stuck. \r\nI use to play StarCraft 2 a lot. I made it to diamond in that game which at the time was like 3-5% of players NOW LET ME BE CLEAR, I&#039;m not throwing my skill from that game to claim I deserve a higher ranking in league. Why I bring that up is because StarCraft is not an easy game to master but I learned from mistakes I took advice. I reference my skill in that game to show that I have a capacity to learn and understand a games more complicated machanics. But with league no matter how much I think I know I still feel like I get nowhere. \r\n\r\nWhen I was only silver on StarCraft playing against other people I felt like they had this unseen advantage. People said well hey build some cheap units at this time to help against early attacks but my thought was that&#039;s such a waste why now just wait to build these bigger units. If I use minerals on these cheap units my enemy is just gonna save up for better ones. I also felt like somehow the other player could build things faster. But one day it hit me, for every action I take the other player is doing a similar action that takes about the same amount of time. \r\nThis realization made me play better and smarter and not feel rushed. \r\nBut whatever realization I&#039;m missing with league just isn&#039;t coming to me. I constantly feel like people out damage me, can get around the map faster. I enjoy this game, and like StarCraft years ago I want to improve but I don&#039;t know what I&#039;m missing.","replies":[{"poster":"Zezockary","date":"2017-04-24T17:54:11.687+0000","up_votes":1,"down_votes":0,"body":"The problem I immediately think of when reading this is that you are focusing too much on yourself and your opponents, without thinking about the players on your team. As an example, a lot of the time someone on your team will do something stupid. Watch your map and try to find out when they are about to do something stupid based on the things you can see. Ping for them to retreat and, when they don't, position yourself to do something good off of them doing something stupid. Like, skirt around the danger zone and try to pick someone off, or maybe just heading there will clue in your team and you can turn it around.\n\nAs an example, in one of my recent games we had a team member that kept running into the enemy jungle and getting ganked. I would sit around river and wait for an enemy to get behind him to kill him and kill that person.\n\nAnother important thing to consider in this light are objectives. Going for an objective at the right time is very important. When the time is right and your team starts splitting off to do nothing, ping what you need to do then start doing it. Sometimes you will get something just from trying, sometimes your team will see what you are doing and help.\n\nIn one of my recent games we picked off a couple enemies, so my team headed from mid to top to gank somebody. I pushed mid and got a turret, an inhib, and health off of a nexus turret. Although be careful with this, another time we picked off a couple people and my team headed mid/top, I went to dragon. I nearly killed it until the enemy adc stole it at the last second, then I got ganked by the adc and mid on my way out and died.\n\nAnyway, this game isn't like Starcraft in the sense that you don't have control over all of the resources you gain and how they are spent or even the time you or your team have. You have to use your roughtly 1/5 of your team's resources and time and make it count for more than that as compared to your team's.","replies":[]}]}