{"poster":"znshadow","date":"2018-04-27T09:08:59.447+0000","title":"Es ist unfair gegen Master Gamer  in Bronze zu spielen","subforum":"Ligen & gewertete Spiele","up_votes":2,"down_votes":3,"body":"Hallo werte Community,\r\n\r\nentschuldigt bitte das ich mich hier ausheule!\r\n\r\nIch habe vorhin gegen einen Jhin ADC gespielt. \r\nNach dem Ende des Games habe ich mein Team gebeten diesen zu reporten!\r\n\r\nAnschlie&szlig;end hat er mir erkl&auml;rt das er auf dem Weg nach Chalenger ist.\r\n75% Winrate hat dieser Gamer. Wir haben es nicht mal zu dritt geschafft ihn aus dem Game zu nehmen.\r\n\r\nIch bin der Meinung das dieser einen anderen Account benutzt!\r\nDenn als ADC hat er eine 100% Winrate und als Jungler nur 40%.\r\nIch habe diesen reportet und auch noch ein Support Ticket aufgemacht.\r\n\r\nIch hoffe inst&auml;ndig das dieser Account geschlossen wird!\r\n\r\nIch hoffe das viele Leser dieser Diskussion wenn Sie auch das Gef&uuml;hl haben von einem Smurfer betrogen zu werden diesen zu reporten.\r\nAuch in im eigenem Game denn das ist absolut unfair uns realen Bronze Gamern gegen&uuml;ber.\r\n\r\n\r\nHabt Dank f&uuml;rs lesen!\r\n\r\nZN","replies":[{"poster":"znshadow","date":"2018-04-27T10:14:16.175+0000","up_votes":1,"down_votes":2,"body":"Nachtrag!\nIch habe kein Problem zu verlieren!\n\nMeine Winrate liegt bei zur Zeit bei 40% in den letzten 20 Games.\nIch bin wohl nicht so gut > ok!\n\nAber mit einem oder gegen solche Spezialisten zu spielen und dann deklassiert zu werden.\nDas macht keinen Spaß und ist bestimmt auch nicht im Sinne von den RIOT vorsätzen\n\n- Faire Spiele\n- Kurze Wartezeiten\n- Wettbewerbs orientierte Spiele\n\nDeswegen plädiere ich dafür das man Smurfer reportet wegen Hacks, Scripting oder Accountsharing.\nVielleicht sollten die RIOT Programmierer noch einen zusätzlichen Button einprogrammieren\n<O> Ich will mich beweisen gegen + 2000 ELO!\n\nAllen anderen rate ich Smurfer gnadenlos zu reporten.\nAuch wenn es erlaubt ist , ist es nicht fair .....\n\nZN","replies":[{"poster":"Mjölnir Kind","date":"2018-04-27T10:25:43.754+0000","up_votes":3,"down_votes":0,"body":"Smurfing ist erlaubt und du kannst dir soviele Accounts erstellen wie du willst.\nUnd viele Leute haben sich acuh einen Smurf gemacht damit sie überhaupt lol spielen können, weil sie gebannt wurden und nicht um sich zu beweisen","replies":[]}]},{"poster":"Hurbokuhmar","date":"2018-04-27T09:27:02.775+0000","up_votes":1,"down_votes":0,"body":"Ähm der hat 49% Winrate bei ca. 200 Games nur auf Jhin selber über 70% bei 15 Games. Zusätzlich ist er seit 2 Seasons in Bronze, das ist kein Smurf. Der hat nur mal ein gutes Game gehabt mehr nicht. Das mit dem Weg nach Challeenger , is ja schön wenn er Ziele hat, aber das ist zu 100% kein Smurf :D","replies":[{"poster":"znshadow","date":"2018-04-27T09:58:18.682+0000","up_votes":1,"down_votes":0,"body":"Hi Du,\nhttp://up.picr.de/32516416zo.jpg\n\nAlso 49% insgesamt und in den letzten 20 Games laut op.gg eine Winrate von 75%!\n\nDeswegen BIN ICH DER Meinung das dies ein gescherter Account ist.\nAußerdem, habe ich gegen Ihn gespielt. \n\nBronze spielt nicht so!\nDas was er mit uns gemacht hat war schon beeindruckend.\n\nZN","replies":[{"poster":"MeMyselfandBaal","date":"2018-04-27T12:40:25.275+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=znshadow,realm=EUW,application-id=ip27PlEH,discussion-id=eReOo02E,comment-id=00020000,timestamp=2018-04-27T09:58:18.682+0000)\n>\n> Hi Du,\n> http://up.picr.de/32516416zo.jpg\n> \n> Also 49% insgesamt und in den letzten 20 Games laut op.gg eine Winrate von 75%!\n> \n> Deswegen BIN ICH DER Meinung das dies ein gescherter Account ist.\n> Außerdem, habe ich gegen Ihn gespielt. \n> \n> Bronze spielt nicht so!\n> Das was er mit uns gemacht hat war schon beeindruckend.\n> \n> ZN\n\nhmm... bin ich dann auch nen Mastersmurf, weil ich zwischenzeitlich 12 Spiele in Folge mit Lulu gewonnen habe?\nUnd ich sag das mal so: Phasen mit 75% Winrate habe ich irgendwie jedes Jahr zwischenzeitlich dabei. Meistens ist das die Phase zwischen Gold IV und Gold II, wenn ich wieder ins Rollen komme... Und ich schreibe dann auch immer im Scherz: Hoffentlich werde ich jetzt nicht fürs Boosten meines eigenen Accounts gebannt...\n\nIst es im Bereich des Möglichen, dass der Account geshared wird? Oder dass das ein Smurf ist? Ja. Obwohl ich Master ausschließen würde. Aber ihn zu bannen, nur weil er auf Jihn und Kai'Sa wesentlich besser ist als auf Quinn im Jungle... ich sag das mal so: Wenn der Maßstab angewendet wird, bin ich demnächst meinen Main Account los...\n\nEs kann auch einfach sein, dass der Spieler halt 3 Champions geübt hat, sich coaching gegönnt hat und jetzt die Früchte dieser Arbeit einfährt. Das kann man anhand oberflächlicher Statistiken nicht feststellen.","replies":[]},{"poster":"Fleischbazooka","date":"2018-04-27T10:14:11.999+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=znshadow,realm=EUW,application-id=ip27PlEH,discussion-id=eReOo02E,comment-id=00020000,timestamp=2018-04-27T09:58:18.682+0000)\ngescherter Account\n\nlol. Schon erstaunlich wie manchmal aus Denglischen begriffen solche Wortmutationen geschaffen werden\n\nZum Thema: Mach dir keine Hoffnungen, mag sein das ihm gerade ein Kumpel hilft oder sowas. Ist aber schwer nachzuweisen weißt du..\nJeder kann mal eine Siegessträhne haben. Solange er keine 80% Winrate bei 100 Games + hat sieht Riot wahrscheinlich dort auch kein Handlungsbedarf.\n\nVon Daher: Abhaken und weitermachen","replies":[{"poster":"znshadow","date":"2018-04-27T10:23:11.782+0000","up_votes":1,"down_votes":0,"body":"das war wohl die Rechtschreibhilfe! Na ja diese verdeutschten Wörter ...\n\n___\n\n> Hoffnung\n\nIch hoffe das RIOT mehr solcher Beiträge ließt!\nJe mehr Beiträge, Meldungen und Support Ticket sie betrachten müssen desto Wahrscheinlicher ist es das etwas passiert!\nSiehe [Neuerungen 2019](https://nexus.leagueoflegends.com/de-de/2018/04/dev-updates-to-ranked-for-2019/)!\n___\n\n>Von Daher: Abhaken und weitermachen\n\nNö!\nDas sehe ich nicht so. Es ärgert mich.\nSteter Tropfen höhlt den Stein hat immer meine Mama gesagt.\n\nIrgendwann sind es nicht nur Tropfen...\n\nZN","replies":[{"poster":"AI Marko","date":"2018-04-27T14:45:19.604+0000","up_votes":1,"down_votes":0,"body":"> Siehe Neuerungen 2019!\n\nja man freu dich wenn ein zb Dia 1 midlaner auf einmal autofill jungle ist und dort nur silber/gold ist das wird lustig xD\n\n{{sticker:slayer-jinx-wink}}","replies":[]},{"poster":"Fleischbazooka","date":"2018-04-27T11:16:43.146+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=znshadow,realm=EUW,application-id=ip27PlEH,discussion-id=eReOo02E,comment-id=0002000000000000,timestamp=2018-04-27T10:23:11.782+0000)\n\n> Ich hoffe das RIOT mehr solcher Beiträge ließt!\n\nIch glaube ich lehne mich nicht zuweit aus dem Fenster, wenn ich dir erzähle, dass hier Riot gar nichts liest (neben Freiwilligen grünen Helfern etc. ..)\n\nWenn du Beachtung willst, dann geh am besten ins Reddit.","replies":[]}]}]}]}]},{"poster":"Critical lmpact","date":"2018-04-27T09:18:38.669+0000","up_votes":2,"down_votes":0,"body":"Jetzt die 1 Mio. € Frage: warum hast du ihn reported? Was hat er verbotenes getan?\n\nKlar ist es frustrierend, gegen einen solchen Spieler zu spielen. Aber er kann sich so viele Accounts erstellen wie er möchte :)","replies":[{"poster":"znshadow","date":"2018-04-27T09:59:28.118+0000","up_votes":1,"down_votes":0,"body":"Hi\nIch bin der Meinung das dieser Gamer einen fremden Account benutzt.\n\nDeswegen der Report\n\nZN","replies":[]}]},{"poster":"Bountie","date":"2018-04-27T10:59:13.559+0000","up_votes":2,"down_votes":1,"body":"Report wegen boosten ist in Ordnung.\n\nAls Smurf kann man gar nicht in Bronze platziert werden.","replies":[{"poster":"OT Riku","date":"2018-04-28T09:36:08.161+0000","up_votes":1,"down_votes":0,"body":"Mh ich weiß ja nicht, smurf ist ja eigentlich nur ein synonym für einen zweit account. \nWenn der main in Bronze ist sollte der smurf auch dort landen.","replies":[{"poster":"Bountie","date":"2018-04-28T17:53:49.014+0000","up_votes":1,"down_votes":0,"body":"für mich ist ein smurf, wenn sich ein erfahrener spieler ein  neuen account erstellt. Und wenn man in bronze nach den placement´s landet ist man ein newbie","replies":[{"poster":"OT Riku","date":"2018-04-28T21:17:08.096+0000","up_votes":1,"down_votes":0,"body":"Ja gut das ist deine Ansicht. \nAber ist einer ein Newbie der seit mehreren Jahren in Bronze spielt?\nIch glaube nicht.","replies":[]}]}]}]},{"poster":"Mjölnir Kind","date":"2018-04-27T09:13:09.515+0000","up_votes":1,"down_votes":0,"body":"Eine 100% winrate?\nWie viel Games als adc?","replies":[{"poster":"znshadow","date":"2018-04-27T09:15:14.418+0000","up_votes":1,"down_votes":0,"body":"schaue einfach mal bei op.gg nach! \n\nSein Name beginnt mit HellRa......\n\nZN","replies":[{"poster":"Mjölnir Kind","date":"2018-04-27T09:17:52.212+0000","up_votes":1,"down_votes":0,"body":"Bro der Typ hat ne 49% winrate in SoloQ\nWenn er mit der winrate weiter spielt kommt er höchsten von Bronze 1 auf bronze 2","replies":[{"poster":"znshadow","date":"2018-04-27T10:02:40.348+0000","up_votes":1,"down_votes":0,"body":"Hi,\nich habe keinen Plan wie die Gesamte Winrate bei op.gg berechnet wird.\n\nWenn ich also meinen Account einem Master gebe, dieser dann 20 Spiele macht und dabei 75% gewinnt und ich selber nur 49% schaffe dann ist doch da was faul oder?\n\nZN","replies":[{"poster":"Mjölnir Kind","date":"2018-04-27T10:08:11.699+0000","up_votes":1,"down_votes":0,"body":"gut ich hab mir denn ACC genauer angesehen.. So unnwahrscheinlich ist es garnich das er geboosted wird.\nDer acc ist main jgl soweit ich das beurteilen kann und \n- plötzlich fängt er an kaisa zu spielen und rassiert komplett.\n- hat öfters einen 10er Farm die Minute\n- grundsätzlich ein gute Farm in jedem Game\n\nMuss ich dir recht geben, den Verdacht auf boosting hätte ich auch tbh.","replies":[{"poster":"znshadow","date":"2018-04-27T10:27:04.094+0000","up_votes":1,"down_votes":0,"body":"hI;\nso genau habe ich das gar nicht analysiert!\n\nAber Danke der Information!\n\nZN","replies":[{"poster":"Mjölnir Kind","date":"2018-04-27T10:30:17.996+0000","up_votes":1,"down_votes":0,"body":"Aber nur wegen ner guten Winrate in den letzten 20 games ist er noch kein Smurf","replies":[{"poster":"znshadow","date":"2018-04-27T11:05:26.829+0000","up_votes":1,"down_votes":0,"body":"Hi,\nwie schon geschrieben,  ich habe gegen ihn gespielt und wir hatten 0 Change!\nDenn kommt das eine zum Anderen und später habe ich mir seine Daten angeschaut!\n\nIch habe ja nix gegen das Smurfen, das ist nicht so toll das gebe ich zu!\nAber irgendwann sind sie nahe ihrer realen Divison. Schon nach dem Plazierungsspielen gehen diese in eine Höhere Division. \n\nAber das in unserem Game war was anderes!\nIch bin Bronze 3 der dedizierte Account in Bronze 1.\nSein gameplay ... keiner von uns konnte da mithalten!\n\nAber die letzten 20 Games ... Indiz für wie nanntest du es \"boosting \"\nWenn dieser seit beginn seines Accounts eine Winrate von 75% gehabt hätte würde ich nicht mit ihm in einem Ranked kommen ....\n\nZN","replies":[{"poster":"ΔRC RΔFUNZΞL","date":"2018-04-27T12:41:35.605+0000","up_votes":1,"down_votes":0,"body":"Der junge hat einfach actually mal eine mobafire guide gelesen xD und btw ein master spieler hätte eine 100% winrate in diesen games. Außerdem ist es bei solchen gegnern auch nicht schwer 10 cs p/m zu holen (no offense) ich hatte schon eine 86% winrate in den letzten 20 games gehabt, bin ich deswegen auf dem weg nach challenger? nein 15 von 20 games gewinnen ist einfach eine winstreak oder mehrere kleine, das ist keine kunst ich habe zurzeit auch 65% winrate in den letzten 20 games und ich bin plat 3 100lp, das sagt mir nur, dass ich wohl auf einer guten winstreak bin","replies":[{"poster":"SSI CptHaunted","date":"2018-04-27T13:29:02.648+0000","up_votes":1,"down_votes":0,"body":"10cs/min schaff ich nicht mal ansatzweise, für Bronze 1 find ich das schon recht viel.","replies":[{"poster":"ΔRC RΔFUNZΞL","date":"2018-04-27T14:41:45.335+0000","up_votes":1,"down_votes":0,"body":"wenn das game gut läuft sollte 10 cs per minute nicht schwer sein, außerdem haben alle andere stärken, vllt ist er recht gut im cs'en btw er hat durchschnittlich auf jhin nur 5.9 cs per minute, außerdem war das auf gangplank wo farmen allgemein nicht so schwer ist sobald du die waves 1 shottest","replies":[]}]}]}]}]}]},{"poster":"ΔRC RΔFUNZΞL","date":"2018-04-27T12:47:30.163+0000","up_votes":1,"down_votes":0,"body":"er hat durchschnittlich 5.9 cs auf jhin, das ist nicht smurfing ^^ jeder hat mal ein game 10 cs per minute","replies":[]}]},{"poster":"ELOW Cronos","date":"2018-04-27T11:26:47.590+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=znshadow,realm=EUW,application-id=ip27PlEH,discussion-id=eReOo02E,comment-id=0000000000000000,timestamp=2018-04-27T10:02:40.348+0000)\n>\n\n> Wenn ich also meinen Account einem Master gebe, dieser dann 20 Spiele macht und dabei 75% gewinnt und ich selber nur 49% schaffe dann ist doch da was faul oder?\n> \n\nUm in Bronze auf 75% Winrate zu kommen, brauchst du kein Master. Ein gewöhnlicher Low Gold Spieler sollte diese Winrate schon erreichen können. \n\nUnterschätze unsere besten Spieler nicht ;P","replies":[]}]}]}]}]}]}