{"poster":"znshadow","date":"2018-06-13T01:40:17.525+0000","title":"Ich bekomme es einfach nicht gebacken! Bin ich in der Bronzehölle?","subforum":"Ligen & gewertete Spiele","embed":{"description":null,"url":"https://media.lols.gg/s/mpwxbn123270.png","image":null},"up_votes":2,"down_votes":2,"body":"Hallo werte Community!\n\nGibt es die Elo H&ouml;lle wirklich? Ich habe das Gef&uuml;hl ich stecke mitten drin.\n\nSich ehrlich selbst zu analysieren ist so eine Sache. Oft sucht man die Fehler bei anderen Mitspielern. Daher hege ich die Hoffnung von euch eine ehrliche Meinung zu bekommen. Bestimmt wird mir die eine oder andere  Beitrag nicht immer gefallen aber ich wage diese Diskussion. \n\nWoran liegt es das ich Probleme habe auf zu steigen?\n\nAbout me!\n- Seid Season 4 spiele ich fast ausschlie&szlig;lich Support!\n- Ich spiele gerne Poke Support am liebsten Vel&#039;Koz.\n- Ich versuche, wenn das Game schlecht l&auml;uft, viel Vision f&uuml;r mein Team zu generieren\n- Nicht so oft zu sterben ist mein Ziel! KDA: 4.7 / 5.6 / 10.4\n- [Selbstreflexion der letzten 10 Games!](https://up.picr.de/32959473yn.jpg)\n- Ich schaue mir PlayersHUB oder Flotidus an um besser zu werden\n_____\nWas habe ich schon ver&auml;ndert!\n- Ich nutze nun entz&uuml;nden statt ersch&ouml;pfen\n- Liandrys Qual soll mein erstes Ziel sein\n- [ver&auml;ndertes Intembuild](https://up.picr.de/32959504sm.jpg)\n_____\nWas ich festgestellt habe zu verbessern!\n- Positionierung, ich stehe oft falsch!\n- wann habe ich wo zu sein!\n- Counter Pick! F&auml;llt mir schwer!\n- meine Map awareness muss besser werden\n- ab und an zu kill geil!\n- zur rechten Zeit das richtige warden!\n- Jungel timer!\n_____\n\n60 bis 70 % meiner Games laufen im Early recht stabil! Ich versuche den gegnerischen ADC zu zonen und diesem DMG zu verpassen. Meist farmt mein ADC zu schnell! OK den LV2 Vorteil zu bekommen ist recht nett! Aber die meisten ADC&#039;s farmen was das Zeug hergibt. Last hitten bzw. die Lane auf der stellt zu halten k&ouml;nnen die wenigsten. Wir stehen meistens vor dem gegnerischen Tower! Das bedeutet das der gegnerische Jungler recht schnell uns besuchen wird. Das wei&szlig; ich und deswegen setze ich kontinuierlich Wards im Riverbush und bitte dauernd meinem ADC auch seinen Ward zu setzen! Auch wenn das early Game nicht immer passt haben wir das oft im Griff.\nMeine Botlane feedet recht selten. Hin und wieder passiert es mal ....\n\nWenn unser Jungler schlecht ist, dann ist meist auch das Game verloren! Das n&auml;chste Problem sehe ich mit den Smurfern. Die versauen einem total das Game. Kaum hat man 2 Games gewonnen schon bekommt man von einem Smurf eine auf den Deckel. Das ist total frustrierend. Da hast du in deinem Game ein AFK farmer und im Gegner Team einen Support der dir jeden Ward s&auml;ubert. Die Bronze Division ist so unbest&auml;ndig. Da tummelt sich alles.\n\nIch bin echt ratlos was ich machen soll!\n\nZN \n\n_____\nMeine Statistik!\n[op.gg ](http://euw.op.gg/summoner/userName=znshadow)\n[wardscore](http://wardscore.loltools.net/?name=znshadow&amp;region=euw)\n[Mastery Points](https://www.masterypoints.com/image/profile/znshadow/euw)","replies":[{"poster":"Pandeonor","date":"2018-06-13T07:52:58.023+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=znshadow,realm=EUW,application-id=ip27PlEH,discussion-id=KNtyjLFN,comment-id=,timestamp=2018-06-13T01:40:17.525+0000)\n>\n> Was ich festgestellt habe zu verbessern!\n> - Positionierung, ich stehe oft falsch!\n> - wann habe ich wo zu sein!\n\n\nDas ist es m.E. bei Dir. Ich würde das an Deiner Killbeteiligung festmachen. Du hast nur in 2 Deiner letzten 12 Spiele eine Beteiligung von über 50%. Im Schnitt liegst Du vielleicht bei 40% Killbeteiligung [für Vel in den letzten 10 Spielen werden 34% im Schnitt angegeben]. Das ist zu wenig. Ich denke entweder stehst Du am falschen Ort auf der Map oder Du stehst als Vel in einem Fight schlecht was zu einem frühen Tod führt anstatt zu einem Kill/Assist. Oder Du stehst sehr passiv und bist einfach nicht da wenn man Dich braucht.\n\nDu kannst Dir auch das noch ansehen:\nhttps://your.gg/euw/summoner?s=znshadow\nhttps://www.leagueofgraphs.com/de/summoner/performance/velkoz/euw/znshadow\n\nIch meine, meine eigene KB ist auch nicht sonderlich gut, aktuell nur rd. 40%, war schon mal besser. Bei Dir sieht das noch weniger gut aus und wirkt sich m.E. auch auf die Objectives aus, für welche Die Statistik angibt das es da noch Luft nach oben gibt. In den letzten 10 Spielen war es offenbar schon etwas besser, aber auf 69 Matches gesehen war Deine Beteiligung an Fights unterirdisch und die Angriffslust auf Objectives gerade einmal Bronze3 Tier (lt. o.a. your  gg). Um klar aufzusteigen solltest Du an diesen Beiden Punkten arbeiten.","replies":[{"poster":"SSI CptHaunted","date":"2018-06-13T09:25:57.908+0000","up_votes":1,"down_votes":1,"body":"Die mögliche Killbeteiligung ist von Match zu Match unterschiedlich und hängt auch immer davon ab, wann und wo gekämpft wird. Spiele ich meine Lane sehr ausgeglichen und es kommen kaum Kills zustande während auf den anderen beiden Lanes Blut ohne Ende fließt habe ich am Ende auch ne niedrige Killbeteiligung ohne großartig etwas falsch gemacht zu haben.","replies":[{"poster":"Pandeonor","date":"2018-06-13T10:20:47.029+0000","up_votes":2,"down_votes":0,"body":"Möglich. \n\nEs ist jedoch eine Vergleichsrechnung mit anderen welche den gleichen Champ, auf der gleichen Rolle und/oder im gleichen Tier (hier Bronze 3) spielen. Wenn er auf 70 Spiele gesehen _deutlich_ unter dem Schnitt liegt sehe ich da jedoch Luft nach oben. Lt your.gg ist er was das angeht ein C-Tier (A wäre Durchschnitt für Bronze 3 Supporter, S und SS wäre ein Hinweis auf Überdurchschnitt).\n\nEr steht bei SS was Sichtwertung angeht. Das Team kann nichts daraus machen und er selbst auch nicht. Meines erachtens sollte er mehr auf anderes achten und sich das gute Warden für höhere Elos aufsparen. ^^","replies":[{"poster":"Nordwolf87","date":"2018-06-13T10:53:41.346+0000","up_votes":1,"down_votes":0,"body":"Your.gg ist ja ne echt coole seite!! Danke für den hinweis! Jetzt weiß ich besser worauf ich achten muss!! Bin bei objectives und Vision SS-Tier, Survival B aber Growth und combat nur C! Hier muss ich zu arbeiten beginnen! :D Echt gute hinweise!!!","replies":[{"poster":"Pandeonor","date":"2018-06-13T15:27:15.082+0000","up_votes":1,"down_votes":0,"body":"Sie ist koreanisch  Beta und gibt es nicht als deutsche Übersetzung. Ein Fundstück, die kennt keiner ;)","replies":[{"poster":"Nordwolf87","date":"2018-06-14T07:13:53.043+0000","up_votes":1,"down_votes":0,"body":"Bei mir ist die eh auf englisch o_O","replies":[]}]},{"poster":"Schokohörnchen","date":"2018-06-13T11:59:47.648+0000","up_votes":1,"down_votes":0,"body":"\\o/ Dies echt lustig. Die Seite predictet/ expected mich am Ende der Season in Gold 2 - Platin 5","replies":[{"poster":"Nordwolf87","date":"2018-06-13T12:08:38.818+0000","up_votes":1,"down_votes":0,"body":"Haha du bist eine überlebenskünstlerin mit guten augen laut der Seite xD\n\nMich S V - S II \\o/","replies":[{"poster":"Schokohörnchen","date":"2018-06-13T12:09:52.246+0000","up_votes":1,"down_votes":0,"body":"\\o/ Wuhu, wir rasten bis zum Season Ende noch richtig aus!","replies":[]}]}]}]}]}]},{"poster":"znshadow","date":"2018-06-14T01:38:44.668+0000","up_votes":1,"down_votes":0,"body":"Echt Toll \n\nDanke für deinen Post!\nKannst du grob erklären wie \"your gg\" man nutzt?\n\nIch meine der Graph scheint recht logisch zu sein! \n\nAber die andren Bereiche die finde schwierig zu nutzen.\nZB: \"Recent Matches\"\n\nDanke nochmal\n\nZN","replies":[{"poster":"Pandeonor","date":"2018-06-14T14:10:12.515+0000","up_votes":1,"down_votes":0,"body":"Bei den recent matches kannst Du auf \"soloQ\" stellen, dann siehst Du die letzten 24 Spiele in SoloQ. Du kannst \"more Matches\" drücken um weitere aufzurufen. Das ist insbesondere zu Beginn wichtig, beim ersten Nutzen (entfällt bei Dir), weil nur die Daten der Matches welche man auf diese Art einmal geladen hat auch oben in der Grafik berücksichtigt werden. [Beim ersten aufrufen hat die Seite meist nur eine Handvoll Spiele in SoloQ geladen und muss der Seite erst einmal sagen das es mehr Spieldaten abrufen soll um die obige Auswertung damit zu füttern.]\n\nDu kannst bei jedem der Matches draufdrücken und in der sich öffnenden Grafik zwischen Dir und dem Gegner (auf der gleichen Spielposition) auf \"Analyze\". Dann erhältst Du entsprechend der Gesamtgrafik oben eine Netz-Grafik für das einzelne Match im Vergleich (zum gegnerischen Support in Deinem Falle). Ist eine nette Spielerei. MVP (most valuable player) ist der Beste Spieler des Gewinner-Teams und \"Hard fight\" i.d.R. der Beste Spieler des Verlierer-Teams.\n\nIn der Rubrik darüber mit den \"up´s and downs\" ist wohl eher eine Einschätzung Deiner Tagesleistung. Bei Dir steht \"unstable\", Du lieferst also recht unterschiedliches ab. \"Team Matching Luck\" versucht Deine Teammates zu bewerten. Die komplette Rubrik halte ich jedoch für relativ wenig aussagekräftig, da es m.E. bei vielen verlorenen Matches schlechte Teammitglieder und umgekehrt bei vielen Wins bessere ausweisen wird schätze ich. Bei Dir steht \"Worst\" - also richtig schlechte mates in den letzten 10 Spielen, da Dein Durchschnitt bei 1,11gg steht und das des Teams bei 0,98gg.","replies":[]}]}]},{"poster":"OPChampsSucks","date":"2018-06-13T02:00:26.815+0000","up_votes":1,"down_votes":6,"body":"alter schwede hast du dir viel mühe gemacht mega respekt vor dir\n\nbtw von PlayersHUB würde ich dir prinzipiell abraten ich finde er gibt sehr schlechte Tipps in den videos da sollte man ggf andere leute suchen aber das ist meine Meinung ^^ \n\nrylais > liandrys\n\nkillgeil ist noch ok. in bronze ist das teilweise auch zwingend notwendig.\n\naußerdem 1 kill besser als kein kill \n\nRiverbush waren nicht immer sinnvoll. viele jungler haben nen gapcloser oder generell eine möglichkeit schnell da zu sein. bis du den jungler gesehen hast ist er schon 10x da\n\ndu kaufst eindeutig zu viele control wards. gezielter und besser platzieren.\n\ndein sekundären pfad ändern\n\nQ maxxen und nicht W (weiß jetzt nicht ob das einmalig bei dir vorkam habs nur grad auf op.gg gesehen daher)\nals support ist das unverzichtbar.\n\nda wo du manchmal stirbst hast du als supporter gar nichts zu suchen erst recht nicht min 4. da ist die gefahr für nen gank recht hoch bzw der gegnerische jungler könnte n countergank ansetzen.\n\nin minute 0-1 platziert man für gewöhnlich kein ward. jeder der weiß wo man sich am anfang positioniert weiß das man  keinen ward benötigt solange man keinen invade ansetzt. \n\ndu scheinst potts im early zu unterschätzen. versuchs mal damit ^^\n\nDu musst bedenken das du trotz allem ein supporter bist. meistens kannst du mit den builds die du wählst kein guter supporter sein da du keine unterstützenden items hast. deswegen sagte ich auch rylais > liandrys\n\nbin gerade nicht up to date was KdB angeht sonst würde ich mir n game von dir anschauen kennst das ja challenger im brain und bronze im game (wenn du playershub schaust müsstest das kennen) \n\n","replies":[{"poster":"Marksmansitter","date":"2018-06-13T07:13:30.938+0000","up_votes":5,"down_votes":1,"body":"> du kaufst eindeutig zu viele control wards. gezielter und besser platzieren.\n\nAls support kannst du nie genug pinkwards haben","replies":[{"poster":"SSI CptHaunted","date":"2018-06-13T09:22:26.323+0000","up_votes":1,"down_votes":0,"body":"Kommt drauf an. Wenn ich meine Pinks so setze, dass mein Lane-Gegner das a) mitbekommt und b) einfach direkt wieder zerstören kann sodass ich wieder n neuen setzen muss verschwende ich Gold und gegeriere keine wirksame Vision.","replies":[{"poster":"Marksmansitter","date":"2018-06-13T10:30:30.983+0000","up_votes":1,"down_votes":0,"body":"Das ist für mich kein wirkliches Gegenargument, man muss bei allem auch etwas nachdenken","replies":[{"poster":"SSI CptHaunted","date":"2018-06-13T11:56:13.772+0000","up_votes":1,"down_votes":0,"body":"Jap, aber allein die Anzahl an Pinkwards sagt so ziemlich 0 aus.","replies":[{"poster":"Marksmansitter","date":"2018-06-13T13:06:54.342+0000","up_votes":1,"down_votes":0,"body":"Wenn einer pro spiel 1 pink stellt und der andere 4 oder 5 würde ich schon sagen das die letztere person eher verstanden hat wie wichtig pinks sind","replies":[{"poster":"SSI CptHaunted","date":"2018-06-13T15:07:47.100+0000","up_votes":1,"down_votes":0,"body":"Kann man pauschal so nicht sagen. Wenn der 1 Pink über einen längeren Zeitraum stand, die 4 oder 5 jedoch nur jeweils 10 Sekunden, hat der eine mehr bewirkt.","replies":[{"poster":"Marksmansitter","date":"2018-06-13T15:15:35.700+0000","up_votes":1,"down_votes":0,"body":"Doch kann man weil 1 pink in jedem Fall viel zu wenig für ein game ist, du verstehst scheinbar nicht was man alles aus dem visionvorteil rausholen kann, so ein pink muss auch nicht 20 minuten stehen, wenn der pink für eine situation gestellt wurde die 30 sekunden gedauert hat, war es das auch schon wert. \n\nIch habe mal dein Profil auf op.gg überflogen und da sieht man im overlay direkt wieviele pinks gekauft wurden und bei dir finde ich in der ganzen history besonders als jungler keinen einzigen..","replies":[]}]}]}]}]}]}]},{"poster":"znshadow","date":"2018-06-14T01:46:18.954+0000","up_votes":1,"down_votes":0,"body":"Q maxxen und nicht W \nIch werde das ändern!\n\n>  potts im early zu unterschätzen. versuchs mal damit\n\nStimmt!\n\nDanke\n\nZN","replies":[]},{"poster":"Nordwolf87","date":"2018-06-13T13:08:37.947+0000","up_votes":1,"down_votes":0,"body":"Du schreibst da tw bisschen unsinn.\n\n1. Killgeil ist auch bzw gerade in Bronze als support nicht gut. Gerade da brauchen die Carries das Gold, da ihr CS-Gold im normalfall geringer ist als in high elo. Und auch killgeil generell nicht da Objectives > kills. Wenn man killgeil ist chased man zu viel und lässt sich leichter baiten. Das ist sinnvoll von \"klein auf\" zu lernen.\n\n2. Zum warden : marksmaniäsitter hat recht, zuviele Pinks ist fast noch möglich, sie sollten aber auch klug gesetzt werden. Und es ist durchaus sinnvoll in min 0 oder 1 ein ward zu stellen um den gegnerischen jgler aufzudecken bzw den buff zu warden. Außerdem sind momentan lvl2 ganks bei vielen champs möglich, sprich ein frühes ward kann leben retten.","replies":[]}]},{"poster":"i own hookers","date":"2018-08-28T07:53:21.827+0000","up_votes":1,"down_votes":0,"body":"Wenn man am reinpushen ist auf der Bot, nützt es nichts den Riverbush zu warden, weil wenn man den Jungler dann kommen sieht ist es trotzdem bereits zu spät. Ich weiss viele Leute, sogar in höheren Elos, machen das so, aber du musst das Ward weiter oben hinstellen (etwas weiter unten als bei dieser Krabbe).\n\nSonst weiss ich jetzt grade nicht, was ich noch für Tipps geben kann, bin auch nur Silber 3 (Aber ebenfalls Support-Main).","replies":[]},{"poster":"Released Ape","date":"2018-06-13T12:51:38.515+0000","up_votes":1,"down_votes":0,"body":"Allgemeine Tipps zu deinem Vel'koz:\n\n- Gehe beim ersten Runen Baum mal auf \"Celerity\" mit dem Movespeed verpasst du weniger, kommst eher aus brenzligen Situationen raus, usw. und etwas AP gibt die Rune ja immernoch\n\n- Beim zweiten Baum solltest du von \"Domination\" wegkommen, vor allem weil \"Cheap Shot\" einer der schlechtesten Runen ist und nur wenige Champs die halbwegs nutzen können. Versuch entweder \"Resolve\" (=Mehr tankyness mit bone plating und chryalis) oder \"Inspiration\" (magical footwear und biscuit delivery/cosmic insight). Inspiration würde sich mit magical footwear anbieten, weil du dazu neigst Schuhe ohnehin sehr spät zu kaufen - würde also nur ein Zugewinn für dich sein (vor allem sparst du 350 Gold).\n\n- Hör auf Dorans Ring zwischenrein zu kaufen (und das JEDES game zur fast selben Zeit). Wenn du Mana Probleme hast, hast du doch schon das Support Item und Manaflow Band. Wenn es gar nicht geht hol dir ein Manaitem und verschwende nicht immer 400 Gold für Dorans\n\n- Probiere \"Q\" statt \"W\" als erstes zu maxxen und richtig geschossen kannst du damit die Gegner viel besser Poken. Die \"W\" zu maxxen hat keinen großen Sinn, damit könntest du nur die Wave schneller pushen und das würde in der Midlane immerhin etwas mehr Sinn machen, wobei auch dort eher Q gemaxxt wird.\n\n- ... ich könnte noch etwas fortführen. Aber ich denke du kommst sicher auch auf die andere Dinge von selbst. Wünsche dir viel Erfolg! \n\nPS: Für individueller Tipps bezüglich roamen, Lane Verhalten, etc. müsste man 1-2 Replays sehen.","replies":[{"poster":"znshadow","date":"2018-06-14T01:16:52.305+0000","up_votes":1,"down_votes":0,"body":"Hallo Wrong ...\nich bin mir nicht sicher ob das was du mir rätst gut ist!\n\nIch lege mal meine Gedanken offen:\n\n10 AP\t\t>> Dolch des Zauberdiebs\n30 AP\t        >> Argus' Vermächtnis\n35 AP      Ergebnis\n\nSchadensberechnung Plasmaspaltung:\n80\t\tGrundschaden\n21\t\t60% AP\n15\t\tDirekter Schaden\n20\t\tnach einer Sekunde\n136      Ergebnis\n 30\t\tArkaner Komet\n  7\t\t20 % AP\t\n\nim Optimalfall!\n173 DMG / Q\n________________________________________________________________________________\n\n1,26 AP\t\t  >> Flinkheit (525*1,5% = 7,875 * 16%)\n10    Ap\t\t  >> Resolve\n10    AP\t\t  >> Dolch des Zauberdiebs\n\t\t15 AP >> Chrysalis\n21,26 AP      Ergebnis\n\nSchadensberechnung Plasmaspaltung:\n80\t\tGrundschaden\n12,756\t\t60% AP\n20\t\tnach einer Sekunde\n112,756 Ergebnis\n 30\t\tArkaner Komet\n  4,252\t\t20 % AP\t\n\nim Optimalfall!\n147,008 DMG / Q\n\nIch verliere im Erarly Game ca 15% Schaden\nUnd insgesamt 40 + 25 AP was ca einen Wert von 1250 Gold darstellt\n\nIch bin mir Momentan nicht sicher was Richtig oder falsch ist!\nIch hoffe jetzt mal auf die Community, was die dazu meint!\n\nMit der Q Maxen und Dorans Ring ... da könntest du recht haben.\nDa, denke ich hilft ausprobieren ....\n\nDanke\nfür deine Anmerkungen\n\nZN","replies":[{"poster":"Released Ape","date":"2018-06-14T13:33:39.687+0000","up_votes":1,"down_votes":0,"body":"Du verlierst im \"Early Game\" keine 30 AP durch Argus' Vermächtnis, um die 30 AP zu erhalten musst du die ja erst stacken. Du hast dadurch zu Beginn 0, der Unterschied ist also anfangs fast nicht vorhanden. Lediglich 5 AP von der Rune die du nicht eingerechnet hast stehen den 1-2 AP von Flinkheit entgegen. Beachte auch die anderen Vorteile:\n\n- Du bewegst dich schneller fort (= schneller back auf der Lane, kommst eher raus, besseres roamen)\n- Du stirbst seltener (= kannst dein Golditem häufiger proccen, Gegner kriegen weniger Gold, hast mehr pressure)\n\nIch empfehle es dir gerade, weil es gut ist - es ist keine Pflicht umzusteigen. Aber du unterschätzt 3 % Movementspeed und 65+ Leben zu Beginn des Spiels gewaltig (Chrysalis gibt 50 Leben und Resovle gibt 15-135 Leben abhängig von der Stufe). Auf Stufe 1 hast du somit, weil du Prozentzahlen magst, fast 9 % mehr Leben. Und das ohne Bone P. / Second Wind eingerechnet.\n\nSchau dich mal auf Probuild, ChampionGG, ... das wird dort am meisten als Support ausgewählt und hat sich auch bewährt.","replies":[]}]}]},{"poster":"Vorzüglich","date":"2018-06-13T08:09:21.902+0000","up_votes":1,"down_votes":0,"body":"Von einem Support Main zum anderen...\n\nLerne eine andere Lane. \nAls ADC z.B ist es wesentlich einfacher mit einem schlechten Support zu gewinnen als mit einen schlechten ADC als Lane Partner.\n\nIch habe bisher auch immer ausschließlich Support gespielt in S6 bis Silber III ohne Probleme Heute komme ich wo ich wesentlich besser spiele nicht aus Bronze raus. \n\nIch garantiere dir, das Du mit einer anderen Rolle es wesentlich einfacher haben wirst, wenn du jene nur halb so gut spielen kannst wie Support.","replies":[{"poster":"znshadow","date":"2018-06-14T01:26:54.458+0000","up_votes":1,"down_votes":0,"body":"Tja, \ndas ist was Wahres dran ...\n\nAber ich mag die Position des Supporters\n\nZN","replies":[{"poster":"Vorzüglich","date":"2018-06-14T08:37:09.905+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=znshadow,realm=EUW,application-id=ip27PlEH,discussion-id=KNtyjLFN,comment-id=00060000,timestamp=2018-06-14T01:26:54.458+0000)\n>\n> Tja, \n> das ist was Wahres dran ...\n> \n> Aber ich mag die Position des Supporters\n> \n> ZN\n\nNun so geht es mir auch.\n\nWenn ich dann eine andere Lane spiele, ändert sich daran allerdings Mental auch sehr wenig für mich...\nAlle Lanes spiele ich wie einen \"Support\".\n\nSprich als Toplaner spiele ich GP und Ulte Global.\nAls Mid Karthus schaue ich ebenfalls nach Assists.\nUnd als Jinx ADC behalte ich ebenfalls die Ult für andere Lanes bereit und spiele die eigene sehr save.\n\nIch will damit sagen, picke die passenden Champions die ebenfalls einen gewissen \"Support\" Charakter mitbringen. Und es ändert sich nicht viel von der Mentalität.\nLediglich vom Spieldesign^^\n\nNatürlich vermisse ich auch ab und zu meine alten \"Lieblinge\".\nIch habe allerdings auch nicht ganz den Support aufgegeben, ich mische halt nun lediglich viel öfter andere Lanes dazwischen.","replies":[]}]}]},{"poster":"Nordwolf87","date":"2018-06-13T07:05:45.757+0000","up_votes":1,"down_votes":0,"body":"Möglicherweise solltest du dich Champmaäßig etwas breiter aufstellen.\n\nMMn lebt die Botlane (und im Grunde das ganze Team) davon sich gegenseitig an einander anzupassen.\n\nDu spielst NUR supports die eigentlich keinen *support* bringen sondern nur damage.\n\nIch spiele selbst fast nur supporter und bin der ansicht eine Janna, Sona, soraka oder Lulu gehört in den Champpool jedes Supporters ebenso wie ein Tank à la braum, ali oder ähnliches.\n\nMein Champ-Pool im Ranked: Braum. Taric und Janna. Zur Not: Lulu und Leona (aber nicht so gut, da nur notfallpicks) \n\nAls beispiel: dein Adc pickt twitch, du bist Vel. Der gegner hat ne MF und nen Taric\nDer Taric landet die E auf dich, MF zündet die R. Ihr kippt beide um wie Zahnstocher. Du hältst nix aus, dein adc schon gar nicht und wenn dein Adc das Ziel ist hast du 0,0 um ihn zu schützen. Und DAS ist eigentlich der EINZIGE job eines Supporters.\n\n*Schütze deine Carries - mit Fähigkeiten (shield, heal, CC), deinem Körper (Tank), Wards/Vision und im Notfall mit deinem Leben - für den Damage sind die 4 anderen zuständig*\n\nDas heißt jetzt nicht \"spiel niemals dmg supports\". Es gibt durchaus matchups wo man Dmg spielen kann (zb Ez + Karma gegen einen melee support), aber du kannst dich mit deinem Champpool 0 anpassen, du hast immwr nur Dmg.\n\nZb: Dein Team pickt lauter Champs mit viel Dmg aber ohne hard CC. Die gegner haben nen Yi im Jgl. Wenn du jetzt Vel nimmst ists zu 90% Lose - GG.","replies":[{"poster":"znshadow","date":"2018-06-14T01:43:00.159+0000","up_votes":1,"down_votes":0,"body":"Hossa!\n\nFolgende Champiopns nutze ich \n- Vel'Koz\n- Morgana\n- Karma\n- Lulu\n- Nautilus\n- Blitzcrank\n\nÜben tuhe ich \n- Lux\n- Zoe\n\nAber mein Problem in der Solo Q ist die Pickposition!\n\nWas piche ich auf welcher Position?\n\nGruß\nZN","replies":[{"poster":"Nordwolf87","date":"2018-06-14T07:38:37.663+0000","up_votes":1,"down_votes":0,"body":"Von Zoe kann ich aus pers. Erfahrung nur abraten als supp.\n\nMeinst du die Posi in der Pick reihenfolge?\n\nWenn ja: ich machs so: je weiter oben ich picken muss desto \"sicherere\" picks nehme ich. Zb wenn ich first oder second pick bin, nehme ich was möglichst \"sicheres\" da ich keinerlei infos vom gegner team habe. Bis jetzt war das immer taric. Je später ich piclken kann desto mehr weiß ich vom gegner und von den mates. Da kann ich dann zb wenn der gegner ne MF hat gut mit braum kontern. Oder wenn er einen melee supp hat und mein Adc ez spielt mal ne karma oder janna nehmem um zu poken.\n\nLulu nehm ich zb wegen ihrer W nur wenn wir unbedingt nen hard CC brauchen. Aber nie ohne infos üvers gegnerteam.\n\nAber das sind alles sachen die Pre 8.11 gegolten haben. Ich werde janna einmotten müssen und eher Ali lernen bzw vl lulu als poke auf dmg spielen mit Q max und abgesehen von ardent und redemption auf dmg bauen, aber den build muss ich erst in normals testen ob der funzt","replies":[]}]}]},{"poster":"Uaireagh","date":"2018-06-13T05:00:17.450+0000","up_votes":1,"down_votes":0,"body":"Well, vielleicht solltest du dir wirklich einfach einen Coach suchen, die kosten zwar Geld, aber wenn die Ranked so wichtig ist?\nSeit Season 4 Bronze ist wirklich hart, bzw wenn du dir schon Tipps holst, würde ich darauf tendieren das dein Skill sehr weit unten ist( sry nur meine Überlegung,da man eigl sehr leicht Silber kommt ^^)\nSonst schau dir sau viele Replays an, Spiel bitte andere Rollen, support in Bronze Silber ist schlimm","replies":[{"poster":"znshadow","date":"2018-06-14T01:43:47.768+0000","up_votes":1,"down_votes":0,"body":"Das ist schon in Arbeit ...\n\nZN","replies":[]}]},{"poster":"DLRH Mr Lacoste","date":"2018-06-13T07:55:02.052+0000","up_votes":1,"down_votes":0,"body":"Eigentlich solltest du einen richtigen Supporter spielen, der deinen ADC richtig peelen kann. \nAber da du in Bronze bist, wo man alles Spielen kann, gebe Ich dir Tipps für dein Vel.\n\nVersuch mal richtig zu bauen. Probiere doch mal ein Ludens first Item, einfach weil du mehr Mana hast und dadurch mehr Poken kannst. Kauf dir auch Magic Pen Boots.\nEigentlich maxt man die W auf Vel (wenn man Mid spielt), als Support kannst du die Q maxen und versuchen aus der sicheren entfernung zu poken.\n\nWas mir sehr geholfen hat um aus Bronze zu kommen, war das verstehen der Wavecontrol. Spiel doch mal Vel midlane, da kannst du mehr machen als wenn du Support spielst.\n99% in Bronze wissen nicht wie ein Slowpush funktioniert oder wann man die Wave pushen soll oder freezen sollte. Die meisten sind immer am pushen, statt zu freezen und nur lastzuhitten.\n\nSchau dir mal paar YouTube Videos zu Wavecontrol an. Wenn du es richtig gut beherrst, dann kannst du als Midlaner sehr gut roamen, währen du keinen Farm oder kaum farm verlierst. Die meisten gehen Roamen, verlieren eine ganze Wave midlane, gehen back und verlieren die 2. Wave.\n\nWenn du die Fehler deiner Gegner zu deinem Gunsten ausnimmst, ist das Spiel gewonnen.\n\nIch war 2 Jahre Bronze und habe dann angefangen auf meine Fehler zu achten und mir etliche Videos angeschaut wie man wirklich bauen sollte und Wavecontrol etc. Bin in paar Monaten von Bronze 4 nach Gold 5 alleine gekommen und es geht weiter bergauf. Weil die meisten in dieser Elo eben nichts mit Wavecontrol oder Slowpush anfangen können.","replies":[{"poster":"znshadow","date":"2018-06-14T01:34:38.590+0000","up_votes":1,"down_votes":0,"body":"Hi DLRH Mr Lacoste,\n\nLudens ist ja richtig teuer! Wäre da nicht \"Shurelyas Träumerei\" eine Alternative?\n\nMagic Pen Boots >> OK!\nQ maxen  >> OK\n\nWavecontrol als Support !? Schwierig!\n\nDanke für deinen Post\n\nZN","replies":[]}]},{"poster":"BigBeardD","date":"2018-06-13T11:49:24.130+0000","up_votes":1,"down_votes":0,"body":"Ich habe es geschafft aus Bronze rauszukommen. Ich musste wirklich gut Spielen um die ganzen IDIOTEN (welche man oft im Team hat) zu carryn. Was erhoffst du dir von einem Aufstieg?\n\nBin jetzt Silber 2 und finde ,dass dort noch mehr Trolls rumlaufen. \nSo wie es bei dir aussieht versuchst du ZWANGHAFT aus Bronze rauszukommen. Spiel einfach das Game und habe Spaß dabei und dann wird es schon klappen.\n\nUnd was soll ich denn sagen, nach einem 10 WINSTREAK jetzt fast nun nurnoch LOSE. Entweder die Spiele sind so mega easy oder man wird einfach vom Gegner überrannt!","replies":[{"poster":"znshadow","date":"2018-06-14T01:25:35.513+0000","up_votes":1,"down_votes":0,"body":"Hi,\nich glaube, das ich nach deiner Logik zu den \"IDIOTEN \" zähle!\nAber ich formuliere das mal anders:\nIch gehöre zu den nicht so performanten Gamern! \nEin Bekannter ist ein Epileptiker und durch seine Tabletten ein wenig eingeschränkt.\nEr hat halt keine gute Performances! Aber er ist ein echt toller und netter Mensch und kein ..... \n\n;)\n\nWenn ich keinen Spaß hätte würde ich das Game deinstallieren.\n\nMeist wird man auf Grund seines Spielens zu irgendeinem Pseudonym tituliert.\nAber ich bin fest der Meinung das fast jeder Gamer sein Bestes gibt ....\n\nZN","replies":[]}]},{"poster":"4 Ever TaIone","date":"2018-06-13T17:43:02.415+0000","up_votes":1,"down_votes":0,"body":"Ich glaube du hast einfach kein Talent","replies":[{"poster":"znshadow","date":"2018-06-14T00:08:38.281+0000","up_votes":1,"down_votes":0,"body":"Hallo!\nDanke das du mich so motivierst!\n\nAber nichts desto trotz, wenn es nur sehr schöne Menschen geben würde dann würde der Einzelne ja einfach nur normal schön sein ODER?\n\nIch meine damit das es doch wichtig ist die Vielfalt zu haben.\nAuch wenn ich in dem einen oder anderem wenig Talent habe, können doch gute Tipps und Strategien einem Helfen gegen die mehr Talentierten zu bestehen. \n\nWeniger Talent als andere zu haben ist denke ich kein Malus.\nIch werfe deswegen nicht die Flinte ins Korn!\n\nIch versuche zu bestehen und stelle mich der Herausforderung!\n\nMachst du das auch?\n\n\nZN","replies":[]}]},{"poster":"Hurbokuhmar","date":"2018-06-13T07:02:57.534+0000","up_votes":1,"down_votes":0,"body":"Um jetzt groß Tipps zu geben müsste man ein Replay sehen, oder mal persönlich wenig tipps geben. aber was bei mir so in Season 3 und 4 das Problem war ist, dass ich nie geroamed hatte. Gerade wenn ihr ständig durchpusht, dann versuche mim Jungler mal den scuttler zu machen, ein Gank in der Mitte oder deep zu warden. Den ADC vorher schreiben care i go roam etc. und dadurch bringste auch die anderen Lanes ahead und die Vision im geg. jungle bringt jedem etwas, gerade mit velkoz sollte man in der Mitte mind. ein Flash rausholen können. ^^","replies":[]}]}