{"poster":"VikingoATR","date":"2018-11-28T12:07:56.968+0000","title":"Graves se juega con autoatake??","subforum":"Guias y consejos","up_votes":3,"down_votes":0,"body":"Hola wenos dias , quiero si saber si graves se lo juega con AA o no es necesario y de paso si alguno tiene algun consejo sobre graves ,se agrdece.","replies":[{"poster":"Lord Maxlum","date":"2018-11-28T14:27:45.478+0000","up_votes":3,"down_votes":1,"body":"Todos los campeones se juegan con AA.","replies":[{"poster":"ToraYasashi","date":"2018-11-28T19:32:11.900+0000","up_votes":1,"down_votes":1,"body":"menos Teemo...","replies":[]}]},{"poster":"GR33NGOBLIN","date":"2018-11-28T17:55:12.078+0000","up_votes":1,"down_votes":0,"body":"yo estoy spameando graves dia nevado desde que salio la cajita, me es imposible sacar una S y si no usas bien el dash te cagan a palos muy facil, tal vez yo sea mas manco de lo que creo, pero no es facil de agarrarle la mano al graves\n\nlo bueno es que no tiene build fija asique casi todo le sirve, un poco de daño, angel y nose que mas, note tambien que si te quedas atras en la partida sos uno menos","replies":[]},{"poster":"Excorpion","date":"2018-11-28T12:30:44.720+0000","up_votes":1,"down_votes":0,"body":"Graves tiene una extraña particularidad... siempre he sentido que su respuesta de autoataque es mucho mas veloz que otros. Por lo que siempre lo juego con AA activado.\nEsto me ha salvado mas de una vez de algun enemigo que me ataque por sorpresa.\nEjemplos son...\n* R de Warwick\n* E de Kayn\n* W de Tristana\n\nEl AA es mas rapido que esas aproximaciones.","replies":[]},{"poster":"IIIIIIIIIIIIIIII","date":"2018-11-28T12:23:16.570+0000","up_votes":1,"down_votes":0,"body":"Yo juego con autoataque desactivado para todos los champ, (aclaro que lo que menos juego es adc) PERO casos particulares son {{champion:202}} y{{champion:104}}  que recargan sus basicos por lo que recomendaria jugarlos sin autoataque antes de desperdiciar algun basico en un target no deseado","replies":[]},{"poster":"Player1 Ryzen5","date":"2018-11-28T12:23:12.737+0000","up_votes":1,"down_votes":0,"body":"Lo jugué solo una vez, y la verdad creo que es fundamental el autoataque. A basicos pega una bestialidad, no parece al principio yo también creía que con esos skills metia un monton, \nDespués de unos minutos se va haciendo cada vez mas y mas bueno en duelos y dps ya se planta contra 2 o 3 tranqui. Osea usa lso skills pero cada vez que tenes un auto tiralo porque la rompe. Eso si fíjate la distancia, los minions que se te atraviesan y el tema de no cancelar el ataque. Es lo poco que saque del campeón ese","replies":[]}]}