{"poster":"Laikan","date":"2016-07-18T17:55:47.449+0000","title":"Es mucho 17 500 puntos","subforum":"Charlas Generales","up_votes":7,"down_votes":3,"body":"Creo que la mayoria de los clubs no van a llegar a dicha cantidad a menos que pongan 2 o 3 dias y es mas cuando llegas a muchos puntos con un club te hechan(ya me paso)","replies":[{"poster":"TyShaD","date":"2016-07-18T18:07:46.455+0000","up_votes":3,"down_votes":0,"body":"Todo se gana poniendole ganas e interés amigo,  hay muchos clubes que están apunto de llegar. Todos empezamos desde abajo :D","replies":[]},{"poster":"MFT Sirius White","date":"2016-07-18T19:25:49.182+0000","up_votes":2,"down_votes":0,"body":"esta bien la cantidad, mi club esta 39 y tenemos 17900 pts","replies":[{"poster":"Laikan","date":"2016-07-18T20:21:46.757+0000","up_votes":1,"down_votes":4,"body":"no me darias un lugar en tu club , soy oro 5 y juego al menos 10 partidas al dia , te lo ruego necesito esa diana =(\nte lo voy  a agradecer toda la vida","replies":[{"poster":"XsR reddaS","date":"2016-07-18T23:23:57.468+0000","up_votes":3,"down_votes":0,"body":"no te rebajes por una skin compa","replies":[{"poster":"Laikan","date":"2016-07-18T23:47:46.758+0000","up_votes":1,"down_votes":1,"body":"pero la quiero :C no es una skin , es la skin","replies":[]}]}]}]},{"poster":"Mitjans21","date":"2016-07-18T18:45:29.768+0000","up_votes":2,"down_votes":0,"body":"Esta bien la cantidad, deberias haber empezado desde el martes, llegaba e incluso sobrepasabas eso, pero supondre que comenzaste cuando dieron el anuncio de la skin, que tambien llegabas si viciabas como loco con tu club, ahora si no llegas y te comienzas a quejar que es mucho, dudo que te tomen en cuenta, y si te sacan de un club, crea uno tu","replies":[{"poster":"XsR reddaS","date":"2016-07-18T23:22:13.618+0000","up_votes":1,"down_votes":0,"body":"si crease un club a estas alturas del partido apenas llega a 4k viciando","replies":[]}]},{"poster":"Annie Botz","date":"2016-07-18T18:25:59.202+0000","up_votes":3,"down_votes":2,"body":"Piensa en un club que está enfocado en perder.\nDonde pierden una partida cada 15 minutos y pensando que el club está lleno (50/50) También tomando en cuenta la cola de emparejamiento 2-5 minutos\ny pensando en que juegas 3 partidas cada 1 hora (pueden ser más si pierdes antes o menos si demoras en perder).\n5 personas en un club = 225 puntos por 1 hora de juego (3 partida en la grieta) el club lleno 2250 en una hora.\nSi lo haces por 5 horas de juego son 11250 (entre los 50)\nActualmente queda 1 día y 12 horas. Si lo hicieras por 10 horas tendrías la skin y te pasarías, aunque claro, para esto tendría que ser un grupo de facebook o algo, donde estén todos activos, por lo menos 10 horas entre este día y mañana (en un horario preestablecido)","replies":[{"poster":"ZanahoriaAsesina","date":"2016-07-18T18:36:57.576+0000","up_votes":1,"down_votes":0,"body":"Los rojos ya avisaron que esto es sancionable.","replies":[{"poster":"Annie Botz","date":"2016-07-18T19:25:42.812+0000","up_votes":1,"down_votes":0,"body":"En que post?","replies":[{"poster":"Condor","date":"2016-07-18T21:38:03.425+0000","up_votes":1,"down_votes":0,"body":"Nebo dijo que eso era considerando exploit y por ende sancionable.\nEdit: [Aquí](http://boards.las.leagueoflegends.com/es/c/reclutamiento/Wjbs3EGR-la-taactica-koreana-del-club-s4lty-para-sumar-puntos?comment=000000020000000000000000)","replies":[{"poster":"Annie Botz","date":"2016-07-18T22:07:38.347+0000","up_votes":1,"down_votes":0,"body":"Ah no me había fijado, ya había visto el post pero no la respuesta del rioter, gracias :v","replies":[]}]}]}]}]},{"poster":"lucpro","date":"2016-07-19T05:42:47.182+0000","up_votes":1,"down_votes":0,"body":"Mi club lo logro con un día de sobra solo se necesitan ganas y esfuerzo las cosas se ganan no se regalan","replies":[]},{"poster":"AC Wolf","date":"2016-07-19T05:10:00.650+0000","up_votes":1,"down_votes":0,"body":"mañana mas de 250 club llegaran a la diana\no quizas mas, es cuestión de esfuerzo","replies":[]},{"poster":"Daikan","date":"2016-07-19T01:59:00.744+0000","up_votes":1,"down_votes":0,"body":"Es cuestion de ponerle ganas, hace 3 dias me meti a un club que tenia 6k de pts y ahora tenemos casi 16k...","replies":[]},{"poster":"Condor","date":"2016-07-18T21:25:55.169+0000","up_votes":1,"down_votes":0,"body":"Está bien, cuando avisaron esto mi club tenía 1000 pts, y ahora tenemos 18k. :)\n\nNo es falta de tiempo es la disposición que tiene la gente.","replies":[]},{"poster":"Bustatos xD","date":"2016-07-18T18:06:03.321+0000","up_votes":1,"down_votes":1,"body":"Bueno creo que esa cantidad esta bien, tampoco creo que riot saque puntos de la nada osea que digan que si le damos 20k de puntos ?...\nBásicamente eso de que la mayoría no sacaran la skin puede ser pero es solo por que no se esforzaron, disculpa si suena como despreciativo pero es lo que creo. Ya que con mi club logramos sacar la cantidad de puntos necesaria en 2 días y otros Tm la sacaron antes incluso que publicaran la recompensas.\nOtra cosa es que estamos en el puesto 55 creo por lo menos la ultima vez que me conecte y teníamos los 17.5 k sacando la cuenta.\n55 que son los club que se supone que tienen el puntaje, x 50 que son el cupo máximo mas el resto de gente que lograran llegar creo que se regalaran unas 3500 a 5000mil skin.","replies":[]},{"poster":"AgustinHDXD","date":"2016-07-18T18:01:18.529+0000","up_votes":1,"down_votes":4,"body":"Mucha razón quien llega en 5 días a 10.000.000 puntos","replies":[]}]}