{"poster":"DeaDiplos","date":"2018-08-12T20:32:07.079+0000","title":"Bajones de FPS","subforum":"Charlas Generales","up_votes":5,"down_votes":0,"body":"No se si sere yo pero ultimamente en los 2 ultimos parches del juego me estan bajando los FPS de 150 (a 09 o 01) (antes de que alguien diga es tu pc les aseguro 100% que no es la pc) a alguien mas le pasa ? O tienen algun consejo para evitar tantos bajones de FPS ?","replies":[{"poster":"dindindindin","date":"2018-08-13T05:25:19.856+0000","up_votes":1,"down_votes":0,"body":"¿Y riot a dado respuestas sobre esto? \nami se me paso cuando deje de jugar con Discord Abierto xd\npero para los que juegan normal nose que podra ser pero este error me comenzo  el martes 7 de agosto :( \ny tengo 3 amigos que juegan siempre conmigo que tienen las medias maquinas de pc que El lol Tiene problemas con los fps \ny tambien que el problema con lo Servidores estos es que me empieza a afectar despues de las 9 pm el resto del dia me corre fenomenal :c","replies":[]},{"poster":"TheShaderX","date":"2018-08-13T04:57:28.444+0000","up_votes":1,"down_votes":0,"body":"a mi me pasa que estoy jugando y tengo por ejemplo un problema de conexión y reconecto y todo bien y de la nada me anda para el lado del ojete perdonen por el lenguaje soez pero es que estoy hasta las pelotas que me pase yo juego con un bloqueo de fps de 120 y de la nada 80 60 incluso 40 o 50 y ustedes sabran que cuando se rompe un cap de fps la pantalla comienza a mostras como micro tirones y la pc me anda de 10 juego gta v que es un juego mas exigente y me anda a 60 clavado como es posible que un juego de bajos requerimientos como el lol me ande tan para el lado del culo.","replies":[]},{"poster":"IIIIIIIIIIIIIIII","date":"2018-08-13T00:04:53.729+0000","up_votes":1,"down_votes":0,"body":"No se, yo con cada parche tengo 5 fps menos","replies":[]},{"poster":"VaporAx","date":"2018-08-12T22:25:40.160+0000","up_votes":1,"down_votes":0,"body":"En lo personal, se me congela sin razones, y luego sigo con los 80 fps normales.","replies":[]},{"poster":"NLG Walter","date":"2018-08-12T22:06:50.075+0000","up_votes":1,"down_votes":0,"body":"Me pasa que se congela la imagen, bajo de 80 a 40 FPS y luego retoma normalmente.\n\nDesde el parche 8.14 de LoL.","replies":[]},{"poster":"Vamos a Sennar","date":"2018-08-12T22:05:32.732+0000","up_votes":1,"down_votes":0,"body":"A mi me pasa que se congela la pantalla y luego sigue a 60 normal. Me pasa en la mayoría de las team fights :c","replies":[]}]}