{"poster":"TTK Dreadnought","date":"2017-10-31T09:32:30.339+0000","title":"Thoughts from a 1 Million Mastery Illaoi.","subforum":"Story, Art, & Sound","embed":{"description":"An inside look at the whats, whys, and hows of making League of Legends.","url":"https://nexus.leagueoflegends.com/en-us/2017/10/choose-the-next-illaoi-skin/","image":"https://nexus.leagueoflegends.com/wp-content/uploads/2017/10/LOL_IlaoiSkinsCampaign_R01-v3_Hp-Tile_1200_s72877ogj5tkjjv24zoo.jpg"},"up_votes":25,"down_votes":2,"body":"First, it&#039;s nice to get this kind of response from riot about a champion who has needed a second skin for a while. I do hope urgot will be following eventually since yorick has gotten a new one now.\r\n\r\n&gt; What have i been personally looking for in a new skin?\r\n\r\n * I&#039;ve been wanting one of two options when it comes to a new skin for Illaoi. \r\n     * One, was to get a skin that made her feel more threatening or felt more serious when playing as, or against. Generally i associated this with an Infernal Illaoi, with tongues of flame as tentacles, Gold/Black/Red Armor and highlights. Tentacle&#039;s slamming would leave the brief burn mark (similar to Infernal Nasus Q), while her R would be a much larger branding on the ground. Or something similar to a Horrowing Skin, where instead of Nagakaborous being the recycler of life, she is the taker of it.\r\n    * The second was something more casual or fun, similarly to Pool Party Illaoi who would have an inflatable kraken instead of an idol and tentacles would either be inflatables or pool noodles. \r\n\r\n&gt;What&#039;s required for a new skin for me?\r\n\r\n        *  Illaoi is most noticeable for her visual and sound effects. Illaoi is loud in both areas. Illaoi&#039;s character model features are focused on the Idol in hand, in addition to the tentacle models. She is also, one of the more vocal champions i&#039;ve played due to her nature of testing an opponents faith through force.\r\n                * Strong clear visual effects\r\n                * Strong clear Sound effects\r\n                * New Models for both tentacles and Illaoi\r\n                * New Vocals, not just a modified VO\r\n                * Models and Animations must flow, but show impact.\r\n\r\n&gt; What is my opinion on Voidbringer Illaoi?\r\n\r\n          * Voidbringer Illaoi&#039;s concept of being a Void Priest for the Voidborn Nagakaborous was a good idea due to it being more of a mirror take on normal Nagakaborous and Illaoi. however, while the tentacle models and character models are decent, the skin gets ruined by the overbearing shades of purple and just a modified VO. Classic Illaoi is adorned with Golds, Blues, Greens, with a bit of Brown. If voidbringer Illaoi had some blues and reds mixed into her color pallet similar to chogath and reksai, it would of been much better. The VO filter, while it helps make the skin fit the theme they wanted, it just doesnt sound very good with the original quotes. I know riot prices the skins a certain way due to the work put into them, but i feel like i got a 950 skin, rather than a 1350 rare skin. I did buy it, but i honestly only use it to match any void champs or color schemes on my team. Otherwise, i use the classic skin.\r\n\r\n----------------------------------------------------------\r\n\r\nWhat are my opinions on the 3 revealed Illaoi concepts? Well, let&#039;s reveal those.\r\n\r\n&gt; **DEEP SPACE ILLAOI**\r\n&gt; _Infected during a mission in space, Deep Space Illaoi and her &ldquo;friend&rdquo; now roam the universe looking to add to their family._\r\n\r\nSo, a few of my friends liked this idea, and i myself own AstroNaut and Astronaut Teemo. It was considered to be my vote. But after some thinking, i realized. It&#039;s just another Voidbringer Illaoi. From what i imagine from the concept art, is similar to what Voidbringer makes me think of. A New model for both Illaoi and tentacles, but also a filtered VO with some new colored effects and recall. It sounds like a nice idea for Illaoi to be corrupt in this way, but it just doesn&#039;t feel different enough from Voidbringer to become my vote and i believe it&#039;s potential just isnt there. In addition, Illaoi becoming an astronaut/space explorer seems a bit too deep space for her, even for an Alternate Universe and i know it&#039;s just concept art, but a space suit looks horrible on her.\r\nI&#039;ll be glad to see it as a 950 skin down the line though. Until then, Nautilus and Teemo will venture through the final frontier on their own.\r\n\r\n&gt; **ADVENTURER ILLAOI (Illaoiana Jones)**\r\n&gt; _She&rsquo;s beaten ancient curses, discovered hidden temples, explored the depths of the ocean, and survived it all unscathed_\r\n\r\nThis was also a good idea to &quot;stay true, but explore&quot;, but this ends up having a &quot;rehashing&quot; feel to it. the model concepts are fantastic. Using a tangle of vines for tentacles, the design for the golden idol is very meso-american-esque which dips into the original conceptual designs for Illaoi to begin with. The tangle of vines spawning from crevices in the image in nice and reminds me of the tentacle spawning from DreadNova Gangplank&#039;s Recall. Some visual effects can include vines spreading when a Tangle slams or when she ults, or maybe other jungle style plants and flowers. However, the color scheme for her, falls too close to her classic skin. I&#039;ll take this as a strong second choice though, simply because its similar to her classic skin which i enjoy so much with some differences. I also cant think of much Vo that could really be too different.\r\n\r\n&gt;** BATTLECAST ILLAOI**\r\n&gt;_Part machine, part human, Battlecast Illaoi fights for the survival of all organics against Creator Viktor&rsquo;s &ldquo;Evolution.&rdquo;\r\n\r\nSo this concept was interesting. I&#039;ve always wondered if &quot;Full Metal Illaoi&quot; could ever be a thing (Similar to Jayce/Pantheon). So far, i do have to say, it&#039;s my favorite concept so far when it comes to potential. First, her outfit is actually pretty sweet looking and it kind of gives her a &quot;i&#039;m a badass&quot; feel. The concept makes it feel like she can take a hit, AND dish it out with the cybernetic components. Illaoi&#039;s original theme of &quot;Live life to the fullest&quot; can be replicated in her will and faith to not only survive on her own, but to help others survive the machine evolution. Next part, the robot head. While this is a concept art, the robot head looks rather weird with the wires hanging out of it, but the robot head in general could look differently to begin with. The other part, is the robotic hand for the tentacle. that completely looks tacky. its the weirdest part about the skin, however, its also the most unique model for a tentacle thus far, although it needs some improvement. I believe it would look better if it was more like something that could be used to rip apart robots that isnt a hand. the rest of the &quot;tentacle&quot; is fine looking. The VO for this skin, has more possibilities due to it being a &quot;resistance&quot; group against a greater threat rather than teaching faith. And with a known enemy, there can be special interactions among other things. so i see this having some flexibility and potential. Visual effects wise, similarly to Adventure Illaoi, wires can spread out from the ground, or broken machine parts could be involved. The color scheme doesnt invade her other skins, nor are they as overbearing as Voidbringer and i dont like how the space looks on illaoi. i think Battlecast Illaoi has the highest potential to be a great skin, however, the hand on the tentacle needs to be messed with more conceptually, and a name better than Battlecast Illaoi must be available.","replies":[{"poster":"Riot DrPh8","date":"2017-10-31T19:57:17.429+0000","up_votes":15,"down_votes":1,"body":"Yooooo!!! Thank you for taking the time to write up your thoughts TTK Techno! I just got around to answering some of the boards posts, and a fellow Rioter referred your post to me to check out. You make a lot of very well thought out points here amigo, and these are all things that we ping pong back and forth during our review meetings. Fistbump!\n\nAlso, just to clarify, we aren't going to just make the skin that wins the votes and then completely toss out the other ideas and never come back to them. This event has clearly struck a chord with players and has brought out some passionate discussions (such as yours!) so we'd be fools to just never revisit the other two skins.\n\nA really cool side effect that we didn't anticipate is that there are a ton of skin ideas players have pitched as a reaction to the vote. I used to spend hours dreaming up skin ideas for Champs as a player, so to see something my team is a part of sparking that creativity is extremely rewarding and humbling. \n\nPlease hit us with feedback throughout the process of the skins creation as well. We're all gonna make something kickass together, so strap in and get comfy!","replies":[{"poster":"Neo7L","date":"2017-11-01T14:52:25.131+0000","up_votes":5,"down_votes":1,"body":"I have a simple request, please give us Wacky Inflatable Arms Tube Man Illaoi. I would laugh all game and it just fits the tentacle slams Soo well. I will not rest until this injustice is resolved!","replies":[{"poster":"Żügżwäng","date":"2017-11-01T17:06:06.426+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Neo7L,realm=EUW,application-id=6kFXY1kR,discussion-id=cAcbc9W1,comment-id=00030004,timestamp=2017-11-01T14:52:25.131+0000)\n>\n> I have a simple request, please give us Wacky Inflatable Arms Tube Man Illaoi. I would laugh all game and it just fits the tentacle slams Soo well. I will not rest until this injustice is resolved!\n\nIllaoi could have a cheap suit and bad haircut to complete the used car salesman look.","replies":[{"poster":"Flemman","date":"2017-11-03T10:19:06.288+0000","up_votes":1,"down_votes":0,"body":"would see it more on a dunkmaster illaoi to be honest, the only 'tentacle looking' thing this skin line can have","replies":[]},{"poster":"Ariel the Cruel","date":"2017-11-01T19:30:01.468+0000","up_votes":1,"down_votes":0,"body":"Corporate Illaoi confirmed? XD","replies":[]}]}]},{"poster":"CleverCactus","date":"2017-10-31T23:55:01.058+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Riot DrPh8,realm=NA,application-id=6kFXY1kR,discussion-id=cAcbc9W1,comment-id=0003,timestamp=2017-10-31T19:57:17.429+0000)\n>\n> Yooooo!!! Thank you for taking the time to write up your thoughts TTK Techno! I just got around to answering some of the boards posts, and a fellow Rioter referred your post to me to check out. You make a lot of very well thought out points here amigo, and these are all things that we ping pong back and forth during our review meetings. Fistbump!\n> \n> Also, just to clarify, we aren&#x27;t going to just make the skin that wins the votes and then completely toss out the other ideas and never come back to them. This event has clearly struck a chord with players and has brought out some passionate discussions (such as yours!) so we&#x27;d be fools to just never revisit the other two skins.\n> \n> A really cool side effect that we didn&#x27;t anticipate is that there are a ton of skin ideas players have pitched as a reaction to the vote. I used to spend hours dreaming up skin ideas for Champs as a player, so to see something my team is a part of sparking that creativity is extremely rewarding and humbling. \n> \n> Please hit us with feedback throughout the process of the skins creation as well. We&#x27;re all gonna make something kickass together, so strap in and get comfy!\n\nWhy does Adventurer Illaoi have a wooden thing beneath the vine?","replies":[{"poster":"LostFr0st","date":"2017-11-09T14:20:27.935+0000","up_votes":1,"down_votes":0,"body":"It's probably an ancient drainage hole from some tomb's water system.\n\nThe other skins will probably need something like that too for immersion.","replies":[]}]},{"poster":"GhostOfShrimpmas","date":"2017-11-07T05:51:19.263+0000","up_votes":1,"down_votes":0,"body":">Also, just to clarify, we aren't going to just make the skin that wins the votes and then completely toss out the other ideas and never come back to them. This event has clearly struck a chord with players and has brought out some passionate discussions (such as yours!) so we'd be fools to just never revisit the other two skins.\n\nThis feels _really_ hard to believe, though. There used to be a fairly regular cadence of newer champions getting new skins, but that ended with Kindred, then Illaoi was completely skipped over, and since then, Jhin has gotten 3 (!) new skins but all other champions who've been released or relaunched in the last two years have been more or less abandoned. \n\nI'd love to believe that we'll see these others at some point, but for now they're kind of just hanging around with Dunkmaster Illaoi and Dragon Master Swain in the big bucket of neat things that will probably never happen.","replies":[]},{"poster":"TTK Dreadnought","date":"2017-11-02T05:48:11.894+0000","up_votes":1,"down_votes":0,"body":">Yooooo!!! Thank you for taking the time to write up your thoughts TTK Techno! I just got around to answering some of the boards posts, and a fellow Rioter referred your post to me to check out. You make a lot of very well thought out points here amigo, and these are all things that we ping pong back and forth during our review meetings. Fistbump!\n\nGlad that i caught the groups attention. I've worked with Dev Groups before so it's nice to see when i get a reply and find out i was on the right track with ya'll. Fistbump!\n\n>Also, just to clarify, we aren't going to just make the skin that wins the votes and then completely toss out the other ideas and never come back to them. This event has clearly struck a chord with players and has brought out some passionate discussions (such as yours!) so we'd be fools to just never revisit the other two skins.\n\n>A really cool side effect that we didn't anticipate is that there are a ton of skin ideas players have pitched as a reaction to the vote. I used to spend hours dreaming up skin ideas for Champs as a player, so to see something my team is a part of sparking that creativity is extremely rewarding and humbling.\n\nI was aware of this, as there are plenty of ideas from fun ones (Pool Party and Wacky Saleswoman Illaoi), holiday (Infernal/Harrowing Illaoi, Snowday Illaoi), and a few others like Full Metal Illaoi (Similar to Jayce's Full Metal Skin) and the highly referenced DunkMaster Illaoi. and those are just a few as i keep a list of concepts on my computer (Got to do something to kill time between games)\n\n>Please hit us with feedback throughout the process of the skins creation as well. We're all gonna make something kickass together, so strap in and get comfy!\n\nI planned to. i want the winning skin to be something that i'll be proud to spam and not something i buy just to match a color scheme or theme.","replies":[]},{"poster":"Ariel the Cruel","date":"2017-10-31T22:32:08.183+0000","up_votes":1,"down_votes":0,"body":"If this has been answered elsewhere, I apologize (I haven't found it).\nBut what *is* the scope with the Skin?\n\nI agree with OP about the potential of the skins. Which is why I *wouldn't* vote Battlecast if you're only looking at a 520/950 range.","replies":[{"poster":"TTK Dreadnought","date":"2017-11-01T19:06:01.988+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ariel the Cruel,realm=NA,application-id=6kFXY1kR,discussion-id=cAcbc9W1,comment-id=00030000,timestamp=2017-10-31T22:32:08.183+0000)\n>\n> If this has been answered elsewhere, I apologize (I haven&#x27;t found it).\n> But what *is* the scope with the Skin?\n> \n> I agree with OP about the potential of the skins. Which is why I *wouldn&#x27;t* vote Battlecast if you&#x27;re only looking at a 520/950 range.\n\nit hasnt been answered because in a dev article called \"The State of Skins\" (back from May) and some rioter posts around then, mentioned that they dont aim for a price range or a set number of changes. they make as many details as needed to make the skin feel correct. so if they make battlecast illaoi and didnt plan on doing a new VO for it, but feel that it would be necessary to make the skin feel correct, then they add it to the list of things to do. they price it after the skin is done, based on how much detail was put into it.\n\nessentially, they don't go \"we need three 950 skins this year, and five 1350 skins\". they go \"okay, we need eight skins, what ideas do we have, and what's needed for them?\"","replies":[]}]},{"poster":"        IIZZZUUU","date":"2017-11-01T08:04:25.473+0000","up_votes":1,"down_votes":0,"body":"Deep sea illaoi please. Similar to Ursula from Disney's TLM.","replies":[]},{"poster":"Rayjay Redfang","date":"2017-10-31T22:37:52.437+0000","up_votes":1,"down_votes":0,"body":"Really great job on the skin concepts, seriously. I've been trying to think of a good concept for Illaoi for months and came up with nothing. But these skins, I really love all three and wish each could have the time to be the best they possibly can, especially battlecast and space. Two things: for the space, I think her suit should be a bit more worn looking and second, if the skin voting thing continues, it might be best to make the winner first, but later down the line make the others. Your creations really do get people excited. Thanks for all of you and your team's work, it really does mean a lot as a player.","replies":[]}]},{"poster":"Bilby","date":"2017-10-31T19:55:01.956+0000","up_votes":7,"down_votes":1,"body":"Thanks so much for the thoughtful post! Forgive me for focusing on only one small part of it--\n\nI want to hear more about what you said about the name Battlecast Illaoi & what other options you all might wanna see instead. Those names are placeholder for now, but they might still be the best options in the end. Battlecast is a tough one since she's in that universe but not part of the faction--in the past, we've been inconsistent about theme names & the names of factions within those themes. I think \"Resistance\" sounds cool but think that steps on Resistance Caitlyn. \n\nIn my mind, calling it \"Battlecast\" most clearly indicates what the general look and feel of the skin is gonna be, and anyone who cares more about the story behind the skin will read and find that info. But I could totally be wrong.","replies":[{"poster":"Salson","date":"2017-10-31T22:07:00.149+0000","up_votes":7,"down_votes":0,"body":"Just wondering, but could she be Dread Nova Illaoi.\n\nThe model would be pretty much identical, and she fits the 'pirates in black with space tech' look rather well.","replies":[{"poster":"Bilby","date":"2017-11-03T00:34:13.093+0000","up_votes":2,"down_votes":0,"body":"probably wouldn't go to Dreadnova as a name since that's sort of a different fantasy, but the idea that those two are in the same world is definitely interesting","replies":[{"poster":"Xenos von Faneli","date":"2017-11-03T02:49:24.836+0000","up_votes":1,"down_votes":0,"body":"Honestly I don't get why you guys aren't just making Dreadnova Illaoi, it'd be sooo cool","replies":[]}]}]},{"poster":"Thryale","date":"2017-10-31T21:09:49.177+0000","up_votes":7,"down_votes":0,"body":"What about this: \"Iron Defiance Illaoi\" and create the new \"Iron Defiance\" skin line to combat the battle cast skin line?","replies":[{"poster":"Bilby","date":"2017-11-03T00:32:10.874+0000","up_votes":3,"down_votes":0,"body":"pretty sweet--will definitely look at faction names like this","replies":[]},{"poster":"Discord User","date":"2017-11-01T22:53:34.682+0000","up_votes":2,"down_votes":0,"body":"Please make this the name of the skin!","replies":[]}]},{"poster":"Doozku","date":"2017-10-31T23:43:38.188+0000","up_votes":5,"down_votes":0,"body":"How about \"Iron Rebel\" or \"Cast Iron Rebel\" or \"Battlecast Rebel\" Illaoi?","replies":[{"poster":"Thryale","date":"2017-11-01T23:35:56.377+0000","up_votes":2,"down_votes":0,"body":"\"Ironcast Rebellion\" sounds kinda neat","replies":[{"poster":"Doozku","date":"2017-11-01T23:59:29.673+0000","up_votes":1,"down_votes":0,"body":"That's the best one, it should be that.","replies":[{"poster":"Bilby","date":"2017-11-03T00:34:38.602+0000","up_votes":3,"down_votes":0,"body":"nice--lots of cool ideas here","replies":[]}]}]}]},{"poster":"Arvot","date":"2017-11-01T15:26:34.743+0000","up_votes":1,"down_votes":0,"body":"Terminator Illaoi. One of Viktors creations that has been reprogrammed to help destroy the machines. Doesn't really fit with her living life in motion, following your desires ideology though. Unless you make it Viktor tried to turn Illaoi into a battlecast because of her prowess in battle, but her will was too strong and she couldn't be controlled. That's it, boom.\nSome other names that'd fit could be Liberator, Unbroken, Secret Weapon, I-9000, Nexus 7, Insurgent, Un-Restrained, Dissident, Chaotic.\nHyped!","replies":[{"poster":"TTK Dreadnought","date":"2017-11-01T18:54:45.490+0000","up_votes":2,"down_votes":0,"body":">Doesn't really fit with her living life in motion, following your desires ideology though. Unless you make it Viktor tried to turn Illaoi into a battlecast because of her prowess in battle, but her will was too strong and she couldn't be controlled. That's it, boom.\n\nThats exactly what i was under the impression of, which is much more in-depth than simply being corrupted by an alien mass.","replies":[]}]},{"poster":"Nebuul","date":"2017-10-31T23:50:15.743+0000","up_votes":2,"down_votes":0,"body":"Ex-Battlecast Illaoi","replies":[]},{"poster":"LugiaPaladin","date":"2017-10-31T21:03:27.445+0000","up_votes":2,"down_votes":0,"body":"I think Liberator Illaoi might be a good title, but that really kind of depends on what kind of universe Battlecast really takes place in, as in if humans are simply eliminated on sight or captured and enslaved/transformed.","replies":[]},{"poster":"ZER0 2","date":"2017-10-31T20:44:11.073+0000","up_votes":2,"down_votes":0,"body":"A lot of people have suggested \"Destructor\" or \"Destroyer\" Illaoi for the skin since she's destroying Viktor's Machines, but idk if people would relate that to the battlecast line tbh","replies":[]},{"poster":"Flemman","date":"2017-11-03T10:22:07.049+0000","up_votes":1,"down_votes":0,"body":"Please just don't call it battlecast till you solve the disparity problem between translation (aka battlecast and mecha call the same)\nIf not, we will end up with a mecha illaoi in the french version for a skin who is not mecha at all","replies":[]},{"poster":"DeathBurst","date":"2017-11-03T01:57:40.008+0000","up_votes":1,"down_votes":0,"body":"> and anyone who cares more about the story behind the skin will read and find that info. But I could totally be wrong.\n\nIt's very hard to find the lore for the skins, even more than the main lore for classic Runeterra, and the main lore still ain't easy.","replies":[]},{"poster":"TTK Dreadnought","date":"2017-11-02T07:33:35.280+0000","up_votes":1,"down_votes":0,"body":">I want to hear more about what you said about the name Battlecast Illaoi & what other options you all might wanna see instead. Those names are placeholder for now, but they might still be the best options in the end. Battlecast is a tough one since she's in that universe but not part of the faction--in the past, we've been inconsistent about theme names & the names of factions within those themes. I think \"Resistance\" sounds cool but think that steps on Resistance Caitlyn.\n\nI actually say, do a **Full Metal Illaoi** skin (similar to Jayce), then you could implement Full Metal Jayce, Pantheon, Rammus as part of the resistance against Creator Viktor. Jayce is already viktor's nemesis, so it gives him a tie-in to this Parallel Universe, and they could be a group that was either partially augmented (either by escaping the PROJECT scientists, or from escaping Viktor's facilities) or has cybernetic armor to help fight the war FOR HUMANITY (unlike PROJECT who lose their humanity when entirely augmented)\n\nIllaoi was captured by Viktors Scientists and experimented on due to her neurological prowess. Full Metal Jayce, while trying to sabotage the facility, rescues a partially augmented Illaoi. Jayce helps her recover and modifies the augmentation which gives her Technokinesis (the power to manipulate technology).\n\nTogether, Full Metal Jayce and Full Metal Illaoi begin a revolution and try to rescue others.\n\nThe inclusion of technokinesis gives her a way to control cybernetic or robotic tentacles (or whatever machine/metal/technological item is used) through the use of a neural-glove interface.","replies":[]},{"poster":"A Liberal","date":"2017-11-02T04:43:01.297+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Bilby,realm=NA,application-id=6kFXY1kR,discussion-id=cAcbc9W1,comment-id=0002,timestamp=2017-10-31T19:55:01.956+0000)\n>\n> Thanks so much for the thoughtful post! Forgive me for focusing on only one small part of it--\n> \n> I want to hear more about what you said about the name Battlecast Illaoi &amp; what other options you all might wanna see instead. Those names are placeholder for now, but they might still be the best options in the end. Battlecast is a tough one since she&#x27;s in that universe but not part of the faction--in the past, we&#x27;ve been inconsistent about theme names &amp; the names of factions within those themes. I think &quot;Resistance&quot; sounds cool but think that steps on Resistance Caitlyn. \n> \n> In my mind, calling it &quot;Battlecast&quot; most clearly indicates what the general look and feel of the skin is gonna be, and anyone who cares more about the story behind the skin will read and find that info. But I could totally be wrong.\n\nDivergent Illaoi, Rebel Illaoi, Awakened Illaoi (Reference to Matrix).... off the top of my head","replies":[]},{"poster":"Dolan McDolan","date":"2017-11-01T19:44:52.541+0000","up_votes":1,"down_votes":0,"body":"I don't think that calling it battlecast will indicate the general look and feel of the skin. In my opinion battlecast skins should be machines of mass destruction, that's what the current battlecast skins are and that's what i feel like they should stay as. I'm fine with Illoai having a battlecast skin because giant robot hands slapping people should be really fun to see but i don't think it should be called battlecast. Also i feel like the battlecast Illaoi skin could be a nice start for a new skin line where you would get a team part machine part human or creature who fight viktor and his battlecast machines.","replies":[{"poster":"TTK Dreadnought","date":"2017-11-01T20:22:13.854+0000","up_votes":1,"down_votes":0,"body":"If \"Creator Viktor\" is the one trying to turn everyone into machines, then \"Destructor Illaoi\" would be the polar opposite.","replies":[]}]},{"poster":"Killaburn","date":"2017-10-31T20:22:12.380+0000","up_votes":2,"down_votes":4,"body":"i think battle cast skins should be void exclusive except urgot and skarner because i grew with that idea of them being beast like entities (btw, pre-rework urgot looks like a beast to me) and battlecast skins should be full armored unless the final outcome of that illaoi skin is full armored, but i doubt that considering i like(even you) the half human parts of that skin combined with robotic parts. What i can think of is that, she can join the pulsfire clan because the pulsfire has those 2 key elements being half human/half machine or even a co-creator illaoi with victor. Being one of viktor's assistants in the battlecast universe but was betrayed by him and cause illaoi to take revenge and stop his madness in that universe. Making her own tentacle hand army and calling the skin \"Cybernated Illaoi\".","replies":[]}]},{"poster":"KuroCaliber","date":"2017-10-31T13:07:41.597+0000","up_votes":6,"down_votes":0,"body":"It's not going to have vo changes, only legendaries get those, or a skin on release like taliyah, when the voice actor was already in house","replies":[{"poster":"Son Foku","date":"2017-10-31T15:38:44.947+0000","up_votes":2,"down_votes":0,"body":"Might have a processed voice over or something which could be neat (like radiant wukong).","replies":[{"poster":"TTK Dreadnought","date":"2017-10-31T16:08:51.823+0000","up_votes":2,"down_votes":1,"body":"Voidbringer has a processed VO. It is highly disappointing.","replies":[]}]},{"poster":"TTK Dreadnought","date":"2017-10-31T16:08:25.151+0000","up_votes":1,"down_votes":0,"body":"Doesnt mean it cant be legendary, but they want to make sure skins fit the thematic and if a new VO is required, they wont hesitate to do it.\n\nAnd i dont mind paying 1850RP to have a better choice than Purplebringer.","replies":[]}]},{"poster":"VelvetCrotch","date":"2017-11-01T20:44:17.491+0000","up_votes":2,"down_votes":0,"body":"awesome written bro. have the same opinion! ;)","replies":[]},{"poster":"R0XTAR","date":"2017-10-31T21:26:26.967+0000","up_votes":1,"down_votes":0,"body":"\"Corrupted\" Illaoi. She is supposed to be using the Battlecasts against Creator Viktor, yet it would make no sense for this \"traitor\" to also be called a Battlecast when they serve Vik.\n\nLike, it definitely needs a name change to show what her goal truly is. I don't wanna have to read up on the lore for a champion skin to understand what the whole thing is about.\n\n\"Corrupted\" would make the most sense as she is leading a rebellion against the machines.. not Battlecast.\n\"Obstruction\" Illaoi.\n\nThese are just some ideas","replies":[{"poster":"Blobî","date":"2017-11-01T10:32:28.585+0000","up_votes":2,"down_votes":0,"body":"corrupted illaoi sounds way to similar to void illaoi imo, void is corrupt","replies":[]},{"poster":"I Am Ravi","date":"2017-11-01T08:34:14.505+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=R0XTAR,realm=NA,application-id=6kFXY1kR,discussion-id=cAcbc9W1,comment-id=0004,timestamp=2017-10-31T21:26:26.967+0000)\n\n> &quot; as she is leading a rebellion against the machines.. \"\n\nMatrix Illaoi... Neollaoi... hmmm\n\nJohn Connorllaoi...\n\n{{sticker:zombie-brand-mindblown}}","replies":[]}]},{"poster":"ChompyWulf","date":"2017-10-31T21:33:18.040+0000","up_votes":2,"down_votes":1,"body":"While each skin has this going for it, I think Deep Space offers the best choice. \n\nIllaoi's two existing skins are heavily dominated by one color, green for base and purple for Void. While base skin has some brown in the model, it blends into the terrain a lot. \nI feel like the Adventurer skin is weakest of the group. It's a very similar color palette to base skin and looks like something that would be a cheap skin, a 750 rp skin.\n\nWhile I like some of what Battlecast is doing, I dislike the hand, dislike how she is a cyborg when all of Battle cast has been fully mechanized, and again it is largely dominated by a single color. Additionally, I am growing tired of so many skins expanding existing skin sets and fewer new concepts and visions being put out. \n\nI think Deep Space offers the best new look, the contrast of the inky corruption against the spacesuit (which begs to be chroma'd) , a slight tie-in to the existing Astronaut skins, and also potentially the Alien Invader.","replies":[]},{"poster":"Żügżwäng","date":"2017-11-01T17:05:12.833+0000","up_votes":1,"down_votes":0,"body":"I'm not sure why so many people are going for adventure. It's not really that \"thicc\" like some are saying... Battlecast is more of a fanservice. \n\nThe problem with adventure is that it's just too close to the base skin in concept and appearance. Both deep space and battle offer something different and interesting. I would have preferred if there deep space one went for the Alien biomass for tentacles (ala dead space event horizon zerg etc) but it's still quite attractive with a portalesque space suit.","replies":[]},{"poster":"Rayjay Redfang","date":"2017-10-31T22:52:50.774+0000","up_votes":1,"down_votes":0,"body":"I agree with you for the most part, the only thing I disagree with is the space one. It just doesn't remind my of voidbringer (which I don't really like that much either, but maybe chromas would help).","replies":[]},{"poster":"Daunt","date":"2017-10-31T13:58:47.032+0000","up_votes":1,"down_votes":0,"body":"This is why i actually wouldn't opt for skin voting. I like all 3 skins and all of them have amazing potentials to really kick ass so it kinda sucks that only one will be made. Especially if you are a main of the champion getting the skin. I think it's better if players are not aware of failed concepts to avoid disappointment. Also, from an artists point of view the skin might not be as creative as it could with some other themes since you just get a concept that you simply have to make.","replies":[]}]}