{"poster":"PantlessWeeb","date":"2017-09-12T02:30:05.145+0000","title":"The Rating of A-","subforum":"[ARCHIVED] Help & Support","embed":{"description":"Every game is a story; visit the new League of Legends match history to check out how this one ends and share your own!","url":"http://matchhistory.na.leagueoflegends.com/en/#match-details/NA1/2596194946/240206073?tab=overview","image":"https://cdn.leagueoflegends.com/match-history/opengraph_icon.jpg"},"up_votes":1,"down_votes":0,"body":"I just want to know how the rating i got was an A-. I'm confused on how the rating system works for league. Is it supposed to be this hard to get an S- or higher? I've gotten a worse score before with Sona and got an S-. Even last game i went 7/1/9 and got an A+. I'm sorry WHAT?\n","replies":[{"poster":"Xeneth","date":"2017-09-12T18:41:21.387+0000","up_votes":1,"down_votes":0,"body":"An A really is nothing to sneeze at!\n\nThere's a lot of factors that go into the grade, and the one Porocles is hinting at is that it grades on a curve based on the champion, role, and possibly even other factors like MMR we can't verify. Sona is a fairly popular support with a large player base bringing up the sample size for what makes a quality performance on her.\n\nAs a support main, the games I get an S usually have the following things happen in them:\n\n* **I have a LOT of assists, between 10 and 20** (usually because I had chances to roam and impact other lanes or participate in invades/skirmishes).\n* **My deaths are extremely low, around 2** (on enchanters, would not be surprised if getting S on vanguards was easier with more deaths, remember it's grading based on that champions average and peak performances in the role)\n* **My lane hits level 2 first or finds a way to obtain a significant CS lead by 20 minutes.**\n* **Even if we stomp our lane, the enemy team has significant threats in other lanes/positions and puts up a decent fight** (usually without giving up).\n\nIn fact, I've noticed that it's MUCH harder to get an S if the enemy team surrenders early or plays particularly poorly. **Consider mastery yet another reason to be sportsmanlike in your games- as fun as it seems to goad your opponents into raging and quitting, you can't farm those juicy stats against opponents who are AFK!**\n\n_Obviously they can't share the algorithms with us without people gaming the heck out of the system, so keep in mind the above is anecdotal and mostly just the result of my personal observation of the system._\n\nGood luck!","replies":[]},{"poster":"Porocles","date":"2017-09-12T18:06:27.062+0000","up_votes":1,"down_votes":0,"body":"The grading system can be pretty competitive, depending on how other players performed with Sona and in that role at that time.  That grade is still pretty solid, but there's a lot of great Sona players out there like yourself.  Check out our [champion mastery](https://support.riotgames.com/hc/en-us/articles/204211284-Champion-Mastery-Guide) guide for more info and tips.  Keep at it!","replies":[]}]}