{"poster":"PIXEL Kitty","date":"2016-10-10T21:32:14.681+0000","title":"Perma Banned???","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":1,"body":"I mean, my main concern is how am I going to get my money back/transfered to a new acc","replies":[{"poster":"Targons Blade","date":"2016-10-11T04:49:46.809+0000","up_votes":2,"down_votes":0,"body":"In no permaban situation can you transfer content or RP to another account, according to the [**Terms of Use.**](http://na.leagueoflegends.com/en/legal/termsofuse)\n\nSince this is a specific inquiry regarding an account suspension, you'll need to reach out via a [support ticket](https://support.riotgames.com/hc/en-us/requests/new). Let me know if you have any questions.","replies":[]},{"poster":"Zombiemaster","date":"2016-10-11T00:38:17.258+0000","up_votes":1,"down_votes":0,"body":"It depends on what you were banned for. If you were banned for something like a charge back issue, or if Riot suspects that your account could be compromised, then you will need to contact [Player Support](https://support.riotgames.com/hc/en-us/requests/new) through a ticket to solve whatever the issue could be and get your account unbanned.\n\nHowever, if you were banned for toxicity, then it's highly unlikely that you will get your money back. Permanent bans are only overturned if there was an error on Riot's end. Riot does not offer refunds period, nor will they transfer the contents of one account to another.\n\nIf you want to discuss your actual ban, you can make a thread in the Player Behavior & Moderation board.","replies":[]},{"poster":"FThisCommunity","date":"2016-10-11T00:14:23.332+0000","up_votes":2,"down_votes":4,"body":"they wont give your money back they are a bunch of thieving %%%%s\nive spent 100+ dollars and these fucking pricks still banned me they need to change their banning system so people who spent money on this dumbass game cant get banned so easily \nRiot is so fucking lazy they dont do shit themselves they cant even fix all the broken stuff on their game","replies":[{"poster":"FThisCommunity","date":"2016-10-11T00:15:33.150+0000","up_votes":1,"down_votes":4,"body":"i got banned for toxicity because i get mad at stupid players who mess my games up and make me lose i would be 6 0 and still lose because stupid bot top or jungle fed","replies":[{"poster":"Forbidden Zed","date":"2016-10-11T14:03:54.884+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FThisCommunity,realm=NA,application-id=osqw6G4M,discussion-id=iAxAIaiE,comment-id=00000000,timestamp=2016-10-11T00:15:33.150+0000)\n>\n> i got banned for toxicity because i get mad at stupid players who mess my games up and make me lose i would be 6 0 and still lose because stupid bot top or jungle fed\n\nBrah I get ur pain man, i get tilted by bad players. Too bad I reach diamond though. I made a smurf and within a week got platinum. I swear man bad players try to afk and tilt me , but sadly bronze to gold is soo easy to solo carry a 4v5 with trash scrubs right? or a feeding bot lane.","replies":[]}]}]}]}