{"poster":"Skt1 Mia Kalista","date":"2017-03-10T22:47:08.947+0000","title":"Adc in 2k17 algo que parece que no va a cambiar hasta la s8 o mas lejos","subforum":"Charlas Generales","up_votes":2,"down_votes":2,"body":"terminamos de perder una partida donde su adc iba 0/9 y yo (adc) iba 8/6 pero nostros somos adc&#039;s no importa si nos fedeamos si farmeamos por que la gana un mid asesino viste o sea este juego ya no tiene sentido mas cuando jugas una linea que te gusta. Es un estereotipo tal como &#039;&#039;o vas un asesino rotisimo o perdes la partida&#039;&#039; cosas como estas me hacen bajar mi frecuencia de juego{{champion:32}} {{item:3070}}","replies":[{"poster":"Ashton Kutcher","date":"2017-03-10T23:04:48.966+0000","up_votes":1,"down_votes":0,"body":"No se porq tanta gente se queja de que los adc estan el peor momento, yo en esta temporada mejore mucho siendo adc jugando ranked sin problema sin importar cuando me tocaba primer pick eleji siempre a {{champion:119}} no me importa q me toque enfrente jaja. Para mi los mejores adc son {{champion:119}}  {{champion:67}}","replies":[{"poster":"Lygnus dwarf","date":"2017-03-10T23:11:51.716+0000","up_votes":1,"down_votes":2,"body":"Obvio que te va a ser fácil con Draven si tiene mucho daño en la Q además del buff que le dieron, y Vayne es  perfecta con esta season de los tanques, el problema no son los asesino, el problemas son los tanques y todas las alternativas de buildearse para reducir el daño drásticamente  inflige un adc, también hay que tomar en cuenta que hasta por parpadear tienen un escudo.\nUna Poppy full tank (sin ítems de daño) es capas de bajar a un adc en 3 segundos con kiteo y todo (creeme, me a pasado).","replies":[{"poster":"Skt1 Mia Kalista","date":"2017-03-10T23:33:15.681+0000","up_votes":1,"down_votes":0,"body":"contra los tanques esta el peel y la penetracion pero decime una cosa cuando un k6 te salta del otro lado del mapa y se te planta vos cuanto corres masomenos en ese momento? sin flash ni curar no sos nadie sos muerte segura ni corki ni tristana se salvan","replies":[{"poster":"Mioen","date":"2017-03-11T00:55:26.698+0000","up_votes":3,"down_votes":0,"body":"Pero ese es el propósito de K6 siempre Nukeo un Carry. Más si está solo.\n\nEs más sería tú culpa si estás solo y te salta el K6 y vos no tenes summs.","replies":[{"poster":"Skt1 Mia Kalista","date":"2017-03-11T01:14:09.422+0000","up_votes":1,"down_votes":0,"body":"eso es lo gracioso hubo una parte donde eramos yo  y karma y a karma le puso una sola q y le bajo casi el mismo porcentaje de vida como el que te bajaría si estuviera sola pero nop estaban los minions y yo alado despues lo mismo pero esta vez a mi por suerte me dejo a 10 de vida de lo cual no me sirvió de nada por que perdimos lo mismo (ahora imaginate si karma estaba sola) le desintalaba el juego {{champion:43}} {{summoner:3}}","replies":[]}]},{"poster":"Lygnus dwarf","date":"2017-03-12T05:24:59.097+0000","up_votes":1,"down_votes":0,"body":"Desde que juego los asesinos siempre han sido un problema para los adc, si admito que me molestan, pero no me quejo porque estan diseñados para eso. \nNi con peel te salvas de un nautilus, poppy, maokai, malphite, garen.","replies":[]}]},{"poster":"Ashton Kutcher","date":"2017-03-10T23:19:10.803+0000","up_votes":2,"down_votes":0,"body":"Si cuando veo algun tank o asesino q me hace focus me armo algo de vida y robo de vida asi tengo mas aguante y poder sacarmelo con ayuda del team","replies":[]}]},{"poster":"Skt1 Mia Kalista","date":"2017-03-10T23:29:31.782+0000","up_votes":1,"down_votes":0,"body":"ya no importa eso por que reicen le gane una vayne 1/7 termino y sabes que? ella gano la partida con un k6 un yasuo o sea bien justo cuando te rompes el lomo y ellos fedean dan kills se regalan pero ellos tienen un k6 oh si puedo fedear a quien quiera total k6 tira salto y q deletea todo lo que produzca sombra muy divertido","replies":[]}]},{"poster":"Runth","date":"2017-03-11T04:16:04.607+0000","up_votes":1,"down_votes":0,"body":"{{champion:22}} {{champion:51}} {{champion:15}} {{champion:81}} {{champion:222}}  : somos minions con criticos , huehuehuehhu\n\n{{champion:40}} : (facepalm)\n\n{{champion:202}}  : 4, 1,2...3 ... 4\n\n{{champion:266}}  que me miran, el mini rework estoy en la tumba","replies":[]},{"poster":"IvVicious","date":"2017-03-11T01:56:26.559+0000","up_votes":1,"down_votes":0,"body":"Es una boludez lo de \"eidici in tu tausen seventin mememeh\", si tu support es bueno y tenés dos dedos de frente, como adc hacés maravillas. Si siempre te armás la misma build ridícula de crítico que es cara y ya no rinde, entonces obviamente vas a ser un minion.","replies":[{"poster":"Skt1 Mia Kalista","date":"2017-03-11T09:40:31.736+0000","up_votes":1,"down_votes":1,"body":"no man, ahora no importa, mira mi ultimas 2 partidas con jhin y mira esa vayne y esa jinx y decime si ahora con dos supports buenos gane que fui jhin karma y jhin brand mira esos scores y ese farm decime cuantos dedos de frente tuve en esas partidas ","replies":[]}]},{"poster":"Runth","date":"2017-03-11T01:36:10.954+0000","up_votes":1,"down_votes":0,"body":"{{champion:267}}  ♪♪♪ Pondre un wardcito en la matita ♪♪♪ :D\n\n#En la matita\n\n{{champion:64}} {{champion:157}} {{champion:238}}  hi =)\n\n{{champion:267}}  alv\n\n#RIP","replies":[]},{"poster":"ItsReddas","date":"2017-03-10T23:02:04.277+0000","up_votes":1,"down_votes":0,"body":"{{champion:104}} hola soy un tirador y hago estragos en la jungla :)\n{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Mioen","date":"2017-03-11T00:56:22.207+0000","up_votes":1,"down_votes":0,"body":"Cómo lo extraño en la botlane. Yo lo jugaba de ADC al viejo Graves.","replies":[]}]},{"poster":"Maycoltf2","date":"2017-03-10T22:50:11.132+0000","up_votes":1,"down_votes":0,"body":"No se porque tanto se quejan , anunciaron oficialmente que esta temporada seria de asesinos.","replies":[{"poster":"Skt1 Mia Kalista","date":"2017-03-10T23:26:16.502+0000","up_votes":1,"down_votes":0,"body":"es injusto esa es la queja amigo, por que el juego te obliga a jugar otras cosas que no queres jugar","replies":[{"poster":"Maycoltf2","date":"2017-03-10T23:40:00.214+0000","up_votes":1,"down_votes":0,"body":"Si es para que el juego no sea monótomo en todas las temporadas , yo espero la temporada de los sopotes :).","replies":[{"poster":"Skt1 Mia Kalista","date":"2017-03-10T23:42:10.777+0000","up_votes":1,"down_votes":0,"body":"pero ni que hubiera no se 250 asesinos jugaste unos cuantos y listo te re canasas yo maineo asesinos tambien pero ya se vuelve aburrido a la 4ta partida","replies":[]}]}]}]}]}