{"poster":"Skt1 Mia Kalista","date":"2016-01-29T06:40:32.168+0000","title":"Puden crear una peticion de rendimiento a los 3 votos?","subforum":"Problemas Técnicos","up_votes":1,"down_votes":3,"body":"esto es muy importante por que ya la comunidad no da mas de gente asquerosa y troll pero eso es todo aparte no es necesario que 4 personas se quieran rendir es una petici&oacute;n as&iacute; ya de a&ntilde;os es muy innecesaro que sean 4 por muchas rasones","replies":[{"poster":"Lord Yveltal","date":"2016-01-29T12:57:45.476+0000","up_votes":2,"down_votes":0,"body":"Una persona NUNCA debería rendirse","replies":[]},{"poster":"Fharzen","date":"2016-01-29T07:41:26.956+0000","up_votes":1,"down_votes":0,"body":"Primero que nada, es \"rendición\" \n\nSegundo, hay mas de una \"rason\" para que los votos necesarios para una rendición sean 4.\n\nTercero, por lo que veo de tu historial, las ultimas 3 partidas el que trolleo parece que fuiste vos.","replies":[{"poster":"Skt1 Mia Kalista","date":"2016-01-30T07:28:43.283+0000","up_votes":1,"down_votes":0,"body":"primero que nada flaco si tenes razón me equivoque segundo me trolearon 60 partidas las llevo contadas 3ro mira como va la cosa la comunidad no mejora y hay que tomar medidas por que yo y mis amigos estamos podridos tenemos partidas malas si pero para que empeorarlas con trolls que si son 2 ya fuiste te comes los 40 minutos con esa gente que te flamea digo no se vos te aguantarias 40 minutos de flamers?","replies":[{"poster":"Fharzen","date":"2016-01-30T08:14:32.231+0000","up_votes":1,"down_votes":0,"body":"El problema es que con 3 votos para aceptar la rendición puede que te trolleen también tirando surrender si son premade de a 3.\n\nYo creo que esta bien, mas que nada porque el surrender no sirve tanto a menos que te tengas que irte a otro lado por alguna situación, de lo contrario no esta bueno tirar surrender.\n\nMuchas de las partidas donde al minuto 20 puse surrender y los otros votaron que no (menos mal) terminaron siendo victorias. De hecho ya ni tiro surrender, porque la gran mayoria de las partidas que arrancan mal se terminan ganando con remontadas épicas.\nY lo menos que puede pasar es que pierdas de todos modos y hayas gastado un poco de tiempo, pero es mas lo que podes ganar que lo que perdes si te quedas jugando toda la partida.","replies":[{"poster":"Skt1 Mia Kalista","date":"2016-02-09T01:18:24.325+0000","up_votes":1,"down_votes":0,"body":"si pero pensa esto en una partida donde 2 estén troleando por culpa de esos dos no puedan tirar surrender? que haces? coerte los 40 o 50 minutos de la partida por que a dos trolls sin vida social le gusta molestar?","replies":[{"poster":"Fharzen","date":"2016-02-15T06:52:37.721+0000","up_votes":1,"down_votes":0,"body":"Lamentablemente la respuesta es si.","replies":[]}]}]}]}]}]}