{"poster":"l Phantaminum l","date":"2015-08-19T09:18:52.570+0000","title":"Cercasi main supp gold  o più per team ranked","subforum":"Reclutamento","up_votes":1,"down_votes":3,"body":"Salve ragazzi siamo alla ricerca di di un ma in supp per il team ranked siamo gold  2platinum e diamond non dobbiamo raggiungere gli lcs ma provare a divertirci e migliorare se siete interessati END Ragnarok contattatemi farete una prova con il nostro ADC","replies":[{"poster":"SKFF1R SubZero","date":"2015-08-19T10:23:28.106+0000","up_votes":1,"down_votes":0,"body":"Orari delle partite e disponibilità durante la settimana sono state omesse: sarebbe completo se venissero aggiunte :)\nUna prova non mi costa nulla inoltre: ti aggiungo :)","replies":[{"poster":"l Phantaminum l","date":"2015-08-19T12:13:51.253+0000","up_votes":2,"down_votes":0,"body":"Yup sicuro chiedo perdono il ritrovo è serale dalle 20 alle 00:00  gli orari sono variabili causa lavori ma questa è la fascia oraria ci si aggiornera cmq di volta in volta per le giornate la partecipazione minima son 2 sere a settimana poi se c si trova di più ottimo","replies":[]}]},{"poster":"HyperTrek Spock","date":"2015-08-19T09:27:19.558+0000","up_votes":1,"down_votes":0,"body":"Eccomi, in soloq maino jungle ma avevo un team ranked gold 2 in cui ero support. Maino thresh, annie, leona, nautilus, janna. Rispondete qui perche su lol rientro il 27 . Le mie specialità sono il warding e il roaming, sono in grado anche di effettuare un buon laneswap. ( in questo momento è un mio amico che sta giocando delle normal sul mio account per provare dei champ, quindi non scrivetemi perché risponderebbe lui) dal 27 ci sono","replies":[{"poster":"l Phantaminum l","date":"2015-08-19T12:10:28.129+0000","up_votes":1,"down_votes":0,"body":"Ehi ciao nessun problema per provarti dopo il 27 organizxo  un partita cob l ADC e magari gli altri cosi possiamo provare","replies":[{"poster":"HyperTrek Spock","date":"2015-08-19T19:05:19.009+0000","up_votes":1,"down_votes":0,"body":"Per me le 00.00 è un po tardi.. Possiamo fare fino allr 23?","replies":[]},{"poster":"HyperTrek Spock","date":"2015-08-19T13:38:37.232+0000","up_votes":1,"down_votes":0,"body":"Ok perfetto!","replies":[]}]}]},{"poster":"Mustazzolo","date":"2015-08-19T16:58:23.784+0000","up_votes":1,"down_votes":0,"body":"ciao, sono gold 3, ho 21 anni, main support. Gioco un buon numero di champion da support, e questa sarebbe un'opportunità per migliorare le mie abilità.\nSe volete possiamo provare insieme...","replies":[]}]}