{"poster":"JuggerNuke1","date":"2017-08-15T19:07:15.416+0000","title":"Neues Honor System","subforum":"Allgemeiner Chat","up_votes":2,"down_votes":2,"body":"Bin schon Honor Level 4 und habe noch keine einzige Ehrungskapsel bekommen. Schl&uuml;sselfragmente bekomme ich auch ziemlich selten. Insgesamt habe ich bestimmt nur 10-15 St&uuml;ck bekommen. Keine Ahnung was ich falsch mache, aber f&uuml;r mich ist dieses Update ein totaler reinfall.","replies":[{"poster":"Die Kaki","date":"2017-08-16T10:40:22.917+0000","up_votes":2,"down_votes":0,"body":"Meines erachtens werden einem die schlüsselfragmente hinterher geworfen. ich würde vom gefühl sogar behaupten das man sogar mehr bekommt als zuvor, ich kann mich aber auch irren. Das einzige was ich z.b. nicht verstehe, sind die ehrungskapsel, denn es wird gesagt ab honor lv 3 hat man die chance eine kapsel zu bekommen, bin aber mittlerweile honor lv 4 und habe noch keine einzige bekommen obwohl ich regelmäßig spiele.Freunde von mir hatten schon 2 - 3 kapsel und die sind noch aktuell honor lv 3. daher wäre hier meine fragen wie es sich mit den kapsel und nicht mit den schlüsselfragmenten verhält","replies":[]},{"poster":"Alekra","date":"2017-08-15T19:18:34.923+0000","up_votes":1,"down_votes":1,"body":"Wenn es für dich ein Reinfall ist weil du als einzelne Person vllt nicht von Fragmenten oder Kapseln überschwemmt wirst hast du es entweder nicht mit dem letzten System verglichen oder du hast dir überhaupt kein Gedanken darüber gemacht.","replies":[{"poster":"JuggerNuke1","date":"2017-08-15T19:33:19.854+0000","up_votes":1,"down_votes":0,"body":"In dem letzten System habe ich viel mehr Schlüsselfragmente bekommen. Das war es für mich ein Ansporn das Spiel zu gewinnen damit ich ein Schlüsselfragment bekomme. Mit diesen Honor System ist es einfach nicht mehr das gleiche. Das Ziel wurde für mich beim neuen Konzept einfach komplett verfehlt. Es werden immer nur die geehrt, die das komplette Game gecarryt haben. Und Ja. Mir ist im klaren, dass man garnicht geehrt werden muss um Schlüsselfragmente zu bekommen. Jedoch dauert dies dann länger. Und das ist meiner Meinung nach auch einfach nur Schrott.","replies":[{"poster":"Humpelstilzche","date":"2017-08-15T19:39:52.932+0000","up_votes":2,"down_votes":0,"body":">  Jedoch dauert dies dann länger.\n\nFalsch. Das hat absolut NICHTS miteinander zu tun.\nDarüber hinaus ist die Anzahl der Schlüssel keinesfalls geringer als im alten System. Sowohl im alten als auch im neuen System kann man maximal 12 Fragmente pro Monat erreichen und erreicht dieses Maximum als regelmäßiger Spieler auch.","replies":[{"poster":"JuggerNuke1","date":"2017-08-15T20:10:58.259+0000","up_votes":1,"down_votes":0,"body":"Ich spiele eigentlich täglich 2-4 Runden. Jedoch bekomme ich immer nur 5-7 Schlüsselfragmente im Monat.","replies":[{"poster":"Humpelstilzche","date":"2017-08-16T05:25:48.179+0000","up_votes":1,"down_votes":0,"body":"Das ist quasi ausgeschlossen. Ich empfehle dir mal für 1-2 Monate tatsächlich zu zählen, also wirklich mit Aufschreiben. Du wirst merken, dass es ziemlich genau 12 Fragmente pro Monat sind.","replies":[]}]}]}]}]}]}