{"poster":"JejeTeMate","date":"2017-12-21T14:56:07.883+0000","title":"Es normal esto? que me baneen por cantidad de reportes de encima gente toxica XD","subforum":"Comportamiento del jugador","up_votes":1,"down_votes":10,"body":"Bueno, para empezar quiero aclarar que si en momentos de la partida dije algo ofensivo, aunque sea 1 o 2 oraciones o palabras las acepto pero porfavor lean esto igual porque tengo cosas interesantes que contar \n\nLa partida comienza bastante normal, todos en lo suyo, la gente farmeando, pockeando y esas cosas que hace la gente en una partida de league of legends\n \nhasta que llega el maravilloso momento donde la discordia comienza , yo tenia pegado a torre al swain que me \ntoco en contra el linea (yo estaba jugando teemo para poder probar el chroma de storm troper de teemo escuadron omega XD) hasta que veo entrar por rio a una le blanc, me mata y miro el chat para ver si avisaron el mia en mid, al ver que solo tiro un mia le pedi que para proxima me avisara con mas señales porque mientras peleo no me doy cuenta y si, soy algo despistado para ver el mapa aveces pero no fue el caso \n\ncomienza todo lo hermoso del mid cuando me comienza a decir el tipico e innecesario \"muted\" alskdla y yo me enoje un poco y le digo \" que ardido\" si, me lamento de escribir eso pero supongo que todos tenemos esos momentos que tal vez no maten una partida pero si molestan al equipo y me disculpo por eso \n\nhttps://gyazo.com/87572f87d62cad158f62f5cea5e2537d \n\ncontinua la partida, que por ese gank de lb mori y mi swain me paso en nivel y farm, compro y me comenzo a ganar y asi comenze a morir porque me supero en todo aspecto el swain y como toda partida de league of legends xd mi team me flameaba y ya llegado un punto mas alto de la partida el suport me dice \"y para eso te dejo linea?\" y ahi explote de nuevo y le dije que si el creia que si voy mal me ayudaba el decirme eso? y le llame \"alto enfermo\" y ahi fue cuando terminaro mi supuesto flameo.\n\nun par de minutos mas tarde mi adc y mid se dan cuenta de que la partida estaba \"perdida\" cosa que yo no comparto y me comienzan a flamear entre los 2 cosa que no me afecto mucho porque los estaba ignorando pero cuando el adc dijo: \" report teemo por robarle la linea al suport\" yo ya comenze a explicar lo que paso, que al empezar la seleccion de campeon yo dije que llevaba mucho jugando supp y queria jugar otra cosa ( mas o menos mentira pero queria probar mi chroma de teemo escuadron omega aksdjlaksjd xd) a lo que mi suport me dio top y el quedo jugando suport obviamente xd \n\nhttps://gyazo.com/75cf8f9bd3ec7e2b5e42228c639b1e66\n\nla partida ya casi terminando dicen: \"report teemo x9 alto troll\" a lo que ya no pude decir mucho porque nos tiraron el nexo \n\ny supongo que me habran reportado el mid, el adc y el suport de mi team gente que tambien me flameo ami mas de lo que yo a ellos y tal vez 3 o 4 del team enemigo que le vio razon a mi team cuando no tenian ni idea de lo que pasaba pero ellos reportan por joder solamente\n\npara aclarar no busco que me quiten el ban porque sabemos que riot nunca lo haria XD solo busco que por favor compartan este post o lo comenten para que alguien me explique porque ami me banean y a ellos no, ¿por la cantidad de reportes? .... no entiendo , porque ami cuando yo he reportado millones de veces a gente troll o toxica y nunca me llego el aviso de que los penalizaron, pero llega el hermoso momento que me caen 3\n(disculpen la expresión) estúpidos que al parecer venían de una mala racha o algo pero vieron que como iba 0/3 podían echarme la culpa de perder una partida el la que el team enemigo nos supero en todo aspecto y encima el sistema de riot les permita hacer eso, no se si es una especie de algoritmo o alguien que revise el chat de las partidas (cosa que no creo) pero si alguien o algo las revisa creo que es super raro que solo ami me penalizen y no a ellos \n\nbueno hasta aqui quiero dejar esto y si tienes alguna respuesta o algo que comentar lo hagas sin problema <3 mientras mas mejor ajlksad \n\ngracias por su atencion\nel baneado por 14 dias  \n\n","replies":[{"poster":"Tumbando la lane","date":"2017-12-21T17:01:20.619+0000","up_votes":2,"down_votes":0,"body":"JAJAJAJAJAJAJAJAJAJAJAJAJAJAJAJAJAJAJAJA","replies":[]},{"poster":"StąrDust","date":"2017-12-21T16:59:21.262+0000","up_votes":2,"down_votes":0,"body":"Osea empezaste vos a\"toxiquear\" y después te haces la víctima? Bien merecido el ban","replies":[]},{"poster":"martincarp","date":"2017-12-21T15:59:58.665+0000","up_votes":1,"down_votes":0,"body":"Si lo que buscas es una explicación del por qué de tu castigo, es súper sencilla: ¿tu uso del chat fue una molesta para el resto de los jugadores? Si la respuesta es que si, entonces el castigo está justificado.\n\nTú mismo lo dices en tu publicación:\n\n> (...) yo me enoje un poco y le digo \" que ardido\"\n\n> Le dije que si el creía que si voy mal me ayudaba el decirme eso? y le llame \"alto enfermo\" y ahi fue cuando terminaro mi supuesto flameo.\n\nLiteralmente SABÉS qué está mal, pero tu problema es que solo lo identificás cuando alguien más lo hace. Si lo que vas a decir no aporta nada a la partida, NO LO DIGAS. Y si ya lo dijiste, entonces podés estar \"tranquilo\" de que si te reportan al final de la partida, la misma sumará a la lista de partidas con reportes justificados y estarás un paso más cerca del siguiente castigo.\n\nLa idea de los bans no es eliminar a los tóxicos del servidor, la idea de los castigos es que te des cuenta de que algo en tu forma de actuar durante las partidas está haciendo que la gente no disfrute de jugar con vos, y los chat logs son una pequeña muestra de las actitudes que estás teniendo que llevan a una parte de tus compañeros a que te reporten constanemente. Así que en lugar de pensar \"es injusto porque no castigan a los que me flamearon a mi\", tendrías que aprovechar estos 14 días para plantearte a vos mismo QUÉ estás haciendo mal, y cómo cambiarlo, porque la realidad es que en una buena parte de tus partidas, tus aliados te consideran una molestia, y lo demuestran con los reportes... y por lo visto, el sistema coincide, así como vos (inconscientemente) también coincides.","replies":[{"poster":"JejeTeMate","date":"2017-12-21T16:05:37.714+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=martincarp,realm=LAS,application-id=PJAKt7ph,discussion-id=LRpW18su,comment-id=0004,timestamp=2017-12-21T15:59:58.665+0000)\n>\n> Si lo que buscas es una explicación del por qué de tu castigo, es súper sencilla: ¿tu uso del chat fue una molesta para el resto de los jugadores? Si la respuesta es que si, entonces el castigo está justificado.\n> \n> Tú mismo lo dices en tu publicación:\n> \n> Literalmente SABÉS qué está mal, pero tu problema es que solo lo identificás cuando alguien más lo hace. Si lo que vas a decir no aporta nada a la partida, NO LO DIGAS. Y si ya lo dijiste, entonces podés estar &quot;tranquilo&quot; de que si te reportan al final de la partida, la misma sumará a la lista de partidas con reportes justificados y estarás un paso más cerca del siguiente castigo.\n> \n> La idea de los bans no es eliminar a los tóxicos del servidor, la idea de los castigos es que te des cuenta de que algo en tu forma de actuar durante las partidas está haciendo que la gente no disfrute de jugar con vos, y los chat logs son una pequeña muestra de las actitudes que estás teniendo que llevan a una parte de tus compañeros a que te reporten constanemente. Así que en lugar de pensar &quot;es injusto porque no castigan a los que me flamearon a mi&quot;, tendrías que aprovechar estos 14 días para plantearte a vos mismo QUÉ estás haciendo mal, y cómo cambiarlo, porque la realidad es que en una buena parte de tus partidas, tus aliados te consideran una molestia, y lo demuestran con los reportes... y por lo visto, el sistema coincide, así como vos (inconscientemente) también coincides.\n\nalfin alguien que responde bien xd\n\nEstoy de acuerdo contigo , y acepto él bam y todo pero me molesta que yo y tal vez más gente nos fue una molestia jugar con ellos pero como ami me reportaron mas me baneen, eso me molesta pero nada que hacer ¿no? Jaja\n\nGracias igual <3","replies":[{"poster":"TiToldero","date":"2017-12-21T19:47:36.959+0000","up_votes":1,"down_votes":0,"body":"tene en cuenta que no se te banea por una partida. Seguramente tuviste mala conducta en varias y te reportaron varias veces, sin embargo la gente que te flameo a vos quizás solo tubo un mal día y no tienen la costumbre de flamear. Yo a veces me tilteo y digo algo negativo pero no es mi costumbre, ese es el punto. Suerte.","replies":[]},{"poster":"martincarp","date":"2017-12-21T16:46:41.444+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=JejeTeMate,realm=LAS,application-id=PJAKt7ph,discussion-id=LRpW18su,comment-id=00040000,timestamp=2017-12-21T16:05:37.714+0000)\n>\n> alfin alguien que responde bien xd\n> \n> Estoy de acuerdo contigo , y acepto él bam y todo pero me molesta que yo y tal vez más gente nos fue una molestia jugar con ellos pero como ami me reportaron mas me baneen, eso me molesta pero nada que hacer ¿no? Jaja\n> \n> Gracias igual &lt;3\n\nQue no te llegue el cartel no significa que jamás serán castigados.\n\nPor empezar, el cartelito de que alguien fue baneado solo le llega a una persona de las decenas que reportaron al individuo, solo le aparece al que gatilló el ban, al último en haberlo reportado. Así que si en tu partida primero reportaste al mid, y luego tu jungla reportó al mid, y el report de tu jungla gatilló su ban, solo le aparecerá el cartelito al jungla. ¿Se entiende?\n\nAsí que no te guíes de ese aviso de que alguien fue castigado porque no significa nada, es probable que muchos de tus reportes hayan contribuido a vaaaarios bans, pero tú nunca te enteraste simplemente porque no fuiste el único. El sistema funciona, y justamente vos que recibiste 2 bans deberías saberlo jaja, así que tranqui pa, cuando te topes con alguien molesto simplemente ignoralo o mutealo, no les des motivos de que también te reporten a vos, y reportalos al final de la partida.\n\nOtra cosa a tener en cuenta es que, si bien la cantidad de reportes cambia la gravedad con la que el sistema toma el caso, con que una persona te reporte, alcanza para que el sistema analice tu partida. Así que \"da igual\" si solo tú reportaste a X o si lo reportaron 3, el sistema va a ver si flameó de todos modos, y si es constante con su actitud negativa ese único reporte en esa partida tendrá peso a la hora de que le caiga el ban.","replies":[]}]}]},{"poster":"El Impostor","date":"2017-12-21T15:43:35.054+0000","up_votes":1,"down_votes":0,"body":"Jeje te mataron.","replies":[]},{"poster":"Lïttlefinger","date":"2017-12-21T14:58:11.545+0000","up_votes":1,"down_votes":0,"body":"Si, es normal que baneen a los toxicos, saludos!","replies":[{"poster":"JejeTeMate","date":"2017-12-21T15:23:40.801+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lïttlefinger,realm=LAS,application-id=PJAKt7ph,discussion-id=LRpW18su,comment-id=0000,timestamp=2017-12-21T14:58:11.545+0000)\n>\n> Si, es normal que baneen a los toxicos, saludos!\n\ndisculpa pero no pudiste leer todo por que lo subi sin terminar, te pido que lo leas de vuelta solo si quieres y me digas que piensas","replies":[{"poster":"Lïttlefinger","date":"2017-12-21T15:31:56.569+0000","up_votes":1,"down_votes":0,"body":"Te voy a explicar paso a paso para que entiendas.\n\n1- No se da ban de 14 dias por 2 o 3 partidas \"flameando\", para nada, antes que eso, tuviste un ban de chat de 10 partidas, porque fuiste muy toxico, despues de eso tuviste un ban de chat de 25 partidas PORQUE SEGUISTE SIENDO MUY TOXICO.\n\n2- Si te creyera tu victimizacion, supongamos que fue un ban directo, vaya hermano, eso significa que sos top toxico en el server, porque existen los bans directos sin restriccion de chat, pero ya la persona se tiene que pasar de toxico.\n\n3- Si vas a mostrar el chat, no busques vueltas, juego hace 3 años, hace 3 años vi mas de 200 casos como los tuyos y todos resultaron ser unos flamers compulsivos ultra toxicos, asi que por mas que intentes mostrar el chat lo mas \"safable\", te delatas peor sin mostrar todo el chat, sin las continuaciones y mostrando lo que te \"conviene\".\n\n4- Adelante amigo, si estas tan seguro que tu ban es injusto o anormal, anda al soporte, enviar una solicitud, \"estoy teniendo problemas tecnicos\", te logueas de nuevo, chat beta y te atiende un chat online en tiempo real.\nEso si, preparate para la humillacion porque te van a humillar.\n\nNuevamente sostengo, ban bien aplicado, un toxico menos, saludos!","replies":[{"poster":"JejeTeMate","date":"2017-12-21T15:41:09.827+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lïttlefinger,realm=LAS,application-id=PJAKt7ph,discussion-id=LRpW18su,comment-id=000000000000,timestamp=2017-12-21T15:31:56.569+0000)\n>\n> Te voy a explicar paso a paso para que entiendas.\n> \n> 1- No se da ban de 14 dias por 2 o 3 partidas &quot;flameando&quot;, para nada, antes que eso, tuviste un ban de chat de 10 partidas, porque fuiste muy toxico, despues de eso tuviste un ban de chat de 25 partidas PORQUE SEGUISTE SIENDO MUY TOXICO.\n> \n> 2- Si te creyera tu victimizacion, supongamos que fue un ban directo, vaya hermano, eso significa que sos top toxico en el server, porque existen los bans directos sin restriccion de chat, pero ya la persona se tiene que pasar de toxico.\n> \n> 3- Si vas a mostrar el chat, no busques vueltas, juego hace 3 años, hace 3 años vi mas de 200 casos como los tuyos y todos resultaron ser unos flamers compulsivos ultra toxicos, asi que por mas que intentes mostrar el chat lo mas &quot;safable&quot;, te delatas peor sin mostrar todo el chat, sin las continuaciones y mostrando lo que te &quot;conviene&quot;.\n> \n> 4- Adelante amigo, si estas tan seguro que tu ban es injusto o anormal, anda al soporte, enviar una solicitud, &quot;estoy teniendo problemas tecnicos&quot;, te logueas de nuevo, chat beta y te atiende un chat online en tiempo real.\n> Eso si, preparate para la humillacion porque te van a humillar.\n> \n> Nuevamente sostengo, ban bien aplicado, un toxico menos, saludos!\n\nbueno, me parece correcto lo que dices pero hay bastantes cosas que no puedo dejar solo ahi porque estan MAL\n\n1- nunca me dieron ban de 25 partidas, solo 10 porque si, fui el tipo de toxico que ahora quiero dar a conocer en mi post, pero desde ese dia nunca mas flamee, nunca \n\n2- dejo bastante claro que no pido que me quiten el baneo, solo queria saber porque me banearon cuando yo tambien reporte a esa gente y no les paso nada, y repito, no me queria victimizar porque se que es inutil\n\n3- en el post no pienso ni pense poner toda la partida solo puse esas capturas porque son las que van con lo que hablo, y no se si viste pero en parte de las captura y el en mismo post queda claro qur yo tambien flamee, en mucha, MUCHA menos cantidad que los otros pero lo hice, yo pienso que lo que dije o como jugue no era para baneo, pero no puedo hacer nada al respecto ¿no? \n\n4- no veo la razon para hablar con tanta pre potencia o seguridad siendo que no es necesario, repito por TERCERA VEZ, no pido que me quiten el report ya que tengo mas cuentas para jugar o otros juegos para jugar pero queria dar a conocer lo que me ocurrio y que pensaba la gente pero no veo tu necesidad ..","replies":[]}]}]}]},{"poster":"Americans","date":"2017-12-21T14:58:42.168+0000","up_votes":1,"down_votes":0,"body":"Si te banearon es porque te lo mereces, no importa quien fue el que te reporto (Ni tampoco tenes forma de saberlo, asi que no sabes si eran toxicos).","replies":[{"poster":"JejeTeMate","date":"2017-12-21T15:24:02.931+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FAN DE OLLEH,realm=LAS,application-id=PJAKt7ph,discussion-id=LRpW18su,comment-id=0001,timestamp=2017-12-21T14:58:42.168+0000)\n>\n> Si te banearon es porque te lo mereces, no importa quien fue el que te reporto (Ni tampoco tenes forma de saberlo, asi que no sabes si eran toxicos).\n\notro que no pudo leerlo terminado, lo mismo que el de arriba para usted amigo <3","replies":[]}]},{"poster":"Champi4UP","date":"2017-12-21T15:13:13.698+0000","up_votes":1,"down_votes":0,"body":"Sí, los tóxicos pueden reportar a otros tóxicos.\nTotal el sistema es automático y si no fuiste tóxico no te banea.","replies":[]}]}