{"poster":"ilmejoop","date":"2016-11-29T19:12:36.480+0000","title":"PILTOVER VS ZAUN","subforum":"Discussioni generali","up_votes":4,"down_votes":1,"body":"Girovagando per Universo mi sono reso conto che la riot ha fatto un aggiornamento alla lore di Piltover e Zaun; Due delle regioni, insieme a Bilgewater, pi&ugrave; belle ed ispirate di Runeterra. Infatti ora, la citt&agrave; del progresso e la citt&agrave; della rivoluzione industriale perenne, sono un unico, enorme agglomerato urbano.\nPiltover &egrave; un quartiere situato nelle zone pi&ugrave; alte e che si affaccia al mare; qui arte, cultura e progresso scientifico raggiungono l&#039; apice grazie ai ricchi scambi commerciali con tutta Runeterra. I piltoveriani si rispecchiano nella classica figura del borghese: mercanti ed imprenditori, fieri del loro status ottenuto lavorando duro.\nSono proprio questi magnati che incentivano lo sviluppo e stanziano i fondi per le invenzioni hextech.\nZaun invece &egrave; il distretto sottostante: dove la densit&agrave; dello smog oscura il cielo e i rifiuti chimici inondano le strade. Zaun si &egrave; sviluppata grazie al progresso parallelo di piltover, in un rapporto definito dalla riot &quot;simbiontico&quot;. Infatti molti prodotti hextech piltoveriani vengono rivenduti al mercato nero dai vari ricettatori dei bassifondi. Molti scienziati inoltre preferiscono rifugiarsi qui, sostenuti dai potenti signori del crimine che finanziano le loro folli invenzioni, complice anche la mancanza di legislazioni e forze dell&#039; ordine.\nGrazie a questa nuova lore possiamo immedesimarci ancora di pi&ugrave; nei ragazzi zauniti che, come Ekko e Jinx, detestano profondamente Piltover dato che gli abitanti di quest&#039; ultima li guardano, dall alto della loro vita agiata, morire di stenti nel caos pi&ugrave; totale. Oppure nei panni di una Vi che tenta di fuggire dalle bande e dalla strada spietata dei bassifondi.\nE ora voi vi chiederete, perch&eacute; non ci sono migrazioni in massa da parte degli zauniti verso il sogno piltoveriano o perch&eacute; nessuna banda si rivolta invadendo la relativamente piccola cittadina di piltover? Io credo che la risposta sia Camille. Nel suo fumetto infatti cita svariate volte la &quot; perfetta macchina piltoveriana&quot;, riferendosi chiaramente alla societ&agrave; di piltover, che funziona grazie all&#039; incastro di svariati ingranaggi : i ricchi e potenti abitanti di piltover appunto. Sempre nel fumetto camille uccide un conte zaunita, che stava cercando di sposare una ragazza appartenente a una delle pi&ugrave; nobili e ricche famiglie di piltover, proprio perch&eacute; ci&ograve; avrebbe inquinato irreparabilmente lo scorrere della &quot;perfetta macchina&quot; sopracitata, a lei tanto cara.Probabilmente scopriremo altri approfondimenti al relase di Camille e all&#039; ormai prossimo rework di Warwick, infatti nelle interazioni di quest&#039; ultima ce ne sono parecchie riferite al nostro lupotto preferito.\nPremetto che adoro gi&agrave; di mio questo tipo di ambientazioni (coff*dishonored*coff) ma mi piace che la riot abbia legato ancora di pi&ugrave; il rapporto di queste fazioni, rendendole un po&#039; le facce opposte della stessa medaglia e creando una sorta di elisium.\nCosa ne pensate voi? Meglio ora o adesso?\n\nLink Zaun:\nhttp://universe.leagueoflegends.com/it_IT/region/zaun\n\nLink Piltover:\nhttp://universe.leagueoflegends.com/it_IT/region/piltover\n\nLink fumetto camille:\nhttps://www.google.it/url?sa=t&source=web&rct=j&url=http://euw.leagueoflegends.com/it/featured/camille-comic&ved=0ahUKEwiz_Z3X187QAhUFVRQKHfsYAQ0QFggbMAA&usg=AFQjCNF7xeGCIxxo_z1ifiovY7h1E7dSNg&sig2=tgaKt9kkx_J0Td5AUZHKMA","replies":[{"poster":"Sorcio84","date":"2016-11-30T10:14:21.243+0000","up_votes":1,"down_votes":0,"body":"personalmente, e parlo come zaunita, i piltoveriani sono dei mangiasoldi pomposi che trattano i bassifondi come una discarica.\nLe due città sono l'esempio della divisione della società.\n\nAlmeno demacia è ordinata, e anche noxus, nonostante si regga sul fu dominio di {{champion:82}} , ha un suo ordine.","replies":[]},{"poster":"Viktòr","date":"2016-11-29T20:22:55.257+0000","up_votes":1,"down_votes":0,"body":"Conosco le storie di Piltover e Zaun solo a grandi linee, quindi vedrò di visitare anch'io l'**_Universo_**.\nComunque, nonostante la sua perversa follia, scelgo la patria del mio amato {{champion:112}} , **Zaun**.","replies":[]}]}