{"poster":"Hallothchon","date":"2018-07-13T12:00:27.558+0000","title":"Ci sarà un giorno?!?!?","subforum":"Discussioni generali","up_votes":3,"down_votes":6,"body":"Ci sar&agrave; un giorno in cui la riot decider&agrave; PER DAVVERO a bannare i giocatori oppure se gli tiene perch&eacute; gli fa comodo avere tanti player?? La community fa schifo, esperienza di gioco negativa e va sempre a peggiorare...fate il vostro lavoro e iniziate a bannare i player..e non mi trovate le stesse scuse di sempre.","replies":[{"poster":"Darkinknight","date":"2018-07-13T12:39:31.049+0000","up_votes":3,"down_votes":0,"body":"Vien da se che bannare quasi qualsiasi cosa sarebbe ipoteticamente l'ideale. Di contro pero dopo 2 giorni aspetteresti 40 minuti per fare un game","replies":[]},{"poster":"Lıcky","date":"2018-07-13T12:34:49.943+0000","up_votes":3,"down_votes":0,"body":"L'obiettivo della Riot è quello di creare una sorta di gruppo di riabilitazione utenti. Che cosa voglio dire? Bé semplicemente che la Riot vuole evitare a tutti i costi di bannare un player e cercare di \"riabilitarlo\" dandogli delle punizioni in un certo senso \"meritevoli\". Rumors dicono che la riot in futuro ha intenzione di bloccare un videogiocatore dal giocare altre partite in modo da evitargli di tiltare o trollare in game con un messaggio del tipo 'Abbiamo visto che non tutti i tuoi game stanno andando bene, prenditi una pausa!'. Non so del tutto i piani della Riot però se tutto questo dipendesse da loro penso già avrebbero risolto, ma pensandoci il problema parte da noi. Quindi facciamoci un'esame di coscienza.","replies":[{"poster":"HarukiHaru","date":"2018-07-13T14:59:19.473+0000","up_votes":1,"down_votes":5,"body":"> [{quoted}](name=Lický,realm=EUW,application-id=MJVj50Jw,discussion-id=6jo7pQT2,comment-id=0001,timestamp=2018-07-13T12:34:49.943+0000)\n>\n> L&#x27;obiettivo della Riot è quello di creare una sorta di gruppo di riabilitazione utenti. Che cosa voglio dire? Bé semplicemente che la Riot vuole evitare a tutti i costi di bannare un player e cercare di &quot;riabilitarlo&quot; dandogli delle punizioni in un certo senso &quot;meritevoli&quot;. Rumors dicono che la riot in futuro ha intenzione di bloccare un videogiocatore dal giocare altre partite in modo da evitargli di tiltare o trollare in game con un messaggio del tipo &#x27;**Abbiamo visto che non tutti i tuoi game stanno andando bene**, prenditi una pausa!&#x27;. Non so del tutto i piani della Riot però se tutto questo dipendesse da loro penso già avrebbero risolto, ma pensandoci il problema parte da noi. Quindi facciamoci un&#x27;esame di coscienza.\n\n\n\n\n\n\n\n\nQuesto mi pare strano uno ha dei giorni no è la riot lo banna!!!\nNon ho capito?","replies":[{"poster":"RGM Player","date":"2018-07-13T23:04:54.827+0000","up_votes":1,"down_votes":0,"body":"Tutti hanno dei giorni no, ma quei giorni non ti consentono di sfogarti su altre persone insultandole e augurandoli la morte. Hai un giorno no? La riot ti da 7 giorni per riflettere, poi ti da altri 14 giorni per riflettere meglio(preceduti da una punizione meno severa), se non cambi nell'arco di quei giorni, vuol dire che non vuoi cambiare e quindi riot ti permabanna.","replies":[{"poster":"HarukiHaru","date":"2018-07-14T06:18:04.060+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=KUROKAMI00,realm=EUW,application-id=MJVj50Jw,discussion-id=6jo7pQT2,comment-id=000100000000,timestamp=2018-07-13T23:04:54.827+0000)\n>\n> Tutti hanno dei giorni no, ma quei giorni non ti consentono di sfogarti su altre persone insultandole e augurandoli la morte. Hai un giorno no? La riot ti da 7 giorni per riflettere, poi ti da altri 14 giorni per riflettere meglio(preceduti da una punizione meno severa), se non cambi nell&#x27;arco di quei giorni, vuol dire che non vuoi cambiare e quindi riot ti permabanna.\n\nQui hai ragione,io pensavo che il ban era perchè uno giocava male,difatti mi pareva strano","replies":[]}]}]}]},{"poster":"ArgotFalcon","date":"2018-07-14T09:55:59.867+0000","up_votes":2,"down_votes":0,"body":"In tutti i giochi ci sono giocatori cancerogeni che rovinano l'esperienza di gioco.\nBasta pensare ai dodicenni su cod che flammano in continuazione,bannare un account sarebbe un metodo inutile se ad un tizio gli bannano l'account come minimo ne avrà un altro.\nE bannare da ip è una cosa ingiusta perchè se io flammo e offendo i francesi(esempio random lo gggiuro) e vengo bannato da ip quindi anche con un altro account non potrei giocare perchè mio fratello deve essere bannato anche lui senza aver fatto nulla?\nQuesto metodo viene usato nei server multyplayer di minecraft e guarda caso in quei server un altro po' ci sono solo gli admin.","replies":[]},{"poster":"Aurelion Shmoll","date":"2018-07-13T12:08:08.998+0000","up_votes":2,"down_votes":2,"body":"{{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"lStardustl","date":"2018-07-14T11:02:22.659+0000","up_votes":1,"down_votes":3,"body":"Bannare l'IP srebbe semplice ed efficacie.","replies":[]}]}