{"poster":"Ehukai The Dog","date":"2016-01-14T15:50:44.908+0000","title":"Solo con gente di leghe \"forti\" in solo queue?","subforum":"Discussioni generali","up_votes":2,"down_votes":1,"body":"Se ho postato in un punto sbagliato eliminatelo pure...Sono arrivato al livello 30 settimana scorsa, da allora mi son ritrovato sempre in partite con gente minimo silver ma molto spesso gold. Vorrei sapere se &egrave; dovuto alla nuova stagione oppure no. Mi spiace ma sono parecchio scarso rispetto agli altri e quasi sempre non riesco a contribuire quanto vorrei...\r\n\r\nGrazie.","replies":[{"poster":"Killer SurpRyze","date":"2016-01-15T10:15:12.810+0000","up_votes":1,"down_votes":0,"body":"negli ultimi 2 mesi circa, è così. Non so perché. Si trova anche gente gold contro o con under 30","replies":[{"poster":"Ziovi","date":"2016-01-15T11:44:07.352+0000","up_votes":1,"down_votes":0,"body":"negli ultimi due mesi? accadeva anche quando io stavo avvicinandomi al livello 30, un paio di anni fa...\nCribbio, quando ero un livello 30 fresco fresco mi è pure toccato un challenger in squadra avversaria (eclissiamo sul risultato, per favore)","replies":[{"poster":"Killer SurpRyze","date":"2016-01-15T14:09:28.579+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ziovi,realm=EUW,application-id=MJVj50Jw,discussion-id=mya3I6k0,comment-id=00020000,timestamp=2016-01-15T11:44:07.352+0000)\n>\n> negli ultimi due mesi? accadeva anche quando io stavo avvicinandomi al livello 30, un paio di anni fa...\n> Cribbio, quando ero un livello 30 fresco fresco mi è pure toccato un challenger in squadra avversaria (eclissiamo sul risultato, per favore)\n\nboh, si vede che io sono stato fortunato: da aprile a ottobre, mi è parso abbastanza equilibrato","replies":[{"poster":"Ziovi","date":"2016-01-15T14:44:47.438+0000","up_votes":1,"down_votes":0,"body":"non saprei come va in questi tempi... stavo dicendo che quando si è vicini al livello 30 o ci si è appena arrivati il matchmaking sembrava sballare un po', almeno quando è successo a me.\nAdesso non saprei dire, io al livello 30 ci sono da un bel po' e di solito le squadre non sono troppo squilibrate.","replies":[]}]}]}]},{"poster":"Ziovi","date":"2016-01-15T11:44:36.762+0000","up_votes":1,"down_votes":0,"body":"Continua a giocare, con il tempo si sistema.","replies":[]},{"poster":"GreenArroww","date":"2016-01-15T11:13:51.793+0000","up_votes":1,"down_votes":0,"body":"Se sono normal possono anche servire a te per imparare a giocare meglio, io per un periodo mi sono trovato spesso contro platini alti e diamond ed ero felice, specilamente quando li distruggevo, quindi vedila come un'occasione per diventare più forte","replies":[]},{"poster":"Ste the ripper","date":"2016-01-15T10:20:13.130+0000","up_votes":1,"down_votes":0,"body":"Conta 2 cose:\n1. La scorsa season regalavano il gold, un sacco di gente lo ha fatto solo con le placement che è un'assurdità\n2. Il matchmaking in normal fa cagare ultimamente, partite sbilanciatissime","replies":[]},{"poster":"Danioku","date":"2016-01-14T16:45:14.947+0000","up_votes":1,"down_votes":0,"body":"Mah, se vieni matchato con giocatori di quel livello, significa che, grossomodo, anche tu sei di quel livello. E poi ehm... quelle di cui parli sono leghe deboli, debolissime.....","replies":[]},{"poster":"Ucr0niA","date":"2016-01-14T16:26:42.264+0000","up_votes":1,"down_votes":0,"body":"Si dovrebbe stabilizzare col tempo.\nComunque non farti intimorire e gioca sereno, sono normal, sono e devono essere per te un campo di prova in cui migliorare non devi fartene preoccupazioni.","replies":[]}]}