{"poster":"syrixs224","date":"2015-10-28T08:41:09.035+0000","title":"Late zu stark?","subforum":"Champions & Gameplay","up_votes":1,"down_votes":4,"body":"Hallo Mitbeschw&ouml;rer , \r\n\r\nIch hatte in den letzten paar Rankeds ein paar Erfahrungen mit Late Champions wie : Jax , Kassadin , Yi , Trynda  , Nasus usw. Dann ist mir sehr aufgefallen dass sie (zumindest manche) einfach viel zu Stark im Late sind . Nat&uuml;rlich sollte sie man dann nicht ins Late lassen , aber wenn die dann 2-3 Starke Verteidiger haben wird es sehr schwer. Wir wurden von nem Kassadin der am Anfang 0/6 stand, im Late so sehr auseinander genommen das war nicht mehr feierlich. (Andere Champions nat&uuml;rlich auch ) . Ich denke auch wenn sie das Starke Late mit ihrem schwachen Early (was Jax trotzdem einigerma&szlig;en Safe haben kann , genauso wie Trynda) kompensieren sollen , ist es einfach unm&ouml;glich zu gewinnen . Die Situation z.B : Wir focusen den Kassadin , werden nebenbei vom Jax auseinandergenommen ( da er voher die Auto-Attacks usw gedoged hat) versuchen wir den Jax zu focusen geht das nicht weil er halbwegs Tanky ist. Wie steht ihr zu den Late Champions?","replies":[{"poster":"Kata Ga Kill","date":"2015-10-28T08:42:46.210+0000","up_votes":4,"down_votes":0,"body":"Faire sache den im Early losen die total","replies":[{"poster":"syrixs224","date":"2015-10-28T09:02:36.352+0000","up_votes":1,"down_votes":3,"body":"Eben nicht . Spielst du Jax kommst du unterm Tower super klar . Trynda kommt mit der Ultimate super im early zurecht. Nur Kassa hats schwer ( von den Beispielen her)","replies":[{"poster":"Alustus","date":"2015-10-28T09:19:45.614+0000","up_votes":2,"down_votes":0,"body":"Nur weil dir ein Gegner unterlegen ist musst du ihn nicht unter den Tower pushen.\nDu kannst die minions auch auf deiner Hälfte halten und jax zonen.\n(Setzt aber voraus das du freezen usw, kannst.)\n\nAußerdem verliert so jax über kurz oder lang einiges an Farm bzw. sein Tower verliert einiges an Leben.","replies":[]},{"poster":"Kata Ga Kill","date":"2015-10-28T16:20:04.380+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=syrixs224,realm=EUW,application-id=Wj1wcocU,discussion-id=35dtujAk,comment-id=00000000,timestamp=2015-10-28T09:02:36.352+0000)\n>\n> Eben nicht . Spielst du Jax kommst du unterm Tower super klar . Trynda kommt mit der Ultimate super im early zurecht. Nur Kassa hats schwer ( von den Beispielen her)\n\nWo kommt Trynda im Early bitte super zurecht???\nVor Lv6 ist er total Useless und Poke anfällig, die Ulti ist kein Powerspike, heist wenn andere Champs Lv6 erreichen besitzen die mehr Burst.\nTrynda skalliert NUR mit dem Gold  -> Items. Haste Fuil Build zerstört er mit jedem Autohit Crit.\n\nUnd selbst mit Ulti bist Poke anfällig, wäre die CD nur 30 Sekunden wäre das was anderes Thema, aber mit 120 sek CD ist das ne once in a life time chanche. Bedenke nebenbei das normale Spieler nicht stehen und Trynda headon fighten werden.\nNormale Spieler gehen auf Distanz und Kiten Ihn mit wenigen Schlägen KO bzw. warten sie kurz die Ulti aus und Asta la Vista Trynda.\n\nVllt mag das bei Noobs klappen....\n\nAber er ist immer noch eine Glasskanonen Melee der nur auf AA basiert, das heist er verliert jeden Teamfight weil er als erstes focusiert wird und schnell stirbt und die Ulti lässt dir nur 2 Optionen: Flucht oder stirbst in dem du vllt 1-2 oder keinen killen kannst wegen CC und Movement. \n\nAls 1on1 Splitpusher ist es Tryndas wahre stärke und sie ist auch Fair, den seine erwähnten schwächen sind gravierend.","replies":[]},{"poster":"MeIsTeR MaNne","date":"2015-10-28T14:51:20.427+0000","up_votes":1,"down_votes":0,"body":"Schonmal Gnar gegen Jax gespielt? Er kommt nirgends klar. Gnar ist so nervend ^^ da macht er nichts auch nicht unterm Tower.\n\nLg Kraxxm","replies":[]}]}]},{"poster":"BìgM","date":"2015-10-28T09:05:50.769+0000","up_votes":2,"down_votes":0,"body":"Wenn ein Team 2/5 Lategamechampions hat, dann ist es die Aufgabe des Gegners, das Spiel so früh wie möglich zu beenden.\nDenn sonst tritt der Fall ein, den du am eigenen Leib spüren durftest.\nWer das nicht schafft, ist entweder nicht gut genug oder hat es nicht anders verdient.\n\nIch find das relativ fair.\nWer einen Nasus mit 1000 Stacks bis zur 50. Minute kommen lässt, der muss sich nicht wundern, wenn der full build alles klein holzt.\nJax und Kassadin halt eben auch. So sind die Champions halt konzipiert.","replies":[{"poster":"HyperionCH","date":"2015-10-28T10:11:03.298+0000","up_votes":3,"down_votes":0,"body":"Alternativ kann man natürlich selber z.B. 2 Late Game Champs picken. Dann ist es recht ausgeglichen.\n\nBeim beschriebenen Game hatte das Team des TE nämlich auch einen Veigar und eine Tristana; beide sind sehr übel im Late.\nIm Normalfall müsste ein Veigar im Late den Kassa one-shoten.\n\nEs gibt also 2 Optionen:\n\nOption 1: Early-Game Champs picken.\nIn diesem Fall muss man unbedingt im early einen Vorsprung erspielen (gut farmen, durch Zonen dem Gegner Farm verhindern, früh auf Objectives gehen, etc.) und so das Game frühzeitig entscheiden.\n\nOption 2: Late-Game Champs picken.\nDamit ist es wieder ausgeglichen und der bessere Umgang mit diesen Champs entscheidet das Game.","replies":[]}]},{"poster":"Alustus","date":"2015-10-28T09:04:01.414+0000","up_votes":2,"down_votes":0,"body":"Wie gesagt dafür sind sie Early alles andere als gut.\n\nUnd ich würde auch nicht sagen zu stark.\nWenn man richtig Spielt und nicht die komplett falschen champions hat kann man diese immer noch besiegen.\nEinen Nasus kann man kiten/zonen\nGegen Jax und Trynda sind ignite und Thornmail gut\nKass muss/sollte man oneshotten oder eine cc chain machen. (hat 1 skillcoombo dan ist er nahe zu useless bis er sie wieder up hat)\n\nWenn man alle 3 als gegner hat wird das ganze Schwerery aber immer noch möglich wenn man denf ocus richtig setzt und zum richtigen zeitpunkt wieder ändert.","replies":[]},{"poster":"MeMyselfandBaal","date":"2015-10-28T12:48:59.517+0000","up_votes":1,"down_votes":0,"body":"Lategame Champions sind voll gut. Weil sie dem Spiel eine weitere taktische Variante hinzufügen. Wenn alle Champions dieselben \"Powerspikes\" hätten, wäre der Begriff \"Powerspike\" völlig irrelevant. Und zu wissen, wann man selber gerade stark ist, ist ein entscheidendes Element in LoL.\n\nUnd nur so nebenbei: Das Spiel gegen Kassadin-Jax verliert ihr nicht wegen den Late-Game Powerspikes der beiden. Ihr verliert es, weil der Gegner 5 Drachen habt und ihr 0. \nWenn der gegnerische Kassadin in der Lane so vernichtend geschlagen wird, warum nutzt ihr die Zeit, die der in der Basis verbringt, nicht um mal den einen oder anderen Drachen zu machen? Und ja, man muss seine Vorteile auch ausnutzen können...\n\nWenn du dir die Matchhistory noch mal anguckst, wird dir auffallen, dass es relativ häufig große rote Punkte gibt. Also \"gewonnene Teamfights\"... Dass danach aber nie Objekte wie der Drache genommen werden.","replies":[]},{"poster":"Nephirelle","date":"2015-10-28T09:02:39.560+0000","up_votes":1,"down_votes":0,"body":"Nicht das Spiel durch sinnloses Killchasen in die Länge ziehen, sondern konsequent Objectives nehmen wo sich auch nur die kleinste Gelegenheit bietet. Dann ist's Essig mit dem Lategame.","replies":[]}]}