{"poster":"Salzkönigin","date":"2017-08-06T19:32:17.139+0000","title":"Endside Gaming - Multigaming Clan sucht neue Member","subforum":"Clans & Teams","embed":{"description":"Endside Gaming clanzilla.de","url":"https://endside-gaming.de/","image":"https://endside-gaming.de/images/specialslider/5.jpg"},"up_votes":11,"down_votes":8,"body":"_**Hey Beschw&ouml;rer!**_\n\nWir von Endside Gaming suchen Mitglieder, Teams, Streamer und ein neues Mainteam !\n\nZu Beginn ein paar Informationen &uuml;ber uns.\nWir sind eine Community, welche bereits seit 2011 besteht und st&auml;ndig w&auml;chst.\nDie Hauptbereiche werden in Counter Strike, Overwatch, Hereos of the Storm und nat&uuml;rlich League of Legends aufgeteilt.\nEs werden aber noch andere Spiele wie zB Pubg gespielt.\nDie Community besteht aus ca 450 aktiven Mitgliedern und ist momentan im Begriff, ein eingetragener Verein zu werden.\nJetzt kommst du ins Spiel! Wenn du Lust auf eine starke, freundliche und treue Community hast, bist du hier genau richtig.\nHier habt ihr die M&ouml;glichkeit einfach nur Spa&szlig; am Spiel zu haben oder auch etwas Gr&ouml;&szlig;eres zu erreichen. Dein Lol Rang ist hierbei nicht relevant &ndash; jeder ist Willkommen.\n\n**Was erwarten wir von euch:**\n\n* Ein Mindestalter von 16 Jahren\n* Eine gewisse geistige Reife\n* Kein Flaming, weder nach Innen noch nach au&szlig;en\n* Aktive Teilnahme in der Community\n* Und nat&uuml;rlich Spa&szlig; am Spiel!\n\n**Was wir euch bieten:**\n\n* Eine Homepage (endside-gaming.de)\n* Eine aktive Community\n* Regelm&auml;&szlig;ige Events wie z. B. Fun-Gamemode-Abende etc\n* Die M&ouml;glichkeit, Teams zu erstellen bzw. beizutreten und dabei unterst&uuml;tzt zu werden\n* Mehrere Clantreffen im Jahr\n\nZudem laden wir die Mitglieder der Community dazu ein an monatlichen 1 vs 1 Turnieren teilzunehmen. Der Sieger wird mit einem Preisgeld belohnt.\nAu&szlig;erdem veranstalten wir zwei mal im Jahr, ein Charity Turnier in den Spielen CS:GO, LoL oder Overwatch. Bei den letzten beiden erfolgreichen Veranstaltungen war es uns dank Spenden m&ouml;glich,\nSummen von &uuml;ber 1000&euro;/6500&euro; (CS) 4000&euro; (OW) an die Deutsche Krebshilfe so wie zus&auml;tzlich 1300&euro; (LoL) an die St. Anna Krebskinderforschung zu &uuml;berreichen.\n\nHaben wir euer Interesse geweckt?\nBesucht uns doch einfach auf unserem Teamspeak: _**endside-gaming.de**_ und meldet euch dort bei einen Memberbetreuer (gr&uuml;ner Stern) oder schaut auf die HP.\n\n**Ihr k&ouml;nnt uns auch gerne Ingame unter folgenden Namen kontaktieren:**\n\nSalzk&ouml;nigin\nBlinkeding\nEsg Aerandir\n\n\nWir freuen uns &uuml;ber jeden neuen Member und hoffen, schon bald mit euch spielen zu k&ouml;nnen!\n\n_**Mit freundlichen Gr&uuml;&szlig;en,\ndie League of Legends Adminschaft von Endside-Gaming**_","replies":[]}