{"poster":"shirohige XD","date":"2018-01-13T15:21:36.558+0000","title":"que es el pick rate?","subforum":"Charlas Generales","up_votes":4,"down_votes":0,"body":"alguno me puede decir que es","replies":[{"poster":"DanteV","date":"2018-01-13T17:08:08.049+0000","up_votes":1,"down_votes":1,"body":"el porcentaje que es pickeado un champ dentro de las ranked, se puede confiar mas en el pick rate que en el win rate para saber que un champ esta fuerte","replies":[{"poster":"Borriic III","date":"2018-01-14T18:26:40.459+0000","up_votes":1,"down_votes":0,"body":"lee sin es una bosta y tiene uno de los pick rates mas altos del juego con casi un 20% (osea esta en una de cada 5 partidas)\n\nanivia bien jugada es probablemente uno de los champs mas fuertes del juego y se pickea muy poco, tiene cas 3% de pick rate (osea aparece en una de cada 33 partidas)\n\npick rate = popularidad\nwin rate = eficiencia","replies":[{"poster":"DanteV","date":"2018-01-14T20:07:46.614+0000","up_votes":1,"down_votes":0,"body":"{{champion:82}} casi 53% de win rate segun eso el champ esta fuertisimo, dentro del meta, inclusive roto, pero, pick rate 0.6% el win rate que tiene es solo porque lo juega un grupo minimo de personas que son mains y otp.\n{{champion:9}}  win rate de 54,4% aplica lo mismo, 0,8%, win rate alto solo porque lo juegan personas main y otp.\ncampeones completamente fuera del meta pero con win rate alto por su diminuto mundo de jugadores","replies":[{"poster":"Borriic III","date":"2018-01-15T04:09:14.327+0000","up_votes":1,"down_votes":0,"body":"Pero la gente que los juega gana no?  ¯\\_(ツ)_/¯\n\nahora si hablamos de champs rotos es lo mismo de siempre, que logra combinar eficiencia y popularidad, tipo amumu, sejuani, twitch o malza o esa clase de cosas que la gente pickea cuando se aburre de querer parecer pro y se decide a subir elo","replies":[]}]}]},{"poster":"WhiteMax","date":"2018-01-13T21:12:36.948+0000","up_votes":2,"down_votes":2,"body":"> se puede confiar mas en el pick rate que en el win rate para saber que un champ esta fuerte\n\n???????????????????{{champion:157}} {{champion:64}} {{champion:67}} {{champion:412}} {{champion:122}}??????????","replies":[]}]},{"poster":"Hwaxinghz","date":"2018-01-13T15:45:53.679+0000","up_votes":1,"down_votes":0,"body":"[Él](https://boards.las.leagueoflegends.com/es/c/charlas-generales/mE0386sd-que-es-el-pick-rate?comment=0000) ya te ha respondido al respecto, pero te añado lo siguiente:\n\nLa gran mayoría de las páginas que muestran el PickRate de un campeón, lo hacen sólo tomando en cuenta estadísticas de partidas Clasificatorias de Platino para Arriba (No considera Normales)\n\nAlgunas páginas, como Las.op.gg, muestran un PickRatio bastante acertado para ligas más bajas, pero tampoco es extremadamente seguro.","replies":[]},{"poster":"Bienzahar","date":"2018-01-13T15:31:46.264+0000","up_votes":1,"down_votes":0,"body":"El porcentaje de jugadores que pikearon a cierto champ tomando como universo el total de jugadores que jugaron ranked durante cierto.","replies":[]},{"poster":"Annie Botz","date":"2018-01-13T15:30:03.429+0000","up_votes":1,"down_votes":0,"body":"Es el porcentaje de uso de cierto campeón en una partida. \nEj: Según las.op.gg {{champion:64}} tiene 25% pick rate, es decir, se usa en 1/4 partidas.","replies":[]}]}