{"poster":"N1k014","date":"2019-03-18T01:41:27.387+0000","title":"Opinión sobre el rework de Kayle","subforum":"Charlas Generales","up_votes":2,"down_votes":3,"body":"Me parece un total disparate este rework, el campeón puede carrear una partida sin importar como vaya, su daño, habilidades, sustain son absurdos en juego tardío y por eso me da tanto asco. Entiendo que no es fácil hacer un rework que a la mayoría de los invocadores les parezca correcto, pero si hacen disparates así como con kayle, morgana, akali, etc no hagan más reworks. Saludos.","replies":[{"poster":"PCtronix","date":"2019-03-18T01:44:34.889+0000","up_votes":1,"down_votes":0,"body":"lo de morgana solo fue un rework visual ..\n\ny por lo de akali/kayle fue un rework muy absurdo ... la cosa tambien es que si quieren balancear completamente el juego tienen que reworkear a todos los antiguos para que esten mas \" rotos \" ... pero es mas la comunidad quienes molestan para pedir reworks a campeones \" olvidados \", yo sigo diciendo que odio el rework que le hicieron a poppy, la antigua destrozaba pero como a nadie le gustaba en diseño y en habilidades era confuso la reworkearon para que la comunidad usara a un personaje mas \" facil \" y a la vez agradable de ver ...","replies":[{"poster":"Nightmaresparkle","date":"2019-03-19T18:48:10.333+0000","up_votes":1,"down_votes":0,"body":"Si e hicieron un trabajo muy bueno verdad colocándole una mecánica tan absurda como su invisibilidad en torres la verdad los reworks solo deberian ser esteticos y ya como morgana/ezreal","replies":[]}]},{"poster":"Nightmaresparkle","date":"2019-03-19T18:46:10.054+0000","up_votes":1,"down_votes":0,"body":"LOS REWORKS QUE HACE RIOT LASTIMOSAMENTE ESTA HECHA POR GENTE QUE NI SIQUIERA JUEGA LOL ES SOLO GENTE QUE QUIERE HACER QUE EL JUEGO SE VEA ESPECTACULAR Y GANAR DINERO CON ESO, NO SE MUCHO DE KAYLE PERO SI DE AKALI  Y LASTIMOSAMENTE LO ÚNICO QUE QUEDA DE AKALI ES  EL NOMBRE ES UNA LASTIMA QUE ELIMINARAN UN CAMPEÓN TAN BONITO ESTOS REWORKS LO UNICO QUE HACEN ES HACER QUE LA GENTE QUE JUGABA ESTOS CAMPEONES REWORKEADOS SIMPLEMNTE ABANDONEN EL JUEGO BUENO YA QUE A RIOT LE VALE CULO LA COMUNIDAD PUES ES PREFERIBLE SOLO DEJAR DE JUGAR Y YA","replies":[]},{"poster":"keinproblem","date":"2019-03-19T08:43:06.594+0000","up_votes":1,"down_votes":0,"body":"Esta complicada la cosa. Hoy jugue contra una kayle a la que no le fue tan bien en early (tampoco le fue muy mal). El problema fue que en late splitpusheo como un trynda cualqueira y se farmeo todas las oleadas de los minions que existian, y como no teniamos hard cc fue imposible frenarla. Tiraba torres en 3 segundos y farmeaba oleadas enteras con 2 basicos. Me parece genial que tenga un mal early y en late sea fuerte, pero creo que esta un poquito demasiado fuerte en late. Tal vez lo mejor seria quitarle un poco de daño en late y darle mas sustain en early o algo asi, no se. Pero se le viene un nerf en el siguiente parche asi que trank","replies":[]},{"poster":"Tsukuyomi100","date":"2019-03-18T14:38:35.755+0000","up_votes":1,"down_votes":0,"body":"tipico comentario de novato {{sticker:slayer-jinx-unamused}}","replies":[]},{"poster":"SrShadowSenpai","date":"2019-03-18T02:44:31.126+0000","up_votes":1,"down_votes":0,"body":"Kayle sufre mucho en early, tienes que jugar super agresivo para que la kayle quede muy atrás a comparación de su team, debes ganarla antes del nvl16,o que el adc o mid estén feedeados.","replies":[]},{"poster":"Pollo al Ornno","date":"2019-03-18T02:30:17.009+0000","up_votes":1,"down_votes":0,"body":"a morgana no le cambiaron absolutamente nada xd\n\nKayle es un campeon que hasta nivel 11 tenes que abusar completamente de ella retrasando su punto fuerte.\n\nEl campeon esta roto pero es muy facil de hacer counter, igual que la vieja kayle.","replies":[]}]}