{"poster":"IllllllIIIIlllll","date":"2016-01-27T06:14:27.160+0000","title":"Silver player explains the relative importance of objectives","subforum":"Gameplay","up_votes":26,"down_votes":2,"body":"Here is the relative importance of objectives:\r\n\r\n1. Nexus\r\n2. Inhibitor\r\n3. Baron\r\n4. Mid turret/inner turrets\r\n5. Dragon\r\n6. Outer turret on side line\r\n7. Kill\r\n8. Buffs\r\n\r\nHowever, here is how my team values objective:\r\n\r\n1. Flash mastery icon and spam laugh at exposed nexus\r\n2. Try to get a kill fountain diving\r\n3. Spam dance on a warded area\r\n4. Kill\r\n5. Buffs\r\n6. Dragon\r\n7. Turret\r\n8. Baron\r\n9. Nexus\r\n\r\n-____-","replies":[{"poster":"420Templar","date":"2016-01-27T09:16:55.962+0000","up_votes":12,"down_votes":0,"body":"My team's priority for objectives when I'm jungling:\n\n0) Kills (and yelling at me when I take them)\n1) My Chickens\n2) My Gromp\n3) My buffs\n4) My Wolves\n5) My Krugs\n6) My Scuttle Crab\n7) Feeding the Enemy Team\n8) Whichever epic monster I am further away from\n9) Ganks (only when I'm on the opposite side of the map)\n10) Towers\n11) Inhib\n12) Baron (Note: If their nexus is exposed and their team is aced, this is priority numero uno)\n13) Kills\n14) Nexus","replies":[]},{"poster":"Lost Hp","date":"2016-01-27T08:28:19.181+0000","up_votes":7,"down_votes":0,"body":"And in reality it looks something like this >_>\n\n01. Nexus\n02. Nexus turrets    \n03. Inhibitor\n04. Inner turrets\n05. Baron\n06. 5 Dragon\n07. Mid turrets\n08. Outer Turrets\n09. 1 Dragon\n10. Kills on damage dealers\n11. 3 Dragon\n12. 2 Dragon\n13. 4 Dragon\n14. Kills on supporters\n15. Rift Herold\n16. Blue Buff\n17. Red Buff\n","replies":[{"poster":"SH Azykan","date":"2016-01-28T05:57:50.990+0000","up_votes":1,"down_votes":0,"body":"I feel like 5th drag is better than baron. Not really much a team can do to fight a 5th drag team. so you are gonna get dove and objectives will be taken.","replies":[]}]},{"poster":"jaymc1130","date":"2016-01-27T06:28:51.973+0000","up_votes":6,"down_votes":1,"body":"> [{quoted}](name=IllllllIIIIlllll,realm=NA,application-id=3ErqAdtq,discussion-id=VgGcXNbl,comment-id=,timestamp=2016-01-27T06:14:27.160+0000)\n>\n> 1. Flash mastery icon and spam laugh at exposed nexus\n> 2. Try to get a kill fountain diving\n> 3. Spam dance on a warded area\n\nI'm guilty of these.\n\nAnd I play in diamond.\n\nJesus I suck at this game...","replies":[{"poster":"1 800 MID LANE","date":"2016-01-27T06:30:52.334+0000","up_votes":9,"down_votes":2,"body":"I'd do this in Challenger just because fuck it, I'm in Challenger.","replies":[{"poster":"HayRoss","date":"2016-01-27T16:45:57.867+0000","up_votes":1,"down_votes":9,"body":"http://s11.postimg.org/awsy756k3/picture.png","replies":[{"poster":"1 800 MID LANE","date":"2016-01-27T16:57:53.381+0000","up_votes":8,"down_votes":0,"body":"I said \"I'd\" which means \"I would.\"\n\nYou have no point other than to insult someone just because.","replies":[{"poster":"HayRoss","date":"2016-01-27T22:29:08.296+0000","up_votes":1,"down_votes":7,"body":"It's not an insult. It's just simply a true statement. Saying you are in Bronze II is not an insult, a compliment, or anything of the sort. It is but a fact","replies":[{"poster":"1 800 MID LANE","date":"2016-01-27T22:35:28.745+0000","up_votes":6,"down_votes":0,"body":"But it's still completely irrelevant to the conversation. Why would you point it out for any other reason? It has literally done nothing but show you have no comprehension of what I was originally saying. What I'm getting, and I'm sure others thought the same, is that you were trying to call me out on lying about my rank when I wasn't.","replies":[{"poster":"HayRoss","date":"2016-01-27T22:39:23.103+0000","up_votes":2,"down_votes":3,"body":"Admittedly, I did misread your first comment as saying you were Challenjour. I normally find people who look up ranks to win arguments as fuckwits, but seeing a totally random person claim to be in the what, top 5,000 of all people who play this game out of the 20,000,000 or so who play it to be a bit skeptical. Do your best, and you can make it to Challenger one day. Sorry for this mix up","replies":[]}]}]}]}]},{"poster":"jaymc1130","date":"2016-01-27T06:31:58.590+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=gabeneaesir,realm=NA,application-id=3ErqAdtq,discussion-id=VgGcXNbl,comment-id=00020000,timestamp=2016-01-27T06:30:52.334+0000)\n>\n> I'd do this in Challenger just because fuck it, I'm in Challenger.\n\n\"YOLO SWAAGGGGG MOFOS!!!! Come at me brah, 1v1 me in dragon pit.\" - in a ranked match, cuz why the hell not. Lololololol.","replies":[]}]}]},{"poster":"Artum Tsumia","date":"2016-01-27T07:10:23.425+0000","up_votes":2,"down_votes":0,"body":"The priorities of objectives, and similarly knowing when a specific objective has been opened up as a target is something I find my self trying to convey to far too many players. Too many times you get things like a bad Baron call over the easy tower plus inhibitor. Or the entire enemy team decides to roam Top and your team neither takes the opportunity to take Dragon or push lanes and take a turret.\n\nIt's important to remember that the most important objective is the Nexus, regardless of how tempting something else might be.","replies":[{"poster":"Maszii","date":"2016-01-27T14:26:17.190+0000","up_votes":3,"down_votes":0,"body":"Welcome to Silver/Gold, where you get flamed for taking turrets while your team fights 4v5 by a retarded engage anyways.","replies":[{"poster":"Space Bum","date":"2016-01-27T23:46:45.183+0000","up_votes":1,"down_votes":0,"body":"Too many times. I was in a sure loss game this one time and I actually got through to my team and got them to stop fighting all together. The other team was full on team death match mode but would not dive for it. It took 20minutes but I took out the Nexus while they were running back and forth between trying to stop me and trying to team fight. Beautiful game.","replies":[]}]},{"poster":"NichtHurz","date":"2016-01-27T19:56:53.730+0000","up_votes":1,"down_votes":0,"body":"I've got some guys in my friendlist who are the worst kind of bronze player. Not that they're flaming all the time (at least when I'm with them), but they are convinced to know every little thing about the game and that they should be Platinum at least. The baron calls those guys make are insane, they just want to take the baron at every single point of the game, they act towards baron as if it was a 100hp Nexus surrounded by 100hp enemies waiting to be finished.\nI try to teach them a bit (I'm silver right now, due to new season, but I play the game long enough to know any champions abilities and the basic stuff such players still lack), but somehow they all got the wrong idea about really basic things and often refuse to learn them. \"I'm tank, I don't need boots, I'm a mage and I get bursted by Kassadin anyways, I don't need boots, I'm an adc and I deal tonz of damage, I don't need boots\"","replies":[]}]},{"poster":"Raka Flaka MD","date":"2016-01-27T06:21:36.476+0000","up_votes":3,"down_votes":0,"body":"Each game is different. Sometimes a dragons better then a tower and some times a Nexus is better then a baron (if we can end the game just end we don't need baron every ace). The objectives very from game to game so it's hard to list what is better over what..","replies":[]},{"poster":"TheStevenWu","date":"2016-01-27T19:40:18.097+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=IllllllIIIIlllll,realm=NA,application-id=3ErqAdtq,discussion-id=VgGcXNbl,comment-id=,timestamp=2016-01-27T06:14:27.160+0000)\n>\n> Here is the relative importance of objectives:\n> \n> 1. Nexus\n> 2. Inhibitor\n> 3. Baron\n> 4. Mid turret/inner turrets\n> 5. Dragon\n> 6. Outer turret on side line\n> 7. Kill\n> 8. Buffs\n> \n> However, here is how my team values objective:\n> \n> 1. Flash mastery icon and spam laugh at exposed nexus\n> 2. Try to get a kill fountain diving\n> 3. Spam dance on a warded area\n> 4. Kill\n> 5. Buffs\n> 6. Dragon\n> 7. Turret\n> 8. Baron\n> 9. Nexus\n> \n> -____-\n\nJust a bit of perspective for you (I can be wrong). Importance of Objectives:\n\n1. Nexus\n2. Nexus turrets\n3. Inhibitor\n4. Inhibitor turrets (it greatly exposes their base)\n5. Baron (is usually used to get inhibitor and their turrets, therefore ranked below)\n6. Inner Turret\n7. Outer Turret\n8. Dragon (depends on how many you and enemy team has, and how late the game is)\n9. Kills\n10. Buffs\n\nHow you team value objectives (non-troll version, silver):\n\n1. KDA\n2. Baron\n3. Dragon\n4. Turrets\n5. Inhibitors\n6. Nexus\n7. Buffs","replies":[{"poster":"Gooberp","date":"2016-01-28T01:27:52.143+0000","up_votes":2,"down_votes":0,"body":"I would probably rank Inhibitor above Nexus turrets, 5th dragon above Baron (it's much easier to kill and gives a comparable buff), and 1st/4th dragon above Inner/Outer Turrets. (4th because it then turns the next dragon into 5th dragon, becoming a map objective just as important as Baron)","replies":[{"poster":"TheStevenWu","date":"2016-01-28T02:16:55.726+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Gooberp,realm=NA,application-id=3ErqAdtq,discussion-id=VgGcXNbl,comment-id=00100000,timestamp=2016-01-28T01:27:52.143+0000)\n>\n> I would probably rank Inhibitor above Nexus turrets, 5th dragon above Baron (it's much easier to kill and gives a comparable buff), and 1st/4th dragon above Inner/Outer Turrets. (4th because it then turns the next dragon into 5th dragon, becoming a map objective just as important as Baron)\n\nMaybe. I personally feel destroying nexus turrets open up more opportunities than inhibitors. the game is pretty much over once the turrets are down since the only way for the winning team to lose is to get aced. You want to contest baron/5th dragon? Better hope no one is backdoors or teleports to a ward in your base.  Want to defend your other inhibitors? Nope.  At the same time, having no turrets at the base takes away your opponents defending advantage. While taking out inhibitors still give the opposing team the chance to defend under tower.\n\n5th Dragon is definitely ranked above baron (most of the time). It just happens so rarely (at least at my level) that I didn't care to consider it and simply lumped dragon as an overall objective. For most of the game, dragon is worth less than the other objectives.\n\n1st dragon should be prioritized above out turrets only when you are well into the game. the 10% early does nothing for you; but turret gold is quite significant. If you watch the pro games, you'll notice they ignore dragon most of the time and aggressively push turrets. The concept is similar for inner turrets (however dragon does become more important at this stage now that people have gold, levels, and items). However, you're usually able to take dragon on your back after you take down the inner turret, so I'd still rank inner turret above dragon.\n\nDragon is tricky to rank because it's very situational. However, in general, I feel dragon's priority is just not that high overall. It's more like a luxury item for most of my games.","replies":[]}]}]},{"poster":"macromite","date":"2016-01-27T23:57:57.273+0000","up_votes":2,"down_votes":0,"body":"your objetive focus is wrong, the actual ogjective focus should be thusly.\n\n1. take whatever is free.\n2. take whatever is easy.\n3. use the money you get from following 1 and two to take contested shit also.\n4. repeat for next game.\n\n\nthe idea should be to rotate and to take any objective the enemy is not defending.","replies":[]},{"poster":"Gigahappytown","date":"2016-01-27T17:26:36.766+0000","up_votes":2,"down_votes":0,"body":"1. BM\n2. BM\n3. BM\n4. BM\n5. BM\n6. BM\n7. BM\n8. BM\n9. BM\n10. nexus?","replies":[]},{"poster":"DeynaTaggerung","date":"2016-01-27T17:24:45.459+0000","up_votes":2,"down_votes":0,"body":"I dunno man, spamming dance on a warded area can be an amazing bait...provided you have some means of escaping the charge of enemies on their way.","replies":[]},{"poster":"q O y O p","date":"2016-01-27T07:48:55.776+0000","up_votes":2,"down_votes":0,"body":"Here are your order of priorities:\n\nNexus\nInhibitors\nTurrets\n0 or as close as you can get to 0 deaths\nVision\nCreep Score\nBaron / 5th Dragon\nHerald\nBuffs\nKills\n\nNexus wins the game.\nInhibitors kills allow you to damage Nexus.\nTurrets allow you to damage Nexus.\nNot dying keeps large amounts of gold out of enemy pockets.\nVision allows you to make better decisions on how to win the game.\nCreep Score brings in gold and experience, which is essential for gaining an advantage over the enemy.\nBaron and 5th Dragon give you an advantage over the enemy.\nHerald gives you an advantage over the enemy.\nBuffs provide an advantage over the enemy.\nKills bring in gold and experience, however, are not essential to winning the game.\n\nBottom line, if you can take any objective without needing to kill the enemy, you're simply the superior combatant.\n\nRemember this is not Team Deathmatch, this is Siege the Nexus.","replies":[]},{"poster":"Lephogam","date":"2016-01-27T07:23:59.383+0000","up_votes":2,"down_votes":0,"body":"players mb too much. people who are like this shall be punished with a loss.","replies":[]},{"poster":"Muted Summoner","date":"2016-01-27T06:53:00.276+0000","up_votes":2,"down_votes":0,"body":"I think kills are worth more than dragon unless its 1st dragon and 4th-5th dragon. 2nd and 3rd is okay to put on hold if you can get more kills/other objectives and back off to get dragon if its still up. Dragon is nice but it doesn't feel as valuable as it used to.","replies":[{"poster":"Maszii","date":"2016-01-27T14:27:19.218+0000","up_votes":1,"down_votes":0,"body":"I love it when my team goes to contest 2/3 drake of the enemy team while im pushing top into their base then gives up 4 kills plus drake.","replies":[]},{"poster":"what you deserve","date":"2016-01-27T06:56:06.378+0000","up_votes":1,"down_votes":0,"body":"Depends on how many kills. I'd die if it meant getting drag and my team out safely, no matter which dragon it was. If I can secure a double or triple but lose drag then that's usually worth it.","replies":[]}]},{"poster":"1 800 MID LANE","date":"2016-01-27T06:23:00.665+0000","up_votes":3,"down_votes":1,"body":"Outer, inner, and inhibitor turrets are of equal value regardless of what lane they're in. If there's a wave pushing into a turret, you take it. Generally speaking, of course.","replies":[{"poster":"jaymc1130","date":"2016-01-27T06:30:55.156+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=gabeneaesir,realm=NA,application-id=3ErqAdtq,discussion-id=VgGcXNbl,comment-id=0001,timestamp=2016-01-27T06:23:00.665+0000)\n>\n> Outer, inner, and inhibitor turrets are of equal value regardless of what lane they're in. If there's a wave pushing into a turret, you take it. Generally speaking, of course.\n\nNegative, the outer turrets are worth the least because they open up the least valuable enemy territory. The closer the turret is to the nexus the more important and valuable it is. Not because of the gold awarded or anything, but because of the piece of territory it occupies and defends. The deeper a turret is, the more valuable it is.","replies":[{"poster":"1 800 MID LANE","date":"2016-01-27T16:59:10.305+0000","up_votes":1,"down_votes":0,"body":"But you're just wasting time trying to take an inner turret when there's an outer turret getting pushed by a decent sized wave.","replies":[]},{"poster":"Provengreil","date":"2016-01-27T16:49:19.277+0000","up_votes":1,"down_votes":0,"body":"Iirc the outers give more gold for a cash infusion to the yeam.","replies":[]}]}]},{"poster":"Arcade Andrew","date":"2016-01-28T05:59:09.149+0000","up_votes":1,"down_votes":0,"body":"But how can I get the nexus without turrets :(","replies":[]},{"poster":"Only Play Darius","date":"2016-01-28T05:09:56.311+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=IllllllIIIIlllll,realm=NA,application-id=3ErqAdtq,discussion-id=VgGcXNbl,comment-id=,timestamp=2016-01-27T06:14:27.160+0000)\n>\n\n> 1. Flash mastery icon and spam laugh at exposed nexus\n\nBM'ing in enemy base is some of the most fun I have had in League. If i'm dancing and brandishing my mastery icon instead of killing the Nexus, either i'm fed and baiting them or the game is snowballed to hell and I can afford to have a little fun.","replies":[]},{"poster":"FuntaC","date":"2016-01-28T03:55:05.137+0000","up_votes":1,"down_votes":0,"body":"As if no one types during play? One must stop playing to type. Here is a revision for those that use chat.\n\n1. Normal win-the-game stuff if not ff@20.\nOtherwise,\n2. Think of someone to blame.\n3. Type something blaming.\n4. Remember who was blamed (and for what) to be consistent, because consistency proves skill.\n5. Repeat the blame to reinforce.\n6. Rationalize behaviors.\n7. Default to #5, and try to add something new.","replies":[]},{"poster":"LankPants","date":"2016-01-28T03:22:15.658+0000","up_votes":1,"down_votes":0,"body":">Nexus\nInhibitor\nBaron\nMid turret/inner turrets\nDragon\nOuter turret on side line\nKill\nBuffs\n\nI'd agree with this for the most part, but I'd also say Nexus Towers>Inhib and Inhib Tower=Baron (since that's basically Barons job anyway). It also seems like Towers>Dragon right now.\n\nPutting this together I'd say\n\n1. Nexus\n2. Nexus Towers\n3. Inhibitor\n4. Dragon 5\n4. Inhib Tower/Baron\n5. Inner Tower\n6. Dragon 1\n7. Outer Tower\n8. Dragons 2-4\n9. Wave/Vision Control and Farm\n9. Creep/Jungle Denial\n9. Kills\n10. Buffs\n\nPeople underestimate how important proper manipulation of creeps is, I'd say it's more valuable than kills in most scenarios.","replies":[]},{"poster":"BIH Diamond","date":"2016-01-28T02:58:53.893+0000","up_votes":1,"down_votes":0,"body":">Dragon\n\nTBH in this meta early kills > early drag","replies":[]},{"poster":"Spoofghoul","date":"2016-01-27T19:59:12.976+0000","up_votes":1,"down_votes":0,"body":"Meanwhile priorities should be\n\n1. Nexus\n2. Nexus\n3. Nexus\n4. Nexus\n5. Nexus\n6. Nexus\n7. Nexus\n8. Nexus\n9. Nexus\n10. Nexus","replies":[]},{"poster":"Speedphoenix","date":"2016-01-27T19:38:32.182+0000","up_votes":1,"down_votes":0,"body":"Actually, I know it's wrong but I myself personally value the dragon above a turret.\nA dragon will give you a game long buff while the turret will always be there for you later","replies":[]},{"poster":"kile147","date":"2016-01-27T14:56:12.776+0000","up_votes":1,"down_votes":0,"body":"Lost an ARAM game yesterday because I was the only one left after acing the enemy team. I was attacking the exposed nexus and one of my teammates jokingly pinged retreat, and I instinctively backed off. I didn't realize that I could've ended it until a few seconds later, but it was too late and three of them were back up. #JustSilverEloThings","replies":[]},{"poster":"what you deserve","date":"2016-01-27T06:36:22.543+0000","up_votes":1,"down_votes":0,"body":"not exactly true, liquid gave up 3 inhibs for baron in the lcs and that kept them in the game","replies":[{"poster":"Maszii","date":"2016-01-27T14:25:14.471+0000","up_votes":1,"down_votes":0,"body":"Ofc they dit that, cus they would probably lost the inhibs anyways. Then Fox could go baron and win the game with 3 waves of baron supers in the base. If they didnt have the baron they wouldn't be able to clear the waves.","replies":[]},{"poster":"jaymc1130","date":"2016-01-27T06:41:08.319+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=regaline,realm=NA,application-id=3ErqAdtq,discussion-id=VgGcXNbl,comment-id=0003,timestamp=2016-01-27T06:36:22.543+0000)\n>\n> not exactly true, liquid gave up 3 inhibs for baron in the lcs and that kept them in the game\n\nThat was a pretty random game and the end result is not exactly normal. Lol. It worked out, but its not a high percentage play.","replies":[{"poster":"what you deserve","date":"2016-01-27T06:49:54.164+0000","up_votes":1,"down_votes":0,"body":"it was pretty hilarious though","replies":[{"poster":"jaymc1130","date":"2016-01-27T07:28:04.143+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=regaline,realm=NA,application-id=3ErqAdtq,discussion-id=VgGcXNbl,comment-id=000300000000,timestamp=2016-01-27T06:49:54.164+0000)\n>\n> it was pretty hilarious though\n\nIt sure was.","replies":[]}]}]}]},{"poster":"Mandang0","date":"2016-01-27T14:08:04.964+0000","up_votes":1,"down_votes":0,"body":"Honestly, I've seen a lot of games lost because my team tunnel visions mid lane too hard.  Side lanes are as valuable if not moreso than mid.","replies":[]},{"poster":"Weathered","date":"2016-01-27T12:48:19.108+0000","up_votes":1,"down_votes":0,"body":"Dragons can be moved around depending on which one. 1st dragon is usually more important than outer turret, but outer turret is more important than 2nd dragon. 5th dragon can even be more important than baron.","replies":[]},{"poster":"XIII Vanitas","date":"2016-01-28T00:59:44.005+0000","up_votes":1,"down_votes":1,"body":">Here is the relative importance of objectives:\n\n>1. Nexus\n2. Inhibitor\n3. Baron\n4. Mid turret/inner turrets\n5. Dragon\n6. Outer turret on side line\n7. Kill\n8. Buffs\n\nMh... I don't agree with you.\nI know it's not the point, but I'd like other players to get it, makes my job as a jungle main way easier.\n\n1. Sometimes buffs are a lot more valuable than kills.\nFor example, when you have to face mana hungry mages that would sell their grandma for a blue buff.\n\n2. The only valuable dragons are number 1, 3, and 5; dragon number 1 is only valuable if you have already a good amount of AP and AD bonus.\nWhich means that towers are way more important than dragons early game, because they give a ton of gold and they allow you to snowball.\n\n3. If you have a decent team comp, baron buff is much more valuable than inhibitors, because you can siege and destroy more than one inhibitor with it.","replies":[]}]}