{"poster":"CoOsMoO","date":"2017-11-03T14:57:25.794+0000","title":"Rito, el mejor emparejando partidas","subforum":"Creaciones de la comunidad","up_votes":1,"down_votes":5,"body":"Yo no se ni tampoco entiendo como Riot Games quiere mejorar este juego si sus emparejamientos son un asco, 4 platas y un unranked?? asi obviamente sera dificil subir de liga y mas aun, sera dificil eliminar a los flamer si estos unranked termina 1/20 al minuto 15, quien no va a querer flamear a ese tipo de juadores??\r\ntambien se que este post valdra una mrd pero es tanta la rabia de que siempre toquen estos tipos de jugadore, que por emparejamiento segun liga no deberian jugar con uno, pero bueno riot games hace bien sus arreglos{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Mecha Sétt","date":"2017-11-03T15:03:31.675+0000","up_votes":1,"down_votes":0,"body":"Hola, partamos de la base que tienes mala actitud, te recomiendo cambiarla.\n\n Continuando, recuerda que el emparejamiento se hace por MMR, y el mmr de los unranked al momento de iniciar las rank es de plata 3 aprox.","replies":[{"poster":"CoOsMoO","date":"2017-11-03T15:29:18.902+0000","up_votes":1,"down_votes":0,"body":"esta bien lo entiendo eso de la actitud y todo eso (pido disculpa por eso) pero un unranked con solo 1 victoria de las 10 para posicionamiento comenzar con un mmr de plata 3 creen que esta bien? osea hasta mi primo de 3 años quedaria en plata solo ganando 1 partida?\nsaludos {{sticker:slayer-jinx-catface}}","replies":[{"poster":"Mecha Sétt","date":"2017-11-03T16:03:53.980+0000","up_votes":1,"down_votes":0,"body":"Considera los 2 extremos. A - Como tu dices niño de 3 años. B- Smurf challenger.","replies":[]}]}]},{"poster":"2801","date":"2017-11-03T14:59:58.949+0000","up_votes":1,"down_votes":0,"body":"Además de ser un posteo bastante ~~inútil (sinceramente)~~ esta en un foro incorrecto.\n\nCámbialo a Comportamiento del Jugador.\n\nSaludos {{champion:157}} _''La  muerte es como el viento, siempre a mi lado''_","replies":[]}]}