{"poster":"meelina","date":"2014-10-06T22:48:34.889+0000","title":"Bugsplat when ward-hopping with Kat","subforum":"Report a Bug","up_votes":3,"down_votes":1,"body":"I've had this problem for a while and sent 2 support tickets to date. After sending the first one, I repaired the client and thought it was fixed but after a while I got bug splats (crashes) again. I put my wards in the 5th slot and it's binded to my X key. I have everything quick casted so when I ward hop with Kat, I press x followed by e. I found that this happens when I only have 1 ward in my inventory so I always try to keep at least 2. It has never happened when ward hopping to a trinket while I have no wards and I've never tried with a pink ward. Basically, I press x and drop a ward and as soon as I press e to shumpo to it, my game freezes for a second, crashes and I get a bugsplat. I've been playing league for over a year on this computer and have never had this problem until 2-3 months ago. I was told to delete my game.cfg file and try reinstalling the client- deleting the cfg file didn't help so tonight I will try reinstalling. There are vids other people posted on youtube of this happening, with Lee and Kat.","replies":[{"poster":"Riot Exgeniar","date":"2014-10-06T23:01:16.396+0000","up_votes":2,"down_votes":1,"body":"THANK YOU! :O\nI've been trying to track this down for a while! I'm going to take this log and bug someone with it! Thanks! THANKS!\n\nEdit: Seems like the log isn't good/useful for this issue :( I'm trying to reproduce this without much luck.","replies":[{"poster":"meelina","date":"2014-10-07T07:01:40.536+0000","up_votes":1,"down_votes":1,"body":"Hey :) I attached the r3d log of the game I submitted in the first support ticket I sent a while ago. Maybe that one will help. I tried searching that log folder for other Kat games I had but I have no idea what I should be looking for in those txt files that would indicate a crash happened  xD didn't want to post a random game I played Kat in but made sure to have 2+ wards at all times\n\nIf you need more or if that one isn't helpful, let me know what I should see in those logs and I can go through the 20 something Kat games I pulled from that folder :)","replies":[]}]}]}