{"poster":"Toxenius","date":"2017-09-17T22:16:41.766+0000","title":"Rakan Support S Rank?","subforum":"[ARCHIVED] Help & Support","up_votes":4,"down_votes":0,"body":"I'm having a LOT of trouble getting my final S token for Mastery 6 Rakan. I've had scores like 6/0/17 and got an A+? I'll go 2/3/19 and it will be a B+? I'm warding everything, I'm the initiate for every single team fight with my R and W, and I have NO CLUE what else I can do to break this glass ceiling. I read a few boards saying that if you want an S token to play the champ in a role they don't normally play, or to get the final hit on towers, drag (good luck last hitting that thing with a Trist and Kayn on team), or to get a lot of farm, make sure the match ends quickly... I just don't get it. I see ADCs go 6/3/9 and they get an S and I'm banging my head against the wall for my S. \r\n\r\n Anything else I can do or try? I got several S on Rakan before but it was before I hit my lvl 5 mastery, so they got \"wasted\" and now I'm having a hell of a time getting my final S. My duo que is a Mastery 7 Xayah and I'm sitting here with my dinky \"mastery\" 5 banner on Rakan.","replies":[{"poster":"Broporo","date":"2017-09-18T01:15:57.635+0000","up_votes":1,"down_votes":1,"body":"The main point to remember with mastery scores is that you're being compared to others playing that champion in the role that you played them. For instance, you need to perform in the top tier with Rakan as support, but also make sure that you're doing as good if not better than most other people to get S+'s. It's quite literally a score of how well you did compared to others who played the same champ/role.","replies":[{"poster":"Toxenius","date":"2017-09-18T03:28:56.160+0000","up_votes":1,"down_votes":0,"body":"What i don't understand is my scores have only gotten better. When I first played him a few times and got my previous S ranks, I only had to get like 1/2/13. Now when I get 6/0/17 it's not enough. \n\nTo test something out, I did Rakan \"adc\". I just selected that role and had my Support ADC instead. My score was 1/2/3. HORRIBLE. I got a B+! This ranking system makes no sense! If I had been a Support Rakan and gotten 1/2/3 I would of gotten an C or  D. My average B+ on support Rakan is 2/2/17 or so.","replies":[{"poster":"Broporo","date":"2017-09-18T03:31:27.382+0000","up_votes":1,"down_votes":1,"body":"That's because you were playing him as ADC role and not Support role. Those are two different roles and going to be graded differently.","replies":[{"poster":"Toxenius","date":"2017-09-19T04:42:31.939+0000","up_votes":1,"down_votes":0,"body":"Thats what I mean! It's not rating how good I am, it cares more about what role im in. I picked the ADC \"role, but i still played as a support and got a terrible score and it still gave me a good grade. That doesn't make any sense. I could easily cheat the system and play him as ADC over and over, but actually be a support, and get Mastery7 in a day.","replies":[{"poster":"Broporo","date":"2017-09-19T04:44:36.334+0000","up_votes":2,"down_votes":0,"body":"That's just the way the system is designed though. It's alright to not agree with it, but there's just not a lot I can do about design aspects here in Help & Support. If you think the system should be different, feel free to voice those opinions in Client Discussion where other players can chime in as well!","replies":[{"poster":"Toxenius","date":"2017-09-20T01:02:15.024+0000","up_votes":2,"down_votes":0,"body":"Hm, yeah you have a point. Thanks!","replies":[]}]}]}]}]}]},{"poster":"Kynin","date":"2017-09-18T16:11:22.147+0000","up_votes":2,"down_votes":0,"body":"If you are still wanting help with Rakan message me in game.  I am part of a Rakan main discord and the leader is highest mastery point NA. I'll invite you and there will be plenty of people to help.","replies":[{"poster":"JackyWrites","date":"2018-02-03T20:19:55.272+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Kynin,realm=NA,application-id=osqw6G4M,discussion-id=vipUm3VA,comment-id=0001,timestamp=2017-09-18T16:11:22.147+0000)\n>\n> If you are still wanting help with Rakan message me in game.  I am part of a Rakan main discord and the leader is highest mastery point NA. I&#x27;ll invite you and there will be plenty of people to help.\n\nCan I get in on this?","replies":[{"poster":"Kynin","date":"2018-02-04T00:42:05.349+0000","up_votes":1,"down_votes":0,"body":"Sure, add me in game.","replies":[]}]},{"poster":"Yung Plågue","date":"2018-01-23T08:53:35.911+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Kynin,realm=NA,application-id=osqw6G4M,discussion-id=vipUm3VA,comment-id=0001,timestamp=2017-09-18T16:11:22.147+0000)\n>\n> If you are still wanting help with Rakan message me in game.  I am part of a Rakan main discord and the leader is highest mastery point NA. I&#x27;ll invite you and there will be plenty of people to help.\n\ni know this is old but could you help/teach me ?","replies":[{"poster":"Kynin","date":"2018-01-23T17:43:43.190+0000","up_votes":1,"down_votes":0,"body":"Sure, pm me in game.","replies":[{"poster":"Yung Plågue","date":"2018-01-23T21:51:55.346+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Kynin,realm=NA,application-id=osqw6G4M,discussion-id=vipUm3VA,comment-id=000100010000,timestamp=2018-01-23T17:43:43.190+0000)\n>\n> Sure, pm me in game.\n\nOkay thank you so much I send you a friend request. I want to main support this season. Rakan is just omg i love playing him.","replies":[]}]}]},{"poster":"Toxenius","date":"2017-09-19T04:43:06.325+0000","up_votes":1,"down_votes":0,"body":"Okay, ill send a PM thanks.","replies":[]}]},{"poster":"Bootleg Gay","date":"2017-09-19T20:11:47.165+0000","up_votes":1,"down_votes":0,"body":"Be there for every dragon your team gets, baron too if you go for it, try to be there for as many assists as you can, and not only use wards, but SWEE{ for wards. The number of supports I see not getting that early red trinket is baffling, and it's honestly one amazing way to go about ramping up your score. \n\nI tested these theories with Bard, multiple games going hard AP, so that my scores would be the same. I came out of two games with the same score, but different grades, because in one game, I ignored my team and wards, and just did my own thing. Wards, Dragons, Barons, and Towers. For real, the game does indeed grade on these things, at least so long as you contribute to them.","replies":[{"poster":"Toxenius","date":"2017-09-20T01:03:09.006+0000","up_votes":1,"down_votes":0,"body":"True, true. I'll have to step up my bra-skills and support the whole team a little harder, not just my adc.","replies":[]}]}]}