{"poster":"CaMmUsAq","date":"2016-04-07T15:04:45.972+0000","title":"Jhin o Aurelion Sol","subforum":"Discussioni generali","up_votes":0,"down_votes":2,"body":"Sono arrivato a 6300 PI e sono veramente indeciso se comprare jhin o aurelion sol...\r\nConsigli?","replies":[{"poster":"Severus Piton 19","date":"2016-04-07T15:21:11.275+0000","up_votes":2,"down_votes":0,"body":"Aurelion è bellissimo. Prendi quello. Io nei primi tempi c'ho fatto subito 5 di mastery, è abbastanza semplice","replies":[{"poster":"Filthyrocker","date":"2016-04-07T18:26:27.007+0000","up_votes":1,"down_votes":0,"body":"> Aurelion è bellissimo. Prendi quello. Io nei primi tempi c'ho fatto subito 5 di mastery, è abbastanza semplice\n\nLol ne parli come se fosse uscito 1 anno fa","replies":[{"poster":"Severus Piton 19","date":"2016-04-07T18:36:26.965+0000","up_votes":2,"down_votes":0,"body":"Quando un champion mi interessa lo uso e ne abuso per un po' di tempo. E' così che in season 4 ero diventato main Orianna. Quindi mi sembra come se fosse uscito già da un po', a causa dello spam","replies":[]}]}]},{"poster":"Hell88","date":"2016-04-07T15:17:34.886+0000","up_votes":1,"down_votes":1,"body":"Aurelion sol da masterare è veramente arduo poi se hai contro dei mid con gap closer ti verrà solo voglia di fare quit rage.Jhin è più semplice ma anche li...non è il classico adc con combo in early e poi auto attack+ ulti a fine partita...jhin è combo e posizionamento tutta la partita.Sono entrambi(secondo me) 2 champ che ti fan sudare...se vuoi farti una partita rilassata non giocarli o finirai per feedare anche l'argogranchio.","replies":[{"poster":"CaMmUsAq","date":"2016-04-07T15:25:35.729+0000","up_votes":1,"down_votes":0,"body":"Lo so che sono molto difficili da giocare... Ho champ molto scialli che con una combo shottano il baron e basterebbe tirare testate contro la tastiera per vincere...\nVolevo prendere uno di questi due perchè sono delle belle sfide e se si impara a giocarli bene sono devastanti","replies":[{"poster":"Hell88","date":"2016-04-07T15:36:18.197+0000","up_votes":1,"down_votes":0,"body":"beh aurelion sol è carino da giocare (ce l'ho) perchè è un champ diverso dal solito ma non carrierai mai...con jhin si.","replies":[{"poster":"Severus Piton 19","date":"2016-04-07T15:37:27.166+0000","up_votes":1,"down_votes":0,"body":"Non si carrya con Aurelion? Woot?","replies":[{"poster":"Hell88","date":"2016-04-07T15:46:11.894+0000","up_votes":1,"down_votes":0,"body":"sarà che sono in elo basso...ma non ho mai visto carriare un aurelion sol...","replies":[{"poster":"Severus Piton 19","date":"2016-04-07T15:50:49.930+0000","up_votes":2,"down_votes":0,"body":"Boh, io in ranked non l'ho ancora provato/visto.. Però in normal ho incontrato gente di ogni elo e quando ce n'era uno, solitamente la sua parte la faceva.. Cioè non l'ho mai visto \"completamente inutile\", tranne 1-2 volte.. Poi vabbè, non ne ho visti tantissimi e per la stragrande maggioranza delle partite lo giocavo io.. Ma fidati che ne ho carryate davvero tante con quel campione.. Penso che non fosse una bestia esclusivamente high elo (l'hanno appena nerfato)","replies":[{"poster":"Darkinknight","date":"2016-04-07T16:57:50.517+0000","up_votes":1,"down_votes":0,"body":"Per come lo vedo io non dico sia inutile,ma non lo pickerei mai mid rispetto ad altri..ma dato i nerf che ha preso probabilmente mi sbaglio,anche se penso siano stati dati perche non lo vogliono vedere support..dico solo che fino ad ora non ne ho visto 1 che sia 1 carriare..penso che il migliore che mia capitato sia stato proprio nel mio ultimo match, ma in cui palesemente l'ho carriata io e il sup,e lui riusciva a dare il suo solo perche con i miei 5500 hp gli paravo le chiappe😂","replies":[{"poster":"Severus Piton 19","date":"2016-04-07T17:17:03.511+0000","up_votes":2,"down_votes":0,"body":"Si,  come dicevo all'altro utente, mi sembra strano sentire queste opinioni (nonostante anch'io non è che ne abbia visti tantissimi, si vede che non ha riscosso troppo successo come appealing di gameplay).. Io lo trovo bello e versatile. Pensa che quando mi è capitato a volte di finire un bel po' indietro mid, riuscivo a rimanere rilevante grazie all'incredibile capacità di roaming. Praticamente me ne sbattevo del mid che magari a farm pari, aveva 1-2 kill in più e andavo direttamente dalla base a bot. Non sono troppi i mid che riescono così bene in questa abilità","replies":[{"poster":"Darkinknight","date":"2016-04-07T18:22:56.363+0000","up_votes":1,"down_votes":0,"body":"Si ha la buona capacita di rimanere utile anche se indietro..di contro ha che anche se sei feedato non sei mai una grossa minaccia..credo non abbia riscosso successo perche non abbia dei grossi danni e sia davvero facile preda degli assasin..ce lo vedo meglio team 5 vs 5 ,in solo Q non mi sembra renda molto","replies":[{"poster":"Severus Piton 19","date":"2016-04-07T18:28:37.204+0000","up_votes":2,"down_votes":0,"body":"Ehm, non per \"darti contro\", non voglio fare il bastian contrario a tutti costi, ma per l'appunto, l'hanno nerfato poiché (specialmente) in high elo, quando avevano imparato un pochino le meccaniche, devastava troppo con danni esagerati e pressoché impossibili da evitare in teamfight e via dicendo. Cioè, io penso che il suo danno sia molto alto (quello non l'hanno toccato). E' un champion che fa danni continuati, quindi è naturale che non puoi paragonare il suo burst con quello di un assassin","replies":[{"poster":"Darkinknight","date":"2016-04-07T20:09:43.408+0000","up_votes":1,"down_votes":0,"body":"Certamente ma ti credo..io parlo esclusivamente per come l'ho visto fin'ora ovunque e in tutti i match..pero se volessi danni continuati vado su un top/jng che possono stare in fight 10 minuti a prendersi i colpi non su un mid laner che per quanto lo tanki esplode..i nerf sui cc come ho detto credo siano stati dati perche come supp rendeva troppo e perche sei nei tf ti prendeva con la q 2 secondi di stun ad immensa area sono effettivamente tanti..poi come ho detto,se è stato nerfato,effettivamente deve rendere anche se fin'ora non ne ho visto 1 solo broken","replies":[]}]}]}]}]},{"poster":"Hell88","date":"2016-04-07T15:59:31.381+0000","up_votes":1,"down_votes":0,"body":"si ma da avere un buono score ad essere katarina mid...ne passa XD","replies":[{"poster":"Severus Piton 19","date":"2016-04-07T16:03:29.144+0000","up_votes":2,"down_votes":0,"body":"Katarina ora è abbastanza penosa (tanto per rimanere in tema ;d). Comunque non ho mai parlato di buono score. Parlo proprio di carryare in ciò che dovrebbe fare Aurelion: Danno e zoning. Essere top danno nella maggior parte dei game che ci faccio e imparare a zonare nei tf con le palline.. Beh penso si possano riassumere come: carryare. Comunque credevo fosse opinione comune che è una bella bestia quel champ e che carrya bene. Mi ha abbastanza stupito il tuo commento! Solo per questo sto \"pontificando\"","replies":[{"poster":"Hell88","date":"2016-04-07T16:47:13.409+0000","up_votes":1,"down_votes":0,"body":"beh è un bella bestia finchè non arriva un gap closer anche scarso e fà fettine di drago...Diana manco lo vede.","replies":[{"poster":"Severus Piton 19","date":"2016-04-07T17:14:39.948+0000","up_votes":2,"down_votes":0,"body":"Tieni conto che lo devi buildare un po' tanky. Se un ap assassin è feeddato, il secondo oggetto sarà un abyssal.. E ben sai che RoA+Abyssal+Rilay ti rendono abbastanza coriaceo. Certo, ti esponi molto meno, ma l'ulti è sempre un tool di una certa rilevanza contro quei matchup. Non so, non mi convince tutta questa fobia degli assassin, dovrei trovarmene di più contro, anche se fino a ora non ho riscontrato problemi insormontabili..","replies":[{"poster":"Hell88","date":"2016-04-07T17:32:59.853+0000","up_votes":1,"down_votes":0,"body":"il tuo unico escape è la ulti che puoi lanciare ogni pacco di secondi,un assasin puo fare un gap closer ogni 5...per quantocoriaceo 3-4 assalti e sei cotto.","replies":[{"poster":"Severus Piton 19","date":"2016-04-07T18:15:26.869+0000","up_votes":2,"down_votes":0,"body":"Beh è proprio questo il punto. Se tu mi dici: Eh, ma in open-field uno che autoattaccka l'altro e si fan le skill da fermi, ok, Aurelion non ha speranze. Ma se tu cerchi sempre di evitare lo scontro diretto e capisci quando gli altri vogliono fare all in e piazzi lo stun di conseguenza, allora vedrai che la musica cambia. Inoltre, cerchi di itemizzarti bene. Tu sai che hai contro un assassin con 10 mila gap gloser? Allora prioritizzi la mobilità e la magic res (se è una cosa tipo Akali), altrimenti hai contro un Zed troppo avanti? Lo Zhonya è tuo amico.. E così via dicendo. Poi alla fine te l'ho detto, io non ho mai avuto troppi problemi, proprio perché posizionandosi bene, eviti lo scontro diretto e capisci quando puoi harassare di thunderlord e quando devi andare indietro; ma se proprio la lane diventa invivibile hai sempre l'opzione del roaming facile e dello shoving sotto torre..","replies":[]},{"poster":"Ste the ripper","date":"2016-04-07T17:36:27.139+0000","up_votes":1,"down_votes":0,"body":"La ulti è un disengage, non un escape e se per 2 volte di fila ti trovi outposition ti meriti di morire.","replies":[{"poster":"Hell88","date":"2016-04-07T17:38:18.322+0000","up_votes":1,"down_votes":0,"body":"ho visto dei zed e delle le blanc farli esplodere sotto torre dal livello 6.","replies":[{"poster":"Hell88","date":"2016-04-07T18:58:31.425+0000","up_votes":1,"down_votes":0,"body":"erano 0-0....ovvio zed farma come un treno rispetto ad aerosol.","replies":[]},{"poster":"Ste the ripper","date":"2016-04-07T18:02:12.845+0000","up_votes":1,"down_votes":0,"body":"Succede a qualunque champ quando è feedato","replies":[]}]}]}]}]}]}]}]}]}]}]},{"poster":"DuckQuack0","date":"2016-04-07T16:30:43.204+0000","up_votes":1,"down_votes":2,"body":"E' stato nerfato perchè broken","replies":[{"poster":"Hell88","date":"2016-04-07T16:48:23.810+0000","up_votes":1,"down_votes":0,"body":"non era così broken però visto la nuova presa di posizione di riot riguardo ai champ e le debolezze è stato ugualmente nerfato.","replies":[{"poster":"DuckQuack0","date":"2016-04-07T17:05:09.796+0000","up_votes":1,"down_votes":1,"body":"Forse non sono stato abbastanza chiaro, era broken, troppo zoning, un aoe che può anche coprire mezza mappa di 2s, danni assurdi\n\nProssimi nerf: Guinsoo+Devourer, Graves","replies":[{"poster":"Hell88","date":"2016-04-07T18:59:30.287+0000","up_votes":1,"down_votes":0,"body":"se nerfi quei 2 puoi buttare vita metà dei champ da jungla-top.","replies":[]}]}]}]}]}]}]}]}