{"poster":"JoeKD","date":"2017-11-08T20:37:10.556+0000","title":"blaue Essenz","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"warum habe ich nur 34300 f&uuml;r meine Runen bekommen, ich habe 11 seiten Runnen gehabt \r\nes musst doch mindesten 6300*9=56700 geben, das noch ohne die blaue Essenz, die ich hervor habe und die Runen f&uuml;r damage, Magiedurchdringung, da war doch nicht abgesprochen\r\nwas soll das jetzt","replies":[{"poster":"Crash x8","date":"2017-11-08T22:53:34.305+0000","up_votes":1,"down_votes":0,"body":"Die RP die du für Runenseiten ausgegeben haßt wurden in einem für dich positiv gerundetem 1 zu 1 verhältnis in Skins umgewandelt. + Du haßt die Runenseiten immernoch zur freien verfügung was bedeutet du haßt die RP erstattet bekommen + quasi 6300 BE pro seite geschenkt bekommen.\n\nDas sie dir RP gutschreiben wurde nie gesagt, genauer gesagt wurde diese genaue frage explizit und mit begründung verneint wenn ich mich recht entsinne.","replies":[]},{"poster":"YTElias","date":"2017-11-08T20:40:04.271+0000","up_votes":1,"down_votes":0,"body":"Ach\nDu musst doch berechnen mit was du die gekauft hast deine Runenseiten\nDie mit RP Bleiben die mit EP gehen in deine BE denk ich\n{{sticker:zombie-brand-clap}}","replies":[{"poster":"JoeKD","date":"2017-11-08T20:45:12.844+0000","up_votes":1,"down_votes":0,"body":"riot hat doch geangekündigt, dass sie die voll preis wiedergeben, ich habe meine Runen immer mit RP bezahlt\nich verstehe einfach nicht was jetzt das soll, warum bekomme ich es nicht wieder zurück, habr ihr das Problem auch, oder bin ich einzel Fall","replies":[{"poster":"YTElias","date":"2017-11-08T20:46:24.364+0000","up_votes":1,"down_votes":0,"body":"Dann müsstest du eigentlich alle mit RP gekauften auch behalten und dafür skins bekommen somit kriegst du dann nix","replies":[{"poster":"JoeKD","date":"2017-11-08T20:49:44.951+0000","up_votes":1,"down_votes":0,"body":"ich finde es nicht in Ordnung, was Riot mit mir tunen","replies":[{"poster":"YTElias","date":"2017-11-08T20:51:27.761+0000","up_votes":1,"down_votes":0,"body":"Bist du nicht Deutsch oder warum hast du eine bisschen schlechte Rechtschreibung\nweil es heist **I**ch finde es nicht in Ordnung, was Riot mit mir **tut**","replies":[{"poster":"JoeKD","date":"2017-11-08T20:57:04.145+0000","up_votes":1,"down_votes":0,"body":"ich platze hier gleich vor Wut, ich habe mehr als 1 Jahr lang für die Runen gespart und ein neue patch alles weg","replies":[]}]}]}]}]}]}]}