{"poster":"Zataηηa","date":"2019-07-24T14:59:40.184+0000","title":"Tft classificate","subforum":"Discussioni generali","up_votes":1,"down_votes":1,"body":"Mi domandavo: esiste anche qui lo scudo “protettivo” in caso di sconfitta a 0 lp? ci saranno ricompense di fine stagione anche per queste classificate?","replies":[{"poster":"liberodaniele","date":"2019-07-24T15:46:56.962+0000","up_votes":1,"down_votes":1,"body":"lo scudo non c'è (perchè non ci sono le promo); capita spesso però di non droppare subito se il proprio mmr è abbstanza alto rispetto a quello della divisione in cui ci si trova.\nDovrebbe esserci qualche tipo di ricompensa, ma non è ancora stato annunciato in cosa consisterà","replies":[{"poster":"sbepuz97","date":"2019-07-24T19:32:32.819+0000","up_votes":1,"down_votes":2,"body":"è stato confermato dalla riot che c'è uno scudo anti-drop ma è inferiore a quello che siamo abituati","replies":[{"poster":"liberodaniele","date":"2019-07-24T22:31:59.853+0000","up_votes":1,"down_votes":1,"body":"https://lol.garena.com/news/tft-ranked-faq\n\nno, non è presente nessuno scudo\n\nedit aggiungo fonte dalle faq italiane\nhttps://support.riotgames.com/hc/it/articles/360025359194","replies":[{"poster":"sbepuz97","date":"2019-07-25T09:40:42.993+0000","up_votes":1,"down_votes":2,"body":"Demoting down to a lower division or tier happens when your MMR is too low for your current ranking, and you are at 0 LP.\n\nlo scudo c'è. si chiama mmr, ma avere un mmr basso su tft è impossibile\nho perso 4 partite a 0 lp...non droppi\nsu dota auto chess ne perdi 1 a 0 lp e droppi, quello è non avere uno scudo.","replies":[{"poster":"liberodaniele","date":"2019-07-25T16:53:22.548+0000","up_votes":2,"down_votes":1,"body":"\"Dato che in TDS non sono presenti serie promozione, non resiste neanche la protezione dalla retrocessione (quindi niente cose del tipo \"3 partite di promozione dalla retrocessione dopo essere stati promossi\").\" \nDirettamente dalle FAQ, non mi sembra difficile da capire. Non ci sono x partite a 0 lp in cui puoi perdere e essere sicuro di non scendere (come su lol). \n\nSe poi unisci l'altra parte delle FAQ (\"La retrocessione a una divisione o a un livello inferiore avviene quando il vostro MMR è troppo basso per la vostra attuale posizione e possedete 0 PL.\") vedi che è esattamente quello che ho detto nel primo commento.\n\n> lo scudo non c'è (perchè non ci sono le promo); capita spesso però di non droppare subito se il proprio mmr è abbstanza alto rispetto a quello della divisione in cui ci si trova.\n\n\nPer rispondere anche all'altro tuo commento \n\n>in base a cosa definisci l'mmr in un gioco nuovo?\nnon puoi mettere l'mmr in un auto chess, che è l'mmr in auto chess?\n\n>facciamo un esempio di dota auto chess (visto che la riot ha creato tft da quello)\nuserò le leghe di league per capirci meglio\n\n>se un gold gioca con un iron..il gold anche arrivando prima non sale ma perde lp\n\nGli sviluppatori definiscono i valori base, le regole secondo cui cambia e le soglie a cui secondo loro dovrebbero stare le divisioni. Ed ecco che hai un sistema di mmr per un nuovo gioco. Per il resto l'mmr lo puoi definire come un numero che valuta la forza di un giocatore e che permette di fare previsioni probabilistiche sul risultato delle partite. \n\nPer fare un esempio in tft in base all'mmr tuo e a quello degli altri 7 giocatori in partita il sistema può fare una previsione sul tuo piazzamento finale; più la tua posizione finale sarà diversa da quella prevista più il tuo mmr verrà modificato in maniera che la prossima volta nella stessa situazione la previsione sia più corretta. Se arrivi primo quindi il tuo mmr non può scendere, se arrivi dal secondo posto in poi sì.\nOltre al sistema dell'mmr poi c'è il rank: il sistema guarda il risultato della partita, confronta il tuo mmr con quello delle soglie delle divisioni e in base a questi dati ti fa vincere o perdere lp. L'implementazione esatta della riot ovviamente non è conosciuta, ma  è ragionevole supporre che se il tuo mmr è in linea con quello della tua lega non perdi lp arrivando primo, a prescindere dal livello degli avversari, se invece è più basso allora potresti perdere lp anche con un piazzamento alto (come nel tuo esempio)","replies":[{"poster":"sbepuz97","date":"2019-07-25T17:08:12.150+0000","up_votes":1,"down_votes":2,"body":"...credo non abbia senso discutere con te\n\ngl, quando inzierai ad imparare a giocare e a capire i meccanismi delle ranked di vari giochi, a parte che leggere cose capirai cosa intendo ^^\n\n\"Per fare un esempio in tft in base all'mmr tuo e a quello degli altri 7 giocatori in partita il sistema può fare una previsione sul tuo piazzamento finale\"\nragiona su questa frase da te scritta e poi capirai\n\nsolo epr farti capire cosa è tft: fino 1 giorno fa nella scorsa patch c'erano game dove si andava full brawler chi rerollava meglio vinceva, non esisteva altro\nchi non andava brawler andava ninja assassin\n\naltre build? 0\ncome fai a capire se uno merita o meno? come fai a capire se avrà fortuna a rerollare? nessuna\nma ahimè sembra non hai giocato dove la gente tryharda. gl","replies":[{"poster":"liberodaniele","date":"2019-07-25T18:41:58.545+0000","up_votes":2,"down_votes":1,"body":"A parte il fatto che un sistema di mmr funzionerebbe anche in un gioco completamente casuale (semplicemente avrebbero tutti lo stesso mmr) tu credi veramente che la differenza tra [lui ](https://lolchess.gg/profile/euw/darkhydra) e [te](https://lolchess.gg/profile/euw/sbepuz97) sia dovuta unicamente alla fortuna e che se vi trovaste assieme in una partita avreste la stessa probabilità di arrivare primi? Interessante teoria :/","replies":[{"poster":"sbepuz97","date":"2019-07-25T19:17:28.065+0000","up_votes":1,"down_votes":2,"body":"monkas\n\nsono il primo a dire che negli auto chess generici non c'è casualità\n\nma quando parli di un gioco di merda (a cui gioco) come tft, welp ognuno ha la stessa possibilità di vincere. motivo? ci sono 2 build. o fai quella o perdi\n\nbut welp, sto parlando con uno che dalla season 4 non è riuscito a salire oltre il gold 5...my bad, small brain here","replies":[{"poster":"liberodaniele","date":"2019-07-25T19:33:41.205+0000","up_votes":2,"down_votes":1,"body":"Allora c'è gente incredibilmente fortunata che vince il 40% dei game in grandmaster e poveretti sfortunati che ne vincono il 14% a d4, che mondo ingiusto :| Eh si sa che se non si riesce a salire è colpa della fortuna, del team, le cavalette [cit.] Ma sicuramente sono io che non capisco come una persona possa essere così sfortunata mentre certi big brain™ possono comprendere appieno come sia non colpa loro se non riescono a salire {{sticker:cass-cry}} \n\n(comunque non essere ingiusto, dopo anni ho un platino sul client di lol :D )","replies":[{"poster":"sbepuz97","date":"2019-07-25T19:42:57.586+0000","up_votes":1,"down_votes":2,"body":"idk..noin ha veramente senso parlare con te\n\nil game è appositamente strutturato per far arrivare chiunque giochi a tft in plat velocemente\n\nchi arriva primo vince 100+ lp\narrivato in dia scende a massimo 40\n\nil collegamento con il grandmaster non si capisce visto che chi ha fatto il master ha ben 200+ game alle spalle di tft, io manco ne ho 100\n\nbut ehi. ripeto, si capisce il perchè oltre il gold 5 probabilmente boostato da amici, nemmeno sei andato in 6 anni.\n\ndetto questo non scriverò oltre, gl","replies":[{"poster":"liberodaniele","date":"2019-07-25T20:22:41.010+0000","up_votes":2,"down_votes":1,"body":"Ops il grandamster linkato ne ha 69 di game ^^\n\nhttps://lolchess.gg/profile/euw/jayplx\nhttps://lolchess.gg/profile/euw/sologesang\nhttps://lolchess.gg/profile/euw/darkhydra\nhttps://lolchess.gg/profile/euw/liquidtabzz\nhttps://lolchess.gg/profile/euw/watertft\nhttps://lolchess.gg/profile/euw/showeryy\n\n6 grandmaster in top 20 euw con meno di 105 partite giocate, 4 di questi ne hanno meno si 90, ma sicuramente hai ragione tu ed è solo perchè hai avuto sfortuna in 100 game che non sei in alto come loro :*\n\nedit: 7 con meno di 105 e 5 con meno di 90, me ne era sfuggito 1\nhttps://lolchess.gg/profile/euw/nyutft\n\nperò tranquillo, sei fortissimo e meriti il challenger anche tu anche se 1/4 della top 20 è 2 divisioni sopra di te con molte partite in meno rispetto a te &lt;3","replies":[{"poster":"sbepuz97","date":"2019-07-25T21:27:54.669+0000","up_votes":1,"down_votes":1,"body":"perdonami se mi sono rifiutato di giocare ninja assasin ^^\n\nè come giocare in questa patch 6 demons+elemtalist e dire waoh sono forte ","replies":[{"poster":"liberodaniele","date":"2019-07-26T08:10:16.781+0000","up_votes":1,"down_votes":2,"body":"Certamente, non ne dubito. Se poi tu giocassi demoni/elementalisti rimanendo ancora lì sarebbe solo colpa del sistema di ranking/della sfortuna/di tua nonna che ti stacca internet mentre giochi","replies":[{"poster":"liberodaniele","date":"2019-07-26T15:59:08.557+0000","up_votes":1,"down_votes":0,"body":"https://lolchess.gg/profile/euw/liberodaniele\n\nnon che non abbia giocato. Ho anche giocato molto in compagnia, vedendo che persone diverse giocando le stesse comp ottengono risultati molto diversi. Ovviamente seguo le principali fonti di informazione (che tra l'altro ti smentiscono, ecco un [riepilogo delle 5 comp/9 sottocomp viabili la scorsa patch](https://www.reddit.com/r/TeamfightTactics/comments/cfywjm/meta_comp_guide/) e un esempio di [testimonianza di gente high high elo che non gioca le comp \"standard\"](https://www.reddit.com/r/CompetitiveTFT/comments/chg6y3/just_hit_rank_3_na_after_a_huge_winstreak_ama/) \n\nPer il resto, post su reddit che urlano al nerf? che cosa strana, non succede mai :| Sei nuovo della piattaforma per caso? XD","replies":[]}]}]}]}]}]}]}]}]}]}]}]}]}]},{"poster":"Zataηηa","date":"2019-07-25T16:32:28.681+0000","up_votes":2,"down_votes":1,"body":"Secondo il supporto non ci sono scudi, ma si scende quando hai l’mmr troppo basso per quella lega come dice Libero. Quindi puoi droppare subito come dopo 10 partite, suppongo. Lo scudo delle duo invece, a prescindere dal tuo mmr, ti salva per tot partite. Considerando ci vuole Impegno a rovinarsi l’mmr in questa modalità, alla fine con o senza scudo stiamo lì.\nAnzi, preferirei questo metodo anche nelle altre code piuttosto di giocare le promo, sono ansiogene ghgh\n","replies":[]},{"poster":"FeFFiItalia","date":"2019-07-25T23:59:04.448+0000","up_votes":1,"down_votes":1,"body":"Ma davvero c’è qualcuno che gioca a tft ranked? La fortuna non è un talento, pure un plastica 5 puó diventare diamond  se ha fortuna.","replies":[{"poster":"Zataηηa","date":"2019-07-26T22:41:27.235+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FeFFiItalia,realm=EUW,application-id=MJVj50Jw,discussion-id=AKQW9KP7,comment-id=0004,timestamp=2019-07-25T23:59:04.448+0000)\n>\n> Ma davvero c’è qualcuno che gioca a tft ranked? La fortuna non è un talento, pure un plastica 5 puó diventare diamond  se ha fortuna.\n\nEvidentemente si, c’è gente che ci gioca a giudicare dai risultati.\nAd ogni modo si parlava semplicemente a scopo informativo e per una mia curiosità personale, di certo non come una questione fondamentale di vita. \nCome del resto è tutto Lol, lande e company, perchè rimane pur sempre un gioco, in qualsiasi sua modalità.\nMi spiace che abbia generato qualche dissidio il post.","replies":[{"poster":"FeFFiItalia","date":"2019-07-26T22:56:43.461+0000","up_votes":1,"down_votes":0,"body":"non c'è niente di male nel giocarla, ma  questo tipo di ranked creerà altri  malati mentali, che si crederanno  dio sceso in terra, si riempiranno di vanità e diventeranno  tossici, quindi perchè   creare  la modalità ranked, su una modalità dove ci vuole fortuna per vincere? e ripeto, la fortuna non è talento.","replies":[{"poster":"Zataηηa","date":"2019-07-26T23:10:05.769+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FeFFiItalia,realm=EUW,application-id=MJVj50Jw,discussion-id=AKQW9KP7,comment-id=000400000000,timestamp=2019-07-26T22:56:43.461+0000)\n>\n> non c'è niente di male nel giocarla, ma  questo tipo di ranked creerà altri  malati mentali, che si crederanno  dio sceso in terra, si riempiranno di vanità e diventeranno  tossici, quindi perchè   creare  la modalità ranked, su una modalità dove ci vuole fortuna per vincere? e ripeto, la fortuna non è talento.\n\nMa non credo ci possa essere più tossicità qui di una ranked duo(ma pure nelle aram), stranamente in tft ho sempre trovato gente piuttosto tranquilla, non essendo un lavoro di squadra se sbagli le conseguenze le subisci soltanto tu per le tue scelte.\nDa profana e completa nabba, ti diró, anche io penso che molto vada a fattore C, ma credo anche che un minimo di strategia e metodo vincente ci sia. Quanto meno agli elo molto alti.","replies":[{"poster":"FeFFiItalia","date":"2019-07-26T23:59:54.482+0000","up_votes":1,"down_votes":0,"body":"Strategia vincente?? Non credo.\nStavo giocando una tft non ranked,  sono stato primo per tutto il tempo, con 3 campioni maxati al massimo, ma ho perso   nelle ultime fasi arrivando terzo, perchè non mi uscivano i campioni giusti. Ero primo fino alle ultime fasi.","replies":[]}]}]}]}]},{"poster":"Zataηηa","date":"2019-07-24T17:09:43.527+0000","up_votes":1,"down_votes":1,"body":"Grazie per  le risposte.\nNel frattempo ho trovato questo nella pagina del supporto: https://support.riotgames.com/hc/it/articles/360025359194-FAQ-classificate-Tattiche-di-Squadra\n\nUltimo dubbio: se si gareggia con gli amici in ranked tft, la distribuzione degli lp è sempre la stessa o ci sono variazioni? ","replies":[{"poster":"sbepuz97","date":"2019-07-24T19:31:48.794+0000","up_votes":1,"down_votes":2,"body":"all'inizio io ero un gold un amico era iron, sono arrivato secondo e avevo preso +5...quindi si giocare con gente più bassa ti fa prendere meno lp","replies":[{"poster":"liberodaniele","date":"2019-07-24T22:34:15.166+0000","up_votes":1,"down_votes":1,"body":"*giocare con gente con mmr più basso, non gente di leghe più basse","replies":[{"poster":"sbepuz97","date":"2019-07-25T10:54:29.079+0000","up_votes":1,"down_votes":2,"body":"in base a cosa definisci l'mmr in un gioco nuovo?\nnon puoi mettere l'mmr in un auto chess, che è l'mmr in auto chess? \n\nfacciamo un esempio di dota auto chess (visto che la riot ha creato tft da quello)\nuserò le leghe di league per capirci meglio\n\nse un gold gioca con un iron..il gold anche arrivando prima non sale ma perde lp","replies":[]}]}]}]},{"poster":"sbepuz97","date":"2019-07-24T15:35:22.422+0000","up_votes":1,"down_votes":1,"body":"lo scudo c'è ma idk di quante partite\n\npremi hanno detto che ci saranno, ma non si sa ancora quali","replies":[]}]}