{"poster":"Scríptér","date":"2017-01-30T00:23:23.020+0000","title":"1k Ping out of nowhere!","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"Throughout this weekend I&#039;ve stablized with a ping of 19-21ms, now all of a sudden out of nowhere, without switching internet or providers, it goes up to 400, to 700, now to 1,000-1,200kms! Please help!","replies":[{"poster":"Targons Blade","date":"2017-01-30T03:50:56.572+0000","up_votes":3,"down_votes":0,"body":"Huge changes in latency (ping) typically occur as a result of routing changes by your ISP that cause your connection to take a longer path to our servers. Before we take a close look at your network routing, I recommend giving your modem/router a quick reboot by unplugging them from power for 60 seconds before plugging them back in.\n\nIf you see further issues with this, let me know.","replies":[{"poster":"shaybearx3","date":"2017-02-02T02:09:36.834+0000","up_votes":1,"down_votes":0,"body":"My partner and I are having the same issue and have done everything the Troubleshooting page said as well as rebooting our modem and router. \nEven when I ping the servers its telling me I have an average 80ms. But during game we spike to 500-3000ms. \nIt was never an issue for us until the last two or three weeks. \nAs far as we know there hasn't been anything wrong with our ISP. \nIt spikes around 4pm Pacific Time.","replies":[{"poster":"Targons Blade","date":"2017-02-03T02:28:26.602+0000","up_votes":2,"down_votes":0,"body":"Does this only happen after 4PM Pacific? It's not uncommon for an ISP to reroute certain network traffic during their peak hours in order to mitigate congestion on their networks. I'd be interested to see a traceroute log that was run during the period you experience the increased latency. You can use a networking app called [**WinMTR**](http://winmtr.net/) to run this traceroute. After loading up the app, simply paste **104.160.131.1** into the host field and start the trace. After the trace has been running for 5 minutes or longer, you can export the results as text and then paste them in a reply to me.\n\nLet me know if you run into any issues with those tasks. ^.^","replies":[]}]}]}]}