{"poster":"MrNewMine","date":"2017-09-12T19:12:06.483+0000","title":"Dark Seal auf Supporter ja oder nein?","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Hallo\r\n\r\nAlso ich habe letzte Nacht einen Streamer zugeschaut und gesehen wie er auf Rakan Dark Seal gebaut hat. Ist das eig sinnvoll es zu kaufen? Denn das Dark Seal gibt ja einem laut der Beschreibung vom Item nur maximal 10 Glorys. Kann man dann also den auf JEDEN Supporter bauen wie Thresh oder gibt es bestimmte Champs auf den man bauen kann?","replies":[{"poster":"Hmto AkA Oliver","date":"2017-09-13T18:59:55.689+0000","up_votes":1,"down_votes":0,"body":"In der Regel rusht du auf den Charakteren, die Dark-Seals verwenden könnten, Ardent Cencer (Glühender Rauchschwenker) und das ist um Längen besser und hat eine recht hohe Priorität. Ob auf Rakan, Lulu, oder eben Janna. Dark Seals kostet zwar nicht die Welt, aber vergiss auch nicht, dass du Dir noch ein Ward-Item kaufen musst und Supporter ohnehin nicht das meiste Gold haben. Ward-Item und eben Ardent haben wesentlich höhere Priorität als eben Dark Seals. Hast du Dir erst die Items gekauft, kannst du mit dem Item ohnehin nur noch sehr schwer etwas anfangen, wobei dann halt auch die Teamfights in der Regel starten. Aber Dark Seals will man meines Wissens nach ja auch noch Upgraden und dann würden die Stacks verloren gehen.\n\nFazit: Kann man machen, aber mit einem Ward-Item, oder eben Ardent Cencer hast du wesentlich größeren Einfluss und mir fällt bis auf Bard, oder eben so etwas wie Zyra kein Supporter ein, der wirklich AP dringend braucht. Die meisten skalieren halt eben mit Support-Items wesentlich besser und im aktuellen Meta wirst du kaum einen Supporter wie Zyra finden.\n\nSiehst halt eher Janna, Rakan, Soraka, Taric, Alistar, Sona, Lulu und die gehen für gewöhnlich bis auf Alistar eben Ward-Item und first Item Ardent Cencer.\n\nZweites Fazit: Mach halt was du willst, wenn du gut genug spielst, wirste auch climben, selbst mit dem Build. Aber Ardent + Ward-Item + Redemption sind halt wesentlich besser.","replies":[]},{"poster":"Oriius","date":"2017-09-12T22:40:35.863+0000","up_votes":1,"down_votes":1,"body":"der grund warum dark seal auf rakan sinnvoll ist ist einfach der faktor das rakan sowie auf ap als auch auf movement speed skaliert. durch den shieldspam bekommt rakan sogut wie immer stacks und nen rakan ist unglaublich schwer zu töten wenn man rakan perfekt spielt. zudem ist movementspeed für die ult immer sehr praktisch. daher ist dark seal auf rakan ein sehr sehr sinnvolles item was aber bei champs wie janna zb nicht der fall ist weil janna nicht wirklich von diesem item profitiert im vergleich zu einem rakan. grundsätzlich ist dieses item sinnvoll auf supporter die viel heal/shield abilities haben und von dem zusätzlichen movespeed sowie max mana sehr gut profitieren können sprich alle champs die sich meist nicht selbst retten können oder auf movespeed skalieren oder generell sehr langsam sind. \n\ndaher ist dieses item nicht auf jeden supporter zu empfehlen.","replies":[{"poster":"Qbert","date":"2017-09-13T05:13:39.373+0000","up_votes":1,"down_votes":0,"body":"Warum dark seal auf Janna nicht wirklich gut sein soll, erschließt sich mir nicht. Der Vergleich zwischen Janna und Rakan in Bezug auf die Sinnhaftigkeit von Dark Seal ist okay, dennoch ... es macht sehr wohl auf jedem AP-skalierenden Supporter Sinn, wenn man entsprechend Vorsprung zum Gegner hat.","replies":[]}]},{"poster":"WC9 Umbra","date":"2017-09-12T20:34:54.527+0000","up_votes":1,"down_votes":0,"body":"Würde sagen du kannst es mit etwas übrigen gold auf Janna, soraka und den anderen healing/shielding supps kaufen.","replies":[]},{"poster":"Armìnìus","date":"2017-09-12T19:37:22.952+0000","up_votes":1,"down_votes":0,"body":"Hey MrNewMine,\n\nallgemein gibt es durchaus ein paar Supporter, die mit dem Item arbeiten können, wie zum Beispiel Janna. Was vor allem daran liegt, dass du es zu Mejais ausbauen kannst. Als erstes Item ist es nicht zu empfehlen (in den allermeisten Fällen), da du eine Menge Gold dadurch verlierst. Auch würde ich es nur auf Helden wie Lulu, Janna oder vielleicht Karma kaufen, Thresh, Braum und so weiter sind da eher ungeeignet. Der Grundgedanke basiert darauf, dein Dark Seal auszubauen und das passt nicht zu allen Supportern. \n\nFalls noch du noch Fragen hast, immer her damit.\n\nMfG Phantom V","replies":[]}]}