{"poster":"Glory ln Death","date":"2017-03-13T15:26:22.813+0000","title":"Riot when they see that 75% of the Boards front page is complaints about the loading bug","subforum":"Memes & Games","up_votes":240,"down_votes":8,"body":"https://media0.giphy.com/media/N2rLxtwaU9rBC/giphy.gif\r\n\r\nHoly crap, people! Calm down for a minute!","replies":[{"poster":"My Sea Cow","date":"2017-03-13T15:58:02.422+0000","up_votes":5,"down_votes":30,"body":"upvoted but sad thing is, if it's been going on for so long and they haven't yet solved or disabled ranked then they just don't care lol","replies":[{"poster":"Skorch","date":"2017-03-13T16:03:55.854+0000","up_votes":51,"down_votes":2,"body":"That is the most backward logic i have ever heard. From all fronts.\n\nRiot cares about their playerbase: Of course they want the game to be working.\nOR\nRiot really is a moneyhungry satan corporation that people think they are for some reaon: They still need to fix their servers because no game = no reason to buy skins = no income.\n\nNo matter what they need to fix their servers, its probably a hard fix or some shit.","replies":[{"poster":"21004728DEL1","date":"2017-03-13T16:16:28.849+0000","up_votes":20,"down_votes":1,"body":"LoL is FP2 :|  Quite \"Anti-Greedy\" if you ask me.  Riot is probably going to heavy duty crap at this time and usually in times of this nature, it makes much sense to not respond on it (IE say anything till they grasp whats going on to fix it) because if they respond, they will only have more QQers on their hands sadly.\n\nAnywho on topic,  I did about 3 games to 'test' to see if it was servers or something on my end and I couldnt get into either of those games.  So ill have to hold on for now and wait a bit sadly.\n\nIMO, Riot cares, but like any other game with 'free' motives, you draw in those that only want more than you give them.  Give something free,  no one appreciates and only ask for more.","replies":[{"poster":"Skorch","date":"2017-03-13T16:20:28.239+0000","up_votes":18,"down_votes":3,"body":"I also think they care, but i am seeing a DANGEROUS amount of people saying riot is sabotaging their series and forcing them to play more, and theyre evil. But even if they were no servers mean no game. People are SO dumb.\n\nCan you wait till AFTER the issue is fixed, im fairly certain Riot is more concerned on fixing their game for MULTIPLE reasons over your goddamn LP","replies":[]},{"poster":"DuskDaUmbreon","date":"2017-03-13T17:02:11.318+0000","up_votes":11,"down_votes":0,"body":"> [{quoted}](name=TheShave,realm=NA,application-id=Ir7ZrJjF,discussion-id=tVlvEPf6,comment-id=000100000000,timestamp=2017-03-13T16:16:28.849+0000)\n>\n> LoL is FP2 :|  Quite &quot;Anti-Greedy&quot; if you ask me. \n\nNot only are they free to play, they're also free to _win_. An important distinction, as many F2P games you need to dish out $200+ to actually stand a chance (looking at you, CoC…)","replies":[{"poster":"MrryZ","date":"2017-03-13T17:10:11.806+0000","up_votes":7,"down_votes":0,"body":"Wym i thought skins got wins???\n/s","replies":[{"poster":"DuskDaUmbreon","date":"2017-03-13T19:15:22.862+0000","up_votes":7,"down_votes":0,"body":"Only some skins, my friend. Order of the Banana Soraka is mandatory to play her. But, be careful, for some skins make it easier to lose. Project Yasuo, as we all know, brings out the deep, dark, toxic bronze 5 Yasuo in all of us.\n\n\nOn a side note, what the hell does /s mean?","replies":[{"poster":"Glory ln Death","date":"2017-03-13T19:32:31.230+0000","up_votes":2,"down_votes":0,"body":"Sarcasm.","replies":[]},{"poster":"DeathBot666","date":"2017-03-14T22:06:46.327+0000","up_votes":1,"down_votes":0,"body":"It's something you need when posting in the humorless circlejerk that is gameplay so people know not to take your response  seriously.","replies":[]}]},{"poster":"Glory ln Death","date":"2017-03-13T17:39:48.420+0000","up_votes":1,"down_votes":0,"body":"Well, there are a few skins that'll do it for you. A number have to be disabled in the LCS because they give an advantage to the player.","replies":[{"poster":"DuskDaUmbreon","date":"2017-03-13T19:13:37.790+0000","up_votes":2,"down_votes":0,"body":"Those advantages are rather minor, though. And they're only because they can be hard to see. The only time I know of that a skin gave a truly _serious_ advantage was when Dark Star Thresh still crashed people. iBlitzcrank is just hard to see his Q's full hitbox.","replies":[{"poster":"LordForrest","date":"2017-03-14T04:06:46.077+0000","up_votes":1,"down_votes":0,"body":"Not really, Masked Shaco doesn't have the cloud on his q appear in fog of war or bushes. Literally his only skin that does that.  Every other one you can actually tell where shaco is in the fog of war if he uses Q because the cloud is visible.  Masked Shaco has no cloud.  Unless they changed that, its being awhile since I last saw anything about it, so they might have.","replies":[{"poster":"DuskDaUmbreon","date":"2017-03-14T19:40:41.004+0000","up_votes":1,"down_votes":0,"body":"Ah. I was only aware of the skins for Lux and Blitzcrank.","replies":[{"poster":"LordForrest","date":"2017-03-14T20:06:24.646+0000","up_votes":1,"down_votes":0,"body":"Yeah, not many people know that you can actually figure out where Shaco is by looking for his Q clouds. I have tilted many a Shaco because I actually know that. So it makes sense that you probably wouldn't know about the Masked Shaco advantage.","replies":[{"poster":"DuskDaUmbreon","date":"2017-03-15T00:07:05.678+0000","up_votes":1,"down_votes":0,"body":"Oh. I knew about that (although he often hits it too far away for me to react). I just wasn't aware about that not happening with that one skin.","replies":[]}]},{"poster":"Glory ln Death","date":"2017-03-14T21:23:24.387+0000","up_votes":1,"down_votes":0,"body":"Underworld Twisted Fate's Q also has discrepancies with its actual hitbox vs how it looks. It's not as huge as the Shaco one, but about on part with iBlitzcrank.","replies":[]}]}]}]}]}]}]},{"poster":"the weeaboo","date":"2017-03-13T17:03:18.666+0000","up_votes":5,"down_votes":1,"body":"Tbh its only free to play so they can easily hook people","replies":[]}]},{"poster":"Big Black Croc","date":"2017-03-13T19:51:06.096+0000","up_votes":6,"down_votes":1,"body":"The thing is, i know riot will fix the bug eventually. But what alot of people and me are complaining about is that riot will not remove the leaver busters or return lp. Thats when its bull shit.","replies":[]},{"poster":"Tortang Talong ","date":"2017-03-14T08:13:05.704+0000","up_votes":2,"down_votes":1,"body":"well said mate. thats why im really more into dota 2 now.","replies":[]},{"poster":"Salty Jhin Main","date":"2017-03-14T04:07:40.998+0000","up_votes":2,"down_votes":1,"body":"> Riot cares about their playerbase: Of course they want the game to be working.\n\nOh rly?\n","replies":[]}]},{"poster":"DrCyanide","date":"2017-03-13T16:17:36.336+0000","up_votes":7,"down_votes":0,"body":"> they haven't yet solved or disabled ranked then they just don't care lol\n\nBut... ranked *is* disabled...","replies":[{"poster":"My Sea Cow","date":"2017-03-13T17:19:31.250+0000","up_votes":6,"down_votes":1,"body":"> [{quoted}](name=DrCyanide,realm=NA,application-id=Ir7ZrJjF,discussion-id=tVlvEPf6,comment-id=00010001,timestamp=2017-03-13T16:17:36.336+0000)\n>\n> But... ranked *is* disabled...\n\nIt is now. It wasn't 5 hours ago or more when the issue started lol that's the problem","replies":[{"poster":"Glory ln Death","date":"2017-03-13T17:45:22.673+0000","up_votes":9,"down_votes":1,"body":"That's hardly a problem, though. It only took them 4 or 5 hours to 1) be notified that players were experiencing issues 2) verify that it was occurring 3) realize that it wasn't just a few, isolated incidents 4) attempt to fix it while putting out the warning to advise players to be cautious about playing and 5) realize that it wasn't going to be a quick fix and that they _had_ to disable ranked queues.\n\nEspecially considering that it started up well before more than a few people would have been in the office.","replies":[{"poster":"Mistress Madoka","date":"2017-03-14T09:12:53.095+0000","up_votes":2,"down_votes":0,"body":"^ Seriously, this. Running a game Server (Especially for a game with as massive a playerbase as LoL) Doesn't allow for a quick \"SHUT IT DOWN\" reaction. Reasonably, a few hours *is* the fastest response time because they've got to first ensure it's a serious enough problem to justify the action, as well as making sure it Didn't just accidentally break the whole thing\n\n\nBasically, Slower response means less of \"oops, I accidentally the whole thing\"","replies":[{"poster":"Skorch","date":"2017-03-14T11:56:23.009+0000","up_votes":3,"down_votes":0,"body":"NOT \"ACCIDENTALLY THE WHOLE THING!!\" ANYTHING BUT THAT","replies":[]}]}]}]},{"poster":"Skorch","date":"2017-03-13T16:24:58.879+0000","up_votes":2,"down_votes":1,"body":"It went down about 20min ago. But the warning has been there for a few hours now.","replies":[]}]}]},{"poster":"ChaseWins","date":"2017-03-13T16:00:20.611+0000","up_votes":5,"down_votes":2,"body":"Its been over 6 hours since the issue started and they have never turned off ranked ques which they have an easy process for thats 24/7","replies":[{"poster":"DarkRitual","date":"2017-03-13T16:14:54.497+0000","up_votes":24,"down_votes":0,"body":"Their offices open at 8, which is 11 for those of us on the east coast.\nThey were literally asleep for most of the problem.","replies":[]},{"poster":"Ant Eater king","date":"2017-03-13T16:01:40.005+0000","up_votes":5,"down_votes":0,"body":"They literally JUST disabled them.","replies":[]}]},{"poster":"jama655","date":"2017-03-13T19:59:36.694+0000","up_votes":1,"down_votes":10,"body":"i lost 7 game because of this","replies":[{"poster":"Youssof","date":"2017-03-13T20:09:29.849+0000","up_votes":22,"down_votes":0,"body":"Why did you try playing 7 games when you keep getting the error every game?","replies":[{"poster":"Lauchmelder","date":"2017-03-14T00:21:52.207+0000","up_votes":8,"down_votes":0,"body":"\"Have I ever told you the definition of insanity?\"","replies":[{"poster":"garren9","date":"2017-03-14T01:00:59.845+0000","up_votes":2,"down_votes":0,"body":"http://www.quotemaster.org/images/71/71ff82cf8752f7676f7ca1178eb6513b.jpg","replies":[{"poster":"Lauchmelder","date":"2017-03-14T01:03:15.619+0000","up_votes":4,"down_votes":0,"body":"http://memecrunch.com/meme/2CMRL/vaas-insanity-speech/image.jpg\n\nWas what I actually thought about, but Einstein works as well :P","replies":[{"poster":"garren9","date":"2017-03-14T01:03:48.145+0000","up_votes":1,"down_votes":0,"body":"It originated from Einstein lol","replies":[{"poster":"Lauchmelder","date":"2017-03-14T01:06:17.581+0000","up_votes":3,"down_votes":0,"body":"I know. It just sounds cooler when it's a crazy psychopath saying it rather than a famous scientist.","replies":[]}]}]}]}]}]}]},{"poster":"goast beat wemon","date":"2017-03-13T17:23:34.373+0000","up_votes":4,"down_votes":20,"body":"im fucking pissed off. i just wannas play some legal legends and i cant so im gonna rape everything\n\n{{item:3117}} {{item:3070}}","replies":[{"poster":"Glory ln Death","date":"2017-03-13T17:37:29.300+0000","up_votes":25,"down_votes":0,"body":"You should probably see a therapist about that...","replies":[]},{"poster":"garren9","date":"2017-03-14T01:00:23.205+0000","up_votes":1,"down_votes":4,"body":"I found this mildly funny, I don't think it deserves 10 downvotes.","replies":[{"poster":"Supreme Senpai69","date":"2017-03-14T04:29:02.617+0000","up_votes":5,"down_votes":0,"body":"Had potential to be funny. Sounds more like some immature dude just being salty though","replies":[]}]}]},{"poster":"Voidzilla","date":"2017-03-13T16:03:17.939+0000","up_votes":7,"down_votes":0,"body":"My same reaction tbh.","replies":[]},{"poster":"Cosmic Hamster","date":"2017-03-13T18:25:14.237+0000","up_votes":8,"down_votes":3,"body":"We'll calm down when we get our low priority que times removed","replies":[{"poster":"Skorch","date":"2017-03-13T18:27:09.883+0000","up_votes":3,"down_votes":2,"body":"LPQs shouldnt matter when you shouldnt be queuing right now anyway.","replies":[{"poster":"Cosmic Hamster","date":"2017-03-13T18:33:40.923+0000","up_votes":7,"down_votes":1,"body":"You realize lots of people were trying to get into games when this first started right? Long before any warning was put onto the client. Tt took them an extra 2 or so hours to even disable ranked ques. I was one who was hit by this before any warning was put up.","replies":[{"poster":"Skorch","date":"2017-03-13T18:52:56.597+0000","up_votes":2,"down_votes":4,"body":"Your right there were people to first find it, but there WAS a warning not long after it was discovered, in fact probably the first people got a MAX of 2 DCs in before the warning was up. and that is highly unlikely. Even then if you DC twice you shouldnt be playing anyways. If you got a LPQ or Leaverbuster, if you got one you Dcd from more than 1 game, meaning you had a warning.\n\nI do agree they should be removed, but freak out after its fixed. Not WHILE the servers are down.","replies":[{"poster":"Cosmic Hamster","date":"2017-03-13T18:58:41.605+0000","up_votes":5,"down_votes":0,"body":"We don't wait to freak out because we know damn well they won't actually remove the LPW's or the LP loss, they haven't for years. I got my internet stable and was trying really hard to reform in the low priority que system. I went around 15 games without a single dc game, now all those games were erased because of this one AFK game due to Riots servers or whatever. Thats pretty fucked up.","replies":[{"poster":"Skorch","date":"2017-03-13T19:00:43.370+0000","up_votes":1,"down_votes":3,"body":"Why do we know. As far as i remember i dont remember FULL server shut downs being common. A LOT of the time its a few cases of people complaining they loss LP for power outages and shit and dont get reinburced. But full server shutdowns happen VERY rarely.","replies":[{"poster":"Cosmic Hamster","date":"2017-03-13T19:27:07.565+0000","up_votes":3,"down_votes":0,"body":"They're rare, but they still happen. They've happened at least 3 times over the last 3 years and not once have I seen them give people back the LP they lost. If it hasn't happened in years I don't see it happening now. May as well bitch them out while they are still looking at the boards, that's how I see it. Now I have to wait through five 20 min ques while they no longer have to deal with any of the mess now that the connection issues are fixed.","replies":[]}]}]}]}]}]}]},{"poster":"Bandolier","date":"2017-03-13T20:23:21.137+0000","up_votes":4,"down_votes":0,"body":"hey rito can i get my lp back i was in challenjour but dropped to bronze 5","replies":[]},{"poster":"FlyingRoboticCow","date":"2017-03-13T15:39:35.976+0000","up_votes":3,"down_votes":0,"body":"logged in to up vote just because it made me giggle.","replies":[]}]}