{"poster":"Kaokentake","date":"2016-03-13T00:12:01.939+0000","title":"Master Yi is the baseline \"Melee Carry\" in league. He is supposed to be good","subforum":"Gameplay","up_votes":3,"down_votes":9,"body":"Master Yi i feel is a incredibly well designed champion for riots vision of him being a &quot;melee with 0 cc&quot; melee carry\r\n\r\nlooking at yi&#039;s kit. i love its feel. it feels very amazing and fun to play. you feel so close to being this hyper samurai lightning speed warior. its super fun\r\n\r\ni think its only 2 other melee champions exist with 0 cc. kat and the new illaoi\r\n\r\nkat: more of a teamfight AoE yi. however i notice kat feels so weak and they seem to die instantly in fights. kat feels weak and overnerfed. either way my point is kat is another melee carry with 0 CC\r\n\r\nillaoi: riots attempt to create a juggernaught version of &quot;melee carry with no cc&quot; . is illaoi. decent champ. decent kit.\r\n\r\nnow lets move on. there are some melee champs in this game with such low amounts of cc that they may as well be &quot;cc-less&quot;. examples are garen and shyvana\r\n\r\ngaren: basically 0 cc just a small silence on his Q. the silence basically is just there to let him reliable get off some of his spin\r\n\r\nshyvana: basically 0 CC except for some knockback on her ulti. but a well placed ulti can certainly apply some critical cc in a teamfight\r\n\r\nso in garen / shyvana we see melee carry champs that also pretty much have no CC and their kits are pretty nicely designed and all have their fun points\r\n\r\nanyway. my point im going here is this. all of these &quot;no cc melee carries&quot; are balanced around the original baseline of master yi. master yi is riots original &quot;no cc melee carry&quot; and riot tries to keep yi at his base power and if yi ever needs to be buffed, it means power creep as happened. and if yi ever needs to be nerfed it means reverse power creep as happened\r\n\r\nso yi is getting nerfed to due his insanely high winrate. and i must say those nerfs are justified. however do not expect riot to ever gut yi, that can never happen. yi represents a class of champion. melee carrys. you cant just remove that from a moba. its a part of moba identity.\r\n\r\ni feel devourer gave yi alot of power, then the new seasons items with rageblade / titanic hydra gave yi even more insane power with devourer that put him over the top. and i guess you have to nerf yi or rework devourer and i guess nerfing yi is the ultimate solution.\r\n\r\nriot balanced champions based on what they see as &quot;output&quot; which they define as ability to kill the nexus, which is reflected through winrates. yi certainly has too much output right now and is getting properly nerfed. but with this nerf his winrate will probably get in line and anyone wishing for yi&#039;s powers as a melee carry to be gutted wont be happy because yi will still be strong. he is supposed to be strong. yi is the baseline melee carry in this game that riot balances around","replies":[{"poster":"IronwallJackson","date":"2016-03-13T00:24:40.598+0000","up_votes":2,"down_votes":0,"body":"I'm not sure what point you're trying to make, but I wouldn't use Master Yi as a baseline for anything. Like most of the older melee carries, his kit is really simple, he doesn't have all that much in the way of outplay or counterplay potential, and fighting him is he often a case of who showed up with the most damage. If he falls behind, he's got zero fallback pattern.\n\nThere's a reason why  he has basically zero place in competitive play","replies":[{"poster":"hsumis1ove","date":"2016-03-13T00:39:25.368+0000","up_votes":1,"down_votes":1,"body":"lol \"doesn't have all that much in the way of outplay or counterplay potential\", yi's outplay potential is half the reason i love him so much.","replies":[{"poster":"IronwallJackson","date":"2016-03-13T00:46:54.072+0000","up_votes":2,"down_votes":0,"body":"He has a single buggy ability that grants him psuedo invulnerability. That isn't much","replies":[{"poster":"hsumis1ove","date":"2016-03-13T01:19:10.901+0000","up_votes":1,"down_votes":0,"body":"he also has meditate resets. Watch this.\n\nhttps://www.youtube.com/watch?v=i8A_7h187nc\n\nat 1:59 cowsep 1v3s at lvl 6.","replies":[]}]}]}]},{"poster":"Cloud273","date":"2016-03-13T00:44:45.638+0000","up_votes":1,"down_votes":0,"body":"Master Yi is basically the melee version of Kog'Maw, except with even more in his kit (slow and attack speed immunity, true damage, heal+damage reduction, etc). Champions with attack speed steroids are OP because of the new items. Master Yi and Kog are the worst offenders.","replies":[]},{"poster":"Big Lincoln","date":"2016-03-13T00:13:24.221+0000","up_votes":1,"down_votes":1,"body":"you forgot {{champion:82}} in your no-CC melees list\n\nriot's vision for putting a sentient garbage can in league","replies":[{"poster":"hsumis1ove","date":"2016-03-13T00:39:51.749+0000","up_votes":1,"down_votes":0,"body":"lol","replies":[]}]},{"poster":"Elisza Kitsune","date":"2016-03-13T00:15:48.606+0000","up_votes":1,"down_votes":0,"body":"Illaoi does have cc if she lands one of her abilities and destroys your (was it soul?) soul/ you walk out of the area you get slowed but yeah it was an attempt i guess","replies":[{"poster":"Kaokentake","date":"2016-03-13T00:17:08.435+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=EliszaKitsune,realm=NA,application-id=3ErqAdtq,discussion-id=81eY5JUx,comment-id=0001,timestamp=2016-03-13T00:15:48.606+0000)\n>\n> Illaoi does have cc if she lands one of her abilities and destroys your (was it soul?) soul/ you walk out of the area you get slowed but yeah it was an attempt i guess\n\noops i forgot. your right\n\n\nand i forgot morde\n\nyup. morde kat yi are the only \"0 cc\" champs in game\n\ngaren, illaoi, shyvana, mundo have \"almost no cc\"","replies":[]}]}]}