{"poster":"Tyler1Clone","date":"2016-11-04T01:58:09.102+0000","title":"Why does Riot just perma chat restrict people are toxic but dont intentionally feed?","subforum":"Player Behavior","up_votes":4,"down_votes":7,"body":"I feel like this is a better idea. I have a friend who plays this game a lot who got banned for just being toxic. I know its perfectly reasonable to ban someone for those reasons. But why not just chat restrict them my friend almost never fed intentionally he just got angry usually at stupid people who to defend himself I played with him a lot and tried to tell him to calm down and he himself tried.  Sometimes we&#039;d be in calls when he had his chat restriction and he&#039;d just kinda get angry and want to type something but he cant it was better for him. I know Riot probably wont ever do it people who are toxic like my friend deserve to be banned from the game. They deserve to either have to start over or quit the game because they are just a negative effect the community.\r\n\r\nSidenote: Since I know this will probably come up ,  Yes I am a fan of Tyler1. BUT i do not condone his behavior and I dont think and one should follow in his footsteps especially the intentionally feeding. I think he&#039;s a bad influence on the community I just find him entertaining sorry.  Tyler1 was banned for good reason. I personally try to be nice to every indivual and just mute stupid people/disable my own chat by disabling enter to stop myself.","replies":[{"poster":"LostFr0st","date":"2016-11-04T01:59:38.013+0000","up_votes":3,"down_votes":1,"body":"Because they'll just start doing other negative behaviours instead.\nRiot's already been through this like 1000 times.","replies":[{"poster":"FTMHukY4Ps","date":"2016-11-04T05:03:33.811+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=LostFr0st,realm=NA,application-id=ZGEFLEUQ,discussion-id=MKwAYdA2,comment-id=0000,timestamp=2016-11-04T01:59:38.013+0000)\n>\n> Because they&#x27;ll just start doing other negative behaviours instead.\n> Riot&#x27;s already been through this like 1000 times.\n\nPlease tell me where they ever got that idea because that is the stupidest thing I have ever heard in my life. I may swear constantly out of frustration but I will NEVER intentionally feed. The whole reason I even bother swearing up a storm is because I want to get my point across that I'm trying my hardest to win. When I can devote my time to eloquence I'll do so. Profanity is kind of an indicator of a poor vocabulary.","replies":[{"poster":"Zezockary","date":"2016-11-04T05:27:55.162+0000","up_votes":2,"down_votes":0,"body":"They had a chat restriction system that stacked up to the point of being indefinite. The people affected by it that did not have a history of trolling turned to trolling most of the time when they could no longer be toxic in chat, so they changed it over time to the current system.","replies":[]}]}]},{"poster":"AeroWaffle","date":"2016-11-04T02:00:16.301+0000","up_votes":2,"down_votes":0,"body":"Riot tried this already.\n\nThe people who were perma-chat restricted often just used their few lines of chat to be as offensive as possible. Or they simply trolled when they couldn't vent their anger in chat.","replies":[]},{"poster":"MaropaL2","date":"2016-11-04T02:34:53.747+0000","up_votes":1,"down_votes":0,"body":"chat banning someone will just make the system getting flooded with reports, as they would have to ban them from 'Blind Pick' aswell (if you cannot call any lane, you would just pick any lane and tilt your team with that)","replies":[]},{"poster":"Great Muta","date":"2016-11-04T02:00:02.233+0000","up_votes":2,"down_votes":7,"body":"Riot's always been more interested in stopping the people that react to the trolls/feeders/leavers than the trolls/feeders/leavers themselves. Nonsensical but it doesn't matter since no one quits the game and new accounts are easy to make. I now have 3 accounts.","replies":[]}]}