{"poster":"protype891","date":"2016-10-18T13:24:00.527+0000","title":"Main Midlane sucht ranked team (Platin)","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hey ich bin 17 Jahre alt und suche ein Ranked Team. Ich bin Platin 5\r\n\r\nFolgende Voraussetzungen sollten gegeben sein:\r\n-Spieler zwischen Gold und Dia\r\n-&auml;lter als 15 oder 16 Jahre\r\n-TS3\r\n-Seriosit&auml;t\r\n-Spa&szlig; am Spiel\r\n-Und nat&uuml;rlich auch mehr als nur 1 mal die Woche Spielzeit\r\n\r\nWie der Titel bereits sagt bin ich main Midlane und besitze einen guten Championpool.\r\nMir ist es egal ob ihr m&auml;nnlich oder weiblich seid Hauptsache ihr habt ein gewisses Spielverst&auml;ndnis. Zudem setze ich pers&ouml;nlich schon Wert auf Benehmen -&gt; bedeutet, wenn jemand irwie flamet, bleidigt oder etwas in der Art bin ich raus.\r\n\r\nMFG Kai\r\nBei Interesse addet bitte Foxf1re oder schreibt hier im Forum denn mit dem Account ich den Thread verfasse, ist nur ein Smurf","replies":[{"poster":"fess123","date":"2016-10-19T06:11:44.291+0000","up_votes":1,"down_votes":0,"body":"Hi protype891,\n\ndu hast es satt alleine in der Dynamic Queue zu spielen und suchst nun ein Team oder benötigst einfach nur Gleichgesinnte? Aequilibritas eSports hilft dir bei der Erstellung eines Teams und bei der Suche nach Mitspielern, sodass du hoffentlich schnell in einem Team unter gebracht wirst, aber dir sind natürlich auch spaßige Abende garantiert!\n\nHier gehts zu unserem Vorstellungsthread: [Aequilibritas eSports sucht Mitglieder | Community und eSports | LoL, CS:GO, Overwatch etc.](http://boards.euw.leagueoflegends.com/de/c/clans-teams-de/cOWosEff-aequilibritas-esports-sucht-rekruten-community-esports-lol-csgo-overwatch-etc)\n\nÜber diesen Link kannst du natürlich auch direkt zur Aufnahme gelangen: [Bewerbungsformular](http://aequilibritas-esports.de/index.php/Application/)\n\nUnsere Community existiert bereits seit 2009. Wir würden uns natürlich über dein Interesse freuen und eventuell sogar über die Teilnahme an unserer Gemeinschaft. :)","replies":[]},{"poster":"Drecki","date":"2016-10-18T15:21:16.506+0000","up_votes":1,"down_votes":0,"body":"Guten Tag lieber Herr Foxf1re,\nWir sind momentan ein Team, was noch im Aufbau ist(Platin 4 ADC[ICH], Gold 1 Jungler und Dia 4 Supporter) und wir suchen jemanden wie dich. Bei interesse bitte melden. Toplaner wird noch gesucht.\nLG Drecki","replies":[]}]}