{"poster":"Ritesh","date":"2016-10-16T00:34:00.877+0000","title":"Now I understand why Ekko is played as a tank/bruiser","subforum":"Gameplay","up_votes":72,"down_votes":17,"body":"As full AP if you aren&#039;t ahead you either \r\n1.) Have to ult before you can even get your passive off\r\n2.) Die so fast you can&#039;t even ult\r\n\r\ntl;dr - THERE IS TOO MUCH DAMAGE IN LEAGUE PLEASE LOWER IT","replies":[{"poster":"Bladerunner7777","date":"2016-10-16T03:52:04.194+0000","up_votes":51,"down_votes":3,"body":"Complain about Ekko?: Check\n\nComplain about Damage?: Check\n\nThis has the potential to be a highly upvoted post on the boards. Chances are more slim because the newest flavor on the boards is to complain about plants or Riot's decision making (always a solid option)","replies":[{"poster":"aqours fanboy","date":"2016-10-16T06:40:23.201+0000","up_votes":2,"down_votes":9,"body":"AP Ekko sucks because if you don't win your lane (or don't make impact in the jungle) you will be non-fucking-existent when team fights come around.\n\nIf his base damage got nerfed and they buffed up his AP ratios maybe they could fix this.","replies":[{"poster":"NineTailedMystic","date":"2016-10-16T08:15:36.781+0000","up_votes":23,"down_votes":0,"body":"His AP ratios are already insane.","replies":[{"poster":"BakedLotion","date":"2016-10-16T17:14:25.854+0000","up_votes":1,"down_votes":10,"body":"> [{quoted}](name=NineTailedMystic,realm=NA,application-id=3ErqAdtq,discussion-id=ZiO9hU9K,comment-id=000100010000,timestamp=2016-10-16T08:15:36.781+0000)\n>\n> His AP ratios are already insane.\n\nHis ap ratios are insanely low wtf are you going on about?\nHis ult is 150% AP ratio. ok. When do you ever hit ult on a non-braindead enemy? Once every 10 games?\nHis passive is 80% and requires 3 hits. One from phase dive and one from opening of Q.\n80%+20%+40% is 140% ap. Very rarely do you hit the 2nd part of Q because you have to ult back or run away before you die.\nIf you do hit the second part, it's 200% ap. That's pretty decent, yes, but it's realistically 140%.","replies":[{"poster":"NineTailedMystic","date":"2016-10-16T22:41:26.480+0000","up_votes":5,"down_votes":0,"body":"You can't just exclude part of his kit. Regardless he got nerfs to his bases and buffs to his ratios several times by this point.","replies":[{"poster":"BakedLotion","date":"2016-10-16T23:07:05.940+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=NineTailedMystic,realm=NA,application-id=3ErqAdtq,discussion-id=ZiO9hU9K,comment-id=00010001000000000000,timestamp=2016-10-16T22:41:26.480+0000)\n>\n> You can&#x27;t just exclude part of his kit. Regardless he get nerfs to his bases and buffs to his ratios several times by this point.\n\nYeah but that's like saying X champion has insane ap ratios because he has an ult that hits 1% of the time with a 500% ap ratio while the rest of his skills has mediocre ap ratios.","replies":[{"poster":"NineTailedMystic","date":"2016-10-17T01:55:29.404+0000","up_votes":6,"down_votes":0,"body":"That doesn't change how his _entire kit_ has that _1.5 AP ratio_. Even Veigar's ultimate only gets 1.5 AP when the target is 33% or less HP.","replies":[]}]}]},{"poster":"MavenSong","date":"2016-10-17T05:26:49.869+0000","up_votes":4,"down_votes":0,"body":"you forget to Factor a certain item... {{item:3100}} an additional 50%","replies":[]},{"poster":"Mighty Mortein","date":"2016-10-16T23:08:07.758+0000","up_votes":4,"down_votes":0,"body":"Are you seriously complaining about Ekko being weaker? I'd rather see him the way he is compared to on-release Ekko, where his kit was more overloaded and his ult had no frigging mana cost. And it's not like Ekkos DPS is hard to obtain on his passive.\n\nE-Q-AA, boom. You've hit your passive and now you run away before they can trade back. And at level 2-3, most people aren't tanky enough to survive many rotations of Ekko spells. \nA combo at level 2 (E+Q) costs 90 mana. So it's fairly spammable. Why do you think Tank Ekkos get away with that buildpath? His AP ratios are dumb and his base damage is strong too.","replies":[]}]}]}]},{"poster":"FortisDominus","date":"2016-10-16T04:37:41.231+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Bladerunner7777,realm=NA,application-id=3ErqAdtq,discussion-id=ZiO9hU9K,comment-id=0001,timestamp=2016-10-16T03:52:04.194+0000)\n>\n> Complain about Ekko?: Check\n> \n> Complain about Damage?: Check\n> \n> This has the potential to be a highly upvoted post on the boards. Chances are more slim because the newest flavor on the boards is to complain about plants or Riot&#x27;s decision making (always a solid option)\n\nNot really, certain champions like ekko and yasuo are always FoTM. Easy way to farm upvotes is to say \"tank ekko 1 shot me\"","replies":[]}]},{"poster":"AD Yuumi","date":"2016-10-17T04:47:45.271+0000","up_votes":36,"down_votes":2,"body":"We should have named him Nekko and made him a cat-time-assassin.  Then he'd be too cute to kill before he could ult.","replies":[{"poster":"Photos of Ghosts","date":"2016-10-17T07:43:18.827+0000","up_votes":10,"down_votes":0,"body":"Jokes apart, why is never any Ritoer replying to our statements about the amount of damage there is in the game right now?\nHow will non-instakill assassins work if right now you can get instakilled by marksmen (Vayne, Jhin), mages (Syndra) and all that merrily crew?","replies":[{"poster":"Hige","date":"2016-10-17T16:36:05.319+0000","up_votes":1,"down_votes":0,"body":"do you remember the first outcry for syndra? they said she was weak and that her changes didn't help at all...\n\nI'm not saying there isn't damage creep but a lot of times forum's opinions are biased, a lot, proving a statement's truth can take months of trial and error, specially when you have as many moving parts as League of legends has (Is syndra OP because she can burst with her ult or are her targets simply too squishy?)","replies":[]},{"poster":"Chromatic Eagle","date":"2016-10-17T14:41:58.823+0000","up_votes":1,"down_votes":1,"body":"They're going to tune some of the items that Marksmen have been using which were intended for Assassins.","replies":[]},{"poster":"Rivuo","date":"2016-10-17T14:16:36.558+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=Photos of Ghosts,realm=EUW,application-id=3ErqAdtq,discussion-id=ZiO9hU9K,comment-id=00110002,timestamp=2016-10-17T07:43:18.827+0000)\n>\n> Jokes apart, why is never any Ritoer replying to our statements about the amount of damage there is in the game right now?\n> How will non-instakill assassins work if right now you can get instakilled by marksmen (Vayne, Jhin), mages (Syndra) and all that merrily crew?\n\nIts easier to make a joke and act like there isnt problems rather than to acknowledge them.","replies":[]}]},{"poster":"BeatzBoyFTW","date":"2016-10-17T05:33:40.332+0000","up_votes":9,"down_votes":0,"body":"> [{quoted}](name=groovylord,realm=NA,application-id=3ErqAdtq,discussion-id=ZiO9hU9K,comment-id=0011,timestamp=2016-10-17T04:47:45.271+0000)\n>\n> We should have named him Nekko and made him a cat-time-assassin.  Then he&#x27;d be too cute to kill before he could ult.\n\n{{champion:103}} : U f0cking w0t, m8?","replies":[{"poster":"NineTailedMystic","date":"2016-10-17T10:40:55.467+0000","up_votes":8,"down_votes":1,"body":"Fox, so canine. Although foxes are just dog hardware running cat software.","replies":[{"poster":"Exacerberus","date":"2017-08-05T09:45:46.822+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=NineTailedMystic,realm=NA,application-id=3ErqAdtq,discussion-id=ZiO9hU9K,comment-id=001100000000,timestamp=2016-10-17T10:40:55.467+0000)\n>\n> Fox, so canine. Although foxes are just dog hardware running cat software.\n\nBest definition of a fox I have ever seen.","replies":[]}]}]},{"poster":"SlashStriker","date":"2016-10-17T19:03:05.899+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=groovylord,realm=NA,application-id=3ErqAdtq,discussion-id=ZiO9hU9K,comment-id=0011,timestamp=2016-10-17T04:47:45.271+0000)\n>\n> We should have named him Nekko and made him a cat-time-assassin.  Then he&#x27;d be too cute to kill before he could ult.\n\nI thought he was suppose to be a dolphin champion","replies":[]},{"poster":"ReZisT Lust","date":"2016-10-18T11:19:09.376+0000","up_votes":2,"down_votes":0,"body":"halloween isnt over just yet lol. His q can be a yarn ball, his w is kitty litter which makes a stink poof when he enters his e  is a double pounce and r is him jumping back with a mighty meow","replies":[]},{"poster":"XD haha","date":"2016-10-17T07:08:05.229+0000","up_votes":1,"down_votes":1,"body":"SKIN IDEA COMING UP!!!!!\n^next april fools day skin.\nI like it though tbh. If riot releases it i'll get it first thing.","replies":[]}]},{"poster":"aqours fanboy","date":"2016-10-16T02:33:46.156+0000","up_votes":3,"down_votes":1,"body":"Feast or famine.","replies":[{"poster":"MunchCrunchLunch","date":"2016-10-16T03:17:16.816+0000","up_votes":4,"down_votes":2,"body":"he isn't feast or famine even when hes ahead his ap builds are pretty. meh because one cc and your dead before u proc a passive. its better to go full tank or ap/ad bruiser.","replies":[{"poster":"aqours fanboy","date":"2016-10-16T06:38:53.208+0000","up_votes":7,"down_votes":0,"body":"If you get caught in hard CC (and it has to be hard CC, gl catching an Ekko by just slowing, lmao) then you either got focused hard or ran into it. An ahead Ekko can and will run circles around the enemy, blow the squishes up and get out before you can even say kthx.\n\nThat being said, Ekko mid is so damn useless if he can't snowball, so people saying he's OP just makes me laugh.","replies":[]}]}]},{"poster":"Melledoneus","date":"2016-10-16T10:45:18.735+0000","up_votes":5,"down_votes":2,"body":"I think Ekko needs to be reworked into a skirmisher.\n\nThis \"utility assassin\" bullshit did not, does not, and never will work.","replies":[{"poster":"chipndip1","date":"2016-10-16T17:04:52.522+0000","up_votes":4,"down_votes":0,"body":"He's already considered a skirmisher.","replies":[{"poster":"Melledoneus","date":"2016-10-16T17:14:26.660+0000","up_votes":2,"down_votes":2,"body":"Like, a full on skirmisher. He's a mess of mechanics right now. He needs more reliable ways to fight, less reliance on being slippery at times, and become more of a skirmisher than a delayed assassin.","replies":[]}]},{"poster":"CasterGilgamesh","date":"2016-10-16T15:31:02.226+0000","up_votes":1,"down_votes":0,"body":"didnt riot say ekko is a skirmisher assassin?","replies":[]}]},{"poster":"Death by Glamour","date":"2016-10-17T01:27:16.286+0000","up_votes":1,"down_votes":1,"body":"So you mention a build that is only relevant because of high Base damage\n\nThen go on to say damage is to high...","replies":[{"poster":"The Deckowner","date":"2016-10-17T02:13:35.032+0000","up_votes":3,"down_votes":0,"body":"Ekko's base damage has been gutted over several patches, tank ekko is mostly used for the spammable slow and w stun.","replies":[]}]},{"poster":"SlashStriker","date":"2016-10-16T10:55:12.355+0000","up_votes":3,"down_votes":1,"body":"We got tank Ekko cause he is melee champ and his kit is made for longer fights. I don't think tank Ekko will ever die. He is also a skirmisher or light fighter\n\nIf Fizz and Zed are dodging the damage Ekko is more of a guy who would take the damage. And thats why i think tank Ekko will live on\n\nhere is fiora builds. Now compare this to Ekko builds\nhttp://www.mobafire.com/league-of-legends/champion/fiora-94","replies":[{"poster":"The Loveless","date":"2016-10-16T14:19:28.890+0000","up_votes":3,"down_votes":0,"body":"People still use mobafire holy crap","replies":[]}]},{"poster":"Laçez","date":"2016-10-16T08:35:30.807+0000","up_votes":4,"down_votes":1,"body":"Lol nope, you play it smart and yes sometimes you have to ult before much can be even done, but if you use his passive correctly and his W (of which you get a shield from), you can disengage effectively and still have a huge impact without the use of an ultimate, or you can build {{item:3027}}  / {{item:3116}} / both for the extra tankiness and still do damage. Tank Ekko is just a pussy way of abusing his passive and ultimate so that you never die and with the amount of CC in your kit you can still have enough utility to deal sufficient damage and destroy team fights so don't hit me up with that tank Ekko Korean trash that only boosted animals play to Elo boost and exploit bullshit tactics that defile / divert the way a champion was meant to be played.","replies":[{"poster":"XD haha","date":"2016-10-17T07:02:38.063+0000","up_votes":2,"down_votes":0,"body":"Do you ever full stop bruh cause i can be like all stream of consciousness and doesn't even make sense like this too without even putting a full stop which is lol so bad for communicating my message across like totally and are you like a fan of James Joyce or something or not since i don't expect much gamers like you who talk without even a full stop to be like yes a lover of James Joyce's writing which is like this at the last chapter in one of his books except the one sentences runs over 30 pages in my version which had a really small font some versions with a normal font runs over 70 pages so see how I can talk on and on like you like this and see how bad this is for other people to read lol so maybe learn to put a full stop down next time. \n\nBecause it's easy to just write it down and hope people will understand what you're saying. But if you want to be clear you have to order your thoughts.","replies":[{"poster":"Laçez","date":"2016-10-17T15:16:07.511+0000","up_votes":2,"down_votes":0,"body":"Lol I read it again and you're right xD, thanks... Btw I don't know who James Joyce is >.>","replies":[]}]}]},{"poster":"MagikarpIsBoss","date":"2016-10-16T12:36:48.707+0000","up_votes":1,"down_votes":0,"body":"I really want them to just rework Ekko into a healthy tank/skirmisher. Since he is pretty much only viable as a tank, why cant they just turn him into an actual tank/skirmisher but make his kit healthy for that.\n\nEDIT:\nI meant but forgot to include this. They should rework him to make his tank build healthy, or they should just do whatever they can to bury tank ekko into the ground and make him more useless and a b5 playing the current azir. Only then will AP ekko be the only thing people build. ","replies":[{"poster":"Itsbeghdev","date":"2016-10-17T05:14:26.058+0000","up_votes":2,"down_votes":0,"body":"They just really want to preserve him as an AP skirmisher. A large part of what makes Tank Ekko unhealthy is his ridiculous mobility from his E allowing him to stick to targets and really abuse his base damages, but that's not something you could really take away. It'd be like removing Akali's ult to eliminate her tank builds. Ekko is pretty much inherently an unhealthy tank, but he's pretty okay as a skirmisher, and attempting to make him an okay tank would absolutely gut him in terms of his identity. If they really wanted to try to make a healthy version of Tank Ekko, they'd definitely have to do it by making a new champion and not by reworking Ekko.","replies":[]},{"poster":"Shinjusuke","date":"2016-10-17T21:53:17.489+0000","up_votes":1,"down_votes":0,"body":"I'm in the other camp: His AP Assassin playstyle is far more rewarding, far more (in my opinion) fun, and *definitely* a healthier game-play pattern. It's very possibly my favorite champion playstyle in the game, despite playing this game since like beta.\n\nI've been hoping they'd gut \"Tank Ekko\" builds since his release. Assassin Ekko is a balanced, decent-skill-floor, dynamic champion. Tank Ekko is definitely more powerful, with little to no gameplay interaction, and is like Nidalee/Leblanc/Fizz/Zed levels of infuriating cancer.","replies":[]}]},{"poster":"valve nerf pls","date":"2016-10-16T13:06:11.608+0000","up_votes":2,"down_votes":0,"body":"im think the only way riot would nerf tank ekko is to reduce  his Q and E base damange and his percentage of damange taken in his ult and  increase his ap ration in his heal  just sayimg","replies":[{"poster":"CasterGilgamesh","date":"2016-10-16T15:27:06.802+0000","up_votes":1,"down_votes":0,"body":"but they have been doing that","replies":[]}]},{"poster":"Troll for Trump","date":"2016-10-16T06:25:20.557+0000","up_votes":4,"down_votes":2,"body":"You can't really build an \"assassin\" who has to do sustain dmg to do his assassination.\n\nIt's going to be the same t hing with the other assassin reworks. Assassins have to be able to kill their targets in a blink of an eye, they can't really have delayed or sustained dmg.\n\nThe closest thing that's been a successful \"sustained dmg assassin\" is yasuo, and he's notoriously overloaded, and built as a bruiser now. Yi and Noc sorta do it, but not really. Noc should've been an assassin, but the nature of his kit forced him to become a bruiser/diver.\nAssassin Yi has been dead for a long time","replies":[]},{"poster":"AirKingNeo","date":"2016-10-16T15:52:36.412+0000","up_votes":4,"down_votes":3,"body":"There isn't too much damage. People need to realize that.","replies":[]},{"poster":"BakedLotion","date":"2016-10-16T17:11:27.532+0000","up_votes":1,"down_votes":0,"body":"I never had trouble with surviving damage on ekko lol.\nRoa + Zhonyas + Abyssal should be more than enough bulk to proc passive.","replies":[{"poster":"Skias","date":"2016-10-17T20:28:17.258+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=BakedLotion,realm=NA,application-id=3ErqAdtq,discussion-id=ZiO9hU9K,comment-id=000b,timestamp=2016-10-16T17:11:27.532+0000)\n>\n> I never had trouble with surviving damage on ekko lol.\n> Roa + Zhonyas + Abyssal should be more than enough bulk to proc passive.\n\nSo you have to build 3 defensive items to survive burst instead of assassin items... You realize what you are saying?","replies":[{"poster":"BakedLotion","date":"2016-10-17T20:32:00.417+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Skias,realm=NA,application-id=3ErqAdtq,discussion-id=ZiO9hU9K,comment-id=000b0000,timestamp=2016-10-17T20:28:17.258+0000)\n>\n> So you have to build 3 defensive items to survive burst instead of assassin items... You realize what you are saying?\n\nThey're not exactly defensive. Defensive would be buying Banshees or Sunfire. They provide great offensive stats too, so they're more hybrid.. Zhonyas gives 70 AP and 10% CDR. Abyssal gives CDR and AP and MR shred. ROA gives 100 AP. 100 is the 2nd highest in the game. \n\nWhat AP assassin (and most mages too) doesn't buy abyssal+roa/rylais+zhonyas?","replies":[]}]}]},{"poster":"Surpise","date":"2016-10-17T13:59:28.249+0000","up_votes":1,"down_votes":0,"body":"im an ekko main and i think he is good als tank/bruiser but also op when he builds full ap because they will nerf his bruiser items and buff his full ap kit!!!! im very glad that this is happening","replies":[]},{"poster":"LordCrazyGlue","date":"2016-10-16T19:10:03.358+0000","up_votes":1,"down_votes":0,"body":"Try going up against bruiser Yasuo, Disgusting. Why does every CertainlyT champ abuse bruiser items when none are designed as bruisers?","replies":[]},{"poster":"3tyson","date":"2016-10-16T18:43:34.304+0000","up_votes":1,"down_votes":0,"body":"im a really bad ekko player but when it does work for me is when i start of being ap so that i can easily clear waves and cs, than somewhere i decite to go and become tank and become a really tanky dude usualy even selling most ap","replies":[]},{"poster":"l Ryden l","date":"2016-10-16T18:04:53.365+0000","up_votes":1,"down_votes":0,"body":"Valid points. But I believe any Assassin taking on tank roles exist primarily because their kits have innate %HP and high skill base damages. You don't have to build much AP to get damage off and you can split differences in you and you enemies stats by just building tank.","replies":[]}]}