{"poster":"abcm4n","date":"2015-12-15T21:39:01.345+0000","title":"Ping Probleme...","subforum":"Hilfe & Support","up_votes":7,"down_votes":2,"body":"Yo,\r\n\r\nmuss ich jetzt echt meinen ISP wechseln, oder gedenkt Riot IRGENDWANN mal dieses ver%%%%te Problem zu fixen?\r\nEs kann doch nicht mehr wahr sein, dass die Wrenchmans, die selbst kA haben, unter den Threads irgendein M&uuml;ll hinschreiben, sowie der Support, der lediglich sagt, dass es nicht an Riot liegt.\r\n\r\nw/e wollte eigentlich nur mal fragen ob bei den Leuten mit den gleiche Problem auch kein reconnecten mehr hilft, um wieder einen &quot;normalen&quot; Ping zu bekommen?","replies":[{"poster":"Negative Lux","date":"2015-12-15T22:00:08.553+0000","up_votes":6,"down_votes":0,"body":"Keine Sorge, du bist nicht alleine... das Problem haben im Moment sehr viele Spieler... (inklusive mir)\n\nHabe mich auch ausführlich mit dem Problem beschäftigt... so weit, dass ich dir sagen kann, dass es nicht an Riots Servern liegt bzw nicht hauptsächlich^^\n\nAber woran denn dann?\n\nGanz einfach... Telia Sonera...\n\nTelia Sonera stellt die Server/Knotenpunkte zur Verfügung, über welche du zum EUW-Server geleitet wirst...\n\nTelia's Servernetze scheinen in letzter Zeit (Naja, eigentlich waren deren Netze immer Müll) wieder verstärkt überlastet zu sein....\n\nMal probiert mehrere Botgames hintereinander zu starten? Bei mir sieht das wie folgt aus :\n\n\n    33 \n    70 \n    55 \n    33\n    55\n    85\n    usw....\n\n\nBei jedem neuen Spiel, wirst du über einen anderen Knotenpunkt zum EUW-Server durchgeleitet... wenn dieser ein guter/wenig belasteter/neuer ist.... dann wirst du ich in dem ersten Spiel einen schönen Ping von 33 haben... wirst du jedoch aus Gründen wie Überlastung, Wartung oder Defekten auf einen anderen umgeleitet, kann dein Ping schnell mal in den 80+ Bereich gehen, welcher für mich schon unspielbar ist....\n\n\nSo... aber wie löst man das Problem? \n\nAnscheinend ist keiner fähig hier irgendetwas auf die Reihe zu bekommen... \n\nTelia wird dir sagen, dass du kein Kunde bei ihnen bist und sie dir nicht weiterhelfen können\nDein Internetanbieter wird dir sagen, dass das Problem nicht bei ihnen liegt\nRiot wird dir sagen, dass das Problem bei dir oder deinem Anbieter liegt...\n\nAlso... unlösbar... \n\nUnd wer ist der gearschte? RICHTIG! Wir! Die Verbraucher/Nutzer! .. Diejenigen, die die ganze Schei*e auch noch finanzieren\n\nBei mir besteht dieses Problem seit 5.20, habe es mit VPN überbrücken können... bis jetzt... wo der VPN-Dienst auf einmal kostenpflichtig wurde... \n\n\nIch gebe immernoch mein Bestes um hier irgendwas zu erreichen, auch, wenn man hier nicht für voll genommen wird... \n\n\n{{champion:103}} LG{{champion:99}}","replies":[]},{"poster":"zhaadoom","date":"2015-12-16T19:19:14.690+0000","up_votes":2,"down_votes":0,"body":"hi, \n\nhab genau das gleiche problem wie Seiko es so ausführlich beschreibtt. aber erst seit ca 2 wo.......90+ ping :-(\n\nhoffe die bekommen das vor weihnachten noch gebacken, wollte eigt über die feiertage zocken^^\n\noder ich spiel aufm NA server da habsch auch konstant 130er ping hehe","replies":[{"poster":"Negative Lux","date":"2015-12-16T19:47:48.458+0000","up_votes":4,"down_votes":0,"body":"Fraglich, ob sich da je was tun wird, das Problem besteht seit 5.20 und bei manchen, wie ich gelesen habe, auch seit 5.19/18/17\n\nHabe das Problem mit VPN überbrücken können... so das mein Routing zu einem Server in Amsterdam direkt geht und nicht... wie bei vielen hier über einen Server von Telia\n\nBetreiber des Servers ist wie ich es schon erwähnt habe, TeliaSonera...\n\nDeren Server machen nicht nur in LoL (Im Moment und in der Vergangenheit) Probleme, sondern auch in z.B. World Of Tanks oder Heroes Of The Storm \n\nWir können da wie gesagt nichts machen... \n\nFakt ist...\n\nRiot muss langsam mal das Problem realisieren und handeln... nur sie können Telia über das Problem unterrichten... bzw überhaupt deren Support in Anspruch nehmen\n\nDas Problem besteht seit Wochen und wenn ich ehrlich bin, finde ich das schon fast eine Frechheit... \n\nAusfälle/Probleme, die ein paar Stunden oder Tage dauern können natürlich vorkommen, dass es ein bisschen Zeit in Anspruch nimmt soetwas zu beheben ist mir schon klar... jedoch finde ich, wenn es mehrere Wochen besteht und sich nicht mal jemand zu Wort gemeldet hat bezüglich des Problems, zeugt es von einem sehr sehr schlechten Support\n\n\n\nEdit: Leider gehen diese Threads schneller unter als die Titanic.... gekonnt werden sie ignoriert oder fallen gar nicht erst auf... die meisten denken sich \"Ach nur schon wieder jemand der über seinen Ping rumheult und auf es auf den EUW-Server schiebt.\"\n\nRed Posts wird es hier zu einer 99,99%igen Chance nicht geben... viele kleine, dauernd neu erstellte Threads über Ping-Probleme erregen einfach nicht genug Aufmerksamkeit... und das hier überhaupt mal ein Riotler reinschaut wäre verwunderlich^^\n\nDie Wrenchmen können auch nicht viel dazu beitragen, außer dir ein paar Tipps zu geben (welche in den seltensten Fällen etwas bewirken)\n\nScheint so als ob wir wirklich in einem tiefen dunklen Loch sitzen, in welches nie eine Leiter hinunter geworfen werden wird, da die Leute lieber in den Himmel schauen\n\n\n\nHier mal ein Beispielzitat, welches verdeutlicht, wie ernst diese Probleme genommen werden bzw. in welche Kategorie sie untergeordnet werden... \n\n\"Such bitte nach Threads vom 17.11. Da findest du in 1 Minute ca 50 Threads, die alle in einem Zeitraum von 20 Minuten entstanden sind. Was du hier heute findest, sind die üblichen kleinen Probleme, die Spieler mit ihrer Verbindung haben, wo sich beschwert wird, dass der Ping um 30ms angestiegen ist und das Spiel damit \"unspielbar\" wird.\" -legofreak1\n\n\n\nEDIT2: So, Neuigkeiten... habe noch mal ein paar Tracerts erstellt....\n\n1. http://pastebin.com/DfJACS7X hier treten keinerlei Probleme auf... \n\n2. http://pastebin.com/ppn9csjZ hier ist eine andere IP bei Hop 10, als bei dem ersten Tracert, hier fangen die Probleme an auf zu treten\n\n\n\n{{champion:103}} LG{{champion:99}} ","replies":[{"poster":"LOLCAPS","date":"2015-12-17T22:10:46.464+0000","up_votes":1,"down_votes":0,"body":"vielleicht mal im englisch sprachigem forum posten, dort sind relativ viele riot´ler unterwegs, die eigentlich auch häufig antworten und hilfestellung geben","replies":[]}]}]},{"poster":"epochspiderz TV","date":"2015-12-16T12:59:28.000+0000","up_votes":3,"down_votes":0,"body":"Ja, high ping hier high ping da... alle anderen Verbindungen sind perfekt.... 9 MS im Teamspeak... aber HIGH ping rein zufällig in und NUR in League of Legends....","replies":[]},{"poster":"OSaftKiller","date":"2015-12-17T17:43:58.995+0000","up_votes":1,"down_votes":0,"body":"Also ich hab seitdem ich meine neue Leitung habe keine Ping Probleme mehr. Bin Telekom Kunde. Denke mal das kommt echt auf den Standort an, über welchen Hauptserver in Deutschland man angebunden ist.","replies":[{"poster":"Negative Lux","date":"2015-12-17T17:58:50.954+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Flöff,realm=EUW,application-id=7hciEY9w,discussion-id=Epl1WxPI,comment-id=0003,timestamp=2015-12-17T17:43:58.995+0000)\n>\n> Also ich hab seitdem ich meine neue Leitung habe keine Ping Probleme mehr. Bin Telekom Kunde. Denke mal das kommt echt auf den Standort an, über welchen Hauptserver in Deutschland man angebunden ist.\n\nWenn es Standortabhängig wäre, dann hätte ich nicht von heute auf morgen einen Ping von 60-90+ statt 33 und einen Paketverlust der zweistellige Prozentzahlen annimmt welcher vorher auf konstanten 0 war... \nIch bin nämlich nicht nach Timbuktu umgezogen...\n\nDas komische ist, bei mir ändert sich der Ping von Tracert zu Tracert und von Spiel zu Spiel... und ich weiß ums verrecken nicht warum\n","replies":[{"poster":"OSaftKiller","date":"2015-12-17T18:26:10.111+0000","up_votes":1,"down_votes":0,"body":"Weil du immer auf einem anderen Server spielst. EUW wird denke ich nicht nur über einen einzigen Server laufen. Mal probiert Peer to peer zu deaktivieren? Ich hab das aus und wie gesagt rein gar keine Ping Probleme.","replies":[{"poster":"Negative Lux","date":"2015-12-17T18:27:34.430+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Flöff,realm=EUW,application-id=7hciEY9w,discussion-id=Epl1WxPI,comment-id=000300000000,timestamp=2015-12-17T18:26:10.111+0000)\n>\n> Weil du immer auf einem anderen Server spielst. EUW wird denke ich nicht nur über einen einzigen Server laufen. Mal probiert Peer to peer zu deaktivieren? Ich hab das aus und wie gesagt rein gar keine Ping Probleme.\n\nDu meinst Peer to Peer im Launcher deaktivieren? Das hat doch nur was mit dem Patch-Download zu tun... ","replies":[{"poster":"OSaftKiller","date":"2015-12-17T19:54:15.689+0000","up_votes":1,"down_votes":0,"body":"Achso ok, das wusste ich nicht. Danke für den Hinweis.^^","replies":[]}]}]}]}]}]}