{"poster":"fokko1023","date":"2015-10-27T11:21:34.629+0000","title":"was tun gegen innerliches aufgeben ?","subforum":"Spielerverhalten & Moderation","embed":{"description":"Check your Summoner statistics, MMR, realtime spectate and using powerful global LoL Charts!","url":"http://euw.op.gg/summoner/userName=fokko1023","image":"http://attach.s.op.gg/logo/20151013181540.9e341b820aa4da9076f6c76c62b98a41.PNG"},"up_votes":2,"down_votes":2,"body":"Im letzten game hatte ich ein h&ouml;llisches team. Mein bc stand nur unterm tower um alle anderen zu flamen. Die anderen nat&uuml;rlich wie bl&ouml;de zur&uuml;ck und keiner vernunftig am spielen. Aufgrund dessen denke ich mir nur ach fuck it und spiele furchtbar schlecht. Was tut man in solchen situationen am besten. \nEin leave in der Championauswahl w&auml;re wohl das beste gewesen .... anstatt mich 30 min mit denen zu &auml;rgern arf.\n\nUnd an alle flamer da drau&szlig;en selber schuld wenn ich in euren games schlecht bin und gegen euch in gewinne.","replies":[{"poster":"OrangeBubble","date":"2015-10-27T11:27:21.919+0000","up_votes":6,"down_votes":0,"body":"Eine ignorante Haltung einnehmen und das Spiel nicht so ernst nehmen. Evtl. noch Chillmusik anmachen oder was auch immer dich entspannt und spielen. \n\nAußerdem ist ein verlorenes Spiel auch hilfreich, wenn man darauf für sich Verbesserungen zieht. Aber dafür muss der Focus mehr auf sichselber gerichtet sein, als auf die Mitspieler.\nUnd alle Flamer gekonnt muten, das hilft auch X) \n\nLg","replies":[]},{"poster":"Crounty","date":"2015-10-27T11:29:43.041+0000","up_votes":6,"down_votes":1,"body":"Muten und weiterspielen.\nImaqtpie sagte mal, dass man einfach alle Spieler als kleine Babys sehen soll oder sie damit vergleichen soll, wenn dein Baby weint, dann kannst du es ja nicht anschreien oder schlagen damit es aufhört und so ist es mit flamern.\n\nEs gibt auch sowas wie \"Don't feed the troll!\"\n\nAlso was lernen wir hieraus? Wenn du flamer in deinem Team hast, einfach muten und reporten, denn das winzige was die suchen ist Aufmerksamkeit.","replies":[]},{"poster":"Doeboý","date":"2015-10-27T11:28:02.083+0000","up_votes":3,"down_votes":0,"body":"Ignorieren + das Beste drauß machen, nach dem Spiel reporten und \"Neues Spiel neues Glück\" weiterziehen.","replies":[]},{"poster":"Powerjen","date":"2015-10-27T12:05:55.487+0000","up_votes":2,"down_votes":0,"body":"Deiner History nach hast Du in letzter Zeit sehr oft gewonnen und bist gerade in oder kurz vor der Promo zu Gold 2. Da schmerzen solche Niederlagen noch viel mehr. Aber wenn Dein Trend sich fortsetzt, sollte Dir so etwas höchstens ein leichtes Kopfschütteln entlocken.","replies":[]},{"poster":"Alustus","date":"2015-10-27T11:27:08.382+0000","up_votes":3,"down_votes":2,"body":"> Ein leave wäre wohl das beste gewesen .... anstatt mich 30 min mit denen zu ärgern arf.\n\nNein.\nEin Leave ist nie gut.\n\nAm besten du Mutest alle und versuchst dich nur auf dich zu konzentrieren.\nDu kannst bei dem Spiel immer noch etwas lernen, auch wenn die chancen auf einen win niedrig sind.\n\nAußerdem wirst du nach ein paar Leaves bestraft. besser du bleibst ingame und reportest den wirklichen überltäter damit dieser eine Strafe bekommt und nicht du.","replies":[{"poster":"fokko1023","date":"2015-10-27T11:31:14.531+0000","up_votes":2,"down_votes":0,"body":"ich meinte leave in der champselect. Ingame leaven is auch nich besser als selber flamen.","replies":[{"poster":"Alustus","date":"2015-10-27T11:36:27.307+0000","up_votes":3,"down_votes":1,"body":"für dich persönlich vllt besser.\nFür die Community wäre es sicher besser es zu spielen und denjenigen zu reporten.","replies":[]}]}]},{"poster":"Killerkante","date":"2015-10-27T13:50:41.234+0000","up_votes":1,"down_votes":2,"body":"Wenn du sowas reihenweise hattest, mach ne Pause und beschäftige dich anders bis du wieder nen kühlen Kopf hast.\nGenauso wenig solltest du League spielen (besonders soloQ) wenn du Stress IRL hast.\nWenn du dich allerdings in nur einem game so provozieren lässt solltest du überlegen ob dus entweder bleiben lässt mit LoL oder dich damit abfindest dass du mindestens genauso kacke bist wie jemand der flamed, sprich wenn du aufgrund Provokationen extra schlecht spielst oder feedest etc.\nAlso des kommt bei mir viel seltener vor dass ich nen Auge zudrück bei Leuten die flamern extrem entgegenwirken als flamer selbst.\nIm Gegensatz zu den Sabotage-Profis kannst du Trashtalk wenigstens muten.","replies":[]}]}