{"poster":"InHumaneKiller","date":"2015-10-15T01:14:10.743+0000","title":"Leaverbuster is stupid","subforum":"Miscellaneous","up_votes":1,"down_votes":1,"body":"i have missed the 20minute queue pop 4times in a row and its fucking stupid like who the fuck is still gonna be at there computer after 30minutes of waiting for a game","replies":[{"poster":"mickyz33","date":"2015-10-15T01:20:59.553+0000","up_votes":2,"down_votes":0,"body":"then dont be toxic and you wont be banned","replies":[{"poster":"TTARio","date":"2015-11-29T00:46:39.438+0000","up_votes":1,"down_votes":0,"body":"^why the league community gets a bad rep^","replies":[]}]},{"poster":"Dens2ty","date":"2015-10-15T06:50:58.766+0000","up_votes":1,"down_votes":1,"body":"These people are why im in a low rank :|","replies":[{"poster":"Project Xayah","date":"2015-10-15T07:07:54.412+0000","up_votes":1,"down_votes":1,"body":"You're in low rank because you can't play. Get over yourself.","replies":[{"poster":"Dens2ty","date":"2015-10-16T01:01:01.934+0000","up_votes":1,"down_votes":0,"body":":D why do you hate me what is your standing in the oceanic boards/ are u just a player or a admin or something?","replies":[{"poster":"Project Xayah","date":"2015-10-16T01:02:16.027+0000","up_votes":1,"down_votes":1,"body":"You're not in low rank because of other people. Fact is there is only one common factor between all your games, and that is you. If you can't accept that, not my problem.","replies":[{"poster":"Dens2ty","date":"2015-10-16T03:53:47.415+0000","up_votes":2,"down_votes":1,"body":"I was 100% on point with my 1st comment the guy does not understand the simple fact of LeaveBuster and is crying because he left a game and is having to wait and his that simple that he cant even work out how it works.\n\nA lot of league is common sence and a lot of people don't have it then post things like this.\n\n\nThe fact of the mater I find is everything I say u seem to want to put me in my place for some reason. The common factor is bad players for instance 0 9 ahri support and vayne 0 7 and mid 0 5 0 in 15 minutes of my last game bro.\n\nFor someone that is trying to post on here a lot HeartVine your a really rude person.","replies":[{"poster":"Project Xayah","date":"2015-10-16T04:55:32.218+0000","up_votes":1,"down_votes":1,"body":"You have no proof of this. As I've already stated, the only common factor in all your games is you, not so called \"bad team mates\". All you're doing is trying to exempt yourself from the blame of that fact by placing blame on others, but that's not how this works. I've tried pointing out that you should accept responsibility for your own actions but the way you are acting against such comments just shows me that's not going to happen any time soon.","replies":[{"poster":"Dens2ty","date":"2015-10-16T11:07:17.094+0000","up_votes":1,"down_votes":0,"body":"I seem to see that you are saying if im a nice person in game then it does not mater how I play ill win more games.?\n\nLets see me and 4 other gremlins go to the shop its past midnight I don't feed at all because I know its not aloud and its silly but 3 of my team mates feed so much there is no chance of them winning(going green) that's my behaviour that's losing games.","replies":[{"poster":"Project Xayah","date":"2015-10-16T11:28:14.197+0000","up_votes":1,"down_votes":1,"body":"Here's the thing you don't seem to comprehend:\nThe people you get matched with, both allies and enemies, are all picked from the exact same pool of players. Given that, the teams you vs are just as likely, if not more, to have \"bad team mates\" as your team. Given that, the chance that \"bad team mates\" actually affect your rank in the long run is negligible, at best, and if they do it's more likely to be a positive influence for you, bringing you higher than you should be.\n\nBut then again, that's assuming you're not a \"bad team mate\" so maybe it's time for you to take a good long look in the mirror and figure out what you are doing that's holding you back instead of crapping on using the same bullsh!t excuse as millions of other people.","replies":[{"poster":"Dens2ty","date":"2015-10-16T12:19:38.087+0000","up_votes":1,"down_votes":0,"body":"So if you want to continue this argument, you are saying that because players report for things u get placed in a group with the same amount of reports even if these are false reports.\n\nNot based on damge to enemy or kdr just reports. So its not based on skill till when ?\n\nIf that's True it should be fixed.\n\nHonestly man u have a go at me about this every time I get on the forums.\nYou must have a say in it for you to fight so hard on the subject.","replies":[{"poster":"Project Xayah","date":"2015-10-16T12:31:40.372+0000","up_votes":1,"down_votes":0,"body":"I never mentioned reports or KDA or any of that sh!t, that's just you trying to find fault with what I've told you.\n\nJust an FYI, false reports can be identified pretty easily and they often end up with the reporter getting punished rather than the person who got falsely reported, when someone does get punished as a result of them that is.","replies":[]}]}]}]}]}]}]}]},{"poster":"Dens2ty","date":"2015-10-16T01:03:36.345+0000","up_votes":1,"down_votes":0,"body":":D why do you hate me what is your standing in the oceanic boards/ are u just a player or a admin or something?\n> [{quoted}](name=HeartVine,realm=OCE,application-id=Ntey9fRZ,discussion-id=gtWE2KLO,comment-id=00040000,timestamp=2015-10-15T07:07:54.412+0000)\n>\n> You're in low rank because you can't play. Get over yourself.\n\nAs a league player that plays a lot I see a lot of afk and rage quiters that never got punished and it took me 3 years myself to go stuff it my team is 3 vs 30 deaths ill afk then leave buster comes in right that day :P I think its great I afked and deserve the 5 minute wait, ive had it twice the 2nd time my power went off I accept that I get leavebustered and are happy to wait :)","replies":[{"poster":"Project Xayah","date":"2015-10-16T01:52:49.998+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Dens2ty,realm=OCE,application-id=Ntey9fRZ,discussion-id=gtWE2KLO,comment-id=000400000001,timestamp=2015-10-16T01:03:36.345+0000)\n>\n> As a league player that plays a lot I see a lot of afk and rage quiters that never got punished and it took me 3 years myself to go stuff it my team is 3 vs 30 deaths ill afk then leave buster comes in right that day :P I think its great I afked and deserve the 5 minute wait, ive had it twice the 2nd time my power went off I accept that I get leavebustered and are happy to wait :)\n\nWhich has nothing to do with what I said. Maybe you should try and keep it on topic.","replies":[{"poster":"Dens2ty","date":"2015-10-16T11:35:55.781+0000","up_votes":1,"down_votes":0,"body":"Have a nice night man.","replies":[]}]}]}]}]},{"poster":"Robo Erotica","date":"2015-10-15T02:07:05.548+0000","up_votes":1,"down_votes":0,"body":"I do agree it needs work, getting punished for leaving a game because your flatmate accidentally nicks an artery whilst making dinner and needs rushing to the hospital… Not a great feeling, a game that promotes teamwork calls me toxic and sits me in a low priority queue for not being completely selfish and inconsiderate (and probably life-endangering too).","replies":[{"poster":"JasonWazza","date":"2015-10-15T02:20:51.427+0000","up_votes":2,"down_votes":1,"body":"Yes because leaver buster punished you for one leave.\n\nExcept it didn't.","replies":[{"poster":"Robo Erotica","date":"2015-10-15T02:27:23.151+0000","up_votes":1,"down_votes":0,"body":"… He cuts himself a lot, okay?! Maybe I didn't want to get into my flat mates suicidal tendencies on a public forum but you dragged it out of me, happy now? Jk, you got me :P","replies":[]}]}]},{"poster":"GigaPube","date":"2015-10-15T07:31:01.884+0000","up_votes":1,"down_votes":0,"body":"what an entitled little dick. you do realise you have the entire internet at your disposal?","replies":[]},{"poster":"Project Xayah","date":"2015-10-15T03:10:14.231+0000","up_votes":1,"down_votes":0,"body":"You do realise you don't have to sit there for 20+ minutes just staring at the screen, right?","replies":[]},{"poster":"Roguestoney","date":"2015-10-15T01:36:27.121+0000","up_votes":1,"down_votes":0,"body":"ROFL","replies":[]}]}