{"poster":"ShacoShinigami","date":"2016-07-29T21:46:13.266+0000","title":"Solucion DEFINITIVA para erradicar flamers trolls y afks en LOL","subforum":"Charlas Generales","up_votes":1,"down_votes":16,"body":"Saben cual es la receta magica para una comunidad MUCHO mas amigable q este infierno lleno de ni&ntilde;os ratas, flamers y un largo etcetera? Si se&ntilde;ores,\r\nel mismo metodo de SC2, supongo q ya lo sabran, pero por si aun no lo captan se los revelo: HACER EL JUEGO DE PAGO.\r\nAl principio suena horrendo, pero con el tiempo te vas dando cuenta q es la unica manera de espantar a toda esa gente. &iquest;Porque? Simple, el q paga no va a trolear ni a flamear ni fedear a proposito, o trolear para perder sus dolares. \r\nTuve la grata experiencia de jugar SC2 por harto tiempo, un juego q como ya sabran, no es especialmente barato. Ademas, q necesitas un buen pc para correrlo, por ende, mas dinero necesitas aun. \r\nS&eacute; que puede llegar a sonar clasista incluso, pero esa es nuestra lamentable realidad, donde dinero hay, educacion sobra. ((((en la mayoria de los casos)))\r\n\r\nahora solo queda rezar.","replies":[{"poster":"PCtronix","date":"2016-07-29T21:49:24.737+0000","up_votes":2,"down_votes":0,"body":"espera .. estas metiendo un juego de blizzard .. .... entonces .. por que el heroes of the storm tambien hay flammers ? AFKS ? trolls ? siendo que es otra compañia .. y ponte tu ya que metiste el tema del starcraft ... el juego Overwatch .. no hay trolls ? AFK ? flammers ??? ... man .. en todas las comunidades hay ese tipo de gente .. en el starcraft es minusculo ya que es casi 2 o 3 horas jugando un juego y estar pensando todo para la batalla que defina la partida ... aca no es asi .. esto es un juego en equipo, no es un juego en solitario ...","replies":[]},{"poster":"Rolando Magic","date":"2016-07-29T21:48:17.341+0000","up_votes":2,"down_votes":1,"body":"El cod es de pago y tenes un monton de gente puteando en las partidas","replies":[]},{"poster":"Dildo de Moria","date":"2016-07-30T00:30:22.042+0000","up_votes":1,"down_votes":0,"body":"Por qué no se calla buen hombre?","replies":[]},{"poster":"Score","date":"2016-07-30T00:06:38.950+0000","up_votes":1,"down_votes":0,"body":"No pagaría por jugar esto.","replies":[]},{"poster":"dadevarG","date":"2016-07-29T22:21:42.185+0000","up_votes":1,"down_votes":0,"body":"Eso solo los bajaria un poco, que un juego sea pago o no no cambia la actitud de las personas.","replies":[]},{"poster":"mawece21","date":"2016-07-29T22:11:44.929+0000","up_votes":1,"down_votes":0,"body":"en verdad , el tema de los flamers ya esta completamente solucionado por el boton de mutear\n\ndeberian solucionar mejor lo de los afk . pero tampoco son tantos\n\nlos trolls son el  verdadero problema pero no se soluciona pagando","replies":[]},{"poster":"Shappaw","date":"2016-07-29T22:07:40.837+0000","up_votes":1,"down_votes":0,"body":"Sinceramente, hay mucha más gente soberbia que flammer y afk.","replies":[]},{"poster":"Dio","date":"2016-07-29T21:58:36.817+0000","up_votes":1,"down_votes":0,"body":"lo mejor es simplemente jugar el juego y dejar que con los años muera y los malos jugadores se vayan a otros juegos, y ahi quizas resurja como algo mejor el lol","replies":[]},{"poster":"Rynx","date":"2016-07-29T21:56:26.783+0000","up_votes":1,"down_votes":0,"body":"Overwatch se esta llenando de flammers y ratas, y es un juego pago.","replies":[]},{"poster":"Yrox the Third","date":"2016-07-29T21:49:04.188+0000","up_votes":1,"down_votes":0,"body":"No solo bajara considerablemente la cantidad de toxicos en el juego con esa \"\"\"\"\"solucion\"\"\"\"\"\" sino tambien bajara CONSIDERABLEMENTE la cantidad de jugadores.","replies":[]},{"poster":"Bienzahar","date":"2016-07-29T21:47:52.163+0000","up_votes":1,"down_votes":0,"body":"No, esa no es la solución, los trolls y flamers tambien tienen dinero :V","replies":[]}]}