{"poster":"S0kaX","date":"2016-09-17T14:07:42.594+0000","title":"Does the game recognize you're off meta?","subforum":"Gameplay","up_votes":9,"down_votes":1,"body":"Does the game give you mastery scores based on if you were being off-meta?","replies":[{"poster":"JayHog1992","date":"2016-09-17T14:38:18.426+0000","up_votes":6,"down_votes":0,"body":"It does, in fact, if you try troll things like Rumble support or skarner adc, the game will adjust to weaker masteries, because it expects you to feed and do poorly.\n\nIf you ever DO manage to overcome those issues, the game will reward you. It's like the game's saying \"Alright, well played...\"","replies":[{"poster":"TequilaZombie","date":"2016-09-17T15:47:02.558+0000","up_votes":3,"down_votes":0,"body":"Went from Mastery 5 to Mastery 7 Shaco in 6 games. All of them S- or above. Only failed to do it in 5 because in my second mastery 6 game I got an S-.\n\nIn all of those games I played Shaco Mid. I guess the client wasn't expecting it.","replies":[{"poster":"JayHog1992","date":"2016-09-17T16:21:22.576+0000","up_votes":1,"down_votes":0,"body":"I got to level 6 Rumble before the mastery system adjusted itself to me doing well as Rumble support.\n\nSecret is just spamming E since you have no mana and poking the enemy carries.\n\nMight not work well against enemy hookers like Blitz and Thresh tough, so care.","replies":[{"poster":"SeaWyrm","date":"2016-09-17T22:27:16.763+0000","up_votes":1,"down_votes":0,"body":"Can't say for sure, but I kind of doubt the system adjusts significantly based on the actions of any one single player.\n\nOTOH, if you're literally the only person playing support Rumble, I guess that might weight your influence somewhat...","replies":[{"poster":"JayHog1992","date":"2016-09-18T10:02:55.609+0000","up_votes":1,"down_votes":0,"body":"I know one thing, Support Rumble gives me a good score with less effort, but to get S or higher, I would have to kill steal often.\n\nWhich the adcs might not appreciate it tough.","replies":[]}]}]}]}]},{"poster":"DraygenBiscuit","date":"2016-09-17T14:09:54.156+0000","up_votes":5,"down_votes":0,"body":"I believe so. I think the game notices how much time you spend in certain lanes as your character and grades you accordingly.","replies":[{"poster":"oSEXYPLATYPUSo","date":"2016-09-17T14:16:40.349+0000","up_votes":2,"down_votes":1,"body":"why... now he is gonna go adc ziggs and i have to support him in that lane. thanks ... buddy\n\nFML \n\n\n{{sticker:zombie-brand-facepalm}}","replies":[{"poster":"DraygenBiscuit","date":"2016-09-17T14:19:18.175+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=MrFawknSunshine ,realm=NA,application-id=3ErqAdtq,discussion-id=uX96Y8Bi,comment-id=00000000,timestamp=2016-09-17T14:16:40.349+0000)\n>\n> why... now he is gonna go adc ziggs and i have to support him in that lane. thanks ... buddy\n> \n> FML \n> \n> \n> {{sticker:zombie-brand-facepalm}}\n\nGangPlank support time! {{champion:41}}","replies":[{"poster":"oSEXYPLATYPUSo","date":"2016-09-17T14:20:03.223+0000","up_votes":2,"down_votes":0,"body":"yeah like that works....","replies":[{"poster":"DraygenBiscuit","date":"2016-09-17T14:21:51.336+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=MrFawknSunshine ,realm=NA,application-id=3ErqAdtq,discussion-id=uX96Y8Bi,comment-id=0000000000000000,timestamp=2016-09-17T14:20:03.223+0000)\n>\n> yeah like that works....\n\nHmm well with a zigs adc, you would probably want a AD Support... Maybe Leona would work, idk is she ad?","replies":[{"poster":"SanKakU","date":"2016-09-17T17:02:44.030+0000","up_votes":1,"down_votes":0,"body":"She's not AD, but you can build her as ASC I guess(her new ultimate rewards attack speed), but I think she's better as a jungle than a bottom lane. Still, IBG is really good on her and it can put out a lot of physical damage and I guess Trinity Force is an option...since her W scales with armor though, I'd get IBG it along with the AS jungle item. If you're playing one for all, then hell yeah make ADC Leona buy Trinity Force, and you can get the MR + AD items I guess since her W scales with MR, too. I wouldn't buy anymore AD than that, though.","replies":[{"poster":"DraygenBiscuit","date":"2016-09-17T17:43:15.140+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SanKakU,realm=NA,application-id=3ErqAdtq,discussion-id=uX96Y8Bi,comment-id=000000000000000000000001,timestamp=2016-09-17T17:02:44.030+0000)\n>\n> She&#x27;s not AD, but you can build her as ASC I guess(her new ultimate rewards attack speed), but I think she&#x27;s better as a jungle than a bottom lane. Still, IBG is really good on her and it can put out a lot of physical damage and I guess Trinity Force is an option...since her W scales with armor though, I&#x27;d get IBG it along with the AS jungle item. If you&#x27;re playing one for all, then hell yeah make ADC Leona buy Trinity Force, and you can get the MR + AD items I guess since her W scales with MR, too. I wouldn&#x27;t buy anymore AD than that, though.\n\nLeona can actually preform really well in certain matchups, She is a hard counter to sona.","replies":[]}]},{"poster":"oSEXYPLATYPUSo","date":"2016-09-17T14:22:57.746+0000","up_votes":1,"down_votes":0,"body":"all i know is i have ZIGGS support a few times its not bad","replies":[]}]}]},{"poster":"MLDzXnRRR","date":"2016-09-17T18:25:10.839+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Markarth,realm=NA,application-id=3ErqAdtq,discussion-id=uX96Y8Bi,comment-id=000000000000,timestamp=2016-09-17T14:19:18.175+0000)\n>\n> GangPlank support time! {{champion:41}}\n\nI always get  S in normals as GP sup (unless the game is a stomp and we feed super hard bot). You don't even have to do too well.","replies":[]}]}]}]},{"poster":"Itankyou","date":"2016-09-17T14:21:11.846+0000","up_votes":1,"down_votes":1,"body":"Support {{champion:119}} , S+","replies":[{"poster":"TequilaZombie","date":"2016-09-17T14:38:33.225+0000","up_votes":4,"down_votes":0,"body":"If you get a support worthy score, you will be fine. But tell me: which Draven wants to go 0/0/20 in the first place?","replies":[{"poster":"DraygenBiscuit","date":"2016-09-17T14:42:15.423+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=TequilaZombie,realm=NA,application-id=3ErqAdtq,discussion-id=uX96Y8Bi,comment-id=00010001,timestamp=2016-09-17T14:38:33.225+0000)\n>\n> If you get a support worthy score, you will be fine. But tell me: which Draven wants to go 0/0/20 in the first place?\n\nPff just because hes support doenst mean he wont be getting kills. You underestimate him.","replies":[{"poster":"Itankyou","date":"2016-09-17T15:23:27.580+0000","up_votes":1,"down_votes":1,"body":"lul u guys think i buy support items? Real funny.","replies":[]}]}]},{"poster":"oSEXYPLATYPUSo","date":"2016-09-17T14:23:39.870+0000","up_votes":1,"down_votes":0,"body":"lol NO","replies":[]}]},{"poster":"Mysticman89","date":"2016-09-17T22:01:28.756+0000","up_votes":2,"down_votes":0,"body":"Your grade depends on your percentile performance compared to all others on the same champion in the same role. So if you're using a champion in an off-meta role, then you're only being compared to other people playing that champ in that role, which in the case of off-meta stuff usually means lower standards (since off-meta stuff tends to be off-meta for a reason). On the other hand though, off-meta picks are sometimes only really played by people who are confident in their ability to use the champion in the off-meta role, so occasionally the off-meta role standards are higher than you'd expect.\n\nIt's all relative to other players performances though, grading doesn't care about the absolute numbers you achieve.","replies":[]},{"poster":"Spoofghoul","date":"2016-09-17T21:56:08.479+0000","up_votes":2,"down_votes":0,"body":"no it does not recognize your ''off meta''\n\nwhat it does recognize is your position, then verifies this by a game play analysis of so called events it maps your locations and where you/opponents died and a lot of other stuff.\n\nIt compares you to other players to determine your score so ti looks at other players playing the same champ X in mid position, then at other players playing champ X if not enough data for comparison is found.\n\nSince nobody plays Yorick  or Sion mid it's been very easy getting S ratings for me on both and i have similar cases with Miss fortune toplane or jungle bard and other sorts of ''off meta'' things i do\n\nIn the end thouhg in order to get a high grade you still need to play well though its often easier if you regularly play off meta ^^ Since you have the upper hand since your cheesing your opponents do it well and you can get decent stats like damage dealth cs taken objectives taken down etc etc \n\nMany sheeple simply have no clue how to deal with someone playing waaay outside of the meta and simply don't know how to play vs it since they lack imagination and creative thinking","replies":[]},{"poster":"DunkinNoobs","date":"2016-09-18T15:42:07.071+0000","up_votes":1,"down_votes":0,"body":"It definitely does. I play Leona top on occasion and I'll get S ranks with scores like 4/5/10 with 170 CS at 30 minutes. That's just how low the bar is for Leona top in the system.","replies":[]},{"poster":"Project omen","date":"2016-09-17T20:18:10.931+0000","up_votes":1,"down_votes":0,"body":"Yes. Your rank after the game is based on how well you do with your champion at the specific role. Each lane is being monitored so if you spend a lot of time on bot lane (early game) the system will register that you were playing bot. For example, if you play jungle Yasuo, your rank will be based on how well you performed on him compared with the average *jungle* Yasuo player.","replies":[]},{"poster":"Jungle Lux God","date":"2016-09-17T19:37:05.651+0000","up_votes":1,"down_votes":0,"body":"I think the way champion mastery works is that it determines how good you are relative to other people playing the same champion, with Summoner's Rift's drafts mode also being compared to others in the same role.\n\nI've had games where I did decently well as jungle Morgana, and got S/S- ranks for those games just because no one plays jungle Morgana. On the other hand, I've gotten perfect games on top lane Nautilus and gotten A ratings just because people actually play top lane Nautilus.","replies":[]},{"poster":"inplane","date":"2016-09-17T16:26:06.298+0000","up_votes":1,"down_votes":0,"body":"Pretty sure the game detects which lane and role you're playing in and grades you depending on that. I get S and S+ on the majority of {{champion:163}} games I've played because I mainly play her in botlane as Support. The performance standard is low since no one plays {{champion:163}} as Support. I perform way above the standard and therefore get a higher grade.","replies":[{"poster":"reaperteaser","date":"2016-09-17T18:39:45.476+0000","up_votes":1,"down_votes":0,"body":"i have a friend who mains tf adc, i main tali, those two in bot lane is garunteed to tilt enemy midlaner","replies":[]}]},{"poster":"Akali is SO HOT","date":"2016-09-17T17:52:58.468+0000","up_votes":1,"down_votes":0,"body":"The system tracks your pathing on the map and determines your score by comparing it to other people with similar pathing.  That doesn't mean people that have pathing 99% identical to yours, but it means that the game can tell if you are top, jungle, mid, bot, or support.  So if you play Janna jungle you will be compared to other people that have played Janna jungle.","replies":[]},{"poster":"Skaiserus","date":"2016-09-17T17:04:55.451+0000","up_votes":1,"down_votes":0,"body":"Mostly from what I've seen, you all have the wrong idea. If you get picked into the ADC role and ask to switch with top, and go Riven, it will not identify you as a Bot lane Riven. Instead it looks to where you've been on the map and gives you a grade ACCORDING to the lane you were in most of the game. So, Draven supports as I've seen would most likely be an ADC, as he is AD. If there was to say a Lux ADC but bought AP, means she went support. Technically. So, to get these mastery tokens you want, you'd have to play a character into a role they aren't supposed to be played in. Such as Ahri (ACTUAL AD) bot lane, Riven support, Shyvana mid, etc. etc.","replies":[]},{"poster":"BatchBustsMeta","date":"2016-09-17T15:16:42.925+0000","up_votes":1,"down_votes":0,"body":"It does, I get a ton of s's, on my main champs, and I'm really not good. :-/","replies":[]},{"poster":"CerealBoxOfDoom","date":"2016-09-17T14:59:54.923+0000","up_votes":1,"down_votes":0,"body":"It knows what lane you go to\nI don't think it knows how to judge your build or anything. \n\nI think it knows if you got support items or not","replies":[]},{"poster":"LankPants","date":"2016-09-17T14:57:05.943+0000","up_votes":1,"down_votes":0,"body":"Based on my experience, yes. I've found it far easier to get high ranks while playing off-meta roles like Sej top and Sona Mid.","replies":[]},{"poster":"Theorchero","date":"2016-09-17T14:56:50.876+0000","up_votes":1,"down_votes":0,"body":"It's not so much off meta as this:\n\nIt scores you based on the average statistic of what champion you play in what role. Meta champions generally perform better so they require better scores to get an S.","replies":[]},{"poster":"S0kaX","date":"2016-09-17T14:31:43.361+0000","up_votes":1,"down_votes":0,"body":"Imma leave people discuss here :))","replies":[]}]}