{"poster":"Glutor","date":"2016-07-15T08:31:12.702+0000","title":"Taliyahs alte W war besser und ich will sie wieder haben!!!","subforum":"Champions & Gameplay","up_votes":6,"down_votes":2,"body":"Liebe Riotler,\r\n\r\nwenn ihr das hier lest bitte &auml;ndert die neue w Taliyahs{{champion:163}}  in die alte w, denn sie war vorher viel einfacher zu casten.\r\nEs ist wahr, dass es etwas komisch auf einen wirkt sie 2-mal zu casten dennoch hatte sie immerhin noch ausgel&ouml;st,\r\nbei der neuen ist es nun so, das man nicht einmal mehr damit fliehen kann wenn man verfolgt wird. Man muss\r\nnun stehen bleiben um denn Gegner nach hinten zu schleudern was einen mit Sicherheit t&ouml;tet. \r\nWenn man die neue w casten will und zu schnell mit der Maus arbeitet, dann l&ouml;st sie nicht aus was eventuell bzw. meist einen um denn kill bringt.\r\n\r\nVielen Dank f&uuml;r eventuelle Leser jeder kann helfen!\r\nEuer Glutor\r\n\r\nP.S. : wenn das nicht ge&auml;ndert wird habe ich eventuell einen main verloren{{champion:163}}","replies":[{"poster":"Friendly Fox","date":"2016-07-16T07:23:20.825+0000","up_votes":5,"down_votes":0,"body":"Danke für diesen Thread! Ich habe gestern Taliyah gespielt und war nach dem Game soooooo abgefuckt. Die neue W ist null intuitiv. Ich habe diesen Champ auf LVL 7 gebracht und man könnte sagen, ich maine sie. Aber nun fühle ich mich total behindert in meinem Spielstil. Es ist mir so oft passiert, dass die W entweder gar nicht auslöst oder ausversehen an einer total falschen stelle. Dass kann es einfach nicht sein. Auf Smartcast war der Skill vorher so easy zu nutzen. Und er ist einer der essenziellsten von ihr. Ohne den ist ihre E nutzlos und sie hat keinen vernünftigen Escape. Mir kocht jetzt schon wieder das Blut. Warum muss RIOT immer alles verschlechtbessern?!?","replies":[{"poster":"Glutor","date":"2016-07-16T09:08:27.927+0000","up_votes":3,"down_votes":0,"body":"Kein Problem bin Taliyah und Akali Main (no hate for Akali) und wollte das man wenn man Probleme mit Champions hat das man diese offen anspricht und daten dazu sammelt zb. wie sie findet was besser gemacht werden könnte etc. das Riot dann diese eventuell umsetzt. Es ist ja schließlich ihre Community und man kann dann schon davon ausgehen, das sie der Community was gutes tuen will.\nUnd deine aufgezählten Probleme genau die hab ich auch!","replies":[]}]},{"poster":"Braumerama","date":"2016-07-17T18:45:56.845+0000","up_votes":4,"down_votes":0,"body":"Also mit der neuen Taliyah komm ich 0 klar , echt schade die W ändert irgendwie komplett das Spielgefühl zum negativen","replies":[]},{"poster":"Spicavius","date":"2016-07-15T09:01:55.224+0000","up_votes":1,"down_votes":3,"body":"Willst du also, dass sie an einer anderen Stelle generft wird?\n\nSie musste definitiv generft werden. Es ging nicht anders.\nFrage ist eben nur, ob auf die jetzige Weise oder an einer anderen Stelle die vllt genauso weh tun würde.","replies":[{"poster":"DontKillMySoraka","date":"2016-07-16T12:15:46.379+0000","up_votes":4,"down_votes":0,"body":"Die W Änderung sollte kein Nerf sein, sondern das Casten angenehmer machen ^^\nHat aber das Gegenteil mMn bewirkt.","replies":[]},{"poster":"Friendly Fox","date":"2016-07-16T07:43:19.253+0000","up_votes":5,"down_votes":1,"body":"Wieso muss sie überhaupt generft werden? Sie ist nicht gerade die stärkste auf der Lane. Guck dir mal so eine Ahri an. Die muss so gut wie gar nicht ziehlen (W und R) und macht dich damit fast tot oder eine Lux, die mit ihrer Ult über die halbe Map feuert, tonnenweise Schaden damit macht und die im Late gefühlt 30 Sek. CD hat. Aber Taliyah soll einen nerf bekommen!? WTF!?","replies":[{"poster":"Spicavius","date":"2016-07-16T10:12:12.091+0000","up_votes":1,"down_votes":2,"body":"Naja die 70 % winrate sagt aber was anderes.\n\nAlso ich sehe das so. Man sollte ein Champion so anpassen, dass er bei den besten Spielern ausgeglichen ist, denn die holen das Beste ihr einem Champion raus und alles was nur geht.\n\nWir Casuals spielen nicht optimal. Deswegen sagst du auch, dass sie \"nicht gerade die Stärkste auf der Lane\" ist.\nJa, weil wir scheiße sind. Ganz einfach. Wir spielen schlecht und können das Potenzial eines Champions nicht in vollem Maße ausnutzen.\nDie Profis aber schon. Deswegen muss sie generft werden, da die Profis mit ihr eine 70% Winrate haben bzw hatten.","replies":[{"poster":"zeRoSeminex","date":"2016-07-16T13:59:45.315+0000","up_votes":3,"down_votes":0,"body":"Das ist vollkommener Blödsinn. Ihre Winratio lag in 6.13 bei gesunden 52% Winratio und einer guten Playrate. Profis haben durchschnittlich auf jedem Champion den sie spielen über 60% Winratio einfach weil sie in Soloq viel mehr Spielverständnis haben usw. Vergleicht man jedoch sie in der Lck und andere gute Ligen sieht man eine im Gegensatz zu anderen Champions eine eher schwachen Champion. Zudem möchte ich mal deine 70% Behauptung hinterlegt haben alle Statistiken zeigen eher eine normale Winratio.","replies":[]},{"poster":"ADFischi007","date":"2016-07-16T15:43:56.767+0000","up_votes":2,"down_votes":0,"body":"1.Quellen? \n2.Einzelne Spieler können Champs perfektionieren... \nDeshalb wird in LCS auch manchmal gegen best. Gegner bestimmte Champs, weil sie mit denen außergewöhnlich gut spielen können.\n\nMFG Fischi","replies":[]}]}]},{"poster":"Glutor","date":"2016-07-15T21:49:59.440+0000","up_votes":3,"down_votes":0,"body":"Von mir aus gern. Es fehlt halt eine mechanik mit der man gut und auch schnell arbeiten kann und sie immerhin noch trifft das ist mit der neuen W kaum noch gegeben.","replies":[]}]},{"poster":"Sirrkas","date":"2016-07-15T08:47:38.494+0000","up_votes":1,"down_votes":0,"body":"Ich hab sie mal im Custom getestet. Jetzt kann man immerhin W -> E als Combo machen. Vorher hat das selbst mit Smartcast nie geklappt.\n\nEdit:\nBei den kurzen Clips die ich mit Taliyah hochgeladen habe, scheint sie aber schon immer stehen geblieben zu sein, wenn man W castet.","replies":[{"poster":"Glutor","date":"2016-07-15T21:46:41.156+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Sirrkas,realm=EUW,application-id=Wj1wcocU,discussion-id=UcMt3QKB,comment-id=0000,timestamp=2016-07-15T08:47:38.494+0000)\n>\n> Ich hab sie mal im Custom getestet. Jetzt kann man immerhin W -&gt; E als Combo machen. Vorher hat das selbst mit Smartcast nie geklappt.\n> \n> Edit:\n> Bei den kurzen Clips die ich mit Taliyah hochgeladen habe, scheint sie aber schon immer stehen geblieben zu sein, wenn man W castet.\n\nnur mit dem unterschied das du es entweder noch turnen konntest oder aber noch fliehen konntest da man die w überhaupt getroffen hat jetzt geht das ja kaum noch außer du hast lcs plays","replies":[]}]},{"poster":"Scotlandman","date":"2018-03-07T12:36:32.232+0000","up_votes":1,"down_votes":0,"body":"Ich bin auch der Meinung das die alte W wenigstens als Option eingeführt werden sollte . Ich habe mich bereits an die neue gewöhnt aber so wie die alte fühlte sie sich noch nie rchtig an. \nDas lustige ich fand die alte W am Anfang übelst schwer zu casten aber nach so 10 games klappte dieser 'Doppelclick' immer besser.\nDamals hab ich noch ohne Smartcast gespielt ^^ Die guten alten Zeiten.\n\nBitte Riot überlegt euch bitte eine Überarbeitung, ich würde gerne selber endscheiden welche W mir besser liegt.\nEs ist ja kein Vor - oder Nachteil wenn davon gesprochen wird das die neue W das casten erleichtern soll.","replies":[]},{"poster":"alminlp","date":"2016-07-18T21:41:56.057+0000","up_votes":1,"down_votes":0,"body":"Das mit der w sollte nie ein nerf sein, es ist nur eine Anpassung damit man die w einfacher benutzen kann dafür ist der Schaden ein klein wenig schlechter geworden.","replies":[]},{"poster":"ShadowValmar","date":"2016-07-17T15:36:48.284+0000","up_votes":1,"down_votes":0,"body":"Kann dem OP nur zustimmen.\n\nIch fand Taliyah hat sehr viel Spaß gemacht und war auch nach dem ersten Buff stark genug um sie im Ranked zu spielen, was für mich nur selten auf neue Champions so zutrifft. Entsprechend habe sie oft gespielt und inzwischen halbwegs ganz gut gelernt.\n\nDie Mechanik der W war neu und gewöhnungsbedürftig, ja, aber ich hatte nach ein paar Spielen kein Problem damit. Wie viele andere habe ich den Champion so akzeptiert wie er gemacht wurde.\n\nJetzt werden die Leute, die Taliyah gelernt haben bestraft, weil einige Leute rumheulen dass sie der Lock stört? Und ZUSÄTZLICH werden noch ihre Werte generft? Sorry Riot, aber das kann doch nicht euer Ernst sein. Spieler sollten (und werden) sich nach so einer Aktion definitiv zweimal überlegen, wieviel Zeit sie in einen neuen Champion investieren (der Aurelion Sol Nerf war schon grenzwertig begründet btw), und einen Release-Skin braucht ihr mit dieser Policy eigentlich gar nicht mehr zu bringen, denn wenn sowas noch ein paarmal passiert niemand mehr so dumm ist, sich direkt einen zu holen wenn der Champion eh direkt abgetötet wird sobald man anfängt ihn zu mögen.\n\nDie Win Rate von Taliyah ist jetzt bei 46%, gj. Am Donnerstag hab ich auch gegen eine Taliyah Midlane gespielt, der Dude hatte sehr gute durchschnittliche Stats mit Taliyah, aber hat richtig hart verkackt weil er nicht auf die neue W klarkam. Es war klar zu sehen dass die mehrfach in die falsche Richtung ging, was effektiv auch der Grund war, weshalb ich die Lane gegen ihn hart gewonnen hab. Die Änderung an Taliyah war das **ABSOLUTE GEGENTEIL** von der von Riot nach außen hin publizierten und eigentlich sehr sinnvollen \"wir wollen, dass der Spieler gegen die Gegner spielt und nicht gegen das Spiel\"-Richtung. Danach hatte ich dann erstmal bis heute keinen Bock mehr auf LoL, weil es mich einfach so angekotzt hat.\n\nDeshalb ist wohl eine Erklärung dieses Fails nicht zuviel verlangt, und dass das ganze rückgängig gemacht werden sollte sehe ich sowieso als selbstverständlich.","replies":[]},{"poster":"Killerkante","date":"2016-07-16T00:00:37.264+0000","up_votes":1,"down_votes":2,"body":"Wenn ich ihre neue W kennen würde, würd ich ggf sagen nichts von beiden, ihr altes W war ziemlich broken.","replies":[]}]}