{"poster":"Eltritatutto","date":"2016-08-27T23:02:00.694+0000","title":"VERGOGNOSO","subforum":"Aiuto e supporto","up_votes":2,"down_votes":4,"body":"Salve a tutti cari lettori,\r\n\r\nHo appena scoperto che su League Of Legend se sei in promo e i server riot vanno gi&ugrave;, tu automaticamente perdi la promo! \r\n\r\nMolto interessante.\r\n\r\nMi chiedo come sia possibile poich&egrave; il problema &egrave; dei server riot.\r\n\r\nNecessito delucidazioni.","replies":[{"poster":"lStardustl","date":"2016-08-27T23:09:11.479+0000","up_votes":4,"down_votes":0,"body":"Se c'è un problema al server tutti i giocatori si disconnettono e la partita viene annullata.\nSe la partita non è stata annullata vuol dire che qualcuno gioca e che il problema non è del server.\nIn ogni caso puoi chiedere aiuto al supporto.","replies":[{"poster":"Eltritatutto","date":"2016-08-28T06:52:26.946+0000","up_votes":1,"down_votes":0,"body":"La partita è stata annullata ma è stata contata come lose.\n\nIl supporto cosa dovrebbe fare scusa?","replies":[]}]},{"poster":"BeardSergio","date":"2016-08-28T09:20:19.761+0000","up_votes":2,"down_votes":0,"body":"non è detto che siano i server. Potrebbe anche essere stato un problema di instradamento sulla linea. Per sicurezza aprire un ticket al supporto e chiederei delucidazioni se proprio ci tieni. \n\np.s. è sempre colpa dei server riot e vivi ogni giorno come se fosse un complotto","replies":[{"poster":"Eltritatutto","date":"2016-08-28T10:21:37.776+0000","up_votes":1,"down_votes":0,"body":"\"vivi ogni giorno come se fosse un complotto\"\n\nMi sono pisciato dalle risate! ahaha\n\nComunque poco importa... ormai quel che è fatto è fatto, sono di nuovo in promo quindi chissene frega xD\n\nGrazie del commento!","replies":[]}]},{"poster":"HaIIeIujah","date":"2016-08-28T06:26:22.774+0000","up_votes":1,"down_votes":0,"body":"Se \"problema dei server riot\" significa \"L'intera piattaforma EUW è andata giu'\", allora la partita viene annullata.\nSe \"Problema dei server rito\" significa \"Il mio pc ha droppato\", allora non è problema dei server.","replies":[{"poster":"Eltritatutto","date":"2016-08-28T06:50:18.031+0000","up_votes":1,"down_votes":0,"body":"Il mio pc non ha droppato. Ero premade con 2 amici e ha disconnesso anche loro.\n\nInoltre datoche ero su TS sono andato da altri utenti a chiedere se anche loro avessero droppato con risposta positiva, ergo non ho droppato io ma i server.\n\nLa partita è stata annullata ma purtroppo me l' ha contata come lose ed ora mi trovo dinuovo a 62 LP.","replies":[{"poster":"HaIIeIujah","date":"2016-08-28T06:58:21.328+0000","up_votes":1,"down_votes":0,"body":"Domanda, hai giocato altri games dopo quella?\nIl client e la match history si dissociano facilmente in questi casi. Può capitare che la MH \"Legga\" una sconfitta\ne ti assegni automaticamente la perdita di punti della promo anche sen on hai conclusi effettivamente.","replies":[{"poster":"Eltritatutto","date":"2016-08-28T07:45:27.633+0000","up_votes":1,"down_votes":0,"body":"Non ho fatto altri game poichè mi sono talmente incazzato che ho chiuso LoL.\n\nConta che dopo la disconnessione dei server ho quittato il game e mi ha dato \" Non hai avuto successo nella serie\" e mi ha riportato a 62LP.","replies":[{"poster":"HaIIeIujah","date":"2016-08-28T07:52:33.955+0000","up_votes":1,"down_votes":0,"body":"Capisco, ma provane comunque uno. E' un problema riscontrato. La speranza è minima, ma non ci perdi molto.","replies":[{"poster":"Eltritatutto","date":"2016-08-28T10:19:25.922+0000","up_votes":1,"down_votes":0,"body":"sono già dinuovo in promo praticamente... quindi.. \n\nmi spiace solo di aver perso una promo per un problema interno del server.\n\nGrazie a tutti per i commenti fatti!","replies":[]}]}]}]}]}]}]}