{"poster":"Luciano1998","date":"2018-12-29T20:30:02.825+0000","title":"Gente probando campeones en ranked","subforum":"Comportamiento del jugador","up_votes":2,"down_votes":1,"body":"Se que no es un tema nuevo este, pero me sorprende que a d&iacute;a de hoy pre temporada de la S9 riot no haya implementado un reporte contra esta practica, esta bien y todo querer probar campeones nuevos y dem&aacute;s, vamos que por algo hay tantos en la liga, pero no est&aacute;n para eso las normales? y as&iacute; no implementen un reporte por ello, que me parecer&iacute;a lo mas justo, que implementen un bloqueo de al menos tener que tener maestr&iacute;a 4 con dicho campe&oacute;n, ya van varias veces que me eh cruzado con gente en ranked la cual prueba campeones y termina tirandole la partida a otras 4 personas que vienen a ganar y me parece una total pereza, por no decir otra cosa, que esta gente siga jugando tan campante cuando por 2 reportes de gente completamente random uno puede llegar a tener ban de chat y restricci&oacute;n de recompensas a fin de a&ntilde;o.\r\nNo hago este t&oacute;pico como queja si no mas para saber si alguien mas a tenido estos inconvenientes y conocer sus an&eacute;cdotas relacionadas al tema. {{sticker:slayer-pantheon-popcorn}} \r\nMe gustar&iacute;a leerlos.","replies":[{"poster":"Tortuguita","date":"2018-12-29T20:42:06.551+0000","up_votes":2,"down_votes":2,"body":"¿Maestria 4? Ya me cuesta un riñon comprar a Kha'zix en la Smurf y queres que le compre Maestria 4 ...\n\n\" cuando dos reportes de gente completamente random uno puede llegar a tener ban de chat y restricción de recompensas a fin de año\"\n\nEmm no... Yo juego Kha'zix top y aunque me reportaron decenas de veces por \"Trolling\" tengo mis recompensas así que esto te lo sacaste de la manga compañero :3","replies":[{"poster":"Luciano1998","date":"2018-12-29T22:45:57.797+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Tortuguita,realm=LAS,application-id=PJAKt7ph,discussion-id=aZ4woo4Z,comment-id=0000,timestamp=2018-12-29T20:42:06.551+0000)\n>\n> ¿Maestria 4? Ya me cuesta un riñon comprar a Kha&#x27;zix en la Smurf y queres que le compre Maestria 4 ...\n> \n> &quot; cuando dos reportes de gente completamente random uno puede llegar a tener ban de chat y restricción de recompensas a fin de año&quot;\n> \n> Emm no... Yo juego Kha&#x27;zix top y aunque me reportaron decenas de veces por &quot;Trolling&quot; tengo mis recompensas así que esto te lo sacaste de la manga compañero :3\n\nTengo la cuenta desde la S3  y solo me la han restringido a lo mucho 4 veces y las primeras 3 con mucha razon porque mi internet no daba para jugar y me quedaba afk, y 2 por flamear pero la 4 vez que me la restringieron del chat fue por una partida  flex con 4 tipos con mucho tiempo libre y ganas de molestar me reportaron y en el reporte que me mando riot por \"flamear\" algunos de los msjs por los que me banearon fueron \"gane top\", \"no peleen si no hay objetivos por el cual pelear\" y \"wardeen drake aunque sea\", y te felicito por las recompensas yo hace mas de 2 semanas que juego diario para ganar honor 2 pero como te fije hace poco me restringieron el chat y me reiniciaron el honor","replies":[{"poster":"Tortuguita","date":"2018-12-31T04:00:05.731+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Luciano1998,realm=LAS,application-id=PJAKt7ph,discussion-id=aZ4woo4Z,comment-id=00000000,timestamp=2018-12-29T22:45:57.797+0000)\n>\n> Tengo la cuenta desde la S3  y solo me la han restringido a lo mucho 4 veces y las primeras 3 con mucha razon porque mi internet no daba para jugar y me quedaba afk, y 2 por flamear pero la 4 vez que me la restringieron del chat fue por una partida  flex con 4 tipos con mucho tiempo libre y ganas de molestar me reportaron y en el reporte que me mando riot por &quot;flamear&quot; algunos de los msjs por los que me banearon fueron &quot;gane top&quot;, &quot;no peleen si no hay objetivos por el cual pelear&quot; y &quot;wardeen drake aunque sea&quot;, y te felicito por las recompensas yo hace mas de 2 semanas que juego diario para ganar honor 2 pero como te fije hace poco me restringieron el chat y me reiniciaron el honor\n\nLinkea el chat entonces. Si realmente te banearon por nada puedes quejarte en soporte, pero si no muestras pruebas a seguir farmeando honor.\n\nSobre lo de la Maestría... es verdad pensé que pedías la que cuesta, mala mía. Pero de todas formas me parece absurdo. Tendrías que farmear maestría, por lo menos, con mas de 20 campeones para poder rankear... ¿Te parece un tiempo bien gastado si solo quieres medirte en rankeds donde mas competición hay? Tienes que tener en cuenta que la mayoría de la gente es low elo, por ende, no juegan al 100% por que solo se divierten en rankeds. Allí tienes el duo Alexelcapo y Felipez que son lo peor en duo xD","replies":[]},{"poster":"Cant hit the Qs","date":"2018-12-30T17:16:29.734+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Luciano1998,realm=LAS,application-id=PJAKt7ph,discussion-id=aZ4woo4Z,comment-id=00000000,timestamp=2018-12-29T22:45:57.797+0000)\n>\n> Tengo la cuenta desde la S3  y solo me la han restringido a lo mucho 4 veces y las primeras 3 con mucha razon porque mi internet no daba para jugar y me quedaba afk, y 2 por flamear pero la 4 vez que me la restringieron del chat fue por una partida  flex con 4 tipos con mucho tiempo libre y ganas de molestar me reportaron y en el reporte que me mando riot por &quot;flamear&quot; algunos de los msjs por los que me banearon fueron &quot;gane top&quot;, &quot;no peleen si no hay objetivos por el cual pelear&quot; y &quot;wardeen drake aunque sea&quot;, y te felicito por las recompensas yo hace mas de 2 semanas que juego diario para ganar honor 2 pero como te fije hace poco me restringieron el chat y me reiniciaron el honor\n\nes asi, a mi me banearon tmb por hostigamiento segun rito pero mis msjs eran todos de shotcaller diciendo vamos aca, no peleen 3 vs 5 y cosas asi..  rito no abandono..","replies":[]}]},{"poster":"Luciano1998","date":"2018-12-29T22:48:11.801+0000","up_votes":1,"down_votes":1,"body":"Ademas las maestria 4 y 5 son gratis, a no ser que riot tambien lo haya hecho por EA me parece que estas mal xD\nPD: hace como un año que no juego, hace poco volvi a jugar","replies":[]}]},{"poster":"Cant hit the Qs","date":"2018-12-30T17:20:08.373+0000","up_votes":1,"down_votes":0,"body":"muchas veces me queje de eso que te paso, y de cosas peores, probar un campeon en ranked es de tipo mala lechee, pero entrar para trolearte la partida y encima reportarte porque es seguro que te vas a sacar mandando msjs, insultes o no, seguro mandas muchos msj intentando salvar el desastre, te banean el chat perdes el honor etc..  pero a rito no le interesa.. lo dijo un rioter hace poco, rito tiene 2 moderadores yrevisadores de reportes por cada 15 jjugadores europes, en las/lan no tiene ninguno, solo bots.. que cuando reciben ciertos reportes reiterados aplican la sancion.. en europa o estados unidos banean gente por \"inting\" que es perder adrede robando jg a tu jg por ejemplo","replies":[]},{"poster":"pikape","date":"2018-12-30T02:09:28.991+0000","up_votes":1,"down_votes":0,"body":"¡Ese zed salio con un buen kda!","replies":[]},{"poster":"Fízz","date":"2018-12-29T21:28:21.602+0000","up_votes":1,"down_votes":0,"body":"\"pero es pretemporada xdDdXdDxDxDxDxDxDdDdDxD\"","replies":[{"poster":"Luciano1998","date":"2018-12-29T22:47:09.946+0000","up_votes":1,"down_votes":0,"body":"Pero eso significa entrar a trollear a 4 personas porque si?","replies":[]}]},{"poster":"serfar","date":"2018-12-29T21:39:37.992+0000","up_votes":1,"down_votes":0,"body":"coincido en todo, para mi se deberia mostrar la maestria 3 y desde ahi poder rankear con ese campeon","replies":[]}]}