{"poster":"Wollenlord","date":"2015-03-11T16:10:37.909+0000","title":"Wiederholend 75 Spiele Chat-einschränkung.","subforum":"Spielerverhalten & Moderation","up_votes":2,"down_votes":4,"body":"Hallo,\r\nnachdem ich ca. 2 mal Chat-Einschränkungen hatte (vielleicht zu recht),\r\nkamen diese, nachdem ich sie immer wieder geschafft habe, nach kurzer Zeit immer wieder (jetzt evt. das 2. mal zu UNrecht)\r\nHeute kam diese Meldung nämlich einfach so nochmal, dabei habe ich niemanden in den letzten Tagen grundlos, bzw. überhaupt nicht beleidigt.\r\nDeshalb will ich mich dafür beschweren.","replies":[{"poster":"Phobos Selini","date":"2015-03-11T16:22:43.705+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Wollenlord,realm=EUW,application-id=KYnfKGf0,discussion-id=oQxfE1d1,comment-id=,timestamp=2015-03-11T16:10:37.909+0000)\n>\n> Hallo,\n> nachdem ich ca. 2 mal Chat-Einschränkungen hatte (vielleicht zu recht),\n> kamen diese, nachdem ich sie immer wieder geschafft habe, nach kurzer Zeit immer wieder (jetzt evt. das 2. mal zu UNrecht)\n> Heute kam diese Meldung nämlich einfach so nochmal, dabei habe ich niemanden** in den letzten Tagen grundlos, bzw. überhaupt nicht beleidigt.**\n> Deshalb will ich mich dafür beschweren.\n\nIn die Bewertung fließen aber alle Spiele seit Deiner letzten Strafe mit ein. Also ist \"in den letzten Tagen\" keine Ausrede und \"begründete\" Beleidigungen gibt es auch nicht.","replies":[]},{"poster":"dat Zoidberg","date":"2015-03-11T16:20:45.633+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Wollenlord,realm=EUW,application-id=KYnfKGf0,discussion-id=oQxfE1d1,comment-id=,timestamp=2015-03-11T16:10:37.909+0000)\n>\n> Hallo,\n\n> ....dabei habe ich niemanden in den letzten Tagen grundlos, bzw. überhaupt nicht beleidigt.\n\nDie Einschränkung sagt doch schon alles. Du bist wohl der Meinung, wenn du denkst du wärst im Recht hättest du das Recht jemanden zu beleidigen. Das ist ein Irrtum. Vielleicht reicht schon eine einzige Beleidigung um die Chateinschränkung zu verlängern. Also selber Schuld. und permaban incoming.","replies":[]},{"poster":"Opalegend","date":"2015-04-28T08:57:20.677+0000","up_votes":1,"down_votes":0,"body":"Mir ging es ähnlich. Komme heute on und sehe: 54 Einschränkungen normale Spiele und 34 Einschränkungen Rangliste. Auch ich habe mich stets korrekt verhalten. Natürlich bekommt man manchmal Ermahnungen, wenn irgendwelchen Premades das Spielverhalten nicht gefällt und sie einen reporten, aber ich habe nie jemanden beleidigt oder Ähnliches. Mir ist völlig unverständlich, wie diese Bestrafung zustande gekommen ist.","replies":[{"poster":"eingew","date":"2015-04-28T09:11:48.213+0000","up_votes":1,"down_votes":0,"body":"Keine Sorge, du bist bei weitem nicht der einzige, dem das so geht. Es passiert leider, dass deine Teammates manches, was du vielleicht eigentlich gar nicht negativ meinst, trotzdem so auffassen. Deshalb wäre es ganz praktisch, wenn du uns aufschreibst, was du im Chat so regelmäßig von dir gibst, dann können wir dir helfen herauszufinden, was davon eventuell ausschlaggebend für die Sperre gewesen sein könnte.","replies":[]}]},{"poster":"Wollenlord","date":"2015-03-13T15:58:54.297+0000","up_votes":1,"down_votes":0,"body":"Hallo nochmal,\ndanke für eure Antworten.\n@DAGOBERT DMK\nIch weiß dass Beleidigungen Grundlos sind, aber viele wissen das anscheinend nicht, also habe ich das so geschrieben. (ich habe noch nie jemanden im ganzen Leben beleidigt)\nUnd gut dass ich jetzt weiß, dass selbst solche Wörter allein schon dazu beitragen. Danke nochmal.\n\n@DAT ZOIDBERG\nDu z.B. hast mich gerade beleidigt. ''Denkst du wärst im Recht'' Macht jetzt aber auch nichts.\nWichtig ist jetzt, dass ich es besser weiß.","replies":[]},{"poster":"PwnedAkkon ","date":"2015-03-11T16:13:29.464+0000","up_votes":1,"down_votes":0,"body":"niemanden in den letzten Tagen grundlos, bzw. überhaupt nicht beleidigt.\nwtf Beleidigungen sind immer grundlos.\nZudem erkennt der chatfilter schon \"fuck\" \"noob\" oder ähnliches als Beleidigung.","replies":[]},{"poster":"Kyrusa","date":"2015-03-11T17:40:55.284+0000","up_votes":2,"down_votes":5,"body":"ich werd sogar für nix schreiben und carryn reportet.. dieses report scheiße ist so sinnlos.. lieber die hardflamer bannen statt menschliche gefühlsäusserungen, wenn man sich anstrengt und das team verliert aber, teilweise mit absicht.. das man sich dann ärgert, sit voll normal..... aber die scheinheiler hier wollen das nicht verstehn","replies":[{"poster":"eingew","date":"2015-03-11T20:02:53.787+0000","up_votes":2,"down_votes":1,"body":"Negativ sein ist immer negativ, egal aus welchem Grund das geschieht. Der Grund ist auch im Allgemeinen vollkommen irrelevant, wichtig ist, ob deine Mitspieler mit deinem Sozialverhalten zufrieden sind.","replies":[]}]}]}