{"poster":"xXSchätzchenXx","date":"2016-07-31T22:05:18.317+0000","title":"Annie bug","subforum":"Melde einen Bug","up_votes":1,"down_votes":0,"body":"Entweder fehlt was in der Champbeschreibung oder Annie ist mal wieder Buggy. \r\nZur Zeit kann man sie Stunnen und sie kann w&auml;hrend des Stunns oder Unterdr&uuml;cken weiter ihgre Ult casten.\r\n\r\nSo kann sie z.B. zu einem Urgot mit 100 hp Laufen, warten das er sie ultet und die ult w&auml;hrend des channels mit tibbers canceln, das selbe mit dem Veigar cage. \r\nSomit wird CC gegen sie einfach nur unsinnig.","replies":[{"poster":"xXSchätzchenXx","date":"2016-08-02T16:22:44.793+0000","up_votes":1,"down_votes":0,"body":"Jup casst  würde sinn machen, falls das Casting nicht unterbrochen wird. Aber Anni hat etwa 0.25 s Cast time für Tibbers. Wenn der cast aber erst etwa 1 s nach dem Stun kommt, ist das Argument aber nicht mehr richtig.","replies":[]},{"poster":"SFCFlo","date":"2016-08-01T09:25:04.373+0000","up_votes":1,"down_votes":0,"body":"Das ist das so genannte Channeling. \nEinige Skills brauchen ja eine gewisse Zeit bis Sie aktiviert werden (das Channeling). Ein Paar Skills die mir dazu auf die schnelle einfallen sind {{champion:81}}  seine E sowie R Fähigkeit, {{champion:412}}  seine Q, {{champion:99}}  ihre R, {{champion:18}} ihre E.\nEins der bekanntesten Beispiele Wäre ein {{champion:81}} /{{champion:18}}  welche von einer {{champion:53}} Q getroffen werden aber dennoch wespringen können.\n\nAnscheinend trifft das auch auf Annie zu. Demnach meine ich das dies so gewollt ist.","replies":[]},{"poster":"SeaHorseCalamity","date":"2016-08-01T09:17:41.153+0000","up_votes":1,"down_votes":0,"body":"Das ist ein häufiges Phänomen,\nSchon mal als Blitzcrank nen Ezreal gegrabt, als dieser seine E aktiviert?\nDer Hook trifft, macht Schaden, aber ezreal steht immernoch da, wo er mit dem Sprung hin wollte.\nManche Fähigkeiten werden in der Castanimation halt nicht abgebrochen. Annie Ult scheint dazu zu gehören.","replies":[]},{"poster":"See you in Sheol","date":"2016-08-01T08:48:02.026+0000","up_votes":1,"down_votes":0,"body":"Das ist eigentlich kein richtiger Bug, falls ich deinen Thread richtig verstanden habe. Es ist so: Wenn man eine Fähigkeit, die eine bestimmte Verzögerung, oder auch \"Cast Time\", hat (Also z.B. Annie's \"Tibbers Beschwören\" / Ultimate), aktiviert, während man von einer \"Crowd Control\"/CC Fähigkeit getroffen wird (\"Crowd Control\" = \"Massenkontrolle\"), so wirkt zwar der Effekt der CC Fähigkeit, aber die Fähigkeit wird dennoch nach jener bestimmten Verzögerung ausgeführt.\n\nEin gutes Beispiel dafür ist auch Bard {{champion:432}}  gegen Thresh {{champion:412}}:\n Bard aktiviert seine Ultimative Fähigkeit, um Thresh und seinen ADC aufzuhalten, und somit zu entkommen. Jedoch aktiviert Thresh seine Q - Fähigkeit (Auch genannt \"Hook\") genau dann, wenn Bards Ultimate ihn trifft. Somit wirkt zwar der Effekt der Bard Ult, aber Thresh kann trotzdem seinen Hook treffen, und Bard heranziehen.\n Ich hoffe ich konnte dir hiermit helfen,\nMFG Ender.","replies":[]}]}