{"poster":"Follow me around","date":"2017-05-15T08:25:30.985+0000","title":"When inting/afking is okay","subforum":"Player Behaviour","up_votes":1,"down_votes":5,"body":"Sometimes the game makes you hate other people. Sportsmanship only goes so far and Riot seems to forget real human beings are sitting behind the screen. My egotistic support Zilean who didn't passive me up once and bombed my farm from level 5+ and him and my top laner denied me about 50-60cs as adc and I was starting to get really behind. I pinged omw and asked them to let me have it nicely but they didn't. So what's better here, to keep on taking the abuse and lose out late or show these \"back off I'll carry\" attitude sub-plat players the only way they'll actually listen? If I took it I wouldn't have the spirit to make sharp plays anyway, you can only take it in your stride so many times a week.\nThe sad and backwards thing is that these players don't get banned. They don't get punished except for player retaliation but the rules prohibit this.\nA plat friend I know irl ignored me and took my farm and I inted and it actually shocked him a little, even though I'd asked nicely. It was like he'd realized I'm also a human being with feelings and that griefing someone else's game because they made a mistake just isn't worth it. When you have a bad attitude people's words don't mean anything to you. He doesn't do it anymore and we play better together now. ","replies":[{"poster":"LetsTwitch","date":"2017-05-28T10:04:31.502+0000","up_votes":2,"down_votes":0,"body":"Didnt read, responding to title. Its never okay","replies":[{"poster":"Darlkin","date":"2017-05-29T02:04:42.223+0000","up_votes":1,"down_votes":0,"body":"what if someone's life was at stake?","replies":[]}]},{"poster":"Main Line","date":"2017-05-29T12:40:43.702+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Collateral,realm=OCE,application-id=T8eq2lFQ,discussion-id=NJnEPze9,comment-id=,timestamp=2017-05-15T08:25:30.985+0000)\n>\n> Sometimes the game makes you hate other people. \n\nNot really hate. But you just have to develop warlike mentality. Assume that your team are monkeys and if they do something stupid or annoying, put it down to that.\n\n> The sad and backwards thing is that these players don't get banned. They don't get punished except for player retaliation but the rules prohibit this.\n\nThat's right, it is annoying, but unfortunately we have an automated dumb system that cannot recognise when sophisticated griefers are at work. The only thing you can do is ask yourself, \"Can we still win the game?\" and if so go about doing that. If the answer is no, then you have the option of just inting the loss quicker, like TheRainMan does. Could risk a ban though, depends what you want really.\n\n> A plat friend I know irl ignored me and took my farm\n\nI hate it when higher elos do this because they don't trust you enough or they think **they have** to carry the game. Btw this sort of thing happens all the time in Gold because no-one trusts anyone, hence bugger all teamwork. Anyways I had this flex queue game where some platinum jungler was saying shit like \"htf do you have those KDAs when you are in bronze?\" and then \"oh its because you are never in fights\" and rubbish like that. Best thing is to just mute them. I did just that and then at the end of the game just said \"hey look Graves, i improved my KDA\" because arguing with idiots is just a waste of time. He was trying to say \"you must get carried a lot\" and I said \"its because WE LET YOU carry us\" before disconnecting from the end screen.\n\nI could have easily griefed him back by taking his jungle camps and not showing up to any fights or objectives. But what is more important, to make a point to some idiot, or to win the game? For me it was better to win the game, and then let his stupid platinum (that's right platinums on OCE are shitters) arse know after the game.\n\nHowever if he does that sort of stuff and then gets cocky and starts feeding while your whole team is underpowered, I feel like TheRainMan's approach can be justified. Why fuck around for 20 more mins to prolong an obvious defeat? Just get that surrender at 20 vote out there, sign it 4 times and get to a new game. Just be sure that you can judge whether you can win a game or not. This will come down to understanding. A lot of teams surrender when they can still win the game if they mute idiots and get back to trying. However if it's gonna take 3 consecutive aces against a vastly stronger team with superior composition, then you might as well forget the game and go to a new one.","replies":[]},{"poster":"Mozzie25","date":"2017-05-29T02:56:28.258+0000","up_votes":1,"down_votes":0,"body":"I don't even understand the point your trying to make here. Sure the supports that mess up your cs but inting is not the soloution. Your essentially throwing the game away. \n\nAs for your second example. If another player is ahead and you've made some mistakes and are behind why would they give you the cs? It would be better used on then to try and snowball there lead. \n\nTbh if you inting for shit like people 'stealing' your cs you are part of the problem. \n\nAlso since when is taking cs greifing. Just cause your ADC doesn't mean you have dibs on all the cs.","replies":[]}]}