{"poster":"U4fyn2vZzW","date":"2015-04-04T23:58:43.743+0000","title":"Let's be real - Is there anything Thresh does that any team wouldn't want?","subforum":"Gameplay","up_votes":3,"down_votes":3,"body":"Let&#039;s see what Mr. Chain Warden has. \n\nEngage\nDissengage\nShield\nGets naturally tanky\nFree flash, longer range then flash\nHarass \n\nIs it just me or is it not the best support in the game currently? Only thing he's really missing is a heal, but honestly when everything else is factored in a heal isn't needed. ","replies":[{"poster":"Thryale","date":"2015-04-05T00:05:37.525+0000","up_votes":4,"down_votes":1,"body":"Thresh certainly does have an over-abundance of utility atm. And while he is clearly a top tier support, there are other supports that are more specialized that can fit a team comp better. Both leona and braum get much tankier than thresh and provide great engage/disengage.\n\nThat being said, thresh is definitely skewing the bot lane atm, much like how lee sin is skewing the jungle. Neither are OP and neither of them have a stupid high win rate, but their sheer versatility is forcing other supports to either be extremely good at one or more things just to compete with thresh for a position on the team.\n\nPersonally, I'd like to see thresh's flay reworked. Both his lantern and hook are extremely iconic, and I'd hate to see that taken from him, but his flay adds so much superfluous utility and cc to his kit that it is leaving him with very few actual downsides to playing him.","replies":[]},{"poster":"Sailor Mint","date":"2015-04-05T00:20:18.360+0000","up_votes":3,"down_votes":2,"body":"He has a hook and a lantern.\n\n* Blitzcrank and Nautilus do the Hook part better.\n* Janna and Nami still have better disengage.\n* Lulu single handedly makes immobile champions viable and squishies tanky.\n* Braum, Nautilus and Leona do the tank with CC part better.\n* Alistar and Braum have better peel.\n* Sona and Leona have better engage.\n* He doesn't have a heal, so we're leaving Soraka out of this.\n* That leaves Taric, who's underrated, but doing quite well in this meta.\n\nSo, what's Thresh? A dude with a hook and many tricks, but only a lantern as a gimmick to call his own.\n\nIf you don't support and want to make plays, or maybe just want to be able to dabble in everything, Thresh is your safest bet.","replies":[{"poster":"U4fyn2vZzW","date":"2015-04-05T00:22:57.897+0000","up_votes":3,"down_votes":1,"body":"But then we have Thresh, who can basically do all of that.","replies":[{"poster":"Sailor Mint","date":"2015-04-05T00:38:57.568+0000","up_votes":1,"down_votes":0,"body":"He's a pretty good candidate for \"My First Support\" and for people who don't feel the need to specialize. But let's face it, everyone plays Thresh, everyone knows how to play against him and keep him in check. Especially during his less than stellar laning phase.","replies":[]},{"poster":"insaiyanbacca","date":"2015-04-05T00:24:55.964+0000","up_votes":1,"down_votes":1,"body":"yes but he doesnt do any of them better then the others he may have it all but he doesnt do any of them best","replies":[]}]},{"poster":"U4fyn2vZzW","date":"2015-04-05T02:39:50.029+0000","up_votes":1,"down_votes":1,"body":"The problem with thresh is you cannot DO ANYTHING against him in lane. With Leona who is super aggressive you can play a peel heavy support that can render her engages useless, same with Braum who is peel and engage oriented but no harass (same with leona).\n\nAll those supports have ways to counter them and handle them in lane (And you said Leona has good engage which is purely her trashed ranged ult, let's not forget that she's a caster minion in lane).\n\nWith Thresh he's everything, want to harass him? He's ranged. Want to go aggressive? He can dissengage. Want to play passive? He can engage. Plan on all inning and saying yolo? He gets naturally tanky.\n\nThis is why I despise him, you're literally forced into a \"Meh, just gotta ignore him\" lane, same with champions like Nidalee and Lee Sin. It's completely anti-fun not having any options to deal with him in lane. \n\nHe has everything, and because of this you can do very little to him. Let's look at Leona, sure she has amazing cc in lane true - But does she also have great harass in the form of ranged attacks? No, does she peel as good as Thresh? Let's be real, no. His cc may not be as good as hers, but it's still good. ","replies":[{"poster":"Sailor Mint","date":"2015-04-05T03:17:04.680+0000","up_votes":1,"down_votes":0,"body":"Have you considered right clicking him in lane with a champion that has more than 475 auto-attack range or simply taking advantage of the fact that he has one of the worst level 1 in the game?\n\nI know you are not a support main, but there are supports champions beyond Blitzcrank/Leona/Thresh.","replies":[]}]}]},{"poster":"Enkidusmurf","date":"2015-04-05T02:57:22.332+0000","up_votes":1,"down_votes":0,"body":"Knockups tempt mid/toplaner to pick Yasuo . . . \n\nHe's a jack of all trades, but there is someone better at pretty much everything that he does. The lantern might be an exception. You want engage?{{champion:89}}  Disengage?{{champion:40}}  Shield? (actually tons of them amongst supports; not sure why you even included that.) Gets naturally tanky?{{champion:12}} {{champion:201}} Free flash? Actually, not even Thresh has that. He has a conditional gap closer, and an escape tool that an ally can use, but he cannot. He has to land his hooks and follow up, and he has to be in position for the lantern.\n\nThresh is probably overloaded. But I don't think he's overpowered.\n\nEdit: you also completely left out sustain, in which case he loses to  {{champion:37}} {{champion:16}} {{champion:44}} {{champion:267}} . You mention harrass, but you can't possibly think he's the *best* at that, can you? \n\nHe's also got substandard lockdown compared to Braum, Leona and Annie. \n\nSo what I'm saying is, there's not much he *can't* do, but there is a *ton* of stuff that other people do better.","replies":[]},{"poster":"Sooko","date":"2015-04-05T01:01:37.935+0000","up_votes":1,"down_votes":0,"body":"I think I can share my thoughts on Thresh. His kit is very complex indeed. It is hard to balance when he has enough utiliity to be useful while healing his enemies anyway. I don't think everything about him is OP, but he is pretty much the jack of all trades when it comes to supports (asides from sustain, that class has been dying in popularity anyway. But he is the closest we have to that jack of all trades)\n\nHis passive feels decent, I guess. There isn't much to it, asides from the RNG to get most souls out of lesser minions. I don't think this is OP at all, considering Thresh doesn't even follow his jungler around to get the most souls out of every camp (1 is guaranteed)\n\nHis Q is a weaker, but more painful version of Blitz Q. It hurts to see your champion without tenacity getting slowly pulled helplessly towards the enemies who await your soul hungrily. It is relatively easy to outplay and make plays with. I actually find this part of his kit pretty fun and sweat inducing. Not OP, for a kill oriented support.\n\nHis W is what ticks me off. Yes, this skill is OP. Always was, always will be. Take the shield away, but the lantern's active will always be a blessing. There is no way around it. I feel like CertainlyT's most creative ability was this one. Its very powerful and has counterplay that requires action rather than items, however, and that is pretty neat nowadays. I feel like it is an acceptable way of OP. There are several OP abilities in the game that can be accepted, because the other parts of a kit have weaknesses (old Veigar's Stun, Tryn's AD reduction, Garen's W passive, resets in general). This skill is OP anyway, and suits supports oriented mainly to protect their carries through laning phase.\n\nAbout his E... Well, the passive is quite good for a ranged champion like him to proc his relic shield. I don't find the passive particularly game-breaking by itself, its just another thing to add to his overloaded kit. I hate the fact that it is already better than Ashe's passive, but that is Ashe's problem perhaps, not Thresh. This passive suits a poke supp mainly, and would be welcomed by nearly all ranged champions.\nThe active can be both engage and disengage, a versatile skill. It isn't much to be fair. I still like other supports' CC better. But its active can be used by nearly every support that wants to protect or kill a carry, as well as poke supp if we get the passive too.\n\nHis R is... meh. It can't be effective on many supports. It requires mobility to be useful in most skirmishes. It is Thresh's 3rd CC ability, with a huge slow packed in its walls. There are better ultimates as far as I am concerned, but this isn't a bad ult by any means, and can fit diverse playstyles for both agressive and protective Threshes.\n\nTL;DR: Thresh fits many types of support gameplay, actually all of them except sustain, and that is why most teams welcome his presence in their comp. The only kind of team I couldn't see Thresh being among the most wanted in was one with an engage, tanks, CC/mobility to protect squishies and without sustain: Malphite, Sejuani, Viktor, Draven for example. But, asides from W (this thing is very powerful), despite his kit letting him do all those things, his skills aren't really unbalanced, just versatile (maybe too much, but I don't know about that)","replies":[{"poster":"U4fyn2vZzW","date":"2015-04-05T02:44:16.428+0000","up_votes":1,"down_votes":0,"body":"The problem I have with Thresh is that he literally has everything, and because of this counterplay against him is nonexistent. I hate the fact that he has everything you really need in botlane which is harass, tankyness, engage, dissengage, shield, etc - This is literally what any ADC wants and needs to survive the entire game. \n\nHe needs some holes in his kit, something that can allow you to do something in lane. Leona is an all in champion and lacks any real harass, Janna is purely passive, Sona is squishy, Sorlika is all heals on wheels - Which is good, but she has no real engage, Nami is literally the closest thing that can come to Thresh but she's squishy and no where peels as good as he does while also being a literal meat shield.","replies":[]}]},{"poster":"InsaneSamurai","date":"2015-04-05T00:32:07.769+0000","up_votes":1,"down_votes":1,"body":"Sad that people are downvoting you for pointing out that an obviously overloaded kit is overloaded.  Fairly good example of why Riot has such a hard time getting things done.\n\nHe's the Lee Sin of supports in so many ways.","replies":[]}]}