{"poster":"U4fyn2vZzW","date":"2014-11-29T18:43:28.727+0000","title":"\"We reworked Cassiopeia for being an OPPRESSIVE LANE BULLY\"","subforum":"Gameplay","up_votes":79,"down_votes":22,"body":"\"Meanwhile we left {{champion:268}} {{champion:134}} {{champion:115}} {{champion:101}} {{champion:13}} {{champion:238}} {{champion:7}}{{champion:74}}   because reasons. Also, we made it so now the only option she has is to bully (Or more like be a nuisance in lane like a fly at a barbecue that won't screw off) in lane to farm passive stacks so she's relevent late game.\"\n\n- Sincerly, Rito Gaymes.\n\nAlso, I would gladly lane against a pre-rework Cassiopeia over Xerath or more importantly fucking Syndra that bitch is just insulting. Seriously it is absolutely INSULTING, **IN-SULT-ING** that you would **DARE** call Cassiopeia an \"oppressive lane bully\" while **Syndra still is exsistence.**\n\nCassiopeia was an oppressive lane bully but they left Syndra out of the equation? \n\n**Riot makes Activision and Electronic Arts look like they know what they're doing, and that's fucking saying something. **","replies":[{"poster":"chumbler","date":"2014-11-29T19:08:27.004+0000","up_votes":34,"down_votes":12,"body":"She doesn't \"bully\" now because the word \"bully\" carries with it an implication that there is an actual threat. The whole rework is a joke handled by an idiot, and it's founded on a complete lie that isn't even held consistently. The funniest and saddest part is that it *doesn't even fix the things they claimed they wanted to fix, and actually makes them worse.* It's not like I didn't already know that Riot has no competent designers, but between the Cass rework, Sion rework, and the train wreck that is their preseason changes, that knowledge is absolutely confirmed.\n\nAlso you can't really put LeBlanc in that list either, since she does nothing now.","replies":[{"poster":"soulchaos","date":"2014-11-29T20:07:50.617+0000","up_votes":16,"down_votes":25,"body":"lel dont forget the karma relaunch that was one of the biggest peices of crap that riot ever did","replies":[{"poster":"Healurownbum","date":"2014-11-29T20:21:30.558+0000","up_votes":12,"down_votes":2,"body":"Even more so when you look at the reasons why they relaunched her. Her teams mates needed to know what her W did to make the best use out of it. Then they launched Thresh and now Kalista... Both have abilities that require teammates to know what they do.","replies":[{"poster":"RoyaiChaos","date":"2014-11-29T22:48:53.105+0000","up_votes":3,"down_votes":5,"body":"Not really, Thresh can still shield and it doesn't hurt Thresh if they don't lantern. And it's pretty obvious what to do with Kalista.","replies":[{"poster":"Healurownbum","date":"2014-11-30T00:20:55.028+0000","up_votes":13,"down_votes":0,"body":"But in that case her W still gave MS to the person she tethered to. And it was rather unclear to me when playing Janna suddenly being sucked up and then having to figure out what the hell to do next with kalista i had to read up on it. And thats what they wanted to avoid and why they remade Karma. Feels like double standards and it makes me distrust Riot even more.","replies":[]}]},{"poster":"Ariel the Cruel","date":"2014-11-30T01:49:41.669+0000","up_votes":8,"down_votes":0,"body":"Don't forget. They removed her passive because getting stronger at lower health was counter-intuitive.\nMeanwhile, {{champion:2}} , {{champion:23}} , and her W2.","replies":[]}]},{"poster":"Saianna","date":"2014-11-29T20:20:05.144+0000","up_votes":21,"down_votes":13,"body":"I might be in minority, but i enjoy new karma far more :)\nActually i like her alot!","replies":[{"poster":"Feathermane","date":"2014-11-30T00:13:32.289+0000","up_votes":7,"down_votes":7,"body":"Yep. Karma is their best rework effort, but this is somehow controversial.","replies":[{"poster":"Ariel the Cruel","date":"2014-11-30T01:39:13.219+0000","up_votes":16,"down_votes":4,"body":"The problem isn't that Skarma is a bad champ.\nIt's that to make her, they deleted Karma's lore, kit, visuals, personality, and pretty much everything but the name.\nThey then replaced it with a joke that had to get buffed/altered for **6 consecutive patches**.\nAnd they did this with **no community input.**\n\nIt took a 1k+ page  complaint thread just for them to put the fans into her classic skin's dance. :/\nA few thousand pages later. no response.","replies":[{"poster":"soulchaos","date":"2014-11-30T06:36:28.728+0000","up_votes":7,"down_votes":1,"body":"^ yes that was exactly my point \nthey should have just deleted her gave the new one a new name and refunded every ones IP","replies":[]},{"poster":"DreMLoK","date":"2014-11-30T21:21:46.921+0000","up_votes":3,"down_votes":0,"body":"> The problem isn't that Skarma is a bad champ.\n> It's that to make her, they deleted Karma's lore, kit, visuals, personality, and pretty much everything but the name.\n> They then replaced it with a joke that had to get buffed/altered for **6 consecutive patches**.\n> And they did this with **no community input.**\n> \n> It took a 1k+ page  complaint thread just for them to put the fans into her classic skin's dance. :/\n> A few thousand pages later. no response.\n\ngood thing is some pleople still have memory, +1","replies":[]}]},{"poster":"InsaneSamurai","date":"2014-11-30T18:09:47.315+0000","up_votes":4,"down_votes":0,"body":"Well, they turned Karma into an Oppressive Lane Bully, so...  :P","replies":[]}]},{"poster":"The Soulforged","date":"2014-11-30T21:16:24.833+0000","up_votes":7,"down_votes":0,"body":"> I might be in minority, but i enjoy new karma far more :)\n> Actually i like her alot!\n\nThe karma rework was like and unlike the cass rework. The karma rework started with them reworking her into a new champ and making her underpowered. They then buffed her consistantly until she was viable, but she was still not the same champion that old karma players loved. Cass is mostly the same, besides being nerfed and being forced to farm her passive early game. Right now, she is underpowered like the karma right after the rework, but her main kit is mostly unchanged. Still, she is viable atm, but it isn't the same champ. Imagine that cass got her entire kit reworked, but she was balanced. She wasn't at all the poison mage, but she was balanced. Imagine that being set in stone. That is what happened to karma and they changed her from a powerful lategame scaling support to a pokey mage with some utility. We don't want this rework to go along the same path as karma. We want cass to be the champ she once was while retaining her viability.","replies":[]},{"poster":"NeoScout","date":"2014-11-30T17:44:42.162+0000","up_votes":5,"down_votes":1,"body":"she's boring, ez q, leblanc's chain, generic shiled #41658456, old karma was more fun","replies":[]},{"poster":"kunkudunk","date":"2014-11-30T05:02:16.792+0000","up_votes":5,"down_votes":6,"body":"You aren't a minority. A few people a just upset because the only fun thing about old karma (giant shield bomb followed by giant heal from out of no where while at low health) is gone. Now her kit makes more sense and is easier to follow. Additionally, it has more than one useful situation. The only flaw to it that I see is that it can be rather bland, but I enjoy the kit. Tons of kiting.","replies":[{"poster":"soulchaos","date":"2014-11-30T06:38:16.466+0000","up_votes":4,"down_votes":1,"body":"ya bland boring and predictable. I still wish they would bring back the boom shield on another champ","replies":[]}]}]}]},{"poster":"ULTRAF0RCE","date":"2014-11-29T23:44:34.349+0000","up_votes":4,"down_votes":0,"body":"I would say she doesn't do nothing, but you are right she is not a lane bully, also personally I thought that the Sion rework was good, before the rework he was irritating to play against, and in my opinion more boring than he is now","replies":[{"poster":"Orangesilk","date":"2014-11-29T23:50:31.269+0000","up_votes":6,"down_votes":0,"body":"The Sion rework was great, he'll definitively never be a pro-pick, but he's interesting as it is, he needs a few number damage buffs so his skills actually feel satisfying for how telegraphed they are, but overall I like him.","replies":[{"poster":"kunkudunk","date":"2014-12-01T14:48:04.667+0000","up_votes":2,"down_votes":0,"body":"Agreed, Sion is pretty well off, but he lacks that consistency that pro teams go for.","replies":[]}]}]}]},{"poster":"Stez007","date":"2014-11-30T00:08:30.602+0000","up_votes":14,"down_votes":1,"body":"Cass is fucking worthless.\n\nTried playing her again today, was absolutely sickened. Couldn't duel a fucking Kassadin that was STUNNED then EXHAUSTED in lane. He out fucking DPSed me while standing in poison, while exhausted, after being stunend for 2 seconds and taking a full fucking rotation.\n\nYeah, she's a real fucking bully.","replies":[{"poster":"Orangesilk","date":"2014-11-30T00:21:44.812+0000","up_votes":3,"down_votes":0,"body":"She's supposed to somehow get herself in harms way by poisoning enemies with her short-ranged poison skills to get stacks, but she's also supposed to be weak enough to lose any duel that may happen from damaging her enemies because \"she's not supposed to be a lane bully\" this is where the rework falls apart, because interacting with the enemy is NOT something a hypercarry with a weak early game should be doing, yet that's the strange role she has been pigeonholed into. Imagine Nasus had to stack his stacks not by killing minions but by landing his syphoning strike on an enemy champion, we'd be looking at 20% winrate very soon.","replies":[{"poster":"Stez007","date":"2014-11-30T00:24:48.028+0000","up_votes":9,"down_votes":0,"body":"I want her winrate to tank to 0%. Maybe then Riot will wake the fuck up and realize this will NEVER, EVER work.","replies":[]},{"poster":"5G8Nri0B54","date":"2014-11-30T02:14:42.512+0000","up_votes":4,"down_votes":0,"body":"> She's supposed to somehow get herself in harms way by poisoning enemies with her short-ranged poison skills to get stacks\n\nThis is a huge problem in terms of thematics. Is this really the image you get when you think \"poison mage\"? I feel Stashu just plain doesn't understand this.","replies":[]}]}]},{"poster":"U4fyn2vZzW","date":"2014-11-29T21:50:54.733+0000","up_votes":3,"down_votes":1,"body":"Also, pretty much every single one of the champions i listed (With the except of maybe Heimer and definitely Ryze but Ryze's oppression is in the top lane) completely destroyed Cassiopeia in the mid lane. The difference is before she could put up some sort of fight against them now she's helpless .","replies":[{"poster":"Orangesilk","date":"2014-11-29T21:58:05.737+0000","up_votes":8,"down_votes":0,"body":"I'm pretty sure Poppy could destroy Cassiopeia if she went midlane, that's how bad this is","replies":[{"poster":"Serpents Embrace","date":"2014-11-29T22:00:23.598+0000","up_votes":6,"down_votes":0,"body":"If she didn't beat her in lane, she'd definitely beat her late game.","replies":[{"poster":"Kowe The Ewok","date":"2014-11-30T16:09:00.020+0000","up_votes":5,"down_votes":0,"body":"As somebody who regularly plays Poppy I can confirm this. Charge into her face and she Can only run. Get a single kill and the game is pretty much over. Cass has O comebackpotential and Poppy snowballs hard. Well, at this point having a Cass is 4  v5 anyway unless  your opponent is Bronze V.\n\nl mean even Stashu admitted that they're joking about how weak she is internally (\"CassiUPeia\")","replies":[]}]}]}]},{"poster":"Orangesilk","date":"2014-11-29T21:11:56.652+0000","up_votes":4,"down_votes":13,"body":"Welp, first of all, Azir is far from a lane bully, he's a poke champion who's weak to getting jumped on AND has very little kill potential, Ziggs is very noninteractive but he's far from a bully either, a bully is a guy who's not only harassing you, but he's constantly threatening to kill you if you do something wrong, like... the other guys in that list yeah.\n\nNow that we got that over with, yeah, I believe Riot hasn't seen there's a difference between lane bullying and early game functionality, a champion MUST be able to live through his early game SOMEHOW, no matter how weak and non threatening you want it to be. Even the weakest of the weakest laners like Poppy and Karthus have a means to survive their awful laning phases by playing very passively with a flask, farming under turret and so on, but not Cassio, because her awesome late game (which is why we picked her, we clearly didn't pick new cassio as a lane bully) is only achievable IF we somehow get this extremely weak champion, and make her shove the lane so she can kill poisoned minions, and make her bully her enemy, so it can remain poisoned and eating short range twin fangs.\n\nThere's a ways to solve this, don't balance her around her passive, balancing champions around the very best ridiculous scenario is poor design. Cassio achieving 400 stacks in a game where she was relevant is not the norm, it's probably a ridiculous event that happens only so often, so it should be very rewarding to get there. As it is, she's so weak she NEEDS to get there to be functional, it's not about rewarding you. If you make her late game be something truly ridiculous, truly broken, she will become a force to be reckoned with, much like Nasus is, think about Nasus, he's a weak laner who needs to stack stuff to be functional, but nobody balances around 500 stacks Nasus because that's not a thing that should be happening, instead you are supposed NOT to let him get there.\n\nThe same should go for Cassio, we shouldn't have to jump through hoops to get our power, the enemy should have to do something special to prevent us from getting powerful.","replies":[{"poster":"Serpents Embrace","date":"2014-11-29T22:22:47.478+0000","up_votes":1,"down_votes":1,"body":"Poke **is **what makes a lane bully. It's what gives them the threatening presence to keep you away from your farm because they can kill you if you mis-step.","replies":[{"poster":"Orangesilk","date":"2014-11-29T22:48:06.964+0000","up_votes":9,"down_votes":1,"body":"{{champion:122}} {{champion:92}} \n\nIt's all about the kill potential, regardless of poke.\n\n{{champion:101}} {{champion:161}} Are poke heavy champs, not considered lane bullies because their kill potential is honestly pretty low","replies":[]}]}]},{"poster":"2pudge1cup","date":"2014-12-01T00:23:44.135+0000","up_votes":7,"down_votes":0,"body":"Riot's only consistent balance philosophy is their inconsistency.","replies":[]},{"poster":"BeatzBoyFTW","date":"2014-11-29T22:38:55.688+0000","up_votes":1,"down_votes":9,"body":"Yea I'm sure they didn't nerf {{champion:268}} {{champion:134}} {{champion:115}} {{champion:101}} {{champion:13}}{{champion:238}} {{champion:7}} {{champion:74}} cause they don't happen to have a toxic damage-over-time spells.","replies":[{"poster":"OJ191","date":"2014-11-29T22:46:08.085+0000","up_votes":8,"down_votes":0,"body":"> Yea I'm sure they didn't nerf {{champion:268}} {{champion:134}} {{champion:115}} {{champion:101}} {{champion:13}}{{champion:238}} {{champion:7}} {{champion:74}} cause they don't happen to have a toxic damage-over-time spells.\n\nnot sure if serious or just being punny","replies":[]}]},{"poster":"Auryiel","date":"2014-11-30T20:38:01.086+0000","up_votes":5,"down_votes":0,"body":"{{champion:236}}","replies":[]},{"poster":"BastionKross","date":"2014-11-30T17:41:47.445+0000","up_votes":5,"down_votes":0,"body":"Technically if the point of the rework was to stop her from being a lane bully, they succeeded. Snake lady will never bully anyone in lane, or before 40 minutes, ever again as she is now.","replies":[]},{"poster":"Giovarco","date":"2014-11-30T10:48:25.864+0000","up_votes":1,"down_votes":0,"body":"Your forgot {{champion:6}} .","replies":[{"poster":"Saevum","date":"2014-11-30T15:48:47.302+0000","up_votes":5,"down_votes":0,"body":"> Your forgot {{champion:6}} .\n\nYea, he Furgot him.","replies":[]}]},{"poster":"SmokingPuffin","date":"2014-11-30T16:14:10.844+0000","up_votes":1,"down_votes":8,"body":"Cassiopeia's rework had an interesting direction, but so far it's been poor execution.  Feels like new designer is new.\n\nCassiopeia was crazy obnoxious laning.  They nerfed her so hard that she was pointless in teamfights and her laning was still strong.  Basically they had no levers in the old kit to make her feel at all coherent in terms of power curve.\n\nAs to your list of lane bullies, I really think you picked bad examples.  They nerfed LeBlanc's laning into the ground.  Talon's too, and for the same reasons.  Azir is a recent overbuff.  Very difficult to lane against.  Will be fixed.  The rest of your list doesn't strike me as even particularly good laners.  Syndra is the closest but she's super vulnerable to ganks and mobile champs can outplay her hard.","replies":[{"poster":"U4fyn2vZzW","date":"2014-11-30T16:16:45.029+0000","up_votes":7,"down_votes":0,"body":"Cassiopeia was also super vulnerable to ganks infact she was easier to gank because her only defense was her ult while Syndra has a slow, knockback, and stun.\n\nIf Cassiopeia was anywhere near as oppressive as Syndra is in lane right now she would be seeing play in LCS not Syndra. ","replies":[]},{"poster":"Serpents Embrace","date":"2014-12-01T00:51:32.756+0000","up_votes":2,"down_votes":0,"body":"\"Interesting\" is not a word that applies to the direction focusing solely on the only targeted spell in a champion's kit. The stacking passive, while antithetical to a poison mage's core identity, also only \"gave back\" power that was sapped from the spell's basic cooldowns and AP ratios.\n\n\"Interesting\" is something that makes you want to work with it and see the limits it has. The Cass rework just gave you smaller limits and told you exactly what hoops it would let you jump through to reach them.","replies":[{"poster":"SmokingPuffin","date":"2014-12-01T06:01:37.548+0000","up_votes":1,"down_votes":1,"body":"> \"Interesting\" is not a word that applies to the direction focusing solely on the only targeted spell in a champion's kit. The stacking passive, while antithetical to a poison mage's core identity, also only \"gave back\" power that was sapped from the spell's basic cooldowns and AP ratios.\n\nTo be clear, the interesting direction I see with new Cass is being a mage answer to the ADC.  Someone that scales up to be so big in the late game, with so much sustained damage, that you can build your team comp around letting them win the game for you.  We don't have any AP champions that can compete with ADCs for that late game sustained damage role, and new Cass could do that, at least in theory.\n\nI don't see how a stacking passive is antithetical to a poison mage's core identity.  I do see how the power level with the passive, but more importantly the QW nerfs, makes everything about new Cass feel bad.  Mainly I think the problem with new Cass is that she's weak.","replies":[{"poster":"Serpents Embrace","date":"2014-12-01T07:01:10.748+0000","up_votes":2,"down_votes":1,"body":"So you think it's \"interesting\" to take a champion's ability and make it in to a conditionally worse auto-attack?\n\nA poison mage is about debilitation, not buffing themselves with stacking power. If you think numbers nerfs are the only reason the rework \"feels bad\" then you're going to continue to be disappointed with it because number buffs will never fix it.","replies":[{"poster":"SmokingPuffin","date":"2014-12-01T07:31:56.933+0000","up_votes":2,"down_votes":3,"body":"> So you think it's \"interesting\" to take a champion's ability and make it in to a conditionally worse auto-attack?\n\ni wouldn't say that, but I would say that {{champion:30}} is a good example of an AP champion with an ability that replaces auto-attacking and is interesting.  I think it could be interesting on Cassiopeia as well.\n \n> A poison mage is about debilitation, not buffing themselves with stacking power. If you think numbers nerfs are the only reason the rework \"feels bad\" then you're going to continue to be disappointed with it because number buffs will never fix it.\n\nI don't think she was ever about debilitating her enemies via poison.  Her old kit had barely anything in that direction,  Also, debilitating effects don't read well in League unless they're over the top strong like say Exhaust.\n\nIt's easy for me to see why Riot didn't choose the poison mage design direction.  That doesn't mean I think the design direction they chose has worked out, but I think there is a chance it could if the execution were better.\n\nPersonally, when I see Cassiopeia, I am thinking more gorgon than I am thinking poisoner.  My main interest with her was preserving her ult, which I see as very thematic and cool.","replies":[{"poster":"5G8Nri0B54","date":"2014-12-01T21:00:26.310+0000","up_votes":2,"down_votes":0,"body":"Her R is literally the sole thing that connects her with gorgons. \n\nA gorgon champion could be cool, but it's obviously not Cassiopeia if all she has is a single high CD R. \n\nFor her Poison Mage aspect, she has two abilities and several recorded lines alluding to her Poison.\n\n\n\nAnd absolutely zero lines or thematic link to being AP Rambo that Stashu is so focused with making her into.","replies":[]}]}]},{"poster":"5G8Nri0B54","date":"2014-12-01T20:58:20.242+0000","up_votes":1,"down_votes":0,"body":"1. \n> To be clear, the interesting direction I see with new Cass is being a mage answer to the ADC. Someone that scales up to be so big in the late game, with so much sustained damage, that you can build your team comp around letting them win the game for you\n\n{{champion:268}}  {{champion:30}} \n\nJust try to ignore the fact that Azir is still unplayably buggy even now.\n\n\n2.  \n> We don't have any AP champions that can compete with ADCs for that late game sustained damage role, and new Cass could do that, at least in theory.\n\nNobody is denying Riot is trying to take this direction with her. But the cause of this rework, among hundreds of other reasons, is that **THIS IMAGE IS CONTRARY TO WHAT CASSIOPEIA IS SUPPOSED TO BE**. I've made like 10 other posts explaining exactly why this is the case already.\n\n\n3.\n> I don't see how a stacking passive is antithetical to a poison mage's core identity. I do see how the power level with the passive\n\nMany of us agree with you here actually. A stacking Passive can work...if it was the **OTHER WAY AROUND**\n\nThere is something stupidly wrong when you have a Poison Mage spending more time enhancing herself with more power than she is weakening and softening her foes.\n\n\n**The problem is exacerbated that her \"power gathering\" is done through POISONING HER ENEMIES**","replies":[{"poster":"SmokingPuffin","date":"2014-12-01T21:10:54.530+0000","up_votes":1,"down_votes":3,"body":"> Just try to ignore the fact that Azir is still unplayably buggy even now.\n\nI find Azir to be super strong early game now, and I feel that he falls off pretty hard.  Definitely not a hypercarry.  Very different power curve than Cass.\n\nI don't think Karthus can win games for you anymore.  Not with the way League works today.  Very easy to pop him and use one of your 18 dashes to get out of the defile.\n\nTo give you an idea of how far I'd push this, I think new Cass's kit could eventually be the first mage that can go duo bot in serious competitive games.  Given a similar power curve as a marksman and her need for protection due to immobility and squishiness, it feels like we could make her a viable duo lane carry.\n\nDoes this sound interesting to you?  Does to me, anyway.  I really like the idea of breaking the strangehold ADCs have on the duo lane.\n\n> Nobody is denying Riot is trying to take this direction with her. But the cause of this rework, among hundreds of other reasons, is that **THIS IMAGE IS CONTRARY TO WHAT CASSIOPEIA IS SUPPOSED TO BE**. I've made like 10 other posts explaining exactly why this is the case already.\n\nThe fundamental problem Riot has is that old Cassiopeia didn't have a clear focus.  The people that are unhappy now wanted her to focus on being a poison mage.  As I've mentioned, what I want is for Cassiopeia to focus on being a gorgon, so I'm pretty comfortable with shifting power into E (although I wouldn't mind E being less powerful and Q being more powerful, either).\n\nI think it's a very hard design problem to rework Cass.  Comparable to reworking Karma, actually.  I'm inclined to give Stashu as much support and constructive feedback as we can from out here, even though I know lots of people are going to inevitably be unhappy with the outcome.\n\n> Many of us agree with you here actually. A stacking Passive can work...if it was the **OTHER WAY AROUND**\n> \n> There is something stupidly wrong when you have a Poison Mage spending more time enhancing herself with more power than she is weakening and softening her foes.\n> \n> **The problem is exacerbated that her \"power gathering\" is done through POISONING HER ENEMIES**\n\nI am certainly interested in discussing changes to her passive that feel better.  Current passive works mechanically -- it's how Stashu is trying to gate all that power away from the lane phase.  The problem is that it has bad feels; it would feel more natural on a drainy mage like Malzahar or Swain.\n\nI think Stashu would be quite receptive to proposed changes here, so long as you respect the need to use the passive to shift power into the later game with her kit.","replies":[{"poster":"5G8Nri0B54","date":"2014-12-01T22:57:22.371+0000","up_votes":3,"down_votes":1,"body":"> I find Azir to be super strong early game now, and I feel that he falls off pretty hard. Definitely not a hypercarry. Very different power curve than Cass.\n> \n> I don't think Karthus can win games for you anymore. Not with the way League works today. Very easy to pop him and use one of your 18 dashes to get out of the defile.\n\nThese are all symptoms of poor balance on Riot's part. Those can be solved *relatively* easily. Azir was stated to being intended to be weak early and powerful late game, and it's easy to see that reflected in his play-style. They did smooth out his curve by nerfing his late game and buffing his early though. But with his minion mechanic, it's really hard to not make his late game monstrously powerful in terms of DPS (not so much at picking kills though)\n\n> To give you an idea of how far I'd push this, I think new Cass's kit could eventually be the first mage that can go duo bot in serious competitive games. Given a similar power curve as a marksman and her need for protection due to immobility and squishiness, it feels like we could make her a viable duo lane carry.\n> \n> Does this sound interesting to you? Does to me, anyway. I really like the idea of breaking the strangehold ADCs have on the duo lane.\n\nThere's two things to point out here. Firstly, an AP+Support bot's already kind of a thing. Only issue here is that it's not been adopted by the majority who are still stuck in their rigid team compositions yet. Hell, sometimes you're even seeing an ADC solo-ing top lane. Sometimes you have a bruiser being supported, other times an AP.\n\nAnd no, atleast not for CASSIOPEIA, I don't find that idea all that interesting on her. She really really doesn't fit the image of a hyper-scaling magical marksmen. If Stashu wanted that, he could have made a champion from the ground up to fit that image rather than aggravating fans who wanted Cassiopeia to fit her own image.\n\n\n> The fundamental problem Riot has is that old Cassiopeia didn't have a clear focus. The people that are unhappy now wanted her to focus on being a poison mage. As I've mentioned, what I want is for Cassiopeia to focus on being a gorgon, so I'm pretty comfortable with shifting power into E (although I wouldn't mind E being less powerful and Q being more powerful, either).\n> \n> I think it's a very hard design problem to rework Cass. Comparable to reworking Karma, actually. I'm inclined to give Stashu as much support and constructive feedback as we can from out here, even though I know lots of people are going to inevitably be unhappy with the outcome.\n\nHere's a glaringly obvious problem to Stashu and his approach to reworking.\n\nNearly all major reworks (Sion, Karma, Skarner, Viktor, etc.) have had developers gather feedbacks from the fanbase. Even future reworks such as Taric and Poppy have threads dedicated to them asking the fanbase WHAT THEY SEE the champion as and WHAT THEY WANT him/her to be. **Taric has 3 threads!** And even THOSE have been hit or miss! But at the very least there is communication going on.\n\nIn contrast, Stashu is only starting to talk about his rework AFTER the fact that he has all this crap done. He is only around AFTER he developed his fixation over this mano-a-mano brawler image. All this \"communication\" is only happening AFTER all he wasted all that time and resource to rework her into this obviously broken rework.\n\n\nAsides from that, they didn't do an awfully great job explaining why she lacked focus, and that's partly because they keep coming up with new reasons why they wanted her reworked (*\"oh she's a lane bully! oh she was due for a rework! oh the Shurima even dictated she needed a rework!\"*). In this case, what is their exact claim that they thought she lacked focus? And what was their rationale in focusing on her most hated ability?\n\n>  it's how Stashu is trying to gate all that power away from the lane phase\n\nWhich is really really stupid considering other hyper-carries happen to have pretty strong laning phase. Not Vayne who is legitimately weak. But look at Ryze who is a lane-bully now. Or Tristana with her powerful nukes. Or Kog'maw for the same reason (yet mechanically different) as Tristana. All of them also happen to have tools to keep themselves alive during their weakest phase too.\n\n\nHow receptive he is of feedback really depends on the end-product. But as of right now it's been questionable since the problems she's had since the beginning of the rework have still been present even in the current rework. And now people are beginning to grow impatient with each new update failing to address many of her problems.\n---------\n>  Current passive works mechanically -- it's how Stashu is trying to gate all that power away from the lane phase.\n\nDesign-wise, it's stupid if the entire intention was to prevent the champion from being a lane-bully, which is 100% the reason why he did it to Cassiopeia.\n\nBut pretend that he didn't do it as a knee-jerk reaction to the fact that Cassiopeia can do what dozens other champions have been doing for a long time.\n\n\nThematically it's the opposite of what Cassiopeia should be. Xerath, Syndra, Kog'maw, or even Kha'zix, those are all champions such a Passive would have fit thematically with. Not a Poison Mage. Not a champion who have nothing to do with growing or evolving as part of their thematic structure.","replies":[]}]}]}]}]}]},{"poster":"WooBeeWoo","date":"2014-12-01T00:21:58.354+0000","up_votes":4,"down_votes":0,"body":"> **Riot makes Activision and Electronic Arts look like they know what they're doing, and that's fucking saying something. **\n\n^ This lol so good.","replies":[]},{"poster":"Fisk","date":"2014-11-30T18:11:39.074+0000","up_votes":4,"down_votes":0,"body":"That part about EA was toooo farrrr...... I still have nightmares about EA customer service","replies":[]},{"poster":"Hex the FenFen","date":"2014-11-29T19:12:30.072+0000","up_votes":8,"down_votes":4,"body":"Azir is such a pain in the butt...they were scared about {{champion:143}}  being too safe, he is even more safe than she is AND he has an escape....come on Rito, if Azir is allowed safety and escapes how about re-buffing my loving mid laner zyra","replies":[]}]}