{"poster":"U4fyn2vZzW","date":"2015-04-06T21:06:40.579+0000","title":"When you have all your CDS up as Malzahar and an enemy \"bruiser\" or \"tank\" attempts to duel you","subforum":"Gameplay","up_votes":13,"down_votes":1,"body":"http://i.imgur.com/ecdno8v.gif","replies":[{"poster":"aaronautumn","date":"2015-04-06T21:12:30.918+0000","up_votes":6,"down_votes":1,"body":"when did they turn shrek into a live action movie?","replies":[{"poster":"IcyPepper","date":"2015-04-06T21:15:55.186+0000","up_votes":3,"down_votes":0,"body":"after Chris Handsome auditioned, of course.","replies":[{"poster":"Davids Uploader","date":"2015-04-06T22:49:46.319+0000","up_votes":4,"down_votes":0,"body":"BOOTY WARRIOR","replies":[]}]}]},{"poster":"LilxPaprika","date":"2015-04-06T21:20:11.957+0000","up_votes":1,"down_votes":7,"body":"Unless said bruiser is hybrid tryndamere with zhonias and twin shadows with devourer with skirmisher smite. \nStarts by Smiting you so you do less damage he has mercs on too so your ult doesn't last long. Then pop his q heal max health. Then if he's low pops zhonias. Assuming you stay to fight, he then pops ult proceeds to auto stack you sensessly can chase you with trinity force/twinshadows/ghost glade. \n\nThen q is back up again and heals for half his HP cause he's got so much ap. And with 50+ devourer stack that's if you don't get 100 to 0 in a couple of hits. \n\n\nK I'm done. Sowwy went a bit over the top there. \nIf you'd like to learn more try the build I'll post a guide.","replies":[{"poster":"aaronautumn","date":"2015-04-06T21:27:34.411+0000","up_votes":6,"down_votes":0,"body":"tenacity doesn't reduce the duration of suppresses.","replies":[{"poster":"U4fyn2vZzW","date":"2015-04-06T21:33:31.154+0000","up_votes":1,"down_votes":0,"body":"^.","replies":[{"poster":"aaronautumn","date":"2015-04-06T21:36:04.690+0000","up_votes":3,"down_votes":0,"body":"^.^","replies":[{"poster":"LilxPaprika","date":"2015-04-06T22:06:27.654+0000","up_votes":1,"down_votes":0,"body":"Yikes... And he'll probably have ignite/morellonomicon. But at least I won't die to him.","replies":[]}]}]}]},{"poster":"usul1202","date":"2015-04-06T22:40:07.479+0000","up_votes":1,"down_votes":1,"body":"Malz delays his combo by 4 seconds. lets him get a Q and an E off on you first and lowers your health a bit, then ults. From weakened your dead, and gl popping any defensives like that zhonyas (useless armor) and your ult while supressed.","replies":[{"poster":"LilxPaprika","date":"2015-04-06T23:39:56.677+0000","up_votes":2,"down_votes":0,"body":"(Active): Tryndamere instantly receives fury and becomes immune to death for 5 seconds during which his health cannot go below 1 health. This move is usable even when stunned, silenced or suppressed. This ability has 0.5 seconds delay before activating.","replies":[{"poster":"usul1202","date":"2015-04-06T23:43:53.957+0000","up_votes":1,"down_votes":0,"body":"Huh. That's a bit counter intuitive, considering the definition of suppressed. that being said. an ignite at the end + another E (which would be off CD. will last through the end and suppress the heal enough to kill, me thinks.","replies":[]}]}]},{"poster":"junglerboy16","date":"2015-04-07T00:17:38.229+0000","up_votes":4,"down_votes":0,"body":"Suppression can't be shortened at all (mercs are 100% useless). Trynd's only hope is that he can hit his ult before he's dead. Trynd would have a better time than most \"bruisers\". Malz always builds relatively tanky (unless he's a moron and has never played him before) because of his low mobility, and still has ludicrous burst. Ignite counter's Trynd's heal (cuz all CDs are up).\n\nWhether or not Tryn can smite you is a game of chance because it is just as likely that Malz silences before he is in range to smite and then ults while silenced. Tryn would not survive Malz's initial combo without popping his ult, meaning several seconds of his invulnerability are spent while he is helpless. Drop ignite on his face and zhonya's or no Zhonya's he won't have any chance to fight back because his heal will get halved and Malz also has voidlings, along with 2 major DoTs (which inherently counter Tryndamere's ult).\n\nTryndamere would be able to handle the initial Q>E>R+ignite combo and come out alive, but he would have zero chance of actually fighting back against a Malz with all abilities up.","replies":[]},{"poster":"Rinky Dinky","date":"2015-04-06T23:52:01.290+0000","up_votes":1,"down_votes":0,"body":"Implying Tryndamere is a bruiser or fighter","replies":[]}]},{"poster":"FalconPawwwwnch","date":"2015-04-06T21:42:09.945+0000","up_votes":2,"down_votes":4,"body":"And then they get QSS\n\nInb4 hurr I said bruiser/tank\n\nAnd that doesn't change my statement's accuracy either","replies":[{"poster":"Leti the Yeti","date":"2015-04-06T21:50:33.194+0000","up_votes":6,"down_votes":1,"body":"saw khazix the other day build zhonyas cuz karthus was kicking everone's ass\nthe sacrifices people make lmao!","replies":[{"poster":"PerishSoftly","date":"2015-04-07T06:50:58.721+0000","up_votes":1,"down_votes":0,"body":"That's actually 0 sacrifice for Kha in terms of \"wasted stats\". Sure his AD is lower, but he gets 50% of his AP added to both his passive proc damage and his Void Spikes heal. In that case, that's 60 more health, and up to 180/240 extra damage in a full rotation outside of brush.","replies":[]}]}]},{"poster":"CursedByLight","date":"2015-04-07T07:32:48.316+0000","up_votes":1,"down_votes":0,"body":"That split second where the tank/dueler cc's you and your ult is wasted.\n\nOr specifically...\n\n#{{champion:92}} THIS LADY WHO CAN KEEP DOING HER Q AS SHE'S SILENCED.","replies":[{"poster":"acepil0t","date":"2015-04-08T02:36:44.474+0000","up_votes":1,"down_votes":0,"body":"What?","replies":[]}]},{"poster":"Sooko","date":"2015-04-06T23:05:54.179+0000","up_votes":1,"down_votes":0,"body":"In low ELO, it doesn't have to be a bruiser or tank. Malzahar 1v1s anybody. I've even managed to wreck a Tryndamere 1v1 thanks to Zhonya's.","replies":[]},{"poster":"Vicarious117","date":"2015-04-06T22:52:07.189+0000","up_votes":1,"down_votes":3,"body":"I cannot tell you how many times as bruiser rengar I've jumped a malz and ripped them apart just to have them let off their entire combo on me...... then I hit them one more time once it's done and walk away happy about my choice! lol","replies":[]}]}