{"poster":"Vahlahmar","date":"2016-07-19T19:01:30.095+0000","title":"Gyakorlashoz keresek jatekosokat EUNE","up_votes":6,"down_votes":0,"body":"Sziasztok!\r\n\r\nGyakorlashoz (nem ranked) keresnek jatekosokat. Farmolas rendes jatekos ellen, akkor is ha counter a velem szemben levo, es hasonlo variaciokra gondoltam.\r\n\r\nAmit szeretnek, hogy egy egy kozos jatek utan beszeljuk at, hogy kinek mi a velemenye a masik jatekarol, miben lehetne jobb, vagy mit tanulhatnank/gyakorolhatnank meg.\r\n\r\nAmi jo lenne:\r\n\r\n- Ha tudnal &quot;tanitani&quot; vagy megmondani, hogy miben kellen meg fejlodjek.\r\n- Nyugodt, turelmes jatekos vagy.\r\n- Ha tudnal angolul. Ha nem vagyunk egy teljes csapat, akkor azert jo ha nem egyedul irogatok a tobbi jatekosnak.\r\n\r\nRolam:\r\n\r\n- Egy ideje jatszok mar, igy nagyjabol tudom a dorgest (100+ champ), de egyedul nem tudok kijutni Silverbol, igy biztos tudnek mit tanulni.\r\n- Jol beszelek angolul\r\n- Programozo vagyok es edzesekre is jarok, igy nem vagyok allandoan online\r\n\r\nign: Valhahmar","replies":[{"poster":"kalamona90","date":"2016-07-20T06:53:02.619+0000","title":null,"up_votes":2,"down_votes":0,"body":"szia én segítenék de jelenleg én is gyakorolni szeretnék. Kezdő vagyok (27szint) Én úgy gyakorlok hogy gép ellen 1v1 ben lehetőleg valami karakteremnek nehéz ellenfél ellen. Elég sokat segített.  Nem tudom milyen karakterekkel játszol de a \"nagyok\" azt mondják válasz ki 3 karaktert és csak azokkal nyomasd semmi mással előbb utóbb meglesz az eredmény.","replies":[{"poster":"Galvin Flintmage","date":"2016-07-20T08:48:22.395+0000","title":null,"up_votes":2,"down_votes":0,"body":"*Minden rolen (minimum) 3 karakterrel. (Most a draft pick miatt elég csak 2 role-t választani, ezért elég lehet 6 champ.)","replies":[{"poster":"Vahlahmar","date":"2016-07-20T17:55:51.260+0000","title":null,"up_votes":1,"down_votes":0,"body":"Igyekszem, de amikor top-ra megyek es valaki countert hoz ellem, akkor kemenyen deny-olva vagyok. Szoval nem igazan tudok farmolni, de valoszinuleg gyakorlassal tudnek rajta javitani.","replies":[]}]},{"poster":"Vahlahmar","date":"2016-07-20T17:54:50.850+0000","title":null,"up_votes":1,"down_votes":0,"body":"Hali!\n\nJatszhatunk egyutt nem ranked pvp-t. Neked nehezebb lesz az elejen, de jobban lehet fejlodni. ;)","replies":[]}]},{"poster":"asd0123","date":"2016-08-30T08:59:50.221+0000","title":null,"up_votes":1,"down_votes":0,"body":"Szia! Érdekesen hangzik de én gyakorlásnak inkább aramot mennék nagyon sokat pls:300 win ami nekem van és addigra kb. meglesz az összes champpel akkora tudásod hogy kijuss silverből.Nekem három karakterem van jelenleg és amin most írok az egy silveres kari és ismerősöm használja nekem egy gold IV-es\naccountom van és azzal játszom.\nElőre is sok szerencsét a silverből kijutáshoz! :){{summoner:13}}","replies":[]},{"poster":"Vahlahmar","date":"2016-07-20T17:50:30.359+0000","title":null,"up_votes":1,"down_votes":0,"body":"Leginkabb jungle-t es adc-t jatszok. Adc-kent a farmolas megyeget. Nem megy rosszul, de azert van meg mit gyakorolni.\n\nJungle-kent foleg tankosabb (Seju, Zac) karaktert hozok, amivel sok a CC-m, de kevesebb a sebzesem. Jungler-kent szerintem jobb vagyok, de ha a lane-ek veszitenek, akkor kevesbe tudok hatekony lenni. Ezert kene a p2p gyakorlas. Botok nem jelentenek mar kihivast.\n\nSzerintem az nagy segitseg, ha valaki ellenem jatszik, es utana meg tudja mondani, hogy szerinte mit latott rossznak.","replies":[]},{"poster":"Temp65432","date":"2016-07-20T10:07:28.198+0000","title":null,"up_votes":1,"down_votes":0,"body":"^\n","replies":[]}]}