{"poster":"West Coast","date":"2016-05-08T09:53:13.538+0000","title":"Dinamic Queue, la pesadilla para los que jugamos (Jugabamos) solo Q","subforum":"Charlas Generales","up_votes":73,"down_votes":3,"body":"Imposible para un jugador &quot;malo&quot; &quot;low elo&quot; como yo jugar Ranked solo como antes, antes pod&iacute;as jugar solo Q tranquilo porque sab&iacute;as que como mucho encontrabas un duo, ahora me pasa que tengo una premade de 4 que juegan la ranked como si fuera una normal, Y OJO CON DECIRLES ALGO EH porque empiezan con &quot;gg 4 reports&quot; &quot;isi ban, 4 reports&quot; &quot;gg salite o te trolleamos, no nos gusta tu pick&quot; , &eacute;tc. \r\n\r\n&bull; El otro team va a tryhardear a muerte, van a invadir, van a aplicar todo , pero tu team no, tu top en vez de cubrirte el blue va a ir a quedarse afk en torre, lo mismo que el mid y los de bot, open invade para el otro team.\r\n\r\n&bull; Ni hablar para los que jugamos adc , te toca &quot;el amigo malo&quot; , osea ese que mandan a supportear como si el supp tuviera que ser &quot;malo&quot; cuando es al contrario, muchos de los mejores jugadores tienden a supportear por tener mucho conocimiento del juego, a lo que voy es que te supportean sin ganas, te trollean la linea, y as&iacute; ya no se puede.\r\n\r\n&bull; &quot;Eloboost Legal&quot; , dicho y hecho, muchos dec&iacute;an que &eacute;sto iba a pasar y as&iacute; est&aacute; pasando... Jugadores impresionantemente malos est&aacute;n en Platino &oacute; m&aacute;s arriba, cuando tienen el nivel de un plata 5 como DEMASIADO (Lo veo, tengo &quot;conocidos&quot; en platino y casi diamante porque hacen premade con gente que los carrea y listo) . Ahora me van a decir &quot;Si es tan facil conseguite una premade y sub&iacute;&quot; Pero no , no es mi mentalidad, yo quiero subir a Oro jugando con 1 amigo como mucho, como para decir &quot;Bueno, tan malo no soy&quot; , no le veo m&eacute;rito a dejarme carrear por alg&uacute;n smurf &oacute; tener 1 &oacute; 2 amigos que me carreen todos los games, no le veo ning&uacute;n sentido de deportividad a eso, es como jugar un partido de f&uacute;tbol y quedarme todo el partido sin correr, sin hacer nada, mandandome c*gadas mientras mi equipo defiende y mete goles, para que despu&eacute;s yo diga &quot;que bueno que soy, 15 partidos invicto, que crack&quot; , repito que lo veo injusto... Despu&eacute;s ese &quot;crack&quot; lo haces jugar SoloQ y no te gana 2 games seguidos porque no sabe jugar sin los que lo carreen.\r\n\r\nLo que me queda es seguir en la b&uacute;squeda de ese main supp que me ayude y podamos triunfar como el d&uacute;o legendario supremo que venci&oacute; a las dinamic (?????) &oacute; seguir practicando practicando y practicando x2000 adem&aacute;s de tener que soportar a las premades, espero Riot escuche a su comunidad de una vez y saque &eacute;ste sistema (No soy solo yo el que se queja, miren el foro de Europa, el de NA, son posts y posts con m&aacute;s de 300 upvotes pidiendo que saquen &eacute;ste sistema) . \r\n\r\nEn fin, es un post QQ? Si, obviamente es QQ, porque se perdi&oacute; esa magia del solo Q, ahora es premades vs premades y si bien es divertido siento que ya no tiene gracia el rankear, porque se valora m&aacute;s el juego en equipo que la calidad individual, no digo que est&eacute; mal pero ahora ya es otro tema... En fin, gracias por leer.","replies":[{"poster":"Ode to dark","date":"2016-05-08T14:27:28.511+0000","up_votes":5,"down_votes":0,"body":"Sin duda rito hace cada vez más esfuerzos por cagarnos la experiencia de juego a quienes jugamos solos :/","replies":[]},{"poster":"Jonshi","date":"2016-05-08T13:47:06.229+0000","up_votes":5,"down_votes":3,"body":"Es re jodido cuando te tocan asi, pero tambien pensa en que, de una u otra forma, tenes que tratar de ganarla. \nExperiencia mia: jugue soloq, salimos bien, me agregaron porque jugue \"bien\" (como soporte, tengo mucho que desear, pero bue. Estoy en bronce 3, tampoco pedir tanto), jugamos unas premades hasta que llegamos a ser 4, y la ganamos. Esta en el historial, por si queres corroborar.\n\nQuiero llegar a un punto: Las premades sirven para reemplazar el team ranked, pero por lo general son emparejados contra otros que estan en premade. Si te cae justo un premade de 4, mejor no decirles nada, mantenerte jugando a la par de ellos, ya que son los otros de tu equipo, y ante cualquier insulto ignorarlo, mutearlo y listo. Si demostras que jugas bien, ellos puede que no te molesten, y si encima haces enojar al equipo enemigo, la ganas de una. \n\nY un consejo para subir: hace enojar al equipo enemigo. Si sacan una ventaja sobre un jugador y el otro team pone \"gg report (x linea)\", empeza a jugar con sus mentes, con cosas tipo \"debe ser alto troll ese flaco\". Hace que se centren en el chat y no jueguen. Eso hice mientras jugaba con Karma en ranked: teniamos un afk, pero el mid y el jg estaban flammeandose, por lo que me meti y empece a molestarlos. Al final, terminamos con la partida ganada pero por poco, ya que volvio el afk y, si bien flaqueamos un poco, la ganamos porque el resto estaba insultando. Espero que te sirva :)","replies":[{"poster":"Omba el guerreo ","date":"2016-05-08T18:05:49.303+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Jonshi,realm=LAS,application-id=v7qsfXsE,discussion-id=dqEpYHZA,comment-id=0005,timestamp=2016-05-08T13:47:06.229+0000)\n>\n> Es re jodido cuando te tocan asi, pero tambien pensa en que, de una u otra forma, tenes que tratar de ganarla. \n> Experiencia mia: jugue soloq, salimos bien, me agregaron porque jugue &quot;bien&quot; (como soporte, tengo mucho que desear, pero bue. Estoy en bronce 3, tampoco pedir tanto), jugamos unas premades hasta que llegamos a ser 4, y la ganamos. Esta en el historial, por si queres corroborar.\n> \n> Quiero llegar a un punto: Las premades sirven para reemplazar el team ranked, pero por lo general son emparejados contra otros que estan en premade. Si te cae justo un premade de 4, mejor no decirles nada, mantenerte jugando a la par de ellos, ya que son los otros de tu equipo, y ante cualquier insulto ignorarlo, mutearlo y listo. Si demostras que jugas bien, ellos puede que no te molesten, y si encima haces enojar al equipo enemigo, la ganas de una. \n> \n> Y un consejo para subir: hace enojar al equipo enemigo. Si sacan una ventaja sobre un jugador y el otro team pone &quot;gg report (x linea)&quot;, empeza a jugar con sus mentes, con cosas tipo &quot;debe ser alto troll ese flaco&quot;. Hace que se centren en el chat y no jueguen. Eso hice mientras jugaba con Karma en ranked: teniamos un afk, pero el mid y el jg estaban flammeandose, por lo que me meti y empece a molestarlos. Al final, terminamos con la partida ganada pero por poco, ya que volvio el afk y, si bien flaqueamos un poco, la ganamos porque el resto estaba insultando. Espero que te sirva :)\n\nSos macabro loco, como vas a jugar con sus mentes asi jajaj, muy mal lo tuyo, tal ves le arruinaste la partida a alguien{{sticker:zombie-nunu-tears}}  lo peor es q la estrategia es buena","replies":[]},{"poster":"Ode to dark","date":"2016-05-09T02:06:04.436+0000","up_votes":2,"down_votes":0,"body":"Señor, usted es toda una mente diabólica. Lo aplaudo.\n\nhttp://imgur.com/jFXvQQf","replies":[]},{"poster":"Zaikro","date":"2016-05-09T14:58:45.220+0000","up_votes":1,"down_votes":0,"body":"Yo habia comentado lo mismo, de hacerlos flamear o cosas como esas y me cagaron a negativos xd","replies":[]},{"poster":"ClosDifficile","date":"2016-05-09T03:33:00.121+0000","up_votes":1,"down_votes":0,"body":"Me parece bastante tóxica tu forma de subir.","replies":[]},{"poster":"tomasxdlol741","date":"2016-05-08T22:55:00.708+0000","up_votes":1,"down_votes":0,"body":"Jajaja la estrategia de jugar con sus mentes es diabolica,pero buena {{sticker:slayer-jinx-wink}}","replies":[]}]},{"poster":"Wizard","date":"2016-05-09T06:12:24.551+0000","up_votes":2,"down_votes":0,"body":"Mi experiencia es una mierda  en dynamicQ , sabes lo feo que es que te emparejen con 4 random vs 5 challenger premades? lpm ya me viene pasando varias veces y muchos de esos premades son pro , por ej : hoy me toco 2 partidas seguidas contra todo el equipo de rbt y yo con 4 random , lo peor es que me toca gente de ligas inferiores a ellos (diamantes 3-2) =/. Bueno solo quería expresar la mierda que me parece el dynamicQ.\nSaludos y que tengan un buen día.\n{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Selah","date":"2016-05-09T22:58:44.904+0000","up_votes":1,"down_votes":0,"body":"DinamycQ*","replies":[{"poster":"Wizard","date":"2016-05-10T02:18:23.691+0000","up_votes":1,"down_votes":0,"body":"Si, puse soloQ por costumbre xD.","replies":[]}]}]},{"poster":"Johndye","date":"2016-05-08T22:52:29.118+0000","up_votes":2,"down_votes":0,"body":"Este fue el peor error de Riot de la temporada :/ No por nada eliminaron este problematico sistema en las clasificatorias (Hero League) de Heroes of the Storm","replies":[]},{"poster":"iNGENiO","date":"2016-05-08T19:18:12.415+0000","up_votes":2,"down_votes":0,"body":"La cruel Verdad.","replies":[]},{"poster":"KShyGuy","date":"2016-05-08T13:45:42.712+0000","up_votes":2,"down_votes":0,"body":"Encontrar un main supp si que es dificil xD","replies":[{"poster":"JuliánD40","date":"2016-05-09T10:06:52.300+0000","up_votes":1,"down_votes":0,"body":"Que sea bueno xD por que hay cada \"main supp\" hoy en dia","replies":[]}]},{"poster":"Keyz","date":"2016-05-08T13:16:59.312+0000","up_votes":2,"down_votes":0,"body":"le di like \n\nhttps://media0.giphy.com/media/S5iqkyBY9o4KY/200_s.gif\n\n\nopino exactamente lo mismo, y comparto la misma experiencia, aunque por lo que lei no mencionaste los 4 premades que te tocan que son malos y los tenes que carrear porque sino te reportan a vos a pesar de ser ellos el problema.\n\nahora te agrego y hablamos ^^","replies":[]},{"poster":"A Noxian Beauty","date":"2016-05-08T11:27:05.998+0000","up_votes":4,"down_votes":2,"body":"alfin......alguien que piensa exactamente igual que yo,te abrazo compañero.\nlo peor es que derrepente trollean en premades y aunque vayas 14/2 al minuto 30 no te dejan carrear,o son asquerosamente malos que literalmente son \"incarreables\" literalmente,es como si fuesen trolls pero sin intencion de serlos, mis ultimas partidas he tenido buenos scores arriba de 10 kills vs muertes y hay gente que realmentes es como  {{sticker:zombie-brand-facepalm}} \n\nmira lo unico que te puedo decir es que hay que hacer lo mismo....no hay mas remedio,si riot quiere reventar el sistema de ranked haciendo que los premades sean la forma de subir,habra que hacer lo mismo,conseguir amigos platinos y cagarles el sistema de elo,ellos promocionan el \"eloboost legal\" en su afan de promocionar la amistad y los juegos en equipos. Eso te lo compro en partidas normales y aram,pero no en ranked xD eso es una burla.","replies":[]},{"poster":"Zeran","date":"2016-05-08T13:39:22.515+0000","up_votes":5,"down_votes":3,"body":"La pura verdad\nAyer me toco con un super pro premade de 3, dios mio no sabes como feedearon y como yo se que pasa en estos casos si hablas de más mute y seguí jugando. Que asco.","replies":[]},{"poster":"Ch4puLin","date":"2016-05-08T17:26:44.455+0000","up_votes":4,"down_votes":3,"body":"Suena bastante a memoria selectiva.","replies":[{"poster":"Revivax","date":"2016-05-10T01:32:03.606+0000","up_votes":2,"down_votes":1,"body":"No lo es","replies":[]}]},{"poster":"ARG Wuju Style ","date":"2016-05-10T10:21:22.321+0000","up_votes":1,"down_votes":2,"body":"Ya se pasan publicando mierdas , Riot dio como solución a los troll hacer premade de 5 y pero ahora se quejan con cualquier cosa adaptense loco paren de llorar una vez no se conforman con nada y lo peor que dicen boludeces cuando miles de jugadores rankean solos.","replies":[{"poster":"Wizard","date":"2016-05-10T15:21:52.053+0000","up_votes":1,"down_votes":0,"body":"en ligas bajas no pasa nada , pero que pasa cuando sos d1+ ,yo q juego solo ya me viene pasando muchas pero muchas veces q me toca contra equipos profesionales , lindo no? saber q vas a perder antes de jugar , vos con otros 4 random vs un equipo profesional del lol, o ¿donde piensas que practican ellos? , como en high elo hay pocos jugadores las colas ademas de ser de 40-50 min te meten a esas partidas , ya da asco el jugar así.","replies":[]}]},{"poster":"ShurimaSands","date":"2016-05-10T13:02:31.869+0000","up_votes":1,"down_votes":0,"body":"Por lo mismo no e jugado ranked ultimamente :/","replies":[]},{"poster":"Whitesse","date":"2016-05-10T01:49:30.610+0000","up_votes":1,"down_votes":0,"body":"Las unicas ranked que jugue con una premade de 4 (menos de 5 seguro partidas seguro), me carrearon ellos solos y jamas flamearon, No soy de un elo alto (platino 2 y mi smurf en D5) pero las premade de 4 que me tocaron jugaban como en los torneos o LCS, muy buenas rotaciones, wardeo y cc. Por \"suerte\" me las arreglo bien jugando 1v2 de ADC para que hayan carreado en las demas lineas pero no me quejo de nada con el nuevo sistema.","replies":[]},{"poster":"eyzttEN","date":"2016-05-09T21:06:41.289+0000","up_votes":1,"down_votes":0,"body":"Muchachos, creo (para mi) y los invito a pensar como yo... que esta season fue la peor en el ambito ranked. Las colas son interminables. Mas de 15 min en gold 1 tengo que esperar y ya se me van las ganas de jugar.\n\nO sino esperas 10 minutos mas el ban mas el pickeo y dsp la partida termina en 20 y hablo de un 40% de partidas.\n\nNo destaque lo de los premade ya que lo hicieron perfectamente en otros comentarios.","replies":[]},{"poster":"Brooklyn Baby","date":"2016-05-09T19:17:11.137+0000","up_votes":1,"down_votes":0,"body":"De d4 para arriba estas promedio 40 minutos en queue siempre para encontrar un match. al estar 40 minutos en queue el matchmaking de riot es cualquiera, los emparejamientos no tienen sentido, platinos 1 y challengers en el mismo team, y si, premades. diariamente juego con mi team de full solos vs un premade de 3, 4 o 5 en el otro team, y los games son una stompeada de 20 minutos obviamente.\n\n40 min en queue para perder al 20 contra un premade. :)\n\nEl poder que tiene el premade teniendo comunicacion de voz y coordinacion vs 5 solos es imbalanceable. Quizá no ocurra mucho en elo bajo pero ni bien salis de platino ya empezás a sufrir el verdadero cancer que es dynamic queue.\n\nNo llego a comprender como puede seguir existiendo dynamic queue sin que vuelva soloq. eso que acabo de mencionar es uno de los mil problemas que tiene este sistema.\n\nElo boost? dynamic boost. Entrás en tu smurf y invitas 3 o 4 amigos low elo y los boosteas como un campeon a la liga que quieras. Todos lo hacen, los streamers lo hacen, y es legal :).\n\nLas ranked en elo bajo (bronce, silver, gold, low platino) son cualquiera. Ves gente que claramente son smurfs con nivel de diamond/masters y gente que claramente fue boosteada por dynamic con nivel de silver/bronce jugando en gold. Todo gracias a dynamic queue :)\n\nPuedo seguir y escribir la santa biblia de putiadas y quejas sobre el chiste de mal gusto que es dynamic queue, pero ya se hacen la idea.\n\nMe alegra que finalmente en éste server la gente se empiece a quejar, ya era hora. En el NA hace meses que están todos quejandose sin parar y aún no ha habido una sola respuesta de un Rioter.\nEn reddit los post de queja sobre DQ fueron estricamente prohibidos (censura de riot). Esperemos que por un milagro Riot nos escuche y hagan algo al respecto de dynamic queue y dejen de matar su juego, nuestro juego.","replies":[{"poster":"West Coast","date":"2016-05-09T20:46:09.583+0000","up_votes":1,"down_votes":0,"body":"Entiendo tu frustración , eso de los smurfs D ó Master lo puedo asegurar porque me tocó tener a favor y en contra (Vayne con perfect farm y como 20 kills con apenas 2 ó 3 muertes, si claro y va a ser silver) , el tema es que yo no quiero que me carreen, quiero subir solo como antes. Espero no me borren el post, y se me hace raro que ningún rioter haya comentado hasta ahora... Lo leyeron SEGURO, pero habrá que ver que opinan...","replies":[]}]},{"poster":"Sirek","date":"2016-05-09T18:01:31.589+0000","up_votes":1,"down_votes":0,"body":"Tienes toda la razón, jugue con un amigo y las veces que nos salieron premades de 3 que eran un dolor de cabeza, que te empezaban a flamer por el simple hecho de que \"No gankeaste\" o \"No mataste\", mientras que en el otro team están coordinados que van los 5 en el momento preciso para matarte, botar bot y hacer dragon mientras el mid y el top de tu equipo estaban en su mundo farmeando y ni siquiera botan la torre... y además te flamean por que te mataron y te botaron la torre ¬¬\n\nCuando he jugado solo me he comido insultos y flameos varios, al punto que tengo que jugar con 1 o 2 amigos por obligación, no por gusto.... \n\nCuando Riot anuncio la SoloQ, fue genial, pero cuando la cancelaron no me acuerdo por que fue una total decepción.","replies":[]},{"poster":"Beonor","date":"2016-05-09T16:06:55.637+0000","up_votes":1,"down_votes":0,"body":"yo subi a oro y me encontre con infinidad de boosteados, que NO saben jugar, es clarísimo que los subieron ahí, y después los pobres diablos como yo que subimos con sudor y lagrimas, nos tenemos que cruzar con esta gente, quien te hace perder games tras otro hasta que tu mmr queda por el suelo como a mi, y el ciclo sigue y sigue.. antes del dynamic estos \"boosteados legales\" no existian tanto como ahora","replies":[]},{"poster":"Carl es el negro","date":"2016-05-09T15:05:56.944+0000","up_votes":1,"down_votes":0,"body":"Mirá, yo antes jugaba solo q y realmente depende de uno porque por lo general el equipo siempre es individualista, \n Hace unas semanas conoci a un pibe in game el va top o jg y yo adc, por lo general siempre carreamos, en dos semanas, tan solo en dos semanas subi de plata 3 hasta oro 4 y el de bronce 2 a plata 4.\n\n Te recomiendo jugar con un premade que no muera y vas a subir solo.","replies":[]},{"poster":"Dark Helel","date":"2016-05-09T14:09:43.059+0000","up_votes":1,"down_votes":0,"body":"Por esa razon ni ganas de rankear, como mucho pienso jugar para llegar a oro unas cuantas y a la mierda.\nNo vale la pena jugar asi, siempre es igual, las premades cagan el juego,desde que este salio...\nReal solo Q seria lo mas efectivo, pero no lo quieren aceptar, un modo como el de ahora que solo beneficia al que se consigue gente que los carree no prueba la habilidad del jugador en absoluto...\ny si no fuera por las recompensas de temporada seguramente muchisimas mas gente dejaria de jugar Solo Q.","replies":[]},{"poster":"Pingüino","date":"2016-05-09T00:46:21.648+0000","up_votes":1,"down_votes":0,"body":"totalmente de acuerdo riot debiese ya de arreglar este problema .\nhay demasiadas personas que quieren jugar ranqued en solitario encuentro una estupidez que se nos prive de eso.\n\nrecuerdo año pasado que dijieron que iban a colocar una cola para jugar solo, pero una vez más mucho discurso bonito y nada. {{champion:245}}","replies":[{"poster":"Ch4puLin","date":"2016-05-09T13:55:52.063+0000","up_votes":1,"down_votes":0,"body":"De hecho, avisaron que habían revisado eso, y que iban a priorizar otra cosa.\nY tampoco te privan de jugar solo, podés hacerlo, no hay estupidez en eso.\nAhora, que vos recuerdes de x cantidad de partidas, que en una un premade te \"trolleo\", no dice nada.","replies":[]}]},{"poster":"Rîck Hunter","date":"2016-05-09T10:07:18.883+0000","up_votes":1,"down_votes":0,"body":"Riot es una empresa en la cual no se puede confiar ya que prometen cosas que después no van a cumplir, se dieron cuenta que ambas colas no podían coexistir puesto que dinamicQ quedaria vacia a los días con ambas colas funcionando","replies":[]},{"poster":"NICO PELDAÑO","date":"2016-05-09T07:57:03.511+0000","up_votes":1,"down_votes":0,"body":"Saca premade nomas imposible jugar solo Q","replies":[]},{"poster":"NoCarreoSoyFeder","date":"2016-05-09T06:54:27.583+0000","up_votes":1,"down_votes":0,"body":"la logica que aplico para estos casos es la siguiente: 4 premades +  yo (1) quieren ganar \nrespuesta de los premades ( NO ) \nmi respuesta ( y para que juegas ranked para ser toda tu vida bronce 5 )\nrespuesta de los premades ( no)\nmi respuesta ( entonces ponele bueno a la partida si quieres trollear anda a jugar aram esto es ranked papu)\nrespuesta de los premades ( y crees que me importa )\nrespuesta mia ( me cagaron la promo T.T)","replies":[]},{"poster":"Exit","date":"2016-05-09T05:57:41.574+0000","up_votes":1,"down_votes":0,"body":"cuando es asi es mutear y jugar tranquilamente me tocan gente todas master + siempre de premade de a 2 3 4 y generalmente me invitan a ts o skype y es mas comodo :D","replies":[]},{"poster":"DanielGarrita","date":"2016-05-09T02:59:55.808+0000","up_votes":1,"down_votes":0,"body":"que significa solo Q ? sin flamearme o enojarse pls","replies":[{"poster":"West Coast","date":"2016-05-09T05:08:50.836+0000","up_votes":1,"down_votes":0,"body":"Solo Q = Solo Queue , en pocas palabras jugar ranked solo (Se puede aplicar a las normal, pero el término solo q es más usado en ranked)","replies":[]}]},{"poster":"LuIsHi","date":"2016-05-09T01:15:44.053+0000","up_votes":1,"down_votes":0,"body":"asd","replies":[]},{"poster":"TheSystruction","date":"2016-05-08T23:09:41.222+0000","up_votes":1,"down_votes":0,"body":"entiendo que te rayes por esas cosas, soy adcarry y justamente tengo mucha mas visión del juego que mi propio support, .___. vengo ganando 5 clasificatorias con jinx entre las que he jugado, ganando partidas con puro conocimiento del juego y desiciones en los momentos clave, no es nada de otro mundo carrear a esta gente, pero si se te dificulta escalar como a mi, ten cuenta que mejorando siempre mucho mas en algún momento cuando empieces a subir no habrá quien te pare, pues sabras tanto del juego que  no tendras rival en estas ligas bajas, ni siquiera esas ratitas premade que se creen SKT y te joden viniéndote los 5  a bot a level 6 podrán ganarte una partida, y es que tu nivel individual será tanto que no podrán hacerte frente en peleas de equipo. {{sticker:slayer-jinx-wink}}","replies":[]},{"poster":"Revivax","date":"2016-05-08T21:54:04.241+0000","up_votes":1,"down_votes":0,"body":"Exactamente es horrible jugar soloq ahora.","replies":[]},{"poster":"Lygnus dwarf","date":"2016-05-08T17:00:40.241+0000","up_votes":1,"down_votes":0,"body":"me gusta tu nombre, ¿A que se debe?","replies":[{"poster":"West Coast","date":"2016-05-08T20:07:27.419+0000","up_votes":1,"down_votes":0,"body":"La West Coast también conocida como \"WC\" \"Costa Oeste\" es un \"subgenero\" del Rap por así decirle, ya que comprende a todos los artistas y canciones hechas en la West Coast. ¿Cuales artistas por ejemplo? Exponentes y palabras mayores del Gangsta Rap como N.W.A (Ver película Straight outta Compton para más referencia) , Eazy-E , Snoop Dogg, Nate Dogg, Ice Cube, Dr Dre, Tupac, Xzibit, Game, y muchos otros más pero éstos son los de más renombre.","replies":[]}]},{"poster":"Rohaerlynn","date":"2016-05-08T19:29:57.063+0000","up_votes":1,"down_votes":0,"body":"Yo aplico una regla muy simple cuando juego.\nNo te gusta mi pick, mi forma de jugar, o mi forma de hablar? ahi en la esquina tenes una hermosa X para salir del juego, me importa un carajo cuantos reports me puedas poner.\nSi no tengo team cuando yo lo necesito no tengo motivo para tenerlo cuando ellos lo necesitan, yo estuve media hora con el jungla encima y vos encima venis a pushearme la linea cuando ya me mataron? leeesto, asi estamos.\n\nMira si me voy a hacer mala sangre por un juego.","replies":[]},{"poster":"hombrequearaña","date":"2016-05-08T18:50:16.371+0000","up_votes":1,"down_votes":0,"body":"El unico punto que no concuerdo es lo de eloobost, por definicion es eloboost cuando alguien usa tu cuenta y la sube de divisiones.\n\nRito habia prometido un cola individual donde no existieran las premades, pero solo se quedo en promesas lamentablemente.\n\nLo molesto es cuando los flammers llaman a sus amigos flammers a hacer dinamic Q, muchas veces sabes que perderas la partida en la seleccion de campeones por que ya comienzan insultando y usando picks como riven o vayne.","replies":[]},{"poster":"Condor","date":"2016-05-08T18:23:48.228+0000","up_votes":1,"down_votes":0,"body":"Es una pena, pero así están las cosas, yo ya dejé de jugar ranked por lo mismo, juego para divertirme y superar la liga que tuve la Season pasada, peri cuando tocan premades mala onda la partida se transforma en un infierno......","replies":[]},{"poster":"Sakura Star","date":"2016-05-08T18:09:46.205+0000","up_votes":1,"down_votes":0,"body":"Nah bien dicho... por eso tampoco juego ya normales, aram o evento...\nDespues del ultimo trolleo de 4 flamers random....\nPrefiero jugar ya con amigos si me es posible, pero 100% estoy de acuerdo...xD","replies":[]},{"poster":"LittleNess","date":"2016-05-08T16:00:50.285+0000","up_votes":1,"down_votes":0,"body":"Te entiendo, es horrible y penca, me pasa casi siempre cuando voy de adc, el supp queda alli parado en torre o se tira directo a la torre enemiga y termina diciendo \"gg izi pizi adc\", es hostigannte. Ahora ultimo ha cambiado un poco, me toca buen support y gano mi linea lento pero seguro. Igual juego solo y juego mejor que con una premade de 3 o con algun amigo, al comienzo simplemente muteo a casi todos menos a mi support (obvio) y empiezo a jugar como estoy acostumbrado a jugar y me va bien, saco buen farm, a veces me va tan bien que saco el first blood a los 3 minutos (nunca me habia pasado). Trata de tener paciencia si vas a jugar solo, te ayudaria (de verdad) pero solo tengo 10 champs ({{champion:103}} {{champion:22}} {{champion:203}} {{champion:21}} {{champion:15}} entre otras)  de los cuales solo 2 de esos champs son support ({{champion:40}} {{champion:25}} ) y recien estoy aprendiendo a como supportear :( Que tengasbuena suerte y sigas jugando, ojala te diviertas tmb. Nos vemos en alguna partida casual ;) \n{{sticker:slayer-jinx-catface}}","replies":[]},{"poster":"Insane Sir","date":"2016-05-08T15:39:00.723+0000","up_votes":1,"down_votes":0,"body":"Encima si jugas bien y los carreas los tipos te fulminan a solicitudes.","replies":[]}]}