{"poster":"ProDome","date":"2016-04-19T15:06:11.136+0000","title":"Beschwerde","subforum":"Champions & Gameplay","up_votes":2,"down_votes":20,"body":"Hallo Riot,\r\n\r\nich m&ouml;chte mich &uuml;ber die derzeite Situation von League of Legends beschweren. \r\n\r\nIch finde man bekommt zu wenig LP f&uuml;r einen Win und man bekommt zu viele abgezogen wenn man verliert. Ich bekomm derzeit 10-13LP f&uuml;r einen Sieg und 20-25LP f&uuml;r eine Niederlage abgezogen, sodass ich nicht mehr vorran komme (ich war bis vor kurzem Silber 5 und dadurch bin ich jetzt Bronze 1). Ich bitte darum, dies zu &auml;ndern und es wenigstens gleich zu setzen (gleichviele LP f&uuml;r einen Sieg bekommen wie f&uuml;r eine Niederlage abgezogen bekommen).\r\n\r\nDes weiteren w&uuml;rde ich darum bitten, Master Yi sehr stark zu nerfen oder ihn gleich zu entfernen. Dieser Champion ist in meinen Augen einfach sinnlos und hat nichts mehr mit spielen zu tun. Er ist einfach viel zu stark/op und es ist auch so easy ihn zu spielen, das geht so echt nicht. Danke\r\n\r\nMit freundlichen Gr&uuml;&szlig;en,\r\n\r\nProDome","replies":[{"poster":"hshtagniemehrcdu","date":"2016-04-19T15:12:13.545+0000","up_votes":6,"down_votes":0,"body":"Bronze 5 Inc.","replies":[]},{"poster":"Namlesshero","date":"2016-04-19T15:10:59.887+0000","up_votes":4,"down_votes":0,"body":"Schritt 1: Pick Rammus \nSchritt 2: Kauf dornenpanzer und andere rüstungs und lebensitems \nSchritt 3: Steh da und sie zu sie master yi sich selbst tötet\n\nZu den Lp sag ich nichts da es mir zuviel text ist um aufm handy zu Tippen","replies":[{"poster":"p0nki3","date":"2016-04-19T18:32:19.524+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Namlesshero,realm=EUW,application-id=Wj1wcocU,discussion-id=OhFYB1IR,comment-id=0001,timestamp=2016-04-19T15:10:59.887+0000)\n>\n> Schritt 1: Pick Rammus \n> Schritt 2: Kauf dornenpanzer und andere rüstungs und lebensitems \n> Schritt 3: Steh da und sie zu sie master yi sich selbst tötet\n> \n> Zu den Lp sag ich nichts da es mir zuviel text ist um aufm handy zu Tippen\n\nNaja dies kannst du aber nicht einfach so machen, da du bedenken musst, dass du nicht NUR gegen Yi spielst. :D","replies":[{"poster":"Namlesshero","date":"2016-04-20T14:12:28.303+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=p0nki3,realm=EUW,application-id=Wj1wcocU,discussion-id=OhFYB1IR,comment-id=00010000,timestamp=2016-04-19T18:32:19.524+0000)\n>\n> Naja dies kannst du aber nicht einfach so machen, da du bedenken musst, dass du nicht NUR gegen Yi spielst. :D\n\nPssscht wenn du das nicht gesagt hättest hätte das keiner Bemerkt ;)","replies":[]}]}]},{"poster":"MeMyselfandBaal","date":"2016-04-19T18:11:41.163+0000","up_votes":2,"down_votes":0,"body":"ähm... wenn Riot das durchziehen würde, wärst du jetzt Bronze II oder III... wärst du dann zufriedener? Riot handhabt die Ver Divisions Spieler ein bisschen wie die Bundesliga den HSV: Die versuchen alles, damit man nicht absteigt.\n\nWas Riot jetzt macht, ist all die Spiele, für die du 0 LP verloren hast (in Silber V) wieder auszugleichen. Und du musst doch zugeben, dass das nicht wirklich unfair ist.\n\nUnd ja, Riot hat sich bewusst dafür entschieden, die Division V Spieler zu schützen, damit ein Abstieg nach ein paar schlechten Spielen sie nicht total demotiviert und um ihre Saisonbelohnung bringt...","replies":[]},{"poster":"LittelplayerHD","date":"2016-04-19T15:10:29.610+0000","up_votes":1,"down_votes":10,"body":"In meinen Augen ist Master Yi einfach nur ein sinnloser champion und es hat nichts mehr mit skill zu tutn","replies":[{"poster":"Enderized","date":"2016-04-19T15:21:43.226+0000","up_votes":2,"down_votes":0,"body":"In meinen Augen ist dein Kommentar Sinnlos und hat nichts mit einer konstruktiven Diskussion zu tun :)\n\nEdit: Wenn du meinst das man mit dem kein Skill braucht, dann climbe doch mit dem die Ladder :)","replies":[{"poster":"Megamaexx","date":"2016-04-19T15:32:38.670+0000","up_votes":2,"down_votes":0,"body":"Ich glaub, das werde ich mal versuchen :D Silber 1 incoming >.<","replies":[{"poster":"Maexle","date":"2016-04-19T16:51:49.218+0000","up_votes":1,"down_votes":0,"body":"Ach was doch nicht Silber 1. Dia ist doch locker drin... {{champion:17}}","replies":[{"poster":"Enderized","date":"2016-04-19T18:38:44.387+0000","up_votes":1,"down_votes":0,"body":"Challanjour!","replies":[]}]}]},{"poster":"p0nki3","date":"2016-04-19T18:33:29.266+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sabaton marches,realm=EUW,application-id=Wj1wcocU,discussion-id=OhFYB1IR,comment-id=00000000,timestamp=2016-04-19T15:21:43.226+0000)\n>\n> In meinen Augen ist dein Kommentar Sinnlos und hat nichts mit einer konstruktiven Diskussion zu tun :)\n> \n> Edit: Wenn du meinst das man mit dem kein Skill braucht, dann climbe doch mit dem die Ladder :)\n\nGeht nicht nicht. Permaban.","replies":[{"poster":"Enderized","date":"2016-04-19T18:37:37.879+0000","up_votes":1,"down_votes":0,"body":"Kein Kommentar :)","replies":[]}]}]}]},{"poster":"AI Yjuq","date":"2016-04-19T15:11:10.574+0000","up_votes":2,"down_votes":1,"body":"Und was ist mit Irelia? Die wurde gebufft statt generft. Rito, was ist hier los wtf!? ö.Ô","replies":[{"poster":"Megamaexx","date":"2016-04-19T15:31:51.731+0000","up_votes":2,"down_votes":1,"body":"Better nerf Irelia ;D","replies":[]},{"poster":"Macolm Merlyn","date":"2016-04-19T18:12:04.991+0000","up_votes":1,"down_votes":2,"body":"also wenn rito jetzt auch noch op champs wie garen und illaoi bufft dann weiss ich wirklich nicht mehr weiter ^^","replies":[{"poster":"Z3ndom","date":"2016-04-22T08:31:25.511+0000","up_votes":1,"down_votes":0,"body":"Illaoi und OP...\nGwahahahhahahahahahahahahahahaha!","replies":[{"poster":"Macolm Merlyn","date":"2016-04-22T09:21:01.697+0000","up_votes":1,"down_votes":0,"body":"Ja die ist noch mehr op als yorick das war Btw Ironie","replies":[{"poster":"Z3ndom","date":"2016-04-22T10:49:58.129+0000","up_votes":1,"down_votes":0,"body":"Ironie ist schwer einzuschätzen,wenn man es nicht deutlich macht.","replies":[{"poster":"Macolm Merlyn","date":"2016-04-23T01:26:21.073+0000","up_votes":1,"down_votes":0,"body":"Reicht ^^ kombiniert mit einer vollkommen lächerlichen Aussage kombiniert nicht aus ):","replies":[{"poster":"Z3ndom","date":"2016-04-23T05:57:49.529+0000","up_votes":1,"down_votes":0,"body":"Naja,du hast Garen und OP in einem Satz benutzt und kein \"nicht\" benutzt.Es gibt genug Leute die legit darüber sind.","replies":[{"poster":"Macolm Merlyn","date":"2016-04-24T10:04:48.362+0000","up_votes":1,"down_votes":0,"body":"Sollte ja auch eine parodie auf diese personen sein","replies":[]}]}]}]}]}]}]}]},{"poster":"Vinhzend","date":"2016-05-01T15:38:18.021+0000","up_votes":1,"down_votes":0,"body":"Ich hatte etwas über 300 rp hatte ne box mit schlüssel gekauft die rp waren weg aber die box und der schlüssel nicht da bitte sofort rückgängich machen das ist immerhin Geld{{champion:63}}","replies":[]},{"poster":"Sirrkas","date":"2016-04-19T15:45:33.859+0000","up_votes":1,"down_votes":0,"body":">Ich finde man bekommt zu wenig LP für einen Win und man bekommt zu viele abgezogen wenn man verliert. Ich bekomm derzeit 10-13LP für einen Sieg und 20-25LP für eine Niederlage abgezogen, sodass ich nicht mehr vorran komme (ich war bis vor kurzem Silber 5 und dadurch bin ich jetzt Bronze 1). Ich bitte darum, dies zu ändern und es wenigstens gleich zu setzen (gleichviele LP für einen Sieg bekommen wie für eine Niederlage abgezogen bekommen).\n\nDas liegt daran, dass man zum Absteigen in 5er Divisionen grob eine ganze Liga schlechter spielen muss, als man aktuell platziert ist. Du befindest dich also skilltechnisch momentan in einem Bereich von Bronze 5 bis bestenfalls Bronze 3. Du trittst gerade gegen Spieler an, die deutlich unter Bronze 1 sind und da du eigentlich locker gewinnen müsstest, wenn du nach Bronze 1 gehörst, verlierst du so viele Punkte und erhältst so wenige.","replies":[]},{"poster":"Sumday","date":"2016-04-19T15:39:59.203+0000","up_votes":1,"down_votes":0,"body":"Wenn es so easy ist mit yi zu carrien; Warum nimmst du ihn nicht?","replies":[]},{"poster":"Untouchable ProX","date":"2016-04-19T15:34:32.785+0000","up_votes":1,"down_votes":0,"body":"Eig wurde hier vieles schon gesagt, aber finde dieser Thread verdient es kommentiert zu werden!\n\n1. Deine MMR ist einfach durch. Dh. du spielst zu schlecht für deine aktuelle Devision. \nDas bedeutet deine MMR entspricht weder B1 noch s5 sondern weit darunter, dadurch bekommst du schlechtere Gegner und somit auch bei einen Win weniger Lp.\nDies kommt oftmals durch mangelnde Winrate und schwach abfallende Lp. \nUm daraus zu kommen musst du entweder viele Games einfach gewinnen oder auf die dir zugehörige Liga kommen.\nDas System arbeitet hier vollkommen richtig.\n\n2. Zu Master Yi. \nWirklich?..\nEr ist eig relativ balanced. Dmg wurde oft schon angepasst und mehr als Q und autos hat er nicht.\nEin gescheiter CC und er sollte kein Problem darstellen.\nAber natürlich, der jenige mit der Toten MMR und abfallender Liga Richtung Bronze, beschwert sich über ein Master Yi.\nVll liegt hier genau dein Problem? -> Du bist einfach noch nicht Silber gewachsen..","replies":[]},{"poster":"Megamaexx","date":"2016-04-19T15:26:05.617+0000","up_votes":1,"down_votes":0,"body":"Das mit deinen LP hängt mit deiner MMR (Match Making Rating) zusammen. Umso schlechter dieser Wert im Vergleich anderer in deiner Liga, umso weniger Punkte bekommst du bei einem Sieg und umso mehr Punkte verlierst du. Sobald deine MMR wieder zu deiner Liga passt (also wenn du plötzlich überdurchschnittlich viel gewinnst oder weit genug gefallen bist), pegelt sich der Wert an Ligapunkten wieder ein. \nMaster Yi ist stark, gebe ich zu, aber er hat seine Probleme bei Hard-CC und am Anfang des Spiels. Seine aktuelle Bann-Rate spricht allerdings für einen Nerf. Bisher ist mir dazu noch nichts bekannt, aber wer weiß, was bald auf dem pbe geschehen wird ;)","replies":[]},{"poster":"Maexle","date":"2016-04-19T15:16:17.982+0000","up_votes":1,"down_votes":0,"body":"Deine MMR bestimmt wie viel LP du bekommst und verlierst. Wenn deine MMR deutlich schlechter ist, als die Liga in der du spielst, dann verlierst du auch deutlich mehr als du bei einem Sieg bekommst, so dass du irgendwann wieder in die Liga kommst, in die du gehörst. Wenn du von Silber 5 abgestiegen bist, dann ist deine MMR auf dem Niveau von Bronze 5, es ist also nur logisch, dass du in Bronze 1 so viel verlierst. Du kannst das aber ganz einfach wieder in den Griff bekommen, indem du gewinnst. {{champion:17}}","replies":[]},{"poster":"berndbolerow","date":"2016-04-20T01:22:29.172+0000","up_votes":1,"down_votes":3,"body":"Hallo ProDome,\n\n>..Deine MMR ist einfach durch...\n\n>...Sobald deine MMR wieder zu deiner Liga passt...\n\n>...Du befindest dich also skilltechnisch momentan in einem Bereich von Bronze 5 ...\n\nalter Schwede, die Meisten sagen das du ein schlechter Spieler bist und gehöhrst überspitzt nach Bronze 5. Was für ein niederschmetterndes Urteil!\n\nIch gehe da mal anders ran !\nIch nutze die Seite \nhttps://lol.arenaonline.com/stats/summoners/66359362/overview\nDiese sagt momentan das du das Niveau eines Bronze I Gamers hast.\nReine statistische Fakten mit einer KDA von 6.0/4.9/5.8.\n\nJetzt zu meinem Aber!\nAuch in dieser Seite zu erkennen ist folgendes:\nMit Graves hast du Silber 4 Niveau \nMit Zed hast du Silber 5 Niveau \nMit Malphite hast du Silber 5 Niveau \nMit Miss Fortune hast du Silber 5 Niveau \n\nNun zu meinem Resume!\nSpiele eine Lane wo du dich Sicher fühlst und diese am besten beherschst.\nSpiele 5 Champions welche du anschließend Blind beherschst und glaube mir du wirst keine Probleme haben deine ELO/MMR zu halten.\n\n> Zu Master Yi!\n\nNun mach dir nen Smirf wenn der Master free to Play ist und finde herraus wo seine Schwächen sind! Ich weis das er keinen CC mag wie Ihn die als beispiel die Lux hat. Einmal getroffen ist er Geschichte ....\n\nAlso lasse den Kopf nicht hängen und es gibt garantiert bessere Tage!\n\nNoch eine Statistik die dir bestimmt helfen wird:\nhttp://wardscore.loltools.net/?name=prodome&region=euw\n\nVG\nBernd\n\nPS: und ich habe Ihm ein + gegeben","replies":[]}]}