{"poster":"UnrealGhosts","date":"2017-03-14T19:20:46.490+0000","title":"Mouse Lag","subforum":"[ARCHIVED] Help & Support","up_votes":2,"down_votes":0,"body":"So I recently started having strange mouse lag when in-game (and only in-game, which makes me think it's not a hardware problem).\r\nIt's generally worst when I use ALT+TAB to go on another page and it's nothing like a traditional lag since I get no ping or FPS drop.\r\nAm I the only one in this situation ?","replies":[{"poster":"Fassy Hole","date":"2017-04-01T11:34:22.750+0000","up_votes":1,"down_votes":0,"body":"This keeps happening to me to, it is infuriating. I noticed it for over a month ago and its got to the point where i don't want to play anymore, which is a shame cause i really enjoy league. i bought a new mouse as i thought that may of been the issue but no luck. i hope they find a fix. \ngonna try going back to old client though.","replies":[]},{"poster":"Porocles","date":"2017-03-18T21:47:08.272+0000","up_votes":1,"down_votes":0,"body":"Your mouse sensitivity is specific to the settings you have set in game, and can be different outside of it.  Through the in-game settings, you will find an option to rescale your mouse sensitivity.  Let me now if that helps.","replies":[{"poster":"UnrealGhosts","date":"2017-03-19T18:33:18.835+0000","up_votes":1,"down_votes":0,"body":"I had actually checked old threads about similar problems and I tried playing with that. My sensitivity is generally at 65 like on the client. I've put it on 70 and nothing changed. Turned it back at 65 and nothing changed once again. And to be clear it's not like a lack of sensitivity, it's really a delayed reaction to the movement of my mouse. I'll send it to the right and 2 seconds later it will react, which generally send my camera all over the place and dosen't allow me to target anything.\n\nI'll keep checking for a solution, but thank you for your time. :/","replies":[{"poster":"UnrealGhosts","date":"2017-03-19T19:33:19.742+0000","up_votes":1,"down_votes":0,"body":"UPDATE: good news, seems the lag was cause by the new client somehow. I tried going back to the good old legacy client and it works fine now. Thanks for the help anyway ^^","replies":[]}]}]}]}