{"poster":"This is Destıny","date":"2018-07-12T00:13:59.778+0000","title":"Vladimir Nerf","subforum":"Champions & Gameplay","up_votes":1,"down_votes":1,"body":"Guten Abend / Nacht Summoner\r\n\r\nIch habe die Frage ob es sein k&ouml;nnte das in Zukunft ein Vlad Nerf kommt der Champion is in meinen Augen zu starkt und beeinflusst Games zu Stark.\r\nIch habe mit gleichen Kills als Ekko keine Chance ihn irgendwie zu t&ouml;ten da der Pool und der Schaden bzw Cooldown zu gering ist auf denn SPells","replies":[{"poster":"Released Ape","date":"2018-07-12T09:02:58.885+0000","up_votes":1,"down_votes":0,"body":"Hey,\n\ner ist leicht überdurchschnittlich. Aber der letzte Nerf wird für den SoloQ/Normal Bereich ausgereicht haben, zumindest wird der nächste Patch sehr wahrscheinlich keinen direkten Nerf für Vladimir bringen (nach aktuellen PBE Stand).\n\nWas du aber definitiv hättes machen können ist dein Item Build anzupassen. Sehr geholfen hätte dir z. B. {{item:3165}} anstatt {{item:3116}}. Warum baust du Rylais? Nur deine Ulti oder E (Das anspringen) verlangsamt den Gegner um 20 %, dieser Slow wird aber direkt durch die Q oder durch die W überschrieben (Slows stacken nicht).\n\nKannst wenn du trotzdem etwas defensiveres möchtest {{item:3027}} {{item:3001}} {{item:3102}} {{item:3151}} kaufen (letzteres hat von den Grundwerten 10 AP wengier als Rylais, dafür aber eine nutzbare Passiv).","replies":[]},{"poster":"SSI CptHaunted","date":"2018-07-12T07:51:07.967+0000","up_votes":1,"down_votes":0,"body":"Das letzte Mal, dass ich gegen Vlad gespielt habe, war keine sonderlich große Freude für ihn. Wie gut dieser Spieler nun war sei mal dahin gestellt, aber so \"OP\" ist er jetzt nicht. Man muss nur seinen Pool rausbaiten und schon kann er sich kaum noch verteidigen.\n\nDa Vlad auch im Pro-Bereich durchaus beliebt ist kann man zumindest davon ausgehen, dass er nicht gebufft werden wird. Nerfs sind mMn zwar im Rahmen des Möglichen, würde aber nicht drauf setzen.","replies":[]},{"poster":"Bronze7Main","date":"2018-07-12T00:41:29.567+0000","up_votes":1,"down_votes":0,"body":"Ekko hat ein wesentlich stärkeres early bzw teilweise midgame. das lategame wird atm wirklich in wenigen games erreicht sprich als ekko hast du eigentlich immer bessere chancen sprich ein skill matchup. wenn du natürlich wie wood spielst dann ist das natürlich klar aber n vladimir hat wirklich bis lvl 10 ca fast nix um dich richtig zu bestrafen.","replies":[{"poster":"This is Destıny","date":"2018-07-12T01:00:32.658+0000","up_votes":1,"down_votes":0,"body":"die Sache war die ich war Top Lane gegen Poppy habe auch gewonnen mit 6/1 dannach bin ich roamen gegangen und habe halt Vlad gefightet endete dadrin das er mich in ungefähr 6 sec getötet hat er war zu dem Zeitpunkt 4/1","replies":[{"poster":"Bronze7Main","date":"2018-07-12T01:06:26.948+0000","up_votes":1,"down_votes":0,"body":"Das natürlich unglücklich ^^ aber auch hier gibt es wege und möglichkeiten . die kann man aber  an für sich nur anhand von nem replay erklären.","replies":[]}]}]}]}