{"poster":"Tucrucios","date":"2015-10-28T22:00:19.108+0000","title":"With wards being removed from the game, what will happen with sightstone?","subforum":"Gameplay","embed":{"description":"Welcome to Preseason 2016. We're trying to keep the conversation low-key for now with the Worlds final right around the corner but, with a pile of changes hitting the PBE soon, we wanted to get ahead with our gameplay goals for this preseason.","url":"http://na.leagueoflegends.com/en/news/game-updates/features/preseason-2016-crests-horizon","image":"http://na.leagueoflegends.com/sites/default/files/styles/wide_medium/public/upload/header_1280x720.jpg?itok=BWQarp4o"},"up_votes":1,"down_votes":0,"body":"Will sightstone become an essential item on all lanes or will it be removed/reworked? If it does get changed a lot, I see a huge Nerf in  Lee Sin&#039;s kit. ( katarina also )\r\n\r\n&#039;&#039;For the second goal, we&rsquo;re removing Stealth Wards from the shop so teams will need to rely more heavily on their pink (and blue trinket!)&#039;&#039;\r\n\r\nDoes this also mean that the greater stealth(yellow trinket) totem  is being removed?\r\n\r\nIf I seem lost, can someone explain to me what the heck is going on with Wards and Ward related items?","replies":[{"poster":"Zair Umbras","date":"2015-10-28T23:43:23.373+0000","up_votes":1,"down_votes":0,"body":"Only the buyable green is being removed. Riot has said they'll be making the base trinket have 2 wards rather than 1 as sort of a compensation.","replies":[]},{"poster":"Best Boop NA","date":"2015-10-28T22:07:01.553+0000","up_votes":1,"down_votes":0,"body":"The only thing being removed is the green ward (the 75 gold one) from the shop. Sightstone, pink wards, and trinkets will all still have them (and from the sounds of it those will be even better). Sightstone probably will not be needed on laners, as trinkets now auto upgrade (you don't need to pay, which many people forget to do). From the sounds of it, sightstone is getting stronger on supports, so from the looks of it the removal of green wards will only hurt the early game. (Honestly so few people use their trinkets that it wont make much of a difference at most ranks)","replies":[{"poster":"Ionian","date":"2015-10-28T22:16:10.421+0000","up_votes":1,"down_votes":0,"body":"I always buy a green ward every back during the laning phase when I play mid. This really hurts.","replies":[]}]}]}