{"poster":"Metins Vater","date":"2017-09-04T22:16:20.807+0000","title":"[Smurf] Sucht DuoQ Partner/in","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Heyo Community, \r\n\r\nVorab, ich bin Allrounder. Ich spiele gern jede Lane, bevorzuge aber beim Smurfen die Midlane. \r\n\r\nSmurfen tue ich auf einem Silber 4 Account, meine richtige Elo ist Platin 5. \r\nAm liebsten w&uuml;rde ich einen Jungle oder Support Main dabei haben. \r\nIch m&ouml;chte kein geflame untereinander, sonst ist es mir egal wem ihr flamed. \r\n\r\nBevor Leute rum heulen *mimimi, smurfen ist so l&auml;cherlich, kannst deine richtige Elo nicht halten* - Nein, ich m&ouml;chte nur nen zweit Account haben und damit auf Diamond mit ner anst&auml;ndigen MMR. \r\n\r\nGespielt wird ca. Um 16:30 bis 21:30 Uhr. \r\n\r\nAddet mich einfach InGame.  (Name des Thread erstellers) \r\n\r\nMfG.","replies":[{"poster":"Avorox","date":"2017-09-05T00:34:15.553+0000","up_votes":1,"down_votes":0,"body":"Was hat denn nen neuer Account mit ner anständigen MMR zutun. Wenn du in Platin 5 anfängst und bis nach Dia climbst sollte dein MMR gut sein. Wenn du dasm it deinem P5 Account nicht schaffst wirst du das mit nem neuen auch nicht schaffen lol","replies":[{"poster":"Metins Vater","date":"2017-09-05T12:58:06.262+0000","up_votes":1,"down_votes":0,"body":"Falsch. Wenn die MMR im Arsch ist, weil man mal schlechte Tage hatte oder  schlechte Teammates, dann sinkt die MMR, was dafür sorgt, dass ich noch beschisserne Teammates kriege. Das verhindere ich in dem ich nen neuen Account hoch ziehe und versuche das erste Problem aus dem Weg zu gehen. \n\nWie gesagt, ist ja auch nicht dein Problem, oder? ;)","replies":[{"poster":"Avorox","date":"2017-09-05T18:30:18.137+0000","up_votes":1,"down_votes":0,"body":"Jo und schlechtere Gegner... Was ist das denn für ne Argumentation. Unter D1 ist nen schlechtes MMR nen unfassbar schlechtes Argument, weil weiter unten ein schlechtes MMR beduetet dass du gegen schlechtere Spieler spielst. In D1 akzeptier ich das, weil du weniger Punkte bekommst aber mehr oder weniger mit den gleichen Leuten spielst.\n\nNicht böse gemeint, aber das bringt dir absolut keine Vorteile im Bezug aufs climben.","replies":[]},{"poster":"vikisbae","date":"2017-09-05T15:27:57.429+0000","up_votes":1,"down_votes":0,"body":"Ich will ja nicht pushen, aber von P5 runter zu smurfen ist richtig unnötig. Egal, wie hardstuck du bist, mit ´nem neuen Account kommst du nicht höher. Du meinst du bist Allrounder... das wird wahrscheinlich das Problem darstellen.","replies":[]},{"poster":"Gordalf","date":"2017-09-05T13:06:07.479+0000","up_votes":1,"down_votes":0,"body":"Als p5er mit schlechter mmr spielte wahrscheinlich gegen und mit Gold. Genau diese ach so schlechten gold teammates wirst auch auf deinem smurf bekommen und zeigen müssen das du besser bist.\nWarum machst das nicht auf deinem main?\n\nDu umgehst damit Gold nicht.","replies":[]}]}]}]}