{"poster":"kernel panic","date":"2016-01-15T11:10:42.324+0000","title":"Dynamic queue e primi rage.","subforum":"Discussioni generali","up_votes":4,"down_votes":1,"body":"Su Reddit son gi&agrave; spuntati post di rage sulla dynamic queue, specialmente ad high-elo.\r\n\r\nLamentano che si stanno trovando team di pro che vengono matchati contro 5 solo players: https://www.reddit.com/r/leagueoflegends/comments/412dng/how_is_this_fair/\r\n\r\nIn pratica l&#039;idea della riot premade vs premade ad alto elo, dato il numero basso di player, non funziona.\r\n\r\nAnche il matchmaking sembra essere diventato squilibrato: http://i.imgur.com/x70XInn.png\r\n\r\nOra probabilmente ad elo basso questo non succeder&agrave; in quanto il bacino di giocatori &egrave; molto ampio, ma non credo che la Riot potr&agrave; rimanere sulla sua posizione senza cambiare qualcosa.","replies":[{"poster":"Dantazzo","date":"2016-01-15T11:16:09.610+0000","up_votes":5,"down_votes":0,"body":"Stesso problema di hots, come hanno risolto su hots? Hanno tolto il sistema.\nPersonalmente comunque ritengo che sia davvero idiota permettere di giocare in 5 premade in una coda diversa dal team ranked.","replies":[{"poster":"l  Ferox  l","date":"2016-01-15T11:53:15.393+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Dantazzo,realm=EUW,application-id=MJVj50Jw,discussion-id=L09fBkZx,comment-id=0000,timestamp=2016-01-15T11:16:09.610+0000)\n>\n\n> Personalmente comunque ritengo che sia davvero idiota permettere di giocare in 5 premade in una coda diversa dal team ranked.\n\nMi associo al pensiero del signore qua sopra.","replies":[{"poster":"NicogenFTW","date":"2016-01-15T20:23:20.154+0000","up_votes":1,"down_votes":0,"body":"signora*","replies":[{"poster":"Ste the ripper","date":"2016-01-16T09:33:57.639+0000","up_votes":1,"down_votes":0,"body":"Girltazzo 8)","replies":[]}]}]},{"poster":"NiraBlade","date":"2016-01-15T12:14:36.880+0000","up_votes":3,"down_votes":1,"body":"concordo, si chiama SOLOQ, non \"PORTAGLIAMICIQ\"; fosse per me eliminerei anche la duoQ, in modo che chi sale o scende lo fa solo grazie alle sue capacità","replies":[{"poster":"Martìcus","date":"2016-01-18T16:06:01.150+0000","up_votes":1,"down_votes":0,"body":"esatto anche per me,ma siccome c'è già il duoq\n \na sto punto meglio il dynamic","replies":[]}]}]},{"poster":"IrrationalNumber","date":"2016-01-15T12:12:53.860+0000","up_votes":3,"down_votes":0,"body":"Ma la togliessero sta cagata, gia' mi immagino che siccome finisco con 4 premade mi devon capitar contro premade 3 diamond che carryano altri plat.","replies":[]},{"poster":"Danioku","date":"2016-01-15T13:53:25.183+0000","up_votes":4,"down_votes":1,"body":"Questo QQ mi ricorda quello di un tizio che si lamentava di aver trovato un teemo troll in ranked dia2 e, scandalizzato, voleva che fosse bannato. Onestamente, a parte a livelli altissimi (quindi poche centinaia di persone su milioni), tutto questo discorso non ha senso, ergo è totalmente ininfluente per la salute del gioco di noi comuni mortali. \n\nSe il sistema crea disfunzioni ad elo altissimi, per quelle poche centinaia di persone, probabilmente Riot aggiusterà le cose in qualche modo ma, ripeto, sono casi limite che riguardano una % esigua di players, dell'ordine dello 0,000...1%.\n\nTrovo invece che il sistema sia un tentativo di risolvere tanti di quei problemi di cui ci si lamenta ogni giorno, troll, afk, flamers, tossici ecc... ecc.. adesso ci si potrà scegliere i compagni con cui giocare, il che mitigherà le esperienze negative con i compagni di squadra, almeno penso che questo sia uno degli obiettivi su cui Riot ha lavorato per mettere a punto il nuovo sistema e che andrà assolutamente verificato.\n\nOrmai è da un pò che gioco e devo dire che ad ogni cambiamento sono comuni le lamentele, i QQ, i ragepost ecc.. ecc... Dopo poco, ci si adatta ed anzi ci si trova all'interno di un gioco migliore senza nemmeno rendersene più conto, quindi,  prenderei tutto questo con le pinze ed aspetterei, intanto di vedere e provare, poi di testare per qualche settimana prima di arrivare a qualsiasi conclusione.....  e se ci fosse qualcosa fuori posto, sono sicuro al 100% che Riot sia in possesso di tutte le risorse e capacità per risolvere qualsiasi problema, non sono mica stupidi...","replies":[{"poster":"Tankerous","date":"2016-01-15T14:25:54.088+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=WECRY Danioku,realm=EUW,application-id=MJVj50Jw,discussion-id=L09fBkZx,comment-id=000c,timestamp=2016-01-15T13:53:25.183+0000)\n>\n> Questo QQ mi ricorda quello di un tizio che si lamentava di aver trovato un teemo troll in ranked dia2 e, scandalizzato, voleva che fosse bannato. Onestamente, a parte a livelli altissimi (quindi poche centinaia di persone su milioni), tutto questo discorso non ha senso, ergo è totalmente ininfluente per la salute del gioco di noi comuni mortali. \n> \n> Se il sistema crea disfunzioni ad elo altissimi, per quelle poche centinaia di persone, probabilmente Riot aggiusterà le cose in qualche modo ma, ripeto, sono casi limite che riguardano una % esigua di players, dell'ordine dello 0,000...1%.\n> \n> Trovo invece che il sistema sia un tentativo di risolvere tanti di quei problemi di cui ci si lamenta ogni giorno, troll, afk, flamers, tossici ecc... ecc.. adesso ci si potrà scegliere i compagni con cui giocare, il che mitigherà le esperienze negative con i compagni di squadra, almeno penso che questo sia uno degli obiettivi su cui Riot ha lavorato per mettere a punto il nuovo sistema e che andrà assolutamente verificato.\n> \n> Ormai è da un pò che gioco e devo dire che ad ogni cambiamento sono comuni le lamentele, i QQ, i ragepost ecc.. ecc... Dopo poco, ci si adatta ed anzi ci si trovar all'interno di un gioco migliore senza nemmeno rendersene più conto, quindi,  prenderei tutto questo con le pinze ed aspetterei, intanto di vedere e provare, poi di testare per qualche settimana prima di arrivare a qualsiasi conclusione.....  e se ci fosse qualcosa fuori posto, sono sicuro al 100% che Riot sia in possesso di tutte le risorse e capacità per risolvere qualsiasi problema, non sono mica stupidi...\n\nTi ricordi quando hanno cambiato l'UI? \n\n**\"ODDIO! QUESTA INTERFACCIA FA SCHIFO! LASCIO LOL!\" **\nNessuno ha lasciato LoL.","replies":[{"poster":"Frattaglia","date":"2016-01-15T15:28:53.395+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Tankerous,realm=EUW,application-id=MJVj50Jw,discussion-id=L09fBkZx,comment-id=000c0000,timestamp=2016-01-15T14:25:54.088+0000)\n>\n> Ti ricordi quando hanno cambiato l'UI? \n> \n> **\"ODDIO! QUESTA INTERFACCIA FA SCHIFO! LASCIO LOL!\" **\n> Nessuno ha lasciato LoL.\n\nIo mi ricordo di quelli che sono venuti sul forum a lamentarsi per la **skin gratis** che avevano avuto.\n\"Ho avuto come skin gratuita una di Teemo, cambiatemela o faccio un casino!\"","replies":[]},{"poster":"kernel panic","date":"2016-01-16T09:18:14.655+0000","up_votes":1,"down_votes":1,"body":"Una cosa è cambiare l'interfaccia, dove è solo questione di abitudine. \n\nInfatti se ricordi bene, per le prime settimane l'hud funzionava solo sulle normal non nell ranked.\n\nL'hanno introdotto dopo nelle ranked, per dare il tempo alle persone di abituarsi e fare dei cambiamenti (che infatti sono avvenuti).\n\nLa dynamic queue è un cambiamento enorme paragonato all'hud. Non si possono neanche mettere a confronto.\n\nhttps://www.reddit.com/r/leagueoflegends/comments/4155ng/riotlyte_in_the_next_hour_were_making_3_changes/","replies":[]}]},{"poster":"kernel panic","date":"2016-01-16T09:16:40.011+0000","up_votes":1,"down_votes":1,"body":"Hai ragione tu. QQ inutile..\n\nhttps://www.reddit.com/r/leagueoflegends/comments/4155ng/riotlyte_in_the_next_hour_were_making_3_changes/\n\nNon so da quanto giochi, ma la riot ha sempre fatto cambiamenti basandosi sulll'esperienza dell high elo e del competitive, perchè è solo lì che puoi avere dei feedback buoni, perchè è lì che si gioca a LOL, non nei meandri del gold o del platino o del low diamond.\n\n","replies":[]},{"poster":"Frattaglia","date":"2016-01-15T14:27:36.256+0000","up_votes":2,"down_votes":3,"body":"> [{quoted}](name=WECRY Danioku,realm=EUW,application-id=MJVj50Jw,discussion-id=L09fBkZx,comment-id=000c,timestamp=2016-01-15T13:53:25.183+0000)\n>\n> Se il sistema crea disfunzioni ad elo altissimi, per quelle poche centinaia di persone, probabilmente Riot aggiusterà le cose in qualche modo ma, ripeto, sono casi limite che riguardano una % esigua di players, dell'ordine dello 0,000...1%.\n\nIl mio parere è che i challenger/master che giocano unicamente soloQ saranno per forza di cose \"costretti\" a trovarsi un team (o comunque un gruppo con cui andare premade) se vogliono continuare a rimanere al loro livello.\nSecondo me non è una brutta cosa, lo rendono molto di più un gioco di squadra e la gente avrà meno motivi di piangere perché \"ah in bronzo/silver/gold/legno la gente non sa fare gioco di squadra e non salgo per questo!\".","replies":[]}]},{"poster":"lucanomax1994","date":"2016-01-15T11:31:59.328+0000","up_votes":1,"down_votes":2,"body":"***","replies":[{"poster":"Ste the ripper","date":"2016-01-15T11:55:11.621+0000","up_votes":3,"down_votes":0,"body":"C'è una differenza abissale tra challenger e lcs player, c'era jizuke che spiwgava che in challenger quando trovi 4 compagni lcs sai già che vincerai anche se fai schifo perché ti hardcarriano.\nOra pensa 5 challenger normaii che non comunicano contro 5 lcs player su ts, se già normalmente gli lcs played avrebbero stravinto così diventa una vera presa in giro.","replies":[]},{"poster":"Dr LouD","date":"2016-01-15T11:48:31.819+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Heart of Draenor,realm=EUW,application-id=MJVj50Jw,discussion-id=L09fBkZx,comment-id=0002,timestamp=2016-01-15T11:31:59.328+0000)\n>\n> Invece in high elo (diamond/master) non dovrebbe cambiare nulla. Appunto perche la gente si conosce e spesso i game sono sempre gli stessi.\n\nSiii.. certo..\nTu, povero cristo challenger che joina, ti trovi contro i FNC(team random) full premade, ti fai una risata e apri la mid al minuto 2.","replies":[{"poster":"lucanomax1994","date":"2016-01-15T11:55:23.540+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Dr LouD","date":"2016-01-15T11:57:50.182+0000","up_votes":2,"down_votes":0,"body":"Guarda che 1/20 dei Challenger streammano o/e sono conosciuti.","replies":[]}]}]}]},{"poster":"Firenheit","date":"2016-01-15T12:07:32.494+0000","up_votes":2,"down_votes":0,"body":"\"Violettes Team\", mentre sopra l'immagina è tagliata. \nSicuro che non sia una semplice team-ranked?\n\nQuesto a parte, sono dell'idea che le SoloQ, dando una valutazione strettamente legata al giocatore \"Io sono Gold, Magalli è Diamond, Frizzi è Silver\", bisognerebbe giocarle SENZA alcun tipo di premade. \nSarebbero partite ben più bilanciate, sia a livello personale, senza vantaggio/svantaggi dettati dai premade. \nSono solo opinioni personali, ma la vedo così, se la DuoQ la ritenevo un problema, non oso immaginare questa. \n\nCome ogni altra cosa, però, bisogna prima provarla per parlarne concretamente :)","replies":[{"poster":"Whommy","date":"2016-01-15T12:21:11.258+0000","up_votes":2,"down_votes":0,"body":"Non è un gioco singleplayer di squadra come uno FPS, l'alternativa valida è classificare solo il team ranked e lasciare il resto senza classificazione.\n\nQuello che dici:\n> Io sono Gold, Magalli è Diamond, Frizzi è Silver\n\nsuccede solo in Team Ranked dove non conta l'mmr del singolo\n\nLa limitazione di elo rimane la stessa presente nella scorsa season, il silver non può farsi boostare da un Diamante (smurf a parte)","replies":[{"poster":"Firenheit","date":"2016-01-15T12:31:43.126+0000","up_votes":1,"down_votes":0,"body":">Non è un gioco singleplayer\n\nMa i giocatori vengono trattati in tal modo e non è un segreto: *\"Sei solo un bronzino\"*.\n\n>'alternativa valida è classificare solo il team ranked e lasciare il resto senza classificazione.\n\nE su questo concordo al 100% :)","replies":[{"poster":"Whommy","date":"2016-01-15T15:43:48.976+0000","up_votes":3,"down_votes":1,"body":"Il soloq fino ad ora ha outclassato le altre modalità perché è quella che più si presta al grind, al casual player e quello abituale.\nPer chi non sapesse il termine qui la defiinzione Wiki di [GRIND](https://it.wikipedia.org/wiki/Grind_(videogiochi)) \n\nTralasciamo le enormi lacune del sistema di classificazione (ne parlo anche troppo) esso era oggettivamente più equo nelle prime season prima dell'inserimento del rank/division system.\n\nIl soloq è stato ricoperto con un velo di competitività approssimata creando una tossicità generale.\nIl messaggio che è passato negli ultimi 3 anni non è stato \"**giochiamo insieme per migliorare e salire di grado che è nell'interesse di tutti\" **(indipendentemente dal premade o matchmaking) come in tutti i giochi rpg, squadra....\nMa è passato il messaggio **\"gioco da solo, devo distinguermi dalla massa\"**.\nContando che siamo milioni di giocatori, di lingue diverse, culture diverse, ceti diversi, età diverse, religioni diverse, maturità mentali diverse e che  proveniamo tutti da esperienze/giochi diversi, questo messaggio \"dell'essere migliore di\" ha preso una piega tossica inevitabilmente perchè siamo esseri umani.\n\nA dimostrazione della comune frase che hai scritto: _\"Sei solo un bronzino\"_ e del mantra \"se sei forte, alla lunga sali\"\n\nIl Rank è più una fonte di discordia e stress che un simbolo di \"obbiettivo raggiunto\".\nAggiungiamo anche un MIX di community/streamer/youtuber/professionisti hanno seguito di pari passo il trend \"preferito dei giocatori normali\" incentivando il tutto.\n---\n\nStanno aggiornando l'esperienza di gioco orientandola al momento storico, seguendo le lamentele/proposte stesse dei giocatori fra forum , supporto e reddit (mai fatta una survey sul sito di Lol?)\n\nChe sia per diminuire la tossicità?\nChe sia un modo per migliorare l'esperienza di gioco?\nChe sia per Incentivare la formazione di squadre e ampliare il gioco con altri campionati/tornei?\nChe sia per attirare altra utenza quindi big money?\nPossiamo farne tante di domande simili, ma alla fine i campionati sono fra squadre...non fra giocatori presi a caso in platea, quindi benvenga il gioco di squadra in ogni sua forma (parere mio).\n\nLo avevo anche scritto mesi fa non è una novità, la riot ci sta pensando e lavorando da mesi e mesi sotto i nostri occhi, cosa che sembra sia passata inosservata\n\nbonus per i giocatori corretti (champ/skin/icona)\nbonus per i premade\nfine settimana doppi IP per i premade\nbonus IP casuali in premade\ntutto l'evento festa in piscina Incentivato per chi giocava premade\nchamp progettati e sinergici per l'uso premade (yasuo, bard, tham, kalista,...)\nmodifiche stesse al gameplay (obbiettivi, bonus del drago, bonus del baron, minibaron, argogranchio,...)\n\nora in season 6 anche:\nhextech craft\ncode dinamiche \nbonus per i premade\n\nè tutto un grande piano degli illuminati","replies":[{"poster":"Firenheit","date":"2016-01-15T17:35:26.148+0000","up_votes":1,"down_votes":0,"body":"Ma si, per come hai posto hai ragione. Spero solo che i primi momenti di transizione non siano così tragici.","replies":[]}]}]},{"poster":"Ste the ripper","date":"2016-01-15T12:30:00.072+0000","up_votes":2,"down_votes":1,"body":"Già perché l'attuale classificazione è completamente a caso no? Un mmr che valuta il singolo si adatta male a valutare un gioco di squadra.\nSono fatti talmente male i tier che ieri ho visto un diamond perdere conteo un bronzo... jk nessuno perde contro i bronzi :)\n\nSeriamente davanti ad un sistema così preciso nella valutazione con che coraggio puoi dire che non funziona?","replies":[]}]},{"poster":"kirchhoff","date":"2016-01-15T18:03:12.890+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Firenheit,realm=EUW,application-id=MJVj50Jw,discussion-id=L09fBkZx,comment-id=0004,timestamp=2016-01-15T12:07:32.494+0000)\n>\n> \"Violettes Team\", \n\nSquadra viola in tetesken","replies":[{"poster":"Firenheit","date":"2016-01-15T18:33:17.889+0000","up_votes":1,"down_votes":0,"body":"Chiedo venia allora :)","replies":[]}]}]},{"poster":"Il Re Gilgamesh","date":"2016-01-15T11:34:37.358+0000","up_votes":1,"down_votes":0,"body":"D'altro canto hanno perso solo 3 LP, e come dice l'autore del post, anche 30 minuti.\n\nEvidentemente allungheranno le code per non permettere che succedano queste cose, l'importante è che non succedano queste cose.","replies":[{"poster":"Whommy","date":"2016-01-15T11:39:41.734+0000","up_votes":1,"down_votes":0,"body":"In quell'ELO la media di attesa di una partita è 40+ min.","replies":[{"poster":"Il Re Gilgamesh","date":"2016-01-15T11:47:17.012+0000","up_votes":1,"down_votes":0,"body":"Ho capito ma cosa si può fare? Se i giocatori non ci sono non ci sono, le code sono lunghe per questo.\n\nAdesso che si possono fare pure premade da 3+ le combinazioni aumentano e le possibilità di trovare avversari adatti diminuiscono.\n\nPotrebbe essere, per esempio, che in quella partita fossero premade solo i Diamond ?","replies":[{"poster":"Whommy","date":"2016-01-15T12:06:15.989+0000","up_votes":2,"down_votes":0,"body":"Master+Challenger+D1 in NA sono in totale meno di 2000 persone....http://www.lolsummoners.com/stats/na\n\nConta i fusi orari dei vari giocatori, la possibilità di giocare, insomma...tutte le variabili che li portano ad essere ONLINE.\n\nQuanti giocatori sono connessi in contemporanea alle stesse ore a quell'elo? Meno della metà.\n\nSe l'algoritmo conta un bonus di MMR in caso di premade di 5 il sistema ha associato la squadra più vicina che rispettava i criteri di scelta/tempo in coda.\nSu 700 persone online fra 3 eli diversi, quante squadre premade di 5  potranno essere di elo vicino? pochissssssssime.\n\nDovranno solo dare una sistematina e trovare un compromesso più propenso all'equilibro che verso il tempo di attesa.\n\nPer loro è snervante in ogni caso, sia essere stompati da giocatori \"professionisti\" sia a dover aspettare 1h e mezzo per giocare.\n\n\nLato Elo basso (quindi da D1 in giù) questo problema non esiste, perchè il bacino di utenza è 1000 volte superiore le possibilita e le combinazioni di coda saranno conseguentemente più regolari","replies":[{"poster":"Il Re Gilgamesh","date":"2016-01-15T15:02:49.908+0000","up_votes":1,"down_votes":1,"body":"Credo tu abbia ragione, infatti era quello che dicevo anche io, secondo me non c'è molta alternativa, o così, o si aspetta.","replies":[]}]}]}]}]},{"poster":"Tankerous","date":"2016-01-15T12:44:08.269+0000","up_votes":3,"down_votes":1,"body":"Magari aspettiamo che il sistema venga testato bene, anziché prendere con le pinze giusto i casi che fanno comodo a noi per screditare la nuova champ select... Quanti game nella nuova modalità si sono disputati correttamente con la giusta composizione di premade/solo player? Nessuno che posta qualche immagine? Strano, eh.","replies":[]},{"poster":"AnDGames","date":"2016-01-15T12:43:48.798+0000","up_votes":3,"down_votes":1,"body":"si stava megio quando si stava peggio!\n\nprepariamoci, sarà sempre così.\ndel resto ci sono tante sfumature che non possono essere viste da un sistema:\nsono 5 premade che giocano da anni insieme nello stesso team e sono in ts\nsono 5 premade ma senza ts\nsono 5 premade che si sono invitati a caso tra la lista amici\nc'è una differenza immensa tra queste tre situazioni....come fai a tenerne conto?\n\ne, ripetendo una cosa già detta, come faccio a divertirmi da casual gamer in solo vs 5 premade in ts sincronizzatissimi?\nnon penso sia una buona idea mettere insieme due realtà così diverse.\n\nla soluzione:\n1- soloQ no premade\n2- soloQ aperta ai premade\n3- team ranked\n\nle così così sarebbero decisamente più bilanciate","replies":[]},{"poster":"SpideyPizza","date":"2016-01-15T13:52:20.073+0000","up_votes":2,"down_votes":1,"body":"\"parlare prima di provare\"....che cosa italiana","replies":[]},{"poster":"Zanarkand III","date":"2016-01-15T13:28:38.446+0000","up_votes":2,"down_votes":1,"body":"Ma secondo me basterebbe solamente sostituire la duow con una trioq... problema risolto, partite molto piu gestibili in 3, meno troll e afk ugualmente, e nessuna 4x premade che trolla","replies":[{"poster":"UltraLion","date":"2016-01-15T13:29:28.951+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=DTR Zanmato,realm=EUW,application-id=MJVj50Jw,discussion-id=L09fBkZx,comment-id=000a,timestamp=2016-01-15T13:28:38.446+0000)\n>\n> Ma secondo me basterebbe solamente sostituire la duow con una trioq... problema risolto, partite molto piu gestibili in 3, meno troll e afk ugualmente, e nessuna 4x premade che trolla\n\nSono d'accordo togliere le 5 premade e magari anche 4, problema risolto","replies":[]}]},{"poster":"kernel panic","date":"2016-01-15T12:54:38.320+0000","up_votes":2,"down_votes":1,"body":"Lol nel frattempo Hai ha postato uno screen di un game che ha giocato in SOLOQ con il TEAM e, dopo ben 25 minuti di partita la loro vittoria super easy gli ha fatto guadagnare 1 LP.\n\nUn altro tweet di Zion Spartan, dove hanno giocando in SOLOQ con i clg han vinto, sempre in SOLOQ, contro i tsm.\n\nLOL, la Riot ancora non s'è resa conto della cagata che ha tirato fuori.","replies":[]},{"poster":"Frattaglia","date":"2016-01-18T17:20:19.304+0000","up_votes":1,"down_votes":0,"body":"Opinioni alternative \nhttps://www.reddit.com/r/leagueoflegends/comments/41j9ij/ranked_has_become_more_pleasant/\n\nIn realtà vorrei solo capire se hanno aggiustato la parte dell'algoritmo che non fa distinzione tra la prima scelta e la seconda... in realtà la gente pare che si trovasse quasi sempre con il secondo ruolo scelto","replies":[]},{"poster":"Martìcus","date":"2016-01-18T16:04:59.459+0000","up_votes":1,"down_votes":0,"body":"il problema per me non sono mai stati i sistemi di gioco solo , duo o dynamic il problema sono i giocatori:flamer,feeders,trol,afk, ragequit etc,pick a caso,teemo top \n\nalmeno cosi posso scegliere con chi giocare e divertirmi con più di un solo amico alla volta\nranked team è difficile da organizzare \ntanto il sistema premade già c'è e spesso incasina già tutto il match \nio sono fiducioso","replies":[]},{"poster":"ChaosJuda","date":"2016-01-16T15:35:55.934+0000","up_votes":1,"down_votes":0,"body":"A me preoccupa più che altro che giocatori di Elo diamond in su, frustrati dalle lunghe attese comincino a smurfare rovinando di conseguenza il gioco degli elo bassi.","replies":[]},{"poster":"Vähn","date":"2016-01-16T09:47:28.544+0000","up_votes":1,"down_votes":0,"body":"Era normale ci fossero certi problemi, su HOTS ha fatto tanto discutere la scelta di un matchmaking simile per tanto tempo, aggravato anche dal minor bacino d'utenza, sono quindi dovuti passare ad una coda del tutto simile a quello di LoL.Se al basso elo il problema si può sentire poco se non nulla, vien difficile pensare a come potranno sistemare l'elo alto, aumenteranno l'attesa in coda per trovare un buon equilibrio? Aumenteranno il ventaglio di MMR con cui formare i due team? Penso sarà difficile trovare subito una soluzione che non porti qualche scontento.","replies":[]},{"poster":"Frattaglia","date":"2016-01-15T23:29:12.797+0000","up_votes":1,"down_votes":0,"body":"Già si parla di modifiche all'algoritmo a breve...\nhttps://www.reddit.com/r/leagueoflegends/comments/4155ng/riotlyte_in_the_next_hour_were_making_3_changes/","replies":[]},{"poster":"BigPatata00","date":"2016-01-15T20:56:39.039+0000","up_votes":1,"down_votes":0,"body":"Io l'avevo detto, quando gli skt e tutti gli altri team degli lcs gioccheranno 5 premade se la storia non cambia saranno dolori","replies":[]},{"poster":"Frattaglia","date":"2016-01-15T11:19:18.015+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Tempus Frangit,realm=EUW,application-id=MJVj50Jw,discussion-id=L09fBkZx,comment-id=,timestamp=2016-01-15T11:10:42.324+0000)\n>\n> Ora probabilmente ad elo basso questo non succeder&agrave; in quanto il bacino di giocatori &egrave; molto ampio, ma non credo che la Riot potr&agrave; rimanere sulla sua posizione senza cambiare qualcosa.\n\n\nÈ da quando l'hanno proposta che hanno detto che in caso il test non fosse stato soddisfacente* sarebbero tornati indietro...\n\n*Ovviamente sono loro a decidere cos'è per loro soddisfacente","replies":[]},{"poster":"UltraLion","date":"2016-01-15T13:04:30.930+0000","up_votes":1,"down_votes":3,"body":"Tanto non è mai stato equilibrato manco a livelli bassi, sempre stato un paciugo a caso, và bene così","replies":[]}]}