{"poster":"Peralith","date":"2017-11-11T18:32:53.980+0000","title":"Runen/LvlUp","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Hall&ouml;le\r\nEigentlich mach ich sowas nicht, in Foren reinschreiben, aber ich w&uuml;rde gerne ein Feedback zum neuen Patch geben.\r\nIch spiele LoL seit ungef&auml;hr einem Jahr und hatte vor kurzem mich endlich zurecht finden k&ouml;nnen mit den Runen und Masteries. Jetzt gibt es pl&ouml;tzlich nur Runen, die ich kaum verstehe. Neulinge haben es jetzt vielleicht schwieriger weil sie nichts anfangen k&ouml;nnen mit den Boni der jeweiligen Runen.\r\nRunenseiten hatte ich zwei, die die jeder seit Anfang zur Verf&uuml;gung hat. Ich hatte mir nie Runenseiten gekauft, denn es hatte gereicht eine AP und eine AD Seite zu haben (meiner Meinung nach, wenn man nicht viel ausgeben wollte). Masteries konnte man bis zu 20 machen ohne irgendwie was zu bezahlen. Ich hatte also je nach AD oder AP eine Runenseite und je nach Champ eine Masterie. Jetzt muss ich mit zwei Runen f&uuml;r vielleicht 10 am meist gespielte Champs klarkommen.\r\nWas mir in letzter Zeit oft passiert ist, ist dass wenn ein Gegner ordentlich Schaden macht, er meint es sind die neuen Runen. Es hei&szlig;t man solle seinen eigenen Spielstil finden mit den neuen Runen. Ich bin der Meinung es ist jetzt viel einfacher mehr Damage zu machen, Lauftempo zu ergattern etc pp. Nichts gutes f&uuml;r Neulinge und Noobs (wie mich eheh). Naja. W&auml;re sch&ouml;n wenn ihr ein Video rausbringt und das irgendwie erkl&auml;rt oder einfach die Masteries und die alten Runen zur&uuml;ckbringt T.T\r\nAchso und dann noch zu den Champions. Versucht nicht so viele Champs rauszubringen, das macht das Spiel f&uuml;r etwas l&auml;nger spielende interessanter, aber wer neu anf&auml;ngt hat Probleme mit so vielen Champs. Und Skins. Bringt nicht mehrere auf einmal raus, sondern vielleicht einzeln. Und dann lasst es einem Champ mehr Skins zu geben, sondern seid kreativ (zB Camille (nein, ich spiele nicht Camille)\r\n\r\nLiebe Gr&uuml;&szlig;e, ein gro&szlig;er Fan von League of Legends, der Angst hat, dass LoL genauso verbockt wird wie WhatsApp #nohate &lt;3","replies":[{"poster":"Nycaria","date":"2017-11-11T18:54:16.099+0000","up_votes":1,"down_votes":0,"body":"Das Problem, das man sich erst reinfuchsen muss bei den neuen Runen und seinen eigenen \"perfekten\" Runenbausatz puzzeln muss mit dem man selbst am Besten klar kommt, hat momentan jeder. Ich persönlich finde das neue System sehr viel angenehmer, da man viel mehr Möglichkeiten zur individuellen Anpassung hat und sich nicht strikt an bestimmte Vorgaben halten muss um nicht geflamet zu werden.\nZu den Runenseiten: Ich für meinen Teil komme mit einer Runenseite super klar, da man sie ja jetzt auch in der Champselect überarbeiten kann. früher hatte man das Problem, dass man im Optimalfall mindestens 3 Runenseiten gebraucht hat (AD,AP & Tank).\n\n>Naja. Wäre schön wenn ihr ein Video rausbringt und das irgendwie erklärt oder einfach die Masteries und die alten Runen zurückbringt T.T \n\nWas genau möchtest du denn erklärt haben? \n\nWas die Champs betrifft hast du natürlich recht, dass es für Neulinge etwas erschlagend wirken kann, dass es so viele verschiedene gibt. Allerdings musst du ebenfalls bedenken, dass Riot das Spiel nicht nur für Neulinge anpassen kann, da sonst viele langjährige Spieler zu anderen Games wechseln würden. Es ist die Abwechslung und Neuerungen die ein Spiel wie LoL am Leben halten, würde es keine neuen Champs geben oder auch Änderungen wie das Runensystem wäre es sehr schnell langweilig und es würden weniger Leute spielen.","replies":[]}]}