{"poster":"LordEdge","date":"2015-06-23T03:06:26.989+0000","title":"Master Yi seemingly never banned in low elo","subforum":"Miscellaneous","up_votes":1,"down_votes":0,"body":"Recently been playing ranked games and was on an extended losing streak playing as Kayle, Rengar, and or Lee Sin jungle when I had my preferred role, which was the majority of the time since jungle doesn&#039;t appear to be as desirable as a lane role. After a while of this continuing I decided to pick up Yi in the jungle as I played with him when I owned no more expensive champs. In the last four games I played as him I went 15+ kills consistently and had a positive KDA. He is almost never banned in games I have played and while being a selfish pick for the team with the current tanky jungle meta, appears to be a free win. Just looking for some tips or suggestions for more build ideas, and an explanation as to how you can shut down a snowballing Yi, due to his Q making him untargetable and allowing him to dodge nearly all hard CC if timed correctly. ","replies":[{"poster":"csm","date":"2015-06-23T03:08:37.148+0000","up_votes":5,"down_votes":0,"body":"Anyone who snowballs is op in soloq.\n\nThis isn't a secret.","replies":[{"poster":"BladeSensual","date":"2015-06-23T12:49:19.085+0000","up_votes":1,"down_votes":0,"body":"the best part is as rengar when u snowball. 2 bad hes not meta atm or i'd spam play just to kill everything","replies":[]}]},{"poster":"hin jai","date":"2015-06-23T03:27:13.897+0000","up_votes":3,"down_votes":1,"body":"Yea, i went to smurf in silver and just played Yi, they dont know how to react at all tehe","replies":[]},{"poster":"SEKAI","date":"2015-06-23T07:55:30.594+0000","up_votes":1,"down_votes":0,"body":"Why ban Yi in low elo when there are Nasus, Irelia and Fiora to watch out for over there?","replies":[{"poster":"Azirious Mistake","date":"2015-06-23T08:46:14.209+0000","up_votes":1,"down_votes":0,"body":"Fiora is feast-or-famine, Irelia same as Fiora but much less played, Nasus is the furry spawn of satan with no properly-defined counterplay because bonkers sustain.","replies":[{"poster":"SEKAI","date":"2015-06-23T09:59:11.038+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=FioraTheExplorer,realm=OCE,application-id=Ntey9fRZ,discussion-id=vkEO2u08,comment-id=00050000,timestamp=2015-06-23T08:46:14.209+0000)\n>\n> Fiora is feast-or-famine, Irelia same as Fiora but much less played, Nasus is the furry spawn of satan with no properly-defined counterplay because bonkers sustain.\n\nYi is just as feast-faminey as Fiora, considering they are pretty much the same thing with slight different emphasis.\n\nBut Fiora wrecks solo queue harder I say.","replies":[{"poster":"Chicken4dinner","date":"2015-06-24T07:09:31.613+0000","up_votes":1,"down_votes":0,"body":"Yi is really weak early game, once you catch him after he uses his Q he is finished","replies":[]},{"poster":"BladeSensual","date":"2015-06-23T12:49:49.605+0000","up_votes":1,"down_votes":0,"body":"dont ban my bae irelia","replies":[]}]}]},{"poster":"csm","date":"2015-06-23T12:53:03.629+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SEKAI,realm=OCE,application-id=Ntey9fRZ,discussion-id=vkEO2u08,comment-id=0005,timestamp=2015-06-23T07:55:30.594+0000)\n>\n> Why ban Yi in low elo when there are Nasus, Irelia and Fiora to watch out for over there?\n\nPeople in bronze can't stack a Nasus Q man.","replies":[]}]},{"poster":"Olee","date":"2015-06-23T09:05:24.665+0000","up_votes":1,"down_votes":0,"body":"You pick champs that have point and click CC brah.","replies":[]},{"poster":"LordEdge","date":"2015-06-23T03:13:48.465+0000","up_votes":1,"down_votes":0,"body":"Many champions snowball, but with the late game scaling from the devourer jungle enchant as well as an AD steroid and true damage, not to mention an ult that is insanely easy for getting chain kills since the duration is extended by kills or assist and resets cooldowns. It just seems a bit too much.","replies":[{"poster":"SEKAI","date":"2015-06-23T08:12:32.373+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=LordEdge,realm=OCE,application-id=Ntey9fRZ,discussion-id=vkEO2u08,comment-id=0001,timestamp=2015-06-23T03:13:48.465+0000)\n>\n> Many champions snowball, but with the late game scaling from the devourer jungle enchant as well as an AD steroid and true damage, not to mention an ult that is insanely easy for getting chain kills since the duration is extended by kills or assist and resets cooldowns. It just seems a bit too much.\n\nBecause a late game champ is supposed to be broken late once they gets their feed.\n\nIt's incredibly easy to shut him down, 1 CC, 1 burst, 1 corpse. Well it's simplified but you get the idea, this guy really blows up very quickly.\n\nWithout ultimate nearly everything he has is on extreme cool downs (very exploitable early and vulnerable to jungle duels and invades), meaning, he is the edge lord champ who thrives living on \"the edge\", combined with his weak early strong late nature it also means his risk factors is incredibly high, and thus so is his reward factor.\n\nHis Q is not reliable because \n\n1. It needs a target that is both in range, in vision and non ally to work, \n2. It needs to be off CD, which is high without him killing somebody (and already lvl 6),\n3. It's both his escape, dueling upperhand, burst, reposition and engage. If he uses it, he loses all other functions for up to 15-20 seconds if he isn't already fed as fk,\n4. And when used as an escape, Yi doesn't just go to his target, there is a delay before he reappears again after vanishing, which can work with and also against him.\n\nHis W is a channel spell that doesn't heal instantly, vulnerable to grievous wounds, interruptible, long CD and self stun himself in place.\n\nYi loses his E passive when it's on CD.\n\nHis R only grants immunity to slows, with a nice AS and MS bonus. It only rewards Yi when he is doing well, i.e. getting kills, otherwise he is nearly having no ultimate, but just a somewhat stronger normal spell.\n\nLet's not mention he countless anti-Yi strategy, champs and available builds out there.\n\nThere is a reason why besides the time when Yi went on his little rampage during the reign of AP Yi and FF, no one really have any issues with him except the low elo crowd. I really don't think he has too much or is too much to handle, at all.","replies":[]}]},{"poster":"Flood","date":"2015-06-23T05:28:37.773+0000","up_votes":1,"down_votes":0,"body":"Hard CC = Dead Yi.\nPick Naut, Thresh, Alistar, Lissandra, Vi, Leona, Maokai, Amumu...(continues to list every champion with a hard cc)\nNot rocket science people. Esp Gold and below.","replies":[]},{"poster":"LordEdge","date":"2015-06-23T03:29:01.297+0000","up_votes":1,"down_votes":0,"body":"I mean I can tell they have an idea of what to do against a Yi, but whenever Morg throws out a stun, or anyone for that matter, all I have to do is Q an enemy champion or minion and they are helpless.","replies":[]}]}