{"poster":"DerYolof1cker","date":"2017-01-07T09:41:49.725+0000","title":"Performance Probleme (GTX1070, 6600k, 64GB RAM,blabla)","subforum":"Hilfe & Support","up_votes":1,"down_votes":1,"body":"Hi Leute,\n\nwollte wissen ob jemand von euch vielleicht einen FIX f&uuml;r meine Problematik hat:\n\nIch spiele &uuml;berwiegend League of Legends auf meinem Rechner, welches ich mit meiner alten Grafikkarte ( GTX 970 KFA BLACK OC) problemlos spielen konnte ( ca. 500 FPS konstant). Habe jetzt vor kurzem meine Grafikkarte upgegraded (Gigabyte Geforce GTX 1070 G1 Gaming) und habe in Spielen wie League of Legends oder WoW (nur zum Testen installiert, weil in anderen Foren gelesen, dass da &auml;hnliches passiert) zum Start 300 bis 400 FPS aber nach einer Weile Drops unter 40. Und maxes von 110. Windows wurde frisch installiert nachdem ich nach dem Wechsel mit DDU trotzdem underperformant wahr. Runtimes und Treiber sind Up2Date. \nAuff&auml;llig ist, dass die Karte ziemlich untertaktet wenn ebenjene Spiele gestartet sind. Onboard Grafikkarte, Soundkarte, und Powerstates sind deaktiviert. In der NVID-Systemsteuerung ist V-Sync aus und alles auf Performance gestellt. Auch unter Windows-Powereinstellungen ist H&ouml;chstleistung aktiviert und alles was Energie sparen k&ouml;nnte, deaktiviert. League of Legends ist &uuml;brigens auf der SSD installiert, genau wie Windows. Spiele mit hoher Nutzlast wie Witcher 3 funktionieren ohne Probleme.\n\nMein Rig sieht aus wie folgt:\n\nMainboard: Gigabyte GA-Z170-HD3P\nProzessor: Intel Core i5 6600K (Alpenf&ouml;hn Brocken Eco K&uuml;hlung)\nRAM: 4x 16 GB G.Skill RipJaws V DDR4-3200 CL16\nGrafikkarte: Gigabyte nVidia GeForce GTX1070 G1 Gaming\nSound: X-Fi Titanium Fatal1ty \nSSD: Samsung 850 EVO M.2 250 GB &amp; Corsair Neutron XTi 240GB\nHDD: Diverse. \nODD: Asus BW-16D1HT\nPSU: Thermaltake Smart DPS G 700Watt 80Plus Bronze\nOS: Windows 10 Professional X64 auf der Samsung, Windows 10 Edu x64 auf der Corsair ( LoL ist auf jeder SSDs einmal vorhanden und einmal pro HDD)\n\nRuntimes sind &uuml;ber Serebys AIO Paket aktuell gehalten, Treiber &uuml;ber die Herstellerseiten (nVidia latest Hotfix).Chrome ist meist auf dem 2. Monitor aktiv, sowie Snip, Spotify, OBS Studio und eigentlich nichts weiter. Au&szlig;er AfterBurner zur Takt&uuml;berwachung und die Backgroundtasks von Creative.\n\nIch hoffe, dass mir hier jemand helfen kann, die Probleme zu l&ouml;sen. \n\nMit freundlichen Gr&uuml;&szlig;en \n\nDerYolof1cker\n\nEDIT:  LoL FPS Booster alle Schritte gemacht, LoL auch frisch repariert, neu installiert etc (also hextech repair tool), sowohl mit legacy als auch mit beta client. Einstellungen: 1080P Vollbild, alles maxed , VSYNC off.","replies":[{"poster":"neeeeeedit","date":"2017-05-01T22:43:21.965+0000","up_votes":1,"down_votes":0,"body":"Ich habe dasselbe Problem mit meiner GTX1070. Nach langem recherchieren liegt es wohl an der Idle GPU welche sich einfach nicht aus dem Ruhemodus raus bewegen will. Ich habe kein Tool gefunden mit welchem ich den GPU Takt mal auf Maximum stellen kann. Das einzige was ich kenne ist EVGA Precision, bei welchem die Kboost Funktion bei mir nicht funktioniert da ich eine Karte von ASUS habe. Bist du schon weitergekommen mit dem Problem?","replies":[]},{"poster":"Silberner Dolch","date":"2017-01-07T14:51:40.686+0000","up_votes":1,"down_votes":0,"body":"Also Probleme dürfte dein PC, theoretisch zumindest, nicht haben. Theoretisch solltest du Lol 5 Mal gleichzeitig spielen können.\n\nWo genau bei dir das Problem liegt, ist kaum festzustellen, ich würde allerdings folgende Theorien haben:\n\n1. Hast du den Prozessor per Board oder so vielleicht heruntergetaktet bzw. hast du Einstellungen am Board vorgenommen? Beispielsweise deine Lüfterkurve seltsam angepasst oder der Graka/Prozessor den Saft abgedreht? Eventuell waren diese Einstellungen schon voreingestellt\n\n2. Pack mal ein paar RamRiegel heraus und schaue ob es dann flüssiger Läuft. Eventuell ist einer der Riegel beschädigt und verursacht die Probleme\n\n3. Beobachte mal beim Spielen deine Temperaturen. Möglicherweise regelt dein Prozessor herunter. Überprüfe mal ob noch genug Leitpaste vorhanden ist und ob der Kühler auch richtig auf dem Prozessor aufliegt. Benutzte ab besten 2 verschiedene Tools zum auslesen der Temps. Sind die Werte ähnlich, liegt das Problem woanders.\n\n4. Ich persönlich habe dem Hersteller deines Netzteiles nur schlechte Erfahrungen gemacht. Eventuell liegt da das Problem\n\n5. Starte mal deinen PC ohne angeschlossene Graka nur mit dem Onboard Chip. Hast du da dann keine Probleme mehr, haben wir das Problem schon einmal eingegrenzt auf NT oder Graka\n\n6. Deine Festplattengeschichte ist auch noch Recht undurchsichtig. Du hast\n\n2mal Windows auf jeweils einer SSD?\nund dort dann auch überall jeweils Lol installiert. Also 2mal Lol+(Anzahl HDD)LoL?\nEventuell solltest du, falls du drauf verzichten kannst, das 2te Betriebssystem weghauen und nur ein System nutzen. Das ist zwar nur meine Persönliche Meinung, aber ich war noch nie Fan von mehr als einem OS auf einem PC. Die Stabilität des Systems leidet schon sehr darunter. \nEventuell kannst du es aber auch nur mal ausprobieren um zu checken ob das Problem dann behoben ist.\n\n7. Ein Defektes Teil kannst du natürlich niemals ausschließen. Bezogen auf deine Probleme habe ich das Netzteil im Verdacht, da ein defektes Netzteil gut zu deinen Problemem passen würde.\n\n\nAlles in allem halte ich die Punkte 4,5 und 7 für wahrscheinlich. Ist allerdings nur ein Erfahrungswert basierend auf meinen eigenen Erlebnissen.\n\n\nPS: Dein Rechner ist ziemlich krass^^ Mich wundert nur warum du keine 2te Graka nimmst. Für Full HD ist dein Rechner viel zu overtuned. WQHD ist locker möglich.\nPPS: WArum 64GB Ram?","replies":[{"poster":"DerYolof1cker","date":"2017-01-07T19:50:08.203+0000","up_votes":1,"down_votes":0,"body":"Kann hier mal kurz deine ganzen Vermutungen in einem Satz wiedersprechen: \nMit der 970 gehts überall problemfrei und auf highsettings. Die 1070 hat nur Probleme bei Spielen ohne Demand wie LoL oder WoW etc. \nDie 2 Windowsversionen haben was mit meiner Arbeit und meinem Studium zu tun. \nIch hätte das ganze hier auch prinzipiell vereinfachen können: Die GPU will für LoL einfach nicht aus dem IDLE raus und das will ich ändern :D \n2. GPU will ich keine, weil wegen Mikrorucklern durch SLI. und ich hab bezüglich des wqhd leider nur 2 1080p screens :D\n64 GB weil Videobearbeitung, menge Sachen zum kompilieren usw.. :)","replies":[{"poster":"Silberner Dolch","date":"2017-01-07T23:44:55.629+0000","up_votes":1,"down_votes":0,"body":"Meiner Vermutung nach, liegt das Problem an einer Einstellung in deinem Board/Graka. Wie und mit wie vielen Kabeln hast du deine Graka den angeschlossen? \nEventuell hast du bei den Nvidia Einstellungen etwas eingestellt, was sich  nicht gut mit manchen Spielen verträgt. Spontan würde mir die Displaymodus Einstellung einfallen.\nAnsonsten würde ich sagen, dass das Problem an der Graka oder deren Stromversorgung liegen muss. Mit der anderen scheint es ja zu funktionieren.\nFalls du alle Möglichkeiten ausschöpfen willst, installiere deine Windows Version neu. Eventuell ist dein Windows einfach Rip\nSo spontan würde mir sonst nichts wirklich sinniges einfallen.\n\nEin paar Gedanken die ich nicht zuende gedacht habe:\n-Bildschirmproblem?\n-Kabelproblem, falsch/nicht angeschlossen?\n-CD im CD-Laufwerk? (manchmal ist sowas echt heavy)","replies":[]}]}]},{"poster":"Yaxtee","date":"2017-01-07T10:17:00.304+0000","up_votes":1,"down_votes":0,"body":"Da du Win10 hast, schau doch mal [hier](http://boards.euw.leagueoflegends.com/de/c/hilfe-support-de/n5lUQEXV-windows-10-wie-schalte-ich-gamedvr-ab-was-ist-das) rein.\nAnsonsten ist dein PC mal gereinigt worden, vielleicht als du die neue Graka eingebaut hast? Es kann sein, dass er sonst zu warm wird, was im Laufe von Spielen zu Problemen führen kann. Hast du bei der neuen Graka den neuesten Treiber aktualisiert? Dieser sollte nicht älter als ein paar Monate sein :)","replies":[{"poster":"DerYolof1cker","date":"2017-01-07T10:21:17.962+0000","up_votes":1,"down_votes":0,"body":"Ja ist er, frische WLP und Staub entfernt, Temperaturen bewegen sich zwischen 30 und 45 Grad. GameDVR ist längst aus.","replies":[{"poster":"Homunculi","date":"2017-01-07T10:59:58.961+0000","up_votes":1,"down_votes":0,"body":"Hast du das anniversary update von win10 drauf?\n\nWARTE!?!?! 64GB RAM?!?!?!","replies":[{"poster":"DerYolof1cker","date":"2017-01-07T11:27:06.552+0000","up_votes":1,"down_votes":0,"body":"2x ja","replies":[{"poster":"Homunculi","date":"2017-01-07T11:56:30.626+0000","up_votes":1,"down_votes":0,"body":"mal eine Clientreperatur gemacht? Es gibt noch diese Bewegungsvorraussagegedöns, ich vergess immer wie das heisst.\n\nDas die GraKa sich bei LoL langweilt ist normal^^. Eigentlich sollten die Hintergrundprogramme keine Probleme machen, aber evtl. zickt das OBS rum. Mal probiert die Sachen nach und nach auszuschalten? Die Chipsatztreiber sind auch aktuell? Mal ein BIOS Update gemacht?","replies":[{"poster":"DerYolof1cker","date":"2017-01-07T12:06:42.172+0000","up_votes":1,"down_votes":0,"body":"Gemacht, ist aus, Alles Aktuell inkl. Updates. Auch schon mit allem auf aus ausprobiert.","replies":[{"poster":"Homunculi","date":"2017-01-07T15:38:45.992+0000","up_votes":1,"down_votes":0,"body":"Das einzige und letzte was mir jetzt noch einfallen würde, wäre den LoL Ordner oder die .exe im Antiviren Programm/Firewall frei zugeben. \n\nBedenke aber, Spiel exe ist eine andere als der Client, solltest du nur direkt Programme freigeben können.\nDie Spielexe bekommst du wenn du ein Spiel startest und dann im Taskmanager nach der anderen LoL exe suchst, dort mit rechtslick auf \"im ordner anzeigen\" klickst.","replies":[]}]}]}]}]}]}]}]}