{"poster":"oBonkerzz","date":"2015-12-08T22:09:56.479+0000","title":"Riots harsh ban cool downs","subforum":"[ARCHIVED] Miscellaneous","up_votes":2,"down_votes":4,"body":"I think the ban cool downs on this game is pretty harsh. Here is why.\n\nMy laptop crashes when I was loading into the game, then I JOIN BACK from the game about 8 minutes in. When the game finishes, I get five 20 minute queue cool downs?? Shouldn't I get at least like five 5 minute cool downs not 20?? It has gotten far as me and my friends not wanting to play because of this ridiculous cool downs. I even joined back into the game! Its not like I completely left gave up on it and left everyone with no JG. \n\nSo RIOT if you are reading this please fix this problem because it has happened to me too many times... \n\nAlso, is anyone else having this problem or am I being a whinny salty player?\n\nAlso, I have gotten bans in the past but not recently..","replies":[{"poster":"Riot Tantram","date":"2015-12-09T00:52:52.475+0000","up_votes":4,"down_votes":0,"body":"There are levels. \n\nThere is warning (must type 'I Agree'), 5 minute, 10 minute and 20 minute.\n\nYou must play enough games without being a leaver to get your account back into 'good standing'. If you are a frequent leaver it will stay at 20 minutes.","replies":[{"poster":"oBonkerzz","date":"2015-12-09T03:32:10.542+0000","up_votes":1,"down_votes":0,"body":"Ok thank you :)","replies":[]}]},{"poster":"LilQuacker","date":"2015-12-09T00:58:44.473+0000","up_votes":2,"down_votes":0,"body":"Ehhhh just take a nap bb","replies":[]},{"poster":"Makior72","date":"2015-12-08T22:12:22.637+0000","up_votes":2,"down_votes":0,"body":"You only go to 20 minute queue penalties if you frequently leave or dc from games in progress.","replies":[{"poster":"TheRoyalCrimson","date":"2015-12-08T22:32:52.999+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Makior72,realm=NA,application-id=cIfEodbz,discussion-id=koI7zMEj,comment-id=0000,timestamp=2015-12-08T22:12:22.637+0000)\n>\n> You only go to 20 minute queue penalties if you frequently leave or dc from games in progress.\n\nmy issue with the system is it doesn't have levels. its been a long time since ive left a game id say roughly 2 months. i had to leave a game the other day due to an unforscen reason and i immediately got 5 20 minute bans. it was a little over 1.5 -2 months since i left a game and i still get 20 minute bans right away? its a little ridiculous. they need to implement levels like csgo did  and that level drops after 1 week after the intial ban \n\nlvl1: 30 minute ban (ban for 30 minutes after the completion of that game) \nlvl2: 1 hour\nlvl3: 2 hours\nlvl4: 1 day ban\nlvl4: 1 week ban. \n\nthen it would drop 1 lvl per week with out any leaver level increase \nit would make a nice {{summoner:21}} between those who leave intentionally and those who leave due to problems \n\nnow this system would start how leagues current one does with it wont be immediate after your first leave. you'd get some type of warning like a 3 strike system then the leave levels start after those 3 strikes and would reset at 1 strike per week","replies":[]}]},{"poster":"CSDragon","date":"2015-12-09T18:14:17.414+0000","up_votes":1,"down_votes":0,"body":"I'm sorry to say this but you really shouldn't be playing PvP with your laptop in such a state.\n\nTo you it may be a minor inconvenience, but your team has to play without you for the first 5+ minutes of the game on a regular basis. By that time, you're team is gonna be too far behind to catch up.\n\nIdk if you're playing ranked or normals, but it doesn't matter either way, it's not the INTENTION of leaving that is punished, it's the act of making games unfair for your team on a consistent basis. Every time you crash, you're making 4 other people have a bad time because you queue up for 5v5 with a crud laptop.","replies":[]},{"poster":"Uiraya","date":"2015-12-09T03:33:43.998+0000","up_votes":1,"down_votes":0,"body":"If your laptop is shit enough to crash enough to get you to 20 minute queues, it might be time to consider an upgrade.","replies":[{"poster":"oBonkerzz","date":"2015-12-09T03:34:23.023+0000","up_votes":1,"down_votes":0,"body":"Yeah dw I am very soon! :)","replies":[]}]}]}