{"poster":"sseb19","date":"2016-08-15T19:04:08.695+0000","title":"Bronze III sucht Team für Teamranked(Silberniveau)","subforum":"Clans & Teams","up_votes":1,"down_votes":2,"body":"Hei,\r\nda mir League als solo Spieler keinen Spa&szlig; mehr macht bin ich nun auf der Suche nach einem Team um ein paar Teamrankeds zu spielen.\r\nZu mir: Ich bin18 Jahre, BronzeIII und Jungle main, kann jedoch problemlos auf Adc/Midlane ausweichen. \r\nZu euch: Ihr solltet euch anst&auml;ndig benehmen und bei einer Niederlage nicht flamen. Au&szlig;erdem solltet ihr spielerisch ca auf Silver Niveau sein;)","replies":[{"poster":"Práedyth","date":"2016-08-15T22:07:36.364+0000","up_votes":3,"down_votes":1,"body":"wenn du auf silber niveau spielen würdest wärst du auch locker silber. ich find es irgendwie echt dreist selber schlechter zu sein als die mates die man sucht. das ist wie als wenn ich sagen würde \"suche nach master smurf der mich carried damit ich meine season rewards bekomme\"","replies":[{"poster":"sseb19","date":"2016-08-15T23:09:08.139+0000","up_votes":2,"down_votes":2,"body":"Verstehe grade nicht wieso du so hatest , ich will mich ja nicht auf gold carrien lassen sondern ein rankedteam zum Spaß haben . Und es gibt vielleicht Leute die pech haben mit ihren Teams und die schonmal besser waren ,dann gedropped sind und einfach nicht rauskommen, auch wenn sie gut spielen, so wies bei mir häufig der Fall ist. Außerdem such ich einfach n Team das auch weiß wie man als team spielt, in bronze wissen die spieler häufig einfach noch nicht wie man richtig als team zusammenspielt , groupt, teamfighted usw.(no hate).","replies":[{"poster":"Práedyth","date":"2016-08-16T00:40:11.515+0000","up_votes":2,"down_votes":0,"body":"1. pech mit teams: sowas gibts einfach nicht. du bist ganz genau in der elo in die du gehörst. ok vielleicht nicht wenn du erst 20 rankeds gespielt hast aber nach ca 100 bist du dort. und auch wenn du dropst kommst du da easy raus wenn du besser bist als die spieler dort. ich hasse es einfach wenn leute sich für was besseres halten als sie sind\n2. wenn kein bronze spieler im team spielen kann kannst dus ja auch nicht nachdem du ja bronze bist","replies":[{"poster":"sseb19","date":"2016-08-16T10:56:25.524+0000","up_votes":1,"down_votes":0,"body":"seh ich jetzt anders wenn man nur afks und trolls hat,aber naja deine meinung:D","replies":[{"poster":"Práedyth","date":"2016-08-16T20:28:58.578+0000","up_votes":1,"down_votes":0,"body":"sry aber ich glaub n bronze game könnt ich 2v5 machen wenn ich wirklich gut spiel","replies":[]}]},{"poster":"Gesterm2xGekackt","date":"2016-08-16T11:42:35.984+0000","up_votes":1,"down_votes":0,"body":"Ich saß seeehr lange in Bronze IV fest und als ich dann eine Serie hatte bin ich sehr einfach auf Silber gekommen und wenn es so weiter geht bin ich auch bald Gold... Natürlich habe ich mich seit dem verbessert trotzdem gibt es meiner Meinung nach die Elohell","replies":[]}]},{"poster":"Cpt Kinny","date":"2016-08-16T00:04:52.550+0000","up_votes":2,"down_votes":0,"body":"Die LoL-Community, wie man sie kennt und liebt ^^.","replies":[]}]}]},{"poster":"Cpt Kinny","date":"2016-08-15T21:57:24.132+0000","up_votes":1,"down_votes":0,"body":"Hey sseb19,\nIch kann dir ein TEam in meiner Communiyt anbieten, weitere Info's kriegst du hier: http://boards.euw.leagueoflegends.com/de/c/clans-teams-de/70xQ4sU4-advanced-tactics-sucht-euch-als-verstaarkung\noder auf unserem TS in einem Gespräch mit einem unserer Supporter: \nip: advanced-tactics.community-ts.eu\n\nAuf Bald {{summoner:32}} \n\nAT Kinny","replies":[]}]}