{"poster":"xDarkKnight","date":"2016-06-07T07:13:14.597+0000","title":"Mas contenido en el Perfil","subforum":"Discusiones sobre el Cliente","up_votes":13,"down_votes":1,"body":"Estar&iacute;a bueno que se agreguen m&aacute;s cosas al perfil:\r\n\r\n1-Todas las maestr&iacute;as de los campeones que utilicemos ,no solo los 3 principales.\r\n\r\n2-Posibilidad de cambiar el fondo del perfil por el Campe&oacute;n o Skin que prefiramos \r\n\r\n3-Esto no tiene que ver con el Perfil , pero tambi&eacute;n estar&iacute;a bueno que pudi&eacute;ramos poner el Cliente de LoL en modo Pantalla Completa.{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Cheymiless","date":"2016-06-07T13:57:06.546+0000","up_votes":1,"down_votes":0,"body":"lo del perfil esta bueno, pero los que gastaron para comprar el Ezreal pulso de fuego o otras skins definitivas obtendrian una desventaja por la compra...  ya que eso te da un marco o logo (no se bien que era xD).","replies":[{"poster":"Cuchuflito16","date":"2016-06-07T14:01:42.534+0000","up_votes":5,"down_votes":0,"body":"En el cliente ALFA te pone una animación del skin si tenes el icono de invocador de esa skin definitiva.\nLo que haría yo seria dejar elegir si el fondo del perfil con el campeon/skin que quieras SIEMPRE Y CUANDO la/lo tengas en propiedad.","replies":[{"poster":"Cheymiless","date":"2016-06-07T14:04:02.231+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Cuchuflito16,realm=LAS,application-id=VG4wEFg7,discussion-id=M0UYIaFu,comment-id=00010000,timestamp=2016-06-07T14:01:42.534+0000)\n>\n> En el cliente ALFA te pone una animación del skin si tenes el icono de invocador de esa skin definitiva.\n> Lo que haría yo seria dejar elegir si el fondo del perfil con el campeon/skin que quieras SIEMPRE Y CUANDO la/lo tengas en propiedad.\n\njustamente estaba viendo eso, estaria bueno que te deje el de la skin que poseas.","replies":[]},{"poster":"LoLGas5","date":"2016-06-07T18:06:37.785+0000","up_votes":1,"down_votes":0,"body":"Lo probe y esta bueno eso (ver a mi dj sona animada <3)","replies":[]}]}]},{"poster":"Cuchuflito16","date":"2016-06-07T14:06:51.167+0000","up_votes":3,"down_votes":0,"body":"Otra cosa que haria seria en el menu de nuestros campeones, poder elegir para verlos dependiendo si ya sacamos o no caja hextech con el  (incluso creo que aplicaría alguna marca o algo para la seleccion de campeón que indique lo mismo)","replies":[{"poster":"Benaiu","date":"2016-06-08T00:24:52.101+0000","up_votes":1,"down_votes":0,"body":"te pone un marco distinto, prestá atención, en tal caso faltaría un filtro de orden, como mucho","replies":[{"poster":"Cuchuflito16","date":"2016-06-08T03:26:19.982+0000","up_votes":1,"down_votes":0,"body":"Exacto, un filtrito de orden para poder ver los que ya nos han dado cajas (o los que no).\nY se me ocurrió mientras hacia ese mensaje anterior pero me copó la idea esta de alguna identificación en la selección de campeón, asi si estamos en normales y queremos cajas tenemos mas claro a quien usar (?","replies":[]}]}]},{"poster":"t1ncho","date":"2016-06-10T22:29:23.065+0000","up_votes":1,"down_votes":0,"body":"A mi parecer al perfil en esta \"alfa\" le falta todo lo del cliente actual, las runas,maestrias, historial y demas.. nose si solo falta porque esta en fase alfa o si sera asi el nuevo cliente.. pero en caso de que no los agregaran,  a mi punto de vista deberian estar.\nLo demas del cliente lo veo bien, tuve problemas con el chat y borrar los chats pero reporte el error y aun no lo he vuelto a tener.\nsaludos","replies":[]},{"poster":"HibrYd","date":"2016-06-07T20:00:36.067+0000","up_votes":1,"down_votes":0,"body":"+1 Con lo de poder cambiar la imagen del perfil. Solo se puede cambiar para los que tenemos skin definitivas. Una idea buena es colocar el splash del campeón que el jugador tenga con mayor rango de maestría. Claro que un seleccionador a gusto sería algo fabuloso.","replies":[]},{"poster":"LoLGas5","date":"2016-06-07T18:11:31.621+0000","up_votes":1,"down_votes":0,"body":"Esta bueno que muestren un poco mas de campeones o otras estadisticas como las de ranked o campeones mas usados/mejor winrate.\nY deberian quitar los iconos de ranked 3v3  y 5v5 (en equipos) ya que no existe mas eso. Y deberian agregar solo 2 iconos de ranked: clasificatoria dinamica y clasificatoria soloQ (para los que juegan selección oculta).","replies":[]},{"poster":"Slashiiito","date":"2016-06-07T08:57:37.101+0000","up_votes":1,"down_votes":0,"body":"eso estaría bueno,de poder cambiar el fondo del perfil,por la skin del campeón que queramos :)","replies":[]}]}