{"poster":"Antitomate","date":"2016-07-29T19:39:47.592+0000","title":"Gibt es überhaupt eine Möglichkeit aus Bronze mit SoloQ heraus zu kommen?","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":16,"body":"Hallo,\nIch bin jetzt noch Bronze 2 (0LP) aber bald Bronze 3. Ich schw&ouml;re das ich verliere liegt nicht an mir  (meistens) sondern an AFK, Troll, Feeder oder Leuten die nicht wissen was sie wirklich in einem Teamfight machen sollen. \n\nAlso kann man aus Bronze herauskommen mit SoloQ oder ist das Mission Impossible?","replies":[{"poster":"Maexle","date":"2016-07-29T20:58:35.265+0000","up_votes":7,"down_votes":0,"body":"Dieser Thread zeigt irgendwie, dass du der klischeehafte Bronzespieler bist. Du schiebst alles auf deine Mitspieler und es liegt natürlich nicht an dir...  Das Beispiel das du angibst zeigt schon, dass du nicht wirklich der Beste bist. In den meisten Situationen **muss* ein ADC die Tanks angreifen, wenn diese ihn fokussieren. Meistens hat er auch gar nicht die Möglichkeit, die gegnerischen Carries zu fokussieren, da sie zu weit weg sind und er komplett seine Positionierung aufgeben müsste und wahrscheinlich selbst instant tot wäre.\n\nWenn man ein bisschen vom Spiel versteht ( und es einigermaßen umsetzen kann), kommt man ziemlich easy raus.\n{{champion:17}}","replies":[]},{"poster":"Silnex","date":"2016-07-29T19:47:27.290+0000","up_votes":5,"down_votes":0,"body":"die aussage die du machst ist kompletter schwachsinn adc geht auf tank JA NATÜRLICH Geht der adc auf denn tank weil er ja nicht einfach rein gehen kann also du hast dir mit der aussage schon selbst wiedersprochen und beweißt das du in deine elo gehörst","replies":[]},{"poster":"Balmung","date":"2016-07-29T19:53:59.526+0000","up_votes":4,"down_votes":0,"body":"Wer 300 Spiele in Bronze verbringt, und sich darüber beschwert dort nicht hinzugehören, macht etwas falsch. Entschieden falsch.\n\nEin Inventar voller Boots of Swiftness in einem Spiel und deine Einsicht, der Fehler könne nicht bei dir liegen sagt aber schon aus, dass du dem ragen (und damit höchstwahrscheinlich auch flamen) nicht abgeneigt bist - ergo gerne viel Zeit verplemperst.\n\nDa fehlt es dann ja schon an der Grundlage irgendwelche Hilfe anzunehmen...ist der Thread also nur zum Dampf ablassen oder ist dir ernsthafte und konstruktive Kritik nicht zuwider?","replies":[{"poster":"Antitomate","date":"2016-07-29T20:21:29.385+0000","up_votes":1,"down_votes":5,"body":"Ich verkaufte wo das Spiel vorbei sie an unserem Nexus und ich tot war meine Items und habe boots gekauft aus Spaß. kennst du aber bestimmt nicht.","replies":[{"poster":"Balmung","date":"2016-07-30T01:02:46.861+0000","up_votes":3,"down_votes":0,"body":"Stimmt - du machst das ja auch in so vielen Spielen. In 21 Tagen in exakt 2 Spielen - einmal 6 Tears, einmal 6 Boots.\nIn beiden Spielen liefs nicht prickelnd - aber hey, man hat ja positive Stats und daher sicher den Sieg verdient gehabt...wenn da nicht die schlechten Teammates gewesen wären, die so viel gefeedet haben das man das \"nie und nimmer\" carrien konnte...\n\nSorry, aber die Ausrede \"ich mach das aus Spaß\" zieht nicht. Auch deine provokante Art ist höchstwahrscheinlich einfach nur ein Versuch die eigene, mangelnde Einsicht zu kaschieren.\nSieh's ein: So wie du dich anstellst und spielst gehörst du einfach nach Bronze, sonst wärst du nicht nach 300 Spielen noch dort.\nFalls die Einsicht irgendwann eintritt wäre der erste Schritt schon mal getan und man könnte noch mal darauf eingehen.\nOffen gesagt zweifle ich jedoch stark daran, das dies eintritt.","replies":[{"poster":"Antitomate","date":"2016-07-30T02:49:08.537+0000","up_votes":1,"down_votes":2,"body":"Du steigerst dich ganz schön in die Sache hinein. Aber nicht auf meine eigentliche Frage was traurig ist aber zum Glück gibt es auch Leute die nützliche Tipps geben.","replies":[{"poster":"Balmung","date":"2016-07-30T10:28:43.284+0000","up_votes":2,"down_votes":0,"body":"...sprach derjenige mit dem Heulthread ala \"ich droppe in der einfachsten Liga dieses Spiels immer weiter aber bin nicht selbst dran schuld!\".","replies":[]}]}]},{"poster":"Maexle","date":"2016-07-29T20:53:43.755+0000","up_votes":1,"down_votes":0,"body":"Wahrscheinlich eher aus Wut oder ähnlichem. \n{{champion:17}}","replies":[]}]}]},{"poster":"III Jaeger III","date":"2016-07-29T19:55:06.493+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"D4RKEVA","date":"2016-07-29T20:08:28.446+0000","up_votes":2,"down_votes":1,"body":"Es sind ca 1% \"gute spieler(ab dia 3+)\n\n\"Gute spieler\" sind sonst noch ab plat (top 10%) alles unter platin suckt einfach balls\n\n\n\nWenn du 5 aus 10 carrien würdest hättest du ne 75% winrate ... denn die anderen währen relativ even.\nHast du aber nicht und redest dir das bei wins nur ein ^^\n\n\nWenn du im team deutlich mehr gewinnst kann das 2 sachen bedeuten:\n\nEntweder du bist ein teamspieler(unwahrscheinlich in der elo)\nOder du wirst gecarried ...\n\n\n\nNope smurfs sind eig relativ selten, und silber spieler sind nicht wirklich gut, so ab silber 2 fängt man an low/mid bronze zu stompen... Und es sind echt DEUTLICH weniger smurfs.\n\n\nMein tipp auch allg wegen \"teams\";\n\nSpiel normals bis du nette leute findest, die haben meistens nen stamm ts, spiel mit denen und freunde dich an.\n\nAußerdem kannst du dich in not als in ruhiger umgebung lovker verbessern","replies":[{"poster":"III Jaeger III","date":"2016-07-29T20:20:25.457+0000","up_votes":1,"down_votes":4,"body":"***","replies":[{"poster":"Humpelstilzche","date":"2016-07-29T20:51:19.426+0000","up_votes":4,"down_votes":0,"body":"> 5 von 10 spielen sind bei mir 50 %\n\nDu vergisst, dass man Spiele nicht nur dann gewinnt, wenn man selbst carriet. Wer 50% seiner Spiele selbst carriet gewinnt weitaus mehr als 50% seiner Spiele. \n\n> schau dir mal an was du da von mist schreibst schon wenn du so anfängst dich um 25 % zu verrechnen bei nur einer zahl die kleiner ist als 100 dann bitte lass es und fang nicht zu kommentieren. bitte lass es einfach.\n\nWäre nett wenn du dich dafür entschuldigen würdest, schließlich warst du es der hier nicht weit genug gedacht hat. Wäre gut wenn du in Zukunft ein wenig länger nachdenkst, bevor du dermaßen großzügig Kritik austeilst und die geistigen Fähigkeiten anderer Leute in Frage sellst, insbesondere wenn der Denkfehler bei dir liegt. \nWer im Glaushaus sitzt....","replies":[{"poster":"D4RKEVA","date":"2016-07-29T21:10:09.451+0000","up_votes":1,"down_votes":0,"body":"Thx humpel :3\n\nHier für den langen text und die mühe {{item:2009}}","replies":[]}]},{"poster":"D4RKEVA","date":"2016-07-29T21:10:37.803+0000","up_votes":1,"down_votes":0,"body":"Siehe Humpel","replies":[]}]}]}]},{"poster":"Groovy Kuzco","date":"2016-08-01T08:54:38.489+0000","up_votes":2,"down_votes":0,"body":"So, ich trage nun auch mal meinen Senf dazu bei.\n\nNatürlich ist es möglich, aus Bronze rauszukommen. Aber die meisten Bronzespieler gehen davon aus, dass sie immer nur schlechte Teammates vorgesetzt bekommen. Sie selbst haben aber weder das Spiel wirklich verstanden noch setzen sie sich mal wirklich mit den eigenen Fehlern auseinander. \n\n-----------------------------------------------------------------------------\n\nMal ein paar Klassiker, die ich immer wieder erleben darf:\n\n-> \"OMG, No SS, Noob!\" sagt der Toplaner, der schon zum 4 mal starb. Nicht gewardet, zu hart gepusht, keine Mapawareness. Man pingt so oft es geht SS, aber mal ist man selbst woanders und hat dazu keine Zeit. Deshalb sollte man mindestens alle 5-8 Sekunden auf die Minimap schauen. Dann sieht man, wo wer in welcher Lane fehlt.\n\n-> \"OMG, Noob, next Time follow!\". Man ist nicht immer dazu gezwungen, zu follown. Der gegnerische Midlaner pusht hart die Lane und roamt dann auf die Botlane. Meine Misspings, die Mapawareness der Botlane inklusive deren Wards sollten diesen Roam erfolglos werden lassen. Botlane soll sich vom Tier 1 Tower der Gegner zurückziehen! Die gegnerische Mitte verliert durch rechtzeitigen Rückzug der Botlane Farm und EXP und ich konnte nebenbei noch meinen Tower deffen. Natürlich muss man die Situation immer entsprechend beurteilen können, ab wann man followt und wann nicht. Aber wenn die Botlane sich nicht zurückzieht und nicht wardet, ist sie selbst Schuld, wenn sie stirbt.\n\n-> \"Jungler, No Ganks. Report!\" Diese Leute haben einfach absolut kein Plan.\n\n-> \"Thanks for Feeding Wukong!\" beschweren sich die Mates über den verbündeten Top-Laner, nachdem besagte Mates bereits das siebte oder achte Mal gestorben sind. Auch diese Leute haben einfach keine Ahnung. Keine Ahnung davon, wie man mit Rückstand umgeht. Nein, man geht nicht noch mehr in die Offensive, sondern erst mal in die Defensive, farmt, läuft nicht ohne Vision alleine rum und wartet Fehler vom gegnerischen Team ab, die aufgrund Ihres Vorsprungs eventuell übermütig werden und spamt nicht ständig unberechtigte Surrendervotes.\n\n-----------------------------------------------------------------------------\n\nIch habe ca. zwei Monate, nachdem ich LoL intensiv anfing zu spielen, meine Placements gemacht und wurde Bronze 2 eingestuft. Absolut berechtigt. Hab einfach gesuckt. Seit dem habe ich keine Rankeds mehr gespielt, weil mein Internet damals zu unzuverlässig war. Jetzt habe ich ein absolut stabiles Netz und habe vor einer Woche angefangen mit Rankeds. Hab mich in der Woche relativ schnell auf Bronze 1 hochgespielt (Bisher keine krasse Leistung, aber trotzdem) und ich bin mir sicher, dass es bis Silber auch kein großes Problem wird.\n\nHab in meiner Ranglistenlosen Zeit 800 Normals bestritten, unzählige Guides zu Champions und verschiedensten Themen angeschaut und das hat geholfen. Ebenso hilft es, sich auf ein paar Champions zu konzentrieren und nicht wild durcheinander irgendwelche Lolcounter.com-Champs zu picken, deren Mechanik man nicht gepeilt hat. Setz mir als Ahri-Main (120k EXP) eine Lolcounter-LeBlanc vor, die gerade mal die Grundmechaniken von ihr kennt, aber gehört hat, dass sie DER Ahri-Counter ist und ich werde sie trotzdem zerstören. :)\n\nDas wars erst mal von mir. \n\nSorry für den langen Text.","replies":[]},{"poster":"Shad0wM0on","date":"2016-07-29T23:33:57.764+0000","up_votes":1,"down_votes":0,"body":"Das beste was du machen kannst = junglen.\n\nspiel meta picks (kha zikx usw) ganke oft, farme erst wenn du sicher bist das du nicht ganken musst. schau dir guids und streams an ´. lerne den champ. gewinne gg","replies":[{"poster":"SeaHorseCalamity","date":"2016-07-30T11:07:05.447+0000","up_votes":2,"down_votes":0,"body":"Das mit den Metachamps ist immer so eine Sache...\nDer einzge Vorteil, den ich durch Metapicks in Bronze sehe ist, dass deine Teammates dich nicht sofort dafür flamen.\nMeta ist aber kein magisches Rezept für den Sieg.\nMit nem Champ, der einem liegt kann man oft schneller Erfolg haben als mit nem Champ der gerade Meta ist und 2 Wochen später nen Nerf bekommt. Dann musst du nämlich nen neuen Metachamp lernen....\nIch würde eher empfehlen einen Champ zu suchen, der einem Spaß macht und der einem liegt.\nDen dann lernen und du hast schneller das nötige Niveau erreicht um auf Bronze zu entkommen.\n\nMetachamps greifen oft erst ab einem gewissen Spielniveau.... und wenn ich meine Games ansehe, habe ich das noch nicht erreicht.\n(Ich wurde heute im Ranked beinahe von nem AP-Jax Mitte besiegt, weil der einigermaßen wusste, was man mit Jax so anrichten kann.)","replies":[]}]},{"poster":"Schlachtenhorn","date":"2016-07-29T20:10:50.921+0000","up_votes":1,"down_votes":0,"body":"Wenn man den vielen Threads hier glauben mag, müsste in Bronze 90% flamer, feeder und andersspieler (sogenannte trolls) geben und die restlichen 10% (die anscheinend etwas können) im Gegnerteam.","replies":[{"poster":"Antitomate","date":"2016-07-29T20:23:26.455+0000","up_votes":1,"down_votes":3,"body":"Ja ist ja auch so außer du bekommst mal die 10%","replies":[{"poster":"Maexle","date":"2016-07-29T20:52:49.336+0000","up_votes":2,"down_votes":0,"body":"Nein, es ist nicht so... Es sei denn **du** zählst dich dazu und bist vielleicht in 10% deiner Spiele gut ^^\n{{champion:17}}","replies":[]}]}]},{"poster":"Ordo Haereticus","date":"2016-07-29T19:44:17.436+0000","up_votes":2,"down_votes":0,"body":"Möglich: Ja, wenn du selber eine gute Performance hast auf jeden Fall.\n\nWenn du wirklich so viele Probleme mit Spielern hast, welche absichtlich Spiele sabotieren lade doch eigene Spieler in die DynamicQ ein :)","replies":[]},{"poster":"Zulwar","date":"2016-08-01T10:30:18.383+0000","up_votes":1,"down_votes":0,"body":"Ob es möglich ist, aus Bronze zu kommen? Ja dies ist möglich, aber nicht unbedingt einfach.\n\nUm das ganze besser zu erklären, erzähle ich kurz meine Laufbahn in LOL.\n\nIch spiele seid Season I LOL und befand mich auch seid her in Bronze.\nDa bis ende Season III für mich Ranked noch zu Toxic war, habe ich nur meist wenige Rankedspiele in einer Season gespielt.\nSeid ende Season III somit spiele ich vermehrt Ranked und versucht mich zu verbessern. \n\nSeason IV (Bronze II-III) habe ich mir meine Rolle festgelegt, Season V (Bronze I) war ich MF OTP und habe meinen Farm und meine Tode verbessert. \n\nSeason VI habe in Bronze V gestartet und habe mich durch spielen von Meta-champs nach Bronze II gespielt. Dann habe ich mit einem Coach gesprochen und habe dort den Tipp bekommen, Ashe und Lucian in Bronze zu spielen. Ashe halt, da sie sehr leicht zu lernen ist und Lucian, da er zu der Zeit halt als OP galt. Da ich unmobile Champions liebe und Ashe eh zu meinen Favoriten zählt, habe ich nur noch Ashe gespielt ca. 2 Monate lang. Dann war ich Silber V. Dann habe ich nochmal mit einem anderen Coach gesprochen, um eine andere Meinung mir einzuholen und Fehler gesagt zu bekommen. Naja und derzeit bin ich Silber IV und es ist noch kein ende in Sicht.\n\nWas bringt dir jetzt meine Geschichte?\nErstmal nicht viel. Was ich dir aber noch mit auf den Weg geben möchte, ja du kannst es schaffen und was du feststellen wirst, wo man immer Defizite hat sind Farm und Tode. Wenn du also deinen Farm und deine Tode verbesserst, sollte dies dich ungefähr eine Division nach oben bringen, als du eigentlich gehörst (besserer Farm als deine Mitspieler und Gegner, im durchschnitt <5 Tode/Spiel).\n\nZum anderen, kann auch eine gewisse Einstellung ganz gut helfen.\nIch selbst z.b. tilte nicht mehr und nutze den Chat nur, um jemanden zu loben (gj) oder sich zu bedanken (thx). Zum anderen, sehe ich den Chat nicht mehr, bzw. sehe ich es zu spät, falls jemand dort was reinschreibt (ca. 5-10 min später).\n\nWarum tilte ich nicht mehr?\nIch habe mich damit abgefunden, das es Leute gibt, die auf einem anderen Niveau spielen oder ein anderes Spielwissen haben.\n\nDas nächste ist, ich spiele **jedes** Spiel um mich zu verbessern und je schwerer es wird, desto interessanter finde ich es, da so ich mehr gefordert werde und nach alternativen Strategien, bzw. Items überlegen muss. Dies sind meine Antriebe und es bereitet mir großen Spaß, wenn es mal so aussieht, als wenn man verliert, da man so mehr leisten muss, als wenn man gewinnt und auch besser über sich hinauswachsen kann.\n\nAlso wenn du aus Bronze raus möchtest oder aus Silber oder sonst wo, suche deine Fehler und versuche diese zu beheben und dies in jedem Spiel immer wieder. Dann wird man es auch schaffen aufzusteigen, ohne das man dies möchte.","replies":[]},{"poster":"OT Riku","date":"2016-07-30T20:15:57.668+0000","up_votes":1,"down_votes":0,"body":"Hier ich bin der Beweis.\n\nVon B2 Solo nach S4.\nJetzt wieder S5.","replies":[]},{"poster":"SeaHorseCalamity","date":"2016-07-30T10:59:30.674+0000","up_votes":1,"down_votes":0,"body":"Das interessante ist: Die Leute sagen immer \"Die Niederlage liegt fast nie an mir!\"\nWas allerdings wesentlich interessanter wäre: Wie oft trägst du maßgeblich zum Sieg bei, wenn du mal gewinnst?\nKannst du effektiv ein Drittel der Spiele im Alleingang gewinnen?\nOder ein Viertel?\nWenn das nicht der Fall ist, must du noch ein wenig üben, um aufsteigen zu können.\n\nSobald du die Fähigkeit hast das Spiel zu dominieren, auch wenn dein Team nicht viel erreichen kann, hast du die Möglichkeit effektiv und beständig aufzusteigen.\n\nWenn nicht steigst du nur durch Glück mal ein zwei Divisionen auf und dann wieder ab, weil du das Niveau nicht halten kannst.\n\nAlso arbeite an dir, denn die einzige Elostufe, die du fürs Nichtstun erreichst ist Bronze 5.","replies":[]},{"poster":"Maze2810","date":"2016-07-30T00:30:37.812+0000","up_votes":1,"down_votes":0,"body":"Also ich war Anfang der Season Bronze 4, jetzt bin ich Silber 1. Somit kann ich deine Kernfrage beantworten: Es ist möglich. Ich hab einiges Solo gespielt, viel aber auch Premade mit Freunden die allesamt Anfangs Bronze 4-5 waren, jetzt sind wir zusammen auf Silber 1-2 geclimed. Das ganze braucht natürlich einiges an Zeit (150-200 Spiele) aber es ist kein Ding der unmöglichkeit. In Bronze reicht es meistens wenn man nicht tilted, greedy ist und gechillt farmt. Wenn man premade ist und sich halbwegs gut versteht ist es auch so gut wie gewonnnen da man das Gegnerteam so einfach easy stompen kann. Such dir ein paar Leute auf deiner Elo und versuchr zusammen rauszukommen, das macht Spaß und geht schneller. Ich habe 59% Winrate und steuere jetzt auf Gold zu, glaub mir, es workt :). Viel Glück!","replies":[]},{"poster":"Humpelstilzche","date":"2016-07-29T19:44:18.449+0000","up_votes":1,"down_votes":0,"body":"Die ganzen Leute in Silber und höher sind nicht vom Himmel gefallen. Ich denke das beantwortet deine Frage ;)","replies":[{"poster":"RM Heartmeander","date":"2016-07-29T22:11:17.555+0000","up_votes":1,"down_votes":0,"body":"Natürlich sind die dass.\nUnd soll ich dir etwas sagen?\nDer Aufprall hat höllisch weh getan!\nKann ich nicht weiterempfehlen.\n\nZumindest werden nicht alle in Bronze eingerank bzw. schaffen es in Bronze zu droppen.\nIch habe es z.B. noch nie geschafft in sloloQ in Bronze zu landen und werde es wohl auch nie schaffen.\nDa ist es wahrscheinlicher dass ich Challanger werde.","replies":[{"poster":"Antitomate","date":"2016-07-29T22:28:46.591+0000","up_votes":1,"down_votes":1,"body":"Ich meine als ich die 10 Ranked Spiele gespielt habe war ich ja erst seit einem Monat in LoL und war auch nicht der beste. (Poppy Main auf allen Lanes{{champion:78}} )","replies":[]}]},{"poster":"Antitomate","date":"2016-07-29T19:47:17.473+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Silnex","date":"2016-07-29T19:48:21.319+0000","up_votes":1,"down_votes":0,"body":"ja bist du","replies":[]}]}]},{"poster":"Práedyth","date":"2016-07-29T21:51:56.292+0000","up_votes":1,"down_votes":0,"body":"ich bin mir sicher ein gold 5 spieler würde 4v5 gewinnen","replies":[{"poster":"Práedyth","date":"2016-07-29T21:53:12.221+0000","up_votes":1,"down_votes":0,"body":"und ich habs geschafft mit soloq only von bronze 5 bis dia4 in 2 an halb jahren zu kommen (mit pausen) also wirst dus auch von bronze 2 zu silber schaffen","replies":[]}]},{"poster":"geilerdude","date":"2016-07-29T20:59:32.577+0000","up_votes":1,"down_votes":0,"body":"Spiel einfach Champs, die Teamfights massiv verändern können UND KEIN GOSU MOSU VAYNE LEE SIN BUBBA KUSH etc. scheiß und du wirst schneller aufsteigen als du denkst","replies":[]},{"poster":"D4RKEVA","date":"2016-07-29T20:09:42.829+0000","up_votes":1,"down_votes":0,"body":"Es ist mission impossible in bronze reinzukommen.\n\n\nIn bronze haben die meisten 0 ahnung von game und keine mechanics ._.\n\n\nheißt alles funktoniert wenn man eins 10% hat","replies":[]}]}