{"poster":"Killer SurpRyze","date":"2016-04-21T08:12:51.410+0000","title":"LeBlanc","subforum":"Campioni e gameplay","up_votes":2,"down_votes":2,"body":"Rieccomi con una domanda esistenziale: come si fa a giocare contro questa pu&hellip;lzella? Mi servirebbe un elenco di campioni da mid (possibilmente non assassini, che non ho le mani per usarli) e soprattutto di strategie da inizio partita (primi 5-10 minuti) per contrastarla in mid, senza morire una volta al minuto, pure sotto torre. Da tenere conto, nei suggerimenti, che sono scarso. Molto scarso.\r\nGrazie.","replies":[{"poster":"Ringiel","date":"2016-04-21T08:33:14.298+0000","up_votes":5,"down_votes":0,"body":"{{champion:134}}: oltre ad avere molto più range di lei,syndra ha un ottima combo per pokkare lb dalla distanza e obbligarla a usare il dash per schivare lo stun,inoltre può bloccare il dash di lb con la E se ti attacca ... lb senza dash non potra mai fightarti;syndra inoltre pusha molto la lane e lb soffre i champ che pushano perchè la costringono a farmare con le spell.\n\n{{champion:1}}: hai uno stun a target che ti permette i primi livelli di stunnarla quando ti dasha addosso per farli prendere hit dai tuoi minion e la tua W,mentre dal 6 lb diventa una easy kill perchè tu la bursti dalla distanza.\n\n{{champion:25}}: è un ottimo counter perchè è immune al root di lb,pusha molto bene,ha sustain (la passiva) e la combo Q+W mette veramente in crisi qualsiasi champ .... ricorda di non sprecare la Q per cercare di hittarla se ha la W,altrimenti puoi rischiare che si gira e ti bursta.\n\n{{champion:3}}: è op contro qualsiasi assasin ap,perchè se lo ingaggi,galio semplicemente preme R e ti shotta. \n\n{{champion:74}}: come ho già detto,lb soffre contro i champ che pushano,e heimer fa solo quello; le torrette non vengono shottate da lb quindi ti conferiscono un ottimo vantaggio,anche se dal 6 bisogna fare attenzione a possibili gank a causa del burst di lb.\n\n{{champion:90}}:ha un kit da push,quindi costringe lb a sprecare tutto il suo mana a prendere cs,e dal 6 non può venir ingaggiato da lb con il dash,altrimenti finisce nel range dell'ulti.","replies":[{"poster":"Killer SurpRyze","date":"2016-04-21T09:49:45.280+0000","up_votes":1,"down_votes":0,"body":"> \n> {{champion:74}}: come ho già detto,lb soffre contro i champ che pushano,e heimer fa solo quello; le torrette non vengono shottate da lb quindi ti conferiscono un ottimo vantaggio,anche se dal 6 bisogna fare attenzione a possibili gank a causa del burst di lb.\n> \n\nNon sapevo che le torrette fossero immuni alle spell di LeBlanc. O forse intendi dire che un giro di spell non basta a distruggerle?\nComunque grazie degli ottimi suggerimenti","replies":[{"poster":"Ringiel","date":"2016-04-21T10:14:43.605+0000","up_votes":2,"down_votes":0,"body":">Non sapevo che le torrette fossero immuni alle spell di LeBlanc\n\nnon sono immuni,ma non ha spell per shottarle ... per distruggerle deve per forza usare 2 spell e quando lo fa per te diventa facile traddare contro di lei","replies":[]}]}]},{"poster":"AcQuAmAn1","date":"2016-04-21T09:32:42.259+0000","up_votes":2,"down_votes":0,"body":"folli si può solo fuggire {{summoner:6}}","replies":[]},{"poster":"Severus Piton 19","date":"2016-04-21T08:43:55.140+0000","up_votes":2,"down_votes":1,"body":"Se conosci le distanze di Lb: Orianna, Lux e Annie possono avere una laning phase accettabile e più o meno safe, dipendentemente dallo stile di gioco.\n\nOrianna è abbastanza dura da buttar giù e riesce a restituire in trade ciò che le viene fatto se lb si sporge troppo per impedirti di farmare in tutta tranquillità.\n\nLux ha 3 skill che hanno tutte una loro utilità, basta saper gestire il mana. La q impedisce a Lb di harassare senza rischi di qw; la w favorisce i trade quando ci si avvicina al 5-7; la e ti fa farmare da distanza (e harassare in contemporanea).\n\nAnnie è praticamente poco sicura dai livelli 1 a 5; poi diventa molto più semplice tenerla in scacco e farmare quanto ti pare.","replies":[]},{"poster":"BeardSergio","date":"2016-04-21T09:22:01.055+0000","up_votes":1,"down_votes":0,"body":"Dimenticate l'antimage per eccellenza ovvero {{champion:45}} \nAnche se lei sta sgravando una volta al 6 schiacci R ed è finita.","replies":[{"poster":"Frizzy99999","date":"2016-10-25T19:37:55.983+0000","up_votes":1,"down_votes":0,"body":"Mate te lo dice una le blanc main mastery 7.Veigar viene sciolto da lb,non ya mobilità e io non ho mai perso una lane contro di lui","replies":[]}]},{"poster":"sboboo","date":"2016-04-22T21:07:41.171+0000","up_votes":1,"down_votes":0,"body":"GALIOOOOOOOO","replies":[]},{"poster":"Darkinknight","date":"2016-04-21T21:44:19.378+0000","up_votes":1,"down_votes":0,"body":"Diana,ma pre 6 non è semplice e devi gestirti il mana con il contagocce..è facile che la prima kill se la prendi lei comunque,ma poi la implodi..","replies":[]},{"poster":"Dr LouD","date":"2016-04-21T08:21:27.254+0000","up_votes":1,"down_votes":0,"body":"Diana.\n\nRinunci a qualche cs early se riesce a zonarti, ma al 6 la lane per Le Blanc è finita.\n\nSe non vuoi assassini le alternative sono poche, ti direi Morgana","replies":[]}]}