{"poster":"Trash MammaI","date":"2015-10-04T15:54:15.911+0000","title":"A few days ago I said Olaf was good and was wondering what was wrong with him","subforum":"Gameplay","up_votes":7,"down_votes":1,"body":"I stated that new items/balance changes and the meta shift have all been good for him and was mind baffled by what was making him so shit..\r\n\r\nNow he&#039;s being used in the LCS, banned even, and even people in low elo are trying to copy (big surprise there) and pick/ban him\r\n\r\nI&#039;m just going to assume that the boards give horrible advice on what is and isn&#039;t good..","replies":[{"poster":"GetMariahCarried","date":"2015-10-04T17:11:44.437+0000","up_votes":3,"down_votes":0,"body":"Every time there's a patch, half the people rage out on the forums and swear they're calling their divorce attorney on Rito.\n\nAdmittedly, sometimes the rage accurately assesses the situation, but Riot is making changes to champions with every patch, and it's not long before most troubles are fixed (eeeehhh maybe not ALL of them, but many of them). However, it IS a long time before the feelings of hardcore-<insert-champ-name-here>-veterans are no longer hurt. Because let's face it, moba players have long memories and tend to spend more time in the past than in the now.\n\nRelated to that: Some patch sequences keep a champ balanced, but DO change a champ's playstyle. The average gamer, being a sucker for nostalgia, crying that all final fantasy games after VII sucked, will have nothing to do with these style changes, and go ring up that attorney.\n\nThen, newer players, looking for expert advice, take it from a bunch of long-time forum goers, acting like a pack of old guys, sitting around a porch, complaining how \"it aint like the old days anymore\".\n\nIn short, if you want advice on a champ, first play them a few games, note the good and the bad traits, then compare your results to what updated build-guides say about the champ. An updated build-guide is a guide from someone who's STILL playing a champ and correcting their play styles to handle reworks. Don't go to the forums, where people post to say they've thrown up their hands and abandoned the game every time Rito makes a tweek.","replies":[]},{"poster":"Rinky Dinky","date":"2015-10-05T03:56:06.178+0000","up_votes":2,"down_votes":0,"body":"DO NOT trust the forums as far as balance goes.","replies":[]},{"poster":"NemeBro","date":"2015-10-05T05:42:44.235+0000","up_votes":2,"down_votes":1,"body":"I think I've figured out why Olaf is better in competitive than he is in solo Q.\n\nIn pro play, there's typically one or two designated carries, with everyone else playing a more supportive role, relying on their crowd control to peel and engage for the carries. Naturally, Olaf doesn't give a fuck about comps like this.\n\nIn solo Q, EVERYONE wants to be the carry. With so many high-damage champions on the enemy team, Olaf takes too much damage when he tries to dive. \n\nThat's my theory anyway.","replies":[{"poster":"CISTERN","date":"2015-10-05T12:32:18.929+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=NemeBro,realm=NA,application-id=3ErqAdtq,discussion-id=N0tTJEXz,comment-id=0008,timestamp=2015-10-05T05:42:44.235+0000)\n>\n> I think I've figured out why Olaf is better in competitive than he is in solo Q.\n> \n> In pro play, there's typically one or two designated carries, with everyone else playing a more supportive role, relying on their crowd control to peel and engage for the carries. Naturally, Olaf doesn't give a fuck about comps like this.\n> \n> In solo Q, EVERYONE wants to be the carry. With so many high-damage champions on the enemy team, Olaf takes too much damage when he tries to dive. \n> \n> That's my theory anyway.\n\nAlso the buffs on olaf are always more efficient, because he builds some armor and mr while dealing a nice amount of damage mid game, movements speed buff are strong because u cant cc him, shield buffs or health buffs when he is low with the armor and mr are more efficient\nAlso dont forget that they nerfed many times the mobile champions, if they want to nerf him without hitting him hard they can reduce the effectiveness of ally buffs when olaf uses ragnarok","replies":[]}]},{"poster":"XxxLumberJackxxX","date":"2015-10-05T12:36:25.604+0000","up_votes":1,"down_votes":0,"body":"Things to consider-\nIn solo q people tend to want/expect some kind of cc/engage from their jungle and toplaners.\nPicking olaf provides 0 of that.\n\nSolo q doesn't like to adapt to change so they wont build around it.\n\nTHen olaf wont be super useful","replies":[{"poster":"CISTERN","date":"2015-10-05T13:05:30.146+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=XxxLumberJackxxX,realm=NA,application-id=3ErqAdtq,discussion-id=N0tTJEXz,comment-id=0009,timestamp=2015-10-05T12:36:25.604+0000)\n>\n> Things to consider-\n> In solo q people tend to want/expect some kind of cc/engage from their jungle and toplaners.\n> Picking olaf provides 0 of that.\n> \n> Solo q doesn't like to adapt to change so they wont build around it.\n> \n> THen olaf wont be super useful\n\nU pick olaf , the ur team is like : nice we have tank lets pick squishy supp, top or jungle and ofc not support mage because we wanna carry","replies":[]}]},{"poster":"Sir Yamazuki","date":"2015-10-05T05:35:58.131+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Simple Tora,realm=NA,application-id=3ErqAdtq,discussion-id=N0tTJEXz,comment-id=,timestamp=2015-10-04T15:54:15.911+0000)\n> I&#039;m just going to assume that the boards give horrible advice on what is and isn&#039;t good..\n\nAll people do is circle jerk. Majority=/=always right, but to them it does since they can mass down vote you and ignore you.","replies":[]},{"poster":"ShatteredSkys","date":"2015-10-05T05:30:51.187+0000","up_votes":1,"down_votes":0,"body":"The only real bad thing I can think about Olaf is that he struggles vs ranged top laners and that he lacks hard cc which limits his peeling and menas his team has to make up for it.","replies":[]},{"poster":"SaltyKracka","date":"2015-10-05T00:08:36.536+0000","up_votes":1,"down_votes":0,"body":"Main problem is that the meta where Olaf was actually useful (versus tanks toplane) has passed, and he requires either being incredibly fed or having a teamcomp built around him (Lulu, I choose you!) in order to actually do anything outside of his lane.\n\nAlso, he scales terribly into the lategame.","replies":[]},{"poster":"Salidfingers","date":"2015-10-04T23:26:53.181+0000","up_votes":1,"down_votes":0,"body":"I am been playing olaf before and after rework. \n\nI have defended olaf on the boards countless times and he will never be LCS picked.  I am laughing now.","replies":[]},{"poster":"SorryBoysImLes","date":"2015-10-04T18:21:29.805+0000","up_votes":1,"down_votes":0,"body":"Literally one week before Sivir was picked up and played religiously in the lcs I picked her in solo Q and my entire team freaked out in champ select, telling me non-stop how useless of an ADC she was. That she should even be removed from the game. \n\nThe simple answer is people are sheep.","replies":[]},{"poster":"Renthaeus","date":"2015-10-04T15:59:10.624+0000","up_votes":1,"down_votes":0,"body":"Just get Trundle. Doesn't matter what you do, he will destroy you if you're Olaf.","replies":[]}]}