{"poster":"PaPaPapalapap","date":"2015-02-11T16:26:40.783+0000","title":"Fiddle-Nerf WTF Riot!!!!?","subforum":"Champions & Gameplay","up_votes":2,"down_votes":3,"body":"moin,\r\n\r\nwollte mal meine wut rauslassen, und zwar weil fiddle wieder!!! generft wurde.\r\nDer Junge ist schon stark aber überhaupt nicht op im gegensatz zu gewissen cahmps wie nidallee -.-\"\"\r\nDaher meine Frage warum wird er SCHONWIEDER generft man!?\r\nUnd ich als Fiddle main spieler weiß, dass die Reichweite des Drains mega wichtig ist und oftmals in den letzten\r\nMilimetern der Reichweite den killt holt......","replies":[{"poster":"Avorox","date":"2015-02-11T16:28:55.015+0000","up_votes":4,"down_votes":0,"body":"Die haben doch nur die Reichweite um 50 verringert, das macht zwar schon nen kleinen Unterschied, ist aber nichts weltbewegendes.","replies":[]},{"poster":"Ragequit Account","date":"2015-02-11T16:48:21.734+0000","up_votes":2,"down_votes":0,"body":"Weil seine Winrate in den Bereichen, in denen es drauf ankommt, verdammt hoch ist. Genaugenommen hat er eine der höchsten. Bin von den nerfs auch nicht begeistert, aber die sind leider nur eine Folge seiner Stärke.","replies":[{"poster":"PaPaPapalapap","date":"2015-02-11T16:51:24.489+0000","up_votes":1,"down_votes":1,"body":":( schade","replies":[]}]},{"poster":"Dat Ding15","date":"2015-02-11T16:32:06.079+0000","up_votes":1,"down_votes":0,"body":"Fiddle ist sehr sehr stark.\nDu willst das nicht sehen, weil du ihn gerne spielst, das ist verständlich.\nAber Fiddle Drain ist schon sehr stark.","replies":[{"poster":"PaPaPapalapap","date":"2015-02-11T16:35:53.770+0000","up_votes":2,"down_votes":1,"body":"er ist stark wenn du ihn kannst, so wie jeder champ stark ist wenn du ihn kannst.\nAußerdem ist er sehr squishy und du brauchst nen sehr gutes positioning um ned zu sterben, dass drain ist so ziemlich das einzige was er im 1-1 hat!","replies":[{"poster":"Avorox","date":"2015-02-11T16:39:54.187+0000","up_votes":1,"down_votes":0,"body":"Fiddle ist auch nicht auf 1v1 ausgelegt. Fiddle kann mit einer guten Ulti einen ganzen Teamfight carrien. Mit dem Drain ist er auch im 1v1 stark ja, daher wurde die Reichweite verringert, da er in anderen Bereichen schon viele Stärken hat und das Ganze so etwas eingegrenzt wird. Fiddle ist immer noch nen viable Pick, ich sehe also dein Problem nicht.","replies":[{"poster":"PaPaPapalapap","date":"2015-02-11T16:45:21.436+0000","up_votes":2,"down_votes":1,"body":"trz. wurde schon erst sein fear, dann sein E und jetzt das drain generft???? was kommt als nächstes!!!!???\nEr wird doch so schon mega selten gepickt, wozu dann der nerft?\nJa, er ist stark wenn man ihn kann, aber trz. ist er schwer zu spielen und leicht counterbar!","replies":[]}]}]}]},{"poster":"DimensionDragon","date":"2015-02-11T17:03:21.761+0000","up_votes":1,"down_votes":0,"body":"Ich finde dies schon passend, denn so als Kleinigkeit: Es gibt immer weniger Möglichkeiten seine Heilung abzuschwächen da schwarzes Beil, Fizz W und Triatanas klaffende Wunden verschwunden sind.","replies":[]},{"poster":"Mikì","date":"2015-02-11T16:34:19.532+0000","up_votes":2,"down_votes":3,"body":"Champs wie Nidallee hätten den nerf aber eher verdient als fiddle da Nidallee momentan wirklich sehr stark ist.","replies":[]}]}