{"poster":"nahuelnievas30","date":"2015-02-27T05:18:38.326+0000","title":"Hackers de cuentas","subforum":"Problemas Técnicos","up_votes":25,"down_votes":4,"body":"Saludos Invocadores y gente de Riot:\r\n\r\nBueno esta discusión que estoy armando se debe a que hace dos semana mientras me estaba intentando logear en unas de mis cuentas (federico4332) pero al iniciar sesión me saca diciendo que esa no es la contraseña correcta pero intente varias veces para confirmar que estaba equivocado.Pero lo q estaba haciendo no funcionaba y esto me dio a entender q sin querer había cambiado mi contraseña...Pero saben que es lo mas gracioso de esto,ayer mi cuenta mencionada anteriormente estaba conectada y un amigo le empezó a hablar insultándole para q el sujeto me devuelva la cuenta pero este lo blockeo y elimino ahora yo solo quería pedirles que le den un +1 a esta discucion así alguno de Riot lo mira y me ayuda a cambiarle la contraseña ya que parece q este tipo ha cambiado hasta mi email asiq sin mas preámbulos me despido.\r\n  Espero q les valla muy bien en sus partidas y q no les suceda esto a ustedes tambien","replies":[{"poster":"ZetsubouFallen","date":"2015-02-27T07:43:58.755+0000","up_votes":6,"down_votes":0,"body":"Lamento decirte que tu cuenta era:\n\nfederico4332\n\nPass:\n\nfederico4332\n\nOsea..te la sacaron por un combo, reclama en support y si tenes el mail verificado recupera la cuenta.","replies":[{"poster":"nahuelnievas30","date":"2015-02-27T17:42:47.846+0000","up_votes":1,"down_votes":0,"body":"La contraseña no era asi pero igual gracias por comentar :) suerte en los campos de la justicia","replies":[]}]},{"poster":"Condor","date":"2015-02-27T06:27:58.589+0000","up_votes":1,"down_votes":0,"body":"ojala un rioter lo vea :(","replies":[{"poster":"Tecnicomando","date":"2015-02-27T11:57:31.954+0000","up_votes":2,"down_votes":0,"body":"Aunque lo vea. tiene que mandar tiket a soporte...\n\nAdemas es imposible que te roben la cuenta si verificaste el mail..","replies":[{"poster":"Cedriel","date":"2015-02-27T14:42:57.487+0000","up_votes":4,"down_votes":0,"body":"Precisamente. No basta con que un Rioter lo vea. Yo no tengo las herramientas para revisar el detalle de actividad de cuenta y hacer cambios de contraseña o bans: los Rioters que tienen ese poder están en Soporte. Entre otras razones se hace así para que haya visibilidad y responsabilidad en caso que haya algún error o problema causado por nosotros a una de sus cuentas.\n\nNahuel, envía un ticket a soporte para que puedan revisar tu caso.","replies":[{"poster":"Cubic","date":"2015-02-28T14:17:03.871+0000","up_votes":2,"down_votes":0,"body":"Cedriel, buenos dias.. A mi hace un tiempo me han robado la cuenta tambien y precisamente la recupere por ese medio, lo que no me han podido devolver es el reembolso de una skin que ha sido efectuada y los RP's que me han robado junto con la cuenta. Tengo formas de comprobar quien fue el que me robo la cuenta porque este se autoregalo skins e iconos, pero no lo han baneado de ninguna forma aun.\n\nQuisiera saber si hay alguna forma de recuperar ese reembolso que yo nunca hice y los RP's que me han robado, porque estoy totalmente frustrado tratando de recuperar eso hace un tiempo y no tengo posibilidades de acceder a una solucion.","replies":[]},{"poster":"nahuelnievas30","date":"2015-02-27T17:44:04.065+0000","up_votes":2,"down_votes":0,"body":"Querido Cedriel:\n\nGracias por tu comentario y por la solución el ticket lo he enviado hace rato y espero respuesta pero a la vez estoy inquieto por lo que esta persona esta haciendo con la cuenta\nSaludos","replies":[]}]},{"poster":"Joshua99","date":"2015-02-27T14:30:01.963+0000","up_votes":1,"down_votes":0,"body":"créeme amigo que si es posible me paso lo mismo no me llego nada el email nada pero seguí los pasos de el soporte y la recupere al cabo de 3 semanas","replies":[]}]}]},{"poster":"Maknisor","date":"2015-02-27T15:56:20.181+0000","up_votes":3,"down_votes":0,"body":"A un amigo hace una semana le quitaron su cuenta principal el nombre de la cuenta era JuanitoElSerio y el problema es que a gastado un montón de dinero y tiempo en esa cuenta , se la quitaron le cambiaron la contraseña y el mail la a perdido y a intentado enviar varios mails a riot pero aun no le contestan.\n\nCambien sus password porque hay gente que les puede quitar la cuenta.","replies":[]},{"poster":"Lucas25053","date":"2015-02-27T05:39:14.395+0000","up_votes":3,"down_votes":2,"body":"Aca tengo la conversacion que tuve con el tipo que le robo la cuenta\n\n[10:00] Lucas25053: sos fede o el pendejito que le robo al cuenta??\neh?\neh?\nla ****** de tu hermana\n[10:01] Federico4332: esta es mi cuenta\n[10:01] Lucas25053: explicate\nla ****** de tu hermana\n[10:02] Federico4332: es mi cuenta que tengo que explicar\n[10:02] Lucas25053: quien sos\npendejito de ******\nsi sos fede conectate en skipe\n[10:02] Federico4332: que te pasa amigo?\nes mi cuenta esta capo\n[10:02] Lucas25053: chupane un huevo\no te estas haciendo o sos un ********\n[10:03] Federico4332: calmate \nflamer\nnadie te insulto\nte bloqueo\n[10:03] Lucas25053: quien ***** sos\n[10:03] Federico4332: tu vieja\n[10:03] Lucas25053: fede la ****** de tu herman\nhabla bien\ncomo recuperaste la cuenta?\n[10:04] Federico4332: que ****** te pasa\nidiota dejame en paz\n[10:04] Lucas25053: sos fede?\n[10:05] Federico4332: bloqueado\n\nObviamente si es la persona real no va a decir directamente \"esta es mi cuenta\" ni menos me va a bloquear..Claro que yo  estaba enojado si a mi amigo le roban su cuenta,  con todo el Rp que tenia, en toda la vida de la cuenta  se compro aproximadamente entre 50.000 y 60.000 de RP, y se acababa de comprar la skin definitiva de sona..","replies":[{"poster":"JoakMaster","date":"2015-02-27T15:56:00.800+0000","up_votes":3,"down_votes":0,"body":"yo lo vi conectado jugando una partida con sona... \"que casualidad tiene la skin y justo este pibe juega una partida con SONA \" le pregunto si era el y me responde lo mismo, \"\" esta es mi cuenta que te pasa\" y se desconecto . Espero que se solucione y que algún soporte haga el mínimo esfuerzo de solucionar esto.\n\n si llego a encontrarlo juro que lo dejo asi {{champion:6}} \n saludos.","replies":[]},{"poster":"Joshua99","date":"2015-02-27T14:28:45.785+0000","up_votes":3,"down_votes":0,"body":"Lucas agrégame al juego y mándame tu Skype me paso lo mismo y se como solucionarle se que los argentinos no se llevan bien con los chilenos pero me da una rabia que le gente a la cual no le cuesta nada decir que soy bueno por hackear una cuenta a una persona que llego a lvl 30 con esfuerzo y comprándose skins","replies":[]},{"poster":"Zoliza","date":"2015-02-27T13:16:16.839+0000","up_votes":1,"down_votes":0,"body":"Explicame como una persona puede chorearte el mail, ponele que tu cuenta sea mismo user , pass y nombre de invocador pero el mail? enserio? es mas yo podria pasarte mi cuenta y podes intentar toda tu vida conseguir el mail o la pass. Algo mal habras hecho...","replies":[]}]},{"poster":"Sir Franci","date":"2015-02-28T06:10:50.491+0000","up_votes":2,"down_votes":0,"body":"Mmmmmm esto me huele a mentira por un par de cosas:\n\n1º Nadie puede cambiar tu hotmail al menos que esa persona conozca tu hotmail y tu contraseña, ya que al cambiar tu hotmail del lol te aparece por ej: carlito*****.es\n\n2º Me resulta raro al revisar su historial que el jugo en premade con VOS y TU AMIGO Lucas25053\n\n3º Se nota que le quieres robar la cuenta por varias razones: todas las partidas que jugaste en premade con el y por la cantidad de skin que debe obtener este usuario\n\nAmigo si quieres robarle la cuenta a alguien asegúrate de no jugar por los menos los 3 en premade o vos con el. Y para los que me quieran contradecir les dejo el historial del usuario Federico4332 y vean que an jugado en premade los 3 y perdieron todas, supuesto usuario usando a {{champion:53}} \n\nHistorial: http://matchhistory.las.leagueoflegends.com/es/#match-history/LA2/200592259\n\nPD: El que no tendria que tener mas cuenta seria vos por intentar robar cuenta... Tengo que trabajar para Riot :/","replies":[{"poster":"Lucas25053","date":"2015-02-28T19:16:57.596+0000","up_votes":1,"down_votes":0,"body":"1º  No se sabe como le robaron la cuenta a Fede, le cambiaron la contraseña,la cagada esque el no se sabe con que mail se registro\n\n2º eso ya lo explique en respuesta al comentario de Zaratrustha\n\n3º ¿No crees que seria muy de rata querer robarle la cuenta a un premade?  fijate en la cuenta de federico4332 las partida que jugo con Nahuelnievas30, de hace MESES desde cuando la cuenta federico4332 era nivel menor a 10","replies":[{"poster":"Sir Franci","date":"2015-03-01T06:12:18.252+0000","up_votes":1,"down_votes":0,"body":"Para tu informacion rata si parece y mas vos que lo apoyas partidas jugadas lvl 30 team ranked la ultima aprtida fue jugada el Domingo 22 de Febrero de 2015 no roben cuentas por ratas y listo carga tu propio dinero al juego\n\nPD: te contra decis con este comentario y con el que pusiste a zaratrustha... era \"lvl 10\" y el pone lo mismo pero era lvl 30","replies":[{"poster":"Lucas25053","date":"2015-03-01T20:19:20.582+0000","up_votes":1,"down_votes":0,"body":"Entonces pensas que desde hace 5 meses que entre yo y Nahuel estamos jugando con Fede para investigarle la cuenta y asi robarsela y despues hacer un foro pidiendo el cambio de contra cuando ya le cambiaron la contra\n\nEstas muy mal amigo","replies":[{"poster":"Sir Franci","date":"2015-03-02T17:26:22.230+0000","up_votes":1,"down_votes":0,"body":"Espera, espera ese tal Zarathustha publico la misma partida que yo msima fecha todo pero con el era lvl 30 y paso hace menos de 3 semanas y la mia que es la misma partida paso hace 10 meses y el era lvl 5.\n\nAmigo como dice el dicho: Estas pisando la misma mier** que dejaste","replies":[{"poster":"JoakMaster","date":"2015-03-02T20:32:44.556+0000","up_votes":2,"down_votes":0,"body":"aver aver..., que parte no entendes de que somos amigos e intentamos ayudarlo? eh,  ademas para que queremos robarle la cuenta a un amigo , por favor .","replies":[{"poster":"Sir Franci","date":"2015-03-02T22:49:22.186+0000","up_votes":1,"down_votes":0,"body":"Nose ustedes sabrán para jugar en premade con el y estando todos me huele a algo de mentira","replies":[{"poster":"Lucas25053","date":"2015-03-02T22:55:12.426+0000","up_votes":1,"down_votes":0,"body":"jugamos todos en premade porque somos amigos y estamos todos en el foro para ayudarlo :c y nos molesta que le hayan robado la cuenta es el muy buen amigo,ves el icono que tengo? el me lo regalo {{champion:18}}","replies":[]}]}]},{"poster":"Lucas25053","date":"2015-03-02T19:01:36.523+0000","up_votes":1,"down_votes":0,"body":"Pero, no estoy hablando de la misma partida :/","replies":[{"poster":"Sir Franci","date":"2015-03-02T22:49:58.662+0000","up_votes":1,"down_votes":0,"body":"entoces vos estas habalndo de hace 10 meses atras cuando la pagina del historial no estaba pero yo estoy hablando las de blitz como ese tal zarathustha","replies":[{"poster":"nahuelnievas30","date":"2015-03-04T12:38:23.488+0000","up_votes":1,"down_votes":0,"body":"Amigo si  no estas de acuerdo solo no comentes y listo,Saludos","replies":[]}]}]}]}]}]}]}]},{"poster":"Zaratrustha","date":"2015-02-28T13:07:53.862+0000","up_votes":2,"down_votes":0,"body":"Al parecer estas tratando de robar una cuenta. Solo 2 cosas:\n\n1) Hace dos semana mientras me estaba intentando logear EN UNAS DE MIS CUENTAS (federico4332). Solo se puede tener 1 sola cuenta por servidor.\n\n2)Como es posible eso de que hayas jugado las ranked con la cuenta nahuel... federico... al mismo tiempo y la de tu amigo?","replies":[{"poster":"nahuelnievas30","date":"2015-03-01T04:56:51.035+0000","up_votes":1,"down_votes":0,"body":"Saludos amigo esa cuenta la usa mi amigo contesto esto para sacar tu inquietud","replies":[]},{"poster":"Lucas25053","date":"2015-02-28T18:53:18.737+0000","up_votes":1,"down_votes":0,"body":"1) se puede tener mas de una cuenta por servidor\n\n2) en realidad nahuelnievas30 es amigo de federico4332 pero como Federico no puede comentar YA QUE NO TIENE CUENTA  Nahuel hiso el foro y dijo que federico4332 era una de sus cuentas porque capaz que al decir que era cuenta de su amigo no le iban a dar pelota, eso explica esa ranked que jugue antes que le hayan robado la cuenta a mi amigo.\n\nfede ya mando ticket al soporte y esta esperando a que le respondan.","replies":[]}]},{"poster":"Laurys Comando","date":"2015-02-27T15:08:39.483+0000","up_votes":2,"down_votes":0,"body":"Ami tambien me entraron a la cuenta pero me hicieron algo mas peor que esto.....\nMe trolleo las partidas, osea tenia todas las clasificatorias perdidas con ej: 2/21- 1/46....y justo los dias en la cual yo NO estaba conectado\nY POR ESA RAZON, cuando queria iniciar sesion me ponen que la cuenta a sido baneada permanentemente!\n\nNombre de invocador: Laurys Comando\nCorreo electronico: cristian.ruiz22@yahoo.com","replies":[]},{"poster":"Joshua99","date":"2015-02-27T14:23:31.340+0000","up_votes":2,"down_votes":0,"body":"Amigo no la mejor solución pero anda al sopporte yo recupere mi cuenta me paso lo mismo que a ti me hackearon la cuenta y bloquearon a mis amigos por insultarlo la mayoría piensa que el soporte de riot no sirve pero eso es lo que yo cree me demore como 3 semanas en recuperarla no es para bajar el animo ni mucho menos (espero que recuperes la cuenta tal como yo lo hice) mi nombre de cuenta que me hackearon y recupere es trijavo :D espero que te ayuden tal como me ayudaron a mi","replies":[]},{"poster":"odskf","date":"2015-02-27T13:22:54.802+0000","up_votes":2,"down_votes":0,"body":"por eso yo tengo mi mail de lol para que solo ingrese con la clave que me genera en el teléfono. (tu usuario y correo seguramente veden de ser el mismo o simplemente te registraste en una pagina de lol trucha y te robaron los datos o otra cosa que quizás  un seudo amigo te instalo de un keyloger para sacarte user y pass.)","replies":[]},{"poster":"xAsazin","date":"2015-02-27T05:53:26.912+0000","up_votes":2,"down_votes":0,"body":"Dejare esto por aqui  https://support.riotgames.com/hc/es  :B","replies":[{"poster":"nahuelnievas30","date":"2015-02-27T05:56:03.766+0000","up_votes":1,"down_votes":0,"body":"Ya lo he hecho igual gracias por comentar :$","replies":[{"poster":"xAsazin","date":"2015-02-27T05:58:58.184+0000","up_votes":1,"down_votes":0,"body":"A, en serio? :v entonces dejare esto por aqui https://www.youtube.com/watch?v=3i6Q8FbL7FM :B (Soy rarho) n_n nyan cat","replies":[{"poster":"Nyán","date":"2015-02-28T17:07:15.784+0000","up_votes":1,"down_votes":0,"body":"Nyan nyan nyan nyan","replies":[]}]}]}]},{"poster":"gotaR","date":"2015-02-27T07:00:57.855+0000","up_votes":2,"down_votes":1,"body":"Lamento el problema que tienes, pero este no es el lugar para quejarte y/o pedir ayuda.\n\nEn lo que pueda ayudarte es entrando al soporte de Riot Games.\n\nAs click aquí :https://support.riotgames.com/hc/es","replies":[]},{"poster":"Capitan Fin","date":"2015-11-15T17:20:23.488+0000","up_votes":1,"down_votes":0,"body":"Ala de mi primo le paso lo mismo aller pero ya le he mandado la peticion a riot cero bola","replies":[]},{"poster":"ActiomDestructor","date":"2015-05-30T02:15:43.770+0000","up_votes":1,"down_votes":0,"body":"En primero lugar creo que es tu culpa por que al no tener el mail no pueden cambiarte la contraseña","replies":[]},{"poster":"Federico4332 ","date":"2015-03-15T14:19:03.747+0000","up_votes":1,"down_votes":0,"body":"GRACIAS A NAHUELNIEVAS30 Y A LUCAS25053 RECUPERE MI CUENTA GRACIA A TODOS GRACIAS RIOT GRACIAS JUGADORE GRACIAS :D {{champion:68}}","replies":[{"poster":"Federico4332 ","date":"2015-03-15T14:19:30.624+0000","up_votes":1,"down_votes":0,"body":"GRACIAS A TODOS :D LOS QUE COMENTARON Y AYUDARON","replies":[{"poster":"Federico4332 ","date":"2015-03-15T14:21:47.581+0000","up_votes":1,"down_votes":0,"body":"Y GRACIAS A JOAKMASTER, pero el hdp me gasto el rp que tenia en la cuenta :c me quedo 130 :c ademas tenia bastante","replies":[{"poster":"Federico4332 ","date":"2015-03-15T14:22:12.518+0000","up_votes":1,"down_votes":0,"body":"Y era para comprarme a bardo :c:C con la skin","replies":[]}]}]}]},{"poster":"Cubic","date":"2015-02-28T14:12:31.430+0000","up_votes":1,"down_votes":0,"body":"Tienes que reclamar al support de RIOT en la seccion Cuenta>Recuperar cuenta, a mi me la han robado hace un mes aproximadamente y la recupere por ese medio.","replies":[]},{"poster":"anonimusgaymer","date":"2015-02-27T19:14:03.472+0000","up_votes":1,"down_votes":0,"body":"no entiendo cuando tienen el puño de riot alado de los comentarios","replies":[]},{"poster":"D0N C0RLE0NE","date":"2015-02-27T16:59:18.134+0000","up_votes":1,"down_votes":0,"body":"nose cuando pusiste esto pero vi el perfil (federico4332) y  veo que se compro a dj sona :O","replies":[{"poster":"nahuelnievas30","date":"2015-02-27T17:46:04.250+0000","up_votes":1,"down_votes":0,"body":"Si tranquilo amigo mio yo ya la habia comprado antes de q esta persona me hackeara la cuenta por estoy preocupado","replies":[]}]},{"poster":"nahuelnievas30","date":"2015-02-27T17:45:02.298+0000","up_votes":1,"down_votes":0,"body":"Bueno gente muchisimas gracias por sus comentarios sean positivos o negativos,no importa gracias por sus soluciones etc\n\nPD: Espero q les valla muy bien en los campos de la justicia","replies":[]},{"poster":"Shappaw","date":"2015-02-27T12:53:02.334+0000","up_votes":1,"down_votes":0,"body":"Pero... es tu culpa, tenés que poner alguna contraseña más segura y no tan simple de descifrar y más todavía en tu casilla de correo.","replies":[]},{"poster":"Space Kid","date":"2015-02-27T07:57:20.538+0000","up_votes":1,"down_votes":0,"body":"Lo que mas intriga me dió y tambien debería preocuparte es como llegaron a tu mail...","replies":[]},{"poster":"NathaCarriesU","date":"2015-02-28T02:29:51.698+0000","up_votes":1,"down_votes":1,"body":"Psss existe algo que se llama verificar e-mail y si gastaste tanta plata en rp te hubieras preocupado por verificar el e-mail","replies":[]}]}