{"poster":"Aphr0mo","date":"2016-01-12T00:08:55.491+0000","title":"out of elo","subforum":"Community Events","up_votes":1,"down_votes":0,"body":"I need help getting out of b4 anyone mind helping me?","replies":[{"poster":"littlemisscheeky","date":"2016-01-12T05:26:54.572+0000","up_votes":1,"down_votes":0,"body":"Hey Aphr0mo,\n\nI found watching these basic LOL videos to be extremely helpful in my progression, https://www.youtube.com/playlist?list=PL9RdXhXESRJzgY_SwHB8T-cZxXljWhQvz\n\nAnd if you don't have time to watch all of them, then just watch \"The Trading Stance\".\n\nThrough watching those videos and focusing on the positives, I was able to go from b4 to s5 in 3 weeks.","replies":[{"poster":"Eliea","date":"2016-01-12T17:17:53.618+0000","up_votes":1,"down_votes":0,"body":"I had never seen these before! They actually give you a lot of advice on how to win you lane (Just by going off that one video you posted)\n\nI like that, Maybe that will help me get to my goal for Season 6! (I'm bored of seeing this silver border on my profile after 3 seasons)","replies":[{"poster":"littlemisscheeky","date":"2016-01-12T22:57:55.383+0000","up_votes":1,"down_votes":0,"body":"Ikr! I really enjoy the depth and explanation of the guide compared to the rest of the guides I've seen.","replies":[{"poster":"Eliea","date":"2016-01-13T03:55:32.070+0000","up_votes":1,"down_votes":0,"body":"That's so true! Other people just explain how they win the lane off their own experience, where this guy goes really in depth into his guides and help people who are low elo, and who don't understand how lane mechanics... Thankyou for the suggestion of these guides, I'll need to watch more of these!\n\nAlso, (sorta off topic) wondering if you want to play some ranked together next season? Going to be running the dynamic queue with a few friends!","replies":[{"poster":"littlemisscheeky","date":"2016-01-13T04:46:39.102+0000","up_votes":2,"down_votes":0,"body":"Sure :) I'm a mid main.","replies":[{"poster":"Eliea","date":"2016-01-13T04:52:10.985+0000","up_votes":1,"down_votes":0,"body":"Awesome! I'm generally a support main, but been playing a lot of mid and marksman at the moment! xD","replies":[]}]}]}]}]}]},{"poster":"Tele","date":"2016-01-12T00:30:37.908+0000","up_votes":2,"down_votes":0,"body":"It's tough sometimes. All I can say is make sure you think. Think all the time, is this good? Why is it good? etc.\n\nRiot on OCE will usually copy and paste [this](http://boards.oce.leagueoflegends.com/en/c/gameplay-strategy/i0iPcGfv-i-still-havent-learned-the-game-basics-after-just-over-1-year?comment=0005) post for people who are having troubles like yours. It's not very useful, but it'll lead you on to some helpful sources like gbay99.","replies":[]},{"poster":"SpawnTheCaster","date":"2016-01-12T01:01:39.458+0000","up_votes":1,"down_votes":0,"body":"Hey Aphro,\n\nI have 2 pieces of personal advice for climbing.\n\n1) play 2 champions in 2 roles, thats all! if you are made to fill in a role you dont like I dodge the first time and then pick a mechanically easy champion (soraka supp for example) if I have to fill.\n\n2) If you start losing stop playing. Lose 2 in a row time to take a break, hit the gym, do work / school work, chat to a mate or watch a stream for abit. This means you dont get tilted as easily and can focus on purely game play.\n\nDuoing can also help if you find the right partner and you can help each other get better.\n\nLet me know how you go!\n\nCheers,","replies":[]},{"poster":"GigaPube","date":"2016-01-12T00:12:15.063+0000","up_votes":1,"down_votes":0,"body":"good one aphromoo, hahahaha silly aphromoo always being hilarious, stop asking for help you silly goofball you go carry zion and co to 8th place","replies":[]}]}