{"poster":"renatoox69","date":"2015-02-04T20:55:10.759+0000","title":"a quien me compro","subforum":"Guias y consejos","up_votes":2,"down_votes":1,"body":"talon o vayne","replies":[{"poster":"Rob Halfords bae","date":"2015-02-04T20:58:46.339+0000","up_votes":1,"down_votes":0,"body":"tene en cuenta  que talon no tiene early y es debil","replies":[{"poster":"Bludix","date":"2015-02-05T01:03:19.515+0000","up_votes":1,"down_votes":0,"body":"Haz Jugado con Talon? por mi parte, un excelente champ, no es nada fácil de usar y créeme, early no tiene casi ningún champ","replies":[{"poster":"Rob Halfords bae","date":"2015-02-05T19:10:36.023+0000","up_votes":1,"down_votes":0,"body":"me refiero a que en early no es mucho, pero si es un personaje muy bien logrado, y justamente digo que es debil por eso, por ser complicado(aunque vayne tenga mas mecanicas)","replies":[]}]}]},{"poster":"jujulian1234","date":"2015-02-05T14:28:46.024+0000","up_votes":1,"down_votes":0,"body":"te  voy a decir  dos  cosas  una vos  tenes que  elegir a  tu campeón osea  depende tienen cosas muy distintas  uno adc y el otro es  top mid  y jungla  eso ya  es a  tu cuestionamiento pero es  mejor  talon para  mi","replies":[]},{"poster":"SET0  KAIBA","date":"2015-02-05T03:26:11.877+0000","up_votes":1,"down_votes":0,"body":"vayne es mejor que talon top","replies":[]},{"poster":"renatoox69","date":"2015-02-04T20:58:17.922+0000","up_votes":1,"down_votes":0,"body":"entonces a quien","replies":[{"poster":"Vincendi20143","date":"2015-02-05T03:07:55.293+0000","up_votes":1,"down_votes":0,"body":"Y nos puedes comprar a los 2, si total primero eliges uno al azar y el otro luego, ni que riot se quede sin pi","replies":[]}]},{"poster":"DNMC Leppard","date":"2015-02-05T02:33:25.172+0000","up_votes":1,"down_votes":0,"body":"Supongamos que querés a Talon para jugar competitivo y a Vayne también, bueno, Vayne lleva su tiempo de práctica, Talon también, son dos roles totalmente diferentes, uno es Ad Carry y otro es Mid lane asesino, Vayne tiene un posicionamiento en teamfights bastante complicado, y además por lo general tiene que fragear al primer tanque que se le tire encima, yo ví a personas que usan bien a Vayne que pueden focusear inclusive al otro ADC si se encuentran bien posicionados. Por otra parte Talon, es un asesino que sirve para eliminar al ADC rival o el APC enemigo, yo prefiriría Talon ya que si bien requiere práctica y un buen farmeo, podés deletear al adc en cuestión de segundos si te tiras bien en la TF, eso sí, Talon muy pocas veces sale vivo de una teamfight si de focusear a alguien que no sea Front Lane se trata. En mi opinión, me querdaría con Talon, pero depende tu modo de juego.","replies":[]},{"poster":"Brazo de sciolí","date":"2015-02-04T20:57:42.159+0000","up_votes":1,"down_votes":0,"body":"y tene en cuenta que vayne es el personaje con mas mecanicas del juego","replies":[{"poster":"I Love KaiSa","date":"2015-02-05T00:19:14.889+0000","up_votes":1,"down_votes":0,"body":"Que????????","replies":[]}]},{"poster":"renatoox69","date":"2015-02-04T20:59:07.839+0000","up_votes":1,"down_votes":0,"body":"aquien","replies":[{"poster":"Rob Halfords bae","date":"2015-02-04T21:00:13.009+0000","up_votes":1,"down_votes":0,"body":"si solo queres a uno de esos dos.. yo diria que talon , por el simple hecho de que es mas facil de dominar","replies":[]}]}]}