{"poster":"SirMaxiMuss","date":"2019-02-25T17:14:55.838+0000","title":"Lose streak","subforum":"Charlas Generales","up_votes":2,"down_votes":0,"body":"Bueno, esto es temporal o que? he jugado en la mayoria de mis partidas bien gano linea y llegamos a torre de inhibidor pero luego no se que pasa y la remontan de extraña manera me ha pasado en rankeds y en normals llevo 12 partidas perdidas y no se que hacer.\r\n\r\nalgun consejo señores?{{sticker:sg-ahri-2}}","replies":[{"poster":"Annie Botz","date":"2019-02-25T17:39:51.065+0000","up_votes":2,"down_votes":0,"body":"Estoy en las mismas, mejor culpo a los trolls y afk (?)\n\nNo sé en qué elo juegues pero yo pierdo por tres motivos según vi:\n1- Hay una persona que no se desarrolla bien en la partida.\n2- Mala gestión de picks.\n3- Mal manejo del macrogame.\n\nEsto lo digo tanto por mí como por otros, en una partida en concreto tuve un desempeño nulo (solo servía como un stun, tenía daño pero gracias que mi team mantuvo la ventaja) ahí pudieron ganar sin mí básicamente, debido a los picks que tenían (iniciación front, un adc que pegue free y peel)\n\nEn otra partida que yo jugué bien tuve un mal pick, además que me counterearon, tuve un pick frágil (todos los enemigos tenían dash) y al final ese daño que tenía se perdía en segundos porque no había manera de que me aleje sin flash.\n\nY otra partida que si bien perdí me gustó por como se jugó (ambas partes) jugamos muy controlado todo pero el equipo rival supo aprovechar a Yorick (igual está roto xdxd) y nos botaron el nexo de a poco, pudimos ganar pero ese split nos descolocaba mucho.","replies":[]},{"poster":"Jaheje","date":"2019-02-25T17:23:13.057+0000","up_votes":2,"down_votes":0,"body":"Si, suele pasar. Lo mejor en estos casos es jugar otra cosa para relajarte. Acabo de perder mi promo a master de esta manera y supongo que es solo suerte  ya que dependes del desempeño de 4 jugadores más para poder ganar.","replies":[]},{"poster":"SirMaxiMuss","date":"2019-03-01T23:34:41.815+0000","up_votes":1,"down_votes":0,"body":"Actualizo\nTermine perdiendo por afks y trolls y ayer se me apago la pc de la nada\ncreo que el mundo me odia\ny por esa partida termine con suspension de chat\ninserte de imagen del perrito this is fine.jpg","replies":[]}]}