{"poster":"IWinARAM","date":"2017-05-07T18:34:15.445+0000","title":"lag spikes 10-20 times/game","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"I have been experiencing lag spikes will playing League. Now, when I say lag spikes, my ping jumps from the usual ~24 to ~70, but the fps halves and everything freezes. This has been going on for over a month.\r\n\r\nMy wife is also playing on her computer, on the same wireless connection, with no issues and entirely worse hardware.\r\n\r\nMy computer is pretty high-end, I have no issues with other games I play.\r\n6700k@4ghz, 1070(16g), 16g RAM, win10\r\nI have 100mbps down and 30mbps up, and can get near those numbers running a speedtest during play\r\nMemory usage has never gone over 64% usage\r\nCPU usage is never over 38%\r\nLoL is on an SSD, with 60% free space\r\nGenerally playing ARAM on this account, but happens in all game modes\r\n\r\nThings I have tried:\r\nReinstall LoL(deleting all folders)\r\nReinstall Directx\r\nReinstall AIR\r\nChecking system monitor during play\r\nDownloading a third party system monitor to check during play\r\nShutting down every other program running\r\nping -t google.com, no dropped packets (i can't ping pvp.net, ddos protections)\r\ntracert to pvp.net(no issues)\r\nUsed a stress testing program and found no issues\r\nComputer has never overheated, it is always monitored\r\nset leagueoflegends.exe to highest priority in resource monitor\r\ndisabled antivirus for an hour\r\nset league as exception in antivirus software\r\nuninstalled antivirus software\r\ndisabled windows firewall\r\nprobably more I'm not thinking about","replies":[{"poster":"Broporo","date":"2017-05-07T21:01:03.538+0000","up_votes":1,"down_votes":0,"body":"Wow you've definitely done your part of the troubleshooting I'd say O_O. Since you've tested all of those steps and still don't see any kind of change, it really makes me think those random ping/fps spikes are being caused by some packet loss. \n\nLet's take a quick minute to look at your latest game logs to see exactly what may have been going on there. Grab those logs, and toss 'em into our [**log reader**](https://support.riotgames.com/hc/en-us/articles/209765743), then use something like Gyazo or Imgur to link me a screenshot of what the results are,","replies":[]}]}