{"poster":"CarameI Frappe","date":"2016-11-01T16:08:10.329+0000","title":"Petition for Riot to Tweak Dawnchaser Sejuani's Splash Art","subforum":"Story, Art, & Sound","up_votes":44,"down_votes":3,"body":"**Splash Art:**\r\nhttps://1.bp.blogspot.com/-hUs0r1pNzUI/WBeby7EBUSI/AAAAAAAA_hI/-9ReSOKjRmET6QAjX3WelYns16t6UPNPQCLcB/s1600/Sejuani_Splash_7.jpg\r\n\r\n**Loading Screen Slice:**\r\nhttps://1.bp.blogspot.com/-6k2Oq-hu4B4/WBece17oXEI/AAAAAAAAXJU/5tK8LBQ_CZ02Ui1eo16fEJ4vMEQ_KDQhACEw/s1600/Sejuani_7.jpg\r\n\r\nI know Riot has a very talented art department and I never want to sound ungrateful but at the same time- I want (and those with me) to be heard about wanting Sejuani to get the right treatment. Before I start, let me show you a good splash of Sejuani- using Bear Cavalry Sejuani &amp; Poro Rider for an example:\r\n\r\nhttp://lolwp.com/wp-content/uploads/2013/06/Bear-Cavalry-Sejuani.jpg\r\nhttp://na.leagueoflegends.com/sites/default/files/styles/scale_xlarge/public/upload/sejuani_pororider_splash_1920.jpg?itok=htU2PJ9h\r\n\r\nAlthough the skins are somewhat old, look at her expression ... they&#039;re _expressive_. She isn&#039;t bored or looking like she has no clue on how to fight, but rather ... ready for the dive. Lively, anticipating the thrill of a fight, brave, fearless, you get the picture. Not to mention the way her body is animated in both splashes makes her stand out like she did achieve taming a beast the size of a truck. Now, let&#039;s look at the latest two splashes of Sejuani with Beast Hunter and the upcoming skin Dawnchaser:\r\n\r\nhttp://1.bp.blogspot.com/-ApjtgiSwtlw/Vp_ivMe4rqI/AAAAAAAA3HA/AEiJmyVi4P8/s1600/Tryndamere_Splash_8.jpg\r\nhttps://1.bp.blogspot.com/-hUs0r1pNzUI/WBeby7EBUSI/AAAAAAAA_hI/-9ReSOKjRmET6QAjX3WelYns16t6UPNPQCLcB/s1600/Sejuani_Splash_7.jpg\r\n\r\nNotice how she isn&#039;t like her character in game ... just bored, or lacking the interest to fight. In Beast Hunter, she&#039;s really small in the background with a &#039;let&#039;s just get this over with&#039; expression and no personality. Even when zooming in, the  quality of her splash dropped regardless. In the upcoming Dawnchaser skin, she doesn&#039;t seem into it whatsoever, and again the quality of her splash is quite poor. I don&#039;t demand for Riot to change the splash completely and have her like ... up front; blocking the view of the other two champions.\r\n\r\nAll I want is for them to change her face / expression. Make her look like a warrior ready to strike at the heart of her foes. Make Sejuani what she&#039;s known for: Someone who enjoys diving the enemy lines and beating the living daylights out of them. Have her splash also cleaner because her face is also blurred. I know this is an alternative version of Sejuani but I want Riot to deliver justice for her and make the girl stand out. Last 2 splashes, and people are disappointed ... it especially hurts because Dawnchaser&#039;s in-game model is quite good. I just want the splash to reflect how good her model is too.","replies":[{"poster":"Naqel","date":"2016-11-01T18:39:56.203+0000","up_votes":10,"down_votes":1,"body":"She also looks kinda derpy.","replies":[]},{"poster":"ThatHaleState","date":"2016-11-01T18:37:46.914+0000","up_votes":7,"down_votes":0,"body":"Her face is an issue yes, but what Im more troubled about is the fact that her mount is so less evident. You see part if the lions head, thats it. I think they tried to hard with the brightness and stuff. Feels overdone and too tryharded","replies":[]},{"poster":"qwercheese","date":"2016-11-01T19:58:53.108+0000","up_votes":4,"down_votes":0,"body":"She looks a lot like Phoebe from Friends.. maybe that's what they're trying to go for. Like how Corsair Quinn looks like Taylor Swift.","replies":[{"poster":"9kPluzZ","date":"2016-11-01T23:00:57.543+0000","up_votes":1,"down_votes":2,"body":"And arcade mf is Rihanna","replies":[{"poster":"Sexy Jack Rabbit","date":"2016-11-02T04:45:13.328+0000","up_votes":1,"down_votes":0,"body":"Nidalee you mean :|","replies":[]}]}]},{"poster":"9kPluzZ","date":"2016-11-01T23:00:05.115+0000","up_votes":5,"down_votes":1,"body":"Also, her right arm looks weird af","replies":[{"poster":"CarameI Frappe","date":"2016-11-02T00:06:16.569+0000","up_votes":2,"down_votes":0,"body":"Yea, that too has been bothering me. It doesn't look natural in the slightest ...","replies":[]}]},{"poster":"Hyper Stan","date":"2016-11-01T18:06:01.665+0000","up_votes":4,"down_votes":1,"body":"I fully support this notion, the splash itself is cool, but Sejuani's face doesnt make it look as if shes into it.\nthe Bard and jayce splash is fantastic, it is a shame that sejuani shares a lot of her splash with Jayce but id rather she share with Jayce and look good than sharing and looking out of both character and position","replies":[{"poster":"CarameI Frappe","date":"2016-11-01T22:41:45.960+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Hyper Stan,realm=EUW,application-id=6kFXY1kR,discussion-id=j9K8dLEg,comment-id=0000,timestamp=2016-11-01T18:06:01.665+0000)\n>\n> I fully support this notion, the splash itself is cool, but Sejuani&#x27;s face doesnt make it look as if shes into it.\n\nThat's what really troubles me overall about the splash. I'm the kind of League player who looks into the lore of every champion I enjoy playing. While I understand that skins are alternative versions / personas of said champion, their characteristics usually still apply.\n\n{{champion:113}} embraces pain, thinks of it as power, and thrives on becoming stronger due to the harsh pain she's endured. I mean, she lost her siblings to the cold and starved for many nights ... she'd walk in blizzards with no fur or food until she nearly collapsed. Sejuani is the kind of tribe leader that wouldn't back down, whom dominates with pride. The last two splash arts (Beast Hunter & Dawnchaser) totally ignore her persona and make Sejuani into a mere bodyguard with no thrill for fighting. It goes against her character greatly.\n\n_\"Show them our teeth.\"_ ~ Sejuani\n\nYet in this splash she doesn't even look like she has any experience in fighting lol. It pains me too, because the in-game model is quite awesome apart from the Lion being kind of fat which I can live with. What I hope for however, is Riot heeding to our wishes and making Sejuani in this splash the girl we came to know and love ... a fearless warrior seeking to beat down anyone who opposes her. I want to see it in the face, and see her look animated.","replies":[]}]},{"poster":"mimimi","date":"2016-11-04T15:17:22.168+0000","up_votes":2,"down_votes":0,"body":"Logged in just to vote & comment..\nI was really in love when I saw this sej's ingame model and I'm not even a Sejuani player. It looks great and has the entire \"rpg\" elf thing going for it which is a bonus. However, I have to agree that her splash art, and particularly the zoomed in version, do not do the model any justice.\n\nThe Lion is barely visible, Jayce is way too present in her loading slice, and her face... her face looks terrible. She looks like a mouthbreather, her eyes are super weird, there is no real background \"scene\" like in many other shared splasharts, and it looks like too many filters were applied in a haphazard slapdash sort of way. Like Sej's was the splash they had to do in a hurry. \n\nI really hope the skins team goes over it again because I really love this skin otherwise. Please just do us all a favor and give her a proper face!","replies":[]},{"poster":"GetMariahCarried","date":"2016-11-02T14:57:11.420+0000","up_votes":1,"down_votes":0,"body":"Look, she's hitting Garen. Sweet, adorable, totally-doesn't-have-serial-killer-activation-button-triggered-by-brush-leaves, lovable Garen. She's looking away because she can't bear the thought of it. It's totally expressive. I don't know what your deal is.","replies":[{"poster":"Moonboy65","date":"2016-11-02T19:13:34.061+0000","up_votes":2,"down_votes":0,"body":"that's Jayce {{sticker:zombie-brand-facepalm}}","replies":[{"poster":"GetMariahCarried","date":"2016-11-02T22:57:15.255+0000","up_votes":1,"down_votes":0,"body":"Oops.\n\nP.S. WHO GAVE HIM GAREN'S SHOULDER PADS!!! >:(","replies":[]}]}]},{"poster":"Hige","date":"2016-11-02T16:06:22.317+0000","up_votes":2,"down_votes":0,"body":"not sure about giving her more facial expression (being an elf and all, they're kind of dead since they are magical being as opposed to humans who are more sensitive to everything) buuuut her eyes could be a ton more expressive as opposed to white/blue lumps... or at least less ambiguous? are her eyes the white/blue or the tiny black dots?...","replies":[]},{"poster":"rtbf225618241","date":"2016-11-02T13:54:30.851+0000","up_votes":2,"down_votes":0,"body":"Tbh she barely even looks like Sejuani with that face.","replies":[]},{"poster":"JerulEon","date":"2016-11-02T00:39:15.830+0000","up_votes":2,"down_votes":0,"body":"I remember reading a similar post about beast rider Sejuani. Really hope Riot treats her better with splashes.","replies":[]},{"poster":"Owyn","date":"2016-11-02T14:25:14.579+0000","up_votes":2,"down_votes":1,"body":"You want an angry vicious Elf? - lol {{sticker:slayer-jinx-unamused}}","replies":[{"poster":"CarameI Frappe","date":"2016-11-02T15:29:23.202+0000","up_votes":1,"down_votes":0,"body":"Nah, more like an elf that's into what she's doing rather than going \"Uh, am I doing this right?\" face which you see in the splash heh. That, and it could use some polishing too.","replies":[]}]},{"poster":"Hyper Stan","date":"2016-11-06T09:49:01.960+0000","up_votes":1,"down_votes":0,"body":"The Pbe cycle is over so i believe the Hope of getting this splash updated is over, we tried boys","replies":[]},{"poster":"CarameI Frappe","date":"2016-11-03T21:32:03.214+0000","up_votes":1,"down_votes":0,"body":"I would like to thank all of you for taking the time to cast a vote if not forward your opinions on the matter. Although i'm certain our request will go unnoticed about changing up Sejuani in this splash ... it was nice to know people did have legit concern over the quality of the splash.  I'm still having my fingers crossed about Riot doing something about it, but if not ...\n... well, it was worth a try.","replies":[]},{"poster":"Lord Karhu","date":"2016-11-02T02:34:14.780+0000","up_votes":1,"down_votes":0,"body":"and I'm just sitting here waiting for them to update Twitches Splash Arts...\n\n\n{{item:3070}}","replies":[{"poster":"CarameI Frappe","date":"2016-11-02T02:44:25.595+0000","up_votes":1,"down_votes":0,"body":"https://3.bp.blogspot.com/-3UQe932m9Io/WBegTyFoDvI/AAAAAAAA_hs/vYYZ8MB1OzEE7G_TUPtoaXWH8RPFTMyAgCLcB/s1600/gE8Bqho.jpg\n\nUnless you meant you want the splash arts to come out sooner ... then I am sorry man, it happens to the best of us whom want good content.","replies":[{"poster":"Lord Karhu","date":"2016-11-03T01:20:17.998+0000","up_votes":1,"down_votes":0,"body":"{{item:3070}} finally{{item:3070}}","replies":[]}]}]},{"poster":"The Dreamwalker","date":"2016-11-02T16:14:34.290+0000","up_votes":1,"down_votes":0,"body":"She looks peeved to be in that picture.","replies":[]},{"poster":"NodaYame127","date":"2016-11-01T21:37:40.402+0000","up_votes":1,"down_votes":0,"body":"Honestly she doesn't look like something Riot would make compared to their previous skins. She looks a bit like some random RPG elf girl and this isn't me being a but douchy or exaggerating I'm just making a comparison. I know they can do way better than this.","replies":[{"poster":"Azteryz","date":"2016-11-02T06:04:00.852+0000","up_votes":1,"down_votes":0,"body":"well they are rpg skins mate but i get what you mean on the rest","replies":[]}]},{"poster":"Azteryz","date":"2016-11-02T06:02:17.623+0000","up_votes":1,"down_votes":0,"body":"i agree with the face stuff, that definitely needs some touch up\n\nbut in terms of her not being the forefront of splash arts i think its mostly because her and her mount are so damn huge and space taking it would cover the other people (group splash arts) so either they stop making group skins of her or get creative","replies":[]},{"poster":"ForgottenLuck","date":"2016-11-01T19:52:11.544+0000","up_votes":1,"down_votes":0,"body":"I rather like the beast hunter art more than the other one's main reason why I bought it","replies":[]}]}