{"poster":"SIipknot","date":"2017-06-21T07:16:32.813+0000","title":"Consejo para que no te baneen, MUTE ALL (A los 9)","subforum":"Guias y consejos","up_votes":6,"down_votes":5,"body":"{{champion:497}}","replies":[{"poster":"POLIESTER xD","date":"2017-06-22T01:50:27.206+0000","up_votes":2,"down_votes":0,"body":"Desde que muteo a todo el chat apenas entro soy mas feliz jugando.\nOjala existiera la opción de mutear permanente y automáticamente desde las configuraciones,  así como tambien mutear desde la sala de selección.","replies":[]},{"poster":"rokushoger","date":"2017-06-21T10:59:11.270+0000","up_votes":2,"down_votes":2,"body":"El mejor consejo para que no te baneen es contenerte de insultar y trolear, nada más. Tener autocontrol.","replies":[{"poster":"Main Veigar","date":"2017-06-21T14:35:14.425+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=rokushoger,realm=LAS,application-id=8sKIclmi,discussion-id=69Zqcqnq,comment-id=0001,timestamp=2017-06-21T10:59:11.270+0000)\n>\n> El mejor consejo para que no te baneen es contenerte de insultar y trolear, nada más. Tener autocontrol.\n\nSabes ?\nA mi parecer, lo que dices es tan cierto como falso.\n\nLos que trolean tienen menos probabilidad de recibir un baneo en comparación a un flammer.\n\nClaro, a los flammers es fácil acusarlos porque tienen como justicativo todo el Historial del Chat.\n\nPero a los Trolls, Riot les hace la vista gorda porque para saber si la Partida fue Troleada por un Blitz Jungla que sale 3 - 17 y un Fiddle Soporte que queda 0 - 9, no les queda más que analizar la partida, que supone una gran pérdida de tiempo, en comparación a leer un par de Frases que acusan a una persona de ser \"Flammer\".\n\nPregúntale a Killtaiwanese021 cúanto tiempo tardaron en banearlo por usar programas de Terceros, asunto que es mucho más grave que Trolear o Flamear, que ni siquiera se dieron cuenta de su existencia a pesar de tener horribles Score como salir 0 - 31 ó 0 - 35, en todas sus partidas, que son más de 50.\n\nO nos van a venir con el cuento de que es nuestra culpa por no Reportarlo ?\n\nQuizá sí, sea nuestra culpa, pero también es su culpa por no dar las explicaciones correspondientes y tampoco haberlo detectado en su \"Grandioso Sistema\" que al parecer no detectó el Programa que se utilizaba para ese acto totalmente Anti-Deportivo.\n\nTodo esto me hace pensar que Trolear pasa más desapercibido que Flamear, claro, Si quedo 2/21 con {{champion:45}} Adc, el \"Sistema no lo Detectaría\" como fedeo intencional por sólo tener esas 2 kills, cierto ?\n\nPero claro, si me pongo a insultar al que me trolea la partida, porque fué Teemo Soporte y se va AFK, tengo mayor probabilidad de recibir Ban de Chat, a que él reciba una Sanción.\n\nEl Baneo a un Flamer es totalmente justificado, lo que me da rabia es que los Trolls sigan por ahí con sus Sorakas Junglas, troleando a Diestra y Siniestra.","replies":[{"poster":"rokushoger","date":"2017-06-21T15:00:35.242+0000","up_votes":2,"down_votes":1,"body":"Vamos punto por punto a ver si te puedo aclarar un poco el panorama:\n\n> Los que trolean tienen menos probabilidad de recibir un baneo en comparación a un flammer.\n\nNo. Puede que demore más que detectar a un flamer, eso si, pero no es que tengan menos chances de ser atrapados.\n\n> Claro, a los flammers es fácil acusarlos porque tienen como justicativo todo el Historial del Chat.\n\nHistorial que no tendrían si no fueran flamers no?\n\n> Pero a los Trolls, Riot les hace la vista gorda\n\nNo es así. De hecho si revisas el foro periódicamente te vas a dar cuenta de los trolls y permaban que se dan, y eso que el foro es una pequeñisima parte de la comunidad (en serio muy pequeña), y encima de eso no todos los baneados vienen a llorar acá, son pocos los que les da el rostro.\n\n> no les queda más que analizar la partida\n\nEn este momento hay tres sistemas funcionando, de los cuales 2 son automáticos, no es necesario una revisión manual salvo en poquísimos casos.\n\n> en comparación a leer un par de Frases que acusan a una persona de ser \"Flammer\".\n\nNo es necesario comparar. No se banean más flamers cuanto menos trolls hay, se banea y chequean a todos por igual.\nObviamente hay muchos menos jugadores trolls que flamers.\n\n> Pregúntale a Killtaiwanese021 cúanto tiempo tardaron en banearlo\n\nEl problema con killtaiwanese es que el tipo crea muchas cuentas con bots, por lo tanto le baneas una y sigue haciendo cuentas, es un tema muy diferente. Y si, ya estaban al tanto de que existia, y ya tenía unas cuantas cuentas baneadas acá en las antes que saltara el tema.\n\n> O nos van a venir con el cuento de que es nuestra culpa por no Reportarlo ?\n\nNo tengo como saber si la gente reportó eso o no. Lo que si te puedo decir es que si tenés un troll en tu partida y al final nadie lo reporta, el sistema no lo va a ver, porque justamente para eso es el report, para alertar al sistema que algo estuvo mal en la partida.\n\n> pero también es su culpa\n\nEmpecemos por establecer que no pertenezco a Riot, por las dudas.\n\n> Si quedo 2/21 con Adc, el \"Sistema no lo Detectaría\" como fedeo intencional por sólo tener esas 2 kills, cierto ?\n\nNo, no es cierto, siempre y cuando alguien te haya reportado. Si no te reportan ni el sistema ni los rioters tienen bola de cristal para saber que troleaste.\n\n> Pero claro, si me pongo a insultar al que me trolea la partida, porque fué Teemo Soporte y se va AFK, tengo mayor probabilidad de recibir Ban de Chat, a que él reciba una Sanción.\n\nProbabilidad no es lo mismo que demora. Si, capaz que al tipo le demora más en caer la sanción que a vos, pero le va a caer. De todas maneras si flameaste por chat, no importa porqué, está bien que recibas una sanción.\nEs importante aclarar que nadie te obliga a flamear, ni a ragear, ni a romperle los quinotos al resto de tu equipo que nada tiene que ver con el troll, flamer o afk que provoca tu enojo. Por tanto tu estás tomando una decisión conciente de romper las reglas y por tanto se te banea, y tu caso no depende del otro, como el otro no depende del tuyo.\n\n> lo que me da rabia es que los Trolls sigan por ahí con sus Sorakas Junglas\n\nSi esa soraka jungla te terminara carreando, sería un troll para vos? Si me respondes que sí, ahí tenés otro problema, la concepción de troll que tenemos los jugadores es diferente para todos.\nCapaz que alguien me acusa de troll porque a veces voy maokai soporte (ahora no tanto, pero cuando lo jugaba hace 2 season atrás me tacharon varias veces de troll), claro, hasta que los carreaba. No se es troll por usar un pick antimeta o atípico, el troll es aquel que busca activamente dañar o molestar a otros.\n\nYo por lo que veo el problema es no solo Lol, sino que a nivel global la gente está mala, enojada, y egoísta, y eso obviamente se refleja en todos lados, incluyendo un aumento de la toxicidad en juegos, y lol, que es un juego tan masivo, no queda afuera de esto.\nLamentablemente hoy día no existe forma de parar a alguien antes de que cometa una falta (y no se si sería bueno, fijate la peli minority report XD) por lo tanto en tal cantidad de personas, que al menos un cuarto cometa una falta, parece que fuera mucho.","replies":[{"poster":"Main Veigar","date":"2017-06-21T16:18:19.012+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=rokushoger,realm=LAS,application-id=8sKIclmi,discussion-id=69Zqcqnq,comment-id=000100010000,timestamp=2017-06-21T15:00:35.242+0000)\n>\n> Vamos punto por punto a ver si te puedo aclarar un poco el panorama:\n> \n> No. Puede que demore más que detectar a un flamer, eso si, pero no es que tengan menos chances de ser atrapados.\n> \n> Historial que no tendrían si no fueran flamers no?\n> \n> No es así. De hecho si revisas el foro periódicamente te vas a dar cuenta de los trolls y permaban que se dan, y eso que el foro es una pequeñisima parte de la comunidad (en serio muy pequeña), y encima de eso no todos los baneados vienen a llorar acá, son pocos los que les da el rostro.\n> \n> En este momento hay tres sistemas funcionando, de los cuales 2 son automáticos, no es necesario una revisión manual salvo en poquísimos casos.\n> \n> No es necesario comparar. No se banean más flamers cuanto menos trolls hay, se banea y chequean a todos por igual.\n> Obviamente hay muchos menos jugadores trolls que flamers.\n> \n> El problema con killtaiwanese es que el tipo crea muchas cuentas con bots, por lo tanto le baneas una y sigue haciendo cuentas, es un tema muy diferente. Y si, ya estaban al tanto de que existia, y ya tenía unas cuantas cuentas baneadas acá en las antes que saltara el tema.\n> \n> No tengo como saber si la gente reportó eso o no. Lo que si te puedo decir es que si tenés un troll en tu partida y al final nadie lo reporta, el sistema no lo va a ver, porque justamente para eso es el report, para alertar al sistema que algo estuvo mal en la partida.\n> \n> Empecemos por establecer que no pertenezco a Riot, por las dudas.\n> \n> No, no es cierto, siempre y cuando alguien te haya reportado. Si no te reportan ni el sistema ni los rioters tienen bola de cristal para saber que troleaste.\n> \n> Probabilidad no es lo mismo que demora. Si, capaz que al tipo le demora más en caer la sanción que a vos, pero le va a caer. De todas maneras si flameaste por chat, no importa porqué, está bien que recibas una sanción.\n> Es importante aclarar que nadie te obliga a flamear, ni a ragear, ni a romperle los quinotos al resto de tu equipo que nada tiene que ver con el troll, flamer o afk que provoca tu enojo. Por tanto tu estás tomando una decisión conciente de romper las reglas y por tanto se te banea, y tu caso no depende del otro, como el otro no depende del tuyo.\n> \n> Si esa soraka jungla te terminara carreando, sería un troll para vos? Si me respondes que sí, ahí tenés otro problema, la concepción de troll que tenemos los jugadores es diferente para todos.\n> Capaz que alguien me acusa de troll porque a veces voy maokai soporte (ahora no tanto, pero cuando lo jugaba hace 2 season atrás me tacharon varias veces de troll), claro, hasta que los carreaba. No se es troll por usar un pick antimeta o atípico, el troll es aquel que busca activamente dañar o molestar a otros.\n> \n> Yo por lo que veo el problema es no solo Lol, sino que a nivel global la gente está mala, enojada, y egoísta, y eso obviamente se refleja en todos lados, incluyendo un aumento de la toxicidad en juegos, y lol, que es un juego tan masivo, no queda afuera de esto.\n> Lamentablemente hoy día no existe forma de parar a alguien antes de que cometa una falta (y no se si sería bueno, fijate la peli minority report XD) por lo tanto en tal cantidad de personas, que al menos un cuarto cometa una falta, parece que fuera mucho.\n\nNo eres Rioter, pero eres voluntario no ?\nNo importa, gracias por responder. :)","replies":[{"poster":"rokushoger","date":"2017-06-21T16:52:22.271+0000","up_votes":2,"down_votes":1,"body":"> No eres Rioter, pero eres voluntario no ?\n\nSi, justamente, voluntario, nadie me paga por esto, ni estoy de acuerdo en todo con Riot, ni debo estarlo.","replies":[{"poster":"Main Veigar","date":"2017-06-21T19:07:37.824+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=rokushoger,realm=LAS,application-id=8sKIclmi,discussion-id=69Zqcqnq,comment-id=00010001000000000000,timestamp=2017-06-21T16:52:22.271+0000)\n>\n> Si, justamente, voluntario, nadie me paga por esto, ni estoy de acuerdo en todo con Riot, ni debo estarlo.\n\nEn qué no estás de acuerdo con Riot ?\nHay algo que no te gusta ?\nDe seguro tu también tienes tu opinión, al igual que cualquiera de nosotros.\nPor ejemplo, el Nuevo Sistema de Baneos ?\nEl porqué Darius es Permabaneado en Bronce-Plata\nPorqué no Revelan la Fórmula del Elo MMR\nQué Opinas de Yasuo ?\n\nEtc, etc, de seguro tienes una opinión de todos estos temas.","replies":[{"poster":"rokushoger","date":"2017-06-22T11:02:30.657+0000","up_votes":1,"down_votes":0,"body":"Cosas en las que no estoy de acuerdo?\n\nEn bajar el nivel para rankear por ejemplo. Es más, yo pondría un mínimo de maestria con el campeón para asegurarme que no lo usen por primera vez en ranked, tipo maestria 2 o 3.\n\nPor ejemplo en no hacer una \"isla de tóxicos\" porque \"no les das chance a reformarse\". Ninguno de los que juega tiene 5 años, todos sabemos lo que está bien y lo que está mal, dejennos jugar a los que no jodemos entre nosotros y manden al olvido a los demás.\n\nLas misiones tampoco me gustan (salvo que sea algo ocasional como eventos) porque te hacen centrarte en objetivos distintos a stompear lo más que puedas y ganar.\n\n> Por ejemplo, el Nuevo Sistema de Baneos ?\n\nMe encanta. Por fin tenemos el mismo nivel de poder todos los usuarios (o al menos similar).\n\n> El porqué Darius es Permabaneado en Bronce-Plata\n\nPorque no saben pararlo, al igual que a yasuo. Yasuo es un caso aún más extremo de \"miedo residual\" de su poder anterior, que no tiene ni ahí hoy en día.\n\n> Porqué no Revelan la Fórmula del Elo MMR\n\nEn esto estoy de acuerdo. Es para que la gente no se centre más en hacer mmr que en jugar. Fijate que ya con las misiones de orden y caos hay dramas porque hay muchos que se quieren quedar farmeando cuando tienen la partida casi ganada.\n\nAhora sigo sin entender tu comentario de arriba, porque es un problema que sea voluntario? Eso invalida mis respuestas? No tengas miedo de ser directo, ser directo no es ser ofensivo, y se pueden decir las cosas directamente sin insultar.","replies":[{"poster":"Main Veigar","date":"2017-06-24T02:05:12.890+0000","up_votes":1,"down_votes":0,"body":"> Ahora sigo sin entender tu comentario de arriba, porque es un problema que sea voluntario? Eso invalida mis respuestas? No tengas miedo de ser directo, ser directo no es ser ofensivo, y se pueden decir las cosas directamente sin insultar.\n\nNo es ningún problema que tú seas voluntario.\nY no, eso no invalida tus respuestas, de ninguna forma.\nDe hecho, es bueno entender los Puntos de vista de otras personas, en especial si es voluntario.\n\nEn lo personal, creo que de alguna manera sí le da peso a las respuestas, y nos saca de las inquietudes a nosotros.\n\nGracias por tomarte el tiempo de responder.\n\nPD: No te lo tomes a mal, quizá expliqué mal mi idea.","replies":[{"poster":"rokushoger","date":"2017-06-24T12:44:30.694+0000","up_votes":1,"down_votes":0,"body":"No me lo tomo a mal, sorry, tengo un problema de que al expresarme por medio de la escritura suelo sonar brusco, solo quería entender tu punto.\n\nSaludos!","replies":[{"poster":"Main Veigar","date":"2017-06-25T04:37:01.926+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=rokushoger,realm=LAS,application-id=8sKIclmi,discussion-id=69Zqcqnq,comment-id=000100010000000000000000000000000000,timestamp=2017-06-24T12:44:30.694+0000)\n>\n> No me lo tomo a mal, sorry, tengo un problema de que al expresarme por medio de la escritura suelo sonar brusco, solo quería entender tu punto.\n> \n> Saludos!\n\nSi es así no hay problema !!\nNos vemos en alguna otra discusión, que te vaya bien. :D","replies":[]}]}]}]}]}]}]}]}]},{"poster":"Druka","date":"2017-06-21T14:27:27.724+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=rokushoger,realm=LAS,application-id=8sKIclmi,discussion-id=69Zqcqnq,comment-id=0001,timestamp=2017-06-21T10:59:11.270+0000)\n>\n> El mejor consejo para que no te baneen es contenerte de insultar y trolear, nada más. Tener autocontrol.\n\nExacto, no hay necesidad de mutear a todo el equipo, solo debes aprender a controlarte e ignorar.","replies":[{"poster":"SIipknot","date":"2017-06-26T05:52:23.979+0000","up_votes":1,"down_votes":0,"body":"Y si todos te insultan de forma spam, xq asi arranca.... 1 con otro y asi hasta q te putean o se putean todos, yo o cualquier otro tiene q ver eso insultos?  me  parece horrible poder jugar la partida d esa forma","replies":[{"poster":"Druka","date":"2017-06-26T13:37:20.600+0000","up_votes":1,"down_votes":0,"body":"Es cierto, es horrible jugar así, pero las probabilidades de que las 9 personas, (o 4 en caso de que sea solo tu equipo) te insulten solo a ti son muy bajas, como podría ser el caso de un premade de 4 personas. En caso de que fueran las 9 personas, deberías fijarte si el problema no eres tu y tal vez dijiste algo inapropiado... De todas formas, lo único que tienes que hacer es aprender a ignorar y limitar la comunicación, solamente avisar si algún enemigo gasto su flash o si no tiene ulti, avisar las mías mediante señales o felicitar por una buena jugada, ya que si hablas mas que eso y dices algo alguien lo puede tomar ofensivamente y así se desencadena todo.","replies":[{"poster":"SIipknot","date":"2017-07-05T07:47:48.337+0000","up_votes":1,"down_votes":0,"body":"como te dije antes el bloqueo a todos es xq se insultan entre ellos tmb","replies":[]}]}]}]}]},{"poster":"SeeYouLaterMorde","date":"2017-06-21T08:34:44.403+0000","up_votes":2,"down_votes":0,"body":"+1{{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"Lince Salvaje","date":"2017-06-21T13:53:22.772+0000","up_votes":1,"down_votes":2,"body":"antes que mutear diría que no flammes.\nSino insultas no te pueden banear.\n\nahora sino te podes controlar y podes perder el control por un simple juego :/ ameo tenes un problema :v","replies":[{"poster":"BlackMagician","date":"2017-06-21T15:11:44.785+0000","up_votes":1,"down_votes":2,"body":"\"Ameo\" el problema lo tendrías vos si las rankeds no te lo tomas seriamente, nada justifica el flameo. Pero si se rankea es para subir y q te toque un troll o flamer q aparte d hacerlo a propósito te insulte o moleste (xq hay más formas d molestar q solo pinquear o espamear el chat) es molesto. Y acá no es el hecho d q sea un juego \"ameo\" sino la actitud d dicha persona por hacer perder el tiempo a los demás q si queremos subir. \n\nSaludos","replies":[{"poster":"Lince Salvaje","date":"2017-06-21T15:17:48.385+0000","up_votes":1,"down_votes":2,"body":"y que tiene que ver una cosa con la otra ?\na ver el pibe te dice mutea a todos para que no te baneen.....\nen realidad lo que tenes que hacer es no flamear, es muy facil...\n\n\nAdemas quien sos vos para decir que no me tomo seriamente una ranked ?\nla tomo dentro de todo \"seria\", juego para ganar.\npero no voy a hacer un berrinche y arrancar a putear a los demas porque el juego se pierda, es un JUEGO NO ES TU VIDA.\nsi un JUEGO te puede alterar y llevarte a putear de tal manera que perdes la cuenta por flamer te digo algo TENES UN PROBLEMA DE CONTROL DE IRA.\nporque no es ni medio normal.\n\nademas explicame quien hablo de rankeds aca ?","replies":[{"poster":"BlackMagician","date":"2017-06-21T17:30:09.902+0000","up_votes":0,"down_votes":2,"body":"Problemas tendría si me pongo a insultar en una normal, aram o los demás modos jajaja. Partidas se ganan y se pierden, te vuelvo a repetir me molesta la actitud d la gente y la pérdida d tiempo innecesaria.","replies":[]}]}]}]}]}