{"poster":"Zankiix","date":"2019-10-22T07:17:56.355+0000","title":"PROBLEMA CON L'AVVIO DEL CLIENT!!! HELP!!!!!!!!!!!","subforum":"Discussioni generali","up_votes":2,"down_votes":0,"body":"Salve a tutti, è da un paio di giorni che quando cerco di aprire LoL, mi compare il logo, poi una finestra nera, grossa quanto il client, su cui non su può fare nulla... dopo un paio di minuti mi compare la scritta \"errore con il login\" o \"errore di caricamento\" con un tasto \"esci\". ovviamente l'unica cosa che posso fare è cliccarlo, dato che se premo altrove non succede nulla, e mi si chiude tutto. come posso fare a risolvere? le ho provate davvero tutte...","replies":[{"poster":"beppedessi","date":"2019-10-22T08:55:58.292+0000","up_votes":2,"down_votes":1,"body":"Hai provato a fare un \"force repacth\" con l'[Hextech Repair Tool](https://support.riotgames.com/hc/en-us/articles/224826367-Automated-Troubleshooting-Hextech-Repair-Tool)?\n\nEDIT: ho notato questo appunto sulla pagina di download dell'HRT \"If you’ve received a message saying there was an unexpected error with the login session, press Alt+F4 and sign out of the client. Then close all Riot-related tasks via Task Manager before logging back in.\" Potresti provare anche questa soluzione!","replies":[{"poster":"Zankiix","date":"2019-10-22T09:48:42.363+0000","up_votes":1,"down_votes":0,"body":"adesso provo, grazie mille comunque&lt;3","replies":[{"poster":"ganzoj","date":"2019-10-22T15:58:42.553+0000","up_votes":1,"down_votes":0,"body":"Ho lo stesso problema, anche se a me non compare nemmeno la scritta di errore, sei riuscito a risolvere?","replies":[{"poster":"Zankiix","date":"2019-10-24T07:45:34.660+0000","up_votes":1,"down_votes":0,"body":"si, cancellato tutti i file di lol e ho riscaricato tutto, per ora sembra andare","replies":[]}]}]},{"poster":"AlEx x3rO Tv","date":"2019-10-22T23:29:00.370+0000","up_votes":1,"down_votes":0,"body":"A me , nn  mi lascia entrare nel pbe.","replies":[]}]},{"poster":"Damocle","date":"2019-10-23T07:05:30.886+0000","up_votes":1,"down_votes":0,"body":"Ho lo stesso problema, risolvo chiudendo il client, terminando tutte le attività di LoL, riaprendo il client, rifacendo il log in","replies":[]}]}