{"poster":"The Abyss Lord","date":"2014-11-27T22:47:24.848+0000","title":"Anyone else agrees with me that WW needs a nerf??","subforum":"Gameplay","up_votes":21,"down_votes":15,"body":"i mean really don't need to say much hes really strong right now... i mean REALLY STRONG. and now ppl are taking {{item:3718}}  item into the lane which holy shit makes him broken. RIOT plz.....","replies":[{"poster":"Riot Stashu","date":"2014-11-27T23:06:53.644+0000","up_votes":20,"down_votes":3,"body":"Yeah he's a littttttle crazy.","replies":[{"poster":"Anonagon","date":"2014-11-27T23:22:34.412+0000","up_votes":15,"down_votes":4,"body":"> Yeah he's a littttttle crazy.\n\ncan you guys please olaf him then make his rework a higher priority. his kit is insanely binary to play against, unfun to play as, and just all around annoying to see on either team","replies":[{"poster":"FyshinaTux","date":"2014-11-28T00:26:00.170+0000","up_votes":4,"down_votes":0,"body":"I would argue that this is the case with all \"one trick pony\" champions...\n\nAnd no, I don't mean {{champion:120}}","replies":[]}]},{"poster":"5G8Nri0B54","date":"2014-11-27T23:34:48.293+0000","up_votes":4,"down_votes":2,"body":"how do we know the problem is WW or the item? Because I know Lichbane nerf was primarily because of Fizz","replies":[{"poster":"Velasan","date":"2014-11-28T04:05:22.594+0000","up_votes":1,"down_votes":0,"body":"Mostly this.  He hasn't changed in forever.  It's mostly just the skirmishers saber and not even the devourer item.  Combine both though and he can get really crazy.  On the other hand people just forget how to deal with WW which is some good CC and a banshee's veil.\n\nI was jungling WW last season and no one was like omg it's a warwick game over.  It's just the new jungle set up.","replies":[{"poster":"5G8Nri0B54","date":"2014-11-28T04:09:02.569+0000","up_votes":2,"down_votes":1,"body":"The main thing to know is...\n\n1) WW hasn't been touced in ages\n\n\n2) Suddenly he's \"OP\" due to new items.\n\n\n\nA little common sense goes a long way, yet that little bit is what everybody lacks.","replies":[{"poster":"Tourian","date":"2014-11-28T10:01:53.158+0000","up_votes":4,"down_votes":0,"body":"> The main thing to know is...\n> \n> 1) WW hasn't been touced in ages\n> \n> \n> 2) Suddenly he's \"OP\" due to new items.\n> \n> \n> \n> A little common sense goes a long way, yet that little bit is what everybody lacks.\n\nThis way of looking at is is completely inaccurate for several reasons:\na) not being nerfed in forever is a buff in and of its self\nb) power shifts in other champions effect the viability of a champion, especially counters to said champ, for example if the majority of people that counter pantheon get a nerf, pantheon gets buffed vicariously.\nc) by altering the jungle to be more aggressive, it opens up a huge advantage to sustainers because they can get ahead in cs as well as counter jungle you with little resistance.\nd) when an item becomes so well matched for a champion, especially one that does true damage this is a buff to the champ for all intents and purposes. Look at Fiora and Hydra which they had to recently nerf. In the case of Warwick the fact that both smite and his ult have the same range and are click targets and does true damage leaves no counterplay.\n\nHis win rate has gone up from 55 to 60 percent which, to be above 50 is pretty devastating, but 60 is ridiculous.","replies":[{"poster":"TrailerPark1337","date":"2014-12-01T12:41:04.596+0000","up_votes":1,"down_votes":0,"body":"I love it, that its not ok for WW to have a 59% winrate but it's ok for jinx to have almost the exact winrate as of late and yet not 1 person has mention nerf Jinx.  Just some food for thought.","replies":[]}]},{"poster":"Xx420n0sc0p3sxX","date":"2014-12-04T00:29:23.959+0000","up_votes":1,"down_votes":0,"body":"I feel like more people have noticed him because of it. He has always been strong. Now, imo, it feels like whenever a WW has ult and ganks, it's a free kill.","replies":[]},{"poster":"SexyTaylorSwift","date":"2014-12-04T00:16:23.767+0000","up_votes":1,"down_votes":1,"body":"For someone talking about common sense, it doesn't seem like you put much thought into what you said.","replies":[]},{"poster":"Keptron NA","date":"2014-11-28T16:31:16.637+0000","up_votes":1,"down_votes":1,"body":"> The main thing to know is...\n> \n> 1) WW hasn't been touced in ages\n> \n> \n> 2) Suddenly he's \"OP\" due to new items.\n> \n> \n> \n> A little common sense goes a long way, yet that little bit is what everybody lacks.\n\nYeah, people in this community normally ignore everything and shout \"X is OP!\". Probably one of the biggest problem ...","replies":[]}]},{"poster":"Gorsz","date":"2014-12-01T02:15:25.280+0000","up_votes":1,"down_votes":1,"body":"Why is it that the same cliche' excuses are always made?\n\n\"people magically forgot how to play against WW\"  Seriously dude?  WW is extremely binary are you stupid?  \n\nMore like, NEW ITEMS introduced to the game made WW overpowered.. there ya go... makes WAY more sense.","replies":[]}]},{"poster":"The Abyss Lord","date":"2014-11-27T23:49:33.820+0000","up_votes":3,"down_votes":1,"body":"well so far into the preseason i haven't seen any other champ have such steep power rise so am assuming it has something to do with the new items...","replies":[]}]},{"poster":"Muted Summoner","date":"2014-11-27T23:24:02.330+0000","up_votes":1,"down_votes":0,"body":"> Yeah he's a littttttle crazy.\n\nThe problem is the bugs. WW ult can get silenced/etc and the damage still goes off. He can also ignore the effects of GA during his ult.","replies":[{"poster":"Delimon","date":"2014-11-30T18:01:51.844+0000","up_votes":2,"down_votes":0,"body":"> > Yeah he's a littttttle crazy.\n> \n> The problem is the bugs. WW ult can get silenced/etc and the damage still goes off. He can also ignore the effects of GA during his ult.\n\n^ this as well, fix the bugs","replies":[]},{"poster":"MEAT FANGERS","date":"2014-12-03T19:22:56.205+0000","up_votes":1,"down_votes":0,"body":"...Is this why my Skarner ult doesn't stop WW's ult?  Everytime I've ulted a WW as Skarn since the updated SR it does nothing to stop his ult...WW still does tons of damage even if I drag him and my teammate is still suppressed.  \n\nI didn't know if this was intended or a glitch.","replies":[]}]},{"poster":"Muted Summoner","date":"2014-12-04T00:11:29.162+0000","up_votes":1,"down_votes":0,"body":"> Yeah he's a littttttle ~~crazy~~Buggy.\n\nthere fixed. you cc his ult and it still applies the damage. Not mention the other huge bugs with the new smite+ items","replies":[]},{"poster":"Gorsz","date":"2014-12-01T02:22:11.924+0000","up_votes":1,"down_votes":0,"body":"Ugh... why do you guys have to break shit....  now normals are going to be 100% unplayable and ranked has a 100% required ban.\n\nWW is just broken atm.   His ultimate basically 1 shots you.","replies":[]},{"poster":"Raxistaicho","date":"2014-11-30T00:16:52.435+0000","up_votes":1,"down_votes":0,"body":"I think his ult needs a rework. It offers way too little in the area of counterplay.","replies":[{"poster":"Delimon","date":"2014-11-30T17:05:32.454+0000","up_votes":1,"down_votes":0,"body":"> I think his ult needs a rework. It offers way too little in the area of counterplay.\n\nqss/cc\n\nww is a soloer not a team fighter","replies":[{"poster":"WabberJocky","date":"2014-11-30T17:23:36.583+0000","up_votes":1,"down_votes":0,"body":"Some CC doesn't even work. He ulted one of my buddies once and I pulled him completely off with a Thresh hook and it didn't even stop his ult.","replies":[{"poster":"Delimon","date":"2014-11-30T18:01:32.515+0000","up_votes":1,"down_votes":0,"body":"> Some CC doesn't even work. He ulted one of my buddies once and I pulled him completely off with a Thresh hook and it didn't even stop his ult.\n\nthe damage still goes through, if you want to minimize the damage then buy resistances, generally BV fucks WW over and so does QSS. It should be your 4th-5th item if you're fighting a WW and before that you should be warding dragon to not have any problems with him at all.\n\nEdit: I believe that's a bug\n\nWW should be disabled IMO because there are some serious bugs with him atm.","replies":[]}]}]}]},{"poster":"GhostCadillac","date":"2014-11-28T12:51:14.590+0000","up_votes":1,"down_votes":0,"body":"> Yeah he's a littttttle crazy.\n\nEnough proof.","replies":[]},{"poster":"Bears Dont Care","date":"2014-11-28T00:29:30.283+0000","up_votes":1,"down_votes":2,"body":"> Yeah he's a littttttle crazy.\n\nDoes this mean you'll push his rework?\nThere was some of it advertised in April, and it looked really good and would solve the issue of his ult applying on hit effects, and also made him much less reliant on it.\n\nRework please?","replies":[]}]},{"poster":"BlackRaven","date":"2014-11-27T23:16:18.196+0000","up_votes":7,"down_votes":1,"body":"meanwhile fizz ^","replies":[{"poster":"The Abyss Lord","date":"2014-11-27T23:56:35.571+0000","up_votes":2,"down_votes":0,"body":"that discussion is for another time.","replies":[]},{"poster":"Xx420n0sc0p3sxX","date":"2014-12-04T00:32:13.300+0000","up_votes":1,"down_votes":0,"body":"Fizz can't press r and q and watch you die while being tanky and have massive healing. Fizz may be able to kill you with a combo, but hes a glass cannon (not saying he's balanced, but when compared to ww....)","replies":[]}]},{"poster":"Jingerbeardman","date":"2014-11-27T23:23:39.675+0000","up_votes":5,"down_votes":3,"body":"nope WW isnt what needs the nerf its the item","replies":[{"poster":"Anonagon","date":"2014-11-27T23:25:49.313+0000","up_votes":2,"down_votes":7,"body":"> nope WW isnt what needs the nerf its the item\n\nww needs an individual nerf too. he was sleeper OP before the new jungle, the new jungle just made him obvious. he will still be broken after skirmisher's/devourer gets nerfed, unless he gets a nerf to his kit.","replies":[{"poster":"Jingerbeardman","date":"2014-11-28T00:03:58.053+0000","up_votes":6,"down_votes":1,"body":"I greatly disagree. Warwick has always been a feast or famine champ, he either does well and snowballs to the point he he cant be killed or is useless once his ult is over. What devourer has done is give him exactly what he needs to snowball in a relatively inexpensive item that builds out of his starter item. His pre 6 power remains the same since he has always been capable of sustaining himself in the jungle but his post 6 with an early devourer is to much to fast. \n\nthe instant he gets devourer he can start targeting the glass canons and take them out with ease furthering his snowball. There is a reason his ult cooldown went up at the same time the preseason started. issue is they recreated the feral flare fiasco by giving devourer way to much to early. the item still should have to get stacked before dealing as much damage as it does when it is first purchased right now.\n\nIf you were to go play a game as Warwick and not build devourer he would feel no different if not weaker than before preseason. that itself tells you that it is the item and not the champ that is creating the fringe power problem.\n\nThe exact same thing happened back when feral flare was first released on live. Warwick and xin zhao became the front runners in the jungle back then just like they are now, only difference being that Warwick is even stronger than xin thanks to the addition of the skirmisher smite alteration.\n\nIm right there with you that Warwick is way to strong right now. I just know that its the Item and not the champ that is the problem.","replies":[]}]},{"poster":"Loken Stoneheart","date":"2014-12-01T01:18:05.812+0000","up_votes":1,"down_votes":0,"body":"> nope WW isnt what needs the nerf its the item\n\nSo much this. I will be so angry with Riot if they nerf a champ because they introduced another broken item. When they do this, it makes it so that the champion cannot function without that item, and then when the item is finally nerfed, the champion is completely unviable. And given Riot's track record, the champion isn't buffed back up, and is left unviable for years.","replies":[{"poster":"Lajinn5","date":"2014-12-01T02:10:24.729+0000","up_votes":1,"down_votes":0,"body":"> > nope WW isnt what needs the nerf its the item\n> \n> So much this. I will be so angry with Riot if they nerf a champ because they introduced another broken item. When they do this, it makes it so that the champion cannot function without that item, and then when the item is finally nerfed, the champion is completely unviable. And given Riot's track record, the champion isn't buffed back up, and is left unviable for years.\n\nTo be fair the items doesn't seem to break many other champs, it's primarily Wick that's broken with it because his ult procs devourer and the true damage smite onhit 5 times, which lets him do utterly ridiculous damage","replies":[]},{"poster":"Jingerbeardman","date":"2014-12-01T02:04:15.232+0000","up_votes":1,"down_votes":0,"body":"Im not sure I entirely agree with what you said here. There are constant shifts in popularity going on. It might seem like a champ isn't viable when it is really that they dont fit in with the current trends. When their niche cycles back into favor they will likely pop right back into a viable pick. Obviously this is not always the case and especially if nerfs are done to champs when it is an item causing the issue. I have faith that Riot is more than aware about the issue devourer has caused and are implementing changes. If that is not what happens and nerfs roll out to champs I will be right there on the fore front of the argument to revert any such changes.\n\nThe item is the problem, a simple change can be made to fix it but it is up to Riot to follow through obviously.","replies":[]}]},{"poster":"idl1","date":"2014-11-28T05:37:58.661+0000","up_votes":1,"down_votes":1,"body":"> nope WW isnt what needs the nerf its the item\n\nIt's definitely not the item. For instance I use Devourer with Trundle and it's good, but it doesn't win the game for me.","replies":[{"poster":"zane yalgir","date":"2014-11-30T08:40:05.011+0000","up_votes":1,"down_votes":0,"body":"> > nope WW isnt what needs the nerf its the item\n> \n> It's definitely not the item. For instance I use Devourer with Trundle and it's good, but it doesn't win the game for me.\n\nits the item. the difference for trundle and ww is the passive.","replies":[]},{"poster":"Jingerbeardman","date":"2014-11-28T06:48:07.126+0000","up_votes":1,"down_votes":0,"body":"I know it seems that way but the only, and I mean only, way to actually rebalance Warwick would be to remove the on hit benefits from his ult. If you do that though... is it really Warwick anymore? answer is no. While the item may not be broken on every champ that uses it, so long as one is though it is to powerful.\n\nTruth be told though I have faced trundles that spiral out of control once they get devourer. The enchantment needs a nerf plain and simple, it gives to much power for to little a cost. Any of these champs that benefit from devourer have a similar snowball, the instant they get an inch they take a mile. that is a pretty big indicator that it is the item and not the champions that require revisions.","replies":[]}]}]},{"poster":"Delimon","date":"2014-11-28T03:42:27.253+0000","up_votes":3,"down_votes":1,"body":"no warwick already got nerfed\n\nthe problem is the fuckin item not the champ\n\ndo not nerf champs because you break them instead fix the damn item","replies":[{"poster":"Gorsz","date":"2014-12-01T02:19:21.477+0000","up_votes":1,"down_votes":0,"body":"What is the difference if they nerf WW to be in-line with the new item or just nerf the new item?  \n\nIf all champions except WW are balanced with the new item, then it makes more sense to tone down WW and leave the item as-is.","replies":[{"poster":"Delimon","date":"2014-12-01T02:21:41.698+0000","up_votes":1,"down_votes":0,"body":"> What is the difference if they nerf WW to be in-line with the new item or just nerf the new item?  \n> \n> If all champions except WW are balanced with the new item, then it makes more sense to tone down WW and leave the item as-is.\n\nhow about no because is ww gets nerfed further he'll be useless like he already is vs. a competent team","replies":[{"poster":"Gorsz","date":"2014-12-01T02:30:44.332+0000","up_votes":1,"down_votes":1,"body":"Wait.. let me get your retarded logic straight.\n\nWW just got  INSANELY BUFFED to broken status between new jungle/new jungle item,  60% win rate, 89% ban rate, and youre saying if Riot gives WW even the tiniest bit of nerf he will become magically useless.\n\nSeriously?  Use your brain, thanks.  \n\n\nNot to even mention... if Riot chooses to nerf the item to where it doesnt really benefit WW much thats the same damn thing as  a \"ww nerf\" ..just an indirect one.  \n\nDamn.. stupidity and lack of logic is annoying.","replies":[{"poster":"Loken Stoneheart","date":"2014-12-01T05:54:24.081+0000","up_votes":1,"down_votes":0,"body":"> Wait.. let me get your retarded logic straight.\n> \n> WW just got  INSANELY BUFFED to broken status between new jungle/new jungle item,  60% win rate, 89% ban rate, and youre saying if Riot gives WW even the tiniest bit of nerf he will become magically useless.\n> \n> Seriously?  Use your brain, thanks.  \n> \n> \n> Not to even mention... if Riot chooses to nerf the item to where it doesnt really benefit WW much thats the same damn thing as  a \"ww nerf\" ..just an indirect one.  \n> \n> Damn.. stupidity and lack of logic is annoying.\n\nThe problem totally isnt the item that adds 100 magic damage and 70 true damage on hit.\n\nY'know who else is dumb with it? Master Yi, who was already getting toward pick/ban status before these jungle items rolled out.\n\nY'know why nobody else is good with the item? Its an ATTACK SPEED item, which is pretty much only good on WW and Yi, maybe a handful of others I'm forgetting, because they have really stupid attack speed synergy in their kits.\n\nThe item is good on two people. Its broken on both of the people that can use it. Therefore, the item is broken.","replies":[]}]}]}]}]},{"poster":"Talamare","date":"2014-11-27T23:21:11.261+0000","up_votes":2,"down_votes":1,"body":"Relax, they are buffing him soon","replies":[]},{"poster":"Delimon","date":"2014-12-01T02:23:56.348+0000","up_votes":1,"down_votes":0,"body":"No one goes \"hey guys I got ww in aram I'm gonna wreck shit now hue hue hue.\" No they go aw fuck I got ww GG. Why? Because WW sucks pre-6. And on top of that he sucks in team fights. If you try to fight a WW 1 v 1 you're going to lose. That's one of WW\"s strengths. But add even ONE person into that mix and WW's weaknesses become obvious. But the fact that it's yolo que makes a big difference from team queing. If anything the item is what needs nerfing not ww.","replies":[]},{"poster":"Gorsz","date":"2014-12-01T02:14:06.454+0000","up_votes":1,"down_votes":0,"body":"> i mean really don't need to say much hes really strong right now... i mean REALLY STRONG. and now ppl are taking {{item:3718}}  item into the lane which holy shit makes him broken. RIOT plz.....\n\nYes.. WW is pretty overpowered right now..  he 1 shots people with his damn ultimate due to the new item.","replies":[]},{"poster":"Delimon","date":"2014-11-30T17:02:39.489+0000","up_votes":1,"down_votes":0,"body":"no because it's the item","replies":[]},{"poster":"Remlap1223","date":"2014-11-28T18:10:14.750+0000","up_votes":1,"down_votes":0,"body":"Tbh, I think a kit like Fenrir's in Smite would fit him best.  Really gives the feel of a werewolf.  Not saying it has to be copy pasted (would advise against it because his kit would have two dashes and a Skarner ultimate, a big nono.) But the idea of an ability like his ultimate that doesn't suppress targets, but sticks to them, and an ability that gives crazy life steal without it being on 24/7 would fix a lot of his problems (and not force people to take ignite and Pantheon or die.)","replies":[]},{"poster":"Vore Monster","date":"2014-11-27T23:18:53.811+0000","up_votes":1,"down_votes":0,"body":"They nerfed Skirmisher's in PBE to 3 seconds. What is still upsetting is that his smite+ulti combo still deals the same insane damage.","replies":[{"poster":"Hullabaloo907","date":"2014-11-27T23:34:02.535+0000","up_votes":1,"down_votes":0,"body":"i thought they made it dot as well","replies":[{"poster":"Vore Monster","date":"2014-11-27T23:37:17.336+0000","up_votes":1,"down_votes":0,"body":"I haven't looked at any other changes. The only one I saw was the 6-3 second nerf.","replies":[]}]}]},{"poster":"zane yalgir","date":"2014-11-30T08:39:05.659+0000","up_votes":2,"down_votes":2,"body":"> i mean really don't need to say much hes really strong right now... i mean REALLY STRONG. and now ppl are taking {{item:3718}}  item into the lane which holy shit makes him broken. RIOT plz.....\n\ndown voted cause your stupid as fuck this should have the items name not the champs also its pre season and we already have the champs nerf bat out ?","replies":[]}]}