{"poster":"erin13","date":"2016-04-15T16:45:43.008+0000","title":"@Meddler where are u guys gonna post specifics about upcoming mage , dragon, blue & red changes?","subforum":"Gameplay","up_votes":11,"down_votes":1,"body":"I appreciate that u have given details about items, when we will here about other things?","replies":[{"poster":"Meddler","date":"2016-04-15T17:45:16.452+0000","up_votes":15,"down_votes":0,"body":"Assuming things continue as expected first half of next week.","replies":[{"poster":"Jesus is Savior","date":"2016-04-15T18:21:54.201+0000","up_votes":4,"down_votes":9,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=pxnw26fN,comment-id=0000,timestamp=2016-04-15T17:45:16.452+0000)\n>\n> Assuming things continue as expected first half of next week.\n\nWhy are dragon, blue, and red changing yet AGAIN? Pls stahp.\n\nSincerely,\nA jungle main.\n\nhttp://i.imgur.com/F7ldG54.png[/img]","replies":[{"poster":"Meddler","date":"2016-04-15T22:10:07.159+0000","up_votes":12,"down_votes":0,"body":"Because if they're not impactful they're not worth contesting. Neutral objectives should drive conflict throughout the game and should result in games that feel different from each other depending on which rewards you manage to take, how fights over them go, how well suited your team is to them etc. If that's not happening the result is safer games with significant slow periods. That's been a problem with dragon in particular for a while, with the correct play sometimes being to just ignore it and do the same thing every game. Red and Blue buff have also fallen in significance a lot compared to a couple of seasons ago when they were major drivers of interaction at times.","replies":[{"poster":"AMYS GRAVE","date":"2016-04-15T22:28:04.298+0000","up_votes":17,"down_votes":2,"body":"Its not that they dont have value, its that the risk of failing in those contests is too high, ie death timers being too high. Is blue buff worth possibly dying once and losing two towers while dead?","replies":[{"poster":"Dan Abnormal","date":"2016-04-15T23:41:40.537+0000","up_votes":5,"down_votes":1,"body":"that would mean they arent worth the risk, increase the value and then all of a sudden they are. Also buffed stoped being contested in season 5, not 6, because the XP value on them droped so much compared to season 4, getting your buff stolen as a jungler nowadays is more of a minor inconvenience than an actual disadvantage.","replies":[{"poster":"AMYS GRAVE","date":"2016-04-16T00:29:09.170+0000","up_votes":4,"down_votes":3,"body":"So a blue buff should be worth a kill + 2 towers then? I dont think so....","replies":[{"poster":"Dan Abnormal","date":"2016-04-16T00:55:56.295+0000","up_votes":3,"down_votes":1,"body":"no but buffs should be worth a lot more xp so counterjungling it is ACTUALLY worth it","replies":[{"poster":"Jhaerik","date":"2016-04-16T05:47:58.081+0000","up_votes":1,"down_votes":0,"body":"I LIKE this. I've been slowly drifting away from JG as of late duo to the current state of the game. Outside of farming, and warding I don't feel I'm accomplishing much unless I'm building and stacking a devourer on a late game carry type.  Counter jungling with the current setup of \"free trinket + skuttles\" is 9 times out of 10 more risky than the reward is worth. Also with the amount of free vision availible ganking is tough to pull off.","replies":[]}]}]}]}]},{"poster":"Jesus is Savior","date":"2016-04-15T22:12:43.964+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=pxnw26fN,comment-id=000000000001,timestamp=2016-04-15T22:10:07.159+0000)\n>\n> Because if they&#x27;re not impactful they&#x27;re not worth contesting. Neutral objectives should drive conflict throughout the game and should result in games that feel different from each other depending on which rewards you manage to take, how fights over them go, how well suited your team is to them etc. If that&#x27;s not happening the result is safer games with significant slow periods. That&#x27;s been a problem with dragon in particular for a while, with the correct play sometimes being to just ignore it and do the same thing every game. Red and Blue buff have also fallen in significance a lot compared to a couple of seasons ago when they were major drivers of interaction at times.\n\nI just wanted to make sure you weren't gutting them again (eg: removing CDR, removing slow, removing true damage, etc)","replies":[{"poster":"Meddler","date":"2016-04-15T22:54:11.119+0000","up_votes":2,"down_votes":1,"body":"No, they'll be stronger overall.","replies":[{"poster":"Brutusness","date":"2016-04-16T01:11:42.316+0000","up_votes":1,"down_votes":0,"body":"Can we expect some exact changes for the mages getting minor tweaks, like Swain? We've seen the ideas you guys have but nothing solid.","replies":[{"poster":"Meddler","date":"2016-04-16T02:09:25.815+0000","up_votes":3,"down_votes":0,"body":"Current assumption is that we'll be talking about all the details Monday or Tuesday.","replies":[{"poster":"FizzIn The Water","date":"2016-04-16T08:09:56.748+0000","up_votes":1,"down_votes":0,"body":"Hey Meddler\n\nI got a question about the mage itemisation.... i see 2 things, changes in the hextech items which sounds nice....\nI also see you are trying to reduce the ap of mage items while giving them cheaper items with sometimes mana....\nWhat is the idea of reducing the ap of mages since in my opinion mages arent that strong atm compared to Tanks (Tankmeta) or Atack damage champions (they got more build paths and get free tankstats from items like Maw)","replies":[]},{"poster":"Arakadia","date":"2016-04-16T07:16:37.560+0000","up_votes":1,"down_votes":0,"body":"Awwwsome... \n\n*drools...","replies":[]}]},{"poster":"Nekusen","date":"2016-04-16T01:53:01.084+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Brutusness,realm=NA,application-id=3ErqAdtq,discussion-id=pxnw26fN,comment-id=000000000001000000000002,timestamp=2016-04-16T01:11:42.316+0000)\n>\n> Can we expect some exact changes for the mages getting minor tweaks, like Swain? We&#x27;ve seen the ideas you guys have but nothing solid.\n\nas i heard, riot will (after the mage update) start thinking in a large individual rework on Swain, but he is also listed as a mage that will get minor tweaks\n\nhttp://boards.na.leagueoflegends.com/en/c/developer-corner/a4Az9htA-mid-year-mage-updates-low-scope-mage-directions","replies":[{"poster":"Meddler","date":"2016-04-17T08:12:20.975+0000","up_votes":1,"down_votes":0,"body":"We won't be doing a major Swain rework in the short to medium term (this year). Would like to do one someday though certainly.","replies":[]}]}]},{"poster":"Mysticman89","date":"2016-04-15T23:25:17.619+0000","up_votes":1,"down_votes":0,"body":"Will jungle camps be tweaked at all based on that?\n\nMy concern is the jungle camps will be cleared faster will the additional power from the buffs so junglers will get scary, or the camps will be made stronger as well but then handing off blue/red to appropriate laners will become less practical without setting the jungler behind.","replies":[{"poster":"Abyssphere","date":"2016-04-16T04:15:45.150+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Mysticman89,realm=NA,application-id=3ErqAdtq,discussion-id=pxnw26fN,comment-id=000000000001000000000001,timestamp=2016-04-15T23:25:17.619+0000)\n>\n> Will jungle camps be tweaked at all based on that?\n> \n> My concern is the jungle camps will be cleared faster will the additional power from the buffs so junglers will get scary, or the camps will be made stronger as well but then handing off blue/red to appropriate laners will become less practical without setting the jungler behind.\n\nI can't imagine either buff being buffed in a way that would speed up jungle clear times by more than 5 seconds. I don't think you need to worry about it.\n\nBlue buff in particular is having power put into its mana regen that will be much more noticeable late game than early game, so that's gonna make no difference. If anything I imagine it's the health regen on red buff that they'll improve.","replies":[{"poster":"Mysticman89","date":"2016-04-16T05:00:58.473+0000","up_votes":1,"down_votes":0,"body":"Increased mana/health regen compared to live still wouldn't entice me to want to make any risky plays around contesting them, unless it was like mundo level of regen. The idea seems to be to make them worth fighting over, but they'd need more than just numerical tweaks imo for that to be the case, and special effects are prone to make jungle life easier (if not directly in clear times, then in ability to clear and then gank, or even just a straight buff to gank potential with no apparent trade off).\n\nI haven't put much thought into it though, and perhaps theres some clever design that makes the buffs stronger without indirectly buffing jungler potential at the same time (which I don't feel like they need, plus I'm always wary of power creep). I guess we'll find out next week or so.","replies":[]}]}]},{"poster":"Jesus is Savior","date":"2016-04-15T22:56:47.869+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=pxnw26fN,comment-id=00000000000100000000,timestamp=2016-04-15T22:54:11.119+0000)\n>\n> No, they&#x27;ll be stronger overall.\n\nYea that's cool :).\n\nAltho I probably won't be handing it over to my mid laner lol. I'll be smiting that shit and splitpushing with it.","replies":[]}]}]},{"poster":"TotalJerk","date":"2016-04-16T21:23:09.361+0000","up_votes":1,"down_votes":0,"body":"The problem is that buffing them yet again worsens the already heavy pressure on junglers to donate them. A lot of jungle mains don't want to go back to that era where they felt like a second support.","replies":[]},{"poster":"ChaosCode","date":"2016-04-16T11:47:16.874+0000","up_votes":1,"down_votes":0,"body":"Will you ever change the layout of the map, like adding brush behind the red or like small passages through the map","replies":[]},{"poster":"AATTRROOXX","date":"2016-04-15T23:54:52.147+0000","up_votes":1,"down_votes":0,"body":"What is the rough gold value on 4th dragon stack? Also, would you consider adding increased CDR cap CDR (like intelligence mastery) to the fourth stack?","replies":[]},{"poster":"Nekusen","date":"2016-04-15T23:53:00.571+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=pxnw26fN,comment-id=000000000001,timestamp=2016-04-15T22:10:07.159+0000)\n>\n> Because if they&#x27;re not impactful they&#x27;re not worth contesting. Neutral objectives should drive conflict throughout the game and should result in games that feel different from each other depending on which rewards you manage to take, how fights over them go, how well suited your team is to them etc. If that&#x27;s not happening the result is safer games with significant slow periods. That&#x27;s been a problem with dragon in particular for a while, with the correct play sometimes being to just ignore it and do the same thing every game. Red and Blue buff have also fallen in significance a lot compared to a couple of seasons ago when they were major drivers of interaction at times.\n\nPlease, i beg you PLEASE, don't turn LoL into Heroes Of The Storm, that game is super annoying the way it forces you to do some random shit, like gathering plants to summon some shit and stuff.\n\nI get the thing about conflict and stuff, but this snowball meta... no one is enjoying it, long games are not a bad thing, you can have long games with interesting stuff going on, the boring thing is when nothing happens, but it's even more boring when the winner team is decided in the first few minutes.\n\nPlease don't turns drag/red/blue buffs into \"ok, he has X buff, don't get near him or he'll get a pentakill\", neutral objectives are fun when they are something that are there to do instead of something you are forced to do or else you lose the game, that's why HoTS sucks.\n\nI bet there is be a way of making buff or objectives something that gives you something fun to use instead of raw power.","replies":[]},{"poster":"Solarus17","date":"2016-04-15T22:27:53.604+0000","up_votes":1,"down_votes":0,"body":"@medler look to be fair I think that the diving class as a whole is really weak (aatrox definitely at the lower end of the stick there) and light fighters like riven fiora are also extremely weak, I would love to talk to you about thevery state of them game as a whole, I love league of legends as a whole, and I love that you can climb with just anyone, which is why I choose aatrox and climbed to diamond with just him. But I worry that the game is really unbalanced towards him and some others ando that. Really eats at me because it was how I enjoyed my time. I have studied the game astarts a whole and it's really in a poor state right now for these champs maybe I can get your opinion","replies":[]}]},{"poster":"BADxW0LF","date":"2016-04-15T18:24:58.607+0000","up_votes":1,"down_votes":0,"body":"They are just buffs for late game.  chill out.","replies":[{"poster":"Jesus is Savior","date":"2016-04-15T18:32:22.858+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=BADxW0LF,realm=NA,application-id=3ErqAdtq,discussion-id=pxnw26fN,comment-id=000000000000,timestamp=2016-04-15T18:24:58.607+0000)\n>\n> They are just buffs for late game.  chill out.\n\nCan you source the info so I can read what's actually going on besides \"they're changing\"?","replies":[{"poster":"BADxW0LF","date":"2016-04-15T18:38:16.856+0000","up_votes":1,"down_votes":0,"body":"http://boards.na.leagueoflegends.com/en/c/gameplay-balance/ud9x0PF5-is-lost-chapters-passive-supposed-to-carry-over-to-morellos?comment=0004\n\nHere you go!","replies":[{"poster":"AMYS GRAVE","date":"2016-04-15T21:54:17.698+0000","up_votes":1,"down_votes":0,"body":"was hoping for a lmgtfy link....","replies":[{"poster":"BADxW0LF","date":"2016-04-15T22:20:41.560+0000","up_votes":1,"down_votes":0,"body":"I seriously almost did just that.  Love people who can't take the effort to do something themselves or before bitching about it.","replies":[]}]}]},{"poster":"BADxW0LF","date":"2016-04-15T18:33:34.912+0000","up_votes":1,"down_votes":0,"body":"Sure...I'll do the work for you.","replies":[]}]}]}]},{"poster":"Solidair3","date":"2016-04-15T19:44:09.974+0000","up_votes":1,"down_votes":0,"body":"Will there be a big post/article about all the changes going out with this patch, or are we just gonna be looking to the pbe for our info?","replies":[{"poster":"Meddler","date":"2016-04-15T22:03:54.423+0000","up_votes":3,"down_votes":0,"body":"Initial rundown article around the time hits PBE, a bunch of forum discussion from us and of course the PBE itself.","replies":[{"poster":"Solidair3","date":"2016-04-15T23:29:54.460+0000","up_votes":1,"down_votes":0,"body":"Rundown article is what I'm looking for here, so that's good to hear. I eagerly await to see both the major and minor kit changes.","replies":[]},{"poster":"Hinata Rabbit","date":"2016-04-15T22:22:56.993+0000","up_votes":1,"down_votes":0,"body":"Is there any things you can shed some light on about certain characters slated for updates? _*cough specifically veigar cough*_ sort of how you've stated what you wanted ziggs W to affect towers in a really cool way. \n\nIE: is veigars passive getting completely changed or is it going to be just another mana sustain passive (would rather the former. mana regen passive is boring and forgettable). what sort of things have you guys looked at to replace his Ulti's 0.8 scaling","replies":[]},{"poster":"Elewd","date":"2016-04-15T22:13:29.854+0000","up_votes":1,"down_votes":0,"body":"will there be an increased player pool on PBE for the mid season update?","replies":[]}]}]},{"poster":"Nekusen","date":"2016-04-15T20:29:08.442+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=pxnw26fN,comment-id=0000,timestamp=2016-04-15T17:45:16.452+0000)\n>\n> Assuming things continue as expected first half of next week.\n\npls make dragons only give gold again, it was way more fun and less snowbally","replies":[]},{"poster":"warpenguin555","date":"2016-04-15T20:20:26.312+0000","up_votes":1,"down_votes":0,"body":"will they get their own video thing on the news page like what taric got?","replies":[]}]},{"poster":"Solarus17","date":"2016-04-15T19:02:01.206+0000","up_votes":1,"down_votes":3,"body":"@medler how come you answer all the other post but ignore all my aatrox posts. Either way I'm assuming you look at them so it's servino it's purpose of at least shinning a spotlight on him","replies":[{"poster":"BADxW0LF","date":"2016-04-15T19:30:20.813+0000","up_votes":3,"down_votes":0,"body":"Probably because they have said multiple times that they do have plans for him, so they aren't going to bother with replying to every single thread about him.  Get's to the point that, to me, all you people want (or are desperate for) is attention from a Rioter and to get one to reply to your specific thread.  It's not like you get an achievement for it or anything.\n\nOr maybe it's just that a lot of you are too lazy to go to the search bar and search for what you want and filtering to within the last week/month/whatever to find the answers you are looking for.  So you take the time to write out some ridiculous thread when searching for it would actually take much less time.","replies":[{"poster":"Solarus17","date":"2016-04-15T21:45:48.184+0000","up_votes":1,"down_votes":1,"body":"Maybe if you took the time to look up or even cared about the champ like I do you would know that morello reply to it is that he just feels that the champ is boring and he correlates that to the poor state that he's in also he specifically states that aatrox is not anywhere close in his priority list, even though the champ has not been touched in a huge number of patchess and has been left in the dark, furthermore right now he is in the worst place he's ever been considering all the mastery changes and the meta, instead of just buffing him riot chooses to just leave him in the dark again to me that's unacceptable and is why I'm trying to shine light to the situation and elicit a response  from meddler","replies":[]}]},{"poster":"Meddler","date":"2016-04-15T22:07:06.288+0000","up_votes":6,"down_votes":2,"body":"Because there's nothing new I can add we haven't said recently about Aatrox. We don't feel he's underperforming in standard play, he's very middle of the pack in fact.","replies":[{"poster":"Solarus17","date":"2016-04-15T22:17:25.759+0000","up_votes":2,"down_votes":2,"body":"Okay well thanks a lot for responding I want to you to clearly look at his numbers, this is from someone who literally lives and breaths the champ, (over 680k mastery points and got to diamond 4 last season only playung aatrox, )he's in a horrible place and feels very unrewarding to play after the changes to the masteries. Look I will be fair in saying that tanks will probably be nerfed and he will be indirectly buffed due to it. Right now he losses to almost eveyone, he needs to snowball because his late game is so terrible, and he cant. His early game has been weakened. Fervor is the best mastery on him but it benefits him more later than early, this is very impact full because it diminishes the amount of times he actually can snowball and be effective.","replies":[{"poster":"Solarus17","date":"2016-04-15T22:19:12.151+0000","up_votes":2,"down_votes":1,"body":"In the jungle he is forced to play devourer, but unlike other devourer he can't snowball super heavy (less rewarded) I don't know what to do anymore he's the only champ I play and I'm not feeling rewarded at all this season from playing and mastering him, It pains me when all this time and effort put into this champ which I find extremely fun is not being paid off.","replies":[]}]},{"poster":"Solarus17","date":"2016-05-28T03:53:03.146+0000","up_votes":1,"down_votes":0,"body":"Aatrox is not middle of the pack take a good look at him, how low his winrate and player ate is buff him!","replies":[]},{"poster":"ImmortalBloodCY","date":"2016-04-17T05:28:46.297+0000","up_votes":1,"down_votes":0,"body":"He is actually pretty underperforming while he can still be played.","replies":[]},{"poster":"Darkinlegend","date":"2016-04-17T04:51:16.957+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=pxnw26fN,comment-id=00010001,timestamp=2016-04-15T22:07:06.288+0000)\n>\n> Because there&#x27;s nothing new I can add we haven&#x27;t said recently about Aatrox. We don&#x27;t feel he&#x27;s underperforming in standard play, he&#x27;s very middle of the pack in fact.\n\nThat's the biggest pile of shit I've ever hear Meddler--he is easily shut down by any and all CC from abilities or items. He scales like shit, and isn;t even very strong early. EVERYTHING interputs his dive, he doesn't get the benefit of it functioning like a blink like so many other champions. He is only good if he snowballs. Honestly, its like you guys don't actually pay the god damn game. Don't come at us with remarks that insult our intelligence. Aatrox is shit and everyone knows it. You repeating what you always say doesn't change that. You need to hire some mathematicians and game theory experts, not friends you are chill with, because your ability to interpret statistical data is pathetic--constantly rolling out idiotic changes to champs or masteries that everyone knows is stupid, and then rolling it back after it proves to be OP or whatever just like everyone said it was going to be a few months later.  Amazing how most of the time the players who post on the boards can spot, within 1 second, stupid changes, and you guys can not.\n\nSeriously, I don't even know what to say about such a god damn stupid remark. You literally just made me realize that Riot is amateur hour.","replies":[{"poster":"Darkinlegend","date":"2016-04-17T05:00:16.304+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Darkinlegend,realm=NA,application-id=3ErqAdtq,discussion-id=pxnw26fN,comment-id=000100010002,timestamp=2016-04-17T04:51:16.957+0000)\n>\n> That&#x27;s the biggest pile of shit I&#x27;ve ever hear Meddler--he is easily shut down by any and all CC from abilities or items. He scales like shit, and isn;t even very strong early. EVERYTHING interputs his dive, he doesn&#x27;t get the benefit of it functioning like a blink like so many other champions. He is only good if he snowballs. Honestly, its like you guys don&#x27;t actually pay the god damn game. Don&#x27;t come at us with remarks that insult our intelligence. Aatrox is shit and everyone knows it. You repeating what you always say doesn&#x27;t change that. You need to hire some mathematicians and game theory experts, not friends you are chill with, because your ability to interpret statistical data is pathetic--constantly rolling out idiotic changes to champs or masteries that everyone knows is stupid, and then rolling it back after it proves to be OP or whatever just like everyone said it was going to be a few months later.  Amazing how most of the time the players who post on the boards can spot, within 1 second, stupid changes, and you guys can not.\n> \n> Seriously, I don&#x27;t even know what to say about such a god damn stupid remark. You literally just made me realize that Riot is amateur hour.\n\nhttp://boards.na.leagueoflegends.com/en/c/gameplay-balance/iZbHysXy-aatrox-analysis-the-power-of-cc","replies":[]},{"poster":"Darkinlegend","date":"2016-04-17T04:56:58.504+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Darkinlegend,realm=NA,application-id=3ErqAdtq,discussion-id=pxnw26fN,comment-id=000100010002,timestamp=2016-04-17T04:51:16.957+0000)\n>\n> That&#x27;s the biggest pile of shit I&#x27;ve ever hear Meddler--he is easily shut down by any and all CC from abilities or items. He scales like shit, and isn;t even very strong early. EVERYTHING interputs his dive, he doesn&#x27;t get the benefit of it functioning like a blink like so many other champions. He is only good if he snowballs. Honestly, its like you guys don&#x27;t actually pay the god damn game. Don&#x27;t come at us with remarks that insult our intelligence. Aatrox is shit and everyone knows it. You repeating what you always say doesn&#x27;t change that. You need to hire some mathematicians and game theory experts, not friends you are chill with, because your ability to interpret statistical data is pathetic--constantly rolling out idiotic changes to champs or masteries that everyone knows is stupid, and then rolling it back after it proves to be OP or whatever just like everyone said it was going to be a few months later.  Amazing how most of the time the players who post on the boards can spot, within 1 second, stupid changes, and you guys can not.\n> \n> Seriously, I don&#x27;t even know what to say about such a god damn stupid remark. You literally just made me realize that Riot is amateur hour.\n\nAND even if he is viable, which he is not, he is hardly picked, and the vast majority of players think he is boring, adding little value to the game and not doing anything very well that other champions don't do better.","replies":[]}]},{"poster":"Solarus17","date":"2016-04-15T22:22:11.191+0000","up_votes":2,"down_votes":3,"body":"I mean from in game he feels extremely weak, and from websites like champion.gg he has one of the LOWEST winrate even LOWER play rate, and the people who main him have AMONG THE highest games played with him, meaning that he's underperformed by people who actually play him often","replies":[]}]}]}]}