{"poster":"SadeX21","date":"2015-02-12T05:41:54.828+0000","title":"Robo de Cuenta","subforum":"Problemas Técnicos","up_votes":1,"down_votes":0,"body":"Bueno como pueden ver en el titulo mi cuenta ha sido robada, y escribo este mensaje desde otra cuenta la cual es lvl bajo, se que el foro no es la mejor manera para contactarse con el riot pero ya use la pagina del Soporte y ya han pasado 2 dias sin ninguna respuesta a mi peticion, solo estoy publicando esto para conseguir la atencion de riot y asi poder contactarme con alguien, estoy desesperado ya que he invertido mucho tiempo y dinero en esa cuenta... ahora explicare el problema:\r\n\r\nLa contraseña de mi cuenta ha sido cambiada por lo cual no puedo acceder a ella, la persona que la robo la ha estado usando activamente desde que la robo el 10-02-2015, quise recurrir a la opcion de ''Recuperar contraseña'' pero eso necesito usar el email con el que relacione la cuenta, el problema esta en que ese email se encuentra bloqueado por el sistema de outlook , el cual no existia cuando yo cree esta cuenta, y me ha resultado imposible desbloquearlo por lo cual no puedo revisar la bandeja de entrada.\r\n\r\nSolo busco que por favor alguna autoridad de riot se me acerque para poder probar que esa cuenta es mia ya que al parecer el Soporte no me ha dado ninguna respuesta hasta ahora, se que 2 dias no es mucho tiempo pero enserio estoy desesperado.\r\n\r\nContactarme a este email: nacho.olivillo@hotmail.com ... es con este mismo email con el que ya envie 2 peticiones en el Soporte :(","replies":[{"poster":"RiotDesrtPaladin","date":"2015-02-12T12:51:35.702+0000","up_votes":2,"down_votes":0,"body":"Saludos,\n\n\nEntiendo que no tener acceso a la cuenta es preocupante. Pero,  la Recuperación de una cuenta requiere que toda la información de esas  preguntas sea verificada  para estar seguros que la persona recuperando la cuenta es el usuario correcto.\n\nRecomiendo que durante este tiempo segures tu sistema.  Por favor visita el siguiente enlace:\n\n\nhttps://support.riotgames.com/hc/es-419/articles/201751664-Protecci%C3%B3n-de-cuenta#h1\n\nPor lo general no es un proceso de unos día.","replies":[{"poster":"SadeX21","date":"2015-02-13T23:02:15.863+0000","up_votes":1,"down_votes":0,"body":"Tengo una pregunta, en mi peticion a veces aparece que hubo actividad , es decir a veces dice , ultima actividad 5 horas por ejemplo, y luego cambia a ultima actividad hace 3 minutos pero nadie me ha dejado ningun mensaje o respuesta , y yo tampoco he mandado nada , que significa eso , que alguien miro la peticion ? o que esperan que diga algo no lo se","replies":[]}]},{"poster":"ElClarke","date":"2015-02-12T07:18:56.393+0000","up_votes":2,"down_votes":0,"body":"Soporte puede tardar hasta 1 semana en responder creeria , ten paciencia.","replies":[]},{"poster":"l Lee Sin Dog l","date":"2017-04-14T05:15:13.536+0000","up_votes":1,"down_votes":0,"body":"Riot hay 1 persona  Tanto como partidas perso que en normales dice esto ''Alguien quiere rp '' ''Alguien quiere que le desbloquee todos los iconos con un bug?'' despues lo agregan y le dice solo pasame tu contraseña y nombre de usuario y las personas caen como lo se yo a esto?? ese tipo es un contacto mio  y creo que a muchas personas le habra robado sus cuentas  me se el nombre de esa persona pero nose si estaria bien decirlo","replies":[]},{"poster":"SadeX21","date":"2015-02-12T16:15:09.411+0000","up_votes":1,"down_votes":0,"body":"Ok muchas gracias, ironicamente despues de hacer todo esto he recibido una respuesta en el Soporte, me disculpo por cualquier molestia que haya causado.","replies":[]}]}