{"poster":"giddo244","date":"2015-07-04T03:20:08.161+0000","title":"Warding","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":0,"body":"Hi all! Can any of you upper elo supports, or players in general, give me some tips on warding in low elo?","replies":[{"poster":"TeCoolMage","date":"2015-07-04T15:12:16.780+0000","up_votes":1,"down_votes":0,"body":"This is how to low ELO ward.\n\nDo not be like every other unexperienced support and stick your green ward right up drags backside. It's more important to see the river around it for ganks, the drag is a second prize for the jungler, the first prize is being prepared so your ADC can live. (As supp, ADC > Jg, mid, top and yourself. Those guys should be able to take care of themselves.) that being said, always try to get the drag in your ward radius to get the best of both worlds. Put it at where the yellow marker is for the river beetle.\n\nThe other step is to nag other players into placing a pink and three greens. It is your job to risk your life by diving into the enemy jungle to place a pink ward at bot. There's two bushes in enemy jungles that rarely get checked on, the bush next to red buff and the curved bush between mid lane and jungle monsters on blue buff side. You're limited to only one, so ward the one towards bottom, and if top lane has blue on the enemy jungle, get the mid to pink it, or get the top laner to ward red buff. The lane that did ward the enemy jungle wards the isolated river bush. The ADC wards the other isolated river bush, and the jungle should know the map well enough to determine a fifth pink spot. Green wards are mind games for all other roles, but as supp you're expected to get the mandatory spots like the three edged bush, dragon, and baron. I cannot stress enough how warding is not support only. Mid is more reliant on warding IMO, and even the ADC should do it.\n\nFinally, don't rush warding. Get the perfect angle. Get both the dragon, and the river. Make sure to see the red buff monster from where you place your pink. Try to see what reveals the most, and eventually it'll be instinctive and quick.\n\nThat's how warding works for support. For other lanes, it's much more complicated IMO due to the amount of flexibility you get.\n\nBut take my advice with a truck full of rock salt, not a pinch, as I'm not a high Elo player and I get stomped on quite hard.","replies":[]},{"poster":"Lauricella3","date":"2015-07-04T13:54:29.828+0000","up_votes":1,"down_votes":0,"body":"if the area is dark, place a ward. you just saved a life congrats.","replies":[]},{"poster":"BarryButcher","date":"2015-07-04T09:38:56.886+0000","up_votes":1,"down_votes":0,"body":"It depends what side you are and what time of the game it is.\n\n_Blue side wards for laning:_ Pink in tribush, ward in front of dragon pit, ward at enemy blue buff, spare ward for lane bush or river bush.\n\n_Red side wards for laning_: Pink in river bush if you are constantly pushed, otherwise pink mid-river. Ward in tribush, in front of dragon and spare ward for lane bush.\n\nI like to keep Baron warded once it spawns and move my Pink close to Baron area. A lot of people can do early Barons now that its damaged and HP has been nerfed so much.\n\nWard deep in the enemy jungle if you are pushing, ward river if its even, ward in your own jungle if you are losing. These are VERY general tips. You have to make up your own mind where your wards should go.\n\nAlso not a bad idea to ask Top or Mid to upgrade their trinket to a normal ward dropper to help you out. 250g for a mini sightstone is really good. {{item:3361}} \n\nSome other tips:\n\nWhen you take a mid tower, it usually a good idea to place  a ward where the tower used to be so you can keep vision of that area.\nAlso warding the sides of lanes when pushing so you can see if the enemy is trying to flank you is always good.","replies":[]},{"poster":"Crowd Pleasa","date":"2015-07-04T07:05:11.224+0000","up_votes":1,"down_votes":0,"body":"As a support, or a jungler that builds sightstone, whenever you have nothing to do(eg you are walking to lane,clearing a camp, or sitting in lane while the adc farms, check that you have 3 wards down by hovering over your sighstone, if you do not, your next priority is to get those wards down, it doesnt matter where, just any area nearby that an enemy may pass through. Eventually you will ward without thinking about it, and your ward placement will improve automatically.","replies":[]},{"poster":"McRuthless","date":"2015-07-04T04:27:28.865+0000","up_votes":1,"down_votes":0,"body":"Dont think of warding only as a way to protect from ganks/stay safe/cover objectives. Aggressively placed wards (in the enemy jungle etc.) can often give you or your teammates easy kills and are a great way to get and early lead or catch up in the early-mid game. Its also important to move your wards further into the enemy jungle once your team starts getting towers so that you can snowball an advantage and reduce the chances of teammates getting caught","replies":[]},{"poster":"Ediwir","date":"2015-07-04T03:53:09.145+0000","up_votes":1,"down_votes":0,"body":"First tip and best way to learn:\nIf someone calls support in your game, buy a couple wards and pinks from time to time and ASK HIM.\n\nWarding depends largely on the phase of the game and what the team is trying to do. Writing a guide to warding would be pretty long, but you might get some real-time advice in your games :)","replies":[]}]}