{"poster":"Americans","date":"2017-01-25T14:12:13.170+0000","title":"Parche 7.2: El resumen","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"**Campeones: **\r\n\r\nWarwick: Salio el rework\r\n\r\nAkali: Ahora su r escala un poco mas con ap\r\n\r\nDarius: Menos da&ntilde;o con la pasiva en early y menos da&ntilde;o con el radio corto de la Q\r\n\r\nGragas: Su pasiva te cura un poquito mas y empiezas con 3 mas de armadura\r\n\r\nKatarina: E escala un poco peor\r\n\r\nLulu: Su Q sale menos mana y su pasiva hace un poquito mas de da&ntilde;o\r\n\r\nMaestro Yi: Su pasiva ahora funciona como la de lucian cuando mata con el primer ataque b&aacute;sico. Mientras utilice su w las activaciones de e y r se ponen en pausa, y genera una carga de pasiva por segundo\r\n\r\nNidalee: Mas vida b&aacute;sica, sus trampas son invisibles, tienen 3 de vida y hay un m&aacute;ximo de trampas en el mapa, su E cura mas.\r\n\r\nYasuo: Su E hace menos da&ntilde;o b&aacute;sico pero ahora escala con ad.\r\n\r\n\r\n**Items:**\r\n\r\nHoja Crepuscular de Draktharr: Hace mas da&ntilde;o su pasiva\r\n\r\nFilo de la Noche: La activa tiene menos cd y no te saca el sigilo\r\n\r\nSablepistola Hextech: La activa hace menos da&ntilde;o en niveles bajo\r\n\r\nRedenci&oacute;n: Menos vida base, menos regeneraci&oacute;n de mana y menos curaci&oacute;n a nivel bajo.\r\n\r\nPromesa del Caballero: 100 pe mas barato\r\n\r\nOjo del Equinoccio: Mas caro pero da 10% reducci&oacute;n de cd\r\n\r\nPebetero Ardiente: Las mejoras de velocidad de ataque y lifesteal ahora aumentan con el nivel (Muy fuerte el buff imo)\r\n\r\nC&aacute;liz de la Armon&iacute;a: Mas resistencia m&aacute;gica\r\n\r\n**General: **\r\n\r\n\r\nLetalidad ahora es un poco mejor\r\n\r\nLos monstruos de la jungla aparecen tres segundos m&aacute;s tarde.\r\n\r\nGrompo y rocoso hacen mas da&ntilde;o y la plantita de vida ahora aparece mas tarde\r\n\r\nFantasma: Tardas dos segundos en alcanzar la velocidad m&aacute;xima\r\n\r\nCoraje del Coloso: Dura menos y su escudo b&aacute;sico aumenta dependiendo de la cantidad de campeones alrededor (Mucho peor vs 1 persona, mucho mejor vs 5)\r\n\r\n_**Fin**_\r\n\r\nSource: http://lan.leagueoflegends.com/es/news/game-updates/patch/notas-de-version-72","replies":[{"poster":"WhiteMax","date":"2017-01-25T15:47:46.955+0000","up_votes":1,"down_votes":1,"body":"Gracias pero prefiero el video de Coolife :v.","replies":[{"poster":"kiuhm","date":"2017-01-25T16:21:27.636+0000","up_votes":1,"down_votes":1,"body":"No se como hacen para escuchar esa voz chillona que tiene. ni como hizo para tener esa novia ._.","replies":[{"poster":"WhiteMax","date":"2017-01-25T16:23:51.215+0000","up_votes":1,"down_votes":1,"body":"Ese es el chiste, su voz es de persona normal, pero Coolife (El personaje) tiene esa voz para llamar la atencion.\n\nY la novia la tiene porque ambos se gustan? feo no es el tipo.","replies":[{"poster":"kiuhm","date":"2017-01-25T16:26:51.644+0000","up_votes":1,"down_votes":0,"body":"> Y la novia la tiene porque ambos se gustan? feo no es el tipo.\n\n{{champion:44}}","replies":[]}]}]}]},{"poster":"AMD","date":"2017-01-25T14:15:34.256+0000","up_votes":1,"down_votes":0,"body":"En darius es menor daño con el filo del acha de 50 a 35 (radio largo)","replies":[{"poster":"Americans","date":"2017-01-25T14:18:32.953+0000","up_votes":1,"down_votes":0,"body":">DAÑO DEL MANGO 50% de daño de hoja ⇒ 35% de daño de hoja.\n\nEl daño del mango escala segun el daño de la hoja, lo que se reduce es el daño del mango, el de la hoja es igual.\n\nEsta es la descripcion de la habilidad sin tomar en cuenta este ultimo cambio: \n\n>Tras un momento de preparación, Darius esgrime el hacha a su alrededor y golpea a todos los enemigos situados en su camino. Cada unidad alcanzada recibe 40/70/100/130/160 (+105% Daño de Ataque adicional) de daño físico. Los enemigos golpeados por el mango reciben un 50% de daño (sin Hemorragia).Darius cura un 12% de su vida perdida por cada enemigo alcanzado por la hoja (máx.: 36%).","replies":[{"poster":"AMD","date":"2017-01-25T14:26:17.271+0000","up_votes":1,"down_votes":0,"body":"Sorry leí mal :)","replies":[]}]}]}]}