{"poster":"L33tmaster126","date":"2015-08-01T21:00:34.093+0000","title":"A petttion to keep dead man's plate, flesheater and trickester's glass as permanent items in league!","subforum":"Gameplay","up_votes":106,"down_votes":46,"body":"Join me if you believe that dead man&#039;s plate, flesheater, and trickester&#039;s glass should be included into normal and ranked games!!\nI feel that these items bring a whole new dynamic to league and would bring new strategies to summoners.  \nPLZ RITO{{item:3070}} {{champion:32}} {{item:3070}}","replies":[{"poster":"Avios1","date":"2015-08-01T21:59:06.933+0000","up_votes":83,"down_votes":3,"body":"Flesheater is definitely not healthy to the gameplay, and should not be kept in the game. it is broken on champs like Darius, Yi, and any other farming champ.","replies":[{"poster":"gubigubi","date":"2015-08-01T23:15:29.228+0000","up_votes":14,"down_votes":1,"body":"Not to mention it just turns every champion into like some sort of susan by forcing you to keep stacking on it.\nReally hope nothing like that ever makes it into real matchs.","replies":[{"poster":"DeathToHeretics","date":"2015-08-02T01:58:32.462+0000","up_votes":8,"down_votes":1,"body":"Went up against a {{champion:75}} who rushed that item. Laning phase didn't end for 40 minutes, and I couldn't scratch him past 15.","replies":[{"poster":"gubigubi","date":"2015-08-02T02:13:34.009+0000","up_votes":6,"down_votes":1,"body":"Oh maybe the items not as strong as I thought, that sounds like a pretty average nasus game.","replies":[{"poster":"DeathToHeretics","date":"2015-08-02T02:17:45.022+0000","up_votes":4,"down_votes":1,"body":"He rushed flesheater into SV into everything else. There was no stopping him.","replies":[{"poster":"gubigubi","date":"2015-08-02T02:46:16.904+0000","up_votes":4,"down_votes":2,"body":"That sounds just terrible lol","replies":[{"poster":"DeathToHeretics","date":"2015-08-02T02:56:58.074+0000","up_votes":24,"down_votes":1,"body":"Legends say he's still stacking to this day.","replies":[]}]}]}]}]}]},{"poster":"Diananmen Square","date":"2015-08-01T23:50:59.108+0000","up_votes":2,"down_votes":1,"body":"Not to mention how much sustain it provides to them with the active.","replies":[]}]},{"poster":"Morgy Morgy","date":"2015-08-01T21:05:21.496+0000","up_votes":46,"down_votes":4,"body":"not flesheater\nit';s not healthy in any way\nthe other items are fine tho","replies":[{"poster":"Revlak Javik","date":"2015-08-02T01:35:15.511+0000","up_votes":4,"down_votes":1,"body":"Team: \"[toplaner], HELP USSSSS!!!\"\nTop Laner {{champion:75}}: Not yet, gotta get my stacks up","replies":[]}]},{"poster":"Chaotic Reks","date":"2015-08-01T22:54:01.759+0000","up_votes":22,"down_votes":1,"body":"instead of flesheater how about {{item:3840}}","replies":[]},{"poster":"Nekusen","date":"2015-08-01T22:10:12.154+0000","up_votes":14,"down_votes":10,"body":"{{item:3742}}  kinda overlaps with omen and glory\n---\n{{item:3924}} : infinite scaling is bad for the game, it could be an option if you are behind and can't buy more expensive items, but the scaling needs to have a top limit\n---\n{{item:3829}} could be tweaked to be a support item in the main game if:\n- teleport doesn't change how you look\n- teleport is made global or with very large range\n- hp is changed to 300 or so to avoid unnecessary tankyness and focus on the utility of the active.\n-cold be built from a sup-gold item + {{item:3136}} ","replies":[{"poster":"Atik L Yar","date":"2015-08-01T22:21:53.901+0000","up_votes":19,"down_votes":3,"body":"> [{quoted}](name=Nekusen,realm=NA,application-id=3ErqAdtq,discussion-id=Pd2ep2JP,comment-id=0003,timestamp=2015-08-01T22:10:12.154+0000)\n> {{item:3829}} could be tweaked to be a support item in the main game if:\n> - teleport doesn't change how you look\n> - teleport is made global or with very large range\n> - hp is changed to 300 or so to avoid unnecessary tankyness and focus on the utility of the active.\n\nThat TOTALLY misses the point of the item.\n\nIt's not for the teleport. It's for the mind games of pretending to be your ally. It isn't a support item, it's an assassin item.","replies":[{"poster":"Nekusen","date":"2015-08-01T22:40:58.131+0000","up_votes":3,"down_votes":2,"body":"> [{quoted}](name=Atik L Yar,realm=NA,application-id=3ErqAdtq,discussion-id=Pd2ep2JP,comment-id=00030000,timestamp=2015-08-01T22:21:53.901+0000)\n>\n> That TOTALLY misses the point of the item.\n> \n> It's not for the teleport. It's for the mind games of pretending to be your ally. It isn't a support item, it's an assassin item.\n\nthe point is there is no counterplay to it, it goes against the direction of the game.\nthe way it could fit in the game is as described, the utility of teleporting to an ally is interesting for a support, but it needs to be tweaked to avoid it becoming a must buy.\nperhaps making it build from a gold item","replies":[{"poster":"macromite","date":"2015-08-01T23:10:02.680+0000","up_votes":5,"down_votes":1,"body":"there is counterplay, if you aren't literally retarded. if champ is disguised they aren't using abilities. when they attack they are no longer disguised. its like a worse version of stealth or fog of war, and those are balanced.","replies":[{"poster":"Auz the Ripper","date":"2015-08-02T03:15:19.978+0000","up_votes":4,"down_votes":0,"body":"Plus if you click on them and look at their stat box, it literally tells you who they are","replies":[{"poster":"Abyssphere","date":"2015-08-02T16:14:30.056+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Auz the Ripper,realm=NA,application-id=3ErqAdtq,discussion-id=Pd2ep2JP,comment-id=00030000000000000000,timestamp=2015-08-02T03:15:19.978+0000)\n>\n> Plus if you click on them and look at their stat box, it literally tells you who they are\n\nThen I'm not sure why anyone would want it in the game. It sounds unusable to me.","replies":[{"poster":"Auz the Ripper","date":"2015-08-03T00:56:19.549+0000","up_votes":4,"down_votes":0,"body":"It can really mess with Split second decisions","replies":[]}]}]}]}]}]},{"poster":"sp441","date":"2015-08-01T22:46:12.559+0000","up_votes":11,"down_votes":0,"body":"{{item:3742}}  increases your roaming and dueling potential, as well as increases your effectiveness in locking down priority targets, whereas {{item:3143}} improves your teamfight control and {{item:3800}} improves your initiating power.","replies":[]},{"poster":"The Yetii Rider","date":"2015-08-02T06:39:33.217+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Nekusen,realm=NA,application-id=3ErqAdtq,discussion-id=Pd2ep2JP,comment-id=0003,timestamp=2015-08-01T22:10:12.154+0000)\n>\n> {{item:3742}}  kinda overlaps with omen and glory\n\nNo. Randuin's Omen gives better armor and less health. Righteous Glory gives a TEAM ACTIVE that is completely unrelated to this.\n\nHere's the thing: Righteous Glory got nerfed because it was a supportish item being built on bruisers and fighters and non-tank supports. Okay. So the idea of the fighter or the bruiser, who has lots of damage, giving his team utility is bad. But having an item in the game that not only has a pretty decent armor and health bonus, but also gives you damage once you finally catch that stupid Kalista AND passively increases your move speed over time without a cooldown or an active to manage?\n\nIt's great. It reduces the micro required for split second decision engages and rewards you for getting there. It's a selfish Glory, or as it was once known, Force of Nature. \n\nWith Meddler stating that armor items are getting nerfed, we definitely need a good armor/health item. If Sunfire Cape's armor drops to 40 and Randuin's drops to 50, then Dead Man's Plate could stay at 55 and be the selfish, non-team related single target damage item with some mobility. That's fair, and that's how bruiser items should be designed. Tanky and initiation, with some conditional damage that doesn't affect their actual ratios.","replies":[]},{"poster":"ChaosThief","date":"2015-08-02T00:04:57.664+0000","up_votes":2,"down_votes":1,"body":"ADCs can't use flesheater.","replies":[]}]},{"poster":"Mistress Madoka","date":"2015-08-01T22:52:50.332+0000","up_votes":11,"down_votes":1,"body":"Ewww, {{item:3924}}","replies":[]},{"poster":"sp441","date":"2015-08-01T22:43:09.522+0000","up_votes":10,"down_votes":1,"body":"Other items that should be considered:\n\n{{item:3745}} : Great counter against highly mobile champions going out of control.\n{{item:3840}} line: Good counter against frustrating poke-heavy comps.\n{{item:3911}} : Good if your ADC is getting focused too heavily by Assassins.\n{{item:3150}} : Fancy that, a different option that ADCs can build!\n{{item:3430}} : Splitpushing mages? Splitpushing mages.\n\nI mean, most of them could obviously use some stat tweaks since they're most on the strong side, but they're great and I'd love to have them in the core game.","replies":[{"poster":"7ha7guy777","date":"2015-08-02T00:10:12.387+0000","up_votes":3,"down_votes":0,"body":"{{champion:45}} {{item:3430}} {{item:3100}}  goodbye turrets","replies":[]}]},{"poster":"Only A Soldier","date":"2015-08-02T00:52:38.882+0000","up_votes":5,"down_votes":0,"body":"Staff of Flowing Water or GTFO","replies":[]},{"poster":"TheFirstGokun","date":"2015-08-02T09:28:39.555+0000","up_votes":4,"down_votes":0,"body":"**Items that could definitely work healthily in game:**\n{{item:3742}} Definitely a plus to any tank's repertoire. For when Ninja Tabi just doesn't cut it.\n{{item:3433}} and all its descendants. Splitpushing, kiting and aoe damage enablers that aren't too overpowered.\n{{item:3150}} More options for ADC outside of damage? Awesome!\n{{item:3844}} Potential new support start? Yes please. Helps against super pokey lanes when you don't need the tankiness of Relic Shield.\n{{item:3745}} Really cool support option to counter super mobile opposition. Actually pretty good on Bard.\n{{item:3744}} Cool option for roaming mages.\n**Items that might work:**\n{{item:3829}} Fun, but not OP. Kinda like Zz'Rot's, it's a cool strategic option that works in some cases but isn't overpowering.\n{{item:3911}} Potentially broken? I don't really know.\n**Items that should have never been conceived:**\n{{item:3924}} Yes, please, help the Farm2Win champions even more.\n{{item:1336}} You take teleport, you have teleport. There should never be an option for a splitpushing Tryndamere to have two teleports, or a teleport and ignite.\n{{item:3652}} Oh, because Sated Devourer wasn't enough.","replies":[{"poster":"Raiku Kawisa","date":"2015-08-02T18:08:38.181+0000","up_votes":3,"down_votes":0,"body":"T. Claws doesn't stack with Sated sadly... Both use the Phantom Hit Unique active, so they dont work together...","replies":[{"poster":"Verxint","date":"2015-08-03T00:48:15.554+0000","up_votes":1,"down_votes":0,"body":"T claws could actually be a decent lane variant of devourer.\n\nUnfortunately, they feel clunky to use.","replies":[{"poster":"Raiku Kawisa","date":"2015-08-03T05:08:24.273+0000","up_votes":1,"down_votes":0,"body":"It doesn't give enough stats. Its something you buy early and then sell later to get Blade or a tank item you are missing...","replies":[{"poster":"Sire Hippington","date":"2015-08-03T21:10:56.333+0000","up_votes":1,"down_votes":0,"body":"it could get adjusted in cots and stats...\ni thik they are a better designed devourer, they don't come with an insane on-hit packed on the 50% on-hit steroid, makeing them more a supplementary buy rather than a 1-item wonder that still scales well with other items, it synergieses more with ad-ish builts as it also oncreases you normal aa-dps by 12.5%, and most of all a on 4th attack effeckt is something that adds gameplay, enemies can try to avoid the tripple hit and reengage once it run out/was used, you can try to precharge it and open with some burst - and that tripple hit is just way more statisfying, getting you AA animation damn fast 3 times in a row together with that sound is pretty damn awsome.\n\nAnd we really need a devourer for laners, it really sucks that i have to jungle if i want to go on-hit just because the most powerfull on-hit item is jungle only...","replies":[{"poster":"Raiku Kawisa","date":"2015-08-04T06:59:15.386+0000","up_votes":1,"down_votes":0,"body":"I am well aware, With some tweaks, this could very well be a really nice lane item that might pull some on hit champs back into lanes. (Shyv top?) Just not as the item is. And if they ever bring the item to the full game, its a good thing it doesn't stack with Sated... Every 5, I mean 3-4 AA (since two of them will count twice...) the next three go crazy applying on-hit 4-5 times almost instantly only for it to repeat 2 seconds later. It would be impossible for anyone other than another sated champion to deal with that...\n\nBut since it can't, Lanes on-hit would get a really nice item for it","replies":[]}]}]}]}]}]},{"poster":"Shadow Gilgamesh","date":"2015-08-02T04:56:11.526+0000","up_votes":4,"down_votes":0,"body":"Flesheater would need a serious nerf or top lane would be nothing but splitpushers \n\ntricksters, deadmans plate, and the orb of faith or whatever the new support starter item is would all be great additions though","replies":[]},{"poster":"ThatHaleState","date":"2015-08-02T04:07:16.195+0000","up_votes":4,"down_votes":0,"body":"I agree only with deadmans staying around.  It is very different and an item i believe is healthy for the game.","replies":[]},{"poster":"Wolfeur","date":"2015-08-02T00:08:43.301+0000","up_votes":4,"down_votes":0,"body":"Martyr's gambit {{item:3911}} as {{champion:201}} {{champion:89}} {{champion:223}}  is amazing!","replies":[]},{"poster":"CasterGilgamesh","date":"2015-08-01T23:11:21.865+0000","up_votes":5,"down_votes":1,"body":"i want every item but {{item:3924}} that's just broken","replies":[]},{"poster":"iainB85","date":"2015-08-02T06:38:26.263+0000","up_votes":3,"down_votes":0,"body":"These items are far from balanced for competitive play.\n\nKeep them  in custom games, and let people actually CUSTOMIZE custom games (a long standing request) and I totally agree with you.\n\nMake it like Smash Brothers when setting up a game (allow 'x' type of items) and people can get as crazy and fun as they want.","replies":[]},{"poster":"Saphixia","date":"2015-08-02T02:48:33.540+0000","up_votes":3,"down_votes":0,"body":"Deadmans plate should definitely be kept in the, or at least the pasiive","replies":[]},{"poster":"Mecha MaIphite","date":"2015-08-01T22:45:40.837+0000","up_votes":1,"down_votes":0,"body":"As a blitzcrank player, I would hate it to land a godlike pull on their low health ADC only for him to transform into a 5k hp Sion who just got a free pass into the middle of our team.","replies":[{"poster":"Poske","date":"2015-08-02T00:30:08.938+0000","up_votes":3,"down_votes":0,"body":"Thats funny because blitzcrank with that item is insanely good","replies":[]}]},{"poster":"Remlap1223","date":"2015-08-01T22:22:32.437+0000","up_votes":3,"down_votes":0,"body":"I'd much rather have Mirage Blade into the game with balance tweaks.  That's really the only item I bought from the Black Market.  I heard {{item:3742}} was pretty good too.  Trickster's glass is just cheesy, but I like it as a fun item.  \n\nMethinks Black Market Brawlers was a game mode for Riot to test potential new items.","replies":[]},{"poster":"BakedLotion","date":"2015-08-02T16:09:40.985+0000","up_votes":2,"down_votes":0,"body":"Flesheater just gives anyone unlimited sustain. It heals like 300 early game..","replies":[]},{"poster":"Sassmast3r","date":"2015-08-02T01:13:10.520+0000","up_votes":2,"down_votes":0,"body":"You know what item I REALLY want them to keep, or at least make an item similar to it? Staff of Flowing Water. It's intended to provide mana and a little bit of roaming power. I cannot express how much I love it's passive; faster movement speed in water? This would provide such strategic gameplay omg I really hope they consider either giving this passive to another item or keeping that exact item :c.","replies":[]},{"poster":"Kuroi86","date":"2015-08-02T00:04:48.184+0000","up_votes":2,"down_votes":0,"body":"Heck, bring them all onto SR, would be awesome and would really shake things up. :)","replies":[]},{"poster":"Abyssphere","date":"2015-08-01T22:14:32.057+0000","up_votes":4,"down_votes":2,"body":"I'm really not sure Trickster's Glass is something the game should have. It definitely adds unique gameplay but I'm not sure if that gameplay is healthy. Agree with everyone else on Flesheater but I do like Dead Man's Plate. Would like that for sure.","replies":[]},{"poster":"2Behold","date":"2015-08-01T22:37:43.318+0000","up_votes":3,"down_votes":2,"body":"Hell can we keep all of them? I think all of the new items are interesting and add to item variety. With the blackmarket items i have new options to build to that have interesting and unique effects.","replies":[]},{"poster":"gaby1best","date":"2015-08-01T23:37:42.286+0000","up_votes":2,"down_votes":1,"body":"Actually most of the items are here for secret testing. Just check the tanky items and wait for the next patch to see what the actual new fighter items bring.","replies":[]},{"poster":"The Soulforged","date":"2015-08-01T23:35:59.612+0000","up_votes":2,"down_votes":1,"body":"the trickster item makes you look like your ally, but clicking on the person who does that just shows you who they are :/","replies":[]},{"poster":"Crett","date":"2015-08-01T21:03:40.672+0000","up_votes":2,"down_votes":1,"body":"Flesheater's sustain is great except when enemies get it\nI love the concept \nEspecially as a melee only item.\nI get it on Sion","replies":[]},{"poster":"Protocool22","date":"2015-08-13T23:42:12.598+0000","up_votes":1,"down_votes":0,"body":"I definitly want Tricster's glass :) it became my favorite item :D","replies":[]},{"poster":"L33tmaster126","date":"2015-08-13T23:18:59.648+0000","up_votes":1,"down_votes":0,"body":"My people our prays have been answered \nit is confirmed that  {{item:3742}} is in normals I haven't seen the others but be on the look out and post if you see them\nhttp://matchhistory.na.leagueoflegends.com/en/#match-details/NA1/1917567851/210417041?tab=overview","replies":[]}]}