{"poster":"Xabaras","date":"2017-09-22T09:52:27.310+0000","title":"Start & Matchup: Soraka e Janna","subforum":"Campioni e gameplay","up_votes":1,"down_votes":0,"body":"Ciao a tutti,\r\nattualmente sono main support in silver elo e sto cercando di migliorare nel padroneggiare Janna e Soraka, quindi domando a eventuali main di questi due champion (magari in divisioni pi&ugrave; alte) in base a cosa scelgono lo start di {{item:3301}} o {{item:3303}} .\r\n\r\nHo visto che vengono giocati entrambi anche se io ho sempre utilizzato la moneta (vado raramente out of mana in early), dunque perch&eacute; preferire l&#039;uno o l&#039;altro in base al matchup e come varia la build?\r\n\r\nLa mia build con entrambi in champ &egrave; abbastanza standard e cio&egrave;:{{item:2302}}  {{item:3504}} {{item:3107}} {{item:3190}} {{item:3222}} + {{item:3117}} con Janna e {{item:3158}} con Soraka.\r\n\r\n\r\nInoltre, in base a quali matchup ritenete che sia meglio pickare Janna o Soraka? Io mi regolo unicamente preferendo Janna contro support con ingaggi tipo {{champion:412}} , {{champion:12}} o {{champion:89}} ... Avete altri accorgimenti? Grazie.","replies":[{"poster":"Signiferr","date":"2017-09-23T09:01:15.670+0000","up_votes":1,"down_votes":0,"body":"Main {{champion:40}} e ci ho fatto dal B1 al G4 da solo a spam di ranked.\nPrincipalmente io starto sempre di {{item:3301}} per i gold e il mana ( janna ha un consumo altissimo di mana ), per poi rushare {{item:3107}} se ho un vantaggio bot o {{item:3190}} se hanno un burst enorme ( assassini jungler tipo evelynn , talon ecc... ) così se non vinco il fight almeno non diamo kill.\nPoi passo di {{item:3158}} al posto delle {{item:3117}} ( tanto sono gia abbastanza veloce ).\nOvviamente {{item:2049}}  per le ward e sempre {{item:2055}} , e infine se ho un push lento {{item:3060}} ( secondo me sottovalutato ma molto forte ) e solo alla fine {{item:3069}} . ( non lo ritengo OP questo item e lo faccio alla fine, perché tanto la passiva di janna gia speedda il team se vanno verso di lei, quindi ATTENTO AL POSITIONING!)\nNon mi ritengo fortissimo ansi sono solo G4 ( e mi sono fermato per paura di scendere ) ma mi trovo molto bene con lei e ho un winrate non malaccio in ranked ) ovviamente è situazionale tutto in una partita e vedi di creare il tuo set di oggetti per quello che viene richiesto nel team.\nSpero di esserti stato d'aiuto {{sticker:galio-happy}} .","replies":[{"poster":"Xabaras","date":"2017-09-25T11:07:42.386+0000","up_votes":1,"down_votes":0,"body":"Ti ringrazio! {{item:3060}} e{{item:3069}} non li ho mai buildati su di lei... Appena mi capita l'occasione adatta in game li provo :D","replies":[]}]},{"poster":"TrueZarro","date":"2017-09-22T10:49:38.750+0000","up_votes":1,"down_votes":0,"body":"Padroneggiare janna e soraka, as if avessero bisogno di essere \"padroneggiate\" per fare bene.\n\nMain support che odia both janna e specialmente soraka, il campione (paradossalmente) più unhealthy del gioco.","replies":[{"poster":"Xabaras","date":"2017-09-22T10:57:19.441+0000","up_votes":1,"down_votes":0,"body":"Beh, che siano due champion dalle meccaniche semplici è chiaro... ma ci sarà una differenza tra una soraka diamond e una silver... Quindi mi pongo il problema e cerco di migliorare. Che sia un fatto di build o di positioning c'è sempre da migliorare... anche con {{champion:23}}  :'D","replies":[{"poster":"TrueZarro","date":"2017-09-22T11:04:46.808+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Xabaras,realm=EUW,application-id=cAOZwaUi,discussion-id=8f9iWtso,comment-id=00020000,timestamp=2017-09-22T10:57:19.441+0000)\n>\n> Beh, che siano due champion dalle meccaniche semplici è chiaro... ma ci sarà una differenza tra una soraka diamond e una silver... Quindi mi pongo il problema e cerco di migliorare. Che sia un fatto di build o di positioning c&#x27;è sempre da migliorare... anche con {{champion:23}}  :&#x27;D\n\nMa il problema non rientra tanto nella semplicitá, sono campioni che hanno meccaniche abbastanza tossiche imho, totalmente improntate sulla negazione degli sforzi degli avversari (con il minimo sforzo per ottenere ciò).\nSoraka specialmente, avere una soraka contro in lane non é mai mai un'esperienza divertente, e janna idem per quanto riguarda i team fight.\nTroppe poche meccaniche richieste per quello che é il risultato ottenuto (vedasi il winrate oscenamente alto di janna).\nJanna verrà comunque aggiustata, e soraka non è oggettivamente un supp divertente da giocare. Se ti piace quel genere di champ piuttosto gioca nami o sona, ma soraka proprio no pls ;,(","replies":[{"poster":"Xabaras","date":"2017-09-22T12:12:48.831+0000","up_votes":1,"down_votes":0,"body":"Guarda hai perfettamente ragione e sono d'accordo con te, sono main support ma sto provando anche a giocare e imparare champ dalle meccaniche più complesse e stimolanti (in toplane) ma per la fine della season vorrei salire il più alto possibile, cioè provare ad arrivare al gold o quantomeno una divisione che mi consenta di provarci la prossima season senza partire dal bronzo.\n\nGiocando solo Janna e Soraka in pochi giorni sono passato dal S 5 al S 3 e sì... come dici tu perché soprattutto a elo bassi dove i support sono focussati veramente poco, con Soraka e Janna è molto semplice carryare ogni lane e teamfight. Poi che c'entra... Gioco anche altri support tipo {{champion:53}} {{champion:89}} {{champion:267}} {{champion:117}} {{champion:25}} . Ma da qui a fine season per le ragioni che ho scritto prima voglio concentrarmi su{{champion:16}} e {{champion:40}} , imparando a giocarle ancora meglio di quanto già non faccia per potermi confrontare con elo più alti... Detto questo, insomma, non sono di certo un OTP Soraka :'D","replies":[]}]}]}]},{"poster":"Jeanne dˆArc","date":"2017-09-22T10:26:19.854+0000","up_votes":1,"down_votes":0,"body":"Tutti i champ che buildano {{item:3504}} come primo item, startano di {{item:3301}} perché fornisce molti più gold rispetto al {{item:3303}} .\nIo in questo periodo sto giocando {{champion:267}} {{champion:117}} {{champion:40}}, a seconda di chi c'è open e di quello che voglio giocare, tanto se mi trovo una lane contro cui non posso giocare aggressivo, mi basta far farmare l'adc e aspettare il suo scaling.","replies":[{"poster":"Xabaras","date":"2017-09-22T10:59:47.708+0000","up_votes":1,"down_votes":0,"body":"Ti ringrazio, ad ogni modo (visto che ce ne sono) sto aspettando un main janna o soraka che starti abitualmente di {{item:3303}} e che mi spieghi perché! :D Ripeto, anche io ho sempre e solo startato di {{item:3301}} .","replies":[]}]},{"poster":"1921 Nobel","date":"2017-09-22T10:16:04.245+0000","up_votes":1,"down_votes":1,"body":"***","replies":[{"poster":"Xabaras","date":"2017-09-22T10:27:59.599+0000","up_votes":1,"down_votes":0,"body":"Ti ringrazio, infatti è proprio quello il punto... Con Janna e Soraka gioco ovviamente molto passivo (non dico che non si possa giocare aggressivi con questi due champ), non capisco bene perché ad alti elo si possa preferire {{item:3303}} . Poi è ovvio che champ come {{champion:63}} o {{champion:143}} vogliano il {{item:3303}} .","replies":[]}]}]}