{"poster":"Masıng","date":"2019-02-01T22:41:01.560+0000","title":"Coach LF Team [Plat+]","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Abend liebe Teams,\n\nich bin Daniel, 20 Jahre alt und bin auf der Suche nach einem Team zum Coachen. \n\nKurze Infos zu mir:\n\nIch bin derzeit seit Seasonstart bei Gold und war letzte Season jedoch selbst Platin. Mechanisch bin ich Ingame nicht der beste Spieler was ich auch gerne zugebe, Makrotechnisch bin ich aber ganz gut unterwegs was f&uuml;r einen Teamcoach von Bedeutung sein wird. Ich verfolge ungef&auml;hr alles von der LEC, habe viel Kenntnis &uuml;ber gute Teamcompositionen und &uuml;ber einen erfolgreichen Draft. Desweiteren kann ich gut mit Menschen umgehen und sie motivieren und bin haupts&auml;chlich Spielerisch ein Support der in vergangenen Teams &ouml;fters die Positions des Captains und des Shotcallers eingenommen habe.\n\nWas f&uuml;r Aufgaben &uuml;bernehme ich als euren Coach?\n\nUnter anderem werde ich jede Woche Scrims organisieren [Samstag + Sonntag] und eben auch mit euch Spielern indiviuelle Gespr&auml;che halten. \nBei Scrims und Turnierspielen werde ich offiziell dabei sein und mit euch den Draft durchgehen. \nBei den normalen Trainingseinheiten unter der Woche wie z.B Flex werde ich nicht dabei sein aber ich werde dem Team Teamcombs zum &uuml;ben [spezialisiert auf das Team] vorgeben und den Spielern auch individuelle Ziele setzen. \nIhr d&uuml;rft dabei nicht auf den Unterschied zwischen dem Analysten und dem Coach vergessen. Ich bereite f&uuml;r euch die Gamepl&auml;ne und den Draft vor mit der h&ouml;chsten Winchance des Matches auf dem Papier - der Analyst schaut sich Matches im Nachhinein an und sagt euch wie ihr das spielerisch besser h&auml;ttet machen k&ouml;nnen. \n\nErwartungen an das Team:\n\nUnter anderem P&uuml;nktlichkeit und Verl&auml;sslichkeit -&gt; Ich m&ouml;chte dass Trainingszeiten eingehalten werden und dass Ziele auch verfolgt werden, daf&uuml;r gibt es ja einen Coach sonst k&ouml;nnte man gleich SoloQ spielen. Des weiteren bin ich auf der Suche nach einem ~Platin Team. Die Spieler sollten ebenso keine Onetricks sein und einen Championpool von 3-6 Champions auf relativ hohem Niveau spielen k&ouml;nnen damit man strategiem&auml;i&szlig;g auch variabel ist.\n\nDies war alles zu dem Thread. Bei Interesse bitte Ingame bei mir melden, ich freue mich schon auf ein Kennenlernen! :)\n\nMit besten Gr&uuml;&szlig;en\nDaniel aka Masıng","replies":[]}