{"poster":"Spartan Turian","date":"2015-04-12T11:27:37.283+0000","title":"Scomparsa di immagini evocatore , pagine di rune e rune","subforum":"Aiuto e supporto","up_votes":2,"down_votes":1,"body":"Salve a tutti questa mattina quando mi sono collegato a LoL per farmi una partita nella modalit&agrave; URF mi sono accorto che non avevo piu le immagini evocatore attacco orbitale e cuore esplosivo se non mi sbaglio in tal caso se mi sono sbagliato chiedo scusa ho riavviato il client ripetute volte ma niente le immagini sono scomparse magicamente anche se nella cronologia degli oggetti comprati ci sono poi sono andato a vedere sul mio profilo le rune e mi sono accorto che &egrave; scomparsa una pagina di rune e 6 gliffi dalla pagina di rune AP quindi ora mi chiedo cosa devo fare per avere tutte le mie vecchie cose ? immagini ecc ? Per favore aiutatemi . P.s. ora sto procedendo con la riparazione del client stesso sperando che cambi qualcosa :(","replies":[{"poster":"Sivions","date":"2015-04-12T12:34:12.017+0000","up_votes":1,"down_votes":0,"body":"Non sei l' unico, a me e ad altri sono scomparse skin tipo akali cacciatrice dj sona, darius delle schiacciate e altro... Sei stato anche abbastanza fortunato sotto sto punto di vista, comunque io ho aperto un topic nel supporto e attendo risposta.","replies":[{"poster":"DarkObscureNiky","date":"2015-04-12T15:06:49.099+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sivions,realm=EUW,application-id=98NGV4Al,discussion-id=v2jAKLGk,comment-id=0000,timestamp=2015-04-12T12:34:12.017+0000)\n>\n> Non sei l' unico, a me e ad altri sono scomparse skin tipo akali cacciatrice dj sona, darius delle schiacciate e altro... Sei stato anche abbastanza fortunato sotto sto punto di vista, comunque io ho aperto un topic nel supporto e attendo risposta.\n\nChe sia un'attacco da parte di hacker o un problema di rollback della riot?","replies":[]}]},{"poster":"Frattaglia","date":"2015-04-12T13:04:06.065+0000","up_votes":1,"down_votes":0,"body":"Dovete sentire il supporto, link in alto a destra","replies":[]},{"poster":"Spartan Turian","date":"2015-04-12T12:52:40.792+0000","up_votes":1,"down_votes":0,"body":"si mi sono accorto orache mi sono anche sapriti 7 champ tutti e 7 con skin....","replies":[]},{"poster":"Mistery1998","date":"2015-04-12T12:36:01.573+0000","up_votes":1,"down_votes":0,"body":"Ciao anche a me sono scomparse delle cose di grande valore circa 150 euro che avevo shoppato . in questi soldi erano compresi skin champ e  7 pagine di rune","replies":[]}]}