{"poster":"AgenttSnow","date":"2015-08-24T21:33:41.707+0000","title":"Ward Skins (Client)","subforum":"Report a Bug","up_votes":1,"down_votes":0,"body":"I had the Halloween ward Skin of the grave angel (my profile picture), which was given for free during an event. However, when the wards could be chosen shortly before a game, I accidentally selected the original ward skin and could no longer return to my Halloween event skin. I would be very grateful to get my ward skin back and hope the bug has not affected anyone else.","replies":[{"poster":"Riot LoveStrut","date":"2015-08-25T00:54:27.099+0000","up_votes":1,"down_votes":0,"body":"Hiya, AgenttSnow!\n\nI'm sorry that you're experiencing this issue. :< After relogging, are you still unable to select your grave angel ward skin?\n\nAnd when you say that you could not return to your ward skin, do you mean that you couldn't select the ward skin at all in future games? \n\nReally appreciate your help! Hopefully we can get to the bottom of this soon, so you can keep enjoying that awesome ward.\n\n-Riot LoveStrut <3","replies":[{"poster":"BA Tetsuo","date":"2015-08-25T05:40:48.784+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Riot LoveStrut,realm=NA,application-id=LqLKtMpN,discussion-id=uQOM17dZ,comment-id=0000,timestamp=2015-08-25T00:54:27.099+0000)\n>\n> Hiya, AgenttSnow!\n> \n> I'm sorry that you're experiencing this issue. :< After relogging, are you still unable to select your grave angel ward skin?\n> \n> And when you say that you could not return to your ward skin, do you mean that you couldn't select the ward skin at all in future games? \n> \n> Really appreciate your help! Hopefully we can get to the bottom of this soon, so you can keep enjoying that awesome ward.\n> \n> -Riot LoveStrut <3\n\nSounds to me like he had the halloween ward skin selected during Harrowing 2014 (When they were free to use for the duration of the event), and never actually purchased it. It remained selected (probably a glitch) after the event was over, and he accidentally deselected it, ending the glitch. I had a similar thing happen with the banner of the horse ward skin.","replies":[]}]}]}