{"poster":"Gongigo","date":"2015-11-29T03:07:17.913+0000","title":"Darius","subforum":"Off-topic y temas personales","up_votes":1,"down_votes":4,"body":"Bueno, creo que es un tema que se ha hablado bastante, pero creo que ya es hora de que hagan algo con lo rotisimo que esta darius, en mi opinion hay dos opciones, o bien bajarle el da&ntilde;o y quitarle el robo de vida de sus habilidades o simplemente quitarle el reseteo de la ulti con el kill porque basta con 1 item y las botas para hacerte un pentakill y sin siquiera bajar a la mitad de vida. creo que es hora de que riot haga algo al respecto, no es agradable jugar contra un darius.","replies":[{"poster":"GuillermoAF","date":"2015-11-29T23:27:44.261+0000","up_votes":1,"down_votes":0,"body":"Darius esta balanceado hay que saber jugarle evitando sus Q. La mas rota es fiora. Yo solo con olaf le gano en 1vs1 luego me hacen focus entre 3 y luego ya soy papel xd.","replies":[]},{"poster":"CayoElFurro","date":"2015-11-29T03:32:37.140+0000","up_votes":1,"down_votes":0,"body":"Bueno  solo dire unas palabras:\n\nDarius no esta tan roto y es facil ganarle si tenes coraje. Campeones de top con mucho daño y Velocidad de ataque le hacen counter {{champion:24}}  {{champion:11}} {{champion:114}}  ya que darius es un coloso que depende de las Team Fights (A largo plazo) , y que contra estos campeones (Fedeados) pueden dar vuelta a darius como media.\n\nSino esta en las manos del Top vencer a darius, puede estar en la de un adc bien anti-tanque . Ejemplo: {{champion:67}} +{{item:3031}} {{item:3153}} {{item:3087}} {{item:3036}} {{item:3072}} \n\n\nEs cuestion de saber jugar contra el. Enfrentarlo durante el early es casi un suicidio porque la hemorragia hace el resto a menos que seas un campeon de rango ({{champion:126}} {{champion:17}} {{champion:150}})  y  te mantegas a una distancia prudente para farmear y pockear. \n\nNota: Si vas a enfrentar a darius cuerpo a cuerpo (si por casualidad te agarra o lo emboscan) no te alejes del radio de la Q asi el no se cura y ademas solo recibes un 50% menos de daño (tengo entendido), y no te aplica hemorragia a diferencia de tocar la hoja del hacha y pase lo contrario.\n\nSoy Main Darius.\n\n\nPD: La ultima ves enfrente a un darius en top con {{champion:9}} y me fue bien {{sticker:slayer-jinx-wink}} ","replies":[]},{"poster":"Hnk Kenshiro","date":"2015-11-29T03:17:53.735+0000","up_votes":1,"down_votes":0,"body":"El reseteo de su ulti es algo carasteristico en el, es como ponerle alcanze al ulti de kathus o un yorick sin demonios,\nA mi me parece que con la pasiva haciendo daño ad, uno este permanentemente con los 6 stacks de la cuchilla oscura y el permanentemente con el bono de velocidad","replies":[]}]}