{"poster":"xXTearDropzXx","date":"2017-10-13T22:03:55.463+0000","title":"Warteschlange mit geringer Priorität (Ranked)","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":6,"body":"​Liebes LoL Team,\n\nseit gestern dem 12.10.2017 habe ich das Spiel nun wieder aktualisiert und nach einem Jahr Pause wieder angefangen zu spielen.\n\num 23:40 Uhr wollte ich ein Rankedgame spielen, kaum Startet das Spiel stand dort Verbindungsaufbau, obwohl ich eine Intakte Verbindung hatte... ich musste also das Spiel Verlassen (es ploppte die Warnung vom verlassen des Spiels auf). Als ich das spiel Verlassen habe wollte ich auf Verbindung wiederherstellen klicken, allerdings brachte das auch nichts... also hab ich das Spiel komplett geschlossen. Beim Versuch das Spiel zu starten ploppte nur kurz das League of Legends Zeichen auf und schloss sich direkt wieder. ich startete also meinen PC aneu, Obwohl meine Internetverbindung Intakt war!\n\nBeim 3. Versuch das Spiel Neuzustarten, hab ich&acute;s endlich geschafft in das noch laufende Spiel zu gelangen... Nat&uuml;rlich verloren wir es aufgrund meiner 12 Min&uuml;tigen Abwesenheit von einem Fehler der nicht von meiner Seite stammt! Wie gesagt, meine Internetverbindung war...\n\nund zu guter letzt wird mir jetzt auch noch Vorgeworfen, dass ich gegen die Regeln Versto&szlig;en habe und Ihnen angeblich mehrmals aufgefallen ist, dass ich Afk gewesen w&auml;re.... Sag mal HABT IHR SIE NOCH ALLE !?!?! Ich Spiele das Spiel einen Tag lang, habe nie gegen eine Regel Versto&szlig;en, war immer freundlich und das war das erste mal das ich das Spiel abbrechen musste und das auch noch euretwegen!!! Ich darf jetzt 3 mal 20 Minuten auf ein Spiel warten und werde runtergestuft, obwohl ich keinen Fehler begangen habe?\n\nich bitte dringlichst meine &quot;Strafe&quot; aufzuheben oder mir wenigstens eine angemessene Entschuldigung entgegenzubringen, denn die Std. die ich jetzt aufs warten vergeude, ist nicht auf meinem Mist gewachsen...\n\nMit freundlichen Gr&uuml;&szlig;en\n\nxXTearDropzXx","replies":[{"poster":"Sirrkas","date":"2017-10-13T22:55:18.758+0000","up_votes":1,"down_votes":0,"body":"Kann es sein, dass du vor deiner Pause öfter mal afk warst? Die Wartezeitstrafe für 5 Spiele 20 Minuten Strafzeit, kriegt man nämlich nicht als erste Stufe. Dafür muss man öfter aufgefallen sein.","replies":[]}]}