{"poster":"Time2Whine","date":"2017-03-17T07:00:42.231+0000","title":"Renekton vs Riven","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Guten Morgen Beschw&ouml;rer,\r\n\r\nich w&uuml;rde gerne einmal eure Meinung zu folgender Situation h&ouml;ren:\r\nIn meinem gestrigen Spiel begab sich unser Renekton (mit Ignite) auf die Toplane im Duell gegen eine Riven (mit TP). Nach ein paar Minuten stellte sich heraus, dass das eigentlich comfort Match Up unseres Renektons komplett verloren geht. Er lag nach 10 Minuten bereits mit 40 CS hinten und stand 0:3:0.\r\nUnser Shaco ging anschlie&szlig;end verbal auf ihn los, wie schlecht man sein muss ein solches Matchup mit Ignite so haushoch zu verlieren. Der Flame zwischen den beiden f&uuml;hrte letztlich zur Niederlage.\r\n\r\nMeine Frage daher an euch, mal ganz davon ab dass der Flame unn&ouml;tig und niederlagef&ouml;rdernd war, ob Renekton hier dieses MatchUp nicht verlieren darf oder ob war die Riven letztlich so stark, dass sie den Renekton besiegen konnte. Was ist in diesem Matchup entscheidend.","replies":[{"poster":"Coopa123","date":"2017-03-17T07:22:56.133+0000","up_votes":2,"down_votes":0,"body":"Renekton vs Riven ist auf jeden Fall ein matchup zugunsten von Renekton. Das heißt aber nicht dass er automatisch gewinnt. Wenn Riven einfach der bessere Spieler ist, wird sich auch die nachteile des matchups ausgleichen können. Dazu kommt natürlich noch Hilfe von den Teams.\n\nJetzt ohne zu wissen wie gut der Shaco ist oder wer der gegnerische Jungler war .... ich geh einfach davon aus, dass Shaco im Vergleich zum anderen Jungler komplett verkackt hat.","replies":[]},{"poster":"Supportsmanlike","date":"2017-03-17T09:08:47.054+0000","up_votes":1,"down_votes":0,"body":"Ich sag nur One Trick Pony.....\n\nSelbst wenn die Riven ein Smurf ist, wonach es für mich aussieht, sollte ein OTP Renekton dieses Matchup nicht verlieren.","replies":[{"poster":"Time2Whine","date":"2017-03-17T10:39:42.232+0000","up_votes":1,"down_votes":0,"body":"Zumal er nachdem er bereits stark behind war und seinen Black Cleaver fertig hatte, er {{item:3748}} anstatt {{item:3742}} oder {{item:3068}} gebaut hat. Naja verstehe wer die Leute die trotz Rückstand weiterhin auf Dmg gehen.....","replies":[{"poster":"Taybaby","date":"2017-03-17T10:45:55.060+0000","up_votes":3,"down_votes":1,"body":"renekton mit sunfire wäre auch ultra beböllert LuL","replies":[{"poster":"Taloz","date":"2017-03-20T09:47:03.921+0000","up_votes":1,"down_votes":0,"body":"Einfach mal so random Aussagen in den Raum werfen ist nicht weniger \"beböllert\".\nDu kannst mich sicher aufklären.","replies":[]}]}]},{"poster":"Sałtyy","date":"2017-03-17T15:54:45.156+0000","up_votes":1,"down_votes":0,"body":"Jeder hat nen schlechten Tag  oder verliert mal die Lane\n\nAber mit ignite und den Dmg kein FB zu aben, is echt traurig ^^","replies":[]}]},{"poster":"Taybaby","date":"2017-03-17T08:57:55.158+0000","up_votes":2,"down_votes":3,"body":"Bla bla bla,\n\nEin Renekton darf niemals gegen eine Riven verlieren. als RIven hast du KEIN natürliches Counterplay gegen Renekton. du kannst als Rene reintraden CCen und rausdashen ohne Probleme. Wenn Riven das selbe macht kannst du mit Renek durch dein E folgen und mit dem W autoattak Reset 2 AA mehr rauskriegen (AA -W- AA) und dashen.\n\n\nWenn du mit ignite spielst MUSST du nicht nur gewinnen, sondern kannst auch EASY die riven von lvl 2 an von jeglichen CS zonen indem du einfach vor deinen Minions stehst. nach 10 minuten sollte sie behind sein durch Tod oder durch XP und CS Verlust.\n\n\nWenn man als Renekton (schon ohne ignite) die Lane gegen Riven verliert , hat man den Champion nicht verstanden.\n\n\nWenn man heult, dass gegner Jungler kommt, dann ist man genauso boosted weil du ein WINNING Matchup hast. d.H. der gegner Jungler MUSS versuchen seinen Bruiser zu snowballen und shaco hat kein gutes 2 v 2 pre 6. außer du nutzt den überraschungsmoment.\n\nAlso: Ja. Wenn man als Renekton 3 mal stirbt und 40 cs behind ist, ist man einfach nur ultra schlecht","replies":[{"poster":"Taloz","date":"2017-03-20T10:09:42.158+0000","up_votes":2,"down_votes":0,"body":"Mich fasziniert mega wieviel du von \"in Highelo ist das so und so\" quatscht und andere auf ihre Elo ansprichst während du auf einem Gold 4 Account rumpimmelst.\n\nJetzt mal zum Thema.\n\nBin Renekton Main und habe letze Season mit Dia 4 beendet. Ich gewinne gegen Rivens zu 95% meine Lane.\nIn 80% der Fälle davon sehr hart. Das liegt aber meiner Vermutung nach daran, das die meisten Rivenspieler an Selbstüberschätzung leiden und zu viele Montageplays auf Youtube gesehen haben, weshalb sie zu aggressiv spielen und dafür bestraft werden. Die restlichen 20% spielen die Lane safe, nehmen jeden cs mit den sie kriegen können und disengagen dann wieder mit Q/E.\n\nTatsächlich sind wir aber nicht alle Goldelogötter wie unser TAYBABY und Ganks sind für manch einen von uns ein realistisches Szenario.\nSeien es Ganks von Invisjunglern, Laneganks, TF/Panthganks oder sonstiger Shit. Man kann sagen je früher ein für Renekton tödlicher Gank kommt desto schlimmer. Da er wenig Zeit hat um das eigentlich gute Matchup auszunutzen.  So ist es mir schonmal in der SoloQ passiert, bei einem Lvl 3 Gank gestorben zu sein und das Matchup danach nur noch even auszuspielen. Natürlich nur bis zu dem Zeitpunkt an dem Riven mich outscaled.\nHier muss man allerdings dazu sagen, dass es eine Dia 1 OTP Riven war, die genau wusste wie sie das Matchup zu spielen hat.\n\nMit anderen Worten: verlass dich nie darauf, dass eine winning lane auch wirklich eine winning lane wird. Erst recht nicht in Low Elo.","replies":[]}]},{"poster":"Sinnis","date":"2017-03-23T12:04:07.326+0000","up_votes":1,"down_votes":0,"body":"es ist einfach erklärt: riven ist ein playmaker champion mit sehr viel mobility und sehr viel schaden. renekton kann man outplayen, wie folgt: renekton macht seine e, aa, w, aa Combo. riven kann in der Zeit viel zu einfach mit e, aa, ww countern. ergo: der DMG geht von renekton zum teil ins Schild und ist auch gestunned (aber nur halb so lang). wenn riven lvl 6 ist und schon serrated Dirk hat,  wird sie diese kombo machen wenn renekton meint traiden zu müssen: e, r, (aa), w. wenn er wegdashed, followed sie mit ihrem q (sie hat erhöhte range auf den spells und erhöhte aa range). riven hat genug counterplay gegen renekton. man muss nur ca 5 von den 50 kombos gegen renekton kennen. riven hat sogesehen nur 1 counter in der laning Phase und das ist der early gank oder early babysit vom jungler oder der Mitte. \n\nIch bin Platin 5, war in der preseason 7 in der Diamant 5 promo und spiele auf der top lane only riven (sofern sie nich gebannt oder gepickt wurde). \n\nich kenne ihre matchups sehr gut. \n\nich wünsche einen angenehmen Tag :)","replies":[]},{"poster":"i hook egrills","date":"2017-03-18T21:38:33.534+0000","up_votes":1,"down_votes":0,"body":"Ich finde, dass Riven´s early game (lvl 1-2) stärker als Renekton´s ist.","replies":[{"poster":"Taloz","date":"2017-03-20T10:12:55.765+0000","up_votes":1,"down_votes":0,"body":"LvL 1 ohne Minions ja. LvL 2 nicht mehr.","replies":[]}]},{"poster":"Eternal Torment","date":"2017-03-17T09:19:25.291+0000","up_votes":1,"down_votes":0,"body":"Nicht zwingend. Counterpicks sind ein Gewinn nur zu nem begrenzten Grad. Wenn die riven gute ganks hatte oder der renekton viel zu passiv spielt kann es immernoch sein dass riven gewinnt. Der renek kann daher entweder unerfahren sein als spieler ODER mit dem champ oder hatte das pech gegen eine saugute riven zu spielen.\n\nCounterpick bedeutet nicht immer den sieg. Es bedeutet nur einen vorteil der sich durchaus counterspielen lässt. Daher sag ich dass der shaco eher mist gebaut hat mit einem verweigertem teamplay durch ganks.","replies":[{"poster":"Taybaby","date":"2017-03-17T09:59:53.586+0000","up_votes":1,"down_votes":8,"body":"Ein Renekton ist das schwierigste Riven matchup du hast als Riven kein Counter Play gegen renek.\n\nvllt in bronze kannst du als Riven gewinnen oder so, aber wenn 2 Leute mit hirn spielen ist da nix zu holen.\n\nIn dia 5 renekton rasiert eine d2 d 1 riven aus dem leben\n\n\nwenn du geganked wirst und den jungler nicht siehst, dann bist du boosted weil du ein UNVERLIERBARES matchup spielst! KLAR versucht enemy jungler zu ganken.\n\nWenn mann keinen Plan von beiden Champs hat sollte man vllt nicht einfach dummen Kram posten\n\ndu bist silber 5 mit 50 % winratio aus 116 games und hast in den letzten 3 seasons weder riven noch renekton gespielt in rankeds.\n\n\nAber das ist immer so, selbst wenn ich auf diesem acc smurffe egal ob silber oder gold, klugscheißen könnt ihr","replies":[{"poster":"OrangeBubble","date":"2017-03-17T13:25:34.658+0000","up_votes":1,"down_votes":0,"body":"Nur weil Renekton der Counterpick von einer Riven ist (Renekton hat einen VORTEIL gegenüber Riven), heißt es nicht, dass er automatisch gewinnt. Nichts mehr hat Scary gesagt. Damit hat er auch Recht ~\n\nAlso bevor du so blöd daher kommst und mit dem Elo Penis angeben willst, solltest du vielleicht lernen, Sätze nicht nur zu lesen, sondern evtl. auch zu verstehen, dann hättest du dir deinen komplett sinnfreien Post ersparen können :) Denn der Satz \"du hast als Riven kein Counter Play gegen renek.\" deutet an, dass du denkst, er hätte ausgesagt, Riven sei ein Counter zu Renekton, was schlichtweg nicht stimmt.","replies":[{"poster":"Taybaby","date":"2017-03-17T14:18:26.508+0000","up_votes":1,"down_votes":2,"body":"Deinen Rat gebe ich an dich zurück.\n\nRiven hat kein Counter play bedeutet: Renek ist rivens counter... versuch doch mal sätze zu verstehen:\n\nA hat kein Counterplay gegen B dh. B hat einen großen vorteil gegenüber A\n\nDiese Diskussion fühlt sich ja an wie platin 5 solo Q alle wissen hier was lul^^\n\n\nRiven hat kein Counterplay weil: Ihre E range = E range renek. Renek double dash CC den man nicht animation canceln muss und kann 3 aas rauskriegen + 1 q während riven 1 Q macht.\n\n\nAlso pls.","replies":[{"poster":"OrangeBubble","date":"2017-03-17T20:34:13.407+0000","up_votes":1,"down_votes":0,"body":"Lul wenn Hopfen und Malz verloren sind. \n\nIch sehe, du hast meinen gesamten Post schlichtweg nicht verstanden und erst gar nicht, worauf ich eigentlich hinaus wollte \n\n{{sticker:zombie-brand-facepalm}}","replies":[]},{"poster":"Sinnis","date":"2017-03-23T11:52:45.555+0000","up_votes":1,"down_votes":0,"body":"renekton is ein natürlicher counter von riven, weil er sehr starken sustain hat.\nrenekton kann diese lane nur gewinnen wenn die riven vollzeitretarded ist oder der renekton permanent mit 50+ Zorn rumrennt. wenn riven instant mit lvl 6 back geht und sich serrated Dirk kauft , kann sie renekton nahezu One-Shotten (vorraussetzung dafür: full lethality Runen mit armor und entsprechend cdr) \nich Maine riven seit s5 und ich habe mehr Angst vor einem Darius (der free feed für riven ist) als vor einem renekton. sobald renekton nur 1 spell wasted is er schon tot.","replies":[]}]}]},{"poster":"Eternal Torment","date":"2017-03-17T10:14:32.066+0000","up_votes":1,"down_votes":0,"body":"Grob werden musst du mal nicht und was du siehst sind die S7 statistiken. Normal spiele siehst du nicht und dass du mich so einseitig bewertest war zu erwarten. Wie gesagt counterpicks sind kein garantierter sieg. Sie sind bloss ein vorteil. Du hast es selbst gesagt dass die beiden spieler hirn haben. Wenn riven halt gut aufpasst oder renek neu im champ ist is verlieren durch aus möglich. League of legends ist ein spiel daher gibt es sowas wie garantierte siege nicht. \n\nFrech werden musstest du da mal schon gar nicht","replies":[{"poster":"Time2Whine","date":"2017-03-17T10:27:58.759+0000","up_votes":1,"down_votes":0,"body":"Die Erfahrung des Renektons auf dem Champ lag bei 400 k Exp, da er es während des Shaco Flames selber gesagt hat. Er weiß also wie man den Champ spielt.","replies":[{"poster":"Supportsmanlike","date":"2017-03-17T10:32:06.387+0000","up_votes":1,"down_votes":0,"body":"Sind es nicht 700k?","replies":[{"poster":"Eternal Torment","date":"2017-03-17T10:39:09.953+0000","up_votes":1,"down_votes":0,"body":"Kp ich sprech hier nur aus vermutung und neutral.","replies":[]}]}]}]},{"poster":"CustomKunibert","date":"2017-03-17T10:56:16.321+0000","up_votes":1,"down_votes":0,"body":"Chill mal, er hat doch nur mal gefragt :D\nIst doch klar, dass er es sich erklären lassen will, da musst du ihm nicht vorhalten, warum er es sich erklären lassen sollte - sondern es ihm erklären :P","replies":[]}]}]},{"poster":"Doo ","date":"2017-03-17T18:57:57.342+0000","up_votes":1,"down_votes":0,"body":"Naja, es gibt die 0/12/3 Rivens und es gibt die guten Rivens, welche man sehr selten antrifft. Wenn man gegen einen guten Rivenspieler ran muss, dann kann man auch als durchschnittlicher Renekton-Spieler nicht viel machen.","replies":[]},{"poster":"OrangeBubble","date":"2017-03-17T13:19:20.923+0000","up_votes":1,"down_votes":0,"body":"Ein OTP Renekton sollte nicht gegen eine Riven so haushoch verlieren bzw. eigentlich gar nicht verlieren.\nGenerell sollte ein Renekton keine große Probleme haben gegen eine Riven bei gleichem Skillniveau.","replies":[]},{"poster":"TheLastAirbender","date":"2017-03-17T12:20:56.917+0000","up_votes":1,"down_votes":0,"body":"Wie kann man sich denn so vom Counterpick leiten lassen..\nRiven war der bessere Spieler, weshalb sie gewonnen hat. Hat nichts mit den Champs zu tun =)","replies":[]},{"poster":"Taybaby","date":"2017-03-17T10:48:18.953+0000","up_votes":1,"down_votes":1,"body":"btw glaube der Renek hat sich ne runde Eloboost gegönnt","replies":[]},{"poster":"Taybaby","date":"2017-03-17T10:37:25.634+0000","up_votes":1,"down_votes":3,"body":"Wenn man ohne arme spielt kann man auch verlieren,\n\n\naber das kann nicht der maßstab sein","replies":[]}]}