{"poster":"Pandabowl","date":"2018-01-18T05:14:06.487+0000","title":"Game crash on start (got put in low priority queue and counted as a lost in rank)","subforum":"[ARCHIVED] Help & Support","embed":{"description":"Like the ever-evolving Kha'Zix, League of Legends is always adding new Champions, graphic updates, and particle effects. Those additions usually use the latest available software that Graphics Card...","url":"https://support.riotgames.com/hc/en-us/articles/201761974-Bug-Splat-and-Game-Crashes","image":"http://p6.zdassets.com/hc/settings_assets/43400/200033224/zOFjizsPC4oCFP37iHmsjQ-logo.png"},"up_votes":1,"down_votes":0,"body":"I have followed the bug splat guide and everything is fine. When game crashed, nothing works on my pc, i have to hold the power button for my pc to restart and then the game won't start. This has been happening for > 3 times and i have been wasted tons of time being put in low priority queue. Now the new season started and the first game I tried to play, ran into this again and counted as a lost. God knows if my next game is going to freeze again.\r\n\r\nCan any support check the game log and fix this please. It has been so frustrating given the fact that I have already tried every step in the Bug splat and all my other PC games work fine including 5+ AAA games........","replies":[{"poster":"Broporo","date":"2018-01-18T21:45:49.644+0000","up_votes":1,"down_votes":0,"body":"If your whole pc is locking up at the same time League is crashing, I'm worried that this might be related to something messing up with the game files or how your pc is interacting with them overall. Since you've been through the crash guide already, I want to run you through a couple steps to see what happens, or if they're able to help, in order to try and narrow down what the main issue is. Make sure you're testing these changes in a custom or practice game to avoid penalties for leaving normal/ranked games.\n\nRun a quick repair for me, then turn on close client during game. Also, be sure that you've closed any other programs in the background (like discord/curse, anything that might have the possibility of having overlays. A clean boot would be a good way of doing this) just in case those overlays are causing crashes. One last thing, check to make sure the Game DVR feature is still turned off, since some windows updates will force it back on which can slow down things.\n\n Let me know how this goes as well as what results/changes you're seeing. We might need to try a few other things, but this helps narrow down the cause.","replies":[]},{"poster":"Naadhir","date":"2018-01-18T11:15:05.506+0000","up_votes":1,"down_votes":0,"body":"I just had exacly same problem. all players on list had 0% of loading,I restarted the game. Then I had information that conection was lost and tell me to try again,and again crash. When I log again game was lost because of mine \"afk\" and I have low prio queue now for 20min. My internet was working totaly fine,all the things was working but not Leage of legends. I am waiting for respond,pleas help to fix it,it was game problem and I demand of one win game in ranked placements..","replies":[]}]}