{"poster":"Soulcrie","date":"2020-01-01T18:39:29.390+0000","title":"Riot's ban system...","subforum":"Player Behavior","up_votes":4,"down_votes":17,"body":"i am currently banned for getting upset over being flamed sexual harassed and threatened in game. but hear me out... we won our game... i was being flamed for not playing the way our mid wanted me to. i was being told to swallow loads and that my gf was going to have his babies and all of this was okay as long as i got my ban? how can some of these players make sexist comments racist comments and continue to show up in these games but i am permabanned? and checking his history he is currently in another game so his behavior apparently was approved and all  was fine?\r\n\r\nI am not justifying my actions i am just wondering why i can be told to swallow a load and he can continue to enjoy playing the game but if i call someone toxic and try and defend myself i get perma banned? can i Please get an answer that makes sense? why is sexual harassment okay but getting upset for it not?","replies":[{"poster":"Cind3rkick","date":"2020-01-01T18:46:37.641+0000","up_votes":8,"down_votes":0,"body":"There are multiple things worth considering here\n\n1)\nAfter your 14 day ban ANY negative behaviour will be a permban.\n\n2)\nYou dont know they werent punished, they couldve recieved a chatban.\n\n3)\nNo one forced you to reply and be toxic back.\n\n4)\nThe way they said it mightve helped them avoid the system and they may be punished for it sometime in the future.","replies":[]},{"poster":"Kei143","date":"2020-01-01T18:48:23.973+0000","up_votes":1,"down_votes":1,"body":"Let's have you understand the behavioral system a bit more. Think of it like a health bar (or tension meter) in music games. When you hit the note at an off beat,  your tension meter  increases. When you completely miss a note, the meter increases by alot. When you hit the note at good timings, it reduces the meter. \n\nRiot's behavior system works the same way, as in we all have a toxicity meter attached to our accounts. When players are mildly toxic, it goes up a tad. When people use hate speech, it pretty much fills up the meter. of course, clean games reduce the meter. \n\nIt is possible for playerA to get punished and playerB not to, even though playerB was waaayyyyy more toxic . Let's say playerA started the game with the toxicity meter at 95% and playerB's at 35%. Ingame, playerB said some pretty nasty shit and playerA responds with some shit as well. After the game, playerA gains 10% toxicity and playerB gains 50%. Now playerA is at 105% toxicity and gets punished, whereas playerB is at 85%, and not punished in that specific game, even though playerB was found to be 5x more toxic than playerA in that game. \n\nSo for you to be permabanned,  I'd look at your behavior history and how you got there in the first place.","replies":[{"poster":"Soulcrie","date":"2020-01-01T18:54:12.313+0000","up_votes":1,"down_votes":7,"body":"im not worried about my ban im worried about why sexual harassment and racism is okay... and after a few google searches aparently riot supports sexism in the work place so it makes sense","replies":[{"poster":"Imperial Pandaa","date":"2020-01-01T19:04:28.480+0000","up_votes":4,"down_votes":0,"body":"No it is not okay. You have no way of knowing if they got punished or not, unless you didn't report them. If you reported them, then their behavior will be reviewed like yours was. They may be at the first or second punishment step, while you were at the final one.","replies":[{"poster":"Soulcrie","date":"2020-01-01T19:10:12.363+0000","up_votes":1,"down_votes":6,"body":"they are still playing games. my behavior maybe bad but racism and sexism should never be okay and i am really sorry you guys support it.","replies":[{"poster":"zPOOPz","date":"2020-01-01T19:25:07.162+0000","up_votes":4,"down_votes":0,"body":"can you quote the exact context where anyone in this thread supported it???","replies":[{"poster":"Soulcrie","date":"2020-01-01T19:36:13.369+0000","up_votes":1,"down_votes":4,"body":"by saying sexual harassment and racism is okay to only be punished by chat restriction... try it in the work place see what happens... try it on the street see what happens... do it in riots game and they punish the victim for it then tell her  she deserves her ban and they deserve to play .... did i miss anything? \nNow show me where they actually did something about it?","replies":[{"poster":"zPOOPz","date":"2020-01-01T19:42:59.665+0000","up_votes":4,"down_votes":0,"body":"since when is \"swallow a load\" sexual harassment?  You are just trying to blow this shit out of proportion and exaggerate greatly to fit your narrative.  He even thought you are a guy so again, how is telling who you think is a guy to \"swallow a load\" anyway sexual harassment?","replies":[{"poster":"Soulcrie","date":"2020-01-01T19:47:49.302+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=zPOOPz,realm=NA,application-id=ZGEFLEUQ,discussion-id=xGHauamU,comment-id=0001000000000000000100000001,timestamp=2020-01-01T19:42:59.665+0000)\n>\n> since when is \"swallow a load\" sexual harassment?  You are just trying to blow this shit out of proportion and exaggerate greatly to fit your narrative.  He even thought you are a guy so again, how is telling who you think is a guy to \"swallow a load\" anyway sexual harassment?\n\nHe said to swallow his load form his **** I am sorry i paraphrased a bit do you want his actual verbiage?","replies":[{"poster":"zPOOPz","date":"2020-01-01T19:49:51.714+0000","up_votes":1,"down_votes":0,"body":"Yes, we know how anatomy works, there's no other body part you would get a \"load\" from.\n\nHow is that sexual harassment by common sense when he thought he was talking to a guy?","replies":[]}]}]},{"poster":"rujitra","date":"2020-01-01T19:40:18.500+0000","up_votes":3,"down_votes":2,"body":"Look, bluntly, you'd have a very hard time convincing an HR department or court that one comment of someone saying \"swallow a load\" is sexual harassment. Period. It's a statement that's being used akin to \"fuck you\"... oh wait, is \"fuck you\" sexual harassment now too? No. It's an expression of anger with someone/something.","replies":[{"poster":"Soulcrie","date":"2020-01-01T19:43:48.196+0000","up_votes":1,"down_votes":5,"body":"RIGHT HERE IS PROOF YOU SUPPORT IT!!!!!! Thank you!!!!!","replies":[{"poster":"rujitra","date":"2020-01-01T19:46:16.899+0000","up_votes":3,"down_votes":1,"body":"And you support this crazy climate in today's world where a man can't even offer a woman he meets a hug because if he does, he'll be accused of sexual harassment/abuse/violence.\n\n**Just because something is tangentially related to sex does not mean it is by default sexual harassment**. This is standard, run of the mill flaming. Not sexual harassment. Period.","replies":[{"poster":"Nightsky Pirate","date":"2020-01-01T22:14:18.763+0000","up_votes":4,"down_votes":2,"body":"No, swallow a load in the context given is absolutely sexual harassment and talking like a computer definately is wrong. I understand you're talking with the interpretation of the bot, but that does not make it right to defend it. Just because something CAN be innocent by itself, doesn't mean it is. Here it is absolutely wrong unless OP exaggerated the context.","replies":[{"poster":"rujitra","date":"2020-01-01T22:35:45.204+0000","up_votes":3,"down_votes":2,"body":"No, I'm talking from a human interpretation. Please feel free to link any information about arrests/convictions for someone doing this in a public place.\n\nYes, it's wrong to flame and be rude to others in League. No, the fact that it's a sexual comment does not make it **sexual harassment**.","replies":[{"poster":"Nightsky Pirate","date":"2020-01-02T01:45:17.768+0000","up_votes":2,"down_votes":1,"body":"google, help this poor soul\n\nsex路u路al ha路rass路ment\nnoun\nnoun: sexual harassment\n\n    behavior characterized by the making of unwelcome and inappropriate sexual remarks or physical advances in a workplace or other professional or social situation.\n\n\n\nAnd you might want to read this.\n\n[Sexual harassment on the street](http://www.stopstreetharassment.org/wp-content/uploads/2013/12/SSH-KnowYourRights-StreetHarassmentandtheLaw-20131.pdf)","replies":[]}]}]}]}]}]}]}]},{"poster":"Imperial Pandaa","date":"2020-01-01T19:21:24.135+0000","up_votes":3,"down_votes":0,"body":"There are other punishments out there.\n\nNo one supports it.","replies":[{"poster":"Soulcrie","date":"2020-01-01T19:25:45.698+0000","up_votes":1,"down_votes":7,"body":"So around the workplace... if a guys calls one of his employees toxic trash he needs to be fired but if one of your employees tell a woman to swallow his load you guys will just tell him to hush for a few hours? because this is Riot logic... and their history shows\nhonestly this would probably be a better debate for reddit or social media i have a feeling i am just wasting my time and yours.","replies":[{"poster":"Imperial Pandaa","date":"2020-01-01T20:47:14.437+0000","up_votes":2,"down_votes":1,"body":"I'll try to explain it one last time in the most logical way I can.\n\nZero Tolerance is what nets immediate escalation to a 14 day punishment or perm from no punishment. What falls under Zero Tolerance is typically Hate Speech (which includes things such as Racism) and Encouraging self harm.\n\nIn this case, the comments mentioned would NOT fall under such. They are consider crude and should contribute to a punishment on their own. If you reported, the system would review and task however many ticks to their punishment. If you didn't report them, then their gameplay may not get reviewed unless someone else reported them. \n\nIt is unlikely, in my opinion, to be automatically escalated without a manual review. Which, this is not the place to look for such.","replies":[{"poster":"Soulcrie","date":"2020-01-01T20:59:12.001+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Imperial Pandaa,realm=NA,application-id=ZGEFLEUQ,discussion-id=xGHauamU,comment-id=0001000000000000000000000001,timestamp=2020-01-01T20:47:14.437+0000)\n>\n> I'll try to explain it one last time in the most logical way I can.\n> \n> Zero Tolerance is what nets immediate escalation to a 14 day punishment or perm from no punishment. What falls under Zero Tolerance is typically Hate Speech (which includes things such as Racism) and Encouraging self harm.\n> \n> In this case, the comments mentioned would NOT fall under such. They are consider crude and should contribute to a punishment on their own. If you reported, the system would review and task however many ticks to their punishment. If you didn't report them, then their gameplay may not get reviewed unless someone else reported them. \n> \n> It is unlikely, in my opinion, to be automatically escalated without a manual review. Which, this is not the place to look for such.\n\nyou should review the chat logs... as i had said i paraphrased a lot of what was said and i dont have his chat logs.. if sexual harassment is a no biggie which based on riot's history with female employees i get it but the rest of his comments fit in that category...","replies":[{"poster":"Imperial Pandaa","date":"2020-01-01T21:12:31.767+0000","up_votes":2,"down_votes":1,"body":"In case there is confusion, I cannot check the chat logs because I am not a Riot Employee.\n\nSexual Harassment is an issue, yes, but you cannot expect an automated to be handle it accurately because it can encompass completely innocent things too.\n\nAlso, please drop the whole \"But Riot has Sexual Harassment irl so must be okay\" because that case was handled. If you think it should still apply to their standing then I hope you don't look at politics or history. Point is there will always be bad eggs.\n\nYou can submit a support ticket about the situation, but a manual review may not be done in a timely manner, especially since most places will just be getting back from holiday breaks.","replies":[{"poster":"RayleighTT","date":"2020-01-01T21:31:21.817+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=Imperial Pandaa,realm=NA,application-id=ZGEFLEUQ,discussion-id=xGHauamU,comment-id=000100000000000000000000000100000000,timestamp=2020-01-01T21:12:31.767+0000)\n>\n> In case there is confusion, I cannot check the chat logs because I am not a Riot Employee.\n> \n> Sexual Harassment is an issue, yes, but you cannot expect an automated to be handle it accurately because it can encompass completely innocent things too.\n> \n> Also, please drop the whole \"But Riot has Sexual Harassment irl so must be okay\" because that case was handled. If you think it should still apply to their standing then I hope you don't look at politics or history. Point is there will always be bad eggs.\n> \n> You can submit a support ticket about the situation, but a manual review may not be done in a timely manner, especially since most places will just be getting back from holiday breaks.\n\nhe shouldn't submit manual review to ban someone , is Riot job to make the report system to work , without aditional help ,as long as they have terms of conditions and must pursuit to ensure that the game rules are followed by everyone ,while additional spending time to fix someone toxicity , as well as it happens for 67 million of players to play this game ,doesn't sound like it's high quality procces or even checked and pursuited something.\n\nAlso ,this is no longer a situation , is a fact.. , situation you can call it , when it happens ocassionally ... , this is beyond the unfair process of justice ,as long as some answer justice system  ,some don't , there can't be equity , as this express the fact that Riot can of itself to protect someone of being banned , or anything they wish , i can say so easy that this guy got banned, and the other guy been protected by Riot Games with them incapacity justice system to don't be harm of same rules everyone answer for breaking them , rules which some of them most of the time Riot has no capacity to judge or to analys if someone broke them , such as troll/grief.","replies":[{"poster":"Imperial Pandaa","date":"2020-01-01T22:03:41.171+0000","up_votes":3,"down_votes":1,"body":"I'm going to keep this short and direct to the point I think you are making. I fully admit I could be understanding you wrong because I do have trouble understanding you since English isn't your first language.\n\nIf the person gets progress made to their punishment progression, then the system works. Whether you agree or disagree that the other person involve deserves an escalated punishment or not, progression of their punishment means it works.\n\nThe rules apply to everyone.\n\nI'm ignoring the troll/grief because that is not the topic of this discussion.","replies":[]}]},{"poster":"Soulcrie","date":"2020-01-01T21:27:47.727+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Imperial Pandaa,realm=NA,application-id=ZGEFLEUQ,discussion-id=xGHauamU,comment-id=000100000000000000000000000100000000,timestamp=2020-01-01T21:12:31.767+0000)\n>\n> In case there is confusion, I cannot check the chat logs because I am not a Riot Employee.\n> \n> Sexual Harassment is an issue, yes, but you cannot expect an automated to be handle it accurately because it can encompass completely innocent things too.\n> \n> Also, please drop the whole \"But Riot has Sexual Harassment irl so must be okay\" because that case was handled. If you think it should still apply to their standing then I hope you don't look at politics or history. Point is there will always be bad eggs.\n> \n> You can submit a support ticket about the situation, but a manual review may not be done in a timely manner, especially since most places will just be getting back from holiday breaks.\n\ni will go to them i am sorry...\nand \"cases\"...  yet it is still going on in their games and i wouldn't be so upset if he wasn't still able to play yet what he did was 1000 times worse so their issues have not been resolved if they still allow it freely to go unpunished nice try though you guys have no issue ensuring i am punsihed and live with it why would it not be the same?","replies":[{"poster":"Imperial Pandaa","date":"2020-01-01T21:44:26.761+0000","up_votes":2,"down_votes":1,"body":"Worse or not is an opinion if it doesn't hit the Zero Tolerance. I say opinion, because you haven't provided your logs, just an admittance that you were wrong too. For all we know you told him to go kill himself during the situation.\n\nWe only know you were punished because you posted here. We don't know if they were punished. We also don't have a way to prove what you are telling us is accurate. We are simply taking your word that someone was being a dick. Yes, some people disagree if what they said actually constitutes sexual harassment. Not a single person has said their behavior was okay though.\n\nDrugs still happen (insert place), does that mean they support drug use?\nNo, they don't.\nRules exist, the breaking of rules doesn't mean a business supports said thing. First offenses also typically result is \"lesser\" punishments.","replies":[{"poster":"Soulcrie","date":"2020-01-01T22:33:45.134+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=Imperial Pandaa,realm=NA,application-id=ZGEFLEUQ,discussion-id=xGHauamU,comment-id=00010000000000000000000000010000000000000000,timestamp=2020-01-01T21:44:26.761+0000)\n>\n> Worse or not is an opinion if it doesn't hit the Zero Tolerance. I say opinion, because you haven't provided your logs, just an admittance that you were wrong too. For all we know you told him to go kill himself during the situation.\n> \n> We only know you were punished because you posted here. We don't know if they were punished. We also don't have a way to prove what you are telling us is accurate. We are simply taking your word that someone was being a dick. Yes, some people disagree if what they said actually constitutes sexual harassment. Not a single person has said their behavior was okay though.\n> \n> Drugs still happen (insert place), does that mean they support drug use?\n> No, they don't.\n> Rules exist, the breaking of rules doesn't mean a business supports said thing. First offenses also typically result is \"lesser\" punishments.\n\ni was asking for it all good ... i deserved to be treated that way trying to play a video game. i am sorry i thought other wise have a good day!!! i understand nothing is going to happen no matter how big or small. if you want my logs i can grab them but i am not at my computer all i did was call him toxic trash AFTER he comments but like i said i am sure i deserved them god know this forum has done nothing but make sure i know its my fault people treat me that way","replies":[]}]}]}]}]}]},{"poster":"zPOOPz","date":"2020-01-01T19:35:34.793+0000","up_votes":4,"down_votes":0,"body":"speaking of history, are you going to sit there and disregard your own historical toxicity?  This ain't your first punishment.  This is likely your 4th punishment or at least 2nd.  So yeah, in your example, if the guy who calls out someone toxic trash AFTER he already got written up 3 times, you bet he needs to be fired.  Let's not use misinformation to fit your narrative.  You have a consistent history of being toxic and that's why you got perma banned.","replies":[{"poster":"Soulcrie","date":"2020-01-01T19:42:36.884+0000","up_votes":1,"down_votes":4,"body":"I am guilty i messed up ! i paid the price i had a man tell me to swallow his load and thats okay just tell him to hush for a few hours !!!! but the one who got mad shes deserves to be banned screw her and her mouth right? we see who you support","replies":[{"poster":"zPOOPz","date":"2020-01-01T19:57:28.683+0000","up_votes":2,"down_votes":1,"body":"> and that my gf was going to have his babies\n\nunless he thinks you are a lesbian for some reason, he thought he was talking to a guy.  Which does makes this an insult, NOT sexual harassment","replies":[]},{"poster":"Modi","date":"2020-01-02T01:18:09.252+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Soulcrie,realm=NA,application-id=ZGEFLEUQ,discussion-id=xGHauamU,comment-id=00010000000000000000000000000000,timestamp=2020-01-01T19:42:36.884+0000)\n>\n> I am guilty i messed up ! i paid the price i had a man tell me to swallow his load and thats okay just tell him to hush for a few hours !!!! but the one who got mad shes deserves to be banned screw her and her mouth right? we see who you support\n\nGuess what? \n\n# IT DOESN\"T MATTER WHAT THEY SAID. YOU WERE PUNISHED BASED ON THE SEVERITY OF THE OFFENSE AND THE HISTORY OF YOUR OWN BEHAVIOR.\n\nThat person will be dealt with based on the same thing: the severity of the offense and the history of their own behavior. They most likely got a chat restriction, if they don't have a history of misbehavior.\n\nIf there was no immediate 14-day ban, then they did not cross the line into zero tolerance. Don't sit here and try to argue that \"because I was banned they should be banned too\". It's not how it works","replies":[]}]}]}]}]},{"poster":"Modi","date":"2020-01-01T19:26:03.483+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Soulcrie,realm=NA,application-id=ZGEFLEUQ,discussion-id=xGHauamU,comment-id=0001000000000000,timestamp=2020-01-01T19:10:12.363+0000)\n>\n> they are still playing games. my behavior maybe bad but racism and sexism should never be okay and i am really sorry you guys support it.\n\nThe fact that we agree with your punishment in no way means that we (boards members) condone or support any kind of misbehavior.\n\nThe fact that someone got a chat restriction or harsher punishment is not respective of anyone's views. You are just being informed of how the system likely handled the situation, based on how we understand it to work.","replies":[]}]}]},{"poster":"Kei143","date":"2020-01-01T19:49:09.306+0000","up_votes":2,"down_votes":0,"body":"uhhh ? Am I being trolled here? I just explained to you what happens when people use toxicity and how one person can get punished and not the other, yet you zoom right past it. \n\nSexism and racism increases their toxicity score. How is that supporting sexism and racism?","replies":[]}]}]},{"poster":"Soulcrie","date":"2020-01-01T19:51:24.965+0000","up_votes":1,"down_votes":5,"body":"i should just shut up and take it like my punishment... i get it... you \"guys\" win ill take it to reddit this is useless","replies":[{"poster":"rujitra","date":"2020-01-01T19:56:05.907+0000","up_votes":5,"down_votes":4,"body":"Look, as I tried to say, Reddit, the internet, a court, or a company HR department will tell you the **same thing**.\n\nI presume from your other responses that you are a female. To be quite honest, you should be ashamed with yourself. Sexual harassment is a real problem in the world in workplaces and public where women are continually groped or told things like \"well if you want a promotion you have to do a 'favor' for me\". Yet you're attempting to equate that to being told \"swallow a load\" in a video game **that you can mute if it bothers you**. That's absolutely absurd. If you were to go to HR and tell them \"yo, johnny coworker over there told me to 'swallow a load' once in a joking manner and he obviously didn't mean it\" they'd laugh you out of the office. \n\nYou are minimizing and quite frankly you're laughing in the face of people who are truly sexually harassed in life by attempting to call this sexual harassment. I further suspect that you're doing this simply because you think because you are a woman you are always correct. You are not correct in this instance, and you need to come down to earth before you let this attitude affect something worse than a video game in your life.","replies":[{"poster":"Soulcrie","date":"2020-01-01T20:07:37.883+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=rujitra,realm=NA,application-id=ZGEFLEUQ,discussion-id=xGHauamU,comment-id=00020000,timestamp=2020-01-01T19:56:05.907+0000)\n>\n> Look, as I tried to say, Reddit, the internet, a court, or a company HR department will tell you the **same thing**.\n> \n> I presume from your other responses that you are a female. To be quite honest, you should be ashamed with yourself. Sexual harassment is a real problem in the world in workplaces and public where women are continually groped or told things like \"well if you want a promotion you have to do a 'favor' for me\". Yet you're attempting to equate that to being told \"swallow a load\" in a video game **that you can mute if it bothers you**. That's absolutely absurd. If you were to go to HR and tell them \"yo, johnny coworker over there told me to 'swallow a load' once in a joking manner and he obviously didn't mean it\" they'd laugh you out of the office. \n> \n> You are minimizing and quite frankly you're laughing in the face of people who are truly sexually harassed in life by attempting to call this sexual harassment. I further suspect that you're doing this simply because you think because you are a woman you are always correct. You are not correct in this instance, and you need to come down to earth before you let this attitude affect something worse than a video game in your life.\n\noh this is rich... please tell me how some sexual harassment is okay and others isnt???","replies":[{"poster":"rujitra","date":"2020-01-01T20:12:09.613+0000","up_votes":4,"down_votes":2,"body":"This was not sexual harassment.","replies":[{"poster":"Soulcrie","date":"2020-01-01T20:14:36.194+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=rujitra,realm=NA,application-id=ZGEFLEUQ,discussion-id=xGHauamU,comment-id=0002000000010000,timestamp=2020-01-01T20:12:09.613+0000)\n>\n> This was not sexual harassment.\n\nbecause he thought i was a man got it... and yet other people say otherwise weird...","replies":[{"poster":"rujitra","date":"2020-01-01T20:19:12.524+0000","up_votes":4,"down_votes":1,"body":"I have never said your gender mattered here.\n\nThe actions taken towards you do not constitute sexual harassment. It's not *okay* for him to do what he did. But it's not \"sexual harassment\".","replies":[{"poster":"Soulcrie","date":"2020-01-01T20:22:11.905+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=rujitra,realm=NA,application-id=ZGEFLEUQ,discussion-id=xGHauamU,comment-id=000200000001000000000000,timestamp=2020-01-01T20:19:12.524+0000)\n>\n> I have never said your gender mattered here.\n> \n> The actions taken towards you do not constitute sexual harassment. It's not *okay* for him to do what he did. But it's not \"sexual harassment\".\n\nno telling someone to swallow your load is sexual harassment.... i am sorry if that is your favorite pick up line but it doesn't change the fact...","replies":[{"poster":"rujitra","date":"2020-01-01T20:26:41.391+0000","up_votes":4,"down_votes":2,"body":"It is not sexual harassment. It has nothing to do with being a \"pick up line\". Simply making a sexual comment in a video game does not constitute sexual harassment.","replies":[{"poster":"GatekeeperTDS","date":"2020-01-01T20:33:28.805+0000","up_votes":3,"down_votes":2,"body":"Rujitra, man, put down the goddamn shovel.","replies":[]}]}]}]}]}]}]},{"poster":"zPOOPz","date":"2020-01-01T20:01:38.286+0000","up_votes":1,"down_votes":1,"body":"> and that my gf was going to have his babies\n\nThe other person most likely thought she's a guy anyway","replies":[]}]},{"poster":"Yin Yang Taoist","date":"2020-01-02T01:38:23.765+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Soulcrie,realm=NA,application-id=ZGEFLEUQ,discussion-id=xGHauamU,comment-id=0002,timestamp=2020-01-01T19:51:24.965+0000)\n>\n> i should just shut up and take it like my punishment... i get it... you \"guys\" win ill take it to reddit this is useless\n\nOP, I support you. I don't think that any of what he said was okay. I think that he should be punished. In the future, just mute people and report (or keep everyone muted to begin with). Its unfortunate but if you talk back then Riot will punish you as well, regardless of _who_ started it.\n\nYou can submit a [ticket](https://support.riotgames.com/hc/en-us/requests/new) here to manually report them since you want this to be noticed. Also, its best if you screenshot such things. Helps resolve things much more easily! ","replies":[]}]},{"poster":"Tele II","date":"2020-01-03T02:38:19.574+0000","up_votes":1,"down_votes":0,"body":"Theres a lot of factors. Well maybe not a LOT. Its simple actually... you dont just get banned immediately every time you break a rule. Think of it like there is a toxicity meter attatched to your account. Everytime you break a rule, it goes up. If your offense was eggregious enough (like \"hatespeech\" and encouragements of suicide) it goes up a lot. So maybe their meter was low. Maybe they dont break the rules very often. Maybe all they got was a 10 game chat restrict because theyve never been punished. Maybe it got escalated to a 25 game chat restrict because Riot found it eggregious enough, or maybe he already had a 10 game CR.\n\nTry to avoid simpleton logic like \"hes still playing, therefor what he did is considered A-okay\". Thats incredibly dumb. Just because someone didnt get BANNED, doesnt make their actions acceptable. They flamed you, which is obviously against the rules, and if you reported them, just know that the system isnt gonna make personal exceptions for them. Why would it? ","replies":[]},{"poster":"Nightsky Pirate","date":"2020-01-01T20:27:36.092+0000","up_votes":2,"down_votes":6,"body":"Y'all explaining the banning system seem to be missing that if this happened in real life, the offender to this OP would be seeing cops and could end up in jail, and y'all expect her to be quiet.\n\nSmh.\n\nI'll trumpet over and over that the ego *sometimes* needs to be stood up for and stoic non-response is NOT always the best answer. PhD holders are wrong to say otherwise.\n\nEdit: not that I am encouraging to respond under the current system, but it is wrong.","replies":[{"poster":"rujitra","date":"2020-01-01T20:34:18.370+0000","up_votes":3,"down_votes":2,"body":"He would not.\n\nIf you are out in public, and you make one comment to someone, even if that comment is sexual, it is not sexual harassment. Sure, the OP could exaggerate and/or lie to get the cops involved - but the second the investigation took place the cops would let the person go.\n\nIt's not illegal nor is it sexual harassment to be crass or make a couple sexual comments in a public area.","replies":[{"poster":"Nightsky Pirate","date":"2020-01-02T01:57:41.342+0000","up_votes":1,"down_votes":1,"body":"You call the cops, you make a report. Insist that the cops take the report. That person will have it on record, and if they get more reports, they go to jail, because in many states, cat-calling on the streets is harassment. ","replies":[]}]}]}]}