{"poster":"Fęrdø º","date":"2018-04-08T21:58:29.559+0000","title":"Porque el emparejamiento del juego es malo y propuestas para mejorarlo (meto a los tóxicos también)","subforum":"Charlas Generales","up_votes":8,"down_votes":4,"body":"Me e pensado mucho si hacer o no este post puesto que siempre en post como estos te sacan los super mega argumentos que &quot;te dejan como el malo&quot;\r\npero esto es innegable y quiero hablar de esto.\r\n\r\nDesde siempre se a sabido que el emparejamiento del juego no es muy profesiona que digamos y siempre que uno se queja de esto esta la tipica respuesta de que algunas veces te tocan team buenos y teams malos, nunca se gana siempre. (y es verdad)\r\n\r\nPero es que el emparejamiento es tan malo que tocan personas peores que bronce 5, mmm NO, peores que esas personas que juegan desde hace poco, con nvl 5 y todav&iacute;a no pueden jugar PVP.\r\n\r\nMe e encontrado con gente que no sabe jugar con el champ (bue tal vez aceptable pero no corresponde) a tocarme gente que no conoce las mec&aacute;nicas mas b&aacute;sicas del juego (que a menudo ocurre y fastidia mucho).\r\n\r\nSiempre esta la t&iacute;pica respuesta : Es que necesitas saber carrear y subes.\r\n\r\nY eso es verdad, pero PARA ALGO EL JUEGO ES UN 5 VS 5, la idea central del juego es ganar con compa&ntilde;erismo, buena cordinacion del team, buenas habilidades de parte de tu team como tambien del otro.\r\n\r\nEstas caracter&iacute;sticas deben ser siempre de una partida, y la verdad que algunas veces ocurre (y son las mejores partidas que uno juega, porque aunque pierdas sabes que diste lo mejor de ti, al igual que tu team como tambi&eacute;n el del enemigo).\r\n\r\nEstas partidas siempre las vemos en las LCS o en los campeonatos puesto que son 5 personas que se conocen y juegan bien contra otras iguales.\r\n\r\nLa gente se a acostumbrado tanto a la gente sin habilidad que se a olvidado de lo que en verdad deber&iacute;a ser una partida de lol, y lo a cambiado por un pensamiento individualista de :  voy a sacar un champ hipercarry, me voy a fedear, podre hacerme un 1 vs 5 y la ganare, solo espero que me team no fedee mucho.\r\n\r\nLamentablemente se esta asi hasta que con esfuerzo se llega a un elo alto en el talves casi siempre te toca gente buena, (yo no lo se porque estoy pegado en plata) , tambien esta la tactica del duo (elegir a un amigo que sabes que juega bien para disminuir la tension del emparejamiento y poder confiar en alguien y hacer jugadas con esta).\r\n\r\n\r\nTodo esto es verdad y es algo fijo en el juego por lo que me a echo pensar en si se puede cambiar, y yo creo que si se puede , pero COMO, como vas a cambiar algo que desde siempre a sido asi, pues creo que es con mano dura.\r\n\r\nRiot se a empe&ntilde;ado en mejorar el emparejamiento, los reportes, el meta pero siempre van de poco a poco y cada ves la idea de un Lol mejor que antes va desapareciendo.\r\n\r\nAntes : Para la gente toxica ten&iacute;amos el tribunal , personas que decidian el si o no de castigar a una persona.\r\n\r\nAntes : Uno se iba afk en una partida (aunque sea contra bots) y te baneaban hasta por 1 semana.\r\n\r\nPero todo esto se fue porque la gente empez&oacute; a criticar la mano dura de riot, pero antes si  duda era mucho mejor que antes la comunidad.\r\n\r\nAhora: La gente le da lo mismo si los reportan o no puesto que supuestamente &quot;para que revisen la partida se debe de reportar al jugador multiples veces para que recien se fijen en el toxico.\r\n\r\nAhora: te vas afk y te meten cola de 20 minutos (uyyy pero que castigo mas perturbador).\r\n\r\nMano dura de riot como antes o peor eliminaria la cantidad de toxicos en el juego (no completamente puesto que eso es imposible) pero obviamente ya el toxico se pensaria 2 veces el flamear o trollear en la partida puesto que se estar&iacute;a arriesgando a un baneo si o si.\r\n\r\nLos afk se pensarian 2 veces si jugar una partida si solo pueden jugar 10 minutos. (o si tienen una urgencia , ya con el baneo vayan al soporte y excusense el porque te tuviste que retirar)\r\n\r\nLA COMUNIDAD MEJORARIA MUCHO, pero seguirian los &quot;malos&quot;.\r\n\r\nPor lo que como mejorar el emparejamiento,(yo no se mucho de esto asi que cosas que diga talvez no tengan sentido o me estoy metiendo en cosas nada que ver).\r\n\r\nLa manera de mejorar el emparejamiento no es solo emparejando por solo la liga , se puede emparejar por honor,por kda habitual, por racha de victoria, etc. (Obiamente sin quitar que empareje con personas de la misma liga).\r\n\r\nLos malos con los malos y los buenos con los buenos, simple.\r\n\r\nObviamente esto crearia si o si el llamado &quot;Elo hell&quot;, puesto que podrias tener una mala racha y ya te tocaria con gente mala si o si.\r\n\r\nPero esto se puede quitar con el reinicio del emparejamiento.\r\n\r\nque significa esto?, que cada 1 o 2 semanas el kda, la racha y el honor se reinicie, para que todos empiezen iguales y ya teniendo una ventaja subas rapidamente.\r\n\r\n(Quiero aclarar que cuando hablo del reinicio de honor no me refiero concretamente al honor que tenemos, me refiero a un honor secundario similar al kda (que no existe obviamente, y yo lo estoy proponiendo)  puesto que emparejar por kda, emparejaria a los que matan mucho y casi nunca mueren con los mismos, y el honor a las personas que son amigables y positivas con las mismas).\r\n\r\nTodo esto cambiar&iacute;a el emparejamiento a mejor.\r\n\r\nEn conclusi&oacute;n estas son mis propuestas para mejorar el juego, Mano dura a los toxicos y emparejar por muchas cosas mas, todo esto creo que talvez sea dificil de hacer pero sin duda el juego cambiaria muchisimo a mejor, y sin duda creo que muchas personas empezarian a jugar League of legends, ya que much&iacute;sima gentes no juega este juego por la comunidad.\r\n\r\n\r\nLas ideas pueden capaz ser b&aacute;sicas para ustedes y tal vez muy est&uacute;pidas pero por mi parte me emocionar&iacute;a el que riot considerara este post y se centrara en estos problemas, no por mi, si no por el juego.\r\n\r\nSi llegaste hasta ac&aacute; te doy mis m&aacute;s sinceras gracias, y si vas a comentar algo te pido que digas algo constructivo y si tienes algo que criticarme dilo con respeto puesto que trate de hacer este post con la mas neutralidad posible sin meter emociones de por medio.\r\n\r\nMuchas gracias y hasta nunca.\r\n\r\n{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Challenger15","date":"2018-04-08T21:59:51.484+0000","up_votes":8,"down_votes":3,"body":"***","replies":[{"poster":"Fęrdø º","date":"2018-04-08T22:03:51.567+0000","up_votes":3,"down_votes":2,"body":"Primero : ni siquiera leiste el post solo el titulo, y aparte no me centro en criticar el juego y justificar el porque no subo, si no en dar propuestas para mejorarlo.","replies":[{"poster":"Challenger15","date":"2018-04-08T22:06:36.839+0000","up_votes":5,"down_votes":2,"body":"***","replies":[{"poster":"Fęrdø º","date":"2018-04-08T22:11:32.807+0000","up_votes":2,"down_votes":2,"body":"No todos los bronces y platas son malos,no todos los optimistas necesariamente se quedan donde estan y no me quejo del emparejamiento, solo digo lo que me parece mal y como mejorarlo.","replies":[{"poster":"MasterRightClick","date":"2018-04-08T22:32:16.859+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=TioFerdo,realm=LAS,application-id=v7qsfXsE,discussion-id=PGgilWmo,comment-id=0000000000000000,timestamp=2018-04-08T22:11:32.807+0000)\n> No todos los bronces y platas son malos\n\nSi fueran buenos no estarian en bronce y plata","replies":[{"poster":"Fęrdø º","date":"2018-04-08T22:43:18.825+0000","up_votes":1,"down_votes":0,"body":"te equivocas ahi, es verdad que la mayoria de bronces y platas no tienen demasiada habilidad, pero la mayoria se esfuerza por mejorar y lo consigue, tu estuviste en plata, te lo aseguro , y no por eso tenias la misma habilidad que otro plata, la división no demuestra tu habilidad, pero si te da una idea de más o menos como eres.","replies":[{"poster":"JayInc","date":"2018-04-08T22:57:08.426+0000","up_votes":1,"down_votes":0,"body":"Si has jugado muchas partidas en una cuenta y estás X división, tu habilidad es esa. Mira, yo puedo jugar lux mid, farmear super bien y no hacer nada más que ultear para llevarme kills en TFs. Probablemente voy a ganar muy pocas partidas porque no hago nada relevante, pero mi KDA y farm será fantástico. Con esos stats le voy a poder decir al mundo que en plata hay jugadores buenos! La razón por la que alguien está en plata no es por el KDA o farm o nada de eso. Es porque no sabe como ganar partidas. Toda la gracias del juego es saber como ganar con el equipo que tienes. En ligas bajas se obsesionan con el KDA o \"ganar lane\" que tampoco significa nada si no haces nada con esa ventaja. He visto un jugador con 3 cuentas challenger y en todas KDA de 1.6, ¿Los jugadores en bronce con KDA 5 son mejores que ese tipo?. Si has jugado suficientes partidas, tu división demuestra tu habiliad de ganar partidas.","replies":[{"poster":"Fęrdø º","date":"2018-04-08T23:08:40.913+0000","up_votes":2,"down_votes":0,"body":"Sinceramente me has cambiado el pensamiento con tu opinión y la comparto, pero yo critico el porque en la mayoria de partidas tienes que carrear a 4 personas y ganarla solo, si el juego es un 5 vs 5 , es como en el football, un equipo puede fácilmente ganar porque los delanteros son extremadamente buenos y violaron al arquero, pero lo mas eficiente y lo que mas corresponde es que no solo los delanteros sean buenos, sino que el equipo en general lo sea","replies":[{"poster":"JayInc","date":"2018-04-08T23:29:16.572+0000","up_votes":1,"down_votes":0,"body":"Es que el modo de juego no es realmente en equipo. La cola se llama \"Solo Queue\" o sea que juegas solo. La forma en que yo lo veo es que el juego me pone otros 9 bots con distintas habilidades, y yo tengo que intentar ganar la partida con lo que me dieron. Entiendo que a veces parece imposible ganar, pero es parte del juego. Lo que hay que tratar de descubrir es: ¿Por qué un jugador diamante gana 80% de partidas en plata? ¿Por qué yo solo tengo un 52% de win rate? ¿Qué hace él que yo no?\n\nA mi en lo personal me gusta ver el juego como algo individual. Hay otras personas que le puede gustar más la parte de equipo y jugar coordinado y con una estrategia. Para ellos recomiendo más jugar flex con un equipo establecido.","replies":[]}]}]},{"poster":"MasterRightClick","date":"2018-04-08T22:49:41.214+0000","up_votes":1,"down_votes":0,"body":"Que recuerdos haber estado en bronce 5. Aquel que esta en X division es porque se merece estar en esa X division, y si no sube es porque o no tiene las mecanicas o no tiene los conocimientos para subir, no porque \"es bueno pero esta atrapado por trolls y afks\".\n\nCuando mejoras, salis facil sea la division que sea, obviamente a más bajo más fácil salir. Vamos que hasta que janna jungla salis de bronce plata oro si uno usa las neuronas. Entonces si uno mejora, uno deja de ser el monito que era antes, deja de ser \"malo\" . Pero mientras uno no mejore, sigue siendo \"malo\". \n\nNo conozco ningun low elo que no salga de ahi por \"trolls, flamers y afks\" , el que merece salir, sale facil","replies":[]}]}]}]},{"poster":"Hiei ValianT","date":"2018-04-08T22:18:37.587+0000","up_votes":1,"down_votes":0,"body":"yo no soy optimista y espero almenos a llegar a platino.\ny los que se esfuerza, si suben, pero carrear trols no es bonito. ni te hace sentir que el lol es un juego de equipo.","replies":[]}]}]},{"poster":"Hiei ValianT","date":"2018-04-08T22:09:58.714+0000","up_votes":1,"down_votes":0,"body":"pero si están en la misma liga... el tiene mas puntos eso si y mejor winrate.\naun a si todos tienen derecho a dar su opinion.\ny tiene razón el juego es de equipo de carrear trols, o a quien le toca el peor trol. o quien sabe abusar del trol enemigo.","replies":[]}]},{"poster":"U N Owen","date":"2018-04-08T22:05:28.290+0000","up_votes":2,"down_votes":0,"body":"Podrias ser mas conciso con lo que quieres manifestar porque leer todo eso si que da pereza. En otra palabras anda al grano.","replies":[{"poster":"Fęrdø º","date":"2018-04-08T22:09:01.084+0000","up_votes":1,"down_votes":0,"body":"para algo tan importante creo que lo mejor era decirlo todo, empece justificando lo que esta mal, después compare el juego actualmente con el de años pasados, y finalmente doy mis ideas.","replies":[]}]},{"poster":"Whenkel","date":"2018-04-08T22:01:48.250+0000","up_votes":2,"down_votes":0,"body":"Man tienes que aprender algo no debes quejarte ya que todos te tiraran mierda o argumentos que no te pareceran cierto .","replies":[{"poster":"Fęrdø º","date":"2018-04-08T22:04:59.088+0000","up_votes":2,"down_votes":2,"body":"Lo se pero esto es una critica constructiva y no solo me quejo del juego, te invito a leerte el post y comentar que te parecio. {{sticker:slayer-jinx-wink}}","replies":[]}]},{"poster":"Hiei ValianT","date":"2018-04-08T22:16:07.794+0000","up_votes":2,"down_votes":1,"body":"emparejar por honor? que tiene que ver el honor con la habilidad de juego y compromiso con el equipo?\nel kda? y que pasa si yo soy un jugador de team que se sacrifica en post la victoria sin buscar el score?\njuntar a los malos con los malos y a los buenos con los buenos? quieres enfrentar a un team de malos contra buenos? eso no es justo.\ncomparto tu opinion de cambios pero esas soluciones no.\nyo tengo el honor bloqueado por sanción minima, estoy en oro 3 ahora y subiendo. y llegue ahi carriando gente. lo cual no es lo optimo por eso comparto tu opinión.\npero tus soluciones no.","replies":[{"poster":"Fęrdø º","date":"2018-04-08T22:20:08.907+0000","up_votes":1,"down_votes":0,"body":"por esto planteo esta especie de\"reinicio de emparejamiento\" y en cuanto al honor, no me refiero al honor que conocemos.\n\nCon el kda comparto tu opinion pero si juegas bien y saber ganar, no creo que salgas con un score sumamente negativo.\n\nY en cuanto a los buenos con los buenos y los malos con los malos, no quiero un desigual de habilidad en la partida me refiero a que con estos cambios, si eres bueno, jueges ranked donde todos sean buenos, y si eres malo, que todos sean malos,(aunque suene feo habria una igualdad en la partida)","replies":[{"poster":"Hiei ValianT","date":"2018-04-08T22:26:03.755+0000","up_votes":1,"down_votes":0,"body":"si fueras mas especifico en lo del honor para entenderte te lo agradecería.\nen cuanto al kda e visto tipos  que me carrean la partida gracias a sus jugadas. y nadie les da honor por su kda.\nsobre todo suports que en early me dejan todo feed ( cuando juego adc) y yo salgo con un gran kda .\na aun  si poner a los buenos con los buenos y malos con malos. es una desventaja. serian puras partidas donde un team arrasa al otro.","replies":[{"poster":"Fęrdø º","date":"2018-04-08T22:36:23.221+0000","up_votes":1,"down_votes":0,"body":"Planteo una especie de mmr ligado al honor, si tienes el honor alto significa que no flameas, eres buen compañero y se disfruta jugar contigo, entonces, porque no emparejar personas asi entre ellas. Capaz no este ligado mucho a la habilidad del juego pero casi siempre un buen jugador tiene el honor alto.\n\nEn cuanto al kda, me parece imposible que si jugaste bien y aportaste al equipo salgas 1/20 como score. \n\nY reitero,  no quiero un desigual de habilidad, o en la partida son todos buenos, o son todos malos , asi habria una equidad de habilidad.","replies":[]}]}]}]},{"poster":"M O U N S T R O","date":"2018-04-09T07:57:41.619+0000","up_votes":1,"down_votes":0,"body":"por rechazar partida : 30 min de cola\npor trollear : 20 min de cola\n\nAhi tenes a tus desarrolladores","replies":[]},{"poster":"darkkillerZxZ","date":"2018-04-09T04:20:57.688+0000","up_votes":1,"down_votes":0,"body":"olvidate ami ayer en una normal (siendo plata 1 yo) me emparejaron con un ex challenger de la s7 que esta en platino 1 volviendo a subir.....","replies":[]},{"poster":"Stay in Tower","date":"2018-04-09T02:48:49.618+0000","up_votes":1,"down_votes":0,"body":"mira, no leí todos los comentarios pero si el post, y sobre el emparejamiento la verdad que suena horrible emparejar por kda, honor o rachas. Al emparejar por rachas meterás en un game a pura gente tilteada y seguramente aumentaría la toxicidad xD y la verdad que emparejar por kda u honor no le encuentro sentido\nY para subir de liga la solución es JUGAR MUCHO. Ser perseverante, constante e ir mejorando. La gente no sube por suerte, o porque nació con talentos innatos. Es la pura experiencia de jugar y jugar (y enfocarte en ti y mejorar obvio). \nYo por ejemplo caí en bronce cuando empecé a jugar. Sentí que me emparejaban con gente malísima, donde cada tanto tocaba gente que perdía sola el game. Hasta que me di cuenta que en realidad, yo cometía miles de errores, que podía mejorar. Farmeaba mal, moría mucho, no miraba el mapa, etc. Y luego de jugar mucho, cual fue el resultado? La misma season llegué a diamond, a la próxima llegué a master en una smurf, y a la próxima llegue a chall en 2 cuentas y a master en br. TODOS los que están en elo alto, están ahí porque alguna vez tuvieron que jugar cientos de partidas, que los llevaron a donde están.","replies":[]},{"poster":"ParedSinRevoque","date":"2018-04-08T22:57:56.460+0000","up_votes":1,"down_votes":0,"body":"http://konpalabra.konradlorenz.edu.co/2017/04/las-falacias-argumentativas.html\n\nToma leete esto y luego corregi tu post.\n\n{{sticker:slayer-pantheon-popcorn}}","replies":[]}]}