{"poster":"Sarobakiri","date":"2016-09-13T17:36:50.704+0000","title":"Suche einen Clan zum Ranken oder ein team für Teamranked gold+","subforum":"Clans & Teams","up_votes":2,"down_votes":0,"body":"Wie gehts Leute,\r\nich suche einen clan oder ein Team f&uuml;r Teamranked oder Dynamic.Bin momentan gold 5 main jungler/toplane.","replies":[{"poster":"rammsteinsgate","date":"2016-09-14T10:00:16.186+0000","up_votes":1,"down_votes":0,"body":"Hey, guck doch mal auf unserer Homepage vorbei: www.cywa.eu unseren ts findest du unter voice.cywa.eu, jedoch wäre ein Besuch der Homepage vorher sehr sinnvoll.","replies":[]},{"poster":"Quniiix","date":"2016-09-14T05:56:29.603+0000","up_votes":1,"down_votes":0,"body":"Du hast es satt alleine in der Dynamic Queue zu spielen und suchst nun ein Team oder benötigst einfach nur Gleichgesinnte? Aequilibritas eSports hilft dir bei der Erstellung eines Teams und bei der Suche nach Mitspielern, sodass du hoffentlich schnell in einem Team unter gebracht wirst, aber dir sind natürlich auch spaßige Abende garantiert!\n\nHier gehts zu unserem Vorstellungsthread: [Aequilibritas eSports sucht Mitglieder | Community und eSports | LoL, CS:GO, Overwatch etc.](http://boards.euw.leagueoflegends.com/de/c/clans-teams-de/cOWosEff-aequilibritas-esports-sucht-rekruten-community-esports-lol-csgo-overwatch-etc)\n\nÜber diesen Link kannst du natürlich auch direkt zur Aufnahme gelangen: [Bewerbungsformular](http://aequilibritas-esports.de/index.php/Application/)\n\nUnsere Community existiert bereits seit 2009. Wir würden uns natürlich über dein Interesse freuen und eventuell sogar über die Teilnahme an unserer Gemeinschaft. :)","replies":[]},{"poster":"prealpha","date":"2016-09-13T19:23:12.425+0000","up_votes":0,"down_votes":1,"body":"Hallo bost41\nwir, Revenge Gaming, sind eine 2016 gegründete Community, die vor allem im Bereich Lol, Csgo und CoD aktiv ist. Aber auch andere Spiele wie Battelfield Rocket League oder Minecraft sind vertreten.\nNatürlich suchen wir für unsere Bereiche neue Mitglieder. Was wir im Spiel LoL erreichen wollen ist Spaß am Spiel und natürlich auch die Verbesserung der Spielfähigkeiten. Dazu haben wir Coaches in unserem Team die gerne für Tipps bereitstehen. Deine Elo ist dabei völlig egal. Ob Bronze oder Challenger, solange ein angemessenes Verhalten, ein Mindestalter von 12 und natürlich auch ein funktionierendes Mikrofon gegeben sind, ist jeder willkommen. \nGerne kannst du uns auf unserem Teamspeak (ts3.my-revenge.de) besuchen und gucken ob dir unsere Community gefällt. Wenn du dann interessiert bist kannst du dich gerne an einen Leader, Bereichs-Leiter oder Moderator wenden. \nMfG Prealpha","replies":[]},{"poster":"The Last Array","date":"2016-09-13T17:55:26.943+0000","up_votes":1,"down_votes":2,"body":"Jo!!!{{summoner:31}} \nwenn du auf der suchen nach ner coolen und netten Community bist schau doch mal bei JupiterGamingNetwork vorbei. Bei uns kannst du rund um die Uhr neue Freunde aus allen Elo-Bereichen kennen lernen die Spass am Spiel haben und aufsteigen wollen. Bei uns hast du auch die Möglichkeit ein Rankedteam zu finden oder eines zu erstellen.\n\nFalls ich dein Interesse geweckt habe schau doch mal bei unserem TS vorbei: JupiterGamingNetwork.ts.ngz.net\nWir freuen uns auf dich!!!{{sticker:slayer-jinx-wink}}","replies":[]}]}