{"poster":"God of Cake","date":"2017-02-28T18:13:51.184+0000","title":"10 Bann System","subforum":"Allgemeiner Chat","up_votes":3,"down_votes":1,"body":"Wei&szlig; jemand ob das 10 Bann System auch Solo Qeue kommt oder nur LCS ?\r\n\r\nund falls ja wei&szlig; jemand wann dieses 10 Bann System kommt?\r\n\r\nw&uuml;rde mich interessieren :D","replies":[{"poster":"Rahzar","date":"2017-02-28T18:25:34.014+0000","up_votes":5,"down_votes":0,"body":"Es wird dran gearbeitet, die Anforderungen in der SoloQ sind aber ein bisschen anders, als es im Pro-Play der Fall ist und ein paar Sachen müssen da noch geklärt und getestet werden. \n\nWenn es soweit ist, wird es offiziell angekündigt, bis dahin können wir leider keine genaue Zeitangabe machen. Ich denke aber, dass es sooo lange nicht mehr dauern wird.","replies":[{"poster":"ViviD VooiD","date":"2017-02-28T18:43:29.815+0000","up_votes":1,"down_votes":2,"body":"also das faende ich mies.\n\nzu beginn meiner LoL zeiten, waren die anforderungen die gleichen. da gab es bei den pro plays auch nur ein 6er ban system.\n\nwieso sollte sich das mit einem 10er ban system aendern?\n\n\n>>> das ist eine frage!! <<<<\n\nwieso werden jetzt \"ranked spiele\" die einem ja wohl zu den pro plays / pro player fuehren, anders behandelt?\n\n\ndas 6er ban system hat schon seit geraumer zeit keinen wirklichen einfluss mehr auf das spiel geschehen. das hatte es aber, als es nur 40, 50, 60 champions gab. zu beginn der lol zeiten.\n\nes gibt jetzt aber 136 tendenz steigend.\n\ndas 10er ban system ist laengt ueberfaellig mmn.","replies":[{"poster":"Rahzar","date":"2017-02-28T19:17:20.370+0000","up_votes":3,"down_votes":0,"body":"Ich bin mir nicht sicher, ob du mich richtig verstanden hast. Das Ziel ist ganz klar, dass die 10 Bans für alle kommen, es wird aber vielleicht ein bisschen anders aussehen und muss einfach noch getestet werden. \n\nWas ich mit anderen \"Anforderungen\" meinte, ist vor allem die Zeit, bis ein Spiel startet. Die Champion select dauert jetzt bereits manchen Spielern zu lang, müssen mehr Bans automatisch mehr Zeit in Anspruch nehmen? Gibt es eine andere Möglichkeit?\n\nDie Pro-Teams kennen sich, sie trainieren (zumeist) gegeneinander, haben vorher fest geplante und überdachte Pick&Ban Phasen, sie können während der Picks einfacher kommunizieren. Dazu kommt, dass es deutlich weniger Spiele betrifft und weniger \"schief\" gehen kann.\n\nDas sind nur ein paar Überlegungen, die wir uns gemacht haben und aktuell noch machen. Sobald das System so ausgereift ist, dass wir damit zufrieden sind, wird es auch auf den Server kommen. ","replies":[{"poster":"charmelikeahri","date":"2017-02-28T19:54:41.352+0000","up_votes":2,"down_votes":1,"body":"Vllt setzt man die Bannzeit herunter? Mal ehrlich wer überlegt in Solo Q 30s was er bannt? Dahinter steckt sowieso keine komplizierte Taktik deswegen wird gebannt was man als OP emfindet d.h. nach maximal 15s sollte der Ban durchsein. 30s verlänger das ganze unnötig","replies":[{"poster":"MeMyselfandBaal","date":"2017-02-28T21:06:55.758+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=charmelikeahri,realm=EUW,application-id=YnZkMR0R,discussion-id=472EsTMZ,comment-id=0000000000000002,timestamp=2017-02-28T19:54:41.352+0000)\n>\n> Vllt setzt man die Bannzeit herunter? Mal ehrlich wer überlegt in Solo Q 30s was er bannt? Dahinter steckt sowieso keine komplizierte Taktik deswegen wird gebannt was man als OP emfindet d.h. nach maximal 15s sollte der Ban durchsein. 30s verlänger das ganze unnötig\n\nOder... ganz revolutionärer Ansatz: Man lässt die 2 Spieler, die eh direkt nacheinander picken, dies gleichzeitig machen. Das spart direkt 2 Minuten Zeit... Und früher ging das auch... und das war das Früher, wo die 2 sich noch um ihre Rolle streiten konnten...","replies":[{"poster":"charmelikeahri","date":"2017-03-01T08:13:12.678+0000","up_votes":1,"down_votes":0,"body":"Fänd ich auch okay","replies":[]}]},{"poster":"SophiaQueen","date":"2017-04-18T13:56:27.652+0000","up_votes":1,"down_votes":0,"body":"Ich fänds nicht so schön wenn die Zeit runter gesetzt wird. Manchmal weiß ich nicht was ich bannen soll und frage dann meine Mates. Die 15 sekunden warten machen jetzt auch nicht so viel aus. ^^","replies":[{"poster":"charmelikeahri","date":"2017-04-18T19:20:20.871+0000","up_votes":1,"down_votes":0,"body":"15s x 10! Es bannen ja plötzlich 10 Leute. Du würdest dir teoretisch bis zu 150 Sekunden, oder 2,5 Minuten, ersparen. Das wäre es mir *auf jeden Fall* worth","replies":[]}]},{"poster":"Sihari","date":"2017-02-28T20:16:48.346+0000","up_votes":1,"down_votes":1,"body":"Und was, wenn dein Ban direkt vor dir weg gebannt wird und du erstmal überlegen musst, was du nun machst? Mich stressen da schon manchmal die 30 Sekunden und ich banne erst auf den letzten Drücker. Bei 15 Sekunden würde ich wohl so manches Mal entweder Mist bannen oder direkt aus der CS fliegen... x.x\nMehr als eine Person gleichzeitig bannen lassen wäre da die bessere Idee.","replies":[{"poster":"charmelikeahri","date":"2017-02-28T20:25:19.418+0000","up_votes":1,"down_votes":1,"body":"Und wie oft passiert das? Sehr selten, ich hatte den Fall glaube ich noch nie! No Joke! \n\nUnd wenn schon! Du hast 15s Zeit auf irgendeins der Bildchen zudrücken. \n\nWenn jemand wirklich zu weng Zeit hat dann liegt es daran das er AFK war.\n\nWürdest du nicht für die imense Zeitersparnis den absolut Selten Fall, dass jemand den Champion den du bannen wolltest bannt, in Kauf nehmen? Ich meine das wäre eine Verkürzung der Bannzeiten um 50%! Jetzt bekommen wir 4 Banns mehr und wären somit sogar UNTER der aktuellen Zeit!","replies":[{"poster":"Sihari","date":"2017-02-28T20:31:07.425+0000","up_votes":1,"down_votes":0,"body":"Es passiert oft genug! \nOder man muss als erstes bannen und hat sich noch gar nicht so viele Gedanken dazu gemacht, wen man überhaupt bannen möchte. Oder der Gegner pickt vorher das, was du als 4. bannen willst.\nFakt ist: die 15 Sekunden sind einfach zu wenig.","replies":[{"poster":"charmelikeahri","date":"2017-02-28T20:53:19.487+0000","up_votes":1,"down_votes":1,"body":"Fakt ist: du siehst es so. Ich sehe es anders!\n\nIch banne zu 99% das Gleiche! Wieso sollte sich das auch von Game zu Game ändern!!! Wenn mir ein Champion als besonders OP aus der letzten Runde aufgefallen ist dann weiß ich noch was ich vor 2m busted gefanden habe! Wenn nicht ban ich immer Ori (99% der Zeit)  \n\nUnd ich denke auf keinen Fall das das jetzige LCS-System so übertragen wird. Das würde in Solo Q schlichtweg absolut gar keinen Sinn machen. Wir haben doch keine Taktiken in der CS! Wir swapen mal alle 20 Games! Ich denken dass sinnvollste währe die Leute nach der Reihe bannen und dann Picken lassen. Wie jtz also auch","replies":[{"poster":"Sihari","date":"2017-02-28T21:05:39.145+0000","up_votes":1,"down_votes":1,"body":"Is ja schön, dass du jede Runde das selbe bannst, aber andere machen das nicht so. \nGerade wenn es 10 Banns gibt müssen nicht mehr nur die OP-Champions gebannt werden, sondern man kann endlich auch mal wieder das tun, wofür die Banns gedacht sind: taktisch Counter bannen!\nDu vergisst, dass das nicht nur in der SoloQ sondern auch in der FlexQ gilt und da spielen auch gern mal organisierte Teams.\n\nUnd mal ganz ehrlich: was ist so schlecht an der Idee, dass man mehr als eine Person gleichzeitig bannen lässt, dass du darüber anscheinend nicht mal nachdenken willst und lieber an deinen lächerlich kurzen 15 Sekunden festhalten willst?","replies":[{"poster":"Pure Cynicism","date":"2017-03-01T09:52:29.305+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sihari,realm=EUW,application-id=YnZkMR0R,discussion-id=472EsTMZ,comment-id=000000000000000200000000000000000000,timestamp=2017-02-28T21:05:39.145+0000)sondern man kann endlich auch mal wieder das tun, wofür die Banns gedacht sind: taktisch Counter bannen!\n\nDas macht aber nur dann Sinn, wenn jeder seinen Champ nahezu perfekt spielen kann. Und unter Diamond kann kaum jemand seinen Champ gut spielen. ZB countert Quinn Riven nur dann, wenn der Spieler mit Quinn auch gut umgehen kann. Ist der Riven-Spieler auf Riven einfach besser, wird Quinn ab Level 6 durchgehend gedived werden.","replies":[]},{"poster":"charmelikeahri","date":"2017-03-01T08:11:57.567+0000","up_votes":1,"down_votes":0,"body":"Alles in allem...\n\nDu denkst 15s sind zuwenig. Ich nicht. Ist unsere Meinung. \n\nZwei Leute gleichzeitig bannen zu lassen ist auch eine gute Idee allerdings halt NUR für Solo Q weil im Probereich die Bannorder eine wichtige Rolle spielt und man so nicht auf die Banns der anderen reagieren kann. \nIn Solo Q fände ich es in Ordung (gut sage ich nicht weil ich generell gegen 10 Banns bin, ich meine wenn ihr einen der oft gebannten Champs wie Rengar One-Trickt und dann 10 Banns rauskommen JA GEGE) allerdings sollten dann beide das Gleiche bannen sollte auch nur der Champion raus sein (also dann muss nicht der eine nochmal bannen)","replies":[]}]}]}]}]}]}]},{"poster":"God of Cake","date":"2017-02-28T19:46:04.084+0000","up_votes":1,"down_votes":0,"body":"2 Frage habe ich noch und zwar wenn des 10 ban System kommt \n\n1. ist dann des 10 ban System für alle Q ( FlexQ und Solo Q und 3 Rankt)  oder nur Solo Q und Flex find des ein bisschen doof wenn es dann noch bei 3 rankt ist \n\n2. Wenn ein Anfänger rankt spielt braucht er ja eine bestimmte Anzahl von Champion dadurch das es mehr zum bannen gibt erhöht sich ja auch die anzahl der Champion die man besitzen muss als Anfänger oder etwa nicht?","replies":[{"poster":"HyperionCH","date":"2017-02-28T20:28:36.498+0000","up_votes":2,"down_votes":0,"body":"Noch zu Punkt 2:\nStatt 16 müsste ein Spieler (mit Stufe 30) 20 Champs haben. Ich denke, wer Rankeds spielt, wird dies in den meisten Fällen auch jetzt bereits haben, wenn man Level 30 ist (und Rankeds spielen möchte -> nicht alle spielen sofort Ranked, wenn man Stufe 30 wird; smurfs ausgenommen).\n\nKritischer wäre es eher, dass man pre-30 länger braucht, bis man Draft-Pick-Normal spielen kann und Blind Pick Normals spielen muss. Ist aber sicherlich auch Geschmackssache, was man lieber spielt.","replies":[{"poster":"God of Cake","date":"2017-02-28T20:40:44.813+0000","up_votes":1,"down_votes":0,"body":"müssten es nicht mehr sein als 20 Champions sein?","replies":[{"poster":"HyperionCH","date":"2017-02-28T20:48:19.088+0000","up_votes":1,"down_votes":0,"body":"Nein.\n\nDerzeit sind es 16, da man 6 bannt und 10 Champs gepickt werden.\nEs muss also möglich sein, dass man als Lastpick immer noch einen Champ picken kann, selbst wenn im schlimmsten Fall vorher wirklich alles Champs gebannt bzw. gepickt wurden (15 Champs), die man besitzt.\n\nBei 10 Ban kann man 19 Champs bannen + picken, bevor man als Lastpick dran kommt. Also braucht man einen 20. Champ, damit man auch einen picken kann (ob der Champ in die Rolle passt, ist natürlich eine andere Frage^^)","replies":[{"poster":"God of Cake","date":"2017-02-28T23:03:25.602+0000","up_votes":1,"down_votes":0,"body":"ich denke eher dann müssten es mehr wie 20 sein falls ihn ein bug behoben wird mit einem Champion und des war dein 20 dann hast du ein Problem :D","replies":[{"poster":"Megamaexx","date":"2017-03-01T11:59:08.407+0000","up_votes":1,"down_votes":0,"body":"Nein, es müssen 20 sein. Im Falle eines Bugs wird dir dann einfach verwehrt, in die Queue zu gehen","replies":[]}]}]}]}]},{"poster":"Rahzar","date":"2017-02-28T19:52:45.102+0000","up_votes":1,"down_votes":0,"body":"Dazu habe ich leider keine Infos, aber genau die Sachen werden wir klären bevor es live geht. Ich gehe mal davon aus, dass es keine 10 Bans im 3v3 geben wird.","replies":[]}]},{"poster":"ViviD VooiD","date":"2017-02-28T19:30:45.490+0000","up_votes":1,"down_votes":0,"body":"ah ok, das hoert sich dann gut an :) kanns ja kaum abwarten :)","replies":[]}]}]},{"poster":"Coopa123","date":"2017-02-28T19:21:29.006+0000","up_votes":2,"down_votes":0,"body":"> Ich denke aber, dass es sooo lange nicht mehr dauern wird\n\nAlso quasi soon™ auf deutsch übersetzt :D","replies":[]},{"poster":"naomibutt","date":"2017-03-17T22:07:50.664+0000","up_votes":1,"down_votes":0,"body":"das 10 ban system sollte eingeführt werden, denn es gibt ja immer mehr champions, also wieso nicht mehr bans?und so ist man dn pro playern immer näher :3","replies":[]}]},{"poster":"Bodycounter","date":"2017-03-01T10:03:02.907+0000","up_votes":2,"down_votes":1,"body":"Ein solches Bann-System empfinde ich für alle Spieler, die nicht mindestens im Bereich Master bis Challenger spielen, als sinnlos. Darunter spielen die Teams sowieso ohne Strategien und Konter, also wozu der Aufwand außerhalb der professionellen Szene?\n\nDie Wartezeiten sind jetzt schon recht hoch und es passiert regelmäßig, dass Spieler ihre Banns oder Picks verpassen beziehungsweise am Ende doch noch dodgen. Mit dem neuen System würde der Durchschnittsspieler wahrscheinlich bis zu 20 Minuten bis zum Spielstart warten müssen. Da verzichte ich lieber auf die zusätzlichen Banns.\n\nUnd übrigens: Solange ihr Champions wie Camille unangetastet lasst, könnt ihr diese auch einfach aus dem Spiel entfernen und das als \"Bann\" akzeptieren. Arbeitet lieber an den echten Problemen als an einem System, dass für 98% der Community sowieso keinen Einfluss hat als längere Wartezeiten.","replies":[]},{"poster":"Sephi51","date":"2017-03-06T12:03:18.942+0000","up_votes":1,"down_votes":5,"body":"Das 10 Bann System ist jetzt schon gut 3 Jahre überfällig, aber man kennt es ja nicht anders hier von Riot.\n","replies":[{"poster":"God of Cake","date":"2017-03-08T22:45:26.463+0000","up_votes":1,"down_votes":0,"body":"Ich persönlich finde die solo Queue sollte so bleiben wie sie ist mit 6 bans \n\nNur Flex Queue sollte 10 banns haben\n\n\ndes wird ewig dauern ins rankt zu kommen \ndes dauert länger mit den 10 bans \naußderdem wenn jemand leavt sitzt man ewig davor bis es endlich startet","replies":[]}]}]}