{"poster":"Éclat Divin","date":"2018-08-03T21:00:09.303+0000","title":"BANNED FOR 3 WEEK","subforum":"Help & Support (OCE)","up_votes":1,"down_votes":0,"body":"I leaved the game 1 week ago and when I wanted to reconnect a few days later i see that i got ban for 3 weeks. Idk why I did nothing special i was playing with my friends on normal game, if its just the fact that i played yasuo ap wtf riot i was 5/3 i haved fun and we won the game. IF we dont play with ur items with ur meta you ban us nice rito nice mentality dont be surprise that a lot of players leave the game Iam on the OCE server btw.","replies":[{"poster":"Project Xayah","date":"2018-08-03T23:19:17.734+0000","up_votes":1,"down_votes":0,"body":"It's important to note that Riot doesn't attempt to ban based on meta/non-meta picks (there have been notable cases in the past where players believed they had, but each one I've seen has had more to it than that). I'd have to assume that this case has a lot more to it than just you choosing an off-meta strategy, such as being related to chat offences, consistent leaving/AFKing or consistently choosing off-meta picks in most games despite clear opposition about the strategies from team mates (categorised as \"refusing to communicate/cooperate\").\n\nAny extra information (such as what you should have received in the reform card and/or email regarding the punishment) would assist in determining the cause of the ban. Based on the information you *have* provided, this ban *may* be relating to consistently leaving and/or going AFK in-game, but no one here could help address/explain that without additional information.\n\nIf you believe the ban was made in error, you should submit a ticket to [Support](https://support.riotgames.com/hc/en-us/requests/new) (pick the \"I have a question about a suspension or restriction on my account\" option) and address the issue with them (it will help to clearly state you wish to appeal and want more information regarding the cause of the ban, otherwise you *may* receive very \"simple\", generic responses).","replies":[{"poster":"Éclat Divin","date":"2018-08-04T00:53:19.919+0000","up_votes":1,"down_votes":0,"body":"Thank you for your answer i received that email : \n\nGreetings kawano,\n\nActions that have been performed on your account are in violation of the League of Legends Terms of Use. You can review these terms at http://www.leagueoflegends.com/legal/termsofuse\n\nDue to the severity of this violation, your League of Legends account has been banned until Mon Aug 13 17:42:39 UTC 2018\n\nIf you have any questions, contact our Player Support team at https://support.leagueoflegends.com/home\n\nRiot Games Player Support\n\n\n\n\n\ni dont understand what i did wrong im so confuse","replies":[{"poster":"Project Xayah","date":"2018-08-04T05:44:27.380+0000","up_votes":1,"down_votes":0,"body":"Based on that, it *kind of* seems like it *might* be something along the lines of cheating/3rd party software, as usually there'd be something informing of what kind of punishment it is, but I'm not sure. I'd definitely recommend submitting a ticket to Support requesting more information, however if it is a cheating/3rd party software ban you'll only get a very generic response from them (Riot's policy is to keep as much information regarding such punishments away from the public, in an attempt to \"stem\" the effectiveness of such things).\n\nIt may also be prudent for you to look for any indication that you account has been compromised (such as games in your match history that you didn't play, or purchases made in the store that weren't you) and, if found, make efforts to deal with that (change passwords, notify Support, run anti-virus scans on computers you use and generally secure the account and any related accounts such as emails).\n\nUnfortunately, without more info, I can't be much more help than that.","replies":[{"poster":"Éclat Divin","date":"2018-08-05T00:25:56.659+0000","up_votes":1,"down_votes":0,"body":"I don't use any party software or cheating how can i submit a ticket to riot?","replies":[{"poster":"Project Xayah","date":"2018-08-05T00:46:25.421+0000","up_votes":2,"down_votes":0,"body":"In order to submit a ticket you simply need to go to the Support site (link: https://support.riotgames.com/hc/en-us/requests/new) and follow the prompts.\n\nAs I said before, i'm not really sure what it is about, but the lack of information makes me think it might be related to 3rd party software and/or cheating (as a lack of information is typical in that), which is also why I recommended you look for signs of compromise on the account.","replies":[]}]}]}]}]}]}