{"poster":"LittleXhunter","date":"2015-10-27T06:20:39.457+0000","title":"Midlaner sucht Rankedteam [5vs5 / 3vs3] (Bitte Lesen <3)","subforum":"Clans & Teams","embed":{"description":"Summoner Lookup with statistics, ratings, LoLSkillScore and more for LittleXhunter, a League of Legends summoner on the Europe West region.","url":"http://www.lolskill.net/summoner/EUW/LittleXhunter","image":"http://static.lolskill.net/img/tiers/192/diamondV.png"},"up_votes":1,"down_votes":0,"body":"(Ich schreibe normalerweise nie meine Elo in den Post, wenn das euch Interessiert schaut auf mein Lol Profil. Grund daf&uuml;r ist das ich denke das man Menschen/Spieler nach ihrem Team Charakter bewerten sollte und nicht nur nachdem Individuellen skill. Wie ein altes Sprichwort lautet _&quot;Eine Armee aus L&ouml;wen die angef&uuml;hrt wird von einem Schaf ist nicht so gef&auml;hrlich wie eine Armee von Schafen die angef&uuml;hrt wird von einem L&ouml;wen&quot;_.Was soviel bedeute wie das auch zb, Gold Spieler Diamond Spieler schlagen k&ouml;nnen wenn diese besser im Teamzusammen spielen. So genug davon hier der eigentliche Text.\n\n----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n\nHallo Community,\n\nIch bin der Julian 20 Jahre alt und bin auf der suche nach einem Rankedteam mit dem ich spielen kann, dabei ist mir swowohl die Bottom Side im 3vs3 als Mage Assasine (keine Support Combs) als auch der 5vs5 bereich (normal Midlane) recht.\nMeine w&uuml;nsche f&uuml;r das Team w&auml;ren das Aktiv gespielt wird (2-3 Games wenn m&ouml;glich pro Tag) ich so Akzeptiert werde wie alle anderen auch im Team, (keine Bevorzugungen aufgrund von Elo), und jeder Kritikf&auml;hig und Gespr&auml;chsbereit ist sofern probleme oder missverst&auml;ndnisse aufkommen.\nAu&szlig;erdem w&auml;ren ggf. Trainingszeiten erfreulich sofern dies dabei ist, denn man findet ja nicht sofort zueinander und ich denke Synergie ist ganz Entscheidend gerade damit Teams best&auml;ndid bleiben und nciht sich beim ersten krach oder wenn es nicht gut l&auml;uft aufgel&ouml;st werden. Eine letzte sache die bei mir noch besonders ist, die Tatsache das ich derzeit sehr viel Zeit habe und deshalb zu jeder Zeit online sein kann nach Absprache und dies auch über sehr lange Zeit.\n\nZu meiner Person, bin wie bereits gesagt 20 Jahre alt, spiele seit der Beta League of legends und bin ein versierter Midlaner. Ich kann jeden Midlaner spielen allerdings hat ja jeder seinen Championpool, bei mir sind das (Leblanc,Syndra,Diana,Orianna und Ekko) dabei ist ein Champion separat zu erw&auml;hnen und zwar mein Main Champion Ahri, mit dem ich schon &uuml;ber 1700 Spiele bestritten habe und oft auch als &quot;One Trick Pony&quot; bezeichnet werde.\nNoch erw&auml;hnenswert ist das ich mir im M&auml;rz dieses Jahres einen neuen Account gemacht habe mit dem ich spielen w&uuml;rde er besitzt zwar nur 22 Champions aber hat alles was ich f&uuml;r das spielen brauche (nur Traden ist schwer). Mich zeichnet noch weiterhin aus das ich sehr viel Verst&auml;ndnis mitbringe f&uuml;r andere Spieler im spiel selbst sehr ruhig bin und au&szlig;er meinen calls (miss/ ward , flash timer) nicht viel sage, da ich den shoutcaller respektiere.\n\nIch w&uuml;nsche mir echt das ich noch diese Season meine letzten 10 Punkte f&uuml;r den Wardskin erhalte und ich dar&uuml;berhinaus auch f&uuml;r kommende Season ein Team habe mit dem ich spielen kann. Wenn ich hier Spieler angesprochen haben sollte dann addet mich bitte und teilt mir euer Anliegen mit.\n\nIch w&uuml;nsche allen die das hier lesen ansonsten noch einen sch&ouml;nen Tag.\nMit freundlichen Gr&uuml;&szlig;e Julian","replies":[{"poster":"Windcutter Flora","date":"2015-10-27T08:23:34.253+0000","up_votes":1,"down_votes":0,"body":"Hallo Julian,\n\nich habe leider kein Team dir anzubieten, jedoch würde ich mich auf ein Paar Normals sehr freuen. Du scheinst ein ruhiger und ausgewogener Typ zu sein. Genau diese Eigenschaften würde ich mir besonders bei meinem Team wünschen. Ich würde mich sehr freuen, wenn du mich adden würdest.\n\nAccount: windcutter flora\nServer: EU West\n\nKind regards \nJohannes","replies":[]}]}