{"poster":"Worrior697","date":"2017-01-12T07:37:24.424+0000","title":"Auto ban is broken af,","subforum":"Player Behaviour","up_votes":3,"down_votes":1,"body":"So I emailed riot about this and all I got told was &quot; It isnt based on how many people report you &quot;\n\nI CALL BULL ON THAT!!\nI just had a game on my other account where I got a troll support. That was autofilled so he was not going to support...\n\nSo he would push the wave and take CS and then steal kills.\nBut when I had enough of it and just afk&#039;ed farmed..\n\nI get reported by my team because they are mad about me being sick of trolls.\nSo if it isnt based on HOW MANY REPORT YOU..\n\nWHY THE FRAG WAS I BAN.\nI wasn&#039;t toxic. Yes I was pissed off.. But I didnt call anyone anything but &quot;troll&quot; I didnt say anything other then pointing out what the troll was doing. { NOT IN ALL CHAT. In party chat since him and the other one are duo's }\n\nSo tell me riot. WHAT IS THE FKING AUTO BAN BASED ON AGAIN YOU LYING SACKS!!!!!!!!\n\nSo all this does is prove.. MAKE A PREMADE. REPORT THE ODD ONE OUT ALL THE TIME.\nThey will be ban every time due to this ","replies":[{"poster":"Ninox","date":"2017-01-12T08:12:59.435+0000","up_votes":2,"down_votes":1,"body":"It doesn't matter how many people report you, it depends only on whether the reports against you are valid. It depends on the behaviour, but a single valid report can be enough to trigger a punishment, though this usually applies to behaviour like excessive hate speech, the kind of behaviour that says \"I have no intention of reforming and/or I am so very negative that the cost of giving me the chance is too high\".\n\nTypically, it takes at least a few games of valid reports to net you a punishment, regardless of how many people in those games report you. If a report for a behaviour is valid you are judged with reference to that behaviour in that game, so only one report is necessary/relevant. The only exception would be if one person reported you only for intent feeding and someone else only for bad chat, then both reports would be relevant because they are for different things.\n\n> So if it isnt based on HOW MANY REPORT YOU..WHY THE FRAG WAS I BAN.\n\nWe don't have the whole picture here, so we cannot tell you. If you want us to tell you why you were banned then you will have to give us at least your full reform card and preferably your correspondence with player support as well. They are what indicate why you were punished, so without them, we just don't know.","replies":[{"poster":"Worrior697","date":"2017-01-12T08:34:55.203+0000","up_votes":2,"down_votes":1,"body":"> but a single valid report can be enough to trigger a punishment,\n\nDue to the amount of people that report.\nNothing else. \n\nI have shown this with a GP game I did. But riot refused to give full chat log BECAUSE IT SHOWED WHY AND HOW.. I was so called passive aggressive.\nThis was why I was ban on my other account. Then I also showed before how I wasn't toxic in anyway but still got a ban.\n\nI am sorry if you cannot see some of the post that go on here. People that were ban / chat ban and so on for nothing.\nI saw one guy that was ban for singed support. But yet I get a troll Wu support this is fine.\n\nIf I Wu support for the next 20 games and get reported.. I will be ban for playing Wu support.\nI can upload a video of the full chat log { Since this is all I have learnt from my ban on my other account } Showing he locked in Wu at the last second. Showing his duo mate laughing about it.\nThen showing how he even tried to blame me for it.\n\nBut if I do it is naming and shaming so once again riot has that to hide behind. I and many others have proven it is BASED ON Keywords , The mount of people reporting.\nNOTHING ELSE.\n\nSo yes as I said this can be proven very easy. Next time you are permade. Report the odd one out. Get the other team too also. You will see that play be ban.\nEVEN IF HE SAID NOTHING AT ALL.\n\nMy other post I was talking about. Just for a point of reference \n\nhttp://boards.oce.leagueoflegends.com/en/c/player-behaviour/dKygPxWi-i-got-ban","replies":[{"poster":"Ninox","date":"2017-01-12T13:07:16.827+0000","up_votes":2,"down_votes":0,"body":"If you mean what percentage of the overall community reports x behaviour then yes, it is dependent on how many people report it, because the more sever the behaviour the more people are inclined to report it. \n\nBut as far as an individual games reports count, as long as there is one valid report for x behaviour, anymore reports for that behaviour are essentially irrelevant as the system has already been flagged to look at that behaviour. i.e the number of reports against you does not matter, what matters is if a valid report exists (in which case your behaviour will be reviewed) or doesn't (in which case the report will be thrown out and anyone who reported you for that will have their report weight dropped).\n___\nI'm not sure what you think you showed with the GP game you speak of, but it is YOUR behaviour that you need to fix, not anyone else's. You intentionally picked a champion you couldn't play so your team would lose, IN A RANKED GAME. How does that not qualify as trolling? Your behaviour and yours alone is your responsibility which is why you only see your chat logs, so you can examine your behaviour rather than justifying it by saying \"they started it\".\n\nIf you had proved you weren't toxic in anyway then the ban would have been reversed. The fact that it wasn't means that more likely you do not understand why x behaviour is toxic, and that is where posting chat logs on boards has value.\n___\nAll the posts I've seen on boards of people being banned/chat restricted were for good reason. The one time it was a mistake it was reversed and that was a long time ago. If you would care to point me in the direction of posts made by people who were banned/restricted for nothing I'd be happy to to take a look for you.\n\nWhat makes you think a troll Wukong support is fine? Maybe it was the first time he'd done it? The system can't ban him for something he hasn't done yet, and would usually give a couple games to gather context and ensure the reports are valid. Playing Wukong support is not punishable on its own, but if he was trolling then he will face punishments just like anyone else.\n___\nAgain, the act of playing a non-meta support is not punishable. We do not need to see the full chat log because it is not the behaviour of the other players that is in question here, it is yours, and what your chat logs tell me is that you were persistently negative and aggressive the ENTIRE two games. That is not ok. \n\nIt's also worth noting that you have failed to provide game 1, which doesn't exactly speak well to your credibility. To me, those two games would be enough to get you punished assuming you had a history of negative behaviour, which given it was a ban and not a chat restriction is likely the case, but for all we know you have given us the two most mundane games to look at, with game 1 being much worse.\n\nIf you really want to show us the full chat log then you can use screenshots and just block out the name, since I'm well aware not everyone has the means to edit a video in that manner.\n___\nHow exactly have you proven it is based on keywords/number of reports? You have yet to show any evidence supporting your claims. It's also worth noting that correlation does not equal causation. Just because people who use racial slurs a lot get banned a lot doesn't mean the system is looking at keywords, it's looking at context and establishing that it wasn't said in jest to a friend, but was rather good old fashioned racism.\n___\nWhy would that player be banned? The only thing reporting that odd player out would accomplish is you and your premades report weight dropping. That behaviour DOES NOT get you banned, and if you really believe otherwise then I would really like to see all these people that have supposedly been banned by troll premades.","replies":[]}]},{"poster":"Valor Carrys","date":"2017-01-12T08:26:15.673+0000","up_votes":1,"down_votes":0,"body":">though this usually applies to behaviour like excessive hate speech, the kind of behaviour that says \"I have no intention of reforming and/or I am so very negative that the cost of giving me the chance is too high\".\n\nThe kind of behaviour which probably hasn't been banned before at all and will get a long ban for basically nothing.\n\nAnd the sort of behaviour which would probably have been brought back had they gotten proper bans before their too long ban.","replies":[{"poster":"Ninox","date":"2017-01-12T12:42:44.484+0000","up_votes":1,"down_votes":0,"body":"I can't say I understand, you lost me a little there.","replies":[{"poster":"Valor Carrys","date":"2017-01-12T12:52:05.660+0000","up_votes":1,"down_votes":0,"body":"What i'm saying is that my experience is that rito and banning is ban late and hard for no real reason instead of ban early and actually cause reform.\n\nAnd in reality that only serves to piss people off.","replies":[{"poster":"Ninox","date":"2017-01-12T13:09:17.964+0000","up_votes":1,"down_votes":0,"body":"Thanks for clarifying.\n\nThe automated system bans within 15 minutes of the last game, hence the \"instant\" part of the name. Of course hardly anyone is banned after one game, but if after three games they get a chat restriction I'm not sure how that qualifies as late. The more severe the behaviour the less leeway they get so I'm not really sure where you are coming from, hence the confusion on my part.","replies":[{"poster":"Valor Carrys","date":"2017-01-12T13:40:09.188+0000","up_votes":1,"down_votes":0,"body":"I may as well point out, i'm JasonWazza.\n\nIf you can recall my ban that's what i am talking about.","replies":[{"poster":"Ninox","date":"2017-01-12T14:43:55.852+0000","up_votes":1,"down_votes":0,"body":"I'm aware as it came up in a recent thread, though I don't entirely remember the details of your ban. \n\nThere are exceptions to every rule of course. It seems likely to me that your behaviour was inconsistent enough that the punishments came rather sporadically. \n\nI'm afraid I don't quite have the time to go back through and look for your post cause I'm responding to boards between other things today but if you could chuck me a link I could maybe elaborate some more.","replies":[{"poster":"Valor Carrys","date":"2017-01-12T15:45:10.559+0000","up_votes":1,"down_votes":0,"body":"\"Punishments\" the issue is that your saying it plural.\n\nI have had A punishment.\n\nWhich was a 2 week punishment, for what was fairly tame, and i've come up against and with multiple people before and after said ban which were worse.\n\nI honestly can't be bothered finding the post, because honestly it just made me annoyed with riot, nothing more.\n\nEDIT: and if i recall you weighed in, and it wasn't anything all that useful to explain why i got a 14 day ban over a chat restriction.","replies":[{"poster":"Ninox","date":"2017-01-12T15:51:22.509+0000","up_votes":1,"down_votes":0,"body":"As I said, I don't remember the details, I answer a lot of those sorta posts. I'll see if I can find it when I have more time.","replies":[{"poster":"Valor Carrys","date":"2017-01-12T15:56:39.473+0000","up_votes":1,"down_votes":0,"body":"Honestly i wouldn't even bother with it.\n\nWon't change my attitude to the ban.\n\nEDIT: Also i can easily get you like one of the 3 chat logs if i just go into my support ticket, but that one in the support ticket was a bad example, which basically had nothing ban worthy in it, Because you know, rito support.","replies":[{"poster":"Neosinf","date":"2017-01-12T20:49:51.316+0000","up_votes":1,"down_votes":0,"body":"He's the Dragon. \n\nHe sits on the plastic throne of the seven kingdoms of Runeterra, forged by his dragon breath from the many keyboards of the vanquished noobs that post how they got banned on this forum.\n\nHe will burn you.\n\nRelent, and flee.","replies":[{"poster":"Ninox","date":"2017-01-13T05:14:29.164+0000","up_votes":1,"down_votes":0,"body":"Hey now I'm a friendly dragon.","replies":[]}]}]}]}]}]}]}]}]}]}]},{"poster":"Neosinf","date":"2017-01-12T08:46:25.240+0000","up_votes":1,"down_votes":0,"body":"AND THE DRAGON HAS SPOKEN\n\nPunishment:\n\nNOOB HELL.\n\n(ie pre level-30 games with no runes/masteries/champs that make you spend $50 on boosts just to get your new account to level 30 before end of season)\n\nAND MAY YOU BE REFORMED FROM THE PITIFULLY HATEFUL WENCH YOU'VE BECOME","replies":[]}]},{"poster":"Neosinf","date":"2017-01-12T07:56:55.442+0000","up_votes":2,"down_votes":1,"body":"Can't wait for Seras Dragon the High Overlord of the 'i got banned cos rito hate me' board to tell you why you deserved it.\n\nPlease, Dragon, proceed.","replies":[]},{"poster":"Project Xayah","date":"2017-01-12T11:29:06.655+0000","up_votes":1,"down_votes":1,"body":"> So he would push the wave and take CS and then steal kills.\n> But when I had enough of it and just afk&amp;#039;ed farmed..\n\nSo your  solution to getting trolls in your games is to troll?\n\nAnd you wonder why you got banned???","replies":[{"poster":"Valor Carrys","date":"2017-01-12T11:31:24.491+0000","up_votes":1,"down_votes":1,"body":"if afk farming is bannable then a lot of people are ban worthy.\n\nBut logic/10","replies":[{"poster":"Project Xayah","date":"2017-01-12T11:33:21.512+0000","up_votes":1,"down_votes":1,"body":"It is ban-worthy, since you'd be intentionally doing nothing useful to contribute to the game. That is why it's called \"*AFK* farming\", isn't it?","replies":[{"poster":"Valor Carrys","date":"2017-01-12T11:37:45.053+0000","up_votes":1,"down_votes":1,"body":"Now ban worthy, the majority of Bronze 5 players who farm before/after teamfights.\n\nThink before you speak, and pull your head out of riot's ass, because it's starting to look painful how stuck up there you are.","replies":[{"poster":"Project Xayah","date":"2017-01-12T22:48:25.647+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Valor Carrys,realm=OCE,application-id=T8eq2lFQ,discussion-id=YVPMgT41,comment-id=0003000000000000,timestamp=2017-01-12T11:37:45.053+0000)\n>\n> Now ban worthy, the majority of Bronze 5 players who farm before/after teamfights.\n\nLast I checked, \"AFK framing\" was completely different from general farming in-game. With AFK farming, the player blatantly disregards their team to focus solely on farming for the entire duration of the game, thus meaning they're of no use and may as well be AFK.","replies":[]}]}]}]}]},{"poster":"Valor Carrys","date":"2017-01-12T08:16:56.809+0000","up_votes":1,"down_votes":1,"body":"\"your not justified being angry at anyone so ban.\"\n\nProbably the ban reason.","replies":[]}]}