{"poster":"INoKami","date":"2018-07-27T11:31:13.824+0000","title":"Wie sage ich es am besten... Danke?","subforum":"Allgemeiner Chat","up_votes":2,"down_votes":2,"body":"Hallo Riot,\n\nwir kennen uns schon seit mittlerweile fast 7 Jahren. Und was f&uuml;r eine Zeit das war! Ich, damals noch ein junger und unerfahrener Bub, du auf deinem kometenhaften Aufstieg. Auf kurz oder lang w&uuml;rden wir uns begegnen, und so geschah es auch. League of Legends wurde zu DEM Spiel meiner Jugend, es war eine Achterbahn der Gef&uuml;hle. Wir hatten Spa&szlig; ohne Ende, jubelten &uuml;ber die Pentas, die ich irgendwie schaffte, kicherten &uuml;ber geniale oder gl&uuml;ckliche (oder beides kombinierte) Baron-Steals, lachten &uuml;ber sauber gespielte Outplays oder &uuml;ber kleine Fails, egal von wem. Genossen die Zeit, wo man mit wildfremden Beschw&ouml;rern einen kleinen Plausch anfing und dabei coole, neue Leute kennen lernte. Das neue Honor-System. Hextech-Crafting.\n\nJa, es gab auch traurige Momente. Zum Beispiel den, als ich drauf und dran war, dich f&uuml;r ein anderes Spiel zu verlassen. Die Ranked-Games in Season 4, das war wirklich kurz vor Elo-Hell. Tekko. Der Zoe-Release. Als die Funktion verschwand, Gegner ehren zu d&uuml;rfen, einige hatten es wirklich verdient. Der Juggernaut-Patch. Season 3, wo du auch gerne mal 45 Minuten in der Login-Warteschlange abh&auml;ngen durftest, der erste Teambuilder, der verdeutlicht hat, welchen Wert ein Supporter hat, da gef&uuml;hlt nur jede Stunde einer auftauchte.\n\nAber diese Zeiten sind vorbei und ich habe dir immer die Treue gehalten, ich war dir immer daf&uuml;r dankbar, dass du f&uuml;r mich da warst. Und ich habe diese Dankbarkeit auch gerne zum Ausdruck gebracht, in Form von kleinen Geldscheinen, die ich dir immer wieder &uuml;berlassen habe, damit du etwas f&uuml;r mich in ein neues Gewand tauchen kannst. Hextech-Crafting schien im Gegenzug der Ausgleich f&uuml;r meine Dankbarkeit zu sein. Infernal Nasus. Aether Wing Kayle. Gatekeeper Galio (und das als Galio-Main!), nur, um mal die wertvolleren zu kennen, die vielen kleinen Nettigkeiten bleiben ebenfalls unvergessen.\n\nDoch heute... wolltest du mir nochmal Danke sagen. Auf deine Art. Danke f&uuml;r die 7 Jahre Treue und f&uuml;r alles andere, was wir zusammen erlebt haben. Und eigentlich m&uuml;sste ich jetzt fast schon sagen &quot;So etwas habe ich nicht verdient!&quot;, aber wenn das der Fall w&auml;re, w&uuml;sstest du das und dann h&auml;ttest du mir etwas anderes geschenkt. In diesem Sinne: Ich hab dich lieb, Riot!\n\nhttps://imgur.com/R3OvZA5\n\n...\nHallo, hier bin ich nochmal, ungelogen nicht mal 5 Minuten später. Ich wollte nur schnell die restlichen Orbs verwerten, noch mal eben einen Schlüssel gebastelt und... Riot, ich glaube, du magst mich wirklich! Womit habe ich so viel Zuneigung verdient?\n\nhttps://imgur.com/imDi5T4\n\nHerzlichst\n\nIncaedeus\n{{sticker:galio-happy}} {{sticker:sg-lux}} \n_Leidenschaftlicher Galio (und eventuell auch bald Lux-)Main_","replies":[{"poster":"QuaffQuaff","date":"2018-07-28T11:57:29.373+0000","up_votes":1,"down_votes":0,"body":"kaufst du schlüssel oder warum hast du so wenig truhen?","replies":[{"poster":"INoKami","date":"2018-07-28T12:01:39.115+0000","up_votes":1,"down_votes":0,"body":"Du bezeichnest 19 Truhen als wenig? Ok...\nHab eher im Gegenteil viel zu wenig Schlüssel. Ich bin einfach zu gut und krieg die Kisten viel zu schnell zusammen :*","replies":[{"poster":"QuaffQuaff","date":"2018-07-28T12:02:34.837+0000","up_votes":1,"down_votes":0,"body":"ich hab noch fast 50 truhen im inventar","replies":[{"poster":"INoKami","date":"2018-07-28T12:09:24.692+0000","up_votes":1,"down_votes":0,"body":"Schön für dich. Nein, eigentlich nicht, weil das noch schlimmer ist als 19 Truhen^^","replies":[]}]}]}]},{"poster":"Mjölnir Kind","date":"2018-07-27T12:04:51.113+0000","up_votes":1,"down_votes":0,"body":"Mach ich immer wieder gern :^)","replies":[{"poster":"INoKami","date":"2018-07-27T12:10:18.753+0000","up_votes":1,"down_votes":0,"body":"Ach, du warst dafür verantwortlich?\n\n\n...Können wir mal irgendwann unter 4 Augen reden? Hab da noch so ein Anliegen zu dem Thema ;)","replies":[{"poster":"Mjölnir Kind","date":"2018-07-27T12:25:49.070+0000","up_votes":1,"down_votes":0,"body":"Na dann ;) schieß los","replies":[{"poster":"Schokohörnchen","date":"2018-07-27T16:07:48.203+0000","up_votes":1,"down_votes":0,"body":"Benimm dich Sophia :o","replies":[{"poster":"Mjölnir Kind","date":"2018-07-27T16:11:03.377+0000","up_votes":1,"down_votes":0,"body":"https://media.giphy.com/media/a93jwI0wkWTQs/giphy.gif","replies":[]}]}]}]}]},{"poster":"Schokohörnchen","date":"2018-07-27T16:10:24.508+0000","up_votes":1,"down_votes":0,"body":":> Der Element sind ist super schick! <3 Storm-Lux ist die beste Variante \\o/ \n\nIch hab gestern alle \"normalen\" Skin Shards gerollt. Hab jetzt nur noch klassische, legendäre und epische skin shards und so. :') Ich hatte auch einen zweiten Seelenstehler Vayne Shard, den ich als Andenken irgendwie behalten wollte xD aber ich ... hab ihn gerollt ...","replies":[]},{"poster":"oneshot Vasco","date":"2018-07-27T15:37:41.640+0000","up_votes":1,"down_votes":0,"body":"ich bin immer zu ungeduldig shards aufzuwerten, ich rerolle immer :D","replies":[{"poster":"INoKami","date":"2018-07-27T15:58:48.268+0000","up_votes":1,"down_votes":0,"body":"Das gibt es auch, aber ich bin mehr so der Typ \"Oooh, der Skin sieht geil aus... und der auch... und der auch!\" und -Zack!-, 14 Shards, die ich alle aufwerten will^^","replies":[]}]},{"poster":"OPChampsSucks","date":"2018-07-27T13:08:04.833+0000","up_votes":1,"down_votes":0,"body":"hgw :3 wenigstens kriegst du nicht nur champshards ^^","replies":[{"poster":"INoKami","date":"2018-07-27T13:21:41.215+0000","up_votes":1,"down_votes":0,"body":"Mein erster Permanent-Shard ever und dann direkt Ele-Lux... so muss dass >:D\n\nAber danke dir!","replies":[{"poster":"Lunaá","date":"2018-07-27T13:37:23.914+0000","up_votes":1,"down_votes":0,"body":"Naja, man bekommt alle Ultimativen und Hextech-Exclusiv Skins direkt freigeschaltet, das wurde ja extra so geändert, denn wer will schon 2950 Orangene Essenzen sammeln.\n\nLeider bekomme ich keine Schlüssel, um meine Kisten zu öffnen ...","replies":[{"poster":"INoKami","date":"2018-07-27T14:16:16.858+0000","up_votes":1,"down_votes":0,"body":"Pssssst, sei doch ruhig, jetzt ist es fast nur noch halb so schön... -_-","replies":[]}]}]}]},{"poster":"Noxempire","date":"2018-07-27T13:35:27.704+0000","up_votes":1,"down_votes":0,"body":"Hab auch schon jede Menge gute Skins bekommen. Das Hextech Loot System hat mir bis jetzt jede Menge Profit gemacht x)","replies":[]},{"poster":"Veezey","date":"2018-07-27T13:26:34.985+0000","up_votes":1,"down_votes":0,"body":"Wie es der Zufall so will habe ich diese beiden Skins durch ein reroll bekommen :D","replies":[]},{"poster":"ELOW Cronos","date":"2018-07-27T12:13:22.582+0000","up_votes":1,"down_votes":0,"body":"Okay das man sich über den Luxskin freut versteh ich ja, aber was ist so besonders an dem Tristanaskin? \n{{sticker:sg-lux-2}} \n\nFunfact: Ich habe auch diese beiden Skins in meiner Hextechwerkstatt xD","replies":[{"poster":"INoKami","date":"2018-07-27T12:17:05.227+0000","up_votes":1,"down_votes":0,"body":"Jaaaaa, wer würde sich nicht über Elementalist Lux Permanent (!) freuen?\n\nDer Tristana-Skin... es ist quasi einfach die Fortsetzung meiner kleinen Glückssträhne heute. Im Grunde habe ich ja heute Content im Wert von 30 Euro geschenkt bekommen (auch wenn ich für den Trist-Skin noch etwas arbeiten muss... genauso wie für die 13 anderen Shards, die auf eine Aufwertung warten^^)","replies":[]}]}]}