{"poster":"INoKami","date":"2018-08-30T12:50:03.421+0000","title":"[Champion-Konzept] Fha´Re, der Binder","subforum":"Skin- & Champion-Konzepte","up_votes":2,"down_votes":1,"body":"**[Champion-Konzept] Fha&acute;Re, der Binder**\r\n\r\nHallo, liebe Leser, es ist wieder an der Zeit! Ich bin Incaedeus und nachdem ich, Lt. Doenerlord und andere Mitstreiter, deren IGN ich leider Gottes vergessen habe, unseren Beitrag zum gro&szlig;en Wettbewerb eingereicht haben, kann ich mich nun endlich wieder meinen Konzepten widmen, namentlich Fha&acute;Re, den Binder.\r\n\r\nErw&auml;hnte ich schon, dass wir hiermit den n&auml;chsten kleinen Meilenstein erreicht haben? 25 Konzepte. Die Viertelhundert. Zwei Dutzend und ein Nachz&uuml;gler. F&uuml;nf vollbesetzte H&auml;nde. Bei der Anzahl bekommt mein Sozialleben echt ein bisschen Panik^^\r\nUnd mir gehen die Metaphern aus, deshalb genug der Worte und ab geht&rsquo;s ins Detail!\r\n\r\n**\r\nInhalt:**\r\n\r\n1. Allgemeines\r\n2. Werte/Schwierigkeit\r\n3. Lore\r\n4. F&auml;higkeiten\r\n5. Texte\r\n6. Wie spiele ich ihn?\r\n\r\n**\r\n1. Allgemeines**\r\n\r\n**Die Grundidee:** Heute haben wir abermals einen Fall von &bdquo;Kombination zweier Ideen&ldquo; zu tun. Die erste betrifft im Grunde die Passive, die aber den gesamten Spielstil vorgibt: Sie arbeitet mit Stacks. Aber wie gew&ouml;hnlich Stacks aufzubauen, um Boni zu erhalten, m&uuml;sst ihr hier Stacks abbauen, um st&auml;rker zu werden. Ist aber nicht so schwer, wie es sich anh&ouml;rt. Zum anderen: AoE-Schaden. Eine Menge davon. Wie setzt man das am besten um? Ganz einfach, indem jeder bedingungslos den selben Schaden bekommt! Kombiniert mit der ersten Idee und umh&uuml;llt mit einer halbwegs kreativen Lore ist daraus etwas geworden, was mir doch irgendwie zusagt. Und es ist irgendwie erholsam, wenn sich die Ult mit nur einem Satz erkl&auml;ren l&auml;sst. Ganz simpel.\r\n_*_ _murmel_ _*_ _Im Gegensatz zur W..._\r\n\r\nFha&acute;Re&acute;s bevorzugtes Einsatzgebiet wird der Jungle sein. Sein Spezialit&auml;t: Mehrere Gegner gleichzeitig an der Flucht hindern und sie dann zusammen mit seinen Kameraden gemeinsam niederm&auml;hen. Und so seltsam es erst mal klingt: umso mehr F&auml;higkeiten ihr spammt, desto besser. Ihr werdet schon sehen.\r\n\r\n**Aussehen:** Wir d&uuml;rften bereits wissen, dass diese Kategorie nicht gerade meine St&auml;rke ist und heute haben wir einen etwas schweren Fall vor uns, aber ich gebe mir M&uuml;he: Wie genau Fha&acute;Re aussieht, ist anfangs schwer festzustellen, denn was auch immer von diesem Wesen &uuml;brig blieb, ist nun zu einem langen und doch breiten Zylinder verpackt mit jeweils abgerundeten Enden. Er wird von &bdquo;glasfarbenen&ldquo; Ketten zusammen gehalten, die aus dem Nichts auftauchen und auch dorthin wieder verschwinden, man sieht nur den Teil, der Fha&acute;Re fesselt. Doch wenn die Passive in Aktion tritt, verschwinden die Ketten nach und nach (ihr werdet verstehen, warum, wenn ihr dort seid) und zum Vorschein kommt ein humanoides Wesen mit Pantherkopf und -h&auml;nden in goldbrauner R&uuml;stung, die handgefertigten Ornamente an den Panzerplatten gl&auml;nzen in der Sonne. Wenn noch die Ketten angelegt sind, sind sein Bewegungen&hellip; &bdquo;improvisiert&ldquo;. Zuerst kann er sich nur fortbewegen, in dem er wie eine Sprungfeder umher h&uuml;pft, und seine Angriffe sind noch &bdquo;kopflastig&ldquo; (Amumu l&auml;sst gr&uuml;&szlig;en), wenn die Ketten verschwinden, wird zun&auml;chst ein Arm freigelegt, dann der andere, dann auch mal ein Fu&szlig;&hellip;\r\n\r\nIhr merkt schon, etwas seltsam heute.\r\n\r\n**\r\n2. Werte/Schwierigkeit**\r\n\r\n|Statuswert|H&ouml;he auf Stufe 1|Zuwachs pro Lvl.|H&ouml;he auf Stufe 18|\r\n|-\r\n|Leben|558|84|1986|\r\n|Mana|361|38|1007|\r\n|HP/5|8|0,75|20,75|\r\n|MP/5|7,7|0,65|18,75|\r\n|Angriffsschaden|63|3,8|127,6|\r\n|R&uuml;stung|34|3,5|93,5|\r\n|Magieresistenz|32,1|1,25|53,35|\r\n|Bewegungsgeschwindigkeit|335|\r\n|Angriffsgeschwindigkeit|0,651|2,6%|1,093|\r\n|Angriffsreichweite|150|\r\n\r\n\r\nSchaden: [4/10]\r\nDurchhalteverm&ouml;gen: [5/10]\r\nMobilit&auml;t: [7/10]\r\nUtility: [3/10]\r\nCrowd-Control: [7/10]\r\nSchwierigkeit: [9/10]\r\n\r\n**\r\n3. Lore**\r\n\r\nWas genau bewirkt eigentlich ein Aufstiegsritual?\r\n\r\nDie offensichtlichste Antwort w&auml;re: Man erh&auml;lt grenzenlose Macht. Doch ab hier beginnt schon das Reich der Mythen und Spekulationen, denn die wenigen, denen diese Ehre zuteil wurde, hielten sich sehr zur&uuml;ck, wenn es um ihre&hellip; Aufwertung ging. Die einen sagen, man erh&auml;lt ebenso grenzenlose Weisheit, ein ewiges Leben, all das eben, was Sterbliche als erstrebenswert ansehen&hellip;\r\n\r\nAber was genau passiert dann mit einem?\r\n\r\nDie schl&uuml;ssigsten Theorien besagen, dass in dem Moment, in dem der K&ouml;rper von der urt&uuml;mlichen Macht durchflossen wird, sich aufl&ouml;st und von eben dieser Energie neu geformt wird. Ein jedes Atom wird in seine Bestandteile zerlegt, eventuell ver&auml;ndert, auf welche Art auch immer, und neu zusammengesetzt. Woher die Energie wei&szlig;, wie die &bdquo;Vorlage&ldquo; und das Resultat auszusehen hat ist ebenso unbekannt wie die Quelle der Energie. Sie war schon immer da, noch bevor die ersten intelligenten Wesen diesen Ort entdeckten und sie wird auch da bleiben, wenn das Ende der bekannten Welt kommt. So glaubt man zumindest.\r\n\r\nWas ist dann der Zweck des Aufstiegs?\r\n\r\n&Uuml;ber diesen Punkt zerbrechen sich die meisten Gelehrten die K&ouml;pfe. Die einen sagen, es ist einfach eine Quelle, ein Ergebnis der seltsamen Regeln, welche die nat&uuml;rliche Selektion darstellt, und die wenigen, die das Gl&uuml;ck haben, sie zu finden, werden weiterhin f&uuml;r sich und seinesgleichen sorgen k&ouml;nnen. Andere hingegen meinen, eine kosmische Macht habe die Quelle dort platziert und beobachte nun vom Sternenhimmel aus die Resultate seines Experimentes. Oder Streiches, je nach dem, welcher Quelle man Glauben schenken mag. Es gibt auch die Theorie, diese gewaltige Energie ist ein &Uuml;berrest einer noch gewaltigeren Waffe, die von den Vorfahren konstruiert und auch ausgiebig genutzt wurde, heute funktioniert sie zwar auch noch, wenngleich nicht mit der selben Wirkung wie damals. Dies sind die am breitesten akzeptierten Meinungen, alle anderen klingen f&uuml;r die meisten einfach zu unwahrscheinlich oder unrealistisch und sind deshalb in den Gespr&auml;chen nur selten von Bedeutung.\r\n\r\nAber zur&uuml;ck zum Anfang: Was bewirkt das Aufstiegsritual?\r\n\r\nFha&acute;Re wird die Antwort darauf wohl in den n&auml;chsten Sekunden erhalten.\r\n\r\nTr&auml;ge stieg er die letzten steinernen Stufen hinauf. Das kleine Plateau, das sein Ziel war, war mit einigen, ihm unbekannten Runen versehen. Erstaunlich, nicht ein Sandkorn war zu sehen&hellip; wenn man bedenkt, dass sie mitten in der offenen W&uuml;ste Shurimas standen, eine durchaus respektable Leistung. Oder eine effektive Besch&auml;ftigungstherapie f&uuml;r aufs&auml;ssige Lehrlinge. Entschlossen schritt Fha&acute;Re zur Mitte, die durch einen Kreis markiert war, in welchen er sich nun stellte. Ein tiefer Luftzug, um die Anspannung abzusch&uuml;tteln, doch so wirklich wollte es nicht wirken. Aber man kann es ihm auch nicht ver&uuml;beln, niemand k&ouml;nnte in einer solchen Situation v&ouml;llig gelassen bleiben, daf&uuml;r ist die Einwirkung, die in den n&auml;chsten Momenten auf den K&ouml;rper treffen wird, einfach viel zu gewaltig. Fha&acute;Re spannte stumm seine Muskeln an, zum letzten Mal h&ouml;rte er, wie das Blut durch seinen Kopf floss und dann nickte er. Das Zeichen f&uuml;r die zehn Magier, die sich rund um das Plateau positioniert haben. Es sollte beginnen.\r\n\r\nZehn Lichter erhoben sich um den Kreis herum und sandten ihre Energie in das Plateau. Der &auml;u&szlig;ere Rand begann hellblau aufzuleuchten, pure Energie str&ouml;mte durch die Runen am Boden, immer weiter auf den Mittelpunkt zu. Das Feld hellte sich immer weiter auf, eine Vibration wurde h&ouml;rbar, erst leise, dann immer lauter, bis die magischen Kr&auml;fte den mittleren Ring erreichten. Das war das Zeichen. Auf einmal begann der gesamte Boden zu beben, Sand wirbelte von den umgebenden Fl&auml;chen auf und die uralte Energie erwachte und wurde durch die Magier angewiesen, ihren Dienst zu verrichten. Eine Lichts&auml;ule f&uuml;llte nun den inneren Kreis mit Fha&acute;Re in seiner Mitte aus, es schien direkt vom wolkenverhangenen Himmel zu kommen&hellip; und auf einmal h&auml;mmerte Energie auf Fha&acute;Re ein wie ein &uuml;bersinnlicher Faustschlag. Das tiefe Grollen des Bodens, der nun erzitterte, mischte sich mit den hohen T&ouml;nen der gewaltigen Energiemengen, die Fha&acute;Re&acute;s K&ouml;rper neu formen sollen. Als er versuchte, etwas mit seinen Sinnen zu erfassen, sp&uuml;rte Fha&acute;Re, dass er gar keinen K&ouml;rper mehr hatte, aber er f&uuml;hlte die Energiestr&ouml;me, nein, er war f&uuml;r einen Moment ein Teil von ihnen, bis er f&uuml;hlte, wie die Energie eine Gestalt annahm, in ihrer unb&auml;ndigen Gewalt den Raum kr&uuml;mmte und neu erschuf, eine elegante Form verlieh&hellip; und im n&auml;chsten Moment merkte er, dass er schon l&auml;ngst eben jener K&ouml;rper war, den diese Kr&auml;fte formten.\r\n\r\nF&uuml;r ihn schien dieser Zustand ewig anzuhalten, aber die Magier, in sicherem Abstand um ihn herum, merkten, dass etwas nicht stimmte. Die Umformung dauerte viel zu lange. Und der Strom an Energie wollte nicht nachlassen. Doch auch Fha&acute;Re begann, die Unregelm&auml;&szlig;igkeit wahrzunehmen. Die Energie versuchte gewaltsam, ihn zu strecken, als solle sein K&ouml;rper die Gr&ouml;&szlig;e der Sonne haben, dann im n&auml;chsten Moment versuchte sie, ihn auf so keinen Raum zu pressen, dass Sandk&ouml;rner im Vergleich zu ihm die Gr&ouml;&szlig;e ganzer St&auml;dte h&auml;tte. Manchmal auch beides gleichzeitig. Das letzte bisschen Bewusstsein, dass von Fha&acute;Re noch &uuml;brig blieb, wusste, selbst wenn es sonst nichts &uuml;ber das Ritual wusste, dass das so nicht richtig war.\r\nDie Magier schafften es indes, die alte Quelle der Energie zum Schweigen zu bringen, doch Fha&acute;Re&acute;s K&ouml;rper wandte und zuckte immer noch in den seltsamsten Verrenkungen, versuchend, die Energiemengen zu z&auml;hmen, mit denen er gespeist wurde. Doch es gelang ihm nicht. Das Ritual ist fehlgeschlagen und Fha&acute;Re drohte, von dem, was ihn verbessern sollte, zerrissen zu werden. In ihrer Geistesgegenwart rissen sich die zehn Magier ihre G&uuml;rtel vom Leib, antike Eisenketten, die mit bindender Magie versehen waren, vom Leib, entfernten die Siegel, die ihre Kr&auml;fte zur&uuml;ckhielten und warfen mit all ihrer restlichen Macht die Ketten auf Fha&acute;Re, um ihn zu retten. Die Ketten schlangen sich, begierig wie Fangarme, um den K&ouml;rper und schlossen ihn mitsamt der massiven Energie ein. &bdquo;Baccai.&ldquo;, murmelte ihr Anf&uuml;hrer, nachdem die Beben nachlie&szlig;en, die letzten Vibrationen verschwanden und sich die Staubwolken gelegt haben. Ein Ausgesto&szlig;ener. Dem Gesetz nach durfte nicht mehr den Boden Shurimas ber&uuml;hren.\r\nIm &Uuml;brigen sollte dies das letzte Mal sein, dass ein Baccai vor dem Tod gerettet werden w&uuml;rde. Denn mit den Ketten, die ihre potentiell t&ouml;dlichen Kr&auml;fte zur&uuml;ckhielten, waren die zehn Magier nutzlos, da die Herstellung der Siegel viel Zeit und Aufwand kostete. Und wer wei&szlig;, h&auml;tte Kaiser Hhraan VIII die zehn Magier in seinen Reihen gehabt, w&auml;re die Schlacht bei der murmelnden Oase durchaus anders verlaufen.\r\n\r\nNicht mehr den Boden Shurimas ber&uuml;hren&hellip; Fha&acute;Re kicherte in sich hinein. Er hatte im Moment wohl ganz andere Probleme. Die Ketten hielten die Energie zur&uuml;ck und gaben seinem K&ouml;rper wieder die alten Form, nur waren sie&hellip; fesselnd. Er lag da, wie ein zusammengerollter Teppich auf einem Karren und jeglicher Freiheit beraubt. Man hatte wohl seine Vorstellung, wie die Rettung verlaufen sollte, nicht mitbedacht. Sein gesamter K&ouml;rper wurde durch die Ketten zur&uuml;ckgehalten, keiner seiner Muskeln konnte auch nur einen Millimeter bewegt werden. Nicht gerade der beste Tausch. Aber er wollte diesen Zustand nicht aufrecht erhalten. Stumm begann er, alle seine M&ouml;glichkeiten durchzuprobieren, doch viele hatte er nicht. Er konnte nicht mal auf der Stelle rollen, denn er hatte keine M&ouml;glichkeit, um Schwung zu holen, nur, wenn ein starker Windsto&szlig; vorbeizog, r&uuml;hrte sich ein St&uuml;ck von ihm tr&auml;ge in die entsprechende Richtung. F&uuml;r ihn aber war es nur eine weitere Pr&uuml;fung, auferlegt durch das fehlgeschlagene Ritual. Nun, nicht ganz fehlgeschlagen, wie er feststellte, denn irgendwann mal, als er inne hielt, um seine M&ouml;glichkeiten abzusch&auml;tzen, fiel ihm auf, dass ihm Gef&uuml;hle wie Hunger und Durst nun unbekannt waren. Er war nun eins mit der Zeit und diese stellte ihn auf die Probe. Auf eine harte, wie er feststellen musste, denn viel Zeit hatte er nicht, um seine Fesseln zu &uuml;berwinden, denn bewegungslos, wie er da lag, wurde er allm&auml;hlich vom rauen W&uuml;stensand eingegraben. Und nach nicht ganz 200 Jahren verschwand das letzte Glimmen der letzten Kette im Sandmeer.\r\n\r\nHier k&ouml;nnte man meinen, die tragische Geschichte von Fha&acute;Re sei zu Ende, doch dem ist nicht so. Seine steinerne Entschlossenheit k&auml;mpfte gegen die Umst&auml;nde. Und mit jeder noch so kleinen Bewegung, die irgend m&ouml;glich war, gewann er etwas an Kraft. &Uuml;ber die Zeiten hinweg wurde er immer st&auml;rker und st&auml;rker, bis ihm der erste Erfolg gelang: ihm gelang es, die Kette, die seinen rechten Arm gegen den K&ouml;rper dr&uuml;ckte, zu brechen. Nat&uuml;rlich nur f&uuml;r einen Moment, denn die Magie, mit der die Kette versehen war, f&uuml;gte die Bruchst&uuml;cke sofort wieder zusammen und gew&auml;hrleistete somit den Zweck der Kette. Doch angespornt von diesem Erfolg trainierte Fha&acute;Re immer weiter, lernte, jede seiner Bewegungen perfekt zu kontrollieren, bis er irgendwann wieder die hei&szlig;e Sonne Shurimas erblickte. Er hatte sich wieder ausgegraben. Doch er konnte unm&ouml;glich sagen, wie viel Zeit vergangen war, denn er konnte keiner der umliegenden D&uuml;nen wiedererkennen. Also musste er sich auf die Reise begeben, um mehr zu erfahren. In rekordverd&auml;chtiger Zeit, d.h. innerhalb der n&auml;chsten 6 Jahre, lernte Fha&acute;Re, aufrecht zu stehen, das Gleichgewicht zu halten und mit den vielen kleinen Kr&auml;ften, die seine Bewegungen freisetzten, in Bewegung zu setzten. Indem er wie eine Feder umher h&uuml;pfte. Nicht gerade die schnellste Art der Fortbewegung, aber nach f&uuml;nf Monaten erreichte er das Dorf, in dem er die Nacht vor dem Ritual sein Lager aufgeschlagen hatte, eine Strecke, f&uuml;r die er auf dem Hinweg noch ungef&auml;hr einen halben Tag gebraucht hat. Beziehungsweise er erreichte die trostlosen Ruinen des Dorfes, der viele Sand der W&uuml;ste hat den Lehmmauern sichtlich zugesetzt, vor allem schon, weil keine T&uuml;ren oder Fenster sichtbar waren, das Dorf war metertief im Sand versunken. Und Fha&acute;Re suchte unerbittlich weiter, auch wenn er kein Anzeichen seiner fr&uuml;heren Heimat, dem glorreichen Shurima finden konnte. Und irgendwann verlie&szlig; er die W&uuml;ste. Selbst er wusste: Shurima war nicht mehr.\r\n\r\nEr sprang &uuml;ber gr&uuml;ne Wiesen, &uuml;ber seichte B&auml;cher, in denen mehr Wasser floss, als er es zu Lebzeiten jemals gesehen hatte, er sah zum ersten Mal Schnee und wie er stumm zu Boden fiel. Er &uuml;berwand steinige Berge, die kein Vergleich selbst zu den gr&ouml;&szlig;ten D&uuml;nen waren, &uuml;ber die er fr&uuml;her seine Feinde scheuchte. Doch auf seiner kuriosen Reise belauschte er auch vorbeiziehende Passanten (ihm war gar nicht suspekt, dass er ihre Sprache beherrschte, obwohl er sie nie zuvor geh&ouml;rt hatte&hellip; wohl ein weiterer Effekt des &bdquo;misslungenen&ldquo; Aufstiegs) und schon bald offenbarte sich ein Ziel: Sie erz&auml;hlten sich von einem Ort, an dem gro&szlig;e K&auml;mpfer und sonstige Legenden aus dem gesamten Kontinent sich trafen und ihre Kr&auml;fte ma&szlig;en. Eigentlich nicht weiter von Bedeutung f&uuml;r Fha&acute;Re, doch dann erfuhr er, dass sich einige, mythische Wesen aus Shurima ebenfalls dort aufhielten. Zwei W&auml;chter, die einen erfolgreichen Aufstieg genie&szlig;en konnten (auch wenn die Auswirkungen f&uuml;r einen von ihnen nicht ganz positiv verliefen), eine einfache S&ouml;ldnerin, die aber das Blut einer antiken Heldenfamilien mit sich trug, vor allem aber: ein wiederauferstandener Imperator. Fha&acute;Re&acute;s Ziel war klar: er wusste zwar nicht, welche Ziele dieser neue Imperator verfolgte, er hatte schon viele Herrscher erlebt und nicht alle von ihnen waren dem Volk wohl gesonnen, doch er w&uuml;rde diesen Mann treffen. Und erfahren, ob er auch ihm zu Treue verpflichtet ist.\r\n\r\n&bdquo;Es ist keine Einschr&auml;nkung. Es ist eine Verfeinerung!&ldquo; -Fha&acute;Re-\r\n\r\n**\r\n4. F&auml;higkeiten**\r\n\r\n_\r\nPassiv: Binden und l&ouml;sen_\r\n\r\n10 Ketten binden Fha&acute;Re und seine F&auml;higkeiten k&ouml;nnen sie l&ouml;sen. Jede F&auml;higkeit hat ein bestimmtes Maximum an Aufladungen, jede Verwendung einer Aufladung einer F&auml;higkeit sprengt eine Kette und verbraucht sie. F&uuml;r jede gesprengte Kette erh&auml;lt Fha&acute;Re [7% seiner AD] (stackt nicht mit sich selber), 5/6/7/8 Movespeed (mit Level 1/5/9/13) und 2% R&uuml;stungsdurchdringung.\r\nAlle 2 Sekunden wird eine Kette wieder zusammengef&uuml;gt.\r\n\r\n&Uuml;berdies hat Fha&acute;Re eine eigene CDR-Verwertung: Nur 50% der CDR senken den tats&auml;chlichen Cooldown der F&auml;higkeit, die anderen 50% der CDR erh&ouml;hen die Dauer seiner F&auml;higkeiten. (Beispiel: 10% CDR senken den Cooldown der F&auml;higkeiten nur um 5%, erh&ouml;hen aber daf&uuml;r auch die Dauer der F&auml;higkeiten um 5%)\r\n\r\n_\r\nQ: Vereinigung_\r\n\r\nManakosten: 70 Mana (auf allen R&auml;ngen)\r\nCooldown: 5 Sekunden pro Aufladung, maximal 4 Aufladungen\r\n\r\nFha&acute;Re springt eine kleine Distanz in Zielrichtung, welche [Anzahl der nicht zerbrochenen Ketten] x 50 Einheiten entspricht und dabei allen getroffenen Gegnern 50/85/120/155/190 (+0,6 Bonus-AD) physischen Schaden zuf&uuml;gt.\r\nTrifft er dabei auf ein Kettengef&uuml;ge, entmaterialisiert er sich, wird unangreifbar (aber nicht unverwundbar!) und taucht in die Kette ein. Innerhalb der n&auml;chsten f&uuml;nf Sekunden kann er die verbleibenden Aufladungen nutzen, um zwischen den einzelnen **Knotenpunkten** zu reisen, jeder Treffer mit einem **Knotenpunkt** verursacht 60/90/120/150/180 (+0,5 AP) magischen Schaden. Sind alle Aufladungen verbraucht oder ist die Dauer &uuml;berschritten, materialisiert er sich neben dem n&auml;chsten **Knotenpunkt** wieder.\r\nTrifft er w&auml;hrend dem Sprung auf kein Kettengef&uuml;ge, gehen die restlichen Aufladungen verloren.\r\n\r\n_\r\nW: Kettenreaktion_\r\n\r\nManakosten: 60/70/80/90/100 Mana\r\nCooldown: 5/4,5/4/3,5/3 Sekunden pro Aufladung, maximal 6 Aufladungen\r\nReichweite: 600 Einheiten\r\n\r\n_Erste Aktivierung:_ Fha&acute;Re sprengt eine seiner Ketten, um sie dem Ziel anzulegen und sie damit zu einem **Knotenpunkt** zu machen. Innerhalb der n&auml;chsten 3 Sekunden kann er die F&auml;higkeit ohne Kosten reaktivieren.\r\n_Zweite Aktivierung auf das selbe Ziel:_ Alle verbleibenden Aufladungen werden verbraucht, um der selben Anzahl an umstehenden Feinden (innerhalb von 400 Einheiten) automatisch ebenfalls Ketten anzulegen (Champions werden bevorzugt), sie damit auch zu **Knotenpunkten** zu machen und damit ein Kettengef&uuml;ge zu erstellen.\r\n_Zweite Aktivierung auf ein neues Ziel:_ Fha&acute;Re legt dem neuen Ziel eine Kette an, dieses wird auch zu einem **Knotenpunkt**, ein Kettengef&uuml;ge entsteht und Fha&acute;Re kann innerhalb der n&auml;chsten 6 Sekunden neuen Zielen weiterhin Ketten anlegen, die sich jeweils mit dem &bdquo;neuesten&ldquo; **Knotenpunkt** verbinden, zum bisherigen Kettengef&uuml;ge hinzuf&uuml;gen und die Ziele ebenfalls zu **Knotenpunkten** machen.\r\n\r\nKettengef&uuml;ge: Wann immer ein **Knotenpunkt** Schaden aus egal welcher Quelle erleidet, wird dieser um 10% pro **Knotenpunkt** im gesamten Kettengef&uuml;ge reduziert, daf&uuml;r wird dieser abgezogene Teil gleichm&auml;&szlig;ig als absoluter Schaden auf alle angrenzenden **Knotenpunkte** verteilt. \r\nDie Ketten verschwinden nach 6 Sekunden automatisch oder rei&szlig;en, wenn sie zu lange gespannt werden.\r\nEine Kette gilt als gespannt, wenn zwei miteinander verbundene **Knotenpunkte** mehr als 400 Einheiten voneinander entfernt sind. Dabei wenden sie Kraft auf, &uuml;bersteigt der Kraftwert den der Kette, welcher bei 150 liegt, rei&szlig;t sie; Kraft=Movespeed des **Knotenpunkts**/Sekunde, die Kraft beider Knotenpunkte wird aufaddiert. **Knotenpunkte** von gespannten Ketten sind um 80% verlangsamt.\r\n\r\nDiese zweite Aktivierung der F&auml;higkeit kann auch aktiviert werden, wenn Fha&acute;Re sich mithilfe von _Vereinigung_ im Kettengef&uuml;ge befindet.\r\n\r\nIch wei&szlig;, das ist etwas kompliziert, deshalb hier ein paar Bilder zur besseren Verst&auml;ndnis:\r\nhttps://imgur.com/OHngLTB\r\nhttps://imgur.com/oITNJu2\r\n\r\n_\r\nE: Zweck einer Kette_\r\n\r\nManakosten: 90/85/80/75/70 Mana\r\nCooldown: 22/20,5/19/17,5/16 Sekunden, maximal 2 Aufladungen\r\nReichweite: 750 Einheiten\r\nZauberzeit: 0,25 Sekunden\r\n\r\nFha&acute;Re sprengt eine Kette und wirft sie in einer geraden Linie in Zielrichtung, was 65/95/135/175/215 (+0,4 AD) physischen Schaden verursacht. Trifft die Kette auf eine Einheit, welche sich innerhalb von 350 Einheiten zu einer Wand befindet, schlingt sich die Kette zur Wand, macht das Ziel zu einem **Knotenpunkt** (sofern es noch keins ist) und klinkt sich an der Wand ein, wodurch an diesem Punkt ebenfalls ein **Knotenpunkt** entsteht und ein Kettengef&uuml;ge bildet sich oder es wird dem bisher schon existierenden Kettengef&uuml;ge hinzugef&uuml;gt.\r\nDie Kette, die den **Knotenpunkt** mit dem an der Wand verbindet, hat einen Kraftwert von 100.\r\nDer **Knotenpunkt** an der Wand kann nicht angegriffen werden und z&auml;hlt nicht in die Schadensneuverteilung von _Kettenreaktion_.\r\n\r\n_\r\nR: Kettenbruch_\r\n\r\nManakosten: 150/125/100 Mana\r\nCooldown: 150/125/100 Sekunden\r\nZauberzeit: 0,2 Sekunden\r\n\r\nInnerhalb der n&auml;chsten 4/6/8 Sekunden k&ouml;nnen keine Ketten gesprengt oder neu geformt werden.\r\n\r\n**\r\n5. Texte**\r\n\r\nEins vornweg: Die Klangfarbe seiner Stimme skaliert mit der Anzahl an gesprengten Ketten. Sind keine gesprengt, klingt seine Stimme etwas ged&auml;mpft, aber mit jeder gesprengten Kette kommt mehr Farbe in die Stimme rein und mit der Zeit schaltet sich ein epischer Hall dazu, sodass er bei maximal gesprengten Ketten fast wie ein Gott klingt.\r\n\r\nWenn ausgew&auml;hlt: &bdquo;Ich folge dem langen Weg, dem sich die Kette anschmiegt!&ldquo;\r\n\r\nWenn gebannt: &bdquo;Zum Zerrei&szlig;en gespannt!&ldquo;\r\n\r\nMove-Command:\r\n\r\n* &bdquo;Man f&uuml;hlt den Boden&hellip; trotz der Einschr&auml;nkung!&ldquo;\r\n* &bdquo;Sie missverstehen es h&auml;ufig als ein Symbol der Schw&auml;che&hellip;&ldquo;\r\n* &bdquo;Schritt halten mit dem Fluss der Zeit!&ldquo;\r\n* &bdquo;All das hier wirkt so fremd...&ldquo;\r\n* &bdquo;Nun, sie haben sich definitiv ge&auml;ndert. Ob nun zum besseren&hellip;?&ldquo;\r\n* &bdquo;Es wurde schon das Richtige getan damals...&ldquo;\r\n* &bdquo;Erst, wenn man beschr&auml;nkt ist, lernt man sein wahres Potential kennen!&ldquo;\r\n\r\nAttack-Command:\r\n\r\n* &bdquo;Ein weiterer, namenloser Feind...&ldquo;\r\n* &bdquo;Wahrlich&hellip; Krieg &auml;ndert sich nie...&ldquo;\r\n* &bdquo;Ich halte mich nur zur&uuml;ck, weil ich nicht anders kann!&ldquo;\r\n* &bdquo;Wenn ich nur die Kr&auml;fte von damals h&auml;tte...&ldquo;\r\n* &bdquo;Shurimas Glanz ist selbst nach all den Jahren unbefleckt!&ldquo;\r\n* &bdquo;Wer hat hier schon das Sagen...&ldquo;\r\n\r\nJoke:\r\n\r\n* &bdquo;Naaaaa&hellip; stehst du darauf?&ldquo;\r\n* &bdquo;Ich hab mich schon daran gew&ouml;hnt, aber du darfst gerne fester zupacken!&ldquo;\r\n\r\nTaunt:\r\n\r\n* &bdquo;Was mich nicht t&ouml;tet, h&auml;rtet mich ab. Und mal zum Vergleich: Diese Ketten hier sind verdammt weich!&ldquo;\r\n* &bdquo;Wieso denken alle, dass Fesseln nur zur&uuml;ckhalten?&ldquo;\r\n\r\nGegen {{champion:75}} :\r\n\r\n* &bdquo;Sieh an&hellip; und gleich werdet ihr mir noch erz&auml;hlen, ihr seid aus Spa&szlig; hier?&ldquo;\r\n* &bdquo;Wir werden euch euren Dienst &uuml;ber alle Zeiten hinweg anrechnen. Nun, da das gekl&auml;rt ist...&ldquo;\r\n\r\nGegen {{champion:58}} :\r\n\r\n* &bdquo;Ihr seid eine neue Generation&hellip; und scheinbar ist doch nicht alles besser geworden!&ldquo;\r\n* &bdquo;Ihr missbraucht nicht nur den Hass der anderen, sondern auch euren!&ldquo;\r\n\r\nGegen {{champion:15}} :\r\n\r\n* &bdquo;Sek&hellip; nein, ihr seid nicht Sekata. Und doch...&ldquo;\r\n* &bdquo;Ziemlich mutig, diese Reliquie einfach so mit sich herumzutragen!&ldquo;\r\n\r\nGegen {{champion:69}} :\r\n\r\n* &bdquo;Und. Seid ihr gl&uuml;cklich mit dem, was eure Habgier aus euch gemacht hat?&ldquo;\r\n* &bdquo;T&ouml;richt, zu vermuten, wir w&uuml;rden unsere Sch&auml;tze ganz den W&auml;chtern anvertrauen...&ldquo;\r\n\r\nGegen{{champion:268}} :\r\n\r\n* &bdquo;Wartet&hellip; seid ihr der neue K&ouml;nig? Sagt mir, wie steht es um unser altes Reich?&ldquo;\r\n* &bdquo;Versucht erst gar nicht, mich zu t&auml;uschen! Also&hellip; was ist geschehen?&ldquo;\r\n\r\nWenn {{item:3071}}  gekauft:\r\n\r\n* &bdquo;Jeder Schnitt.. ein Glied rei&szlig;t...&ldquo;\r\n* &bdquo;Ich sehe immer das praktische an einem Werkzeug!&ldquo;\r\n\r\nWenn {{item:3053}}  gekauft:\r\n\r\n* &bdquo;Diese Faust&hellip; wie ein Mahnmal!&ldquo;\r\n* &bdquo;Ach ja, der alte Sterak&hellip; unbeugsam wie immer&hellip; was w&uuml;rde er wohl dazu sagen?&ldquo;\r\n\r\nWenn {{item:3142}}  gekauft:\r\n\r\n* &bdquo;Auch der W&uuml;stenwind bl&auml;st unbarmherzig...&ldquo;\r\n* &bdquo;Bricht Feinde die wie br&ouml;ckeligen Mauern der Grenzposten...&ldquo;\r\n\r\nWenn {{item:3742}}  gekauft:\r\n\r\n* &bdquo;Schulter an Schulter&hellip; genau wie damals...&ldquo;\r\n* &bdquo;Austeilen und Einstecken&hellip; das Gleichgewicht der Schlacht!&ldquo;\r\n\r\nWenn {{item:3156}}  gekauft:\r\n\r\n* &bdquo;Man wei&szlig; nie, welche Tricks sie nach dieser Zeit gelernt haben!&ldquo;\r\n* &bdquo;Du wirst deinem Meister sicherlich gut gedient haben!&ldquo;\r\n\r\nWenn {{item:3194}}  gekauft:\r\n\r\n* &bdquo;Der selbe Trick wird nie zwei Mal funktionieren!&ldquo;\r\n* &bdquo;Als w&uuml;rde ich das noch brauchen, nachdem ich wei&szlig;, was sie k&ouml;nnen...&ldquo;\r\n\r\nWenn {{item:3026}}  gekauft:\r\n\r\n* &bdquo;Eigentlich habe ich meine zweite Chance schon bekommen!&ldquo;\r\n* &bdquo;Engel&hellip; aus welcher Art Kultur kommt dieser Glaube?&ldquo;\r\n\r\n**\r\n6. Wie spiele ich ihn?**\r\n\r\nSo wirklich wird Fha&acute;Re erst in Teamfights brillieren, aber auch bei einfachen Ganks kann er dennoch eine gute Figur machen. Sucht euch zun&auml;chst euer Hauptziel f&uuml;r _Kettenreaktion_ aus, anschlie&szlig;end fixiert ihr es schon mal mit _Zweck einer Kette_. Wenn jetzt schon viel Schaden droht, verschwindet ihr schon mal mit _Vereinigung_ und bastelt dann am Kettengef&uuml;ge weiter oder bleibt noch f&uuml;r eine Weile und habt dann eine bessere Mobilit&auml;t mit _Vereinigung_. Sobald das Kettengef&uuml;ge steht, k&ouml;nnt ihr es bei Bedarf nochmal mit _Zweck einer Kette_ fixieren, um sie nicht gleich ausrei&szlig;en zu lassen und genau jetzt, wenn alle Ketten gesprengt sind und ihr die maximalen Boni aus _Binden und l&ouml;sen_ nutzen k&ouml;nnt, ist der Moment gekommen, um euren Damage-Steroid mit _Kettenbruch_ auszul&ouml;sen. Bedenkt nur, dass eure F&auml;higkeiten w&auml;hrend dieser Zeit nicht eingesetzt werden k&ouml;nnen!\r\nKleiner Tipp noch: wenn ihr Minions/Monster ins Kettengef&uuml;ge mit einbaut, k&ouml;nnt ihr sie smiten und den doch recht hohen Schaden auf andere verteilen!\r\n\r\nBeispiel-Build f&uuml;r Jungle-Fha&acute;Re:{{item:3111}} {{item:3071}} {{item:3053}} {{item:3742}}  {{item:3748}} {{item:3065}} \r\n\r\n_\r\nStandard-Incaedeus-Disclaimer Nr. 25: Alle Zahlen sind wie immer nur grobe Angaben von mir. Die Diskussion ist hiermit freigegeben._\r\n\r\nUnd das ist auch das Zeichen daf&uuml;r, dass wir wieder fertig sind f&uuml;r heute! Nun interessiert mich nat&uuml;rlich, was ihr dar&uuml;ber denkt, haut mal eure Meinung in die Kommentare, ihr glaubt nicht, wie hilfreich das manchmal es sein kann! Damit war&acute;s das auch schon und oh Junge, ich freu mich schon auf das n&auml;chste Konzept, das wird wieder mal der Hammer!\r\n...Was f&uuml;r eins das sein wird? Ach komm, ich wei&szlig; doch, dass ihr auch gespannt seid, deswegen bin ich mal nicht so und teaser schon mal ein Kernfeature an: Geschosse. Eine ganze, verdammt riesige Menge an Geschossen.\r\n\r\nNa, was wird das wohl werden? Werdet ihr bald herausfinden! Also, ich hoffe, ich sehe euch alle dort wieder! Bis zum n&auml;chsten Mal!\r\n\r\nMfG\r\n\r\nIncaedeus\r\n{{sticker:galio-happy}} \r\n_Leidenschaftlicher Galio-Main_","replies":[{"poster":"Doenerlord","date":"2018-08-30T23:06:51.377+0000","up_votes":2,"down_votes":0,"body":"Alsoooo...\n\nZunächst ist mir der Name aufgefallen.\n\"Fha'Re\"? Klingt das nicht total nach nem Leeren-Monster?\nWarum müssen Wesen mit komischen Körpern immer ein Apostroph im Namen haben? Können die nicht einfach mal \"Heinz\" oder \"Dieter\" heißen?\n\nDas Aussehen finde ich irgendwie unpassend. Ein abgerundeter Zylinder mit Ketten drum? Quasi eine rumhüpfende Patrone?\nKetten sind cool, keine Frage, aber können Heinz und Dieter nicht auch Ketten benutzen? Wenn ich mir vorstelle, wie das Artwork aussehen könnte, muss ich irgendwie die ganze Zeit lachen.\n\nDie Statuswerte sind soweit okay. Ich denke mal, wenn man sich da ein bisschen an existierende Champions hält, kann man nicht viel falsch machen. Nur der Angriffsschaden könnte etwas hoch werden, wenn du dauerhaft mit nur einer oder zwei Ketten rumrennst.\n\nDie Hintergrundgeschichte verstehe ich ehrlich gesagt nicht so richtig.\nErstmal soll irgendein Typ, der nicht näher beschrieben wird (Schuhputzer, König, Wursthändler?) das Aufstiegsritual begehen... Okay da hätte ich mir vielleicht etwas Hintergrund gewünscht, aber soweit komme ich noch mit.\nDann geht das irgendwie schief und die Magier benutzen ihre magischen Gürtel, die eigentlich Ketten sind, um Fha'Re vorm Zerbersten zu retten...\nUnd dann ist irgendwas mit einem Ausgestoßenen?\n\nAlso diese Stelle musst du mir nochmal erklären (die Grammatikfehler machen's nicht einfacher):\n\n> „Baccai.“, murmelte ihr Anführer, nachdem die Beben nachließen, die letzten Vibrationen verschwanden und sich die Staubwolken gelegt haben. Ein Ausgestoßener. Dem Gesetz nach durfte nicht mehr den Boden Shurimas berühren.\n\nAlso irgendwie ist er jetzt ein Ausgestoßener und wird auf einmal von Sand bedeckt...\nDann braucht er Ewigkeiten um sich zu befreien (Ingame geht das doch auch so einfach?) und geht einfach mal in die Kluft, weil er nichts besseres zu tun hat, richtig?\n\nÜberzeugt mich nicht so wirklich...\n\nDas Skillset sieht nach einer coolen Idee aus, hat aber ein paar große Probleme.\nDen Bonusschaden der passiven finde ich schon etwas viel (wie auch das Bewegungstempo), wenn man bedenkt, dass die W-Fähigkeit 6 mal kostenlos reaktiviert werden kann.\nDas ist dann doch jedes mal eine Kette weniger, oder nicht?\n\nDie Q gefällt mir, aber fünf (5! - in Worten: FÜNF) Sekunden Unanvisierbarkeit...\nDa wird selbst Fizz blass.\n\nW...\nSehr schwierig einzuschätzen. Vermutlich sehr stark (10% True Damage @.@) und definitiv zu oft reaktivierbar... Ich meine 6 Ketten weg mit einer Fähigkeit?\n\nMit der E-Fähigkeit kann ich mich gar nicht anfreunden.. Im Grunde ist sie nur eine billige Version der W, mit der man auch Wände instrumentalisieren kann... Da hätte ich mir mehr gewünscht.\n\nUnd die Ulti... Hmm\nVerhindert die auch, dass man Fähigkeiten einsetzt? Schließlich löst man damit Ketten, nicht wahr?\n\nDie ganzen Quotes finde ich ebenfalls schwierig zu beurteilen, da man wenig über den Champion weiß, außer, dass er halt irgendwas mit Ketten macht und sein Aufstieg missglückt ist. Die Zitate klingen so, als wäre da auch nicht wirklich mehr.\nHier und da ein paar Anspielungen auf Shurima ändern da auch nichts dran.\n\nIm Endeffekt fehlt mir bei dem ganzen Konzept ein bisschen Inhalt.\nTrotzdem ist vor allem das Spielkonzept sehr interessant und könnte mir echt Spaß machen.\n\nGruß,\nDoenerlord","replies":[{"poster":"Doenerlord","date":"2018-08-30T23:09:57.572+0000","up_votes":1,"down_votes":0,"body":"Verurteilt mich bitte nicht wegen Formatierung und Rechtschreibung... Ich schreibe aktuell mit dem Handy.\n\nGruß,\nDoenerlord","replies":[{"poster":"INoKami","date":"2018-09-01T14:11:07.711+0000","up_votes":1,"down_votes":0,"body":"Hätte mich auch überrascht, wenn das hier alle cool finden würden. Also, dann wollen wir mal:\n\n> die Grammatikfehler machen's nicht einfacher\n\n>Verurteilt mich bitte nicht wegen Formatierung und Rechtschreibung\n\nVerzeih mir, aber es entbehrt nicht einer gewissen Ironie :) Oder Doppelmoral, such es dir aus. (Wobei ich sogar hinzufügen muss, dass ich im Moment keine Rechtschreibfehler erkennen kann! Und das mit meinem Wissenstand.)\nDie Geschichte über Grammatik haben wir schon wo anders ausdiskutiert und ich glaube, es hat keinen Zweck, das hier wieder auszugraben. Der Text wurde nach meinem Wissen und Gewissen erstellt und dazu stehe ich.\n\nZum Namen... mein Gott, bei so Kleinigkeiten fängt es schon an. Ja, vielleicht hat er ein bisschen was leeren-haftes, aber wie will man sonst einen spannenden Namen kreieren für einen Typen, der ein paar zehntausend Jahre alt ist? Da muss man etwas tiefer in die Trickkiste greifen. Ich verweise hier auf \"Harald\". Den habe ich mir ungelogen nicht mal angeschaut, alleine schon der Name hat mich gefinisht.\n\nUnd ja, dass Aussehen soll auch etwas absurd sein. Musste es irgendwie mit der Lore in Einklang bringen und hatte dann eben die Idee, dass er zunächst eher drollig aussieht, aber wenn man mal unter die Hülle schaut...\n\nWarst du nicht eigentlich der Lore-Experte von uns beiden? Weil ein Baccai (taucht sogar hin und wieder als einer der Fakten im Loading-Screen auf) jemand ist, der ein fehlgeschlagenes Aufstiegsritual überlebt hat.\nUnd der restliche Kram... ist halt nicht alles schon von Riot definiert, da muss man eben selber die Lücken ausfüllen und kreativ werden.\nIch glaube außerdem, dass es mittlerweile etwas etabliert ist, dass ich die Riot-Lore nicht immer zu 100% befolge, sondern gerne mal hier und da meine eigenen Sachen einbaue.\n\nZu den Fähigkeiten:\n\n* Ja, das ist jedes Mal eine Kette weniger. Irgendwie muss ja auch seine Passive aktiviert werden, sonst wird man es ja nie schaffen, alle 10 Ketten zu sprengen, weil ja alle 2 Sekunden wieder ein hinzukommt.\n* Fizz mag blass werden, Tahm kichert. Zwar nur 4 Sekunden, aber mit Bonus-Movespeed, falls es ein Verbündeter ist. Aber ja, wir können über die Dauer reden.\n* Wo sind 10% True-Dmg ein Problem? Gehen wir mal von 2 zusammen angeketteten Typen  aus. Typ A bekommt einen Schuss ab, der normalerweise 200 Schaden machen würde, durch die Kette bekommt er nur 180 Schaden und Typ B 20 Schaden. Ich weiß ehrlich gesagt nicht, wo das ein Problem sein soll...\n* Die E ist in dem Sinne interessant, da es unkoordinierten Teams doch recht schwer fallen wird, die Ketten zu sprengen, und diese Fähigkeit ermöglicht es, die Mobilität in eine Richtung weiter einzuschränken und außerdem gibt sie dir noch etwas Mobilität für die Q.\n* Ja, die Ult verhindert auch den Einsatz deiner Fähigkeiten. Da musst du eben aufpassen, wann du sie einsetzt.\n* Die Quotes… nach mehreren zehntausend Jahren in Sand eingegraben hat man meiner Meinung nach mit dem meisten abgeschlossen und dann ist man wahrscheinlich auch etwas mit den Nerven durch. Ja, er sollte ein seltsamer Charakter sein.\n\nAber trotzdem danke für die Mühen!","replies":[{"poster":"Doenerlord","date":"2018-09-01T14:51:33.586+0000","up_votes":2,"down_votes":0,"body":"Heyo,\n\nalso erstmal sind Grammatikfehler nicht das gleiche wie Rechtschreibfehler.\nIch achte zwar auch wenn ich mit dem Handy tippe darauf, dass ich nicht völligen Dünnschiss produziere, allerdings kommt es dabei doch häufiger mal zu Tippfehlern.\n\nUnd die Fehler deinerseits, die mir das Leben schwer machen... Neben den Zeitfehlern stört mich vor allem das:\n\n> Dem Gesetz nach durfte nicht mehr den Boden Shurimas berühren.\n\nAlso entweder fehlt da ein Wort (oder gleich mehrere) oder ich bin der deutschen Sprache nicht mächtig.\nGerade, weil an der Stelle aus einem (aus welchem Grund auch immer) zum Aufstieg Auserwählten plötzlich ein Ausgestoßener wird, der dann mit Sand bedeckt wird, ohne dass irgendwie erklärt wird, warum der Altar, welcher doch zuvor so penibel sauber gehalten wurde, plötzlich dem Sand überlassen wird, oder warum Fha'Re auf einmal ganz wo anders rumliegt.\n\nUnd auch, wenn man \"nach mehreren zehntausend Jahren in Sand eingegraben\" vielleicht \"mit dem meisten abgeschlossen\" haben könnte, muss das ja nicht zwangsläufig heißen, dass man von vorne bis hinten ein recht flacher Charakter ist (ohne Vergangenheit und ohne Ziel).\n\nIch hoffe mal, dass du in der Lage bist die konstruktive Kritik, die ich dir zuteil werden lasse, als solche zu verstehen und nicht als Beleidigung aufzufassen.\n\nGruß,\nDoenerlord","replies":[{"poster":"INoKami","date":"2018-09-01T15:13:27.061+0000","up_votes":1,"down_votes":0,"body":"> Ich hoffe mal, dass du in der Lage bist die konstruktive Kritik, die ich dir zuteil werden lasse, als solche zu verstehen und nicht als Beleidigung aufzufassen.\n\nYaaaaaay, jetzt hab ich wirklich jeden von euch in der Gruppe ein Mal zum tilten gebracht :D\n\nZu der zitierten Textzeile: Ja, da fehlt tatsächlich ein Wort.\nIch glaube, ich hätte echt wieder den Disclaimer schreiben sollen, wie ich es schon mal in der Gruppe getan habe...\nNur, wenn ich sage \"nach meinem Wissen und Gewissen\", muss das **NICHT!!!** heißen, dass ich perfekt bin. Manchmal frage ich mich echt, warum so viele Leute trotzdem das denken.\n\nUnd die Fragen zur Lore: Ich könnte natürlich alles erklären, wieso der Altar verlassen wird oder so, aber das bringt meiner Meinung nach die eigentliche Lore nicht weiter und war deshalb für mich irrelevant. Alleine schon, weil das alles dann nichts mehr mit Fha´Re zu tun hat bzw. ich nicht wollte, dass es etwas mit ihm zu tun hat.\nDas hat ein bisschen was von... nehmen wir mal an, ich würde einen Bericht über den Angriff der Alliierten in der Normandie schreiben. Nach meiner Auslegung würdest du dann auch verlangen, dass ich die gesamte Geschichte der Normandie, beginnend ein paar hundert Jahre v. chr. bis heute in aller Ausführlichkeit mit allen relevanten Orten und Personen aufliste, die jemals etwas mit dem Ort zu tun hatten. Verstehst du? Kann ich zwar machen, bringt aber meinen Bericht nicht voran, weil 99,9% der Erzählung keinerlei Bezug zu meinem eigentlichen Bericht hätte. Mal als etwas übertriebenes Beispiel.\n\nAber mich würde mal tatsächlich interessieren, was für dich \"Zeitfehler\" sind, weil mir gerade da nicht wirklich etwas zu einfallen würde. Wenn es dir nicht zu viel Mühe bereitet, kannst du mir mal ein paar nennen? Bitte?\n{{sticker:zombie-nunu-tears}} \n\nUnd glaub mir, wenn ich das hier als Beleidigung sehen würde, dann würde ich **wesentlich** anders reagieren. Glaub mir.","replies":[{"poster":"Doenerlord","date":"2018-09-01T16:25:24.029+0000","up_votes":2,"down_votes":0,"body":"Eigentlich hat dein Erzählstil mehr was von \n\"Und nach dem zweiten Weltkrieg kam dann die Wiedervereinigung\"...\nNimm's mir nicht übel, aber ich kann der Geschichte an der Stelle einfach nicht folgen.\n\nWenn du magst, kann ich dir hier gerne mal ein paar der Zeitfehler auflisten:\n\n> ... denn die wenigen, denen diese Ehre zuteil wurde, hielten sich sehr zurück, wenn es um ihre… Aufwertung ging\n\nDu schreibst diesen Absatz im Präsens, darum müsste es\n\n> ... denn die wenigen, denen diese Ehre zuteil wurde, halten sich sehr zurück, wenn es um ihre \"Aufwertung\" geht.\n\nheißen.\n\n---\n\n> ... dann nickte er. Das Zeichen für die zehn Magier, die sich rund um das Plateau positioniert haben.\n\nDa die Magier sich ja wohl vorher schon dort positioniert haben, ist hier Plusquamperfekt angesagt, Perfekt schonmal garnicht.\n\n> ... dann nichte er. Das Das Zeichen für die zehn Magier, die sich rund um das Plateau positioniert hatten.\n\n---\n\n> Das tiefe Grollen des Bodens, der nun erzitterte, mischte sich mit den hohen Tönen der gewaltigen Energiemengen, die Fha´Re´s Körper neu formen sollen.\n\nZeitsprünge mitten im Satz sollte man **unbedingt** vermeiden, dementsprechend soll es hier\n\n> Das tiefe Grollen des Bodens, der nun erzitterte, mischte sich mit den hohen Tönen der gewaltigen Energiemengen, die Fha´Re´s Körper neu formen sollten.\n\nheißen\n\n---\n\n> Das Ritual ist fehlgeschlagen und Fha´Re drohte, von dem, was ihn verbessern sollte, zerrissen zu werden.\n\nDas Ritual ist doch nicht jetzt in dem Moment wo du die Geschichte erzählst fehlgeschlagen, oder?\nZeitlich ist es kurz vor dem, was jetzt erzählt wird fehlgeschlagen, deshalb Plusquamperfekt.\n\n> Das Ritual war fehlgeschlagen und Fha´Re drohte, von dem, was ihn hatte verbessern sollen, zerrissen zu werden.\n\n---\n\nNur um mal ein paar aufzulisten.\n\nIch liste dir die anderen Fehler nicht auf, da ich glaube, dass es eher Flüchtigkeitsfehler sind (sowas wie \"hätte\", wo \"hätten\" hin muss u.ä.).\n\nUnd zum Abschluss zu deinem ewigen \n\n> Yaaaaaay, jetzt hab ich wirklich jeden von euch in der Gruppe ein Mal zum tilten gebracht :D\n\nWenn du jede Kritik **IMMER** persönlich auffasst, brauchst du dich nicht zu wundern, wenn mal jemand genervt von dir ist, schließlich nehmen die anderen Menschen deine Kritik doch auch dankend an, oder etwa nicht?\nWenn du dich nicht in der Lage siehst Kritik als solche aufzufassen, solltest du aufhören deine Kreationen zu veröffentlichen und Lob von anderen einzufordern.\n\nGruß,\nDoenerlord","replies":[{"poster":"INoKami","date":"2018-09-01T17:45:52.832+0000","up_votes":1,"down_votes":0,"body":"Achtung, im nachfolgenden wird lediglich meine nicht perfekte Meinung wiedergegeben:\n\n**Fall 1:** Hier sehe ich beide Möglichkeiten als richtig. Denn (nach meiner Vorstellung) sind die Wächter nicht redselig und sie waren es auch nie.\nAber... ich schreibe im Präsens? \"zuteil wurde\" klingt für mich jetzt nicht sehr präsens-haft. Anders ausgedrückt: \"Ihm wurde zuteil\", nach meinem Wissen ist das definitiv... irgendeine Vergangenheitsform, wahrscheinlich Präteritum  (Korrigier mich, wenn ich falsch liege^^).\n\n**Fall 2:** Zunächst würde ich sagen geht auch beides, warum ich aber Perfekt genommen habe: \"sich positioniert hatten\" hat für mich etwas von \"sie HATTEN sich positioniert, aber jetzt nicht mehr\" -> sie taten etwas, aber jetzt nicht mehr. Und sie tun in der Lore definitiv noch etwas (an genau der selben Position), nämlich das Ritual durchführen.\n\n\n**Fall 3:** Das könnte ich noch nachvollziehen.\n...Warum könnte? Keine Ahnung. Also kann.\n\n**Fall 4:** Doch, das Ritual ist genau in diesem Moment fehlgeschlagen, in dem ich es erzählte. In dem Fall ist Erzählzeit = erzählte Zeit.\n\nUnd mal noch zum Abschluss: Ich nehme die Kritik nicht persönlich, insbesondere, weil ich auch nicht erkennen könnte, wo sie direkt an mich und nicht an das Konzept gerichtet wäre. Du schreibst ja auch \"die Grammatikfehler machen es nicht einfacher\" und nicht \"du kannst Grammatik überhaupt nicht du noob!!!\". Mittlerweile habe ich eher das Gefühl, dass ich mich nicht erklären darf, weil das sonst so rüberkommt, weil ich beleidigt bin. Ich mache das nicht weil \"ich habe immer Recht und beweise dir jetzt, warum\", sondern \"das denke ich darüber\", genau dann will ich im besten Fall noch mal eine Rückmeldung von dir, jetzt, wo wir ins Detail gegangen sind, und dann sage ich entweder \"Ok hast Recht\", wir spielen das Spiel weiter (wie in diesem Fall) oder ich werde sarkastisch/frech, weil ich merke, dass mein Gegenüber uneinsichtig ist oder sonst irgendwie ein Problem mit fremden Meinungen hat (definitiv nicht in diesem Fall, außer wir haben seeehr verschiedene Meinungen, was Sarkasmus betrifft). Die Sache ist, was man mir vielleicht wirklich noch ankreiden könnte: Ich bin niemand, der, wenn er Kritik erhält, einfach alles \"unterwürfig\" runterschluckt und \"Ja mein Fehler\" sagt, außer es ist ein wirklich offensichtlicher Fehler (wie z.B. Rechtschreibfehler). Ich frage lieber zwei Mal nach und erkläre auch gerne, warum ich X an Stelle Y gemacht habe und dann basierend auf der Reaktion werde ich wie oben erklärt entscheiden was als nächstes kommt. In diesem Sinne: Danke trotzdem.\n\nIncaedeus","replies":[{"poster":"Doenerlord","date":"2018-09-01T19:07:07.016+0000","up_votes":2,"down_votes":0,"body":"Sieh mal:\n\nWenn du auf jede Kritik antwortest, indem du Dinge, wie \"Alle hassen mich\" oder \"Du bist getiltet\" etc. schreibst, dann erweckst du damit bei dem Verfasser der Kritik den Eindruck, dass du sie persönlich nimmst.\nDas hat nichts mit Sarkasmus und sozialen Umgangsformen zu tun.\n\nDesweiteren scheinst du ein klares \"Nein, so wie du es machst ist es **falsch**\" nicht zu verstehen.\nDurch das beständige Suchen nach Möglichkeiten deine Methode zu rechtfertigen, wirkst du nach außen als seist du beleidigt.\n\nWenn dein Lehrer/Professor/Chef dir sagt, dass du seine Aufgabe falsch bearbeitet hast, widersprichst du ihm dann auch?\nGenau mit sowas machst du dich nämlich nicht unbedingt beliebt.\n\n---\n\nEin Beispiel:\nDer erste Zeitfehler aus meiner Liste.\n\"zuteil wurde\" ist Präteritum. Gut aufgepasst. Aber lies mal, was ich dazu geschrieben habe. Der **Absatz** ist im Präsens geschrieben und Zeitsprünge mitten im Absatz gehen garnicht.\n\n> Die offensichtlichste Antwort wäre: Man erhält [Präsens] grenzenlose Macht. Doch ab hier beginnt [Präsens] schon das Reich der Mythen und Spekulationen, denn die wenigen, denen diese Ehre zuteil wurde [Präteritum wegen zeitlicher Differenz OK] , hielten [Präteritum???] sich sehr zurück, wenn es um ihre… Aufwertung ging [Präteritum???]. Die einen sagen [Präsens], man erhält [Präsens] ebenso grenzenlose Weisheit, ein ewiges Leben, all das eben, was Sterbliche als erstrebenswert ansehen…\n\nVerstehst du, was ich meine?\n\n---\n\nFall 2:\n\n> dann nickte er. Das Zeichen für die zehn Magier, die sich rund um das Plateau positioniert haben.\n\nSie positionierten sich also (laut dir), während er nickt?\nDann muss es\n\n> dann nickte er. Das Zeichen für die zehn Magier, die sich rund um das Plateau positionierten.\n\nheißen.\n\n\"positioniert haben\" ist Perfekt und könnte deshalb nur hier stehen, wenn du \n\n> dann nickt er. Das Zeichen für die zehn Magier, die sich rund um das Plateau positioniert haben (also vorher schon!).\n\nschriebest.\nDu darfst den Perfekt in einer Erzählung im Präteritum nicht verwenden!\nGleichzeitig -> Präteritum\nVorher -> Plusquamperfekt\n\n--\n\nBeim dritten Fall kann ich mir sogar vorstellen, dass du nur einen Buchstaben vergessen hast, also nimm als weiteres Beispiel den vierten Zeitfehler, den ich dir aufgezählt habe.\nDu sagst \"Erzählzeit = erzählte Zeit\"?\n\n> Das Ritual **ist** fehlgeschlagen und Fha´Re **drohte**, von dem, was ihn verbessern **sollte**, zerrissen zu werden.\n\nAlso das Ritual ist jetzt in dieser Sekunde fehlgeschlagen.\nDamals vor 10000 Jahren drohte Fha'Re von dem, was ihn im gleichen Moment verbessern sollte, zerrissen zu werden?\n\nIch hatte eigentlich den Eindruck als hätte das Ritual ihn verbessern sollen. Und als Folge auf dessen Fehlschlag war er bedrohnt.\n\nAlso:\n\n> Das Ritual **war** fehlgeschlagen und Fha'Re **drohte**, von dem, was ihn **hatte verbessern sollen**, zerrissen zu werden.\n\nAber gut, wenn du sagst, alles die selbse Zeit, dann musst du auch für alle drei Prädikate die gleiche Zeitform wählen. Also\n\n> Das Ritual schlug fehl und Fha'Re drohte, von dem, was ihn verbessern sollte, zerrissen zu werden.\n\noder\n\n> Das Ritual **schlägt fehl** und Fha'Re **ist davon bedroht** von dem, was ihn **verbessern soll**, zerrissen zu werden.\n\nWenn etwas fehlgeschlagen **ist**, so ist dies kurz vor der Erzählung im Präsens passiert.\nDies ist die Zeitform Perfekt. Um an deiner ursprünglichen Formulierung festzuhalten, müsste es\n\n> Das Ritual ist fehlgeschlagen und Fha'Re ist davon bedroht von dem, was ihn verbessern sollte, zerrissen zu werden.\n\nheißen.\n\n> Das Ritual **ist** fehlgeschlagen und Fha´Re **drohte**, von dem, was ihn verbessern **sollte**, zerrissen zu werden.\n\nist einfach falsch. Frag ruhig alle Deutschlehrer, die du kennst...\n\n---\n\nUnd glaube mir: Ich habe mir schon nur solche Fehler ausgesucht, die über jeden Zweifel erhaben sind. Ich könnte mit dir wahrscheinlich über jeden dritten Satz diskutieren, aber darum geht es mir nicht.\n\nGruß,\nDoenerlord","replies":[{"poster":"INoKami","date":"2018-09-01T19:34:09.234+0000","up_votes":1,"down_votes":0,"body":"Weißt du, wenn ich mal sarkastisch bin, versuche ich, es immer offensichtlich zu machen. Und gut, manchmal scheitere ich daran, aber manchmal gibt es auch Momente, in denen ich mir denke \"Alter, das ist doch jetzt SO OFFENSICHTLICH nicht ernst gemeint!\" und doch merke ich, dass sie Leute immer noch ernst nehmen. Mir gehen langsam echt die Möglichkeiten aus, weil ich eben gerne kleine Scherze mache, aber ich glaube langsam kann ich das einfach nicht mehr machen, weil mittlerweile die Leute wirklich die offensichtlichsten Scherze todernst nehmen...\n\nZur allgemeinen Überraschung kann ich ein \"Nein so ist es falsch\" sehr gut verstehen, auch in diesem Fall, nur dann beginne ich mich zu fragen, wieso dann 12 Jahre lang mir alle bekannten Deutschlehrer mir etwas falsch beigebracht haben bzw. meine Fehler nicht markiert haben. Ich habe im Unterricht zugehört, ich habe das in den Aufsätzen etc. angewandt und wenn es nicht markiert wird, gehe ich spontan davon aus, dass ich es richtig gemacht habe. Und irgendwann ist es einfach Gewohnheit geworden, da ich ein \"Gefühl\" dafür entwickelt habe. Ich könnte natürlich nochmal versuchen, die mir bekannten Regeln neu zu lernen, aber eben weil ich es schon gewohnt bin, wird es mir wahrscheinlich extrem schwer fallen.\nWenn ich jetzt erst die deutsche Grammatik gelernt und zum ersten Mal angewendet hätte, würde ich sicherlich anders reagieren.\n\nNochmal zum zweiten Fall: Ich versuche, nochmal kurz die Situation zu erklären: Die Magier haben sich um den Kreis (schon vorher) aufgestellt und warten auf das Zeichen (Nicken), mit welchem sie das Ritual beginnen können.\n\nUnd zu Fall 4:\n\n> Also das Ritual ist jetzt in dieser Sekunde fehlgeschlagen.\nDamals vor 10000 Jahren drohte Fha'Re von dem, was ihn im gleichen Moment verbessern sollte, zerrissen zu werden?\n\nExakt.\n\n> Ich hatte eigentlich den Eindruck als hätte das Ritual ihn verbessern sollen. Und als Folge auf dessen Fehlschlag war er bedrohnt.\n\n...Stimmt aber auch. Ich verstehe ehrlich gesagt nicht ganz, wo hier das Problem liegt/was genau dich daran stört. Weil das klingt gerade so, als wäre es für dich ein Widerspruch, was es aber eigentlich nicht ist?","replies":[]}]}]}]}]}]}]}]}]},{"poster":"Lunaá","date":"2018-08-30T15:10:35.906+0000","up_votes":1,"down_votes":0,"body":"Yeah, mal wieder ein neues Konzept von dir ^^\n&ensp;\n---\n##Allgemeines:\n\n* **Idee:**\nKaum dreht man ein sehr bekanntes Prinzip in Lol um, und obwohl es theoretisch das gleiche macht, hört es sich ganz anders an. Genial\n&ensp;\n* **Aussehen:**\nPuh, ich würde es erstmal als \"extrem unpassend\" abtun. Die Ketten geben da schon eher Sinn, aber gerade deswegen finde ich, dass der Champion schweben sollte. Weiterführend würde ich auch kurze blitzartige arkane Energien als Angriffsweise bevorzugen\nDer Bezug zur Lore ergibt das alles zwar schon Sinn, sieht aber sehr abwegig und falsch aus.\n&ensp;\n* **Lore:**\nGanz cool gemacht mit der einführenden Erklärung des Rituals, der Rest lässt sich auch gut lesen und bleibt spannend. Der Zylinder, in dem er jedoch gefangen ist, fehlt in der Lore irgendwie\n&ensp;\n* **Werte:**\nFinde lediglich das Leben ein wenig zu niedrig\n&ensp;\n---\n\n##Fähigkeiten:\n\n* **Passiv: Binden und Lösen**\nKann ich nicht so viel zu sagen, dafür habe ich umso mehr Fragen:\n&ensp;\n_Bekommt er die AD zusätzlich oder startet er mit 30 % und arbeitet sich so auf 100 % hoch?_\n&ensp;\n_Kann man dann theoretisch auf 80 % CDR kommen oder bleibt das Cap bei 40 %?_\n&ensp;\n* **Q: Vereinigung**\nGut soweit, schön auch, das die Steigerungen verloren gehen, wenn man die Fähigkeit zum Entkommen benutzt.\n&ensp;\n_Aber warum macht der zweite Teil plötzlich AP-Schaden?_\n&ensp;\n_Kommt man da auch vorzeitig wieder raus?_\n&ensp;\nDen Platz finde ich auch ungewöhnlich, normalerweise sind Dashes auf der E-Fähigkeit, könnte man also mit der jetzigen E tauschen\n&ensp;\n* **W: Kettenreaktion**\nDie Möglichkeiten hier finde ich gut, auch dass der Schaden verteilt wird, ist toll.\nAber auch hier giebt es wieder einige Fragen:\n&ensp;\n_Bleiben alle weiteren Reaktivierungen kostenlos, wenn man sie in der verfügbaren Zeit ausführt?_\n&ensp;\n_Gelten die 6 Sekunden für das gesamte Kettengebilde oder nur für die jeweilige Verbindung?_\n&ensp;\n_Was passiert, wenn man angefesselt versucht, herauszudashen oder anderweitig die 400 Einheiten zu überwinden?_\n&ensp;\n_Sind die Knotenpunkte von gespannten Ketten auch verlangsamt, wenn sie sich aufeinander zubewegen?_\n&ensp;\n* **E: Zweck einer Kette**\nPassend zum Konzept, aber wie schon gesagt, würde ich mit der Q-Fähigkeit tauschen\n&ensp;\n* **R: Kettenbruch**\nTja, hmm, das kann ich wohl wie du nur so beschreiben\n&ensp;\n* **Allgemeine Anregungen:**\nWenn man Fähigkeiten reaktivieren kann oder Aufladungen besitzt, wäre es toll zu wissen, wie schnell ich diese benutzen kann. Also den Cooldown zwsichen den Aufladungen\n---\n\n##Sonstiges:\n\n* **Texte:**\nStandardsprüche, Champion- und Iteminteraktionen, supi\n&ensp;\n* **Items:**\nHängt davon ab, wie du die oben gestellte Frage zur AD-Steigerung beantwortest. Sollten die AD zusätzlich sein, würde ich auch Assasin bzw Full-AD in Erwägung ziehen.\n&ensp;\n* **Skinideen:**\nHabe ich wohl nicht gefunden ^^\n&ensp;\n---\n\n##Abschließendes:\n\nZiemlich viel CC finde ich, und dann nur 2 Fähigkeiten, die Schaden machen. Für einen Jungler geht das denke ich, aber ich sehe jetzt nicht das Teamfightpotenziel, was du erwähnst. Q kann 4-mal reaktiviert werden, das wars, ab dann muss man ein Olaf-Cosplay hinlegen und hoffen, dass man nicht getötet wird.\nToll finde ich aber, dass das Kettenprinzip so gut umgesetzt wurde. Ich selber habe ein oder zwei Konzepte, die mit ähnlichen Mechaniken arbeiten, sollte ich also irgendwann mal Lust haben, sie ins Forum zu posten, bitte ich um Nachsicht, die Ideen sind dann unabhängig von diesem Konzept entstanden ^^","replies":[{"poster":"INoKami","date":"2018-08-30T19:30:10.724+0000","up_votes":1,"down_votes":0,"body":"Yay, danke schon mal für´s drüber gehen, hier sind paar Antworten in der jeweiligen Reihenfolge:\n\n**Passive:** Nein, er startet bei seinen 100% und kann sich dann auf 170% hocharbeiten (sehe ihn als teamfightlastigen Bruiser). Der Hauptschaden sollte auch durch die AA kommen. Und da nicht anders erwähnt, bleibt das CDR-Cap bei 40%\n\n**Q:** Einerseits, weil ich aus einer Laune heraus entschieden habe, dass nicht unbedingt alles immer den entsprechenden Schaden machen soll (AD-lastige Champs dürfen auch etwas AP-Schaden machen und umgekehrt) und andererseits fiel es mit etwas schwer, sich vorzustellen, wie ein Energieblitz, der zwischen Ketten hin- und herspringt, physischen Schaden machen soll. Magischer Schaden erscheint mir einfach hier viel sinnvoller. Und ja, eigentlich wollte ich noch eine Option einbauen, um frühzeitig rauszukommen, muss ich mal noch dran feilen. Und es liegen längst nicht alle Dashes auf dem E (Siehe Yavne (ist ein Quasi-Dash), Ekko, Kayn, Ali...).\n\n**W:** Jawoll, alle Reaktivierungen sind kostenlos. Und die 6 Sekunden werden für jede Kette separat berechnet, nicht für das gesamte Kettengefüge. Zu der Dash-Thematik: Hab ich nicht wirklich viel darüber nachgedacht, aber so viel kann ich schon sagen, dass das wohl die \"Counter\" zu den Ketten sein werden...\nNein, wenn sich die Knotenpunkte aufeinander zubewegen, sind die Ketten nicht mehr gespannt. Ist doch logisch, oder? xD\n\n**Aufladungen:** Ist nur für Q und W relevant (wegen den Reaktivierungen) und ich würde die niedrig ansetzten, also höchstens 0,5 Sekunden pro.\n\n**Skinideen:** Hatte dieses Mal keine guten, deswegen. Aber beim nächsten hab ich wieder was^^\n\nUnd ich werde dir nicht böse sein, wenn du mal was ähnliches veröffentlichst, vor allem jetzt nach der Ansage,ich freu mich schon drauf, zu sehen, was dein Ansatz ist, aber da haben sich andere schon wesentlich mehr geleistet:\n\n**Ich:** So, jetzt bin ich fertig mit dem Beitrag zum Wettbewerb, jetzt kann ich endlich mal meinen Typ mit den Ketten fertig stellen!~\n**Riot Games:** Hey, hier ein kleiner Teaser für einen neuen Champ, der irgendwann mal veröffentlicht werden wird! Aber wir zeigen nur mal zwei dicke Ketten!\n**Ich:** Ernsthaft...?\n\n_*_  _Eine Woche später..._ _*_\n\n**Ich:** So, bald ist das Ding endlich fertig! :D\n**Valve:** Introducing Grimstroke, our new hero for DotA 2!\n**Ich:** Really n_*_ gg _*_ ?!\n \nUnd dann soll mir mal einer erzählen, die würden sich nix von mir abschauen ;)","replies":[]}]}]}