{"poster":"INoKami","date":"2017-07-07T15:52:27.883+0000","title":"[Champion-Konzept] Shikku, das Bruchstück","subforum":"Skin- & Champion-Konzepte","up_votes":3,"down_votes":0,"body":"**[Champion-Konzept] Shikku, das Bruchst&uuml;ck**\n\nHallo, alle zusammen! Es wieder an der Zeit, euer geliebter Incaedeus darf euch wieder mit seinem neuestem Konzept begl&uuml;cken! Heute stelle ich euch Shikku, das Bruchst&uuml;ck vor, welcher jetzt mein&hellip; wie vieltes Konzept ist?\n_Bl&auml;tterrascheln_\nKeine Ahnung, so langsam verliere ich ernsthaft den &Uuml;berblick^^\nWie auch immer, lasst uns anfangen!\n\n**\nInhalt:**\n\n1. Allgemeines\n2. Werte/Schwierigkeit\n3. Lore\n4. F&auml;higkeiten\n5. Texte\n6. Wie spiele ich ihn/sie/es&hellip;?! _&Uuml;berblick of doom xD_\n\n**\n1. Allgemeines:**\n\n**Die Grundidee:** Wie fange ich hier an?\nSagen wir mal so, ich mag es, wenn man ein Tool hat, welches man kontrollieren kann und damit witzige Sachen anstellen kann. Sei es Orianna&acute;s Ball, Shaco&acute;s Klon, Loggrin&acute;s Splitter*&hellip; Hauptsache irgendetwas, was man selber abseits des eigenen Champions steuern kann. Und Shikku soll auch dieser Idee folgen. Nur, dass ich es ein bisschen auf die Spitze getrieben habe...\n\nShikku wird vornehmlich im Jungle gespielt (schon wieder ein Jungler?! Irgendwie hab ich es mit Junglern in der letzten Zeit...(wenn man meine Kindred-Rework-Idee mitz&auml;hlt ist dass das dritte Jungle-Konzept in Folge!)), sein Markenzeichen: seine Kristallkugeln, welche er mit seinen F&auml;higkeiten lenken kann. Aber nicht auf Orianna-Nievau, sondern&hellip; Nun, m&uuml;sste ich Shikku mit einen Begriff umschreiben, so w&auml;re der Begriff&hellip; _Trommelwirbel_\n\nFlipperautomat!\n\nLasst euch einfach &uuml;berraschen! :)\n\n_*Wer ist Loggrin, fragst du dich? Nun, er ist mein zweites Konzept und damit schon ein Oldtimer, wenn man ihn mit meinen anderen Konzepten vergleicht. Darfst du dir trotzdem gerne anschauen!_\n\n**Das Aussehen:** Shikku ist ein langes, schmales Insekt. Er &auml;hnelt einem Zehnf&uuml;&szlig;ler, auch wenn er nur auf acht Beinen l&auml;uft und die vordersten Beine als Klauen verwendet. Sein Panzer schimmert jadefarben, aus seinem Sch&auml;del wachsen zwei lange, diamantfarbene Antennen. Das Ende jedes Fu&szlig;es &auml;ndert seine Farbe von Jade zu einem blassen Rot, die Klauen hingegen wechseln ihre Farbe zu einem Azurblau.\n\n**\n2. Werte/Schwierigkeit**\n\nLeben: 575 (+55/Stufe, 1510 auf Lvl. 18)\nMana: 294 (+34/Stufe, 872 auf Lvl.18)\nHP/5: 8 (+ 0,4/Stufe, 14,8 auf Lvl. 18)\nMP/5: 6 (+1/Stufe, 23 auf Lvl. 18)\nAngriffsschaden: 60 (+1,4/Stufe, 83,8 auf Lvl. 18)\nF&auml;higkeitsst&auml;rke: 0 (+1,3/Stufe, 22,1 auf Lvl. 18)\nR&uuml;stung: 22 (+1,6/Stufe, 49,2 auf Lvl. 18)\nMagieresistenz: 26 (+0,8/Stufe, 39,6 auf Lvl. 18)\nLauftempo: 325\nAngriffsgeschwindigkeit: 0,65 (+0,009/Stufe, 0,803 auf Lvl. 18)\nAngriffsreichweite: 125\n\nAngriff: [1/10]\nMagie: [9/10]\nLeben: [2/10]\nSchwierigkeit: [10/10]\n\n**\n3. Lore**\n\nNur die wenigsten wissen, dass es sie gibt. Die insektenartigen Khhi&acute;Xar aus dem tiefstem S&uuml;den Valorans leben friedlich in ihren H&ouml;hlen, abgeschirmt von dem Treiben der oberen Welt. Es ist ihr Wesen, sich durch die Erde zu graben und nach wertvollen Mineralien zu suchen, welche sie dann in gro&szlig;en Lagerkammern horteten. Die wenigen, welche sich die Freundschaft der Khhi&acute;Xar erarbeiten konnten, berichteten von turmhohen Bergen an wertvollsten Edelsteinen. Sch&auml;tzungen ergaben daraus, dass man, sollte man alle dort gelagerten Edelsteine zu den &uuml;blichen Marktpreisen verkaufen, einen Betrag erhalten w&uuml;rde, mit welchem man sich theoretisch ganz Demacia, mitsamt seines Besitzes und seiner Einwohner kaufen k&ouml;nnte (oder ungef&auml;hr ein Drittel von Ionia, je nach dem, was man mehr pr&auml;feriert). Die Khhi&acute;Xar wussten &uuml;ber den Wert ihres Besitzes, doch waren sie nie an Reichtum, Territorium oder anderen weltlichen Dingen interessiert. Sie lebten einfach ihr zur&uuml;ckgezogenes Leben in den H&uuml;geln, welche sie ihre Heimat nannten.\n\nDoch von Zeit zu Zeit war es Tradition, dass die Khhi&acute;Xar sich &uuml;ber ganz Valoran verstreuen und im ganzen Land nach Edelsteinen suchen. Nicht etwa, um sie zu horten, im Gegenteil, sie gruben alle gefundenen Edelsteine wieder ein, sondern einfach, um die Qualit&auml;t der Steine und damit auch der umliegenden Erde zu &uuml;berpr&uuml;fen. (Hier sei angemerkt, dass &bdquo;Khhi&acute;Xar&ldquo; am besten mit dem Begriff &bdquo;H&uuml;ter des Mutterbodens&ldquo; &uuml;bersetzt wird.)\nShikku bekam den Auftrag, tief im Norden die Kontrolle durchzuf&uuml;hren. Er hatte schon zwei mal bei den Kontrollen mitgeholfen, aber diese waren deutlich n&auml;her an der Heimat, au&szlig;erdem war er mit seinen 9451 Jahren noch vergleichsweise jung. Doch er nahm den Auftrag ohne Widerworte an und begann seine beschwerliche Reist in den Norden. Er traf auf viele sonderbare Dinge, h&auml;ufig auf seltsame, zweibeinige Wesen, welche so hoch wie Shikku lang waren. Sie lebten hinter hohen Mauern in selbst gebauten H&ouml;hlen aus Holz oder Stein. Sie wiederum begegneten ihm h&auml;ufig mit Verwunderung oder Furcht. Mache wagten es sogar, ihn anzugreifen, doch Shikku wusste sich zur Wehr zu setzten. Die Geschichten &uuml;ber ihre Reicht&uuml;mer erz&auml;hlten sich &uuml;ber das gesamte Land und nicht wenige versuchten, sich einen Teil ihres Reichtums abzukn&ouml;pfen, geschafft hatte es noch niemand.\n\nNach vielen Tagen und N&auml;chten des Krabbelns erreichte Shikku das ausgewiesene Gebiet und begann mit der Arbeit. Das Gebiet hatte sich ver&auml;ndert. Die meisten Edelsteine wiesen ungew&ouml;hnliche, magische Schwingungen auf, welche vorher noch nicht hier waren. Ansosnten waren die Steine v&ouml;llig in Ordnung. Da die Schwingungen aber noch relativ unkontrolliert waren, wurde Shikku klar, dass die Quelle der Schwingungen nur wenige Jahre alt sein musste. Unbeirrt dessen fuhr er mit den Grabungen fort, doch nach einigen Tagen ereignete sich etwas sonderbares: Er fand sich in einer Schlucht wieder, welche zun&auml;chst auch normal schien und er begann wie immer mit den Ausgrabungen. Er wusste, dass er sich auf einem antiken Schlachtfeld befand. Geschichten erz&auml;hlten, dass noch vor seiner Zeit hier eine gewaltige Schlacht getobt hatte, aber die Schlacht und ihre Auswirkungen sollten schon l&auml;ngst vergessen sein. Pl&ouml;tzlich sp&uuml;rte er ein gewaltiges Beben. Shikku drehte seinen kleinen Insektenkopf nach rechts&hellip; und sah nur, wie ein gewaltiger Zweibeiner laut br&uuml;llend an ihm vorbeirannte, mit einer Geschwindigkeit, welche er noch nie bei einen Zweibeiner erlebte. Doch es geschahen noch seltsamere Dinge: pl&ouml;tzlich sah er ein Lichtflackern vor sich, er konnte sich noch rechtzeitig wegrollen, als ein gewaltiger Lichtblitz durch die Kluft schoss. Shikku hatte er gerade noch verfehlt, denn Zweibeiner vor ihm erging es nicht so gut: er schien umzukippen und sank schon auf die Knie, als er pl&ouml;tzlich inne hielt und sich mit einem lauten Wutschrei wieder aufrichtete und auf die Quelle des Lichtblitzes zust&uuml;rmte. Welche sich auch als Zweibeiner herausstellte, wenngleich kleiner und d&uuml;nner als der andere. Mit einigen gewaltigen Hieben t&ouml;tete der Br&uuml;llende seinen Artgenossen, welcher sich seltsamerweise in Licht aufl&ouml;ste, dann sank er langsam, aber sicher zusammen und erlag seinen Verletzungen.\n\nNach einigen Tagen wurde Shikku aufgekl&auml;rt. Die Schlachten sind wieder entbrannt. Er befand sich in einem Gebiet, an welchem die st&auml;rksten Zweibeiner des Landes ihre F&auml;higkeiten in einem Wettkampf gegeneinander ma&szlig;en. Shikku h&ouml;rte interessiert den Ausf&uuml;hrungen der Zweibeiner zu, welche ihm die Geschichte dieses Ortes und damit der Quelle der magischen Schwingungen erz&auml;hlten. Nach einer Weile lie&szlig; Shikku die Zweibeiner wissen, dass seine Kontrolle noch nicht beendet sei und er sie auf jeden Fall beenden werde, selbst wenn er daf&uuml;r an diesen Schlachten teilnehmen muss&hellip;\n\n&bdquo;Jeder behandelt den Boden auf seine Weise. Sei g&uuml;tig zu ihm, oder er wird dir nur schaden!&ldquo; -Shikku-\n\n**\n4. F&auml;higkeiten**\n\n_Passiv: Spektralbruch_\n\nShikku&acute;s F&auml;higkeiten verursachen _Spektralschaden_. F&uuml;r dessen Schadensberechnung wird der Mittelwert aus R&uuml;stung und Magieresistenz des Gegners genommen ((R&uuml;stung+Magieresistenz)/2), aus diesem Wert wird dann die Schadensreduktion berechnet.\n_Hier eine Beispielrechnung: Wenn das Ziel 120 R&uuml;stung und 40 Magieresistenz hat, betr&auml;gt der Wert der &quot;Spektralr&uuml;stung&quot; 80, mit diesem Wert wird dann die Reduktion berechnet._\n\n&Uuml;berdies erhalten Shikku&acute;s F&auml;higkeiten Bonusreichweite in H&ouml;he von 100% seiner gesamten AP (au&szlig;er die Ult, die hat ja von sich aus keine).\n\n_\nShikku beschw&ouml;rt mit seinen F&auml;higkeiten Edelsteine, welche f&uuml;r 5 Sekunden bestehen bleiben. Sind zwei Edelsteine innerhalb von 500 Einheiten zueinander beschworen, verbinden sie sich und erschaffen einen von 6 m&ouml;glichen F&auml;higkeiten (Sind weiter unten aufgelistet). Ansonsten verschwinden sie wieder._\n\n_\nQ: Kr&auml;ftiges Graben_\n\nManakosten: 30 Mana (auf allen R&auml;ngen)\nCooldown: 15/12,5/10/7,5/5 Sekunden, kann bis zu 3 Aufladungen speichern\nReichweite: 1000 Einheiten\n\nShikku gr&auml;bt am Zielort einen roten Edelstein aus.\n\n_\nW: Flinkes Graben_\n\nManakosten: 30 Mana (auf allen R&auml;ngen)\nCooldown: 15/12,5/10/7,5/5 Sekunden, kann bis zu 3 Aufladungen speichern\nReichweite: 1000 Einheiten\n\nShikku gr&auml;bt am Zielort einen blauen Edelstein aus.\n\n_\nE: Pr&auml;zises Graben_\n\nManakosten: 30 Mana (auf allen R&auml;ngen)\nCooldown: 15/12,5/10/7,5/5 Sekunden, kann bis zu 3 Aufladungen speichern\nReichweite: 1000 Einheiten\n\nShikku gr&auml;bt am Zielort einen gelben Edelstein aus.\n\n_\nZum besseren Verst&auml;ndnis hier zuerst die Ult, dann kommen die Kombinationen._\n\n_\nR: Pracht der Erde_\n\nManakosten: 50/40/30/20 Mana\nCooldown: 30/25/20/15 Sekunden\nZauberzeit: 0,5 Sekunden\n\nShikku gr&auml;bt eine Kristallkugel aus (Durchmesser: 60 Einheiten), welche sich in seine Blickrichtung fortbewegt und an W&auml;nden oder Kristallformationen abprallt. Sie hat anfangs Shikku&acute;s Laufgeschwindigkeit, welche aber beeinflusst werden kann. Die Kugel verursacht 50/90/130/170 Spektralschaden an allen Gegnern, welche sie durchdringt.\nIst die Kugel schneller als Shikku, verursacht sie um die prozentuale Differenz mehr Schaden (-&gt; ist die Kugel um 20% schneller als Shikku, verursacht sie 20% mehr Schaden).\nIst die Kugel langsamer als Shikku, verlangsamt sie getroffene Gegner um die prozentuale Differenz (-&gt; ist die Kugel um 20% langsamer als Shikku, verlangsamt sie getroffene Gegner um 20%. Die Gegner erhalten dann immer noch 80% Schaden).\nDie Flugbahn der Kugel kann mit den beschworenen Edelsteinen beeinflusst werden, selbiges gilt f&uuml;r die Fluggeschwindigkeit der Kugel.\nDie Kugeln sind unendlich lange haltbar, sie verschwinden nur, wenn sie weiter als 2000 Einheiten von Shikku entfernt sind. Es k&ouml;nnen mehrere Kugeln gleichzeitig aktiv sein.\n_Diese F&auml;higkeit ist bereits auf Stufe 1 verf&uuml;gbar und muss nicht zus&auml;tzlich erlernt werden._\n\nNachdem jetzt das gekl&auml;rt ist, hier sind nun die Kombinationen:\n\n**\nRot+Rot:** Die Edelsteine bilden zwei S&auml;ulen (Durchmesser: 100 Einheiten) an den jeweiligen Punkten, an welchen die Edelsteine beschworen wurden. Prallt die Kugel an eine der S&auml;ulen ab, wird sie um 5% schneller. Wenn sie durch sie beiden S&auml;ulen fliegt, wird sie um 15% verlangsamt. Gegner, die durch die S&auml;ulen laufen, werden f&uuml;r 2 Sekunden um 50% verlangsamt.\n\n**Blau+Blau:** Die Edelsteine bilden ein Feld mit 700 Einheiten Durchmesser. Die Kugel wird, solange sie &uuml;ber das Feld fliegt, f&uuml;r alle 100 zur&uuml;ckgelegten Einheiten um 1% beschleunigt. Shikku erh&auml;lt 40/45/50/55/60% (+1% pro 50 AP) (Stufe Blau) Zaubervampir aus allen Quellen, w&auml;hrend er sich in diesem Feld aufh&auml;lt. Das Feld bleibt 8 Sekunden bestehen.\n\n**Gelb+Gelb:** Die beiden Edelsteine bilden eine geradlinige Wand miteinander. Wenn eine Kristallkugel von ihr abprallt, verursacht ihr n&auml;chster Kontakt mit einem Gegner 120/140/160/180/200% (Stufe Gelb) Schaden. Dieser Effekt kann nur ein Mal alle 3 Sekunden (-1 Sekunde pro 200 AP, kann nicht unter 0 Sekunden fallen) auftreten. Die Wand bleibt f&uuml;r 6 Sekunden bestehen.\n\n**Rot+Blau (=Violett):** Die Edelsteine verschmelzen an ihrem Mittelpunkt zu einer kreisf&ouml;rmigen Kristallformationen. Prallt eine Kristallkugel von ihr ab, wird sie um 5% verlangsamt. Bleibt 2 Sekunden bestehen (+1 Sekunde pro Stufe Rot/Blau, Maximum liegt bei 12 Sekunden).\n\n**Rot+Gelb (=Orange):** Die Edelsteine wachsen nach au&szlig;en, sodass eine v-f&ouml;rmige Wand entsteht, bei welcher aber die untere H&auml;lfte des V fehlt. Die W&auml;nde haben eine L&auml;nge von 400 Einheiten. Prallt die Kugel an den W&auml;nden ab, wird die um 10% verlangsamt, fliegt sie allerdings durch das offene Ende hindurch, wird sie um 25% beschleunigt. Bleibt 4 Sekunden bestehen(+0,5 Sekunde pro Stufe Rot/Gelb, Maximum liegt bei 9 Sekunden).\n\n**Gelb+Blau(=Gr&uuml;n):** Die Edelsteine bilden einen Halbkreis mit Radius 250 Einheiten, bei dem das offene Ende stets in Shikku&acute;s Richtung zeigt (nur bei der Erschaffung, danach wird die Formation starr). Prallt die Kristallkugel an dieser Formation ab, sendet die Formation eine Ersch&uuml;tterung aus, welche alle Gegner im Umkreis von 300 Einheiten f&uuml;r 0,5/0,625/0,75/0,875/1 Sekunde (Stufe Blau) bet&auml;ubt. Bleibt 2 Sekunden bestehen (+1 Sekunde pro Stufe Gelb, Maximum liegt bei 7 Sekunden). Dies kann nur ein Mal alle 6 Sekunden (-1 Sekunde pro 200 AP, kann nicht unter 2 Sekunden fallen) ausgel&ouml;st werden (gilt sowohl f&uuml;r die Formation als auch f&uuml;r die Kugel).\n\nAlle Formationen haben, sofern nicht anders angegeben, eine &bdquo;Dicke&ldquo; von 75 Einheiten. F&uuml;r alle Arten von Abprallern der Kugel gilt: Einfallswinkel=Ausfallswinkel.\n\n_Stufe (Farbe) bedeutet, dass die F&auml;higkeit mit der Stufe des jeweils ausgegrabenen Edelsteins skaliert._\n\n**\n5. Texte**\n\nChamp-Select: &quot;Alles hier beherbergt &Uuml;berraschungen. Lass sie mich dir zeigen!&quot;\n\nWenn gebannt: &quot;Wage es nicht, mich noch weiter zu behindern!&quot;\n\nMove-Command:\n\n* &quot;Meine Gr&ouml;&szlig;e ist mitnichten ein Nachteil!&quot;\n* &quot;Ich sp&uuml;re es... sie liegen direkt unter uns!&quot;\n* &quot;Einen Khhi&acute;Xar st&ouml;rt man nicht bei seinem Werk!&quot;\n* &quot;Sch&auml;mt ihr euch nicht, diesen Ort so verunstaltet zu haben?&quot;\n* &quot;Nun denn, die Grabungen k&ouml;nnen beginnen.&quot;\n* &quot;Ihr habt keinen Schimmer davon, wo ihr suchen m&uuml;sst!&quot;\n\nAttack-Command:\n\n* &quot;Das war keine weise Entscheidung!&quot;\n* &quot;Versucht ihr schon wieder, mich zu st&ouml;ren?&quot;\n* &quot;Wer wei&szlig;, wie man die Sch&auml;tze des Bodens nutzt, ist klar im Vorteil!&quot;\n* &quot;Ihr seid auch nicht besser als die Diebe, die ich von zu Hause kenne!&quot;\n* &quot;Ihr zwingt mich, euch verscheuchen zu m&uuml;ssen!&quot;\n\nJoke:\n\n* &quot;Pass auf, dass du nicht den Kopf sinken l&auml;sst... die Steine hier sind doch sehr hart!&quot;\n* &quot;Du solltest nie in der N&auml;he von mir oder den Edelsteinen sein... also nirgendwo!&quot;\n\nTaunt:\n\n* &quot;Wer ist h&auml;rter hier? Dein Sch&auml;del oder meine Steine? Lass es uns herausfinden!&quot;\n* &quot;Khhi&acute;Xar sind nicht feige! Sie wissen nur, wann es sich lohnt, zuzuschlagen. Und dadurch, dass ich jetzt hier bin...&quot;\n\nGegen {{champion:44}} :\n\n* &quot;Pah, was wei&szlig;t du schon von Edelsteinen?&quot;\n* &quot;Ich hatte &Auml;onen, um alle Steine dieser Welt zu studieren! Was hast du dagegen schon zu bieten?&quot;\n* &quot;Traurig, mit ansehen zu m&uuml;ssen, wie du das Potential dieser Steine verschwendest!&quot;\n\nGegen {{champion:3}} :\n\n* &quot;Interessantes Material... aber man kann alles brechen!&quot;\n\nGegen {{champion:72}} :\n\n* &quot;Als w&uuml;rde ich einem Konkurrenten gegen&uuml;berstehen. Aber wenn ich dich so ansehe...&quot;\n* &quot;Und noch so einer, der keine Ahnung von dem hat, was er tut!&quot;\n\nBeim Kauf von {{item:3116}} :\n\n* &quot;Hmmm, das ist eine wahrlich gute Qualit&auml;t!&quot;\n* &quot;Gut zu wissen, dass es noch solch hervorragende Kristalle gibt!&quot;\n\nBeim Kauf von {{item:3057}} :\n\n* &quot;Der Name dieser Klinge bewahrheitet sich!&quot;\n\n**\n6. Wie spiele ich ihn...?&quot;**\n\nWer Shikku meistern will, muss ein Meister des Multitaskings sein. Ihr habt verschiedene M&ouml;glichkeiten, die Kugel und das umliegende Terrain zu manipulieren, diese m&uuml;sst ihr aber geschickt nutzen, um einerseits eurem Gegner den Fluchtweg abzuschneiden und andererseits eure Kugel zu eurem Ziel zu lenken und damit m&ouml;glichst viel Schaden auszuteilen. Bedenkt, eure Kugel kann theoretisch jeden Gegner unendlich oft Schaden zuf&uuml;gen, es gibt dahingehend keine Limits. Aber daf&uuml;r ist es schon schwer genug, &uuml;berhaupt die Kugel Richtung Ziel zu bewegen. Und wer das halbwegs gemeistert hat, auf den wartet die ultimative K&ouml;nigsdisziplin, welche da ganz einfach lautet: Mehrere Kugeln gleichzeitig zu kontrollieren.\n\nWie ihr seht, ein Konzept mit hoher Einstiegsh&uuml;rde und hohem Skill-Cap, aber wer Shikku einmal gemeistert hat, darf zu Recht gef&uuml;rchtet werden.\n\n_Edit: hab ja noch was vergessen! Wird hiermit nachgereicht!_\n\nBeispiel-Build für Jungle-Shikku: {{item:1402}} {{item:3020}} {{item:3151}} {{item:3116}} {{item:3030}} {{item:3089}} \n\n_Wer sich wundert: Die Geschlechterfrage bei Shikku ist ein bisschen kompliziert, denn eigentlich sind die Khhi&acute;Xar mehr oder weniger geschlechtslos, aber irgendwie hatte ich einen inneren Widerstand, Shikku die ganze Zeit mit &quot;es&quot; zu umschreiben. Komplizierte Geschichte..._\n\n_\nUnd nat&uuml;rlich gilt wie immer: Die Zahlen im Konzept sind nur ungef&auml;hr und sind jederzeit zur Diskussion freigegeben!_\n\nUnd damit sind wir auch schon wieder am Ende angelangt! Ich hoffe, dir hat mein Konzept gefallen, Feedback ist ausdr&uuml;cklich erw&uuml;nscht! Und zum Schluss kann ich nur sagen: freu dich schon auf all die anderen Konzepte, die schon in Planung sind! A propos Konzepte: Ich habe jetzt doch nochmal kurz nachgeschaut: Shikku ist tats&auml;chlich schon mein 15. Konzept! _Applaus setzt ein_\n\nUnd damit verabschiede ich mich f&uuml;r heute, allen, die das lesen, w&uuml;nsche ich noch einen sch&ouml;nen Tag! Bis zum n&auml;chsten Konzept!\n\nMfG\n\nIncaedeus\n\n_Umso l&auml;nger ich mir das Konzept durchlese, desto mehr kriege ich das Gef&uuml;hl, dass es wie eine Invoker-Abklatsche wirkt. Ich habe echt zu viel DotA gespielt in letzter Zeit... Sorry! :(_","replies":[{"poster":"Azradan","date":"2017-07-07T16:32:13.926+0000","up_votes":2,"down_votes":0,"body":" Ich mag Flipperautomaten xD\nAber zu den Champion, ich find den ja genial. Vorallem Das Man nicht zu weit von der Kugel weg darf und sich überlegen muss welche steine man wie zusammenlegt\nAlso das wär ein Champion den ich unglaublich gerne Spielen würde.","replies":[]},{"poster":"Lunaá","date":"2018-04-25T17:41:18.157+0000","up_votes":1,"down_votes":0,"body":"Erstaunlich, dass ich es verpasst habe hier zu kommentieren, vllt hatte ich damals gerade keine Lust und es dann vergessen ^^\n&ensp;\n---\n##Nun denn, die Berwertung:\n&ensp;\n---\n##Allgemeines:\n\n* **Werte:**\nAlso 1510 Leben auf Stufe 18 sind schon extrem wenig, und seit wann gibt es Fähigkeitsstärke pro Stufe ?\nDer Rest sieht ok aus, die Rüstung könnte allerdings auch etwas höher sein.\n&ensp;\n\n* **Lore:**\nIst gut gelungen, passt zum Champion und seiner Geschichte\n&ensp;\n---\n##Fähigkeiten:\n\n* **Passiv:**\nIst eine super Idee, könnte ich auch mal in einem Konzepz von mir benutzen (unter anderem Namen dann wahrscheinlich), hat sehr viel Potenzial, finde ich hier aber irgendwie fehl am Platz.  Die Fähigkeiten nutzen zwar den Spektralschaden, aber die Idee hätte viel mehr integriert werden müssen, um hier Sinn zu ergeben\n&ensp;\n* **Q- bis E-Fähigkeiten:**\nDie Namen sind ja mal übelst lame ^^\nUnd passieren tut hier ja auch nicht viel. Vllt könnte der Cooldown unterschiedlich sein, um zwsichen Hauptspells und stärkeren Nebenspells zu unterscheiden. So kann man sich natürlich aussuchen, welche Variante man bevorzugt, was aber auch nicht schlecht ist\n&ensp;\n* **R-Fähigkeit:**\nKann man auch nicht viel zu sagen, außer dass man im Jungle sehr große Probleme haben wird, wenn man die Kugel nicht hat, und ich würde sagen, es ist eher sehr schwer, sie kontrolliert genug zu bewegen, um mehrer Junglecamps mit einer zu schaffen, und ohne kann man es  als Ap-ler gleich vergessen.\nDen Cooldown finde ich dafür einfach zu hoch, ich würde den statt beim Einsetzen der Fähigkeit beim Zerstören der Kugel starten lassen, dafür aber reduzieren\n&ensp;\n* **Kombinationen:**\nHier hat man viel Variationen, und sie sind gut gemacht, aber es wird sicherlich schwer, den Überblick zu behalten.\nIch würde eher die festen Zeitangaben mancher Effekte nur solange bestehen lassen, wie die Verbindung der Kristalle zueinander besteht, das ergibt für mich mehr Sinn.\n&ensp;\n---\n##Sonstiges:\n\n* **Sprüche:**\nFinde ich schon, und sie passen zum Verhalten des Champions\n&ensp;\n* **Spielweise:**\nOh wait, man kann mehrere Kugeln gleichzeitig haben (hätte ich mal mehr nachgedacht)? Ich denke, das wird es noch komplizierter machen, als es ohnehin schon ist. Da wäre ich sehr für meine Variante der Kugelbeschwörung.\nSkillcap liegt wahrscheinlich bei unendlich ^^, allein die Berechnung des Appralles von Wänden ist für den Spieler schon nur zu schätzen\n&ensp;\n---\n##Abschluss:\n\n* Neben dem (mal wieder) sehr komplexen Design, hat der Champion (nur das Aussehen) für mich zu viel Ähnlichkeit mit Skarner. Wie Skarner hat er Kristalle und ist ein Insekt (das musste ich extra googlen), und irgendwie erinnert mich er zugleich an einen bunten Mistkäfer :)\n\n* Ich finde das Konzept zwar interessant und lustig sich vorzustellen, aber da die Kontrolle über die Kugel einzige Schadensfähigkeit ohnehin schon extrem schwer ist, und so der allergrößte Teil der Spieler diesen Champion eher nie spielen wird, hat man wie bei Ryze und Azir aktuell ein großes Balance-Problem, welches die Spieler eher nicht zufrieden stellen wird. Ich glaube, der Champion ist so nicht umsetzbar sry\n&ensp;\n♥ ","replies":[]},{"poster":"Doenerlord","date":"2018-04-23T10:35:40.672+0000","up_votes":1,"down_votes":0,"body":"Und noch so ein kompliziertes Konzept von dir. Allerdings nicht halb so komplex, wie Devargan und seine Mannschaft :D\nIch finde viele meiner eigenen Ideen hier drin wieder. Ich habe schon lange mit der Idee gespielt durch die Kombination von Fähigkeiten erst bestimmte Wirkungen zu erzeugen. Ich dachte dabei zwar immer an Linien, die man auf bestimmte Art verknüpfen muss (z.B. Plus oder Dreieck oder so), aber die Kombination von farbigen Kristallen ist auch eine nette Idee.\nEine Verständnisfrage hätte ich noch: Wenn man alle drei Farben kombiniert, was passiert dann? Oder kann immer nur eine bindung gleichzeitig stattfinden, die die Farbkristalle quasi aufhebt?\nIch denke jedoch, dass das Gameplay dieses Champions sehr unbefriedigend sein wird.\nDadruch, dass die Kristalle nur 5 Sekunden abklingen müssen und du sogar bis zu drei Stacks kommulieren kannst (wie lange laden die Kommulationen eigentlich auf?), bist du in der Lage die komplette Map mit Wänden einzudecken. Dafür machst du mit deinen Fähigkeiten nicht sehr viel Schaden. AP zeigt kaum eine merkliche Wirkung auf den Damageoutput und dadurch, dass du nur gemischten Schaden verursachst, ist es egal was deine Gegner bauen, du wirst nie wirklich viel Schaden hauen (außer auf ADCs).\nDa du nur mit der grünen Kombo oder mit verlangsamten Kugeln CC verursachen kannst, wird es auch äußerst schwierig nah am Gegner zu bleiben, um viele Treffer zu bewirken.\n\nDer optimale Weg um Gegner zu pulverisieren wäre ja wohl einen sehr engen Raum mit Wänden um dich herum zu blockieren und die Kugel möglichst schnell darin herumspringen zu lassen. Da du aber fast keine Möglichkeit hast den Gegner (außer mit Wänden) zu binden, brauchst du eine Engage-Fähigkeit. Jedes mal den Flash zu benutzen, wenn du einen Gegner einfangen willst, könnte schon ziemlich nerven.\nAußerdem: Die gelbe und die orange Kombo erschaffen Wände, die 6 und 4 Sekunden lang bestehen bleiben. Ein vergleichbarer Champion mit derartigen Blockade-Effekten ist Anivia. Sie erstellt eine verhältnismäßig breite Wand, die 5 Sekunden bestehen bleibt. Die kostet aber 70 Mana und hat maximal 1000 Reichweite. Außerdem bewirkt sie keine anderen Effekte, da sie für das Positioning in Teamfights schon stark genug ist.\nDu hast insgesamt fünf verschiedene Wandefekte, die, wenn du sie richtig einsetzt, sicherlich einen Weg für den Rest des Spiels blockieren können.\nAllerdings wirst du wahrscheinlich keinen Assist bekommen, obwohl du jeden einzelnen Gegner separiert hast, weil du kaum in der Lage sein wirst, durch die vielen Wände hindurch eine Ulti zu treffen, es sei denn, du wärst schon beim Gegner.\n\nWie sieht die Skalierung der Geschwindigkeit der Kugel eigentlich im genauen aus? Wenn du z.B. Righteous Glory aktivierst und auf einen Gegner zustürmst, werden aktive Kugeln dadurch schneller oder in dem moment ausgelöste Kugeln erhalten die entsprechende Geschwindigkeit, oder wie sieht das aus?\n\nDie einzige Situation, in der dein Schaden viel zu hoch wäre ist im Dschungel: du setzt eine (gelbe oder rote - rote Wand einfach durch zwei Säulen direkt nebeneinander) Wand hinter dich und schießt die Ulti auf das Camp. Die Kugel prallt so lange ab, bis die Wand sich auflöst und wird jedes mal stärker. Das Camp ist im Nu tot und du healst dich auch noch, wenn du dein Spellvamp-Feld errichtet hast.\n\nDesweiteren habe ich einen Kritikpunkt zu den Zahlen:\nDu verringerst die Manakosten der ultimativen Fähigkeit mit dem Level. Für Energiechampions ist das standard für alle Skills (außer der Ulti, da diese normalerweise keine Energiekosten hat), aber für Manachampions sollten die Kosten nicht sinken, sondern eher steigen, da sie mit der Zeit Mana bauen und die Limitierung ihres Durchhaltevermögens noch gewährleistet werden muss (aus dem Grund wurde der Manarestore von Soraka abgeschafft).\n\nMeiner Meinung nach versuchst du hier zu viele Ideen gleichzeitig zu vereinen.\nSowohl die Idee vom Kombinieren verschiedener Fähigkeiten, als auch die Beeinflussung von Reichweite mit AP und das Abprallen von Skillshots an Wänden ist eine coole Sache. Aber die Effekte wurden hier nicht so optimal aufeinander abgestimmt und das Gameplay mag sich zwar durch die Erläuterung vielseitig und interessant anhören, wird aber im Endeffekt wahrscheinlich eher nervtötend (als Supporter dauerhaft eine Kugel auf der Lane hin- und her fliegen lassen und die Gegner vom Farm wegblocken oder schlichtweg keinen Schaden machen).\nDazu noch der Slow der Ulti, der zumindest in starker Form kaum in der Lage ist zu treffen, da ein Skillshot schon mit Bewegungsgeschwindigkeit sehr langsam ist und bei weiterer Verlangsamung niemanden mehr treffen wird.\n\nIch merke, dass du dir Mühe gegeben hast ein innovatives Konzept zu entwickeln, aber die genaue Zusammenstellung überzeugt mich leider nicht.\n\nGruß,\nDoenerlord","replies":[{"poster":"INoKami","date":"2018-04-23T15:57:12.354+0000","up_votes":1,"down_votes":0,"body":"> Allerdings nicht halb so komplex, wie Devargan und seine Mannschaft :D\n\nAuf deinen Kommentar dazu warte ich schon seit Tagen ;) Gib mal Gas, Junge! \n_/sarcasm off_\nAlso dann, die nächste Abhandlung:\n\n* Den Fall \"Drei Kristalle\" gibt es nicht, da, wie schon in der Passiven erwähnt, sich zwei Kristalle direkt verbinden. Es gibt höchstens den Fall, dass die zwei Kristalle weiter auseinander sind, aber ein dritter Kristall theoretisch sich mit beiden verbinden könnte. Indem Fall nimmt er den Kristall, der näher zu ihm ist.\n* Eine Aufladung für die Fähigkeit gibt's immer nach [CD der Fähigkeit] Sekunden. So wie bei der Vel´Koz-W.\n* Wow. Mir fällt jetzt erst auf, dass die Ult keine Dmg-Ratio hat. Muss nachgebessert werden.\n* Ja, theoretisch hat man fünf Wände, aber dann wiederum:\n**Rot:** Zwei Teemos, die afk sind. Ja gut...\n**Blau:** Selbsterklärend, ist keine Wand.\n** Gelb:** Eine höchstens 500 breite Wand. Die Anivia-Wand hat auf Stufe 5 800Breie. ´Nuff said :)\n**Violett:** Ein etwas größerer Ornn-Q-Pinöpel. Sagen wir: ein Teemo mit Iron Elixir, Steraks und Lulu-Ult, der afk ist.\n**Orange:** Da kann man noch am ehesten was machen. Aber die Wände sind schon etwas von einander entfernt (hat da jemand vergessen, die Distanz hinzuschreiben...? >:D ) Und in der Mitte gibt's ne Lücke, durch die alles, was nicht ein 12-Stack-Cho´Gath ist, bequem durchspazieren kann.\n**Grün:** Auch diskutabel, aber kann man doch relativ easy sidesteppen.\nAlso ja, es wird etwas hindernisparcour-artig, aber (auch durch die geringe Dicke der Wände und hey, ganz unter uns... wir wissen doch, was Riot von Dashes hält und mit ihnen umgeht xD) ich glaube, das ist noch verkraftbar.\n* Sobald ein Mal eine Kugel beschworen wurde, wird ihr Movespeed auf Shikku´s aktuellen Wert gesetzt und von da an immer separat berechnet, man kann den Wert nur mit den Formationen verändern.\n* Gut, mit den Manakosten auf der Ult wollte ich mal was anderes probieren. Hat nicht geklappt^^\n* Geringer Schaden/wenig CC: Es gibt zwei Möglichkeiten, dem entgegen zu wirken: A) Wofür sonst hat Shikku 5 Wände?^^ B) Rush Rylais nach dem Jungleitem und fertig.\n\n> als Supporter\n\n* Ähm... bitte was? Wo hab ich gesagt, dass das ein Support ist? Das soll ein Jungler sein :(\n\nAber danke, dass du mir etwas ausführliches zu Shikku sagen kannst. Hintergrund ist der, dass er ungefähr eine Woche nach Release ungelogen über Nacht 900 Views zusätzlich generiert hat und ich mir bis heute nicht erklären kann ,wie das passiert ist/das passiert ist/ ob das was gutes/schlechtes ist.\n\nAlso es scheint, als müsse ich hier auch noch mal ansetzen. Booooah, schon wieder so viel zu tun, wann soll ich dann noch zum Zocken kommen -_-Aber trotzdem Danke dir, dass du dir die Mühe gemacht hast, die beiden Konzepte (Shikku und Rishhikaz) durchgelesen hast und jeweils was produktives da lassen konntest!\n\nMuss mir jetzt dein Konzept nochmal anschauen, wir wissen ja, warum ;)\n\nMfG\n\nIncaedeus\n{{sticker:galio-happy}} \n_Leidenschaftlicher Galio-Main_","replies":[]}]},{"poster":"YonaYonaPingu","date":"2017-07-10T12:32:14.407+0000","up_votes":1,"down_votes":0,"body":"Also ich finde das ein bisschen kompliziert , mit den farbcombos kommt man vlt schnell durcheinander.\nAber was wäre wenn er direkt die möglichkeiten der fusionierung auf der tastenbelegung anzeigt?","replies":[{"poster":"INoKami","date":"2017-07-10T13:39:03.605+0000","up_votes":1,"down_votes":0,"body":"Einerseits gehört das halt auch ein bisschen dazu, dass man halt die ganzen Kombinationen auswendig lernen muss, andererseits kann ich mit vorstellen, dass du über der Fähigkeitenleiste einen Knopf hast, der bei Mausklick ausfährt und dir die Kombinationen auflistet, ähnlich wie bei Invoker.\n\n...\n\nInvoker-Kopie confirmed \n{{sticker:slayer-pantheon-thumbs}}","replies":[]}]},{"poster":"MarCommander2211","date":"2017-07-08T12:24:13.692+0000","up_votes":1,"down_votes":0,"body":"Das soll doch ein Supp sein, oder?","replies":[{"poster":"INoKami","date":"2017-07-09T09:28:24.023+0000","up_votes":1,"down_votes":0,"body":"Eigentlich Nein...\nDas müsstest du etwas genauer erklären, da ich nicht sehe wie sein Kit/Playstyle auch nur ansatzweise als Supp durchgehen würde.","replies":[]}]}]}