{"poster":"aceltic15","date":"2017-05-21T18:21:32.632+0000","title":"14 day ban","subforum":"[ARCHIVED] Help & Support","up_votes":3,"down_votes":3,"body":"Why? Why do I get a 14 day ban automatically for calling people trash? I don't get like a 1 day or a 3 day? Also its pretty stupid how Riot bans toxic people but not the people that leave games and cause their team to lose? Like at least the toxic people are still trying, Its pretty dumb.","replies":[{"poster":"Broporo","date":"2017-05-22T04:03:28.251+0000","up_votes":4,"down_votes":1,"body":"We do take player harassment pretty seriously here at Riot, as well as keeping track of those who constantly abandon their teammates in games. With enough leaves or AFKS, those people will end up with penalties as well. \n\nI won't be able to help with lowering that suspension, but take this time to consider what was said, and why it could have been upsetting to someone on the receiving end. Teamwork makes the dream work, and bringing your other team members down would only help spell defeat for your team.","replies":[{"poster":"SGP Temptation","date":"2017-06-13T18:19:14.616+0000","up_votes":1,"down_votes":0,"body":"May I just say, I do not believe that the punishment system is sufficient. If there really is a \"Zero tolerance\" for toxicity, then why is it that many can go one game at a time being toxic? Also, many are punished on their first offense where as others can go for many games before even seeing a warning. I know this because I have been in each situation. I also understand that there is a \"ladder\" punishment system, and as you continue toxicity, you move up the ladder (I also understand that you can skip levels depending on the severity). However, when your game chat is read, I feel that both guilty parties should be punished. If someone really does look into and decide a verdict for these cases individually, they SHOULD take into account EVERYTHING and EVERYONE in the game. For example, you cannot report a support for taking all the cs and kills, even if it costs your team the game because you do not have an adc. However, if each case is not thoroughly read and rather skimmed for the toxic players chat, then why should some people be able to get away with it for so long? Cumulatively, all players of league of legends are old enough to understand that words are just words and it is in game activity which truly matters. I am just curious to know because I really hate and do not understand Riot's crack down on in game chat but not in game activity. As in why should chat related violations result in anything besides chat related punishments. It gives me a sense of the whole \"yeah there might not be a really good reason for it but just because I said so, you have to listen and were Riot so we can do whatever we want and small individuals like you don't matter.\" I am not trying to fire shots, I genuinely would please like some clarification if that is okay...","replies":[]},{"poster":"LianPlayz","date":"2017-05-22T04:08:42.813+0000","up_votes":1,"down_votes":0,"body":"If you're free to help, I really need some assistance @Broporo","replies":[{"poster":"Broporo","date":"2017-05-22T04:26:23.949+0000","up_votes":1,"down_votes":0,"body":"I see your post, check for my response in a sec ^_^!","replies":[{"poster":"LianPlayz","date":"2017-05-22T04:34:07.618+0000","up_votes":1,"down_votes":0,"body":"Sorry about that. I didnt see it in time.","replies":[{"poster":"LianPlayz","date":"2017-05-22T04:37:32.314+0000","up_votes":1,"down_votes":0,"body":"I was hoping if you could check out my ticket personally because I really need this to be fixed before the sales are over.","replies":[]}]}]}]}]},{"poster":"kjono1","date":"2017-05-21T21:54:20.996+0000","up_votes":2,"down_votes":0,"body":"Hello aceltic15,\n\nRegarding suspensions, many players have doubt as to why they are being punished, as often they will have been toxic as a form of retaliation, saying this like \"the other player(s) were toxic as well\" or \"the other player(s) started it\" however all punishments are placed accordingly and correctly based upon the behavior of the individual being punished, what the other players said or did have no impact on the outcome, as all negativity is punishable regardless of who causes the argument. \n\nWhat many players forget, or do not realize is that just because other players are being offensive or breaking the rules, it doesn't give anyone else an excuse to be offensive or break the rules in any way what so ever.\n\nAn argument between multiple people can ruin the experience for the rest of the players in the game.\n\nThe reason the punishment is so long is so you feel the affects of it, it is meant to make you feel bad, and upset, maybe even a little bit angry that you cannot play the game for a while, this is in the hope that you take the time away from the game to reform, and when you come back not continue with negative behaiour.\n\nPlease bear in mind that the next punishment up from this is a permanent ban.\n\nHopefully this clarifies your understanding of why you have been punished and why for so long, if not please explain what you don't understand and I will do my best to better your understanding :)\n\nKjono1","replies":[]},{"poster":"iiDvrsty","date":"2017-05-21T21:12:30.058+0000","up_votes":2,"down_votes":0,"body":"If you took the chance to read the rules, Toxicity is on a 0 Tolerance state. And leave buster might not ban the summoners who leave games, but it does punish them. Next time be careful of what you say out on the rift ≤3","replies":[]},{"poster":"L9jJn1LAmk","date":"2017-05-21T21:00:36.745+0000","up_votes":2,"down_votes":0,"body":"Word of advice: after the 2 week penalty ends, dont swear or call names to someone. If they report you, the Instant Feedback System will look for swears or signs of harrassment and you will be Permanently Suspended.","replies":[]}]}