{"poster":"Delphox94","date":"2016-06-30T19:46:35.752+0000","title":"Bug che non riesco a risolvere. HELP","subforum":"Aiuto e supporto","up_votes":1,"down_votes":1,"body":"Ciao a tutti,\r\normai, da almeno un mese e mezzo, non riesco pi&ugrave; a giocare a LOL decentemente per colpa di bug che mi ostacolano la giocata. \r\nIn pratica non basta che clicco una sola volta, ma devo cliccare pi&ugrave; volte sul &quot;negozio&quot; (il tipo nella base, per intenderci), come anche sugli oggetti da comprare. Oppure se premo Y non mi blocca/sblocca pi&ugrave; la visuale e se clicco sulla mappa non mi sposta il quadratino della visuale, quindi sono costretto a cliccare manualmente in basso il block.\r\nAnche l&#039;utilizzo delle spells &egrave; cambiato: Prima cliccavo la Q (esempio) e mi appariva il range della spell, poi ricliccavo e la faceva partire. Ora se clicco una spell me la fa partire dove ho il puntatore.\r\n\r\nNon riesco a giocare cos&igrave;, qualcuno mi aiuti T_T Ho pure provato a fare &quot;Ripara&quot; ma non cambia nulla\r\nSpero di essermi spiegato decentemente.\r\nComunque ho un Mac e se dovete spiegarmi qualcosa di tecnico usate un linguaggio elementare :P Non ne capisco nulla di pc.\r\n\r\nGrazie!","replies":[{"poster":"94MrPing94","date":"2016-07-01T07:09:15.687+0000","up_votes":1,"down_votes":0,"body":"Andiamo con ordine:\n\n1) per quando riguarda i comandi della UI e gli shortcut su tastiera, una volta lo aveva fatto anche a me e mi sono accorto che avevo il gioco in modalità Borderless windowed invece che fullscreen. non so come mai, ma appena tornato a fullscreen si era risolto. Magari è una cosa che non c'entra nulla, però prova a guardarci.\n\n2) l'acquisto degli item cliccando con il tasto sinistro richiede sempre 2 click, se vuoi acquistarli velocemente, cliccando con il destro vengono acquistati con 1 solo click ;)\n\n3) per le spell invece, nelle impostazioni in sezione Hotkeys c'è il tasto \"Normal Cast All\", che farà tornare tutte le spell alla tua vecchia impostazione.\n\nAd ogni modo, se vuoi un consiglio, abituati ad usare il quickcast (l'impostazione che hai attualmente che appena tocchi il tasto parte la spell). è molto più spiccio e in certe situazioni fa la differenza IMHO ^^","replies":[{"poster":"Delphox94","date":"2016-07-01T17:09:31.227+0000","up_votes":1,"down_votes":0,"body":"Okay proverò a fare come dici! Nel caso non funzionasse provo a riscrivere qui! :) Grazie ancora!!","replies":[]}]}]}