{"poster":"FNC TAKE IT HOME","date":"2017-05-04T18:08:09.061+0000","title":"Parliamo di Ahri","subforum":"Campioni e gameplay","up_votes":5,"down_votes":6,"body":"&egrave; un cancro totale ha tutto quello che ha bisogno: danni (di cui anche puri), sustaine , mobilit&agrave; , cc , waveclear.\r\n&quot;ma ahri si basa tutto sulla e se schivi quella sei a posto&quot;, come fai a schivarla se con la ulti ti viene a 3 centimetri,\r\nnessun altro champion a tutto ste cose apparte camille prime dei nerf che sono andati , appunto, a eliminare la sustaine ma resta il fatto che non &egrave; un champion ranged e non fa danni ad area, basta toglierle una di quelle cose che diventa a posto a parer mio.","replies":[{"poster":"fedy99","date":"2017-05-04T18:37:09.150+0000","up_votes":2,"down_votes":0,"body":"Se losgherro leggesse questo post sarebbe fiero di te","replies":[]},{"poster":"WhiteToArcher","date":"2017-05-04T18:58:50.975+0000","up_votes":1,"down_votes":0,"body":"Io stesso ho giocato ahri diverse volte, tuttavia ho ugualmente difficoltà a vincere la lane e/o il game.\nSarà perché sono estremamente nabbo, sarà anche che non é così op come dici ..\nLo so che ahri é forte, ma non penso sia broken.","replies":[{"poster":"Ringiel","date":"2017-05-04T19:16:15.314+0000","up_votes":2,"down_votes":1,"body":">Lo so che ahri é forte, ma non penso sia broken.\n\nper me il 22% di play rate parla da solo ... non è broken,ma non è neanche nella media,visto che viene giocata 1 partita su 5.","replies":[{"poster":"WhiteToArcher","date":"2017-05-04T19:44:01.779+0000","up_votes":1,"down_votes":0,"body":"Secondo League of Graphs:\nLee sin ha il 37.7%;\nLucian il 35.3%;\nThresh il 27.8%;\nCaitlyn il 26.4%;\nEzreal il 24.3%.\n\nCosa dovrebbe indicarmi in questi casi il play rate? \nNerfiamo pure questi champ?","replies":[{"poster":"Ringiel","date":"2017-05-04T20:02:59.197+0000","up_votes":3,"down_votes":2,"body":">Lucian il 35.3%;\n\n52% di win rate ... è forte per la {{item:3153}},come verrà nerfata il suo pick rate subirà un involuzione\n\n>Caitlyn il 26.4%;\nEzreal il 24.3%.\n\n50% e 46%, sono pickati perchè sono forte in ogni fase del gioco ... loro più che altro possono subire un nerf alle build,mentre sui mid è molto più difficile.\n\n>Thresh il 27.8%;\n\nthresh è il support più completo,ha sempre un play rate della madonna ... \n\n>Lee sin ha il 37.7%;\n\nlee è come cait e ezreal,è molto soggetto a nerf nelle build\n\n_____\n\nahri invece,al contrario di quelli che hai citato(salvo thresh) va bene sempre e in qualsiasi meta,perchè ha un kit assurdo ... cmq ha anche un 53% di win rate,oltre al 20% di pick rate,che per me testimonia che è un pick fuori dalla media.","replies":[{"poster":"HaIIeIujah","date":"2017-05-05T10:03:22.767+0000","up_votes":3,"down_votes":1,"body":"\"Soggetto al nerf delle build\", Lucian e Lee sin? Sono due dei champion più adattabili del gioco.\n\nLucian ha eccelso nel meta di Letahlity, si è mosso rapidamente come Botrk abuser ed ibrido crit con IE, PD e Black Cleaver nella build.\n\nLee Sin nella sua storia ha buildato praticamente qualunque cosa , a seconda di ciò che fosse più adeguato al meta; ed è sempre stato rilevante o meta-defining tranne nel periodo relativamente breve dei cinderhulk junglers.\n\nAhri può avere un problema o meno (personalmente, credo sia overtuned e necessiti leggere modifiche); ma giustificare l'iperpresenza di altri campioni perché  \"suscettibili ai nerf di Build\" è un'argomento incorretto, considerato che quasi tutti quelli qui elencati tranne Ezreal sono tra i migliori generalisti del gioco.","replies":[{"poster":"Ringiel","date":"2017-05-05T10:36:12.035+0000","up_votes":1,"down_votes":3,"body":">Lucian ha eccelso nel meta di Letahlity, si è mosso rapidamente come Botrk abuser ed ibrido crit con IE, PD e Black Cleaver nella build.\n\nsi ma una volta che verrà nerfata la botrk come lo giocherai? critico non rende,perchè lui deve dominare l'early-mid game,e la lethality è stata uccisa tra i nerf e questa patch ... per me è uno di quei champ soggetti a un prossimo nerf della botrk.\n\n>Lee Sin nella sua storia ha buildato praticamente qualunque cosa , a seconda di ciò che fosse più adeguato al meta; ed è sempre stato rilevante o meta-defining tranne nel periodo relativamente breve dei cinderhulk junglers.\n\nlee è scarso in un meta dove i game sono lenti o in meta tankoso,ma se vengono buffati ancora di più gli oggetti da tank anche lui diventa soggetto a un nerf sulla build(non ha alcun senso giocarlo tank) ... \n\n_____\n\n>ma giustificare l'iperpresenza di altri campioni perché \"suscettibili ai nerf di Build\" è un'argomento incorretto\n\nsono iperpresenti per i nerf che hanno subito le build ... lucian a inizio stagione scorsa era scomparso e prima che diventassero virali le \"korean build\" non veniva cagato di striscio,perchè aveva subito nerf pesanti;\ncait ha subito un impennata di pick rate dopo il nerf agli adc della lethality,prima venivano giocati solo {{champion:202}} {{champion:21}} {{champion:110}} e {{champion:236}};\nezreal ha una delle path migliore del gioco,ma se verrà toccato su un solo oggetto della sui build,lui muore;\nthresh come ho detto ha un kit completo ed è sempre tra i support più pickati;\nlee è in meta perchè il meta è veloce,a maggior ragione dopo il nuovo herald,ma se nella prossima season si tornerà a un meta lento non ci sarà alcun senso per pickarlo.\n____\n\nin tutto ciò ahri è sempre top tier e strapickata da quando gioco e anche se è stata nerfata sulla E o sulla rimozione del dfg è sempre rimasta uno dei mid più giocati per il suo cavolo di kit.","replies":[{"poster":"HaIIeIujah","date":"2017-05-05T10:54:14.952+0000","up_votes":3,"down_votes":1,"body":"> ezreal ha una delle path migliore del gioco,ma se verrà toccato su un solo oggetto della sui build,lui muore;\n\nYes, come ho già detto, Ezreal è l'unico effettivametne definibile \"vulnerabile ai nerf di build\".\n\n{{champion:236}} , come hai detto tu stesso, è passato senza problemi da Lethality a Botrk/Hybrid Crit. Questa è il vero opposto di \"vulnerabile ad un nerf di build\". Tra l'altro, il nerf sulla Botrk c'è già stato, e non è abbastanza rilevante da non renderla una buona opzione.\n\n{{champion:412}} non è top del meta, ma non è mai stato dipendente da un singolo item per funzionare. Non alcuni scrupoli nel buildare Redemption se necessario, o qualunque sia l'item da supporto necessario al momento.\n\n{{champion:51}} , ancora una volta, è stata sempre un pick valido persino nei meta dominati dalla Lethality grazie alla sua lane phase sicura. Il suo peggior drop di giocabilità è stato al 12-13% in un meta estremamente ostile, che è dire parecchio.\n\nEd infine, e qui sarò franco: {{champion:64}} è sempre stato giocabile. Dire che eccelle _solo_ nel meta veloce è falso: Lee Sin _crea_ il meta veloce con la sua capacità di invade, trascinando fuori qualuqneu jungler troppo vulnerabile.\n\nCarry jungler meta? Lee Sin ancora giocato per la sua capacità di invadere e danneggiarli prima che possano arrivare al powerspike, snowballando le lane.\n\nUtility jungler meta? Lee Sin giocato per la sua capacità di essere rilevante con gold limitato (chiaro esempio la build con sightstone usata in alto elo e competitivo, che ancora una volta dimostra l'adattabilità del suo kit.)\n\nTank jungler meta? Lee sin giocato per il suo buon dueling contro i tank in early, sceso di viabilità solo fino ai giganteschi nerf di sej. Subito dopo è riapparso immediatamente.\n\nGraves/Ivern meta, che per qualunque logica dovrebbe essere ostile a lui? Ancora presente, come apprezzabile persino adesso all'MSI e dal suo pickrate immensamente alto.\n\nLee è una costante universale. Non è mai stato irrilevante e nella gran parte della sua storia è stato _il_ jungler. Persino Ahri, la cui popolarità è stratosferica (in parte per motivi tematici, il suo apprezzamento dalla  componente casuale di uomin ie donne del gioco) è stata \"ingiocabile\" a livello semicompetitivo nel poke meta e nell'utility meta della midlane. \n\nDove voglio arrivare con tutto questo? Al punto che c'è una differenza tra iperpresenza dovuta ai numeri e dovuta al kit. Ahri è ovunque (non quanto altri nella lista, il che già di suo dice qualcosa) più per dei numeri troppo alti e per la sua tematica che per altro.\n\nL'unica meccanica \"sbagliata\" al momento potrebbe essere consdierata il fatto che un charm point blank ha la stessa  durata di uno max range, e su quello concordo e preferirei venisse modificato. Ma questi doppi standard tra lei e Lee, o lei e Lucian sono alquanto bizzarri.\n\nE no, non gioco Ahri.","replies":[{"poster":"Ringiel","date":"2017-05-05T11:43:18.015+0000","up_votes":1,"down_votes":5,"body":">Tra l'altro, il nerf sulla Botrk c'è già stato, e non è abbastanza rilevante da non renderla una buona opzione.\n\nil nerf che hanno fatto non basta,è un item troppo efficente ... possono anche alzare il costo a 3600,ma finchè non abbassano l'ad o la lifesteal,sarà sempre troppo sgrava \n_____\n\n>{{champion:236}} , come hai detto tu stesso, è passato senza problemi da Lethality a Botrk/Hybrid Crit. Questa è il vero opposto di \"vulnerabile ad un nerf di build\"\n\nma io ho detto infatti che se nerferanno la {{item:3153}} ancora subirà una diminuzione di pick ... gli unici champ che ho classificato \"vulnerabili ad un nerf di build\" sono caitlyn,ezeral e lee.\n\n>{{champion:51}} , ancora una volta, è stata sempre un pick valido persino nei meta dominati dalla Lethality grazie alla sua lane phase sicura. Il suo peggior drop di giocabilità è stato al 12-13% in un meta estremamente ostile, che è dire parecchio.\n\n10% è nella norma infatti ... quando c'era il meta lethality era quello infatti il suo pick rate.\n_____\n\n>{{champion:64}} è sempre stato giocabile\n\nok,ma tra giocabile e eccellere c'è differenza ... c'è stato più di un periodo dove il suo pick rate ha subito una involuzione ed è inutile che lo neghi,mentre quello di ahri è sempre stato costante; poi va beh se tu paragoni soloqueue a competitive è inutile che continuo a risponderti,perchè certi pick funzionano meglio in soloqueue e altri in team organizzati.\n\nps.\n\nlee è nel suo meta ma ha il 50% di win rate,ahri il 53% ma è giocata solo perchè è popolare e ha le tette ... sisi,certo.","replies":[{"poster":"HaIIeIujah","date":"2017-05-05T11:50:31.830+0000","up_votes":4,"down_votes":1,"body":"> lee è nel suo meta ma ha il 50% di win rate,ahri il 53% ma è giocata solo perchè è popolare e ha le tette ... sisi,certo.\n\nLee ha il 50% di winrate perché è difficile da giocare. Ahri no.","replies":[{"poster":"Ringiel","date":"2017-05-05T12:17:53.894+0000","up_votes":1,"down_votes":3,"body":">Lee ha il 50% di winrate perché è difficile da giocare.Ahri no\n\n{{champion:61}} 15% di pick rate e 49% di win rate\n\n{{champion:1}} ha un 52% di win rate ma un 3% di pick rate,il più dello volte è usata a elo basso\n\n{{champion:45}} 49% di win rate e 3% di play rate\n\n{{champion:99}} 48% di win rate e 6% di play rate\n\n{{champion:134}} 50% di win rate e 10% di play rate\n\n____\n\nquesti sono tutti champ più facili di ahri,ma che hanno un win rate inferiore (tranne annie,ma perchè è utilizzata più che altro in elo molto basso) ... dimmi cosa centra la difficoltà con il win rate? se mai ahri è un pick _**TROPPO**_ solido.","replies":[{"poster":"HaIIeIujah","date":"2017-05-05T12:24:15.350+0000","up_votes":2,"down_votes":1,"body":"Ti sei perso i commenti in cui HO detto che è overtuned e va nerfata o cosa? Quello che sto contestando è il fatto che hai ciecamente evitato di applicare le stesse critiche fattibili su Ahri sugli altri campioni con alto pickrate, non che Ahri deve ricevere nerf (numerici o di piccole meccaniche) a breve.\n\nQuanto a quello che c'èentra la difficolta col wirnate: i campioni più semplici hanno un winrate inflazionato verso l'alto perchè non vengono droppati facilmente da chi li gioca poca.\n\nEsempio chiaro su Annie. E dire che Orianna è più semplice di Ahri è un eresia.","replies":[{"poster":"Ringiel","date":"2017-05-05T12:41:31.077+0000","up_votes":1,"down_votes":2,"body":">E dire che Orianna è più semplice di Ahri è un eresia\n\nsisi,ha meccaniche assurde,quasi quanto zed o azir ...","replies":[{"poster":"lich Roland","date":"2017-05-06T18:22:15.250+0000","up_votes":1,"down_votes":0,"body":"Perlomeno ha meno niubbi che giocata da schifo su di lei...","replies":[]}]}]}]}]}]}]}]}]},{"poster":"WhiteToArcher","date":"2017-05-04T21:38:02.620+0000","up_votes":1,"down_votes":0,"body":"Libero di pensarla come vuoi, fatto sta che hai trovato una scusa per ogni campione da me citato, tranne per Ahri con cui invece ti accanisci tanto.\nAhri, come tanti altri champ, se rimane indietro è di poca utilità per il team, se non le il Charm.\nAnche Ahri può soffrire dei nerd agli item core (quale per esempio il morellonomicon).\n\nAhri non è immune alle variazioni di game.\nFammi quindi il piacere di non sminuire/minimizzare/giustificare il play rate ed il win rate dei champ da me sopracitati, e di utilizzare lo stesso criterio di valutazione anche per Ahri.\n\nSono al corrente che ognuno ha dei champ che odia avere contro (o anche in squadra), ma questo non deve esimere dal dare una valutazione oggettiva ed imparziale (non certo pesata) sullo stesso champ in questione.","replies":[{"poster":"Ringiel","date":"2017-05-04T21:54:02.542+0000","up_votes":2,"down_votes":1,"body":">tranne per Ahri con cui invece ti accanisci tanto.\n\nanche per thresh non ho scuse,visto che lo reputo da sempre un top support per via del suo kit completo;\n\n>Anche Ahri può soffrire dei nerd agli item core (quale per esempio il morellonomicon).\n\nil punto è che non nerferanno mai il morello/oggetti ap direttamente,salvo un rework completo alla classe dei mage ... fare un nerf a una classe di adc-tank-assassin è molto più facile,che nerfare i mage,perchè un nerf al morello(che poi il problema di ahri è il kit,non gli oggetti) toccherebbe una marea di campioni,al contrario un nerf alla botrk ne colpisce molti meno.\n\n>Ahri non è immune alle variazioni di game.\n\ntrovami una season o almeno una parte di season in cui ha fatto schifo da quando esiste ...","replies":[]}]}]}]}]}]},{"poster":"Darkinknight","date":"2017-05-06T16:34:19.287+0000","up_votes":1,"down_votes":0,"body":"mah..mai visto come pick ne opprimente ne troppo forte\nsemplicemente ha un kit adattabile a qualsiasi situazione,ed è questo che la da una buona %win rate con una elevata %pick rate..non ha un vero counter come non countera pesantemente nessuno, è un pick molto solido,difficile che si trovi un match dove sia potenzialmente inutile.\na mio parere è uno dei champ piu bilanciati e ben riusciti di lol, un po di tutto,ma niente di esagerato su nulla","replies":[]},{"poster":"mangialavandini","date":"2017-05-05T06:53:45.692+0000","up_votes":1,"down_votes":0,"body":"a lo sgherro piace questo elemento","replies":[{"poster":"FNC TAKE IT HOME","date":"2017-05-05T08:26:18.666+0000","up_votes":1,"down_votes":0,"body":"ma chi è?","replies":[{"poster":"mangialavandini","date":"2017-05-05T09:19:26.372+0000","up_votes":1,"down_votes":0,"body":"lo sgherro non è una persona...si dice sia un essere, un fantasma....forse..un entità maligna, il suo unico scopo è di distruggere, annientare qualsiasi {{champion:103}} al mondo, nutre odio e vendetta verso questa ignara sexy volpe...non sappiamo da dove venga o il motivo del suo odio, sappiamo solo che non si fermerà finchè tutte le{{champion:103}} main  non saranno estinte...\n\ntempi oscuri ci attendono...","replies":[]}]}]},{"poster":"Hariberü","date":"2017-05-05T09:22:04.934+0000","up_votes":1,"down_votes":1,"body":"Ci sono molti altri champ molto forti. Ahri é nella norma, ha bisogno di beccare la combo per vincere il trade, e in tf non sempre é possibile andare addosso al carry (tank-supp lo proteggono)\nE se non prende vantaggio non oneshotta, ha meno danni di molti altri maghi.","replies":[]},{"poster":"Demigod Summoner","date":"2017-05-04T21:01:12.195+0000","up_votes":1,"down_votes":1,"body":"Ma quali danni ha ahri?","replies":[]},{"poster":"Kim114","date":"2017-05-04T18:13:00.647+0000","up_votes":2,"down_votes":2,"body":"devi essere bravo pero a usarla, non sembra ma è cosi","replies":[]}]}