{"poster":"xXCreepyLegendXx","date":"2016-02-18T16:09:56.329+0000","title":"Ryze Patch 6.3","subforum":"Champions & Gameplay","up_votes":1,"down_votes":0,"body":"Also, ich als ehemaliger Ryze Main musste innerlich weinen was den immensen nerf angeht. er hat definitiv einen gebraucht, aber doch nicht so etwas, dass den Champ zerst&ouml;rt. Naja, dazu gibts ja schon ein paar Diskussionen, ich wollte einfach mal fragen, was ihr denkt: Wie wird Riot den Champ in der   \nZukunft ver&auml;nderen oder sollte Riot das &uuml;berhaupt tun. Also ich denke Der Skillcap von 5 spells sollte bis Level 5 bleiben danach wird die passive wieder wie früher. Was meint ihr?","replies":[{"poster":"Reaz83","date":"2016-02-19T15:59:31.873+0000","up_votes":1,"down_votes":0,"body":"Hab mal eine runde mit Ryze gezockt nach dem Rework .... oh man wieder total verk. erst Sion und jetzt Ryze ... Poppy ist ok aber Ryze und Sion oh man","replies":[]},{"poster":"MeMyselfandBaal","date":"2016-02-18T17:14:49.232+0000","up_votes":1,"down_votes":0,"body":"Naja... Ryze war halt ein seltsamer Champion. Er war wohl der einzige Champ der Geschichte, der mit einer 45%igen Win Rate (über alle Elos verteilt... laut LoLking...) dringend einen Nerf gebraucht hat. \n\nDas Problem ist natürlich sein absurder Powerspike über die Passive. Die halt schwer einzuschätzen ist. Ryze kann halt plötzliche der mächstigste Champion auf der Map sein, der alles Oneshotted. Und 8 Sekunden später der schwächste Champion, der einfach nur komplett nutzlos ist...\n\nJetzt hat Riot halt erst Mal den extremen Powerspike eingedämmt, wird ihn aber als nächstes wohl Buffen. Dass die Differenz zwischen Powerspike und -tal halt nicht so krass und vor allem Nachvollziehbarer wird. Jetzt kann man halt seine einzelnen Fähigkeiten buffen, was vorher schlicht nicht möglich war. Auf dem PBE passiert das wohl schon...","replies":[]},{"poster":"Requzz","date":"2016-02-18T17:03:29.059+0000","up_votes":1,"down_votes":0,"body":"Ich hab gestern nen Ryze gespielt der alles zerstört hat und seine ult cd auf lv 17 mit glaub 40% cdr  war 10 sec ... ich finde Ryze immer noch mid-late bombe ^^","replies":[]},{"poster":"OT Riku","date":"2016-02-18T16:18:09.336+0000","up_votes":1,"down_votes":0,"body":"Also ryze musste generft werden, da sind wir uns einig. \nIch finde es ist ein gute Ansatz, auch wenn es ein harter nerf War sie mussten die passive nerfen. \nJetzt haben sie die Möglichkeit, die anderen Fähigkeiten so zu Buffen und so mit den Nerf auszugleichen ohne ihn Broken zu machen. \nSeien wir mal ehrlich das einzige was man machen musste ist die Kombo zu können.\nUnd halt das normale spielverständniss. \nRyze wird immer stärker egal ob 0/0 oder 0/5.\n\nLG Riku","replies":[{"poster":"xXCreepyLegendXx","date":"2016-02-18T16:25:33.939+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ChaosRiku,realm=EUW,application-id=Wj1wcocU,discussion-id=L0XeXVan,comment-id=0001,timestamp=2016-02-18T16:18:09.336+0000)\n>\n> Also ryze musste generft werden, da sind wir uns einig. \n> Ich finde es ist ein gute Ansatz, auch wenn es ein harter nerf War sie mussten die passive nerfen. \n> Jetzt haben sie die Möglichkeit, die anderen Fähigkeiten so zu Buffen und so mit den Nerf auszugleichen ohne ihn Broken zu machen. \n> Seien wir mal ehrlich das einzige was man machen musste ist die Kombo zu können.\n> Und halt das normale spielverständniss. \n> Ryze wird immer stärker egal ob 0/0 oder 0/5.\n> \n> LG Riku\n\nDie Combo zu können ist schwieriger als du vielleicht denkst. Und es ist etwas mehr als das. Wie kannst du dir dann sonst die niedrige Winrate Bis Gold erklären.die meisten Leute wisssen weder wie man ihn richtig spielt noch wie man ihn gefeedet countern kann.","replies":[]}]},{"poster":"I love you Malon","date":"2016-02-18T16:13:41.008+0000","up_votes":1,"down_votes":0,"body":"DMG der Fähigkeiten erhöhen...damit kommt man wieder auf die gleiche Zahlen!\nWäre eine Änderung die sich maxim wünschen würde","replies":[{"poster":"xXCreepyLegendXx","date":"2016-02-18T16:19:37.567+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=XtremBoy,realm=EUW,application-id=Wj1wcocU,discussion-id=L0XeXVan,comment-id=0000,timestamp=2016-02-18T16:13:41.008+0000)\n>\n> DMG der Fähigkeiten erhöhen...damit kommt man wieder auf die gleiche Zahlen!\n> Wäre eine Änderung die sich maxim wünschen würde\n\nallerdings, das wäre eine gute Änderung. Ryze ist zurzeit komplett useless.","replies":[]}]}]}