{"poster":"Smitty Baccal","date":"2017-11-23T07:47:42.639+0000","title":"Forced to play 25 champions in d3?? (includes all the 450 be ones)","subforum":"Gameplay","up_votes":2,"down_votes":8,"body":"I think i am at clear disadvantage playing ranked in high diamond with the lack of accessibility to champions. I am at a strategic deficit when we would need to trade/ priority pick. I am also unable to counterpick the lane i was in and unable to autofill correctly. I request a fix to give me equal chances to win my ranked games thanks riot.","replies":[{"poster":"Trollmanship","date":"2017-11-23T10:30:54.188+0000","up_votes":3,"down_votes":0,"body":"Riot: \"Solution already exists, pay us more money, easy\"","replies":[]},{"poster":"Geauxx","date":"2017-11-23T07:58:30.120+0000","up_votes":2,"down_votes":0,"body":"considering most people in d3 have solidified a role and a few champs on said role means your argument isn't all that great.\n\nur normally fighting pools of like 5 champs and people winging it when placed somewhere else.","replies":[{"poster":"Smitty Baccal","date":"2017-11-23T19:58:34.186+0000","up_votes":1,"down_votes":1,"body":"this is completly false","replies":[{"poster":"Geauxx","date":"2017-11-23T20:32:02.505+0000","up_votes":1,"down_votes":0,"body":"No it's not.","replies":[{"poster":"Smitty Baccal","date":"2017-11-23T21:17:41.630+0000","up_votes":1,"down_votes":0,"body":"they have the choice to have a low champion pool and solidified role, i dont! if i wanna play fill fill i am fucked","replies":[{"poster":"Geauxx","date":"2017-11-23T22:22:25.751+0000","up_votes":1,"down_votes":0,"body":"them having a choice on it doesn't mean anything, they still have a limited pool to maximize their gameplay, which is what the discussion was about.\n\nYou choosing how to play when to play and what to play as is also your choice. so your argument is just as much   against you as you use it against them.","replies":[{"poster":"Smitty Baccal","date":"2017-11-24T05:47:44.047+0000","up_votes":1,"down_votes":0,"body":"no because i cannot play any champions that i not own that would be better in a given situation?","replies":[{"poster":"Geauxx","date":"2017-11-24T05:58:23.134+0000","up_votes":1,"down_votes":0,"body":"So you're trying to tell me that you are being forced to play ranked before acquiring more champions? because that's what you're trying to say.\n\n\nDon't rank until you have more champions then, that's your choice, same way it's their choice to maximize their gameplay with a limited pool.\n\n\nYou aren't being forced to play with no champs in ranked. you're trying to argue that you are.\n\n\nhell, you could just try to ignore \"counter matchups\" with game knowledge and just play around that... like most people who get counter picked.... or 1 trick champions.","replies":[{"poster":"Smitty Baccal","date":"2017-11-24T07:11:27.888+0000","up_votes":1,"down_votes":0,"body":"So your telling me the best option for me is to not play ranked until i have all the champions to have the same chances as everyone who has all the champions unlocked? My point isnt that i cant, its that it shouldnt be like that.","replies":[{"poster":"Geauxx","date":"2017-11-24T07:38:39.009+0000","up_votes":1,"down_votes":0,"body":"im saying stop making a bad excuse for something you have full control over.\n\nBecause there are still people who one trick throughout challenger and they deal with all their counter picks all the time nearly everygame and still win because they have the game knowledge to work around it.","replies":[{"poster":"Smitty Baccal","date":"2017-11-24T18:59:19.506+0000","up_votes":1,"down_votes":0,"body":"thats not my point? do i have to draw you a picture jesus. What would you do if you went to a tournament with a team and oh wait we cant first pick sejuani.. cuz our player in position one doesnt own her ?","replies":[{"poster":"Geauxx","date":"2017-11-25T07:23:10.548+0000","up_votes":1,"down_votes":0,"body":"Thats yall choice for joining the tourny without said champs.\n\n\n\"im making choices but wont take responsibility\" is litterally all you're saying right now.","replies":[]}]}]}]}]}]}]}]}]}]}]},{"poster":"Cocho","date":"2017-11-23T07:54:20.192+0000","up_votes":1,"down_votes":0,"body":"Can you play 130+ champions at a diamond 3 level? lol","replies":[{"poster":"Smitty Baccal","date":"2017-11-23T19:59:05.061+0000","up_votes":1,"down_votes":0,"body":"dont need to play 130 + champions 25 tops but the problem arrive when swapping / pick order priority picks","replies":[{"poster":"TheGoomyGamer","date":"2017-11-25T07:46:28.716+0000","up_votes":1,"down_votes":0,"body":"Then... Say you don't own many champions?","replies":[]}]}]},{"poster":"Smitty Baccal","date":"2017-11-23T19:57:57.353+0000","up_votes":1,"down_votes":0,"body":"allright ill explain cuz you guys dont seem to understand. Look what just happened to me again, i am last pick and i hover MF. The first pick insta pick her because shes a priority pick rightnow. I cannot swap him, because i do not own any champion he plays, were fucked.","replies":[{"poster":"Frightning","date":"2017-11-25T07:37:27.472+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Smitty Baccal,realm=NA,application-id=3ErqAdtq,discussion-id=bP008Eh3,comment-id=0004,timestamp=2017-11-23T19:57:57.353+0000)\n>\n> allright ill explain cuz you guys dont seem to understand. Look what just happened to me again, i am last pick and i hover MF. The first pick insta pick her because shes a priority pick rightnow. I cannot swap him, because i do not own any champion he plays, were fucked.\n\nThen don't have that person pick MF for you if you can't give them something they can play. Like, tell them not to pick it for you because you may not be able to give them something they can play into their matchup. You can also unlock more champions, to help alleviate this problem.\n\nIt would be interesting if you could actually swap pick order before the ban phase (would require both player's consent to trade their pick positions, like how champ trading works now).","replies":[]}]},{"poster":"TheFallenShaw","date":"2017-11-23T09:37:49.912+0000","up_votes":1,"down_votes":2,"body":"Riot send me an email must of been meant for you,    It reads there are  120-150 champions Your Fix has already be predesigned into the game. \n\nIt's Called       \n> ** Learn and Perfect more champions. I\n\nSeriously not trying to be a Dick. Just being honest If 25 isn't a big enough Champion Pool for you, You'll simply have to expand it. Riot isn't gonna buff/nerf champions bc you can't counter pick or whatever. That's all on you and you know it. I'm bronze 5 but even I know the answer to that question. Its to practice and playmore. Not trying to tell you higher ello guys what's best, but this one was to simple. \n\nPs: Yes I know keeping in practice with those champs (25) takes a lot of ur time, but you are only D3  so until you reach challenger you can't say its the system holding you back from rising. Gotta hit the roof first :p anyway good luck.","replies":[{"poster":"Smitty Baccal","date":"2017-11-23T20:00:56.048+0000","up_votes":1,"down_votes":0,"body":"your comment is absolutly out of context as you have absolutly no idea what you are talking about","replies":[{"poster":"TheFallenShaw","date":"2017-11-24T01:40:01.457+0000","up_votes":1,"down_votes":0,"body":"well sorry , Still anyone diamond and higher that bitches about autofill should be banned. Why? bc of 1% of player base crying over and over. 99 to 98% of us if diamond is still the top 1-2% now are forced to bear a total unfun and feature that even the cry babys constantly say loses games. the majority of playerbase bronze silver and gold. Our Que times were prefectly fine back then. Close to the same now. Only now we are forced just like you tinto positions we don't know or understand enougth to play. And we my dear sir, actually do lose games over it hard. Because we make alot of mistakes and are still learning. \n\nthe top 1% nor even 10% should never dictate the direction the game goes in. It should be the majority of players. not the minority. Yet yall have turned this game since i joined in preseason 4 into a dumbed down catch up on xp with a bunge jumping rubber band mechanic in hyper mode 20min game. There was alot and I mean alot more depth to the game in season 4. It required indivual skill teamwork and build strats.    Now? teamwork and the 1 maybe 2 if theres an off meta build. No strat no indivual skill required. Soon this will be League of Minecraft","replies":[]}]}]}]}