{"poster":"MrAmbulance","date":"2017-11-12T00:23:58.990+0000","title":"Versuche eine gruppe bzw. Clan aufzubauen","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hi,\r\nich m&ouml;chte eine Gruppe aufbauen, wo sich die Leute finden k&ouml;nnen zu Normals oder Ranks. Ob ein TS oder Discord erstellt wird ist abh&auml;ngig wieviele sich melden.\r\nZiel ist es das wir eine Gruppe bilden die Flamefrei bleibt. (Tilted ist jeder mal aber dann wenn schluss ist ist schluss oder man geht von selbst um abstand zu bewahren und ruhiger wieder zu werden)\r\nWichtig ist das man Spa&szlig; hat und man Miteinander reden kann.\r\nMeist ist das Problem das man Leute hat, aber nicht alle gleichzeitig Zeit habe um ein 5er team zu bilden mit den man im ts, discord oder skyp reden kann.\r\nHier will ich eine Gruppe aufmachen, wo man Ersatzleute findet oder so auch schnell eine Gruppe sich bildet zum Spiel.\r\nGerade wenn man Englisch nicht gut beherrscht gibt es oft Streit mit anderen Spielern, weil man nicht versteht was sie wollen oder ihre Calls nicht nachvollziehen kann.\r\nDazu kommt das man sich es Gegenseitig sagen kann, was man m&ouml;chte oder was gerade los ist, ohne w&auml;rend des Spiels einen Smalltalk zu f&uuml;hren der einen hinder im richtigen Moment eine Taste zu dr&uuml;cken.\r\n\r\n**WICHTIG!!!**\r\n**18+ sollte man schon sein. Um &Auml;rger zu vermeiden.**\r\nund der deutschen Sprache m&auml;chtig sein und mindestens verstehen (im besten Falle um eine deutschsprachige Gruppe aufzubauen)\r\n\r\nMit freundlichen Gr&uuml;&szlig;en und viel Spa&szlig;\r\nMrAmbulance","replies":[{"poster":"Scrooge69","date":"2017-11-12T10:07:20.127+0000","up_votes":1,"down_votes":0,"body":"wird schwer wenn ein vocie server im vorfeld nciht vorhanden ist\n\n-meine einschätzung","replies":[{"poster":"MrAmbulance","date":"2017-11-12T10:14:18.994+0000","up_votes":1,"down_votes":0,"body":"erst mal will ich wissen wieviele da überhaupt interresse haben, weil ich schon ein ts habe, aber der ist von anderen freunden und mir und den kann ich ja nicht mit sovielen voll stopfen.XD Da haben meine freunde auch noch mitsprache recht, bzw auch rauf wollen. also für den start stehen schon plattformen berreit.","replies":[{"poster":"MrAmbulance","date":"2017-11-12T13:26:24.214+0000","up_votes":1,"down_votes":0,"body":"also wer interesse hat kann in den ts gehen: hobby-gamerz-community.de:9991\nIch ziehe euch in den channel für den start.\nLiebe Grüße MrAmbulance","replies":[]}]}]}]}