{"poster":"Hi im Yannik","date":"2016-10-28T19:27:50.223+0000","title":"Account wurde gesperrt.","subforum":"Hilfe & Support","up_votes":1,"down_votes":1,"body":"Heute komm ich von der Schule nachhause um eine Runde LoL zu spielen nur um festzustellen das ich wegen MMR boosting gebannt wurde. jetzt kommt meine frage ich bin der einzige der auf diesem account spielt und habe 1100 rankeds gespielt wer w&uuml;rde 1100 games spielen auf einem ACCOUNT der nicht seiner ist?!? ich wiederhole 1100! und nun werden mir meine rewards aberkannt und mein konto bis zur saison ende gesperrt? Hier link zu meinem acc http://euw.op.gg/summoner/userName=hiimyannik ich f&uuml;hle mich gerade ein bisschen verarscht denn immerhin hab ich 5 jahre gebraucht um diamant zu kommen nur um 2 wochen vor ende gebannt zu werden???\r\nSupport meldet sich auch keiner bitte k&ouml;nnte mir irgendjemand helfen?","replies":[{"poster":"Sidaraoxpar","date":"2016-10-28T19:30:06.766+0000","up_votes":1,"down_votes":0,"body":"Sieht für mich nach Elo Boosting aus, um ehrlich zu sein xD\n1. Sieht man das an den Sum´s","replies":[{"poster":"Hi im Yannik","date":"2016-10-28T19:32:22.436+0000","up_votes":1,"down_votes":1,"body":"???? Smite D Flash F check mal die Matchhistory?!? F=Flash in jedem game also wieso bitte kommst du da drauf?","replies":[{"poster":"Sidaraoxpar","date":"2016-10-28T19:33:10.008+0000","up_votes":1,"down_votes":1,"body":"Riot bannt nicht Grundlos","replies":[{"poster":"Stealth Cat","date":"2016-10-28T20:48:56.648+0000","up_votes":2,"down_votes":0,"body":"Also es sieht deiner Meinung nach nach Eloboosting aus, weil Riot ihn dafür gebannt hat?\nUnd was genau sieht man an seinen Summs?\n\nAnmerkung: Ich will hier nicht unbedingt den TE verteidigen, sondern nur auf den Kommentar eingehen.","replies":[]},{"poster":"Hi im Yannik","date":"2016-10-28T19:34:54.410+0000","up_votes":1,"down_votes":2,"body":"Offensichtlich schon denn ich weiß wsl warum ich gebannt wurde :) weil ein \"freund\" mich 1000 reportet hat :)","replies":[{"poster":"Nycaria","date":"2016-10-28T19:54:41.210+0000","up_votes":1,"down_votes":0,"body":"Es ist egal wie oft du reportet wirst. Wenn du was gemacht hast wirst du gebannt und wenn du unschuldig bist wirst du nicht gebannt.","replies":[{"poster":"Hi im Yannik","date":"2016-10-28T19:56:20.552+0000","up_votes":1,"down_votes":1,"body":"dude wenn ich nie etwas getan habe? ich reporte mmr booster auf regelmäßiger basis also warum sollt ichs selbst dann tun?!?","replies":[{"poster":"Spicavius","date":"2016-10-28T21:30:02.685+0000","up_votes":1,"down_votes":0,"body":"Nur um dir kurz unsere Perspektive zu erklären.\n\nHier im Forum kommt mindestens einer im Monat an, der wegen MMR boosting gebannt wurde.\nDiese Leute behaupten, dass die NIE etwas falsches getan haben.\nWir fragen diese Spieler, ob sie ihren Account irgendwann mal an jemand anderes weitergegeben haben.\nDeren Antwort lautet fast immer \"Ne ich bin der einzige, der jemals auf diesem Account gespielt hat\".\n\nSo dann schauen wir in deren Historie und merken, dass deren Beschwörerzauber ständig hin und her wechseln.\nDaraufhin kommen die mit einer Ausrede wie \"ich habe meine Tastaturbelegung in dem Zeitraum gewechelt, weil meine Tasten D und F kaputt sind.\"\n\nNach diversen weiteren Indizien behaupten diese LEute immernoch, dass sie die einzigen sind, die jemals auf diesem Account gespielt haben.\n\n\nKurz gefasst. Selbst bei ziemlich eindeutiger Lage LÜGEN diese Spieler bis die Balken biegen. Klar muss es nicht auf dich zutreffen, aber wenn bisher 99% (vermutlich gab es bestimmt einen Fall der unschuldig war kA^^ habe den dann wohl verpasst) aller gebannten zurecht gebannt wurden, dann brauchst du dich nciht wundern, wenn wir hier \"einwenig\" misstrauisch sind und lieber Riot vertrauen als den gebannten Spielern.\n\nWünsche dir Alles Gute und hoffentlich wird es sich bald aufklären. Viel Glück/Erfolg.","replies":[{"poster":"Hi im Yannik","date":"2016-10-29T06:20:38.060+0000","up_votes":1,"down_votes":0,"body":"Natürlich is es verständlich nur finde ich es unberechtigt ich spiele dieses spiel seit season 1 ich denke Jänner 2011\nIch habe so viel Zeit investiert (stundenanzahl war so um die 5885.)ich war letze season knapp an Dia drann mit einem Account der vor Kurzem gebannt wurde(toxicity) Hier der op.gg http://euw.op.gg/summoner/userName=C9+Richtofen nun tu mir denn gefallen und check die gespielten champions die runen und masterys und dir wird Auffallen das alle IDENTISCH SIND mit dem account http://euw.op.gg/summoner/userName=hiimyannik. So ich habe niemanden mmr geboostet den wenn ich dir meine support tickets zeigen würde, würdest du sehen das ich MMR booster sofort Melde wenn ich einen sehe ich tu mir sogar die arbeit an und mache alles (screenshots, ausgearbeiteter text mit beweißen usw)denn für mich gibt es nichts schlimmeres als wie wenn ich plötzlich einen bronze spieler habe der hier her geboostet wurde in meinem game habe und ich deswegen meine LP verliere. Also warum sollte ich so etwas tun?","replies":[]},{"poster":"Namlesshero","date":"2016-10-28T21:54:47.449+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Spicavius,realm=EUW,application-id=7hciEY9w,discussion-id=UEa09mGs,comment-id=0000000000000000000000000000,timestamp=2016-10-28T21:30:02.685+0000)\n>\n> Nur um dir kurz unsere Perspektive zu erklären.\n> \n> Hier im Forum kommt mindestens einer im Monat an, der wegen MMR boosting gebannt wurde.\n> Diese Leute behaupten, dass die NIE etwas falsches getan haben.\n> Wir fragen diese Spieler, ob sie ihren Account irgendwann mal an jemand anderes weitergegeben haben.\n> Deren Antwort lautet fast immer &quot;Ne ich bin der einzige, der jemals auf diesem Account gespielt hat&quot;.\n> \n> So dann schauen wir in deren Historie und merken, dass deren Beschwörerzauber ständig hin und her wechseln.\n> Daraufhin kommen die mit einer Ausrede wie &quot;ich habe meine Tastaturbelegung in dem Zeitraum gewechelt, weil meine Tasten D und F kaputt sind.&quot;\n> \n> Nach diversen weiteren Indizien behaupten diese LEute immernoch, dass sie die einzigen sind, die jemals auf diesem Account gespielt haben.\n> \n> \n> Kurz gefasst. Selbst bei ziemlich eindeutiger Lage LÜGEN diese Spieler bis die Balken biegen. Klar muss es nicht auf dich zutreffen, aber wenn bisher 99% (vermutlich gab es bestimmt einen Fall der unschuldig war kA^^ habe den dann wohl verpasst) aller gebannten zurecht gebannt wurden, dann brauchst du dich nciht wundern, wenn wir hier &quot;einwenig&quot; misstrauisch sind und lieber Riot vertrauen als den gebannten Spielern.\n> \n> Wünsche dir Alles Gute und hoffentlich wird es sich bald aufklären. Viel Glück/Erfolg.\n\nFun Fact!\n\nIch habe meinen D beschwörer Zauber auf C \n\nBei meiner Alten Tastatur war mein D Kapput und habs nie geschafft mich umzugewöhnen und nun ist es hald auf C. \nDie Beschwörerzauber sollten aber desshalb immer noch nicht switchen ;)","replies":[]}]}]}]}]}]}]}]},{"poster":"Pilze","date":"2016-10-28T20:50:42.393+0000","up_votes":1,"down_votes":0,"body":"Sagen wir es mal so. \nAm Ende jeder Saison steigen viele wie von Geisterhand eine ganze Liga auf, nicht bloß 1 oder 2 Divisionen sondern von X5 auf X5 um die Belohnung noch zubekommen. das wird bei dir wohl der Fall gewesen sein.","replies":[{"poster":"Hi im Yannik","date":"2016-10-29T06:07:59.694+0000","up_votes":1,"down_votes":0,"body":"ok zu erst einmal ich habe 90% solo gespielt und 100% dieser spiele von einer IP addresse aus wenn man es sehen könnte würd ichs versuchen zu beweißen. Wenn du einen blick in meine Matchhistory wirfst auf op.gg spiele ich fast auschließlich Jungle und dabei nur Kha oder Lee. Warum also sollte also mmr geboostet sein wenn ich mich seit über ein Monat schon in Dia Halte und ich immer mehr Tendenzen nach oben habe???\nWenn du dir die Mühe gemacht hättest und in mein Op.gg gecheckt hättest wüsstest du das ich in jedem game die gleichen runen summs/masterys  seit Februar verwende und wenn jemand boosten würde , würde er die doch sicher optimieren oder umstellen. Ich \"hatte\" einen Plat 2 Account der vor kurzem Permagebannt wurde wegen toxicity , dies war fair und ich beschwere mich nicht jedoch ist mmr boosting etwas was ich niemals machen würde außerdem reporte ich booster auf regelmäßiger basis , denn das ist meiner meinung nach das schlimmste was es gibt","replies":[{"poster":"Pilze","date":"2016-11-01T06:24:04.646+0000","up_votes":1,"down_votes":0,"body":"Jetzt habe ich mir das mal angesehen und wie zu erwarten, du spielst nicht allein mit diesem Acc. Für mich absolut berechtig der Bann.","replies":[]}]}]},{"poster":"Sirrkas","date":"2016-10-28T21:05:03.715+0000","up_votes":1,"down_votes":0,"body":"Wenn dein Account nicht geboostet wurde, besteht auch die Möglichkeit, dass dein Account gesperrt wurde, weil du andere geboostet hast.","replies":[{"poster":"Hi im Yannik","date":"2016-10-29T06:08:57.064+0000","up_votes":1,"down_votes":0,"body":"Ich booste Niemanden ich spiele auschließlich auf Accounts die mir gehören und selbst da spiel ich zu fast nur Soloq","replies":[]}]},{"poster":"Namlesshero","date":"2016-10-28T19:52:36.911+0000","up_votes":1,"down_votes":0,"body":"Der Support brauch immer 3-4 Werktage bis sie eine Antwort schreiben. Wenn du also am Donnerstag deine Beschwerde eingereicht hast kann es Durchaus bis Mittwoch gehen bis du deine Antwort hast. Bis dann kannst du ja auf deinem Smurf auf Gold hochspielen, dies sollte kein Problem für dich sein :) \n\nAusserdem sind 1100 Spiele nicht sehr viel wenn man Bedenkt dass du 5 Jahre hier bist...","replies":[{"poster":"Hi im Yannik","date":"2016-10-28T19:57:04.835+0000","up_votes":1,"down_votes":1,"body":"1100 spiele nur in dieser sasion","replies":[{"poster":"Namlesshero","date":"2016-10-28T19:57:40.400+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Hi im Yannik,realm=EUW,application-id=7hciEY9w,discussion-id=UEa09mGs,comment-id=00010000,timestamp=2016-10-28T19:57:04.835+0000)\n>\n> 1100 spiele nur in dieser sasion\n\nNa dann ^^","replies":[]}]}]}]}