{"poster":"xX TuOniichan Xx","date":"2016-03-22T20:37:31.948+0000","title":"Aclaración sobre los premios de FDM","subforum":"Torneos y Eventos de la Comunidad","up_votes":2,"down_votes":0,"body":"http://las.leagueoflegends.com/es/news/game-updates/special-event/se-caen-las-mascaras-una-vez-mas\n\nhttp://boards.las.leagueoflegends.com/es/c/charlas-generales/AmkV0eqP-estado-de-entrega-de-premios-de-la-fiesta-de-maascaras\n\nYo se que la gente aveces pasa por alto incluso lo que les conviene, pero basta con mirar un post sobre lo mismo para tener la respuesta, no hace falta llenar todo el foro con preguntas.\n\nEl premio se entregar&aacute; hasta el 23 de Marzo en la medianoche, seg&uacute;n, la publicacion de Riot al respecto.\n\nSi no haz recibido tu premio a&uacute;n, es por que no los entregan a todos al mismo tiempo, hacen oleadas de personas para entregar el premio (Por ejemplo, si ordenas a todos los invocadores en orden alfabetico, les dan a los primeros 100 el premio, una hora mas tarde, a los 100 siguientes, y as&iacute; hasta entregarles el premio a todos).  A si que tranquilidad y buenos alimentos, que todavia hay tiempo para que Riot entregue los premios, ellos dieron la condici&oacute;n y todos la dieron por entendida, ahora falta esperar, si pasado el tiempo limite impuesto por ellos no recibes tu premio, yo te ayudo a reclamar xD. Saludos.\n\nEditado: Pongo el link que ha puesto Ishek en los comentarios, sobre el update de Excalibeer por si alguien no lo vio o se le olvidó (Como a mi xD).\n\nEl plazo de las skins sigue siendo el mismo, pero, las skins de centinelas podrian tardar hasta el viernes en la mañana como fecha maxima, por una serie de problemas que ha tenido Riot.","replies":[{"poster":"Ishek","date":"2016-03-22T20:44:58.839+0000","up_votes":2,"down_votes":0,"body":"Excalibeer en un post dijo que por la cantidad de premios que eran el sistema se va a retrasar, para mañana miércoles ya deberían haber llegado las skins de campeón a todos, pero la skin de ward podría retrasarse hasta el viernes.\n\nhttp://boards.las.leagueoflegends.com/es/c/charlas-generales/AmkV0eqP-estado-de-entrega-de-premios-de-la-fiesta-de-maascaras","replies":[{"poster":"xX TuOniichan Xx","date":"2016-03-22T21:26:16.247+0000","up_votes":1,"down_votes":0,"body":"Gracias por ponerlo, habia olvidado este post xD. He actualizado arriba para que quede a vista.","replies":[]}]},{"poster":"LyghtSh","date":"2016-03-22T20:42:59.362+0000","up_votes":2,"down_votes":0,"body":"Yo aun no lo recibi, pero mirenme, matengo la calma, estoy tranquilo...\n\nPff no se lo cree nadie, me estoy comiendo la cabeza por dentro.","replies":[{"poster":"xX TuOniichan Xx","date":"2016-03-22T21:27:56.441+0000","up_votes":1,"down_votes":0,"body":"Ñam ñam ñam ñam ñam {{champion:31}}","replies":[]}]},{"poster":"Francox33","date":"2016-03-24T02:28:40.921+0000","up_votes":1,"down_votes":0,"body":"Hola! Gracias por aclarar aun no me ha llegado pero a algunos amigos con los que he jugado si les ha llegado, no tengo sanciones disciplinarias ni nada por el estilo por lo que cumplí con los requisitos del evento. Así que el skin puede llegar a tardar hasta el día 24 a las 02:59 AM. ¿No? \n ¿Si la partida se perdió, cuenta? ó ¿Sólo era jugara? \n\nEspero que me puedan despejar las dudas y ayudarme. Desde ya gracias, saludos! Francox33\n\n{{sticker:slayer-jinx-catface}}","replies":[{"poster":"xX TuOniichan Xx","date":"2016-03-24T16:34:39.155+0000","up_votes":1,"down_votes":0,"body":"Un poco tarde, pero si, bastaba con jugar con amigos, a si que probablemente ya tengas tu skin xD. Saludos.","replies":[]}]},{"poster":"elaguzz","date":"2016-03-23T09:38:06.194+0000","up_votes":1,"down_votes":0,"body":"holaa, ya se entregaron todos los premios? xD la verdad nose si me lo darian a mi, solo jugue dos partidas con 5 amigos con pj de mascaras","replies":[{"poster":"xX TuOniichan Xx","date":"2016-03-23T18:04:05.347+0000","up_votes":1,"down_votes":0,"body":"Con eso basta, solo tenias que sumar un punto para recibir todos los premios, y con lo que dices que hiciste sumaste un poco mas que eso a si que tendrias que recibir los premios de la comunidad, eso y obviamente, no haber recibido castigos en el juego.\n\nY no se si preguntaste un poco en broma, pero no xD, aún no se entregan todos los premios, hoy antes de medianoche deberiamos todos tener la caja misteriosa. Y hasta el viernes para el aspecto de centinela. Saludos :D","replies":[]}]},{"poster":"kipkeior","date":"2016-03-22T21:02:45.965+0000","up_votes":1,"down_votes":0,"body":"Vale gracias por aclararme la duda , que ya me ponía nervioso de que por qué no me llegavá nada xd","replies":[{"poster":"xX TuOniichan Xx","date":"2016-03-22T21:27:25.102+0000","up_votes":1,"down_votes":0,"body":"No te darás ni cuenta cuando ya la tengas detrás de ti....{{champion:44}} Hablo de la skin {{champion:17}}","replies":[{"poster":"kipkeior","date":"2016-03-23T05:07:19.208+0000","up_votes":1,"down_votes":0,"body":"Oh please no xD","replies":[]}]}]},{"poster":"I Qiyana I ","date":"2016-03-22T20:52:06.805+0000","up_votes":1,"down_votes":0,"body":"Riot dijo q hasta el sábado ns puede llegar xq tuvieron un problema , lean los post :/","replies":[{"poster":"xX TuOniichan Xx","date":"2016-03-22T21:28:18.348+0000","up_votes":1,"down_votes":0,"body":"Ya he actualizado, gracias.","replies":[]}]},{"poster":"Choriplanegro","date":"2016-03-22T20:42:45.220+0000","up_votes":1,"down_votes":0,"body":"ya dijeron que la entrega se demoró, y que posiblemente termine el día viernes. Hay un post hecho por Excalibeer con todo explicado","replies":[]}]}