{"poster":"xX TuOniichan Xx","date":"2016-07-30T02:16:40.923+0000","title":"¿Bug? Ryze el suicida","subforum":"Problemas Técnicos","up_votes":7,"down_votes":0,"body":"Debido a tantas veces que he visto gente que dice &quot;Estoy probando a un campe&oacute;n&quot;, desde hace tiempo que practico campeones que no se usar en partidas personalizadas contra bots xD.\r\n\r\nY en una de estas partidas, not&eacute; algo curioso. Ryze siempre termina con un score muy malo, considerando que pongo la dificultad en intermedia para los bots enemigos y en facil para los mios, para que los enemigos salgan feedeados xD, es curioso que el Ryze Bot enemigo saliera 0/15.\r\n\r\nExplico todo esto por si a alguien le interesa, sobre todo para los mas novatos, es una buena forma de practicar, y en mi caso, para probar campeones xD.\r\n\r\nEl punto es, que Ryze no recibi&oacute; cambio en su forma de jugar cuando se le hizo el Rework, o eso pienso yo. Esto hace que le haga da&ntilde;o al enemigo y cuando los tiene con poca vida, ultea. No recuerdo exactamente como era la definitiva anterior de Ryze, pero creo que si hacia da&ntilde;o, no como la de ahora, lo que hace que Ryze se meta &quot;accidentalmente&quot; bajo las torres y lo lleve a morir. Curiosamente, si yo no lo mato durante un periodo de tiempo, llega un punto en el que se queda en base y no hace nada. En otras palabras, si no recibe intervenci&oacute;n ajena a los bots, se queda en la fuente.\r\n\r\nNo he hecho mas pruebas, pero considerando que los bots de practica tienen tan mala fama por su nivel de juego, uno que se vaya directamente a suicidar no me parece util, menos que se quede AFK xD.\r\n\r\nEn resumen, no se si es un gran temerario, o el bot mas troll que he visto xD.","replies":[{"poster":"Hexplosivo","date":"2016-07-30T13:58:33.673+0000","up_votes":2,"down_votes":0,"body":"Si, es verdad.\nCon el rework de Taric no se notó, porque de hecho es más básico ahora que antes; salvo que ahora muy pocas veces usa la R con tiempo, lo usa tan al final que sus aliados suelen morir.\nRyze por otra parte antes ganaba vampirismo de hechizo y daño extra, por lo que es razonable que lo usara en situaciones de peligro, pero como no recibió ninguna actualización de inteligencia, ahora no sirve de nada, y lo apunta a donde estás parado tú por lo general, por lo que si no logra escapar su mismo ulti lo deja peor ubicado que antes.","replies":[]},{"poster":"L EVO 8","date":"2016-07-30T02:55:03.586+0000","up_votes":1,"down_votes":0,"body":"y si es troll ahora . tengo pruebas XD\nhttp://matchhistory.las.leagueoflegends.com/es/#match-details/LA2/354217427/200089484?tab=overview\nhttp://matchhistory.las.leagueoflegends.com/es/#match-details/LA2/354217551/200089484?tab=overview\n \ntrollbot confirmado XD","replies":[{"poster":"xX TuOniichan Xx","date":"2016-07-31T00:32:51.181+0000","up_votes":1,"down_votes":0,"body":"Yo le hecharia un ojo a la Kayle de la primera, que saco un nivel mas que el Ryze xDDD.","replies":[]}]},{"poster":"L EVO 8","date":"2016-07-30T02:51:06.841+0000","up_votes":1,"down_votes":0,"body":"y {{champion:76}} bot ? es otro trollbot (?)","replies":[]},{"poster":"DanielGarrita","date":"2016-07-30T02:42:00.179+0000","up_votes":1,"down_votes":0,"body":"ajajajaja me paso lo mismo hace unos dias, estaba jugando con bots y uno de mi equipo dejo ryze troll, y el ryze se te tiraba de cara y te pegaba tarde y tu lo podias deletear casi sin recibir daño, el pobre ryze ni se defendia.","replies":[]}]}