{"poster":"xX TuOniichan Xx","date":"2015-05-28T18:30:13.997+0000","title":"¿Que tipo de pagina de runas me recomiendan?","subforum":"Guias y consejos","up_votes":1,"down_votes":0,"body":"Pues eso, tengo actualmente 7 paginas de runas, pero solo 6 completas, una de ADC que ademas de da&ntilde;o, resistencia fisica y magica, tiene velocidad de ataque. Otra AD pero sin velocidad de ataque, mas da&ntilde;o a cambio (Esto es mas para tener opcion entre un AD y un AD Tank, por si acaso). Una full AP, que me da Poder de habilidad progresivo, una cantidad base de AP decente, resistencia fisica y magica, y penetraci&oacute;n magica. Una de supp, que es basicamente lo mismo que el AP pero con menos AP progresivo, aumento el AP base y la resistencia fisica y magica a cambio. Una full tank (no hace falta explicar que me da o si? xD). Una AP Tank, poco AP base pero con penetraci&oacute;n y resistencia fisica y magica. \r\n\r\nY eso seria basicamente con lo que cuento, pero siguiendo mi modo de juego y mi experiencia, me qued&eacute; algo corto con ideas para mas paginas de runas, y me quedo una sobrante. Aqui recurro a la buena gente del foro para que me guie en esta duda existencial (es sarcasmo, pero si quiero que me ayuden {{champion:32}} )...&iquest;Con tipo de pagina de runas deberia terminar? (En un futuro me gustaria tener de todo tipo de runas, para todo tipo de enemigos, pero por un tiempo, quiero terminar esta). Estaba pensando en una AD Tank, ya que la que pretendo usar para campeones como Garen, tiene a mi parecer, mucho da&ntilde;o, y en mi experiencia que no es mucha, te pickeas un Garen cuando necesitas un tanque dificil de matar (Si, es un Garen, pero dejalo que se meta al arbusto como un pokem&oacute;n y el &quot;malvado&quot; sale con mas vida que con la que lleg&oacute; a la linea xD).\r\n\r\nEn fin, que me recomiendan gente? una pagina de runa AD Tank, mas centrada en la parte de Tank? Algo hibrido? xD, no se, iluminenme, denme ideas :D (ojal&aacute; no salga alguien criticando mis runas xD, que son tacticas, estan enfocadas en ciertos campeones y no en todos, pero cubren la minoria de campeones que uso frecuentemente). Saludos {{champion:17}}","replies":[{"poster":"SenpaiDeathx","date":"2015-05-29T06:53:24.096+0000","up_votes":2,"down_votes":0,"body":"Puedes utilizar paginas con arta velocidad de ataque, un poco de daño, Ar planas y mr progresiva o de vida (Para junglas Ad).\n\nVelocidada de ataque considerable (20% mas o menos) , un poco de ap, Ar planas y mr progresivas o de vida (para jg ap, Ideales para sejuani, nautilus,gragas, etc)\n\nPaginas de runas con cd reduction, también para algunos jg que no necesita atk speed, Como lee, rengar, k6 etc.\n\n\nPuedes probar runas con vampirismo para algunos campeones como vladi, mordekaiser, etc\n\nY no se esas son las que e visto por ahi en algunos main jg o de ciertos campeones :3","replies":[{"poster":"xX TuOniichan Xx","date":"2015-05-29T14:58:21.347+0000","up_votes":1,"down_votes":0,"body":"Las de cd ruduction fueron una idea, me gusta jugar con Yi y pues...{{champion:119}} xDD.\n\nAhora tengo bastante variedad para regodearme y escoger alguna, gracias :D","replies":[]}]},{"poster":"JACKY FANBOY","date":"2015-05-28T18:42:10.894+0000","up_votes":2,"down_votes":0,"body":"http://euw.leagueoflegends.com/es/news/esports/esports-editorial/echadle-un-vistazo-nuestras-guias-de-runas-del-msi\nmira encontre esto en la pag. de lol de euw :)","replies":[{"poster":"xX TuOniichan Xx","date":"2015-05-28T21:12:23.137+0000","up_votes":1,"down_votes":0,"body":"Esta muy interesante, mas que nada por el extraño uso de ciertas cosas que no es muy frecuente xD. Gracias :D","replies":[{"poster":"JACKY FANBOY","date":"2015-05-28T22:28:52.968+0000","up_votes":1,"down_votes":0,"body":"se tambien me quede como wtf con algunas xD","replies":[]}]}]}]}