{"poster":"Dªndy","date":"2019-06-07T11:27:58.086+0000","title":"Hey, Interesse auf DuoQ? :p","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hey und schön, dass ich dich auf mich aufmerksam machen konnte. ;)\r\nDanke falls du dir diese Zeit nimmst.\r\n\r\nDamit du nun etwas zu meiner Person weißt:\r\n\r\nIch bin 21 Jahre alt. League habe ich (lass mich lügen) seit ca. 2012. Danach fasste ich das Spiel jahrelang nicht mehr an. Dennoch spiele ich aber seit letztem Jahr  im Sommer aktiv (viel Rankeds). Ich wurde damals in B1 gerankt und spielte eigentlich so gut wie nur Normals. In der Season 9 wurde ich in meinen Placements in SoloQ Eisen 2 gerankt, konnte mich bisweilen zu B2-B3 hochspielen (stieg hier 1-2 Mal auf und ab). Aufgrund der toxischen Community, zu der ich mich, wenn ich SoloQ spiele dazuzähle, suche ich einen netten und lernwilligen Mate, mit dem ich mich gar bis Gold hocharbeiten könnte. Im Großen und Ganzen mache ich sicherlich Fehler, vor allem durch Emotionen inGame, aber merke an mir vom Spielverständnis her deutliche Verbesserungen. Ich bin Talon-Main in der Mitte, habe aber trotz guten Stats nur eine 48% Winrate auf dieser Lane. Ich spiele auch desöfteren gerne die Supporterrolle als Pyke oder Lux (54% WR). Mir wäre also eine DuoQ-Botlane am liebsten in der ich auch die Adc-Rolle lernen könnte, da sie mir in der Vergangenheit auch sehr gefallen hat. Ich bin sehr variabel was die Position angeht; hauptsache wir gewinnens :D\r\nZu meinen Stärken gehört auf jeden Fall, dass ich nach Niederlagen immer wieder aufstehe und weiter versuche. Auch mein Humor xD\r\nZu meinen Schwächen gehört meine Reizbarkeit, mit der ich lernen möchte umzugehen (wo ich mich mittlerweile auch sportlicher verhalte mMn)\r\nMapawerness, Farming und Wavecontrol sind Begriffe mit denen ich mich in jedem Spiel auseinandersetze.\r\n\r\nNun hoffe ich, dass ich deine Interesse geweckt hab. Du kannst mich gerne in LoL adden ;)  Ts oder Discord habe ich nicht, da mein Mic nicht funkt, aber auf jeden Fall bin ich n großer Schreiber (im guten Sinne) :D\r\n\r\nWie beendet man hier so nen' Steckbrief?\r\n\r\nMit freundlichen Grüßen\r\nBronzie (?)","replies":[{"poster":"Dreadlord Mike","date":"2019-06-07T12:42:57.687+0000","up_votes":2,"down_votes":0,"body":"Für effektives Duoq solltest du dir wirklich ein Mic zulegen. \nIch kenne dies aus Erfahrung, wenn man duo ist aber kein mic hat ist das schon ein großer Nachteil. Meiner Meinung nach kann man dann auch soloq spielen, das macht nicht viel aus.\n\nWenn du wirklich climben willst (egal ob solo oder duo) solltest du dir max 2 lanes festlegen die du spielst.\nEin ständiger lanewechsel hindert den Climb und schmälert deine Erfolgschance.\nAußerdem solltest du dir pro Lane maximal 3 champs aussuchen die du dann nur noch spielst und sonst keinen mehr.\nWenn du weniger champs spielst und dich nichtmehr auf die mechanics konzentrieren musst macht es das Marko Play erlernen erheblich leichter.","replies":[{"poster":"SuicidePlank","date":"2019-06-07T14:18:42.426+0000","up_votes":1,"down_votes":0,"body":"Das Ding ist, Riot gibt dir ja auch etwas schlechtere Mates wenn du DouQ spielst, um die überlegene Kommunikation über Mic etc auszugleichen.\nDeshalb stellt man sich bei sowas selbst ein Bein.","replies":[{"poster":"Dreadlord Mike","date":"2019-06-07T15:04:50.581+0000","up_votes":1,"down_votes":0,"body":"Naja es nicht wirklich schlechtere Mates jetzt von den Leuten her aus, sondern einfach Mates mit lowerer MMR.\nUnd na klar, es gibt ja schon League voice(das meiner Meinung nach nicht so eine schlechte Quali hat) also braucht man nichtmal zweit oder drittprogramme haben damit man mit seinem mate kommunizieren kann.\nWer denkt dies geht mit Schrift auch, der hat sich gewaltig getäuscht. \n\nEinfach nen HS besorgen und auf gehts","replies":[{"poster":"SuicidePlank","date":"2019-06-07T15:10:05.809+0000","up_votes":1,"down_votes":0,"body":"Ich meine auch nicht ,,Mimimi scheiß Mates\" sondern wie du schon sagtest MMR, sorry für das Missverständnis. ^^","replies":[{"poster":"Dreadlord Mike","date":"2019-06-10T16:27:50.100+0000","up_votes":1,"down_votes":0,"body":"Kein ding bro.","replies":[]}]}]}]}]},{"poster":"SuicidePlank","date":"2019-06-07T11:33:52.604+0000","up_votes":1,"down_votes":0,"body":"Ist es nicht eigentlich unattraktiv wenn du drei verschiedene Rollen spielen willst, keinen Mic hast und in den Runden sehr gerne exzessiv (laut eigener Aussage bist du ja ein großer Schreiber) tippst?\nAlso nicht böse gemeint, nur neugierig.","replies":[{"poster":"Dªndy","date":"2019-06-07T14:04:58.320+0000","up_votes":1,"down_votes":0,"body":"Im Prinzip hast du da Recht. Mit den Rollen meinte ich, dass ich in Bezug auf nen Mate mich auf eine neue Rolle konzentrieren könnte, weil mich mehreres anspricht und ich mich dem anpassen wollen würde/könnte. Unattraktiv ja, aber da bin ich auch sehr ehrlich und es ist nicht gleich so dass ich unantastbar getilted bin :p Ich weiß mittlerweile auch wie Tilt die Elo runterhauen kann.. ^^\nAlles gut :D","replies":[]}]}]}