{"poster":"tikitarget","date":"2016-06-29T11:26:32.458+0000","title":"Can't purchase Riot Points","subforum":"Help & Support (OCE)","up_votes":1,"down_votes":0,"body":"I tried to purchase Rp on Monday and i got a message saying &quot;You have exceeded the maximum number of attempts at this time. Please wait 24 hours and try again later&quot;, it is now Wednesday and i still have this message. Iv&#039;e looked online for help and people had the same issue but no one had a solution. \r\n\r\nPlz halp :( i wanna waste my money on artificial stuff! {{item:3070}}","replies":[{"poster":"Wuks","date":"2016-06-29T11:41:08.353+0000","up_votes":1,"down_votes":0,"body":"Hey tikitarget,\n\nBecause this is an account-specific inquiry, we can’t help you out here on the Boards. As such, you’ll want to direct this to Riot Games Player Support by [**submitting a ticket**](https://support.riotgames.com/hc/en-us)! As you submit your request, here are some tips that will help resolve this issue as quickly as possible: \n\n1. Be sure to submit as much information in your initial ticket as possible. For obvious reasons, each Player Support Specialist's request for more information will delay the resolution of the issue.\n2. Be respectful and polite in your correspondences with Riot Support. (They're doing their best to help you!)\n3. Try not to create a new ticket or respond to an existing ticket before a Player Support Specialist has had the chance to review your request. New tickets/replies may bump your ticket back to the bottom of the queue, thus increasing the amount of time before a Player Support Specialist is able to review your ticket.  \n\n**If you're unsure where to put your ticket in, just select:**\n[*I have a question about League of Legends/Riot Games.*] > [*Game and Features*] > [*General Questions*]\n\nWith that being said, good luck!","replies":[{"poster":"tikitarget","date":"2016-06-29T11:43:46.787+0000","up_votes":1,"down_votes":0,"body":"Alright ill give it a shot, thanks for replying so quickly haha :)","replies":[]}]}]}