{"poster":"Owndby All Might","date":"2016-05-22T20:51:02.612+0000","title":"How To Scrub - League Of Legends - 4v5? Kein Problem! [GER] #11","subforum":"Streams & YouTube","embed":{"description":"Manchmal möchte ich zu den besonderen Fällen der League-Community gehen und sie umarmen ... so richtig fest. So als würde Hulk einen Ast liebevoll umschlingen. Genug rumgegaye (full-homo) Ach ja... was sagt ihr zum neuen Editier-Stil ? FaZe-Clan-B00k: https://www.facebook.com/tagteamgamingofficial Daniels Tw00tch: http://www.twitch.tv/danarudosenpai/ Le Endcardo Tracko: Anikdote - Oh Damn! https://www.youtube.com/watch?v=61HU34-mXbc","url":"https://www.youtube.com/watch?v=3dfG6ZU-cXs","image":"https://i.ytimg.com/vi/3dfG6ZU-cXs/hqdefault.jpg"},"up_votes":1,"down_votes":0,"body":"Hey Leute, wir sind TagTeamGaming :)\r\nDa wir erst k&uuml;rzlich mit YouTube angefangen haben, m&ouml;chten wir eure Meinung bzw. Kritik zu unserem neuen Video h&ouml;ren und demzufolge auch Verbesserungsvorschl&auml;ge wenn n&ouml;tig erhalten :P\r\nWenn euch das Video gefallen sollte w&auml;ren wir &uuml;ber einen Like oder ein Abo sehr froh! :3\r\nViel Spa&szlig; beim schauen! :)","replies":[{"poster":"Mari3 Ros3","date":"2016-05-24T11:03:29.662+0000","up_votes":1,"down_votes":0,"body":"habe es mir angeguckt, was haben die sexistischen bildchen im video zu tun ? nur um leute anzulocken für klicks so wie floid oder wie der heißt es macht.\nAnsonsten fehlt etwas leichte hintergrund musik und eure micros sind alles andere als gut, denn wenn ihr etwas lauter seid dann kratzt es und das nicht nur ihn den boxen sondern auch in den ohren :)\n\nWas soll eigentlich die message sein aus dem video ?\nIrgendwie komme ich nicht drauf weil ihr erst ab der Mitte das 4 vs 5 zeigt was die überschrift uns mitteilen will, wenn es das intro war, dann war es definitiv zu lange.","replies":[{"poster":"Eddii2k","date":"2016-05-26T19:58:26.308+0000","up_votes":2,"down_votes":0,"body":"Mmmhey Mari3!\nIch bin so zusagen dafür \"verantwortlich\". Das mit der Audio-Qualität ist wirklich etwas, was noch verbessert werden muss. Wie aber bereits erwähnt, kann man (oder eben ich) daran nicht so schnell was ändern. Das mit der fehlenden Hintergrundmusik war um zu sehen, ob die denn wirklich nötig ist und anscheinend ist das so. :D\nÜber Sexismus im Video zu reden ist wohl etwas ... ich sage mal - übertrieben(?)\nMan schaue sich einfach mal einige Champions in League an und dich Springen die Doppel-Ds (und größer) von alleine an.\nKeine Ahnung was du für Videos schaust, aber Gott sei Dank wird nirgends übertrieben und alles ist auf einer reellen, sachlichen Ebene. :)\nIch glaube das ist genug Rechtfertigung. :D\nAnsonsten danke, dass du reingeschaut hast und etwas Kritik hinterlassen hast. :)","replies":[]},{"poster":"Owndby All Might","date":"2016-05-24T14:35:31.795+0000","up_votes":1,"down_votes":0,"body":"Nein, die Bilder sind eine Anlehnung an die \"Dubstep-Ignites\" von dem YouTuber \"Uberdanger\" :)\nDas soll weder Clickbait noch ähnliches sein.\nFür gewöhnlich ist in den Videos auch Hintergrundmusik vorhanden, hier scheint aber scheinbar ein Fehler bei der Bearbeitung aufgetreten zu sein oder es wurde schlicht vergessen (ich bin nicht direkt für das Format zuständig ^^).\nWeiterhin solltest du beachten, dass sich nicht jeder qualitativ hochwertige Mikros leisten kann. Wir sind außerdem noch sehr kleine YouTuber und machen das alles nur aus Spaß an der Freude, deswegen haben wir noch nicht sonderlich investiert :)\n\nDie \"How 2 Scrub\"-Serie soll eigentlich ein lustiges Format darstellen, welches keine deutliche \"Message\" beinhaltet sondern eher auf Comedy geht. Der Titel soll nur etwas aus dem Video andeuten, nicht aber zwingend den gesamten Inhalt des Videos umfassen :) \nIch bin dir dankbar für die Kritik, sowas brauchen wir schließlich um uns zu verbessern :)\n~Danarudo","replies":[]}]}]}