{"poster":"HUNDarkTemplar","date":"2014-07-26T15:23:18.001+0000","title":"DerpSup über troll","subforum":"Általános beszélgetés","up_votes":1,"down_votes":1,"body":"Hali! Ha ezt a nevet látjátok rankeden akkor lépjetek ki rögtön. Már küldtem a supportnak ticketet, de nem tudom, hogy lesz e belőle valami, de megszeretném itt is osztani, hogy pontosan ki is ő és mit is tett. Tehát minap beléptem rankedezni és összedobott vele. Mondtam, hogy topra vagy jungelba szeretnék menni ( utolsó pick voltam, ő meg a 4.-ik ) és ő mondta, hogy ő supportol és én mehetek topra én meg még azelőtt mondtam, hogy remélhetőleg tudok rivenezni és nem bannolják erre ő bepickel egy rivent, majd el kezd röhögni. Mikor nekem kellet pickelni azt mondta, hogy pickeljek sorakát és cserélünk, de én itt már ki akartam lépni, de haverom mondta, hogy ne jó lesz ez. Bepickeltem sorakát és erre megint csak röhögött és nem cserélt velem. In game egész végig csak flamelt és miatta vesztettük a gamet, bár pozitív statban volt early game miatt, de a csapathoz szándékosan semmit nem tett. Magasról tett arra, hogy nyerünk e. Egész nap csak toppon és boton pusholt még akkor is, amikor már a nexusunkat ütötték. Játék után meg olyat ír, hogy mindenki milyen noob volt közben röhögött és mondta, hogy élvezte a játékot, majd én mondtam, hogy biztos vmi ebay account erre ő azt írta, hogy \"u jelly cuz iam a rich ****** who gets whatever i want from ebay and you are crying in your 3rd world country about a game\". Épp, hogy felkerült gold 5 be az account, azóta csak veszít mellesleg cs riven skinje is volt... Elég valószínű, hogy tényleg ebayes volt és nem csak mondta, de itt nem is az ebay a probléma, hanem amit leművelt. Remélem egy szép nagy permabannt fog kapni a közel jövőben, persze akkor vesz egy másik accot.","replies":[{"poster":"Zooty","date":"2014-07-26T21:20:10.330+0000","up_votes":2,"down_votes":0,"body":"Ez a fórum nem arra való hogy ujjal mutogassunk a másikra, a reportolás elegendő...","replies":[{"poster":"HUNDarkTemplar","date":"2014-07-26T21:29:51.213+0000","up_votes":1,"down_votes":1,"body":"Nem elegendő. Tudod mit fog kapni? Chat bannt kap, azért mert egy ebay accounton szándékosan veszti a ranked gameket.","replies":[{"poster":"M4dr4c","date":"2014-07-26T21:31:37.601+0000","up_votes":2,"down_votes":0,"body":"És így mit fog kapni pluszba? Ja várj, semmit.","replies":[]}]}]},{"poster":"The Feeder","date":"2014-07-27T11:13:23.464+0000","up_votes":1,"down_votes":0,"body":"Pont ma írt WookieCookie az ilyen jellegű témákról:\nhttp://forums.na.leagueoflegends.com/board/showthread.php?t=4723963","replies":[]},{"poster":"M4dr4c","date":"2014-07-26T21:30:03.841+0000","up_votes":1,"down_votes":0,"body":"Ahogy Vadhalal is mondta a naming and shaming nem menő.","replies":[{"poster":"HUNDarkTemplar","date":"2014-07-27T08:12:18.880+0000","up_votes":1,"down_votes":0,"body":"Tök mind1, hogy menő vagy nem... Egy olyan embernek, aki ilyet csinál annak nincs neve.","replies":[]}]}]}