{"poster":"Doxarez","date":"2020-01-25T20:26:12.759+0000","title":"Concepto de Campeón: Eirnos, el Cazrrecompensas Chemtech","subforum":"Creaciones de la comunidad","up_votes":8,"down_votes":1,"body":"**Apariencia**\nEirnos parece un humano, pero con aumentos chemtech que le facilitan su velocidad y le dan armas extra.\n\n[](https://media.lolusercontent.com/api/embedly/1/image/resize?url=https%3A%2F%2Flolstatic-a.akamaihd.net%2Ffrontpage%2Fapps%2Fprod%2Frg-irelia-reveal%2Fes_AR%2F799921fe5991a64214c73a22b7df421f4230b6be%2Fassets%2Fimg%2Fglobal%2Faccents%2Fpull-quote-decorator.png&amp;key=a45e967db0914c7fb472fd4381e6c85b&amp;width=425)\n\n**Stats**\nHP: 495 (+ 85 por nivel)\nDaño de Ataque: 59\nVelocidad de Ataque: 0.7 (+ 80% del Attack Speed extra por nivel)\nRegen de Vida: 4 (+ 0.45 por nivel)\nArmadura: 27 (+ 4 por nivel)\nResistencia Mágica: 25 (+ 0.5 por nivel)\nMana: 312 (+ 25 por nivel)\nRegen de mana: 6.5 (+ 0.66 por nivel)\nRango de Ataque: 575\nVelocidad de Movimiento: 325\n\n[](https://media.lolusercontent.com/api/embedly/1/image/resize?url=https%3A%2F%2Flolstatic-a.akamaihd.net%2Ffrontpage%2Fapps%2Fprod%2Frg-irelia-reveal%2Fes_AR%2F799921fe5991a64214c73a22b7df421f4230b6be%2Fassets%2Fimg%2Fglobal%2Faccents%2Fpull-quote-decorator.png&amp;key=a45e967db0914c7fb472fd4381e6c85b&amp;width=425)\n\n**Kit**\nPasiva (Aumento Chemtech):\nEirnos puede comprar el objeto \"Cañón Chemtech\" (+ 10 AD [Pasiva Única: + 5% Robo de Vida. Pasiva Única:  3% Velocidad de Movimiento] Se Vende por: 0, Se pude comprar por: 400 ) que se puede mejorar por 1200 a \"Cañon Chemtech Ver. 2\" (+ 25 AD [Pasiva Única: + 10% Robo de Vida. Pasiva Única: + 5% Velocidad de Movimiento]) el cual se pude mejorar por 1900 de oro \"Cañón Doble Chemtech\" (+ 50 AD, + 25% probabilidad de Critico [Pasiva Única: Los ataques a campeones aumentan tu Velocidad de Movimiento 1% {Acumulándose hasta 5 veces}. Pasiva Única: + 15% Robo de Vida] Se vende por: 0) o \"Lanzabombas Chemtech\" (+ 50 AD, + 30% Velocidad de Ataque, +15% Robo de Vida [Pasiva Única: Los ataques infligen 10-50 de daño máximo adicional. Pasiva Única: + 8% Velocidad de Movimiento] Se vende por: 0).\n\nQ (Dron de Ataque): [Skillshot en Linea] {CD: 12/11/10/9/8}\nEirnos dispara un dron de ataque (2 de Vida), que revela el área por donde pasa por 2 segundos y explota cuando es destruido o llega a su rango máximo, infligiendo 65/90/115/140/165 (+ 20% del AD Adicional) de daño físico. Puedes volver a activar la habilidad luego de 1 segundo para explotar al dron antes.\n\nW (Bombas Toxicas): [Punto y Click] {CD: 15/13/11/9/7}\nEirnos lanza una granada toxica a un objetivo, añadiéndole 1 acumulación de \"Granadas Toxicas\" (Duran 10 segundos). Esta habilidad contiene 3 acumulaciones que puedes usar 2 segundos después de cada una. Dron de Ataque Detona las granadas, infligiendo 50/70/90/110/130 de daño por cada acumulación de \"Granadas Toxicas\" en el objetivo. Rayo de Aturdimiento detona las granadas en un área, dañando al objetivo y a los enemigos alrededor del objetivo original.\n\nE (Rayo de Aturdimiento): [Autoataque Potenciado] {CD: 18/15/12/9/6}\nEirnos dispara un rayo que aturde al objetivo por 1 segundo y desarma a Eirnos por 0.5 segundos.\n\nR (Marca del Cazarrecompensas): Eirnos marca a un campeón y a las unidades cercanas, los ataques de Eirnos contra las unidades marcadas infligen 5/10/15% más de daño. Si un campeón marcado muere, Eirnos consigue 2/5/10% velocidad de movimiento.","replies":[{"poster":"OxYGeneSis","date":"2020-01-26T17:31:35.615+0000","up_votes":2,"down_votes":0,"body":"la R se ve como una habilidad bastante vaga y la e lo mismo, el resto me parece muy bien planteado, algo que me parecería muy buena idea es que el dron no explote, sino que vuelva al campeón al llegar a su máximo rango o reactivar volviendo a hacer daño, nose si te parece buena idea","replies":[]},{"poster":"N1GHTMA","date":"2020-01-25T22:55:12.361+0000","up_votes":2,"down_votes":0,"body":"Esta bastante bien escrito, cambiaría la pasiva, la R y tal vez la Q. La pasiva porque es como Viktor pero nerfeado (porque hay que comprar el item xD), la Q no la entendí muy bien y la R es como la de Fiora pero en vez de devolverte vida y es individual es en área.\nSacando eso de lado todo perfecto, si es para mid o top está bueno, me gusta eso de que es algo así como un Viktor AD (un aprendiz o algo). \nIntenta eso de cambiar la pasiva, la Q y la R para que se vea aún mejor este concepto bastante bueno.\nPD: Yo para el cumpleaños de una amiga le hice un campeón completo (LOL), era algo así como una diosa del amor y fue bastante divertido hacerla XD. Me alegra saber que no soy el único que hace conceptos de campeón, me gustó tu idea de presentarlo al público para que den su opinión.","replies":[{"poster":"Doxarez","date":"2020-01-25T23:47:31.996+0000","up_votes":1,"down_votes":0,"body":"Gracias por la critica.\nLa idea es que en vez de comprar objetos de Doran, comprara el objeto que le da su pasiva y 2 pociones.\nCuando llegue a la R ya no tenía muchas ideas, pero tengo una idea, la R puede ser que detona una mega bomba toxica que planta en un campeón, ese campeón toma daño adicional de sus ataques y cuando el campeón muere, inflige daño a su alrededror y ralentiza al enemigo\n\n:3\n\n- Doxarez \"El Noob\"","replies":[]}]},{"poster":"Doxarez","date":"2020-01-25T20:27:17.188+0000","up_votes":2,"down_votes":2,"body":"Dejen sus criticas aqui\n{{sticker:sg-lulu}}","replies":[{"poster":"UNKNOWSER","date":"2020-01-26T11:46:38.181+0000","up_votes":1,"down_votes":0,"body":"obligame","replies":[{"poster":"Doxarez","date":"2020-01-26T12:33:14.821+0000","up_votes":1,"down_votes":0,"body":"{{sticker:sg-janna}}","replies":[]}]}]}]}