{"poster":"Alekra","date":"2016-09-27T17:49:50.090+0000","title":"[Champion-Konzept] Drade, Hüter der Engel (Version 2.0)","subforum":"Skin- & Champion-Konzepte","up_votes":1,"down_votes":0,"body":"**Hallo Legends!**\n\nWillkommen zu meiner zweiten Version meines neuesten Konzepts :3\nIch hoffe ihr habt Spa&szlig; und ich bitte euch, beim Bewerten die Zahlen nicht zu beachten sondern nur die F&auml;higkeiten/Ideen an sich.\n\n**Die erste Version :3**\n\nhttp://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/OgVUynl3-champion-konzept-drade-der-hater-des-engels\n\nFun Fact: Ich hatte zuerst die Idee f&uuml;r diese Geschichte, und fand sie dann so cool (Ich meine die Grobe Geschichte ^^ Ich kann nicht gut schreiben), dass ich unbedingt einen Champion dazu machen wollte :P\n\nFangen wir an.\n\n**~&Auml;nderungen~**\n\n1. Ver&auml;nderte Passive\n2. Komplett neue F&auml;higkeiten\n\n**~Geschichte~**\n\nLangsam ging die T&uuml;r zu meinem Zimmer auf. Es war dunkel. Nur eine einzige Kerze am Fensterbrett erleuchtete das Zimmer. Es war wieder einmal ein Arzt. Ich lag wie immer unter einem Stapel decken auf meinem Bett. Ich wei&szlig; nicht wie lange ich schon da lag. Vor langer Zeit hatte es angefangen...\nMir wurde oft schwindelig und manchmal konnte ich meine Hand nicht mehr Bewegen.\nInzwischen war es noch viel schlimmer. Ich konnte meine Augen nicht mehr richtig &ouml;ffnen. Ich hatte durchgehend Fieber und es geschah nicht selten, dass ich den halben Tag bewusstlos war.\nSeit beginn meiner Krankheit waren schon viele &Auml;rzte in mein Zimmer gekommen. Sie sahen in meinen Mund, begutachteten meine Augen oder den Hals. Dann gingen sie wieder. Drau&szlig;en werteten meistens eine Frau und ein Mann. Sie schienen sich sorgen um mich zu machen. Ich erkannte sie jedoch nicht. Ich wusste ja nicht einmal wer ich war.\nIch wusste nur eines: Ich war wichtig. Fast jeden Tag kamen irgendwelche Menschen in mein Zimmer und brachten irgendwelche Sachen. Manche sahen aus, als k&ouml;nnte man sie &ouml;ffnen, andere wiederum lie&szlig;en &uuml;berhaupt keinen Sinn erkennen.\nIch hatte nichts von diesen Sachen. Ich konnte mich nicht bewegen.\nEines Tages, kam eine alte Frau in mein Zimmer. Sie war einfach an den Wachen vorbeigegangen. Doch irgendetwas war seltsam an ihr. In der Dunkelheit schien ihre Silhouette sich mit den Schatten zu vermischen. Ich fragte mich ob ich jetzt komplett den Verstand verloren hatte. Zuerst beachtete ich sie nicht. Doch dann erschrak ich. Sie war nicht allein. Hinter ihr schwebte ein Engel. Er war gut drei Meter gro&szlig;. Er hatte eine silberne R&uuml;stung an und ihr Gesicht war von einem ebenfalls silbernen Kriegshelm verdeckt. ich konnte das Gesicht nicht erkennen. So sehr ich mich auch anstrengte. Sie hatte ein blaues Mal am rechten Handr&uuml;cken. Sie kam direkt vor mein Bett und sah mich an (Zumindest ging ich davon aus, dass sie mich ansah). Sie streckte langsam ihre Hand aus. Ich bekam Panik. So sehr ich wollte, ich konnte mich nicht bewegen oder schreien.\nIn der selben Sekunde, in der sie mich ber&uuml;hrte, sp&uuml;rte ich eine Welle der W&auml;rme durch mich hindurchrasen. Ich sp&uuml;rte wie mein geschwollenes, verfaultes Fleisch heilte und meine Schmerzen nachlie&szlig;en.\nIm gleichen Moment schien die Haut der Frau zu zerfallen und zu verwesen. Sie heilte mich und gab daf&uuml;r ihre eigene Gesundheit auf.\n\nAm n&auml;chsten Morgen war die Frau verschwunden.\nVerwundert sah ich mich um, als ich in der Ecke den Engel entdeckte. Ich erschrak furchtbar und sprang auf. Ich brach sofort wieder zusammen. Ich konnte mich bewegen! Ich h&ouml;rte Schritte im Gang und schrie nach Hilfe. Doch alles was aus meinem Hals kam war ein leises kr&auml;chzen. Doch die Person schien es dennoch geh&ouml;rt zu haben. Es war ein Arzt. Er starrte mich mit offenen Mund an. Noch ein paar Minuten bewegte er sich. Und das ziemlich schnell. Er rannte aus dem Zimmer. Nach ein paar Minuten kam er wieder. In Begleitung. Es war das P&auml;rchen, welches ich schon oft vor meinem Zimmer gesehen hatte. Es waren meine Eltern.\nIn den n&auml;chsten Wochen, redete ich viel mit meinen Eltern.\nIch lernte sehr bald, dass ich ein Sohn einer Adelsfamilie in Demacia war.\nIch war seit meiner Kindheit erkrank, konnte jedoch dank eines Privatlehrers am Anfang mit normalen Sch&uuml;lern mithalten. Doch ich hatte l&auml;ngst aufgeh&ouml;rt mitzulernen. Es ging einfach nicht\nUnd jedes Mal, wenn ich auf den Engel in meinem Zimmer zu sprechen komme, schweigen sie. Sie sehen mich immer besorgt an und tuscheln irgendetwas. Das machte mich w&uuml;tend, aber ich f&uuml;hlte, dass es besser war, nicht dar&uuml;ber zu reden.\nEs war leicht neue Freunde zu finden. Jeder wollte mit mir befreundet war, da ich nun mal Adelig war. Jedoch war es nicht schwer zu erkennen, dass sie nicht wirklich meine Freunde waren. Sie tuschelten und sie erz&auml;hlten sich gegenseitig komische Geschichten &uuml;ber mich.\nIch wurde zwar nicht ausgeschlossen, dennoch w&uuml;hlte ich mich alleingelassen. Darum sprach ich oft mit dem Engel in meinem Zimmer. Er redete nicht, aber er h&ouml;rte zu (Falls er &uuml;berhaupt etwas h&ouml;ren konnte). Ich wusste nicht warum, aber er verlie&szlig; nie mein Zimmer.\n\nEines Tages jedoch, stellten mich meine Eltern zur Rede. Sie machten sich sorgen, da ich oft Selbstgespr&auml;che f&uuml;hre und von einem Engel spr&auml;che.\nMir wurde klar: Sie hielten mich f&uuml;r einen Psychopaten. Meine Familie, Freunde und Bediensteten im Haus.\nIch wurde Traurig.\nIch ging nur noch wenig aus dem Haus, sprach nicht mehr viel mit meiner Familie und brach die Schule ab. Ich hatte es satt! Was ich jedoch tat, war mir Gedanken &uuml;ber mein Leben zu machen. Man k&ouml;nnte doch etwas R&uuml;ckhalt meiner Familie erwarten! Doch meine Eltern behandelten mich wie einen gest&ouml;rten. Nicht einmal sagten sie ein Wort der Entschuldigung, des Tr&ouml;stens oder der Aufmunterung.\n\nIch stand am Turm unseres Anwesens. Weit unter mir: Der Marktplatz der Stadt.\nIch wollte springen. Einige Menschen bemerkten mich auf dem Rand des Turmes und riefen aufgeregt. Bald schon hatten sich locker drei Dutzend Menschen - Inklusive meiner Familie - unten angesammelt.\nJede wusste was ich vorhatte. Keiner wollte mich hindern. Ich nahm tief Luft und lief mich fallen. Ich erwartete, dass die Menschen unter mir anfangen w&uuml;rden zu schreien. Doch nichts passierte. Die Menge sah mir schweigend zu wie ich fiel. Doch unten in der Menge erblickte ich etwas. Es war der Engel.\nDoch das war mir egal.\nIch blickte dem Steinboden trotzig entgegen. Im selben Moment &ouml;ffnete der Engel seine Fl&uuml;gel...\n\n**~Allgemeine Infos~**\n\nDrade ist ein Teenager mit extrem blasser Haut. Er tr&auml;gt eine Wei&szlig;e Kutte mit Goldenen Verzierungen. Er k&auml;mpft mit heiligem Licht (Fernkampf) und dem Engel. Er solle ein Supporter oder Toplaner sein. \n\nhttp://img5.fotos-hochladen.net/thumbnail/unbenanntj546lscpeq_thumb.jpg\n\nDrade benutzt Mana, ich werde jedoch die Kosten nicht dazuschreiben.\n\n**~F&auml;higkeiten~**\n\n**Passive: Heiliger Begleiter**\n\nDrade&#039;s Schutzengel begleitet ihn wohin er auch geht. Er schwebt &uuml;ber ihm.  Er unterst&uuml;tzt Drade indem dieser +15% HP aus allen Quellen bekommt. Dieser Bonus wird als Hellblauer Balken angezeigt und Drade diesen verliert, bekommt er +10% Laufgeschwindigkeit und 20% Angriffsgeschwindigkeit bis dieser wieder Regeneriert ist. Der Bonus hat seine eigene Lebensregeneration die 120% der Basislebensregeneration von Drade betr&auml;gt. Drade verliert logischerweise immer das Bonusleben zuerst.\n\nIst Drade am Spawn, wird der Balken nat&uuml;rlich sofort aufgeladen.\n\n**Q: Bestrafung (15/14/13/12/11 Sekunden Abklingzeit)**\n\nDrade schie&szlig;t ein Geschoss aus purem Licht. Es verursacht an allen getroffenen, gegnerischen Vasallen 40/80/120/160/200 + 40% AD normalen Schaden. Champions erhalten 50% des Schadens und der erste getroffene Champion wird markiert. Nach 2 Sekunden st&uuml;rmt der Engel zum markierten Ziel (Egal wo es sich befindet) und verursacht mit einem Schweren Schwertschlag 80/105/130/155/180 + 60% AD normalen Schaden. Danach kehrt er wieder zu Drade zur&uuml;ck.\n\n**W: Schutzengel (22/21/20/19/18 Sekunden Abklingzeit)**\n \nDer Engel wirft sich Projektilen in den Weg die auf Drade gefeuert werden. Dieser Verwurzelt sich. Seine Richtung kann nicht mehr ge&auml;ndert werden (Wie Braum Schild). Er wehrt Projektile f&uuml;r 1,5 Sekunden ab und verursacht dann in einem Kegelf&ouml;rmigen Bereich 50/60/70% des Schadens den die Projektile angerichtet h&auml;tten. An allen Gegnern.\nEr verursacht den Schaden nach 1,5 Sekunden oder nachdem 5 Geschosse (Inklusive Automatische Angriffe) abgefangen wurden. W&auml;hrend dieser F&auml;higkeit kann der Engel nicht mit weiteren F&auml;higkeiten interagieren (Q ohne Markierung, E ver&auml;ndert sich).\n\n**E: Guten Flug / Blendende Woge (18/17/16/15/14 Sekunden Abklingzeit)**\n\nDer Engel st&uuml;rzt sich in eine Richtung. Trifft er einen gegnerischen Champion oder ein episches Monster, wirft er diesen/s f&uuml;r 1 Sekunde in die H&ouml;he und schmettert ihn/es wider zu Boden. Dies verursacht beim Hochwerfen und beim Herunterschmettern jeweils 20/40/60/80/100 normalen Schaden + 40% AD.\n\nSollte sich der Engel in seiner W befinden, verwandelt sich diese F&auml;higkeit in **Blendende Woge**. Drade schei&szlig;t eine Rechteckf&ouml;rmige Woge aus Licht. Alle getroffenen Gegner werden f&uuml;r 1,5 Sekunden um 20/30/40/50/60% verlangsamt und geblendet.\n\n**R: Garde der Engel (150/140/130 Sekunden Abklingzeit)**\n\nGrade verwurzelt sich selbst f&uuml;r 1 Sekunde und kann w&auml;hrenddessen keine anderen F&auml;higkeiten einsetzen. Nach dieser Zeit, kommt f&uuml;r jeden Champion mit dem sich Drade verbunden hat, ein Engel herab. Diese gew&auml;hren jedem betroffenen Verb&uuml;ndeten die Bonusleben der Passiven. Diese Engel bleiben f&uuml;r 3,5 Sekunden.\n\nNun kann diese F&auml;higkeit reaktiviert werden. Die Engel werden zu einem Geschoss, welches nun auf einen beliebigen Ort innerhalb 1000 Einheiten geschossen werden kann. Beim Aufprall verursacht dieses an allen Gegnern 30/40/50 + 15% AD magischen Schaden pro Engel und schleudert alle Gegner 500 Einheiten vom Aufprallort weg. Danach verschwinden die Engel.\n\nSollte diese F&auml;higkeit nicht reaktiviert werden und die Zeit sollte auslaufen, verschwinden die Engel und die Verb&uuml;ndeten, welche diese Engel hatten bekommen f&uuml;r 2 Sekunden einen Schild in H&ouml;he von 30/40/50&amp; ihres Maximalen Lebens der sich schnell abbaut.\n\n**~Nachwort~**\n\nHal&ouml;le ^^ Ich hoffe es hat euch gefallen! Ich hab mich diesmal richtig ins Zeug gelegt um euch heute ein paar komplett neue F&auml;higkeiten zu Pr&auml;sentieren :3\n\nSchreibt mir unten hin, wie es euch gefallen hat. Freue mich immer &uuml;ber Kritik und Verbesserungsvorschl&auml;ge.\nUnd bitte nicht nach den Zahlen abstimmen :D Die kann man noch jederzeit &auml;ndern. \nBewertet nur nach dem Champ/der Idee an sich.\n\nDankesch&ouml;n und habt noch einen Wundersch&ouml;nen tag! {{sticker:slayer-jinx-catface}} \n\nMfg. Alekra","replies":[{"poster":"Wrakhr","date":"2016-10-12T11:34:30.260+0000","up_votes":1,"down_votes":0,"body":"verändere lieber die ult ein wenig. ich glaube kaum, dass ein 3000 Leben Schild auf Mundo so ne gute Idee ist. Aber das Konzept ist echt gut.","replies":[{"poster":"Alekra","date":"2016-10-12T12:25:27.042+0000","up_votes":1,"down_votes":0,"body":"Naja nicht so schlimm wie ne Kayle Ult :P Aber danke :3","replies":[]}]},{"poster":"Don Xernias","date":"2016-09-27T20:19:56.050+0000","up_votes":1,"down_votes":0,"body":"Die Rolle scheint hier noch nicht ganz klar, zum einen besitzt der Champion sehr viel Schaden vorallem auf der Q (zu viel), zum anderen ist der Supportcharakter auch ausgeprägt. Nun stellt sich die Frage, soll man AD bauen oder Supportlastig","replies":[{"poster":"Ontarion345","date":"2016-10-11T21:38:02.604+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Don Xernias,realm=EUW,application-id=L7E6lhzo,discussion-id=LkzKH0Ok,comment-id=0000,timestamp=2016-09-27T20:19:56.050+0000)\n>\n> Die Rolle scheint hier noch nicht ganz klar, zum einen besitzt der Champion sehr viel Schaden vorallem auf der Q (zu viel), zum anderen ist der Supportcharakter auch ausgeprägt. Nun stellt sich die Frage, soll man AD bauen oder Supportlastig\n\nBesser wäre es wenn die w keinen Schaden mehr anrichten würde und nur als schutzschild dienen würde. Auch die q scheint mir sehr stark, welche eher als ult funktionieren könnte","replies":[]},{"poster":"Alekra","date":"2016-09-27T20:25:28.732+0000","up_votes":1,"down_votes":0,"body":"Der Schaden der Q wurde verringert ^^Und es ist doch nichts schlechtes dabei, dass man man ihn AD, Supportlastig und vielleicht auch irgendwie Full Tank bauen kann ^^ Ist doch toll, wenn es einen Champion gibt, der mehrere Rollen einnimmt. Ich denke die Frage wie man ihn bauen soll, hängt von jedem einzelnen ab.","replies":[]}]},{"poster":"xKoramis","date":"2016-10-01T08:24:18.318+0000","up_votes":1,"down_votes":0,"body":"Ich finds schade dass ich mir Drade wie einen Engel aus HotS vorstellen muss :/ da kann ich auch Tyrael spielen ....","replies":[{"poster":"Alekra","date":"2016-10-01T09:18:13.603+0000","up_votes":1,"down_votes":0,"body":"Tut mir leid :/ Aber ich wollte einfach, dass jeder weiß wie der Engel aussieht. Drade ist nicht der Engel :P","replies":[]}]},{"poster":"LikeaGünter","date":"2016-09-28T18:41:30.934+0000","up_votes":1,"down_votes":0,"body":"Ich finde es super Nice zu sehen wie dieses Game so viele Leute inspiriert. Gerade in deinem Text steckt sehr viel Zeit das merkt man.\nschöne Geschichte aber wer war die alte Frau im Zimmer ?  Falls du mir antwortest du die bitte im game an GerJeff schicken weil dieser Acc leider gebannt ist und ich die daten vom neuen nicht im kopf habe ha ha und ach ja mein lieblingssatz \"Woge. Drade scheißt eine Rechteckförmige Woge aus Licht.\"  ha ha zu genial wenn man aufmerksam liest :P \nlg Jeff :P","replies":[{"poster":"Alekra","date":"2016-09-28T20:16:40.688+0000","up_votes":1,"down_votes":0,"body":"Schön, dass es dir gefällt ^^ Aber warum sollte ich dir die Antwort auf einen anderen Account schicken? Dubkannst doch anscheinend mit diesen schreiben.","replies":[{"poster":"LikeaGünter","date":"2016-09-30T15:20:36.279+0000","up_votes":1,"down_votes":0,"body":"Jap wenn ich auf Arbeit bin ha ha aber passt so und wer war nun die alte ?","replies":[{"poster":"Alekra","date":"2016-09-30T16:29:52.312+0000","up_votes":1,"down_votes":0,"body":"Würde ich wollen, dass jeder ihre Identität kennt, würde ich es nicht verheimlichen ;)","replies":[]}]}]}]},{"poster":"Bariados","date":"2016-09-29T12:50:30.656+0000","up_votes":1,"down_votes":0,"body":"\"Drade scheißt eine Rechteckförmige Woge aus Licht.\" ich glaub das sollte schießt heißen XD aber sonst schön gemacht :)","replies":[{"poster":"Alekra","date":"2016-09-29T15:39:29.569+0000","up_votes":1,"down_votes":0,"body":"Haha sry xD werds aber spaßeshalber lassen.\n\nUnd danke :)","replies":[]}]}]}