{"poster":"Blast4ssWithYas","date":"2017-02-06T22:32:53.933+0000","title":"check your internet connection","subforum":"Champions & Gameplay","up_votes":2,"down_votes":3,"body":"Habe jetzt zwei Games hintereinander den gleichen Error bekommen. Nach Champion select st&uuml;rtzt das Spiel direkt ab und nach mehrfachen Neustart des Spiel passiert nix ausser das es immer wieder nich Reagiert. Hab jetzt mal gechillt deshalb die Promos abgezogen bekommen weil ich zweimal &quot;afk&quot; war. Ist halt doof wenn man kein Internet hat, obwohl man im gleichen moment ein Youtube Video guckt und zuvor noch auf Steam ein Spiel runtergeladen hat.\r\n\r\nIch erhoffe mir mehr solcher fehler und freue mich auf mein n&auml;chstes ranked game das ich dank dc verliere. Riot als Entwickler m&ouml;chte ich noch begl&uuml;ck w&uuml;nschen das sie grob 1,6 milliarden USD im jahr verdienen und diese effektiv auf Kaffemaschinen und das programmieren von mehr Yasuo Bugs einsetzten. Ebenfalls gef&auml;llt mir das nerfen von champions die nicht gepickt werden wie z.B. Jayce oder Rengar anstatt von Akali oder Syndra die beide ab level 6 das spiel alleine gewinnen (das hei&szlig;t wenn man &uuml;berhaupt ins Spiel connecten kann). Auch das full ap Brand support bestehen kann, jedoch tank Yasuo sofort komplett entfernt wurde f&auml;llt mir positiv auf, insbesonders da man eben mal von 100% auf 30% an leben nach einer combo fallen kann.\r\n\r\nIch bedanke mich f&uuml;r die verlorenen promos und hoffe weiterhin kein internet zu haben den das -ohne internet- youtube gucken war unterhaltsamer als der wei&szlig;e Ladeschirm.\r\n\r\n{{champion:157}} {{item:3070}}","replies":[{"poster":"Crounty","date":"2017-02-06T23:57:10.804+0000","up_votes":2,"down_votes":0,"body":"so many flavours and you chose to be salty QwQ","replies":[]},{"poster":"Wekra","date":"2017-02-07T10:16:01.721+0000","up_votes":1,"down_votes":0,"body":"Hatte das Problem letztens auch, genau wie du beschrieben hastund hatte auch eigentlich Internet.\n\nDas Problem ist deine Firewall, die die eingehende Verbindung sofort blockiert.\n\nAlso nicht Riots Schuld, wenn das passiert stelle die Firewall aus und du kannst connecten, danach kannst du sie direkt wieder anstellen","replies":[{"poster":"nox5555","date":"2017-02-11T09:58:04.307+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Wekra,realm=EUW,application-id=Wj1wcocU,discussion-id=XA0JBjMM,comment-id=0001,timestamp=2017-02-07T10:16:01.721+0000)\n>\n> Hatte das Problem letztens auch, genau wie du beschrieben hastund hatte auch eigentlich Internet.\n> \n> Das Problem ist deine Firewall, die die eingehende Verbindung sofort blockiert.\n> \n> Also nicht Riots Schuld, wenn das passiert stelle die Firewall aus und du kannst connecten, danach kannst du sie direkt wieder anstellen\n\nAndere spiele haben solche probleme nicht, WOW zeigt mir nur keine internet verbindung an wenn ich keine internet verbindung habe oder deren server down sind, nicht einfach random.  da kann ich auch vor nem match kurz auf den desktop gehen ohne angst haben zu müssen dass das spiel nicht läd. und das matchmaking ist besser, und das belohnungs system ist besser. eigentlich macht WOW alles besser als rito, und ich denke die beiden schwesterspiele davon machen es ähnlich... allerdings kann ich nicht länger als 40 minuten am stück schifffahren ohne durch zu drehen.","replies":[]},{"poster":"Blast4ssWithYas","date":"2017-02-07T14:56:46.375+0000","up_votes":1,"down_votes":0,"body":"Hab ich schon vor langem ausgestellt das verbindungen geblockt werden, kann also nich daran liegen","replies":[]}]},{"poster":"vexaris","date":"2017-02-07T18:26:42.285+0000","up_votes":1,"down_votes":0,"body":"Der Fehler kam bei mir vor dem letzten Patch regelmäßig....meißtens waren danch bots im Spiel mit dabei.....hab dann einfach über den Task Manager alle lol Prozesse beendet und das Spiel neugestartet....umständlich zwar nur konnte ich danch in jedes Spiel nach joinen.","replies":[]}]}