{"poster":"Dragonlayer","date":"2015-04-15T14:12:37.354+0000","title":"Motivo de ban en foros","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"De que manera puedo saber el motivo de un ban en el foro :S\r\n\r\npreguntandole a un rojo? o en el perfil sale un mensaje :S\r\n\r\nel usuario que busco es &quot;wertyx&quot; que fue baneado sin razon xD como no puede postear me dijo que lo hiciera por el","replies":[{"poster":"Sir DaL","date":"2015-04-15T15:27:47.961+0000","up_votes":3,"down_votes":2,"body":"Hola!\nwertyx coloc un mensaje en charlas generales referente a comportamiento y emparejamiento\n\n**La respuesta del moderador fue:**\nEntendemos tu punto de vista, pero por favor este tipo de mensajes se deben crear en el foro de \"\"Comportamiento del jugador\"\" http://boards.las.leagueoflegends.com/es/c/comportamiento-del-jugador \nAllí podrás colocar temas sobre trolls, afk, flamers, emparejamiento, sanciones, chat restringido o malas experiencias por culpa de otros, pero recuerda que esta prohibido denunciar con sus nombres o capturas de pantalla. Para eso tienes el botón \"\"Reportar\"\" dentro del juego.\n\nNo fue un verdadero baneo, solo un \"aviso\" de 24 horas sobre las reglas del foro\n\n¿Como podemos saber las razones de baneo?\nAl lado de nuestro icono de invocador, arriba a la derecha dle foro hay un signo de \"!\" color celeste\n\nHacemos click y nos dará un historial de los mensajes que nos borraron y de las sanciones que recibimos\n\nMe confirmarías si wertyx puede ver su notificación de forma correcta? \n\nNo se preocupen, el mensaje de tu amigo no fue algo con \"mala onda\" solo le dieron ese aviso para que lea las reglas y tengamos un foro ordenado pero jamas de banearia a una persona de forma permanente o por largos períodos de tiempo por esos motivos :)\n\nSaludos con bigote\n{{champion:201}}","replies":[{"poster":"Ch4puLin","date":"2015-04-15T15:49:30.165+0000","up_votes":2,"down_votes":2,"body":"Es curioso como son tan celosos para banear o penalizar gente por UN solo post incorrecto, y no toman la misma actitud para con una persona que comete una falta comprobada en el juego.\nEs realmente más importante para uds lo que pasa en el foro que en el juego? Porque claramente no siguen la misma lógica.","replies":[{"poster":"Revolución","date":"2015-04-15T15:50:57.963+0000","up_votes":2,"down_votes":1,"body":"El sistema de baneo en el foro es totalmente diferente y está sostenido por moderadores que son gente ajena a las revisiones de comportamiento dentro del juego.","replies":[{"poster":"Ch4puLin","date":"2015-04-15T22:18:39.090+0000","up_votes":1,"down_votes":0,"body":"Es claro que no son iguales, es lo que digo en el post.\nA vos no te parece que deberían aplicar la misma lógica en ambos casos? \nUna ofensa en el foro => penalización (como está ahora, y está perfecto)\nUna ofensa en el juego => penalización también. (esta claro que dista mucho de ser así)","replies":[]}]}]},{"poster":"Ministevo","date":"2015-04-15T23:14:49.667+0000","up_votes":1,"down_votes":0,"body":"¿Y no pueden simplemente mover el post a otra sección?\nComo lo hizo Riot Condor en el anterior foro cuando movió un post de Charlas Generales a Off-Topic (comentando sobre el cambio) que no me acuerdo de que trataba.","replies":[]},{"poster":"Jonshi","date":"2015-04-15T20:06:57.757+0000","up_votes":1,"down_votes":0,"body":"Porque \"aviso\" entre comillas, señor Dal?\nToma porogalleta asi merendas algo {{item:2052}}  :v","replies":[]}]},{"poster":"Texter Redrum","date":"2015-04-15T14:14:25.722+0000","up_votes":2,"down_votes":0,"body":"Nadie es baneado sin razón.","replies":[{"poster":"Revolución","date":"2015-04-15T14:29:20.701+0000","up_votes":2,"down_votes":2,"body":"yo fui baneado sin razón una vez, luego la suspensión fue removida y recibí una notificación pidiendo disculpas.","replies":[{"poster":"Desaroll","date":"2015-04-15T14:58:08.328+0000","up_votes":6,"down_votes":0,"body":"Eres un tiramisu malvado. Era obvio que sospecharían de ti...\n\nTu mirada te delata (?)","replies":[]}]}]},{"poster":"waffen SS","date":"2015-04-15T14:50:59.923+0000","up_votes":1,"down_votes":2,"body":"desde q estoy en el foro tengo mas tiempo baneado de lo q estoy sin banear","replies":[{"poster":"Revolución","date":"2015-04-15T14:53:06.875+0000","up_votes":4,"down_votes":0,"body":"pero está más que justificado, he leído muchas de las razones de que te baneen","replies":[]}]},{"poster":"Natchin","date":"2015-04-19T01:18:09.063+0000","up_votes":1,"down_votes":0,"body":"En los foros te pueden bannear prácticamente por ninguna razón, yo he sido banneado 2 veces sin tener idea por qué, revisen mi historial de mensajes, nunca publico cosas ofensivas y trato de ser bastante constructivo.","replies":[]},{"poster":"RNGesus","date":"2015-04-15T17:22:45.304+0000","up_votes":1,"down_votes":0,"body":"Cuando te quejas del emparejamiento desbalanceado te banean xD","replies":[]},{"poster":"Runth","date":"2015-04-15T17:06:37.138+0000","up_votes":1,"down_votes":0,"body":"Soporte y ahi te dira su sancion, ya que esta bugeado las notificaciones, de seguro esta incompleto su javacripts xd","replies":[]},{"poster":"Time Lord","date":"2015-04-15T14:26:05.747+0000","up_votes":1,"down_votes":0,"body":"Probablemente malas palabras, insultos o bien algo ofensivo, son los motivos más comunes de ban en el foro.","replies":[]}]}