{"poster":"Uriel","date":"2018-08-29T15:07:02.450+0000","title":"How did this disgusting act become a trend in just a few hours?","subforum":"Player Behavior","up_votes":6,"down_votes":0,"body":"So, the Nunu rework came out today, and so many people will obviously want to play Nunu jungle. But ever since this update hit, my elo (silver) is getting absolutely disgusting.\n\nEvery time a Nunu doesn&#039;t get the role they wanted, they keep spamming /all chat with the location of the actual jungler. At first I thought this was just one game... until I saw this happens with literally (no exaggeration) EVERY Nunu player so far that I see their role being contested by their own team, and proceed to solve their issue by throwing the game and start griefing (Deliberate counterproductivity).\n\nHow did this happen so fast already? This is just disgusting behavior to have your game thrown by. It&#039;s childish and doesn&#039;t solve anything at all. And we can't dodge games forever either.","replies":[{"poster":"TheKingOfBiches","date":"2018-08-29T16:15:55.602+0000","up_votes":3,"down_votes":0,"body":"People act like toddlers *every time* there's a new champion/rework in the first few weeks.you just have to deal with it unfortunately,and make sure your reporting the troll behavior","replies":[{"poster":"Uriel","date":"2018-08-29T17:51:23.060+0000","up_votes":1,"down_votes":0,"body":"fair enough, but this didn't happen with other champs like Pyke or Akali. And it was really weird to see ALL of them betraying jungler locations too. The exact same behavior.","replies":[{"poster":"Silent Gravity","date":"2018-08-29T18:57:47.774+0000","up_votes":3,"down_votes":1,"body":"That behavior is a 14 day ban, if properly detected, so make sure you report them for assisting the enemy team.","replies":[]},{"poster":"ﬂoo","date":"2018-08-31T14:05:35.858+0000","up_votes":1,"down_votes":0,"body":"The most recent jungler reworked/released was Eve, all others were visible bc they are played on lane so it wouldn't make sense.","replies":[]}]}]},{"poster":"TheSnowyLeopard","date":"2018-08-29T16:28:32.801+0000","up_votes":2,"down_votes":0,"body":"because nunu is the oldest champ to troll on. and therefore you have some hard inters. they will die down in a week BUT, the \"this is a dead game\" posts will rise up in a week cause they cant have their way. sad and predictable really.","replies":[]},{"poster":"Oleandervine","date":"2018-08-29T15:07:58.766+0000","up_votes":2,"down_votes":1,"body":"Why don't they play him support? He's got enough CC and lane pressure in his kit to make a very viable support.","replies":[{"poster":"SLAYER94","date":"2018-08-29T15:24:59.108+0000","up_votes":1,"down_votes":0,"body":"i was thinking the same thing. as a support main when i saw his update his kit struck me as something that could be used as a support character in the right settings","replies":[{"poster":"Oleandervine","date":"2018-08-29T15:26:33.328+0000","up_votes":1,"down_votes":0,"body":"He's technically always qualified as a support, it's just that now he's actually got viable tools to make that a reality.","replies":[{"poster":"Bijeesny","date":"2018-08-30T09:40:09.743+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Oleandervine,realm=NA,application-id=ZGEFLEUQ,discussion-id=3swNY50R,comment-id=000000000000,timestamp=2018-08-29T15:26:33.328+0000)\n>\n> He&#x27;s technically always qualified as a support, it&#x27;s just that now he&#x27;s actually got viable tools to make that a reality.\n\nHe's not good as a support. I tired to play him, i played against nunu supp. It's only possible if you play against bot lane without any CC","replies":[{"poster":"Oleandervine","date":"2018-08-30T13:07:27.974+0000","up_votes":1,"down_votes":0,"body":"He suffers just as much as literally any other melee tank support against CC, so I don't get your point. Melee tanks' largest weakness IS CC, so to claim that Nunu support is bad because he has the same weaknesses as other tank supports is absurd.\nI've used him a couple of times now as a support, and I've done very well. He's got great engage and lockdown, and if your ADC can capitalize on the chaos you can create, they can leave with multiple kills.","replies":[{"poster":"Bijeesny","date":"2018-08-30T13:38:08.360+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Oleandervine,realm=NA,application-id=ZGEFLEUQ,discussion-id=3swNY50R,comment-id=00000000000000000000,timestamp=2018-08-30T13:07:27.974+0000)\n>\n> He suffers just as much as literally any other melee tank support against CC, so I don&#x27;t get your point. Melee tanks&#x27; largest weakness IS CC, so to claim that Nunu support is bad because he has the same weaknesses as other tank supports is absurd.\n> I&#x27;ve used him a couple of times now as a support, and I&#x27;ve done very well. He&#x27;s got great engage and lockdown, and if your ADC can capitalize on the chaos you can create, they can leave with multiple kills.\n\nBut unlike other supports he doesn't have a good engage. Do you think W is a good engage? Literally throw any cc while he's doing it and he's done. I played Xerath supp against him and he was able to land only one W in the laning phase, and that was because I missed my stun. Even his E is bad because you need to hold them several seconds in your range, which is hard to do if your enemies are decent players (and by decent i mean they have hands)\nIt might be a good pick, but only in some matchups, and even then there are other supports who can do the same thing as him but better","replies":[{"poster":"Oleandervine","date":"2018-08-30T13:44:28.324+0000","up_votes":1,"down_votes":0,"body":"Again, you're claiming that CC is what's holding him back, when, as I stated above, _every single tank support_ gets their balls kicked into their teeth by being CC'd. Nunu is not special here, he falls flat on his face to CC just like Leona, Braum, or Alistar.\nHe's fine as a support.","replies":[]}]}]}]}]}]},{"poster":"Uriel","date":"2018-08-29T15:37:36.919+0000","up_votes":1,"down_votes":0,"body":"*shrugs* you tell me","replies":[{"poster":"Praetor Notorias","date":"2018-08-29T22:26:32.382+0000","up_votes":1,"down_votes":0,"body":"I played him support before the rework so I'm curious to see how it goes.","replies":[]}]}]},{"poster":"Telephone Booth","date":"2018-08-30T23:05:18.483+0000","up_votes":1,"down_votes":0,"body":"Just kids being kids on the internet, where theres no one to really keep em in check. Not really their fault... their parents just want some alone/quiet time, so hey, whatever keeps em busy!","replies":[]},{"poster":"Sauvagess","date":"2018-08-30T13:27:33.671+0000","up_votes":1,"down_votes":0,"body":"That's literally the example of \"assisting enemy team\" in the griefing option of the report card.","replies":[]},{"poster":"derbish","date":"2018-08-29T22:20:28.505+0000","up_votes":1,"down_votes":3,"body":"Cause this is LoL.... why are you expecting anything different... its the same thing whenever a new hero comes out, ppl play them out of roll and dont care who they piss off... welcome to LoL\n\n\nBTW playing an off role champ and completely throwing the game IS NOT a reportable offence","replies":[{"poster":"SanKakU","date":"2018-08-30T02:02:26.636+0000","up_votes":1,"down_votes":0,"body":"A lot of the Pyke players weren't inting. They were inting when someone else picked Pyke. We had Pykes some good and some bad in every slot possible. Nunu being in 'wrong slot' isn't what he's complaining about. He's complaining about them not only being in wrong slot but picking on their own allies in all chat and making the game hard for their own team by betraying them.","replies":[]},{"poster":"Uriel","date":"2018-08-30T02:14:13.176+0000","up_votes":1,"down_votes":0,"body":"I wasn't talking about that. I was talking about giving the enemy your team mate's location. (betraying gank opportunities, etc)","replies":[]},{"poster":"LeftyRaydy","date":"2018-08-30T19:38:52.440+0000","up_votes":1,"down_votes":0,"body":"giving away your junglers position to the enemy is literally assisting the enemy team.","replies":[]}]},{"poster":"Summonah12369","date":"2018-08-29T20:20:00.518+0000","up_votes":1,"down_votes":0,"body":"I remember an annoying ass Lux that spammed fall back pings THE ENTIRE GAME, without stopping... reason? There was no given reason.","replies":[]}]}