{"poster":"Samus Saran","date":"2017-11-14T02:25:12.689+0000","title":"Preseason Smurfer überall?","subforum":"Champions & Gameplay","up_votes":2,"down_votes":17,"body":"Was ist los im Ranked zurzeit?\nNach minute 5 feeden alle auser ich in meinem Team...als w&uuml;rde ich st&auml;ndig nur gegen Smurfer selectiert und bekomme st&auml;ndige Vollnoobs ab....\n\nDas ganze ist zurzeit st&auml;ndig jedes Ranked und kotzt mich schon richtig an...als w&uuml;rden alle Platiner die Runen in Low Elos testen....\nVor der Season habe ich gut geclimbt easy aber jetzt nur noch abstürze einer nach dem anderen nach 20+ Games ohne das ich die Hauptschuld habe.\n\nSpiele sehr gut aber carrien gegen 4-5 Smurfer? -Null Chanche!\nVollkommener Bullshit mit du musst besser werden.\nAls ob man gegen 5 Snowballer gewinnen kann in diesem neuen Format der Snowballer.\n\n","replies":[{"poster":"Necromant","date":"2017-11-14T07:49:37.167+0000","up_votes":8,"down_votes":1,"body":"Beschwert sich über Smurfer - postet mit seinem eigenen Smurf.\nGuter Troll!","replies":[]},{"poster":"Qbert","date":"2017-11-14T06:21:48.511+0000","up_votes":6,"down_votes":2,"body":"Dann poste doch mal mit deinem Main... dann kann man sich deine Spiele auch anschauen ... auch ob du \"sehr gut\" spielst.\nAnsonsten verweise ich dich auf die tausenden anderen Wein-Threads, die sich darüber beschweren, dass immer nur sie die ganzen Noobs im Team haben.","replies":[{"poster":"Uranbrennstab","date":"2017-11-14T07:59:04.028+0000","up_votes":2,"down_votes":1,"body":"Hmhm... Wein... Ich empfehle süßen Rotwein eins zu drei mit Schwarzbier gemischt.","replies":[{"poster":"Qbert","date":"2017-11-14T08:03:54.581+0000","up_votes":1,"down_votes":2,"body":"DU holst dir gleich mal den Schlüssel für den Weinkeller ab! >O","replies":[{"poster":"Uranbrennstab","date":"2017-11-14T08:32:29.463+0000","up_votes":1,"down_votes":2,"body":"Hast du auch Schwarzbier da?","replies":[{"poster":"Qbert","date":"2017-11-14T08:36:05.846+0000","up_votes":1,"down_votes":1,"body":"um ehrlich zu sein, nein ... ich habe nur Wizz-Key :(","replies":[]}]}]}]}]},{"poster":"iwannadolucyliu","date":"2017-11-14T02:30:46.315+0000","up_votes":2,"down_votes":1,"body":"wenns 5 snowballer im gegnerteam sind müssen ja im umkehrschluß 5, wie du sagst, vollnoobs in deinem team sein xD","replies":[{"poster":"Samus Saran","date":"2017-11-14T02:33:34.909+0000","up_votes":2,"down_votes":2,"body":"Nope die feeden sich an meinem Team eher Satt....\nUnd dann nach Minute 20 bekomme ich die Snowball Keule ab und verliere unweigerlich.\n\nSteht nicht selten \"X:16\" in Minute 10 und ich habe 0 tode.....","replies":[{"poster":"Amycos Cyrus","date":"2017-11-14T09:30:48.877+0000","up_votes":4,"down_votes":0,"body":"Jetzt mal ganz ehrlich.\nEgal wie gut oder schlecht du bist. Die Chance, dass im gegnerischen Team \"Noobs\" sind ist einmal größer als in deinem (4 Fremde in deinem 5 im gegnerischen Team) und wenn du dich als so gut darstellst, DANN FEEDE DICH GEFÄLLIGST AN DIESEM \"NOOB\" HOCH, wenn du das brauchst um zu gewinnen.\nWeiterhin ist das ganze ein Teamspiel: heißt: Wenn du es schaffst nach 10 Minuten mit 0 Toden darzustehen ist das toll, aber wenn du merkst, dass Lanes Probleme haben => ROAMEN IST NICHT VERBOTEN!!! also hilf deinem Team doch. Auch wenn es vielleicht dazu führen kann, dass du stirbst. (Hier ebenfalls wieder Möglichkeiten an deinen feed zu kommen)\n\nIm Endeffkt ist es ebenfalls so, dass gemittelt über alle Spiele und Spieler die Chance zu gewinnen bei 50% liegt => Willst du häufiger gewinnen, musst du MIT deinem Team besser spielen.\n\nPS: Den Kommentar mit deinem Smurf zu verfassen war eine Glanzleistung, denn ich glaube das dir so keiner deine Story abkauft. (Vorallem weil es wohl so einfach sein muss gegen dich zu gewinnen, wenn du deine Spiele so oft verlierst)\n{{sticker:slayer-jinx-wink}}","replies":[{"poster":"Samus Saran","date":"2017-11-14T10:01:32.042+0000","up_votes":2,"down_votes":3,"body":"- Problem hab auch meine eigene Lane zu handhaben wenn ich gegen Smurfer spiele der mich hart Counterpickt:\nz.B. Kata < Kassadin, Garen < Kayle, Zyra < Azir.  Wenigstens sterbe ich dabei nicht und kann so gut es geht farmen.\n\n- Zum anderen werde ich hochprofesionell gegankt vom Jungler die unkonventionelle Wege gehen die man nicht aus der Low Elo kennt deren Timing immer passt (fast wie im TS abgesprochen), wie z.B. Top von Hinten durch den Turret, obwohl Control Ward und meine Map Awarness on Duty sind.\n\n- Auch wissen diese Leute immer richtig gut bescheid auch ohne Wards wann Drache/Herold wir versuchen, ja das war bis letzte Woche noch ganz anders da wars denen völlig egal als wären die Dornrösschen auf Ihrer Lane...\n\n- Roamen tue ich auch selbstverständlich sobald es möglich ist aber meistens schläft mein Team trotz 5 Pings und/oder die Gegner wissen immer bescheid wies in hoher Elo üblich ist.\n\n- Mein Team immer kloppen und fighten muss egal was.....lassen sich baiten...sind zu greedy...wie mans so kennt....\n\n- Alle andren Lanes gleichzeitig feeden im synchron....\n\n- Einen TF gibt es nicht... ab dem Zeitpunkt nenne ich eher es nen Blutbad.....\n\n- Ich tue schon was ich kann, aber ich kann nicht allen überall gleichzeitig helfen, dabei meine Lane vernachlässigen, meine CS, und dabei noch ner Nami in meinem Team davon abhalten auf Bruiser zu tun.....\n\n- Und ich das mit nem Smurf poste grade weil ich weniger konstruktive Beratung als puren Dislike/Troll/Spamm-Posts bekommen würde wies üblich ist in dieser Community.\n\n- Der Hauptpunkt ist das war vor einer Woche noch alles anders....darum poste ich ja das ja..also was geht ab in Preseason?? Sind nur noch Smurfer da um neuen Runen zu testen?","replies":[{"poster":"Qbert","date":"2017-11-14T10:05:42.285+0000","up_votes":4,"down_votes":2,"body":"> •Und ich das mit nem Smurf poste grade weil ich weniger konstruktive Beratung als puren Dislike/Troll/Spamm-Posts bekommen würde wies üblich ist in dieser Community.\n\nLächerlich.\nDu nörgelst rum (wie so viele), dass immer nur die anderen Schuld sind. Deine Teammates sind alle schlecht, du bist total toll und deine Gegner sind sowie so nur Smurfs aus deutlich höherer Elo.\nDu solltest dir eingestehen, dass du vielleicht nicht so gut bist, wie du glaubst. Sicher werden auch mal Smurfs auftachen. Aber die sind eher die Ausnahme, statt der Regel.","replies":[{"poster":"Amycos Cyrus","date":"2017-11-14T20:24:09.357+0000","up_votes":4,"down_votes":2,"body":"Außerdem sollte man auch konstruktive (An-)Fragen stellen, um konstruktive Antworten zu erhalten.\n\nJetzt mal Punkt für Punkt Pro und Contra deiner Liste von \"Argumenten\":\n\n1. Vom Smurf counterpicked:\nErst einmal sensationeller Beginn (Applaus hier einfügen).\nNun erst einmal ist, die Chance, dass du vor dem gegnerischen Spieler gleicher Lane pickst genauso groß wie umgekehrt. (Nutze das auch aus !!!)\nwenn es dir so wichtig ist nicht countergepickt zu werden, sofern du VOR dem Gegner gleicher Lane pickst, dann:\n * lass entweder dein Team für dich picken (sodass dein Pick nach dem gegnerischen folgt) picke Champions\n * picke Champions, die schwer gecountert werden können (Lanebullies) bzw. Champs, die du so gut beherrscht, dass du auch mit einem Chounterpick zurechtkommst ohne ausrechende Freiheiten zu verlieren.\n\n2. Hochprofessionelles Gank-Pattern des Gegners:\nErst einmal: Wenn du wirklich so gut bist, wie du dich hier propagandierst solltest du mit dem Gank-Pattern, wenigstens nach dem ersten Gank des Junglers zurechtkommen. (Jungle-Tracking üben hilft ebenfalls. Inklusive Warding)\nWenn es dir so schwer fällt den gegnerischen Jungler zu tracken, dann (Das würde ja auch deinem Team helfen (Gefahren-Pings usw.)):\n * Übe und erzeuge ein für dich passendes Warding-Pattern\n(z.B. 3:00-3:05 Ward Topside-Bush, wenn gegnerische Botlane gepullt hat, usw.)\n * Übe Informationen über Sichtungen und auch über Sichtmangel zu erhalten (gilt auch für Roamende Supporter und Teleport der Toplaner)\nSichtmangel (z.B. Der Jungler wurde bis ~5:00 nicht gesehen => Er hat einen Level-4-Clear durchgeführt und befindet sich auf der Seite seines Starts, oder \"Klassiker\" ein Laner fehlt am Spielstart => Jungler wird von ihm gepullt)\nSIchtung (z.B. Der Jungler gankt deine Lane 3:00/Lv. 3 von der Topside, startete aber Botside und kommt ohne Doppelbuff => Er hat den Buff, die Raptoren/Wölfe und die Topside-Krabe gemacht.) => Du kannst somit auch seinen Weg nach dem Gank vorhersagen und eventuelle Folgeganks pingen.\n\n3. Die organic Objective-Relevanz ist gestiegen:\nGanz ernst: Keine Ahnung. Ich will nicht bestreiten, dass es sein könnte, da vor allem die Low-Tier Objectives (Drachen und Herald), die mit unter starken Defizite der Preseason kompensieren können.\nDennoch auch hier:\n * Auch wenn es keine Wards des Gegners gibt, ist es klar, dass der Mangel an 2 bis 3 Gegnerischen Champions jedem signalisieren sollte, dass die nicht nur zeitgleich backgeportet sind. Ich diesem Spiel ist nichts unberechenbar (Flachwitz FTW), aber auch hier: Falls du Probleme mit Teamfightsituationen hast, die semi-überraschend eintreten (wie gesagt überraschend ist gar nichts), dann stellst du zu wenig Control-Wards (hier auch das Team darum bitten ab und zu einen zu platzieren.) Aus der Support- oder Midlane-Position empfiehlt sich auch das Red-Trinket.\n * Vorbereitung: Man kann nur sehr selten irgendeinen Profit aus nicht geplanten Engages gewinnen (und sowohl das Beginnen als auch das Contesten von Objectives kann als Engage betrachtet werden). Somit stellt immer sicher, dass der Gegner ein Risiko eingehen muss, wenn es euch beim Drachen oder Herald engagt.\n(z.B. Wavemanipulation, Splitpush oder Vision)\n\n4. Roaming scheint berechenbar:\nHierzu kannst du technisch gesehen den Punkt 3 noch einmal lesen, denn auch Roaming muss durch Warding vorbereitet werden und es sollte auch immer darauf geachtet werden, dass ein Augenblick der Sicht des Gegners, der zeigt wie du nicht Backportest, sondern die Lane verlässt, ausreicht, um das gegnerisch Team zu Warnen. (Nutze das aus !!!)\nBezüglich mangelndem Follow-Up des eigenen Teams:\n * NIE Engagen, wenn Verbündete nicht follown können.\n * NIE Engagen, wenn Verbündete nicht engagen wollen.\n * NIE Engagen, wenn du nicht sicherstellen kannst, dass der eigene Lanekontrahent nicht ebenfalls roamen kann. (Lane auspushen + Warding)\n\n5. Das eigene Team fightet nur:\nGanz ernst, sei doch froh drüber, denn dieses Verhalten kann vor allem am Anfang des Spiels in deine Karten spielen.\n * Mehr Farm für dich (Vor allem die Jungle-Camps nahe deiner Lane)\n * Geringeres Risiko für unbemerktes gegnerisches Movement (Denn die Kämpfe binden auch die Gegner an einen festen Ort)\n * Möglichkeiten des Punishments gegenüber den Gegnern: Splitpush Objective-Control und Warding sind deutlich einfacher.\n * Nutze die low gewordenen disengagenden Gegner, um die selbst zu feeden UND ermögliche auch den Ressourcenzugriff deines Teams (nicht alles Kill-Stealen bitte)\n\n6. Alle Lanes feeden synchron\nErst einmal, wenn du nicht Jungler bist, hast du dich gerade ins Aus geschossen (XD)\nNutze auch das zu deinem Vorteil (auch wenn ich stark bezweifle, dass dieser Zusand \"immer\" auftritt)\n * Fordere den deinen Jungler auf deine Lane zu ganken, denn für ihn gilt häufig der Klassiker \"Never gank a losing Lane\". Wenn du deine Lane nicht verlierst, sollte das ja nicht so schwer mitzuteilen sein.\n * Beim roame, wenn es dir möglich ist mit dem Jungler => Botlane 4v2 Fight maximal 4v5 Fight und dein Toplaner hat ne freie Lane zum Pushen (Siehe Punkt 3 und 4) / => Toplane 3v1 Fight maximal 3v3 Fight, wodurch deine Botlane nicht den Druck eines möglichen Ganks empfindet + Support kann warden gehen.\n\n7. Ein TF gibt es nicht. => Blutbad\nSuper Aussage, aber wer will den bitte von dir erwarten, dass du überall bist?\nHier heißt es ganz klar, wenn es bis hierhin gekommen ist, dann liegt es auch an dir !!! \n\n8. Das ist jetzt etwas viel auf einmal:\n (8.1.) \"überall gleichzeitig sein\"\nSiehe Punkt 7 und du sollst nicht überall sein, sondern aus deinen Möglichkeiten das Maximum machen (bestenfalls) => (z.B. Wenn du nicht roamen kannst, dann roame nicht, aber wenn du roamen kannst, dann orientiere dich an Punkt 6)\n (8.2) Lanevernachlässigung und CS:\nErst einmal CS ist nicht alles, wenn es für das Team mehr bringt, dass du roamst dann beweg dich, egal ob da CS sind oder nicht!\nDas Tower-Trading ist bis in die Challenger-Elo ein weit verbreitetes Phänomen, dass ebenfalls beachtet werden sollte. Heißt, wenn du Roamst kümmer dich auch um dessen Erfolg (Siehe Punkt 4)\n (8.3) \"Das Nami auf Bruiser tut\"\nAuch wenn es eventuell in deinen Augen nicht nachvollziehbar ist oder wie \"falsch\" es auch sein mag, aber das Itembuild deiner Verbündeten geht dich einen feuchten Kericht an. Wenn sie es für Notwendig halten Nami mit Geistessicht und Thornmail zu bauen, dann sollen sie das tun. (Wenigstens stirbt sie nicht so schnell XD)\nAber wo wir gerade dabei sind. Das eigene Spiel wird häufig extrem durch Kritik und Kommentar von Freund oder Feind beeinflusst. Das heißt:\n * Sobald das Spiel begingt, hast du NICHTS und das heißt ABSOLUT ÜBERHAUPT NICHTS in den Chat zu schreiben. Demotivation, wie auch immer sie geartet ist schwächt dein Team.\n * Mute den Chat und bestenfalls auch die Emotes, um nicht durch dein Team oder die Gegner getriggert zu werden, denn auch du wirst von so etwas beeinflusst.\n\n9. \"Smurf Post wegen Angst vor Kritik beliebiger Art\"\nDazu einfach nur folgendes (Subjektives):\n * Wie schon gesagt: Konstruktive Antworten folgen nur auf konstruktive An(Fragen)\n * Weder du noch irgendwer anderes (Selbst wenn es der Kaiser von China wäre) hat das Recht pauschal eine so umfangreiche Community, wie diese, die so ambivalent und von so vielen grundsätzlich verschiedenen Menschen geformt wird, so zu beleidigen. (Auch wenn ich in deiner Grammatik und Formulierung verstehen kann, weswegen du eher mit der problematischeren Seite der Community konfrontiert wirst. (Übe lieber noch mal Argumentation)\n * Du kriegst auch mit deinem Smurf die Dislikes/Trolls/Spam die du erwartet hast, also warum so Prüde?\n\n10. \"Das war vorher noch alles anders\" \"Sind nur noch Smurfs unterwegs?\"\nJetzt mal ganz im Ernst! Nur weil du die ganzen Spieler nicht mehr anhand ihrer Masteries oder strategischen Tiefen strukturieren kannst, heißt es nicht, dass nur Smurfs rumlaufen. Die Community ist nicht von einem Tag zum anderen besser geworden. Alle testen die Runen, versuchen mögliche Itembuild-Changes und suchen ideale Möglichkeiten wie sie mit den umfangreichen Änderungen klar kommen können.\n=>Also wenn irgendetwas sich geändert hat, dann sind eher alle schlechter geworden, da die Variabilität des Alten Runen&Mastery verloren gegangen ist und die Champs auf bestimmte Wege geschoben wurden (entsprechend den Stat-Anpassungen von Patch 7.22)\n\n___\nUnterm Strich\n___\n\nAlle müssen mit dem neuen System noch Umgang lernen, allerdings scheinst du dich glaube ich zu sehr darauf zu fokussieren und vernachlässigst Basics, wie Warding-Pattern und Punishments\n\nMfG. Amycos Cyrus\n\nPS: Bitte übe auch noch das Anwenden der deutschen Sprache, denn es ist teilweise echt anstrengend deine Kommentare zu lesen.\n{{sticker:slayer-jinx-unamused}}","replies":[]}]},{"poster":"Time2Whine","date":"2017-11-14T10:48:46.704+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=Samus Saran,realm=EUW,application-id=Wj1wcocU,discussion-id=jbtrG2ai,comment-id=0000000000000000,timestamp=2017-11-14T10:01:32.042+0000)\n>\n> - Und ich das mit nem Smurf poste grade weil ich weniger konstruktive Beratung als puren Dislike/Troll/Spamm-Posts bekommen würde wies üblich ist in dieser Community.\n\nLiegt es eventuell daran, dass deine hoch angepriesenen Stats doch nicht so krass gut sind wie von dir behauptet? Dir scheint nicht bewusst zu sein, dass es hier Wannabe's in Massen gibt, weil sie meinen dass sie doch Challenger verdienen, aber es sowas von verdienen in Bronze/Silber zu sein. \nDein eigener Skill ist die Basis für eine Diskussion wie diese hier, denn wenn du bspw. schlechte Stats hast, fragwürdige Itembuilds gehst, schlechten Farm hast und dann über deine Mitspieler herziehst, weil du ja weit über denen stehst, wird dich hier niemand ernst nehmen können. Ganz nach dem Motto \"Wer im Glashaus sitzt, sollte nicht mit Steinen werfen\". Daraufhin wirst du mit Sicherheit den ein oder anderen bösen Spruch kassieren, aber die wären gerechtfertig, denn jemand so hart zu kritisieren für etwas was man selber nicht kann, zeugt nicht gerade von guter Selbsteinschätzung.\nSpielst du allerdings gut, dann wirst eher fundierte Rückmeldungen bekommen, denn dann kann schon eher über die Mitspieler diskutieren. Jedoch ist das Empfinden, das die Mitspieler immer Schuld sind in den meisten Fällen sehr subjektiv.\n\nAls kleines Beispiel eines Mitbeschwörers:\nhttps://boards.euw.leagueoflegends.com/de/c/allgemeiner-chat-de/dQ8mLT6m-was-war-die-laangste-niederlagen-serie-die-ihr-durchlebt-habt-lol-quit-inside-lollol\n\nEr hat seine Elo auf seine Mitspieler geschoben die ihn zurückhalten und wo steht er? Bronze 5 mit einer 42 % Winrate und dann zu meinen die Mitspieler sind Schuld grenzt schon an Dummheit.","replies":[{"poster":"Samus Saran","date":"2017-11-14T11:27:43.612+0000","up_votes":2,"down_votes":3,"body":"Wieso wollen alle auf meine States und mir jedesmal die Schuld geben...unterlasst das bitte....darum habe ich nie gebeten.....\n\nIch sagte doch mehrfach das es so alles bis vor der Preseason NICHT so war sondern alles extrem leicht war beim climben. \nDer Absturz passierte eben mit Preseason..anstatt mir darauf antwort zu geben nur solche Hater-Troll-Spam Posts.....","replies":[{"poster":"Time2Whine","date":"2017-11-14T13:22:58.168+0000","up_votes":4,"down_votes":2,"body":"Du kapierst es nicht oder? Wie sollen wir beurteilen ob es wirklich Smurfs waren gegen die du gespielt hast? Wie sollen wir beurteilen ob dein Team wirklich so grottenschlecht war und hauptschuld an den Niederlagen hat wie du es behauptest? Wie sollen wir beurteilen ob es nicht doch an deiner eigenen Leistung lag dass ihr verloren habt?\n\nWie sollen wir das alles beurteilen wenn wir gar keine Informationen haben weil du uns deinen Accountnamen nicht nennst? \n\nWas sollen wir deiner Meinung tun? Dir ein Taschentuch reichen um deine Tränen zu trocknen? Dir sagen dass alles gut wird in deinem Leben und es auch wieder bessere Zeiten geben wird? Was willst du für antworten hören?\n\nUnsere Aussagen haben nichts mit Trollen oder Haten zu tun sondern einfach dass uns wichtige Infos fehlen um deine Situation in irgendeiner Art und Weise beurteilen zu können.\n\nTut mir Leid aber die leicht negative Stimmung kommt daher, dass solche QQ-Threads wie deiner hier in endloser Zahl existieren und in den meisten Fällen sind nicht die Mitspieler das Problem sondern der Spieler selbst, der nicht einsehen kann oder will dass er das Problem ist. Wir sind hier was das angeht leider ein gebranntmarktes Kind. \n\nNiemand gibt dir hier die Schuld, wie denn auch ohne Spielinformationen deinerseits? Du stellst als Überschrift eine Frage die wir ohne Informationen nicht beantworten können und forderst eine konstruktive Beratung? Wie soll das gehen? Du gehst doch auch nicht zum Arzt und antwortest auf seine Frage was dir denn fehlt mit: \"Das sage ich dir nicht, aber ich will dass du mir hilfst\" Du merkst schon dass das keinen Sinn macht oder?","replies":[{"poster":"Amycos Cyrus","date":"2017-11-14T20:48:48.755+0000","up_votes":2,"down_votes":2,"body":"Das Endbeispiel ist godlike.\nAuch wenn der Kommentar die angesprochene negative Konnotation deutlich präsentiert, würde ich sagen TIME2WHINE du triffst den Nagel auf den Kopf","replies":[]}]},{"poster":"Amycos Cyrus","date":"2017-11-14T20:45:15.407+0000","up_votes":2,"down_votes":1,"body":"Deine Kritikfähigkeit: -100% XD\nDeine Konstruktivität: 0%\n\n1. Deine Stats sind für unsere Argumentation (und somit für die von dir gewollte Konstruktivität) von Bedeutung. Da ist es absolut sch... egal, ob es dir leicht gefallen ist zu climben oder nicht. Du beziehst dich auf die Spiele nach Preseason-Start also lass uns auch nur auf diesen Rahmen Bezug nehmen und nicht auf irgendetwas dimensionsloses, was du unbegründet (und durch den Post als Smurf für uns nicht prüfbar) in den Raum gestellt hast.\n\n2. Du und nicht deine Teamkollegen haben um Antwort gebeten, also bist DU auch derjenige auf den sich die Argumente und Antworten beziehen. Wenn du das als \"Schuld\" siehst, warum postest du dann überhaupt?\n\n3. Hater-Troll-Spam-Posts: Ganz ernst so wie du dich hier aufspielst, sei froh, dass sich überhaupt jemand die Mühe macht irgendetwas zu antworten. (Ich sitze hier jetzt schon seit 1:30 Stunden und antworte auf die zu diesem Post gehörenden Kommentare)\nWenn du es nicht packst subjektive Kommentare, die leider nur wenig Argumentationsgrundlage besitzen (Siehe Punkt 1.) differenziert und objektiv zu lesen und auch abseits der oberflächlichen teils negativ konnotierten Aussage, die für dich relevanten Inhalt zu entnehmen (kann ich mir bei deinem Antwort-Kommentar auf meinen ersten Kommentar hier vorstellen), dann frage ich mich auch an dieser Stelle, warum fragst du dann überhaupt eine Antwort an?\n\nIch hoffe du gibst dir etwas mehr Mühe beim lesen der anderen Kommentare (leider doppelt sich recht viele der anderen Kommentare) und viel Glück dabei eine Lösung für deine Anfrage (als Problem würde ich das nicht bezeichnen) zu finden.\n\nMfG. Amycos Cyrus\n\nPS: Schreibe bei nächsten Mal bitte mit dem Account, um den es geht, um überhaupt konstruktive Antworten fordern zu können.\n\n{{sticker:slayer-jinx-wink}} ","replies":[{"poster":"Samus Saran","date":"2017-11-14T21:11:47.573+0000","up_votes":2,"down_votes":4,"body":"Nennst mich nicht kritikfähig?\nSag mal gehts dir noch gut du kennst mich doch gar nicht bzw. verfehlste meinen Post mittlerweile Komplett.\nIch lese das hier alles aber zu 90% nur Trolls hier mit Dislike und Kommentaren wie \"du spielst schlecht\"...\nNur wenige Posts gibts hier die aber sehr hilfreich sind und genau die Frage beantworten die ich gestellt habe.\n\nIch sagte doch das ich keine Belehrungen zum Spielstyl möchte von der du keine Ahnung hast wie ich ich spiele!\nEhrlich du laberst mich nur stark offensiv an als sei ich der größte Vollnoob und kennst mich nichtmal, was soll das?\n\nFällt dir das so schwer zu glauben oder ist dir das mal in den Sinn gekommen das ich vielleicht doch kein Vollnoob bin?\nFällt dir das wirklich so schwer zu glauben das ich meine eigenen Fehler nicht sehen kann?\n\nStellst mich bei jedem Punkt hin als Vollnoob der Blind Engaged, keine Wards setzt, der kein Deutsch schreiben kann, etc. und gehst massiv offensiv gegen mich vor.\n\nNimm mal die Hand aufs Herz...du bist ein Foren Troll...meinste nicht?","replies":[{"poster":"MeMyselfandBaal","date":"2017-11-14T22:39:12.859+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Samus Saran,realm=EUW,application-id=Wj1wcocU,discussion-id=jbtrG2ai,comment-id=00000000000000000001000100020000,timestamp=2017-11-14T21:11:47.573+0000)\n>\n> Nennst mich nicht kritikfähig?\n> Sag mal gehts dir noch gut du kennst mich doch gar nicht bzw. verfehlste meinen Post mittlerweile Komplett.\n> Ich lese das hier alles aber zu 90% nur Trolls hier mit Dislike und Kommentaren wie &quot;du spielst schlecht&quot;...\n> Nur wenige Posts gibts hier die aber sehr hilfreich sind und genau die Frage beantworten die ich gestellt habe.\n> \n> Ich sagte doch das ich keine Belehrungen zum Spielstyl möchte von der du keine Ahnung hast wie ich ich spiele!\n> Ehrlich du laberst mich nur stark offensiv an als sei ich der größte Vollnoob und kennst mich nichtmal, was soll das?\n> \n> Fällt dir das so schwer zu glauben oder ist dir das mal in den Sinn gekommen das ich vielleicht doch kein Vollnoob bin?\n> Fällt dir das wirklich so schwer zu glauben das ich meine eigenen Fehler nicht sehen kann?\n> \n> Stellst mich bei jedem Punkt hin als Vollnoob der Blind Engaged, keine Wards setzt, der kein Deutsch schreiben kann, etc. und gehst massiv offensiv gegen mich vor.\n> \n> Nimm mal die Hand aufs Herz...du bist ein Foren Troll...meinste nicht?\n\nIch wiederhole mich da... aber wir können dir die Frage, die du uns stellst, nicht beantworten, wenn du uns deine Matchhistory nicht zeigst... \n\nNebenbei sind nicht alle Antworten im Internet, die dir nicht passen, automatisch getrollt...\n\nNebenbei hast du ja auch ordentliche Antworten bekommen... nimmst diese Hilfestellungen aber nicht mal wahr...\nUnd ja, wenn du deine Matchhistory postest, werde ich mich auch ernsthaft mit ihr auseinandersetzen und dir sagen, was deine offensichtlichen Probleme sein können. Aber ohne ergibt das halt absolut 0 Sinn...\n\nDa bleibt die Antwort auf die ursprüngliche Frage bestehen: Es sind derzeit nicht mehr Smurfs als sonst unterwegs. Meiner Meinung nach sogar eher weniger. Wenn du deinen mangelnden Fortschritt auf diese Minderheit schieben willst, wird dir das nicht helfen. Denn es müssten sich schon alle Smurfs gleichzeitig anmelden, damit du 5 davon im Gegnerteam hast. Das ist einfache Mathematik bei 10% Spieler in Platin+...","replies":[]},{"poster":"Time2Whine","date":"2017-11-15T10:09:37.784+0000","up_votes":4,"down_votes":2,"body":"Ich gebe es auf meine Zeit mit dir zu verschwenden. Ich kenne kaum jemanden im Forum der so viel rumheult wie du es hier gerade tust. Auf fundierte Rückfragen zu deiner Ausgangsfrage kommt von dir nur zusammenhangloser Müll. Du stempelst 90 % der Antworten als Troll ab, obwohl ich von fast allen hier vernünftige Antworten lese. Tust du dir selber so Leid, dass du meinst dass alle hier dir was böses wollen und dich nur beleidigen und trollen wollen? Alter was stimmt mit dir nicht?\n\nAmycos, MeMyselfandBaal haben dir ausführlich in einem vernünftigen Deutsch die Sache erklärt und dich in keinster Weise angegriffen oder offensiv angegangen sowie nur Rückschlüsse deiner bisherigen Aussagen zu deinen jetzigen psychologischen Verfassung gezogen die ich komplett nachvollziehen kann.\n\nNochmal für dich zum Mitschreiben. Entweder du sagst uns deinen Accountnamen damit wir deine Spiele mit deiner Ausgangsfrage abgleichen können und zu sehen, ob du wirklich gegen Smurfs gespielt hast. Oder heulst hier weiter rum wie böse alle zu dir sind und die Welt so scheiße zu dir ist und wirst niemals fundierte Antworten zu deiner Ausgangsfrage hören.\n\nFür mich ist das Thema mit dir mittlerweile erledigt. Wenn ich merke, dass vom Anderen nichts konstruktives zurück kommt habe ich auch keine Lust mehr meine Zeit zu investieren. Ich empfinde dein Verhalten nur als Schutz vor der Kritik die auf dich einprasseln wird wenn wir deine Stats sehen. Wenn man sicher ist, dass man gute Spiele hingelegt hat ist es auch kein Problem diese zu zeigen. \nDas ist wie mit den Chatlogs der toxischen und gebannten Leute, die meinen sie wären nicht toxisch gewesen und ungerecht behandelt worden, sie aber nicht preisgeben weil sie wissen, dass sie scheiße gebaut haben.\nAlso was hast du zu verheimlichen? Die Argumentation dass wir mit dem Wissen deiner Stats über dich herziehen werden ist nur schlüssig, wenn deine Stats so schlecht sind, dass deine Ausgangsfrage nicht wahr ist. Die Tatsache dass du die Stats verheimlichst bzw. nicht preisgeben willst heißt für mich im Umkehrschluss, dass du weißt dass nicht nur deine Teammates schuld waren sondern du auch ein gewissen Anteil an den Niederlagen hast und diesen hinter den angeblichen Smurfs verstecken willst. \nDaher ist dein ganzes Gehabe für mich nur ein weiterer Aufmerksamkeit heuchelnder Heul-Thread von vielen. ","replies":[]},{"poster":"Qbert","date":"2017-11-15T05:56:38.497+0000","up_votes":2,"down_votes":1,"body":"Das zeigt, wie kritikfähig du bist.\n\nErst mal in die Offensive und vulgäre Sprache nutzen, anstatt uns mehr Informationen zur Verfügung zu stellen.\n\nBravo, bravissimo für diese Glanzleistung der Inkompetenz.\nWenn du spielst wie du Diskussionen führst, kann ich dir ganz einfach sagen, wieso du verlierst.","replies":[]},{"poster":"Amycos Cyrus","date":"2017-11-15T22:55:17.970+0000","up_votes":1,"down_votes":0,"body":"Jetzt mal Klartext.\nDu stellst dich grandios als Vollnoob dar und ja ich habe keine Ahnung von dir, habe dich nie spielen gesehen und habe bis auf meinen ersten Kommentar auch nicht die Hauptfrage (Überschrift) als Thema genutzt, aber ...\nDas gibt dir trotzdem nicht das Recht genauso zu handeln.\nWenn du die Antwort auf deine Frage bereits hast, dann beende doch einfach die Diskussion mit etwas wie einem \"Danke\" unter dem Antwortkommentar o.Ä.\n\nWeiterhin habe ich dich nicht belehrt, auch wenn du es so interpretierst, sondern die Aspekte beantwortet, die du lang und ausführlich selbst als Themen aufgezählt hast. (Und ja, das ist nicht die Antwort auf deine Hauptfrage)\n\nIch glaube dir, dass du kein schlechter Spieler bist, aber ich kann überhaupt nicht nachvollziehen, wie du darauf kommst, dass die \"schlechten\" Spieler plötzlich weg seien. Die Community ist wie bereits gesagt immer noch dieselbe, heißt inklusive aller Bronze 5 und Challenger-Smurfs.\n\nEs ist halt absolut hirnrissig eine Aussage zu treffen die derartige rhetorisch ist, wie \"Warum sind hier nur Smurfs überall?\"\n\nAber nochmal zurück: Ich kann nicht sagen das du ein Vollnoob bist (Habe ich auch nie), aber ich kann nur durch  dein Auftreten (und damit ist Wortwahl und Ansprache, sowie die bereits angesprochene Grammatik gemeint) in diesem Forum irgendeine Wertung von dir erfahren.\n\nAlso was soll ich aus den folgenden Aussagen entnehmen? :\n**Wortvertauschung und Rechtschreibfehler**: \"(...) ab dem Zeitpunkt nenne ich eher es nen Blutbad (...)\"\n**Fehlende Kommata und plötzlicher Einschub**: \"(...) vom Jungler die unkonventionelle Wege gehen die man nicht aus der Low Elo kennt deren Timing immer passt (...)\"\n**Falsch Artikel, Wortvertauschungen, Fehlende Kommata und Satzstrukturfehler**: \"Auch wissen diese Leute immer richtig gut bescheid auch ohne Wards wann Drache/Herold wir versuchen, ja das war bis letzte Woche noch ganz anders da wars denen völlig egal als wären die Dornrösschen auf Ihrer Lane...\"\n**Beleidigung und Pauschalisierung**: \"(...) ...wie mans so kennt....\"\n**Satzstrukturfehler und Rechtschreibfehler**: \"Alle andren Lanes gleichzeitig feeden im synchron....\"\n**Falscher Artikel und Rechtschreibfehler**: \"(...) und dabei noch ner Nami in meinem Team davon abhalten auf Bruiser zu tun.....\"\n**Beleidigung, Pauschalisierung, Satzstrukturfehler und Rechtschreibfehler**\"Und ich das mit nem Smurf poste grade weil ich weniger konstruktive Beratung als puren Dislike/Troll/Spamm-Posts bekommen würde wies üblich ist in dieser Community.\"\n**Fehlender Artikel und Satzstrukturfehler**:\"(...) ....darum poste ich ja das ja..also was geht ab in Preseason??\"\n**Rechtschreibfehler und Falscher Bezugspunkt**:\"Nach minute 5 feeden alle auser ich in meinem Team...als würde ich ständig nur gegen Smurfer selectiert (...)\"\n**Falsche Nutzung von Anglizismen und Satzstrukturfehler**:\"Vor der Season habe ich gut geclimbt easy (...)\"\n**Rechtschreibfehler**: \"(...)  -Null Chanche!\"\n**Satzstrukturfehler, Fehlende Kommata und Rechtschreibfehler**: \"(...) Ich sagte doch mehrfach das es so alles bis vor der Preseason NICHT so war sondern alles extrem leicht war beim climben.\"\n\nWenn du ernsthaft möchtest, dass wir dich nicht als Vollnoob sehen, dann stell dich bitte auch nicht als ein solcher dar. Es ist ja nicht so, als wäre ich der einzige, der durch deine Äußerungen ein derartiges Bild von dir bekommen hat. (Genügend andere haben sich ja ebenfalls an dieser Diskussion beteiligt)\n\nMfG. Amycos Cyrus\n\nPS: Nochmals ich sehe dich nicht als Vollnoob an, sondern antworte nur auf den Post zudem der jeweilige Kommentar auch der Antwortkommentar ist. (heißt also nicht jede Nachricht bezieht sich auf die Überschrift/den Hauptkommentar)\n\n{{sticker:slayer-jinx-unamused}}","replies":[]}]}]},{"poster":"MeMyselfandBaal","date":"2017-11-14T15:23:45.224+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=Samus Saran,realm=EUW,application-id=Wj1wcocU,discussion-id=jbtrG2ai,comment-id=000000000000000000010001,timestamp=2017-11-14T11:27:43.612+0000)\n>\n> Wieso wollen alle auf meine States und mir jedesmal die Schuld geben...unterlasst das bitte....darum habe ich nie gebeten.....\n\nNaja... du hast uns halt das Fenster zum Spekulieren offen gelassen. Wir können das gerne ändern, wenn du deine Matchhistory deines Mains hier postest. Solange dir aber deine eigenen Statistiken anscheinend zu peinlich sind um sie zu teilen, werden wir zu keinem anderen Schluss kommen als: Du willst dir halt nicht eingestehen, dass du selber nicht so gut bist...\n\nDu hast eine einzige Möglichkeit aus dieser Endlosschleife rauszukommen... Und dann können wir uns auch mal die Matches genauer ansehen und dir vielleicht sogar hilfreiche Tipps geben, was du wirklich besser machen kannst... oder dir Recht geben, dass du gerade eine übelste Pechsträhne im Matchmaking hast...\n\nAber solange wir spekulieren müssen, gehen wir von dem schlimmsten aus... und ja, da hast du indirekt drum gebeten, weil du uns die wichtigen Informationen vorenthält... \n\nIch spiele nebenbei (falls es dich interessiert) derzeit ausschließlich auf meinem Main... weil ich halt lieber beim ausprobieren mit 12 Runenseiten anstatt mit 2en hantiere... Damit ist einer von den 10% schon mal raus...","replies":[{"poster":"Amycos Cyrus","date":"2017-11-14T20:53:05.399+0000","up_votes":1,"down_votes":2,"body":"Ich würde zwar nicht auf \"Du willst dir halt nicht eingestehen dass du selbst nicht so gut bist...\" folgen, sondern eher auf: \"Du stellst eine Rhetorische Frage, dessen Antwort wir nicht kenne können und willst auch keine ernst gemeinte konstruktive und argumentativ fundamentierte Antwort von uns haben!\"","replies":[]}]}]},{"poster":"5weeds","date":"2017-11-14T11:02:05.571+0000","up_votes":1,"down_votes":1,"body":"\"Meine Stats sind aber so schlecht, weil mein Team jedes spiel versaut und ich dann die Konsequenzen zu tragen habe.\"","replies":[{"poster":"Amycos Cyrus","date":"2017-11-14T20:28:32.910+0000","up_votes":1,"down_votes":2,"body":"Trifft seine Aussage echt gut XD","replies":[]}]}]}]}]}]}]},{"poster":"I am Zynex","date":"2017-11-14T06:18:51.612+0000","up_votes":3,"down_votes":1,"body":"Gut das du mit deinem Smurf postest und man somit nicht mal die Spiele anschauen kann.","replies":[]},{"poster":"Ηastur","date":"2017-11-14T18:12:32.000+0000","up_votes":1,"down_votes":0,"body":"Kurzer Gedanke, der dir vielleicht auch hilft.\nSeit den neuen Runen sind aggressive Jungler wieder in Mode. Das war vorher anders. Aggressive Jungler haben anderes Pathing und Gankmöglichkeiten. Spiel drumrum und du wirst besser klar kommen. Banne vielleicht einen. Ich banne aktuell nur noch Lee, weil ich da die Kretze bekomme. In meinen letzten Games habe ich so viele Kayns und Hecarims gesehen, dass ich mich gar nicht wundere, wenn ein Gank über ne Wall oder hinterm Tower herkommt.\nWeise deine MITSPIELER in der Champselect darauf hin, dass sie gegankt werden könnten von roamenden Midlanern oder eben dem Jungler. Hilft viel im unteren Elobereich, die Leute denken auf einmal auch daran. Schreibe ihnen, wenn dein Laner weg ist spampingst du ihre Lane. Ich weiß, dass man nicht immer hinterher roamen kann und auch farmen muss/will. Sag es ihnen gleich zu spielbeginn. Es wird zu 100% passieren, dann wirst du spampingen. Sie sollen aufpassen. Klar kommts immer wieder mal dazu und in den letzten Wochen gibts mehr Fiesta als im letzten ganzen Jahr zusammen, aber solange nicht sowas passiert wie 4  Leute auf einer Lane und dein Team jungelt derweil geht sowas. Mit CS verlust, keine Frage, aber ich hab eher den Eindruck, die Leute sind viel schlechter geworden, weil die ganzen Smurfs jetzt noch schnell für die Rahmen geboostet wurden und da diese safe sind kann man jetzt wieder ganz entspannt spielen. Mag aber auch an der Meta liegen. Ich hasse Tanks und die ADC Meta und fühl mich grade sehr wohl als Burst-Midlaner.","replies":[]},{"poster":"Nordwolf87","date":"2017-11-14T11:15:20.900+0000","up_votes":1,"down_votes":0,"body":"Dann lass ranked derweil mal sein?\n\nSetz dich selbst in normals mit den änderungen auseinander und wenn du bisschen wartest climben die vermeintlichen smurfs eh davon und du hast ruhe...","replies":[]},{"poster":"Pure Cynicism","date":"2017-11-14T11:08:17.953+0000","up_votes":1,"down_votes":0,"body":"Ich kenne jetzt deine Elo nicht, aber ich gehe mal von Silber aus. Dort befinden sich rund 60% der Spieler (30% Gold+, 30% Bronze pi mal Daumen). Platin+ sind aber nur 10% aller Spieler. Selbst wenn die jetzt alle smurfen würden, wäre die Wahrscheinlichkeit, dass du ausschließlich Smurfs im Gegneteam erhälst, gegen null.\n\nWahrscheinlicher ist es, dass die Gegner einfach besser sind, du dir das aber nicht eingestehen willst und daher mit deinem Finger in alle Richtungen zeigst, in der Hoffnung, dort den Schuldigen identifizieren zu können.","replies":[]}]}