{"poster":"Samus Saran","date":"2017-05-06T19:16:42.653+0000","title":"Jungler geben kaum noch Blue Buffs ab?","subforum":"Champions & Gameplay","up_votes":2,"down_votes":6,"body":"Habt ihrs auch vllt bemerkt, das Jungler (in vergleich zum letzten Jahr) kaum bis gar keinen Blue Buff mehr zurzeit in diesem Jahr abgeben und diesen jedesmal egoistisch f&uuml;r sich selbst behalten?\r\n\r\nWas meint Ihr dazu?\r\n\r\nSind die meisten Jungler zu egoisten geworden die kein Teamwork mehr t&auml;tigen wollen?","replies":[{"poster":"Chadono","date":"2017-05-07T08:30:13.467+0000","up_votes":2,"down_votes":0,"body":"Also ich spiele meistens Ahri Midlane und ich bestehe eigentlich immer darauf, dass der Jungler die Blue Buffs selbst nimmt.\n\nNimmt der Jungler die Buffs (vorallem die ersten beiden) nämlich nicht, dann fällt er meistens EXP-mäßig hinter den gegnerischen Jungler zurück. Und ein Jungler, der im Level hinter dem gegnerischen Jungler herhinkt, ist in meinen Augen ziemlich useless.\n\nJa ich hab mit Ahri vor dem ersten Back auch Manaprobleme. Aber Manamanagment ist eben auch ein Skill, der darüber entscheiden kann ob du deine Lane verlierst oder gewinnst.\nDeshalb konzentriere ich mich vor dem ersten Back eigentlich immer voll aufs Last-Hitten, damit ich mir möglichst früh das Lost Chapter kaufen kann. Sobald ich das habe, habe ich auch keine Probleme mit dem Mana mehr. Eine volle Spell-Rotation drücke ich dem Gegner normalerweise vor dem ersten Back nur, wenn er sich wirklich mies positioniert, mein Jungler vorbeischaut oder wenn ich engaged werde. Bekomme trotzdem regelmäßig Kills pre 6, in dem ich einfach save spiele, den Gegner mit Auto-Attacks nerve, ab und an ein Q werfe und auch so den Gegner low poke, ohne dass ich viel Mana dafür verbrauche.","replies":[]},{"poster":"Der Wohltäter","date":"2017-05-06T21:23:55.942+0000","up_votes":3,"down_votes":2,"body":"Ist es nicht egoistisch zu denken, dass die Mitte den blue bekommen sollte? Ich persönlich gebe den blue, wenn überhaupt, nur an meinen Eigenen Leuten ab. Du solltest dein Spielverhalten überdenken wenn du in jedem Spiel ein Problem mit deiner Mana hast(falls vorhanden).","replies":[{"poster":"Samus Saran","date":"2017-05-07T00:08:05.932+0000","up_votes":2,"down_votes":1,"body":"Ist es das? Eine Ausrede \"komm mit deinem Manahaushalt klar\" nur um den Grund zu verscheleiern das man ein kein Humaner Teamspieler ist?","replies":[{"poster":"Der Wohltäter","date":"2017-05-07T01:00:53.961+0000","up_votes":3,"down_votes":2,"body":"Das hat nichts mit Humanität zu tun. Da ich der Jungler bin, habe ich auch Anspruch auf den blue. Der Jungler muss sich in keinster Weise rechtfertigen warum er den blue nicht abgibt. \nWenn du es nicht schaffst auf deine Mana zu achten solltest du dafür nicht den Jungler verantwortlich machen.\nIch persönlich komme mit jedem midlane Champion ohne blue klar.\n\nWenn du sonst noch Anmerkungen hast, bitte lass es mich wissen, lass mich dich erleuchten.","replies":[{"poster":"Angel Ayume","date":"2017-05-07T01:19:02.358+0000","up_votes":2,"down_votes":1,"body":"Es gibt aber Champions die mit einem Bluebuff wesentlich mehr anfangen können als der Jungler. \nEine Ori, Anivia oder Ahri können sehr viel mit einem Blue anfangen meistens mehr als der Jungler. \nWenn der Jungler selbst viel Manakosten hat ist das was anderes, aber ein Lee Sin zB muss in meinen Augen keinen Bluebuff beanspruchen wenn er einen AP-Midlaner hat. Selbst ein Talon freut sich über den Blue. \nEinfach zu sagen, dass man einfach besser mit seinem Mana haushalten soll ist nicht immer möglich. Eine E,W,Q Kombo von Ahri und sie hat kein Mana mehr. Mit einem Bluebuff kann sie diese Kombo aber ein paar mal machen. Selbst wenn sie Spells verhaut. So hat sie die Möglichkeit einen Kill zu holen. Selbiges gilt natürlich auch für Anivia oder Orianna. Beanspruchst du den Blue für dich selbst obwohl du ihn nicht zwingend brauchst verbaust du dem Midlaner so die Chance auf einen Kill... \nEventuell gibt ihm der Blue die einzige Möglichkeit gegenzupushen, weil er hart reingepushed wird. Hat er kein Mana mehr muss er passiv spielen, um nicht gepoked zu werden und muss dann irgendwann back verliert dann aber extrem viel Farm. Besonders schlimm wird es, wenn der Gegner einen Bluebuff bekommen hat.\nAlso ist es von dir schon ein wenig egoistisch den Blue nicht abzugeben... Vorallem wenn du ihn nicht brauchst... \n\nIch bin selbst Midlaner, ich weiß wovon ich spreche... Du scheinst dich nicht ausreichend genug in der Mitte auszukennen oder spielst extrem passiv, sonst würdest du sicher soetwas nicht sagen...","replies":[{"poster":"Der Wohltäter","date":"2017-05-07T01:26:57.985+0000","up_votes":3,"down_votes":2,"body":"Achte darauf wann du deine Combo raushaust. Viele versuchen eine volle Combo pre  6 zu erzielen. Dies ist in den meisten Fällen nicht effektiv da du nicht genug Schaden hast um irgendwas zu bewirken. Da kannst du lieber warten bis dein Freund, der Jungler, erscheint. Wenn du der Überzeugung bist, dass du deine Fähigkeiten bis ans Ende deiner Mana raushauen musst, dann kann ich dir sagen, dass das kein guter Weg ist.","replies":[{"poster":"ID Root","date":"2017-05-07T02:14:29.540+0000","up_votes":3,"down_votes":1,"body":"***","replies":[{"poster":"Der Wohltäter","date":"2017-05-07T10:59:42.465+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=1ND3RT4T,realm=EUW,application-id=Wj1wcocU,discussion-id=k3prwlEw,comment-id=000300000000000000000001,timestamp=2017-05-07T02:14:29.540+0000)\n\n> Nach der Logik kann ich auch als Elise dem Adc im Late den Redbuff stealen.\n\nKannst du. Und klauen nennt man dies ja nicht da er ja technisch dir gehört.\n\nDarüber können wir aber auch noch die nächsten Wochen diskutieren und es wird nichts bringen. Wir haben unterschiedliche Meinungen und Anhaltspunkte und werden somit auch nicht auf einem Stand gelangen.\nJedoch solltet ihr wissen dass keiner hier unrecht hat.","replies":[{"poster":"ID Root","date":"2017-05-07T16:18:35.998+0000","up_votes":1,"down_votes":1,"body":"***","replies":[{"poster":"Der Wohltäter","date":"2017-05-07T17:41:40.521+0000","up_votes":1,"down_votes":1,"body":"Dann wären wir ja alle sicher einverstanden wenn ich auf deine lane gehe und dir den ganzen Farm wegnehme, oder? Ich meine, es gehört ja keinem.","replies":[]}]},{"poster":"clair de lune289","date":"2017-05-07T14:36:43.198+0000","up_votes":1,"down_votes":1,"body":"ihr scheint da alle etwas falsch zu verstehen, es steht JEDEM frei sich den Bluebuff zu holen wenn dieser da ist. Selbst Supporter dürfen das.\nIst doch das gleiche wie der ganze Killsteal Schwachsinn.\nDas der Buff evt auch manchen Positionen Sinnvoll bzw Sinnvoller sein könnte,hat **absolut nichts**mit dem Recht auf dem Bluebuff zu tun.","replies":[]}]}]},{"poster":"Angel Ayume","date":"2017-05-07T01:30:57.953+0000","up_votes":1,"down_votes":0,"body":"Wenn du den Gegner schon entsprechend gepoked hast, kann diese Kombo inkl. Ignite aber schon zu einem Kill führen. \nEinfach zu sagen ich soll in der Lane nichts vor Lvl 6 machen ist genauso der falsche Weg. Ich sage ja du spielst offenbar sehr passiv in der Lane... \n\nAber selbst wenn es nach Lvl 6 ist kannst du den Blue abgeben. Es rentiert sich meistens mehr als ihn als Jungler selbst zu behalten. (je nach Champion)","replies":[{"poster":"Samus Saran","date":"2017-05-07T01:53:55.202+0000","up_votes":1,"down_votes":1,"body":"Ayume hat recht, was willst du als Jungler mit dem Blue effektiv anfangen? \nDa kann der Midlaner wesentlich effektiver den Kill holen da sein Gegner immer vor seiner Nase ist oder Ihn unter Druck setzten, während du die Ausrede haben musst das die Raptoren der totale Endboss für dich ist.\n\nNebenbei gibt es {{item:2032}} und da sollte kein Jungler mehr Manaprobleme haben.","replies":[{"poster":"Angel Ayume","date":"2017-05-07T02:19:04.600+0000","up_votes":1,"down_votes":0,"body":"Naja, es gibt auch Jungler die vom Bluebuff profitieren. Indem Fall lasse ich den Bluebuff natürlich dem Jungler und frage meist auch gar nicht danach. Habe auch kein Problem damit. Aber bei Champions die den tatsächlich nicht benötigen ist es eben sinnvoller ihn abzugeben, da ein Midlaner in den meisten Fällen sehr viel mit dem anfangen können.\nIch habe schon oft genug Situationen gehabt wo ich dank des Blues einen Kill bekommen haben. Andersrum hätte ich einen Kill bekommen wenn ich mehr Mana gehabt hätte. \nWenn ich zB schon 0:3 stehe will ich den Blue gar nicht haben. Mir wäre das Risiko dann zu hoch, ihn zu verlieren. Da lehne ich den Blue sogar ab selbst wenn er mir angeboten wird. \n\nTrotzdem, es wäre schön, wenn der Jungler an seine Mitte denkt und nicht egoistisch denkt und den Blue behält obwohl er ihn nicht braucht..","replies":[{"poster":"Maíko","date":"2017-05-08T08:06:00.866+0000","up_votes":2,"down_votes":1,"body":"Das hat nichts mit Egoismus zu tun.\n\nAlle Jungler können etwas mit dem Buff anfangen. Er gibt Gold und Exp, die für Jungler sehr wichtig sind.\nDie Stärke von ihrem Smite hängt von ihrem Lvl ab...sollten sie also im Lvl zurück fallen, kann der Gegner wesentlich besser den Drachen/Baron machen.\nUm den Buff für den Midlaner vorzubereiten, investiert der Jungler einiges an Zeit, verliert Ressourcen wie z.B. Leben/Mana und erhält nichts dafür. \nJeder abgegebene Buff führt dazu, dass der Jungler zurück fällt.\nWenn man dies als Midlaner nicht ausgleichen kann sollte man gar nicht erst verlangen den Buff zu bekommen.","replies":[{"poster":"Angel Ayume","date":"2017-05-08T13:41:07.133+0000","up_votes":1,"down_votes":0,"body":"Ich zitiere mich mal \n\n> Trotzdem, es wäre schön, wenn der Jungler an seine Mitte denkt und nicht egoistisch denkt und den Blue behält obwohl er ihn nicht braucht...\n\nHast du das auch gelesen?\nWenn er ihn nicht braucht, dann bezieht das Gold, Exp, Mana, CDR alles mit ein... \nWenn mein Jungler behind ist, das Gold und die Exp dringend benötigt, dann sage ich nichts dagegen wenn er  ihn nimmt. Wenn er aber selber ahead ist, die Mana und CDR nicht benötigt, mehr CS als der gegnerische Jungler hat, dann kann er den Bluebuff an den Midlaner abgeben, der ihn eventuell dringend benötigt. Und wenn er das nicht macht, dann ist es schon ein wenig egoistisch. Immerhin würde er seinem Midlaner einiges leichter machen evtl. dafür sorgen, dass er die Mitte gewinnt...","replies":[]}]}]}]}]}]}]},{"poster":"AI Yjuq","date":"2017-05-07T18:48:35.751+0000","up_votes":1,"down_votes":0,"body":"> Da ich der Jungler bin, habe ich auch Anspruch auf den blue.\n\nWo hast du denn das aufgeschnappt? Seit wann sind die Ressourcen in LoL vergeben? Wer was haben will, nimmt es sich. So war es schon immer. Es sein denn es existiert eine Regel die mir das verbietet, bis jetzt ist mir da aber noch nichts in dieser Richtung unter gekommen.","replies":[]}]}]}]},{"poster":"ELOW Cronos","date":"2017-05-08T08:23:09.038+0000","up_votes":1,"down_votes":0,"body":"Jeder will vom eigenen Jungler geganked werden (am besten permanent), will das der Jungler einem hilft beim Warden, möchte seine Buffs, nimmt seinen Farm und achja Objektives soll der Jungler auch noch für einen machen. Das der Jungler ja auf 3 Lanes aufpassen und nebenbei noch Farmen sollte um nicht Gold + EXP behind zu fallen wird dabei gerne mal vergessen. Und wehe er nimmt auch nur 1en Blue, weil er die Manareg gerade gut gebrauchen könnte um nicht unnötig back gehen zu müssen!\n\nJetzt mal im Ernst: Ich selber bin Main Jungler und gebe in der Regel meinen Blue auch gerne ab. Aber wenn wir nen Zed Mitte haben, ich gerade Mana brauche um weiterzujungeln/nen Objektiv zu machen/ zu ganken, mein Midlaner nur reinfeedet oder ich mega EXP + Gold behind bin, dann nehme ich den auch mal selber. Gewisse Spieler sollten echt dem Supporter und Jungler etwas mehr Dankbarkeit entgegenbringen dafür das Sie auf so viel verzichten um das restliche Team nach vorne zu bringen.\n\nIch meine es ist ja okay das ihr von uns erwartet das ihr Ganks und Buffs kriegt und wir euch die Kills überlassen, denn wir machen das ja auch gerne. Aber etwas Dankbarkeit und Anerkennung währe nett und nicht 1000 Spampings weil wir mal 3 eurer CS nehmen damit wir den Tower pushen können.","replies":[]},{"poster":"Oriius","date":"2017-05-07T05:39:22.690+0000","up_votes":1,"down_votes":1,"body":"Wer hat das Gesetz in die Welt gerufen das man Blue abgeben muss. Ich persönlich hab teilweise mit gewissen Champs n sehr schwachen manapool und bevor ich mir n random mana item kaufe was absolut kein wert besitzt im late nehm ich mir auch lieber mal den einen oder anderen blue. Verstehe nicht in welchem Verhältnis das zu dir steht , das man kein Teamwork mehr dadurch hat .","replies":[]},{"poster":"BEAR IRL","date":"2017-05-06T21:23:32.930+0000","up_votes":1,"down_votes":1,"body":"kommt auf den cahmpion an den ich spiele den 2. blue buff nehm ich meistens selbst weil ich da noch die xp brauche es sei denn der midlaner pingt mich dann geb ich ihn ab.\nwenn der midlaner schon 0:5 steht kriegt er ih naus prinzip nicht weil er ihn meistens innerhalb der nächsten minute an den gegner abgibt :D{{champion:17}}","replies":[]},{"poster":"TSG Nyx","date":"2017-05-06T19:31:41.136+0000","up_votes":2,"down_votes":2,"body":"Ich bin selber jungler (Elise main{{champion:60}} ) und ich brauche die ersten 2 blue buffs unbedingt für mich ausser mein midlaner ist eine ori oder sowas mit viel mana verbrauch.. den 3 blue gebe ich meistens dem midlaner ausser er ist ad und will ihn nicht. ich würde nicht gerade sagen das \"die meisten\" egoisten geworden sind.. Jungle ist momentan einer der stärksten lanes zum carrien darum wollen die junglers den Buff für sich nutzen damit am ende das ganze team gewwinnt. ;D","replies":[]},{"poster":"Tyrion Lannìster","date":"2017-05-06T20:08:42.041+0000","up_votes":1,"down_votes":3,"body":"Heul doch ^^\n\nNe echt jetzt, wenn ich der Meinung bin, dass ein Midlaner, welcher sehr oft schon ein Mana-regenierendes Item hat, den Bluebuff nicht so sehr braucht wie ich, nehme ich ihn mir.\n\nEs gibt viele Jungler die auf manchen Fähigkeiten extrem hohe Manakosten haben.\n\nIch persönlich brauche als Midlaner fast nie den Bluebuff","replies":[]}]}