{"poster":"Mangekyouita","date":"2015-09-13T12:00:00.985+0000","title":"Besser werden als ADC aber sterbe früh und oft","subforum":"Level Up: Guides & Tipps","up_votes":1,"down_votes":0,"body":"hi ich m&ouml;chte derzeit ADC mainen die champs machen mir am meisten spa&szlig;. Jetzt habe ich aber immer so games entweder stehe ich 2/9/4 und das game ist schnell verloren oder ich stehe 18/5/12. \r\nAlso Beispiel habe ich eben mehre games Jinx gespielt die gef&auml;llt mir am meisten jedoch habe ich das gef&uuml;hl ich werde immer einfach so in der laining phase weggenukt. Also ich war Jinx mit Tresh gegen Varus und Gragas: Varus spannt Q gragas Flash jump Fass dann die Varus Q AA und E und ich bin fast tot manchmal noch ingite und ich sterbe. Das geht dann zack zack das mein Stun nichtmal greift. Zudem wenn mein Flash dann mal zum &uuml;berleben aus ist machen die das wieder. Und mit deren Ults flieg ich quer durch die gegend. Oder deren Fizz der kommt schnell mal vorbei macht ult und autoattackt mich dann weg. \r\nAnderen Beispiel war gegen Corki und Janna Corki knallt andauernd seine void und janna zoned mich weg. Ich komme nie zum farmen oder bekomme harten poke und bin immer low. Gehe in die base komme zur&uuml;ck 1-2 treffer wieder low.\r\nDabei ist doch Jinx einer der starken champs oder nicht? Wenn ich Tristana spiele sterben leute auch recht schnell an meiner E und auch Vayne kann im early mal schnell mit der Ult bursten. Jedoch habe ich mit Jinx immer das Gef&uuml;hl im Early stehe ich nur und mach AA und hoffe zu criten. Sobald ich auf Jinx aber KDU und Phantom habe sowie boots f&auml;ngt es an das ich die Leute Baller. \r\nich teste jetzt auch mal mehr andere adcs aber wie gesagt Jinx macht am meisten Fun bekommt aber bei mir immer am schnellsten aufs gesicht. Zudem habe ich mal bei den pros reingeschaut die spielen alle irgendwie nur Lucian, tristana, Kalista und jenachdem mal kog/twitch. Aber wieso sieht man denn den mega champ Jinx kaum, der doch auch in dern Tier Lists auch im god tier ist?\r\nNaja und Farmen bin ich auch recht schlecht aber halt nur da ich nie richtig dazu komme. habt ihr noch tipps die ihr einem ADC neuling geben k&ouml;nnt. Empfehlungen f&uuml;r champs die relativ gutes early haben und allgemein zum spiel? Oder auch wo man sich ein paar gute adc spieelr anschauen kann um von denen zu lernen kenne mic hda nicht so mit streams etc aus.","replies":[{"poster":"TB Yoda","date":"2015-09-13T12:26:36.098+0000","up_votes":2,"down_votes":0,"body":"Anscheinend hast du noch nicht ganz verstanden wie das Spiel funktioniert ^^,\nAlle Champions haben im Spiel eine Phase, in der sie mal stärker oder schwächer sind als\nandere Champions. Jinx in dem Fall ist ein Late-Game Champion. Das heist, dass sie nach bestimmten Items wie z.B. einer Infinity Edge oder einem Phantom Dancer einen Powerspike hat. Außerdem hat die stärke eines Champs etwas mit seinen Skalierungen zu tun. Jeder Champion in League folgt in der Regel 2 scalings: attack damage oder ability power. Pro aufgestiegenem Level können sich diese scalings auf denen die Fähigkeiten deines Champions basieren verbessern, wie z.B. der dmg deiner Ult, oder die Range auf deinem rocket launcher, die auf maximaler Stufe die größte im Spiel ist. Außerdem hat Jinx, wie so ziemlich jeder adc oder hardcore dd im Spiel wenig hp, um den Schaden den er macht zu kompensieren. Dazu kommt, dass Jinx sich ausschließlich auf ihre Range und ihren support verlassen kann, denn sie hat nicht wie z.B. Tristana einen Jump, um aus brenzligen Situationen zu kommen. All das führt dazu, dass Jinx eben Late Game stark und davor eher meh ist. Wenn du noch mehr über die Rolle als adc wissen willst würde ich dir empfehlen ein paar turtorials auf youtube zu schauen. Da wirst du dann Sachen zu kiten, positioning in teamfights, mechanichs auf deinem adc und generelle Strategien, sowie Runen und Masteries lernen, denn das alles hat Auswirkungen auf deinen Champion und die Art und Weise wie du ihn spielst!\nHoffe ich konnte dir was weiterhelfen \n\nTrained by Yoda{{champion:236}}","replies":[]},{"poster":"llink007","date":"2015-09-13T12:17:22.245+0000","up_votes":2,"down_votes":0,"body":"Das du mit Jinx am Anfang so Probleme hast liegt ganz einfach daran, das Jinx ein sehr schwaches early game hat. Besonders gegen zB Corki, der hat nämlich ein gutes early game. In solchen Situationen solltest du versuchen so sicher zu spielen wie möglich und dein Support sollte dir dabei helfen das du doch irgendwie an deinen farm kommst. Sobald du dann deine Items mit Jinx hast ist es einfacher, das merkst du ja selber schon.\nDas die Pros immer nur bestimmte Adcs spielen liegt daran, das sie sich nicht nur auf die Lane konzentrieren sondern gucken welcher adc mit den anderen Champions gut zusammenpasst. Das ist dann wieder abhängig von der Meta bzw. welche adcs im Moment stark sind und welche nicht.\nDann noch ein Tipp wie du besser im farmen wirst: Erstelle ein Custom game (ohne Gegner), benutze KEINE Runen und KEINE Masteries und versuche dann so viel farm wie möglich zu bekommen. Wenn du das ein paar mal machst ist es in normals wesentlich einfacher wenn du auch wieder die Runen und Masteries benutzen kannst.\nHoffe ich konnte dir ein wenig helfen. :)","replies":[{"poster":"llink007","date":"2015-09-13T12:37:00.436+0000","up_votes":1,"down_votes":0,"body":"Achja und was mir noch sehr geholfen hatte: Such mal bei Youtube nach \"Phylol\". Der macht (meiner Meinung nach) sehr gute adc guides. (Allerdings muss man da englisch können)","replies":[]}]},{"poster":"Mangekyouita","date":"2015-09-13T13:28:36.407+0000","up_votes":1,"down_votes":0,"body":"Noch was wo ich nie sicher bin ob das so richtig ist. Ich spiele immer solange bis ich das riesen schwert kaufen kann. Sterbe ich wegen guten ganks etc warte ich trotzdem bis ich das riesen schwert zusammen habe. auf Jinx, tristana, Ashe mache ich das immer so. Ist die Frage sollte man nicht eher andere kleine items kaufen oder wirklich warten bis der booom mit dem riesen schwert kommt?","replies":[{"poster":"Evenrider","date":"2015-09-13T14:25:18.954+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Mangekyouita,realm=EUW,application-id=vatevpvi,discussion-id=Ko5hAdIF,comment-id=0002,timestamp=2015-09-13T13:28:36.407+0000)\n>\n> Noch was wo ich nie sicher bin ob das so richtig ist. Ich spiele immer solange bis ich das riesen schwert kaufen kann. Sterbe ich wegen guten ganks etc warte ich trotzdem bis ich das riesen schwert zusammen habe. auf Jinx, tristana, Ashe mache ich das immer so. Ist die Frage sollte man nicht eher andere kleine items kaufen oder wirklich warten bis der booom mit dem riesen schwert kommt?\n\nWenn du in der Base bist, gibst du dein gesamtes Gold aus, oder du vergrößterst den Vorteil des Gegners immer mehr.\nWenn du das B.F. nicht kaufen kannst, dann hol dir Pick Axe, Schuhe, Zeal, Wards, Pots,....","replies":[{"poster":"Mangekyouita","date":"2015-09-13T16:23:09.208+0000","up_votes":1,"down_votes":0,"body":"achso. Dann mach ich das ja schon immer Falsch. Aber dann bekommt man doch nie KDU fertig weil grade BF teuer ist und ewig dauert und das ist bei allen immer first item","replies":[{"poster":"M4ster Yi","date":"2015-09-17T09:15:58.338+0000","up_votes":1,"down_votes":0,"body":"Nicht wirklich wirst ja wohl mal schaffen 1.5k Gold zusammen zu kriegen. Gehste halt den Jungle Farmen wenn was fehlt. Und im allergrössten notfalls noch ne 2 pickaxe für den kommenden Last wishper oder lifesteal zwischenbauen ist doch alles np","replies":[]}]}]},{"poster":"llink007","date":"2015-09-13T21:56:47.549+0000","up_votes":1,"down_votes":0,"body":"Es hängt von der Situation ab was man kauft, das ist auch eine Sache die man lernen muss, zu wissen wann man welche Items kauft. Ist der gegner adc relativ früh gestorben? Spare auf das BF sword, dein Gegner wird sich eh nicht sehr viel leisten können. Bist du relativ früh gestorben? Du solltest eine Pickaxe kaufen damit der Vorteil vom Gegner nicht zu groß wird. Ansonsten kann man auch versuchen ab dann sicher zu spielen bis man das BF sword hat, hängt vom matchup ab ob das möglich ist.","replies":[]}]},{"poster":"pac0r","date":"2015-09-17T08:32:41.472+0000","up_votes":1,"down_votes":0,"body":"hi\nich hab mich nach geraumer zeit auch zu der adc position hingezogen gefühlt und maine die nun :P bin zwar elo technisch noch nicht so hoch aber ich denke ich hab nen gutes verständnis wie diese funktioniert.\nich hatte auch eine phase, die genauso aussah wie du es beschreibst.\nwichtig ist, sprech mit deinem support wie das early game aussehen soll. wenn die gegner aggresive sind und du es dir nich zutraust, dann bleib defensiv. damit meine ich, unterm tower und def warden. \nim generellen, ist es gut auf das bf sword zu sparen. jedoch wenn du merkst, ihr verliert die lane, solltest du anfangen sachen zu kaufen die dein ersten item benötigt und die du dir leisten kannst. im falle von jinx die pick axe. warum: damit du deine gegner, wenn sie einen fehler machen, bestrafen kannst und gegebenenfalls zurückkämpfen kannst um nen lucky kill ab zustauben. \n\nwichtig als adc und das ist das A und O!!!!!!! NICHT STERBEN. du musst solange am leben bleiben wie nur möglich. damit bekommst du auch am meisten farm und kannst ggf ahead gehen in der lane. noch ein wichtiger punkt ist, du musst lernen zu erkennen wann du kämpfen kannst und wann nicht. das ist ein extrem wichtiger faktor. wenn dein gegner 2/0 steht weil ihr den ersten kampf verkackt habt, solltet ihr nicht zwingend aggresive spielen auser ihr erwartet das euer jungler euch campt. \n\nwas ich von dem kollegen der diamon spielt oder gespielt hat, gelernt habe ist, wer auf der lane als erstes lvl 2 erreicht, gewinnt diese meistens. also wenn du es dir zutraust dann push darauf. die meisten supports haben eine powerspike mit ihrem zweiten lvl wie  z.b leona. wenn ihr also lvl 2 hittet und direkt engaged habt ihr einen massiven vorteil. und ansonsten ein kleiner tipp von mir noch, in den ersten 10 minuten ist zwischen 60 und 90 farm ein muss! wenn du darunter bist musst du dir was überlegen weil die gegner euch weg zonen ooder du musst das last hitten besser üben =)\n\nwenn du nochn tipp brauchst schreib mir einfach \n\ngl hf\n\n*EDIT*\n\nwas mir noch eingefallen ist, konzentrier dich am anfang auf ADC's die einfach zu spielen sind. \nso lernst du die klasse am besten.\nhier liegt meine empfehlung bei: Sivir, Ashe, Caitlyn oder jinx da du die so sehr magst :P\nwarum diese champs: da diese, relativ einfach auszuführende skills haben. wenn du jetzt mit vayne oder kalista spielst als beispiel, solltest du adc schon etwas drauf haben da die soch mehr macro management benötigen als die oben genannten um zu dominieren.\ndie oben genannten sind eher, steh hinten und halt volle kanne drauf :P weiterhin hat man mit ashe und sivir, auch ohne gap closer, gutes überlebens potential. sivir mit spell shield und ihrem ulti, ashe mit den TAUSEND slows :P. caitlyn hat mit ihrem netz nen netten gap closer und jinx mit den traps und ihrer passive die das movement erhöhen haben da auch nen gutes survival  potential \n\n\n*EDIT²* :D\n\nNOCH ein wichtigiger punkt, der dich in deinem spiel als adc, wenn du es meisterst EXTREM weit bringt is das Obwalking/Stutterstepping\n\ndas heisst du machst einen auto attack und bewegst dich danach direkt und machst den nächsten auto attack. so bist du permanent in bewebung und der gegner kann dich nicht so einfach focusen. \n\nhier nen guide dazu: \nhttp://www.baronbuff.de/news/2013/10/spielmechaniken-erlernen-orb-walking-animation-cancelling\n\nweiterhin, wenn du englisch beherrscht, kann ich dir den twitch stream von geranimo empfehlen. ist nen master ADC in nord amerika. der unterschied ist, er erklärt extrem viel von seinem spiel warum wieso weshalb. hier kannst du warscheinlich auch noch einiges mitnehmen können.","replies":[]},{"poster":"DarkShadows22","date":"2015-09-14T13:27:29.084+0000","up_votes":1,"down_votes":0,"body":"{{champion:51}} {{champion:22}} {{champion:429}} {{champion:21}} sind alle gut^^","replies":[]},{"poster":"nOeTHe","date":"2015-09-13T17:39:22.267+0000","up_votes":1,"down_votes":0,"body":"Early Q Trades und agressiv spielen, den Jungler rufen, damit ihr den Tower pushed, Optimal: kein Bot Tower um Minute 6 dann Mitte und zur Not danach Top/Dragon machen und danach das Spiel stabilisieren. Das war mein allgemeiner Jinx Spielplan und das müsste eigentlich noch ganz gut funktionieren.","replies":[]}]}