{"poster":"Kill Myself Slow","date":"2018-09-01T14:12:49.042+0000","title":"Why banning doesn't work, Prisoner Island does, and Riot has no idea what they're doing","subforum":"Player Behavior","up_votes":2,"down_votes":22,"body":"Oh No! You were toxic and said something you shouldn&#039;t have in the heat of the moment. This was a very bad thing to do and as punishment riot will now revoke your property and account that you have spent possibly years on and who knows how much. Well? What do you do now? That is the core of the argument on player reform and why banning is not only ineffective but harmful and why the much debated Prisoner Island is a better long-term solution with a higher result rate and more tangible benefits, and why Riot is absolutely wrong and misguided when they introduced the automated system and refused to implement Prisoner Island as a reform system when it was first discussed under the logic of &quot;You don&#039;t want to be there&quot;\r\n\r\nSo banning is the most popular means of dissuading negative behavior on the internet. It has been around as long as the net has but, one key element is different in why banning is say more effective in call of duty or overwatch than it is in Heroes of the storm or League of Legends. The latter does not cost anything to start right back up again angrier and bitter than ever with the goal of just making everyone miserable.  This is the problem with banning as a method of reform in League, it doesn&#039;t actually keep anyone from playing, all it does is force an already angry possibly mentally unstable individual to make a new account and harass newer players or congregate with the same type of banned &#039;smurfs&#039;.  Let me be clear Prisoner Island does exist it&#039;s called the new player experience and blind normals.\r\n\r\nBlind normals are the most apathetic toxic game mode I have ever seen next to Aram&#039;s pure 5 bot teams. Nobody cares enough to try to win, they get mad when they don&#039;t win, or when YOU prevent them from being the glorious solo lane carry they believe themselves to be. In short Blind Normals are full of delusional bitter toxic players with no other resource than to abuse the system that allows them to make a new account. Riot might not have intended to make Prisoner Island but Blind Normals can&#039;t be called anything other than Prisoner Island.  What&#039;s worse is that this form of Prisoner Island doesn&#039;t work at all. It&#039;s like a holding cell that you can break out of at level 30 if you manage to not get banned before that but then those same natural character tendencies work themselves up again and the cycle continues.{{champion:75}} \r\n\r\nHow do we stop this mire of flaming trolls, afk&#039;s, and just not very nice people? Simply don&#039;t take away their time invested accounts. I know! Hear me out. Prisoner Island as a concept is a place where people with less than Honor Level 2 are sent to reform giving them full access to their accounts, allowing them to play as much as they want unrestricted in chat, but unlike the normal game modes, Prisoner Island has a hidden win condition. Reform by collecting honors of every kind across a specific number of games. Play the games but don&#039;t get the honor, you start a new probation, get the honor but not play the games, you stay there. The concept is not only simple but it&#039;s actually beneficial to the toxic players as well. There are people who might never want to leave Prisoner Island because they can be as rancid and toxic as they want and it doesn&#039;t hurt anyone who doesn&#039;t want to be there.\r\n\r\nLet&#039;s be real Flame is apart of the Game, it has been, it always will be, only recently has Flame been treated like the second mortal sin itself. Allowing people to flame will believe it or not reduce the level of toxicity in players because it serves to vent their frustration. But OH THINK OF THE CHILDREN! you may say but... children shouldn&#039;t be playing this game to start and if they&#039;re on Prisoner Island, to begin with, they&#039;re toxic too. Now we get to the actual idea of why Prisoner Island works.\r\n\r\nEnough games with the worst that league has on tap, and you will start playing more positively and start trying to encourage teammates to get that honor to get out. If you hate Prisoner Island and truly wish to reform. You&#039;ll focus on improving your gameplay enough to impress your team members, get better at the game, and not incite flame wars to farm honors. Instead of hopping from account to account never truly paying for your mistakes, learning from them. You will buckle down and work to get your account back into &quot;Normal&quot; games. The entirety of league will benefit from this because Prisoner Island actually gives reform a chance to happen unlike continuous banning because &quot;Who cares if I get banned on a level 7 account with nothing on it&quot; is a prevalent mindset in the community.\r\n\r\nRiot does not understand psychology. If they did they wouldn&#039;t have such a horrible community management problem. League is for lack of better words a chore to play with the right team comp. A simple fun game made to goof around and play a champ with different builds, runes, or just something you never played before becomes YOU HOLDING THIS GOLD 4 SMURF FROM BEING LEVEL 30 AGAIN AND PLAT THIS TIME. This is what happens when you proliferate your new and casual player experience with experienced but toxic veterans. Every game starts to carry personal weight and the responsibility to win magnifies in the worst person&#039;s eyes. This in turn has a broken window effect. New players learn the toxic behavior from banned players and in turn become toxic themselves. I asked a friend who never played league to give it a shot. His first game was, a nightmare, with a silver 4 akali smurf barking commands and orders at a level 5 player. I urged them to keep trying and recorded their interaction with the game. First they were timid and scared then they started to get frustrated and vocal finally it devolved into capslock arguments about being toxic and crap at the game by game 10. 10 games to turn a totally new player into a raging keyboard warrior. Now is this a scientific experiment? Absolutely not I WISH someone would actually do a psychological study on league and the effects it has but sadly Harvard sent my proposal back {{sticker:slayer-jinx-unamused}} \r\n\r\nBut Riot pretends to think that this cycle of Ban, Smurf, Ban, Smurf, Ban, Smurf isn&#039;t one of the key factors making their game almost unplayable (Not talking about balance here) and refuse to take immediate and effective action like implementing Prisoner Island or changing matchmaking to group similar HONOR LEVEL players together to ensure at least some cohesive form of reward for actually playing honorably, because skins are dumb, wards are worse, and borders especially temporary ones motivate nobody. It is time Riot stopped treating their player base like children who quit when they get set back (like they tell us not to do in games) and recognize that a LARGE portion of the playerbase are teenage to adult who literally have nothing better to do than play... and if they can&#039;t play their main account, troll on an alt.\r\n\r\nThank you.","replies":[{"poster":"Imperial Pandaa","date":"2018-09-01T14:50:54.497+0000","up_votes":9,"down_votes":0,"body":"That is all just your opinion on the matter.\n\nThe reason for perm bans is to have a price for getting in trouble because no one wants to lose something they invested time and potentially money into. By making an Island, which comes with its own slew of problems, you also start saying \"Hey! Be as toxic and volatile as you want! No bans!\" Which begins to actually push more people away, but I'll address my grievances with the Prisoner Island next.\n\nIssues I have with the idea (yes, my opinion):\n\n1. As stated, it will push away more people than bans do. Remember, the number of people punished is actually a minority. \"But they'll end up at PI.\" After how long though? How much damage will they cause first?\n\n2. Cost; unless you are limiting the game mode for the Prisoner Island, then Riot will have to make game servers for each of the game modes and maps. \"They aren't a small idie company and can afford it.\" Yes, but for how long? A game needs to be profitable or even at worse. When it starts to cost more to maintian servers than what you make, games start shutting down.\n\n3. In and Out; When do you go into PI? First offense? At Perm? After both chat restricts? Are you including gameplay bans? Depending on how you answer these, the situation is worse for people who may only make the mistake once. You mentioned having a hidden Honor way out too. What happens when people don't honor anyone? What if they are only honoring the person who carried? What if they honor the biggest troll/flamer in the match? You start running the risk of the wrong people getting out.\n\n\nNow, you want to claim that blinds and the NPE is \"Prisoner's Island\" and again I will mention that is your opinion. I don't have much issues in blinds with toxicity of any kind (gameplay or verbal) and when I made new accounts, it was fairly obvious I was playing with other smurfs. Yes, probably by level 5 you are going to mainly be playing against other people of similar mmr (smurfs) anf again, don't seem to have any issies with toxicity.","replies":[{"poster":"Kill Myself Slow","date":"2018-09-01T15:10:32.340+0000","up_votes":1,"down_votes":3,"body":"Question 1\nHow invested are you in a game where within five levels you have enough BE to get any champ available (over 13K if you choose to disenchant every shard you get) There is no investment in a game where nothing actually costs anything besides cosmetics.\n\nQuestion 2\nWho are toxic people hurting by being toxic to other toxic people? You assume that I'm changing the way the automated system works. It would take as long as it does presently and nothing would change on your end of the spectrum. My argument is to give reform a chance instead of continuing a vicious cycle of petty spiteful account making.\n\nQuestion 3\nYes they should be locked to a game mode called Prisoner Island (Lord knows they have space since dominion RIP) and riot is profitable don't act like riot doesn't make hand over fist. Riot doesn't get to be one of the biggest game companies in the world and the poor man, it doesn't work both ways.\n\nQuestion 4\nHow would you determine when prisoner island is tennible, obviously you could use shock tactics and have scaling requirements for release but you propose gaming the system. Thing is you can't stop bad people from doing bad things, however you should never prevent good people from doing good things to prevent bad people from doing bad things. Yes the system can be cheesed however they will just throw themselves back in because they didn't EARN their way out, conversely, anyone who does will have reformed honestly and truly. \n\nYou see the game for what you see it as, of course my opinion is all I can present, but to discard a 'small minority' is actually a very ignorant thing to do because that minority is still in your games, being toxic, ruining them,  and even if YOU don't personally experience (Which being totally honest is a very selfish and close-minded point of view to be expressed, so long as you aren't bothered then it's fine) Others are. Toxicity is the number one criticism of any new player to league.","replies":[{"poster":"Imperial Pandaa","date":"2018-09-01T15:49:59.947+0000","up_votes":4,"down_votes":0,"body":"Answer 1\nTime is still an investment itself, hence why I said \"time and potentially money\". I realize not everyone spends money on the game, but you still spend time.\n\nAnswer 2\nYou misread what I actually put or maybe what I meant was clear enough. As of right now, people don't want to lose an account and are more likely to at least pretend to behave. With your system it is a matter of just being placed with similar people eventually. Since you won't lose your account, what is the point in behaving?\nAdditionally, let us take a look at our EUW friend, Gumbas.\n>People just don't understand there are toxic players who are toxic for the sake of being toxic and there are the \"toxic\" players who are sick of recieving shit but not giving any\n\nSo do I believe Gumbas is a toxic individual? Not at all. But based on his closing statement, I truly believe he would have issues leaving PI because of lashing out against toxic people.\n\nAnswer 3\nSo you are restricting them to a singular mode and map. I still believe the \"cycle\" would continue with this then. People would want to return to their modes of choice and realize it is easier to just create a new account. Now they are still upset at Riot for locking their account in a place they can't leave. \nYes, Riot currently makes profit and could immediately maintain those servers. But how long could they keep them? Same argument presented when people want Riot to hire 1k people to perform manual reviews for \"trolls\". They can, but eventually the cost outweighs the benefits.\n\nAnswer 4\nI don't propose how to game the system. These are legitimate questions that you need to answer for your idea. \nWhen does someone fall into the PI system? This is an actually important question.\n\n I imagine you are familiar with GTAV. And how they essentially use PI. I got sent there for blowing up other players cars because they either kept trying to run me over or had a bounty on them. I quit playing after that because I was placed in a PI for false reasons.\n\nWhich is why again you need to answer \"When does someone actually fall into the PI system?\".  Too early and many people will quit, especially without clear cut way to get out. Too late and damage is already done.\n\n\nIf you want to call me close minded, then you need to accept that you are as well. I understand that toxicity is a problem. You want to claim that the moment you get a chat restriction, you are set to be permanently banned. Old data we have been given states otherwisre. Anecedotal evidence of players will show otherwise too. I got pinged by the system once, and then never got pinged again. You speak as if people permed are guaranteed to make a new account and ruin more games.","replies":[{"poster":"My Names Gumbas","date":"2018-09-01T15:53:21.471+0000","up_votes":1,"down_votes":0,"body":"> So do I believe Gumbas is a toxic individual? Not at all. But based on his closing statement, I truly believe he would have issues leaving PI because of lashing out against toxic people.\n\nAye, If i'll get a chance to enter PI and get my account back, I'm gonna literally suck dick all day long until deemed reformed.","replies":[{"poster":"Subdue","date":"2018-09-01T15:55:28.667+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=My Names Gumbas,realm=EUW,application-id=ZGEFLEUQ,discussion-id=7yQ2naux,comment-id=0002000000000000,timestamp=2018-09-01T15:53:21.471+0000)\n>\n> Aye, If i&#x27;ll get a chance to enter PI and get my account back, I&#x27;m gonna literally suck dick all day long until deemed reformed.\n\nSo, why didn't you do that when you got your first warning?","replies":[{"poster":"My Names Gumbas","date":"2018-09-01T16:06:19.613+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Subdue,realm=NA,application-id=ZGEFLEUQ,discussion-id=7yQ2naux,comment-id=00020000000000000000,timestamp=2018-09-01T15:55:28.667+0000)\n>\n> So, why didn&#x27;t you do that when you got your first warning?\n\nI actually did, Unfortunately I came across such a major asshole that it kind of woke my \"dark side\". Dropped the \"k(y)s\" bomb, Realized what I just did, Got up and starting jumping in place for about 10 minutes.\nThen after 3 minutes in the client a reform card appeared {{sticker:zombie-nunu-bummed}}","replies":[]}]},{"poster":"Imperial Pandaa","date":"2018-09-01T16:01:40.250+0000","up_votes":1,"down_votes":0,"body":"NA is currently doing an unban experiment. Perhaps if it does well, more will happen and on other servers.","replies":[{"poster":"Kill Myself Slow","date":"2018-09-01T16:05:36.078+0000","up_votes":1,"down_votes":0,"body":"can you provide a source for this, this experiment greatly interests me.","replies":[{"poster":"My Names Gumbas","date":"2018-09-01T16:39:27.576+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Kill Myself Slow,realm=NA,application-id=ZGEFLEUQ,discussion-id=7yQ2naux,comment-id=000200000000000000010000,timestamp=2018-09-01T16:05:36.078+0000)\n>\n> can you provide a source for this, this experiment greatly interests me.\n\nhttps://www.reddit.com/r/leagueoflegends/comments/93636h/permanent_bans_only_being_lifted_in_na/\n\nhttps://www.reddit.com/r/LeagueOfMeta/comments/938ms8/permanent_bans_only_being_lifted_in_na/\n\nIf it succeeds it may expand to other regions too.","replies":[]}]},{"poster":"My Names Gumbas","date":"2018-09-01T16:07:24.159+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Imperial Pandaa,realm=NA,application-id=ZGEFLEUQ,discussion-id=7yQ2naux,comment-id=00020000000000000001,timestamp=2018-09-01T16:01:40.250+0000)\n>\n> NA is currently doing an unban experiment. Perhaps if it does well, more will happen and on other servers.\n\nFor real? Hopefully it'll work and be expanded to EUW. I really miss my 260 euros {{sticker:zombie-nunu-bummed}}","replies":[]}]}]},{"poster":"Kill Myself Slow","date":"2018-09-01T16:11:14.322+0000","up_votes":1,"down_votes":0,"body":"A majority of smurfs play Summoners Rift not Twisted Treeline because it's full of bots, not arams because it's full of bots and hard to carry, not rotating game mode, Nexus MIGHT be a viable option if it gives good EXP. Summoners Rift is the only game mode that toxic smurfs spam except when missions come up. So no other modes for Prisoner Island aren't needed or even recommended since Summoners Rift is the 'actual' mode for league and learning to play on that is what the goal of Prisoner Island is.\n\nTo cut all your arguments short, I'm not an analyst, an accountant, a game designer, or a psychologist. I had an idea and expressed it. This isn't my hill to die on its riots because without reform without new players, their game will die. It's not a matter of preference it's a matter of fact and time.\n\nIn the end I don't care what riot does or if they fail or fly they're a tool to me and nothing more. I just wanted to help people who honestly want to reform because Riot doesn't they want to 'remove' their problems and pretend they don't exist. This attitude permeates the entire company, sweep it under the rug, is riot's gameplay design, community management, crisis control and company motto. \"Riot Games If we don't acknowledge it it doesn't exist\"","replies":[{"poster":"Imperial Pandaa","date":"2018-09-01T17:30:58.496+0000","up_votes":1,"down_votes":0,"body":"That is fine, but here is a counter idea.\n\nSince you want to create a gameplay server why not just go for a Toxic Queue? A queue you can go in voluntarily and tbe report function simply doesn't work in it.\nSure it has downsides too, but it is something. Then the punishment system can remain the same.","replies":[{"poster":"Kill Myself Slow","date":"2018-09-01T21:44:11.836+0000","up_votes":1,"down_votes":0,"body":"I'm all for this idea as well as a stress relief but it would be kind of impossible to uphold standards of internet practices with such a mode. But some kind of vent would be healthy for the league populice I fully support Sewer Que","replies":[]}]}]}]}]}]},{"poster":"Subdue","date":"2018-09-01T14:50:41.859+0000","up_votes":4,"down_votes":0,"body":"Nope, I'd rather they just keep banning toxic players.  They should also be far more strict against toxicity at the early levels and have MMR adjust more aggressively to separate smurfs from real new players more quickly.","replies":[{"poster":"Kill Myself Slow","date":"2018-09-01T15:02:47.135+0000","up_votes":1,"down_votes":2,"body":"Problem is, banning a toxic player doesn't get rid of them, unless you're only selfishly thinking of your own rank tier. In which yes Banning does work for single solo q rank but they eventually show up again and again and again and my solution was more a grand scheme of things solution.","replies":[{"poster":"Subdue","date":"2018-09-01T15:19:06.649+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Kill Myself Slow,realm=NA,application-id=ZGEFLEUQ,discussion-id=7yQ2naux,comment-id=00010001,timestamp=2018-09-01T15:02:47.135+0000)\n>\n> Problem is, banning a toxic player doesn&#x27;t get rid of them, unless you&#x27;re only selfishly thinking of your own rank tier. In which yes Banning does work for single solo q rank but they eventually show up again and again and again and my solution was more a grand scheme of things solution.\n\nCorrection: It doesn't get rid of _all_ of them.  A good number of permanently banned players leave the game.  Some make smurfs, but a lot of them just leave.  I know if I ever failed to meet the super low behavior threshold of not being an asshole and lost my account over it, I'd probably leave.  \n\nAnd like I said, in combination with permanent bans, MMR should move more quickly at low levels to separate smurfs from real new players, and the threshold for getting penalized at low levels should be much less forgiving, to quickly ban out toxic players again.\n\nI also wouldn't be opposed to Riot using something other than email address for verification.  Perhaps require a non-internet phone number.  That would create an additional barrier to smurf creation.","replies":[{"poster":"Kill Myself Slow","date":"2018-09-01T15:26:30.180+0000","up_votes":2,"down_votes":1,"body":"Again, you're framing all your arguments from a personal lense and making strawman arguments demonizing people who have been judged toxic. There's no evidence that people actually quit the game once they get banned, in fact, there's more evidence that the opposite is true and almost nobody stays away once they get banned.  I'd love to see your statistics stating that Perma banned players leave in any number. Also the threshold isn't low for toxic behavior actually it's pretty high to not be toxic. You have two choices either be false positive 100% of the time or stay utterly absolutely silent. Any criticism perceived or otherwise can net you a chat restriction and from there it just goes downhill until you adopt one of the two aforementioned attitudes\n\nThat's why /mute all exists and why a lot of games have no interaction between the enemy teams.","replies":[{"poster":"Subdue","date":"2018-09-01T15:48:07.153+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Kill Myself Slow,realm=NA,application-id=ZGEFLEUQ,discussion-id=7yQ2naux,comment-id=0001000100000000,timestamp=2018-09-01T15:26:30.180+0000)\n>\n> Again, you&#x27;re framing all your arguments from a personal lense and making strawman arguments demonizing people who have been judged toxic. There&#x27;s no evidence that people actually quit the game once they get banned, in fact, there&#x27;s more evidence that the opposite is true and almost nobody stays away once they get banned.  I&#x27;d love to see your statistics stating that Perma banned players leave in any number. Also the threshold isn&#x27;t low for toxic behavior actually it&#x27;s pretty high to not be toxic. You have two choices either be false positive 100% of the time or stay utterly absolutely silent. Any criticism perceived or otherwise can net you a chat restriction and from there it just goes downhill until you adopt one of the two aforementioned attitudes\n> \n> That&#x27;s why /mute all exists and why a lot of games have no interaction between the enemy teams.\n\nThe evidence is that Riot says when they permanently ban people, most of them don't come back.  Yes, you see some people coming back.  That doesn't mean that everyone comes back, or even that most comes back.  What would the proof be of someone not coming back?  You don't see them around?  Guess what, you don't see them around.\n\nAnd I am not demonizing anyone.  Riot has stated that the VAST MAJORITY of players never get so much as a warning.  And then of those that do, the VAST MAJORITY never get a second one because they reform.  It is a TINY fraction of the player base that absolutely refuses to meet the minimum behavioral requirements, the absolute most basic levels of human decency which end up permanently banned.\n\nThere was a comment earlier of the \"pedestal paradox.\"  The idea behind the comment was that the few non-toxic players are standing on a pedestal while the masses swarm underneath.  But that's not the case.  It is the vast majority of players playing on common ground while the toxic players are swimming around in the sewers.\n\nEdit: And by the way, I offer criticism once in a while. I have never been penalized. In fact, I did so just last game. Granted, it was ARAM, but our Veigar wandered over to them and got picked off before our team was even close. My criticism, \"We need to stop getting picked off. Let's stick together.\" My criticism was not, \"Fucking Veigar stop feeding.\" It isn't criticism that gets penalized, it's harassment. You can provide criticism without being an asshole.\n\n","replies":[{"poster":"Kill Myself Slow","date":"2018-09-01T16:03:34.420+0000","up_votes":1,"down_votes":3,"body":"Honestly sub, you seem incredibly toxic, and I have a hard time believing a single word you say because of the way I have seen you behave on the boards. This is my personal opinion but that's all I have to go on. If I was in game with you and I made an honest mistake and you felt the need to criticise me I might feel the need to report you for negatively impacting my experience. Who are you to tell me what to do? Who elected you team captain? Why didn't you come with me if I was out so far why were you afk? \n\nThe list goes on and on for justifications why people too afraid to admit their own faults, too afraid to admit that they don't know best, prejudice others and turn on them.\n\nAlso you completely misunderstood the paradox. The paradox is that for there to be NORMAL there must be subnormal. You the community have turned toxic players into the subnormal, rather than sinners repentant, they are the damned. The paradox warns that people who elevate themselves above others by virtue of deed or birth are neither deserving or any better than those they scorn.","replies":[{"poster":"Subdue","date":"2018-09-01T17:27:15.612+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Kill Myself Slow,realm=NA,application-id=ZGEFLEUQ,discussion-id=7yQ2naux,comment-id=000100010000000000000001,timestamp=2018-09-01T16:03:34.420+0000)\n>\n> Honestly sub, you seem incredibly toxic, and I have a hard time believing a single word you say because of the way I have seen you behave on the boards. This is my personal opinion but that&#x27;s all I have to go on. If I was in game with you and I made an honest mistake and you felt the need to criticise me I might feel the need to report you for negatively impacting my experience. Who are you to tell me what to do? Who elected you team captain? Why didn&#x27;t you come with me if I was out so far why were you afk? \n> \n> The list goes on and on for justifications why people too afraid to admit their own faults, too afraid to admit that they don&#x27;t know best, prejudice others and turn on them.\n> \n> Also you completely misunderstood the paradox. The paradox is that for there to be NORMAL there must be subnormal. You the community have turned toxic players into the subnormal, rather than sinners repentant, they are the damned. The paradox warns that people who elevate themselves above others by virtue of deed or birth are neither deserving or any better than those they scorn.\n\nYou'd be well within your rights to report me if you wanted to.  It's very unlikely that I get penalized for something like that because something like that is not toxic, but none the less, if you find yourself offended you can and should report.  That's how the IFS gets better, but honing in on what sort of behaviors the community deems toxic.  You deserve your voice just as much as anyone else.\n\nThat said, you have a very distorted view of what's considered toxic, and just as importantly, what gets penalized.  You want us to believe that you were a victim here, but you weren't.  You made choices that got you banned, and you made those choices knowing the consequences.  The \"normal\" players didn't put you were you are.  You did it yourself.","replies":[{"poster":"Kill Myself Slow","date":"2018-09-01T21:40:24.300+0000","up_votes":1,"down_votes":0,"body":"When did I act like a victim? You assumed I was toxic and I've never acted the victim I've simply proposed an idea to help other people. \"The victim\" are the people who act like the idea of toxic people being allowed to play their locked accounts in an isolated area away from them (unless they are toxic) will somehow impact them in any way. You are worrying about skirmishes in another country acting like it's happening outside your front door. Let me ask you this, really, what would implementing Prisoner Island cost you personally?\n\nSounds like post-abolition American panic if you ask me, now that the toxic minority are back and just want to live in peace better move to the suburbs and build a security fence and get some guns.","replies":[{"poster":"Subdue","date":"2018-09-02T01:20:25.585+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Kill Myself Slow,realm=NA,application-id=ZGEFLEUQ,discussion-id=7yQ2naux,comment-id=00010001000000000000000100000000,timestamp=2018-09-01T21:40:24.300+0000)\n>\n> When did I act like a victim? You assumed I was toxic and I&#x27;ve never acted the victim I&#x27;ve simply proposed an idea to help other people. &quot;The victim&quot; are the people who act like the idea of toxic people being allowed to play their locked accounts in an isolated area away from them (unless they are toxic) will somehow impact them in any way. You are worrying about skirmishes in another country acting like it&#x27;s happening outside your front door. Let me ask you this, really, what would implementing Prisoner Island cost you personally?\n> \n> Sounds like post-abolition American panic if you ask me, now that the toxic minority are back and just want to live in peace better move to the suburbs and build a security fence and get some guns.\n\nWhen did you act like a victim.  Hmm...\n\n> [{quoted}](name=Kill Myself Slow,realm=NA,application-id=ZGEFLEUQ,discussion-id=7yQ2naux,comment-id=000000000000000000010000,timestamp=2018-09-01T15:01:34.600+0000)\n>\n> Well, that gets into an argument about whether toxicity is an open choice behavior or an ingrained social response brought about by nurture. Thing is, you guys openly treat toxic players trying to reform as badly as southern plantation owners treated slaves. You are toxic to the toxic people which in the grand scheme of things just proves how we all deserve a chance.\n\nOh and...\n\n> [{quoted}](name=Kill Myself Slow,realm=NA,application-id=ZGEFLEUQ,discussion-id=7yQ2naux,comment-id=000100010000000000000001,timestamp=2018-09-01T16:03:34.420+0000)\n\n> Also you completely misunderstood the paradox. The paradox is that for there to be NORMAL there must be subnormal. You the community have turned toxic players into the subnormal, rather than sinners repentant, they are the damned. The paradox warns that people who elevate themselves above others by virtue of deed or birth are neither deserving or any better than those they scorn.\n\nI could probably find more, but there's no point really.\n\nAs for how it affects me: Softer penalties are weaker deterrents for toxic behavior.  Weaker deterrents means more toxic behavior, which means lower quality for my games as well.\n\nAnd you keep going back to _deserving_ a chance.  but why?\n\nYou make an interesting comparison there with slaves.  Slaves were kidnapped from their villages and brought over unwillingly.  They were oppressed from the start.  This is not the same for toxic players.  They didn't start off at the bottom, they started off on the \"pedestal\" with the rest of us.  Their own choices, their own behavior were the cause of their situation.  They're the ones who inflicted upon the \"normal\" players their vitriol.  And even then, they were given chance after chance, warning after warning to reform, and they chose not to, even to the point of being permanently banned.\n\nAnd by the way, these players that you are trying to defend, that you are saying deserve pity, mercy, and a second chance, they are the same players you are saying will create smurfs and intentionally ruin the experience of new players.  So which is it?  Are they on the path to reformation or are they permanently toxic even on a new account?  That's why they don't deserve another chance.  They should lose their accounts, and if they truly want to reform and continue being part of the community, they should create new accounts and do things right.","replies":[]}]}]}]}]}]}]}]},{"poster":"My Names Gumbas","date":"2018-09-01T14:52:24.222+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Subdue,realm=NA,application-id=ZGEFLEUQ,discussion-id=7yQ2naux,comment-id=0001,timestamp=2018-09-01T14:50:41.859+0000)\n>\n> Nope, I&#x27;d rather they just keep banning toxic players.  They should also be far more strict against toxicity at the early levels and have MMR adjust more aggressively to separate smurfs from real new players more quickly.\n\nPeople just don't understand there are toxic players who are toxic for the sake of being toxic and there are the \"toxic\" players who are sick of recieving shit but not giving any.","replies":[{"poster":"CheapKill","date":"2018-09-01T14:55:44.547+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=My Names Gumbas,realm=EUW,application-id=ZGEFLEUQ,discussion-id=7yQ2naux,comment-id=00010000,timestamp=2018-09-01T14:52:24.222+0000)\n>\n> People just don&#x27;t understand there are toxic players who are toxic for the sake of being toxic and there are the &quot;toxic&quot; players who are sick of recieving shit but not giving any.\n\nBoth are toxic both are wrong both deserve to be banned","replies":[{"poster":"My Names Gumbas","date":"2018-09-01T16:01:50.332+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=CheapKill,realm=NA,application-id=ZGEFLEUQ,discussion-id=7yQ2naux,comment-id=000100000000,timestamp=2018-09-01T14:55:44.547+0000)\n>\n> Both are toxic both are wrong both deserve to be banned\n\nI'd like to disagree.\nThink about it like this : One of them is a terrorist that wants to see the world burn, The other one is a decent guy with anger issues that finally gives in.","replies":[]}]}]}]},{"poster":"My Names Gumbas","date":"2018-09-01T14:26:35.530+0000","up_votes":1,"down_votes":11,"body":"Honestly a prisoner island thing would be fucking epic, Permanently banning someone doesn't solve anything, But if he manages to climb out of the toxic pit that (in theory) is a prisoner island as a reformed player, He definitely deserves a place within the normal servers.\nAlso I want my account back {{sticker:zombie-nunu-bummed}}\n\nedit: Why are people downvoting me? Because I have an opinion?","replies":[{"poster":"Kill Myself Slow","date":"2018-09-01T14:29:43.237+0000","up_votes":1,"down_votes":6,"body":"Don't we all {{sticker:sg-soraka}} also its not even about necessarily climbing out, it's about caging in toxic players with sunken cost fallacy and making them not want to abandon their account and just play with fellow 'like minded' individuals if they truly don't want to change.\n\nPerhaps replace perma with \"permanent residence\" so they never, ever, ever get out.\n\nDon't get me wrong people will still smurf and troll if that's their prerogative, but this system at least favors people who want to truly reform instead of the trolls.","replies":[{"poster":"My Names Gumbas","date":"2018-09-01T14:37:29.151+0000","up_votes":2,"down_votes":7,"body":"People are downvoting us \"toxic\" players for having feelings too, {{sticker:zombie-nunu-bummed}} \nMaybe one day they'll understand we only say bad shit after getting poked with a stick enough times, And oh boy do people love poking us with sticks.","replies":[{"poster":"Kill Myself Slow","date":"2018-09-01T14:40:36.014+0000","up_votes":2,"down_votes":6,"body":"It's called the pedestal paradox those that are honorable are up on a pedestal above everyone who isn't and those who aren't 'normal' are deserving of scorn. If toxic players were a different race, League would be the most openly racist game on the market, there's no consideration for other players.","replies":[{"poster":"CheapKill","date":"2018-09-01T14:55:09.221+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=Kill Myself Slow,realm=NA,application-id=ZGEFLEUQ,discussion-id=7yQ2naux,comment-id=0000000000000000,timestamp=2018-09-01T14:40:36.014+0000)\n>\n> It&#x27;s called the pedestal paradox those that are honorable are up on a pedestal above everyone who isn&#x27;t and those who aren&#x27;t &#x27;normal&#x27; are deserving of scorn. If toxic players were a different race, League would be the most openly racist game on the market, there&#x27;s no consideration for other players.\n\nTrying to compare someone who chooses to be toxic and someone who was born with a certain color.....","replies":[{"poster":"Kill Myself Slow","date":"2018-09-01T15:01:34.600+0000","up_votes":1,"down_votes":3,"body":"Well, that gets into an argument about whether toxicity is an open choice behavior or an ingrained social response brought about by nurture. Thing is, you guys openly treat toxic players trying to reform as badly as southern plantation owners treated slaves. You are toxic to the toxic people which in the grand scheme of things just proves how we all deserve a chance.","replies":[]}]},{"poster":"My Names Gumbas","date":"2018-09-01T14:43:28.340+0000","up_votes":1,"down_votes":5,"body":"> [{quoted}](name=Kill Myself Slow,realm=NA,application-id=ZGEFLEUQ,discussion-id=7yQ2naux,comment-id=0000000000000000,timestamp=2018-09-01T14:40:36.014+0000)\n>\n> It&#x27;s called the pedestal paradox those that are honorable are up on a pedestal above everyone who isn&#x27;t and those who aren&#x27;t &#x27;normal&#x27; are deserving of scorn. If toxic players were a different race, League would be the most openly racist game on the market, there&#x27;s no consideration for other players.\n\nYep, \"Durrrr you had warnings\" Yeah no first 14days ban was because of the system lack of context detector and the permanent one was a result of extreme stick poking.","replies":[{"poster":"Kill Myself Slow","date":"2018-09-01T14:48:09.866+0000","up_votes":1,"down_votes":3,"body":"well let's not confuse the facts, punishment is punishment, we both did something to deserve punishment we can't blame the system or the stimuli if we truly want to reform but that is neither here nor there. \n\nThe problem with the pedestal paradox is that if everyone is equal, to feel superior, they must disenfranchise a 'lesser' group. In this case the toxic, this was a very harmful attitude in the forties that was aimed towards immigrants or anyone of different ancestry than 'the original' Americans. Thankfully this is on the internet because I do not hold a shadow of a doubt that some of these people would physically harm toxic players if they had a chance, the irony is beautiful isn't it?\n\nWhat's worse is those that stand to benefit from this clearly flawed system or fear reprisal as a 'former' toxic player immediately try to mute any idea that proposes change because they want to keep this superior feeling but at the end of the day...\n\nIt's all just video games isn't it? Why are people so animated and angry?","replies":[{"poster":"My Names Gumbas","date":"2018-09-01T14:50:34.685+0000","up_votes":1,"down_votes":4,"body":"> [{quoted}](name=Kill Myself Slow,realm=NA,application-id=ZGEFLEUQ,discussion-id=7yQ2naux,comment-id=000000000000000000000000,timestamp=2018-09-01T14:48:09.866+0000)\n>\n> well let&#x27;s not confuse the facts, punishment is punishment, we both did something to deserve punishment we can&#x27;t blame the system or the stimuli if we truly want to reform but that is neither here nor there. \n> \n> The problem with the pedestal paradox is that if everyone is equal, to feel superior, they must disenfranchise a &#x27;lesser&#x27; group. In this case the toxic, this was a very harmful attitude in the forties that was aimed towards immigrants or anyone of different ancestry than &#x27;the original&#x27; Americans. Thankfully this is on the internet because I do not hold a shadow of a doubt that some of these people would physically harm toxic players if they had a chance, the irony is beautiful isn&#x27;t it?\n\nThing is, Theres no chance to reform even if you'd like to.\nThe moment you get a 14days suspension you're marked for death, Sooner or later you WILL be banned.","replies":[]}]}]}]}]}]},{"poster":"breakordoom444","date":"2018-09-01T15:24:06.219+0000","up_votes":1,"down_votes":0,"body":"> edit: Why are people downvoting me? Because I have an opinion?\n\nbecuase people don't agree with you. \n\nbut then again, I can't argue in this post or with you, I don't give a shit about Riots agenda.","replies":[]}]},{"poster":"Sillae","date":"2018-09-01T19:31:41.068+0000","up_votes":3,"down_votes":0,"body":"\"This was a very bad thing to do and as punishment riot will now revoke your property and account that you have spent possibly years on and who knows how much.\"\n\nStopped reading the wall of text because it became invalid with that sentence.\n\nYou don't own your account, you don't own anything. Riot does. Riot *lets you* play the free account, and *offers* the *option* to buy skins for the account. In terms of service, they spell out that they can revoke everything at anytime for any reason. \n\nDidnt read your TOS? Well, you are the one who agreed to the legally binding contract without at least glancing over it.\n\nAnyway, prison island is a horrible idea. They'd have to spend lots of money regulating and sorting the good from the toxic, then keeping servers open reserved just for them. It's also basically not a punishment, they have no reason not to be toxic other than meeting more of their kind.\n\nJust take your ban, dude.","replies":[{"poster":"Kill Myself Slow","date":"2018-09-01T21:27:19.617+0000","up_votes":1,"down_votes":1,"body":"Okay, the first thing I'm not banned, Second of all I was never arguing that riot doesn't own your account it's called a HOOK it's meant to interest you with a scenario or proposition. It's not meant to be the core of the argument but anyone who reads one line of text and dismisses an entire few paragraphs obviously isn't the type to hold a literary discussion as much as a /league flame war. Second thing, this was a post to help people not myself but because you can't be altruistic I can understand how you think everyone is out for only themselves.\n\nPersonally dude, you sound a bit thick headed, your reasons for prisoner island being a bad idea make no clerical sense. Prisoner Island sorts the good from the bad automatically. The good will improve their play, care about their matches, not flame or bait flame, and generally become better players to escape the island and the bad won't and never will escape the island. INSTEAD OF JUST MAKING A NEW ACCOUNT AND BEING BAD IN COUNTLESS GAMES UNTIL THEY GET BANNED AGAIN AND DO IT AGAIN AND AGAIN... are people seriously so oblivious that they think a ban means anything to anyone who wants to be toxic?\n\nAlso perhaps the most important I did read the TOS riot does have the right to revoke access to the account but it's not legally binding anyone who knows a thing about law can point out the glaring holes such as no arbitration system, no settlement system, no means of reimbursement given the incident of a false flag, ect ect but I doubt you actually know anything about law you just parrot what Reddit says.","replies":[{"poster":"Sillae","date":"2018-09-02T02:17:54.301+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Kill Myself Slow,realm=NA,application-id=ZGEFLEUQ,discussion-id=7yQ2naux,comment-id=00080000,timestamp=2018-09-01T21:27:19.617+0000)\n>\n> Okay, the first thing I&#x27;m not banned, Second of all I was never arguing that riot doesn&#x27;t own your account it&#x27;s called a HOOK it&#x27;s meant to interest you with a scenario or proposition. It&#x27;s not meant to be the core of the argument but anyone who reads one line of text and dismisses an entire few paragraphs obviously isn&#x27;t the type to hold a literary discussion as much as a /league flame war. Second thing, this was a post to help people not myself but because you can&#x27;t be altruistic I can understand how you think everyone is out for only themselves.\n> \n> Personally dude, you sound a bit thick headed, your reasons for prisoner island being a bad idea make no clerical sense. Prisoner Island sorts the good from the bad automatically. The good will improve their play, care about their matches, not flame or bait flame, and generally become better players to escape the island and the bad won&#x27;t and never will escape the island. INSTEAD OF JUST MAKING A NEW ACCOUNT AND BEING BAD IN COUNTLESS GAMES UNTIL THEY GET BANNED AGAIN AND DO IT AGAIN AND AGAIN... are people seriously so oblivious that they think a ban means anything to anyone who wants to be toxic?\n> \n> Also perhaps the most important I did read the TOS riot does have the right to revoke access to the account but it&#x27;s not legally binding anyone who knows a thing about law can point out the glaring holes such as no arbitration system, no settlement system, no means of reimbursement given the incident of a false flag, ect ect but I doubt you actually know anything about law you just parrot what Reddit says.\n\n\" Second of all I was never arguing that riot doesn't own your account it's called a HOOK it's meant to interest you with a scenario or proposition.\"\n\nMust not be very well done, I suppose, if people stop reading, right?\n\n\"This was a very bad thing to do and as punishment riot will now revoke your property and account that you have spent possibly years on and who knows how much.\"\n\n*\"Your property\"*\n\nSo one of two things: You were intentionally lying, to try to incite the reader to side with you, or you realized you were mistaken and are trying to backpedal and make me look like the idiot. Either way, I'd recommend you sort through your thoughts before typing them in a frenzy and pressing post.\n\n\"Just take your ban, dude\" and most of the general post was directed at a toxic _audience_, though I suppose I should have made it clearer, I simply assumed most people would be able to tell.\n\nLots of ad hominems in your.. argument, which I could respond to, but choose not to, as they are not relevant.\n\nAnyway, bans do work for most people. Many leave or make a new account and fix their behavior. Some make new accounts and continue trolling. Oh well.\n\nAs for the legally binding thing, I *do* in fact know quite a bit. I know that, in general, a legally binding contract requires all parties to be in agreement (that's what clicking \"I agree\" means) and something of value must be exchanged, in this case Riot's services in exchange for your time and possibly money (should you choose). In addition, there must be rules and obligations, and a set response for a breach of contract. Which, if trolling or flaming, occurs. \n\nDo you have any idea how running something like League works? Genuine experience now, not what you read off the internet. If you do, great, apply for Riot and set your changes in motion. If not? Either get some or continue complaining pointlessly on a forum about a subject they were adamant of not doing.","replies":[]}]}]},{"poster":"usul1202","date":"2018-09-01T15:05:19.095+0000","up_votes":3,"down_votes":0,"body":"Riot has stated that their current punishment system is designed with reform in mind, up until perma ban where they just don't want you 0pay9ng their game anymore. Pi goes pretty much directly against promoting reform.....","replies":[{"poster":"Kill Myself Slow","date":"2018-09-01T15:14:27.931+0000","up_votes":1,"down_votes":4,"body":"How does prisoner island go against promoting reform when consequence-free punishment encouraging alternate account making unrestricted promote it.\n\nThe logic is backward if I don't care about the account getting banned, what stops me from being toxic? After the first perma (where yes the idea of perma ban as a threat does work) it loses all impact. Perma bans only deter new players with investment in their account, not trolls, not toxic vets, not griefers. There area of effect on Perma Bans is the most minimal it could be as opposed to Prisoner Island basically benefiting everyone.","replies":[{"poster":"usul1202","date":"2018-09-01T23:44:12.217+0000","up_votes":1,"down_votes":0,"body":"Where is the incentive to reform once you reach PI? You're in a toxic environment, which is going to massively increase flame even from those who don't normally. Gumbas said it himself, the thing that pushed him over was someone else being an asshole, so he dropped kys. Once you lob all of the toxics together, they're very unlikely to break habit.\n\nAlso, don't you have the exact same thing? There's no threat after you reach PI. Perma are the same, except you actually lost something. Which is riots way of saying \"please don't come back\". By their statistics, most perma banned players don't come back (but the ones that do would be more likely to be vocal)","replies":[]}]}]},{"poster":"Icy Hot Shoto","date":"2018-09-01T15:31:57.079+0000","up_votes":2,"down_votes":1,"body":"\"I got punished, make a prisoner island so I can still play even though Riot doesn't want me here.\"\n\nI'm guessing that's you?","replies":[{"poster":"Kill Myself Slow","date":"2018-09-01T15:37:14.328+0000","up_votes":1,"down_votes":2,"body":"Not really, I have no attachment to this game because I don't care about skins and every champ is available immediately, I don't play ranked because who cares, and I just use league to kill time while I write stories so Prisoner Island holds no benefit to me specifically. But to your question more, even though Riot doesn't want me here, I'm still here. I'm proof that bans don't work. Prisoner Island is a better solution for you who don't want me here because I will just play in prisoner island and waste time as I do, my enjoyment isn't impacted, yours isn't, nobody suffers with Prisoner Island.\n\nConversely, you get me in your games, I autolock random and just roll flash ignite with comet runes and your game gets ruined because I give absolutely no effort or concern for the outcome of the game. Of course I only play normals because I don't want to hurt people's ranked ambitions, but still, the game is lost more players become aggravated and toxic. They may report me and I may get banned but then I come back on a new account and do it again, and again, and again, and again purely because you leave me no choice.\n\nIt's kind of telling that you confuse my altruism as selfish justification. Just furthers the point of leagues abuse of 'toxic' players","replies":[{"poster":"AeroWaffle","date":"2018-09-01T16:43:00.630+0000","up_votes":2,"down_votes":0,"body":"Then the gaping hole in your prisoner island plan is that you would just create a new account to avoid it. After-all, it would be filled with similar players who also wouldn't have impulse control and would intentionally throw games once they wanted to spite another player. Proof that prisoner island wouldn't work.","replies":[{"poster":"Kill Myself Slow","date":"2018-09-01T21:29:31.001+0000","up_votes":1,"down_votes":2,"body":"Again as I've said A THOUSAND times Prisoner Island is not a resolution for me. It is to help people who want to reform and I am not one of those people. I see nothing wrong with what I did but I accept that Riot does so I'm not fighting them. I am offering people OTHER THAN MYSELF (Key words there) reform. PRISONER ISLAND IS NOT ABOUT KEEPING PEOPLE IN IT! IT IS ABOUT ALLOWING PEOPLE WHO WANT TO GET OUT AND KEEP THEIR ACCOUNT A MEANS TO DO SO RATHER THAN SHUTTING THEM DOWN COMPLETELY! DO PEOPLE NOT READ?","replies":[{"poster":"AeroWaffle","date":"2018-09-01T22:04:26.472+0000","up_votes":2,"down_votes":0,"body":"If your goal is to reform people, sticking them with a group of players that is much more likely to be rude is going to make that much more difficult. Since they will run into many more instances where another player is intentionally antagonizing them.","replies":[]}]}]}]}]},{"poster":"dKiWi","date":"2018-09-02T13:24:47.576+0000","up_votes":1,"down_votes":0,"body":"oh no! i have acne and depression so i am now qualified to rob a bank in singapore on impulse with no repurcussions allowed. I see where this line of logic is going","replies":[]},{"poster":"Thuban","date":"2018-09-01T17:57:16.289+0000","up_votes":1,"down_votes":1,"body":"You need self control and discipline. Which no one in the Americas(yes, North, Central & South) have. Too bad so sad. Learn self-control or don't speak at all. At a point where all social privileges just need removed, both digitally and physically/mentally.","replies":[{"poster":"Kill Myself Slow","date":"2018-09-01T21:30:52.158+0000","up_votes":1,"down_votes":1,"body":"Sorry to say but you sound like a totalitarian dictator and not someone I'd want to know in real life. The kind of person who thinks they're better than everyone else and anyone not as good as them *which is no one* should bow to their whims.","replies":[]}]}]}