{"poster":"Dartanyan W","date":"2015-07-20T09:31:58.195+0000","title":"Kalista VS Twitch","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":0,"body":"Hey, long time league player first time board poster.\r\n\r\nI understand these boards probably get inundated with &#039;nerf &lt;x&gt; omg so op!!&#039; after someone loses to a skilled player and goes on tilt, so let me just preface this by saying: I&#039;m not a skilled player, and I rarely go on tilt.\r\n\r\nI like to main twitch, I&#039;ve played twitch ever since the good ol&#039; days when his level 4 stealth was essentially permanent. But twitch has been nerfed since then, and I&#039;m fine with that. I still like the mechanics, and I still have a lot of fun with him.\r\n\r\nRecently though I&#039;ve been experimenting with a few other adcs, namely, kalista.\r\n\r\nKalista is ridiculous. I played one game with them, so, yeah, that doesn&#039;t constitute a pattern, but I will say: I never once used my &#039;e&#039; or my &#039;t&#039;. I just dodged everything. EVERYTHING. There was nothing the enemy could do to so much as hit me, and even if they did? That&#039;s what lifesteal is for.\r\n\r\nSo, let&#039;s just do a comparison between twitch, and old AD with standard, dota-esque mechanics, and Kalista, this new AD with admittedly creative, but clearly not-given-much-thought mechanics. Here&#039;s what you could do to make twitch on the same level as Kalista:\r\n\r\n1. Every time he moves his stealth activates or the cooldown is lowered by 1 second.\r\n\r\n2. Movement speed causes cooldown reduction on twitch&#039;s Q\r\n\r\n3. Twitch can use his W to not only slow an enemy, but link with an ally, allies linked with twitch apply stacks of his passive with their autoattacks, and when twitch uses his ulti his linked ally gets the same range benefit.\r\n\r\nAm I saying twitch is underpowered? Not as such, though I think he&#039;s more dependant than most other ADCs. Am I saying Kalista is overpowered? Maybe not the most, I&#039;m sure she has her counters, but apparently she&#039;s had her &#039;mobility&#039; nerfed recently. Really? What? Did they make it so it scaled less with movement speed? I don&#039;t think that&#039;s the point.\r\n\r\nGranted when it comes to taking the game seriously (ranked) people have the option to ban champions. I get that. On the whole I like league, and I think the devs make some sound decisions when it comes to balance. I think the problem is the expectation of the playerbase for their to be a new champion every week? Month? I dunno. Why not play the older champions? Oh, because they rely on old mechanics which, the way things are going, means they won&#039;t realistically be able to hit another player with an ability.\r\n\r\nThat being said, I&#039;m not annoyed or anything... I just think Kalista will be my new main adc from now on.","replies":[{"poster":"BarryButcher","date":"2015-07-20T09:42:23.822+0000","up_votes":1,"down_votes":0,"body":"We all know Kalista is annoying. thats why they gave us Maokai+Righetous Glory. Point and click CC with the ability to gap close that hopping bitc.h. Also Urgot. Urgot is apparently a nice \"counter\" to Kalista (that's what Pro players use anyway).\n\nYou're right that old Champions simply get \"outclassed\" when a new style of mechanics comes in. But that's what reworks are for (e.g. Sion)","replies":[{"poster":"Chicken4dinner","date":"2015-07-20T10:16:12.782+0000","up_votes":1,"down_votes":0,"body":"She is also really squishy in the sense that a lot of kalista players who are vsing decent opponents struggle to survive laning phase and therefore make a worthwhile impact mid to late game other then just being the first to die in a team fight.","replies":[]}]}]}