{"poster":"iTzSofett","date":"2015-11-28T15:56:38.026+0000","title":"Summoner Spells Ingame vertauschen","subforum":"Karten & Spielmodi","up_votes":1,"down_votes":1,"body":"hallo,\r\n\r\nIch wei&szlig; nicht ob es noch jemandem so geht wie mir aber ich habe ab und an vertauschte summoner spells.\r\n\r\nz.b. Flash auf D und ignite auf F, habe vergessen zu wechseln und wollte eigentlich Flash auf F und Ignite auf D haben.\r\n\r\nGibt es eine M&ouml;glichkeit diese Spells ingame, genau wie Items auf den Tasten zu &quot;verrutschen&quot; sodass ich sie auf den von mir eingespielen Tasten legen kann?\r\n\r\nSoviel zu meinem Gedanken,\r\n\r\nGru&szlig; iTzSofett","replies":[{"poster":"Powerjen","date":"2015-12-02T12:39:04.056+0000","up_votes":1,"down_votes":0,"body":"Das hab ich eigentlich nur im Zusammenhang mit Eloboosting/Accountsharing gehört. Ich will Dir nix unterstellen, aber normalerweise liegt {{summoner:4}} (beliebtester Spell ever) bei den meisten Spielern immer fest in einem Slot und nur der 2. ändert sich in der Belegung. Bei Leuten, die eine gewisse Zeit lang umgekehrte Belegung der Summonerspells haben, ist das ein kleines Indiz für den Verdacht, dass da noch jemand anders den Account bespielt.","replies":[{"poster":"CestLeMoi","date":"2015-12-19T20:47:35.539+0000","up_votes":1,"down_votes":0,"body":"Ich kann zwar nur von mir reden, aber ich ändere meine Summoner Spells **so gut wie jedes** Spiel. Bei mir ist es immer so: öfters benutzter Spell: D; weniger benutzter auf F. ZB D=Ignite, F=Flash und D=Smite/Exhaust, F=Flash aber D=Flash und F=Teleport.\nJust my 2 cents","replies":[]}]},{"poster":"ü ö","date":"2015-12-10T03:49:54.694+0000","up_votes":1,"down_votes":0,"body":"Ist mir in über 2000 Spielen noch **nie** passiert...","replies":[]},{"poster":"iTzSofett","date":"2015-12-09T15:09:05.968+0000","up_votes":1,"down_votes":0,"body":"ich bin bestimmt kein elo-booster :D bin froh wenn ich zeit finde ein paar spiele zu machen ^^ wen du elo-boosting mit schusseligkeit oder verpeiltheit ersetzt, gehe ich da voll mit xD\naber das mit der tastenbelegungändern ist ein netter hinweis, danke dir :)","replies":[]},{"poster":"ÆonFox","date":"2015-11-28T16:06:21.283+0000","up_votes":1,"down_votes":0,"body":"Du kannst in den Einstellungen die Tastenbelegung ändern, die Spells sind dann zwar immernoch an der gleichen Stelle aber die Tasten sind dann für dich richtig.","replies":[]}]}