{"poster":"DaemonicChivalry","date":"2015-02-25T11:10:13.467+0000","title":"Teemo, Why Was He Even Made","subforum":"Miscellaneous","up_votes":1,"down_votes":10,"body":"I hate teemo with a passion. Why was this champion even made. He is useless in every way and form. I got gifted a skin and guess what it was a teemo skin. why the hell would I want this garbage in my client/account to play with. I have teemo as a champion because I wanted the skins that came with the starter packs (Goth Annie and Huntress Sivir) as these skins in my opinion were worth it. Now I hate the fact that I have this champion in my champion line up. Riot. I urge you to reconsider the teemo idea. I feel like we can still be friends if you rid this game of the flee ridden, putrid smelling, skid mark infested rodent of a champion. Please riot I beg to you with all the prayers of the civilized world let this monstrosity end right here, right now. Only you have the power Riot to clean the mess that you have created in this world. Only you have the power Riot to set things back to their natural order.","replies":[{"poster":"War4kill","date":"2015-02-25T11:13:18.781+0000","up_votes":4,"down_votes":1,"body":"be happy or I will buy the skins for you instead of gift them, you love teemo, you love the fact that I with all the champs you own could mystery gift you one soooo wanted by you. I love you, it suits your style. I wish riot gives me the power to give you thee teemo set.","replies":[{"poster":"DaemonicChivalry","date":"2015-02-25T11:17:45.911+0000","up_votes":1,"down_votes":0,"body":"really? u spend that money on me? do it. because then when i did get mystery gifted again then I would know in my heart that I could never be let down by this kind of atrocity again. -.-","replies":[]}]},{"poster":"Crusader charlie","date":"2015-02-25T22:51:17.765+0000","up_votes":2,"down_votes":0,"body":"this is very mysterious.\nalthough seriously.. \n\nhttp://s1267.photobucket.com/user/Psykadellic/media/deal_with_it__by_darkiron-d30pb19.png.html\n\nhttp://forums.euw.leagueoflegends.com/board/attachment.php?attachmentid=116888&d=1363303911\n\n{{champion:17}} {{champion:17}} {{champion:17}} {{champion:17}} {{champion:17}} {{champion:17}} {{champion:17}} {{champion:17}} ","replies":[]}]}