{"poster":"Anopka","date":"2015-03-30T19:27:19.514+0000","title":"N.U.R.F. Mode - OP-Champs","subforum":"Karten & Spielmodi","embed":{"description":"Vor fast einem Jahr haben wir einen neuen Weg gestartet, League of Legends auf eine alberne, lustige Weise zu spielen, die dann das Wettkampfgleichgewicht auf den Kopf stellte und das jährliche Trollfest namens Aprilscherz feierte. Auch wenn wir letztlich nur rumblödelten, nutzten unsere Designer die Chance, an einer wahren Evolution eines von URF inspirierten League-Gameplays zu arbeiten.","url":"http://euw.leagueoflegends.com/de/news/game-updates/gameplay/wir-enthullen-die-zukunft-von-league-legends","image":"http://euw.leagueoflegends.com/sites/default/files/styles/wide_medium/public/upload/rdg46bs.jpg?itok=k8jcAhDO"},"up_votes":1,"down_votes":1,"body":"Jetzt ist es (fast) offiziell. Der New Ultra Rapid Fire Modus kommt auf die Live-Server. Welche Champions sind eurer Meinung nach die OP Champs dieses Spielmodus (vorausgesetzt Rito kommt nicht auf die glorreiche Idee bestimmte Champions noch weiter zu nerfen)?\r\n\r\nRammus h&auml;tte mit seiner Q auf jeden Fall einen gewissen Vorteil was das Vorankommen anginge.\r\n\r\nMaster Yi h&auml;tte ebenfalls einen Vorteil durch seine Ulti.\r\n\r\nH&auml;tte man Soraka so belassen, wie sie war, h&auml;tte auch sie noch einen Vorteil durch ihre alte E.\r\n\r\nUrgot und Katarina machen es sich in punkto Movement recht einfach, indem sie sich einfach Teleportieren anstatt zu laufen. Urgot nimmt dabei sogar einem anderen Champion ebenfalls den Laufweg ab. Sehr sozial.\r\n\r\nWer w&auml;ren eurer Meinung nach die OP-Champs f&uuml;r N.U.R.F.?","replies":[{"poster":"Ηastur","date":"2015-03-30T23:39:29.335+0000","up_votes":1,"down_votes":0,"body":"Champions die mit einer Combo bursten werdens wohl.\nAnnie ♥\n\nKeine Abklingzeit, kein Problem\n\n(oder halt welche die resetten... langweilig)","replies":[]},{"poster":"Aenrikr","date":"2015-03-30T21:32:57.017+0000","up_votes":1,"down_votes":0,"body":"OP Champ Nr.1 bei Ultra Nerfs?\nGar keine Frage, {{champion:26}} , the foxy Grandpa, setzt einfach seine Abklingzeiten zurück und rast wie bekloppt.\nWird uns alle in Grund und Boden bomben und noch in der ersten Stunde auf Dauerbann sein ^^","replies":[]},{"poster":"ΝKJ","date":"2015-03-30T19:43:49.512+0000","up_votes":1,"down_votes":0,"body":"Armes Pony :(","replies":[]},{"poster":"psaads","date":"2015-03-30T19:40:35.532+0000","up_votes":1,"down_votes":0,"body":"Hast du überhaubt den buff gelesen? da ist kein champ mehr op","replies":[]}]}