{"poster":"Enjiro","date":"2019-05-23T14:49:25.792+0000","title":"Non riesco più a giocare yasuo e sto avendo bad perfomance in generale.","subforum":"Campioni e gameplay","up_votes":1,"down_votes":1,"body":"Come da titolo non riesco più a giocare yasuo , il mio main , facendo sempre kda negativi.\nNon riesco più a giocarlo come una volta , mi gestivo bene la lane , vincevo sempre in matchup favorevoli e riuscivo a gestirmi la lane senza morire troppo contro champ che mi counteravano.\nOra proprio non riesco più e anche il più semplice dei matchup faccio fatica a vincerlo.\nConsigli?\n\nP.S. Non so se sia la sezione giusta , scusatemi ^ ^","replies":[{"poster":"V3LK0ZMAST3R","date":"2019-05-24T06:25:17.032+0000","up_votes":2,"down_votes":0,"body":"Semplicemente vuol dire che sei diventato un vero main yasuo. GG {{sticker:slayer-pantheon-thumbs}}\nScherzi a parte, da quando é stata cambiata la {{item:3046}} e il conquistatore, ha perso il suo potenziale da \"bullo da lane\" nei matchup favorevoli, gestisce peggio quelli sfavorevoli e ha perso l'enorme powerspike del 1 item. Semplicemente é tornato dopo 3 season ad essere ciò che dovrebbe essere,broken ma solo in late game con un early osceno.. A questo aggiungiamo il ritorno dei tank con tutti i vari cc pesanti,bruiserlandia con cui yasuo non va d'accordo e gli adc con uno Spike più veloce del suo. Quindi devi solo startene tranquillo early- mid game (salvo l'avversario non sia demente)  e scegliere il piede lesto nei matchup più ostici","replies":[{"poster":"nJacob","date":"2019-05-31T07:55:04.611+0000","up_votes":1,"down_votes":0,"body":"Dopo il cambiamento degli item da crit la nuova build di Yasuo è diventata {{item:3087}}  first item invece di {{item:3046}} e se dobbiamo dirla tutta Yasuo è più forte con il nuovo Statikk Shiv di quanto non lo fosse con il vecchio Phantom Dancer. Il suo winrate infatti è salito considerevolmente subito dopo l'uscita della patch.\nYasuo non è stato toccato anzi oserei anche dire che è stato leggermente (ma tanto leggermente) buffato dai cambiamenti che citi.\nProbabilmente l nostro amico qui è semplicemente salito di MMR e trova contro avversari migliori.","replies":[{"poster":"V3LK0ZMAST3R","date":"2019-05-31T08:05:57.680+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=nJacob,realm=EUW,application-id=cAOZwaUi,discussion-id=RrEi0oax,comment-id=00000001,timestamp=2019-05-31T07:55:04.611+0000)\n>\n> Dopo il cambiamento degli item da crit la nuova build di Yasuo è diventata {{item:3087}}  first item invece di {{item:3046}} e se dobbiamo dirla tutta Yasuo è più forte con il nuovo Statikk Shiv di quanto non lo fosse con il vecchio Phantom Dancer. Il suo winrate infatti è salito considerevolmente subito dopo l'uscita della patch.\n> Yasuo non è stato toccato anzi oserei anche dire che è stato leggermente (ma tanto leggermente) buffato dai cambiamenti che citi.\n> Probabilmente l nostro amico qui è semplicemente salito di MMR e trova contro avversari migliori.\n\nUn po' difficile dirlo con certezza visto che non é stato l'unico cambiamento, ma a notare dai grafici la wr di yasuo é nettamente più bassa proprio a partire da quella fase dove compra il 1 item. Anche la wr generale é nettamente calata e non aumentata,ma ciò può essere per un insieme vario di cambiamenti.\nOnestamente la vecchia Phantom era ler le fasi iniziali ,nettamente più forte dello statickk vista la riduzione danno.\nPoi eh magari non é così, ma anche personalmente.dopo questo cambio ho visto yasuo decisamente più debole nelle prime fasi","replies":[]}]},{"poster":"nevcs","date":"2019-05-24T09:16:18.939+0000","up_votes":1,"down_votes":0,"body":"Approvo con ciò che hai detto, ma comunque fai conto che potrebbero essere anche fattori esterni (purtroppo) {{sticker:sg-soraka}}","replies":[]}]},{"poster":"Enjiro","date":"2019-06-08T09:42:38.093+0000","up_votes":1,"down_votes":0,"body":"Grazie a tutti per i commenti , purtroppo li ho visti solo oggi perché tra verifiche  e interrogazioni di fine anno mi ero scordato di controllare.\nSolo oggi avendo un po di tempo volevo scaricarmi il PBE e ho notato che avevo dei commenti da leggere XD.\nDa come dite in effetti può essere a causa del \"nerf\" del Phantom Dancer e del Conquistatore.\nHo sempre pensato che il Piede Lesto fosse una runa inutile su Yasuo ma proverò ad usarlo in matchup sfavorevoli.\nGrazie a tutti di nuovo. ^ ^","replies":[]},{"poster":"Eivix02","date":"2019-05-27T10:55:20.473+0000","up_votes":1,"down_votes":0,"body":"forse sei salito di elo e basta","replies":[]}]}