{"poster":"Jigøku","date":"2017-09-27T15:16:49.152+0000","title":"\"Entremos a jugar una partida de ARAM, será divertido\"","subforum":"Off-topic y temas personales","up_votes":3,"down_votes":5,"body":"Entro, tocan 4 tanques ap en el otro equipo y un pantheon y en el m&iacute;o que? una anivia, una janna, un kog ._. modo de juego mas asqueroso","replies":[{"poster":"rokushoger","date":"2017-09-27T15:19:59.798+0000","up_votes":5,"down_votes":0,"body":"1- Una janna, una anivia, contra un equipo de tanques es muy bueno, la janna hace mucho peel y anivia los estorba con ralentización. Encima un kog que baja tanques como ninguno.\n\n2- Es un aram, o sea random, te puede tocar un buen equipo como un mal equipo, es parte de la gracia.","replies":[{"poster":"Jigøku","date":"2017-09-29T00:21:42.481+0000","up_votes":1,"down_votes":0,"body":"La anivia no bajaba nada, kog no bajaba nada, y janna que va a hacer? si los ogros que tocaron se tiran todos ensima? nada","replies":[{"poster":"rokushoger","date":"2017-09-29T10:53:26.541+0000","up_votes":1,"down_votes":0,"body":"Bueno, pero ahí como vos bien decís el problema no eran los champ que tocaron, sino que no podían capitalizar sus ventajas, o no supieron buildearlos, o tal vez el enemigo era mejor que ustedes. \nPero ya no es un tema de composición, ergo el \"azar\" de aram no tuvo la culpa de que perdieras.","replies":[{"poster":"Jigøku","date":"2017-09-29T17:44:05.768+0000","up_votes":1,"down_votes":0,"body":"Si tuvo, ellos hacian mucho daño y aguantaban mucho y nuestros campeones no","replies":[{"poster":"rokushoger","date":"2017-09-29T18:32:28.682+0000","up_votes":1,"down_votes":0,"body":"El daño que tenían probablemente se deba también a que estaban feed XD.\nDe todos modos, volvemos a lo mismo, que tu anivia o tu kog no pegaran, o que tu janna no usara correctamente el ulti para sacarselos me parecen factores mucho más determinantes, sobre todo cuando anivia y kog son de los campeones que más tanques exterminan en aram, uno por el cc y el otro por el daño por porcentaje de vida.","replies":[]}]}]}]}]},{"poster":"Mioen","date":"2017-09-27T16:04:21.243+0000","up_votes":1,"down_votes":0,"body":"4 Tanks AP vs Janna/Kog/Anivia.\n\nEl team papa, todo para bajar tanks.","replies":[{"poster":"Jigøku","date":"2017-09-29T00:25:44.511+0000","up_votes":1,"down_votes":0,"body":"Que bajar tanks si ninguno de mi equipo les hacia daño ._.","replies":[]}]},{"poster":"Muñekko","date":"2017-09-27T17:03:12.805+0000","up_votes":1,"down_votes":0,"body":"Asqueroso? es Random! jaja si no te gusta no lo juegues","replies":[{"poster":"Jigøku","date":"2017-09-29T00:24:52.824+0000","up_votes":1,"down_votes":0,"body":"Ñiñiñi","replies":[]}]},{"poster":"rodrigo023","date":"2017-09-27T22:29:13.146+0000","up_votes":1,"down_votes":0,"body":"¡?¡?'¿?  y quien se supone que tiene la ventaja ?? xD\n\na menudo veo estos post de aram donde creen que estan en desventaja y yo nunca logro ver que equipo ganaria sobre el otro ... al final depende de si los jugadores saben usar los campeones que le tocaron\n\ncomo dato te dejo ademas que kog y janna estan entre los top tier de win rate en Aram","replies":[{"poster":"Jigøku","date":"2017-09-29T00:22:08.979+0000","up_votes":1,"down_votes":0,"body":"Kog no pegaba nada, nada de nada","replies":[]}]},{"poster":"Darkfoe703","date":"2017-09-27T15:26:04.810+0000","up_votes":1,"down_votes":0,"body":"Es la mejor manera de practicar peleas en equipo y a cumplir el rol que se necesita por más que no lo hayas elegido.","replies":[]}]}