{"poster":"Jigøku","date":"2018-04-26T03:29:07.462+0000","title":"Report al que va mal y no al que perjudica al equipo","subforum":"Off-topic y temas personales","up_votes":1,"down_votes":3,"body":"Reci&eacute;n fui mao top contra un kled m5 y bueno, me fue mal, termine muriendo varias veces ya que 1. me buildie mal al principio(por querer probar build), 2.jax jg vino a gankear sin haber usado todo el oro que tenia(no tuvo da&ntilde;o) le dije sus errores, que porque habia hecho esto si esto otro y que? pidio que me reportaran por &quot;flamer&quot; cuando el se la paso en la jungla, yendo a lineas en las que no habia nadie, no gankeando bot que estaba super pusheado, ademas de lo que ya dije gankear sin haber comprado y todo eso se lo dije al equipo, no los ayudo ademas de morir bastante y molestar y aun as&iacute; ni le dec&iacute;an nada, solo al mao top que le fue mal\n\nEdit: siendo Jax: fedeo, no ayudo al equipo que debería siendo mi rol  jungla, cometo errores que perjudican mas al equipo, me dicen algo y ya pido que reporten por \"flamear\" a la otra persona, mi premade me apoya y como somos mayoría los otros 2 jugadores nos dan la razón no fijandose en mi y mi desempeño ","replies":[{"poster":"rokushoger","date":"2018-04-26T11:26:37.105+0000","up_votes":2,"down_votes":1,"body":"El tema es como le dijiste sus errores? Porque no es lo mismo decirle \"jax, para la próxima intenta gankear cuando no esté tan bajo de vida así puedo ayudarte\" a decirle \"manco de mier... como vas a gankear cuando estoy pusheado\".\n\nEncima si es [esta ](https://matchhistory.las.leagueoflegends.com/es/#match-details/LA2/572134983/204115992?tab=overview)partida, ir 0/7/2 no es ir mal, es casi que troleo. \n\nOjo, tampoco digo que el jax haya estado bien, pero si los 4 se te tiraron en contra y no solo el premade de jax, entonces man probablemente hay algo que no estás viendo. Claro, puedo equivocarme porque no estuve en esa partida, pero bueno, son conclusiones en base a la info que me das y que veo en el historial.","replies":[{"poster":"Jigøku","date":"2018-04-26T12:00:02.152+0000","up_votes":1,"down_votes":1,"body":">Encima si es esta partida, ir 0/7/2 no es ir mal, es casi que troleo.\n\nCasi troleo lo del Jax si no es que completo","replies":[{"poster":"rokushoger","date":"2018-04-26T12:51:35.832+0000","up_votes":1,"down_votes":0,"body":"Si, también, su score no es mucho mejor.","replies":[]}]},{"poster":"Jigøku","date":"2018-04-26T11:58:28.345+0000","up_votes":1,"down_votes":1,"body":"No flamie, no hago eso, dije \"como vas a hacer eso y  tal y tal\" algo exaltado quiza, casi troleo disculpa? xD","replies":[]}]},{"poster":"MagmaStriker","date":"2018-04-26T04:07:40.115+0000","up_votes":1,"down_votes":0,"body":"Cuando el jungla quiere gankear top cuando estas bajo torre con 100 de maná y 250 de vida con 2 oleadas encima, y muere regalandole doble bufo al rival y luego no se acerca más en toda la partida, quedando tú vulnerable debido a esa ventaja y que encima te campeen.  \nSumemos que el jungla no gankea ninguna otra linea ni saca dragón.\n\nAhi la culpa termina siendo de uno por acabar 2/5/0 y no del jungla que no hizo por el equipo.\n\n*Y ANTES QUE APAREZCA UN AMARILLITO, ES MOLESTO CUANDO OCURRE EN MI EQUIPO Y EL ENEMIGO*. (Se vuelve muy fácil la partida y resulta aburrido, por lo que igual reporto al jungla de turno).","replies":[]}]}