{"poster":"Jigøku","date":"2018-06-22T04:14:24.192+0000","title":"Que frustrante...","subforum":"Off-topic y temas personales","up_votes":5,"down_votes":1,"body":"La Vayne que muere 10, 15 veces, se tira con R de cabeza y sigue muriendo y le dices &quot;por que sigues muriendo? deja de morir&quot; y contesta \"? pero si yo hago todo bien no se que dices, calmate\" 5 mins despues, vuelve a morir :I\n\nEDIT: en selección de campeón recién, 6 seg para que empiece la partida, Jhin adc no se quita el tp, hello PL's negativos","replies":[{"poster":"Alan Op","date":"2018-06-22T05:06:40.198+0000","up_votes":3,"down_votes":0,"body":"Se puede ir ADC con tp...\n\nEl tipico que critica los anti metas","replies":[]},{"poster":"POETA DEL RAYO","date":"2018-06-23T14:04:33.135+0000","up_votes":1,"down_votes":0,"body":"Lo que veo en plata es que no saben kitear nada , les preguntas si tienen configurado el teclado para movimiento con ataque y ataque solo a campeones y no saben ni lo que es eso... Osea sos main adc , investiga ,prende lo básico amigo! No podes quedarte a mele del yasuo de turno movete! Ponerte atrás de los Minions para que no te den los ganchos del supp! Movete! ....\n\nSolo jugo mid pero mis partidas normalmente las pierdo por que la bot la pierde...\nMe ah tocado suportear adc's  sin el menor sentido común... Miras su historial y solo juegan adc y no tienen los conocimientos básicos... \n\nMe cree otra cuenta en la que sólo juego adc , y la verdad es que las ganó casi todas por qué aprendí a kitear y a aprovechar el rango que tiene un adc , incluso mejore el farmeo por el uso continuo de básicos.\n\nSaludos","replies":[]},{"poster":"Vaaš","date":"2018-06-22T13:48:08.095+0000","up_votes":1,"down_votes":0,"body":"Si se tiraba de cabeza recordé algo...\n\nEsos Ezreal que se tiran con la E a la tf y los borran de una JAJAJAJAJA","replies":[{"poster":"Bunny Cookie","date":"2018-06-22T14:10:17.067+0000","up_votes":1,"down_votes":0,"body":">Esos Ezreal que se tiran con la E a la tf y los borran de una JAJAJAJAJA\n\n:c\n\n~~Hola guapo~~","replies":[{"poster":"Vaaš","date":"2018-06-22T14:22:50.365+0000","up_votes":1,"down_votes":0,"body":"> :c\n \n> ~~Hola guapo~~\n\nY eso que no me has visto en fotos con mi mejor ropa y todo 7w7 esas fotos que **no pongo de perfil para no llamar la atención** no deseada, pero ese tipo de fotos es para mi pareja nomas en privado <3............... pareja que ni tengo ._.","replies":[]}]}]},{"poster":"Bunny Cookie","date":"2018-06-22T14:14:21.757+0000","up_votes":1,"down_votes":0,"body":">La Vayne que muere 10, 15 veces, se tira con R de cabeza y sigue muriendo y le dices \"por que sigues muriendo? deja de morir\" y contesta \"? pero si yo hago todo bien no se que dices, calmate\" 5 mins despues, vuelve a morir :I\n\nComplejo de Vayne, intentan imitar las plays de Gosu y Doublelift que ven por Youtube, lo que no ven, es que hasta ellos necesitan algo de peel para mandarse 1 vs 5, pero bueno, ojalá tengas mejor suerte en tu próximos games :(, es muy frustrante si, pero no te rindas.\n\n>EDIT: en selección de campeón recién, 6 seg para que empiece la partida, Jhin adc no se quita el tp, hello PL's negativos\n\nY no te sientas mal por ello, lo que debería importarte es el MMR, al hacer dodge tu MMR sigue intacto y así te ahorras una derrota casi segura.","replies":[]},{"poster":"rokushoger","date":"2018-06-22T11:15:56.182+0000","up_votes":1,"down_votes":0,"body":"Yo te pregunto, crees que ella está muriendo a propósito? Porque al menos que realmente esté troleando no creo que la persona esté realmente queriendo morir, ergo que le digas \"deja de morir\" es como que te diga en plena partida \"tu nick no me gusta, cambiatelo ahora\"...","replies":[]},{"poster":"Waninoko Main","date":"2018-06-22T09:45:48.308+0000","up_votes":1,"down_votes":0,"body":"es un ADC a quien le importa lo que diga? todo mundo juega AD así que a nadie le importa el opinion del ADC jaja","replies":[]},{"poster":"Onslaught","date":"2018-06-22T04:23:19.593+0000","up_votes":1,"down_votes":2,"body":"Repeti conmigo ''La culpa es mia ,el adc triunfaria si entre todos lo cuidamos ,hacemos el daño ,tanqueamos  y se los dejamos a todos a 1 de vida para que los mate el '' \n Ese es el credo de los adcs, si mueren es culpa de otros porque ellos son los babys mantenidos por todos .Si no lo ayudan los 4 del equipo es un inutil...Y si ayudandolo le roban una kill tambien es tu culpa XD","replies":[]}]}