{"poster":"Jigøku","date":"2018-05-20T01:25:52.180+0000","title":"Entonces, como?","subforum":"Off-topic y temas personales","up_votes":3,"down_votes":1,"body":"Como pretende, que &quot;juegue callado y farmee&quot; Leona sup que se queda en todo momento atras de su adc, mientras que su adc cada que intenta dar un last hit Varus y Sona le tiran sus habilidades, como? ah&iacute; Leona jugaba bien supongo pero mi duda es que ten&iacute;a que hacer pobre Vayne para farmear","replies":[{"poster":"Danshid","date":"2018-05-20T01:34:40.294+0000","up_votes":1,"down_votes":0,"body":"eres vayne vs varus sona\n\neres uno de los adcs con menos rango, contra pokeo puro, farmear pasivo nomas, muy muy bajo torre","replies":[{"poster":"Jigøku","date":"2018-05-20T02:19:59.779+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Danshid,realm=LAS,application-id=J8qpiO2I,discussion-id=A4EFYMuV,comment-id=0000,timestamp=2018-05-20T01:34:40.294+0000)\n>\n> eres vayne vs varus sona\n> \n> eres uno de los adcs con menos rango, contra pokeo puro, farmear pasivo nomas, muy muy bajo torre\n\nSabes el rango de sona? y varus? xD no van a estar siempre bajo torre los minions, y Leona, Leona que deberia hacer?","replies":[{"poster":"Waninoko Main","date":"2018-05-20T13:49:47.510+0000","up_votes":1,"down_votes":0,"body":"si tu solo das el último golpe lo mas probable es que vivas debajo de torre. Ahora es cuando debes tomar ventaja de esta situación desventajosa para avisar al jungla que estarás bajo la torre y que es una gran ocasión para los ganks, tambien si tu mid puede ganar la prioridad de roaming que tome cartas en el asunto, asimismo TOP si le preparas un ward en el arbusto del lado rival puede tirar un TP cuando obtenga prioridad en su linea. No es necesario ganar siempre el 2v2 pero puedes sacar ventaja cuando ellos te presionan.","replies":[]},{"poster":"Danshid","date":"2018-05-20T04:16:52.605+0000","up_votes":1,"down_votes":0,"body":"si te pokean te pushearan la wave, lo que hara que tengas que farmear bajo torre\n\nigual, sona varus es una linea muy jodida, lo unico seria jugarles agresivos a lvl 2,3 y 6, y si sale bien intentar jugar agrsivo cuando se posicionen mal","replies":[]}]},{"poster":"DizzyJuicy","date":"2018-05-20T01:46:56.992+0000","up_votes":1,"down_votes":0,"body":"x2","replies":[]}]}]}