{"poster":"KubeR","date":"2017-04-22T04:47:48.198+0000","title":"bronce es 1 vs 5, plata 1 vs 9","subforum":"Comportamiento del jugador","up_votes":4,"down_votes":2,"body":"Luego de varias partidas, cada dia me desepciona mas la gente de silver, estuve estancado en bronce V con 0 pl y 800 de ELO, es decir lo peor de lo peor, eh dicho &quot;no merzco estar aca&quot; y si lo merecia, con el tiempo fui aprendiendo, mejorando y ahora estoy plata 3, recien perdida la promo a plata 2, yendo al grano, lo que recuerdo de bronce cuando empeze a salir, eran partidas que te ponias el equipo al hombro y carreabas, era un 1 vs 5, pero en silver, principalmente ahora, es un 1 vs 9, la gente quiere perder, y hace todo lo posible por perder, alguno me dice PORQUE ??? es decir, me enoje con el jungla porque no gankea, asi que voy a tener 4 o mas reports, perder 20 pl, y desperdiciar 30 min aprox, solo para que alguien que no me gusto su forma de jugar, pierda, en vez de ganar todos, prefieren perder todos, y suicidarse con tal de matar al otro, realmente me sorprende la actitud.\r\n\r\nNi hablar del nivel, como puede ser que gente de mi ELO, no sepa moverse al pegar ? se quedan quietos pegando, en bronce V o IV es entendible, pero como alguien que realmente no tiene chance de ganarle una lane a alguien con una minima idea, es decir que todas las partidas feedee, pueda estar en una liga superior a bronce ???\r\n\r\nSimplemente quiero opiniones, a ver si lo logro entender, no me jode que me digan, estas equivocado del todo por tal y tal motivo.","replies":[{"poster":"Trying Improve","date":"2017-04-22T11:43:19.852+0000","up_votes":2,"down_votes":0,"body":"En silver hay mucho ego y ni hablar en oro, al parecer con subir unas cuantas divisiones se sienten superior al resto y se olvidan de mejorar. Totalmente de acuerdo con lo de 1v9.","replies":[]},{"poster":"PROPHENCY","date":"2017-04-22T05:29:58.914+0000","up_votes":2,"down_votes":0,"body":"Hay gente buena en plata que termina saliendo pero no te la cruzas siempre .. Después esta el que juega bien hasta que lo matan y pasa de un 5/0 a un 5/10 .. Y después esta el malo , que no sirve ni de ward..con los primeros dos se puede ganar \n\nYo no juego rankeds por ese motivo ..no sólo te flamean sino que te hacen perder tiempo de tu vida , porque vos si queres ganar . Pero lo mejor es llegar a oro y ganar las recompensas , una vez en platino te obligan a vivir esa presión de rankear sino te bajan","replies":[]},{"poster":"Chisolin","date":"2017-04-22T04:58:37.052+0000","up_votes":1,"down_votes":0,"body":"No metas a todos en el mismo saco porque en tu ultima partida te haya pasado eso...\nHay buenos y malos en todas las ligas...","replies":[{"poster":"KubeR","date":"2017-04-22T07:03:09.166+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Chisolin,realm=LAS,application-id=PJAKt7ph,discussion-id=JfWFYaqq,comment-id=0000,timestamp=2017-04-22T04:58:37.052+0000)\n>\n> No metas a todos en el mismo saco porque en tu ultima partida te haya pasado eso...\n> Hay buenos y malos en todas las ligas...\n\nEn parte tienes razón, no me quise referir a todos, pero tampoco fue de la última partida, realmente me cruzó con muchísima mas gente de la que me gustaría que entran en este grupo de personas que quieren perder.","replies":[]}]}]}