{"poster":"KubeR","date":"2017-03-22T16:06:24.440+0000","title":"Adiós :D","subforum":"Comportamiento del jugador","up_votes":5,"down_votes":8,"body":"Dije que si me tocaban trolls en 10 rankeds seguidas lo desinstalaba, lamentablemente ese d&iacute;a llego, adi&oacute;s horrorosa comunidad, desperdicio de juego gracias a nosotros ! GJ LAS . . .\r\n\r\nP.D: No es charlas generales, es comportamiento del jugador, sino rito lo tiene que borrar, no se porque, pero si DIOS RITO lo dice, DIOS RITO te obliga. Aunque me parece inutil que no tengan gente revisando partidas para encontrar flammers y trolls pero que haya tantos admins del foro atentos a que no hagas ning&uacute;n error (Y no es por esto, con el problema de LastPick se not&oacute; MUCH&Iacute;SIMO)\r\n\r\n\r\n\r\nAntes de que RITO lo borre, varios dec&iacute;an que mejor, ya que era de los que dec&iacute;an troll a todo el mundo, as&iacute; que aca lo que les respond&iacute;:\r\n\r\nTroll es un shaco, que prueba el champ en ranked, y cuando le dec&iacute;s que se puede comprar o a quien no se le plante te dice &quot;estas ranked no sirven, hago lo que quiero, callate&quot; o tambien un graves que va antes del spawn a lane, se tira solo contra los 2, se muere y luego sin decir nada se va a jg y se queda el resto de la partida farmeando jg o afk en base bailando, troll es una botlane que pierde bot, al min 20 su adc ya iba 18-4 y me culpaba a mi (top lane) de que no gane la mia (estando yo 1-2 sin haberme nunca gankeado volibear, ni katarina y con 3 ganks de su diana medio y 4 ganks del rek sai). Podria nombrarte todos, pero NO, no soy de los que le dicen troll a los que perdieron lane y van 0-2.\r\n\r\n\r\n{{sticker:slayer-jinx-catface}}","replies":[{"poster":"FedecarboneroUY","date":"2017-03-22T16:24:06.749+0000","up_votes":1,"down_votes":0,"body":"¿Tanto cuesta jugar en dúo?\n\nConozco tanta gente que no sale del infierno (bronce, plata y oro) y no se que les cuesta encontrar a una persona con la que rankear, nisiquiera necesitas saber jugar ni una línea para salir de ahí.","replies":[{"poster":"Lëgolas","date":"2017-03-22T16:37:03.751+0000","up_votes":2,"down_votes":1,"body":"Atte: Un unranked...","replies":[{"poster":"Ch3mitaTd3strosa","date":"2017-03-22T17:16:56.293+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lëgolas,realm=LAS,application-id=PJAKt7ph,discussion-id=YKAutAdM,comment-id=00010000,timestamp=2017-03-22T16:37:03.751+0000)\n>\n> Atte: Un unranked...\n\nMuchos comentan con cuentas ALt -_-","replies":[{"poster":"FedecarboneroUY","date":"2017-03-22T18:15:51.742+0000","up_votes":1,"down_votes":0,"body":"Esta es mi cuenta principal, pero nunca voy a rankear en esta, lo que dije lo dije porque rankeando en duo con una persona que nisiquiera mainea un rol en específico con 115 partidas jugadas la dejé en Oro 2, estos días igual no puedo jugar, pero es que en dúo es muy fácil subir, es bastante injusto.","replies":[]}]}]}]},{"poster":"Lëgolas","date":"2017-03-22T16:12:05.766+0000","up_votes":1,"down_votes":0,"body":"Ya lo publicaste hace unos dias esto, se ve que te cuesta cumplir tu palabra...","replies":[{"poster":"KubeR","date":"2017-03-29T18:21:16.016+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lëgolas,realm=LAS,application-id=PJAKt7ph,discussion-id=YKAutAdM,comment-id=0000,timestamp=2017-03-22T16:12:05.766+0000)\n>\n> Ya lo publicaste hace unos dias esto, se ve que te cuesta cumplir tu palabra...\n\nLo publique un día antes, pero \"no estaba en el foro correcto\" así que rito lo borro y lo re-publique donde a ellos les gustaba.","replies":[]}]}]}