{"poster":"Kariu Rena","date":"2017-07-25T16:19:18.613+0000","title":"IE cost more than Morello and is less gold efficent and offer less stas","subforum":"Gameplay","up_votes":1,"down_votes":14,"body":"Ie cost more and takes more time to scale up compared to morello. IE is not even at the level of cost efficency with its passive when compared to morello without its passive. How is it fair that Morello offers so much as a first item. I Guess you could argue that its for mages so its allowed \nto be broken. Can you imagine how good ie would be if it offers ad crit and atk speed and lifesteal all at once?\n\nHehe xd\nhttps://boards.na.leagueoflegends.com/en/c/gameplay-balance/OPs6ysI5-ludens-costs-more-and-is-less-stat-efficient-than-duskblade-and-shiv-yet-deals-less-damage","replies":[{"poster":"Anomander","date":"2017-07-25T16:32:31.915+0000","up_votes":6,"down_votes":0,"body":"The problem is you are comparing the wrong type of items.\n\nA correct comparison would be a {{item:3089}} and a{{item:3031}}.\n\n\nThese items are both not cost effective on their own.   They are not designed to be cost effective by themselves as they are multipliers for other items.\n\n\nThe closest comparison for a {{item:3165}} would probably be {{item:3153}} for adc's or a {{item:3147}} for a assasins.   It is also comparable to a {{item:3193}} /{{item:3190}}  for tanks and a {{item:3071}} for most bruisers.\n\nAll these items give a 1 item power spike and give a moderate about of all the stats those \"roles\" want.   All are cost effective on their own for their stats but lack the multiplicative power of {{item:3089}} {{item:3031}}.","replies":[{"poster":"HeresyHorus","date":"2017-07-25T18:42:22.824+0000","up_votes":1,"down_votes":1,"body":"> A correct comparison would be {{item:3089}} and {{item:3031}}\n\neven that comparison is wrong.\n\nADCs shouldn't be bursting with their autos in the first place, espicialy when thier autos are not restricted by any measyre.\n\nAP champs even those who were meant to act as DPSers like {{champion:69}} {{champion:13}} are still heavily restricted by their CDs, Resources and having their main damage depends on them landing  skill shots.\n\nthis whole crit shit that allows ADCs to +1000 damage per auto need to go once and for all.\n\nthis is coming form a {{champion:11}} main who enjoys 1 shotting squishies with Q + aa with 0 counterplay.","replies":[{"poster":"Anomander","date":"2017-07-25T18:57:34.852+0000","up_votes":1,"down_votes":0,"body":">ADCs shouldn't be bursting with their autos in the first place, espicialy when thier autos are not restricted by any measyre\n\nIt has nothing to do with bursting.   It has to do with how the items are designed.    Both are designed as a Multiplier for other items.    \n\n>AP champs even those who were meant to act as DPSers like   are still heavily restricted by their CDs, Resources and having their main damage depends on them landing skill shots.\n\nThis has nothing to do with the discussion of the item comparison as the same can be said of some adc's.{{champion:81}}\n\nYou are trying to take this off topic.   Which is the comparison of items and gold efficiency.  And has nothing to do with Crit or burst.","replies":[]}]}]},{"poster":"Sahn Uzal","date":"2017-07-25T16:23:19.114+0000","up_votes":2,"down_votes":0,"body":"Mages have Morellos to give them a really powerful 1 itemspike.\nADCs don't have a 1 item spike like that but their itemisation scales incredibly well with itself.\n\n1 mage item > 1 ADC item\n3 ADC items > 3 Mage items\n\nDoes that make any sense to ya?","replies":[{"poster":"Penns","date":"2017-07-25T16:24:15.059+0000","up_votes":3,"down_votes":0,"body":"{{item:3153}} hehe","replies":[{"poster":"Sahn Uzal","date":"2017-07-25T16:52:14.471+0000","up_votes":2,"down_votes":1,"body":"Yea, when Botrk was overpowered it never really felt like ADC's actually lost enough lategame power for the power that bork gave as a 1 item spike, which is why I believed it was an issue.\n\nI don't see it that often anymore though.","replies":[]}]},{"poster":"Geauxx","date":"2017-07-25T16:35:37.508+0000","up_votes":1,"down_votes":0,"body":"It's not going to make sense to him, that fact he keeps making AP to AD item comparisons without understand the difference in the 2 stats for champions shows it doesn't\n\nThat's not including that he describes them to be used in the same sense as in an adc could build morellos and vise-versa for AP control mages to build IE.","replies":[{"poster":"Kariu Rena","date":"2017-07-25T16:43:53.747+0000","up_votes":1,"down_votes":0,"body":"You might need to read the post again or is it just extreme delusion that you decide to ignore the last part","replies":[{"poster":"Geauxx","date":"2017-07-26T03:38:27.562+0000","up_votes":1,"down_votes":0,"body":"It's litterally just you making similar comparisons using the dumb comparisons again. LOL\n\n\nWhose delusional again?","replies":[{"poster":"Kariu Rena","date":"2017-07-26T04:11:46.339+0000","up_votes":1,"down_votes":0,"body":"Because this is a satire thread and not meant to be taken seriously. Is it that hard for that supprt main brain of yours to process? LUL","replies":[]}]}]}]},{"poster":"Dani El Pezglobo","date":"2017-07-25T16:43:14.174+0000","up_votes":1,"down_votes":0,"body":"ye but when adc have 4 items noi matter what u are dead","replies":[]},{"poster":"Kariu Rena","date":"2017-07-25T16:25:00.177+0000","up_votes":1,"down_votes":0,"body":"https://boards.na.leagueoflegends.com/en/c/gameplay-balance/OPs6ysI5-ludens-costs-more-and-is-less-stat-efficient-than-duskblade-and-shiv-yet-deals-less-damage","replies":[]}]},{"poster":"HeresyHorus","date":"2017-07-25T18:29:56.811+0000","up_votes":1,"down_votes":0,"body":"{{sticker:zombie-brand-facepalm}} \n\nADCs do not need to rush it as a 1st item to function, their itemization is quite flexible.\n\nMages on the other hand cant function at all if they dont rush it as a 1st item, it was meant to be a \"lazy\" fix after Riot dumpstered most Mages to prevent them from going bot lane even when it was fine for them to do so but too many bad ADC mains cried against it that time and Riot catered for them as always.\n\nalso why compare ADC that have Burst DPS on a targeted 0 CD/0 Resources autos that can life steal to Mages who have their burst heavily  restricted by their CDs and Resources ? ... its obvious which one of those classes is trespassing other domains that were not meant for it in the first place and thus it must be nerfed even more instead of being buffed because someone with low game knowledge compared them to different and weaker class !!!","replies":[{"poster":"Kariu Rena","date":"2017-07-25T18:43:15.689+0000","up_votes":1,"down_votes":1,"body":"I love how the blind hate you guys have on adc made you guys to skip the last part. Gotta love the delusion of gameplay board","replies":[]}]},{"poster":"KuroCaliber","date":"2017-07-25T17:41:11.728+0000","up_votes":1,"down_votes":0,"body":"I adore your name.  Isn't it from Relife?","replies":[]},{"poster":"Colgate Gator","date":"2017-07-25T16:36:38.001+0000","up_votes":1,"down_votes":0,"body":"Piss off, ADCs are overly strong again, let's not play this \"muh adc itemization\" game yet.","replies":[]},{"poster":"TyrekGoldenspear","date":"2017-07-25T16:31:10.461+0000","up_votes":1,"down_votes":0,"body":"Mmhmm.\n\nHere's a question.\n\nHow many stats do you honestly need if you're an ADC? Atk damage, Crit, and increased crit chance. Infinity Edge gives all three. Only thing you need is lifesteal and atk speed and you're murdering folks.\n\nA mage's damage is actually gated by something called mana, something that resourceless and undodgeble auto attacks don't have to worry about.","replies":[]}]}