{"poster":"PresidentPeewee","date":"2017-04-18T22:56:55.677+0000","title":"Spirit Visage on Vladimir","subforum":"Gameplay","up_votes":1,"down_votes":0,"body":"Is spirit visage still good on Vladimir, because I never see it being built anymore. And if it isn&#039;t, why is it not good on him anymore?","replies":[{"poster":"God Raijin","date":"2017-04-18T23:08:06.396+0000","up_votes":2,"down_votes":0,"body":"The HP-to-damage scaling on his E went down. So basically {{item:3065}} makes vlad do less damage than before. Also His AP ratios were buffed so building ap is more rewarding now and building HP is less rewarding.","replies":[{"poster":"PresidentPeewee","date":"2017-04-19T01:20:11.421+0000","up_votes":1,"down_votes":0,"body":"Ok thank you very much for the response. I was looking at his patch history and noticed that his health to AP went from 25 to 40 and AP to health went from 1 to 1.4, so this would make spirit visage less viable, but would you still want to buy it into worse matchups so you can get the extra heal from the passive?","replies":[]}]},{"poster":"Titanium70","date":"2017-04-19T01:53:59.194+0000","up_votes":1,"down_votes":0,"body":"If you want your opponent AP-TOP cry... do it. But it's not that much of go to Item for him right now. ^^","replies":[]},{"poster":"WitchQueen Annie","date":"2017-04-19T01:50:37.770+0000","up_votes":1,"down_votes":0,"body":"However, the {{item:3152}} + full AP build has caught on fire in the pro scene. \n\nI'm practicing the new build too because I believe either next patch or the next {{item:3065}} on Vladimir will finally be over (without CDR, its going to suck).","replies":[]},{"poster":"WitchQueen Annie","date":"2017-04-19T01:44:11.764+0000","up_votes":1,"down_votes":0,"body":"For this patch I still build it (all other items are full AP)... it makes him a powerful 100-0 burst battle tank.\n\nI usually do {{item:3158}} {{item:3157}} {{item:3065}} {{item:3285}} {{item:3089}} {{item:3135}}... sometimes I place a {{item:3067}} down and finish the SV later or last (if team needs more damage). \n\nOnce you have 3 or 4 of the above items you can 1 vs 3/4 in some situations. \n\nNext patch though I think they are nerfing SV (no more CDR and less health), that might be the final blow to this build path and I may have to switch over to Protobelt + full AP. This changes his play style to more of an AOE burst mage than a battle mage (if you don't nuke out the key targets in at most 2 rotations, you are toast without SV).","replies":[]},{"poster":"Dragon Master","date":"2017-04-19T01:26:38.164+0000","up_votes":1,"down_votes":0,"body":"I'd only rush it if I'm in a horrible matchup  like Leblanc or if I'm behind. Or if the enemy team has mostly AP. \n\nOtherwise I'll rush an abyssal.","replies":[]},{"poster":"MagicFlyingLlama","date":"2017-04-18T23:04:23.192+0000","up_votes":1,"down_votes":1,"body":"What.","replies":[]}]}