{"poster":"LPB Vexxon","date":"2016-06-01T23:17:56.586+0000","title":"Que campeon me compro para salir de Elo Hell","subforum":"Charlas Generales","up_votes":1,"down_votes":0,"body":"Ultimamente estoy jugando ONLY RENGAR xd pero me gustaria jugar otros champ y no se que comprarme estoy entre quinn (TOP) jinx(ADC) velkoz (SUPP - MID) si alguno me podria ayudar gracias, si me recomiendan otro lo tomare en conciencia. Gracias","replies":[{"poster":"RodriiB","date":"2016-06-02T04:47:30.169+0000","up_votes":1,"down_votes":0,"body":"Volibear amigo, nunca está de más un tanque y que encima mete muchísimo. Además de jg puede ser top.","replies":[]},{"poster":"Rolando Magic","date":"2016-06-02T03:18:07.109+0000","up_votes":1,"down_votes":0,"body":"Trynda, te pones a pushear y tiras vos sólo hasta el nexo","replies":[]},{"poster":"Auren Seven","date":"2016-06-02T00:36:14.986+0000","up_votes":1,"down_votes":0,"body":"- Quinn en top no me parece buen pick a menos que juegues con un jungla que sepa como ayudarte en la linea. Si jugas agresivo te van a campear y al no tener movilidad vas a morir mucho, si jugas pasivo no le sacas el provecho al campeon y si es tanke el rival a la larga te va  a terminar ganando facil. \n\n- Jinx es un campeon de mid-late, la vas a pasar mal en early porque es un campeon muy poca movilidad.\n\n- Velkoz recibe un pequeño buff este parche, pero en los comentarios lo hacen parecer como el mejor mid laner y no es asi.\n\nEntre los 3 el mas seguro me parece Jinx, pero te recomiendo que esperes minimo una semana para ver como se desarrolla el parche. Illaoi recibe un buff grande yo creo que va a ser un campeon a tener en cuenta(Va a ser el proximo campeon que me compre seguramente). \n\nSaludos.","replies":[{"poster":"iVarick","date":"2016-06-02T01:40:01.360+0000","up_votes":1,"down_votes":0,"body":"Lucas para analista!!","replies":[]}]},{"poster":"Maszke","date":"2016-06-02T00:49:25.678+0000","up_votes":1,"down_votes":0,"body":"Por los cambios de la 6.11 yo te recomendaria Jax. (si ya lo tenes, genial) y tal vez darle una mirada a Illaoi que tiene bastante potencial.","replies":[]},{"poster":"123Shot","date":"2016-06-01T23:36:35.869+0000","up_votes":1,"down_votes":0,"body":"la mejor forma de salir del elo hell es con un buen duo y ayudarse mutuamente. Y velkoz lo bufearon, es lo más rentable.","replies":[]},{"poster":"DanielGarrita","date":"2016-06-01T23:24:15.593+0000","up_votes":1,"down_votes":0,"body":"a vel koz lo bufearon para el parche de mañana, no digo mas \n\n{{sticker:slayer-pantheon-popcorn}}","replies":[]}]}