{"poster":"Breawien","date":"2015-01-20T01:54:02.099+0000","title":"2015 Season sale","subforum":"Miscellaneous","up_votes":2,"down_votes":0,"body":"Hi, I don't know where to put this, just general feedback,\r\nI like the concept of a sale of the start of a season which includes runes and rune pages to get you \"prepared\" for the season.\r\nBut if you're anything like me, you're probably just hoarding you're IP waiting for the sale.\r\nMy issue is, by the sale starting the same time as the season, you're not preparing us at all, as we haven't had time to test the new runes we bought.\r\nAnd if you say \"Well you don't have to rank straight away, you clearly haven't played a Normal game on OCE, you cant test anything in that.\r\nNext time you have a sale like this, please at least have it overlap, so it starts 3 days before the season, and goes 4 days into the season.\r\n**YOU ARE NOT PREPARED!**","replies":[{"poster":"Breawien","date":"2015-01-21T02:03:56.957+0000","up_votes":2,"down_votes":0,"body":"To add insult to injury, the sale starts on Friday =( Support taric with 15% attack speed... 2gud.","replies":[]},{"poster":"RLG Shaky","date":"2015-01-20T02:23:14.030+0000","up_votes":1,"down_votes":0,"body":"i think this is bait over dramatic but has a slight truth to it, most people just get over it and practice a few games then would just go into ranked.","replies":[{"poster":"Breawien","date":"2015-01-20T02:40:36.565+0000","up_votes":1,"down_votes":0,"body":"It may be over dramatic, but isn't the point of pre-season to test out new strats and get used to new changes?\nYou can hardly test those strats or changes without getting your full rune kit.\nLike i have several ways i'd like to test a champion, with different runes because i hate cookie cutter builds,\nAnd the pre-season would seem a perfect time to test said play styles.\nI agree over dramatic, but what is the harm on really letting people prepare?\nI know countless people that are waiting to buy runes, most the time runes don't change your play style, but sometimes it does, in my case, it will change how aggressive i can be toward counter jungling, which is hard because i cant really test that in normal, because they're all stupid as. For example: i played a normal with a friend to show him how nunu counter jungle works, of course it's normal... No jungler on the other team.. i changed my masteries around to be slightly squishier, of course no leash. Leashing may seem small, but it effects your whole game, and how fast you get that first clear could change how fast you could gank.\ngiving a month's notice to half price runes is like giving a months notice saying \"In one month, the season will start, also we're going to increase all the health of every mob by 100, but we wont increase it until the day of the season release.\"","replies":[{"poster":"RLG Shaky","date":"2015-01-20T02:44:12.749+0000","up_votes":2,"down_votes":0,"body":"this is true, preseason is for practise and what your saying is true, riot should make it at least a week before the new season of ranked. but still most people do get through it without trouble, but its still worth a look at.","replies":[{"poster":"Breawien","date":"2015-01-20T02:54:22.416+0000","up_votes":1,"down_votes":0,"body":"Now the question is: How do i get riot to notice me! haha\nThe one thing i've never understood with computer games, is why can't they have someone reading boards 24/7 and have them reply to each thread like \"Read by riot\" or even if there is a little tick next to it once read by a riot employee. i see lots of good ideas on the forums, and you seem to see all the red posts are replying to the garbage posts. It just puts salt in the wound.","replies":[]}]}]}]}]}