{"poster":"Breawien","date":"2015-01-16T08:06:57.770+0000","title":"Load screens","subforum":"Help & Support (OCE)","up_votes":2,"down_votes":1,"body":"Hi, i have been climbing the ranks in the off season, i went from plat to diamond, but over the past week i have noticed a huge increase in load screen errors, ie the screen freezes, or people just never connect... every second game some one will have an issue. Part of this is to do with the fact you dont know if your load screen has frozen, the only way to know if its not frozen is if your ping has changed, but sometimes when your ping is stable you have no clue. Recently i had a load screen that everyone was at 100% for 3 minutes. I dont understand why we cant have chat during the load screen, this would then be helpful for teamwork reasons, and also help you know if you're frozen. it cant be that hard to implement, so please do this :)","replies":[{"poster":"HORSE OF FORCE","date":"2015-01-16T10:10:44.162+0000","up_votes":2,"down_votes":0,"body":"Amazing idea. 1+\n\nHave you taken this to Player Creations?","replies":[{"poster":"Breawien","date":"2015-01-17T05:40:28.903+0000","up_votes":1,"down_votes":0,"body":"I put it here because i was more curious about why all of a sudden the loading has been ultra buggy.","replies":[{"poster":"HORSE OF FORCE","date":"2015-01-17T05:51:50.913+0000","up_votes":2,"down_votes":0,"body":"Oh that,\n\nI currently can't get my own game working atm, so I can't be of much help. Have you sent a support ticket?","replies":[{"poster":"Breawien","date":"2015-01-17T12:15:03.645+0000","up_votes":1,"down_votes":0,"body":"I don't think a support ticket will help know if i am frozen or not.\nIt was fine when you could see everyone's pings, but now that you only see your own, %%%% just stays the same =(","replies":[{"poster":"HORSE OF FORCE","date":"2015-01-17T22:42:43.379+0000","up_votes":1,"down_votes":0,"body":"Say, you're on Windows, right? They made it so that if a program is frozen (internally known as APP_HANG) then clicking on it will apply a transparent white layer, indicating of the status. Basically, what happens if you rapidly click around the screen when you think it's frozen?","replies":[]}]}]}]}]},{"poster":"godsmustbecrazy3","date":"2015-01-16T16:19:05.083+0000","up_votes":1,"down_votes":0,"body":"Basically have been getting the error message -\n\"Could not connect to the HTTP server. Please check that your internet connection is enabled and your firewall is not blocking access\"","replies":[{"poster":"Breawien","date":"2015-01-17T05:39:28.903+0000","up_votes":1,"down_votes":0,"body":"I dont get any message.... it just freezes from time to time, i then debate if i'm frozen or if everyone is waiting at 100%, i Alt F4. if everyone is just waiting, it wont let me reconnect until the game starts.","replies":[]}]}]}