{"poster":"xCapoDiTuttix","date":"2015-06-29T00:15:37.187+0000","title":"Cerco coach toplane","subforum":"Reclutamento","up_votes":1,"down_votes":0,"body":"Salve, sono un bronzo 2 (che secondo me non valgo) che ha tantissima voglia di migliorare e tempo da buttare e cerca qualcuno che mi possa aiutare a capire la situazione, ragionare pi&ugrave; velocemente e fare le scelte giuste. Insomma qualcuno me mi faccia da maestro per diventare sempre pi&ugrave; bravo. Se siete interessati basta addarmi.","replies":[{"poster":"Lotus Senpai","date":"2015-06-29T00:28:50.032+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=XDarklory,realm=EUW,application-id=n1bhmWE7,discussion-id=Zjm2Y9vo,comment-id=,timestamp=2015-06-29T00:15:37.187+0000)\n>\n>  (che secondo me non valgo) \n\nGuarda, eri partito bene, ma questa frase fra parentesi fa capire quanto tu sia arrogante da non riuscire ad ammettere di essere bronzo per una tua incapacità. Non ti serve un coach, ti serve un bel bagno di umiltà prima ancora di pensare a qualche modo di migliorare. :)","replies":[{"poster":"xCapoDiTuttix","date":"2015-06-29T09:55:02.870+0000","up_votes":1,"down_votes":0,"body":"si, lo so ma mi sono voluto permettere di dirlo perchè ho sia amici di elo più alto che stesso loro lo dicono anche perchè è raro che io feddi tanto e che non mi feeddi","replies":[]}]},{"poster":"ZOMBIE 4 ALEX","date":"2015-06-29T10:45:38.893+0000","up_votes":2,"down_votes":0,"body":"Guarda sono d`accordo con BlackLotis IX sulla frase \"che secondo me nn valgo\" ho molti amici bronze che dicono quasi la stessa frase(uno addirittura credeva di essere piu bravo di me e mi insegniava a giocare roba da matti ... ) e spesso nn e come dicono... solo per curiosita i tuoi amici che elo sono?","replies":[{"poster":"xCapoDiTuttix","date":"2015-06-29T13:56:33.042+0000","up_votes":1,"down_votes":1,"body":"sono sliver alto/gold ma comunque io mi baso solamente su quello che dicono loro, se mi dovessi giudicare da solo non saprei cosa dire","replies":[]}]},{"poster":"RoyAlexG","date":"2015-07-07T19:05:44.304+0000","up_votes":1,"down_votes":0,"body":"\"Io non merito il bronzo, perdo per colpa del team xd\"","replies":[{"poster":"xCapoDiTuttix","date":"2015-07-16T21:31:45.244+0000","up_votes":1,"down_votes":0,"body":"infatti, come volevasi dimostrare sono salito silver carryandomi da solo","replies":[]}]},{"poster":"beozo","date":"2015-07-01T18:29:04.062+0000","up_votes":1,"down_votes":0,"body":"addami se vuoi","replies":[]}]}