{"poster":"Shibe","date":"2015-05-05T05:46:09.267+0000","title":"Snowballs in ARAM, thoughts?","subforum":"Miscellaneous","up_votes":3,"down_votes":1,"body":"I love a chilled game of ARAM, but the recent update that added the snowballs (like from the Poro King game mod) is kind of starting to ruin it. Personally I think they should just erase the snowballs. If not that, at least nerf the range and cool down on it. What are your thoughts?","replies":[{"poster":"TwoHeadedFreak","date":"2015-05-05T13:15:30.330+0000","up_votes":3,"down_votes":0,"body":"Agreed. It takes the skill out of killing a ranged champion. Just sit well out of range, as soon as you nail them with the snowball, zoom to them and kill them. Ranged champions are squishy because they can stay out of direct combat if they are good, but the snowball makes that impossible, also kiting is out the window. basically, it becomes a game for melee champions only (although Morgana is one mage that can use the snowball well). Too bad all of my owned champions are marksmen or mages. Guess I'm pretty much screwed.\n\nEither nerf (preferably remove) the mark spell or buff all ranged champions.","replies":[]},{"poster":"JasonWazza","date":"2015-05-05T05:58:21.779+0000","up_votes":2,"down_votes":0,"body":"My biggest problem with it, is it's basically a nuke if you co-ordinate the 5 mark's.\n\nStart of game taking 5 is 250 damage.\n\nNot to mention so many times i have sniped someone off with the true damage on the thing.\n\nIt is a good addition, but it makes taking ignite somewhat pointless when you can do the same sort of damage with a snowball and have more utility.","replies":[]},{"poster":"Caress of Venus","date":"2015-05-06T03:53:21.910+0000","up_votes":2,"down_votes":2,"body":"I think the biggest thing being neglected here is the fact that Mark/Dash has made those games of 5 melee champions bearable. It's changed from 20 minutes of being poked to death by Nida, Jayce, Cait, Ziggs, etc and it means that those ranged champions actually have to position and be a bit more activate in dodging what they deal. It gives no range champions a fighting chance against ranged.","replies":[{"poster":"AnArtillerySpec","date":"2015-05-13T06:58:16.428+0000","up_votes":1,"down_votes":0,"body":"Unless your on the team with 5 ranged vs non ranged.   Then a snowball connects and the fights over....","replies":[]}]},{"poster":"FrozenFlame","date":"2015-05-11T23:45:26.351+0000","up_votes":1,"down_votes":0,"body":"Absolutely. My complaints towards these skill have no bounds. It does half the damage of ignite with only a 20/15 second cooldown, the hit box seems bigger than Lee Sin's Q and although it's slower, it travels two to three times the distance as well. And there can be up to five of them on a team. And it's hard to see.\n\nIt's really taken out the importance of positioning in the game. Rather than working hard to be in a good position as a tank or bruiser to initiate, you can be anywhere really. And even if you work hard as an ADC or mage to position yourself correctly, you can still be reached easily.\n\nEven if all the champions manage to dodge, you can still hit minions and then flash after that and then use your own gap closer (like Amumu's Q) to get in range.","replies":[]}]}