{"poster":"Ari","date":"2016-01-21T05:11:49.919+0000","title":"Soy ex platino y no puedo jugar con ex platinos ni con ex diamonds","subforum":"Charlas Generales","up_votes":1,"down_votes":1,"body":"Bueno, la cuestion es que me sale el cartel de que solo puedo invitar jugadores de bronza a oro, cuando se supone que yo deberia poder jugar con diamonds y platinos porque termin&eacute; la pretemporada en platino, o en todo caso con platinos al menos, porque termin&eacute; la s5 en oro 2, sin embargo a mi es como que el sistema me considera plata y solo me deja jugar con gente que se supone que tiene menos elo que yo. La verdad que no lo entiendo, porque tengo hasta amigos que estan hace rato en oro V y pueden invitar platinos y yo que soy ex platino no puedo?? tiene que ser un bug, porque no seria para nada justo que no me dejen, hace casi un a&ntilde;o que no soy plata  ni estoy cerca de serlo, tenia muy buen elo ganaba de a 25 me quitaban 15, venia en racha incluso, a alguien mas le pasa o solo riot tiene algo contra mi???","replies":[{"poster":"Yrox the Third","date":"2016-01-21T05:14:12.689+0000","up_votes":1,"down_votes":0,"body":"Parece que es un bug que anda ahora, si tienes buen elo como dices lo mejor seria que jugaras las 10 rankeds y intentes ganar lo que puedas, asi quedaras en la misma liga que estabas o quizas, si tienes suerte, un poco mas alto.","replies":[{"poster":"Ari","date":"2016-01-21T05:19:28.259+0000","up_votes":1,"down_votes":1,"body":"no quiero rankear ahora, tengo miedo de que justamente ese bug me termine dejando injustamente en silver o bronza y tener que hacer todo el camino de nuevo que me costo un huevo :/","replies":[{"poster":"Yrox the Third","date":"2016-01-21T05:21:13.494+0000","up_votes":2,"down_votes":0,"body":"El bug no es que te considere como bronce o plata, es que no te deja jugar con gente de elo alto, pero tienes tu elo intacto, deberias probar.\nSe que es una lata, pero no te deberia costar mucho volver a subir (si, lo repito, es una lata increible)","replies":[{"poster":"Ari","date":"2016-01-21T05:29:34.923+0000","up_votes":1,"down_votes":1,"body":"es que yo tambien quiero jugar con mis amigos que estan en platino y diamante, se juntan entre ellos incluso y no me pueden invitar a mi porque \"soy plata\".","replies":[{"poster":"Yrox the Third","date":"2016-01-21T05:32:46.415+0000","up_votes":1,"down_votes":0,"body":"Si pero igual te recuerdo, si juegas las primeras rankeds en premade te bajan el elo y seria aun peor, considera eso.","replies":[{"poster":"Ari","date":"2016-01-21T05:36:51.576+0000","up_votes":1,"down_votes":1,"body":"prefiero jugar en premade asegurando la win a jugar solo y que me toque cualquier cosa y perder las 10 por teams enemigos organizados.","replies":[{"poster":"Yrox the Third","date":"2016-01-21T16:21:41.393+0000","up_votes":2,"down_votes":0,"body":"Bueno,  entonces es tu eleccion.","replies":[]}]}]}]},{"poster":"Merten","date":"2016-01-21T05:34:22.379+0000","up_votes":1,"down_votes":0,"body":"Si era platino alto no cuesta nada volver al 5 y ahi si lo deberia dejar hacer duo, en plata y oro si sabes que hacer son un tramite las partidas","replies":[{"poster":"Ari","date":"2016-01-21T05:39:06.356+0000","up_votes":1,"down_votes":1,"body":"para vos, a mi oro me cuesta mucho, ya ahi empiezan a tocar platinos V eloboosteados y estancados que definen las partidas, no me preocupa quedar en plata, me preocupa quedar en oro si gano la mayoria y no poder hacer duo con platinos+","replies":[]}]}]}]}]},{"poster":"Bienzahar","date":"2016-01-21T05:26:37.704+0000","up_votes":1,"down_votes":0,"body":"Eso es mala señal, conoci un caso de un platino con un mmr muy bajo que quedo en plata, le pasaba lo mismo que a ti, no podia invitar gente de platino ni diamante pero si oro, plata y bronce.","replies":[{"poster":"Ari","date":"2016-01-21T05:32:41.041+0000","up_votes":1,"down_votes":1,"body":"me molesta lo del elo tener que subir todo pero bueno a todos les pasa que quedan mas abajo, lo que no me parece es que pirulo ex oro V pueda jugar con platinos y yo que soy ex platino no :/","replies":[{"poster":"Bienzahar","date":"2016-01-21T05:38:44.400+0000","up_votes":1,"down_votes":0,"body":"Es que el elo no esta representado por tu liga directamente, no siempre existe una correlación.","replies":[{"poster":"Ari","date":"2016-01-21T05:40:51.332+0000","up_votes":1,"down_votes":1,"body":"ah, entonces que logica tiene que yo siempre ganaba de a 25 lp?? si tuviera \"elo de plata\" deberia estar estancado y no era asi xD","replies":[{"poster":"Bienzahar","date":"2016-01-21T05:51:00.222+0000","up_votes":1,"down_votes":0,"body":"Eso no dice nada.","replies":[{"poster":"Ari","date":"2016-01-21T06:17:22.459+0000","up_votes":1,"down_votes":1,"body":"ah, entonces como se supone que funciona el sistema? cuanto mas elo tenes, mas lp te van a dar para que llegues a donde deberías, esa es la lógica de riot, lo mismo a la inversa, mal elo = mas quita de puntos.","replies":[{"poster":"Bienzahar","date":"2016-01-21T18:21:37.603+0000","up_votes":1,"down_votes":0,"body":"No funciona así el algoritmo, es mucho más complicado que eso.","replies":[{"poster":"Ari","date":"2016-01-22T00:02:07.606+0000","up_votes":1,"down_votes":1,"body":"yo se bien como funciona el sistema, o mejor dicho como se supone que funciona el sistema, y el tema del LP tiene muchisimo que ver, el emparejamiento tambien influye, pero yo siempre me fijaba y eramos todos mas o menos del mismo nivel, de yo pertenecer a una liga mas baja, hubiera recibido mucho menos LP, riot no me daba de a 25 porque se le daba la gana, de eso estoy seguro, es porque pertenecia a la liga o incluso tenía que estar mas arriba.","replies":[{"poster":"Bienzahar","date":"2016-01-22T21:53:35.470+0000","up_votes":1,"down_votes":0,"body":"No funciona así el algoritmo, es mucho más complicado que eso.","replies":[]}]}]}]}]}]}]}]}]}]}