{"poster":"Glanedur","date":"2015-03-31T07:33:38.585+0000","title":"Dieses Matchmaking .. gg!","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":25,"body":"Ernsthaft?\r\n1 Match am Tag und ich krieg 3 Nubs ? Instant lost match ._.\r\nVeigar hat dann erstmal nen 300% ap bonus sodass der bei lv 5 schon 535ap hat\r\nVi dies nichteinmal geschissen kriegt den Dragon zu machen oder zu ganken\r\nNen Wukong der seine lane nach 2min aufgibt um einfach random irgendwo aufzutauchen ..\r\n\r\nWo ist der Button zum &quot;Spiel verlassen und an Moderator &uuml;bergeben&quot;?\r\nDa interessiert mich dann auch die leaver strafe nicht mehr bei 2v5 (support/first time champ){{summoner:31}}","replies":[{"poster":"HyperionCH","date":"2015-03-31T07:53:55.499+0000","up_votes":9,"down_votes":0,"body":"Man wird grundsätzlich mit gleich starken Spielern gematched (sofern keine Premades dies verwässern).\n\nVielleicht liegt es deshalb auch daran, dass du vom System selber als \"noob\" ansehen wirst. ;)\n\nZumindest würde ich an deiner Stelle eher ruhig sein:\n\n- Du hast die Lane übelst verloren.\n- Veigar in deinem Team hat wesentlich besser gespielt (nach dem Rework ist es gegen Kata nicht mehr so einfach)\n- Der Jungler kommt wohl deshalb kaum bei dir ganken (da machte mid mehr Sinn).\n- Mit einer klar verlorenen Botlane ist Drake nur schwer zu kriegen (bzw. nur mit Risiko)\n- Du hast echt den Rekursivbogen für Lucian gebaut? Für Ende der Weisheit oder Hurrikan? Egal! Beides nicht sinnvoll.\n\nSpiele besser, dann kriegst die bessere Mates (aber auch bessere Gegner).\nEs war ja nicht so, dass die Gegner wesentlich besser waren (ausser deren ADC, der aber einfach gefeedet war; seine Stats sind sonst nicht ganz so gut)","replies":[{"poster":"Glanedur","date":"2015-03-31T10:10:31.475+0000","up_votes":1,"down_votes":9,"body":"***","replies":[{"poster":"ÆonFox","date":"2015-03-31T11:30:04.476+0000","up_votes":2,"down_votes":0,"body":"Tut mir leid aber allein sich zu wundern wie Veigar an AP kommt zeugt nicht von Spielverständniss, deine anderen Aussagen bekräftigen diese Einschätzung zusätzlich, deine Beleidigungen lassen nicht gerade höhere Geistige Entwicklung schließen was schade ist... Du solltest ein gesamtes Verhalten gegenüber anderen vor allem auch im Internet überdenken dann wirst du feststellen das vieles leichter von der Hand geht gerade LoL, da in diesem Spiel ein gereitztes Wort mehr nachteile im Spiel hat als irgendetwas anderes und von nicht nur gereitzten Wörtern hast du leidig genug...","replies":[{"poster":"Glanedur","date":"2015-03-31T19:11:09.359+0000","up_votes":1,"down_votes":4,"body":"***","replies":[{"poster":"Sanctuary2056","date":"2015-03-31T19:27:11.293+0000","up_votes":4,"down_votes":0,"body":"Internet-eier... -.- ganz eindeutig Internet-eier\nmehr gibt es dazu eigentlich nicht zu sagen.","replies":[]}]}]},{"poster":"xxCheatsrichter","date":"2015-03-31T10:32:19.006+0000","up_votes":2,"down_votes":0,"body":"deine aufgabe ist es auf die minimap zu gucken. es gibt viele szenarien, wo man nicht rechtzeitig pingen kann. beispielsweise wenn de rtoplaner mit teleport runterkommt.\n\ndas ganze hättest du verhindern können, indem du wards gesetzt hättest. hast du aber kein einziges gekauft außer dem trinket.\n\ndu wirst mit gold gematcht? bei einer mmr von 1011 im letzten spiel? da waren unraked level 0 accounts und silber 5 dabei.","replies":[]},{"poster":"drexxsack","date":"2015-03-31T10:46:20.747+0000","up_votes":2,"down_votes":0,"body":"Ich würde dich darum bitte, auf die Beleidigungen zu verzichten.","replies":[]},{"poster":"HyperionCH","date":"2015-03-31T13:55:48.953+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Glanedur,realm=EUW,application-id=KYnfKGf0,discussion-id=24PGrsRo,comment-id=00000000,timestamp=2015-03-31T10:10:31.475+0000)\n>\n> Ich hab die Lane übelst verloren? \n\nJa, ist klar ersichtlich.\n\n> Dann erklär mir folgendes:\n> 2v5\n\nIhr ward aber zu fünft. Wäre sonst nicht gut für dich, wenn dein Farm kaum besser ist als bei jenen mit afk/dc. ;)\n\n> keine missing, \n\nDu bist verantwortlich, um auf die Mini Map zu schauen (und für Vision auch). \"ss\" ist kein Muss (auch pingen nicht).\n\n> ganked von mind 2 leuten (1v3),\n\nIch hatte am SO ein 2vs5 Gank, da der Midlaner roamen kam und der Toplaner TP benutzte. Na und?\nKlar, gab 2 Kills für die Gegner, aber es war nicht \"worth\" (viel CS ging verloren)\n\n> keine ganks vom jungle,\n\nHabe dir auch erklärt, warum es keine gab. ;)\n\n> keine kommunikation (außer \"shut the fuck up\" vom wukong)\n\nBesser keine Kommunikation als schlecht. Und ich vermute, du warst auch nicht freundlich, wenn der Wukong so antwortete.\n\n> veigar .. wäre mir neu das der eine passive mit +300% ap hat (3 items = 260ap, lv10 = 650ap)\n\nIch weiss, nicht was du damit sagen möchtest (Veigar war ja in deinem Team), aber hier einmal zum Nachrechnen bei 3 Full-Items:\n\nDoran: 15 AP\n(vermutete) AP-Runen: 15 AP\nZhonyas: 120 AP\nRaba: 120 AP\nVoid: 70 AP\n= 340 AP\n+ 30% Raba-Passive = 442 AP\n\nJetzt kommt noch die Q-Fähigkeit dazu. Veigar hat extrem gut gefarmt und auch einige Kills gemacht (wohl mit der Q).\nMit dem Rework kann Veigar mit seiner Q sogar mehr als ein CS machen (somit mehrfach zusätzliche AP). Zusätzliche 200 AP sind da schon möglich, da man sicherlich da Q als erstes maxt.\n \n> match direkt instant nach dem start verloren da die premades (top/mid) weder dem jungle noch irgendwem anderes helfen wollten. \n\nTop hatte selber Probleme und war kaum eine Hilfe. Veigar muss mit der Q farmen, um im Late stark zu sein. Er ist kein Roam-Champ wie z.B. Zed oder Ahri.\n\n> ich find das immer super wenn die gegner von top/mid lane direkt bei dir aus dem jungle kommen um dich zu ganken und man dann hier im forum als \"nuub\", \"bastard\", \"no skill\" beschimpft wird obwohl die inzest kinder hier nicht einmal mit bronze 5 gematch werden würden.\n\nWir habe hier keine dieser Kraftausdrücke benutzt.\nMein Wortlaut war ein Zitat (deshalb Anführungszeichen) von dir.\n\nGanks gehören zum Spiel dazu. Insbesondere als ADC ist man üblicherweise Traget Nr. 1.\nDies ist in HotS btw auch so. Spiel einfach Valla dort. ;)\n\n> guckt in meinen spielverlauf ihr hartzer ich werd mit gold gematcht.\n\nIch habe in den Normals jetzt keinen Gold gesehen. Aber vielleicht war es ja in ARAM. Aber ARAM ist anders. Da hatte ich auch schon Dia-Spieler als Gegner (den armen Dia-Teemo tut mir heute noch leid, den ich damals als Nauti auseinander genommen habe^^).","replies":[{"poster":"Glanedur","date":"2015-03-31T19:09:28.749+0000","up_votes":1,"down_votes":4,"body":"Deathcap 120ap 30% bonus\nHourglas 120ap\nwälzer 20ap\ndorans ring 15ap\n(275ap meets q?) \n= 635ap with lv 11\n\nthe items that are shown are his end game items, the items listed above are the ones he killed everyone with. \n\n\"Wenn Veigar einen Champion tötet, erhält er permanent 1/2/3/4/5 Fähigkeitsstärke.\"\n\n\nenemy vi: \"veigar are you hacking or how do you got so much ap\"\n\nfeeded enemy lucien same level 185ad","replies":[]}]}]}]},{"poster":"ÆonFox","date":"2015-03-31T08:36:57.284+0000","up_votes":4,"down_votes":0,"body":"Nach dem was du gerade geschrieben hast solltest du erstmal über dich nachdenken, leg dir ein Mindset zu das nicht sofort alles was dir nicht gefällt als Noob bezeichnet... Darüber hinnaus werde besser und du wirst mit besseren gematcht...","replies":[]},{"poster":"BM Vilich","date":"2015-03-31T08:07:50.786+0000","up_votes":3,"down_votes":0,"body":"Wenn du das Lucian game meinst: Du warst da mit Abstand der schlechteste, abgesehen von Wukong.","replies":[]},{"poster":"Tschokii","date":"2015-03-31T08:14:53.977+0000","up_votes":3,"down_votes":1,"body":"Noch nicht mal Level 30 und schon beschwerst du dich über das Spiel?\n\nIch schätze wenn du Ranked anfängst wird man noch öfter von dir hören^.^","replies":[]},{"poster":"Tekilla809","date":"2015-03-31T09:27:43.053+0000","up_votes":1,"down_votes":0,"body":"aber wem willst du die schuld geben ? Miss Fortuna ?\n\nWikipedia sagt zur  \"Randomness\" folgendes\n\nRandomness means lack of pattern or predictability in events.[1] A random sequence of events, symbols or steps has no order and does not follow an intelligible pattern or combination. Individual random events are by definition unpredictable, but in many cases the frequency of different outcomes over a large number of events (or \"trials\") is predictable. For example, when throwing two dice, the outcome of any particular roll is unpredictable, but a sum of 7 will occur twice as often as 4. In this view, randomness is a measure of uncertainty of an outcome, rather than haphazardness, and applies to concepts of chance, probability, and information entropy.\n\ndas heißt im Grunde nur - die Wahrscheinlichkeit das du so ein kack team hast ist nicht vorraussehbar -\naber absehbar über einen längeren Zeitrahmen :P","replies":[{"poster":"ÆonFox","date":"2015-03-31T11:32:34.599+0000","up_votes":1,"down_votes":0,"body":"Im Umkehrschluss ist ein gutes Team aber genauso absehbar^^ und wenn man dann immernoch haushoch verliert muss es wohl an einem selbst liegen XD","replies":[]}]},{"poster":"Feeding Rengar","date":"2015-03-31T10:18:42.174+0000","up_votes":1,"down_votes":0,"body":"Sorry aber das ist einfach nur wieder ein qq thread.\nIch hatte auch letzten schlechten games bzw ich hatte auch 3 afks na und ? :D\nEs war ja klar das wir nicht mehr gewinnen können und haben trotzdem das beste gegeben.\nAußerdem sind normals zum lernen da verstehste.","replies":[]}]}