{"poster":"Shaminsec","date":"2015-02-26T02:02:51.892+0000","title":"Composición de equipos","subforum":"Guias y consejos","up_votes":1,"down_votes":0,"body":"bueno, quería preguntar que tan importante es una composición de equipos en el sentido de ganar tf y haci lograr ganar partidas, ya que un dia en una ranked un compañero de equipo se puso a flamear porque no teníamos tanke, en otra ocasion todos decian que perderiamos por no tener ap, etc. \r\n \r\npor favor aclarenme los roles que debe haber en un equipo, las funciones en una tf y si pueden darme algun otro tip lo aceptaria, gracias","replies":[{"poster":"SilentReign","date":"2015-02-26T10:50:03.956+0000","up_votes":1,"down_votes":0,"body":"Mira, no hay una receta mágica que te permita ganar una partida. pero de cara a lo teórico si es verdad que para aumentar las chances de ganar existen algunos puntos claros a tener en cuenta, que son los siguientes.\n Principalmente lo mas útil para ganar una pelea, sea la cantidad de jugadores que sean (1vs1; 1vs2; 2vs2; y asi sucesivamente hasta 5vs5) es el CC (de sus iniciales por Crowd Cotrol, o como me gusta a mi llamarlo, Control de Campo, para mantener la abreviatura) quien le dará al usuario las herramientas para manipular el combate, en muchos casos la toma de decisiones y la habilidad individual y grupal de los involucrados marcara la diferencia, ciertamente hay limites para lo que podes hacer o no, pero eso es cuestión de practicar y aprender, aun así se a visto casos en los que con tan solo una habilidad de CC se decide una tf y por que no una partida. El tema del CC en un poco extenso, si queres conocerlos todos te recomiendo que investigues ya que el conocimiento en este juego también es primordial. Y a la par del CC hay que mencionar el CC en area, lo cual te permite manipular de 2 a 5 jugadores al mismo tiempo dependiendo de la habilidad de cada campeón en concreto.\n Secundariamente, esta el daño, puesto que por mas que metas un stun a 5 pjs si no podes matarlos es un desperdicio, siempre y cuando tu intención es la de matarlos, ya que el CC no solo te sirve para pelear si no que también para escapar de una situación en la que no queres luchar. El daño, como asumo sabrás, se divide entre tres tipos, ap ad y true dmg. El ap se ve reducido por la mr y el ad por la armadura (en cuanto al true dmg, pues no tiene defensa, la única que te queda es ponerte mas hp y rogar por aguantar) y por lo tanto, un equipo, o mejor dicho, una composición en la cual solo hay daño de un tipo, ap o ad, llega a ser contraproducente, sobre todo si los jugadores no tienen una táctica basada en esto de antelación, como por ejemplo una team comp donde sean todos ad pero con habilidad de reducción de armadura (se que existen campeones que con sus skills pueden reducir la armadura de los oponentes, pero no se cuales exactamente :P). Y como con el CC también hay que tener en cuenta el daño en area, para acabar mucho mas rapido una tf.\n Y el ultimo, pero no menos importante, punto a tener en cuenta es la resistencia, la capacidad de uno, dos, y en ocasiones hasta tres, individuos de resistir grandes cantidades de daño, obliga al enemigo a tomar una decisión ¿gasto recursos y tiempo para matar a un tanque? o ¿busco la manera de liquidar a las fuentes de daño del adversario primero?.\n Por separados estos puntos parecen inofensivos por si mismos, es decir, si tengo full cc no tengo ni daño y aguante, por otro lado, una construcción completa de daño me deja vulnerable al CC y los tanques aun tienen oportunidad de resistir lo que haga falta para que el daño del oponente me liquide, y al final mucha resistencia puede dejarme sobrellevar el daño, pero sin daño, sin CC, y con el CC del rival me matarían irremediablemente. El chite viene aca, y es que los cambiones suelen tener 2 de estas características, dañño y cc, cc y aguante, aguante y daño, o las tres juntas, daño cc y aguante. El truco esta en seleccionar y controlar campeones que cumplan dos o tres de estos puntos, y si puede ser alguno de daño o CC en area, mejor que mejor, puesto que de cara al mid o late game, la gente suele ir muy junta.\nEso en solo Q, puesto que equipos profesionales son capases de levar composiciones especificas, pero eso por que hay cooperación y coordinación.\n Espero que esto aclare tus dudas, si tenes mas solo comentala y veré si puedo responderte. :D","replies":[{"poster":"Shaminsec","date":"2015-02-26T18:04:02.662+0000","up_votes":1,"down_votes":0,"body":"gracias por tu ayuda:)","replies":[]}]}]}