{"poster":"Queen Noth","date":"2017-01-16T20:08:42.227+0000","title":"Mein erstes Mal Ranked (Kleiner Erfahrungsbericht)","subforum":"Spielerverhalten & Moderation","up_votes":4,"down_votes":8,"body":"Nun, ich dachte halt ich schnuppere mit mein Freund mal die Rankedspiele um mal die genauen Unterschiede zu sehen. An sich find ich schon interessant und herausfordernd nur mit den Champs die man hat zu agieren, doch in unseren ersten Platzierungsspiel hat das toxische Level ein ganz neues Level erreicht. Wir hatten zu einen zwei Goldspieler gehabt, die mich und mein Freund beschimpften und das permanent. Dass wir so schei&szlig;e sind, sucken, w&auml;hrend sie selbst um die 5 Tode ansammelten. Sie schrieben in allchat dass wir feeden, geboosted sind und schleunigst reported werden sollen und der jhin adc sagte zu meinen freund, der grad supp war: &quot;That you suck its only the truth. Is to tell the truth flaming?&quot; Die midlanerin keifte mich an als Junglerin, weil bi mein erster Gank Khartus schnell auswich ich w&uuml;rde trollen. Usw. Das ging das Spiel &uuml;ber, st&auml;ndige reportaufrufe in allchat, wo dann die zwei goldspieler und das gegnerische team sich gegenseitig beleidigten, wir unranked schuld an den lose sind und und und. Weshalb dann schlie&szlig;lich zum Lose f&uuml;hrte. Am Ende mussten wir unser eigenes Team f&uuml;r ihr toxisches Verhalten reporten und mein Freund meinte, dass wenn die n&auml;chsten Spiele genauso sind er sich von Ranked in Zukunft fernhalten wird :/\r\n\r\nIch fand den Ausgang ziemlich schade, denn ich wollte schon in Ranked mal in ne Elo eingeteilt werden um zu sehen wo ich steh und vor allem, da mich die Normals langsam langweilen und ich mich gern ab Bronze langsam hocharbeiten will. \r\n\r\nScheinbar best&auml;tigt sich das was alle oft sagen: Lol ist tats&auml;chlich toxisch ohne Ende, alles ab Silber ist mega arrogant und halten sich f&uuml;r die besten, wodurch jeder Rankedneuling abgeschreckt wird :/","replies":[{"poster":"EasternMountain","date":"2017-01-17T03:19:20.577+0000","up_votes":13,"down_votes":0,"body":"***","replies":[{"poster":"Queen Noth","date":"2017-01-17T09:01:31.543+0000","up_votes":2,"down_votes":0,"body":"Huhu, danke für deine ausführliche Analyse, möchte gern mich aber noch zu zwei Sachen äußern, vielleicht kannst du mir und ihm auch da Tipps geben.\n\nGanken: Schon in den Normals hab ich mit den Problem zu kämpfen gehabt, dass die Laner einen sehr häufigen und frühen Gank erwarten. Sehr oft hatte ich sogar die Situation gehabt, dass man mir unterstellt hab ich würde  ja niemals ganken, obwohl ich schon von Lane zu Lane hetze. An sich mag ich das Jungeln sehr, besonders weil ich so viel an strategische Erfahrung lernen (könnte), aber wenn zb. ein Toplaner daherkommt, der trotz dreifachen Gank gut 5 mal stirbt und schreibt \"Report Noob jungle, he never ganks me!\", komm ich mir wirklich verarscht vor :/ Keine Ahnung wie es speziell in Ranked aussieht, aber vielleicht hast du ein Rat wie ich mit den Gankdruck umgehen könnte.\n\nItembuild: Ich würde nicht sagen, dass ich speziell zu jeden Champ jedes Itembuild im Kopf, eher grobe Pläne (Tanksupp Cho: Klassisches Suppitem plus alles was viel Leben gibt. Reksai: Mischung aus Tank und schaden usw). Zu einen ist mein Freund eher etwas speziell vom Charakter: Wenn er sich angegriffen fühlt, lässt er sich umso weniger was sagen und baut dann aus trotz was anderes. Bitte denkt jetzt nicht er ist ein vorsätzlicher Troll. In Normals hab ich oft gesehen wie er sich sehr viel Mühe gibt den ADC zu beschützen usw, aber wenn dann in schlechten Runden mehrere extremst auf ihn Rumhacken geht er halt nach dem Motto: \"Wenn sie sich jetzt schon über ihn aufregen, dann sollen sie ein Grund haben.\" Ein weiterer Grund ist, dass er sein Itembuild eher nach Gefühl aufbaut soz. Als er mal eine Runde Ashe ADC baute er auf Tank auf und als ich ihn fragte wieso er das machte antwortete er, dass er damit nicht so oft stirbt, da sein supp ständig wegging ohne auch nur ein Warnping zu setzen. Also glaube ich ihm, dass er sich schon etwas bei seinen Build denkt. Aber da ich nicht viel weiter bin in Wissen und in ADC nicht wirklich erfahren bin (Bin Main Supp und Jungle) weiß ich leider nicht wie ich ihm da unterstützen kann :(\n\nHoffentlich hast du da Tipps für uns :C","replies":[{"poster":"Time2Whine","date":"2017-01-17T12:42:21.442+0000","up_votes":4,"down_votes":0,"body":"Zu dir und deinen Itembuilds: Du solltest daran denken, was die Stärken des Champions sind und entsprechend die Items bauen. Cho'Gath ist ein AP'ler mit viel Leben. Also baut man ihn wenn dann auf AP mit entsprechenden HP Stats wie {{item:2301}} {{item:3027}} und nicht mit {{item:2303}}. Du nimmst Cho komplett den Schaden weg, wenn du ihn nur auf HP spielst. Genauso wie bei Vel Koz wo du auch {{item:2303}} baust, wozu? Für Leben auf einem AP Poke/Burst Mage? Das ist der falsche Weg. Genauso wie TP als Support mitzunehmen. Warum nicht Flash und Exhaust/Ignite?\n\nRunen und Masteries: Du solltest du dringend daran arbeiten. Gerade deine Runenseite 1 hat keinen Sinn und Verstand. Im Shop kannst du für 1 !!! LP pro Stufe 2 Rune zwei - drei komplette Runenseiten bauen mit denen du gut spielen kannst und die Stärken des Champs weiter verbessern kannst (das ist der Sinn davon).\n\nDeine Skillorder: Bei Kha ist die Hauptschadensquelle und Kha ist für Schaden machen gedacht, seine Q. Du skillst aber erst seine E was kompletter Unsinn ist und dann seine W. Somit schwächst du dich noch um einiges weiter als du zu dem Zeitpunkt des Spiels ohnehin warst. \nBei Cho genau dasselbe. Du maxt seine E, was bedeutet, dass du die Lane bei normalen Angriffen pusht und somit das Leben für deinen Kumpel noch umso schwerer machst, zudem spielst du gegen eine doppel Range Combo auf der Bot wodurch du ohnehin kaum in Autoattack Range kommen wirst. Wozu dann nicht deine Hauptschadensquelle mit der Q maxen?\n\nZu deinem Freund:\nDas Problem mit seiner Einstellung wird sein, dass er immer, sobald es nicht und solche \"exotischen\" Itembuilds wählt immer als Troll abgestempelt wird. Im Ranked wollen die Leute tryharden und aufsteigen. Wenn ich jemanden sehe, der auf einem ADC keinen Dmg sondern Tank baut und zu dem Zeitpunkt schlechte Stats hat, würde ich denjenigen immer als Troll abstempeln, da er überhaupt nicht verstanden wie der Champ und vor allem die Rolle zu spielen ist. Solche Aktionen erwarte ich von jemanden der < Level 5 ist und noch nie LoL gespielt hat und nicht von einem Spieler der Ranked spielt. Das funktioniert einfach nicht, da keiner seine Mentalität kennt geschweige denn interessieren wird, sondern immer als Troll/Ungeeignet abstempeln wird.\n\nWie EasternMountain schon sagte, seid ihr, ist nicht böse gemeint, einfach noch nicht bereit für Ranked wenn ihr solch grundlegende Dinge des Spiels, der Champions, der Rollen etc. nicht verstanden habt und damit anderen Spieler wie den Goldspielern, denen ich mal annehmbares Spielverständnis attestiere, einfach nur das Spiel versaut bzw. in deren Augen trollt. Spielt ihr doch Ranked, werdet ihr euch in Low Bronze wiederfinden und dort auf Spieler treffen die auf eurem Niveau sind.\nDas toxische Verhalten ist allerdings keineswegs in Ordnung und ihr habt richtig gehandelt indem ihr sie reportet habt.\n\nSchaut mal auf www.champion.gg rein, dort findet ihr zu allen Champions die aktuellen und erfolgreichsten Itembuilds, Runen, Masteries, Skillorders etc. im aktuellen Patch. Das könnte euch dabei helfen die richtigen Items zu kaufen etc.\n\nIn dem Sinne - üben, üben, üben! Gerade bei eurem Spielverständnis solltet ihr Champions, die ihr nicht beherrscht und nicht kennt, nicht als erstes im Ranked auspacken sondern in Normals anspielen/ausprobieren´.","replies":[]},{"poster":"ELOW Cronos","date":"2017-01-17T12:01:30.082+0000","up_votes":1,"down_votes":0,"body":"Ich bin Main Jungler, also kenne ich deine Probleme sehr gut\n\nGanken: Gerade als Main Jungler ist es wichtig sich ein dickes Fell zuzulegen. Du bist oftmals Flameziel Nr. 1 und grundsätzlich eh an allem Schuld. Reagier nicht auf die Leute und ignorier sie, sollten sie weiter flamen ist muten sehr zu empfehlen. \n\nAls Jungler ist es wichtig das du Ganks nicht erzwingst sondern nur dann gankst wenn sich eine gute Gelegenheit bietet. Durch mehrere fehlgeschlagene Ganks fällst du zu sehr behind und bist dem Team nicht mehr von Nutzen. \n\nVon da her, wenn du dir unsicher bist  ob du Ganken sollt oder nicht doch lieber Farmen, entscheide dich im Zweifelsfall immer fürs Farmen, denn dabei kommt immer Gold & EXP rein.\n\n\nItembuild: In LoL ist die Wahl der richtigen Items sehr wichtig, doch gerade für Anfänger ist dies oftmals sehr schwer. Doch hier kann leicht Abhilfe  geschaffen werden. Die Webseite Champion.gg zeigt euch für jeden Champion das meistgebaute und das erfolgreichste Itembuild. \n\nAuch wenn generell gilt das das Itembuild der jeweiligen Situation angepasst werden sollte, ist es für Anfänger besser einfach stumpf das meistgebaute Build 1 zu 1 nachzubauen, statt sich selber iergendwas auszudenken. \n\nAlso während dem Loadingscreen kurz bei Champion.gg vorbeischauen und das Build des eigenen Champions abchecken ;).\n\n\nIch empfehle euch des weiteren erstmal die Finger von Ranked zu lassen, ausser es macht euch nichts aus im niedrigsten Bronzebereich zu landen.\n\nWenn du noch Fragen zum Junglen oder LoL generell hast kannst du mich auch gerne ingame adden.","replies":[]},{"poster":"gtclegende","date":"2017-01-17T09:32:43.640+0000","up_votes":1,"down_votes":0,"body":"Zu der ersten Frage kann ich sagen, dass es nicht deine Aufgabe als Jungler ist jede Lane dauerhaft zu ganken. Du würdest sonst zu viel Gold und Exp verlieren, die du anderfals bekommen hättest und außerdem gibt es oft keine Richtige möglichkeit zu Ganken. An deiner Stelle würde ich Personen ignorieren, wenn diese sich beschweren dass du nie Ganken kommst.","replies":[]}]}]},{"poster":"Mi3zekatze","date":"2017-01-16T21:09:44.958+0000","up_votes":1,"down_votes":1,"body":"Ignorier es! \nLass sie reden! Nobody cares! Ich persöhnlich musste NOCH nie jemanden muten weil mich es (nicht mehr) mich nicht interessiert was die reden! Ist es was zum Spiel? Super! Alles andere wird ignoriert und das fällt mir nichtmal schwer. \n\nUnd nach deinen 10 Games wirst du auch feststellen das du deiner Elo näher gekommen bist und nicht mehr (seltener*) geflamet wirst weil du schlecht spielst (bzw. Schlechter als andere).  \n\nGl trust me wird noch!","replies":[{"poster":"Angel Ayume","date":"2017-01-16T21:21:14.097+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=xtaktiq,realm=EUW,application-id=KYnfKGf0,discussion-id=QpI0JQK1,comment-id=0003,timestamp=2017-01-16T21:09:44.958+0000)\n>\n> Ignorier es! \n> Lass sie reden! Nobody cares! Ich persöhnlich musste NOCH nie jemanden muten weil mich es (nicht mehr) mich nicht interessiert was die reden! Ist es was zum Spiel? Super! Alles andere wird ignoriert und das fällt mir nichtmal schwer. \n> \n> Und nach deinen 10 Games wirst du auch feststellen das du deiner Elo näher gekommen bist und nicht mehr (seltener*) geflamet wirst weil du schlecht spielst (bzw. Schlechter als andere).  \n> \n> Gl trust me wird noch!\n\nSelbst wenn es dich nicht stört solltest du die Leute reporten, damit sie irgendwann bestraft werden, sollten sie das öfter machen. Es gibt immerhin Leute die sowas persönlich nehmen und dann verletzt sind oder denen es einfach nervt und störend finden. Du hilfst der Community damit sowie du Riot hilfst. \nDas es dich nicht stört ist gut, aber reporten solltest du dennoch. Sie benehmen sich nämlich dennoch völlig daneben egal ob es stört oder nicht.","replies":[{"poster":"0815xand0r","date":"2017-01-16T22:09:54.766+0000","up_votes":1,"down_votes":0,"body":"Aber er schreibt doch nur davon, dass er niemanden mutet, weil er es ignoriert, wenn die Leute flamen, und nicht, dass er sie nicht reportet.","replies":[{"poster":"Angel Ayume","date":"2017-01-16T22:15:49.676+0000","up_votes":1,"down_votes":1,"body":"Oh sorry, mein Fehler. \nIch hab irgendwie reporten gelesen. xD","replies":[]}]}]}]},{"poster":"Badboyrus","date":"2017-01-16T20:29:59.436+0000","up_votes":2,"down_votes":1,"body":"***","replies":[{"poster":"LegendaryXenon","date":"2017-01-17T05:11:28.689+0000","up_votes":2,"down_votes":2,"body":"10% ist totaler Blödsinn. Manchmal muss man halt selbst für die gute Stimmung sorgen und das Team als Vermittler carrien. Natürlich brauchst du dafür entsprechende stats und Einfluss, aber bei mir sind die games zu 75% sehr positiv.","replies":[{"poster":"Badboyrus","date":"2017-01-18T16:49:50.518+0000","up_votes":1,"down_votes":1,"body":"***","replies":[{"poster":"LegendaryXenon","date":"2017-01-18T21:10:47.243+0000","up_votes":1,"down_votes":0,"body":"Auch da sind 90% einfach sehr überzogen.","replies":[]}]}]}]},{"poster":"Neeko the Ekko","date":"2017-01-16T20:14:43.663+0000","up_votes":2,"down_votes":1,"body":"Willkommen in League of Legends. Aber selbst in dia wird geflammt ohne Ende. Gilt ausschließlich bis Master so. Glaube in challenger wird nicht mal geflucht, warum auch? Können ja nicht mehr aufsteigen und es gibt kein großen skill Unterschied. \n\nWer euch flamt, einfach nach dem game reporten. Früher oder später wird er schon aus dem Spiel genommen.","replies":[]},{"poster":"Chadono","date":"2017-01-17T14:13:05.195+0000","up_votes":1,"down_votes":0,"body":"Also wenn ich einen Spieler im Team hätte wie deinen Premade, dann würde legit davon ausgehen, dass er ein Troll ist, egal auf welcher Elo und ihn dafür reporten.\nExecutioners Calling {{item:3123}}  und Runans {{item:3085}}  auf Morgana? Und auch auf Sivir ist Executioners first komplett useless. \nIst doch nicht so schwer, stumpf die empfohlenen Items im Shop zu kaufen? Die sind zwar auch nicht immer perfekt, aber synergieren wenigstens mit dem jeweiligen Champ. Oder vor dem Spiel auf mobafire gehen und dort einen Build rausschreiben?\nOft genug geht dein Mate auch ohne Keystone-Mastery ins Game, zur Skill-Sequenz wurde hier ja schon was gesagt.\nAuch was Masteries und Skill-Reihenfolge angeht: Einfach vorm Spiel auf mobafire gehen und einen Guide dazu anschauen.\n\nAlso bitte - und das soll kein Flame sein- geh nicht mit deinem Premade nochmal ins Ranked, bevor ihr nicht wenigstens die kritisierten Punkte verbessert habt.\nKeiner erwartet von euch, dass ihr sofort die Spiele carried und 12/0 aus dem Game geht. Aber ihr solltet wenigstens durch eure Builds, Skills, Masteries und Summs  eure Teammates nicht aktiv vom Gewinnen abhalten.","replies":[]},{"poster":"Frankydude","date":"2017-01-17T14:08:34.968+0000","up_votes":1,"down_votes":0,"body":"Ich empfehle den \"Mute\" befehl wenn dir das zuviel wird . nicht auf ihr gemotze eingehen und sie rumspinnen lassen\nWer schreibt kann nicht spielen.\nUnd wenn sie merken dass keiner drauf reagiert, beruhigen sie sich auch schneller.\nUnd wenn sie eh schonm soweit sind nicht mehr mit dem flamen aufzuhören, dann brauchst du dich dadurch nicht schlecht fühlen.\nWobei wenn ich einen unranked im ladescreen seh freu ich mich weil des meistens smurfs sind und mir des leben erleichtern \n{{sticker:slayer-jinx-catface}}","replies":[]},{"poster":"Abasin","date":"2017-01-17T10:31:20.853+0000","up_votes":1,"down_votes":0,"body":"Ist leider bei vielen so, da muss man durch. Ich wurde in den Placements schon angemotzt, dass ich unranked sei, was ich bei eingerankten Spielern suche und ich mich gefälligst mit anderen unrankeds messen soll...soviel zum Informationsstand mancher Spieler, wie das mit den Placements so funktioniert. \nAber egal. Da wir mal davon ausgehen müssen, dass Flame nichts ungewöhnliches (leider) in LoL ist, ist die viel wichtigere Frage, wie man damit umgeht. Und diese Frage kannst Du Dir am Besten selbst beantworten. Ich halte es so, dass ich nicht patzig werde und am Ende alles was ich nicht vergessen habe, reporte.","replies":[]},{"poster":"Atsùra","date":"2017-01-16T21:24:01.123+0000","up_votes":1,"down_votes":0,"body":"Ranked ist halt nochmal ne etwas andere Schiene. Die Leute WOLLEN gewinnen. Natürlich kann man Pech haben und dann auf solche Idioten treffen, die sich dann nur aufregen und sich selbst tilten. Gibt aber auch andere Leute, glaub mir :) Hab letztens ausversehen ein Ranked game gemacht und hab einfach gepickt, was mir Spaß macht und worauf ich grad Bock hatte. Natürlich gab ich mir Mühe. Verloren haben wir trotzdem. Und meine Mates in diesem Spiel waren dermassen gechillt. Mach ruhig mit den Ranked games weiter und lass dich von solchen Leuten nicht unterkriegen^^","replies":[]},{"poster":"Angel Ayume","date":"2017-01-16T20:57:45.501+0000","up_votes":1,"down_votes":0,"body":"Ihr solltet sowas instant muten und wenn du sie nicht muten willst, auf gar keinen Fall drauf eingehen. Einfach gar nichts schreiben. Einige sparen sich dann die Mühe etwas zu schreiben wenn eh nicht reagiert wird. Zudem, wenn du antwortest, dann wird das Geschrei nur noch schlimmer. Und noch einen Tipp: Deaktivier den AllChat. Habe ich auch, weil mich das Geschreibsel der Gegner oft tiltet. Die Gegner haben eh nie was gutes zu sagen. Entweder sie lachen dich aus, weil du den Fight verloren hast oder sie beschimpfen dich, weil du den Fight verloren hast ODER sie beschimpfen dich, weil du den Fight gewonnen hast. \n\nDenke auch nicht, dass jedes Game im Ranked so abläuft. Ich habe schon viele viele Rankedspiele gespielt und viele davon liefen ohne Flame oder so ab. Und selbst wenn mal einer flamet mute ich sie direkt, damit ich mich auf das Spiel konzentrieren kann.\n\nVertrau mir, diese Leute zu muten ist wesentlich besser. Du kannst dich voll auf das Game konzentrieren. Und im Ranked willst du doch gewinnen, also solltest du das tun, was dir dabei verhilft, dich besser zu konzentrieren.\nVllt auch leise Musik im Hintergrund laufen lassen; das hilft mir immer, damit ich nicht so schnell tilte oder gar nicht tilte. \n\nSchwarze Schafe gibt es immer in LoL; aber die Mehrheit der Spieler ist nicht toxisch. Selbst wenn du in mehreren Spielen hintereinander jemanden im Team hast der flamet, dann hast du dafür aber 3 andere die dies eben nicht getan haben, deswegen überwiegt die Mehrheit der nicht flamenden Spieler. \n\nFlamer werden bestraft wenn sie dies immer wieder tun, du musst sie nur reporten, damit sie auch irgendwann dafür bestraft werden. \n\n\nWenn du wirklich wissen willst, auf welchem Niveau du spielst musst du wohl oder übel viele Ranked spielen, denn die 10 Placementgames sagen nicht aus, wo du tatsächlich hingehörst. \nBeispiel: Mein Bruder ist beim ersten Mal einranken Gold 3 gekommen, er ist innerhalb kürzester Zeit nach Gold 5 gedroppt. In seiner 2. Season hat er es mit Müh und Not und vielen vielen vielen vielen Ranked Games \"grade mal\" bis Silber 2 geschafft. \nWas ich damit sagen will, jeder Neuanfänger hat eine Silber-MMR, weswegen du natürlich höher eingeranked wirst als du eigentlich bist. Es sei denn deine Placementgames laufen so schlecht dass du dadurch Silber5 oder gar Bronze kommst.\n\nDa ich weiß, dass ihr beide noch nicht lange spielt empfehle ich euch folgendes: Spielt erstmal weiter Normals um eure Fertigkeiten zu verbessern, am Ende der Season macht ihr eure 10 Placementgames für die Seasonbelohnung (evtl. Silberahmen und Summoner-Icon) und dann startet mit Season 8 voll durch. Bis dahin habt ihr einiges an Erfahrung gesammelt, dass ihr erfolgreicher im Ranked seid. \nWenn ihr dennoch Rankederfahrung sammeln wollt, spielt einfach zusammen FlexQ. Die FlexQ ist nicht so interessant wie die Solo/DuoQ. Ich sehe die FlexQ eher als Normal mit bisschen mehr Tryhard. :D \n\nViel Erfolg trotzdem weiterhin. :)\n\nWenn noch Fragen sind: Du hast mich ja in der Freundesliste. ;) {{sticker:slayer-jinx-catface}}","replies":[]}]}