{"poster":"Queen Noth","date":"2016-11-30T09:37:14.669+0000","title":"Wurde so stark geflamt, dass ich leaven musste - Lol macht kaum noch Spaß :(","subforum":"Spielerverhalten & Moderation","up_votes":7,"down_votes":13,"body":"Hallo... im vorletzten Match war ich jungler kha und wurde stark von top und mid angegriffen, dass ich so schei&szlig;e bin, useless bin, sich &uuml;ber meine Dummheit lustig machten.... ich hatte dann kaum noch motivation mehr irgendetwas zu schaffen und da weiter auf mir rumgehackt wurde, wurde es mir zu viel und ich bin geleavt. In Draftpick hab ich ausschlie&szlig;lich nur noch Flamer und tosischer die mich beschimpfen, als useless bezeichnen und meinen ich soll afk gehen. Die freundesliste ist meist deko f&uuml;r mich, da von 100 leuten meist nur 9 on sind und wenn ich ihnen ne einleidung schicke, nehmen sie kaum an, weshalb ich immer alleine spielen muss. Es ist mir momentan unm&ouml;glich die Tipps von letzten Mal umzusetzen, bin schon in Championselect mega angespannt, da ich wei&szlig; &quot;Wenn ich mehr als 3 kills einstecke, werde ich fertig gemacht &gt;w&lt;&quot; Unfair war zum beispiel, dass der toplaner behauptete ich w&uuml;rde garnicht ganken, obwohl ich zun&auml;chst die botlane unterst&uuml;tzte und garnicht auf zwei orten gleichzeitig kann. Dann hat mich der midlaner beschimpft, weil ich, nachdem er mich eigentlich vor nen gegner rettete ich ihn nicht rettete. Er meinte ich w&auml;r dumm und wird mir nie wieder helfen. (Ja wie den bitte sch&ouml;n, wenn ich selbst 10 HP hatte? .-.)\r\n\r\nDer einzige Grund warum ch dann das Spiel mit chogath spielte, war weil ein englischer Kumpel mich dazu &uuml;berredete mit ihn und anderen auf TS zu kommen und mit denen zu spielen. Hatte ihn von den Vorfall erz&auml;hl. Zwar lief das Match wesentlich besser, doch das ist f&uuml;r mich an sich ein schwacher Trost. Ein All Mute bringt mir nichts, da ich eigentlich sehr sozial bin und gern kommuniziere, um fragen zu stellen oder gegebenenfalls selbst zu helfen so weit ich kann.\r\n\r\nBin ich die einzige die damit zu k&auml;mpfen hat? Dieser Vorfall hatte f&uuml;r mich ein neues Level der Toxic erreicht...","replies":[{"poster":"stoitzii","date":"2016-11-30T09:42:29.429+0000","up_votes":3,"down_votes":2,"body":"Naja, Toxic Community is inzwischen nichts neues. Bedenk einfach dass es wohl meistens garnicht an dir liegt, dass sie flamen, meist machen andere selbst Fehler, sind unachtsam oder sonst was, und lassen dann eben ihren Frust ( meist sogar) beim Jungler aus oder am supp ( der meist ich bin). Einfach drüber stehen, weiterspielen, und am Ende reporten, früher oder spieler bekommt jeder was er verdient. Aber aufjedenfall solltest du dich davon nich runterziehen lassen, das beeinflusst nur dein Spiel, den Spaß etc. Kopf hoch, bin gern ma bereit fürn game wenn Lust und Laune hast die tage etc, aber wie gesagt, bin main supp spieler^^\nGrüße, Gl hf","replies":[{"poster":"Queen Noth","date":"2016-11-30T09:46:14.161+0000","up_votes":3,"down_votes":5,"body":"Ist schwer, da ich aufgrund meiner Depression sehr vieles persönlich nehme und da ich jetzt so viele Flamer habe denke ich halt \"Ich schaff nicht mal ein Videospiel, ich bin echt ein Looser\" :(","replies":[{"poster":"RAG Ryve","date":"2016-11-30T13:54:03.827+0000","up_votes":7,"down_votes":0,"body":"Is nicht böse gemeint aber komm mir nicht damit. Ich leide an der Borderline Störung und rede mir trotzdem nicht ein das ich die Leute nicht muten kann weil ich so sozial bin und das es mich so sehr verletzt was sie mir sagen. Dir sollte durchaus klar sein das die anderen Müll reden wenn sie dich beleidigen, falls dies nicht der Fall ist solltest du dir das bald klar machen.\n\n1. Fehler: Adde nicht permanent irgendwelche Leute mit denen du 1 Spiel gemacht hast, das bringt dir garnichts. Ich habe in meiner Freundesliste auch nur 7 Leute und das nach 4 Jahren weil ich mir nen festen Kreis gesucht habe mit dem ich spiele und die spielern gern mit mir.\n\n2. Fehler: Wenn dir die Mute Funktion nicht zusagt weil du gerne kommunizierst dann such dir 1 oder mehrere Premades und die Randoms mutest du. Ich bin ebenfalls ein sehr sozialer Mensch und spiele eigentlich ungern alleine aber wenn ich es trotzdem muss dann höre ich Musik und/oder schreibe solange mit den Leuten IG bis die erste Beleidigung kommt, dann sind sie gemutet. \n\nUnd jetzt mal ganz ehrlich, du bist nicht der einzige mit einer Depressionen bzw Krankheit generell. Wenn dir das Spiel so zu schaffen macht bist du hier eindeutig falsch. Die LoL Community gehört leider zu den ungemütlichsten das lässt sich nicht abstreiten, da schlage ich dir dann vor das du dir vlt ein anderes Spiel suchst wie WoW wo die Leute, aus meiner eigenen Erfahrung von über 2 Jahren, nicht so toxisch sind.","replies":[]},{"poster":"eingew","date":"2016-11-30T10:05:30.897+0000","up_votes":6,"down_votes":1,"body":"Erstens: Du misst dich hier mit Menschen, es ist also kein \"nur ein Computerspiel\". Ich meine... wenn du im Schach verlierst, bist du dann \"zu blöd für Schach?\" Oder liegt es nicht eher einfach daran, dass dir der Gegner überlegen war? Was ja nichts mit Dummheit zu tun hat. Irgendjemand ist schließlich *immer* besser als man selbst. Außer du bist rein zufällig der Mensch, der auf diesem Gebiet die beste Leistung abgibt... und das ist nunmal ziemlich unwahrscheinlich für jeden von uns ;)\n\nZweitens: Das Matchmaking arbeitet sogar darauf hin, dass du verlierst. Es matcht dich nur gegen solche Spieler, die dir *ebenbürtig* sind. Und wenn dir jemand ebenbürtig ist, dann ist es völlig logisch, dass du circa 50% deiner Spiele verlierst. Das hat also nichts damit zu tun, wie gut oder schlecht du bist, sondern damit, dass du hier nur gegen Leute spielst, die auch eine Chance gegen dich haben.\n\nZuletzt möchte ich dir empfehlen, einer Community beizutreten oder anderweitig einen mehr oder weniger festen Pool an Premades zu sammeln. Freundliche Mitspieler sind für dich offensichtlich wichtig. Neben den Angeboten, die sich hier schon gefunden haben, gefällt dir vielleicht auch die [Liga der Gentlemen](http://boards.euw.leagueoflegends.com/de/c/clans-teams-de/XZilr2EV-zocken-ohne-flamer-die-liga-der-gentlemen), eine Gruppe von Spielern, die sich extra dafür gefunden hat, um freundliches Verhalten in League besser zu etablieren.","replies":[]},{"poster":"Alekra","date":"2016-11-30T09:48:04.671+0000","up_votes":3,"down_votes":0,"body":"Ach was es liegt nicht an dir :) Das sind nur ein paar Kinder denen Langweilig ist ^.^ Mute die einfach, mach dir gute Musik an und alles wird leichter :P Aber bitte sei nicht traurig wegen sowas :3 Wenn du willst, kannst und mich ja mal Adden :P","replies":[{"poster":"Queen Noth","date":"2016-11-30T09:49:35.807+0000","up_votes":2,"down_votes":3,"body":"Also... führt kein Weg an Allmute vorbei? :/ schade... dabei mochte ich es zu der Zeiten, wo ich nicht solche sachen mir anhören musste sehr in den Chat zu schreiben, überlegungen anzustellen, vorschläge zu geben usw.","replies":[{"poster":"CYPHΕR","date":"2016-11-30T10:15:43.169+0000","up_votes":3,"down_votes":0,"body":"Niemand redet von /mute all.\n\nWenn jemand flamed einfach** dann** direkt muten und später reporten.","replies":[]},{"poster":"Alustus100","date":"2016-11-30T10:40:55.073+0000","up_votes":2,"down_votes":0,"body":"Wie gesagt musst du ja nicht alle muten,  außerdem kannst du weiterhin Vorschläge schreiben,  auch wenn du dann keine Antworten siehst.\n\nDas schlechteste was du machen kannst ist zu leaven, da du selbst nicht Reporter kannst und gegen die Regeln verstößt.","replies":[]}]}]},{"poster":"DrAnnoying","date":"2016-11-30T14:17:26.552+0000","up_votes":2,"down_votes":2,"body":"Wenn du depressiv bist solltest du kein League zocken, sondern dich um dein Problem kümmern.\nAm besten bei einem Psychologen.","replies":[{"poster":"eingew","date":"2016-11-30T16:38:34.135+0000","up_votes":1,"down_votes":0,"body":"Wenn du ein (größeres) Problem hast, arbeitest du dann die gesamte Zeit, die du hast, *ausschließlich* an der Lösung desselben?\n\nDas ist lobenswert, aber keine übliche Taktik, nicht nur, weil sie durchaus auch ineffizient sein kann.","replies":[{"poster":"DrAnnoying","date":"2016-11-30T17:04:22.063+0000","up_votes":1,"down_votes":0,"body":"Nein aber ich lerne damit umzugehen ohne mein Umfeld darunter leiden zu lassen.\n\nLetztendlich bist du selber der gears*hte ... auch vom System her wenn du ein Spiel verlässt weil du auf flamer nicht klar kommst.\n\nBis dahin einfach Games zu leaven wenns einem nicht passt ist meiner Meinung nach grenzwertig.\nZumal ich auch bezweifle dass der TE wirklich depri ist, ich hatte genug mit solchen Menschen in meinem Umfeld und auch selber damit zu tun und ich hatte es bei niemanden dass derjenige explizit gesagt hat er wäre depressiv.\nWenn ich mich irre, sorry aber das ist meine Wahrnehmung.","replies":[{"poster":"eingew","date":"2016-11-30T17:35:52.325+0000","up_votes":1,"down_votes":0,"body":"Würde dir völlig zustimmen.\n\nOb man jetzt von sich sagt, dass man Depressiv ist, oder nicht... ich weiß nicht, ob da alle immer für sich behalten. Viele sicherlich, aber Menschen sagen ständig irgendetwas davon, wie sie sind. Nicht alles davon ist realistisch, aber die meisten malen gerne mit Worten ein Bild von sich, wie andere sie wahrnehmen sollen. Dass jemand sich mit dem Bekennen zur Depression in eine Ecke rückt finde ich gar nicht mal so abwegig.","replies":[]}]}]}]}]},{"poster":"Queen Noth","date":"2016-11-30T09:50:40.286+0000","up_votes":2,"down_votes":1,"body":"Bin Main Support Tank und Main Jungler also ist ok... hab vielleicht heute nachmittag, spätestestens freitag zeit....","replies":[]}]},{"poster":"OniOxe","date":"2016-11-30T09:42:42.094+0000","up_votes":2,"down_votes":1,"body":"***","replies":[{"poster":"Queen Noth","date":"2016-11-30T09:47:39.972+0000","up_votes":5,"down_votes":4,"body":"Glaub mir, ich leave nicht gern. Zudem war es das erste mal, dass ein Spiel für mich so untragbar war, das ich nicht mehr wollte. Und dauermuten mag ich nicht. Gründe habe ich ja gennannt. Und wenn du so selbstbewusst bist, schön für dich... andere können es nicht.","replies":[{"poster":"OniOxe","date":"2016-11-30T09:51:52.843+0000","up_votes":3,"down_votes":9,"body":"Tja, dann leave mal weiter, wie gesagt - hoffe du wurdest & wirst in Zukunft weiterhin bestraft werden, am besten mal nen schönen 14Tage Bann, gibt nichts schlimmeres als Leaver / Afk'ler - spiel kein Game wenn dus nicht erträgst. Gibt inzwischen genug Möglichkeiten ohne Chat zu kommunizieren.","replies":[{"poster":"Queen Noth","date":"2016-11-30T09:53:13.996+0000","up_votes":4,"down_votes":6,"body":"Super, ich werde also in Forum noch mal runter gemacht...","replies":[{"poster":"eingew","date":"2016-11-30T09:57:21.985+0000","up_votes":3,"down_votes":0,"body":"Nun, du musst verstehen, Leaven wird für viele ähnlich empfunden, wie du den Flame im Spiel oben empfunden hast. Es macht einfach deutlich weniger Spaß für beide Teams. Warum hast du die entsprechenden Spieler nicht einfach gemutet? Ich verstehe ja, dass du nicht alle muten willst, mir missfällt das eigentlich auch, aber was spricht dagegen, nur die zu nehmen, die sich daneben benehmen?","replies":[{"poster":"Queen Noth","date":"2016-11-30T10:00:27.137+0000","up_votes":3,"down_votes":2,"body":"Weil es zu viel für mich war und da ich am ende so demotiviert war, dass umso mehr nix klappte, sah ich kein sinn mehr in diesen spiel. Wozu sollte ich mir Mühe geben, wenn ich eh für alle scheiße und wertlos bin? war mein Gedanke und musste mich beruhigen.","replies":[{"poster":"eingew","date":"2016-11-30T10:10:55.004+0000","up_votes":3,"down_votes":0,"body":"Es ist definitiv sinnvoller, die eigene psychische Gesundheit über das Spiel zu stellen. Ich würde daher sagen, dass du das auch in Zukunft so halten solltest. Aber du musst dir zugleich auch Taktiken überlegen, besser mit dem Flame umzugehen, denn auf Dauer kannst du fürs Leaven durchaus auch Strafen erhalten. Zuerst eine Low Priority Queue, womit du vor jedem Match zusätzlich 5/10/20 Minuten warten musst... und irgendwann später, wenn du es übertreiben solltest, auch bis zu permanenten Bans.","replies":[]},{"poster":"CYPHΕR","date":"2016-11-30T10:13:59.642+0000","up_votes":3,"down_votes":1,"body":"Beantwortet die Frage ja nicht: Wieso hast du sie nicht einfach direkt gemutet?\n\nDie Motivation ging ja nur verloren weil du sie eben nicht gemutet hast.\n\nDas Problem ist halt, dass du dich mit einem Leave auch nicht gerade besser verhältst.","replies":[]}]},{"poster":"OniOxe","date":"2016-11-30T10:45:33.573+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=eingew,realm=EUW,application-id=KYnfKGf0,discussion-id=HcOtR2vm,comment-id=00010000000000000000,timestamp=2016-11-30T09:57:21.985+0000)\n>\n> Nun, du musst verstehen, Leaven wird für viele ähnlich empfunden, wie du den Flame im Spiel oben empfunden hast. Es macht einfach deutlich weniger Spaß für beide Teams. Warum hast du die entsprechenden Spieler nicht einfach gemutet? Ich verstehe ja, dass du nicht alle muten willst, mir missfällt das eigentlich auch, aber was spricht dagegen, nur die zu nehmen, die sich daneben benehmen?\n\n\"ähnlich\" - Leaver sind neben intenional Feeding Scrubs das schlimmste was es in diesem Spiel gibt ;).","replies":[{"poster":"Mi3zekatze","date":"2016-11-30T12:12:02.852+0000","up_votes":2,"down_votes":8,"body":"Ich mag feeder lieber als AFKler...","replies":[{"poster":"Pure Cynicism","date":"2016-11-30T12:58:15.758+0000","up_votes":7,"down_votes":2,"body":"> [{quoted}](name=xtaktiq,realm=EUW,application-id=KYnfKGf0,discussion-id=HcOtR2vm,comment-id=0001000000000000000000010000,timestamp=2016-11-30T12:12:02.852+0000)\n>\n> Ich mag feeder lieber als AFKler...\n\nKann ich verstehen, bei über 8 Toden im Schnitt pro Spiel gehörst du ja offensichtlich selbst zu dieser Kategorie.","replies":[]}]}]}]}]},{"poster":"Mi3zekatze","date":"2016-11-30T12:07:46.310+0000","up_votes":2,"down_votes":8,"body":"Stimme dir zu lieber 4 Flamer als 1  Afkler!!!! Die sind ätzender als Flamee","replies":[{"poster":"Haudruppmoor","date":"2016-11-30T12:59:07.740+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=xtaktiq,realm=EUW,application-id=KYnfKGf0,discussion-id=HcOtR2vm,comment-id=0001000000000001,timestamp=2016-11-30T12:07:46.310+0000)\n>\n> Stimme dir zu lieber 4 Flamer als 1  Afkler!!!! Die sind ätzender als Flamee\n\nIch weiß nicht, aber jemand der nen 14 Tage Bann wegen Flamen kassiert hat sollte besser keine Tipps oder Lebensweisheiten in dieser Richtung von sich geben. \n\nIch frag ja auch nicht jmnd. um Rat beim Autofahren , wenn derjenige schon 3 Autos verschuldet zu Schrott gefahren hat ^^","replies":[{"poster":"Mi3zekatze","date":"2016-11-30T17:59:34.122+0000","up_votes":1,"down_votes":3,"body":"Ja da hast du recht \n\nAber ich kann es nur zum xmal sagen ich habe aufgehörr zu flamen! Ich habe verstanden das es komplett sinnlos ist und einfach nur unnötig! Wieso ich das jtz erst checke? Ka ich weiß auch nicht was mich dazu bewogen hat als 0/10 jdm zu beleidigen wenn er nicht smiten kann. Im Endeffekt wirst du in meinen letzten 50 Games KEINE einzige Beleidigung finden (nichtmal ein Idiot) und nur sehr selten sowas wie: Omg play safe now pls :) \nUnd ich habe es verstanden liebe community!","replies":[{"poster":"Mi3zekatze","date":"2016-11-30T18:04:08.989+0000","up_votes":1,"down_votes":3,"body":"Und langsam stört es mich das ausnahmslos alle Kommentare von mir gedown votet werden weil ich einmal fallen lassen habe das ich einen bann hatte! Das ich  nicht mehr flame und einsichtig geworden bin interessiert keinen! Und dafür das ich meine Meinung hier im Forum offen sage werde ich gedownvotet! \nUnd diese leute denken dann: blöde community wenn sie alles downvoten und nie was positives hinterlassen... :(","replies":[{"poster":"Wernicke","date":"2016-12-01T04:45:00.945+0000","up_votes":2,"down_votes":0,"body":"Es ist wohl eher wegen deiner allgegenwärtigen Schreibweise in dem ein oder anderen thread... Du solltest vlt mal an deiner Wahrnehung arbeiten, wenn du wirklich glaubst das von dir genannte allein wäre der Grund ^^","replies":[]},{"poster":"Haudruppmoor","date":"2016-11-30T23:19:52.688+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=xtaktiq,realm=EUW,application-id=KYnfKGf0,discussion-id=HcOtR2vm,comment-id=0001000000000001000000010000,timestamp=2016-11-30T18:04:08.989+0000)\n>\n> Und langsam stört es mich das ausnahmslos alle Kommentare von mir gedown votet werden weil ich einmal fallen lassen habe das ich einen bann hatte! \n\nIch glaube nicht, daß es deswegen war, eher wegen so Bemerkungen wie z.B. :\n\n> [{quoted}](name=xtaktiq,realm=EUW,application-id=KYnfKGf0,discussion-id=HcOtR2vm,comment-id=0001000000000000000000000002,timestamp=2016-11-30T12:10:24.038+0000)\n>\n> Lul du denkst das du nutzlos bist? Am ende bist du ein besserer Minion\n\njmnd. als besseren Minion zu bezeichnen ist schon arg daneben , oder\n\n> [{quoted}](name=xtaktiq,realm=EUW,application-id=KYnfKGf0,discussion-id=HcOtR2vm,comment-id=0006,timestamp=2016-11-30T12:03:49.903+0000)\n>\n> NIEMAND wird gezwungen zu leaven!! Das sind kleine rage kidies die dich da beleidigen und dich juckt das????? Du solltest weiter spielen und dich nicht hier ausheulen :( \n> Übrigens werden nur Feeder geflamet ...\n\nGerade der letzte Satz ist übel. Damit suggerierst Du, das Flamer quasi Opfer von Feeder sind, also wenn geflamt wird ist nicht der Flamer schuld sondern der Feeder ^^\n\nusw. Es ist einfach Deine Argumentationsweise, die ein bischen ... naja ist. Ist jetzt meine Meinung dazu wobei ich gestehen muß, daß ich Dich nur hier\n\n> [{quoted}](name=xtaktiq,realm=EUW,application-id=KYnfKGf0,discussion-id=HcOtR2vm,comment-id=0001000000000001,timestamp=2016-11-30T12:07:46.310+0000)\n>\n> Stimme dir zu lieber 4 Flamer als 1  Afkler!!!! Die sind ätzender als Flamee\n\ngedownvotet hab. Mit 4 Flamern verkackst Du mit Sicherheit das Spiel. Ein 4vs5 kann man noch gewinnen, bzw. hab ich schon gewonnen. Wenn bei mir Flamer drin waren hab ich nie gewonnen.\n\nWenn Du jetzt aufgehört hast mit Flamen ist das doch gut für Dich. Nach dem 14TageBan auch nur die einzigste Möglichkeit Deinen Acc zu behalten. In einem halben Jahr würd ich da gern mal wieder nachhaken ;)\n\n\nmfg\nMB","replies":[]}]}]},{"poster":"Atsùra","date":"2016-11-30T16:43:51.214+0000","up_votes":2,"down_votes":1,"body":"xd","replies":[]}]}]}]}]}]},{"poster":"Ronin Tamos","date":"2016-11-30T09:49:12.041+0000","up_votes":3,"down_votes":0,"body":"1. Nein bist du nicht. Ich glaube es gibt keinen Spieler in Lol der noch nicht in irgendeiner Form geflamed wurde / Flame gegenüber anderen erlebt hat. \n\n2. Deine Position in diesem Spiel das beschrieben wurde = Jgl, ist eine der undankbarsten des gesamten Spiels. Läuft eine Lane nicht, dann ist nicht man selber schuld weil man zu sehr pusht, schlechter ist, nicht warded sondern immer der Jungler. Einer der Gründe warum es die Rolle ist die ich am wenigsten Spiele. \n\n3. Es gibt immer wen der meckert. Die Leute neigen dazu sich gerne im Mittelpunkt des Universums zu wähnen und damit von dir priorisiert zu werden was Ganks / Hilfe angeht. Die anderen Lanes zählen für Sie nicht, nur die eigene KD ist wichtig. \n\n4. Vielleicht solltest du schauen ob jemand in deinem Freundeskreis League anfangen will. Dann hast du es leichter mit denen Flame zu ertragen. Ansonsten gibt es in der Community durchaus und unglaublicherweise auch nette Leute die gerne Casual mal spielen. Man muss sie nur finden. \n\n5. Wenn dieses Spiel für dich nicht mehr spielbar ist aufgrund des hin und wieder extremen Flames durch andere Mitspieler, hör auf. Es hat keinen Sinn sich weiter damit rum zu ärgern. Bestimmte Menschen ändern sich nicht und das einzige was man machen kann ist dafür zu sorgen dass sie gebant werden.\n\n6. Denk über einen Rollenwechsel nach. Andere Lanes haben es ruhiger. Zwar auch eigene Probleme aber weniger Aufmerksamkeit durch das Team.","replies":[{"poster":"Queen Noth","date":"2016-11-30T09:58:12.341+0000","up_votes":3,"down_votes":3,"body":"Also zu Rollenwechsel wüsste ich nicht was passendes. ich hatte mich damals für Supp und Jungl entschieden aus folgenden Gründen: Bei Jungle mochte ich die flexibelität, dass man sich zwischen den Lanes bewegt und nicht in einer Position verhaart und zur Not einen Teamkameraden unterstützt und sich relativ leichter zurückziehen kann, als auf der bloßen lane. Supp sehe ich auch als wichtige unterstützende rolle, besonders weil ich chogath ein guter tanksupport den adc und andere beschützen kann in guten Runden. Hab früher viel Mid probiert, aber da war ich bisher immer am schlechtesten von den werten her. wie es top ist weiß ich ehrlich gesagt nicht mehr, müsste wieder da versuchen...","replies":[{"poster":"Ronin Tamos","date":"2016-11-30T10:16:18.518+0000","up_votes":1,"down_votes":0,"body":"- Natürlich ist Jungle an sich eine schöne Rolle, viel Roamen etc. Aber viele Mitspieler verwechseln \"Helfen\"  mit \"Babysitten\" Du solltest Ihnen nicht dauernd den Hintern nach tragen sondern sie müssen auch mal selbst klar kommen ansonsten werden sie ja nie besser. Jgl ist schließlich nicht nur helfen sondern auch Druck machen, Drake, Herold, Baron, Pushen, Mind Games. \n- Support hat eine Menge Champions zu bieten und Cho Gath ist zwar sicher ein interessanter Pick aber vielleicht solltest du deinen Horizont gegenüber anderen Champions öffnen. Tham Kench, Thresh, Alistar, Leona sind alles gute Tank Supports die dem schlechten Adc auch so den Hintern retten können. Außerdem sind Supports auch relativ viel unterwegs sobald man ein bestimmtes Niveau erreicht hat und vollziehen Ganks etc. \n- Top lane Cho Gath ist auf jeden Fall eine Überlegung wert und mit TP kannst du ne menge helfen. Dominiere die Lane -> gehe Roamen.","replies":[{"poster":"Queen Noth","date":"2016-11-30T10:21:46.083+0000","up_votes":3,"down_votes":2,"body":"> [{quoted}](name=Ronin Tamos,realm=EUW,application-id=KYnfKGf0,discussion-id=HcOtR2vm,comment-id=000200000000,timestamp=2016-11-30T10:16:18.518+0000)\n>\n> - Natürlich ist Jungle an sich eine schöne Rolle, viel Roamen etc. Aber viele Mitspieler verwechseln &quot;Helfen&quot;  mit &quot;Babysitten&quot; Du solltest Ihnen nicht dauernd den Hintern nach tragen sondern sie müssen auch mal selbst klar kommen ansonsten werden sie ja nie besser. Jgl ist schließlich nicht nur helfen sondern auch Druck machen, Drake, Herold, Baron, Pushen, Mind Games. \n> - Support hat eine Menge Champions zu bieten und Cho Gath ist zwar sicher ein interessanter Pick aber vielleicht solltest du deinen Horizont gegenüber anderen Champions öffnen. Tham Kench, Thresh, Alistar, Leona sind alles gute Tank Supports die dem schlechten Adc auch so den Hintern retten können. Außerdem sind Supports auch relativ viel unterwegs sobald man ein bestimmtes Niveau erreicht hat und vollziehen Ganks etc. \n> - Top lane Cho Gath ist auf jeden Fall eine Überlegung wert und mit TP kannst du ne menge helfen. Dominiere die Lane -&gt; gehe Roamen.\n\n- das ist wahr....\n\n- ich will tatsächlich bei support mir noch nen champ zulegen. Ich find persönlich Thresh am interessantes, doch ich kann nicht abschätzen wie schwer/leicht die mechanik ist. Was empfiehlst du mir?\n\n- Top Chogath? Oki, dann wird er auch da aufkreuzen, danke <3","replies":[{"poster":"Ronin Tamos","date":"2016-11-30T10:36:10.276+0000","up_votes":1,"down_votes":0,"body":"Also bezüglich Thresh: Er ist nicht unbedingt kompliziert aka wie schwer ist ein Hook aber er bietet eine Menge Spieltiefe und Mechaniken, die einen teilweise am Anfang schwer fallen können. \nWenn du wirklich einen Grab / Hook Champ spielen willst, nimm Blitzcrank oder wenn es ein bisschen Tankiger sein soll Nautilus. Letzter hat besonders bei Teamfighting ne menge Potenzial und kann mit seiner Ultimate so manches Spiel rumreißen.\nUnd lass dich nicht entmutigen sollte es mal Probleme geben. Manche Mitspieler sind einfach die Hölle und mancher Gegner einfach zu gut. Besonders Cho Gath Top lane hat durchaus Match ups die es in sich haben. \n\n\nEdit: Verstehe auch nicht die ganzen Downvotes bei deinen Kommentaren … manche Leute können halt nicht andere Meinungen ab.","replies":[]},{"poster":"Mi3zekatze","date":"2016-11-30T12:06:40.616+0000","up_votes":2,"down_votes":11,"body":"Ehm Chogath ist eig. Kein Supporter... sondern toplanee oder manchmal Jungler ...\nBist du schon lvl 30??","replies":[{"poster":"eingew","date":"2016-11-30T16:43:53.482+0000","up_votes":1,"down_votes":0,"body":"Die Meta entsteht aus den angewandten Taktiken, nicht andersherum... Cho'gath Support ist unüblich, aber keinesfalls unmöglich.","replies":[{"poster":"Mi3zekatze","date":"2016-11-30T17:50:50.797+0000","up_votes":2,"down_votes":4,"body":"Habe ich ja nicht gesagt das es Null geht aber er ist nicht als Support geplant und deswegen für diese rolle eher ungeeignet","replies":[{"poster":"Wernicke","date":"2016-12-01T04:46:29.316+0000","up_votes":1,"down_votes":0,"body":"Blitz war meines Wissens nach auch nicht als Supp geplant, sondern als Toplaner. Und nun?","replies":[]},{"poster":"eingew","date":"2016-11-30T18:03:39.761+0000","up_votes":1,"down_votes":1,"body":"Lulu ist wohl eines der besten Beispiele, für Champions, die gerne in anderen Positionen genutzt werden, als denen, in denen sie ursprünglich geplant waren. Wichtig ist nicht, wie ein Champion gedacht ist, sondern wie man ihn effektiv nutzen kann.","replies":[]}]}]}]}]}]}]}]},{"poster":"DrAnnoying","date":"2016-11-30T14:20:10.708+0000","up_votes":2,"down_votes":0,"body":"Nichts für ungut, ehrlich\nAber Spieler die so sensibel auf flame reagieren und es nicht schaffen zu muten haben in online Teamgames nichts zu suchen, das ist überall das selbe ..\nKann ich aus langjähriger Erfahrung bezeugen.\n\nEinfach nicht ernst nehmen solche Leute, muten und reporten und keine Gedanken mehr verschwenden.\nSonst fcukst du dich nur drüber ab wieso derjenige noch nicht gebannt wurde oder sowas.","replies":[{"poster":"Mi3zekatze","date":"2016-11-30T17:49:02.255+0000","up_votes":1,"down_votes":3,"body":"Genau das habe ich unten geschrieben und wurde dafür geflamt holy what??\nBin ganz bei dir","replies":[{"poster":"eingew","date":"2016-11-30T18:04:40.144+0000","up_votes":3,"down_votes":0,"body":"Du drückst dich nun mal völlig anders aus.","replies":[{"poster":"Mi3zekatze","date":"2016-12-01T17:22:30.150+0000","up_votes":1,"down_votes":1,"body":"Du willst wirklich alles kommentieren nciht?","replies":[{"poster":"Haudruppmoor","date":"2016-12-02T07:05:05.198+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=xtaktiq,realm=EUW,application-id=KYnfKGf0,discussion-id=HcOtR2vm,comment-id=0009000000000000,timestamp=2016-12-01T17:22:30.150+0000)\n>\n> Du willst wirklich alles kommentieren nciht?\n\nUnd Du willst immer das letzte Wort haben {{sticker:slayer-jinx-wink}}\n\nBeruhig Dich doch ma wieder, hier\n\nhttp://m.memegen.com/wl04uq.jpg","replies":[]}]}]}]}]},{"poster":"Kibek","date":"2016-12-01T06:34:33.683+0000","up_votes":2,"down_votes":0,"body":"Also habe mir nicht alles durchgelesen auch nicht die kommentare aber nach dem dich jemand anfängt zu flamen hast do folgene möglichkeiten\n\nihn ignorieren bzw muten =schlaue entscheidung\n\nIhn sagen lassen was er will nicht antworten ist manchmal lustig was für müll die leute schreiben wenn es um flamen geht nur wegen einem game für dich wohl nicht geeignet.\n\nzurück flamen,briengt eig garnichts \n\nalso mal ganz ehrlich überall fiendest du idioten ob nun im spiel oder im rl,wenn dich jemand auf offener straße anschreit den du nicht mal kennst bleibst du auch nicht stehen und lässt dich fertig machen ,selbe prinzip im spiel mute einfach,komm nicht mit der ausrede ich bin sozial etc und mag nicht muten!\n\nwenn es dir zu nah geht ist es die einzigste möglichkeit,nicht im jedem spiel flamt dich das ganze team wohl er in den seltensten.\n\nflamer sidn idioten denen du nicht mal aufmerksamkeit schenken solltest!\n.\naber bedenke eine sache afkler sind die schlimmsten","replies":[{"poster":"CooL Ice Tea","date":"2016-12-05T07:55:58.279+0000","up_votes":1,"down_votes":0,"body":"Liest nicht alles im OP, schreibt selber eine Litanei.\n\nPS: Ich hab mir nicht alles von deinem Post durchgelesen. ;)","replies":[]}]},{"poster":"Pure Cynicism","date":"2016-11-30T21:34:52.128+0000","up_votes":1,"down_votes":0,"body":"Ich führe so aus Interesse seit einiger Zeit eine Excel-Tabelle, in der ich nach jedem Game fix Flamer protokolliere. Aktuell habe ich insgesamt in mehr als jedem 2. Spiel Flamer.","replies":[{"poster":"Wernicke","date":"2016-12-01T04:49:09.129+0000","up_votes":2,"down_votes":0,"body":"Habe ich auch gemacht, da einige hier im forum ständig behaupten sie hätten kaum flamer usw. Ich dachte dann ich habe vlt eine subjektive Wahrnehmung. Habe alles dokumentiert und hatte im Schnitt in jedem 2. Spiel geflame und gezicke, troll oder afk. Traurig, aber leider wahr. Von daher ist das nur Schönrederei von einigen, oder es gibt sowas wie luck und pech accounts ^^","replies":[]}]}]}