{"poster":"Tetskatlipoka","date":"2017-01-11T21:38:43.483+0000","title":"extremer Ping > 2000 ms, bitte Hilfe bei pingplotter log","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"​Ich nutze mein Handy als Hotspot um mich mit dem Internet zu verbinden. Die Verbindung ist im wesentlichen ok, google.de l&auml;sst sich konstant mit 30ms anpingen.\nIm Ladebildschirm von LoL werden konstante 50 ms angezeigt.\nSobald ich im Spiel bin springt der Ping auf 2000+ und bleibt im Wesentlichen dort. Mit exakt dem gleichen Setup konnte ich vorige Woche noch ohne Probleme spielen.\nEin pingplotter log f&uuml;r einen trace zu 185.40.65.1 sollte hier zu finden sein: \n\n**pastebin.com/uSxmi16T**\n\nWenn ich das richtig interpretiere schein Hop 8: fra1-rdirect1-17ax27-rt1.eu.lol.riotgames.com das Problem zu sein.\n\nBei einer Verbindung per WLAN treten die Probleme nicht auf und interessanterweise taucht og. IP dann auch nicht im trace auf.\n\nK&ouml;nnte das auch an einem Verbindungsproblem zwischen O2 (mein Handynetzbetreiber) und dem Riot-Server sein?\n\nDanke f&uuml;r die Hilfe","replies":[{"poster":"Tetskatlipoka","date":"2017-01-25T20:04:30.827+0000","up_votes":1,"down_votes":0,"body":"Problem ist gelöst. Es war der niegel nagel neue WLAN-Stick -.-\nNeuen gekauft, jetzt gehts one Probleme. Übrigens auch per Handy.","replies":[]},{"poster":"Tetskatlipoka","date":"2017-01-12T08:15:47.369+0000","up_votes":1,"down_votes":0,"body":"Zunächst mal danke für die bisherigen Kommentare. Ich hatte schon die Befürchtung, dass vor lauter Flamekiddies hier keine vernünftige Diskussion möglich sei.\n\nZum Thema: Silbium wenn ich dich richtig verstanden habe sagst du, dass per 3G/LTE generell keine stabile Verbindung möglich ist. Bis vor einem halben Jahr hätte ich das gleiche gesagt. Ich bin aber in den letzten Monaten viel beruflich unterwegs und habe in der Zeit fast ausschließlich auf diese Weise gezockt. Funktioniert erstaunlich gut. Naja bis vor 3 Tagen halt.\nWeiterhin ist ja schon verwunderlich, dass alle anderen Anwendungen lagfrei laufen, nur LoL macht Probleme und das auch nur ingame.\n\nVG Tets","replies":[{"poster":"Homunculi","date":"2017-01-12T08:28:25.003+0000","up_votes":1,"down_votes":0,"body":"Bitte benutze den \"Antworten\" Button, es könnte sonst sein das deine Antwort nicht gesehen wird^^.\n\nMobiles Verbindungen sind immer etwas heikel, da viele Geräte gleichzeitig auf einen Punkt zugreifen und diesen ziemlich in die Knie lutschen, also was die Bandbreite angeht^^.\nEvtl. ist dein Verbindungslimit evtl. erreicht?\n\nLebst du ausserhalb von München/Bayern? Wenn ja, ab dem Weisswurstequator hat O2 nicht die beste Verbindung ^^\".\n\nDer Ping zu Google ist kürzer, als zu den RIOT Server, da Google so ziemlich überall seine Server stehen hat und RIOTs Server in Irland (?) stehen. \nDer von dir genannte Hop8 könnte ein Übersetzer für verschiedene Mobile Pakete sein und entfällt deswegen bei WLAN. Ausserdem, umso weniger Hops es gibt umso schneller/besser ist der Ping :).","replies":[{"poster":"Yaxtee","date":"2017-01-12T22:23:05.915+0000","up_votes":1,"down_votes":0,"body":"Die Server stehen übrigens in Amsterdam/Frankfurt (auch wenn ich mir nicht mehr sicher bin ob Frankfurt noch Up To Date ist :D) :)","replies":[{"poster":"Homunculi","date":"2017-01-13T07:17:54.719+0000","up_votes":1,"down_votes":0,"body":"Frankfurt(Oder oder Main? Ich vergess das immer x_X) kann gut möglich sein^^\", die Serverhauptstadt hab ich total verranzt x_x. Danke","replies":[{"poster":"Yaxtee","date":"2017-01-13T12:12:10.136+0000","up_votes":1,"down_votes":0,"body":"Main :D (ist FF an der Oder nicht recht klein :D) Und gern :3","replies":[]}]}]},{"poster":"Tetskatlipoka","date":"2017-01-12T18:27:05.389+0000","up_votes":1,"down_votes":0,"body":"Das mit dem Antworten-Button kannte ich noch nicht,  danke für den Hinweis","replies":[]}]}]},{"poster":"Tetskatlipoka","date":"2017-01-12T18:28:06.761+0000","up_votes":1,"down_votes":0,"body":"Heute ist es wie von Zauberhand deutlich besser. Bestärkt mich in der Annahme, dass es nicht an meiner Verbindung liegt. Aber endgültig rausfinden wird mans wohl nicht. Denke das Problem behebt sich in den nächsten Tagen von selbst.","replies":[]},{"poster":"Tetskatlipoka","date":"2017-01-11T21:52:07.361+0000","up_votes":1,"down_votes":0,"body":"Zwischendrin sind auch vereinzelt Verbindungsprobleme zum Hotspot, das stimmt. Einen davon hast du rausgepickt.\n\nDas erklärt meiner Meinung nach allerdings nicht, warum ich durchgehend Probleme im Spiel hab, obwohl ich gleichzeitig google.de ohne Probleme anpingen kann oder auch im Teamspeak kein lag auftritt.\n\nIch kann auch per WLAN verbinden, bin dann aber natürlich drauf angewisen, dass kein anderer parallel was runter läd. Per WLAN treten die Probleme nicht auf, allerdings ist dann auch Hop 8 nicht im trace mit drin","replies":[{"poster":"silibum","date":"2017-01-11T22:03:56.600+0000","up_votes":1,"down_votes":0,"body":"Das der Hop 8 fehlt ist nicht schlimm, je nach Verbindung geht dein \"Signal\" ein anderen Weg zum Server - sieh es wie eine Straßenkarte: Es gibt viele Wege: lange, kurze, schnelle, etc. pp.\n\nManche Anbieter haben ein langen und anderen einen schnellen - Der schnelle ist der bessere wie sich aus der Logik ergibt.\n\nEine Handyverbindung geht über 3G/LTE und ist daher schon absolute nicht zu empfehlen wenn es um gute Reaktionszeiten geht und da es sich dabei noch um geteilte Medien handelt ist die Qualität der Verbindung alles, aber nicht stabil.\n\nDu wirst dabei nicht viel ausrichten können, außer die genannten alterantiven zu nutzen. Es gibt auch Möglichkeit bestimmten Traffic im Netzwerk zu priorätisieren - dazu braucht es allerdings ggf. etwas Hardware/Software und Infrastrukturänderungen im Haus/Wohnung.","replies":[]}]},{"poster":"Yaxtee","date":"2017-01-11T21:44:50.337+0000","up_votes":1,"down_votes":0,"body":"Hey du :)\nDie meisten EInträge sehen tatsächlich okay aus, aber wenn du auf einmal hohe Werte hast, ist die Verbindung zu deinem Hotspot einfach recht schlecht\n\n2017-01-11 21:17:52Z, 1056.84,*,996.52,962.23,915.91,862.06,817.42,*,*,*,617.00,N/A,571.00,*\nHier ein Ausschnitt\nDa sieht du, dass der Ping zum handy bei 1000 ms befindet, das ist schon eine Sekunde. Hast du keine möglichkeit über dein WLAN vom Haus zu spielen doer ein LAN Kabel zu verwenden?","replies":[]}]}