{"poster":"Amenotejikara","date":"2015-09-30T07:04:15.733+0000","title":"¿Carrear o aportar?","subforum":"Charlas Generales","up_votes":2,"down_votes":2,"body":"Quer&iacute;a realizar una pregunta muy simple, tan simple y tan importante a la hora de jugar...\r\n&iquest;Que piensan ustedes? &iquest;Es mejor carrear o realizar un buen aporte en el equipo?\r\n\r\nDigo, en lo personal, creo que resulta mucho mejor un buen aporte (a veces en consecuencia se da que tantos buenos aportes resultan en que alg&uacute;n miembro pueda carrear la partida), es decir, saber coordinar y no equivocarse (o tener errores &iacute;nfimos) a la hora de jugar en equipo o ayudar a los dem&aacute;s. Por ejemplo suele ocurrir que hay support o junglas que realizan tan bien las cosas que facilitan el cumplimiento de objetivos. Hasta un tanque realiza un buen aporte al &quot;aguantar&quot; la team fight y poder sacar varios de los compa&ntilde;eros del team ilesos. \r\nPor las dudas, hago diferencia entre &quot;carrear&quot; y &quot;buen aporte&quot;, porque a veces carrear se da por ya tener una buena ventaja, ser muy h&aacute;bil con un campe&oacute;n, pero en fin, tener un muy buen desempe&ntilde;o individualmente en una partida.\r\nTambi&eacute;n comprendo que ciertas partidas a veces no se pueden ganar si no son carreadas y otras no se ganan si no se juega bien en equipo","replies":[{"poster":"Haise","date":"2015-09-30T08:55:00.235+0000","up_votes":4,"down_votes":0,"body":"Creo que a lo que se refiere es si es siempre importante tomar las riendas del team en todas las partidas tomando en cuenta el rol de carry, ya sea el mid liner o el adc o el que vaya a daño. \n\nMira, yo ando con la misma duda que me surge a partir de las rankeds. Soy main jg (si es que se puede decir \"main\") y siempre me gusta ser el jugador que aporte \"lo que falta\" al team. Por ejemplo: ¿falta CC? Me pickeo una Sejuani, un Gragas o un Nautilus. ¿Falta daño? Saco un carry como Khazix o Rengar o Xin Zao. Y así sucesivamente. Y eso, con el tiempo te va transformando la mentalidad de jugador mucho más enfocado a rellenar los huecos del team que a ser el protagonista que lo saca adelante con kills y demás. He ahí que nace el tipo de jugador basado en \"utilidad\". Sí, todos los personajes son útiles. Pero en este caso el concepto abarca a los que se reducen a sólo utilidad.\n\nDicho eso, me pasa bastante seguido en rankeds que saco personajes de utilidad en jg y confío en que el resto de mis compañeros van a hacer el resto. En los casos que sale bien, se nota que los carries hicieron su trabajo a la perfección. En el caso en que perdemos, se nota lo contrario. Y ahí es cuando me viene la duda de: ¿hasta qué punto \"es útil ir de utilidad\"? ¿No se arriesga mucho dejando a los demás la tarea de \"carrear\" y sólo dedicarse a ser una tarea de soporte (que por cierto, no sólo los junglas sino también los supps podrían cuestionarse lo mismo).\n\nHumilde opinión. Quizás gente más experimentada (que estoy en Plata II sufriéndola) sepa dar una mejor opinión en base a su experiencia. Saludos.","replies":[{"poster":"sebaplay UY","date":"2015-10-01T05:38:45.059+0000","up_votes":1,"down_votes":0,"body":"es un muy buen punto pero para ese punto hay una pregunta que creo que responde tu duda \n¿quieres que los demás lleguen a oro? o ¿ quieres llegar vos a oro? no se si me explico pero te lo detallo un poco, vos le estas confiando el destino del game a tus compañeros gente que no se conocen entre ellos que vos no conoces es como dejarle las llaves de tu auto a una persona en la calle para que te lo limpie pasa 2 cosas 1 te lo roban o otra te lo limpian suponiendo que sea una persona que precisa y trabaja de eso, entonces no es mas fácil dejarse el destino de una partida a uno mismo empujar a la victoria uno mismo y si es derrota al menos no calentarse porque sabes que el esfuerzo lo pusiste y que la próxima sera diferente","replies":[]},{"poster":"Amenotejikara","date":"2015-10-01T04:37:17.968+0000","up_votes":1,"down_votes":0,"body":"¡Estoy totalmente de acuerdo! Veo que lograste captar lo que quería discutir. A veces uno trata de buscar las mejores opciones en cuanto ítems, summoner spells, cualidad del campeón que elige, etc, y puede que aquél pequeño granito de arena que uno realiza nunca sea suficiente. A veces las partidas las ves que la gana tan sólo un jugador, en tu equipo o en el enemigo, aquél que hace muchas cosas solo, pero por ejemplo, por ahí a la hora de la tf si ve que las cosas salen mal simplemente se aleja o \"huye\", y de esa forma no haciendo un buen aporte. Y yo pienso que la categoría en la que uno esta no hace mucho al respecto, es solo tener un punto de vista sobre el juego que por ahí no muchos tienen.","replies":[]}]},{"poster":"Jian","date":"2015-09-30T07:23:50.445+0000","up_votes":4,"down_votes":1,"body":"***","replies":[{"poster":"Amenotejikara","date":"2015-10-01T04:29:45.164+0000","up_votes":1,"down_votes":0,"body":"¿Para qué me gasto en diferenciar los conceptos? Hablo de carrear como si individualmente uno sólo alcanzara objetivos del equipo y ganara kills, y aporte al equipo como buena resolución a la hora de trabajar juntos. No todos los que hacen bien las cosas en su carril o solos lo hacen con el equipo. Alguien que carrea puede hacer un aporte al resto de los compañeros como no hacerlo. Me sigo haciendo la idea de que no entendés lo que quiero decir...","replies":[{"poster":"Jian","date":"2015-10-01T14:23:00.654+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Amenotejikara","date":"2015-10-02T04:36:05.591+0000","up_votes":1,"down_votes":0,"body":"Yo no veo como el que carree haga más aporte. He visto mids 3/5 pero que todas las buenas tácticas que favorecieron al equipo las hicieron ellos. A ver, para ver otro punto de vista, te invito a ver los otros comentarios a ver como lo interpretó el resto!","replies":[]},{"poster":"Runth","date":"2015-10-01T18:38:07.423+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=PRISIONERO,realm=LAS,application-id=v7qsfXsE,discussion-id=tiXoKKOO,comment-id=000100010000,timestamp=2015-10-01T14:23:00.654+0000)\n>\n> El que \"carrea\" es el que mas aporte hace al equipo, aún en circunstancias desfavorables para el mismo. Ya sea aconsejando, indicando objetivos, liderando al equipo a la victoria en fin.\n> Si no es eso pues no te entiendo.\n\nni yo, parece q se cree individualista este juego","replies":[]}]}]},{"poster":"Watta","date":"2015-09-30T14:54:27.825+0000","up_votes":1,"down_votes":1,"body":"concuerdo con vos carrear no es ir 30 4 , y q tu team valla todos 3 2 4 2  1 1  si no aportar, te falta mucho por aprender pequeño pichon !","replies":[]}]},{"poster":"Toukah","date":"2015-10-01T05:25:17.302+0000","up_votes":2,"down_votes":0,"body":"Dios mio me acabo de dar cuenta de algo, estoy jodido en oro por esto mismo xD antes me dedicaba a hacer eso aportar y ser utilidad y subi divisiones casi gratis pero desde que juego rengar soy mas de hacer ultra carros exagerados no digo que soy mas malo sino que en ciertas partidas suele ser mejor dar utilidad que carrear en plan ultra stom si me explico bien me refiero a que no todo el carreable y que aveces quizas sea mejor pillarse algun pick seguro y con algun tipo de utilidad xD. (Mala ortografía si y lo siento)","replies":[{"poster":"Amenotejikara","date":"2015-10-02T04:33:44.516+0000","up_votes":1,"down_votes":0,"body":"Claro, eso es lo que pienso! Mira, un ejemplo para mi pregunta xd al menos espero que esta reflexión haga que dejes de estar estancado en oro y subas de división :D Es que realmente a veces es mejor ser de más utilidad que solo ir matando enemigos así como así","replies":[]}]},{"poster":"Ks Erwyn","date":"2015-09-30T14:26:14.782+0000","up_votes":2,"down_votes":0,"body":"Carrear aportando.............","replies":[]},{"poster":"Hernan Bozzano","date":"2015-09-30T11:11:22.616+0000","up_votes":2,"down_votes":0,"body":"siempre que sea posible carrear, en caso de no poder, aportar lo que mas se pueda al equipo.","replies":[]},{"poster":"Fantasia Sexual","date":"2015-09-30T08:18:25.840+0000","up_votes":2,"down_votes":0,"body":"Hay que farmear,tomar lvl,pushear lineas,cazar gente fuera de lugar,tomar objetivos y te pones la partida al hombro,todo aporta a carrear","replies":[]},{"poster":"sebaplay UY","date":"2015-09-30T07:17:11.281+0000","up_votes":2,"down_votes":0,"body":"que quieres que te diga todo grano de arena aporta y eso siempre va a ser así, no morir aunque no mates y solo asistas ya estas sumando mucho porque no das oro pero si no se sabe aprovechar esa gran ventaja pues fue buena la partida :D y  me fui de tema jajajj.\nRealmente carrear vendría a ser para soloq y aportar para ranked 5 vs 5 ya que en 5 vs 5 estas con un equipo que sabes como funciona como es el desempeño de cada uno y en soloq estas con gente que no conoces con tu mismo elo y si quieres salir rápido tenes que destacar vos por sobre los otros 5 del rival y los 4 de tu equipo","replies":[{"poster":"Amenotejikara","date":"2015-10-01T04:43:12.056+0000","up_votes":1,"down_votes":0,"body":"Te doy la razón, jugar soloQ no es tan sencillo, y es cierto que mejor te irá si carreas las partidas ahí. Cuando es ranked 5 vs 5 es muy importante la buena coordinación, ya que no se hace tan sencillo carrear sin ayudarse mutuamente con tu equipo.","replies":[]}]},{"poster":"Fantasia Sexual","date":"2015-09-30T07:25:46.980+0000","up_votes":1,"down_votes":0,"body":"Ambos son importantes,y de todos modos es una pregunta ambigua xD porque aportar y carrear van de la mano no se si me explico xD","replies":[{"poster":"Amenotejikara","date":"2015-10-01T04:41:34.629+0000","up_votes":1,"down_votes":0,"body":"Si, te explicas xd yo sé que es un concepto muy abstracto que a muchos les costó masticar :P Hago un ejemplo con algo bastante común, por ejemplo, si vas top con x campeón, y avanzas y avanzas, tiras las torres, mantenes bien pusheada la línea, al otro top laner lo tenes hasta detrás de torre, pero nunca tiraste un teleport, ni te acercaste a la tf que se dieron por tomar el dragón, etc. Mientras tanto, tu equipo está bastante bien porque la presión que haces y las kills que ganas los tiene complicados a los del team enemigo, pero con una vez que te maten, podrían quedar en una clara desventaja porque ellos 4 contra los otros 4 no la están pasando muy bien. No necesariamente es un aporte a tus compañeros, quizás distrae al equipo enemigo y conseguiste objetivos, pero no te gastaste en participar en team fights y lograr objetivos en equipo. En fin, muy confuso, espero que entiendas!","replies":[]}]},{"poster":"Zabivaka","date":"2015-09-30T14:49:44.676+0000","up_votes":1,"down_votes":0,"body":"En ningun momento estas carreando solo, carreas aportando al team.\nPues ganas en equipo no ganas la tf vos solo vs 5","replies":[]},{"poster":"Runth","date":"2015-09-30T08:21:44.435+0000","up_votes":2,"down_votes":3,"body":"q pregunta tan decepcionante, eres nuevo aqui o que?","replies":[{"poster":"Amenotejikara","date":"2015-10-01T04:44:20.846+0000","up_votes":1,"down_votes":0,"body":"\"Decepcionante\" es ver que no pudiste entender lo que trato de decir. Tomate el tiempo de leer las otras respuestas que capaz te ayude a captar la idea que planteo, yo entiendo que es medio confuso, pero no hace daño pensar un poco más la pregunta!","replies":[]}]}]}