{"poster":"Kable","date":"2017-02-02T18:31:53.737+0000","title":"Problems with Pulse Fire Ezreal when unlocking through Hextech crafting","subforum":"Report a Bug","up_votes":1,"down_votes":0,"body":"I unlocked the Pulse Fire Ezreal skin using the Hextech crafting.  But a few things are not working as they would, as if I purchased it.  First off I have not received the Summoner Icon or the Summoner profile banner.  Also the biggest issue I am having is that in game the Four stage evolving model is not working correctly.  The model never evolves.","replies":[{"poster":"moonstones","date":"2017-02-02T18:39:11.459+0000","up_votes":3,"down_votes":0,"body":"Hey! \n\nHave you tried logging out and in? The icons may not have granted right away. The banner will only show if you have the PFE icon equipped. The model should evolve upon leveling your ultimate, is this not occurring for you?","replies":[{"poster":"Kable","date":"2017-02-03T15:56:26.355+0000","up_votes":1,"down_votes":0,"body":"Thanks for you help, everything seems to be working now.","replies":[{"poster":"moonstones","date":"2017-02-03T16:58:10.660+0000","up_votes":1,"down_votes":0,"body":"No problem, glad everything's good to go! :)","replies":[]}]}]},{"poster":"Deep Terror Nami","date":"2017-02-02T18:38:44.001+0000","up_votes":1,"down_votes":0,"body":"I don't know how his evolving model works, but for the icons, are you using the legacy client? The Summoner Icon list might scroll down more rows than are displayed if you use your mouse scroll wheel, so try dragging the scroll bar to look for them instead. If you are using the new client that isn't an issue.\n\nIf they aren't there still, try reloading the client and see if they show up.","replies":[{"poster":"Kable","date":"2017-02-03T14:55:41.580+0000","up_votes":1,"down_votes":0,"body":"Looks like the icon is way down the list.  I expected it to be near the top.  Weird.","replies":[{"poster":"Deep Terror Nami","date":"2017-02-03T16:54:51.271+0000","up_votes":1,"down_votes":0,"body":"Yeah, icons have a set spot on the list instead of being in order of when you earn them.","replies":[]}]}]},{"poster":"Shadòw","date":"2017-02-02T18:39:00.928+0000","up_votes":1,"down_votes":0,"body":"it's the demo version lol","replies":[{"poster":"Kable","date":"2017-02-03T14:55:00.072+0000","up_votes":1,"down_votes":0,"body":"Wrong","replies":[]}]}]}