{"poster":"Agatack","date":"2015-06-08T06:47:57.430+0000","title":"/*\\Report/*\\","subforum":"Comportamiento del jugador","embed":{"description":null,"url":"http://i.imgur.com/kJ3xkhd.png","image":"http://imgur.com/kJ3xkhds.png"},"up_votes":2,"down_votes":0,"body":"Primero me presento, casi un a&ntilde;o jugando LoL con diversas cuentas y  he comprobado la siguiente situaci&oacute;n.\r\nSe dice que el juego es seguro, y  un sin fin de cosas muy buenas entre ellas el Freetoplay...etc...\r\n\r\nSin embargo todas las herramientas que los desarolladores han dado a los jugadores o comunidad in-game, solo son otra arma para fastidiar.\r\nMe refiero al famoso REPORT una herramienta que es usada indiscriminadamente por todos los usuarios, inventando comportamientos inexistentes simplemente por que no hiciste X cosa durante una &quot;Partida&quot; y que seg&uacute;n ellos es malo....\r\n\r\nEn lo personal solo es una arma para mantener contento al N..O...R..A\r\n\r\nPero dej&aacute;ndose de ni&ntilde;erias, la cuesti&oacute;n es simple:\r\n\r\nFalta un manual explicativo ( como se dice vulgarmente) a prueba de tontos explicando una correcta funci&oacute;n de la herramienta Report, ya que creo que los usuarios est&aacute;n ABUSANDO de esta herramienta por simples boberias...Hum!!\r\n\r\n&ugrave;.&uacute;\r\n\r\n\r\n{{champion:134}}","replies":[{"poster":"Llulian","date":"2015-09-21T18:41:12.891+0000","up_votes":1,"down_votes":0,"body":"Creo que se merece un report..","replies":[]},{"poster":"Necronicas","date":"2015-08-06T07:11:01.619+0000","up_votes":1,"down_votes":0,"body":"reporto a bucaroot y diiablloo q apenas entraron ranked se automatavan cada 5 segundos como subir foto o video?","replies":[{"poster":"Necronicas","date":"2015-08-06T07:17:58.427+0000","up_votes":1,"down_votes":0,"body":"aca esta resultado final","replies":[]}]},{"poster":"Exit","date":"2015-06-10T16:46:43.297+0000","up_votes":1,"down_votes":0,"body":"no pasa nada con el mensaje por mas que te reporten n te banean","replies":[]},{"poster":"alkel","date":"2015-06-09T02:39:37.429+0000","up_votes":1,"down_votes":0,"body":"Es cierto, a mi me lo han mandado y ni idea porque, es más ni siquiera uso el chat.","replies":[]},{"poster":"OG Noah do Bree","date":"2015-06-08T13:46:40.867+0000","up_votes":1,"down_votes":0,"body":"Perdón pero creo que la herramienta funciona bien, a mi ese cartel me salio solo una vez (y creo que me lo merecía) pero después de eso me tome las cosas con mas calma y nunca mas volví a tener problemas. ¿No sera este un post de la gente que en las partidas dicen que el report no sirve para nada hasta que les cae rito?","replies":[]},{"poster":"LuciusMagnum","date":"2015-06-08T06:51:57.886+0000","up_votes":1,"down_votes":0,"body":"todos van a seguir abusando del report por mas que haya un manual explicativo, le caiste mal a alguno y te clava report. Mas alla de eso, por mas que riot diga que es importante reportar al final de la partida, todos sabemos que es algo inutil hacerlo porque ese \"informe\" no va a ningun lado, ni se hace nada con eso","replies":[]}]}