{"poster":"Donald Trump MVP","date":"2014-12-09T17:00:46.363+0000","title":"clicking on a normal game put me in ranked while on ranked restriction","subforum":"Report a Bug","up_votes":14,"down_votes":0,"body":"I was put on ranked restriction due to \"recent behavior\". It gives me a message saying that I cannot play ranked games until I complete 35 normal draft games.  When I try to play a ranked game, it gives me a message saying that I am restricted and unable to join ranked games.  Yesterday, I queued up for a normal draft game.  Afterwards, a player said that he got demoted.  I said \"why? this is a normal game\".  He responded \"you are dumb\".  After the game, I checked my game history and it said that I lost a ranked game.  I have sent RIOT support a question of why this happened and they gave me a generic copy/paste response of why people are being restricted therefore not answering my question.  Any thoughts guys?","replies":[{"poster":"Riot Afic","date":"2014-12-09T22:33:52.846+0000","up_votes":8,"down_votes":0,"body":"Hey, thanks for posting this!  Although this is not my area of expertise, I will forward this to the appropriate people.  Sorry for the inconvenience.","replies":[{"poster":"Eotw","date":"2014-12-09T23:07:14.736+0000","up_votes":7,"down_votes":0,"body":"Yeah, playing a ranked game while restricted... how inconvenient... for everyone else.","replies":[{"poster":"Donald Trump MVP","date":"2014-12-10T01:07:12.802+0000","up_votes":1,"down_votes":0,"body":"lol... I agree. its also hard to care about a game when you can only type to your team every 4 minutes and cant communicate to group or get objectives half the time.  Also I like to pick unconventional champions/roles in normal modes to try new things... but surprise!!! its a trick ranked game!!! THANKS RIOT!","replies":[]}]},{"poster":"Duke Anax","date":"2014-12-10T04:27:15.649+0000","up_votes":4,"down_votes":0,"body":"Just why is the official Riot Support, who is specifically meant to handle exactly this stuff, too incompetent to actually do that, while a random Rioter noticing a random forum thread get's it done? -,-","replies":[]},{"poster":"BallisticMouse","date":"2014-12-09T23:52:43.544+0000","up_votes":2,"down_votes":0,"body":"Could you also send notice that having to win your draft pick matches is BS to remove the ranked restriction? \n\nThe community doesn't treat draft/normal matches like real games. Please dont act like they do c:","replies":[{"poster":"Donald Trump MVP","date":"2014-12-10T01:19:37.323+0000","up_votes":2,"down_votes":9,"body":"Or how about that I am on an American server and over here we protect our freedom of speech.  League is as communistic as the country it was developed in.. go figure.  OH NO... SOMEONE CALLED ME BAD OR RETARDED..... BLOW THE HARASSMENT WHISTLE!  .... NEWSFLASH: harassment is when you aggressively pursue someone i.e., not letting them walk away (or even more easily hit a mute button)","replies":[{"poster":"ChrisB5","date":"2014-12-10T11:53:18.863+0000","up_votes":2,"down_votes":2,"body":"I can't tell if you're being sarcastic or not, but if you aren't...\n\nThis is probably why you were restricted in the first place.  You are given the right of speech, but Riot has the rights to protect its users from toxic players such as yourself.  Be kind to other players.  Someone isn't perfect?  Help them out.  Explain how they can do better instead of rudely cursing at them.  Be an adult.  It's simple.  I hope something clicks and you realize how silly you sound.  And muting other players isn't ideal.  To win a game, teamwork and communication is ideal.  If you can't communicate with your team, you probably shouldn't be playing ranked.\n\n-ChrisB5\n{{champion:89}} {{champion:99}} {{champion:101}}","replies":[{"poster":"KOREA Blaze 420","date":"2014-12-10T12:57:16.746+0000","up_votes":2,"down_votes":1,"body":"> I can't tell if you're being sarcastic or not, but if you aren't...\n> \n> This is probably why you were restricted in the first place.  You are given the right of speech, but Riot has the rights to protect its users from toxic players such as yourself.  Be kind to other players.  Someone isn't perfect?  Help them out.  Explain how they can do better instead of rudely cursing at them.  Be an adult.  It's simple.  I hope something clicks and you realize how silly you sound.  And muting other players isn't ideal.  To win a game, teamwork and communication is ideal.  If you can't communicate with your team, you probably shouldn't be playing ranked.\n> \n> -ChrisB5\n> {{champion:89}} {{champion:99}} {{champion:101}}\n\nRiot treats the playerbase like we're all angsty teenagers, for good reason.","replies":[]}]},{"poster":"IronChefBoyardee","date":"2014-12-10T13:04:28.056+0000","up_votes":3,"down_votes":1,"body":"I feel the need to point out that Freedom of Speech only stop the government from stifling speech. There are still consequences for stuff you say.  Try not to be toxic and you won't get ranked restricted.","replies":[{"poster":"BallisticMouse","date":"2014-12-13T17:20:53.970+0000","up_votes":1,"down_votes":0,"body":"I stopped being toxic after a 60 game chat restriction, but not being toxic isn't making me win my draft picks because people troll/afk/etc in normals like it doesn't matter. Because it doesn't really.","replies":[]}]},{"poster":"BallisticMouse","date":"2014-12-10T02:48:24.524+0000","up_votes":2,"down_votes":0,"body":"Um, how did anything you posted to me just now relate to anything I just said to someone who wasn't you?","replies":[{"poster":"Donald Trump MVP","date":"2014-12-10T08:31:13.410+0000","up_votes":1,"down_votes":1,"body":"Um, how did anything you posted relate to anything I said to someone that doesn't write unrelated topics instead of starting a new thread?","replies":[{"poster":"BallisticMouse","date":"2014-12-13T17:22:14.893+0000","up_votes":1,"down_votes":1,"body":"-sigh- Another person with below average IQ on the forums, shocker.","replies":[]}]}]}]}]}]},{"poster":"Sammystorm","date":"2014-12-09T20:52:39.618+0000","up_votes":3,"down_votes":0,"body":"You just have to keep sending them stuff until they send you to a real person.","replies":[]},{"poster":"themachamp2","date":"2014-12-09T22:51:14.201+0000","up_votes":1,"down_votes":5,"body":"why report the bug....now we can play ranked while being ranked restricted XD","replies":[]}]}