{"poster":"Kriion","date":"2016-06-20T23:53:53.926+0000","title":"[Champion Konzept] Riia, die einsame Fischerin","subforum":"Skin- & Champion-Konzepte","up_votes":8,"down_votes":1,"body":"**Riia, die einsame Fischerin**\n\n**Erscheinung:**\nRiia ist eine Blonde junge Frau die in Inuit Klamotten gekleidet ist.\nSie benutzt einen Ring aus Wasser als Waffe und Verteidigung der je nach Gef&uuml;hlslage seine Beschaffenheit ver&auml;ndert. (fest,fl&uuml;ssig.gasf&ouml;rmig).\n\nhttp://www.mandragoras-schule.de/schule/unterricht/5_klasse/pics/voelker1qtl_9.jpg\n(Inuit Kleidung Quelle: Google)\n\n**Geschichte:**\nSeit Jahren wohne ich hier alleine an den Fjorden Freljord&#039;s und versuche meine Existenz geheim zu halten doch leider fanden mich die Sp&auml;her der Eishexe Lissandra.\n\nSie sperrte mich ein und Experimentierte mit meinen **&quot;Kr&auml;ften&quot;**, Sie versuchte mich zu brechen doch so leicht lasse ich mich nicht verbiegen, nicht nach allem was passiert ist. So gelang es mir nach wochenlanger Gefangenschaft meine **&quot;Kr&auml;fte&quot; **besser zu verstehen und zu Kontrollieren. Mit dem neuen Verst&auml;ndnis meiner **&quot;Kr&auml;fte&quot;** gelang mir schlussendlich die Flucht und ich schloss mich der K&ouml;nigin Freljord&#039;s in Ihrem Kampf um die Freiheit an.\n\nIhr fragt was meine **&quot;Kr&auml;fte&quot;** sind?  Sie verfolgen mich seit meinem 16 Geburtstag. Hexe haben Sie mich genannt und aus dem Dorf gejagt, dabei wusste ich nicht einmal was vor sich ging. Es ging alles so pl&ouml;tzlich und ich wollte das doch eigentlich gar nicht. Wieso musste Sie mir auch meinen Freund ausspannen....\n\nDas Wasser kam innerhalb von Sekunden und zog Sie mit sich immer weiter und weiter in den kalten Fjord hinein. Immer noch h&ouml;re ich Ihre Schreie und sp&uuml;re Ihren angsterf&uuml;llten Blick auf mir. \n\nDas also sind meine **&quot;Kr&auml;fte&quot;**, das Wasser h&ouml;rt auf mich und sp&uuml;rt meine Gef&uuml;hle. \n**Das also sind meine Kr&auml;fte, mein Fluch und mein Segen.**\n\n**F&auml;higkeiten:**\n**Passive: Wechselhafte Gef&uuml;hle**\nRiia&#039;s Wasserring ver&auml;ndert seinen Aggregatzustand je nach zuletzt eingesetzter F&auml;higkeit. \nFest: Riia&#039;s R&uuml;stung erh&ouml;ht sich um 2,5/5/7,5.\nFl&uuml;ssig: Riia&#039;s Lebensregeneration erh&ouml;ht sich um 2,5/5/7,5%.\nGasf&ouml;rmig: Riia&#039;s Magieresistenz erh&ouml;ht sich um 2,5/5/7,5.\n\n**Q: K&auml;lteeinbruch**(fest)\nRiia erschafft mit Hilfe Ihres Wasser Rings um sich herum ein verlangsamendes Feld aus Schnee und Eis(dauer 2,5 Sec, das Gegner die sie ich darin aufhalten um 20/25/30/40/45% verlangsamt, wenn sie &uuml;ber den gesamten Zeitraum der F&auml;higkeit darin standen einfriert. (1 Sec Bet&auml;ubung)\n\n**W: Heilende Quelle**(flüssig)\nRiia erschafft eine Quelle heilenden Wassers das die Regeneration in einem kleinen Gebiet (150 Radius) stark erh&ouml;ht. 10 sec 300% Lebensregeneration\n\n**E: Geysier**(gasförmig)\nRiina erschafft nach einer verz&ouml;gerung einen Geysir der Gegner die Direkt auf der Eruption stehen in die Luft wirft, Gegner die in der N&auml;he stehen wegschiebt und Schaden verursacht.\n\n**R: Kollaps **\nRiia&#039;s Wasser Ring &auml;ndert sich in den Gasf&ouml;rmigen zustand und dehnt sich langsam auf einen Radius von 300 aus, Gegner die den Wasserdampf ber&uuml;hren erleiden geringen verbrennungsschaden, danach wechselt er in den fl&uuml;ssigen Zustand und zieht sich wieder zusammen Gegner die das Wasser ber&uuml;hren werden Eingefroren k&ouml;nnen keine Bewegungseffekte einsetzen(wie bei Cassiopeia&#039;s Miasma) und daraus Fliehen. (dauer Ausdehnung 3 Sec/dauer verbrennungsschaden 1,5 Sec alle 0,5 Sec/dauer verkleinerung 2 Sec/dauer Erfrierung 1 Sec)\n\n\nHey w&uuml;rde mich &uuml;ber konstruktive Kritik sehr freuen!\n\nViele Gr&uuml;&szlig;e Kriion","replies":[{"poster":"ShadowKiddy","date":"2016-07-02T21:36:44.851+0000","up_votes":2,"down_votes":0,"body":"Richtig schönes Konzept. Erinnert mich ein wenig an Taliyah wegen Elementen und so.{{champion:1}} {{champion:163}} Gefällt mir alles sehr gut. Schick das mal and Rito oder so damit die das sehen :D","replies":[{"poster":"Kriion","date":"2016-07-04T11:15:28.895+0000","up_votes":1,"down_votes":0,"body":"Vielen Dank ! \n\nIch denke Rito wird das leider nicht beachten aber vielleicht nimmt es ja einer der Designer als Denkanstoß! :D","replies":[{"poster":"ChimeCollector69","date":"2016-07-23T16:27:54.462+0000","up_votes":1,"down_votes":1,"body":"Quelle: Google?\n\nErnsthaft? Bist du in der fünften Klasse?","replies":[{"poster":"eingew","date":"2016-07-23T19:26:44.823+0000","up_votes":2,"down_votes":0,"body":"Uff, ich glaube für eine weniger wissenschaftliche Arbeit als vielmehr eine reine Information um das Konzept an sich verständlicher zu machen muss man da nicht so streng an eine Quellenangabe rangehen. An sich kannst du aber auch auf das Bild klicken und kommst dadurch automatisch auf die URL des Bildes, falls dir das mit der Quelle so wichtig ist.","replies":[{"poster":"ChimeCollector69","date":"2016-07-23T19:53:23.180+0000","up_votes":1,"down_votes":0,"body":"Dann kann man es auch ganz weg lassen. Aber als Quelle Google anzugeben, ist lächerlich.","replies":[]}]}]}]}]},{"poster":"Azcorban","date":"2016-06-26T14:54:41.279+0000","up_votes":2,"down_votes":0,"body":"Endlich mal wieder ein wirklich gutes Championkonzept!\nMir gefällt die Idee mit den Aggregatszuständen sehr, doch hier ein paar Veränderungsvorschläge:\n\nFür die Standardwerte siehe NavySaltys Kommentar, bin mit seinem Vorschlag zufrieden.\n\n**Passiv:**\n-Fest: Erhöht die Rüstung um 5/15/25. Nach 3 Normalen Angriffen gefriert der Gegner und wird 0,75s betäubt (10s CD, wie Nautilus' Passive)\n-Flüssig: Riias Lebensregeneration und Manaregeneration erhöhen sich um 2,5/5/7,5%\n-Gasförmig: Riia's Magieresistenz erhöht sich um 5/15/25. Erhöht zudem auch die Bewegungsgeschwindigkeit um 20/30/40\n\n**Q:**\n-Verursacht zudem Schaden, falls eingefroren\n-Schaden: 60/120/180/220/260 (+40% AP)\n-CD: 19/18/17/16/15 s\n\n**W:**\n-Die Quelle hat 6 Leben, die wie ein Pinkward funktionieren (1 Leben/ Treffer)\n-Erhöht die Lebensregeneration für 8/9/10/11/12 s um 100/150/200/250/300 %\n-CD: 42/38/34/30/26 s\n\n**E:**\n-Dauer in der Luft: 1,2 s\n-Schaden (Mitte): 50/90/130/170/210 (+80% AP)\n-Schaden (Rand): 30/60/90/120/150 (+50% AP)\n\n**R:**\n-Während R aktiv ist, bekommt Riia 35% Schadensverringerung aus allen Quellen,\n-Stufe 1: Riia erschafft für 2s einen Ring aus Dampf um sie herum, der ihr folgt, Gegner hemmt(keine Bewegungsfahigkeiten) und an ihnen 75/100/125 (+30% AP) pro Sekunde verursacht\n-Stufe 2: Der Ring wird flüssig und verlangsamt Gegner um 30/40/50%, sie sind noch immer gehemmt.\n-Stufe 3: Der Ring erstarrt zu Eis und betäubt alle Gegner in ihm für 1,2/1,6/2 s und verursacht 100/200/300 (+40% AP) Schaden\n-CD: 140/110/80 s\n\nMfG Azcorban","replies":[{"poster":"Kriion","date":"2016-06-26T18:39:00.489+0000","up_votes":1,"down_votes":0,"body":"Danke! \n\nSehr gute Ideen! Gefällt mir würde ich denk ich übernehmen wenn ich darf ? :D","replies":[{"poster":"Azcorban","date":"2016-06-27T22:09:51.357+0000","up_votes":2,"down_votes":0,"body":"klar doch, dazu habe ich die Vorschläge gemacht ^^","replies":[{"poster":"Kriion","date":"2016-06-29T00:12:23.163+0000","up_votes":1,"down_votes":0,"body":"Mach ich wenn ich aus dem Urlaub zurück bin :D noch bisschen entspannen","replies":[]}]}]}]},{"poster":"Samuraisub","date":"2016-06-24T17:57:04.091+0000","up_votes":2,"down_votes":0,"body":"Gutes Konzept: Schöne Lore(die keine Widersprüche erzeugt, ein Lob von mir ^^)\nCooles Ability Kit\n\nVltt könntest du das Aussehen noch mehr erläutern.(Am besten mit Bild)","replies":[{"poster":"Kriion","date":"2016-06-25T12:44:14.103+0000","up_votes":1,"down_votes":0,"body":"Danke ! \n\nBild hab ich hinzugefügt! :D","replies":[]}]},{"poster":"ELOW Cronos","date":"2016-06-24T12:18:56.359+0000","up_votes":2,"down_votes":0,"body":"Avatar Herr der Elemente - jetzt auch in Ihrer Kluft! \n(sry konnte ich mir nicht verkneifen :D)\n\nAnsonsten cooles Championkonzept, kriegst n Upvote.","replies":[{"poster":"Kriion","date":"2016-06-24T16:47:07.140+0000","up_votes":1,"down_votes":0,"body":"Sagen wir es So es hat villeicht ein bisschen dazu beigetragen! :D","replies":[]}]},{"poster":"Rob Breezy","date":"2016-06-21T18:01:05.268+0000","up_votes":2,"down_votes":0,"body":"Erstmal ein richtig gutes Champion Konzept.\n\nWegen den Werten kann ich dir helfen allerdings würde ich sie zu einem Fernkampf/Tank/Support umbauen also die Fähigkeiten sind sehr gut. \nAls Hilfe für weitere Champs zum anpassen der Werte:\n\n1. Suche dir einen bereits vorhandenen Champ(mehrere gehen auch) der ähnliche Aufgaben wie deiner hat.\n2. Suche auf einer Seite die Werte von diesem raus und passe sie an deinen Champ an z.B. dein Champ hat Rüstung in seinem Moveset also nimmst du bei den Werten ein wenig weniger.\n3. Noch ein Tipp wenn es ein Champ mit Fernkampf Autoattacks ist mache diese nicht zu Stark es sei denn du \"baust\" einen ADC.\n4. Nur Nahkämpfer wie bekommen Magieresistenz pro Level, weil wenn du sehr Nah an einem Ap Gegner stehst die Attack logischer Weise schlechter Dodgen kannst.\n\nHier mögliche Werte für Riia:\n\nLeben: 499,32 (+77 pro Stufe)  \nLebensregen: 5,21 (+0.57 pro Stufe)\nAngriffsschaden: 46,468 (+2,2 pro Stufe)\nAngriffstempo: 0,625 (+2,25% pro Stufe)\nLauftempo: 335\nRüstung: 18,216 (+3,7 pro Stufe)\nMagieresistenz: 30 (+0 pro Stufe)\n\nIhr könnt mich natürlich auch verbessern.\n\nIch hoffe es hilft dir ein wenig bin auch nicht der beste ich hoffe es wird mehr Leute mit Ideen zu Champs oder Skins geben.{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Kriion","date":"2016-06-21T21:48:42.701+0000","up_votes":1,"down_votes":0,"body":"Hey vielen Dank! \n\nIch werd es beim nächsten Champ gleich mal ausprobieren! :D","replies":[]}]},{"poster":"lKawaiiNeko","date":"2016-06-21T13:38:57.315+0000","up_votes":2,"down_votes":0,"body":"Super Idee, mit den Aggregatzuständen und der passiven! Aber ich finde bei der Ult sollte der Ring im Flüssigen Zustand einen anderen Effekt haben, aber der Ring sich dafür noch in den eingefrorenen Zustand ändern und das sollte die Gegner dann betäuben. \nIch finde wenn die Ult so einen relativ kleinen Radius hat, und sie durch die passive Magieresistenz/Rüstung kriegt, heilen kann und betäuben kann sollte sie ein tanky support sein.\nIch find die Idee echt cool :)","replies":[{"poster":"Kriion","date":"2016-06-21T15:35:11.833+0000","up_votes":2,"down_votes":0,"body":"Jep ich mag Tanky Supports! :D\n\nHatte bei der Ulti eigentlich vor nachdem der Ring sich wieder ganz zusammen gezogen hat friert er alles was damit angezogen wurde Ein aber dachte das wäre etwas OP","replies":[]}]},{"poster":"CustomKunibert","date":"2016-06-21T12:07:27.260+0000","up_votes":2,"down_votes":0,"body":"Hey, an sich erstmal ein cooles Konzept!\n\nIch finde, auf die verschiedenen Eigenschaften des Wassers einzugehen, eine coole Idee und du hast das auch sehr gut in Fähigkeiten umsetzen können. \nIch habe zwar keine Werte, mit denen ich sonst bei solchen Beiträge herumjongliere und daraus die Rolle ablesen, allerdings finde ich, dass Riia wahrscheinlich kein ADC sein wird. Ich weiß leider fast nichts über den Champion, was stats angeht, nicht mal, ob Riia Fernkämpfer ist. \nMit der E kann man eher disengagen als engagen (wenn die Reichweite jetzt nicht übertrieben ist), die Q hat dasselbe Prinzip. Und ein Regenerationsfeld hilft auch den Verbündeten, wahrscheinlich am ehesten in der Laningphase. Ich gehe hier mal von einem Supporter aus, da kein wirklicher Waveclear vorhanden ist? \nDas ist wohl der Disengagestärkste Champion, den ich je in einem Konzept gesehen habe. Du kannst einfach mit deiner Anwesenheit (Q und R) so gut Gegner verkraulen, wenn du in denen drin stehst. Du hast auch die nötigen Tankstats mit der Passive (zumindest wahrscheinlich). Also in der Lane heilen und schützen, eventuell ein All-In. Kein Poke. Im Teamfight den ADC mit möglichst allem möglichen Beschützen --> Synergy mit Hypercarries.\n\nCooles Konzept kann ich nur nochmal sagen, da ich beim Lesen wirklich das Gefühl hatte, dass ich mit diesem Champion das _Wasser_   für meine Belange ausnutze und das nicht zu knapp. \n{{sticker:slayer-jinx-catface}} ","replies":[{"poster":"Kriion","date":"2016-06-21T13:26:56.010+0000","up_votes":1,"down_votes":0,"body":"Hey viel dank! \n\nIch kenne mich mit den ganzen Werten einfach zu wenig aus als das ich mit solchen um mich werfen würde! \n\nIch habe Sie mir als Support/Tank/Nahkämpfer vorgestellt (also wie du vermutet hast All-In und das Gegner Team so gut stören wie es Geht).\n\nDie Reichweite des E eher wie die von Tibbers also eher ein Nahbereichs Magier ähnlich wie Lissandra.","replies":[{"poster":"CustomKunibert","date":"2016-06-21T13:34:38.112+0000","up_votes":2,"down_votes":0,"body":"Ich kann mir die E optisch wie eine Mischung aus Brand W (Verzögerung und Bewegung) und Nautilus Ult (Effekte und Grafik) vorstellen - das wäre bestimmt eine feine Fähigkeit! :D","replies":[{"poster":"Kriion","date":"2016-06-21T15:34:42.926+0000","up_votes":2,"down_votes":0,"body":"Ja so hab ich mir das auch vorgestellt :D","replies":[{"poster":"CustomKunibert","date":"2016-06-24T06:55:42.461+0000","up_votes":1,"down_votes":0,"body":"Hey, mir kommt gerade noch eine Idee:\n\nlass doch mal die passive stacken. Okay, zugegeben beim flüssigen Aggregatzustand ist es reichlich sinnlos. Aber wenn du den Ring mit der Q immer weiter abkühlst, kannst du das dann 3mal stacken und wenn du 3 stacks hast, verlangsamst du Gegner um dich herum ein kleines bisschen. So ähnlich wie mit Frozen Heart! Alternativ könntest du auch sagen, du wirfst 10% der Autoattacks auf den Gegner zurück, wie mit Thornmail.\n\nUnd wenn du drei mal den gasförmigen Zustand gestackt hast, kannst du entweder magischen Schaden um 10% verringern lassen (Vorabzugsschaden) oder du sagst du bekommst einen Sunfire-Effekt.\n\nMan könnte auch den flüssigen Zustand stacken lassen, sodass du etwas mehr Regeneration rausholen kannst und bei vollen Stacks allen Verbündeten etwas Lauftempo gewährst, aber das würde physikalisch keinen Sinn machen, denn flüssiger als flüssig wirds nicht :P\n\nWas hältst du davon?","replies":[{"poster":"Kriion","date":"2016-06-24T11:14:42.282+0000","up_votes":1,"down_votes":0,"body":"Hätte auf jedenfall was ! \n\nWeis nur noch ob das dann nicht zu OP wäre.\n\nWobei man sich ja entscheiden müsste hmm :D","replies":[{"poster":"CustomKunibert","date":"2016-06-24T12:35:29.729+0000","up_votes":1,"down_votes":0,"body":"Eben, und da die Effekte aller schwächer sein sollten als die eigentlichen Items (und mit dem sunfire-effekt auf der supporter-position einiges schief gehen kann ^^) müsste das eigenltich gehen.\n\nIch habe mir überlegt, auch mal ein Konzept zu schreiben, habe aber überhaupt keine Idee. Wie hast du das gemacht? Hast du das Konzept aus der Idee heraus geschrieben oder wie bist du darauf gekommen?","replies":[{"poster":"Azcorban","date":"2016-07-19T20:27:53.154+0000","up_votes":1,"down_votes":0,"body":"ich weiß nicht, ob es dir noch etwas bringt, aber meine Konzepte sind durch Fantasie-Spielereien entstanden. Ich entwickle einfach sehr gerne Charaktere und denke mir zu ihnen etwas aus.\n\nMfG Azcorban","replies":[{"poster":"CustomKunibert","date":"2016-07-23T16:03:46.832+0000","up_votes":1,"down_votes":0,"body":"Naja, kommt etwas spät :P\nIch hab jetzt schon mal ein Konzept geschrieben, du kannst es dir ja gerne mal anschauen:\nhttp://boards.euw.leagueoflegends.com/de/c/skin-champion-konzepte-de/35dmYPVw-champion-konzept-bambruk-der-waterich-aus-dem-bergwerk","replies":[]}]},{"poster":"Kriion","date":"2016-06-24T16:46:10.281+0000","up_votes":1,"down_votes":0,"body":"Das zählt unter Ideen die mir vor dem einschlafen kommen. xD","replies":[]}]}]}]}]}]}]}]}]}