{"poster":"jorxxx","date":"2015-06-27T01:01:14.903+0000","title":"MMR visible personal","subforum":"Charlas Generales","up_votes":1,"down_votes":2,"body":"Bien resumido, el titulo lo dice todo. Propongo que el mmr personal de cada uno sea visible, de manera privada. \r\nRiot viene hace rato haciendo enfasis en la claridad, por ejemplo redise&ntilde;ando los bush con los timers de jungla mapa nuevo etc... blanquear el mmr seria otro paso en ese camino y veo solo aspectos positivos, no imagino que seria lo negativo de hacerlo.\r\nEn que situacion seria bueno? \r\nBien, permitiria a la gente saber porqu&eacute; esta ganando pocos lp y perdiendo muchos, evitaria quejas, reclamos, sensacion de injusticia, necesidad de consultar paginas externas que son poco confiables...\r\nEntonces si me dan pocos lp veria que mi mmr es por ejemplo 1200 y el de mi division es de 1500, y ahi diria &quot;ah, por esto es&quot; y en vez de quejarme y sentir que es injusto me esforzaria por mejorar. Si veo que mi mmr es bueno o excelente me esforzaria por mantener el nivel y al ser privado no podrian ocurrir discriminaciones conttra otros invocadores.\r\nEs REALMENTE necesario? NO, pero seria bueno y se han hecho cosas muucho menos necesarias en pos de la claridad que al principio fueron criticadas.","replies":[{"poster":"Runth","date":"2015-06-28T09:36:50.322+0000","up_votes":1,"down_votes":0,"body":"el logaritmo de los mmr son los deportes de la vida real, en este juego es diferente\n\nel problema son las colas, entre menos gente, dificil que te empareje jugadores con tu habilidad, \n\nobvio que debe ser visible de manera personal y tu mismo si quieres compartir tu mmr que estas , pero por su proteccion no lo haran","replies":[]},{"poster":"Desaroll","date":"2015-06-27T01:06:24.334+0000","up_votes":1,"down_votes":0,"body":"Hayo!\n\nSi solo el tuyo es visible, no sabrías cual es el normal de tu división, así que estaríamos en la misma.\n\nAdemás, ¿Cuanta gente crees que dira: \"ah, por esto es\", y cuanta crees que vendrá al foro a quejarse, en lugar de por que gana o pierde X LP, por que ganó o perdió X MMR?\n\nEs lo mismo, solo que en lugar de hacerse problema por el LP, lo harían por el MMR.\n\nSuerte!","replies":[{"poster":"para2420","date":"2015-06-27T01:19:45.833+0000","up_votes":1,"down_votes":0,"body":"el MMR es casi lo mismo que el sistema de ELO, si buscas el rango normal del sistema ELO sabes tu MMR {{champion:201}}","replies":[{"poster":"jorxxx","date":"2015-06-28T08:00:10.227+0000","up_votes":1,"down_votes":0,"body":"basicamente creo que el emparejamiento te ayuda... viendo donde estan tus rivales y compañeros y deduciendo cuales son duo podes darte cuenta en que division esta tu elo.. por ej oro 5 jugando soloQ contra mayoria de plata 4 y 5 sabes que estas bajo pero de repente me gustaria saber que tan bajo.\nun caso.. esta temporada estan descontando mas elo en los duos a la persona mejor rankeada de losdos pero eso no lo clarificaron bien.\ntonces un oro juega con un amigo plata y si pierden hace bolsa al oro y al ganar beneficia al de mas abajo y poco al mejor rankeado entonces jugar duos con bastante diferencia de mmr es un mal negocio si no son personas que pueden sacarle ventaja considerable y todo eso no esta bien clarificado por parte de riot","replies":[]}]},{"poster":"jorxxx","date":"2015-06-28T07:51:13.526+0000","up_votes":1,"down_votes":0,"body":"el mmr promedio de cada division es de publico conocimiento creo, pero tenes razon... si la suma o resta de mmr es pareja segun por cada victoria/derrota no deberian quejarse pero igual encontrarian la manera de quejarse de eso o nos volveriamos muy paranoicos que necesito tantas victorias para llegar a tanto cosas asi","replies":[]}]}]}