{"poster":"Wandering Bunny","date":"2017-04-04T11:45:32.296+0000","title":"Why do I get less ping on NA than LAN","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":1,"body":"I live in south florida and although I play on NA servers I recently made an Account in LAN because I wanted to explore and see the differences in game in playstyle. Well apparently I get 60 ping but I live right here in south florida like whaat?. Aren't the servers located in miami? Shouldn't I get a lot less ping than I get on NA. My NA ping is 45. Anyway all I want is an explanation or maybe someone knows a way to fix it idk. My internet is fast so I know that's not the problem.","replies":[{"poster":"Photeks","date":"2017-05-04T07:47:38.404+0000","up_votes":1,"down_votes":0,"body":"I do believe they have moved the servers. Because the exact same situation happened to me. I used to always play on LAN because my ping was 8-10ms. Now it is 60ms. NA is 45ms. I live in Miami also btw.","replies":[{"poster":"Snakpak Guy","date":"2017-05-07T04:29:18.241+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Photeks,realm=NA,application-id=osqw6G4M,discussion-id=ZpOEaLQn,comment-id=0001,timestamp=2017-05-04T07:47:38.404+0000)\n>\n> I do believe they have moved the servers. Because the exact same situation happened to me. I used to always play on LAN because my ping was 8-10ms. Now it is 60ms. NA is 45ms. I live in Miami also btw.\n\nI moved to Miami a few days ago and am getting 49-51 constant. In Pittsburgh I was getting 30-35","replies":[{"poster":"HighEloTwitchTv","date":"2018-02-20T01:51:35.951+0000","up_votes":1,"down_votes":0,"body":"the ping was 15 because LAN server was in miami, but NA server had a constant 120 ping and everybody complained that cali had low ping and florida had high ping which led to unfairness in games. So they centralized the server in the middle of the US. It lowered ping for some people and higher ping for many others. Their goal was to try and have everybody with the same ping, even if it was 80 ping etc, as opposed to some ppl with 15 ping and others with 100 ping. Ping makes a huge difference in tower dives, CSing, and overall skyrocketing in elo, and securing smites was almost 100% even if the other jungler was 1 level higher, if your ping was insane. I miss the ping.","replies":[]}]}]},{"poster":"Porocles","date":"2017-04-04T16:20:42.653+0000","up_votes":1,"down_votes":0,"body":"The NA server is located in Chicago, but not LAN.  If you're in Florida, you may be closer to the LAN server.  Aside from physical distance, though, your ping can be higher if your connection is unstable or ISP is taking a longer way to route you to the game server.  To be sure, run through the [connection issues](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues) guide to tune things up.  It will strengthen up your connection but also help configure your DNS, which may change how you're routing.  Let me know if that clears things up!","replies":[{"poster":"Photeks","date":"2017-07-11T04:53:21.283+0000","up_votes":1,"down_votes":0,"body":"So what would i have to do to get my old ping back. I Found out that for some reason on LAN my connection is routing like all the way to central US then back to Miami. I've been using a third party routing program to get old ping back. So how would i fix this?","replies":[]}]}]}