{"poster":"DasGubby","date":"2016-03-27T13:23:32.642+0000","title":"bekomme keine Chests und Keys aufgrund Einschränkung","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":3,"body":"Liebe Community,\r\n\r\nda ich in letzter Zeit das ein oder andere mal geflammt habe steht jetzt nach jedem game \r\nSie wurden wegen vorherigen Verhaltensma&szlig;nahmen von den Belohnungen ausgeschlossen.\r\n\r\nIch wollte nun Fragen ob das f&uuml;r immer gillt oder nur f&uuml;r eine bestimmte Zeit, denn es steht\r\nkeine Zeit dabei..\r\n\r\nWeil f&uuml;r immer von den Belohnungen ausgeschlossen zu werden ist schon ein bisschen heftig ..\r\n\r\nDanke schon im Voraus f&uuml;r eure Antworten.\r\n\r\nL.G DasGubby","replies":[{"poster":"Sirrkas","date":"2016-03-27T13:44:18.805+0000","up_votes":5,"down_votes":0,"body":"Die Sperre gilt nicht für immer, kann aber für immer andauern. Es hängt jetzt hauptsächlich davon ab, was du machst. Spielst du viel und verhältst dich dabei vorbildlich, solltest du die Sperre schnell los sein. Spielst du nur sehr selten oder bist weiterhin toxisch, wirst du sie wohl nicht mehr los. Bei ersterem liegt es daran, dass das Abarbeiten wohl in Spielen gemessen wird. Letzthin meinte jemand, dass er nach ca 40 bis 50 Spielen nach der CR als reformiert galt.","replies":[{"poster":"DasGubby","date":"2016-03-27T13:50:23.199+0000","up_votes":1,"down_votes":1,"body":"ok ich flamme zurzeit eh garnicht mehr wenn mich jemand flammt mute ich ihn damit ich nicht Antworten muss.\nAber danke für die Antwort :)","replies":[{"poster":"Sirrkas","date":"2016-03-27T13:52:54.943+0000","up_votes":2,"down_votes":0,"body":"Das sollte helfen. \"gl hf\" am anfang und \"gg/gg wp\" am Ende helfen sicher auch, positiv aufzufallen. Wer weiß, vielleicht helfen sogar Ehrungen beim reformieren. Dazu noch vereinzelte \"gj\" und vielleicht noch \"sry my bad\" wenn was nicht nach Plan verlief um Flame vorzubeugen, helfen sicher auch. \n\nViel Spaß weiterhin.","replies":[{"poster":"DasGubby","date":"2016-03-27T14:10:44.231+0000","up_votes":1,"down_votes":0,"body":"ok danke haha :D","replies":[]}]}]}]},{"poster":"CoolMayo","date":"2016-03-27T13:24:47.676+0000","up_votes":1,"down_votes":6,"body":"Bei mir ist es auch so :/ Ist echt Blöd . Jeder Flamet Mal Jemanden und dann bekommt man 5 Spielen chat bann und wumms , Bekommt man keine Chests","replies":[{"poster":"ThisOneDiesALot","date":"2016-03-27T13:41:30.631+0000","up_votes":4,"down_votes":0,"body":"_\"Jeder Flamet Mal Jemanden und dann bekommt man 5 Spielen chat bann und wumms , Bekommt man keine Chests\"_\nWillste chests, dann hör auf Leute zu Flamen. Immer wieder witzig wie das gerne als \"Selbstverständlichkeit\" empfunden wird. Da wird kreuz und quer beleidigt bis sich die Balken biegen, aber \"kommt halt mal vor\".\n\nHör auf Leute zu Flamen und du wirst alle deine Chests haben dürfen.","replies":[{"poster":"DasGubby","date":"2016-03-27T13:46:18.053+0000","up_votes":1,"down_votes":1,"body":"Ja ich habe ja gesagt ich habe geflammt und ich es gebe es zu das ich mich daneben verhalten habe.\nDie frage war dennoch ob man nie wieder diese Belohnung erhalten kann oder irgendwann schon wieder..","replies":[{"poster":"Sirrkas","date":"2016-03-27T13:49:25.157+0000","up_votes":3,"down_votes":0,"body":"Er hat CoolMayo angesprochen. Die kursiven Zeilen sind Zitate von ihm.","replies":[{"poster":"DasGubby","date":"2016-03-27T13:52:22.043+0000","up_votes":1,"down_votes":0,"body":"Jaa wollte mich tdz rechtfertigen","replies":[]}]},{"poster":"Kiimahrii","date":"2016-03-27T14:24:14.517+0000","up_votes":1,"down_votes":0,"body":"_\"Die Frage war dennoch ob man nie wieder diese Belohnung erhalten kann\"_\n\nOffensichtlich verstehst du nicht den Grund, weshalb dir die Belohnung verwehrt wurden.\nDie Frage ist viel mehr ob du sich an deinen toxischen Verhalten etwas ändern wird.","replies":[]}]}]},{"poster":"DasGubby","date":"2016-03-27T13:26:13.060+0000","up_votes":1,"down_votes":2,"body":"niemals oder was?\n\nDas wäre ja voll be..... ich habe einen Kumpel der schon 10 mal 20min sperre hatte und sogar Belohnungen bekommt ..","replies":[{"poster":"Elthision","date":"2016-03-27T13:43:39.333+0000","up_votes":3,"down_votes":0,"body":"20 Min Sperren kommen nicht von negativem Verhalten. Wahrscheinlich ist er zu häufig während einem Spiel afk gegangen oder hat die Championauswahl verlassen. Deshalb kann er wahrscheinlich Belohnungen kriegen.","replies":[]}]},{"poster":"Sirrkas","date":"2016-03-27T13:45:44.956+0000","up_votes":4,"down_votes":0,"body":"Ich weiß nicht, wie das bei den meisten ist. Aber jeder hat sicher nicht schonmal im Chat geflamt. Ich hab da zum Beispiel noch nie Beleidigungen reingeschrieben.","replies":[{"poster":"DasGubby","date":"2016-03-27T13:49:35.768+0000","up_votes":1,"down_votes":2,"body":"ja es gibt hat unterschiedliche Arten von Menschen haha","replies":[{"poster":"ThisOneDiesALot","date":"2016-03-28T10:28:51.227+0000","up_votes":2,"down_votes":0,"body":"Und genau deshalb gibt es Regeln. Sie sorgen dafür, dass man trotz gewisser Unterschiede (die nicht so groß sind, wie manche vielleicht glauben), gemeinsam etwas erreichen können soll. Diese Regeln -- speziell jetzt für League -- dienen nur dazu, einen gemeinsamen Nenner zu finden, um den gegnerischen Nexus zu zerstören. Mehr sollen und können sie nicht leisten.\n\nWill man gemeinsamt mit anderen den gegnerischen Nexus zerstören, hält man sich an diese Regeln. Meint man hingegen, man sei jetzt was Besonderes und diese Regeln gelten für einen nicht in dem Maße, wie sie für andere gelten, dann hat man auch nix in diesem kooperativen Modus verloren. Denn man handelt entgegen den Regeln, die aufgestellt wurden, um innerhalb dieses sozialen Gefüges agieren zu dürfen.","replies":[]}]}]}]}]}