{"poster":"IronyAndSublime","date":"2019-07-24T10:51:41.173+0000","title":"It sure doesn't feel like Riot wants you to climb in ranked","subforum":"Gameplay","up_votes":66,"down_votes":6,"body":"This is very apparent when they encourage competitive League Of Legends like it's the second coming of Christ. ESPECIALLY the LCS advertisement no one asks for. (Really, no one actually cares until Worlds) \n\nYou get on a winstreak, and suddenly you're matched with pretty much only other high winstreak players, but THE MOMENT you guys lose, you get placed with other players who are losing their games. Then, you get stuck in that cycle of suffering and pain until you actually win again. Riot has intentionally made it so that even if you lose ONCE you're going to suffer 4 hours later.\n\nFrom what I've witnessed from each respective elo from variety of players (Whether it's extremely low Elo players who can't do anything right or Pro players who seem to be good at everything) have experienced this load of horse radish. \n\nI've seen mid master players drop to D1 because of this stupid crap happening to them. \n\nAlso, from my own personal experience (I'm not that good at the game, I know already) it's happened to me as well. I'm not even tilted and I get continuous losses\n\n\nEDIT: I also wanted to say, Ranked has created a false hierarchy and superiority complex across all Elos that are higher than another. People legitimately think they're better than someone because they pressed buttons better than the other person in a non-existent reality. ","replies":[{"poster":"winterslayer","date":"2019-07-24T10:53:37.270+0000","up_votes":28,"down_votes":1,"body":"Yes.\n\nI am currently on a 9th game ranked losing streak.\n\nDropped from nearly silver 1 to silver 4 in less than 48 hours. \n\nBronze here I come!!!","replies":[{"poster":"Death by Glamour","date":"2019-07-24T14:35:32.259+0000","up_votes":2,"down_votes":1,"body":"Do this almost every season, last year it took me from gold 1 down to silver 5 eventually. Climbed back up to gold 5 and called it a year and focused on getting gold in flex.\n\nOne thing i really hate is that you lose mmr from lost placement games.","replies":[]},{"poster":"Nadeokí","date":"2019-07-25T13:33:54.232+0000","up_votes":1,"down_votes":0,"body":"maybe take a break, like the loading screen tip occasionally suggests","replies":[{"poster":"BREXIT DENYER","date":"2019-07-25T14:24:06.620+0000","up_votes":1,"down_votes":0,"body":"Ngl, taking breaks and having the right mindset does make it way easier to climb. Also getting used to the fact someone may go 5/20/0 in your game once in a while helps a lot. I've gotten used to the fact ima get the occasional toxic Yasuo main which has made it easier to climb.\n\nAs much as league punishes for losing streaks, they do reward for winning streaks. I managed to go maybe 19W and 1L in 20 games at my peak which pushed me from S3 to about G2 (after being hardstuck S3/4)","replies":[]}]}]},{"poster":"Tuition Fee","date":"2019-07-24T11:45:23.365+0000","up_votes":19,"down_votes":0,"body":"Wasn't there a challenger Vel'koz smurf who made a smurf and that's hardstuck diamond?\nI watched some of his games and at one point iirc the enemy had four challengers while his team was full diamond.","replies":[{"poster":"Nadeokí","date":"2019-07-25T13:35:27.829+0000","up_votes":1,"down_votes":0,"body":"You can be in challenger but have Platinum MMR or be Platinum with Challenger MMR.\n\nThat is, what decides matchmaking, not your LP","replies":[{"poster":"Inari Fox Orrion","date":"2019-07-25T22:03:01.321+0000","up_votes":3,"down_votes":0,"body":"Why does the rank system exist, then?","replies":[{"poster":"Leetri","date":"2019-07-26T09:44:54.954+0000","up_votes":1,"down_votes":0,"body":"To make you feel better and for it to be more tangible, that's literally the only reason and Riot has said as much. \"Platinum 3\" sounds more tangible than say \"2378 MMR\" and it's way easier to understand. If I say \"3000 MMR\", how do you know if that's good or bad? I'd have to tell you the scale as well for you to have any reference. But if I say \"I'm diamond rank\" that immediately tells you I'm pretty good, because diamonds are pretty valuable in real life.","replies":[{"poster":"Inari Fox Orrion","date":"2019-07-27T00:49:10.676+0000","up_votes":1,"down_votes":0,"body":"but that's a matter of human social construct, not of what's **actual, genuine and true.** You can be Diamond with Bronze MMR, or you can be SIlver with Gold MMR. The system's meaningless to anyone involved for the reason \"3,000 MMR\" is meaningless to anyone who isn't: a lack of context.","replies":[]}]}]}]},{"poster":"Nithke","date":"2019-07-24T14:37:18.182+0000","up_votes":2,"down_votes":0,"body":"Sardoche?","replies":[{"poster":"Tuition Fee","date":"2019-07-24T14:50:07.912+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Nithke,realm=EUW,application-id=3ErqAdtq,discussion-id=UJAPf8V0,comment-id=00020000,timestamp=2019-07-24T14:37:18.182+0000)\n>\n> Sardoche?\n\nScary Velkoz or something, he's the really nice guy who made the post about how nice Sneaky and Riot games were to him.","replies":[{"poster":"Nithke","date":"2019-07-24T15:57:59.681+0000","up_votes":1,"down_votes":0,"body":"Ooooh ok ty","replies":[{"poster":"ADC 1v9 GG","date":"2019-07-24T17:35:24.441+0000","up_votes":3,"down_votes":0,"body":"mdrrr sale mongo","replies":[]}]}]}]},{"poster":"Heckin Support","date":"2019-07-25T23:21:05.224+0000","up_votes":2,"down_votes":1,"body":"I'd feel bad for the guy if you left out the word smurf.\nFuck people who smurf.","replies":[{"poster":"Tuition Fee","date":"2019-07-26T18:54:10.969+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Heckin Support,realm=NA,application-id=3ErqAdtq,discussion-id=UJAPf8V0,comment-id=00020002,timestamp=2019-07-25T23:21:05.224+0000)\n>\n> I'd feel bad for the guy if you left out the word smurf.\n> Fuck people who smurf.\n\nIn the post he mentioned he was invited to join NA, iirc. \nSo not really smurfing on purpose, just wanted to join us.","replies":[]}]}]},{"poster":"22 Caliber Rifle","date":"2019-07-24T16:01:36.242+0000","up_votes":13,"down_votes":1,"body":"The system has always had flaws. My problem is when you are paired with players who don't have a clue what they are doing and proceed to feed the game no matter what you do, you can get them 5 kills and they will still go 5/20/0. My main account which is this one has low MMR and the system is trying to put me back in Silver because I've lost so many games because of bad players (BTW I don't blame myself anymore for supposed mistakes its pointless) while my alt account is Plat 1 LV 42. I tend play ranked on the alt more then my main because of players. \n\nThe Ranked system forces you to lose games, it tries its hardest to pair you with bad players when you are on a winning streak then when you lose it proceeds to give you shit players constantly. If the system was based on your individual performance instead of your feeding teams performance it would be better.\n\nWhen I talk about a Individual Performance system, it would identify how you performed each game including how impact-full you were, have you got kills from ganks and etc in which if you lose it would give you -5 instead or -24","replies":[{"poster":"KlydeFrog","date":"2019-07-25T05:02:52.687+0000","up_votes":2,"down_votes":0,"body":"So what your saying is that like me you were a fan of the role ranked system which was good in my opinion.cause you actually ranked up faster due to lp gains and if you traded you got more lp","replies":[{"poster":"22 Caliber Rifle","date":"2019-07-25T07:14:34.384+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=KlydeFrog,realm=NA,application-id=3ErqAdtq,discussion-id=UJAPf8V0,comment-id=00030001,timestamp=2019-07-25T05:02:52.687+0000)\n>\n> So what your saying is that like me you were a fan of the role ranked system which was good in my opinion.cause you actually ranked up faster due to lp gains and if you traded you got more lp\n\nNo lol, never played the role system considering my server is based in Oceania. That system is literally broken and had too many bugs in it. Riot needs to sort their shit together hopefully. In my opinion as said before they need a system that gathers information on the individuals performance. As long as they add a system like this, i'm happy even if they added it on top of the bs we have now, as long as I slightly get punished less for going 15 kills / 3 deaths / 20 assist and still lose because of players literally running it down or afk. This would include ganking, lane control, minions, objective control a nd some other balanced system mechanics. \n\nIf some system doesn't get implemented to fix these changes I hope they will remove the Low MMR BS so I can actually gain LP not win 13 lp and lose 24..... that's what I have now on my main acc. My alt does not >:(.\n\n[https://oce.op.gg/summoner/userName=Gliave](https://oce.op.gg/summoner/userName=Gliave) Proof that i'm not lying and MVP and ACE mean absolutely nothing ","replies":[{"poster":"Nadeokí","date":"2019-07-25T13:40:59.335+0000","up_votes":1,"down_votes":2,"body":"K/DA has nothing to do with the game's outcome. A System couldn't tell if you did well because you were 4/10/30.\nToo many factors involved, like dying for a shutdown gold or securing drake, baron, inhib... stuff like that. K/DA basically only matters if you're trying to stack Darkseal...","replies":[{"poster":"Inari Fox Orrion","date":"2019-07-25T22:06:40.955+0000","up_votes":1,"down_votes":0,"body":"A positive KDA means you feed less gold to the enemy team. A negative KDA means you feed more gold to the enemy team. I'm sure you'd rather have my 13/5/12 Ahri over someone elses' 5/10/10. Even then, a performance-oriented system a' la' CS:GO would include stuff like objectives and ganks and wards and all that jazz and compare it to the average of a rank. If you're sub-par, you gain less for a win and lose more for a loss. If you're above-par, you gain more and lose less. They've already proven it possible with their champion analysis and ranking, where you get an S+ if you're the only one doing jack on the team.","replies":[]}]}]}]},{"poster":"Arcanine19","date":"2019-07-24T23:29:28.498+0000","up_votes":1,"down_votes":4,"body":"I've smurfed and I know that there are a lot of games where you cant win no matter how good you do but I gotta say that its hard to believe that you would have problems climbing out of G4 if you really had a ''alt acc in plat 1''\n\nEdit: To everyone who's downvoting this yeah I know It sounded rude from me but if any of you really had a plat 1 account you would know how easy it is to carry a gold IV game (THIS SAID IF you do deserver higher rank, im not expecting a gold IV to carry a gold IV game ofc)  Im sorry for telling you the sad truth you don't wanna hear just because you can't climb.\nEdit 2: I can only understand the support mains not being able to carry a game down there.","replies":[{"poster":"22 Caliber Rifle","date":"2019-07-25T02:13:09.315+0000","up_votes":1,"down_votes":0,"body":"I’m not saying that you are lying or anything but it seems you haven’t smurfed before. I’m going to refer to an earlier post I made similar to the topic. There have been instances where even high master and challenger players have found it difficult to get out of low elo on their smurfs, one example is Dopa on the Korean server who on his stream lost 3 silver games in a row. It may not sound bad but considering that he is a challenger player he shouldn’t more be losing these games right?, no they all literally fed their asses off to the point that it was impossible to win no matter what. You can google for sources and proof.\n\nNow I’m not the most perfect player in the world and I’m no god at this god forsaken game but I do grasp the concepts of winning games and how to do it, especially how I’m a jungle main. My problem is that if I’m forced to play on a smurf just to be a higher rank then my main account that’s a problem. There should be no reason for anyone to have a smurf account you get no benefit from it but in my case, realistically the only reason I have a smurf is because of being hard stuck gold and having really poor MMR that lets me win 14 and lose 22+. This tends to be a trend across all regions.","replies":[{"poster":"Arcanine19","date":"2019-07-28T01:47:29.103+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Gliave,realm=OCE,application-id=3ErqAdtq,discussion-id=UJAPf8V0,comment-id=000300000000,timestamp=2019-07-25T02:13:09.315+0000)\n>\n> I’m not saying that you are lying or anything but it seems you haven’t smurfed before. I’m going to refer to an earlier post I made similar to the topic. There have been instances where even high master and challenger players have found it difficult to get out of low elo on their smurfs, one example is Dopa on the Korean server who on his stream lost 3 silver games in a row. It may not sound bad but considering that he is a challenger player he shouldn’t more be losing these games right? \n\nhttps://imgur.com/a/PRScKVn\nhttps://imgur.com/a/B5wRm39\nAs I said in my post ''I know that there are a lot of games where you cant win'' but that doesnt mean that ALL OF THEM are like that. You have more chances of having feeders on the enemy team on average than on yours since you only have 4 team mates and 5 enemies so even if you find feeders you'll find them on both team. The lower you are the EASIER it is to carry, thats facts. Im not saying you can outplay the fed master yi on the enemy team as a Kha'zix or Kindred but theres a lot of mistakes that you can capitalize on lower elo games to carry.","replies":[{"poster":"22 Caliber Rifle","date":"2019-07-28T04:55:17.282+0000","up_votes":1,"down_votes":0,"body":"*facepalm","replies":[]}]}]}]},{"poster":"TailsDoll ","date":"2019-07-25T22:05:01.678+0000","up_votes":1,"down_votes":0,"body":"Just use de S A B C D system for the LP gains. Lost but still got an S? Well here you go just a 3 lp lost. Won but got an C-? Well here have 4 LP. That way you can also stop bad players from getting carried.","replies":[]}]},{"poster":"FireDrizzle","date":"2019-07-24T11:21:13.557+0000","up_votes":7,"down_votes":0,"body":"I was plat from season 7 but im now Gold. Funny thing is I was winning a lot of games in plat then suddenly losing constantly. And apparenly there is rank inflation and it should be easier too be high rank{{sticker:sg-lux-2}}","replies":[]},{"poster":"Meteora707","date":"2019-07-24T18:54:07.664+0000","up_votes":9,"down_votes":3,"body":"forced losstreaks are a thing and everyones known this for a long long time now.","replies":[{"poster":"Nadeokí","date":"2019-07-25T13:42:18.721+0000","up_votes":1,"down_votes":2,"body":"You are the reason you lose games. Smurfing players, who reach Masters with 3-5 games loss Total prove that time and time again","replies":[{"poster":"Meteora707","date":"2019-07-25T14:33:50.113+0000","up_votes":1,"down_votes":0,"body":"oh yeah I can also play to dia with 90% wr while duo abusing, the thing is that duo abusing bypasses the system since 2 good players can carry 3 shitters, the smurfs that play for the boost also dodge a fuckload of games that are autolosses, nobody goes organically to masters as a soloQ player with 3-5 losses.","replies":[]}]}]},{"poster":"l MrD l","date":"2019-07-24T22:21:59.546+0000","up_votes":3,"down_votes":0,"body":"it happens to everyone - i rememember making a post about this sort of thing a long time ago and it got downvoted and i just got told i was tilted...\n\nI should be placed with and vs people of my own level ... i shouldnt be tested to carry by carrying people who cant help themselves thats not fair at all ... if i lose then i lose i get up and try next game? Wrong constantly happens many games in a row where you get demoted...\n\nBut the more i think about it majority and most players in the world are apparently silver right? That cant be a coincidence ... if we all climb easily to challenger or grandmaster then wed probably stop playing or something? I feel like this system as it is is designed to keep is low or prvent many players climbing...\n\nI get theres strategy and ways to climb but ive experienced too many games lately of troll things or people not wanting to win .... *looking at that caitlyn support and that mundo who sat in enemy base*","replies":[]},{"poster":"Barkley","date":"2019-07-24T21:55:51.709+0000","up_votes":3,"down_votes":0,"body":"I'm done with SR ranked in general until something changes.  Its just not worth the stress.\n\nEspecially watching two of my friends -- who will readily admit I'm a vastly better player than they are -- rank higher than me.\n\nI just have terrible luck with AFKs and shit.  Seems like it just follows me around.\n\nI stream occasionally and I've even had viewers comment on it.  Its absolutely outrageous how many games I lose because someone goes AFK, or I get something like a 0-14 inting mid laner.\n\nI'll do ranked when its an actual reflection of my skill, and not a reflection of how lucky I got with competent/participating team mates.\n\nTFT ranked is more fun.  I've got nobody to blame but myself if I win or lose.  Its my own decisions and my own skill that decide the game -- and I think that's a much more rewarding experience.\n\nI'm also damn near platinum in the first few weeks, and still climbing rapidly.","replies":[{"poster":"Razelth","date":"2019-07-24T23:42:10.055+0000","up_votes":2,"down_votes":9,"body":"Jesus christ lol. If you're good enough, you can literally win 4v5s in silver. But hey, better blame the system because I'm just not good enough to climb haha.","replies":[{"poster":"Barkley","date":"2019-07-25T01:32:36.384+0000","up_votes":1,"down_votes":0,"body":"I literally said in my post that I'm not good enough.\n\nWeird flex, but ok.","replies":[{"poster":"Razelth","date":"2019-07-25T02:07:58.714+0000","up_votes":1,"down_votes":7,"body":"Then why are you complaining about not the ladder being luck based?? Jesus fuck lol.","replies":[{"poster":"Barkley","date":"2019-07-25T02:20:03.628+0000","up_votes":1,"down_votes":0,"body":"In any given SR game, I have 4 chances to have someone on my team that's going to int, feed, actively troll, or disconnect.\nI also have 5 chances on the enemy team to have a diamond+ smurf streaming his \"Bronze to Diamond\" stream.\n\nI am not good enough to beat these things, and so I don't enjoy it.\n\nIn TFT, none of that matters.  All that matters is how I play and what I do with the cards I'm dealt.  People can troll all they want, it only ever benefits me.  People can disconnect all they want, it only benefits me.  People can run stupid ass comps for the luls and I don't care, it only benefits me.\n\nI'm nearly platinum and still gaining 60+ LP for first place victories, and only losing 15-30 for 5th place and below.  Climbing rapidly.\n\nIt feels good to have an expression of my own skill instead of being at the mercy of the team mates and opponents I'm given.\n\nOP.GG has this thing called \"ACE\" and \"MVP\" on their stats readouts.  Means you were the best player on the team statistically.  MVP if you won.  ACE if you lost.  When I get serious about ranked, my stats are MVP ACE ACE ACE MVP ACE MVP ACE ACE ACE ACE.\n\nBut none of that matters.  It doesn't matter that I was the best player on my team.  I can go 30-0 and get 8 towers by myself (exaggeration, obviously), but it doesn't matter if one of my team mates goes AFK or starts actively trying to lose because they got mad about something.  I go down with the ship.  Period.\n\nThat doesn't feel good.  That feels the opposite of good.\n\nI'm sorry it bothers you that I don't enjoy the system.\nBelieve it or not, its ok that we don't like the same things or agree.  You can still be you, and I can still be me.","replies":[{"poster":"Razelth","date":"2019-07-25T02:49:34.146+0000","up_votes":1,"down_votes":4,"body":"That op.gg stat does not matter.\n\nYou have 5 chances for someone on the enemy team to int your team and win you the game too btw.","replies":[{"poster":"Barkley","date":"2019-07-25T03:59:01.927+0000","up_votes":2,"down_votes":0,"body":"Yes, and it probably feels really bad for them, too.  My enemies having an equal chance at not having fun doesn't increase my chances of having fun.\n\nI don't like winning against AFKs or trolls any more than I like losing to them.\n\nPlayers should be judged based on their individual skill as well as their contributions to their team -- not whether or not someone threw a temper tantrum and threw the game on purpose.\n\nI don't know why this is such an inflammatory thing for you -- you've been in games where this has happened to you.  You didn't enjoy it.  Its not fun.  You got mad about it, and you thought to yourself \"I should have won that, but one single player decided the outcome of the game, and that's not fair.\"\n\nEveryone has been through this.  From Iron to Challenger.\n\nCongrats on being a better player than me?  Do you want me to say I'm proud of you?  Like... I don't know what you're looking for here.\n\nThat kind of outcome to a game isn't fun for me, and it happens way too much for me to enjoy playing ranked on SR.\n\nThat shit doesn't happen in TFT.  I enjoy TFT.  I'm gonna play TFT.","replies":[]}]}]}]}]}]}]},{"poster":"Ηuawei","date":"2019-07-24T21:49:10.564+0000","up_votes":3,"down_votes":0,"body":"When i got on losing streaks its usually 20 games in a row.\n\nNo matter what i do or play i always end up losing to the point i end up taking months break to forget all about it","replies":[]},{"poster":"DiscWizard1","date":"2019-07-24T20:17:08.125+0000","up_votes":3,"down_votes":0,"body":"I agree. The problem also seems to stem from the fact that you can go 15-0-10 or something and gain 18-20 LP. Then lose where you are the only one on your team positive, or even remotely useful. And lose just as much. \nAnother problem I see is the favoring those who play an obscene amount. This is caused by promos getting easier every time you reach them, as well as the way wibstreaking works, if you get carried a couple times in a row you are more likely to be put on teams able to carry you.\n\nMy solution, make Sr gains losses a much wider range 5-35 and almost entirely dependent on performance. With slants towards things like objective takes. (With markers on champs/roles to whichobj you should be helping with.\nFor example. If support goes and helps take Herald at 13 min but ADC either dies and gives up bot tower or has to back off and give up bot tower. That should be a net loss for support. But if say top does a similar play and sacrifices some or all of top tower to take Herald and take mid that should be positive as that's overall better for the team (mid tower allows better map control)\nSimilarly split push champs gain Sr equity when they take side lane towers (more if they do it without losing another obj on map) but an ADC or teamfight control mage should lose Sr equity  if they trade major obj. Obviously they gain if the take without losing anything as well. \n\nTldr\n\nRemove promos and make LP the only determiner for not only ranks, but also matchmaking. Fuck hidden MMR it's actually bullshit. \n\nMake it a whole lot easier to clime if you pop off every game, make it alot easier to tank if you are carried. Encourage grouping on champs meant to group and splitting on champs suited to splitting.","replies":[]},{"poster":"Raiyza","date":"2019-07-24T19:33:50.805+0000","up_votes":3,"down_votes":0,"body":"Well, of course they dont. \n\n1) They want only the best players (the guys that have supercomputer reaction times) to climb\n2) they want you to keep trying, and keep playing.","replies":[]},{"poster":"PotPye","date":"2019-07-24T19:49:22.462+0000","up_votes":4,"down_votes":1,"body":"Riot needs to learn that there will always be trash players. And instead of trying to make trash feel like they're good at the game by getting carried they should just match them with more trash. The bad players would fight other bad players and all the people who aren't trolls and actually want to progress in ranked can actually climb. It's my first season playing league and I was just silver 1 18lp and dropped to silver 2 30 something lp partly because of being paired with people on 5 game loss streaks and because my client decided to die when I started some rank games","replies":[]},{"poster":"Night M0nkey","date":"2019-07-24T18:42:04.281+0000","up_votes":4,"down_votes":1,"body":"Had this too. Soared from silver 5 to silver 1 on a massive win streak. \nNow I'm in constant danger of demotion to silver 3 again and can't climb anymore, despite how often I dominate my lane. We get smurfs, afkers, trolls, and feeders, one match after another now. \n\nTheir matchmaking system needs a revamp. But then, they can't figure out how to balance champs so I guess we shouldn't expect much balance in the rest of the game.","replies":[]},{"poster":"Teh Song","date":"2019-07-24T21:01:06.302+0000","up_votes":6,"down_votes":7,"body":"Riot doesn't want you to climb.\nThey also don't want you to fall.\nNor do they want you to stay where you are.\n\nThey want you to be at the elo and mmr that equates to your actual skill level.\n\nAll these conspiracle ideas about the system making you go on lose streaks is just nonsense.\nYour skill level is X. You won some matches. You're mmr and elo rose to X+Y. You are now in matches you aren't skilled enough for. You lose.\n\"But this teammate of mine is a different rank than me.\" Yea. And his mmr is the same as yours. Or at the very least, he was the closest to you available, and the matchmaker decided you should't have to wait too long for someone closer.","replies":[{"poster":"Godlzahar","date":"2019-07-24T21:43:54.611+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=Teh Song,realm=NA,application-id=3ErqAdtq,discussion-id=UJAPf8V0,comment-id=000f,timestamp=2019-07-24T21:01:06.302+0000)\n>\n> Riot doesn't want you to climb.\n> They also don't want you to fall.\n> Nor do they want you to stay where you are.\n> \n> **They want you to be at the elo and mmr that equates to your actual skill level.**\n> \n> All these conspiracle ideas about the system making you go on lose streaks is just nonsense.\n> Your skill level is X. You won some matches. You're mmr and elo rose to X+Y. You are now in matches you aren't skilled enough for. You lose.\n> \"But this teammate of mine is a different rank than me.\" Yea. And his mmr is the same as yours. Or at the very least, he was the closest to you available, and the matchmaker decided you should't have to wait too long for someone closer.\n\nHow i can win a game when they go afk after they feed or you have int feeders at bot? Because this happen at 60% of my games","replies":[]}]},{"poster":"Hozoki","date":"2019-07-25T11:08:44.859+0000","up_votes":2,"down_votes":0,"body":"Same... I was maybe a win or 2 from promos to rank past gold lost a game and all of a sudden I'm jumping down to G3 I get off for the day b4 I punch a hole into my laptop and try next day. Next day same thing and I m down in like 3 or 4 I haven't played in a week because that is so frustrating. I don't mind losing, but like when Its so one-sided the game seems determined b4 I even hit the accept button, it's gets hopeless.","replies":[{"poster":"5050BS","date":"2019-07-25T22:16:11.331+0000","up_votes":1,"down_votes":0,"body":"Its not even just that.\n\nYou can have a 55% win rate and no climb because Riots MMR LP system shits on you.\nWhen you win 6 LP and lose 14 LP you need to run like a 76% win rate to climb.  Anything less and you are falling.\n\nFew people can win that much in this RNG Troll fest of SoloQ.\n\nRiot needs to make LP gains/losses the same.  That way you will rise and fall your true rank.  But Riot is not interested in your True rank.  They are interested in keeping you playing so you will buy skins.","replies":[]}]},{"poster":"Flying Chankla","date":"2019-07-25T10:15:29.125+0000","up_votes":2,"down_votes":0,"body":"I can 100% agree with this comment! Everyday I check my OP.GG and LolSumo apps to see my progress and just about every game I'm playing at a Gold-Plat level of play, yet I'm always stuck with losing and feeding and toxic teams! At one point I was S2 in promos to go to S1 and the within the week I drop to S4. Now I've been hard stuck S4 for the past month and theres nothing I can do about it because I'm stuck with feeders every other game! All I'm saying is if I'm Silver, there should be Silver level players on my team, not bronze or iron. This NEEDS to be fixed! \n\nAlso, LP needs to be fixed aswell. I lose twice as much LP as I gain, its not fair to gain 12-14 on a win but lose 20-22 on a loss, its LITERALLY IMPOSSIBLE to climb. There are many other things I believe should be fixed aswell, such as: DNC within first 5 minutes should allow you to remake, if someone is obviously feeding they should lose more LP than those trying, autofilled games shouldn't be counted as full LP games for when you lose, etc. But the main one was, I 100% AGREE, is the matchmaking FOR SURE.","replies":[]},{"poster":"xelaker","date":"2019-07-25T02:41:35.753+0000","up_votes":2,"down_votes":0,"body":"To climb you have to be better than your opponent AND get lucky that one of your teammates deaths aren't in the double digits...","replies":[]},{"poster":"Nairoval","date":"2019-07-25T00:33:24.636+0000","up_votes":2,"down_votes":0,"body":"I have opened many tickets with Riot on this subject. Even while on winning streaks and clawing my way out of Gold 4 I was instantly placed with Bronze 4 players when I hit Gold 3, not only that they had a less than 40% win rating. Regardless of how consistently you play the game will match you with a faster match instead of a more balanced one.\n\n\"We greatly appreciate your feedback. I know that it is frustrating to have unmatched matches. Especially if you’re already in a higher rank. It’s great to see everyone to be around your skill level.\n\nHowever, as much as we would love to give you an experience like that, we would not want you to wait forever to get into a match. So, our matchmaking system has to broaden its search for players. That being said, it does not compromise on the fairness of the match.\" - Dizzy Dino, Riot Support\n\nThe only way around this is to have some sort of social media presence or be a content creator so they will give you priority placement in matches. If you don't give them additional funding through your videos they do not care about you or your climb.","replies":[]},{"poster":"GL at MCdonaldss","date":"2019-07-25T00:15:44.990+0000","up_votes":1,"down_votes":0,"body":"I found a way to overcome this thing. I call it the 2 game rule. Basically you play until you lose 2 games in a row. If you get to the point when you are losing 2 games in a row you take a about a hour break, you can play normals if you want. After the break play again until you lose 2 games in a row.If you need proof that it works take me: i've been a gold player since season 5 i dont watch guides and stuff so everything i know its from practice, but i could not climb out of gold, until i used this trick and got to plat so easy it blew my mind. This season i quited the game for a while and when i came back my pc broke so i only got to g1 but when ill fix my pc ill easily get to plat and next season for sure ill get to diamond.","replies":[]}]}