{"poster":"Lightkîzaru","date":"2019-06-07T18:20:48.869+0000","title":"Warum Smurft man ?","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":2,"body":"Hallo und zwar bin ich neu in diesem Game und wollte mal fragen warum so viel gesmurft wird  ich war heute noch  8 und konnte leider nicht Jungeln  was man ja leider erst ab 9 kann  wie mir aufgefallen ist  aber die leute waren unter 9 alle Komplet  Brain afk es war so leicht Games zu gewinnen und jetzt wo ich  10 bin ist es unmöglich zu gewinnen  weil die gegner teams aus 90% SMurfs bestehen warum  Smurft man ? was hat das für einen sinn haben die Leute zu kleine ..... oder warum wtf.","replies":[{"poster":"degnareD","date":"2019-06-07T23:41:24.435+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Lightkîzaru,realm=EUW,application-id=KYnfKGf0,discussion-id=kkL30WQt,comment-id=,timestamp=2019-06-07T18:20:48.869+0000)\n>\n> haben die Leute zu kleine ..... \n\nthis!\nPathetische Hardstucks, die in der eigenen Elo nix mehr gebacken kriegen und deshalb Anderen aus Langeweile das Spiel vermiesen. Sollte strikt verboten werden!","replies":[{"poster":"MidlaneGod115","date":"2019-06-08T00:37:24.757+0000","up_votes":4,"down_votes":0,"body":"Jeder der eine WR >50% hat ist ein Smurf","replies":[]},{"poster":"MeMyselfandBaal","date":"2019-06-08T03:56:14.814+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=degnareD,realm=EUW,application-id=KYnfKGf0,discussion-id=kkL30WQt,comment-id=0004,timestamp=2019-06-07T23:41:24.435+0000)\n>\n> this!\n> Pathetische Hardstucks, die in der eigenen Elo nix mehr gebacken kriegen und deshalb Anderen aus Langeweile das Spiel vermiesen. Sollte strikt verboten werden!\n\nWenn jemand sich entweder künstlich durch absichtliches verlieren oder durch verbotene Praktiken wie das Kaufen von Accounts einen Smurf erschafft, der auf deiner Elo rumgurkt, bin ich da sogar absolut bei dir. Und ja, jeder Smurf, der sich an die von LoL erstellten Regeln hält, wird niemals in Bronze landen. Und Smurfs, die sich mit Absicht da rumtreiben, gehören gebannt.\n\nAber alle Smurfs in diese Kategorie zu schieben, ist auch übertrieben.","replies":[]}]},{"poster":"Fluxx","date":"2019-06-07T21:49:02.586+0000","up_votes":3,"down_votes":0,"body":"_**Willkommen in der Kluft der Beschwörer, Lightkîzaru!**_\n\nManche Beschwörer mögen das Gefühl von 0 auf 100 erneut viele Ränge aufzusteigen, da es frustrierend sein kann, im Rang fest zu stecken.\n\nEinige unter Ihnen nutzen Smurfs um mit Freunden spielen zu können, da man ab einem bestimmten Rangunterschied in der Rangliste nicht mehr gemeinsam ein Match bestreiten kann.\n\nIch vermute aber dass es nicht nur Smurfs sind gegen die du verlierst. Wenn du viel gewinnst wirst du mit der Zeit auch stärkeren Beschwörern gegenüberstehen. In diesem Falle darfst du dich geehrt fühlen, weiter so!","replies":[]},{"poster":"MeMyselfandBaal","date":"2019-06-07T18:44:57.430+0000","up_votes":2,"down_votes":0,"body":"Um als Sup Main neue Rollen und Champions zu lernen. Da stößt man im Normal Draft halt an seine Grenzen.\n\nAngefangen habe ich damit, bevor es die Rollenauswahl vor der Champ Select gab, weil mir bewusst wurde, dass ich immer eine Last für mein Team bin, wenn ich mal nicht Support spielen kann... obwohl ich die Chanpions, die ich dann in der Toplane gepickt habe, durchaus vorher im Normal Draft geübt habe, wurde ich in diesen Spielen regelmäßig verprügelt.\nJetzt, auch wenn ich es für mein eigenes Ranked nicht mehr brauche, habe ich ein wesentlich besseres Verständnis darüber, wie Champions von der Mid oder Toplane, die ich da unten seltener sehe, funktionieren, was mich zu einem besseren Spieler macht.","replies":[{"poster":"need elo police","date":"2019-06-07T18:53:45.966+0000","up_votes":1,"down_votes":0,"body":"Man kann nicht an seine Grenzen stoßen wenn es keine Grenzen gibt. Niemand interessiert sich für einen Sieg oder eine Niederlage wenn es um nichts geht. Warum sollte man? Wenn du den ersten Sieg des Tages willst, kannst du auch schnell ein Bot Game machen.\n\nNormals sind dafür da, um eben solchen Spielern wie dir eine Plattform zu bieten. Ich vermute eher, dass du regelmäßig von deinen Mates fertig gemacht wurdest weil du zu schlecht warst und daraufhin keine Lust mehr hattest anstatt einfach weil du in der Lane zerstört wurdest. Natürlich möchte man gewinnen, aber gerade Normals sind eben dafür da neue Sachen auszuprobieren, weil es da um nichts geht. \n\nGegen neue Spieler irgendwas auszuprobieren oder zu trainieren, obwohl die überhaupt noch keinen Plan von dem Spiel haben, halte ich für den völlig falschen Ansatz. Denn so denkst du, du machst in manchen Situationen alles richtig, obwohl du eigentlich alles falsch machst. Und nur gewinnst, weil der Gegner halt keinen Plan hat. Dann spielst du im nächsten Spiel wieder auf deinem Main und bekommst wieder auf den Sack und denkst dir dann, was du falsch gemacht hast. Und um das vorzubeugen, sollte man eben gegen Spieler spielen, die schon mehr Erfahrung haben. Auch wenn du zerstört wirst. Deswegen geht es um nichts, Sieg oder Niederlage ist dabei irrelevant.","replies":[{"poster":"MeMyselfandBaal","date":"2019-06-07T19:29:34.689+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=need elo police,realm=EUW,application-id=KYnfKGf0,discussion-id=kkL30WQt,comment-id=00010000,timestamp=2019-06-07T18:53:45.966+0000)\n>\n> Man kann nicht an seine Grenzen stoßen wenn es keine Grenzen gibt. Niemand interessiert sich für einen Sieg oder eine Niederlage wenn es um nichts geht. Warum sollte man? Wenn du den ersten Sieg des Tages willst, kannst du auch schnell ein Bot Game machen.\n>\n\nSoll mich das jetzt unterstützen? Also ja, genau das war mein Problem im Normal Draft und damit der Grund, warum ich neue Champions auf dem Smurf in Silber ausprobiert habe. Denn wenn es dem Gegner egal ist, ob er gewinnen will oder nicht, lerne ich halt weniger, wenn ich mich mit ihm messe.\nDasselbe Problem habe ich nebenbei auch mit der Flexque: Niemand nimmt sie wirklich ernst und darunter leidet die Spielqualität.\n \n> Normals sind dafür da, um eben solchen Spielern wie dir eine Plattform zu bieten. Ich vermute eher, dass du regelmäßig von deinen Mates fertig gemacht wurdest weil du zu schlecht warst und daraufhin keine Lust mehr hattest anstatt einfach weil du in der Lane zerstört wurdest. Natürlich möchte man gewinnen, aber gerade Normals sind eben dafür da neue Sachen auszuprobieren, weil es da um nichts geht. \n> \n\nMein Problem ist halt, dass das meine MMR im Normal Draft ziemlich ruiniert sein dürfte. Oder das Spielniveau dort allgemein niedriger ist, als in der Solo im hohen Silber Bereich. Ich konnte eben im Normal Draft nichts lernen, was ich dann hinterher in Platin anwenden konnte. In der SoloQue im hohen Silberbereich funktionierte dies. Ich sage allerdings auch, dass jemand, der die Saison nicht in Platin beendet, einen Smurf braucht, denn darunter hast du recht: da kannst du auch im Normal Draft neue Dinge üben. Darüber stößt du im Normal Draft, was den Lerneffekt betrifft, halt an deine Grenzen...\nOh und ja, ich bin seit Jahren dafür die Normal Draft MMR wenigstens halbwegs an die Ranked MMR anzupassen. Ich habe die \"Andere Que, andere MMR, finde dich damit ab, dass das Midlane Matchup aus Diamond vs Bronze besteht\" Logik nie verstanden. Aber da bin ich in der Minderheit, also habe ich mich angepasst.\n\n> Gegen neue Spieler irgendwas auszuprobieren oder zu trainieren, obwohl die überhaupt noch keinen Plan von dem Spiel haben, halte ich für den völlig falschen Ansatz. Denn so denkst du, du machst in manchen Situationen alles richtig, obwohl du eigentlich alles falsch machst. Und nur gewinnst, weil der Gegner halt keinen Plan hat. Dann spielst du im nächsten Spiel wieder auf deinem Main und bekommst wieder auf den Sack und denkst dir dann, was du falsch gemacht hast. Und um das vorzubeugen, sollte man eben gegen Spieler spielen, die schon mehr Erfahrung haben. Auch wenn du zerstört wirst. Deswegen geht es um nichts, Sieg oder Niederlage ist dabei irrelevant.\n\nIch probiere ja explizit nichts gegen neue Spieler aus sondern im Ranked. Und ich denke nie, dass ich alles richtig mache, aber ich sehe den Fortschritt in meiner Entwicklung als Midlaner: Dieses Jahr musste ich am Ende nicht noch Support spielen um Gold zu werden, sondern war es bereits vor dem MSI...\nFaszinierender Weise war mein Smurf vor 2 Wochen auf nem guten Weg meinen Main zu überholen. Was mir halt auch deutlich gemacht hat, wie grausam ich bisher als Support gespielt habe. Darauf hin habe ich dann mein Support Spiel auf meinem Main nochmal zu überarbeitet und seit dem geht es auch da tatsächlich wieder aufwärts.\nAlso alles bei meiner ursprünglichen Aussage: Ich nutze meinen Smurf um mein Gesamtspiel zu verbessern.\n\nUnd vor allem: Wenn ich als jemand, der in seinen Nebenrollen schlechter ist als in seiner Main Rolle, ist es ja auch praktisch gar kein Problem, wenn ich mich dann in dieser Rolle in einem angemessenen Rahmen mit Spielern messe, die genau so gut sind, wie ich es in dieser Rolle bin. Ich smurfe halt nicht auf einem gekauften Iron IV Account um Noobs vorzuführen und mich über sie lustig zu machen, weil ich selbst mit Bronze Bravery Builds gegen sie gewinne.\n Es gibt durchaus die falschen Gründe um zu smurfen. Es gibt Smurfs, die grundlegend toxisch sind. Ich bin immer dafür solche Accounts zu finden und zu bannen. Ich weise nur darauf hin, dass es durchaus auch Leute gibt, die einfach nur einen Zweitaccount haben um an ihren Schwächen zu arbeiten. Und da ist dann nichts verwerfliches dran.","replies":[]}]}]},{"poster":"Mister Bite 42","date":"2019-06-07T22:54:37.902+0000","up_votes":3,"down_votes":1,"body":"Ich habe mir auch vor einigen Tagen einen neuen Account erstellt. Dies hat den einfachen Grund, dass ich andere Rollen als meine Main-Rolle lernen möchte. Um dies zu schaffen benötige ich einfach diesen Zweitaccount, da ich auf meinem Main-Account noch gar nicht die BE besitze, um mir ausreichend Champions holen zu können. So komme ich dazu Champs auf dem “Smurf“ zu lernen und dann kann ich diese später auf dem anderen Account vielleicht auch spielen.\n\nHinzu kommt auch noch, dass ich auf meinem Main neue Champs in meiner Main Rolle im Normal ausprobiere. Daher hat sich meine Normal MMR im Bereich meiner Jg Qualitäten eingependelt. Folgend bekomme ich, wenn ich Lane spielen möchte auch im Normal Spieler, die etwa auf meinem Jg-Niveau sind und mich dann komplett zerstören.","replies":[]},{"poster":"need elo police","date":"2019-06-07T18:40:17.226+0000","up_votes":1,"down_votes":0,"body":"Kann viele Gründe haben. Viele riechen einen Bann auf ihren Main Account und sorgen schon mal dafür, dass sie nach einem Bann schnell wieder auf einem Smurf Ranked spielen können. Manche spielen einfach nur, um möglichst viele neue Spieler davon abzuhalten, weiter dieses Spiel zu spielen (indem er diese einfach zerstört oder beleidigt und diese dann irgendwann keine Lust mehr haben). Oder einfach, weil sie Langeweile haben. Oder weil sie auf ihrem Main Account immer auf den Sack bekommen und deswegen \"Selbstbewusstsein\" gegen neue Spieler sammeln müssen. Oder oder oder.","replies":[]}]}