{"poster":"Corchito","date":"2017-01-31T20:37:33.168+0000","title":"¿Cuál es el campeón más inservible? [Encuesta]","subforum":"Charlas Generales","up_votes":3,"down_votes":2,"body":"Respondan la encuesta y argumenten porque, en el caso de que difieran con la lista, expliquen.\r\n\r\nSaludos.","replies":[{"poster":"Desaroll","date":"2017-01-31T20:44:29.815+0000","up_votes":12,"down_votes":0,"body":"El que elige mi Team en ranked :D\n\nhttps://openclipart.org/image/2400px/svg_to_png/222252/feels.png","replies":[{"poster":"Emma Mirra","date":"2017-01-31T22:00:35.961+0000","up_votes":1,"down_votes":0,"body":"{{sticker:slayer-pantheon-thumbs}}","replies":[]}]},{"poster":"Aslicolly17","date":"2017-01-31T20:52:51.810+0000","up_votes":4,"down_votes":1,"body":"Con el perdón de de todos los main Nidalee, pero creo que ese champ sólo sirve para el aram xD","replies":[{"poster":"CER2 Help me pls","date":"2017-02-02T06:40:46.572+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Aslicolly17,realm=LAS,application-id=v7qsfXsE,discussion-id=KvktPvHR,comment-id=0004,timestamp=2017-01-31T20:52:51.810+0000)\n>\n> Con el perdón de de todos los main Nidalee, pero creo que ese champ sólo sirve para el aram xD\n\nNo lo creas xD he ido Nidalee jg (no soy main) y es cosa de acertar la Q y luego R, W, Q, E o E, Q y gg. Casi un one-shot a quien no tenga la resistencia adecuada.","replies":[]}]},{"poster":"9081913DEL1","date":"2017-01-31T20:45:47.395+0000","up_votes":3,"down_votes":7,"body":"Ninguno, atroxx es un excelente duelista, en partidas con junglas especificos es un pick viable. y si se mantiene vivo unos minutos rapidamente se vuelve un fighter duro.\n\nMorde... WTF, no se por que piensas que no es util morde.\n\nNunu, lo mismo que morde, lo unico es que tenes que saber jugarlo, pero nunu realmente puede carrilear al partida. (No no es divertido jugarlo correctamente).\n\nGalio, soy main galio, no se por que lo pones en esta lista, basicamente no tengo counter. =P\n\nUrgot, el dios del solo top, Hasta teemo sufre de un buen urgot.\n\nLucian, hoy dia depende de la partida. Con lucian puedes hacer muy buen stomp. Claro te pueden dar el stomp a ti.\n\nTeemo... Lo mismo que urgot.\n\nCreo que solo pusiste personajes que no juegas XD.\n\nCreo que la que esta mas outmeta es sona, depende muchisimo de empezar bien, si bien bien jugada es una bestia, hoy dia y en el meta actual sufre horrores, mas que soraka (que de paso esta muy bien soraka).\n\nSaludos.","replies":[{"poster":"Corchito","date":"2017-01-31T20:51:19.279+0000","up_votes":4,"down_votes":0,"body":"Personajes que son débiles (Caso Lucian en este meta) o necesitan una actualización urgente.\n\nPor ejemplo, para que quiero un Aatrox si tengo un Jax o una Shyvana que hacen lo mismo y mucho mejor.","replies":[{"poster":"9081913DEL1","date":"2017-01-31T20:57:38.015+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Corchito,realm=LAS,application-id=v7qsfXsE,discussion-id=KvktPvHR,comment-id=00020000,timestamp=2017-01-31T20:51:19.279+0000)\n>\n> Personajes que son débiles (Caso Lucian en este meta) o necesitan una actualización urgente.\n> \n> Por ejemplo, para que quiero un Aatrox si tengo un Jax o una Shyvana que hacen lo mismo y mucho mejor.\n\nJax hace lo mismo que atroxx... Shivana?\n\nMira hay campeones que no se ven en diamante 1 para arriba y hay una razon. Deberias dejar de seguir a los onetrickpony y pensar, si tenes un jax, y un atroxx, lo que haces es totalmente distinto. Atroxx puede iniciar muy muy bien y salir vivo, tiene un early bastante decente como toplaner y puede salir solo de una mala pasada. Jax, es facil si tiene un match favorable lo gankeo y chau jax.\n\nEn cuanto a lucian, \"personajes que son debiles\" Hola estamos hablando de un adc, son todos y siempre son debiles. Nadie descubre nada poniendo un champ de buen daño base de soporte y ganando el early.\n\nSaludos.","replies":[{"poster":"Corchito","date":"2017-01-31T21:17:01.307+0000","up_votes":3,"down_votes":0,"body":"Aatrox tiene el peor knock up del juego, muy predecible y con un cd del horror, poke muy esquivable.\n\nTe armás daño y sos un murciélago squishy y en cuanto uses la pasiva ni escapar podés. Si lo armás tanque no realizás el daño que deberías.\n\nJax por lo menos tiene varias herramientas más útiles, como esquivar autos sumado a un CC en área en una misma habilidad, daño híbrido, un gapcloser más seguro, un atk speed del horror y una ulti que lo hace semitanque por un rato.\n\nSobre Lucian, es referido al meta actual donde el nerf a la penetración plana lo dejó medio en la basura.\n\nEn soloQ, en low elo que es donde correspondo, si, Garen mid AD full critico o Ahri ADC pueden ser viables.","replies":[{"poster":"FedecarboneroUY","date":"2017-01-31T21:40:25.926+0000","up_votes":1,"down_votes":2,"body":"Hablan porque nunca usaron al campeón, la ignorancia es de lo que más abunda en el foro :P","replies":[]}]}]}]},{"poster":"Zinc","date":"2017-01-31T22:16:40.933+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Zelos From Jonia,realm=LAS,application-id=v7qsfXsE,discussion-id=KvktPvHR,comment-id=0002,timestamp=2017-01-31T20:45:47.395+0000)\n>\n> Ninguno, atroxx es un excelente duelista, en partidas con junglas especificos es un pick viable. y si se mantiene vivo unos minutos rapidamente se vuelve un fighter duro.\n> \n> Morde... WTF, no se por que piensas que no es util morde.\n> \n> Nunu, lo mismo que morde, lo unico es que tenes que saber jugarlo, pero nunu realmente puede carrilear al partida. (No no es divertido jugarlo correctamente).\n> \n> Galio, soy main galio, no se por que lo pones en esta lista, basicamente no tengo counter. =P\n> \n> Urgot, el dios del solo top, Hasta teemo sufre de un buen urgot.\n> \n> Lucian, hoy dia depende de la partida. Con lucian puedes hacer muy buen stomp. Claro te pueden dar el stomp a ti.\n> \n> Teemo... Lo mismo que urgot.\n> \n> Creo que solo pusiste personajes que no juegas XD.\n> \n> Creo que la que esta mas outmeta es sona, depende muchisimo de empezar bien, si bien bien jugada es una bestia, hoy dia y en el meta actual sufre horrores, mas que soraka (que de paso esta muy bien soraka).\n> \n> Saludos.\n\nYo tambien soy main Galio y si tiene counter, y uno asquerocicimo es Chogath.\n\nDe todas formas coincido, imposible que Galio este en la lista.","replies":[]}]},{"poster":"Dreams I Broken","date":"2017-02-22T23:50:12.225+0000","up_votes":1,"down_votes":0,"body":"hola yo creo q no seria el champ seria el jugador un champ es inservible dependiendo quien lo juegue y como lo juegue \nPD: podrias agregarme para jugar alguna  q otra partida yo soy ElianGodOfWar   no es nombre de rata como dicen algunos :,v bueno adios espero q concuerdes con mi respuesta y si no pues tienes tus razones :) \nElian se va {{summoner:4}} {{sticker:slayer-jinx-wink}} {{champion:63}}","replies":[]},{"poster":"Tutancadead","date":"2017-02-02T11:59:10.512+0000","up_votes":1,"down_votes":0,"body":"Nunu support rinde.\nNo gana la liena peeo.asegura objetivos.","replies":[]},{"poster":"Shikuh","date":"2017-02-02T10:19:33.431+0000","up_votes":1,"down_votes":0,"body":"Crees que Urgot es inservible? pff xD el que lo usen poco no significa que no sirva, es que a la mayoria de la gente no le gusta. Popularidad y Efectividad no estan 100% relacionados. Cualquier jugador que sea habilidoso y sepa usar bien a alguno de los campeones que tu mencionas podria ganarte mientras tu usas algun campeon del META.","replies":[]},{"poster":"Zinc","date":"2017-01-31T22:15:19.788+0000","up_votes":1,"down_votes":0,"body":"No podes poner a Galio en la lista. Dios, si supieran lo fuerte que esta nisiquiera le harian el rework.\n\nGalio, nos queda poco tiempo juntos :(","replies":[{"poster":"Cuchufleitor","date":"2017-02-02T08:17:24.207+0000","up_votes":1,"down_votes":0,"body":"Los reworks nunca se sacaron por que un campeon sea debil","replies":[]},{"poster":"Pollos Hnos","date":"2017-02-01T00:18:06.990+0000","up_votes":1,"down_votes":0,"body":"Considerando como es riot con los reworks y lanzamiento de Campeones , que siempre los sacan terriblemente rotos a lo mejor queda incluso mejor que el actual","replies":[]}]},{"poster":"Vássilito","date":"2017-02-01T18:24:37.152+0000","up_votes":1,"down_votes":0,"body":"Teemo sin duda, reseña de cada campeon que nombras:\n\n{{champion:266}} Aatrox: Tiene buena iniciación con su Q y R, bastante robo de vida pasivo y su pasiva lo hace revivir, su R otorga velocidad y alcance y la E es un Slow que da lugar al engage.\n\n{{champion:82}} Mordekaiser: Como maestria 5 que soy con el (:3) te puedo asegurar que quien no sepa jugarle va a estar muy cagado. Su Q es un daño absurdo con un CD bajo a nivel 5 de habilidad, su W es muy buena para recuperarse en linea y para ayudar a aliados, su E carga el escudo de la pasiva, el cual puede mitigar daño hasta de torres. Y su R, que decir, puede sacar el espiritu de un dragon, o peor, de un muerto en una TF, haciendola 6v4.\n\n{{champion:20}} Nunu: We este si es inutil :v Quizas sea buen tanque y bueno para la contrajungla, un ulti bien cargado en una TF puede matar a alguien y la pasiva fue cambiada y esta chida, ademas que tiene disminución de velocidad de movimiento y ataque, y ya casi no quedan champs que bajen el AS. Y tambien da movilidad y AS a los aliados, es mas un champ de composicion y juego en equipo.\n\n{{champion:3}}  Galio: TANQUE DEL OJETE! No hay mago que no le tema, tiene mucho daño explosivo y con el escudo se cura, cosa que tampoco queda en el juego, y la R es espectacular para las TFs, eso de que todos se centren en ti por unos segundos, para despues explotar y hacer mas daño, da mucho juego a tus aliados. Es un Nunu pero quizas que se puede valer mas por si mismo, y he visto Galios que carrean :I\n\n{{champion:6}} Urgot: Este no es inservible pero deja de ser bueno, quizas lo mejor que tiene es su poke, alcance y veneno, un escudo muy grande y una R de TF, aunque no muy buena, puede dejar descolocado al ADC rival, y teniendo un buen iniciador en el team, puede hacer bastante. Un Urgot medianamente bueno y fedeado tiene muchisimo daño por su alcance y slow, ademas que suelen sacar items con bastante penetración cosa que a los champs squizis los deletean.\n\n{{champion:236}} Lucian: En serio esta Lucian en esta lista? Es necesario hablar de el? Es de los mejores ADC del meta a pesar de esto de los magos en bot, tiene mucho daño explosivo para ser tirador, tiene una ulti muy buena y una movilidad grande por la E y la pasiva, es muy bueno en midgame con un supp que pueda valerle antes de late.\n\n{{champion:17}} Teemo: Por que digo que Teemo es inutil? Simple. Solo sirve para joder al toplaner rival durante los primeros 15 minutos, tiene mucho poke y veneno, ademas de la invisibilidad. Pero despues es inutil, un campeon sin nada de CC, con unas setas que son pesimas para los 1v1 que solo sirven para dejarlas en un arbusto y esperar que alguien bajo de vida la pise, un cegar que puede joder al carry rival a lo sumo, y el veneno no llega a escalar muchisimo en daño en late. Tener un Teemo es perder si la partida llega al Late, te lo aseguro. Es malo para el splitpush, es super blandito y facil de matar, no tiene nada de control de masas ni CC y en una TF no hace nada, un ataque de Area lo mata sin querer.\n\nOtro: A mi los que mas me parecen inutiles son {{champion:163}}  y {{champion:101}} , ambos son super blanditos, sus pasivas son malas y carecen de movilidad, aunque Taliyah es buena en Highelo y Xerath depende de dar skills, ni siquiera lo he visto triunfar yendo APC en bot, los dos son faciles de counterear y sus definitivas no son de lo mejor. Si no se los sabe usar, poco vas a hacer en Mid.\n\nSaludos ^^","replies":[]},{"poster":"Yunox","date":"2017-02-01T01:01:02.650+0000","up_votes":1,"down_votes":0,"body":"Aunque la estoy empezando a usar mucho y me gusta la W porque es un reto, diría que Taliyah necesita más daño ;-:","replies":[]},{"poster":"Diosmo","date":"2017-01-31T23:17:59.416+0000","up_votes":1,"down_votes":0,"body":"En bronce:\n\n{{champion:157}} \n\nPorque si les va mal ya sabemos, pero incluso muchas veces que les fue re bien en terminos de kills (ponele que iba 14) no contribuyen nunca al equipo. Solo piensan en la kill y sacar maestria. No wardean, no hacen objetivos, etc.","replies":[]},{"poster":"JoCalderone3","date":"2017-01-31T22:21:30.479+0000","up_votes":1,"down_votes":0,"body":"En mi opinión, en bronce/plata jhin y ezreal son los champs mas poronga que hay.","replies":[]},{"poster":"FedecarboneroUY","date":"2017-01-31T21:56:48.642+0000","up_votes":1,"down_votes":0,"body":"{{champion:17}} ,{{champion:6}}","replies":[]},{"poster":"Bizantine","date":"2017-01-31T21:32:37.875+0000","up_votes":1,"down_votes":0,"body":"{{champion:30}} . Lo veo con bastantes problemas en esta  temporada, ya sea por los nuevos items,objetos del mapa, campeones.","replies":[{"poster":"Hell Darking","date":"2017-01-31T21:36:11.255+0000","up_votes":1,"down_votes":0,"body":"pero si karthus es op al maximo, te armas full ap y te tiras front line en tf a tirar ostias para todos.. es un champ que tiene que morir si o si en tf","replies":[]}]},{"poster":"WhiteMax","date":"2017-01-31T20:57:59.462+0000","up_votes":1,"down_votes":0,"body":"Ninguno de esos campeones es \"inservible\" ni \"debil\"{{sticker:slayer-jinx-unamused}} .\n\nEl unico campeon inservible y/o debil es: el que es \"manejado\" por un \"jugador\" que \"no sabe usarlo\".","replies":[]},{"poster":"Excorpion","date":"2017-01-31T20:51:24.750+0000","up_votes":1,"down_votes":0,"body":"El afk :)","replies":[]},{"poster":"Kyousuke","date":"2017-01-31T20:40:19.587+0000","up_votes":1,"down_votes":0,"body":"{{champion:17}}  squishi, si no lo haces bien te destruyen, si no te fedeas no haces nada y por 75 de oro te anulan el ultimate {{item:3364}} {{item:2055}}","replies":[]}]}