{"poster":"Corchito","date":"2017-12-01T01:38:23.841+0000","title":"Desde cuándo la comunidad se preocupa tanto por el lore de Varus? Homobofia encubierta?","subforum":"Off-topic y temas personales","up_votes":6,"down_votes":5,"body":"Casi nadie juega Varus a menos que est&eacute; roto.\n\nDe repente hay muchas personas que se quejan del lore de Varus, cu&aacute;ntos de estas personas juegan Varus? \n\nDesde cu&aacute;ndo les importa tanto Varus?\n\nO se quejan por qu&eacute; incluyen la homosexualidad como nuevo tema can&oacute;nico reemplazando a la anterior historia clich&eacute; (Si reemplazan Varus por Vayne es la misma historia casi de hecho)?\n\nEste es el mundo moderno, ad&aacute;ptense o mueran, est&aacute;n en contra de los nuevos paradigmas? Vayan y reunanse para estar en contra. Ah, y recuerden que van a tener un hijo tarde o temprano en que en alg&uacute;n momento de su vida definir&aacute; su sexualidad y ustedes c&oacute;mo seres abiertos lo van a tener que aceptar.\n\nSaludos!","replies":[{"poster":"Setsumi Sakura","date":"2017-12-01T01:48:19.170+0000","up_votes":3,"down_votes":0,"body":"El lore nuevo es igual de cliche que el viejo, solo que uno era una historia edgy de venganza y la actual es un cuento disney de el amor todo lo puede.\n\nYo prefería la historia antigua, si querían hacerle algo a varus podrían haber mostrado su verdadero deseo de venganza.\n\neso..","replies":[{"poster":"Corchito","date":"2017-12-01T01:51:09.720+0000","up_votes":1,"down_votes":0,"body":"No discuto la calidad del nuevo lore por si no te enteraste, si no de la intolerancia que se traduce de la misma.\n\nEl lore antiguo parece el plagio de un shonnen barato como les gusta ver a muchos acá y debía ser cambiado tarde o temprano.","replies":[{"poster":"Setsumi Sakura","date":"2017-12-01T02:26:59.200+0000","up_votes":1,"down_votes":0,"body":"Tu discutiste la calidad del viejo lore, yo discutí la calidad del nuevo... No puedo hacer una comparación entre ellos?\n\nY respecto a la intolerancia.. me es totalmente irrelevante, la mayoría lo dice en broma, los que de verdad están descontentos solo por la orientación sexual de un personaje ficticio son una minoría, una minoría que es totalmente irrelevante y que sus argumentos no tienen mucho para destacar.","replies":[{"poster":"Corchito","date":"2017-12-01T03:07:04.257+0000","up_votes":1,"down_votes":0,"body":"No te lo prohíbo en ningún momento, tal vez plantié mal el tema. El hilo conductor que deseo plantear es sobre la inclusión de la homosexualidad en un lore, después si es cliché, forzado,etc se puede debatir.","replies":[{"poster":"Setsumi Sakura","date":"2017-12-01T03:20:47.124+0000","up_votes":1,"down_votes":0,"body":"Ah, pues ami me parece la raja hacer canon una relación homosexual, pero no me gusto el como reemplazaron el deseo de venganza de varus, me gustaba varus porque era algo (muy poco) parecido a scorpion de mortal kombat... alguien que le dieron la oportunidad de revivir a todo su clan pero su deseo de venganza era mucho mas grande que su propio razonamiento, rechazando la mejor oportunidad que tenia solo por su rabia. Por eso la frase de \"temanle a un hombre que no tiene nada que perder\" quedaba la raja con lo que es la historia vieja, mostraba el dolor que tiene al tema de su pueblo.\n\nClaro, el deseo de venganza aun sigue, pero paso a estar en un plano secundario, el tipo no se lanzo el poso para buscar una solución a la matanza, se lanzo para salvar a la pareja, ahora el enfoque principal es mas la lucha de los 3 personajes por tener el control de lo que es varus.\n\nAunque claro, todo eso es mi opinión, no puedo negar que la historia vieja de varus es bastante básica, pero me hubiera gustado algo parecido a lo de scorpion.\n\nEso, linda noche, me voy a dormir, sueñe con angelitos.!!\n\n{{sticker:sg-soraka}}","replies":[]}]}]}]}]},{"poster":"Hnk Kenshiro","date":"2017-12-01T01:58:15.558+0000","up_votes":2,"down_votes":1,"body":"Es tema del momento, en 3 días ya lo olvidamos, como que Zoe viene de Disney xd","replies":[]},{"poster":"Arondight","date":"2017-12-01T19:15:47.506+0000","up_votes":1,"down_votes":0,"body":"A mi me hubiera gustado que Riot se mantuviera neutral frente a este fenómeno social. Con lo de Taric, debido a su aspecto, era más que suficiente, pero ahora se han abierto de piernas y dejaron que el lobby los violara... Una pena","replies":[{"poster":"Corchito","date":"2017-12-03T19:41:30.986+0000","up_votes":1,"down_votes":0,"body":"Lloran los homofóbicos y antiprogres.","replies":[{"poster":"Arondight","date":"2017-12-04T20:15:55.514+0000","up_votes":1,"down_votes":0,"body":"Jamás vi progresismo en fomentar una nueva forma de discriminación. Y lo de homofobia es un termino sesgado, solo tiene importancia para un grupo específico.","replies":[]}]}]},{"poster":"LaReinaPingüino","date":"2017-12-01T05:57:35.026+0000","up_votes":1,"down_votes":0,"body":"Pero eso de \"lo juegan sólo cuando está roto\" no es algo que se hace mucho contodos los campeones, sobre todo los adc?","replies":[]},{"poster":"StąrDust","date":"2017-12-01T02:15:52.412+0000","up_votes":1,"down_votes":0,"body":"No querrás decir homofobia?","replies":[]},{"poster":"Franja","date":"2017-12-01T02:13:46.827+0000","up_votes":1,"down_votes":0,"body":"Creo que tristemente hay mucha gente intolerante aun. Por un personaje de juego no es tanto atado, pero es triste ver como en la vida real tanta gente basurea a los homosexuales.","replies":[]},{"poster":"furikake","date":"2017-12-01T02:11:38.860+0000","up_votes":1,"down_votes":0,"body":"la homofobia es muy común y puede surgir en cualquier ámbito, incluso cuando aparece una pareja gay en un video.","replies":[]},{"poster":"Tr0ublemaker","date":"2017-12-01T01:59:51.029+0000","up_votes":1,"down_votes":0,"body":"M.. no se yo vi bastante profundidad en el texto pues el  mezclar 3 almas en un cuerpo no me parece cliché ,a decir verdad  me parece complejo y uno se siente incluso agobiado al leerlo y puedes sentir esa confusión que llega a ser incómoda.  y respecto a la visión del amor todo lo puede  m.. si puede ser algo molesta pero a los humanos no les gusta estar solos por eso miramos al cielo buscando ovnis para sentirnos q no somos los unicos aqui y gracia sauna sociedad individualista hemos llegado a pensar que el amor es innecesario ,bueno eso hasta q tienes hijos creo ahi entiendes mejor el amor y no lo subestimas tanto.\n{{sticker:sg-ahri-2}}\n\npd. los elementos geográficos y culturales que se agregan del contexto de ionia me agradaron ya q aun no tenemos mucha info de esta región ","replies":[]}]}