{"poster":"muhalex123","date":"2016-07-24T19:48:53.727+0000","title":"LoL server.","subforum":"Hilfe & Support","up_votes":1,"down_votes":2,"body":"Ich spiele LoL gerne aber mittlerweile sind die Server Erfahrungen echt miss.Ich habe permanent high Ping in Game nach 5 Minuten obwohl ich nichts im Hintergrund offen habe.Ich h&ouml;re mit LOL auf bis dieses Ping Problem behoben wurde","replies":[{"poster":"Sree","date":"2016-07-25T04:26:16.230+0000","up_votes":2,"down_votes":1,"body":"Es gibt derzeit keine globalen Probleme, die fuer Highpings sorgen und durch die Server verursacht werden. Das Problem wird darum hoechstwahrscheinlich auf deiner Seite liegen. Wenn du das einsiehst, koennen wir versuchen dir zu helfen, die Ursache zu finden und zu beheben. Wenn du weiterhin dabei bleibst, dass es Riots Schuld sein muss, koennen wir dir nicht helfen.\n\nFalls du versuchen willst, die Ursache zu bestimmen:\nLass bitte Pingplotter waehrend eines Spiels mitlaufen, damit man besser sehen kann, wo die Ursache deiner Probleme zu suchen ist.\n\n>Ein tracert erstellt eine Liste der Server über die das Paket an einen bestimmten Server geschickt wurde. In unserem Fall von dem Hausanschluss bis zum Riotserver.\n>Zusätzlich wird noch protokolliert in welchem Zeitraum die Pakete verschickt wurden.\n>Ein gutes Programm um viele tracerts anzufertigen und auszuwerten ist Pingplotter. Download:\n>https://www.pingplotter.com/download.html\n>Um ein Log zu erstellen, ladet das Programm bitte runter und stellt es dann folgendermaßen ein:\n>\n> * Trace Interval: 1 second\n> * Focus Time: all\n> * Target Name: 185.40.65.1\n>\n>Startet das Programm dann über den grünen Button oben links und lasst es laufen, während ihr im Spiel seid.\n>Wenn während des Spiels Probleme aufgetreten sind, ist das Log verwertbar und kann folgendermaßen im Forum geteilt werden:\n>\n> * Edit -> Copy as Text\n> * Geht nach [Pastebin.com](http://pastebin.com/)\n> * Fügt das kopierte Log unter \"New Paste\" ein und klickt auf \"Create new Paste\"\n> * Kopiert den Link zum Log auf Pastebin aus der Adressleiste und fügt diesen in euren Forenpost ein.\n>\n>Fügt bitte außerdem das [Netlog](http://boards.euw.leagueoflegends.com/de/c/hilfe-support-de/X3waeihA-wrenchmens-toolbox-lasungen-zu-bekannten-problemen-und-fehlern?comment=0000) dieses Spiels ein.","replies":[{"poster":"Boozfumble","date":"2016-07-25T07:07:53.346+0000","up_votes":1,"down_votes":2,"body":"So ein Schmarrn, Ich bin auch betroffen, kenn selber im Freundeskreis einige die jammern, und egal auf welcher Leitung Ich spiele, immer diese Pingspikes.\nOh wait, dann kann es nur an meinem Rechner liegen, stimmts?\nNo Sir, die Ausrede kann Ich Dir auch gleich ziehen.","replies":[{"poster":"Zyten","date":"2016-07-25T08:10:50.118+0000","up_votes":3,"down_votes":0,"body":"Hmm komisch, mein Freundeskreis hat in LoL keinerlei Probleme. Zufällig auch auf EUW. Also kann es nicht an den LoL-Servern liegen. Ansonsten hätten ja alle die Probleme.\n\nWenn du via W-Lan spielst: Problem Nr.1 gefunden. Sicher, dass dein W-Lan Adapter nicht einen zu hohen Package Loss hat? Allgemein sollte man nicht per W-Lan ein Spiel spielen, was extrem vom Ping abhängt.","replies":[]},{"poster":"Sree","date":"2016-07-25T10:37:46.359+0000","up_votes":1,"down_votes":0,"body":"Wenn die Ursache fuer die Probleme wirklich die Server von Riot sind, kann der Test aus meinem vorherigem Post auch das zeigen. Nur muss man den Test dazu erstmal machen und die Ergebnisse hier veroeffentlichen.\nAber es ist ja so viel einfacher die Arme zu verschraenken und zu sagen: 'RITO, macht was!'\n\nIch kann niemandem helfen, Verbindungsprobleme zu beheben, wenn die Person sich weigert, genauer nach der Ursache zu suchen.","replies":[]}]},{"poster":"muhalex123","date":"2016-07-25T15:25:28.163+0000","up_votes":1,"down_votes":0,"body":"Ich habe noch eine frage was genau muss ich den kopieren damit du weist was du wissen must ?","replies":[{"poster":"Sree","date":"2016-07-25T17:29:10.281+0000","up_votes":1,"down_votes":0,"body":"Die Anleitung in dem Kasten erklaert eigentlich Schritt fuer Schritt alles ganz genau. Welcher Teil ist da denn unklar?\nGeh die Anleitung am besten in Ruhe wirklich Schritt fuer Schritt durch. Nicht nur ueberfliegen, denn der Test bringt nur etwas, wenn wirklich alles richtig eingestellt ist, so wie in der Anleitung beschrieben.","replies":[]}]},{"poster":"muhalex123","date":"2016-07-25T16:55:09.259+0000","up_votes":1,"down_votes":0,"body":"Habe gerade 1ne runde lol gezockt am anfang alles gut und dann 900ping bis 1000 durchgehend.Dieses problem habe ich nur bei lol das ist schade.","replies":[]},{"poster":"muhalex123","date":"2016-07-25T13:16:19.853+0000","up_votes":1,"down_votes":0,"body":"Ich habe in meinem rage LOL von der Festplatte geschmissen  und versuche es wieder runter zu laden geht aber nicht der bugsplat taucht immer wieder auf.Warum?","replies":[{"poster":"Homunculi","date":"2016-07-25T13:25:18.329+0000","up_votes":1,"down_votes":0,"body":"Hast du LoL einfach nur runter geschmissen? Also zum Ordner und \"Löschen\" gedrückt?","replies":[{"poster":"muhalex123","date":"2016-07-25T13:40:48.535+0000","up_votes":1,"down_votes":0,"body":"systemsteuerung :D","replies":[{"poster":"Homunculi","date":"2016-07-25T13:45:54.657+0000","up_votes":1,"down_votes":0,"body":"Gut, kommt ein bestimmter Fehler/Benachrichtigung?\n\nEs kann sein das trotzdem noch irgendwas in der Registry festhängt.\n\nDas Setup mal \"Als Administrator\" Ausgeführt?\n\nHast du die Setup.exe neu heruntergeladen oder nutzt du eine alte?","replies":[{"poster":"muhalex123","date":"2016-07-25T13:47:46.140+0000","up_votes":1,"down_votes":0,"body":"Es kommt kein bestimmter Fehler.Ich habs neu herunter geladen.","replies":[{"poster":"Homunculi","date":"2016-07-25T14:02:24.893+0000","up_votes":1,"down_votes":0,"body":"Du hast auch zwischenzeitlich den Rechner neu gestartet?\nUm es besser zu verstehen, du hast die Setup Datei heruntergeladen und dann auf installieren gedrückt, den Pfad ausgewählt und dann hat er die ersten Sachen auf die Platte bzw. in den Ordner gepackt (ist schon länger her das ich LoL installiert hab xD), danach öffnet sich der Launcher und er versucht die nötigen Patches/Daten zu ziehen? Kommst du bis dahin oder schmiert der Client schon vorher ab?\n\n**Dieser Vorschlag geschiet auf eigene Verantwortung:**\nLad und installiere dir CCleaner, falls notwendig oder wieder vorhanden deinstalliere noch einmal LoL über die Systemsteuerung.\nAm besten noch mal einen Neustart.\nDanach lass CCleaner die Registry aufräumen, am besten lass wenn er fragt ein Backup der Registry anlegen.\nLass alle Fehler beheben.\nDann erneut ein Neustart.\nSollte noch ein Ordner von LoL existieren lösche diesen bitte mit der Tastenkombination \"Shift + Entf(Del)\"\nWenn es jetzt nicht mit der Installation klappt hab ich keine Ahnung mehr =/","replies":[{"poster":"muhalex123","date":"2016-07-25T14:13:01.120+0000","up_votes":1,"down_votes":0,"body":"Bis jetzt klapts,wen wieder was ab scmiert versuche ich deinen vorschlag.Danke :D","replies":[]}]}]}]}]}]}]},{"poster":"muhalex123","date":"2016-07-25T11:48:40.991+0000","up_votes":1,"down_votes":0,"body":"Okey. Ich werde es versuchen.","replies":[]}]},{"poster":"Kîngs Gambît","date":"2016-07-24T19:51:50.557+0000","up_votes":3,"down_votes":1,"body":"nope lol hat keine server Probleme aber du hast internet Probleme.","replies":[{"poster":"muhalex123","date":"2016-07-25T02:08:04.936+0000","up_votes":2,"down_votes":1,"body":"Ich kenne viele die dieses Problem haben.","replies":[{"poster":"Homunculi","date":"2016-07-25T11:00:41.998+0000","up_votes":1,"down_votes":0,"body":"Den Pingplotter mal laufen lassen. \n\nEvtl. liegt es am MTU Wert.\n\nLeben die, die das gleiche Problem haben in der gleichen Stadt/Dorf oder in der Nähe, haben alle den gleichen Provider?","replies":[]}]}]}]}