{"poster":"x FPSalt x","date":"2019-06-16T23:47:03.270+0000","title":"Account Redemption","subforum":"Player Behavior","up_votes":4,"down_votes":10,"body":"So i made an account for League a year and a half or so ago, and im not a really toxic person at all but when i play League and games get tight, or i have a bad game and int and my team flames me i get heated. i have really never flamed my teammates, mostly just the other team.\r\nand so in my old account i got permabanned eventually and i would really, really like to get it back from that ban. that i could do something to get my account unbanned and redeemed from its perma state.\r\nI have obviously worked on all forms of toxicity but LoL as a game, is just so competitive and toxic and i hate playing against rude people who are better than me. \r\n\r\nRiot, is there a way for me to redeem my account and get it back so hackers dont hack in and get my credit card info or someone else takes control of the account i worked and played so hard in?\r\n\r\nSincerely\r\nFPS","replies":[{"poster":"Lrrr Omicronian","date":"2019-06-17T02:04:41.908+0000","up_votes":4,"down_votes":0,"body":"You are free to make an appeal to Riot support asking nicely, but don't get your hopes up. Occasionally, with reason, clemency may be shown and we have seen isolated cases of accounts being restored. If less than six months have passed, then the answer will almost certainly be negative.","replies":[]},{"poster":"Prandine","date":"2019-06-17T00:39:07.047+0000","up_votes":3,"down_votes":2,"body":"Sorry, but punishments not given in error are not overturned.","replies":[]},{"poster":"petrosal97","date":"2019-10-29T00:53:57.991+0000","up_votes":1,"down_votes":2,"body":"F uck riot b astard company","replies":[]},{"poster":"Kuthillick","date":"2019-06-17T00:54:30.474+0000","up_votes":1,"down_votes":2,"body":"Permanent bans are... wait for it... permanent. \n\nFeel free to make a new account to start playing again.","replies":[]},{"poster":"KFCeytron","date":"2019-06-16T23:51:16.682+0000","up_votes":2,"down_votes":3,"body":"Briefly: nope.","replies":[]}]}