{"poster":"zLoLSensei","date":"2019-11-16T21:40:30.970+0000","title":"ADESSO BASTA","subforum":"Aiuto e supporto","up_votes":1,"down_votes":0,"body":"Oggi è già la seconda volta che il mio LoL crasha a caso e devo riavviare il pc.  A caso si mette a laggare e si blocca l'intero pc. ho già fatto 27 volte la riparazione completa ma non serve a nulla.\r\nE mi sono pure beccato la coda di 20 min.\r\nDatemi una soluzione.\r\nGrazie","replies":[{"poster":"Ringiel","date":"2019-11-16T22:46:37.108+0000","up_votes":1,"down_votes":0,"body":"il tuo processore è dual core? se si è un bug legato a quello e non c'è soluzione finchè non viene sistemato.","replies":[{"poster":"IlBinario18diSMN","date":"2019-11-19T17:13:37.746+0000","up_votes":1,"down_votes":0,"body":"Ho mandato un ticket, a me si freeza a 5~10 minuti (non sempre, quando non c'è freeze c'è il calo fps). La riposta, leggendola tra le righe mi pare un \"non ci interessa aggiornare perché vogliamo far evolvere il gioco, quindi comprate pc più potenti\". Spero di sbagliarmi, lo spero davvero.","replies":[{"poster":"Ringiel","date":"2019-11-19T18:56:57.533+0000","up_votes":1,"down_votes":2,"body":"beh,se ci pensi non hanno tutti i torni,visto che i processori dual core stanno sui pc veramente vecchi ... ormai pure i portatili da 300 euro nei centri commerciali hanno minimo un quadcore.","replies":[]}]}]},{"poster":"Malygos","date":"2019-11-16T23:24:30.332+0000","up_votes":1,"down_votes":0,"body":"Ho lasciato un ticket alla riot perché io ed un altro amico avevamo identico problema. Freeze del campione che non permette di fare nient'altro sul pc (nemmeno aprire il task manager per forzare l'arresto di lol al volo e tornare velocemente).\nMi hanno risposto che molti player stanno avendo lo stesso problema perché l'ultima patch è stata corposa. Ho inviato 2 volte i registri di LoL ma non ho risolto niente. Lo dico giusto per non farti impazzire.  Abbiamo fatto riparazione client, aggiornamento driver, deframmentazioni, scaricato programmi per migliorare le prestazioni e gli fps, formattato. Nada. E non dipende dalle prestazioni del pc","replies":[]}]}