{"poster":"Raykudo","date":"2016-05-08T08:56:29.738+0000","title":"Den Traum endlich IP ausgeben zu dürfen 4.0","subforum":"Allgemeiner Chat","up_votes":6,"down_votes":3,"body":"hey leute \nvllt kennt ihr meine  vorherigen posts &uuml;ber dieses thema die ich so ungef&auml;hr viertel j&auml;hrlich starte....\nich besitze zurzeit 266770 IP und ich kann halt nichts damit anfangen ,weil alles schon in meinem besitz ist. (nein ich möchte nicht 19 mal meinen namen ändern)\nneue champs und icons werden instant gekauft aber das sind auch nur peanuts.\n\nes g&auml;be viele alternativen wie man IP preise verkn&uuml;pfen kann \nich habe schon viele gute ideen alleine hier im forum gelesen und h&auml;tte auch selber einige vorschl&auml;ge ohne das riot dabei verluste macht\n\nleider werde ich hier auch niemanden erreichen der darauf einfluss hat aber mich beruhigt es schon zu wissen ,dass ich mit der ansicht nicht alleine bin =)","replies":[{"poster":"Staatsanwalt","date":"2016-05-08T11:16:08.066+0000","up_votes":4,"down_votes":0,"body":"Ich frag mich immer wieder, wieviel man spielen muss, um auf so eine Menge zu kommen.","replies":[{"poster":"XXXX D Misaki ","date":"2016-05-08T12:27:00.857+0000","up_votes":1,"down_votes":0,"body":"Naja, kommt drauf an seit wann er spielt.\nIch spiele erst seit Oktober 2010. \nIch habe 6 Accounts auf Lvl 30, auf allen besitze ich Ap, Ad, Support Runen, auf diesem weitaus mehr Runen. \nChamps hab ich wenn ich die 5 zusammen zähle alle mindestens einmal, auf meinem Mainacc alle außer 2, Icons etc werden auch gekauft mit IP. \n\nWenn ich nur einen einzigen Account gehabt hätte und nicht immer wieder mal 3-6 Monate Pause zwischendurch gemacht hätte, dann hätte ich wahrscheinlich ähnlich viele IP. \n\nWenn er natürlich letzte Season angefangen hat, dann halte ich ihn für einen Bot^^\nAber seit Season 3 hat er ja ne Ranked-Wertung","replies":[{"poster":"Staatsanwalt","date":"2016-05-08T16:04:57.258+0000","up_votes":4,"down_votes":1,"body":"Ich spiele seit kurz nach der Beta und ich bin nicht annährend in diesem IP Bereich. Ich weiß nicht, wieviel Stunden spielt ihr denn am Tag um diese IP Menge zu erhalten?  Und ist es nicht schon ein bisschen \"addicted\" wenn man 5 vollausgestattete Accounts hat? Und wenn wir davon ausgehen, das er 4000 Spielstunden für alle Champs braucht und hat den Rest auch gekauft und hat ca 267k Ip, dann können wir die Spielstunden anzahl mindestens verdoppeln.\n\nEr spielt auch seit min 2010, da er Ranked stats aus Season 1 hat. Sagen wir er hat 8000 Spielstunden, das macht 333 Tage. Er hat also von 2010 bis jetzt fast 1 Jahr Lol gespielt. Und runtergerechnet, hat er seit 2010 jeden Tag mindestens 4 Stunden Lol gespielt. Mit Urlaub, Aussetzern und weiteren Ausreißern kommt man natürlich auf deutlich mehr. Ich persönlich finde, das ist viel zu viel. Aber nur meine Meinung.\n\nSoviel wie er, spielt bestimmt nur ein Bruchteil der Spieler. Vielleicht sollte er sich nicht über die vielen IP aufregen, sondern einfach weniger spielen, weil das von außen betrachtet echt viel ist. Ich will hier keinen anmachen, eventuell nur die Augen öffnen, ob man nicht doch über Spielesucht nachdenken sollte.","replies":[{"poster":"Killerkante","date":"2016-05-08T19:39:20.913+0000","up_votes":1,"down_votes":0,"body":"Ich denke das hat wenig damit zu tun abhängig zu sein wenn man IP im Überfluss hat (die These hab ich mal pauschal bei dir rausgelesen), wobei der Begriff Spielesucht eher damit zu tun hat wie der Betrachter dazu steht.\nIch kenne das eher von der alten Generation dass Spielesucht von der Zeit aus definiert wird die man vor dem PC/ vor der Konsole verbringt, eher finde ich ist man erst dann süchtig ... sei es nach Games oder sonst was, wenn man an nichts anderes mehr denken kann und sein komplettes Umfeld incl. sein Leben vernachlässigt, aber jedem seins.\n\nIch hab ebenfalls IP übrig ohne Ende, allerdings komm ich bei meiner Rechnung auf aufgerundet 2h pro Tag, was selbst für eine Betrachtungsweise wie von dir noch im Rahmen sein sollte.\nRiot hat zu vergangener Zeit nur etliche IP Boost events gemacht wodurch sich die Spielzeit übrigens ziemlich stark bei den meisten angehäuft hat. (ist heute viel viel seltener als damals)\n\nUnd 4h am Tag finde ich jetzt auch nicht so dramatisch, insbesondere wenn man beispielsweise solche Arbeitszeiten hat, in der man eher am Abend oder in der Nacht zuhause ist und keine wirklich sinnvollen alternativen hat.\nWorauf ich aber hinaus will ist, dass man auch ohne wie ein \"Spielesüchtiger\" zu zocken auf alle Champions kommen kann, zwar muss man sich ranhalten für den kompletten Luxus (alle Runen/Runenseiten/Champs) allerdings muss man schon etwas penibel sein damit man das auch nötig hat.\nZumal verbringt jeder gerne viel Zeit mit seinem Hobby, dabei ist es finde ich gleichgültig obs nun Schach/Fernsehen/Sport oder sonstiges ist, solange man nicht sein Umfeld dafür vernachlässigt hat man nichts zu bedenken.","replies":[]},{"poster":"XXXX D Misaki ","date":"2016-05-08T18:56:15.654+0000","up_votes":1,"down_votes":0,"body":"Addicted? Evtl^^\nIch habe ein halbes Jahr frei gehabt nach meiner Schulzeit, dann ein Jahr Pause gemacht und insgesamt danach noch ein Jahr Pause gehabt irgendwann. Vielleicht spiele ich viel LoL, aber ich habe auch meinen Freund darüber kennen gelernt, spiele jeden Tag mit ihm und habe genügend Freizeit um noch jeden Tag LoL spielen zu können. Wobei wir 2 Seasons fast gar nicht gespielt haben.\n\nPS: Wir (mein Freund und ich) haben Hunde die wir nicht vernachlässigen, Schule, Uni, Arbeit, kochen sehr gerne, treiben Sport. \nUnd trotzdem haben wir genügend Zeit für die PS3, PS4, WoW, LoL usw. Natürlich nicht alles gleichzeitig...aber mal 1-2 Wochen PS4 und ein Spiel LoL und dann ne Weile nur WoW oder andere Spiele auf dem PC. \n\nPPS: 5 1/2 Jahre, bzw. 48480 Stunden sind vergangen seitdem ich angefangen habe LoL zu spielen. Ca. 4000 Stunden davon(mit all meinen Accounts) habe ich LoL gespielt, also ca. 2 Stunden pro Tag, das heißt 2-5 Spiele pro Tag. ","replies":[]},{"poster":"Raykudo","date":"2016-05-08T18:28:45.483+0000","up_votes":1,"down_votes":0,"body":"http://wasted-on-lol.com/stats/euw/raykudo/\n\n90 tage verschätzt^^","replies":[]}]}]},{"poster":"Megamaexx","date":"2016-05-08T14:08:21.402+0000","up_votes":1,"down_votes":0,"body":"Man benötigt ungefähr 4000 Spielstunden, ungeachtet vom Tagesbonus, um alle Champions von IP kaufen zu können. Der Tagesbonus, IP-Boosts und RP-Käufe sind hier nicht berücksichtigt. Runenkäufe zögern das noch weiter hinaus. Ach ja, die Champion-Preise gehen vom aktuellen Stand aus. Es gab ja bereits Anpassungen.","replies":[{"poster":"XXXX D Misaki ","date":"2016-05-08T18:51:23.347+0000","up_votes":1,"down_votes":0,"body":"Wieso geht ihr davon aus, dass man 4000 Spielstunden braucht um alle Champs zu kaufen?\nIch habe niemals Champions mit RP gekauft und habe auf dem Account nur 2331 Spielstunden, 2 Champs fehlen mir und ich hab etliche Runen.  \nDen Tagesbonus habe ich auch nicht ausgenutzt, da ich ca. 900 Losses und 1300 Wins hab (normal Games nur). \nBoosts habe ich mir auf dem Account seltenst gekauft, nur die Bonus Wochenende mitbekommen, bei denen mir höchstens 10 Champs gefehlt haben.","replies":[{"poster":"Megamaexx","date":"2016-05-08T23:17:01.566+0000","up_votes":1,"down_votes":0,"body":"Bei 130 IP die Stunde (grob geschätzt, in 30 min games hab ich 60-80 IP bekommen) kommt das ungefähr hin. Bei deinen Spielstunden sollten ja noch mal so 15000 IP durch den Daily Bonus mindestens dazukommen, bestimmt noch mehr, da man ja nicht am Stück ununterbrochen zockt. Die müsste man noch mal mit der Zeit verrechnen. \nDennoch sehr interessant, dass du weniger Spielzeit und mehr Champions hast als ich. Liegt wahrscheinlich an deinen selten gekauften boosts, da ich nie welche hatte.","replies":[{"poster":"XXXX D Misaki ","date":"2016-05-09T18:12:31.594+0000","up_votes":1,"down_votes":0,"body":"Kann sein, ich kann mich bei dem Account hier nur dran erinnern, dass ich am Sommerevent Wochenende nen Tagesboost gekauft hab, da man dort mit 5 Spielern 400 prozent IP oder so bekommen hat","replies":[{"poster":"Megamaexx","date":"2016-05-09T20:41:15.241+0000","up_votes":1,"down_votes":0,"body":"und damit mehr Boosts als ich ;D Du scheinst aber mehr Spiele als ich bestritten zu haben","replies":[]}]}]}]}]},{"poster":"Raykudo","date":"2016-05-08T18:27:19.011+0000","up_votes":1,"down_votes":0,"body":"http://wasted-on-lol.com/stats/euw/raykudo/\n\ndamit weißt du es genau :)","replies":[]},{"poster":"Tokogawaruf","date":"2016-05-08T11:19:09.914+0000","up_votes":1,"down_votes":0,"body":"plus die Menge IP die er davor gehabt haben muss, wenn er alles sonstige bereits besitzt.","replies":[]}]},{"poster":"Myrmiron","date":"2016-05-08T23:40:12.275+0000","up_votes":1,"down_votes":0,"body":"Mir fehlen noch 8x9 Runen x)\nDas hab ich nun davon 4 Accounts zu bespielen... :/","replies":[]},{"poster":"XXXX D Misaki ","date":"2016-05-08T19:19:04.178+0000","up_votes":1,"down_votes":0,"body":"Zum Thema selber hier: Ja, es gibt - vor allem im englischen Bereich - viele Threads darüber, dass man IP doch bitte für etwas anderes noch ausgeben könnte.\nRiot selber hat ja auch schong esagt, dass sie an etwas arbeiten, evtl sogar ChromaSkins","replies":[]}]}