{"poster":"SoloRenektonTop","date":"2015-01-31T11:33:41.345+0000","title":"Mentiras y engaños por All Chat","subforum":"Charlas Generales","up_votes":2,"down_votes":0,"body":"Una vez en una partida dos  de mi equipo fuimos con teleport y revive (Pues es lo unico que el enemigo ve en la pantalla de carga) . Les dijimos al enemigo por All Chat que habia dos trolls, feeders, niños ratas, gg y demas cosas. Despues les dijimos que iban a fedear y se encontraban cerca de su Red. La cosa es que nos movimos los 5 juntos y atacamos por sorpresa a dos de ellos llevandonos primera sangre mas 1 asesinato. Nuestro engaño funciono perfectamente en la partida lo cual les bajo muchisimo la moral.\r\n\r\n¿Y ustedes alguna vez hicieron esto? ¿Es efectiva la tactica de mentir y engañar al oponente por el chat? ¿Algunas vez cayeron o no en la trampa? ¿Como fue su primera vez con esa tactica?\r\n\r\n{{champion:58}}","replies":[{"poster":"Burán","date":"2015-01-31T12:41:55.902+0000","up_votes":3,"down_votes":0,"body":"Eso no, pero varias veces en partidas normales jugaba premade de 5 y uno de nosotros se ponia a bailar en medio mientras los otros 4 estaban escondidos en un yuyo esperando a que algún enemigo intente matarlo, no funciona casi nunca pero siempre hay alguien que se lo come {{summoner:3}}","replies":[{"poster":"Sr Yoqesé","date":"2015-01-31T17:30:11.785+0000","up_votes":2,"down_votes":0,"body":"Poner el suport en el medio y los otros 4 en el arbusto es super challenger, lo divertido es cuando caen 2, también la de irse \"afk\" y mandarse doble con {{champion:55}} \nSe quedan medio {{item:3070}} {{champion:32}} {{item:3070}}","replies":[]}]},{"poster":"SoloRenektonTop","date":"2015-02-02T13:08:39.935+0000","up_votes":1,"down_votes":0,"body":". Efectivamente fue una tactica basada en el engaño. Lo unico malo es que los que tenia Tp y Revivir debian jugar con mucho cuidado y pasivamente. Luego a nivel 17-18 aquellos hechizos fueron utiles en las Tfs. Por ejemplo  en la ultima tf Nuestro Teemo cego y bajo la vida a su adc para luego ser reventado por el AD melee del enemigo. Luego Uso revivir + Teleport en un ward de nuestro support y volvio con full vida a la Tf en solo 4 o 5 segundos para terminar acabandolos.","replies":[]},{"poster":"XVII The Star","date":"2015-01-31T22:01:22.607+0000","up_votes":1,"down_votes":2,"body":"Honestamente me parece poco deportivo...\nNo es justo... En el tiempo que practican con trolleos podrían entrenar y ganar honestamente...","replies":[{"poster":"ANNIE QUILADO","date":"2015-02-01T01:15:01.756+0000","up_votes":1,"down_votes":0,"body":"No son trolleos, son tacticas avanzadas de challengers que no podrias comprender...","replies":[{"poster":"XVII The Star","date":"2015-02-01T02:45:10.739+0000","up_votes":1,"down_votes":0,"body":":C\nEl bronce me ciega","replies":[]}]}]}]}