{"poster":"Pixii Bomb","date":"2017-02-17T02:25:51.527+0000","title":"I think I lost 300 IP & the Client says I dont have enough IP... but I do","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"So the past... 2 months or so, I've been about ~400 IP off.\r\n\r\nFor Example, I try to purchase a 4800 IP Champion with 4800\r\nbut the Client says \"you do not have enough IP\"\r\nAnd I can USUALLY purchase that Champ when I have about 5200 IP\r\n\r\nA few days ago, I noticed I LOST about 400 IP\r\nI recognized this because I was in the 4000 range\r\nand all of a sudden I was in the 3000 range\r\n\r\nI assumed it was ~400 IP, and though to myself \"oh, they must have fixed the bug\"\r\nSo now I'm back at 5019 IP\r\nWent to purchase a 4800 IP Champion... but I don't have enough IP apparently\r\n\r\nMath is hard guys","replies":[{"poster":"Targons Blade","date":"2017-02-17T02:59:32.512+0000","up_votes":1,"down_votes":0,"body":"Some players experience a bug with the Beta Client displaying the correct IP balance from the backend (servers). You should be able to resolve this by hopping over to the Legacy Client (from login) to visit the store and pull the correct balance. This should also resolve the issue on the Beta Client.\n\nhttps://support.riotgames.com/hc/en-us/article_attachments/215576628/Launch-Legacy-Client.jpg\n\nLet me know if the issue persists.","replies":[{"poster":"Pixii Bomb","date":"2017-02-17T03:18:26.362+0000","up_votes":1,"down_votes":0,"body":"that seems to have fixed it. i still dont know how i lost that IP from a week ago, but I mean, its only a few games so im not too worried","replies":[{"poster":"Targons Blade","date":"2017-02-19T21:31:03.720+0000","up_votes":1,"down_votes":0,"body":"You probably didn't actually lose IP, it was probably your balance updating, then not updating, then updating again. This is not too uncommon for players experiencing IP sync issues. Hopefully, it continues to update all the time, as normal, from here on out.\n\nLet me know if you have any other questions.","replies":[]}]}]},{"poster":"Maddmazz","date":"2017-02-17T21:29:22.078+0000","up_votes":1,"down_votes":0,"body":"My balance is never accurate on the new client.","replies":[]},{"poster":"Xxkiller anžexX","date":"2017-02-17T16:40:56.754+0000","up_votes":0,"down_votes":0,"body":"how can i get my acc back when somebody hack me\ni dont know my email \nand this acc was banned idk why","replies":[]}]}