{"poster":"BaLuLe2207","date":"2017-11-30T22:11:15.713+0000","title":"Blaue Essenzen","subforum":"Champions & Gameplay","up_votes":4,"down_votes":1,"body":"Hey Leute und Hey Riot, \r\n\r\nan sich finde ich lol einfach nur klasse aber ich finde es etwas beschissen das man keine Blauen Essenzen pro Spiel bekommt, so wie fr&uuml;her. Ich w&uuml;rde es sch&ouml;n finden wenn das wieder eingef&uuml;hrt wird.\r\n\r\nSch&ouml;ne Gr&uuml;&szlig;e \r\nBaLuLe2207","replies":[{"poster":"eingew","date":"2017-12-08T08:02:44.857+0000","up_votes":1,"down_votes":0,"body":"Da der Thread bloß noch ins Offtopic abdriftet und zum eigentlichen Diskussionsthema offenbar alles gesagt wurde, schließe ich den Thread jetzt.","replies":[]},{"poster":"Azuritia","date":"2017-12-05T23:29:12.068+0000","up_votes":1,"down_votes":2,"body":"Habe das Gefühl man kriegt nur noch blaue Essenzen wenn man Spiele gewinnt, und je höher man aufsteigt, was ich im Prinzip als sehr ungerecht empfinde. Weil Riot damit eines ganz klar kommuniziert: Siegertypen werden belohnt, was du an Zeit, Invest, Energie, Arbeit in den Champ steckst dich mit ihm beschäftigt, dich in Guides einließt, das du versuchst im Team zu spielen andere zu unterstützen. Das juckt keinen mehr, entweder du gewinnst oder du gehst leer aus und erhälst gar nix, nicht mal blaue Essenzen. Man spart somit ewig auf einen einzigen Champ, erst Recht auf die Starken die alle im Schnitt 6300 pro Champ kosten wie zb Lucian.. Da war mir das alte Belohnungsystem ehrlich lieber, das hier ist mir zu sehr auf Pay to win ausgelegt.. Sprich auch Teamarbeit oder Assists sollten gewürdigt werden von der Community, und auch vom Spiel, und dafür sollte es auch Belohnungen geben. Gab es aber nie, weder im alten Belohnungsystem, noch im neuen und ja ich finde es ungerecht und die Upvotes die ich dafür kassieren werde..tobt euch aus.{{champion:53}} ","replies":[{"poster":"Sirrkas","date":"2017-12-05T23:46:29.587+0000","up_votes":2,"down_votes":1,"body":"Wie ich sehe, hast du dich leider nicht darüber informiert, wie es mit den BE funktioniert. \n\nEs gibt keine BE für den Sieg. Lediglich der Tagessieg gibt einmal 50 BE je Tag. Man kriegt die BE für Stufenaufstiege und verdient dabei, solange man weniger als 8 Spiele je Tagessieg macht, sogar mehr BE als davor IP. Für die meisten sind dadurch also die Champions jetzt schneller zu erwerben, nicht zu vergessen, dass die passenden Splitter noch mal den Preis drücken. \n\nOb man gut oder schlecht spielt, macht keinen Unterschied. Man gewinnt eh auf lange Sicht die Hälfte der Spiele.","replies":[{"poster":"Azuritia","date":"2017-12-06T00:23:49.680+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Sirrkas,realm=EUW,application-id=Wj1wcocU,discussion-id=kilsst97,comment-id=00020000,timestamp=2017-12-05T23:46:29.587+0000)\n>\n> Wie ich sehe, hast du dich leider nicht darüber informiert, wie es mit den BE funktioniert. \n> \n> Es gibt keine BE für den Sieg. Lediglich der Tagessieg gibt einmal 50 BE je Tag. Man kriegt die BE für Stufenaufstiege und verdient dabei, solange man weniger als 8 Spiele je Tagessieg macht, sogar mehr BE als davor IP. Für die meisten sind dadurch also die Champions jetzt schneller zu erwerben, nicht zu vergessen, dass die passenden Splitter noch mal den Preis drücken. \n> \n> Ob man gut oder schlecht spielt, macht keinen Unterschied. Man gewinnt eh auf lange Sicht die Hälfte der Spiele.\n\nWie ich sehe hast du keine Ahnung über was ich mich informiert habe oder nicht sondern urteilst nur, ich habe damals einen Link bekommen von einen Riot Supporter und mir da alles zu den blauen Essenzen durchgelesen, dennoch fällt mir auf das ich nur noch nach Siegen, nach gewonnen Games belohnt wurde sonst NIE. Ich war eben mit  Mf geefedet und dennoch verloren das Match,ergo zähl mir bitte nix das meine ach so schlechte Spielleistung schuld dran ist, das mir auffiel das man auch sonst keine Belohnungen mehr erhält außer man gewinnt Spiele. Ergo es zählt nicht mehr die Leistung des Spielers, sondern nur noch gewinnt er, und das ist keine gute Entwicklung.","replies":[{"poster":"Qbert","date":"2017-12-06T13:46:25.247+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Azuritia,realm=EUW,application-id=Wj1wcocU,discussion-id=kilsst97,comment-id=000200000000,timestamp=2017-12-06T00:23:49.680+0000)\n>\n> Wie ich sehe hast du keine Ahnung über was ich mich informiert habe oder nicht sondern urteilst nur, ich habe damals einen Link bekommen von einen Riot Supporter und mir da alles zu den blauen Essenzen durchgelesen, dennoch fällt mir auf das ich nur noch nach Siegen, nach gewonnen Games belohnt wurde sonst NIE. Ich war eben mit  Mf geefedet und dennoch verloren das Match,ergo zähl mir bitte nix das meine ach so schlechte Spielleistung schuld dran ist, das mir auffiel das man auch sonst keine Belohnungen mehr erhält außer man gewinnt Spiele. Ergo es zählt nicht mehr die Leistung des Spielers, sondern nur noch gewinnt er, und das ist keine gute Entwicklung.\n\nUff, das strotzt nur so vor Unwissenheit und Selbstüberschätzung.\n\nDu hast einfach Unrecht.\nMach mal zwei Spiele, dann wirst du sehen, dass du stets Erfahrungspunkte bekommst.","replies":[{"poster":"Azuritia","date":"2017-12-07T02:18:52.731+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Qbert,realm=EUW,application-id=Wj1wcocU,discussion-id=kilsst97,comment-id=0002000000000001,timestamp=2017-12-06T13:46:25.247+0000)\n>\n> Uff, das strotzt nur so vor Unwissenheit und Selbstüberschätzung.\n> \n> Du hast einfach Unrecht.\n> Mach mal zwei Spiele, dann wirst du sehen, dass du stets Erfahrungspunkte bekommst.\n\nIch überschätze mich selber kein Stück, habe ich je wo gesagt das ich ein besserer Spieler bin hier als irgendjemand?Nein, also bitte lüg nicht danke. Ich sagte einfach das ich keine Belohnungen mehr bekommen habe für verlorene Spiele nur noch für Gewonne. Punkt Aus Ende das  darf ich, echt eine Frechheit wie man ständig hier behandelt wird..","replies":[{"poster":"Qbert","date":"2017-12-07T05:41:26.783+0000","up_votes":2,"down_votes":1,"body":"Habe ich gesagt, dass du dich bzgl. deiner Spielweise überschätzt? Nein, also bitte lüg nicht, danke.\nMan oh man, du benimmst dich wie ein bockiges Kind, das den Lolli nicht bekommt.\n\nDu liegst einfach falsch, Punkt, Aus, Ende.\nWie bereits gesagt bekommst du stets, also nach JEDEM Spiel Erfahrungspunkte. Das ist die Belohnung.\nMit jedem Level-Up bekommst du dann eine Kapsel, in der 1-5 Championsplitter sind. Diese kannst du entweder für blaue Essenzen zerstören oder damit den Champ vergünstigt für BE kaufen.\n\nDu weinst rum, wie du hier angeblich behandelt wirst, dabei bist du derjenige, der hier alle anderen dumm anmacht. Was bist du? 12? ... man man man.","replies":[{"poster":"Azuritia","date":"2017-12-07T15:00:03.157+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Qbert,realm=EUW,application-id=Wj1wcocU,discussion-id=kilsst97,comment-id=000200000000000100000000,timestamp=2017-12-07T05:41:26.783+0000)\n\n\n> Man oh man, du benimmst dich wie ein bockiges Kind, das den Lolli nicht bekommt.\n\n> Du weinst rum, wie du hier angeblich behandelt wirst, dabei bist du derjenige, der hier alle anderen dumm anmacht. Was bist du? 12? ... man man man.\n\nGemeldet auf Beleidigungen reagiere ich nicht weiter. Du bist respektlos und asszial zu anderen und da verschwende ich, meine Zeit, Energie nicht weiter Wert. Mit so was was das nicht ohne unterschwellige Angriffe  argumentieren kann, gebe ich mich nicht ab. Geht's noch?!  Ich habe niemand dumm angemacht, lern mal Manieren und eln Benehmen. Block.","replies":[{"poster":"Qbert","date":"2017-12-07T18:18:10.102+0000","up_votes":2,"down_votes":1,"body":"Merkst du überhaupt, was du schreibst?\n\nIm folgenden zitiere ich mal Aussagen, die DU gemacht hast gegenüber Menschen, die dir helfen wollten bzw. dir konstruktive Kritik gegenüber angebracht haben:\n> - Nicht zu glauben wie Toxisch ein Silber Spieler sein kann\n- Danke echt du hast mich wieder daran erinnert, wieso ich von Gold/Spielern Spielern so ein schlechtes Bild habe-_-\n- Ich sage nicht das alle Silber Spieler so sind aber du bist das absolut negativste Beispiel wie man nicht als Silber spiele sein sollte: Du glaubst du wärest besser als jeder Bronze Spieler, tust als hätten sie von nix eine Ahnung, verkaufst sie als agressiv, toxisch und was weiß ich noch nicht alles und willst um jeden Preis das letzte Wort haben. Ich könnte dir sagen wieso ich die Münze kaufte, will es aber nicht\n- Punkt Aus Ende das darf ich, echt eine Frechheit wie man ständig hier behandelt wird..\n- aber ich mach mir nicht mehr die Mühe wegen arroganter Kerle wie euch die sich dran ergötzen andere fertig zu machen bis sie nur noch traurig und sich zurück ziehen\n\nDas sind nur Auszüge.\n\nAnsonsten noch so ziemlich alle Antworten die du in deinem eigenen Thread getätigt hast:\nhttps://boards.euw.leagueoflegends.com/de/c/champions-gameplay-de/0Et8oXMi-djungler-und-toplane-tipps-und-tricks-erwanscht-bitte\n\nDu bist ein Paradebeispiel für eine Feminazi, alles was man dir entgegensetzt ist sofort eine Beleidigung, egal wie sachlich und konstruktiv es formulier ist.\nDu aber darfst nach Belieben die Leute angehen und von der Seite anmachen.\nJa, du bist ein sehr sehr gutes Beispiel dafür.","replies":[{"poster":"Azuritia","date":"2017-12-08T02:30:02.436+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Qbert,realm=EUW,application-id=Wj1wcocU,discussion-id=kilsst97,comment-id=00020000000000010000000000000000,timestamp=2017-12-07T18:18:10.102+0000)\n>\n> Merkst du überhaupt, was du schreibst?\n> \n> Im folgenden zitiere ich mal Aussagen, die DU gemacht hast gegenüber Menschen, die dir helfen wollten bzw. dir konstruktive Kritik gegenüber angebracht haben:\n> - Danke echt du hast mich wieder daran erinnert, wieso ich von Gold/Spielern Spielern so ein schlechtes Bild habe-_-\n> - Ich sage nicht das alle Silber Spieler so sind aber du bist das absolut negativste Beispiel wie man nicht als Silber spiele sein sollte: Du glaubst du wärest besser als jeder Bronze Spieler, tust als hätten sie von nix eine Ahnung, verkaufst sie als agressiv, toxisch und was weiß ich noch nicht alles und willst um jeden Preis das letzte Wort haben. Ich könnte dir sagen wieso ich die Münze kaufte, will es aber nicht\n> - Punkt Aus Ende das darf ich, echt eine Frechheit wie man ständig hier behandelt wird..\n> - aber ich mach mir nicht mehr die Mühe wegen arroganter Kerle wie euch die sich dran ergötzen andere fertig zu machen bis sie nur noch traurig und sich zurück ziehen\n> \n> Das sind nur Auszüge.\n> \n> Ansonsten noch so ziemlich alle Antworten die du in deinem eigenen Thread getätigt hast:\n> https://boards.euw.leagueoflegends.com/de/c/champions-gameplay-de/0Et8oXMi-djungler-und-toplane-tipps-und-tricks-erwanscht-bitte\n> \n> Du bist ein Paradebeispiel für eine Feminazi, alles was man dir entgegensetzt ist sofort eine Beleidigung, egal wie sachlich und konstruktiv es formulier ist.\n> Du aber darfst nach Belieben die Leute angehen und von der Seite anmachen.\n> Ja, du bist ein sehr sehr gutes Beispiel dafür.\n\nUnd du kannst nix als andere zu beleidigen, weil dir ihre Meinung nicht passt. Red mit der Wand  Deine Hetze gegen mich, wird gemeldet ubd Du nur noch ignoriert,die Beleidigung mit Femininazi ist ja mehr als nur abwertend gegenüber Frauen.\nBin keine Feiministin, aber lüg halt weiter über meine Person nennt sich üble Nachrede,wenn andere Lügen verbreiten über andere.\n Der Rest viel Spaß beim lesen, die Meldung dafür sorge ich das Riot es sieht. Niedervotet doch meine Beiträge und Beleidigt mich, mir ab jetzt egal,die sollen sehen wie ihre Community wirklich drauf ist. Selber Schuld kein Mitleidhttp://www.bento.de/politik/hass-im-netz-so-wird-im-internet-gegen-frauen-gehetzt-214047/\n\n\nHabe auch gesagt das ich nicht denke das alle Silberspieler so sind, aber halt langsam auffällig das du das ausser Acht lässt, und nur diese Stellen zitiert hast Weill sie deine ganze Hetze gegen mich entkräftet. Bin ja laut dir ein Smurf, Feminazi, ein Feeder, ein Troll, ein kleines bockiges Kind. Jetzt langts wirklich.","replies":[{"poster":"Qbert","date":"2017-12-08T06:19:03.004+0000","up_votes":2,"down_votes":1,"body":"> Femininazi ist ja mehr als nur abwertend gegenüber Frauen.\n> Bin keine Feiministin,\n\nDamit hast du dich nun endgültig lächerlich gemacht :D\n\n> Bin ja laut dir ein Smurf, Feminazi, ein Feeder, ein Troll\n\nHabe ich auch nie behauptet.\n\n> aber lüg halt weiter über meine Person nennt sich üble Nachrede,wenn andere Lügen verbreiten über andere\n\nWer im Glashaus sitzt.\n(Ich denke ich muss dir das erklären, das Sprichwort soll Leute darauf hinweisen nicht andere Leute für Fehler zu kritisieren, die sie selber machen.)","replies":[]}]}]}]}]}]}]},{"poster":"Sirrkas","date":"2017-12-06T11:56:42.988+0000","up_votes":2,"down_votes":1,"body":"Solange du mehr als einen Sieg je Tag schaffst, sollte dir auffallen, dass man für Siege keine BE erhält. Lediglich für den Tagessieg. Inzwischen erhält man für Spiele EP und bei einem Stufenaufstieg Championkapseln, die die Hauptquelle für BE darstellen. \n\nDie Berechnungen von Riot bezüglich mehr oder weniger BE als davor IP, findest du [hier](https://boards.na.leagueoflegends.com/en/c/developer-corner/hAaYMrEs).\n\nSachen danach zu verteilen wie gut man gespielt hat klingt auch nicht gerade sinnvoll. Es ist ein Mehraufwand, so ein System zu entwickeln und am Ende verdient man im Schnitt genau so viel wie vorher, solange das System gut eingestellt wurde. \n\nAußerdem möchte ich noch kurz erwähnen, dass du diejenige hier bist, die andere verurteilt. Ich habe schon einige Beiträge von dir gesehen, in denen du Leuten, die versucht haben dir zu helfen, vorhältst, sie würden dich nur stören wollen.\n\nEdit:\n>Ich war eben mit Mf geefedet und dennoch verloren das Match,\n\nMeinst du das Match hier?\nhttps://matchhistory.euw.leagueoflegends.com/de/#match-details/EUW1/3446085854/207854799?tab=overview\n\nWarum hast du {{item:3301}} in Minute 9 gekauft? Du warst doch ADC, du solltest farmen, nicht Minions sterben lassen, um Münzen zu erhalten. Von gefeedet sein würde ich auch nicht reden, wenn man bei Minute 15 erst 2 Kills und 2 Tode hat. Der Pantheon, der war gefeedet. ","replies":[{"poster":"Azuritia","date":"2017-12-07T02:12:58.549+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Sirrkas,realm=EUW,application-id=Wj1wcocU,discussion-id=kilsst97,comment-id=0002000000000000,timestamp=2017-12-06T11:56:42.988+0000)\n>\n> Solange du mehr als einen Sieg je Tag schaffst, sollte dir auffallen, dass man für Siege keine BE erhält. Lediglich für den Tagessieg. Inzwischen erhält man für Spiele EP und bei einem Stufenaufstieg Championkapseln, die die Hauptquelle für BE darstellen. \n> \n> Die Berechnungen von Riot bezüglich mehr oder weniger BE als davor IP, findest du [hier](https://boards.na.leagueoflegends.com/en/c/developer-corner/hAaYMrEs).\n> \n> Sachen danach zu verteilen wie gut man gespielt hat klingt auch nicht gerade sinnvoll. Es ist ein Mehraufwand, so ein System zu entwickeln und am Ende verdient man im Schnitt genau so viel wie vorher, solange das System gut eingestellt wurde. \n> \n> Außerdem möchte ich noch kurz erwähnen, dass du diejenige hier bist, die andere verurteilt. Ich habe schon einige Beiträge von dir gesehen, in denen du Leuten, die versucht haben dir zu helfen, vorhältst, sie würden dich nur stören wollen.\n> \n> Edit:\n> \n> Meinst du das Match hier?\n> https://matchhistory.euw.leagueoflegends.com/de/#match-details/EUW1/3446085854/207854799?tab=overview\n> \n> Warum hast du {{item:3301}} in Minute 9 gekauft? Du warst doch ADC, du solltest farmen, nicht Minions sterben lassen, um Münzen zu erhalten. Von gefeedet sein würde ich auch nicht reden, wenn man bei Minute 15 erst 2 Kills und 2 Tode hat. Der Pantheon, der war gefeedet.\n\nNicht zu glauben wie Toxisch ein Silber Spieler sein kann muss schon sehr hart sein für dich zu sehen das ich mit Mf zweimal in letzter Zeit gefeedet war hmm?Och wie schlimm ein Bronzi kann was, nun müssen wir auch echt alles tun um sie schlecht aussehen zu lassen das alle denken sie ist SCHEISSE! Danke echt du hast mich wieder daran erinnert, wieso ich von Gold/Spielern Spielern so ein schlechtes Bild habe-_-\n\nFalsch ich verurteile maximal dich, weil du echt nur folgenden Eindruck auf mich machst: Eingebildet überheblich, arrogant, Dir muss es langsam echt zu Kopf gestiegen sein das du hier einen Modtitel hast und was zu sagen hast, ich habe über die anderen hier kein Stück geurteilt und wenn ich morgen hier gebannt sein sollte dann weiß ich wem ich das zu verdanken habe, weil ich mir diese das du jeden meiner Beiträge mich versuchst schlecht zu machen nicht mehr länger gefallen habe lassen. Ich habe hier einfach nur meine Meinung gesagt, während du hier regelrecht meine Beiträge verfolgst. Ob Mod oder nicht Mod mich schüchterst du nicht ein und ich darf auch meine Meinung zu Themen äußern und ich hoffe Riot kriegt dein Verhalten mit, denn die selbe Arroganz hast du andere auch spüren lassen, sprich das heißt ich hab 1-2  Beiträge von dir gelesen. Ich sage nicht das alle Silber Spieler so sind aber du bist das absolut negativste Beispiel wie man nicht als Silber spiele sein sollte: Du glaubst du wärest besser als jeder Bronze Spieler, tust als hätten sie von nix eine Ahnung, verkaufst sie als agressiv, toxisch und was weiß ich noch nicht alles und willst um jeden Preis das letzte Wort haben. Ich könnte dir sagen wieso ich die Münze kaufte, will es aber nicht, da ich langsam aber sicher angewiedert genug bin, wie du um jeden Preis mich immer als schlecht aussehen lassen willst, und jeden meiner Beiträge runter machst, und mich hinstellt als wäre ich einfach nur dumm und hätte von nix eine Ahnung, und das  ich ja still sein sollte?... Fazit selbst wenn du als Silber Spieler besser bist als ich, von jemanden wie dir will ich nix lernen weils dir viel zu viel Spaß macht andere als schlecht zu verkaufen >_>","replies":[{"poster":"Sirrkas","date":"2017-12-07T09:11:42.588+0000","up_votes":2,"down_votes":0,"body":">Nicht zu glauben wie Toxisch ein Silber Spieler sein kann muss schon sehr hart sein für dich zu sehen das ich mit Mf zweimal in letzter Zeit gefeedet war hmm?\n\nZu erst einmal bin ich Gold, nicht Silber. Weiterhin erkenne ich nicht so recht, wo ich hier toxisch gewesen sein soll. Das war zwar nicht das netteste, was ich je verfasst habe, ist von toxisch aber noch ein Stück entfernt. \n\n>Och wie schlimm ein Bronzi kann was, nun müssen wir auch echt alles tun um sie schlecht aussehen zu lassen das alle denken sie ist SCHEISSE! Danke echt du hast mich wieder daran erinnert, wieso ich von Gold/Spielern Spielern so ein schlechtes Bild habe-_-\n\nEs ist mir egal, welchen Rang du hast. Ich habe mich auch nirgendwo darauf bezogen. Aber leider nimmst du sehr gerne alles persönlich, was man dir schreibt. Wie etwa bei [diesem Post von dir](https://boards.euw.leagueoflegends.com/de/c/clans-teams-de/cLiagXyR-invasion-modus-nette-mitspieler-gesucht?comment=000000010000000000000000), als Eingew dir nur helfen wollte und du ihn dafür sogar anfährst. \n\nEs wäre mir auch egal, wenn ein Bronzespieler etwas kann, das bedeutet dann nämlich etwas gutes für denjenigen, nämlich, dass er es einfach haben wird, aufzusteigen. Je mehr er kann, desto einfacher wird es.\n\n>Falsch ich verurteile maximal dich, weil du echt nur folgenden Eindruck auf mich machst: Eingebildet überheblich, arrogant, Dir muss es langsam echt zu Kopf gestiegen sein das du hier einen Modtitel hast und was zu sagen hast, ich habe über die anderen hier kein Stück geurteilt und wenn ich morgen hier gebannt sein sollte dann weiß ich wem ich das zu verdanken habe, weil ich mir diese das du jeden meiner Beiträge mich versuchst schlecht zu machen nicht mehr länger gefallen habe lassen. \n\nWie Eingew schon sagte, ich bin kein Mod. Und auch wenn mein Name nicht grün wäre, würde das nicht viel an meiner Meinung oder meiner Schreibweise ändern. Ich versuche dich auch nicht schlecht zu machen, ich würde viel lieber sehen, dass du dich verbesserst, aber mit deinem Verhalten rückst du dich selbst immer wieder von alleine in ein schlechtes Licht. Wenn du mir nicht glaubst, schau mal deine alten Beiträge durch, versuch sie distanziert zu betrachten und stell dir vor, die hätte wer anderes an dich geschrieben. \n\n>Ich habe hier einfach nur meine Meinung gesagt, während du hier regelrecht meine Beiträge verfolgst. Ob Mod oder nicht Mod mich schüchterst du nicht ein und ich darf auch meine Meinung zu Themen äußern und ich hoffe Riot kriegt dein Verhalten mit,\n\nDu kannst schreiben was du willst, solange es nicht gegen die Forenrichtlinien verstößt. Dann bestrafen das die Mods. Wenn ich aber einen Post sehe, in dem offensichtlich falsche Informationen auftauchen, werde ich auch weiterhin versuchen den Poster zu korrigieren. Hier bei dir war das eben dein Glaube, dass man bei jedem Sieg BE erhält oder, dass du als MF gefeedet warst. \n\n>Ich sage nicht das alle Silber Spieler so sind aber du bist das absolut negativste Beispiel wie man nicht als Silber spiele sein sollte: Du glaubst du wärest besser als jeder Bronze Spieler, tust als hätten sie von nix eine Ahnung, verkaufst sie als agressiv, toxisch und was weiß ich noch nicht alles und willst um jeden Preis das letzte Wort haben. \n\nDas mit dem letzten Wort haben wollen kann zutreffen, dann aber meist im Zusammenhang mit der Bekämpfung von Fehlinformationen. Warum springst du eigentlich zwischen Silber und Gold hin und her?\nÜbrigens, ich bin besser als jeder Spieler, der es nicht aus Bronze schafft. Was daran liegt, dass ich seit einigen Seasons in Folge, Gold mit niedrigstem Aufwand erreicht habe. Wenn ich nach spätestens 50 Rankeds Gold bin und jemand mit mehreren hundert Spielen nicht aus Bronze kommt, kann man wohl davon ausgehen, dass ich deutlich besser bin. Aber deswegen bin ich noch nicht arrogant. \nJa, auch die Bronzespieler haben Sachen, die sie richtig machen. Ich habe aber genug Leute in der Freundesliste gehabt, mit denen ich regelmäßig gespielt habe, um ganz klar sagen zu können, wer in Bronze feststeckt, hat noch viel Luft nach oben. \nBronzespieler können auch gute Ideen haben. Wie etwa, als Supporter Heal  zu nehmen, da die Heilitems und Windspeaker das verbessern. Alleine dadurch werden sie aber noch nicht gut oder besser als die anderen. Wenn dieser Spieler nämlich Ahri Support spielt, weil sie Fuchsohren und einen einzigen CC hat und damit in Bronze 4 feststeckt, ist das nicht gut. Wenn man ihn nach Jahren dann endlich überzeugt hat, dass Soraka vom Spielstil besser passen würde und er damit nach Bronze 1 kommt, hat er sich schon eher verbessert. \nWenn er dann aber glaubt, es ist wichtiger, dass er Lasthits kriegt, solange der ADC oder Mage da ist und denen die verweigert oder gar Botlane farmt, während das Team seine Hilfe am Baron braucht, dann hat der noch viel zu lernen. \n\n> Ich könnte dir sagen wieso ich die Münze kaufte, will es aber nicht, da ich langsam aber sicher angewiedert genug bin, wie du um jeden Preis mich immer als schlecht aussehen lassen willst, und jeden meiner Beiträge runter machst, und mich hinstellt als wäre ich einfach nur dumm und hätte von nix eine Ahnung, und das ich ja still sein sollte?... \n\nWie schon gesagt, ich versuche dich nicht als dumm dastehen zu lassen. Bis jetzt wollte ich dir nur aufzeigen, wo du falsche Annahmen triffst. Ich verfolge dich auch nicht, ich hab ja auch Beiträge von dir gesehen, die ich nicht kommentiert habe. Aber das heißt nicht, dass ich mich nicht an dich erinnere, wenn du hier etwas postest. \n\nZu dem, warum man Münze brauchen sollte, als ADC:\n{{item:3301}} \nDa gibt es nicht viel. 5 % Abklingzeit und 2 Gold je 10 Sekunden sind den Preis nicht Wert. Manchmal Gold für Autohits auf Champions zu kriegen, macht den Kohl auch nicht fett. Die einzige Situation, in der es nützlich sein könnte ist, wenn man öfter Münzen erhält. Das ist für einen Laner aber problematisch, weil er dafür auf Farm verzichten muss, da nur Minions Münzen droppen können, die man selber nicht tötet. \nEs würde sich also wohl nur lohnen, wenn man davon ausgeht, die Lasthits nicht zu erhalten, entweder, weil man nicht anständig farmt und Minions verpasst oder weil man davon ausgeht, dass andere versuchen werden, die Lasthits zu nehmen.\n\nSollte dir noch eine sinnvolle Verwendung dafür eingefallen sein, steht es dir natürlich frei es mir zu erläutern.","replies":[]},{"poster":"eingew","date":"2017-12-07T08:06:27.803+0000","up_votes":1,"down_votes":1,"body":"Sirrkas ist kein Mod. Nicht alle Emissarys sind auch Mods. Abgesehen davon gibt es keinen Grund ihn für sein Verhalten zu belangen, zumal er lediglich auf das Spiel eingegangen ist, welches du in die Diskussion gebracht hast. Dabei hat er zu deinen Aussagen kritisch Stellung genommen, ohne dich dabei in irgendeiner Weise persönlich anzugreifen oder sich auf andere Weise unangemessen zu Verhalten.\n\nWenn ich du wäre, würde ich mir derartige Tipps (und seien sie noch so unhöflich formuliert) eher zu Herzen nehmen, als mich in ellenlangen Absätzen darüber aufzuregen.\n\nWas regt dich daran eigentlich so auf? Was ist so schlecht daran Bronze zu sein und Fehler zu machen? Ein sehr großer Teil von uns hat da angefangen. Ich zB auch.","replies":[{"poster":"Qbert","date":"2017-12-07T08:12:30.298+0000","up_votes":2,"down_votes":0,"body":"Ich habe eher das Gefühl, dass er/sie jedwede Kritik als persönlichen Angriff wertet, schlichtweg nicht kritikfähig ist.\n\nEs wird sofort die \"toxic\"-Keule geschwungen, obwohl Sirrkas oben ja sachlich hinterfragt hat. Nur weil es keine positive Kritik war, wurde gleich gemeckert, dass sogar auf persönlicher Ebene.","replies":[{"poster":"eingew","date":"2017-12-07T08:48:06.551+0000","up_votes":1,"down_votes":0,"body":"Wenn du mal ihre eigenen Threads anguckst, wirst du herausfinden, dass dieser Vorwurf dazu geführt hat, dass entsprechende Diskussion völlig eskaliert ist. Ich glaube also nicht, dass persönliche Interpretationen in irgendeiner Weise hilfreich sind. Deshalb die andere Taktik ;).","replies":[{"poster":"Qbert","date":"2017-12-07T08:59:43.871+0000","up_votes":1,"down_votes":0,"body":"Yep, habe ich mir schon mal angeschaut.\nJedweder Kritiker(sogar die, die nicht kritisiert haben) werden angemault. Ich kann getrost sagen, eine Diskussion ist absolut zweckfrei bei diesem hoffnungslosen Fall.","replies":[{"poster":"Sirrkas","date":"2017-12-07T16:53:39.827+0000","up_votes":1,"down_votes":0,"body":"Es ist schon Schade, wenn solche Leute so etwas nicht einsehen wollen.","replies":[]}]}]}]},{"poster":"Azuritia","date":"2017-12-07T15:08:17.188+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=eingew,realm=EUW,application-id=Wj1wcocU,discussion-id=kilsst97,comment-id=000200000000000000000000,timestamp=2017-12-07T08:06:27.803+0000)\n>\n> Sirrkas ist kein Mod. Nicht alle Emissarys sind auch Mods. Abgesehen davon gibt es keinen Grund ihn für sein Verhalten zu belangen, zumal er lediglich auf das Spiel eingegangen ist, welches du in die Diskussion gebracht hast. Dabei hat er zu deinen Aussagen kritisch Stellung genommen, ohne dich dabei in irgendeiner Weise persönlich anzugreifen oder sich auf andere Weise unangemessen zu Verhalten.\n> \n> Wenn ich du wäre, würde ich mir derartige Tipps (und seien sie noch so unhöflich formuliert) eher zu Herzen nehmen, als mich in ellenlangen Absätzen darüber aufzuregen.\n> \n> Was regt dich daran eigentlich so auf? Was ist so schlecht daran Bronze zu sein und Fehler zu machen? Ein sehr großer Teil von uns hat da angefangen. Ich zB auch.\n\nIch nehm mir Tipps gern zu Herzen, wenn man sie in einem normalen Tonfall äußert, so fühle ich mich nur schlecht gemacht von ihm, und in eine Position gedrängt alles rechtfertigen zu müssen. So sollte man nicht zu anderen sein.","replies":[]}]}]}]}]}]}]},{"poster":"TheFoxRox","date":"2017-12-01T12:10:36.453+0000","up_votes":1,"down_votes":0,"body":"Ich bekomme neuerdings auch mal zwischen einem Match Blaue Essenzen. Keine Ahnung warum.","replies":[{"poster":"OT Riku","date":"2017-12-01T16:14:12.929+0000","up_votes":2,"down_votes":0,"body":"Das war bestimmt die änderung für den Sieg des Tages","replies":[{"poster":"TheFoxRox","date":"2017-12-01T18:49:54.616+0000","up_votes":2,"down_votes":0,"body":"Stimmt. Hab heute extra aufgepasst :D","replies":[]}]}]},{"poster":"Megamaexx","date":"2017-12-01T11:47:06.520+0000","up_votes":1,"down_votes":0,"body":"Dafür würden dann aber die Kapseln beim level up wegfallen müssen.","replies":[{"poster":"EiTja","date":"2017-12-01T12:39:22.361+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Megamaexx,realm=EUW,application-id=Wj1wcocU,discussion-id=kilsst97,comment-id=0000,timestamp=2017-12-01T11:47:06.520+0000)\n>\n> Dafür würden dann aber die Kapseln beim level up wegfallen müssen.\n\nStimmt, aber ich bekomme lieber pro spiel eine \"kleine belohnung\" als nur zum win of the day und zum lvl up. Vorallem weil man aktuell umgerechnet  unterm strich weniger BE pro spiel bekommt, als früher IP pro spiel. DIe preise sind aber gleich.\n\n\n{{sticker:sg-shisa}}","replies":[{"poster":"Megamaexx","date":"2017-12-01T13:21:00.685+0000","up_votes":2,"down_votes":0,"body":"Das müsste mal jemand durchrechnen. Laut Riot ist nämlich genau das Gegenteil der Fall.\n\nRiots Berechnungen findest du hier:\nhttps://boards.euw.leagueoflegends.com/de/c/ankundigungen-de/6FaRj1TK-leveln-und-belohnungen-frahe-eindracke-und-anpassungen\n\nWillst du dem wirksam widersprechen, musst du das schon anhand von Zahlen belegen.","replies":[{"poster":"EiTja","date":"2017-12-01T14:15:47.295+0000","up_votes":1,"down_votes":0,"body":"Ich habe es nicht genau berechnert das gebe ich zu.\n\nFür ein Lvl brauch ich ca ohne Win of the day ca 20 - 25 spiele und hab beim lvl uup nie mehr als 900BE bekommen \n\nDas ergibt auf spiele umgerechnet 36- 45 BE und bin erst bei LVL 38 heißt die erfodliche EXP steigt noch. \n\nKann auch sein das ich bei den Camp capseln auch einfach nur pech habe.\n\n\nDas andere was mich an dem System stört ist wenn man sich beispielsweise ein champ kaufen möchte der 6300 BE kostet und ich nur 6100 Be habe muss ich 4 tage den win of the day machen oder ein ganzes LVL um ihn kaufen zu können. Beim alten system hab ich ein Bessten falls 1 win of the day und 1 game mehr gebraucht oder ohne win of the day ca 6 games und konnte ihn kaufen.","replies":[]}]}]}]}]}