{"poster":"Philippicus","date":"2018-01-10T23:17:14.525+0000","title":"Come posso condividere i momenti migliori?","subforum":"Creazioni della community","up_votes":1,"down_votes":1,"body":"Ciao a tutti\nHo salvato due momenti migliori da un replay e vorrei condividerli ad un mio amico. &egrave; possibile mandare il video su WhatsApp (non so convertendolo) o si pu&ograve; visualizzare solo tramite client?","replies":[{"poster":"Orniflex","date":"2018-01-10T23:28:45.131+0000","up_votes":2,"down_votes":0,"body":"> mandare il video su WhatsApp (non so convertendolo) o si può visualizzare solo tramite client?\n\nSi dice non so convertire il video, e non qulla cosa che hai scritto!\nComunque il video lo trovi nella directory: C:\\Users\\\"nome del tuo pc\"\\Documents\\League of Legends\\Highlights , i file sono in formato .webm apribili con qualsiasi lettore fornito di codec audio/video.\n\nLa faccio breve cerca su google un qualsiasi convertitore video free (ovviamente fatti una ricerca per trovarne uno decente), converti il video in .mpeg o quello che vuoi dipende da che risoluzione e qualità pretendi, fatto cio postalo dove vuoi!\n\nEnjoy ;)","replies":[{"poster":"Philippicus","date":"2018-01-11T22:05:36.703+0000","up_votes":1,"down_votes":0,"body":"Grazie, alla fine ci sono riuscito!","replies":[{"poster":"Orniflex","date":"2018-01-11T23:21:32.041+0000","up_votes":1,"down_votes":0,"body":"{{sticker:sg-ahri-2}}","replies":[]}]},{"poster":"Philippicus","date":"2018-01-10T23:35:37.040+0000","up_votes":1,"down_votes":0,"body":"Veramente ”convertendolo\" si può dire nel senso di \"convertire il (video, in questo caso)\". Non so che avevi capito! XD\nCmq grazie mille della risposta, ci proverò!","replies":[]}]},{"poster":"TZombi1234","date":"2018-01-11T18:09:11.338+0000","up_votes":1,"down_votes":0,"body":"Puoi anche uppare il video su youtube o un altro sito per uppare i video.\nTanto penso che siano video che durano meno di un minuto quindi non penso che ci metta molto ad uppare","replies":[]}]}