{"poster":"zelaya19","date":"2015-12-17T07:30:00.664+0000","title":"Identidad de Ahri ¿Maga o asesina?","subforum":"Charlas Generales","up_votes":3,"down_votes":0,"body":"Me gustar&iacute;a una opini&oacute;n acerca de la verdadera identidad de esta campeona (**No es pedido de buff ni nerf, es un simple debate**).\n\nEsta claro que no es la &uacute;nica campeona con caracter&iacute;sticas duales, podemos poner el ejemplo de Diana el cual se puede desempe&ntilde;ar tanto en el rol de una asesina como en el de una luchadora. Sin embargo en Diana ha prevalecido el rol de asesina sobre el de luchadora, al menos, en los dos a&ntilde;os que he estado jugando.\n\nEn Ahri a diferencia de otros, no me ha quedado nunca claro. Riot la ha tratado de definir como una &quot;maga de alta movilidad&quot;, pero el kit de habilidades es el ideal para un asesino, tal vez no teniendo el escalado de da&ntilde;o y la rapidez para burstear de una Katarina o Akali pero cumpliendo mejor dicho rol debido a su mejor supervivencia. \n\nComo maga tambi&eacute;n cumple bien el rol, posee da&ntilde;o en area, buena limpieza de oleadas y muy buen kiteo que otros magos desear&iacute;an tener aunque para una composici&oacute;n de siege hay muchos mejores (Ziggs, Xerath, Kog Maw AP) y en lo que respecta a utilidad su charm no tiene competencia a los estragos que pueden hacer Azir, Viktor, Anivia, Veigar, Orianna, etc tanto por utilidad como por escalados de AP.\n\n_En resumen_:\n\n- Como maga no termina de destacar m&aacute;s que su movilidad y kiteo, es la misma sensaci&oacute;n que uno tiene al jugar soportes como Sona o Nami, un poco de todo pero hay mejores en su puesto.\n\n- Como asesina no tiene el da&ntilde;o que puede tiene LeBlanc en los primeros niveles ni la rapidez con la que asesina Talon, pero su supervivencia a la hora de asesinar la hace sobresalir. \n\nEs una campeona la cual cualquier item-maestr&iacute;a de burst potencia su forma asesina(Ya sea mediante da&ntilde;o plano o porcentual) y (casi)cualquier item de mago puro tambi&eacute;n le resulta c&oacute;modo.\n\nQuisiera que me den su punto de vista acerca de la naturaleza dual de esta campeona. Tambi&eacute;n pueden incluir cualquier otro campe&oacute;n que tenga caracter&iacute;sticas h&iacute;bridas en cuanto su funci&oacute;n al juego para debatir (Por ejemplo Fizz, de las dos formas siempre es molesto).\n\nSaludos :)","replies":[{"poster":"xBASTOXx","date":"2015-12-18T04:06:30.694+0000","up_votes":1,"down_votes":0,"body":"Espero un buffeito desde ese ''BURF'' xD :c un poquito mas de escalado en la Q nose? :cc","replies":[]},{"poster":"Renekor","date":"2015-12-17T09:19:49.286+0000","up_votes":1,"down_votes":0,"body":"Por cierto, se la ve muy poco a Ahri en estos tiempos. Que le habra pasado?, la extraño :$","replies":[{"poster":"Caipirinhã","date":"2015-12-17T10:17:55.080+0000","up_votes":1,"down_votes":0,"body":"A principio de año le dieron un \"BURF\" (nerf y/o buff) la gente creyo que como le sacaron el daño extra que hacia por pegarte con la E ya no servia tanto pero le dieron mas utilidad con la velocidad de la Q la gente sigue creyendo que no sirve pero si sirve y mucho","replies":[{"poster":"oh95","date":"2015-12-17T10:50:30.881+0000","up_votes":1,"down_votes":0,"body":"En realidad eso fue la que la hizo la campeones mas rota de ese parche y ubicandose en los 10 win rates mas altos de toda la historia. Después la fueron normalizando, sigue estando bien, yo la veo bastante destacada actualmente aunque no se vea tanto.","replies":[{"poster":"zelaya19","date":"2015-12-17T17:25:54.536+0000","up_votes":1,"down_votes":0,"body":"Realmente me asusta un poco que tenga un win rate muy alto aún. Para el competitivo está equilibrada y actualmente hay mejores opciones(Simplemente por el meta game), pero para solo Q esta muy fuerte y cualquier buff la puede desequilibrar.","replies":[{"poster":"oh95","date":"2015-12-17T21:38:11.474+0000","up_votes":1,"down_votes":0,"body":"Eso es muy cierto, en competitivo se ve muy poco y en soloq y ranked team (en ligas mas bajas) se desempeña mejor.","replies":[]}]}]}]},{"poster":"zelaya19","date":"2015-12-17T17:22:34.115+0000","up_votes":1,"down_votes":0,"body":"Se tomó un descanso y solo está disponible para los mains :$\n\nHablando en serio, supongo que en este meta de early-mid game, hay campeones que hagan mejor su trabajo, eso es todo (Ahri destaca en el juego medio y tardío sobre todo en el juego medio, su juego temprano es seguro pero no es su fuerte).\n\nElla se encuentra en buen estado, fuerte pero equilibrada :) .","replies":[]}]},{"poster":"ElClarke","date":"2015-12-17T07:41:22.068+0000","up_votes":1,"down_votes":0,"body":"Creo que dejo de ser asesina cuando la Garra de la muerte Ignea (Que en paz descanse) fue borrada del juego, para pasar a ser una maga con alta movilidad por su Ulti y su Q. Pudiendo repartir grandes cantidades de daño y escapar de situaciones peligrosas pero sin el burst que muchos asesinos tendrian.\n\nSaludos {{champion:412}}","replies":[{"poster":"zelaya19","date":"2015-12-17T08:02:28.453+0000","up_votes":1,"down_votes":0,"body":"Si pero hay un par de cosas que estás pasando de largo:\n\n¿Qué magos poseen movilidad salvo Ahri y Azir? A lo sumo tienen un boost de velocidad en alguna habilidad.\n\nAdemás ahora también la suma del Thunderlord y la pasiva del Eco de Luden potencia su característica asesina.\n\n¿Qué mago es capaz de destacar en escaramuzas y picks combinando supervivencia y burst? Lux podría ser muy buena para hacer picks pero no tiene la supervivencia de Ahri.\n\nPor eso mismo realicé el post.","replies":[{"poster":"rokushoger","date":"2015-12-17T14:37:41.435+0000","up_votes":1,"down_votes":0,"body":"Azir, kennen, Ekko en su faceta offtank, Kennen, Cassiopea, Kayle (no se si considerarla, pero ta, podría ser), Ziggs, Zilean.","replies":[{"poster":"zelaya19","date":"2015-12-17T17:32:03.100+0000","up_votes":1,"down_votes":0,"body":"No conozco a cuanta speed pueda llegar la ratita como para considerarlo un desplazamiento. Si nombramos a Cassio, Kayle y Zilean también deberiamos incluir a Orianna, Lulu, Karma?, etc.\n\nNombraste a Kennen 2 veces, te entiendo, yo armé esto a las 5 de la mañana  y hay muchas cosas que me habré olvidado xD","replies":[{"poster":"rokushoger","date":"2015-12-17T19:21:18.675+0000","up_votes":1,"down_votes":0,"body":"Cierto, se me escapó karma, Lulu podría ser, aunque no se si es tanta la movilidad, es más soporte que maga. Oriana no, porque no tiene nigun spell que le de tanta movilidad como para considerarla, zilean si porque su spell le da mucha move speed. Creo que tiene que ser un buff grande a move speed como para considerarlo como \"movilidad\".","replies":[]}]}]},{"poster":"Caipirinhã","date":"2015-12-17T10:20:11.317+0000","up_votes":1,"down_votes":0,"body":"Lissandra tiene bastante movilidad , TF nose si se puede considerar movilidad la R y Kennen con la E","replies":[{"poster":"zelaya19","date":"2015-12-17T17:32:33.833+0000","up_votes":1,"down_votes":0,"body":"Me olvidé de Liss :D","replies":[]},{"poster":"rokushoger","date":"2015-12-17T14:34:25.023+0000","up_votes":1,"down_votes":0,"body":"Tf no porque la R sería más bien presencia global. Movilidad refiere más que nada a movimientos rápidos que pueda realizar el campeón para escapar o acortar distancias.","replies":[]}]},{"poster":"ElClarke","date":"2015-12-17T08:32:58.315+0000","up_votes":1,"down_votes":0,"body":"Sigo pensando en que es una maga. No deberias compararla con otros campeones ya que cada uno es unico, en lo que yo me fijo es el daño que hace.\nEs una maga de daño alto-medio con rango muy corto comparado a otros magos pero por eso compensa con su alta movilidad, aparte los asesinos se destacan por hacer explotar a un campeon en 1-2 segundos, Ahri necesita en algunos casos usar dos veces su kit de habilidades para eliminar tal campeon. Lo cual me hace pensar lo que dije anteriormente, es una maga de corto rango con alta movilidad (A diferencia de lux, alto rango baja movilidad)","replies":[]}]}]},{"poster":"rokushoger","date":"2015-12-17T11:08:12.824+0000","up_votes":1,"down_votes":0,"body":"A mi gusto es las dos cosas, y destaca en una u otra dependiendo de la build. Para ponerte un ejemplo, si la haces con rylai y lyandri te queda una maga con un aguante y escape decente, y agregando toque de la muerte ignea un tremendísimo daño por segundo. Por otro lado haciendola con luden y rabbadon tiene un bursteo excelente.","replies":[{"poster":"quityelmejor13","date":"2015-12-17T14:21:11.269+0000","up_votes":1,"down_votes":0,"body":"con el  luden y rabbadon mas el senor del trueno, uyyy buen burst tiene","replies":[{"poster":"rokushoger","date":"2015-12-17T14:28:27.307+0000","up_votes":1,"down_votes":0,"body":"Ah si, me olvide de poner eso, que si se usa luden y rabbadon hay que poner señor del trueno.","replies":[]}]}]},{"poster":"Ode to dark","date":"2015-12-17T14:18:01.449+0000","up_votes":1,"down_votes":0,"body":"Creo que es un tanto de los dos, Ahri me parece de los campeones más completos de mid ya que tiene movilidad, daño, sustain y cc :)","replies":[]},{"poster":"nightdarkess","date":"2015-12-17T14:12:43.516+0000","up_votes":1,"down_votes":0,"body":"mago:un campeon caster de daño magico que depende en gran medida de sus habilidades\nasesino: campeon que deletea en cero coma uno\nahri campeona caster magica que deletea tiene movilidad y es una zorra (literalmente) que absorve la escensia humana  e.e\n\npd:no es una definiciaon exacta solo resumida para que se ubique un poco que es uno y otro","replies":[]},{"poster":"JACKY FANBOY","date":"2015-12-17T13:44:24.344+0000","up_votes":1,"down_votes":0,"body":"De hecho tiene las 2 si lees su descripicion :V\nPero lo del Charm, eso la mató","replies":[]},{"poster":"oh95","date":"2015-12-17T10:56:50.489+0000","up_votes":1,"down_votes":0,"body":"Ahri me parece muy completa, desde ese cambio a la Q siempre se mantuvo muy bien, estando gran tiempo entre los 3 win rates mas altos de los mid laners, sigue estando bastante bien y para mi cabe en muchas composiciones, ese wave clear con la Q es muy bueno, estas olvidando su sustain con la Q que le permite mantenerse mas en lane y tfs y también el charm es una gran defensa de bruisers y asesinos tanto propia como para tu equipo, tiene buen daño y feed es un gran problema para los carrys rivales, es una maga muy completa, quizás no la mas destacada en tal aspecto pero tiene gran parte de sus cosas por \"encima de la media\" sin llegar a destacar y sinergiza muy bien con muchos campeones. Y olvidaba el gran roaming que llega a tener siendo un mago a parte de seguir aportando muchas mas utilidades.","replies":[]}]}