{"poster":"zelaya19","date":"2016-01-17T06:38:37.961+0000","title":"Decepcionado(Reflexión)","subforum":"Comportamiento del jugador","up_votes":9,"down_votes":4,"body":"**Resumen breve previa al post**: _Reacciones de las personas al jugar LoL (Va m&aacute;s all&aacute; de la toxicidad o no de la comunidad)._\n\nSaben? El League of Legends es un juego muy divertido, adictivo tambi&eacute;n y esto &uacute;ltimo si e importante.\n\nLa comunidad por apariencia tiende a ser buena y uno creer&iacute;a que la gente t&oacute;xica es solamente la que se comporta fuera de las reglas y/o no tiene &eacute;tica ni moral dentro del juego pero a mi criterio no son los &uacute;nicos y a esto es lo que apunta.\n\nYo, personalmente, soy una persona tranquila a&uacute;n en momentos dif&iacute;ciles, y cuando juego a esto lo &uacute;nico que logra es divertirme un rato, pasarla bien sin importar si con tu personaje favorito hiciste una partida espantosa o si te han trolleado, simplemente lo tomo como una buena manera de despejar la cabeza de otras cosas.\n\nRealmente he conocido personas (algunas del foro) que en principio parec&iacute;an ser amables y pregonar buen comportamiento, al menos hasta la hora de entrar en comunicaci&oacute;n v&iacute;a Skype, RC, etc. Nombrar&eacute; solo dos ejemplos de los muchos que me han sucedido y que en su momento me han decepcionado:\n\n- Una mujer con la que he jugado varias veces en Clasificatorias por equipo hasta que me comuniqu&eacute; por skype por &uacute;nica vez. Iba realmente parejo todo pero en mid game empezaron a salir mal las cosas mal. Ella golpeaba el teclado con fuerza y luego insultaba y golpeaba a su hermano. En el chat no hab&iacute;a una sola palabra de ella m&aacute;s que &quot;gg wp&quot;. \n\n- Otra persona con la que he jugado mucho duoQ en normales. Una sola vez rankeamos juntos, el se transform&oacute;. En las conversaciones que ten&iacute;amos aparentaba ser ameno y tranquilo pero cuando jugue ranked con el empez&oacute; a insultar por los aires golpeándose la cabeza contra el escritorio(Estaba perdiendo con su main) y trataba de contenerse hacia mi pero con reales ganas de insultarme debido a mi mal desempeño.\n\nPodr&iacute;a seguir nombrando ejemplos pero no va al caso, la cuesti&oacute;n es que me asusta realmente el comportamiento de las personas detr&aacute;s de una pc.\n\n_&iquest;No se supone que m&aacute;s all&aacute; de la competencia que haya es un juego?\n_\n_&iquest;No tiene como fin entretener a la gente?_\n\n_&iquest;Acaso debo creer que es normal que una persona golpee el teclado o golpee hasta sangrar los pu&ntilde;os contra la pared por haber perdido una clasificatoria? _\n\nMe gustar&iacute;a que me den una opini&oacute;n sincera.\n\nSaludos.","replies":[{"poster":"Jota312","date":"2016-01-17T07:35:56.974+0000","up_votes":4,"down_votes":0,"body":"-Bueno a mi me pasa algo parecido a tus \"super amigos\" de skype , yo no suelo pelear por chat pero si insulto y todo eso en skyp/ts3 , y la verdad no lo veo raro (mientras no se al punto de golpear cosas ajajajajaj, ni insultar a la persona con la que juegas).\n\n-Yo al perder o ver que a alguien le va mal me enojo , por que yo quiero ganar , si bien es un juego para divertirse también es un juego en donde se busca la victoria y como en cualquier competencia nose quiere perder,al ver que me trollean o alguien muere como idiota reacciono enojandome ya que por el perderé, como tambien sere feliz si veo lo contrario(importante que aunque me enojo tambien me rio , si veo que mi compañero de equipo es tan idiota como para morir 5 veces en 5 minutos paso de enojarme rapidamente a reirme , juego a divertirme si bien me enojo yo juego por diversion primero que nada).\n\n-Eso si cabe recalcar que todo lo dije es cuando juego de manera competitiva y con ganas de ganar (aveces me da igual todo y que hagan la mierda que quieran , total es solo un juegito)\n\n¿No se supone que más allá de la competencia que haya es un juego? Como cualquier otro juego si pasa a ser competitivo habra gente enojada y otra feliz (mira cualquier deporte)\n\n¿No tiene como fin entretener a la gente? Me imagino que si , pero entiende que la gente se divierte de maneras distintas , hay gente que no puede perder xd\n\n¿Acaso debo creer que es normal que una persona golpee el teclado o golpee hasta sangrar los puños contra la pared por haber perdido una clasificatoria? NOOOOO , es rarisimo , yo al perder me cago de la risa , intento ver mis errores y mejorarlos nada mas , como mucho pido un report si veo que es necesario","replies":[]},{"poster":"MrFriki","date":"2016-01-17T10:09:29.536+0000","up_votes":2,"down_votes":0,"body":"La magia de lol mai frien, en verdad lol despeja la mente para el que la tiene ocupado en otras cosas, como en mi caso, (gimnasio, hacer material para youtube y estar en busca de trabajo :´v)  o como en el caso de varios: trabajo, pareja, deportes, cosas asi (rutina).\npero la gente que adquiere ese carácter de golpear y tirar la casa por la ventana, son mimados, te la hago corta \"zánganos\"  pibes, minas que no hacen mas que estar todo el dia en frente de la computadora y nada mas, generalmente no tienen rutina, (como algun deporte o trabajo) y al nunca romperse el lomo para conseguir algo, (como el caso de muchos ahorrar para una compu) simplemente adquieren un carácter irresponsable y caprichoso, y lol al tener un ambito tan competitivo y ellos querer ganar siempre (porque los padres nunca le enseñaron que no siempre se logra lo que uno quiere) reagan y tiran todo a la mierd**** practicamente no les dieron la educacion adecuada.\n\n\n***ojo no estoy generalizando, hay chabones que quizás si están todo el dia en la casa, pero le enseñaron valores, a aprender a respetar y cuidar sus cosas***, educación simplificando.\n\nSaludos¡ \n\nPD: tema interesante, no es repetitivo como los típicos post de \"Tengo lag\" \"GG riot\" y cosas asi xD\n\nPPD: Amo league of legends pero odio jugarlo (por su comunidad mas que nada) y ten cuidado, mas adelante te tocara cosas peores a lvl 30...... y rankeds. :b","replies":[{"poster":"zelaya19","date":"2016-01-17T16:47:29.841+0000","up_votes":1,"down_votes":1,"body":"El segundo trabaja y estudia, tiene 21 años, la del primer ejemplo tiene 19 años. xD!\n\nSupongo que puede ser ello, cuando uno no tiene el suficiente tiempo (Salvo el 2015 que tuve que tener un año sabático debido al stress entre otras cosas, ahora rearmando mi vida xD) valora mucho el tiempo que uno usa para jugar.\n\nInteresante observación la tuya! :)\n\nPd: Estoy en oro 5, ya me ha tocado de todo xD!","replies":[{"poster":"MrFriki","date":"2016-01-17T19:46:51.828+0000","up_votes":1,"down_votes":0,"body":"Omaiga, enserio tenia 21 años? >.>\nBueno, cada uno tiene valores distintos.\nYo ahora en unos dias cumplo 18 y poco mas y me obligan a obtener un trabajo, pero no me quejo, nunca viene mal el efectivo.\ny bueno, cuidado con la gente que te encontras en lol CHAN CHAN CHAAANNN, falta que te encuentres un suicida depresivo :´v\nokno\n\nSaludos¡\n\n                                                 \nPD: viva teemo {{summoner:14}}  {{champion:17}} {{summoner:14}}","replies":[]}]}]},{"poster":"Treno","date":"2016-01-17T07:18:23.240+0000","up_votes":2,"down_votes":0,"body":"Yo opino que tenes un iman para la gente desquiciada xD. Yo tambien soy tranquilo, va soy de los que solamente escribe en el chat para organizar al equipo, pero si hasta me insultan solo los muteo y listo, aunque como toooodos hay dias que no te aguantas y le tiras un par de frases como para desaogarte a tus compañeros. Por egg. soy main support, le digo a mi adc, media pila con el farm (es la tipica, soy plata por estos pagos todavia hay gente que no sabe farmear desentemente) o al jg hace 20 minutos que estan pusheando la linea y ni un gank de tu parte media pila. O la otra tipica LAS MIAS MID (aunque es parte de uno la culpa tambien). \nYo por mi parte me hice amigo de un jugador en bronce, ahora el esta en  bronce 5 es buena onda cuando chateamos hasta me ayudo con varios problemas personales que tube. Pero cuando le va mal la partida empieza enfermar a todos con su actitud hiper negatiba, no flamea pero te dan ganas de encajarle una piña igual. Yo considero que esta en bronce 5 por esa actitud negatiba y por que le hace falta un poco de teoria de juego que le estoy enseñando de a poco las dos cosas.\n\nPero si volviendo a tus preguntas.\n¿No se supone que más allá de la competencia que haya es un juego? \n¿No tiene como fin entretener a la gente?\n\nNo solo en league of legends en general en la vida te vas a cruzar con mucha gente, que le pasan muchas cosas, piensan de muchas otras y al final sale lo que vos ves. ALgunos se lo toman muy en serio pero sonn maduros y se saben controlar, otros no se controlan, otros saben cuando tomarce las cosas en serio y cuando no y otros solo disfrutan de lo que pueden. \n\n¿Acaso debo creer que es normal que una persona golpee el teclado o golpee hasta sangrar los puños contra la pared por haber perdido una clasificatoria?\n\nAcaso crees que todas las personas son cuerdas, que no tienen problemas, ya sea cual sea?\nTeniendo en cuenta la cantidad de gente rara que hay y la enorme variedad de personalidades y circunstansias, es... no te diria que normal pero no es ninguna novedad. \nPor otro lado hay un canal de un youtuber español medio famosos que no se ni como se llamaba, que tiene un top de gente enojandoce cuando juegaa videojuegos. Es un poco social tambien el asunto la generacion de gamers de hoy en dia  es mas estupida en ese sentido.\n\nPerdon por mi ortografia tengo sueño no se que hago despierto tan tarde y no tengo ganas de corregir. Suerte con eso.","replies":[{"poster":"Jota312","date":"2016-01-17T07:23:38.407+0000","up_votes":2,"down_votes":0,"body":"posteaste esto x2 borra 1 y duerme mas xd","replies":[{"poster":"Treno","date":"2016-01-17T15:59:09.106+0000","up_votes":1,"down_votes":0,"body":"Listo xD","replies":[]}]}]},{"poster":"Katastrofica","date":"2016-01-17T07:05:19.178+0000","up_votes":2,"down_votes":1,"body":"Antes que nada... No, no es normal.\n\nLeague es un juego para entretener a la gente... Pero su ambiente competitivo es uno muy fuerte, tanto para chocar el comportamiento de las personas.\n\nCreeme, siempre o casi siempre que veas a alguien por un sistema de comunicación con micrófono te llevarás una decepción, pero no es del todo malo... Mira, te explicaré mi punto de vista:\n\nEl juego es arduamente competitivo y cuando algo sale mal la gente se puede frustrar... Yo divido a la gente que se frustra en 2 ramas\n\n1) la flammer: Se dedica a insultar a todo aquel que esté en la partida incluso a las madres de todo aquel que esté en la partida y sus vecinos... Estos jugadores no tienen nada más que hacer que insultarte para calmar sus problemas, si le respondes solo se frustrara más e iniciará el proceso denuevo hasta que crea ser el dueño completo y absoluto de la razón.\n\n2) el callado: Esta posiblemente gritando y hasta quejándose con su vecino por robarle el internet, pero no quiere arruinar a los demás así que no escribe nada mientras grita en su casa.\n\nObviamente si hablamos de ética el callado es mucho peor, pero este se preocupa por sus compañeros y no los insulta... Haciendo la experiencia de juego de los demás mejor.\n\nY el callado es él que conoces al hablar por skype, lamentablemente :/.\n\nLuego tenemos otros problemas y es que como tú dices la gente no considera Lol como un medio de diversión en su totalidad, es más la gente lo considera una real batalla para ver quién es el mejor y solo por perder en un juego pueden llegar a sentirse realmente mal, el juego no tiene leyes ni condiciones de cómo jugar, si no afectas a los demás tampoco te debes afectar a ti, pero cuando afectas la partida de los demás lo más seguro es que ellos te intenten afectar a ti :/.\n\nEn mi opinión Lol es de los mejores juegos creados jamás y sé que la comunidad ahora mismo está mal... Pero también sé que poco a poco podemos cambiar\n\n\nEspero mi opinión te sirva, la hice un poco extensa y en parte de forma inútil ya que solo me pase detallando cosas que dije anterior mente, Saludos.\n\n\nSuerte.{{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"Pablove90","date":"2016-01-17T06:57:49.703+0000","up_votes":2,"down_votes":1,"body":"no lo vas a entender nunca .... no te podes poner en el lugar o razonar como alguien que tiene problemas,... no gastes tiempo... no solo en el lol.. vas a ver gente que hace cosas que no tienen sentido.. pero no podes intentar razonar como ellos... hay gente que viola... hay gente que mato... hay gente que no quiere a sus hijos... gente que disfruta de robar... gente adicta a apostar cosas... etc.. no intentes entenderlos no vas a cambiar sus habitos... eso lleva tiempo y gente profesional el problema viene de sus casas y de sus habitos... solo no te sumes o pongas a la altura.. es triste pero es asi... en el lol y en la vida... yo tengo clientes que vienen con sus mambos y aprendi a no intervenir ni perder tiempo en entender a la gente... mi familia, mi hijo y punto si veo algo que no va afuera de mi circulo... para eso hay profesionales","replies":[]},{"poster":"AuroraExecution","date":"2016-01-17T06:53:53.821+0000","up_votes":2,"down_votes":1,"body":"En el futbol, que tambien es un juego, los jugadores se enojan con el arbritro, lo insultan, le pegan a otros jugadores. Las personas reaccionan de diferentes maneras y se toman las cosas de diferentes maneras.","replies":[]},{"poster":"DieOrSovngarde","date":"2016-01-18T22:16:00.028+0000","up_votes":1,"down_votes":0,"body":"Y bueno, si a vos te gusta perder tiepo de tu vida por culpa de una basura, allá vos. A mi si me molesta.","replies":[{"poster":"zelaya19","date":"2016-01-19T00:24:07.975+0000","up_votes":1,"down_votes":1,"body":"Que te moleste no significa que tengas que romper todo xD!\n\nEn esencia la culpa es de uno mismo siempre. Si no ganás la partida es porque tomaste decisiones equivocadas en la mayoría de los casos.","replies":[]}]},{"poster":"Dark Jaxter","date":"2016-01-18T13:52:46.686+0000","up_votes":1,"down_votes":0,"body":"Yo denunciará a la mujer por agresión doméstica la verdad","replies":[{"poster":"zelaya19","date":"2016-01-18T16:35:51.368+0000","up_votes":1,"down_votes":1,"body":"Y si tuviera la dirección de donde vive por ahí lo hubiese hecho ._.","replies":[]}]},{"poster":"Nottïngham","date":"2016-01-18T04:07:48.378+0000","up_votes":1,"down_votes":0,"body":"El LOL es un juego competitivo... y como todo juego competitivo (sean virtuales o reales) son solo divertidos cuando uno gana (ej. Rankeds), excepto que juegues un juego \"amistoso\", como se denominaria cuando en un deporte real juegan dos equipos diferentes (seria el caso de una Normal en el LOL)","replies":[]},{"poster":"palitroke","date":"2016-01-17T14:55:24.733+0000","up_votes":1,"down_votes":1,"body":"a nadie le gusta perder, pero peor a la riven de este video\nhttps://www.youtube.com/watch?v=KzC1TPG5zcg","replies":[{"poster":"zelaya19","date":"2016-01-17T17:53:45.002+0000","up_votes":1,"down_votes":1,"body":"._.","replies":[{"poster":"palitroke","date":"2016-01-17T20:57:18.719+0000","up_votes":1,"down_votes":0,"body":"el punto es que es la \"pasion\"la que nos mata. fijate sino en yutube el \"tano passman\" cuando river se fue a la B. pobre tipo parecia que se iba a morir XD","replies":[]}]}]},{"poster":"Lord Sonic","date":"2016-01-17T17:44:23.878+0000","up_votes":1,"down_votes":0,"body":"Bueno, anoche yo estaba rankeando con una amiga que esta en bronce 2, y jugamos dos, las dos perdidas, pero en la ultima se enojo, y no me hablo mas, y todavía no se conecto. Admito que jugué mal, y vendí la partida, pero enojarse y dejarme de hablar por una partida en un juego online, me parece excesivo y estúpido. De todas formas, volvió a subir, así que seguro se le paso.","replies":[]},{"poster":"Sonya Kyron","date":"2016-01-17T14:24:57.768+0000","up_votes":1,"down_votes":0,"body":"Yo cuando se empieza a pelear el Team, mando votación de surrender y digo \"Surrendiemoas ahora que todavia vamos ganando\" el 50% se calman y ganamos la partida, la otra mitad o surrendeamos por mal teamwork o perdemos con varios jugadores muteados.\nMi peor partida tire surrender a los 20 y cada 5 minutos hasta los agonicos 62 minutos, donde gane porque teníamos mejor late, pero hasta el minuto 59 ellos la tenían RE-GANADA y mi equipo estaba todo peleado.\n\nAcostumbrate, estas cosas pasan mucho mas en ranked que en Normal, pero hasta me ha pasado en ARAM.","replies":[{"poster":"zelaya19","date":"2016-01-17T17:03:28.575+0000","up_votes":1,"down_votes":1,"body":"Y eso que tiene que ver con mi thread O.o","replies":[]}]},{"poster":"Nombre ofensivo","date":"2016-01-17T13:06:26.878+0000","up_votes":1,"down_votes":0,"body":"Buenas, te cuento mi caso personal, yo suelo decir algún insulto mientras estoy hablando por skype PERO es una costumbre que me quedo de cuando era un chico y nos juntábamos en el cybercafe a jugar casi cualquier juego XD, pero es algo que hago entre amigos y me sale naturalmente. No insulto en el chat del LOL obviamente por que se puede mal interpretar, el otro irse afk, etc.\nExplicado mi caso(y creo que el de varios) creo que alguien puede terminar insultando a otro por casi cualquier juego, como nombran en otros comentarios el caso del fútbol y varios juegos mas, ahora el que exista un ámbito competitivo obliga a los participantes a crear un ambiente optimo para la concentración, etc. Básicamente ocurre que las personas olvidan este detalle, entonces se producen  casos como los que describís vos. Ahora bien lo que acabo de escribir justifica en algo esa conducta? claramente no.\npersonalmente creo que como es un juego te puede producir varios estados de animo entre ellos frustración, tristeza, enojo, alegría,etc. y las personas reaccionan de distinta manera a esos estados(desde festejar hasta fedear a {{champion:17}} {{item:3077}} a proposito)\n\nInteresante tu post y saludos\n\n\n\n> {{champion:17}} {{item:3077}} {{summoner:11}} _Esa build no, no, NO!_","replies":[]},{"poster":"Paranøid","date":"2016-01-17T08:24:23.038+0000","up_votes":1,"down_votes":0,"body":"Justamente hoy estaba hablando con mi hermana sobre la gente que se encuentra en este juego. \n\nYo no soy un santo y no puedo decir que no me haya enojado alguna vez jugando. Pero hay puntos muy excesivos y siempre me tranquilizo diciendome que solamente es un juego y si juego mal, esta bien, porque para eso juego, para mejorar. Ahi es donde logro entender que solamente es un juego y no afectarme por lo que me diga la gente si juego mal.\n\nAhora... existe la gente que parece creer que es un pecado jugar mal y te insultan a mas no poder en este caso. Y yo me pregunto: cuando alguien hace algo mal por no saber hacerlo, ¿lo insultamos o le enseñamos a hacerlo bien?. He aprendido con el tiempo que es preferible orientar a las personas antes que insultarlos.\n\nLo que vos comentas son extremos y gracias a dios no me toco hablar con gente asi, pero si me ha tocado jugar con ellos y de verdad te hace pensar como transforma este juego o todos los juegos a las personas. Es tristisimo, porque podria ser un juego sano donde todos se diviertan, pero no, hay gente que sufre mas este juego que otra cosa por el trato que se encuentra.\n\nHe llegado a encontrarme con una persona que me deseó que me pase algo muy malo y me advirtió que me cuidara... cuanto es el odio que se puede generar en un simple juego? o sera que no es el juego y realmente hay gente que esta muy mal con la vida?\n\nEn fin, es increible lo que encontramos hoy en dia en internet.","replies":[{"poster":"zelaya19","date":"2016-01-17T17:02:00.634+0000","up_votes":1,"down_votes":1,"body":"Capaz reflejan su vida en el juego, y al ver que el único lugar donde puede \"triunfar\" fracasan rotundamente ahí se desencadena toda su frustración.\n\nMe acuerdo que una de las personas me decía \"No todos reaccionamos iguales, tenés que aprender eso\" tratando de justificar los puñetazos a la pared\n\nSupongo que la mayoría de los que juegan son gente sana pero siempre hay algún que otro extremo. Yo el LoL lo elegí solamente porque jugaban mis amigos y me insistieron para que me despejara un poco de la facultad y el trabajo pero yo realmente no jugaba a ningún juego desde hacía 4 años, el último había sido el lineage 2 (Antecesor del WoW) y recuerdo que en ese juego no había gente gritando de esa forma, eran más amables todos, nadie gritando ni algo parecido.","replies":[]}]}]}