{"poster":"zelaya19","date":"2016-01-04T01:11:31.325+0000","title":"¿Malzahar necesita un rework?","subforum":"Charlas Generales","up_votes":7,"down_votes":2,"body":"Buenas, quisiera que me den su opini&oacute;n acerca de este ente del vac&iacute;o.\r\n\r\nMalzahar es un gran mago sobre todo contra tanques, sin embargo noto que su kit de habilidades no le permite ir mucho m&aacute;s all&aacute; y adem&aacute;s que tiene mec&aacute;nicas un poco t&oacute;xicas aunque predecibles, muy poco vers&aacute;til.\r\n\r\nSi bien tiene una muy buena fase de lineas, en elos m&aacute;s decentes (no es mi caso xD) su dps suele ser bastante predecible y por lo tanto es f&aacute;cil evitar que Malzahar te infecte en linea, inevitablemente pusheando la linea y todo mago sin movilidad que se excede pusheando tiene al jungla enemigo atr&aacute;s suyo, saben como termina esa historia.\r\n\r\nSin embargo, su ultimate a mi gusto para ser un midlaner me parece muy t&oacute;xica y sin counterplay alguno(En fase de lineas). Una supresi&oacute;n bien aplicada sumado al resto de su combo(El cual incluye un silence) es una muerte casi segura a favor de Malzahar (**No estoy diciendo que est&eacute; roto**). La supresi&oacute;n de la ultimate se puede quitar con {{item:3140}} pero eso significa que uno tiene que invertir sus primeros 1300 de oro sacrificando otros atributos como da&ntilde;o, cdr, etc. La R de Malzahar, aunque es muy t&oacute;xica en linea, en teamfight es muy peligroso estar ulteando ya que son unos segundos en los cuales Malzahar queda inmovil y por lo tanto desprotegido.\r\n\r\nDesde que juego, hace 2 a&ntilde;os, jam&aacute;s he visto a Malzahar en competitivo y sinceramente me parece un campe&oacute;n aburrido de enfrentar y de jugar. Qu&eacute; tenga un win rate muy alto hace mucho tiempo no significa que el personaje no est&eacute; desactualizado, algo mal anda en el a mi parecer frente a todas las opciones existentes.\r\n\r\nLes dejo una encuesta de paso.\r\n\r\nSaludos :)","replies":[{"poster":"Neo Gaussrik","date":"2016-01-04T15:45:33.631+0000","up_votes":10,"down_votes":0,"body":"Me parece muy bien planteada tu discusion! Felicitaciones por eso. :) {{item:2052}} \n\nEn lo personal, yo caracterizo a Malzahar como un mago enfocado en \"atrapar\" amenazas; asi sea un tirador expuesto, un mago de daño sostenido, o un asesino, Malzahar brilla cuando logra negar un jugador clave del equipo enemigo.\n\nEn ese sentido, siento que Malzahar ya es un mago mas bien unico, ya que no hay nadie mas en el juego que cumpla ese rol, quizas con la excepcion de Lulu (cuya definitiva tambien puede \"quitar\" la amenaza de un asesino si es usada bien), e incluso asi nadie diria que Malzahar y Lulu se \"juegan igual\" o \"Hacen lo mismo\".\n\nPor ello, si Malzahar fuera a recibir una actualizacion, creo que necesitaria ser primariamente visual, y secundariamente para cambiar una u dos habilidades, pero nunca uno completo como el de Poppy.\n\nRecalco que esta es mi opinion personal como jugador y no una opinion oficial de Riot Games al respecto!\n\nSaludos!","replies":[{"poster":"KMG Nooz","date":"2016-01-04T16:31:58.890+0000","up_votes":1,"down_votes":0,"body":"Amigo gaussrik se que es fuera de tema pero sabes que paso con las ofertas? aun no estan disponibles y quiero comprar una skin en oferta :C","replies":[]}]},{"poster":"N1725","date":"2016-01-04T13:28:41.093+0000","up_votes":3,"down_votes":0,"body":"Para mi solo necesita un rework visual, nada mas.\n\nEl resto es solo posicionamiento,  saber en que momento entrar a la pelea, cuando tomar la ofensiva etc.\n\nPara mi la ausencia de malza de competitivo va solo por su movilidad y rango de error. \n\nActualmente vez campeones que tienen métodos de escape que te puedan salvar en caso de sobre exponerte,  por esa razon muchos champs quedan fuera del competitivo,  pero para el juego normal de soloq o ranked team anda excelente","replies":[{"poster":"IVO723","date":"2016-01-04T20:44:34.684+0000","up_votes":1,"down_votes":0,"body":"si tuviera escape estaria demasiado op","replies":[]},{"poster":"zelaya19","date":"2016-01-04T13:45:10.059+0000","up_votes":1,"down_votes":0,"body":"Yo apunto más a su versatilidad, es un campeón que el cual su techo de habilidad es limitado frente a otros. Para dar un ejemplo de campeón inmovil, Syndra, sus habilidades te permiten desenvolverte de diferentes maneras y el mainearlo es muy bien recompensado. A su vez las habilidades de Syndra le dan tiempo al enemigo de responder. \n\nNo me preocupa tanto el metagame, si no que siento que su kit de habilidades podría ser mejor.","replies":[{"poster":"N1725","date":"2016-01-04T13:55:09.464+0000","up_votes":1,"down_votes":0,"body":"Entiendo tu punto,  pero a mi gusto (ya cosa totalmente personal) encuentro que su kit ofrece todo lo necesario es un champion equilibrado en riesgo vs recompensa,  \n\nSi bien es inmovil como syndra, este tiene un sustain y mayor facilidad de farmeo, por lo cual su fase de líneas es bastante decente, luego en tf ya como dije antes todo depende de posicionamiento, sumado a control de mapa.\n\nClaramente no tiene la facilidad de un yasuo zed o lb para entrar y salir pero puedes hacer un daño gigante detras de todos junto con un excelente ulty.","replies":[]}]}]},{"poster":"Kausmawl","date":"2016-01-04T22:53:15.806+0000","up_votes":2,"down_votes":0,"body":"un reworksito visual a mi amiwo {{champion:2}}  he needs it {{sticker:slayer-pantheon-thumbs}}","replies":[]},{"poster":"II Thanatos II","date":"2016-01-04T04:32:59.048+0000","up_votes":2,"down_votes":0,"body":"Malzahar AD  Op xD","replies":[]},{"poster":"Hexplosivo","date":"2016-01-04T02:36:42.889+0000","up_votes":2,"down_votes":0,"body":"Yo lo he jugado un poco, y la verdad debo decir que el kit podría llevarse unos tweaks sin problemas, para mejorar la fluidez durante el juego.\nLo que más me molesta, es lo perdida que está la pasiva con Malzahar. Bien podría ser una sola habilidad con la E (ya que es la habilidad con la que más interactúa), que permita tener un minion permanente de forma pasiva, y que la marca funcione más o menos como lo hace actualmente. Incluso podría estar interesante que la forma en que interactúa con los hechizos cambiara, por ejemplo que el Voidling se produzca de forma fija cada 21 segundos (cosa que siempre tuvieras uno) pero que usar habilidades baje este enfriamiento, permitiendo tener un flujo más estable de Voidlings, porque actualmente, si no empiezas generando cargas desde el segundo 1 de la partida, ya tienes trabajo extra que hacer en los primeros minutos.\nLuego, tiene dos habilidades de daño en área, y una que se propaga en área; solo tu R te da daño contra un objetivo, pero para hacer todo su potencial de daño tienes que:\n- Tener la W puesta bajo tu objetivo.\n- Tenerle la E puesta desde antes a tu objetivo.\n- Tener a un voidling ojalá con el buff de los 14 segundos.\n- Tener seguridad de que no te van a interrumpir en tu estado completamente vulnerable.\nLo que me parece muchas condiciones para la única habilidad de un objetivo y de daño directo.\nPor otro lado, tiene muchísima utilidad: silencio, daño % de vida  en área, split-push fuerte, etc.\nEntonces quizás mejorarle el otro daño de un objetivo que tiene, el del Voidling, para escalar más acorde con un mago (el voidling no escala AP, solo aplica efectos de {{item:3116}} y creo que {{item:3071}}) y no a un extraño caster AP con items de AD/ArPen solo para beneficiar a este minion.\nEso, y quizás alguna otra mecánica para aprovechar a los bichitos (quizás que cuando se use Q sobre ellos, exploten y hagan daño en área).\nNo sé, yo creo que con un pequeño reacondicionamiento quedaría super.","replies":[]},{"poster":"Yrox the Third","date":"2016-01-04T01:34:30.801+0000","up_votes":3,"down_votes":1,"body":"Malzahar esta muy bien parado en este momento, no necesita cambio alguno.","replies":[{"poster":"Fetgod","date":"2016-01-04T01:56:17.948+0000","up_votes":2,"down_votes":0,"body":"Y un rework visual tampoco?\nlo veo muy feo en el juego y en las fotos de sus habilidades","replies":[{"poster":"O2 Tri Edge","date":"2016-01-05T00:04:16.602+0000","up_votes":1,"down_votes":0,"body":"Hay muchos que lo necesitan mas que Malza... {{champion:36}} {{champion:83}} {{champion:44}} {{champion:33}} {{champion:6}}","replies":[]},{"poster":"Yrox the Third","date":"2016-01-04T02:05:35.360+0000","up_votes":1,"down_votes":0,"body":"No lo nesecita tan urgente.","replies":[]}]}]},{"poster":"erwinchelo","date":"2016-01-04T01:36:52.038+0000","up_votes":2,"down_votes":1,"body":"Hay pocos Hypercarrys Ap en el juego, Malza sufre lo que todo carry de este tipo sufre fuera de fase de linea, dependencia hacia sus aliados.Considero que si necesita unos ligeros o grandes cambios que actualicen su modo de juego aun si esto se carga parte de su identidad, similar a lo de Fiora por asi decirlo, mientras sea para bien, esto lo veo venir mucho despues de los rework de Taric, shen, WW, Cho,Galio, irelia, teemo, quienes siguen en la lista de ser actualizados visual o mecánicamente o relanzados.","replies":[{"poster":"Fenrito","date":"2016-01-04T21:10:26.309+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=erwinchelo,realm=LAS,application-id=v7qsfXsE,discussion-id=VT0rtqys,comment-id=0001,timestamp=2016-01-04T01:36:52.038+0000)\n>\n> Hay pocos Hypercarrys Ap en el juego, Malza sufre lo que todo carry de este tipo sufre fuera de fase de linea, dependencia hacia sus aliados.Considero que si necesita unos ligeros o grandes cambios que actualicen su modo de juego aun si esto se carga parte de su identidad, similar a lo de Fiora por asi decirlo, mientras sea para bien, esto lo veo venir mucho despues de los rework de Taric, shen, WW, Cho,Galio, irelia, teemo, quienes siguen en la lista de ser actualizados visual o mecánicamente o relanzados.\n\nUn chogat es lento pero con un par de items te parte la cara y mas si estas a baja vida es un qwr y te comio entero\n\n\nPara mi esta bien, fuera de fase de linea, el ulti sirve para desintegrar a alguno que este haciendo un mal roaming. En tf es mejor estar lejos y dedicarce a tirar las otras habilidades. Eso si gracias a su combo es muy poderoso estando bajo torre y puede soportar bien los pusheos si sabe retirarce a tiempo","replies":[{"poster":"erwinchelo","date":"2016-01-04T21:45:16.447+0000","up_votes":1,"down_votes":0,"body":"Se bastante como usar a Cho, es medio tedioso, cuando alguien te cuenta algo que ya sabes, no es como si yo necesitase o pidiera una orientación de como jugarlo o se usa o buildea, uno solo pone que tendra su eventual rework y  te guste o no su actual kit.","replies":[]}]},{"poster":"La corrupción","date":"2016-01-04T04:10:37.738+0000","up_votes":1,"down_votes":0,"body":"irelia? cho? .-. espero que entren dentro de lo visual.","replies":[{"poster":"Ks Erwyn","date":"2016-01-04T11:49:32.351+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Kakunos,realm=LAS,application-id=v7qsfXsE,discussion-id=VT0rtqys,comment-id=00010000,timestamp=2016-01-04T04:10:37.738+0000)\n>\n> irelia? cho? .-. espero que entren dentro de lo visual.\n\n\nEn cho se que sera visual y en alguna habilidades en Irelia visual mas que nada, estamos hablando de uno de los campeones mas viejo del juego cuyas partículas des-actualizadas pasan una mala jugada en el plano de claridad de juego.","replies":[]}]}]},{"poster":"Pititoh Kawaii ","date":"2016-01-04T23:30:33.186+0000","up_votes":1,"down_votes":0,"body":"si cambian su splash art, desistalo el lol xD, no juego malzahar pero es que su imagen el simplemente: hermosa <3","replies":[]},{"poster":"ShirayRyu","date":"2016-01-04T21:01:58.959+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=zelaya19,realm=LAS,application-id=v7qsfXsE,discussion-id=VT0rtqys,comment-id=,timestamp=2016-01-04T01:11:31.325+0000)\n>\n> Buenas, quisiera que me den su opini&oacute;n acerca de este ente del vac&iacute;o.\n> \n> Malzahar es un gran mago sobre todo contra tanques, sin embargo noto que su kit de habilidades no le permite ir mucho m&aacute;s all&aacute; y adem&aacute;s que tiene mec&aacute;nicas un poco t&oacute;xicas aunque predecibles, muy poco vers&aacute;til.\n> \n> Si bien tiene una muy buena fase de lineas, en elos m&aacute;s decentes (no es mi caso xD) su dps suele ser bastante predecible y por lo tanto es f&aacute;cil evitar que Malzahar te infecte en linea, inevitablemente pusheando la linea y todo mago sin movilidad que se excede pusheando tiene al jungla enemigo atr&aacute;s suyo, saben como termina esa historia.\n> \n> Sin embargo, su ultimate a mi gusto para ser un midlaner me parece muy t&oacute;xica y sin counterplay alguno(En fase de lineas). Una supresi&oacute;n bien aplicada sumado al resto de su combo(El cual incluye un silence) es una muerte casi segura a favor de Malzahar (**No estoy diciendo que est&eacute; roto**). La supresi&oacute;n de la ultimate se puede quitar con {{item:3140}} pero eso significa que uno tiene que invertir sus primeros 1300 de oro sacrificando otros atributos como da&ntilde;o, cdr, etc. La R de Malzahar, aunque es muy t&oacute;xica en linea, en teamfight es muy peligroso estar ulteando ya que son unos segundos en los cuales Malzahar queda inmovil y por lo tanto desprotegido.\n> \n> Desde que juego, hace 2 a&ntilde;os, jam&aacute;s he visto a Malzahar en competitivo y sinceramente me parece un campe&oacute;n aburrido de enfrentar y de jugar. Qu&eacute; tenga un win rate muy alto hace mucho tiempo no significa que el personaje no est&eacute; desactualizado, algo mal anda en el a mi parecer frente a todas las opciones existentes.\n> \n> Les dejo una encuesta de paso.\n> \n> Saludos :)","replies":[]},{"poster":"Mr Cold","date":"2016-01-04T17:41:32.927+0000","up_votes":1,"down_votes":0,"body":"sigo esperando a que te cambies de nombre a zelaya20\n{{champion:83}}","replies":[{"poster":"zelaya19","date":"2016-01-04T19:49:14.386+0000","up_votes":1,"down_votes":0,"body":"Ya me cambié el nick hace rato, esta no es mi cuenta principal. \n\nPor cierto, no elegí ningún nick del post, no me convencieron :(","replies":[]}]},{"poster":"thebasti","date":"2016-01-04T17:21:53.827+0000","up_votes":1,"down_votes":0,"body":"Quiza lo cambien en un futuro, ya que anunciaron que harian cambios en los ap sin movilidad como paso con los adc","replies":[]},{"poster":"Revolución","date":"2016-01-04T07:22:40.834+0000","up_votes":1,"down_votes":0,"body":"me quedo con tu última frase \"Qué tenga un win rate muy alto hace mucho tiempo no significa que el personaje no esté desactualizado, algo mal anda en el a mi parecer frente a todas las opciones existentes\" y lo aplico a Malphite que para mí necesita un rework y hasta incluso se ha visto en competencia, creo que excepto el ulti de la piedra todas las habilidades están un poco bastante desactualizadas.","replies":[]},{"poster":"Atun","date":"2016-01-04T01:38:41.962+0000","up_votes":1,"down_votes":3,"body":"No me toques a malza, no necesita nada. El que no se ocupe en competitivo es porque hay otros que ofrecen otras cosas, pero si le hacen un rework se vuelve un ciclo vicioso:\n\nCampeon A olvidado recibe rework con 2 posibilidades:\n\nA) El rework es entretenido pero no le es suficiente para recibir atencion permanente, sigue \"olvidado\"\nB) Se vuelve muy popular y desplaza a campeon B en el perfil que comparten. Campeon B se va al \"olvido\".\n\nLuego de 1 año, la gente empieza a pedir rework para el campeon B porque esta olvidado y se repite el ciclo.\n\nNunca tiene fin, porque la gente siempre dara preferencia al campeon que de la mayor cantidad de valor y dejaran de lado a los campeones menos \"eficientes\".","replies":[{"poster":"Fetgod","date":"2016-01-04T01:55:18.677+0000","up_votes":1,"down_votes":0,"body":"Para mi necesita un rework las fotos de sus habilidades,se ven muy pobres","replies":[]}]},{"poster":"Hnk Kenshiro","date":"2016-01-04T01:54:39.866+0000","up_votes":1,"down_votes":0,"body":"Malzahar tiene muy buen daño y kit de habilidades, pero en tfs para mi es un poco complejo de llevar, ya que esta entre un mago asesino y uno de pocke.\nA comparacion de campeones como{{champion:161}} {{champion:63}}, malzahar tiene cds más altos en sus habilidades, asi que si fallas una debes de retroceder para evitar una iniciacion fuerte por parte de cualquier team, es decir, es muy mal pockeador.\nA comparacion de campeones como {{champion:7}} {{champion:103}}, malzahar no tiene ninguna habilidad para poder desplazarse, por lo que si buscas reventar al adc enemigo tendras muchos problemas para traspasar la front line enemiga.\n\nLa Q de malzahar es un silencio en area de 3.4 segundos owo , pero si la lanzas sin que haya más fuego de ataque, seguramente te la evadiran.\nLa W (que le quitaron un 2% de daño U.U ) hace daño por segundo, en vez de habilidades como drenar de fidd o el pozo de morgana que son cada medio segundo, teniendo menos efectividad\nLa E tiene poco más daño que su Q, puedes tener infinitos enemigos infectados, pero solo si estan cerca cuando muere otro contagiado, tambien, un mismo enemigo no puede sufrir más de una vision malefica al mismo tiempo. Atrae a los entes del vacio, pero si les diera un pequeño bonus de velocidad la pasiva seria mucho más efectiva\nSu ulti no la pudes usar para iniciar, es una canalizacion y tiene poco rango, te la cortaran con cualquier cc.\n\nA malzahar no puedo catalogarlo dentro de un grupo amplio de magos, lo veo más para cancelar ciertas iniciaciones, ya que, cuando tus aliados retengan al enemigo, podras usar la Q para dejarlos mudos, si el combate se consentra en un punto, puedes dispersarlos con el pozo, las visiones maleficas atraeran a los entes del vacio que frenaran skill shot (como el ejercito de yorick), y si algun pillo los pasa a todos y se adelanta para matarte, usas la ulti de forma ofeciva/defenciba para que el team le haga focus.\n\n\nPor cierto, malzahar no es un ente del vacio, solo recibio su poder :p","replies":[]}]}