{"poster":"KingDanius","date":"2016-01-24T18:46:36.880+0000","title":"Champion Ordner für Championselect !","subforum":"Champions & Gameplay","up_votes":13,"down_votes":0,"body":"Hallo,\nIch habe mir &uuml;berlegt, das es eigentlich sinnvoll w&auml;re, sich im Client &#039;&#039;Ordner&#039;&#039; zu erstellen, diese Benennen und in diesen, Champions hinzuzuf&uuml;gen.\nAuf diese Ordner k&ouml;nnte man dann in der Championselect zugreifen und sich von dort aus, an seine Lieblings Champions orientieren.\n\nBeispiel: Ich erstelle mir einen Ordner in meinem Profil, &auml;hnlich wie Item Sets.\nIch benenne ihn &#039;&#039;Supporter&#039;&#039; und kreuze dann z.B. Janna, Bard, Soraka und Alistar an.\nWenn ich dann ein Spiel spielen m&ouml;chte und in der Championselect bin, werden mir z.B. an der Seite, alle meine Ordner gezeigt.\nAlso klicke ich auf meinen erstellten &#039;&#039;Supporter&#039;&#039; Ordner und sehe alle Champions, die ich dort hinzugef&uuml;gt habe.\n\nDiese Funktion w&auml;re vor allem dann gut, wenn man gerade nicht wei&szlig;, auf welchen Champion man lust hat, oder wenn man einen Counter\nzu bestimmten Champions sucht.\nSo hat man immer den &Uuml;berblick auf all seine Lieblings Champions.\nAu&szlig;erdem w&auml;re diese Funktion bestimmt sehr einfach einzubringen und w&uuml;rde auch niemanden schaden, selbst wenn man sie nicht benutzt.\n\nIch hoffe jemand von Riot wird sich diesen Thread angucken. wenn es euch gef&auml;llt, bitte upvoten damit es mehrere sehen!\n\nP.S.\nJa, mit ist schon bewusst das man in der Championselect, \"marksman\",\"Support\" usw. Filtern kann, das hilft mir jedoch nicht viel weiter. (siehe Kommentar weiter unten)","replies":[{"poster":"Kermit yourself","date":"2016-01-24T19:38:12.093+0000","up_votes":3,"down_votes":1,"body":"Du kannst dir mal LoL Summoners Informatioan ansehen. ist ein Programm, das Spiele aufzeichnet, Statistiken erstellt und unter anderem kannst du den Championfilter bearbeiten. Heißt normalerweise kannst du in der Champion Auswahl in die Suchleiste \"Support\" eingeben und dir werden alle Supports angezeigt, und diese kannst du damit ändern und zB Thresh entfernen und Teemo hinzufügen. Du kannst aber auch neue Gruppennamen erstellen und in diese beliebige Champions einfügen.","replies":[{"poster":"KingDanius","date":"2016-01-24T21:38:06.001+0000","up_votes":3,"down_votes":0,"body":"Ja,\nmir ist auch bewusst das es tausende 3rd Party Programme für LoL gibt, aber das ist ja auch keine Lösung.\nEs wäre doch viel einfacher, es einfach in das Spiel einzubauen, bei den Jungle Timern etc haben sie es ja auch gemacht, obwohl es für diese Sachen auch Programme gab.\nAber trotzdem Danke, werde es mir mal anschauen :D","replies":[]}]},{"poster":"NoTeamFound","date":"2016-01-25T08:37:02.176+0000","up_votes":1,"down_votes":1,"body":"Du kannst doch in der Champselect im suchfeld, wo man halt die champs filtern kann, anstatt den name des Champs, einfach mal Support oder Schütze eingeben. dann kommen alle adc's oder halt supps. je nach dem was man da halt eingibt =)\n\nLG Saveshot","replies":[{"poster":"KingDanius","date":"2016-01-25T14:57:36.091+0000","up_votes":2,"down_votes":0,"body":"Ja, das ist mir schon bewusst.\nAber das ist ja nicht das was ich meine, das mit dem \"Supporter\" war nur als Beispiel gedacht.\nIch meinte das so, das man sich mehrere Ordner erstellen kann und ich den einen eben \"Ap Jungler\" nenne oder so.\n\nDas mit der Suchfunktion zeigt eben nur grob alle Magier, adc usw. Ich meine, sogar Leona, Blitz und Alistar werden ja nicht mal als Support, sondern als Tanks angezeigt...\n\nWie gesagt, mit eigenen Filtern / Ordnern könnte Mann sich viel besser orientieren wenn du zb jungle bist, normaler weise assassine spielst aber ihr für eurer Team dringend einen tank braucht, kannst du in deinem Ordner nachgucken, fals dir grade eben nicht alle Champions für diese Rolle einfallen.\n Aber trotzdem danke {{champion:17}}","replies":[{"poster":"NoTeamFound","date":"2016-01-25T15:04:05.655+0000","up_votes":1,"down_votes":0,"body":"achsooo ha ja klar das wär bestimmt auch eine coole option :D\n\nLG Saveshot","replies":[]}]},{"poster":"De Kus","date":"2016-01-25T16:39:20.171+0000","up_votes":1,"down_votes":0,"body":"Davon abgesehen sind viele Charaktere, die dort auftauchen, in der heutigen Meta nicht mehr als Support gespielt (Ashe lässt grüßen) und ganz andere Meta-Supports wie Trundle oder Annie tauchen dort erst gar nicht auf.","replies":[]}]},{"poster":"duallord","date":"2016-01-25T10:34:03.209+0000","up_votes":2,"down_votes":0,"body":"Finde ich eigentlich auch ganz gut","replies":[]},{"poster":"wolf454","date":"2016-01-24T19:49:50.488+0000","up_votes":1,"down_votes":5,"body":"eig sollte man seine champs kennen die man spielt:D","replies":[{"poster":"KingDanius","date":"2016-01-24T21:36:02.868+0000","up_votes":2,"down_votes":0,"body":"Naja, wenn ich im Ranked nicht unbedingt meine Lane komme oder wir zum Beispiel doch noch einen Tank brauchen würden, könnte ich einfach schnell unter meinem Ordner für ''Tank Jungler'' oder so nachsehen ^^","replies":[]}]},{"poster":"sN00Bdogg","date":"2016-01-25T17:17:11.273+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=KingDanius,realm=EUW,application-id=Wj1wcocU,discussion-id=l1sevbdk,comment-id=,timestamp=2016-01-24T18:46:36.880+0000)\n>\n> Au&szlig;erdem w&auml;re diese Funktion bestimmt sehr einfach einzubringen und w&uuml;rde auch niemanden schaden, selbst wenn man sie nicht benutzt.\n> \n> \n\nSo einfach ist das sicherlich nicht und gerade vor dem Hintergrund, daß gerade massive Probleme mit dem Patch 6.1. zu lösen sind, kann man ja erkennen wie schwierig es ist Änderungen am Spiel umzusetzen und bugfrei zum Laufen zu bringen. Ich würde mir wünschen, daß die Entwickler bei RIOT sich vornehmlich mit diesen Dingen beschäftigen, als mit \"Tools\", die zu guter Letzt kaum jemand benutzt.\n\nVielleicht ist es einfacher wenn Du Dir ein kleines Excel/Word/Text-file auf dem Desktop ablegst. \n\nAusserdem gibt es viele interessante Seiten im Netz! Was mir zum Beispiel immer wieder hilft ist:\n http://www.lolcounter.com/champions\nDa kannst Du Dir schnell und bequem anzeigen lassen, mit wem Du Deinen voraussichtlichen Lanegegner countern kannst.","replies":[]},{"poster":"Allisrem2","date":"2016-01-25T05:32:10.876+0000","up_votes":1,"down_votes":0,"body":"Leider gab es den Vorschlag schon sehr oft und es wurde von Riot nicht umgesetzt...\nAber da ich im Moment eh jedes Spiel dodge in welchem ich nicht meine Mainposition bekomme ist das ja auch egal x)\nEigentlich sehr schade, die Idee wäre wahrscheinlich wirklich simpel umzusetzen und wäre sehr interessant.","replies":[]}]}