{"poster":"KingDanius","date":"2017-05-02T21:22:47.934+0000","title":"League in 2D - Wer möchte mitmachen?","subforum":"Skin- & Champion-Konzepte","up_votes":2,"down_votes":0,"body":"#Hallo!\r\nIch habe mich vor einem halben Jahr drangesetzt um ein eigenes LoL in 2D zu erstellen und bin bis lang relativ weit gekommen!\r\nEs gibt bereits 2 LoL Charaktere, 2 Community Charaktere und 2 von mir Erstellte.\r\nDas Spiel ist komplett kostenlos und es gibt keinerlei erkaufbaren Content.\r\n\r\nhttps://kingdanius.itch.io/league-of-pixels-2d-moba\r\n\r\nWolltet ihr jemals euren Champion in einem Spiel sehen? Dann ist das die Gelegenheit, da ich noch ein Paar gut durchdachte Konzepte suche!\r\nAuch suche ich noch Leute, die bei dem Erstellen des Pixel-Arts helfen, bei bedarf melden.","replies":[{"poster":"Shakês Beer","date":"2017-05-08T17:25:50.744+0000","up_votes":1,"down_votes":0,"body":"Ist es beabsichtigt, dass man einfach das ganze downloaden kann ohne zu zahlen?\nIch finde es hat noch zu wenig Kontent, mach etwas weiter und vll. es Adaptable für Android und du bekommst nen zwaniger von mir.","replies":[{"poster":"KingDanius","date":"2017-05-08T19:12:13.727+0000","up_votes":1,"down_votes":0,"body":"P.S. grade nochmal ausprobiert mit dem Handy. Es liegt wohl an der Anzahl der Objekte und geht leider nur flüssig, wenn ich die halbe Map entferne..\nEventuell versuche ich mich später einmal mit einem kleinerem LoL-Spiel für Handy!\n\nWas würdest du dir denn sonst noch an neuen Content vorstellen? Mir gehen die Ideen aus. Eher neue Champs oder was genau?","replies":[]},{"poster":"KingDanius","date":"2017-05-08T18:28:06.178+0000","up_votes":1,"down_votes":0,"body":"Ja, es ist komplett free. Hatte mal ne kostenpflichtige Version, jedoch habe ich sie entfernt wegen Riot Rechten und so, hab wohl vergessen die Beschreibung zu adden. (das letzte mal vor ~4 Monaten xD )\nEs hat noch relativ wenig Kontent, da ich leider nicht ganz so viel Zeit dafür investieren kann neben der Schule.\n\nAndroid Version habe ich zwar, jedoch laggt es ziemlich. Ich muss erst mal herausfinden was die laggs auslöst.","replies":[]}]},{"poster":"ToxicTeemoPolice","date":"2017-05-03T11:58:31.971+0000","up_votes":1,"down_votes":0,"body":"Wie soll ich mich melden ? ;) ingame kann ich es nicht da deine Freundesliste voll ist","replies":[{"poster":"KingDanius","date":"2017-05-03T21:25:52.734+0000","up_votes":1,"down_votes":0,"body":"Sollte nun gehen, habe ein paar inaktive Freunde gelöscht :)","replies":[]},{"poster":"KingDanius","date":"2017-05-03T13:40:14.023+0000","up_votes":1,"down_votes":0,"body":"Oh echt?\n\nMuss die dann mal wieder säubern ^^\nVersuch mich dann einfach nochmal zu adden","replies":[]}]},{"poster":"Shacoláde","date":"2017-05-03T12:32:14.778+0000","up_votes":1,"down_votes":0,"body":"FInd ich cool! Werd ich mir heut abend mal anschauen! :))","replies":[{"poster":"KingDanius","date":"2017-05-03T13:39:42.617+0000","up_votes":1,"down_votes":0,"body":"Danke! :)","replies":[]}]}]}