{"poster":"KingDanius","date":"2016-09-08T15:46:32.597+0000","title":"Suche nach Casual 3vs3 Rankedteam Mitglied/-ern!","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"#Hey!\nIch/Wir suchen noch ein Paar Mitglieder f&uuml;r unser 3vs3 Rankedteam! Hardcore Aktivit&auml;t wird nicht verlangt, jedoch zu mindest das ein oder andere Match mitzuspielen ^^ \nSolange ihr nett seid werdet ihr sowieso nicht rausgeschmissen!\n##Elo sollte zwischen Silver 1 - Platin 1 liegen (bei Nachfrage auch niedriger/ h&ouml;her)\n\nDas Team befindet sich gerade in Gold V, frisch eingeranked und ich hoffe es melden sich Interessenten!\n\n#Wir sehen uns!\n___\n**P.S. Da du eh schon hier bist, guck bei meinem selbst programmierten 2D Moba vorbei. Ich suche noch Unterst&uuml;tzung!** ^^\n\n>http://boards.euw.leagueoflegends.com/de/c/community-kunstwerke/twunjPQ9-league-of-pixels-pre-alpha-fanmade-2-d-lol","replies":[{"poster":"AI DMS","date":"2016-09-08T15:47:42.746+0000","up_votes":1,"down_votes":0,"body":"Hallo,\n\nich bin Fokus21 und ich spiele ausschließlich ADC. Mein Name ist Dennis und ich bin 20 Jahre alt. Ich komme aus Thüringen und Spiele seit mehren Jahren LoL.\nZurzeit befinde ich mich noch in der Silver 3 Liga was ich bald ändern werde.\n\nMeine meist gespielten ADC sind zurzeit:\n\nKOG MAW\nTristana\nAshe\nSivir\nJinx\nVayne\nEzreal\n\nIch beherrsche auch die anderen ADC Champs und bin für jeden Pick in jeder Situation bereit.\n\nIch denke ich bin ein gutes ADC nicht nur weil ich gut im Farm bin und meine Lane beherrsche, sondern weil ich auch fokus, Ruhe und eine Positoining im ganzen Game vorweise. Ich zeige mich sehr dominat auf der Lane und gebe meinen Mitspielern die entsprechenden Calls für das bessere Teamplay. ich muss noch an vielen seiten an der perfektion meines Spiels arbeiten um mich zu verbessern, aber jeder macht auch mal einen Fehler im Spiel, auch die Pros.\n\nIch hoffe auf eine positive Entscheidung und würde mich auf euer Team freuen.\n\nMit freundlich Grüßen\n\nDENNIS aka Fokus21","replies":[{"poster":"KingDanius","date":"2016-09-08T15:51:25.218+0000","up_votes":1,"down_votes":0,"body":"Auch 3vs3 oder nur 5vs5?","replies":[]}]}]}