{"poster":"KingDanius","date":"2016-10-13T23:35:50.613+0000","title":"Support Ivern Trick ! (Jungle camps für den adc auf lv1 )","subforum":"Champions & Gameplay","up_votes":6,"down_votes":0,"body":"Hallo,\r\nIch spiele Ivern nun seit dem release permanent als Support.\r\nHeute habe ich einen Interessanten Trick mit der passive herausgefunden. So ist es m&ouml;glich z. b. den Golem mit dem adc auf lv1 zu machen, ohne Schaden zu nehmen.\r\nAblauf:\r\n\r\n1. Ivern markiert den Golem mit der passive, jedoch nicht bis zum Ende!\r\n2. Bevor das Camp markiert ist, bricht man ab und markiert sofort wieder neu. Diesen Vorgang in der gesamten Zeit wiederholen.\r\n3. Zum eigendlichen Trick: durch das Markieren mit der passive wird das Hauptmonster festgehalten und kann sich nicht bewegen.\r\nIn dieser Zeit kann der adc den Golem angreifen, ohne dass dieser an ihn rankommt. (es empfiehlt sich hier auf jeden Fall zuerst den kleinen Golem zu t&ouml;ten, da nur das gro&szlig;e Monster festgehalten wird und die kleinen weiter angreifen.)\r\n\r\nNat&uuml;rlich funktioniert dieser Trick bei allen nicht epischen camps.\r\nBesonders hilfreich sind hierbei a) lv 1 Gromp oder Golems (beim gromp etwas schwerer da Monster trotzdem angreifen, sie k&ouml;nnen sich nur nicht bewegen), b) Die Krabbe, um zu verhindern dass sie abhaut und c) early red buffs.\r\n\r\nVideo dazu folgt vorrausichtlich Morgen.\r\nIch hoffe ich konnte allen Ivern support mains (wie mir ^^) helfen.","replies":[{"poster":"Lagbeard","date":"2016-10-14T06:55:58.278+0000","up_votes":2,"down_votes":0,"body":"Ich habe mich mit dem modernen earlycamp nicht eingehend befasst, wuerde aber sagen dass der zeitfaktor wichtiger ist. Ihr macht das camp zwar ohne schaden zu nehmen, braucht aber, da ivern keinen schaden macht, laenger dafuer als die gegner, bie denen der support zwar tankt, aber dafuer mit draufhaut und hinterher einfach nen keks nimmt. Ich sehe eigentlich nur bei pokelanes eine einsatzmoeglichkeit, und selbst da muesste man schauen, wie lsng es denn dauert.","replies":[{"poster":"KingDanius","date":"2016-10-14T09:29:20.809+0000","up_votes":1,"down_votes":0,"body":"Stimmt auch, mit dem zeitfaktor habe ich mich noch nicht eingehend befasst, wie gesagt ich werde noch ein Video hochladen um es genauer zu testen ^^\nMir ging's hierbei generell eher ums Prinzip, dass die passive Monster festhalten kann.","replies":[]}]},{"poster":"II Chronos II","date":"2016-10-14T12:37:01.798+0000","up_votes":1,"down_votes":4,"body":"ich hoffe für dich das du ivern support nur mit premades spielst.. mit einem ivarn zu spielen tilette nämlich wie scheiße da er auf der support position leider NICHTS zu suchen hat und ohne komunication 1̀̀00% schädlich ist ...","replies":[{"poster":"KingDanius","date":"2016-10-14T13:02:48.281+0000","up_votes":2,"down_votes":0,"body":"Für dich vielleicht^^\nWenn man sich bisschen einspielt ist er ganz gut. (Ähnlich wie Bard)","replies":[{"poster":"II Chronos II","date":"2016-10-14T15:21:20.562+0000","up_votes":1,"down_votes":3,"body":"ich geb dir in dem moment recht in dem ivan über 50% winratio und top pick in master/challanger wird ... vorher lach ich jeden ivarn aus der mir und meinem premade die ranked games versüßt :) hab gegen ivarn momentan 100% winratio :) da der champion als support perfektes futter ist","replies":[{"poster":"KingDanius","date":"2017-05-13T10:50:55.474+0000","up_votes":1,"down_votes":0,"body":"Sieht wohl so aus als ob ich doch Recht hatte :*","replies":[]}]}]},{"poster":"Markathus","date":"2016-10-14T16:23:12.717+0000","up_votes":1,"down_votes":0,"body":"Hey, ich weiß nicht woher du deine Infos nimmst, Ivern ist so neu das er noch gar nicht richtig getestet werden konnte. Das du sofort tiltest ist dein Problem . Mein Mate hat schon recht erfolgreich mit einem Random Schützen die gegnerische Botlane zerstört indem er viel durch Pings und Chat mit dem Schützen & Jungler ( auch sehr wichtig!) abgesprochen hat.","replies":[]}]},{"poster":"Bodycounter","date":"2016-10-14T08:48:32.126+0000","up_votes":1,"down_votes":1,"body":"Dauert leider zu lange, um effizient verwendet werden zu können. Da habe ich lieber einen Braum oder Leona als Supporter, die allein mit ihrer Passiven für guten Schaden sorgen und daraufhin einen Keks essen. Der Marksman kann auch ein paar Treffer einstecken, die man mit Targons wieder auffüllen kann.","replies":[{"poster":"KingDanius","date":"2016-10-14T09:33:55.877+0000","up_votes":1,"down_votes":0,"body":"Die Dauer werde ich heute noch testen (siehe anderen Kommentar).\nEs ging hier vielmehr darum, dass es möglich Ost di und passive So einzusetzen. Das lv 1 camp war nur ein Beispiel.\nAusserdem ist \"lieber einen Braum oder Leona...\" keine Alternative. Man könnte genau so gut sagen, \" wieso Braum oder Leona wenn ich Janna hab\".\n\nIvern Spieler werden wohl kaum wegen dem lv 1 camp zu Braum wechseln.","replies":[]}]}]}