{"poster":"KingDanius","date":"2017-05-27T12:54:58.288+0000","title":"Wie würdet ihr so ein LoL-Spiel für Handy halten?","subforum":"Community-Kunstwerke","up_votes":1,"down_votes":2,"body":"Hallo!\r\n\r\nIch bin grade dabei mein zweites eigenes Spiel zu machen und arbeite deshalb gerade an einem Handy Spiel. Bis lang hat es nichts mit LoL zu tun und ist ein 1vs1 Ninja Spiel. Was w&uuml;rdet ihr davon hallten, dieses Spiel auch im LoL-Universum zu gestallten?\r\n\r\nhttps://kingdanius.itch.io/tappy-ninja-1vs1-android-game\r\n\r\nErst mal grundlegende Infos:\r\nEs ist ein 1vs1 Spiel, entweder gegen einen Bot oder Lokal zu zweit. Ziel ist es, den Gegner mit euren Skills zu treffen und gleichzeitig die Angriffe des Gegners auszuweichen. Bei dem Spiel wie es jetzt ist kann man sich seine Set aus Skills aussuchen. F&uuml;r die Umsetzung als LoL-Minispiel k&ouml;nnte man entweder:\r\n\r\n1: verschiedene Champions mit festgelegten Skills aussuchen oder\r\n2: Skills von verschiedenen Champions kombinieren.","replies":[{"poster":"Shooter90","date":"2017-05-27T13:29:44.392+0000","up_votes":1,"down_votes":0,"body":"Ich bin mir nicht sicher, aber ich glaube man darf hier keine Werbung für andere Games machen.","replies":[{"poster":"KingDanius","date":"2017-05-27T13:33:23.704+0000","up_votes":2,"down_votes":0,"body":"Das soll auch keine Werbung sein (zumal es sowieso free ist) sondern dazu dienen, es als Vorlage für ein LoL Spiel zu nehmen.\n\nWie soll ich es denn sonst veranschaulichen, wenn nicht so?\n\nIst doch das selbe wenn Leute Bilder aus dem Internet von anderen spielen Posten um zb skins oder Champions vorzuschlagen..","replies":[]}]},{"poster":"rip john shelby","date":"2017-05-27T15:24:27.956+0000","up_votes":1,"down_votes":0,"body":"Gibt es nicht schon ein ähnliches Lol-Spiel auf dem Handy?","replies":[{"poster":"KingDanius","date":"2017-05-27T16:00:28.583+0000","up_votes":1,"down_votes":0,"body":"Welches dann genau? Ich kenne eins (eventuell meinst du das) wo man sich als Blitzcrank gegenseitig hooken muss?\n\nIst zwar ähnlich, aber dennoch anders.","replies":[{"poster":"dugg","date":"2017-06-08T06:22:59.204+0000","up_votes":1,"down_votes":0,"body":"Ich glaube, er meint eher APPS wie Mobil Legends oder Heroes Evolved.\n\n\"ähnliches Lol-Spiel\" ist wohl einfach die Moba gemeint und nicht ein Spiel mit LoL-Charaktern etc.","replies":[]}]}]},{"poster":"Undy1ng","date":"2017-05-28T16:53:31.157+0000","up_votes":1,"down_votes":0,"body":"Ne mittlerweile gibt wirklich ein League Spiel für Android.  Ist zwar nicht von Riot Games aber sieht nicht Bad aus.  Allerdings nutze ich mein Handy bzw Tablet nicht zum spielen....","replies":[{"poster":"KingDanius","date":"2017-05-28T18:23:17.848+0000","up_votes":1,"down_votes":0,"body":"Welches denn?\n\nMein Spiel wäre ja kein wirkliches moba in dem Sinn, sondern eher ein 1vs1 mini Spiel im LoL-Stil","replies":[]}]}]}