{"poster":"KingDanius","date":"2017-05-12T14:43:36.049+0000","title":"Lumios, Kämpfer des Zenits","subforum":"Skin- & Champion-Konzepte","up_votes":2,"down_votes":1,"body":"#Lumios, K&auml;mpfer des Zenits\n\nHallo, \ndas ist mein Championkonzept f&uuml;r einen Champion der mir in den Kopf gekommen ist und ich hoffe es gef&auml;llt euch!\nGelegendlich versuche ich die F&auml;higkeiten in Form eines Spiels zu visualisieren und hier bereitzustellen.\n\nhttp://i.imgur.com/veHNfy2.png\n\n**Beschreibung:**\nLumios ist ein Nahkampf-Magier, der sich in das Gegnerische Team hinein begibt um hohen Schaden auszuteilen und sie zu blenden, \ndamit das Team mit einem Hinterhalt folgen kann. \nDas richtige Timing und Decision making ist gefragt, da der Spieler sich entscheiden muss,welche F&auml;higkeiten er mit Solarenergie verst&auml;rken muss und wann er seine Auto Attacks einsetzen sollte.\nEr k&auml;mpf mit seinen F&auml;usten, gef&uuml;llt mit Solarer Energie um zus&auml;tzlichen Schaden auszuteilen. Das Aussehen geht etwa in die Richtung der Arclight Reihe und God Fist Lee Sin.\n\n\n\n**Spielweise:**\n\n#Physisch |=======[]==| Magisch\n\nDamage: **[x] [x] [x]**\nToughness:** [x] [x] [ ]**\nCrowd Control: **[x] [ ] [ ]**\nMobility: **[x] [x] [ ]**\nUtility: **[x] [x] [ ]**\n\nSchwierigkeit: **[x] [x] [x]**\n\n___\n\n**Werte (grob):**\n\nReichweite: 175\nLauftempo: 330\nLeben: ~Standard Fighter\n\n#F&auml;higkeiten:\n\n**Passive: Solarenergie**\nBefindet sich Lumios in einem Solarfeld, sammelt er jede Sekunde 20 Solarenergie. Maximal 100.\nBeim Einsatz einer F&auml;higkeit (Au&szlig;er von Sonnenfinsternis) verbraucht er 50 Sonnenenergie um dieser F&auml;higkeit zus&auml;tzliche St&auml;rke zu verleihen.\n\nNormale Angriffe konsumieren 15 Solarenergie, um zus&auml;tzlich magischen Schaden in H&ouml;he von 10(+5 pro Level)(+0.15 AP) zu verursachen. Der Dash von Sonnenstoß verbraucht keine Solarenergie.\n\n___\n\n**Q: Sonnensto&szlig;**\nMana: 60/65/70/75/80\nAbklingzeit: 8/7/6/5/4\nReichweite: 200\n\nEntl&auml;dt eine Schockwelle aus Sonnenenergie aus seinen H&auml;nden, welche Kegelf&ouml;rmig vor ihm 50/80/120/150/180 (+0.6 AP) magischen Schaden verursacht und getroffene Gegner mit **Erleuchtung** markiert.\n\nDer nächste Auto Attack auf ein erleuchtetes Ziel innerhalb von 500 Einheiten hebt die Markierung auf und teleportiert Lumios zu diesem. \n\n**Solarenergie:**\n\nKonsumiert 50 **Solarenergie**. Erh&ouml;ht die Reichweite der ersten Instanz auf 400 und den Schaden auf 75/120/180/225/270 (+0.80 AP)\n\n___\n\n**W: Solarfeld**\nMana: 60\nAbklingzeit: 12/11/10/9/8 Sekunden (Beginnt erst nach Zerstörung des Solarfeldes)\nReichweite: 800\nRadius: 100-300\n\nMarkiert f&uuml;r 8/9/10/11/12 Sekunden einen Bereich, der die Strahlung der Sonne verst&auml;rkt, Sicht gibt und mit der Zeit größer wird. Nach 1.5 Sekunden wird die maximale Größe erreicht.\nLumios l&auml;dt Sonnenenergie in dem Feld auf und heilt sich jede Sekunde um 10/15/20/25/30 (+0.05 AP), w&auml;rend Gegner 20/30/40/50/60 (+0.1 AP) pro Sekunde als magischen Schaden nehmen.\n\nKann bei voller Größe (also nach 1.5 Sekunden) manuell zerstört werden um allen Gegnern im Feld mit **Erleuchtet** zu markieren und 60/90/120/150/180 (+0.3 AP) magischen Schaden zu verursachen.\n\n**Solarenergie:**\nVerursacht beim erschaffen des Feldes zusätzlich 60/90/120/150/180 (+0.3 AP) magischen Schaden.\n\n___\n\n**E: Sonnenwende**\nMana: 65/70/75/80/85\nAbklingzeit: 12/11/10/9/8\nReichweite: 700\n\nErschafft 2 Sonnendiskusse, welche in einer geraden Linie nach vorne fliegen.\nBei Kollision mit einer gegnerischen Einheit verursachen sie 70/110/150/190/230 (+0.65 AP) (Nur 1 mal) magischen Schaden und fliegen seitlich in einem Bogen zurück zu Lumios. (oder bei Erreichen der maximalen Reichweite)\nTrifft Lumios auf dem Rückflug erneut eine Einheit, so wird der selbe Schaden an ihr verursacht und der Diskus wird zerstört.\nPro zurückgekehrter Diskus verringert sich die Abklingzeit um 25%.\n\n**Solarenergie:**\nZiele werden au&szlig;erdem um 30/40/50/60/70% f&uuml;r 2 Sekunden verlangsamt.\n\n___\n\n**R: Sonnenfinsternis**\nMana: 100\nAbklingzeit: 120/100/80\nRadius: 600\n\nUmgibt sich selber 4 Sekunden lang mit einem Bereich, der allen dortigen Gegnern die Sicht nach außen entzieht und Lumios pro Sekunde 30/40/50 Solarenergie generieren l&auml;sst. \nW&auml;rend dieser Zeit erh&auml;llt er einen Schild in h&ouml;he von 50/60/70 (+0.2 AP) f&uuml;r jeden gegnerischen Champion, der den Bereich betritt (max 1 pro Champ).\nAm Ende der 4 Sekunden zerst&ouml;rt er den Bereich und verursacht f&uuml;r jeden Schild den er generiert hat 50/60/70 (+0.2 AP) magischen Flächenschaden.","replies":[{"poster":"KingDanius","date":"2017-05-13T19:48:57.157+0000","up_votes":1,"down_votes":0,"body":"Edit:\nJetzt mit  einem Model, dass näherungsweise den Champion wiederspiegelt. \nKönnt ihr erraten, aus welchen 3 Champion/Skinteilen er besteht? x)","replies":[{"poster":"charmelikeahri","date":"2017-05-13T20:05:03.668+0000","up_votes":1,"down_votes":0,"body":"Yasoukopf\nZedKörper\nLeebeine?","replies":[{"poster":"KingDanius","date":"2017-05-13T20:17:19.539+0000","up_votes":1,"down_votes":0,"body":"Lee ist richtig, aber GOD FIST lee :)\n\nDer Rest ist falsch ^^","replies":[{"poster":"charmelikeahri","date":"2017-05-14T07:12:39.427+0000","up_votes":1,"down_votes":0,"body":"What? Der hat doch die Arme genauso wie Zed!","replies":[{"poster":"KingDanius","date":"2017-05-14T18:22:10.957+0000","up_votes":1,"down_votes":0,"body":"Seit wann hat Zed denn gelb in seinen Armen? x)","replies":[{"poster":"charmelikeahri","date":"2017-05-14T18:48:44.186+0000","up_votes":1,"down_votes":0,"body":"Sein gelber Chroma ^^","replies":[{"poster":"KingDanius","date":"2017-05-14T19:17:56.756+0000","up_votes":1,"down_votes":0,"body":"Ne leider nicht :D. Bei Chroma liegst du aber schon nicht falsch!","replies":[{"poster":"El Truco Wannabe","date":"2017-05-18T19:18:42.998+0000","up_votes":1,"down_votes":0,"body":"Arclight Varus Kopf\nWespen Shen Oberkörper\nGod Fist Lee Sin Unterkörper","replies":[{"poster":"KingDanius","date":"2017-05-18T19:38:17.237+0000","up_votes":1,"down_votes":0,"body":"Shen is falsch ^^","replies":[{"poster":"Laugh a while","date":"2017-05-19T16:40:27.521+0000","up_votes":1,"down_votes":0,"body":"ITS YASUO :D","replies":[{"poster":"KingDanius","date":"2017-05-19T18:45:42.304+0000","up_votes":1,"down_votes":0,"body":"nönö ^^\n\nTipp: Das Chroma is \"relativ\" neu","replies":[{"poster":"Laugh a while","date":"2017-05-19T18:46:26.092+0000","up_votes":1,"down_votes":0,"body":"ITS YAHUSO :D","replies":[{"poster":"KingDanius","date":"2017-05-19T19:23:30.090+0000","up_votes":1,"down_votes":0,"body":"NÖÖÖÖÖÖ :D","replies":[{"poster":"KingDanius","date":"2017-05-20T18:56:46.844+0000","up_votes":1,"down_votes":0,"body":"Wieso, das gibts doch immer noch ^^ (aber nur als download, nicht mehr im Browser).\n\nIch arbeite noch hin und wieder daran wenn ich Zeit habe. Bald dann wieder ein wenig mehr.","replies":[]},{"poster":"Laugh a while","date":"2017-05-20T07:52:27.501+0000","up_votes":1,"down_votes":0,"body":"Warum nicht? xD\nAchja was ist aus deinem Spiel geworden o.o?","replies":[]}]}]}]}]}]}]}]}]}]}]}]}]}]},{"poster":"Bayonetta38","date":"2017-05-15T12:24:26.462+0000","up_votes":1,"down_votes":0,"body":"intressantes Konzept nur kapiere ich nicht ganz die Passive der Q. Also das mit der Erleuchtung. Er ist doch ein Nahkämpfer? und wenn er markierte Gegner mit Autoattacks angreift telepotiert er sich zu denen? Aber er muss doch bei denen sein um sie anzugreifen? \nDas habe ich nicht verstanden sonst super Idee das mit der Solarenergie.","replies":[{"poster":"KingDanius","date":"2017-05-15T13:36:36.730+0000","up_votes":1,"down_votes":0,"body":"Danke! :)\n\nJa, also das muss man sich etwa so wie bei Ivern's Q vorstellen.\n\nAuf markierte Gegner hat Lumios eine erhöhte Reichweite und sollte er z.b. aus 500 Einheiten rechtclick auf einen markierten Gegner machen, so teleportiert er sich zu diesem (auf seine auto attack range).","replies":[]}]},{"poster":"charmelikeahri","date":"2017-05-13T20:03:35.122+0000","up_votes":1,"down_votes":0,"body":"Wirklich nicht schlecht aber halt Op as Hell. Und ich sehe kein klares Counterplay zu seinem engage. Außerdem würde er als AOE Blind-Tank zu stark sein","replies":[{"poster":"KingDanius","date":"2017-05-13T20:16:43.106+0000","up_votes":1,"down_votes":0,"body":"Wieso kein counterplay? Seine Felder brauchen eine Zeit, bis sie erscheinen. Den reset kriegt er nur dann, wenn er von Feld zu Feld springt. Jedoch wird dann auch das anvisierte Feld zerstört und bietet kein DPS mehr und kein Heal.\nEventuell ein höheres delay von dem Solarfeld.","replies":[{"poster":"charmelikeahri","date":"2017-05-14T07:18:14.509+0000","up_votes":1,"down_votes":0,"body":"-> keine Skillshots \n-> sehr viel Mobility\n-> nicht in die Felder rein und danach beten? Du kannst wenig machen\nWieviele Felder hat er denn? Soviele wie er aufstellt? Oder nur immer 1? Wieviel Range hat das? Brand W oder Annie Q? \n\nGrob gesagt der Champion ist etwas stumf und sein Spielstyl ist sehr vorauschaubar. W dann E und alles drauf. Es bietet wenig Outplaypotenzial und der Überraschungsfaktor fehlt mir irgendwie. Die Besonderheit ist auch mässig weil Katarina im Prinzip GENAU das gleiche macht, rein jumpen auf etwas von ihr, CD zurück usw....\n\nAch ja sein Kit ist TOTAL überladen und er wird eine 99% Banrate haben wie Camille beim Release allerdings stört das Riot ja nicht und ist deswegen eher ein Unterpunkt.\n","replies":[{"poster":"KingDanius","date":"2017-05-14T07:27:59.765+0000","up_votes":1,"down_votes":0,"body":"Die Details über die Felder stehen doch in der Beschreibung drin. 800 Range, Radius nimmt während der Dauer von 300 bis 50 ab. Eventuell muss ich noch was wegen der maximalen Anzahl von Felder hinschreiben. (hatte an 2 gedacht)\n\nJedoch widersprichst du dich. Erst sagst du, er hat kein Counterplay, dann ist er jedoch durchschaubar?  Mit W+E ist es eben nicht getan, da er erst mal Sonnenenergie braucht um irgendwie nutzvoll zu sein. Er bietet neben dem E slow keinen CC und braucht eher viel Vorbereitung um halbwegs Schaden auszuteilen.\n\nEventuell muss ich mir mal das mit dem Reset etwas anders überlegen und gucke ob mir was Besseres für die E einfällt.","replies":[{"poster":"charmelikeahri","date":"2017-05-14T18:56:31.415+0000","up_votes":1,"down_votes":0,"body":"Kein Counterplay (oder wenig) hat er immer noch nicht. Keine Skillshots und keine klare Strategie gegen ihn vorzugehen im Teamfight außer neben den Felder stehen (was aber klar ist, ich meine man stellt sich auch nichr in die Morgana W!?) \n\nUnd auch das Durchschaubare bleibt. Ich meine wie stellst du dir einen seiner Engages vor? Es bleibt immer der gleiche. Er hat keine Chance verschiedene Combos zu machen sondern muss von Feld zu Feld hüpfen wie auf Eisschollen. Das er freiwillig nicht ins Wasser springt ist das vorausschaubare. \n\nUnd seine Ult ist ein AOE Blind nach außen ^^\n\nAber um das mal positiv zu gestalten. Ich finde deine Ideen und deine Umsetzung wirklich gut. Der Champion hat ohne eine Hintergrundstory schon sehr viel Charakter und einen eigenen Charme. Außerdem kann ich schon absehen was er tut und wie er es tut was oftmals nicht der Fall ist, bei vielen Championdesigns ist es so das das Design ohne Absicht ohne Ziel ist. Ich mag deinen Charakter aber er benötigt irgendwie noch das gewisse etwas, der Funken der den Champion zu einem gern gesehen Gast in der Kluft macht. Wie einem Lee zugucken wie er Insect wie Twitch aus der Unsichtbarkeit kommt, so einen Moment braucht ein Champion meiner Ansicht nach und das fehlt noch","replies":[{"poster":"KingDanius","date":"2017-05-14T19:17:02.355+0000","up_votes":1,"down_votes":0,"body":"Ich habe die Fähigkeiten doch schon überarbeitet ^^\n\nKomplett neue E und das Feld ist jetzt ein wenig aktiver.\nUlti ist nun nicht wirklich op (falls du das meintest), da sowohl Tahm und Noc \"ähnliches\" haben.\n\nDer Dash ist nun mit bei der Q und die E ist ein SKillshot, der vielleicht ein wenig Tricky ist :). (Entweder Schaden auf mehrere Ziele oder Weniger Cooldown und single target, ist jedoch auch Situationsbedingt)","replies":[{"poster":"charmelikeahri","date":"2017-05-14T19:35:30.821+0000","up_votes":1,"down_votes":0,"body":"Jo finde es jetzt sehr gut :)","replies":[]}]}]}]}]}]}]},{"poster":"KingDanius","date":"2017-05-14T08:28:04.720+0000","up_votes":1,"down_votes":0,"body":"Edit 2: Fähigkeiten Rework!\n\nDasht sich bei einem Auto Attack auf ein mit \"Erleuchtung\" markiertes Ziel und verbraucht die Markierung.\n\nW: Wird nun immer größer anstatt kleiner und hat nur eine Ladung.\nNach 1.5 Sekunden wird die maximale Größe erreicht und die Fähigkeit kann reaktiviert werden, um das Feld zu zerstören, Zielen Schaden zuzufügen und ebenfalls mit Erleuchtung zu markieren.\n\nE (neu): wirft 2 Diskusse, die Effektiver bei isolierten Zielen sind. (Näheres im Mainpost)","replies":[]},{"poster":"Evenrider","date":"2017-05-13T20:39:22.114+0000","up_votes":1,"down_votes":0,"body":"Varus ist dabei.\nLee wie schon erwähnt.\nJ4 oder Yellow Shen müssten die Arme sein.","replies":[{"poster":"KingDanius","date":"2017-05-13T21:01:22.813+0000","up_votes":1,"down_votes":0,"body":"Arclight Varus ist richtig, J4 und Shen sind falsch :)","replies":[]}]}]}