{"poster":"Ninjitzuh","date":"2017-05-08T01:38:02.149+0000","title":"Subir de liga no importa,lo importante es mejorar","subforum":"Charlas Generales","up_votes":8,"down_votes":0,"body":"he perdido mi promo a plata ,llegue en una odisea de dificultad maxima desde bronce V a bronce 1 y desesperado por salir e spameado ranked ,hasta que me di cuenta que mi limite es bronce 1,deberia mejorar muchas cosas antes de subir a plata ,algun consejo?gracias","replies":[{"poster":"JayInc","date":"2017-05-08T02:24:51.409+0000","up_votes":2,"down_votes":2,"body":"Graba tu partida en las.op.gg. Luego pide que te analicen el replay. Eso es lo mejor para obtener consejos útiles. Acá siempre te van a decir cosas cliché como \"Wardea bien\", \"Mantén una actitud positiva\", \"No te tiltees\", \"farmea bien\", \"ve por objetivos\", que en el fondo no te hacen un mejor jugador, porque ni siquiera sabes en que forma estás fallando. Da igual cuanto wardeas si nunca miras el mini mapa o pones atención de quienes faltan en el mapa. Por eso es importante que otra persona vea tus partidas para saber exactamente que haces mal. Ejemplo: Es mucho más útil que te digan \"_Veo que muchos juegos compras piedra visión como 1er item y vuelves directamente a tu lane y te quedas ahí y solo wardeas tu lane. Si compras piedra visión, no vuelvas al lane directamente. Wardea dragón y a mid, ayuda a tu equipo con la visión. No necesitas piedra visión para el lane ya que tienen 2x trinkets._\" a que te digan \"_wardea bien_\".\nY tienes mucha razón en eso de que lo importante es mejorar. Por ejemplo, agarré una cuenta Bronce III para aprender a jugar jungla. Como es smurf ni siquiera me preocupa si gano o pierdo, solo trato de mejorar mi nivel de jungla. La cuenta ya va platino. Jamás me he preocupado de los LP o si mi team es troll o todas esas cosas, solo juego y trato de ver que hago mal. Suerte.","replies":[{"poster":"Americans","date":"2017-05-08T03:30:29.246+0000","up_votes":5,"down_votes":1,"body":"> [{quoted}](name=JayInc,realm=LAS,application-id=v7qsfXsE,discussion-id=EEeuidGc,comment-id=0005,timestamp=2017-05-08T02:24:51.409+0000)\n>\n> Por ejemplo, agarré una cuenta Bronce III para aprender a jugar jungla.\n\nUn voluntario diciendo que comparte cuentas, que manera de venderte.\n\nVolviendo al tema, hay un monton de formas de mejorar y subir liga. Tantas que no se puede dar un consejo mas que uno generico. Vas a escuchar muchos consejos variados y cada uno tiene algo de razón. Lo que es base a todo es reconocer cuales son tus errores, y en que necesitas mejorar para ser un mejor player. Esto tambien lo podes hacer de diferentes formas.\n\nAlgunas personas por ejemplo se consiguen un coach que los ayude a hacer eso mismo, por dar un ejemplo generico. (cof cof https://www.leaguecoaching.gg/ )\n\nSi queres podes agregarme y hablamos mas a fondo.","replies":[{"poster":"JayInc","date":"2017-05-09T01:52:26.930+0000","up_votes":1,"down_votes":0,"body":"La cuenta es mía; está registrada a _mi_ email y _únicamente_ la accedo yo. Que \"agarre\" una cuenta en ningún caso implica que alguien me la preste.","replies":[{"poster":"Americans","date":"2017-05-09T14:14:30.713+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=JayInc,realm=LAS,application-id=v7qsfXsE,discussion-id=EEeuidGc,comment-id=000500000001,timestamp=2017-05-09T01:52:26.930+0000)\n>\n> La cuenta es mía; está registrada a _mi_ email y _únicamente_ la accedo yo. Que &quot;agarre&quot; una cuenta en ningún caso implica que alguien me la preste.\n\n¿Y como una cuenta tuya es bronce 3 si dijiste que la pudiste subir a platino sin ningun problema?","replies":[{"poster":"JayInc","date":"2017-05-09T22:57:27.272+0000","up_votes":1,"down_votes":0,"body":"Juego desde S1. Tengo varias cuentas en diversos niveles. Incluso cuentas de cuando jugaba en NA y LAS no existía. Por ejemplo, tengo esta cuenta botada que la cree en S2:\n\nhttps://las.op.gg/summoner/userName=coldasakilla\n\nque está en plata. Quizás algún día juegue en ella para practicar algo que no sepa.","replies":[]}]}]},{"poster":"Pascut","date":"2017-05-08T14:05:20.370+0000","up_votes":1,"down_votes":0,"body":"Anda a saber, talvez era una cuenta vieja de cuando él era manco xD","replies":[]}]}]},{"poster":"Trying Improve","date":"2017-05-08T02:35:33.433+0000","up_votes":3,"down_votes":0,"body":"Reduce tu champion pool, así mejoras más rápido macro y microgame.","replies":[]},{"poster":"Orgullo Noob","date":"2017-05-08T01:40:09.225+0000","up_votes":3,"down_votes":0,"body":"El mejor consejo es que aprendas de tus errores.","replies":[]},{"poster":"ByZuKoXz","date":"2017-05-08T01:44:47.835+0000","up_votes":2,"down_votes":0,"body":"si queres ser jugador profesional es mejor mejorar que subir de liga, si solo juegas x jugar no","replies":[{"poster":"TaliyahTrump SSG","date":"2017-05-08T11:07:45.960+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=ByZuKoXz,realm=LAS,application-id=v7qsfXsE,discussion-id=EEeuidGc,comment-id=0002,timestamp=2017-05-08T01:44:47.835+0000)\n>\n> si queres ser jugador profesional es mejor mejorar que subir de liga, si solo juegas x jugar no\n\nDigamos que SKT no buca a sus jugadores en los servrs de bronze","replies":[{"poster":"ByZuKoXz","date":"2017-05-09T01:27:41.867+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SSG iori,realm=LAS,application-id=v7qsfXsE,discussion-id=EEeuidGc,comment-id=00020000,timestamp=2017-05-08T11:07:45.960+0000)\n>\n> Digamos que SKT no buca a sus jugadores en los servrs de bronze\n\nme refiero a que puede subir sin tener el nivel de esa división pero se estaría enfocando mal , ya que estar en una liga aveces no significa que tienes el nivel de ella, y si deseas ser jugador profesional algún día te estarías engañando vos mismo en cuanto a el nivel que crees que tienes","replies":[]}]}]},{"poster":"TresBans","date":"2017-05-08T02:58:23.967+0000","up_votes":2,"down_votes":0,"body":"juga por jugar, Osea pensa que a menos que seas \"Retador\" esto no es mas que un juego, las ligas separan el nivel de habilidad de los jugadores, pero solo unos pocos los \"retadores\" juegan y se les paga, el resto lo debe tomar como un juego o un ocio.\n\nAhora si tu sueño es ser el \"NUEVO FAKER LATAM SUR\" practica incontables horas las mecánicas con una pequeña cantidad de campeones aplicados al META actual.\n\nY entendelo vos y el resto de la comunidad, un Marquito y tu liga, Es por tu nivel de habilidad en un \"JUEGO\"\nes como que jugando un partidito te los bailes, cada uno en bueno en algunas cosas y otros en otras.\n\nasi que si algun HIGH elo viene a criticarte por tu liga, cosa muy comun, decile que vaya y agarre una pelota a ver como le va , o en lo que seas bueno,\n\nahora si no sos bueno en nada.... heee :v\n\nadios y practica\n{{sticker:slayer-pantheon-popcorn}}","replies":[]},{"poster":"Jeremías 17 5","date":"2017-05-08T05:08:34.653+0000","up_votes":1,"down_votes":0,"body":"Juega pocos champs... Jugar 100 champs no te asegura que seas buenos con ninguno, jugar 2 o 3 te asegura que sabes usar a esos 2 o 3 muy bien... Nada de first pick time en ranked, concéntrate solo en una linea o como mucho 2 (Top y Mid, Top y JG, etc) y juega 2 o 3 champs para esas lineas, nada mas... Mira tus replays, concentrate en tus errores no en los de los demas, no te tiltees....","replies":[{"poster":"Cuchufleitor","date":"2017-05-09T16:56:59.623+0000","up_votes":1,"down_votes":0,"body":"Me resulta muy gracioso como en ves de poner sup pusiste etc jajaja, los sup no contamos para nadie =(","replies":[{"poster":"Jeremías 17 5","date":"2017-05-09T17:05:13.732+0000","up_votes":1,"down_votes":0,"body":"Soy main supp, pero solo di un ejemplo... Llegue a oro solo jugando supp xD","replies":[]}]}]},{"poster":"The Steel Shadow","date":"2017-05-08T01:41:09.753+0000","up_votes":2,"down_votes":2,"body":"No te esfuerzes tanto, las ligas son lo mismo, y no te dan premio por salir a plata, si quieres ser goldie debes de usar champs fáciles y jugar lineas que sean importantes, lineas top o mid, adc en ligas bajas es saber que tu support sera un troll que te dejara 1 vs 3 en bot","replies":[{"poster":"Cuchufleitor","date":"2017-05-09T17:03:05.131+0000","up_votes":1,"down_votes":0,"body":"Sup es una buena posicion para subir, sabes por que? por que en elo bajo todos piensan lo mismo de ser sup, por consiguiente casi nadie sabe jugar el rol y, por lo tanto, haces muuuuucha diferencia a favor de tu team comparado con el team enemigo. Si, púede pasar que tu team no aproveche la ventaja que ofreces y terminen perdiendo, pero tene en cuenta que bronces hay en los dos equipos, asi que las posibilidades estan repartidas. \nIgualmente en elo bajo salvo que vayas con algun duo te sugiero que vayas con support de daño hostigdores en vez de utilidad, tanques o iniciadores, por que muchas veces tu adc no sbe que hacer cuando inicias. Asi que lo mejor es una Zyra, Karma, Brand o hasta Lux (si, Lux) ya que en elo bajo es mucho mas facil meter las skills, es mas facil escapar de la torpe coordinacion del otro equipo para matarte y (en algunos casos) podes vivir sin la priedra de wards hasta bien avanzada la partida si te fue bien en linea.","replies":[]},{"poster":"Alvatruz","date":"2017-05-08T04:24:02.829+0000","up_votes":1,"down_votes":0,"body":"O te hara subir con 80% w/r hasta oro si sabes usarlo .","replies":[]}]},{"poster":"TaliyahTrump SSG","date":"2017-05-08T11:08:41.410+0000","up_votes":1,"down_votes":0,"body":"1_Pero si estoy en challerger me puedo reir de quien quiera.\n\n2_Y Jugar bien no me da la skin victoriosa de todos los años.","replies":[{"poster":"Cuchufleitor","date":"2017-05-09T16:55:57.665+0000","up_votes":1,"down_votes":0,"body":"See jugar bien si te da la skin, cualquier boludo llega a oro si quiere","replies":[]}]},{"poster":"Lapou","date":"2017-05-08T14:44:14.879+0000","up_votes":1,"down_votes":0,"body":"subir de liga si importa, sino subis de liga no estas mejorando","replies":[{"poster":"Cuchufleitor","date":"2017-05-09T16:54:37.575+0000","up_votes":1,"down_votes":0,"body":"No necesariamente, podes estar practicando cosas en las que no sos bueno y por ello estar unas 5 ligas por debajo de lo que podrias spameando aquello que si dominas.","replies":[]}]},{"poster":"Sir Crucifix ","date":"2017-05-08T08:04:51.240+0000","up_votes":1,"down_votes":0,"body":"Nadie tiene limite","replies":[]},{"poster":"WhiteMax","date":"2017-05-08T01:50:09.472+0000","up_votes":1,"down_votes":0,"body":"Eso que dices en titulo yo lo aplicaria de Bronce a Oro ya que el sistema no te saca de esas ligas a no ser que pierdas partidas, en cambio de Platino para arriba si no juegas te bajan, ahi se demuestra que los que \"saben jugar\" se mantienen en esas ligas y los que no, vuelven a Oro.","replies":[]},{"poster":"Lunari Red Mask","date":"2017-05-08T01:46:50.075+0000","up_votes":1,"down_votes":0,"body":"Bueno, el primer paso es reconocer tu limite de habilidad, así y podrás mejorar lo que debas. Mi unico consejo es : el que persevera... y me olvide de que seguía, pero se entiende :D.","replies":[]},{"poster":"Ellora","date":"2017-05-08T04:11:22.072+0000","up_votes":1,"down_votes":2,"body":"Mira, ni te calientes... estas en las, el server con menos nivel recontra comprobado. MSI, las , salio ultimo por humillacion.\nQueres jugar competitivo, va a BR. De lo contrario solo llega a oro por la skin y ni te calientes mas","replies":[{"poster":"Cuchufleitor","date":"2017-05-09T17:05:10.938+0000","up_votes":1,"down_votes":0,"body":"De diamante 3 para abajo todos los servidores son lo mismo en ese sentido, eso tambiene sta probado. En todo caso, no creo que le interese ganar el mundial a este pibe, no lo mandes a viajar por el mundo y aprender portugues =/","replies":[]}]}]}