{"poster":"Forbidden Siren","date":"2016-12-02T03:07:57.662+0000","title":"@Riot: Thank you for updating Winter Wonder Karma's particles","subforum":"Story, Art, & Sound","up_votes":15,"down_votes":0,"body":"https://1.bp.blogspot.com/-0vWII5ZyUvA/WECb523ID9I/AAAAAAAAZV8/pJdVRjW1YrEVpP9aXNvlFxuusAmW2b0DwCLcB/s1600/karmaw1.jpg\n\nIn the recent PBE update, they showed an updated particles to Karma&#039;s Winter Wonder skin. Her W and RW now has snowflakes around the beam/tether. Excited, I couldn't wait to see it in action and honestly, it looks great. The snowflakes around the beam actually swirls, which is a bit reminiscent to old Karma&#039;s tether particles.\n\nEdit: A video focus on her W/RW\nhttps://youtu.be/vkKcpGhKKAE\n\nIn another video I found, I can see you also update the shield by making the snowflakes design more vibrant and brighter. The snowflakes actually changes colors from blue to purple as the shield fades. That&#039;s a nice really touch that I didn&#039;t even notice if it was originally there.\n\n(shield starts at 0:34)\nhttps://youtu.be/RxO3_xiacIk \n(It&#039;s not in English, mind you)\n\nI will admit, I was very... passionate... in my previous thread but I&#039;m glad you guys went back and gave her some love tap to two of her spells. It&#039;s definitely an improvement to a gorgeous skin. \n\nThank you.","replies":[{"poster":"moonstones","date":"2016-12-02T18:34:09.380+0000","up_votes":11,"down_votes":2,"body":"As I'm sure you've heard me say (and likely RiotLoveStrut as well), we're always happy to hear feedback, and address it where we can/see fit. While we may not comment on every post, we do read through them and relay the positives and negatives you guys give us for each skin, both on PBE, and the live boards. Keep in mind that we patch every two weeks, so there's only so much we can change in a lot of cases, but we do our best! :) \n\nAgain, thanks for taking the time to give us detailed feedback. \n\nI know Karma is one of those touchy champions, due to her existing catalog, previous rework, etc. Karma mains are one of the most passionate, I've found - it's just a matter of giving your feedback and ideas in a constructive manner. ;) We hope that this puts a bit more faith in us and shows that we do care about Karma.","replies":[{"poster":"Forbidden Siren","date":"2016-12-02T20:32:07.559+0000","up_votes":1,"down_votes":0,"body":"Thank you for your comments! I can't wait for the Winter Wonder skin to come out.","replies":[{"poster":"moonstones","date":"2016-12-07T23:49:25.531+0000","up_votes":2,"down_votes":0,"body":"You're very welcome! I'd love to hear what you think of the skin once you get her in game on live. :)","replies":[{"poster":"Forbidden Siren","date":"2016-12-15T23:13:33.683+0000","up_votes":1,"down_votes":0,"body":"Hi KateyKhaos, I got the skin yesterday and been playing multiple games with it and it's gorgeous. I'm very happy to finally be able to play it. Definitely going to be my go-to skin for Karma for a long time.\n\nOnly one post-release feedback I would like to provide. I did play one game against a Winter Wonder Lulu and I realized both of our shield are almost identical. There were at times in the game I thought my shield was being used but it was actually Lulu's and I don't know if it's the same for Lulu on her end. This lead me to not use my own shield, thinking it's being used, in amidst of a chaotic battle. \n\nI'm sure nothing will be changed at this point, which I understand, but hopefully this feedback will help the skin team be more creative and try something different to her shield (and tether from the previous feedback) in the next Karma skin. (cough SpiritFireKarmaPls cough)","replies":[{"poster":"moonstones","date":"2016-12-15T23:38:45.985+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Forbidden Siren,realm=NA,application-id=6kFXY1kR,discussion-id=tPJQnrJB,comment-id=0002000100000000,timestamp=2016-12-15T23:13:33.683+0000)\n>\n> Hi KateyKhaos, I got the skin yesterday and been playing multiple games with it and it&#x27;s gorgeous. I&#x27;m very happy to finally be able to play it. Definitely going to be my go-to skin for Karma for a long time.\n> \n> Only one post-release feedback I would like to provide. I did play one game against a Winter Wonder Lulu and I realized both of our shield are almost identical. There were at times in the game I thought my shield was being used but it was actually Lulu&#x27;s and I don&#x27;t know if it&#x27;s the same for Lulu on her end. This lead me to not use my own shield, thinking it&#x27;s being used, in amidst of a chaotic battle. \n> \n> I&#x27;m sure nothing will be changed at this point, which I understand, but hopefully this feedback will help the skin team be more creative and try something different to her shield (and tether from the previous feedback) in the next Karma skin. (cough SpiritFireKarmaPls cough)\n\nHey! \n\nI really appreciate the feedback. :) We do care about skins affecting gameplay, so I'd be happy to pass this along to the folks who worked on this skin, so they're at least aware of it!","replies":[{"poster":"Forbidden Siren","date":"2016-12-16T01:08:14.238+0000","up_votes":1,"down_votes":0,"body":"Thank you. Granted, the confusion mostly happens during team battle when so many chaotic things are going on in one screen. It doesn't appear to be the case during laning phase but the thought of the two shields being similar does arise.","replies":[{"poster":"moonstones","date":"2017-07-11T16:51:38.024+0000","up_votes":5,"down_votes":0,"body":"Hey again! \n\n*Again, sorry to necro another thread, but I wanted to provide an update, since this was something had that slightly skewing gameplay.*\n\nThe team's been going through a ton of backlog issues, and trying to tackle as many as possible. :D We've gone ahead and changed the two shields (Karma and Lulu) to better differentiate them. You'll see the new shields in 7.15. \n\nhttp://imgur.com/8hnayT9","replies":[{"poster":"Chromatic Eagle","date":"2017-07-11T18:53:45.475+0000","up_votes":3,"down_votes":0,"body":"Katey the necromancer.","replies":[{"poster":"moonstones","date":"2017-07-11T19:00:23.559+0000","up_votes":2,"down_votes":0,"body":"Must be a full moon.","replies":[{"poster":"patmax17","date":"2017-07-11T19:18:55.974+0000","up_votes":3,"down_votes":0,"body":"New Nami skin confirmed","replies":[]},{"poster":"Flemman","date":"2017-07-11T19:16:09.735+0000","up_votes":1,"down_votes":1,"body":"Can't wait till your team necro really old skin with a cool concept but who were poorly done due to skin standard at those time (for exemple siren cassiopeia could be eel like and use water instead of a blue snake) and are now loss concept for eternity\n\nOne that note, if you had the chance to update an old skin with a cool concept (not part of a global champion rework), what would it be?","replies":[]}]}]},{"poster":"Forbidden Siren","date":"2017-07-11T19:17:02.823+0000","up_votes":2,"down_votes":0,"body":"Whoooo! That's great news, thank you, thank you!","replies":[{"poster":"moonstones","date":"2017-07-11T20:03:26.471+0000","up_votes":2,"down_votes":0,"body":"You're welcome! <3 \n\n{{sticker:slayer-jinx-catface}}","replies":[]}]},{"poster":"Sukishoo","date":"2017-07-11T16:53:21.878+0000","up_votes":2,"down_votes":0,"body":"Nice :D","replies":[]}]},{"poster":"moonstones","date":"2017-01-04T17:01:09.464+0000","up_votes":2,"down_votes":0,"body":"Totally understandable. Thanks for the additional context. I did talk to the QA dude on the skin, and he's taken it back to his team to see if/what they can do to adjust this! :)","replies":[]},{"poster":"Sexy Jack Rabbit","date":"2017-01-04T17:05:47.485+0000","up_votes":1,"down_votes":0,"body":"OMG I thought I was the only one who was suffering from this issue! \nMy friend and I decided to do a Winter Wonderland bot lane in a norms and it was SO HARD to tell the difference \nIt's such a strange little thing.","replies":[]}]},{"poster":"Rivuo","date":"2016-12-15T23:40:33.821+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Riot KateyKhaos,realm=NA,application-id=6kFXY1kR,discussion-id=tPJQnrJB,comment-id=00020001000000000000,timestamp=2016-12-15T23:38:45.985+0000)\n>\n> Hey! \n> \n> I really appreciate the feedback. :) We do care about skins affecting gameplay, so I&#x27;d be happy to pass this along to the folks who worked on this skin, so they&#x27;re at least aware of it!\n\nKateyKhaos who let Safari caitlyn in the shop?\n\nI'm a 1 million caitlyn main and i fucking love this.. ive been waiting for sooo long","replies":[{"poster":"moonstones","date":"2016-12-15T23:45:39.846+0000","up_votes":2,"down_votes":0,"body":"Elves. ;)","replies":[]}]}]}]}]}]},{"poster":"Karbuncle","date":"2016-12-02T18:41:42.162+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Riot KateyKhaos,realm=NA,application-id=6kFXY1kR,discussion-id=tPJQnrJB,comment-id=0002,timestamp=2016-12-02T18:34:09.380+0000)\n>\n> As I&#x27;m sure you&#x27;ve heard me say (and likely RiotLoveStrut as well), we&#x27;re always happy to hear feedback, and address it where we can/see fit. While we may not comment on every post, we do read through them and relay the positives and negatives you guys give us for each skin, both on PBE, and the live boards. Keep in mind that we patch every two weeks, so there&#x27;s only so much we can change in a lot of cases, but we do our best! :) \n> \n> Again, thanks for taking the time to give us detailed feedback. \n> \n> I know Karma is one of those touchy champions, due to her existing catalog, previous rework, etc. Karma mains are one of the most passionate, I&#x27;ve found - it&#x27;s just a matter of giving your feedback and ideas in a constructive manner. ;) We hope that this puts a bit more faith in us and shows that we do care about Karma.\n\nLow faith in Karma changes from a Karma main aside,\n\nIs her skin going to be updated with the tattoos from the splash,detail on her leggings,white fur,gloveless(currently her hands are just colored a color that doesn't even match her outfit and have all her knuckle details so it just looks like her painted her hands instead of wearing gloves) If not doing those change can you alter the splash to reflect the in game version this time?(OotL Shoulder armor on wrong side,Warden Karma using a clearly light blue color instead of the green,no one's expecting a particle change on a 750 skin but it's kind of retarded to falsely advertise like that.)","replies":[]}]},{"poster":"IxtaliKing","date":"2016-12-02T03:22:42.824+0000","up_votes":2,"down_votes":0,"body":"Those added particles on her W/RW actually make a difference, I'm surprised.","replies":[{"poster":"Forbidden Siren","date":"2016-12-02T20:36:38.412+0000","up_votes":1,"down_votes":0,"body":"I agree. It was enough of a change that it felt different from the regular W/RW. It's a really neat effects too to see a bunch of snowflakes swirling around the beam toward the opponent.","replies":[]}]},{"poster":"Lùmen","date":"2016-12-02T20:49:50.446+0000","up_votes":3,"down_votes":2,"body":"FINALLY.. They will stop now.","replies":[]},{"poster":"LycopolisKing","date":"2016-12-02T03:59:23.197+0000","up_votes":1,"down_votes":0,"body":"Thank you Riot! We really want to make sure you know we're thankful for your acknowledgement.","replies":[]}]}