{"poster":"dugg","date":"2016-01-04T08:23:32.804+0000","title":"Eine kurze Reise (Graunacht-Kurzgeschichte)","subforum":"Community-Kunstwerke","up_votes":1,"down_votes":2,"body":"Moin,\r\n\r\nleider gibt es f&uuml;r das Graunacht-Schreib-Event immer noch keine R&uuml;ckmeldungen. So langsam wollte ich dann auch einfach mal meine Geschichte, mit der ich teilgenommen habe, ver&ouml;ffentlichen. \r\n\r\nEs gibt kleine Anmerkungen:\r\nF&uuml;r mich war es echt hart mich an die 3.000 W&ouml;rter zu halten. Daher wirkt Kapitel V sehr zusammengeklatscht. Man h&auml;tte hier noch mehr ins Detail gehen k&ouml;nnen. Auch h&auml;tte ich gern noch ein Gedicht, bzw. ein Lied f&uuml;r eine &Uuml;berfahrts-Szene geschrieben, aber als ich mich dem Ende der Geschichte n&auml;herte und nicht Ansatzweise bei 3.000 W&ouml;rtern war, begann das Gro&szlig;e Streichen und Eink&uuml;rzen. Da sind einige Dinge zum Opfer gefallen bzw. etwas auf der Strecke geblieben. Die Formatierung der Geschichte ist ein Weiteres, welches leider auf der selbigen Strecke geblieben ist. Beim Copy und Paste war diese leider verschwunden. Ich hoffe, es sind nun die richtig Abs&auml;tze von mir abgesetzt. ;)\r\n\r\nMit meiner Geschichte setze ich an dem Punkt auf, an dem die Riot-Bilgewasser-Geschichten aufgeh&ouml;rt haben... also hoffentlich viel Spa&szlig;.\r\n\r\n\r\n**Eine kurze Reise**\r\n\r\n**Kapitel I**\r\n\r\nDer Nebel aus Bilgewasser war verschwunden. Nachdem sich Miss Fortune und Rafen um Illaoi gek&uuml;mmert hatten, atmeten sie tief durch und schauten sich in die Augen. Rafen war noch immer voller Furcht. Dieser Angriff hatte ihn nicht nur k&ouml;rperlich getroffen, auch seine Seele hatte Schaden genommen. Seine Aug&auml;pfel waren Blutunterlaufen, die Netzhaut tr&uuml;b und die Tr&auml;nens&auml;cke gr&ouml;&szlig;er denn je. Sein Puls raste nach wie vor und seine Pupillen zuckten unruhig hin und her.\r\n\r\nMiss Fortune wusste genau, was helfen w&uuml;rde; _Vergessen_.\r\n\r\nRafen und Sarah schauten sich an:\r\n&bdquo;Zum Krakenreiter?&ldquo;\r\n&bdquo;Zum Krakenreiter&hellip;!&ldquo;\r\n\r\nDiese war die einzige Einrichtung, die nicht unter den Fittichen Gangplanks gelegen hatte. Es war eine Kneipe, in dem man nicht nur Met, selbstgebrautes Bier und hausgemachtes Essen, sondern auch Liebe k&auml;uflich erwerben konnte. Es war eine kleine eigene &ouml;konomische Welt in dem sonst so versifften Bilgewasser. Eine heile Welt fernab von Bauchaufschlitzenden Halunken und raffzahnigen Dieben mit hinterlistigen Fingern und d&uuml;nnem Haar.\r\nGangplank hatte dieses Lokal zur neutralen Zone erkl&auml;rte. Er mied es, auf Grund der gemeinsamen kindlichen Vergangenheit mit dem Wirt. Sie waren zusammen gro&szlig; geworden und lernten viel voneinander. Viel wichtiger, sie kannten die Schw&auml;chen des Anderen. Der Wirt war ein hoch geschossener Mann mit einem Kreuz wie ein Stier, Oberarme wie Baumst&auml;mme und seine massige Brustbehaarung hing aus dem offenen, wei&szlig;en R&uuml;schenhemd. Die krumme Nase erz&auml;hlt die eine oder andere Geschichte von K&auml;mpfen und Raufereien. Sein Name war Marmal. Er wurde von seinen Freunden und Angestellten liebevoll Mama genannt.\r\nTrotz aller Verbundenheit zu Gangplank war er Fortune wohlgesonnen. Er brachte ihren M&auml;nnern das leckerste Bier, das bestabgehangene Fleisch und rief seine h&uuml;bschesten Frauen herbei.\r\nDas Vergessen konnte beginnen.\r\n\r\n\r\n**Kapitel II**\r\n\r\nDie Sonne schien durch die gro&szlig;en Fenster des Lokals. Miss Fortune wollte nur ihren M&auml;nnern Spa&szlig; g&ouml;nnen und ging nach drau&szlig;en. Der Sonnenschein strahlte ihr ins Gesicht und reflektierte in ihre gro&szlig;en aber m&uuml;den Augen. Sie legte den Kopf in den Nacken und schloss die Lider. Durch den aufkommenden Wind wehten ihre langen, noch vom Kampf zerzausten Haare. Ihren Hut hatte sie in der linken Hand, ihre Rechte stemmte sie auf den Griff ihrer Pistole. Sie atmete tief durch und hielt kurz inne. Der Geruch von Bilgewasser war einen Moment lang weniger faulig. Die Zeit stand einen Augenblick still.\r\n\r\nEin lautes Knacken lie&szlig; sie herumfahren. Ihre Pistole aus dem Halfter gerissen, rief sie in die dunkle Gasse neben dem Lokal: &bdquo;Wer ist da? Zeig dich du Zigeuner oder ich rei&szlig;e dich in St&uuml;cke!&ldquo;\r\n\r\nEin saphir-blauer Ring erschien auf einer gro&szlig;en Kiste, die an der Hauswand stand. Es sah aus, als w&uuml;rde blaues Feuer einen kleinen Kreis beschreiben. Miss Fortune konnte nicht erkennen, um wen oder vielmehr um was es sich hierbei handelte. Sie fokussierte ihren Blick und erhob ihre nun hart klingende Stimme: &bdquo;Verflucht noch eins! Gibt dich zu erkennen oder du wirst mein Entermesser an deiner Kehle sp&uuml;ren und ich verspreche dir, dass es das Letzte ist, was du versp&uuml;ren wirst.&ldquo;\r\n\r\nDer brennende kleine Feuerkreis sprang von der Kiste herunter und kam langsam auf Sarah zu. Er wirkte nicht sonderlich gro&szlig; und ging ihr nur bis zur H&uuml;fte. Normalerweise machte sie kurzen Prozess mit ihr zu wideren Gestalten, doch irgendetwas hinderte sie daran den Abzug ihrer mit Holzschnitten versehenen Pistole zu dr&uuml;cken. Der Kreis verschwand. Auch wenn ihr Augenlicht keine Bedrohung mehr wahrnahm, t&auml;uschten sie ihre Ohren nicht. Ihr Puls fing an schneller zu schlagen. Es kamen Schritte auf sie zu. Kleine Schritte&hellip; ged&auml;mpfte kleine Schritte&hellip; Miss Fortune blinzelte und versuchte in die Dunkelheit zu blicken. Pl&ouml;tzlich endeten die Schritte. Am Rande des Geb&auml;udeschattens vernahm sie eine kleine Person, nicht viel gr&ouml;&szlig;er als ein Kind.\r\n\r\n&bdquo;Wer bist du? Und was machst du hier?&ldquo;, rief Miss Fortune dem ihr unbekannten Wesen entgegen.\r\n\r\n&bdquo;Ich bin auf der Suche nach einem Freund von mir. Hast du ihn gesehen?&ldquo;, erwiderte eine zarte Stimme. Fortune blieb skeptisch, denn solch eine liebliche, kleine M&auml;dchenstimme geh&ouml;rt nicht in diese Stadt. Nicht in diese Gegend, nicht in die N&auml;he dieses Lokals und erst Recht nicht hierher nach solch einer furchteinfl&ouml;&szlig;enden Graunacht.\r\n\r\n&bdquo;Wer ist dein Freund? Wie hei&szlig;t du? Bist du alleine?&ldquo;\r\n\r\n&bdquo;Nein, das bin ich nicht.&ldquo;\r\nDie kleine Person trat aus dem Schatten hervor.\r\n\r\n&bdquo;Ich bin Annie und ich habe meinen Teddy bei mir.&ldquo;\r\nSo skeptisch Fortune auch war, steckte sie ihre Pistole weg.\r\n\r\n&bdquo;Na gut Annie, ich bin Miss Fortune. Ach, sag einfach Sarah zu mir. Was machst du hier in dieser gottverlassenen Gegend?&ldquo;\r\n\r\n&bdquo;Ich suche meinen Freund Olaf. Hast du ihn gesehen?&ldquo;\r\n\r\n&bdquo;Wen?&ldquo;\r\n\r\n&bdquo;Olaf. Ein gro&szlig;er, starker Mann mit Bart und Axt. Er ist von Freljord, meiner neuen Heimat, hierhergekommen um den Krakenwyrm zu eliminieren. Doch leider habe ich nie wieder etwas von ihm geh&ouml;rt und nun suche ich nach ihm.&ldquo;\r\n\r\n&bdquo;Ach kleines M&auml;dchen, da mache ich dir wenig Hoffnung. Die Graunacht ist vor&uuml;ber und alle, die nicht bei uns oder in verbarrikadieren H&auml;usern waren, sind mit auf die Schatteninsel gezogen worden. Du scheinst mir ausgelaugt zu sein? Willst du mit mir kommen und mir die Geschichte erz&auml;hlen?&ldquo;\r\nAnnie ging h&uuml;pfenden Schrittes mit. In einer Hand ihren B&auml;ren Tibbers und in der anderen die vernarbte und doch zartf&uuml;hlende Hand Fortunes. Die kleine Wahl-Freljorderin erz&auml;hlte ihr die ganze Geschichte, wie ihre Eltern aus Noxus flohen und sie in den Voodoo-L&auml;ndern gro&szlig; geworden ist. Wie sie sich entschloss ihre Eltern zu verlassen und auf ihrer Reise Olaf traf, der sich ihrer annahm.\r\n\r\n\r\n**Kapitel III**\r\n\r\n&bdquo;Erz&auml;hl mir mehr von diesem Olaf&ldquo;, forderte Sarah die wei&szlig; gekleidete Annie auf und schob ihr Poro-Kekse &uuml;ber den Tisch entgegen.\r\n\r\n&bdquo;Olaf ist so stark wie ein L&ouml;we und so gro&szlig; wie ein B&auml;r. Noch viel st&auml;rker als mein Papa fr&uuml;her, wei&szlig;t du?&ldquo; Annie sa&szlig; auf ihren H&auml;nden und baumelte mit ihren Beinen hin und her, w&auml;hrend sie einen Keks im Mund krachen lie&szlig;.\r\n\r\n&bdquo;Und du hast die lange Reise ganz allein auf dich genommen? Ohne jegliche Begleitung?&ldquo; Miss Fortune guckte sie skeptisch und mit gro&szlig;en, runden Augen an.\r\n\r\n&bdquo;Nein, nat&uuml;rlich nicht! Mein Tibbers ist immer an meiner Seite.&ldquo; Sie hob die linke Hand an dem sie ihn immer fest hielt. Der kleine wei&szlig;e Stoffb&auml;r hing mit einem Schal und einer Wollm&uuml;tze bekleidet, baumelnd herunter. Er sah nur wenig bedrohlich, geschweige denn besch&uuml;tzend aus.\r\n\r\n&bdquo;Sei mir nicht b&ouml;se&ldquo;, versuchte Fortune ihren Klos im Hals runterzuschlucken. &bdquo;Wir hatten letzte Nacht eine Graunacht. In dieser Nacht erscheinen b&ouml;se Geister und verschlingen alles, was sie sich einverleiben k&ouml;nnen. Die gefangenen K&ouml;rper und Seelen, werden mit zur Schatteninsel genommen, wo sie den Rest ihres Daseins als Untote oder Geister fristen. Du musst wissen Annie, niemand geht freiwillig auf die Schatteninsel&hellip; Niemand ist dazu bereit diese Reise anzutreten&hellip; Sollte es doch jemand gewagt haben, ist er nie wieder zur&uuml;ckgekehrt!&ldquo;\r\nAnnie zuckte beteiligungslos mit den Schultern.\r\n\r\n&bdquo;Ich bef&uuml;rchte dein Freund Olaf wird diese Nacht nicht &uuml;berlebt haben.&ldquo;\r\n\r\nAnnie ignorierte diese Aussage und sprang vom Stuhl auf. L&auml;chelnd guckte sie in die feuchten Augen ihres Gegen&uuml;bers. W&auml;hrend Fortune Mitleid mit diesem armen M&auml;dchen versp&uuml;rte, hatte Annie kleine Flamme in ihrem Blick. Sie verspr&uuml;hte positive Entschlossenheit und das merkte Sarah.\r\n\r\n&bdquo;Wo geht&rsquo;s zu dieser Schatteninsel?&ldquo;, grinste Annie.\r\nIhre kindliche Unbedarftheit und ihre Entschlossenheit lie&szlig; Fortune erschaudern.\r\n\r\n&bdquo;Na gut, wie du es m&ouml;chtest.&ldquo;\r\n\r\nBeide verlie&szlig;en Gangplanks alte Behausung Richtung Bootsanleger. Eine Hafenratte lief Annie &uuml;ber die F&uuml;&szlig;e und fauchte sie an. Ohne zu z&ouml;gern streckte sie ihre Hand aus. Eine kleine Flamme erschien auf ihrer Handfl&auml;che. Kurz darauf zerfetzte ein m&auml;chtiger Feuerball die Ratte und hinterlie&szlig; einen schwarzen, derben Brandfleck auf dem Fu&szlig;boden.\r\n\r\n\r\n**Kapitel IV**\r\n\r\nAm Hafen angekommen, dr&uuml;ckte Miss Fortune die festentschlossene Frostfeuer Annie ein letztes Mal.\r\n\r\n&bdquo;Ich sp&uuml;re, dass ich dich nicht aufhalten kann. Diesen Talisman gebe ich dir f&uuml;r deine Reise. M&ouml;ge er dich besch&uuml;tzen.&ldquo; Sie hing ihr den gleichen Talisman um, den sie zuvor von Illaoi bekommen hatte.\r\n\r\n&bdquo;Dank dir Sarah.&ldquo; Annie dr&uuml;ckte ihr einen Kuss auf die Wange und stieg in ein kleines Ruderboot und ruderte Richtung Schatteninsel. Die See war ruhig. Der Wind zog nur kleine Bahnen und lie&szlig; das Boot sanft schaukeln. Annie hatte trotz ihrer kurzen Arme keine Probleme schnell vorw&auml;rts zu kommen. Die Glocken im Hafen l&auml;uteten. Ihr klang r&uuml;ckte schnell in weite Ferne und sie n&auml;herte sich ihrem Ziel.\r\n\r\n\r\n**Kapitel V**\r\n\r\nJe n&auml;her sie der Insel kam, umso unruhiger wurde das Wasser. Die Wellen schlugen gegen das Boot und brachten es zum Wanken. Annie hatte das ein oder andere Mal zu k&auml;mpfen, damit sie auf Kurs blieb. Von Bilgewasser aus gesehen, sah die Schatteninsel nach der Graunacht nicht mehr bedrohlich aus. Doch je n&auml;her sie kam, desto mehr zog der Nebel auf. Sie h&ouml;rte ein schauriges Heulen in weiter Ferne. In den Wogen des Wassers erschienen d&uuml;nne, fahrige Gesichter. Gespenster gleich fl&uuml;sterten sie Annie zu, sie solle umdrehen, sie solle es nicht wagen die Ruhe zu st&ouml;ren. Andere Gesichter schwappten aus dem Wasser heraus und sprachen Fl&uuml;che aus. Die Stimmen wurden dichter und ergaben nur einen zeremoni&ouml;sen Gebetskauderwelsch. Das kleine Frostfeuer M&auml;dchen wurde mit zunehmendem Stimmengewirr nur noch entschlossener. Die Flammen in ihren Augen loderten hell auf. Der kleine saphir-blaue Feuerring umgab sie wieder. Die Geister wurden ruhiger und die Gesichter weniger. Ihr Feuerkreis leuchtet ihr den Weg durch den immer dichter werdenden Nebel.\r\n\r\nUnter lautem Krachen endete Annies &Uuml;berfahrt. Ihr Boot krachte an eine steinige K&uuml;ste. Sie war angekommen. Tibbers fest im Arm haltend stieg sie aus. Durch den heftigen Aufschlag war das Boot leckgeschlagen und lief langsam voll Wasser. Eine R&uuml;ckkehr mit diesem Gef&auml;hrt war nicht mehr m&ouml;glich. Sie zuckte mit den Schultern und lief h&uuml;pfend in die Nebelwand. Nur wenige Schritte sp&auml;ter stand sie an einem d&uuml;steren Waldrand. &Uuml;berall standen verlassene K&auml;fige. Es lagen Ketten herum und &Uuml;berreste von zerborstenem Holz. Verrostete Metallbeschl&auml;ge pflasterten den Weg in das Unterholz. In der Ferne h&ouml;rte Annie ein altes Horn tuten. Tibbers klammerte sie sich fest unter den Arm und schritt hinein.\r\n\r\nAm Wegesrand lagen Skelette, die mit einer Kette an B&auml;ume geschlagen waren. Sicherlich war der Tod auf dieser Insel allgegenwertig, dennoch wunderte sich Annie &uuml;ber die Knochenhaufen. Menschen wurden, dem Anschein nach, lebend her&uuml;bergezogen und vor Ort der letzte Rest Seele ausgesogen.\r\nDie tiefe Stille des Waldes war be&auml;ngstigend. Der Wind raschelte in den verdorrten Baumkronen. Ein leises Heulen begleitete ihn. Vereinzelt schrie eine gequ&auml;lte Seele auf. Tiere waren weit und breit nicht zu sehen. Sie verirrten sich nicht auf dieses d&uuml;stere Fleckchen Erde. Die Winde wurden st&auml;rker und Annies Schritte endeten an einer Kreuzung. Kein Wegweiser war weit und breit zu sehen. Keine Fu&szlig;spuren verrieten ihr den Weg.\r\n\r\n&bdquo;Oooolaf?!&ldquo; rief sie den Weg entlang.\r\n\r\n&bdquo;Oooooolaf?!&ldquo; hallte es etwas lauter aus ihrer Kehle.\r\n\r\nDer Wald verstummte auf der Stelle. Annie guckte in alle Richtungen. Es war nichts und niemand zu sehen. Ein leises Grollen war am Horizont zu vernehmen.\r\n\r\n&bdquo;Olaf?&ldquo;, fragte sie mit fl&uuml;sternder Stimme.\r\n\r\nGrollend kam das Ger&auml;usch n&auml;her. Der Weg rechts von ihr begann zu beben. Die B&uuml;sche zuckten zusammen und die B&auml;ume wichen zur Seite. Das grollende Beben wurde laut und bekam mehr Charakter. Es waren eindeutig Hufschl&auml;ge. Annie sprang hinter einen zitternden, dichtbewachsenen Busch und versteckte sich.\r\n\r\n&bdquo;Keine Sorge, ich bin bei dir.&ldquo; Beruhigte sie die &auml;ngstliche Pflanze.\r\nDie Hufschl&auml;ge h&ouml;rten sich an, wie eine ganze Horde wildgewordener Pferde.\r\n&bdquo;Was ist das?&hellip;&ldquo;, fl&uuml;sterte sie mit eisiger Stimme. Ihr Atem war in der erkalteten Waldluft sichtbar.\r\nWie ein Derwisch fegte ein untotes Monster - halb Mensch, halb Pferd - &uuml;ber den Waldweg. Die donnernden Hufe wurden zu einem ohrenbet&auml;ubenden L&auml;rm. Annie hielt Tibbers die Ohren zu und umklammerte den Busch. Sie duckte sich noch ein wenig tiefer und der Reiter rannte laut kreischend an ihr vor&uuml;ber. Vor Schmerzen nicht wissend wohin. Annie sprang aus ihrem Versteck hervor:\r\n\r\n&bdquo;Hey du! Halt ein!&ldquo;\r\n\r\nEs schnaufte und drehte bei. Sie standen sich in einiger Entfernung gegen&uuml;ber. Das Monster war unruhig und schlug hastig mit den Hufen auf den Boden. Danach rannte es direkt auf Annie zu. In seiner schwarz-blau brennenden Silhouette war ein gro&szlig;er Krieger zu erkennen. Es war ein Ritter, wie sie es nur aus den alten Geschichten kannte.\r\n\r\n&bdquo;Erl&ouml;se mich!&ldquo; schrie er unter H&ouml;llenqualen.\r\n\r\n&bdquo;Sag mir erst, wo mein Freund Olaf ist!&ldquo;\r\n\r\n&bdquo;Erl&ouml;&ouml;&ouml;se mich&hellip; BITTE!!!&ldquo; in dem er es aussprach ritt er mit enormen Tempo auf die kleine Freljorderin zu. Seine Hufe ersch&uuml;tterten das Gel&auml;nde.\r\n\r\n&bdquo;Na gut, du l&auml;sst mir keine andere Wahl!&ldquo; rief Annie und stemmte dabei ihren rechte Fu&szlig; nach hinten in den Waldboden. Ihre H&auml;nde zu einem Kreis geformt. Dabei holte sie von der H&uuml;fte aus Schwung und feuerte ihrem Angreifer eine gewaltigen Feuerkegel entgegen. Der Reiter fiel ihr brennend vor die F&uuml;&szlig;e.\r\n\r\n&bdquo;Danke&hellip;&ldquo; keuchte es aus dem brennenden K&ouml;rper. Es war viel mehr der Ritter, der zu ihr sprach als das abscheuliche Monster.\r\nEr atmete noch einmal aus, bevor er regungslos am Boden liegen blieb.\r\n_Armes Pferdchen_, dachte Annie. Sie streckte ihre Hand nach ihm aus.\r\n\r\n&bdquo;Du bist erl&ouml;st,&ldquo; fl&uuml;sterte sie. Eine gewaltige Druckwelle schleuderte Annie nach hinten und eine Stimme des Schreckens schrie auf. Der Schrei war &uuml;ber die komplette Insel zu h&ouml;ren. Ein riesiger Lichtbogen strahlte empor. Etliche Seelen schossen durch den gen Himmel gerichteten Bogen.\r\nPl&ouml;tzlich packte sie eine Hand bei ihrer Schulter. Annie fuhr erschrocken herum und ein Feuerball gl&uuml;hte in ihrer Hand.\r\n\r\n&bdquo;Bist du verr&uuml;ckt junges M&auml;dchen?&ldquo; Eine schlanke Frau mit einer leicht verr&uuml;ckten Stimme schaute sie mit ihren gr&uuml;nen, stechenden Augen an. Sie hatte eine riesige Mini-Gun in ihrer Hand und einen drachenf&ouml;rmigen Raketenwerfer auf den R&uuml;cken geschnallt. Ihre Klamotten waren knapp und vollkommen zerfetzt. Sie hatte &uuml;berall gr&uuml;nen Schleim auf ihrem K&ouml;rper. Ihre T&auml;towierungen waren Zeichen vergangener Schlachten.\r\n\r\n&bdquo;Wieso hast du das getan? Das lockt s&auml;mtlich Monster an! Verdammte Seelen, misshandelte Geister und vor allem uralte Zombies.&ldquo;\r\nAnnies leuchtende Augen waren voller Flammen, bereit diese Frau auf der Stelle zu t&ouml;ten. Die Frau sah das lodernde Feuer in ihrem Blick und verringerte ihren harschen Tonfall.\r\n\r\n&bdquo;Wir m&uuml;ssen hier verschwinden. Mein Name ist &uuml;brigens Jinx. Das da hinten ist mein Freund Pantheon.&ldquo; Seine Bewaffnung erinnerte an einen r&ouml;mischen Krieger. Der Speer war allerdings durch eine am Stab befestigte Kettens&auml;ge ersetzt. Statt einer heroischen &Auml;gide trug er einen zerbeulten Kanaldeckel. Rotbemalt mit H&ouml;rnern versehen. Er nickte wortlos zu den beiden Frauen her&uuml;ber.\r\n\r\n&bdquo;Los, schnell weg, bevor es zu sp&auml;t ist.&ldquo; Jinx packte Annie bei der Hand und zog sie mit.\r\n\r\nEs war zu sp&auml;t. Aus den W&auml;ldern stapften die ersten Zombies. Eine ganze Horde fleischvertilgender, seelenloser Menschenfresser. Einige von ihnen schossen blaue Leuchtkugeln, andere lie&szlig;en Feuers&auml;ulen empor steigen. Jinx schmiss mit Fallen um sich, um die Angreifer abzublocken. Pantheon sprang auf die Gegner zu. Er bet&auml;ubte sie und stach in rasender Geschwindigkeit mit seiner Kettens&auml;ge zu. Ein Zombie nach dem anderen wurde zur Strecke gebracht. Eine gewaltige Ersch&uuml;tterung lie&szlig; die drei kurz verharren. Die B&auml;ume st&uuml;rzten um und eine Schneise war geschlagen. Ein riesiger Kollos stand vor dem Trio. Ein gewaltiger Berg Fleisch mit langen Armen und gefr&auml;&szlig;igem Blick. Er vertilgte einen Zombie nach dem anderen, um sich selbst Kraft zu verleihen. Dass es sich dabei um seine Verb&uuml;ndeten handelte, st&ouml;rte ihn nicht. Ein kleiner gierig schauender Zwerg sa&szlig; auf den Schultern dieses Zombie-Yetis und schien ihn zu lenken.\r\n\r\n&bdquo;Nunu!&ldquo; rief Annie ungl&auml;ubig.\r\n\r\n&bdquo;Wer bitte was?&ldquo; guckte sie Jinx verwirrt an. &bdquo;Du kennst dieses Monstrum?&ldquo;\r\n\r\n&bdquo;Ja, das ist bzw. war Nunu. Ich kenne ihn von meiner Reise nach Freljord. Der Arme&hellip; Was ist nur aus ihm geworden?&ldquo;\r\nDer Fleischberg rannte ohne auf die anderen Zombies zu achten mit weit nach vorn gerissenen Armen auf sie zu.\r\n\r\n&bdquo;Auch dich werde ich erl&ouml;sen Nunu!&ldquo; schrie Annie. Ihre Augen quollen &uuml;ber vor Flammen. Jinx wich vorsichtig zur&uuml;ck. Einen Feuerball nach dem anderen feuerten Annies kleine H&auml;nde auf den Riesen. Gefolgt von mehreren Feuerwalzen und einem m&auml;chtigen, markdurchdringenden Schrei.\r\n\r\n&bdquo;Tibbers!!!&ldquo; schrie Annie und warf ihren kleinen B&auml;ren in Richtung des Schlachtfelds. Eine gewaltige Explosion bet&auml;ubte alle umherstehenden Feinde und radierte bereits verletzte Zombies endg&uuml;ltig aus. Die Ersch&uuml;tterung war auf der ganzen Insel zu sp&uuml;ren und der Feuerkreis der Explosion war Kilometerweit zu sehen. So standen sie sich gegen&uuml;ber. Die kleine Wahl-Freljorderin mit ihrem zu voller Gr&ouml;&szlig;e gewachsenen, feuerspr&uuml;henden Riesenteddy und der kleine Giftzwerg mit seinem mutierten Fleischberg-Yeti.\r\n\r\n\r\n**Kapital VI**\r\n\r\nMiss Fortune sa&szlig; am Hafen nur unweit vom &bdquo;Zum Krakenreiter&ldquo; entfernt, um ihre M&auml;nner im Auge zu behalten. An einem Steg machte sie es sich auf ein paar Leinens&auml;cken bequem. Ihre Beine streckte sie von sich und ihren Hut legte sie ab. Stets wach, achtete sie auf die offene See. Ein kleines Fischerboot fuhr langsam an den Kai heran. Sarah st&uuml;tzte sich auf und schaute dem Fischer dabei zu, wie er einen gro&szlig;en Mann aus seinem Boot hob und ihn an der Kaimauer entlang zu einer Treppe unweit Fortunes brachte. Sie setze sich auf, schnappte sich ihren Hut und ging dem Mann entgegen.\r\n\r\n&bdquo;Miss! Miss! Gut, dass sie hier am Hafen sind. Ich habe diesen riesen Kerl hier aus dem Wasser gefischt. Er sagt, er hat gegen den Krakenwyrm gek&auml;mpft.&ldquo;\r\nSarah ging den beiden ein St&uuml;ckweit entgegen.\r\nDer gro&szlig;e Kerl st&uuml;tzte sich auf den Fischer und hielt sich seine rechte Flanke. Er schien schwer verletzt zu sein. Seine Axt schleifte in seinem G&uuml;rtel hinterher.\r\n\r\n&bdquo;Wer bist du, b&auml;rtiger Mann?&ldquo;\r\n\r\n&bdquo;Olaf ist mein Name und mit wem habe ich die Ehre?&ldquo;\r\n\r\nFortune fuhr es bei der Nennung des Namens kalt den R&uuml;cken runter und sie erstarrte.\r\nEine m&auml;chtige Ersch&uuml;tterung lies den Boden unter ihren F&uuml;&szlig;en erbeben. Eine gro&szlig;es Feuer war auf der Schatteninsel zu erkennen. Fortune und Olaf rissen ihren Blick her&uuml;ber und sagten zeitlich besorgt:\r\n\r\n&bdquo;Annie!&hellip;&ldquo;","replies":[{"poster":"Kaos99","date":"2016-01-04T09:08:10.683+0000","up_votes":1,"down_votes":0,"body":"Gibts das auch als audio? NICHT VON GOOGLE","replies":[{"poster":"dugg","date":"2016-01-04T12:22:50.998+0000","up_votes":1,"down_votes":0,"body":"Ne, eine Vertonung liegt mir fern. Tut mir leid, ich verstehe deine Aussage mit Google nicht.","replies":[{"poster":"Zulwar","date":"2016-01-04T12:25:05.327+0000","up_votes":1,"down_votes":0,"body":"Ich glaube Google bietet einen Dienst, wo du Text in Sprache dir ausgeben lassen kannst, für Lesefaule. Aber ich denke, das dies sich ohne Betonung und so weiter nicht gut anhört.","replies":[{"poster":"dugg","date":"2016-01-04T12:52:28.026+0000","up_votes":1,"down_votes":0,"body":"Ach so, danke. Ich kannte keine Sprachausgabe von Google.","replies":[]}]}]}]}]}