{"poster":"Duspicci","date":"2016-02-12T10:22:33.851+0000","title":"sospeso senza motivo","subforum":"Aiuto e supporto","up_votes":1,"down_votes":2,"body":"Giorno ragazzi, ho provato a loggare su lol qualche minuto f&agrave; e mi &egrave; uscito il tuo account &egrave; stato sospeso sino al 13/02/2016 controlla la tua email e bla bla bla , sono andato sulla mia e-mail e non ho trovato nulla a riguardo della riot game e tra l&#039;altro non ho fatto nulla per essere sospeso non so come fare visto che il supporto  &egrave; penoso  https://support.riotgames.com/hc/it qualche dritta per contattare qualcuno? io vorrei giocare xD","replies":[{"poster":"Firenheit","date":"2016-02-12T10:24:12.275+0000","up_votes":1,"down_votes":0,"body":"Aspettare che il supporto ti risponda, l'unica alternativa. Non avere fretta, stiamo entrando anche nel weekend... \nControlla nella spam!","replies":[{"poster":"Duspicci","date":"2016-02-12T10:26:56.733+0000","up_votes":1,"down_votes":0,"body":"purtroppo non riesco a contattare il supporto :/","replies":[{"poster":"Firenheit","date":"2016-02-12T10:28:32.862+0000","up_votes":1,"down_votes":0,"body":"Devi solo aspettare che rispondano e stiamo entrando nel weekend, è normale non riceve risposta ora... Ogni messaggio che invii ti fa tornare in fondo alla coda, quindi inviane uno e aspetta :)","replies":[{"poster":"Duspicci","date":"2016-02-12T10:31:04.658+0000","up_votes":1,"down_votes":0,"body":"quando cerco di accedere al supporto mi esce questo\nPer accedere, devi avere un account di League of Legends con un indirizzo e-mail verificato. Se non hai un account, controlla la nostra FAQ Accesso al sito del supporto. per altre opzioni.\n\n (è un anno che gioco senza problemi a lol )","replies":[{"poster":"BeardSergio","date":"2016-02-12T10:36:44.690+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Raybex,realm=EUW,application-id=98NGV4Al,discussion-id=VtqwxL3M,comment-id=0000000000000000,timestamp=2016-02-12T10:31:04.658+0000)\n>\n> quando cerco di accedere al supporto mi esce questo\n> Per accedere, devi avere un account di League of Legends con un indirizzo e-mail verificato. Se non hai un account, controlla la nostra FAQ Accesso al sito del supporto. per altre opzioni.\n> \n>  (è un anno che gioco senza problemi a lol )\n\nQuesto errore te lo da perchè non hai verificato la mail.\nLo puoi fare dalle impostazioni account su questa stessa pagina in alto a destra.\nPer le sospensioni ti anticipo che non vengono quasi mai revocate, molto probabilmente ti spiegheranno il perchè del ban.","replies":[]},{"poster":"Firenheit","date":"2016-02-12T10:35:50.489+0000","up_votes":1,"down_votes":0,"body":"Ok aspetta, rispondi solo qui o si crea confusione.\n\nEdit...\nL'indirizzo lo devi avere per forza, inserisci quello su cui ti arrivano le mail. \nSe ti dice di verificarlo probabilmente non lo hai fatto, quindi vai qui: https://account.leagueoflegends.com/euw/it/protect?utm_source=LOLCOM&utm_medium=LOLCOMPost&utm_campaign=verification1\n\nDimmi quando hai fatto e goditi il bonus IP per 4 vittorie :)","replies":[]}]}]}]},{"poster":"Duspicci","date":"2016-02-12T10:28:22.083+0000","up_votes":1,"down_votes":0,"body":"ed ho anche cercato tra l'e-mail come parola chiave riot games e mi esce solo quella di quando mi sono registrato","replies":[{"poster":"Firenheit","date":"2016-02-12T13:13:52.223+0000","up_votes":1,"down_votes":0,"body":"Puoi provare, al massimo, a contattare Judge, ma non si occupa minimamente di queste cose e non saprebbe aiutarti. In ogni caso difficilmente una punizione viene rimossa a meno che non sia un problema della Riot (come avvenne tempo fa e colpirebbe molti giocatori).\nA questo punto aspetta fino a domani, puoi fare solo questo. Quando il supporto ti risponderà, prima o poi lo farà (dipende anche da come poni la richiesta, sono comunque persone quelle del supporto), cercherai di capire cosa è successo.","replies":[]}]},{"poster":"Capoz","date":"2016-02-12T10:32:27.780+0000","up_votes":1,"down_votes":0,"body":"Il problema è che se gli va bene il support gli risponde domani, e domani può già giocare","replies":[{"poster":"Firenheit","date":"2016-02-12T10:35:00.929+0000","up_votes":1,"down_votes":0,"body":"Ambasciatore non porta pena.\nSto solo dicendo com'è, non se sia giusto o sbagliato...","replies":[{"poster":"Capoz","date":"2016-02-12T11:25:16.053+0000","up_votes":1,"down_votes":0,"body":"Idem xD","replies":[{"poster":"Firenheit","date":"2016-02-12T11:28:36.077+0000","up_votes":1,"down_votes":0,"body":":P","replies":[]}]}]}]}]},{"poster":"Chroniicles","date":"2016-02-12T11:08:28.503+0000","up_votes":3,"down_votes":1,"body":"Concordo con Sergio. Verifica l email e sentiti libero di contattare il supporto.\nAnche perché, parlare direttamente con un rioter non ti aiuterà in alcun modo... sempre che tu ci riesca! Il supporto esiste perché sarebbe impensabile per loro rispondere così ad ogni utente. Si passa a conversazioni più dirette solo in un secondo momento e solo per determinate situazioni.\nSenza offesa, la storia del non ho fatto nulla per meritarmi il ban l'abbiamo sentita centinaia di volte, è vero che gli errori capitano, è successo qualche tempo fa ma le dinamiche erano diverse (essendo stato a quel tempo un sistema automatizzato giovane, e comunque aveva afflitto parecchi players non uno solo)... ora mi sembra alquanto improbabile. La prima cosa che mi viene in mente è che sia un ban per flame... sei sicuro di non aver commesso nessuna infrazione?","replies":[{"poster":"Firenheit","date":"2016-02-12T11:26:40.331+0000","up_votes":1,"down_votes":3,"body":"I rioter rispondono sempre e con infinita pazienza e il supporto esiste perché ognuno ha un ruolo ben preciso, il fattore gran numero = difficoltà a rispondere è relativo perché applicabile a chiunque. Neanche il supporto potrebbe rispondere a tutti in relativamente poco tempo se tutti noi mandassimo un ticket. \nPer certe cose chiedo direttamente a Judge e risponde sempre. \n\nPer il resto, anche quando ci fu l'ondata di ban per l'errore umano (il sistema era su già da due anni buono ed è stato recente. Tutt'altro che giovane), il supporto rispose parafrasando \"ve lo siete meritato\" senza essere a conoscenza dell'errore. Questo mi insegna che finché non ci sono prove si è sempre innocenti e il ban può avvenire per molti motivi oltre quelli legati al flame: errori di pagamento con la banca, uso di programmi terzi, multiaccesso. Per flame si ricevono, inoltre, prima delle chat limitate che vanno crescendo fino a culminare nel ban, quindi o ha minacciato qualcuno/è stato razzista/omofobo, oppure il problema è legato ad altro...\n\nEdit- \nOvviamente anche io mi sono fatto un'idea del motivo, ma mai dire mai...","replies":[{"poster":"BeardSergio","date":"2016-02-12T13:09:02.565+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=Firenheit,realm=EUW,application-id=98NGV4Al,discussion-id=VtqwxL3M,comment-id=00010000,timestamp=2016-02-12T11:26:40.331+0000)\n>\n> Per certe cose chiedo direttamente a Judge e risponde sempre. \n> \n\nTi posso garantire che conviene comunque contattare il supporto perchè Judge non ha gli accessi a tutte le informazioni di cui dispone il supporto.","replies":[{"poster":"Firenheit","date":"2016-02-12T13:11:51.216+0000","up_votes":1,"down_votes":3,"body":">Puoi provare, al massimo, a contattare Judge, ma non si occupa minimamente di queste cose\n\n.\n\n>Per certe cose\n\nQuesta cosa di mettere -1 a chi cerca di aiutare senza neanche leggere per bene non mi piace proprio, da parte di alcuni mod e Wrenchman.\n\n*O ho modificato anche questi messaggi?*","replies":[]}]}]}]},{"poster":"OwL Kαiξn","date":"2016-02-12T12:43:38.236+0000","up_votes":1,"down_votes":0,"body":"Ho il tuo stesso identico problema!  Ieri ho giocato senza problemi e poco fa provando a loggare mi è uscito:Questo account è stato sopeso fino alla seguente data 12/02/2016 (che tra l'altro sarebbe oggi) Ma proprio non ne capisco il motivo. Come te ho controllato la posta non riuscendo a mandare un ticket ma non c'era niente.. Penso sia un bug a questo punto!","replies":[]}]}