{"poster":"AbeForgotZhonyas","date":"2016-05-11T22:30:26.163+0000","title":"Black Screen after Champ Select - cannot connect to game","subforum":"[ARCHIVED] Help & Support","up_votes":2,"down_votes":0,"body":"This issue started last night. I have not had any trouble with my internet.\n\nI can get through champ select without any problems, but as soon as the game tries to load I am greeted by the dreaded black screen.\n\nAfter about 30 seconds of the black screen, I see a white box that says \"Unable to connect to the server. Please check your network connection and attempt to reconnect to your game.\" My options are \"retry\" or \"cancel\". Retry gives me 30 seconds of the black screen before the error message again. Cancel takes me out of full screen and I see \"The game has crashed. Please reconnect\".\n\nI uninstalled and reinstalled league to see if it could be fixed that way. No luck.\n\nI can't get in to ANY games. I've been trying with customs so I don't get punished but it is incredibly frustrating.\nThe interesting part is I can spectate games without any problem. I don't get stuck on the black screen.\n\nMy default browser is chrome, I have internet explorer installed. I am using a dell laptop running windows 10. Everything is updated to the best of my knowledge. I have had no problems with league prior to yesterday.\n\nIf anyone has encountered this problem and fixed it please let me know.\n\nEDIT: I have also tried running the client after I disabled my firewall.","replies":[{"poster":"dArtagnan","date":"2016-05-12T00:18:12.816+0000","up_votes":1,"down_votes":0,"body":"Since you can not enter a match, regardless of normal, custom, re-install, etc, something seems like it is completely blocking your connection to the individual Game Servers.  Many times this can be a result of a firewall, but there are a variety of other root causes as well.  Make sure to complete all of the steps found in our [Connection Issues Article](https://support.riotgames.com/hc/en-us/articles/201752664).  It has the most common solutions that should get the Loading Screen to appear normally.\n\nIf you are still experiencing the black screen of death, make sure to reply back and let me know!","replies":[{"poster":"AbeForgotZhonyas","date":"2016-05-13T05:03:56.468+0000","up_votes":1,"down_votes":0,"body":"What ended up working was doing a system restore on my computer, to what my computer looked like 3 days ago. I can't seem to find what the problem actually was, but restoring my computer and then re-installing league fixed whatever was causing connectivity issues.","replies":[]}]},{"poster":"droopyvato","date":"2016-05-13T04:27:32.103+0000","up_votes":1,"down_votes":0,"body":"Do you have AVG? I was having the same issue and the only thing that fixed it was removing AVG and using a new antivirus. I did not trying reinstalling AVG might be worth a try","replies":[]}]}