{"poster":"IlPugliese","date":"2018-03-01T12:01:18.547+0000","title":"Kill e Assist","subforum":"Campioni e gameplay","up_votes":1,"down_votes":0,"body":"Salve a tutti, vorrei sapere una cosa, in una partita contano la farm, le kill, gli obbiettivi, e la kill participation giusto?\r\nCosa si intende per Kill Participation? \r\nE in uno score anche se non si &egrave; supp, gli assist contano?\r\nUn midlaner che ha fatto 8/8/20 ad esempio, &egrave; buono come KDA?","replies":[{"poster":"Clearωay","date":"2018-03-01T12:10:21.660+0000","up_votes":2,"down_votes":0,"body":"Per kill partecipation si intende in quante kill del tuo team hai partecipato, quindi kill + assist. 8/8/20 vuol dire 28 kill partecipation.\nIl KDA comunque conta relativamente, puoi essere 8-3-1 e aver giocato peggio di un 4-4-9. Dipende, il KDA non è tutto, bisogna vedere il farm, come ti sei mosso, se hai roammato, se hai preso obiettivi. Le kill ricorda che sono secondarie, tu puoi vincere un game anche senza killare mai il nemico giusto? Ma non upoi vincere senza prendere obiettivi come le torri. Da qui capisci a cosa devi dare priorità.","replies":[{"poster":"IlPugliese","date":"2018-03-01T12:29:37.199+0000","up_votes":1,"down_votes":0,"body":"Ok grazie mille ^^ \nVorrei chiederti solo un'ultima cosa, se in 30 minuti ho fatto 7/9/22 in midlane su un totale di 42 kills e ho fatto 164 minions distruggendo 2 torri su 6  e partecipando a 2 draghi e un baron, lo score è poisitivo?","replies":[{"poster":"Clearωay","date":"2018-03-01T12:52:55.221+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=IlPugliese,realm=EUW,application-id=cAOZwaUi,discussion-id=xGheH8JR,comment-id=00000000,timestamp=2018-03-01T12:29:37.199+0000)\n>\n> Ok grazie mille ^^ \n> Vorrei chiederti solo un&#x27;ultima cosa, se in 30 minuti ho fatto 7/9/22 in midlane su un totale di 42 kills e ho fatto 164 minions distruggendo 2 torri su 6  e partecipando a 2 draghi e un baron, lo score è poisitivo?\n\nAvere 164 cs a 30 minuti è molto poco, dovresti averne minimo un centinaio in più.\nPer il resto non posso saperlo perché non ho visto la partita, non so quanti danni hai fatto e come ti sei mosso, non si può dire solo da due dati buttati lì... bisogna anche vedere in che elo giochi ecc.\nMigliora nel farm intanto perché è davvero scarso, il resto non posso aiutarti non vendo visto il game.\n\nPS: non è che c'è un punteggio giusto e uno sbagliato per vincere. Puoi aver preso 2 torri ma aver fatto schifo in decision making e meccaniche","replies":[{"poster":"IlPugliese","date":"2018-03-01T13:06:13.849+0000","up_votes":2,"down_votes":0,"body":"Okay, grazie ^^","replies":[]}]}]}]},{"poster":"CasualNoobITA","date":"2018-03-01T13:52:02.061+0000","up_votes":1,"down_votes":0,"body":"Kill partecipation , se hai fatto 5 kill e 5 assist e lo score della partita è 20 \\ 15 , vuol dire che hai una partecipazione di 10 su 20 sulle uccisioni , quindi il 50% .\nTutti i dati singolarmente non servono a nulla potresti essere 3\\22 è avere uno score 3\\11 , avresti una kill partecipation del 100% ma avresti lo stesso fatto una cattiva partita .","replies":[]}]}