{"poster":"Salvor","date":"2018-07-16T11:48:16.919+0000","title":"[FILTRACIÓN] Primer Gameplay del Rework de Akali ❤","subforum":"Charlas Generales","up_votes":20,"down_votes":4,"body":"#ACTUALIZACIÓN: \n\nEste seria el nuevo splashart según parece haber confirmado Reav3\nhttps://cdna.artstation.com/p/assets/images/images/011/847/604/large/jessica-oyhenart-akali-splash-closeup.jpg?1531749737\n\nhttps://cdnb.artstation.com/p/assets/images/images/011/847/601/large/jessica-oyhenart-akali-splash-final-lg.jpg?1531749777\n\nHecho por Jessica Oyhenart:\nhttps://www.artstation.com/jessibean\n\n#SEGUNDA ACTUALIZACIÓN: \n**Trailer oficial**\nhttps://www.youtube.com/watch?v=w2sVx4Z8Lo0\n\nhttps://i.imgur.com/7ox9ott.png?nodirect\nLo filtro &quot;accidentalmente&quot; Professor Akali, un OTP Akali que estaba colaborando con Riot en el rework (o trabajando qsyo).\n\nhttps://i.imgur.com/lfHgD6c.png\nhttps://www.youtube.com/watch?v=rTHsD9iVipg\nTube que cambiar el Link del video porque el autor esta borrando y denunciando a los que lo suben.\nhttps://i.imgur.com/lfHgD6c.png\n\nY sus habilidades segun un usuario de Reddit son estas:\n\n**P: Assassin&#039;s Mark**\nDealing spell damage to a champion creates a circle around them.\nCrossing the circle causes Akali&#039;s next attack to have doubled range, deal X +Y +Z bonus magic damage and restore 10 energy.\n\n**Q: Five Point Strike** 1.5s cd 100 Energy\nDeals X +Y +Z magic damage. Enemies at the tip are briefly slowed.\nIf cast near full energy, akali also heals for 22.\nAt rank 5, deals an extra +Y +Z damage to minions and monsters.\n\n**W: Twilight Shroud** 17s cd RESTORES 40 Energy\nDrop a spreading cover of smoke lasting 5 seconds.\nThe smoke obscures Akali from enemy vision and grants her 20% movement speed.\nEntering or exiting obscured extends Shroud&#039;s duration.\n(NOTE: Immune to all forms of reveal. Even turrets.)\n\n**E: Shuriken Flip** 16s cd 30 Energy\nFlip backward and fire a shuriken forward, dealing X + Y physical damage and marking the first enemy or smoke cloud hit.\nRe-Cast: Dash to the marked target, dealing the same damage.\n(NOTE: Looks like it has massive or possibly unlimited range, and may be thrown into Shroud to market it and dash to it much like an enemy.)\n\n**R: Shadow Dance** 120s cd no cost\nTwo dashes: The first micro-stuns and deals 120 + Y physical damage.\nThe second executes, dealing 120 + Z to 300 + Z magic damage based on missing health.\n\nhttps://i.gyazo.com/dc663903c09169c6b4244475bdbf505e.png","replies":[{"poster":"TSW Rorschach","date":"2018-07-16T13:25:25.775+0000","up_votes":8,"down_votes":0,"body":"Con el respeto a los que usan a Akali, ojalá la revienten a nerfeos... invisibilidad contra vision verdadera de torretas? es en serio?","replies":[{"poster":"ZanahoriaAsesina","date":"2018-07-16T14:06:42.875+0000","up_votes":3,"down_votes":0,"body":"Para mi que es joda pero el problema es que el equipo de balance es capaz de estas cosas xd","replies":[{"poster":"TSW Rorschach","date":"2018-07-16T14:20:38.958+0000","up_votes":3,"down_votes":0,"body":"Es que ya me pasó de pensar que es joda y al final lo sacan, así que no me confío de nada :'v","replies":[]}]}]},{"poster":"Hwaxinghz","date":"2018-07-16T13:54:45.610+0000","up_votes":11,"down_votes":6,"body":"Otro personaje más a la lista del Baneo en todo tipo de partidas.\n\nUna porquería asesina más del montón, lástima que a Riot sólo le interesen esta porquería de clase de campeones y no los más divertidos como los Magos, Melee o Tiradores.\n\nCada día me gusta menos este juego.\n\n----\n\n_Fiddlesticks, te voy a tener que dejar de banear_\n\nCAW CAW CAW CAW {{champion:9}}","replies":[{"poster":"Salvor","date":"2018-07-16T14:00:39.822+0000","up_votes":4,"down_votes":0,"body":"> Otro personaje más a la lista del Baneo en todo tipo de partidas.\n\nPor como están los foros y Reddit creo que la invisibilidad contra torres la sacaran, literalmente no tiene counterplay, si se fedea e puede divear de manera infinita, y encima puede entrar y salir a gusto, por lo que ni con {{item:3157}} {{item:2420}} podes safar.\n\nY esperemos que ahora no se pueda tanquear, porque creo que todos conocemos a esa Akali Off-Tank: \n{{champion:84}} {{item:3146}} {{item:3748}} {{item:3065}}","replies":[{"poster":"Hwaxinghz","date":"2018-07-16T14:03:52.017+0000","up_votes":4,"down_votes":0,"body":"Mira, muchos se quejaban de Pyke que estaba OP y tal, pero tiene el kit balanceado debido a que \"no te puedes tankear\", yo creo que de forma análoga deberían adaptar a TODOS los asesinos con esa estrategia así evitar la imundicia de \"ñiñiñi te mato de medio básico y encima tengo 4000 de vida\".\n\nQue no se vaya a poder tanquear sino será la peor porquería de todas, que ya de por sí sale 1/25 antes del nivel 6 y post nivel 6 sale 50/25. Ojalá que la acomoden.","replies":[{"poster":"ZanahoriaAsesina","date":"2018-07-16T14:30:43.703+0000","up_votes":5,"down_votes":0,"body":">  \"ñiñiñi te mato de medio básico y encima tengo 4000 de vida\".\n\nJAJAJA \n\n#######TrueStory","replies":[{"poster":"Hwaxinghz","date":"2018-07-16T14:32:01.127+0000","up_votes":3,"down_votes":0,"body":"Yo opino que hechen al que propuso ese rework, y si llega a salir a la luz, las páginas como OP.gg aparecerán con: Akali: Playratio 0%, banratio: 100%, KDA: 0/0/0 0cs","replies":[{"poster":"Salvor","date":"2018-07-16T14:37:45.580+0000","up_votes":2,"down_votes":1,"body":"Cuando uno de tu team la quiera usar, pero se la pickee primero el team contrario.\nEn esos casos la vas a tener que aguantar.\n(y va a pasar seguido)","replies":[{"poster":"Hwaxinghz","date":"2018-07-16T14:40:44.000+0000","up_votes":2,"down_votes":2,"body":"Permabanearé a Akali lo mismo, sabes que el aliado nunca sabe usar a los campeones OP, siempre terminan fedeando, así que da igual que la prepickeen, si eso sale así, no me arriesgo, la permabanearé por más que la quiera usar Faker.","replies":[{"poster":"Salvor","date":"2018-07-16T14:44:05.169+0000","up_votes":4,"down_votes":0,"body":"SI haces eso te expones a que dicho aliado trollee.\nY garantizas un mal ambiente en la partida.\n\nLo mejor que podes hacer es asegurarte que se la tradeen para que la tenga tu aliado.\nMi experiencia en el juego me dice que lo mejor es ser positivo siempre.\n\nSi tu aliado muere: Ahora te ayudo, tranka que se gana.\n\nSi tu aliado mata: Buena \"nombre de champ\"","replies":[{"poster":"Hwaxinghz","date":"2018-07-16T14:48:14.922+0000","up_votes":2,"down_votes":1,"body":"Mi experiencia me dice lo contrario con campeones recién reworkeados o nuevos.\n\nDe cualquier manera, también tengo la mala suerte de que, por ejemplo, determinados campeones aliados jamás me llevan a la victoria (Lee Sin, Riven, Draven, Blitzcrank, Fiddlesticks, Yi, Kayle, Galio, etc). Por ello en este último tiempo estoy baneando mucho a Fiddlesticks o a Yi, el primer caso es porque siempre que sale del lado enemigo es injugable, y el segundo caso si sale del lado aliado recién hace algo al minuto 40 y sale 1/16 en early. Pero te aseguro que cuando salga Akali (si sale así de horrenda) voy a permabanearla por más que el aliado se llame: \"Main Akali S1\" y le ves el perfil y tiene 5 millones de maestría con Akali, da igual, seguro que va a fedear o el enemigo la va a pickear primero.\n\nSoy partidario de que Riot debe poner un sistema de adaptación al nuevo campeón, haciendo que en la primer semana no se pueda jugar en Ranked.","replies":[]}]}]}]},{"poster":"ZanahoriaAsesina","date":"2018-07-16T14:37:03.845+0000","up_votes":3,"down_votes":0,"body":"El tema es que no es uno sino varios, son un equipo.\n\nIgual no sería raro que rito haya tirado este leak salvaje para ver las reacciones y opiniones de los jugadores.\n\nYo voy a esperar a la noticia oficial porque estos leaks maquiavélicos hacen mal al corazón. xD","replies":[{"poster":"Hwaxinghz","date":"2018-07-16T14:38:40.060+0000","up_votes":2,"down_votes":1,"body":"Bueno, hora de hechar al equipo que piensa sobre estas cosas. No se en que piensan aveces con tales abominaciones.\n\nInvisibilidad contra torres? Creo que si eso sale a la luz y si en mi partida no se banea, DODGE DODGE DODGE DODGE DODGE, la técnica milenaria para tener 1% de winratio y una cola de baja prioridad de 5 horas por día.","replies":[]}]}]}]}]}]},{"poster":"Fedefoxa","date":"2018-07-16T17:42:26.428+0000","up_votes":3,"down_votes":1,"body":"Itri pirsiniji mis i li listi dil binio in tidi tipi di pirtidis.","replies":[]}]},{"poster":"IvVicious","date":"2018-07-16T13:15:17.197+0000","up_votes":7,"down_votes":2,"body":"> (NOTE: Immune to all forms of reveal. Even turrets.)\n\nEste juego cada vez me saca más las ganas de jugarlo ¯\\_(ツ)_/¯","replies":[{"poster":"Salvor","date":"2018-07-16T13:16:27.611+0000","up_votes":2,"down_votes":0,"body":"Vamos a ver cuando salga que tal, capas estaba débil el champ, recordemos que siempre lo nuevo nos parece roto.","replies":[{"poster":"IvVicious","date":"2018-07-16T13:29:08.855+0000","up_votes":3,"down_votes":1,"body":"Que el champ esté débil se compensa con buffs al daño/escalados o simplificando mecánicas, no dándole el skill más roto (e incoherente) del juego xD Ojalá se den cuenta de que se la están recontra mandando y no salga así en vivo, la están condenando a ser permaban y ni siquiera salió todavía.","replies":[]}]}]},{"poster":"ZanahoriaAsesina","date":"2018-07-16T12:04:36.532+0000","up_votes":1,"down_votes":0,"body":"Creo que está un poquiiiito fuerte.\n\n\n;-;","replies":[{"poster":"Salvor","date":"2018-07-16T12:07:37.932+0000","up_votes":4,"down_votes":0,"body":"Siempre lo estuvo ❤\n\nhttps://pre00.deviantart.net/33d1/th/pre/f/2015/134/a/e/akali_nurse_by_morbidprince-d69cqwq.jpg\nhttps://i.ebayimg.com/images/g/ZHMAAOSw6kxXINVS/s-l300.jpg\nhttps://i.ytimg.com/vi/0FGDwz4pprU/maxresdefault.jpg","replies":[{"poster":"ZanahoriaAsesina","date":"2018-07-16T14:05:30.399+0000","up_votes":4,"down_votes":0,"body":"😏","replies":[]}]}]},{"poster":"Turing Test","date":"2018-07-16T12:50:13.784+0000","up_votes":2,"down_votes":0,"body":"Se fueron al carajo con el área en que funciona. Es un asesino Dios mío !","replies":[{"poster":"Salvor","date":"2018-07-16T12:52:20.565+0000","up_votes":4,"down_votes":0,"body":"Ya en NA se están quejando de que tiene invisibilidad contra torretas y FUENTE.","replies":[{"poster":"TSW Rorschach","date":"2018-07-16T13:40:05.109+0000","up_votes":4,"down_votes":0,"body":"Y con razón, el chiste de eso sería evitar el abuso o sino no revelarían a los otros invisibles {{champion:91}} {{champion:67}} {{champion:62}} {{champion:35}}. Las torretas cada día tienen más utilidad de planta decorativa que otra cosa...","replies":[]},{"poster":"Turing Test","date":"2018-07-16T12:55:11.487+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=Salvor Hardin,realm=LAS,application-id=v7qsfXsE,discussion-id=UOORllhE,comment-id=00050000,timestamp=2018-07-16T12:52:20.565+0000)\n>\n> Ya en NA se están quejando de que tiene invisibilidad contra torretas y FUENTE.\n\nxD . Eso tiene cara de bug. Quiero decir, las torretas dan visión verdadera. Nada puede escapar de la visión verdadera!","replies":[{"poster":"Salvor","date":"2018-07-16T13:01:26.121+0000","up_votes":2,"down_votes":0,"body":"Esto si puede, y también de la fuente.\n(y no es bug)","replies":[]}]}]}]},{"poster":"Thotiana","date":"2018-07-16T11:58:56.457+0000","up_votes":4,"down_votes":0,"body":"***","replies":[{"poster":"Salvor","date":"2018-07-16T12:02:40.597+0000","up_votes":2,"down_votes":0,"body":"La tendrán que recontranerfear xD\n\nhttps://i.imgur.com/gNAYTZI.png?nodirect","replies":[]}]},{"poster":"Dog Bulling","date":"2018-07-16T16:26:33.521+0000","up_votes":5,"down_votes":1,"body":"CertainlyT, no se como lo haces para hacer estos diseños y no ser despedido. \n\nPrimero el samurai con un muro de viento y doble crítico; Luego la fantasma de los saltos tras meter un básico y mejor ejecución a monstruos que cualquier jungla; despues el lord de los bugs, los pies de pizza y el dragón como mascota; Luego el fumador de los básicos AoE y que revienta a casi todo mientras aguanta más que algunos bruisers; Posteriormente la androide/cyborg de shingeki no kyojin que tiene de todo en su kit; y el más reciente, la loli legal maestra de los oneshots y del abuso de los hechizos (Y fíjate que al inicio me hacía mucha ilusión la campeona, pero luego me dí cuenta de que su kit giraba en torno al su oneshot en vez del uso de hechizos y mi amor a ella se volvió odio).\n\nAhora nos salen con una campeona que ni puede ser revelada por torres. Siendo el ya me esperaba alguna mecánica rota como esa, y aún así me da una rabia enorme ese diseño y que el sujeto siga ignorando algo tan simple como \"Un buen campeón debe ser divertido a la hora de jugar **Y TAMBIÉN AL ENFRENTÁRSELE EN CONTRA**\".","replies":[{"poster":"Salvor","date":"2018-07-16T16:31:38.973+0000","up_votes":3,"down_votes":0,"body":"Yo sigo soñando que saquen campeones simples de usar y masterizar.\n\nCuantos campeones con movilidad absurda van a sacar?\n#LeagueofDash","replies":[]},{"poster":"Nisinunglacert","date":"2018-07-16T16:53:33.334+0000","up_votes":1,"down_votes":0,"body":"Y te olvidas de Darius, Zyra, Thresh, Warwick(rework), Caitlyn(rework)...\nAl tipo le cuesta hacer cosas balanceadas xD\n\n######Lo busqué en la wikia, no sé si está todo correcto.","replies":[{"poster":"Dog Bulling","date":"2018-07-16T17:52:03.731+0000","up_votes":1,"down_votes":2,"body":"Si me pongo a mencionar todos y cada uno de los trabajos/desastres de ese tipo no acabaríamos nunca. \n\nPD: Trabajo con darius las dos veces, tanto el original como el minirework, y tambien hizo a Zed. Es la prueba definitiva de que popular =/= buen diseño, y de como NO se deben hacer campeones.","replies":[{"poster":"TSW Rorschach","date":"2018-07-16T18:48:41.921+0000","up_votes":2,"down_votes":0,"body":"Sin embargo, ahí sigue. Y probablemente siga colaborando con más.\n\nYo me daba una idea de que iba a ser un campeón frustrante, pero eso es zarparse 4 hectáreas.  Varios colaboran en cada rework, y me encantaría saber **qué se les pasó por la cabeza** de todas esas personas para no razonar la W. Me los imagino diciendo algo como:\n\n\"Su invisibilidad depende de un área específica a diferencia de otros campeones, deberíamos agregarle algo más\"\n\n\"Creo que lo mejor es que en su W no la vea ni la vision verdadera de las torres y no la puedan atacar, eso podría ayudarla. Están todos de acuerdo?\" \n\n\"Suena bien, como es un area específica, seguro que necesita eso para poder hacer jugadas exitosamente, porque le falta escapes\"\n\n\"Me parece bien, muy bien. Pero un círculo entero me parece con muy poco counterplay, qué tal si hacemos que se extienda en forma de rosca para que el enemigo sepa menos dónde puede estar?\"\n\n\"Si, si, tiene que ser un personaje muy móvil, la idea es frustrar al enemigo y que sienta el ser acechado por un asesino. Hey, ¿recuerdan lo divertido que es hacer spawn kill?\"\n\n\"Si!\"\n\n\"Podríamos dejárselo y de última damos esa excusa de que como es un area que se va terminando, necesita no ser vista por nada para compensar\"\n\n\"Perfecto! por cierto, creo que al básico de la pasiva le falta daño, agreguenle daño, **daño**! es un asesino!\"","replies":[{"poster":"Dog Bulling","date":"2018-07-16T19:14:08.464+0000","up_votes":2,"down_votes":0,"body":"Empleado cuerdo: Disculpe, CertainlyT, pero ese campeón, como que tiene poco counterplay ¿Y si el público se queja y la comienza a odiar como a 'otras de sus creaciones'?\n\nCertainly~~idio~~T: Yo soy el jefe, y digo que eso no importa. Lo relevante es que atraigan a bastante público para que venda skins. Que el diseño sea agradable en contra o que casi todos le terminen odiando es irrelevante, y usted como ex-empleado de Riot debería saberlo perfectamente.\n\nCuerdo: No logro entenderle.\n\nEl creador de Yasuo: La cuestión es muy simple, y es que por cuestionar y revelarse contra las desiciones de sus superiores, hemos decidido despedirlo. Tiene hasta el final del día para sacar todas sus cosas, o las tiraremos a la basura.","replies":[]}]}]}]}]},{"poster":"The Tio UwU","date":"2018-07-16T20:55:15.265+0000","up_votes":3,"down_votes":0,"body":"Que bien splash art, debería profanarlo ( ͡° ͜ʖ ͡°)","replies":[{"poster":"Salvor","date":"2018-07-16T21:01:05.462+0000","up_votes":2,"down_votes":0,"body":"https://img00.deviantart.net/0280/i/2012/107/3/1/rule_34_logo_by_iloveportalz0r-d4wgqwr.png","replies":[]}]},{"poster":"Diego2056","date":"2018-07-16T16:48:34.038+0000","up_votes":2,"down_votes":1,"body":"Todos hablando de lo rota que esta y yo encantado con el splash art.","replies":[{"poster":"Salvor","date":"2018-07-16T16:51:14.542+0000","up_votes":3,"down_votes":0,"body":"Yo quiero ver el de enfermera haber si esos magumbos!\nhttps://i.ytimg.com/vi/XvLaLGzquuo/hqdefault.jpg","replies":[]}]},{"poster":"TRASHGENDER","date":"2018-07-16T15:22:36.926+0000","up_votes":3,"down_votes":0,"body":"Mamita querida ese splash art por dios!!111","replies":[]},{"poster":"SW Qui Gon Jinn","date":"2018-07-16T17:58:43.712+0000","up_votes":2,"down_votes":0,"body":"Esta MEGA rota, pero ya se pasaron, invisibilidad ante el mismo NEXO? naaa.. y 2 habilidad para llegar al enemigo vs 1 sola que tenia... Por cierto, no era que ella buscaba el equilibrio con sus frases y bla bla bla... ''como lo dicte el equilibrio'' pero ahora tiene una pinta de rebelde con pañuelo verde pro aborto.. a ver, a ver, que paso?","replies":[{"poster":"TSW Rorschach","date":"2018-07-16T18:54:40.174+0000","up_votes":2,"down_votes":0,"body":"Es que según el lore, Akali dijo algo como \"Voy a buscar mi propio equilibrio, con juegos de azar e invisibilidad verdadera\" y dejó la orden.","replies":[]}]},{"poster":"Excorpion","date":"2018-07-16T17:48:17.733+0000","up_votes":2,"down_votes":2,"body":"dejen de llamarles filtraciones/ _u","replies":[{"poster":"Salvor","date":"2018-07-16T17:54:14.218+0000","up_votes":2,"down_votes":0,"body":"Esta fue una verdadera filtración, lo subió un tester (professor Akali) y despues lo tubo que borrar y denunciar a los canales que resabian, claramente no estaba en los planes de Riot mostrarnos todo el rework de esta forma.","replies":[]}]},{"poster":"Sir Crucifix ","date":"2018-07-16T16:34:52.907+0000","up_votes":3,"down_votes":1,"body":"No pienso ver el video del vago ese , a menos que haga un video repartiendo un curriculum","replies":[{"poster":"Salvor","date":"2018-07-16T16:43:41.496+0000","up_votes":2,"down_votes":0,"body":"Pero si Jota es un gran Yutuver, tiene talento y personalida.\nhttp://i.imgur.com/EFRriYD.gif?nodirect","replies":[]}]},{"poster":"Fenrito","date":"2018-07-16T16:28:26.576+0000","up_votes":2,"down_votes":0,"body":"Interesante que le quitaron esa curación op que tenia y le agregaron ese potencial de outplay y movilidad. Se va a sentir más como un ninja y no un camión que te haces one shots sin entender bien por que.","replies":[]},{"poster":"Musidora Klemm","date":"2018-07-16T12:27:19.356+0000","up_votes":1,"down_votes":0,"body":"Loco sueltenle el +1 a Salvor por el post. No sean ratas.\n\nPinta interesante.","replies":[{"poster":"Salvor","date":"2018-07-16T12:29:21.316+0000","up_votes":2,"down_votes":0,"body":"Guardense sus +1 señores y señoritas.... este no es mi ultimo post del día.","replies":[{"poster":"Musidora Klemm","date":"2018-07-16T15:14:50.523+0000","up_votes":2,"down_votes":0,"body":"Dale que tengo muchos upvotes disponibles ;)\n\nAhora veo que actualizaste el post y agregaste el splash art, creo que me voy a poner mal. No era main Akali ni nada, pero su splash art de luna de sangre era el más lindo de esa temática y muchas otras :'( voy a extrañarlo","replies":[]}]}]},{"poster":"Nuke","date":"2018-07-16T14:09:30.334+0000","up_votes":3,"down_votes":1,"body":"https://i.ytimg.com/vi/1W1mZn7kYos/hqdefault.jpg","replies":[]}]}