{"poster":"Salvor","date":"2016-09-05T22:17:21.908+0000","title":"Baje a Plata 3 y te lo cuento!! (crypost)","subforum":"Charlas Generales","up_votes":7,"down_votes":5,"body":"Hola seguramente me recuerden de otros crypost como &quot;porque no buffean a singed&quot; y &quot;balance de campeones 4&quot;\r\nHoy les traigo mi mas reciente experiencia,\r\nen 3 d&iacute;as pase de plata 2 93 pl a plata 3, y como es de esperarse de todo crypost mas de la mitad de esas partidas fueron x Fedeers 0/7 2/12 etc Trolls (no del tipo &quot;te trolleo&quot; sino del tipo &quot;hola soy jg y no me compro botas ni el &iacute;tem de jg&quot; muchas premades Flamers/fedeers y reci&eacute;n para coronar la ca&iacute;da a plata 3 UN AFK.\r\nLa verdad ya no se que hacer, siento impotencia, bronca, ganas de golpear la pared etc etc.\r\nNo puedo subir as&iacute;, me mato para ganar una ranked y despu&eacute;s pierdo 2 x gente as&iacute; o mi cl&aacute;sico caso de fedeo a mi team con mis ganks (soy jg) y despu&eacute;s se pierden 2 tf y fue.(obviamente que yo tambi&eacute;n puedo manquear, no es que todas las pierda x otra gente, pero si una mayor parte.\r\n{{sticker:zombie-nunu-tears}}","replies":[{"poster":"reboxer","date":"2016-09-05T22:26:13.619+0000","up_votes":7,"down_votes":1,"body":"***","replies":[{"poster":"Salvor","date":"2016-09-05T22:30:20.142+0000","up_votes":3,"down_votes":1,"body":"> [{quoted}](name=reboxer,realm=LAS,application-id=v7qsfXsE,discussion-id=bPE2iVcP,comment-id=0002,timestamp=2016-09-05T22:26:13.619+0000)\n>\n> Bienvenido a la parte oscura del sistema de emparejamiento. {{champion:17}}\n\nMe sorprende encontrar estos comentarios y no las típicas burlas de \"estas donde debes\" y cosas así. :)","replies":[]}]},{"poster":"Salvor","date":"2016-09-05T22:28:56.626+0000","up_votes":2,"down_votes":0,"body":"Encima ahora me fijo y 75 pl, no me alcanza con una para la promo....\nTengo a un amigo que lleva meses tratando de subir a plata actualmente esta luchando su promo a plata y yo como plata 2 (ahora 3) lo único que quiero es subir a oro y listo normales y mejorar a hasta el año que viene, hago de todo para llegar a esa meta, leo guías, guías sobre como \"rankear\" guías sobre el mmr el sistema elo, de todo. y no se me da.\nTengo tanta bronca que hasta se me cruza el eloboost (cosa que detesto y aborresco)","replies":[{"poster":"dadevarG","date":"2016-09-05T22:31:27.340+0000","up_votes":2,"down_votes":0,"body":"Y, ante DynamicQ uno piensa que no queda otra, pero bueno, asi es el sistema de Riot.","replies":[]}]},{"poster":"dadevarG","date":"2016-09-05T22:18:15.937+0000","up_votes":2,"down_votes":0,"body":"La magia de DynamicQ.","replies":[{"poster":"Salvor","date":"2016-09-05T22:34:27.535+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=dadevarG,realm=LAS,application-id=v7qsfXsE,discussion-id=bPE2iVcP,comment-id=0000,timestamp=2016-09-05T22:18:15.937+0000)\n>\n> La magia de DynamicQ.\n\nLa verdad no conocí el soloQ pero x lo que leo es mejor. aunque para mi el problema es la toxicidad, esta muy elevada. y gente que juega con campeones sin maestría (hablo en general, algunos te sorprenden y otros con m7 manquean) y fedean.\n\nahora estoy pensando en jugar soraka, curar posicionarme bien en las tf y ver si asi podre subir.","replies":[{"poster":"dadevarG","date":"2016-09-05T22:37:24.912+0000","up_votes":1,"down_votes":0,"body":"Te deseo suerte, yo pensaba subir Solo aunque dudo lo vaya a lograr, aun asi en mi ultima ranked, la cual gane, conoci a un trio bastante amable y me aceptaron, ahora creo que me rendi ante mi propio codigo, pero con como esta es dificil subir solo.","replies":[]}]}]},{"poster":"Blaknight","date":"2016-09-06T00:10:42.531+0000","up_votes":2,"down_votes":1,"body":"Si no puedes contra ellos, úneteles. Fin.\n Cya\n {{sticker:slayer-jinx-wink}}","replies":[{"poster":"Khada J","date":"2016-09-06T00:19:54.143+0000","up_votes":1,"down_votes":0,"body":"La verdad no me lo esperaba xDD","replies":[]}]},{"poster":"Adheliøs","date":"2016-09-07T00:27:18.431+0000","up_votes":1,"down_votes":0,"body":"Te entiendo amigo a mi me paso algo similar, después de las 10 rankeds quede en bronce ll, subí hasta plata v y a los meses intente subir mas, fue horrible llegue hasta plata ll con 98 pl y baje a plata lv en cuestión de días, deje de jugar, lo volví a intentar, volví a trabarme en plata ll, subi a plata l, baje a plata ll de nuevo, volví a subir y por fin hoy pude llegar a oro v xD, los emparejamientos a veces muy injustos, los flamers abudan y los unrakeds te dan ganas de pegarte un tiro, afks y trolls sobraron y sobre todo el feder, tuve que conseguirme un duo para asegurarme que esa linea no se fedeara xd, main {{champion:16}}  carrea, agrega :)","replies":[]},{"poster":"Rekno","date":"2016-09-06T22:14:42.831+0000","up_votes":1,"down_votes":0,"body":"Pibe te digo una solución para cuando te re calentas y sientas unas ganas de gritar o gruñir y romper todo.\n\nEscuchate estos temas a full volúmen:\nhttps://www.youtube.com/watch?v=RXks5M56aTI\nhttps://www.youtube.com/watch?v=5abamRO41fE\n\nO escuchate otros temas que tengan screamo´s zarpados. {{champion:238}}","replies":[]},{"poster":"Playmaker","date":"2016-09-06T08:09:07.455+0000","up_votes":1,"down_votes":0,"body":"{{champion:238}}  ctrl + 6\nsigue itentando y subiras\nhace unas semanas subi con singed a oro con mi smurf , no costo nada","replies":[]},{"poster":"Matichq117","date":"2016-09-06T02:35:01.695+0000","up_votes":1,"down_votes":0,"body":"tl dr, Stannis te hacias el capo y la pecheaste en la final, ya no te banco mas m3n","replies":[{"poster":"Salvor","date":"2016-09-06T05:22:15.167+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Matichq117,realm=LAS,application-id=v7qsfXsE,discussion-id=bPE2iVcP,comment-id=000a,timestamp=2016-09-06T02:35:01.695+0000)\n>\n> tl dr, Stannis te hacias el capo y la pecheaste en la final, ya no te banco mas m3n\n\nNo se quien sos y no sabia que \"me bancabas\" xD y no se donde me hacia el capo","replies":[]}]},{"poster":"Runth","date":"2016-09-06T02:37:07.073+0000","up_votes":1,"down_votes":0,"body":"{{item:2003}}  tomenla bien a fondo","replies":[]},{"poster":"Runth","date":"2016-09-06T02:26:46.546+0000","up_votes":1,"down_votes":0,"body":"las rankeds no venden biberones y menos chupones {{champion:16}}","replies":[]},{"poster":"TOGA","date":"2016-09-06T02:06:56.126+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=StannisTrueKing,realm=LAS,application-id=v7qsfXsE,discussion-id=bPE2iVcP,comment-id=,timestamp=2016-09-05T22:17:21.908+0000)\n>\n> Hola seguramente me recuerden de otros crypost como &amp;quot;porque no buffean a singed&amp;quot; y &amp;quot;balance de campeones 4&amp;quot;\n> Hoy les traigo mi mas reciente experiencia,\n> en 3 d&amp;iacute;as pase de plata 2 93 pl a plata 3, y como es de esperarse de todo crypost mas de la mitad de esas partidas fueron x Fedeers 0/7 2/12 etc Trolls (no del tipo &amp;quot;te trolleo&amp;quot; sino del tipo &amp;quot;hola soy jg y no me compro botas ni el &amp;iacute;tem de jg&amp;quot; muchas premades Flamers/fedeers y reci&amp;eacute;n para coronar la ca&amp;iacute;da a plata 3 UN AFK.\n> La verdad ya no se que hacer, siento impotencia, bronca, ganas de golpear la pared etc etc.\n> No puedo subir as&amp;iacute;, me mato para ganar una ranked y despu&amp;eacute;s pierdo 2 x gente as&amp;iacute; o mi cl&amp;aacute;sico caso de fedeo a mi team con mis ganks (soy jg) y despu&amp;eacute;s se pierden 2 tf y fue.(obviamente que yo tambi&amp;eacute;n puedo manquear, no es que todas las pierda x otra gente, pero si una mayor parte.\n> {{sticker:zombie-nunu-tears}}\n\nAmigo, te entiendo perfectamente y te digo porque:\nHace 2 semanas que me puse a subir mi cuenta con intención de llevarla a oro (ya que por fin tengo tiempo de jugar al menos de noche un poco al lol).\nEn 2 días sin mentirte la subi de plata 5 a plata 2. Tuve una racha de 10 wins y abre perdido como mucho 2 partidas de 16 que jugué (me tocaron gente trolls y gente malisima que parecía troll pero aun así tuve suerte de poder carrearla con la ayuda de los otros 3 que si querían ganarla).\nSubí a silver 2 y se me vino a la mente lo mismo que el año pasado (silver 2 y silver 1 es la escoria de silver...). Y así{{sticker:slayer-jinx-wink}}  fue, me toco la gente que describís, desde que subi a silver 2 baje 3 veces a silver 3 y volví a subir en cuestion de 2 partidas... Ahora tengo 38 puntos en silver 2 y si te fijas mis ultimas 2 wins me toco un trynda (troll y unranked sin runas) que salio 1/8/1, un adc que salio 3/9 y el supp 0/9/8, pero tuve la suerte de que fui mid y junto al top que jugaba safable la carreamos. En fin en silver 2 abre jugado mínimo 20 partidas de las cuales 10 tuve gente afk (mande ticket a riot en todas), 2 no me aceptaron el remake y otras tuve gente troll (amumu top, shaco top, ez jg, kha mid... en fin algunos picks no son tan trolls pero no hablo troll al pick sino troll porque trollearon la partida, iban dispuestos a morir y eso es lo que me enoja... ya después si sacas lulu jg pero cumplís la función de jungla realmente no me molesta aunque no va a ser tan viable que llevar un jungla de verdad).\nBásicamente las que gano en silver 2 son porque voy mid y muteo a todos porque intente explicarles mil veces y darle consejos y solo se quejan y te empiezan a decir \"vos que me vas a decir a mi, no me podes enseñar\" y cosas asi, asi que tenes dos opciones:\n- \"/mute all\" y no leer las mugres que se dicen el chat que te bajan el autoestima y carrearla fooerte.\n-\"/all report team gg wp\" llorar porque te toco gente manca y perder puntos.\nSe que es un juego de a 5 y todos deberían aportar para ganar, pero si queres subir a oro no entres a la partida confiado de que te va a tocar gente que quiera ganarla realmente (incluye tanto como trolls, o gente que en realidad juega mal y no entiende nada). Entonces te doy un consejo, mutea a todos y intenta carrearla y a la primera derrota que te salga no juegues mas por ese dia. Un abrazo man.","replies":[]},{"poster":"teemo reumatico ","date":"2016-09-06T01:02:15.450+0000","up_votes":1,"down_votes":0,"body":"un consejo por experiencia\nde elo bajo salis con garen top jax jg nasus morde jg cosas rotas q no necesiten manos . no le busques la vuelta mainea yi","replies":[]},{"poster":"Akio san","date":"2016-09-05T22:23:34.401+0000","up_votes":1,"down_votes":0,"body":"donde esta tu bruja roja jajajjajaj ok","replies":[]},{"poster":"Reboleira","date":"2016-09-06T00:32:35.430+0000","up_votes":1,"down_votes":1,"body":"Pues yo soy plata uno, y creo estar en una posición donde puedo afirmar con toda mi experiencia y por lo basado en lo que dices llego a la deduccion que eres un manco. {{sticker:slayer-jinx-catface}}","replies":[]},{"poster":"Hnk Kenshiro","date":"2016-09-05T22:39:32.758+0000","up_votes":2,"down_votes":4,"body":"La verdad si, el emparejamiento siempre es azaroso, y basta 1 para arruinar a 4.\n\nLo único que puedo hacer, es darte consejos de Soporte o Jg si juegas esas lineas (conozco de las demás, pero no las juego)","replies":[]}]}