{"poster":"Salvor","date":"2018-05-24T17:19:06.716+0000","title":"Ghostcrawler, director de diseño, responde a duras criticas 👊","subforum":"Charlas Generales","up_votes":23,"down_votes":7,"body":"[](http://2.bp.blogspot.com/-jIATEQvhN-w/UZX3Wg5W72I/AAAAAAAAAH8/tSY8OgoH8t4/s1600/images2.jpg)\r\n\r\n##Buenas tardes!\r\n\r\nHace unos d&iacute;as el usuario Speedweeb lanzo una fuerte critica/acusaci&oacute;n al director de dise&ntilde;o de Riot, Ghostcrawler, y este respondi&oacute;, como esto trascendi&oacute; bastante tanto en los foros como en Reddit, traigo ac&aacute; tanto la critica como la respuesta de Ghostcrawler, es bastante para leer, as&iacute; que lo siento xD\r\nDisfruten!\r\n\r\n[LINK POST NA](https://boards.na.leagueoflegends.com/en/c/gameplay-balance/iauURkH3-for-once-lets-blame-ghostcrawler-for-something-hes-actually-responsible-for?)\r\n\r\n\r\nhttps://i.imgur.com/lfHgD6c.png\r\n\r\n\r\n\r\n#Esta es la critica de Speedweeb (EUW):\r\n\r\n**&iexcl;Por una vez, culpemos a Ghostcrawler por algo de lo que &eacute;l es realmente responsable!**\r\n\r\nS&eacute; que estas juntas tienden a centrar su descontento con la decisi&oacute;n de todo un equipo o departamento en un solo mascar&oacute;n de proa, y aunque ocasionalmente golpean con &eacute;l al mascar&oacute;n de proa adecuado, pero sobre todo con cr&iacute;ticas que afectan a acciones que podr&iacute;an haber estado remotamente en el &aacute;rea de responsabilidad de dicho mascar&oacute;n de proa, pero nada de lo que ellos mismos hicieron. As&iacute; que en este tema voy a tratar de se&ntilde;alar directamente lo que nuestro Sr. Amigo L&iacute;der de Gameplay ha estropeado - y lo que es en realidad su error, y no s&oacute;lo una cosa terrible al azar que el equipo en su conjunto cocin&oacute; (como el actual cambio de Scuttle).\r\n\r\nPero por ahora, empecemos por el principio, y para ver de qu&eacute; es responsable, necesitamos saber cu&aacute;l es el trabajo. En la mayor&iacute;a de los casos, las posiciones aparentemente &quot;l&iacute;deres&quot; en el dise&ntilde;o no son los &quot;dise&ntilde;adores jefes&quot;, sino que en la mayor&iacute;a de los casos se trata de un dise&ntilde;o normal con un mont&oacute;n de trabajo de gesti&oacute;n lanzado sobre &eacute;l. S&iacute;, en teor&iacute;a tienes la &uacute;ltima palabra, pero tu trabajo principal no es exactamente dise&ntilde;ar, sino m&aacute;s bien mantener sincronizados a todos los equipos que trabajan actualmente en el dise&ntilde;o, por un lado para que puedan trabajar juntos, por el otro para que todos est&eacute;n informados de lo que se hace actualmente y cu&aacute;l es la direcci&oacute;n general actual.\r\n\r\nY es en esta direcci&oacute;n donde reside el problema actual de este juego, porque en comparaci&oacute;n con temporadas anteriores, ha habido un cierto cambio.\r\n\r\nEste cambio ha sido el aspecto m&aacute;s fundamental a la hora de jugar: c&oacute;mo se consigue la experiencia. League of Legend es un juego que sigue un patr&oacute;n de empoderamiento. Por un lado, en el simple sentido de que t&uacute;, un simple ser humano, juegas un CAMPE&Oacute;N PODEROSO, por otro, que el juego es una competencia de poder, porque para ganar necesitas usar ese nuevo poder para derrotar a adversarios del mismo nivel. A esto se le podr&iacute;a llamar &quot;empoderamiento competitivo&quot;.\r\n\r\nSin embargo, esto es de lo que la Liga parece haberse alejado. Porque este &quot;empoderamiento competitivo&quot; no es la &uacute;nica manera de tratar de lograr el empoderamiento del jugador. Hay otra forma mucho m&aacute;s simple de hacer que las personas se sientan fuertes: simplemente dej&aacute;ndolas pisotear a los dem&aacute;s. Algunos juegos de F2P incluso hicieron esto como un modelo de negocio: ganar un peque&ntilde;o n&uacute;mero de &quot;ballenas&quot; (tambi&eacute;n conocidos como jugadores que gastan una tonelada), y dejar que se diviertan pisoteando (o en algunos casos raros, ayudando) a los usuarios que no juegan. Sin embargo, como esto puede llevar a la frustraci&oacute;n con los jugadores que no pagan, estos juegos necesitan atraer un flujo constante de nuevos jugadores, porque est&aacute;n contentos con el poder de la fantas&iacute;a de los usuarios de pago.\r\n\r\nY aqu&iacute; es donde el cambio de direcci&oacute;n viene a la mente: En el d&iacute;a de hoy no se supone que se gane como equipo, pero para tener a este jugador fuerte uno se entusiasma mucho y &eacute;l se limita a aplastar al resto. El favor que los asesinos ganan del equipo de equilibrio es una prueba m&aacute;s de ello - se adelantan un poco y de repente todo el juego gira en torno a ellos. Seguramente divertido para el jugador asesino, no tanto para el resto de los jugadores, que ahora existen no como un &quot;digno competidor&quot;, sino como un &quot;forraje&quot; para el jugador asesino.\r\n\r\nA un nivel m&aacute;s general, esto da como resultado que los partidos ya no sean competitivos, sino que sean de un solo lado, todo por este nuevo enfoque sobre c&oacute;mo hacer que el &quot;Empoderamiento&quot; del jugador funcione. En lugar de tratar de lograr que todos alcancen el mismo nivel de dicho empoderamiento en un solo partido, ahora los jugadores tienen que turnarse: un juego lo pisotean y el otro lo pisotean. En general, en el transcurso de innumerables juegos, se logra el mismo resultado de &quot;empoderamiento total&quot; (si se pudiera medir cient&iacute;ficamente), pero la forma de hacerlo ha cambiado dr&aacute;sticamente.\r\n\r\nLA &quot;DIVERSI&Oacute;N&quot; EST&Aacute; AHORA SIEMPRE EN EL COSTO DE LOS OTROS JUGADORES, Y NO SE DERIVA DEL ELEMENTO COMPETITIVO.\r\n\r\nY esto es algo que cae dentro de las responsabilidades de un Dise&ntilde;ador L&iacute;der. Trabajadores de dise&ntilde;o individuales o vainas trabajan en campeones singulares, o peque&ntilde;os grupos de campeones, intentan ajustar objetos y hacer que las cosas funcionen en &aacute;reas muy limitadas, pero como el perro grande es el trabajo del Lead Dude, tienen el gran todo a la vista. Y s&iacute;, lo hace, o de lo contrario Riot lo habr&iacute;a despedido hace mucho tiempo por ser realmente incompetente en su trabajo - pero la visi&oacute;n que tiene para el juego es muy diferente de lo que este juego originalmente se supon&iacute;a que era y lo que lo hizo exitoso en el primer lugar.\r\n\r\nIncluso puedo pensar en la causa de esto: la mayor&iacute;a de los dise&ntilde;adores de juegos no han aprendido su oficio en una era de juegos multijugador directo. Quiero decir, si nos fijamos en la historia de Ghostcrawler antes de WoW, que ha trabajado principalmente en los t&iacute;tulos de RTS (que comenz&oacute; con Age of Empires despu&eacute;s de todo). En aquellos tiempos, nadie jugaba estos juegos para un multijugador competitivo - la gente jugaba a la campa&ntilde;a, y el multijugador era para ti y tus amigos para jugar durante las fiestas LAN (hombre buenos viejos tiempos, &iquest;cu&aacute;ndo fue la &uacute;ltima vez que tuve una buena y anticuada fiesta LAN?). Al mismo tiempo, la interacci&oacute;n entre los jugadores en un RTS es diferente de la interacci&oacute;n de los jugadores en un MOBA. Oh y WoW es un MMORPG, un g&eacute;nero que comenz&oacute; como un solo jugador/co-op vs AI.\r\n\r\nEs algo as&iacute; como con CertainlyT - ese tipo es probablemente un dise&ntilde;ador de un solo jugador impresionante, pero en un contexto multijugador sus obras son simplemente atroces hacer frente. Por el mismo problema que he dicho antes: los campeones de ese dise&ntilde;ador son divertidos para la persona que juega, a expensas de todos los que juegan contra &eacute;l. En un juego para un solo jugador, esos principios de empoderar al jugador nunca fueron un problema - despu&eacute;s de todo, las turbas y los jefes de las redadas no pod&iacute;an y no quer&iacute;an hacer mucho al respecto, sobre todo por el hecho de que eso requerir&iacute;a tener una sensibilidad real y no s&oacute;lo ser una pila de p&iacute;xeles de fantas&iacute;a con alg&uacute;n c&oacute;digo bajo el cap&oacute;. Pero, como se podr&iacute;a sospechar, los actores humanos son un poco m&aacute;s complejos que eso.\r\n\r\nEsto es lo que este post se reduce a: la forma en que el Dise&ntilde;o de Plomo se acerca a la meta de Empoderamiento del Jugador es completamente err&oacute;nea, en su mayor&iacute;a debido a las herramientas y m&eacute;todos equivocados que se est&aacute;n utilizando. Y esto tiene un efecto en el atractivo general del juego. (Despu&eacute;s de todo, la negativa de Riot a publicar cualquier n&uacute;mero oficial en los jugadores activos dice m&aacute;s de lo que cualquier n&uacute;mero publicado podr&iacute;a hacer). Esto es una se&ntilde;al de que Ghostcrawler no tiene ni idea de lo que fue este juego originalmente, o lo sabe, pero trata de forzar su visi&oacute;n del dise&ntilde;o del juego en &eacute;l, que sin embargo se basa en paradigmas que son completamente inadecuados para un juego como League.\r\n\r\nNo s&eacute; cu&aacute;l de los dos es peor, pero debe detenerse antes de que se produzca un da&ntilde;o irreparable.\r\n\r\nDeja de ser perezoso. S&eacute; que mantener un dise&ntilde;o de empoderamiento competitivo es m&aacute;s dif&iacute;cil que simplemente tirar los dados y tener al equipo como el pisoteador para la diversi&oacute;n del otro, &iquest;pero sabes qu&eacute;? HACER ESO ES TU TRABAJO. As&iacute; que h&aacute;galo bien en lugar de tratar de obtener un resultado mediocre con el menor esfuerzo posible.\r\n\r\nEsta vez me las arregl&eacute; para envolverlo bien para que el tren de odio de los fanboi no pueda hacerme caer en el olvido como lo hicieron en ocasiones anteriores. Y mis puntos son todos v&aacute;lidos y correctos, y el &aacute;rea de la que estoy hablando es la responsabilidad completa de Lead Design. Me pregunto si obtendr&eacute; una respuesta roja en este...\r\n\r\n\r\n\r\nhttps://vignette.wikia.nocookie.net/leagueoflegends/images/b/b9/Wukong_Lore_2.png/revision/latest?cb=20170429195544\r\n\r\n\r\n\r\n#Esto Respondi&oacute; Ghostcrawler (NA):\r\n\r\nClaro, te dar&eacute; una respuesta roja. Ustedes todav&iacute;a parecen hacer muchas suposiciones sobre c&oacute;mo trabajamos. La organizaci&oacute;n de la Liga es muy grande. Es grande en parte porque somos nuestro propio editor y en parte porque es un gran juego con muchas partes m&oacute;viles. Nuestra estructura organizativa es tener muchos equipos m&aacute;s peque&ntilde;os enfocados en espacios problem&aacute;ticos espec&iacute;ficos. Por ejemplo, el equipo de Live realiza cambios en el equilibrio de parche a parche y, en general, se centra en problemas como la salud del juego, la imparcialidad y la frustraci&oacute;n. Hay un equipo diferente que trabaja para mejorar el matchmaking y otro que construye nuevos modos de juego.\r\n\r\nEn ese ambiente, no es el trabajo de una persona ir por ah&iacute; y decir &quot;Oye, yo tengo este valor personal, as&iacute; que tienes que empezar a implementar el juego de esta manera en particular&quot;. Si dejo el equipo ma&ntilde;ana y otro dise&ntilde;ador toma mi lugar, ser&iacute;a muy dif&iacute;cil detectar cualquier diferencia desde el punto de vista de un jugador. Lo que ves son los valores de los disturbios y de la Liga, no mis valores.\r\n\r\nPersonalmente, &uacute;ltimamente tambi&eacute;n me he centrado mucho en caracter&iacute;sticas como la revisi&oacute;n del nuevo jugador y Clash (y algunas cosas de las que no hemos hablado), as&iacute; que en todo caso estoy un poco fuera de contacto con los cambios recientes en el modo de juego. Pero eso est&aacute; bien, porque tengo pistas muy capaces como Meddler, que se mantienen en contacto con esa parte del juego. Como dije, una gran organizaci&oacute;n.\r\n\r\nDicho todo esto, me parece bien que me culpes de cualquier cosa del juego que te parezca molesta o simplemente no te guste. Pero eso no es porque vaya al foso de los campeones y les diga que dise&ntilde;en campeones para cumplir con una visi&oacute;n en particular. Tal vez me he concentrado en las cosas equivocadas a corto plazo, o tal vez nuestra filosof&iacute;a de alto nivel no est&aacute; siendo puesta en pr&aacute;ctica, o tal vez s&oacute;lo tenemos a los dise&ntilde;adores equivocados trabajando en los problemas equivocados en algunos lugares. Todas esas cosas tambi&eacute;n son mis problemas para resolver.\r\n\r\nPara abordar algunos de los otros puntos:\r\n\r\n* Hemos escuchado muchos comentarios de jugadores que han dicho que hemos cambiado el juego demasiado lejos de llevar el potencial en solitario a la coordinaci&oacute;n de equipo que importa demasiado. Es algo que estamos trabajando para cambiar.\r\n\r\n\r\n* Los cambios en la jungla no se hicieron para cambiar el poder a un subconjunto particular de jungleros. En general se hicieron porque nos preocupaba que los jugadores de la jungla tuvieran demasiado efecto en el resultado del primer partido y quer&iacute;amos reducir un poco la velocidad de la primera banda (eso es simplificar demasiado, pero esa es la idea b&aacute;sica). Cambios sist&eacute;micos como este pueden definitivamente impactar a los campeones individuales, y nosotros los sacudimos con el tiempo. Si el objetivo hubiera sido simplemente pulir a los junglers del tipo duelista, habr&iacute;amos dicho eso y podr&iacute;amos haberlo hecho de una manera mucho m&aacute;s sencilla.\r\n\r\n\r\n* Es una lucha constante para nosotros decidir qu&eacute; cambiar sin cambiar demasiado. Estoy 100% seguro de que los jugadores se aburrir&iacute;an y se alejar&iacute;an del juego si decidi&eacute;ramos dejar de intentar mejorarlo con el tiempo, y queremos crear un juego que dure a&ntilde;os o d&eacute;cadas. Sabemos que cualquier cambio que hagamos a la Liga tiene un costo. Hay un costo si tienes que volver a aprender algo. Hay un costo si no te gusta el cambio que hicimos. Entendemos eso y s&oacute;lo tratamos de hacer cambios que dejen el juego en un mejor estado que antes, pero definitivamente damos pasos hacia atr&aacute;s para avanzar de vez en cuando. Sin embargo, todos nuestros cambios tienen metas, y si las metas no son claras (y creo que fueron para los cambios en la jungla mencionados anteriormente) entonces eso es un fallo de comunicaci&oacute;n de nuestra parte. Al menos entonces usted puede cuestionar si est&aacute; en desacuerdo con las metas, o si est&aacute; de acuerdo con las metas y simplemente no est&aacute; de acuerdo en que la implementaci&oacute;n espec&iacute;fica cumpla con ellas.\r\n\r\n\r\n* En general, me preocupa que hoy en d&iacute;a pongamos muchas cosas diferentes en kits de campeones nuevos y actualizados. Se hace con el noble prop&oacute;sito de asegurarnos de que ustedes se entusiasmen con los nuevos campeones, pero esto significa que muchas de nuestras nuevas ofertas son mucho m&aacute;s complicadas que las de nuestros antiguos campeones. Necesitamos mejorar en cuanto a ser m&aacute;s felices (y asegurarnos de que ustedes est&eacute;n contentos) con algunos campeones con kits relativamente simples con tal vez una o dos habilidades complejas en lugar de las 4 (5 si se cuenta la pasiva) que requieren mucha informaci&oacute;n para jugar. (A menudo me pregunto qu&eacute; tan bien le ir&iacute;a hoy a un Lux o a un Jinx si fueran nuevos campeones.) Por otro lado, no creo que la carrera armamentista de movilidad (o la carrera armamentista de escudos o la carrera armamentista de alcance) sea tan mala como a veces les gusta argumentar a los jugadores. Los campeones muy m&oacute;viles todav&iacute;a pueden tener debilidades agudas. Es m&aacute;s dif&iacute;cil para los campeones que pueden hacer todo muy bien tener debilidades agudas, pero normalmente esto se manifiesta como que sus fortalezas no terminan siendo tan agudas, porque al final del d&iacute;a, incluso un campe&oacute;n muy desequilibrado tiende a tener una tasa de victoria en los 50%s. As&iacute; que realmente creo que de lo que est&aacute;n hablando los jugadores aqu&iacute; es de la frustraci&oacute;n que se necesita para acabar con un campe&oacute;n enemigo, no de que no puedan ganar un partido contra ese campe&oacute;n. Es por eso que algunas de las quejas m&aacute;s fuertes siguen llegando sobre los campeones con un gran potencial de duelo (los Rivens, los Zeds y los Yasuos). Puede que sus victorias no sean tan incre&iacute;bles, pero puede ser frustrante cuando te atrapan solo. Pero no creo que en ese caso la respuesta sea s&oacute;lo para asegurarse de que sus tasas de ganancia sean bajas. Tambi&eacute;n entra en el dilema de c&oacute;mo dar a los jugadores una agencia m&aacute;s individual cuando algunos de los campeones dise&ntilde;ados con mucha agencia individual son algunos de los m&aacute;s frustrantes y de los que m&aacute;s se quejan. :(\r\n\r\n\r\n* &quot;Quiero decir, cuando miras la historia de Ghostcrawler antes de WoW, ha trabajado sobre todo en t&iacute;tulos RTS (empez&oacute; con Age of Empires despu&eacute;s de todo). En aquellos tiempos, nadie jugaba a estos juegos para un multijugador competitivo: la gente jugaba a la campa&ntilde;a, y el multijugador era para que t&uacute; y tus amigos os metierais con &eacute;l durante las fiestas de LAN (los buenos viejos tiempos, &iquest;cu&aacute;ndo fue la &uacute;ltima vez que tuve una fiesta de LAN a la antigua?&quot;). FWIW, hemos probado Age of Empires casi exclusivamente en juegos multijugador LAN 4v4. Lo rid&iacute;culo del desarrollo de juegos en aquel entonces era que era pr&aacute;cticamente todo lo que ten&iacute;amos: no ten&iacute;amos forma de recopilar datos reales de los jugadores, as&iacute; que tuvimos que equilibrarlo todo nosotros mismos (con el tipo de resultados que cabr&iacute;a esperar). Hoy en d&iacute;a podemos recopilar toneladas y toneladas de datos sobre la experiencia real del jugador. Dise&ntilde;&eacute; la mayor&iacute;a de las campa&ntilde;as para los juegos de AoE, pero no obtuvieron una tonelada de pruebas de juego. Casi todas nuestras pruebas de juego eran multijugador. Es incre&iacute;ble que los juegos terminaran tan bien como ellos.\r\n\r\n\r\n* Mira, la gente que construye aviones raramente los pilota, pero todav&iacute;a tienen una idea bastante buena de c&oacute;mo se pilota un avi&oacute;n. Eso es todo lo que estaba diciendo. Esa cita (sacada de contexto como a veces lo son estas cosas) fue en respuesta a la persistente pero un tanto cansada teor&iacute;a de que los mejores jugadores deber&iacute;an ser los que dise&ntilde;aran los juegos competitivos. Hay algunos jugadores que son excelentes dise&ntilde;adores (y contratamos a algunos de ellos), y hay otros jugadores que ser&iacute;an terribles en el trabajo. Si no juegas el juego que dise&ntilde;as, definitivamente ser&aacute; mucho, mucho m&aacute;s dif&iacute;cil para ti ser eficaz, pero s&iacute;, en un sentido te&oacute;rico, es posible.\r\n\r\n\r\n* &quot;El problema con Ghostcrawler es que cree que sabe m&aacute;s de lo que hace.&quot; Nah. Siempre quieres estar en una situaci&oacute;n en la que eres la persona m&aacute;s tonta de la habitaci&oacute;n, y afortunadamente eso es bastante f&aacute;cil para m&iacute; en Riot. El problema con Ghostcrawler es que tiene menos tiempo para hablar con los jugadores de lo que sol&iacute;a, y se esfuerza por encontrar el formato correcto en estos d&iacute;as.\r\n\r\n\r\nhttps://i.imgur.com/lfHgD6c.png\r\n\r\nEste es el [blog de Ghostcrawler](https://askghostcrawler.tumblr.com/) por cierto, si quieren pasar o preguntarle algo (en ingles claro)\r\nBueno, eso fue todo, &iquest;ustedes que opinan?\r\nD&eacute;jenlo en comentarios! Por mi parte nada mas.\r\n\r\nhttps://i.gyazo.com/dc663903c09169c6b4244475bdbf505e.png","replies":[{"poster":"bombastico","date":"2018-05-24T17:48:48.333+0000","up_votes":13,"down_votes":5,"body":"Creo que a Speedweb se le subio la nostalgia a la cabeza, en este juego siempre se ha tratado de pisotear y ser pisoteado. Los pisotones lo ha dado antiguamente jax con su dodge, los asesinos, los adc, los tanques e incluso los supports (janna y lulu) todo dependiendo del parche en el que se encuentren. \n\nY eso de que perder quita \"diversión\" es netamente porque casi todos queremos ser el protagonista de nuestras partidas, ser los mejores y cuando no se ocupa algo roto y nos cuesta,  nos frustramos.  (esto es tipico de la generacion actual que se frustra facilmente)","replies":[{"poster":"Tsume Asterisk","date":"2018-05-24T19:45:15.527+0000","up_votes":7,"down_votes":1,"body":"Y dale con el puto argumento de los milenial, TÚ TAMBIÉN LO ERES (en serio, borren esa palabra de mierda de sus diccionarios, que hasta nuestros abuelos son milenials).\n\nEs cierto que cuando el LoL fue creado había un sin fin de problemas, los cuales se arreglaron con el tiempo y por algo las que son consideradas las mejores season son la 3 y la 4. Donde el juego era lo suficientemente dinámico, divertido para todos y la posibilidad de remontar existía (también me gustaría meter la s5, pero parece que a pocos les gustaban esas partidas de 50 minutos)","replies":[{"poster":"Tortuguita","date":"2018-05-24T23:49:24.920+0000","up_votes":1,"down_votes":0,"body":"Hasta la S4 Finales , la S5 con los inmatables tanks fue la peor y hasta ahora en la actualidad siguen igual de infumables en top. Literalmente por top no existe diversión alguna.","replies":[{"poster":"Tsume Asterisk","date":"2018-05-25T04:23:35.976+0000","up_votes":1,"down_votes":0,"body":"Independientemente del meta de tanques, en ese año podía ocurrir lo que fuera durante cada partida, he ahí el porque la defiendo. Un error no te costaba la partida completa, habían diversidad en los enfrentamientos así fuera en solitario o en equipo y fue la mejor season para ver remontadas (como gusto personal, me parece mucho más emocionante una partida de 40 minutos con remontada que una victoria aplastante en 15 minutos. Obviamente con enfrentamientos en todos lados, si quisiera farmear por 40 minutos me voy al Harvest Moon, Stardew Valley o Farming Simulator)","replies":[{"poster":"Tortuguita","date":"2018-05-25T17:50:56.854+0000","up_votes":1,"down_votes":0,"body":"¿? Eran tfs de casi 5 mins, era totalmente absurdo el ver como los tanks se reventaban las cabezas unos a otros por mas de 2 min hasta que llegara el resto y aun así seguían en pie... Era extremadamente aburrido xD (Ni hablar que en top lane era solo escalar a base de farmeo o simplemente tirarse con los mínimos de items de defensa y aburrir a medio mundo mientras te pegas con 50 ad contra el otro top o jg)\n\nAhora es exactamente igual la top lane de aburrida solamente que ahora la botlane define la partida al min 20 y gg.","replies":[]}]},{"poster":"Zoliza","date":"2018-05-24T23:57:25.078+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Tortuguita,realm=LAS,application-id=v7qsfXsE,discussion-id=xxr1sTAa,comment-id=000100000002,timestamp=2018-05-24T23:49:24.920+0000)\n>\n> Hasta la S4 Finales , la S5 con los inmatables tanks fue la peor y hasta ahora en la actualidad siguen igual de infumables en top. Literalmente por top no existe diversión alguna.\n\nMuchos duelos de habilidad hay en top entre tanques jajaj","replies":[{"poster":"Tortuguita","date":"2018-05-25T17:47:50.571+0000","up_votes":1,"down_votes":0,"body":"Que reventarse la cabeza 500 veces mientras vemos quien regenera la vida mas rápido es una cosa para tirarse una trilogía para la top lane...","replies":[]}]}]}]},{"poster":"LGBT Valentina","date":"2018-05-24T20:22:14.072+0000","up_votes":2,"down_votes":8,"body":"**Creo que a Speedweb se le subio la nostalgia a la cabeza, en este juego siempre se ha tratado de pisotear y ser pisoteado. El pisoton lo ha dado antiguamente jax con su dodge, los asesinos, los adc, los tanques e incluso los supports (janna y lulu).**\n\n¿Espera, estas justificando lo que llamas \"pisoton\" con casos particulares?\n\nMe cago, entonces los nazis son todos unos angeles y solo hay 3 hdp en la historia JAJAJAJAJAJAJAJAJA\n\n\nQue me presentes la ya idea del juego de manera objetiva es una cagada tremenda. Ahora, vendieron siempre que la idea era que todos tuvieran el mismo nivel (mas haya de que les chupara un terrible huevo como funcionan las ranked y los problemas en 2do plano que tienen). Ahora si lo único que hacen es hacer limitaciones y hacer que los jugadores jueguen metas forzados para sacar una ventaja de la cual un descuido/error de otro sector no tiene impacto en esta, estamos hablando de otra historia. Estas vendiendo algo que en la practica termina siendo otra cosa\n\n\nVos estas hablando del resultado, no de como llegas a el que es el problema, si te cagas en el nexo causal es normal que pasen estas cosas\nCual es el objetivo del juego? Eso depende de cada uno, ahora quien le de la cabeza para recordar como vendieron el juego y como \"\"cambiaron\"\" la idea es otro tema.\n\nCompletamente difiero en que sea pisotear al otro, eso es el resultado que lo forzaron de manera abrupta \n\nY el tema principal que molesta a todos es: No hables de mas o ni abras la boca, si en la practica no podes hacerlo u acercarte a ello\n\n\nDe todas formas, la critica de por si es mala y la respuesta de la critica es mala también. Discutir sobre que pedaso de soruyo huele mejor es bastante al pedo, salvo que a alguien le guste ingerir caca u olerla ","replies":[{"poster":"bombastico","date":"2018-05-24T21:38:25.441+0000","up_votes":4,"down_votes":3,"body":"Con lo de los nazis me mataste xD, lo de pisoton era referido a como el post original hacia referencia a la \"stompeada\" (creo que lo tradujeron literal) \n\nSolo dije que siempre en el juego algo ha estado roto, antes era incluso ridiculmente roto. Por ejemplo ahora nos reimos de un yi. ¿Recuerdas cuando tenia la lampara con ese lobito de mascota? Ahi no era tan gracioso. \n\nA lo que iba es que el juego nunca han podido balancearlo bien, juego desde el 2011 y no recuerdo esa edad dorada que todos hablan.","replies":[{"poster":"Zoliza","date":"2018-05-24T22:20:04.756+0000","up_votes":4,"down_votes":1,"body":"El lol nunca va a estar balanceado porque es un juego creado bajo la primicia de ser perfectamente imbalanceado, por eso existen metas y cambios que hacen que el meta cambie y el porque hay campeones o estrategias más fuertes que otras. \n\nAún así campeones que talvez no están rotos se vuelven a jugar porque son buenos contra ciertos campeones del metagame o hay campeones que funcionan mejor en equipo con cierta coordinación o siendo acompañados con otros campeones. \n\nYo creo que lo peor que le puede pasar a cualquier juego estratégico y competitivo es el RNG pero no piensa parar riot con esa politica. Cada vez quieren que el juego sea menos complejo para alentar a nuevos jugadores a jugar pero se olvidan de la satisfacción que le daba a los jugadores el esforzarse por aprender cosas que marcaban la diferencia en el juego vs un jugador que no lo hacía, empezando por contadores, luego dragones rng, luego plantas, luego que todo campamento de los mismos cs eliminando posibilidad de saber la ruta del rival, después los escarabajos rng.","replies":[{"poster":"bertox","date":"2018-05-24T23:14:03.978+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Kokoro Chacarero","date":"2018-05-25T02:56:24.249+0000","up_votes":1,"down_votes":0,"body":"Si vas a oficiar de policía del lenguaje, no salgas de la jefatura con el uniforme alrevés.\n\n* Los enunciados comienzan con mayúscula y terminan con un punto. \n* Las palabras agudas que terminan en vocal, \"n\" o \"s\" llevan tilde en la vocal acentuada. \n* Luego de una coma siempre viene un espacio.\n\nNo se puede ser tan culo roto y cara dura de sacar un tema tan irrelevante al thread como el uso de extranjerismos en internet.\n\nEdit: comentario escrito en un teclado al que no le funcionan la \"p\", ni el tilde.","replies":[{"poster":"Kokoro Chacarero","date":"2018-05-26T00:52:44.454+0000","up_votes":1,"down_votes":0,"body":"¿Tanta verguenza le dió que borró el comentario?\nNene.","replies":[]}]},{"poster":"Zoliza","date":"2018-05-24T23:56:06.953+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=bertox,realm=LAS,application-id=v7qsfXsE,discussion-id=xxr1sTAa,comment-id=00010001000000010001,timestamp=2018-05-24T23:14:03.978+0000)\n>\n> imbalanceado no existe en http://dle.rae.es/\n> imbalance es desbalanceado en ingles\n> &quot;mutear&quot; que tampoco existe pero se usa, me suena mejor que imbalanceado que me suena mal.\n> podes usar desequilibrio, desbalance, desigualdad, desproporción, inestabilidad,etc.{{sticker:katarina-love}}\n\nSe conoce como imbalanceado desde que juego lol hace 7 season, que no exista dentro del lenguaje formal es otra cosa, no estoy acá para hablar dentro del marco formal dictado por la rae en español, que no te guste es distinto.\n\nmuted = muteado.\nImbalanced= imbalanceado. \n\nEs \"burdo\"","replies":[{"poster":"bertox","date":"2018-05-25T00:07:12.388+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Zoliza","date":"2018-05-25T00:25:07.428+0000","up_votes":1,"down_votes":0,"body":"No estoy enojado, me encanta ubicar a las personas soberbias. \n\n\"niño\" deje de ser hace unos 15 años.\n\nBesitos besitos, chau chau.","replies":[{"poster":"bertox","date":"2018-05-25T00:44:44.243+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Zoliza","date":"2018-05-25T00:56:54.383+0000","up_votes":1,"down_votes":0,"body":"????? JAJAJA Dios mío.","replies":[]}]}]}]}]}]}]},{"poster":"LGBT Valentina","date":"2018-05-24T22:12:56.886+0000","up_votes":3,"down_votes":1,"body":"**A lo que iba es que el juego nunca han podido balancearlo bien, juego desde el 2011 y no recuerdo esa edad dorada que todos hablan.\n**\n\nLa s3 y s4, era amada por que era una lucha de quien tiene el champ mas op. Como todo estaba OP, era una pelea constante y divertida (ademas de que existia el mid game y late game, no como ahora)","replies":[]}]}]},{"poster":"Dog Bulling","date":"2018-05-25T00:21:45.172+0000","up_votes":3,"down_votes":1,"body":"En realidad los millenials son simplemente los nacidos despues del año 2000 (No vale haber nacido EN el año 2000, debe ser despues). Son unos simples nativos digitales, a diferencia de muchos de nosotros que tuvieron que adaptarse a la irrupción de la tecnología.\n\nAparte de ello, no se porque la gente le atribuye tantas cosas negativas a esos jóvenes. Quiza sea una especie de resistencia al cambio gerenacional, nostalgia o algo por el estilo; les molestará que las relaciones puedan ser más por celulares y que usen términos de otros paises sacados de videos de youtube.","replies":[{"poster":"bombastico","date":"2018-05-25T03:22:19.270+0000","up_votes":1,"down_votes":0,"body":"Disculpa por haber usado el termino milenial. \nY solo por aportar, los milenials son los que nacieron entre 1980 y el 2000 (aunque varia segun el sociologo) son los que vivieron la \"transicion\" tecnologica, por ejemplo desde los vhs hasta lo digital (a diferencia de los nativos digitales) y somos los que disfrutamos del esfuerzo de nuestros padres, maduramos en edades mas tardías y nos han engañado con que \"somos los mejores\" \"tu esfuerzo tendra recompensa\" por eso se nos cataloga como que tenemos poca tolerancia a la frustracion, pero nos adaptamos mejor a ciertos cambios.","replies":[]}]},{"poster":"Bot Ryze","date":"2018-05-25T02:01:36.563+0000","up_votes":1,"down_votes":1,"body":"***","replies":[{"poster":"bombastico","date":"2018-05-25T03:09:52.317+0000","up_votes":1,"down_votes":0,"body":"Ya ok ok, ahi borre la palabra milenial.\n Siento como si hubiese insultado a sus madres.","replies":[]}]}]},{"poster":"Puynsi","date":"2018-05-24T18:25:09.341+0000","up_votes":10,"down_votes":3,"body":"Recordatorio que ghostcrawler fue despedido de Blizzard por haber arruinado World of Warcraft post-cata/burning crusade y no hay que tomar en cuenta absolutamente nada de lo que diga como valido o como una respuesta honesta.\nAl tipo riot lo tomo porque literalmente nadie lo queria.","replies":[{"poster":"bombastico","date":"2018-05-24T18:30:07.121+0000","up_votes":3,"down_votes":6,"body":"¿Y ese argumento ad hominem? No sé que tiene que ver el wow con el lol, ni siquiera tienen el mismo modo de juego.","replies":[{"poster":"Puynsi","date":"2018-05-24T18:35:36.957+0000","up_votes":8,"down_votes":1,"body":"Ghostcrawler tambien era diseñador en WoW y lo hecharon porque cada vez que metia algo en el juego eran meses o años de re-balanceo en donde la comunidad no podia divertirse porque la tradicion era siempre ghostcrawler y su cancer de parche.\nEn ensemble tambien lo hecharon por esas mismas ideas y su total dureza a cambiarlas o adapatarlas.\nEl tipo es poco profesional y hace lo que se le da la gana, igual que lythe y certainly en sus repsectivos departamentos.","replies":[{"poster":"Sirek","date":"2018-05-24T18:50:28.546+0000","up_votes":4,"down_votes":1,"body":"> inprofesional \n\nNo sera \"Poco Profesional\", Inprofesional no existe xD... \n\nBuen aporte, no sabia que Ghostcrawler tenia ese CV.","replies":[]}]},{"poster":"Jeremías 17 5","date":"2018-05-24T18:44:42.296+0000","up_votes":5,"down_votes":0,"body":"Que GhostCrawler no es nuevo arruinando juego, tiene un amplio CV de este tipo de cosas en WoW.","replies":[{"poster":"Runth","date":"2018-05-25T04:52:02.554+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Æsir,realm=LAS,application-id=v7qsfXsE,discussion-id=xxr1sTAa,comment-id=000200000001,timestamp=2018-05-24T18:44:42.296+0000)\n>\n> Que GhostCrawler no es nuevo arruinando juego, tiene un amplio CV de este tipo de cosas en WoW.\n\nejem.. AoE 3 ejem..","replies":[{"poster":"Jeremías 17 5","date":"2018-05-25T21:26:37.630+0000","up_votes":1,"down_votes":0,"body":"Lo de AoE 3 ni idea. Yo conozco lo que hacia en el WoW nomas xD","replies":[]}]}]}]},{"poster":"Hayato","date":"2018-05-31T06:29:25.759+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Puynsi,realm=LAS,application-id=v7qsfXsE,discussion-id=xxr1sTAa,comment-id=0002,timestamp=2018-05-24T18:25:09.341+0000)\n>\n> Recordatorio que ghostcrawler fue despedido de Blizzard por haber arruinado World of Warcraft post-cata/burning crusade y no hay que tomar en cuenta absolutamente nada de lo que diga como valido o como una respuesta honesta.\n> Al tipo riot lo tomo porque literalmente nadie lo queria.\n\nNo fue despedido, se fue él.","replies":[]},{"poster":"Runth","date":"2018-05-25T04:50:40.435+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Puynsi,realm=LAS,application-id=v7qsfXsE,discussion-id=xxr1sTAa,comment-id=0002,timestamp=2018-05-24T18:25:09.341+0000)\n>\n> Recordatorio que ghostcrawler fue despedido de Blizzard por haber arruinado World of Warcraft post-cata/burning crusade y no hay que tomar en cuenta absolutamente nada de lo que diga como valido o como una respuesta honesta.\n> Al tipo riot lo tomo porque literalmente nadie lo queria.\n\nlos despidos dejan en marca en su curriculum, tomalo en cuenta en ello","replies":[]}]},{"poster":"Sir Crucifix ","date":"2018-05-24T20:09:48.013+0000","up_votes":8,"down_votes":2,"body":"Yo apoyo toda critica e insulto a estos porque me arruinaron a fiora con ese rework barato que le hicieron","replies":[{"poster":"Salvor","date":"2018-05-24T22:00:32.674+0000","up_votes":5,"down_votes":0,"body":"A mi me arruinaron al viejo Galio.\nLo siento bro.","replies":[{"poster":"AlucardNoir","date":"2018-05-25T05:58:16.008+0000","up_votes":1,"down_votes":0,"body":"A mi me arruinaron a morde :c","replies":[]}]}]},{"poster":"Nuke","date":"2018-05-24T23:41:32.686+0000","up_votes":5,"down_votes":0,"body":"https://i.gyazo.com/ba2d45693efba361b750e1d688d9a601.png\n\nOh espera me equivoqué:\n\nhttps://uploads.disquscdn.com/images/b16e5c089424f0e505a11bc83afb422ebe33dd48ba850bdf1a110299dc8970d8.jpg\n\n\n######PD: No leí una mierd* pero parece útil","replies":[]},{"poster":"Cachets","date":"2018-05-24T17:34:52.213+0000","up_votes":2,"down_votes":14,"body":"ya sabemos que sabes usar separadores","replies":[{"poster":"Salvor","date":"2018-05-24T17:51:51.894+0000","up_votes":9,"down_votes":1,"body":"Hola, tu primer comentario en el foro es ese? me siento halagado, es mas trate de usar \"poco\" los separadores, entre tanto texto hay que darle aire me parece. Sirven para ordenar.","replies":[{"poster":"Cachets","date":"2018-05-24T17:54:23.818+0000","up_votes":2,"down_votes":10,"body":"hola si me molestan los separadores q usas los veo inesesarios","replies":[{"poster":"Salvor","date":"2018-05-24T17:57:17.433+0000","up_votes":8,"down_votes":1,"body":"A mi me molestan las smurf del foro, pero bueno, no se puede hacer nada al respecto supongo.\nY repito, no me parece que haya abusado de separadores en este post.\nIgual gracias por tu critica, intentare usar los justos y necesarios.\n\nSaludos!","replies":[{"poster":"EdxxEdxx","date":"2018-05-24T19:32:47.047+0000","up_votes":2,"down_votes":1,"body":"Los separadores son buenos, pero quizá deberías usar estos (los amarillos de ahora) para el inicio y final, y usar unos mucho más pequeños y limpios para el contenido. Así le darías mejor estructura y aire al post sin generar una molestia visual de sobrecarga. Creo... xD","replies":[{"poster":"exrex","date":"2018-05-24T19:50:00.773+0000","up_votes":6,"down_votes":1,"body":"Que casualidad, querer usar el amarillo como color predominante para resaltar lo importante, de esta manera van acostumbrando a los foreros a asociar de manera inconsciente que los voluntarios marcan el inicio y final de una conversación. \n\nNo voy a dejar que salvador sea cómplice involuntario de maquinaciones tan maquiavelicas que harian indignar hasta a el mismo Napoleon. \n\nSlavador tiene que usar el marron, el color que caracteriza a cada individuo que hizo grande este foro, los que estuvieron al inicio, los que estan en estos momentos dificiles y los que van a estar hasta el final de sus dias. El color del pueblo.","replies":[{"poster":"Salvor","date":"2018-05-24T22:03:38.907+0000","up_votes":3,"down_votes":0,"body":"Slavador suena a slave, suena a que soy un esclavista.\n\nYo no quiero ningun color, solo quiero un icono de Rammus cono el de la beta.....","replies":[]},{"poster":"SmokeyShauna","date":"2018-05-25T02:23:40.204+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=exrex,realm=LAS,application-id=v7qsfXsE,discussion-id=xxr1sTAa,comment-id=000000000000000000000001,timestamp=2018-05-24T19:50:00.773+0000)\n>\n> Que casualidad, querer usar el amarillo como color predominante para resaltar lo importante, de esta manera van acostumbrando a los foreros a asociar de manera inconsciente que los voluntarios marcan el inicio y final de una conversación. \n> \n> No voy a dejar que salvador sea cómplice involuntario de maquinaciones tan maquiavelicas que harian indignar hasta a el mismo Napoleon. \n> \n> Slavador tiene que usar el marron, el color que caracteriza a cada individuo que hizo grande este foro, los que estuvieron al inicio, los que estan en estos momentos dificiles y los que van a estar hasta el final de sus dias. El color del pueblo.\n\n\n\ni d o l o","replies":[]}]}]}]}]}]}]},{"poster":"Lord Parca","date":"2018-05-24T22:25:51.186+0000","up_votes":3,"down_votes":0,"body":"Estoy a favor de la critica de speedweb, el q juega antes de la S4 sabe q era en verdad el LOL, cuando quisieron ampliar el juego de a poco se les fue de las manos entre balanceo de campeones lo que provoco cambios al mapa y objetos, lo que hizo q por temporada ciertos tipos de campeones estén desbalanceados lo que apresuro los parches. \nEl cambio que hace los ultimos 2 años es el cambio del juego en si, el drag, el baron, eraldo, la jungla, nuevas armas, nuevas runas, desbalancearon completamente el juego y aumentaron el snowball.","replies":[]},{"poster":"Achungo","date":"2018-05-24T21:08:34.184+0000","up_votes":4,"down_votes":1,"body":"Wow, gran trabajo de traducción y formato =O","replies":[]},{"poster":"Néd Stark","date":"2018-05-24T23:43:00.120+0000","up_votes":1,"down_votes":6,"body":"¿Google traductor?","replies":[{"poster":"Salvor","date":"2018-05-24T23:54:51.745+0000","up_votes":3,"down_votes":0,"body":"No, otro traductor.","replies":[]}]}]}