{"poster":"Salvor","date":"2016-11-13T17:42:14.436+0000","title":"DRAFT vs BLIND: Algunos aspectos no considerados","subforum":"Charlas Generales","up_votes":2,"down_votes":1,"body":"Como dice el titulo es es un post donde voy a tratar de hacer un an&aacute;lisis sobre aspectos, que la mayor&iacute;a de la gente no considera.\n\n* **Quitar reclutamiento empeoro la experiencia en selecci&oacute;n oculta**\nlas colas no estas aisladas una de otra, son parte de un mismo juego, al sacar reclutamiento mucha gente que esta acostumbrada a jugar sus lineas, se ven obligados a jugar en otras que no quieren, y utilizan el instalock o el TROLEO para forzar que saquen la partida.\nTodo esto acentuado por que el sistema de reportes no contempla este tipo de comportamientos.\n\n* **Eligieron el peor momento (aunque entiendo que sea el &uacute;nico)**\nSacaron reclutamiento junto con el rework de asesinos por lo que en todas las partidas de oculta nos encontramos con los mismos campeones zed talon lb kata rengar, muchas de estas veces formando composiciones absurdas de 4 asesinos, teams sin ap o sin tanque, etc.\nTodo esto en detrimento de la experiencia de juego en blind.\n\n* **La ~~vieja~~ nueva cola ~~DinamicQ~~ &quot;Flexible&quot; sigue otorgando facilidades a los eloboosters**\nComo sabr&aacute;n algunos (muchos ignoran esto) el eloboosteo arruina la experiencia de rankeo de miles de personas (no exagero), un solo boosteo arruina entre 10 y 15 partidas que son ganadas de manera ilegitima, y la mayor parte de las veces la gente no lo detecta, reportan a la kata que perdi&oacute; linea 0/14 sin saber que esa anivia 24/2/10 era un diamante y que el resultado de partida estaba sellado desde la selecci&oacute;n de campeones.\nCon esta cola de ranked, los eloboosters pueden seguir subiendo varias cuentas a la vez.\n\n* **La Ranked Flex otorga un elo impreciso y de poco valor** {{champion:133}} \nUna cola de clasificatorias con menor valor de Ranked y mayor que una normal, Los resultados dependen mas de la suerte que de la habilidad, ya que el valor de las mismas es a consideraci&oacute;n del usuario, en una partida va a haber gente que se la tome como normal para practicar campeones y otros que vayan tras la gloria, haci&eacute;ndola una cola posiblemente peor que la Ranked dinamiQ de la season pasada. &iquest;PAK&Eacute;!?\n\n* **&iquest;El tiempo de cola de Reclutamiento es mas largo porque lo juega menos gente?**\nERROR! El tiempo de cola de reclutamiento es mas largo porque no solo tiene que emparejar mmr sino que tambi&eacute;n posiciones (mid, top, etc),\ncomo main sup el tiempo de cola de reclutamiento siempre fue mas r&aacute;pido que oculta para mi ( entre 1 y 10 segundos ) por lo que el argumento de que eran muchos menos los de reclutamiento se cae a pedazos, la proporci&oacute;n que vi en unos gr&aacute;ficos hablaban de 60% blind a 40% draft (Riot Condor puso un dato de _&quot;la de Selecci&oacute;n Oculta es 6.7 veces m&aacute;s popular que la Normal de Reclutamiento&quot;) (sin decir que si el problema del tiempo de cola de Draft era la gente se habria solucionado quitando Blind)\n\n\nSi tienen mas opiniones que crean que no fueron muy consideradas espero las compartan en los comentarios, Salu2.","replies":[{"poster":"rokushoger","date":"2016-11-13T18:43:35.389+0000","up_votes":3,"down_votes":2,"body":"Antes de darte mi opinión, tengo que acerte una aclaración sobre esto:\n\n> La Ranked Flex otorga un elo impreciso y de poco valor \n\nEn este punto tu comentas que estas colas tienen \"menor valor\" de ranked, cuando nunca se planteó así. Si bien tienen un MMR distinto al solo/duo, no es necesariamente menor o mayor, solo distinto. El que no se la tome en serio y te trolee lo podes reportar como en cualquier otro modo de juego.\n\nHabiendo aclarado, tengo que decir que la decisión de Riot me parece que tendría que haber sido al revés. Por más que una mayoría juegue blind pick y no draft, el draft es la evolución lógica del juego. Si la naturaleza hubiese elegido la mayoría sobre las minorías, no hubiesen existido los mamíferos y por ende nosotros XD.\nSiento que el blind pick es un paso atrás en lo que se venía logrando hasta ahora con las colas, y se podría haber probado al revés. Pero, no obstante, si así hubiese sido habría muchísima más gente reclamando como nosotros ahora.\n\nLo idea sería sacar una cola normal que te permita elegir rol al inicio o al azar, pero que sea sin bans (para no restringir el acceso a los de nivel bajo), y que te permita elegir campeón de entrada, onda blind pick, pero viendo lo que elige el de enfrente, y con selección de lugar para el que guste.","replies":[{"poster":"Fiky","date":"2016-11-13T19:52:36.896+0000","up_votes":1,"down_votes":0,"body":"tiras una buena idea pero te dan negativo, esta gente -.-\n\npara aportar un poco más, sería bueno elegir 2 roles como hasta ahora y bloquear uno, una vez dentro de la partida todos eligen al mismo tiempo por 35 segundos apox. con cada rol designado, ahí te muestran los campeones del equipo enemigo y te dan otros 15 o 20 para acomodar runas y maestrías... como dijiste sin bans para hacerlo más ágil y no dejar en banda a los lvl bajo","replies":[{"poster":"rokushoger","date":"2016-11-13T20:02:00.887+0000","up_votes":2,"down_votes":0,"body":"Da igual los negativos. El que deja un negativo sin explicación es porque no tiene suficientes argumentos para contradecir y es sólo un hater, a ese tipo de gente 0 bola.\nMe gusta tu idea!","replies":[]}]}]},{"poster":"Onslaugth","date":"2016-11-13T18:02:38.409+0000","up_votes":2,"down_votes":0,"body":"Sobre las ranked flexibles vi en facebook un tipo que jugo sus 10 primeras ,cuenta unranked sin haber jugado nunca ninguna clasificatoria .Este tipo juego las 10 ,gano todas y quedo en bronce V  XD\n Eso de que es mas suerte que habilidad es cierto ,muy cierto jajaja","replies":[]},{"poster":"Tomasnnz","date":"2016-11-13T17:45:46.326+0000","up_votes":2,"down_votes":0,"body":"Denle una porogalleta a este señor","replies":[{"poster":"Salvor","date":"2016-11-13T17:49:38.867+0000","up_votes":1,"down_votes":0,"body":"AWW sos un tierno +1 {{summoner:31}}","replies":[]}]}]}