{"poster":"Salvor","date":"2017-01-12T01:49:04.246+0000","title":"Mains Hecarim! yo los invoco!","subforum":"Guias y consejos","up_votes":1,"down_votes":0,"body":"Necesito que gente que se considere main o al menos buena con {{champion:120}} me deje consejos, builds y dem&aacute;s tips, reci&eacute;n alcance la M5 y tengo intenciones de convertirlo en mi main (cosa que va a ser dif&iacute;cil ya que tengo 350k de {{champion:33}} )\r\nPor el momento solo lo juego con {{item:3009}} {{item:1401}} {{item:3078}} {{item:3742}} {{item:3065}} {{item:3026}} \r\n\r\n\r\nEn retribuci&oacute;n a mi pedido, har&eacute; una gu&iacute;a de rammus con as (que es lo que maineo)\r\nhttp://img00.deviantart.net/a3da/i/2014/191/0/c/cutey_rammus_by_rintheyordle-d7q2dte.png","replies":[{"poster":"Kyousuke","date":"2017-01-12T02:30:28.537+0000","up_votes":2,"down_votes":0,"body":"es que esa es la mejor y mas optima XD varia también dependiendo la composición pero de primer item {{item:3078}} después {{item:1401}} las botas son dependiendo el equipo, esas para early van bien pero si tienen mucho cc cambia a mercurio sin dudarlo o tabi si tienen mucho ad, también podes ponerte {{item:3512}} si en lugar de {{item:3026}} o sino{{item:3075}}  tampoco tengas miedo de comprar {{item:3143}}  si tienen mucho ad as, con heca lo mejor es buildarte situacional siempre, pero siendo cores gigante cenizo y trinidad SIEMPRE y con la maestría de coraje que esta op\n{{summoner:11}} {{summoner:6}}  y con la maestría de cdr de hechizos ","replies":[{"poster":"Salvor","date":"2017-01-12T03:10:57.103+0000","up_votes":1,"down_votes":0,"body":"Gracias por comentar, actualmente lo estoy usando con {{summoner:4}} ya me da mas resultado que el {{summoner:6}} a pesar de lo que dicen las guias y demas.","replies":[{"poster":"Kyousuke","date":"2017-01-12T03:14:37.450+0000","up_votes":2,"down_votes":0,"body":"recorda que el fantasmal aumenta su daño y podes llegar mas rápido a una linea o entrar por detrás y arrojarlo mas lejos con la carga ademas de que tiene menos cd \nimagina esta situación, estas gankeando top pero hay un ward en el bush y al no tener botas o tenerlas a nivel 1 le das MUCHISIMO tiempo al rival para volver y con un flash no lo agarras o tiras lejos, en cambio con fantasmal lo activas junto con la E le llegas de sorpresa por que aunque tenga ward no le da tiempo a irse por tu velocidad y lo empujas prácticamente al lado de tu compañero y de ahí lo matas con el red y la velocidad de movimiento extra que tenes. desde que buffearon el fantasmal es el principal ss para heca y olaf","replies":[]},{"poster":"PelaP","date":"2017-01-12T09:54:50.290+0000","up_votes":1,"down_votes":0,"body":"bro\nyo lo manejo con gilfos de ap por nivel\nquintacsencias de vel de mov las tres\nlas marcas de penetracion magica y pen de armadura            un par de marcas las tengo de daño\nsello de vel de ataque\n\ntrata de usar la e para los gank, primero espera que flashenn los enemigos o usen sus poderes, despues de usar la e y que ellos gastaron todo le tiras la r en la cara. \n\n  fantasmal esta bien, exelente, yo ultimamente lo estoy jugando en mid y top, siempre con smite y fantasmal. el smite hago el rojo con cristal rojo casi siempre{{item:1412}}  nunca falla. Recorda que ese item le reduce el daño a los enemigos y les reduce la vel.  Y encima te da  daño verdadero.\n\nel mid y top con smite con heca sirve mucho, para robar jg, hacer baron o dragon o heraldo con el jg mucho mas rapido robar la jg enemiga y para el gan y smite es crucial\n\nrecorda, la r al final, primero placaje con la e y luego la r, LUEGO de que el enemigo haya agotado todos sus recursos.\n\npara mi con hecarim es muy importante llegar a late con 40% de red de enfriamiento, en late se decide todo y sos uan maquina. focus adc o mid y gg. y tu ulti con la redcucucoin de enf la tenes a cada rato. Faker, en probuilds.com uso a heca con las gilfos de red de enfriamiento rogresivas, reicne a nivel 30 esas runas te dan 10% de red de enf. Estan buenas porque evitas comrpar items de red de enf y te armas mas tanke o daño . lo uqe necesite tu team\n\n**el ap es fundamental**, un poco. cuando nerfearon la trinindad  que le sacaron ap se noto y mucho. por eso el ap en runas va como piña. recorda que la W   TE CURA. TE DA MAS SUSTAIN EN LAS TF DE MASAS, REGENERAS A LO LOCO, Y LE SUMA DAÑO A LA R  . \n\n\ntodo esto sirve, pero vos tenes que lograr darte cuenta la composicion de tu team, que necesita, si mas daño, que explotes al adc contrario en late o que protegas a tu mid o adc, tanke luchador el mejor. lo manejo desde la s2. que jugaba en LAN, TODOS hablando ingles y de repente te encontrabas con un latino, era una alegria tremenda. Los yankis ponian english please, jaja. \n\n\nque armo yo primero?\n\n{{item:1412}}  {{item:3671}} te fijas si hay mucho stun mercurio si no las ninjas. o las alitas o las que mas te gusten\n\ntrinidad la vas arracar a tu gusto, he arrancado con brillo a veces, pero es raro. suelo arrancar con {{item:3101}}  pero en su mayoria arranco con bacteriofago. voy viendo que quiiero primero, si red de enf o daño con bacteriofago. \n\ncon esos dos items a tenes 30% de enf. un lujo. ahora hermano tankeate urgente porque sos un papel. jjajajaajajaj\nsuelo arrancar con {{item:3143}}  o apariencia espiritual depende quien este mas potente. con apariencia espiritual ya obias hacer mas red de enfriamiento ya sumas los 40%. y toodo lo que resta tanke. warmog(que te da red de enf) cota de espinas, placa del hombre, lo que vos quieras, de daño basta ahi. aunque en partidas me he hecho rabadon o filo o titanica va como piña, pero son partidas que vos solo te vas a dar cuenta de inovar. recuerdo haber hecho rylai, lische, guinso. pero eso te hace mas blandito, salvo que mates de un combo\n\nespero que sirva.  Recorda de ser vos mismo y por la fuerza. es solo un camino pero vos cuando lo logrees mainear lo vas a saber aramar a tu gusto. he visto hecrim con shumumu y titanica y guantelete que la rompen. anda probando esos items que estan buenos. \n\n\npero si empezas apra atras la triunidad la suelo hacer de cuotas. primero un item tanke y luego bacteriofago y luego otro item tanke y recien min 30 o 35 termino la trinidad. \n\n\n\nme extendi, es un chaop que me gusta. tips? para mi el ap es fundamental y las runas de vel de mov. cualuier cosa escribi o agregame, no suelo entrar a foros \n\npelap de latam\n\npor Sombragris, rey de caballos.","replies":[]}]}]},{"poster":"PelaP","date":"2017-01-13T07:41:02.876+0000","up_votes":1,"down_votes":0,"body":"- about 22 hours ago\nbro\nyo lo manejo con gilfos de ap por nivel\nquintacsencias de vel de mov las tres\nlas marcas de penetracion magica y pen de armadura un par de marcas las tengo de daño\nsello de vel de ataque\n\ntrata de usar la e para los gank, primero espera que flashenn los enemigos o usen sus poderes, despues de usar la e y que ellos gastaron todo le tiras la r en la cara.\n\nfantasmal esta bien, exelente, yo ultimamente lo estoy jugando en mid y top, siempre con smite y fantasmal. el smite hago el rojo con cristal rojo casi siempre nunca falla. Recorda que ese item le reduce el daño a los enemigos y les reduce la vel. Y encima te da daño verdadero.\n\nel mid y top con smite con heca sirve mucho, para robar jg, hacer baron o dragon o heraldo con el jg mucho mas rapido robar la jg enemiga y para el gan y smite es crucial\n\nrecorda, la r al final, primero placaje con la e y luego la r, LUEGO de que el enemigo haya agotado todos sus recursos.\n\npara mi con hecarim es muy importante llegar a late con 40% de red de enfriamiento, en late se decide todo y sos uan maquina. focus adc o mid y gg. y tu ulti con la redcucucoin de enf la tenes a cada rato. Faker, en probuilds.com uso a heca con las gilfos de red de enfriamiento rogresivas, reicne a nivel 30 esas runas te dan 10% de red de enf. Estan buenas porque evitas comrpar items de red de enf y te armas mas tanke o daño . lo uqe necesite tu team\n\nel ap es fundamental, un poco. cuando nerfearon la trinindad que le sacaron ap se noto y mucho. por eso el ap en runas va como piña. recorda que la W TE CURA. TE DA MAS SUSTAIN EN LAS TF DE MASAS, REGENERAS A LO LOCO, Y LE SUMA DAÑO A LA R .\n\ntodo esto sirve, pero vos tenes que lograr darte cuenta la composicion de tu team, que necesita, si mas daño, que explotes al adc contrario en late o que protegas a tu mid o adc, tanke luchador el mejor. lo manejo desde la s2. que jugaba en LAN, TODOS hablando ingles y de repente te encontrabas con un latino, era una alegria tremenda. Los yankis ponian english please, jaja.\n\nque armo yo primero?\n\n  te fijas si hay mucho stun mercurio si no las ninjas. o las alitas o las que mas te gusten\n\ntrinidad la vas arracar a tu gusto, he arrancado con brillo a veces, pero es raro. suelo arrancar con  pero en su mayoria arranco con bacteriofago. voy viendo que quiiero primero, si red de enf o daño con bacteriofago.\n\ncon esos dos items a tenes 30% de enf. un lujo. ahora hermano tankeate urgente porque sos un papel. jjajajaajajaj\nsuelo arrancar con  o apariencia espiritual depende quien este mas potente. con apariencia espiritual ya obias hacer mas red de enfriamiento ya sumas los 40%. y toodo lo que resta tanke. warmog(que te da red de enf) cota de espinas, placa del hombre, lo que vos quieras, de daño basta ahi. aunque en partidas me he hecho rabadon o filo o titanica va como piña, pero son partidas que vos solo te vas a dar cuenta de inovar. recuerdo haber hecho rylai, lische, guinso. pero eso te hace mas blandito, salvo que mates de un combo\n\nespero que sirva. Recorda de ser vos mismo y por la fuerza. es solo un camino pero vos cuando lo logrees mainear lo vas a saber aramar a tu gusto. he visto hecrim con shumumu y titanica y guantelete que la rompen. anda probando esos items que estan buenos.\n\npero si empezas apra atras la triunidad la suelo hacer de cuotas. primero un item tanke y luego bacteriofago y luego otro item tanke y recien min 30 o 35 termino la trinidad.\n\nme extendi, es un chaop que me gusta. tips? para mi el ap es fundamental y las runas de vel de mov. cualuier cosa escribi o agregame, no suelo entrar a foros\n\npelap de latam\n\npor Sombragris, rey de caballos.","replies":[]},{"poster":"Ryûjin Ronin","date":"2017-01-12T02:05:19.711+0000","up_votes":1,"down_votes":0,"body":"Corre como el viento tiro al blanco","replies":[]}]}