{"poster":"Salvor","date":"2018-09-26T16:17:38.781+0000","title":"El declive de LoL - Seg칰n los n칰meros 游늴","subforum":"Charlas Generales","up_votes":40,"down_votes":4,"body":"[](http://i.imgur.com/9S7uUc8.png?noredirect)\n\nLes traigo un [post de NA](https://boards.na.leagueoflegends.com/en/c/general-discussion/ka7IqcPM-leagues-decline-by-the-numbers) (traducido claro) que hizo el usuario [DrCyanide](https://boards.na.leagueoflegends.com/en/player/NA/DrCyanide), me parecio un buen trabajo, y por eso se los traigo.\n\nhttps://lolstatic-a.akamaihd.net/frontpage/apps/prod/rg-irelia-reveal/es_AR/799921fe5991a64214c73a22b7df421f4230b6be/assets/img/global/accents/intro-divider-1.png\n\nVemos que la gente habla de c&oacute;mo est&aacute; muriendo el LoL. Citan cambios de balance, tiempos de espera, listas de amigos vac&iacute;as y cualquier otra cosa que se les ocurra.\nTambi&eacute;n vemos que la gente trata de discutir esos reclamos. Hablan de que sus tiempos de espera son los mismos de siempre, de que todos sus amigos siguen jugando y de cualquier otra cosa que se les ocurra.\n\nEntonces, &iquest;qui&eacute;n tiene raz&oacute;n? &iquest;Y cu&aacute;nta raz&oacute;n tienen? Para responder a eso, necesitamos n&uacute;meros.\n\nhttps://i.imgur.com/s3FAEni.png\n\n##**Metodologia**\n\nPara los n&uacute;meros, recurr&iacute; a op.gg. En particular, [op.gg/statistics/tier/](http://op.gg/statistics/tier/) que enumera un valor acumulativo del n&uacute;mero de personas en ese rango o superior. El valor acumulativo de Bronce 5 dar&aacute; un total de todos los jugadores que OP.GG conoce que jugaron en el ranking de esa temporada. Para rellenar los datos hist&oacute;ricos, utilic&eacute; https://web.archive.org/ que me permite solicitar viejas instant&aacute;neas de op.gg\n\nPara tratar de ser consistente, saqu&eacute; fotos de septiembre de a&ntilde;os anteriores, tan tarde como pude en septiembre. En los casos en los que no hubo una instant&aacute;nea de septiembre, prefer&iacute; tirar de octubre, pero a veces tir&eacute; de agosto.\n\nhttps://i.imgur.com/s3FAEni.png\n\n##**Fallas conocidas con los datos**\n\n* Al extraer mis datos, volv&iacute; al 2015. OP.GG todav&iacute;a estaba trabajando en las traducciones al ingl&eacute;s en 2015, y como tal, puede que no hayan sido tan ampliamente utilizadas en ese entonces, lo que har&iacute;a que el recuento de jugadores en la Clasificaci&oacute;n pareciera m&aacute;s peque&ntilde;o de lo que era en realidad.\n* JP no era una regi&oacute;n en 2015.\n* Los servidores de Garena (incluyendo China) no est&aacute;n representados.\n* Esto s&oacute;lo muestra los datos clasificados de las personas que terminaron las 10 colocaciones. Creo que s&oacute;lo cuenta Solo Queue. Si alguien cambiara a Flex solamente, o no terminara sus Colocaciones antes de jugar s&oacute;lo a las Normales, entonces seguir&iacute;a jugando pero no aparecer&iacute;a en estos datos.\n* Estos datos son anuales. Alguien que jug&oacute; en enero y renunci&oacute; en febrero sigue siendo contado. No podemos ver mes a mes las l&iacute;neas de tendencia.\n\nhttps://i.imgur.com/s3FAEni.png\n\n##**Datos**\n\nPrimero los datos crudos. &iquest;Qu&eacute; ten&iacute;a OP.GG para las poblaciones clasificadas?\n\nhttps://i.imgur.com/oQ3jgHO.png[]\n\nPodemos entonces ver c&oacute;mo esas poblaciones cambiaron de a&ntilde;o en a&ntilde;o. (2016 Cambio = 2016 Conteo - 2015 Conteo)\nhttps://i.imgur.com/8FQLyTe.png[]\n\nPara que estos datos sean m&aacute;s significativos para nosotros, podemos considerarlos como un cambio porcentual.\nhttps://i.imgur.com/79aX7IE.png[]\n\n**Cambio neto de poblaci&oacute;n entre 2016 y 2018**\nhttps://i.gyazo.com/dab94f144d79d684e008faa601d8212c.png\n\nhttps://i.imgur.com/s3FAEni.png\n\n##**Observaciones**\n\n* NA y OCE fueron los primeros en empezar a perder jugadores que hac&iacute;an cola para jugar en SoloQ, teniendo menos jugadores en total en 2017 que en 2016.\n* Tanto la disminuci&oacute;n de NA como la de la OCE se estabilizaron en 2018.\n* Jap&oacute;n es la &uacute;nica regi&oacute;n que gano jugadores de SoloQ en 2018.\n* EUW y EUNE perdieron porciones significativas de su base de Solo Queue en 2018, con lo que sus recuentos se situaron al mismo nivel o por debajo de sus hom&oacute;logos de 2016.\n* La poblaci&oacute;n total de la cola de la Liga Solo es un 2% menor que en 2016.\n\n##**Observaciones externas**\n\nFactores a tener en cuenta al mirar los n&uacute;meros, independientemente de los cambios de balance.\n\n* 2016 Riot reemplaza Solo Queue por Dynamic Queue\n* Sept 2016 - Riot anunci&oacute; que alcanzar&iacute;a a 100 millones de jugadores al mes\n* Sept 2016 - Riot anuncia que quiere que League of Legends sea &quot;un deporte global que dure por generaciones&quot;.\n* 2017 introdujo Flex Queue como una cola clasificada independiente de Solo Queue\n* 2018 Riot ha introducido varias misiones dirigidas a jugar con nuevos jugadores.\n* 2018 Riot ha publicado m&aacute;s anuncios para el juego, especialmente en YouTube en colaboraci&oacute;n con los creadores de contenido.\n\nhttps://i.imgur.com/s3FAEni.png\n\n##**Conclusiones**\n\n* Es probable que una parte de estas disminuciones sean personas que juegan s&oacute;lo Flex o normales, mientras que otras abandonan el juego directamente. No tenemos datos que sugieran cu&aacute;l puede ser la distribuci&oacute;n entre esos puntos.\n* El mayor &eacute;nfasis en la atracci&oacute;n de nuevos jugadores, combinado con el descenso de la cola de jugadores por debajo de los niveles de 2016, implica que hay una p&eacute;rdida muy real de inter&eacute;s de los jugadores en el juego.\n* Si bien es inevitable un cierto declive de la poblaci&oacute;n en un juego m&aacute;s antiguo, &iquest;cu&aacute;nta disminuci&oacute;n debe esperarse? La disminuci&oacute;n del 28% y el 24% en EUW y EUNE sufrida este a&ntilde;o seguramente no es sostenible, y bien podr&iacute;a ser un indicador de que el juego se est&aacute; extinguiendo en esas regiones. Sin embargo, el descenso general del 2% a partir de 2016 est&aacute; bien.\n\n##**Especulaci&oacute;n y pensamientos finales**\n\nLos n&uacute;meros de la lista de NA no declinaron hasta el a&ntilde;o despu&eacute;s de que se elimin&oacute; la Cola de Solos, el a&ntilde;o en que se volvi&oacute; a traer la Cola de Solos. Con eso en mente, ser&aacute; muy interesante ver lo que trae el 2019. Los conteos de 2019 podr&iacute;an tener un impacto basado en c&oacute;mo se manej&oacute; el 2018, sin importar qu&eacute; tan bien (o mal) se reciban los Cambios Clasificados del 2019.\n\nLa gente estar&aacute; discutiendo si el juego est&aacute; &quot;Muerto&quot;, &quot;Muriendo&quot;, &quot;Declinando&quot; o &quot;Haci&eacute;ndolo bien&quot; durante a&ntilde;os. Creo que estos datos son suficientes para demostrar que cuando se habla de estas cosas es importante especificar cu&aacute;l es el marco de referencia cuando se hace cualquiera de estas afirmaciones, y que hay espacio para argumentar al menos tres de las cuatro.\n\n_Ac&aacute; termina lo de DrCyanide_\n\nhttps://lolstatic-a.akamaihd.net/frontpage/apps/prod/rg-champion-nunu/es_AR/186f38e828dfc5cc411f9d84bdae6b7b4ce2d1f0/assets/img/global/accents/accent-1.png\n\n##**Opini&oacute;n personal m&iacute;a** http://i.imgur.com/tYjEaic.png%5B/img%5D?noredirect\n\nBueno, yo no quiero profundizar mucho en el _porque_, de la perdida de jugadores / inter&eacute;s en LoL, por lo que solo dir&eacute; que la mala temporada 8 (pareci&oacute; mas un pre-temporada) sumada al Boom de los battle royale, as&iacute; como la aparici&oacute;n de un nuevo F2P popular (Fortnite) que &quot;copo&quot; las plataformas de Youtube y Twitch (aunque carece de competitivo y en ese &aacute;mbito el LoL sigue siendo l&iacute;der indiscutible), dichos factores mas lo que podr&iacute;a ser un &quot;cansancio / desgaste&quot; que el LoL puede sufrir por ser un juego que se mantiene por tantos a&ntilde;os, son una buena explicaci&oacute;n al problema mencionado.\n\nAs&iacute; que voy mas all&aacute; en la discusi&oacute;n: \n**&iquest;Que tiene / puede hacer Riot para recobrar el inter&eacute;s de los jugadores?** \n(o al menos detener el declive)\n\nBueno, la respuesta me parece bastante simple, **Mejorando el juego en todos sus aspectos en un breve lapso de tiempo**.\n\n_&iquest;Como?_\n\nBueno, b&aacute;sicamente mediante una seria INVERSI&Oacute;N en desarrollo y mantenimiento del mismo.\nSuponiendo que todo el dinero invertido en publicidad, no este dando resultado en traer nueva gente (solo Riot lo sabe) ese dinero podr&iacute;a ser puesto en algo mejor, la publicidad no mantiene a los jugadores que ya est&aacute;n en el juego.\n\n**Contrataci&oacute;n de nuevo personal y formaci&oacute;n de equipos para un desarrollo y mantenimiento mas veloz**\n\n**Mejoras visuales**\nLoL todav&iacute;a tiene montones de campeones visualmente arcaicos, como {{champion:32}} {{champion:36}} {{champion:26}} entre otros, con nuevos equipos destinados a desarrollo se podr&iacute;a dar actualizaciones visuales de manera continua a dichos campeones (reworks como el de Ezreal y cambios como los de este parche a Jarvan, Veigar, Lee).\n2 Skins de lanzamiento para campeones nuevos.\n\n**Jugabilidad**\nReducir la brecha de balance entre campeones en SoloQ, (actualmente hay campeones entre 44% y 55% de winrate) reducir la brecha y hacer un balance de campeones **un poco** mas justo (que no haya campeones olvidados o que est&eacute;n en el pozo por mucho tiempo).\nEliminaci&oacute;n masiva de Bugs y ajuste masivo de Hitbox.\nPosibilidad de espectar partidas de jugadores Ligas altas u Mejores con x campe&oacute;n.\n\n\n\n**Optimizaci&oacute;n**\nCliente mas fluido, sin bugs, todo tiene que funcionar de manera so&ntilde;ada, instant&aacute;nea.\nGrandes mejoras en las repeticiones de LoL.\n\n**Comportamiento**\nMejoras a las recompensas en el sistema de Honor.\nMejoras en la detecci&oacute;n y castigo de AFKs intencionales y Trolls.\n\n**Eventos**\nMisiones, eventos, recompensas y torneos de manera mas continua.\nModos de juego rotativos / experimentales con mas frecuencia.\n\nMuchas de las cosas mencionadas, son cosas que Riot hace o intenta hacer, pero que les toman mucho tiempo, sostengo que LoL tiene que tener una evoluci&oacute;n mas acelerada si quiere ganar a la competencia.\n\nhttps://lolstatic-a.akamaihd.net/frontpage/apps/prod/rg-champion-nunu/es_AR/186f38e828dfc5cc411f9d84bdae6b7b4ce2d1f0/assets/img/global/accents/accent-1.png\n\n_TL;DR &quot;demasiado largo; no lo he le&iacute;do&quot;_\nPor diversos factores LoL experimento un declive general en el 2018, ante esto, yo opino/propongo que la soluci&oacute;n es mejorar el juego mediante una fuerte inversi&oacute;n en personal y desarrollo del mismo, mejorando todos los aspectos posibles del juego.\n\nhttps://i.imgur.com/s3FAEni.png\n\nFinalmente, &iquest;que opinan al respecto? &iquest;piensan que hay que darle una soluci&oacute;n a la perdida de jugadores? &iquest;que soluci&oacute;n propondr&iacute;an?\n**D&eacute;jenlo en COMENTARIOS**\n\nhttps://i.imgur.com/LIRC8Wq.png","replies":[{"poster":"Nuke","date":"2018-09-26T18:10:23.625+0000","up_votes":23,"down_votes":2,"body":"Riot leyendo este post ;v\nhttp://cdn5.upsocl.com/wp-content/uploads/2016/06/12-7.jpg","replies":[{"poster":"Rockett6","date":"2018-09-27T00:06:24.370+0000","up_votes":2,"down_votes":0,"body":"jajaja +10 linc","replies":[]}]},{"poster":"Nabuze","date":"2018-09-26T17:20:38.274+0000","up_votes":10,"down_votes":1,"body":"Entre 2015 y 2018 ha ganado jugadores en todos los server si se tomaran esos dos extremos como referencia.\nCreer칤a que est치 muriendo si tan solo se vieran que todas las cifras lo 칰nico que hacen es bajar a침o tras a침o pero no es as칤. Tiene sus altibajos como todo, y con el boom de este a침o con Fort ute la verdad lo veo bastante bien al lolsito xD.\n\nLo que si est치 muy bueno todo lo que propones en tus opiniones.\nAunque lo mejor que ten칤a lol y lo que m치s jugadores tra칤a era que cualquier tostadora lo pod칤a correr, hoy d칤a veo muchos con complicaciones y con pc's bastante buenas. La optimizaci칩n deber칤a ser una prioridad bajo m칤 Punto de vista.","replies":[{"poster":"Salvor","date":"2018-09-26T17:30:55.609+0000","up_votes":1,"down_votes":1,"body":"Hola Nabuze!\n\n> Creer칤a que est치 muriendo si tan solo se vieran que todas las cifras lo 칰nico que hacen es bajar a침o tras a침o pero no es as칤.\n\nIgual los n칰meros de Europa son realmente preocupantes.\n\n> La optimizaci칩n deber칤a ser una prioridad bajo m칤 Punto de vista.\n\nhttps://boards.las.leagueoflegends.com/es/c/jugabilidad-balance-y-narrativa/67JwAT3y-una-actualizacian-sobre-el-rendimiento-en-el-juego\n\nAlgo de eso est치n analizando al menos, pero el problema es el tiempo que tardan, tanto en ver el problema como en solucionarlo, por eso insisto en la formaci칩n de mas equipos para resolver los problemas en lapsos mucho menores.","replies":[{"poster":"Nabuze","date":"2018-09-26T19:18:49.037+0000","up_votes":1,"down_votes":0,"body":"Hola salvor! ^^. Gracias por el link. \nBueno por lo menos estan trabajando en el rendimiento.\notra cosa que mantiene activo a los jugadores es la cantidad de eventos que puedan generar continuamente como con odisea, aunque a algunos nos disgustara el modo lo pasamos para obtener esas recompensas y nos mantuvo activos por esa razon.\nEstaria bueno que hayan mas equipos para todo y no se si habran despedido a muchos de soporte pero el chat beta esta desactivado desde mediados de agosto :/","replies":[{"poster":"Salvor","date":"2018-09-26T19:25:06.585+0000","up_votes":1,"down_votes":0,"body":"> no se si habr치n despedido a muchos de soporte pero el chat beta esta desactivado desde mediados de agosto\n\nPr치cticamente desmantelaron LAS (y eso que supuestamente es de los servidores que mejor se mantienen respecto a gente)\n{{sticker:sg-shisa}}","replies":[{"poster":"TerrSinManos","date":"2018-09-27T16:01:58.693+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Salvor,realm=LAS,application-id=v7qsfXsE,discussion-id=dOGbB7V3,comment-id=0003000000000000,timestamp=2018-09-26T19:25:06.585+0000)\n>\n> Pr치cticamente desmantelaron LAS (y eso que supuestamente es de los servidores que mejor se mantienen respecto a gente)\n> {{sticker:sg-shisa}}\n\nComparativamente a otros servidores (NA, EUW, KR, China) somos un servidor pobre, es decir (aqu칤 estoy especulando, porque no tengo datos que avalen mi afirmaci칩n), aportamos poco a las arcas de Riot. Siguiendo la cl치sica l칩gica empresarial, seguramente Riot busc칩 reducir costos en un sector que aporta pocos ingresos. Despu칠s de todo, s칩lo importamos como jugadores en la medida en que llenemos los bolsillos de Riot.\n\nTambi칠n, me gustar칤a hacer notar que China y los servidores emergentes cercanos no est치n incluidos en el an치lisis, por lo que hay una posibilidad de que el comportamiento estad칤stico de esas poblaciones fuese distinto. Recordemos que s칩lo teniendo en cuenta la poblaci칩n de ese sector del planeta no es descabellado decir que la mayor parte de los jugadores de LoL se concentran ah칤, por lo que si por casualidad la l칩gica de crecimiento-declive estad칤stico es distinta, Riot a칰n estar칤a ganando. Recordemos lo que pas칩 en la final de la MSI (Aunque, por supuesto, hab칤a un equipo Chino peleando el t칤tulo), donde 126 millones de chinos estaban viendo el evento. Me atrever칤a a decir que el Mercado Chino es el principal mercado de LoL en la actualidad, y que Riot (en consonancia con la l칩gica de negocios descrita anteriormente) podr칤a privilegiar a ese servidor por sobre los dem치s (incluidos KR, NA y EUW).","replies":[]}]}]},{"poster":"HarpaX","date":"2018-09-27T02:59:00.520+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Salvor,realm=LAS,application-id=v7qsfXsE,discussion-id=dOGbB7V3,comment-id=00030000,timestamp=2018-09-26T17:30:55.609+0000)\n> Algo de eso est치n analizando al menos, pero el problema es el tiempo que tardan, tanto en ver el problema como en solucionarlo, por eso insisto en la formaci칩n de mas equipos para resolver los problemas en lapsos mucho menores.\n\nno creo que mas equipo sea la solucion, sino cambiar prioridades 쯤ue es mas importante, arreglar un personaje viejo, o arreglar el juego base?\nmas gente = mas sueldos, lo digo mas que nada por eso (aunque riot no es una \"small indie company\" precisamente...)","replies":[]}]}]},{"poster":"Sirenucha","date":"2018-09-26T17:57:04.349+0000","up_votes":6,"down_votes":0,"body":"Coincido en varios puntos que marcas!\nAlgo que not칠 mucho en este 칰ltimo tiempo es que veo que hay una parte de los jugadores que vuelven exclusivamente para los eventos para realizar misiones como para jugar los modos de juego, como que esto es lo que realmente atrae.\nTambi칠n cuando aparece un campe칩n nuevo que es muy llamativo tanto por su forma de juego como por su est칠tica.\nDe igual modo considero que es normal que haya gente que tenga un per칤odo en el que juega mucho y otro en el que no, hay personas que dejan de tener ese inter칠s que tuvieron al principio.","replies":[]},{"poster":"Excorpion","date":"2018-09-27T01:55:43.101+0000","up_votes":7,"down_votes":1,"body":"Una de las cosas que realmente me preocupa a mi, es el que Riot no puede mantener a sus jugadores.\nNo solo han perdido usuarios de seasons antiguas, sino youtubers que dedicaban su vida a esto, y es como que no les importa.\nHasta ahora solo se preocupan de traer m치s jugadores nuevos, y hacer eventos por todos lados sin tener un buen balance, trabajar en los campeones actuales y regresar el juego a lo que era anteriormente.\n\n[](https://-)\n\n## Las partidas se deciden por los peores jugadores en cada equipo, \n## no por los mejores como ser칤a la l칩gica de cualquier juego.\n\n[](https://.)\n\nRiot ha desviado esta l칩gica simple del juego durante todos estos a침os, antes si un Yi se fedeaba, no ten칤as como pararlo aunque hubieran 2 afks en el team enemigo... ahora, tienes un afk en tu team, o es remake, o es surrender.\n\nLos Soportes nunca han tenido protagonismo, y nunca lo tendr치n, es una de las l칤neas m치s importantes y jam치s se les ha hecho un real balance... solo son roturas, nerfeos, buffeos, etc... sin siquiera llegar a un balance.\n\nAhora con la llegada del mundial BUFFEARON a campeones mundialeros, con tal de que tengan mayor participaci칩n en el mismo evento... pero cuando veremos otros campeones ser protagonistas ?? por que pareciera que los metas no afectan al mundial ??\nEs por el p칠simo balance de Riot en cuanto a este tema.\n\nTodas estas cosas, sumado a pobres ajustes a la moderaci칩n del juego enfocadas en el chat, cansan a los jugadores... y si... tienes un aumento de cuentas, pero son las mismas personas que se hacen 3 o 4 cuentas por que cuando les banean una, crean otra.\nEnfoques de publicidad tirados a traer ni침os, y no mantener a los antiguos... misiones enfocadas a nuevos jugadores, juego en equipo, pobres premios, etc... la gente no esta satisfecha y nunca lo estar치.","replies":[]},{"poster":"Emissang","date":"2018-09-26T17:55:40.247+0000","up_votes":7,"down_votes":2,"body":"Cuando salio el overwatch salieron todos a especular que el lol moriria, yo creo que ahora mismo todo el mundo conoce el lol, por eso las publicidades en yt me parecen una terrible cagada, hubieran gastado la plata en mejorar esta season horrible","replies":[]},{"poster":"bombastico","date":"2018-09-26T17:14:05.814+0000","up_votes":5,"down_votes":1,"body":"Muy buen trabajo!\nEn mi opinion es dificil decir, con los datos presentados, si los cambios en el juego, la llegada de nuevos juegos o ambos, influyeron en la baja de jugadores. Aunque tampoco hay que subestimar el desgaste propio del genero. (vuelen alto los mmorpg)\n\nEso si, creo que el juego esta muuuuy lejos de morir.","replies":[{"poster":"Salvor","date":"2018-09-26T17:21:37.539+0000","up_votes":2,"down_votes":2,"body":"> Muy buen trabajo!\n\nSee, pobre DrCyanide, all치 en NA ni un +1 le dieron, con todo el trabajo que se mando.\nSeguro que le alegra que al menos su contenido tenga mas 칠xito ac치 xD\n######YO LE PED칈 PERMISO PARA HACER ESTE POST aclaro\n\n> el juego esta muuuuy lejos de morir\n\nEso no esta en discusi칩n, aunque me pregunto que va a hacer Riot al respecto, teniendo en mira la campa침a de AD en Youtube (que no creo que traiga mucho jugadores la verdad) muero de ganas de ver si el a침o que viene los n칰meros aumentan, y tambi칠n los n칰meros de los Worlds.\n\npersonalmente vivo en carne propia la falta de inversi칩n (en la empresa en que trabajo) y me preocupa eso, me gustar칤a ver un poco mas de ambici칩n en LoL, no se si me explico.","replies":[{"poster":"bombastico","date":"2018-09-26T17:38:00.684+0000","up_votes":1,"down_votes":0,"body":"Supongo que invirtieron por a침os y al posicionarse en la cumbre empezaron a reformar y automatizar la mayoria de sus procesos para conservar ganancias abaratando costos. Y llegaron los battle royales junto a la novedad e inversiones brutales xD","replies":[]}]}]},{"poster":"KAROLDEGENERAD0","date":"2018-09-27T18:43:10.761+0000","up_votes":3,"down_votes":0,"body":"-aqu칤 un an치lisis completo del asunto de mi parte-\n\nen lo personal he visto muchisimos jugadores nuevos de nivel bajo, m치s que en los a침os en los que me met칤. llegan generaciones jovenes por parte del fuerte impacto de la publicidad. el tema no es traer m치s gente. es como dices, de mantener a la que tenemos. \n\nJAP칍N tiene y tendr치 un crecimiento sostenido porque la industria all치 es muy buena, y es un server muy joven y saludable. el juego es m치s nuevo y novedoso para ellos, aparte que llevaron mucho koreano a levantar la escena de los esports de una.\n\nNA tiene problemas a nivel de server como de competitivo. pero econ칩micamente est치n mejor que nunca.\nEuropa en general est치 muy bien en todo sentido. tienen gente, el competitivo es de primer nivel y espa침a aparte tiene su propia liga, es genial. el problema de EUW es la fragmentaci칩n de los idiomas y tener que aguantar a los _Baguette_ poniendo FF y los diversos idiomas. lo que hace algo compleja la comunicaci칩n. jugu칠 en EUW un tiempo y s칠 de esto.\n\nLLN ten칤a graves problemas a nivel administrativo y Las tuvo que intervenir, de ah칤 la fusi칩n. mucho despilfarro, nosotros estamos tirando numeros para atr치s a riot. por eso Brazil es m치s que nosotros. manejan mejor los sponsors, los recursos y las organizaciones en general son menos mediocres. en las no estamos estancados por los jugadores. estamos estancados por la organizaci칩n de riot y de los propios equipos.\n\nel lol tiene el mundial m치s importante de los videojuegos junto con el international, el intel extreme masters y el mundial de CS:GO. y todos estos juegos han tenido bajos y altos. pero tarde o temprano vuelven.\n\nRiot tiene que atacar la base del fuego. los modos de juegos, el dinamismo y las misiones son MUY buenas para mantener a la gente entretenida y con un PROP칍SITO. si solucionan el tema de COMO sancionan a los jugadores podr칤amos tener un juego de nuevo muy atractivo.\n\n\nOverwatch, Fortnite y PUBG NO PUEDEN reemplazar a ninguno de los 3 anteriores mencionados porque su competitivo no lo pulieron bien.\n\nOverwatch tira para atr치s en espectadores y en inter칠s del competitivo y lo unico que salva son los pozos millonarios pero ac치 en latinoamerica hay poco incentivo. PUBG realmente est치 muriendo. la gente se est치 aburriendo de los problemas del juego, su competitivo tiene mucho dinero en juego tambien pero si no tienes jugadores ni espectadores eso no v치 a durar. Fortnite tiene una base de jugadores muy buena, la mayor칤a son m치s casuales... no hardcore. podr칤an crear un proyecto competitivo s칩lido pero hay mucha mediocridad de parte de epic. podr칤an haberlo hecho hace mucho tiempo ya. pero prefieren vender desbloqueables y pases de batalla.\n\nEsta generaci칩n no podr치 desbancar a la anterior y por lo tanto el reinado de LOL, Dota,y CS:GO seguir치 vigente.\n\nsolo acuerdense de cuando quer칤an volver a Rocket League un eSport y se cay칩 porque se demoraron mucho en sacar las rankeds y el juego se desinfl칩 antes de que pasara. v치 a pasar lo mismo con fotnite.\n\ngracias por leer bro, saludos c:\n\n\n{{sticker:slayer-jinx-wink}}","replies":[{"poster":"Salvor","date":"2018-09-27T18:58:32.504+0000","up_votes":2,"down_votes":0,"body":"Gracias por la respuesta larga! Coincido en pr치cticamente todo tu an치lisis.","replies":[{"poster":"KAROLDEGENERAD0","date":"2018-09-27T19:10:25.512+0000","up_votes":1,"down_votes":0,"body":"muchas gracias por leerla Salvor {{item:3681}} \nlo unico que creo que la cague fu칠 en decir que los jugadores no tienen la culpa de la mediocridad de las porque si hay responsabilidad jajaja","replies":[]}]}]},{"poster":"CharmCasterFox","date":"2018-09-26T20:12:07.097+0000","up_votes":3,"down_votes":0,"body":"yo pienso que los numeros enlas rankeds puede ser una referencia.....es muy poco.\n\nexistimos cientos de miles de jugadores que solo jugamos normales y no rankeamos y no nosinteresa hacerlo tampoco.","replies":[]},{"poster":"Cabo xD","date":"2018-09-26T16:46:44.493+0000","up_votes":2,"down_votes":1,"body":"Solo pido que al menos me dejen jugar offline cuando todo se vaya a la mrd. {{sticker:sg-poppy}}","replies":[{"poster":"Salvor","date":"2018-09-26T16:51:40.962+0000","up_votes":1,"down_votes":0,"body":"Como jugar Offline? xD","replies":[{"poster":"Shwap","date":"2018-09-26T18:27:27.898+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Salvor,realm=LAS,application-id=v7qsfXsE,discussion-id=dOGbB7V3,comment-id=00000000,timestamp=2018-09-26T16:51:40.962+0000)\n>\n> Como jugar Offline? xD\n\nDoom bots, odisea, etc.","replies":[{"poster":"Cabo xD","date":"2018-09-27T02:11:04.272+0000","up_votes":1,"down_votes":0,"body":"Sacto!","replies":[]}]},{"poster":"HarpaX","date":"2018-09-27T03:01:23.717+0000","up_votes":1,"down_votes":0,"body":"tu y 4 bots vs 5 bots, si les hicieran una IA mejor podria  estar decente, incluso para practicar mecanicas.","replies":[]}]}]},{"poster":"칊iberty or Death","date":"2018-09-26T21:26:48.273+0000","up_votes":2,"down_votes":0,"body":"Si mejoran el cliente ser칤a feliz, siempre me pasa algo :(","replies":[]},{"poster":"Rayito","date":"2018-09-26T19:23:20.125+0000","up_votes":2,"down_votes":0,"body":"Veo un problema, no tenemos datos de la gente que solo juega normales y eventos (mucha gente). Tengo idea que esos son los que mas dejaron el juego por que mas que nadasolo buscan divertirse y les da igual subir y siendo sincero lo que te divertis en un par de partidas en el fornite no se puede comparar con las partidas llenas de toxicos que te encontras aca en normales. Estaria bueno saber los datos completos.","replies":[{"poster":"Salvor","date":"2018-09-26T19:27:04.523+0000","up_votes":1,"down_votes":0,"body":"Esta mencionado en el post:\n\n_Esto s칩lo muestra los datos clasificados de las personas que terminaron las 10 colocaciones. Creo que s칩lo cuenta Solo Queue. Si alguien cambiara a Flex solamente, o no terminara sus Colocaciones antes de jugar s칩lo a las Normales, entonces seguir칤a jugando pero no aparecer칤a en estos datos._\n\nSi, estar칤a bueno, pero no est치n esos datos.\n{{sticker:sg-janna}}","replies":[]}]},{"poster":"Sunday Holiday","date":"2018-09-26T17:34:05.433+0000","up_votes":1,"down_votes":0,"body":"Ohh cuanto texto le칤 el primer p치rrafo,{{champion:32}}  yo creo que perdi칩 jugadores estos a침os por el boom de los battleroyal es que ahora es exagerado todos los juegos con armas puede sacar un battleroyal. Recuerdo el boom de los MOBAS y Capcom quer칤a hacer un MOBA de Street Fighter al final no se lo que paso con esa idea.{{sticker:sg-lux-2}}","replies":[{"poster":"Salvor","date":"2018-09-26T17:38:23.638+0000","up_votes":2,"down_votes":0,"body":"> Capcom quer칤a hacer un MOBA de Street Fighter al final no se lo que paso con esa idea.\n\nPor suerte xD\n\nIgual lo de los battle royal son solo un aspecto, Riot tiene much칤simo que ver en el declive.","replies":[]}]},{"poster":"Mazoku","date":"2018-09-26T22:37:21.536+0000","up_votes":3,"down_votes":1,"body":"Lei la mitad.\n\nHay una gran cantidad de jugadores que rankean a finales de temporada. Considerar solamente una temporada \"por la mitad\" es ridiculo.\n\nSaludos.","replies":[]},{"poster":"Rolandfc","date":"2018-09-26T19:27:03.443+0000","up_votes":3,"down_votes":2,"body":"Yo  en  mi  lista  de  amigos  tengo  serca  de  30  personas  , algunos  son  familia  otros  amigos  sercanos  y  otros   personas  que  me  han  agregado  ,  pero  cuando  RIOT  tomo  la  genial  idea  de  retirar  el  cliente  de  LEGADO  y  dejar  esta  basura  de  cliente  lleno  de  bugs  que  ademas  es  lent칤simo  ,  mi  lista  de  amigos  se  fue  a  negro  ,  ya  nadie  de  mis  familiares  y  amigos  sercanos  juega  por  lo  mal  y  lento  que  le  va  el  cliente  y  de  los  dem치s  con  suerte  me  topo  con  uno  o  dos  ,  en  conclusi칩n  para  mi  RIOT   se  a  auto  saboteado   con  este  p칠simo  cliente  que  nos  fuerzan  a  utilizar  y  que  por  desgracia   ni  ellos  saben  como  optimizarlo  ,  el  da침o  absurdo  de  unos  campeones  debido  al  p칠simo   balance  de  estos  es  algo   tambi칠n  a  tomar  en  cuenta  .","replies":[]},{"poster":"Arkhalis","date":"2018-09-26T21:28:09.650+0000","up_votes":2,"down_votes":1,"body":"Yo creo que el hecho de que NA y EUW tengan un declive muy grande de jugadores es muy malo, por qu칠 a fin de cuenta el resto de las regiones copia lo que hace NA y EUW, por otra parte me parece muy sorprendente que con el boom de fornite solo hayamos perdido el 2% de jugadores que en 2016, de igual forma que en 2 a침os el juego no haya crecido en comunidad me parece malo, POR QUE LO QUE NO CRECE, MUERE. Conf칤o en que riot games va a poder superar esta situaci칩n ya que son los que tienen m치s experiencia en comunidad de todo el mundo, y estoy seguro que tienen las herramientas necesarias para sobrepasar esta situaci칩n pero la cuesti칩n es y sigue siendo: 쯣odr치?","replies":[]},{"poster":"Treant del DOTA","date":"2018-09-26T17:00:19.688+0000","up_votes":2,"down_votes":1,"body":"Lo 칰nico que me produce disgusto es lo mal que anda el cliente, despu칠s por todo lo dem치s estoy chocho. Y llevo aqu칤 9 a침os.","replies":[]},{"poster":"Triloghia","date":"2018-09-28T02:35:26.079+0000","up_votes":1,"down_votes":0,"body":"Hola yo creo que a pesar de los numeros el juego esta creciendo , pero en mi humilde opinion para mantener mas a los jugadores deberia inclinarse riot en fomentar los e-sports como por ej publicar en el cliente los premios de miles de dolares que un jugador puede ganar jugando al lol , por que este tipo de. Cosas estan bastante a trasmano desde descargar y jugar .\nHay que buscar y seguir buscando para uno enterarse que el primer premio del mundial son 850k de dolar.\nAdemas todo este tipo de post son rese침as negativas que aparecen en el inicio del google crome que hace a los jugadores pensar demasiado jaja.\nSaludos","replies":[]},{"poster":"Draconis","date":"2018-09-27T17:16:30.203+0000","up_votes":1,"down_votes":0,"body":"Discrepo en lo que tieneq ue hacer Riot, yo siento que son 3 cosas necesarias para que el juego vuelva a ser atractivo:\n1.-Mejorar el sistema de rankeds para que se sienta mas recompensante y menos castigador.\n2.-Lo que planteaba doublelift de hacer menos parches muy impactantes al game seguidos, para asi tener mas streamers y una comunidad mas activa(que siempre fue el fuerte de lol, la comunidad, porq ue como juego es bueno, pero ninguna maravilla)\n3.-Promover los videos de LOL en youtube y con esto me refiero a casos como de LastPick que le dieron strikes por hacer videos con imagenes de la LCK.","replies":[{"poster":"Salvor","date":"2018-09-27T17:20:45.507+0000","up_votes":1,"down_votes":0,"body":"1. Eso en general coincido.\n\n2. Lo de los parches menos impactantes ya lo est치n haciendo.\n\n3. Se supone que est치n sacando ese programa para ayudar a los creadores de contenido.","replies":[]}]},{"poster":"Fransoi ","date":"2018-09-27T12:43:24.883+0000","up_votes":1,"down_votes":0,"body":"lo que pasa es que mucho se fueron al fornite tengo un amigo que le encant칩 el fornite y hoy juega a eso ya ni toda el lol hace 4 meses y hace 8 9 que juega fornite es s칩lo eso cuando el fornite muera o se bajonee regresan al lol o se cambian a otro m치s xD","replies":[{"poster":"Salvor","date":"2018-09-27T12:46:26.641+0000","up_votes":1,"down_votes":0,"body":"Personalmente jugue muy poco al Fornite, me aburri칩 porque no me gusta la mec치nica de creaci칩n de terreno.\nNinguno de mis amigos de LoL se paso al Fornite, como mucho lo probaron y como yo lo dejaron al poco tiempo.","replies":[]}]},{"poster":"Fenrito","date":"2018-09-27T12:34:45.166+0000","up_votes":1,"down_votes":0,"body":"A esa informaci칩n le faltan los datos de gente que juega normales/solo eventos (yo), cosas como Flex/aram/bosque retorcido o no hicieron las partidas de posicionamiento, no haria mucho cambio pero seria una informaci칩n mas acertada\n\nOtra cosa, Riot tendria que en VERDAD corregir su logica en el matchmaking, sigo repitiendo mi caso personal que en normales reclutamiento/normales blind pick/bots/arams/eventos/modo de juego temporales me ponia siempre contra gente de elo oro 3 hasta Challenger y en soloQ tengo elo de plata 3 (muy mal a침o en posicionamiento y rankeds). \n\nDiran que soloQ es mi nivel,  que normales tiene su propio mmr,que es por que los de elo alto juegan pocas partidas, que darius esta roto, etc etc pero esa GRAN diferencia entre ranked y normales me jode bastante la experiencia de juego por que me acostumbro a un nivel de juego que choca bastante entre modos y me termina tilteando o haciendo mas \"depresivas\" las derrotas en ranked y mas \"insatisfactorias\" las victorias en cualquier modo no ranked","replies":[]},{"poster":"N4Z1 Player","date":"2018-09-26T20:35:15.863+0000","up_votes":1,"down_votes":0,"body":"Excelente post. Coincido en tu opini칩n personal, lo bueno que tiene lol a diferencia de otros juegos como los nuevos battle Royale es que en un PC low end se puede seguir jugando quiz치s a diferencia de los battle royale que exigen PC High end.","replies":[{"poster":"HarpaX","date":"2018-09-27T03:04:29.770+0000","up_votes":1,"down_votes":0,"body":"yo tengo un note \"low end\" y me va como el pico xD\n\nalgo curioso que me pasa esque en la \"smurf\" el juego me va 10 fps peor, con exactamente la misma configuracion (grafica, de interfaz, de todo) que en la \"main\". ni puta idea del por que.","replies":[{"poster":"IIIIIIIIIIIIIIII","date":"2018-09-27T06:24:56.482+0000","up_votes":1,"down_votes":0,"body":"No tendras sincronzaci칩n vertical o antisolapamiento? o esas opciones raras, hay muchas cositas para tocar en opciones como elementos esteticos, sombras, o en el mismo cliente para cerrarlo durante partida, resoluciones, etc. Si revisas exhaustivamente vas a encontrar porque el rendimiento lo da tu pc mediante una configuraci칩n sin importar la cuenta. (Algo que me di cuenta hace poco, es que me empezo a andar mejor cuando elimine los conjuntos de objetos personalizados y las repeticiones de mi cuenta, me di cuenta de esto con una cuenta secundaria que justamente andaba mejor)","replies":[]}]}]},{"poster":"EreboHunter","date":"2018-09-27T05:35:07.302+0000","up_votes":1,"down_votes":0,"body":"lo que yo pedir칤a para que mejorasen en el juego 2 cosas, 1. actualizar urgente los di치logos de ciertos campeones que se conocen, de que vale los \"lores\" que arman si no es nuevo champ o un megarework no interacciona (ej: {{champion:98}}  a pesar de su rework hasta el d칤a de hoy no conoce  a {{champion:238}} ,{{champion:84}}, {{champion:85}} etc, para mi el peor rework) y 2. ya con los a침os y con la inversi칩n de paginas de Internet como es noxus , piltover, jonia , demacia etc (un mal gasto de dinero) por que no armaron mapas que est칠n basado en runaterra en ves de armar un mapa de ella que solo se ver치n la primera semana en una pagina, tienen que usar esa creatividad de esos dise침os no en foros o paginas de Internet  sino en el juego! hasta se pueden dar el lujo que sea la misma grieta con skin de los lugares de runaterra si tanto miedo por el fallo de dominio, as칤 las partidas no son siempre en el mismo mapa, para mi ya cansa (y mas que la grieta lleva el nombre de invocadores sabiendo que no existen), es solo mi opini칩n de lo que falta en el juego","replies":[]},{"poster":"Turing Test","date":"2018-09-26T17:55:26.185+0000","up_votes":1,"down_votes":0,"body":"> Es probable que una parte de estas disminuciones sean personas que juegan s칩lo con [flexiones o s칩lo con normales]*, mientras que otras abandonan el juego directamente. **No tenemos datos que sugieran cu치l puede ser la distribuci칩n entre esos puntos**.*\n\n*Flex o normales en soloQ. \nC칩mo puede ser que no tengan datos ?","replies":[{"poster":"Diosmo","date":"2018-09-26T22:14:01.021+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Turing Test,realm=LAS,application-id=v7qsfXsE,discussion-id=dOGbB7V3,comment-id=0005,timestamp=2018-09-26T17:55:26.185+0000)\n>\n> *Flex o normales en soloQ. \n> C칩mo puede ser que no tengan datos ?\n\nSegun habia visto en la API de Riot, SI hay datos que puedan decir si una persona juega solo normales, aram, clasificatorias, etc. Estan discriminados por cada uno asi que se puede analizar.","replies":[{"poster":"Turing Test","date":"2018-09-26T23:33:53.407+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Diosmo,realm=LAS,application-id=v7qsfXsE,discussion-id=dOGbB7V3,comment-id=00050001,timestamp=2018-09-26T22:14:01.021+0000)\n>\n> Segun habia visto en la API de Riot, SI hay datos que puedan decir si una persona juega solo normales, aram, clasificatorias, etc. Estan discriminados por cada uno asi que se puede analizar.\n\nPensaba en eso. Quiz치s op.gg no recopilaba esa informaci칩n antes ( desde que se empezaron a tomar los datos) y eso hizo que no pudieran incluir esa informaci칩n.","replies":[]}]},{"poster":"Salvor","date":"2018-09-26T18:00:30.805+0000","up_votes":1,"down_votes":0,"body":"> *Flex o normales en soloQ.\n\nCorregido!\n\n> C칩mo puede ser que no tengan datos ?\n\nOP.GG solo toma los datos de SoloQ en esa estad칤stica, por lo que la gente que no jugo las 10 partidas provisionales en SoloQ o solo juega normales esta excluida.","replies":[{"poster":"Zoliza","date":"2018-09-26T22:06:56.304+0000","up_votes":1,"down_votes":1,"body":"Igualmente hay mucha gente con minimo 2 cuentas rankeadas y otros mas ( yo tengo 5) y no son 5 jugadores es 1 aunque le jugue solo las 10 y casi no toco el lol hace un a침o.","replies":[]}]}]},{"poster":"Zelos From Jonia","date":"2018-09-26T18:08:14.362+0000","up_votes":1,"down_votes":0,"body":"{{sticker:slayer-pantheon-popcorn}}","replies":[]},{"poster":"HarpaX","date":"2018-09-27T02:55:35.475+0000","up_votes":1,"down_votes":3,"body":"literalmente omiti hasta el tl;dr.\n\nno me sorprende que el lol este en decadencia, lleva varios a침os ya, la comunidad es cada vez peor (in-game) y riot no hace nada pa arreglar eso, solo pulen el juego (que esta bien, pero no es lo mas importante imo).\n\nagregar un sistema de emparejamiento que funcione, junto a un sistema de penalicaciones que funcione y algo para que las smurf solo juegen contra surfs arreglaria el juego casi por completo, volveria a ser divertido.\n\nla misma riot a dicho que el codigo del juego es una mierda, asi que igual podrian parar el desarrollo de contenido varios meses y reescribirlo todo.\nque seria muy costoso y sacrifican mucho? pues si, pero a la larga seria muy beneficioso para todos.\nReescribirlo a pedazos solo lo rompe mas.","replies":[]}]}