{"poster":"Bennyvsh","date":"2018-05-05T09:04:19.837+0000","title":"Wie bekomme ich wieder mehr Lust auf LoL?","subforum":"Allgemeiner Chat","up_votes":1,"down_votes":0,"body":"Hallo,\r\nIch spiele allgemein gerne LoL . Aber nach meistens 2-3 Games ,egal ob gewonnen oder verloren verliere ich die Lust und spiele etwas anderes oder gehe raus. Fr&uuml;her habe ich immer so 5 Games hintereinander gespielt .\r\n\r\nWie kann ich das &auml;ndern ? \r\n\r\nMFG TomatenSuppe123","replies":[{"poster":"Nordwolf87","date":"2018-05-05T09:21:51.177+0000","up_votes":2,"down_votes":0,"body":"Hab ich auch oft. Tw sogar nach 1 game schon (egal ob win oder loss).\n\nMan kann sich nicht dazu \"zwingen\" Lust auf egal was zu haben aber keine Sorge das ist ganz normal und gesund ;)","replies":[{"poster":"K1ngLeoon","date":"2018-05-05T18:39:42.891+0000","up_votes":1,"down_votes":0,"body":"Hahahahah als ob das so eine Krankheit ist \" ist ganz normal und gesund \" XDDD","replies":[]}]},{"poster":"Kira Rengami","date":"2018-05-07T16:40:45.840+0000","up_votes":1,"down_votes":0,"body":"deinstallieren, 2-3 Jahre liegen lassen, mit etwas glück hauen die den mates brain scaling buff raus, von 0,2 auf 0,4 (scaling)\nDann macht es vllt wieder \"Spaß\" (Haha... \"Spaß in LoL\")","replies":[]},{"poster":"kidsrtheworstSTD","date":"2018-05-05T22:21:49.773+0000","up_votes":1,"down_votes":0,"body":"es ist richtig das du hier um hilfe bittest! du hast die warnzeichen richtig gedeutet, es ist nicht ok \"rauszugehen\" wenn man auch am pc sein leben verschwenden kann! gerne gebe ich dir tips um deine prioritäten wieder zurechtzurücken :)\n\nmach einfach eine pause von lol aber geh um himmels willen nicht raus und such dir schon gar kein anderes hobby wie ein sportverein oder sowas! stattdessen spiel andere games wie warframe, path of exile oder fortnite! falls du bisher nur normals gespielt hast kanns auch helfen ins ranked zu gehen.\n\nich hoffe der horror des sonnenscheins bleibt dir in zukunft erspart, hier noch ein link zu blickdichten vorhängen, damit kannst du zocken ohne lästige sonnenreflexionen auf dem monitor :)\n\nhttps://www.amazon.de/Deconovo-Verdunkelungsvorhang-Kr%C3%A4uselband-Gardinen-Blickdicht/dp/B01AT1YDEI/ref=sr_1_1_sspa?ie=UTF8&qid=1525558839&sr=8-1-spons&keywords=vorhang+blickdicht&psc=1","replies":[]},{"poster":"rekkles vater","date":"2018-05-05T18:58:13.782+0000","up_votes":1,"down_votes":0,"body":"Wenn du eine Pause machst wird sich das wieder ändern. Habe auch die ein oder andere Pause hinter mir gehabt.\nz.b. nachdem ich ein halbes Jahr nicht gespielt habe, hatte ich mal wieder Lust auf Lol und da viel neues dazu gekommen ist hab ich wieder bock gehabt und hab extrem viel gespielt. \n\nHoffe konnte dir helfen\n~ Lukas {{champion:107}}","replies":[]},{"poster":"Warum denn nicht","date":"2018-05-05T14:11:59.978+0000","up_votes":1,"down_votes":0,"body":"Versuchen sich irgendwo zu verbessern oder seine Erfolge betrachten ist nett, vor allem in rankeds. Ansonsten ist mit Freunden in normals zu spielen ohne tryhard entspannend.","replies":[]},{"poster":"Pure Cynicism","date":"2018-05-05T10:25:59.634+0000","up_votes":1,"down_votes":0,"body":"Wenn du LoL schon länger spielst, bist du vielleicht einfach übersättigt. Ich hab auch 30 Leute auf der Freundesliste, von denen kommt vielleicht 1x pro Woche jemand kurz on. Früher hab ich auch mehr gespielt. Man wird eben älter, die alten Spieler ziehen weiter, junge neue kommen dazu. Ist ganz normal.","replies":[]},{"poster":"Mjölnir Kind","date":"2018-05-05T11:37:32.553+0000","up_votes":1,"down_votes":1,"body":"3mal im Kreis drehen - I bims 1 lol Spieler sagen - und Master auf Full Ap spielen :D","replies":[]},{"poster":"WommelMain","date":"2018-05-06T15:10:01.057+0000","up_votes":1,"down_votes":2,"body":"Lösch das Spiel, verklag Riot so bekommst dein investiertes Geld zurück (Begründung: Aktives zerstören des Spielspaßes). Und ja es ist Begründet da mit jedem Patch das Spiel immer und immer schlechter wird. Dazu kommt dieses Rankedsystem was naja, selbst EA besser könnte. Du wirst bestraft dafür das Leute aus deinem Team AFK gehen. Und das ist nur die Spitze des Eisberges. Ich empfehle spiel Battlerite als Abwechslung und warte bis nächste Season. Vielleicht wachen die Leute da oben mal auf und überlegen ordentlich was sie ändern. \n\nOder mach nichts davon und lass die weiter von 0 12 Rengar-Spielern one-hitten. Danke Riot für so ein geiles Spielerlebnis.{{item:2319}} Geld mehr wollen die nicht, Spielspaß interessiert hier eh niemanden.\n\nBattlerite hingegen ist dahin gehend besser gestaltet. UND AFK bedeutet dort PERMABAN egal ob einmal oder HUNDERT mal, da es den anderen Spielern das Game zerstört.","replies":[]}]}