{"poster":"tzeensch","date":"2015-11-08T11:18:52.616+0000","title":"Ich hab ma ne Frage zu Battlegrounds (an die Adjudicators)","subforum":"Battlegrounds-Turniere","up_votes":1,"down_votes":0,"body":"Hallo ihr lieben Adjudicators,\r\n\r\nwas kann eigentlich einem Spieler oder dem Team schlimmsten Falls passieren wenn einer der Teilnehmer unter 16 Jahren alt ist?\r\nUnd wie habt ihr vor das &uuml;berhaupt zu kontrollieren?\r\n\r\nDanke im Vorraus","replies":[{"poster":"Elthision","date":"2015-11-08T11:40:08.092+0000","up_votes":3,"down_votes":0,"body":"Hey,\n\n> was kann eigentlich einem Spieler oder dem Team schlimmsten Falls passieren wenn einer der Teilnehmer unter 16 Jahren alt ist?\n\nJeder Teilnehmer muss mind. 16 Jahre alt sein. Jeder Captain kann und muss überprüfen, ob dies auf seine Mitglieder zutrifft. Es kann eindeutig bestimmt werden und darum ist es ganz simpel:\n\nIst dein Mitglied 18 Jahre alt oder älter:\n- Ja es darf teilnehmen, sofern es die Teilnahmebedingungen bezüglich Wohnort erfüllt.\n\nIst dein Mitglied 16/17 Jahre alt:\n- Ja, es darf teilnehmen, sofern es die Teilnahmebedingungen bezüglich Wohnort erfüllt und es die Einverständniserklärung der Eltern vorweisen kann. \n\nIst dein Mitglied jünger als 16 Jahre alt:\n- Nein, es darf nicht teilnehmen.\n\nDie Konsequenzen zu nennen ist gar nicht nötig, da du eindeutig überprüfen kannst, ob dein Mitglied teilnehmen kann oder nicht!\n\nÜberprüft wird das anhand von euren Ausweisen und Dokumenten, welche ihr an Riot Games schicken müsst, sobald ihr dazu aufgefordert werdet. Jeder Teilnehmer muss einen gültigen Ausweis vorweisen können und falls er 16 oder 17 ist noch eine Einverständniserklärung der Eltern, welche vor dem Turnier unterschrieben wurde. Jeder Teilnehmer, welcher nicht die Staatsbürgerschaft des entsprechenden Landes vom Turnier hat (De/At/Ch) muss zusätzlich noch ein Dokument vorweisen, welches bestätigt, dass er im entsprechenden Land wohnt.\n\nmfg Elthision","replies":[{"poster":"Crounty","date":"2015-11-11T00:17:17.809+0000","up_votes":1,"down_votes":0,"body":"> Überprüft wird das anhand von euren Ausweisen und Dokumenten, welche ihr an Riot Games schicken müsst...\n\n\nAlso nicht an euch Adjudicator? Wenn nicht, wie genau an Riot Games?","replies":[{"poster":"Cunctor","date":"2015-11-11T05:41:34.237+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=no not dia 5 pls,realm=EUW,application-id=U1AH627U,discussion-id=img83gdG,comment-id=00000000,timestamp=2015-11-11T00:17:17.809+0000)\n>\n> Also nicht an euch Adjudicator? Wenn nicht, wie genau an Riot Games?\n\nWarum denn so neugierig? ;)\nWenn es so weit ist, erfahrt ihr von uns eine Email-Adresse, an die ihr die Dokumente schicken sollt. Damit lassen wir uns aber noch etwas Zeit ^^\n\nLG\nCunctor","replies":[]}]}]},{"poster":"tzeensch","date":"2015-11-09T15:39:24.803+0000","up_votes":1,"down_votes":0,"body":"Dankesehr","replies":[]}]}