{"poster":"SirPurrr","date":"2018-06-23T08:18:33.050+0000","title":"Executing Loses My Buff","subforum":"Report a Bug","up_votes":2,"down_votes":2,"body":"Executing used to allow me to keep the buff (Red/Blue). Now, it seems bugged because it no longer does.\r\n\r\nAlso, why does this count towards KDA? It&#039;s just misleading.","replies":[{"poster":"Geauxx","date":"2018-06-23T08:54:40.053+0000","up_votes":1,"down_votes":0,"body":"No it didn't.\n\nYou never kept your buff when being executed, and if you did... that was many  seasons ago.\n\n\nHow's it misleading? you died and your kda shows you died once.","replies":[{"poster":"TheLastShadow45","date":"2018-06-23T09:38:57.736+0000","up_votes":3,"down_votes":0,"body":"> V4.20\nNEW EFFECT: The buff is now only lost on time-out or death by enemy champion; executions will no longer lose you the buff.\n\nwas never removed from the game once it was put in.","replies":[]},{"poster":"SirPurrr","date":"2018-06-25T04:48:08.256+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=ZiLess,realm=NA,application-id=LqLKtMpN,discussion-id=1qK6wEB8,comment-id=0000,timestamp=2018-06-23T08:54:40.053+0000)\n>\n> No it didn&#x27;t.\n> \n> You never kept your buff when being executed, and if you did... that was many  seasons ago.\n> \n> \n> How&#x27;s it misleading? you died and your kda shows you died once.\n\nIf you die to an execute, it gives no gold to the enemy team and is irrelevant. A death suggests a mistake and an execute is often not that. In fact, it's often a GOOD play to distract the enemy team with Singed or some other champion and then execute while your team pressures.","replies":[{"poster":"Geauxx","date":"2018-06-25T07:06:57.780+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=SirPurrr,realm=NA,application-id=LqLKtMpN,discussion-id=1qK6wEB8,comment-id=00000001,timestamp=2018-06-25T04:48:08.256+0000)\n>\n> If you die to an execute, it gives no gold to the enemy team and is irrelevant. A death suggests a mistake and an execute is often not that. In fact, it&#x27;s often a GOOD play to distract the enemy team with Singed or some other champion and then execute while your team pressures.\n\nOr, you died. the game recognizes you died and is reflected on your K/D/A. Your reasoning for why you died is irrelevant, you died.","replies":[{"poster":"SirPurrr","date":"2018-06-25T08:56:06.704+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=ZiLess,realm=NA,application-id=LqLKtMpN,discussion-id=1qK6wEB8,comment-id=000000010000,timestamp=2018-06-25T07:06:57.780+0000)\n>\n> Or, you died. the game recognizes you died and is reflected on your K/D/A. Your reasoning for why you died is irrelevant, you died.\n\n\nNot at all irrelevant. How is it a \"Kill\" if it isn't the result of a player? It's termed an \"execute\" for a reason and is very obviously different from a kill in how it affects the game/gold. It's misleading and just plain stupid to have it count for KDA. It clearly doesn't fit the usual criteria for the category. It's like saying that a cow and giraffe are the same just because they both have four legs.","replies":[{"poster":"The Ecdysiast","date":"2018-06-25T16:29:44.776+0000","up_votes":2,"down_votes":0,"body":"It's not a kill, it's a death. The issue isn't that it's reflected on your KDA, the issue is that you're misinterpreting it as a kill when it's not. \n\nIn fact if you're 10/1/10 and died once because you managed to escape long enough to run out the execute timer and die to a tower or monster instead, then you should be able to recognize that it was the best option in that scenario. The fact you falsely attribute the death to a mistake is your own misunderstanding. \n\nIt is not counted on any enemies' kill counter, because it was not a kill. That doesn't mean it wasn't a death. It's not like it falsely places a kill on the enemy team's counter.","replies":[]},{"poster":"Geauxx","date":"2018-06-25T11:10:04.011+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=SirPurrr,realm=NA,application-id=LqLKtMpN,discussion-id=1qK6wEB8,comment-id=0000000100000000,timestamp=2018-06-25T08:56:06.704+0000)\n>\n> Not at all irrelevant. How is it a &quot;Kill&quot; if it isn&#x27;t the result of a player? It&#x27;s termed an &quot;execute&quot; for a reason and is very obviously different from a kill in how it affects the game/gold. It&#x27;s misleading and just plain stupid to have it count for KDA. It clearly doesn&#x27;t fit the usual criteria for the category. It&#x27;s like saying that a cow and giraffe are the same just because they both have four legs.\n\nNo, you're trying to twist it into a false narrative to fit your story kiddo, doesn't work like that.\n\nIt's not a kill, it's a death. Your Death counter went up a number because you died, no one on the enemy team received the kill credit for your execute, but you still died. Regardless of the situation, you died and your death number went up one, as to reflect you died.\n\nAlso your comparison is very far off, you're trying too hard. Calm down and accept the loss like i did about the not losing buff comment.\n\n\nThis is you on the matter: \"Why is it that i died and my death counter went up, when it wasn't another player who killed me\"","replies":[{"poster":"SirPurrr","date":"2018-06-25T16:26:23.818+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=ZiLess,realm=NA,application-id=LqLKtMpN,discussion-id=1qK6wEB8,comment-id=00000001000000000000,timestamp=2018-06-25T11:10:04.011+0000)\n>\n> No, you&#x27;re trying to twist it into a false narrative to fit your story kiddo, doesn&#x27;t work like that.\n> \n> It&#x27;s not a kill, it&#x27;s a death. Your Death counter went up a number because you died, no one on the enemy team received the kill credit for your execute, but you still died. Regardless of the situation, you died and your death number went up one, as to reflect you died.\n> \n> Also your comparison is very far off, you&#x27;re trying too hard. Calm down and accept the loss like i did about the not losing buff comment.\n> \n> \n> This is you on the matter: &quot;Why is it that i died and my death counter went up, when it wasn&#x27;t another player who killed me&quot;\n\nSo you think the 1-3% of deaths that occur by executes (possibly even fewer) are exactly the same as deaths from players and thus deserve to be in the same category? You don't see the vast difference between those two things?\n\nI also think there is still something wrong, as the top comment stated. ","replies":[{"poster":"Geauxx","date":"2018-06-25T17:20:16.810+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SirPurrr,realm=NA,application-id=LqLKtMpN,discussion-id=1qK6wEB8,comment-id=000000010000000000000000,timestamp=2018-06-25T16:26:23.818+0000)\n>\n> So you think the 1-3% of deaths that occur by executes (possibly even fewer) are exactly the same as deaths from players and thus deserve to be in the same category? You don&#x27;t see the vast difference between those two things?\n> \n> I also think there is still something wrong, as the top comment stated.\n\nI'll just send you to Uber Deer's comment.\n\n\nYou can continue your \"i want to be right so badly i'm going to toss all dumb incorrect theories  at you\" with him, as you've become a lost cause of a kid to me.","replies":[]}]}]}]}]}]}]}]}