{"poster":"felixludooo","date":"2018-02-28T23:48:55.144+0000","title":"Perder PL por un bug ;D","subforum":"Off-topic y temas personales","up_votes":3,"down_votes":0,"body":"Estaba a una partida de entrar a promo tranquilamente en duo con un amigo y la eve no se conecta dijimos fue tiramos remake yo tenia una linea dificil por jugar y bueno esperamos al minuto 3 y nada no nos dejo tirar remake con la eve en base que no se movio hasta el minuto 12 que recien se conecto y hasta el minuto 12 el lee rival stompio todas la lineas facilmente y saco objetivos como heraldo y dragones y nosotros sin jungla y sin haber podido tirar remake me gustaria dejar mi comentario y si es posible que alquien analize y escuche lo sucedido y pueda darme una respuesta o un comentario y si es posible que lo lea un rioter un gusto pd; Perdon si tengo faltas de ortografia. Espero su respuesta.","replies":[{"poster":"Hnk Kenshiro","date":"2018-02-28T23:50:16.424+0000","up_votes":2,"down_votes":0,"body":"Ocurre cuando alguien se esta re conectando, eve trato de volver a la partida durante esos 12 min.","replies":[{"poster":"felixludooo","date":"2018-03-02T20:49:54.263+0000","up_votes":1,"down_votes":0,"body":"puede ser pero de igual forma salio el mensaje de que el invocador se desconecto. Sabes si hay alguna manera de hacer una queja para que te los devuelvan o algo?","replies":[]}]},{"poster":"HjKratz","date":"2018-03-01T07:45:28.116+0000","up_votes":1,"down_votes":0,"body":"El remake aparece cuando alguien se desconecta, una persona en base parada puede ser un troll o alguien intentando reconectarse, de todos modos, suena bastante injusto, pero, desde cuando regalan pl porque se equivocaron en algo?","replies":[{"poster":"felixludooo","date":"2018-03-02T20:48:21.276+0000","up_votes":1,"down_votes":0,"body":"no era troll y no se estaba tratando de conectar eso digo perdi pl que me costo ganar eso me jode y mucho.","replies":[]}]},{"poster":"MirRawrs","date":"2018-02-28T23:50:07.317+0000","up_votes":1,"down_votes":0,"body":"¿No habias posteado esto ya?\n{{sticker:sg-zephyr}}","replies":[{"poster":"felixludooo","date":"2018-03-02T20:47:26.566+0000","up_votes":1,"down_votes":0,"body":"si pero crei que no se posteo entonces lo hice denuevo cometi el error y lo hice dos veces sin razon.","replies":[]}]}]}