{"poster":"PerroElegante","date":"2017-05-07T15:38:26.718+0000","title":"Puedo rankear con bardo?","subforum":"Charlas Generales","up_votes":4,"down_votes":2,"body":"Es un campeon que lo uso bastante bien, Pero no lo veo mucho, Es porque esta fuera de meta?","replies":[{"poster":"KarmaUnder","date":"2017-05-07T16:11:12.206+0000","up_votes":6,"down_votes":0,"body":"Si vos queres jugar bardo, vos no podes pickearlo asi como asi, vos tenes que spamear el chat que vas sup, y no cualquier sup de preferencia decir que sos main bardo desde la alfa, si es posible ponete la skin...\ny ahi pickeas bardo pero no te importa la linea, porque vas a ser habil bardo y te comes un report de la gran flauta, vos estabas en un estado de main bardo violento, lo pickeas, no te interesa si sup top adc o medio... lo recagas pickeando, si tenes que ponerte las maestrias, las de suport y si tenes un exaust te lo pones, en partida spameas la maestria cada 9 segundos y si matas a alguien la risa... y vas al tribunal asi, sos ininputable viejo en 5 minutos estas rankeando de nuevo","replies":[{"poster":"Edden","date":"2017-05-07T16:59:17.732+0000","up_votes":1,"down_votes":0,"body":"En 10 partidas sos plata 5","replies":[]},{"poster":"PerroElegante","date":"2017-05-07T16:23:24.681+0000","up_votes":1,"down_votes":0,"body":"c mamo :v","replies":[]}]},{"poster":"Rebkans","date":"2017-05-07T15:42:52.735+0000","up_votes":2,"down_votes":0,"body":"No te guies por lo que está o no en el meta. Si te gusta bardo y sabes jugarlo, entonces nada te impide que juegues rankeds con él.","replies":[]},{"poster":"Charlôtte","date":"2017-05-07T15:40:00.631+0000","up_votes":2,"down_votes":0,"body":"usá lo que quieras, si lo sabés usar pickealo nomás.","replies":[]},{"poster":"Fransoi ","date":"2017-05-08T00:32:56.087+0000","up_votes":1,"down_votes":0,"body":"Si usalo vieja si te ponen que no,no importa usalo si vos queres si el campeon te divierte y lo usas bien para vos usalo es mejor jugar y divertirse que jugar con lo que no te gusta por querer salir de bronce1 yo jugue lo que me gusta y sali","replies":[]},{"poster":"Chase me","date":"2017-05-07T22:39:38.663+0000","up_votes":1,"down_votes":0,"body":"PerroElegante, bardo junto con tk son unos supps con un impacto GIGANTESCO en el juego (ahora, esta lulu, janna y etc, pero esos potencian al adc en si. Sé que son buenisimos, pero no tienen el potencial de afectar a tan gran escala como ellos).\n\nSe ha ido popularizando el temrino de \"bardear\" cuando uno juega bardo por la unica razón de que las cosas que uno puede hacer para trolear, dejar al equipo vendido y divertirte a costa de los demas, son demasiadas. Pero si llegas a ser main bardo, uhhh papá, el potencial que tienes.\n\n(ahora, los main supps son los que dominan notoriamente, un only one trick champ no llega muy lejos en bot. A lo que voy con esto es que posiblemente tengas que dominar varios campeones soportes para poder subir rapidamente y no tener problemas con que te countereen)","replies":[]},{"poster":"Shion Archimago","date":"2017-05-07T16:20:59.618+0000","up_votes":1,"down_votes":0,"body":"si yo puedo rankear con kata sup vos podes usar a bardoc sin problemas","replies":[{"poster":"PerroElegante","date":"2017-05-07T16:24:01.976+0000","up_votes":1,"down_votes":0,"body":"c mamo x2 :v","replies":[]}]},{"poster":"Nombre ofensivo","date":"2017-05-07T16:11:38.643+0000","up_votes":1,"down_votes":0,"body":"Bardo es un campeon de mecanicas elevadas y poca recompensa, te recomiendo campeones que rindan mas","replies":[]},{"poster":"Sir Crucifix ","date":"2017-05-07T17:02:57.289+0000","up_votes":1,"down_votes":1,"body":"Es un juego en equipo , da igual que vayas teemo support ad tanque con runas de ap y maestrias de soporte con velocidad","replies":[]}]}