{"poster":"Pow4","date":"2017-12-24T02:07:38.470+0000","title":"Solución definitiva a las rankeds y el nivel de juego; RITO leer","subforum":"Charlas Generales","up_votes":4,"down_votes":8,"body":"Encontr&eacute; en otro juego lo que podr&iacute;a ser la soluci&oacute;n a los &quot;mancos&quot; del LoL. &quot;Que no se pueda bajar de liga&quot; aunque suene rid&iacute;culo o tonto, es lo mejor. \n -Primero me parece injusto que uno pueda bajar de ligas, habiendo ameritado subir todo ese paso hasta llegar a donde est&aacute;, sea plata, oro, platino etc. El league of legends es un juego ca&oacute;tico, pod&eacute;s tener una buena racha y por X circustancias bajas igual sin importar lo que hagas y como juegues. Por eso de esta forma uno se reconfortaria sentir que no corre riesgo de bajar de donde lleg&oacute; con esfuerzo, a partir de esta seguridad que nos brinda el juego uno puede proponerse mejorar y seguir subiendo en ranked.\n As&iacute; mismo en Tiers mas altos de la liga, este sistema mejorar&iacute;a a&uacute;n m&aacute;s, si en master y challenger solo hay pocos jugadores, tendrian que ser los mejores, con un n&uacute;mero limitado (como se dice, son 200 challengers) solo los que tengan mejor Winrate del juego llegar&iacute;an a la cima, y ah&iacute; s&iacute;, con el riesgo de jugar mal y decaer sin excusas, ya que todos los jugadores que estan en esa liga subieron con diferencia al resto.\n Hoy en d&iacute;a, mucho manco en league of legends, ya hace tiempo se perdi&oacute; lo &quot;skilled&quot; del juego, y es con paciencia hacia la gente, m&aacute;s que otra cosa, que se sube. La paciencia no es entretenida, jugar s&iacute; lo es, y jugar con gente de m&aacute;s nivel o el mismo nivel que uno es m&aacute;s divertido.\n\n Hace mucho uno se dio por vencido que &quot;jugando MEJOR se sube&quot;, qu&eacute; es lo que pas&oacute;? uno se adapta al &quot;meta&quot; y juega lo que esta &quot;roto&quot; aunque no le guste para nada, o la otra forma es aguantar a los que no sienten nada por el juego y solo entran a mover las manos.\n\nConsejo Rito; si vas a hacer un juego ca&oacute;tico (casual, que cambie estructuralmente cada m&eacute;s, y sin sancionar a jugadores que expl&iacute;citamente arruinan la jugabilidad de los dem&aacute;s) mejor poner un sistema de rankeds que sea acorde, y mejor para TODOS.\n\nEditado: \n Me olvide de poner algo importante; qué pasa con los que pierden siempre? por cualquier razon, podrían dejarse ganar etc. Simple, a los jugadores que tengan un porcentaje muy bajo de victorias (40% o menos) podrian hacerles jugar las placements de nuevo, para determinar el rango de dicho jugador. Se les avisa de esto, y luego se lo reubica segun como le fue en dichas placements. Puede ser por tema de comportamiento, o porque no esta en la liga adecuada.\nEn cualquier caso, dejarse ganar seria reportable, y algo obvio, por lo que antes de que ocurriera esto, dicho jugador debiera ser sancionado.","replies":[{"poster":"Pow4","date":"2017-12-24T02:49:51.256+0000","up_votes":2,"down_votes":0,"body":"Reconozco que el juego mejoro muchisimo este tiempo, con el sistema de honor, era esencial implementar algo asi. Pero esto mejoro la comunidad, no el juego =) (hay menos afk, menos trolls, menos flameo en rankeds) se nota, pero en primer lugar si uno sube de rangos, deberia notarse una mejora en la jugabilidad y satisfacción de estar donde se está.","replies":[]},{"poster":"WhiteMax","date":"2017-12-24T02:11:59.682+0000","up_votes":2,"down_votes":1,"body":"Resumen: Crypost.","replies":[{"poster":"se dice miau","date":"2017-12-24T02:15:59.743+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=WhiteMax,realm=LAS,application-id=v7qsfXsE,discussion-id=zAlL0hab,comment-id=0000,timestamp=2017-12-24T02:11:59.682+0000)\n>\n> Resumen: Crypost.\n\nnel","replies":[]}]},{"poster":"SKT T1 Bank","date":"2017-12-24T12:33:59.783+0000","up_votes":1,"down_votes":0,"body":"No. Si subis a digamos platino 2. Estas en platino 2, si bajas por una \"racha\" podes volver a subir. Pero el secreto es que pertenezcas a platino 2, y que no hayas subido en una racha positiva.\nOsea es para los dos lados, si te tocan enemigos con \"mala suerte\" vas a subir porque ganas esas partidas, pero no por ser mejor jugador. A ver yo subi a la maxima y dure 10 partidas, no me da todavia, o no le agarre el truco, el problema no es llegar, el problema es tener ese nivel. \nSi espameas partidas subis en \"racha\" como decis, pero si te queres mantener tenes que estar en esa media. Con toda la furia mucha gente subio de liga en la pretemporada, y dejo de jugar para decir despues que es de esa liga, pero saben bien que no lo son, por eso no juegan, porque saben que no estan a la altura.\n\nLa verdad es que se engañan mucho, yo se que estoy aca y mi nivel es mas bajo, solo que gano y pierdo por igual. Pero me doy cuenta que baje de nivel, y si bajo me va a costar volver aca, aunque pueda subir en una \"racha\" no soy retador me falta y se nota.\n\nPonele que llegaste a diamante, eso no es SER DIAMANTE, recien en la mitad de liga (por eso calculo que se divide en 5 para ver si sos o no de  la liga y si vas apra arriba  o para abajo) ves si sos o no de esa liga.","replies":[]},{"poster":"Pow4","date":"2017-12-24T04:46:57.106+0000","up_votes":1,"down_votes":0,"body":"Lo que propongo aca es lo siguiente, uno se \"esfuerza\" por subir, y cuando llega se encuentra lo mismo, y en malas rachas con gente que no tiene deseos de jugar, trolls etc (y tambien gente que no merece estar en esa liga por jugar pesimamente) todo ese esfuerzo fue en vano. Uno puede jugar como faker y ganar TODAS las partidas con 100% win rate, si, se puede, pero hay ser un robot. Es divertido ser un robot? No. Lo divertido es jugar, e ir progresando, encontrarte con gente que tenga el mismo nivel, uno pueda disfrutar ganando las partidas y subiendo.","replies":[]},{"poster":"BG King Fratus","date":"2017-12-24T03:05:13.318+0000","up_votes":1,"down_votes":0,"body":"https://www.youtube.com/watch?v=5mbDY8PaX74","replies":[{"poster":"RaEpFaCe","date":"2017-12-24T03:27:33.227+0000","up_votes":1,"down_votes":0,"body":"La verdad el post original no es de lo mejor, pero si tu te crees graciosito publicando el mismo link en todos los posts, pos te deseo que ojala en la proxima ranked el equipo de monos te toque a ti","replies":[]}]},{"poster":"Pow4","date":"2017-12-24T02:17:17.580+0000","up_votes":1,"down_votes":1,"body":"También con esto se solucionaría la experiencia repititiva de hoy en dia en este juego, tener que subir en todas las ligas es exactamente lo mismo, uno se encuentra con lo mismo en bronce que en plata, en oro, platino, diamante etc. No puede existir algo mas aburrido. Siendo realistas, si uno sube de nivel en una liga tiene que encontrarse con un mejor juego, con gente que sepa lo que hace y cada vez menos contradicciones, más juego de equipo y experiencia.","replies":[{"poster":"RaEpFaCe","date":"2017-12-24T03:25:09.526+0000","up_votes":1,"down_votes":0,"body":"Si es tan aburrido, desinstala y listo viejo, dedicate a otra cosa. Quien juega por la fuerza autoimpuesta a algo que no disfruta???","replies":[]}]},{"poster":"Pow4","date":"2017-12-24T02:43:14.447+0000","up_votes":1,"down_votes":1,"body":"Glosario: \n\n.Qué es nivel de juego?\ntodo lo referido a la jugabilidad; habilidad, conocimiento, tácticas, comunicación, atentención, experiencia.\n\n.Qué es lo que lleva la contraria a un juego?\ntodo lo que excluye al mismo; gente tóxica, trolls, afk.\n\n.Coherencia; un juego es para divertirse, y ser competitivos es divertido.\n\n.Casual; lo que cualquiera puede hacer, \"se jugar league of legends\" sabes realmente? leer más conceptos mas arriba.\n\n.Juego Caótico; algo característico del League of Legends, cambia constantamente, y no es algo malo, pero esto crea un mal ambiente en el mismo, todo el mundo probando lo nuevo, solo pocos lo juegan bien, otros tantos no, la gente se flamea entre si, nadie disfruta realmente lo que hace, ni el que va 15-0 ni el que va 0-15, solo hay ceguera y necedad.\n\n.Armonía; juego equitativo para todos, donde estan las posibilidades, si uno las quiere tomar y puede lo hace, si no quiere, no lo hace. Pero no por eso, uno se va a sentir mal, estando en donde este (rankeds).\n\nAlgo a parte, que también voy a tratar un poco, los nuevos en el juego se sienten reprimidos de jugar rankeds, ya que hay mucha presión por parte de todos, esto viene de lo que se habla aca. Cuando es un juego, no deberia uno sentir presiones ni reprimirse, dónde esta el sentido a eso.","replies":[{"poster":"RaEpFaCe","date":"2017-12-24T03:23:59.116+0000","up_votes":1,"down_votes":0,"body":"> ser competitivos es divertido\n\nEn mi vida vi que la competencia en un juego fuera divertida, de hecho es el nucleo mismo de todo el stress, caos, toxicidad, flammeo, intolerancia, odio y quien sabe que mas atrocidades que los jugadores (o uno mismo) que quiza se creen/son mejores que tu son capaces de cometer en su desenfrenado afan por progresar en los rangos del juego; se juega juegos para divertirse, añadele el factor competencia y listo, tienes la receta para el desastre.","replies":[]}]},{"poster":"Pow4","date":"2017-12-24T03:20:40.679+0000","up_votes":1,"down_votes":0,"body":"Ya lo edite, habia olvidado poner que seria lo contraproducente a este sistema, los jugadores que \"testean\" el sistema, y se ponen en contra haciendo cosas que no deben =). Para dichos jugadores, las placements nuevamente, y se los reubicaria en el lugar apropiado.","replies":[]},{"poster":"Mister Dúck","date":"2017-12-24T03:18:30.782+0000","up_votes":1,"down_votes":0,"body":"Esta bueno{{champion:31}} {{champion:53}} \npor que tiene -4 esto?","replies":[]},{"poster":"Gonk","date":"2017-12-24T03:18:24.439+0000","up_votes":1,"down_votes":0,"body":"> -Primero me parece injusto que uno pueda bajar de ligas, habiendo ameritado subir todo ese paso hasta llegar a donde está, sea plata, oro, platino etc. El league of legends es un juego caótico, podés tener una buena racha y por X circustancias bajas igual sin importar lo que hagas y como juegues. Por eso de esta forma uno se reconfortaria sentir que no corre riesgo de bajar de donde llegó con esfuerzo, a partir de esta seguridad que nos brinda el juego uno puede proponerse mejorar y seguir subiendo en ranked.\n\n\nA mi me parece justo por estos motivos:\n1. Trolearia siempre ¿por que? porque nunca voy a bajar\n2. No habría competitividad \n3. Si el equipo enemigo hace primera sangre (como algunos piensan que ya se perdio), troleo ya que no me va a pasar nada verdad?\n4. gente que no tiene tiempo entra a jugar y como se tiene que ir se van a afk y no les importa ya que no van a bajar\n5. Muchos no tendrian motivacion por subir ligas y si llegue a platino, juego clasificatorias que no me importar perder ya que no bajo.\n\n\n>  sin sancionar a jugadores que explícitamente arruinan la jugabilidad de los demás\n\nNo ves posts sobre \"me banearon la cuenta injustamente\"?\n\n\n> mejor poner un sistema de rankeds que sea acorde, y mejor para TODOS.\n\n\nMejor sería para los que pierden y siguen jugando hasta tener 10 derrotas en vez de ver que hizo mal o hacer otra cosa para no estresarse  mas.","replies":[]},{"poster":"Desergt Pander","date":"2017-12-24T02:31:56.806+0000","up_votes":1,"down_votes":0,"body":">  -Primero me parece injusto que uno pueda bajar de ligas, habiendo ameritado subir todo ese paso hasta llegar a donde est&amp;aacute;, sea plata, oro, platino etc. El league of legends es un juego ca&amp;oacute;tico, pod&amp;eacute;s tener una buena racha y por X circustancias bajas igual sin importar lo que hagas y como juegues. Por eso de esta forma uno se reconfortaria sentir que no corre riesgo de bajar de donde lleg&amp;oacute; con esfuerzo, a partir de esta seguridad que nos brinda el juego uno puede proponerse mejorar y seguir subiendo en ranked.\n\n\nSí no se corre el riesgo de bajar no hay competitividad, sin competividad no hay porque mejorar.\n\nSubo hasta donde quiero, nunca más juego mejor, bajo de nivel, no bajo de rango, que bien, voy a poder seguir perdiendo y molestando a otra gente que quiere subir, jiji soy tan troll.\n\n\nAsí que no ¿Vale?","replies":[]},{"poster":"Yo sin Ella","date":"2017-12-24T02:30:29.802+0000","up_votes":1,"down_votes":0,"body":">-Primero me parece injusto que uno pueda bajar de ligas, habiendo ameritado subir todo ese paso hasta llegar a donde está, sea plata, oro, platino etc.\n\nFalso,gente paga por subir ligas,si bajaste pero mereces volver a donde estabas,sigue y sigue intentando y volverás. Si eres eloboosteado y no es el caso,bajarás.","replies":[]}]}