{"poster":"Pow4","date":"2016-10-04T11:38:00.887+0000","title":"Las kills no importan pero tampoco valen nada","subforum":"Charlas Generales","up_votes":1,"down_votes":4,"body":"Parece que los jugadores de hoy no ven nunca los scores en la partida apretando Tab o la tecla O, cuando juego support brand y voy 10-0-15 a nadie parece llamarle la atencion en lo mas minimo... y me tienen ignorado durante toda la partida pensando &quot;ah es solo support no pega nada&quot; .. cuando llevo mas items que todo el equipo jaja por lo feedeado... es realmente molesto tener que jugar asi siempre... creo que es algo basico estar mirando el score de cada uno mientras se juega para comparar las posibilidades. En una partida reciente, iba asi de feedeado con brand y tenia un compa&ntilde;ero adc que lo feedee e iba igual a mi... aun asi el resto no apoyaba y temia a las peleas de equipo creyendo que vamos a perder jajaja incluso mi adc no se creia que llevaba semejante cantidad de kills e items y no se animaba a luchar (huia siempre, aun cuando todo el equipo enemigo quedaba a un toque) xD! el equipo enemigo pueden imaginarse iban todos 2-12 3-10 y su mid era mas el support que iba 1-3-10 xD en fin, hice este post a modo de descargo XD y que puedan aprender algunos que lo lean... apretar Tab o la O mientras se juega mejora mucho.","replies":[{"poster":"Murzy","date":"2016-10-04T12:03:26.313+0000","up_votes":7,"down_votes":1,"body":"RIOT debería poner un psicólogo en el foro... haría mas guita aun....\n\nSaludos.-","replies":[{"poster":"Uli con azúcar","date":"2016-10-04T18:11:39.415+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Murzy,realm=LAS,application-id=v7qsfXsE,discussion-id=xRF6QVjs,comment-id=0001,timestamp=2016-10-04T12:03:26.313+0000)\n>\n> RIOT debería poner un psicólogo en el foro... haría mas guita aun....\n> \n> Saludos.-\n\nEs increíble las veces que me baitearon con títulos llamativos haciendome creer que abrirían un debate sobre el juego. Pero no, es para contar lo que les pasó en una partida en particular y que casualmente, siempre es una derrota.","replies":[]}]},{"poster":"JACKY FANBOY","date":"2016-10-04T11:58:38.124+0000","up_votes":4,"down_votes":0,"body":"Lol es un hermoso juego de estrategia arruinado por una generacion que crecio solo jugando street figther :V","replies":[{"poster":"rokushoger","date":"2016-10-04T17:45:33.364+0000","up_votes":1,"down_votes":0,"body":"Pa! que frase te mandaste! Te tengo que dejar un +1\nhttp://k40.kn3.net/taringa/6/7/0/6/5/3/0/lespauldaniel/5E7.jpg?154","replies":[]},{"poster":"resnov15","date":"2016-10-04T11:59:55.939+0000","up_votes":1,"down_votes":0,"body":"Aguante el Virtua Figther http://2dforever.com/wordpress/wp-content/uploads/2014/01/vf1.png","replies":[]}]},{"poster":"9081913DEL1","date":"2016-10-04T12:12:26.420+0000","up_votes":4,"down_votes":1,"body":"Te ignoran y no les importa porque no les estas aportando nada, en vez de carrearlos estas tratando de ser el carry cuando te toca ir support. Osea un troll pick. Vas 10/0, no podian ser esas kills para el adc?\n\nObviamente si yendo soporte te preocupas de fedearte vos el resto que paso una MALA fase de lineas va a dodgear todo lo posible las team fights.\n\nCuestion de logica.\n\nPara carrear siendo soporte dale la oportunidad a tu equipo, un brand soporte tiene una buena fase de lineas por el pick nomas, pero en cuanto a la tf solo es otro damager mas, bien papel y facil de matar.\n\nSaludos.","replies":[{"poster":"Pow4","date":"2016-10-04T14:09:38.343+0000","up_votes":1,"down_votes":3,"body":"> [{quoted}](name=Zelos From Jonia,realm=LAS,application-id=v7qsfXsE,discussion-id=xRF6QVjs,comment-id=0002,timestamp=2016-10-04T12:12:26.420+0000)\n>\n> Te ignoran y no les importa porque no les estas aportando nada, en vez de carrearlos estas tratando de ser el carry cuando te toca ir support. Osea un troll pick. Vas 10/0, no podian ser esas kills para el adc?\n> \n> Obviamente si yendo soporte te preocupas de fedearte vos el resto que paso una MALA fase de lineas va a dodgear todo lo posible las team fights.\n> \n> Cuestion de logica.\n> \n> Para carrear siendo soporte dale la oportunidad a tu equipo, un brand soporte tiene una buena fase de lineas por el pick nomas, pero en cuanto a la tf solo es otro damager mas, bien papel y facil de matar.\n> \n> Saludos.\n\nes un juego de equipo, carrear nada, todos tiene que aportar, pero ignorar al punto en el que no cuentan con el support solo por ser support no creen que tenga daño y eso por no ver los scores, creo que no leiste bien lo que escribi en el post cabezon repasa desde el principio a ver si podes aprender una o dos cosas de las que explico","replies":[]}]}]}