{"poster":"Raoul","date":"2016-02-26T20:15:50.235+0000","title":"Hey look, Rammus is in LCS games","subforum":"Gameplay","up_votes":160,"down_votes":8,"body":"We all know what this means. \r\nRIOT is already on it with the Nerf bat!\r\n\r\nLets all pray for poor rammus, whos again in for more nerfs to hold these boring tanks in line. ;_;","replies":[{"poster":"Critmaster Garen","date":"2016-02-26T20:50:00.436+0000","up_votes":87,"down_votes":2,"body":"cant have a champion counter those 3 adc comps.","replies":[{"poster":"Earl Eulrich","date":"2016-02-26T22:54:51.434+0000","up_votes":23,"down_votes":0,"body":"especially when they pick low-dps carries as they aren´t used to tanks not collapsing after the first 3 attacks.","replies":[{"poster":"YCitizenSnipsY","date":"2016-02-27T02:55:05.421+0000","up_votes":4,"down_votes":1,"body":"Lucian is a low DPS carry?","replies":[{"poster":"Earl Eulrich","date":"2016-02-27T04:02:17.809+0000","up_votes":20,"down_votes":1,"body":"absolutly, he relies on his 6hit spellweave combo to inflict serious dmg - and that will only get him so far. \n\nHe´s very strong in cleaning squishies lategame, but he really sucks at dealing with the frontline compared to a real dps-carry that will just keep shooting.","replies":[{"poster":"Hyrum Graff","date":"2016-02-27T04:59:45.777+0000","up_votes":3,"down_votes":6,"body":"> [{quoted}](name=Don Eulrich,realm=EUW,application-id=3ErqAdtq,discussion-id=jLkRldfh,comment-id=0006000000000000,timestamp=2016-02-27T04:02:17.809+0000)\n>\n> absolutly, he relies on his 6hit spellweave combo to inflict serious dmg - and that will only get him so far. \n> \n> He´s very strong in cleaning squishies lategame, but he really sucks at dealing with the frontline compared to a real dps-carry that will just keep shooting.\n\nEhh, if you run him with a bork, he's a pretty strong tank buster too. Not as strong as a vayne or kog, but by no means \"sucks\" at dealing with the front line. People seem to have forgotten that item exists, though.","replies":[{"poster":"Ratbert","date":"2016-02-27T05:13:12.581+0000","up_votes":14,"down_votes":1,"body":"He sucks compared to most other adcs in that area and botrk can be built on anyone anyways.","replies":[{"poster":"Hyrum Graff","date":"2016-02-27T06:37:25.090+0000","up_votes":4,"down_votes":0,"body":"> [{quoted}](name=Ratbert,realm=NA,application-id=3ErqAdtq,discussion-id=jLkRldfh,comment-id=000600000000000000010000,timestamp=2016-02-27T05:13:12.581+0000)\n>\n> He sucks compared to most other adcs in that area and botrk can be built on anyone anyways.\n\nHis passive applies bork. If he E-AA-Q-AA-W-AA-E-AA he gets 8 bork procs in succession. Bork deals 6% current hp, so that's 0.94^8=~60% => deals ~40% max hp from bork procs alone.","replies":[{"poster":"Xenos11111","date":"2016-02-27T07:12:09.896+0000","up_votes":3,"down_votes":0,"body":"That maths is wrong because he's dealing more damage with autos than BoRK procs so their %current HP will be lower. That and it's still physical damage which gets negated by armor.","replies":[{"poster":"Hyrum Graff","date":"2016-02-27T20:52:36.677+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Xenos11111,realm=EUW,application-id=3ErqAdtq,discussion-id=jLkRldfh,comment-id=00060000000000000001000000000000,timestamp=2016-02-27T07:12:09.896+0000)\n>\n> That maths is wrong because he's dealing more damage with autos than BoRK procs so their %current HP will be lower. That and it's still physical damage which gets negated by armor.\n\nGood point. Although the armor also works in the other direction: mitigation from armor -> higher hp on the next shot -> more damage from BoRK.","replies":[]}]}]}]}]},{"poster":"JJI744","date":"2016-02-27T16:56:55.475+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Don Eulrich,realm=EUW,application-id=3ErqAdtq,discussion-id=jLkRldfh,comment-id=0006000000000000,timestamp=2016-02-27T04:02:17.809+0000)\n>\n> absolutly, he relies on his 6hit spellweave combo to inflict serious dmg - and that will only get him so far. \n> \n> He´s very strong in cleaning squishies lategame, but he really sucks at dealing with the frontline compared to a real dps-carry that will just keep shooting.\n\nIDK about that, ever since Essance Reaver was changed, the caster ADCs have had much better sustained damage output. On the other hand, his passive procs thornmail and Rammus' DBC twice, leaving him more vunerable to a tank with thornmail than would be normal for a caster ADC.","replies":[]},{"poster":"Isedelica","date":"2016-02-27T11:23:58.299+0000","up_votes":1,"down_votes":0,"body":"please explain how to do the spellweave combo \nI feel like im using him wrong now","replies":[{"poster":"Red Silk","date":"2016-02-27T19:04:23.649+0000","up_votes":1,"down_votes":0,"body":"W-AA-Q-AA-E-AA-Repeat","replies":[{"poster":"Spaceman5pff","date":"2016-02-27T23:25:05.377+0000","up_votes":1,"down_votes":0,"body":"E-AA-Q-AA-W-AA-E-AA if you are positioned safely enough to start with E\n\nEDIT: Q sooner because it means you are going to have your q again more likely this way","replies":[]}]}]},{"poster":"MrBuffington","date":"2016-02-27T19:40:17.171+0000","up_votes":1,"down_votes":0,"body":"Oh, I thought it was just me. Granted, I still need a lot of practice on Lucian, but it's nice to know it's not *only* because I need practice.","replies":[]}]}]}]},{"poster":"Jeddy017","date":"2016-02-27T00:15:02.315+0000","up_votes":13,"down_votes":0,"body":"If only there were a certain type of champs that doesn't rely on auto attacks or attack damage.A type of champ that Rammus doesn't naturally counter.If only people brought out these champs more rather than running the 3 or 4 ADC comp.","replies":[]},{"poster":"OyddAWqJ5r","date":"2016-02-27T15:38:06.225+0000","up_votes":2,"down_votes":1,"body":"Seriously fuck Rammus he's OP as fuck right now. Cuz all the people abusing him know my allies will undoubtably pick some dumbass all ADC team and get rekt by him.\n\nIt's just plain unfair.","replies":[]}]},{"poster":"X8ViEhkPS0","date":"2016-02-26T20:34:16.186+0000","up_votes":37,"down_votes":1,"body":"They will nerf Rammus under the pretense of low counter play champion.","replies":[{"poster":"Desiderium","date":"2016-02-27T01:03:53.690+0000","up_votes":11,"down_votes":18,"body":"I mean, he IS a low counter play champion...If he's not a low counterplay champion, he sure as hell is a very BINARY champion. Extremely one-dimensional. Unfun to play against. \n\nHis role as an ADC counter doesn't mean anything. That can stay. That's a good thing. His gameplay needs to change. He is unfun.","replies":[{"poster":"resumed","date":"2016-02-27T01:24:06.460+0000","up_votes":38,"down_votes":4,"body":"whats unfun is seeing this teamcomp be viable\n\n{{champion:236}} {{champion:133}} {{champion:81}} {{champion:104}} {{champion:12}}","replies":[{"poster":"Silents429","date":"2016-02-27T03:13:25.798+0000","up_votes":1,"down_votes":5,"body":"{{champion:201}}  Bwahahaha","replies":[{"poster":"Baron Von Bangin","date":"2016-02-27T03:32:29.327+0000","up_votes":4,"down_votes":1,"body":"Braum will melt so quick, even with that shield up.","replies":[]}]}]},{"poster":"Zenthon Prime","date":"2016-02-27T01:49:34.385+0000","up_votes":10,"down_votes":1,"body":"He's binary, yes, but only really qualifies as \"unfun\" when you pick some stupid triple or quadra AD comp that he hard counters.\n\nHe is the definitive ADC counter.  If you pick three ADCs into a Rammus, you deserve to lose, just like if you pick multiple DoT mages into Galio or no CC into Kat.","replies":[{"poster":"TheImpLord","date":"2016-02-27T17:51:02.629+0000","up_votes":2,"down_votes":3,"body":"Riot has said before that fighting a champion should not have reliance on only picks. The only times I have ever had any amount of fun vs a rammus is as things like yorick  who can cock block him easily. \n\nIs it fun to be point and click taught ed by a sonic knockoff any time during the game? Not really.","replies":[{"poster":"Zenthon Prime","date":"2016-02-27T18:34:32.066+0000","up_votes":3,"down_votes":1,"body":"It's true that Riot doesn't want the game decided by picks.......usually.  However, that idea is actually used in the context of champions that can't be beaten without very specific matchups.  Rammus does not fall into that catagory.  Zero sustain, bad trading, generally meh damage, pretty mediocre against AP, shut down hard by heavy slows and roots, etc.\n\nSo yeah, Rammus has a wide variety of matchups he loses.  He hasn't changed much in the last several months, either.  The issue is that people are meta sheep and can't seem to realize that gee wizz, picking 3 ADCs into an anti-ADC champion is kinda stupid.","replies":[]},{"poster":"Knoyle","date":"2016-02-27T18:04:21.685+0000","up_votes":4,"down_votes":2,"body":"It's almost like he was DESIGNED to be an AD stomper or something.\n\n{{sticker:zombie-brand-mindblown}}","replies":[]},{"poster":"junglerboy16","date":"2016-02-27T21:28:21.624+0000","up_votes":1,"down_votes":0,"body":"Is it fun to die at any point in the game? Not really.\n\n**PLOX REMOVE DEATH RITO!**\n\nThe very nature of a competitive multiplayer game is that at some point in the game, one player will have to not have fun for another player to have fun (just think about it, every time you have the best game of your life and win, someone on the other side just had the worst game ever and lost). Otherwise you've got a Co-op vs AI game instead of a MOBA. Just because CC isn't fun, or dying isn't fun, or getting bursted by a Graves isn't fun doesn't mean it shouldn't belong in the game.","replies":[{"poster":"TheImpLord","date":"2016-02-28T21:45:17.360+0000","up_votes":1,"down_votes":0,"body":"Karthus is a champ who has fun in death.","replies":[{"poster":"junglerboy16","date":"2016-02-29T02:20:23.218+0000","up_votes":1,"down_votes":0,"body":"He is an exception and still doesn't enjoy the 60+ seconds where he's staring at a gray screen late game.","replies":[]}]}]}]}]}]},{"poster":"Slamurai Jack","date":"2016-02-27T00:06:48.220+0000","up_votes":4,"down_votes":31,"body":"And they will be right to do so. I don't care if he can jungle, but he should not be able to top lane. Taking him there circumvents his intended weakness of slow clear speed and lets him dominate any AD top laner 1v1 with almost no counterplay for a free lane.","replies":[{"poster":"Matezoide","date":"2016-02-27T15:13:05.629+0000","up_votes":4,"down_votes":1,"body":"Meanwhile ranged AD top hard counter most Melees and nobody bats an eye.\n\nRammus is weak as hell early game, cant clear waves, cant trade for shit and has terrible kill pressure. The sole reason he is seeing play is because he does well in the current meta and Malphite got nerfed.","replies":[{"poster":"Slamurai Jack","date":"2016-02-27T15:30:50.917+0000","up_votes":1,"down_votes":8,"body":"And yet, despite all that, he has a 56% winrate in top lane. That's pretty good for a champ with a weak as hell early game, can't clear waves, can't trade for shit, and has terrible kill pressure.","replies":[{"poster":"Westonbirt","date":"2016-02-27T15:57:12.534+0000","up_votes":5,"down_votes":1,"body":"_That's because he's very specifically countering ranged AD top._","replies":[{"poster":"Slamurai Jack","date":"2016-02-27T16:08:09.753+0000","up_votes":1,"down_votes":6,"body":"And countering melee AD top. And other tanks. ","replies":[{"poster":"Westonbirt","date":"2016-02-27T17:05:32.570+0000","up_votes":2,"down_votes":0,"body":"To a degree, but not nearly as much. The biggest reason why Rammus counters ADCs is because they rely on autoattacks to deal damage while Rammus relies on being autoattacked to deal damage. Bruisers might not dent Rammus but then again they wouldn't do shit to Malphite or Taric either.","replies":[]}]}]}]}]}]}]},{"poster":"NommyPancake","date":"2016-02-27T01:05:53.990+0000","up_votes":24,"down_votes":0,"body":"\"We ask Rammus whether we should nerf him or not,\nall he said is: '{{champion:33}} ok.'  \nTherefore we nerf him\"\n\n:^)","replies":[]},{"poster":"Aj Grimoire","date":"2016-02-26T20:26:29.201+0000","up_votes":8,"down_votes":0,"body":"{{champion:33}} Okay.","replies":[]},{"poster":"LaughingStapler","date":"2016-02-26T22:53:08.488+0000","up_votes":7,"down_votes":1,"body":"He might get nerfed due to top lane but he'll probably get buffed for his jg to compensate. Still, I'm not even sure he merits a nerf since he just counters the meta very well. If it was all Lulu/Karma/Zilean/Kayle etc. top, he wouldn't be picked.","replies":[{"poster":"SpecterVonBaren","date":"2016-02-26T23:44:45.668+0000","up_votes":7,"down_votes":0,"body":"Ironic you say that when Lulu got both her solo lane and support capabilities nerfed and now no one in competitive plays her as a support.","replies":[{"poster":"WadeWilson1337","date":"2016-02-27T00:03:05.266+0000","up_votes":1,"down_votes":2,"body":"Lulu doesnt work in support because she lacks pick potential and scales quite well with ap, so putting some gold into her via farm is far more valuable than have her rocking the typical support wallet with items such as Locket.","replies":[{"poster":"SpecterVonBaren","date":"2016-02-27T00:09:14.378+0000","up_votes":6,"down_votes":3,"body":"She does work as a support.... She was actually played only as a support til LCS took her mid and then she got nerfed til LCS ONLY took her solo. Plus Riot hates all utility supports not named Janna because I guess she just gets to be a special snowflake while all the other utility supports get to be nerfed or hard countered by all the tanky hard engage ones.","replies":[{"poster":"Lucifer","date":"2016-02-27T02:36:58.995+0000","up_votes":9,"down_votes":1,"body":"Janna has been nerfed more than any of the other supports in the game. Soraka and Sona follow her in a distant second.","replies":[{"poster":"SpecterVonBaren","date":"2016-02-27T02:57:48.979+0000","up_votes":1,"down_votes":3,"body":"And yet she's STILL been one of the top supports in the game for all that time and has never fallen out of favor.","replies":[{"poster":"Ratbert","date":"2016-02-27T05:14:27.324+0000","up_votes":6,"down_votes":1,"body":"Because adcs haven't.\nGuess who synergizes the most with adcs and can peel for them the hardest.","replies":[{"poster":"SpecterVonBaren","date":"2016-02-27T05:29:40.703+0000","up_votes":1,"down_votes":3,"body":"Then perhaps Riot should nerf her more so that other utility supports can see the limelight. Riot has no qualms doing it to so many other champs for the sake of letting others be strong for a time, as they've said so themselves.","replies":[{"poster":"Ratbert","date":"2016-02-27T05:53:39.904+0000","up_votes":5,"down_votes":0,"body":"Except they already have way back, then nerfed all utility supports because reasons, then repeated nerfs again once the supports found that they were better played solo because they couldn't support as well as before. Now, nerfing janna more just means there won't be any utility supports left because tanks,** utility mages**, and kill lanes will be better then.","replies":[]},{"poster":"Voluug13","date":"2016-02-27T06:36:50.938+0000","up_votes":2,"down_votes":0,"body":"The problem here arent Janna or the AP utility supports.\n\nIts the tanky supports that shove out squishier supports that only Janna (And Morgana) can counterpick.\n\nThat is it tbh, Janna is only a miserable counterpick that is popular because {{champion:412}} {{champion:111}} {{champion:12}} {{champion:201}} are the most popular and powerful in botlane.\n\nIn fact Janna, as a low damage shielding anti-engagement support is naturally countered by poke/sustain supports like Sona/Soraka/Lulu/Karma.","replies":[{"poster":"SpecterVonBaren","date":"2016-02-27T17:48:43.361+0000","up_votes":1,"down_votes":0,"body":"Hhm.... I hadn't thought of it like that. I really wish Riot would just go for a quick round of nerfing hard engage sups (Just a few small nerfs across the board) and give all the utility sups a round of small buffs.","replies":[]}]}]}]}]}]},{"poster":"The Governer","date":"2016-02-27T02:11:09.049+0000","up_votes":4,"down_votes":0,"body":"Then you realized the last time Janna was changed she was nerfed. Not so \"special snowflake\" am I right?","replies":[{"poster":"SpecterVonBaren","date":"2016-02-27T03:01:35.378+0000","up_votes":1,"down_votes":4,"body":"Other utility sups get nerfed until they're never seen again if they so much as snif competitive play but Janna gets to ALWAYS be good.","replies":[{"poster":"Voluug13","date":"2016-02-27T06:37:57.073+0000","up_votes":4,"down_votes":0,"body":"Because she is a counterplay to the most picked supports (engage tanky supports). Same reason why Malza has high winrate despite all his kit problems.","replies":[]}]}]}]}]}]}]}]}