{"poster":"DragonBlood28","date":"2019-03-08T18:42:43.069+0000","title":"Fiora Rework","subforum":"Champions & Gameplay","up_votes":2,"down_votes":6,"body":"Hallo ich hab Fiora vor ihren Rework gemaint und jetzt Main ich sie auch aber jetzt mal klar Text ich komme nicht drüber Weck das Fiora so ein sch*** rework bekommen hat das beste von allen war ihre ult und die habt ihr so sowas gepackt gut ja sie ult macht mega danage von der neuen Fiora und wenn man geübt ist kann man mit Leichtigkeit alle vitalpunkte treffen um den heal zu aktivieren aber ihn Teamfight kackt sie so richtig wegen den cc hat mein fast keine Chance in teamfight richtig einzugreifen das bei der alten Fiora kein Problem war ich meine ich kann verstehen das in euren Augen die alte Fiora zu op war aber dann hätte ihr sie einfach nerven können die alte Fiora hat einfach so viel Spaß gemacht und hey bei nem spiel geht’s ja um Spaß es ist ja ein Game und viele alte Fiora Main trauern der alten immer noch nach wie ich und darum bitte ich euch sie zurück zubringen vor allem um den alten Fiora Main endlich wieder ihren spiel Spaß gewährleisten zu können ich bitte inständig das ihr die alte Fiora wieder zurück bring ~DragonBlood28","replies":[{"poster":"DragonBlood28","date":"2019-03-08T19:25:33.908+0000","up_votes":1,"down_votes":0,"body":"Ihr könnt sagen was ihr wollt aber solange ihr Fiora nicht gemaint habt vor ihr rework oder ihren Spielstyle gemocht seit ihr nicht dazu ihn der Lage das zu verstehen Vorfallen es ist ein Game ist gibt viele Op Champs und außerdem möchte ich mal euren Gesichtsausdruck sehen wenn euer Main Champ ein rework bekommt den man schon Jahre lang zockt über alles liebt und Spaß daran gehabt habt klar ist es leicht zu sagen ja wegen den und wegen das darum ist es gut so klar das kann jeder sagen einfach Die Meinung von Riot nachäffen oder irgedwelche sinnlose Gründe dienen nicht rechtfertigen aber verstehen tun es nur die wenigsten","replies":[{"poster":"This is Destıny","date":"2019-03-08T19:31:57.862+0000","up_votes":1,"down_votes":1,"body":"Was du labberst is totaler Bullshit die neue Fiora is ein Splitpusher und einer der Stärksten 1 v 1 Champs wenn man denn W richtig nutzt kann man auch in Teamfights schnell die Vital Punkte Treffen. Deswegen nimmt man im 2 Tree für die Runen Nimbus Cloak mit für Movementspeed nachdem die Ult gecastet wurde. Ich denke mal du bist der der nicht weiß wie man Fiora zu spielen hat.","replies":[{"poster":"DragonBlood28","date":"2019-03-08T19:39:16.147+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ωard your Lane,realm=EUW,application-id=Wj1wcocU,discussion-id=GlHRr3Yd,comment-id=00020000,timestamp=2019-03-08T19:31:57.862+0000)\n>\n> Was du labberst is totaler Bullshit die neue Fiora is ein Splitpusher und einer der Stärksten 1 v 1 Champs wenn man denn W richtig nutzt kann man auch in Teamfights schnell die Vital Punkte Treffen. Deswegen nimmt man im 2 Tree für die Runen Nimbus Cloak mit für Movementspeed nachdem die Ult gecastet wurde. Ich denke mal du bist der der nicht weiß wie man Fiora zu spielen hat.\n\nWas laberst du für scheiße ich schreib schon die ganze Zeit das ich die neue Fiora auch Maine denkst du mir ist nicht bewusst was sie kann ist dein Omg Brain afk","replies":[{"poster":"This is Destıny","date":"2019-03-08T19:43:10.947+0000","up_votes":1,"down_votes":1,"body":"Nicer Satzbau xD. Scheint nicht so als wüsstest du es","replies":[{"poster":"DragonBlood28","date":"2019-03-08T19:51:53.609+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ωard your Lane,realm=EUW,application-id=Wj1wcocU,discussion-id=GlHRr3Yd,comment-id=0002000000000000,timestamp=2019-03-08T19:43:10.947+0000)\n>\n> Nicer Satzbau xD. Scheint nicht so als wüsstest du es\n\nAlleine schon wenn man den Satzbau mehr als den Inhalt vorzieht sagt schon alles über dich aus manche meinen sie müssen ein auf deutsch Lehrer machen um zu provozieren naja egal solange man versteht was ich meine ist alles gut .du versteht einscheinend denn Sinn einer Sprache nicht xD es geht darum die andere Leute zu verstehen oh man","replies":[{"poster":"This is Destıny","date":"2019-03-08T20:05:08.305+0000","up_votes":1,"down_votes":0,"body":"Sagst man soll Satzbau nicht vorziehen und fängst dann an davon zu reden das ich die Sprache nicht verstehe aha macht Sinn xD. Sherlock","replies":[{"poster":"DragonBlood28","date":"2019-03-08T20:06:46.810+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ωard your Lane,realm=EUW,application-id=Wj1wcocU,discussion-id=GlHRr3Yd,comment-id=000200000000000000000000,timestamp=2019-03-08T20:05:08.305+0000)\n>\n> Sagst man soll Satzbau nicht vorziehen und fängst dann an davon zu reden das ich die Sprache nicht verstehe aha macht Sinn xD. Sherlock\n\nÄh ja das ergibt eig Sinn wow das wundert mich grade das du das auch nicht kappierst xD ja ja","replies":[{"poster":"This is Destıny","date":"2019-03-08T20:08:01.813+0000","up_votes":1,"down_votes":0,"body":"Nein tut es nicht weil es sich widerspricht du  Vogel...","replies":[{"poster":"DragonBlood28","date":"2019-03-08T20:09:23.153+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ωard your Lane,realm=EUW,application-id=Wj1wcocU,discussion-id=GlHRr3Yd,comment-id=00020000000000000000000000000000,timestamp=2019-03-08T20:08:01.813+0000)\n>\n> Nein tut es nicht weil es sich widerspricht du  Vogel...\n\nNope eben nicht du intelligenzbestie😂","replies":[{"poster":"DragonBlood28","date":"2019-03-08T20:13:40.692+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=DragonBlood28,realm=EUW,application-id=Wj1wcocU,discussion-id=GlHRr3Yd,comment-id=000200000000000000000000000000000000,timestamp=2019-03-08T20:09:23.153+0000)\n>\n> Nope eben nicht du intelligenzbestie😂\n\nIch hab gesagt du verstehst denn Sinn einer Sprache nicht den Sinn warum eine Sprache existiert es geht nicht darum wie andere Ihr Sätze sagen ob es grammatikalisch falsch ist oder nicht es geht darum den jedenigen zu verstehen was er meint und genau das verstehst du nicht","replies":[{"poster":"Alpacana","date":"2019-03-08T20:57:01.523+0000","up_votes":1,"down_votes":0,"body":"Eine korrekte Rechtschreibung und die richtige Anwendung von Grammatik macht es allerdings auch um einiges einfacher, dass sein Gegenüber einen versteht.\nDu kannst ja auch nicht jemanden annuscheln und ihn dann dafür verantwortlich machen, wenn er dich nicht versteht. Das Problem liegt dann an dir, nicht an demjenigen, der dich verstehen möchte, auch wenn zugegebenermaßen \"ωard your Lane \" nicht sehr freundlich reagiert hat (du allerdings auch genauso wenig).","replies":[{"poster":"DragonBlood28","date":"2019-03-08T21:05:27.558+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Alpacana,realm=EUW,application-id=Wj1wcocU,discussion-id=GlHRr3Yd,comment-id=00020000000000000000000000000000000000000001,timestamp=2019-03-08T20:57:01.523+0000)\n>\n> Eine korrekte Rechtschreibung und die richtige Anwendung von Grammatik macht es allerdings auch um einiges einfacher, dass sein Gegenüber einen versteht.\n> Du kannst ja auch nicht jemanden annuscheln und ihn dann dafür verantwortlich machen, wenn er dich nicht versteht. Das Problem liegt dann an dir, nicht an demjenigen, der dich verstehen möchte, auch wenn zugegebenermaßen \"ωard your Lane \" nicht sehr freundlich reagiert hat (du allerdings auch genauso wenig).\n\nDas liegt daran weil ich mittlerweile genervt bin verständlicher weiße und komischer weiße reicht aber meine Rechtschreibung immer aus um mir ständig antworten zu können und argumentieren ähm ja","replies":[{"poster":"Alpacana","date":"2019-03-08T21:11:33.581+0000","up_votes":1,"down_votes":0,"body":"Naja schon in deinem Anfangsthread lässt deine Grammatik zu wünschen übrig...\nIch versuche hier lediglich den Sinn eines jeden Posts zu erschließen und antworte dementsprechend. Es kann natürlich auch vorkommen, dass mir dies nicht gelingt und ich auch nachfragen muss (wie ich es ja weiter unten auch schon getan habe).\nIch denke aber trotzdem sollte man auch den Anstand haben seinen Mitmenschen in einem ordentlichen Deutsch zu schreiben, das macht die ganze Kommuinkation einfach deutlich angenehmer und einfacher.\nWenn du nicht willst, dass wir hier auf deine Kommentare antworten, bist du hier eindeutig falsch. Dies ist das Community-Forum und auf jeden Post der hier geschrieben wird, wird eben mit der Meinung der Community (die sich übrigens auch untereinander differenzieren kann) beantwortet.\nWenn du nicht möchtest, dass hier diskutiert und argumentiert wird schlage ich dir vor ein Note-Pad zu öffnen und dort deinen Post zu verfassen, anstelle ihn **online** in ein **Community-Forum** zu posten.","replies":[{"poster":"Alpacana","date":"2019-03-08T21:34:15.411+0000","up_votes":2,"down_votes":0,"body":"Wie schon weiter unten bereits mehrmals erwähnt:\n1. in einem deutschsprachigem Forum wirst du keinen Riotler antreffen, der in dieser Hinsicht etwas ausrichten kann. Da solltest du eher einen ausführlichen Post im englischen Forum oder auf Reddit schreiben in der Hoffnung, dass der Post Riot erreicht.\n2. mit dieser Forderung kommst du 4 Jahre zu spät. Nach 4 Jahren werden sie an diesem Rework nichts mehr ändern, da hättest du eindeutig früher kommen müssen. Zudem dann noch die Frage ist, ob du mit deiner Forderung in der Mehrheit bist und wirklich viele Spieler die alte Fiora über die neue präferieren. Das bezweifel ich nämlich auch stark.","replies":[]},{"poster":"DragonBlood28","date":"2019-03-08T21:28:51.077+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Alpacana,realm=EUW,application-id=Wj1wcocU,discussion-id=GlHRr3Yd,comment-id=00020000000000000000000000000000000000000001000000000004,timestamp=2019-03-08T21:26:38.640+0000)\n>\n> Das Thema hatten wir bereits weiter unten schon, worauf ich bis jetzt übrigens immer noch keine Antwort bekommen habe.\n> Ich bin nicht hier um dich in irgendeiner Art und Weise anzugreifen, ich starte meine Posts sogar mit Sachen wie: \n> \n> Ich nehme durchaus Rücksicht auf menschliche Emotionen, allerdings habe ich dir nicht schlechtes getan und dennoch antwortest du mit einem negativ, passiv-agressivem Satz wie:\n> \n> Ein \"paar\" Rechtschreibfehler sind es übrigens auch nicht. In wirklich **jedem** deiner Antworten finde ich mindestens einen Rechtschreibfehler oder Grammatikfehler. Dich dann trotzdem noch zu verestehen ist wirklich nicht leicht und ich meine es auch gar nicht böse, aber wenn du dich hier mit Menschen unterhalten willst solltest du wirklich gesellschaftliche Regeln wie Rechtschreibung und Höflichkeit beachten.\n\nIch möchte die alte Fiora wieder zurück das ist es was ich möchte","replies":[]},{"poster":"Alpacana","date":"2019-03-08T21:26:38.640+0000","up_votes":1,"down_votes":0,"body":"Das Thema hatten wir bereits weiter unten schon, worauf ich bis jetzt übrigens immer noch keine Antwort bekommen habe.\nIch bin nicht hier um dich in irgendeiner Art und Weise anzugreifen, ich starte meine Posts sogar mit Sachen wie: \n> Klar ist es ziemlich enttäuschend wenn dein Main gereworked wird. \n\nIch nehme durchaus Rücksicht auf menschliche Emotionen, allerdings habe ich dir nichts Schlechtes getan und dennoch antwortest du mit einem negativ, passiv-agressivem Satz wie:\n> Sry aber darauf antworte ich jetzt nicht weil wenn du nachdem was ich alles geschrieben hab immer noch Nicht gecheckt hast worauf ich hinaus will dann bringt es dir auch nicht wenn ich es dir erkläre du bist Anscheind nicht dazu in der Lage es zu versteh darum lass ich es\n\nEin \"paar\" Rechtschreibfehler sind es übrigens auch nicht. In wirklich **jedem** deiner Antworten finde ich mindestens einen Rechtschreibfehler oder Grammatikfehler. Dich dann trotzdem noch zu verstehen ist wirklich nicht leicht und ich meine es auch gar nicht böse, aber wenn du dich hier mit Menschen unterhalten willst solltest du wirklich gesellschaftliche Regeln wie Rechtschreibung und Höflichkeit beachten.","replies":[]},{"poster":"DragonBlood28","date":"2019-03-08T21:18:08.413+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=DragonBlood28,realm=EUW,application-id=Wj1wcocU,discussion-id=GlHRr3Yd,comment-id=00020000000000000000000000000000000000000001000000000000,timestamp=2019-03-08T21:14:12.760+0000)\n>\n> Sowas denke ich nicht hab ich auch nicht gesagt und ist wieder vollkommen falsch interpetiert und verstanden worden\n\nLern bitte erstmal wie menschliche Emotionen funktionieren dann kannst du mich auch besser nachvollziehen und ich weiß das ein paar Rechtschreibfehler drin sind aber sry nur ein Idiot checkt nicht was ist damit sagen will alleine die letzten zwei Sätze sagen doch alles also bitte dann streng deine Gehirnzellen an dann schaffst es vlt irgendwann zu verstehen was ich jetzt eig will","replies":[]},{"poster":"Alpacana","date":"2019-03-08T21:15:38.255+0000","up_votes":1,"down_votes":0,"body":"Dann erkläre dich bitte richtig @TE.\nIch habe hier lediglich meine Meinung über die Benutzung der deutschen Sprache kundgetan und dir klar gemacht, dass in einem Community-Forum eben diskutiert und argumentiert wird.","replies":[]},{"poster":"DragonBlood28","date":"2019-03-08T21:14:12.760+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Alpacana,realm=EUW,application-id=Wj1wcocU,discussion-id=GlHRr3Yd,comment-id=0002000000000000000000000000000000000000000100000000,timestamp=2019-03-08T21:11:33.581+0000)\n>\n> Naja schon in deinem Anfangsthread lässt deine Grammatik zu wünschen übrig...\n> Ich versuche hier lediglich den Sinn eines jeden Posts zu erschließen und antworte dementsprechend. Es kann natürlich auch vorkommen, dass mir dies nicht gelingt und ich auch nachfragen muss (wie ich es ja weiter unten auch schon getan habe).\n> Ich denke aber trotzdem sollte man auch den Anstand haben seinen Mitmenschen in einem ordentlichen Deutsch zu schreiben, das macht die ganze Kommunkation einfach deutlich angenehmer und einfacher.\n> Wenn du nicht willst, dass wir hier auf deine Kommentare antworten, bist du hier eindeutig falsch. Dies ist das Community-Forum und bei jedem Post der hier geschrieben wird, wird eben mit der Meinung der Community (die sich übrigens auch untereinander differenzieren kann) beantwortet.\n> Wenn du nicht möchtest, dass hier diskutiert und argumentiert wird schlage ich dir vor ein Note-Pad zu öffnen und dort deinen Post zu verfassen, anstelle ihn **online** in ein **Community-Forum** zu posten.\n\nSowas denke ich nicht hab ich auch nicht gesagt und ist wieder vollkommen falsch interpetiert und verstanden worden","replies":[]}]}]}]},{"poster":"This is Destıny","date":"2019-03-08T20:50:08.839+0000","up_votes":2,"down_votes":0,"body":"Naja gammel weiter auf deiner Bronze Elo rum scheinst ja ein richtig guter Fiora main zu sein mit einer 43% wr. werde hierzu jetzt nix mehr schreiben da es eh nix bringt. Da du totall uneinsichtig bist","replies":[{"poster":"DragonBlood28","date":"2019-03-08T20:56:59.790+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ωard your Lane,realm=EUW,application-id=Wj1wcocU,discussion-id=GlHRr3Yd,comment-id=00020000000000000000000000000000000000000000,timestamp=2019-03-08T20:50:08.839+0000)\n>\n> Naja gammel weiter auf deiner Bronze Elo rum scheinst ja ein richtig guter Fiora main zu sein mit einer 43% wr. werde hierzu jetzt nix mehr schreiben da es eh nix bringt. Da du totall uneinsichtig bist\n\nWenn du meinst ^^","replies":[{"poster":"DragonBlood28","date":"2019-03-08T21:04:03.430+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=DragonBlood28,realm=EUW,application-id=Wj1wcocU,discussion-id=GlHRr3Yd,comment-id=000200000000000000000000000000000000000000000000,timestamp=2019-03-08T20:56:59.790+0000)\n>\n> Wenn du meinst ^^\n\nOh man du bist echt nicht der hellste du erwartest echt das ich auf jemanden hör der von Anfang an nur scheiße laber und am beleidigen ist . Und mag sein das ich nur Silver Player bin aber lieber Silver als mit einen erbsen Hirn ausgestattet zu sein :P","replies":[]}]}]}]},{"poster":"DragonBlood28","date":"2019-03-08T20:15:01.271+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=DragonBlood28,realm=EUW,application-id=Wj1wcocU,discussion-id=GlHRr3Yd,comment-id=000200000000000000000000000000000000,timestamp=2019-03-08T20:09:23.153+0000)\n>\n> Nope eben nicht du intelligenzbestie😂\n\nDas einzige was du tust ist irgend ein scheiß zu labern und beleidigend zu sein mehr steckt nicht dahinter sry aber ich finde das einfach erbärmlich","replies":[]}]}]}]},{"poster":"DragonBlood28","date":"2019-03-08T20:08:26.178+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ωard your Lane,realm=EUW,application-id=Wj1wcocU,discussion-id=GlHRr3Yd,comment-id=000200000000000000000000,timestamp=2019-03-08T20:05:08.305+0000)\n>\n> Sagst man soll Satzbau nicht vorziehen und fängst dann an davon zu reden das ich die Sprache nicht verstehe aha macht Sinn xD. Sherlock\n\nWow du bist exakt das Beispiele wo ich oben genannt habe omg 😂😂😂😂😂😂😂 fuck aber 1 zu 1 sry das ich grade zu geil","replies":[]}]}]},{"poster":"DragonBlood28","date":"2019-03-08T19:55:04.408+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ωard your Lane,realm=EUW,application-id=Wj1wcocU,discussion-id=GlHRr3Yd,comment-id=0002000000000000,timestamp=2019-03-08T19:43:10.947+0000)\n>\n> Nicer Satzbau xD. Scheint nicht so als wüsstest du es\n\nWie ich mich Ausdrücke  bestimmt natürlich auch darüber ob ich etwas weiß oder nicht 😂😂 alles klar","replies":[{"poster":"DragonBlood28","date":"2019-03-08T20:02:33.359+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=DragonBlood28,realm=EUW,application-id=Wj1wcocU,discussion-id=GlHRr3Yd,comment-id=00020000000000000001,timestamp=2019-03-08T19:55:04.408+0000)\n>\n> Wie ich mich Ausdrücke  bestimmt natürlich auch darüber ob ich etwas weiß oder nicht 😂😂 alles klar\n\nBeim nächsten mal achte ich auf meine Rechtschreibung damit dein minderentwickeltes Gehirn überhaupt erfassen kann was ich damit sagen will :0","replies":[]}]}]},{"poster":"DragonBlood28","date":"2019-03-08T19:45:20.617+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=DragonBlood28,realm=EUW,application-id=Wj1wcocU,discussion-id=GlHRr3Yd,comment-id=000200000000,timestamp=2019-03-08T19:39:16.147+0000)\n>\n> Was laberst du für scheiße ich schreib schon die ganze Zeit das ich die neue Fiora auch Maine denkst du mir ist nicht bewusst was sie kann ist dein Omg Brain afk\n\nAlleine schon das du schreibst das ich keine Fiora spielen kann alleine des schon daran merkt man schon das du einfach nur dumm bist","replies":[{"poster":"DragonBlood28","date":"2019-03-08T19:46:19.070+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=DragonBlood28,realm=EUW,application-id=Wj1wcocU,discussion-id=GlHRr3Yd,comment-id=0002000000000001,timestamp=2019-03-08T19:45:20.617+0000)\n>\n> Alleine schon das du schreibst das ich keine Fiora spielen kann alleine des schon daran merkt man schon das du einfach nur dumm bist\n\nIst nicht grade hilfreiche und wissen tust  du es auch nicht nicht mehr als irgendeine Vermutung die am Ende eh nicht stimmt aber hey Hauptsache seine Meinung sagen oder ?","replies":[{"poster":"ImTheFox115","date":"2019-03-08T21:02:00.384+0000","up_votes":1,"down_votes":0,"body":"Das Rework ist doch schon ewig her xD\nUnd wenn du die neue Fiora nicht magst kannst du ja ehnfach den CHamp wechseln :D\nDann kommst du bl auch wieder aus Bronze raus...","replies":[]}]}]}]}]},{"poster":"Alpacana","date":"2019-03-08T19:33:51.354+0000","up_votes":2,"down_votes":1,"body":"Klar ist es ziemlich enttäuschend wenn dein Main gereworked wird. Allerdings wirst du dagegen nicht viel machen können, ist ja schließlich das Game von Riot Games und wenn sie meinen der Champ verdient ein Rework dann ist das nunmal so.\nEs bleibt einem dann also 2 Möglichkeiten. \n1. Man passt sich dem neuen Playstyle des Champs an und bleibt dabei, dass es sein Main ist. Klar muss der Champ mehr oder weniger neu erlernt werden, aber vielleicht bringt einen das ja sogar weiter als mit dem alten Champ ;) Riot beachtet bei Reworks zum Glück ja, den Style des Champions bei einem Rework möglichst beizubehalten.\nBeispiel Akali: Ein Assassine, der mit Stealth arbeitet und Dashes besitzt.\nBeispiel Katarina: Im Grunde die alte Katarina mit dem Unterschied, dass es sich \"smoother\" anfühlt zu spielen und nicht nur stumpfes E, W, R Gedrücke. Dashes wurden beibehalten, Playstyle wurde im Grunde komplett übernommen.\nEs kann allerdings natürlich auch passieren, dass Champions nicht mehr in das Bild des modernen League of Legends passen und komplett überarbeitet werden müssen.\nBeispiel Sion: Vom Burst-Mage/AD-Bruiser zum Super-Tank (wobei man auch hier sagen kann: rein theoretisch kannst du ja noch Full Lethality Sion spielen).\n2. Man lässt es sein und sucht sich eben einen neuen Main.\n\nFiora hat nicht den kompletten Playstyle übernommen, ein komplett anderer Champion ist sie aber auch nicht geworden. Demnach hast du nichtmal besonders viel Pech mit dem Rework, es könnte schlimmer sein. Fiora ist immernoch ein Duellant, der jetzt eben auf die Rolle des Splitpushers getrimmt wurde.\n\nWir versuchen dir hier lediglich zu helfen wieder Spaß an deinem Champion zu finden und dir Tipps zu geben.","replies":[{"poster":"DragonBlood28","date":"2019-03-08T19:42:40.117+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Alpacana,realm=EUW,application-id=Wj1wcocU,discussion-id=GlHRr3Yd,comment-id=00020001,timestamp=2019-03-08T19:33:51.354+0000)\n>\n> Klar ist es ziemlich enttäuschend wenn dein Main gereworked wird. Allerdings wirst du dagegen nicht viel machen können, ist ja schließlich das Game von Riot Games und wenn sie meinen der Champ verdient ein Rework dann ist das nunmal so.\n> Es bleibt einem dann also 2 Möglichkeiten. \n> 1. Man passt sich dem neuen Playstyle des Champs an und bleibt dabei, dass es sein Main ist. Klar muss der Champ mehr oder weniger neu erlernt werden, aber vielleicht bringt einen das ja sogar weiter als mit dem alten Champ ;) Riot beachtet bei Reworks zum Glück ja, den Style des Champions bei einem Rework möglichst beizubehalten.\n> Beispiel Akali: Ein Assassine, der mit Stealth arbeitet und Dashes besitzt.\n> Beispiel Katarina: Im Grunde die alte Katarina mit dem Unterschied, dass es sich \"smoother\" anfühlt zu spielen und nicht nur stumpfes E, W, R Gedrücke. Dashes wurden beibehalten, Playstyle wurde im Grunde komplett übernommen.\n> Es kann allerdings natürlich auch passieren, dass Champions nicht mehr in das Bild des modernen League of Legends passen und komplett überarbeitet werden müssen.\n> Beispiel Sion: Vom Burst-Mage/AD-Bruiser zum Super-Tank.\n> 2. Man lässt es sein und sucht sich eben einen neuen Main.\n> \n> Fiora hat nicht den kompletten Playstyle übernommen, ein komplett anderer Champion ist sie aber auch nicht geworden. Demnach hast du nichtmal besonders viel Pech mit dem Rework, es könnte schlimmer sein. Fiora ist immernoch ein Duellant, der jetzt eben auf die Rolle des Splitpushers getrimmt wurde.\n> \n> Wir versuchen dir hier lediglich zu helfen, wieder Spaß an deinem Champion zu finden und dir Tipps zu geben.\n\nAlso das war wohl klar das sie ung gleich bleibt weil dann hätten sie gleich nen neuen Champ machen müssen du brauchst Dir nicht ständig was einfallen lassen alles war ihr sagt weiß ich schon längst checkt ihr es einfach nicht das ich tzd alle denn die alte Fiora zurück haben eure Texte mit anderen Worten ich soll mich mit der alten Fiora zufrieden geben  und genau das werd ich eben nicht","replies":[{"poster":"Alpacana","date":"2019-03-08T19:44:57.627+0000","up_votes":1,"down_votes":0,"body":"Naja was bleibt dir denn sonst übrig? Rein theoretisch könntest du Riot Games aufkaufen und die alte Fiora zurückbringen, ich bezweifel aber, dass das im Bereich deiner Möglichkeiten liegt...\n\nAber einfach mal anders gefragt: Was ist der Sinn deines Posts? Was möchtest du erreichen?","replies":[{"poster":"DragonBlood28","date":"2019-03-08T19:49:43.364+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Alpacana,realm=EUW,application-id=Wj1wcocU,discussion-id=GlHRr3Yd,comment-id=0002000100000000,timestamp=2019-03-08T19:44:57.627+0000)\n>\n> Naja was bleibt dir denn sonst übrig? Rein theoretisch könntest du Riot Games aufkaufen und die alte Fiora zurückbringen, ich bezweifel aber, dass das im Bereich deiner Möglichkeiten liegt...\n> \n> Aber einfach mal anders gefragt: Was ist der Sinn deines Posts? Was möchtest du erreichen?\n\nSry aber darauf antworte ich jetzt nicht weil wenn du nachdem was ich alles geschrieben hab immer noch Nicht gecheckt hast worauf ich hinaus will dann bringt es dir auch nicht wenn ich es dir erkläre du bist Anscheind nicht dazu in der Lage es zu versteh darum lass ich es","replies":[{"poster":"Alpacana","date":"2019-03-08T20:02:58.671+0000","up_votes":2,"down_votes":0,"body":"Ich zitiere einfach mal deinen Ausgangsthread:\n\n> und darum bitte ich euch sie zurück zubringen vor allem um den alten Fiora Main endlich wieder ihren spiel Spaß gewährleisten zu können\n\nWenn ich das richtig verstehe (wobei ich mir bei deinem Deutsch ehrlich gesagt nicht sicher bin) möchtest du, dass Riot Games das Fiora Rework reverted.\nDa du hier allerdings im deutschsprachigem Forum postest anstelle des englisch-sprachigem oder gleich Reddit wo die Chance um ein Vielfaches höher ist jemanden anzutreffen, der hinsichtlich dieser Aussage auch tatsächlich etwas machen kann, bin ich etwas verwirrt und kann doch nicht ganz erkennen, was du hier jetzt genau möchtest.\nDeshalb frage ich noch einmal nach um sicherzugehen, dass wir uns hier nicht in eine falsche Richtung bewegen.\n\nEdit: War wohl doch leider nur ein Troll-Post :/","replies":[{"poster":"DragonBlood28","date":"2019-03-08T20:41:15.505+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Alpacana,realm=EUW,application-id=Wj1wcocU,discussion-id=GlHRr3Yd,comment-id=000200010000000000000000,timestamp=2019-03-08T20:02:58.671+0000)\n>\n> Ich zitiere einfach mal deinen Ausgangsthread:\n> \n> Wenn ich das richtig verstehe (wobei ich mir bei deinem Deutsch ehrlich gesagt nicht sicher bin) möchtest du, dass Riot Games das Fiora Rework reverted.\n> Da du hier allerdings im deutschsprachigem Forum postest anstelle des englisch-sprachigem oder gleich Reddit wo die Chance um ein Vielfaches höher ist jemanden anzutreffen, der hinsichtlich dieser Aussage auch tatsächlich etwas machen kann, bin ich etwas verwirrt und kann doch nicht ganz erkennen, was du hier jetzt genau möchtest.\n> Deshalb frage ich noch einmal nach um sicherzugehen, dass wir uns hier nicht in eine falsche Richtung bewegen.\n> \n> Edit: War wohl doch leider nur ein Troll-Post :/\n\nHmmmmmmm dann ließ doch einfach die 2 letzten zwei  Zeilen von dem ersten Text was ist geschrieben habe","replies":[{"poster":"Alpacana","date":"2019-03-08T20:47:23.011+0000","up_votes":1,"down_votes":0,"body":"> bitte ich euch sie zurück zubringen vor allem um den alten Fiora Main endlich wieder ihren spiel Spaß gewährleisten zu können ich bitte inständig das ihr die alte Fiora wieder zurück bring ~DragonBlood28\n\nAlso lag ich ja doch richtig.\nAlso wieder einmal meine Frage: Wieso postest du das hier im deutschen Forum, wo nie ein Riotler vorbeischaut anstatt dass du einen ausführlichen Reddit-Thread schreibst, in der Hoffnung, dass dieser durch die Decke geht und Riot erreicht?\n\nMal ganz abgesehen davon, dass du ein Rework-Revert verlangst, 4 Jahre nachdem das Rework released wurde. Es wäre also vollkommen sinnlos so einen Post zu schreiben, das hättest du schon vor 4 Jahren machen sollen und selbst dann ist es fraglich, ob Riot diese Änderungen zurücknimmt, geschweige denn ob du in der Mehrheit bist, die diese Reverts überhaupt wollen^^","replies":[]}]}]}]}]}]}]}]},{"poster":"Angel Ayume","date":"2019-03-08T21:33:54.773+0000","up_votes":2,"down_votes":0,"body":"Ich kann verstehen, wenn man seinen alten Champion wieder haben will erst recht wenn einem der alte Champ mehr Spaß gemacht hat. Aber leider kannst du da nicht viel dran ändern. \n\nHier im deutschen Forum wirst du keinen Riotler finden, der deine Bitte lesen würde. Dafür müsstest du schon ins NA Forum oder zu Reddit. Da wirst du mehr Chancen haben nen Riotler zu erreichen. Aber selbst dann gehe ich zu 100% davon aus, dass die alte Fiora nicht zurück gebracht wird. \n\nDu hast also eigentlich nur zwei Möglichkeiten. Entweder du spielst weiterhin Fiora und akzeptierst, dass sie nun so ist wie sie ist und machst das beste draus und versuchst trotzdem Spaß zu haben oder du suchst dir einen neuen Champion mit dem du mehr Spaß hast.. :/","replies":[{"poster":"Xayah Strife","date":"2019-03-09T09:17:39.467+0000","up_votes":1,"down_votes":0,"body":"Hallo Angel Ayume :)","replies":[{"poster":"Angel Ayume","date":"2019-03-09T11:28:50.125+0000","up_votes":1,"down_votes":0,"body":"Ja. Hi. ^^","replies":[]}]}]},{"poster":"Alpacana","date":"2019-03-08T19:05:46.873+0000","up_votes":3,"down_votes":1,"body":"Mal ganz davon abgesehen, was Amycos Cyrus schon geschrieben hat...Fiora ist ein Splitpusher. In Teamfights hat sie durch die Gründe die du schon genannt hast relativ wenig zu suchen. \nWenn man sich daran hält und sie dementsprechend spielt hat man diese Probleme auch nicht ;)","replies":[{"poster":"DragonBlood28","date":"2019-03-08T19:18:30.872+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Alpacana,realm=EUW,application-id=Wj1wcocU,discussion-id=GlHRr3Yd,comment-id=0001,timestamp=2019-03-08T19:05:46.873+0000)\n>\n> Mal ganz davon abgesehen, was Amycos Cyrus schon geschrieben hat...Fiora ist ein Splitpusher. In Teamfights hat sie durch die Gründe die du schon genannt hast relativ wenig zu suchen. \n> Wenn man sich daran hält und sie dementsprechend spielt hat man diese Probleme auch nicht ;)\n\nGlaub mir ich kenn mich besten mit Fiora aus und weiß wie man sie spielt bzw mit ihr gewinnt aber was soll ich sagen ihn meinen Augen macht sie keinen Spaß mehr aufjedenfall nicht so wie früher aber das kannst du garnichts nachvollziehen wär sie dein Main damals gewesen dann würdest du des Besser wissen","replies":[{"poster":"Alpacana","date":"2019-03-08T19:21:56.479+0000","up_votes":2,"down_votes":0,"body":"Das stimmt wohl, ich bin kein Fiora-Main. Damals hab ich sie ganz gerne gespielt, nach dem Rework wurde sie mir dann doch etwas zu komplex.\nWas ich allerdings durchaus beurteilen kann ist, dass sie früher sehr gut in Teamfights war (die Ult war ja schließlich wie gemacht dafür), jetzt ist sie im Teamfight allerdings ziemlich schwach. Umso stärker ist sie dadurch nun im Splitpush. Sie ist mMn nicht schlechter geworden, ihr Playstyle hat sich lediglich verändert.\nWenn man sich dementsprechend adaptiert sollte man auch keine Probleme mit der \"neuen\" Fiora haben, schwach ist sie ja nun keineswegs.","replies":[]}]}]},{"poster":"Amycos Cyrus","date":"2019-03-08T18:52:31.551+0000","up_votes":2,"down_votes":1,"body":"1. Kommt ein wenig spät. \n2. Es gibt Dinge im Spiel die nicht zu nerfen sind. (Das sind auch wesentliche Probleme von Ryze, Azir, Tahm und Kalista, die durch das Competative Spiel in den Boden generft wurden) Einige Spielmechaniken sind nicht durch den Schaden, sondern durch die Mechanik selbst so stark, dass sie angegangen werden müssen. Eine solche Mechanik war die Fiora-R.","replies":[{"poster":"DragonBlood28","date":"2019-03-08T19:20:26.959+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Amycos Cyrus,realm=EUW,application-id=Wj1wcocU,discussion-id=GlHRr3Yd,comment-id=0000,timestamp=2019-03-08T18:52:31.551+0000)\n>\n> 1. Kommt ein wenig spät. \n> 2. Es gibt Dinge im Spiel die nicht zu nerfen sind. (Das sind auch wesentliche Probleme von Ryze, Azir, Tahm und Kalista, die durch das Competative Spiel in den Boden generft wurden) Einige Spielmechaniken sind nicht durch den Schaden, sondern durch die Mechanik selbst so stark, dass sie angegangen werden müssen. Eine solche Mechanik war die Fiora-R.\n\nDann erklär mir bitte warum ein Yasmin existieren kann und eine Fiora nicht oder andere Champs die einfach nur op sind des it kein Grund sie zu reworker  und außerdem was hat des Bitteschön damit zu tun wann ich des Posten du Schlaumeier ich habe schon öfter solche Post gemacht auch kurz nachdem sie ein rework bekommen hat","replies":[{"poster":"Amycos Cyrus","date":"2019-03-08T19:36:00.737+0000","up_votes":1,"down_votes":0,"body":"Yasmin?\n\nWenn es sich dabei um Yasuo handeln sollte, so kann ich bei ihm keine Mechanik sehen die an sich nicht nerfbar ist.\nDie R lässt sich am besten über die Zeit balancen. Sowohl für die Airbone-Phase als auch für den Buff danach.\nDie Q ist nicht mehr als ein normaler Angriff mit vorzügen. Auch hier als solcher Blancebar\nDie E ist ein Dash lässt sich als über Abklingzeit anpassen.\nUnd bei der W kann man ganz simpel über die Ausmaße des Schutzes und der Wand selbst balancen.\n","replies":[{"poster":"Jura500","date":"2019-03-08T21:22:13.895+0000","up_votes":1,"down_votes":0,"body":"Pls rework yasmin","replies":[{"poster":"Amycos Cyrus","date":"2019-03-08T22:37:18.437+0000","up_votes":1,"down_votes":0,"body":"Finde ich auch","replies":[]}]},{"poster":"Angel Ayume","date":"2019-03-08T21:27:55.491+0000","up_votes":1,"down_votes":0,"body":"Ich bin mir ziemlich sicher, dass das Yasuo heißen sollte.","replies":[{"poster":"Amycos Cyrus","date":"2019-03-08T22:36:44.437+0000","up_votes":1,"down_votes":0,"body":"Aha XD\nokay","replies":[]}]}]}]}]}]}