{"poster":"elitegood","date":"2018-03-16T14:19:17.467+0000","title":"TODOS LO PIENSAN, NADIE LO DICE...","subforum":"Problemas Técnicos","up_votes":1,"down_votes":19,"body":"El d&iacute;a de hoy estoy pensando seriamente en dejar de jugar al League of Legends y dedicarle el tiempo a otros juegos que proporcionen diversi&oacute;n y no malos ratos. Al principio cre&iacute; que era totalmente mi culpa no poder subir de Rango, aprend&iacute; a manejar una gran diversidad de campeones en todos lo roles, partidas totalmente positivas en mi linea, para nada. No hay forma de poder jugar con gente que es muy toxica, abandona partidas, tienen actitudes negativas y antideportivas, creando un mal estar muy grande en los 4 compa&ntilde;eros que se encuentran en la partida. Los reportes no sirven, esta gente se crea otra cuenta, sube r&aacute;pidamente al nivel 30 y sigue infectando el sistema. Hay mucha gente que en verdad quiere el juego, algunos que quieren aspirar a jugar en competitivo, el camino obviamente es dif&iacute;cil pero a este paso lo destruye y estresa a mas de uno. Espero que alg&uacute;n d&iacute;a Riot Games entienda que tiene un gran juego y al seguir as&iacute; gente como yo no jugar&aacute; m&aacute;s y as&iacute; se va a ir perdiendo quedando en el olvido como otros juegos. {{champion:32}}","replies":[{"poster":"Hell Darking","date":"2018-03-16T14:39:48.735+0000","up_votes":3,"down_votes":0,"body":"lo que pasa es que juegas mucho lol, busca otros juegos(los mmorpg sirven muchisimo) y veras como la proxima vez que toques el lol, lo vas a hacer con muchas ganas y jugaras buenas partidas\na mi me pasa que en su tiempo solo jugaba lol (tenia solo ese instalado) y ya me frustraba mas que darme buenos ratos, asi que comenze a instalar mas cosas (starcraft, wow, diablo, poe, tf2, elsword, etc) y casi ni jugaba lol.. luego me dio por volver a jugar y se sintio completamente diferente","replies":[]},{"poster":"KarmaUnder","date":"2018-03-16T14:29:36.525+0000","up_votes":2,"down_votes":0,"body":"A mi el lol me da buenos ratos, nisiquiera nesesito jugarlo para tener buenos ratos con el lol, simplemente abro el cliente pongo el specter de la partida de un amigo, lo llamo a skype y me pongo a comentarle su partida... Y con eso paso tardes enteras solamente mirando partidas de mis amigos y riendonos de sus errores y disfrutando sus plays ...\nY no digas que no es tu culpa no subir de rango, eso es contraproducente y te impide mejorar\n\nPara que te hagas una idea yo tengo una smurf que la deje en bronce esta season, y me dije a mi mismo solamente jugando Camille (campeon que nisiquiera jugue una vez en mi cuenta) voy a subir esta cuenta a diamante...\nY asi ya va por platino con un 80% de winrate...\nNo es que yo haya tenido buena suerte, ni tampoco es que mi campeon este roto (bueno eso un poco si), la cosa es que yo se que tengo el nivel para subir aunque sea ahi y poreso puedo, pero yo se que no tengo el nivel para subir mas, por ejemplo a maestro, porque se y admito que no soy suficientemente decente... ese es el punto, vos estas diciendo que te mereces subir mas pero no subis ? asi no funcionan las cosas, si sos bueno subis... y no hace falta ser el rey de las mecanicas, yo mecaniqueandola doy asco, pero sabiendote que hacer para ganar ganas... no importa que te toquen conos o incluso afks...\nSi admitis que te falta nivel vas a poder concentrarte en mejorar en ves de concentrarte en quejarte de tu  equipo...","replies":[{"poster":"Nabuze","date":"2018-03-16T17:06:27.123+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=KarmaUnder,realm=LAS,application-id=X54mVVp0,discussion-id=kH0UzddE,comment-id=0000,timestamp=2018-03-16T14:29:36.525+0000)\n>\n> y no hace falta ser el rey de las mecanicas, yo mecaniqueandola doy asco, pero sabiendote que hacer para ganar ganas... no importa que te toquen conos o incluso afks...\n\nCrep que igual estas siendo un poco modesto o comprándote con algo de una liga mucho más alta al decir esto xD","replies":[{"poster":"KarmaUnder","date":"2018-03-16T17:40:48.883+0000","up_votes":1,"down_votes":0,"body":"si igual obvio que es imposible ganarlas todas :P\nSino tendria 100% de winratio en la smurf xD\nPero pasa que la realidad es la realidad, un challenger sube una cuenta de bronce a challenger en una semana... asi que todo se basa en que tan bueno sos al final :/","replies":[{"poster":"Nabuze","date":"2018-03-16T21:18:33.613+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=KarmaUnder,realm=LAS,application-id=X54mVVp0,discussion-id=kH0UzddE,comment-id=000000000000,timestamp=2018-03-16T17:40:48.883+0000)\n>\n> si igual obvio que es imposible ganarlas todas :P\n> Sino tendria 100% de winratio en la smurf xD\n> Pero pasa que la realidad es la realidad, un challenger sube una cuenta de bronce a challenger en una semana... asi que todo se basa en que tan bueno sos al final :/\n\nHasta faker tiene un win rate del 55%. Es verdad que es imposible ganarlas todas pero si sos buenos subis tal como decis.\nIgual queria recalcar ese comentario porque estabas siendo demasiado duro con vos mismo ya que diamante es solo un 1.5% de personas del servidor de las","replies":[]}]}]}]},{"poster":"ParedSinRevoque","date":"2018-03-16T18:56:44.696+0000","up_votes":1,"down_votes":0,"body":"No generalizes crack. Ni que sepas lo que todos piensan.\n\n{{sticker:slayer-pantheon-popcorn}}","replies":[]},{"poster":"Nabuze","date":"2018-03-16T17:02:20.573+0000","up_votes":1,"down_votes":0,"body":"Nunca entendí porque dan un mensaje cuando se quieren ir la gente que de verdad deja el juego ni siquiera se tomaría la molestia de escribir algo si total no vuelve.\nLa culpa de no subir de rango es de uno mismo el equipo enemigo tiene tantas posibilidades de que le toque gente desagradable que al equipo aliado.","replies":[]},{"poster":"Deurin","date":"2018-03-16T16:40:38.473+0000","up_votes":1,"down_votes":0,"body":"https://gyazo.com/4b017c7f9f110682080def478975fd99\n\ntenes 3 victorias seguidas\n\nhace no mucho yo tuve racha de 11 derrotas ._.","replies":[]},{"poster":"Champi4UP","date":"2018-03-16T14:48:50.188+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=elitegood,realm=LAS,application-id=X54mVVp0,discussion-id=kH0UzddE,comment-id=,timestamp=2018-03-16T14:19:17.467+0000)\n>\n>  algunos que quieren aspirar a jugar en competitivo\n\nNadie, absolutamente nadie juega solamente LoL, los profesionales juegan hasta DotA, vaya a saber capaz juegan Osu, PUBG, Fortnite, hay miles de juegos más que el LoL...\n\nNo soy profesional pero juego como cada 3 días una partida y me voy a ver anime, series, películas, leer el foro o jugar en la PS4. \n\nEsta semana me la pasé jugando Neverwinter.\n\nAdemás, y esto se lo digo a muchos que *amenazan* con dejar de jugar, **nadie** les apunta con una pistola obligándoles a jugar.\n\nJueguen para divertirse, si no les divierte jueguen otra cosa hasta que sientan esa abstinencia de querer jugar LoL y saben que les va a divertir jugarlo.","replies":[{"poster":"I TzaR I","date":"2018-03-16T16:37:59.844+0000","up_votes":1,"down_votes":0,"body":"Justo empece a jugar al nwn 1, que juegazo lpm","replies":[]},{"poster":"Juice Wrld","date":"2018-03-16T15:15:59.301+0000","up_votes":1,"down_votes":0,"body":"Faker juega Poly Bridge xd","replies":[]}]},{"poster":"Juice Wrld","date":"2018-03-16T15:16:44.648+0000","up_votes":1,"down_votes":0,"body":"Descarga Poly Bridge y divertite con las animaciones raras, yo me rio con eso y disfruto LoL xd","replies":[{"poster":"I TzaR I","date":"2018-03-16T16:34:34.112+0000","up_votes":1,"down_votes":0,"body":"Faker aproves","replies":[]}]},{"poster":"V for Vice","date":"2018-03-16T15:47:09.275+0000","up_votes":1,"down_votes":0,"body":"Para subir necesitas habilidad y suerte. Habilidad para ganar tu línea y suerte para que no te ganen las otras 2 + la jungla.\nSuerte en tus próximas aventuras.","replies":[]},{"poster":"Bienzahar","date":"2018-03-16T14:38:00.186+0000","up_votes":1,"down_votes":0,"body":"Si ya no te divierte mejor dejarlo y ya.","replies":[]}]}