{"poster":"Divine Winds","date":"2017-02-04T14:59:06.002+0000","title":"PSA: Riot is a company.","subforum":"[ARCHIVED] Miscellaneous","up_votes":1,"down_votes":2,"body":"The reason why they might do some questionable things like buff champions no one really needed buffs, or remove certain game modes from some region is because they are a **company** . They want to earn money. By buffing champions that see lower play rates, (but don't have problems with their kits) makes people more inclined to buy them, and potentially buy skins for them. They also don't maintain certain game modes on some regions because the amount of money they would earn from that region would not outweigh the amount it costs to maintain that game mode.\r\n\r\nYes, it isn't right to manipulate parts of a game to earn money, but then again they are a private, profit-gaining company.","replies":[{"poster":"SEKAI","date":"2017-02-04T15:44:54.269+0000","up_votes":1,"down_votes":0,"body":"Does it hurt to be that cynical?\n\nWhy do they buff champs that are rarely or never played? Because chances are, they are underpowered, and so they rightfully receive buffs.\n\nWhy do they close down game modes on some regions' servers? Because they only do that on low population servers, where low population being stretched across too many different queues would hinder queue time. And so they close down lesser popular modes or make it limited accessibility so that other more popular modes enjoy a better queue time.\n\nEarning money is 1 thing, but that doesn't mean any and everything links directly back to that cause either.","replies":[{"poster":"Divine Winds","date":"2017-02-04T16:27:57.854+0000","up_votes":1,"down_votes":0,"body":"I'm defending the fact that people are complaining about buffs or game modes (like Draft in EU) being removed.","replies":[]}]},{"poster":"I am Pacman","date":"2017-02-04T15:40:02.330+0000","up_votes":1,"down_votes":0,"body":"> Yes, it isn't right to manipulate parts of a game to earn money, but then again they are a private, profit-gaining company.\n\nYou state this like riot hasn't release like 3 dev talk videos and like 8 articles about how their desicion making works and why they do certain things.  I don't speak for riots financial team but I'm pretty sure they wouldn't go all the way down to the gameplay and live balance departments and say \"yo guys, we need to buff jhin, he has got a new skin coming out\"\n\nhttps://www.youtube.com/watch?v=Vdf0SDk2LLg&t=608s","replies":[]}]}