{"poster":"QAPLA","date":"2018-02-06T23:05:36.768+0000","title":"Why So Lazy Riot? (Champion Updates)","subforum":"Miscellaneous","up_votes":2,"down_votes":0,"body":"If you have new ideas for champions, why do you replace old ones instead of adding new?\r\n\r\nWhy do I have to lose my old Galio and Swain, etc?\r\n2 of my favourite champs, just removed and replaced with a completely different champion.\r\nIt makes no sense.\r\n\r\nGalio and Swain are both completely different champs to their pre-update identities, why are they updates instead of new champions?\r\n\r\nShould I just give you a list of my favourite champs to play, so you can remove them all?\r\n\r\nShould I just uninstall and find another game to play?\r\n\r\n[PS] Swain was my top mastery point champion before the update.\r\nMao and Galio are both up there too, and they got there before the changes.","replies":[{"poster":"00shots00","date":"2018-02-06T23:26:34.055+0000","up_votes":1,"down_votes":0,"body":"yeah the nerfed the fuck out of them too with their changes.","replies":[{"poster":"Mozzie25","date":"2018-02-06T23:31:39.242+0000","up_votes":1,"down_votes":1,"body":"Bahahahaha did you seriously just say new galio was a nerf?","replies":[{"poster":"00shots00","date":"2018-02-06T23:39:34.803+0000","up_votes":1,"down_votes":0,"body":"easiest lane to vs in ,y opinion to be honest man. once you bait out his combo and dodge the Q and E he's a sitting duck","replies":[{"poster":"Mozzie25","date":"2018-02-07T00:14:19.151+0000","up_votes":1,"down_votes":0,"body":"Did you ever play agaisnt old galio? The new one does more damage and has more ultility. Whatever you think of the change it definitely was a nerf","replies":[{"poster":"00shots00","date":"2018-02-07T01:45:20.976+0000","up_votes":1,"down_votes":0,"body":"yes I did and his ulti was amazing and sort of stuffed me around as an auto attacker based champ.","replies":[{"poster":"Mozzie25","date":"2018-02-07T02:08:42.010+0000","up_votes":2,"down_votes":0,"body":"And he now has a taunt on his e. Sure it’s not a super long and doesn’t reflect all the damage but with the lower cooldown it’s arguably more useful. His current ult is way more useful than this old one. Long range, damage resistance as well as damage and a knock up","replies":[{"poster":"00shots00","date":"2018-02-07T04:27:25.256+0000","up_votes":1,"down_votes":0,"body":"its not as long and and its so much easier to dodge. and yes his new ult is more team utility but only if he gives up his lane or his opponent is weird enough to lose said lane. his old ult lasted so much longer and could really impact a game just as much if not more than his new form. anyways I'm not complaining one of the best lanes to vs so it is what it is","replies":[{"poster":"Mozzie25","date":"2018-02-07T06:46:49.430+0000","up_votes":1,"down_votes":0,"body":"But it’s got a much lower cooldown. You said they nerfed the fuck out of galio with his change. I don’t see any real nerfs here. His old ult might have lasted longer but a qss completely counters it. \n\nHe’s been played in the pros pretty much constantly since the change. Pretty sure you have an easy time agaisnt is more to do with the people playing him that the champion","replies":[{"poster":"00shots00","date":"2018-02-07T20:25:09.968+0000","up_votes":1,"down_votes":0,"body":"pro league is no where near the same as solo Q.\n\nthey don't play as aggressive unless its a 2-3v1 in the laning phase.","replies":[{"poster":"Mozzie25","date":"2018-02-07T21:59:30.953+0000","up_votes":1,"down_votes":0,"body":"There’s been multiple pro mid laners getting a solo kill on him. \n\nBut that’s irrelevant none of the things you brought up are nerfs","replies":[{"poster":"00shots00","date":"2018-02-07T22:33:26.607+0000","up_votes":1,"down_votes":0,"body":"that's your opinion and you're welcome to have it. \nmine is it is so agree to disagree bud","replies":[]}]}]}]}]}]}]}]}]},{"poster":"QAPLA","date":"2018-02-06T23:49:29.359+0000","up_votes":1,"down_votes":2,"body":"> [{quoted}](name=Mozzie25,realm=OCE,application-id=Ntey9fRZ,discussion-id=I5m5o4Br,comment-id=00000000,timestamp=2018-02-06T23:31:39.242+0000)\n>\n> Bahahahaha did you seriously just say new galio was a nerf?\n\nNo, I said it was a different champion.\nNice comprehension bro.","replies":[{"poster":"SOOM","date":"2018-02-07T02:54:22.155+0000","up_votes":1,"down_votes":0,"body":"Lmfao","replies":[]},{"poster":"Mozzie25","date":"2018-02-07T00:13:21.758+0000","up_votes":1,"down_votes":0,"body":"Not you the other guy. That would be why I replied to his comment not yours. \n\nI’m not sure about galio I think his change is good. But I’m unsure about Swain. At least galios kinda had his soul still there. Like you said Swain is pretty much an entirely new champ","replies":[]}]}]}]}]}