{"poster":"QAPLA","date":"2017-12-05T22:26:57.589+0000","title":"Oracles Ruin ARAM","subforum":"Miscellaneous","up_votes":1,"down_votes":0,"body":"Stealth champs are so easily countered in ARAM for 300g, in a game mode where you don&#039;t even need to farm creeps, gold is passively gained.\r\n\r\nOracle price in ARAM (not on the rift), needs to increase by at least 100%.","replies":[{"poster":"QAPLA","date":"2017-12-05T23:15:11.830+0000","up_votes":1,"down_votes":0,"body":"I just played a game as AP Shaco, where the enemy team just bought shitloads of oracles, even though I wasn't carrying. There was no other stealth, it was just for me, and it made me almost redundant. \nBoxes become useless, and my stealth just becomes a flash, because I can't be unseen.\n\nI think the real solution is to remove oracles from ARAM, and have reduced damage on stealth abilities (for ARAM only).\n\nBut what would I know? I just beta test games and have entire patches released on my suggestions.","replies":[{"poster":"Nightjar","date":"2017-12-06T08:02:48.729+0000","up_votes":1,"down_votes":0,"body":"eh even if they all buy oracles, it's still possible to be useful, you just need to get creative and have a protobelt. Shaco is one of those champions in aram that only works if you have a lot of experience on shaco, oracles aren't perfect, they turn stealth into camo, and it's quite possible to slip between or place boxes in such ways that you can pressure people to use mobility into box traps, and then murder them.\n\nIt's also quite the investment 1500g every few minutes to keep shaco from getting out of hand.\n\nI think the lightbringer is a better option for dealing with stealth in arams, with it's temporary true sight, and trap deactivation (maybe add a short cooldown like 30s each), it ends up being fairer, without also being cumbersome and forcing people to rebuy a potion every few minutes. It's also a crit/ad item, which makes it a poor pickup for alot of champions, and kind of suits the range/archer eyesight thematic.","replies":[]}]},{"poster":"Nightjar","date":"2017-12-05T23:01:06.064+0000","up_votes":1,"down_votes":0,"body":"the issue is the crux of how do you deal with teemo shrooms and shaco boxes for a reasonable price, and then whether that same reasonable price is fair for revealing other stealth. Imo we need something similar to control wards in aram, rather than oracles, maybe like bring the 'lightbringer' from dominion and TT, to howling abyss?","replies":[{"poster":"Driggz","date":"2017-12-06T03:42:32.304+0000","up_votes":1,"down_votes":0,"body":"Perhaps even adding the UNIQUE passive - Blackout from Duskblade of Draktharr to a new ARAM boots item would help. This way only traps would be illuminated and only so often. Also it would require an investment from a user(s) of a team in order to use it.","replies":[]}]}]}