{"poster":"wildfox99","date":"2017-04-15T19:09:30.498+0000","title":"consigli per la jungle?","subforum":"Campioni e gameplay","up_votes":1,"down_votes":0,"body":"chiedo aiuto a qualche main jungle\nsono un main mid,ma volevo imparare come seconda lane la jungle per le ranked\nla scelta &egrave; dovuta al fatto che top non mi trovo bene e non si riesce a carryare i game in quanto feedato o no con pochi champ riesci ad essere particolarmente rilevante\nadc per la vostra salute e sanit&agrave; mentale &egrave; meglio che non mi vediate giocare\nsupp non mi trovo male,anzi,mi piace anche come ruolo...solo che vai a metter primo mid e secondo supp,e vediamo dove finisci il 90% delle volte\n\nvorrei dei consigli su che champ usare,su come fare i giri della jungle (non ho problemi a pulire i campi,solo che non so che giro fare),su come gankare e magari qualcosa di importante che mi sfugge\n\ncome champ non riesco ad usare i jungler combattenti/assassini stile {{champion:64}} {{champion:11}} (non rightclicko abbastanza bene) {{champion:120}}  e non riesco con {{champion:154}} \n\navevo pensato a {{champion:79}} ,solo che non s come usare la ulti,o {{champion:427}} ,che non so proprio giocare\n\ngrazie in anticipo per chi ne avesse la pazienza\n\nEDIT: non mi importa niente dello skill cap","replies":[{"poster":"Firenheit","date":"2017-04-16T09:19:21.780+0000","up_votes":1,"down_votes":0,"body":"Se vuoi un mio consiglio, per ora lascia perdere la giungla. Aspetta il cambiamento di metà stagione e, se non arriva in quel periodo, anche il cambiamento alle Rune. \nAttualmente la giungla è \"particolare\", diciamo così, e se devi impararla ti conviene farlo quando LoL troverà un momento di pace.","replies":[{"poster":"Jeanne dˆArc","date":"2017-04-16T10:22:41.006+0000","up_votes":2,"down_votes":0,"body":"Il cambiamento delle rune è in programma ma non hanno dato nessuna informazione a riguardo. Se sarà un cambiamento di una certa portata, non verrà fatto in una semplice patch, bensì probabilmente durante la pre-season.","replies":[{"poster":"Firenheit","date":"2017-04-16T10:28:43.658+0000","up_votes":1,"down_votes":0,"body":"Ma il cambiamento di metà stagione non è una semplice patch. \n{{champion:201}}","replies":[{"poster":"Jeanne dˆArc","date":"2017-04-16T10:31:30.008+0000","up_votes":1,"down_votes":0,"body":"Sono già state annunciata le modifiche più importanti previste per il mid-season update e delle rune non se n'è proprio parlato. Non dico che sia impossibile, ma abbastanza improbabile che venga annunciato un simile aggiornamento, con un così grande ritardo.","replies":[{"poster":"zYaichi","date":"2017-04-16T18:39:49.029+0000","up_votes":1,"down_votes":0,"body":"Fin ora ci hanno fatto vedere 3 abilità di 3 campioni e una meccanica nuova nella landa degli evocatori,dubito fortemente che la riot in un mid season update faccia SOLO quello,l'ultimo mid season update è stato abbastanza grande ritoccando parecchi campioni e i draghi.\n","replies":[{"poster":"Jeanne dˆArc","date":"2017-04-16T18:52:52.097+0000","up_votes":1,"down_votes":0,"body":"Questo è tutto ciò che è stato mostrato e annunciato fino ad ora:\n\n- item nuovi da tank;\n- modifiche agli attuali item da tank;\n- modifiche agli item AD;\n- modifiche agli item da support;\n- hanno mostrato le nuove ulti di Maokai e Sejuani e nel riepilogo di metà stagione hanno descritto più dettagliatamente ciò che vogliono fare con loro;\n- hanno annunciato il nuovo Rift Herald e il suo nuovo funzionamento;\n- migliorato il sistema di valutazione, aggiungendo nuovi parametri (altri in arrivo in futuro);\n- hanno confermato che il sistema a 10 ban _non è previsto_ per il mid season update, arriverà qualche patch dopo;\n- il sistema di surrender a 15 minuti è ancora in fase di test in Oceania, non è previsto per il mid season update.\n\nInsomma, tutti gli annunci più importanti sono già stati fatti e alcuni sono comparsi anche sul PBE nei scorsi giorni, e torneranno questa settimana in vista della patch 7.9. Però se per voi è poco, ok.","replies":[]}]},{"poster":"Firenheit","date":"2017-04-16T10:34:36.141+0000","up_votes":1,"down_votes":0,"body":"I cambiamenti non saranno neanche nella 7.9, mai dire mai :)","replies":[]}]}]}]}]},{"poster":"vondarck","date":"2017-04-17T10:31:37.754+0000","up_votes":1,"down_votes":0,"body":"M8 sono main jung secondario mid (prevalentemente assassin a mid e brusier in jung)\n\nTra qualche giorno il meta della jungla sarà stravolto in maniera significativa, quindi aspetterei un po a dare consigli perché se i tank puri tornano in meta in jungla ci saranno seri cambiamenti\n\nP.s. alla patch attuale però se non riesci a carriare con hecarim è perché non ti sei mai guardato una guida che ti spiega bene i trik del pony.","replies":[{"poster":"wildfox99","date":"2017-04-17T14:43:22.552+0000","up_votes":1,"down_votes":0,"body":"hecarim l'ho provato un po' di tempo fa,non è che non lo riesco ad usare,anzi lo trovo molto facile,ma semplicemente non mi piace il suo kit,mi annoia e non è nel mio stile\n\n>Tra qualche giorno il meta della jungla sarà stravolto in maniera significativa\n\nquindi la patch è martedì? comunque se non sbaglio il rework degli item era stato rimandato alla 7.9,quindi direi la prossima ancora","replies":[{"poster":"vondarck","date":"2017-04-17T14:51:46.280+0000","up_votes":1,"down_votes":0,"body":"uh vero, non avevo letto \"che era stata rimandata alla 7.9\"\n\nok, in ogni caso durerà si e no 2 settimane sta patch, bisogna vedere quanto contano di fare tank i tank nuovi e come workeranno i nuovi item nel meta\n\nse non giochi heca perchè non ti piace ti consiglio di guardate la T1 list di champion in jung e scegliertene 1-2 per vedere se ti piacciono\n\np.s. sei un mid lainer che romma molto? se si allora puoi fare il jung altrimenti ti consiglio la top piuttosto","replies":[{"poster":"wildfox99","date":"2017-04-17T15:37:51.547+0000","up_votes":1,"down_votes":0,"body":"top è molto raro carryare un game,alla fine l'early viene deciso all' 80% dal jungler ed il late dalla bot lane (sempre che non si sia overfeedata in early),già la mid ha perso molta importanza,top non se lo fila nessuno se non è una riven/jayce/yasuo feedato \nper questo volevo capire come funziona la jungle, per andare in un ruolo moooolto incisivo e per capire i movimenti dei jungler per poterli counterare quando gioco in lane come la mid","replies":[{"poster":"vondarck","date":"2017-04-17T20:08:36.783+0000","up_votes":1,"down_votes":0,"body":"la jungla è un ruolo di predict, l'obbiettivo ultimo è mettere in condizione i tuoi lainer di non avere paura in primis del jungler avversario in secundis di poter fare un engage favorevole (quindi non forzare mai i gank o se lo fai entra da solo senza che sia richiesto il folow up del tuo lainer.\n\n\nci sono vari stili di jungler, c'è il jungler da obbiettivi (o da farm): {{champion:102}} {{champion:11}}  {{champion:19}} \ni jungler da gank: {{champion:254}} {{champion:64}} {{champion:60}} {{champion:120}} \ne i jungler che tankano: {{champion:32}} {{champion:57}} {{champion:113}} \nutility jung: {{champion:427}} {{champion:20}} \n\n\ndi solito io abbraccio sempre 2 stili, tutti i champ che gioco hanno un buon wave clear e godono di taaanti danni, anche perchè ATM i tank jungler sono abbastanza out of menta\n\ncome ruolo da masterare ci vuole tanto tempo, e di base ci sono meno \"meccaniche spicciole\" ma molte \"la situazione è questa, bisogna procedere così perchè questo e quello\"\n\ninizio dandoti un sito che ritengo attendibile per avere almeno un idea di cosa gira al momento:\n\nhttp://www.nerfplz.com/2017/04/2017-best-champions-tier-list-solo.html\n\nogni tipologia di jung dovrebbe essere studiata, più cose fai ovviamente più sei completo\n\nper quanto riguarda la top il pool di champ in meta a top sono un po sempre i soliti:\n\n{{champion:122}} {{champion:23}} {{champion:114}} {{champion:58}}","replies":[]}]}]}]}]},{"poster":"uFere","date":"2017-04-16T07:23:24.102+0000","up_votes":1,"down_votes":0,"body":"Non sono un propriamente un main jungle ma posso aiutarti, ti consiglierei caldamente shyvana, è abbastanza facile come jungler, è un jungler un po' particolare, non devi concentrarti molto sul gankare, ma a prendere gli obbiettivi (draghi) e clerare i campi tuoi  (e quelli nemici se vuoi fare il bastardo xD).\nI gank se proprio devi farli, falli con la ulti up e fai molta attenzione ai draghi, se prendete un drake, shyvana ottiene un bonus in armor e mr (oltre al buff e le resistenze che ti buildi), nei fight cerca sempre di colpire più nemici che puoi con la E (sia in forma drago che umano) poiché tutti i tuoi attacchi faranno danni in base alla vita.\nTi consiglio di guardare qualche guida per giocarla al meglio.\n\nAltro jungler recentemente buffato è Volibear, non serve che ti spieghi nulla, in early puoi fare quello che vuoi..\n\nCome giri in jungle dipende dal champ, qualcuno in particolare?","replies":[{"poster":"wildfox99","date":"2017-04-16T13:49:37.407+0000","up_votes":1,"down_votes":0,"body":"più che altro mi piacciono i jungler che gankano bene,come jungler stavo imparando gragas,amumu,e forse provo WW e rammus\ngragas con la ulti sono sempre indeciso quando e dove usarla\ncon amumu non riesco a giocare 1 game senza essere invaso analmente dal jungle nemico\nWW posso  anche andare in bagno fa tutto lui\n\nun'altra cosa è che con tutti i jungler fatico sempre a gankare,so che in bot ci devi andre solo di ulti,ma mid/top failo sempre le gank","replies":[{"poster":"uFere","date":"2017-04-16T18:14:26.052+0000","up_votes":1,"down_votes":0,"body":"In tal caso, se ti piace gankare bene, ti consiglio {{champion:56}}, la sua ulti è una kill sicura se prendi i nemici fuori posizione\n\nCon {{champion:32}} serve un team che ti copra il deretano in early e che wardi bene","replies":[]}]}]},{"poster":"zYaichi","date":"2017-04-16T11:36:38.652+0000","up_votes":1,"down_votes":0,"body":"Ti sconsiglio ivern in soloq,usalo solo se giochi con altre 4 persone altrimenti non ne vale la pena. Gragas è abbastanza facile provalo,di solito io lo buildo con il primo item {{item:1402}} e poi full tank,le gank sono facili la combo è : W poi veloce E+Q+q.\nLa R è facile da tirare: Allontanerà sempre i nemici vicino al punto di impatto,quindi chiaramente tirarla dietro di loro li avvicinerà,viceversa tirarli vicino a te o ad un alleato li allontanerà","replies":[]},{"poster":"DrWolf1904","date":"2017-04-16T10:14:26.550+0000","up_votes":1,"down_votes":0,"body":"{{champion:102}} +{{item:1416}} OPPURE {{item:1419}} La giungla non sarà più un problema","replies":[]},{"poster":"SeCcUz","date":"2017-04-15T19:55:52.114+0000","up_votes":1,"down_votes":0,"body":"Allora ti posso dire che in giungla è importante avere diverse scelte di campioni in base alla formazione del tuo team quindi cerca sempre di avere più di una scelta.\n\nA mio parere dovresti imparare a usare questi jungler:\n|\n|\n\n\n\n{{champion:32}} {{summoner:4}} {{summoner:11}}  Amumu: _Tank, Ap _ \n\nIn early è abbastanza debole quindi se contro hai jungler come {{champion:35}} {{champion:64}} ti conviene stare molto allerta e avvertire il tuo team di aiutarti nel caso cerchino di invaderti nella tua giungla.\nAl livello 6 sei già un pericolo enorme per la squadra avversaria, il mio conisglio e quello di prendere di mira la MID con amumu, magari prendere qualche ward \n {{item:2055}} per aiutarlo a giocare più aggressivo nella mid lane o semplicemente per avere un controllo della mappa più ampio..\n|\n|\n\n\n\n\n\n{{champion:19}}{{summoner:6}} / {{summoner:4}} {{summoner:11}}   Warwick: _DPS,Tank_\n\n\nLa giungla per WW è semplicemente Ez, difficile avere problemi ad ammazzare i mostri neutrali, è molto efficace nei gank sin dal livello 3 per  via della sua passiva della W globale che _\"Mette ansia\"_ i nemici sapendo che è una potenziale vittima ai tuoi occhi.\nCon WW io mi trovo bene con le {{item:3117}} se ti piace gankare con queste sarai un dito nel {{item:1056}} a tutti quanti, perchè oltre a farti correre ancora più veloce ti aumenta anche il range della tua Ultimate (fuori dal combattimento)\n|\n|\n\n\n\n\n\n\n{{champion:5}} {{summoner:4}}/{{summoner:3}}  {{summoner:11}} Xin Zhao: _Dps, Tank_\n\nIn giungla abbastanza equilibrato, al livello 2 potesti fare già un early gank, ma in quanto gank xin zhao è veramente fastidioso\nNon ho molto di dire a riguardo, approfitta della _TOP_ in quanto una lane molto lunga di aiutare il tuo Top ad avere un piacevole soggiorno con creep gratuiti tutte a tutte le wave.","replies":[]},{"poster":"SirZeel","date":"2017-04-15T19:21:16.872+0000","up_votes":1,"down_votes":0,"body":"Xin Zhao e Warwick sono champion eccellenti per fare della buona giungla senza sforzi eccessivi.","replies":[{"poster":"wildfox99","date":"2017-04-15T19:48:59.848+0000","up_votes":1,"down_votes":0,"body":"però non riesco proprio ad usare i jungler del genere,avrei preferito peel/utility,ma ci farò un pensiero su WW\nmi sono dimenticato di scrivere che lo skill cap non conta per me","replies":[]}]},{"poster":"Jeanne dˆArc","date":"2017-04-15T20:33:44.786+0000","up_votes":1,"down_votes":1,"body":"{{champion:32}} {{summoner:4}} {{summoner:11}} \n\nProbabilmente uno dei jungler più semplici che esistano. Pulisci la giungla con estrema facilità in quanto essere attaccati riduce la ricarica della E, quindi campi di raptor e golem sono una passeggiata da fare (pulisci l'intera jng senza dover andare back). Prima del 6 ti conviene mettere pressione soprattutto in MID e TOP, per poi andare in BOT al lv6 con la ulti. Questo almeno in linea generale, poi ovvio che varia da partita a partita a seconda di come sono combinate le lane.\nPersonalmente lo gioco full tank, lasciando che siano gli altri del team a fare i danni. \nSe vuoi giocarlo AP/TANK, gli unici item che devi prendere in considerazione sono {{item:3116}} {{item:3151}} {{item:3001}} tutti gli altri lasciali perdere, ovviamente niente \"1000 AP ONE-SHOT AMUMU BOOSTED!11!1!!\".\nCome item da giungla consiglio {{item:1401}} perché gli HP sono fondamentali, inoltre hai estremamente bisogno dello smite blu per rallentare i nemici, perché se manchi la Q o non hai la R, è facile scappare via da te. Miglior item da buildare sempre: {{item:3190}} in quanto non ne risenti particolarmente della mancanza di HP, prendi sia statistiche d'armatura che di resistenza magica e in fight uno scudo per l'intero team può davvero salvare il culo.\n\nAltro jungler molto simile è {{champion:113}} \nÈ un CC ambulante, qualsiasi sua skill knock-uppa/slowa/stunna. In team fight è estremamente forte grazie alla sua ulti e fa danni davvero vergognosi pur buildata full tank. Con lei puoi optare anche per questi altri 2 item da jng {{item:1409}} {{item:1413}} in quanto i nemici difficilmente riusciranno a scapparti (troppi CC) e quindi lo smite blu non ti sarà indispensabile. Per la build, stesso discorso di Amumu: come item AP prendi in considerazione soltanto {{item:3151}} {{item:3116}} {{item:3001}} , per tutto il resto da tank, buildi a seconda di quello che ti serve.\nPersonalmente su Sejuani amo il {{item:3025}} e in generale, opto per item a doppia resistenza a discapito di HP (superi in ogni caso i 4k al liv18).\n\n\nPer qualsiasi altra domanda su loro 2, chiedi pure.","replies":[]}]}