{"poster":"LittleBabyFace","date":"2015-02-11T07:48:08.808+0000","title":"Why does everyone in Silver hate each other?","subforum":"Gameplay & Strategy","up_votes":1,"down_votes":0,"body":"Hey everyone,\r\n\r\nIn season 4 I was Gold and this season I was placed into Silver III. I didn't complain as I hadn't played in 4 months or so.\r\n\r\nAnyway, I started doing my provisionals, I lost like 6 and won 4.\r\n\r\nI get placed... Silver III, I think.. Okay, I can get back upto Gold or maybe even higher.\r\n\r\nThe last 4-5 games I have had, as soon as the other team either gets FB or someone does something stupid, my team mates are going crazy at one and other.. I don't understand it! I just had a game then where we lost and it was literally due to the fact that my team hated each other. I don't know what to do or how I am meant to get the motivation to even play League of Legends if every time I get into a game, I am either abused or my team are abusing each other..\r\n\r\nJust thought I would vent somewhere..\r\n\r\nCheers","replies":[{"poster":"vBulldogz","date":"2015-02-15T07:10:49.899+0000","up_votes":2,"down_votes":0,"body":"I was plat 3 after placements gold 3 you will climb back up play every game as if you whole team is bad get into that habit of thinking your mind set will eventually kick ink you will carry more games that being said your tier isn't the only one who has ragers or feeders plat players have such a huge ego from the champ select screen if any sign of a clown is in your team instamute play every gem with a clean mind set is key lol cheers","replies":[]},{"poster":"Knuuckles","date":"2015-02-11T11:35:33.423+0000","up_votes":1,"down_votes":0,"body":"its the mindset of silver, they are better than everyone else and anyone who disagrees will be verbally abused","replies":[]},{"poster":"Exhausted","date":"2015-02-11T08:00:20.021+0000","up_votes":1,"down_votes":0,"body":"Just mute everyone who starts this sort of crap mate\n","replies":[{"poster":"LittleBabyFace","date":"2015-02-11T08:01:34.265+0000","up_votes":1,"down_votes":0,"body":"If it gets too bad, I do mute people however I still play the game like we can still win but the others just lose all motivation.. I guess I have done this once before, I can do it again. It's the climb.","replies":[{"poster":"Exhausted","date":"2015-02-11T08:03:45.370+0000","up_votes":1,"down_votes":0,"body":"if you feel they lose motivation or have a negative attitude then report them for it, and leave details.\n\nwhile riot manual bans take a while they do begin to see a pattern with bad players and act accordingly (more so if majority of reports are from ranked)\n\n\n","replies":[{"poster":"LittleBabyFace","date":"2015-02-11T08:42:43.785+0000","up_votes":1,"down_votes":0,"body":"Yeah I will man, thank you :)","replies":[]}]}]}]}]}