{"poster":"Ulfmane","date":"2018-01-09T04:11:29.458+0000","title":"Les comparto una buena jugada que hice","subforum":"Charlas Generales","embed":{"description":"Una iniciación de flash + pared + ulti con poppy al adc que terminó siendo la teamfight final de la partida ya que despues de esa sacamos baron y ganamos.","url":"https://youtu.be/6BIjgeCj4wc","image":"https://i.ytimg.com/vi/6BIjgeCj4wc/hqdefault.jpg"},"up_votes":3,"down_votes":6,"body":"Nada, les comparto una peque&ntilde;a teamfight de un game reci&eacute;n que nos hizo ganar el partido. El elo es ranked solo duo platino medio. Yo estaba con Poppy support (que si no lo saben le mete lindo counter a la iniciaci&oacute;n de Leona y le caga el escape a Vayne si inicias bien)\r\n\r\nEn contexto, ibamos ganando bastante holgados, pero ven&iacute;amos de una teamfight perdida en el mismo lugar donde esta tiene lugar en la cual la Vayne enemiga sac&oacute; una triple kill. Esto sumado a que nuestro Kassadin se estaba flameando con nuestra Fiora hac&iacute;a mas de 10 minutos (mucho antes de la teamfight perdida) hac&iacute;a presagiar un throw que se ve&iacute;a venir. Al menos estaba muy presente en mi cabeza y creo que todos los del team sent&iacute;an lo mismo. El Lee Sin nuestro hac&iacute;a rato que ya no se animaba a intentar iniciar, la Fiora desde el minuto 10 que se decidi&oacute; a jugar sola sin juntarse en ning&uacute;n momento y sinceramente la composici&oacute;n oponente Leona, Vayne, Ryze hac&iacute;a imposible que Kassadin o Varus pensaran en siquiera acercarse a la front line. \r\n\r\nY nada, solo me quedaba a mi iniciar, era eso o ceder la iniciativa al oponente que lentamente nos ir&iacute;a dando vuelta todo (cuando Vayne llegara al full build estabamos muertos). Y se di&oacute; que Vayne me quiso pokear. Para que Vayne, para que.\r\n\r\nMe gustar&iacute;a leer sus opiniones sobre que les pareci&oacute; la jugada y si hubieran hecho algo diferente (por ejemplo el uso de mi ulti)\r\n\r\nSaludos","replies":[{"poster":"Claw","date":"2018-01-09T04:23:45.271+0000","up_votes":2,"down_votes":0,"body":"Buenisima amigo, no se si te acordas de mi? Saludos, feliz año y buena season 8 !!\n{{sticker:leblanc-funny}}","replies":[{"poster":"Warwiick","date":"2018-01-14T19:33:51.914+0000","up_votes":1,"down_votes":0,"body":"Deja de ser tan falso mejor","replies":[]},{"poster":"Ulfmane","date":"2018-01-09T04:28:07.334+0000","up_votes":1,"down_votes":0,"body":"Saludos a vos compa, igualmente para vos te deseo muy buen año!\n\nPero recordame, la verdad me suena mucho, puede ser que hayas sido una leblanc con la que entre los 2 recarriamos un game hace mas o menos 1 mes atras? (yo jugando poppy tambien) sino recordame","replies":[{"poster":"Claw","date":"2018-01-09T06:28:59.381+0000","up_votes":1,"down_votes":0,"body":"jajaja no amigo, realmente no me acuerdo, pero se que te tuve agregado mucho tiempo, ni yo me acuerdo de donde jugabamos, yo soy main sup y antes me llamaba Jokercraft3011. Igualmente me acuerdo tu nombre y eso. Al menos pasé a saludar xD","replies":[]}]}]},{"poster":"UnMainMordeTonto","date":"2018-01-09T05:31:29.253+0000","up_votes":1,"down_votes":1,"body":"Y la play? Ademas les llevaban 10\nK de oro aunque no hubiese existido esa TF ganaban igual.","replies":[{"poster":"UnMainMordeTonto","date":"2018-01-09T05:38:35.743+0000","up_votes":1,"down_votes":0,"body":"Antes de que digan: Si pero estabamos por trhowear. No. Si perdes una TF con 10k de oro de ventaja que queres que te diga? Los throws ocurren cuando todo el team va separado y el team enemigo se organzia para cazarlos 1 a 1. Si hubiesen ido a cazar a la Fiora, como estaban ustedes juntos hubiesen tirado todo mid o ganado la TF (minimo tienen que ir 2 a parar a la Fiora si esta feed). \n\nMe diras: Sos un plata no me podes decir nada porque soy platino y soy un vergotas y tu opinion no cuenta (espero que no sea tu caso). Pero te digo que leo y miro muchas guias y por eso conozco varios tips.","replies":[{"poster":"Ulfmane","date":"2018-01-09T19:00:32.495+0000","up_votes":1,"down_votes":0,"body":"En mi opinión, el throw estaba latente mas que nada porque Kassadin y Fiora no paraban de insultarse, no eran 2 renglones eran textos y textos de flameo. Fiora no estaba feed, de hecho perdía el 1 v 1 contra Trundle y el 4 v 4 era mas favorable para ellos si contar que Trundle (a pesar de que en el video lo hizo mal) si tiraba TP para entrar a teamfight cuando nuestra Fiora solo lo usaba para volver a linea.\n\nNunca haría un ad hominem tan pete como descalificarte por ser plata, pero estas usando una fórmula general (lo de los 10k de diferencia) que en el caso del game del video no aplica por la circustancia en la que estábamos. Es cierto que había ventaja en ítems, pero tambien es cierto que mi team estaba lockeado sin poder iniciar una pelea favorable y en eso radica lo bueno de la jugada, en aprovechar el momento exacto para generar esa jugada que puede parecer trivial ya que desaparecieron pero te aseguro que la Vayne enemiga si no era deleteada al comienzo se llevaba 2 por lo menos y ni la torre t2 llegabamos a tirar.","replies":[{"poster":"UnMainMordeTonto","date":"2018-01-09T20:23:35.124+0000","up_votes":1,"down_votes":0,"body":"Bueno, dicho asi la jugada es buena. Gracias por la respuesta amable!","replies":[]}]}]}]},{"poster":"Yamisuke","date":"2018-01-09T16:51:02.949+0000","up_votes":1,"down_votes":0,"body":"Delete this {{item:3146}}","replies":[]},{"poster":"Monokai","date":"2018-01-09T04:27:58.798+0000","up_votes":1,"down_votes":2,"body":"pff nada fuera de lo normal, borra eso","replies":[]}]}