{"poster":"Jet Rocket","date":"2016-02-12T11:09:31.326+0000","title":"Qualche dubbio su quanto siano worth gli adc","subforum":"Discussioni generali","up_votes":2,"down_votes":6,"body":"Ho qualche dubbio su quanto sia worth il ruolo dell' adc puro (quindi non vayne o altre eccezioni tipo graves) per un motivo, per fare pi&ugrave; male degli ap l&#039;adc ha bisogno di AD, critico e velocit&agrave; di attacco ma per buildare queste statistiche non possono  avere gli oggetti offensivi/difensivi e sono costretti a fare delle scelte che gli ap non devono fare. \nGli adc per avere 100% di critico e 60% di AS devono buildare 4 oggetti, quindi o buildano un solo oggetto offensivo/difensivo o devono rinunciare a gran parte dei danni se ne vogliono pi&ugrave; di uno.\nGlii ap invece hanno sempre pieni danni e difese con ogni oggetto, possono buildare tranquillamente la zhonia, l&#039;oggetto che slowa, quello per il life steal ap, e gli rimangono altri due spazzi per buildare quello che vogliono. Solo per la riduzione di ricarica e il mana si pu&ograve; vedere un vero bilanciamento {{item:3508}} ma anche qui sei costretto a buildare un intero item per avere un mana sustain o prendere la muramana o la prendere la goccia per poi venderla.\nInoltre ci sono tre oggetti che nullificano  diversi vantaggi degli adc. \n\n\n\n{{item:3089}} 120 ap e aumenta l&#039;Ap del 35% totale        -       Questo da agli AP una quantit&agrave; di danni assurda\n\n{{item:3146}} ha lifesteal, lifesteal ap, 80 ap e 40 ad.       -      Permette agli AP di curarsi con la stessa efficenza degli AD da una wave di minion\n\n{{item:3285}} &quot;la statick dei maghi&quot;                                     -      come se non avessero gia abbastanza burst e danni con i poke\n\n\n\nA che serve quindi essere un fragile ADC senza CC che per fare i suoi danni deve rischiare di pi&ugrave;, ha meno possibilit&agrave; di fuga e deve scegliere tra difese o danni quando gli AP hanno tutti questi vantaggi e dei cazzutissimi poke, cc e danni aoe?","replies":[{"poster":"IrrationalNumber","date":"2016-02-12T11:17:17.927+0000","up_votes":4,"down_votes":0,"body":"I maghi son stati nerfati un sacco, i loro item piu forti costano un botto.\n\nE poi le torri le buttano giu gli ad, non i maghi, e il dps sempre gli adc lo fanno. Molti maghi possono smezzare e fare combo per burstare ma hanno una finestra di 5 secondi (in media) in cui possono al massimo dare utility e devono arretrare.\n\nIl mago serve principalmente a fare waveclear, ad offrire un tipo di danno diverso dall'ad e a dare utility.","replies":[]},{"poster":"Dantazzo","date":"2016-02-12T11:14:54.962+0000","up_votes":3,"down_votes":0,"body":"Gli adc rispetto a molti maghi hanno 2 grossi vantaggi: pushano torri ed obiettivi molto in fretta e possono uccidere i tank.\nInoltre fanno molti più danni nel tempo rispetto alla maggior parte dei maghi.","replies":[]},{"poster":"Jet Rocket","date":"2016-02-13T12:43:09.765+0000","up_votes":1,"down_votes":0,"body":"Il fatto che l'adc farà più danni non è scontato tra danni e cc aoe degli AP, la fragilità e i maggiori rischi degli adc.\n\nRiguardo al mana come avevo spiegato la {{item:3508}} mette in pari le cose ma solo in midgame perchè non ci sono oggetti con mana regen mentre la componi quindi l'unica scelta per avere subito del mana regen è prendersi la goccia per poi rivenderla sprecando gold.","replies":[]},{"poster":"Darth Ponzius","date":"2016-02-12T17:46:33.402+0000","up_votes":1,"down_votes":0,"body":"già non è che tra i cosidetti oggetti offensivi/difensivi ci siano mercurial, hexdrinker, sterak gage...\nMolti adc non hanno problemi di mana quindi una essence reaver è più che sufficiente per i bisogni di un adc, la tear è praticamente valida solo su Ez per la blue build o su Varus Ad caster, hanno scelte che molti ap non si possono permettere o sono ben poco efficienti (l'extech gunblade la si fa su ben pochi maghi, idem il will of the ancient quindi a livello di sustain per hp sono molto diversi). Hai ammucchiato gli ap e gli adc tutti in due macroclassi non considerando minimamente le differenze tra champ e champ e senza considerare anche che un adc è uno di quelli che in tf farà più danni e che ha il vantaggio non indifferente di tirare giù torri molto velocemente e come ranged.","replies":[]},{"poster":"Jet Rocket","date":"2016-02-12T16:58:37.397+0000","up_votes":1,"down_votes":0,"body":"E ziggs, Khartus, orianna e lissandra? Non sono anche loro un po ap caster visto che hanno cd molto ridotti sulla?","replies":[]},{"poster":"Nibbio Bianco","date":"2016-02-12T11:35:47.436+0000","up_votes":1,"down_votes":0,"body":"ap caster > ad carry > ap carry \n\n{{champion:13}} {{champion:69}} \n\nC'è da dire che comunque gli adcarry non soffrono di consumi di mana, pushano più velocemente le torri ed hanno più danni in early e mid game rispetto agli ap casters.\n\nIl motivo per cui sono così forti è uno ed uno solo: {{item:3135}} \n\nPRAISE THE 35% MAGIC PENETRATION. \n\n{{item:3033}} {{item:3036}} stoopid situational items. ","replies":[{"poster":"MyXanadu","date":"2016-02-12T11:49:37.758+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=IlRisotto,realm=EUW,application-id=MJVj50Jw,discussion-id=xVy3Yxge,comment-id=0002,timestamp=2016-02-12T11:35:47.436+0000)\n>\n> ap caster > ad carry > ap carry \n> \n> {{champion:13}} {{champion:69}} \n> \n> C'è da dire che comunque gli adcarry non soffrono di consumi di mana, pushano più velocemente le torri ed hanno più danni in early e mid game rispetto agli ap casters.\n> \n> Il motivo per cui sono così forti è uno ed uno solo: {{item:3135}} \n> \n> PRAISE THE 35% MAGIC PENETRATION. \n> \n> {{item:3033}} {{item:3036}} stoopid situational items.\n\nScusa ma che differenza c'è tra ap caster e ap carry?","replies":[{"poster":"Nibbio Bianco","date":"2016-02-12T11:59:52.831+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=MyXanadu,realm=EUW,application-id=MJVj50Jw,discussion-id=xVy3Yxge,comment-id=00020000,timestamp=2016-02-12T11:49:37.758+0000)\n>\n> Scusa ma che differenza c'è tra ap caster e ap carry?\n\nAttaccano più velocemente degli adcarry, facendo danni magici, con più penetrazione degli adcarry e facendo gli stessi danni senza aver bisogno del critico. Legit.","replies":[{"poster":"MyXanadu","date":"2016-02-12T12:39:30.340+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=IlRisotto,realm=EUW,application-id=MJVj50Jw,discussion-id=xVy3Yxge,comment-id=000200000000,timestamp=2016-02-12T11:59:52.831+0000)\n>\n> Attaccano più velocemente degli adcarry, facendo danni magici, con più penetrazione degli adcarry e facendo gli stessi danni senza aver bisogno del critico. Legit.\n\nPerdonami ma non ho ancora capito :/ mi faresti un esempio?","replies":[{"poster":"Nibbio Bianco","date":"2016-02-12T14:24:45.167+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=MyXanadu,realm=EUW,application-id=MJVj50Jw,discussion-id=xVy3Yxge,comment-id=0002000000000001,timestamp=2016-02-12T12:39:30.340+0000)\n>\n> Perdonami ma non ho ancora capito :/ mi faresti un esempio?\n\nCassiopeia Q EEE Q EEE Q EEE. Attacca velocemente quanto un carry, ma allo stesso tempo ha cc, ed i suoi danni sono magici, quindi è più difficile per un tank assorbirli, ma anche per campioni più squishy.\n\nStesso vale per ryze, però c'è da dire che quest'ultimo è più un tank/mage, ma comunque riesce a fare grandi quantità di danni.","replies":[{"poster":"Jet Rocket","date":"2016-02-12T15:00:01.561+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=IlRisotto,realm=EUW,application-id=MJVj50Jw,discussion-id=xVy3Yxge,comment-id=00020000000000010000,timestamp=2016-02-12T14:24:45.167+0000)\n>\n> Cassiopeia Q EEE Q EEE Q EEE. Attacca velocemente quanto un carry, ma allo stesso tempo ha cc, ed i suoi danni sono magici, quindi è più difficile per un tank assorbirli, ma anche per campioni più squishy.\n> \n> Stesso vale per ryze, però c'è da dire che quest'ultimo è più un tank/mage, ma comunque riesce a fare grandi quantità di danni.\n\nNon sono gli ap ad essere i burst e gli apc come gli adc a fare danni continui? Mi faresti qualche altro esempio di ap che fa danno nel tempo e non burst?\nCon cosa si counterano gli apc e con cosa gli ap?","replies":[{"poster":"Nibbio Bianco","date":"2016-02-12T15:33:03.515+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Jet Rocket,realm=EUW,application-id=MJVj50Jw,discussion-id=xVy3Yxge,comment-id=000200000000000100000000,timestamp=2016-02-12T15:00:01.561+0000)\n>\n> Non sono gli ap ad essere i burst e gli apc come gli adc a fare danni continui? Mi faresti qualche qaltro esempio ap che fa danno nel tempo e non burst?\n> Con cosa si counterano gli apc e con cosa gli ap?\n\nAP = Ability power. Un campione AP è... Zyra, Brand, Vel'Koz, Cassiopeia, Ryze, ecc...\nAP carry = Un campione AP che però è un carry, quindi si feedda e cerca di carryare ( ovvero trasportare ) il proprio team. Sia Cassiopeia che Ryze sono AP carry. \nAP caster = Campione AP basato sul casting di abilità continuo. è una sottocategoria dell'AP carry, quindi Ryze e Cassiopeia sono sia AP carry che AP caster. \n\nRyze e Cassiopeia sono gli unici due AP Casters del gioco. Il motivo per cui ce ne sono così pochi è molto semplice... sono molto forti nelle fasi avanzate di gioco.\n\nGli AP casters devi batterli in early game, perché soffrono in quelle fasi di gioco, arrivati in lane sono quasi inarrestabili. Un mago, che fa i danni in modo più lento, se viene focussato dal team può non riuscire a fare tutto il proprio danno, ha bisogno di tempo per fare danno. Un AP Caster in late game non ti dà il tempo di arrivare a lui, che già sei morto. Per riuscire a vincere in quelle fasi di gioco bisogna sfruttare bene gli agguati e ottenere obiettivi importanti come barone e quinto drago. Nelle prime fasi di gioco gli adcasters sono abbastanza facili da battere e fanno relativamente pochi danni.","replies":[]},{"poster":"Nabbomaster","date":"2016-02-12T15:21:58.474+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Jet Rocket,realm=EUW,application-id=MJVj50Jw,discussion-id=xVy3Yxge,comment-id=000200000000000100000000,timestamp=2016-02-12T15:00:01.561+0000)\n>\n> Non sono gli ap ad essere i burst e gli apc come gli adc a fare danni continui? Mi faresti qualche qaltro esempio ap che fa danno nel tempo e non burst?\n> Con cosa si counterano gli apc e con cosa gli ap?\n\nUno a il tempo di ricarica delle mosse alto infatti la combo sbotta e scappa aspettando che ritornino le skill l altro non sbotta ma fa comunque moltissimi danni e può farli a ripetizione perche non ha ricariche lunghe","replies":[]}]}]}]},{"poster":"Jet Rocket","date":"2016-02-12T12:09:39.346+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=IlRisotto,realm=EUW,application-id=MJVj50Jw,discussion-id=xVy3Yxge,comment-id=000200000000,timestamp=2016-02-12T11:59:52.831+0000)\n>\n> Attaccano più velocemente degli adcarry, facendo danni magici, con più penetrazione degli adcarry e facendo gli stessi danni senza aver bisogno del critico. Legit.\n\nQuindi come mai adc > apc ?  Vale anche apc > ap ? Se si perchè?","replies":[{"poster":"Nibbio Bianco","date":"2016-02-12T14:22:59.395+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Jet Rocket,realm=EUW,application-id=MJVj50Jw,discussion-id=xVy3Yxge,comment-id=0002000000000000,timestamp=2016-02-12T12:09:39.346+0000)\n>\n> Quindi come mai adc > apc ?  Vale anche apc > ap ? Se si perchè?\n\nGli adc hanno dps, come gli ap casters. Il dps è efficace contro chiunque. Gli ap carry hanno il burst, che è efficace solo contro i campioni più squishy.","replies":[]}]}]}]}]}]}