{"poster":"Jet Rocket","date":"2016-05-23T13:34:26.645+0000","title":"Miglioriamo la selezione delle normal","subforum":"Discussioni generali","up_votes":2,"down_votes":5,"body":"Occorre trovare un alternativa alle normal, basta fare spalla a spalla per scegliersi il ruolo, si potrebbe fare che il sistema crei casualmente un ordine di scelta, chi esce per primo seleziona sia il ruolo che il champ e cos&igrave; a seguire.\nIn questa maniera si evita la gara a chi scrive pi&ugrave; velocemente il ruolo evitando incomprensioni varie ancor prima di iniziare.\n\nPer poter invece scegliere tranquillamente il ruolo che si vuole nel nuovo sistema dovrebbe esserci:\n\n- Lo stato dei ruoli pi&ugrave; o meno richiesti come nel vecchio cerca squadra\n- Selezionare un solo ruolo ma non il champion\n- Avvio rapido della partita una volta trovato il gruppo\n\nEra proprio la possibilit&agrave; di scegliere il champ il problema del cerca squadra perch&egrave; impediva di combinare giocatori con ruoli diversi che sceglievano lo stesso champ come i numerosi giungler/toplaner o mid/top/giungler e in forma ridotta gli altri champ con combinazioni diverse di ruoli.","replies":[{"poster":"SpideyPizza","date":"2016-05-23T13:36:47.809+0000","up_votes":3,"down_votes":0,"body":"Esistono gia al posto di scegliere blind pick scegli coda dinamica e joini","replies":[]},{"poster":"Sorcio84","date":"2016-05-23T14:09:13.776+0000","up_votes":1,"down_votes":0,"body":"Bastarebbe solo prendere l'attuale dynamoQ , eliminando\n\n- ban\n- possibilità di vedere i pick nemici\n- possibilità di pickare lo stesso champ in due squadre diverse\n\nE sostituirlo alle blind pick.","replies":[]},{"poster":"SpideyPizza","date":"2016-05-23T13:51:44.754+0000","up_votes":1,"down_votes":0,"body":"vedrai con il cambio di client cosa succedera :)","replies":[]},{"poster":"Jet Rocket","date":"2016-05-23T13:43:49.160+0000","up_votes":1,"down_votes":0,"body":"Le dinamicQ non hanno il blind pick, devi selezionare due ruoli, una volta trovato il gruppo l'avvio della partita è lento. E' una cosa completamente diversa.","replies":[]}]}