{"poster":"BlackPowerLucian","date":"2016-05-02T09:35:57.038+0000","title":"Project: Premade Botlane","subforum":"Clans & Teams","up_votes":4,"down_votes":2,"body":"In diesem Thread m&ouml;chte ich diejenigen unter euch ansprechen, welche support main, bzw in zukunft den wunsch haben support mains zu werden, sind.\r\n\r\nIch, m&auml;nnliche, 18 Jahre, m&ouml;chte mit einem deutschem spieler die support / adc botlane meistern. Diesbez&uuml;glich habe ich mir viel gedanken gemacht &uuml;ber dinge die man wissen muss &uuml;ber die jeweilige rolle, das verhalten der jeweiligen rollen, lanecontrol etc. ich selber maine derzeit toplane (war in der vergangenheit mal adc main), weshalb es selbst f&uuml;r mich etwas neuer wird die adc rolle zu spielen. darum erwarte ich auch nicht einen highskilled support main, sondern einen spieler, welcher eine menge zeit mit sich bringt und durchaus lernbereit ist.\r\n\r\nich m&ouml;chte von ganz vorne mit euch beginnen um auch wirklich alles an wissen f&uuml;r die jeweilige rolle zu lernen, das hei&szlig;t also nicht umbedingt nur 100% spielen und weiter spielen, ranked, ranked, ranked... so wie es oftmals ist, sondern auch mal das ein oder andere mal talk&quot;stunden&quot;. kommunikation ist das a und o in der premade botlane. aus dem grund werden wir uns, sofern wir soweit kommen, auch von den normalen premade botlanes unterscheiden.\r\nziele f&uuml;r den support w&auml;ren unter anderem: - wie verhalte ich mich in der lane, - welche rolle erf&uuml;llt mein champ (peel, engage, passive supporting), - wie warde ich richtig, - wie nutze ich meine summoners richtig, - welche summoners picke ich, - wie nutze ich meine spell(-rotation) richtig.\r\nwie ihr seht sind da auch relativ viele basics dabei, jedoch bin ich mir zu 95% sicher das selbst da noch lernbedarf bei vielen besteht ^^\r\n\r\ndamit ihr nicht alleine auslernt als support: ich setzte mir selber auch ziele als adc, dazu geh&ouml;ren: - ordentliches trading in der lane, - positioning im teamfight, - csing, - championpool, - adc role fillers (sivir waveclear, jinx hyper carry, etc), und weiteres.\r\n\r\nnochmal zu mir:\r\n- 18 jahre, m&auml;nnlich\r\n- noch main toplane\r\n- elo master, ne menge smurfs in gold - diamond\r\n- s4 + sowie halbe s5 main adc\r\n- hohes knowledge &uuml;ber champions, cooldown der spells, damage der spells etc, sehr hilfreich f&uuml;rs adc spielen.\r\n- viel zeit f&uuml;rs spielen\r\n\r\nvon dir erwarte ich folgendes:\r\n- viel zeit\r\n- lernbereitschaft\r\n\r\ndas w&auml;re soweit auch schon alles: ich erwarte keine high elo supports, es k&ouml;nnen sich gerne auch bronze oder silber spieler melden, jeder der bereit ist zu lernen und viel zeit mit sich bringt kann und wird sehr schnell zu einem guten support.\r\n\r\nzu guter letzt: im vordergrund stehen immer Positives Verhalten sowie Spa&szlig;. wobei das positive verhalten zuerst genannt ist, da es mit gro&szlig;er wahrscheinlichkeit spiele geben wird in denen man am liebsten ragen w&uuml;rde wie sau etc, ich wei&szlig; wovon ich spreche, darum: wir sind die premade botlane, wir m&uuml;ssen ein positives verhalten berhalten, auch &uuml;ber schlechte spielphasen, aufdass wir auch einmal &quot;2gg5&quot; carryn k&ouml;nnen ;) der spa&szlig; kann leider gottes auch mal zu kurz kommen, es gibt nunmal auch schlechte tage!\r\nein weiteres, sehr wichtiges kriterium: vertragt kritik! wer keine kritik vertragen kann der muss sich garnicht erst melden. den kritik wird kommen, mit sicherheit. manchmal mag es sich wie flamen anh&ouml;ren, aber es ist und bleibt kritik mit der aussicht auf besserung! \r\nDarum: in meinem Projekt: Premade botlane gibt es kein Flame! es gibt nur konstruktive kritik! spieler die diese nicht vertragen k&ouml;nnen sind falsch auf meiner botlane :P\r\n\r\nansonsten bin ich eigentlich ein ganz netter typ der gerne auch &uuml;ber anderes als league quatscht ^^ sorry wenn das alles bisschen lang und hart r&uuml;berkommt (h&ouml;h&ouml;), wenn jemand interesse am project: premade botlane hat, soll er sich bei mir melden: Add / BlackPowerLucian\r\n\r\nalles weiter werde ich im Teamspeak mit euch bereden.\r\n\r\nps. ich erhoffe mir viele adds, erwarte jedoch auch viele spieler die einfach nicht zu mir passen werden und die ich absagen werde. darum nochmal: schaut wirklich ob es f&uuml;r euch passt, ob ihr euch auf das alles einstellen k&ouml;nnt. das ist kein 2 wochen project ! das ist ein project mit dem ziel high elo (master +) zu erreichen!\r\n\r\nlg","replies":[{"poster":"KAPPOBY","date":"2016-05-02T12:41:20.387+0000","up_votes":2,"down_votes":1,"body":"Du hast es satt alleine in der Dynamic Queue zu spielen und suchst nun ein Team oder benötigst einfach nur Gleichgesinnte? Aequilibritas eSports hilft dir bei der Erstellung eines Teams und bei der Suche nach Mitspielern, sodass du hoffentlich schnell in einem Team unter gebracht wirst.\n\nHier gehts zu unserem Vorstellungsthread: [Aequilibritas eSports sucht Mitglieder | Community und eSports | LoL, CS:GO, Hearthstone, etc.](http://boards.euw.leagueoflegends.com/de/c/clans-teams-de/tAy6UKsy-aequilibritas-esports-sucht-mitglieder-community-und-esports-lol-csgo-hearthstone-etc)\n\nÜber diesen Link kannst du natürlich auch direkt zur Aufnahme gelangen: [Bewerbungsformular](http://aequilibritas-esports.de/index.php/Application/)\n\nUnsere Community existiert bereits seit 2009. Wir würden uns natürlich über dein Interesse freuen und eventuell sogar über die Teilnahme an unserer Gemeinschaft. :)\n\nP.S. Sehr schöne Vorstellung von dir. :)","replies":[]},{"poster":"Abyssal Salt","date":"2016-05-03T06:44:38.559+0000","up_votes":1,"down_votes":0,"body":"Erstmal Hut ab für diese ausführliche Vorstellung, du musst es wirklich Ernst meinen.\nBin sehr interessiert.\nIch werde dich später am Tage adden und dann können wir im Teamspeak mal quatschen und ein paar Normals daddeln um zu schauen wie der jetzige Stand wäre :)\nMfg","replies":[]},{"poster":"BlackPowerLucian","date":"2016-05-02T22:33:46.574+0000","up_votes":1,"down_votes":0,"body":"wenn möglich nochmal mit dem hinweis an alle leute die mich adden: \nachtet darauf das ihr wirklich VIEL zeit mitbringt ! das heißt 5-8h TÄGLICH wären wirklich sehr hilfreich, mehr immer gerne gesehen ^^\n\nansonsten, danke für die zahlreichen adds, ich gebe mir die mühe mit jedem einzelnen ins gespräch zu gehen ^^","replies":[{"poster":"eXe La Twixx","date":"2016-05-03T00:24:23.400+0000","up_votes":1,"down_votes":0,"body":"Hey, hab dich auch mal geaddet :)\nKönnen ja gerne mal im TS quatschen.\nLG Stefanie ^^","replies":[]}]},{"poster":"Artemis Aphaia ","date":"2016-05-02T20:24:18.435+0000","up_votes":1,"down_votes":0,"body":"hi ich bin main supp ich würde gern mit dir üben ch war zwar letztes jahr nur silber ello aber ich spiel supp sehr gern. hab dir mal eine freundschaftsanfrage geschickt. mein lol name ist artemis aphaia bin weiblich spiel momentan nur supp oder adc ab und zu mid lg. katja","replies":[]},{"poster":"FabìThaHero","date":"2016-05-02T20:06:37.031+0000","up_votes":1,"down_votes":0,"body":"Ich habe dich mal geaddet Ich bin 17 und heisse Fabian. Falls du lust hättest würde ich lieber im Ts mit dir darüber sprechen :)","replies":[]},{"poster":"Snow Whity","date":"2016-05-02T16:12:53.521+0000","up_votes":1,"down_votes":0,"body":"Hab dich auch mal geaddet","replies":[]},{"poster":"Ayronias","date":"2016-05-02T16:02:05.196+0000","up_votes":1,"down_votes":0,"body":"hab dich mal geaddet","replies":[]}]}