{"poster":"poojigato9","date":"2016-11-20T04:38:07.754+0000","title":"¿como counterear a brand?","subforum":"Guias y consejos","up_votes":1,"down_votes":1,"body":"Mi hermano es main brand y no solo por eso, si no tambien pq cuando tengo la mala suerte de jugar contra un brand no puedo pasarme de 3/3/0 o 2/3/0 yo solo e podido jugar contra brand con yasuo y en las dos perd&iacute;, siendo que soy experimentado con yasuo y generalmente no pierdo, pero eso, no he encontrado una buena fuente de informacion para saber como countearlo.\r\nEspero que ustedes me puedan ayudar con esto ya que he visto como otros pierden contra mi hermano y me parece incounteable(aunque tambien influye que sea main brand ya que jugo una vez un brand vs brand y igual gano)\r\nEso, espero que puedan auyudarme. Gracias.","replies":[{"poster":"kipkeior","date":"2016-11-20T05:06:58.622+0000","up_votes":3,"down_votes":0,"body":"http://www.firesafetysupplier.com/media/catalog/product/cache/1/small_image/232x/9df78eab33525d08d6e5fb8d27136e95/3/l/3l_budget_additive.jpg","replies":[]},{"poster":"Yrox the Third","date":"2016-11-20T04:48:32.704+0000","up_votes":4,"down_votes":1,"body":"Con Nami.","replies":[{"poster":"clonmorfo","date":"2016-11-20T05:29:33.410+0000","up_votes":1,"down_votes":0,"body":"win","replies":[]}]},{"poster":"9081913DEL1","date":"2016-11-20T10:22:21.579+0000","up_votes":2,"down_votes":0,"body":"Brand es como todo campeon con skillshots, te le pones a melee. Asi entre skillear y kitear practicamente no camina y le podes hacer lo que quieras.\n\nEl tip mas basico para matar a brand es calcular el daño de tu combo menos 1 hit, y cuando tiene esa vida le engajeas. No tiene escape sin el flash y el stunt se lo podes bloquear.\n\nLo tenes que enfrentar a el no a los minions. \n\nSaludos.","replies":[{"poster":"rokushoger","date":"2016-11-22T18:35:05.311+0000","up_votes":1,"down_votes":0,"body":"Excelente respuesta!","replies":[]}]},{"poster":"Sonya Kyron","date":"2016-11-20T05:04:51.139+0000","up_votes":1,"down_votes":0,"body":"jajaja, Brand es counter de yasuo, no podes counterearlo.\nSi queres counterear a Brand tenes que jugar con un champ fuerte contra el, cualquier mago control de masas o daño ad asesino.\nCreo que ya con esos 2 datos te deje unos 25 champs que le ganan fácil.","replies":[{"poster":"rokushoger","date":"2016-11-22T18:35:57.460+0000","up_votes":1,"down_votes":0,"body":"No te creas, tenes muro contra su stun, y menos la E todo son skillshots, esquivables con la E de yasuo.","replies":[]}]},{"poster":"DanielGarrita","date":"2016-11-20T04:53:59.515+0000","up_votes":1,"down_votes":0,"body":"irle poqueando entre los minions. si no pega su Q no te stuneara y no te pondra la pasiva completa.\n\nbrand para estunearte tiene que tirarle la E o la W antes y despues de eso te tirara la Q pero detras de los minios no puede ya que es un skill shot y es muy delgado.\n\nel combo de E+Q+W es el mas facil de esquivar. pero algunos hacen el combo de W+Q Casi al instante lo que te estunea y te tira la E luego.\npor eso siempre tienes que jugarle detras de minioN\n. brand es uno de mis mains XD","replies":[]}]}