{"poster":"TrueNoxianWrath","date":"2016-10-05T23:37:22.073+0000","title":"@Riot Unintentional/Hidden Riven Buff in 6.20?","subforum":"Gameplay","embed":{"description":"Uploaded by Spyroflex on 2016-10-05.","url":"https://www.youtube.com/watch?v=Er1yVjuxe5w","image":"https://i.ytimg.com/vi/Er1yVjuxe5w/hqdefault.jpg"},"up_votes":14,"down_votes":5,"body":"https://twitter.com/scarra/status/783796215506874368\r\n\r\nThe new attack animation canceling help has made Riven a lot easier to play apparently. Its way easier to animation cancel combo with her atm. \r\n\r\nOne person responding to Scarra notes that this has happened before &quot;at least 4 other times when you guys have re coded auto attacks&quot;.\r\n\r\nPeople that dont never play her say they will play her in their high elo games now. Can we have some feedback or thoughts on this? Riven recently got a decently sized buff on her ult, and now this too?","replies":[{"poster":"Meddler","date":"2016-10-06T00:16:45.568+0000","up_votes":20,"down_votes":2,"body":"Unintentional change from the sounds of it. We've got a couple of folks looking at it at the moment.","replies":[{"poster":"Kobold","date":"2016-10-06T01:37:49.494+0000","up_votes":2,"down_votes":1,"body":"Still wish she had more build diversity or requirements than Rush BC then Maw or YGB would help a bit for those facing her","replies":[{"poster":"The Deckowner","date":"2016-10-06T03:54:22.008+0000","up_votes":2,"down_votes":0,"body":"having more option for item choices seems like a increase in difficulty for her enemy.","replies":[{"poster":"Kobold","date":"2016-10-06T04:50:28.061+0000","up_votes":2,"down_votes":1,"body":"its more that BC has become the same as brutalizer used to be but just so much better. From what I have seen of late BC may just be so far over tuned its not fun to fight most champions who use it. The 30% ARM reduction on a champion that can apply it all in under a full second is what I equate to the cause of my frustration. Very few other champions can apply it so quickly and get as many bonuses from it. Having watched some matches of challenger Riven players who are 0/3 and then get BC which allows them to then get even in score in no time it's not very fun to watch, As Some Riven players have pointed out on reddit its not uncommon for Riven to oneshot someone under tower with little gold advantage and not receive much damage from the event unless the champion has easy access Hard CC. The reason I brought this up is that she has a I finish this item first no matter who I am fighting because it has no downsides for her due to her designed kit. It gives every stat she wants in the game for 3100g while also giving her a bonus stat of HP which she enjoys for the fact of it allows her more tankyness. Its either too cost efficient, or the way she scales with the little it gives is too much. Cuting out the CDR on it would help but that may hurt other lower tier champions that rely on it too much is the issue. \n\nThese are just my thoughts on it, as playing against a riven who rushes the item makes any Armour purchase you made to fight her null once she finishes it.","replies":[{"poster":"ømg","date":"2016-10-06T05:36:38.922+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Rance Eroge King,realm=NA,application-id=3ErqAdtq,discussion-id=QAgFn2Ri,comment-id=0004000100000000,timestamp=2016-10-06T04:50:28.061+0000)\n>\n> its more that BC has become the same as brutalizer used to be but just so much better. From what I have seen of late BC may just be so far over tuned its not fun to fight most champions who use it. The 30% ARM reduction on a champion that can apply it all in under a full second is what I equate to the cause of my frustration. Very few other champions can apply it so quickly and get as many bonuses from it. Having watched some matches of challenger Riven players who are 0/3 and then get BC which allows them to then get even in score in no time it&#x27;s not very fun to watch, As Some Riven players have pointed out on reddit its not uncommon for Riven to oneshot someone under tower with little gold advantage and not receive much damage from the event unless the champion has easy access Hard CC. The reason I brought this up is that she has a I finish this item first no matter who I am fighting because it has no downsides for her due to her designed kit. It gives every stat she wants in the game for 3100g while also giving her a bonus stat of HP which she enjoys for the fact of it allows her more tankyness. Its either too cost efficient, or the way she scales with the little it gives is too much. Cuting out the CDR on it would help but that may hurt other lower tier champions that rely on it too much is the issue. \n> \n> These are just my thoughts on it, as playing against a riven who rushes the item makes any Armour purchase you made to fight her null once she finishes it.\n\nPoint me to matches where they go 0-3 against an enemy top laner then get BC and suddenly turn things around without help from team. I would be very interested in seeing that. From what I've seen (Adrian and Dekar), if a Riven goes 0-3 top lane, that Riven is expected to be a non-factor in the game. A riven \"one shotting someone under tower\" means they have flat armor pen runes and/or flat armor pen items (ghost blade, dusk blade, maw) and are killing a squishy champion with little armor. That's exactly what a Talon would do to a squishy champion by building armor pen, so I'm not sure why you would expect differently out of a Riven who is itemizing similarly. That's what a Fizz will do to a squishy with \"just\" Lich Bane. \n\n\"Lower tier champions\"? What? You mean MF, Jayce (the good jayce players rush BC too), Lucian, etc. who all rely on it? MF having the highest ADC win rates while Jayce and Lucian being very popular in competitive.  All the while Riven has a balanced win rate and is not played competitively. BC provides MANY champions with \"no downsides\" (no downsides is arguable, because that gold spent on BC could have been spent on something else such as ghostblade or maw depending on the situation). How is armor shred, HP, movement speed, CDR, attack damage not as useful on MF, Jayce, Lucian, Zed, Wukong, Talon, Garen, Varus, etc.? \n\nAlso, armor does not suddenly become null with BC. That would mean that just by buying Lord Dominik's ADCs have made tanking worthless so there's no longer a reason to build tanky in this meta. ","replies":[{"poster":"Stephenizgod","date":"2016-10-06T21:35:23.575+0000","up_votes":3,"down_votes":0,"body":"That is like every Riven game, she may not be able to kill you because you obviously have a gold lead and might counter her in some way, but the rest of your team is in serious danger once she finishes BC. Every game I have played against a Riven goes one of two ways lately:  \n\n*  She gets incredibly fed and there is pretty much nothing the other team can do aside from 1v5ing her and sacrificing at least 2 people.  \n*  She gets destroyed in lane, so she goes to a different lane(s) and feeds of them until your only option is to 1v5 her... \n\nThe reason is because she snowballs so freakin hard, once she gets BC shit hits the fan. Part of that is because I am at low elo and no one knows how to do anything, but right now she can be completely overwhelming. I never have any issue against her until my team starts chain feeding her, happens every time because she just goes bot lane, dives them both and is guaranteed at least one kill.","replies":[]},{"poster":"GayFluffyUnicorn","date":"2016-10-06T21:23:55.770+0000","up_votes":3,"down_votes":0,"body":"Riven may have a lot but not a balanced winrate. \nBy far.","replies":[]}]}]}]}]},{"poster":"TrueNoxianWrath","date":"2016-10-06T00:23:16.454+0000","up_votes":3,"down_votes":0,"body":"Ty for the quick response!","replies":[]},{"poster":"Fadingomen","date":"2016-10-08T19:02:49.157+0000","up_votes":2,"down_votes":0,"body":"She needs to be disabled atm. Being able to frontload that much damage with basically no counterplay is fucking absurd.","replies":[]},{"poster":"Dominick Destine","date":"2016-10-06T21:34:09.245+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=QAgFn2Ri,comment-id=0004,timestamp=2016-10-06T00:16:45.568+0000)\n>\n> Unintentional change from the sounds of it. We&#x27;ve got a couple of folks looking at it at the moment.\n\nZMOG RIOT RESPONDED.\n\nWhy Riot never respond to my threads?","replies":[{"poster":"TyrekGoldenspear","date":"2016-10-07T12:25:32.964+0000","up_votes":2,"down_votes":0,"body":"But they did. Several times.\n\nAlso, are you the real DD?\n\nI didn't see one iteration of that \"sexy\" word \"draconian.\"","replies":[{"poster":"Dominick Destine","date":"2016-10-07T15:09:54.514+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=TyrekGoldenspear,realm=NA,application-id=3ErqAdtq,discussion-id=QAgFn2Ri,comment-id=000400020000,timestamp=2016-10-07T12:25:32.964+0000)\n>\n> I didn&#x27;t see one\n\nI often make threads but do not get responses from Riot.","replies":[]}]}]},{"poster":"Fablespeaker","date":"2016-10-09T01:01:19.766+0000","up_votes":1,"down_votes":0,"body":"I'd prefer to keep this change and face a later nerf if it it's considered op than the previous live version. There are other bursty assassin/fighter types who can do as much damage without needing nearly as much mechanical skill ( Jarvan 4 ) and making the skillgap closer would just make it better for all players, new and experienced.","replies":[]}]},{"poster":"DunkinNoobs","date":"2016-10-06T04:43:44.425+0000","up_votes":8,"down_votes":1,"body":"Oh God, this shit again? \n\nLeave it in Rito. Leave it in and then nerf her if she's too strong. Balancing her behind a bullshit mechanical trick is ridiculous and always has been.","replies":[{"poster":"Meddler","date":"2016-10-06T18:51:36.929+0000","up_votes":7,"down_votes":0,"body":"This change doesn't just make it easier to pull off some of Riven's combos, but also increases how quickly really experienced Riven players with good ping can get damage out. We don't want Riven to be any burstier than she already is, so that's not a good trade off.","replies":[{"poster":"DunkinNoobs","date":"2016-10-06T22:30:14.139+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Meddler,realm=NA,application-id=3ErqAdtq,discussion-id=QAgFn2Ri,comment-id=00090000,timestamp=2016-10-06T18:51:36.929+0000)\n>\n> This change doesn&#x27;t just make it easier to pull off some of Riven&#x27;s combos, but also increases how quickly really experienced Riven players with good ping can get damage out. We don&#x27;t want Riven to be any burstier than she already is, so that&#x27;s not a good trade off.\n\nAny chance we can just artificially slow it down and still keep the mechanic? I absolutely love the idea of simplifying Riven's mechanics by keeping this change, but you're right, it's simply too fast right now.","replies":[]},{"poster":"SlashStriker","date":"2016-10-06T21:47:35.416+0000","up_votes":3,"down_votes":0,"body":"So why udyr upon switching stances doesn't reset his auto attack timer who also got 2 seconds cooldown when switching stances but riven gets a buff?","replies":[]},{"poster":"La Bello","date":"2016-10-06T20:43:19.811+0000","up_votes":4,"down_votes":3,"body":"why is still a thing even? The SAME EXACT GLITCH HAPPENED YEARS AGO\nhttps://www.youtube.com/watch?v=xvNFvLdWxT0 and there was a bid debacle about rather or not it should stay\n\nIm at wits end arguing about how obnoxious and ill-support this problematic mechanic is.\n\nWhy does it feel like Riot never wants to talk about their most favorite problem child?!\n\nCan we as a community get a honest answer as to why Rivens \"Quick combo\" has not been outright removed yet?\n\nIts seems like its so much more trouble than its worth and it goes against all of Riots tenants for a healthy balanced character design.\nIs it because you would have to recode her from the ground up and you dont want to spend the resources?\nAre you waiting for some mid year fighter update where your going to completely revamp her with a VGU or something?\nAre you scared that her rabid fanbase will kidnap a Rioter?\nCan the big red button not be pushed until shes a pick/ban in LCS?\n\nGraaah it makes me so mad that this is still a thing and I've yet to hear a single good argument as to why its being kept around from any Rioters.\n(\"I like Riven and if I would be sad if they removed it\" is NOT a valid argument by the way)\n{{sticker:zombie-brand-facepalm}}","replies":[{"poster":"FZ9R6eqXjp","date":"2016-10-09T04:40:48.485+0000","up_votes":1,"down_votes":0,"body":"Eh... that video you posted wasn't a glitch... it was a change that they were going to make.. that it would auto attack after each q without doing anything but pressing q... I personally tried it out and it wasn't as fun as it would be doing the q click on ground aa..","replies":[]}]}]}]},{"poster":"MLDzXnRRR","date":"2016-10-06T07:18:59.618+0000","up_votes":2,"down_votes":1,"body":"They better leave it and finally balance Riven - it's not cool champions to be balanced around gimmicks.\nThey removed most of the cheesy builds and frustrating mechanics from the game over the years.\nWhy is she still allowed to permaCC, attack 3 times in 1 second without any AS steroids or bonus AS, and deal her whole kit damage when the combo is available again in a few seconds.\nIt doesn't make any sense some champions to have hidden powers.","replies":[{"poster":"GayFluffyUnicorn","date":"2016-10-06T21:26:13.708+0000","up_votes":5,"down_votes":0,"body":"Go to champ.gg\nSearch for riven and look at her playrate. \nSame reason yasuo doesn't receive any guts or vayne. \nOther champs with lower fanbases like nautilus, zed, leblanc, sejuani etc. get nerfed into the dumpster with no hesitation.","replies":[]},{"poster":"Archaai","date":"2016-10-07T09:34:46.703+0000","up_votes":1,"down_votes":1,"body":"It seems many people are more frustrated over the fact that experienced Rivens, who manage to do unimaginable things with her, shit on them, than they are about the champion's true state. Do you have any idea how difficult it is for Riven to lane against champions who can simply get a {{item:3024}} on their first back and be unkillable?\n\nA champion being strong in the right hands only seems quite balanced to me. If you don't know how to lane against her, then it's your problem. Perma CC? As if Riven is unkitable...","replies":[{"poster":"MLDzXnRRR","date":"2016-10-07T12:19:38.770+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Archaai,realm=EUNE,application-id=3ErqAdtq,discussion-id=QAgFn2Ri,comment-id=000a0001,timestamp=2016-10-07T09:34:46.703+0000)\n>\n> It seems many people are more frustrated over the fact that experienced Rivens, who manage to do unimaginable things with her, shit on them, than they are about the champion&#x27;s true state. Do you have any idea how difficult it is for Riven to lane against champions who can simply get a {{item:3024}} on their first back and be unkillable?\n> \n> A champion being strong in the right hands only seems quite balanced to me. If you don&#x27;t know how to lane against her, then it&#x27;s your problem. Perma CC? As if Riven is unkitable...\n\nI'm not sure what are you talking about...\nBeing able to do \"unimaginabke things\" is not a good things balance-wise.\nPower creep and overloaded kits are not good for any game.","replies":[{"poster":"Archaai","date":"2016-10-16T18:10:22.819+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=MLDzXnRRR,realm=EUNE,application-id=3ErqAdtq,discussion-id=QAgFn2Ri,comment-id=000a00010000,timestamp=2016-10-07T12:19:38.770+0000)\n>\n> I&#x27;m not sure what are you talking about...\n> Being able to do &quot;unimaginabke things&quot; is not a good things balance-wise.\n> Power creep and overloaded kits are not good for any game.\n\nSince when is winning when you're more skilled at a champion than an average player a bad thing? Riven's kit is not overloaded at all. Having high mobility, an AD-scaling shield and 2 short CC abilities may sound overloaded on paper, but it works completely differently in-game. If you're unable to finish before late game (sometimes even midgame if just one enemy is fed), one single CC ability can nuke her, which in turn forces her to play smart instead of just smashing your keyboard until you get a kill.\n\nRiven can also get countered very hard, and can almost never win lane on her own vs most popular toplaners in the hands of an average player, ever since the masteries changed, which means less snowball from her side and higher chance of losing the game. I believe this is pretty balanced.","replies":[{"poster":"MLDzXnRRR","date":"2016-10-16T19:02:50.225+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Archaai,realm=EUNE,application-id=3ErqAdtq,discussion-id=QAgFn2Ri,comment-id=000a000100000000,timestamp=2016-10-16T18:10:22.819+0000)\n>\n> Since when is winning when you&#x27;re more skilled at a champion than an average player a bad thing? Riven&#x27;s kit is not overloaded at all. Having high mobility, an AD-scaling shield and 2 short CC abilities may sound overloaded on paper, but it works completely differently in-game. If you&#x27;re unable to finish before late game (sometimes even midgame if just one enemy is fed), one single CC ability can nuke her, which in turn forces her to play smart instead of just smashing your keyboard until you get a kill.\n> \n> Riven can also get countered very hard, and can almost never win lane on her own vs most popular toplaners in the hands of an average player, ever since the masteries changed, which means less snowball from her side and higher chance of losing the game. I believe this is pretty balanced.\n\nYou don't win, because you are more skilled - let's say that you fight vs opponent that is equal to you or even better.\nHow do you win?\nWell, if the enemy champ is with longer cds, less mobility, lower stats, of course you will win.\nThe  biggest problem with high mobility champions is that they can engage any time and run, if the fight is unfavourable for them.\nAdd high damage, CC, manaless, shields, AOE = the community \"loves\" such champions {{champion:157}} ...\nPlaying without resources is not problem only in Lol, it's a problem in every game with resource system - for example: \"dredge\" in MTG or all the Legacy/Vintage free spells decks...","replies":[]}]}]}]}]},{"poster":"Slythion","date":"2016-10-05T23:51:41.172+0000","up_votes":3,"down_votes":0,"body":"holy hell...that's insane 0_0","replies":[]},{"poster":"Curious Kat","date":"2016-10-05T23:49:51.436+0000","up_votes":3,"down_votes":0,"body":"Not sure if it was a hidden buff as much as an unintentional buff xD , then again, who knows right now, until we get an official statement of some kind on it.","replies":[{"poster":"TrueNoxianWrath","date":"2016-10-05T23:52:18.110+0000","up_votes":1,"down_votes":0,"body":"{{sticker:slayer-jinx-catface}}","replies":[]}]},{"poster":"AstraVox","date":"2016-10-12T07:27:52.399+0000","up_votes":2,"down_votes":0,"body":"I just wish Riot would adjust Riven's damage output to be the same as her average fast combo, then remove the fast combo altogether. There is no reason for such an awkward animation cancelling to be so important on any champ, and it only makes picking up  Riven for new players that much more difficult.","replies":[]},{"poster":"TyrekGoldenspear","date":"2016-10-06T21:30:13.816+0000","up_votes":2,"down_votes":0,"body":"Ryze OP now.\n\nPoint and click snare.\n\nOutplay this.","replies":[]},{"poster":"The Deckowner","date":"2016-10-06T03:53:14.842+0000","up_votes":2,"down_votes":0,"body":"https://cdn.meme.am/instances/43317546.jpg","replies":[]},{"poster":"Liofa","date":"2016-10-06T01:00:59.393+0000","up_votes":2,"down_votes":0,"body":"championship skin sales weren't high enough\n\nthe fact that meddler just confirmed they're gonna fix it maybe _**next patch**_ pretty much confirms it ","replies":[{"poster":"Ralanr","date":"2016-10-06T03:42:52.495+0000","up_votes":2,"down_votes":0,"body":"Well fuck top.","replies":[]}]},{"poster":"Jacknife","date":"2016-10-06T03:08:52.109+0000","up_votes":2,"down_votes":0,"body":"Ah jeez, this again? Well this'll be fun to deal with top lane. Gonna have to play {{champion:150}} just so she can't do her one-sided trades...","replies":[]},{"poster":"Cipse","date":"2016-10-06T03:02:15.808+0000","up_votes":2,"down_votes":0,"body":"Sapphire Crystal on Riven is OP","replies":[]},{"poster":"Apocalypsic","date":"2016-10-06T00:12:48.697+0000","up_votes":2,"down_votes":0,"body":"As someone who can already fast combo I really think if it gets out of hand none of the Riven's mains are going to bat an eye if they fix that interaction.","replies":[]},{"poster":"Marshbouy","date":"2016-10-05T23:43:27.438+0000","up_votes":3,"down_votes":1,"body":"Aaaaand.\nnow im not going to play toplane for the next week. Thanks for warning me.","replies":[{"poster":"Penns","date":"2016-10-06T00:04:19.202+0000","up_votes":2,"down_votes":0,"body":"Shes probably gonna get disabled/hotfixed for that anyway.","replies":[{"poster":"Ralanr","date":"2016-10-06T03:43:26.907+0000","up_votes":1,"down_votes":0,"body":"Or she's gonna be fixed next patch...this I think they should disable.","replies":[]}]}]},{"poster":"Fablespeaker","date":"2016-10-08T14:32:11.470+0000","up_votes":2,"down_votes":1,"body":"I've learned champion kits faster than I've mastered Riven's Q animation cancel. Please just leave this in and nerf her later if it's a problem, it's pretty hard to focus on animation canceling in teamfights when we're worried about positioning, targets, getting cc'd, ect. Other champs try a lot less hard for bigger payoff.","replies":[]},{"poster":"Slice οf Life","date":"2016-10-07T22:24:27.875+0000","up_votes":2,"down_votes":1,"body":"Don't revert it.\nRiven won't suddenly become super OP, it will only provide more consistent comboing for a certain group of people who have been mastering Riven for months and months... It gives Riven enthusiasts a bit of hope and helps sticking with her instead of picking Warwick and pressing R for 30 minutes. After all her new Q speed doesn't do anything on it's own. \nAnd by the way now at least the Dragonblade skin feels like it should with her normal Q speed, and the difference is noticeably slower and clunkier than let's say Championship Riven.","replies":[]},{"poster":"Alladrios","date":"2016-10-07T09:16:23.788+0000","up_votes":1,"down_votes":2,"body":"Leave it as it is. Riven is weak champion against the beasts out there... If it seems you like acrazy buff nerf her in the future!!","replies":[]},{"poster":"SG Benefitzs","date":"2016-10-06T22:24:15.774+0000","up_votes":1,"down_votes":3,"body":"Until we see some kind of LEGITIMATE reason for this to be fixed, it should not be. No other champion is gated behind some roundabout backwards broken combat style that you have to put in 10x more time to learn than other champs. People who say the riven shouldn't have animation cancelling are wrong, because gutting the only way for a champ to be viable is a stupid and illogical idea. Might as well take annies stun away and vaynes silver bolts away too? leave it as is for the time being and if this really affects winrate that much then yes, nerf it. but until she is above 55% winrate then i see no reason. As someone who is put hundreds of games into Riven the way she feels after the change not only lets less experienced players actually enjoy playing the champion but give them a way to actually play the champion like everyone else. The idea that a champ should only be accessible to the elite players is both selfish and toxic, and the main reason why riven players have the stigma they have. You can't play the champion without getting shit on by your teammates, something that doesn't happen to any other champ. This is the riven change that has been needed for years and \"fixing\" something that isnt broken is one of this games biggest flaws.","replies":[]}]}