{"poster":"Gehirn","date":"2016-07-05T02:00:29.899+0000","title":"Queue schedule - Updated for 6.15!","subforum":"Announcements","up_votes":4,"down_votes":1,"body":"Updated queue schedule below.\n\n**On all the time:**\n\nSummoner&#039;s Rift 5v5 Normal Blind Pick\nSummoner&#039;s Rift 5v5 Ranked Dynamic Queue\nARAM\nCo-op vs AI Summoner&#039;s Rift (intro/beginner/intermediate)\n\n**Summoner&#039;s Rift 5v5 Ranked Teams:**\n\nWeekdays: 07:00pm - 01:00am AEST\nWeekends: 05:00pm - 01:00am AEST\n\n**Rotating Game Mode:**\n\nFriday: 11:00am - 3:00am AEST\nSaturday: 11:00am - 3:00am AEST\nSunday: 11:00am - 3:00am AEST\nMonday: 11:00am - 3:00am AEST\n\n**Twisted Treeline:**\n\nTuesday: 3:00pm - 1:00am AEST\nWednesday: 3:00pm - 1:00am AEST\nThursday: 3:00pm - 1:00am AEST","replies":[{"poster":"Tons of Segs","date":"2016-10-14T22:27:07.084+0000","up_votes":2,"down_votes":0,"body":"You know what I don't see?\n\nNormal Draft...","replies":[]},{"poster":"Pikachoochoo","date":"2016-07-07T07:49:55.280+0000","up_votes":2,"down_votes":1,"body":"I miss buying leviathans, mejais, and occult on Kat :l \nLol good'ole days where Hecarim would buy a second force of nature as boots. o_____________ o","replies":[{"poster":"Brendaddy","date":"2016-08-04T19:25:47.671+0000","up_votes":2,"down_votes":0,"body":"I miss, when everyone who didn't buy a heart of gold was outright behind in money.\nBut yeah, couldn't agree more on the Kat thing.","replies":[]}]},{"poster":"Roguestoney","date":"2016-07-09T22:05:41.825+0000","up_votes":3,"down_votes":1,"body":"Why not trial ranked 3v3's under the current 3v3 schedule @riot...?","replies":[{"poster":"Gehirn","date":"2016-07-13T07:46:46.118+0000","up_votes":2,"down_votes":1,"body":"We recently re-assessed releasing Ranked TT, looking at OCE and larger regions currently running the queue. Indications are very solid that the queue would not succeed even on an extremely limited schedule.","replies":[{"poster":"SmaugCity","date":"2016-10-12T16:33:45.750+0000","up_votes":1,"down_votes":0,"body":"I'm actually really curious how you got to this conclusion? Was it based on past results or potential results? I know RTT in NA always suffered from a really low player base (mostly comprised of older players who started playing with all the game modes back in in S1/2) but lots of Bronze players were taking it up as an easier way to get the Silver or Gold Summoner Icons. Perhaps this could be used to incentivise new players - different season rewards for RTT?","replies":[]},{"poster":"Roguestoney","date":"2016-07-13T10:20:10.372+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Riot Gehirn,realm=OCE,application-id=3fteLeTW,discussion-id=BX05N9lh,comment-id=00030000,timestamp=2016-07-13T07:46:46.118+0000)\n>\n> We recently re-assessed releasing Ranked TT, looking at OCE and larger regions currently running the queue. Indications are very solid that the queue would not succeed even on an extremely limited schedule.\n\nThanks for the reply really appreciate it. I wonder if perhaps 1 day out of the 3 may be viable in the future. Hopefully it can be a thing :^)","replies":[{"poster":"Soulless Reaper","date":"2016-11-02T12:08:45.318+0000","up_votes":1,"down_votes":1,"body":"No.. It won't. It's Riot, don't expect anything from them <3","replies":[]}]}]}]},{"poster":"OG Rudy","date":"2016-09-24T03:54:36.981+0000","up_votes":1,"down_votes":0,"body":"wheres the free porn!?","replies":[]},{"poster":"TGR Lust","date":"2016-09-20T19:39:41.996+0000","up_votes":1,"down_votes":0,"body":"does anyone know when the servers will be back up for oceania???? \n\nplz help  :)","replies":[]},{"poster":"MrBrandon","date":"2016-09-02T13:16:25.850+0000","up_votes":1,"down_votes":0,"body":"I feel like URF Should be added to rotation more since its only been twice this year alot of people like messing around in different modes alot of people are interested in URF but we rarly see it we see game modes like Hexakill were alot of people don't like because of the map and its to clustered i feel like you guys should atleast do urf 4-8 times a year so people can experience it more i have talked to alot of people about league and they all say urf is there favorite game mode.\nThank you for reading.","replies":[{"poster":"Nightjar","date":"2016-09-07T06:59:11.604+0000","up_votes":1,"down_votes":0,"body":"I agree bring back urf, but I also want mirror mode one for all and other weird and inspired gamemodes to mess with like unlimited gold first team to 20 kills with guardian angel removed and zilean banned in twisted treeline; and DOOM BOTS bring back Doombots.","replies":[]}]},{"poster":"ciaô","date":"2016-09-01T01:55:16.481+0000","up_votes":1,"down_votes":0,"body":"ranked TT would be awesome! most players in OCE prefer it more than 5v5","replies":[{"poster":"LevvyLeviticus","date":"2016-09-16T12:11:25.234+0000","up_votes":1,"down_votes":2,"body":"yeah...\nI'm prety sure no-one prefers TT","replies":[]}]},{"poster":"Delorial","date":"2016-07-07T06:54:20.795+0000","up_votes":1,"down_votes":0,"body":"Is there a schedule for \"Rotating Game Mode\", as in any way to see what game is going to be on what weekend? I like some of them, and hate others, and have a busy life so would like to schedule for the fun ones\n\ncheers","replies":[{"poster":"Gehirn","date":"2016-07-13T07:21:07.121+0000","up_votes":1,"down_votes":0,"body":"We make news posts every week about the upcoming game mode and give a 3 week forecast for upcoming modes:\n\nhttp://oce.leagueoflegends.com/en/news/game-updates/gameplay/rotating-game-mode-queue-now-live-12\n\nThis and next weeks' mode will be one that you haven't played before.","replies":[{"poster":"Delorial","date":"2016-07-22T04:51:44.535+0000","up_votes":1,"down_votes":0,"body":"Thanks for the reply man(or woman)! appreciate it","replies":[]},{"poster":"The Maximiser","date":"2016-07-22T09:12:21.577+0000","up_votes":1,"down_votes":8,"body":"i see soooooooooooooooo much hate for this company at the moment... and i cant disagree why would you put a trash game mode on like nexus seige.\n\nlove the game hate the decisions.  EVERY SINGLE PERSON WHO PLAYS LEAGUE OF LEGENDS WANTS THE ORIGINAL GAME MODE ROTATION, WE PUT UP WITH ACCENSION CUZ WE NO URF IS CLOSE BY.\n\ni was wondering if possable at al to make a poll so that it is clarified.. \n\nno hate, but the dissapointment is real..","replies":[{"poster":"Nightjar","date":"2016-08-18T13:05:30.178+0000","up_votes":1,"down_votes":0,"body":"I liked urf, one for all, (maybe make a mirror one for all?) and ascension all the same but I really want something different. As a newer player maybe a throwback gamemode would be fun, like a gamemode that uses maps from really early seasons (I really want to try out green buff and the old twisted treeline) with really old items. Doesn't need to be balanced, people would just have fun playing on different maps with different and unusual build options like force of nature, heart of gold, wriggles lantern, ect... Nostalgia and you don't even need to retexture the map really. Let it look old and crappy because it will help build appreciation for the new map textures and I'm sure just as many people would enjoy the old look of the map as much as the new one.\n\nThis new gamemode would require some work but probably less than nexus siege and would most likely be better received. (I have never seen people act more toxic than in nexus siege, like people in ascenion, urf or even definitely not dominion are chill but not nexus siege) so it would simply involve digging up some old backups of the textures and items and fitting them in. I'm sure there would be some broken combos with new champs and reworks and old items with new masteries but I feel that would be half the fun of it.\n\nYou could even give it a 'time' theme and tie it together with zilean and ekko somehow for thematic presence.","replies":[]}]}]}]},{"poster":"Jayhawk","date":"2016-07-22T02:08:59.456+0000","up_votes":1,"down_votes":0,"body":"Why did we go back to back on Nexus Siege? Wasn't the point of the rotating game mode to keep them rotating so that they didn't get stale? \n\nNo offence, but I got bored of Nexus Siege after three or four games last week when people just kept throwing out the same picks alongside my friends I was playing with and having it a second week in a row is just frustrating.","replies":[]},{"poster":"ghostchip101","date":"2016-07-20T12:50:52.227+0000","up_votes":1,"down_votes":0,"body":"why is ranked down??","replies":[]},{"poster":"arthurthemagical","date":"2016-07-08T09:13:05.113+0000","up_votes":1,"down_votes":0,"body":"Will this update not work properly in oce? Because i go to update and all it says is update failed and its just not working for me not sure if its my connection or not either","replies":[]},{"poster":"lolmaster121","date":"2016-09-21T13:27:19.651+0000","up_votes":1,"down_votes":1,"body":"Riot,\nI was just wondering if you would please increase the times for some of the more popular game modes such as urf because they are usually on once or twice a year and it is really disappointing for something so fun to pass so quickly. maybe could you increase the frequency of these game modes or maybe increase the scheduled dates from 4 days to about a week or more.","replies":[]},{"poster":"Kenjix","date":"2016-09-10T15:44:08.404+0000","up_votes":2,"down_votes":2,"body":"Sub my youtube boys {{summoner:4}} {{item:1408}} {{champion:64}}","replies":[{"poster":"Lordman","date":"2016-10-27T20:09:30.093+0000","up_votes":0,"down_votes":1,"body":"hey do you know how i can get the new patch with the assassin rework?","replies":[]}]},{"poster":"WalkingAbyss0145","date":"2016-07-31T04:59:12.465+0000","up_votes":1,"down_votes":1,"body":"When is Project Ekko meant to be available for purchase on the live servers? I","replies":[{"poster":"tbonelewigi","date":"2016-09-07T07:44:36.365+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=WalkingAbyss0145,realm=OCE,application-id=3fteLeTW,discussion-id=BX05N9lh,comment-id=0007,timestamp=2016-07-31T04:59:12.465+0000)\n>\n> When is Project Ekko meant to be available for purchase on the live servers? I\n\nyou are that one guy who doesn't complain about the rotating game modes!!! \n\nI salute you{{summoner:21}}","replies":[]}]},{"poster":"Ascalon127","date":"2016-08-22T08:48:05.817+0000","up_votes":1,"down_votes":1,"body":"so rito, the question 90% of all League players are all asking, is.... WHEN IS URF\nSeriously you guys said that all gamemodes will be evenly spread out. So please explain to me why, every weekend i get on League HOPING FOR A WEEKEND OF URF when all i see is bloody hexakill or poro king or something else boring. PLEASE BRING BACK URF\n{{item:3070}}","replies":[]}]}