{"poster":"Rhaastpado","date":"2016-12-18T06:20:08.585+0000","title":"Los Mejores Junglas De La Season 7 (Explicado)","subforum":"Guias y consejos","up_votes":3,"down_votes":3,"body":"Ayer sub&iacute; un post que les gusto a mucha gente! &quot;Los champs mas usados en Bronce 5 (explicado)&quot; y esta es una &quot;continuaci&oacute;n&quot; pero esta ves desde la Jungla, Todo esto lo Dare con mis experiencias de la S6 y S7, y Dire los que mejor hacen la Jungla, y Los que mejor gankean, Esto solo sera un Top 5 As&iacute; que si un Jungla que creen que tiene estas caracter&iacute;sticas y no aparece, d&iacute;ganmelo. \r\n\r\nJUNGLAS :  Lee Sin, Xin Zhao, Pantheon, Zac, Nocturne.\r\n\r\nLEE SIN  : Un campe&oacute;n  de que hay mucho que decir, es dif&iacute;cil, Tiene mucha facilidad a la hora de junglear, y Es uno de los mejores a la hora de gankear (no digo que es el mejor por cuestiones de preferencias). Su Dificultad es mucha, y en mi opini&oacute;n juego bien lee sin, pero no me considero main, ya que los mejores lee sin gankean de 10, tiran una Q, Ulti y a su torre fuiste, Es muy bueno, Y muuuuy recomendable jugarlo en normales hasta dominarle, hasta puedes practicar en una personalizada! y dominar su nivel.\r\n\r\nLEE SIN COUNTERS : Esto Campeones pueden ser muchos, ya que si logras esquivar su Q Lee Sin quedara indefenso en su mayor&iacute;a, pero los Mata chinos en la Jungla Son : Xin Zhao, Zac (si lo sabes ocupar ) Riven (esta la est&aacute;n ocupando mucho en la Jungla ).\r\n\r\nXIN ZHAO : Otro Chino oriental que es muuy fuerte, tiene unos de los mejores ganks gracias a su Q,E, Y Ulti, No es muy dificil de usar, y es bastante econ&oacute;mico ya que su precio en PI Es de 1350, y te aseguro que te los devolver&aacute;, Yo soy &quot;main&quot; Xin Zhao, escribo entre comillas ya que estoy seguro que hay alguien mejor que yo leyendo este Post. Analizando : F&aacute;cil de aprende y usar, Economico Y Fuerte a la hora de gankera,matar y tumbar torres.\r\n\r\nXIN ZHAO COUNTERS : Muy dif&iacute;cil encontrar counters para este champ, Pero uno es Jarvan IV o J4, Ya que tiene mas da&ntilde;o y su Combo Q,E,R es destruye todo. Otros son Pantheon, por su W y Q con poco enfriamiento, Zac, por su pasiva que le salvara la vida, y Garen, aunque no sea Jungla :v.\r\n\r\nPANTHEON : El panadero con lanza de mantequilla es muy f&aacute;cil de usar y aprender, su combo es sencillo, W,Q,E y un ignite si es que tienes, Su ulti es muy buena para gankear, y para escapar a lo TP de Soaz, Es mas tanque que ad, y ahora tiene que ser un poco AP, igualmente no quita que puedas avanzar una o dos divisiones con Pantheon.\r\n\r\nPANTHEON COUNTERS : Lee Sin,Riven,Nocturne, Estos y algunos mas, como puede ser Rumbler  (si lo sabes ocupar)  Jarvan IV, con su combo, y algun otro que pueda darle un combo, sin que la pasiva de Pantheon  intervenga.\r\n\r\nZAC : En mi opini&oacute;n, uno de los primeros junglas que jugu&eacute; estando gratis, y me fascino, es de un nivel intermedio, Sus combos pueden ser el que tu quieras, ya que no hay mas da&ntilde;o metiendo ciertas habilidades, y me parece (Con Lee Sin) uno de los mejores gankeando gracias a su Ulti y Q.\r\n\r\nZAC COUNTERS : Riven,Pantheon,Jarvan IV. Todos por sus Stuns que puede cagarle  la escapada a este campe&oacute;n, y hacerlo Gelatina :v.\r\n\r\nNOCTURNE : Uno de los mejores!! el inigualable hermano de zed nacido en la jungla es Nocturne, Tiene mucha facilidad para Gankear, ya que su Ulti y  E Puede pasarle una mala jugada al enemigo, Tiene mucha facilidad para la jungla, por su pasiva que roba vida, Y aunque muchos lo hagan AD (da&ntilde;o f&iacute;sico) es mas recomendable hacerlo TANQUE! Aguanta mas y f&aacute;cilmente llega a los 100 de da&ntilde;o por b&aacute;sico (para el que diga que si tanque no tiene da&ntilde;o). Un respectivo jungla muy f&aacute;cil de  aprende con su combo R,E,Q,W ( Opcional ) Y un ignite si es que traen.\r\n\r\nNOCTURNE COUNTERS : Jarvan IV,Shaco ( si juegan bien con sus cajas y Q) Pantheon, Y Otros tanques ad que puedan matarlo, o solo AD&#039;s, y al inicio tambi&eacute;n Rumbler.\r\n\r\nLOS NO INCUIDOS : Shaco,Riven,Jarvan IV,Rumbler. No los incluir por que me parece que estos champs tendr&iacute;a que analizarlos mucho mas que los incluidos, Son f&aacute;ciles pero tiene mucha prioridad a la hora de meter combos y saber jugarlos, Eso no quita que sean unos de los mejores Junglas con Shaco o J4, Pero solo fue cuesti&oacute;n  personal no incluirlos.\r\n\r\nGracias por leerlo, Escr&iacute;banme si es que quieren que haga lo mismo con los AD Carry&#039;s y La BOT LANE, O El MID, Gracias por llegar hasta ac&aacute;, y les agradezco por el apoyo del post anterior, Bye Bye!.","replies":[{"poster":"Vi Sexual","date":"2016-12-18T06:36:57.070+0000","up_votes":2,"down_votes":0,"body":"Va a sonar muy ironico que lo diga yo, pero con la maestria nueva del coloso + su pasiva, incluiria a Vi {{champion:254}}  en la lista, aunque siempre fue un champ fuerte en la jungla (sacando el nerfeo a su ulti que basicamente la \"saco\" del meta) y es un champ con el que se puede carrear bastante facil en SoloQ y mas aun en elos bajos.\n\nLo recomiendo.","replies":[]},{"poster":"Ponce9595","date":"2017-12-07T10:28:00.517+0000","up_votes":1,"down_votes":0,"body":"Yo opino diferente yo creo que el jungla va depende a la composición de tu equipo, cuántas veces vimos que llega el late o midgame y los junglas de daño explotan ya que los focusear para sacar barón. \nYo soy main sejuani y considero que es uno de los jungla más completos, tiene muchisimo control de masas, es muy duro y es uno de los que más fuerte pisa en la jungla, en una tf puede meterte hasta 6 stuns sin contar la Q y realentizarlos en área, además se caracteriza por ser un tanque con daño explotando el hielo, y a la hora de pelear un objetivo es un jungla que puede pararse en la línea frontal, una sejuani bien armada puede hacer desastre. \nPodés solear ADC con un combo. Claro, tenés que gastar tu definitiva, tu combo entero, pero si lo pensamos de esta forma.. un asesino también suele utilizar todas sus habilidades, con la diferencia de que como entra muere y con suerte se escapa. \nYo uso mucho a jarvan y en mi opinión es patético hacerlo de daño, yo lo armo con una hydra y el resto tanque. \nLos ganks no necesariamente tienen que ser hiper dañinos, sino efectivos.. gane muchas partidas porque el otro equipo tenía un jarvan que era una pluma que se encierra en un cataclismo y muere. \nYo intento encerrar a los que hacen daño gracias a su capacidad de iniciación y luego activo armadura petrea y aguanto los golpes mientras el team los revienta. \nSejuani tiene facilidad de gankeo? Si. Pero tiene pequeñas mecánicas, hay que saber direccionar su W y utilizar la Q para el cuarto básico.","replies":[]},{"poster":"ZanahoriaAsesina","date":"2016-12-18T06:32:42.706+0000","up_votes":1,"down_votes":0,"body":"Pense que el combo del panadero era Q -> W -> E -> Q","replies":[{"poster":"MothraxGojira","date":"2017-07-13T00:15:49.608+0000","up_votes":1,"down_votes":0,"body":"en realidad es simple el combo de panth tiene bastante creatividad a la hora de como quieras empezar, la cosa solo es saber utilizar el reinicio de pasiva que te da la w a la hora de recibir basicos. lee y pant se tienen sinergia la cosa es si el jugador de pantheon sabe utilizar la w y lee lo mismo. {{sticker:slayer-jinx-wink}}","replies":[]},{"poster":"Rhaastpado","date":"2016-12-18T11:17:09.990+0000","up_votes":1,"down_votes":0,"body":"Puede funcionar pero si le metes la W antes queda mejor, por que te da un espacio para ignite o castigo. igual funciona","replies":[]}]},{"poster":"Anivia420","date":"2016-12-18T07:04:22.483+0000","up_votes":1,"down_votes":0,"body":"Lee counter de panth? es al revez bro","replies":[{"poster":"Rhaastpado","date":"2016-12-18T11:16:25.691+0000","up_votes":1,"down_votes":0,"body":"No jajaja lee le quita la pasiva a Pantheon y lo hace volsa","replies":[{"poster":"Anivia420","date":"2016-12-18T21:07:59.156+0000","up_votes":1,"down_votes":0,"body":"no bro , pantheon le puede parar la Q a lee con su stun le hace alto counter bro","replies":[{"poster":"Rhaastpado","date":"2016-12-19T05:46:33.789+0000","up_votes":1,"down_votes":0,"body":"? le pega la Q lee se tira, bisico, fuera escudo, y E W R","replies":[]}]}]}]}]}