{"poster":"Ninox","date":"2018-02-06T04:02:58.324+0000","title":"Universal Rules - Updated (Test)","subforum":"subtestingboard","up_votes":2,"down_votes":0,"body":"#Universal Rules\r\n\r\nNo one likes rules, but some are necessary for people to co-exist with one another, and to keep an environment where we all can feel safe in expressing and discussing our opinions. These rules were created to prevent total chaos and encourage a healthy environment for discussion. These rules change over time, with help from our boards volunteers and from you guys, the players!\r\n\r\nOur moderation team that watch the boards will make sure that content posted is in compliance with the rules. Please take a moment to read them, and if you find content in violation, **please use the report button, it helps us out a lot!**\r\n\r\nPlease note that the rules below aren&#039;t going to define everything that will be moderated, but one of the goals with these rules were to reduce as much ambiguity as possible. As such, we reserve the right to moderate any content on the Boards at our discretion, should we feel it&#039;s necessary.\r\n\r\nRepeat offenders will be likely be hit with restrictions on their boards accounts, so please be aware of the rules when posting.\r\n\r\n___\r\n\r\n#tl;dr\r\n\r\n* Respect your Fellow Players\r\n* No Reporting Other Players/Naming and Shaming\r\n* No Inappropriate Discussions\r\n* No Spamming\r\n* Adhere to Board Guidelines\r\n* No Account, Product and Service Promotion\r\n* No Illicit Activities\r\n\r\n___\r\n\r\n#Respect Your Fellow Players, and Their Opinions\r\n\r\nJust because you&rsquo;re anonymous doesn&rsquo;t mean you can be an arsehat. Posts that cross the line will be deleted. Repeat offenders may be permanently kicked out.\r\n\r\nThat said, this is a platform to voice your opinions so long as they fit within the rules and audience of the boards.This isn&#039;t &quot;no holds barred&quot; and discussions that are extremely controversial, have potential to incite hatred, or are simply posted in the interest of provoking a negative response, will also be removed. We want to encourage good discussions, not ego battles.\r\n\r\nWe would also ask you to please not respond to attempts to provoke, troll or bait you. Posts you feel violate the Universal Rules should be reported using the &quot;Report&quot; button.\r\n\r\nThreats of any kind, whether they be directed at Riot, Players, whomever - will not be tolerated. If you threaten members of our community, you will be removed from it, and if we think you&#039;re in any way serious this will be passed on to the relevant authorities for investigation.\r\n\r\n**Some examples of content that will be moderated:**\r\n\r\n* Players harassing others\r\n* Players posting content that is deemed to be offensive\r\n* Players attacking other players based on their opinions, language/grammar, ranked status etc\r\n* Players making baseless complaints or contesting private matters that isn&#039;t relevant to an active discussion\r\n* Players provoking or encouraging conflict/hate/mockery\r\n___\r\n\r\n#Reporting Other Players/Naming and Shaming\r\n\r\nPlease don&rsquo;t name names. We know that players report publicly with the best intentions, but it often leads to a witchhunt, rarely resulting in a positive discussion, so we strongly encourage you to report properly.\r\n\r\nThe absolute best place to report is the post game reporting system, if you want a behaviour to be noticed and improved this is the very best thing you can do. If you do feel that something isn&rsquo;t being addressed appropriately you can [submit a ticket to player support](https://support.riotgames.com/hc/en-us/requests/new).\r\n\r\nAs an absolute last resort, the volunteers have a means for you to report players to them [here](https://goo.gl/forms/FN7Er0sdkYcysx0p2). Please be aware that this isn&rsquo;t any sort of direct report, and shouldn&rsquo;t ever be used in place of proper methods of reporting, but if you feel that something isn&rsquo;t being addressed, it&rsquo;s a place for you to know the report has been seen by a person.\r\n\r\n**Some examples of content that will be moderated:**\r\n\r\n* Posts that accuse others of being toxic players in-game\r\n* Posts accusing others of malicious activity\r\n* Posts that accuse others of cheating or using illegal services\r\n* Posts accusing others of breaking boards rules (there&rsquo;s a report button for that) \r\n* Posts claiming to have &quot;reported&quot; someone (There&#039;s no need to post this information)\r\n\r\n___\r\n\r\n#Inappropriate Discussions\r\n\r\nWith regards to mature content, this one is a no brainer and important for everyone to read carefully. We know that this community tends to be more mature, but there are kids here, too. Many players vary in age, and there are some things that children and young adults shouldn&#039;t see. We don&rsquo;t want to see any nudity, or real life gore. Violations of this rule will be dealt with swiftly, and seriously. You could lose your in-game account if you mess up here.\r\n\r\nPast that, League of Legends caters to a wide audience of players, and while you may be an adult and want to talk about adult things, these boards are not the place for that. This is a gaming community, not a place to discuss political agendas.\r\n\r\nWhile you may genuinely be trying to have a mature discussion, if our moderators feel like the discussion has potential to derail and become something not fit for these boards, we may proactively remove these sorts of threads. Our moderators will give you a detailed explanation as to why in these instances.\r\n\r\n**Some examples of content that will be moderated:**\r\n\r\n* Pornographic materials of any kind\r\n* Depictions of gore, death, horrifically violent acts, etc\r\n* Links to inappropriate or NSFW content\r\n* Discussion pertaining to Religion, Sex, Politics or Social Issues (though some exceptions may be appropriate e.g Internet Legislation)\r\n___\r\n\r\n#Spamming\r\n\r\nSpam isn&#039;t difficult to avoid. We want to encourage good, meaningful discussions on the boards - and spam is counterproductive to that. \r\n\r\nThere aren&#039;t a lot of reasons to post the same content in multiple places, and if it&rsquo;s not appropriate to do so, the subsequent posts will be deleted. Comments that are intentionally or wildly off topic will also be removed. There&rsquo;s no reason not to simply create a new post for content like this, and it only muddies discussion.\r\n\r\nThere *is* a limited amount of grey area involved (e.g a discussion goes off topic by accident or by tangent) but intentionally stepping on the wrong side of the spam line will result in deletion.\r\n\r\n**Some examples of content that will be moderated:**\r\n\r\n* Repeated posts of the same content or duplicate posts in multiple boards\r\n* Posts that are entirely irrelevant to a topic and/or are derailing it\r\n* Posts that have entirely no purpose or discussion value\r\n* **Excessive** swearing\r\n\r\n___\r\n\r\n#Adhere to Board Guidelines\r\n\r\nWe want each community to have its own unique culture and clear purpose, which makes it important for you to post content in the correct place. Each board has detailed Guidelines that should make clear what&rsquo;s acceptable, and what&rsquo;s not. Moderators will evaluate your post against the Universal Rules and the customised Guidelines set for each sub board. Content that isn&#039;t appropriate for the board will be removed.\r\n\r\nAs an extra special reminder since it&rsquo;s often a point of confusion, Help and Support is **not** for discussions, and doesn&rsquo;t appear on the front page. Help and Support is for technical issues, not &ldquo;why did this get me banned&rdquo; or any other discussion based issues.\r\n\r\n___\r\n\r\n#Account, Product and Service Promotion\r\n\r\nIf you&rsquo;re trying to promote or sell a product or service, there are other websites for that. If you&rsquo;re trying to sell a game account or service that violates our TOS, please don&rsquo;t; however, if you absolutely have to try it here, expect that you&#039;ll be losing access to the boards and possibly your game account. Coaching services are often an exception to this rule, but will be assessed individually. TL;DR: posts attempting to sell anything will be removed. Serious offenders will feel the wrath of the banhammer.\r\n\r\n**Some examples of content that will be moderated:**\r\n\r\n* Advertising for product sales of any kind\r\n* Advertising for services offered by individuals or companies\r\n\r\n___\r\n\r\n#Illicit Activities - Hacks/Illegal Downloads, Phishing and Scamming, Illegal Activities \r\n\r\nDo not share links or information related to obtaining illegal software. To us, this includes cheats or exploits that create an unfair advantage in-game. We&rsquo;ll be removing all links and posts that give such information. Repeat offenders will lose access to the boards, and in some cases, a lot more.\r\n\r\nTrying to get a leg up on others through scamming, or forcing an account breach is a serious no-no. This is theft. It&rsquo;s stealing from your fellow players. It&rsquo;s pretty unfair. We have a whole team at Riot Games dedicated to battling this and they take it seriously.\r\n\r\nIllegal activity is just that. Discussion of anything like this will result in removal, and more than likely a harsh suspension or permaban to your account. Posts about illegal activity will also be escalated to the proper authorities.\r\n\r\n**Some examples of content that will be moderated:**\r\n\r\n* Posts with links to download software that give an unfair advantage in-game\r\n* Posts that link to pirated movies, music, software, etc.\r\n* Discussions that imply, promote, or reference illegal downloads.\r\n* Posts about services claiming to be an RP generator\r\n* Links to phishing sites\r\n* Posts designed to bait someone into a trap","replies":[]}