{"poster":"Vintantz","date":"2016-07-30T18:11:58.425+0000","title":"Kann man nach den Aufstieg einer neuen Liga, durch Inaktivität absteigen?","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":0,"body":"Guten Tag,\r\n\r\nalso ich bin seit gestern von Platin 1 auf Diamant 5 aufgestiegen und habe dementsprechend auch 0 Punkte. Habe seitdem 2 Niederlagen gehabt, nun ist die Frage ob ich durch Inaktivit&auml;t auf Platin 1 zur&uuml;ckfallen kann? Da ja man normalerweise erst absteigt, nachdem man mindestens 1x gewonnen hat. \r\n\r\nMFG","replies":[{"poster":"Skagerak","date":"2016-07-31T01:57:08.436+0000","up_votes":1,"down_votes":0,"body":"Nach 28 verlierst du das erste mal Lp ab dann jede Woche wieder. In Diamant verlierst du direkt 50 in Platin 45 oder 35 (bin mir nicht ganz sicher) und ab Gold 1 kannst du nicht durch Inaktivität absteigen.\nWas du wahrscheinlich meinst ist das du soegesehen einen kleinen Schutz hast wenn du neu aufgestiegen bist bei Divisionnen sind das so ca 5 Losses die du brauchst und dann steigst du wieder ab ( auch nur aus eigener Erfahrumg genau kann dir niemand sagen wann du absteigst), also wenn du grad neu hochgekommen bist und bei 0 lp nur noch verlierst. \nBei neuen Ligen aslo Platin 1 auf Dia 5 ist diese Toleranz aber viel größer. Deine MMR muss da ca eine ganze Liga also Platin 5 Niveau erreichen damit du da absteigst. Ich habs noch nie hinbekommen soviel zu verlieren kommt halt auch sehr drauf an welche MMR du gerade hast ( die MMR kann man leider nicht nachschauen) deswegen kann man nur spekulieren wie genau das abläuft. \n\nWenn du einfach auf Dia chillen willst kannst du auch einfach alle 27 ein game machen und bleibst so auf Dia.( du bekommst eine Nachricht im client wenn du kurz vorm afk sein bist) \n\nHoffe ich konnte dir weiter helfen.\n\nMfg Skagerak","replies":[]},{"poster":"ClAO KAKAO","date":"2016-07-30T18:25:26.692+0000","up_votes":1,"down_votes":0,"body":"Bei Diamond ist es glaub ich 1 Monat oder so ~","replies":[]},{"poster":"Chaki","date":"2016-07-30T18:16:30.582+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Vintantz,realm=EUW,application-id=ip27PlEH,discussion-id=yef6FH4k,comment-id=,timestamp=2016-07-30T18:11:58.425+0000)? Da ja man normalerweise erst absteigt, nachdem man mindestens 1x gewonnen hat. \n\nWo hast du denn diese Info her?\nNatürlich kann man mit ausreichend Niederlagen auch ohne einen Sieg absteigen, ich weiß nicht wieso das nicht so sein sollte. Und um deine Frage zu beantworten, ja man kann durch Inaktivität absteigen.","replies":[{"poster":"Vintantz","date":"2016-07-30T18:20:30.344+0000","up_votes":1,"down_votes":0,"body":"Danke für die Antwort. Die Information habe ich durch eigene Erfahrung gehabt, da ich noch nie bei einem Liga- Divisionsaufstieg abgestiegen bin, immer erst nachdem ich mindestens 1 Spiel gewonnen habe. Und vielen Dank für die Korrektur diesbezüglich.^^","replies":[]}]}]}