{"poster":"BranchofSin5580","date":"2015-03-31T17:20:03.469+0000","title":"Why aren't adcs like Miss Fortune, Varus and Ashe getting buffed?","subforum":"Gameplay","up_votes":116,"down_votes":20,"body":"Seriously, they need some help.\n\nBoth Talon and Ashe would be a lot better if their passives were switched around. \n\nTalon doesn&#039;t exactly need to AA as frequently as Ashe to farm. \n\nHe can stack the passive quicker, and Talon has been a champion who has been struggling quite a bit ever since they removed the 1 second Silence for a 0.25 99% slow.\n\nAshes auto attacks would deal 10% more damage to whoever is under crowd control effects, which is supposed to be her thing anyways. \n\nThe passive is also called Mercy, and she is the most mercifull of all the three Queens of the Freljord. It would only make sense.\n\nThe other passive is called Focus, way more suitable for a champion who just needs to pick a single target out of a teamfight and de1337 them, rather than slowing everyone down.\nWhich suits Talons passive, although he kind of is an AoE Assassin tbh.\n\nThat&#039;s why Ashe is an Utility carry, the complete opposite of Jinx. \n\nA champion who already has those 10% more damage by default on her Fishbones.\n\n---\n\nMiss Fortune needs her Impure shots damage to be switched from Magical damage to Physical damage.\n\nAnd she needs her Bullet Rain to scale with Attack damage, rather than Ability Power.\n\nSeriously, it already feels weird enough to have a spell who scales with one single stat, yet deal the other type of damage.\n\nImagine having both, in the same kit, yeah... That&#039;s basically Miss Fortune. \n\nHer Impure shots scale with AD but deal Magic damage. Her Bullet Rain scales with AP but deals Physical Damage.\n\nWhy? And tbh, this change would probably not even be enough to make her a worth while pick.\n\nHer Ultimate is the bane of her. She can&#039;t use it in a teamfight, ever. Even if she is staying all the way back.\n\nBullet Rain locks herself in place AND she has no escape tool whatsoever.\n\n---\n\nVarus is like an Ashe with way more utility in his kit, but a medicore kit nontheless.\n\nHis Passive should be replaced with his W passive, while being given a new W.\n\nI hardly notice the passive itself, mostly because it forces me to focus a low health minion to keep it up. \n\nThis is fine if all you are doing is farming, but a huge setback during a trade with the enemy laners.\n\n---\n\nAnyway, discuss.","replies":[{"poster":"Jeddy017","date":"2015-03-31T18:08:13.440+0000","up_votes":18,"down_votes":0,"body":"Ashe is getting some gameplay changes later this season\nMentioned here:\nhttp://boards.na.leagueoflegends.com/en/c/gameplay-balance/KK1sYAQq-why-ashe-is-punished-for-attacking-cs-ing-etc-her-passive-should-be-changedmaby-statikkshiv\nAnd here:\nhttp://boards.na.leagueoflegends.com/en/c/gameplay-balance/RaHR48Xf-riot-meddler-will-we-see-ashe-testing-begin-in-the-pbe-really-soon","replies":[{"poster":"Riot Scruffy","date":"2015-03-31T22:24:24.851+0000","up_votes":43,"down_votes":2,"body":"Was about to post this, Ashe changes in the works. They're really fun and I think they play up the unique elements that make Ashe a super unique Marksman (frost shot babbbyyyy).","replies":[{"poster":"Melete","date":"2015-04-01T02:50:03.013+0000","up_votes":5,"down_votes":1,"body":"If Riot reworks another champion by making their signature spell a skill shot I may go insane.\n\nPlease say Frost Shot isn't a skill shot in the new kit.","replies":[{"poster":"Riot Scruffy","date":"2015-04-01T03:08:45.915+0000","up_votes":23,"down_votes":0,"body":"No skillshots added confirmed.","replies":[{"poster":"Potato Doc","date":"2015-04-01T03:32:27.466+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=RiotScruffy,realm=NA,application-id=3ErqAdtq,discussion-id=NE8mNxrc,comment-id=00090001000c0000,timestamp=2015-04-01T03:08:45.915+0000)\n>\n> No skillshots added confirmed.\n\nSo any word on them doing what they did to Garens passive, to MF's?","replies":[{"poster":"Edbwn","date":"2015-04-01T04:41:14.727+0000","up_votes":3,"down_votes":0,"body":"Oh god. That would get out of hand.","replies":[{"poster":"Potato Doc","date":"2015-04-02T04:41:21.632+0000","up_votes":2,"down_votes":0,"body":"Well okay, i meant in the same manner, not the exact same buffs XD","replies":[]}]}]},{"poster":"Mandaari","date":"2015-04-01T04:06:50.473+0000","up_votes":3,"down_votes":1,"body":"Global point and click ult confirmed.","replies":[]}]}]},{"poster":"DragoonRuin","date":"2015-03-31T23:28:02.293+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=RiotScruffy,realm=NA,application-id=3ErqAdtq,discussion-id=NE8mNxrc,comment-id=00090001,timestamp=2015-03-31T22:24:24.851+0000)\n>\n> Was about to post this, Ashe changes in the works. They're really fun and I think they play up the unique elements that make Ashe a super unique Marksman (frost shot babbbyyyy).\n\nRiotScruffy,  What about Miss Fortune?  Is there ANY plans at all to update her kit or give her some love to bring her in line with other ADC's at the moment.  Her, and Quinn (arguably an ADC),  are literally the only 2 that have NOT SEEN ANY play in LCS this season.  Varus and Ashe have both been played this season, along with Draven, and every other ADC.","replies":[{"poster":"Riot Scruffy","date":"2015-04-01T02:02:05.009+0000","up_votes":16,"down_votes":0,"body":"Definitely MF needs some love too, we don't have anything as far along as the Ashe work is for her but there's definitely some room for improvement on MF in terms of both depth and satisfaction. ","replies":[{"poster":"Mansana","date":"2015-04-01T03:55:34.936+0000","up_votes":4,"down_votes":1,"body":"Change her Q and call it Double Tap. Last hitting a minion or champion should give the spell some type of benefit. Like allowing the second part of the Q to hit 1-2 characters behind rather than the normal 1? or reducing the cdr depending on how many last hits you performed with that spell (max being 2 last hits).\n\nEdit: Or let her Ult windup/channel somewhat scale with atk speed. More waves faster... increasing output in dmg by lowering channel time allowing her to have more time to move instead of just standing there wasting milliseconds.","replies":[]}]}]},{"poster":"Painted Celt","date":"2015-03-31T22:37:00.149+0000","up_votes":4,"down_votes":0,"body":"Hey, Scruffy.  I enjoy playing Ashe as an AD poke support (I build Zeke's Herald and Black Cleaver to increase my ADC's damage).  Can you give a heads-up on whether your changes will be a buff or nerf to this playstyle?  Thanks.\n\nPs.  Ashe's current passive gives her a lot of poke/trading power in her support off-role.","replies":[{"poster":"Riot Scruffy","date":"2015-04-01T02:06:00.402+0000","up_votes":16,"down_votes":1,"body":"Hmm, probably a bit buffed for the support playstyle, not by too much tho.","replies":[{"poster":"spartan622","date":"2015-04-01T02:58:05.688+0000","up_votes":3,"down_votes":0,"body":"RiotScruffy, is there any change that hawkshot could be buffed in some way? A charge system or shorter cooldown perhaps? Blue trinket provides most of what hawkshot does and kalista has a similar ability that holds charges.","replies":[]},{"poster":"Jeddy017","date":"2015-04-01T02:40:03.068+0000","up_votes":3,"down_votes":0,"body":"Yay,Support Ashe will still be a thing.","replies":[]}]}]},{"poster":"Mandaari","date":"2015-04-01T00:30:58.670+0000","up_votes":2,"down_votes":0,"body":"Said this before, but please make the Ashe changes as minimal as possible (Except for the passive. Don't think anyone cares about that) Something that you might find fun and unique that's any departure from her current kit will end up poking the hornet's nest. While I personally liked Cassy's changes for the most part, I'd hate to be on the other end where people are screaming \"WTF DID YOU TO MY FAVORITE CHAMPION?\"","replies":[{"poster":"Riot Scruffy","date":"2015-04-01T02:00:03.730+0000","up_votes":14,"down_votes":0,"body":"The changes are pretty focused, mostly related to passive and Q. I think the end result will feel very much like the current ashe with a bit more depth and satisfaction. (and a passive that makes more sense)","replies":[]}]},{"poster":"Solidair3","date":"2015-03-31T23:05:54.377+0000","up_votes":2,"down_votes":0,"body":"I'm really glad to hear this! One of my favorite things about Ashe is that she is more utility based, in a way that really brings power to her team even if she doesn't have a billion kills.\n\nMy other favorite thing is her ult, but that's just because it's **so** satisfying.","replies":[{"poster":"Riot Scruffy","date":"2015-04-01T02:05:12.993+0000","up_votes":10,"down_votes":0,"body":"Yes I definitely agree, what makes ashe a very different marksman than the rest is the fact that she brings so much utility. I think that we actually would like more of the other marksmen to have as much of a clear and unique thing that they bring to the game like Ashe.","replies":[]}]},{"poster":"VegetableFoe","date":"2015-04-01T00:31:54.638+0000","up_votes":7,"down_votes":1,"body":"As much flak as people (who don't play Ashe, by the way) like to give to her passive and her E, those tools are incredibly powerful. As an Ashe player myself, I will be incredibly disappointed if these changes come across as nerfs.\n\nFor example, her passive with Infinity Edge and Statikk Shiv means intead of dealing 191+100=291 damage on her first auto attack - or 465.6 on average if you account for the 40% chance to crit, she's guaranteed to deal 727.5 damage. Her passive gives her 261.9 extra damage on average on her first attack mid game, additionally removing the chance of being a failure where she ults and goes all in and deals 436.5 damage less than she is guaranteed to. So as much as Reddit and others would love you to change her passive, please make sure it still compares to dealing 261.9-436.5 damage, especially on her first 1-3 auto attacks so she still hits her mid game powerspike. People always suggest boring things like 10% extra damage on slowed units, but that's objectively a nerf and I want you guys to see that before changing her.\n\nAnd her E is awesome. People don't like it because it doesn't deal damage, but I would much rather have her E than Graves W or Lucian W or Caitlyn W or Kalista Q/W etc. Despite dealing no damage, the active for vision control is worth significantly more than any amount of damage and the E passive makes it even better by giving her ~600 gold by mid game.\n\nBe careful changing her. Her power right now is really strong and most of the changes that I've seen suggested for Ashe would be nerfs. Please just recognize the power of her passive and her E, and if you are to change it, at least give it a relatively similar amount of power.","replies":[]},{"poster":"gloomyMoron","date":"2015-04-01T04:14:57.941+0000","up_votes":3,"down_votes":0,"body":"So about Varus. I actually think he's one of League's most balanced ADCs at the moment, but the way meta has shifted and the pure power of hyper-carries has outshined him for awhile. I feel like he's on the cusp of being viable though, he just needs a small push.\n\nWould it be possible to give his Q, after released, a decaying move speed buff to allow him to relocate and reposition based on how long he charged it? Basically, apply something similar to Varus Q that was applied to Ahri Q.\n\nJust to give an example of what I mean, since numbers will need to be fiddly and tested, his Q would look like this:\n\n> FIRST CAST: Varus begins channeling his next shot, gradually increasing the range and damage of Piercing Arrow over the next 2 seconds.\n> \n> Varus can still move while channeling, but can't autoattack or use his other abilities, and his movement speed is slowed by **30%**. After 4 seconds, Piercing Arrow is automatically cancelled, going on full cooldown and refunding half of its mana cost.\n> \n> SECOND CAST: Varus fires, dealing physical damage to all enemies in the arrow's path, reduced by 15% per enemy hit (down to a minimum of 33%).\n>\n> **Upon firing Piercing Arrow, Varus gains movement speed starting at 10%, up to a maximum of 35%/45%/55%/65%/75% (+10% Bonus Movement Speed; not including Piercing Arrow) when Piercing Arrow has been channeled for 2s, rapidly decaying to normal over 1s. Cancelling Piercing Arrow, by any means, does not activate this effect.**\n\nObviously the numbers would need work, and you'd need to figure out specifics, but it seems like such a small change that'll help him. As part of the compensation, he moves slower while charging his shot, meaning you have to plan your shots more carefully, but he can relocate to better positioning after using his Q. Perhaps also increase the missile speed on his Q slightly OR increase the width (one or the other, not both; that might be too much).\n\nWould changes like that help Varus or do you think he needs more of a rework/tweak to him? I really like how Varus is now, I just which his W was more rewarding and felt more impactful, but that's a \"feel\" thing rather than anything specific that can be changed.","replies":[]},{"poster":"Stacona","date":"2015-04-01T02:53:49.326+0000","up_votes":2,"down_votes":0,"body":"she needs her utility aspects in tact - ashe is this cool marksman with a lot of utility (perma slow, long range vision scouting, long range champion overall, and global skill shot long duration stun ultimate)","replies":[]},{"poster":"Keevalroy","date":"2015-03-31T23:46:30.810+0000","up_votes":11,"down_votes":9,"body":"The way you say \"fun\" makes me cringe.  Does this mean she's going to be fun for the players on BOTH teams?  Because when Riot uses \"fun\" to justify the reason something as cancerous as Kalista could possibly exist in the game, they're actively refusing to realize how agonizing she is to play against. \n\nAre you sure the *new* Ashe isn't going to break your own code of conduct like Kali?  \n\n(Enjoy yourself, but not at anyone else's expense)","replies":[{"poster":"Wheatloaf","date":"2015-04-01T00:27:34.785+0000","up_votes":3,"down_votes":2,"body":"idk, if Kalista can manage to skirt the edge of a fight, she gets annoying, but I personally find it entertaining to chase her bunny ass out of a fight only for her to realize she has to walk back to it like the rest of us.","replies":[]}]}]},{"poster":"BatteryDead","date":"2015-03-31T21:39:13.674+0000","up_votes":2,"down_votes":0,"body":"I like your post, so much so that I think they should make a sticky of things the forum users have suggested that they are considering so that they can say \"Hey we're already looking at that\" instead of relying on the occasional member or user who links to comments such as this.","replies":[]}]},{"poster":"Kitten of Evil","date":"2015-03-31T17:41:17.252+0000","up_votes":10,"down_votes":0,"body":"MF definitely needs some QoL changes -- make her ult self-cancelable, make her passive not broken by minions after level 9 or 11 or whatever...\n\nThe benefit of MF and Varus is that it's harder to itemize against them, since their kit has a mix of magic and physical damage. You can also build either of them AP, which opens up a whole new playstyle (AOE mage MF and team-disabler and tank-killer Varus). Personally I like that flexibility, but it's a double-edged sword, since you can't double-down on armor pen.\n\nPeople are also forgetting that it was itemization changes that weakened Ashe, Varus, and Cait. You used to rush {{item:3072}}, because none of those three really cared as much about attack speed (Ashe and Cait have the highest AS/level, and Cait and Varus have skills that scale very well with flat AD)... but then when they nerfed BT and {{item:3031}} became the go-to item, attack speed became much more important, and you saw champions like Jinx and Draven instead.","replies":[]},{"poster":"Jamaree","date":"2015-03-31T17:23:16.733+0000","up_votes":9,"down_votes":1,"body":"Because back when MF was the thing, people clamored for her to get nerfed to oblivion, Ashe likely because her power budget as well as what she has done to this game has left her in an incredibly weird spot. Varus, no idea.","replies":[]},{"poster":"A Miss Fortune","date":"2015-03-31T22:47:11.421+0000","up_votes":7,"down_votes":0,"body":"As a  {{champion:21}}  main I feel safe to say she doesn't really need a huge buff. Her W isn't the best or her passive but she's still in my opinion, one of the top tier ADCs due to her Q, E, and R she is a great duelist and teamfighter. Her AA > Q > AA combo is usually what makes Miss Fortune so powerful, because her Q resets your auto attacks while dealing a good amount of damage. I feel like if Miss Fortune's W or E were made as strong as her Q is (in utility or damage or whatever category) then she would be totally broken.\n\n**Just ideas don't hate me for this and downvote please**\n\n***W (Impure Shots): ***\n\n* Cooldown to 16 > 15 > 14 > 13  > 12\n* While active Miss Fortune gains +50 range\n\nExplanation:\n\nMF's passive for this is great and balanced, it gives her a stronger laning phase and helps her to out trade people most of the time though the active benefit isn't that great and most ADC's like Tristana for example have Attack Speed steroids that nearly doubles her W even at max level. The Grevious Wounds is nice as well but it doesn't give Miss Fortune a huge advantage since it only lasts 2 seconds. Lowering the cooldown and also giving Miss Fortune more range (sort of like Kog'Maw's ability) would make her a really good laning champion and make her W more viable.\n\n***Passive (Strut):***\n\n* Caster Minions can't break the passive\n* Movement Speed increased to 80 from 70\n* After killing an enemy Miss Fortune gains her passive back up + 30 movement speed for 3 seconds\n\nExplanation:\n\nMiss Fortune has no actual escape, that and her passive is so easily broken it's almost worthless. I like her passive because she is really mobile and able to roam with it up in comparison to most ADCs though it's almost always useless in combat. Giving her a boost of movement speed sort of similar to Jinx to escape combat would be great and also since Caster Minions can very easily kill the passive I think MF should have her passive immune to minions.\n\n\nIf these ideas were added to the game I feel like Miss Fortune would be far more viable and more often played while maintaining a pirate bounty hunter identity. Still in my opinion she needs no damage buffs and is still a very strong ADC at the moment.","replies":[]},{"poster":"Danica1708","date":"2015-03-31T20:09:18.422+0000","up_votes":8,"down_votes":2,"body":"The reason Miss Fortune's Impure Shots will NEVER get changed to physical damage, is because she would WAYYYYY over scale with armor penetration. Riot addressed this when they changed her kit. Same reason they're not changing her R. Honestly, her mixed damage is one reason she's strong. If she had an escape mechanic, she would be really viable. The reason the mixed damage makes her strong is because 'oh ADC, build armor' but she's still dealing a lot of magic damage that they're not protecting against, and if you have the penetration masteries in the offense tree, you're ignoring 6% of their MR anyway, and Sorc Shoes are better on her than Berserker Greaves because of her mixed damage, which means you're also ignoring 15 more MR....\n\nMiss Fortune can be a devastating pick. IN THE RIGHT TEAM COMP. You really have to get a teamfight oriented comp for her to work in this meta because there's so much mobility. Good examples would be J4, Anivia, Leona, MF, Hecarim; Amumu, Sona, MF, Swain, Jax. Team fight oriented comps with a lot of cc is where MF shines. So you basically need a 5 man team to make her work, but that's basically because she needs teamwork to, well, work.\n\nAlso, Riot has addressed they're reworking Ashe's passive and her Q, as was stated before in this thread with links.\n\nVarus is a poke champion. He's in an awkward spot atm because of his lack of escape mechanics, and his almost need to push the lane. Or you can go AP AS Varus and just AA everything to death and ult. His passive is meant for teamfights, it's to help him keep the ball rolling once his team has gotten a kill.","replies":[{"poster":"Hinagiku33","date":"2015-03-31T22:39:42.945+0000","up_votes":7,"down_votes":1,"body":"Her mixed damage is also a huge double-edged sword. It's hard to itemize against, but also just as hard for MF to itemize for.\n\nThe simple fact is, there isn't much of a reason to ever pick MF because she doesn't really do more damage than the top-tier AD Carries while also having no escapes and virtually no CC since E typically needs to be maxed last (though you can max it 2nd, but maxing it 1st won't really save you if you're behind). \n\nIf you already have a team-fight comp with lots of CC, tanky-engage, etc...why would you actually want MF over someone like Vayne, Graves, or Jinx? Hell if you want mixed damage you can even go Corki or Ez and still have en escape.\n\nPoor MF is just another victim of kit overlap.","replies":[{"poster":"Danica1708","date":"2015-03-31T23:13:37.735+0000","up_votes":1,"down_votes":2,"body":"How is she hard to itemize for? {{item:3020}} {{item:3072}} {{item:3031}} {{item:3071}} {{item:3035}} {{item:3091}}  is a perfectly viable build on MF. It gives you damage, crit, lifesteal, attack speed, magic pen, armor pen, and on-hit MR shred and on-hit damage. She's a teamfight ADC far more than Vayne could ever hope to be. Graves is the only one similar enough that it might be worth it, but MF also brings a heavier slow and built in Greivous Wounds, and while Jinx can have just as good a team fight she has weaker roaming, and her CC can all be dodged pretty easily. The reason you would want MF over any of them is because she can shred through everyone caught in the rest of her teams CC like a hot knife through butter with one ability. Something few other champions can do. (Katarina, Fiddlesticks, and Graves are the only other ones I can think of who can teamfight like MF can at the moment). And even then, MF's ult deals a lot more damage than Graves' (base of 1000 at max rank) and she can apply the full stacks of TBC to the entire team, and get her own Impure Shots stacks on everyone so she can easily finish off any of the enemy team.","replies":[{"poster":"Champion Skin","date":"2015-03-31T23:29:32.881+0000","up_votes":1,"down_votes":0,"body":"You are giving up quite a bit of auto attack damage by giving up the crit chance on {{item:3046}}  or {{item:3087}} \nthere is a reason IE into a crit item is so strong (because IE op and because crits are so strong if and when you have IE)\n\nAnd that build doesn't really have any defensive items to protect against high burst assassins or CC","replies":[{"poster":"Danica1708","date":"2015-03-31T23:40:29.361+0000","up_votes":2,"down_votes":0,"body":"Crit is only strong against squishy targets because 2.5x200 is better against 2000 hp than 4000 plus damage reduction. Besides, if you're that butthurt over the fact that there's only the IE in that build, you can always replace the Wit's End with PD or SS. Just sayin. It's not like what I say on here is law or anything. I personally just don't think itemizing exclusively against squishy targets is the best route. Which is why I said Wit's End. Chill. Also, TBC gives hp and Wit's End gives MR. IF you want more resistances, fine, you can build more resistances. It's not like builds are set in stone.","replies":[]}]}]}]}]},{"poster":"Abyssphere","date":"2015-03-31T17:44:48.538+0000","up_votes":5,"down_votes":0,"body":"Varus has been buffed three times since the pre-season.","replies":[{"poster":"BranchofSin5580","date":"2015-03-31T18:02:18.520+0000","up_votes":2,"down_votes":1,"body":"two times. not three.\n\nHis R width was increased by 20 units in V5.3.\n\nThat doesn't accomplish anything. Chains of Corruption are already easy enough to hit, even on a mobile target. It's already quite fast.\n\nHis Q cooldown change in V5.5 was a nice change. \n\nA similar change to Distortion made LeBlanc broken in the past.\n\nBut that's because she is a hyper mobile burst assassin.\n\nNot a squishy immobile utility carry like Varus.","replies":[{"poster":"Abyssphere","date":"2015-03-31T23:11:18.474+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=BranchofSin5580,realm=EUW,application-id=3ErqAdtq,discussion-id=NE8mNxrc,comment-id=00030000,timestamp=2015-03-31T18:02:18.520+0000)\n>\n> two times. not three.\n> \n> His R width was increased by 20 units in V5.3.\n> \n> That doesn't accomplish anything. Chains of Corruption are already easy enough to hit, even on a mobile target. It's already quite fast.\n> \n> His Q cooldown change in V5.5 was a nice change. \n> \n> A similar change to Distortion made LeBlanc broken in the past.\n> \n> But that's because she is a hyper mobile burst assassin.\n> \n> Not a squishy immobile utility carry like Varus.\n\nIn patch 4.21 his mana regen per level was buffed.","replies":[]}]}]},{"poster":"X Frady","date":"2015-03-31T20:53:37.969+0000","up_votes":6,"down_votes":1,"body":"If Rito can make {{champion:21}} passive immune to minions and reduce make it rain mana cost, I would be happy :)","replies":[]},{"poster":"FantasySniper","date":"2015-03-31T23:11:43.178+0000","up_votes":5,"down_votes":1,"body":"{{champion:110}} is fine (for now). He's like Kog'Maw, except he is able to CC in exchange for his % magic damage not being consistently accessible.\n\n{{champion:21}} is shorter-ranged, yet more burst oriented with more mobility in between fights. I really feel like they should make her passive somehow accessible when not trekking, and that could make her lack of escape less of an issue.\n\n{{champion:22}} just lacks one thing: damage. Early game, her trades are among the best in the game since she's the one that most often chooses how to end them, but she can't keep up with most every ADC when it comes down to actually fighting. If it wasn't for her ultimate that takes up half her power-budget, she wouldn't even be picked.\nThankfully Riot is looking into it already, but we all know how Soon™ that's coming.","replies":[]},{"poster":"DeusVult","date":"2015-04-01T00:02:07.290+0000","up_votes":3,"down_votes":0,"body":"A. Ashe doesn't need to auto more than talon, they last hit about the same\n\nB. Getting Varus passive from last hitting allows for him to trade outside of landing Qs\n\nC. From all this, it sounds that you undervalue last hitting - which makes me not trust you and your judgement","replies":[]},{"poster":"Skilled Theory","date":"2015-03-31T17:21:16.093+0000","up_votes":14,"down_votes":11,"body":"Because Riot only cares about LC$BigPlay$","replies":[]},{"poster":"FlamingoFondue ","date":"2015-04-01T16:52:16.760+0000","up_votes":2,"down_votes":0,"body":"Ashe, Varus, and MF now have a long range dash on their E. Congrats I fixed them.","replies":[]},{"poster":"SinatraZ","date":"2015-04-01T13:13:48.271+0000","up_votes":2,"down_votes":0,"body":"Miss Fortune is fine. Its one of my main adc and shes really strong. People are just afraid to play her because she is not played in LCS ... Yes her lack of mobility is bad but she is still more viable than ashe and varus in that regard.","replies":[]},{"poster":"Often Nonplussed","date":"2015-04-01T02:15:38.995+0000","up_votes":2,"down_votes":0,"body":"I agree about the Ashe change, but only as far as farming hindering her passive's activation.\n\nAlso, MF should not be changed all that much. Her W and ult could have AD scaling as well as AP scaling, but her Q and E are fine. AP MF shouldn't be lost just because of some weird scaling in the rest of her kit, especially when she does her job just fine (according to my observations).\n\nOn another note: Ashe's passive is named \"Focus\" because she is, theoretically, concentrating on her next target. The longer you allow her to focus, the better the shot she can make (i.e. the crit). Talon's passive is named \"Mercy\" because the extra damage allows him to end an opponent's pain quickly. If you simply swap the abilities and name, then you have Talon with \"Focus\", which could work. However, you also have Ashe with \"Mercy\" which, based on her lower natural damage *because* she has a lot of utility, leads to a slow and painful death which is not merciful at all, nor is it a clever irony, since, as was pointed out, Ashe is the most humane and diplomatic of the Freljord's leaders. \"Mercy\" as a personal quality doesn't relate well to how that passive would work with her kit.","replies":[]},{"poster":"aaronconlin","date":"2015-03-31T23:38:08.918+0000","up_votes":2,"down_votes":0,"body":"I agree with what you said about Ashe, but PLEASE DO NOT remove AP Miss Fortune or Varus.","replies":[]},{"poster":"Anonymousaur","date":"2015-03-31T23:09:09.270+0000","up_votes":2,"down_votes":0,"body":"I think MF is fine...Then again this is coming from someone who doesn't play Rank games and probably isn't using her correctly.\n\nI do think Varus & Ashe feel a little too weak to me. (But never in aram! Varus master race in Aram!!!!!) (I don't know...)","replies":[]},{"poster":"Cindikle","date":"2015-03-31T18:17:01.762+0000","up_votes":1,"down_votes":0,"body":"Varus and Ashe are utility ADC's. Which are no where near meta right now. Varus could see some light as he does %hp damage vs tanks. \n\nVarus IMO just needs his R to circle around him before going forward. So that he can use it close range more reliably. \n\nMF is overall only really good in the early game when she can harass very well. If she doesn't get ahead then she'll have a bad time the rest of the game because her kit really isn't defining outside of her ulti. Q and W make her a good duelist, E's CC isn't very strong vs mobility. R has a bad time because she cannot itemize magic pen easily. Her passive is overall non existent in team fights. \n\nJinx out preforms almost everything MF does while being safer. She's weaker early game but since Jinx's early game counters are not very strong right now she is about on equal footing as MF. \n\nMF would probably be in a better spot if her passive matched her magic pen to match her armor pen.","replies":[{"poster":"Orbv","date":"2015-03-31T19:31:26.867+0000","up_votes":1,"down_votes":0,"body":"I think Jinx and MF are pretty different in too many ways to really compare.\n\nMF has grievous wounds (making trades easier), AoE wave clear, a 2 person on target poke, and a teamfight AoE\n\nJinx has AoE autoattacks at massive range. Amazing AS buff with consecutive attacks. A long range poke/slow, an AoE snare, and then a global Execute. She's pretty unique.","replies":[{"poster":"A Miss Fortune","date":"2015-03-31T22:56:15.980+0000","up_votes":2,"down_votes":0,"body":"Miss Fortune is more of a team fighter and usually better at roaming since her E isn't a hard to hit skill shot and can at least make someone flash.\n\nJinx is sort of a better duelist, if she hits you with her W or E then she'll most likely win, if not Miss Fortune will probably be able to win just due to her more reliable attack speed steroid + her Q damage on top of it resetting her auto attacks.\n\nComparing Jinx and Miss Fortune really isn't that logical and I agree with you 100% that they're much too different to be compared.","replies":[]}]},{"poster":"TheI3igDaddy","date":"2015-03-31T18:54:43.409+0000","up_votes":2,"down_votes":1,"body":"I'm not sure why you think Varus is a utility ADC....I mean, honestly Kalista has more utility than he does and she's a common pick. \n\nVarus\nQ- Damage\nW - Damage \nE - Damage with slow / heal debuff\nR - damage with delayed snare\n\nAshe\nQ- Slow utility at the expense of mana per shot\nW - Damage\nE - passive gold, vision utility\nR - Damage with stun, used almost solely for the latter. \n\nAshe makes sense for 'Utility ADC', but Varus isn't like that.","replies":[{"poster":"Cindikle","date":"2015-03-31T21:45:54.539+0000","up_votes":2,"down_votes":0,"body":"Varus is an utility ADC because he comes with a lot of reliable CC. \n\nAoE slow\nLong range hard CC that can effect a whole team. Assuming it doesn't miss. \n\nKalista is borderline utility ADC. But her slow is somewhat limited in usefulness and her hard CC relies on her linked ally. Which also relies on them using it offensively. \n\nI would say Jinx is closer than Kalista. But her CC is very telegraphed and avoidable. It's stronger when used for zoning/self peel than actually looking to CC a target.","replies":[]}]}]}]}