{"poster":"SKT T1 Daemonz","date":"2016-07-12T03:34:49.450+0000","title":"Skins proyecto","subforum":"Charlas Generales","embed":{"description":null,"url":"http://imgur.com/RyjWHy1","image":"http://imgur.com/RyjWHy1s.jpg"},"up_votes":1,"down_votes":4,"body":"Pues como se puede apreciar en la imagen y como es obvio el arma de {{champion:245}}  es mas larga y delgada que la espada que aparece en el teaser\r\ny {{champion:92}}  siempre se ah destacado por el color verde... es algo demasiado obvio\r\nasi que dejen de joder con que la skin es de {{champion:245}}","replies":[{"poster":"Kyousuke","date":"2016-07-12T03:46:52.279+0000","up_votes":1,"down_votes":0,"body":"te digo por que SI es ekko \n1. los relojes de arena en el fondo verde, si te fijas el el símbolo del tiempo y por ende habla del tiempo tambien esta en el casco y el simboli del arma es del mismo colgante que usa \n2. hora de irse se refiere a algo sobre el vídeo que sacaran de proyecto (algo como lo del vídeo de yi) aunque también puede deberse a que ekko tiene que dejar zaun en algún momento para seguir su camino o para ir a piltover con otros inventores buenos\n3. el cambiara nuestras posibilidades y lo del porque \"libertad\" queria hacer 2 puntos separados de esto pero es mas facil hacer 1 solo \n> \n> Ekko, un prodigio surgido de las duras calles de Zaun, es capaz de manipular el tiempo en su propio beneficio. Usando una máquina de su invención llamada Dispositivo Z, explora las distintas **POSIBILIDADES **de la realidad. Cuando no está experimentando con la probabilidad multidimensional, Ekko dedica el tiempo a realizar correrías con otros niños abandonados de Zaun. Aunque adora su **LIBERTAD**, si algo amenaza a sus amigos hará lo que sea para defenderlos. Para quien no sepa quién es este muchacho en realidad, su capacidad de hacer lo imposible una vez tras otra resulta increíble.\n\n\ndeje remarcadas las palabras mismas en su lore solamente :) el resto es obvio y el genero de como le habla es masculino no hay mas que decir :)\nla voz que habla es ashe que estoy 99% seguro que su skin sera legendaria","replies":[]},{"poster":"lucpro","date":"2016-07-12T03:37:44.318+0000","up_votes":1,"down_votes":0,"body":"{{champion:236}} + {{champion:26}} = {{champion:245}} ?","replies":[{"poster":"La corrupción","date":"2016-07-12T03:44:49.528+0000","up_votes":1,"down_votes":0,"body":"Proyecto Zilean confirma3","replies":[]}]},{"poster":"vaVav","date":"2016-07-12T03:43:24.611+0000","up_votes":1,"down_votes":0,"body":"Pero el arma de Ekko tiene el circulo en medio, igual que en la imagen.\n\nAdemás, eso es solo una imagen como para dar a entender que va a salir otra tanda de skins con la temática proyecto, tal vez cuando hagan la skin, en el splash art y/o ingame cambie el tamaño del arma.","replies":[]},{"poster":"La corrupción","date":"2016-07-12T03:42:07.608+0000","up_votes":1,"down_votes":0,"body":"-_Chico, me escuchas?_-\n\nen español no, pero en inglés...\n-_**Time** to go_- \n o algo parecido\n\n-_**Él** cambiará nuestras posibilidades_-\n\nEl arma tiene exactamente la misma forma solo que es más corta, no es más delgada la 'real' sino que ahí no se ve.\nY tiene un color verdoso, claro, le hubieran puesto azul o celeste pero repetiría el de ashe o kata.","replies":[]}]}