{"poster":"iNGENiO","date":"2016-04-06T03:01:50.443+0000","title":"Colas muy laaargas en Ranked, No hay Soportes. Algún incentivo para que se juegue SUP?","subforum":"Charlas Generales","up_votes":3,"down_votes":2,"body":"Est&aacute;n muy largas las colas en ranked, no hay soportes.\r\n\r\nSi eleg&iacute;s de rol secundario, soporte, en 1 seg encuentra partida. No importa el rol primario que tengas.\r\n\r\nSi eleg&iacute;s comod&iacute;n, siempre te pone soporte.\r\n\r\nSi eleg&iacute;s otros roles las colas duran 10 o 15 minutos.\r\n\r\nNo pueden poner un incentivo para que la gente juegue soporte? Y no tengamos colas tan largas??","replies":[{"poster":"IIManeoxII","date":"2016-04-06T03:45:15.448+0000","up_votes":4,"down_votes":1,"body":"porque con el soporte no conseguis muchas kills entonces aca la mayoria solo piensa en eso kil kil kil kil kil y nada mas por eso todos cantan MID de una ! no saben que para ganar la partida no hace falta muchas kills si no derribas torretas!","replies":[]},{"poster":"daina","date":"2016-04-06T03:24:43.649+0000","up_votes":3,"down_votes":1,"body":"no es muy lindo ir soporte por lo general si a tu team le va mal es tu culpa, si matan al top es tu culpa, si no hay wards aunke tengas 3 de 3 +la baratija+el pink en uso sigue siendo tu culpa y q no maten a tu adc por q te flamean como si le hubieras matado al perro\npero hay otras veces q te toca gente q no es mal hablada y bueno ahi si se puede decir q da gusto ganes o pierdas","replies":[]},{"poster":"Mascheranox","date":"2016-04-06T13:01:41.933+0000","up_votes":2,"down_votes":1,"body":"soy supp y tardo 10 minutos en encontrar partida...","replies":[]},{"poster":"tomfunes","date":"2016-04-06T04:08:52.691+0000","up_votes":2,"down_votes":1,"body":"Soy main supp, y te puedo asegurar que no es fácil ser soporte más que nada porque si pasa algo malo SIEMPRE es tu culpa. ¿El adc se tira de cabeza a melee contra 3? Tu culpa por no ser igual de suicida. ¿Backeas y el adc pushea sin visión y se come gank? Tu culpa. Y si pasa lo contrario, le salvás la vida, entregás el c*lo para salvarlo, le dejás una kill servida, no recibís el mínimo agradecimiento. \nAhhh, y ni se te ocurra llevarte una kill por más que el adc no esté en línea, sos un ks y te comés report. Y ni hablar de que tenés que conocer las fortalezas y debilidades de todos los champs, pero el resto del team ni se molesta en leer la pasiva del escudo reliquia y te quieren reportar por robar farm.","replies":[{"poster":"Tutancadead","date":"2016-04-06T23:44:51.259+0000","up_votes":1,"down_votes":1,"body":"Yo me.canse de supportar. Prefiero ir jg.","replies":[]},{"poster":"fenakz","date":"2016-04-06T13:13:47.596+0000","up_votes":1,"down_votes":1,"body":"Totalmente de acuerdo, solía ser main supp pero ahora como que veo que en esta liga no hay nivel para supportear y estoy yendo otra linea aunque . Hay de todo, los que te echan la culpa de porque no inicias hasta el adc más mudo de la galaxia, no te manda señales ni de humo, tenes que adivinar si se tira o te baiteo y te deja solo. Suelo usar bardo y como cualquier persona del mundo, sea challenger o bronce hay 1 ulti de 15 que faileas y bueno, insultos por todos lados .","replies":[]}]},{"poster":"Nehalem","date":"2016-04-06T03:38:36.396+0000","up_votes":1,"down_votes":3,"body":"Dudo que alguien quiera jugar soporte y más teniendo en cuenta el sistema hextech, no te das una idea de lo difícil que es que te den una S- siendo support, hasta los main support estamos jugando otras cosas donde la S dependa más de matar y matar.","replies":[{"poster":"LagedByNetflix","date":"2016-04-07T17:31:14.689+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Nehalem","date":"2016-04-08T05:24:44.563+0000","up_votes":1,"down_votes":0,"body":"Según palabras de Rioters lo que hace el sistema simplemente es medirte con los demás jugadores de thresh por ejemplo, pero me jode que se ve que usan la misma regla que cualquier tipo de rol, osea que si la gran mayoría de thresh matan (podes o no matar, depende de la partida y las situaciones) me joden el puntaje a mi que quizás tuve la suerte de poder dejarle todas las kills a los demás como debe ser.\nEsto ni se compara con la dificultad de otros picks para hacer S, vengo de una partida jugando de adc (soy muy malo) y me dieron S por simplemente meter mucho daño que tampoco es muy complicado, morí como un subnormal cabe destacar.\nOtra cosa más que hay que resaltar es que se ve que el sistema no tiene en consideración el tiempo que dura la partida, por ejemplo dice que la mayoría de jinx matan 20 por partida de 45 minutos (por poner un numero alto) y si vos jugas bien y terminas la partida en 20 minutos, obviamente no vas a matar lo que el otro mató o lo que el otro farmeó, creo que todo esto también jode el puntaje ya que no tiene en cuenta que tu partida duró menos.","replies":[]}]},{"poster":"ZayDusk","date":"2016-04-06T22:36:00.468+0000","up_votes":2,"down_votes":1,"body":"la verdad es que con algunos champs supp se consiguen S mas fácil que con otros aunque vayas 1/3/17 el sistema no valora solamente las kills","replies":[{"poster":"Tutancadead","date":"2016-04-07T01:49:40.587+0000","up_votes":1,"down_votes":0,"body":"Mi vel no opina lo mismo. El dice que hacer kill da S más fácil y rápido.","replies":[{"poster":"Nehalem","date":"2016-04-07T03:07:33.350+0000","up_votes":1,"down_votes":0,"body":"Me decepcionaría mucho que el sistema tenga en cuenta las kills, cuando en realidad debería tener en cuenta que contra menos kills tengas mejor te fue, de ser lo contrario (como decís vos) lo único que lograría Riot es que salgan un montón de supports a hacer \"ks\" para conseguir la S.","replies":[{"poster":"Tutancadead","date":"2016-04-07T03:23:17.505+0000","up_votes":1,"down_votes":0,"body":"No te dire que es el único modo.\nPero es un modo que funciona.","replies":[{"poster":"ZayDusk","date":"2016-04-07T17:02:07.641+0000","up_votes":1,"down_votes":0,"body":"umm... que raro puesto que eh quedado con B llevando mas las kills y por poco pasando a las asist , y que con 1/3/20 haya sacado S :/ siceramente creo que el sistema también valora la visión de objetivos las kills , las asist , las muertes , el tiempo de juego , el farm , el daño tanto a torres como súbditos como enemigos , y entre tantas cosas mas .","replies":[{"poster":"Tutancadead","date":"2016-04-07T19:58:55.235+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Tutancadead,realm=LAS,application-id=v7qsfXsE,discussion-id=n3WsNxsu,comment-id=00020000000000000000,timestamp=2016-04-07T03:23:17.505+0000)\n>\n> No te dire que es el único modo.\n\nXD","replies":[]}]}]}]}]}]}]},{"poster":"Runth","date":"2016-04-07T03:21:58.759+0000","up_votes":1,"down_votes":0,"body":"Lastima q no juego, toy de duelo","replies":[]},{"poster":"iNGENiO","date":"2016-04-06T03:42:44.223+0000","up_votes":1,"down_votes":3,"body":"Pero podrían poner algún incentivo del estilo doble pi, que te saquen menos LP si perdes o que te den mas LP si ganas, no se algo.","replies":[{"poster":"Tutancadead","date":"2016-04-07T01:50:15.781+0000","up_votes":1,"down_votes":0,"body":"Hacer eso es haceptar que ir support es mala idea o aburrido.","replies":[]},{"poster":"ZayDusk","date":"2016-04-06T22:32:48.914+0000","up_votes":1,"down_votes":2,"body":"sinceramente prefiero que lo dejen asi a que empiecen con \"soi main sup desde la veta\" solo para ganar mas LP que posiblemente pierdan mas de los que ganen y ni un Ward en la partida ;)","replies":[]}]},{"poster":"WG Dikeydixon","date":"2016-04-06T03:38:48.081+0000","up_votes":2,"down_votes":8,"body":"Traer más mujeres.","replies":[{"poster":"feed no jutsu","date":"2016-04-06T03:59:43.054+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=RAG SkunkHaze,realm=LAS,application-id=v7qsfXsE,discussion-id=n3WsNxsu,comment-id=0003,timestamp=2016-04-06T03:38:48.081+0000)\n>\n> Traer más mujeres.\n\nQue ofensivo.","replies":[]},{"poster":"WG Dikeydixon","date":"2016-04-07T00:09:25.637+0000","up_votes":1,"down_votes":0,"body":"Jajaj veo que hay varias mujeres por acá","replies":[]},{"poster":"Tutancadead","date":"2016-04-06T23:43:43.682+0000","up_votes":1,"down_votes":1,"body":"Para que quiero mas adc y jubgles?\n\nLa única mujer support que vi... No vuelvo a jugar adc con ella.","replies":[]}]},{"poster":"Mioen","date":"2016-04-06T12:37:10.463+0000","up_votes":1,"down_votes":1,"body":"Lol.Como Supp es raro pero JAJAJAJAAJAJAJAJAJAAJAJAJJAJAJAJAJAJAJAJA","replies":[]},{"poster":"pajarit0","date":"2016-04-06T06:43:40.691+0000","up_votes":1,"down_votes":1,"body":"yo juego de support encuentro partida en 2 segundos jajajaja q picardia","replies":[]},{"poster":"XxlentaoxX","date":"2016-04-06T04:35:18.011+0000","up_votes":1,"down_votes":1,"body":"Vos mismo estas diciendo la recompensa de jugar support, colas cortas. Me vas a decir \"pero esa recompensa es una mie**a\". Bueno, Riot esta incentivando que todos jueguen en premade de 5 ~~bien de cagón~~ porque según ellos los del solo queue tenian un beneficio muy grande, colas cortas, así que para Riot debe ser mucho beneficio que los supports tengan colas rápidas...","replies":[]},{"poster":"Time Lord","date":"2016-04-06T03:44:37.234+0000","up_votes":1,"down_votes":1,"body":"Claro que hay un incentivo: tener colas más cortas.","replies":[]},{"poster":"ZeNch","date":"2016-04-06T03:09:50.459+0000","up_votes":1,"down_votes":1,"body":"Confirmo esto solo que con colas comunmente menores sin embargo... si es exagerada la diferencia d ecola","replies":[]},{"poster":"Tutancadead","date":"2016-04-06T23:42:32.912+0000","up_votes":1,"down_votes":2,"body":"Si. La iniciativa es barfear a janma y Soraka.","replies":[]}]}