{"poster":"iNGENiO","date":"2016-07-26T14:17:41.427+0000","title":"Podrían habilitar la compra de RP con tarjetas de Débito en Argentina?","subforum":"Charlas Generales","up_votes":17,"down_votes":0,"body":"Muchos no tenemos acceso a tarjetas de Cr&eacute;dito Internacional, y la compra de RP en efectivo o tarjetas locales en Argentina Sale Pr&aacute;cticamente el Doble que con tarjeta internacional.\r\n\r\nPodr&iacute;an habilitar pagar con tarjeta de d&eacute;bito a precios de las tarjetas internacionales. Ya hace mucho tiempo que no habilitan un nuevo m&eacute;todo de pago.\r\nO por transferencia bancaria a alguna cuenta de Riot.\r\nTambi&eacute;n recuerdo que en Argentina ya no existen limitaciones de compra en el exterior o restricciones que antes exist&iacute;an.\r\n\r\nOjala lo consideren, ya que cuesta conseguir tarjetas internacionales para comprar.\r\n\r\nMuchas Gracias espero no solo lo consideren sino que lo pongan en practica.","replies":[{"poster":"Lince Salvaje","date":"2016-07-26T14:44:53.083+0000","up_votes":1,"down_votes":0,"body":"Deberías de consultar si hay tarjetas de débito internacionales, en mi caso que soy de uruguay tenemos la alfa brou que sirve para compras online, deberias de llamar al banco y consultar si tienen algo similar. (consulta al menos 2 veces muchas veces te dicen cualquier cosa) :)","replies":[{"poster":"iNGENiO","date":"2016-07-26T14:54:55.886+0000","up_votes":1,"down_votes":0,"body":"Si ya consulte y no tengo solución lo único es con una tarjeta de crédito. Pero no quiero sacar una porque te cobran mantenimiento mensual.","replies":[{"poster":"Carl es el negro","date":"2016-07-26T15:17:20.659+0000","up_votes":1,"down_votes":0,"body":"Solo si haces gastos, sale como 50 pe el mantenimiento me parece.\n  De que banco es.","replies":[{"poster":"Turrote35","date":"2016-07-26T15:37:23.494+0000","up_votes":2,"down_votes":0,"body":"yo tenia una y te cobraban por si las \"dudas\" y eran mas de $50  y si la queria dar debaja tenias que pagar $1mill o por ahi.","replies":[{"poster":"Kukaplanero","date":"2016-07-26T19:14:58.441+0000","up_votes":1,"down_votes":0,"body":"Este mes pagué entre impuestos y gastos de tarjeta, $116. Igual, hay tarjetas y tarjetas, además que tenés recargos por pago mínimo, por atraso, y esas tasas de interés sí que te arruinan. Si eres responsable económicamente hablando, deberías de asesorarte sobre las tarjetas de crédito, es muy práctico tener cuanto menos una.","replies":[]}]}]},{"poster":"Sherpard","date":"2016-07-27T20:20:34.549+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=iNGENIO 40,realm=LAS,application-id=v7qsfXsE,discussion-id=tEhoEvin,comment-id=00010000,timestamp=2016-07-26T14:54:55.886+0000)\n>\n> Si ya consulte y no tengo solución lo único es con una tarjeta de crédito. Pero no quiero sacar una porque te cobran mantenimiento mensual.\n\nSegun el banco el mantenimiento puede costar un poco mas o un poco menos, pero raramente cueste mas de $75.\n\nYo tengo una extencion de mi viejo y por mantenimiento para cada tarjeta es de casi $45.","replies":[{"poster":"iNGENiO","date":"2016-07-28T11:32:03.867+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sherpard,realm=LAS,application-id=v7qsfXsE,discussion-id=tEhoEvin,comment-id=000100000001,timestamp=2016-07-27T20:20:34.549+0000)\n>\n> Segun el banco el mantenimiento puede costar un poco mas o un poco menos, pero raramente cueste mas de $75.\n> \n> Yo tengo una extencion de mi viejo y por mantenimiento para cada tarjeta es de casi $45.\n\n$150 en mi banco por una internacional, ya consulte.","replies":[{"poster":"Sherpard","date":"2016-07-28T18:47:13.414+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=iNGENIO 40,realm=LAS,application-id=v7qsfXsE,discussion-id=tEhoEvin,comment-id=0001000000010000,timestamp=2016-07-28T11:32:03.867+0000)\n>\n> $150 en mi banco por una internacional, ya consulte.\n\nDe entrada te digo que o te ven la cara de boludo o te quieren estafar.\n\nQue banco es?","replies":[]}]}]}]}]},{"poster":"Lolopp123","date":"2018-09-08T01:55:59.270+0000","up_votes":1,"down_votes":0,"body":"acabo de comprar rp con una tarjeta visa , todo bien me aparecio felicitaciones por la compra y todo eso y creo ver un codigo que me pusieron pero lo pase pensando que automaticamente tendria los rp pero nada como se podria ver eso nuevamente o tengo que esperar","replies":[{"poster":"iNGENiO","date":"2018-09-08T22:29:53.413+0000","up_votes":1,"down_votes":0,"body":"Es una charla vieja. Actualmente se puede comprar con tarjeta de débito desde la tienda.\n\nEl RP se carga en el instante.\n\nCualquier problema contacta al soporte.\n\n{{sticker:slayer-jinx-catface}}","replies":[]}]},{"poster":"HyenaLoL","date":"2016-07-27T06:35:07.637+0000","up_votes":1,"down_votes":0,"body":"Chabelo yo te invoco (?\nIgual me parece interesante.El tenes tarjetas de debito habilitadas como forma de pago puede ser la dif entre que gaste alrededor de 100 dolares anuales o no en rp en mi caso","replies":[{"poster":"iNGENiO","date":"2016-07-27T11:50:21.197+0000","up_votes":1,"down_votes":0,"body":"Es que la mayoría de los que trabajamos en la argentina nos pagan el sueldo en una tarjeta de débito.","replies":[]}]},{"poster":"Nykomin","date":"2016-07-26T20:38:45.253+0000","up_votes":1,"down_votes":0,"body":"Creo que el servidor esta en Chile y por eso no te dejara pagar con debito a menos que el servidor cambie de pais...","replies":[{"poster":"iNGENiO","date":"2016-07-27T11:47:28.844+0000","up_votes":1,"down_votes":0,"body":"O que Riot habilite pagar con tarjeta de débito en la argentina igual que tiene habilitado otros medios de pago. Tan difícil no creo que sea mercadolibre lo tiene hace años, te genera un código de pago electrónico y lo pagas por homebanking.","replies":[]}]},{"poster":"Istri","date":"2016-07-26T21:05:17.964+0000","up_votes":1,"down_votes":0,"body":"tambien existe rapipago o pago facil.... no te cuesta imprimir que son 1 peso o 2 pesos mas o menos... e ir a una tienda :D","replies":[{"poster":"iNGENiO","date":"2016-07-27T11:45:35.171+0000","up_votes":1,"down_votes":0,"body":"Salen el Doble los RP por rapipago o cualquier medio local. Por la misma cantidad de dinero compras el doble de rp con tarjeta de crédito internacional.\n\nY si que cuesta imprimir e ir a un pago fácil donde tipicamente hay 40 personas de cola para pagar. Donde yo vivo es un infierno las colas.\n\nEstaría bueno que se pueda pagar por transferencia bancaria con débito directamente con un código de pago electrónico.","replies":[]},{"poster":"rimski","date":"2016-07-27T00:13:57.922+0000","up_votes":1,"down_votes":0,"body":"pero por la misma plata que podes usar en un pagofacil con una tarjeta recibis casi el doble de rp.","replies":[]}]},{"poster":"Don Antares","date":"2016-07-27T01:19:21.231+0000","up_votes":1,"down_votes":1,"body":"Antes que todo, en argentina tiene el rp al precio mas bajo de las. El problema sucita en que el cambio de su moneda a dolar es bajo. yo siendo de chile compro rp en argentina ya que me sale un 40% mas economico si no tienes targeta de credito, puedes usar paypal, que es una forma segura,  pero te repito el valor del rp para riot esta considerado en dolares y el peso argentino a estar por el suelo hace que aumente el precio del rp al pagar en efectivo, targeta local o targetas de pre pago. no seas boludo transfiere tu dinero a paypal y compra por dolares,\n{{sticker:zombie-brand-mindblown}}","replies":[{"poster":"iNGENiO","date":"2016-07-27T11:42:52.370+0000","up_votes":1,"down_votes":0,"body":"No no puedo pasar el dinero a paypal, con tarjeta de débito ya probe todas las formas y no se puede.","replies":[]}]},{"poster":"Khimea","date":"2016-07-26T14:25:13.262+0000","up_votes":1,"down_votes":0,"body":"Tarjetas internacionales son TC y TD (visa)\nPayPal seria \"transferencia bancaria\"\n\nAl menos que tengas otra TD.","replies":[{"poster":"iNGENIO POWEr","date":"2016-07-26T14:31:52.228+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Khimea,realm=LAS,application-id=v7qsfXsE,discussion-id=tEhoEvin,comment-id=0000,timestamp=2016-07-26T14:25:13.262+0000)\n>\n> Tarjetas internacionales son TC y TD (visa)\n> PayPal seria &quot;transferencia bancaria&quot;\n> \n> Al menos que tengas otra TD.\n\nA ver si me podes ayudar...\n\nCon las tarjetas de debito por mas que sean internacionales, no podes comprar en riot, te la rebota. (TD?)\nLas tarjetas de crédito tienen 2 modalidad nacionales o internacionales.\n\nY paypal, no acepta transferencia bancaria, también necesitas una tarjeta de Crédito vinculada.\n\nYo que no tengo tarjeta de Credito, y solo debito no se como comprar.\n\nComo compras con tarjeta de Debito?","replies":[{"poster":"Khimea","date":"2016-07-26T14:36:39.795+0000","up_votes":1,"down_votes":0,"body":"1. Si tu tarjeta de debito no esta habilitada para compras online o compras internacionales es normal que te la rebote.\n2. Tarjetas nacionales pueden ser tanto como credito y debito (que no son visa)\n3. Paypal acepta, cuenta bancaria, TC y TD ,  (siempre y cuando como dije mas arriba este habilitada para compras online) obviamente todo esto se tiene que \"vincular\".\n\n> TD = Tarjeta de Debito  TC = Tarjeta de Credito","replies":[{"poster":"iNGENiO","date":"2016-07-26T14:41:43.470+0000","up_votes":1,"down_votes":0,"body":"1) Llame al banco provincia de argentina y no tiene forma de habilitar un tarjeta de debito Visa Internacional,para compras internacionales porque dicen que tienen que convertir de dolar a peso y eso no lo hace el sistema. Que necesito una de credito internacional para esto.\n\n2) La mia es de debito.\n\n3) En paypal, no puedo vincular mi tarjeta de débito y tampoco mi cuenta bancaria. Si sabes como hacerlo y me podrías explicar te lo agradezco.\n\nAsique por ahora no logro comprar RP con mi tarjeta de débito.  Otro método seria que Riot me genere un código de pago electronico (Codigo LINK). Y asi poder pagarlo por homebanking como hace mercadolibre por ejemplo.","replies":[{"poster":"Khimea","date":"2016-07-26T14:48:23.668+0000","up_votes":1,"down_votes":0,"body":"1. El banco provincia es una bazofia para estas cosas, tuviste mala suerte xD.\n\n2. Trata de usarla ahi, pero obviamente va salir ese precio que seria \"mas caro\"\n\n3. Paypal no podes por el primer punto, no te habilitan la tarjeta para compras internacionales.\n\nSolucion: Podes pedir una TC prestada o solicitar una TC al banco","replies":[{"poster":"iNGENIO POWEr","date":"2016-07-26T14:53:41.698+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Khimea,realm=LAS,application-id=v7qsfXsE,discussion-id=tEhoEvin,comment-id=00000000000000000000,timestamp=2016-07-26T14:48:23.668+0000)\n>\n> 1. El banco provincia es una bazofia para estas cosas, tuviste mala suerte xD.\n> \n> 2. Trata de usarla ahi, pero obviamente va salir ese precio que seria &quot;mas caro&quot;\n> \n> 3. Paypal no podes por el primer punto, no te habilitan la tarjeta para compras internacionales.\n> \n> Solucion: Podes pedir una TC prestada o solicitar una TC al banco\n\nGracias por la info de ante mano.\n\nComo no puedo pedir un Tarjeta de Crédito Prestada y Tampoco Quiero solicitar una tarjeta de Credito al banco ya que me cobra $150 por mes de mantenimiento.\n\nBueno por eso mismo, me gustaría que Riot habilite un método de pago con tarjeta de debito en argentina. Así puedo comprar sin problemas ya que intente hacerlo de varias maneras y no puedo.","replies":[{"poster":"Khimea","date":"2016-07-26T15:01:18.424+0000","up_votes":1,"down_votes":0,"body":"Es que ya no depende de RIOT, como te dije antes esta habilitada la compra. Pero el banco no te habilita a vos.\n\nRealmente es un bajon :S","replies":[]}]}]}]}]}]}]}]}