{"poster":"Smoke a Bowl","date":"2017-09-30T17:09:46.009+0000","title":"Riot Bans me over a previous temporary banishment.","subforum":"General Discussion","up_votes":1,"down_votes":11,"body":"Here I am explaining why I was permanently banished from league of legends; and hoping that this might spark something among the players to see why I was wrongfully banished permanently and am no longer able to use the account I spent over $600 on. I noticed after playing some games and not really saying much that literally the next day I was banished from league of legends. I didn&#039;t know why so I tried to get a hold of an administrator. Here is what perspired.\r\n\r\n\r\n**&quot;SMOKE A BOWL\r\nTuesday at 11:27\r\nFor some reason i went to log in and it said i have been permbanned and i did nothing wrong to get the ban i dont really understand why. I mean you guys have a chat filter in the game so why the hell would i be ban me for chat. And to top it off there is a chat ban? Why would you go to the point of permban on my account it does not add up. There is alot of other way to go about it i have put alot of time and money into this game so i really think the permban is going over bored why would there be a reason to permban me even when i read the term of use there is nothing in it that i did to get this ban in the first place so i would like it if you guys could come up with something other then this if you will not and leave the account the way it is i would like my money back i spent in the first place you dont have a right to permban me for what has happened even in your term on the website it says this there is a chat ban for a reason.\r\n\r\nSMOKE A BOWL\r\nTuesday at 11:32\r\nThis is going way over the top with it even when i read the chat you ban me for there is nothing in here that could add up to anything more then a chat ban not a permban so tell me why this was a pick in the first place. Like i said before when i read the terms of use there is nothing in it that would let you permban me for chat i said nothing to the other person other then what was in the game i may have used a bad word or 2 but there is a reason you have the chat filter i didnt say anything to him about his life or anything about him as a person i talked about in game plays we needed to do and he got upset with me and we just went at it there is no reason for a permban here please tell me why that ban is there and why its not a chat ban?\r\n\r\nBROKEN BLADE\r\nThursday at 15:27\r\nHey there,\r\n\r\nWe will not be altering or lifting the suspension on this account because it was issued a two week suspension prior to this suspension. Restrictions and suspensions are a form of warning to improve your behavior or you could see harsher punishments in the future, which is what happened in this case. Verbally demeaning, antagonizing, arguing with other players, and using offensive language is unnecessary negativity that you should be aware of at this point.\r\n\r\nIf you would like to read more about our Instant Feedback System here is our FAQ:\r\nhttps://support.riotgames.com/hc/en-us/articles/207489286\r\n\r\nWe stand firm on our decision to issue this punishment and will not be making any exceptions in regards to lifting it.\r\n\r\n \r\n\r\nBroken Blade\r\nPlayer Behavior and Game\r\n\r\n\r\nSMOKE A BOWL\r\nThursday at 19:58\r\n&quot;We will not be altering or lifting the suspension on this account because it was issued a two week suspension prior to this suspension.&quot;\r\n\r\nSo when was this suspension? and why would a suspension lead to a banishment from being able to play the game? \r\nWill you be refunding the money I have spent on this game or will I have to make this a legitimate concern in which I&#039;d have to get in contact with a representative about? \r\nI find that this is literally a theft and unreasonable situation; I talk in a game; in which the person can choose to mute the person that they therefore do not want to hear; and get banned for it? Please get me a person that is not some regular employee in this situation as I&#039;m seeing that this situation is not going to be handled and I know for a fact that it&#039;s not okay to just be BANISHED from a GAME over a conversation. This has not even been reconciled or considered. I do not like what I received as a response. Please advise; thank you.\r\n\r\nMAMA MEEP\r\nYesterday at 13:23\r\nHey there,\r\n\r\nI am here to fill in for Broken Blade. Your 2 week ban occurred from May 15th to May 29th of this year. You were warned at that time that continuing poor behavior would lead to a permanent ban being placed.\r\n\r\nThe mute button is intended to help players protect their game experiences. However, if another player has to mute you, it means you&#039;ve already caused harm to them. This means what you do beforehand is a punishable offense and can lead to consequences such as this one being placed.\r\n\r\nI know for a fact that it&#039;s not okay to just be BANISHED from a GAME over a conversation.\r\n\r\nIt is actually 100% okay, given that the way you were talking to others violated our Terms of Use. When those terms are broken, it voids your ability to use the account and lead to account termination.\r\n\r\nI am sorry if you do not agree with what has been said here, but our stance on this ban is final and this account will not be usable again.\r\n\r\nMama Meep\r\nPlayer Behavior &amp; Game Support\r\n❄️ Meep Collector ❄️\r\n\r\n 14 day ban messaging.png (600 KB)\r\nSMOKE A BOWL\r\nYesterday at 20:11\r\nThis is not solved; your stance is ignorant; because of a Temporary Banishment that happened months ago; your deciding to PERMANENTLY LOCK me from my ability to play the game? Do you see how illogical this is? &quot;He did something months ago, let&#039;s ban him over that&quot; You just told me literally that because of something that happened some other time ago that now because something happened NOW that my account has a reason to be banished. That is the most illogical response I&#039;ve ever heard of. I wish to speak to a more responsible person; if that&#039;s your manager I&#039;m fine with that; but really; how my situation is being handled.. and considering how much I&#039;ve SPENT on this GAME I&#039;m not letting this go; You&#039;re just saying &quot;YOUR STANCE IS FINAL&quot; and that I DON&#039;T HAVE A CHANCE TO USE MY ACCOUNT AGAIN?? WHY IN THE WORLD WOULD THAT BE AN OPTION TO SOMEONE WHO HAS SPENT MONEY ON THIS GAME? IT&#039;S OFFENSIVE AND THEFT OF MY MONEY.&quot;**\r\n\r\n\r\nAfter all of this I was still repetitively told that because of something that happened months ago that because of it occuring at all THIS is the reason in which I am being PERMANENTLY BANISHED from the game; I am wondering if I can get some REAL advice here and see if I am REALLY in the wrong; I literally cannot believe I can no longer play a game on the account I&#039;ve had since HIGH SCHOOL... So this offends me so much and I really need help here; I don&#039;t get what in the world I said because the administrators won&#039;t tell me what I&#039;ve done without leaving out every bit of context and just saying what is on their minds and not what is best for the player at hand. There is 0 consideration to the fact that I spent money on this game and that I&#039;ve been an extremely long term player. There is no true reason for a permanent banishment; unless they&#039;re trying to get me to spend another $600 on the game; in which. . . I am never going to spend another dollar on this game because of this situation. I never believed that I would lose every single one of my skins and all of my champions obtained in progress because of some chat. Nobody does. Nobody should be banned for some simple situation like this. I was banished over some things that shouldn&#039;t be banish-ABLE. I explained thoroughly and the people who were managing my ticket agreed with me that there is a MUTE BUTTON in the game and the ability to  NOT HEAR WHAT SOMEONE ELSE IS SAYING. So Where in my keyboard warrior-isms was I so in the WRONG? I don&#039;t know but for real.. This is the most shitty ban I&#039;ve ever experienced because the people handling my ticket are so inconsiderate and unforgiving and think that their statements are &quot;FINAL&quot; As read above. This is the most fucked up situation among a few other with my tickets that I&#039;ve dealt with. Riot you are embarrassing yourselves so much.\r\n\r\n- Adam Smithson.","replies":[]}