{"poster":"TN Stormey","date":"2017-08-10T23:21:11.369+0000","title":"Consigli Tristana early game","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Salve evocatori,\r\nSono recentemente uscito dal bronzo spammando quasi solamente la mia Tristana e ho notato che ha un late game molto buono e che riesco a gestirlo bene (positioning nei fight,obbiettivi ecc.). Il mio problema per&ograve; resta l&#039;early game: in primis non riesco a farmare correttamemte per colpa della mia E che infligge danni ai minion circostanti ogni volta che ne lasthitto uno e poi non so bene cosa fare se il team sta in svantaggio rispetto a quello nemicoi o come sfruttare il potenziale del champion al 100%.. qualche consiglio?\r\n\r\nP.S. Un altro problemino che ho nel farmare ad inizio partita &egrave; il fatto che ogni volta che sto per tirare il last hit ad un minion gli faccio meno danni di quanto mi sarei aspettato e lo misso :/","replies":[{"poster":"ILoveTiramisu","date":"2017-08-11T07:49:51.700+0000","up_votes":3,"down_votes":0,"body":"La prima cosa che ti controllo sono rune e masteries. Dove vedo solo difetti piccoli non relativi al last hit:\n\nNon mi piace il fatto che hai preso la  resistenza magica per livello contro morgana. Se la prendi, la prendi in un match ups contro supporti passivi. Inoltre, dovresti usare la salute flat invece dell armor. Il motivo è che in botlane il snowball è assurdo e conviene essere sicuri di non morire mai nei primi livelli.\n\nNelle maestrie (Risolutezza) hai preso il +5% resistenze invece del +2/5s rigenerazione salute. Senza paura invece di Intuito. E pelle dura invece di Maestro degli assedi.\n\nPero questo non cambia nulla sul last hit. Allora io gioco tristy da prima del rework e all inizio ho usato questo problema anch'io. La prima parte di questo problema è che quando pulli il jungle tendi a perdere i primi 3 minions melee, infatti ho ridotto l aiuto al jungler di una E+4 auto epoi corro in lane. In genere non faccio mai piu di 4 autoattacchi di pull. {{champion:202}} (Speravo ci fosse un emote di jhin che sorride)\n\nQuesta passiva mi ha portato a usare tattiche per lasthittare. Vorrei vedere se trovo un registrazione di quando gioco tristana e inviartela.\nHo trovato una di doublelift: https://www.youtube.com/watch?v=LKxNRqU7aPA a 3.00 minuti, ma fai cosi per ogni wave per tu vuoi ushare velocemetne.\n\nComunque i trucchi sono quelli di attaccare un minion all inizio per registrare mentalmente il suo danno, caster per lasthittare un caster o melee per lasthittare un melee.\nAttacchi il primo minion della wave ovviamente. \n","replies":[]},{"poster":"Don Draven","date":"2017-08-11T00:51:52.437+0000","up_votes":2,"down_votes":0,"body":"Allora,io ti posso dire per esperienza che tristana è un champ da late game hyper carry pertanto o ti feddi in early e continui  a farmare o sarai comunque dipendente dal tuo team inizialmente e in ogni caso.\n\nAppurato ciò,se l'early game va a \"minigotte\" io ti consiglio di splitpushare (insomma farmare da solo e EXPARE da SOLO).<sempre ammesso che hai il flash up e cercare di fare KS (si lo sto dicendo davvero e suona da infami ma devi farlo,perché stiamo ipotizzando che tu sia l'mvp e che carrierai duramente in late game.\n\nquesti sono le migliori cose che tu possa fare,avrai la possibilità di carriare,non ti lamentare però se poi il tuo master yi è inutile.\n\nComunque se ti piace giocare adc e sei promettente ti suggerisco ardemente {{champion:119}} è molto appagante e non devi affidarti al team e al support come farebbe {{champion:18}}  (nulla da toglierle però).","replies":[{"poster":"Ser Nalor","date":"2017-08-11T14:10:27.986+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Quicksìlver Sash,realm=EUW,application-id=MJVj50Jw,discussion-id=QH7MG5Xg,comment-id=0001,timestamp=2017-08-11T00:51:52.437+0000)\n>\ne cercare di fare KS (si lo sto dicendo davvero e suona da infami ma devi farlo,perché stiamo ipotizzando che tu sia l&#x27;mvp e che carrierai duramente in late game.\n\nnon suona da infami in quanto un team intelligente cercherebbe di lasciarti le kill in quanto tu sei il loro ADC e a maggior ragione che hai avuto un pessimo early sarebbe utile per loro farti recuperare lo svantaggio xD \ntrascinarsi un adc che non fa danno e che è pure squishy (quindi facilmente killabile) è come stare perennemente 4vs5\n\na tal proposito, visto che si parla di {{champion:18}} vorrei chiedervi una cosa:\n\nbuildarsi {{item:3085}} ha senso su di lei?\nla passiva che fa danno ad area quando lasthitti stacka su tutti e 3 i colpi o solo sul target?\n\nio di solito quando mi capita di essere fillato adc e la gioco non lo buildo... preferisco fare più danno a target singolo","replies":[{"poster":"Don Draven","date":"2017-08-11T19:00:36.937+0000","up_votes":2,"down_votes":0,"body":"piuttosto fatti la combo {{item:3087}} {{item:3094}} {{item:3031}} .\n\nper il discorso del ks è da infami perché io intendo proprio che tu le prendi anche solo di W ed il problema è che si avvantaggi te ma non permetti al tuo team di snowballare,magari in late fai un passo falso e fai perdere il game e ovviamente a tal punto forse quelle 4 5 kills stealate avrebbero fatto comodo ai tuoi alleati.","replies":[{"poster":"Ser Nalor","date":"2017-08-11T22:34:08.736+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Quicksìlver Sash,realm=EUW,application-id=MJVj50Jw,discussion-id=QH7MG5Xg,comment-id=000100000001,timestamp=2017-08-11T19:00:36.937+0000)\n> per il discorso del ks è da infami perché io intendo proprio che tu le prendi anche solo di W ed il problema è che si avvantaggi te ma non permetti al tuo team di snowballare,magari in late fai un passo falso e fai perdere il game e ovviamente a tal punto forse quelle 4 5 kills stealate avrebbero fatto comodo ai tuoi alleati.\n\neh ma vorrebbe dire che devi migliorare tanto da adc...\n\npurtroppo in un team è una figura molto importante nonché fragile, l'autoattack dell'adc è, di norma, quello che dovrebbe far più danno e se lo aiutano nel riprendere uno svantaggio lasciandogli 4-5 kill e poi gli fa perdere la partita per uno o più errori di positioning o per qualcos'altro, non meritava di vincere quel game :D\n\nma, al contrario, se neanche gli davano quelle 4-5 kill il game era probabilmente perso a prescindere.\n\npoi non si sa mai :D secondo me è sempre ottima la cosa di far recuperare gli alleati. ti da molte più chance di vittoria.\n\ncomunque grazie per le delucidazioni sul {{item:3085}} e per aver confermato che faccio bene a non buildarlo su {{champion:18}}","replies":[{"poster":"Don Draven","date":"2017-08-12T00:28:01.669+0000","up_votes":1,"down_votes":0,"body":"bhe quello che dici non è sbagliato però te metti in conto che ci sia solo l'adc che sbaglia ma non l'assassino che invece se la gioca molto bene,a quel punto è tutto un altro discorso.","replies":[]}]}]},{"poster":"TN Stormey","date":"2017-08-11T18:08:14.884+0000","up_votes":2,"down_votes":0,"body":"> a tal proposito, visto che si parla di {{champion:18}} vorrei chiedervi una cosa:\n> \n> buildarsi {{item:3085}} ha senso su di lei?\n> la passiva che fa danno ad area quando lasthitti stacka su tutti e 3 i colpi o solo sul target?\n\nSolo sul target.. io non consiglio di buildarlo il Runaan","replies":[]}]}]},{"poster":"The Fluffy Lamb","date":"2017-08-11T00:32:59.407+0000","up_votes":2,"down_votes":0,"body":"Il last-hit è tutta una questione di abitudine. cerca di memorizzarti la quantità di vita che il champ toglie all'incirca. dopo che ti sei fatto la {{item:1038}} si farma molto meglio.\n\nPS si sono bronzo III ma quando vado adc sono quasi sempre 200+ farm assicurati. Per ora posso vantarmi di essere discreto almeno in quello xDD","replies":[]}]}