{"poster":"Burter","date":"2017-11-08T15:02:04.316+0000","title":"Probar nuevas runas en normals...","subforum":"Charlas Generales","up_votes":4,"down_votes":1,"body":"En momentos como este me duele que no tengamos normal draft mode. Como se supone que pruebe las runas si no veo lo que tengo en contra?\r\nSoloQ nunca encuentra partida btw...","replies":[{"poster":"Charlôtte","date":"2017-11-08T15:12:29.703+0000","up_votes":2,"down_votes":0,"body":"A la una se supone que se habilita el normal draft :B","replies":[{"poster":"Burter","date":"2017-11-08T15:14:04.273+0000","up_votes":1,"down_votes":0,"body":"13:00 de hoy?","replies":[{"poster":"Charlôtte","date":"2017-11-08T15:16:57.382+0000","up_votes":1,"down_votes":0,"body":"Si no me equivoco, en Chile son las 11:15am (una hora menos que en argentina), y reclutamiento se habilita de 12:00pm a 12:00am, es decir de 13:00pm a 01:00am Argentina.","replies":[]}]}]},{"poster":"9081913DEL1","date":"2017-11-08T15:07:00.657+0000","up_votes":2,"down_votes":0,"body":"Paciencia, los primeros dias sera un poco un caos. Pronto deberia ir mejorando eso. \n\nLas runas, a mi me llegan videos de uso desde riotgames, si te suscribes al news del oficial de lan te llegan tips bastante interesantes. \nLo interesante esta en probar que hace tu campeon con la runa mas que como te enfrentas, aprovecha esta pretemporada para eso, ya que tampoco sabes que runa clave y combinacion estara usando el oponente.\nLa solucion es obviamente jugar en equipo y contra rosters.\n\nSaludos!","replies":[{"poster":"Burter","date":"2017-11-08T15:10:17.882+0000","up_votes":1,"down_votes":0,"body":"Seria mucho mas eficaz probar las nuevas runas con el estilo de draft mode ya que hay runas interesantes que otorgan mas utilidad conociendo si, por ejemplo, te enfrentas contra un champion AD o AP o si es squishy o tank. Tambien, si reconoces que el early game no va a ser tan duro podes pickear runas de scale, pero imposible de saber en draft pick =(","replies":[{"poster":"9081913DEL1","date":"2017-11-08T15:17:07.913+0000","up_votes":1,"down_votes":0,"body":"Exactamente. Eso es cierto.\n\nSaludos!","replies":[]}]}]}]}