{"poster":"Kizuma","date":"2016-04-30T18:31:24.119+0000","title":"Ich stecke in silver fest.","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":0,"body":"Guten Tag,\r\n\r\nich habe begonnen Season 4 zu Spielen, war damals Silver 4 (hab aber wie bronze gespielt).\r\nIn Season 5 war ich durchgehend Silver 2 und in der preseason Gold 4.\r\nJetzt bin ich wieder seit seasonstart Silver 3 und bin Mid-main.\r\nIch versuche mich stetig zu verbessern und wei&szlig; dass ich f&uuml;r meine Fehler selber verantwortlich bin und nicht meine mates...\r\n\r\nDas problem ist, ich werde einfach nicht besser...\r\n\r\n\r\nHat jemand Tipps?\r\nBin schonwieder 220 games in Silver...\r\n\r\nDanke im Voraus,\r\nSer&egrave;nity","replies":[{"poster":"SuperplexP","date":"2016-05-01T20:59:09.867+0000","up_votes":2,"down_votes":0,"body":"So mal meine Verbesserungsvorschläge:\n\n 1. Für einen Midlanemain sieht deine History gelinde gesagt bescheiden aus. Unter deinen meistgespielten Champs sind alle Lane vertreten. Lass das. Du spielst 2 maximal 3 Lanes im Ranked. Wenn du Midlanemain bist und deiner History zufolge nimm Mid/Adc oder Mid/Top.\n\n 2. Runenseiten: In Blau gehört NUR und AUSCHLIEßLICH CDR/Level oder MR (wahlweise /Level oder auch nicht), weder Ap noch Attackspeed. Ansonsten empfehle ich dir nachdrücklich mal nach ordentlichen Runenseiten für deine Champs zu schauen. (z.B. auf leagueofgraphs.com)\n\n3. Du stirbst zu häufig, vor allem auf der Midlane. Versuch die Lane sicherer und weniger aggressiv spielen und kämpfe nur, wenn dein eigener Jungler da ist, oder du den gegnerischen Jungler siehst.\n\nMehr Tipps kommen eventuell demnächst noch.","replies":[{"poster":"Spicavius","date":"2016-05-02T01:17:43.620+0000","up_votes":1,"down_votes":1,"body":"naja er würde ja nicht so viele Lanes spielen, wenn er nicht andauernd seinen Account mit jemand anderes teilen würde.\n\nMusst dir mal die Historie mal bis November 2015 anschauen ist ganz witzig wie gut er plötzlich mit adc´s spielt und dann plötzlich nicht mehr und eine 10 Spiele loose Streak danach hat :D","replies":[]}]},{"poster":"Revilous","date":"2016-04-30T19:56:57.185+0000","up_votes":2,"down_votes":0,"body":"Wenn du Low bist - geh back und ping deinem Jungler er soll deine Lane deffen\n\nWenn dein Gegner Low, back oder tot ist und kein TP hat - geh roamen (helfe deinem Jungler beim ganken)\n\nachte auf dein Positioning im Teamfight und sei dir bewusst welche Rolle du für dein Team erfüllen musst.\n\nPushe nur wenn dein Gegner back, tot oder Low ist und du weißt, dass der Gegnerjungler dich nicht töten kann.\n\nSpiele einfache Carry Champs mit Capclosern und übelstem DMG wie Katarina oder Akali.\n\nDie größten Fehler die in Low Elo gemacht werden sind:\n- mit Level 5 pushen obwohl der Gegner einen Level 6 Powerspike hat (katarina / akali)\n- Mit wenig HP am Tower bleiben (katarina / Akali können easy towerdiven)\n- kein miss pingen und generell nicht followen wenn der Gegner roamt.","replies":[]},{"poster":"Miss Man","date":"2016-04-30T18:44:20.086+0000","up_votes":1,"down_votes":0,"body":"dein laner ist tot/base ? geh roamen\nim teamfight richtig stehen\nwarden links und rechts\ngeh helfen scheiss auf minions","replies":[{"poster":"Megamaexx","date":"2016-04-30T21:51:16.580+0000","up_votes":1,"down_votes":0,"body":"Die armen Minions :( und am Ende steht man dann vor einer braunen Armee...\nOkay Spaß beiseite^^\neinen angemessenen Farm sollte man trotzdem behalten. Diese komplett ignorieren, bringt sie/ihn auch nicht weiter. Ich glaube auch nicht, dass du, nachdem dein Lanegegner die Lane Richtung Basis verlässt, den free Farm einfach stehen lässt, nur um eventuell irgendwo einen Assist abzustauben^^","replies":[]}]},{"poster":"Chri","date":"2016-04-30T18:46:39.646+0000","up_votes":1,"down_votes":0,"body":"Guck dir streams von high elo spielern an und lerne hab ich such so gemacht bin zwar auch nicht hoch nur platin1 aber bin noch beim climbten","replies":[]},{"poster":"Spicavius","date":"2016-04-30T19:48:42.179+0000","up_votes":1,"down_votes":1,"body":"**Edit:**\nSchau dir vllt mal mit einem Replay Programm deine verlorenen Spiele an. Mir z.B. hat das damals geholfen von Platin 1 auf Diamant 3 aufzusteigen.\nIch habe festgestellt, dass die Leute an anderen Momenten doch andere Dinge tun als ich sie erwartet hatte.\n\nSeien es die Wardplatzierungen, die Jungleroute, Gankrouten, Reaktionen vom gegnerischem Jungler auf bestimmte Aktionen im Spielverlauf etc. \nZudem kannst du dir bestimmte Situationen nochmal anschauen.\n\nBeispiel von mir:\nIch war Olaf und habe eine Syndra gechased und habe sie gekillt, während mein Team vom restlichen gegnerischem Team gedived wurde.\nDabei dachte ich mir, dass ich alles richtig gemacht habe, aber im Nachhinein habe ich gesehen, dass ich einen Fehler gemacht habe.\nWäre ich nämlich bei meinem Adc gerade in dieser Situation geblieben, wäre mein Adc nicht gestorben und der gesamte Teamfightverlauf wäre ganz anders abgelaufen. Diese Situation war natürlich etwas komplexer, aber das war die Essenz des Ganzen.\n\nNaja sowas wäre mit nunmal nicht mit dem Replay aufgefallen und ich hätte in der nächsten (ähnlichen) Situation den gleichen Fehler gemacht. Letztendlich haben wir eben wegen mir verloren, weil ich genau in dieser Situation falsch entschieden habe.\n\nAn sich konnte ich jetzt nichts negatives an deinen Runen/Biulds/Masteries finden.\n\n_________________________________________________________\n\n\nP.S. Es würde helfen, wenn du nicht andauernd zwischen {{summoner:4}}  auf **D** und {{summoner:4}}  auf **F** wechseln würdest. \"Hust\"\nVllt würde es helfen, wenn nicht 2 Spieler auf diesem Account rankeds zocken würden und ja der andere Spieler ist zumindest als ADC besser als du.","replies":[]},{"poster":"Valtyna","date":"2016-04-30T22:04:00.018+0000","up_votes":1,"down_votes":3,"body":"Du steckst nicht in Silber fest, du nur wurdest richtig Eingestuft. {{champion:43}}","replies":[]}]}