{"poster":"naxitoxD","date":"2016-12-14T18:12:45.414+0000","title":"esto es imposible camille rotisima","subforum":"Charlas Generales","up_votes":2,"down_votes":10,"body":"como es posible que aun tirandole un skillshot de este campeon {{champion:17}}  aun pueda aturdir y mas encima quitar mas de la mitad de vida , realmente esta rotisima y no se pouede jugarcontra alguien asi de roto es imposible me toco camille top le gane por paliza pero igual esta campeona es rara no es posible que aguante tanto con solo items de da&ntilde;o como estos {{item:3074}} {{item:3053}} \r\nesta bien tener vida , pero no tenia resistencia magica y como es posible que alguien siendo asesino aguante tanto ataque?, ni idea esta cmapeona esta muy rota que ya aburre el lol con campeones asi de injustos y a otros campeones los dejan una basura tenia estos items con este  campeon {{champion:17}}  {{item:3116}} {{item:3085}} {{item:3157}} y aun asi esta campeona me quitaba mas de la mitad con solo 2 items, ni si quiera tenia botas de mercurio por ultimo , para que vean lo rota que se encuentra la nueva campeona aviso a todos ya no se puede jugar lol como antes, demasiado campeon con movilidad como excesiva y estupida que tiene camille un ascoo de campeon","replies":[{"poster":"Lince Salvaje","date":"2016-12-14T18:16:21.198+0000","up_votes":1,"down_votes":1,"body":"desde cuando teemo tiene skillshots ?\ndesde que lei eso este post dejo de tener sentido para mi xD","replies":[{"poster":"naxitoxD","date":"2016-12-14T18:57:52.331+0000","up_votes":2,"down_votes":4,"body":"esta gente no comprende lo que lee skillshot de camille uff esta gente ._.{{sticker:zombie-brand-clap}}","replies":[{"poster":"Lince Salvaje","date":"2016-12-14T19:05:25.171+0000","up_votes":4,"down_votes":0,"body":"> como es posible que aun tirandole un skillshot de este campeon{{champion:17}} \n  aun pueda aturdir\n\n\nDonde dice que es un skillshot de camille ? \naprende a redactar antes de hablar.....","replies":[]}]}]},{"poster":"Vanguard","date":"2016-12-14T18:15:59.216+0000","up_votes":2,"down_votes":1,"body":"Camille no es una asesina, es un bruiser. Recien salio, espera un poco y la gente ya va a aprender a hacerle counter, por ejemplo, si te pego el stun, podrias estar atento para la proxima, de no ponerte cerca de los muros.","replies":[{"poster":"Doomenator","date":"2016-12-14T18:23:03.643+0000","up_votes":3,"down_votes":3,"body":"Ese es el problema genio, se supone que es un bruiser pero anda a pelear cerca de la jg, con esa movilidad infinita salta al adc y le mete 600 de true dmg.\n\nTiene un kit super overloaded, negarlo es ser ignorante","replies":[{"poster":"Vaendrys","date":"2016-12-14T18:31:44.912+0000","up_votes":3,"down_votes":1,"body":"Y no le pelees en la jg.\nEs como querer pelearle a un GP o un Rumble en la jg, no es muy buena idea.","replies":[{"poster":"Doomenator","date":"2016-12-14T20:40:44.876+0000","up_votes":1,"down_votes":1,"body":"pero la movilidad ya es mucho, no quiero que se la nerfeen pero teniendo esa movilidad cosas como el escudo o el stun están completamente de más","replies":[{"poster":"Vaendrys","date":"2016-12-16T11:14:10.081+0000","up_votes":1,"down_votes":1,"body":"Sigo viendo mas rota la W de Fiora xD","replies":[{"poster":"Doomenator","date":"2016-12-17T05:24:11.872+0000","up_votes":1,"down_votes":0,"body":"Yo también xd pero tienes que ver el contexto, algunas habilidades son mejores que otras pero la sinergia con el resto de sus habilidades las hacen op.\n\nEl kit de camille entero queda súper overloaded con esa habilidad.\n\nEste campeón tiene movilidad, tiene stun, tiene un slow de como 90%, tiene heal, tiene intargetabilidad (con la r) tiene engage, tiene una ulti que LITERALMENTE no te deja escapar de ninguna manera, tiene un knock-up a los enemigos con la R, tiene daño y para terminar, tiene daño verdadero (y mucho).\n\nCasi se me olvida, tiene un escudo de daño físico y otro de daño mágico.\n\nCompáralo con cualquier campeón menos ekko y vas a ver que camille tiene demasiadas herramientas, lo único que no tiene es waveclear, lo demás tiene TODO lo que puede tener.","replies":[]}]}]}]}]},{"poster":"naxitoxD","date":"2016-12-14T18:56:47.033+0000","up_votes":2,"down_votes":3,"body":"man el problema es su movilidad uno no sabe cuando va a saltar encima tuyo y tirarte el skillshot de aturdir y para variar se da escudo {{sticker:zombie-brand-facepalm}}","replies":[{"poster":"Vanguard","date":"2016-12-14T19:09:04.722+0000","up_votes":1,"down_votes":0,"body":"Pues como vas a saber que te va a saltar? Pues facil, pensalo. Como se que un blitz me puede pegar el gancho, facil, me acuerdo que blitz tiene un gancho y que es importante estar atras de los minions.\n\nDenuevo, si te pego con la e, es porque estabas cerca de un muro, alejate, y no te va a poder stunear.","replies":[]}]}]},{"poster":"pajarit0","date":"2016-12-17T08:44:21.858+0000","up_votes":1,"down_votes":0,"body":"Esta rotisima camille da asco","replies":[]},{"poster":"alop55555","date":"2016-12-17T06:02:08.731+0000","up_votes":1,"down_votes":0,"body":"el estilo de camille es usar la pasiva en línea haciendo intercambios de daño cortos para aprovechar el escudo entrar golpear y salir. Entonces es vulnerable cuando tiene la pasiva deshabilitada y tienes que aprovechar muy bien ese tiempo o camille irá ganando ventaja en cada intercambio de daño hasta que controla la línea.\na todo esto se viene nerfeo XD","replies":[]},{"poster":"RedKi","date":"2016-12-14T20:33:22.348+0000","up_votes":1,"down_votes":0,"body":"Espero que esto sea una broma...{{sticker:zombie-brand-facepalm}}","replies":[]},{"poster":"xTm Joe Kelly","date":"2016-12-14T19:34:03.134+0000","up_votes":1,"down_votes":0,"body":"con jax le gano siempre ojala te sirva :)","replies":[]},{"poster":"KingOfApples","date":"2016-12-14T19:06:24.254+0000","up_votes":1,"down_votes":0,"body":"pickea Darius y listo, gg izi","replies":[]},{"poster":"MadafakaSurprise","date":"2016-12-14T18:16:29.188+0000","up_votes":1,"down_votes":0,"body":"si, esta rota, pero hay que saber jugar contra ella, le gané recién en top con rumble","replies":[]},{"poster":"Hwaxinghz","date":"2016-12-14T19:00:27.976+0000","up_votes":1,"down_votes":1,"body":"Un Stun y le cancelas el Ulti.","replies":[]},{"poster":"Vaendrys","date":"2016-12-14T18:14:22.871+0000","up_votes":1,"down_votes":1,"body":"Es ver un crypost sobre campeones, y ya saber que es tuyo.\nAun extraño los crypost de ESCURRIDISO :c","replies":[{"poster":"naxitoxD","date":"2016-12-14T18:16:07.471+0000","up_votes":2,"down_votes":2,"body":"que?","replies":[{"poster":"naxitoxD","date":"2016-12-14T18:16:44.074+0000","up_votes":2,"down_votes":2,"body":"quien es ESCURRIDISO ademas es Escurridizo gente ignorante no mas {{sticker:zombie-brand-facepalm}}","replies":[]}]}]}]}