{"poster":"Horzman","date":"2016-07-20T14:26:00.332+0000","title":"Was stimmt nicht mit dem MM?","subforum":"Champions & Gameplay","up_votes":2,"down_votes":8,"body":"Wie kann es sein, dass ich als S4 Spieler in letzter Zeit immer h&auml;ufiger gegen Gegner auf Gold/Platin Rang spielen muss w&auml;hrend mein Team weitestgehend aus Spielern auf meinem Niveau besteht? Schlie&szlig;lich sind solche Spiele sehr einseitig und machen niemandem Spa&szlig; (au&szlig;er nat&uuml;rlich den Gold/Platin Typen). Ich finde das so eine Differenz was die Spielst&auml;rke angeht nicht vorhanden sein sollte\r\nPS: Ich meine in normals nicht in rankeds","replies":[{"poster":"HHaie tabbian","date":"2016-07-20T14:31:11.205+0000","up_votes":7,"down_votes":0,"body":"Normal MMR ist etwas komplett anderes als Ranked MMR. Leute, die ein höheres Rating haben, spielen oft sehr wenig Normals und wenn, dann nur zum Spaß. Daher ist ihre Normal MMR oft relativ schlecht.","replies":[{"poster":"Pure Cynicism","date":"2016-07-20T17:15:08.535+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=tabbian,realm=EUW,application-id=Wj1wcocU,discussion-id=IAmXurTl,comment-id=0001,timestamp=2016-07-20T14:31:11.205+0000)\n>\n> Normal MMR ist etwas komplett anderes als Ranked MMR. Leute, die ein höheres Rating haben, spielen oft sehr wenig Normals und wenn, dann nur zum Spaß. Daher ist ihre Normal MMR oft relativ schlecht.\n\nMag ja alles sein. Ändert trotzdem nichts daran, dass es keinen Spaß macht, als Silberspieler einen neuen Champ testen zu wollen und dabei von einem Diamantspieler mit seinem Main gestompt zu werden. Das führt dann letztlich dazu, dass ich neue Champs im Ranked ausprobiere.","replies":[{"poster":"HHaie tabbian","date":"2016-07-20T20:03:16.622+0000","up_votes":2,"down_votes":1,"body":"Probier doch neue Champs auch im Ranked aus. Es macht meiner Meinung nach wesentlich mehr Sinn, Champions in der Umgebung zu lernen, in der man ihn auch spielen möchte.","replies":[{"poster":"Im a Papaya","date":"2016-07-21T02:02:32.654+0000","up_votes":1,"down_votes":0,"body":"\"Spieler mit ner höheren Elo Tryharden im ranked und entspannen sich im normal also mach das Gegenteil.\" Wäre diese Aussage überspitzt dargestellt. Niemand der aufsteigen will, und das will ich wenn ich ranked spiele, will einen Champ first time spielen eigentlich sind Normals genau für sowas da und da regt mich das Matchmaking auch auf denn das deine Aussage im Low Elo auch noch Sinn macht ist einfach unschön...","replies":[{"poster":"HHaie tabbian","date":"2016-07-21T07:07:37.582+0000","up_votes":2,"down_votes":0,"body":"Das ist nicht das, was ich gesagt hab/ausdrücken wollte. Meine Aussage war nicht auf low Elo bezogen. Ich habe grundsätzlich nichts dagegen, wenn Leute Champions im Ranked üben. Natürlich wäre es gut zu wissen, was die Spells machen und was für einen build man kaufen kann, aber man muss kein Experte für diesen Champion sein, um ihn im Ranked spielen zu dürfen. Wenn du in der Rangliste aufsteigen möchtest, spielst du ja, um dich zu verbessern. Und derartiges kann durchaus sehr hilfreich sein, auch wenn es in manchen Spielen nicht gut läuft. Wenn man aus seinen Fehlern lernen möchte, ist jedes Spiel ein Gewinn, besonders die verlorenen.\nEs macht zugegebener Weise wenig Sinn, in jedem Spiel einen neuen Champion auszuprobieren, sodass man in 120 Spielen 120 Champions gespielt hat. Aber wenn man seinen Championpool um einen bestimmten erweitern möchte, kann man den doch ruhig im Ranked einige Spiele testen.","replies":[]}]}]}]},{"poster":"Rengy Sama","date":"2016-07-20T14:38:18.085+0000","up_votes":1,"down_votes":0,"body":"Stimmt.","replies":[]}]},{"poster":"CYPHΕR","date":"2016-07-21T09:37:48.272+0000","up_votes":2,"down_votes":0,"body":"Nicht auf den TE direkt bezogen, aber auf das Thema im Allgemeinen:\n\nÜberall beschweren sich die Spieler, dass sie zu niedrig geranked sind, eigentlich mehrere Ligen weiter nach Oben gehören, aber immer vom Team zurückgehalten werden.\n\nGleichzeitig beschweren sich aber auch viele darüber, dass wenn sie in Normals mit Spielern aus genau solchen Ligen gematched werden es immer zu unfairen und einseitigen Matches führt, da man ja keine Chance hat und fordern Gegner in ihrem Elo-Bereich (also quasi eine Gleichsetzung der Normal- und Ranked-MMR).\n\nJa was denn nun Leute? Entscheidet euch :P\n\n{{sticker:slayer-jinx-wink}}","replies":[{"poster":"HHaie tabbian","date":"2016-07-21T09:42:32.555+0000","up_votes":1,"down_votes":0,"body":"Die guten Leute kommen doch immer in das gegnerische Team!","replies":[{"poster":"CYPHΕR","date":"2016-07-21T09:51:18.600+0000","up_votes":1,"down_votes":0,"body":"Stimmt, dann müsste man ja selber was für den Sieg tun anstatt sich nur gegen schlechte Gegner carrien zu lassen. Eindeutig ein Fehler im System!","replies":[{"poster":"HHaie tabbian","date":"2016-07-21T09:55:15.802+0000","up_votes":1,"down_votes":0,"body":"Man wird ja wohl kaum erwarten können, dass ich als Silber/Goldspieler mit 4 Bronze Spielern in meinem Team gegen fünf Dia+ Spieler carrien kann :p","replies":[]}]}]}]},{"poster":"wolf454","date":"2016-07-20T20:22:08.849+0000","up_votes":1,"down_votes":0,"body":"Vlt ist dein Niveau Gold Platin? ^^ \nBin mit meiner mmr auf Silber 3 aber habe auch häufig Gold Spieler in meinen/Gegner team^^\nJa es hat seinen Grund warum ich nur Silber 3 bin aber in der laningphase komme ich trotzdem sehr gut mit denen klat^^","replies":[]},{"poster":"oasterlukas","date":"2016-07-20T15:33:41.959+0000","up_votes":1,"down_votes":0,"body":"Sieh es doch mal positiv ich glaube jeder möchte sich verbessern. Ja es gibt Leute die sind fest überzeugt ihnen ist ihre Liga egal aber der Großteil möchte sich ja doch verbessern auch wenn es nicht jeder zugibt. Wie gesagt sieh es von der positiven Seite. Du hast eine \"Herausforderung\" hier und kannst dir eigetnlich selber beweisen, wie überdurchschnittlich gut du für deine Liga in einer bestimmten  Rolle bist. Außerdem wie erwähnt zwischen Normal und Ranked liegen oft bei der Spielweise Welten. Normal nimmt man mal nicht zu ernst probiert gefährlicheres aus. Ungeübte Champions zum Beispiel oder man spielt vielleicht sogar noch betrunken :D. Wer weiß. Also das nächste mal, wenn du wieder solche Gegner vor dir hast, glaub an dich und gewinne. Ich freu mich über jedes Spiel mit Gegnern von denen jeder von Anfang an glaubt man hat keine Chance.","replies":[]},{"poster":"Maexle","date":"2016-07-20T15:11:00.417+0000","up_votes":1,"down_votes":0,"body":"Mit dem Matchmaking ist alles in Ordnung. Mach dir keine Sorgen.\n{{champion:17}}","replies":[]},{"poster":"anikman","date":"2016-07-20T14:30:46.802+0000","up_votes":1,"down_votes":1,"body":"du spielst nur normals, die haben ein total anderes matchmaking. Spiele ich frühs um 8 bekomm ich gegner im bereich plat3 - dia 2 , ab nachmittags sind alle gold - platin weil dann einfach genug Leute für mein richtiges Matchmaking online sind.\n\nViele Leute aus dia spielen in normals nur schrott trollen rum etc, bedeutet sie haben zwar in rankeds ein dia matchmaking, in normals aber nur eins im Bereich Gold  und bekommen damit gold gegner. ","replies":[]}]}