{"poster":"Derpy Mike","date":"2015-01-30T01:03:50.448+0000","title":"Cut off the head....","subforum":"Gameplay","up_votes":86,"down_votes":12,"body":"And I'm sure the playerbase will find other champions to complain about. hehehehehe...\n\nBut seriously though I'm posting this because I want to propose a hypothetical experiment, and see what you guys think the outcome would be.\n\nUsing the numbers produced from the last week, starting today, every champion with a pick or ban rate higher than 15% will be disabled for the next 3 weeks and the other 80ish% of the champion pool will become free to play for the duration. All other aspects of the game remain unchanged, all that's happening is what's outlined in the title. We're cutting off the metaphorical head just to see how the rest of the body reacts.\n\nAttached is a file, a list of champions that would become and remain playable during the 3 weeks. Everyone not on the list is disabled.\n\nI would to love to hear your thoughts about how this experiment would play out. Do you think the list would remain unchanged for the 3 weeks? Would certain champions rise to, or fall from, power now that other champions are out of the picture? Would the game become more or less fun to play? Will Urgot unironically get picked in a match for once? Would you be interested to see this as a featured (or permanent) gamemode in the future? Should Riot fix Anivia's Q indicator already? Ha Ha. But seriously, care to share your thoughts, anyone?\n\n***EDIT: Added a list of the disabled champions as an attachment.***","replies":[{"poster":"IAmBestFurry","date":"2015-01-30T03:07:39.815+0000","up_votes":17,"down_votes":3,"body":"I hate that Graves is now considered really strong if not OP. I've been playing him for 2 seasons when everyone thought he was trash. Oh well...","replies":[{"poster":"Derpy Mike","date":"2015-01-30T03:15:54.478+0000","up_votes":50,"down_votes":0,"body":"Yeah. it's never any fun having your main become flavor of the month(s).","replies":[{"poster":"DynamiteGazelle","date":"2015-01-30T06:40:32.197+0000","up_votes":9,"down_votes":0,"body":"Yeah, sometimes they never recover :'( {{champion:28}} \n\n(although tbh she's not as bad off as everyone thinks)","replies":[{"poster":"Tentacle Love","date":"2015-01-31T01:09:33.832+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=DynamiteGazelle,realm=NA,application-id=3ErqAdtq,discussion-id=knkJYjE1,comment-id=000e00000001,timestamp=2015-01-30T06:40:32.197+0000)\n>\n> Yeah, sometimes they never recover :'( {{champion:28}} \n> \n> (although tbh she's not as bad off as everyone thinks)\n\nOh, no, she's really bad off.\nYou can just compensate for a LOT with skill.","replies":[]}]}]},{"poster":"kitcat300","date":"2015-01-30T04:25:54.747+0000","up_votes":8,"down_votes":0,"body":"Wasn't he perceived as one of the lower end adc's a few months ago? Now hes everywhere. I don't watch LCS but I'm guessing that's where it started.","replies":[{"poster":"Brenticus12","date":"2015-01-30T07:43:51.284+0000","up_votes":7,"down_votes":0,"body":"He was a tier 3 ADC cause champs like Corki, Lucian and Tristana either did what he could (Lucian) or did alot of things that were even better and were more reliable.\n\nNow that they're nerfed, Graves is back.","replies":[]},{"poster":"Tentacle Love","date":"2015-01-31T01:14:18.113+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=kitcat300,realm=NA,application-id=3ErqAdtq,discussion-id=knkJYjE1,comment-id=000e0001,timestamp=2015-01-30T04:25:54.747+0000)\n>\n> Wasn't he perceived as one of the lower end adc's a few months ago? Now hes everywhere. I don't watch LCS but I'm guessing that's where it started.\n\nActually I think his popularity in the LCS has more to do with the fact that he's tanky and doesn't pay any price for it. That passive is awesome.\n\nI see only two successful ADC's in those games I'm watching, and they are Graves and Sivir. Graves has his passive, Sivir has a spell shield. Graves is the clear favorite, Sivir is second choice. If Sivir doesn't work in the team comp, the team picks someone else like Jinx who is currently like 0-3. Graves is utterly dominating. Not quite as bad as Jarvan IV's 100% pick/ban rate, but dominating nonetheless.","replies":[]},{"poster":"Gorbache","date":"2015-01-30T19:24:42.311+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=kitcat300,realm=NA,application-id=3ErqAdtq,discussion-id=knkJYjE1,comment-id=000e0001,timestamp=2015-01-30T04:25:54.747+0000)\n>\n> Wasn't he perceived as one of the lower end adc's a few months ago? Now hes everywhere. I don't watch LCS but I'm guessing that's where it started.\n\nIn Korea he was always picked though and people do pick their pick based on that. So I think it's because Lucian and Trist got nerfed and he was next in line.","replies":[]}]},{"poster":"LeeDark","date":"2015-01-30T08:54:59.724+0000","up_votes":5,"down_votes":0,"body":"He was trash.  The changes to stats made characters overall weaker during levels 6 - 11, increasing the power of early game focused ADC's.  That, along with the Trist nerf, then the more recent changes to her, which hurt her very early strength, made Graves a better pick.  He was always a strong early game ADC with good burst that continued to be strong in the midgame.  Now, though, the early and midgame are longer, and he is the ONLY early game heavy ADC.  You'll notice that the other common pick is Corki, who is also strong in the midgame.  He has some power early, but not nearly as much as Graves, since he has prohibitive mana costs.","replies":[]}]},{"poster":"TheKingDodo","date":"2015-01-30T01:13:23.359+0000","up_votes":26,"down_votes":0,"body":"Was expecting \"Hail {{item:3074}}\" :(\ndisappointed.","replies":[{"poster":"Derpy Mike","date":"2015-01-30T01:25:24.755+0000","up_votes":4,"down_votes":0,"body":"Good to see my clickbait af title is functioning correctly.","replies":[]},{"poster":"The Grunzarvian","date":"2015-01-31T16:45:34.529+0000","up_votes":1,"down_votes":0,"body":"Heil {{item:3074}} !","replies":[]}]},{"poster":"Durzaka","date":"2015-01-30T01:15:56.064+0000","up_votes":1,"down_votes":23,"body":"Looks utterly pointless.\n\nThe only real changes that would take place would be slightly different support and jungle picks.\n\nThere are so many god like Mid laners and Top laners still on that least it doesnt matter.","replies":[{"poster":"Derpy Mike","date":"2015-01-30T01:32:36.534+0000","up_votes":11,"down_votes":0,"body":"Of course it's pointless. I was just creating some discussion.","replies":[{"poster":"Durzaka","date":"2015-01-30T01:33:49.798+0000","up_votes":1,"down_votes":23,"body":"> [{quoted}](name=Derpy Mike,realm=OCE,application-id=3ErqAdtq,discussion-id=knkJYjE1,comment-id=00030000,timestamp=2015-01-30T01:32:36.534+0000)\n>\n> Of course it's pointless. I was just creating some discussion.\n\nAnd im saying the discussion doesnt have any depth.\n\nNothing significant would change. The meta would be the exact same, and no one would notice anything.","replies":[{"poster":"Derpy Mike","date":"2015-01-30T01:35:52.215+0000","up_votes":20,"down_votes":0,"body":"Well I'm sorry you feel that way. Feel free to exclude yourself from the discussion and any point.","replies":[{"poster":"DatKiva","date":"2015-01-30T19:00:53.585+0000","up_votes":7,"down_votes":1,"body":"MY NAME IS DURZAKA AND I'VE COME TO TELL YOU ALL WHAT TO, AND WHAT NOT TO SPEAK ABOUT!","replies":[]}]}]}]}]},{"poster":"PoE00dpWDk","date":"2015-01-30T05:37:29.990+0000","up_votes":15,"down_votes":0,"body":"This would be amazing, I could actually play a game with champs I have not seen spammed to death. It does not matter how I feel about zed, fizz, or who ever is FOTM after a while I just ban them because I want some variety. I wish they did something like this in the LCS it would make each game more unique and actually notable.\n\nBEST GAME CHANGE 2015","replies":[]},{"poster":"Slaaneshine","date":"2015-01-30T01:08:59.181+0000","up_votes":13,"down_votes":0,"body":"Already I like the idea, since then we'll see new things being played beyond the meta champions. It would force a lot of people that just use meta-trains to get elo to think about picks again. Though around the same number of players would just shrug and play something else.\n\nAt the end of whatever may happen though, a new meta *would* emerge, not because persay the champions being chosen are overpowered yadda yadda, but because League has this fatal flaw where it supports a meta's existence in how the game is set up and played. Until Riot does something, and honestly I don't know what they even could even do at this point, metas will always exist out of what what players believe is \"necessity.\"  I've played this game since official release, and I haven't seen anything in six years that can, or could, refute that fact.","replies":[]},{"poster":"Aarekk","date":"2015-01-30T09:36:47.533+0000","up_votes":7,"down_votes":0,"body":"Janna's picked so often, she's on the ban list twice!","replies":[{"poster":"Derpy Mike","date":"2015-01-30T09:42:04.327+0000","up_votes":12,"down_votes":0,"body":"Fuck. I knew I'd screw something up.","replies":[]}]},{"poster":"2 much sauuuce","date":"2015-01-30T06:20:54.056+0000","up_votes":6,"down_votes":0,"body":"Sona not on list\n\nStill nerfed\n\n#RitoLogic","replies":[]},{"poster":"Nagirah","date":"2015-01-30T07:52:12.275+0000","up_votes":3,"down_votes":2,"body":"The game looks much more fun and balanced now... coincindence?","replies":[{"poster":"wolfax","date":"2015-01-30T15:00:45.218+0000","up_votes":5,"down_votes":0,"body":"No... It's not. All this does is create an environment where people will just figure out which in the bottom 85% are the best and have those be the second string whenever the top 15% are banned. It does *nothing* to solve the real issue. People will just start complaining about the second string after a few weeks.","replies":[]}]},{"poster":"Raptamei","date":"2015-01-30T10:22:04.622+0000","up_votes":1,"down_votes":0,"body":"That leaves very few viable supports.\n\nThe reason why so many supports have >15% pick rate is because there's only a handful of *supports* in the game. It's not surprising that when you have 11 supports, many of those will be picked by more than 1 in 13.33 teams.\n\nYou eliminate Thresh, Leona, Annie, Morgana, Janna and Blitzcrank and leave Braum, Nami, Taric, Sona and Soraka. Out of the remaining five, the only viable ones are the first two. Nami vs Braum every lane?","replies":[{"poster":"Derpy Mike","date":"2015-01-30T11:23:53.190+0000","up_votes":5,"down_votes":0,"body":"I'm pretty confident Supportilus Would step up and become the resident \"one hook will ruin your day\" champion of bot lane.\n{{champion:111}} *Fear the oceans weight*","replies":[]},{"poster":"DeusVult","date":"2015-01-30T23:44:22.978+0000","up_votes":3,"down_votes":0,"body":"{{champion:44}} Your argument is outrageous. Truly, truly, truly outrageous","replies":[]},{"poster":"JØJł","date":"2015-01-30T18:26:43.626+0000","up_votes":3,"down_votes":0,"body":"Don't forget queen lulu","replies":[]}]},{"poster":"Wullf","date":"2015-01-30T07:29:27.639+0000","up_votes":4,"down_votes":0,"body":"i would love to see this experiment.\n\nI like expriments\n\nexperrrriment","replies":[{"poster":"Derpy Mike","date":"2015-01-30T07:36:03.039+0000","up_votes":3,"down_votes":0,"body":"http://i.imgur.com/rIL182z.jpg","replies":[]}]},{"poster":"Embertine","date":"2015-01-30T01:18:57.260+0000","up_votes":1,"down_votes":0,"body":"Shyvana is still on the list, and she's my main, so I think I wouldn't be effected by this.","replies":[{"poster":"Derpy Mike","date":"2015-01-30T01:27:39.377+0000","up_votes":4,"down_votes":0,"body":"I was disappointed to find that most of my mains are gone. Though it could be fun trying something new without having to worry about getting shat on by thresh-sin the 4th.","replies":[]}]},{"poster":"MattZeeX","date":"2015-01-30T01:14:15.411+0000","up_votes":3,"down_votes":0,"body":"Meh, I think tons of champs that aren't played a lot are super fucking op already. I don't ban them in ranked though because the probability of them being picked are quite low. I'd rather play versus the champs with a higher win rate than a lot of the other champs that are super toxic IMHO. But it'd be cool to see who gets banned instead of literally just fucking Zed, Akali, Katarina, Blitzcrank, Fizz, Rek'Sai. Literally, every goddamn game, only like Rek'Sai is truly op IMHO, pisses me off for the wasted bans and then someone I personally feel is so fucking op and makes me want to kill myself and rip my hair out in frustration is picked, such as Heimerdinger. God I hate him in every way, EVERY FUCKING WAY.","replies":[]},{"poster":"wolfax","date":"2015-01-30T14:58:05.224+0000","up_votes":2,"down_votes":0,"body":"Honestly this would do jack squat. Wouldn't take players long to realize what the best new picks are. Then you just end up with the normal top 15% constantly banned followed by the next 15% to take over whenever the real top group is disabled.","replies":[]},{"poster":"Pvt Yong Tai","date":"2015-01-30T08:28:26.002+0000","up_votes":2,"down_votes":0,"body":"Annie is part of the head? Really? Well I'll be.  \n\n(no really can someone explain to me why Annie is on that list? I main Annie and I still don't understand why she deserves to be there)","replies":[{"poster":"jv21blU7oD","date":"2015-01-30T12:05:27.305+0000","up_votes":2,"down_votes":0,"body":"Because a lot of western teams value initiation and teamfighting now and Annie fits well into that with her game deciding Flash+Tibbers combo.","replies":[{"poster":"Kobila2000","date":"2015-01-30T23:46:29.998+0000","up_votes":1,"down_votes":0,"body":"Western teams? As opposed to...?","replies":[{"poster":"Tiure","date":"2015-01-31T02:16:48.449+0000","up_votes":1,"down_votes":0,"body":"Korean teams :P","replies":[{"poster":"Kobila2000","date":"2015-01-31T03:54:44.069+0000","up_votes":1,"down_votes":0,"body":"I'm also asking what strategy they're using. Because good initiation and teamfighting seem like a general good thing to focus on.","replies":[{"poster":"Tiure","date":"2015-01-31T09:14:02.432+0000","up_votes":1,"down_votes":0,"body":"Team composition can vary depending on the strategy. Teams that value hard initiation comps (WOMBO COMBO STYLE) pick champs like Wukong or Shyvana....who have no siege potential and little sustain outside of major teamfights. A well-executed siege or poke comp will destroy them.\n\nYes it's important to be good at things, but you have to remember that there are a lot of champions, all with different strengths, and you can prioritize a lot of great things when building a team.","replies":[]}]}]}]}]}]},{"poster":"Shadow Gilgamesh","date":"2015-01-30T05:52:18.180+0000","up_votes":2,"down_votes":0,"body":"10/10 would play more than actual league.","replies":[]},{"poster":"aperson1","date":"2015-01-30T05:44:15.386+0000","up_votes":2,"down_votes":0,"body":"I would jizz my pants, if nothing else.","replies":[]},{"poster":"lDontLiftIcarry","date":"2015-01-30T04:53:41.839+0000","up_votes":2,"down_votes":0,"body":"so because I like ap janna mid/top im punished?","replies":[]},{"poster":"Altricad","date":"2015-01-30T04:39:03.880+0000","up_votes":3,"down_votes":2,"body":"This would hardly cripple me. I could still play every role with my fav champ\n\nSupport- {{champion:201}} {{champion:16}} \nJg - {{champion:11}} {{champion:5}} \nTop- {{champion:50}} {{champion:122}} \nADC - {{champion:22}} {{champion:110}} \nMid - {{champion:157}} {{champion:34}} \n\nThen again, this is why I'm still silver when i could abuse freelo champs and get to gold ( ex: {{champion:59}}  and {{champion:254}}  for jg)","replies":[]},{"poster":"Knight Devout","date":"2015-01-30T15:40:01.149+0000","up_votes":2,"down_votes":1,"body":"you know, this could be a great permanent game mode.\nUnderdog arena.\nMain champion in pick&ban each week are disabled for three weeks.\nAfter three weeks they are available again for a week, after which they can be disabled again if they are still top .\nOn the other hand, picking the least played or banned champion will grant you bonus IP.","replies":[]},{"poster":"Sluiceway","date":"2015-01-30T18:30:20.664+0000","up_votes":1,"down_votes":0,"body":"Personally, as far as the LCS goes, at least, I don't believe the meta is anything more than teams who lack the courage or the independent thinking to prove that all the champs are viable with sufficient preparation.","replies":[{"poster":"junglerboy16","date":"2015-01-31T00:27:24.095+0000","up_votes":1,"down_votes":0,"body":"I don't think it is a question of courage or independence, it is a question of reliability. Pro players aren't playing League for fun, it is quite literally their job that earns them money. They play what is most guaranteed to get them the highest chance of winning money, just like any pro sports team hires only the best players so that they win most. Only once you get outside of the pro scene does balance really become an issue, because then having people play for fun isn't necessarily about who has the best chance of winning, but who is the most fun to play as.","replies":[{"poster":"Sluiceway","date":"2015-01-31T18:32:27.582+0000","up_votes":1,"down_votes":0,"body":"I understand the reliability issue, which is why pro teams have coaches, analysts, and other support staff to find ways to make comps, and with the recent trend toward Lissandra, Cassiopeia, and Rumble top leaves the team without a dedicated tank, and I don't buy that with all their game knowledge teams can't think of a way to work a Nautilus or Volibear jungle, for example, into the team. it is not even like pure tank is unheard of, with Elise and Nunu being built full tank when they are played. That leaves me with the conclusion, then, that teams don't put in the work to make any of the non-meta picks viable, not that there is any flaw with the picks themselves.\n\nYou do have a point about my use of courage and independence, though, as I think the best word to describe them is complacent.","replies":[]}]}]},{"poster":"Juggernaut628","date":"2015-01-31T18:01:44.577+0000","up_votes":1,"down_votes":0,"body":"Once again, nobody is understanding the point of this. The point is for you to try new champs, not to complain that yours would be banned or to Get Excited! that your champs are still there to play. After all, this is useless if you just play the same champs that you used to prior and you wouldn't have to deal with any opposing high burst.","replies":[]},{"poster":"KidKaiser","date":"2015-01-31T15:01:44.899+0000","up_votes":1,"down_votes":0,"body":"that'll bring Talon and Yasuo back to mid. cuz taking out Zed means they don't need to worry about ANYTHING in the game that can 100-0 your squishies in 2secs, while they're busy positioning for the optimum engage.\n\nAlistar becomes the most threat top lane. along with Jayce. top or mid.\n\nNami will see more surface as a support. along with Lulu and Sona cuz tanky supports are eliminated from your suggested head.\n\nwhile the jungle will be dominated by Volibear/Nunu/Hec.\n\nand Marks(wo)men will be dominated with lucian corki graves twitch and kogmaw.\n\ndifferent rotations of champions being played. would be great to watch, but after a few games or so it becomes what it is now. WHY SO MUCH TALON AND YASUO! OMG ALI+YASUO OP.\n\nTHAT NAMI HEAL! SONA CRESCENDOOOOOOOOOOOOOOOOOOOOOOOO FTFW !\n\nPENTAAAKILLLLLL KOGMAWWWWWWWWWWWWW! \"commentators\": and that folks. is why u dont leave kogmaw unchecked in a teamfight !","replies":[]}]}