{"poster":"Rocofu","date":"2015-12-11T02:43:49.797+0000","title":"Mantenimiento programado - Viernes 11 @ 1am CHI/ARG","subforum":"Charlas Generales","up_votes":6,"down_votes":0,"body":"&iexcl;Hola, amigos!\n\nUn proveedor de backbone estar&aacute; haciendo cambios en unos equipos de red. Al inicio y al final del mantenimiento se espera que haya breves desconexiones y alta latencia en lo que se hace el cambio de equipo y conexi&oacute;n.\n\nSe espera que la ventana combinada dure alrededor de 4hrs.\n\nLas actividades iniciar&aacute;n a la 1am CHI/ARG.\n\nEste cambio se est&aacute; realizando en Argentina por lo que los jugadores afectados ser&aacute;n aquellos de Argentina y Uruguay en su mayor&iacute;a.\n\n---\nEdit: Confirmado, el mantenimiento concluyó hace unos minutos.","replies":[{"poster":"ARBALES7","date":"2015-12-11T03:31:44.475+0000","up_votes":1,"down_votes":0,"body":"Se activara derrota evitada o nos comemos bann? {{champion:432}} {{summoner:21}} {{summoner:11}}","replies":[{"poster":"Rocofu","date":"2015-12-11T03:53:29.690+0000","up_votes":1,"down_votes":0,"body":"Cuando tenemos un mantenimiento programado como este apagamos las colas clasificatorias cierto tiempo antes para que se drenen todas las partidas clasificatorias y evitar que los jugadores se vean afectados. Pero si una partida dura mucho más de lo \"estándar\", es posible que se vea afectada.\n\nPuedes ver que las partidas clasificatorias están desactivadas.","replies":[{"poster":"SnowyMagician","date":"2015-12-11T04:24:42.816+0000","up_votes":1,"down_votes":0,"body":"Cuando tenga lag vienes al cliente a contarme un chiste? :c","replies":[{"poster":"Rocofu","date":"2015-12-11T05:05:59.436+0000","up_votes":7,"down_votes":1,"body":"Te lo cuento aquí. \n\nLlegó el circo al pueblo con la nueva atracción espectacular: \"El pan que habla\"\nEn pocas horas se venden todos los boletos para las presentaciones de 2 semanas. (Como una final de LoL)\nLlega la noche, el público emocionado y ansioso por ver tan increíble espectáculo. Con alegría observan pasar a los elefantes, a la tropa de payasos hacer sus malabares y chistes, a los trapecistas brincar de un trapecio a otro como ángeles. Uno tras otro pasan los actos de circo.\nDe manera abrupta, se apagan todas las luces. Se hace un silencio espectral entre el público mientras uno que otro espectador deja escapar un chillido excitado. Ahí, en medio de la pista se enciende una sola luz. La luz baña a un hombre vestido de traje rojo con botones de latón. ¿Qué es lo que sostiene? Una almohadilla roja carmesí cubierta con un paño de oro y en el centro una barra de pan!\n\n\"ohhh!!!\" \"uuuhh!!\" \"el pan que habla\" se susurran uno a otro los asistentes.\n\nUn chiquillo entra corriendo y se para al lado del presentador con algo en manos. El presentador toma la barra de pan, la alza como si fuese Link alzando la trifuerza. Toma el pan con una mano, y con un movimiento sutil pero ágil inserta la barra de pan en el vaso que trae el chiquillo. El vaso contiene agua. \n\nTras unos segundos, el presentador retira rápidamente la barra de pan y la levanta triunfalmente apuntando a la luna.\nEl presentador grita triunfalmente:  \"¡El pan! ... ¡El pan está blando!\"","replies":[{"poster":"Sondorax","date":"2015-12-11T19:46:11.724+0000","up_votes":1,"down_votes":0,"body":"10+ y favoritos","replies":[]},{"poster":"SnowyMagician","date":"2015-12-11T05:37:46.793+0000","up_votes":1,"down_votes":0,"body":"Muy bueno Rocofu gracias por ponerle esfuerzo en la redacción .Saludos\n\nPD:Si lees mi comentario,volve al cliente que me olvide de decirte algo.","replies":[]},{"poster":"ParliaMént","date":"2015-12-11T05:32:15.991+0000","up_votes":1,"down_votes":0,"body":"ajjaja XD {{sticker:slayer-pantheon-thumbs}}","replies":[]}]}]}]}]},{"poster":"J7ycjHAfiL","date":"2015-12-11T04:14:33.627+0000","up_votes":1,"down_votes":0,"body":"Esto afecta a Arnet?, tan misteriosamente como la nismeada me saltan 155 de ping aceves.\n\n\nhoy es hoy, ayer fue hoy ayer {{champion:1}}","replies":[{"poster":"Rocofu","date":"2015-12-11T04:48:52.812+0000","up_votes":3,"down_votes":0,"body":"No, esto no esta relacionado con Arnet o con algún proveedor particular. \n\nEstamos tratando de ver con Arnet directamente porque la latencia alta parece generarse dentro de su red antes de salir a la línea de Telefónica que es por donde lo recibimos.\n\n\nsi mañana es pasado y el futuro es hoy, el ayer desayuné cereal?","replies":[{"poster":"Hwaxinghz","date":"2015-12-11T15:28:06.843+0000","up_votes":1,"down_votes":0,"body":"Ya envié el Análisis de Redes, allí pueden ver que hay un solo enlace que aumenta considerablemente el ping cuando llega a Movistar. Luego tiré ping a IFX networks (la red que tenían anterior ustedes en Riot LAS) y me tira 40 ms (con arnet), por lo que calculo que es un problema de un enlace de inicio en Movistar y Arnet desde la frontera (eso es lo que pienso al analizar las IP y su procedencia con un programa), luego de ese enlace el Ping no baja de 90, pero dentro del país es de 30.\n\nTal vez eso ayude. Saludos :)","replies":[{"poster":"ARBALES7","date":"2015-12-12T05:43:53.119+0000","up_votes":1,"down_votes":0,"body":"{{champion:432}}  No profe no me la sé....","replies":[{"poster":"Hwaxinghz","date":"2015-12-12T17:08:40.588+0000","up_votes":1,"down_votes":0,"body":"Bueno, verás que hay errores de red con Arnet y al parecer hace medio año que no los reparan (no son problemas de Riot pero si internacionales), solo eso tienes que entender.","replies":[]}]}]}]}]},{"poster":"Áve Crimini","date":"2015-12-11T02:52:14.883+0000","up_votes":1,"down_votes":1,"body":"Y que hay con Chile","replies":[{"poster":"ALEXKOND","date":"2015-12-11T03:19:21.520+0000","up_votes":3,"down_votes":0,"body":"Chile no debería de tener ninguna modificación en la latencia ya que el mantenimiento es para Argentina (y por consiguiente Uruguay).","replies":[]}]},{"poster":"Landidzu","date":"2015-12-11T02:57:06.023+0000","up_votes":2,"down_votes":0,"body":"Bieeeen, al fin ponen manos a la obra con el lag. Ojala lo arreglen.","replies":[{"poster":"Chockad","date":"2015-12-11T02:59:41.960+0000","up_votes":2,"down_votes":3,"body":"Que te pasa con el lag? #LargaVidaAlLag","replies":[{"poster":"Hwaxinghz","date":"2015-12-11T15:45:37.750+0000","up_votes":3,"down_votes":0,"body":"http://statics.vrutal.com/m/da08/da08a103aa3d81d8832c98a1bc2bdb15.jpg\n\n(?)","replies":[{"poster":"ARBALES7","date":"2015-12-12T05:44:42.854+0000","up_votes":1,"down_votes":0,"body":"jajaja me sentí identificado xD","replies":[{"poster":"Hwaxinghz","date":"2015-12-12T17:07:26.904+0000","up_votes":1,"down_votes":0,"body":"No tienes idea de lo identificado que me sentí cuando vi esa imágen xD por eso la postié","replies":[]}]}]}]}]},{"poster":"Accelerator","date":"2015-12-11T03:09:18.987+0000","up_votes":1,"down_votes":0,"body":"mmm Viernes es 11 :V","replies":[{"poster":"Accelerator","date":"2015-12-11T03:28:03.916+0000","up_votes":1,"down_votes":0,"body":"lo corregiste a mi no me engañás Rocofu! y mi porogalleta?","replies":[{"poster":"Rocofu","date":"2015-12-11T03:48:12.135+0000","up_votes":2,"down_votes":0,"body":"whaaaaat?? no se de que hablas :P {{item:2054}}","replies":[]}]}]},{"poster":"Chockad","date":"2015-12-11T02:50:29.702+0000","up_votes":1,"down_votes":0,"body":"Rito ya me arruino la noche de parranda lolera :v","replies":[{"poster":"Hwaxinghz","date":"2015-12-11T15:47:11.361+0000","up_votes":1,"down_votes":0,"body":"El otro dia se me cortó la luz justo cuando empezamos la parranda lolera, luego se cortó el internet (cuando volvió la luz), tuvimos que irnos a dormir y a las 7 AM volvió todo e hicimos la parranda atrasada desde las 7 AM hasta las 12 de la noche... (?)","replies":[]},{"poster":"agnistar","date":"2015-12-11T05:31:50.795+0000","up_votes":1,"down_votes":0,"body":"posta jaja","replies":[]}]},{"poster":"GodsyIas","date":"2015-12-11T09:28:06.649+0000","up_votes":1,"down_votes":0,"body":"& las ranked wn ya pasaron 4 horas i want to play ranked, right now!{{summoner:14}}","replies":[]},{"poster":"Yoorch","date":"2015-12-11T05:48:36.547+0000","up_votes":1,"down_votes":0,"body":"Acabo de volver de laburar (sali temprano) , Re mil contento porque podia rankear a ver si hoy estaba con suerte y me tocaban esos teams piolas asi podia seguir en mi largo y estrecho camino a diamante... y me salen con esto :(  Quiero que vuelvaaaa!!{{summoner:4}}","replies":[]},{"poster":"King of Kings","date":"2015-12-11T04:46:42.168+0000","up_votes":1,"down_votes":0,"body":"Puede ser que por eso no se me quede en 33% es la primera vez que me pasa","replies":[{"poster":"Rocofu","date":"2015-12-11T05:07:56.156+0000","up_votes":1,"down_votes":0,"body":"Nop, no está relacionado a cuestiones de actualización. Si tienes problemas para actualizar, sugiero que revises este post. http://boards.las.leagueoflegends.com/es/c/ayuda-y-soporte/MfreBzlg-problemas-para-actualizar-","replies":[]}]}]}