{"poster":"Rocofu","date":"2015-02-07T20:47:11.861+0000","title":"Reparado!! Doble corte de fibra en el enlace ARG/CHI - Feb 7","subforum":"Problemas Técnicos","up_votes":10,"down_votes":5,"body":"EDIT 7:30pm ARG/CHI\nNos informan que ya se ha reparado uno de los enlaces y ya se encuentra operativo.\n\nEDIT 10:30pm ARG/CHI\nNos confirman que se ha reparado el segundo enlace dañado y ya se encuentra operativo cargando tráfico. Por nuestro lado vemos tráfico cursando por los enlaces de manera estable.\n\n--------------\nHola a todos,\n\nNos confirma nuestro proveedor de un doble corte de fibra en los enlaces de Argentina-Chile. En este momento tenemos todo el tráfico conmutado y circulando a través de otro enlace de Argentina-Chile que se presenta en buenas condiciones (Tenemos 3). \nNuestro proveedor nos informa que aún no hay un tiempo estimado para que se lleven a cabo las reparaciones. Les estaremos informando sobre este evento.\n\n(Si eres de **Antel** y estás observando alta latencia, esta no es causada por los cortes de fibra. En este otro [post](http://boards.las.leagueoflegends.com/es/c/ayuda-y-soporte/s3KA6OrQ-problema-de-latencia-en-uruguay) hemos dado más información al respecto)\n\nSi están experimentando pérdida de paquetes, porfavor envíennos sus datos utilizando la [Herramienta de Análisis de Redes](http://las.leagueoflegends.com/es/registros-de-red) para investigar si hay algún otro punto que lo esté generando.\n\nNos informan también que debido a que este enlace carga tráfico para muchas empresas (no sólo RIot) y la magnitud del daño, otros proveedores de internet y empresas en Argentina están sufriendo por los cortes.\n\n-------------\nPara contarles un poco más. El día de hoy (Febrero 7) contamos con 3 enlaces físicos que llevan el tráfico de Argentina a Chile. Hace 2--3 horas approx hubo un corte en uno de los principales. En lo que se conmutaba el tráfico al secundario, se pueden generar algunas disrupciones. Esto explica los incrementos de lag y pérdida de paquetes que experimentaron algunos jugadores Argentinos. Hace poco hubo otro corte en el enlace secundario. Al igual que antes, en lo que se conmuta el tráfico al principal restante, hay algunas disrupciones. \nCada conmutación es cuestión de segundos pero en esos segundos se pueden perder suficientes paquetes que generan ese lag-delay en el juego.\n\nEn estos momentos todo está circulando en el enlace primario que se muestra de buena salud.  Este enlace lo agregamos hace mes y medio para precisamente mitigar este tipo de problemas y tener mayores opciones antes de que se vea un efecto mayor para un gran nivel de la base de jugadores. Por ejemplo, si no lo tuviéramos, este enlace, lo más seguro es que muchos jugadores que se conectan a través de este enlace observarían altas latencias ya que el tráfico se enrutaría automáticamente a través del enlace internacional lo que significa que iría hasta Miami y de vuelta.","replies":[{"poster":"soy un puma","date":"2015-02-07T21:06:21.482+0000","up_votes":15,"down_votes":0,"body":"me estaba poniendo como loco pensando que era mi internet, bueno mala suerte, iré a conocer ese tal sol del que todos hablan","replies":[{"poster":"Lol4Lol","date":"2015-02-07T21:12:35.665+0000","up_votes":4,"down_votes":0,"body":"que es eso? donde esta? se come?","replies":[{"poster":"HalowNoctem","date":"2015-02-07T21:36:51.841+0000","up_votes":2,"down_votes":0,"body":"No se que sea eso o donde estará, pero si se come, es bienvenido... {{champion:31}}","replies":[]}]}]},{"poster":"Skyllnex","date":"2015-02-07T22:20:09.751+0000","up_votes":1,"down_votes":0,"body":"Unas preguntas Rocufu: ¿Es posible que esto lo reparen en el día? ¿o tendremos que esperar de 2 a 7 días a una solucion?\n\nY otra que me pregunto aun más ¿ Por que se cortan fibras a cada rato? Prácticamente se cortan una vez al mes, mientras que la conexion a Miami no se corta nunca :S","replies":[{"poster":"Rocofu","date":"2015-02-07T22:36:23.326+0000","up_votes":3,"down_votes":1,"body":"Aún no tenemos un horario estimado pero un corte de fibra es algo serio en un transporte de internet por lo que buscan arreglarlo rápidamente.\n\nExisten muchas razones por las cuáles podría haber cortes, desde daño por animales (suena ridículo, pero ha sucedido que roedores provocan daños) hasta daño por excavaciones, desastres naturales, etc.\nUno de los cortes sucedidos el día de hoy fue debido a un incendio forestal. Esto mismo también dificulta su reparación.\n\nEn todos lados hay cortes de fibra. A Miami, normalemente el tráfico cursaría por un cable submarino. Debido a que hay menos \"movimiento\" cerca de un cable submarino, podría ser menos frecuente su daño. De igual manera, hay cables reduntantes. Aunque ha sucedido que tiburones muerden los cables submarinos o que anclas de barcos arrastran y dañan los cables. Además, los datos del juego al conectarse al servidor de Miami no son afectados por latencia y-o pérdida de paquetes como lo sufren los datos al conectarse al servidor de Chile. Podría ser que hay cortes de fibra y no lo notarías.\n\nNosotros tenemos cables redundantes entre Argentina-Chile, si. Y es a través de este que se está llevando el tráfico del juego.","replies":[{"poster":"Urthemiel","date":"2015-02-07T22:48:10.657+0000","up_votes":4,"down_votes":0,"body":"Desde ayer a las aproximadamente 20:00 horas de Uruguay hasta el día de hoy se siguen dando miles de casos de gente con desconexión, problemas de ping, paquetes perdidos, etc. Mucha gente no entra al foro a informarse o cuando entra lo hace demasiado tarde y ha perdido puntos de liga injustamente por motivos que no son relacionados con el juego y responden a los problemas de conectividad mencionados. \n\nYa sea la rotura del switch de Antel y CABASE o el cable de fibra que se rompió o un Teemo haciendo interferencia, lo que sea que esté pasando. en todos los post la gente se está haciendo la pregunta: \"¿Porqué no habilitan derrota evitada?\" \"¿Que van a hacer para compensar a la gente que perdió puntos de liga por esto?\"\n\nHasta hora NADIE de Riot ha respondido esto. Han explicado el lag, los cortes, pero NINGUNO ha aparecido a explicar porqué no se habilita derrota evitada o como van a compensar a los afectados.\n\nAsí que, nuevamente, por si no lo han leído, explíquenle a la gente porqué no están habilitando derrota evitada en días como hoy cuando en realidad lo han activado por cosas mucho menos que esto.","replies":[{"poster":"Rocofu","date":"2015-02-07T22:58:29.253+0000","up_votes":2,"down_votes":2,"body":"Como lo hemos explicado antes, Derrota Evitada no se activa ante cualquier problema. Es un sistema que se activa sólo ante un nivel de afectación mucho mayor debido a que se activa para todo el servidor (Todos los jugadores jugando) y no sólo a grupos de jugadores.\nDerrota Evitada no significa tampoco que la partida se elimina. Si fue derrota sigue siendo derrota y si fue victoria seguirá siendo victoria y la partida se sigue contando como jugada. Lo que hace el sistema es no quitar puntos si fue derrota y dar sólo la mitad de puntos si fue Victoria.\n\nPor otro lado, no se pueden modificar manualmente los resultados de las partidas ni los puntos de clasificatorias.","replies":[{"poster":"Urthemiel","date":"2015-02-07T23:23:54.965+0000","up_votes":6,"down_votes":0,"body":"Entiendo lo que es derrota evitada: no perder puntos y ganar la mitad. Algo que me parece más justo que \"perdé 20 porque el juego te echó a vos y a dos más de tu team, mientras los cinco de enfrente lograron mantenerse conectados\". Creo que es más justo ¿o no?\n\nPor otro lado, ¿hay gente en el servidor que no tenga problemas? Porque parecía ser que era solo en Uruguay pero veo muchos argentinos quejándose y también chilenos. ¿Dónde está funcionando bien, en Guyana Francesa? No veo a nadie en mi lista de amigos que no se esté quejando. Y amigos de mis amigos están en la misma. Sumado a la gente del foro.....¿a quién le anda bien?\n\nFinalmente, ¿porque no hay un aviso en el cliente? \"Se están experimentando problemas con la conectividad de la partida, si juega clasificatorias hágalo por su propio riesgo y cuenta\". No hubo ni hay ningún aviso y más y más gente sigue cayendo en esto. Entrar al foro no es obligatorio, ¿porqué desde ayer no se informó esto en el cliente mediante un aviso?\n\nY que quede claro: no estoy juzgando el problema de la conectividad. Obviamente Riot no puede ir y arreglar el switch de CABASE, el cable de no se donde, etc, etc. Que vuelva a funcionar cuando tenga que volver lo cuál dudo que sea antes del lunes, no me imagino a nadie ir a poner un switch ni a Antel ni a CABASE un fin de semana. Lo que juzgo es la actuación en los otros aspectos, la falta de aviso, la falta de responsabilidad y la injusticia que están padeciendo muchos y muchos jugadores de LAS.","replies":[{"poster":"Kalkopirita","date":"2015-02-07T23:32:21.734+0000","up_votes":2,"down_votes":2,"body":"Acá en Chile la mayoría de la gente juega sin problemas, incluyéndome. Una lástima esto del daño en los cables de fibra óptica. Pero bueno, los servers andan bien la mayoría del tiempo y nadie dice nada, se caen y todo el mundo empieza a alegar y pedir RP. Falta cultura que la gente se meta a los foros para saber si hay algún problema con el servidor y falta que Riot ponga avisos de que pueda existir alta latencia por el problema que sea.","replies":[{"poster":"Urthemiel","date":"2015-02-07T23:37:35.922+0000","up_votes":3,"down_votes":1,"body":"Yo en lo personal no pido RP, de hecho he comprado varias veces, algo que en ocasiones como esta lamento profundamente y obviamente no volveré a hacer. Lo que pido y creo justo es \"Derrota Evitada\" y devolución de los LP perdidos. \n\nMe alegro que en Chile te funcione bien, una pena que Argentina y Uruguay sobre todo no puedan decir lo mismo.\n\nTotalmente de acuerdo con la parte de que Riot debería poner avisos.","replies":[{"poster":"Kalkopirita","date":"2015-02-07T23:41:52.398+0000","up_votes":3,"down_votes":0,"body":"En ningún momento pensé en criticar tu comentario de antes, perdón si te sentiste aludido :(\nSolo lo decía porque me metí al foro y lo único que veo es gente alegando porque las conexiones andan mal y piden algún tipo de compensación.\n\nEstoy muy de acuerdo contigo con que deberían activar derrota perdonada, entre Argentina y Uruguay deben hacer más de la mitad del server. A mi juicio, razón suficiente para activar este sistema. \nPero bueno, Riot supongo que sabe lo que hace y habrá que confiar en ellos.","replies":[{"poster":"Urthemiel","date":"2015-02-07T23:55:24.970+0000","up_votes":1,"down_votes":0,"body":"Para nada, no me pareció una crítica, todo lo contrario. Es un espacio libre y me parece válida tu opinión. Es más, me alegro que alguien que no sufre problemas de lag esté de acuerdo en lo de la derrota evitada.\n\nY si, entiendo que obviamente Argentina y Chile tienen un número muy grande de jugadores por un tema de población pero acá en Uruguay esto crece cada vez más y estaría bueno que también le den importancia a lo que pasa acá.\n\nSi sonó a que me molesté contigo, las disculpas del caso, ni ahi me enojé ni nada por el estilo. Saludos desde Uruguay y suerte en esas partidas!","replies":[{"poster":"HalowNoctem","date":"2015-02-08T00:11:01.136+0000","up_votes":3,"down_votes":0,"body":"Cuanto cariño y amor... algo de lo que le falta un poco a este foro.\nLo de uruguay ya esta reportado, mismo rocofu se está haciendo cargo en otro hilo. Esperemos que se solucione pronto, mientas tanto los problemas con Arg, poco a poco se van solucionando, por el momento ya no hay lag. Esperemos que activen el 2do enlace asé en los horario pico, estar seguros de que no se sature la conexión.","replies":[{"poster":"Urthemiel","date":"2015-02-08T00:23:10.361+0000","up_votes":1,"down_votes":0,"body":"Si, pasa que lo que me molesta a mi son los 21 puntos que me perdí ayer y no solo yo, mucha más gente perdió una buena cantidad de puntos. Estaba a una de entrar a promoción ahora a remarla y tratar de tener suerte para ganar dos o tres seguidas. Si hubieran puesto un aviso o derrota evitada esto no pasaba.","replies":[{"poster":"HalowNoctem","date":"2015-02-08T00:42:26.011+0000","up_votes":1,"down_votes":0,"body":"El 20% de los jugadore solo lee los avisos, no te creas que es tan asi tampoco, pero como dijo rocofu, no se puede editar...","replies":[]}]}]}]}]}]},{"poster":"Technø","date":"2015-02-08T01:11:05.281+0000","up_votes":1,"down_votes":0,"body":"Claro por que a vos te anda bien  no alegas nada pero si te andara mal a vos y a argentina bien estarias llorando en las puertas de riot aprovacha rankea capas  subis de liga","replies":[{"poster":"Kalkopirita","date":"2015-02-08T04:23:22.074+0000","up_votes":1,"down_votes":0,"body":"¿Por qué la mala onda? Yo solo estaba dando mi punto de vista. \n\nCuando ha habido problemas de internet, no he jugado lol y hago otras cosas en vez de amargarme por un problema que generalmente se ha solucionado rápido. Con alegar poco y nada se obtiene, sobre todo como, en este caso, la situación está fuera de las manos de Riot.\n\nSaludos :)","replies":[]}]}]}]},{"poster":"Tango Brujo","date":"2015-02-08T00:17:16.305+0000","up_votes":3,"down_votes":0,"body":"La cuestión es, si no podes poner derrota evitada, si no podes detectar el problema a tiempo, si no pensas devolver puntos de clasificatoria y mucho menos hacerte cargo de cualquier problema dentro de las partidas. Si todo eso es demasiado complicado. Poner un aviso en el lobby, es mas complicado que alguno de esos items? Tanto cuesta?","replies":[{"poster":"Urthemiel","date":"2015-02-08T00:27:02.391+0000","up_votes":1,"down_votes":0,"body":"Totalmente de acuerdo contigo!","replies":[]}]}]}]},{"poster":"Skyllnex","date":"2015-02-08T00:30:33.104+0000","up_votes":1,"down_votes":0,"body":"Gracias por responder Rocufu, ojala esto se resuelva pronto, es practicamente injugable :C\n\n\n\n... Rito me respondiooo, me siento bendecido  xD","replies":[]},{"poster":"HalowNoctem","date":"2015-02-07T23:12:21.760+0000","up_votes":1,"down_votes":0,"body":"Efectivamente, ya está funcionando mucho mejor!!! WD","replies":[]}]}]},{"poster":"Demons","date":"2015-02-07T21:21:19.535+0000","up_votes":6,"down_votes":0,"body":"Podrían poner un aviso en el lobby del juego? No todos entran al foro y encuentran este post antes de entrar a jugar, muchas gracias.","replies":[]},{"poster":"Skill Link","date":"2015-02-07T22:13:04.241+0000","up_votes":2,"down_votes":3,"body":"creo que yo tambien diría algo asi cuando hago algo mal en mi trabajo culpar a otra cosa pero siendo realista cuantas veces ya usaron esa excusa de que se les corto un cable o un enlace si alguien se pone a juntar los post seguro suman de 100 o quizas mas, lo siento yo no me creo eso","replies":[{"poster":"RengarTheHunter","date":"2015-02-07T22:37:27.440+0000","up_votes":3,"down_votes":0,"body":"yo trabaje 4 años en una empresa de internet y los cortes de fibra son mas comunes de lo que puedas esperar.","replies":[]}]},{"poster":"AucaPincha","date":"2015-02-07T21:21:06.633+0000","up_votes":3,"down_votes":1,"body":"Mira, yo no se porqué seguí jugando ranked, sabiendo que tenía lagg. Pero yo hoy a la mañana llegué a lvl 30... Jugué mi primera ranked muuy entusiasmado y de golpe se me empezó a laggear todo el juego y yo miraba mis \"ms\" y decía: \"¿Cómo puede ser que tenga lag si tengo 40 de ping?\" y me   voy a quedar ahora en bronce seguramente gracias a ese problema. Y yo digo no, porque no nos avisaron antes a travéz de las noificaciones? ahora como vamos a hacer los que perdimos la promo? como nos van a compenzar?\nPD: Esto está desde las 9:00 a.m (hora Argentina).\n Gracias, ATTE: AucaPincha","replies":[{"poster":"RengarTheHunter","date":"2015-02-07T21:44:30.076+0000","up_votes":3,"down_votes":1,"body":"yo te explico un corte de fibra optica es algo externo a riot entonces no te pueden avisar nada hasta q ellos sepan que el problema  esta alli. ademas estan en mantenimiento en vivo desde el 2 de febrero segun salia un post it en el cliente que decia que iba a ver leves interrupciones de servicio  es problema de ustedes si rankean sabiendo eso.","replies":[{"poster":"Daidaros","date":"2015-02-07T22:49:43.970+0000","up_votes":4,"down_votes":1,"body":"Para nada. Si bien es algo externo a Riot, la responsabilidad de que las colas clasificatorias sigan estando activas es 100% de ellos. ¿Pensas en serio que tardaron mas de 6 horas en darse cuenta donde está el problema? No hubo derrota evitada, y las ranked seguían estando activas. Yo hoy jugué 2 ranked, con 2 horas de diferencia entre una y otra. Por que jugué si ya había tenido problemas? Simple, las colas seguían habilitadas, habían pasado 2 horas, y nadie había dicho nada en el foro. Visto esto, entré pensando que había sido algo momentaneo por actualización, etc. Lamentablemente no, seguía sin haber inhabilitacion de colas, y seguía sin haber derrota evitada. Despues de esa partida, tardaron 2 horas mas en postear en el foro cual era el problema que estaban teniendo.\n\nPD: Las ranked siguen habilitadas.","replies":[{"poster":"Urthemiel","date":"2015-02-07T23:58:12.209+0000","up_votes":1,"down_votes":0,"body":"+1 y totalmente de acuerdo contigo!","replies":[]}]},{"poster":"ChronoGrandpa","date":"2015-02-07T22:26:10.058+0000","up_votes":1,"down_votes":0,"body":"tengo una duda, un corte de fibra optica puede ocasionar que haya \"delay\" sin subida de ping?? pregunto porque no se a que se debe el delay siendo que no hay cambios de ping","replies":[{"poster":"Kalkopirita","date":"2015-02-07T23:35:58.917+0000","up_votes":1,"down_votes":0,"body":"Por supuesto. La latencia es el tiempo de respuesta al servidor. La conexión trabaja como \"un emisor de paquetes de datos\". La latencia significaría cuanto tiempo se demora en mandar un paquete del computador al servidor, y viceversa. Lo que no asegura la latencia, es la integridad de los paquetes de datos, por lo tanto uno puede estar mandando datos al servidor, pero puede que este no los este recibiendo bien, y viceversa.","replies":[]}]}]}]},{"poster":"St Gerrard","date":"2015-02-08T00:15:54.354+0000","up_votes":2,"down_votes":0,"body":"A mi me han dejado en cola de baja reputación por cinco partidas, teniendo que esperar 20 minutos para poder jugar, por un problema que es externo a mí, y perder la promo a bronce I porque en mi equipo había afk (me incluyo) me parece muy injusto pero bueno, aquí siempre hay mas disgustos que gustos, ya tenemos que acostumbrarnos.","replies":[]},{"poster":"Tango Brujo","date":"2015-02-07T22:48:22.843+0000","up_votes":2,"down_votes":0,"body":"Un aviso en el lobby no cuesta nada.","replies":[]},{"poster":"Blackraven00","date":"2015-02-07T22:47:58.398+0000","up_votes":2,"down_votes":0,"body":"Estamos como ese server","replies":[]},{"poster":"Labdark","date":"2015-02-07T21:18:10.135+0000","up_votes":2,"down_votes":0,"body":"Y no van a activar la Loss Prevented?","replies":[]},{"poster":"Handicapped PC","date":"2015-02-07T20:59:24.851+0000","up_votes":1,"down_votes":0,"body":"Esto quiere decir que podemos experimentar delay o lag sin que aumenten nuestros ms?","replies":[{"poster":"Rocofu","date":"2015-02-07T21:02:16.241+0000","up_votes":2,"down_votes":2,"body":"Si, eso refleja una posible pérdida de paquetes.","replies":[{"poster":"Handicapped PC","date":"2015-02-07T21:11:13.557+0000","up_votes":2,"down_votes":0,"body":"Alabado sea Manin riot me respondio  XD. Na es joda gracias por la info","replies":[]},{"poster":"Grumpy Muppet","date":"2015-02-08T15:31:10.508+0000","up_votes":1,"down_votes":0,"body":"Y por q no activan derrota perdonada? o ponen la alerta en el server status para que la gente se entere antes de entrar a una partida? solamente lo hacen cuando los jugadores en chile se ven afectados y me parece pesimo de parte de ustedes. El servidor de llama LAS, no \"chile\".","replies":[]},{"poster":"Zurditx","date":"2015-02-07T21:12:28.823+0000","up_votes":1,"down_votes":1,"body":"Disculpa Rocofu, pero hay post de gente que por este problema ha perdido puntos de liga, ha perdido la promo o incluso, descender por este motivo. Mi pregunta es: ¿Como harán para compensar a toda esa gente?","replies":[{"poster":"Grexnar","date":"2015-02-07T21:42:00.102+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=LucianoGuanzi,realm=LAS,application-id=X54mVVp0,discussion-id=veAUNx9E,comment-id=000000000001,timestamp=2015-02-07T21:12:28.823+0000)\n>\n> Disculpa Rocofu, pero hay post de gente que por este problema ha perdido puntos de liga, ha perdido la promo o incluso, descender por este motivo. Mi pregunta es: ¿Como harán para compensar a toda esa gente?\n\nDisculpa Luciano, pero creo que todos ya sabemos cual es la respuesta a esa pregunta...y creo que es una que no {{champion:34}}  a los que perdieron.","replies":[]}]}]}]},{"poster":"Pupunete","date":"2015-02-08T15:58:13.765+0000","up_votes":1,"down_votes":0,"body":"Perdon pero si esta solucionado desde ayer a las 22:30, por que hoy domingo a las 13:00 sigo con 190 de ping?","replies":[]},{"poster":"LiuCat","date":"2015-02-08T05:35:36.895+0000","up_votes":1,"down_votes":0,"body":"casi 2 años y contando lo mismo de siempre .... la paciencia q tienen los jugadores de LAS es demaciada \n\nlo q significa q si la minoria tiene lag no ponen Derrota Evitada pero el problema q 1 persona con lag caga el game de los otros 9 DAT LOGIC LAS \n\nesto no es para q lo tomen a mal pero aprendan un poco del server BR tengo menos delay y menos ping","replies":[]},{"poster":"PipixDDD","date":"2015-02-08T04:43:15.583+0000","up_votes":1,"down_votes":0,"body":"y yo pensando que era mi internet","replies":[]},{"poster":"spaceghost","date":"2015-02-08T04:41:49.637+0000","up_votes":1,"down_votes":0,"body":"Rocofu, tengo un problema... No se a quien amo mas... Si a vos, Sir Dal o Cacharpas!\nGracias por la info.\n\nUn abrazo troesma!","replies":[]},{"poster":"Exoic","date":"2015-02-08T03:03:32.145+0000","up_votes":1,"down_votes":0,"body":"Ya van 2 dias con un ping horrible en todo un país. Hacer algo por favor.","replies":[]},{"poster":"Im Equi","date":"2015-02-08T01:20:46.040+0000","up_votes":1,"down_votes":0,"body":"se arreglo?","replies":[]},{"poster":"Kanzaki Ranko","date":"2015-02-08T00:22:24.380+0000","up_votes":1,"down_votes":0,"body":"Siendo yo, si pierdo una ranked por delay/lag/etc no juego más hasta el siguiente día.\n\nSi una normal me va lag, tampoco jugaré ranked, es sentido común.\n\nOjala puedan solucionar el problema pronto. \n\nSaludos.","replies":[]},{"poster":"Viejoo Lesbianoo","date":"2015-02-07T23:00:31.477+0000","up_votes":1,"down_votes":0,"body":"**Malas noticias y.y**  Por otra parte, aprovecho a disipar una duda, por que decidieron establecer el servidor en chile? Es posible que eso derive de muchos problemas? Fuera de todo eso. En chile tienen un ping excelente y nosotros renegando u.u","replies":[]},{"poster":"Im Equi","date":"2015-02-07T22:57:58.201+0000","up_votes":1,"down_votes":0,"body":"ya se arreglo?","replies":[]}]}