{"poster":"Rocofu","date":"2016-05-09T23:39:46.069+0000","title":"Mantenimiento Programado - 11/5 @ 6:00am CHI/ARG","subforum":"Problemas Técnicos","up_votes":10,"down_votes":0,"body":"&iexcl;Hola, amigos!\r\n\r\nEl Miercoles 11 a partir de las 6:00am CHI/ARG apagaremos la plataforma de LAS para realizar algunas actividades de mantenimiento. Esto significa que durante el periodo de mantenimiento, el servidor de LAS no estar&aacute; disponible. Desactivaremos las colas clasificatorias a las 4:30am CHI/ARG. Estimamos que el mantenimiento dure 3 horas tras lo cual reactivaremos la plataforma.\r\nTendremos avisos en el cliente.\r\n\r\n---------\r\n\r\n**&iquest;Porqu&eacute; hacemos esto?**\r\nNecesitamos hacer unas actualizaciones de software y otros ajustillos a algunos equipos. Estas son actividades completamente rutinarias en servidores como los nuestros por lo que no hay algo espec&iacute;fico que se est&eacute; solucionando. Sin embargo, debido al riesgo que presentan las actividades, debemos apagar la plataforma para poder hacer este mantenimiento de manera segura tanto para el equipo como para ustedes.\r\n\r\nHemos establecido un programa para hacer este tipo de actividades. En este otro post explicamos un poco m&aacute;s al respecto: http://boards.las.leagueoflegends.com/es/c/ayuda-y-soporte/PvzGKkOT-fecha-programada-de-mantenimientos-programados\r\n\r\n**&iquest;Qu&eacute; vamos a hacer en este caso?**\r\nTenemos que actualizar el software de Sistema Operativo y de otros servicios en algunos equipos de la plataforma que se encuentra en Miami. Algunos de estos equipos son principales en algunos servicios previos a iniciar partidas. Una vez iniciada la partida no afectan.","replies":[{"poster":"Rocofu","date":"2016-05-11T11:36:34.580+0000","up_votes":2,"down_votes":0,"body":"¡Hola, amigos!\n\nEste mantenimiento ha concluido exitosamente y la plataforma esta habilitada nuevamente. ¡Gracias por su paciencia!","replies":[]},{"poster":"Fedmau","date":"2016-05-10T01:02:21.419+0000","up_votes":6,"down_votes":0,"body":"Ok {{champion:33}} ","replies":[]},{"poster":"l Gally l","date":"2016-05-10T20:10:12.393+0000","up_votes":3,"down_votes":1,"body":"Osea... ¿No se podrá jugar desde las 6 hasta la 9? ¿Nada?\nEs decir, mañana, bien temprano en mi colegio se hará un mini torneo del juego, así que me gustaría saber si se podrá llevar a cabo para informar.\nGracias {{sticker:slayer-jinx-wink}}","replies":[{"poster":"MrAres","date":"2016-05-11T00:55:27.351+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Narukeful,realm=LAS,application-id=X54mVVp0,discussion-id=lTXczA2E,comment-id=0002,timestamp=2016-05-10T20:10:12.393+0000)\n>\n> Osea... ¿No se podrá jugar desde las 6 hasta la 9? ¿Nada?\n> Es decir, mañana, bien temprano en mi colegio se hará un mini torneo del juego, así que me gustaría saber si se podrá llevar a cabo para informar.\n> Gracias {{sticker:slayer-jinx-wink}}\n\nHabla por ti, yo tengo clase de matematicas #keinshiztizia","replies":[{"poster":"Pipinox24","date":"2016-05-11T04:01:47.739+0000","up_votes":2,"down_votes":0,"body":"Yo igual :c como odio las matematicas {{champion:32}}","replies":[]},{"poster":"shinigami123","date":"2016-05-11T09:58:36.936+0000","up_votes":1,"down_votes":0,"body":"si sabes que es hasta las 9 ya sabes si se puede realizar ese supuesto torneo","replies":[]}]},{"poster":"1221","date":"2016-05-10T23:45:33.983+0000","up_votes":1,"down_votes":0,"body":"Fuaa hacen mini torneitos? u.u que buen colegio jaja!\nSalu2(?","replies":[{"poster":"l Gally l","date":"2016-05-11T21:48:08.713+0000","up_votes":1,"down_votes":0,"body":"Es un colegio normalito. Pero no se pudo hacer, el internet del establecimiento era una caca :P","replies":[]}]},{"poster":"Gen Gis Skunk","date":"2016-05-11T00:29:24.628+0000","up_votes":1,"down_votes":0,"body":"uhhh nosotros tb a las 7 ibamos a hacer un torneo cerrado en el laburo, habra q trabajar che","replies":[]},{"poster":"Sondorax","date":"2016-05-10T22:18:23.849+0000","up_votes":1,"down_votes":0,"body":"Baia Baia,asi que usted tambien eh? :v,pero bueno,si hacemos calculos,de 6 a 9 no se podra,supongo que tipo 9:30 el server debe estar funcionando de nuevo","replies":[]}]},{"poster":"DarkZyel","date":"2016-05-10T18:54:31.495+0000","up_votes":2,"down_votes":0,"body":"Ojala que mejore la cosa del cliente...esta muy pesado ya que me esta consumiendo mas ram que antes y se pega en el menú del juego.\nTambién hay problemas de desconexion por periodos cortos. Acá por lo menos en Chile están pasando estas cosas. Desde la actualización 6.8 que se ven estos problemas. Por favor considérenlos y revísenlos.\ngracias......{{champion:201}}","replies":[]},{"poster":"S2NE","date":"2016-05-11T19:05:36.609+0000","up_votes":1,"down_votes":0,"body":"{{sticker:slayer-jinx-catface}}","replies":[]},{"poster":"BiXe","date":"2016-05-11T11:13:02.188+0000","up_votes":1,"down_votes":0,"body":"He visto varios mantenimientos de lo que es lol (por el horario que trabajo y porque tengo corrido día por noche) y desactivan las colas clasificatorias 2 horas antes o más (lo cual me parece perfecto), pero el resto de partidas se pueden seguir ingresando sin ningún inconveniente y en medio de las partidas (es decir el horario del reboot o apagado) tiran todo.\n\n¿A qué voy con esto?\n\n1. Estaría bueno se implementase una forma de desconexión o acceso al server como hacen los FTP\n2. A medida que vayan finalizando las partidas en un horario X (puede ser media hora antes del mantenimiento) los users no se vayan pudiendo loguear o desconectando del launcher.\n3. Y que las partidas que estén todavía realizandose se terminen. \n4. Para que de un modo progresivo se vaya realizando el deslog de los users sin afectar partidas a nadie (ni generar esa molestia que es que te desconecten de una red a pesar de saber que va a haber un apagado)\n5. Y saber que las transacciones que se hagan durante ese periodo se efectúen correctamente (acreditación de PI, RP, compras, modificaciones en los perfiles, etc).\n\nLo dejo como una observación que estaría bueno aplicar, y otra cosa sería una opción de \"Cerrar sesión\", como una comodidad, en el caso de aquellos que tengan pcs compartidas con varios miembros de la casa, no tengan la necesidad de cerrar el launcher y volverlo a abrir (no es mi caso por suerte :P).\n\nEspero sirva mi aporte\n\n¡Exitos!{{champion:101}}","replies":[]},{"poster":"Firefer neko","date":"2016-05-11T10:57:05.279+0000","up_votes":1,"down_votes":0,"body":"(Si no se entiende, lean los otros comentarios) Y en otras noticias, el mantenimiento del servidor LAS de League Of Legends, deshabilito el juego llevando a Argentina y Chile a la productividad. El Fatal incidente, que se vio en los paises del sur del continente esta mañana, evito que estudiantes y hombres de trabajo, no jugaran o no tuviesen razon para faltar a sus obligaciones, lo que mejoro la asistencia y la concentracion en un 150%.","replies":[]},{"poster":"Alunada","date":"2016-05-11T09:08:22.118+0000","up_votes":1,"down_votes":1,"body":"Hola rito, quería{{champion:112}}  agradecerte por tu mantenimiento a las 6 am cuando se ponen las normals, por que no hay clasificatoria . Recien empezamos una tf en mid, ibamos 4 3 , y que pasa? rito decide cerrar ajajajaj dat . Bien jugado de nuevo rito. bien jugado..","replies":[]}]}