{"poster":"Rocofu","date":"2015-10-15T20:32:44.099+0000","title":"Teemo y Karthus desactivados en Uno para Todos","subforum":"Charlas Generales","up_votes":2,"down_votes":2,"body":"&iexcl;Hola, amigos!\r\n\r\nHist&oacute;ricamente, Teemo y Karthus han sido desactivados en el modo de juego Uno para Todos. Sus mec&aacute;nicas de juego los convierten en una verdadera pesadilla para el equipo enemigo y van mucho m&aacute;s all&aacute; de lo que cualquiera de los otros campeones podr&iacute;a hacer. La idea de una grieta repleta de honguitos cual campo minado es capaz de enviar a m&aacute;s de un jugador al manicomio.\r\n\r\nHoy por la ma&ntilde;ana estos dos campeones estuvieron activos accidentalmente por unas cuantas horas, pero ya fueron desactivados solamente en el Uno para Todos en modo PvP.\r\n\r\nTodav&iacute;a podr&aacute;s usar a Teemo y Karthus en las partidas personalizadas del Uno para Todos , &iexcl;y en el mapa de tu elecci&oacute;n! :D","replies":[{"poster":"Numerítos","date":"2015-10-20T17:08:12.102+0000","up_votes":2,"down_votes":0,"body":">>>> {{champion:3}}  <<<< es la solucion para esos dos","replies":[]},{"poster":"ZeNch","date":"2015-10-20T13:17:22.863+0000","up_votes":2,"down_votes":0,"body":"Nadie se queja de mi y de los stuns permanentes {{champion:85}} \n\nQ+W+E ya es un stun\npero como cada kenen puede usar su W con que uno solo deje la marca...\n\na esto le sumamos la ulti:\n\"Invoca una tormenta mágica que dura 5 s e inflige 210 (+0.4) de daño mágico a un campeón aleatorio cerca de Kennen cada 0,25 segundos.\nTempestad Cercenante puede golpear al mismo campeón hasta 3 veces, pero no puede golpear al mismo campeón más de una vez cada 0,5 segundos.\"\n\nclaro que al ser 2 kennen esto parece roto... imaginense 3 kennens... o una TF de 5v5. (solo con las ultis y W son lo peor (y mas divertido) de este modo.)\n\nNo hace falta saber jugarlo y si estas con duo en linea un flash ulti coordinado + W los 2... ya esta IZI {{summoner:4}} \n\nZhonya? para que quiero ser inmune si el rival no se va a mover hasta que muera","replies":[]},{"poster":"Im Zoe Sorry","date":"2015-10-16T20:47:28.026+0000","up_votes":2,"down_votes":0,"body":"como lloran por un modo temporal vieja","replies":[]},{"poster":"Zeukrob","date":"2015-10-24T05:54:26.003+0000","up_votes":1,"down_votes":0,"body":"¿Ban a teemo y no a otros que son pick to win?. ¿Será por algo que los permaban son los mismos 3 o 4 de siempre?, ¿será por algo que hasta penta me hice con uno de ellos solo a cabezazos?. Usé solo dos \"q\", una \"e\" (más no pude por que me estaba muriendo), zhonya y muchas torretitas, ni yo me lo creía, penta rascándome los webos. En fin, teemo se va ban.{{champion:74}}\n\n[](https://plus.google.com/u/0/117304851060497230164/posts/KvKngWUKKNH?pid=6209089926521905090&oid=117304851060497230164)","replies":[]},{"poster":"spike the ninja","date":"2015-10-23T19:35:57.907+0000","up_votes":1,"down_votes":0,"body":"Para que verg... implementan un sistema de baneo en la seleccion si los banean ustedes?   Para eso es si se que son op los baneo y ya no mam es","replies":[]},{"poster":"HiKewne","date":"2015-10-20T04:34:24.300+0000","up_votes":1,"down_votes":0,"body":"Si los podemos banear, ¿Por qué los desactivan? Hay composiciones de equipo que pueden derrotar a 5 teemos a la vez (Ej CUALQUIER CAMPEÓN \"ARTILLERO\" : {{champion:69}} {{champion:96}} {{champion:101}} {{champion:99}} {{champion:81}} {{champion:115}} {{champion:3}} (ESTE EN ESPECIAL) {{champion:43}} {{champion:134}} {{champion:110}} {{champion:143}}. Los campeones artilleros son enreferencia a aquellos de gran rango en alguna de sus habilidades o todas) y karthus? Basta ponerse MR... Además los hongos de Teemo han sido nerfeados en su daño desde el one for all de la season anterior... No me parece lógico lo hecho.","replies":[]},{"poster":"Nico Nico Nii","date":"2015-10-20T01:50:13.378+0000","up_votes":1,"down_votes":0,"body":"Ese modo es para divertirse, ni quiero ni imaginar lo que pasará en urf XD","replies":[]},{"poster":"Condor","date":"2015-10-16T19:45:08.210+0000","up_votes":1,"down_votes":0,"body":"Ojalá desactiven a heimerdiger tambien.....15 torretas en 1 linea no es divertido :c","replies":[{"poster":"Angel28","date":"2015-10-17T07:47:33.906+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Condor,realm=LAS,application-id=v7qsfXsE,discussion-id=QZ1WIVv6,comment-id=0002,timestamp=2015-10-16T19:45:08.210+0000)\n>\n> Ojalá desactiven a heimerdiger tambien.....15 torretas en 1 linea no es divertido :c\n\nHeimerdinger al poder xDDD","replies":[]}]},{"poster":"Sonya Kyron","date":"2015-10-16T21:35:44.145+0000","up_votes":1,"down_votes":0,"body":"Yo maineo a karthus, los 14 partidos que lo use en URF, los gane practicamente solo, a nadie se le ocurrio que 5 karthus Vs 5 Mundo pierden los karthus porque no se pueden sincronizar las 5 ultis para matar a los 5 mundo a la vez.\nHay combos fatales, por ejemplo 5 taric te estunean turnandose por 1.6 segundos con un enfriamiento de 5 segundos. asi que hasta te puede bailar un taric al lado. Ni hablar de los champs qeu tienen stun por 2 segundos.","replies":[]},{"poster":"Baltic4 Senp4i","date":"2015-10-15T20:36:06.237+0000","up_votes":1,"down_votes":5,"body":"JAJAJ SERIA DIVERTIDO PODER JUGAR ! PERO ME QUEDO EN 32 % Y DICE QUE HAY UN ERROR NO ESPECIFICADO\n  Y NO DAN SOLUCION, NO SOY SOLO YO HAY MUCHOS PERO SIGAN BANEANDO CAMPEONES !  {{champion:32}}","replies":[{"poster":"xBASTOXx","date":"2015-10-16T02:41:51.246+0000","up_votes":1,"down_votes":0,"body":"Ya esta activo el modo? T-T yo aun no puedo reinstalarlo:c llevo 2 dias sin lol :'cc","replies":[]},{"poster":"Zakor","date":"2015-10-15T21:27:28.327+0000","up_votes":1,"down_votes":0,"body":"Amigo yo ahora antes de actualizar hago una copia de la carpeta del lol por si pasa algo te lo recomiendo","replies":[]}]},{"poster":"Zabivaka","date":"2015-10-16T01:37:27.200+0000","up_votes":1,"down_votes":2,"body":"Tienen que banear a {{champion:203}} porque es insoportable tener 5 lobos mordiendote las nalgas con un slow infinito y 5 inmortalidades","replies":[]}]}