{"poster":"Sera98","date":"2017-07-06T00:20:26.283+0000","title":"Impossibile connettersi al server","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Salve a tutti, &egrave; tutta la sera che riscontro questo problema, fino al pick del campione tutto a posto poi, quando cerca di entrare in landa mi blocca con il messaggio &quot;impossibile connettersi al server&quot;. Ho usato lo strumento di riparazione pi&ugrave; e pi&ugrave; volte, poi preso dalla rabbia ho reinstallato il gioco, non ottenendo alcun risultato. Consigli?","replies":[{"poster":"Dodop","date":"2017-07-06T06:38:04.404+0000","up_votes":1,"down_votes":0,"body":"Mentre si verifica il problema, hai provato a pingare nel prompt il server Riot e vedere se hai packet loss?","replies":[{"poster":"Sera98","date":"2017-07-06T08:12:53.788+0000","up_votes":1,"down_votes":0,"body":"A quanto sembra non è un problema di perdita dei pacchetti :/","replies":[{"poster":"Dodop","date":"2017-07-09T08:52:45.390+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sera98,realm=EUW,application-id=MJVj50Jw,discussion-id=urbIfzOw,comment-id=00010000,timestamp=2017-07-06T08:12:53.788+0000)\n>\n> A quanto sembra non è un problema di perdita dei pacchetti :/\n\nMi potresti postare i risultati qua sotto, dopo aver pingato il server Riot nel prompt?\n>ping 104.160.141.3 -n 20","replies":[]}]}]},{"poster":"star bright99","date":"2017-07-07T19:01:42.598+0000","up_votes":1,"down_votes":0,"body":"questo problema mi capita ultimamente spesso anche a me e sinceramente mi sono accorto che finchè c'è la schermata di caricamento nn ti si riconnetterà al 101% poichè l'ho provato 6 volte di fila una volta a farlo. ma nessun risultato.\nl'unica cosa che mi sono accorto era che , è possibile connettersi solo quando la partita è già iniziata da 30 -45 sec circa. ci riuscirai sicuramente.\nso che è brutto se qualcuno voloesse andare a invadere... ma vabbeh sempre meglio che stare afk e prendere punizione no?","replies":[]},{"poster":"Famish","date":"2017-07-07T14:38:42.633+0000","up_votes":1,"down_votes":0,"body":"questa cosa succede a molte persone me compreso, ho già ricevuto 2 volte le partita con coda da 5 minuti l'una... è solo una rottura di b....e. L'unica cosa che posso dirti è di riprovare più tardi....","replies":[]},{"poster":"Don Draven","date":"2017-07-06T00:44:52.453+0000","up_votes":1,"down_votes":0,"body":"sta cosa mi sa tanto di firewall o antivirus,prova a spegnerli entrambi.","replies":[{"poster":"Sera98","date":"2017-07-06T00:46:01.778+0000","up_votes":1,"down_votes":0,"body":"Antivirus non installato firewall disattivato dallo strumento di riparazione","replies":[{"poster":"Don Draven","date":"2017-07-06T00:49:47.705+0000","up_votes":1,"down_votes":0,"body":"boh non so che dirti non ho nemmeno le informazioni necessarie per aiutarti ti conviene chiedere al supporto se anche te sai niente,hai la possibilità di vedere se ti fa giocare da un altro pc?(immagino di no senno saresti già li a giocare)","replies":[{"poster":"Sera98","date":"2017-07-06T00:51:19.171+0000","up_votes":1,"down_votes":0,"body":"Eh si, purtroppo non ho altra possibilità di poter provare, Comunque grazie mille, mi sono mobilitato inviando un report con i registri al supporto.","replies":[]}]}]}]}]}