{"poster":"GankMeOrLose","date":"2016-12-26T21:04:04.770+0000","title":"Nieder mit Sloteffizienten Items? In wiefern betrifft das Lategamechamps?","subforum":"Champions & Gameplay","up_votes":5,"down_votes":1,"body":"Tach Leudde, \r\n\r\nRiot ver&auml;ndert ja schon seit dem Mage Update alle AP Items so, das sie billiger sind aber auch weniger Werte geben damit man sich die Utility fr&uuml;her holen kann. Ich pers&ouml;nlich finde diesen Ansatz super denn wer h&auml;tte nicht lieber gerne fr&uuml;her ein Zhonyas gegen Zed und Fizz? Oder den slow von Rylais?\r\n\r\nInsgesamt ist der Ansatz super und sie haben ja daf&uuml;r das alles weniger AP gibt ja auch die Passive von Rabadons gebufft (der trotzdem total gegen den viel besseren Void Staff abstinkt).  Doch langsam Frage ich mich was das denn f&uuml;r Konsequenzen hat die Sloteffektivit&auml;t vollkommen zu ignorieren. Es gibt absolut kein Sloteffeizientes Mage Item das wirklich Impact im Spiel hat. Jeder holt sich lieber ein Billigen Protobelt. \r\n\r\nIch m&ouml;chte nochmal betonen das ich den Ansatz von Riot super finde. Aber ich glaube das Champions die stark Mid AP skalieren oder stark im Lategame sind vllt davon nicht profitieren sondern eher darunter leiden. Ich denke auch das z.b Azir nicht nur unter den Nerfs sonder auch unter genau diesen &Auml;nderungen leidet und schlechtester Midlaner des Jahrhunderts ist. \r\n\r\nIch habe als Bronzie leider zu wenig Gameknowledge um zu wissen wie es wirklich ist aber ich w&uuml;nsche mir mehr Sloteffiziente Items f&uuml;r Lategame Champs. Wie seht ihr das? \r\n\r\nLG","replies":[{"poster":"Nohgolgh","date":"2016-12-27T14:08:02.530+0000","up_votes":6,"down_votes":0,"body":"Ich hatte ähnliche Gedanken als das Mage-Update herauskam, jetzt jedoch nicht mehr. \nZunächst mal: Rabadons ist im Normalfall deutlich sloteffizienter als der Voidstaff, schließlich gibt er straight 84 AP mehr, wenn man nur die freien Ap und die Passive auf die AP von Rabadons mitrechnet, während man die Passive auf die Ap-Werte anderer Items ignoriert. Auf den skalierenden Teil deiner Fähigkeiten bezogen, macht Voidstaff-Passive  erst ab etwas über 200 MR mehr Schaden als die Passive der Todeshaube (übrigens unabhängig vom Scaling, sofern dieses über Null liegt). Man muss natürlich auch bedenken, dass der Voidstaff sich auch auf die Basewerte der Zauber auswirkt und mit zusätzlicher flat penetration besser wird, während man bei der Todeshaube noch die zusätzlichen AP zu berücksichtigen hat. Jedenfalls, solange nicht gerade 3 Tanks herumlaufen, die über 200 MR haben, wirst du mit einem Rabadons mehr Schaden für deinen Slot bekommen (Voidstaff ist aber kosteneffizienter, weil deutlich billiger, nur spielt die zusätzliche Ap für das gesparte Gold keine Rolle mehr im Late, weil der Slot dafür im full build nicht mehr verfügbar ist). \n\nNun aber zurück zum eigentlichen Thema: Von den Ap-Werten wurden in letzter Zeit generft:\n{{item:3157}}, {{item:3116}}, {{item:3001}}, {{item:3174}} ,{{item:3027}} \n\nDer Gral ist kein Mageitem mehr, insofern betrifft die slotineffizeienz die Mages nicht mehr. Der Rod hat zwar 20 Ap verloren, aber die Passive ist deutlich stärker als zuvor und war Anfangs so stark, dass man diesen sogleich nerfen musste. Der Rod ist inzwischen ein interessantes Sustain-/Duellitem für Mages. Zhonias und das Höllenzepter wurden ich Richtung situativer defensiver Gegenstände gedrängt, wobei letzterer in meinen Augen klar generft wurde, seit die Passive geändert wurde. Erst ab 175 MR ist die Passive des neuen Höllenzepters genauso gut oder besser im Vergleich zur alten, womit nicht nur die Sloteffizienz, sondern auch die Kosteneffizienz sank.  Das Stundenglas ist tatsächlich kosteneffizienter und slotineffizienter geworden. \n\nEin Gegenstand hat Ap hinzubekommen: \n{{item:3165}} \n\nDieser Gegenstand ist übel kosteneffizeint (112% ohne Passive) und auch die Sloteffizienz ist hoch. \n\nDazu kommt aber noch, dass nicht nur die Ap-Gegenstände, sondern auch die MR-Gegenstände angepasst wurden:\n{{item:3001}} {{item:3190}} {{item:3060}} \n{{item:3102}} {{item:3026}} {{item:3512}} {{item:3156}}{{item:3139}} {{item:3065}}  \n{{item:3814}} \nDie erste Reihe hat mehr MR bekommen, aber auf Kosten anderer Stats, wie Leben und AP. Das Höllenzepter erachte ich, wie gesagt, als generft. Auch das Locket ist nun deutlich Situativer als zuvor und das Kommandobanner ist auch kein wirklich gutes Item. \nDie zweite Reihe an Gegenständen ist slotineffizienter geworden, wobei das Banshee's, die Geistessicht, das ZZ'Rot-Portal, der GA und der Schlund, direkt defensive Stats  gegen magischen Schaden eingebüßt haben, während die QSS 10 AD verloren hat. \nDas Item in der dritten Reihe ist neu dazugekommen, ward aber bisher selten gesehen. Ohne die Kanalisierung der Aktiven wäre es vermutlich OP, so ist es nicht besonders gut. \n\nMages haben generell Zugriff auf eine Menge sloteffizienter Gegenstände: Hier meine Einschätzung der Gegenstände nach Sloteffizienz in Gruppen. Hierbei steht der sloteffizienteste Gegenstand am weitesten links und die Sloteffizienz nimmt nach rechts ab. \n\nGod-Tier (konsistent starke oder situativ überragende Gegenstände):\n{{item:3100}} {{item:3089}} {{item:3135}} {{item:3048}} \n\nStrong Tier (konsistent einflussreiche oder situativ starke Gegenstände):\n{{item:3165}} {{item:3027}} {{item:3152}} {{item:3115}} {{item:3285}} {{item:3116}} {{item:3157}} {{item:3020}} \n\nMedium Tier (konsistente aber wenig einflussreiche Gegenstände oder situativ einflussreiche Gegenstände):\n {{item:3001}} {{item:3151}} {{item:3146}} {{item:3041}} \n\nWeak Tier (inkonsistente und situative Gegenstände): \n{{item:3030}} {{item:3174}}  {{item:3124}} {{item:3504}} {{item:3092}} {{item:3050}}\n\nInsofern haben wir doch einige sehr kosteneffiziente Gegenstände und zumeist bedient man sich ja aus den Gegenständen der oberen beiden Kategorien. Der Protobelt ist durch seine Aktive sehr sloteffizient. Mag er auch weniger AP geben als andere Gegenstände, so hat er doch einen guten Baseschaden mit soldidem Scaling, sofern man wenigstens fünf Raketen trifft (theoretisch sind acht möglich, aber realistisch sind es nur sieben). Die aktive Fähigkeit stellt quasi einen extra Schadenszauber da und ein extra Zauber mit 600 AP ist wesentlich wertvoller als nur vier Zauber zu haben und dafür 650 AP. Nachteil ist, dass man nahe ran muss, was diesen Gegenstand in die Kategorie situativ und stark bringt. \n\nAber zum Vergleich mit einem Schützen (Ezreal jetzt mal außen vor gelassen, da der einen recht speziellen Build hat) : \n\nGod-Tier:\n{{item:3036}} \n\nStrong Tier: \n{{item:3033}}  {{item:3139}} {{item:3031}} {{item:3508}} {{item:3072}} {{item:3085}} \n\nMedium Tier: \n{{item:3153}} {{item:3087}} {{item:3046}} {{item:3094}} {{item:3156}} {{item:3078}} \n\nWeak Tier: \n{{item:3147}}{{item:3812}} {{item:3142}}  {{item:3124}}\n\nDer Schütze muss sich also aus einem Itempool bedienen, der insgesamt wesentlich weniger sloteffizient ist. Man sollte hierbei bedenken, dass ein Gegenstand wie beispielsweise Trinity Force auf Schützen in der Regel nicht besonders sloteffizient ist, da diese nicht viele Fähigkeiten zwischen Ihre Angriffe packen können (Ausnahmen wie Ezreal und Corki gibt es natürlich). ","replies":[{"poster":"GankMeOrLose","date":"2016-12-28T21:02:00.352+0000","up_votes":1,"down_votes":0,"body":"Nur als Anmerkung: Void Staff is schon ab 30 MR effektiver als Rabadons und das is der Grundwert jedes Champions. Deswegen is auch Höllenzepter enorm effektiv, schau mal bei Probuilds.com auf Main Mids wie Bjergsen und Faker, die holen sich regelmäßig Höllenzepter","replies":[{"poster":"Nohgolgh","date":"2016-12-29T20:13:25.893+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Dragonyx44,realm=EUW,application-id=Wj1wcocU,discussion-id=0juIo2Af,comment-id=00010002,timestamp=2016-12-28T21:02:00.352+0000)\n>\n> Nur als Anmerkung: Void Staff is schon ab 30 MR effektiver als Rabadons und das is der Grundwert jedes Champions. Deswegen is auch Höllenzepter enorm effektiv, schau mal bei Probuilds.com auf Main Mids wie Bjergsen und Faker, die holen sich regelmäßig Höllenzepter\n\nVoidstaff ist KOSTENeffizienter, aber Rabadons ist in der Regel SLOTeffizienter. Die Effizienzrechnung von Voidstaff gegen Rabadons beruht ja darauf, dass man noch zusätzlich AP für die Golddifferenz holen kann. Dafür brauchst du aber einen extra SLOT. Das habe ich auch genau so in meinem Vorpost geschrieben (Ende erster Absatz). Das Höllenzepter ist als defensives Item gar nicht so schlecht, das macht es aber nicht super SLOTeffizient. Und die Passive ist ein Nerf gegenüber der vorherigen Passiven, weil der Entzug von 25 MR gegenüber 10% mehr Schaden erst bei hohen MR-Werten schlechter wird. ","replies":[]}]},{"poster":"DontKillMySoraka","date":"2016-12-27T16:05:50.415+0000","up_votes":1,"down_votes":0,"body":"der lord domeniks / dieses andere mit heilreduzierung ist ein situatives Item und kein muss wenn keine strongen tanks im spiel sind.","replies":[{"poster":"Nohgolgh","date":"2016-12-27T19:13:43.211+0000","up_votes":1,"down_votes":0,"body":"Stmmt, aber wenn Tanks im Spiel sind würde ich Lord Dominiks als überragend klassifizieren, da es bei drei Rüstungsgegenständen zwei kompensiert (1,5 Rüstungsgegenstände werden durchdrungen, und die 50 AD drauf und +15% Bonusschaden, die man ja auch dann erhält wenn der Gegner {{item:3027}} {{item:3151}} {{item:3116}} {{item:3152}} {{item:3030}} (midlane) oder {{item:3401}}  {{item:3107}} {{item:3109}} (support)  baut). Man kann natürlich jetzt darüber streiten ob Lord Dominiks doch nur im Strong Tier ist. Dann wäre aber kein Item im God-Tier-Bereich und -sofern du mir bei meiner Einschätzung der Mage-Items zustimmst- der Gap zu den Magiern wäre eher noch größer. Natürlich muss man berücksichtigen, dass einem AD-Carry durch die Synergie von von AD, crit und AS mehr Schaden gegeben wird als durch ein einzelnes Item, so dass man auch mit für sich genommen slotineffizienteren Items in der Kombination eine hohe Sloteffizienz haben kann.","replies":[]}]},{"poster":"Mi3zekatze","date":"2016-12-27T20:43:37.677+0000","up_votes":1,"down_votes":1,"body":"Super erklärt gut durchgerechnet und sogar verständlich dargelegt mit klarer Einteilung in klare Klassen. Verständlicherweise dazu gesagt!\n\nManchmal hasse ich diese Community das sowas nicht sofort auf +27 geboosted wird\n\n+1","replies":[]}]},{"poster":"ZîraeI","date":"2016-12-27T08:57:13.515+0000","up_votes":3,"down_votes":1,"body":"Die AP verringerung auf allen Items war noch halb so schlimm , weil zu der zeit der Blue Buff 15% mehr AP versprochen hat. Allerdings wurden jetzt die AP Items generft AP entfernt Utility reduziert + zurätzlich die 15% AP vom Blue Buff entfernt. Es fehlen schlichtweg einfach jedem AP'ler 15% AP welche noch schmerzhafter sind sei viele Items weniger Ap geben. Ich denke das Problemk liegt nicht zwangsweise bei den Items. Es ist einfach zu leicht einen AP Champion aus der Mid-lane zu Bullien. Ich denke jeder kennt den Zed/Talon die sich als erstes Item erstmal einen Maw of Malmortius kaufen{{item:3156}}. Es ist einfach zu leicht einen AP Mid-Laner zu Countern. \nDenn um wirklich effektiv Schaden verursachen zu können muss sich der Entsprechende Mid laner dann erst einmal einen {{item:3135}}  kaufen. Stellt sich aber als schwierig heraus da die meisten auf die CDR und Mana von {{item:3165}} angewiesen sind. Heißt im Klartext das der {{item:3135}} im normalfall frühestens als Zweites Item gebaut werden KANN ( Muss natürlich nicht wenn Controll Mages/Oder mages die andere Ziele Fokussieren gespielt werden). Aber selbst der ADC muss (Mit einem brauchbarem Support) inzwischen keine Angst mehr vor {{champion:134}} Ultimate haben, denn der Support Drückt einfach {{item:3190}} {{item:3401}} und lacht sich ins Fäustchen wie der Gesamte Syndra DMG an einem 800er Schild abprallt.","replies":[{"poster":"Nohgolgh","date":"2016-12-27T14:17:11.122+0000","up_votes":1,"down_votes":0,"body":"Nach deiner Logik müssten ja Talon oder Zed besonders stark sein, was nicht der Fall ist. Gegen Ad-Champions kann sich ein Mage ja auch das Stundenglas holen. Talon ist zudem recht einfach in der Mitte zu bullien. Und, ja ich finde es richtig, dass Syndra nicht alleine mit ihrer Ulti gegen zwei Schilde das 1v2 gewinnt. Syndra ist definitiv trotzdem einer der stärkeren Midlaner.","replies":[{"poster":"Mi3zekatze","date":"2016-12-27T20:46:56.235+0000","up_votes":1,"down_votes":0,"body":"Stimmt es gibt 1000sende klicks wo Syndra einfach nur R drückt und der bessere Veigar war. Zum Glück sind diese Zeiten... okay nicht vorbei aber es kommt seltener vor wegen all den neuen WIRKLICH TOLLEN! Supportitems! Endlich hat man das Gefühl auch etwas zu tun als Supporter!","replies":[]},{"poster":"ZîraeI","date":"2016-12-27T15:15:50.792+0000","up_votes":1,"down_votes":0,"body":"Zed ist immernoch ein Top pick gegen jeden Mage in der Mitte. Wir reden hier ja nicht von High-Elo sondern Low-Elo bereich und dort sind Champs wie Talon und Zed nunmal sehr Stark.","replies":[{"poster":"Nohgolgh","date":"2016-12-27T19:38:13.972+0000","up_votes":1,"down_votes":0,"body":"Zed ist ein mechansich anspruchsvoller Champion...er hat keine Winrate über 50% in Bronze. \n\nhttp://www.leagueofgraphs.com/de/champions/stats/zed/middle/bronze\n\nEgal welche Elo du in dem Reiter auswählst, Zed hat keine Winrate über 50%. Ich konnte auch keine Statistik finden, die nur ansatzweise eine gegenteilige Behauptung zulässt.","replies":[]}]}]}]}]}