{"poster":"GankMeOrLose","date":"2015-10-20T21:26:17.087+0000","title":"Warum IMMER surrender?","subforum":"Spielerverhalten & Moderation","up_votes":3,"down_votes":6,"body":"Kann mir jemand vllt verraten warum die Teammates IMMER surrendern wollne? Ich hatte gerade n Penta mit Jinx und kurz darauf hat mein Team surrendert weil Teemp 2 Kills hatte und &quot;gefeedet&quot; war. Es kommt mir so vor als ob die IMMER surrendern wollne. Selbst wenn ich mit Vayne 11/3 stehe wollen die surrendern. Ich verstehe es nicht.\r\n\r\nLG","replies":[{"poster":"Antiqui","date":"2015-10-21T09:20:53.635+0000","up_votes":3,"down_votes":0,"body":"Ich hab mir das Jinx Spiel mal angeschaut. Der Teemo steht mit stattlichen 15/1 da, während du selbst zwar mit 13 Kills ne menge Gold hattest. aber selbst 12 Tode auf dem Konto hast. Die Gegnerische Vi toppt den Teemo kommt auch auf 21/6/6 stats. Die andere Jinx hat auch 13 Kills. Das sieht für mich aus als wärt ihr gestompt worden, und der Gegner hat einfach nicht beendet um noch mehr Kills zu farmen.\n\nWenn ich Gegner hab die nur noch disrespecten und weiterstompen, surrendere ich auch. Meine Zeit ist zu wertvoll um sich demütigen zu lassen.","replies":[{"poster":"GankMeOrLose","date":"2015-10-21T21:11:15.575+0000","up_votes":1,"down_votes":3,"body":"Und du bezeighst meine frage auf nur ein spiel?","replies":[{"poster":"Antiqui","date":"2015-10-22T09:54:51.505+0000","up_votes":2,"down_votes":0,"body":"Nein, aber es ist das Spiel das du als Beispiel genannt hast. Also nehme ich auch das beispiel um dir zu zeigen das es auch Spiele gibt die man ruhigen gewissens Surrendern kann und sollte. Schau nicht nur auf deine eigenen Stats, sondern auch was deine Mitspieler machen und dann wirst du sehen das in dieser Partie ihr gnadenlos unterlegen seid.\n\nKlar es gibt leute die geben zu früh auf. Aber hier ist es gerechtfertigt.","replies":[]},{"poster":"franticFurball","date":"2015-10-23T07:31:20.928+0000","up_votes":1,"down_votes":0,"body":"Du beziehst deine auch nur auf eines.","replies":[]}]}]},{"poster":"franticFurball","date":"2015-10-23T07:32:48.003+0000","up_votes":2,"down_votes":0,"body":"Weil es eine demokratische Entscheidung mit einer 4/5 Mehrheit ist, ganz einfach.","replies":[]},{"poster":"xClyde","date":"2015-10-21T08:21:26.187+0000","up_votes":2,"down_votes":0,"body":"Ich kenn das, stirbt einer 2 x schreien einige Kameraden direkt surrender. Einfach ignorieren. Empfehle DuoQ - zu zweit lässt sich das gut verhindern...\n\nUnd ja, sicherlich lasse ich solche 10. min. surrenderer nicht mehr entkommen, selbst wenn es irgendwann offensichtlich sinnlos ist. Aber leider die einzige Art sich zu wehren.","replies":[]},{"poster":"Sahnepuffelchen","date":"2015-10-22T12:16:47.137+0000","up_votes":1,"down_votes":0,"body":"Vielleicht.. Könnte es sein.. Dass du nicht gerade nett zu deinen Mitspielern bist und sie keine Lust mehr auf dich haben ?","replies":[]},{"poster":"Fcktardmagnet","date":"2015-10-22T01:20:26.801+0000","up_votes":1,"down_votes":0,"body":"Weil sie keine Lust mehr auf das Game haben was diverse Gründe haben kann auf die du selbst kommst wenn du die Zeit zum nachdenken nutzt. lg","replies":[]},{"poster":"Kunkel","date":"2015-10-20T22:53:29.973+0000","up_votes":4,"down_votes":5,"body":"ich surrender immer wenn das gegner team first blood bekommt, dann feeden eh immer alle nur noch","replies":[{"poster":"FullHero2","date":"2015-10-21T08:23:28.767+0000","up_votes":1,"down_votes":1,"body":"Si{{champion:17}}","replies":[]}]}]}