{"poster":"Giuan91","date":"2016-05-17T08:05:07.959+0000","title":"Riot fai sorridere","subforum":"Discussioni generali","up_votes":2,"down_votes":11,"body":"Salve ragazzi vi racconta la mia bellissima esperienza by riot accaduta adesso,stavo in ranked tra l&#039;altro vinta ,all&#039;improvviso mi crasha il pc ho dovuto riavviare ,dopo 5 minuti stavo n&#039;altra volta nel game a fine game mi esce scritto per essere stato afk o leavvato ecc stai in una coda a bassa priorita XD\r\ncio&egrave; complimenti alla riot....o hai una connessione da dio o un pc da dio oppure non puoi giocare su league of legends e gi&agrave; mi &egrave; capitato un&#039;altra volta, per mio personale parere cose senza senso!!Comunque se vi va di condividere le vostre opinioni sono ben accette!!","replies":[{"poster":"BrattishSolid6","date":"2016-05-17T08:56:14.031+0000","up_votes":2,"down_votes":1,"body":"Quindi quando in ranked ti trovi uno o più afk in team sei felice? Lacosa non ti dà il minimo fastidio?","replies":[{"poster":"Giuan91","date":"2016-05-17T09:00:21.729+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=BrattishSolid6,realm=EUW,application-id=MJVj50Jw,discussion-id=hqVaOwZa,comment-id=0003,timestamp=2016-05-17T08:56:14.031+0000)\n>\n> Quindi quando in ranked ti trovi uno o più afk in team sei felice? Lacosa non ti dà il minimo fastidio?\n\nPuò dar fastidio ma a 25 anni capisci che tanto può essere colpa della connessione tanto può essere colpa del flame,a tutti possono capitare giornate storte un pò come il flamer in team io non sono una persona che muta o reporta perchè oggi capita al flamer domani a me,però io ho una mentalità molto aperta ammenoche non arrivano insulti pesanti come cancri ecc ecc non reporto mai","replies":[{"poster":"BrattishSolid6","date":"2016-05-17T09:45:58.799+0000","up_votes":1,"down_votes":1,"body":"Sono d'accordo sul fatto che la ruota giri, come lo siamo tutti eh. La Riot anche mica punisce alla prima infrazione. Se la cosa è recidiva e succede di continuo allora si passa alle punizioni (sia per gli afk che per i flamer). Entrambi (volontari o involontari) rovinano l'esperienza di gioco potenzialmente a 9 persone. \n\nE siccome non è possibile riconoscere empiricamente se l'afk è volontario o involontario, le punizioni in questione sono più lievi (niente chat restricted, niente ban, solo code più lunghe).\nPer il flame ad esempio (puramente volontario) si passa prima alle chat restricted e poi subito ai vari ban.\n\n(Poi io in particolare sono il primo sostenitore delle punizioni nei confronti dei flamer. Una giornata storta non ti dà il diritto di insultare gratis persone sconosciute. Ma queste sono opinioni)","replies":[{"poster":"Giuan91","date":"2016-05-17T10:11:25.692+0000","up_votes":2,"down_votes":0,"body":"Mi spiace ma non la penso come te qua mi sembra che ci sia un abuso di report basta un semplice esempio:come on tard follow me,arrivano valanghe di report,indubbiamente è sbagliato però questo accanimento continuo,siamo esseri umani se dobbiamo essere droni senza emozioni sia negative che positive inutile affrontare un game in compagnia","replies":[{"poster":"BrattishSolid6","date":"2016-05-17T10:56:31.035+0000","up_votes":1,"down_votes":0,"body":"Finché affronti un game con persone che conosci non vedo problemi, la critica (anche un po' più spinta rispetto al solito) è a mio parere accettabile. Ma quando ci si confronta e si comunica con persone sconosciute, a me è stata insegnata l'educazione. Chi insulta, sia pure con \"idiot\" o \"uninstall\" o \"f*** you\" (senza arrivare al \"cancer\" o altre cose più pesanti che mi pare di capire neanche tu condividi), per me è un maleducato. Non puoi sapere (tu generico) chi sta dietro l'altro schermo, non sai che problemi o che giornata può aver avuto l'altra persona. Tu sei nervoso perché oggi ti è andata male la giornata e sei arrabbiato: l'altra persona potrebbe aver avuto una giornata anche peggiore della tua ma essere di carattere diverso e non aggressivo. Risultato? Quella persona, nell'unico momento del giorno in cui può sfogarsi e rilassarsi un attimo viene insultata nuovamente. A me sembra semplicemente una cosa sbagliata. A ognuno la sua coscienza poi.","replies":[{"poster":"Giuan91","date":"2016-05-17T11:35:09.775+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=BrattishSolid6,realm=EUW,application-id=MJVj50Jw,discussion-id=hqVaOwZa,comment-id=00030000000000000000,timestamp=2016-05-17T10:56:31.035+0000)\n>\n> Finché affronti un game con persone che conosci non vedo problemi, la critica (anche un po&#x27; più spinta rispetto al solito) è a mio parere accettabile. Ma quando ci si confronta e si comunica con persone sconosciute, a me è stata insegnata l&#x27;educazione. Chi insulta, sia pure con &quot;idiot&quot; o &quot;uninstall&quot; o &quot;f*** you&quot; (senza arrivare al &quot;cancer&quot; o altre cose più pesanti che mi pare di capire neanche tu condividi), per me è un maleducato. Non puoi sapere (tu generico) chi sta dietro l&#x27;altro schermo, non sai che problemi o che giornata può aver avuto l&#x27;altra persona. Tu sei nervoso perché oggi ti è andata male la giornata e sei arrabbiato: l&#x27;altra persona potrebbe aver avuto una giornata anche peggiore della tua ma essere di carattere diverso e non aggressivo. Risultato? Quella persona, nell&#x27;unico momento del giorno in cui può sfogarsi e rilassarsi un attimo viene insultata nuovamente. A me sembra semplicemente una cosa sbagliata. A ognuno la sua coscienza poi.\n\nNon c'è dubbio che condivido in pieno tutto quello che hai scritto però bisogna anche pesare le parole,esempio:si perde un teamfight che era necessario per vincere il game ci può stare che qualcuno stia un pò nervoso rispetto a te,sta a te capire se è stato detto dal momento di frustazione o è un flamer a prescindere..però rispetto il tuo parere il mondo è bello perchè è vario","replies":[{"poster":"BrattishSolid6","date":"2016-05-17T12:05:03.664+0000","up_votes":1,"down_votes":0,"body":"Lo capisco se è UN momento, se capita quella volta dopo uno sbaglio clamoroso che fa perdere il game magari (dopo 40 minuti, toh). Ma tanta gente inizia a scrivere nei primi minuti di gioco o al primo errore, è questo che mi dà fastidio. Anche se, piuttosto, io preferisco incazzarmi a voce (io mi sfogo, l'altro non ne è vittima, tutti contenti). Ma anche queste sono opinioni, come io rispetto la tua ^^","replies":[{"poster":"Giuan91","date":"2016-05-17T12:13:10.581+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=BrattishSolid6,realm=EUW,application-id=MJVj50Jw,discussion-id=hqVaOwZa,comment-id=0003000000000000000000000000,timestamp=2016-05-17T12:05:03.664+0000)\n>\n> Lo capisco se è UN momento, se capita quella volta dopo uno sbaglio clamoroso che fa perdere il game magari (dopo 40 minuti, toh). Ma tanta gente inizia a scrivere nei primi minuti di gioco o al primo errore, è questo che mi dà fastidio. Anche se, piuttosto, io preferisco incazzarmi a voce (io mi sfogo, l&#x27;altro non ne è vittima, tutti contenti). Ma anche queste sono opinioni, come io rispetto la tua ^^\n\nesatto quelli che a prescindere flammano dall'inizio è un discorso che ci troviamo tutti e due","replies":[]}]}]}]}]}]}]},{"poster":"BrattishSolid6","date":"2016-05-17T09:01:21.207+0000","up_votes":2,"down_votes":1,"body":"Downvotami pure, questo aumenta solo la tua incoerenza.\n\nQuando le cose capitano agli altri questi si meritano il permaban e misure più severe perché sono dei _Teemo_.\n\nQuando capitano a voi stessi \"è stata una volta sola\", \"sono troppo severi\" e \"è ingiusto\".","replies":[{"poster":"Giuan91","date":"2016-05-17T09:05:59.665+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=BrattishSolid6,realm=EUW,application-id=MJVj50Jw,discussion-id=hqVaOwZa,comment-id=00030001,timestamp=2016-05-17T09:01:21.207+0000)\n>\n> Downvotami pure, questo aumenta solo la tua incoerenza.\n> \n> Quando le cose capitano agli altri questi si meritano il permaban e misure più severe perché sono dei _Teemo_.\n> \n> Quando capitano a voi stessi &quot;è stata una volta sola&quot;, &quot;sono troppo severi&quot; e &quot;è ingiusto&quot;.\n\nTi pare che a 25 anni penso ai voti...Non ho mai detto questo però capisco che forse la tua risposta non è riferita direttamente a me ma in un discorso generale sennò non avrebbe senso","replies":[{"poster":"BrattishSolid6","date":"2016-05-17T09:22:28.721+0000","up_votes":2,"down_votes":1,"body":"È in particolare riferita a te per questo post.\nÈ in generale riferita a tutti quelli che si comportano come ti stai comportando tu, che non sono pochi. Non è raro vedere post del genere","replies":[{"poster":"Giuan91","date":"2016-05-17T10:03:06.972+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=BrattishSolid6,realm=EUW,application-id=MJVj50Jw,discussion-id=hqVaOwZa,comment-id=0003000100000000,timestamp=2016-05-17T09:22:28.721+0000)\n>\n> È in particolare riferita a te per questo post.\n> È in generale riferita a tutti quelli che si comportano come ti stai comportando tu, che non sono pochi. Non è raro vedere post del genere\n\nIo sono venuto con tutta tranquillità a parlare, se hai problemi di comprendorio,non ho mai fatto riferimenti a persone si ed altre no ho raccontato la mia esperienza punto,se poi devi scrivere tanto per scrivere qualcosa allora è un'altro tipo di discorso se sono qui e per confrontarmi ne per giudicare gli altri ne per insultare quindi rileggiti il post","replies":[{"poster":"BrattishSolid6","date":"2016-05-17T11:00:11.735+0000","up_votes":1,"down_votes":0,"body":"Io sto dicendo che a te, come a TUTTI, non fa piacere avere un afk in team. Quando capita sono certo che la cosa ti dia fastidio. La stessa cosa vale per gli altri che in quel momento avevano te come afk. Nessuno qua ti sta dando colpe che non hai, tutti abbiamo avuto i nostri crash, le nostre disconnessioni, per problemi nostri, di linea o del client. Nessuno ti sta condannando. Semplicemente il programma che si occupa di rilevare gli afk (LeaverBuster) automaticamente dopo aver registrato un numero frequente di disconnessioni in relativamente poco tempo prende provvedimenti, con code più lunghe di penalità. Questo perché è impossibile determinare se l'afk è stato volontario o involontario.","replies":[{"poster":"Giuan91","date":"2016-05-17T11:31:19.671+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=BrattishSolid6,realm=EUW,application-id=MJVj50Jw,discussion-id=hqVaOwZa,comment-id=000300010000000000000000,timestamp=2016-05-17T11:00:11.735+0000)\n>\n> Io sto dicendo che a te, come a TUTTI, non fa piacere avere un afk in team. Quando capita sono certo che la cosa ti dia fastidio. La stessa cosa vale per gli altri che in quel momento avevano te come afk. Nessuno qua ti sta dando colpe che non hai, tutti abbiamo avuto i nostri crash, le nostre disconnessioni, per problemi nostri, di linea o del client. Nessuno ti sta condannando. Semplicemente il programma che si occupa di rilevare gli afk (LeaverBuster) automaticamente dopo aver registrato un numero frequente di disconnessioni in relativamente poco tempo prende provvedimenti, con code più lunghe di penalità. Questo perché è impossibile determinare se l&#x27;afk è stato volontario o involontario.\n\nScritto così hai dato tutt'altro significato,grazie per la tua opinione","replies":[{"poster":"BrattishSolid6","date":"2016-05-17T12:02:29.087+0000","up_votes":1,"down_votes":0,"body":"Intendevo questo fin dall'inizio. Scusa se non ero stato chiaro prima, non intendevo \"litigare\" né accusare","replies":[]}]}]}]}]}]}]}]},{"poster":"xKotoriH","date":"2016-05-17T10:29:46.676+0000","up_votes":1,"down_votes":1,"body":"Io ho problemi di ping e a volte da 50 ping va a 12000, torna a 500 ma viene ancora \"tent di riconnessione\" ma non si riconnette, e devo riavviare.\nEppure sono 5 mesi che non ho avvisi di afk di nessun tipo","replies":[{"poster":"Giuan91","date":"2016-05-17T10:34:54.290+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=xKotoriH,realm=EUW,application-id=MJVj50Jw,discussion-id=hqVaOwZa,comment-id=0005,timestamp=2016-05-17T10:29:46.676+0000)\n>\n> Io ho problemi di ping e a volte da 50 ping va a 12000, torna a 500 ma viene ancora &quot;tent di riconnessione&quot; ma non si riconnette, e devo riavviare.\n> Eppure sono 5 mesi che non ho avvisi di afk di nessun tipo\n\nNon so che dirti a me è stato così perciò scrivo la mia esperienza sul forum per confrontarmi con voi le vostre esperienze e giusto non è giusto ecc ecc","replies":[]}]},{"poster":"Severus Piton 19","date":"2016-05-17T08:12:25.181+0000","up_votes":2,"down_votes":1,"body":"Non serve avere un pc \"da dio\" o una connessione \"da dio\" per giocare a League of Legends. E' sufficiente avere entrambi quei fattori che ti permettano di restare in partita dal minuto 0, fino alla fine. Se ti han messo in quella coda significa che sei stato recidivo. Immagina un po' il piacere dei tuoi compagni quando si son trovati 4v5 per 5+ minuti dentro x game che hai temporaneamente abbandonato a causa dei tuoi crash. Il sistema tiene conto delle poche volte in cui a caso ti si riavvia/crasha/cade la connessione nell'arco di un bel po' di partite. Ma se capita più frequentemente che al giocatore medio, allora ti piazza giustamente in un punto in cui ti fa riflettere se sia il caso di fixare prima ogni problema relativo a pc/connessione in modo da non perdere (ma soprattutto non FAR PERDERE ai tuoi compagni) 5 o più preziosi minuti di game (nei quali può accadere di tutto).","replies":[{"poster":"Giuan91","date":"2016-05-17T09:03:32.343+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Severus Piton 19,realm=EUW,application-id=MJVj50Jw,discussion-id=hqVaOwZa,comment-id=0001,timestamp=2016-05-17T08:12:25.181+0000)\n>\n> Non serve avere un pc &quot;da dio&quot; o una connessione &quot;da dio&quot; per giocare a League of Legends. E&#x27; sufficiente avere entrambi quei fattori che ti permettano di restare in partita dal minuto 0, fino alla fine. Se ti han messo in quella coda significa che sei stato recidivo. Immagina un po&#x27; il piacere dei tuoi compagni quando si son trovati 4v5 per 5+ minuti dentro x game che hai temporaneamente abbandonato a causa dei tuoi crash. Il sistema tiene conto delle poche volte in cui a caso ti si riavvia/crasha/cade la connessione nell&#x27;arco di un bel po&#x27; di partite. Ma se capita più frequentemente che al giocatore medio, allora ti piazza giustamente in un punto in cui ti fa riflettere se sia il caso di fixare prima ogni problema relativo a pc/connessione in modo da non perdere (ma soprattutto non FAR PERDERE ai tuoi compagni) 5 o più preziosi minuti di game (nei quali può accadere di tutto).\n\nMa sicuramente è sbagliato a prescindere ed in questo caso sono stato fortunato che già era chiuso il game c'è stato propio uno shoutdown del pc ho dovuto riavviare per forza,ah finale se non sei un troll ed entri nelle ranked e le stai vincendo non avrebbe senso leavvarle","replies":[{"poster":"Severus Piton 19","date":"2016-05-17T09:20:30.117+0000","up_votes":2,"down_votes":1,"body":"No, infatti, ma non dico che il sistema debba punire solo i leaver e afk intenzionali.. E' giusto che punisca anche quelli che purtroppo (indipendentemente dalla loro volontà) non lo fanno apposta, ma che sono recidivi. Cioè, se ti capita 2-3 volte nel giro di 7 game, allora nonostante tu ci possa mettere tutta la buona volontà, è \"colpa tua\" che stai continuando a giocare PUR essendo a conoscenza dei rischi che potrebbero compromettere la partita a chicchesia","replies":[{"poster":"Giuan91","date":"2016-05-17T10:06:34.460+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Severus Piton 19,realm=EUW,application-id=MJVj50Jw,discussion-id=hqVaOwZa,comment-id=000100000000,timestamp=2016-05-17T09:20:30.117+0000)\n>\n> No, infatti, ma non dico che il sistema debba punire solo i leaver e afk intenzionali.. E&#x27; giusto che punisca anche quelli che purtroppo (indipendentemente dalla loro volontà) non lo fanno apposta, ma che sono recidivi. Cioè, se ti capita 2-3 volte nel giro di 7 game, allora nonostante tu ci possa mettere tutta la buona volontà, è &quot;colpa tua&quot; che stai continuando a giocare PUR essendo a conoscenza dei rischi che potrebbero compromettere la partita a chicchesia\n\nCondivido quello che hai scritto però ti ripeto sarei ipocrita a scrivere questo post se sono un leaver assiduo,in sette anni di league of legends si possono contare sulla mano i miei quit,un paio di giorni fa ho leavvato è vero però oggi è stato per 5 min non posso controllare un'incidente capitato all'improvviso","replies":[]},{"poster":"Subundu","date":"2016-05-17T11:50:20.012+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Severus Piton 19,realm=EUW,application-id=MJVj50Jw,discussion-id=hqVaOwZa,comment-id=000100000000,timestamp=2016-05-17T09:20:30.117+0000)\n>\n> No, infatti, ma non dico che il sistema debba punire solo i leaver e afk intenzionali.. E&#x27; giusto che punisca anche quelli che purtroppo (indipendentemente dalla loro volontà) non lo fanno apposta, ma che sono recidivi. Cioè, se ti capita 2-3 volte nel giro di 7 game, allora nonostante tu ci possa mettere tutta la buona volontà, è &quot;colpa tua&quot; che stai continuando a giocare PUR essendo a conoscenza dei rischi che potrebbero compromettere la partita a chicchesia\n\n^this\n\nLa mia connessione fa schifo, ho provato di tutto tranne cambiare il pc o passare da alice a qualcos'altro ma niente, è totalmente imprevedibile e ogni tanto dal nulla crasha tutto e devo riavviare pc e routher; aggiungiamo che quando faccio quest'operazione il processore sembra friggere e per riavviare ci mette il doppio del solito.\n\nPerò...ai miei mates cosa gliene può fregare? loro entrano in game per giocare a pari condizioni con gli oppo, magari sono in promo o in lotta per non scendere e in quella partita danno tutto. Io, per quanto apparentemente senza colpe, gli sto rovinando il game. E' giusto che io sia punito. Finchè la riot mi mette nelle condizioni ottimali per giocare (server che funziona ecc) il resto sono affari miei. \n\nCome si è tradotto questo nella pratica? dopo una paio di leavebuster minori e due con un'attesa da 20 min per 5 code ho smesso di giocare ranked da almeno un paio di mesi e gioco solo normal o aram. Mi rompo le scatole a non poter rankare, ma vista l'antipatia che mi fanno i leavers perchè dovrei essere uno di loro, sebbene non intenzionale?\n\nA ciò si aggiungono chili di frustrazione in meno...non hai idea delle bestemmie che mi venivano quando ero l'unico feedato o che in qualche modo stava tenendo o facendo vincere il game e mi saltava tutto...mi è successo una marea di volte...5 min per riconnettermi e mi beccavo gli insulti (giusti purtroppo, non potevo rispondergli niente...) e i report dei mates con partita persa annessa chiaramente... ","replies":[]}]}]}]},{"poster":"Laiho88","date":"2016-05-17T08:46:28.142+0000","up_votes":2,"down_votes":1,"body":"non sempre la colpa è del pc o della connessione, è proprio il client che è buggato, a volte rimane proprio bloccato nella schermata di caricamento della partita ed è un fatto risaputo.....","replies":[{"poster":"Giuan91","date":"2016-05-17T08:48:19.505+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Laiho88,realm=EUW,application-id=MJVj50Jw,discussion-id=hqVaOwZa,comment-id=0002,timestamp=2016-05-17T08:46:28.142+0000)\n>\n> non sempre la colpa è del pc o della connessione, è proprio il client che è buggato, a volte rimane proprio bloccato nella schermata di caricamento della partita ed è un fatto risaputo.....\n\npurtroppo a me è stato un problema di pc schermata nera ho dovuto riavviare","replies":[]}]},{"poster":"BeardSergio","date":"2016-05-17T09:28:46.790+0000","up_votes":2,"down_votes":1,"body":"Come già spiegato mille milla volte le punizioni non avvengono per 1 singolo episodio. Il sistema che assegna code a bassa priorità è automatico e conteggia solo le occasioni dove il problema non è imputabile ai server riot.\nCapisco il fastidio ma accusare sempre gli altri per la propria condotta (andare afk in questo caso) non è costruttivo.","replies":[]},{"poster":"Hell88","date":"2016-05-19T00:09:32.531+0000","up_votes":1,"down_votes":1,"body":"perma ban per gli afk.----->fine","replies":[]},{"poster":"Dantazzo","date":"2016-05-17T08:08:26.735+0000","up_votes":1,"down_votes":2,"body":"La mia opinione è che se uno ha un pc a criceti e la connessione che aveva Gesù (che ci ha messo 3 giorni per spawnare) non dovrebbe giocare a giochi on-line multiplayer, rovina solo il gioco agli altri.\nE comunque sei andato afk un pò di volte se ti è arrivata la punizione.","replies":[{"poster":"Giuan91","date":"2016-05-17T08:12:39.946+0000","up_votes":1,"down_votes":1,"body":"Si era un modo di dire è chiaro che un minimo di equip lo devi avere,che io ricordi solo due giorni fa  sono andato diretto afk senza rientrare però qua non è stato per mia volonta cioè stavano al surrender io sono crashato poi vedendo che ero crashato hanno continuato e appena rientrato l'abbiamo chiusa,comunque a me sembrano regole troppo rigide","replies":[{"poster":"Kazushi San","date":"2016-05-17T08:15:20.535+0000","up_votes":1,"down_votes":1,"body":"Rigide? Ensomma","replies":[]}]}]}]}