{"poster":"Shyam","date":"2015-06-09T17:34:26.059+0000","title":"Possibile drophack e mi sono pure preso un report per non aver fatto niente","subforum":"Aiuto e supporto","up_votes":2,"down_votes":2,"body":"Stavamo facendo una normalissima partita in normal in summoner&#039;s rift. Ad un certo punto il mio ping &egrave; salito a 500 fisso ed &egrave; apparsa la scritta &quot;tentativo di riconnessione in corso&quot;, ho aspettato per 30 min., avendo preventivamente fatto uno screen di tutti i giocatori in partita. Quando mi sono deciso ad uscire dal game mi sono ritrovato nella chat del match gi&agrave; finito da non so quanto, dove i miei compagni di squadra avevano chiesto di reportarmi perch&egrave; ero andato AFK ed un avviso di leavebuster che diceva di scrivere accetta e che non avrei lasciato altre partita. Questa cosa mi ha fatto altamente incazzare, perch&egrave; non solo ho perso un sacco di tempo cercando di rimanere connesso, ma mi sono preso pure un report, cosa mai successa prima visto che non ragequitto mai, non flammo e gioco sempre fino all&#039;ultimo anche se siamo 3vs5 o 100 kill a 0 visto che ritengo sia la cosa pi&ugrave; giusta da fare. A qualcuno e successa la stessa cosa? Come posso evitare che una cosa del genere risucceda, ci tengo molto che il mio account sia &quot;pulito&quot; e proprio per questo tengo sempre un comportamento esemplare, suggerimenti?","replies":[{"poster":"BluFoxer","date":"2015-06-09T21:29:10.809+0000","up_votes":1,"down_votes":0,"body":"Sai,  io non mi sono mai lamentato di problemi col client duranti questo periodo di DropHack, ma ultimamente succede la stessissima anche a me: ping a 500 e tentativo di riconnessione nonostante io abbia tutto normale.\nSperiamo risolvano presto.\n{{champion:9}}","replies":[]},{"poster":"Axelney","date":"2015-06-09T18:12:57.583+0000","up_votes":1,"down_votes":0,"body":"se ti è apparso il dialogo che ti chiedeva di scrivere \"sono d'accordo\" significa che non hai mai lasciato una partita prima d'ora quindi tranquillo, ti puniscono solo se vai afk in un certo numero di partite, che dipende dal numero di partite che giochi e all'interno di quanto tempo.","replies":[]}]}