{"poster":"Tré Cool","date":"2016-12-20T15:49:46.763+0000","title":"Garen y Kayle","subforum":"Charlas Generales","up_votes":1,"down_votes":9,"body":"**GAREN:**\nMe parece totalmente rid&iacute;culo e innecesario el buff que le hicieron, no se le puede counterear con casi nada y tiene tremendo early game por su **E**, aunque no sea la habilidad maxeada. Cabe recalcar que si tiene un muy buen early game, va a tener muy buen mid y late game.\nPodr&iacute;an reducir la cantidad de armadura que quita con su **E** en early y dejarla como esta en mid game y late game. Sumemosle que en early sus cd&#039;s son bajos y que sus habilidades no cuestan man&aacute;.\n\n**KAYLE:**\nOtro campe&oacute;n m&aacute;s. Buen early, se la puede llevar a TODAS las l&iacute;neas y las va a ganar igual solo con buildearse velocidad de ataque.\nEXAGERADO DPS tiene, si a eso le sumamos que tiene una habilidad que la cura y le da velocidad de movimiento, otra habilidad que realentiza, y OTRA HABILIDAD QUE LA CONVIERTE EN RANGED yo creo que esta bastante rota. Ni siquiera hay que mencionar su ultimate **(CON LA QUE PUEDE DIVEAR A CUALQUIER CAMPE&Oacute;N EN EARLY)** este campe&oacute;n es tremendamente abusivo, en top, por ejemplo, no podes jugarle ni con un tanque, ni con un ranged. Si sos tanque, abusa de que ella es ranged. Y si sos ranged, sos un papel, por lo tanto abusa de su da&ntilde;o. Ni siquiera podes farmear bajo torre porque cada tanto te va a pegar con sus autoataques potenciados y cuando estes a poca vida te divea con su ultimate sin sufrir. Este campe&oacute;n puede vivir a base de su habilidad **E** casi sin gastar man&aacute;. \n\n\nSi alguien tiene alg&uacute;n consejo para jugar en contra de estos dos personajes, com&eacute;ntenmelo.\nSaludos y gracias de antemano.","replies":[{"poster":"Lince Salvaje","date":"2016-12-20T16:06:15.107+0000","up_votes":3,"down_votes":0,"body":"No son campeones desbalanceados en realidad.\nson bastante facil de counterior el tema es que les sepas jugar en contra.\n\ncontra garen cualquier cosa con cc es suficiente.\n{{champion:150}} +{{item:3022}} \nTops convencionales \n{{champion:122}} {{champion:31}}{{champion:80}} {{champion:83}} {{champion:48}} {{champion:14}} {{champion:106}} {{champion:102}} {{champion:2}} {{champion:86}} {{champion:126}} {{champion:420}} {{champion:98}} \ncon cualquiera de esos tops le puedes ganar facilmente a garen, algo tank o con cc o rango le gana facil.\nTops Poco convencionales\n{{champion:74}} {{champion:30}} {{champion:1}} {{champion:105}} {{champion:20}} {{champion:133}} {{champion:67}} {{champion:44}} {{champion:254}} {{champion:26}} {{champion:143}} \ncon cualquiera de estos tabn podrias ganarle.\nla idea es correr cuando te tire qua la Q y tratar de evitar el combo Q+E\n\nContra kayle no te puedo decir mucho porque no la suelo encontrar pero uso casi lo mismo que con garen\nhay mas campeones pero esos son los que veo facil para conunteriarle","replies":[{"poster":"Tré Cool","date":"2016-12-20T16:34:04.403+0000","up_votes":1,"down_votes":1,"body":"Acabo de jugar con Gnar contra Garen, a pesar de que mi jungla no tuvo presencia en top, y que me campearon.\nIntenté sacar mazo helado de primer item pero me fue imposible.\nTodo lo que tenga movilidad o un considerable aumento de velocidad de movimiento normalmente es counter de Gnar.\nClaro está que además el rival tiene que saber usar al campeón contra el que te enfrentes y demás.\nIgualmente no usaba a Gnar hace como 2 meses y estaba un poco (solo un poco e.e) frío. \n\nY contra Kayle de esos tops que dijiste solo puedo recomendarte a fizz y tal vez a jayce.\nLos demás se vuelven inútiles contra este campeón.\n\nSaludos y gracias por el consejo","replies":[{"poster":"Lince Salvaje","date":"2016-12-20T16:54:06.059+0000","up_votes":2,"down_votes":0,"body":"Veamos algo....\nNO sabes usar gnar....\nsi los colosos fueran dioses gnar seria kratos...\nes el campeón con el que mas puedes abusar de estos personajes...\nsi garen se tira la Q tu tiras Q+E y listo.\nlo ralentizas con la Q y si saltas sobre un minion llegas mas lejos por lo cual el daño que pudiera causarte se anula.\nEn cuanto a la fase de lineas es facil metes una Q y tratas de meterle 2 básicos para activar la pasiva de la W.\nCuando estas en mega es donde te puede dar alguna complicacion pero es solo durante unos segundos ademas a lvl 6 ya tienes 2 stuns (W+R) con lo cual le puedes meter un daño considerable.\n\nComo te dije al comienzo NO SABES USAR A GNAR...\npor eso te parece tan complicado o roto.\nNo he visto Garen que salga bien parado después de jugar contra gnar (sin que los jg se metan)\n\ny ni hablemos si sacas {{item:3022}}  con eso garen ni te toca y tampoco se puede escapar entre las 2 relentizaciones ({{item:3022}} +Q) es imposible que no lo mates o que el no sufre en linea.","replies":[{"poster":"Tré Cool","date":"2016-12-20T17:07:06.719+0000","up_votes":1,"down_votes":0,"body":"SI, hice lo de Q+E. Sus cd's son menores a los míos, por lo tanto ahí es cuando abusa.\nEn mi caso el jg contrario se metió (y bastantes veces) eso arruinó mi early-mid game y por eso no pude sacar el mazo helado. \nPara colmo, siendo mini gnar sos un papel si vas contra un Garen y un Rammus.\nGaren se hizo AD, así que en los trades sufría mucho más que contra un Garen con una build común/standart, pero normalmente no había trades, ya que yo estaba bajo torre porque su jg tenía presencia y el mío no y no podía pushear o frizzear línea sin que este gankeara.","replies":[{"poster":"Lince Salvaje","date":"2016-12-20T17:15:10.207+0000","up_votes":1,"down_votes":0,"body":"La E de gnar tiene bastante Cd PERO.... puedes usar Q+W  la velocidad de movimiento que te da es suficiente para escapar de garen y no tiene CD altos. facilmente puedes tradearle y salir victorioso.\n\nAhora me pones una situación totalmente diferente.\nme pones un jg con un provocar y un garen totalmente ad....\ntu que esperas ? que la situación siga igual?\nSi cambiamos las cosas a mitad de discucion yo te puedo decir que tu jg deberia de ayudar, tu tankearte y jugar defensivo si sabes que hay un jg campeando en linea para potenciar un garen.\nTe guardas la E para cuando te gankeen y listo pockeas y cosas con tu Q que no tiene cd alto.\n\n\nTe lo dice alguien que tiene a gnar y garen en su sección de picks seguros. :)\nComo consejo aparte aprende a usar a garen, entiéndelo y al entenderlo tabn vas a entender por donde puedes atacarlo","replies":[{"poster":"Tré Cool","date":"2016-12-20T17:25:13.931+0000","up_votes":1,"down_votes":0,"body":"Lo dije a la mitad de la discusión porque en el post hablaba de Garen, no de mi situación (si me tratas de mentiroso corroborá lo que te digo con mi historial).\nMe guardaba el salto para los ganks pero era imposible escaparme, Rammus corre mucho y más con fantasmal. \nY no iba totalmente AD, me refiero a que su primer item fue una Cuchilla Oscura y no algo defensivo.\nYo también esperaba que mi jungla me ayudara. Y jugaba defensivo, porque como dije antes: \"yo estaba bajo torre porque su jungla tenía presencia y el mío no y no podía pushear o frizzear la línea sin que este gankeara.\"\nIgualmente, gracias por el consejo, saludos.","replies":[{"poster":"Lince Salvaje","date":"2016-12-20T17:30:31.200+0000","up_votes":1,"down_votes":0,"body":"Donde dije que eras un mentirosos ?\nyo comencé dandote consejos contra Garen en particular, independientemente de la situación te dije que campeones serian buenos para conuteriarle.\nme especializo mas en gnar que en cualquiera de los otros asique puedo opinar mas con gnar que lo destroza a garen...\n\npero me saltas diciendo que no porque te paso que el jg te campeo y garen te morfaba vivo....\nEntonces la situación cambia y los consejos que te doy en particular contra garen solo en linea no funcionan del todo bien.\n\nte dije arma bien la historia que vas a contar con todo los detalles y en base a eso nosotros damos nuestra opinión...\ncomenzaste pidiendo consejos en general y después sacas un caso en particular :l","replies":[{"poster":"Tré Cool","date":"2016-12-20T17:42:05.530+0000","up_votes":1,"down_votes":0,"body":"Parecía que me tratabas de mentiroso por \"Ármate bien la historia y después nos la cuentas xD\"\nSaque mi caso en particular por \"NO saber usar a Gnar\".\nAl comienzo del post yo hablaba de Garen, no de mi caso. Después, respondieron ustedes y para que vean que no soy tan malo como dicen (aunque estoy comenzando a jugar campeones que no tocaba hace mucho tiempo, por ejemplo, Gnar) expuse mi caso en particular.\nSi tenés algún consejo para counterear mi situación bienvenido sea xD","replies":[]}]}]},{"poster":"BUSCANDO A JORGE","date":"2016-12-20T17:17:04.533+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Lince Salvaje,realm=LAS,application-id=v7qsfXsE,discussion-id=fMY3hEaQ,comment-id=00000000000100000000,timestamp=2016-12-20T17:15:10.207+0000)\n>\n> La E de gnar tiene bastante Cd PERO.... puedes usar Q+W  la velocidad de movimiento que te da es suficiente para escapar de garen y no tiene CD altos. facilmente puedes tradearle y salir victorioso.\n> \n> Ahora me pones una situación totalmente diferente.\n> me pones un jg con un provocar y un garen totalmente ad....\n> tu que esperas ? que la situación siga igual?\n> Si cambiamos las cosas a mitad de discucion yo te puedo decir que tu jg deberia de ayudar, tu tankearte y jugar defensivo si sabes que hay un jg campeando en linea para potenciar un garen.\n> Te guardas la E para cuando te gankeen y listo pockeas y cosas con tu Q que no tiene cd alto.\n> \n> \n> Te lo dice alguien que tiene a gnar y garen en su sección de picks seguros. :)\n> Como consejo aparte aprende a usar a garen, entiéndelo y al entenderlo tabn vas a entender por donde puedes atacarlo\n\nQ+E, y si se escapa R.","replies":[{"poster":"Lince Salvaje","date":"2016-12-20T17:22:39.480+0000","up_votes":1,"down_votes":0,"body":":v y bueno pero a ver si asi se da cuenta de como jugarle...\ntalves ve a alguien jugando con x campeon y le rompe el *....\nahi entra en razón y dice \"ah asique x campeon sirve contra garen, que izi vieja :v\"","replies":[]}]}]}]}]},{"poster":"Kyousuke","date":"2016-12-20T16:38:01.431+0000","up_votes":1,"down_votes":0,"body":"emm perdón si suena muy duro pero... aprende a jugar.\ngnar es el counter PRINCIPAL de garen, es el pj que mas abusa de el en linea y puede ganarle sin problema, si un garen te gana con ese enano pesado ya es asunto aparte.\nvelocidad de movimiento gana a gnar? sabes que tiene un slow que apenas tiene cd no? y que tiene un salto para cuando se te acerque verdad? ademas de que conseguís un aumento de velocidad si le das 3 básicos. es IMPOSIBLE que gnar pierda contra garen ","replies":[{"poster":"Tré Cool","date":"2016-12-20T16:45:17.704+0000","up_votes":1,"down_votes":0,"body":"No, Gnar **ERA** uno de los counters principales de Garen, pero con este nuevo buff tiene posibilidades contra él (Gnar).\nLos counters principales del \"nuevo\" Garen serían rangeds con cc como Quinn, Vayne, Annie, Kennen, Swain, y hay mas pero no los voy a mencionar a todos.\nY si pedí consejos, es para aprender a jugarle en contra, así que obviamente tengo que aprender a jugarle.\nY si me decís que Gnar es un \"enano pesado\" supongo que lo odias bastante y crees que está roto...","replies":[{"poster":"Kyousuke","date":"2016-12-20T17:04:46.390+0000","up_votes":1,"down_votes":0,"body":"te explico el cambio de garen fue para abusar de los mele al quitarles la armadura. un garen a un gnar BUENO no lo alcanza ni a tocar, en cuanto garen mete su Q para acercarse le metes slow y adiós intento de inicio, tenes un salto que con eso garen no te alcanza y mas si saltas sobre un súbdito, garen no tiene gap-closer osea que no tiene forma alguna de acercarse a gnar en su mini, y en el mega si se acerca se come un stun en toda la boca y gg garen.\ngnar es RANGED también :D por algo es counter principal, si un garen logra meterte los 4 tics con la E algo estas haciendo MUUY mal. y si lo odio a gnar pero no pienso que este roto, el stun del mega a ultimo rango es algo absurdo pero ademas de eso solo es pesado y molesto no roto. \ny al comienzo del post no pedís consejos sino que estas quejándote del campeón por que te gana y no sabes jugarle XD","replies":[{"poster":"Tré Cool","date":"2016-12-20T17:13:58.908+0000","up_votes":1,"down_votes":0,"body":"Leíste el post entero? Porque **pedí consejos al final del post**.\nSabes por qué me ganó? **Porque su jungla tuvo presencia y el mío ni pisó la línea**.\nSi bien Garen no tiene gap-closer, el **Rammus jungla con fantasmal si lo tiene**.\nDe ahí mi \"error\" según vos. **No podía frizzear ni pushear porque Rammus siempre estaba ahí**.\nY tenía que dejar que pushee esperando a que mi jungla viniera, pero **Gnar es un papel contra un Garen y un Rammus, incluso abajo de torre**.","replies":[{"poster":"BUSCANDO A JORGE","date":"2016-12-20T17:16:18.011+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Retrox25,realm=LAS,application-id=v7qsfXsE,discussion-id=fMY3hEaQ,comment-id=000000000000000000000000,timestamp=2016-12-20T17:13:58.908+0000)\n>\n> Leíste el post entero? Porque **pedí consejos al final del post**.\n> Sabes por qué me ganó? **Porque su jungla tuvo presencia y el mío ni pisó la línea**.\n> Si bien Garen no tiene gap-closer, el **Rammus jungla con fantasmal si lo tiene**.\n> De ahí mi &quot;error&quot; según vos. **No podía frizzear ni pushear porque Rammus siempre estaba ahí**.\n> Y tenía que dejar que pushee esperando a que mi jungla viniera, pero **Gnar es un papel contra un Garen y un Rammus, incluso abajo de torre**.\n\nAh, significa que ademas de ser malo, culpas a otros de ser malo?","replies":[{"poster":"Tré Cool","date":"2016-12-20T17:18:24.344+0000","up_votes":1,"down_votes":0,"body":"No, digo que a pesar de que no maineo Gnar, Garen tuvo ayuda y yo no y yo estaba en total desventaja gracias a que los dos eran tanques y me podían divear fácilmente.","replies":[{"poster":"Lince Salvaje","date":"2016-12-20T17:24:24.376+0000","up_votes":1,"down_votes":0,"body":"Garen era tank o ad decídete xD..\nÁrmate bien la historia y despues nos la cuentas xD","replies":[{"poster":"Tré Cool","date":"2016-12-20T17:28:10.697+0000","up_votes":1,"down_votes":0,"body":"A ver, el rol principal de Garen es ser tanque y con la pasiva de la W es bastante tanque.\nYo dije que Garen se hizo AD (o sea que se hizo Daño de Ataque), no que se hizo full AD.\nNuevamente, si me tratas de mentiroso corroborá lo que te digo con mi historial.\nSaludos.","replies":[]}]}]}]}]}]}]}]}]},{"poster":"Harryernes","date":"2016-12-20T16:38:29.272+0000","up_votes":1,"down_votes":0,"body":"Garen le gana a Garen? Es como en Pokémon, que dragon es super efectivo contra dragon? :v","replies":[{"poster":"Lince Salvaje","date":"2016-12-20T16:56:02.879+0000","up_votes":1,"down_votes":0,"body":"obviamente...\nSi 2 Garen se enfrentan quien crees que gana ?\n:V","replies":[{"poster":"Harryernes","date":"2016-12-20T16:59:52.681+0000","up_votes":1,"down_votes":0,"body":"El que gire mas rapido :v\n\n\n\n\n\n\n\n\n\n¡Es Beyblade! ♫ ♪ :v","replies":[]}]}]}]},{"poster":"weepa","date":"2016-12-20T22:32:38.264+0000","up_votes":1,"down_votes":0,"body":"amigo jajajaja es cualquiera lo que decis esos 2 campeones son facilmente neutralizables segui practicando antes de quejarte jaja","replies":[]},{"poster":"Ks Erwyn","date":"2016-12-20T20:00:45.020+0000","up_votes":1,"down_votes":0,"body":"iirli....","replies":[]},{"poster":"Sirek","date":"2016-12-20T17:38:14.107+0000","up_votes":1,"down_votes":0,"body":"Kayle es DPS hibrido.... no te va a burstear y quitarte 3/4 de vida con un combo, hacerte Randuin {{item:3143}} no es mala idea ya que le bajaras la velocidad de ataque, su ulti dura unos segundos.\n\nPara tradearle debes esperar a que su E la tenga en CoolDown. Si farmeas a lo loco, ella va a abusar de ti. Pre lvl 6 es bastante débil y no tiene una ulti que la proteja, si vas darius (Si, revise tu historial) obviamente va a abusar de ti ya que en late eres un abusivo, pero si lo logras agarrar pre lvl 6 con la E, no te aguantara el daño. \n\nOJO, si jugaste contra Kayle y empezaste con el escudo de Doran... obvio que te va a destrozar. \n\nhttp://www.salsalol.com/campeones/kayle\n\n\nContra Garen tienes muchas opciones, por ejemplo Trundle, Jayce o Illaoi. \n\nhttp://www.salsalol.com/campeones/garen","replies":[{"poster":"Tré Cool","date":"2016-12-20T17:50:22.053+0000","up_votes":1,"down_votes":0,"body":"Si, iba a hacerme Randuin pero gracias al excesivo AP que tenía, tuve que ir por la {{item:3065}} de primer item.\nElla tenía CDR en early así que no pude su E casi que no tenia CD, y cuando la tenía en CD, se retiraba y luego volvía (cuando ya la tenía de vuelta). El tema de Darius es que es muy fácil de counterear por rangeds (siempre y cuando estos se posicionen bien): Gnar, Quinn, Vayne, Jayce, Kennen Kayle, etc.\nKayle se mantenía distante pre-level 6 y se me hacía muy difícil agarrarla. Las veces que la agarraba, ella me tiraba el slow y se curaba y obtenía el boost de velocidad de movimiento.\nPero yo no hablaba de mi situación, que en esa partida manqueé bastante, hablaba del campeón que esta muy fuerte en todas las etapas de la partida. \nSaludos y gracias por los consejos n.n","replies":[{"poster":"Sirek","date":"2016-12-20T18:06:45.719+0000","up_votes":1,"down_votes":0,"body":"1) Si vas contra un AP siempre empieza con {{item:1033}} y potas.... juega a farmear y a esperar el gank... si no te gankea el JG aprende a jugar defensivo de 1/4 de la linea hacia atrás... pegado a la torre pero que esta no le pegue a los minions enemigos.\n\n2) Si debes dejar pasar algunos minions para evitar comerte daño innecesario... hazlo....  \n\n3) Si kayle farmea con la E, espera a que se le acabe (Recuerda que cuando pega a distancia es un periodo de tiempo). Aprende el CD de su E (Creo que es de 16 Seg en early, si alguien me corrige ideal). \n\nDarius es cabezasos y penta... es un tanque abusivo que si no lo controlas en early tienes un mounstruo adelante... obvio que si yo como jg me toca en contra un darius y en mi team una Kayle, voy a campear top para tener un problema menos. ","replies":[]}]}]},{"poster":"BUSCANDO A JORGE","date":"2016-12-20T17:14:26.000+0000","up_votes":1,"down_votes":0,"body":"Ay po, nautilus le gana facil shabal.\n\nTe podría decir {{champion:105}} hibrido en ambos casos, pero me da igual.","replies":[]},{"poster":"Xan Irelia","date":"2016-12-20T16:10:18.245+0000","up_votes":1,"down_votes":0,"body":"No se jugarles la verdad, los siento muy fuertes en especial Garen, coincido que su buff fue algo totalmente innecesario, no sé en qué estaban pensando cuando lo hicieron.\nRespecto a Kayle solo creo que en las manos correctas está rota, realmente no me crucé con ninguna que me haga la partida imposible.","replies":[]}]}