{"poster":"EMANUEL","date":"2015-05-10T17:34:46.625+0000","title":"rek sai o hecarim jungla ???","subforum":"Guias y consejos","up_votes":1,"down_votes":0,"body":"hola , quisiera saber cual de estos dos personajes me va a servir mas en jungla , cuales son las ventajas y desventajas de cada uno . gracias por comentar","replies":[{"poster":"LaReinaPingüino","date":"2015-05-10T22:06:05.211+0000","up_votes":2,"down_votes":0,"body":"Pero rek sai pude llegar a cualquier parte del mapa en un pestañeo con su ultima","replies":[]},{"poster":"Rüediger","date":"2015-05-10T19:11:46.770+0000","up_votes":1,"down_votes":0,"body":"Algo que diferencia (En mi opinion) enormemente a {{champion:120}} y {{champion:421}} es el sustain de uno en una Teamfight. \nAmbos son buenos en una teamfight,siendo los que la mayoria de veces la empiezan,pero la W de {{champion:120}} hace que el 20% del daño que reciban sus enemigos de cualquier fuente (Ulti de {{champion:122}} , R de {{champion:45}} poniendo ejemplos) se transfieran a el como vida. Esto hace que si tiene un team con mucho burst (como los 2 ejemplos anteriores) se vuelve un Pony Inmortal que ni la torre del nexo lo mata. \n\n {{champion:421}}  Tambien tiene sustain...pero solo en su forma enterrada,y solo puede hacer daño con su Q en esa forma,lo cual hace que su equipo pierda mucho daño si llega a tener que regenerar vida enterrándose.\n\nCambiando de tema,ambos campeones tienen buen daño en área,son una maquina de gankear impresionante,tienen buen sustain y un CC bastante bueno. El early del pony es algo debil pero el late es muy bueno,mientras que Rek(t)'Sai tiene un early bastante bueno pero pierde algo de daño y potencial (Poco,casi nada) en late.\n\nTodo eso fue mi opinión. Ahora depende de vos en elegir en quien gastar los PI!\nSaludos.","replies":[{"poster":"EMANUEL","date":"2015-05-10T19:28:55.519+0000","up_votes":1,"down_votes":0,"body":"MUCHAS GRACIAS ;)","replies":[]}]},{"poster":"Teto3001","date":"2015-05-10T19:05:05.154+0000","up_votes":1,"down_votes":0,"body":"Son mis dos mains.  Ventajas y desventajas no sabria decirte los dos limpian bien la jungla y gankean re bien.  Ambos son divertidos de usar y te recomiendo que compres a los 2. La unica ventaja que le veo a hecarim es que tambien esta muy bueno en top a diferencia de rek a quien solo la uso en la jungla.","replies":[]}]}