{"poster":"Vektorized","date":"2015-07-25T12:48:45.320+0000","title":"Es heißt ich habe \"gehackt\"","subforum":"Spielerverhalten & Moderation","up_votes":1,"down_votes":2,"body":"Hi! \r\nIch w&uuml;rde gerne wissen, ob ich mich vor einem bann f&uuml;rchten muss, obwohl ich nichts getan hab.\r\nIch hatte ein Spiel mit Zed wo ich gecarried habe!\r\nDanach hat mich einer angeschrieben, da&szlig; ich gehackt habe.\r\nEin Spieler: i reported you at Riot Support for Cheating just wanna let you know\r\nEin Spieler:ofc i have proofs send to riot im sry \r\n\r\nDanke f&uuml;r eure Hilfe!\r\nLG Dr4Viki","replies":[{"poster":"Jum4nji","date":"2015-07-25T13:33:41.872+0000","up_votes":1,"down_votes":0,"body":"Mit Humor nehmen. :)\n\nMir ist das auch mal passiert, dass die gegnerische MF behauptet hat ich skripte als Akali. Nach dem Game Hab ich ihn geaddet und ihn nach dem Reddit-Link gefragt der zu dem post führen sollte. Er hat gesagt, dass es Spaß war und manche Spieler leaven oder \"pls dont do it\" schreiben. :D\n\nUnd das ist schon ziemlich witzig eig :)\nWie spielen heute noch manchmal zsm.","replies":[{"poster":"Alustus","date":"2015-07-25T15:46:54.670+0000","up_votes":2,"down_votes":0,"body":"Ist ja eigentlich ein kompliment wenn dich jemand des Cheaten bezichtig.\n\nDa bedeutet nämlich dass ich besser spiele als es für den gegner möglich ist ;)","replies":[{"poster":"hshtagniemehrcdu","date":"2015-07-25T17:18:30.561+0000","up_votes":3,"down_votes":0,"body":"> [{quoted}](name=Alustus,realm=EUW,application-id=KYnfKGf0,discussion-id=ddaooLJ4,comment-id=00030000,timestamp=2015-07-25T15:46:54.670+0000)\n>\n> Ist ja eigentlich ein kompliment wenn dich jemand des Cheaten bezichtig.\n> \n> Da bedeutet nämlich dass ich besser spiele als es für den gegner möglich ist ;)\n\nEs sein denn du spielst CoD 2 und man kann über einen Kick abstimmen...","replies":[]}]}]},{"poster":"Sirrkas","date":"2015-07-26T10:05:33.291+0000","up_votes":2,"down_votes":0,"body":"Keine Angst, ich wurde auch schon mal fürs \"cheaten\" gemeldet, weil wir Duotop gespielt haben. Da passiert gar nichts.","replies":[]},{"poster":"drexxsack","date":"2015-07-25T12:53:45.898+0000","up_votes":2,"down_votes":1,"body":"Ich weiß ganz genau, dass du gestohlen hast, ich habs genau gesehen! Was glaubst du würde passieren, wenn ich sowas behaupte? Richtig, nicht viel. Du wirst vielleicht mal überprüft, das wars aber auch schon.\nVorraussetzung ist halt, das du sauber bist.","replies":[{"poster":"Vektorized","date":"2015-07-25T13:15:56.645+0000","up_votes":1,"down_votes":0,"body":"Ist aber schon sehr frech sowas zu machen..","replies":[{"poster":"GG Izzie","date":"2015-07-25T13:23:56.682+0000","up_votes":2,"down_votes":0,"body":"Kleine Kinder, Rager, dumme Leute, jemand der sich seinen Fehler nicht eingestehen kann, Jemand der immer der Beste sein will und daher MUSST du gehackt haben: denn er ist doch der Pro.... ehm ja so könnte ich ne Weile weiter machen. \nAber merkst bestimmt schon... das Wort \"frech\" ist eher ne Liebkosung für die Dreistigkeit die sich viele hinter ihrem Internet Pseudonym erlauben^^","replies":[{"poster":"Hibernius Riesig","date":"2015-07-26T07:13:40.824+0000","up_votes":1,"down_votes":0,"body":"Wobei man sagen muss, dass man sich im Eifer des Gefechts auch gerne mal Dinge einbildet. Ich hatte zum Beispiel mal einen Yasuo als Gegner, welcher IMMER seine Windwall in meine Richtung genau dann aktiviert hat, sobald ich auch nur einen Skill eingesetzt habe. Oh und dabei war egal ob ich in seinem Sichtfeld war, im Busch oder außerhalb seines sichtfeldes, z.B. hinter einer Wand, stand. \nDiesen Spieler habe ich auch auf Verdacht gemeldet, da aber nicht passiert ist war es wohl nur ein sehr schreckhafter Spieler und ich habe mir das nur eingebildet ^^\nAlso, wenn du sauber bist brauchste dir keine gedanken machen.... hast du gescripted oder sowas, dann stellt Riot das fest und bestraft dich.","replies":[]}]}]}]},{"poster":"DavidDeamon","date":"2015-07-25T13:48:24.919+0000","up_votes":1,"down_votes":3,"body":"Dann freu dich doch. Vielleicht bekommst du ein Jobangebot von Roit, weil du Sicherheitslücken entdeckt hast. Leute mit deinem Knowhow würde ich abwerben und nicht ihre Spielaccounts bannen. :)","replies":[{"poster":"skilsor","date":"2015-07-25T16:13:48.775+0000","up_votes":2,"down_votes":0,"body":"Er hat doch gesagt, dass er nichts getan hat.","replies":[]}]},{"poster":"TurtleMari","date":"2015-07-28T12:46:14.724+0000","up_votes":1,"down_votes":0,"body":"Das hatte ich auch mal. \nWar als Heimerdinger auf der Midlane und \nda die Gegner mich gnadenlos gefeedet haben,\nbzw. meine Kanonen ignoriert hatten, haben diese\nirgendwann geschrieben, dass ich hacken würde \nindem ich ein Zhonyas einsetzen würde, dass ich gar\nnicht habe (angeblich). Natürlich hatte ich ein Zhonyas,\ndie waren einfach nur salzig weil sie nicht wussten wie man\ngegen Heimerdinger spielt. ^-^\n\nWenn du nichts getan hast, kann dir nichts passieren.\nIch hab schon sooft gehört, dass mich wer wegen \ngrundlos melden wollte. Ist mir ziemlich egal, da ich\nnichts gemacht habe/tue was irgendwie in negatives\nVerhalten übergeht.","replies":[]},{"poster":"Baskiney","date":"2015-07-27T19:12:06.702+0000","up_votes":1,"down_votes":0,"body":"Ich wurd für nen einzelnen Flash über ne knappe Graves Q auch mal als scripter bezeichnet und von jenem dann gemeldet. Sowas kannst du als Kompliment nehmen, da du ja anscheinend nicht das Spiel modifizierst musst du auch nichts befürchten. :D","replies":[]},{"poster":"Temudschinn","date":"2015-07-26T09:59:59.651+0000","up_votes":1,"down_votes":0,"body":"Nimms als Kompliment und sorg dich nicht :)","replies":[]},{"poster":"oasterlukas","date":"2015-07-25T13:05:19.088+0000","up_votes":1,"down_votes":0,"body":"Die reden doch nur so daher, die trauen sich sowas sicher nicht an Riot support zu senden :)","replies":[]},{"poster":"nOeTHe","date":"2015-07-25T19:31:13.626+0000","up_votes":2,"down_votes":2,"body":"Bereite dich lieber auch mal auf ne Jugendstrafe vor, denn ich habe dich bei der Polizei angezeigt, ich habe auch Beweise, sorry, aber so kannst du dich wenigstens auf die kommende Strapaze vorbereiten, oder auch nicht ;)","replies":[]},{"poster":"iDarkXenOi","date":"2015-07-25T13:06:28.779+0000","up_votes":1,"down_votes":1,"body":"das sind die LoL kiddys einfach ignorieren.","replies":[]}]}