{"poster":"Kilanost","date":"2017-04-14T03:48:05.726+0000","title":"@Riot: How do I start a private conversation with support regarding the boards","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"I have taken issue with how one of my comments on the boards were addressed and would like to discuss the issue further with a Riot employee.  Please inform me of the appropriate channel to address such an issue.  Thank you.","replies":[{"poster":"Broporo","date":"2017-04-14T04:32:28.656+0000","up_votes":1,"down_votes":0,"body":"Heya Kilanost! \n\nIf you've had a bad run in with someone on the boards, but you're more than welcome to voice that opinion in Player Behavior & Moderation as long as you aren't personally attacking that person. \n\nI'd also like to ask what happened to see if there's any way I could help, but if you feel uneasy posting it just anywhere you can feel free to hit us up in a [**ticket**](https://support.riotgames.com/hc/en-us/requests/new) as well!","replies":[{"poster":"Kilanost","date":"2017-04-14T04:55:25.367+0000","up_votes":1,"down_votes":1,"body":"Thanks for the response.  We can chat here as I would hope anyone who runs into a similar circumstance might see this and know how to address it.\n\nOver the past few days there has been the Xerath issue (that I'm sure you are aware of).  I haven't really played in 2 weeks because I'm studying for my medical boards, but I like to pop on to see whats going on.  When I saw that the Xerath issue hadn't been addressed to the satisfaction of the player base, I posted essentially saying, \"Hi Riot. Please disable this champion as his current abuse is adversely affecting other players in the game. If there is a reason he's not disabled, please give us a heads up.\"  Those weren't the exact words, but its close enough.\n\nI got a response to my post from someone defending the fact that Xerath wasn't disabled that I perceived as trolling and/or unsympathetic.  As most of us do on the boards, I deflected with a few humorous jabs, made the joke that the person was really a young kid who had an alt they were using to abuse Xerath...essentially the type of things you wouldn't say to someone if they were true (because if you think they're true, you just submit a ticket to support).  The implicit humor being that the person was defending a position that allowed the injustice to the many to continue.  The person took that comment as me actually accusing them of cheating and reported me.  The misunderstanding is documented in the conversation that followed where I addressed the fact that I had been reported by the other person in a civil manner within the original post.  \n\nMy shock over this was A) nothing I said was particularly offensive given the context B) the person had reported me without making it clear that they were feeling assaulted as opposed enjoying a good internet argument (a vice we're all too guilty of), and C) that I had received a warning on my account over what amounted to a misunderstanding on the part of the other person.  I don't hold the person I was talking to accountable for this as I feel a misunderstanding is an innocent enough thing.  However, given that the other player, through their own admission, reported me based on that misunderstanding, I would like to ask that the warning on my account be removed.\n\nMy final comment to the other player after I saw they had reported me was essentially my agreeing to disagree over the issue of the original post and an offer to promise to approach people on the boards with a softer touch (as sometimes its easy to forget that not everyone has thick internet skin) and that the other player in turn agree to express their discomfort when they've taken offense to someone on the board to allow them the opportunity to realize they aren't trying to troll or be rude and to apologize for whatever had happened prior to that.\n\nThanks again for the reply.  I appreciate it.","replies":[{"poster":"Skins Project","date":"2017-04-14T07:57:58.307+0000","up_votes":1,"down_votes":0,"body":"Suhpppp\n\n\n\n\n*Edit*\n\nGl on your medical boards btw\n\nDon't think I said that","replies":[{"poster":"Kilanost","date":"2017-04-14T08:07:25.462+0000","up_votes":2,"down_votes":0,"body":"Lol thanks I appreciate it.  \n\nJust finished the female anatomy/path part and I can say fairly confidently that I now know more about lady parts than 99% of women lol.  PS- that shit is a war zone lol","replies":[{"poster":"Skins Project","date":"2017-04-14T08:09:59.072+0000","up_votes":1,"down_votes":0,"body":";-;\n\nGood to know? :p\n\nWell.... Have fun?","replies":[{"poster":"Kilanost","date":"2017-04-14T08:20:51.658+0000","up_votes":1,"down_votes":0,"body":"LOL sorry sometimes when you've been staring at and talking about this stuff non-stop, you forget that most people don't consider body parts normal conversation.  \n\nMan i need a vacation.","replies":[{"poster":"Skins Project","date":"2017-04-14T08:32:46.053+0000","up_votes":1,"down_votes":0,"body":":p","replies":[]}]}]}]}]},{"poster":"Broporo","date":"2017-04-15T20:34:13.067+0000","up_votes":1,"down_votes":0,"body":"Sorry for the slow response!\n\nWithout having the original messages, I can't really say where either one of you was in the wrong. I do know that sometimes posts can be taken the wrong way over the internet though. It's happened to the best of us. We mean absolutely no harm whatsoever, but since the person on the other side of the screen can't hear our tone or inflection they don't pick up on the sarcasm. \n\nIt might not seem particularly fair that you were reported without the other person saying anything about it, but that feature is built in a way so that you don't have to confront the person you're wanting to report. It doesn't feel too good to get reported when you thought it was all in good fun, but some people know they would only escalate things more with their responses so they \"take the high ground\" instead of agitating a fight.\n\nI wanted to take this time to let you voice your opinion where you felt like you would be heard, and I definitely hear that pain. Keep in mind though that our moderation team does look into each of those reports individually and will only take action if it's required. It sounds like the mods saw that you probably meant no harm, and that's why they only gave you a warning. \n\nAs I mentioned earlier, the Player Behavior & Moderation board is really the best place for any issues you have with how your posts are handled, but I didn't want you to feel like you voice wasn't being heard!","replies":[]}]}]}]}