{"poster":"Blackbl","date":"2018-01-28T08:42:41.589+0000","title":"Consigli su come scalare?","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Ciao a tutti,sono un s5 main adc con tanta voglia di imparare,premetto che gioco da fine s5 ma ho cominciato a rankare solamente la scorsa season poich&egrave; non mi ritenevo &quot;pronto&quot;. Ultimamente sto trovando parecchia difficolt&agrave; nello scalare giocando adc,il mio ruolo preferito (attualmente sono s5 48lp (credo)). Vorrei sapere qualche consiglio su come riuscire a vincere la mia lane, quali sono gli adc pi&ugrave; forti attualmente e se fosse meglio giocare una solo lane anzich&eacute; una duo. Il mio problema principale &egrave; quello di non riuscire a creare quell&#039;intesa vincente con il mio supp. Ringrazio in anticipo tutti quelli che mi aiuteranno &lt;3\r\n \r\nPs. Mi sono scordato il fatto di non poter fare duo poich&eacute; non ho amici main supp :(\r\n\r\nGL HF","replies":[{"poster":"CasualNoobITA","date":"2018-01-28T08:59:40.453+0000","up_votes":4,"down_votes":0,"body":"Posizionamento , se mantieni un buon posizionamento e visione del macrogame , non hai bisogno di nessuno in leghe basse , ne' di avere un ruolo o un campione specifico .\nGioca quello che piu' ti piace migliora e salirai indipendentemente da altri 1000 fattori .\nAnche perchè salire solo abusando del meta ti metterà dopo, in una situazione ancora peggiore .","replies":[]},{"poster":"Clearωay","date":"2018-01-28T10:12:14.465+0000","up_votes":2,"down_votes":0,"body":"I consigli per salire sono sempre gli stessi: concentrati moltissimo sul farm, gioca gli adc che ti piacciono indipendentemente da quello che è il meta in questo momento (non ti deve interessare), cerca di capire quando puoi harrassare e quando invece non puoi. L'adc nemico vuole farmare un minion? Contestaglielo, gli dai un aa e torni indietro. Se l'adc avversario deve killare il minion darà la priorità a quello e quindi il tuo è un autoattacco gratis che gli dai. Se lui risponde ignorando il minion è communque worth per te. Sono piccole cose che servono a migliorare.\nImpara a capire quando puoi ingaggiare e quando no. Es: voi siete kog-soraka vs lucian-bard. Capisci da solo che al livello due quelli vi massacrano,perciò punterai solo a farmare e scalare. \nConosci i macthup, i danni che puoi fare, IL POSITIONING che per un adc è tutto. Ho un amico che è bronzo 3 e gioca adc. Ho spectato un suo game per aiutarlo. Lui era mf e contro aveva una vayne. Non capiva che al livello 2 mf distrugge vayne e giocava sotto torre per paura. Non è così che si migliora, si migliora provando a giocartela, con una q la smezzava, eppure gliel'avrà fatta una o due volte in lane. Perciò il mio consiglio è di imparare quanto danno puoi fare, va bene rispettare l'avversario, ma aver paura quando sei più forte tu no. A fine game lui mi ha detto \"non so giocare contro vayne\", beh, se giochi sotto torre per forza vayne vince e farma meglio di te no? Perciò impara bene a che livello il tuo champ è più forte, quando è più scarso ecc.\nSe il tuo jungler ganka non stare sotto torre, aiutalo, baita gli avversari. Se invece voi avete poca vita e gli avversari hanno moltissimi minion pinga al jungler di non gankare perché i minion vi ucciderebbero.\nNon andare mai da solo dove non hai vision, ho uno smurf al lvl 30 e facendo le plecements gioco contro i s1-g5, la prima cosa che ho notato è che i carry non hanno positioning, non sanno posizionarsi in modo da non essere raggiunti, oppure vanno per la mappa da soli dove non hanno vision, non rispettano gli avversari. Il team nemico ha kha zix, o irelia, shaco, evelynn? Okay, da solo non ci puoi MAI stare. \nCi sono milioni di cose che potrei dirti, ma tu concentrati sulle macro: farm, positioning, ward, matchup.","replies":[{"poster":"Blackbl","date":"2018-01-28T11:37:16.713+0000","up_votes":1,"down_votes":0,"body":"Riguardo la visone, non compro quasi mai le ward blu,è un errore grave?\nSe si le devo comprare subito raggiunto  il lvl 9 oppure conviene aspettare un po? \nGrazie per i tuoi consigli!","replies":[{"poster":"Clearωay","date":"2018-01-28T14:18:01.047+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Blackbl,realm=EUW,application-id=MJVj50Jw,discussion-id=i3BWBnve,comment-id=00010000,timestamp=2018-01-28T11:37:16.713+0000)\n>\n> Riguardo la visone, non compro quasi mai le ward blu,è un errore grave?\n> Se si le devo comprare subito raggiunto  il lvl 9 oppure conviene aspettare un po? \n> Grazie per i tuoi consigli!\n\nComprala quando ne senti più il bisogno. Non è che è obbligatorio :)\nCompra anche le control ward, sono molto molto importanti! Averne 5 invece che sola una fa sentire la differenza credimi","replies":[]},{"poster":"ReyZør","date":"2018-01-28T12:10:00.535+0000","up_votes":1,"down_votes":0,"body":"Comprala, ti permette di wardare in posti dove se ci andassi a piedi verresti ucciso 20 volte, in poche parole ti permette di wardare in modo safe. \nUn adc non deve MAI facecheckare un bush o in generale andare da solo dove non ha vision, per cui capisci che andare a spasso a mettere ward gialle è vietato per lui (a meno che non si abbia vision degli avversari).\nInoltre è utilissima per vedere se i nemici sono a farsi il baron/drago.","replies":[]}]}]},{"poster":"Darkinknight","date":"2018-01-28T11:39:41.102+0000","up_votes":3,"down_votes":1,"body":"Di solito il modo migliore per scalare è vincere.","replies":[]},{"poster":"Don Draven","date":"2018-01-31T00:41:43.890+0000","up_votes":1,"down_votes":0,"body":"a giocare adc francamente non l'ho trovato un ruolo tanto complesso quanto la maggiorparte della gente crede e vuole far credere,è semplicemente scazzo,ti devi posizionare come una qualsiasi altra risorsa di danno ossia fuori dalla combo di j4,sperimentandolo a mia volta,tolto che faccio pena come laner e sono quasi decente con Draven che di se ora non è decisamente la miglior scelta, ho constatato che semplicemente arrivare ad avere 70-80 cs a 10 minuti,  160-180 a 20 minuti e 260+ a 30 minuti facilita la cosa in maniera estrema.. i danni del rightclick cambiano stupidamente solo per quell'esperienza e quei pochi gold di quei cs in più,tutto qui.\n\nse te hai le palle di stare a farmare 300 affari per 30 minuti tanto di cappello,a me cadono le palle,se ci riesci comunque critti e shotti da casa tua...","replies":[]},{"poster":"Saibbo","date":"2018-01-28T19:49:21.022+0000","up_votes":2,"down_votes":6,"body":"> s5 main adc \n\nBeh.. l'unica cosa che puoi fare? pregare che trovi almeno il supporto decente. Difficilmente vinci lane altrimenti. Non ascoltare la gente che ti dice gioca quello che ti pare in low elo o qualsiasi altra cosa dicano.. se vuoi scalare inizia a impararti benissimo 1/2 campioni in meta. Puoi controllare con il win rate che hanno e da quelli che trovi nei tuoi game e hanno performance costanti. Onestamente non esistono ruoli \"migliori\" per carriare, ma di certo in bot e jng dipendi molto dai tuoi teammates in early, comunque senza team non passerai dei bei momenti comunque.","replies":[{"poster":"Clearωay","date":"2018-01-29T20:18:03.414+0000","up_votes":2,"down_votes":2,"body":"> [{quoted}](name=Mark Sama,realm=EUW,application-id=MJVj50Jw,discussion-id=i3BWBnve,comment-id=0004,timestamp=2018-01-28T19:49:21.022+0000)\n>\n> Beh.. l&#x27;unica cosa che puoi fare? pregare che trovi almeno il supporto decente. Difficilmente vinci lane altrimenti. Non ascoltare la gente che ti dice gioca quello che ti pare in low elo o qualsiasi altra cosa dicano.. se vuoi scalare inizia a impararti benissimo 1/2 campioni in meta. Puoi controllare con il win rate che hanno e da quelli che trovi nei tuoi game e hanno performance costanti. Onestamente non esistono ruoli &quot;migliori&quot; per carriare, ma di certo in bot e jng dipendi molto dai tuoi teammates in early, comunque senza team non passerai dei bei momenti comunque.\n\nE' il commento più stupido che io abbia mai letto in questo forum. E ce ne vuole, ti sei impegnato in negativo.\nUn ragazzo chiede dei consigli su come migliorare e quello che hai da dirgli è \"se trovi un support bad hai perso la partita\". Che mentalità idiota. Imparare due adc in meta? Okay, ora si impara kog e twitch, la prossima patch vengono nerfati (è un esempio) ed è punto e a capo secondo il tuo ragionamento. Io credo che anche a challenger si possa giocare ciò che piace piuttosto che ciò che è in meta. Se tu che giochi champion in meta sei gold da 4 anni e io che gioco shaco (fuori meta da due anni) sono diamond cosa mi dici? Io credo solo che si debba giocare ciò che piace e diverte, ti stimola a migliorare. I ruoli migliori per carriare in soloq esistono eccome e sono jungle e mid. Non è affatto vero che bot e jung dipendano molto dai teammates in early, che cavolate mi tocca leggere. Se sei più bravo della media del tuo elo sali, indipendentemente dal tuo team. Ho appena finito le placements con un mio smurf livello 30 e guarda un po', sono gold 4, più alto del tuo elo massimo facendo solo le placements. Credi che sia dipeso dal team o da me stesso?\nDopo esserti dato la risposta da solo pensa a dare dei consigli utili invece che sparare ca**ate","replies":[{"poster":"Saibbo","date":"2018-01-29T21:10:27.622+0000","up_votes":1,"down_votes":1,"body":">Un ragazzo chiede dei consigli su come migliorare e quello che hai da dirgli è \"se trovi un support bad hai perso la partita\"\n\nHai mai mainato adc? non parlo 1/2 partitelle con twitch, parlo di un centinaio se non più di partite. Voglio vedere quali consigli puoi dare a qualcuno per vincere la lane bot se ti trovi un supporto auto-fillato che non ha idea di cosa sia una ward o che ti picka galio/ez/zed/katarina support, magari vinci ancora ma di certo da adc non farai mai niente in una lane del genere. \"Che mentalità idiota.\"\n\n>Imparare due adc in meta? \n\nGia... il consiglio peggiore che si possa dare: impara bene 1/2 campioni per iniziare a scalare, no gioca 20 campioni in 2/3 lane diverse non serve imparare bene pochi campioni per scalare.\n\n>Okay, ora si impara kog e twitch, la prossima patch vengono nerfati (è un esempio) ed è punto e a capo secondo il tuo ragionamento.\n\nSi hai ragione non importa quanto veramente sia forte il campione.. picka il più nerfato nella patch per scalare in ranked, di certo non si e' mai visto pickato quasi sempre gli stessi campioni che erano in voga in quel momento (jhin,mf cometa; vayne;adc con targon)\n\n> sono diamond cosa mi dici?\n\nBeh congratulazioni tanta roba, anche mi sono fatto platino in pre-season ;) quando dopo 4 anni di g5 ho iniziato la prima volta a giocare più di 20 partite a season in ranked solo per prendere le ricompense\n\n>Ho appena finito le placements con un mio smurf livello 30 e guarda un po', sono gold 4\n\nBravo che vuoi che ti dica? Sono sicuro che non ci riuscirebbe nessuno ;) questo vuol dire che sei più qualificato di me per consigli sulla bot lane quindi prego col prossimo commento oltre alle critiche costruttive sul fatto 'che sei' di elo più alto del mio puoi dare dei consigli migliori, visto che nel tuo commento ti sei dimenticato di scriverne alcuno.\n\n>Dopo esserti dato la risposta da solo pensa a dare dei consigli utili invece che sparare ca**ate\n\nGia, in botlane il supporto ha 0 impatto sul match up, ti puoi pure prendere un ezreal supporto e' lo stesso che una janna che maina supporto visto che un ADC non dipende dal suo team per fare bene o il jungler che il laners non crepi prima del gank o non ti aiuta quando ganki ;) ! Questo gioco dipende 0% dal team work.","replies":[{"poster":"Clearωay","date":"2018-01-29T21:31:35.086+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Mark Sama,realm=EUW,application-id=MJVj50Jw,discussion-id=i3BWBnve,comment-id=000400000000,timestamp=2018-01-29T21:10:27.622+0000)\n>\n> Hai mai mainato adc? non parlo 1/2 partitelle con twitch, parlo di un centinaio se non più di partite. Voglio vedere quali consigli puoi dare a qualcuno per vincere la lane bot se ti trovi un supporto auto-fillato che non ha idea di cosa sia una ward o che ti picka galio/ez/zed/katarina support, magari vinci ancora ma di certo da adc non farai mai niente in una lane del genere. &quot;Che mentalità idiota.&quot;\n> \n> Gia... il consiglio peggiore che si possa dare: impara bene 1/2 campioni per iniziare a scalare, no gioca 20 campioni in 2/3 lane diverse non serve imparare bene pochi campioni per scalare.\n> \n> Si hai ragione non importa quanto veramente sia forte il campione.. picka il più nerfato nella patch per scalare in ranked, di certo non si e&#x27; mai visto pickato quasi sempre gli stessi campioni che erano in voga in quel momento (jhin,mf cometa; vayne;adc con targon)\n> \n> Beh congratulazioni tanta roba, anche mi sono fatto platino in pre-season ;) quando dopo 4 anni di g5 ho iniziato la prima volta a giocare più di 20 partite a season in ranked solo per prendere le ricompense\n> \n> Bravo che vuoi che ti dica? Sono sicuro che non ci riuscirebbe nessuno ;) questo vuol dire che sei più qualificato di me per consigli sulla bot lane quindi prego col prossimo commento oltre alle critiche costruttive sul fatto &#x27;che sei&#x27; di elo più alto del mio puoi dare dei consigli migliori, visto che nel tuo commento ti sei dimenticato di scriverne alcuno.\n> \n> Gia, in botlane il supporto ha 0 impatto sul match up, ti puoi pure prendere un ezreal supporto e&#x27; lo stesso che una janna che maina supporto visto che un ADC non dipende dal suo team per fare bene o il jungler che il laners non crepi prima del gank o non ti aiuta quando ganki ;) ! Questo gioco dipende 0% dal team work.\n\nBeh visto che il tuo commento è -4 io due domande me le farei :)\nNon ho mai mainato adc, infatti twitch lo gioco jungle se vedi. Io non sto parlando della singola partita in cui ti può capitare katarina support, sto parlando di come aiutarlo a migliorare, tu parli di episodi, io parlo in modo generico, è qui la differenza. I game si perdono e vincono come è normale che sia, ma se sei bravo a lungo andare sali. Io non ho detto che è sbagliato imparare 1-2 champion, non mettermi in bocca cose che non ho detto. Ho spiegato come il meta non gli debba interessare, ciò che lo deve spingere a giocare è il divertimento del champion, scoprire le sue meccaniche ecc, non perché agli LCS giocano tristana allora è obbligatoria e buona per salire, non c'entra niente. Questo è il mio discorso, non pensavo non fosse chiaro ma siccome a quanto pare loera ora te l'ho spiegato meglio. Esatto, puoi piackare chi cavolo vuoi per salire perché se impari bene il tuo champion salirai comunque credimi, meta o non meta. Vuoi vedere che se uso kindred adc in silver e gold vinco lo stesso? Questo cosa singifica? Sì esatto! Che il meta non c'entra nulla per salire, basta essere bravi.\nSe rileggi sopra il mio commento su come aiutarlo l'ho fatto, poi se tu non l'hai visto non è un problema mio.\nDi nuovo mi metti in bocca cose che non ho detto... non ho mai detto che il support non conta nulla, ho semplicemente detto che alla lunga se sei forte sali, team buono o scarso che sia, ALLA LUNGA sali se sei più bravo della media del tuo elo, se non ci riesci è per demerito tuo, fine. Se a te non va bene non so cosa farci. Sarà giusto dare la colpa al team allora. Forse preferisci dirgli \"guarda non ti servono consigli, dipende tutto dal tuo team e dal tuo support, senza quelli hai già perso e non salirai mai\", hai ragione d'altronde un silver che bisogno ha di migliorare, dipende tutto dal suo team :)","replies":[{"poster":"Saibbo","date":"2018-01-29T22:00:37.806+0000","up_votes":1,"down_votes":1,"body":">Beh visto che il tuo commento è -4 io due domande me le farei :)\n\n{{sticker:sg-miss-fortune}} \nSI su questo forum i down-vote li prendi qualsiasi cosa scrivi o topic che posti, e' un miracolo che questo post non ne abbia ricevuto nessuno\n\ndal post :\n>Vorrei sapere qualche consiglio su come riuscire a vincere la mia lane, quali sono gli adc più forti attualmente e se fosse meglio giocare una solo lane anziché una duo. Il mio problema principale è quello di non riuscire a creare quell'intesa vincente con il mio supp.\n\n-vincere lane? Ok, bravo o non come dici te, i consigli ti aiutano fino a un certo punto a diventarlo, visto che dipende da come giochi il campione che scegli e se lo sai usare con la pratica, il resto e' il supporto che hai o che hai contro e se i Jungler gankano per vincere la lane, da solo fai poco o nulla da adc, testato, le uniche lane che vinco sono quelle dove i jungler non gankano e il mio support non e' tremendo o lo e' quello nemico.\n-gli adc piu forti? chi lucian??? no quelli che sono in meta in quel momento, vayne, ezreal klepto, jhin/mf cometa...(es.) puoi vincere anche con lucian ma di certo ti \"divertirai\" molto con lui..\n\nche \n\n>sparare ca**ate\n\nsono le mie?","replies":[]}]}]}]}]},{"poster":"ILoveTiramisu","date":"2018-01-28T16:35:26.591+0000","up_votes":1,"down_votes":1,"body":"Sto avendo problemi anch'io a scalare. Ma conosco i concetti molto bene. Intanto quanto ti dura una partita media? ADC piu giocati al tuo elo? Cosa banni? Con chi hai problemi a giocare contro.\nLa prima cosa che fai prima di entrare nella landa è di selezionare le rune. Le rune per adc CAMBIANO per partita e si prioritizza la laning phase (sustain).\nIl primo obbiettivo dell'adc è quello di raggiungere il livello 2 prima del nemico e capitalizzare. Controllare la wave, freezare quando vuoi che il tuo jungler ganki, pushare prima di recallare e comprare gli item.\n\nFarmare deve essere la cosa che sai fare meglio e devi cercare di non perdere un last hit e di ricevere meno danno possibile in laning phase. Se hai un bullo, puoi abusarne per far perdere cs ai nemici.\n\nLa prima torre a scendere è spesso in bot o toplane. Il primo che la butta giu si prende la bellezza di 2 kill come soldi. Quando gioco adc in laning phase. questo è il mio vero obbiettivo. Con i soldi della prima torre riesco spesso a chiudere subito il primo item. Gioca molto sul buttare giu torre e pushare velocemente le wave dopo la laning phase. Farma il piu possibile per raggiungere i gold per comprare gli itme piu importanti. Evita di fightare finche non li hai.\n\nLa seconda cosa importante è il teamfight. Sei il componente che porta piu danni continui e il primo che i nemici voglio uccidere.\nLa **regola d'oro **è quella di avere solo un componente del team nemico nel raggio di autoattacco per volta. L'eccezione viene applicata solo su i campioni in grado di aumentare di molto il range di autoattacco e che quindi possono buildare la {{item:3085}}.\n\nPrendi il trinket blu per pushare o mantenere quello giallo? Il trinket blu serve per non face checkare. Tipo quando pushi oltre la linea dei golem spesso succede che un nemico ti sta aspettando nascosto. Il trinket giallo è un po piu difensivo. Tieni presente che tu non andarai mai a wardare in un brush dove oltre il fiume. Lo tieni solo quando stai perdendo. Poi dipende da altri fattori etc.\n\nLa build dopo gli item core è situazionale. Dipende da se i nemici hanno un healer, se hanno un tank, se hanno un assassin, se hanno troppi CC.\nLe scarpe rientrano tra gli item situazionali ma a diferenza degli altri le chiudi entro i 12min o prima. Non buildare diretto {{item:3006}}, ma controlla il nemico piu fiddato che ti puo saltare addosso. Spesso {{item:3047}} e {{item:3111}} sono ottime opzioni.","replies":[{"poster":"Blackbl","date":"2018-01-28T18:07:06.341+0000","up_votes":1,"down_votes":0,"body":"In media finisco una partita entro i 30/35 min, banno quasi sempre zoe,leona o shyvana. Gli adc più giocati sinceramente non saprei..forse mf e varus. Per quanto riguarda il farm me la cavo abbastanza bene,in media ho 70/80 cs a 10min (tranne quando sto perdendo). Ti ringrazio per tutti i consigli  in particolar modo per quello delle scarpe, non ci avevo mai pensato :o","replies":[{"poster":"ILoveTiramisu","date":"2018-01-28T23:11:43.418+0000","up_votes":1,"down_votes":0,"body":"Ti spio un po la match history per capire di piu.\n\nHo aperto 2 partite a caso. Muori sempre per colpa del jungler circa 1/2 volte prima dei 10 min. Ora ho capito molto meglio il problema.\n80 cs è buono per gli adc che giochi. Quello che penso che succeda è che tu pushi fino sotto torre. Non è possibile che un jungler come master yi riesce a ucciderti nei primi 6m, ma è possibile per un kayn. Pushare è giusto ma devi tenere conto del jungler e di come ti puo gankare. Spesso un jungler non ganka bot finche non raggiunge il 6, ma se hanno un supporto da ingaggio puoi trovartelo anche prima. Quindi quando tu arrivi al livello 5 non pushare piu. Se sei in vantaggio freeza, se loro pushano chiama il jungler subito. Qui si ottiene un free drake o una torre.\n\nQuando invece ti conviene pushare? Per raggiungere il livello 2 prima e ottenere il controllo della lane. Vuol dire che se il tuo nemico è ancora al livello 1 tu inizia a tradare con lui finche non va sotto torre e da quel momento lasthitti non hai piu bisogno di pushare. (video n3 lane control)\n\nVideo sulla bot in generale: https://www.youtube.com/watch?v=aQhYwoWeF0w e tutti i video che questo tipo di dice di guardare prima di quello + quello ADC in teamfight.\n\nOvviamente non so se sia quello il problema ma spero ti aiutino perche a me hanno aiutato. Ti do anche questo:\nhttps://www.youtube.com/watch?v=rpuryKGPH_Y&t=1015s che è in italiano, guardati tutti quelli sulla botlane.","replies":[]},{"poster":"furetto2000","date":"2018-01-28T20:36:35.693+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Blackbl,realm=EUW,application-id=MJVj50Jw,discussion-id=i3BWBnve,comment-id=00030000,timestamp=2018-01-28T18:07:06.341+0000)\n>\n> In media finisco una partita entro i 30/35 min, banno quasi sempre zoe,leona o shyvana. Gli adc più giocati sinceramente non saprei..forse mf e varus. Per quanto riguarda il farm me la cavo abbastanza bene,in media ho 70/80 cs a 10min (tranne quando sto perdendo). Ti ringrazio per tutti i consigli  in particolar modo per quello delle scarpe, non ci avevo mai pensato :o\n\nFacciamo almeno 90 costanti e va bene.","replies":[]}]}]}]}