{"poster":"Riuko","date":"2017-01-18T02:49:58.596+0000","title":"Attempting to reconnect with 80 ping (if you don't want to hear the story then scroll to the bottom)","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"Okay, so, here's the problem. The past few games I have played recently have been ranked. I hit accept on the new client get put in champ select everything is going great. Champs are picked and we're on our way in to the rift. \r\nNow is when things get fucked and I rage. \r\nEveryone finally loads in and I (i usually play jg) go to my first buff and wait for it to spawn. I do the usual flash mastery ribbon with some laughs and dances here and there with the bot lane that leashes for me. In one game in particular I was Talon{{champion:91}} , my blue buff spawned and I start going in with help from the bot lane (I forget what they were) and its going good until I realize I'm tanking and getting lower than I would like. So I try to back away and let the supp tank a little bit... Wait why am I still in blue buffs face.... okaayyy then I guess I'll health pot deal with it and keep doing what I need to do.... Why wont my health pot pop??... Shit I'm taking too much dmg I wont be able to finish my clear the right way and I could die in my jg. I try to use my Q (I'm level one its all I got) nothing.... My champion is still just tanking and auto attacking like its all he knew how to do. We kill it I get the buff. and my champion sits there where his foe fell... waiting.... thinking.... regretting it all... or at least that what it looks like because he wont do anything but stand even when i try to move to my wolfs/pop my health pots/cast abilities/smite/or even auto attack something... i just sit there... then i finally have control and i can move around (keep in mind i could see everything that was happening, everyone was moving attacking casting the whole nine yards) my health pots popped as if i was losing connection and my commands finally went through. So now gaining health I move to my wolfs and engage W then a Q on to a small wolf killing the first one then focusing the second one i go for another W Q combo..... and my champion is just standing there taking the hits from the other two wolfs like his the bitch and not the butch i know talon is... and i start losing more and more health..then out of no where my W flys out and i start attacking the little wolf like i previously wanted. i kill him and start trying to finish off the big wolf doing the usual combos getting to about a third health i go for another Q to try to kill him but i'm stuck auto attacking him i get put to like a fifth of my health by the time i kill him with aa's so i pop my last health pop go toward my red and wait for the health potion to stop healing me before i go in. it does then i engage my red buff usual combo of W then Q getting to about 1000 health so close to killing him but im three hits away from death. so i try to do another combo and then smite to gain health.... nothing happens i stuck aaing and tanking his shots........ just before i die to my red buff losing my blue buff something pops up on my screen \"Attempting to reconnect.\" now im no fool i've lagged out before and thats what pops up you take a look around the rift to see if the other champions will run to the last know command sent to that game server or how ever it works then they stop along with minions... i could watch everyone go back and forth farming poking casting even getting a kill.. it looked as if nothing was happening and it was a normal game.... but it would do that to me every game for the past three games of ranked and at first the were quick moments when i couldn't do anything and then it woudl go back to normal in a second, so i was just blaming random ping spikes. but in the last ranked match i play (which was the one i just told you about with talon) i would go about my normal playing style then i would just watch my champion walk to where i clicked and then i would try to move him to a new position, and he would keep walking to where i had clicked the first time. he gets to where i click and he just stands there i was killed multiple times because i clicked to move out of spawn and would just none stop run past the enemy as they take shots at the dumb jg thats running in to a group of five solo. i would stop where i click and i would be able to cast my abilities, move, use summoner spells, or even type. i would type to my team letting them know i wasn't doing this and it wouldn't send untill i had control again.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n**WHERE TO GO IF DON'T WANT TO READ THAT^**\r\nSo basically there will be brief moments in my games where i lost all control of my champion and it will show \"attempting to reconnect\" but while its doing that i can watch my team walk, fight, die, cast, etc.. and even the enemy team would be doing stuff while i have this \"attempting to reconnect\" window on my screen while i can see i have 80-90 ping(which is a normal i can play with this ping for me). and sometime there wouldn't even be that. My champion alone will freeze and not be able to do anything.  and as i was playing the game more the length would increase where i have no control... i lost my last ranked to a one aa close from death adc that was attacking my nexus because i was the only one left alive and i couldn't move out of spawn to try. \r\n\r\nIf this has happened or is happening to anyone else please let me know how i can fix it or just let me know i'm not crazy","replies":[{"poster":"Targons Blade","date":"2017-01-18T04:05:08.155+0000","up_votes":1,"down_votes":0,"body":"What you've described are fairly common symptoms of *Packet Loss*, which occurs if there are problems between your PC and our servers. Before we look into your network routing, I'd like you to work through our [**connection guide**](https://support.riotgames.com/hc/en-us/articles/201752664-Troubleshooting-Connection-Issues) to ensure your local settings are fine.\n\nIf you continue to see these symptoms after taking those steps, let me know.","replies":[]}]}