{"poster":"Windwall on CD","date":"2017-06-15T00:23:28.613+0000","title":"Partida con suscriptores (Youtube)","subforum":"Creaciones de la comunidad","embed":{"description":"Hey, im Lasky, I play in LAS and I main Yasuo, I also upload to PlaysTv at: https://plays.tv/u/Airblade Music comes from: https://www.youtube.com/channel/UC_aEa8K-EOJ3D6gOs7HcyNg I also used some Nightcore tracks, that can be found easily in NightcoreReality's channel or any other.","url":"https://youtu.be/Jxn8BFWNOFw","image":"https://i.ytimg.com/vi/Jxn8BFWNOFw/hqdefault.jpg"},"up_votes":5,"down_votes":2,"body":"Buenas, hoy un video especial, jugando con un amigo Youtuber - [Dryko](https://www.youtube.com/channel/UCRfBSfaLXOTywPbIiD4G3xQ) - una partida realmente divertida desde el inicio, con algunas plays interesantes y demas, no voy a hacer spoilers asi que espero que les guste y si quieren se suscriben, los dos subimos videos cuando podemos. \r\n\r\nSaludos y desde ya gracias!\r\n\r\nPD.: si quieren me agregan y jugamos! capaz que despues se ven en el canal ;)","replies":[{"poster":"SAD Katarina","date":"2017-06-15T00:56:51.433+0000","up_votes":1,"down_votes":0,"body":"Hacelo más estilo montaje, se torna extremadamente aburrido ver un video así :)\nPodes tomar un video [mio](https://www.youtube.com/watch?v=Y29tg5G9pYc) de ejemplo si queres, o cualquier otro canal.\n¡Saludos joven amante de las Dagas! {{champion:55}}","replies":[{"poster":"Windwall on CD","date":"2017-06-15T01:57:12.349+0000","up_votes":1,"down_votes":0,"body":"Me gusta el formato que le estoy dando a mi canal pero acepto la sugerencia. Me gustan los montajes y probablemente haga alguno en la medida que consiga algún buen programa de edición. Por el momento me dedicare a subir las partidas enteras, que a los que conozco les gusta y les sirve para aprender también, de los montajes, poco y nada se aprende.","replies":[{"poster":"SAD Katarina","date":"2017-06-15T02:21:55.246+0000","up_votes":1,"down_votes":0,"body":"Ya que los vas a subir completos, ¿Por qué no comentados? En serio que no aguanté más de 1 minuto sin aburrirme xD","replies":[{"poster":"Windwall on CD","date":"2017-06-15T02:31:07.173+0000","up_votes":1,"down_votes":0,"body":"Es la idea también, claro, no me dedico a Youtube, mas en un país donde no hay partner y no quiero monetizar mis videos. \n\nSoy estudiante y lo hago como pasatiempo, necesito un micrófono, estoy ahorrando para comprarlo. Cuando pueda empezare a hacer los videos comentados si, gracias igual por la critica, y si a ti te aburre puede que a otros no, pero se aprecia igual.","replies":[{"poster":"SAD Katarina","date":"2017-06-15T02:49:39.978+0000","up_votes":1,"down_votes":0,"body":"Piola man, espero el micro entonces :)\n\nFue con toda la buena onda del mundo lo mio, no me malinterpretes xd","replies":[{"poster":"Windwall on CD","date":"2017-06-15T03:10:24.758+0000","up_votes":1,"down_votes":0,"body":"Bueno, espero sea pronto xD\n\nGracias otra vez ;)","replies":[]}]}]}]}]}]}]}