{"poster":"Orvvadasz1","date":"2019-10-30T12:35:55.473+0000","title":"Senna, első ránézésre","up_votes":1,"down_votes":0,"body":"Szóval bejött végre az új champ PBE-re és hát azt kell mondjam hogy már a videók alapján is overpowerednek tűnt de a valóságban még sokkal jobban az. \nKezdjük ott, hogy a passzívjával lelkeket gyűjtöget hasonlóan Threshhez csak itt nem közel kell menni hozzájuk hanem rájuk kell autoattackolni vagy Q-zni. A minionokból kevesebb lelket kapsz mint Threshként de a hősökből is szakíthatsz ki és halálukkor is dobnak el lelkeket. Szóval nagyjából olyan gyorsan gyűjtheted mint vele. Na de mit is adnak ezek? Lelkenként 1 AD-t adnak ami már magában nem tűnik rossznak. Na de ha összegyűjtesz 25 darabot akkor kapsz bónusz 25 ranget, és kritikus csapási esélyt is (12,5% talán ha jól emlékszem). De ez még mindig nem minden mert ha több lenne a kritikus csapási esélyed mint a maximum akkor feles arányban életlopássá konvertálja. Ja és begyűjtött lelkenként 3 aranyat kapsz. Mi ez ha nem overpowered? \nAz autoattackja kicsit lassabb mint az alap championoknál de emiatt bónusz sebzés kapsz cserébe ami már első szinten is +20 körül van szóval olyan 80at sebzel első szinten.  \nA Q-ja is igen érdekes mert csapattársakat healel ellenséget meg sebez szóval ez is igen hasznos tud lenni egy sűrű teamfightban. Ráadásnak alaptámadásonként 1mpvel csökken a töltési ideje.\nA W-je egy lassan mozgó lefogás ami 1 mp késleltetéssel földhöz köti  az eltalált és a körülötte lévő ellenfeleket. 1 vs 1ben könnyű kikerülni, de teamfightokban halálos is lehet ha elkapja a csapatod. \nAz Eje megcélozhatatlanná teszi magát és a körülötte lévő szövetségeseket. Ez igen hasznos mert ez bónusz mozgási sebességet is biztosít és nem látható, hogy valójában hányan is támadtok az ellenség számára. \nAz ultija a többi képességéhez képest már nem is tűnik annyira OP-nak. Egy Lux ulti szélességében sebez, egy lane szélességében pajzsot ad a szövetségeseknek. Ez a képessége is teamfightokban lehet igen hasznos mert az egész csapatodat shieldelheted miközben még sebzel is.\n\nSzóval véleményem szerint ezt a hőst még PBE-n gyengíteniük kell majd mert annyi mindennel tették tele a képességeit, hogy egy rémálom lesz balancolni az egészet miközben hűek akarnak maradni a hős valódi énjéhez.","replies":[{"poster":"FURRY V2","date":"2019-10-30T12:56:24.508+0000","title":null,"up_votes":2,"down_votes":0,"body":"Kihagytad, hogy az E-je mindenkit camouflage buffal lát el és mindenkit egy lélekké változtat kinézetre, amíg nem támadnak. Azaz az ellenségnek fogalma sincs arról, hogy ki-kicsoda.\n\nAz R pedig globális range.\n\nA PBE-n az is kiderült, hogy nincs limit jelenleg azon, mennyi range-t tud összeszedni. Valaki 8000 range-t szedett össze unalmában.\n\nEgyébként, én nem azt mondom, hogy ez a karakter overpowered. Én azt mondom, hogy a többi karakter túl egyhangú.\n\nTöbb egyedi és érdekes karakter kellene, ami újat mutat mechanikailag. Itt volt Kalista, aztán jött Yuumi és most itt lesz Senna.\n\nHeroes of the Storm már elég régóta így csinálja. A hősök közti differencia brutális és mégse sír mindenki, hogy \"game breaking hero, remove\".\nPersze, hogy nem, mert ott elejétől fogva ilyen hősök voltak.\n\nÉn remélem is, hogy innenstől csak ilyen hősök fognak jönni, amik újat mutatnak.","replies":[{"poster":"ScreamForMeBaby","date":"2019-10-31T17:55:25.197+0000","title":null,"up_votes":2,"down_votes":0,"body":"Fun fact:\n\nAz új \"izgalmas\" hősöket javarészt nem használjuk, mert a lehetőségeik tárháza olyan széles az \"alap\" hősökhöz képest, hogy nem lehet érdemben balanszolni.  Vannak kivételek, de azért megkérdem:\n\nAz elmúlt 50 ranked mérkőzéseden hány {{champion:429}} , {{champion:163}} , {{champion:136}} ,{{champion:427}} fordult meg?","replies":[{"poster":"FURRY V2","date":"2019-11-04T10:53:14.352+0000","title":null,"up_votes":1,"down_votes":0,"body":"Jó hát.. A szóban forgó hősök lehetnének jók is, nem csak egyediek.\nKali még valóban jónak is mondható, de személy szerint, a másik háromnál messze vannak jobb választások. Mivel a rito többi hőse a braindead játékstílusra épül, amihez nem kell sok ész, csak mész azt kész.\n\nEzért is kezd unalmassá válni a damage meta. Minden sebez, mint az atom és minden team fight kevesebb, mint 5 másodpercig tart.\n\nHa több egyedi hős lenne, nem csak 5-6, akkor bizonyára ki lehetne használni őket. De mégis mit tegyenek ezek a 140 másik mellett, amik csak arcra mennek?\n\nMég emlékszem azokra az időkre, amikor Anivia \"hard\"-nak számított, mert bele kellett irányítani az ellenfelet egy fallal a geci lassú Q-dba, hogy ráverhess egy E-t. Utána vártál 3 sec-et, és akkor használtad az ulti + E kombót egy második csapáshoz.\n\nMostmeg rádugrik nagyanyám és egy skillel annyit sebez, mint te a full kombóddal, amit még el is cseszhetsz, ha nem úgy mozog az ellenfél, ahogy te azt tervezed a faladdal.\n\nAz egyetlen dolog, ami HOTS-ban jól megvan oldva, az az, hogy attól balanced, hogy minden hős broken. Nincs egy megadott sablon, amire a többi hős építve van.\nA lol hősei egymás tükörképei, épp csak annyi tér el, hogy ez nem zöldet lő, hanem pirosat.\n\nDe pont ez az, ami miatt a lol pléyerek sírnak. Megszokták, hogy a lolban ilyen, egyforma hősök vannak. Ha jön valami, ami \"kilóg\", akkor az broken és remove, mert \"nem illik a játékba\".\n\nEzek a playerek infarktust kapnának, ha egyszer belépnének hots-ba.\n{{sticker:sg-miss-fortune}} \n\nBy the way, ez nem a reklám helye.\nDe több, mint valószínű, hogy ez az oka annak, hogy a playerek ennyire lázadnak az egyedi hősök ellen.","replies":[]}]},{"poster":"Orvvadasz1","date":"2019-10-30T13:10:27.206+0000","title":null,"up_votes":1,"down_votes":1,"body":"Hát igen csak a riot úgy balancol hogy mindenkit ugyanolyan gyengére csinál. A Hotsnál mindenki ugyanolyan broken így nem broken senki se.","replies":[{"poster":"FURRY V2","date":"2019-10-30T13:25:17.784+0000","title":null,"up_votes":1,"down_votes":1,"body":"It made me laugh.\n{{sticker:sg-miss-fortune}}","replies":[]}]}]},{"poster":"ScreamForMeBaby","date":"2019-10-31T17:57:52.935+0000","title":null,"up_votes":1,"down_votes":0,"body":"Csak a szokásos. A Riot régóta próbálja a support szerepet kicsit vonzóbbá tenni. Sok meddő próbálkozás után elfogadta, hogy ide is valami \"carry\"-gépet kell rakni, függetlenül attól, hogy ez milyen hatással jár a  játék egészére. Mikor kiadják akkor perma-bann alatt fog állni a hős, majd megindul a szokásos nerf-cunami, és végül ott lesz, mint Pyke. Kedvelt hős, aki annyira hasztalan, hogy mikor a csapattársad elhozza, már előre szívod a fogad.","replies":[]},{"poster":"Storiaron","date":"2019-10-31T02:45:07.226+0000","title":null,"up_votes":1,"down_votes":0,"body":"Szerintem annyi érdekes ötletet pakoltak egybe, hogy lehetetlen lesz anélkül balanszolni, hogy valamelyiket el ne vennék/jelentéktelenné tennék.\n\nA mass camo nekem nagyon úgy tűnik, hogy hónapokon belül el fog tűnni, de legalábbis nagyon gyengítve lesz.\n\nKár érte","replies":[]}]}