{"poster":"Sicio","date":"2015-03-18T13:25:57.184+0000","title":"[Suggerimento Oggetti] Oggetti da support","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Due consigli:\r\nRegolare il gold value di 2 oggetti da support, uno ormai poco utilizzato se non nell'ultimo tier, il \"Talisman of Ascension\" e l'altro che perde di utilità il più delle volte dal primo tier il Frost Queen's Claim.\r\n\r\nun consiglio è poter cambiare il primo tier dell'oggetto da support gratuitamente, tipo da pugnale a coin e viceversa.\r\nL'altro è dare un senso al tier 1 del coin tipo con 50%mana reg, lo stesso per il tier2 dare 50% e 50%.\r\ne dare un senso al tier2/3 del frost.\r\nConsiglio: è dare regen mana 100% al frost per aumentare il gold value al suo effettivo costo.\r\ne per il coin dare il 15% di CDR al tier3\r\n\r\nin questo modo si da senso a giocare un support ap aggressivo, con un sustain di mana decente, \r\nda un support ap di controllo, cappando con 2 oggetti CDR.\r\n\r\nin definitiva:\r\nCoin tier 1. +25%mana reg.\r\nCoin tier 2. +25%mana reg. + 25% heal reg.\r\nCoin tier 3. +5% CDR.\r\n\r\nPugnale tier 1. invariato\r\nPugnale tier 2. invariato\r\nPugnale tier 3. +50%Mana reg.\r\n\r\nSpero venga almeno letta.\r\n\r\nSaluti.","replies":[{"poster":"IrrationalNumber","date":"2015-03-18T15:47:23.699+0000","up_votes":2,"down_votes":0,"body":"Gli oggetti da supporto van tutti bene, son quasi tutti utilizzati con la stessa frequenza. Quasi tutti calano in termini di efficacia come il game prosegue per il semplice fatto che il supporto spende meno tempo in linea a farmare minions con qualcuno.","replies":[{"poster":"Sicio","date":"2015-03-19T10:33:58.762+0000","up_votes":1,"down_votes":0,"body":"Scusami ma la tua affermazione non ha senso. Perché un oggetto deve scalare male? Perché esco dalla lane? il support non spende proprio tempo a farmare, e meno ci stà in lane e più diventa utile... Quindi dovrebbe scalare meglio fuori dalla lane -.-'\n\nConsiderando il fatto che tutti sono sovraccosto dal primo tier perché oltretutto deve anche scalare male?\n\nVogliono far uscire il support dalla bot basta guardare bard per capire che non lo vogliono un support a togliere exp in lane, almeno dategli un oggetto che abbia il suo gold value, non sto esagerando con le modifiche. il 3° tier a suo modo l'attiva ha un suo senso per il support, uno gela uno scuda, uno speedda ok ci stà. \n\nMa le stats normali sono sovraccosto. tutto qui.\n\nQualsiasi support potrebbe affermarlo.","replies":[{"poster":"IrrationalNumber","date":"2015-03-19T11:27:24.818+0000","up_votes":1,"down_votes":0,"body":"Il supporto fuori dalla lane:\n\nSe ha spellthief, non ha torri/champ da pokare\n\nSe ha ancient coin, non ci son minion che muoiono intorno\n\nSe ha targon brace, non ha minion da uccidere.\n\nBard prende xp dalle chimes, non serve un buff agli oggetti da support per lui.\n\nSe il support roama, si prende i rischi di non concludere nulla, gli stessi di un jungler che non farma e ganka.\n\nIl supporto se da le kill in lane o protegge l adc cosi che possa farmare senza difficolta', fa bene il suo lavoro. C'e' un motivo se l adc ha bisogno di un compagno, ed e' quello di farsi item forti il prima possibile senza subire gank o avendo a disposizione un forte disengage, non di raggiungere il lv 18 prima degli avversari.","replies":[{"poster":"Sicio","date":"2015-03-19T13:31:16.176+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Tomatotimer,realm=EUW,application-id=MJVj50Jw,discussion-id=f0akd9QU,comment-id=000000000000,timestamp=2015-03-19T11:27:24.818+0000)\n>\n> Il supporto fuori dalla lane:\n> \n> Se ha spellthief, non ha torri/champ da pokare\n> \n> Se ha ancient coin, non ci son minion che muoiono intorno\n> \n> Se ha targon brace, non ha minion da uccidere.\n> \n> Bard prende xp dalle chimes, non serve un buff agli oggetti da support per lui.\n> \n> Se il support roama, si prende i rischi di non concludere nulla, gli stessi di un jungler che non farma e ganka.\n> \n> Il supporto se da le kill in lane o protegge l adc cosi che possa farmare senza difficolta', fa bene il suo lavoro. C'e' un motivo se l adc ha bisogno di un compagno, ed e' quello di farsi item forti il prima possibile senza subire gank o avendo a disposizione un forte disengage, non di raggiungere il lv 18 prima degli avversari.\n\nAbbiamo una concenzione differente di support. Tu supporti l'adc, io al team, o alle lane in difficoltà, sopratutto se l'adc riesce a cavarsela bene da solo, magari perché la bot avversaria ha un caunter support... Cmq GG. La mia era un'idea e non mi sembravano così OP o fuori luogo come modifiche, sopratutto il cambio di oggetto al primo tier.","replies":[{"poster":"IrrationalNumber","date":"2015-03-19T13:33:45.856+0000","up_votes":1,"down_votes":0,"body":"Non era semplicemente necessaria.\n\nI primi 10-15 minuti sono dedicati all adc. I teamfight partono dopo. Gli obiettivi e le torri raramente li prendi senza un buon adc.\n\nE nei teamfight la tua attenzione dovrebbe essere comunque concentrata sul proteggere adc e apc, a meno che tu non sia l engager.","replies":[]}]}]}]}]},{"poster":"Frattaglia","date":"2015-03-19T11:38:10.309+0000","up_votes":1,"down_votes":0,"body":"In realtà, al di là dell'ancient coin, sono spesso in dubbio se e quando chiudere gli altri due oggetti da support (però il livello 2, che è op per tutti, lo prendo sempre).","replies":[{"poster":"Sicio","date":"2015-03-19T13:37:46.436+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Frattaglia,realm=EUW,application-id=MJVj50Jw,discussion-id=f0akd9QU,comment-id=0001,timestamp=2015-03-19T11:38:10.309+0000)\n>\n> In realtà, al di là dell'ancient coin, sono spesso in dubbio se e quando chiudere gli altri due oggetti da support (però il livello 2, che è op per tutti, lo prendo sempre).\n\nIn verità il tier2 del dagger il più delle volte puoi non farlo. per poi optare al tier3 del coin se hai un hard engage, se lo fai è per finire l'item.\n\nMa il discorso è solo una questione di gold value, il concept degli oggetti è simpatico e ok.\n\nGGWP","replies":[]}]}]}