{"poster":"Ang3LCrVzY","date":"2017-07-14T22:37:00.683+0000","title":"Perma-Bans+Penalties & rage-reporting","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"Okay, so an old account of mine got banned. I know what you people are gonna say \"You deserved it\", yeah, whatever. =D\r\nBut this isn't about me, this is about the rage-reporting going around and people getting penalties and banned when they really shouldn't.\r\nA friend of mine got banned for \"inting\" - she went about 20/5 in that match. That's hardly inting, wouldn't you agree?\r\n\r\nAnyways. so I contacted Riot's support team about this and I was told they have filters in place to manage false reports and make sure they don't go through. I find this to be quite amusing, since these filters clearly need some tweaking.\r\nI actually tested this myself once. I did nothing but swear and trash talk for a whole game - not a single report. In fact, I got honoured.\r\nNext game, all I did was try to be nice to people, and I even offered to teach one guy how to play - chat penalty.\r\n_Ridiculous, right?_\r\n\r\nHonestly, I just want Riot Games to manage their system more efficiently, too many players get falsely reported for things, and it actually goes through, usually because they get multiple reports at once.\r\n_Like, hello? Ever heard of bullying? Or peer pressure or 'mob mentality'? One guy decides to blame the loss on the mid laner, and everyone goes along with it - BAM! Reported for inting by all 4 teammates - instant penalty.\r\nAnd if 4 people on a team ask the enemy team to report someone, you honestly believe the enemy will believe the supposedly reportable person?_\r\n================================================\r\nSo anyways, here's my suggestion to Riot Games:\r\n\r\nLet's say, that a player is reported and a bot checks it. Let's say that  moderator has to log into the system to issue a ban.\r\nAnd that penalties issued by bots/the system/non-humans can**not** be bans (especially not perma-bans).\r\n\r\nAnd that every time the system determines that a player should be punished for something, they get some sort of temporary or \"holding punishment\", like maybe **a limited number of games per day** or just a chat restriction until a moderator double-checks the penalty, and then more severe penalties are issued from there, for example reduced honour, bans etc.\r\n**BUT** if the penalty was inaccurately issued, then compensation is in order. Free RP hardly sounds reasonable, but free chests and key pieces should be doable.\r\nOr maybe you could implement a reform system, give banned players a second chance. Although, I know you've done this before and it didn't go so well but seriously. There **are** perma-banned players who genuinely regret what they did or just got unlucky and got falsely reported.\r\nMaybe, if a player can hit Level 30 on a new account without getting any penalties, their ban gets lifted. Or maybe just make the criteria really difficult, e.g. hit silver and your ban goes - that way most people would just give up before starting. You already weed out some of the truly toxic ones.\r\nOnly people serious about reforming would take a chance like that, _hit silver without a single penalty and you get your account back_.\r\n\r\nIt's worth a shot, ain't it?\r\n\r\n{{champion:81}} _\"No turning back now.\"_","replies":[{"poster":"Broporo","date":"2017-07-15T01:16:50.076+0000","up_votes":1,"down_votes":0,"body":"So I want to touch on your proposed idea first. This is actually something we did awhile back! We offered to give permabanned accounts the ability to earn their way back in by creating a new account and leveling it to 30 without any confirmed reports. The results? At most about 5% of players were able to complete the challenge.\n\nWith that being said, I also want to point out that reports alone don't get people banned. We do take the time to review reports to see what might be going on, and if falsely banned everyone is more than welcome to shoot us a ticket to see what might have happened and have that ban reviewed.","replies":[{"poster":"Ang3LCrVzY","date":"2017-07-21T04:33:04.099+0000","up_votes":1,"down_votes":0,"body":"I am aware of you guys attempting the reform system and it having the ridiculously low success rate. I looked into it.\n_Reach level 20 with no penalties and you get your account back._ Correct?\nAlready at level 19 on an alt and I haven't gotten any penalties yet. =3\nStill though, I'm not asking for my account back, and I understand that low success rates and impracticality would impede attempts at a reformation system. But I've also been told that, outside of your aforementioned attempt, you don't rescind bans or penalties issued by the Instant Feedback System.\n\nAs for the ticket to support, honestly, I wasn't 'griefing' that game. But constructive criticism while losing does seem very similar. It's not my fault if I say \"we're gonna lose probs\" early on and turn out to be right.\nSo what I've done on my alt is stayed positive like a cheesy person. =D\nNo penalties, and no reports to my knowledge.","replies":[]}]}]}