{"poster":"Slyzór","date":"2016-05-25T20:13:43.471+0000","title":"Nur 13 Lp pro Sieg ?","subforum":"Ligen & gewertete Spiele","up_votes":1,"down_votes":1,"body":"Hey, ich bin Bronze 3 und ich bekomme pro gewonnenes Spiel nur +13 Lp und pro Niederlage -20 Lp. Wie kann das sein. Ich habe alle meine 10 einranked Spiele verloren und wurde Bronze 5 geranked. Letzte Season war ich unranked. Ich bin ein &quot;guter&quot; Bronze Spieler und bekomme oftmals S. Insgesamt in Ranked habe ich 29 gewonnen und 21 verloren. Ich bekomme seitdem ich aus Bronze 5 bin nur +13 Lp und -20lp. Wie kann das sein?","replies":[{"poster":"MeMyselfandBaal","date":"2016-05-25T22:01:17.673+0000","up_votes":3,"down_votes":0,"body":"also mein erste Blick auf deine Matchhistory... wird das Problem auf die DuoQ oder Tripple Q schieben. \n\nJa, du hast gerade eine erstaunlich hohe Winrate. Du hast diese aber halt auch, weil du mit Silber 2 und 1 Typen Duo oder Tripple Que spielst... btw: an der Stelle ist es auch absurd einfach, ein guter Bronze Spieler zu sein...\n\nUnd der Fakt, dass du dich halt (wenn auch im völlig legalen Rahmen, also unter Freunden und in dem ihr gemeinsam spielt) gerade \"boosten\" lässt, ruiniert halt wahrscheinlich sogar eure komplette MMR...\nIhr stellt halt den Algorithmus vor die an und für sich unlösbare Aufgabe, für euer Verhalten eine gerechte MMR Verteilung zu finden. Die eine Lösung, die Riot gefunden hat, ist euch mehr LP Abzuziehen als Gutzuschreiben.\n\nSpiele mal 20 Spiele allein oder nur mit Bronze Freunden, dann wird sich das Problem (egal in welche Richtung) gelöst haben...\n\nUnd ja, das kann man als Unfair bezeichnen... aber genau so unfair (für eine nicht verzerrte Rangliste) ist deine 80%ige Winrate mit deinen High Silver Mates...","replies":[]},{"poster":"LeeCarterSchwarz","date":"2016-05-25T20:14:58.905+0000","up_votes":1,"down_votes":0,"body":"d.h dass deine MMR richtig beschissen ist besser du bleibst diese Season in Bronze und trainierst fleissig.","replies":[{"poster":"Slyzór","date":"2016-05-25T21:22:15.980+0000","up_votes":1,"down_votes":1,"body":"alles klar danke für den Tipp.... nicht","replies":[{"poster":"SeaHorseCalamity","date":"2016-05-26T09:51:25.852+0000","up_votes":2,"down_votes":0,"body":"Nimm dir den Tipp zu Herzen. Deine MMR ist gerade nicht gut, denn sonst würdest du mehr Punkte bekommen als verlieren. Deshalb der Vorschlag mit Training. Du steigst ja nicht auf, weil du Glück hast, sondern weil du besser spielst als andere Leute.\nWenn du die MMR also mit deinem jetzigen Können nicht geregelt bekommst, musst du mehr trainieren.","replies":[]}]}]},{"poster":"Sałtyy","date":"2016-05-25T20:34:41.486+0000","up_votes":2,"down_votes":0,"body":"\"Ich bin ein \"guter\" Bronze Spieler und bekomme oftmals S\"\n\n\nUhm okey, ein S sagt nicht viel aus, könnte auch sein das deine Gegner (wie es in Bronze 5 oft der fall ist) Bot Niveau hatten. ^^","replies":[{"poster":"Slyzór","date":"2016-05-25T21:21:41.364+0000","up_votes":1,"down_votes":2,"body":"hahah war so klar das so nen typ wie du kommst","replies":[{"poster":"Sałtyy","date":"2016-05-25T22:18:24.280+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Slyzór,realm=EUW,application-id=ip27PlEH,discussion-id=YHw0KQzz,comment-id=00010000,timestamp=2016-05-25T21:21:41.364+0000)\n>\n> hahah war so klar das so nen typ wie du kommst\n\nWieso? es is einfach tatsache ,)","replies":[]}]}]}]}