{"poster":"rsgüawhiao","date":"2017-02-12T19:13:48.132+0000","title":"5 Banns Pro Seite","subforum":"Champions & Gameplay","up_votes":3,"down_votes":3,"body":"Hey ich spiele league seit der season 2 (das hier ist mein smurf) und wollte mal als diskussion stellen 5 bans pro seite eines Teams zu haben.\r\nDenn wie ich finde gibt es zu viele wirklich zu viele fehler beim balancing von LoL was auch nicht weiter schlimm ist es kann ja nicht alles perfekt sein, aber weil es so viele OP Champs (Starke Champions) gibt denke ich das wir lieber 5 vlt auch nur 4 bans pro seite haaben sollten weil 6 bans nur? Da bleiben ja 6 andere sehr starke champs zur auswahl und das ist viel! Aber was ein kontra ist sind die leute die die champs von anderen mitgliedern bannen bloss weil sie ihre Rolle nicht bekommen haben oder sonst anderes passiert ist.&lt;---------- zu dem Thema w&uuml;rde ich vlt auch was vorschlagen wie zb eine message das wenn man einen champ von der eigenenseite bannen m&ouml;chte ein fenster aufploppt und den jenigen warnt der dies tuhen m&ouml;chte.\r\n\r\nLG SnoWz_","replies":[{"poster":"Andrej553","date":"2017-02-13T07:38:02.608+0000","up_votes":2,"down_votes":1,"body":"Feigling. Poste gefälligst mit deinem Main Account. Oder lass den Teil das du ein Smurf bist weg.\n\nIch bin nicht der Meinung das Spiel wäre unbalanced aber es sollen ja eh 10 Bans eingeführt werden.","replies":[{"poster":"rsgüawhiao","date":"2017-02-13T18:03:48.968+0000","up_votes":1,"down_votes":0,"body":"nö weiss du auch wieso? weil ich mich nicht von einem Typ der denkt auf dicke hose zu machen mich rumkomandieren zu lassen. Und wenn du schon so salzig bist dann lass es doch gleich im spiel raus damit Riot Games dich bannen kann und wenn du denkst das ich bronze bin ne ich bin platin 3 und 100lp (nukerftw) :)","replies":[{"poster":"Andrej553","date":"2017-02-14T07:49:57.881+0000","up_votes":3,"down_votes":0,"body":"Es ist einfach Bullshit zu behaupten man wäre ein Smurf um seine Argumente zu \"verbessern\".\nEs gibt keinen Grund weshalb du deinen Main verschleiern müsstest - und nur durch deine Behauptung können wir es auch nicht nachprüfen.\n\nWo kommandiere ich dich eigentlich herum? Ich habe gesagt du bist ein Feigling und das du dich nicht informieren kannst.\n\nUnd wenn du die Elokeule rausholen möchtest: Gratulation ich bin seit 3 Seasons Diamond.","replies":[]},{"poster":"BigSnipe","date":"2017-02-13T21:15:20.167+0000","up_votes":2,"down_votes":0,"body":"Du kommst rüber wie ein 12Jähriger noob der Yasuo maint und in B5 rumgammelt. Das du sagst das dieser ACC dein Smurf ist macht es nicht besser, besonders da er nichtmal Level 30 ist^^\n\nZumal dein Post vollkommen unnötig ist. Denn wenn du richtig lesen könntest wüsstest du, dass es bald 5 Banns pro Seite gibt. Und es wird jeder nen Bann haben! \nAlso verhalte dich mal wie ein Erwachsener bevor du auch dicke Hose machst!\n{{sticker:zombie-nunu-bummed}}","replies":[{"poster":"rsgüawhiao","date":"2017-02-13T22:36:31.231+0000","up_votes":1,"down_votes":3,"body":"***","replies":[{"poster":"BigSnipe","date":"2017-02-14T10:19:40.480+0000","up_votes":1,"down_votes":0,"body":"Dafür das ich so agressiv rüberkomme hat mein Post garnichtmal viele downvotes^^\n\nps: man kann Posts bearbeiten...doppelposts sind in Foren unbeliebt!","replies":[]}]},{"poster":"rsgüawhiao","date":"2017-02-13T22:34:30.833+0000","up_votes":1,"down_votes":3,"body":"Ich möchte ja nicht wie ein 12 Jähriger rüberkommen aber Leider gebe ich einen scheiss auf deine meinung und wenn du richtig lesen könntest dann überlegt sich riot das mit den 5 banns pro seite ausserdem maine ich zed yasuo rengar talon khazix bin aber gut (plat2).Ausserdem würde ich auch nicht so agressiv zu anderen sein das ist nicht gut weil du wie ein asozialer summoner rüber kommst {{sticker:slayer-pantheon-thumbs}}","replies":[]}]},{"poster":"NukerFTW","date":"2018-11-11T01:27:55.282+0000","up_votes":1,"down_votes":0,"body":"geb dich bitte nicht als ein anderer Spieler aus. ;)","replies":[]}]}]},{"poster":"Oberst Ouzo","date":"2017-02-13T10:22:18.391+0000","up_votes":2,"down_votes":0,"body":"Also bei \"Frag Riot\" steht soweit ich das richtig verstanden haben drin, dass es noch ein paar patches dauert bis der 10 bann in die untere klasse kommt.","replies":[]},{"poster":"XenesisCH","date":"2017-02-12T19:22:00.403+0000","up_votes":1,"down_votes":0,"body":"Gibt es doch schon, aber erst in der LCS ;-). Wer weiss vielleicht wird dies in naher oder ferner Zukunft auch im Draft-Pick eingeführt^^","replies":[{"poster":"rsgüawhiao","date":"2017-02-12T19:35:35.635+0000","up_votes":2,"down_votes":0,"body":"Danke für dein Kommentar Ich würde mich freuen wenn dies in normal / ranked draft eingeführt wird {{sticker:slayer-jinx-wink}}","replies":[{"poster":"Alustus","date":"2017-02-12T21:58:12.030+0000","up_votes":1,"down_votes":0,"body":"Es ist soweit ich das mitbekommen habe sogar in planung, dass es auch im \"Normalo\" bereich kommt.\n\nQuelle:\nhttp://euw.leagueoflegends.com/de/news/community/q/frag-riot-drei-ruckerstattungen-10-banne","replies":[]}]}]},{"poster":"Sirrkas","date":"2017-02-12T22:32:55.289+0000","up_votes":1,"down_votes":0,"body":"Argumente mehr Banns zu haben, weil es zu viele \"OP Champions\" gibt, ist eher etwas kurz gedacht. Wenn man die 6 stärksten Champions bannt, gelten die nächsten 6 als OP. Wenn man die 10 stärksten Champions bannt, gelten immer noch die nächsten 6 als OP.\n\nViel passender finde ich da das Argument, dass es fairer wäre, wenn jeder Spieler einen Bann hat. \n\nVon anderen wurde ja bereits erwähnt, dass mehr Banns ohnehin schon in Planung sind.","replies":[{"poster":"BigSnipe","date":"2017-02-13T21:17:19.651+0000","up_votes":1,"down_votes":0,"body":"Ja da hast du recht, als ADC banne ich zB immer Yasuo, nicht weil er besonders stark ist sondern weil er dich durch eine gute W im TF komplett useless machen kann.","replies":[]}]},{"poster":"ELOW Cronos","date":"2017-02-13T09:45:02.302+0000","up_votes":1,"down_votes":0,"body":"Hmm fände ich gut ^^.\n\nSo hat jeder einen Bann und ist somit gleichberechtigt in der Champselect.\nBtw finde ich den aktuellen Patch als sehr angenehm zum spielen. In 7.3 wurden die meisten \"OP-Champs\" generft so das aktueller keiner richtig aus der Masse heraussticht und ich jedes Spiel andere Banns sehe.","replies":[]},{"poster":"AmazingJX","date":"2017-02-13T09:18:08.880+0000","up_votes":1,"down_votes":0,"body":"Das wird gut mit 10 banns...","replies":[]},{"poster":"GebuschMann","date":"2017-02-13T02:13:49.243+0000","up_votes":1,"down_votes":0,"body":"Also ich würde mich darüber freuen, mein Championpool ist groß genug um 10 Bans zu verkraften. Der vieler Spieler in meiner Elo nicht ( Vorteil für mich😏). Und so ganz nebenbei fände ich es gut wenn man den ganzen Onetricks richtig schön eins reindrückt( vorallem denen die einen Champion der Oft gebannt wird mainen z.b. Yasuo).Also um es kurz zu fassen ich wäre dafür, wenn es nachmir ginge sollte jeder 2 Champions bannen können(20 ingesamt).","replies":[]},{"poster":"Released Ape","date":"2017-02-12T23:32:56.109+0000","up_votes":1,"down_votes":0,"body":"Sobald der alte Client \"abgeschaltet\" wird, wird es für uns auch 5 Banns geben - aber das auch nur, wenn Riot sich nicht doch umentscheidet. Das kann aber noch eine ganze Weile dauern, weil noch eifrig am neuen Client weitergearbeitet wird.","replies":[]},{"poster":"onlyYasuo97","date":"2017-02-12T20:51:28.180+0000","up_votes":1,"down_votes":1,"body":"***","replies":[{"poster":"Snorlax irl Slav","date":"2017-02-12T20:54:37.944+0000","up_votes":1,"down_votes":0,"body":"gar kein yasuo ? JA UNBEDINGT PLS RITO :D","replies":[{"poster":"onlyYasuo97","date":"2017-02-12T21:13:08.010+0000","up_votes":1,"down_votes":0,"body":"***","replies":[{"poster":"Alustus","date":"2017-02-12T21:59:11.562+0000","up_votes":1,"down_votes":0,"body":"Naja bei 10 Banns wird die wahrscheinlich auch sehr of gebannt sein ;)","replies":[]}]}]}]},{"poster":"Pure Cynicism","date":"2017-02-12T20:20:51.962+0000","up_votes":1,"down_votes":0,"body":"Finde nicht, dass das nötig ist. Man muss jetzt schon 10 Minuten für die Spielvorbereitung einplanen. Im Pro-Bereich, in dem es auf kleine Stärken und Schwächen ankommt, macht das neue System Sinn, weil man dadurch mehr Vielfalt erreicht. Für die SoloQ brauche ich das aber nicht.","replies":[]},{"poster":"KéksRind","date":"2017-02-12T21:07:38.416+0000","up_votes":1,"down_votes":2,"body":"Les doch ma die news omg bist du un informiert unnötiges thema..","replies":[{"poster":"rsgüawhiao","date":"2017-02-13T18:05:50.894+0000","up_votes":1,"down_votes":0,"body":"mir egal :D","replies":[]}]}]}