{"poster":"Jean Djorkaeff","date":"2017-11-20T15:05:08.156+0000","title":"El tiempo que tenemos para cambiar las runas en normal..","subforum":"Charlas Generales","up_votes":2,"down_votes":0,"body":"Ya todos sabemos lo que las nuevas runas son, y tambi&eacute;n que tenemos que acostumbrarnos. A lo que s&iacute; no me puedo acostumbrar es al tiempo que dan para comenzar una partida normal, pongamos un ejemplo:\r\n\r\nEstoy en selecci&oacute;n de campe&oacute;n, quiero ir adc, pero alguien me gana.. entonces ahora me queda supp y estoy indeciso si ir Soraka o Nautilus (diferentes runas para cada uno), por lo que demoro los 60 primeros segundos en elegir un campe&oacute;n y elijo nautilus.\r\nPero me acuerdo que NO tengo las runas de nautilus, entonces me pongo a editarlas (en solo 25 segundos), y boom empieza la partida.\r\nNi teniendolas escritas a las runas me da el tiempo, pero s&iacute; me da cuando elijo un champ rapidisimo y me pongo a editar las runas con tiempo.\r\nAntes era mucho mas facil con las maestrias por ejemplo, por que solo era hacer click sobre alguna y ya, ahora hay que hacer click, esperar la animacion, elegir cual de las 5 ramas, despues seleccionar la primera, esperar la animacion, elegir una de las 3, y asi con todas.\r\n** Esto de las animaciones solo afecta a PC&#039;s con no mucho rendimiento, aclaro.\r\n\r\nNo pido que pongan mas tiempo, capaz seria una eternidad para la gente que ya tiene su champ y sus runas preparados, pero alguna solucion tal vez se podria dar.\r\nYa me ha pasado en m&aacute;s de una partida que entro con las runas equivocadas por no darme el tiempo para editarlas, he ido hasta vayne con runas de teemo xD Aunque igual no afecta 100% a la partida, si que unas runas que vayan acorde al campeon ayudan bastante en el early y mid-game.\r\n\r\nGracias (?","replies":[{"poster":"SKT T1 Bank","date":"2017-11-20T15:17:38.756+0000","up_votes":2,"down_votes":1,"body":"Ashe con runas tanke, como buen main adc sabes que son la respuesta a los asesinos ?)","replies":[]},{"poster":"Rick Silence","date":"2017-11-20T16:03:24.902+0000","up_votes":1,"down_votes":0,"body":"Tenés el cliente en modo de bajo rendimiento?","replies":[{"poster":"Jean Djorkaeff","date":"2017-11-27T04:36:09.323+0000","up_votes":1,"down_votes":0,"body":"Sep","replies":[]}]}]}