{"poster":"TheGman101","date":"2014-12-02T22:28:02.214+0000","title":"Secret OP/new main","subforum":"[ARCHIVED] Miscellaneous","up_votes":4,"down_votes":0,"body":"I am ok at all positions but want to start maining one and I want someone who you think is good to main and use to carry out of bronze? I'd prefer a secret OP champ to main that won't likely get nerfed soon. Thanks!","replies":[{"poster":"The Chin","date":"2014-12-02T23:09:11.273+0000","up_votes":7,"down_votes":0,"body":"I climbed out of bronze with {{champion:21}} ADC  - she's way stronger than people think","replies":[{"poster":"Alpharite","date":"2014-12-03T02:41:04.196+0000","up_votes":1,"down_votes":0,"body":"I can second this, while I don't play her, I've seen how underated she is.","replies":[]}]},{"poster":"VaultRat","date":"2014-12-03T19:27:58.622+0000","up_votes":3,"down_votes":0,"body":"{{champion:31}} full AP Cho'gath","replies":[{"poster":"TheGman101","date":"2014-12-03T20:39:27.004+0000","up_votes":1,"down_votes":0,"body":"> {{champion:31}} full AP Cho'gath\n\nIs he good?","replies":[{"poster":"Zirzon","date":"2014-12-04T15:18:11.354+0000","up_votes":2,"down_votes":0,"body":"In my opinion, yes. You just need to get good with hitting his q.\n\nI'd suggest that you get mostly tanky ap items (RoA, Rylais, Zhonyas). I've also liked building the new Righteous Glory depending on my team's initiation ability. One nice thing is that Cho can build very reactively depending on your and your opponent's team comps.\n\nA nice bonus is that he can play pretty much anywhere (other than adc).\n\nI've been playing Cho more often recently, and was surprised at how much I enjoyed it.","replies":[]}]}]},{"poster":"Alpharite","date":"2014-12-02T23:15:44.510+0000","up_votes":1,"down_votes":0,"body":"MALZAHAR! \n\nHere are a few others: http://www.nerfplz.com/2014/10/october-solo-queue-sleeper-op-champions.html\n\nThere are also some not so sleeper op champs that can carry out of bronze, for example, Akali (when not banned)","replies":[{"poster":"TheGman101","date":"2014-12-02T23:46:04.568+0000","up_votes":1,"down_votes":0,"body":"Awesome thanks!! How good is Olaf??","replies":[{"poster":"Alpharite","date":"2014-12-03T01:42:09.821+0000","up_votes":1,"down_votes":0,"body":"Ehhh... Not very good\n\nI mean, not Urgot tier, but definitely not someone I would ever use.","replies":[{"poster":"TheGman101","date":"2014-12-03T02:24:13.561+0000","up_votes":1,"down_votes":0,"body":"Ok who are some good underated AD champions? P","replies":[{"poster":"Alpharite","date":"2014-12-03T02:35:30.207+0000","up_votes":3,"down_votes":0,"body":"AD as in a ranged ADC, or a bruiserish top laner?\n\nFor marksman, Ashe is surprisingly good atm, but the current queen of bot lane is Jinx with Corki at a close second. Graves has also been on the upward lately, while MF has the potential to be good and is an unknown pick. Bot lane meta changes almost every second patch due to the obscene amount of nerfs ADCs recieve when they become popular (Kog, Trist, Lucian, etc.).\n\nFor melee ADCs, Riven is terrifying when someone learns how to animation cancel. While she is easy to pick up, playing her to full potential is very, very hard. Fiora is a great low elo pick, but if you don't snowball or get focused, you're useless. My personal reccomendation would be Wukong, amazing winrate but very, very low popularity and ban rate (which is a very good thing). His kit has a bit of everything, he can be built with more damage or more tank depending on situation, and he has a decent laning phase considering how well he scales into lategame.\n\nThere are others too, those were just off the top of my head.\n\nLastly, I would reccomend you check out this website:\nhttp://www.nerfplz.com/2014/11/2014-champion-tier-list-solo-queue_26.html?m=1\n\nSons listings may seem odd at first (Thresh tier 2, Lee Sin tier 2, Zed tier 2, etc.), but the author is a diamond player who has made the list specifically for low elo players looking to climb quickly and effectively. The list takes into account not just, for example, LCS play, but also the skill cap of a champ (hence why Lee is so low), their pickrate, how often they are banned, how they do against other popular picks, etc.) and so is very helpful.\n\nHope this helped.","replies":[{"poster":"TheGman101","date":"2014-12-03T11:38:06.255+0000","up_votes":1,"down_votes":0,"body":"Awesome thank you! I will try all 3 of those!!","replies":[]}]},{"poster":"Zydron","date":"2014-12-04T15:27:54.351+0000","up_votes":1,"down_votes":0,"body":"Try Quinn mid, I hear it's really strong and a popular YouTube just posted a video about, he is called RedMercy. I personally haven't tried it, but after thinking about it, it sounds really strong.  good roams with ult,  really strong level 1,  and scales really well.","replies":[]}]},{"poster":"Rinky Dinky","date":"2014-12-04T11:37:36.677+0000","up_votes":1,"down_votes":1,"body":"Urgot tier. A great champ when strategy is used, or people play him in the proper comps (Or play him CORRECTLY)\n\nNot a bad thing. If we want to call a champion useless, we have the newly created Cassiopeia tier. Enjoy.","replies":[{"poster":"TheGman101","date":"2014-12-04T11:39:40.471+0000","up_votes":1,"down_votes":0,"body":"> Urgot tier. A great champ when strategy is used, or people play him in the proper comps (Or play him CORRECTLY)\n> \n> Not a bad thing. If we want to call a champion useless, we have the newly created Cassiopeia tier. Enjoy.\nWait? Urguot is good?","replies":[]}]}]},{"poster":"Bodkins Odds","date":"2014-12-03T00:03:29.086+0000","up_votes":1,"down_votes":0,"body":"He's a bit better now that Righteous Glory is available, but he's still in a bad spot right now. There's a reason why character's who have been nerfed into oblivion are said to be \"Olaf'd.\" I'd say he's finally playable again now, especially in the jungle, but you're not really going to carry the game as him.","replies":[{"poster":"TheGman101","date":"2014-12-03T00:14:19.576+0000","up_votes":1,"down_votes":0,"body":"Thanks! I played him a lot pre nerf and I used to play a while ago, like beginning of season 3 and didn't he get nerfed after an Lcs game where he got a kill top, then two people came up from mid and he got a double! And yeah I am interested in picking him up again! Would his top lane be ok? Given I'm playong in b5? What build would you recommend?","replies":[{"poster":"Bodkins Odds","date":"2014-12-03T00:19:08.932+0000","up_votes":1,"down_votes":0,"body":"His top would okay against some of the less mobile matchups. I'm not quite sure about the build, though. Definitely want Righteous Glory for the engage, but other than that I'm not sure.\n\nProbably a Hydra and a brutalizer for damage. Then some tank.","replies":[{"poster":"TheGman101","date":"2014-12-03T00:35:44.717+0000","up_votes":1,"down_votes":0,"body":"Ok thanks!  I will try it out if I can","replies":[]}]}]}]}]}]},{"poster":"Squeaky Dreemurr","date":"2014-12-03T00:47:10.110+0000","up_votes":2,"down_votes":1,"body":"Try Akali... If you get comfortable with her, she rolls face like no other champion.  Players in Gold (my tier atm) still get stomped by her.  Point and click. Point and click. Point and click.\n\nI like her jungle, but she's popular top and mid.  I find mid is best for snowballing games, as you have access to both top and bot.","replies":[{"poster":"TheGman101","date":"2014-12-03T02:22:58.911+0000","up_votes":1,"down_votes":0,"body":"Ok thank you!","replies":[{"poster":"Alpharite","date":"2014-12-03T02:31:43.645+0000","up_votes":3,"down_votes":0,"body":"Main problem here is that while Akali is stupidly OP, she's not sleeper and has a massive banrate. Not a good main, you'll barely ever play her.","replies":[{"poster":"The Chin","date":"2014-12-03T04:18:09.332+0000","up_votes":1,"down_votes":2,"body":"I rarely see akali banned. If you tell your team not to ban it you could play her 4 out of 5 times","replies":[{"poster":"Alpharite","date":"2014-12-03T13:01:46.765+0000","up_votes":1,"down_votes":1,"body":"What????? 50% ban rate below gold....","replies":[{"poster":"The Chin","date":"2014-12-03T19:44:56.690+0000","up_votes":1,"down_votes":0,"body":"Really? I'm seeing 20% \n\nhttp://www.lolking.net/charts?region=all&type=bans&range=weekly&map=sr&queue=1x1&league=ranked\n\nWhere did you get 50%?","replies":[{"poster":"Rinky Dinky","date":"2014-12-04T21:58:50.268+0000","up_votes":2,"down_votes":0,"body":"Winrate does not dictate a champions balance in most cases. Example, Lee Sin (Pre AS debuff nerf).\n\nHis winrate has always sucked because everyone and their mother plays him. He was undeniably op before that nerf. His winrate is still in the 30% in overall solo queue (Correct me if there was a recent development)\n\nThen look at champions like Sona, Ash. and Varus, whom all usually sit at 50%. Are they OP?\n\nWarwick however, has a winrate of 109%, and a huge pick or ban ratio. That is how you tell if a champion is op. Its not just winrate, you have to take pick and ban rate into account as well.","replies":[{"poster":"The Chin","date":"2014-12-04T22:35:52.992+0000","up_votes":1,"down_votes":0,"body":"Ok. \n\nWe were talking about ban rates, specifically how often he'd get to play {{champion:84}} in ranked\n\n\nBut you've definitely got your numbers wrong, WW has a win rate of 60%.","replies":[{"poster":"Rinky Dinky","date":"2014-12-06T01:22:45.087+0000","up_votes":1,"down_votes":2,"body":"Actually, WW is currently sitting at 109% winrate. How? Blind pick. Warwick is currently losing mostly to other Warwicks.\n\nThere are a few other posts about this on these forums somewhere.","replies":[{"poster":"The Chin","date":"2014-12-06T05:15:48.946+0000","up_votes":2,"down_votes":0,"body":"So for every 10 games WW plays, he wins 11?  \n\nAre you telling me that in mirror matchups, both teams with WW will win? That's the only way you can get a stat like that. \n\nIf a WW plays against another WW, the results should be 1 win and 1 loss, they'd neutralize each other statistically.","replies":[]}]}]}]}]}]}]}]}]}]},{"poster":"Drunk Rummate","date":"2014-12-03T14:43:49.864+0000","up_votes":2,"down_votes":1,"body":"{{champion:143}} is a stupidly powerful support. You can 2v1 bot lane while your ADC farms lol.\n\n{{champion:15}}  is a very underrated ADC.  You can shove your opponent into tower with her W (max it first!).  If they're bronze this means they'll miss a lot of CS.  Sivir's ult is also amazing for catching people out of position and escaping from sticky situations as a team.  Just don't try to 1v1 most AD champions with Sivir. \n\n{{champion:133}}  is also very underrated.  She has a stupidly strong lane phase (especially if you solo lane with her as a top or mid) and her roam/pick potential is disgusting with her ult.","replies":[{"poster":"TheGman101","date":"2014-12-03T16:00:33.765+0000","up_votes":1,"down_votes":1,"body":"> {{champion:143}} is a stupidly powerful support. You can 2v1 bot lane while your ADC farms lol.\n> \n> {{champion:15}}  is a very underrated ADC.  You can shove your opponent into tower with her W (max it first!).  If they're bronze this means they'll miss a lot of CS.  Sivir's ult is also amazing for catching people out of position and escaping from sticky situations as a team.  Just don't try to 1v1 most AD champions with Sivir. \n> \n> {{champion:133}}  is also very underrated.  She has a stupidly strong lane phase (especially if you solo lane with her as a top or mid) and her roam/pick potential is disgusting with her ult.\n\nThank you!! Anyone Tanky I should try?","replies":[{"poster":"Drunk Rummate","date":"2014-12-03T16:05:41.304+0000","up_votes":1,"down_votes":1,"body":"> > {{champion:143}} is a stupidly powerful support. You can 2v1 bot lane while your ADC farms lol.\n> > \n> > {{champion:15}}  is a very underrated ADC.  You can shove your opponent into tower with her W (max it first!).  If they're bronze this means they'll miss a lot of CS.  Sivir's ult is also amazing for catching people out of position and escaping from sticky situations as a team.  Just don't try to 1v1 most AD champions with Sivir. \n> > \n> > {{champion:133}}  is also very underrated.  She has a stupidly strong lane phase (especially if you solo lane with her as a top or mid) and her roam/pick potential is disgusting with her ult.\n> \n> Thank you!! Anyone Tanky I should try?\n\n{{champion:5}}  and {{champion:59}} \n\nBoth can be played top lane and in the jungle.  You build 1 damage item early on, maybe 2 if you're decently ahead with lots of kills, and then full tank.","replies":[{"poster":"The Chin","date":"2014-12-03T19:51:03.843+0000","up_votes":1,"down_votes":0,"body":"Yeah I can vouch for {{champion:5}} in the jungle. I used to be a WW main but obviously I can't do that anymore, but I've found Xin Zhao is almost just as good.","replies":[{"poster":"TheGman101","date":"2014-12-03T20:40:26.464+0000","up_votes":1,"down_votes":0,"body":"> Yeah I can vouch for {{champion:5}} in the jungle. I used to be a WW main but obviously I can't do that anymore, but I've found Xin Zhao is almost just as good.\n\nYeah I either do really well or shit as Xin jungle","replies":[]}]},{"poster":"TheGman101","date":"2014-12-03T19:14:12.622+0000","up_votes":1,"down_votes":0,"body":"> > > {{champion:143}} is a stupidly powerful support. You can 2v1 bot lane while your ADC farms lol.\n> > > \n> > > {{champion:15}}  is a very underrated ADC.  You can shove your opponent into tower with her W (max it first!).  If they're bronze this means they'll miss a lot of CS.  Sivir's ult is also amazing for catching people out of position and escaping from sticky situations as a team.  Just don't try to 1v1 most AD champions with Sivir. \n> > > \n> > > {{champion:133}}  is also very underrated.  She has a stupidly strong lane phase (especially if you solo lane with her as a top or mid) and her roam/pick potential is disgusting with her ult.\n> > \n> > Thank you!! Anyone Tanky I should try?\n> \n> {{champion:5}}  and {{champion:59}} \n> \n> Both can be played top lane and in the jungle.  You build 1 damage item early on, maybe 2 if you're decently ahead with lots of kills, and then full tank.\n\nThank you!! I'll try jarvan top!!","replies":[]}]}]}]},{"poster":"TheGman101","date":"2014-12-05T11:35:11.237+0000","up_votes":1,"down_votes":0,"body":"Awesome!! Thank you man!!","replies":[]},{"poster":"AfroNinja6810","date":"2014-12-03T06:09:28.305+0000","up_votes":1,"down_votes":0,"body":"Top - Riven, **Fiora**, Jax, Darius\nJungle - Master Yi, Lee Sin (albeit a bit more difficult,) **Warwick**\nMid - **Akali**, Fizz, Syndra, Orianna, Ahri, Zed\nADC - Jinx, **Draven**, Graves, Vayne (again, you need to be good with her)\nSupport (if forced to) - Thresh, Leona, Blitz, **Morg**\n\n(Of course there are more, these are just the first to come to mind)\n\nIn low elo especially I would say any of these champs are the easiest to carry with in their respective roles. Mid and Jungle roles are the best for influencing the whole map, and ADC is the best for the solo-carry potential and having the spotlight on you every fight. Master one of these champs for each role and you will get out in no time. Learning more is great to start getting even higher. After a while you can start deviating away from the norm, and start picking more team-friendly support oriented picks, but if your only objective is to climb from bronze it is best to master a carry for each role. Have fun!","replies":[{"poster":"TheGman101","date":"2014-12-03T11:40:38.258+0000","up_votes":1,"down_votes":0,"body":"Thanks a lot man!! That really helps! I will probably try fiora!! Thanks man!","replies":[{"poster":"AfroNinja6810","date":"2014-12-05T09:31:28.909+0000","up_votes":1,"down_votes":0,"body":"> Thanks a lot man!! That really helps! I will probably try fiora!! Thanks man!\n\nWell, since you were open enough to tell me who you would like to try first, I can give some tips: (Tl;DR at the bottom if you want a summary)\n\n- You want to rush a Ravenous Hydra as your first item. From there, 90% of the time you want to build more damage. You aren't much of a tank, but your durability in fights comes from lifesteal and using your ult to dodge damage. I prefer going Ghostblade after Hydra, then I get items like Bloodthrister, Blade of the Ruined King, and sometimes an Infinity Edge. You don't have to get all 3 of those, but I recommend getting at least one of them.\n\n- If you really feel like you need tanky stats after you get some damage, Randuin's Omen and Banshee's Veil are your best options for Armor and MR respectively.\n\n- There are many leveling orders you can go on Fiora, but I prefer starting with Q if against someone I can bully level 1 (maybe Vladimir) or starting W if I feel I need to block a few auto attacks early on (such as from a Gangplank or Jayce). Get your Q by level 2 if not at 1, and all 3 abilities at level 3. From there, I max Q, then E, finally W. However, maxing W first isn't bad at all and sometimes is a good call if you are constantly getting poked. Maxing E first however is normally not too good, and I would not recommend it.\n\n- Depending on your lane opponent, you should either play very aggressively or passively until you find an advantage. Against someone who is weak early, start Q and put the pressure on right away (a good example would be Vlad, poke him down enough and you can kill him at level 3 with ignite.) If against someone strong early, focus on farming until you get a gank, or you hit level 6. At level 6 you have insane kill potential with a full combo dealing nearly 1000+ with a few auto attacks and ignite. You can outduel almost anyone if you play it right.\n\n**TL;DR:** Most of the laning phase is dictated by your opponent. You can either be very strong at level 1, or won't be able to even get close to the minions until level 3. If you can give yourself an advantage, like waiting for them to use an important fighting cooldown on the minion wave, that is your time to strike. Build damage, and in teamfights just try to get on the ADC and deal as much damage before you are forced to ult to stay alive. If your team follows with you at this point, you will ace them. If not, you will at least go 2 or 3 for 1.\n\nOh, and one more thing. I read this on a forum post a very long time ago, but it is very true. This should be your mentality when playing Fiora:\n\n*Always convince yourself you can duel anyone at anytime, no matter how much you doubt it. Believe you will kill your opponent, and execute the kill the way you envision it in your head. You are the grand duelist, go prove it.*\n\nHave fun! {{champion:114}}","replies":[]},{"poster":"Alpharite","date":"2014-12-03T13:03:03.665+0000","up_votes":1,"down_votes":1,"body":"For the love of god, do not follow this list. Jax has been nerfed to shit, Lee should NOT be played by low elo players, same goes for Zed, and Vayne is a bad first adc, along with Draven.\n\nAlso, Darius is not good. At all.","replies":[{"poster":"TheGman101","date":"2014-12-03T13:06:58.187+0000","up_votes":1,"down_votes":1,"body":"Haha ok! Who do you suggest? Preferably a Tanky ad?","replies":[{"poster":"Alpharite","date":"2014-12-03T18:04:09.044+0000","up_votes":1,"down_votes":1,"body":"I can, but it depends on whether you want a jungler or top.\n\nFor jungle, I'd say either Vi, Jarvan, or Pantheon (although Panth is being nerfed next patch). For top, I'd say Irelia, but you seem to not like her. Tryndamere usually builds full damage with 1 defensive item, but his sustain and death cheating ult make him seem much tankier than he actually is. There are some others, but usually they're more tank (Malphite, Maokak, etc) or more assassin/damage (Fiora, Riven, Wukong also falls here), but you seem to want a bruiser rather than just one type or another.","replies":[{"poster":"TheGman101","date":"2014-12-03T19:12:17.025+0000","up_votes":1,"down_votes":0,"body":"> I can, but it depends on whether you want a jungler or top.\n> \n> For jungle, I'd say either Vi, Jarvan, or Pantheon (although Panth is being nerfed next patch). For top, I'd say Irelia, but you seem to not like her. Tryndamere usually builds full damage with 1 defensive item, but his sustain and death cheating ult make him seem much tankier than he actually is. There are some others, but usually they're more tank (Malphite, Maokak, etc) or more assassin/damage (Fiora, Riven, Wukong also falls here), but you seem to want a bruiser rather than just one type or another.\n\nAwesome thanks!! Who is a good tank? Moakai?","replies":[]}]}]}]}]}]},{"poster":"TheGman101","date":"2014-12-04T20:51:18.352+0000","up_votes":1,"down_votes":0,"body":"Thanks! Who's someone Tanky/supporty but not a support","replies":[]},{"poster":"single eboy","date":"2014-12-04T12:14:10.957+0000","up_votes":1,"down_votes":0,"body":"{{champion:103}}","replies":[]},{"poster":"TheGman101","date":"2014-12-03T12:53:59.472+0000","up_votes":1,"down_votes":1,"body":"Who are some strong tanks/bruisers to main?","replies":[{"poster":"The Chin","date":"2014-12-03T21:42:54.303+0000","up_votes":1,"down_votes":0,"body":"{{champion:5}} {{champion:254}}  in the jungle\n{{champion:5}} {{champion:54}} {{champion:83}}  top lane","replies":[{"poster":"TheGman101","date":"2014-12-03T22:59:23.205+0000","up_votes":1,"down_votes":0,"body":"> {{champion:5}} {{champion:254}}  in the jungle\n> {{champion:5}} {{champion:54}} {{champion:83}}  top lane\n\nThanks!! I'll try them out!","replies":[]}]}]},{"poster":"Xyphios","date":"2014-12-03T22:27:01.398+0000","up_votes":1,"down_votes":0,"body":"{{champion:90}}  0.8 AP scaling on Q and E. Does % of health magic damage equal to 0.01 AP(+8% at full ranks). 1.3 AP scaling with ult. HAS A LOT OF BURST. but be careful he has no escape","replies":[]},{"poster":"TheGman101","date":"2014-12-02T22:52:46.551+0000","up_votes":1,"down_votes":0,"body":"Bump","replies":[]}]}