{"poster":"FrostBoss","date":"2016-07-09T17:05:20.475+0000","title":"Recipe For Disaster","subforum":"FanFiction","up_votes":2,"down_votes":1,"body":"I get woken up by the snoring of both my husband and my dear child.  I swiftly but silently leap out of bed trying not to disturb the synchronized snoring session. I go into the change room. And of course changed from my pajamas to my dress, chef hat and most importantly my mittens.\nI, Morgana, The Fallen Baker will be opening up my bakery store in Noxius. Sinful Succulence shall be reopened for business. I wait behind the counter and warmed up the treats by igniting them slowing with the built in heater that my husband worked on.\n\nI change the sign from closed to open. A mob of customers suddenly rushed in, odouring the fresh smell of bread was diluted with the smell of unclean men finishing work in the morning and having a break in my bakery, of course there were women too, which were less smelly. There were children too, brave enough to come without their parents. There was one customer that was holding a teddy bear I wanted to speak to. They line up orderly.\n\n I'm delighted that they remember the rules of this bakery.\n1. Line up orderly if unable to, back of the line.\nOnly one rule. Which has been broken multiple times, so they get to suffer and wait for longer, which in thinking of that gave me a giggle.\n Even though there may be a lot of customers they all want something in common. They continuously chant \"Isomalt’s Peccable Pecan Pie, Isomalt’s Peccable Pecan Pie, Isomalt’s Peccable Pecan Pie.\"\n \nIt struck me in the head, today is when I show my culinary skills and my best work of magic. How could I forget about it.\n\nI opened my mouth, and all the ruckus has stopped. I advised my customers come back three hours later for the pie and sincerely apologized to them. They all groaned, which made me even more disappointed in myself. Anyways, everyone left except the one I wanted to speak to.\n\n“Annie, why are you here?” I yelled.               \n                                                                                                                                                            She dances with her bear uncontrollably.\n\n“What are you doing…”. I told her while scratching my head of what just happened and also realizing the opening of my bakeries in Zaun and the Institute of War is also today.\n\n“Have you realized we are not in Summoner’s Rift anymore right?” I said as I started to lose patience.     \n                                                                                                                                                                 “So quit the act!” I demanded.    \n                                                                                                                                                                                                     “Well, you said you were going to make pie”. Annie replied  \n                                                                                                                                                           “I’ll make it in three hours, you can go now and come back after ,”I smiled.   \n                                                                                                                                                             “Fine, you better make enough for Tibbers too! He's hungry!” She hurried.                             \n                                                                                                                                                             “Yes, I’ll make enough for him too,” I whispered to her.    \n\nShe left the bakery. Now, since I forgot let’s tell the family to wake up. I screamed across the house yelling WAKE UP PILA AND ATREUS until they would lift themselves out of bed. The family met up at the living room located behind the bakery.\n\nI told them “Today, is the day when I make my most delicious pies,”                                                                                                                                       “Where are the pies mummy?” Pila questioned.                                                                                                                                                                                         “I forgot to make them,” I said as I sighed.                                                                                                                                                                                     “Well let’s start baking then. What is the recipe babe, I don't know the ingredients nor I need quantity I'm a chef of course,” Atreus giggled as he spoke.                                                                                                                                                                                                                                            “There’s a lot of ingredients, which i have in my kitchen. You need to find: flour, butter, water, Gromp essence, Ahri's charm essence, condensed Alistar milk, oranges, salt and lastly sugar for the increased flavour with charm essence and milk,\" I listed.\n\n\"Mum why is Alistar's milk needed and how did you get it?\" He questioned\n\"Well, he mailed me a bottle of it, as a thank you for the delicious treats I had made being shipped by sea to Valoran, please no questioned asked,\" I blushed after what I had said.\nThere was a moment of awkward silence. Everyone was stunned from my words.\n\"Well,\" He coughed \"Anything else need of assistance?\" \n\"I'm heading to Zaun and the Institute of War to check things out. Oh and umm. you guys have about two hours and forty - five minutes left now to bake one hundred of my Isomalt’s Peccable Pecan Pies, \" I smile to everyone and change my clothes to what i usually wear. Which is purple.\n\nI take flight off into the sky firstly heading to Zaun and inspect how the construction of my bakery is going. Following the crows there because they seasonally come as a flock from Noxius to Zaun in Winter. \n\nHere I am at Zaun. \n\n\"Viktor!\" I yelled his name in surprise meeting him here.\n\"Greetings, Morgana. The construction is ninety - eight point one four  percent complete. In another twenty minutes  and it should be complete finishing touches are being made by my finest creations,\" Said Viktor. \"In the mean time let's watch you have some tea\".\n\nWe both head into into bakery and Viktor whipped up some tea in less than the usual time I make them. He got out his beam and blasted the tea delicately enough to make it warm and delicious. I take another sip and ask Viktor how he makes his robots.\nThe language he used made me want to go to sleep. It was like history lesson. So i dozed off without him noticing until fireworks were being blasted into the sky. I wake up from unconsciousness and wipe my drool from the wooden table and purposely spilled my tea so he wouldn't think I was that of an unsanitary person.\n\"Well how is it?\" He asked me.\n\"The fireworks look nice,\"I answered\n\"No, not that. Your bakery what do u think of it? Rate it from one out of ten,\" He said.\n\"Eleven out of ten, excellently constructed. I'll be opening soon after all,\" I smiled right after i finished complimenting him.\n\" One - hundred and ten is not a percentage it is over the one - hundred percent dead line, this does not compute,\" He said in a robotic voice.\n\"It's an expression of gratitude,\" He said.\n\"I will never get human jokes nor laugh at them nor be pleased with it .....\"\nI rushed away as he continued his nonsense. My wings feel tired but this is a duty isn't it? Not like some sister is going to force war against you because you disagree of what she says is righteous and what is not. I fly back to the bakery because I can't be stuffed. That doesn't mean in fat but I'm just tired.\n\nIn the meantime Pila and Atreus bake my finest masterpiece. \n\"Pila can you grab your old man the cow’s milk?\" Atreus asked.\n\"Sure dad,\" He replied and grabbed it. \n As he reached for the bottle he sensed something strange. He went to look out at the bakery, there was nothing but small particles of orange puff flying dancing until they reach the floor.\n\nHe heard a maniacal voice projecting softly into his right ear, \"Pantheon, trouble leads your way, where people pay then run away with a packet of brown stopping their good day\".\n\nAtreus scratched his head of what the whisper meant but continued on asking his son for the ingredients.\n\"Pila can you bring be some sugar?\" He asked\n\"Sure\" Pila replied and ran to the kitchen once more and found two containers of sugar with a piece of paper stuck on each one. One said Sugar 1 and the other read Sugar 2 with some small written initials on it Shaco The DJ. He chose the one that had Shaco The Dj on it because he thought it sounded cool. While heading to give it to his dad he ripped the paper and put it in the bin on the way.\n\nHe took a hand full of sugar and sprinkled them on the pies and put them into the oven.\n\nMorgana arrived twenty minutes earlier than initially and prepared the sale.\n\nWe made over the amount that two teams in Summoner's Rift could ever make. Especially Annie she ate five of my Isomalt’s Peccable Pecan Pies. And gave ten to her teddy bear. I don't know how the bear can eat but that suits her.\n\nThe entire Noxius kingdom smelled of explosive diarrhea.\nBut up on the roof we could all hear a maniacal laugh. \nI recognizes his face.\n\"Shaco?\" I yelled.\n\"Oh hai there, laxatives are cool aren't they Morg?\" He replied, \"They are best when it's pure laxatives, an over dose could cause severe leakage from the behind\".\n\n\"Anyways I'll be causing chaos somewhere else now,\" He added \"Bai.\"\n\nI was astonished of what he said. No wonder everyone has stayed in their houses but even though men aren't out and working, it smells even worse.\n\nI asked them what had happened and PIla explained it all. We all had a great laugh and had dinner. Forgetting there was laxatives in the pies and had severe diarrhea ourselves.\n\nThere's always room for pie.\n{{champion:25}}  quote 2016.","replies":[{"poster":"conjurerwolf","date":"2016-07-10T13:09:40.781+0000","up_votes":1,"down_votes":0,"body":"Frost i had no idea you could create such a piece, you got some talent lol, i love you <3\n\n{{sticker:slayer-pantheon-thumbs}} {{sticker:zombie-nunu-hearts}}","replies":[{"poster":"FrostBoss","date":"2016-07-11T06:47:46.512+0000","up_votes":1,"down_votes":0,"body":"hehe ty","replies":[]}]},{"poster":"Hiitsjustme","date":"2016-07-10T05:09:34.200+0000","up_votes":1,"down_votes":0,"body":"GOD DAMN this story is good, bet u r a morgana main{{champion:25}} \ncheck out my story http://boards.oce.leagueoflegends.com/en/c/contest-fan-fiction/5IWaHQzM-a-heart-without-a-beat-i-aa.\nbut overall I'M HUNGRY NOW XD good luck!\n{{sticker:slayer-jinx-catface}}\nAND GO TO SLEEP PLZ","replies":[]},{"poster":"FrostBoss","date":"2016-07-09T17:21:40.794+0000","up_votes":1,"down_votes":0,"body":"Stayed up until 3 am to make this :)","replies":[]}]}