{"poster":"MieseFizzgeburt","date":"2015-03-25T21:50:39.082+0000","title":"Frustrierend","subforum":"Champions & Gameplay","up_votes":1,"down_votes":1,"body":"Hallo Comunity,\nIch finde es langsam wirklich etwas frustrierend, da ich gerne Champs mit mechanics wie Azir, yasuo, gnar usw. spiele. Ansich läuft das recht gut jedoch bekommt man mitlerweile mindestens jede 2. game nen champ auf die lane, der es meinermeinung nach \"etwas\" leichter hat einen zu töten und einem auch gut beherrrschte mechanics da nicht weiter helfen \"-_-.\nDamit meine ich Champs wie Akali, Lb, irelia, Fiora ja ihr wisst schon was ich meine...\nAuf die Toplane gehe ich fast gar nicht mehr, weil ich da eh ständig nur ne towerdivende fiora bekomme die anschließend nur \"","replies":[{"poster":"Premade Noob","date":"2015-03-26T00:47:42.451+0000","up_votes":1,"down_votes":2,"body":"Dein ernst ?Du Spielst Champs wie Azir und Yasuo und redest über \" Mechanics \" ?\nSorry wenn du von Fiora einen dive bekommst machst du etwas falsch :3","replies":[{"poster":"Kéllin","date":"2015-03-26T19:25:48.206+0000","up_votes":2,"down_votes":0,"body":"> Dein ernst ?Du Spielst Champs wie Azir und Yasuo und redest über \" Mechanics \" ?\nSorry wenn du von Fiora einen dive bekommst machst du etwas falsch :3\n\nWas ist denn falsch an dieser Aussage? Azir und Yasuo sind sehr skill lastige Champions.\n\nDann will ich mal hören wie du es richtig machst wenn Fiora dich unterm Tower ultet?","replies":[]}]},{"poster":"Fakkus","date":"2015-03-26T15:14:08.032+0000","up_votes":1,"down_votes":0,"body":"mein geheimtipp, spiel draft pick und bann die einfach :) ansonsten lern egegn die spielen, dauert gerne mal 20-50 spiele aber dann packst du 2/3 von denen weg. aber der reiz an champs mit plays ist doch, dass du n bisschen skill brauchst, die anderen aber dann richtig zerpflücken kannst, wenn dus drauf hast, oder nicht?\nliebe grüße die sauce :)","replies":[]},{"poster":"D4rn4S","date":"2015-03-26T08:56:51.651+0000","up_votes":1,"down_votes":1,"body":"Naja, LB is schon eher ein skillastiger champ d.h. derjenige wird einfach nur besser spielen als du und nicht umbedingt einen wirklichen Vorteil durch den Champ haben, bei Irelia und Fiora ist einfach nur extreme vorsicht geboten weil du ansonsten \"klatsche\" bekommst und auch gegen eine akali kann man gut spielen, wenn die Q kommt musst du halt laufen und ab lvl 6 defensiv spielen^^\n\nGrade mit Yasuo hast du doch deine Windwall die sozusagen \"alles\" an skillshots abfängt (irelias ulti, LB Snare)\n\nGruß Darnas","replies":[]}]}