{"poster":"zeus 2013","date":"2017-11-06T13:27:53.085+0000","title":"La Guía para Tarados explica mejor la conceptualidad del Zoe","subforum":"Charlas Generales","embed":{"description":"Analizando lo que nos han revelado de Zoe hago mis famosas predicciones sobre el lore próximo a salir. Sígueme en Instagram, y coméntame que fanart quieres que haga: https://www.instagram.com/arte_de_halo/?hl=es Recuerda seguirnos en: https://www.facebook.com/paratarados https://twitter.com/GuiaParaTarados Si quieres conocer por tu propia cuenta esta pagina, aquí esta el link: universe.leagueoflegends.com/es_MX/","url":"https://youtu.be/0s91HCkwlL4","image":"https://i.ytimg.com/vi/0s91HCkwlL4/hqdefault.jpg"},"up_votes":7,"down_votes":2,"body":"Halo a aceptado encontrar la raz&oacute;n por qu&eacute; les crearon a Zoe en base de la tem&aacute;tica del LoL, no fue la decepci&oacute;n.\nNos resultan que como busca hacia el origen del juego donde era poner personaje par&oacute;dico en un mundo fant&aacute;stico, y era evidente que lo est&aacute; haciendo el rework del mecanismo de los niveles m&aacute;s las nuevas runas.\nUna de las predicciones de mi [foro](https://boards.las.leagueoflegends.com/es/c/charlas-generales/71yEKR0L-si-creamos-regiones-fuera-de-runaterra) es que encaja mejor como celestiales, fuera de RunaTerra. Zoe viene de palabra hebrea antigua, equivalente a Eva, inspirada de las deidades de los sue&ntilde;os en la antig&uuml;edad. Por lo que es obvio que ser&aacute; una campeona entre mucha referencia cultural que tem&aacute;tica divina metaf&oacute;ricamente. Son ustedes que puede dar una opini&oacute;n de ustedes. &iquest;Qu&eacute; dicen?","replies":[{"poster":"Tortuguita","date":"2017-11-06T13:34:06.142+0000","up_votes":4,"down_votes":0,"body":"\"Le mataron al papa y se une a la liga de leyendas\" Calidad (?)","replies":[{"poster":"SmokeyShauna","date":"2017-11-06T14:47:37.016+0000","up_votes":1,"down_votes":0,"body":"asi eran los lores de los champs antiguos verdad? xD","replies":[{"poster":"Charlôtte","date":"2017-11-06T15:24:23.673+0000","up_votes":1,"down_votes":0,"body":"Básicamente sí. \nLulu se fue a un mundo imaginario durante cientos de años y se dio cuenta que era una vieja loca, así que junto a su amiga mariposa se unieron a la liga de leyendas(?","replies":[]}]}]}]}