{"poster":"Guesstorri","date":"2016-11-09T18:57:59.616+0000","title":"Platzierungsspiele und keine Belohnungen? Was ist da los?","subforum":"Hilfe & Support","embed":{"description":"Captured with Lightshot","url":"http://prntscr.com/d57ngc","image":"http://image.prntscr.com/image/54ce1f2aa16642368b1773023e3c99b2.jpeg"},"up_votes":1,"down_votes":1,"body":"Hi,\r\nhab grad nen Ranked gespielt in der Flexi-Schlange alleine...\r\nAber dann stand da auf einmal Platzierungsspiele 1/10 obwohl ich ja geranked war in der abgelaufen Season.\r\nUnd au&szlig;erdem hab ich keine Truhe oder nen Schl&uuml;ssel erhalten....\r\nHab mit Vi nen S erhalten, und hatte mit ihr keine Truhe, aber noch genug offen!\r\nWieso bekommt man also grad keine Belohnungen?\r\n\r\nWei&szlig; da iwer von euch mehr?","replies":[{"poster":"Saufautomat","date":"2016-11-09T19:07:45.302+0000","up_votes":1,"down_votes":0,"body":"Hallo,\nder bisherige DynamicQueue-Rang wurde zur Preseason zum Solo-/DuoQueue Rang. Für die FlexQueue müssen nun also wieder Placements gespielt werden.","replies":[{"poster":"Guesstorri","date":"2016-11-09T19:11:30.713+0000","up_votes":1,"down_votes":0,"body":"Ja hab ich grad auch beim rumstöbern gefunden! :)\n\nAber warum gibt es keine Truhe für ein S?\nMit Vi hatte ich noch keine und ich hab halt noch 3 offene aktuell...\nAußerdem hab ich das Gefühl dass der Championlvl auch nicht gestiegen ist, auch wenn da ne Punktzahl steht, aber da bin ich mir nicht sicher!","replies":[{"poster":"Saufautomat","date":"2016-11-09T19:28:53.722+0000","up_votes":1,"down_votes":0,"body":"Hattest du letzte Season mit Vi schon eine Truhe? Das wird erst zur nächsten Season resettet.","replies":[{"poster":"Guesstorri","date":"2016-11-11T15:36:58.594+0000","up_votes":1,"down_votes":0,"body":"Kommt da noch was???","replies":[{"poster":"Saufautomat","date":"2016-11-11T16:34:36.045+0000","up_votes":1,"down_votes":0,"body":"Ich kann dir da leider nicht helfen. Wenn dir das so wichtig ist kannst du gerne mal versuchen den [Support ](https://support.riotgames.com/hc/de/)anzuschreiben. Wenn das ein Einzelfall war würde ich mir da aber keine Gedanken drüber machen.","replies":[]}]},{"poster":"Guesstorri","date":"2016-11-09T19:52:49.117+0000","up_votes":1,"down_votes":0,"body":"Na eben nicht sonst würd ich ja nicht fragen {{sticker:zombie-brand-mindblown}} \nUnd hab grad auch ma geschaut... Da kann iwo was nicht stimmen...\n[A+ angeblich nur?](http://http://prntscr.com/d58eu1) - Aber oben im Screen sieht man ja mein S\nUnd die Truhe hätte ich schon gerne... Ich mein wofür gibts das Prinzip...\n\nIst es evtl noch nicht fehlerfrei in die Flexi integriert?","replies":[]}]}]}]}]}