{"poster":"Matas23","date":"2016-06-11T00:37:14.495+0000","title":"La ulti de Pantheon sirve?","subforum":"Guias y consejos","up_votes":1,"down_votes":1,"body":"Es uno de mis main, y. el primero con el que empec&eacute; a jugar :).Entonces.cual es mi duda? Cuando y como usar la ulti en una Tf,porque cada vez que me tiro,parte de mi equipo retrocede y me dejan s&oacute;lo en un 2 vs 5 o 4.\r\nSe que el Panth se destaca en Early, y decae en late,se usar su combo W-E-Q,Q-W-E,pero la ulti no :/.Alguien que me explique cuando y como usarla?\r\n Saludos","replies":[{"poster":"Yrox the Third","date":"2016-06-11T00:42:53.076+0000","up_votes":4,"down_votes":0,"body":"Yo creo que el ulti de Pantheon no siempre se usa como un metodo para hacer daño en TF, se usa para atrapar a tus enemigos, por ejemplo, en una TF, tu equipo esta ganando, pero el otro tiene un muy buen equipo para escaparse, quizas tienen una Janna y un Gragas asi que no tienen problemas, mientras ellos se escapan tu tiras tu ulti adonde ellos podrian ir, y para no recibir el daño lo que van a tener que hacer es devolverse, pero cuando lo hagan, tu equipo los matara.","replies":[{"poster":"LuckySlayer","date":"2016-06-11T00:51:48.831+0000","up_votes":2,"down_votes":0,"body":"Sí, el zoneo es bueno. También puede servir para cortar caminos con los objetivos grandes, como Barón y Dragón (imaginando que estabas en fuente y tu bot lane mató al jg y al adc enemigo).","replies":[]}]},{"poster":"Ks Erwyn","date":"2016-06-11T05:00:56.798+0000","up_votes":2,"down_votes":0,"body":"En fase de linea es una manera de gankear y llegar por sorpresa a una linea, en TF, sueles tener a 5 enemigos atentos a ese tipo de iniciación, por lo cual uno de lo mejores métodos de usarla es para Zonear y condicionar al rival a oh ir para adelante y pelear oh retroceder oh quedarse alli a comerse el daño de tu ulti, igual Pant nunca a sido realmente dependiente de su ulti para cada Tean Fight, su Kit esta desarrollado para que se baste con sus 3 primeras habilidades, siempre y cuando no desperdicies tus W como los hacen el 95% de los Pantheon...","replies":[{"poster":"Matas23","date":"2016-06-11T12:45:58.384+0000","up_votes":1,"down_votes":0,"body":"Sabes la cantidad de Pantheons  que he visto hacer eso? xDD(hasta he visto a algunos que se hacen mal la build  y se hacen casi full tanques :P).Aunque depende ,obviamente, de los champs del equipo contrario. Gracias por la info :) \n\n{{sticker:slayer-pantheon-thumbs}}","replies":[]}]},{"poster":"Kyousuke","date":"2016-06-11T01:40:58.953+0000","up_votes":1,"down_votes":0,"body":"la ulti del panadero destaca por zonear y caer de sorpresa, normalmente es mejor cuando hay algún iniciador fuerte como {{champion:154}} {{champion:57}} {{champion:127}}  y coordinarse bien entre tu equipo para zonear al rival o hacer daño en la caída, tambien para eliminar objetivos que se escapen y tengas visión de donde vas o para ir rápido a dragon o baron para cortarlo o iniciarlo","replies":[]}]}