{"poster":"Äitlok","date":"2014-06-26T20:23:18.041+0000","title":"A játék ma este","up_votes":1,"down_votes":0,"body":"Ma este 21 órakor el mentem játszani egy barátommal.\nA játék elég jól kezdődött én miden voltam Branddel és én szereztem meg az első gyilkosságot és az ellenséges csapat jungler karakterét is megöltem kétszeres gyilkosságban.\nErre a ellenséges csapat midese rám ír /all ba és el kezd sértegetni.\nÉn persze nem tudtam rá vissza írni semmit mert pár napja chat korlátozást kaptam.\nA meccs végén meg ezt történt:\nR1CH4RDNo1: report tf for flame\nÄitlok: report tf for flame me\nle6as: i will report you\nÄitlok: for ?\nle6as: verbal abuse\nÄitlok: rly i did't flame you\nNa kérem nem tartom ezt igazságosnak, hogy ö reportol engem mikkor nem is tudtam sértegetni.\nKérem ez ellen tegyenek valamit vagy adjanak tanácsot ilyenkor mit kellene, hogy én tegyek.\nMost 22:30-kor vissza léptem az akontomba és mit látok az ő reportja miatt kaptam a megmaradt 15-ből 1-hez + 20 meccsre kiterjedő chat korlátozást.\nAzt szeretném kérdezni most ez mi ?","replies":[{"poster":"Looter","date":"2014-06-26T20:40:53.316+0000","title":null,"up_votes":1,"down_votes":0,"body":"és a chatbant se 1 report után kapod.","replies":[{"poster":"Äitlok","date":"2014-06-26T21:05:11.060+0000","title":null,"up_votes":2,"down_votes":0,"body":"Igen de tf el együtt volt egy morde is és ketten már elég lehet egy olyannal szemben aki már kapott chat bannt.","replies":[{"poster":"Looter","date":"2014-06-26T21:26:07.053+0000","title":null,"up_votes":1,"down_votes":0,"body":"úgyértettem nem 1 játéknyi report után","replies":[]}]}]},{"poster":"M4dr4c","date":"2014-06-26T20:31:59.231+0000","title":null,"up_votes":1,"down_votes":0,"body":"Hiába reportol, ha egyszer a csetlog meg mutatja, hogy nem mondtál semmit se. Magában a report nem jelent semmit se, ha nem tettél rosszat, az csak felhívja a figyelmet rá.","replies":[{"poster":"Äitlok","date":"2014-06-26T21:02:43.499+0000","title":null,"up_votes":2,"down_votes":0,"body":"De akkor miért ez után a report után ugrott 1 ről 21 re fel akkor azt márt előbb meg kellet volna hogy kapjam ha ez a report nem számítana bele.","replies":[{"poster":"M4dr4c","date":"2014-06-26T22:38:42.161+0000","title":null,"up_votes":1,"down_votes":0,"body":"Én továbbra is 100%-ig biztos vagyok, hogy 2 report egy játékon belül nem volt elég hozzá.","replies":[]}]}]},{"poster":"CSZDragon","date":"2014-06-27T10:32:58.054+0000","title":null,"up_votes":1,"down_votes":0,"body":"Szerintem se ez miatt a meccs miatt kaptál további bant/chat korlátozást. A büntetés valószínűleg sokkal régebbi meccs miatt van. Ráadásul nem írtál semmit a chatbe, szóval bárki megnézi a meccs összegzését, azt fogja látni, hogy nem írtál semmi sértő szöveget.\n\nAz szinte biztos, hogy ha reportoltak is, akkor is még legalább két másik meccsen is kell, hogy jelentsenek, ezután pedig megvizsgálják az adott meccseket, és csak utána jönnek a szankciók. Függetlenül attól, hogy jelenleg van-e érvényben valamilyen szankció.","replies":[]}]}