{"poster":"Feedeo con Salsa","date":"2017-01-23T04:52:44.994+0000","title":"[BloodRain] Como nos llegò ese post sobre soraka?","subforum":"Guias y consejos","up_votes":13,"down_votes":3,"body":"Hola soy Feedeo Con Salsa $9,50 actual club\r\n\r\nQueria dar un agradecimiento al chico BloodRain challenger de LAS\r\n\r\nMuchas gracias por ese post, creo que como a m&iacute; y a otros motivaste demaciado el uso de supports, viendo un resultado tan definido con tus partidas me surgio como inspiracion, quiero ser como vos, usar tu build, tus runas, tus maestrias e intentarlo con soraka, blitzcrank, alistar y otros\r\n\r\nLa verdad que pienso gastarme los 20mil PI que me cuestan esas benditas runas por que quiero salir de lo por defecto, eltipico AD Y AP. y probar cosas nuevas, de una vez por todas probar combinaciones que me den frutos.\r\n\r\nCreo que hablo por algunos que han respondido el post y muchos que lo han visto... que fuiste una buena inspiracion a mejorar la linea llenando el rol de SUPPORT con futuros aspirantes, gracias :D\r\n\r\nNo voy a parar de intentarlo, y voy a dejar a un lado al menos por unos buenos ratos mis ansias de matar (con katarina) &quot;soy main&quot; jajaja.. la uso por q me encanta matar, obviamente haciendo objetivos y eso, me llena.. (obviamente en el juego nada mas) jaja, pero Soy una de las personas que veia el rol de support como algo casi inservible, pero viendo lo que puede lograr soraka ahora esta mas claro que antes\r\n\r\nMuchas personas seguiran tus pasos y me gustaria que varios challenger mas hagan esos post que hiciste vos, posta!.\r\n\r\nsaludos y espero recibas esa chaqueta retador que da Riot ahora!","replies":[{"poster":"support girl uwu","date":"2017-01-23T13:20:32.004+0000","up_votes":10,"down_votes":0,"body":"> quiero ser como vos, usar tu build, tus runas, tus maestrias\n\n\nstalker alert (?\n\nJaja gracias :D después seguramente haga una guía de Soraka o el rol soporte en general (o empezaría por soraka porque la otra sería muy amplia xD) explicando  algunas cosas que no suelen poner de como jugar  el rol.\n\nEn cuanto a las runas, en mi smurf uso otras y si bien son peores sirven en lo que armás ''las buenas'' , x9 marcas de AD, x9 sellos de armadura, x9 glifos de MR (o AP si tenes), y x3 quintas de AP, aguantas un poco menos early, y pegas menos con las Q pero pegas más con autoataques (en {{champion:40}}  se usaba AD también en una época, sobretodo en korea).","replies":[{"poster":"Sthask Vermillio","date":"2017-01-23T14:16:44.975+0000","up_votes":1,"down_votes":0,"body":"Todos los Mains support soñamos ser como tu \"cuando seamos adultos\" xDD","replies":[]}]},{"poster":"Merurur","date":"2017-01-23T07:30:18.235+0000","up_votes":2,"down_votes":0,"body":"Donde fue el post?","replies":[{"poster":"Mascheranox","date":"2017-01-23T17:47:05.891+0000","up_votes":3,"down_votes":0,"body":"http://boards.las.leagueoflegends.com/es/c/guias-y-consejos/aEe3ffjK-subau-a-challenger-con-soraka-y-te-lo-muestro","replies":[]},{"poster":"Gretta","date":"2017-01-23T16:38:40.228+0000","up_votes":1,"down_votes":0,"body":"Sí, pongan el link c:","replies":[]}]},{"poster":"xFenix7","date":"2017-01-23T04:56:00.478+0000","up_votes":3,"down_votes":0,"body":"En Challenger esta mas parejo la cantidad de mains de diferentes roles.","replies":[{"poster":"Feedeo con Salsa","date":"2017-01-23T05:01:20.041+0000","up_votes":1,"down_votes":0,"body":"Si, cada uno tiene su estilo, incluso hay gente que juega un solo champ :D","replies":[{"poster":"GameMode","date":"2017-01-23T15:54:41.577+0000","up_votes":1,"down_votes":0,"body":"Con usar un solo champ llegas easy a elo alto, la cosa es tener un gran repertorio y manejarlos a gran nivel, eso es ser challenger.\n Además de que a Soraka no te la van a banear nunca obviamente.","replies":[]}]}]},{"poster":"KzG Arconte","date":"2017-01-23T20:57:28.255+0000","up_votes":1,"down_votes":2,"body":"como cuando crees que llegaras a challenger usando 1 campeon sin tener mecanicas y macro juego {{summoner:6}}\n\nQue el haya subido con soraka no quiere decir que toda la comunidad de league of legends deba y subira con soraka de liga. algunos pueden usar azir pero no annie, otros a syndra y no ahri. depende de cada persona... creo que es mucho mejor buscar un campeón propio en ves de forzar a aprender un campeon cuando en la mayoría de los casos nunca funciona.","replies":[{"poster":"Feedeo con Salsa","date":"2017-01-24T05:12:25.176+0000","up_votes":1,"down_votes":0,"body":"explique perfectamente que me motivo a usar supports, lo que riot espera de la gente, no que iba a jugar soraka solamente en mi cuenta como un fanatico desesperado. aun que la voy a practicar si, tampoco queria expresar que con solo ese post gano mi alma xd","replies":[]}]},{"poster":"La corrupción","date":"2017-01-23T15:56:47.756+0000","up_votes":1,"down_votes":0,"body":"Deberías probar tu propio estilo igualmente, entiendo que quieras subir y que a él le dio resultado, pero subir atado a algo escrito sin aprender mucho no me parece divertido directamente.","replies":[]}]}