{"poster":"Schnitzelhuber13","date":"2018-05-18T21:05:03.765+0000","title":"Standbild In-game nach ca. 20min.","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Hallo,\r\n\r\nhabe in letzter Zeit das Problem, dass in den meisten meiner Games nach ca. 20 min In-game ein Standbild auftritt, bei dem ich den PC neu starten muss, da der Client sich komplett querstellt und sich nur &uuml;ber Umwege schlie&szlig;en l&auml;sst. Ich habe das Spiel auch schon mehrfach neu installiert, jedoch ohne Erfolg. Es w&uuml;rde mich freuen, wenn jemand einen L&ouml;sungsvorschlag h&auml;tte.=)\r\n\r\nSystem: CPU: Intel core i5 8600k @ 4,5 Ghz\r\n               MOBO: MSI z370 krait gaming\r\n               GPU: iGPU Intel UHD graphics 630\r\n               RAM: 8gb ddr4 single rank","replies":[{"poster":"Auulay","date":"2018-05-18T21:25:04.915+0000","up_votes":1,"down_votes":0,"body":"Hey Schnitzelhuber13.\nWie schauen denn die Temperaturwerte deines Systems aus? kann es sein das eventuell die Graka heißt läuft und dicht macht?","replies":[{"poster":"Schnitzelhuber13","date":"2018-05-22T08:33:30.831+0000","up_votes":1,"down_votes":0,"body":"Hallo AUULAY,\nErstmal danke für die Antwort. \nNein, ich besitze zur Zeit keine gpu und benutze die igpu des prozessors. Sollte ich ihn vielleicht wieder auf den Basistakt runtertakten? Weil die Temperturen sind eigentlich so zwischen 40-50°C.\nWas ich vielleicht noch hinzufügen muss: Das Standbild kommt genau einmal in einem Game, danach hab ich keine Probleme mehr.","replies":[{"poster":"Auulay","date":"2018-05-22T09:34:26.835+0000","up_votes":1,"down_votes":0,"body":"Ich würde mal drauf tippen das es an der integrierten GPU liegt, da diese meist für Gaming nicht wirklich gedacht sind.\nIch würde es mal mit Runtertakten versuchen, jedoch scheinen die Temp. Werte nicht schlecht zu sein.\n\nHast du sonst andere Programme im Hintergrund laufen?","replies":[{"poster":"Schnitzelhuber13","date":"2018-05-23T10:26:32.309+0000","up_votes":1,"down_votes":0,"body":"Ja, Spotify und Discord, gelegentlich Chrome.\n\nPS: Hab den Prozessor wieder auf den Basistakt (3,6 Ghz)  gesetzt, mal schauen ob das was gebracht hat.","replies":[{"poster":"Schnitzelhuber13","date":"2018-05-24T10:40:10.285+0000","up_votes":1,"down_votes":0,"body":"Ok es hat Null gebracht, die in-game performance hat sich sogar noch verschlechtert...","replies":[{"poster":"Auulay","date":"2018-05-24T12:26:55.476+0000","up_votes":1,"down_votes":0,"body":"Gut. Spotify und Discord sollten keinen großen Einfluss auf die Performance haben. Tritt das Problem denn nur bei League auf oder auch bei anderen Spielen?","replies":[{"poster":"Schnitzelhuber13","date":"2018-05-25T17:45:32.489+0000","up_votes":1,"down_votes":0,"body":"Nein es ist bis jetzt nur in League aufgetreten. Andere Spiele funktionieren problemlos.","replies":[{"poster":"Auulay","date":"2018-05-25T23:02:38.816+0000","up_votes":1,"down_votes":0,"body":"um Ehrlich zu sein, bin ein wenig Ratlos. es könnte ne Combi aus IGPU / League sein. oder etwas anderes. Bekommst du von irgendwo ne Graka her um mal zu testen ob das Problem auch mit einer normalen GPU vorkommt?","replies":[]}]}]}]}]}]},{"poster":"Pandeonor","date":"2018-05-22T20:18:04.735+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Schnitzelhuber13,realm=EUW,application-id=7hciEY9w,discussion-id=cKumrblp,comment-id=00000000,timestamp=2018-05-22T08:33:30.831+0000)\n>....Sollte ich ihn vielleicht wieder auf den Basistakt runtertakten? ....\n\nDu übertaktest?","replies":[{"poster":"Schnitzelhuber13","date":"2018-05-23T10:16:56.364+0000","up_votes":1,"down_votes":0,"body":"Ja, sollte das ein Problem sein?","replies":[{"poster":"Pandeonor","date":"2018-05-23T13:36:46.352+0000","up_votes":1,"down_votes":0,"body":"Übertakten stellt nur dann ein Problem dar wenn ein Problem auftritt ;). Es ist eine mögliche Problemstelle welche man zuerst ausschliessen sollte. Übertakten kann ein System potentiell instabil machen.\n\nSchwierig einen Fehler wie diesen zu isolieren da es quasi alles sein kann. Neben einem simplen Treiberproblem auch beispielsweise ein defekter Speicherbaustein auf der Grafikkarte.\n\nDu könntest Dir einmal OCCT herunterladen und läufe u.a. mit testen der Speicherbausteine der Grafikkarte im Vollbildmodus durchführen.","replies":[{"poster":"Schnitzelhuber13","date":"2018-05-23T19:29:47.438+0000","up_votes":1,"down_votes":0,"body":"Ok, hab den Prozessor jetzt mal wieder auf dem Basistakt runtergetaktet.\nIch werds mal mit den Programm versuchen.","replies":[]}]}]}]}]}]}]}