{"poster":"Gladiore67","date":"2016-06-21T00:16:56.050+0000","title":"Fizz winrate?","subforum":"Gameplay","up_votes":2,"down_votes":7,"body":"Okay first of all inc downvotes =( But I&#039;m a fizz main and it seems like it is much harder to carry games or even win lane\nnow that he has gotten his e cd increased by 2 seconds and w dot reduced by 2%. And i feel like the nerfs hit him too hard\nConsidering he has a 48% winrate now and feels extremly...Not underpowered but just like its almost impossible to do anything In teamfights lategame...Thoughts?. I feel like the nerfs hit his frustration to play against but hurt him so much in the process\n\n","replies":[{"poster":"LordLedel","date":"2016-06-21T00:31:08.742+0000","up_votes":6,"down_votes":1,"body":"stop playing op champions. i picked him up after the nerfs, still strong. no longer dominant but still strong.","replies":[{"poster":"Gladiore67","date":"2016-06-21T00:44:10.998+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=LordLedel,realm=NA,application-id=3ErqAdtq,discussion-id=fdmXkVqz,comment-id=0000,timestamp=2016-06-21T00:31:08.742+0000)\n>\n> stop playing op champions. i picked him up after the nerfs, still strong. no longer dominant but still strong.\n\nLol...getting a kill on fizz at 6 doesn't make him strong...It makes him an assassin same with snowballing...But both of those have been severly weakened with the nerf to his e...Basically if he doesn't kill you in one rotation hes gonna have huge problems unlike zed who can just shadow out (Example  meh)","replies":[]},{"poster":"Fisherman Fízz","date":"2016-06-21T00:38:05.647+0000","up_votes":2,"down_votes":1,"body":"Agreed, just wish people stopped banning him now since there are other strong picks this patch like vlad and irelia","replies":[{"poster":"Penns","date":"2016-06-22T18:33:46.503+0000","up_votes":1,"down_votes":0,"body":"He didnt feel that bad when I tried him out after the nerfs but https://i.gyazo.com/20741c11f57db9b5f148ad5a1f667695.png looks kinda sad lol.","replies":[]}]}]},{"poster":"Zarkkast","date":"2016-06-21T01:03:25.537+0000","up_votes":3,"down_votes":1,"body":"He still has 55% winrate with 125 games played.","replies":[]},{"poster":"Mannysmoker","date":"2016-06-21T00:55:07.583+0000","up_votes":3,"down_votes":1,"body":"You should really quit playing league, all {{champion:105}}  mains are inherently disgusting  ppl...","replies":[]},{"poster":"Quepha","date":"2016-06-22T18:35:58.124+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ninjablood2,realm=NA,application-id=3ErqAdtq,discussion-id=fdmXkVqz,comment-id=,timestamp=2016-06-21T00:16:56.050+0000)\n>\n> Not underpowered but\n\nIf he's not overpowered\nAnd he's not underpowered\nThen the word you're looking for is \"balanced\"","replies":[]},{"poster":"Whomp3r","date":"2016-06-21T01:13:08.699+0000","up_votes":1,"down_votes":0,"body":"remember a while ago when {{champion:134}} got hit with a pretty big nerf on her e and early q dmg? i never stopped playing her just takes some adjusting. Not to mention she feels really strong again","replies":[]},{"poster":"Calabok","date":"2016-06-21T01:03:52.495+0000","up_votes":1,"down_votes":0,"body":"stinkin fishy to play Fizz","replies":[]},{"poster":"PhantomGG","date":"2016-06-21T00:38:49.542+0000","up_votes":1,"down_votes":0,"body":"in my opinion anything 48 percent or higher is fine.\n\nIn all honesty these charts can be very deceving. \n\nAnother thing about fizz is the following.\n\n1-Despite what people say he does have a very high skill cap in all the tricks you can do with him, because of this it is quite easy to see who is a good fizz player and who is a bad fizz player. Thus making him a easy champion to fuck up on. IDC what people say, it's much easier to fuck up Fizz than it is to fuck up alistar\n\n2-He has always been a counter or get countered champion. He is a master of punishing immobile mages, but he is also very vurnable of getting his butt pounded during lane phase from somebody who knows how to abuse proper range or match his mobility due to the fact he only has 2 ways to farm, Melle farm, or wait till it pushes to tower and execute a bunch of minions with trickster\n\nSo here we have a champion who is hard to master, and easy to counter pick against. Because of that his win loss ratio will never be exactly accurate.\n\nIn fact he is actually really good right now, becuase the champions who are strong in mid lane and top lane, are champions he can easily win against in lane.","replies":[]}]}