{"poster":"Minze","date":"2015-02-25T10:11:53.440+0000","title":"Patch führt zu Absturz!?","subforum":"Melde einen Bug","up_votes":3,"down_votes":2,"body":"Lösung; bei mir:  Habe alles deinstalliert auch mein LOL replay. Nacheinander neuinstalliert und gestestet, es lag am LoL Replay saver. Es sollte genügen nur diesen zu deinstallieren. \n\nmoin, \nhabe eben den Patch geladen.\nBissel in LOL gechattet  und dann wollte ich ein Spiel machen.\nIm Teamersteller, Team gefunden, Bereit, Suche nach Spiel....Spiel gefunden -> Absturz \n\"Das Spiel ist abgestürzt. Versuche bitte eine neue Verbindung zum Spiel wieder herzustellen.\"\n\"\"Verbindeung wiederherstellen\"\" (funktionier nicht oder -> LOL Client funktioniert nicht mehr.)\n\nLOL neu starten funktioniert auch nicht, gleiches Problem.\nDa ich gestern um 2-3 noch gespielt habe(und auch vorher keine probleme hatte), gehe ich davon aus das der neue Patch sein Werk getan hat. \nDas Spiel ist jetzt verloren, allerdings kann ich den Spielverlauf noch nicht einsehen...\n\nHabe nun alleine ein Spiel gestartet -> Fehler tritt wieder auf. \nHabe bis jetzt noch keine Diskussion dazu gesehen, deswegen spreche ich das mal an.\nEs scheint wohl nicht viele zubetreffen, sonst würde wohl schon etwas dazu im Forum stehen.\n\nEdit: Auf meinem Laptop (win7) funktioniert es nach dem Update...der andere hat win8, wird wohl aber kaum daran liegen.","replies":[{"poster":"HDLuckySlevin","date":"2015-02-25T10:22:22.335+0000","up_votes":2,"down_votes":0,"body":"Hey,\n\ndies ist zwar leider keine Hilfe für das eigentliche problem, aber eine vorgehensweise, die dir solch ein Dilemma (evtl verlorene LP im Ranglistenspiel) erspart. Ich habe bisher jedes mal, wenn ein neue Patch geladen wurde (das Spiel aktualisiert wurde) ein Botgame gestartet. Damit wollte ich sichergehen, ob A) ich keine Grafikbugs habe, B) ich keinen disconnect-Probleme (Verbindungsabbrüche), C) andere Probleme habe. Dazu habe ich die ersten Minuten (vor dem Start eines Spiels) reddit und das englischsprachige Forum im Auge behalten. So stelle ich -für mich selbst- sicher, dass ich keine Probleme habe, wenn ich, mit einem neuen Patch, in die Ranked-Queue eintrete.\n\nIch hoffe der Fehler wird bald behoben und wünsche noch einen guten Morgen :)\n\nGrüße\nHDLuckySlevin","replies":[]},{"poster":"Black Mage","date":"2015-02-25T11:28:52.714+0000","up_votes":1,"down_votes":0,"body":"Kann mich auch nur anschließen!\nviel zu viele hatten am anfang einen bugsplat/dc + lags immerwieder","replies":[]},{"poster":"spharic","date":"2015-02-25T10:22:51.166+0000","up_votes":1,"down_votes":0,"body":"jop auch eben hier ein spiel gehabt -> 2 aus unserem team hatte probleme für connect, 1 aus gegner team\n\nkonnte dann reconnecten nachdem ich lol geschlossen habe, der andere teammate auch\n\ndann während dem game 2 aus dem gegner team DC, kamen auch nicht wieder\n\npatch day halt ^^ einfach heute keine rankeds spielen....","replies":[]},{"poster":"Suppœrt","date":"2015-02-25T10:17:10.500+0000","up_votes":1,"down_votes":0,"body":"habe das selbe Problem gehabt meine Team Mates und das gegnerische Team hatte auch das Problem ^^\nNach dem ich glaube ich 28954589347583 x einfach wie blöd immer wider ***Verbindung Wiederherstellen*** Geklickt habe ging es auch und ich kam ins Spiel.","replies":[]}]}