{"poster":"Murdercap","date":"2017-08-25T20:35:01.487+0000","title":"Client keeps failing to patch","subforum":"[ARCHIVED] Help & Support","up_votes":3,"down_votes":0,"body":"My client has sent me messages numerous times saying it has failed to patch and will force to restart my client and redownload the patch. This is like a 5 minute process and it occurs like once every ten minutes. Im not sure if anyone else is having this problem or not but its extremely annoying. Yes, i have tried fully repairing my client","replies":[{"poster":"Dark Morgana","date":"2017-08-26T22:05:33.269+0000","up_votes":1,"down_votes":0,"body":"A few players have been dealing with this along side myself as well! The best way to get a fix for this is to run a [Clean Reinstall ](https://support.riotgames.com/hc/en-us/articles/202539040)of the client. That should annihilate the error from showing up again.","replies":[{"poster":"IBuyRiotPoints","date":"2017-08-27T22:36:34.796+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=GoldPikaKnight,realm=NA,application-id=osqw6G4M,discussion-id=YV9EYMtY,comment-id=0003,timestamp=2017-08-26T22:05:33.269+0000)\n>\n> A few players have been dealing with this along side myself as well! The best way to get a fix for this is to run a [Clean Reinstall ](https://support.riotgames.com/hc/en-us/articles/202539040)of the client. That should annihilate the error from showing up again.\n\nThis hasn't fixed the problem for me at all. I've talked to 3 different support employees telling me to try different things of which none have worked.. One of them said this is happening to everyone in their office and isn't big enough of a deal to be a major issue because all it does is restart your client and doesn't actually prevent you from entering the rift and playing a match.","replies":[]}]},{"poster":"Sassmast3r","date":"2017-08-26T16:52:56.818+0000","up_votes":1,"down_votes":0,"body":"I think I'm on my fourth reinstall now, it has been doing this for two days :P","replies":[]},{"poster":"Souji","date":"2017-08-26T05:14:36.081+0000","up_votes":1,"down_votes":0,"body":"I'm getting this. I'll be sitting on league idle and then when i next check my client it says it has failed to patch and makes me repatch it all over again. :/","replies":[]},{"poster":"Raimus","date":"2017-08-25T21:01:07.176+0000","up_votes":1,"down_votes":0,"body":"I get this but it's not every 10 minutes. More like once or twice a day (9~ hours of playing time). Really annoying. Happened to me in champ select twice now lmao","replies":[]}]}