{"poster":"Sneed","date":"2017-01-07T06:10:55.671+0000","title":"haha these darn tooting toxic players","subforum":"Miscellaneous","up_votes":0,"down_votes":4,"body":"man i was playing league of legends ranked dlc and some guy was INTING!!!!! UGH wow how can i even CLIMB IN ELO when these TROLLERS and AFJERS are ruinging EVERY GAME!!! riot sucks guys they wont even do anything about it the report system DOESNT WORK!! RIOT is out to get us and keep us STUCK in LOW ELO!!!  and not to mention these SHITTY TEAMS wow RIOT nice MATCHMAKING im really TICKED OFF right now i cannot believe this INSANE betrayal. never spending my money on rp again FUCK YOU RIOT!!!!","replies":[{"poster":"Apexslide","date":"2017-01-07T07:27:32.082+0000","up_votes":2,"down_votes":0,"body":"K den, cool story bro","replies":[{"poster":"Sneed","date":"2017-01-07T07:47:55.553+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Apexslide,realm=OCE,application-id=Ntey9fRZ,discussion-id=4Y5lYnp6,comment-id=0001,timestamp=2017-01-07T07:27:32.082+0000)\n>\n> K den, cool story bro\n\ndang are you a time traveller from 2008?","replies":[{"poster":"Apexslide","date":"2017-01-07T08:38:12.739+0000","up_votes":2,"down_votes":0,"body":"No, I just find it hilarious that you got so salty about a player, you actually had to come to the forums and vent about it, and then told Riot to go fuck themselves, without giving a single notion that your losses may come from your own misgivings as well.\n\nI understand the need to vent, but this is childish at best. Grow up.","replies":[{"poster":"Sneed","date":"2017-01-07T09:03:37.636+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Apexslide,realm=OCE,application-id=Ntey9fRZ,discussion-id=4Y5lYnp6,comment-id=000100000000,timestamp=2017-01-07T08:38:12.739+0000)\n>\n> No, I just find it hilarious that you got so salty about a player, you actually had to come to the forums and vent about it, and then told Riot to go fuck themselves, without giving a single notion that your losses may come from your own misgivings as well.\n> \n> I understand the need to vent, but this is childish at best. Grow up.\n\nCHILDISH?!?!? YOU are the CHILD here!!! RIOT GAMES is trying to TAKE AWAY our FREEDOM!!! what we HAVE TO DO is take away their INCOME until they fix the BROKEN report system!!! cant you see RIOT GAMES is trying to MAKE YOU LOSE and keeping you STUCK in LOW ELO!!!! GOD you UNEDUCATED CHILD!!!! wake up SHEEPLE the time is among us!!!","replies":[{"poster":"Apexslide","date":"2017-01-07T09:30:23.714+0000","up_votes":2,"down_votes":0,"body":"Look at yourself, you can't even control your own anger at critisism. Do you perhaps need to take some anger management classes? Perhaps you need to see a doctor about your mental health? Because all I see is a little child whining and carrying on because he didn't get his way in a game.\n\nIt's pathetic.","replies":[{"poster":"Sneed","date":"2017-01-07T09:56:13.039+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Apexslide,realm=OCE,application-id=Ntey9fRZ,discussion-id=4Y5lYnp6,comment-id=00010000000000010000,timestamp=2017-01-07T09:30:23.714+0000)\n>\n> Look at yourself, you can&#x27;t even control your own anger at critisism. Do you perhaps need to take some anger management classes? Perhaps you need to see a doctor about your mental health? Because all I see is a little child whining and carrying on because he didn&#x27;t get his way in a game.\n> \n> It&#x27;s pathetic.\n\nuhhhhh, listen here MISTER. why should i look at MYSELF when i can EASILY see that the PROBLEM itself is RIOT GAMES. i dont have anger problems!!! i have problems with people like you who GLORIFY these TROLLERS by shaming INNOCENT players like me. i didnt get my way because RIOT GAMES is PURPOSELY INFLUENCING RANKED there are letting TROLLERS and INTERS go free because the REPORT SYSTEM doesn't properly work!!!! im not pathetic - its RIOT GAMES who are pathetic!! never getting RP again cause this STUPID COMPANY is keeping me stuck in ELO HELL. the system is OUT TO GET players like ME - GOOD PLAYERS who are just VICTIMS.","replies":[{"poster":"Apexslide","date":"2017-01-08T00:50:14.580+0000","up_votes":2,"down_votes":0,"body":"The salt is real.\n\nThe game is over and done with. Go have a glass of water and stop whining, you entitled millenial.\n\nI've seen and said all I need to. You're a child with anger issues and a distorted sense of entitlement. Grow up.","replies":[{"poster":"Sneed","date":"2017-01-08T06:54:30.326+0000","up_votes":1,"down_votes":0,"body":"GROW UP?!?! excuse me but YOU'RE the CHILD here!! and im not whining im PERSISTING that RIOT GAMES stop their AWFUL WAYS!! you think im NOT ENTITLED to wins?!?! im a VICTIM OF THE SYSTEM, i should be INSANELY HIGH ELO by now but ofc course... RIOT GAMES just DENIES me my RIGHT. a keyboard warrior like you wouldnt even know.. i bet you dont even play.","replies":[]}]}]},{"poster":"Ninox","date":"2017-01-07T09:58:20.818+0000","up_votes":1,"down_votes":2,"body":"You realise they're trolling right? OP is essentially parodying the recent influx of \"How can I climb when x thing that isn't my fault exists\".","replies":[{"poster":"DipperOCE","date":"2017-01-08T04:56:20.108+0000","up_votes":1,"down_votes":0,"body":"^ Classic example of why you don't make any sense Seras. People get banned in game for doing this kind of stuff but because he's \"trolling\" (still been toxic to other people) it's automatically ok. This is why the boards is full of toxicity and people who complain about Riot. This guy logged onto a separate account to \"troll\" and prove his point? lol\n\nNiji is Mesprits smurf.","replies":[{"poster":"Sneed","date":"2017-01-08T06:50:40.739+0000","up_votes":1,"down_votes":0,"body":"people like you should be banned ingame!! up on your HIGH HORSE you think you're invincible!! well MISTER you AREN'T!! quit trying to DISMANTLE my thread!! this is a SERIOUS ISSUE thats needs to be fixed and CORRUPT members such as YOURSELF are stopping it from being fixed!! again under RIOT GAMES' INFLUENCE","replies":[]},{"poster":"Ninox","date":"2017-01-08T05:05:08.038+0000","up_votes":1,"down_votes":0,"body":"I'm well aware they are the same person. None of the comments I've seen are targeting (jokingly or otherwise) anyone except Riot. Even in his responses to Apex he is not hurting anyone nor even being particularly offensive even if you are taking him seriously. If there is a specific comment you think is a problem then report it, I don't have time to read everything 100%, especially troll threads, but I read what I could and none of it stood out to me as a a problem.\n\nIt would take a lot of games to get banned for behaviour like that, it might be annoying and obnoxious but it's harmless.\n\nAs to boards being full of toxicity, there is a different culture here than in game but it isn't toxic, and if you're talking about GD we tend to leave them to themselves unless it gets out of hand. There is certainly frustration, but this is boards, frustration at x thing doesn't hurt anyone, nor does it ruins someone's game experience. \n\nPast that, we don't censor people who don't like Riot, that would kind of be counterproductive to discussion. Rioters are people, and if they're being targeted specifically we will take action, but Riot is a company and people are perfectly entitled to complain and moan about them all they like.","replies":[]}]},{"poster":"Sneed","date":"2017-01-07T10:07:38.308+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Seras Dragon,realm=OCE,application-id=Ntey9fRZ,discussion-id=4Y5lYnp6,comment-id=000100000000000100000001,timestamp=2017-01-07T09:58:20.818+0000)\n>\n> You realise they&#x27;re trolling right? OP is essentially parodying the recent influx of &quot;How can I climb when x thing that isn&#x27;t my fault exists&quot;.\n\nTROLLING? excuse me but TROLLING is what happens in my RANKED GAMES, which are influenced heavily by RIOT GAMES. you being a boards volunteer might not see the FAVOURITISM you have from RIOT, but it does exist. i am a VICTIM OF THE SYSTEM, a VICTIM of TROLLING and INTING. it disgusts me to think that you would even CONSIDER me to be a TROLL. people like you are why i lose ranked games, because RIOT givs you FREE WINS and i just get NOOB TEAMS and TROLLERS!!!!\n\nscrew RIOT GAMES!!!","replies":[]}]}]}]},{"poster":"Niji","date":"2017-01-07T09:00:04.773+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Apexslide,realm=OCE,application-id=Ntey9fRZ,discussion-id=4Y5lYnp6,comment-id=000100000000,timestamp=2017-01-07T08:38:12.739+0000)\n>\n> No, I just find it hilarious that you got so salty about a player, you actually had to come to the forums and vent about it, and then told Riot to go fuck themselves, without giving a single notion that your losses may come from your own misgivings as well.\n> \n> I understand the need to vent, but this is childish at best. Grow up.\n\nyou sound s like the exact kind of kid he is talking about who thinks they are aboive everyone and can just be toxic. Last 5 games in a row I have lost lp from int feeders and people likei u","replies":[{"poster":"Apexslide","date":"2017-01-07T09:31:24.180+0000","up_votes":2,"down_votes":0,"body":"You're free to think that way if you want, but you cannot deny that he's acting like a child who didn't get their way on a game. It's pathetic.","replies":[{"poster":"DipperOCE","date":"2017-01-08T04:53:52.926+0000","up_votes":1,"down_votes":1,"body":"Dude it's just him on a different account look in team recruitment dw\n\nHe just logged out and into that Niji to try and valuate his point what a loser","replies":[{"poster":"Sneed","date":"2017-01-08T06:48:09.213+0000","up_votes":1,"down_votes":0,"body":"SMURFING is not a good thing to do!! i am a RIGHTEOUS player who would NEVER have two seperate accounts. the fact that you think i would STOOP that LOW DISGUSTS me!!! RIOT GAMES is so corrupt that they allow this AWFUL practice and now you're assuming that I WOULD DO THAT because its so common. just like how its so common for RIOT GAMES to keep me back with al these TROLLERS and their BROKEN REPORT SYSTEM. unbelievable!!!","replies":[]}]}]},{"poster":"DipperOCE","date":"2017-01-08T04:53:04.709+0000","up_votes":1,"down_votes":0,"body":"You are the same person on a different account?","replies":[]},{"poster":"Sneed","date":"2017-01-07T09:01:20.955+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Niji,realm=OCE,application-id=Ntey9fRZ,discussion-id=4Y5lYnp6,comment-id=0001000000000000,timestamp=2017-01-07T09:00:04.773+0000)\n>\n> you sound s like the exact kind of kid he is talking about who thinks they are aboive everyone and can just be toxic. Last 5 games in a row I have lost lp from int feeders and people likei u\n\nbROTHER","replies":[]}]}]}]}]},{"poster":"Niji","date":"2017-01-07T07:37:17.135+0000","up_votes":2,"down_votes":0,"body":"I agree qwe should all REFUSE TO SPEND MONEY so Riot fucking do something about this shit THEY'RE SYSTEM IS SO SHIT AT DETECTING HTIS\n\nIF THEY WANT TO F-WORD US AROUND WE JUST  STOP GIVING THM MONEY AND LET THEM FAIL AS A COMPANTY","replies":[{"poster":"Sneed","date":"2017-01-07T07:47:17.216+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Niji,realm=OCE,application-id=Ntey9fRZ,discussion-id=4Y5lYnp6,comment-id=0002,timestamp=2017-01-07T07:37:17.135+0000)\n>\n> I agree qwe should all REFUSE TO SPEND MONEY so Riot fucking do something about this shit THEY&#x27;RE SYSTEM IS SO SHIT AT DETECTING HTIS\n> \n> IF THEY WANT TO F-WORD US AROUND WE JUST  STOP GIVING THM MONEY AND LET THEM FAIL AS A COMPANTY\n\nYES you know whats up!! join me brother!! RIOT is CONSPIRING against players like us!!","replies":[]}]},{"poster":"JesusForgotHisGA","date":"2017-01-08T04:38:32.106+0000","up_votes":1,"down_votes":0,"body":"No, but a mix of all three would be substantially better than what it currently is. They have been saying the'll re-introduce the tribunal for gold only knows how long now.\n\nToxic people understand ways around the automated system and they continually abuse it. If you had a mixture of all three, automated, human and heavy bans being inforced by Riot support staff it would stop a lot of the not so obvious rubbish that happens. Eg, the guy who sits in the jungle taunting whilst enemy team takes the nexus, or the guy who simply runs is up mid lane trying to 1v5 40 minutes into the game. Or the guy who does nothing but farm for 40 minutes long and does <1k damage to enemy champs. It's this type of rubbish that is killing the game more so than little Johnny who tells me in chat what he supposedly done to my mother last night.\n\nSure you'd still get a small minority who would abuse the system, but when people know their cases could possibly be reviewed by real individuals who can make common sense judgements it might persuade them to stop or simply not do it.","replies":[]},{"poster":"JesusForgotHisGA","date":"2017-01-08T04:13:31.982+0000","up_votes":1,"down_votes":0,"body":"No, the system only works when banning the obvious. So that's toxic players who verbally abuse people in chat, the people who buy 5 boots and run it up mid going 0-15 within the first 20 minutes and the afkers. How can the system possibly determine that the guy in my last game simply wasn't bad and accidentally ran it up mid lane thinking he could 1v1 a noc? It can't possibly! There is absolutely no way at all it can determine this.\n\nThe rest of the people who throw games, intent feed whilst not making it blatantly obvious get away with it without punishment. That's what people are frustrated and pissed off about. But what else do you expect when you have a completely automated system?\n\nFk even if Riot introduced something like CS:GO where actual players can vote whilst watching the gameplay would be better than this automated garbage.\n\nIf you can't afford staff or there are too many reports to handle give it over to the community who would happily do it for you and offer them some small incentive.\n\nBut like I said, Riot don't give a shit as long as you're buying RP.","replies":[{"poster":"SEKAI","date":"2017-01-08T04:27:13.240+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=JesusForgotHisGA,realm=OCE,application-id=Ntey9fRZ,discussion-id=4Y5lYnp6,comment-id=0005,timestamp=2017-01-08T04:13:31.982+0000)\n>\n> No, the system only works when banning the obvious. So that&#x27;s toxic players who verbally abuse people in chat, the people who buy 5 boots and run it up mid going 0-15 within the first 20 minutes and the afkers. How can the system possibly determine that the guy in my last game simply wasn&#x27;t bad and accidentally ran it up mid lane thinking he could 1v1 a noc? It can&#x27;t possibly! There is absolutely no way at all it can determine this.\n> \n> The rest of the people who throw games, intent feed whilst not making it blatantly obvious get away with it without punishment. That&#x27;s what people are frustrated and pissed off about. But what else do you expect when you have a completely automated system?\n> \n> Fk even if Riot introduced something like CS:GO where actual players can vote whilst watching the gameplay would be better than this automated garbage.\n> \n> If you can&#x27;t afford staff or there are too many reports to handle give it over to the community who would happily do it for you and offer them some small incentive.\n> \n> But like I said, Riot don&#x27;t give a shit as long as you&#x27;re buying RP.\n\nThere was a thing called Tribunal, which was essentially what you're talking about there. Though it was removed a long while ago on the basis that the information we used to be able to access wasn't enough to make full judgements (and it was true, as all we had was just chat logs on the Tribunal).\n\nI believe they've said that Tribunal is coming back, and if they are indeed sticking to their words it would be natural to assume that they're trying to rebuild the system with inclusion of in-depth match history information like what we have in our clients but more detailed. And if that's so, it will take a while (though I'll agree that it's indeed taking too long).\n\nAlso, since you've seen CS:GO, you should know that the community is also toxic as fk, though on a tiny bit smaller scale thanks to the fact it's buy-to-play but that's not saying much. Similarly, so were the League, where the community was already known to be a toxic hell-hole way before the removal of Tribunal. As such the lesson to learn here is that player-driven judicial system would NOT suddenly make everybody fine, cool and dandy, and we need something else to keep people in line. What would it be? Well that's not my job to work it out, though I could at least see that most devs are trying one way or the other, which also include Riot.\n\nAlso, only small offences are given to the automated system to sort out. Big and severe offences/repeat-offences as far as I know, are manually reviewed and pardoned/punished based on human inputs.","replies":[]}]},{"poster":"JesusForgotHisGA","date":"2017-01-08T03:43:03.384+0000","up_votes":1,"down_votes":0,"body":"The report system does not fkn work at all! I'm not kidding here's why.\n\nMy last game I had a retarded adc who was getting salty from his own mistakes. He literally pushed out bot lane over and over solo and wondered why Noc kept ulting him and killing him. So what does he do? He gets upset,  runs it up mid lane and dies when spawn times are reaching a minute.\n\nHow does the system detect that this guy literally just threw the game for no apparent reason other than his own stupidity? IT CAN'T!\n\nAn automated system will NEVER work when there are so many variables. You need human interaction in this case to clearly see he intently ran it up mid lane and died on purpose and then made a salty comment losing us the game.\n\nThis game is pathetic, the reporting system is pathetic and Riot's attitude towards it is pathetic.\n\nAnd to all those who say the game is over blah blah, I'm sorry but I don't enjoy spending upwards of 50 minutes trying to win and climb only for some 12yr old to throw a game for no reason at all. It's frustrating and NOT enjoyable. If you're going to treat the game as casual, adopt an intent feeders attitude and not punish those who ruin ranked for others then simply remove it. Everyone plays normals and be done with it.","replies":[{"poster":"SEKAI","date":"2017-01-08T04:06:33.433+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=JesusForgotHisGA,realm=OCE,application-id=Ntey9fRZ,discussion-id=4Y5lYnp6,comment-id=0004,timestamp=2017-01-08T03:43:03.384+0000)\n>\n> The report system does not fkn work at all! I&#x27;m not kidding here&#x27;s why.\n> \n> My last game I had a retarded adc who was getting salty from his own mistakes. He literally pushed out bot lane over and over solo and wondered why Noc kept ulting him and killing him. So what does he do? He gets upset,  runs it up mid lane and dies when spawn times are reaching a minute.\n> \n> How does the system detect that this guy literally just threw the game for no apparent reason other than his own stupidity? IT CAN&#x27;T!\n> \n> An automated system will NEVER work when there are so many variables. You need human interaction in this case to clearly see he intently ran it up mid lane and died on purpose and then made a salty comment losing us the game.\n> \n> This game is pathetic, the reporting system is pathetic and Riot&#x27;s attitude towards it is pathetic.\n> \n> And to all those who say the game is over blah blah, I&#x27;m sorry but I don&#x27;t enjoy spending upwards of 50 minutes trying to win and climb only for some 12yr old to throw a game for no reason at all. It&#x27;s frustrating and NOT enjoyable. If you&#x27;re going to treat the game as casual, adopt an intent feeders attitude and not punish those who ruin ranked for others then simply remove it. Everyone plays normals and be done with it.\n\nNote: The current automated system do take in in-game data into account when making decision on whether or not a reported player is indeed guilty. And considering that say our match history on the client could be precise enough to pin-point the sequence of someone's build order and where exactly a teamfight/kill/death happens on the map, there is no reason to assume that the system won't look at those when they're reviewing the reports as well.\n\nBut really, the community can't always maintain 2 contradictory opinions at the same time. On one hand you have peeps who complain about system being way too harsh that it hands out bans over every little things, while on the other side sits you, who complain about the very same system saying that doesn't do jack shit.\n\nWhich is it?\n\nThe answer is obviously very simple, it works, maybe not to the best of its effectiveness, but it does work.","replies":[]}]},{"poster":"SEKAI","date":"2017-01-07T07:17:23.536+0000","up_votes":1,"down_votes":0,"body":"Report system does work to a certain extent, it's just that most players tend to just rage-leave the end-game chat once the torment (be it a game of troll, int feed or whatever) has ended instead of reporting them first before leaving and thus enabling the trolls to roam free as a result of that.\n\nIf a player is constantly reported everywhere they go, it is pretty much guaranteed that they will be banned purely on that basis. So yeah, we should use the system more often to its full effectiveness, and obviously not outright abusing it either.","replies":[{"poster":"Sneed","date":"2017-01-07T07:48:41.832+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=SEKAI,realm=OCE,application-id=Ntey9fRZ,discussion-id=4Y5lYnp6,comment-id=0000,timestamp=2017-01-07T07:17:23.536+0000)\n>\n> Report system does work to a certain extent, it&#x27;s just that most players tend to just rage-leave the end-game chat once the torment (be it a game of troll, int feed or whatever) has ended instead of reporting them first before leaving and thus enabling the trolls to roam free as a result of that.\n> \n> If a player is constantly reported everywhere they go, it is pretty much guaranteed that they will be banned purely on that basis. So yeah, we should use the system more often to its full effectiveness, and obviously not outright abusing it either.\n\nsekai stop being so serious :(","replies":[{"poster":"SEKAI","date":"2017-01-07T21:37:40.598+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Mesprit,realm=OCE,application-id=Ntey9fRZ,discussion-id=4Y5lYnp6,comment-id=00000000,timestamp=2017-01-07T07:48:41.832+0000)\n>\n> sekai stop being so serious :(\n\nI didn't read the ign of the OP when I posted that, should've known.","replies":[]}]}]},{"poster":"Fitzky","date":"2017-01-07T07:52:29.104+0000","up_votes":1,"down_votes":0,"body":"Reported a Camille that got adc in ranked but decided to lock in top forcing me to go jg, still got nothing back from Riot, people keep arguing \"the report system does work\" but so far we have evidence of it not working and you guys have none.","replies":[{"poster":"Sneed","date":"2017-01-07T08:05:59.992+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Fitzky,realm=OCE,application-id=Ntey9fRZ,discussion-id=4Y5lYnp6,comment-id=0003,timestamp=2017-01-07T07:52:29.104+0000)\n>\n> Reported a Camille that got adc in ranked but decided to lock in top forcing me to go jg, still got nothing back from Riot, people keep arguing &quot;the report system does work&quot; but so far we have evidence of it not working and you guys have none.\n\npreach it BROTHER!!","replies":[]}]}]}