{"poster":"MLCPWhatsApp","date":"2016-10-13T17:35:26.717+0000","title":"+1 para que pongan REMAKE en ARAM","subforum":"Charlas Generales","up_votes":225,"down_votes":30,"body":"Amo los ARAMS, entro, me toca cualquier champs, y me super divierto, todo el mundo se divierte en aram... los dialogos son mas fluidos, los enemigos son amables, todos nos divertimos... pero no es gracioso, cuando hay un afk\r\n\r\nsi en todo lo demas hay REMAKE...... porque en ARAM no ? es injusto...\r\n\r\nIGUALDAD RIOT\r\n\r\nTodos merecemos las mismas reglas, las mismas normas...\r\n\r\nREMAKE EN ARAM\r\n\r\ndale +1","replies":[{"poster":"Neo Gaussrik","date":"2016-10-13T18:17:08.190+0000","up_votes":67,"down_votes":22,"body":"Lamentablemente, no creemos que sea una buena idea. :/\n\nUno de los problemas que ARAM tuvo cuando fue inventado por los jugadores es que a diferencia de la Grieta del Invocador, que tiene estandares de balance mucho mas fuertes, los campeones tienen desempeños muy distintos en el ambiente de solo peleas de equipo de ARAM.\n\nPor lo tanto, los jugadores de ARAM tienen una tendencia a salirse de las partidas para intentar lograr obtener una composicion mas favorable mucho mas en ARAM que en otros modos de juego.\n\nIntentamos mitigar esto con castigos por salirse y dar la posibilidad de cambiar algun campeon que realmente no quieres jugar, pero en el fondo, ARAM -ya- sufre de muchas instancias de algun jugador decidiendo que no quiere jugar con los campeones que salieron en su equipo.\n\nRemake, implementado en ARAM, tiende a ser usado como \"otra manera de esquivar partidas\"; aun peor, seria una opcion para esquivar partidas ya sabiendo que campeones le toco al equipo rival, incentivando aun mas esta mala practica.\n\nEn resumen... creemos que las ganancias de ofrecer Remake (no tener que jugar cuando tienes una desconexion) no valen el costo (muchos mas \"dodges\").\n\nEspero que al menos la explicacion te haga sentido.\n\nSaludos!","replies":[{"poster":"SATIV","date":"2016-10-13T18:34:17.099+0000","up_votes":4,"down_votes":0,"body":"El primer comentario coherente que veo, de parte de un rioter y le dan negativos jaja","replies":[{"poster":"Neo Gaussrik","date":"2016-10-13T18:36:06.451+0000","up_votes":25,"down_votes":2,"body":"A veces te toca ser quien entrega malas noticias, y rara vez recibes elogios por hacerlo. :p","replies":[{"poster":"Ode to dark","date":"2016-10-13T18:51:13.654+0000","up_votes":6,"down_votes":2,"body":"Gaussrik eres muy guapo y das muy buenas malas noticias!!","replies":[{"poster":"Neo Gaussrik","date":"2016-10-13T19:02:17.127+0000","up_votes":8,"down_votes":1,"body":"Gracias! <3","replies":[{"poster":"Ode to dark","date":"2016-10-13T19:03:37.803+0000","up_votes":1,"down_votes":0,"body":"Hahahahhaha","replies":[{"poster":"Mobius One","date":"2016-10-15T01:23:21.681+0000","up_votes":2,"down_votes":0,"body":"Deberían desarrollar un sistema que, cuando hay un afk en un aram y otro jugador se ponga en cola de buscar partida, salte \"hay una partida en progreso. Te quieres unir?\" SI - NO y que el afk resulte castigado mientras otro jugador lo reemplaza. Que solo se pueda hacer en el minuto 3, como el remake.","replies":[]}]}]},{"poster":"Diarrea de Gato","date":"2016-10-13T18:56:31.800+0000","up_votes":1,"down_votes":0,"body":":v","replies":[]}]},{"poster":"Zaroiy","date":"2016-10-14T12:28:35.628+0000","up_votes":2,"down_votes":0,"body":"Pero no creo que a alguien le parezca mejor ser sancionado por irse afk  por que no le gusto el campeon que el toco , lo de evitar partidas en selección eso si lo hacen todos pero, no irse afk dentro del juego","replies":[]},{"poster":"Yitán","date":"2016-10-14T04:53:59.035+0000","up_votes":1,"down_votes":0,"body":"ah si?\npues toma\nhttp://imgur.com/a/s7Gor","replies":[]},{"poster":"SATIV","date":"2016-10-13T19:32:20.527+0000","up_votes":1,"down_votes":0,"body":"Toca la peor parte jaja","replies":[]}]}]},{"poster":"kipkeior","date":"2016-10-13T18:43:28.889+0000","up_votes":1,"down_votes":0,"body":"Racha de 3 afk´s seguidos en aram...............¿cuando llegara el karma?","replies":[{"poster":"EstufaDePared","date":"2016-10-13T19:03:48.010+0000","up_votes":10,"down_votes":0,"body":"{{champion:43}}","replies":[{"poster":"kipkeior","date":"2016-10-13T20:39:22.697+0000","up_votes":1,"down_votes":0,"body":"fuk off X´D","replies":[]}]}]},{"poster":"Jeffront","date":"2016-10-13T19:09:44.596+0000","up_votes":1,"down_votes":1,"body":"¡Hola *Riot Gaussrik*! Sobre lo de los bans, esta bien, yo lo creo. Pero para dar un ban tiene que tener muchos reportes acumulados, lo cuál no proporciona una pelea justa para los teams. Osea, velo de esta forma:\n\nEstán jugando tranquilamente.\n\nEmpiezan a flamear, y un invocador se desconecta.\n\nEl Team aliado pierde ventaja, pierde los PI, y pierde la partida.\n\n¿Eso es justo? El baneo esta perfecto. ¿Pero les parece que tengas que amargarte, frustrarte y perder PI por eso? A mi no me parece.\n\nPero bueno, ustedes son los que deciden. Los *Rioters* :)\n\n¡Un gran saludo de mi parte!\n\n*-Jeffront*","replies":[{"poster":"Neo Gaussrik","date":"2016-10-13T19:16:12.731+0000","up_votes":9,"down_votes":1,"body":"> [{quoted}](name=Jeffront,realm=LAS,application-id=v7qsfXsE,discussion-id=6EdAFUEw,comment-id=00040003,timestamp=2016-10-13T19:09:44.596+0000)\n>\n> ¡Hola *Riot Gaussrik*! Sobre lo de los bans, esta bien, yo lo creo. Pero para dar un ban tiene que tener muchos reportes acumulados, lo cuál no proporciona una pelea justa para los teams. Osea, velo de esta forma:\n\nHable de bans? Estas seguro de que contestaste al tema correcto? Me temo que no entiendo bien a que te refieres.\n\nSaludos,\n-Gaussrik","replies":[{"poster":"Jeffront","date":"2016-10-15T03:17:26.586+0000","up_votes":1,"down_votes":0,"body":"1. Lol, un Rioter me hablo :D\n2. Lo de los castigos me sonó a eso, ¿Cuál sería el castigo entonces Riot Gaussrik? De una u otra forma, estaría genial que sea un ban. Ya que de una u otra forma como dije, les proporciona una mala partida/game para el Team Aliado (El Rival se muere de risa :v) A mi me parece justo dar un ban, como dije, es mi opinión. Hagan lo que quieran, pero podría servir xD.\n\n¡Saludos Riot Gaussrik!\n\n*-Jeffront*","replies":[]}]},{"poster":"EdxxEdxx","date":"2016-10-15T00:19:52.285+0000","up_votes":1,"down_votes":0,"body":"tampoco es justo que, por culpa de un mecanico que se le escapo un tornillo arreglando los frenos de un auto, éste no pueda frenar mas tarde y alguien termine atropellado.\n\nel problema es que estamos en un moba de 5vs5, no de 1vs1, es obvio que si alguien se desconecta los otros 4 salen perjudicados, eso no se puede arreglar, para eso mismo existe un sistema de castigos, para intentar evitar que eso pase: el problema es que la gente reporta mal, lo hace tarde, y muchas veces ni siquiera lo hace, **conclusion: la misma comunidad tiene la culpa de sufrir gente que se va afk, o que se sacrifican de manera intencionada. cuando tenes el poder de regular algo, y no lo haces, tenes que afrontar las consecuencias, aunque te molesten, y mas aun si todavia seguis teniendo el poder de regularlo :/**","replies":[{"poster":"Jeffront","date":"2016-11-14T15:45:35.707+0000","up_votes":1,"down_votes":0,"body":"¿Hmm, sí? ¿Cuál sería el poder? El sistema de soporte tarda 9.000 años en dar un castigo, y PEOR, 10.000 en un Ban.","replies":[]}]}]},{"poster":"Lunnet","date":"2016-10-13T18:41:13.699+0000","up_votes":3,"down_votes":1,"body":"Pero al tener el remake podes jugar otra partida con la misma igualdad  5 vs 5 y no tener que ser uno menos y pasar unos 15min amargos  y luego ricien reportarlo seria mucho mas facil tener el remake para asi a la persona reportarla y jugar una partida en condiciones","replies":[{"poster":"Neo Gaussrik","date":"2016-10-13T18:42:35.184+0000","up_votes":4,"down_votes":1,"body":"> [{quoted}](name=Lunnet,realm=LAS,application-id=v7qsfXsE,discussion-id=6EdAFUEw,comment-id=00040001,timestamp=2016-10-13T18:41:13.699+0000)\n>\n> Pero al tener el remake podes jugar otra partida con la misma igualdad  5 vs 5 y no tener que ser uno menos y pasar unos 15min amargos  y luego ricien reportarlo seria mucho mas facil tener el remake para asi a la persona reportarla y jugar una partida en condiciones\n\nA costo de poder entrar a jugar una partida y que en efecto estes jugando en el primer o segundo intento, en vez de pasarte esos 15 minutos entrando y saliendo de partidas que nunca empiezan, si. :/","replies":[{"poster":"Jeffront","date":"2016-10-15T03:19:08.595+0000","up_votes":1,"down_votes":0,"body":"O, entrando 1 vez, amargarse, y luego sacar el LoL (?\n¿Ah no? Ah sorry, esos eran los flamers :'v\nActuar con calma :'v... Si, jaja... Calma... Jaja :v (Okno)","replies":[]}]},{"poster":"Ode to dark","date":"2016-10-13T18:52:00.198+0000","up_votes":1,"down_votes":2,"body":"Igual en aram es mucho más fácil ganar 4 vs 5, he ganado más partidas de las que he perdido en esta instancia.","replies":[]}]},{"poster":"Dark Helel","date":"2016-10-15T00:11:02.942+0000","up_votes":1,"down_votes":0,"body":"De hecho, no tiene sentido, estan confundiendo Dodgear con un penalty por estar AFK.\nDodgeas, no hay penalty mas q esperar, y no le arruinas la partida a nadie en el peor de los casos.\nSi te vas AFK o no llegas a entrar en un ARAM te comes Leavebuster points y corres riesgo de perder la cuenta...no es lo mismo, y nadie va a arriesgarse a perder una cuenta x un ARAM...\nPor ende, un jugador que quiere trolear yendose AFK, lo va a hacer con o sin REMAKE,\nla diferencia esta en que los otros 9 jugadores van a tener una herramienta para no ser afectados por esto.\n\nSi REMAKE es colocado, esto implica entonces que los AFK q si prefieren irse por X motivo, simplemente seran detectados el doble de rapido, pues con Remake ellos se veran tentados a caer en el afk, y por ende el sistema los baneara mas facilmente...\nes una trampa ideal donde la{{champion:29}}  y el jugador promedio sale totalmente beneficiado...","replies":[{"poster":"Kikuchi Makoto","date":"2016-10-15T03:29:38.676+0000","up_votes":1,"down_votes":0,"body":"Me gusta eso de \"atraer\" a los AFKs/Trolls de este tipo, pero a lo que se refiere es que, lo mismo que tu dices, dodgeas y quedas con 5 minutos de espera para jugar, el resto sigue igual, PERO lo que cambia aquí es que ves tus campeones y solo eso.\nEntras a Partida o en pantalla de carga, ves todos los campeones, tanto aliados como enemigos y si no te gusta alguno de los dos, te vas AFK al instante, esperas al remake a minuto 3, y vuelves a lo tuyo, con tus 5 minutos o quizá más (Nunca me lo dieron, así que no sé responder bien) de LeaverBuster.\n\nSí, suena a \"lo mismo\" pero con esto, la gente va a irse AFK con más frecuencia, y frustra incluso más a los que sí juegan. No sé si me explico, porque realmente es confuso. La calidad de las partidas baja por más AFKs y remakes. Yo por ejemplo, a veces juego incluso 10 arams en un día, una cantidad considerable de un adolescente en secundaria como para dar un buen número que se pueda promediar, de esas 10, antes de más una de esas partidas, me dodgean incluso más de 2 veces, de las 10, de una a cuatro tengo un AFK (A veces se reconectan más adelante, a veces no). Hagamos las cuentas: 90 segundos (minuto y medio), por decir un tiempo razonable en cola, 45-60 segundos (No recuerdo) en selección, 60, 90 segundos en pantalla de carga y luego 180 segundos (3 minutos) para el remake, un total de 420 segundos (Blaze It), 7 minutos en total si utilizan este metodo de \"dodgeo\" y sin que dodgearan en selección. Ahora, dodgeo convencional, 90 segundos en cola, entre 1 a 50 segundos de selección, dodgeo, a cola de nuevo. No más de 4 minutos tratando de jugar.\nClaro, estos son números razonables y más comunes, puede ser más, o puede ser menos. De nuevo, parece lo mismo, pero esto aumenta las partidas que no se juegan e incluso frustra a más gente, si bien el AFK se lleva reports y de hecho su cuenta cae más fácil, los otros 9 pierden tiempo de su vida, se frustran/enojan y para colmo no se llevan el PI y tampoco los puntos de maestría, además de la cajita y fragmento de llave.\n\nSaludos. {{champion:432}}","replies":[{"poster":"Dark Helel","date":"2016-10-15T07:27:52.264+0000","up_votes":2,"down_votes":0,"body":"Es que no es lo mismo...\"te sale un mal team, no te gusta, te vas afk...\"\nParece ser la excusa, pero no lo es...\npor quedarte AFK al parecer para empezar si recibis el \"REMAKE backslash\" por ser el causante de este, te comes mas de los 5 mins de espera y quedas marcado por bastante tiempo,\nhacelo 2(?) veces mas y te comes un ban por AFK a proposito...seguilo haciendo y te comes un permaban...\n\nEs obvio que alguien coherente va a preferir dodgear antes con ver los picks que despues de q inicia la partida, justamente porque pones en riesgo la cuenta.\nIgualmente por dia podes dodgear 1 vez y son entre 5 y 15 mins, ya a la segundo son como 30 mins, creo q la tercera es una hora o mas,\nno es tan ligero el dodgear tampoco, pero comparandolo a un remake es muy preferible por el penalty.\n\nTu calculo de tiempo esta erroneo porque estas comparando un Dodge con un remake, que son 2 cosas distintas:\n\n- Un dodge te saca x lobby alrededor de 100 seg entre carga x confirmacion y eso..\n\n- una partida con AFK o sin estos te saca 100 sec. de lobby, 5 mins de carga, 15 a 40 mins de partida, es un total redondeando de (1.30seg)+5min+25mins (redondeando): 31:30 mins.\n\n- Un remake te saca 100sec+5mins de carga+3mins de remake+lobby de salida, q seran 30 sec+ponele....=2 mins(1.30+0.30)+ 5 +3 = 10Mins.\n\nComo notaras es totalmente diferente el concepto, el Dodge solo perjudica al que dodgea, y minimamente a los que estan en el Lobby(mejor un dodge que una mala experiencia, dado que el que dodgeo no tenia ganas reales de jugar...)\nSi hablamos de Remake, solo puede ser comparado ante una negativa partida con un AFK.\n\nLa diferencia esta en que una partida con AFK fluctua entre los 7 mins, perdiendo, y los 30 mins, peleandola...\nComo vos decis, si jugas 10 arams x dia, y en esos 10 en 4 tenes AFK, hace la cuenta,\nCon el remake te estas ahorrando 4x10= 40 mins de partida.\nPartida base= 31 mins+/-(redondeamos a 20 mins.)=20x4= 80 mins \n\nEn conclusion con un Remake te ahorras 40 min. aprox. de mala experiencia, lo que implica que podes incluso jugar 2 partidas mas en ese tiempo mientras que el jugador que se fue afk a proposito es sancionado por eso...\nNo hay excusa para no poner REMAKE, porque realmente no tiene nada negativo para no ponerlo.","replies":[{"poster":"MLCPWhatsApp","date":"2016-10-15T23:10:32.663+0000","up_votes":1,"down_votes":0,"body":"clap clap clap clap clap\n\nmas claro lo queres riot ?? ","replies":[]},{"poster":"Kikuchi Makoto","date":"2016-10-15T08:23:35.438+0000","up_votes":1,"down_votes":0,"body":"No lo había visto de ese modo realmente, y claramente no tengo todos los números exactos. Aunque me refería en el punto que hizo Gaussrik, que el remake \"invita\" a que se vayan AFK si no les gustó la composición, pero sí, tienes bastante razón, no tuve en cuenta que sanciones por AFK y demás eran acumulativas y tenían duración mientras que un Dodge realmente es una \"preventiva\" o \"advertencia\". Tampoco estoy muy al tanto de las sanciones, puesto que no las recibo (Consecuencias de cuidar la cuenta, es como llevarse una materia por primera vez en una etapa escolar tardía y no saber dónde ir :'L)\n\nRazones para un Remake no faltan, pero habría que bucarle una buena implementación y un buen margen para el AFK en caso de que no sea intencional (bugsplat, una repentina perdida de conexión, un corte de electricidad), y para el equipo que no la pase mal. 3 minutos no es demasiado, pero en ARAM puede pasar tranquilamente que haya un exterminio o dejen en coma a medio team, si no a todos, y para eso mejor no salir de torre tier 2 hasta que aparezcan las curas o se consuman las pociones.\n\nSaludos. {{champion:432}}","replies":[]}]}]}]},{"poster":"Franja","date":"2016-10-13T23:10:04.023+0000","up_votes":2,"down_votes":0,"body":"Entiendo perfectamente el punto. Tiene sentido.\n\nPodrian aumentar las sanciones para la gente que se va AFK en aram? Leavebuster mas rapido o nose. Obviamente no manejo las estadisticas, pero la proporcion de gente que simplemente no conecta cuando juego aram es muy muy grande!","replies":[]},{"poster":"mathi8","date":"2017-02-09T09:32:33.898+0000","up_votes":1,"down_votes":0,"body":"No","replies":[]},{"poster":"MLCPWhatsApp","date":"2016-10-13T22:37:10.166+0000","up_votes":1,"down_votes":0,"body":"Entre creer, e ir al hecho hay un gran estrecho .... pero nunca lo van a saber si no lo hacen.\n\nlos programadores de este juego que tienen parte del control, saben muy bien, que pueden agregar y quitar cuando quieran, lo que quieran... \n\nGracias por responder de todas maneras","replies":[]},{"poster":"Carl es el negro","date":"2016-10-14T14:40:56.082+0000","up_votes":1,"down_votes":1,"body":"Para eso esta el report, no?.","replies":[]}]},{"poster":"PasoPackXHonores","date":"2016-10-14T00:35:10.859+0000","up_votes":4,"down_votes":0,"body":"de 10 juegos en aram, tenes 7 con 1 afk (entre los 2 equipos), y te dice cuando vuelve: Che, es aram. Como si no importara. Da bronca loco. Por que no dan sanciones mas severas?","replies":[]},{"poster":"Ode to dark","date":"2016-10-13T17:44:16.478+0000","up_votes":4,"down_votes":0,"body":"+1000","replies":[]},{"poster":"AuroraExecution","date":"2016-10-13T17:39:20.348+0000","up_votes":4,"down_votes":0,"body":"+1","replies":[]},{"poster":"kipkeior","date":"2016-10-13T17:56:47.124+0000","up_votes":5,"down_votes":1,"body":"Que las partidas terminen (aveces) rápido o no , o que haya surrender a los 15 min. no es excusa para no poner REMAKE , que ya he visto muchas personas que solo juegan al aram para calentar banco (solo entran para llenar espacio vació , si no se entiende)\n\n+1","replies":[{"poster":"Baldev","date":"2016-10-14T00:09:15.682+0000","up_votes":2,"down_votes":0,"body":"Yo soy uno de esos... A veces no puedo jugar una partida \"normal\" que dura aprox. 30 min en condiciones normales...\nEntonces me hago un Aram para relajar y divertirme un poco... Pero con un afk no sirve, como no sirve en ninguna cola y donde debería siempre estar habilitado el remake, que es lo mas justo.","replies":[]}]},{"poster":"Yellow Sphere","date":"2016-10-13T17:44:19.162+0000","up_votes":3,"down_votes":0,"body":"Lástima que no puedo dejarte +10000000000...","replies":[]},{"poster":"sxtrYYYYYYYYYYYY","date":"2016-10-14T17:10:36.872+0000","up_votes":2,"down_votes":0,"body":"Lo apoyo{{champion:103}}","replies":[]},{"poster":"ˇ Ai Mêi ˇ","date":"2016-10-14T01:05:15.761+0000","up_votes":2,"down_votes":0,"body":"1+  , pero no se v: {{sticker:slayer-pantheon-rainbows}}","replies":[]},{"poster":"Dora07","date":"2016-10-13T23:29:52.228+0000","up_votes":2,"down_votes":0,"body":"No me gusta Aram, pero si apoyo la moción con toda violencia, tome su +1 {{sticker:slayer-jinx-catface}}","replies":[]},{"poster":"John Salchichon","date":"2016-10-13T20:19:32.784+0000","up_votes":3,"down_votes":1,"body":"+1 para que pongan las voces de selección de campeón en ARAM","replies":[]},{"poster":"Miel a Domicilio","date":"2016-10-15T21:16:25.418+0000","up_votes":1,"down_votes":0,"body":"Soy fan de aram es mi modo favorito pero anda mucho AFK, Buena petición, QUEREMOS REMAKE.","replies":[]},{"poster":"Björn Ragnarssön","date":"2016-10-14T22:25:16.770+0000","up_votes":1,"down_votes":0,"body":"Amo los ARAM, así que si quieres jugar, puedes agregarme. Añadime también a : Korean Ganplank","replies":[{"poster":"MLCPWhatsApp","date":"2016-10-14T22:30:47.483+0000","up_votes":1,"down_votes":0,"body":"Jajaja lo que debe carrear ese  ganplank papuu desp te agrego","replies":[{"poster":"Björn Ragnarssön","date":"2016-10-14T22:39:31.228+0000","up_votes":1,"down_votes":0,"body":"Era ponerle ese nombre o todo es mayúsculas y no me gusta jajajaja","replies":[]}]}]},{"poster":"ShirouTco","date":"2016-10-14T20:04:15.436+0000","up_votes":1,"down_votes":1,"body":"mejor por que no bajan la posibilidad de surrender al minuto 10 en vez del 15? si hay un AFK y nadie quiere seguir jugando, mejor esperar al minuto 10 que 15 minutos no creen?","replies":[]},{"poster":"theskysnolimit","date":"2016-10-14T14:35:42.266+0000","up_votes":3,"down_votes":3,"body":"Na ni ahi capo, es mas lo tienen que sacar de las normals.. Solo rankeds con remake.\nCualquiera que haga remake en esas partidas merece morir","replies":[]},{"poster":"SATIV","date":"2016-10-13T18:31:51.242+0000","up_votes":1,"down_votes":2,"body":"Tener uno menos en aram no te pone en desventaja, una lux en el otro team si, ademas podes tirar ff al 15 y las partidas no duran casi nada.","replies":[]}]}