{"poster":"Defvse kO","date":"2017-07-24T22:13:24.500+0000","title":"Cuando la tienda es mas importante que las ISP de un pais entero.","subforum":"Problemas Técnicos","up_votes":3,"down_votes":12,"body":"as&iacute; es muchachos, que la tienda no cargue tiene un grado de alerta mayor (amarillo) que los problemas de ISP de argentina (celeste)","replies":[{"poster":"stonerock","date":"2017-07-24T22:19:09.450+0000","up_votes":10,"down_votes":0,"body":"Dos cosas.\nLa primera, no exageres, no es un pais entero, son los que usan alguna compañía en especial, uso telecentro y no tengo problemas nunca.\nLa segunda, la tienda es responsabilidad de Riot. Las isp de argentina son responsabilidad de las mismas (speedy, telecentro, claro, o la que tenga el problema).\nIntenta averiguar un poco de informacion antes de postear afirmando algo que no tenes idea.\nSuerte!","replies":[{"poster":"Nisman on bush","date":"2017-07-24T22:34:43.831+0000","up_votes":4,"down_votes":0,"body":"uso telecentro y tengo ese problema hace una semana y media","replies":[{"poster":"martincarp","date":"2017-07-24T23:11:58.176+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=RevengeSoul,realm=LAS,application-id=X54mVVp0,discussion-id=syZ1GA09,comment-id=00000001,timestamp=2017-07-24T22:34:43.831+0000)\n>\n> uso telecentro y tengo ese problema hace una semana y media\n\nY yo tengo Speedy (unos de los proveedores afectados por los problemas de toda la última semana) y en algunos casos de esta semana no tenía problemas de latencia, solo en una noche me vi afectado.\n\nCreo que es sentido común, o así debería ser, saber que no todos los usuarios de una compañía utilizan exactamente la misma ruta para comunicarnos con el mismo servidor, y el hecho de que un punto específico de una ruta específica de un proveedor no afecta a absolutamente todos los usuarios de ese ISP.","replies":[]},{"poster":"stonerock","date":"2017-07-25T02:20:47.690+0000","up_votes":1,"down_votes":1,"body":"Yo tambien uso telecentro y no tengo problemas. Asique no creo que sea un problema de telecentro","replies":[]}]},{"poster":"Mazer Rakham","date":"2017-07-24T22:44:38.746+0000","up_votes":1,"down_votes":0,"body":"Venía a decir exactamente lo mismo xD","replies":[]},{"poster":"KSM Masi","date":"2017-07-24T22:30:14.202+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=stonerock,realm=LAS,application-id=X54mVVp0,discussion-id=syZ1GA09,comment-id=0000,timestamp=2017-07-24T22:19:09.450+0000)\n>\n> Dos cosas.\n> La primera, no exageres, no es un pais entero, son los que usan alguna compañía en especial, uso telecentro y no tengo problemas nunca.\n> La segunda, la tienda es responsabilidad de Riot. Las isp de argentina son responsabilidad de las mismas (speedy, telecentro, claro, o la que tenga el problema).\n> Intenta averiguar un poco de informacion antes de postear afirmando algo que no tenes idea.\n> Suerte!\n\nPor mas que lo expliques la ignorancia siempre va a estar.","replies":[]},{"poster":"Defvse kO","date":"2017-07-25T02:02:14.434+0000","up_votes":1,"down_votes":4,"body":"1.- no viene al caso, el post esta dirigido al grado de alerta de la notificación ;P  \n2.- soy de Chile asi que ni idea sobre que pasa con las ISP de arg solo queria {{champion:432}} xD","replies":[{"poster":"stonerock","date":"2017-07-25T02:19:54.905+0000","up_votes":2,"down_votes":0,"body":"1, si, viene al caso porque decis que es un pais entero cuando solo es una o dos isp. \n2, entonces tenes problemas de atencion, tener que ir a un foro para decir cosas que no tenes idea solo porque queres bardo, te juro que es con la mejor onda posible, pero hacete ver por algun psicologo, charla con algun amigo o familiar, no se.\nPorque, como dije, venir a un foro a exagerar sobre un tema, hablar de lo que no tenes idea (como vos dijiste) solo para fomentar al bardo, es grave lo tuyo","replies":[]}]}]}]}