{"poster":"badboy503","date":"2018-07-11T07:01:40.426+0000","title":"Chat Mutes","subforum":"Help & Support (OCE)","up_votes":1,"down_votes":0,"body":"Can you please unmute my account? I don&#039;t know what i&#039;m chat muted for this time but its becoming an absolute joke. How am i supposed to type anything to my team and encourage people doing well when i can&#039;t even type? Just because there is a few autistic people that get so triggered. \nWhy am i being punished? Can&#039;t people that don&#039;t want to hear me just mute me and be done with me? Why am i being punished when there is a chat filter for people who don&#039;t want to see swear words and a mute function? This is a disgrace, no other game chat mutes people in a competitive setting.\nThis is why your community is so toxic, because they know with enough reports they can get people chat banned or perma banned and its just not right.\nI have literally never reported someone unless they give up or throw a game on PURPOSE (only on purpose if its just a loss its bl). ","replies":[{"poster":"Ninox","date":"2018-07-11T13:02:34.381+0000","up_votes":1,"down_votes":0,"body":">I don't know what i'm chat muted for this time\n\nIf you didn't save your logs when the reform card popped up you can send a ticket to Player Support and they can provide you with those logs.\nhttps://support.riotgames.com/hc/en-us/requests/new\n\n>How am i supposed to type anything to my team...?\n\nYou aren't outside of the limited lines it gives you. The whole point of a chat restriction is that you've proved you can't be trusted with that freedom to not ruin other player's experiences, so you are given the bare minimum you need for vital communication.\n\n>Just because there is a few autistic people that get so triggered.\n\nThis being your attitude even just in a boards post doesn't exactly make anyone inclined to give you the benefit of the doubt as to you being an innocent victim.\n>Can't people that don't want to hear me just mute me and be done with me?\n\nBecause generally speaking if you have to mute someone the damage is already done. If a player is making the decision to mute you then it is because you have already negatively affected their experience. Muting is a good bandaid, but it doesn't actually solve any problems.\n\n> there is a chat filter for people who don't want to see swear words\n\nYou don't have to swear to be toxic. I could tell someone that they are a \"worthless piece of human garbage\" and it's undeniably toxic and involves no swear words at all. Again the chat filter is only a bandaid , it isn't (and shouldn't be) the only defence.\n\n>no other game chat mutes people in a competitive setting.\n\nPlenty of games do (Overwatch, DotA, HotS to name a few), and plenty more games will simply put you on a short ban for such behaviour. Chat toxicity hardly goes unpunished in other games.\n\n>because they know with enough reports they can get people chat banned\n\nThey can *know* that all they want, it doesn't make it true. Only **one** report is necessary to trigger a review, anymore than that are entirely irrelevant except in the context of manual reviews of accounts that get reported a buttload and don't get picked up for anything by the other systems in place. If you hadn't said anything worthy of a restriction, chance are you wouldn't have been restricted. There are of cours with anything a few false positives, but given the content of your post I find that unlikely.\n\n>I have literally never reported someone unless they give up or throw a game on PURPOSE\n\nAnd that is *your* definition of punishment worthy behaviour, but it isn't the community's. Riot have to cater to the wider community, not to individuals (even if that were possible). While there are players like you that feel no words that could ever be typed will affect you more negatively than gameplay offences, that just isn't true of everyone else. Riot, and consequently their punishments systems have to be as much in the middle ground as possible.\n\nIt's also worth remembering that this game is rated 13+.\n\n___\n\nYou can read more about the punishment systems here: \nhttps://support.riotgames.com/hc/en-us/articles/207489286-Instant-Feedback-System-FAQ-\n\nThe Summoner's Code (the standard all players are held to) here: \nhttps://oce.leagueoflegends.com/en/game-info/get-started/summoners-code/\n\nAnd more about chat restrictions here: \nhttps://support.riotgames.com/hc/en-us/articles/201752984","replies":[]},{"poster":"badboy503","date":"2018-07-11T07:11:19.500+0000","up_votes":1,"down_votes":0,"body":"[REMOVED - No Reporting Other Players]\n\nThese are the kind of people that you listen to when you chat mute people. This is so toxic and yet i still get chat banned? Whats the go?\n\nGod forbid me for wanting to win a RANKED game and getting upset when people aren't committed to trying to win.","replies":[]}]}