{"poster":"Ketil","date":"2015-07-13T03:18:29.573+0000","title":"Para mi ahora la jungla esta mejor (devorador)","subforum":"Charlas Generales","up_votes":1,"down_votes":2,"body":"Bueno luego de un tiempo jugando lol y viendo el foro (quejas sobre el devorador). Queria dar mi opinion, que veo bien el cambio. \r\nPara  empezar antes que salga este peculear item, los reyes de la jungla eran sejuani y gragas. Seguido por reksai y nunu.\r\nLuego hubo un buff al item de ap, lo cual beneficio a varios pero para competivo nidalee y diana digamos que quedaron en el meta (por otro lado hicieron cagada con ez ap).\r\nAhora metio el buff al devorador, champs afk farm vuelven al meta, shyvanna, ww, udry, xin, yi, jax kayle, etc. (basicamente cualquier champ.). Es evidente que este item mete mas da&ntilde;o, pero tenes que tener  un jungla sin presencia por 20 minutos aprox. Lo cual puede costar la partida (este finde lo vi mucho). Para mi gusto de todos los champs. que se quejan con este item el unico que veo fuerte es kayle que es extramademente debil al counterjg. Otro que hoy vi fuerte es rengar, pero capaz que el que lo usaba era bueno.\r\nFaltaria un buff. item de ataque fisico, asi vuelven k6, lee, jarvan, pantheon, etc.\r\n\r\nPor lo menos de mi parte, sigo pensando que los junglas tankes siguen teniendo un poquito mas, asi que seguire banneando a sejuani :P. \r\n\r\nCelebro que ahora en una partida  pueden estar de un lado sejuani, del otro nidalee o shyvanna. Sin saber quien tiene ventaja. Antes si alguien se olvidaba de dar ban a sejuani el equipo que lo pickeaba tenia mucha ventaja. Aparte seamos sinceros a la mayoria  no nos gusta el  meta de tankes.","replies":[{"poster":"EL MUCHACHO","date":"2015-07-13T17:24:46.922+0000","up_votes":1,"down_votes":0,"body":"los ganks tambien dan cargas no se por qué decis que el jg tiene que estar ausente, ademas 30 cargas no es nada, ojo a mi me pone contento el cambio de meta pero creo que esta un poco pasado.","replies":[{"poster":"Ketil","date":"2015-07-13T21:30:37.204+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=LELECERATOP,realm=LAS,application-id=v7qsfXsE,discussion-id=JREq7XFi,comment-id=0002,timestamp=2015-07-13T17:24:46.922+0000)\n>\n> los ganks tambien dan cargas no se por qué decis que el jg tiene que estar ausente, ademas 30 cargas no es nada, ojo a mi me pone contento el cambio de meta pero creo que esta un poco pasado.\n\nSi terminan en kills te dan cargas. Si gankeas con shyvanna o no se kayle es complicado que terminen en kill, si el jungla enemigo sabe lo que hace deberia hacer los cangrejos. Y campear bot (un drag da 5 cargas). Como vos decis hay champ. que pueden cargarlo con ganks. Por ej. Hoy con xin lo llene en el minuto 15 aprox. \nAh y si como decian mucho definitivamente VI esta muy fuerte. Y bueno kayle tambien, pero cuesta mas cargarlo. En lo demas yo en late prefiero tener  a una sejuani, antes que una shyvanna con todas las cargas. Lo cual de diversidad estrategica que es lo que todos deseamos.","replies":[{"poster":"EL MUCHACHO","date":"2015-07-14T15:44:39.229+0000","up_votes":1,"down_votes":0,"body":"si pero al devorador nuevo tambien sumale el nerf a la vida de las torres, se presta mucho para que estos jgs carreen las partidas.","replies":[]}]}]},{"poster":"Sir Crucifix ","date":"2015-07-13T21:43:37.060+0000","up_votes":1,"down_votes":0,"body":"{{champion:79}} {{champion:113}} {{item:3070}}","replies":[]},{"poster":"Dying Atheist","date":"2015-07-13T09:03:32.681+0000","up_votes":1,"down_votes":0,"body":"El devourer esta roto man , {{champion:102}} INSTABAN en ranked , arreglan algo y rompen otra cosa , así es la vida hermano , lo que mas me molesta es lo mismo que dice kobalth , cada vez mas básico y menos skillshots , y estoy convencido que los arreglos de precio en los items AP es porque los niños no podían farmear 1600 gold antes del primer back ... GG","replies":[{"poster":"D Godyr Gates","date":"2015-07-13T11:12:14.038+0000","up_votes":1,"down_votes":0,"body":"Es demasiado irritante y frustrante que \"arreglan algo y rompen otra cosa\". Totalmente viejo.\nLo de los items de AP en mid no me gusta para nada, siento que armo facil y pego poco o menos que antes. No se que les agarro de repente que cambian el precio a 99 de los 100 items del juego. Pls Rito Pls.\n\nEn cuanto al Devourer me gusta. Vuelven a aparecer esos WW Jg insta Burst {{summoner:13}} {{summoner:14}}","replies":[]}]},{"poster":"Kobalth","date":"2015-07-13T04:41:46.197+0000","up_votes":1,"down_votes":0,"body":"ami lo que me molesta del Devorador es que pegando simples básicos(los que no necesitas apuntar los pega automático) haga mas daño que habilidades que necesitas un poco de skill \n\nYo soy de usar jg con el guerrero y lo veo como el mas debil de los 4. \n\ny también me molesta que el item de jg ap no le sirva a {{champion:9}}","replies":[]}]}