{"poster":"Zahkine","date":"2015-01-31T01:46:54.104+0000","title":"Buenas skins de campeones","subforum":"Creaciones de la comunidad","up_votes":1,"down_votes":0,"body":"> Saludos, hace mucho me encontrado jugando league of legends, uso diversos campeones y cuando los uso pienso que skin va con cada uno de estos, que skin podrian ser divertidos de ver y usar, siempre pienso y me han dicho que han sido buenas ideas, fue asi que quiero ahora presentarles mis planes, los cuales tienen incluidas ideas de poderes. ¡Ojala que les gusten!                     \r\n\r\n> Bueno, he aqui las ideas:\r\nNumero 1: {{champion:150}}     Gnar.\r\nYo frecuento usar mucho a este campeon y he pensado bien en sus poderes, a mi se me a ocurrido que se le podria poner una skin de Gnar Juegos Olimpicos,         esteticamente se me ocurre que use una camiseta deportiva(yo creo que mas parecida a las atleticas debido a la gran velocidad de movimiento que el campeon posee) unos shorts deportivos y a cambio de los huesos en la cabeza, una banda elasrica deportiva. Pensando en Mega Gnar, puede ser lo mismo pero con las prendas rotas.\r\nHablando de los poderes aqui esta lo que pense:\r\nQ: Este poder podria cambiar en el bumeran, donde podria tirar un disco de el conocido deporte, Tiro de disco, en el caso de Mega Gnar, este lanzaria un caballete, o el martillo del deporte tiro con martillo (Son dos ideas distintas, ustedes deciden)\r\n\r\nW: En este pense que seria algo mas complicado, se me ocurrio que los circulos  que aparecen alrededor del contrincante, sean de los colores de algunos de los circulos de los juegos Olimpicos, en caso de Mega Gnar, podria golpear al enemigo con una pesa de una mano, el movimiento seria el mismo pero con una pesa en la mano.\r\n\r\nE: No se me ha ocurrido una buena idea, pero podria hacerse como si hiciera salto de jabalina, o salto alto, lo que encuentro mejor ya que la jabalina seria muy aparatosa.\r\n\r\nR: No lo he pensado muy bien, por la complejidad del movimiento.\r\n\r\nNumero 2: {{champion:121}}   Kha'Zix.\r\nEs un campeon que se le puede sacar mucho provecho por su apariencia a asesino-monstruo, yo he pensado una skin bastante sencilla, seria Kha'Zix Mantis o Mant'Zix\r\ntendria la apariencia de este insecto conocido,por su forma de devorar y matar a sus presas, parecido a la forma de ser de Kha'Zix.\r\n\r\nCon respecto a sus poderes, serian lo mismo, lo que se podria agregar es cuando usa su R(Ultimate) o cuando este inflige el basico con daño magico, los efectos podrian ser hojas que caen al suelo dispersas. Otra idea es que al evolucionar la R(Ultimate) se vuelva de un color mas verde intenso.\r\n\r\n\r\nNumero 3: {{champion:12}} Alistar y  {{champion:114}} Fiora.\r\nEstos dos campeones  los escogi porque juntos pueden crear un conjunto de skins bastante divertidos, mi idea es que Fiora tenga un skin que se llame Fiora Matadora junto con Alistar Corrida Furiosa, Fiora  podria  tener una capa roja, junto con un traje azul con bordados amarillos y el tipico sombrero usado por los toreros, hablando de Alistar, se le puede poner un negro intenso con ojos rojos, es bastante sencillo.\r\n\r\nLos poderes seguirian igual, pero algo muy divertido seria que al encontrarse los dos con skin se digan cosas o hagan animaciones entre ellos, pero claro que deban ser  contrincantes, que Fiora diga cosas como \"Olé\" o cosas por el estilo.\r\n\r\nEso es todo, ojala que les haya gustado y si se quieren comunicarse, o tienen una duda envien al email rapafapa.pessot@gmil.com, les ruego se comuniquen con ese porque el email de cuenta ya no es utilizado, ¡Nos vemos!","replies":[{"poster":"NeroNexoUltimate","date":"2015-02-01T16:49:27.252+0000","up_votes":1,"down_votes":0,"body":"El de {{champion:114}}  con {{champion:12}}  me gustó mucho :) aun que en servidores de Europa causaria polemicas en españa....","replies":[]}]}