{"poster":"NdrejVinacc","date":"2018-12-17T15:59:32.358+0000","title":"Mentalità junglers.","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Ragazzi sto cercando di migliorare in giungla, so che &egrave; un ruolo molto molto complicato a livello mentale, bisogna sempre sapere dove sta il jungler nemico e cosa fare in base alla sua posizione, qualche main jungle che mi sa dare qualche dritta? Riguardo ai champ, uso molto Lee sin, so farci un bel po&#039; di giochetti, spesso carryo di brutto ma in late non so cosa fare, poi gioco shaco e bene o male riesco a cavarmela nei teamfight (so che dovrei splittare in late, per&ograve; in low elo il team non lo permette). Accetto tutti i consigli e ringrazio tutti coloro che me ne daranno!","replies":[{"poster":"vondarck","date":"2018-12-19T11:53:54.723+0000","up_votes":1,"down_votes":0,"body":"Mi consento di pulirti qualche piccola \"sbavatura\" a livello di game:\n\nLee sin è molto forte early, ha gank potential alto e può essere uno scomodissimo invasore, tutto questo però si spegne superato il livello 8/9 dove molti campioni scalano meglio di te e sono pure più utili.\nFidandomi del tuo \"lo gioco benino\" ti posso solo dire: chiudi la partita in fretta.\n\nShaco: molto difficile come champ, non sempre purtroppo si può splittare, ti consiglio trick 2g che splitta molto (usa udyr ma molte spiegazioni che da sono polivalenti)\nA volte non è possibile splittare perché o la tua comp non ha un tank per stoppare un dive 4v5 oppure a low elo spesso resettano stupidamente le wawe slowpushate..\n\nGragas: chiudigli l'item da jung blu se miri a giocarlo AP, è attualmente il.miglior oggetto da jungla rapportato a quello che fanno gli altri 3","replies":[]},{"poster":"chaoswarrior204","date":"2018-12-17T18:40:58.621+0000","up_votes":1,"down_votes":0,"body":"Hai scelto 2 dei champion più difficili per la giungla da giocare non tanto per le meccaniche (Lee non è proprio facile nemmeno meccanicamente) ma per il modo di giocarli sulla mappa, in giungla conviene iniziare a giocare champion facili come xin, ww, yi, vi, ecc... Almeno puoi concentrarti sul Macrogame che per un jungler è tutto","replies":[]},{"poster":"Dr LouD","date":"2018-12-17T17:37:25.812+0000","up_votes":1,"down_votes":0,"body":"Gioca champ semplici e concentrati sul macro game","replies":[]},{"poster":"zioposty","date":"2018-12-18T12:39:55.876+0000","up_votes":1,"down_votes":1,"body":"Sei bronzo e giochi lee sin e carri. Se continui cosi, con la nuova season, andrai dritto in iron. Prima cosa, tu non carri , non sai carriare senno non saresti bronzo. In bronzo si carria con soraka jungle senza smite, per renderti l'idea, per farti capire quante scimmie ci sono, anzi le scimmie sarebbero piu forti e piu intelligenti. Seconda cosa, lee sin è complicato non è adatto , soprattutto se tu ancora non sai come junglare quindi prendi champ piu facili : shyvana, jax, master yi che poi facili si fa per dire, perchè alla fine se sei stupido anche un champ meccanicamente facile può sembrarti difficile da usare. Terza cosa, guardati qualche video e impara anche le basi del gioco perchè, se sei all inizio del tuo percorso, è indispensabile capire alcune cose , alcuni concetti base che anche in gold ( l elo considerato un traguardo da raggiungere, ma che ormai viene raggiunto anche da persone affette da disabilitá ma che mentalmente sono stabili) commettono ancora.","replies":[]}]}