{"poster":"MADAFAKA","date":"2020-01-20T19:21:40.543+0000","title":"CRUSH DUMP ERROR","subforum":"Problemas Técnicos","up_votes":1,"down_votes":0,"body":"Amigos, alguien sabe como solucionar el problema?\r\n\r\n\r\nSaludos!","replies":[{"poster":"Notela Kawai","date":"2020-01-20T19:27:55.894+0000","up_votes":1,"down_votes":0,"body":"Saca una captura de pantalla para apreciar mejor el problema.","replies":[{"poster":"MADAFAKA","date":"2020-01-20T19:43:30.755+0000","up_votes":1,"down_votes":0,"body":"https://imgur.com/a/wWw5PqV\n\nEse es el error.\n\n\nSaludos.","replies":[{"poster":"Notela Kawai","date":"2020-01-20T22:23:26.418+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=MADAFAKA,realm=LAS,application-id=X54mVVp0,discussion-id=pyLKff6f,comment-id=00000001,timestamp=2020-01-20T19:43:30.755+0000)\n>\n> https://imgur.com/a/wWw5PqV\n> \n> Ese es el error.\n> \n> \n> Saludos.\n\nReinstala el Juego y cambialo a una carpeta que no este tan llena. Luego de eso mira algun tutorial para ''optimizar'' los juegos y creo que con eso ya es suficiente. Usa el Ccleaner, pon registro, y pon ''buscar problemas'' y luego ''reparar problemas seleccionados.''\n\nYo lo que veo en realidad es un virus, seguramente tendras la pc lenta por eso.","replies":[{"poster":"izipiziJG","date":"2020-01-21T18:36:16.832+0000","up_votes":1,"down_votes":0,"body":"es un error que le tira a miles de personas no es un virus.","replies":[]}]}]}]},{"poster":"SrGerarZ","date":"2020-01-21T00:20:39.211+0000","up_votes":1,"down_votes":0,"body":"No es ni un Virus y nada,\nEse error persiste en Computadores con Procesador Dual core con Windows 7, al parecer algo pasa con eso, los archivos de lol tiene alguno problema con windows 7 no son compatibles u otra cosas, la única solución que encontré  es instalando windows 10,\n\nSolo si juegas el lol y no tiene muchos archivos importantes y si windows 10 te corre bien con el lol instalalo si quieres, o hay otra alternativa que es no borrar windows 7 yo hice lo mismo\n\nSi tienes mucho espacio libre en tu disco duro crea una partición separada por lo menos unos 60 gb o mas si quieres\nasí tendrás espacio para instalar windows 10 y el lol\nYo tengo windows 10 y 7, el windows 7 lo tengo todavía porque juego el lol en una netbook y no es muy potente que digamos me anda 50 30 fps el lol, y  en windows 7 me anda a 50- 56 estables\nSigo esperando que reparen ese error en windows 7 :C\nmientras tanto sigo jugando con 30 o 45 fps al lol en windows 10 :C","replies":[{"poster":"MADAFAKA","date":"2020-01-21T14:11:17.795+0000","up_votes":1,"down_votes":0,"body":"Tengo instalado el W10, hasta hace poco funcionaba impeque... nose que mierda paso XD","replies":[]}]},{"poster":"Widito","date":"2020-01-20T19:45:32.885+0000","up_votes":1,"down_votes":0,"body":"Eso me pasaba al finalizar una partida del lol unos dias hasta que me dejo de andar la compu\n{{sticker:slayer-pantheon-thumbs}} ","replies":[{"poster":"MADAFAKA","date":"2020-01-20T19:48:24.973+0000","up_votes":1,"down_votes":0,"body":"Despues de la selección de campeón, al pasar a la pantalla de carga, me aparece ese error.\n\n\n:(!","replies":[]}]}]}