{"poster":"Chalze","date":"2015-03-06T20:13:49.502+0000","title":"Shen or Maokai?","subforum":"Miscellaneous","up_votes":1,"down_votes":1,"body":"I’m beginning to see Shen falling off much harder than the other tanks who has nothing really to abuse in their kit in the current meta compared to someone like Maokai (the other top lane tank I enjoy playing frequently)…\r\n\r\nShen or Maokai from now? I want on primary tank so I don’t really wanna play both so I can focus on one. I’m currently leaning towards Maokai at the moment as Shen just seems underwhelming in terms of how much protection he can grant for his carries compared to the AoE 20% damage reduction with Maokai…\r\n\r\n{{item:3027}} {{champion:57}}","replies":[{"poster":"Chalze","date":"2015-03-07T04:51:45.291+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Dota2forthewin,realm=OCE,application-id=Ntey9fRZ,discussion-id=dgG4o2An,comment-id=0001,timestamp=2015-03-06T23:39:25.991+0000)\n>\n> i love playing shen\n> \n> his dueling power in lane is good against most melees\n> but he takes a lot of knowledge\n\nHe takes a lot of knowledge which I'm fine with, but he seems underwhelming compared to other tanks now...\n\n> [{quoted}](name=Saldean,realm=OCE,application-id=Ntey9fRZ,discussion-id=dgG4o2An,comment-id=000000000000,timestamp=2015-03-07T01:37:55.858+0000)\n>\n> That's nice, having to have mid and top as your preferences are nice. For you to main 3 champions at top is a really good start, if however you have any other substitute champs that you also have I would recommend you to practice  2-3 champs. But its just my suggestion so right now your champion pool is going swell.\n\nFunny how you say it's a 'good start'...trust me I'm not planning to go anywhere xDD\n\n> [{quoted}](name=iNoob,realm=OCE,application-id=Ntey9fRZ,discussion-id=dgG4o2An,comment-id=0002,timestamp=2015-03-07T04:20:10.840+0000)\n>\n> Shen is garbage unless you are medium/high plat imo...\n> \n> 1. You go full tank so getting 80-90 cs by 10 minutes, and keeping it at that standard can be tricky\n> 2. Your waveclear is godawful, even with sunfire (lack of waveclear = you having to phase between getting that 1 cs and checking your minimap/hp bars of allies)\n> 3. Your ult is such a long cooldown\n> 4. In your elo (I am guessing u are bronze/silver trash) people don't make proper use of shen R\n> 5. Tanks don't get you easy wins in bronze/silver, getting farmed and fed as Pantheon/Riven/Fiora does (these 3 champions all use Hydra and have good farming potential, you can also assassinate their squishies with them, and even after assassinating you are still a huge threat which needs to be dealt with)\n\n1 - Going full tank by 10 minutes isn't a problem for me because I'm such low level that I'm against people who don't generally pressure you in lane lol\n2 - I buy a TriForce mid game with Sunfires early so his wave clear is a little better, but that's one of the reasons why I feel like ditching Shen...lets say Maokai's wave clear is so much better, E, Q and it's a whole bunch of gold and xp\n3 - Yeah it is...\n4 - I am Bronze so yeah, I know how and when to use ult (in comparison to my level trust me) but because of the lack of communication and coordination my allies continue to run (out of my E range when I tp to them) but then again that's a problem that only occurs with Shen...\n5 - Tanks don't get you easy wins, but it's much better to have a tank than lets say have a full damage team (which happens a lot at my elo cuz everyone just WANTS to dish out damage and 'carry', which I don't mind to play tank) but yeah fair enough. I'll consider using Pantheon again though","replies":[]},{"poster":"iNoob","date":"2015-03-07T04:20:10.840+0000","up_votes":1,"down_votes":0,"body":"Shen is garbage unless you are medium/high plat imo...\n\n1. You go full tank so getting 80-90 cs by 10 minutes, and keeping it at that standard can be tricky\n2. Your waveclear is godawful, even with sunfire (lack of waveclear = you having to phase between getting that 1 cs and checking your minimap/hp bars of allies)\n3. Your ult is such a long cooldown\n4. In your elo (I am guessing u are bronze/silver trash) people don't make proper use of shen R\n5. Tanks don't get you easy wins in bronze/silver, getting farmed and fed as Pantheon/Riven/Fiora does (these 3 champions all use Hydra and have good farming potential, you can also assassinate their squishies with them, and even after assassinating you are still a huge threat which needs to be dealt with) ","replies":[]},{"poster":"Saldean","date":"2015-03-06T23:09:24.840+0000","up_votes":1,"down_votes":0,"body":"Don't leave shen in the closet yet! :< he still has his moments of being a tank line and protector( from his ulti being a life saver) :D. AS for maokai yes he is very good as a tank for front line and peeling in your team overall. If however your champion pool from what I have read isn't enough try other's for e.g. Mundo, Shyvanna, Gnar, Sion and Malphite that I feel are viable. Overall it's what you want to play and your comfort seems to be Maokai, your choice. :>","replies":[{"poster":"Chalze","date":"2015-03-06T23:40:49.949+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Saldean,realm=OCE,application-id=Ntey9fRZ,discussion-id=dgG4o2An,comment-id=0000,timestamp=2015-03-06T23:09:24.840+0000)\n>\n> If however your champion pool from what I have read isn't enough\n\nMy champion pool:\nTop - Maokai, Irelia, Shen\nJG - Lee, Nidalee\nMid - Talon, Orianna, Nidalee\nADC - Ezreal, Varus\nSupp - Thresh, Braum\n\nBut I only like to play mid and top at the moment...","replies":[{"poster":"Saldean","date":"2015-03-07T01:37:55.858+0000","up_votes":1,"down_votes":0,"body":"That's nice, having to have mid and top as your preferences are nice. For you to main 3 champions at top is a really good start, if however you have any other substitute champs that you also have I would recommend you to practice  2-3 champs. But its just my suggestion so right now your champion pool is going swell.","replies":[]}]}]},{"poster":"Garens Harem","date":"2015-03-06T23:39:25.991+0000","up_votes":1,"down_votes":0,"body":"i love playing shen\n\nhis dueling power in lane is good against most melees\nbut he takes a lot of knowledge","replies":[]}]}