{"poster":"Chalze","date":"2015-03-13T23:21:08.317+0000","title":"My Thoughts on Patch 5.5 Kassadin so far...","subforum":"Miscellaneous","up_votes":1,"down_votes":0,"body":"No I haven’t played him that many times, but I think a couple of games with the new 5.5 Kassadin is enough for me to know more about him.\n\nSo my initial thoughts are:\n\nThe base damage decrease on his Q (170 now) really doesn’t effect him as much in any way. You still deal a ton of damage late game due to good scalings\n\nNow, about the big change from the ‘previous’ Kassadin.\nHis ult used to have a ton of mana cost and the range was 700 with 7/5/3 second cool down.\nNow his ultimate has a significantly reduced mana cost which impacts his mana spendings by a ton, so this is definitely a much bigger buff than many people would see at first, but I find it somewhat game-changing for Kassadin to have max cost of only 800 mana whereas he used to have 1200 as mana cost. Now the range actually isn’t that bad, but as usual, it could be better. The shorter range (500) now means that Kassadin is no longer able to suddenly jump in from a safe distance, and may need to put himself in some harm’s way first before he ults in for damage. Regardless, as much as I hate to say, to good Kassadin players who see him as a face roll assassin (I kinda do) this range nerf will balance him up. But not to worry! This is the fun part.\n\nThe reduced cool down makes up for the range decrease by (I reckon) far more than Riot was aiming for; unless they went with the Xerath idea: Xerath was primarily a long-as-fuk ranged mage so they reworked him into being nothing BUT a long-as-fuk ranged mage, increasing the range of most of his stuff, now Kassadin was primarily supposed to be a super mobile champion, so Riot changed Kassadin’s ultimate into a [manageable] insanely over mobile mage which is really, what Kassadin is).\nSo if Riot was aiming for that, they definitely succeeded with the cool down buff.\n\nNow many people have been talking about how now Kassadin’s blink will be on a 1.2 second cool down with max CDR, but I don’t think so. Before, to reach 2 seconds cool down on your R you needed some cool down reduction, but now since his ultimate is now on a 2 second cool down maxed out, you no longer need to build that much cool down reduction, and now can build for more damage, which is always excellent on Kassadin, since to be honest, there really isn’t much difference between 2 seconds and 1.2 in game. Plus, as Kassadin you should always take the 5% CDR Mastery which already makes it 1.9 seconds. Not a lot, but CDR becomes less effective when the base cool down is low anyway.\n__________\n\nSo in other words, I now think that Kassadin is finally in a healthy state while not being overly powerful but still in the right hands, can very much hard carry a game when fed.\n___________\n\nWith this build I go, you can reach 888AP total (without buffs from Baron, i died with Baron buff last time I had nearly full build, then I got 888AP). I won’t go over the Runes and Masteries, cuz they aren’t that much different from standard AP mage stuff.\n\nMy Personal KassaCarry Build (not in purchase order)\n\n-  {{item:3020}} Sorcerer’s Shoes [I like to take Alacrity but Furor’s fine and HomeGaurd as always when you’re losing the game]\n- {{item:3100}} Lich Bane [insane damage proc along with your W, mana for your R]\n- {{item:3089}} Rabadon’s Deathcap [Raw AP]\n- {{item:3157}} Zhonya’s Hourglass [Raw AP, Armour and Statis unless anything goes wrong]\n- {{item:3027}} Rod of Ages [Raw AP, good chunk of health, good chunk of mana for R]\n- {{item:3040}} Archangel’s Staff/Seraph’s Embrace [Kassadin has the highest base mana pool and along with Lich Bane, Rod of Ages and the whopping 1000 mana you get from this, you honestly get so much mana from a W proc and deal so much damage from R that people start to realise Kassadin isn’t dead]\n_______\n\nYes, I have hardly any magic penetration here, but that’s mostly because you shouldn’t be killing/assassinationg anyone with a lot of MR/the squishy targets such as the enemy AP or ADC which you can delete very quickly with a quick RWQE. I like to do RWQE because as you ult in, you deal damage with ult, deal more damage with W, then as you fire off Q, since it has a travel time, as soon as it hits your target, the instant cone AoE burst from E should hit as you use it right after, making both the damage components of Q and E hit at the same time for an insta-delete. \n_____\n\nMathemagics on R (and Mana)\n\nKassadin has a total base mana pool of 1538 at Lvl18, which is massive.\n1538 + 1000 + 250 + 650 = 3438 (we’re not counting Runes and Masteries)\n\nKass R deals 80/100/120 (+2% of Max Mana)\n2% of Max Mana = 3438 x 0.02 = 68.76\nR max damage with full stacks = 240/300/360 (+6% Max Mana)\n3438 x 0.06 = 206.28\n\nSo Kass R at first (maxed out) deals 186.76 which isn’t too bad, but when it’s fully stacked it deals 566.28 which is really nice considering if you have enough mana you can keep spamming it every 1.9 seconds at the most.\n\nAlso, W refunds 40% of missing mana, which if we assume is all of it, 3438 x 0.4 = 1375.2 Mana\nDats a helluva lot of mana refunded from one single auto attack…\n\nArchangel’s/Seraph’s Passive scales on mana too. Archangel’s/Seraph’s gives you AP = 3% of man mana.\n3% of max mana is 3438 x 0.03 = 103.14. Considering you get a base AP of 60, from one single item of the game, you gain a total of 163.14 AP. This is why stacking an Archangels early and delaying your power spike is so important. Do that and play smart early game, and your late will hit hard.\n\nSeraph’s Shield scales on mana too. Seraph’s gives you shield = (assuming you have all of your mana) 20% of current which is max in this case = shield + 150.\n3438 x 0.2 + 150 = 837.6. That’s one helluva shield (at max mana).\n__________\n\nSo guys, I reckon Kassadin’s finally been resurrected from the Nerf Grave, still not as strong as he used to be, but with a good build and ‘good understanding’ of the game, I reckon Kassadin would be an excellent addition in your champion pool.\nI can finally play Kassadin on a regular basis now due to these  changes.\n\n_____________\n\nWhat are your thoughts on Kassadin now?\n\n{{champion:38}} {{item:3259}} {{item:3089}} {{item:3040}} {{item:3157}} {{item:3027}} {{item:3100}} {{champion:38}} ","replies":[{"poster":"Sackboy","date":"2015-03-14T01:46:29.170+0000","up_votes":1,"down_votes":0,"body":"Remove boots, get new AP item, enjoy free wins.","replies":[{"poster":"Chalze","date":"2015-03-16T08:03:34.747+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Sackboy,realm=OCE,application-id=Ntey9fRZ,discussion-id=j0Fh8Y0K,comment-id=0001,timestamp=2015-03-14T01:46:29.170+0000)\n>\n> Remove boots, get new AP item, enjoy free wins.\n\nIf so, I would do that in the very late game, probably with the new AP item since it grants you 120AP and a good chunk of movement speed anyway{{item:3285}}","replies":[]}]},{"poster":"A Hobo With A PC","date":"2015-03-13T23:31:44.839+0000","up_votes":1,"down_votes":0,"body":"I would go with Zhonyas and good job for writing all this info down","replies":[{"poster":"Chalze","date":"2015-03-13T23:58:31.706+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=A Hobo With A PC,realm=OCE,application-id=Ntey9fRZ,discussion-id=j0Fh8Y0K,comment-id=0000,timestamp=2015-03-13T23:31:44.839+0000)\n>\n> I would go with Zhonyas and good job for writing all this info down\n\nMy pleasure...I tend to go overboard when I write about champions I love :)\n\n{{champion:38}} {{champion:38}} {{champion:38}} {{champion:38}}","replies":[]}]}]}