{"poster":"Chalze","date":"2015-01-31T07:46:22.094+0000","title":"Champion Design (rebooted from AAAAAAAAAAges ago)","subforum":"Player Creations","up_votes":1,"down_votes":0,"body":"I STILL LACK A SET NAME FOR THIS GUY >___>\n\nAnyway. Imma call him Kaze, Breaker of the Winds for now (yes, cheesy aye, Kaze means Wind directly in Japanese......or cold...in terms of when you catch a cold). Pronounced \"Kahz-aye\" or \"Kah-zay\"\n\nAlso, the Asterix * stands for degrees.\n____\n\nKaze, Breaker of the Winds\n____\n\nHP - 510\nHP/Lvl - 90\nEnergy - 200\nEnergy Regen - 50\nMS - 335\nAD - 55\nAD/Lvl - 3.1\nArmor - 21.4\nArmor/Lvl - 3.7\nAS - 0.660%\nAS/Lvl - 55%\n\n____\n\nPASSIVE - Martial Mastery\nAll of Kaze's basic attacks and damaging basic abilities deal bonus magic damage according to half of the enemy's crit chance.\nAlso, every time Kaze is damaged by an ability which deals magic damage (of any sort) he gains 5 movement speed. This can stack and stacks up to a cap of 7 times. Stacks last for 7 seconds.\n\nInfo:\n- If Kaze has a Tiamat/Hydra, the bonus damage will be calculated depending on the primary target hit.\n- Kaze's Sweeping Force's bonus damage will be calculated on the enemy with the highest crit chance who will be hit.\n- Tiamat/Hydra's active has no effect with his passive\n- Kaze's ultimate will not be affected in any way.\n___\n\nQ - Sweeping Force\nKaze sweeps his lance in a cone, damaging and knocking back everyone in 700 range in 45* for 500 units from where they were when Sweeping Force hit them and slows for 20% for 2 seconds. Targets who are knocked onto other targets will all be affected by the slow. Kaze gains 10 Energy per champion hit. Energy refund caps at 30 however enemy targets hit to one another will count. \nDeals only 70% total damage to monsters.\nCost - 70/65/60/55/50 Energy\nDamage - 30/60/120/150/180 (+90 AD)\nCooldown - 11/9.5/8/6.5/5\n\nInfo:\n- Although this is a fast travelling skillshot, it still counts as a skillshot and therefore can be blocked by Unbreakable and Wind Wall.\n- Affected by Martial Mastery.\n- Deals only 70% total damage to monsters however damage to minions are unaffected.\n- Can knock back ALL dashes (only exception is Malphite's Unstoppable and Vi's Assault and Battery)\n\n____\n\nW - Ionian Protection\nActive - Kaze temporarily gains a buff which he takes a percentage of reduced damage from ALL sources (except True Damage) \nDuring these few seconds his auto attacks increase the duration by 0.5 seconds and slows target by 35% for 2 seconds. Duration caps at 4 seconds.\n\nCost - 45/40/35/30/25 Energy\nReduced damage percentage - 15%/20%/25%/30%/35%\nDuration - 1/1.5/2/2.5/3\nCooldown - 16/14.25/12.5/10.75/9\n\nInfo:\n- Cooldown starts when he casts Ionian Protection and the cool down is unaffected by the increased duration.\n\n____\n\nE - Accumulating Winds\nKaze dashes to an enemy unit, damaging it and gaining the ability to cast Accumulating Winds however many times he likes in the next 0.5 seconds on the next enemy unit however can only cast it within 70* range of the original direction he casted in. The cost decreases by 20 energy twice and stays at a cap of 10 energy from the third onward. Cooldown drops to 80% of it's post-CDR cool down if Kaze only uses Accumulating Winds once without chaining it after 0.5 seconds.\n\nCost - 50 Energy\nDamage - 15/60/105/150/195 (+ 75% Bonus AD)\nBase cool down - 10/9.5/9/8.5/8\nRange - 500\n\nInfo:\n- Accumulating Winds is set as a smart/quick cast ability and can follow if you click and drag your mouse slowly through valid targets. If your mouse were to drag off targets in the range of the cone, Kaze will walk there as usual.\n- The cool down of Accumulating Winds start on the first cast however gains an extra second every time you use it however the cool down will not stack past the original cool down (even post-CDR)\n- Deals attack damage\n\n____\n\nR - Thundering Whirlwind\n\nPassive - Sweeping Force cone range increases by 15* and Martial Mastery movement speed stack increases by 1 per point maxed in Thundering Whirlwind \n\nActive - Kaze summons his lance and sweeps around a huge area twice quickly, damaging all enemies twice. Enemy champions caught in the area will then rotate their position 180* clockwise to where Kaze stands when he casts his ultimate. Thundering Whirlwind has a base damage penalty depending on how many additional enemy champions (more than one) it hits. Any other units hit within the radius (minions, monsters, pets etc) will be dealt the post-penalty damage however will not be affected by the position rotation (the only exception being Tibbers, champion clones including Mirror Image, Hallucinate etc, champion copies such as pets under the control of Children of the Grave, Omen of Death will all be affected by the rotation).\n\nCost - None\nDamage per hit - 75/125/175 (+ 50% Bonus AD)\nTotal Damage on both hits - 150/250/350 (+100% Bonus AD)\nMinimum Damage Penalty - 5% (two enemy champions) - Damage - 142.5/237.5/332.5\nMaximum Damage Penalty - 20% (five enemy champions) - Damage - 120/200/280\nCooldown - 160/150/140\nRange Radius - 500\nSweeping Blade Maximum Cone Angle - 90*\nMax Movement Speed stacks - 10\n\nInfo:\n- Deals Attack Damage\n- Damage Penalty only counts the 'real' enemy champion. For example, if a Shaco alone is hit by Thundering Whirlwind along with his clone, the damage penalty will not proc as Shaco's clone does not count as a 'real' champion.\n- Morgana's Black Shield will negate the CC however as Thundering Whirlwind deals attack damage, the Black Shield will only benefit by eating the CC.\n- Will disrupt all enemy channelled abilities.\n\n____\n\nOP? I kinda think so...\nI wanted this guy to have limited options to escape via kiting with his Q however still able to engage deeply with his E.\nHis R counters the 'body block' idea where tanks can stand in front of their carries however with Kaze, he can literally turn fights around by repositioning anyone who gets caught in his ultimate.\nHis ultimate has a somewhat big range so I added a damage penalty idea and a somewhat long cool down.\nI intend for him to be a top laner as he has some harass in lane but with long CDs early game his harass is also limited. He has no easy-to-land hard CC other than knocking back someone, along with his E he can perform easy 'inSec' plays such as dashing through many minions with E and eventually slowing target champion with W and then knocking them back for an easy gank for your jungler.\nI also intend for him to be a top laner because his damage to monsters are somewhat not efficient compared to lane minions and enemy champions.\n\nSo whaddya guys think?","replies":[{"poster":"KingDinger","date":"2015-02-01T00:57:28.235+0000","up_votes":1,"down_votes":0,"body":"cool concept. max E dashes without using other abilities = 14 but then you become completely useless for 20 seconds. so thats nice.\nQ energy return is a net loss of 20 at max rank, so thats fine.\n40% CDR lategame and high AS (does Q count to the attacks/reset AAs?) can result in near 100% active W....NICE. it should be free to use like most other defensive abilities. or just cost less than 40.\nult lvl 16 should be 120 seconds.","replies":[{"poster":"Chalze","date":"2015-02-01T01:40:05.002+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=KingDinger,realm=OCE,application-id=hIjvqaz6,discussion-id=hAX9qRAg,comment-id=0002,timestamp=2015-02-01T00:57:28.235+0000)\n>\n> cool concept. max E dashes without using other abilities = 14 but then you become completely useless for 20 seconds. so thats nice.\n> Q energy return is a net loss of 20 at max rank, so thats fine.\n> 40% CDR lategame and high AS (does Q count to the attacks/reset AAs?) can result in near 100% active W....NICE. it should be free to use like most other defensive abilities. or just cost less than 40.\n> ult lvl 16 should be 120 seconds.\n\nThe E what huh? i don get it\nQ has nothing to do with W stacking\nYeah you need  aton of CDR if u wanna stay trying to spam W all of the time since 9 x 0.6 = 5.4 (k sht dat needs a nerf, probs changed it by the time u see this)\nult at lvl16 remains 140 cuz i mean his ult is %%%%%%edly op isn't it?","replies":[{"poster":"KingDinger","date":"2015-02-01T14:45:15.255+0000","up_votes":1,"down_votes":0,"body":"E is a dash....its cost is 50, 30, 10, 10 and all 10 from there. if you spam the E....you run out of energy (200 energy is max  for energy users) with 14 uses of E. then 20 seconds to regen it back.\n\nwith W. 40 energy cost = 5 Ws in a row before running out of energy too. well, 6 cos energy over time.\n\nthe question with Q was does it apply on hit effects, so stacking for W. or does it reset the attack timer/animation. also helping stack W.\n\nmost ults scale down to 120, even if they are stupidly strong.","replies":[{"poster":"Chalze","date":"2015-02-01T16:15:12.094+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=KingDinger,realm=OCE,application-id=hIjvqaz6,discussion-id=hAX9qRAg,comment-id=000200000000,timestamp=2015-02-01T14:45:15.255+0000)\n>\n> E is a dash....its cost is 50, 30, 10, 10 and all 10 from there. if you spam the E....you run out of energy (200 energy is max  for energy users) with 14 uses of E. then 20 seconds to regen it back.\n> \n> with W. 40 energy cost = 5 Ws in a row before running out of energy too. well, 6 cos energy over time.\n> \n> the question with Q was does it apply on hit effects, so stacking for W. or does it reset the attack timer/animation. also helping stack W.\n> \n> most ults scale down to 120, even if they are stupidly strong.\n\nE is a dash that is somewhat overpowered so you do have to be careful not to spam it, thats the point of making him run on Energy\n14 uses of E should be plenty anyway\nI just changed W's Energy cost so ya it costs more at early levels but lowers at higher levels\nQ doesn't apply on-hit effects, it's an ability and has nothing to do with an auto-attack\nWell, I'll keep an eye on his R cool down xDD","replies":[]}]}]}]},{"poster":"Chalze","date":"2015-01-31T07:47:14.848+0000","up_votes":1,"down_votes":0,"body":"Lore-wise this mofo was sent from the Leaders of Ionia to try capture Yasuo...hence Breaker of the Winds...","replies":[{"poster":"Sobriquet","date":"2015-01-31T09:19:06.597+0000","up_votes":1,"down_votes":0,"body":"Why don't you make it that they're are trying to catch {{champion:92}} instead? \n\nlike how {{champion:157}} finds out that it was her :O","replies":[{"poster":"Chalze","date":"2015-01-31T20:27:23.516+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=KMKaos,realm=OCE,application-id=hIjvqaz6,discussion-id=hAX9qRAg,comment-id=00000000,timestamp=2015-01-31T09:19:06.597+0000)\n>\n> Why don't you make it that they're are trying to catch {{champion:92}} instead? \n> \n> like how {{champion:157}} finds out that it was her :O\n\nRegardless, I don't think Ionians give a sht about Riven atm xDD","replies":[]}]}]},{"poster":"BarryButcher","date":"2015-01-31T08:07:03.708+0000","up_votes":1,"down_votes":0,"body":"Breaker of the winds... so he farts?","replies":[{"poster":"Chalze","date":"2015-01-31T08:11:30.342+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=BarryButcher,realm=OCE,application-id=hIjvqaz6,discussion-id=hAX9qRAg,comment-id=0001,timestamp=2015-01-31T08:07:03.708+0000)\n>\n> Breaker of the winds... so he farts?\n\nUhh yeah...dats how his Q works..and it makes him E dash faster >_>","replies":[]}]},{"poster":"Chalze","date":"2015-02-02T07:09:46.215+0000","up_votes":1,"down_votes":1,"body":"Sorry....bump??\n\nOr does it work on OCE boards??","replies":[]}]}