{"poster":"Chalze","date":"2014-12-03T19:33:51.593+0000","title":"Ideas for the League of Legends Merchandise Store","subforum":"Miscellaneous","embed":{"description":null,"url":"http://farm9.staticflickr.com/8008/7135215959_d4ce8f3d03.jpg","image":null},"up_votes":2,"down_votes":0,"body":"Hey guys, I contacted Riot Support for this and they suggested me to see how much 'attention' I would get from saying what I originally wanted to, but I decided to try start a thread of **what us players would like to see in the League of Legends Merchandise Store** which has been talked about on Surr@20.\nSo, the League of Legends Merchandise Store is quite self explanatory, a store of League of Legends Merchandise.\n\nSo, my original thought I handed to Riot Support was that Riot could try to 'make' Gunpla-like sets for the more mechanical themed skins such as:\nMecha Kha'Zix (or anything else in the Mecha Series)\nFull Metal Jayce (or anything else in the Full Metal Series)\nBattlecast Prime Cho'Gath (or anything else in the Battlecast Series)\n\nSo what is \"*Gunpla*\"?\nGunpla is basically the Japanese toy/model sets of Gundam robots from the anime *Gundam*. I honestly think having toy/model build-able sets like these in League of Legends would be absolutely amazing, since the models tend to be higher quality than just some immovable figurines which Riot are planning to sell anyway.\n\nAnyway, I've attached a few pictures of what 'Gunpla' is in the links section and I honestly reckon that the most high priority skin goes to Mecha Kha'Zix. Just imagine a Mecha Kha'Zix model/toy in the 'fashion' of the Gunpla sets. Amazing.\n\n\nI don't know how the heck to use links and attachments correctly but here are the other links I was supposed to add. Not sure why it just posts a huge link and I can't delete it but oh well.\nhttp://cdn.hobbylink.tv/wp-content/uploads/2010/11/img_5497.jpg?d78934\nhttp://otakurevolution.com/storyimgs/gunpla/HandPaintedMKII.jpg","replies":[{"poster":"GoldenTomat0","date":"2014-12-03T22:23:13.064+0000","up_votes":1,"down_votes":0,"body":"I'd be interested in buying them. also, the smaller ones are fairly cheap, only like $20 or something.","replies":[{"poster":"Chalze","date":"2014-12-04T06:25:49.490+0000","up_votes":1,"down_votes":0,"body":"> I'd be interested in buying them. also, the smaller ones are fairly cheap, only like $20 or something.\n\nI'd buy all of them if they were $30 each even\n\nAll of these should be on the line though\n-Mecha Kha'Zix\n-Mecha Malphite\n-Mecha Aatrox\n-Battlecast Vel'Koz\n-Battlecast Alpha Skarner\n-Battlecast Prime Cho'Gath\n-Battlecast Kog'Maw\n-Full Metal Jayce\n-Full Metal Rammus\n-Orianna (Classic, Bladecraft)\n-Blitzcrank (Classic, Rusty, Piltover Customs)\n-Mordekaiser (Classic, Dragon Knight, Infernal, Lord)\n-Nautilus (Classic, Abyssal, Subterranean)\n-Eternum Nocturne\n-Eternum Rek'Sai\n-Tristy (Rumble's Robot maybe with a small figurine of himself)\n-Full Machine Viktor\n\nI didn't say anything 'Xerath' because I thought the 'blue energy' frame wouldn't be that appealing :/\n\nList down who you think I may have missed!","replies":[{"poster":"P1 GTR","date":"2014-12-04T07:07:20.178+0000","up_votes":1,"down_votes":0,"body":"Blitzcrank could have a suction cup as a hand and a button you push to project the hand to grab something, like a bottle...","replies":[{"poster":"Chalze","date":"2014-12-04T20:00:54.135+0000","up_votes":1,"down_votes":0,"body":"> Blitzcrank could have a suction cup as a hand and a button you push to project the hand to grab something, like a bottle...\n\nMaybe have a spring which fires out his hand (with a ‘wire-like’ rope)?\nCould do.\n\nPlus, Mecha Kha’Zix could have add-ons for his stages of evolutions…but I’m out of ideas for if he evolves his ultimate :\\\n\nFull Metal Jayce’s hammer would be able to ‘shift’ into a cannon form, thats not too hard..\n\nAny other *mechanics*?","replies":[]}]}]}]},{"poster":"Chalze","date":"2014-12-03T19:40:48.161+0000","up_votes":1,"down_votes":0,"body":"Also, lets just ignore the costs of making/designing these for now.","replies":[]}]}