{"poster":"Lord Valotz","date":"2015-04-11T15:53:55.675+0000","title":"Diana vs Yasuo","subforum":"Campioni e gameplay","up_votes":1,"down_votes":0,"body":"Mi piace molto giocare Diana mid e mi sono trovato bene contro la maggior parte dei pick che mi sono trovato contro, l&#039;unico con cui faccio fatica &egrave; Yasuo, soprattutto trovo pi&ugrave; difficolt&agrave; a farmare contro di lui che contro dei personaggi ranged. Idee per non perdere? Contro di lui cerco di chiudere la clessidra come primo oggetto, ma il problema di fondo &egrave; che mi &quot;sfugge&quot; da tutte le parti in mezzo ai minion e mi poka di Q (non con il tornado, quello lo schivo), mentre io per rispondere adeguatamente esaurisco il mana con lo svantaggio che lui para parte dei miei danni con lo scudo di passiva. Che fare dunque per non ritrovarsi a fare misere figure?","replies":[{"poster":"CicciaBauBau","date":"2015-04-12T09:56:52.693+0000","up_votes":1,"down_votes":2,"body":"Gente che usa diana mid e si lamenta che perde...","replies":[{"poster":"Lord Valotz","date":"2015-04-12T11:22:25.169+0000","up_votes":2,"down_votes":0,"body":"In effetti usare un mid in mid è proprio follia ok.","replies":[]}]},{"poster":"xxG1G4xx","date":"2015-04-29T09:51:19.112+0000","up_votes":1,"down_votes":0,"body":"Ciao... Diana è il mio main champ e lo uso da un bel pò... L'unico champ che mi fà sudare è anche per me Yasuo... lo odio :D!!! Cmq ho notato che sfruttando la passiva di Diana con maggiore velocità di attacco... le cose vanno un pochino meglio anche se rimane cmq difficile. Ti consiglio di fiondarti su di lui con la passiva attiva... lo sfondi se non ha lo scudo :).\n\nNB: se nel mentre hai capito come affrontarlo fammi sapere ;)","replies":[{"poster":"Lord Valotz","date":"2015-04-29T10:03:11.113+0000","up_votes":1,"down_votes":0,"body":"L'unica soluzione che ho trovato è sperare che yasuo sia più scarso di meccaniche rispetto a me, se nei primi 6 livelli riesci a non perdere troppo farm e prenderle di santa ragione, fatto il 6 se gli hai tolto lo scudo o non è full vita con una combo Q R W AA potenziato (E per tenerlo lì) e nuovamente R, con l'ignite se hai paura che lui scappi dovresti ucciderlo, il problema sono i primi livelli in cui rischi di prenderti delle free Q sue addosso quando vai a farmare e grazie alla sua E riesce a stare abbastanza safe, inoltre lui pulendo velocemente i minion si espone si ai gank del jungler, ma ti rende più difficile farmare perché ti devi temporizzare con la torre.","replies":[{"poster":"xxG1G4xx","date":"2015-04-29T15:03:29.031+0000","up_votes":1,"down_votes":0,"body":"Maledetti colpi critici.... \nMa una Diana con colpi critici?!?! XD","replies":[{"poster":"Lord Valotz","date":"2015-04-29T16:37:02.281+0000","up_votes":1,"down_votes":0,"body":"Non credo sia una buona idea ;) forse spinata, raduin, mantello del sole e cuore ghiacciato però possono farsì che ti faccia il solletico...","replies":[]}]}]}]},{"poster":"iKharon","date":"2015-04-19T13:05:09.748+0000","up_votes":1,"down_votes":0,"body":"Concentrati sul farm fino al 6. Al 6 fai combo Q+R+W+R+Ignite. E ti assiucuro che è morto.","replies":[]},{"poster":"Giaino01","date":"2015-04-14T15:51:13.238+0000","up_votes":1,"down_votes":0,"body":"La pericolosità di yasuo è direttamente proporzionale alle abilità del suo giocatore. Uno che non sa usare w ed e con tempismo morirà di continuo. se non avesse la sua w diana lo ucciderebbe facilmente, ma avendola impedisce di poter usare la r due volte di fila su di lui. quello che puoi fare è aspettare che sia in cooldown la w di yasuo pokkando di q. Fatto questo aggrediscilo e costringilo a tornare in base se non puoi ucciderlo.","replies":[]},{"poster":"IST Dima123","date":"2015-04-12T09:17:48.897+0000","up_votes":1,"down_votes":0,"body":"dopo il 6 lo uccidi anche se yasuo ha una kill di vantaggio.","replies":[]},{"poster":"TheAwesomeJ","date":"2015-04-11T19:58:05.747+0000","up_votes":1,"down_votes":0,"body":"Un buon yasuo riesce a pokkarti sfruttando i minion, nell'early game non puoi fare molto , concentrati sul farm e non prenderle troppo.\nQuando tocchi il 6 hai gli strumenti necessari per affontarlo, ma è comunque un fattore di skill con un lieve vantaggio da parte di yasuo.\nNel late game diana con roa e zhonia ha gli strumenti necessari per affrontarlo alla pari.\nYasuo in questi casi è un tormento ma se riesci, con l'aiuto del jungler, a prenderti 1 o magari 2 kill nell'early game allora va tutto a tuo favore.","replies":[{"poster":"Lord Valotz","date":"2015-04-12T08:04:37.159+0000","up_votes":1,"down_votes":0,"body":"Come temevo, fino al 6 bisogna limitare i danni e sperare in un jungler di buon cuore che ganki.","replies":[]}]}]}