{"poster":"The Sloth Lord","date":"2019-05-09T22:29:16.389+0000","title":"Non riesco a giocare","subforum":"Aiuto e supporto","up_votes":1,"down_votes":0,"body":"Ho da poco comprato un nuovo computer che ha requisiti molto migliori di quello precedente ma si è subito presentato un problema che prima non riscontravo. Al momento del loading screen dopo la champ select il video smette di funzionare e compare la scritta \"nessun ingresso video\" ma questo solamente se tengo aperta la finestra della partita. Cambiando finestra il video torna tranquillamente a funzionare e anzi posso anche sentire l'audio della partita. Se qualcuno ha avuto problemi simili o conosce la soluzione al problema fatemi sapere grazie :D","replies":[{"poster":"Dodop","date":"2019-05-13T10:12:41.640+0000","up_votes":1,"down_votes":0,"body":"Ciao, probabilmente si tratta di un problema di risoluzione del monitor non compatibile con il gioco, manda un ticket al Supporto Riot spiegando loro il problema e specificando la risoluzione del tuo monitor.\n\nIntanto puoi giocare in \"Borderless\" (\"Senza bordi\") al posto di \"Schermo intero\". Se non riesci ad accedere in alcun modo alle impostazioni video del gioco segui questi passaggi:\n-Accedi alla cartella **Riot Games** dove è scaricato il gioco > **League of Legends** > **Config**\n-Tasto destro sul file **game.cfg**, Apri con > Blocco Note\n-Cerca e modifica la stringa **WindowMode=0** in **WindowMode=2**\n-Salva e chiudi\nAvvia una custom e prova a vedere se riesci a giocare.","replies":[]},{"poster":"AebelothAngel","date":"2019-05-10T13:55:58.172+0000","up_votes":1,"down_votes":3,"body":"se non riesci a giocare non giocare e basta, ci sono centinaia di giochi, scaricatene altri.","replies":[{"poster":"The Sloth Lord","date":"2019-05-10T17:06:23.251+0000","up_votes":1,"down_votes":0,"body":"sai com'è gioco a lol da 6 anni, mi piace ancora e ci ho speso anche parecchi soldi quindi se possibile non vorrei quittare così :I","replies":[{"poster":"AebelothAngel","date":"2019-05-10T17:11:37.646+0000","up_votes":1,"down_votes":0,"body":"no, non so com'è","replies":[]}]}]},{"poster":"Aurelion Shmoll","date":"2019-05-09T23:26:27.907+0000","up_votes":1,"down_votes":0,"body":"ctrl + enter una volta apparsa la schermata, probabilmente è la risoluzione del monitor, se è quello ti basta giocare in \"finestra senza bordi\". Se non è quello.\n\nNo Idea","replies":[]}]}