{"poster":"Selah","date":"2016-03-22T00:59:08.029+0000","title":"Matar a un AFK. Opiniones","subforum":"Charlas Generales","up_votes":3,"down_votes":2,"body":"Bueno, esta es una cuesti&oacute;n que me ha estado sucediendo durante este &uacute;ltimo tiempo al jugar partidas y es la de matar, o no, a un jugador que por razones desconocidas se queda AFK.\nDesde mi perspectiva, **considero que es deshonesto** conseguir ventaja a trav&eacute;s de alguien que tuvo una desconexi&oacute;n, ahora bien, no es algo que ocurra en la mayor&iacute;a de las personas que juegan en el server LAS; ya que me ha pasado de estar AFK por un tiempo, y cuando vuelvo, el enemigo intenta desesperadamente asesinarme para conseguir ventaja, ya que (supongo yo) considera que como estoy detr&aacute;s en la partida, debe aprovecharse de eso.\n\nEncima, una vez me ocurri&oacute;, que arranque la partida estando AFK, y cuando volv&iacute;, la Caitlyn enemiga intenta asesinarme, para lo cual yo escribo en el chat:\n\n- &quot;Claro, aprovechate del que estuvo afk, idiota.&quot;\nCaitlyn responde.\n- &quot;Veni que te tiro con flores.&quot;\n\nEn ese momento me di cuenta que la mayor&iacute;a de la comunidad LAS es deshonesta en ese sentido.\n\nAs&iacute; que, mi pregunta es: &iquest;Qu&eacute; opinas de este tema?\n\nMe gustar&iacute;a ver las opiniones de los jugadores, para ver como se trata este tema en general.\n\nSaludos!!\n\n\nNota: Cabe aclarar que este tipo de comportamientos son comprensibles cuando se juega una partida ranked.","replies":[{"poster":"Chimchi","date":"2016-03-22T01:02:20.652+0000","up_votes":7,"down_votes":2,"body":"kill es kill, y los lp se ganan a cualquier costo, como a ti te tocan afks, les tocan a ellos, a mi me parece de lo mas justo\nHablando en normales suelo no matarlos, porque a veces a mi tambien se me cae\n(negativos a mi)","replies":[]},{"poster":"Hell Darking","date":"2016-03-22T02:16:26.115+0000","up_votes":2,"down_votes":0,"body":"Llega un \"elo\" donde la gente juega con honor, ya me toco jugar varias partidas donde todos eramos super \"amigos\"\nun jugador entro despues a su linea porque andaba con lag y el oponente lo dejo farmear tranquilo hasta que estubieran igual o similar\ncuando juego con mis amigos y el enemigo tiene a alguien con lag (ese lag previo hasta que avisa que se a desconectado) bajo torre, nadie lo toca.. si lo matan los minions pues.. no se puede hacer nada.\ncuando llegas a ese nivel de juego, todo lo demas es full diversion y no andas flameando ni puteando a la gente","replies":[]},{"poster":"xXLawea777xx","date":"2016-03-22T01:48:49.315+0000","up_votes":1,"down_votes":0,"body":"Es lo mas normal, ami me pasa que aveces tengo algun problema y me conecto tarde a la partida, cuando vuelvo tengo que jugar con mucho cuidado por que te ulti, ignite, la e de ashe todo, o moris o tiras todo para escapar y a la proxima te matan","replies":[{"poster":"Selah","date":"2016-03-22T01:56:50.753+0000","up_votes":2,"down_votes":0,"body":"Aunque la E de Ashe no hace daño xD\n\nPero igual, en una ranked eso es comprensible, pero en una normal me parece un poco deshonesto.","replies":[{"poster":"Zoliza","date":"2016-03-22T02:58:02.858+0000","up_votes":1,"down_votes":0,"body":"Y donde importa es en ranked, que te importa si te matan afk en una normal. Se juega para ganar y no hay regla que aplique el no matar un afk, si se cae por problemas de conexion que no juegue , si se le tilda por que tiene mala pc que no juegue. Si juega aceptando las condiciones en las que juega no puede quejarse.","replies":[]}]}]},{"poster":"La corrupción","date":"2016-03-22T01:06:34.660+0000","up_votes":2,"down_votes":1,"body":"Yo si me doy cuenta de que esta afk, NUNCA lo haría en una normal, las normals son para mejorar, alguien malo feedeado parece bueno sin serlo, en una ranked si, lo siento mucho, pero también puede tocar en mi equipo y no creo que menos del 95% del  server lo deje vivo.","replies":[]},{"poster":"rokushoger","date":"2016-03-22T11:38:11.713+0000","up_votes":1,"down_votes":0,"body":"Bueno, para aclarar, esto pasa en todos los server, no solo acá.\n\nEsto es un juego competitivo, por lo tanto el objetivo es ganar, simple y sencillo. Si yo veo un afk del otro lado por supuesto que lo voy a ir a matar, porque yo no tengo la culpa que el tipo sea un tremendo hdp por dejar tirado a sus compañeros, o que tenga una falla técnica o lo que sea, mi objetivo es ganar y voy a hacer lo necesario para eso, siempre y cuando no rompa las reglas impuestas (es decir no flamear, no trolear, etc), porque desde hace 6 años que juego y nadie pero nadie se ha contenido de matar a un afk en mi team, así de sencillo.\n\nA pero pobre tipo, tiene un problema de desconexiones... y? entró a jugar, por lo tanto no le debe importar mucho jugar en desventaja, ni tampoco le importa dejar a sus copañeros tirados.\n\nObviamente, sea por la razón que sea que quedó afk, a menos que el team contrario me pida que no lo haga (una vez me tocó un team premade que avisó que el que se había ido afk es porque le avisaron que la mamá había muerto, si increíble), cuanto termina la partida lo reporto, pero nada me va a impedir tomar esa ventaja.","replies":[]},{"poster":"Nyanmaru","date":"2016-03-22T09:12:41.478+0000","up_votes":1,"down_votes":0,"body":"Es un juego, total esa kill no te asegura la victoria. Se ganan y se pierden partidas 4v5, y viceversa","replies":[]},{"poster":"Deeper","date":"2016-03-22T06:41:38.933+0000","up_votes":1,"down_votes":0,"body":"Por lo general no mato afk´s, me hace sentir culpable jaja. Pero si estoy en ranked no me importa nada.{{sticker:slayer-jinx-wink}}","replies":[]},{"poster":"FedecarboneroUY","date":"2016-03-22T06:22:43.085+0000","up_votes":1,"down_votes":0,"body":"eso es relativo, antes ni les pegaba, pero un dia estabamos jugando una partida (la cual estaba perdidisima, por la composicion nomas que teniamos) y yo jugaba contra un Shen, derepente en una veo que se queda quieto thankeandose mi oleada de minions y no lo mate o intente matar, sino que pregunte en el chat global si se le habia caido a Shen y nadie contesto, despues de farmearme la oleada caminaba hacia el rio a wardear y el Shen flasheo y me metio el taunt y vino el Bardo support que tenian y me mataron ... depende, hay gente que se aprovecha incluso de esas cosas, por eso te digo que a mi parecer lo juzgaria por la situacion nomas.","replies":[]},{"poster":"Augustaso7","date":"2016-03-22T05:58:56.515+0000","up_votes":1,"down_votes":0,"body":"Todo es muy relativo, el que diga que nunca mato a un AFK en una Normal probablemente no este siendo del todo sincero...\nPrimero: hay normales y normales... Estan en las que te cagas de risa y estan las que queres ganar a como de lugar por cualquier motivo.\nSegundo: no es lo mismo un AFK al que le sacas 5 niveles (al cual te da cosita matarlo) y esta el AFK que te tradea todo el rato en la linea y de pronto se queda AFK, a ese lo curtis al instante\nTercero: En las rankeds los matas por mas que le saques 14 niveles, que le vas a hacer, si jugas ranked es porque queres ganarla y ganarla significa matar a los rivales y tirar el nexo. Y en normales tmb se mata a los AFK y todos lo hicieron pero entran mas cosas en juego, la seriedad con la que te tomes esa partida, el estado del rival en cuestion, etc.\n\nNo creo que tenga que ver con ser deshonesto o no, de ultima se podria decir que no tenes codigos pero esto no es futbol y la grieta no es un potrero. En fin aveces los matas, aveces no, y no le veo lo malo a ninguna de las dos opciones. No es para enojarse nomas.\n\nSaludos!","replies":[]},{"poster":"Zhetik","date":"2016-03-22T05:35:33.841+0000","up_votes":1,"down_votes":0,"body":"Que yo tenga problemas de conectividad no es culpa del enemigo, no tiene por que compadecerse de mi. Sin mencionar que en ocaciones es utilizada como técnica de baiteo el irse AFK.\nEn normales no tengo problema en dejar que les vuelva la conexión a los afk","replies":[]},{"poster":"I Love KaiSa","date":"2016-03-22T04:03:46.579+0000","up_votes":1,"down_votes":0,"body":"En normales no lo hago salvo que solo este jugando por la victoria del dia. O cuando encuentro al flammer de turno quieto ahi y bueno... a muerto un enemigo.\n\nEn ranked si porque... es ranked.","replies":[]},{"poster":"Whitesse","date":"2016-03-22T02:53:53.925+0000","up_votes":1,"down_votes":0,"body":"Yo mato al AFK en ranked, porque nadie te tiene piedad en ranked, y aunque la tengan, no en todas las partidas. No sacrifico mi elo por un poco de honor de una persona que si yo fuera el AFK me mata rapido.","replies":[]},{"poster":"AlphaSeiya","date":"2016-03-22T02:45:53.813+0000","up_votes":1,"down_votes":0,"body":"Guat???\nBueno primero decime como sabes cuando alguien esta afk o no.\nyo me hago el afk algunas veces, en la linea claro. para baitear también sirve.\n\nSi en verdad estas AFk es tu problema, el problema de cada uno, es un juego en tiempo real, tenes los requisitos detallados en el cual se especifica la conexión recomendada, a veces cuando me toca uno ami se convierte en mi problema también y me la aguanto.\n\nNo te equivoques, no siempre el afk esta afk por una desconeccion o por el servidor... están en el feibu, terminando de ver un vídeo, en el baño, con manuela, etc, etc   \n\nal finalizar la partida gane o pierda, sea de mi equipo o no se gana el \"por abandono o inactividad\" como debe ser.","replies":[]},{"poster":"Tutancadead","date":"2016-03-22T02:31:10.283+0000","up_votes":1,"down_votes":0,"body":"bajo esa logica no tenes que matar al del team rival con mal score por que es un troll y etc etc.\n\nLo deshonesto seria después vultarte de eso.","replies":[]},{"poster":" Quicksand","date":"2016-03-22T02:24:09.224+0000","up_votes":1,"down_votes":0,"body":"En normal la verdad que no, y me quejo cuando alguien por yo estar al principio afk porque no carga la partida o algo intenta matarme desesperadamente, pero en ranked srry pero es cuestión de elo y ahí si no la dejo pasar...","replies":[]},{"poster":"Attomm","date":"2016-03-22T01:27:30.269+0000","up_votes":1,"down_votes":0,"body":"te comes el report por insultar jaja","replies":[{"poster":"Selah","date":"2016-03-22T01:30:36.022+0000","up_votes":1,"down_votes":1,"body":"En que momento insulté? Te aclaro que ese \"idiota\" es de algo que puse en el chat de una partida, no se lo estaba diciendo a nadie del foro.","replies":[{"poster":"Attomm","date":"2016-03-22T02:23:51.854+0000","up_votes":1,"down_votes":0,"body":"jajaja digo en la partida tonto {{sticker:zombie-nunu-bummed}}","replies":[]}]}]},{"poster":"AresC","date":"2016-03-22T02:22:00.718+0000","up_votes":1,"down_votes":0,"body":"Si veo que algún enemigo tiene problemas de conexión le armo la carpita a mi jungla y abusamos lo más que podamos... el objetivo es ganar, ¿no?","replies":[]},{"poster":"asdf1423","date":"2016-03-22T02:20:08.353+0000","up_votes":1,"down_votes":0,"body":"Creo que matar a un afk es deshonesto, como dice Huaiquipan, es ileal.\nhay gente y gente en las. Si me dicen o me dooy cuenta que el comportamiento es anormal, se mueve con retraso, lo quedo mirando un rato y lo dejo ser. Si veo que hace como que tiene lag, le tiro Q W E R flash e ignite. xD","replies":[]},{"poster":"Adheliøs","date":"2016-03-22T01:24:33.610+0000","up_votes":1,"down_votes":0,"body":"En una ranked si veo que alguien se quedo afk lo mato, pues hay que revisar bien la conexión y el estado de tu pc para pretender rankear, además ahi juego para ganar, ahora si es normal paso de él y sigo farmeando, pero lo que me ha pasado por hacer eso es que vino el jungla me empezo a pegar y el tipo se reconecto se ve  y me matan entre los dos xD, una vez me paso esto y otra parecido pero me hice un doble :P","replies":[{"poster":"Selah","date":"2016-03-22T01:25:58.648+0000","up_votes":1,"down_votes":1,"body":"Si, olvidé poner que en ranked ese comportamiento es entendible, hasta yo mismo lo hago en ranked.","replies":[]}]},{"poster":"Kyousuke","date":"2016-03-22T01:23:38.587+0000","up_votes":1,"down_votes":0,"body":"yo tengo una regla simple, en raked se tryhardea para ganar y punto se va afk? es su culpa no la tuya, tiene lag? pues que se joda por rankear, no esta tu rival? pushea linea y baja para hacer una doble. las rankeds estan para ganarlas sin importar nada, en normales es otra cosa si se cae bueno se cayo deja la linea normal y espera a que venga, me paso de que mate a gente afk por accidente (hace 2 segundos estaba farmeando y cuando gankeo se cae ¬¬)","replies":[]},{"poster":"Excorpion","date":"2016-03-22T01:20:54.784+0000","up_votes":1,"down_votes":0,"body":"Hay momentos y momentos... pero todo es parte del juego...\nSI estas en medio de la pelea y el enemigo lagea... no puedes sentirte mal porque perdió la batalla..\nO cuando te lo encuentras de sorpresa y lo atacas de inmediato... \npero si la batalla es muy extendida... y alcanzas a notar que esta afk...\nes bueno esperarlo... o al menos si esta critico... matarlo cuando vuelva...\n\nSea como sea... Los problemas de conexiones son mayormente por problemas de usuario... \nPorque no controlan sus procesos... o simplemente tienen mal proveedor de servicios...","replies":[]},{"poster":"Yrox the Third","date":"2016-03-22T01:00:58.606+0000","up_votes":1,"down_votes":0,"body":"Yo opino que si alguien se desconecta muchas veces y claramente tiene problemas de conexion yo tryhardeo a full, porque asi el otro equipo \"sufre\" menos.","replies":[]},{"poster":"LyghtSh","date":"2016-03-22T01:17:36.555+0000","up_votes":1,"down_votes":1,"body":"Uhhh yo se mucho del tema, me a pasado  MUCHISIMAS VECES, algunos foreros que vean este comentario y hayan jugado conmigo lo sabran :v\n\nLa gran mayoria son MUY deshonesta, realmente, ya sea normal, personalizada o ranked, quieren matar al AFK, AUNQUE ESO LES CUESTE LA MUERTE.\n\nSe mueren por una kill sencilla o medianamente sencilla, solo por queres fedearse o ganar la partida.\n\nMe a pasado volver de AFK con {{champion:121}}  y que venga el {{champion:56}}  enemigo a querer matarme, y yo ya teniendo level 6, pero es que acaso son tontitos?\nLo re mate, limpie el piso con el y despues ganamos al 20.\n\n\nBueno, solo 1 vez me encontre a alguien a quien le dije \"Che me dejas farmear plz?\" y me respondio \"Np\", su jungla nunca vino, no pushie, y farmeamos re tranquilos.\n El problema es cuando a uno se le cae la conexiona mitad de la linea, algunos no entienden que estas afk, dicen \"Ah perdon no me di cuenta\" y yo ahi pienso \"Pero genio ni me movi ni tire flash, te pensas que te estoy regalando la kill por que si?\", algunos si dan cuenta y pasan de vos,  y siguen farmeando.\n\n\nY a algunos... para ponerlos a prueba... ( A lo {{champion:420}} ) me quedo quieto, espero a que vengan, se confien Y BOOOM los mato, por querer matar al pobre afk ¬¬","replies":[]},{"poster":"nanaya KiRi","date":"2016-03-22T01:05:15.840+0000","up_votes":2,"down_votes":2,"body":"No me voy a ablandar por que alguien no estaba en la partida que se supone que tiene que estar el 100% del tiempo, no me importa la excusa.\nYo se que me lo merezco cuando me hacen eso y de la misma forma yo se los hago a ellos.","replies":[]}]}