{"poster":"MomoLegends","date":"2015-11-30T00:11:21.727+0000","title":"RIOT!!!! Someone went on my accuont and got me banned!!!!!","subforum":"Help & Support (OCE)","up_votes":1,"down_votes":0,"body":"So I&#039;ve never been negative before, even have a friendly banner and is always supportive of my team then someone went on my account and got me a 12-14 days ban!!! I recently changede my password and I dont know how a guy still comes on my account but Riot can even look at my recent matches (I only play ranked) I&#039;ve always been nice to my team. IGN Momolegends Server: OCEPlease check my match history in ranked etc or the games previously because I&#039;ve never been toxic!!!!","replies":[{"poster":"Wuks","date":"2015-11-30T06:11:40.872+0000","up_votes":1,"down_votes":0,"body":"Hey MomoLegends,\n\nBecause this is an account-specific inquiry, we can’t help you out here on the Boards. As such, you’ll want to direct this to Riot Games Player Support by [**submitting a ticket**](https://support.riotgames.com/hc/en-us)! As you submit your request, here are some tips that will help resolve this issue as quickly as possible: \n\n1. Create an account on the Riot Games Support website. It'll save you a lot of time in the future and keep your requests organized and easier to find/access. \n2. Be sure to submit as much information in your initial ticket as possible. For obvious reasons, each Player Support Specialist's request for more information will delay the resolution of the issue.\n3. Be respectful and polite in your correspondences with Riot Support. (They're doing their best to help you!)\n4. Try not create a new ticket or respond to an existing ticket before a Player Support Specialist has had the chance to review your request. New tickets/replies may bump your ticket back to the bottom of the queue, thus increasing the amount of time before a Player Support Specialist is able to review your ticket.  \n\n**If you're unsure where to put your ticket in, just select:**\n[*I have a question about League of Legends/Riot Games.*] > [*Game and Features*] > [*General Questions*]\n\nWith that being said, good luck!","replies":[]},{"poster":"MomoLegends","date":"2015-11-30T00:13:53.783+0000","up_votes":1,"down_votes":0,"body":"Game 1\nMomoLegends: Hello my name is Amos Lou\nMomoLegends: Nasus watch out for Riven\nMomoLegends: Riven will fuck yoi\nMomoLegends: u\nMomoLegends: ty\nMomoLegends: This Cassiopia has about as much map awareness as a down syndrome Dora the explorer\nMomoLegends: Riven fed gg\nMomoLegends: Blitz stop\nMomoLegends: Its Cass's fault\nMomoLegends: She has no map awareness\nMomoLegends: Darius please just sit under tower\nMomoLegends: Blitz u suck stfu u %%%%\nMomoLegends: ggwp\nMomoLegends: Darius signals to go in\nMomoLegends: Sits at tower\nMomoLegends: Ok bro :)\nMomoLegends: Im not ganking u anymore js\nMomoLegends: Pointless\nMomoLegends: Nasus AFK farming\nMomoLegends: ?\nMomoLegends: yeah because u never help\nMomoLegends: ggwp\nMomoLegends: Thats nice\nMomoLegends: Riven isnt even that good she is just fed\nMomoLegends: Blitz stfu ur the one getting reported\nMomoLegends: Not that hard\nMomoLegends: Nice Darius\nMomoLegends: Nasus keen to AFK farm more or help team?\nMomoLegends: Blitz ur good :^)\nMomoLegends: LOL\nMomoLegends: This is so ggwp\nMomoLegends: Blitz hear me out\nMomoLegends: Ashe is premade with me\nMomoLegends: So no reports\nMomoLegends: Darius\nMomoLegends: Is not going to report\nMomoLegends: I am not going to report\nMomoLegends: And most likely Cass will not either\nMomoLegends: So stfu\nMomoLegends: And play the game\nMomoLegends: Or we will report u\nMomoLegends: ggwp\nMomoLegends: HAHAHAHAHA\nMomoLegends: lol this Riven thinks shes god\nMomoLegends: How>\nMomoLegends: How?\nMomoLegends: Riven is so ez\nMomoLegends: Got fed because no map awareness CAss\nMomoLegends: Riven is 100x easier than Singed\nMomoLegends: 1v1 Riven?\nMomoLegends: After this game\nMomoLegends: Riven vs Riven?\nMomoLegends: I have 90k aswell\nMomoLegends: I didnt /ff u pleb\nMomoLegends: Cool :)\nMomoLegends: LOL\nMomoLegends: We cant win\nMomoLegends: idk wtf u guys are thinking\nMomoLegends: Blitz stfu\nMomoLegends: Have fun with like 100 bans\nMomoLegends: ez win plz /ff\nMomoLegends: LOL\nMomoLegends: gg please surrender we have already won \nI just copy the text and this is what the guy say no me!!!","replies":[]}]}