{"poster":"TwistedDisco","date":"2015-08-06T01:01:57.890+0000","title":"Automated Low Prio Que","subforum":"Help & Support (OCE)","up_votes":1,"down_votes":0,"body":"Hey i keep getting put in the low prio que because of bugs. I am using a Mac version of the client and i understand that its in beta but it has been out for some time now. Today in the champ select the new Hud came up and i noticed the ward skin Icon.\r\n\r\nI clicked on it and the game sent off a bug report but the report crashed and caused me to time out so i couldent select any champs or click anything. Just a loading bar in the middle of the screen.\r\n\r\nSince i exit the champ select without choosing a champ (because of the bug) i got put in a low prio Que. 10 Mins later i got onto the champ select again and MISS CLICKED THE SAME BUTTON since it was next to the summoner spells. The same thing happend so i closed down the client and re opened it. But because i &quot;dodged the ranked que&quot; i got put into another low prio que for 20 mins.\r\n\r\nI understand why the low prio Que is there but why does an automated system not take into account the condition of the client to search for reasons WHY it was closed down and re opened. This is a fix that i feel should be very much considered to avoid un reasonable punishments.","replies":[{"poster":"TwistedDisco","date":"2015-08-09T16:34:05.150+0000","up_votes":1,"down_votes":0,"body":"yeah i know right? but the thing is sometimes when i crash i get a bugsplat report thingy. So there must be a system where they are looking at the condition of the client on shut down. I have to wait 20 mins before going into a ranked game each time this happens. I VERY rarely dodge. 90% of the time it is crashes. \n\nThe most painful one is when in the loading screen it says im 100%. The game secretly crashes and i have to guess wether i relog or just keep watching it do nothing and load up. I feel there needs to be a loading bar or a spinning circle in the loading screen in order to know wether its just laggy people or my game has crashed (mid loading screen)","replies":[{"poster":"TwistedDisco","date":"2015-08-09T16:35:43.286+0000","up_votes":1,"down_votes":0,"body":"Hell, why not a chat option during the loading screen? so you can talk strat and possible invades during the long loading times.","replies":[]}]},{"poster":"Oman2","date":"2015-08-06T04:03:07.705+0000","up_votes":1,"down_votes":0,"body":"This hasn't happened to me exactly, but I've been very wary of my game crashing at any point in the queue or even worse, in game. So far as I know there is nothing that determines the reason you \"dodged\" the queue, and if my game crashes for something like this I normally leave it be for a while, I don't want to suffer for being a \"dodger\". A 6min wait time is bad enough for re-joining the queue for a normal game.\n\nEven if you do take precautions, there needs to be something like this that can actually distinguish between a crash and an intentional dodge. It may be hard to tell if your client locks up as you described instead of a CTD, but there has to be a better way.","replies":[]}]}