{"poster":"Seeyaaa","date":"2015-12-10T14:54:47.572+0000","title":"Freundesliste/Notification wild am blinken und funktioniert nicht?!","subforum":"Hilfe & Support","up_votes":1,"down_votes":0,"body":"Ich logge mich ganz normal in den client ein und unten rechts sind die Felder f&uuml;r die Freundesliste und die Notifications wild am blinken und nicht anklickbar. Es wechselt die ganze Zeit zwischen dem normalen Blau (wie es normalerweise ist) und Grau beziehungsweise einfach die Client Hintergrundfarbe. Die Notification-Bar ist die ganze Zeit am wechseln zwischen dem normalen Blau und Orange.\r\nAuch das Chat-Feld funktioniert nicht. Man kann es zwar anklicken aber nichts reinschreiben oder einf&uuml;gen.\r\nDa ich nirgends etwas zu diesem Problem gefunden habe wollte ich nur sehen ob ich der einzige mit dem problem bin oder ob es anderen auch so geht?\r\nIst &uuml;brigens direkt nach dem installieren von patch 5.24 das erste mal aufgetreten und seit dem jedes mal so.\r\nJemand ein Rezept um das zu reparieren?\r\n{{sticker:zombie-brand-mindblown}}","replies":[{"poster":"legofreak1","date":"2015-12-10T15:11:28.374+0000","up_votes":2,"down_votes":0,"body":"Deaktiviere bitte den IP-Hilfsdienst: Win + R:\"services.msc\" -> IP-Hilfsdienst beenden und deaktivieren.","replies":[{"poster":"Seeyaaa","date":"2015-12-10T16:20:39.880+0000","up_votes":1,"down_votes":0,"body":"Der IP-Hilfsdienst war von anfang an deaktiviert wie es scheint{{champion:53}} \nHab ihn trotzdem mal gestartet und wieder deaktiviert und den client neu gestartet doch das problem ist trotzdem noch da.{{summoner:11}}","replies":[{"poster":"legofreak1","date":"2015-12-10T16:24:08.054+0000","up_votes":2,"down_votes":0,"body":"Kannst du dann bitte dein IPv6 deaktivieren?\nhttps://support.microsoft.com/de-de/kb/929852\nWenn das nicht hilft, kannst du bitte [Netalyzr](http://n2.netalyzr.icsi.berkeley.edu/) drüberlaufen lassen und den Link zum Ergebnis hier posten?","replies":[{"poster":"Seeyaaa","date":"2015-12-12T14:35:00.036+0000","up_votes":1,"down_votes":0,"body":"Danke entweder das deaktivieren oder der fix von riot selber hat es repariert ^^","replies":[]}]}]}]}]}