{"poster":"Keìron","date":"2016-04-12T18:30:52.130+0000","title":"Ci vuole troppo tempo per salire","subforum":"Campioni e gameplay","up_votes":3,"down_votes":4,"body":"quest&#039;anno, partendo dal bronzo V, ho cominciato a fare ranked, ma solo nelle ultime due settimane mi sono impegnato seriamente facendo due o tre partite al giorno. Oggi in particolare, che avevo il pomeriggio libero, partendo da bronzo II  49 LP,  con cinque partite vinte ed una persa sono riuscito ad arrivare in bronzo uno 0 LP. Solo mezza lega! So che forse dal Platino in su una sola lega pu&ograve; fare la differenza, ma di questo passo, anche se faccio due partite al giorno ogni giorno, e le vinco tutte e due (cosa improbabile), impiegherei qualcosa come 5 settimane per arrivare in gold (non &egrave; detto che mi meriti il gold). Poi tenendo conto che una partita su 3 la perdo, finirei la voglia di giocare prima di arrivarci. Per me bisognerebbe mettere tre leghe in argento ed in bronzo, cos&igrave; da rendere meno tediosa l&#039;ascesa per chi sta salendo.","replies":[{"poster":"NIGERUNDAYO JoJo","date":"2016-04-12T18:46:25.179+0000","up_votes":2,"down_votes":1,"body":"Post del tipo #seseifortesali in arrivo tra 3..2..1..\n\nSinceramente, penso che se anche il bronzo e il silver hanno 5 divisioni, sia per un fatto di uguaglianza come giusto che sia..\nAnche se sono tra le leghe più basse, perchè dovrebbero avere meno divisioni?","replies":[{"poster":"Keìron","date":"2016-04-12T18:58:50.750+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=N A M B,realm=EUW,application-id=cAOZwaUi,discussion-id=KMh4RXuf,comment-id=0000,timestamp=2016-04-12T18:46:25.179+0000)\n>\n> Post del tipo #seseifortesali in arrivo tra 3..2..1..\n> \n> Sinceramente, penso che se anche il bronzo e il silver hanno 5 divisioni, sia per un fatto di uguaglianza come giusto che sia..\n> Anche se sono tra le leghe più basse, perchè dovrebbero avere meno divisioni?\n\ncosa c'entra in questo post \"se sei forte sali\"? E perchè pensi che 5 leghe in argento ed in bronzo vadano bene?","replies":[{"poster":"Detective Meow","date":"2016-04-13T11:09:58.017+0000","up_votes":2,"down_votes":0,"body":"Infatti in bronzo e silver ne servirebbero minimo 20 di divisioni per una maggior accuratezza delle skill del singolo e per una migliore scrematura di chi vuole davvero impegnarsi e salire o chi semplicemente rimanere in quel limbo immobile a lamentarsi soltanto del proprio team.","replies":[]},{"poster":"NIGERUNDAYO JoJo","date":"2016-04-13T11:17:06.844+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Keìron,realm=EUW,application-id=cAOZwaUi,discussion-id=KMh4RXuf,comment-id=00000000,timestamp=2016-04-12T18:58:50.750+0000)\n>\n> cosa c&#x27;entra in questo post &quot;se sei forte sali&quot;? E perchè pensi che 5 leghe in argento ed in bronzo vadano bene?\n\nIl \"se sei forte sali\" lo dicono tutti, a maggior ragione se vedono che qualcuno si lamenta perché non riesce a uscire dal bronzo/silver^\nPerché 5 leghe in bronzo e silver vanno bene? Allora ti chiedo : perché dovrebbero avere meno leghe? Solo perché buona parte dei giocatori più scarsi sono raccolti li ?\nLa salita è uguale per tutti, vi sono 5 leghe per divisione proprio per evitare distinzioni! \nCon la pratica la salita diventa più facile, e te ne accorgerai..\nIo sono partito come silver3 nella quarta stagione, poi non ho giocato più classificate perché non pensavo di meritarmi quel posto.\nNella season 5 sono partito da bronzo 5 e sono arrivato a silver 3 di nuovo (le prime 300 partite sono rimasto in bronzo, poi ho cominciato a capire il meccanismo e con sole 10 partite sono uscito dal bronzo).. Questa season mi hanno piazzato in bronzo 3, e ora sono di nuovo silver 3 (con 179 win e 175 lose)..direi che il miglioramento c'è stato! ( visto che per uscire dal bronzo la scorsa season ho impiegato almeno 300 partite, e in questa season me ne sono bastate 30)","replies":[{"poster":"Dr LouD","date":"2016-04-13T13:39:04.024+0000","up_votes":1,"down_votes":0,"body":"Comunque sono 5 divisioni per ogni lega, giusto per non creare confusione :)","replies":[{"poster":"Floppyz","date":"2016-04-13T13:42:35.318+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ILouD,realm=EUW,application-id=cAOZwaUi,discussion-id=KMh4RXuf,comment-id=0000000000010000,timestamp=2016-04-13T13:39:04.024+0000)\n>\n> Comunque sono 5 divisioni per ogni lega, giusto per non creare confusione :)\n\nAd esser precisi si tratta di 5 _divisioni_ per ogni _livello_. La _lega_ è un'istanza della divisione.\n\nPer chi ha il client in inglese, 5 _division_ per ogni _tier_.","replies":[{"poster":"Dr LouD","date":"2016-04-13T13:48:13.229+0000","up_votes":1,"down_votes":0,"body":"Dalla pagina ufficiale sulle ranked italiana:\n\"Ogni lega è divisa in 5 divisioni\"","replies":[{"poster":"Floppyz","date":"2016-04-13T13:52:02.059+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ILouD,realm=EUW,application-id=cAOZwaUi,discussion-id=KMh4RXuf,comment-id=000000000001000000000000,timestamp=2016-04-13T13:48:13.229+0000)\n>\n> Dalla pagina ufficiale sulle ranked italiana:\n> &quot;Ogni lega è divisa in 5 divisioni&quot;\n\nSì, ma qui, se ho ben capito si parlava delle 5 division dei tier, cioè provo a spiegarmi meglio:\n\nse sei nel _tier_ bronze, _division _ I nella lega _I compari di iloud_ e vieni promosso, finirai nel _tier _ silver, _division _ V di una _lega _ qualsiasi, ma sia questa lega che quella dove ti trovavi prima, abbraccia le **cinque division del tier** in questione.\n\nÈ più chiaro?\n\nEDIT: Per farla breve, bronze, silver, gold etc. sono tier/livelli non leghe.\n\nLe leghe sono _Gli Yordle di Ciack_, o _I compari di iloud_.","replies":[{"poster":"Dr LouD","date":"2016-04-13T13:53:55.113+0000","up_votes":1,"down_votes":0,"body":"Ma qui stiamo discutendo dei termini in italiano","replies":[{"poster":"Floppyz","date":"2016-04-13T13:56:15.558+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ILouD,realm=EUW,application-id=cAOZwaUi,discussion-id=KMh4RXuf,comment-id=00000000000100000000000000000000,timestamp=2016-04-13T13:53:55.113+0000)\n>\n> Ma qui stiamo discutendo dei termini in italiano\n\nMa il discorso è lo stesso, ti riporto il mio edit usando solo i termini italiani:\n\n> EDIT: Per farla breve, bronzo, argento, oro ecc. sono **livelli** non leghe.\n\n> Le leghe sono _Gli Yordle di Ciack_, o _I compari di iloud_.","replies":[{"poster":"Dr LouD","date":"2016-04-13T14:07:04.236+0000","up_votes":1,"down_votes":0,"body":"In realtà è un pò un casino per la parte italiana, dato che anche nelle FAQ ufficiali quando si parla di LEGA si fa riferimento a Bronzo, Argento, Oro.. ma poi se si parla di Nomi delle Leghe (i compari di ILouD ecc), i vari Bronzo, Argento, ecc vengono chiamati Livelli e non più Leghe.\n\nUn pò confusionario :S\n\nResto fedele al client inglese :3","replies":[{"poster":"Floppyz","date":"2016-04-13T14:11:10.913+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=ILouD,realm=EUW,application-id=cAOZwaUi,discussion-id=KMh4RXuf,comment-id=0000000000010000000000000000000000000000,timestamp=2016-04-13T14:07:04.236+0000)\n>\n> In realtà è un pò un casino per la parte italiana, dato che anche nelle FAQ ufficiali quando si parla di LEGA si fa riferimento a Bronzo, Argento, Oro.. ma poi se si parla di Nomi delle Leghe (i compari di ILouD ecc), i vari Bronzo, Argento, ecc vengono chiamati Livelli e non più Leghe.\n> \n> Un pò confusionario :S\n> \n> Resto fedele al client inglese :3\n\nAh... allora hanno fatto casino, il client inglese dovrebbe comunque definire quei termini come ti indicavo, usando la parola tier (che in effetti è traducibile in livelli) per gli stemmini colorati, e league per i tuoi compari. :P\n\nAnche per questo di solito uso i termini inglesi.","replies":[]}]}]}]}]}]}]}]}]}]}]},{"poster":"tano1","date":"2016-04-12T21:33:45.847+0000","up_votes":1,"down_votes":0,"body":"Il se sei forte sali é vero però io é da questa season che sono bloccato tra il bronzo v e il bronzo ||| perché faccio una serie negativa di 5 partite per esempio come ho fatto oggi che sono finito da bronzo 3 a 19 a bronzo 4 a 37 punti probabilmente sarà perché non sono  abbastanza bravo io però almeno in 3 partite su 5 avevo dei compagni di squadra che andavano 1 contro 5 cose che si dice si vedono solo in bronzo  però....","replies":[{"poster":"Keìron","date":"2016-04-13T10:52:04.009+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=tano1,realm=EUW,application-id=cAOZwaUi,discussion-id=KMh4RXuf,comment-id=0004,timestamp=2016-04-12T21:33:45.847+0000)\n>\n> Il se sei forte sali é vero però io é da questa season che sono bloccato tra il bronzo v e il bronzo ||| perché faccio una serie negativa di 5 partite per esempio come ho fatto oggi che sono finito da bronzo 3 a 19 a bronzo 4 a 37 punti probabilmente sarà perché non sono  abbastanza bravo io però almeno in 3 partite su 5 avevo dei compagni di squadra che andavano 1 contro 5 cose che si dice si vedono solo in bronzo  però....\n\nil problema è che io non ho queste serie di sconfitte, 2 partite su 3 le vinco e sto salendo, ma comunque il tempo che ci metto è esagerato!","replies":[{"poster":"Detective Meow","date":"2016-04-13T11:07:41.382+0000","up_votes":2,"down_votes":1,"body":"\"Se sei forte sali\" in bassa lega significa meno di zero, sei tu, da solo, contro 5 se Dio vuole, altrimenti 9, il tuo team non è determinato a vincere, flamma, va afk, perde obbiettivi a caso, non sa cosa sia la visione ma si lamentano quando manca. Non giocate support passivi, che il tuo adc bronzo se gli refulli la vita in lane non sa cosa farne, giocate tank, giocate personaggi grossi che assorbono danni e ti permettono di commettere errori senza rimetterci la partita, giocate semplice e vincete semplice.","replies":[{"poster":"Dr LouD","date":"2016-04-13T13:40:57.457+0000","up_votes":1,"down_votes":0,"body":"Lo sai che il discorso \"sono solo contro 5\" possono tranquillamente farlo TUTTI i giocatori di una partita?\n\nPerchè mai tu sei da solo a giocare contro 5?? Nell'altro team non ci sono giocatori della tua stessa lega? \nOgni persona che si lamenta non si rende conto che nel team avversario e nel proprio ci sono esattamente gli stessi giocatori che hanno lo stesso mmr, quindi sono tutti scarsi uguale","replies":[]},{"poster":"sboboo","date":"2016-04-13T12:55:16.773+0000","up_votes":1,"down_votes":1,"body":"Hey, il fattore comune di tutte quelle \"serie di sconfitte\" sei tu, quindi basta piangere sui tuoi compagni che sono identici a quelli avversari :)","replies":[{"poster":"Detective Meow","date":"2016-04-13T12:57:59.706+0000","up_votes":1,"down_votes":0,"body":"Appoggerei la tua affermazione, se partita dopo partita giocassi con e contro le stesse identiche persone, ma così non è.","replies":[]}]}]}]}]},{"poster":"Detective Meow","date":"2016-04-13T11:02:39.790+0000","up_votes":1,"down_votes":0,"body":"Ascolta a mamma Karma che ti dice: figlio mio stattene in bronzo che in silver giocano pure peggio. Almeno ti fai 4 risate per quanto fanno ride.\nIl problema è che si sono riversati nella silver league tutti, ma proprio tutti, persone che stanno li a fare 0/18 a rovinare le partite a chi cerca di salire, persone senza un minimo di conoscenza di gioco, che fanno errori stupidi e continuano a fare gli stessi errori per 50 minuti di gioco per poi lamentarsi che non c'è visione (vedi wiki su trinkets gratis a inizio partita e upgradabili).\nSupport che fanno back in full hp e full mana lasciando l'adc da solo con la wave nemica sotto torre + adc + supp nemici a tirargli schiaffi per poi sentire il support che ti flamma \"go back idiot\", non so, famo open bot e famo prima.\nE soprattutto quando vedi uno yasuo in bronzo/silver SCAPPA, perchè quello Yasuo, si, proprio il tuo, farà 1/9 al minuto 13, mentre quello nemico sarà 8/1/10 240cs al min 10, avrà farmato la mid, pushato fino alla torre inhib, pulito lane nemica, propria, gankato bot 40 volte mentre simultaneamente tirava tornadi in top oneshottando il vostro TANK.\nStessa cosa quando poppa fuori un Aurelion jungle, per l'amor di Dio se avete del rispetto per questo gioco, smettetela di giocare champs difficili in bassa lega, giocate personaggi easy, con decente utilità per aumentare la qualità delle plays.\nFate un Amumu jungle, un Ashe adc, un nasus top, cho gath dove vi pare.\nGiocate semplice, vincete semplice, eliminate le possibilità di errore all'osso, siamo in ranked, non in normal, e non c'è nulla di normal in questa community.","replies":[]},{"poster":"Boldstriker","date":"2016-04-12T23:15:15.472+0000","up_votes":1,"down_votes":0,"body":"Suppongo che sia solo per una questione di omogeneità tra le divisioni (perché allora farne 5 per l'oro e il platino?).","replies":[]},{"poster":"Ste the ripper","date":"2016-04-12T21:52:08.887+0000","up_votes":1,"down_votes":0,"body":"Su questo mi trovi d'accordo, io ero g5 a fine s5, sono stato piazzato s5, per tornare g5 ci ho messo 60 partite... decisamente tante.","replies":[]},{"poster":"GreenArroww","date":"2016-04-12T21:01:52.268+0000","up_votes":1,"down_votes":0,"body":"No in platino una divisione dall'altra in genere non fa molta differenza, io sono sceso e risalito da platino 2 a 5 e di nuovo 2 in due settimane","replies":[]},{"poster":"Nabbomaster","date":"2016-04-12T19:06:11.651+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Keìron,realm=EUW,application-id=cAOZwaUi,discussion-id=KMh4RXuf,comment-id=,timestamp=2016-04-12T18:30:52.130+0000)\n>\n> quest&amp;#039;anno, partendo dal bronzo V, ho cominciato a fare ranked, ma solo nelle ultime due settimane mi sono impegnato seriamente facendo due o tre partite al giorno. Oggi in particolare, che avevo il pomeriggio libero, partendo da bronzo II  49 LP,  con cinque partite vinte ed una persa sono riuscito ad arrivare in bronzo uno 0 LP. Solo mezza lega! So che forse dal Platino in su una sola lega pu&amp;ograve; fare la differenza, ma di questo passo, anche se faccio due partite al giorno ogni giorno, e le vinco tutte e due (cosa improbabile), impiegherei qualcosa come 5 settimane per arrivare in gold (non &amp;egrave; detto che mi meriti il gold). Poi tenendo conto che una partita su 3 la perdo, finirei la voglia di giocare prima di arrivarci. Per me bisognerebbe mettere tre leghe in argento ed in bronzo, cos&amp;igrave; da rendere meno tediosa l&amp;#039;ascesa per chi sta salendo.\n\ncioe' ti lamenti di metterci 5 settimane? hai tipo 6 mesi prima che finisca la season\nadesso ti danno pure le vittorie bonus se perdi le promo\nse non sali vuol dire solo che sei scarso","replies":[]},{"poster":"DuckQuack0","date":"2016-04-12T18:56:30.848+0000","up_votes":1,"down_votes":0,"body":"No, non ci vuole troppo tempo, serve la fortuna\nDa bronzo 2 a gold 3 (quasi 2), quest'anno hanno piazzato tutti un po' più giù, ma penso che al plat ci arrivo, ma non piu di plat 5 xD\nFortuna is de key mei friend, shish","replies":[]}]}