{"poster":"Hugín","date":"2017-06-09T20:56:40.087+0000","title":"Support Main sucht \"seinen\" Adc","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hall&ouml;chen liebe League of Legends Mitleidende,\n\n\nWer kennt es auch : \nMan geht in ein Raked und irgendwie sind gef&uuml;hlt 80% der Leute in der Botlane Premades? Und man kann sagen was man will, schon alleine das man 2 Premades haben kann, bringt schon einen gro&szlig;en Vorteil. Besonders wenn es Adc und Support sind. Unter anderen deshalb (und auch weils zu Zweit einfach mehr Spa&szlig; macht) suche ich jetzt &bdquo;meinen&ldquo; ADC.   Du musst kein n&auml;chster Doublelift sein der mich quer durch alle Elos boostet, viel wichtiger ist mir das die Synergie stimmt und man auch menschlich gut miteinander aus kommt. Flamer/Rager/&ldquo;der Support ist Schuld wenn ich einmal sterbe&ldquo; sind jetzt nicht so gerne gesehen (nicht das man es als Support Main nicht irgendwo gewohnt ist :D) .\n\nJetzt ein bisschen was &uuml;ber mich:\n\nIch bin zur Zeit noch Unraked, werde aber sicher nicht h&ouml;her als Silber eingeranked wenn die Promos mal gelaufen sein sollten. Meine Mainrolle ist Support und ich spiele dort einige Champs, habe Thresh, Nami und Janna auf Stufe 7 und w&uuml;rde diese auch als meine &bdquo;Mains&ldquo; bezeichnen. Aber des &ouml;fteren packe ich auch mal Sona, Morgana oder Karma aus. Tanky Supports sind ein wenig meine Nemesis , obwohl ich denke, dass ein Braum sicher auch noch eine ganz gute Abwechslung w&auml;re, wenn ich ihn mal spielen lernen w&uuml;rde. \n\nWer Interesse hat kann mich gerne unter den Namen Hug&iacute;n adden ( ACHTUNG: das i hat ein Apostroph und keinen normalen Punkt in Namen) , dann k&ouml;nnen wir erstmal ein paar Normals zocken um zu sehen ob wir zusammen passen. :)\n\n(PS: Schön wäre länger anhaltender Kontakt)","replies":[{"poster":"Die Todesfaust2","date":"2017-06-10T13:20:13.401+0000","up_votes":1,"down_votes":0,"body":"Hey kannst mich ja adden (Die Todesfaust2) bin main adc und mein champ pool ist groß genug das es ausreicht aber trotzdem hier meine mains erstmal:{{champion:51}} {{champion:222}} {{champion:21}} {{champion:498}}","replies":[{"poster":"Hugín","date":"2017-06-10T13:29:25.884+0000","up_votes":1,"down_votes":0,"body":"hab dich ebenfalls geadded. :)","replies":[{"poster":"Die Todesfaust2","date":"2017-06-10T13:37:15.247+0000","up_votes":1,"down_votes":0,"body":"Schön wenn du ts hast schicke ich dir im game die addresse dann können wir besser kommunizieren.^^","replies":[]}]}]},{"poster":"Hugín","date":"2017-06-10T13:06:35.261+0000","up_votes":1,"down_votes":0,"body":"Ich hab dich geadded. ^^ \nAm besten geht immer den Namen zu kopieren, und per Strg+v ins Namensfeld bei Freunde hinzu fügen zu kopieren. Hab mir schon gedacht das das mit dem Namen ein Problem werden könnte. :D Aber wenn man mich gar nicht findet, könnt ihr hier auch einfach kommentieren, dann finde ich euch. ^^","replies":[]},{"poster":"Brejcha94","date":"2017-06-10T08:28:43.397+0000","up_votes":1,"down_votes":0,"body":"Servus hätte Interesse bin jedoch grade ein wenig zu blöd doch zu finden xD\nWenn du Bock hast Adde mich mal ( Brejcha94 ) \nBin Main vayne and lucian ;) kann aber auch ezreal und Kalista ;)","replies":[]}]}