{"poster":"Xemath","date":"2016-04-19T10:33:43.265+0000","title":"All soloq vs premade","subforum":"Gameplay","up_votes":66,"down_votes":10,"body":"i have met a premade group in rank twice in a row. LOL they are 5 men premade and all of us in the team are just soloq, nice. I remember once in a patch it said they have 98% chance to meet up with another premade group right?  I feel this is pretty unfair.","replies":[{"poster":"CppL","date":"2016-04-19T10:40:16.522+0000","up_votes":14,"down_votes":6,"body":"it is.Looks like riot dont care about solo players anymore.Group up ir get rekt...Welcome to the season 6,The end of solo players.","replies":[{"poster":"franticFurball","date":"2016-04-19T11:01:48.901+0000","up_votes":24,"down_votes":1,"body":"nah, solo players will find other games, simple as that :D\n\nQuestion is: Will this game with its failing DynamicGarbage find other solo players...because Newsflash rito: Your despised system doesn't work without them (good luck finnling thise 4 man premades when we are all busy playing overwatch^^)","replies":[{"poster":"PbJMpP4xzk","date":"2016-04-19T14:57:26.079+0000","up_votes":7,"down_votes":0,"body":"pre-ordered overwatch today i have to try the alpha didn't like'd it at first glance then had to try closed beta was very much better had fun alot of fun.\n\noh and by the way even if the dynamicQ goes around for the long run ... ok peoples will have to find and stick togthere as 5 way more to realize that its feel boring to win that kind of game or very very frustrating for the other 5 man to lose witch will kill the dynamicQ in the long run so i am grabing popcorn and waiting to see all thoses devoted riot a$s linking fans to get saltier and saltier with the years to come.\n\n{{sticker:slayer-pantheon-popcorn}}","replies":[{"poster":"franticFurball","date":"2016-04-19T19:14:40.181+0000","up_votes":5,"down_votes":0,"body":"Fun story, they are already salty =)\n\n_\"Boooohooooo why queue time so looooong?????\"_\n\n_\"Boooohooooo why fill = suppooooooort always so support QQQQQQQ!\"_\n\nAs you said, its really fun to watch the show :D","replies":[]}]},{"poster":"KarmasPolice","date":"2016-04-19T14:01:02.011+0000","up_votes":7,"down_votes":1,"body":"That's the only reason why I still have my accounts and casually play the rotating queue on weekend. Some day, the solo population will reach critical mass, all those kids with their cute 4-man premades telling solo players to stop whining, will start whining themselves as their queue times will reach infinity.","replies":[{"poster":"PbJMpP4xzk","date":"2016-04-19T14:58:37.155+0000","up_votes":2,"down_votes":0,"body":"i love your comment it speak my minds thumb up","replies":[]}]}]},{"poster":"High5","date":"2016-04-19T15:26:00.038+0000","up_votes":3,"down_votes":0,"body":"True.  Same thing has happened in a number of games when similar matchmaking systems were added.  Groups drive people to play more consistently.  People  who play more spend more.  Design decisions are then made based on higher margin players at the expense of everything else.\n\nThe business decision making process is basic economics that airlines have used for years.  Look at WoW, same process too.\n\nI loved LoL when it was pick up and play fun.  Now, we're seeing the new corporate entity fingers reaching in the cookie pot.","replies":[]}]},{"poster":"lolptwo","date":"2016-04-19T15:15:11.954+0000","up_votes":7,"down_votes":0,"body":"98% chance, and League toxicity level is 0.00002% \n\nKappa","replies":[{"poster":"KarmasPolice","date":"2016-04-19T15:55:28.376+0000","up_votes":14,"down_votes":0,"body":"\"While toxicity is down to 0.0000001% in game, boards toxicity is up to 5%. We are announcing DQ for Boards, where you can only write or reply to posts as a 3-4-5-man premade.\" \n\nNot so kappa.","replies":[{"poster":"lolptwo","date":"2016-04-19T16:05:01.899+0000","up_votes":2,"down_votes":0,"body":"LOL","replies":[]}]}]},{"poster":"KarmasPolice","date":"2016-04-19T13:57:49.251+0000","up_votes":7,"down_votes":1,"body":"I dont play solo anymore, alot of my friends stopped playing solo as well.\n\nPlaying solo is asking to be frustrated and disappointed, I had the same experience as you ~2 months ago..and it has been a mental scar on me ever since. I don't trust the match making system, and neither should you.\n\n\nNow as people who only play solo stop doing so, the system only become _more _ biased against the remainder of solo population.","replies":[]},{"poster":"Fovere","date":"2016-04-19T11:55:00.313+0000","up_votes":7,"down_votes":1,"body":"The type of player who will continue to play League will be a different one from previous seasons.  Between the extraordinary behavioral requirements that discourage chat/interacting with other players, and the dismantling of any true representative ladders, the more dedicated, competitive, and immersive players are going to want something more rewarding to throw themselves into.","replies":[]},{"poster":"TheDráco","date":"2016-04-19T13:32:12.122+0000","up_votes":6,"down_votes":1,"body":"The 98% thing is a farce just like the \"1% of the community is toxic\". The fact of the matter is for a system to have balanced matchmaking for premades the queue times would have to be insanely high. This is why the higher you climb ranked the higher the queue time get naturally, so they put a limit just to shove people into a game regardless of balance.","replies":[{"poster":"McKeifus","date":"2016-04-19T18:05:22.594+0000","up_votes":2,"down_votes":0,"body":"Wow I keep running into that 1% just about every single game.  Guess I'm just lucky.","replies":[]}]},{"poster":"Serika Zero","date":"2016-04-19T14:42:07.332+0000","up_votes":3,"down_votes":2,"body":"dynamicq = normal games with semi public mmr\njust treat them as normal games, mute everyone, play for fun\nand then you will enjoy the game\n\nif you want to tryhard and competitive stuff, go somewhere else\nits to casual even for me, so I've started semi quitting too (playing 2 ranked games per month to keep placement this year)","replies":[{"poster":"LatetotheRace","date":"2016-04-19T16:55:22.348+0000","up_votes":4,"down_votes":0,"body":"\"just treat them as normal games, mute everyone, play for fun\"\n\nI wish ranked was as relaxed as normals, but everyone goes full tryhard in ranked. \n{{champion:238}} {{champion:77}} {{champion:245}} {{champion:11}}  Everywhere","replies":[{"poster":"Serika Zero","date":"2016-04-19T17:45:38.014+0000","up_votes":1,"down_votes":0,"body":"many of those got offmeta counters like urgot, veigar, cho-gath\njust try new picks and enjoy\n\nzed is really weak if he can't get feed\nsomething like urgot or cho or even veigar (put cage over you when he ults) can easily deal with him","replies":[]}]},{"poster":"MonkeyMadness","date":"2016-04-26T10:45:21.537+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=Serika Zero,realm=EUNE,application-id=3ErqAdtq,discussion-id=o8HREB0o,comment-id=0006,timestamp=2016-04-19T14:42:07.332+0000)\n>\n> dynamicq = normal games with semi public mmr\n> just treat them as normal games, mute everyone, play for fun\n> and then you will enjoy the game\n> \n> if you want to tryhard and competitive stuff, go somewhere else\n> its to casual even for me, so I&#x27;ve started semi quitting too (playing 2 ranked games per month to keep placement this year)\n\nNo offense, but i hate this kind of attitude. If you are queueing for ranked, you are playing to win. Stop with this mentality of \"just go out and have fun\". No. This is ranked. If you just want to casually enjoy the game that's precisely what normals are for. But as soon as you click the  \"accept\" button when a ranked queue pops, you had better be giving 100% of your effort to winning the game. \n\nAlso the fact that you need to play to \"keep placement\" makes me think that your plat. Congrats. But this excludes you from the real issue: it's freakin' hard to climb when you're virtually guaranteed to lose a percentage of your games to premades.","replies":[{"poster":"Serika Zero","date":"2016-04-26T16:08:35.049+0000","up_votes":2,"down_votes":1,"body":"sry, dynamic q is made for casual games\nand if you would check my profile (euw account), you would see that I've only played like 5 heroes. So, I try to win.\nBut there's no way in hell I'm getting any \"bad\" fealings if we lose the game. \n\nThat doesn't mean \"gg surrender@20\" when the enemy got a kill but nothing in chat and whatever happens happens since I don't give a fuck anymore. Oh right, and I usually lose the early game in all games anyway","replies":[]}]}]},{"poster":"Invictus Unbent","date":"2016-04-19T16:14:03.996+0000","up_votes":5,"down_votes":1,"body":"Bring back SOLO QUEUE","replies":[]},{"poster":"Osaka 778","date":"2016-04-19T13:56:53.811+0000","up_votes":5,"down_votes":1,"body":"The more people leave because of dynamic queue, the longer the queue times are.... forcing the match making system to widen the MMR to reduce queue times, making games more unfair... making more people quit because they eventually realize that dynamic queue is a joke of a rank ladder system.","replies":[]},{"poster":"CodyBear ","date":"2016-04-19T18:31:53.076+0000","up_votes":3,"down_votes":0,"body":"Riot and the Chinese are very good and accurate with numbers. Just saying ;)","replies":[]},{"poster":"Fovere","date":"2016-04-26T11:40:05.507+0000","up_votes":2,"down_votes":0,"body":"Understood MM, but as it stands there is no ranked in season 6.\n\nThe guy is just saying that if you queue into ranked with those expectations you will drive yourself crazy, which is likely true","replies":[]},{"poster":"Wahre Gesicht","date":"2016-04-20T11:29:30.130+0000","up_votes":2,"down_votes":0,"body":"Solo players are stopping to play rankeds. The situation will only worsen.","replies":[]},{"poster":"KVbqbFsC8e","date":"2016-04-20T03:40:14.330+0000","up_votes":2,"down_votes":0,"body":"FUCK DYNAMIC QUE.","replies":[]},{"poster":"Klae","date":"2016-04-19T14:14:04.468+0000","up_votes":2,"down_votes":2,"body":"I played against a 3-man premade consisting of a Bronze 4 and 2 Silver 3s... needless to say the Bronze 4 was definitely smurfing because he destroyed our midlaner and my team continued to feed. Personally I feel as if there is not a large gap between Silver 3 and Bronze 1, however, my team proved to be unable to play against it and got demolished.\nDynamic Q sucks man.","replies":[{"poster":"LatetotheRace","date":"2016-04-19T16:56:10.141+0000","up_votes":1,"down_votes":0,"body":"People who are smurfing will never be Bronze 4. (unless they're a silver smurf)\nYour laner just sucked that bad.","replies":[{"poster":"Klae","date":"2016-04-19T18:22:26.255+0000","up_votes":2,"down_votes":0,"body":"LOL Probably true.. unless it was someone who was getting paid to boost. He had good Yasuo mechanics so","replies":[{"poster":"LatetotheRace","date":"2016-04-19T20:18:45.219+0000","up_votes":1,"down_votes":0,"body":"I've met some people who seriously had their mechanics down, they just couldn't \"teamwork\" or \"objective\" which is why they were in the elo they were.","replies":[]}]}]}]},{"poster":"SilenceToJiji","date":"2016-04-20T06:37:18.722+0000","up_votes":1,"down_votes":0,"body":"Not to be that guy but u played 3 games today last game before that was the 11th.\n\nonly one of which only had a duo.\n\nI hate dynamic queue and want solo q too..\n\nbut people lying about quitting and bad scenarios isn't helping our case.","replies":[{"poster":"KarmasPolice","date":"2016-04-20T13:08:33.995+0000","up_votes":1,"down_votes":0,"body":"you cant know this for certain since Riot don't have premade data available. The \"premade\" data you see in gg.op is some kind of a conclusion and is very inaccurate.","replies":[]}]},{"poster":"Oelyk","date":"2016-04-20T00:01:33.777+0000","up_votes":1,"down_votes":0,"body":"Did you win?","replies":[]},{"poster":"Quepha","date":"2016-04-19T18:15:34.482+0000","up_votes":1,"down_votes":2,"body":"Riot admitted that most of the bad matchmaking is concentrated at high elos, which I guess you qualify as. I know they have problems with high elos pretty much every season.","replies":[]}]}