{"poster":"KT AMG","date":"2016-10-27T17:37:53.038+0000","title":"REMOVE MY ACCOUNT SUSPENSION please","subforum":"Help & Support (OCE)","up_votes":1,"down_votes":0,"body":"To Whom it may concern,\n\ni am writing this letter to request remove my suspension.\n\nMy account login ID:POONWINGYIN, Summoner name: KT AMG, Server: Oceania\n\nToday I had been noticed that my account is suspended. I received an email it said my &quot;MMR Boosting &quot;, and i will get a 2 weeks suspension and no ranked rewards.\n\nI feel very incredible about this outcome, therefore I am making the following complaints, hope you can give me a justice.\n\n.\nFirstly, it  said the reason of why I get banned was &#039;MMRBoosting&#039;. I can assure you that all the game is played on my own. Im a female player, I always try my best to win the every single game seriously, and i never made any illegal behavior.\n\nSecondly, I knew that my MMR now is higher than the average of the other players. However, that was the result of my own efforts. If you could check my matches history, you should know that i just used my best played champions in the rank games, like Zyra, Annie or Mundo.\n\nThirdly, my recent 30 games was mostly played with my boyfriend and my real life friends. All of these games were duo or full team game. When you check my matches history, you can also check my KDA in the game. Do you think this is a smurf should have level?\n\nYou can also check my IP address, i was playing all my game at home or at internet Bar in the Sydney Chinatown.\nBecause Im a student, therefore i  always played the game at night, and almost everyday.\n\n\nMoreover, I played this game has been four years time.\nFrom S2 to S6, from Chinese server to NA server to Oceania server.\nI pay more attention and money in this game, but at the end got such an unfair happen to me&hellip;..i feel really sad. \n\nContact me if you need any more information\nmy email address is [removed]\n\nplease reply me as soon as possible\ni hope you can give me a justice\n\nmany thanks,\nKT AMG","replies":[{"poster":"SephirothSG","date":"2016-10-30T05:22:56.242+0000","up_votes":1,"down_votes":0,"body":"Hey there,\n\nYour best bet in this case would be to [contact Player Support](https://support.riotgames.com/hc/requests/new), they're the only ones who can assist with account specific inquiries.","replies":[]}]}