{"poster":"Matiuswar","date":"2019-02-13T00:24:29.034+0000","title":"Paquete nuevo jugador","subforum":"Guias y consejos","up_votes":5,"down_votes":0,"body":"Buenas tardes. Queria saber si &iquest;el paquete que menciono incluye los 6 perdonajes (lee, jinx, wukong, morgana y ekko) mas una skin de las mencionadas mas un ward?&iquest;o solo me dan los fragmentos de estos personajes?&iquest;vale la pena gastar rp en ellos?","replies":[{"poster":"adepfuan","date":"2019-02-13T01:06:08.090+0000","up_votes":1,"down_votes":0,"body":"te lo dan a todos que salen ahi, ademas te dan la skin permanente pero solo 1 de esos que nombra, ami me toco la de morgana xD y el ward tambien es permanente, tengo el de guardianas estelares","replies":[]},{"poster":"DDevil","date":"2019-02-13T00:49:19.860+0000","up_votes":1,"down_votes":0,"body":"Te dan los campeones permanentemente, es decir, se añaden automáticamente a tu colección. Lo sé porque yo mismo lo compre hace unos días y vale la pena comprarlo.","replies":[]},{"poster":"Widuk","date":"2019-02-13T01:15:52.827+0000","up_votes":1,"down_votes":1,"body":"Buenas,\n\nVeo una promoción de 21 campeones básicos por 950 RP, pero no encontré la que mencionaste.\n\n Respondiendo a tu consulta:\n\n> ¿Vale gastar RP en ellos? \n\nSi tienes amigos que quieran enseñarte a ocupar o probar en equipo uno de esos campeones, sí.\nSi es porque crees que vás a tener más posibilidad de ganar partidas con ellos... no.\n\n**Porqué:** Al utilizar un nuevo campeón tienes el agrado de utilizar otras mecánicas en el juego, pero esto lo vas a obtener con cualquier otro campeón comprado con RP o Gemas Azules. \n\nPuedes probar los campeones y, si no ten gustan, simplemente juegas con otro. Solo recuerda que para utilizar un campeón de manera óptima vas a pasar por muchas etapas:\n\n1. Vas a probar las habilidades del campeón.\n2. Te vas a acostumbrar a ocupar las habilidades del campeón.\n3. Vas a probar ítems y ver como rinde con distintas combinaciones y orden de \"build\".\n4. Vas a aprender con qué campeones te va bien y mal (aliados y enemigos).\n5. Vas a optimizar sus runas a tu preferencia.\n\nAhora, si tu nivel adquisitivo cubre la compra sin ninguna molestia. Ve y pruébalos todos!\n\nOtras cosas: \n\n* League of Legends tiene una notación de \"dificultad de jugabilidad\" en la descripción de los campeones. Los campeones más fáciles de ocupar usualmente son asociados a los más baratos (no me refiero a ejecutar a nivel experto, solo aprender a jugarlo y tener una buena experiencia). Si eres verde verde, te recomiendo iniciar por esos :)\n* En la sección de \"Colección\">\"Campeones\" del cliente puedes ver todos los campeones y filtrarlos por adquiridos, no adquiridos, disponibles, etc... y >> **rol** <<. Puedes ver cuáles están disponibles según línea/rol quieras ocupar y guiarte con ello en tus compras. :)\n\nEspero te sea de ayuda!\n\no7","replies":[]}]}