{"poster":"giulyyy","date":"2016-01-26T14:21:05.004+0000","title":"Urgot,Yorik e Fiddlestik","subforum":"Discussioni generali","up_votes":2,"down_votes":1,"body":"Ci sono champ che hanno bisogno di rework pi&ugrave; di altri...champ che in questa season fanno una fatica assurda a cavarsela nei tf..oppure champ che non hanno uno scopo ben definito vedi Yorik ( &egrave; un Bel champ ma veramente...ha qualcosina che non va, la maggior parte delle volte se il tuo avversario &egrave; furbo &egrave; quasi sicuro che riesce a scappare o dartele di santa ragione ) oppure urgot...veramente la grafica e l animazioni di urgot fanno cagare peggio di quelle di poppy prima del rework...fiddlestik l ho aggiunto solo perch&eacute; anche per lui un bel rework in grafica non guasterebbe...ma Yorik e urgot sono champ che secondo me ne hanno pi&ugrave; bisogno","replies":[{"poster":"Nibbio Bianco","date":"2016-01-26T14:31:48.685+0000","up_votes":5,"down_votes":0,"body":"In realtà Urgot è uno dei vecchi campioni con più poligoni, più dettagliati e con le animazioni migliori, ecco perché la riot fatica a reworkarlo... secondo me la gente non capisce il concept di Urgot, ma in realtà è molto sexy. Yorick è totalmente fatto male, anche gli spettri sono modellati male. Fiddle è uno spaventapasseri, basta qualche stecchino per far capire cos'è, non credo sia la massima priorità al momento.","replies":[]},{"poster":"Giovarco","date":"2016-01-27T07:28:08.047+0000","up_votes":2,"down_votes":0,"body":"Yorick: fantastico concept, esecuzione pessica, zero counterplay in lane, inesistente late game.\n\nUrgot: io in S4 sono stato main Urgot, anche se tutt'ora lo gioco di tanto in tanto. Se c'è qualcosa che affascina di questo campione è proprio il suo carattere e il suo stile. Essendo un campione vecchio, anche lui ha un bel concept, ma una brutta esecuzione al livello di kit, anche se in sé e per sé funzione. Come modello, non è ai livelli del vecchio Sion, ma neanche così tremendo come lo descrivi tu.\n\nFiddlesticks: è uno spaventapasseri. Non c'è molto su cui lavorare dal punto di vista grafico. Il suo kit funziona e ha chiari punti di forza e debolezza.","replies":[]},{"poster":"fedy99","date":"2016-01-27T10:57:45.579+0000","up_votes":1,"down_votes":0,"body":"Io con yorick mi trovo abbastanza bene","replies":[]},{"poster":"Killer SurpRyze","date":"2016-01-26T14:58:39.126+0000","up_votes":1,"down_votes":0,"body":"Secondo me Yorick è forte in lane (anche se è difficile uccidere l'avversario, se è furbo), ma totalmente inutile in tf: non ha abbastanza danno, non è abbastanza robusto, non porta utilità al team. Immagino sia passabile in giungla, dove può tranquillamente rompere le scatole al jungler nemico (1vs1 è forte), farsi il drago già al livello 3 e .... ben poco altro :-(\nCon un portale e grazie ai ghoul che costringono in difesa il nemico, può far crollare velocemente le torri.","replies":[]},{"poster":"MGK Suerte","date":"2016-01-26T14:29:45.900+0000","up_votes":1,"down_votes":0,"body":"**Yorick**, lo comprai con tantissima voglia di usarlo nei primi periodi.. Gli comprai anche la skin dei Pentakill ma il problema è che provarlo nelle ranked fu uno sbaglio tremendo.. Non si riesce a fare molto poi le build sono abbastanza strane, e ti dico che ne ho provate di qualsiasi tipo, ma niente.. Sul piano grafico sono d'accordo con te.\n\n**Urgot**, anche con lui ho giocato, ma solo quando era gratis da li capii che non era un champ che avrei comprato, ma sono gusti c'è chi maina anche con urgot, chi ci fa pentakill etc.. Sempre sul piano grafico è da cancellare e rifare completamente.. E' davvero orribile.\n\n**Fiddlesticks**, guarda è davvero già fatto benissimo, è uno spaventapasseri, è fatto cosi' x)!","replies":[{"poster":"giulyyy","date":"2016-01-26T14:34:46.422+0000","up_votes":1,"down_votes":0,"body":"Ti do ragione su Fiddlestik...e comunque usai anch'io Yorik in una ranked...in normal spaccava i culi sarà che la gente non lo conosceva...in ranked mi capitò un irelia top...se ci ripenso ancora ho gli incubi per quanto mi aprii il culo","replies":[]}]},{"poster":"SpideyPizza","date":"2016-01-26T14:25:22.735+0000","up_votes":1,"down_votes":2,"body":"yorik ha bisogno di skins.. cosi io lo trovo molto forte come champ.. basta saperlo usare","replies":[{"poster":"giulyyy","date":"2016-01-26T14:30:36.700+0000","up_votes":1,"down_votes":0,"body":"Le animazioni andavano bene forse un anno fa...poi io personalmente lo trovo lento per gli ingage e poco tank se deve essere il primo ad attaccare","replies":[{"poster":"SpideyPizza","date":"2016-01-26T14:31:47.509+0000","up_votes":1,"down_votes":0,"body":"mastery e rune :) \nha un life steal sorprendente con ghoul, puoi farmare in pace.\n\nper gli engage e' molto usato con{{summoner:3}}","replies":[]}]}]}]}