{"poster":"SpectrumDevides","date":"2018-07-08T14:37:07.771+0000","title":"I VOTI","subforum":"Discussioni generali","up_votes":1,"down_votes":2,"body":"avevo gi&agrave; creato una discussione su questa cosa.\r\nMa sono costretto seriamente a parlarne ancora.\r\nIo con gp ho fatto dei bei punteggi da S e non ho preso S, farmavo anche tanto e i miei amici confermavano e nemmeno loro capivano perche non prendessi S.\r\ne in seguito ho creato una discussione e tutti mi dicevano il farm e invece che averne magari 250 al minuto 30 tutti mi dicevano robe tipo 300 ecc.\r\ne quindi ho accettato il tutto.\r\nma oggi un mio amico ha fatto 4/1/9 135 di farm in 18 minuti e ha preso S.\r\ncome mai io facendo 11/1/10 e 220/250 (circa) di farm in 23 minuti non ho preso S? e non &egrave; l&#039;unica volta in cui ho fatto punteggi migliori di quello del mio amico, ma vabbe porto questo esempio per ora.","replies":[{"poster":"Cry of the Celts","date":"2018-07-08T15:54:43.109+0000","up_votes":2,"down_votes":0,"body":"Forse ti ricorderai male, l'unica partita che hai fatto con GP, negli ultimi 6 mesi, in cui hai fatto uno score di 11/1/10 è [questa](https://matchhistory.euw.leagueoflegends.com/it/#match-details/EUW1/3679782059/238323802?tab=overview) in cui hai fatto 220 minion in 32 minuti, che è poco per un GP","replies":[{"poster":"SpectrumDevides","date":"2018-07-08T21:08:40.367+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Cry of the Celts,realm=EUW,application-id=MJVj50Jw,discussion-id=lyNV2EPw,comment-id=0001,timestamp=2018-07-08T15:54:43.109+0000)\n>\n> Forse ti ricorderai male, l&#x27;unica partita che hai fatto con GP, negli ultimi 6 mesi, in cui hai fatto uno score di 11/1/10 è [questa](https://matchhistory.euw.leagueoflegends.com/it/#match-details/EUW1/3679782059/238323802?tab=overview) in cui hai fatto 220 minion in 32 minuti, che è poco per un GP\n\nsi evidentemente mi ricordavo male, comunque mi sembra migliore dei due punteggi del mio amico😅","replies":[{"poster":"FireM1nd","date":"2018-07-09T00:12:14.521+0000","up_votes":1,"down_votes":0,"body":"Non è sempre detto. Fattori come danno fatto, gold/min e kill part. sono estremamente importanti.  Se ho un kda decente ma una kill part. del 70%, posso prendere comunque S. Se pero' tutti snowballiamo,  alla fine il mio score non sarà nulla di speciale,  e quindi le possibilità di prendere S si riducono","replies":[]}]}]}]}