{"poster":"chiripukaykay","date":"2019-04-03T03:56:01.244+0000","title":"Twisted Fate el Magnífico","subforum":"Charlas Generales","embed":{"description":null,"url":"https://lolskinshop.com/wp-content/uploads/2015/04/TwistedFate_3.jpg","image":null},"up_votes":5,"down_votes":0,"body":"Hace mucho que tengo la skin de Twisted Fate \"El Magnífico\" y la uso con pocas ganas porque se que es una de las pocas skins legendarias de 1820 rp que no le cambia **absolutamente nada** al campeón mas que añadirle un sombrero y una capa. Estaría bueno que piensen en actualizarla porque esta igual desde hace años y realmente no me suma nada positivo a la experiencia con el champion.\n\nNo se cuantos tienen la skin ni que piensan pero si pueden dejar su comentario y voto positivo así **llega a Riot** suma un montón.\n\nAbrazo a todos!\n                                    {{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"ChocoMix","date":"2019-04-03T05:13:08.791+0000","up_votes":3,"down_votes":0,"body":"¿ Única sin mayores cambios ? entonces Corki trineo y Baron rojo no existen.\n\nTe nombro algunas.\n\nCorki Baron rojo / Trineo\nAnnie in wonderland\nTristana Bomberita (aunque la actualizaron y ahora si tiene mejores efectos, aunque no da para más de 1350 la verdad).\nMe gustaría decir que Caballero Cho'Gath, pero solo es fea con ganas (por  lo demás, tiene la voz de zilean y dialogos distintos).","replies":[{"poster":"chiripukaykay","date":"2019-04-05T20:18:16.390+0000","up_votes":1,"down_votes":0,"body":"Hay mucha razón en tu comentario! Realmente no lo sabía y esta bueno que se hable de eso :)","replies":[]}]},{"poster":"Shirotani","date":"2019-04-03T04:29:00.233+0000","up_votes":3,"down_votes":0,"body":"Ya dijeron de Riot que las skins viejas las van a actualizar el día que dicho campeón reciba un rework.","replies":[{"poster":"chiripukaykay","date":"2019-04-05T20:21:47.935+0000","up_votes":1,"down_votes":0,"body":"Puede que sí, igual (si no estoy mal) existen casos donde se mejoró la forma en la que se ven las skins sin tener que cambiar el campeón entero y si me equivoco y realmente no pasó. por ahí es momento en que empiecen a pensar un poco en hacerlo :D","replies":[]}]},{"poster":"Zhearun","date":"2019-04-03T05:25:06.153+0000","up_votes":2,"down_votes":0,"body":"Porque es una de las primeras skins Legendarias que salieron en el juego. El único problema, es que jamás recibieron un update. Igual, son de Legado, así que cuando se abre el Legacy Vault, normalmente están bajo bastante descuento y quedan en el precio que deberían estar para estándares actuales. Igual, si reciben un VU, esos skins lo más probable es que reciban mastante más amor por parte de Riot.","replies":[{"poster":"chiripukaykay","date":"2019-04-05T20:23:49.787+0000","up_votes":1,"down_votes":0,"body":"Ojalá que si! El equipo de diseño de Riot hizo cosas increíbles con un montón de skins y si le ponen ganas puede ser un super proyecto para ellos","replies":[]}]}]}