{"poster":"BluCobalto92","date":"2017-09-13T15:31:39.949+0000","title":"Frammenti chiave e capsule onore","subforum":"Discussioni generali","up_votes":1,"down_votes":2,"body":"Qualcuno sa dirmi quante partite al giorno sono necessarie per ottenere tutti i 12 frammenti di chiave mensili? \r\n\r\nE se nel caso sia sufficiente giocare una partita al giorno contro i bot? \r\n\r\nLe capsule invece se ho capito bene sono totalmente casuali... Giusto?","replies":[{"poster":"astenar","date":"2017-09-14T10:07:49.068+0000","up_votes":2,"down_votes":0,"body":"Adesso tutto è collegato al sistema degli onori, parti dal lvl 2 e se sei un giocatore onorevole sali di livello, se scendi all 1 o 0 non ricevi chiavi, sono abbastanza sicuro che si riceva chiavi e capsule solo se si viene onorati poiché io prima ci ricevere chiavi o capsule mi arriva anche la motivazione, con scritto gg oppure qualcosaltro. \nOra se lo trovo ti linko dove è scritto, e intendevo capsule e non forzieri( questi li ricevi uno per champ quando prendi s tu o un tuo compagno preamed).","replies":[]},{"poster":"astenar","date":"2017-09-13T15:59:22.110+0000","up_votes":1,"down_votes":0,"body":"I frammenti di chiave come i bauli li prendi quando vieni onorato, non sempre. Quindi puoi giocare 4 partite e riceverw tutte le chiavi , oppure non essere mai onorato giocare 200 partite e non riceverne nessuna","replies":[{"poster":"BluCobalto92","date":"2017-09-13T17:33:30.993+0000","up_votes":1,"down_votes":0,"body":"I bauli intendi le capsule?... Perche se intendi i forzieri so per certo nn sia cosi.... \n\nPer quanto riguarda i frammenti di chiave non ho letto da nessuna parte chw sia necessario essere onorati ma che basta semplicemente giocare.... Nel caso mi sbagliassi potresti linkarmi da dove hai preso queste informazioni?","replies":[]}]},{"poster":"Helenaaa","date":"2017-09-13T16:08:40.199+0000","up_votes":1,"down_votes":0,"body":"Non so com'è adesso, ma prima avevi maggiore probabilità di ottenere una chiave giocando e vincendo le ranked","replies":[]}]}