{"poster":"BluCobalto92","date":"2017-04-03T11:57:10.084+0000","title":"Ma porca di quella.....","subforum":"Discussioni generali","up_votes":3,"down_votes":6,"body":"Vi prego ditemi che giocare jungler superato il bronzo &egrave; meglio....tutti a scassare il cazzo....sono andato afk in ranked ora per la prima volta da quando gioco ma davvero non ne posso piu...stavo giocando hecarim con un premade mid con annie...starto e va tutto bene....blu...lupi...polli...lv 3 invado contro un gragas vado a vedere dai suoi polli li aveva gia fatti e noto unakill easy in bot...pingo e parto in carica come solo hecarim sa fare....ezreal si salva ma la malcapitata lulu no....first blood per me....tutto contento torno a farmare ed ecco quel brutto suono del mio premade in ts che si lamenta....kill per ekko....faccii quel che posso vado a fare il blu e lo pretende cait....mi servirebbe perche hecarim consuma uno sfacello di mana ma vabbe punto sulla bot e glielo lascio...nel frattempo altre cazzate e il mid ci rimuore...lasciando di nuovo ekko con poca vita....ho provato una gank assurda passandogli da dietro e per poco ci morivo anche io....insomma....decimo minuto...8 a 1 han iniziato a invadere e romare a cazzo non riuscivo piu a far niente...il top che diceva heca gank maybe?....il mio premade che sfracassava la minkia anche lui...non ganki mai che cazzo siamo in ts se tanto non collabori ecc ecc....hai fatto una gank del cazzo dicendo poi di non andarci (la gank in questione sarebbe ekko che pushava sotto torre mentre anni aveva recollato...mentre stava tornando in lane son andato su ekko per dargli 2 colpetti ovviamente mentre scappava in giungla non wardata o interrotto l inseguimento)\r\n\r\nvabbe ora sta sbollendo l incazzatura....grazie della pazienza","replies":[{"poster":"wellyT93","date":"2017-04-03T12:49:39.149+0000","up_votes":7,"down_votes":1,"body":"Prima cosa: Molla il tuo pre-made, non ne vale la pena fare pre-made con un rager. Inoltre, se non riuscite a coordinarvi c'è molta più possibilità di perdere, dato che se la pre-made nemica è decente, abbasserete di molto la probabilità di vittoria a tutto il team, non solo a voi stessi. \nSeconda cosa: Non importa quanto pianga, MAI lasciare il blu all'adc, mai, M-A-I. \nTerza cosa: Hai ragequit, questo ti porta AUTOMATICAMENTE dalla parte del torto, fine, non c'è discussione su questo. \nQuarta cosa: Guarda guide e stream di jungler high elo, è chiaro che ti mancano tantissime meccaniche di base.\nQuinta cosa: Il jungler, ad ogni elo, è il ruolo che riesce a solo-carriare meglio di tutti, se non sali è colpa tua, non dei team, non dei pre-made, non della connessione o di gesù cristo, tua, mettilo in testa, cerca di migliorare e vedrai che poi salirai. ","replies":[{"poster":"Jeanne dˆArc","date":"2017-04-03T12:52:24.864+0000","up_votes":1,"down_votes":0,"body":"Aggiungerei qualche altro _mai_ al 2° punto, visto che lui stava usando Hecarim che abusa malissimo del mana, soprattutto in early.","replies":[]}]},{"poster":"BluCobalto92","date":"2017-04-03T14:29:01.376+0000","up_votes":1,"down_votes":1,"body":"Io ci proverei anche a carriare...infatti la first blood me la son presa senza ripensamenti....ma se poi ho 3 lane tutte pushate dove stracazzo ganko?....non mi resta altro che farmare nella mia giungla....ma poi arriva gragas tutto pieno di se 3/0 che mi invade e io nn posso farci molto se non ho ancora chiuso neanche la gemma verde","replies":[{"poster":"Ringiel","date":"2017-04-03T14:42:24.525+0000","up_votes":3,"down_votes":0,"body":"ma per quale motivo chiudi subito la gemma verde su hecarim? se lo fai rimani praticamente senza danno per tutti l'early ...\ncmq se le lane pushano esiste la cotrogank,però probabilmente non wardi la giungla nemica per sapere dove si trova il jungle nemico vero?","replies":[{"poster":"RVN Trobugno","date":"2017-04-03T14:49:25.199+0000","up_votes":2,"down_votes":0,"body":"lol non ero andato a vedere come buildava heca, BluCobalto92 buildati solo il T1 dell'oggetto da jungler (senza gemma) e cerca di chiuderti subito la trinity. Poi dopo te lo chiudi se serve se no prediligi un altro oggetto prima. Ieri ho arato male un heca proprio per questo errore, ed era main heca, silver basso ma main heca ahahahah..","replies":[]}]},{"poster":"RVN Trobugno","date":"2017-04-03T14:31:51.601+0000","up_votes":2,"down_votes":1,"body":"Consiglio spassionato: non puoi gankare? invadi fino alla morte. Non puoi ancora gankare? Pinga fino alla morte finché non la smettono di pushare. Il consiglio più grande? Pinga con l'anonimo (quello blu) così non sanno chi sia e pinga non oltre le 3 volte così pensano siano più persone che stanno pingando (non sto scherzando funziona in bronzo XD). Ultimo consiglio, quello che mi ha fatto salire. Muta e non flammare.","replies":[]}]},{"poster":"Jeanne dˆArc","date":"2017-04-03T12:19:04.871+0000","up_votes":4,"down_votes":1,"body":"Quando gioco in giungla seguo un'unica e semplice regola: ignoro le insistenti richieste di gank. Tutte le lane chiedono il gank perché in difficoltà oppure perché vogliono prendere subito vantaggio, ma sta a te jungler capire quando e dove gankare. Il mio consiglio è di mutare tutti e di non giocare più con 'sto tizio con cui hai fatto premade.","replies":[{"poster":"BluCobalto92","date":"2017-04-03T12:30:24.444+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Chìtoge,realm=EUW,application-id=MJVj50Jw,discussion-id=u9d08WBF,comment-id=0002,timestamp=2017-04-03T12:19:04.871+0000)\n>\n> Quando gioco in giungla seguo un&#x27;unica e semplice regola: ignoro le insistenti richieste di gank. Tutte le lane chiedono il gank perché in difficoltà oppure perché vogliono prendere subito vantaggio, ma sta a te jungler capire quando e dove gankare. Il mio consiglio è di mutare tutti e di non giocare più con &#x27;sto tizio con cui hai fatto premade.\n\nIl problema è che mi rompeva il cazzo proprio perche non gankavo....ma io avrei anche voluto gankare....la mid in genere è la corsia che preferisco feeddare....ma è difficile gankare se muore perche ingaggia da solo...cazzo...vuoi la gank...stai safe e aspetta...cazzo non posso gankare 3 lane e farmare contemporaneamente....poi se te al quinto minuto sei 0/2 e non per bravura dell avversario ma perche sei andato all in 1v1 quello si feedda e io nn gank neanche piu in 2v2 perche son doppie regalate","replies":[{"poster":"BluCobalto92","date":"2017-04-03T12:31:38.918+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=BluCobalto92,realm=EUW,application-id=MJVj50Jw,discussion-id=u9d08WBF,comment-id=00020000,timestamp=2017-04-03T12:30:24.444+0000)\n>\n> Il problema è che mi rompeva il cazzo proprio perche non gankavo....ma io avrei anche voluto gankare....la mid in genere è la corsia che preferisco feeddare....ma è difficile gankare se muore perche ingaggia da solo...cazzo...vuoi la gank...stai safe e aspetta...cazzo non posso gankare 3 lane e farmare contemporaneamente....poi se te al quinto minuto sei 0/2 e non per bravura dell avversario ma perche sei andato all in 1v1 quello si feedda e io nn gank neanche piu in 2v2 perche son doppie regalate\n\nQuindi...come far capire che devono aspettare che io possa gankare e non pretendere la gank a comando loro?...se dici di aspettare tanto ingaggiano da soli....muoiono e partono i flame","replies":[{"poster":"Ringiel","date":"2017-04-03T12:54:24.761+0000","up_votes":2,"down_votes":1,"body":"è inutile che ci provi,la gente pensa che il jungler sia il loro babysitter e che debba salvare una lane persa con un miracolo ogni volta ... in realtà tu devi gankare le lane che stanno vincendo,così hai più possibilità di portarti a casa qualcosa,e fregartene di quelle che perdono;\nse iniziano a lamentarsi muta tutti e non tiltare,perchè come ho detto sopra non puoi fare miracoli se una lane ha preso un vantaggio enorme o ritieni che sia una perdita di tempo (es gankare ekko feedato per me non ha alcun senso,molto meglio tornare bot dove hai preso kill o andare top che è la lane più facile da gankare)","replies":[{"poster":"RVN Trobugno","date":"2017-04-03T13:28:53.326+0000","up_votes":1,"down_votes":1,"body":"Bravo Ringiel u.u. Aggiungo inoltre una cosa mia piccola preda, quando sei jungler il tuo focus deve essere su mid e bot. La top gankala solo se necessario, in tal modo permetti di prendere vantaggio ai tuoi carry ed inoltre appena vedi il jungler in top lane puoi rushare un drake. Ovviamente chiedi sempre alla mid e bot di non pushare troppo altrimenti non riesci a gankarle. Ovviamente vale sempre la regola detta da Ringiel, non gankare una lane persa. Tu sei il jungler, il tuo compito e vincere la partita non vincere le lane di chi non sa gestirle. Come la vinci? Con obiettivi, torri, drake, ottimi gank nella lane vincente.","replies":[]}]}]}]},{"poster":"Laiho88","date":"2017-04-03T17:20:08.604+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Chìtoge,realm=EUW,application-id=MJVj50Jw,discussion-id=u9d08WBF,comment-id=0002,timestamp=2017-04-03T12:19:04.871+0000)\n>\n> Quando gioco in giungla seguo un&#x27;unica e semplice regola: ignoro le insistenti richieste di gank. Tutte le lane chiedono il gank perché in difficoltà oppure perché vogliono prendere subito vantaggio, ma sta a te jungler capire quando e dove gankare. Il mio consiglio è di mutare tutti e di non giocare più con &#x27;sto tizio con cui hai fatto premade.\n\nbeh dipende, ci sono casi dove il jungler è palesemente idiota (vedi quando il laner si freeza la lane sottotorre per permettere un free gank e il jungler per 20 minuti non si presenta)","replies":[{"poster":"BluCobalto92","date":"2017-04-03T17:43:48.770+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Laiho88,realm=EUW,application-id=MJVj50Jw,discussion-id=u9d08WBF,comment-id=00020001,timestamp=2017-04-03T17:20:08.604+0000)\n>\n> beh dipende, ci sono casi dove il jungler è palesemente idiota (vedi quando il laner si freeza la lane sottotorre per permettere un free gank e il jungler per 20 minuti non si presenta)\n\nio l unico da cui non mi presento al massimo è il top per il semplice motivo che in genere è tank e quindi anche se in difficolta puo cavarsela mentre è piu importante aiutare la bot....ovviamente se la bot va bene parto in quarta per la top....ho appena finito una flex (era da solo) 10/1/11 ho chiesto in selezione del campione di giocare safe cosi potevo gankare e feedarli....manco riesco a chiamare la gank alla bot che era in ottima posizione che appare il primo sangue di gnar fatto in 1v1 contro la nostra camille....wtf....la top la gankavo insieme al mid che avevo feeddato....camille riusciva lo stesso a morire nonostante fossimo 3v1","replies":[]}]}]},{"poster":"BluCobalto92","date":"2017-04-03T14:47:30.525+0000","up_votes":1,"down_votes":1,"body":"Invado ogni volta che posso ma se sono in svantaggio invadere vuol solo dire regalare altre kill....preferisco finche non salgo giocare top....sono particolarmente bravo a farmare sotto torre e se il mio jungler ha un minimo di cervello puo fare delle gank easy....sarà che gioco spesso come jungler ma riesco a ingaggiare con un ottimo tempismo che permette al mio jungler di arrivare quando metà lavoro è gia fatto\n\nÈ anche una cosa che detesto perche quando gioco con gli amici si lamentano che non ganko o che ganko male mentre quando giocano loro in giungla fan spesso partitoni....ma nn si rendono conto che \"a parer mio poi magari sbaglio\" sono io a rendergli il ruolo piu facile tenendo l avversario pushato e iniziando l ingaggio da solo in modo che quello impegnato contro di me o non si rende conto che sta per essere gankato o ghiotto di kill esagera","replies":[{"poster":"Ringiel","date":"2017-04-03T15:02:58.957+0000","up_votes":2,"down_votes":0,"body":"io non parlavo di invadere,ma solo di wardare per sapere dove si trova il jungler nemico ... se te vedi il nemico in top side sai che lui tenerà una gank mid o top e tu potrai controgankarlo o rushare il drago;\ncmq hecarim è un ottimo champ per divare,quindi il problema del push,se i tuoi laner pokkano e traddano bene,non dovrebbe esistere ... poi va beh se ci muoiono 1v1 o 2v1 perchè hanno continuato a zoonare un nemico full vita,è colpa loro.\nsecondo me hai delle pesanti lacune in giungla,al contrario di quello che pensi,però se non ti piace e ci giochi solo perchè trovavi jungler scarsi ti consiglio di tornare top.\n\n>preferisco finche non salgo giocare top\n\nse non impari a giunglare fin da subito,più sali e più è difficile ...","replies":[{"poster":"BluCobalto92","date":"2017-04-03T15:16:38.367+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Ringiel,realm=EUW,application-id=MJVj50Jw,discussion-id=u9d08WBF,comment-id=00080000,timestamp=2017-04-03T15:02:58.957+0000)\n>\n> io non parlavo di invadere,ma solo di wardare per sapere dove si trova il jungler nemico ... se te vedi il nemico in top side sai che lui tenerà una gank mid o top e tu potrai controgankarlo o rushare il drago;\n> cmq hecarim è un ottimo champ per divare,quindi il problema del push,se i tuoi laner pokkano e traddano bene,non dovrebbe esistere ... poi va beh se ci muoiono 1v1 o 2v1 perchè hanno continuato a zoonare un nemico full vita,è colpa loro.\n> secondo me hai delle pesanti lacune in giungla,al contrario di quello che pensi,però se non ti piace e ci giochi solo perchè trovavi jungler scarsi ti consiglio di tornare top.\n> \n> se non impari a giunglare fin da subito,più sali e più è difficile ...\n\nSono convinto di avere lacune...dopo tutto gioco da neanche 6 mesi e in giungla saranno 3/4...divare con hecarim va bene ho fatto piu gank passando dalla giungla avversaria e caricare di E arrivando da dietro la torre e spingendo verso il mio team il poveretto di turno ma di certo non posso farlo a liv3 con avversari full vita\n\nQuindi io ho si delle lacune come è giusto che sia per un bronzo alla sua prima season....ma se il mio team fa di tutto per rendermi la cosa piu complicata vorra dire che in ranked gioco top e la giungla la gioco nelle normal in modo da migliorare divertendomi e senza dover ricorrere all arakiri dopo i primi 10min","replies":[]}]}]},{"poster":"P3AR","date":"2017-04-03T14:46:59.905+0000","up_votes":2,"down_votes":0,"body":"gioca in solo e risolvi il problema","replies":[]},{"poster":"DuckQuack0","date":"2017-04-03T12:15:10.542+0000","up_votes":2,"down_votes":1,"body":"Se solo non ci fosse la duo Q, sarebbe un gioco veramente migliore...\ntra l'altro esiste la flex per i team, perché scassare la minchia coi premade nella solo Q che vogliono ovviamente essere camperati, o semplicemente il tizio con 7 leghe inferiori perché è in premade\n\nTi prego Riot.\n\nE non lo dico per te, ma perché è sempre così, il premade DEVE essere camperato, lo è sempre, il resto del team non conta un cazzo, specialmente con un jungler è veramente fastidioso\nInvece i premade della bot feeddano sempre, ma sempre.","replies":[]},{"poster":"BluCobalto92","date":"2017-04-03T21:03:42.591+0000","up_votes":1,"down_votes":0,"body":"E invece si...perse 2 di fila per la promo","replies":[]},{"poster":"BluCobalto92","date":"2017-04-03T19:18:32.069+0000","up_votes":1,"down_votes":0,"body":"Forse nn faccio poi cosi skifo....9/2/11 e sono in promo","replies":[]},{"poster":"BluCobalto92","date":"2017-04-03T13:56:27.514+0000","up_votes":1,"down_votes":2,"body":"Faccio prima a tornare a giocare top e tenere la giungla come lane secondaria....tanto i consigli che mi avete dato son quelli che seguo sempre....chiedo di non pushare e di attendere la gank quando lo fanno riesco a carriare...gank si fa kill e aiuto a pushare....nel caso della bot se è gia stata presa la prima torre do priorità al drago....ma in bronzo la giungla è un inferno....io nn sono neanche silver...gioco da neanche 6 mesi....ma ho imparato a guardare la minimappa....se vedo che il jungler avversario invade e il mio chiede aiuto io vado....oggi ero abbandonato a me stesso contro un gragas bello ubriaco di kill fatte su nabbi che non facevano altro che stare pushati....non dando a me possibilita di gank e regalandole agli avversari dato che neanche wardavano\n\nDa stasera solo Q in solitaria top con darius","replies":[{"poster":"RVN Trobugno","date":"2017-04-03T14:05:25.667+0000","up_votes":1,"down_votes":1,"body":"Guarda mentre scalavo per il Gold in sta season mi sono trovato a dover lasciare per un bel po' di ranked la giungla e prendermi Yorick in Top. in bronzo e silver è troppo idiota. Splitpushi e quelli non sanno che fare.","replies":[{"poster":"BluCobalto92","date":"2017-04-03T14:10:25.429+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Trobugno,realm=EUW,application-id=MJVj50Jw,discussion-id=u9d08WBF,comment-id=00050000,timestamp=2017-04-03T14:05:25.667+0000)\n>\n> Guarda mentre scalavo per il Gold in sta season mi sono trovato a dover lasciare per un bel po&#x27; di ranked la giungla e prendermi Yorick in Top. in bronzo e silver è troppo idiota. Splitpushi e quelli non sanno che fare.\n\nMa fosse solo quello....non hanno la minima idea di cosa voglia dire freezare una lane o farmare sotto torre....pushano come dei dannati come se voglia dire che stanno vincendo solo perche sono sotto torre nemica...poi ovviamente sono preda facile e si lamentano che non ganko","replies":[{"poster":"RVN Trobugno","date":"2017-04-03T14:24:04.394+0000","up_votes":1,"down_votes":0,"body":"Tranquillo che quello accade anche in Gold anche se più di rado rispetto ai bassi fondi. Io prima mi trovavo da dio con Maokai, farmavo sotto torre e quelli restavano a guardare XD.. Dopo il nerf invece ho pensato a Yorick per lo split appunto. Però non è lo stesso di Maokai in TF. Per la giungla devi prendere dei jungler con cui puoi carriare tu, non devi fidarti degli altri del tuo team nei bassi fondi. Puoi iniziare a fidarti un pò di più in Gold ma devono dimostrartelo durante il match XD.","replies":[]}]}]}]},{"poster":"Franky Fire","date":"2017-04-03T12:34:56.533+0000","up_votes":1,"down_votes":0,"body":"Non so come siano le cose in silver, ma credo che la cosa migliore che tu possa fare, come detto sopra, è cercare di pensare alla tua partita, fare il meglio che puoi e cercare di migliorare ogni partita. Quest'anno io ho mollato un po' la giungla perché credo che in questa meta sia più facile carriare da una solo lane, e non devi contare su nessun altro se sei abbastanza bravo.\nIl jungler è invece un ruolo che può essere molto stressante al momento. Ma se ti piace, dai il massimo, e non ascoltare i flamer, e magari non giocare in ranked con persone che conosci poco :)","replies":[]},{"poster":"Dissociated","date":"2017-04-03T12:11:06.797+0000","up_votes":1,"down_votes":1,"body":"muta tutti e pensa al tuo game.\n\nmi spiace, ma la situazione non migliora fino al gold...","replies":[{"poster":"DonCavallo","date":"2017-04-03T12:24:34.040+0000","up_votes":1,"down_votes":0,"body":"e vedendo streaming vari e partite a livello alto, nemmeno...","replies":[]}]}]}