{"poster":"BluCobalto92","date":"2017-01-29T10:46:06.064+0000","title":"NEW META?","subforum":"Discussioni generali","up_votes":1,"down_votes":5,"body":"Ma sta diventando new meta giocare con 2 jungler? ...fatta una partita ieri...io ero jungler con hecarim mentre nella squadra avversaria ne avevano 2....io non riuscivo a giocare...mi rubavano la giungla e poi mi prendevano sempre in 2vs1 ovviamente e in giungla non si hanno torri per giocare safe....Al contrario della loro bot che giocava 1vs2 con la nostra ma per quanto soffrisse nn feeddava stando sotto torre\r\nAbbiano perso di brutto\r\n\r\nOggi altra partita...questa volta io ero top con darius....e il nostro team suppongo 2 premade optano per fare doppio jungler con tanto di bestemmie della nostra sivir che si ritrovava senza supp....dopo un inizio sofferto  la superiorita della nostra giungla si &egrave; fatta sentire....gankavano ovunque in coppia e trucidavano il loro jungler se lo trovavano a farmare....abbiamo stravinto...\r\n\r\nPareri?....","replies":[{"poster":"Jeanne dˆArc","date":"2017-01-29T11:02:04.843+0000","up_votes":8,"down_votes":0,"body":"In bronzo funziona di tutto e una bot che non prende vantaggio in 2v1 non merita di vincere la partita. Almeno io la penso così.\n\nIl doppio jungler non potrebbe mai diventare uno standard, perché una volta fatto il livello 3 (quindi metà giungla a testa) non avresti più nulla da farmare per minuti interi e in qualsiasi laner ti supererebbe di troppi livelli, rendendoti pressoché inutile contro di lui. \n","replies":[]},{"poster":"vondarck","date":"2017-01-30T07:52:51.948+0000","up_votes":1,"down_votes":0,"body":"no, l'utility che danno alcuni support non è sostituibile con un secondo jungler (e lo dico da main jungler)\n\ne soprattutto \"non c'è abbastanza jungla per tutti\" se avete 2 jungler uno dei 2 sarà underfarmato, a meno di frequenti invade, dovrete ricordarvi che gli alleati del jungler invasoarrivano prima degli alleati del jungle che invade (se arrivano)","replies":[]},{"poster":"fedy99","date":"2017-01-29T17:55:15.802+0000","up_votes":1,"down_votes":0,"body":"io ho fatto un mesetto fa penso due jungler con io kha zix e un altro che hai instalockato rengar,non avevamo l adcma un support leona e abbiamo vinto.Forse se top fosse un combattente e mid un mage tipo brand funzionerebbe","replies":[]},{"poster":"Nabbomaster","date":"2017-01-29T11:24:43.954+0000","up_votes":1,"down_votes":0,"body":"perche' siete in bronzo, 2vs1 top l'adc nemico non farma manco un minion, non e' questione di giocare safe, gli frizzi la lane e quello non farma con il support che si mette tra lui e i minion, se vede che i tuoi 2 bot pushavano e l'avversario farmava sotto torre","replies":[]},{"poster":"Kim114","date":"2017-01-29T11:06:11.941+0000","up_votes":2,"down_votes":2,"body":"anche io lo noto, ma con una tattica \"studiata\":\n5 premade, 2 jng 1 bot 1 mid 1 top\nAvevano un tank con ingaggio buono, uno combattente, un supporto ap bot che poteva vincere da solo (SONA ESEMPIO SPARATO), un mago e un ADC\ncombattente sostituibile con un assassino","replies":[]}]}