{"poster":"BluCobalto92","date":"2017-11-13T08:01:25.494+0000","title":"Costo campioni","subforum":"Discussioni generali","up_votes":1,"down_votes":1,"body":"Mi potreste dire il costo esatto dei campioni possedendo un loro frammento?\nIo so solo che ne ho uno di karthus che costa 3150 col frammento lo pago 1890 risparmiando 1260 BE\n\nQuindi:\n\n1350  - - - &gt; 540 = - 810\n3150  - - - &gt;  1890 = - 1260\n4800  - - - &gt; 2880 = - 1920\n6300  - - - &gt; 3780 = - 2520\n\nAggiorner&ograve; con le vostre risposte.... Grazie della collaborazione","replies":[{"poster":"Power Mac","date":"2017-11-13T08:39:11.798+0000","up_votes":1,"down_votes":0,"body":"Io ho un frammento Darius (che già possiedo), che se potessi convertire in campione pagherei 2880 EB, contro i 4800 \"di listino\". \nLo sconto è fisso quindi, ed è del 40%.","replies":[{"poster":"BluCobalto92","date":"2017-11-13T09:13:14.854+0000","up_votes":1,"down_votes":0,"body":"Ottimo grazie... Cosi sappiamo che non conviene acquistare i campioni misteriosi a 3950 in quanto possedwndo un frammento 6300 - 40% fa 3780 che è inferiore a 3950","replies":[{"poster":"Power Mac","date":"2017-11-13T09:19:37.043+0000","up_votes":1,"down_votes":0,"body":"Dipende. Il campione misterioso è un ottimo acquisto per chi ha già buona parte dei campioni (diciamo tre quarti), perché garantisce campioni costosi con un sconto consistente. È vero che disincantare un frammento costa meno, ma di poco come hai appena evidenziato, ed inoltre deve sempre uscirti un frammento di campione costoso e che ti interessi disincantare (saranno molte di più le volte in cui ti usciranno campioni che già possiedi o che non ti interessano). Io ad esempio ho solo 79 campioni, e non mi conviene, ma se tu magari ne hai molti di più, non è affatto una cattiva idea.","replies":[{"poster":"BluCobalto92","date":"2017-11-13T10:15:21.324+0000","up_votes":1,"down_votes":0,"body":"Io non sono messo meglio....\nAl momento ho 58 campioni \nMa ancora 91k BE \n\nSe non facevo questi conti però avrei gia speso tutto comprando i campioni che mi mancavano ovvero\n\n4 da 1350\n10 da 3150\nPer un totale di 36900\n\nMi restavano cosi 54100 BE\nDivise 3950 costo del campione misterioso fa 13\n\nQuindi avrei potuto rimetterci\nEventualita migliore\n13 campioni da 6300\n13x170=2210 BE\nEventualità peggiore\n13x1070=13910 BE\n\nE non sono poche\n\nHo inoltre fatto 2 conti (sono molto tirchio xD)\n\nPer acquistare tutti i campioni che mi mancano dovrei attualmente spendere 395700 BE usando i frammenti che sicuramente trovo man mano che accumulo BE risparmio il 40% come abbiamo detto spendendo 237420 BE\n\nDirei che è decisamente meglio aspettare almeno di comprare tutti quelli da 4800","replies":[{"poster":"Power Mac","date":"2017-11-13T15:25:00.318+0000","up_votes":1,"down_votes":0,"body":"Assolutamente corretto. Motivo per cui anche io mi tengo alla larga dai campioni casuali per ora. Alla fine non puoi fare altro che quello che hai detto: aspettare i frammenti, o comprare normalmente man mano quelli che davvero ti servono.","replies":[]}]}]}]}]}]}