{"poster":"BluCobalto92","date":"2017-07-06T06:26:26.998+0000","title":"Shen jng","subforum":"Campioni e gameplay","up_votes":1,"down_votes":0,"body":"Worka?\r\n\r\nOvviamente buildando gemma verde idra e poi tank","replies":[{"poster":"JRobich","date":"2017-07-06T09:52:07.274+0000","up_votes":1,"down_votes":0,"body":"perchè?\n\nci sono tanti jungler perchè giocare shen?\n\ninoltre nella giungla attuale non credo funzioni... se ti fai i raptor capace che ci muori....","replies":[{"poster":"BluCobalto92","date":"2017-07-06T18:00:54.205+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=JRobich,realm=EUW,application-id=cAOZwaUi,discussion-id=e4sVAFFB,comment-id=0001,timestamp=2017-07-06T09:52:07.274+0000)\n>\n> perchè?\n> \n> ci sono tanti jungler perchè giocare shen?\n> \n> inoltre nella giungla attuale non credo funzioni... se ti fai i raptor capace che ci muori....\n\nprovato jng....raptor fatti a liv 2 dopo il red.....ho dovuto usare una pozza ma ero a meta vita....non male direi.....se mi tengo lo smite facendomi aiutare un po di piu col red rimango anche full","replies":[]},{"poster":"BluCobalto92","date":"2017-07-06T10:02:42.944+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=JRobich,realm=EUW,application-id=cAOZwaUi,discussion-id=e4sVAFFB,comment-id=0001,timestamp=2017-07-06T09:52:07.274+0000)\n>\n> perchè?\n> \n> ci sono tanti jungler perchè giocare shen?\n> \n> inoltre nella giungla attuale non credo funzioni... se ti fai i raptor capace che ci muori....\n\nOvviamente si parla di giocare for fun...e come detto top prende botte da tutti in quanto è piu da utility....e almeno in basso elo i compagni non sanno sfeuttarlo....in secondo luogo ti direi che coi piccioni non dovrebbe avere grossi problemi grazie al buff rosso che si prende prima e all uso della Q e W...stasera lo proverò....faro gemma verde idra titanica e poi magari provo come ivern","replies":[{"poster":"Mystogan92","date":"2017-07-06T11:06:09.974+0000","up_votes":1,"down_votes":0,"body":"Se già sai usare shen, shen jung non sarà un problema. Va bene ma non eccello come gli altri. Io mi trovo bene, ma se dovessi fare ranked meglio sejuani che shen in jung. \nSembra ma se sei bravo gli ingage con la E portano ad una kill abbastanza sicura o ad un flash avversario. \nIl problema di shen top infatti è che spesso se utilizzi la R su di loro non ingaggiano, continuano a scappare.  \nPerchè scappano d@#@@can???? C'è chi capisce di non retrocedere per fortuna. Poi li ritrovi morti 2 secondi dopo che te ne sei andato. \nPerchè?? Perchè 2 vs 2 is worth  mentre 1 vs 3 è fattibile a quanto pare.\n Quanto odio il bronzo{{sticker:zombie-brand-mindblown}}","replies":[{"poster":"JRobich","date":"2017-07-06T11:11:54.058+0000","up_votes":1,"down_votes":0,"body":"sinceramente non giocherei neanche sej.....\n\nora come ora giocherei:\n{{champion:154}} {{champion:60}} {{champion:57}} {{champion:5}} {{champion:72}} \n\nsoprattutto se stai in bronzo....\n\nanzi per il bronzo pikka Xin a testa bassa e mena mena mena una volta fatto {{item:1419}} ti hai l'herald da solo...","replies":[{"poster":"Mystogan92","date":"2017-07-06T12:50:28.562+0000","up_votes":1,"down_votes":0,"body":"Secondo me sejuani è fortissima. Una macchina da CC. Ne ho \"carriate\" di partite grazie a lei","replies":[{"poster":"JRobich","date":"2017-07-06T12:52:02.938+0000","up_votes":1,"down_votes":0,"body":"io l'ho rigiocata da 2 giorni dopo il nerf ricevuto e lo stesso giorno ho rigiocato mao... mi sembra migliore mao... :)\n\nma delle volte è solo game style personale...","replies":[]}]}]},{"poster":"BluCobalto92","date":"2017-07-06T11:15:12.223+0000","up_votes":1,"down_votes":0,"body":"Ma infatti ogni volta che ulto pingo...Ma è inutile anche cosi","replies":[]}]}]},{"poster":"Mystogan92","date":"2017-07-06T11:07:35.603+0000","up_votes":1,"down_votes":0,"body":"Tranquillo che con i raptor non ci muori. La W con i raptor tanka molti danni. Fatto {{item:3751}} non saranno proprio un problema","replies":[]},{"poster":"Náos","date":"2017-07-06T10:42:56.002+0000","up_votes":1,"down_votes":0,"body":"In realtà pulisce abbastanza bene la giungla, soprattutto se al primo recall compri l'oggettimo che si trasforma nel mantello del sole (non ricordo il nome, bami qualcosa mi sembra)\nComunque sì, c'è sicuramente di meglio rispetto a lui","replies":[]}]},{"poster":"6GeMiNi9","date":"2017-07-06T12:52:55.269+0000","up_votes":1,"down_votes":0,"body":"Non ho letto gli altri commenti per mancanza di tempo.. però secondo me non è worth. Funziona meglio top (o support) e la ulti globale è un po' sprecata jng.\n\nImmagina un blitz in botlane con il jng e shen da top che ulta. Se lo metti jng togli un po' questa possibilità (si ok il tp del top laner.. ma non è la stessa cosa)","replies":[]},{"poster":"BluCobalto92","date":"2017-07-06T10:14:27.948+0000","up_votes":1,"down_votes":0,"body":"Support ha effettivamente dei lati positivi ma nn mi piace per 2 cose....nn puoi prendere il tp\nE di conseguenza la ulti o la usi sul tuo adc che si ritroverà si scudato ma da solo in quanto shen canalizza per 3 sec oppure la usi per andare altrove e senza tp poi ti tocca fartela a piedi e nel frattempo il tuo adc è da solo....top come detto al momento non se la passa bene.....mi resta da provare jng....tanto si parla di normal for fun e ho voglia di giocarlo perche ho trovato la skin ghiacciolo","replies":[]},{"poster":"vondarck","date":"2017-07-06T10:07:24.996+0000","up_votes":1,"down_votes":0,"body":"Viabile ma le 3 vanguard reworkate recentemente gli sono sopra (senza contare nunu-ivern-gragas)\n\nIl problema di shen jung è che non c'è effettivamente un motivo valido per cui pikkarlo (quantomeno in jung)\nA quel punto puoi tenerlo a top col tp che worka lostesso\n\nPiuttosto support","replies":[]},{"poster":"supergrimm88","date":"2017-07-06T07:13:46.271+0000","up_votes":1,"down_votes":0,"body":"Shen jng non è molto forte la E non ha un grosso range e è difficile fare il taunted, 400 volte meglio top\nP.S. ch e idra intendi tu?","replies":[{"poster":"BluCobalto92","date":"2017-07-06T07:33:43.412+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=supergrimm88,realm=EUW,application-id=cAOZwaUi,discussion-id=e4sVAFFB,comment-id=0000,timestamp=2017-07-06T07:13:46.271+0000)\n>\n> Shen jng non è molto forte la E non ha un grosso range e è difficile fare il taunted, 400 volte meglio top\n> P.S. ch e idra intendi tu?\n\nTitanica....pensavo una build tipo\n\n{{item:1401}} {{item:3748}} {{item:3190}} piu stivali e poi situazionali tank\n\nKmq lo proverò jng....top nn mi ci trovo molto bene....ultimamente la gente predilige top offensivi ai classici tank e senza un jng che mi ganka da supportare nn riesco a fare grandi cose....jng invece dovrebbe funzionare....e si riesce anche a usare meglio la ulti","replies":[{"poster":"Mystogan92","date":"2017-07-06T09:47:35.947+0000","up_votes":1,"down_votes":0,"body":"jung lo uso. Puoi ingaggiare anche a lv 3 con la E. Ma se missi quella spell sei nei guai. \nPrimi item: {{item:1041}} {{item:2031}} \nprimo recall: {{item:3751}} . \nPoi finisci {{item:1401}},  vai con {{item:3077}} e termini l'idra. {{item:3083}}  e buildi qualche resistenza in base al team nemico (idem gli stivali a tua scelta in base al team). \nFa i campi abbastanza velocemente e riesce ad uscire senza troppi danni grazie alla passiva che scuda e la W. Starta dal red. Se vedi che la passiva è disponibile tra 2 sec e la Q è disponibile, aspetta per sfruttare la passiva ( se il mostro nemico è morto killalo ovvio, non aspettare). \nSe vuoi fare il drago o l'elder fatti aiutare da qualcuno o lo killerai l'anno prossimo.\nIo mi trovo bene jungle e supp con shen, il suo ruolo è top, ma al momento viene stompato un po' da tutti i top laner attuali. \nPazienza ti renderai utile in team.\nI suoi danni iniziali di Q molti li sottovalutano ma sono alti. Il problema è dopo hai pochi danni. Devi pokkalri continuamente e aspettare il momento giusto per killarli. Ma chmap come darius e llaoi lo distruggono top.","replies":[]}]}]}]}