{"poster":"MSF Akito","date":"2019-11-21T17:19:14.578+0000","title":"Bots im ARAM (Da 3v3 nicht mehr da ist)","subforum":"Karten & Spielmodi","up_votes":1,"down_votes":0,"body":"Yo,\r\n\r\nich frage mich nach wie vor, ob es nötig war 3v3 abzuschaffen. Ja, da waren viele Bots, aber der Modus war trotzdem nett um Champions zu testen oder einfach nur random Builds auszuprobieren. Jetzt ist 3v3 weg &amp; die Bots aus dem 3v3 sind jetzt in jedem ARAM vertreten. Heißt: Es gibt keinen Modus mehr, den man zwischendurch spielen kann, ohne dass man von irgendwas genervt ist. Wem hätte es wehgetan 3v3 im Spiel zu behalten? Wohl niemandem. Jetzt tut es aber den anderen Modi UND den Spielern, die 3v3 mochten weh, dass es abgeschafft wurde. \r\nLetzten Endes war es Riots Entscheidung, den Modus abzuschaffen. Dann sorgt wenigstens dafür, dass man OHNE Bots spielen kann.","replies":[{"poster":"AramStufe Rot","date":"2019-11-21T19:32:52.646+0000","up_votes":1,"down_votes":1,"body":"keine ahnung was du da redest\nich spiel jeden tag aram und mir is kein bot untergekommen","replies":[{"poster":"DragonOdem","date":"2019-11-21T19:51:50.702+0000","up_votes":2,"down_votes":1,"body":"Habe im ARAM bisher auch noch nie einen Bot gesehen...obwohl, vielleicht 1x... in 6Jahren LoL - oder wie lange auch immer es ARAM schon gibt. Zumal BOTs im ARAM auch schneller/einfacher auffallen und häufiger reported werden würden als in \"Bot\"-Games ( also Spiele gegen Bots von RITO )","replies":[{"poster":"Saliera","date":"2019-11-22T18:24:10.359+0000","up_votes":1,"down_votes":0,"body":"bots im aram gab es schon immer. hab teilweise spiele mit 8 bots und jeweils einem spieler pro seite gehabt. kann lustig sein, aber meistens ist es für ein team einfach nur das todesurteil. die leistung der bots ist inzwischen deutlich besser geworden, deshalb fallen die im vergleich zu schlechten spielern nichtmehr so extrem auf. die aktuellen rennen nicht mehr einfach rein und sterben. die haben inzwischen ne wegfindung und halten sich von der frontline möglichst fern. wenn man weiß worauf man achten muss, erkennt man die accounts schnell. da riot nur in wellen bannt, helfen die reports der botaccounts auch nicht wirklich. die sind noch monate da, bevor dann plötzlich alle auf einmal weg sind.\n\nachtet mal aktuell auf die accounts die level 28 bis 33 sind, standartsumms oder spells die nicht zum champ passen drin haben, oft die standardtankrune. namen sind meistens ein internationaler frauen oder männername und eine buchstabenkombination. die champs laufen erst sehr spät von der plattform und halten sich im spiel meistens zwischen den beiden towern auf. die laufen im spiel auch oft bis zum nexus zurück, obwohl selbst der erste tower noch steht. kann man schnell für einfache anfänger halten, bis man die wegfindung der bots durchschaut. die ults werden meistens außerhalb von teamfights einfach auf cd gezogen. im chat werden häufig stats gespammt, obwohl total low. am häufigsten trifft man bots in der woche, morgens ab 4 oder 5 bis in den vormittag. vor allem wenn ihr selber nicht so häufig aram spielt und deshalb die mmr nicht so bombe ist.\n\nachso und die ladezeiten in den spielen sind deutlich länger. der botaccount läd sich nicht aus europa rein.","replies":[]}]}]},{"poster":"CG Mörglife","date":"2019-11-25T08:42:44.558+0000","up_votes":1,"down_votes":0,"body":"Ganz blöd gesagt: kein Schwein spielt aktiv 3v3.\nWarum soll Riot einen gamemode im Spiel halten, wenn er sich wirtschaftlich nicht rentiert.\nFrüher gab es nur die alte 3v3 und 5v5 map. Die alte 3v3 Map wurde sehr gerne gespielt, dann kam die neue 3v3 map und gefühlt jeder hat nur noch 5v5 gespielt.\n\nWenn URF kein permanenter Modus sein kann weil er sich \"nicht rentiert\" dann rentiert sich 3v3 bei weitem weniger.\n\nBuilds testen, neue Champions testen usw. tu ich im Practice Tool und in normal games.\nDafür sind mMn normal games da. Um mal nicht zu tryharden und neues aus zu probieren.\n\nErst letztens wurde ich auf meinem smurf aufs übelste geflamed, weil ich mal ein neues Build auf Yasuo testen wollte und demnach jetzt nicht grade gute stats hatte.\nReally? Auf einem Level 14 Account in normal games tryharden? Meine güte.","replies":[{"poster":"MSF Akito","date":"2019-11-25T17:06:55.866+0000","up_votes":1,"down_votes":0,"body":"Ich übersetz mal.\nKein Schwein spielt aktiv 3v3 = DU spielst kein 3v3? \n\nEs gibt (bzw gab) eine aktive 3v3 Community. Natürlich war sie nicht so groß wie SR, aber sie war da. Und ja, die neue 3v3 Map kam weniger gut an, da gebe ich dir recht. Das letzte große Update liegt aber schon mehr als 3 Jahre zurück. Riot hat sich also nichtmal bemüht, die Karte attraktiver zu machen. Und oft waren die Wartezeiten im 3v3 sogar kürzer als SR. Also muss es ja irgendwo Spieler gegeben haben, die 3v3 gespielt haben. Zu argumentieren, \"dass niemand 3v3 spielt\" ohne die Zahlen zu kennen finde ich da ziemlich doof. Das Problem mit LoL ist, dass die Möglichkeiten, wie man das Spiel spielt mit den Jahren immer weniger wurden. Was spricht also gegen einen netten kleinen competetive Modus neben SR? Und wie du selber sagst: Wenn du in Normals builds testet, dann gibt es immer Leute die flamen. In 3v3 hat es nie jemand gestört wie man spielt. Dazu kommt, dass 3v3 kürzere Spielzeiten hat. Ich will zum testen nicht gezwungen sein bis zu ~45 min in einem Normal zu hängen.","replies":[{"poster":"CG Mörglife","date":"2019-11-26T10:52:36.657+0000","up_votes":1,"down_votes":0,"body":"Ich find die Grafik gerade nicht, aber Riot hat das (glaube als 3v3 verabschiedet wurde) mal anhand einer Grafik gezeigt, dass die Spielerzahlen in 3v3 unterirdisch sind. Selbst ARAM wird konstanter gespielt.\n\nFür Riot heißt ein Gamemode mehr = Mehr Auslastung, mehr Updates, demnach mehr Arbeit und schlussfolgerlich mehr Kosten.\nWenn es nun verhältnismäßig \"keiner\" (dachte wenn ich schreibe \"keiner spielt 3v3\" ist schon klar dass ich damit \"sehr wenig\" meine) mehr spielt, sind das nur unnötige Kosten, die Riot vor Tencent verantworten muss.\nIch glaube 3v3 wurde nur solange am Leben gehalten, weil es eben zusammen mit 5v5 eines der ersten Gamemodes war.\nWie gesagt, ich habe die alte 3v3 map geliebt (Season 1) aber nach den Changes nie wieder angefasst.\n\nMir ist schon klar, dass es Leute gibt die die Map immer gespielt haben, aber eben verhältnismäßig wenige. Ich würde liebend gerne die Grafik hier einfügen aber wie gesagt, ich finde sie nicht mehr.\n\nIn 3v3 flamen Leute genau so wie in 5v5. Das ist die Spielerbase, nicht die Map die das ausmacht.","replies":[]}]}]},{"poster":"Phoenixale","date":"2019-11-21T23:24:38.959+0000","up_votes":1,"down_votes":0,"body":"Bots gab es nur in 3on3 Normals. Das aber auch nur weil es zu wenige Spieler für die Gruppenfindung gab. Lag aber auch daran, dass man keine Vorteile hatte 3on3 Normals zu Spielen. Die meisten Missionen und Events konntest du auf dieser Map nicht abschließen. Die drei bzw. sechs Bans waren auch überflüssig, da diese in der sonst so breiten Championauswahl keinen Einfluss auf das Spiel hatten. \n\nAchja... In 3on3 Rankeds bin ich nie auf einen Bot gestoßen.\n\nIm Aram gab es und gibt es auch immer noch genügend Bots, auf die man trifft, wenn man zu bestimmten Zeiten spielt, zu denen nur wenige Leute online sind. Daran hat sich nichts geändert.\n\nUnd zu dem Thema warum es diese Bots überhaupt gibt und warum Riot sie nicht bannt. Genau aus dem oben implizierten Grund - Damit du schneller ein Match findest und nicht erst 30 Minuten lang warten musst. Daher ist also anzunehmen, dass Riot selbst diese Bots duldet und selbst einsetzt. Dadurch ist der Anschein einer popularisierten Welt zu jeder Tageszeit gegeben.","replies":[{"poster":"Saliera","date":"2019-11-22T19:03:05.543+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Phoenixale,realm=EUW,application-id=cGRapXds,discussion-id=pFiHL3MU,comment-id=0001,timestamp=2019-11-21T23:24:38.959+0000)\n> \n> Und zu dem Thema warum es diese Bots überhaupt gibt und warum Riot sie nicht bannt. Genau aus dem oben implizierten Grund - Damit du schneller ein Match findest und nicht erst 30 Minuten lang warten musst. Daher ist also anzunehmen, dass Riot selbst diese Bots duldet und selbst einsetzt. Dadurch ist der Anschein einer popularisierten Welt zu jeder Tageszeit gegeben.\n\neigentlich werden die bots in wellen gebannt, weil das die accounts sind, die du für ein paar euro bei ebay kaufen kannst. ständig direkt bannen, würde nur dazu führen, dass die programmierer sich schneller anpassen und einfach mehr bots laufen lassen, die man wieder nicht erkennen kann. umso länger die version läuft, desto mehr von denen kannst du sicher indentifizieren. auf die art wie es jetzt ist, werden die accounts gebannt, nachdem sie vermutlich schon verkauft sind. du triffst also auch den käufer damit, der sich beim nächsten mal überlegen wird, ob er dafür geld ausgibt.\n\ndas mit den wartezeiten kannst du knicken. wenn riot sowas machen würde, wären die deutlich kürzer, auch donnerstagmorgen um 5 uhr. das sind alles chinafarmer.","replies":[]}]},{"poster":"Plocký","date":"2019-11-21T23:25:40.810+0000","up_votes":1,"down_votes":0,"body":"Kann ich bestätigen, und das ist wahrscheinlich auch der grund für de extem laggy client gerade,","replies":[]}]}