{"poster":"Timothy D","date":"2016-05-30T13:44:10.159+0000","title":"ICH UND MEINE PREMADES - Deutscher LoL Song!","subforum":"Streams & YouTube","embed":{"description":"► Gefällt dir das Video? Zeige es mit deinem Daumen nach oben oder abonniere direkt: http://goo.gl/LYzghi ► Facebook, Twitter meinen Livestream und Lyrics findet ihr in der Videobeschreibung: Ihr findet mich auf: ► Folgt mir auf Twitter: https://twitter.com/TimothyDece, ► Facebook: https://www.facebook.com/TimothyDOffical ► Lust mit mir zu quatschen?","url":"https://www.youtube.com/watch?v=-9NqRjCusEU","image":"https://i.ytimg.com/vi/-9NqRjCusEU/hqdefault.jpg"},"up_votes":22,"down_votes":7,"body":"Heyho,\r\n\r\nw&uuml;rde mich unglaublich dolle freuen, wenn ihr meinen neuen League of Legends Song &quot;Ich und meine Premades&quot; abcheckt und mir dazu eure Meinung verratet. :)\r\n\r\n\r\nBest Regards\r\nTimothy D","replies":[{"poster":"Der Timmybert","date":"2016-05-30T15:12:11.219+0000","up_votes":11,"down_votes":1,"body":"Ich finde den Song immer noch geil, egal wie oft ich ihn mir anhöre. Vor allem liegt mir dieses Lied am Herzen, einfach weil ich jetzt keine gute Elo habe (Bronze), aber dieses Lied gibt mir das Gefühl, dass ich mit meinen Freunden aufsteigen kann und Carryn kann, danke dafür du Esel :D. Ich freu mich auf die nächsten Lieder den ich wweß das er mich nicht enttäuschen wird, denn eigentlich alles was er macht ist auf eine gewisse Art und Weise einzigartig denn, ich finde es schon bewundernswert, dass es so viele Leute gbt die normal Stuff mache, Gameplays und ganz normale Songs, aber UNSER Esel schafft es etwas neues zu erschaffen und das feier ich an ihm HART. Denn er hat wirklich viel Potential und dass merkt man in seinen Texten, die sowohl mitfühlend aber auch gut angepasst auf LoL und seine richtig coole Kommunity sind. Dass freut mich, dass so gute Kontent nicht vergeht denn egal wie viel schlechte Sachen es auf der Welt gibt, es wird IMMER gut Dinge geben und eine Timothy D aka. THOMAS ist bzw. macht so ein gute Sache :D. GG WP LEUTE.","replies":[{"poster":"Timothy D","date":"2016-05-31T19:37:09.279+0000","up_votes":6,"down_votes":1,"body":"<3 :D","replies":[]}]},{"poster":"Gandoer","date":"2016-05-30T13:45:54.743+0000","up_votes":11,"down_votes":2,"body":"Geiler Song, aber nicht nur der sondern auch alle Songs von ihm!","replies":[]},{"poster":"Der Timmybert","date":"2016-05-30T13:48:26.922+0000","up_votes":10,"down_votes":2,"body":"NOOB SAGT GEIL, das ist das gleiche wie #Freiheit vom Gefühl her. Ich mag das Lied weil der Sound richtig chillig ist. Es gefällt mir so einen kleinen und guten Youtuber unterstützen zu dürfen. ich hoffe das dieses Video oft gelikt wird denn ich feiere es und ich denke die meisten von euch auch #WAAC we all are carrys GG WP Timothy D","replies":[]},{"poster":"Game of Thr0ws","date":"2016-05-30T14:17:55.380+0000","up_votes":5,"down_votes":11,"body":"\"Der Esel nennt sich immer zuerst\". Es muss heißen \"Meine Premades und ich\" - nicht andersherum.","replies":[{"poster":"Timothy D","date":"2016-05-30T14:43:49.730+0000","up_votes":12,"down_votes":4,"body":"nein, muss es nicht :D","replies":[{"poster":"Game of Thr0ws","date":"2016-05-30T19:30:26.292+0000","up_votes":4,"down_votes":10,"body":"Gut, dass du dich auskennst.","replies":[{"poster":"Dela The Rascal","date":"2016-05-31T17:24:52.737+0000","up_votes":11,"down_votes":4,"body":"Du anscheinend ja nicht  denn in der Kunst ist alles erlaubt. Wenn man schon Klugscheisst sollte man das wissen .. meine güte","replies":[{"poster":"Game of Thr0ws","date":"2016-05-31T17:29:51.979+0000","up_votes":5,"down_votes":10,"body":"Nein, in der Kunst ist eben nicht alles erlaubt: Lieder mit Nazi Parolen sind auch verboten. Darüber hinaus hat das was mit Manieren und nichts mit Kunst zu tun, wobei man hier überhaupt diskutieren müsste, inwiefern und ob man diesen Song schon als \"Kunst\" ansehen kann.","replies":[{"poster":"Timothy D","date":"2016-05-31T19:35:01.700+0000","up_votes":10,"down_votes":3,"body":"dein Ernst, dass du wegen sowas rumheulst? Wenn du an meinem Song nichts anderes zu kritisieren findest, musst du dich eben an dem Titel vergreifen oder wie? :D \n\nIn der deutschen Grammatik gibt es keine derartige Regel, also informiere du dich besser bevor du im Internet deine Mitmenschen belästigst. :D","replies":[{"poster":"Game of Thr0ws","date":"2016-05-31T20:07:44.525+0000","up_votes":4,"down_votes":10,"body":"1. Das hat nix mit Grammatik zu tun. Ich schlage vor, dass du dich zunächst mal über einige Dinge informierst.\n\n2. Das ist ein Forum. Dort darf jeder seine Meinung frei äußern, oder hast du da etwas dagegen?\n\n3. Ich habe mir deinen Song nicht mal angehört und werde es aller Voraussicht nach auch nicht tun.\n\n4. Die Art und Weise mit welcher Aggressivität du gegen absolut harmlose Kommentare vorgehst, lassen mich stark daran zweifeln, ob es eine sinnvolle Beschäftigung für dich ist \"Community-Projekte\", wie Songs zu machen. \"Künstler\", die nicht objektiv mit Kritik umgehen können, werden sich nicht lange in dem Gewerbe halten können - den Tipp gebe ich dir frei Haus.","replies":[{"poster":"Timothy D","date":"2016-05-31T21:02:07.493+0000","up_votes":10,"down_votes":4,"body":"1. Du widersprichst dir mit dieser Aussage selber.\n\n2. Das ist ein Forum. Dort darf jeder seine Meinung frei äußern, oder hast du etwas dagegen?\n\n3. Wenn du dir den Song nicht einmal angehört hast, was gibt dir das Recht über diesen zu urteilen?\n\n4. Wo habe ich in deinen Augen bitte aggressiv reagiert? Ich habe mich lediglich über dich lustig gemacht, weil deine Aussagen komplett aus der Luft gegriffen sind und nicht im Ansatz irgend eine Weise Bestand haben. Wenn das Einzige was du an einem Song kritisierst eine \"der Esel nennt sich immer zuerst\"- Grundlage ist, dann hast du keine Ahnung wovon du redest wenn du es auf Musik beziehst. Wenn es ja so falsch ist, dann renn schnellstmöglich zu deinem Anwalt, denn \"SIDO\" hat sein Album nämlich \"Ich und meine Maske\" und nicht \"Meine Maske und Ich\" genannt. Ebenso darfst du nicht vergessen \"HAFTBEFEHL\" mit auf deine Liste zu setzen. Auch er hat einen Song \"Ich und meine Sonnenbrille\" und nicht \"Meine Sonnenbrille und Ich\". Könnte dir jetzt 15.286 weitere Beispiele nennen, aber da du höchstwahrscheinlich nicht einmal im Ansatz verstehst was ich hier schreibe, wird das meinen Standpunkt dir gegenüber wohl auch nicht weiter verdeutlichen.\n\n5. Ich kann sehr wohl mit Kritik umgehen, wenn aber irgendjemand wie du aus dem Internet denkt, er kann mich in Dingen kritisieren die einfach nicht der Wahrheit entsprechen und wie du in keinster Weise Bezug auf Stilmittel in der Musik haben, muss ich solche Sachen einfach klar stellen.\n\n6. Wenn du keine Ahnung von Dingen hast, würde ich mich dazu auch nicht äußern - den Tipp gebe ich dir frei Haus.","replies":[{"poster":"Game of Thr0ws","date":"2016-05-31T21:25:46.329+0000","up_votes":4,"down_votes":9,"body":"Ich habe nicht über den Song geurteilt, sondern über den Titel. Du stellst dich also mit Sido und Haftbefehl auf eine Stufe. In etwa dort würde ich dich in einigen Bereichen auch einschätzen. Über die Rolle von Sido und Haftbefehl als Beitrag zu Kunst und Kultur gibt es sicherlich weit auseinander gehende Meinungen.\n\n> Ich habe mich lediglich über dich lustig gemacht\n\n ..mit anderen Worten, in der Sprache von League of Legends ausgedrückt: Du bist toxic.\n\n> Ich kann sehr wohl mit Kritik umgehen, wenn aber irgendjemand wie du aus dem Internet denkt, er kann mich in Dingen kritisieren die einfach nicht der Wahrheit entsprechen und wie du in keinster Weise Bezug auf Stilmittel in der Musik haben, muss ich solche Sachen einfach klar stellen.\n\nNein. Das, was du machst ist genau das Gegenteil von \"Umgang mit Kritik\" - Du verträgst die Kritik nicht und beginnst mich haltlos zu beleidigen. Welche Dinge, die ich gesagt habe entsprechen nicht der Wahrheit? - Die Sache mit dem Esel? Nein tut mir Leid, genau das ist der Fall. Es ist unhöflich sich in einer Gruppe zuerst selbst zu nennen.\n\nNenne mir mal fünf in der Musik und Dichtung verwendete Stilmittel mit jeweils einem  Beispiel. Ich hege starke Zweifel, dass du in der Lage bist mich über stilistische Mittel zu unterrichten.","replies":[{"poster":"Timothy D","date":"2016-06-01T05:48:19.373+0000","up_votes":10,"down_votes":1,"body":"Aha, also der Titel des Songs hat mit dem Song nichts zu tun? Nice, da ist jemand erfahrender Experte auf dem Gebiet, aber was anderes konnte ich mir nach deinen durchdachten Aussagen mit Bezug und Überzeugungskraft auch nicht denken. Ich habe mich zwar nicht mit Haftbefehl und Sido gleichstellen wollen, aber wenn du das für übernimmst bedanke ich mich dafür an dieser Stelle und fühle mich geehrt!\n\nNein, ich bin das Gegenteil von toxic. Wenn ich mich mit einem guten Grund über dich lustig mache, weil du offensichtlich nichts in diesem Bereich zu suchen hast, hat das nichts mit toxicness zu tun. Du würdest als KFZ-Mechaniker sicherlich auch durchaus abgeneigt zu einer Person sein, die auf dem Gebiet keinerlei Ahnung hat und dir etwas von Autos erzählen möchte. \n\n\"Kritik\". Es gibt in der deutschen Sprache keine derartige Regel, also ist es auch nicht falsch. Umgangssprachlich wird das durchaus gemacht, mich eingeschlossen aber warum sagst du, dass es \"falsch\" ist, ist es doch offensichtlich nicht? \n\nUnd aus welchem Grund sollte ich dir nun fünf weitere Stilmittel aufzählen, wenn du es nicht einmal verstehst wieso man in einem Songtitel das \"Ich\" an den Anfang setzt. \n\nAchja, mit Beginn dieser Diskussion möchte ich dir außerdem noch den \"You must be fun at parties\"- Award überreichen, du hast ihn dir verdient. Bleib so wie du bist.","replies":[{"poster":"Game of Thr0ws","date":"2016-06-01T06:57:47.265+0000","up_votes":1,"down_votes":5,"body":"> Aha, also der Titel des Songs hat mit dem Song nichts zu tun? Nice, da ist jemand erfahrender Experte auf dem Gebiet, aber was anderes konnte ich mir nach deinen durchdachten Aussagen mit Bezug und Überzeugungskraft auch nicht denken.\n\nHabe ich nie behauptet. Wie kommst du auf diese Aussage?\n\n> Nein, ich bin das Gegenteil von toxic. Wenn ich mich mit einem guten Grund über dich lustig mache, weil du offensichtlich nichts in diesem Bereich zu suchen hast, hat das nichts mit toxicness zu tun\n\nTut mir Leid, aber da irrst du dich. Dein bisheriges Verhalten gleicht in vielen Punkten dem Verhalten derer, die für solches eine Strafe in League of Legends erhalten würden. Woher willst du wissen, dass ich \"in dem Bereich nichts zu suchen habe\"? Ein KFZ-Mechaniker würde allerdings versuchen mich mit Argumenten oder handfesten Tatsachen davon zu überzeugen, warum meine über Aussagen getroffenen Aussagen nicht stimmen bzw. diese berichtigen. Darüber hinaus hinkt der Vergleich erheblich, da man einem KFZ-Mechaniker stets das fachliche Wissen auf seinem Gebiet anhand eines Gesellen- oder Meisterbriefs etc. nachweisen kann.\nEs ist darüberhinaus keine sonderlich kluge Strategie in einer Argumentation einfach das Gegenteil von meiner Meinung zu wiederholen und komplett auf Argumente zu verzichten. Ebenso der übermäßige Gebrauch von \"offensichtlich\" ohne eine Basis von Argumenten wirkt im Gesamtkontext unglaubwürdig.\n\n\n> \"Kritik\". Es gibt in der deutschen Sprache keine derartige Regel, also ist es auch nicht falsch. Umgangssprachlich wird das durchaus gemacht, mich eingeschlossen aber warum sagst du, dass es \"falsch\" ist, ist es doch offensichtlich nicht?\n\nDer Abschnitt ist konfus formuliert und ergibt keinen Sinn. Zu dem, was ich daraus verstehe, sage ich Folgendes: Mein Kritikpunkt hat nichts mit Sprache oder Grammatik zu tun. Darüber zu argumentieren hilft dir für dein Vorhaben wenig bis gar nicht.\n\n\n> Und aus welchem Grund sollte ich dir nun fünf weitere Stilmittel aufzählen, wenn du es nicht einmal verstehst wieso man in einem Songtitel das \"Ich\" an den Anfang setzt.\n\nMusst du nicht mehr. Dein bisheriges Verhalten disqualifiziert dich mittlerweile von der Chance, deine Reputation über Rhetorik dadurch retten zu können.\n\n> Achja, mit Beginn dieser Diskussion möchte ich dir außerdem noch den \"You must be fun at parties\"- Award überreichen, du hast ihn dir verdient. Bleib so wie du bist.\n\nDanke, aber die Diskussion ist für mich an dieser Stelle beendet. Darf ich trotzdem mal fragen, wie alt du bist?","replies":[{"poster":"Timothy D","date":"2016-06-01T08:45:00.693+0000","up_votes":5,"down_votes":1,"body":"\"Ich habe nicht über den Song geurteilt, sondern über den Titel.\" \n\n\"Aha, also der Titel des Songs hat mit dem Song nichts zu tun? Nice, da ist jemand erfahrender Experte auf dem Gebiet, aber was anderes konnte ich mir nach deinen durchdachten Aussagen mit Bezug und Überzeugungskraft auch nicht denken.\" \n\n\"Habe ich nie behauptet. Wie kommst du auf diese Aussage?\" \n -Game of Throws, 2016, Internetpolizist\n\n\nNein, tut es nicht. Verwenden wir einfach dein Beispiel. Wie du behauptet hast gibt es keine Freiheit in der Kunst für Nazis etc.. Um dies nun auf dein Beispiel zu beziehen, kann ich mich also durchaus über Rechtsradikale lustig mache, ohne dabei toxic zu sein. Das selbe gilt ebenfalls für dich.\n\nEs ist durchaus eine sinnvolle und auch durchaus erfolgreiche Strategie, wie man an unserer Diskussion ja offensichtlich erkennen kann. Aber wie es sich durch deine vorherigen Aussagen bereist manifestiert hat, hast du keinerlei Bezug auf Lyrik und ihrer Wirkung in Sprache. Daher kannst du das auch gar nicht nachvollziehen, mein Fehler. \nAber deine Strategie finde ich sehr interessant, in deinen Antworten ca. 80% meiner Argumente nicht einmal zu erwähnen. Aber wenn man keine Chance hat sie in irgendeiner Weise zu entkräften, ist das vielleicht doch das Sinnvollste. \n\n\"Musst du nicht mehr. Dein bisheriges Verhalten disqualifiziert dich mittlerweile von der Chance, deine Reputation über Rhetorik dadurch retten zu können.\" -> ?\n\nHabe doch bereits erwähnt, dass es nicht im Entferntesten Sinn ergibt, dir etwas zu erklären, wovon du nicht den Hauch einer Ahnung hast. Aber dennoch danke für die Disqualifikation, jetzt bist du auch noch Schiedsrichter, nice!\n\n\nFreut mich, dass du diesen Preis annimmst, du hast ihn dir auch verdient! \nEndlich kann ich nun auch etwas positives über dein Verhalten äußern. Ich finde es durchaus erwachsen von dir, die Diskussion nun zu verlassen. Denn sind wir ehrlich: Damit ersparst du es dir dich hier weiter zu blamieren. Und um mein Alter herauszufinden: Da du sicherlich nicht nur Internetpolizist, Schiedsrichtiger sondern auch Internetdetetktiv bist, sollte das für dich nicht allzu schwierig sein es zu erfahren. \n\n\nGGWP, jeder verliert mal in einer Diskussion. Aber wenn du es weiter probieren möchtest findest du hier sicherlich noch andere Postings aus der Community, die du in irgendeiner Form mit aus der Luft gegriffener Kritik belästigen kannst.","replies":[{"poster":"Game of Thr0ws","date":"2016-06-01T09:39:21.425+0000","up_votes":1,"down_votes":5,"body":"Sehr nett. Abschließend noch einige Korrekturen, damit kein Leser mit unkommentierten Unwahrheiten gequält wird.\n\n> \"Ich habe nicht über den Song geurteilt, sondern über den Titel.\"\n\n>\"Aha, also der Titel des Songs hat mit dem Song nichts zu tun? Nice, da ist jemand >erfahrender Experte auf dem Gebiet, aber was anderes konnte ich mir nach deinen >durchdachten Aussagen mit Bezug und Überzeugungskraft auch nicht denken.\"\n\n>\"Habe ich nie behauptet. Wie kommst du auf diese Aussage?\"\n>-Game of Throws, 2016, Internetpolizist\n\nJetzt behauptest du der Song wäre das gleiche wie der Songtitel. Warum gäbe es dann überhaupt noch Songtexte, wenn deiner Meinung nach der Songtext und der Titel exakt dasselbe sind? Der Patzer in deiner Argumentation ist mehr als offensichtlich.\n\n> Wie du behauptet hast gibt es keine Freiheit in der Kunst für Nazis etc.. \n\nDas habe ich nicht gesagt. Rede- und Meinungsfreiheit gibt es in Deutschland für jeden, auch für Nazis. Wieder eine böswillige Unterstellung deinerseits, die wahrscheinlich das Ergebnis einer schlampigen Recherche  ist. Ich habe lediglich gesagt, dass rechtsradikale Parolen nicht erlaubt sind. Die haben im Übrigen in der Regel auch nichts mehr mit Meinungsfreiheit zu tun.\n\n> kann ich mich also durchaus über Rechtsradikale lustig mache, ohne dabei toxic zu sein.\n\nEventuell kann man das machen. Was du machst, geht allerdings über Satire hinaus. Du wirst persönlich und beleidigst mich. Das verletzt sowohl die Forenregeln als auch den \"Weg der Beschwörer\". Damit bist du toxic, strikt im Sinne der Definition von Riot.\n\n> Es ist durchaus eine sinnvolle und auch durchaus erfolgreiche Strategie, wie man an unserer Diskussion ja offensichtlich erkennen kann.\n\nIch denke du bist da relativ alleine mit deiner Meinung. Es ist eigentlich auch ein wenig lachhaft bei deinem Vorgehen, welches komplett auf Argumente zu verzichtet und nur die Negation des Gegenübers nachplappert, überhaupt von \"Strategie\" zu reden.\n\n\n> Aber deine Strategie finde ich sehr interessant, in deinen Antworten ca. 80% meiner Argumente nicht einmal zu erwähnen. Aber wenn man keine Chance hat sie in irgendeiner Weise zu entkräften, ist das vielleicht doch das Sinnvollste.\n\n80% deiner \"Argumente\"? Was sind denn 80% von Null ?- Immer noch Null. Und damit gehe ich mathematisch gesehen auf 100% deiner Argumente ein. Du kritisiert wohl eher, dass ich nicht auf jede deiner Beleidigungen eingehe.\n\n\n> Habe doch bereits erwähnt, dass es nicht im Entferntesten Sinn ergibt, dir etwas zu erklären, wovon du nicht den Hauch einer Ahnung hast. Aber dennoch danke für die Disqualifikation, jetzt bist du auch noch Schiedsrichter, nice!\n\nIch verweise zu dieser Beleididung kommentarlos auf folgenden [Artikel ](https://de.wikipedia.org/wiki/Dunning-Kruger-Effekt).\n\n\n\nWie oft willst du dich eigentlich noch entwaffnen lassen, bevor es genug ist?\nDenkst du, es ist gute Publicity für dich, wenn die Leute sehen, wie du andere Nutzer persönlich angreifst?","replies":[{"poster":"Timothy D","date":"2016-06-01T12:40:54.252+0000","up_votes":5,"down_votes":1,"body":"Natürlich hat das etwas mit Interpretationsfähigkeit zu tun. Warum, erkläre ich dir jetzt einfach mal nicht, kannst also nun damit beginnen dieses \"Fremdwort\" zu googlen, glaube aber allerdings das dieses Wort nur für dich ein Fremdwort ist. \n\nAlso du sagst, ich hätte die Votes manipuliert. Hätte ich in deiner Situation auch behauptet, sowas habe ich schon vorausgesehen. Das ist aber total natürlich, wenn man selber nicht der Grund ist, warum man sich unbeliebt macht, sind es eben die Anderen. Klassischer Move von Personen in deiner Situation und meist das erste Zeichen, wenn jemand mit seinem Standpunkt auf verlorenem Posten steht.\n\nWas erzählst du denn da schon wieder? Natürlich beurteilst du den Song damit!\nTitel und Text sind nämlich nicht zwei unterschiedliche Dinge, sie hängen nämlich unmittelbar zusammen. Du machst es mit jeder Zeile die du tippst einfach nur noch schlimmer, Mate. Seit wann gehört der Titel eines Songs, nicht zum Song? Daran erkenne ich nun zum 420. Mal, dass du wirklich genau gar keine Ahnung hast wovon du redest. Ich kann dir als kleinen Tipp vielleicht mit auf den Weg geben, deine verfassten Texte vorher noch kurz durchzulesen, damit sich nicht jeder Satz mit dem vorigen widerspricht oder du durch deine offensichtliche Verwirrung Fehlinformationen in deinem Text baust.\n\nNein, Satire hat keine Grenze.\n\n\"Smurfs und Strohmänner\". Alter. Nimmst du dich eigentlich selber noch ernst, wenn du sowas aufschreibst? Aber wie ihr bereits oben erwähnt habe, ein klassisches Zeichen. Leute, die sich so verhalten wie du, suchen den Fehler immer bei ihren Mitmenschen. Aber keep going, mach ruhig damit weiter. So oft habe ich in paar Stunden noch nie lachen dürfen. Danke dafür. \n\nUnd das du es zum wiederholten Mal immer noch nicht in deine Gedankengänge aufnehmen konntest, bestätigt jeder meiner einzelnen Aussagen. Danke für die von dir gegebene Bestätigung dafür!","replies":[]},{"poster":"Timothy D","date":"2016-06-01T11:40:24.764+0000","up_votes":5,"down_votes":1,"body":"Der Einzige, der die Leser mit unkommentierten Unwahrheiten belästigt bist du, schau dir doch an wie deine Postings gnadenlos gedownvoted werden. Hättest du auch nur im entferntesten eine Interpretationsfähigkeit, wäre dir das schon längst aufgefallen. Trotzdem unterstellst du mir weiterhin ich wäre im Unrecht und würde dich beleidigen, was auch nicht zutrifft. \n\nDas der Songtitel das gleiche wie der Song ist habe ich auch nicht gesagt, wtf? Hör doch auf mir irgendwelche Worte in den Mund zu legen. Der Songtitel hat aber unmittelbar etwas mit dem Song zu tun, oftmals wird er sogar im Song erwähnt, so auch bei mir der Fall. Hier liegt kein Patzer in meiner Argumentation vor, sondern du bist einfach nicht bereit oder fähig diese Dinge in deinen Kopf aufzunehmen.\n\nDoch, genau das was ich behauptet habe trifft zu und nur weil du es dir nicht eingestehen kannst, dass ich deine eigene Argumente gegen dich verwende reagierst du, wie du reagierst. Absolut verständlich. \n\nSeit wann hat Satire eine Grenze? Wo werde ich persönlich? Ich kenne dich nicht einmal, mir fehlt jeglicher Bezug auf deine Person um in irgendeinem Rahmen persönlich gegen dich zu werden. Ich habe dich nicht ein einziges Mal beleidigt, du hast dich nur selbst bloßgestellt.\n\nIch bin alleine mit dieser Meinung? Die Viralität sollte für sich sprechen. \n\n\nUnd noch einmal, damit du es auch verstehst: Ich habe dich nicht ein einziges Mal beleidigt, du kannst es nur nicht einsehen, dass deine Kommentare hier im Forum keinerlei Anklang oder sogar Befürwortung ernten. Deshalb bist du so gereizt, kann ich total nachvollziehen. Außerdem, wieso sollte es schlechte Publicity für mich sein? \nSchau dir doch deine Votes und meine Votes an. Der Patzer in deiner Argumentation ist mehr als offensichtlich. Kappa.","replies":[]},{"poster":"Timothy D","date":"2016-06-01T13:06:35.398+0000","up_votes":1,"down_votes":1,"body":"Scheinbar ist einfach niemand deiner Meinung und du solltest dich damit abfinden.","replies":[]},{"poster":"Game of Thr0ws","date":"2016-06-01T12:48:42.545+0000","up_votes":1,"down_votes":1,"body":"Der Text ist jetzt 7 Minuten alt und hat schon 5 Upvotes? Wen willst du hier eigentlich für dumm verkaufen, wenn du sagst, dass du die Votes nicht manipulierst.\n\n> Natürlich hat das etwas mit Interpretationsfähigkeit zu tun. Warum, erkläre ich dir jetzt einfach mal nicht, kannst also nun damit beginnen dieses \"Fremdwort\" zu googlen, glaube aber allerdings das dieses Wort nur für dich ein Fremdwort ist.\n\nIch vermute, dass du es nicht erklären kannst. Deshalb verwendest du einen der ältesten und abgewrackten Tricks, indem du mich dazu bringen willst mir die Erklärung selbst anzueignen.\nIch bekomme so langsam das Gefühl, dass wir einen Schritt zurückgehen sollten und du bei der Recherche nach dem Wort \"Fremdwort\" beginnst.\n\n>  Das ist aber total natürlich, wenn man selber nicht der Grund ist, warum man sich unbeliebt macht, sind es eben die Anderen. Klassischer Move von Personen in deiner Situation und meist das erste Zeichen, wenn jemand mit seinem Standpunkt auf verlorenem Posten steht.\n\nSeit wann geht es hier um Beliebtheit? Für eine Diskussion geht es schließlich primär um die Argumente - und die sind bei der riesigen Menge an Text, die du bisher produziert hast, leider völlig ausgeblieben.\n\n\n> Seit wann gehört der Titel eines Songs, nicht zum Song? Daran erkenne ich nun zum 420. Mal, dass du wirklich genau gar keine Ahnung hast wovon du redest.\n\nWenn sie so untrennbar verbunden sind, warum gibt es dann überhaupt Titel? Warum benennt man nicht jeden Song nach der ersten Zeile im Text? Ganz einfach - weil der Songtitel eben eine eigenständige charakteristische Bedeutung haben kann. Es gibt Songs, die komplett anders heißen und von etwas komplett anderem handeln als der Songtext. Daher sollte man eigentlich den Songtext, zwar stets in Relation zum Text, aber immer noch autark und eigenständig beurteilen dürfen. Es ist befremdlich, dass dir das als \"Künstler\" nicht auffällt... Genau und direkt im Anschluss die nächste Beleidigung von dir, wie klischeehaft könnte man schon fast sagen.\n\n> \"Smurfs und Strohmänner\". Alter. Nimmst du dich eigentlich selber noch ernst, wenn du sowas aufschreibst? \n\nFühlst dich wohl vor den Kopf gestoßen, weil ich es durchschaut habe?\n\n\n> Und das du es zum wiederholten Mal immer noch nicht in deine Gedankengänge aufnehmen konntest, bestätigt jeder meiner einzelnen Aussagen. Danke für die von dir gegebene Bestätigung dafür!\n \n...Und immer wieder die gleichen aggressiven Phrasen, ohne jeden konstruktiven Beitrag zur Diskussion. Ein Jammer.","replies":[]},{"poster":"Game of Thr0ws","date":"2016-06-01T12:16:53.764+0000","up_votes":1,"down_votes":5,"body":">Der Einzige, der die Leser mit unkommentierten Unwahrheiten belästigt bist du, schau dir doch an wie deine Postings gnadenlos gedownvoted werden. Hättest du auch nur im entferntesten eine Interpretationsfähigkeit, wäre dir das schon längst aufgefallen. Trotzdem unterstellst du mir weiterhin ich wäre im Unrecht und würde dich beleidigen, was auch nicht zutrifft.\n\nDas hat rein gar nichts mit \"Interpretationsfähigkeiten\" zu tun. Was soll ich da interpretieren? Informiere dich doch bitte vorher über Fremdwörter, die du nicht kennst, bevor du sie verwendest, danke. \n\nEine viel wichtigere Eigenschaft in dieser Diskussion ist Scharfsinn. Den braucht man, um zu erkennen in welchen zeitlichen Intervallen die Downvotes stattgefunden haben (innerhalb weniger Stunden und davor gar keine) und daraus zu schließen, dass die Downvote-Aktion von dir geplant und durch Smurf-Accounts und andere Strohmänner ausgeführt wurde. Seine Argumentation auf die Anzahl der Up- und Downvotes zu stützen gilt allgemein als eher schwach.\n\n\n\n> Das der Songtitel das gleiche wie der Song ist habe ich auch nicht gesagt, wtf? Hör doch auf mir irgendwelche Worte in den Mund zu legen. Der Songtitel hat aber unmittelbar etwas mit dem Song zu tun, oftmals wird er sogar im Song erwähnt, so auch bei mir der Fall. Hier liegt kein Patzer in meiner Argumentation vor, sondern du bist einfach nicht bereit oder fähig diese Dinge in deinen Kopf aufzunehmen.\n\nDu wirfst mir vor, dass ich den Song beurteile ohne ihn gehört zu haben. Dabei habe ich lediglich den Titel beurteilt, der ja oben steht und wofür ich den Song nicht zu hören brauche. Obwohl der Titel möglicherweise mehrmals im Text vorkommt bleiben Titel und Text allerdings immer noch zwei unterschiedliche Dinge, die man unabhängig voneinander bewerten kann. Das was du mir vorwirfst, würde voraussetzen, dass du davon ausgehst, dass Song und Songtext einfach das gleiche Objekt sind, und das ist eben nicht so. Schach und Matt.\n\n...Im übrigen beleidigst du mich wieder, indem du mir direkt unterstellst, dass ich nicht die nötige Intelligenz hätte, das zu verstehen.\n\nNatürlich siehst du nicht ein, dass du toxic bist. Das ist ein ganz natürlicher Prozess. Viele Spieler die permanent gesperrt werden, sehen es auch danach nicht ein, dass ihr Verhalten falsch war. Es wundert mich daher nicht.\n\n> Seit wann hat Satire eine Grenze? \n\nDann wenn es keine Satire mehr ist, z.B. indem man genau das macht, was du machst.\n\n> Wo werde ich persönlich? Ich kenne dich nicht einmal, mir fehlt jeglicher Bezug auf deine Person um in irgendeinem Rahmen persönlich gegen dich zu werden. Ich habe dich nicht ein einziges Mal beleidigt, du hast dich nur selbst bloßgestellt.\n\nRichtig, du kennst mich nicht. Und trotzdem erdreistest du dich meine kognitiven Fähigkeiten, meine Fähigkeit zu lesen, mein Wissen über stilistische Mittel und meine Fähigkeiten zu argumentieren ohne jegliche Fakten deinerseits als minderbemittelt hinzustellen. Das ist genau das, was eine Beleidigung eben ist.\n\n\n> Ich bin alleine mit dieser Meinung? Die Viralität sollte für sich sprechen.\n\nSiehe weiter oben der Kommentar zu Smurf & Strohmännern. Ich kann mir kaum vorstellen, dass es eine rational denkende Personengruppe gibt, die ernsthaft denkt, dass man eine sinnvolle Diskussion ohne Argumente und nur auf Nachäffen anderer Leute aufbauen kann.\n\n> Schau dir doch deine Votes und meine Votes an. Der Patzer in deiner Argumentation ist mehr als offensichtlich. Kappa.\n\nJetzt äffst du mich schon wieder nach und du bringst das gleiche Argument von oben zum zweiten mal. Das ist meist ein erstes Zeichen, wann man mit seinem Standpunkt auf verlorenem Posten steht.","replies":[]}]}]}]}]}]}]}]}]},{"poster":"Dela The Rascal","date":"2016-05-31T18:08:19.303+0000","up_votes":11,"down_votes":4,"body":"Bitte .. geh raus und guck dir mal was von der Welt an und in 5 Jahren kannste gerne nochmal kommmen.","replies":[]}]}]}]}]}]},{"poster":"Eibert Rümmel","date":"2016-05-31T21:10:03.010+0000","up_votes":3,"down_votes":1,"body":"kurzweilig, unterhaltsamer Text, anständig gesungen und das Video passt zum Song. Das gewisse Etwas fehlt mir Irgendwie. Vielleicht war auch die erwartungshaltung bei 20 Upvotes zu groß ;)\n\nIst der Beat selbst gemacht oder \"geklaut\"?","replies":[{"poster":"Timothy D","date":"2016-06-01T05:50:21.120+0000","up_votes":5,"down_votes":1,"body":"Danke trotzdem! Kann ja nicht jedem alles 100% gefallen. Der Beat ist von \"Diract Beats\" produziert, sein Channel ist auch in der Videobeschreibung. Macht echt gute Instrumentals der Dude, kann ich nur weiterempfehlen!","replies":[]}]},{"poster":"Just w8 for L8","date":"2016-06-01T13:34:48.764+0000","up_votes":1,"down_votes":0,"body":"Also meiner Meinung ist der Song - dafür dass es nur eine Amateur Produktion ist - ganz gut.\n\nWas mich lediglich verwirrt ist, warum du im Titel so respektlos bist und deine Premades als 2. erwähnst ?","replies":[{"poster":"Timothy D","date":"2016-06-01T14:30:56.367+0000","up_votes":1,"down_votes":0,"body":"Vielen dank! :)\n\nJau, sorry :(","replies":[{"poster":"Just w8 for L8","date":"2016-06-02T14:34:57.798+0000","up_votes":1,"down_votes":0,"body":"könnte man doch sicher einfach umdichten. würde doch bestimmt nicht sooo lange dauern da du anscheinend schon bisschen Erfahrung mir Rapmusik hast... Deine Mates würden sich sicherlich freuen und Wundern warum du den Track verbessert hast.","replies":[]}]}]}]}