{"poster":"KisFarkas518","date":"2016-02-01T18:08:38.531+0000","title":"Hack shild ! Kéne némi védelem a csalók ellen !","up_votes":1,"down_votes":12,"body":"A Riot Games a jelent&eacute;s men&uuml;ben felt&uuml;ntette a &quot;csal&aacute;s&quot; elleni jelent&eacute;s lehetős&eacute;g&eacute;t. Ennek oka van, a j&aacute;t&eacute;kban egyre t&ouml;bb az illet&eacute;ktelen programot haszn&aacute;l&oacute; j&aacute;t&eacute;kos. \r\nN&eacute;h&aacute;ny p&eacute;lda : \r\nAram - Jax Doran pajzzsal &eacute;s 2 &eacute;leterő italla 2.0 t&aacute;mad&aacute;si sebess&eacute;ggel ... Ellenőrizt&uuml;k nem a r&uacute;n&aacute;ib&oacute;l szertett annyi t&aacute;mad&aacute;si sebess&eacute;get.\r\nId&eacute;zők szurdoka - Fiora Doran pajzzsal 56 -ot &eacute;letet kapott vissza alapt&aacute;mad&aacute;sonk&eacute;nt , valamint meg&aacute;llt a torony alatt , t&aacute;ncolt , &uuml;t&ouml;tte a torony de 1 &eacute;letpont al&aacute; nem s&uuml;llyedt az &eacute;letereje !\r\n\r\nNem k&eacute;ne m&aacute;s csak egy norm&aacute;lis szűrőprogram, hogy ezeket megakad&aacute;lyozz&aacute;k ! \r\nMinden rendes MMORPG , MOBA, MMOFPS rendelkezik valamilyen Anti-hack szűrő &eacute;s vizsg&aacute;l&oacute; programmal kiv&eacute;ve a LOL ! Lehet, mert a Vil&aacute;gbajnoks&aacute;gokon is csalnak , vagy csak esetleg nem foglalkoznak a j&aacute;t&eacute;kosok probl&eacute;m&aacute;ival ... Nem tudom\r\nDe azt tudom , hogy nem kell nagyon megerőltetni&uuml;k magukat, hogy egy ilyen szűrőprogram haszn&aacute;lat&aacute;val &eacute;lvezetesebb&eacute; tegy&eacute;k a j&aacute;t&eacute;kot ... b&aacute;r att&oacute;l m&eacute;g megmarad az a megsz&aacute;ml&aacute;lhatatlan hiba amit a j&aacute;t&eacute;k hordoz de ez m&eacute;gis bosszant&oacute;bb mint ezek !\r\n\r\n#LEACSAL&Oacute;KKAL","replies":[{"poster":"AsD The Dreamer","date":"2016-02-01T19:31:52.740+0000","title":null,"up_votes":2,"down_votes":0,"body":"Téged, már rég kikellet volna tiltani az egész internetről.","replies":[]},{"poster":"Mind The Gap","date":"2016-02-01T18:33:03.049+0000","title":null,"up_votes":2,"down_votes":0,"body":"Ezen a fórumon kívül sehol nem olvasni ilyen csalást. Én életemben egyszer találkoztam hackerrel, amikor ment a nagy exploit hackelés. De azt 2014 novemberében már javították.","replies":[]},{"poster":"Vasipari Béla","date":"2016-02-01T18:27:37.618+0000","title":null,"up_votes":2,"down_votes":0,"body":"Videó? Screenshot? Enélkül csak sírás az egész...","replies":[]},{"poster":"M4dr4c","date":"2016-02-01T18:17:29.251+0000","title":null,"up_votes":2,"down_votes":0,"body":"Bizonyíték? Mert én nem hiszem el.","replies":[{"poster":"NalamiHUN","date":"2016-02-01T18:22:59.580+0000","title":null,"up_votes":1,"down_votes":0,"body":"hát ezt én sem. Így úgy hangzik, mintha csalással vádolna valakit, mert jobb volt véletlen nála.","replies":[{"poster":"M4dr4c","date":"2016-02-01T18:27:03.182+0000","title":null,"up_votes":1,"down_votes":0,"body":"Az eddigi posztjai alapján én is így gondolom.","replies":[{"poster":"KisFarkas518","date":"2016-02-02T23:47:59.322+0000","title":null,"up_votes":1,"down_votes":2,"body":"Jah jó vicc ... Majd megtapasztaljátok milyen amikor ellenetek játszik a Cheater :3","replies":[{"poster":"M4dr4c","date":"2016-02-03T09:31:07.150+0000","title":null,"up_votes":1,"down_votes":0,"body":"Bizonyíték továbbra is 0. Majd beszélünk, ha bemutattál valamit.","replies":[]}]}]}]}]},{"poster":"skippersd","date":"2016-02-07T11:29:47.028+0000","title":null,"up_votes":1,"down_votes":0,"body":"Szervusz!\n\nRemélem kellő szinten tudsz angolul hogy ezt megértsd:\nhttp://s.op.gg/images/replay-guide.png\nHasználd. Ez a legjobb hack shield, amint elkezded felvenni a meccseket, nem fogsz itt hisztizni hogy mindenki csal.","replies":[]},{"poster":"Maximilition","date":"2016-02-01T19:00:22.729+0000","title":null,"up_votes":1,"down_votes":0,"body":"Jax a passzívjából szerez támadási sebességet,magyarán minden ütéssel gyorsabban támad.Gondolom Fiora is a passzívjával szerzett életet.Neki az,hogy megjelöl egy célpontot és ha megfelelő oldalról szúrja meg akkor igaz sebzést okoz és életet tölt vissza.Esetleg lehet az hogy a mesterségből töltött vissza hp-t,úgy hogy minden 4. támadása életerőt tölt vissza,de lehet a jelzőket növelni azzal is hogy mi támadjuk meg,így ha lassan támad és mi gyorsan támadjuk akkor lehet ez (a minionok támadása is  ad jelzőket).","replies":[{"poster":"KisFarkas518","date":"2016-02-02T23:53:21.415+0000","title":null,"up_votes":1,"down_votes":1,"body":"Az lehet ... De ha jax item, minden nélkül 2.0 támadási sebességgel rohangál a pályán elég zavaró !","replies":[{"poster":"Maximilition","date":"2016-02-03T19:22:38.141+0000","title":null,"up_votes":1,"down_votes":0,"body":"Lehet hogy valaki megnövelte mondjuk egy {{item:3504}} -vel a támadási sebességét.És ha állandóan?Lehet hogy olyan gyorsan visszatölt a képesség hogy 6 mp alatt vissza is tölt,vagy utóhatása is van (pl. Sona,gyógyít aztán 2 mp-vel később kapja a pajzsot) vagy ilyesmi.","replies":[{"poster":"KisFarkas518","date":"2016-02-03T20:25:27.574+0000","title":null,"up_votes":1,"down_votes":0,"body":"Mit nem értesz ezen ? Egyedül volt ! Senki nem volt a közelében ! Senki és semmilyen más forrásból nem kaphatott attackspeed-et !","replies":[{"poster":"Maximilition","date":"2016-02-04T08:35:35.404+0000","title":null,"up_votes":1,"down_votes":0,"body":"Lehet hogy teljes támadási sebességes rúnaoldala volt és abból kapott annyit.","replies":[]}]}]}]}]},{"poster":"Tetth","date":"2016-02-01T19:06:51.274+0000","title":null,"up_votes":1,"down_votes":0,"body":"Az életerő és támadási sebesség adatokat a szerver tárolja, ráadásul folyamatosan változó adat, a világ legprofibb hackere sem tudná meghackelni valós időben, ezt bebuktad.\n\nÉrtem én hogy figyelemre és szeretetre, meg hasonlókra van szükséged de azt ne ezzel a módszerrel próbáld elérni.\n\nMás mindenben illuminatit lát, te meg mindenhol csalót. Te vagy az egyetlen aki tudja hogy a szomszéd boltos Marika néni is aimbotot használ CS:GO-ban, és te vagy az egyetlen aki az elmúlt másfél szezonban god mode fiorát látott. Érezd magad megtisztelve.\n\nEgy normálisan összedobott scriptet meg nem lehet anticheattel kiszűrni mert semmilyen gyanús adatot nem küld a szervernek. Ha ilyen egyszerű lenne már CS:GO-ban sem csalna senki, és mégis tele van aimbottal, pedig amögött egy szupercég áll, a Valve.","replies":[{"poster":"KisFarkas518","date":"2016-02-02T23:52:36.449+0000","title":null,"up_votes":1,"down_votes":3,"body":"Olvass utána .... Fiora sosem kapott vissza életet a passzívjából.\nNagyon okosnak állítod be magad de semmi sincs abban amit mondasz ! \n2014 ben még az általad látható skint is meghackelték ... Mindenre képes aki ügyesen programoz.\nA LoL rendszere alapvetően nem rögzít adatokat, csak a meccs elején létrehoz egy a 10 játékosból álló kis csomagot amelyben tárolja az adatokat majd a játék végén ezt elmenti ... Ergó hogy a két végpont között mi történik a rendszer nem figyeli , csak elmenti.\nAkkor vizsgálják át ha jelentés vagy hasonló miatt büntetésre kerül a sor.\n\nA Cs:Go meg ne hozd ide ... AZ NEM MOBA ÉS NEM  IS LIVE SZERVER MMOMOBA -.-\" Tudatlan","replies":[{"poster":"SquatEye","date":"2016-02-03T11:56:48.812+0000","title":null,"up_votes":1,"down_votes":0,"body":"\"Fiora sosem kapott vissza életet a passzívjából.\"\n\nhttp://forums.na.leagueoflegends.com/board/showthread.php?t=2588526\n\nItt a topic róla, ha tudsz angolul... nagyon okosnak állítod be magad, de semmi sincs abban, amit mondasz. Bár gondolom erre az lesz a válaszod hogy az egész topic egy nagy HOAX és te úgyis jobban tudsz mindent mindenkinél...","replies":[{"poster":"KisFarkas518","date":"2016-02-03T20:28:00.093+0000","title":null,"up_votes":1,"down_votes":0,"body":"Halálos tánc\n\nFiora kihívást intéz a közeli ellenséges hősökhöz, hogy próbálják kikerülni a csapását. Ezután kijelöli, hogy merre fog támadni. Ha sikerül betalálnia, akkor némi bónuszt kap, és ismét támadhat.\n\n\n\nKitörés\n\nKöltség: 20/25/30/35/40 mana\nHatótáv: 400\n\nFiora a kijelölt irányba lendül, és megvág egy közeli ellenfelet, amivel fizikai sebzést okoz, és alkalmazza a találati hatásokat.\n\nFiora a kijelölt irányba lendül, és megvág egy közeli ellenfelet, amivel 65/75/85/95/105 (+60% bónusz sebzés) fizikai sebzést okoz, és alkalmazza a találati hatásokat. A támadás elsősorban a gyenge pontokat és a gyilkolási hatótávon belüli célpontokat célozza. Ha a képesség eltalál egy ellenfelet, a töltési ideje 60%-kal csökken.","replies":[{"poster":"SquatEye","date":"2016-02-03T20:43:05.592+0000","title":null,"up_votes":1,"down_votes":0,"body":"Igen, ez a rework utáni passzívja, de nagyon jól tudod, hogy nem erről beszéltünk :)\n\n\"Fiora**_ sosem_** kapott vissza életet a passzívjából.\"\n\nEz pedig teljes tévedés, csak hát neked általában nem megy, hogy elismerd a dolgokat :)","replies":[]}]}]},{"poster":"M4dr4c","date":"2016-02-03T09:40:11.039+0000","title":null,"up_votes":1,"down_votes":0,"body":"\"Olvass utána .... Fiora sosem kapott vissza életet a passzívjából.\"\nInkább te tedd azt. A régi passzívja épp csak annyi volt, hogy kapott egy kis HoT-ot, ha megütött egy ellenfelet, háromszorosát, ha az hős volt.\n\nA szerver részre csak részben igaz, amit leírtál. Nem ment folyamatosan a meccs közben, de szinte mindent elment a végén. Ergo, ha nem volt drophack akkor látszik a nyoma a cheatnek.\n\nA CSGO tökéletesen jó példa volt ide. Csak te nem akartad elfogadni. Amúgy pedig nem tudod, hogy nincs-e védelem a LoL-ban, csak a Riot nem hangoztatja úgy, mint a többi cég teszi. Az általad említett Hackshield pedig talán a leggyengébb elérhető védelem...","replies":[]}]}]},{"poster":"KisFarkas518","date":"2016-02-02T23:58:50.475+0000","title":null,"up_votes":1,"down_votes":4,"body":"A PROfesszorok magyarázzák meg ... ( Ha ez nem cheat akkor semmi sem az )\nFiora Vs Gnar \nToppon Gnar megnő , használja a W képességét , és Fiorával szintén elnyomom a W-m és instant stun Gnar .... gondoltam én ! Hirtelen felvilant a szöveg \"varázsimmunitás\" .... 3. szinten , 1 potival meg egy doran pajzzsal Gnarnál ... EZ MI ??!\nA Braum ulti nem lökte fel , Gragas nem tudta lestunnolni , Lucian lövedékei áthaladtak rajta !\nMi ez ha nem Cheat ? >.>\n\nMajd ha ti is kifogtok egy csalót akkor majd veritek a billentyűzetet de mivel minden magyar játékos egy makacs, bunkó, önző dög úgysem fogjátok beismerni mi is a valóság .\n\nÉn mindig itt leszek , én vagyok a görbe tükör ami megmutatja mik azok az apró megmagyarázhatatlan dolgok , és hibák amik a játékban vannak \n\n#HirokiTheMirror","replies":[{"poster":"SquatEye","date":"2016-02-03T07:54:02.613+0000","title":null,"up_votes":1,"down_votes":0,"body":"Hogy nálad minden meccsen cheater van... érdemes lenne elkezdened rögzítzeni, nem?\n\nEzekre a dolgokra válaszolj, ha már mindenen túlmenően okosabbnak tartod magadat másoknál:\n\n- ha ennyi a cheater, miért ilyen kevés a topic róla? (nem csak a makacs, bunkó, önző dög magyarok által látogatott fórumokon, de máshol sem)\n- ha te 500 órányi játékkal folyamatosan ezekkel találkozol, akkor miért van, hogy mások több ezer óra alatt sem találkoznak egyel sem?\n- ha az ellenfél cheatet használ, és verhetetlen, miért marad meg silverben?\n\nA valós probléma az, hogy nem görbe tükör vagy, hanem egy kisgyerek, aki egy ennyire kevéssé fontos dolgot, mint hogy nyersz vagy vesztesz, sem tud a helyén kezelni.\n\n**#NAGYKÉPŰAFÓRUMONDEJÁTSZANINEMTUD**","replies":[{"poster":"KisFarkas518","date":"2016-02-03T20:36:52.085+0000","title":null,"up_votes":1,"down_votes":1,"body":"Látszik hogy te is csak a képernyő mögül tudsz ugatni :3 Nincs benned semmi, csak kötekedni tudsz aki itt jön az kitalált adataival :3 Persze mert a LOL nincs tele bugokkal !? Nincs tele apró megmagyarázhatatlan dolgokkal ? \nHogyan húz át egy Blitz vagy egy amumu a minionon és kap el ?\nA játék tele van apró ilyen dolgokkal , amire rámondjuk hogy bug ... de nem biztos hogy az !\nNézzd meg 10 játékból 1 ben biztos találkozni fogsz valami ilyennel ... csak nagyképű vagy és nem akarod bevallani !","replies":[{"poster":"SquatEye","date":"2016-02-03T20:41:52.274+0000","title":null,"up_votes":1,"down_votes":0,"body":"Bug - igen. Cheat - teljesen más kérdés. A bug a riot hibája, a cheat pedig büntethető cselekmény. Én simán bevezetném, hogy aki bizonyíték nélkül vádol valakit, az ugyanúgy kapjon büntetést.\n\nMellesleg nem sikerült válaszolnod arra, amit kérdeztem, nyilván nem véletlenül :)\n\nMilyen kitalált adatok? Hogy 500 óra van mögötted? :) Nézz csak utána... simán elérhető info.\n\nszerk: ezek a csoda dolgok mindig veled történnek, engem sem blitz, sem amumu nem szokott elkapni minionon keresztül :) Azért lennénk nagyképű, mert nem látok csalókat? Ez érdekes, szerintem inkább az, aki nem hajlandó beismerni hogy szarul játszik, inkább csalásra fogja.\n\nszerk 2: ugatni a kutyád szokott, maximum. Nem olyan régen még tiszteletről hablatyoltál, akkor vegyél vissza az arcodból.","replies":[]}]}]},{"poster":"Maximilition","date":"2016-02-03T19:24:26.450+0000","title":null,"up_votes":1,"down_votes":0,"body":"A Gnar W-t nem állíthatja meg a CC,van egy külön védelme rá,a Fiora W-vel maximum csak semlegesítheted.","replies":[{"poster":"KisFarkas518","date":"2016-02-03T20:39:06.013+0000","title":null,"up_votes":1,"down_votes":0,"body":"Visszavágás\n\nKöltség: 50 mana\nHatótáv: 500\n\nFiora rövid ideig kivédi a rá irányuló összes sebzést és bénító hatást, majd a kijelölt irányba döf. A szúrás lelassítja az első eltalált hőst, vagy elkábítja, ha Fiora a képességgel kivédett egy bénító hatást.\n\nFiora a következő 0.75 másodpercben kivédi az összes sebzést, illetve gyengítő és bénító hatást, majd a kijelölt irányba támad.Ez a döfés 90/130/170/210/250 (+0) varázssebzést okoz az első eltalált ellenséges hősnek, és 1.5 másodpercre 50%-kal csökkenti az áldozat mozgási és támadási sebességét.Ha Fiora kivéd egy bénító hatást, amely mozdulatlanná tenné őt, akkor a Visszavágás nem lelassítja, hanem elkábítja a célpontját.\n\n\"Ha Fiora kivéd egy bénító hatást, amely mozdulatlanná tenné őt, akkor a Visszavágás nem lelassítja, hanem elkábítja a célpontját.\"\n\n\"Fiora kivéd egy bénító hatás ,akkor elkábítja a célpontját.\" - EZ ITT A LÉNYEG !!!!!\nEgyéni játékban kipróbáltuk ... KI LEHET VÉDENI MEGAGNAR W képességét, Fiora W képességével ! Csak arra az egy Gnarra írta a varázsimmunitást !","replies":[]}]}]}]}