{"poster":"Sorgklaan","date":"2016-03-31T10:28:29.233+0000","title":"4 chests a month, 1-2 keys a month.","subforum":"[ARCHIVED] Miscellaneous","up_votes":134,"down_votes":15,"body":"I'm not really one to complain about free shit, but when you tempt people with earning rewards only to lock them behind a paywall it's pretty obnoxious. If I earn a chest I should also be able to earn enough keys to open them rather than them piling up.  mystery skins always feel really awesome to get, but this just feels like a cheap ploy.","replies":[{"poster":"Randomonium","date":"2016-03-31T11:32:31.288+0000","up_votes":33,"down_votes":1,"body":"Only gotten 8 key fragments so far but I've literally gotten a box every day I have one available (majority of them I got not playing my mains as well.) Defiantly frustrating to have 4 boxes and no keys to open them. It feels like Riot is tempting me with free stuff only to force me to pay for keys, which definitely makes the system feel very hallow.","replies":[{"poster":"Narasimha","date":"2016-03-31T18:06:53.355+0000","up_votes":4,"down_votes":7,"body":"> It feels like Riot is tempting me with free stuff only to force me to pay for keys, which definitely makes the system feel very hallow.\n\nI mean... I hate to break it to you, but that IS what they want. They want you to feel desperate enough to buy keys. And it's not really on them. They're a business. It's what they do. They're still giving you enough.","replies":[{"poster":"Randomonium","date":"2016-03-31T19:14:56.021+0000","up_votes":19,"down_votes":1,"body":"I understand they are a business but when you come out with a system designed to reward good players with \"free\" stuff and then twist the system so you have to pay cash to unlock your \"free\" stuff it feels very, very slimy.\n\nWhen this system was first announced I was so excited because I really thought it would help people reform and stop being toxic because no one wants to be left out of getting free stuff.  However, by being greedy Riot isn't going to have near as big an impact as they could have had with this system and it winds up leaving the positive members of the community with a very bitter taste in our mouth.\n\nThis was supposed to be our reward for being positive members of the community but it feels more like a shell game.  Not a very good way to treat your player base.  I'm just really disappointed and it makes me want to buy RP LESS, not more.","replies":[{"poster":"Narasimha","date":"2016-03-31T19:36:56.767+0000","up_votes":6,"down_votes":5,"body":"The thing is, it IS free. Do you earn keys by playing? Yes. You can unlock every aspect of the Chest system without paying a dime.\n\nNow, is it easier to get stuff if you pay? Also yes. And that's how it is for ANY game. Time is money. You can either grind it out, or take the shortcut. That's part of how free-to-play games make their cash. It's not greedy. Greedy would be if the base key rate was ridiculously low, like 0-1 key a month. As it stands, it's pretty easy to get 2-4 keys a month. And that's just for playing the game. You don't have to do extra work or go out of your way.\n\n","replies":[{"poster":"Randomonium","date":"2016-03-31T20:02:01.260+0000","up_votes":4,"down_votes":2,"body":"Yeah, but most games don't hide their pay systems behind a thin veil of \"rewards\" for positive players.  Riot is already making hand over fist with their skins and other content, why can't we just have a pure system that rewards people and encourages positive play?\n\nThe more people enjoy the game the more likely they are to buy RP.  If people get free rewards for being positive they enjoy the game more.  If people are encouraged to be not toxic so they can get free rewards than EVERYONE enjoys the game more.  However, by making key drop rates absurdly low you completely dampen that enjoyment.  Its being penny wise and pound foolish.  And the worst part is it feels dishonest and sleazy.\n\nRiot: \"Here a free system to reward all you great, positive players!\"\n\nPlayers: \"Sweet!  But why am I not getting enough keys to open my boxes?\"\n\nRiot: \"Key rates drop lower and lower the more keys you get!  We did that so the casual players wouldn't feel left out haha.  If you want to open ALL your boxes all you have to do is win a couple hundred games a month.  No big deal right???  Or you can just pay a couple bucks for each key.\"  *wink* *wink*\n\nSeriously, this system is like having a bar where you can get \"free\" drinks but you have to tip the bartender $10 every time or you won't get served.","replies":[{"poster":"UltraFireFX","date":"2016-03-31T21:58:17.619+0000","up_votes":1,"down_votes":3,"body":"That last part is totally wrong, you can get all aspects of the system for free but it takes time, or you could pay and get some more, answer me this: is it worse than the system it superseded? Yes, because there was no such system, it was buy skins or not have skins (minus the free ones from Facebook, Twitter, YouTube, ect.)","replies":[{"poster":"Randomonium","date":"2016-03-31T22:27:35.900+0000","up_votes":9,"down_votes":0,"body":"If it takes me a maximum of 5 games to get a box and at least 30 games to get a key fragment then no, you will never play enough games to open the boxes you earn.\n\nMy whole point with this discussion is Riot completely missed the mark with this system.  This system could have changed the community for the better but with drop rates so low I doubt many people will reform in order to get the rewards.  Yeah free stuff is great but if it takes forever to unlock the free stuff it doesn't feel satisfying.  This system could have been so much more.  Instead its just going to be another marginally effective system that most people won't care about after a few months.  Great idea but horrible, horrible execution (which is pretty much Riot's business model now.)","replies":[]}]},{"poster":"Narasimha","date":"2016-03-31T20:16:21.320+0000","up_votes":1,"down_votes":3,"body":"I take it you haven't played Warframe? or Smite? or Dota2?\n\nIt's the same for any game, as I've said. You can spend time, or you can spend money. League is absolutely no different. You may as well say EVERY single company is dishonest and sleazy. And then stop playing altogether.\nHell, League actually has a good starting rate! Even if you earn a 'bare' 2 keys a month, that's  2 chests of free content. Content that can't be earned any other way except through RP (champions not withstanding, we have to see where that goes).\n\nI think I see where your problem is though. You just want to grind out the keys. And yeah, if you do that, you won't have as much fun. So DON'T do that. Don't make the keys your absolute desire. Make them into a secondary objective. Play League to have fun and enjoy yourself. If you get chests and keys to unlock stuff, well, that's a nice bonus. Play the game for the game.\n\nAnd to adjust your metaphor, it'd be better to say the system is like a bar where you get 3 drinks free, and then you have to either have to sing a round of karaoke or pay $5 for your next drink.","replies":[{"poster":"Randomonium","date":"2016-03-31T21:15:13.462+0000","up_votes":5,"down_votes":0,"body":"What system do those games have where company has publicly said is a reward for positive players but then makes you grind hundreds of games or charges money to unlock the free items?\n\nThere's already enough grinding in this game.  Grind for runes, grind for champions, grind for rune pages, etc etc etc.  Why can't we just have a pure system that rewards positive play?  Why even bother making it a grind?\n\nYour metaphor doesn't make any sense.  People are playing 30-50 games and not getting a single key fragment.  That's like purposely being ignored in a bar until you tip the dude to serve you.\n\nIn order to open my 4 chests a month I need to get 12 key fragments.  Right now I'm averaging a key fragment AT BEST once every 25 games (and the drop rate keeps going down the more key fragments you get.)  So that means at minimum I'll have to play 250 games per month to unlock the chest I earn.  That translates to 8 games per day minimum that I have to play.  And keep in mind that this was designed to be a free system to REWARD positive players.  I just can't fathom why people aren't calling Riot out on this bullcrap.  \n\nYou should be able to get all the key fragments you need playing a normal amount every day.  I understand if Riot wants to make some money on the side for people who don't want to wait but they shouldn't make it near IMPOSSIBLE for the average player to get they key fragments he/she needs just from grinding.\n\nThat's my big issue with the system.  By making the drop rates so low Riot is basically forcing people to buy keys if they want to unlock their chests because you have to play an absurd (and unhealthy) amount of games otherwise to unlock them.","replies":[{"poster":"UltraFireFX","date":"2016-03-31T21:59:44.654+0000","up_votes":1,"down_votes":3,"body":"The 'hundreds of games' sounds exaggerated by far, and it's only making the drops rates low for people who play a lot so the people who can't spend much time don't feel like \"Well, where are MY keys?\"","replies":[{"poster":"Randomonium","date":"2016-03-31T22:22:18.130+0000","up_votes":8,"down_votes":0,"body":"How is it exaggerated?  I haven't gotten a key fragment in over 30 games and the drop rate gets worse each time you get a key fragment.  Many other people have reported similar issues.  The drop rate once you get a couple key fragments seems to drop to around 3% or less so it is very realistic that you would have to play hundreds of games a month to get enough key fragments.","replies":[]},{"poster":"WadeWilson1337","date":"2016-04-01T06:17:47.917+0000","up_votes":5,"down_votes":0,"body":"I have won 60+ games since Hextech came out, and ive only gotten 6 fragments. Assuming i had a perfectly average 50% winrate, that would mean it would take me 120 games to get 2 keys. Now, since the drop rate is expontentially decreasing, it means it would take me well over 240 games. Possibly 300 to even 400 games. \n\n\nI dont think there is enough coffee in America to make me play 400 games of League of Legends in a month.","replies":[]},{"poster":"Villiers","date":"2016-04-01T21:42:54.107+0000","up_votes":1,"down_votes":0,"body":"lmao its not exaggerated one bit.  From the time this system launched I have gotten 4 key fragments in total.","replies":[{"poster":"UltraFireFX","date":"2016-04-01T22:22:53.870+0000","up_votes":1,"down_votes":0,"body":"So have I, but it's too early to judge how many hundred games one needs to play to get enough keys, most of it is luck, after all, and it is a very potent system (the rewards can be very great).\nOn CS:GO you can't even earn keys without purchasing them manually, so that's a plus, even if this isn't the perfect scenario.","replies":[{"poster":"Villiers","date":"2016-04-02T00:02:55.186+0000","up_votes":1,"down_votes":0,"body":"It's not a matter of 'how many hundred games' one might need because you can technically get all your chests for the month in 4 games.  It shouldn't take anywhere near any number of hundreds to scrounge up some keys, and average players may not play a hundred games a month, so to assume that is ridiculous.\n\nIt's not about luck either, there was a clear post explaining the shitty algorithm they use to 'reward' players with these key fragments.  I know the rewards 'can be' good, but they can also be a huge disappointment.  After finally getting a key just to unlock a champion shard that you already own, you can't NOT feel let down as fuck.  As great of a plan as they may have for champion essence (so they say) it doesn't change how frustrating it is now.\n\nI don't hate the system, but they're really playing the community by offering free things that realistically can't be obtained. (but hey it can be bought right)","replies":[]}]}]}]}]}]},{"poster":"Raelaem","date":"2016-04-01T17:27:11.362+0000","up_votes":1,"down_votes":0,"body":"because capitalism... I've been saying since day 1 this was a scam/ploy","replies":[]}]}]}]}]},{"poster":"Enchanté","date":"2016-03-31T12:47:16.704+0000","up_votes":2,"down_votes":0,"body":"8 key fragments are good enough... I only got 4 this whole month","replies":[{"poster":"DarkSunSovereign","date":"2016-03-31T16:21:54.561+0000","up_votes":9,"down_votes":0,"body":"I got 1 lol","replies":[]},{"poster":"Randomonium","date":"2016-03-31T13:33:29.739+0000","up_votes":8,"down_votes":0,"body":"Guess it depends on how much you play. I haven't gotten a key fragment in over 30 games so I'm starting to get a little salty. Those two remaining key fragments have been taunting me for days.","replies":[{"poster":"UltraFireFX","date":"2016-03-31T21:55:43.503+0000","up_votes":5,"down_votes":0,"body":"I reckon it would be nice if each time you did play, the chance went up and when you got one, it reset to a certain level, so after X games you would have a very large chance to get one.","replies":[]},{"poster":"Aír","date":"2016-03-31T14:15:30.317+0000","up_votes":4,"down_votes":1,"body":"I only got maybe two or three key fragments in the last 2 weeks, and i played about 200 games.\n\nThat seems a bit much.","replies":[]}]}]},{"poster":"Darktoonz","date":"2016-04-01T05:03:10.669+0000","up_votes":5,"down_votes":0,"body":"You think they made Hextech Crafting just to be nice?","replies":[]}]},{"poster":"PDE5 Inhib","date":"2016-03-31T12:57:40.502+0000","up_votes":22,"down_votes":0,"body":"Lol, and here I was thinking the chests were going to be the hard thing to get.","replies":[]},{"poster":"CarameI Frappe","date":"2016-03-31T19:21:53.411+0000","up_votes":18,"down_votes":2,"body":"This Hextech Crafting sounded really cool and fun at first ... but it's truly hollow. Sure it was awesome to get a free Blackthorn Morgana skin, but the fact I can never get key drops now and my chests are gathering dust ruins the experience, because it seems like a ploy from Riot to get people spending RP on the chests & key bundles. It feels cheap.\n\nI get that the key drops reset every month, but that's a long freaken time. If I play and win 5+ games a day or more, why does the chances of key drops shorten? That's not healthy, and makes me lose interest in the Hextech Crafting. My time spent & effort should be what grants me key drops, not by a random drop system that gets harder overtime until 30+ wins isn't enough to get myself a key drop.\n\n{{sticker:slayer-jinx-unamused}}","replies":[{"poster":"CrankyChipmonk","date":"2016-04-01T01:41:37.918+0000","up_votes":1,"down_votes":0,"body":"I'm just curious, would it feel more fair if you got tons of key drops but it was much harder to get chests? Like if all the numbers were the same but keys and chests were switched?","replies":[{"poster":"Attysu The Poro","date":"2016-04-01T04:01:46.223+0000","up_votes":8,"down_votes":0,"body":"I'd feel better cause at least you don't have to build chests with fragments. :/","replies":[]},{"poster":"Villiers","date":"2016-04-01T21:50:22.202+0000","up_votes":2,"down_votes":0,"body":"If they really intended on players getting 4 free rewards a month they would just give chests and forsake the keys all together lmao.  The fact that it's a two-parter makes it frustrating and the system could work exactly the same way without them.  I'm pretty sure their key drop rate was tweaked just enough to give average players one full key for free each month, leaving 3 chests to rot until temptation gives in to purchasing keys with RP.","replies":[]}]},{"poster":"Villiers","date":"2016-04-01T21:46:27.909+0000","up_votes":1,"down_votes":0,"body":"I agree, I like wasting my money on pointless things and I would gladly buy bundles, as I'm sure many others would too.  I've played the RGN game before though and the fact that people can't even get their 'free' key fragments in a reasonable amount of time is what makes me shun the crafting system.","replies":[]}]},{"poster":"Kei143","date":"2016-03-31T11:22:13.926+0000","up_votes":9,"down_votes":0,"body":"http://boards.na.leagueoflegends.com/en/c/bug-report/rJ4rQmHA-after-getting-4-chests-key-fragments-no-longer-seem-to-drop-for-a-lot-of-people","replies":[]},{"poster":"Velzard of Koz","date":"2016-03-31T18:56:46.760+0000","up_votes":7,"down_votes":0,"body":"Well, it's not really that much free shit.\nI admit it is well-designed way to inspire players to spend money for something uncertain and is occasional happymeal toy, but overall you can see it wasn't designed with intention of anything \"free\".\nStill good... For Riot system.","replies":[]},{"poster":"Barkhoof","date":"2016-03-31T11:24:26.282+0000","up_votes":3,"down_votes":8,"body":"Take the long-view. They don't expect you to get 4 chests a month. They _DO_ expect you to continue stock-piling keys. They also hope you'll become impatient and buy keys. Unless you feel as though the game deserves your money, take a patient route and just remember it's out-of-sight-out-of-mind and play the game to have fun. If you happen to get key fragments, all the better.","replies":[{"poster":"Weathered","date":"2016-03-31T13:47:10.280+0000","up_votes":5,"down_votes":0,"body":"> [{quoted}](name=Barkhoof,realm=NA,application-id=cIfEodbz,discussion-id=vBMxfqEn,comment-id=0003,timestamp=2016-03-31T11:24:26.282+0000)\n>\n> They don't expect you to get 4 chests a month. \n\nPeople are complaining that they got 4 chests in a few days. Literally the day chests renew and one is available to get I have it, and I'm immediately back to the max amount of chests.","replies":[{"poster":"Barkhoof","date":"2016-03-31T13:50:27.462+0000","up_votes":6,"down_votes":3,"body":"Right - and that's going to continue for the entire year? That's what I meant by the long-view. One is eventually going to run out of champs to get a chest with unless they specifically are playing different champs in hopes they'll get an \"S\" with a new champ. Meanwhile, you'll continue to get keys without a hard-cap. That's all I'm saying.","replies":[{"poster":"Wimbledofy","date":"2016-03-31T18:33:49.651+0000","up_votes":6,"down_votes":0,"body":"there're over 100 champs. 1 chest per week = 100 weeks which is 2 years. Chests available reset each season and a season is only 1 year so unless you intentionally avoid playing new champions, you will never have enough keys for the chests you have.","replies":[]}]}]}]},{"poster":"Only Play Darius","date":"2016-03-31T19:42:48.707+0000","up_votes":5,"down_votes":0,"body":"Your earn significantly more keys when you play in a premade. If you don't have friends who play league on a regular basis, well then that's too bad. According to Riot.","replies":[]},{"poster":"Naramiel","date":"2016-03-31T11:40:53.834+0000","up_votes":5,"down_votes":0,"body":"They set up the system such that any decent player (or one with skilled friends) is guaranteed to get 4 boxes a week if they work at it. Key fragments, however, is something they can regulate **entirely** with little to no player control. It's unsurprising - though I agree it's extremely depressing - that they've set up the system such that there's absolutely no way to get 4 keys a month, and 2 is more likely.\n\nI expect most regular players are going to have 10-20 useless boxes stockpiled after a year.","replies":[]},{"poster":"Morsigil","date":"2016-03-31T16:38:11.251+0000","up_votes":2,"down_votes":10,"body":"Barkhoof has the right of it. All you people complaining are going to get S on, at best, 20-30 champions. And that's generous. The rest you won't own, won't put in the effort on, or won't like the champ enough to get those other boxes over the course of a year. Do you honestly believe you can get S- on 120 someodd champions, many of which you've never played or played only a few times, in the course of 365 days?\n\nNext thing you know, you're going to have a hard time getting S- on any new champs and the keys are going to start stacking up and you'll be the same people back here complaining that boxes are too rare/too hard to get.\n\n{{sticker:zombie-brand-mindblown}}","replies":[{"poster":"ragdollomega","date":"2016-03-31T18:26:24.890+0000","up_votes":8,"down_votes":0,"body":"Except you don't need it for 120 champs, you only need to get it at max on 48 champs and you can get them from friends in party getting S while you play some champs that you might have wanted to try but never had incentive to. It's not that unreasonable of an expectation.","replies":[]},{"poster":"Wimbledofy","date":"2016-03-31T18:38:46.083+0000","up_votes":6,"down_votes":0,"body":"no, noone should believe you would get 120 S's because THERE AREN'T 120 WEEKS IN A YEAR. think a little at least man. Even if for whatever reason you are no longer able to get an S rank, you still would likely not have enough keys to open your other 15+ chests you already have.","replies":[]},{"poster":"Hammerpriest","date":"2016-03-31T17:30:27.811+0000","up_votes":6,"down_votes":0,"body":"That's what premades are for. Get someone who is godlike on a champ, Q with them, they get an S and as long as you're on a new champ you get a chest.","replies":[]}]},{"poster":"LITTLE TlMO","date":"2016-03-31T11:20:49.656+0000","up_votes":4,"down_votes":0,"body":"ive gotten 4 chests and 3 key fragments (1key)","replies":[]},{"poster":"PaladinNO","date":"2016-03-31T22:50:15.292+0000","up_votes":6,"down_votes":2,"body":"My last 10 matches:\nGames: 10\nWon: 6\nKey shards: 0\nTotal key shards earned since feature startup: 3\n\n\"Any matchmade queue\", \"premades increase the chance of loot\", \"must win the game\".\nCheck, check, and check.\nI can't imagine the non-linear drop rate being of any consequence given how I've only received 3 shards.\n\nGreat way to make people suspicious about \"free things\" on later occasions.\n\nRito, you do know promises are supposed to be kept, right?","replies":[]},{"poster":"Weathered","date":"2016-03-31T13:43:59.376+0000","up_votes":3,"down_votes":0,"body":"With buying one full key from the shop (so I earned 9 fragments) I was able to open my four chests. Since that last key frag, I have not gotten any of them.","replies":[]},{"poster":"Kas127","date":"2016-04-01T07:18:52.863+0000","up_votes":1,"down_votes":0,"body":"Reminds me of old DOTA 2 drop system.\nYou could get hundreds of chests (there was almost 100% drop chance per game), while you had to buy the keys. The thing is, keys were more expensive than the shit that the chests gave there.\n\nIf they didn't want people to farm stuff without paying, they should've thought better than to turn the game into another RPG.\nThe only way they will increase the drop rate will be by limiting the stuff that drops from the chests. That way Rito can still rely on players paying for the newest/coolest skins, while F2P guys will run around with the older ones.\n\nOther than that, I don't see a reason for them to give people free stuff. In case you didn't know, this whole thing is just a marketing scheme to increase sales on their stuff. It's just meant to get you excited and happy to see new stuff and try it out. It works on mobile games; it works on a lot of MMORPGs; it will work here, too.\n\nFree stuff is a myth. Utopia does not exist. Capitalism has become the essence of humanity.\n....\nHagel Trump.....\\o","replies":[{"poster":"Hello I am Bird","date":"2016-04-01T09:04:37.442+0000","up_votes":2,"down_votes":0,"body":"\"Free stuff is a myth\"\n\nYeah, that free skin we got two Christmas's ago was a myth man. It was a government conspiracy.\n\nYou could say that anything that's free is just some scheme to \"build trust\" with players so that they will buy more of your product but that means that if someone actually tries to do something selflessly, they are still painted as the greedy bad guy.","replies":[]}]},{"poster":"Nellap","date":"2016-03-31T19:31:52.172+0000","up_votes":2,"down_votes":0,"body":"Ok get this. When Hextech Crafting came out I got about 5 key fragments within the first week right? Sense then I haven't gotten any and I can tell you I've been playing a lot.  I have over 20 wins without a fragment so far. Seriously,  whats up? ; -;","replies":[{"poster":"CrazedPorcupine","date":"2016-03-31T20:30:23.925+0000","up_votes":2,"down_votes":1,"body":"Riot made it so that if you've earned a key fragment, it gets rarer and rare to get the next. To the point where it's less than a 1% chance to find one.","replies":[{"poster":"UB3R 1337 H4X","date":"2016-03-31T22:54:01.516+0000","up_votes":1,"down_votes":0,"body":"Source?","replies":[{"poster":"CrazedPorcupine","date":"2016-04-01T04:49:19.890+0000","up_votes":2,"down_votes":0,"body":"http://boards.na.leagueoflegends.com/en/c/bug-report/rJ4rQmHA-after-getting-4-chests-key-fragments-no-longer-seem-to-drop-for-a-lot-of-people?comment=0006","replies":[]}]}]}]},{"poster":"Kynami","date":"2016-03-31T23:24:51.989+0000","up_votes":2,"down_votes":0,"body":"Think of them as samplers to \"whet\" the appetite. The company is banking on people being impatient and buying the keys or the combined box + key bundles.\n\nAs for what this actually is? Its basically the LoL version of a gachapon, designed to separate the end user from their money. The chances of you actually getting anything considered *highly valuable* are low. The only skins I've personally seen from my two freely unlocked boxes beyond the introductory one are old 520 RP legacy recolors. I still have another *four unopened boxes* and only one key shard towards the next one.","replies":[]}]}