{"poster":"Sirius Silver","date":"2017-01-02T21:36:08.437+0000","title":"De un devoto de la Soberana Oscura (7)","subforum":"Charlas Generales","up_votes":5,"down_votes":1,"body":"-El preludio de una vida de aventura y experiencias por vivir \n\nEl sol naciente se presenta, el cielo de color rojizo y azulado se muestra, la audaz caminante de humildes ropajes llega a su destino.\nCon osadia y confianza, presenta ante la guardia local al buscando asaltante, sin mostrar bien su identidad, oculta por sus tejidos de viajera.\nLa gente del lugar rodea al criminal, la dama de cabello plateado se deja acosar por el panico, y trata una salida de buscar en vano, ya que ella no es a quien a los lugare&ntilde;os desean la muerte.\nEl jefe de la guardia la deja de juzgar, prefiere ocuparse del sentenciado a muerte, antes que la gente se trasforme en una turba resilente.\nEl pago llega a las delicadas manos de la fragil dama, un bolsa llena de aureas monedas, una sonrisa no puede aguantar, mas con rapidez se retira del lugar.\nUna posada es su pensamiento siguente. Desea descansar y por fin alimentarse con algo delicioso, en el camino se distrae, un regalo de la naturaleza puede observar, frutos de la cosecha local, la ilucion la incita y la ansiedad la debilita, un humilde gusto no mas, sin mas que hacer, su camino retoma, esperando por fin una cama en la cual poder reposar.\nEl control de su poder absoluto es, pero con tanto dinero no sabe que hacer, la prudencia la invita a ahorrar y la vanidad a algo nuevo que usar.\nVestidos tipicos de Ionia, mas coloridos que lo que usa, recuerda su atuendo real, se toma su tiempo para pensar.\nEl asumir que su piel y sus cabellos claron son, como las nubes en un dia sin sol, el contraste de sus ropajes oscuro debe ser, solo para que asi su belleza pueda llegar a florecer.\nLa rutina la ha agotado, los ropajes de color negro por un tiempo se opone a usar, algo nuevo quiere ya, pero conciente es, que lo oscuro le va, de un aspecto zafiro su nueva tunica elejira, del color de la noche su nueva capa se pondra, y con unas botas que le combinen a la par, el encargado del telar admite dejarse enamorar, aunque puede que solo lo diga para que su negocio crezca sin mas.\nFeliz como una ni&ntilde;a sin igual, avanza nuevamente y espera esta vez que de su destino no se desvie, su cuerpo agotado esta, desea ya en un aposento poder estar, una posada puede divisar, paga el alojamiento de un dia y no mas.\nEl administrador del lugar le avisa de la comida y del cenar, pero la alegre y extenuada peregrina no lo escucha y entra en su nueva habitacion para al fin el descanso poder hallar.\nLos pensamiento fluyen como las noticias de la gente, el asaltante pronto encontrara la muerte, esto a la agotada dama no le incumbe ni le importa, agredece todo lo que tiene y finalmente se acomoda, para en un onirico mundo caer finalmente.\n\nDia 7 de protesta, por una skin que aprecie la belleza de la Soberana Oscura.\n\n{{item:3109}}  {{champion:134}}  {{item:3109}}\n\nparte anterior=> http://boards.las.leagueoflegends.com/es/c/charlas-generales/HtKWZy4W-de-un-devoto-de-la-soberana-oscura-6\n\nparte siguente=> http://boards.las.leagueoflegends.com/es/c/charlas-generales/0LGJJfVG-de-un-devoto-de-la-soberana-oscura-8","replies":[{"poster":"Sirius Silver","date":"2017-01-02T21:38:15.377+0000","up_votes":3,"down_votes":0,"body":"http://boards.las.leagueoflegends.com/es/c/charlas-generales/E2ApsUvK-de-un-devoto-de-la-soberana-oscura\nparte1\nhttp://boards.las.leagueoflegends.com/es/c/charlas-generales/2VplQe5M-de-un-devoto-de-la-soberana-oscura-2\nparte2\nhttp://boards.las.leagueoflegends.com/es/c/charlas-generales/WKzeizzN-de-un-devoto-de-la-soberana-oscura-3\nparte3\nhttp://boards.las.leagueoflegends.com/es/c/charlas-generales/9Ee2PNpv-de-un-devoto-de-la-soberana-oscura-4\nparte4\nhttp://boards.las.leagueoflegends.com/es/c/charlas-generales/f1LqHyT9-de-un-devoto-de-la-soberana-oscura-5\nparte5\nhttp://boards.las.leagueoflegends.com/es/c/charlas-generales/HtKWZy4W-de-un-devoto-de-la-soberana-oscura-6\nparte6\n{{item:3109}}","replies":[]},{"poster":"faster51","date":"2017-01-02T22:50:18.172+0000","up_votes":2,"down_votes":0,"body":"kappa","replies":[]},{"poster":"Hwaxinghz","date":"2017-01-02T22:28:26.612+0000","up_votes":2,"down_votes":0,"body":"Yo por mi parte sigo observando desde la oscuridad {{champion:134}} {{champion:45}} {{champion:56}} {{champion:60}}","replies":[]},{"poster":"Ingratitud","date":"2017-01-02T22:25:03.331+0000","up_votes":2,"down_votes":0,"body":"{{champion:134}}","replies":[]},{"poster":"Insane Sir","date":"2017-01-03T07:27:45.611+0000","up_votes":1,"down_votes":0,"body":"no devolvieron reclutamiento normal con cientos de post reclamandolo y te pensas que van a hacerle una skin ya mismo a syndra por que vos spameas? (igual creo que en cualquier momento le sacan una skin, pero no por que lo pedis vos)","replies":[{"poster":"FefiDC","date":"2017-01-04T03:04:35.045+0000","up_votes":1,"down_votes":0,"body":"Tranquilo bro, es obvio que no es una protesta por un skin. Es una historia hermosa sobre mi Syn. <3 \n\n\n[](http://.)\n[](http://.)\n_________________________________\n>Saludos. {{champion:134}}{{item:3211}}{{champion:84}}","replies":[{"poster":"Sirius Silver","date":"2017-01-04T05:38:54.107+0000","up_votes":1,"down_votes":0,"body":"De cierta manera es protesta, pero a mi manera, la verdad es lo minimo que sentia que podia hacer, ahora que algo pase es otra cosa. Pero asi almenos sabre que lo intente. Por otro lado siempre quise una historia sobre la soberana escribir, pongo mi mayor devocion en cada palabra.","replies":[{"poster":"FefiDC","date":"2017-01-06T08:36:22.257+0000","up_votes":1,"down_votes":0,"body":">_pongo mi mayor devocion en cada palabra._\n\nY se nota, está excelente. :)\n[](http://.)\n[](http://.)\n_________________________________\n>Saludos. {{champion:134}}{{item:3211}}{{champion:84}}","replies":[]}]}]},{"poster":"Sirius Silver","date":"2017-01-03T18:08:00.401+0000","up_votes":1,"down_votes":0,"body":"lee el prologo de la primera parte, mi guia algo entre locura y esperanza es, irrealista y fantasioso soy, no importa, me gusta hacer esto.","replies":[{"poster":"Donlans","date":"2017-01-04T06:28:59.330+0000","up_votes":1,"down_votes":0,"body":"y hay gente como yo que le gusta leer esto","replies":[]}]}]},{"poster":"FefiDC","date":"2017-01-04T03:52:12.691+0000","up_votes":1,"down_votes":0,"body":"Qué hermoso leer sobre la vida cotidiana de mi preciosa Syn, y con qué hermosas palabras describís su belleza. Me gustaría que alguien pudiera dibujar arte de esta historia. \n\n\n[](http://.)\n[](http://.)\n_________________________________\n>Saludos. {{champion:134}}{{item:3211}}{{champion:84}}","replies":[{"poster":"FurchiDC","date":"2017-01-04T03:52:59.781+0000","up_votes":1,"down_votes":0,"body":"Es mi smurf, me había olvidado que estaba con esa cuenta xD.\n\n\n[](http://.)\n[](http://.)\n_________________________________\n>Saludos. {{champion:134}}{{item:3211}}{{champion:84}}","replies":[{"poster":"Sirius Silver","date":"2017-01-04T05:36:58.292+0000","up_votes":1,"down_votes":0,"body":"si alguien se ofrece en ser un ilustrador de lo que escribo, siempre sera bienvenido","replies":[]}]}]}]}