{"poster":"Netfizz n Chill","date":"2016-07-25T11:54:50.707+0000","title":"Azir Nerfs?","subforum":"Gameplay & Strategy","up_votes":2,"down_votes":0,"body":"C&#039;mon Riot, don&#039;t nerf Azir. I mean, I don&#039;t main him or anything and seldom play him but these nerfs are way too much especially for a champion like Azir -high skill cap, great design in terms of lore and a completely unique kit. Everything about this champion ties in together and nerfing him will see the end to people playing him which would be such a waste...\r\n\r\n...and when you guys nerf a champ and nobody plays them anymore a rework is usually planned for them - which is a horrible idea because, as I said, Azir is such a unique champ his kit (or anything really) shouldn&#039;t be touched at all. On top of that, he has a really low winrate - at about 41% I think - so why would a champion with such a low winrate be nerfed even more? Meanwhile champions like Annie which don&#039;t take any mechanics and one-shot other champs get buffed. \r\n\r\nPlayers who main and master Azir probably have been swallowing his recent changes but this one would be the last straw for them in my opinion. Oh - I also said &quot;master Azir&quot; - which means that these players who have invested time and effort into mastering him will all be gone to waste and they&#039;d have to find another main because of these nerfs. And it&#039;s not like they can do anything about these nerfs either - his effectiveness in game has will be ruined. \r\n\r\nI really see no logic in nerfing a high skill cap, unique champion with a low win rate - especially when there are other champions who need more attention in terms of balancing. \r\n\r\n&quot;yeah nah let&#039;s nerf azir insted of focusin&#039; on heca or somthing mate&quot; - I mean, like **really?? **\r\n\r\nThese nerfs are ridiculous especially when compared to the kits and balance of other champs (*ahem* Ziggs and Azir&#039;s W nerf). There are way more pressing issues and things which the community wants to see like a Yorick rework - don&#039;t waste time beating Azir to death with the nerf hammer. \r\n\r\nBy nerfing him, so many things would go to waste, from his design to his pick rate. Buff Azir, but if anything please don&#039;t touch him. \r\n\r\n{{champion:268}} {{item:3070}}","replies":[{"poster":"FxH","date":"2016-07-25T12:04:16.924+0000","up_votes":3,"down_votes":0,"body":"problem with high skill cap champions is that they have a low winrate overall, but on the players with over a hundred games on said champion the winrate skyrockets, and riot seems to like to make every champion easy to play to their fullest","replies":[{"poster":"Nightjar","date":"2016-07-26T13:04:25.514+0000","up_votes":1,"down_votes":0,"body":"except with his recent nerfs his winrate after mastering him and at higher elo is still not amazing? Compared to a number of other high skillcap champions after mastery his winrate is now average for the investment. Honestly though I feel any further nerfs (like they plan) will screw him over. \n\nWith these nerfs he's balanced at high elo but in low elo he's garbage; and as someone who is the definition of low elo, I really don't mind. He's fun to play with high difficulty and low reward.  I really hate riot's design philosophy that there shouldn't be such a disparity between mastery of the champion and just being a beginner. I am bad but I feel like it ruins the aspiration to eventually master the champion.\n\n I love how unique and difficult azir is, and I'd honestly prefer that riot stop trying to simplify champion so that beginners like me can use them. Like the hell is with the nidalee changes? or the ryze rework? I'm bad at this game but please stop trying to compensate for me. I like a challenge and it's not like I'm going to play these champions and ruined ranked until I get the hang of them, no matter how long it takes.\nGames are supposed to be entertaining. I want difficult champions sometimes and other times I don't mind easy ones; but I like to have the diversity. Azir is fun and unique as he is and for that reason alone I might play him even if he's weak without high level skills.","replies":[]},{"poster":"Netfizz n Chill","date":"2016-07-25T12:44:26.215+0000","up_votes":1,"down_votes":0,"body":"I see where you're coming from. I think a lot of us would like a low winrate, high skillcap Azir than an easier but high winrate Azir","replies":[{"poster":"Erøse","date":"2016-07-26T07:37:15.978+0000","up_votes":1,"down_votes":0,"body":"Well said.","replies":[]}]}]},{"poster":"JasonWazza","date":"2016-07-25T13:16:14.448+0000","up_votes":1,"down_votes":1,"body":">On top of that, he has a really low winrate - at about 41% I think - so why would a champion with such a low winrate be nerfed even more? Meanwhile champions like Annie which don't take any mechanics and one-shot other champs get buffed.\n\nYour logic isn't right here, sure Annie doesn't take any mechanics, but that is the point.\n\nAzir takes a lot of mechanics, and realistically on a pro scene level is still going to be strong even with all the nerfs.","replies":[{"poster":"Netfizz n Chill","date":"2016-07-26T02:30:12.440+0000","up_votes":1,"down_votes":0,"body":"I doubt he'd be strong anymore after these nerfs especially compared to other mages","replies":[{"poster":"JasonWazza","date":"2016-07-26T03:11:11.083+0000","up_votes":1,"down_votes":1,"body":"His ult with a shirma shuffle is going to be too strong regardless of what other stuff he has.","replies":[{"poster":"Erøse","date":"2016-07-26T07:37:46.587+0000","up_votes":1,"down_votes":0,"body":"Look at all the mages this patch and compare them with azir.","replies":[{"poster":"JasonWazza","date":"2016-07-26T11:24:54.383+0000","up_votes":1,"down_votes":0,"body":"So which mage are you saying has a massive insec like move like Azir does?","replies":[{"poster":"Nightjar","date":"2016-07-26T13:08:41.101+0000","up_votes":1,"down_votes":0,"body":"even at high elo though with current batch of nerfs his stats are somewhat average for a midlaner. Sure he was strong a patch or so ago, but this patch his winrate is barely over 50% for high elo players who have played 125+ games with him. When mastered in his current state he's average and there are some alternative picks that appear to have higher winrates.\nI am unranked and probably bronze 5 but if you look at the stats there seems to be nothing wrong with his performance in high elo atm. His performance in low elo is appalling but I feel that's fine. I know I don't have any real experience here but he seems balanced at high elo from a statistical perspective.","replies":[{"poster":"JasonWazza","date":"2016-07-26T13:12:12.008+0000","up_votes":1,"down_votes":0,"body":"Just so we are clear, when i am refering to the pro scene, i mean actual pro games, which are 5v5 (LCS/LCK etc.).\n\nFact is he exists like thresh does to an extent, where even if you take out all of thresh's damage, he will still be really strong due to utility, and that is the same way with Azir.\n\nEven a rioter has gone to saying that for Azir to be balanced either he can't do his shuriman shuffle, or his power needs to be shifted in a rework.","replies":[{"poster":"Nightjar","date":"2016-07-26T13:25:16.084+0000","up_votes":1,"down_votes":0,"body":"oh ok I thought you mean high elo but more like soloQ. I don't know the stats for that but it seems azir is averagely popular in the last few patches. I do see your point where his shuffle is hugely gamechanging. I mean an interesting idea would be to bring back the idea of 'sand' (basically energy which he regens but call it sand for thematic purposes) instead of mana for azir.\n\nSo if he uses his ult it drains alot of sand and he can't use his full combo or he only barely has enough 'sand' to pull off a full combo at lvl18 if he has a full bar and maybe hitting/killing champions with his soldiers restores a scaling amount of sand?\nAnyways that's my very bronze take on how you might be able to balance it and it does tie in to his original design idea back when he was being made with the idea of storing up sand for his abilities but  from duelling instead of roaming. I feel the idea that if he uses his gamechanging shuffle then that is his main contribution to the fight would be cool but probably not viable since they already moved leona's ult away from that sort of gameplay.","replies":[{"poster":"Erøse","date":"2016-07-27T11:16:04.709+0000","up_votes":1,"down_votes":0,"body":"Pro scene and normal people like us are two different scenarios. Why do you care about the pro scene anyway, are you a pro player? Uh no. We are talking about normal ranking and his win rate is barely 50% lol","replies":[{"poster":"Nightjar","date":"2016-07-28T04:30:18.406+0000","up_votes":1,"down_votes":0,"body":"I'm just saying that he's now balanced in the pro scene and I kinda enjoy the fact that he's not great at low elo (I am bottom barrel garbage) because I feel that he should be a champion that requires intense skills and I don't want riot to try to cater for people like me; because where is the fun in mastering a kit if it's not challenging. I like the fact this game has the 'garens, warwicks and jannas' and the 'azirs, elises and threshs'; you can play something easy or try to learn something hard. It adds alot of diversity to the game.\n\nI'm just suggesting the sand mechanic might be fun because azir has both a gamechanging ult and seige potential and with pseudo sand/energy, at least if he changes a fight dramatically he has to sacrifice doing insane damage as well in that fight.","replies":[]}]}]}]}]}]}]}]}]}]},{"poster":"T3H UB3RN07","date":"2016-07-27T13:48:11.588+0000","up_votes":1,"down_votes":0,"body":"Riot is protecting us from seeing a massive wave of first time azirs in ranked.... Because that's what happens","replies":[]},{"poster":"Bambooze","date":"2016-07-27T10:56:21.190+0000","up_votes":1,"down_votes":0,"body":"These {{champion:268}} nerfs are mainly for the Worlds coming up, as he is either pick-or-ban.","replies":[]},{"poster":"Erøse","date":"2016-07-26T07:40:03.899+0000","up_votes":1,"down_votes":0,"body":"Meanwhile they are not nerfing champions like hecarim,yasuo,garen,darius,syndra etc.","replies":[]}]}