{"poster":"SirBufalo","date":"2019-05-04T18:12:30.400+0000","title":"Consigli su che role scegliere per scalare? Gesù sono disperato","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Ciao a tutti, oggi vi faccio una domanda che avrete letto e sentito quelle 200mila volte come minimo. \r\n\r\nUltimamente sto giocando sempre draft (da almeno un mese a questa parte), poiché prima rankavo in top e personalmente lo trovo un ruolo molto difficile per rankare, in quanto mi concentro molto sul farm e sul non morire e poiché da un lato i toplaner sono dei tank non affini a fare molte kill (o quantomeno non quanto dovrebbe essere un midlaner, poi vabbé dipende dal champ), così come anche poiché la top è abbastanza distante dal resto mondo (peraltro non uso TP perché mi è stato detto che finché sei bronzo/silver non sai usarlo, ed effettivamente non credo di saperlo usare al meglio), ho deciso di cambiare ruolo e giocare mid, in quanto tra le kill e lo snowball generale, come anche il roaming, penso si abbia molta più possibilità di carryare nel low elo. E specialmente perché nelle ultime ranked mi trovavo col team 0/25 e ogni aiuto che tentavo di dare mentre io ero 0/0/0 o al massimo 2/0/1 in teamfight risultava con un ulteriore feed da parte mia.\r\n\r\nOra, io non ho ancora ripreso a rankare, per il semplice motivo che mentre imparavo ad usare una pool di 4 champ circa da mid, da una settimana a questa parte mi sto trovando in gruppo con dei ritardati totali. Lo so che è facile dare la colpa al team e non prendersi responsabilità, infatti se ho scelto di cambiare role è proprio per avere la possibilità di imparare al meglio il macro e poter migliorare abbastanza da avere da me un impatto molto più effettivo, tuttavia mi sto trovando sempre più contro avversari allucinanti e compagni che a 20 minuti hanno 34 farm, non ascoltano una mazza, non dicono niente, non ribattono qualora io dica qualcosa di sbagliato, non mi dicono niente quando sono io a sbagliare, il meglio che fanno quando parlano è flammare nella loro lingua o dire cose che comunque non capisco. Ovviamente non cito nemmeno il penoso (a dir poco) kda perché oltre ad essere scontato sarebbe anche superfluo parlarne.\r\n\r\nIo mo non dico tutto questo perché voglia lamentarmi come una bambina picciosa, ma poiché sono conscio che IO STESSO ho molto da imparare, tuttavia come caspita faccio a migliorare se continuo a trovarmi con dei ritardati che non fanno altro che farmi confermare l'ipotesi che siano loro a far cagare e non mi mettono nemmeno nelle giuste condizioni di capire dove sbagli io? E soprattutto: se da una settimana a questa parte mi trovo in questa condizione, come diamine farò quando (E SE) tornerò a rankare?\r\n\r\nDetto ciò, considerando anche il fatto che io scelgo come ruolo nelle draft sempre mid e (come secondario) top, ma che sono più le volte che vengo autofillato giungla che top, quello che voglio capire è: quale può essere un ruolo su cui focalizzarmi per poter carriare anche da solo (senza contare l'abilità che ci vuole per riuscirci, ma quella si ottiene con tempo, pratica e gameplay e non si può assumere con una pillola)? Può essere la giungla? E se sì, devo metterlo come principale o come secondario? E considerato che come jungler faccio cagare non avendola praticamente mai giocata: come posso fare per accelerare i tempi? Scusatemi il post lungo e la crisi esistenziale ma se devo fare una domanda voglio farla come Cristo comanda. E dopo questa rima posso ritenermi soddisfatto almeno di qualcosa lol \r\n\r\nRagazzi fatemi sapere la vostra che se no torno a giocare a pokemon showdown e pace all'anima mia","replies":[{"poster":"SherlocktheGamer","date":"2019-05-05T14:18:24.307+0000","up_votes":1,"down_votes":0,"body":"scegliti un ruolo e usa sempre quello, vedi che scali. e possibilmente impara UN champ benissimo e poi altri 3 in caso di emergenza quando ti bannano quel champ (ad esempio io so usare benissimo {{champion:41}}  e con lui ho fatto b5 fino a s5 in 2 pomeriggi 2 season fa. quando lo bannavano o il team era tutto ad o tutto ap prendevo {{champion:98}} oppure {{champion:80}} )","replies":[]},{"poster":"RM is my bias","date":"2019-05-04T18:34:08.340+0000","up_votes":1,"down_votes":0,"body":"Sicuramente non il support. Parlo da main, e la riuscita della tua scalata è inversamente proporzionale al livello di ritardo dei tuoi compagni di squadra. {{champion:101}} \nA questo punto, il toplaner no, per i motivi che hai spiegato tu. \nIl jungler no. Basta un passo falso e FLAME FLAME FLAME\nIl support no, perchè a meno che tu non usi maghi op (es. Brand, Xerath, Zoe, Lux ecc) non hai possibilità di carriare se il tuo adc ha le mani bucate.\nA questo punto hai la midlane e l'adc, a te la scelta {{summoner:31}}","replies":[{"poster":"SirBufalo","date":"2019-05-05T07:53:40.803+0000","up_votes":1,"down_votes":0,"body":"Va bene ti ringrazio. Mi concentrerò sulla mid come sto facendo allora ;)","replies":[]}]},{"poster":"Aurelion Shmoll","date":"2019-05-04T19:52:02.402+0000","up_votes":1,"down_votes":0,"body":"Disciplina, basta che scegli un ruolo e ti ci dedichi. Basta che non lo cambi ogni due per tre.\n\nmid / jung sono più popolari a basso elo, ma puoi carriare da qualsiasi ruolo ad ugual modo","replies":[{"poster":"SirBufalo","date":"2019-05-05T07:53:07.808+0000","up_votes":1,"down_votes":0,"body":"Va bene","replies":[]}]}]}