{"poster":"SirBufalo","date":"2019-03-12T08:05:55.330+0000","title":"Build per Renekton?","subforum":"Campioni e gameplay","up_votes":1,"down_votes":0,"body":"Ciao a tutti, oggi vorrei chiedervi se aveste idee su quale build/rune usare per Renekton, se possibile buttando un occhio a quelle che io finora ho esaminato, dal momento che mi trovo un po' ad un punto morto. Premetto che, verso fine 2018, quando alcuni item non avevano ancora subito certe modifiche e la Shojin non esisteva (credo, boh), ero solito usare come rune PRECISIONE (con attacco sostenuto visti i 3 AA della W di Renekton full furia) + ISPIRAZIONE (+5% CDR e Stivali gratuiti, build presa da RTO che penso goda di una certa fama, essendo tra i migliori Renekton main... Che io sappia). \n\nVoglio però precisare questo: il problema che mi porta a creare questo topic non è la build di per sé, quanto il fatto che ho pensato: \"Se io vado top, tolgo posizione ad un possibile tank, essenziale per ingaggiare/svolgere i teamfight. Non farei un errore enorme, quindi, a non buildarmi abbastanza armor e MR, o, anzi, a non usare delle rune tanky alla radice? \nUltima premessa: mi ritengo ancora novizio, giocando da fine novembre 2018, quindi non imbizzarritevi se me ne esco con robe strane!\n\nVeniamo al dunque:\n\n1)Build che ho ideato con le rune precedenti (Precisione + ispirazione: stivali e +5% CDR)\n\n{{item:3071}} {{item:3161}} {{item:3074}} {{item:3053}} {{item:3026}} {{item:3111}} \n\nQuesta build particolarmente offensiva l'ho presa in considerazione perché si fa rapidamente il massimo del CDR che con la runa arriva al 45%, sfruttando poi il massimo potenziale dello Sterak perché sono tutti oggetti offensivi, compreso il {{item:3026}} \n\nHo pensato, come variante, di usare\n\n{{item:3071}} {{item:3156}} {{item:3812}} {{item:3074}} {{item:3026}}  {{item:3111}} \n\nIn questo modo rinuncio al bonus AD dello Sterak, ma quantomeno ho più MR\n\n2)Build che ho preso in considerazione dopo la riflessione sulla necessità di un tank (o off tank). Qui ho pensato di mettere la stessa pagina di rune di Precisione, mettendo però come seconda pagina Determinazione (bone plating + overgrow). Anche questa qui è basata sul maxare il CDR, pur non arrivando al 45%\n\n{{item:3071}} {{item:3065}} {{item:3812}}  + {{item:3742}}  OPPURE {{item:3026}} \n\nNel caso in cui io prenda {{item:3742}}  , concluderei poi con {{item:3074}}  e stivali\nNel caso in cui io prenda {{item:3026}}  , concluderei poi con {{item:3053}}  e stivali (perché sfrutterei un po' meglio lo Sterak visto il bonus AD di {{item:3026}}  )\n\nChe ne pensate? Considerazioni? Consigli? Sapete dirmi se faccio bene a preoccuparmi di essere tanky o se invece posso andare di prepotenza con le prime rune (cioè come seconda pagina Stivali Bonus e +5% CDR)? \nIMPORTANTE: se non vi è d'impegno, gradirei sapere cosa sbaglio nelle mie ipotesi e calcoli, se effettivamente commetto errori\n\nGrazie mille per la lettura!","replies":[{"poster":"Kata Ebbasta","date":"2019-03-14T13:00:15.437+0000","up_votes":1,"down_votes":0,"body":"Ho visto che hai detto che quando buildi la GA poi metti lo sterak perché sinergizza meglio con la AD della GA. Sono abbastanza sicuro che lo abbiano nerfato lo sterak nel corso della season scorsa e ora scala con la AD base e non quello degli oggetti, quindi non sinergizza piu. Potrei sbagliarmi chiedo conferma a qualcuno che ne sa un po' di più di me :).","replies":[{"poster":"SirBufalo","date":"2019-03-14T19:45:07.294+0000","up_votes":1,"down_votes":0,"body":"Va bene, quando puoi fammi sapere che ne pensi in generale, e se secondo te dovrei optare per la build aggressiva che ho proposto o se invece per quella più tanky per evitare di perdere teamfight nel late game. Grazie per la risposta!","replies":[]}]},{"poster":"Br0ken Sword","date":"2019-03-12T17:41:29.324+0000","up_votes":1,"down_votes":0,"body":"{{item:3077}} {{item:3161}} contro squishy o {{item:3071}} contro tank {{item:3047}} {{item:3161}} se hai fatto prima la {{item:3071}} e viceversa, {{item:3748}}  {{item:3026}} {{item:3053}}","replies":[]}]}