{"poster":"TheTR055","date":"2017-01-16T04:07:34.333+0000","title":"Who is Banned in Draft Pick And Who's banned in blind pick?","subforum":"[ARCHIVED] Help & Support","up_votes":1,"down_votes":0,"body":"I'm new so can you not use shorthands thx","replies":[{"poster":"Deep Terror Nami","date":"2017-01-16T13:41:56.600+0000","up_votes":1,"down_votes":0,"body":"Hey 1TyrannosaurRoss!\n\nIf you are asking how champion bans work in Draft and Blind pick, I can help explain how each one works\n\n> Blind Pick\n\nIn this mode, neither team can see the other's picks. The entire team picks the champions they will play with at the same time. They must decide amongst themselves who plays which role; typically the player that calls the role first gets it. Taking someone else's role they called first is frowned upon, but is still too common.\n\nThere are no bans in this mode. The enemy can pick the same champions your team has, and this is called a mirror match, though they don't always play in the same position.\n\n> Draft Pick\n\nIn Draft, there are two phases; the Ban phase, followed by the Pick phase. Each team takes turns banning champions, 3 each side. After that the teams take turns picking their champions. With the \"New Champion Select\" that Draft Pick uses, your position is decided by what you queued up for and what was assigned to you upon entering champ select; you can still trade with other players if they agree to it, and stealing roles is seen as a more severe offense than in Blind.\n\nYou can read more details on the Draft Pick mode here; https://support.riotgames.com/hc/en-us/articles/207267266-New-Champion-Select\n\nIf you were talking about player bans, that is a completely separate matter, so let me know if you have any more questions!","replies":[{"poster":"fazejanjan","date":"2018-03-13T15:38:23.602+0000","up_votes":1,"down_votes":0,"body":"I am kind of late on this but I want to submit a solution to the problem of \"instalocking\". My idea is a screen in the champ select where all roles are displayed and people have to click on it to get it. So whoever clicks it first locks it for the others. I have noticed that many players have connection problems and join to late into the champ select so they can't see which rolse are open and which are picked. That would make the game, \nespecially for new players that have to play blind pick, way healthier.\nI hope you consider my idea!\n\nGreetings","replies":[]}]},{"poster":"Targons Blade","date":"2017-01-17T04:50:36.884+0000","up_votes":1,"down_votes":0,"body":"*Deep Terror Nami* did a damn good job explaining the differences between the two, so I'm just going to +1 what they said and also mention that we have a pretty comprehensive guide for new players that you can find [**HERE**](http://na.leagueoflegends.com/en/featured/new-player-guide). I definitely recommend checking it out if you're still trying to figure out the basics of League. ^.^\n\nIf you have any other questions or need help with anything, please don't hesitate to ask. :)","replies":[]}]}