{"poster":"PhoenixRevival","date":"2016-07-27T13:16:01.732+0000","title":"Rhonan - L'ignobile ladro","subforum":"Creazioni della community","up_votes":3,"down_votes":3,"body":"(vi prego di leggere le note in fondo prima di commentare, GRAZIE)\n\nRhonan - L&#039;ignobile ladro \n\nRhonan &egrave; un ladro di origine noxiana. Al contrario dello stereotipo noxiano, lui non &egrave; una persona di indole cattiva e protegge i poveri di noxus considerati inutili per la guerra. &quot;Ignobile&quot; &egrave; un titolo che gli &egrave; stato affibbiato dalla guardia noxiana perch&eacute; &egrave; risaputa la sua tattica senza onore dell&#039;accoltellare alle spalle i propri nemici, o pi&ugrave; che nemici coloro che sono tra lui e il suo obiettivo. Senza scrupoli n&eacute; passato, trova disgustoso lo stato di odio e guerra che aleggia nelle periferie noxiane, dove risiedono i poveri, abbandonati al loro destino di stenti. In cerca costante di soldi, anche se non &egrave; mai stato catturato a volte &egrave; stato scoperto sul misfatto e la sicurezza &egrave; aumentata di livello a tal punto da essere quasi impossibile rubare. Dopo alcune rapine alle carovane per i guerrieri noxiani, che trasportavano cibo e armi in quantit&agrave;, si ritrov&ograve; in mezzo alle provviste un volantino spiegazzato che parlava della League of Legends, vide che l&igrave; poteva guadagnare a sufficienza da poter persino comprare onestamente le provvigioni per i suo compagni. Decise dunque di unirsi a nome degli indipendenti, rinnegando la sua citt&agrave; d&#039;origine, ma pronto comunque ad aiutare coloro i quali ne avessero bisogno, sia l&igrave; che altrove.\n\nP: Ladro senza onore - Rhonan ruba gold passivamente ogni volta che colpisce con un auto-attacco un campione nemico in base al danno inferto (1-99 danni 2 gold, 100-149 d 2,5 g, 150-199 d 3 g, 200+ 3,5 g)\n\nQ: Nessuna esitazione! - Rhonan lancia tre pugnali che infliggono x (+ x AD) danni in una forma conica. I pugnali attraversano i minion e i mostri della giungla di piccola dimensione, ma si fermano contro i campioni e i mostri grandi ed epici. (i minion della corsia prendono il 60% dei danni da questa abilit&agrave;)\n\nW: I vecchi trucchi funzionano sempre. - Rhonan Immagazzina passivamente delle trappole fumogene fino a 2. Attiva: posiziona una trappola grande due teemo che quando viene calpestata esplode infliggendo danni miseri ma attivando una coltre fumogena che impedisce di vedere chiaramente ci&ograve; che c&#039;&egrave; intorno al campione colpito, rallentandolo del 20% (tutto questo per 2 secondi). Se Rhonan colpisce con un auto-attacco il campione infligge un colpo critico bonus in base al livello e triplica il guadagno della passiva. Se invece il campione affetto dalla trappola viene colpito dalla Q di Rhonan prende il 30% di danni in pi&ugrave; e rimane stordito per 1 secondo ma l&#039;effetto della trappola cessa. Se ancora invece Rhonan colpisce il campione con la sua E questo viene lanciato al doppio della distanza e rimane stordito alla fine per 0,5 secondi. (Nessuno di questi tre effetti &egrave; cumulabile con gli altri.)\n\nE: Levati di mezzo! - Rhonan salta su un campione, un mostro piccolo o un minion da corsia bersaglio infliggendo x danni, rilanciando questi a met&agrave; della distanza del salto verso il punto di partenza. Quest&#039;abilit&agrave; interrompe le canalizazzioni ma non viene considerata come un knockback dalle altre abilit&agrave;. (Questa abilit&agrave; non pu&ograve; essere usata su mostri grandi o epici della giungla)\n\nR: Quando meno se lo aspettano. - Rhonan si lancia contro il campione nemico bersagliato diventando immune agli effetti di controllo e prendendo il 75% di danni in meno. Una volta che il bersaglio &egrave; stato raggiunto, questi viene immobilizzato per 1,5 secondo e gli vengono inflitti x (+ x AD)(+ x AP) oltre che il 25% della salute mancante del bersaglio. Se il campione colpito muore, Rhonan ottiene 50/75/100 gold bonus.\n\n______________________________________________________________________________________________________________\n\nNote di gameplay: 1. nella passiva &egrave; riportato &quot;ruba gold&quot; ma non ruba davvero l&#039;oro ai champ nemici, ma per lore suonava meglio.\n2. i danni della ultimate sembrano dannatamente alti lo so ma in realt&agrave; i danni di base gli scaling &quot;teorici&quot; sono bassi (tipo 50/100/150 + 0.25 AD bonus e 0.2 AP). Serve principalmente per immobilizzare un bersaglio, i danni sulla salute mancante servono per aiutare a giustiziare il bersaglio nel caso in cui abbia pochi HP dando un utilit&agrave; diversa.\n3. mi hanno fatto notare che la lega come canonicità quale \"iscriversi per vincere e trionfare bla bla bla\" ormai non funziona più, ma facciamo tutti finta sia solo un pretesto come tanti per combattere...\n...e poi chissà che il volantino non sia vecchissimo in realtà, andando a giustificare dunque la sua presenza.\n\nNota finale: l&#039;ho fatto perch&eacute; Kled non mi piace ma tipo ZERO e dunque ho pensato, perch&eacute; non farne uno io?\n {{sticker:slayer-jinx-wink}}","replies":[{"poster":"SickAnto","date":"2016-07-27T16:54:25.855+0000","up_votes":3,"down_votes":0,"body":">  si ritrovò in mezzo alle provviste un volantino spiegazzato che parlava della League of Legends, vide che lì poteva guadagnare a sufficienza da poter persino comprare onestamente le provvigioni per i suo compagni. Decise dunque di unirsi a nome degli indipendenti, rinnegando la sua città d'origine, ma pronto comunque ad aiutare coloro i quali ne avessero bisogno, sia lì che altrove.\n\nMi sto annoiando a ripeterlo ogni volta che c'è proposta di champ (-w-)'\nLa Lega non esiste più, non è più canonica.","replies":[{"poster":"PhoenixRevival","date":"2016-07-28T02:45:17.802+0000","up_votes":1,"down_votes":0,"body":"Shhhh è tutto ok ora\nè tutto ok uwu\n(era solo un pretesto per dargli un motivo, alla fine alla riot non fregherà mai nulla di questo post dunque mi bastava avere la soddisfazione di creare qualcosa di carino e basta)","replies":[]}]},{"poster":"oroora6","date":"2016-07-27T15:21:39.817+0000","up_votes":2,"down_votes":0,"body":"Ruba il gold gg wp noob champion\nNon è nello stile di riot","replies":[{"poster":"99White Terror99","date":"2016-07-27T17:04:46.798+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=oroora6,realm=EUW,application-id=P9Wi6QlB,discussion-id=lLQFZows,comment-id=0001,timestamp=2016-07-27T15:21:39.817+0000)\n>\n> Non è nello stile di riot\n\nSai vero che esiste questo tipo {{champion:4}} ?","replies":[{"poster":"oroora6","date":"2016-07-27T17:13:05.495+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=99White Terror99,realm=EUW,application-id=P9Wi6QlB,discussion-id=lLQFZows,comment-id=00010000,timestamp=2016-07-27T17:04:46.798+0000)\n>\n> Sai vero che esiste questo tipo {{champion:4}} ?\n\nUna cosa è guadagnare gold extra (anche DRAAAAAAAVEN ne guadagna) un altra è rubare gold\nLeggi bene prima di scrivere\nRubando gold tolto qualcuno è ti freddi senza neanche ammazzare il nemico, poche hit fatte a caso varrebbero quanto una kill tua","replies":[{"poster":"PhoenixRevival","date":"2016-07-28T02:39:24.698+0000","up_votes":1,"down_votes":0,"body":"> Leggi bene prima di scrivere\n\ndisse colui che non ha letto le note alla fine dove ho specificato che \"ruba\" è un termine riferito alla lore ma alla fine la sua passiva è come quella di twisted fate.","replies":[]}]}]}]},{"poster":"1NG Faabier","date":"2016-07-27T14:35:35.519+0000","up_votes":2,"down_votes":1,"body":"mh,carina l'idea ma la passiva (sebbene abbia molto a che fare con la sua lore) non mi fa impazzire,secondo me puoi fare di meglio...comunque,come ho già detto,l'idea è carina","replies":[]},{"poster":"edoxbox1","date":"2016-07-27T15:47:57.534+0000","up_votes":1,"down_votes":0,"body":"Se la R ha un rage elevato è sgrava.\nSe ha un range tipo malphite allor ok.\nPerò immunità ai cc e 70% danni in meno è tanto.","replies":[{"poster":"PhoenixRevival","date":"2016-07-28T02:45:43.200+0000","up_votes":1,"down_votes":0,"body":"sì ma IN TEORIA lui sarebbe un champ tipo talon, ma più improntato sull'infliggere cc (e vendere il culo in late per uccidere i carry prima di crepare male). Poi sicuramente ci sarà gente che lo builderebbe offtank ma quelli stanno antipatici a tutti","replies":[]}]}]}