{"poster":"PhoenixRevival","date":"2017-10-07T16:41:38.542+0000","title":"Mastery tokens: meglio ora o iniziata la preseason?","subforum":"Aiuto e supporto","up_votes":1,"down_votes":0,"body":"Allora, mi &egrave; corso per la mia testolina un quesito.\r\nOra come ora ho 6540 BE, diventeranno circa 42&#039;510 BE nuove, dunque se dovessi spendere 500 e 500 BE per due maestrie 6 che voglio fare rimarrei con 5540, che senza calcoli &egrave; ovvio starei di gran lunga sotto i 40&#039;000. Ho sentito (solo rumors dunque ...eh) che dopo l&#039;inizio della preseason combinare i mastery tokens coster&agrave; di pi&ugrave;, la mia domanda &egrave;: quanto di pi&ugrave;? Se il costo fosse di tanto superiore allora, virtualmente parlando, mi converrebbe farlo ora.\r\n**1. Sapete quanto coster&agrave; dopo? 2. Sono solo rumors?** e **3. secondo voi mi conviene spendere 1000 BE attuali o ???? BE nuove?**","replies":[{"poster":"Jeanne dˆArc","date":"2017-10-07T16:51:42.275+0000","up_votes":1,"down_votes":0,"body":"Il costo delle maestrie verrà moltiplicato x6,5 volte. La cifra in apparenza sembrerà maggiore, ma sarà proporzionata al quantitativo di BE che si otterranno.","replies":[{"poster":"PhoenixRevival","date":"2017-10-07T17:06:02.795+0000","up_votes":1,"down_votes":0,"body":"Ah dunque moltiplicano sia le be totali che i costi di maestrie e campioni per la stessa cifra, sempre 6,5?","replies":[{"poster":"Jeanne dˆArc","date":"2017-10-08T00:34:19.991+0000","up_votes":2,"down_votes":0,"body":"Si.","replies":[]},{"poster":"Power Mac","date":"2017-10-08T07:58:29.921+0000","up_votes":1,"down_votes":0,"body":"Non i campioni: lì il cambio sarà 1:1. Potenziare a maestria 6 un campione costerà 3500 BE. Per certi versi, riflettendoci, sarà meno di quanto si spende ora, perché attualmente non è detto che con due frammenti campione (costo 3400 PI) si riesca ad ottenere 500 BE, anzi, spesso ne servono tre se non addirittura molti di più (nei casi di estrema sfortuna possono capitare campioni super-economici); al di là delle altre fonti di guadagno attuali delle BE. \nQuindi il sistema oltre ad essere più economico sarà razionalizzato, perché ora la quantità di BE posseduta dipende in gran parte dalla fortuna, mentre con la pre-stagione i prezzi saranno fissi, senza sorprese insomma.","replies":[{"poster":"PhoenixRevival","date":"2017-10-08T14:41:14.151+0000","up_votes":1,"down_votes":0,"body":"oooooooook ora è tutto più chiaro, grazie ad entrambi per la pazienza! ♥","replies":[]}]}]}]}]}