{"poster":"Grona1992","date":"2015-05-06T08:11:37.865+0000","title":"Mein kleines Script/ Hack Einmal eins (KEINE ANLEITUNG!)","subforum":"Hilfe & Support","up_votes":7,"down_votes":5,"body":"Da mir die Ganzen Q.Q ich wurde gedroppt aufgefallen sind hier mal eine Ungef&auml;hre Erkl&auml;rung f&uuml;r Nicht Fachmänner was diese Hacks/ Scriptes eigentlich machen da 89% dieser Threads einfache DC beschreiben\n\nDrophack \"Droppt\" das Game. Soll hei&szlig;en das NIEMAND mehr IRGENDETWAS machen kann. Das Spiel wird zum Absturz (to drop = Etw. fallen lassen) gebracht. Dieser Hack trifft Riot und ist selbst f&uuml;r Riot nur sehr schwer zu lokaliesieren. Das Spiel hat also sogesehen nie stattgefunden und wird weder als Lose noch als Win f&uuml;r irgendjemanden gewertet\n\nDDos (Distributed Denial of Service) Hacks funktionieren nur wenn dein Gegen&uuml;ber deine IP Adresse kennt. Au&szlig;erdem erkennen G&auml;nige Virenprogramme diesen Hack. &Uuml;berpr&uuml;fen kannst du es in dem du Seiten mit aussreichender Kapazit&auml;t (z.B. Google) anpingst. Stellen wir uns vor der PC und Riot senden sich Briefe. Riot erz&auml;hlt in ihrem Briefen was die anderen machen, du erz&auml;hlst Riot was du machst. Alles ist wunderbar. Nun erf&auml;hrt ein Dritter deine Postanschrift und Senden so lange und soviele Briefe bis dein Briefkasten &uuml;berl&auml;uft und die Briefe von Riot irgendwann untergehen. Das hei&szlig;t auch das Briefe von anderen Anbietern untergehen unter dem Ganzen Spamm. Deshalb kann man z.B in dieser Zeit auch nicht zu Googel verbinden.\n\nScripter: Ein Script bewirkt das eine Handlung Automatiesiert wird. z.B kann ein Script den Verlauf f&uuml;r Skillshots berrechnen und somit den besten Weg zum Ausweichen berechnen und Ausf&uuml;hren (z.B eine Ez Ulty mit Flash &uuml;berspringen, mit einem Skill Dodgen usw.) oder kann dich z.B Instantlook ausf&uuml;hren (wenn jmd unterhalb 1 Sekunde einen Champ Pickt und Lookt muss er ein solches Script benutzen.)\n\nDer einzige mir bekannte Hack der einem im Ranked was bringen w&uuml;rde au&szlig;er ein Game aufzul&ouml;sen w&auml;re ein Lag Hack, der sehr leicht aufsp&uuml;rbar ist und auch nicht sehr verbreitet, da man ihn wirklich sehr pr&auml;zise ausfindig machen kann. Er l&auml;sst alle Gegner laggen wenn man auf eine Bestimmte Person zu geht bzw in einer gewissen Range ist. Das macht das treffen von Skillshots fast unm&ouml;glich da man die Tats&auml;chliche Position nicht mehr sieht und nur noch erahnen kann. Dieser Hack wird in der Regel noch mit einem Skill Dodge Skript gekoppelt um wirklich auf Nummer sicher zu gehen, da man sowieso mit diesem Hack sehr auff&auml;llt. \n\nIch kann fast ewig so weiter machen aber es gibt unz&auml;hlige Hacks und Scripts\n\nFalls jmd noch einen Hack kennt (Also mit Ursache und Wirkung) w&auml;re ich froh wenn er es darunter Schreibt. Je mehr von diesen Hacks/ Scripts bekannt werden um so besser, da man pr&auml;zisere Berichte an den Support senden kann und damit die Scripter / Hacker besser finden kann.\n\nMit freundlichen Gr&uuml;&szlig;en \nGrona1992\n\nP.s: W&auml;re sch&ouml;n wenn dieser Beitrag relativ weit nach oben gepinnt wird.","replies":[{"poster":"Ηastur","date":"2015-05-06T08:43:11.646+0000","up_votes":3,"down_votes":0,"body":"Der Titel ist vlt etwas irreführend.\nBesser wäre zB die Option: Hacks Ursache/Wirkung\nNur damit hier keiner Runtervotet, weil er denkt, du erklärst wie man hackt. Das dachte ich nämlich zuerst, als ich das Thema gesehen habe.","replies":[{"poster":"HeartCrusher97","date":"2016-02-06T11:28:43.082+0000","up_votes":1,"down_votes":3,"body":"***","replies":[{"poster":"Ηastur","date":"2016-02-06T16:19:47.196+0000","up_votes":2,"down_votes":0,"body":"Die Frage kann ich aufrichtig zurück  geben. Danke für deine Aufmerksamkeit. Schade dass das Verständniss für Worte fehlt.\nDer Beitrage ist im Übrigen 9 Monate alt und möglicherweise war mein Kommentar der erste hier und der Verfasser hat den Titel verändert.\n\nWie auch stets überall sonst, gillt auch hier: Erst denken, dann handeln.\nNachtrag: Ich sehe grade, dass du erst 19(?) bist. Tut mir leid, ich nahm an, dass der Bildungsstand in dieser Zeit und dem entsprechenden Alter immernoch dem, vor knapp 10 Jahren entspricht. Entäuschend sag ich da nur! Hät ich dieses Verhalten doch eher dem 20 Jahre später - aber in dieser Zeit - zugeordnet.\n\nFür einen ersten Beitrag, aber recht beeindruckend. Keep going! [weitermachen ;^)]","replies":[]}]}]},{"poster":"Neamhoilte","date":"2016-02-06T15:11:18.314+0000","up_votes":2,"down_votes":0,"body":"@HeartCrusher97:\n\n{{sticker:zombie-brand-facepalm}}","replies":[]},{"poster":"GG EASY BRAAHHHH","date":"2015-05-06T08:23:13.362+0000","up_votes":2,"down_votes":0,"body":"danke dir aber es wird nichts helfen","replies":[]},{"poster":"Noggy Wonder EUW","date":"2015-05-06T11:03:07.348+0000","up_votes":2,"down_votes":1,"body":"> [{quoted}](name=Grona1992,realm=EUW,application-id=7hciEY9w,discussion-id=Yo1iEAyB,comment-id=,timestamp=2015-05-06T08:11:37.865+0000)\n>\n> Falls jmd noch einen Hack kennt (Also mit Ursache und Wirkung) w&auml;re ich froh wenn er es darunter Schreibt. Je mehr von diesen Hacks/ Scripts bekannt werden um so besser, da man pr&auml;zisere Berichte an den Support senden kann und damit die Scripter / Hacker besser finden kann.\n> \n\n\n\nAlso, es gibt einen \"VisionHack\" das man mehr sieht. Ob das ein Script oder sonstwas ist, keine Ahnung. Man sieht mehr, durch so ein Programm... Rito hat das schon überprüft und Spieler gebannt.","replies":[{"poster":"Black Mage","date":"2015-05-06T12:16:43.502+0000","up_votes":1,"down_votes":0,"body":"Fog of War kann entfernt werden, bringt jedoch nichts, wäre mir neu wenn dies was bringen würde.\n\nWas du meinst ist der zoomhack","replies":[]}]},{"poster":"Nephirelle","date":"2015-05-06T09:04:21.729+0000","up_votes":1,"down_votes":0,"body":"Weder Drophack noch DDoS sind wirkliche \"Hacks\". Es braucht nahezu null Fachkenntnis oder auch nur einen einzigen \"Hackerschritt\", um sie durchzuführen.\nIch wüsste auch nicht, was Virenprogramme mit DDoS-Attacken zu schaffen haben sollten. Virenprogramme überprüfen dein System auf schädliche Prozesse, DDoS-Angriffe überfluten deinen Zugangspunkt mit unnötigen Anfragen. Das sind zwei verschiedene Universen.","replies":[{"poster":"Alustus","date":"2015-05-06T09:46:13.441+0000","up_votes":1,"down_votes":0,"body":"JA und Nein.\n\nWenn man es Richtig und bei großen etwas Sichereren Systemen machen will, sollte man schon ein bisschen Ahnung haben.\n\nAber bei 90% der Webseiten/Internetdienste reicht ein xbeliebiges programm welches man im Internet findet völlig aus.\n\n\nZumindest soweit ich das mit meinem Begrenzten wissen beurteilen kann. (bin da nicht so in der Materie drinn, also alles nur mutmaßungen von hören sagen lesen und ein bisschen logik)\n\nUnd um einmal anzumerken Drophacks sind meist nichts anderes als DDOs Attacken.\n\nDurch eine oder mehrere DDos Attacken wird der Server überlastet was zu dessen Ausfall führt was wiederum das Game auflöst.","replies":[{"poster":"Nephirelle","date":"2015-05-18T12:19:00.944+0000","up_votes":1,"down_votes":0,"body":"Nein, das ist ein Irrglauben. Du kannst nicht mit einem einzigen Rechner so viele Request generieren, um einen professionellen Server zu fluten.\n\nIch denke mal, dass diese falsche Idee aus den Anonymous-Attacken entstanden ist. Da haben sich die ganze Skript-Kiddies jeweils ein Programm runtergeladen, um koordiniert DDoS-Attacken zu fahren. Das funktioniert aber auch nur, wenn das sehr viele Leute parallel betreiben (oder eben ein Botnetz verwendet wird).","replies":[{"poster":"Alustus","date":"2015-05-18T13:39:40.851+0000","up_votes":1,"down_votes":0,"body":"Ich habe nie gesagt, dass alles über einen Rechner läuft.\nAber es gibt webseiten welche die Rechenleistung durch mehrere Rechner zu Verfügug stellen. (Wenn ich das richtig mitbekommen habe)\n\nWenn ich das richtig mitbekommen habe werden bei größeren Attacken sowieso im vorhinein von Dritten die Server gehackt um diese für einen Angriff zu verwenden.\n\nIst aber alles nur Halbwissen, lass mich gerne belehren.","replies":[{"poster":"Nephirelle","date":"2015-05-18T13:51:24.888+0000","up_votes":1,"down_votes":0,"body":"Man kann sich Zugriff auf Botnetze etc. kaufen. Ja. Aber das kostet Geld und das nicht wenig. Da ist es auch nicht mit einem einfach Herunterladen von irgendeinem Programm getan.\n\nAlternativ kannst du dir dein eigenes Botnetz aufbauen. Das ist durchaus mit Skript-Kiddie-Programmen zu machen. Ist aber ein sehr langwieriges und für einen selbst doch recht gefährliches Unterfangen. Der Aufbau ist dann wiederum Hacking, wenn auch ohne große Eigenleistung, allerdings nicht der DDoS-Angriff selbst, den du damit fährst. DDoS ist einfach kein Hacking.","replies":[]}]}]}]}]},{"poster":"Der SpuK","date":"2015-05-06T12:16:48.294+0000","up_votes":1,"down_votes":0,"body":"Was in letzter Zeit oft vorkommt, ist das ein Game started und man dann nicht weiter spielen und connecten kann. So ne Art Drophack?!","replies":[]},{"poster":"TurtleMari","date":"2015-05-06T11:26:20.953+0000","up_votes":1,"down_votes":0,"body":"Ich hab jetzt mal eine Frage dazu. Gestern Abend habe ich ein ARAM gespielt, soweit nichts ungewöhnliches, alle kamen Normal ins Spiel. Allerdings kaum als ich mir meine Items gekauft hatte und loslaufen wollte kam bereits der erste dc. Kann vorkommen, dachte ich mir.. also bin ich aus dem Spiel kurz raus, habe reconnected und dann ging es. Gefühlt weniger als 5 Minuten später der nächste dc, als ich wieder drin war wurde mir von einem Teammitglied gesagt, dass alle diesen dc haben und es wohl am Server liegt. Das ging dann noch etwa 4 mal so weiter mit dem ständigen diss- und reconnecten. Ich weis nicht ob die Gegner auch einen dc hatten geschweige denn, ob es irgendwie möglich ist die Namen der Spieler irgendwo ausfindig zu machen. Falls wer nachsehen möchte welches Spiel das gewesen wäre (ist ja nicht in meiner Matchhistory), dann wäre es zwischen meinem Morgana und Jinx Spiel. Kann man da noch irgendwas tun?\n\nE: Das Spiel ist zwar nicht in meiner Matchhistory, allerdings auf lolking zu finden.","replies":[]},{"poster":"Grona1992","date":"2015-05-06T08:26:50.265+0000","up_votes":1,"down_votes":1,"body":"Finde ich schon. Viele regen sich darüber auf aber die wenigsten können diese Spiele wirklich erkennen. Dadurch das man es erkennt kann man noch alle Namen aufschreiben und dem Support zusenden. Wenn das bei 5 Games passiert und immer der selbe Name genannt wird findet man solche Personen schnell und kann sie aus dem verkehr ziehen.","replies":[{"poster":"Black Mage","date":"2015-05-06T09:31:08.816+0000","up_votes":1,"down_votes":0,"body":"die die sich aufregen werden es weiterhin tun, genauso wie die, die keine anderen threads suchen mit dem selben problem auch nicht googlen ob sowas schon exestiert. auch viel zu fehlerhaft/zuviele lücken","replies":[]}]},{"poster":"Kaitri","date":"2015-05-06T08:26:46.615+0000","up_votes":1,"down_votes":0,"body":"finde die erklärungen ziemlich interessant. kannte mich mit diesem zeug nie so aus.","replies":[{"poster":"Black Mage","date":"2015-05-06T09:30:08.149+0000","up_votes":1,"down_votes":0,"body":"die hälfte ist falsch, wenn nicht sogar volkommen daneben, informiere dich dazu bitte woanders, du wirst merken worauf ich hinaus will. \n\nallein \"scripts\" passt zu 100%...","replies":[]}]},{"poster":"Grona1992","date":"2015-05-06T09:08:05.979+0000","up_votes":1,"down_votes":0,"body":".... wehrt DDoS-Angriffe ab, indem er auf die Anwendungsebene abzielenden DDoS-Traffic aufnimmt und den gesamten auf die Netzwerkebene ausgerichteten DDoS-Traffic, wie SYN Floods oder UDP Floods, umleitet und legitimen Datenverkehr an der Eintrittsstelle in das Netzwerk authentifiziert. Dieser integrierte Schutz ist immer aktiv und nur in Verbindung mit Port 80 (HTTP) bzw. Port 443 (HTTPS) stehender Datenverkehr wird zugelassen.\n\nSo funktioniert das da du dich damit anscheinend nicht wirklich auskennst","replies":[{"poster":"Black Mage","date":"2015-05-06T09:27:27.602+0000","up_votes":1,"down_votes":0,"body":"Dieser schutz funktioniert jedoch nicht, da man eine kleine variable in den paketen ändern kann und das system den angriff nicht als solchen werten wird und es ist kein antiviren programm vom pc,\n\nich sehe auch kaum \"patches\" die das system verbessern, da einfach es leicht zu umgehen ist, egal wieviel man ran drumschraubt","replies":[]}]},{"poster":"Black Mage","date":"2015-05-06T09:24:06.180+0000","up_votes":1,"down_votes":0,"body":"> Außerdem erkennen Gänige Virenprogramme diesen Hack (auf DDoS bezogen)\n\nFALSCH, ein DDos Angriff besteht darin deinen ROUTER anzugreifen, indem dort maßenhaft Pakete versendet werden, die er nicht alle bearbeiten kann, dein PC hat nichts damit zu tun, in den meisten Fällen (dann spricht man aber nicht über DDos), dadurch ist sowas ja auch \"gefährlich\" da man das nicht kommen sieht und man kaum was gegen machen kann, außer den router neustarten zu lassen und \"statische IP\" auszuschalten.\n\n\nzu \"anderen\" hacks: es gibt die ganzen Änderungen im clienten (aktives item auf trinket setzen, auf die \"hidden\" skillbar zugreifen, etc)","replies":[]},{"poster":"t0xicYasu0","date":"2016-11-06T19:00:08.802+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Grona1992,realm=EUW,application-id=7hciEY9w,discussion-id=Yo1iEAyB,comment-id=,timestamp=2015-05-06T08:11:37.865+0000)\n>\n> Da mir die Ganzen Q.Q ich wurde gedroppt aufgefallen sind hier mal eine Ungef&amp;auml;hre Erkl&amp;auml;rung f&amp;uuml;r Nicht Fachmänner was diese Hacks/ Scriptes eigentlich machen da 89% dieser Threads einfache DC beschreiben\n> \n> Drophack &quot;Droppt&quot; das Game. Soll hei&amp;szlig;en das NIEMAND mehr IRGENDETWAS machen kann. Das Spiel wird zum Absturz (to drop = Etw. fallen lassen) gebracht. Dieser Hack trifft Riot und ist selbst f&amp;uuml;r Riot nur sehr schwer zu lokaliesieren. Das Spiel hat also sogesehen nie stattgefunden und wird weder als Lose noch als Win f&amp;uuml;r irgendjemanden gewertet\n> \n> DDos (Distributed Denial of Service) Hacks funktionieren nur wenn dein Gegen&amp;uuml;ber deine IP Adresse kennt. Au&amp;szlig;erdem erkennen G&amp;auml;nige Virenprogramme diesen Hack. &amp;Uuml;berpr&amp;uuml;fen kannst du es in dem du Seiten mit aussreichender Kapazit&amp;auml;t (z.B. Google) anpingst. Stellen wir uns vor der PC und Riot senden sich Briefe. Riot erz&amp;auml;hlt in ihrem Briefen was die anderen machen, du erz&amp;auml;hlst Riot was du machst. Alles ist wunderbar. Nun erf&amp;auml;hrt ein Dritter deine Postanschrift und Senden so lange und soviele Briefe bis dein Briefkasten &amp;uuml;berl&amp;auml;uft und die Briefe von Riot irgendwann untergehen. Das hei&amp;szlig;t auch das Briefe von anderen Anbietern untergehen unter dem Ganzen Spamm. Deshalb kann man z.B in dieser Zeit auch nicht zu Googel verbinden.\n> \n> Scripter: Ein Script bewirkt das eine Handlung Automatiesiert wird. z.B kann ein Script den Verlauf f&amp;uuml;r Skillshots berrechnen und somit den besten Weg zum Ausweichen berechnen und Ausf&amp;uuml;hren (z.B eine Ez Ulty mit Flash &amp;uuml;berspringen, mit einem Skill Dodgen usw.) oder kann dich z.B Instantlook ausf&amp;uuml;hren (wenn jmd unterhalb 1 Sekunde einen Champ Pickt und Lookt muss er ein solches Script benutzen.)\n> \n> Der einzige mir bekannte Hack der einem im Ranked was bringen w&amp;uuml;rde au&amp;szlig;er ein Game aufzul&amp;ouml;sen w&amp;auml;re ein Lag Hack, der sehr leicht aufsp&amp;uuml;rbar ist und auch nicht sehr verbreitet, da man ihn wirklich sehr pr&amp;auml;zise ausfindig machen kann. Er l&amp;auml;sst alle Gegner laggen wenn man auf eine Bestimmte Person zu geht bzw in einer gewissen Range ist. Das macht das treffen von Skillshots fast unm&amp;ouml;glich da man die Tats&amp;auml;chliche Position nicht mehr sieht und nur noch erahnen kann. Dieser Hack wird in der Regel noch mit einem Skill Dodge Skript gekoppelt um wirklich auf Nummer sicher zu gehen, da man sowieso mit diesem Hack sehr auff&amp;auml;llt. \n> \n> Ich kann fast ewig so weiter machen aber es gibt unz&amp;auml;hlige Hacks und Scripts\n> \n> Falls jmd noch einen Hack kennt (Also mit Ursache und Wirkung) w&amp;auml;re ich froh wenn er es darunter Schreibt. Je mehr von diesen Hacks/ Scripts bekannt werden um so besser, da man pr&amp;auml;zisere Berichte an den Support senden kann und damit die Scripter / Hacker besser finden kann.\n> \n> Mit freundlichen Gr&amp;uuml;&amp;szlig;en \n> Grona1992\n> \n> P.s: W&amp;auml;re sch&amp;ouml;n wenn dieser Beitrag relativ weit nach oben gepinnt wird.\n\nhttp://boards.euw.leagueoflegends.com/de/c/allgemeiner-chat-de/bPqrhp8m-scripter-das-spiel-aus-ihrer-sicht-the-game-from-their-view-gereng","replies":[]},{"poster":"Bâkî","date":"2015-05-06T19:47:29.974+0000","up_votes":1,"down_votes":1,"body":"lol","replies":[]}]}