{"poster":"Doxige","date":"2017-06-23T19:10:53.308+0000","title":"Jugador ofendiendo a niños con sindrome de down","subforum":"Comportamiento del jugador","up_votes":3,"down_votes":1,"body":"Queria saber si alguien puede atenderme un caso de odio extremo (alguien de riot que controle los bans o algo)...se que es un juego, pero yo como hermano de un ni&ntilde;o con sindrome de down, no puedo quedarme solo en el &quot;reporte al final de la partida&quot; para ver que se puede hacer contra un jugador que llego a comparar a un ni&ntilde;o con sindrome de down con el CI de un gato al ir a defecar... entiendo que hay ni&ntilde;os y todo el tema, pero ver que un jugador asi sigue jugando... es bastante frustrante la verdad.. no por la liga, ni el nivel de juego ni nada.. si no que el nivel de decencia\r\nEso.. ojala que no quede solo en el reporte y nada mas...\r\nGracias.","replies":[{"poster":"SKT Teemo M7","date":"2018-02-20T15:21:22.436+0000","up_votes":2,"down_votes":0,"body":"felicidades con retraso meme xd sorry soy adicto a los momazos :v","replies":[]},{"poster":"iMâra","date":"2017-06-25T21:54:46.164+0000","up_votes":1,"down_votes":0,"body":"Saca screen y mandalas al soporte, nose si se podrá llegar a hacer algo con eso pero. Últimamente se esta castigando con mas eficacia a la gente toxica","replies":[]},{"poster":"iEban","date":"2017-06-24T00:10:21.899+0000","up_votes":1,"down_votes":0,"body":"Esta lleno de esos pobrecitos en el juego que usan para insultar ese tipo de cosas, yo más que reportarlos no puedo hacer.\nDan un toque de lástima.","replies":[]},{"poster":"zelaya19","date":"2017-06-23T21:08:59.272+0000","up_votes":1,"down_votes":0,"body":"Te recomiendo que mandes las pruebas al soporte. La verdad no entiendo porque te pusieron negativo, yo también tuve (qepd) a mi tío con Síndrome de Down, es un tema bastante serio y son gente que requiere bastante cuidado. La gente toma a la ligera pero ellos copian de otras personas esas actitudes.","replies":[]},{"poster":"00blivion","date":"2017-06-23T20:15:03.158+0000","up_votes":1,"down_votes":0,"body":"te aseguro q casi el 87% de los invocadores de lLAS como primero insulto dicen esas palabras .... basura de personas{{summoner:3}}","replies":[]},{"poster":"frionelmenssi","date":"2017-06-23T19:59:21.428+0000","up_votes":2,"down_votes":2,"body":"que les va a importar solo les importa seguir sacando skins y hacerse mas millonarios .","replies":[]},{"poster":"TheSilverCross","date":"2017-06-24T08:38:30.123+0000","up_votes":0,"down_votes":0,"body":"Lamentablemente solo puedo recomendarte lo mismo que los demás, un ticket al soporte.","replies":[]}]}