{"poster":"Black Tenshin","date":"2017-09-19T23:21:36.108+0000","title":"build de Vi  que me invente","subforum":"Guias y consejos","up_votes":3,"down_votes":0,"body":"{{champion:254}} \r\nQuisiera ayuda de la comunidad en cuesti&oacute;n a una build de Vi que &quot;cree&quot; (no se si soy el primero en usarla).\r\nLa build se basa en una vi bastante off tank, guiada a ir en contra de los personajes con mucha armadura y vida, en definitiva, personajes tankes.\r\nLa build usual de Vi seria algo tal que as&iacute;:\r\n                                                                     1.{{item:1400}}  2.{{item:3078}}  3.{{item:3742}} 4.{{item:3065}} 5.{{item:3143}}.\r\nEs una build estandar que sirve para la mayoria de los juegos (hay que decir que esta build sale de una pagina de ayuda &quot;[lol master](http://lolmasters.net/diamond/index#!)&quot;).\r\nAhora, esta seria mi build:\r\n                                                                     1.{{item:1413}} 2.{{item:3071}} 3.{{item:3025}} 4.{{item:3153}} 5.{{item:3065}}.\r\nEsta seria la build la cual me gustar&iacute;a que critiquen de forma constructiva, me dijeran de manera honesta que es lo que creen de ella y si la situaci&oacute;n en la que la utilizo es de forma correcta.\r\nGracias por prestarme atenci&oacute;n.","replies":[{"poster":"Axlbg","date":"2017-09-20T01:29:24.309+0000","up_votes":1,"down_votes":0,"body":"{{item:1400}} {{item:3047}} {{item:3153}} {{item:3071}} > {{item:3065}} {{item:3143}} \n\nNo hay ninguna razón para buscar la build que haces en lugar de esta.\n\nSin el guerrero se demora muchísimo más en limpiar la jungla y pierde el impacto en el juego temprano. \n{{item:3025}} Los stats de este item son muy pobres, te da muy poco daño y prácticamente nada de resistencias.\n\nEl resto está bastante bien dependiendo el orden en cuál los compres y el momento de la partida.","replies":[]},{"poster":"Vi Sexual","date":"2017-09-19T23:38:49.078+0000","up_votes":1,"down_votes":0,"body":"Cambiaria el guantelete por el sterak y gg\n\nPorque lo cambiaria? Estas usando Cinderhulk y una build que esta orientada para sacar provecho de una Vi tank, y a ver, Vi tank no es lo ideal, es luchadora/asesina, tiene que estar dura para iniciar? Si, pero tiene que tener daño para hacer algo una vez dentro. \n\nEl Guantelete tiene mucha sinergia con Vi por la pasiva del brillo, pero solo lo contruiria estando por detras en la partida y tengo un team enemigo con heavy ad. Tu build tiene items de daño (lo cual  esta perfecto) y esta orientada a tankearse (lo cual esta perfecto tambien, no ideal pero bien) y el Sterak tiene mas sinergia con ese objetivo de tirarse y aguantar.\n\nLa build ideal de Vi no es offtank, la mayoria la usa offtank, pero tiene un kit para ser un glass canon. Yo particularmente no uso ninguna de esas dos que pusiste, soy offtank pero con un poco mas de daño, para carrear.","replies":[]},{"poster":"Maiev Shadowsong","date":"2017-09-19T23:32:37.083+0000","up_votes":1,"down_votes":0,"body":"Pero eso se hace en Piltover","replies":[]}]}