{"poster":"Black Tenshin","date":"2017-09-17T01:04:14.084+0000","title":"Que feo no ser un server querido por tu creador :,(","subforum":"Charlas Generales","up_votes":7,"down_votes":1,"body":"Somos LAS, uno de los servidores del gran juego que es league of legends, y aun as&iacute; somos, probablemente, uno de los servers menos queridos por este mismo juego.\r\nPrimero, no tenemos rankeds 3v3 como otros servidores.\r\nSegundo, por el modo de juego URF, los servers estuvieron ca&iacute;dos un tiempo.\r\nTercero, ahora, ocurren otra vez problemas con el inicio de sesi&oacute;n, chat del juego y las colas clasificatorias.\r\nY lo peor de todo, es que en las encuestas sigo diciendo que este es un gran juego, que lo recomendar&iacute;a a un mont&oacute;n de gente, ya que es te es un muy buen juego, y me olvido por que un 80% de la gente que conozco en este server dicen &quot;que asco de servidor&quot;.\r\nEspero que en alg&uacute;n momento les interesemos a la gente de RiotGames y que nos den un server de calidad igual a los otros, o por lo menos, que estas cosas no sucedan tan seguido.\r\nGracias por ver esta critica en un momento de calentura del autor.","replies":[{"poster":"Mephazo","date":"2017-09-17T01:25:18.387+0000","up_votes":1,"down_votes":0,"body":"Esto no estaba planeado para nada, no sé que se quejan, Riot intentan arreglar esto, es más, a las 22:10 encontraron el error e intentaran arreglarlo, pero no hay que preocuparnos y creo que esto fue por lo de Miami o algo así, por la red, no sé, pero ya paren. Y esto le paso a LAN, LAS y BR, ellos no tienen server preferido :v.{{sticker:zombie-brand-facepalm}}","replies":[{"poster":"Tino","date":"2017-09-17T02:17:22.695+0000","up_votes":1,"down_votes":0,"body":"[](https://www.youtube.com/watch?v=4ue2a6wN_wo)","replies":[]}]},{"poster":"Baiken","date":"2017-09-17T01:05:42.827+0000","up_votes":1,"down_votes":0,"body":"... Entiendan, estas cosas ocurren por casos fortuitos, dejen de llorar...{{sticker:sg-lux-2}}","replies":[]}]}