{"poster":"jascha06","date":"2015-10-25T11:34:24.513+0000","title":"Kannin keinen spiel mehr rein","subforum":"Hilfe & Support","up_votes":1,"down_votes":1,"body":"Hey\r\n\r\nHeute ist es bei mir immer so wenn ich Leauge also den Launcher starte das direkt unten bei meienr Taskleiste immer ein kleienr Satz steht unzwar das hier LoLPatcher.exe - Datei besch&auml;digt\r\nDie Datei oder das Verzeichnis /Riot Games/ Leauge of Leends/RADS/rads_user_kernel.log9 ist besch&auml;digt und nicht lesbar. F&uuml;hren sie CHDSK aus.\r\n\r\nIchh bae keine ahnung was ich tun soll... ich habe schon repariert und wenn ich nochmal Leaugen eudownloaden will ist auch wieder ein Fehler...\r\n\r\nBitte um hilfe","replies":[{"poster":"Rirol","date":"2015-10-25T12:04:48.799+0000","up_votes":2,"down_votes":0,"body":"Da du eine Neuinstallation schon versucht hast, denke ich das der Bereich wo LoL installiert  wird ein paar defekte Cluster hat.\nDeswegen möchte Windows auch das du CHKDSK ausführst (hast du das eigentlich mal probiert?).\nFalls du es noch nicht probiert hast, geh mal auf **Start-Ausführen** und da gibst du **CMD** ein.\nIn dem Fenster das erscheint, gibst du **CHKDSK c: /f /r** ein, wenn du LoL auf C: Installiert hast.\nSonst c: halt durch d: oder e: oder wo auch immer du das LoL Verzeichnis hast ersetzen.\nDanach scant Windows deine Fesplatte und versucht beschädigte Sektoren/Cluster zu reparieren oder wiederherzustellen, in dem es die dort vorhandenen Daten verschiebt.\nUnd du solltest über eine neue Festplatte nachdenken. Die Fehler werden sich im laufe der Zeit häufen.","replies":[{"poster":"jascha06","date":"2015-10-25T12:17:20.801+0000","up_votes":1,"down_votes":0,"body":"Hy,\nJa ich habs schon ausprobiert und es hat immernoch nicht geholfen,\nAber ich habs schon geschafft leuage zu de instalieren. momentan downloade ich es neu.\n\nTrotzem danke","replies":[{"poster":"Rirol","date":"2015-10-25T12:42:45.112+0000","up_votes":1,"down_votes":0,"body":"Hast du mehrere Festplatten oder Partitionen?\nWenn ja Installiere es unbedingt auf einem anderen Laufwerk.\nViel Glück.","replies":[]}]}]},{"poster":"LikeLuc","date":"2015-10-25T11:40:48.730+0000","up_votes":1,"down_votes":0,"body":"neu instalieren sonst wiess uch auch nicht weiter","replies":[{"poster":"jascha06","date":"2015-10-25T11:45:49.213+0000","up_votes":1,"down_votes":0,"body":"Ich habe es schon versucht aber iwie funktoniert es nicht\n-.-","replies":[]}]}]}