{"poster":"Kekenik","date":"2018-01-18T17:55:28.248+0000","title":"kostenlos rp verdienen ?","subforum":"Champions & Gameplay","up_votes":2,"down_votes":1,"body":"moin es gibt eine seite wo man sich mit gutem spielen rp verdienen kann ghlaube die hie&szlig; ihrgenwas mit pawn oder so :) hoffen lcih wei&szlig; es jemand","replies":[{"poster":"Jastol","date":"2018-01-18T18:54:46.484+0000","up_votes":4,"down_votes":1,"body":"\"Kostenlos\" und \"Verdienen\" sind zwei Gegensätzliche Aussagen. Sonst könnte Ich ja auch sagen, dass mein Arbeitgeber mir kostenlos Gehalt zahlt, wenn ich für Ihn arbeite.","replies":[{"poster":"xAnomali","date":"2018-06-26T04:33:28.711+0000","up_votes":1,"down_votes":0,"body":"So, also ich musste mich extra einloggen um dadrauf eine antwort zu geben\nDu arbeitest Kostenlos bei deiner arbeit, und verdienst somit dein geld.\nEr zahlt dir somit Kostenlos .. ''OHNE KOSTEN(GELD)''\nbitte nichtmehr klugscheisern wenn du es nicht kannst, danke mfg","replies":[]}]},{"poster":"ToxicTeemoPolice","date":"2018-01-18T18:41:02.807+0000","up_votes":2,"down_votes":0,"body":"https://www.pwnwin.com/ meinst wahrscheinlich diese Website.","replies":[]},{"poster":"Amycos Cyrus","date":"2018-01-18T18:07:00.332+0000","up_votes":2,"down_votes":0,"body":"Meines Wissens sind alle derartigen Seiten zum Accounthacken da. Ich würde dir die Besuchung abraten.","replies":[{"poster":"Megamaexx","date":"2018-01-18T20:59:03.532+0000","up_votes":1,"down_votes":0,"body":"Gibt die ein oder andere Seite, wo die keine Accountdaten abgreifen, sondern stattdessen Coins verkaufen wollen, die mit Glück in RP-Codes getauscht werden können. Die Coins auf solchen Seiten kann man sich auch durch bloßes Spielen verdienen.","replies":[]}]},{"poster":"Mjölnir Kind","date":"2018-06-26T05:55:20.074+0000","up_votes":1,"down_votes":0,"body":"Es gibt auch eine andere Seite mit der dies möglich ist. Dort kannst du Skins oder RP gewinnen und die Seite finanziert sich mit Werbung.\n\nGrundsätzlich sag ich dir aber gleich, dass du lieber die Finger von solchen Seiten lassen solltest, weil das oft nur genutzt wird um an deine Accountdaten zu kommen!","replies":[]},{"poster":"vercinox","date":"2018-01-20T21:34:05.574+0000","up_votes":1,"down_votes":0,"body":"Hi leute, es kommt etwas spät aber ich habe diese seite seit 6-7 monaten benutzt und brauchte immer so 2,5 monate um z.b 6750 pwnwin.coins gratis zu holn welche ich dann in steam karten investierte die steam karten kamen immer so nach 4-6 stunden  an mit dem beinhalteten code (achtung wenn man sich steam karten holt wird es von $ in euro umgewandelt wovon dann 80 cent verloren gehen) aber die Seite lohnt sich vorallen für welche die besonders gut in lol sind und viel spielen (habe ingesamt schon 10$ durch pwnwin geholt) dabei ist alles auch sicher weil man nur seinen beschwörernamen angibt um dann auf diversen seiten wie op.gg nur spielverlaufe anguckt um die punkte zu berechnen.","replies":[]}]}