{"poster":"Aquanis39","date":"2016-10-14T07:38:26.488+0000","title":"LeBlanc update s7","subforum":"Skin- & Champion-Konzepte","up_votes":4,"down_votes":1,"body":"Da LeBlancs Thema als T&auml;uscherin mehr hervorgehoben werden soll, k&ouml;nnte man den Klon zum Beispiel auf eine aktive F&auml;higkeit legen, wodurch man ihn &ouml;fter nutzen kann, jedoch auch entscheiden kann/muss wann man ihn benutzt. Also z.B. so:\n\nPassive: LeBlancs F&auml;higkeiten markieren Gegner f&uuml;r 3 Sekunden. Diese Markierung kann sie durch andere F&auml;higkeiten ausl&ouml;sen wodurch Gegner  \n30 + (4*lvl)+(25% AP) Schaden erleiden.\n\nQ: LeBlanc wird f&uuml;r 0,5 Sekunden unsichtbar und erschafft danach ein f&uuml;r 7 Sekunden lang bestehendes Spiegelbild und l&ouml;st alle Markierungen ihrer Passive aus. Das Spiegelbild verursacht keinen Schaden, jedoch l&ouml;sen die normalen Angriffe Markierungen der Passive aus.\n\nR (f&uuml;r die q): Leblanc erschafft nach 0,5 Sekunden Unsichtbarkeit (alle Spiegelbilder werden auch unsichtbar) ein weiteres Spiegelbild (um die Verwirrung komplett zu machen kann sie also 2 Spiegelbilder beschw&ouml;ren) welches alle vorhandenen Markierungen der Passive ausl&ouml;st. Die Angriffe des Spiegelbildes verursachen (33,3%/66,6%/100% Ad) + (10% Ap) Schaden und l&ouml;sen Markierungen der Passive aus. Zus&auml;tzlich erleiden Gegner w&auml;hrend das Spiegelbild besteht zus&auml;tzlich 50/100/150 + (10/12.5/15% Ap) Schaden durch die Passive. \n\nP.S: &Uuml;berleg doch mal, ob du nicht deine Meinung &uuml;ber diese Idee teilen m&ouml;chtest ;)","replies":[{"poster":"Freakskiller88","date":"2016-10-14T11:01:59.959+0000","up_votes":2,"down_votes":0,"body":"AD LB INCOMING. ja GG liebe ADC viel spaß.","replies":[{"poster":"Aquanis39","date":"2016-10-14T11:11:55.824+0000","up_votes":1,"down_votes":0,"body":"Hmmmm. Vlt sollte man die Skalierungen doch rauslassen.... {{champion:7}}","replies":[{"poster":"Freakskiller88","date":"2016-10-14T11:19:32.669+0000","up_votes":1,"down_votes":0,"body":"die sollten garkeinen schaden machen: weil du hast jetzt deine q + Ult q drausen und du baust jetzt ad LB und hast nen {{item:3085}}  , {{item:3072}} und nen  {{item:3031}} . Dann kannst du dich ez verpissen wärend deine klone 6 gegner (teoretisch) einfach aus dem leben Kritten und man sich dann gegen 3 (du spielst ad lb midlane und dein team hat auch nen ADC zb {{champion:222}} ) dann dürfen sich deine gegner mit 3 abnormal starken ADC rumschlagen (falls du auch noch auf die einballerst is ende mit 4 adc und 3 weiteren teammates) und es gibt immerhin noch 3 andere spieler aus deinem team das wäre einfach viel zu strak. lass das mit  der ad weg dann geht das denke ich.","replies":[{"poster":"Aquanis39","date":"2016-10-14T11:25:10.839+0000","up_votes":1,"down_votes":0,"body":"1. Das Spiegelbild von der q macht keinen Schaden.\n2. Skalierungen weglassen heißt das Spiegelbild macht keinen Schaden.\n3. Balancen ist nicht mein Ding x'3\nAber was nicht ist, kann ja noch werden {{champion:99}}","replies":[{"poster":"Freakskiller88","date":"2016-10-14T11:28:29.900+0000","up_votes":1,"down_votes":0,"body":"die ap skalierung sollst du drin lassen und die ad entfernen das meine ich \n\n\"(10% Ap) Schaden und lösen Markierungen der Passive aus. Zusätzlich erleiden Gegner während das Spiegelbild besteht zusätzlich 50/100/150 + (10/12.5/15% Ap) Schaden durch die Passive.\"\n\nbtw ich kenn einen der hat das mit den champions entwickeln und so voll drauf. soll ich dir mal von dem die champion idee schicken?","replies":[{"poster":"Aquanis39","date":"2016-10-14T11:47:44.647+0000","up_votes":1,"down_votes":0,"body":"Das wäre jedenfalls eine gute Option. \nChampion Idee? Her damit owo","replies":[{"poster":"Freakskiller88","date":"2016-10-14T11:52:09.247+0000","up_votes":1,"down_votes":0,"body":"kannst dich ja mit ihm in verbindung setzten. denke er wird dir helfen wenn du ihn fragst kenn ihn halt auch nur wegen dem post sonst nich ^^","replies":[]}]}]}]}]}]}]},{"poster":"Freiherr Alex","date":"2016-10-14T08:20:48.968+0000","up_votes":2,"down_votes":0,"body":"Fänd ich ziemlich cool. Würde den Aspekt Illusionistin immerhin unterstreichen. Davon merkt man ja jetzt im Moment nicht all zu viel.","replies":[]},{"poster":"Pumá D Ace","date":"2016-10-14T18:59:21.293+0000","up_votes":1,"down_votes":0,"body":"Kennt jemand noch diese yugioh karte ,,magische hüte\" ? Da kann man ja nen monster unter einem von 4 hüten verstecken und der gegner muss quasi raten unter welchem. Sowas wäre doch ein nettes upgrade zB für ihre passive. Ungefähr so: droppt LB unter einen bestimmten %-satz an HP, dann werden 3 klone von ihr sichtbar, mit der echten also insgesammt 4. Der gegner hat dann die wahl welche der 4 er angreift. Um das ganze aber fair zu machen, kann keine der 4 LBs sich für eine bestimmte zeit bewegen. Außerdem kann man die echte nicht durch sachen wie ignite oder blue/redbuff identifizieren. \nWäre sicher ganz lustig und über parameter wie den cd dieser passiven (sollte recht hoch sein, etwa so wie anivias egg) oder die dauer der bewegungsunfähigkeit zu balancen. Hätte außerdem counterplay in form von aoe dmg, wo man dann halt alle 4 LBs killen kann und somit safe den kill hat.","replies":[{"poster":"Aquanis39","date":"2016-10-14T19:05:10.051+0000","up_votes":1,"down_votes":0,"body":"YU-GI-OH O_O *hyped yu-gi-oh fan*\nDas wäre echt lustig :< aber das würde dann ein bisschen weird sein: Ich meine es müsste begrenzte Zeit sein, aber dann könnte der Gegner ja einfach warten bis die passive ausläuft. \nPotential *check*\nUmsetzung *Verbesserungswürdig*\nLustig *AUF JEDEN FALL*\nAlso witzig wärs..... {{champion:99}}  *lux main freut sich*","replies":[]}]},{"poster":"Sidaraoxpar","date":"2016-10-14T15:08:48.428+0000","up_votes":1,"down_votes":0,"body":"unbalanced und wieder unbalanced genau wie vorher unbalanced","replies":[{"poster":"Aquanis39","date":"2016-10-14T16:35:12.568+0000","up_votes":1,"down_votes":0,"body":"Inwiefern denn?\nDu könntest dein Problem etwas konkreter beschreiben damit es leichter nachvollziehbar ist. {{summoner:13}}","replies":[]}]},{"poster":"Devilshroom","date":"2016-10-14T11:40:49.298+0000","up_votes":1,"down_votes":0,"body":"Die passive wäre dann ne bessere Lux passive :P","replies":[{"poster":"Aquanis39","date":"2016-10-14T11:52:18.087+0000","up_votes":1,"down_votes":0,"body":"Naja halb. Ehrlich gesagt habe ich mich auch an der Lux Passive orientiert.\nDer Unterschied liegt jetzt darin, dass\n- Lux Passive durch einen Aa ausgelöst wird\n- Lux Basewert bzw pro lvl Wert besser ist\nSomit muss LeBlanc mehr Ap bauen um auf den gleich Wert wie Lux zu kommen.\n---->Lux ist ein Mage der zusätzlich noch auf Aa setzen muss.\n---->LeBlanc kann mehr mit ihrer Passiven Arbeiten durch ihre Spiegelbilder muss jedoch aufpassen, dass sie sich nicht selbst verrät (dein Spiegelbild löst die Passive durch einen Aa aus und du bist grad am wegrennen, blöd gelaufen).","replies":[]}]},{"poster":"Kata Ga Kill","date":"2016-10-14T08:48:00.900+0000","up_votes":2,"down_votes":4,"body":"Und ich frag mich was dieser Post soll?\n\nIst nicht bös gemeint, aber Riot steckt schon richtig tief in der Materie drinne um LB und Ihr neues Kit kann schon endgültig feststehen und wird momentan mit Tests feingeschliffen wie ich vermute.\nDen in 2-3 Wochen wird Ihr Rework veröffentlich werden.","replies":[{"poster":"Freiherr Alex","date":"2016-10-14T08:52:55.136+0000","up_votes":3,"down_votes":2,"body":"Es geht dabei ja auch immer nur um ein paar Spielereien und Spinnereien.\nIch kann mir nicht vorstellen dass jemand der ein Champkonzept raushaut, davon ausgeht das das eine Chace hat ins Spiel zu kommen. Wenn hier und da mal etwas Ähnlichkeit hat mit einem bestehenden Konzept, dann ist das wohl eher darauf zurückzuführen dass es schon zig tausend solche Konzepte gibt und da immer mal etwas dabei sein kann was ähnlich ist. Zufall also.\n\nWenn du Sonntags mal zuhause rumsitze, hast du ja auch sicher manchmal lust auf (zum Beispiel) Schokolade und sagst \"Jetzt mal n Stück Schoki wäre geil\". Obwohl man weiß dass die Läden zu haben :)","replies":[]}]}]}