{"poster":"Kindschubser BOB","date":"2017-12-22T21:39:48.447+0000","title":"Umfrage an Spieler von F2P-Spielen","subforum":"Allgemeiner Chat","embed":{"description":"Online Umfrage: Umfrage zu kostenpflichtigen Angeboten in Free-to-Play Videospielen","url":"https://www.umfrageonline.com/s/bcb73aa","image":"https://d3b6lzr0g0g97j.cloudfront.net/old/images/favicon-large.94fba019.png"},"up_votes":2,"down_votes":1,"body":"Hallo zusammen,\r\n\r\nich wei&szlig; nicht in wie weit das jetzt unkonventionell ist und ob es gegen Regeln verst&ouml;&szlig;t hier etwas anzupreisen, jedoch mache ich gerade eine Umfrage im Zuge meiner Bachelorarbeit und richtet sich gezielt an Spieler von F2P Games und dem Kaufverhalten, wieso man f&uuml;r kostenlose Spiele Geld investiert.\r\n\r\nEs w&uuml;rde mich riesig freuen, wenn ihr das lest und euer Interesse geweckt ist, kurz an meiner Umfrage teilzunehmen.\r\n\r\nVielen Dank im Voraus und ansonsten besinnliche Tage und wir sehen uns in der Kluft! :)","replies":[{"poster":"zLives","date":"2017-12-23T09:20:53.657+0000","up_votes":1,"down_votes":0,"body":"Hmmm man kann toll aussehen ingame und hat keinen Vorteil hingegen zu den anderen ist für mich das wichtigste bei LoL, andere F2P sind in 90% der Fälle meines erachtens nach Pay 2 Win also schön davon Finger weg lassen :P dann habe ich das Problem, dass ich denke das 90% der spiele auch irgenteine Trojaner bestimmt haben (stimmt wahrscheinlich nicht) deswegen lasse ich auch davon die Finder weg und spiele nur spiele die es auf Steam Blizzard Origin Uplay gibt mit der Ausnahme halt auch Leauge of Legends........ God damn ich bin wieder vom Thema abgerutscht","replies":[]},{"poster":"Kind Prow","date":"2017-12-22T21:48:36.658+0000","up_votes":1,"down_votes":0,"body":"Nich dein Ernst :D Medieninformatik und interaktives Design in Mittweida? Kann ich dich adden und n bissl ausfragen? Ich wär nämlich dies Jahr beinahe genau da gelandet, hätt ich mich nicht kurz vorher umentschieden, und es is immer noch ne Option für mich für nächstes Jahr.\nDas ist ein ganz mieser, verrückter Zufall ^^","replies":[{"poster":"Kindschubser BOB","date":"2017-12-22T21:56:04.573+0000","up_votes":1,"down_votes":0,"body":"hab dich geadded :)","replies":[]}]}]}