{"poster":"Coppins","date":"2017-07-05T15:36:00.068+0000","title":"Master Yi + Kayle","subforum":"Discussioni generali","up_votes":1,"down_votes":0,"body":"Parlate, mi affido alla vostra saggezza","replies":[{"poster":"zYaichi","date":"2017-07-05T17:28:21.793+0000","up_votes":3,"down_votes":0,"body":"{{champion:10}} Un minion con gli scudi e le cure che non potrà fare nulla finchè il suo senpai con la spada non lo ganka\n{{champion:11}} un appassionato di cultura orientale con una spada,grande estimatore di campi di giungla che gankerà solo il suo angelo custode in toplane ignorando le altre due lane e tutti i draghi,però almeno l'herald lo prende.\n\nIn ogni caso bastano due cc per farmare master yi e finire il game il prima possibile","replies":[{"poster":"Don Draven","date":"2017-07-06T02:00:31.572+0000","up_votes":1,"down_votes":0,"body":"Haha belle descrizioni\n\nAd ogni modo non appoggio l'osservazione,se yi è bravo qss su uno stun e q sull'altro ed ha ancora il flash e i 3 secondi della ulti di kayle più il michael di kayle","replies":[]}]},{"poster":"AreyeZ","date":"2017-07-05T16:54:34.360+0000","up_votes":3,"down_votes":0,"body":"Se ti riferisci alla \"Chinese boosting strategy\" prega il tuo dio che non ti capiti mai questo tipo di premade nella TUA squadra perchè la gente continua a non capire come funziona.","replies":[{"poster":"Philippicus","date":"2017-07-05T17:56:30.826+0000","up_votes":1,"down_votes":0,"body":"Mi è capitato qualche giorno fa. I due split pushavano da soli e bastavano due della loro squadra per fermarli mentre io e il resto del team non riuscivamo a reggere il 3v3 o in alcuni casi il 5v3. Mentre loro provavano a distruggere il primo inibitore top (non riuscendoci) intanto i nemici erano arrivati da due lane alle torri del nexus...","replies":[]}]},{"poster":"Jon Moxley","date":"2017-07-05T15:40:04.618+0000","up_votes":1,"down_votes":1,"body":"{{champion:113}} + {{item:3075}} = GG","replies":[{"poster":"Don Draven","date":"2017-07-06T02:01:14.813+0000","up_votes":1,"down_votes":0,"body":"{{item:3153}}","replies":[]}]},{"poster":"Don Draven","date":"2017-07-06T00:37:55.142+0000","up_votes":1,"down_votes":0,"body":"http://matchhistory.euw.leagueoflegends.com/it/#match-details/EUW1/3250424819/202979075?tab=overview\n\nhttp://matchhistory.euw.leagueoflegends.com/it/#match-details/EUW1/3250494411/202979075?tab=overview\n\nhttp://matchhistory.euw.leagueoflegends.com/it/#match-details/EUW1/3250446965/202979075?tab=overview\n(in questa l'adc alla fine ha lasthittato tutto il loro team nulla togliere che comunque aveva giocato molto bene di suo,sta di fatto che ancora una volta non avevamo una frontlane e divavamo.)\n\nmolto forte,forse come kogmaw lulu pre nerf,a differenza che koggie attaccava a distanza (molto importante).\n\n{{champion:10}} pur ammettendo che è molto forte penso sia giusta,per cominciare ci vuole una kayle molto brava,che riesca a giocare passiva ed arrivare ad avere il censer quanto prima nonostante le aggressioni del top nemico visto che kayle sarà parecchio inutile da sola (il game con 7 kill è dove kha è riuscita a ucciderla) oltre a questo anche la reattività di kayle nell'ultare e curare yi nella mischia\n\n{{champion:11}} poi ci deve essere il buon yi,molti mi tireranno i sassi addosso dicendo che è un champion nabbo e che basta un cc a elo alto(poi sono i primi che non sanno giocarci contro perché i cc li missano)e tra l'altro loro sono i primi che non sanno sfruttarlo al massimo e possibilmente neanche vincerci un game(come chi ne perde la maggiorpare con sta comp -.-\"),lui deve arrivare il prima possibile ad avere la bloodrazor,poi schivare gli stun di 4 persone per volta,utilizzare il proprio qss andare molto aggressivo sempre tenendo d'occhio kayle alla quale deve comunque tenere al suo passo e eliminare tizi aggressivi nei suoi confronti.\n\n\nAppurando però che ci siano 2 bravi player,si forma una cosa schifosamente sgrava alla kog maw lulu o vayne lulu per chiarirci e si può fare letteralmente 2v5 tant'è che ho fatto penta nel primo game e se noti avevamo TUTTE le lane vincenti,se quel tizio non mi proponeva sta combo e io accettavo 100% perdevamo.\n\n**SE POTETE ABUSATENE PERCHE' E' FREE ELO!!,se non sapete usare i champ bene provate in normal,se non è cosa vostra non fatelo che poi leggiamo gente quaggiù che scoraggia la strategia e poi mi trovo gente in champion select che dice di tutto e di più -.-**","replies":[]},{"poster":"mangialavandini","date":"2017-07-05T15:47:28.748+0000","up_votes":1,"down_votes":0,"body":"\n{{champion:11}}+ {{champion:25}} + {{champion:61}} = GG","replies":[]},{"poster":"Player A","date":"2017-07-05T15:42:24.270+0000","up_votes":1,"down_votes":0,"body":"stunn. Preferisco un y8i + kayle che un yi+ morg","replies":[]}]}