{"poster":"Kakerlaknschwarm","date":"2018-10-09T17:12:48.918+0000","title":"Suche Mitspieler im Ranked Bereich Silber-Gold","subforum":"Clans & Teams","up_votes":1,"down_votes":0,"body":"Hallo zusammen,\r\n\r\nnachdem vor einiger Zeit wieder mit League angefangen habe, suche ich nach einigen frustrierenden Niederlagen jemanden, der gerne mit mir zusammenspielen m&ouml;chte.\r\n\r\n\r\nZu mir:\r\nIch bin m&auml;nnlich, 23 Jahre alt und habe unter der Woche immer nach 18 oder 19 Uhr Zeit.\r\nDas Wochenende spiele ich normalerweise nicht, und falls doch, dann kein Ranked.\r\n\r\nIch kann eigentlich alles au&szlig;er ADC einigerma&szlig;en spielen, am besten bin ich aber als Jungler oder Support.\r\nMein Championpool besteht zum Gro&szlig;teil aus Tanks und Onhit-Junglern.\r\nWenns sein muss, eigne ich mir auch gerne neue Champions an, dann musst Du aber mit ein paar Niederlagen leben, bis ich den Dreh raushabe.\r\n\r\nZu dir:\r\nDu bist geistig einigerma&szlig;en reif, und kannst zu denselben Zeiten spielen wie ich.\r\nVoicechat ist ein Muss. In welcher Form ist mir wurscht - ich habe Discord, Skype, TS und den Ingame-Voicechat gibts ja auch noch.\r\nDeine Position ist mir grunds&auml;tzlich wurscht, aber wenn du kein ADC bist, werde ich keinen Support spielen.\r\nIch habe zu viele ADC&acute;s gehabt, die nicht in der Lage waren, vern&uuml;nftig zu lasthitten.\r\n\r\nWo wir bei dem Thema sind: Ich erwarte, dass du deine Lane zumindest halten kannst.\r\nDu musst nicht auf Challenger-Niveau spielen, das tue ich ja auch nicht, aber wenn du regelm&auml;&szlig;ig deine Lane mit 0/5 verl&auml;sst, dann spielst du mir zu unvorsichtig. Da bringt es mir auch nix, wenn du die andere H&auml;lfte deiner Games mit 5/0 aus der Lane gehst.\r\nAusnahmen best&auml;tigen die Regel, jeder hat mal miese Games.\r\n\r\nZur Elo: Ich bin aktuell Silber II und hatte auch noch nie Probleme, da hin zu kommen.\r\nZiel w&auml;re also Gold. Du solltest irgendwo in der N&auml;he sein. Ob Silber V oder Gold III ist mir relativ wurscht.\r\n\r\n\r\nNoch was: \r\nIch fluche manchmal. Ich werde nicht dich zusammenschei&szlig;en, aber wenn Du das absolut nicht abkannst, dann sei hiermit gewarnt.\r\nUnd du solltest kritikf&auml;hig sein. Wenn du als Leona dein Q zuerst maxst, und dann sauer bist, wenn ich dir versuche zu erkl&auml;ren, warum das Bl&ouml;dsinn ist, dann schreib mich erst gar nicht an. Hab ich n&auml;mlich alles schon gehabt.\r\n\r\nAber das ist alles relativ, ich bin in 3 Jahren nicht aus der Liga der Gentlemen geflogen, also kann ich so b&ouml;se gar nicht sein.\r\n\r\n\r\n\r\n\r\nFalls Du interessiert bist, dann schreib mir doch ingame (Kakerlaknschwarm) oder hier im Forum.\r\nWir w&uuml;rden dann testweise mal ein Normal spielen und schauen, ob es passt.","replies":[]}