{"poster":"Windrenz","date":"2016-04-02T02:46:28.508+0000","title":"URF discussion, please support with your opinion","subforum":"Miscellaneous","up_votes":2,"down_votes":2,"body":"Sure they release URF the last two years in April first but they have not this time. Unfortunately the community (well majority) isn&#039;t seemingly happy as they prefer URF and their lack of information on the situation has lead to some inconvenience.\r\n{{champion:119}}  day seems to be a hit and will be on &#039;til the 3rd, afterwards i believe the Rotating Game queue will begin on the following weekend (Friday night &#039;til Monday morning).\r\nPlease hold your opinions. \r\nRiot is a game company meant to entertain. If they were to receive too much negative comments, surely they would act upon the desires of their community (surely they are taking this into account right now to already have). We all have different thoughts on how we like League and their decisions are vital in order to keep their community entertained and positive. \r\nOne of the problems i believe is shown in this game is their response to their community, however i can&#039;t be for sure.\r\nPlease, i ask you to comment your thoughts and hopefully a Riot employee within the forums will come across this thread and take note. Everyone has different opinions and this thread will help display it in a much organised way.\r\nI thank you for your moments, really.","replies":[{"poster":"fattyhotdogs","date":"2016-04-02T06:16:06.609+0000","up_votes":2,"down_votes":0,"body":"People will always be more inclined to log into boards to display their distaste for something rather than approval. So you can't really relate a trend on the boards to the opinions of the wider community","replies":[]},{"poster":"Saythes","date":"2016-04-02T03:38:08.941+0000","up_votes":3,"down_votes":1,"body":"I honestly can't stand this draven stuff... I mean, it was funny at first, but now it's just stupid. The rotating game mode thing is a good idea, but it just simply means we get less Urf time, which is really upsetting. Please riot, if you want to make us happy this April, please release the manatee... I wanna play urf in my holidays!","replies":[]},{"poster":"PubgamerAU","date":"2016-04-02T11:44:59.276+0000","up_votes":2,"down_votes":1,"body":"There is no lack of information. URF mode will appear in the rotational queue twice this year.\n\nStfu and stop crying.","replies":[]},{"poster":"Talon12","date":"2016-04-02T08:57:08.324+0000","up_votes":2,"down_votes":1,"body":"hmmm. maybe...\n\nSHUT UP YOU WHINY BRATS!\n\nand what do you mean draven be a hit until 3rd? it lasts till 4th and it was only funny for first game or two, but after the first few it became stupid and annoying. Thats why they are gone.","replies":[{"poster":"DipperOCE","date":"2016-04-02T13:16:46.182+0000","up_votes":1,"down_votes":0,"body":"Draven heads already gone btw. They cancelled cause everyone was bichin online.","replies":[{"poster":"Talon12","date":"2016-04-02T13:58:22.470+0000","up_votes":1,"down_votes":0,"body":"yeah. pretty sure i already said that.","replies":[]}]}]},{"poster":"TrashDonnut","date":"2016-04-03T07:39:41.406+0000","up_votes":1,"down_votes":0,"body":"Riot said 2 weeks before that URF wouldn't be out, community still went apeshit when they figured out URF wasn't out.","replies":[]},{"poster":"Nijel","date":"2016-04-02T09:26:02.511+0000","up_votes":1,"down_votes":0,"body":"April Fools' is a day to do something unexpected and if the thing you do is totally expected you're kinda doing it wrong. In these regards Draven Day checks the boxes. Does it compare in quality to URF mode? For most people probably not, but you can't blame Riot for trying to do something different, especially when you consider that they are now free to do anything they want next year (and every year afterwards) because \"tradition\" won't be factor.","replies":[]},{"poster":"Clizz","date":"2016-04-02T08:25:48.705+0000","up_votes":1,"down_votes":0,"body":"This draven mode is a good april fools joke, a bit of sillyness is what april fools jokes is. I do love URF mode but what's a joke if you know the punchline. I think that's the mentality of rito atm with this. There's still time and I do hope it's an inventive way to release URF. I still hold out hope","replies":[]},{"poster":"Windrenz","date":"2016-04-02T02:48:24.100+0000","up_votes":1,"down_votes":0,"body":"At first, i attempted to create a poll, however it wouldn't allow me to post the discussion for some reason. I'd like to start off by asking to fix the issue because it took a while to create it. {{item:2050}} {{item:3070}}","replies":[]}]}