{"poster":"Cry of the Celts","date":"2018-11-18T22:31:03.437+0000","title":"Piccola domanda per ADC","subforum":"Campioni e gameplay","up_votes":1,"down_votes":0,"body":"Buond&igrave;, sono un piccolo ADC in un limbo tra argento e oro (forte per argento, scarso per oro). Attualmente gioco principalmente 3 campioni: {{champion:22}} {{champion:15}} {{champion:51}} , ai quali volevo aggiungerne uno, ma non uno a caso... volevo aggiungere un ADC che possa essere buildato anche AP (in caso, disgraziatamente, gli altri 4 fossero tutti AD).\r\nLa scelta era ricaduta su {{champion:110}} , dato che {{champion:145}} e {{champion:96}}  non mi attirano tanto.\r\nLa domanda &egrave;: {{champion:110}}  con build AP &egrave; ancora minimamente viabile, oppure non &egrave; proprio possibile farlo funzionare? In caso non fosse possibile farlo funzionare, altri campioni che hanno una possibilit&agrave; in corsia inferiore che buildano AP, ce ne sono attualmente? (es.{{champion:74}} {{champion:50}} {{champion:115}} )\r\n\r\n{{sticker:sg-soraka}}","replies":[{"poster":"Rinnegatamante","date":"2018-11-19T18:22:20.505+0000","up_votes":1,"down_votes":0,"body":"Puoi provare {{champion:45}} APC","replies":[]},{"poster":"Ellε","date":"2018-11-19T13:11:13.792+0000","up_votes":1,"down_votes":0,"body":"Varus hybrid o ap è ottimo. Il dps è altissimo e i danni magici dati dall'esplosione delle cariche di corruzione sono altissimi. La build migliore è : Botrk, Guinsoo, Dente di nashor, zonya, rabadon e scarpe at speed.","replies":[]},{"poster":"Runä","date":"2018-11-19T08:40:18.036+0000","up_votes":1,"down_votes":0,"body":"Ultimamente Varus funziona bene con la build da ibrido, ma puoi sempre provare a farci dei game e vedere come ti trovi, alla fine va anche a gusto personale a questo elo.\nSinceramente non ti consiglio molto di optare per i campioni che hai citato sotto, piuttosto se vuoi continuare a giocare adc effettivamente con la possibilità di buildarti  ap, la migliore rimane kai'sa (anche se dopo l'ultimo nerf, viene usata solo in certi casi).","replies":[]}]}