{"poster":"Sanity Prime","date":"2018-01-10T10:02:54.901+0000","title":"Fragebogenuntersuchung zum Thema Spielerverhalten (~10Min.) + Gewinnspiel (bis zu 60€ RP!)","subforum":"Allgemeiner Chat","up_votes":2,"down_votes":2,"body":"***UMFRAGE BEENDET! VIELEN DANK AN ALLE TEILNAHMER!***\n\nHallo zusammen,\n\nim Rahmen einer Studie der Universit&auml;t Siegen f&uuml;hren zwei Bekannte von mir zur Zeit eine Befragung durch, um das Spielerverhalten (insbesondere &quot;toxic behavior&quot;) in League of Legends genauer zu untersuchen.\n\nMit eurer Teilnahme an der Studie helft ihr ihnen sehr weiter und nehmt gleichzeitig an einem Gewinnspiel teil, in dem insgesamt 5 RIOT-Points Gutscheine verlost werden. Der Fragebogen dauert in etwa 10 Minuten.\n\nHier der Link zur Umfrage: *CLOSED*\n\nVielen Dank f&uuml;r eure Unterst&uuml;tzung und weiterhin viel Erfolg im Spiel!\n\nPS: Gerne k&ouml;nnt ihr den Fragebogen weiter verbreiten! Vielen Dank!\n\n{{sticker:slayer-pantheon-thumbs}}","replies":[{"poster":"Strohhut2X","date":"2018-01-11T06:19:40.770+0000","up_votes":2,"down_votes":0,"body":"ich hab euren post mal in nem therad im NA-forum verlinkt :D dann habt ihr vllt noch n paar mehr daten :)","replies":[{"poster":"Sanity Prime","date":"2018-01-12T12:56:17.916+0000","up_votes":1,"down_votes":0,"body":"Danke ;-)","replies":[]}]},{"poster":"DrunkenRedPanda","date":"2018-01-10T10:44:35.340+0000","up_votes":2,"down_votes":0,"body":"Eine deutsche Version wäre nett. Zwar kein muss, aber hilfreich.","replies":[{"poster":"Sanity Prime","date":"2018-01-10T13:36:05.021+0000","up_votes":1,"down_votes":0,"body":"Da stimme ich dir zu. Da jedoch die Beudeutung der einzelnen Fragen und Antworten bei der Übersetzung verfälscht werden könnten, gibt es die Umfrage lediglich in englisch.","replies":[{"poster":"Lagbeard","date":"2018-01-10T17:45:03.645+0000","up_votes":1,"down_votes":0,"body":"Glaub mir, meine Übersetzung verfälscht sie mehr :D","replies":[{"poster":"iwannadolucyliu","date":"2018-01-10T23:43:13.715+0000","up_votes":1,"down_votes":0,"body":"nur wenn man google übersetzen läßt...","replies":[{"poster":"El Pingu","date":"2018-01-11T00:03:50.585+0000","up_votes":2,"down_votes":0,"body":"> [{quoted}](name=iwannadolucyliu,realm=EUW,application-id=YnZkMR0R,discussion-id=gAwXxlsj,comment-id=0001000000010000,timestamp=2018-01-10T23:43:13.715+0000)\n>\n> nur wenn man google übersetzen läßt...\n\nEs gibt schlimmeres Englisch als das Google Englisch.\n\nGlaube mir, ich arbeite bei der Eisenbahn.","replies":[{"poster":"Qbert","date":"2018-01-11T06:24:38.986+0000","up_votes":1,"down_votes":0,"body":"you wörk for the irontrain? \n\n*wörk wörk*","replies":[]}]}]}]},{"poster":"Qbert","date":"2018-01-10T13:44:18.368+0000","up_votes":1,"down_votes":1,"body":"Dann muss man die Antworten aber dennoch in Deutsch zulassen, da das Spiel ab 12 spielbar ist.\nWenn ihr nun die Antworten ins Englische übersetzt, steht ihr vor der selben Bredouille wie bei dein Fragen.... \n\nEntweder ihr befragt also lediglich die Community, welche Englisch als Muttersprache hat, oder ihr übersetzt die Fragen in die jeweilige Muttersprache der Community.\nOder aber ihr lasst das Argument fallen \"eine Übersetzung könnte das Ergebnis verfälschen\", was mMn übrigens quatsch ist.","replies":[]}]}]},{"poster":"Azima","date":"2018-01-10T13:21:08.661+0000","up_votes":2,"down_votes":0,"body":":x Wieso ist das dann nicht im Spielerverhalten-Teil?","replies":[{"poster":"Sanity Prime","date":"2018-01-12T12:57:18.212+0000","up_votes":1,"down_votes":0,"body":"Guter Hinweis. Der Thread wurde im besagten Teil entfernt, da er nicht in zweifacher Ausführung in verschiedenen Foren existieren darf :-/","replies":[{"poster":"Azima","date":"2018-01-12T14:59:43.453+0000","up_votes":1,"down_votes":0,"body":"Dann hättest du ihn hier vorher löschen müssen, wenn du ihn im schwarzen Teil des Forums erstellen möchtest.\n\nGlaub jetzt ist es auch egal *(oder du machst einfach eine andere Überschrift, änderst den Text, machst aber die gleiche Umfrage - das geht vielleicht)* **hust**","replies":[]}]}]},{"poster":"XenesisCH","date":"2018-01-10T18:31:57.877+0000","up_votes":1,"down_votes":0,"body":"Aus reiner Neugier möchte ich gerne wissen, was die Ersteller des Fragebogens bei \"Gender\" alles als \"other\" definieren? ","replies":[{"poster":"iwannadolucyliu","date":"2018-01-10T23:42:16.428+0000","up_votes":1,"down_votes":0,"body":"\"other\" ist englisch für \"andere\" also alles was nicht vorher aufgeführt wurde, ich hoffe ich konnte dir helfen :)","replies":[{"poster":"XenesisCH","date":"2018-01-11T06:56:34.975+0000","up_votes":1,"down_votes":0,"body":"Danke, aber mir geht es nicht um die Übersetzung ;).\n\nDie Frage ist wie folgt im Fragebogen:\n\nGender:\n- Male\n- Female\n- Other\n\nWer fühlt sich denn bei dieser Frage diskriminiert, wenn nur Mann/Frau zur Auswahl stehen würde? Gibt es beim Pass oder bei der ID beim Geschlecht auch schon mehr als m/w? Sprechen wir hier von Transgender, Hermaphroditismus oder was denn genau? Die Bezeichnung \"other\" finde ich irgendwie sehr_ ungenau_ , offenbar benötigt es heutzutage mehr als zwei Auswahlmöglichkeiten, aber warum bzw. weshalb und wer ist denn damit gemeint?","replies":[{"poster":"Homunculi","date":"2018-01-11T09:18:48.566+0000","up_votes":1,"down_votes":0,"body":">wer ist denn damit gemeint?\n\nAlle die einen seltsamen Fetisch haben und daraus gleich ein neues Geschlecht machen müssen.\n\n>Wer fühlt sich denn bei dieser Frage diskriminiert, wenn nur Mann/Frau zur Auswahl stehen würde?\n\nLeute die ein seltsames Selbstwertgefühl haben und meinen sich selbst wichtiger zu machen als sie sind.\n\nMan merkt garnicht das ich den Schwachsinn nicht mag oder?","replies":[{"poster":"XenesisCH","date":"2018-01-11T09:39:43.606+0000","up_votes":1,"down_votes":0,"body":"> Man merkt garnicht das ich den Schwachsinn nicht mag oder?\n\nNein überhaupt nicht, der zynische Unterton deiner Stimme fehlt mir^^. Ich könnte mir vorstellen, dass die Homunculi aus z. B. Fate/Apocrypha als _Other_ durchgehen, du darfst dich gerne outen :P","replies":[{"poster":"Homunculi","date":"2018-01-11T10:02:43.256+0000","up_votes":1,"down_votes":0,"body":"Ich bin weiß, männlich, hatte schon immer ein Glied und bin Heterosexuell o_O, ob das jetzt als outen gilt weiss ich nicht xD.\n\nHab von der Serie bisher nur die erste Folge gesehen, also kann ich dazu nichts sagen^^. Wenn das auf den Namen anspielen sollte, dann hat das einen anderen Hintergrund :P, hat zu einem kleinen Teil etwas mit dem Anime Full Metal Alchemist zutun.","replies":[{"poster":"XenesisCH","date":"2018-01-11T10:58:35.428+0000","up_votes":1,"down_votes":0,"body":"Es sind doch in beiden Fällen **künstlich ** erschaffene Menschen. Tut mir leid es ist schon über eine Dekade her als ich Fullmetal Alchemist, die Serie, gesehen habe und ich muss auch sagen, dass ich keinen Plan von der Story und den meisten Charakteren mehr habe :3\n\nMeine Aussage war aber eher sarkastisch gemeint, da ich eigentlich auch der Meinung bin, dass eine Unterscheidung zwischen mit und ohne Glied vollkommen ausreichend sein sollte. Aber wahrscheinlich ist das wohl prähistorisches Denken heutzutage :P.\n\nPS: Ja, der Thread war sehr unterhaltsam :)\n\n> [{quoted}](name=Homunculi,realm=EUW,application-id=KYnfKGf0,discussion-id=h8mH5cpq,comment-id=0002,timestamp=2017-02-08T09:31:54.847+0000)\n>\n> Nettes Thema :).\n> \n> Als es damals bei mir soweit war, habe ich gerade die Anime Serie &quot;Fullmetal Alchemist&quot; (die erste nicht Brotherhood) gesehen. Da ich wusste, das man als eine Art Zauberer einen Champion befehligt und ich kurz vorher aus Interesse mal den Wikipedia Eintrag über Homunkulus gelesen habe, kam mir der Name doch recht passend vor^^.\n> \n> Ihr glaubt nicht wieviele den Namen nicht richtig ausprechen können xD. Meist recht amüsant im TS: &quot;Homo...Homi...Humun&quot;","replies":[{"poster":"Homunculi","date":"2018-01-11T12:02:26.117+0000","up_votes":1,"down_votes":0,"body":">Meine Aussage war aber eher sarkastisch gemeint, da ich eigentlich auch der Meinung bin, dass eine Unterscheidung zwischen mit und ohne Glied vollkommen ausreichend sein sollte. Aber wahrscheinlich ist das wohl** prähistorisches Denken heutzutage** :P.\n\nJain, aus meiner Sicht, wir leben  in einem Binären System was das angeht, ohne jetzt Zwittern die Existenz absprechen zu wollen, wer sich darüber mukiert das er doch was besonderes ist, ist aus meiner Sicht einmal zu oft vom Wickeltisch gefallen.\n\nDas solls aber erstmal mit dem Thema gewesen sein, nicht das es wieder wegen Offtopic auf die Finger gibt^^.","replies":[{"poster":"Sanity Prime","date":"2018-01-12T12:55:55.950+0000","up_votes":1,"down_votes":0,"body":"Interessanter Konversationsverlauf, ich lasse das mal wertneutral stehen ;-) Danke für das Ausfüllen!","replies":[{"poster":"HookEmUp","date":"2018-01-23T08:22:36.369+0000","up_votes":1,"down_votes":0,"body":"Hat noch jemand eine EMail mit dem Gewinn bekommen? Ich bin bei sowas ja immer skeptisch....","replies":[]}]}]}]}]}]}]}]}]},{"poster":"Qbert","date":"2018-01-11T06:24:00.399+0000","up_votes":1,"down_votes":0,"body":"Apache Kampfhubschrauber bspw.","replies":[]}]},{"poster":"HookEmUp","date":"2018-01-10T10:09:34.034+0000","up_votes":1,"down_votes":0,"body":"Warum werden bei der zweiten Frage die Wörter erst zensiert und anschließend hingeschrieben?^^","replies":[]}]}