{"poster":"ronnyd4nce","date":"2016-04-18T23:12:21.736+0000","title":"Lag con los ms bajos.","subforum":"Charlas Generales","up_votes":3,"down_votes":0,"body":"Hace una semana vengo con un drama que ya me tiene cansado, no s&eacute; si a algunas personas m&aacute;s de la comunidad le est&aacute; pasando pero de vez en cuando o siempre en cada partida se me produce un lag pero es algo raro desde mi punto de vista ya que no se alteran los MS y veo que minions, campeones saltan y va re mal, lo peor es que decido reconectar una y otra vez y eso debe ser peor ya que el LeaverBuster te saciona entonces mi pregunta es &iquest;qu&eacute; puedo hacer? no puedo ni jugar y lo he comentado con algunos cercanos y me dicen que tambi&eacute;n les sucede.","replies":[{"poster":"ronnyd4nce","date":"2016-04-20T00:16:45.696+0000","up_votes":1,"down_votes":0,"body":"Hoy sigue lo mismo, ya se me es imposible jugar.","replies":[]},{"poster":"ronnyd4nce","date":"2016-04-18T23:42:42.276+0000","up_votes":1,"down_votes":0,"body":"Es que no es en fps tampoco como tú dices Sergan ya que tengo 200 fps y un internet de 50 megas entonces lo veo complicado por lo tanto sigo pensando que fuera el servidor del juego o algo así, no sé que onda pero llevo dos partidas y las dos las pierdo por este fenómeno loco, ya voy bien cabreado.","replies":[{"poster":"matixzz","date":"2016-04-19T01:00:00.201+0000","up_votes":1,"down_votes":0,"body":"Bueno, yo soy de Chile y hace rato que el server anda extraño, mi internet no es(40 megas) siempre hay delay en el server, a mi premades también les ocurre asi que si, es problema del server.","replies":[]}]},{"poster":"Sergan","date":"2016-04-18T23:40:59.326+0000","up_votes":1,"down_votes":0,"body":"Puede ser lag o puede ser que tienes una desincronizacion de imagen entre el juego y tu monitor que a veces tambien genera esos saltos, para verificar pon ESC en medio de una partida y te vas a opciones graficas y activas el ticket de \"sincronizacion vertical\" o similar, esta casi al ultimo cerca donde limitas los FPS (a veces dejarlo en 80 tambien ayuda) y descarta que sea eso que a veces ocurre que es un error que se parece al lag pero no lo es.","replies":[]},{"poster":"dinamoooo","date":"2016-04-18T23:28:58.123+0000","up_votes":1,"down_votes":0,"body":"y bueno habra que pasarse al dota xd","replies":[]},{"poster":"Pititoh Kawaii ","date":"2016-04-18T23:18:08.904+0000","up_votes":1,"down_votes":0,"body":"Me pasa exactamente lo mismo.","replies":[]}]}