{"poster":"Nabuze","date":"2018-04-24T01:10:27.032+0000","title":"Iconos exclusivos por llegar al millón de maestria","subforum":"Charlas Generales","up_votes":3,"down_votes":1,"body":"Un icono exclusivo que refleje el mill&oacute;n de maestr&iacute;a con alg&uacute;n champ.\r\nCreo que llegar al mill&oacute;n de maestr&iacute;a es un logro que merece recompensa ustedes que creen?","replies":[{"poster":"DIOS TUTI","date":"2018-04-24T01:25:13.046+0000","up_votes":1,"down_votes":0,"body":"es que no importan los puntos de maestria, ni la maestria 7..\n\ndeberian darles como un extra a la maestria para los que esten en el top 10 con el champ\n\nporque mira esto https://www.masterypoints.com/highscores/champion\n\nla gente esa juega por jugar (sacando los diamantes 5), no juega para mejorar, ni para lograr algo, solo juegan.","replies":[{"poster":"Nabuze","date":"2018-04-24T01:41:46.162+0000","up_votes":1,"down_votes":0,"body":"Tu y yo sabemos que ser maestría 7 o tener millones de puntos no significa que seas necesariamente bueno con un champ pero este logro no pretende demostrar que alguien es mejor sino que lograste encontrar ese campeón que tanto te gusta y que nunca te cansarás de jugar.\n\nNo todo es cuestión de jerarquía ranked ranked ranked.","replies":[{"poster":"DIOS TUTI","date":"2018-04-24T02:43:53.445+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Nabuze,realm=LAS,application-id=v7qsfXsE,discussion-id=ywBb4AAn,comment-id=00010000,timestamp=2018-04-24T01:41:46.162+0000)\n>\n> Tu y yo sabemos que ser maestría 7 o tener millones de puntos no significa que seas necesariamente bueno con un champ pero este logro no pretende demostrar que alguien es mejor sino que lograste encontrar ese campeón que tanto te gusta y que nunca te cansarás de jugar.\n> \n> No todo es cuestión de jerarquía ranked ranked ranked.\n\ny si mejor, ponen un extra en la pantalla de carga a la derecha del honor (donde iria la maestria, pero a la derecha) a los 10 que tienen mas puntos de maestria con x champ y que den otro para los 10 mejores jugadores con x champ? y todos contentos.\n\ndecis que no todo es cuestion de rankeds, pero si vos queres mejorar, llegar a lo mas alto, no hay otro camino que rankear, es asi.\nahora, si te da igual lo competitivo y solo lo tomas como un jueguito, esta bien.","replies":[{"poster":"Nabuze","date":"2018-04-24T03:45:07.230+0000","up_votes":1,"down_votes":0,"body":"Tenés que estar preso del juego si querés llegar a lo más alto 1 partida por día si o si o acumular 10 que fácil no es si tenés otras cosas que hacer. Tenés que estar bien al dope para llegar a challenger.\n\nRespecto a lo otro... Nunca miro la pantalla de carga a menos que sea ranked.\n Yo decía un icono exclusivo o algo para poner en el perfil para los que disfrutan mucho de sólo un champ. Sólo es personalización de perfil así se desarrolla un poco ese tema que hasta ahora en el pbe sólo podés poner skins.\n\nEs un poco de contenido para los casuales algo que se obtiene por jugar mucho tiempo con el champ que amas y no por ser el mejor con el.\nLos otp me entenderán xD","replies":[]}]}]}]},{"poster":"Mazoku","date":"2018-04-24T01:24:55.330+0000","up_votes":1,"down_votes":4,"body":"No me gusta la idea porque no considero un logro llegar a un millon de puntos de maestria con algun campeon.","replies":[]}]}