{"poster":"oroora6","date":"2016-05-17T10:07:14.341+0000","title":"tryndamere è giocabile con le ultime patch","subforum":"Discussioni generali","up_votes":2,"down_votes":2,"body":"mi &egrave; venuta voglia di usare questo buon vecchio champion, non lo uso da tanto per cui mi chiedevo se con le ultime patch sia utilizzabile o totalmente inutile, so che ha problemi in teamfight, consigli per build/ strategie?\r\ngrazie in anticipo =3","replies":[{"poster":"Nibbio Bianco","date":"2016-05-17T10:13:42.653+0000","up_votes":1,"down_votes":0,"body":"Domani con la nuova patch ci sarà il buff agli artigli rossi, il nuovo oggetto da jungler, secondo me potrebbe funzionare perfettamente in quel ruolo, sopratutto in un meta dove si prediligono campioni con un early game molto forte, come kindred, nidalee e graves.","replies":[{"poster":"Darth Ponzius","date":"2016-05-17T11:16:51.716+0000","up_votes":1,"down_votes":0,"body":"e con un early game molto forte come meta tu gli consigli di usare Tryndamere in giungla?","replies":[{"poster":"vondarck","date":"2016-05-17T11:26:06.028+0000","up_votes":1,"down_votes":0,"body":"neanche io ho capito..\nnon mi smebra che abbia sto early no sens..\n\n+ che altro temo il suo hard snowbaling con:\n{{item:1416}} {{item:3153}} {{item:3006}} {{item:3124}} {{item:3046}} {{item:3072}}","replies":[]},{"poster":"Nibbio Bianco","date":"2016-05-17T11:25:18.049+0000","up_votes":1,"down_votes":0,"body":"> [{quoted}](name=Darth Ponzius,realm=EUW,application-id=MJVj50Jw,discussion-id=AEdPxW3a,comment-id=00000000,timestamp=2016-05-17T11:16:51.716+0000)\n>\n> e con un early game molto forte come meta tu gli consigli di usare Tryndamere in giungla?\n\nBeh, Tryndamere ha la possibilità di crittare in 1vs1, che può dargli un vantaggio enorme, ma sopratutto nella patch 6.9 la Riot ha cambiato la meccanica della torre, vale a dire che durante i tower dive più colpi dà la torre e più il colpo successivo farà male, soltanto che nelle patch 6.8 ed inferiore quando una persona perdeva l'aggro della torre, il danno bonus si resettava, ora invece il danno bonus passa al nuovo target. Ciò significa che i campioni che possono fare towerdive dalla patch 6.9+ possono ufficialmente considerarsi dei buoni pick, e Tryndamere è uno di questi. Certamente, se fai towerdive senza un minimo di logica, sicuramente finirà male anche a te, però se te la giochi bene, attualmente Tryndamere appartiene ad una cerchia ristretta di campioni che può fare towerdive.","replies":[{"poster":"Darth Ponzius","date":"2016-05-17T12:58:39.573+0000","up_votes":1,"down_votes":1,"body":"Ma nel jungler che è forte in early rientra molto il fatto che hanno migliori possibilità di portare un gank alla sua riuscita, Trynda a parte un mediocre slow non ha una ceppa e deve sperare di mettere un crit o aspettare il 6 per provare un tower dive che non mi pare proprio il massimo dell'efficenza. Senza contare che in 1 vs 1 già i tre di cui hai parlato lo distruggono senza neanche avere grossi pericoli in ritorno.","replies":[{"poster":"Nibbio Bianco","date":"2016-05-17T13:14:10.207+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Darth Ponzius,realm=EUW,application-id=MJVj50Jw,discussion-id=AEdPxW3a,comment-id=0000000000000000,timestamp=2016-05-17T12:58:39.573+0000)\n>\n> Ma nel jungler che è forte in early rientra molto il fatto che hanno migliori possibilità di portare un gank alla sua riuscita, Trynda a parte un mediocre slow non ha una ceppa e deve sperare di mettere un crit o aspettare il 6 per provare un tower dive che non mi pare proprio il massimo dell&#x27;efficenza. Senza contare che in 1 vs 1 già i tre di cui hai parlato lo distruggono senza neanche avere grossi pericoli in ritorno.\n\nLo slow di tryndamere non è mediocre: a livello 1 dura 4 secondi e ti dà 30% slow. Non è lento a pulire i campi, ha una cura, ha mobilità ed una ultimate da towedive. Tutto ciò che un campione deve avere per essere efficiente in giungla in questo meta. Che non sia uno dei migliori è discutibile, visto che bisognerebbe controllare l'efficienza degli artigli rossi dopo il suo buff, a quel punto se ne potrebbe parlare... però sicuramente nell'attuale meta non è un pick consigliato in toplane, visto che comunque in top c'è bisogno di pick resistenti. Volendo aggiungere altro, è il campione con scaling migliori con la guinsoo, ha una cura da 150% scaling ap e la E con 100% scaling AP... veramente alti. Bisognerebbe provarlo per giudicare, a mio parere... io ho solo detto che POTREBBE funzionare, ma potrei sbagliarmi.","replies":[{"poster":"Darth Ponzius","date":"2016-05-17T14:43:08.019+0000","up_votes":1,"down_votes":1,"body":"Uno slow del 30% se sei girato di spalle verso di lui e una ulti che dia invicibilità dal livello 6 per te è sufficiente per essere un buon early jungler? Il suo danno è troppo condizionato dal fatto di dover crittare. Non lo è mai stato in meta dove il devourer era op non vedo perchè dovrebbe ora. Senza contare che se devo prendere qualcuno con mezzo slow prendo altro francamente, anche Xin risulta più utile. Dai troppo peso ad un tower dive che dovrebbe essere fatto solo a certe condizioni e non risulta decisamente la regola.\nE poi il top \"resistente\" non è neanche più la regola tra nerf vari e buff al cinderhulk.\nLe uniche volte in cui Trynda risulta essere un jungler decente è quando l'oggetto da jungler è fuori scala altrimenti ci sono una miriade di pick migliori di lui.","replies":[{"poster":"Nibbio Bianco","date":"2016-05-17T16:07:41.167+0000","up_votes":1,"down_votes":1,"body":"> [{quoted}](name=Darth Ponzius,realm=EUW,application-id=MJVj50Jw,discussion-id=AEdPxW3a,comment-id=000000000000000000000000,timestamp=2016-05-17T14:43:08.019+0000)\n>\n> Uno slow del 30% se sei girato di spalle verso di lui e una ulti che dia invicibilità dal livello 6 per te è sufficiente per essere un buon early jungler? Il suo danno è troppo condizionato dal fatto di dover crittare. Non lo è mai stato in meta dove il devourer era op non vedo perchè dovrebbe ora. Senza contare che se devo prendere qualcuno con mezzo slow prendo altro francamente, anche Xin risulta più utile. Dai troppo peso ad un tower dive che dovrebbe essere fatto solo a certe condizioni e non risulta decisamente la regola.\n> E poi il top &quot;resistente&quot; non è neanche più la regola tra nerf vari e buff al cinderhulk.\n> Le uniche volte in cui Trynda risulta essere un jungler decente è quando l&#x27;oggetto da jungler è fuori scala altrimenti ci sono una miriade di pick migliori di lui.\n\nPoter towedivare è una cosa importante. Se il team avversario si riempe di campioni con un early scarso, un mid decente e un late forte, se non puoi towerdivarli sei fregato, perché loro farmano molto semplicemente sotto torre mentre tu non puoi far altro che cercare di countergankare il jungler avversario e rubare nella giungla avversaria mentre è impegnato nelle lane... So bene che non è mai stato un jungler forte in quella categoria di campioni, (rispetto magari a Master Yi, Xin Zhao, Warwick, Nocturne, ecc...) ma per me risulta essere un pick migliore in giungla rispetto in top, nello stato attuale delle cose... alla fine il thread chiede proprio come giocare Tryndamere, e secondo me, attualmente sta meglio in giungla.","replies":[]}]}]}]}]}]}]},{"poster":"Zarath Jedi","date":"2016-05-17T12:51:35.708+0000","up_votes":1,"down_votes":1,"body":"so che vorresti sentirti dire che trinda è un op champ carria di brutto ecc... ma la verità è che trinda fa cagare, non carria non aiuta il team e non fa un cazzo, parola di francesco amadori","replies":[]}]}